{"patent_id": "10-2022-0009415", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0108182", "출원번호": "10-2022-0009415", "발명의 명칭": "AR 객체를 표시하는 전자 장치 및 그 방법", "출원인": "삼성전자주식회사", "발명자": "채상원"}}
{"patent_id": "10-2022-0009415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "증강 현실 장치에 있어서,디스플레이;카메라;센서; 및상기 디스플레이, 상기 센서, 및 상기 카메라와 작동적으로 연결된 프로세서를 포함하고,상기 프로세서는:상기 센서를 이용하여 사용자의 시선 방향을 검출하고,상기 카메라를 이용하여 상기 사용자의 시선 방향의 제1 이미지를 촬영하고,상기 촬영된 제1 이미지에 포함된 제1 객체(object)를 인식하고,상기 인식한 제1 객체가 속하는 제1 콘텐츠(content) 분류 정보를 포함하는 제1 객체 데이터를 생성하고,상기 제1 객체 데이터에 기초하여, 상기 제1 콘텐츠 분류 정보에 대한 우선 순위를 포함하는 제1 우선 순위 데이터를 획득하고,상기 획득한 제1 우선 순위 데이터에 기초하여, 상기 카메라를 이용하여 획득된 제1 이미지에 포함된 적어도 하나의 객체 중에서 제1 관심 객체를 선택하고,상기 선택된 제1 관심 객체와 연관된 정보를 포함하는 제1 증강 현실 콘텐츠를 디스플레이 하는, 증강 현실 장치."}
{"patent_id": "10-2022-0009415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 제1 객체 데이터는 상기 사용자가 상기 제1 객체를 인식한 빈도수(frequency), 상기 제1 객체를 인식한 시간(time), 및/또는 상기 제1 객체를 인식한 기간(period)을 포함하는, 증강 현실 장치."}
{"patent_id": "10-2022-0009415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,상기 우선 순위 데이터는 상기 제1 객체를 인식한 빈도수, 상기 제1 객체를 인식한 시간, 및/또는 상기 제1 객체를 인식한 빈도수를 기초로 상기 제1 콘텐츠 분류 정보를 순위화 (ranked) 한 정보를 포함하는, 증강 현실 장치."}
{"patent_id": "10-2022-0009415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서,상기 제1 콘텐츠 분류 정보는 상기 제1 이미지 내의 복수의 객체들 각각을 복수개의 수준(level)으로 카테고리화 하여 분류한, 증강 현실 장치."}
{"patent_id": "10-2022-0009415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서,상기 제1 우선 순위 데이터는 공통 우선 순위 데이터 및 개인 우선 순위 데이터를 포함하고,공개특허 10-2023-0108182-3-상기 공통 우선 순위 데이터는 상기 증강 현실 장치의 사용자 및 다른 외부 장치의 다른 사용자의 입력 정보에기초하여 결정된 우선 순위 정보를 포함하고,상기 개인 우선 순위 데이터는 상기 증강 현실 장치의 상기 사용자가 상기 제1 객체를 인식한 시간(time)을 포함하는, 증강 현실 장치."}
{"patent_id": "10-2022-0009415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 1에 있어서,상기 제1 우선 순위 데이터는 콘텐츠 분류 정보에 대한 상기 디스플레이 상의 노출 정보를 더 포함하고,상기 디스플레이 상의 노출 정보는 상기 증강 현실 장치의 사용자의 연령 및 상기 사용자가 증강 현실 장치에입력한 노출 차단 정보를 포함하는, 증강 현실 장치."}
{"patent_id": "10-2022-0009415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 1에 있어서,상기 제1 증강 현실 콘텐츠는 상기 제1 객체의 정보, 및/또는 상기 제1 객체와 실질적으로 동일한 상기 제1 콘텐츠 분류 정보에 속하는 제2 객체의 정보를 포함하는, 증강 현실 장치."}
{"patent_id": "10-2022-0009415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 1에 있어서,상기 프로세서는:상기 카메라를 이용하여 상기 사용자의 시선 방향의 제2 이미지를 촬영하고,상기 촬영된 제2 이미지에 포함된 제2 객체를 인식하고,상기 인식한 제2 객체가 속하는 제2 콘텐츠 분류 정보를 포함하는 제2 객체 데이터를 추가 생성하고,상기 제2 객체 데이터에 기초하여, 상기 제2 콘텐츠 분류 정보에 대한 우선 순위를 포함하는 제2 우선 순위 데이터를 획득하고,상기 획득한 제2 우선 순위 데이터에 기초하여, 상기 카메라를 이용하여 획득된 제2 이미지에 포함된 적어도 하나의 객체 중에서 제2 관심 객체를 선택하고,상기 제2 관심 객체와 상기 제1 관심 객체 중 우선 순위 값이 큰 값을 가지는지 주요(main) 관심 객체를 식별하고, 상기 우선 순위 값은 상기 제1 관심 객체 및 상기 제2 관심 객체에 대해 상기 사용자가 인식한 시간 값을포함함, 상기 제2 관심 객체가 상기 주요 관심 객체로 선택된 경우, 상기 제2 관심 객체와 연관된 정보를 포함하는 제2증강 현실 콘텐츠를 디스플레이 하는, 증강 현실 장치"}
{"patent_id": "10-2022-0009415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 1에 있어서,상기 프로세서는 상기 생성된 제1 객체 데이터를 서버에 전송하고,상기 전송된 제1 객체 데이터에 기초하여 생성한 상기 제1 우선 순위 데이터를, 상기 서버로부터 획득하는, 증강 현실 장치."}
{"patent_id": "10-2022-0009415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "증강 현실 장치에 있어서,디스플레이;센서;카메라; 공개특허 10-2023-0108182-4-및상기 디스플레이, 상기 센서 및 상기 카메라와 작동적으로 연결된 프로세서를 포함하고,상기 프로세서는:상기 센서를 이용하여 상기 사용자의 시선을 검출하고,상기 카메라를 이용하여 상기 추적한 사용자 시선 방향의 제1 이미지를 획득하고,상기 획득한 제1 이미지 내의 객체들 및 상기 객체들에 대한 상기 사용자의 시선과 관련된 제1 객체 데이터를생성하고,상기 생성된 제1 객체 데이터를 서버로 전송하고,상기 증강 현실 장치로부터 상기 서버로 제공된 상기 제1 객체 데이터 및 적어도 하나의 다른 증강 현실 장치로부터 상기 서버에게 제공된 다른 객체 데이터에 기초하여, 상기 서버에 의해 생성된 공통(common) 우선 순위 데이터를, 상기 서버로부터 수신하고,상기 증강 현실 장치에서 생성된 상기 제1 객체 데이터를 이용하여 상기 공통 우선 순위 데이터로부터 상기 증강 현실 장치의 사용자에 대한 개인화(private) 우선 순위 데이터를 생성하고,상기 개인화 우선 순위 데이터에 기초하여, 상기 제1 이미지 내의 객체들 중에서 상기 사용자의 제1 관심 객체를 선택하고,상기 제1 관심 객체 및 상기 제1 관심 객체와 관련된 추가 정보를 포함하는 증강 현실 콘텐츠를 디스플레이 하는, 증강 현실 장치."}
{"patent_id": "10-2022-0009415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 10에 있어서,상기 제1 객체 데이터는 상기 사용자가 상기 제1 이미지 내의 객체들 각각을 인식한 빈도수(frequency), 상기객체들 각각을 인식한 시간(time), 및/또는 상기 객체들 각각을 인식한 기간(period)을 포함하는, 증강 현실 장치."}
{"patent_id": "10-2022-0009415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 10에 있어서,상기 공통 우선 순위 데이터 및 상기 개인화 우선 순위 데이터는 상기 제1 객체 데이터를 이용하여 상기 제1 이미지 내의 상기 객체들 중 상기 증강 현실 장치의 사용자의 관심도가 높은 객체로 순위화(ranked) 한, 증강 현실 장치."}
{"patent_id": "10-2022-0009415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 10에 있어서,상기 공통 우선 순위 데이터는 상기 증강 현실 장치의 상기 사용자 및 다른 증강 현실 장치의 다른 사용자의 입력 정보에 기초하여 결정된 우선 순위 정보를 포함하는, 증강 현실 장치."}
{"patent_id": "10-2022-0009415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 10에 있어서,상기 개인화 우선 순위 데이터는 상기 증강 현실 장치의 사용자가 상기 제1 이미지 내의 상기 객체들 중 제1 객체를 인식한 시간(time)을 포함하는, 증강 현실 장치."}
{"patent_id": "10-2022-0009415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "청구항 10에 있어서,상기 제1 관심 객체와 관련된 추가 정보는 상기 제1 객체와 실질적으로 동일한 카테고리에 속하는 제2 객체의공개특허 10-2023-0108182-5-정보를 포함하는, 증강 현실 장치."}
{"patent_id": "10-2022-0009415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "증강 현실 장치의 동작 방법에 있어서,센서를 이용하여 사용자의 시선을 검출하는 단계;카메라를 이용하여 검출한 사용자의 시선 방향의 제1 이미지를 획득하는 단계;상기 획득한 제1 이미지 내의 현실 객체들의 정보 및 상기 현실 객체들에 대한 상기 사용자의 시선과 관련된 제1 객체 데이터를 생성하는 단계;상기 생성된 제1 객체 데이터를 서버로 전송하는 단계;상기 증강 현실 장치로부터 상기 서버로 제공된 상기 제1 객체 데이터 및 적어도 하나의 다른 증강 현실 장치로부터 상기 서버에게 제공된 다른 객체 데이터에 기초하여, 상기 서버에 의해 생성된 공통(common) 우선 순위 데이터를, 상기 서버로부터 수신하는 단계;상기 증강 현실 장치에서 생성된 상기 객체 데이터를 이용하여 상기 공통 우선 순위 데이터로부터 상기 증강 현실 장치의 사용자에 대한 개인화(private) 우선 순위 데이터를 생성하는 단계;상기 개인화 우선 순위 데이터에 기초하여, 상기 제1 이미지 내의 객체들 중에서 상기 사용자의 제1 관심 객체를 선택하는 단계; 및상기 제1 관심 객체 및 상기 제1 관심 객체와 관련된 추가 정보를 포함하는 증강 현실 콘텐트를 디스플레이 하는 단계를 포함하는, 증강 현실 장치의 동작 방법."}
{"patent_id": "10-2022-0009415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "청구항 16에 있어서,상기 제1 객체 데이터는 상기 사용자가 상기 제1 이미지 내의 상기 객체들 각각을 인식한 빈도수(frequency),상기 객체들 각각을 인식한 시간(time), 및/또는 상기 객체들 각각을 인식한 기간(period)을 포함하는, 증강 현실 장치의 동작 방법."}
{"patent_id": "10-2022-0009415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "청구항 16에 있어서,상기 공통 우선 순위 데이터는 상기 증강 현실 장치의 상기 사용자 및 다른 증강 현실 장치의 다른 사용자의 입력 정보에 기초하여 결정된 우선 순위 정보를 포함하는, 증강 현실 장치의 동작 방법."}
{"patent_id": "10-2022-0009415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "청구항 16에 있어서,상기 개인화 우선 순위 데이터는 상기 증강 현실 장치의 사용자가 상기 제1 이미지 내의 상기 현실 객체들 중제1 객체를 인식한 시간(time)을 포함하는, 증강 현실 장치의 동작 방법."}
{"patent_id": "10-2022-0009415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "청구항 16에 있어서,상기 제1 관심 객체와 관련된 추가 정보는 상기 제1 객체와 실질적으로 동일한 카테고리에 속하는 제2 객체의정보를 포함하는, 증강 현실 장치의 동작 방법."}
{"patent_id": "10-2022-0009415", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "일 실시 예에 따른 증강 현실 장치는, 디스플레이, 카메라, 센서, 및 상기 디스플레이, 상기 센서, 및 상기 카메 라와 작동적으로 연결된 프로세서를 포함하고, 상기 프로세서는 상기 센서를 이용하여 사용자의 시선 방향을 검 출하고, 상기 카메라를 이용하여 상기 사용자의 시선 방향의 제1 이미지를 촬영하고, 상기 촬영된 제1 이미지에 (뒷면에 계속)"}
{"patent_id": "10-2022-0009415", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시에 따른 다양한 실시 예들은 증강 현실(augmented reality, AR) 객체를 표시하는 전자 장치 및 그 방법 에 관한 것이다."}
{"patent_id": "10-2022-0009415", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "증강 현실(Augmented Reality) 기술이란 컴퓨터 그래픽 기술을 사용하여 현실과 유사한 가상의 공간을 생성하는 가상 현실(Virtual Reality) 기술에서 파생된 기술이다. 증강 현실 기술은, 현실 공간(Reality)과 가상 공간을 결합함으로써, 가상의 물체가 현실 공간에 존재하는 것처럼 보이도록 하는 기술을 말한다. 이러한 증강 현실 기 술은 현실 공간 위에 가상의 이미지를 중첩하여 보여주므로, 현실 공간의 물체에 관한 부가 정보를 제공하기 위 하여 주로 활용되고 있다. 증강현실을 제공하기 위한 전자 장치는, 카메라를 통해 현실의 사물에 대한 프리뷰 이미지를 획득하고, 현실의 사물을 인식(또는 식별(identify))할 수 있다. 전자 장치는 인식된 사물에 기반하여 프리뷰 이미지 상에 증강현 실에 대한 정보(예: 가상의 객체)를 표시할 수 있다. 이러한 증강현실은, 예를 들면, 게임 어플리케이션 (application) 또는 카메라 어플리케이션을 통해서 사용자에게 제공될 수 있으며, 타 사용자와 공유할 수 있다."}
{"patent_id": "10-2022-0009415", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "증강 현실 장치는 사용자에게 제공하는 AR 객체 정보 또는 증강 현실 콘텐츠(contents)와 관련된 상기 사용자의 관심도와 무관하고 불필요한 많은 정보들을 제공할 수 있다. 또한, 사용자의 경험을 증가시키기 위해 증강 현실 장치는 사용자의 관심도가 높은 정보들을 선별하여 제공할 필요가 있다. 다만, 증강 현실 장치는 사용자의 관심도가 높은 정보만을 선별하는 것이 어려울 수 있다. 예를 들어, 사용자의 관심도가 높은 정보를 식별하는 기준이 사용자마다 다를 수 있기 때문에 증강 현실 장치는 사용 자의 관심도가 높은 정보만을 선별하는 것이 어려울 수 있다. 본 문서에서 개시되는 다양한 실시 예들은, 사용자가 원하는 정보만을 선택적으로 제공하는 증강 현실 장치를 제공할 수 있다."}
{"patent_id": "10-2022-0009415", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 문서에 개시되는 다양한 실시 예에 따르면, 증강 현실 장치는 디스플레이, 카메라, 센서, 및 상기 디스플레 이, 상기 센서, 및 상기 카메라와 작동적으로 연결된 프로세서를 포함하고, 상기 프로세서는 상기 센서를 이용 하여 사용자의 시선 방향을 검출하고, 상기 카메라를 이용하여 상기 사용자의 시선 방향의 제1 이미지를 촬영하 고, 상기 촬영된 제1 이미지에 포함된 제1 객체(object)를 인식하고, 상기 인식한 제1 객체가 속하는 제1 콘텐 츠(content) 분류 정보를 포함하는 제1 객체 데이터를 생성하고, 상기 제1 객체 데이터에 기초하여, 상기 제1 콘텐츠 분류 정보에 대한 우선 순위를 포함하는 제1 우선 순위 데이터를 획득하고, 상기 획득한 제1 우선 순위 데이터에 기초하여, 상기 카메라를 이용하여 획득된 제1 이미지에 포함된 적어도 하나의 객체 중에서 제1 관심 객체를 선택하고, 상기 선택된 제1 관심 객체에 대한 정보를 포함하는 제1 증강 현실 콘텐츠를 디스플레이 할 수 있다. 본 문서에 개시되는 다양한 실시 예에 따르면, 증강 현실 장치는 디스플레이, 센서, 카메라, 및 상기 디스플레 이, 상기 센서 및 상기 카메라와 작동적으로 연결된 프로세서를 포함하고, 상기 프로세서는 상기 센서를 이용하 여 상기 사용자의 시선을 검출하고, 상기 카메라를 이용하여 상기 추적한 사용자 시선 방향의 제1 이미지를 획 득하고, 상기 획득한 제1 이미지 내의 객체들 및 상기 객체들에 대한 상기 사용자의 시선과 관련된 제1 객체 데 이터를 생성하고, 상기 생성된 제1 객체 데이터를 서버로 전송하고, 상기 증강 현실 장치로부터 상기 서버로 제 공된 상기 제1 객체 데이터 및 적어도 하나의 다른 증강 현실 장치로부터 상기 서버에게 제공된 다른 객체 데이 터에 기초하여, 상기 서버에 의해 생성된 공통(common) 우선 순위 데이터를, 상기 서버로부터 수신하고, 상기 증강 현실 장치에서 생성된 상기 제1 객체 데이터를 이용하여 상기 공통 우선 순위 데이터로부터 상기 증강 현 실 장치의 사용자에 대한 개인화(private) 우선 순위 데이터를 생성하고, 상기 개인화 우선 순위 데이터에 기초 하여, 상기 제1 이미지 내의 객체들 중에서 상기 사용자의 제1 관심 객체를 선택하고, 상기 제1 관심 객체 및 상기 제1 관심 객체와 관련된 추가 정보를 포함하는 증강 현실 콘텐츠를 디스플레이 할 수 있다. 본 문서에 개시되는 다양한 실시 예에 따르면, 증강 현실 장치의 동작 방법은 센서를 이용하여 사용자의 시선을 검출하는 단계, 카메라를 이용하여 검출한 사용자의 시선 방향의 제1 이미지를 획득하는 단계, 상기 획득한 제1 이미지 내의 현실 객체들의 정보 및 상기 현실 객체들에 대한 상기 사용자의 시선과 관련된 제1 객체 데이터를 생성하는 단계, 상기 생성된 제1 객체 데이터를 서버로 전송하는 단계, 상기 증강 현실 장치로부터 상기 서버로제공된 상기 제1 객체 데이터 및 적어도 하나의 다른 증강 현실 장치로부터 상기 서버에게 제공된 다른 객체 데 이터에 기초하여, 상기 서버에 의해 생성된 공통(common) 우선 순위 데이터를, 상기 서버로부터 수신하는 단계, 상기 증강 현실 장치에서 생성된 상기 객체 데이터를 이용하여 상기 공통 우선 순위 데이터로부터 상기 증강 현 실 장치의 사용자에 대한 개인화(private) 우선 순위 데이터를 생성하는 단계, 상기 개인화 우선 순위 데이터에 기초하여, 상기 제1 이미지 내의 객체들 중에서 상기 사용자의 제1 관심 객체를 선택하는 단계, 및 상기 제1 관 심 객체 및 상기 제1 관심 객체와 관련된 추가 정보를 포함하는 증강 현실 콘텐트를 디스플레이 하는 단계를 포 함할 수 있다."}
{"patent_id": "10-2022-0009415", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 문서에 개시되는 다양한 실시 예에 따른 전자 장치 및 그 방법은 증강 현실 장치를 사용하는 사용자의 관심 이 높은 정보만을 선별적으로 디스플레이 할 수 있다. 본 문서에서 개시되는 다양한 실시 예에 따르면, 증강 현실 서비스를 제공받는 사용자에 대한 선호도와 관련된 정보를 효율적으로 수집할 수 있는 전자 장치 및 그 방법이 제공될 수 있다. 또한 다양한 실시 예에 따르면, 증강 현실 장치는 사용자에게 불필요한 정보를 배제할 수 있다. 또한 다양한 실시 예에 따르면, 증강 현실 장치는 일관된 정보를 기준으로 사용자의 관심도가 높은 정보를 식별 할 수 있다. 또한 다양한 실시 예에 따르면, 증강 현실 장치는 사용자의 관심도가 높은 정보를 제공함과 동시에 광고를 제공 하는 제3가 원하는 정보를 추가 제공할 수 있다. 이 외에, 본 문서를 통해 직접적 또는 간접적으로 파악되는 다양한 효과들이 제공될 수 있다."}
{"patent_id": "10-2022-0009415", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 다양한 실시 예가 첨부된 도면을 참조하여 기재된다. 그러나, 이는 본 발명을 특정한 실시 형 태에 대해 한정하려는 것이 아니며, 본 발명의 실시 예의 다양한 변경(modification), 균등물(equivalent), 및/ 또는 대체물(alternative)을 포함하는 것으로 이해되어야 한다. 도 1은 일 실시 예에 따른, 증강 현실 장치 및 서버를 도시한 도면이다. 일 실시 예에 따르면, 증강 현실 장치는 비젼 처리 모듈(vision processing module, 110) 및 서비스 처리 모듈(service processing module, 120)을 포함할 수 있다. 일 예에서, 증강 현실 장치의 비젼 처리 모듈은 카메라 모듈(camera module) 및 프레임 워크(frame work)처럼 사용자의 시각과 관련된 구성을 포함하는 모듈로 형성될 수 있다. 예를 들어, 비젼 처리 모듈은 증강 현실 장치가 제공하는 증강 현실의 장면에 포함되는 현실 객체에 대한 정보를 저장하는 모듈로 형성 될 수 있다. 일 실시 예에 따르면, 후술하는 현실 객체는 카메라 모듈을 통해서 촬영된 이미지 또는 영상에 나타나며, 센서 또는 프로세서에 의해 인식된 피사체를 의미할 수 있다. 예를 들어, 현실 객체는 카메라 모듈을 통해 촬영된 영 상에 등장하는 사람을 의미할 수 있다. 일 실시 예에 따르면, 증강 현실 장치의 서비스 처리 모듈은 서버와 증강 현실 장치 내에 저장된 정보를 교환하는 서비스 처리 모듈로 형성될 수 있다. 예를 들어, 서비스 처리 모듈은 증강 현실 장치의 사용자가 인식한 현실 객체에 대해 사용자가 선호하는 관심 객체만을 서버와 함께 선별 하거나 서버와 통신하는 모듈로 형성될 수 있다. 일 실시 예에 따르면, 비젼 처리 모듈은 현실 객체를 인식하는 감지 모듈(detection module, 111) 및 메모 리(memory, 112)를 포함할 수 있다. 일 예에서, 감지 모듈은 증강 현실 장치의 카메라가 획득한 영상 을 통해 현실 객체를 인식하는 모듈로 형성될 수 있다. 예를 들어, 감지 모듈은 카메라, 및 센서를 포함할 수 있다. 일 예에서, 메모리는 상기 인식한 현실 객체에 대한 정보를 저장하는 모듈로 형성될 수 있다. 일 실시 예에 따르면, 서비스 처리 모듈은 통신 모듈과 콘텐츠 제공 모듈을 포함할 수 있다. 일 실시 예에 따르면, 통신 모듈은 외부 전자 장치 또는 서버와 커뮤니케이션하는 모듈로 형성될 수 있다. 일 예에서, 통신 모듈은 후술하는 객체 데이터를 서버로 제공하거나 서버가 생성한 우선 순위 데이터를 수신하는 모듈로 형성될 수 있다. 일 실시 예에 따르면, 콘텐츠 제공 모듈은 상기 외부 전자 장치 또는 상기 서버로부터 받은 정보를 증강 현실 장치에 제공하는 모듈로 형성될 수 있다. 예를 들어, 콘텐츠 제공 모듈은 서버로부터 수신한 우선 순 위 데이터에 기반하여 증강 현실 장치의 사용자가 선호하는 AR 객체 또는 증강 현실 콘텐츠를 사용자에게 제공하는 모듈로 형성될 수 있다. 일 실시 예에 따르면, 증강 현실 장치는 비젼 처리 모듈 및 서비스 처리 모듈을 포함함으로써, 사용자의 시선 추적을 통해 사용자가 바라보는 장소의 정보 또는 사용자의 시야에 있는 영상 내 객체에 대한 정 보를 사용자에게 제공할 수 있다. 일 실시 예에 따르면, 증강 현실 장치를 구성하는 모듈을 비젼 처리 모듈과 서비스 처리 모듈을 예시로 들어 설명하였으나, 이에 한정하지 않는다. 예를 들어, 서비스 처리 모듈의 콘텐츠 제공 모듈(12 2)은 증강 현실 콘텐츠를 사용자에게 시각적으로 제공하는 디스플레이 모듈(display module)을 더 포함할 수 있 다. 일 실시 예에 따르면, 서버는 증강 현실 장치와 통신 모듈을 통해 통신하여 증강 현실 장치의 정보를 송신 및 수신할 수 있다. 일 실시 예에 따르면, 서버는 복수의 데이터를 저장할 수 있다. 일 예에서, 서버는 증강 현실 장치 로부터 현실 객체에 대한 객체 데이터를 수신하여 저장할 수 있다. 예를 들어, 증강 현실 장치는 인 식한 제1 객체에 대한 정보를 포함하는 제1 객체 데이터를 생성하여 서버로 전송할 수 있다. 예를 들어, 제1 객 체 데이터를 수신한 서버는 서버내에 제1 객체 데이터를 저장할 수 있다. 일 실시 예에 따르면, 서버는 상기 수신한 객체 데이터를 기반으로 사용자가 선호하는 현실 객체의 우선 순위를 선별한 우선 순위 데이터를 생성하여 증강 현실 장치에 제공할 수 있다. 다시 말해서, 서버는 증강 현실 장치에서 인식한 복수의 현실 객체 중 사용자의 관심도가 높은 관심 객체를 선별하는 우선 순위 데이터를 생산하는 모듈로 형성될 수 있다. 일 실시 예에 따르면, 객체 데이터 및 우선 순위 데이터의 생성 과정을 증강 현실 장치와 서버의 관 계에서 설명하였으나 이에 한정하지 않는다. 예를 들어, 증강 현실 장치가 서버로 객체 데이터를 전 송하지 않고, 증강 현실 장치 스스로가 제1 객체에 대한 제1 객체 데이터를 기반으로 우선 순위 데이터를 생성할 수 있다. 객체 데이터 및 우선 순위 데이터에 관한 구체적인 실시예는 도 4 내지 도 10에서 상세히 후술하기로 한다. 도 2는 일 실시 예에 따른 전자 장치의 블록도이다. 도 2를 참조하면, 전자 장치는, 프로세서, 카메라, 센서, 디스플레이, 메모리 및/또는 통신 모듈을 포함할 수 있다. 다양한 실시 예에서, 전자 장치는 도 2에 도시된 구성요소 외 에 추가적인 구성요소를 포함하거나, 도 2에 도시된 구성요소 중 적어도 하나를 생략할 수 있다. 일 실시 예에 따르면, 프로세서는 메모리에 저장된 인스트럭션들을 이용하여 전자 장치의 적어 도 하나의 다른 구성요소들의 제어 및/또는 통신에 관한 연산이나 데이터 처리를 실행할 수 있다. 일 실시 예에 따르면, 프로세서는 중앙처리장치(CPU), 그래픽처리장치(GPU), MCU(micro controller unit), 센서허브, 보조프로세서(supplementary processor), 통신프로세서(communication processor), 애플리케이션 프로세서 (application processor), ASIC(application specific integrated circuit), 및 FPGA(field programmable gate arrays) 중 적어도 하나를 포함할 수 있으며, 복수의 코어를 가질 수 있다. 일 실시 예에 따르면, 프로세서는, 메모리에 저장된 어플리케이션(예: 증강현실 어플리케이션)을 실 행할 수 있다. 일 실시 예에 따르면, 프로세서는 증강현실 어플리케이션이 실행된 상태에서, 카메라 를 이용하여 이미지를 획득할 수 있다. 일 실시 예에 따르면, 프로세서는 증강현실 어플리케이션이 실행된 상태에서, 이미지에 중첩되거나(superimposed on) 또는 플로팅되는(floated on), 증강현실(AR) 객체를 제공할 수 있다. 본 명세서에서 기술되는 어플리케이션은, 증강현실 어플리케이션에 한정되는 것은 아니며, 카메라 를 이용하는 임의의 어플리케이션일 수 있다. 일 실시 예에 따르면, 프로세서는 AR 객체를 표시할 위치(position)(예: 좌표)를 결정하기 위해 영상을 분 석할 수 있다. 예를 들면, 프로세서는 영상에 포함된 객체(예: 사람)와 배경을 구분하거나 영상에 관한 특 징점을 추출할 수 있다. 일 실시 예에 따르면, 프로세서는 추출된 특징점에 기반하여 영상에 포함된 사람 의 눈, 코, 입, 머리, 몸통 또는 동작(gesture)(또는 자세)을 식별(identify)(또는 인식(recognize))할 수 있 다. 일 실시 예에 따르면, 일 실시 예에 따르면, 프로세서는 추출된 특징점에 기반하여 영상에 포함된 과 일의 색, 또는 크기를 식별(identify)(또는 인식(recognize))할 수 있다. 일 실시 예에 따르면, 프로세서 는 영상의 구성(예: 배경, 사람, 동작)에 대응하는 AR 객체를 상기 구성에 대응하는 위치에 표시할 수 있다. 일 실시 예에 따르면, 프로세서는 증강현실 어플리케이션을 통해 영상(image)(예: 정지 영상(still image) 및 동영상(moving image or video))을 획득(또는 촬영)하는 것에 기반하여, 영상 및 영상과 관련된 AR 객체에 관한 정보를 함께 메모리에 저장할 수 있다. 예를 들면, 동영상과 관련된 AR 객체에 관한 정보는 동영상의 프레임마다 표시할 AR 객체의 종류 및 좌표를 포함할 수 있다. 프로세서의 동작과 관련된 구체적인 내용은 도 4를 참조하여 후술한다. 일 실시 예에 따르면, 카메라는 영상(예: 정지 영상 및 동영상)을 획득(acquire)(또는 촬영)할 수 있다. 예를 들면, 카메라와 전기적으로 연결되는 이미지 시그널 프로세서(미도시)는, 영상(예: 프리뷰 영상 또는 메모리에 저장된 영상)에 포함된 객체(예: 사람)와 배경을 구분할 수 있다. 이미지 시그널 프로세서는 영 상(예: 프리뷰 영상 또는 메모리에 포함된 영상)에 관한 특징점을 추출할 수 있다. 일 실시 예에 따르면, 특징점은 영상에 포함된 사람의 얼굴(예: 눈, 코, 입 등) 또는 동작(또는 자세)을 식별(또는 인식)하기 위해 이 용될 수 있다. 이미지 시그널 프로세서는 카메라로부터 분리되거나, 프로세서의 일부로서 구현될 수 있다. 일 실시 예에 따르면, 카메라는 이미지 센서를 포함할 수 있다. 일 실시 예에 따르면, 이미지 센서 는 색상 정보를 획득 및 처리할 수 있다. 일 실시 예에 따르면, 센서는 전자 장치의 자세 및 위치 중 적어도 하나를 감지할 수 있다. 일 실시 예에 따르면, 센서는, 물리량을 계측하여 전기 신호로 변환하거나 데이터 값을 생성할 수 있다. 일 실시 예에 따르면, 센서는, 전기 신호 또는 데이터 값을 이용하여, 전자 장치의 자세 또는 자세의 변화를 검출할 수 있다. 일 실시 예에 따르면, 센서는, 자이로 센서(gyro sensor)(또는 자이로스코프 (gyroscope)), 중력 센서, 지자기 센서 또는 가속도 센서(acceleration sensor) 중 적어도 하나를 포함할 수 있다. 다양한 실시 예에 따르면, 자이로 센서, 중력 센서, 지자기 센서, 가속도 센서, 또는 이들 중 둘 이상의 결합은, 전자 장치의 회전(rotation), 전자 장치의 방향(orientation)의 변화, 또는 전자 장치(10 0)의 기울기를 감지(sense)함으로써, 센서의 동작들을 수행할 수 있다. 일 실시 예에 따르면, 센서는 프로세서, 카메라, 또는 메모리와 작동적으로 연결되어 색상 정보, 3D 정보, 거리 정보, 또는 위치 정보에 관한 처리를 할 수 있다. 일 실시 예에 따르면, 통신 모듈은, 전자 장치와 외부 전자 장치(예: AR 객체의 제공과 관련된 서버) 사이의 통신 링크를 수립할 수 있고, 수립된 통신 링크를 통한 통신을 수행할 수 있다. 일 실시 예에 따르면, 통신 모듈은, 전자 장치의 자세 정보 및 위치 정보 중 적어도 하나를 포함하는 센싱 정보, 카메라 를 통해 획득된 장면 정보, 및/또는 사용자 입력에 따라 생성된 가상 객체 정보를 서버에게 송신할 수 있다. 일 실시 예에 따르면, 통신 모듈은, 서버로부터 전자 장치의 자세 정보 및 위치 정보 중 적어도 하나를 포함하는 센싱 정보, 카메라를 통해 획득된 장면 정보 및/또는 사용자 입력에 따라 생성 된 가상 객체 정보를 수신할 수 있다. 일 실시 예에 따른, 디스플레이는 카메라를 통해 획득되는 영상을 표시할 수 있다. 일 실시 예에 따 르면, 디스플레이는, 영상에 중첩되거나(superimposed on) 플로팅되는(floated on) AR 객체를 표시할 수 있다. 일 실시 예에 따르면, 전자 장치는 디스플레이를 통해 사용자의 입력을 획득할 수 있고, 사용 자의 입력을 프로세서에 전달할 수 있다. 일 실시 예에 따르면, 메모리는, 하나 이상의 메모리 집합을 의미할 수 있다. 일 실시 예에 따르면, 메모 리는, 다른 구성 요소들(예: 프로세서, 카메라, 센서, 디스플레이, 또는 통신 모듈 )로부터 수신되거나 다른 구성요소들에 의해 생성된 데이터 및/또는 명령을 저장할 수 있다. 다양한 실시 예 들에서, 메모리는, 카메라를 이용하는 어플리케이션(예: 증강현실 어플리케이션)을 저장할 수 있 다. 일 실시 예에 따르면, 메모리는, 복수의 AR 객체들을 저장할 수 있다. 도 3은 일 실시 예에 따른, 증강 현실 장치를 도시한다. 일 실시 예에 따른, 도 3은 증강 현실 장치를 통해 바라보는 현실 세계의 이미지를 도시한다. 도 3을 참고하면, 증강 현실 장치는 현실 세계에 대한 증강 현실 콘텐츠를 제공할 수 있다. 일 실시 예에 따르면, 증강 현실 장치는 사용자의 안면부(顔面部)에 착용하는 안경 형상의 증강 현실 안경 장치(Augmented Reality Glasses)로 형성될 수 있으나, 이에 한정하지 않는다. 예를 들어, 증강 현실 장치 는 두부(頭部)에 착용하는 헤드 마운트 디스플레이 장치 (HMD: Head Mounted Display Apparatus)나, 증강 현실 헬멧(Augmented Reality Helmet)로 형성될 수 있다. 다른 예를 들면, 증강 현실 장치는 카메라를 이용하여 획득된 이미지에 증강 현실 객체를 오버랩한 화면을 디스플레이를 통해서 표시하는 장치일 수 있다. 예를 들어, 증강 현실 장치는 휴대용 통신 장치(예: 스마 트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨어러블 장치, 또는 가전 장치를 포 함할 수 있다. 일 실시 예에 따르면, 증강 현실 장치는 현실 객체에 대한 증강 현실 콘텐츠를 디스플레이 할 수 있다. 일 예에서, 증강 현실 콘텐츠는 상기 현실 객체에 대한 광고 영상을 포함할 수 있다. 예를 들어, 사용자가 현실 세계의 전자 장치(예: 스마트 폰(smart-phone))를 바라보았을 때, 증강 현실 장 치는 상기 전자 장치의 광고 영상에 관한 증강 현실 콘텐츠를 디스플레이 할 수 있다. 도 3에 도시된 증강 현실 장치가 제공하는 증강 현실 콘텐츠는 하나의 광고를 예시로 들어 설명하였 으나, 이에 한정하지 않는다. 예를 들어, 증강 현실 장치는 복수의 광고를 디스플레이 할 수 있다. 또 다 른 예를 들어, 증강 현실 장치는 현실 객체의 가격 및 크기와 같은 증강 현실 콘텐츠를 디스플 레이 할 수 있다. 도 4는 일 실시 예에 따른, 증강 현실 장치가 증강 현실 콘텐츠를 디스플레이 하는 것을 나타낸 흐름도이다. 일 실시 예에 따르면, 증강 현실 장치는 프로세서, 카메라, 센서, 디스플레이, 메모 리, 및 통신 모듈을 포함할 수 있다. 일 실시 예에 따르면, 프로세서는 디스플레이, 센서, 및 카메라와 작동적으로 (operatively) 연결될 수 있다. 도 4를 참조하면, 일 실시 예에 따른 프로세서는 동작 410에서 센서를 이용하여 증강 현실 장치(10 0)의 사용자의 시선을 검출할 수 있다. 일 예에서, 프로세서는 사용자의 시선을 추적하는 시선 추적 센서 를 이용하여 증강 현실 장치의 사용자가 바라보는 시선 방향을 검출할 수 있다. 예를 들어, 시선 추 적 센서는 증강 현실 장치의 내부에 위치한 광 반사부 및 광 수신부를 이용하여 사용자의 시선 방향 을 검출할 수 있다.일 실시 예에 따르면, 동작420에서 프로세서는 카메라를 이용하여 시선 방향의 제1 이미지를 촬영할 수 있다. 일 실시 예에 따르면, 상기 제1 이미지는 도 3에 도시된 현실 세계의 일 이미지를 의미할 수 있 다. 일 예에서, 프로세서는 카메라를 이용하여 사용자의 시선 방향에 위치한 현실 객체(예: 가 구, 가전, 벽면, 배경)를 포함하는 제1 이미지를 촬영할 수 있다. 일 실시 예에 따르면, 동작 430에서 프로세서는 상기 촬영된 제1 이미지에 포함된 제1 객체(object)를 인 식할 수 있다. 일 실시 예에 따르면, 상기 제1 객체는 도 3에 도시된 현실 객체를 참조할 수 있다. 일 예 에서, 상기 촬영된 제1 이미지는 복수의 현실 객체를 포함할 수 있으며, 프로세서는 상기 제1 이미지의 복 수의 현실 객체 중 제1 객체를 인식할 수 있다. 예를 들어, 프로세서는 제1 객체의 색상, 제1 객체의 배경, 및/또는 제1 객체의 동작을 식별함으로써 제1 객체를 인식할 수 있다. 일 실시 예에 따르면, 동작 440에서 프로세서는 상기 인식한 제1 객체에 대한 제1 객체 데이터를 생 성할 수 있다. 일 예에서, 제1 객체 데이터는 획득한 제1 이미지 내의 복수의 객체들 중 제1 객체에 대한 정보를 포함할 수 있다. 예를 들어, 제1 객체 데이터는 제1 객체 정보 및, 제1 객체의 제1 콘텐츠 분류 정 보를 포함할 수 있다. 일 실시 예에 따르면, 상기 제1 콘텐츠 분류 정보는 상기 제1 객체 데이터에 기초하여 상기 제1 이미지에 포함 된 제1 객체를 복수개의 수준(level)으로 카테고리화 하여 분류한 정보를 포함할 수 있다. 예를 들어, 제1 객체 가 사과인 경우, 제1 콘텐츠 분류 정보는 사과, 사과보다 상위 개념인 과일(fruit), 및 과일보다 상위 개념인 음식(food)으로 카테고리화 하여 분류한 정보를 포함할 수 있다. 일 실시 예에 따르면, 제1 객체의 정보는 제1 객체의 색상 정보를 포함할 수 있다. 예를 들어, 제1 객체가 빨간색 사과인 경우, 제1 객체 데이터는 제1 객체인 사과의 종류(예: 과일) 및 사과의 색상(예: 빨 간색)을 포함할 수 있다. 일 실시 예에 따르면, 제1 객체 데이터는 제1 객체에 대한 상기 사용자의 시선과 관련된 정보를 더 포함할 수 있다. 예를 들어, 제1 객체에 대한 사용자의 시선과 관련된 정보는 증강 현실 장치의 사용자가 제 1 객체를 주시한 시간(time), 및/또는 사용자가 제1 객체를 주시한 빈도수(frequency)에 대한 정보를 포함할 수 있다. 예를 들어, 제1 객체가 빨간색 사과인 경우, 제1 객체 데이터는 사용자가 사과를 주시한 시간, 및/또는 사 과를 주시한 빈도수에 관한 정보를 포함할 수 있다. 제1 객체 데이터에 대한 정보는 사과를 예시로 들어 설명하였으나, 이에 한정하지 않는다. 예를 들어, 제1 객체 가 스마트 폰인 경우, 제1 객체 데이터는 스마트 폰의 종류(예: 전자 기기), 스마트 폰의 색상(예: 검정), 및 스마트 폰을 사용자가 주시한 시간(time)을 포함할 수 있다. 다른 예를 들어, 제1 객체가 연필인 경우, 제1 객 체 데이터는 연필의 종류(예: 필기구), 연필의 색상(예: 파랑), 및 연필을 사용자가 주시한 시간(time)을 포함 할 수 있다. 제1 객체에 대한 사용자의 시선과 관련된 정보는 시간 및 빈도수를 예시로 들어 설명하였으나, 이에 한정 하지 않는다. 예를 들어, 사용자의 시선과 관련된 정보는 상기 사용자가 제1 객체를 주시한 기간(period) 을 더 포함할 수 있다. 제1 객체 데이터에 관한 구체적인 실시예는 도 5에서 상세히 후술하기로 한다. 일 실시 예에 따르면, 동작 450에서 프로세서는 제1 객체 데이터에 기초하여 생성한 제1 우선 순위 데이터 를 획득할 수 있다. 일 예에서, 프로세서는 제1 객체 데이터에 기초하여 생성한, 제1 콘텐츠(content) 분 류 정보에 대한 우선 순위 정보를 포함하는 제1 우선 순위 데이터를 획득할 수 있다. 다시 말해서, 일 실시 예에 따르면, 제1 우선 순위 데이터는 제1 콘텐츠 분류 정보에 대한 우선 순위를 포함할 수 있다. 예를 들어, 제1 우선 순위 데이터는 각각의 객체들이 속하는 각각의 콘텐츠 분류 정보를 제1 객체 데 이터에 기초하여 순위화(ranked) 한 정보를 포함할 수 있다. 예를 들어, 각각의 콘텐츠 분류 정보는 음식, 자동차, 및 게임에 관한 각각의 콘텐츠를 포함할 수 있으며, 제1 우선 순위 데이터는 제1 객체 데이터에 포함된 사용자의 인식 시간, 및 인식 기간을 고려하여 각각의 콘텐츠를 순위화 한 정보를 포함할 수 있다. 콘텐츠를 순위화 한 정보와 관련된 구체적인 실시 예는 도 6에서 상세히 서술하기로 한다. 일 실시 예에 따르면, 동작 460에서 프로세서는 획득한 제1 우선 순위 데이터에 기초하여, 카메라를 이용하여 획득한 제1 이미지에 포함된 적어도 하나의 객체 중 제1 관심 객체를 선택할 수 있다. 일 예에서, 프 로세서는 제1 우선 순위 데이터에 기초하여, 복수의 콘텐츠 분류 정보 중 우선 순위가 가장 높은 콘텐츠 분류 정보에 속하는 제1 관심 객체를 선택할 수 있다. 다시 말해서, 동작 460에서 프로세서는 제1 우선 순 위 데이터에 기초하여 상기 증강 현실 장치의 사용자의 관심도가 가장 높은 관심 객체를 선택할 수 있다. 일 실시 예에 따르면, 관심 객체는 제1 이미지의 복수의 객체 중 인식한 제1 객체와 실질적으로 다른 객체 일 수 있다. 또 다른 예를 들어, 관심 객체는 제1 객체와 실질적으로 동일한 객체 일 수 있다. 일 실시 예에 따르면, 동작 470에서 프로세서는 상기 선택된 제1 관심 객체에 대한 증강 현실 콘텐츠를 디 스플레이 할 수 있다. 일 예에서, 사과가 제1 관심 객체로 선택된 경우, 프로세서는 과일에 관한 증강 현 실 콘텐츠를 디스플레이 할 수 있다. 또 다른 예를 들어, 냉장고가 제1 관심 객체로 선택된 경우, 프로세서 는 가전 기기에 관한 증강 현실 콘텐츠를 디스플레이 할 수 있다. 일 실시 예에 따르면, 증강 현실 콘텐츠는 제1 관심 객체 및 제1 관심 객체와 관련된 추가 정보를 포함할 수 있 다. 일 예에서, 증강 현실 콘텐츠는 제1 관심 객체의 정보, 및/또는 제1 관심 객체와 실질적으로 동일한 콘텐츠 분류 정보에 속하는 다른 객체의 정보를 포함할 수 있다. 예를 들어 사과가 제1 관심 객체로 선택된 경우, 과일 의 증강 현실 콘텐츠는 사과에 대한 정보 및 과일의 콘텐츠 분류 정보에 속하는 바나나 또는 딸기의 정보를 포 함할 수 있다. 제1 관심 객체는 사과를 예시로 들어 설명하였으나, 이에 한정하지 않는다. 다른 예를 들어, 연필이 관심 객체 로 선택된 경우, 필기구에 관한 증강 현실 콘텐츠는 연필에 관한 정보 및/또는 필기구의 콘텐츠 분류 정보에 속 하는 지우개 또는 필통의 정보를 포함할 수 있다. 일 실시 예에 따르면, 프로세서는 선택된 제1 관심 객체에 대한 정보를 포함하는 제1 증강 현실 콘텐츠만 을 디스플레이 할 수 있다. 일 실시 예에 따르면, 사용자의 관심도가 가장 높은 증강 현실 콘텐츠 만을 디스플레이상에 노출시킴으로 써, 프로세서는 사용자가 원하는 정보만을 선택적으로 제공하고 불필요한 정보를 배제할 수 있다. 이를 통해, 증강 현실 장치를 사용하는 사용자의 경험이 증가될 수 있다. 도 5는 일 실시 예에 따른, 증강 현실 장치의 객체 데이터를 도시한다. 일 실시 예에 따르면, 프로세서는 카메라를 이용하여 촬영한 제1 이미지 내의 제1 객체에 대한 제1 객체 데이터를 생성 및 저장할 수 있다. 일 실시 예에 따르면, 제1 객체는 현실 세계에서 사용자가 증강 현실 장치를 통해 인식한 객체를 의 미한다. 일 실시 예에 따르면, 도 5의 제1 객체는 도 3의 제1 객체를 참조할 수 있다. 일 실시 예에 따르면, 제1 객체 데이터는 제1 객체를 카테고리화 한 제1 콘텐츠 분류 정보를 포 함할 수 있다. 일 실시 예에 따르면, 상기 제1 콘텐츠 분류 정보는 상기 제1 객체 데이터에 기초하여 상기 제1 이미지에 포함 된 제1 객체를 복수개의 수준(level)으로 카테고리화 하여 분류한 정보를 포함할 수 있다. 일 실시 예에 따르면, 제1 객체는 제1 콘텐츠 분류 정보 내에서 카테고리 별로 저장될 수 있다. 일 예에서, 제1 객체의 대한 카테고리 정보는 제1 객체 데이터내에서 큰 카테고리부터 작은 카테고리로 점진적으로 저장될 수 있다. 예를 들어, 프로세서가 카메라를 이용하여 인식한 객체가 사과인 경우, 프로세서는 제1 카테고리에서 음식(food)으로 저장할 수 있다. 프로세서는 제2 카테고리로 과일(fruit)로 저장할 수 있으며, 제3 카테고리로 사과로 저장할 수 있다. 다른 예를 들어, 프로세서가 카메라를 이용하여 인식한 객체가 연필(pencil)인 경우, 프로세서 는 연필에 대하여 제1 카테고리에서 문구(stationary)로 저장하고 제2 카테고리에서 필기구(writing instruments)로 저장하며 제3 카테고리에서 연필로 저장할 수 있다. 일 실시 예에 따르면, 제1 객체 데이터는 제1 객체에 대한 시선 정보를 더 포함할 수 있다. 일 예에 서, 제1 객체에 대한 시선 정보는 증강 현실 장치의 사용자가 제1 객체를 주시한 빈도수 (frequency), 제1 객체를 주시한 시간(time), 및 제1 객체를 주시한 기간(period)을 포함할 수있다. 일 실시 예에 따르면, 제1 객체에 대한 시선 정보는 제1 객체 데이터내에서 제1 객체의 카테고 리 정보에 대응하여 저장될 수 있다. 일 예에서, 제1 객체에 대한 시선 정보는 제1 객체의 카테고리 에 대응하여 저장될 수 있다. 예를 들어, 프로세서가 카메라를 이용하여 인식한 객체가 사과인 경우, 음식인 제1 카테고리내에는 음식을 인식한 빈도수 1003회, 음식을 인식한 시간 300시간(times), 음식을 인 식한 기간(period) 10일에 관한 시선 정보가 저장될 수 있다. 또한 예를 들어, 과일인 제2 카테고리내에는 과일을 인식한 빈도수 300회, 인식 시간 150시간, 인식 기간 8일에 관한 시선 정보가 저장될 수 있다. 예를 들 어 사과인 제3 카테고리내에는 사과를 인식한 빈도수 40회, 인식 시간 100시간, 인식 기간 5일에 관한 시 선 정보가 저장될 수 있다. 일 실시 예에 따르면, 제1 객체 데이터는 사용자와 제1 객체의 상호 작용 여부에 관한 정보를 더 포 함할 수 있다. 일 예에서, 사용자와 제1 객체의 상호 작용 여부에 관한 정보는 증강 현실 장치의 사 용자가 제1 객체에 대해 검색했는지 여부에 관한 정보, 및/또는 현실 세계에서 사용자가 제1 객체와 접촉하였는지 여부에 관한 정보를 더 포함할 수 있다. 다시 말해서, 사용자와 제1 객체의 상호 작용여부에 관한 정보는 제1 객체에 대한 시선 정보 이외에 사용자와 제1 객체의 반응(reaction) 정보를 의미할 수 있다. 일 실시 예에 따르면, 프로세서는 생성한 제1 객체 데이터에 대한 정보를 서버로 전송할 수 있 다. 일 예에서, 프로세서는 제1 우선 순위 데이터를 생성하기 위해 제1 객체 데이터를 서버로 전송할 수 있다. 또 다른 예를 들어, 프로세서는 생성한 제1 객체 데이터를 이용하여 제1 우선 순위 데이터를 생성할 수 있다. 제1 우선 순위 데이터에 관한 구체적인 실시예는 도 6에서 후술하기로 한다. 도 6은 일 실시 예에 따른, 우선 순위 데이터를 생성하는 것을 나타낸 흐름도이다. 일 실시 예에 따르면, 프로세서는 동작 610에서 제1 객체 데이터를 생성할 수 있다. 도 6의 제1 객체 데이 터를 생성하는 동작 610은 도 4 동작 410 내지 450를 참조할 수 있다. 일 실시 예에 따르면, 동작 620에서 프로세서는 상기 제1 객체 데이터를 서버로 전송할 수 있다. 일 실시 예에 따르면, 동작 630 내지 동작 640에서 프로세서는 제1 객체 데이터에 기초하여 생성된 우선 순위 데이터를 획득할 수 있다. 예를 들어, 서버는 제1 객체 데이터를 기초로 우선 순위 데이터 를 생성하고, 프로세서는 서버가 생성한 우선 순위 데이터를 서버로부터 획득할 수 있다. 일 실시 예에 따르면, 우선 순위 데이터란 제1 객체 데이터를 기초로 제1 객체 또는 제1 객체가 속하는 제1 콘텐츠 분류 정보를 순위화 한 정보를 포함할 수 있다. 예를 들어, 우선 순위 데이터는 제1 객 체를 인식한 빈도수, 제1 객체를 인식한 시간, 및/또는 제1 객체를 인식한 빈도수를 기초로 제1 객체 또는 제1 객체가 속하는 제1 콘텐츠 분류 정보를 순위화(ranked) 한 정보를 포함할 수 있다. 일 실시 예에 따르면, 우선 순위 데이터는 공통(common) 우선 순위 데이터 및 개인화(private) 우선 순위 데이 터를 포함할 수 있다. 일 실시 예에 따르면, 동작 630에서 프로세서는 증강 현실 장치로부터 서버로 제공된 제1 객체 데이터 및 적어도 하나의 다른 증강 현실 장치로부터 서버에게 제공된 다른 객체 데이터에 기초 하여, 서버에 의해 생성된 공통 우선 순위 데이터를, 서버로부터 수신할 수 있다. 예를 들어, 서버는 증강 현실 장치로부터 서버로 제공된 제1 객체 데이터 및 적어도 하나 의 다른 증강 현실 장치로부터 서버에게 제공된 다른 객체 데이터에 기초하여 공통 우선 순위 데이터 를 생성할 수 있다. 일 실시 예에 따르면, 상기 공통 우선 순위 데이터는 증강 현실 장치의 사용자 및 다른 증강 현실 장치의 사용자의 공통된 입력 정보에 기초하여 결정된 우선 순위 정보를 포함할 수 있다. 예를 들어, 공통 우선 순위 데이터는 증강 현실 장치의 사용자 및 다른 증강 현실 장치의 사용자가 입력한 사용자들의 성별, 연령대, 및 인종에 기초하여 결정된 우선 순위 정보를 포함할 수 있다. 공통된 입력 정보는 성별, 연령대, 및 인종을 예시로 들어 설명하였으나 이에 한정하지 않는다. 예를 들어, 공 통 우선 순위 데이터는 사용자의 종교에 대한 정보를 더 포함할 수 있다. 다시 말해서, 공통 우선 순위 데이터는 실시간으로 변하지 않는 입력된 정적(static) 정보를 포함할 수 있다. 일 실시 예에 따르면, 동작 640에서 프로세서는 증강 현실 장치에서 생성된 제1 객체 데이터를 이용하여 공통 우선 순위 데이터로부터 증강 현실 장치의 사용자에 대한 개인화(private) 우선 순위 데이 터를 생성할 수 있다. 일 실시 예에 따르면, 개인화 우선 순위 데이터는 증강 현실 장치의 사용자가 실시간으로 객체를 인식한 시선 정보에 기초하여 결정된 우선 순위 정보를 포함할 수 있다. 예를 들어, 개인화 우선 순위 데이터는 사용자 가 객체를 인식한 시간(time) 정보에 기초하여 결정된 우선 순위 정보를 포함할 수 있다. 다시 말해서, 개인화 우선 순위 데이터는 사용자의 시선에 따라 실시간으로 변하는 동적(dynamic) 정보를 포함할 수 있다. 일 실시 예에 따르면, 프로세서는 사용자가 인식한 모든 객체에 대한 인식한 시간에 기초하여 개인화 우선 순위 데이터를 생성할 수 있으나, 이에 한정하지 않는다. 예를 들어, 객체를 인식한 제1 시간 값이 일정한 기준 시간 값을 초과한 경우, 프로세서는 제1 시간 값에 기초하여 개인화 우선 순위 데이터를 생성할 수 있다. 다만 예를 들어, 객체를 인식한 제2 시간 값이 일정한 기준 시간 값 이하인 경우, 프로세서는 제2 시간 값 에 기초하여 개인화 우선 순위 데이터를 생성하지 않을 수 있다. 프로세서가 기준 시간 값을 기준으로 개인화 우선 순위 데이터를 선택적으로 생성함에 따라, 증강 현실 장 치의 전력이 절약되고 신속하게 제1 우선 순위 데이터가 생성될 수 있다. [표 1]은 콘텐츠 분류 정보를 순위화 한 제1 우선 순위 데이터의 예시를 나타낸다. 표 1 우선순위 콘텐츠 분류 정보 디스플레이 상의 노출 정보 1 음식 노출 2 자동차 노출 3 광고 조건부 노출 4 게임 노출 ... 99 술 비 노출 100 도박 비 노출 일 실시 예에 따른 [표 1]을 참고하면, 우선 순위 데이터는 각각의 콘텐츠 분류 정보에 대응되는 우선 순 위 정보를 포함할 수 있다. 일 실시 예에 따르면, 제1 우선 순위 데이터는 제1 콘텐츠 분류 정보를 사용자의 관 심도에 따라 순위화 하여 저장할 수 있다. 예를 들어, 증강 현실 장치의 사용자가 가장 선호하는 증강 현 실 콘텐츠는 음식일 수 있다. 일 실시 예에 따르면, 우선 순위 데이터는 콘텐츠 분류 정보에 대한 디스플레이 상의 노출 정보를 더 포함 할 수 있다. 일 예에서, 우선 순위 데이터는 사용자의 연령, 및 사용자가 증강 현실 장치에 입력한 정보를 기초로 식별된 디스플레이 상의 노출 정보를 포함할 수 있다. 예를 들어, 사용자의 나이가 19세 이하인 경우, 술 및/또는 도박에 관한 증강 현실 콘텐츠는 우선 순위가 높더라도 디스플레이 상에 노출되지 않을 수 있다. 또 다른 예를 들어, 증강 현실 장치의 사용자가 어플리케이션 설정을 통해 광고의 노출을 차단한 경우, 광고 에 관한 증강 현실 콘텐츠는 우선 순위가 높더라도 디스플레이 상에 노출되지 않을 수 있다. 다시 말해서 일 실시 예에 따르면, 사용자의 연령(age), 및 사용자가 증강 현실 장치의 어플리케이션에 입 력한 노출 관련 설정 정보에 기반하여 프로세서는 디스플레이 되는 증강 현실 콘텐츠를 식별할 수 있다. 일 실시 예에 따르면, 동작 6500에서 프로세서는 획득한 제1 우선 순위 데이터에 기초하여, 카메라를 이용하여 획득한 제1 이미지에 포함된 적어도 하나의 객체 중 제1 관심 객체를 선택할 수 있다. 일 실시 예에 따르면, 동작 660에서 프로세서는 상기 선택된 제1 관심 객체에 대한 증강 현실 콘텐츠를 디 스플레이 할 수 있다. 도 7은 일 실시 예에 따른, 증강 현실 콘텐츠를 디스플레이 하는 것을 나타낸 흐름도이다. 일 실시 예에 따르면, 도 7은 도 4의 흐름도와 달리 상기 사용자가 새로운 제2 객체를 인식함에 따른 증강 현실 콘텐츠를 디스플레이 하는 것을 나타낸 흐름도이다. 일 실시 예에 따르면, 동작 710에서 프로세서는 카메라를 이용하여 시선 방향의 제2 이미지를 촬영할 수 있다. 일 예에서, 프로세서는 카메라를 이용하여 사용자의 시선 방향에 위치한 현실 객체(예: 가 구, 가전, 벽면, 배경)를 포함하는 제2 이미지를 촬영할 수 있다. 일 실시 예에 따르면, 도 7의 제2 이미지는 도 4의 제1 이미지와 구별되는 이미지일 수 있으나, 이에 한정하지 않는다. 예를 들어, 도 7의 이미지는 도 4의 제1 이미지와 일부 중첩될 수 있다. 일 실시 예에 따르면, 동작 720에서 프로세서는 상기 촬영된 제2 이미지에 포함된 제2 현실 객체(real object)를 인식할 수 있다. 일 예에서, 상기 촬영된 제2 이미지는 복수의 현실 객체를 포함할 수 있으며, 프로 세서는 상기 제2 이미지의 복수의 현실 객체 중 제2 현실 객체를 인식할 수 있다. 예를 들어, 프로세서 는 센서를 통해 제2 현실 객체의 색상, 제2 현실 객체의 배경, 및/또는 제2 현실 객체의 동작을 식별 함으로써 제2 현실 객체를 인식할 수 있다. 일 실시 예에 따르면, 동작 730에서 프로세서는 상기 인식한 제2 객체에 대한 제2 객체 데이터를 생 성할 수 있다. 일 예에서, 제2 객체 데이터는 획득한 제2 이미지 내의 복수의 객체들 중 제2 객체에 대한 정보를 포함할 수 있다. 예를 들어, 제2 객체 데이터는 제2 객체 정보 및, 제2 객체의 제2 콘텐츠 분류 정 보를 포함할 수 있다. 일 실시 예에 따르면, 상기 제2 콘텐츠 분류 정보는 상기 제2 객체 데이터에 기초하여 상기 제2 이미지에 포함 된 제2 객체를 복수개의 수준(level)으로 카테고리화 하여 분류한 정보를 포함할 수 있다. 상기 제1 콘텐츠 분류 정보는 도 4 및 도 5의 콘텐츠 분류 정보를 참조할 수 있다. 일 실시 예에 따르면, 제2 객체의 정보는 제2 객체의 색상 정보를 포함할 수 있다. 일 실시 예에 따 르면, 제2 객체 데이터는 제2 객체에 대한 상기 사용자의 시선과 관련된 정보를 더 포함할 수 있다. 예를 들어, 제2 객체에 대한 사용자의 시선과 관련된 정보는 증강 현실 장치의 사용자가 제2 객체를 주시한 시간(time), 및/또는 사용자가 제2 객체를 주시한 빈도수(frequency)에 대한 정보를 포함할 수 있 다. 제2 객체 데이터에 대한 정보는 사과를 예시로 들어 설명하였으나, 이에 한정하지 않는다. 예를 들어, 제2 객체 가 스마트 폰인 경우, 제2 객체 데이터는 스마트 폰의 종류(예: 전자 기기), 스마트 폰의 색상(예: 검정), 및 스마트 폰을 사용자가 주시한 시간(time)을 포함할 수 있다. 다른 예를 들어, 제2 객체가 연필인 경우, 제2 객 체 데이터는 연필의 종류(예: 필기구), 연필의 색상(예: 파랑), 및 연필을 사용자가 주시한 시간(time)을 포함 할 수 있다. 일 실시 예에 따르면, 시간 및 빈도수를 예시로 들어 설명하였으나, 이에 한정하지 않는다. 예를 들어, 사용자 의 시선과 관련된 정보는 상기 사용자가 제2 객체를 주시한 기간(period)을 더 포함할 수 있다. 제2 객체 데이터에 관한 구체적인 실시예는 도 4 및 도 5의 제1 객체 데이터를 참조할 수 있다. 일 실시 예에 따르면, 동작 740에서 프로세서는 제2 객체 데이터에 기초하여 생성한 제2 우선 순위 데이터 를 획득할 수 있다. 일 예에서, 프로세서는 제2 객체 데이터에 기초하여 생성한, 제2 콘텐츠(content) 분 류 정보에 대한 우선 순위 정보를 포함하는 제2 우선 순위 데이터를 획득할 수 있다. 다시 말해서, 일 실시 예에 따르면, 제2 우선 순위 데이터는 제2 콘텐츠 분류 정보에 대한 우선 순위를 포함할 수 있다. 예를 들어, 제2 우선 순위 데이터는 각각의 객체들이 속하는 각각의 콘텐츠 분류 정보를 제2 객체 데 이터에 기초하여 순위화(ranked) 한 정보를 포함할 수 있다. 일 실시 예에 따르면, 동작 750에서 프로세서는 획득한 제2 우선 순위 데이터에 기초하여, 카메라를 이용하여 획득한 제2 이미지에 포함된 적어도 하나의 객체 중 제2 관심 객체를 선택할 수 있다. 일 예에서, 프 로세서는 제2 우선 순위 데이터에 기초하여, 복수의 콘텐츠 분류 정보 중 우선 순위가 가장 높은 콘텐츠 분류 정보에 속하는 제2 관심 객체를 선택할 수 있다. 다시 말해서, 동작 750에서 프로세서는 제2 우선 순 위 데이터에 기초하여 상기 증강 현실 장치의 사용자의 관심도가 가장 높은 제2 관심 객체를 선택할 수 있 다. 일 실시 예에 따르면, 제2 관심 객체는 제2 이미지의 복수의 객체 중 인식한 제2 객체와 실질적으로 다른 객체 일 수 있다. 또 다른 예를 들어, 제2 관심 객체는 제2 객체와 실질적으로 동일한 객체 일 수 있다.일 실시 예에 따르면, 동작 760에서 프로세서는 제1 객체 데이터 및 제2 객체 데이터에 기초하여, 제2 관 심 객체와 제1 관심 객체 중 우선 순위 값이 큰 값을 갖는 주요(main) 관심 객체를 식별할 수 있다. 일 실시 예에 따르면, 우선 순위 값은 제1 관심 객체 및 제2 관심 객체에 대해 사용자가 인식한 시간 값을 포함 할 수 있다. 예를 들어, 제1 객체 데이터 내에 저장된 제1 관심 객체의 응시 시간 값이 50시간이고 제2 객체 데 이터 내에 저장된 제2 관심 객체의 응시 시간 값이 100시간인 경우, 프로세서는 제2 관심 객체를 주요 관 심 객체로 식별할 수 있다. 다시 말해서, 프로세서는 사용자가 제1 관심 객체보다 제2 관심 객체에 사용자 의 관심도가 더 큰 것으로 식별할 수 있다. [표 2]는 우선 순위가 변화하는 관심 객체를 나타낸 예시이다. 일 실시 예에 따르면, 주시 전 상태는 새로운 객체를 주시하기 전 상태로서 제1 이미지가 촬영된 상태를 의미할 수 있다. 일 실시 예에 따르면, 주시 후 상태는 새로운 객체를 주시 후 상태로서 제2 이미지가 촬영된 상태를 의미할 수 있다. 표 2 우선순위 주시 전 상태 주시 후 상태 1 아이스크림 인형 2 안경 커피 3 헤어스타일 마스크 4 커피 냉면 쪋 술 아이스크림 일 실시 예에 따른 [표 2]를 참고하면, 사용자의 새로운 객체를 주시 함에 따라 관심 객체의 우선 순위가 변할 수 있다. 일 예에서, 새로운 객체를 주시 전의 제1 관심 객체는 아이스크림으로 선택될 수 있으며, 새로운 객체 를 주시 후의 제2 관심 객체는 인형으로 선택될 수 있다. 일 실시 예에 따르면, 새로운 객체를 주시 후 제2 관 심 객체(예: 인형)에 대한 시간 값이 제1 관심 객체(예: 아이스크림)에 대한 시간 값보다 더 큰 값을 가짐에 따 라, 인형의 우선 순위는 아이스크림의 우선 순위 보다 높을 수 있다. 일 실시 예에 따르면, 동작 771에서 프로세서는 상기 주요 관심 객체가 제2 관심 객체인 경우, 제2 관심 객체에 대한 정보를 포함하는 제2 증강 현실 콘텐츠를 디스플레이 할 수 있다. 일 실시 예에 따르면, 제2 증강 현실 콘텐츠는 제2 관심 객체 및 제2 관심 객체와 관련된 추가 정보를 포함할 수 있다. 일 예에서, 제2 증강 현실 콘텐츠는 제2 관심 객체의 정보, 및/또는 제2 관심 객체와 실질적으로 동일 한 콘텐츠 분류 정보에 속하는 다른 객체의 정보를 포함할 수 있다. 제2 증강 현실 콘텐츠는 도 4의 제1 증강 현실 콘텐츠를 참고할 수 있다. 일 실시 예에 따르면, 동작 772에서 프로세서는 주요 관심 객체가 제1 관심 객체인 경우, 제1 관심 객체에 대한 정보를 포함하는 제1 증강 현실 콘텐츠를 디스플레이 할 수 있다. 일 실시 예에 따르면, 프로세서가 우선 순위 값을 통해 제1 관심 객체 및 제2 관심 객체 중 우선 순위가 높은 주요 관심 객체를 식별함에 따라, 증강 현실 장치는 사용자가 선호하는 증강 현실 객체 또는 관심 객 체에 대한 증강 현실 콘텐츠만을 사용자에게 제공할 수 있다. 일 실시 예에 따르면, 사용자의 관심도가 가장 높은 증강 현실 콘텐츠 만을 디스플레이상에 노출시킴으로 써, 증강 현실 장치는 사용자가 원하는 정보만을 선택적으로 제공하고 불필요한 정보를 배제할 수 있다. 이를 통해, 증강 현실 장치를 사용하는 사용자의 경험이 증가될 수 있다. 도 8은 일 실시 예에 따른, 전자 장치 및 서버를 도시한 도면이다. 일 실시 예에 따르면, 도 8의 증강 현실 장치는 서버와 객체 데이터를 공유하여 우선 순위 데이터를 생성 및 획득할 수 있다. 일 실시 예에 따르면, 통신 모듈을 통해 증강 현실 장치는 다른 증강 현실 장치 또는 서버와 정 보를 송신 및 수신할 수 있다. 일 실시 예에 따르면, 동작 810에서 프로세서는 센서를 이용하여 증강 현실 장치의 사용자의 시 선을 추적할 수 있다. 일 실시 예에 따르면, 동작820에서 프로세서는 카메라를 이용하여 시선 방향의 제1 이미지를 촬영할 수 있다. 일 실시 예에 따르면, 동작 830에서 프로세서는 촬영된 제1 이미지에 포함된 제1 객체를 인식할 수 있다. 일 실시 예에 따르면, 동작 840에서 프로세서는 상기 인식한 제1 객체에 대한 제1 객체 데이터를 생 성할 수 있다. 일 실시 예에 따르면, 도 8의 동작 810 내지 840은 도 4의 동작 410 내지 440을 참조할 수 있다. 일 실시 예에 따르면, 프로세서는 생성된 제1 객체 데이터를 서버에 전송하는 동작 850을 더 포함할 수 있다. 예를 들어, 프로세서는 통신 모듈을 통해 제1 객체 데이터를 서버로 전송할 수 있다. 일 실시 예에 따르면, 동작 861에서 서버는 프로세서로부터 수신한 제1 객체 데이터를 기초로 제1 우 선 순위 데이터 중 공통 우선 순위 데이터를 생성할 수 있다. 예를 들어, 서버는 증강 현실 장치의 사용자의 공통된 입력 정보(예: 성별, 및 나이)를 기초로 증강 현실 장치의 사용자의 공통 우선 순위 데이터를 생성할 수 있다. 일 실시 예에 따르면, 서버는 다른 증강 현실 장치의 사용자의 다른 객체 데이터도 수신할 수 있다. 예를 들어, 서버는 다른 증강 현실 장치의 사용자의 공통된 입력 정보(예: 성별, 및 나이)를 포함하는 다른 객 체 데이터를 수신할 수 있다. 일 실시 예에 따르면, 서버는 증강 현실 장치의 사용자 및 다른 증강 현실 장치의 사용자의 공통 입 력 정보를 기초로 증강 현실 장치의 사용자의 제1 우선 순위 데이터를 생성할 수 있다. 일 실시 예에 따르면, 동작 862에서 서버는 프로세서로부터 수신한 제1 객체 데이터 및 상기 공통 우 선 순위 데이터를 기초로 제1 우선 순위 데이터 중 개인화 우선 순위 데이터를 생성할 수 있다. 예를 들어, 서 버는 제1 객체 데이터 내에 저장된 객체를 인식한 시간(time) 정보를 기초로 개인화 우선 순위 데이터를 생성할 수 있다. 일 실시 예에 따르면, 개인화 우선 순위 데이터는 서버에서 생성되는 것으로 설명하였으나, 이에 한정하지 않는다. 예를 들어, 증강 현실 장치의 프로세서는 서버로부터 공통 우선 순위 데이터를 수신하고, 수 신된 공통 우선 순위 데이터 및 제1 객체 데이터를 기초로 개인화 우선 순위 데이터를 생성할 수 있다. 일 실시 예에 따르면, 공통 우선 순위 데이터 및 개인화 우선 순위 데이터는 도 6의 공통 우선 순위 데이터 및 개인화 우선 순위 데이터를 참조할 수 있다. 일 실시 예에 따르면, 동작 870에서 프로세서는 전송된 제1 객체 데이터에 기초하여 생성한 상기 제1 우선 순위 데이터를, 상기 서버로부터 획득할 수 있다. 일 실시 예에 따르면, 프로세서는 동작 880에서 획득한 제1 우선 순위 데이터에 기초하여, 카메라를 이용하여 획득한 제1 이미지에 포함된 적어도 하나의 객체 중 관심 객체를 선택할 수 있다. 관심 객체는 제1 이 미지의 복수의 객체 중 인식한 제1 객체와 다른 객체 일 수 있다. 또 다른 예를 들어, 관심 객체는 제1 객체와 실질적으로 동일한 객체 일 수 있다. 일 실시 예에 따르면, 프로세서는 동작 890에서 선택된 관심 객체에 대한 증강 현실 콘텐츠를 디스플레이 할 수 있다. 일 실시 예에 따르면, 증강 현실 콘텐츠는 제1 관심 객체 및 제1 관심 객체와 관련된 추가 정보를 포함할 수 있 다. 일 예에서, 증강 현실 콘텐츠는 제1 관심 객체의 정보, 및/또는 제1 관심 객체와 실질적으로 동일한 콘텐츠 분류 정보에 속하는 다른 객체의 정보를 포함할 수 있다. 일 실시 예에 따르면, 도 8의 동작 880 내지 890은 도 4의 동작 460 내지 동작 470을 참조할 수 있다. 도 9는 일 실시 예에 따른, 디스플레이 되는 증강 현실 콘텐츠를 도시한 도면이다. 일 실시 예에 따르면, 프로세서는 복수의 객체 중 사용자의 우선 순위가 높은 제1 관심 객체 만을 선별하 여 선별된 제1 관심 객체와 관련된 증강 현실 콘텐츠(900, 도 3의 320)만을 디스플레이상에 노출시킬 수 있다. 도 9의 증강 현실 콘텐츠는 도 3의 증강 현실 콘텐츠을 참조할 수 있다. 일 예에서, 증강 현실 콘텐츠는 제1 관심 객체 및 제1 관심 객체와 관련된 추가 정보를 포함할 수 있다. 일 실시 예에 따르면, 프로세서는 사용자의 관심 객체만을 디스플레이상에 노출시킬 수 있다. 일 예 에서, 프로세서는 사용자의 관심도가 가장 높은 제1 관심 객체와 관련된 증강 현실 콘텐츠를 디스플 레이상에 노출시킬 수 있다. 예를 들어, 사과가 제1 관심 객체로 선택된 경우, 프로세서는 사과 및 과일에 관한 증강 현실 콘텐츠를 디스플레이상에 노출시킬 수 있다. 일 실시 예에 따른 도 9를 참고하면, 사과가 제1 관심 객체로 선택된 경우, 프로세서는 사과 또는 과일에 관한 증강 현실 콘텐츠를 디스플레이 할 수 있다. 예를 들어, 사과가 제1 관심 객체로 선택된 경우, 프로 세서는 모든 사과를 자르는 방법에 관한 제1 증강 현실 콘텐츠를 디스플레이 할 수 있다. 예를 들어, 프로세서는 사과 또는 과일과 관련된 애니메이션에 관한 제2 증강 현실 콘텐츠를 디스플레이 할 수 있다. 예를 들어, 프로세서는 과일과 관련된 음악에 관한 제3 증강 현실 콘텐츠를 디스플레이 할 수 있다. 예를 들어, 프로세서는 사과 이외의 과일(예: jackfruit)에 관한 제4 증강 현실 콘텐츠를 디스 플레이 할 수 있다. 일 실시 예에 따르면, 사용자의 관심도가 가장 높은 증강 현실 콘텐츠 만을 디스플레이상에 노출시킴으로 써, 프로세서는 사용자가 원하는 정보만을 선택적으로 제공하고 불필요한 정보를 배제할 수 있다. 이를 통해, 증강 현실 장치를 사용하는 사용자의 경험이 증가될 수 있다. 도 10은 일 실시 예에 따른, 디스플레이 되는 증강 현실 콘텐츠를 도시한 도면이다. 일 실시 예에 따르면, 도 10은 선택된 제1 관심 객체에 대한 정보를 포함하는 증강 현실 콘텐츠가 디스플레이 되는 것을 도시한다. 일 예에서, 증강 현실 콘텐츠는 제1 관심 객체에 대한 광고 영상 을 포함할 수 있다. 예를 들어, 제1 관심 객체가 스마트 폰인 경우, 증강 현실 콘텐츠는 스마트 폰 을 광고하는 영상을 포함할 수 있다. 일 실시 예에 따르면, 프로세서는 제3 객체 데이터를 기초로 디스플레이 되는 증강 현실 콘텐츠의 디스플레이 상의 노출 여부를 추가 결정할 수 있다. 일 예에서, 제3 객체 데이터는 센서를 이용하여 사용자의 시선을 검출한 정보를 포함할 수 있다. 예를 들어, 제3 객체 데이터는 사용자의 시선이 집중하는 영역 (focal area), 증강 현실 콘텐츠 내의 제1 관심 객체를 주시한 시간을 포함할 수 있다. 일 실시 예에 따르면, 제3 객체 데이터는 시선을 검출한 정보를 예시로 들어 설명하였으나, 이에 한정하지 않는 다. 예를 들어, 객체 데이터는 사용자의 위치 정보, 및 오디오 on/off 여부에 대한 정보를 더 포함할 수 있다. 또 다른 예를 들어, 제3 객체 데이터는 사용자가 설정한 영상의 밝기, 및 투명도 정보를 포함할 수 있다. 일 실시 예에 따르면, 프로세서는 상기 제3 객체 데이터를 기초로 디스플레이 되는 증강 현실 콘텐츠 에 대한 사용자의 관심도를 식별할 수 있다. 예를 들어, 도 10의 증강 현실 콘텐츠가 제공되는 중 사용자의 초점(focal area)이 캐릭터에 위치한 경우, 프로세서는 해당 증강 현실 콘텐츠에 대 한 사용자의 관심도가 낮음을 식별할 수 있다. 또 다른 예를 들어, 도 10의 증강 현실 콘텐츠가 제공되는 중 사용자가 오디오를 on으로 설정한다면 프로세서는 해당 증강 현실 콘텐츠에 대한 사용자의 관심 도가 높음을 식별할 수 있다. 일 실시 예에 따르면, 사용자의 관심도를 식별한 프로세서는 증강 현실 콘텐츠의 지속적인 디스플레 이 상의 노출 여부를 추가 결정할 수 있다. 일 실시 예에 따르면, 프로세서 사용자의 관심도가 낮다 고 식별한 경우, 광고 영상을 스킵(skip)하는 인터페이스를 디스플레이 상에 제공할 수 있다. 또 다른 예를 들 어, 프로세서는 사용자의 관심도가 높다고 식별한 경우, 광고 영상과 관련된 추가 광고 영상을 디스플레이 상에 제공할 수 있다. 일 실시 예에 따르면, 프로세서는 증강 현실 장치의 사용자 이외의 제3 자가 설정한 정보를 증강 현 실 콘텐츠와 함께 노출시킬 수 있다. 예를 들어, 제3 자가 광고 영상의 제작자인 경우, 제3 자는 광고 영 상의 일부 영역의 밝기를 광고 영상의 다른 영역과 다르게 노출되도록 설정할 수 있다. 또 다른 예를 들 어, 프로세서는 광고 영상의 일부 영역의 색상이 다른 영역의 색상과 다르게 노출되도록 디스플레이 할 수 있다. 또 다른 예를 들어, 프로세서는 광고 영상의 배경에 광고 대상이 되는 객체의 로고가 노출되도록 디스플레이 할 수 있다. 일 실시 예에 따르면, 증강 현실 장치는 사용자가 선호하는 증강 현실 콘텐츠를 제공함과 동시에, 제 3 자가 원하는 정보를 추가 제공할 수 있다. 도 11은 다양한 실시 예들에 따른 네트워크 환경 내의 전자 장치의 블록도이다. 도 11을 참조하면, 네트워크 환경에서 전자 장치(1101, 도 1의 증강 현실 장치)는 제1 네트워크 (예: 근거리 무선 통신 네트워크)를 통하여 전자 장치와 통신하거나, 또는 제2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장치 또는 서버와 통신할 수 있다. 일 실시 예에 따르 면, 전자 장치는 서버(1108, 도 1의 190)를 통하여 전자 장치와 통신할 수 있다. 일 실시 예에 따 르면, 전자 장치는 프로세서(1120, 도 2의 210), 메모리(1130, 도 2의 250), 입력 모듈, 음향 출 력 모듈, 디스플레이 모듈(1160, 도 2의 240), 오디오 모듈, 센서 모듈, 인터페이스, 연결 단자, 햅틱 모듈, 카메라 모듈(1180, 도 2의 220), 전력 관리 모듈, 배터리, 통 신 모듈(1190, 도 2의 260), 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시 예 에서는, 전자 장치에는 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어떤 실시 예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데 이터 처리 또는 연산을 수행할 수 있다. 일 실시 예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로 세서는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘 발성 메모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비 휘발성 메모리에 저장할 수 있다. 일 실시 예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서 (예: 그래픽 처리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거 나, 지정된 기능에 특화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세 서를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로 세서와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센 서 모듈(1176, 도 2의 230), 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있 다. 일 실시 예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기 능적으로 관련 있는 다른 구성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일 실시 예에 따르면, 보조 프로세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지 능이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버(1108, 도 1의 190))를 통해 수 행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습 (unsupervised learning), 준지도형 학습(semi-supervised learning) 또는 강화 학습(reinforcement learnin g)을 포함할 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함 할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted Boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이 상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적 으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관 련된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도 로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일 실시 예에 따르면, 리시버는 스피 커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레 이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로를 포함할 수 있다. 일 실시 예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일 실시 예에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰) 를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태)를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일 실시 예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일 실시 예에 따르면, 인터페이스 는, 예를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일 실시 예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커 넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일 실시 예에 따르면, 햅틱 모듈은, 예를 들 면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일 실시 예에 따르면, 카메라 모듈은 하나 이상의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일 실시 예에 따르면, 전력 관리 모듈은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일 실시 예에 따르면, 배 터리는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있 다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버 ) 간의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접 (예: 유선) 통신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일 실시 예 에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제1네트워크(예: 블루투스, WiFi 다이렉트(wireless fidelity direct) 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워크) 또는 제2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워 크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈 은 가입자 식별 모듈에 저장된 가입자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제1 네트워크 또는 제2 네트워크와 같은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중 입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔포밍, 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일 실시 예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 피크 데이터 레이트(peak data rate)(예: 20Gbps 이상), mMTC 실현을 위한 손실 커버리지(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운 링크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일 실시 예에 따르면, 안테나 모듈은 기판(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일 실시 예에 따르면, 안테나 모듈은 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제1 네트워크 또는 제2 네트워크와 같은 통신 네트 워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복 수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모듈 과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시 예에 따르면, 방사체 이외에 다른 부품 (예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양 한 실시 예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일 실시 예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제1 면(예: 아래 면)에 또는 그에 인접하여 배치 되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제2 면(예: 윗면 또는 측면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있는 복수 의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일 실시 예에 따르면, 명령 또는 데이터는 제2 네트워크에 연결된 서버를 통해서 전자 장치(110 1)와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(1102, 또는 1104) 각각은 전자 장치와 동일한 또는 다른 종류의 장치일 수 있다. 일 실시 예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(1102, 1104, 또는 1108) 중 하나 이상의 외부의 전자 장치들에 서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시 키는 대신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치 로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답 의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴 퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는,예를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시 예 에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학 습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일 실시 예에 따르면, 외부의 전자 장치 또는 서버 는 제2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반 으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 다양한 실시 예에 따른 증강 현실 장치는, 디스플레이, 카메라, 센서, 및 상기 디스플레이, 상기 센서, 및 상기 카메라와 작동적으로 연결된 프로세서를 포함하고, 상기 프로세서는 상기 센서를 이용하여 사용자의 시선 방향 을 검출하고, 상기 카메라를 이용하여 상기 사용자의 시선 방향의 제1 이미지를 촬영하고, 상기 촬영된 제1 이 미지에 포함된 제1 객체(object)를 인식하고, 상기 인식한 제1 객체가 속하는 제1 콘텐츠(content) 분류 정보를 포함하는 제1 객체 데이터를 생성하고, 상기 제1 객체 데이터에 기초하여, 상기 제1 콘텐츠 분류 정보에 대한 우선 순위를 포함하는 제1 우선 순위 데이터를 획득하고, 상기 획득한 제1 우선 순위 데이터에 기초하여, 상기 카메라를 이용하여 획득된 제1 이미지에 포함된 적어도 하나의 객체 중에서 제1 관심 객체를 선택하고, 상기 선 택된 제1 관심 객체에 대한 정보를 포함하는 제1 증강 현실 콘텐츠를 디스플레이 할 수 있다. 다양한 실시 예에 따른 증강 현실 장치는, 디스플레이, 센서, 카메라, 및 상기 디스플레이, 상기 센서 및 상기 카메라와 작동적으로 연결된 프로세서를 포함하고, 상기 프로세서는 상기 센서를 이용하여 상기 사용자의 시선 을 검출하고, 상기 카메라를 이용하여 상기 추적한 사용자 시선 방향의 제1 이미지를 획득하고, 상기 획득한 제 1 이미지 내의 객체들 및 상기 객체들에 대한 상기 사용자의 시선과 관련된 제1 객체 데이터를 생성하고, 상기 생성된 제1 객체 데이터를 서버로 전송하고, 상기 증강 현실 장치로부터 상기 서버로 제공된 상기 제1 객체 데 이터 및 적어도 하나의 다른 증강 현실 장치로부터 상기 서버에게 제공된 다른 객체 데이터에 기초하여, 상기 서버에 의해 생성된 공통(common) 우선 순위 데이터를, 상기 서버로부터 수신하고, 상기 증강 현실 장치에서 생 성된 상기 제1 객체 데이터를 이용하여 상기 공통 우선 순위 데이터로부터 상기 증강 현실 장치의 사용자에 대 한 개인화(private) 우선 순위 데이터를 생성하고, 상기 개인화 우선 순위 데이터에 기초하여, 상기 제1 이미지 내의 객체들 중에서 상기 사용자의 제1 관심 객체를 선택하고, 상기 제1 관심 객체 및 상기 제1 관심 객체와 관 련된 추가 정보를 포함하는 증강 현실 콘텐츠를 디스플레이 할 수 있다. 일 실시 예에 따르면, 상기 제1 객체 데이터는 상기 사용자가 상기 제1 객체를 인식한 빈도수(frequency), 상기 제1 객체를 인식한 시간(time), 및/또는 상기 제1 객체를 인식한 기간(period)을 포함할 수 있다. 일 실시 예에 따르면, 상기 우선 순위 데이터는 상기 제1 객체를 인식한 빈도수, 상기 제1 객체를 인식한 시간, 및/또는 상기 제1 객체를 인식한 빈도수를 기초로 상기 제1 콘텐츠 분류 정보를 순위화 (ranked) 한 정보를 포 함할 수 있다. 일 실시 예에 따르면, 상기 제1 콘텐츠 분류 정보는 상기 제1 이미지 내의 복수의 객체들 각각을 복수개의 수준 (level)으로 카테고리화 하여 분류될 수 있다. 일 실시 예에 따르면, 상기 제1 우선 순위 데이터는 공통 우선 순위 데이터 및 개인 우선 순위 데이터를 포함하 고, 상기 공통 우선 순위 데이터는 상기 증강 현실 장치의 사용자 및 다른 외부 장치의 다른 사용자의 입력 정 보에 기초하여 결정된 우선 순위 정보를 포함하고, 상기 개인 우선 순위 데이터는 상기 증강 현실 장치의 상기 사용자가 상기 제1 객체를 인식한 시간(time)을 포함할 수 있다. 일 실시 예에 따르면, 상기 제1 우선 순위 데이터는 콘텐츠 분류 정보에 대한 상기 디스플레이 상의 노출 정보 를 더 포함하고, 상기 디스플레이 상의 노출 정보는 상기 증강 현실 장치의 사용자의 연령 및 상기 사용자가 증 강 현실 장치에 입력한 노출 차단 정보를 포함할 수 있다. 일 실시 예에 따르면, 상기 제1 증강 현실 콘텐츠는 상기 제1 객체의 정보, 및/또는 상기 제1 객체와 실질적으 로 동일한 상기 제1 콘텐츠 분류 정보에 속하는 제2 객체의 정보를 포함할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 상기 카메라를 이용하여 상기 사용자의 시선 방향의 제2 이미지를 촬영 하고, 상기 촬영된 제2 이미지에 포함된 제2 객체를 인식하고, 상기 인식한 제2 객체가 속하는 제2 콘텐츠 분류 정보를 포함하는 제2 객체 데이터를 추가 생성하고, 상기 제2 객체 데이터에 기초하여, 상기 제2 콘텐츠 분류 정보에 대한 우선 순위를 포함하는 제2 우선 순위 데이터를 획득하고, 상기 획득한 제2 우선 순위 데이터에 기 초하여, 상기 카메라를 이용하여 획득된 제2 이미지에 포함된 적어도 하나의 객체 중에서 제2 관심 객체를 선택 하고, 상기 제2 관심 객체와 상기 제1 관심 객체 중 우선 순위 값이 큰 값을 가지는지 주요(main) 관심 객체를식별하고, 상기 우선 순위 값은 상기 제1 관심 객체 및 상기 제2 관심 객체에 대해 상기 사용자가 인식한 시간 값을 포함하고, 상기 제2 관심 객체가 상기 주요 관심 객체로 선택된 경우, 상기 제2 관심 객체와 연관된 정보 를 포함하는 제2 증강 현실 콘텐츠를 디스플레이 할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 상기 생성된 제1 객체 데이터를 서버에 전송하고, 상기 전송된 제1 객체 데이터에 기초하여 생성한 상기 제1 우선 순위 데이터를, 상기 서버로부터 획득할 수 있다. 다양한 실시 예에 따르면, 증강 현실 장치는, 디스플레이, 센서, 카메라, 및 상기 디스플레이, 상기 센서 및 상 기 카메라와 작동적으로 연결된 프로세서를 포함하고, 상기 프로세서는 상기 센서를 이용하여 상기 사용자의 시 선을 검출하고, 상기 카메라를 이용하여 상기 추적한 사용자 시선 방향의 제1 이미지를 획득하고, 상기 획득한 제1 이미지 내의 객체들 및 상기 객체들에 대한 상기 사용자의 시선과 관련된 제1 객체 데이터를 생성하고, 상 기 생성된 제1 객체 데이터를 서버로 전송하고, 상기 증강 현실 장치로부터 상기 서버로 제공된 상기 제1 객체 데이터 및 적어도 하나의 다른 증강 현실 장치로부터 상기 서버에게 제공된 다른 객체 데이터에 기초하여, 상기 서버에 의해 생성된 공통(common) 우선 순위 데이터를, 상기 서버로부터 수신하고, 상기 증강 현실 장치에서 생 성된 상기 제1 객체 데이터를 이용하여 상기 공통 우선 순위 데이터로부터 상기 증강 현실 장치의 사용자에 대 한 개인화(private) 우선 순위 데이터를 생성하고, 상기 개인화 우선 순위 데이터에 기초하여, 상기 제1 이미지 내의 객체들 중에서 상기 사용자의 제1 관심 객체를 선택하고, 상기 제1 관심 객체 및 상기 제1 관심 객체와 관 련된 추가 정보를 포함하는 증강 현실 콘텐츠를 디스플레이 할 수 있다. 일 실시 예에 따르면, 상기 제1 객체 데이터는 상기 사용자가 상기 제1 이미지 내의 객체들 각각을 인식한 빈도 수(frequency), 상기 객체들 각각을 인식한 시간(time), 및/또는 상기 객체들 각각을 인식한 기간(period)을 포 함할 수 있다. 일 실시 예에 따르면, 상기 공통 우선 순위 데이터 및 상기 개인화 우선 순위 데이터는 상기 제1 객체 데이터를 이용하여 상기 제1 이미지 내의 상기 객체들 중 상기 증강 현실 장치의 사용자의 관심도가 높은 객체로 순위화 (ranked) 할 수 있다. 일 실시 예에 따르면, 상기 공통 우선 순위 데이터는 상기 증강 현실 장치의 상기 사용자 및 다른 증강 현실 장 치의 다른 사용자의 입력 정보에 기초하여 결정된 우선 순위 정보를 포함할 수 있다. 일 실시 예에 따르면, 상기 개인화 우선 순위 데이터는 상기 증강 현실 장치의 사용자가 상기 제1 이미지 내의 상기 객체들 중 제1 객체를 인식한 시간(time)을 포함할 수 있다. 일 실시 예에 따르면, 상기 제1 관심 객체와 관련된 추가 정보는 상기 제1 객체와 실질적으로 동일한 카테고리 에 속하는 제2 객체의 정보를 포함할 수 있다. 다양한 실시 예에 따른, 증강 현실 장치의 동작 방법은 상기 센서를 이용하여 상기 사용자의 시선을 검출하는 단계, 상기 카메라를 이용하여 상기 추적한 사용자의 시선 방향의 제1 이미지를 획득하는 단계, 상기 획득한 제 1 이미지 내의 현실 객체들의 정보 및 상기 현실 객체들에 대한 상기 사용자의 시선과 관련된 제1 객체 데이터 를 생성하는 단계, 상기 생성된 제1 객체 데이터를 서버로 전송하는 단계, 상기 증강 현실 장치로부터 상기 서 버로 제공된 상기 제1 객체 데이터 및 적어도 하나의 다른 증강 현실 장치로부터 상기 서버에게 제공된 다른 객 체 데이터에 기초하여, 상기 서버에 의해 생성된 공통(common) 우선 순위 데이터를, 상기 서버로부터 수신하는 단계, 상기 증강 현실 장치에서 생성된 상기 객체 데이터를 이용하여 상기 공통 우선 순위 데이터로부터 상기 증강 현실 장치의 사용자에 대한 개인화(private) 우선 순위 데이터를 생성하는 단계, 상기 개인화 우선 순위 데이터에 기초하여, 상기 제1 이미지 내의 객체들 중에서 상기 사용자의 제1 관심 객체를 선택하는 단계, 및 상 기 제1 관심 객체 및 상기 제1 관심 객체와 관련된 추가 정보를 포함하는 증강 현실 콘텐트를 디스플레이 하는 단계를 포함할 수 있다. 일 실시 예에 따르면, 상기 제1 객체 데이터는 상기 사용자가 상기 제1 이미지 내의 상기 객체들 각각을 인식한 빈도수(frequency), 상기 객체들 각각을 인식한 시간(time), 및/또는 상기 객체들 각각을 인식한 기간(period) 을 포함할 수 있다. 일 실시 예에 따르면, 상기 공통 우선 순위 데이터는 상기 증강 현실 장치의 상기 사용자 및 다른 증강 현실 장 치의 다른 사용자의 입력 정보에 기초하여 결정된 우선 순위 정보를 포함할 수 있다. 일 실시 예에 따르면, 상기 개인화 우선 순위 데이터는 상기 증강 현실 장치의 사용자가 상기 제1 이미지 내의 상기 현실 객체들 중 제1 객체를 인식한 시간(time)을 포함할 수 있다.일 실시 예에 따르면, 상기 제1 관심 객체와 관련된 추가 정보는 상기 제1 객체와 실질적으로 동일한 카테고리 에 속하는 제2 객체의 정보를 포함할 수 있다. 본 문서에 개시된 다양한 실시 예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시 예에 따른 전자 장치는 전술한 기기들에 한정 되지 않는다. 본 문서의 다양한 실시 예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시 예들로 한정하려는 것이 아니며, 해당 실시 예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한 다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아 이템에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구 들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \" 제1\", \"제2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하 기 위해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제1) 구성요소가 다른(예: 제2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소 에 직접적으로(예: 유선으로), 무선으로, 또는 제3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 다양한 실시 예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포 함할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부가 될 수 있다. 예를 들면, 일 실시 예에 따르면, 모듈은 ASIC(application-specific integrated circui t)의 형태로 구현될 수 있다. 본 문서의 다양한 실시 예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨 어(예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행 될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형태로 제공될 수 있다. 여기서, '비일시적'은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전 자기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경 우와 임시적으로 저장되는 경우를 구분하지 않는다. 일 실시 예에 따르면, 본 문서에 개시된 다양한 실시 예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래 될 수 있다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: CD-ROM(compact disc read only memory))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어™)를 통해 또는 두 개의 사용자 장치들(예: 스마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경 우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시 예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상 의 다른 구성요소들 또는 동작들이 추가될 수 있다. 추가적으로 또는 대체적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시 예들에 따르면, 모듈, 프로그램 또는 다른 구 성요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기동작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다."}
{"patent_id": "10-2022-0009415", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시 예에 따른, 전자 장치 및 서버를 도시한 도면이다. 도 2는 일 실시 예에 따른, 전자 장치의 블록도이다. 도 3은 일 실시 예에 따른, 증강 현실 장치를 도시한다. 도 4는 일 실시 예에 따른, 증강 현실 콘텐츠를 디스플레이 하는 것을 나타낸 흐름도이다. 도 5는 일 실시 예에 따른, 증강 현실 장치의 객체 데이터를 도시한다. 도 6은 일 실시 예에 따른, 우선 순위 데이터를 생성하는 것을 나타낸 흐름도이다. 도 7은 일 실시 예에 따른, 증강 현실 콘텐츠를 디스플레이 하는 것을 나타낸 흐름도이다. 도 8은 일 실시 예에 따른, 전자 장치 및 서버를 도시한 도면이다. 도 9는 일 실시 예에 따른, 증강 현실 콘텐츠를 도시한 도면이다. 도 10은 일 실시 예에 따른, 증강 현실 콘텐츠를 도시한 도면이다. 도 11은 일 실시 예에 따른 네트워크 환경 내의 전자 장치를 도시한 도면이다. 도면의 설명과 관련하여, 동일 또는 유사한 구성요소에 대해서는 동일 또는 유사한 참조 부호가 사용될 수 있다."}
