{"patent_id": "10-2023-0045789", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0150006", "출원번호": "10-2023-0045789", "발명의 명칭": "농장 데이터를 처리하는 제어 장치와 그 방법, 및 상기 제어 장치를 포함하는 스마트팜 관리", "출원인": "(주)제로엔", "발명자": "박주면"}}
{"patent_id": "10-2023-0045789", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "스마트팜 내의 재배지들 각각에서 재배되는 농작물의 성장 상태 이미지들을 수신하고 분석하여 상기 농작물의외형적 특징들을 추출하는 단계;추출된 외형적 특징별로 상기 재배지들 각각에서 재배되는 농작물을 분류하는 단계;상기 추출된 외형적 특징별로 가중치들 중에서 상기 재배지들 각각에 일대일로 매핑된 가중치를 상기 재배지들각각에 부여하는 단계; 및상기 추출된 외형적 특징별로 상기 재배지들 각각에 부여된 가중치를 이용하여, 상기 재배지들 중에서 어느 하나의 재배지를 최적 재배지로 선택하는 단계를 포함하는 스마트팜을 제어하는 방법."}
{"patent_id": "10-2023-0045789", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 최적 재배지로 선택하는 단계는,상기 추출된 외형적 특징별로 상기 재배지들 각각에 부여된 가중치의 총합을 계산하는 단계;재배지별로 계산된 가중치의 총합을 크기 순서로 나열하는 단계;크기 순서로 나열된 가중치의 총합들 중에서 어느 하나를 선택 정보에 따라 선택하는 단계; 및상기 재배지들 중에서 선택된 가중치의 총합에 해당하는 상기 어느 하나의 재배지를 상기 최적 재배지로 선택하는 단계를 포함하는 스마트팜을 제어하는 방법."}
{"patent_id": "10-2023-0045789", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 농작물이 열매 식물일 때 상기 농작물의 외형적 특징들은 상기 열매 식물의 과실의 크기와 과실의 색상을포함하고,상기 농작물이 엽채류일 때 상기 농작물의 외형적 특징들은 상기 엽채류의 잎의 크기와 잎의 모양을 포함하는스마트팜을 제어하는 방법."}
{"patent_id": "10-2023-0045789", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 스마트팜 내의 상기 재배지들 각각에 대한 재배 환경 상태 정보를 수신하고 분석하여 상기 재배지들 각각에 대한 재배 환경 상태 값들을 생성하는 단계; 및상기 최적 재배지로 선택된 상기 어느 하나의 재배지에 대한 재배 환경 상태 값들을 이용하여, 상기 재배지들중에서 나머지 재배지들 각각에 대한 재배 환경 상태 값들을 변경하기 위한 제어 신호들을 생성하는 단계를 더포함하는 스마트팜을 제어하는 방법."}
{"patent_id": "10-2023-0045789", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 재배 환경 상태 정보는 온도 정보, 습도 정보, CO2 농도 정보, 조도 정보, 풍속 정보, 및 pH 중에서 적어도 두 개를 포함하는 스마트팜을 제어하는 방법."}
{"patent_id": "10-2023-0045789", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 기재된 스마트팜을 제어하는 방법을 실행하기 위해 컴퓨터로 읽을 수 있는 기록 매체에 저장된 컴퓨터공개특허 10-2024-0150006-3-프로그램."}
{"patent_id": "10-2023-0045789", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "스마트팜 내의 재배지들 각각에서 재배되는 농작물의 성장 상태 이미지들을 수신하는 통신 장치;인공 지능 컴퓨터 프로그램을 저장하는 메모리 장치;상기 통신 장치와 상기 메모리 장치에 연결되고, 상기 인공 지능 컴퓨터 프로그램을 실행하는 프로세서를 포함하고,상기 인공 지능 컴퓨터 프로그램이 상기 프로세서에 의해 실행됨에 따라 상기 인공 지능 컴퓨터 프로그램은,상기 성장 상태 이미지들을 상기 통신 장치를 통해 수신하고 분석하여 상기 농작물의 외형적 특징들을 추출하는단계:추출된 외형적 특징별로 상기 재배지들 각각에서 재배되는 농작물을 분류하는 단계;상기 추출된 외형적 특징별로, 가중치들 중에서 상기 재배지들 각각에 일대일로 매핑된 가중치를 상기 재배지들각각에 부여하는 단계; 및상기 추출된 외형적 특징별로 상기 재배지들 각각에 부여된 가중치를 이용하여, 상기 재배지들 중에서 어느 하나의 재배지를 최적 재배지로 선택하는 단계를 수행하는 스마트팜을 제어하는 데이터 처리 장치."}
{"patent_id": "10-2023-0045789", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 인공 지능 컴퓨터 프로그램은,상기 스마트팜 내의 상기 재배지들 각각에 대한 재배 환경 상태 정보를 상기 통신 장치를 통해 수신하고 분석하여 상기 재배지들 각각에 대한 재배 환경 상태 값들을 생성하는 단계; 및상기 최적 재배지로 선택된 상기 어느 하나의 재배지에 대한 재배 환경 상태 값들을 이용하여, 상기 재배지들중에서 나머지 재배지들 각각에 대한 재배 환경 상태 값들을 변경하기 위한 제어 신호들을 생성하는 단계를 더수행하는 스마트팜을 제어하는 데이터 처리 장치."}
{"patent_id": "10-2023-0045789", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 농작물이 열매 식물일 때 상기 농작물의 외형적 특징들은 상기 열매 식물의 과실의 크기와 과실의 색상을포함하고,상기 농작물이 엽채류일 때 상기 농작물의 외형적 특징들은 상기 엽채류의 잎의 크기와 잎의 모양을 포함하고,상기 재배 환경 상태 정보는 온도 정보, 습도 정보, CO2 농도 정보, 조도 정보, 풍속 정보, 및 pH 중에서 적어도 두 개를 포함하는 스마트팜을 제어하는 데이터 처리 장치."}
{"patent_id": "10-2023-0045789", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "데이터 처리 장치; 및스마트팜 내의 재배지들 각각에서 재배되는 농작물의 성장 상태 이미지들을 생성하여 상기 데이터 처리 장치로전송하는 이미지 센서를 포함하고,상기 데이터 처리 장치는,상기 성장 상태 이미지들을 수신하는 통신 장치;인공 지능 컴퓨터 프로그램을 저장하는 메모리 장치; 및상기 통신 장치와 상기 메모리 장치에 연결되고, 상기 인공 지능 컴퓨터 프로그램을 실행하는 프로세서를 포함하고,상기 인공 지능 컴퓨터 프로그램은,공개특허 10-2024-0150006-4-상기 성장 상태 이미지들을 상기 통신 장치를 통해 수신하고 분석하여 상기 농작물의 외형적 특징들을 추출하는단계:추출된 외형적 특징별로 상기 재배지들 각각에서 재배되는 농작물을 분류하는 단계;상기 추출된 외형적 특징별로, 가중치들 중에서 상기 재배지들 각각에 일대일로 매핑된 가중치를 상기 재배지들각각에 부여하는 단계; 및상기 추출된 외형적 특징별로 상기 재배지들 각각에 부여된 가중치를 이용하여, 상기 재배지들 중에서 어느 하나의 재배지를 최적 재배지로 선택하는 단계를 실행하는 스마트팜 관리 시스템."}
{"patent_id": "10-2023-0045789", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서, 상기 인공 지능 컴퓨터 프로그램은,상기 스마트팜 내의 상기 재배지들 각각에 대한 재배 환경 상태 정보를 상기 통신 장치를 통해 수신하고 분석하여 상기 재배지들 각각에 대한 재배 환경 상태 값들을 생성하는 단계; 및상기 최적 재배지로 선택된 상기 어느 하나의 재배지에 대한 재배 환경 상태 값들을 이용하여, 상기 재배지들중에서 나머지 재배지들 각각에 대한 재배 환경 상태 값들을 변경하기 위한 제어 신호들을 생성하는 단계를 더실행하는 스마트팜 관리 시스템."}
{"patent_id": "10-2023-0045789", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 농작물이 열매 식물일 때 상기 농작물의 외형적 특징들은 상기 열매 식물의 과실의 크기와 과실의 색상을포함하고,상기 농작물이 엽채류일 때 상기 농작물의 외형적 특징들은 상기 엽채류의 잎의 크기와 잎의 모양을 포함하고,상기 재배 환경 상태 정보는 온도 정보, 습도 정보, CO2 농도 정보, 조도 정보, 풍속 정보, 및 pH 중에서 적어도 두 개를 포함하는 스마트팜 관리 시스템."}
{"patent_id": "10-2023-0045789", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "스마트팜 내의 재배지들 각각에서 재배되는 농작물의 성장 상태 이미지들을 수신하고 분석하여 상기 농작물의제1특징과 제2특징을 추출하는 단계;추출된 제1특징에 따라 상기 재배지들 각각에서 재배되는 농작물을 분류하는 단계;추출된 제2특징에 따라 상기 재배지들 각각에서 재배되는 농작물을 분류하는 단계;상기 추출된 제1특징에 따라 상기 재배지들 각각에서 재배되는 농작물이 분류된 후, 가중치들 중에서 상기 재배지들 각각에 일대일로 매핑된 가중치를 상기 재배지들 각각에 부여하는 단계; 상기 추출된 제2특징에 따라 상기 재배지들 각각에서 재배되는 농작물이 분류된 후, 상기 가중치들 중에서 상기재배지들 각각에 일대일로 매핑된 가중치를 상기 재배지들 각각에 부여하는 단계; 및상기 추출된 제1특징에 따라 상기 재배지들 각각에 부여된 가중치와 상기 추출된 제2특징에 따라 상기 재배지들각각에 부여된 가중치를 이용하여, 상기 재배지들 중에서 어느 하나의 재배지를 최적 재배지로 선택하는 단계를포함하는 스마트팜을 제어하는 방법."}
{"patent_id": "10-2023-0045789", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 스마트팜 내의 상기 재배지들 각각에 대한 재배 환경 상태 정보를 수신하고 분석하여 상기 재배지들 각각에 대한 재배 환경 상태 값들을 생성하는 단계; 및상기 최적 재배지로 선택된 상기 어느 하나의 재배지에 대한 재배 환경 상태 값들을 이용하여, 상기 재배지들중에서 나머지 재배지들 각각에 대한 재배 환경 상태 값들을 변경하기 위한 제어 신호들을 생성하는 단계를 더포함하는 스마트팜을 제어하는 방법.공개특허 10-2024-0150006-5-"}
{"patent_id": "10-2023-0045789", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "농작물의 생산성을 높이기 위해 스마트팜을 제어하는 방법이 개시된다. 스마트팜을 제어하는 방법은 스마트팜 내 의 재배지들 각각에서 재배되는 농작물의 성장 상태 이미지들을 수신하고 분석하여 상기 농작물의 외형적 특징들 을 추출하는 단계와, 추출된 외형적 특징별로 상기 재배지들 각각에서 재배되는 농작물을 분류하는 단계와, 상기 추출된 외형적 특징별로 가중치들 중에서 상기 재배지들 각각에 일대일로 매핑된 가중치를 상기 재배지들 각각에 부여하는 단계와, 상기 추출된 외형적 특징별로 상기 재배지들 각각에 부여된 가중치를 이용하여, 상기 재배지들 중에서 어느 하나의 재배지를 최적 재배지로 선택하는 단계를 포함한다."}
{"patent_id": "10-2023-0045789", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 농장 또는 스마트팜에서 재배되는 농작물의 생산성을 높이기 위해 농장 데이터를 처리하는 기술에 관 한 것으로, 특히 농장 또는 스마트팜 내의 재배지들 각각에서 재배되는 농작물에 대한 농장 데이터(예를 들면, 재배 환경 상태 정보와 성장 상태 이미지들)를 분석하여 상기 농작물의 생산성을 높이기 위해 상기 농장 데이터 를 처리하는 제어 장치와 그 방법, 및 상기 제어 장치를 포함하는 스마트팜 관리 시스템에 관한 것이다."}
{"patent_id": "10-2023-0045789", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "스마트팜(smart farm)은 정보 통신 기술과 사물 인터넷 장치(Internet of Things(IoT)) 기술 등을 활용하여 농 업 생산성과 효율성을 높이기 위한 첨단 농업 시스템을 의미한다. 스마트팜은 농업 생산 환경을 자동으로 제어하고, 농작물의 생육 상태를 실시간으로 모니터링하여 생산성과 품 질을 높일 수 있다. 예를 들어, 스마트 센서를 활용하여 농작물의 수분, 영양분, 및 이산화탄소(CO2) 등의 상태 를 측정하고, 이들을 분석하여 적절한 환경을 제공할 수 있다. 또한, 드론을 이용하여 농작물의 상태를 진단하 거나, 로봇을 이용하여 자동으로 농작물의 수확 작업을 수행할 수 있다. 스마트팜은 농업 생산성과 효율성을 높일 뿐만 아니라, 환경 보호와 에너지 절약에도 기여한다. 예를 들면, 스 마트 센서를 활용하여 농약과 비료의 효율적인 사용을 도모하거나, 재생 에너지를 활용하여 전력을 절약할 수 있다. 스마트팜은 농업 분야에서 디지털 혁신의 한 예시로, 미래 농업의 중요한 기술 중 하나로 인식되고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 등록특허공보: 등록번호 10-1933657 (2019년04월05일 공고) (특허문헌 0002) 공개특허공보: 공개번호 10-2022-0082952 (2022년06월20일 공개) (특허문헌 0003) 등록특허공보: 등록번호 10-2300799 (2021년09월10일 공고) (특허문헌 0004) 등록특허공보: 등록번호 10-2504381 (2023년03월03일 공고)"}
{"patent_id": "10-2023-0045789", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 이루고자 하는 기술적인 과제는, 스마트팜(또는 농장) 내의 재배지들 각각에서 재배되는 농작물에 대 한 농장 데이터(예를 들면, 재배 환경 상태 정보와 성장 상태 이미지들)를 분석하여 상기 재배지들 중에서 어느 하나의 재배지를 최적 재배지로 선택하고, 상기 재배지들 중에서 선택되지 않은 재배지들 각각에 대한 재배 환 경 상태를 상기 최적 재배지에 대한 재배 환경 상태로 맞출 수 있는 제어 장치와 상기 제어 장치의 동작 방법, 및 상기 제어 장치를 포함하는 스마트팜 관리 시스템을 제공하는 것이다."}
{"patent_id": "10-2023-0045789", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시 예들에 따라 스마트팜을 제어하는 방법은 스마트팜 내의 재배지들 각각에서 재배되는 농작물의 성장 상태 이미지들을 수신하고 분석하여 상기 농작물의 외형적 특징들을 추출하는 단계와, 추출된 외형적 특징 별로 상기 재배지들 각각에서 재배되는 농작물을 분류하는 단계와, 상기 추출된 외형적 특징별로 가중치들 중에 서 상기 재배지들 각각에 일대일로 매핑된 가중치를 상기 재배지들 각각에 부여하는 단계와, 상기 추출된 외형 적 특징별로 상기 재배지들 각각에 부여된 가중치를 이용하여, 상기 재배지들 중에서 어느 하나의 재배지를 최 적 재배지로 선택하는 단계를 포함한다. 상기 스마트팜을 제어하는 방법은 상기 스마트팜 내의 상기 재배지들 각각에 대한 재배 환경 상태 정보를 수신 하고 분석하여 상기 재배지들 각각에 대한 재배 환경 상태 값들을 생성하는 단계와, 상기 최적 재배지로 선택된 상기 어느 하나의 재배지에 대한 재배 환경 상태 값들을 이용하여, 상기 재배지들 중에서 나머지 재배지들 각각 에 대한 재배 환경 상태 값들을 변경하기 위한 제어 신호들을 생성하는 단계를 더 포함한다. 본 발명의 실시 예들에 따라 스마트팜을 제어하는 데이터 처리 장치는 스마트팜 내의 재배지들 각각에서 재배되 는 농작물의 성장 상태 이미지들을 수신하는 통신 장치와, 인공 지능 컴퓨터 프로그램을 저장하는 메모리 장치 와, 상기 통신 장치와 상기 메모리 장치에 연결되고, 상기 인공 지능 컴퓨터 프로그램을 실행하는 프로세서를 포함하고, 상기 인공 지능 컴퓨터 프로그램이 상기 프로세서에 의해 실행됨에 따라 상기 인공 지능 컴퓨터 프로 그램은 상기 성장 상태 이미지들을 상기 통신 장치를 통해 수신하고 분석하여 상기 농작물의 외형적 특징들을 추출하는 단계와, 추출된 외형적 특징별로 상기 재배지들 각각에서 재배되는 농작물을 분류하는 단계와, 상기 추출된 외형적 특징별로, 가중치들 중에서 상기 재배지들 각각에 일대일로 매핑된 가중치를 상기 재배지들 각각 에 부여하는 단계와, 상기 추출된 외형적 특징별로 상기 재배지들 각각에 부여된 가중치를 이용하여, 상기 재배 지들 중에서 어느 하나의 재배지를 최적 재배지로 선택하는 단계를 수행한다. 상기 인공 지능 컴퓨터 프로그램은 상기 스마트팜 내의 상기 재배지들 각각에 대한 재배 환경 상태 정보를 상기 통신 장치를 통해 수신하고 분석하여 상기 재배지들 각각에 대한 재배 환경 상태 값들을 생성하는 단계와, 상기 최적 재배지로 선택된 상기 어느 하나의 재배지에 대한 재배 환경 상태 값들을 이용하여, 상기 재배지들 중에서 나머지 재배지들 각각에 대한 재배 환경 상태 값들을 변경하기 위한 제어 신호들을 생성하는 단계를 더 수행한 다. 본 발명의 실시 예들에 따라 스마트팜 관리 시스템은 데이터 처리 장치와, 스마트팜 내의 재배지들 각각에서 재 배되는 농작물의 성장 상태 이미지들을 생성하여 상기 데이터 처리 장치로 전송하는 이미지 센서를 포함하고, 상기 데이터 처리 장치는 상기 성장 상태 이미지들을 수신하는 통신 장치와, 인공 지능 컴퓨터 프로그램을 저장 하는 메모리 장치와, 상기 통신 장치와 상기 메모리 장치에 연결되고, 상기 인공 지능 컴퓨터 프로그램을 실행 하는 프로세서를 포함하고, 상기 인공 지능 컴퓨터 프로그램은 상기 성장 상태 이미지들을 상기 통신 장치를 통 해 수신하고 분석하여 상기 농작물의 외형적 특징들을 추출하는 단계와, 추출된 외형적 특징별로 상기 재배지들 각각에서 재배되는 농작물을 분류하는 단계와, 상기 추출된 외형적 특징별로, 가중치들 중에서 상기 재배지들 각각에 일대일로 매핑된 가중치를 상기 재배지들 각각에 부여하는 단계와, 상기 추출된 외형적 특징별로 상기 재배지들 각각에 부여된 가중치를 이용하여, 상기 재배지들 중에서 어느 하나의 재배지를 최적 재배지로 선택하 는 단계를 실행한다."}
{"patent_id": "10-2023-0045789", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시 예에 따른 제어 장치, 이의 동작 방법, 및 상기 제어 장치를 포함하는 스마트팜 관리 시스템은, 생산성(병충해 개선을 포함)을 높이기 위해 스마트팜(또는 농장) 내의 재배지들 각각에서 재배되는 농작물에 대 한 농장 데이터(예를 들면, 재배 환경 상태 정보와 성장 상태 이미지들)를 분석하여 상기 재배지들 중에서 어느 하나의 재배지를 최적 재배지로 선택할 수 있는 효과가 있다. 이에 따라 제어 장치와 스마트팜 관리 시스템은 재배지들 중에서 선택되지 않은 재배지들 각각에 대한 재배 환 경 상태를 최적 재배지에 대한 재배 환경 상태로 실시간으로 맞출 수 있는(또는 동기화) 효과가 있다. 본 발명의 실시 예에 따른 제어 장치, 이의 동작 방법, 및 상기 제어 장치를 포함하는 스마트팜 관리 시스템은, 재배지별로 농작물 성장 이상 여부 및/또는 병충해 발생 여부(또는 병충해 발생 가능성)를 사용자에게 제공할 수 있는 효과가 있다."}
{"patent_id": "10-2023-0045789", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 1, "content": "도 1은 본 발명의 실시 예에 따른 스마트팜 관리 시스템의 블록도이다. 도 1을 참조하면, 스마트팜(이를 농장, 온실, 또는 비닐하우스라고도 한다.) 관리(또는 제어) 시스템은 스 마트팜, 단말기(또는 컴퓨팅 장치, 160), 및 서버를 포함한다. 단말기는 PC(또는 데스크 탑 컴 퓨터) 또는 모바일 장치일 수 있고, 상기 모바일 장치는 스마트폰, PDA(Personal Digital Assistant), 또는 랩 탑 컴퓨터, 등일 수 있다. 스마트팜은 복수 개의 창문들(이를 환기 장치들이라고도 한다. 110_1~110_4), 농작물들을 재배하는 재배지 , 데이터 처리 장치(또는 스마트팜 제어(또는 모니터링) 장치, 130), 및 재배 환경 제어 장치를 포함 한다. 복수개의 창문들(110_1~110_4) 각각은 스마트팜의 측면 또는 천정에 형성될 수 있다. 재배지은 복수 개의 재배지들(R1~R8)을 포함한다. 본 명세서에서 농작물이 재배되는 재배지는 재배 시설, 재배실, 재배 공간, 또는 모종판, 등으로 불릴 수 있고, 이들을 재배지라 총칭한다. 실시 예들에 따라, 재배지 는 수직 재배 시설 또는 수평 재배 시설을 의미한다. 각 재배지(R1~R8)에는 농작물의 재배 환경들(예를 들면, 토양 환경, 기후 환경, 공기 환경, 수질 환경, 및/또는 재배 시설 환경, 등)을 감지하는 센서들 (122_1~122_8)과, 상기 농작물의 성장 상태에 대한 성장 상태 이미지들 (또는 성장 상태 영상 정보)을 생성하는 이미지 센서(예를 들면, 카메라, 124_1~124_8)가 배치된다. 각 센서 (122_1~122_8)와 각 이미지 센서(124_1~124_8)는 IoT 장치일 수 있다. 재배 환경들은 온도, 습도, 이산화탄소(CO2) 농도, 조도, 풍속, 및 pH 등을 포함한다. 따라서, 각 재배지 (R1~R8)에 설치되는 각 센서(122_1~122_8)는 각 재배지(R1~R8)의 재배 환경들 각각을 감지할 수 있는 센서들을 총칭한다. 예를 들면, 제1재배지(R1)에 설치되는 제1센서(122_1)는 온도 센서, 습도 센서, 이산화탄소(CO2) 농도 센서, 조 도 센서, 풍속 센서, 및 pH 센서 등을 포함하고, 제8재배지(R8)에 설치되는 제8센서(122_8)는 온도 센서, 습도 센서, 이산화탄소(CO2) 농도 센서, 조도 센서, 풍속 센서, 및 pH 센서 등을 포함한다. 각 센서(122_1~122_8)는 그 안에 포함된 통신 장치를 통해 데이터 처리 장치 로 감지 신호를 전송할 수 있 다. 각 이미지 센서(124_1~124_8)는 그 안에 포함된 통신 장치를 통해 데이터 처리 장치로 이미지 신호를 전송할 수 있다. 통신 장치는 무선 통신 장치 또는 유선 통신 장치를 의미한다. 데이터 처리 장치는 아래와 같은 기능들을 수행할 수 있다. 1. 정보 수집 주기(예를 들면, 1분)마다 각 센서(122_1~122_8)로부터 감지 신호들을 수신하고 분석하고, 학습하 여 재배 환경 상태 빅데이터(BDATA1)를 생성하는 기능, 2. 정보 수집 주기마다 각 이미지 센서(124_1~124_8)로부터 이미지 신호들을 수신하고 분석하고, 학습하여 성장 상태 빅데이터(BDATA2)를 생성하는 기능,3. 재배 환경 상태 빅데이터(BDATA1)와 성장 상태 빅데이터(BDATA2)를 재배지(R1~R8)별로 동기화하는 기능, 4. 서버로부터 참고용 빅데이터(BDATA4)를 수신하고, 참고용 빅데이터 (BDATA4)를 이용하여 재배 환경 상 태 빅데이터(BDATA1)를 보정, 업데이트, 또는 동기화하는 기능, 5. 수신된 참고용 빅데이터(BDATA4)를 이용하여, 성장 상태 빅데이터 (BDATA2)를 보정, 업데이트, 또는 동기화 하는 기능, 6. 재배 환경 상태 빅데이터(BDATA1)와 성장 상태 빅데이터(BDATA2)를 이용하여 재배지들(R1~R8) 중에서 어느 하나를 최적 재배지로 선택하는 기능, 7. 선택된 최적 재배지에 대한 재배 환경 상태 값들을 이용하여, 나머지 재배지들 각각의 재배 환경 상태 값들 을 제어하는 기능, 8. 성장 상태 빅데이터(BDATA2)를 이용하여 재배지들(R1~R8) 각각에 대한 병충해 정보를 분석하고 학습하여 재 배지들(R1~R8) 각각에 대한 병충해 정보와 병충해 개선 정보를 제공하는 기능, 9. 재배 환경 제어 장치에 포함된 제어 장치들(141, 143, 145, 147, 149, 및 151) 각각에 대한 제어 정보 를 분석하고, 학습하여 재배 환경 제어 장치 제어 빅데이터(BDATA3)를 생성하는 기능, 등 데이터 처리 장치는 스마트팜 내의 재배지들(R1~R8) 각각에서 재배되는 농작물(CR1)의 성장 상태 이 미지들에 관련된 이미지 신호들을 수신하는 통신 장치와, 인공 지능 컴퓨터 프로그램을 저장하는 메 모리 장치(이를 데이터 저장 장치 또는 데이터베이스라고도 한다. 138)와, 통신 장치와 메모리 장치 에 연결되고 인공 지능 컴퓨터 프로그램을 실행하는 프로세서를 포함한다. 인공 지능 컴퓨터 프로그램은 저장(또는 기록) 매체에 저장되고 프로세서에 의해 실행된다. 인공 지능 컴퓨터 프로그램이 프로세서에 의해 실행됨에 따라 인공 지능 컴퓨터 프로그램은 성 장 상태 이미지들을 통신 장치를 통해 수신하고 분석하여 각 재배지(R1~R8)에서 재배되는 농작물(CR1)의 외형적 특징들(예를 들면, 도 4의 IN, IS, IC, IK, 및 IF)을 추출(또는 분석)하고, 추출된(또는 분석된) 외형적 특징(예를 들면, 도 4의 IN, IS, IC, IK, 및 IF)별로 각 재배지 (R1~R8)에서 재배되는 농작물을 도 7을 참조하 여 설명될 방법에 따라 분류(또는 나열)한다. 인공 지능 컴퓨터 프로그램은 추출된 외형적 특징(예를 들면, 도 4의 IN, IS, IC, IK, 및 IF)별로, 도 8을 참조하여 설명될 가중치들(WT1~WT8) 중에서 각 재배지(R1~R8)에 일대일로 매핑(mapping)된 또는 대응된 가중치 를 각 재배지 (R1~R8)에 부여한다. 도 8와 도 11을 참조하여 설명될 방법에 따라 인공 지능 컴퓨터 프로그램 은 추출된 외형적 특징(예를 들 면, 도 4의 IN, IS, IC, IK, 및 IF)별로 각 재배지(R1~R8)에 부여된 가중치를 이용하여, 재배지들(R1~R8) 중에 서 어느 하나의 재배지를 최적 재배지로 선택한다. 인공 지능 컴퓨터 프로그램은 스마트팜 내의 재배지들(R1~R8) 각각에 대한 재배 환경 상태 정보를 통 신 장치를 통해 수신하고 분석하여 재배지들(R1~R8) 각각에 대한 재배 환경 상태 값들을 생성하고, 재배지 들(R1~R8) 중에서 최적 재배지로 선택된 재배지(예를 들면, 도 11에서는 제6재배지(R6))에 대한 재배 환경 상태 값들을 이용하여, 재배지들(R1~R8) 중에서 나머지 재배지들(R1~R5, R7, 및 R8) 각각에 대한 재배 환경 상태 값 들을 변경(또는 제어)하기 위한 제어 신호들(CTLi, i는 자연수)을 생성한다. 재배 환경 제어 장치는 하나 또는 그 이상의 제어 신호들(CTLi)에 기초하여 각 재배지(R1~R8)의 재배 환경 상태를 독립적으로 또는 개별적으로 제어한다. 통신 장치는 각 센서(122_1~122_8)와 통신하는 기능, 각 이미지 센서 (124_1~124_8)와 통신하는 기능, 재 배 환경 제어 장치와 통신하는 기능, 단말기와 통신하는 기능, 및 프로세서와 통신하는 기능을 포함하는 통신 장치들을 총칭한다. 프로세서는 데이터 저장 장치에 저장된 인공 지능 컴퓨터 프로그램을 실행하여 앞에서 나열된 데이터 처리 장치의 기능들을 수행한다. 예를 들면, 인공 지능 컴퓨터 프로그램은 머신러닝(machine learning) 알고리즘을 사용하여 재배 환경 상태 빅데이터(BDATA1)와 성장 상태 빅데이터(BDATA2)를 분석하여 각 재배지(R1~R8)에서 재배되는 농작물의 외형적 특징들을 추출하고 수확량을 예측할 수 있다.재배 환경 제어 장치는 재배지(R1~R8)별로 재배 환경들 각각을 제어하거나 스마트팜 전체의 재배 환 경들을 제어할 수 있다. 재배 환경 제어 장치는 냉방기, 난방기, 창문 개폐기, 급수 제어기, 양액 공급기 , 및 조도 제어기를 포함한다. 냉방기는, 인공 지능 컴퓨터 프로그램에 의해 생성된 제1제어 신호(CTLi, i=1)에 응답하여, 재배지 (R1~R8)별로 또는 스마트팜 전체의 냉방을 자동으로 제어할 수 있다. 난방기는, 인공 지능 컴퓨터 프로그램에 의해 생성된 제2제어 신호 (CTLi, i=2)에 응답하여, 재배지 (R1~R8)별로 또는 스마트팜 전체의 난방을 자동으로 제어할 수 있다. 창문 개폐기는, 인공 지능 컴퓨터 프로그램에 의해 생성된 제3제어 신호(CTLi, i=3)에 응답하여, 창 문들(110_1~110_4) 중에서 적어도 하나의 창문의 개폐, 또는 개폐율을 자동으로 제어할 수 있다. 급수 제어기는, 인공 지능 컴퓨터 프로그램에 의해 생성된 제4제어 신호(CTLi, i=4)에 응답하여, 재 배지(R1~R8)별로 또는 스마트팜 전체의 급수(또는 습도)를 자동으로 제어할 수 있다. 양액 공급기는, 인공 지능 컴퓨터 프로그램에 의해 생성된 제5제어 신호(CTLi, i=5)에 응답하여, 재 배지(R1~R8)별로 양액의 조성을 자동으로 제어할 수 있다. 여기서, 양액은 농작물이 성장하는 데 필요한 영양소 들을 포함하는 시스템(예를 들면, 수직 재배 시스템)에서 사용되는 액체이고, 상기 양액은 물과 함께 사용되며, 물에 다양한 비율로 영양소들을 혼합하여 사용한다. 예를 들면, 양액은 질소, 인, 칼륨, 칼슘, 마그네슘, 및 황 등과 같은 무기 물질들을 포함할 수 있다. 조도 제어기는, 인공 지능 컴퓨터 프로그램에 의해 생성된 제6제어 신호(CTLi, i=6)에 응답하여, 재 배지(R1~R8)별로 또는 스마트팜 전체의 조도를 작동으로 제어할 수 있다. 실시 예들에 따라, 인공 지능 컴퓨터 프로그램은 재배지(R1~R8)별로 또는 스마트팜 전체의 재배 환경 들을 제어하기 위해 제어 신호들(CTL1~CTL6) 중에서 하나 또는 2이상의 제어 신호들을 동시에, 순차적으로, 또 는 병렬적으로 생성할 수 있다. 단말기는 재배지(R1~R8)별로 또는 스마트팜 전체의 재배 환경들을 나타내는 재배 환경 상태 정보(또 는 재배 환경 상태 값들)를 데이터 처리 장치 로부터 수신하여 표시할 수 있다. 단말기는 재배지(R1~R8)별로 또는 스마트팜 전체에서 재배되는 농작물의 성장 상태 이미지들(또는 외 형적 특징들)을 데이터 처리 장치로부터 수신하여 표시할 수 있다. 단말기는 재배 환경 제어 장치에 대한 제어 정보를 데이터 처리 장치로부터 수신하여 표시할 수 있다. 단말기는 성장 이상 정보 또는 병충해 이상 정보를 데이터 처리 장치 로부터 수신하여 표시할 수 있 다. 서버는 참고용 빅데이터(BDATA4)를 생성하고, 데이터 처리 장치의 전송 요청에 따라 참고용 빅데이터 (BDATA4)를 통신 장치로 전송할 수 있다. 인공 지능 컴퓨터 프로그램는 참고용 빅데이터(BDATA4)를 통신 장치를 통해 수신하여 활용할 수 있다. 도 2a와 도 2b는 도 1에 도시된 스마트팜 관리 시스템의 동작을 설명하는 플로우차트이고, 도 3은 도 1에 도시 된 데이처 처리 장치의 동작을 설명하는 개념도이고, 도 4는 제1정보 수집 주기에서 수집된 재배 환경 상태 값 들과 외형적 특징들의 일시 예이이고, 도 7은 도 1에 도시된 재배지들 각각에서 재배되는 농작물의 외형적 특징 을 분석하는 과정을 설명하는 개념도이다. 도 1 내지 도 4를 참조하면, 제1정보 수집 주기(tm_1)에서 수집된 제1정보 (DT1, 또는 제1농장 데이터)는 각 재 배지(R1~R8)의 센서 정보(이를 '재배 환경 상태 정보'라고도 한다.)와 각 재배지(R1~R8)의 영상 정보(이를 '성 장 상태 이미지들'이라 한다.)를 포함한다. 도 4 내지 도 6에서는 설명의 편의를 위해, 각 재배지(R1~R8)에서 동일한 농작물(CR1)이 재배되는 것으로 표시 되어 있으나, 실시 예들에 따라 재배지들(R1~R8)의 일부에는 제1종류의 농작물이 재배되고, 재배지들(R1~R8)의 나머지 일부에는 제2종류의 농작물이 재배될 수 있다.각 재배지(R1~R8)의 센서 정보는 재배 환경 상태 값들, 예를 들면, 온도 (T1_1~T1_8), 습도(H1_1~H1_8), CO2 농도(D1_1~D1_8), 조도(L1_1~L1_8), 풍속 (W1_1~W1_8), 및 pH(P1_1~P1_8)을 포함한다. 각 재배지(R1~R8)의 성장 상태 이미지는 각 재배지(R1~R8)에서 재배되는 농작물의 종류에 따라 서로 다른 외형 적 특징들을 포함할 수 있다. 실시 예들에 따라, 각 재배지(R1~R8)에서 재배되는 농작물의 종류를 판단하기 위해, 인공 지능 컴퓨터 프로그램 는 참고용 빅데이터(BDATA4)를 이용 또는 참조할 수 있다. 1. 농작물의 종류가 제1타입(type) 농작물(예를 들면, 열매 식물)일 때 열매 식물(이하, 딸기, 블루베리, 토마토, 참외, 파일애플, 또는 수박 등과 같이 식용 가능한 열매를 맺는 식물 을 총칭한다.)의 성장 상태를 판단하는 가장 중요한 요소들은 크기, 색상, 및 외형이다. 일반적으로, 성장한 과일(이를 '과실'이라고도 한다)은 크기가 크고, 색상이 선명하고, 전체적으로 균일한 색상 을 갖는다. 열매 식물의 잎의 개수와 줄기의 굵기는 과일의 성장 상태를 판단하는 데 중요한 역할을 할 수 있지 만, 과일의 크기, 색상, 및 외형이 더 중요하다. 과일의 외형은 상기 과일의 특징(또는 특성)에 따라 다양하게 나타난다. 일반적으로, 성장한 과일은 표면이 매 끄럽고 균일하고, 상처나 변색이 없어야 한다. 또한, 과일의 외형이 대칭적이어야 하고, 상기 과일의 표면에 흠 집, 벌레 먹은 부분, 부패나 썩은 부분 등이 없어야 한다. 과일의 종류에 따라 외형이 다르게 나타날 수 있다. 예를 들면, 사과는 둥글고 부드러운 외형이 특징이고, 바나 나는 곡선 모양이 특징이고, 수박은 크기가 크고 둥근 모양을 띄고 있다. 열매 식물의 잎의 크기와 개수는 광량, 온도, 수분, 영양분, 및 대기 중 이산화탄소 농도 등의 재배 환경 상태 (또는 조건)에 따라 달라질 수 있다. 또한, 열매 식물의 잎의 색상은 광량과 온도에 영향을 받는다. 빛이 충분 하지 않으면 잎의 색상은 더 어둡고 푸르스름한 색상을 띠고, 빛을 더 많은 빛을 받으면 잎의 색상은 더 밝고 노란색 혹은 빨간색으로 바뀐다. 따라서, 농작물의 종류가 제1타입 농작물(예를 들면, 열매 식물)일 때, 각 재배지(R1~R8)에서 재배되는 각 농작 물의 이미지는 상기 제1타입 농작물의 제1외형적 특징들을 포함한다. 제1외형적 특징들의 예들은 과실의 크기, 색상, 색상이 균일한 정도, 외형, 표면 상태, 열매의 개수, 잎의 크기, 잎의 개수, 잎의 색상, 및 줄기의 두께 등을 포함한다. 도 4 내지 도 6을 참조하면, 제1특징(IN)은 과실의 크기, 과실이 얼마나 익었는지를 판단하기 위한 과실의 색상, 과실의 색상이 균일한 정도(이를 '색상의 균일도'라 한다.), 과실의 외형, 과실의 표면 상태(예를 들면, 벌레 먹은 부분의 존재 여부, 변색(또는 탈색)된 부분의 존재 여부, 및/또는 썩은 부분의 존재 여부, 등), 과실 의 개수, 잎의 크기, 잎의 개수, 잎의 색상, 및 줄기의 두께 중에서 어느 하나(예를 들면, 과실의 크기)라고 가 정한다. 제2특징(IS)은 과실의 크기, 과실의 색상, 색상의 균일도, 과실의 외형, 과실의 표면 상태, 과실의 개수, 잎의 크기, 잎의 개수, 잎의 색상, 및 줄기의 두께 중에서 다른 하나(예를 들면, 과실의 색상)라고 가정한다. 제3특징(IC)은 과실의 크기, 과실의 색상, 색상의 균일도, 과실의 외형, 과실의 표면 상태, 과실의 개수, 잎의 크기, 잎의 개수, 잎의 색상, 및 줄기의 두께 중에서 또 다른 하나(예를 들면, 색상의 균일도)라고 가정한다. 제4특징(IK)은 과실의 크기, 과실의 색상, 색상의 균일도, 과실의 외형, 과실의 표면 상태, 과실의 개수, 잎의 크기, 잎의 개수, 잎의 색상, 및 줄기의 두께 중에서 또 다른 하나(예를 들면, 과실의 표면 상태)라고 가정한다. 제5특징(IF)는 과실의 크기, 과실의 색상, 색상의 균일도, 과실의 외형, 과실의 표면 상태, 과실의 개수, 잎의 크기, 잎의 개수, 잎의 색상, 및 줄기의 두께 중에서 또 다른 하나(예를 들면, 과실의 개수, 잎의 크기, 잎의 개수, 잎의 색상, 및 줄기의 두께 중에서 어느 하나(예를 들면, 잎의 크기))라고 가정한다. 2. 농작물의 종류가 제2타입 농작물(예를 들면, 엽채류)일 때 엽채류의 성장 상태를 판단하는 가장 중요한 요소는 해당 식물의 잎의 상태이다. 예를 들면, 엽채류의 성장 상 태를 판단할 때는 잎의 크기, 잎의 모양, 잎의 색상/무늬, 잎의 개수, 및 잎의 표면 상태(예를 들면, 벌레 먹은 부분의 존재 여부, 변색(또는 탈색)된 부분의 존재 여부, 및/또는 썩은 부분의 존재 여부, 등), 및 줄기의 두께 등을 고려한다. 잎의 크기는 해당 식물이 적절한 양의 영양분과 물을 흡수하고 있는지, 성장 상태가 좋은지를 나타내는 지표 중 하나이다. 잎의 크기가 너무 작거나 크면, 해당 식물이 영양분이나 물이 부족하거나 과다한 양을 흡수하고 있다 는 것을 나타낸다. 잎의 모양은 해당 식물의 성장 상태를 판단하는 또 다른 중요한 지표이다. 일반적으로, 잎사귀가 부드럽고 살짝 굽어지지 않고 직선적이며, 가장자리가 평평하고 규칙적인 형태를 유지하면 성장 상태가 좋은 것으로 판단된다. 잎의 색상과 무늬는 해당 식물의 성장 상태를 판단하는 또 다른 지표이다. 대부분의 엽채류는 생장 상태가 좋을 때 깊은 색상과 선명한 무늬를 가지고 있으며, 노란색이나 갈색 같은 빈약한 색상이나 차가운 색상은 생장 상태 가 좋지 않은 것을 나타낼 수 있다. 잎사귀의 수는 해당 식물의 성장 상태를 판단하는 또 다른 지표이다. 일반적으로, 엽채류는 생장 상태가 좋을 때 더 많은 잎사귀를 가지고 있다. 따라서, 해당 식물의 잎사귀의 수가 적거나 너무 많은 경우, 생장 상태가 좋 지 않을 수 있다. 따라서, 농작물의 종류가 제2농작물(예를 들면, 엽채류)일 때, 각 재배지 (R1~R8)에서 재배되는 각 농작물의 이 미지는 상기 제2농작물의 제2외형적 특징들을 포함한다. 제2외형적 특징들의 예들은 잎의 크기, 잎의 모양, 잎의 색상과 무늬, 잎사귀의 수, 및 잎의 표면 상태, 및 줄 기의 두께 등을 고려한다. 도 4 내지 도 6을 참조하면, 제1특징(IN)은 잎의 크기, 잎의 모양, 잎의 색상과 무늬, 잎사귀의 수, 및 잎의 표 면 상태, 및 줄기의 두께 중에서 어느 하나(예를 들면, 잎의 크기)라고 가정한다. 제2특징(IS)은 잎의 크기, 잎의 모양, 잎의 색상과 무늬, 잎사귀의 수, 및 잎의 표면 상태, 및 줄기의 두께 중 에서 다른 하나(예를 들면, 잎의 모양)라고 가정한다. 제3특징(IC)은 잎의 크기, 잎의 모양, 잎의 색상과 무늬, 잎사귀의 수, 및 잎의 표면 상태, 및 줄기의 두께 중 에서 또 다른 하나(예를 들면, 잎의 색상과 무늬)라고 가정한다. 제4특징(IK)은 잎의 크기, 잎의 모양, 잎의 색상과 무늬, 잎사귀의 수, 및 잎의 표면 상태, 및 줄기의 두께 중 에서 또 다른 하나(예를 들면, 잎사귀의 수)라고 가정한다. 제5특징(IF)은 잎의 크기, 잎의 모양, 잎의 색상과 무늬, 잎사귀의 수, 및 잎의 표면 상태, 및 줄기의 두께 중 에서 또 다른 하나(예를 들면, 잎의 표면 상태)라고 가정한다. 실시 예들에 따라, 인공 지능 컴퓨터 프로그램는 각 재배지(R1~R8)에서 재배되는 농작물의 종류가 제1타입 농작물인지 또는 제2타입 농작물인지를 스스로 학습하여 판단할 수도 있고, 참고용 빅데이터(BDATA4)를 이용하 여 판단할 수 있다. 각 재배지(R1~R8)에서 재배되는 농작물의 종류가 제1타입 농작물인지 또는 제2타입 농작물인지에 따라, 인공 지 능 컴퓨터 프로그램에 의해 분석될 외형적 특징들이 달라지고 최적 재배지를 선택할 때의 우선 순위도 달 라진다. 예를 들면, 각 재배지(R1~R8)에서 재배되는 농작물이 열매 식물일 때에는 과일의 크기가 가장 높은 우선 순위를 갖고, 각 재배지(R1~R8)에서 재배되는 농작물이 엽채류일 때에는 잎의 크기가 가장 높은 우선 순위를 갖는다. 도 1 내지 도 7을 참조하면, 제1정보 수집 주기(tm_1)에서 제1정보(DT1)가 수집되면(S110), 인공 지능 컴퓨터 프로그램은 각 재배지(R1~R8)에 대한 재배 환경 상태 정보(예를 들면, 온도 정보, 습도 정보, CO2 농도 정 보, 조도 정보, 풍속 정보, 및 pH 정보)를 통신 장치를 통해 각 재배지(R1~R8)에 설치된 각 센서 (122_1~122_8)로부터 수신한다(도 2a의 S120, 및 도 3의 S210). 제1정보 수집 주기(tm_1)에서 제1정보(DT1)가 수집되면(S110), 인공 지능 컴퓨터 프로그램은 각 재배지 (R1~R8)에서 재배되는 각 농작물(CR1)에 대한 성장 상태 이미지들을 통신 장치를 통해 각 이미지 센서 (124_1~124_8)로부터 수신한다(S125).인공 지능 컴퓨터 프로그램은 제1정보(DT1)에 포함된 각 재배지(R1~R8)에 대한 재배 환경 상태 정보로부터 각 재배지(R1~R8)에 대한 재배 환경 상태 값들(예를 들면, 각 온도(T1_1~T1_8), 각 습도(H1_1~H1_8), 각 CO2 농도(D1_1~D1_8), 각 조도(L1_1~L1_8), 각 풍속(W1_1~W1_8), 및 각 pH(P1_1~P1_8))를 생성한다 (S130). 인공 지능 컴퓨터 프로그램은 제1정보(DT1)에 포함된 각 재배지(R1~R8)에서 재배되는 각 농작물(CR1)에 대 한 성장 상태 이미지들을 분석하여 각 재배지 (R1~R8)에서 재배되는 각 농작물(CR1)에 대한 외형적 특징들을 추 출한다(S135). 비록, 도 7에는 설명의 편의를 위해, 인공 지능 컴퓨터 프로그램을 이용하여 제1특징(IN)을 분석하고 분류 하여 제1특징(IN)에 대한 빅데이터를 생성하는 과정들이 예시되어 있으나, 도 7을 참조하여 설명되는 제1특징 (IN)에 대한 빅데이터를 생성하는 과정들은 온도, 습도, CO2 농도, 조도, 풍속, pH, 제2특징(IS), 제3특징(IC), 제4특징(IK), 및 제5특징(IF)을 분석하고 분류하여 빅데이터를 생성하는 과정들에 그대로 적용될 수 있다. 도 2a, 도 3, 도 4, 및 도 7을 다시 참조하면, 제1정보 수집 주기(tm_1)에서 제1정보(DT1)가 수집되면(S110), 인공 지능 컴퓨터 프로그램은 각 재배지 (R1~R8)에서 재배되는 각 농작물(CR1)에 대한 성장 상태 이미지들 을 통신 장치 를 통해 수신하고(S125), 수신된 성장 상태 이미지들로부터 제1특징 (N1_1~N1_8)을 추출하고 (S135, 및 도 7의 (a)), 각각의 제1특징(N1_1~N1_8)을 분류(예를 들면, 크기 순서로 내림 차순으로 분류)한다 (도 3의 S212, 및 도 7의 (b)). 도 7의 (b)에 도시된 바와 같이, 제5재배지(R5)에서 재배되는 농작물(CR1)의 과실의 크기(N1_5)가 가장 크고, 제4재배지(R4)에서 재배되는 농작물(CR1)의 과실의 크기(N1_4)가 가장 작다. 도 5는 제2정보 수집 주기에서 수집된 재배 환경 상태 값들과 외형적 특징들의 일시 예이다. 도 1, 도 2a, 도 3, 도 5, 및 도 7을 참조하면, 제2정보 수집 주기(tm_2)에서 제2정보(DT2, 또는 제2농장 데이 터)가 수집되면(S110), 인공 지능 컴퓨터 프로그램은 각 재배지(R1~R8)에 대한 재배 환경 상태 정보(예를 들면, 온도 정보, 습도 정보, CO2 농도 정보, 조도 정보, 풍속 정보, 및 pH 정보)를 통신 장치를 통해 각 재배지(R1~R8)에 설치된 각 센서 (122_1~122_8)로부터 수신한다(도 2a의 S120, 및 도 3의 S214). 제2정보 수집 주기(tm_2)에서 제2정보(DT2)가 수집되면(S110), 인공 지능 컴퓨터 프로그램은 각 재배지 (R1~R8)에서 재배되는 각 농작물(CR1)에 대한 성장 상태 이미지들을 통신 장치를 통해 각 이미지 센서 (124_1~124_8)로부터 수신한다(S125). 인공 지능 컴퓨터 프로그램은 각 재배지(R1~R8)에 대한 재배 환경 상태 정보로부터 각 재배지(R1~R8)에 대 한 재배 환경 상태 값들(예를 들면, 각 온도 (T2_1~T2_8), 각 습도(H2_1~H2_8), 각 CO2 농도(D2_1~D2_8), 각 조도(L2_1~L2_8), 각 풍속(W2_1~W2_8), 및 각 pH(P2_1~P2_8))를 생성한다(S130). 인공 지능 컴퓨터 프로그램은 각 재배지(R1~R8)에서 재배되는 각 농작물(CR1)에 대한 성장 상태 이미지들 을 분석하여 외형적 특징들을 추출한다(S135). 제2정보 수집 주기(tm_2)에서, 인공 지능 컴퓨터 프로그램은 각 재배지 (R1~R8)에서 재배되는 각 농작물 (CR1)에 대한 성장 상태 이미지들을 수신하고 (S125), 수신된 성장 상태 이미지들로부터 제1특징(N2_1~N2_8)을 추출한다(S135). 인공 지능 컴퓨터 프로그램은 제2정보 수집 주기(tm_2)에서 수집된 각각의 제1특징(N2_1~N2_8)과 제1정보 수집 주기(tm_1)에서 수집된 각각의 제1특징 (N1_1~N2_1)을 재배지(R1~R8)별로 일대일로 매핑(mapping) 또는 대 응시킨다(S216). 예를 들면, 도 7의 (c)와 (d)에 예시된 바와 같이, 인공 지능 컴퓨터 프로그램은 제5재배지(R5)에 대한 제 1특징(N2_5)와 제1특징(N1_5)를 일대일로 매핑하고, 제1특징들(N2_5와 N1_5)에 함수(f(N1_5, N2_5))를 적용하 고 그 결과(NA1_5)를 생성한다(S216). 예를 들면, 함수는 제1특징들(N2_5와 N1_5)의 평균값을 구하기 위한 함수 일 수 있으나 이에 한정되는 것은 아니다. 또한, 인공 지능 컴퓨터 프로그램은 제4재배지(R4)에 대한 제1특징 (N2_4)와 제1특징(N1_4)를 일대일로 매 핑하고, 제1특징들(N2_4와 N1_4)에 함수 (f(N1_4, N2_4))를 적용하고 그 결과(NA1_4)를 생성한다(S216). 예를 들면, 함수는 제1특징들(N2_4와 N1_4)의 평균값을 구하기 위한 함수일 수 있으나 이에 한정되는 것은 아니다. 각 결과(NA1_5와 NA1_4)를 생성하는 과정과 동일한 과정을 통해, 인공 지능 컴퓨터 프로그램은 각 재배지 (R1, R2, R3, R6, R7, 및 R8)에 대한 함수 적용 결과(NA1_1, NA1_2, NA1_3, NA1_6, NA1_7, 및 NA1_8)을 생성한다(S145, 및 S216). 인공 지능 컴퓨터 프로그램은 각 재배지(R1~R8)에 대한 함수 적용 결과 (NA1_1~NA1_8)를 크기 순서에 따라 내림 차순으로 분류한다(S145, 및 S216). 예를 들면, 도 7의 (d)에 도시된 바와 같이, 제5재배지(R5)에서 재배 되는 농작물(CR1)의 과실의 평균 크기(NA1_5)가 가장 크고, 제4재배지(R4)에서 재배되는 농작물(CR1)의 과실의 평균 크기(NA1_4)가 가장 작다. 도 6은 제3정보 수집 주기에서 수집된 재배 환경 상태 값들과 외형적 특징들의 일시 예이다. 도 1, 도 2a, 도 3, 도 6, 및 도 7을 참조하면, 제3정보 수집 주기(tm_3)에서 제3정보(DT3, 또는 제3농장 데이 터)가 수집되면(S110), 인공 지능 컴퓨터 프로그램은 각 재배지(R1~R8)에 대한 재배 환경 상태 정보(예를 들면, 온도 정보, 습도 정보, CO2 농도 정보, 조도 정보, 풍속 정보, 및 pH 정보)를 통신 장치를 통해 각 재배지(R1~R8)에 설치된 각 센서(122_1~122_8)로부터 수신한다(도 2a의 S120, 도 3의 S218). 제3정보 수집 주기(tm_3)에서 제3정보(DT3)가 수집되면(S110), 인공 지능 컴퓨터 프로그램은 각 재배지 (R1~R8)에서 재배되는 각 농작물(CR1)에 대한 성장 상태 이미지들을 통신 장치를 통해 각 이미지 센서 (124_1~124_8)로부터 수신한다(S125, 및 S218). 인공 지능 컴퓨터 프로그램은 각 재배지(R1~R8)에 대한 재배 환경 상태 정보로부터 각 재배지(R1~R8)에 대 한 재배 환경 상태 값들(예를 들면, 각 온도 (T3_1~T3_8), 각 습도(H3_1~H3_8), 각 CO2 농도(D3_1~D3_8), 각 조도(L3_1~L3_8), 각 풍속(W3_1~W3_8), 및 각 pH(P3_1~P3_8))를 생성한다(S130). 인공 지능 컴퓨터 프로그램은 각 재배지(R1~R8)에서 재배되는 각 농작물(CR1)에 대한 성장 상태 이미지들 을 분석하여 외형적 특징들을 추출한다(S135). 제3정보 수집 주기(tm_3)에서, 인공 지능 컴퓨터 프로그램은 각 재배지 (R1~R8)에서 재배되는 각 농작물 (CR1)에 대한 성장 상태 이미지들을 수신하고 (S125), 수신된 성장 상태 이미지들로부터 제1특징(N3_1~N3_8)을 추출한다(S135). 인공 지능 컴퓨터 프로그램은 제3정보 수집 주기(tm_3)에서 수집된 각각의 제1특징(N3_1~N3_8)과 도 7의 (d)에서 생성된 제1특징(NA1_1~NA1_8)을 재배지 (R1~R8)별로 서로 매핑한다(S220). 예를 들면, 도 7의 (e)에 예시된 바와 같이 인공 지능 컴퓨터 프로그램은 제5재배지(R5)에 대한 제1특징 (N3_5)과 제1특징(NA1_5)를 일대일로 매핑하고, 제1특징들(N3_5와 NA1_5)에 함수(f(NA1_5, N3_5))를 적용하고 그 결과(NA2_5)를 생성한다(S220). 예를 들면, 함수는 제1특징들(NA1_5와 N3_5)의 평균값을 구하기 위한 함수일 수 있다. 또한, 인공 지능 컴퓨터 프로그램은 제4재배지(R4)에 대한 제1특징(N3_4)와 제1특징(NA1_4)를 일대일로 매 핑하고, 제1특징들(NA1_4와 N3_4)에 함수 (f(NA1_4, N3_4))를 적용하고 그 결과(NA2_4)를 생성한다(S220). 예 를 들면, 함수는 제1특징들(NA1_4와 N3_4)의 평균값을 구하기 위한 함수일 수 있다. 각 결과(NA2_5와 NA2_4)를 생성하는 과정과 동일한 과정을 통해, 인공 지능 컴퓨터 프로그램은 각 재배지 (R1, R2, R3, R6, R7, 및 R8)에 대한 함수 적용 결과(NA2_1, NA2_2, NA2_3, NA2_6, NA2_7, 및 NA2_8)을 생성한 다(S145, 및 S220). 인공 지능 컴퓨터 프로그램은 각 재배지(R1~R8)에 대한 함수 적용 결과 (NA2_1~NA2_8)를 크기 순서에 따라 내림 차순으로 분류한다(S145, 및 S220). 예를 들면, 도 7의 (f)에 도시된 바와 같이, 제5재배지(R5)에서 재배 되는 농작물(CR1)의 과실의 평균 크기(NA2_5)가 가장 크고, 제4재배지(R4)에서 재배되는 농작물(CR1)의 과실의 평균 크기(NA2_4)가 가장 작다. 이와 같은 과정들과 동일 또는 유사하게, 정보 수집 주기(tm_(x-1), 여기서, x는 5이상의 자연수이다)에서 (x- 1)번째 정보(DT(x-1))가 수집되면(S110), 인공 지능 컴퓨터 프로그램은 각 재배지(R1~R8)에 대한 재배 환 경 상태 정보와 성장 상태 이미지들을 수신하고(S224), 정보 수집 주기(tm_(x-2))에서 분석 및 분류 결과(S22 2)와 단계(S224)에서 수신된 (x-1)번째 정보(DT(x-1))를 이용하여 각 재배지(R1~R8)에 대한 분석 및 분류 작업 (S226)을 수행한다. 이와 같은 과정들과 동일 또는 유사하게, 정보 수집 주기(tm_x)에서 x번째 정보(DTx)가 수집되면(S110), 인공 지능 컴퓨터 프로그램은 정보 수집 주기 (tm_x)에서 각 재배지(R1~R8)에 대한 재배 환경 상태 정보와 성장 상태 이미지들을 수신하고(S228), 정보 수집 주기(tm_(x-1))에서 분석 및 분류 결과(S226)와 단계(S228)에서 수신된 정보를 이용하여 각 재배지(R1~R8)에 대한 분석 및 분류 작업을 수행한다(S145 및 S230). 성장 상태 빅데이터(BDATA2)는 각 분석 및 분류 단계(S216, S220, S226, 및 S230)에서 생성된 데이터를 포함한 다(S145). 예를 들면, 인공 지능 컴퓨터 프로그램이 단계(S135)에서 추출된 외형적 특징들과 단계(S145)에서 생성된 성장 상태 빅데이터(BDATA2)를 이용하여 각 재배지(R1~R8)에서 재배되는 농작물이 제1타입 농작물인지 제2타입 농작물인지를 판단할 수 있을 때(예를 들면, 농작물의 열매가 생긴 후), 인공 지능 컴퓨터 프로그램은 단 계(S135)에서 추출된 외형적 특징들과 단계(S145)에서 생성된 성장 상태 빅데이터(BDATA2)를 이용하여 각 재배 지(R1~R8)에서 재배되는 농작물의 타입을 판단할 수 있다(S150). 그러나, 인공 지능 컴퓨터 프로그램이 단계(S135)에서 추출된 외형적 특징들과 단계(S145)에서 생성된 성 장 상태 빅데이터(BDATA2)를 이용하여 각 재배지(R1~R8)에서 재배되는 농작물이 제1타입 농작물인지 제2타입 농 작물인지를 판단할 수 없을 때(예를 들면, 농작물의 발아 단계 또는 과일이 생기지 전), 인공 지능 컴퓨터 프로 그램은 전송 요청을 서버로 전송하고 상기 전송 요청에 따라 서버로부터 전송된 참고용 빅데이 터(BDATA4)를 이용하여 각 재배지(R1~R8)에서 재배되는 농작물의 타입을 판단할 수 있다(S150). 예를 들면, 각 정보 수집 주기에서 각 재배지(R1~R8)에서 재배되는 농작물의 성장 상태 이미지들로부터 추출된 외형적 특징들이 제타입 농작물, 예를 들면 열매 식물의 제1외형적 특징들을 가질 때(S150의 YES), 인공 지능 컴퓨터 프로그램은 다음 시점의 정보 수집 주기부터 각 재배지(R1~R8)에서 재배되는 농작물의 성장 상태 이미지들로부터 제1외형적 특징들을 추출하고(S145), 단계(S150)을 수행하지 않고 바로 단계(S160)을 수행한다. 그러나, 각 정보 수집 주기에서 각 재배지(R1~R8)에서 재배되는 농작물의 성장 상태 이미지들로부터 추출된 외 형적 특징들이 열매 식물 이외의 식물, 예를 들면 엽채류의 제2외형적 특징들을 가질 때(S150의 NO), 인공 지능 컴퓨터 프로그램 은 다음 시점의 정보 수집 주기부터 각 재배지(R1~R8)에서 재배되는 농작물의 성장 상태 이미지들로부터 제2외형적 특징들을 추출하고(S145), 단계(S150)을 수행하지 않고 바로 단계(S165)을 수행한다. 도 4에 예시된 바와 같이, 각 재배지(R1~R8)에서 재배되는 농작물이 제1타입 농작물(예를 들면, 열매 식물)인지 또는 제2타입 농작물(예를 들면, 엽채류)인지에 따라, 추출 대상이 되는 외형적 특징들이 서로 다르다. 예를 들면, 농작물이 제1타입 농작물(예를 들면, 열매 식물)일 때 인공 지능 컴퓨터 프로그램은 성장 상태 이미지로부터 과실의 크기과 과실의 색상 등을 높은 우선 순위로 추출하고, 농작물이 제2타입 농작물(예를 들면, 엽채류)일 때 인공 지능 컴퓨터 프로그램은 성장 상태 이미지들로부터 잎의 크기와 잎의 모양 등을 높은 우선 순위로 추출한다. 도 8은 도 7에 도시된 개념도에 따라 재배지들 각각에서 재배되는 농작물의 외형적 특징들을 분석할 결과의 예 시이다. 도 8에는 설명의 편의를 위해, 제1정보 수집 주기(tm_1)에서 수집된 제1정보(DT1), 제2정보 수집 주기(tm_2)에 서 수집된 제2정보(DT2), 및 제3정보 수집 주기(tm_3)에서 수집된 제3정보(DT2)에 대한 분류 결과들만을 예시한 다. 도 8을 참조하면, 인공 지능 컴퓨터 프로그램은 재배지(R1~R8)별로 제1특징(IN)의 분류 결과 (NA2_1~NA2_8), 제2특징(IS)의 분류 결과(SA2_1~SA2_8), 제3특징(IC)의 분류 결과(CA2_1~CA2_8), 제4특징(IK) 의 분류 결과(KA2_1~KA2_8), 및 제5특징(IF)의 분류 결과(FA2_1~FA2_8)를 생성한다(S160 또는 S165). 인공 지능 컴퓨터 프로그램은 각각의 분류 결과(NA2_1~NA2_8, SA2_1~SA2_8, CA2_1~CA2_8, KA2_1~KA2_8, 및 FA2_1~FA2_8)를 크기 순서에 따라 내림 차순으로 분류한다(S160 또는 S165). 인공 지능 컴퓨터 프로그램은 크기 순서에 따라 가중치(WT1~WT8)를 부여한다(S170). 이때, 제8가중치(WT 8)가 가장 크고, 제1가중치(WT1)가 가장 작다. 예를 들면, 각 가중치(WT8~WT1)은 8, 7, 6, 5, 4, 3, 2, 및 1일 수 있고, 각 가중치(WT8~WT1)은 +3, +2, +1, 0, -1, -2, -3, 및 -4일 수 있으나 이에 한정되는 것은 아니다. 제1특징(IN)에 대한 분류 결과(NA2_1~NA2_8) 중에서 제5재배지(R5)에 대한 분류 결과(NA2_5)가 가장 크고, 제2 특징(IS)에 대한 분류 결과(SA2_1~SA2_8) 중에서 제6재배지(R6)에 대한 분류 결과(SA2_6)이 가장 크고, 제3특징 (IC)에 대한 분류 결과(CA2_1~CA2_8) 중에서 제6재배지(R6)에 대한 분류 결과(CA2_6)이 가장 크고, 제4특징 (IK)에 대한 분류 결과(KA2_1~KA2_8) 중에서 제5재배지(R5)에 대한 분류 결과(KA2_5)이 가장 크고, 제5특징 (IF)에 대한 분류 결과(FA2_1~FA2_8) 중에서 제1재배지(R1)에 대한 분류 결과(FA2_1)이 가장 크다.도 9는 도 1의 재배지들 각각에서 재배되는 농작물이 열매 식물일 때 상기 열매 식물의 외형적 특징을 설명하는 개념도이다. 도 9를 참조하면, 인공 지능 컴퓨터 프로그램은 딸기의 크기(IN)를 폭(W1) 및/또는 길이(L1) 를 이용하여 판단하고, 딸기의 색상(IS), 색상의 균일도(IC), 과실의 표면 상태(IK), 및 잎의 크기(IF)를 판단 한다. 도 10은 도 1의 재배지들 각각에서 재배되는 농작물이 엽채류일 때 상기 엽채류의 외형적 특징을 설명하는 개념 도이다. 도 10을 참조하면, 인공 지능 컴퓨터 프로그램은 상추 잎의 크기(IN)를 폭(W2) 및/또는 길이(L2) 를 이용하여 판단하고, 상추의 모양(IS), 잎의 색상과 무늬(IC), 잎의 개수(IK), 및 잎의 표면 상태(IF)를 판단 한다. 도 11은 도 1의 데이터 처리 장치가 재배지들 중에서 어느 하나를 최적 재배지로 선택하는 과정을 설명하는 개 념도이다. 도 11을 참조하면, 인공 지능 컴퓨터 프로그램은 재배지들(R1~R8) 각각 에 부여된 가중치를 이용하여 재 배지들(R1~R8) 중에서 어떤 재배지를 최적 재배지로 선택할지를 결정한다(S170과 S180). 예를 들면, 도 11을 참조하면 인공 지능 컴퓨터 프로그램은 제1재배지(R1)에 대한 총 가중치(WT_R1)를 수 학식 1에 따라 계산한다. [수학식 1] WT_R1 = WT6_IN + WT5_IS + WT5_IC + WT6_IK + WT8_IF 여기서, WT6_IN은 제1특성(IN)에 대한 제1재배지(R1)의 가중치를 의미하고, WT5_IS는 제2특성(IS)에 대한 제1재 배지(R1)의 가중치를 의미하고, WT5_IC는 제3특성(IC)에 대한 제1재배지(R1)의 가중치를 의미하고, WT6_IK는 제 4특성(IK)에 대한 제1재배지(R1)의 가중치를 의미하고, WT8_IF는 제5특성(IN)에 대한 제1재배지(R1)의 가중치를 의미한다. 도 11을 참조하면, 인공 지능 컴퓨터 프로그램은 제2재배지(R2)에 대한 총 가중치(WT_R2)를 수학식 2에 따 라 계산한다. [수학식 2] WT_R2 = WT5_IN + WT7_IS + WT6_IC + WT5_IK + WT7_IF 여기서, WT5_IN은 제1특성(IN)에 대한 제2재배지(R2)의 가중치를 의미하고, WT7_IS는 제2특성(IS)에 대한 제2재 배지(R2)의 가중치를 의미하고, WT6_IC는 제3특성(IC)에 대한 제2재배지(R2)의 가중치를 의미하고, WT5_IK는 제 4특성(IK)에 대한 제2재배지(R2)의 가중치를 의미하고, WT7_IF는 제5특성(IF)에 대한 제2재배지(R2)의 가중치를 의미한다. 도 11을 참조하면, 인공 지능 컴퓨터 프로그램은 각 재배지(R3~R8)에 대한 총 가중치(WT_R3~WT_R8)를 수학 식 1과 수학식 2와 동일 또는 유사하게 계산한다(S170과 S180). 실시 예들에 따라, 인공 지능 컴퓨터 프로그램은 재배지들(R3~R8)에 대한 총 가중치들(WT_R3~WT_R8) 중에 서 어느 하나를 선택하고, 선택된 총 가중치에 해당하는 재배지를 최적 재배지로 선택할 수 있다(S180). 실시 예들에 따라, 인공 지능 컴퓨터 프로그램은 총 가중치들 (WT_R3~WT_R8) 중에서 최대 값에 해당하는 재배지를 최적 재배지로 선택할 수 있다. 인공 지능 컴퓨터 프로그램은 총 가중치들(WT_R3~WT_R8) 중에서 중간 값에 해당하는 재배지를 최적 재배지 로 선택할 수 있다. 인공 지능 컴퓨터 프로그램은 총 가중치들(WT_R3~WT_R8)의 평균(또는 표준 편차, 또는 분산)을 계산하고, 계산된 평균(또는 표준 편차, 또는 분산)에 가장 근접한 가중치를 갖는 재배지를 최적 재배지로 선택할 수 있다. 실시 예에 따라, 재배지들(R3~R8) 중에서 적어도 2개의 재배지들(예를 들면, R1과 R2)의 총 가중치들(WT_R1과 WT_R2)이 동일할 때, 인공 지능 컴퓨터 프로그램 은 제1특성(IN)이 큰 값(NA2_1 > NA2_2)을 갖는 재배지 (예를 들면, R1)를 최적 재배지로 선택할 수 있다. 단말기의 사용자는 재배지들(R1~R8)에 대한 총 가중치들(WT_R1~WT_R8) 중에서 어느 하나를 선택할 수 있는 선택 정보를 인공 지능 컴퓨터 프로그램에 프로그램 할 수 있다. 사용자는 농업인 또는 시물물(예를 들면, 센서, 이미지 센서, 또는 재배 환경 제어 장치)의 관리자일 수 있다. 예를 들면, 선택 정보가 내림 차순으로 분류된 총 가중치들(WT_R1~WT_R8) 중에서 두 번째(또는 세 번째)로 큰 총 가중치의 선택을 지시할 때, 인공 지능 컴퓨터 프로그램은 두 번째(또는 세 번째)로 큰 총 가중치에 해 당하는 재배지를 최적 재배지로 선택할 수 있다. 예를 들면, 인공 지능 컴퓨터 프로그램이 재배지들(R1~R8) 중에서 제6재배지(R6)을 최적 재배지로 선택했 을 때(S180), 인공 지능 컴퓨터 프로그램은, 제6재배지(R6)에 대한 분석 결과(TA2_6, HA2_6, DA2_6, LA2_6, WA2_6, 및 PA2_6) 중에서 적어도 하나를 이용하여, 나머지 재배지들(R1~R5, R7, 및 R8) 각각의 온도, 습도, CO2 농도, 조도, 풍속, 및 pH 중에서 적어도 하나를 제어하기 위해 적어도 하나의 제어 신호(CTLi)를 생 성할 수 있다(S190). 재배 환경 제어 장치에 포함된 제어 장치들(141, 143, 145, 147, 149, 및 151) 중에서 적어도 하나는, 적 어도 하나의 제어 신호(CTLi)에 응답하여, 재배지들(R1~R8) 각각의 온도, 습도, CO2 농도, 조도, 풍속, 및 pH 중에서 적어도 하나를 동시에 또는 병렬적으로 제어할 수 있다(S190). 여기서, 각 분석 결과(TA2_6, HA2_6, DA2_6, LA2_6, WA2_6, 및 PA2_6)는 제1특성(IN)에 대한 분석 결과(NA2_ 6)를 생성하는 과정들과 동일한 과정들을 통해 생성될 수 있다. 예를 들면, 제1재배지(R1)의 온도(TA2_1)는 제6재배지(R6)의 온도(TA2_6)와 동일 또는 유사하게 제어되고, 제1 재배지(R1)의 습도(HA2_1)는 제6재배지(R6)의 습도(HA2_6)와 동일 또는 유사하게 제어되고, 제1재배지(R1)의 CO2 농도(DA2_1)는 제6재배지(R6)의 CO2 농도(DA2_6)와 동일 또는 유사하게 제어, 제1재배지(R1)의 조도 (LA2_1)는 제6재배지(R6)의 조도(LA2_6)와 동일 또는 유사하게 제어되고, 제1재배지(R1)의 풍속(WA2_1)는 제6재 배지(R6)의 풍속(WA2_6)와 동일 또는 유사하게 제어되고, 제1재배지(R1)의 pH(PA2_1)는 제6재배지(R6)의 pH(PA2_6)와 동일 또는 유사하게 제어된다(S190). 도 12는 도 1의 단말기에서 표시되는 사용자 그래픽 인터페이스의 일 예이다. 도 1과 도 12를 참조하면, 단말기의 애플리케이션은 도 12에 예시된 그래픽 사용자 인터페이스 (162GUI)를 단말기의 디스플레이 장치에 표시한다. 사용자가 농업인인지 관리자인지에 따라 관심 정 보가 다를 것이다. 그래픽 사용자 인터페이스(162GUI)는 재배 환경 상태 정보 요청 GUI(162A), 성장 상태 이미지 전송 요청 GUI(162B), 재배 환경 제어 장치 제어 정보 요청 GUI(162C), 및 성장/병충해 이상 정보 요청 GUI(162D)를 포함 한다. 단말기의 사용자(예를 들면, 농업인)가 재배 환경 상태 정보 요청 GUI (162A)를 선택하면(S192의 YES), 애 플리케이션은 제1요청(REQj, j=1)을 데이터 처리 장치로 전송한다. 인공 지능 컴퓨터 프로그램 은 통신 장치를 통해 제1요청(REQ1)을 수신하고, 제1요청(REQ1)에 따라 데이터 저장 장치에 저장된 재배 환경 상태 빅데이터(BDATA1)를 검색하여 제1검색 결과(ANSj, j=1)를 통신 장치를 통해 단말기로 전송한다(S194). 애플리케이션은 제1검색 결과(ANS1)를 디스플레이 장치에 표시한다. 예를 들면, 제1검색 결과(ANS1)는 일정 기간별(예를 들면, 시간별, 일별, 주간별, 월별, 분기별, 반기별, 또는 연별) 재배 환경 상태 정보(또는 재배 환경 상태 값들) 또는 재배 환경 상태 변화량일 수 있다. 단말기의 사용자(예를 들면, 농업인)가 성장 상태 이미지 전송 요청 GUI(162B)를 선택하면(S192의 YES), 애플리케이션은 제2요청(REQj, j=2)을 데이터 처리 장치로 전송한다. 인공 지능 컴퓨터 프로그램 은 통신 장치 를 통해 제2요청(REQ2)을 수신하고, 제2요청(REQ2)에 따라 데이터 저장 장치 에 저장된 성장 상태 빅데이터(BDATA2)를 검색하여 제2검색 결과(ANSj, j=2)를 통신 장치를 통해 단말기(16 0)로 전송한다(S194). 애플리케이션은 제2검색 결과(ANS2)를 디스플레이 장치에 표시한다. 예를 들면, 제2검색 결과(ANS2)는 일정 기간별(예를 들면, 시간별, 일별, 주간별, 월별, 분기별, 반기별, 또는 연별) 성장 상태 이미지들(또는 외형적 특징들) 또는 성장 상태 변화량일 수 있다. 사용자(예를 들면, 재배 환경 제어 장치 관리자)가 재배 환경 제어 장치 제어 정보 요청 GUI(162C)를 선택하면 (S192의 YES), 애플리케이션은 제3요청 (REQj, j=3)을 데이터 처리 장치로 전송한다. 인공 지능 컴퓨 터 프로그램 은 통신 장치를 통해 제3요청(REQ3)을 수신하고, 제3요청(REQ3)에 따라 데이터 저장 장치에 저장된 재배 환경 제어 장치 제어 빅데이터(BDATA3)를 검색하여 제3검색 결과(ANSj, j=3)를 통신 장 치를 통해 단말기로 전송한다(S194). 애플리케이션은 제3검색 결과(ANS3)를 디스플레이 장치 에 표시한다. 예를 들면, 제3검색 결과(ANS3)는 일정 기간별(예를 들면, 시간별, 일별, 주간별, 월별, 분기별, 반기별, 또는 연별) 제어 정보(예를 들면, 각 제어 장치(141, 143, 145, 147, 149, 및 151)를 제어한 이력 정보) 또는 고장 이력 정보일 수 있다. 사용자가 성장/병충해 이상 정보 요청 GUI(162D)를 선택하면(S192의 YES), 애플리케이션은 제4요청(REQj, j=4)을 데이터 처리 장치로 전송한다. 인공 지능 컴퓨터 프로그램은 통신 장치를 통해 제4요청 (REQ)을 수신하고, 제4요청(REQ4)에 따라 데이터 저장 장치에 저장된 성장 상태 빅데이터 (BDATA2)를 검색 하고 분석하여 제4검색 결과(ANSj, j=4)를 통신 장치를 통해 단말기로 전송한다(S194). 애플리케이션 은 제4검색 결과(ANS4)를 디스플레이 장치에 표시한다. 예를 들면, 제4검색 결과(ANS4)는 각 재배지(R1~R8)에 재배되는 농작물의 성장 이상 여부(예를 들면, 어느 재배 지의 재배 환경 상태 값이 가장 낮은지, 어느 재배지의 열매 과실의 크기가 가장 작은지, 어느 재배지의 엽채류 의 잎의 크기가 가장 작은지, 어느 재배지의 엽채류의 잎의 표면 상태가 비정상적인지, 등) 및/또는 병충해 발 생 여부(예를 들면, 어느 재배지의 농작물에 진딧물이 있는지, 어느 재배지의 농작물에 진딧물의 발견이 예상되 는지, 어느 재배지의 농작물의 과실에 병충해가 있는지, 등)를 포함한다. 제4검색 결과(ANS4)는 농작물의 성장 이상을 극복할 수 있는 정보(예를 들면, 어느 재배지의 재배 환경 상태 값 들을 어떻게 제어할지에 대한 정보), 및/또는 병충해를 예방하고 제거할 수 있는 정보(예를 들면, 진딧물 제거 를 위해 양액에 추입할 액제의 종류에 대한 정보)를 더 포함할 수 있다. 본 발명은 도면에 도시된 실시 예를 참고로 설명되었으나 이는 예시적인 것에 불과하며, 본 기술 분야의 통상의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 타 실시 예가 가능하다는 점을 이해할 것이다. 따라서, 본 발명의 진정한 기술적 보호 범위는 첨부된 등록청구범위의 기술적 사상에 의해 정해져야 할 것이다."}
{"patent_id": "10-2023-0045789", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 발명의 상세한 설명에서 인용되는 도면을 보다 충분히 이해하기 위하여 각 도면의 상세한 설명이 제공된다. 도 1은 본 발명의 실시 예에 따른 스마트팜 관리 시스템의 블록도이다. 도 2a와 도 2b는 도 1에 도시된 스마트팜 관리 시스템의 동작을 설명하는 플로우차트이다. 도 3은 도 1에 도시된 데이처 처리 장치의 동작을 설명하는 개념도이다. 도 4는 제1정보 수집 주기에서 수집된 재배 환경 상태 값들과 외형적 특징들의 일시 예이다. 도 5는 제2정보 수집 주기에서 수집된 재배 환경 상태 값들과 외형적 특징들의 일시 예이다.제 6은 제3정보 수집 주기에서 수집된 재배 환경 상태 값들과 외형적 특징들의 일시 예이다. 도 7은 도 1에 도시된 재배지들 각각에서 재배되는 농작물의 외형적 특징을 분석하는 과정을 설명하는 개념도이 다. 도 8은 도 7에 도시된 개념도에 따라 재배지들 각각에서 재배되는 농작물의 외형적 특징들을 분석할 결과의 예 시이다. 도 9는 도 1의 재배지들 각각에서 재배되는 농작물이 열매 식물일 때 상기 열매 식물의 외형적 특징을 설명하는 개념도이다. 도 10은 도 1의 재배지들 각각에서 재배되는 농작물이 엽채류일 때 상기 엽채류의 외형적 특징을 설명하는 개념 도이다. 도 11은 도 1의 데이터 처리 장치가 재배지들 중에서 어느 하나를 최적 재배지로 선택하는 과정을 설명하는 개 념도이다. 도 12는 도 1의 단말기에서 표시되는 사용자 그래픽 인터페이스의 일 예이다."}
