{"patent_id": "10-2015-7033682", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2015-0140857", "출원번호": "10-2015-7033682", "발명의 명칭": "구성요소들을 조작, 이동, 및/또는 재배향하기 위한 이동 에이전트들", "출원인": "앤키, 인크.", "발명자": "타페이너, 한스"}}
{"patent_id": "10-2015-7033682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "구성요소들을 조작하기 위한 시스템으로서:작업면;적어도 하나의 별개의 조작가능한 구성요소; 및상기 작업면 상의 적어도 하나의 구성요소를 조작하도록 구성되는, 적어도 하나의 이동 에이전트(mobile agent)로서:프로세서;상기 적어도 하나의 구성요소를 검출하도록 구성되는, 상기 프로세스에 통신가능하게 결합되는, 센서;상기 이동 에이전트에 원동력을 가하도록 구성되는, 상기 프로세서에 통신가능하게 결합되는, 추진 메커니즘;및명령들에 응답하여 상기 적어도 하나의 구성요소를 조작하도록 구성되는, 상기 프로세서에 통신가능하게 결합되는, 적어도 하나의 액추에이터를 포함하는 시스템."}
{"patent_id": "10-2015-7033682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 상기 이동 에이전트는 적어도 하나의 성격 특성을 나타내도록 더 구성되는 시스템."}
{"patent_id": "10-2015-7033682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서, 상기 이동 에이전트는 경험 및 학습 중 적어도 하나에 기초하여 적어도 하나의 나타낸 성격특성을 변경하도록 더 구성되는 시스템."}
{"patent_id": "10-2015-7033682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서, 상기 적어도 하나의 이동 에이전트는 복수의 이동 에이전트를 포함하고, 상기 복수의 이동에이전트 중 적어도 하나는 작업을 수행 시 상기 복수의 이동 에이전트 중 적어도 하나의 다른 이동 에이전트와협력하도록 구성되는 시스템."}
{"patent_id": "10-2015-7033682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 4에 있어서, 상기 적어도 하나의 이동 에이전트는 복수의 이동 에이전트를 포함하고, 상기 복수의 이동에이전트 중 적어도 하나는 상기 복수의 이동 에이전트 중 적어도 하나의 다른 이동 에이전트의 행위에 반응하도록 구성되는 시스템."}
{"patent_id": "10-2015-7033682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 1에 있어서, 상기 적어도 하나의 이동 에이전트는 작업을 수행하도록 구성되고, 상기 명령들은 상기 작업의 완료에 지시되는 시스템."}
{"patent_id": "10-2015-7033682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 6에 있어서, 적어도 하나의 별개의 조작가능한 구성요소는 구축 요소를 포함하고, 상기 작업은 구축 작업을 포함하는 시스템."}
{"patent_id": "10-2015-7033682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "에 있어서, 적어도 하나의 기계-판독가능한 코드는 상기 적어도 하나의 구성요소에 대해 나타나고, 상기 적어도 하나의 이동 에이전트는 상기 적어도 하나의 기계-판독가능한 코드를 판독함으로써 상기 적어도 하나의 구성요소를 인식하도록 구성되는 시스템."}
{"patent_id": "10-2015-7033682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 1에 있어서, 상기 적어도 하나의 이동 에이전트는 상기 작업면에 대해 그것의 위치를 자동적으로 결정하도록 구성되는 시스템."}
{"patent_id": "10-2015-7033682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 10에 있어서, 상기 작업면은 적어도 하나의 기계-판독가능한 코드를 포함하고, 상기 적어도 하나의 이동에이전트는 상기 적어도 하나의 기계-판독가능한 코드를 판독함으로써 그것의 위치를 자동적으로 결정하도록 구성되는 시스템."}
{"patent_id": "10-2015-7033682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 1에 있어서,기지국;및 상기 적어도 하나의 이동 에이전트는 상기 기지국과 통신하도록 구성되는, 상기 프로세서에 통신가능하게 결합되는, 통신 모듈을 더 포함하는 시스템."}
{"patent_id": "10-2015-7033682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 12에 있어서, 상기 기지국은 상기 적어도 하나의 이동 에이전트 및 상기 적어도 하나의 구성요소의 상대적인 위치들의 가상 표현을 유지하도록 구성되는 시스템."}
{"patent_id": "10-2015-7033682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 12에 있어서, 상기 기지국은 검출된 물리적 위치들에 응답하여 상기 가상 표현을 조절함으로써 상기 적어도 하나의 구성요소 및 상기 적어도 하나의 이동 에이전트의 검출된 물리적 위치들 및 상기 가상 표현 간 패리티(parity)를 유지하도록 구성되는 시스템."}
{"patent_id": "10-2015-7033682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "청구항 12에 있어서, 상기 기지국은 상기 적어도 하나의 이동 에이전트가 상기 가상 표현과 합치하도록 그것의물리적 위치를 조절하게 하기 위한 신호들을 적어도 하나의 이동 에이전트에 전송함으로써 상기 적어도 하나의구성요소 및 상기 적어도 하나의 이동 에이전트의 검출된 물리적 위치들 및 상기 가상 표현 간 패리티를 유지하도록 구성되는 시스템."}
{"patent_id": "10-2015-7033682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "청구항 1에 있어서, 인공 지능 모듈을 더 포함하고, 상기 명령들은 상기 인공 지능 모듈의 출력에 기초하는 시스템."}
{"patent_id": "10-2015-7033682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "에 있어서, 상기 프로세서에서, 상기 이동 에이전트가 적어도 하나의 성격 특성을 나타내게 하는 단계를 더 포함하는 방법."}
{"patent_id": "10-2015-7033682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "청구항 17에 있어서, 상기 시스템은 복수의 이동 에이전트를 포함하고, 상기 방법은 상기 이동 에이전트들 중적어도 하나의 프로세서에서, 상기 이동 에이전트가 작업을 수행 시 상기 복수의 이동 에이전트 중 적어도 하나의 다른 이동 에이전트와 협력하게 하는 단계를 더 포함하는 방법."}
{"patent_id": "10-2015-7033682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "청구항 17에 있어서, 상기 시스템은 복수의 이동 에이전트를 포함하고, 상기 방법은 상기 이동 에이전트들 중적어도 하나의 프로세서에서, 상기 이동 에이전트가 상기 복수의 이동 에이전트 중 적어도 하나의 다른 이동 에이전트의 행위에 반응하게 하는 단계를 더 포함하는 방법."}
{"patent_id": "10-2015-7033682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "청구항 17에 있어서, 상기 시스템은 복수의 이동 에이전트를 포함하고, 상기 방법은 상기 이동 에이전트들 중적어도 하나의 프로세서에서, 상기 이동 에이전트가 상기 다른 이동 에이전트의 액션에 응답하여 상기 복수의이동 에이전트 중 적어도 하나의 다른 이동 에이전트에 대한 적의(hostility)를 나타내게 하는 단계를 더 포함하는 방법."}
{"patent_id": "10-2015-7033682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "청구항 17에 있어서, 상기 적어도 하나의 이동 에이전트는 작업을 수행하도록 구성되고, 상기 명령들은 상기 작업의 완료에 지시되는 방법."}
{"patent_id": "10-2015-7033682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "청구항 22에 있어서, 상기 적어도 하나의 별개의 조작가능한 구성요소는 구축 요소를 포함하고, 상기 작업은 구축 작업을 포함하는 방법."}
{"patent_id": "10-2015-7033682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "청구항 17에 있어서, 상기 센서에서, 상기 적어도 하나의 구성요소를 인식하는 단계 및 상기 적어도 하나의 구성요소의 위치 및 배향을 식별하는 단계를 더 포함하는 방법."}
{"patent_id": "10-2015-7033682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "청구항 24에 있어서, 상기 적어도 하나의 구성요소는 상기 적어도 하나의 기계-판독가능한 코드를 포함하고, 상기 적어도 하나의 구성요소를 인식하는 단계는 상기 적어도 하나의 기계-판독가능한 코드를 판독하는 단계를 포함하는 방법."}
{"patent_id": "10-2015-7033682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "청구항 17에 있어서, 상기 프로세서에서, 상기 작업면에 대해 상기 이동 에이전트의 상기 위치를 자동적으로 결정하는 단계를 더 포함하는 방법."}
{"patent_id": "10-2015-7033682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "청구항 26에 있어서, 상기 작업면은 적어도 하나의 기계-판독가능한 코드를 포함하고, 상기 이동 에이전트의 상기 위치를 자동적으로 결정하는 단계는 상기 적어도 하나의 기계-판독가능한 코드를 판독하는 단계를 포함하는방법."}
{"patent_id": "10-2015-7033682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_28", "content": "청구항 17에 있어서, 상기 프로세서에서, 상기 이동 에이전트가 기지국과 통신하게 하는 단계를 더 포함하는 방공개특허 10-2015-0140857-5-법."}
{"patent_id": "10-2015-7033682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "청구항 28에 있어서,상기 적어도 하나의 이동 에이전트 및 상기 적어도 하나의 구성요소의 상대적인 위치들의 가상 표현을 유지하는단계; 및검출된 물리적 위치들에 응답하여 상기 가상 표현을 조절함으로써 상기 적어도 하나의 구성요소 및 상기 적어도하나의 이동 에이전트의 검출된 물리적 위치들 및 상기 가상 표현 간 패리티를 유지하는 단계를 더 포함하는 방법."}
{"patent_id": "10-2015-7033682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_30", "content": "청구항 28에 있어서,상기 적어도 하나의 이동 에이전트 및 상기 적어도 하나의 구성요소의 상대적인 위치들의 가상 표현을 유지하는단계; 및상기 적어도 하나의 이동 에이전트가 상기 가상 표현과 합치하도록 그것의 물리적 위치를 조절하게 하기 위한신호들을 적어도 하나의 이동 에이전트에 전송함으로써 상기 적어도 하나의 구성요소 및 상기 적어도 하나의 이동 에이전트의 검출된 물리적 위치들 및 상기 가상 표현 간 패리티를 유지하는 단계를 포함하는 방법."}
{"patent_id": "10-2015-7033682", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "이동 에이전트는 일반적인 구조들의 구축과 같은 동작들을 수행하기 위해, 작업면 상의 블럭들과 같은 구성요소 들을 자동적으로 조작한다. 작업면 및/또는 구성요소들은 에이전트들이 그것들의 각각의 위치들에 관한 현재 지 식을 유지하는 것을 돕기 위한 기계-판독가능한 코드들을 가질 수 있다. 에이전트들은 유형 및 위치에 의해 구성 (뒷면에 계속)"}
{"patent_id": "10-2015-7033682", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "관련 출원들에 대한 상호 참조 본 출원은 2013년 5월 31일에 출원된, \"일반적인 구조들을 구축하기 위한 이동 에이전트들\"(대리인 문서 번호 ANK003-PROV)에 대한 미국 가 출원 번호 제61/829,419호에서의 우선권을 주장하며, 이는 본 출원에 참조로서 통 합된다. 본 출원은 2013년 8월 9일에 출원된, \"하나 이상의 컴퓨팅 디바이스를 갖는 로봇 시스템의 통합\"(대리인 문서 번호 ANK002)에 대한 미국 실용 출원 제13/963,638\"에 관한 것이며, 이는 본 출원에 참조로서 통합된다. 본 출원은 2010년 5월 27일에 출원되고, 2013년 1월 15일에 미국 특허 제8,353,737호로 발행된, \"자동 제어 완 구용 차량들의 분산 시스템\"(대리인 문서 번호 ANK001)에 대한 미국 실용 출원 제12/788,605호에 관한 것이며, 이는 본 출원에 참조로서 통합된다. 본 문서는 일반적인 구조들을 구축할 수 있는 이동 에이전트들에 관한 것이다."}
{"patent_id": "10-2015-7033682", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일정 형태의 블럭들은 보통 어린이가 취득하는 첫 번째 완구들 중의 하나이고; 젠가와 같은 블럭-기반 게임들은 성인에게도 여전히 인기가 있다. 엔터테인먼트를 위해 만들어진 제품들 및 인간-척도 인프라스트럭처의 구축을 위해 사용되는 제품들과 같은 양 블럭들의 공통점은 구축(또는 일부 경우들에서, 분해)에 수반되는 작업들을 수 행하기 위해 일정 형태의 인간 통제 또는 조작에 대한 의존성이다. 다르게 말하면, 블록-기반 구조들은 일반적 으로 그것들 스스로 구축 또는 해체할 수 없다. 또한, 종래 시스템들 및 빌딩 블록 완구들은 복수의 이동 에이전트들이 함께 작업하고 구축 프로젝트를 완료하 기 위해 공동 작업 방식으로 상호 작용할 수 있는 임의의 기술들을 제공하지 않는다. 그것들은 그러한 공동 작 업 및 상호 작용의 방식에 영향을 주는 감정 반응들을 제공 또는 시뮬레이션하는 임의의 메커니즘들도 가지지 않는다. 그러한 제한들로 인해, 그러한 시스템들 및 완구들에 대한 관심 및 주의도가 보통 꽤 제한된다."}
{"patent_id": "10-2015-7033682", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "다양한 실시예들은 예를 들어 일반적인 구조들을 구축하기 위한, 블록들과 같은 구성요소들을 조작, 이동, 및/ 또는 재배향하기 위한 메커니즘들을 제공한다. 적어도 일 실시예에서, 이동 에이전트들(또한 로봇들로서 지칭되 는)은 이동 에이전트들이 작업면 상의 그것들의 각각의 위치들에 관한 현재 지식을 유지하는 것들 돕는 마크들 (또는 다른 기계-판독가능한 코드들)을 지니는 작업면 상에서 작동한다. 이동 에이전트드들은 그것들의 환경의 유형 및 위치에 의해 구성요소들을 식별하고 지시들에 따라 구성요소들을 재위치 또는 재위치결정하기 위해 내 장 하드웨어를 사용한다; 그러한 지시들은 사용자에 의해 제공될 수 있거나, 미리-프로그램된 또는 미리-계획된 지시에 기초할 수 있거나, 또는 그것들은 다른 에이전트들의 행위들에 응답하여 또는 현재 상태들에 기초하여 동적으로 결정될 수 있다. 협력적으로 또는 개별적으로 이동 에이전트들에 의해 실행되는, 이들 작업들은 구성 요소들(블럭들과 같은)을 정연하게 배치하기 위해 순차적으로 또는 동시에 실행되는 보다 큰, 구조화된 일련의 목적들의 부분일 수 있다. 그러한 동작들은 구조, 및/또는 다른 목적들 및/또는 지시들을 구축하는 목적을 가질 수 있거나 그것들은 어떤 목적들도 가질 수 없다. 적어도 일 실시예에서, 이동 에이전트들은 환경의 변화들, 진행 중인 임의의 작업들의 교체들, 및/또는 다른 상 태들에 응답한다. 그러한 변경들 및 상태들에 응답하여, 그러한 에이전트들은 정서 반응들을 투영 또는 시뮬레 이션하는 응답들을 나타내도록 구성될 수 있다; 예를 들어, 에이전트들은 그것들의 작업들을 수행하는 프로세스 에서 발생할 수 있는, 계획되고 예기치 않은 양자의, 다양한 이벤트들과 일치하는 방식으로 반응할 수 있다. 상 이한 이동 에이전트들은 상이한 성격 특성들 및/또는 기질들과 연관될 수 있는데, 이는 정적 또는 동적일 수 있 고, 이는 환경 상태들 및/또는 다른 이동 에이전트들의 행동에 기초하여 변경하도록 구성될 수 있다. 이동 에이 전트들은 예를 들어 시각적 검출, 청각적 검출, 근접 검출, 모션 검출, 기지국과 및/또는 다른 이동 에이전트들 과의 직접 통신, 및/또는 기타, 및/또는 그것들의 임의의 조합을 포함하는, 임의의 적합한 기술을 사용하여 환 경 상태들(블럭들 및 다른 구성요소들의 위치들, 다른 이동 에이전트들의 위치들 및 이동, 온도, 지형, 목적들, 장애물들, 인간 사용자들의 행동들, 및/또는 기타와 같은)을 검촐하도록 더 구성될 수 있다. 단독으로 또는 임의의 조합으로, 이동 에이전트들에 임의의 또는 모든 상기 피처를 제공함으로써, 다양한 이동 에이전트들의 행동들 및 반응들은 본 출원에서 설명된 기술들에 따라 구현되는 시스템들 및 완구들에의 향상된 관심 및 주의도들을 제공할 수 있다. 추가 세부사항들 및 변형들이 본 출원에서 설명된다."}
{"patent_id": "10-2015-7033682", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "예시적인 목적들을 위해, 본 출원에 설명 및 도시되는 시스템 및 방법들은 그것의 주요 목적으로, 사용자를 즐 겁게 하는 목적을 가지는 완구의 상황하에서 구조들을 구축하기 위한 이동 에이전트들을 나타낼 수 있다. 그러"}
{"patent_id": "10-2015-7033682", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "나, 해당 기술분야의 통상의 기술자는 본 출원에 설명된 기술들이 구조들을 구축, 감정들을 디스플레이, 협력, 경쟁, 및/또는 다른 행위들을 수행할 수 있는 이동 에이전트들을 제공하는 것이 유용하거나 바람직할 수 있는 많은 상이한 상황 및 환경에 적용될 수 있다는 것을 인식할 것이다. 따라서, 본 출원에 설명된 기술들은 임의의 그러한 상황 또는 환경에 적용가능하도록 의도되고, 본 출원에 제시된 특정한 구현들에 제한되도록 의도되지 않 는다. 또한, 다음 설명은 단독으로 또는 다양한 조합들로 구현될 수 있는 많은 상이한 개념, 피처, 및 메커니즘을 제"}
{"patent_id": "10-2015-7033682", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "시한다. 해당 기술분야의 통상의 기술자는 다양한 실시예들이 임의의 적합한 조합을 사용하는 그러한 개념, 피 처, 및 메커니즘 중 하나 이상을 사용하여 구현될 수 있다는 것을 인식할 것이다. 다음 설명의 목적들을 위해, 용어 \"구성요소\"는 개별적인 블럭들 및/또는 다른 요소들의 다수의 상이한 유형 중 어느 하나에 적용되도록 의도된다. 아래에 보다 상세하게 설명될 바와 같이, 구성요소들은 세 개의 유형: 수동, 반-능동 및 능동 중 하나에 속하는 것으로 분류될 수 있다. 또한, 용어 \"블럭\" 또는 \"구성요소\"의 사용은 제한 으로 간주되지 않아야 하고, 특히 구성요소가 블럭의 종래 관념들에 적합한 기하학적 구조 또는 조성물과 일치 하는 형태로 나타나야 하는 것을 필요하게 만들지 않는다. 예를 들어, 작업면이 종래 블럭 형태와의 유사성을 지닐 개연성이 낮지만, 역할 및 기능에 관하여, 아래에 논의될 바와 같이, 그것은 수동 구성요소 유형들의 카테 고리에 들어 맞는다. 또한, 아래 설명될 바와 같이, 이동 에이전트들은 구성요소의 유형으로 간주될 수 있다. 분류에 관하여, 구성요소들을 세 개의 구성요소 유형들로 나누는 것은 부류들 내 일관성들 및 부류들 간 차이들 을 논의하는데 있어서 편리한 순서화 및 기준을 제공한다; 그러나 그러한 분류들은 선택적인 것이고 범위를 제 한하는 것으로 간주되지 않아야 한다. 아래에서 보다 상세하게 설명될 바와 같이, 구성요소들의 다양한 분류들 은 전체 시스템 내에서 그리고 서로 각각에 대한 그것들의 역할들, 뿐만 아니라 전체로서의 시스템의 성질을 이 해하는데 유용할 수 있는 특정한 성격들 및 차이점들을 가진다. 시스템의 다양항 요소들은 단일 시스템의 구축 내에서 작동하는 통일된 프레임워크에서 보여질 수 있다. 적어도 일 실시예에서, 시스템은 그들 자체의 구조를 구축하는 작업이 주어질 수 있는 다양한 유형들 및 기능 및 자율 도들의 구성요소들을 포함할 수 있다. 한 명 이상의 사용자는 원하는 완성된 디자인을 제공함으로써, 및/또는 구성요소들(블럭들과 같은)을 수송 및 배치할 수 있는 이동 에이전트들에 지시하기 위한 높은 레벨 명령들을 제 공함으로써, 및/또는 개별적인 에이전트들의 별개의 행위들을 직접적으로 제어함으로써, 이 활동에 참여할 수있다. 다양한 실시예들에서, 사용자(들)은 임의의 적합한 통신 메커니즘 및/또는 사용자 인터페이스 메커니즘을 사용 하여 개별적인 에이전트들과 및/또는 시스템과 상호작용할 수 있다. 적어도 일 실시예에서, 시스템은 예를 들어, 태블릿 컴퓨터, 스마트폰, 및/또는 다른 모바일 컴퓨팅 디바이스와 같은, 임의의 적합한 디바이스(또는 하나보다 많은 디바이스)를 통해 이동 에이전트들 및 사용자들 간 강인한 인터페이스를 지원한다. 적어도 일 실 시예에서, 사용자 인터페이스의 임의의 다른 유형이 사용될 수 있더라도, 터치-기반 스크린 인터페이스 또는 다 른 직접-조작 인터페이스가 지원된다. 대안적인 실시예들에서, 예를 들어 스피치 입력, 텍스트-기반 입력, 마우 스-기반 입력, 조이스틱 입력, 및/또는 깉와 같은 인터페이스 메커니즘들의 다른 유형들이 지원될 수 있다. 적 합한 출력 메커니즘(들) 및/또는 피드백과 함께, 임의의 그러한 입력 메커니즘은 그래픽(또는 비-그래픽) 인터 페이스를 제공하는데 사용될 수 있다. 시스템의 에이전트들은 사용자 제어의 임의의 적합한 및 원하는 레벨하에 서 및/또는 임의의 적합한 및 원하는 자율도를 가지고 작동할 수 있다. 적어도 일 실시예에서, 시스템은 매트(mat)와 같은 작업면을 포함한다. 매트는 기계-판독가능한 코드, 또 는 마크들을 지닐 수 있는데, 이는 센서들(광학 센서들과 같은)을 통해 이동 에이전트들에 대한 그것들의 위치 들을 결정하기 위해 이동 에이전트들에 의해 사용가능한 위치 정보를 인코딩한다. 이제 도 18을 참조하면, 몇몇 이동 에이전트가 일 실시예에 따라, 작업면 상에서 다양한 구성요소들 (블럭들로서 도시된)을 조작하는 프로세스에 있는 예가 도시된다. 그 예에서 보여지는 바와 같이, 다양한 이동 에이전트들은 서로 협력하여 작업할 수 있다; 대안적으로, 그것들은 서로 개별적으로 작업할 수 있거 나 서로 간섭 및/또는 경쟁할 수도 있다. 구성요소들의 조작은 구조들의 구축, 뿐만 아니라 파기 또는 임 의의 다른 적합한 조작을 포함할 수 있다. 구성요소들은 아래 보다 상세하게 논의될 바와 같이, 많은 상이 한 형태들을 취할 수 있고, 블록들일 필요는 없다. 도 18은 표면 및 구성요소들에 대한 에이전트들의 행동들 및 상호작용들의 몇몇 예를 도시하고, 그것들 중 많은 것들은 본 출원에 보다 상세하게 설명된다. 도 18의 예에서, 일부 구성요소들은 에이전트 들이 구축 프로젝트들을 위해 필요에 따라 구성요소들을 취할 수 있는 블럭 공급 영역에 유지 된다. 에이전트(104G)는 공급 영역으로부터 구축 프로젝트가 진행중인 빌딩 영역으로 구성요소 (402N)를 수송하는 프로세스에 있다. 적어도 일 실시예에서, 표면은 빌딩 및 수송을 위한 별개의 구역들을 정의하는 코드들 또는 마킹들을 포함할 수 있고, 따라서 그러한 에이전트(104G)는 이러한 방식으로 402N과 같은 구성요소를 수송할 때 수송 통로를 사용할 수 있다. 추가 예로서, 도 18은 그렇지 않으면 도달하기에 매우 높을 수 있는 로우(row) 상에 구성요소(402P)를 배치하기 위해 시저 리프트(104H)(그 자체로 에이전트(104J)에 의해 작동되는 툴일 수 있는, 또는 그것은 그 자체로 에이 전트일 수 있다)를 사용하는 에이전트(104J)를 도시한다. 도 18은 기능 도어로서 구현되는 능동 구성요소 (402G)(아래에서 더 상세하게 설명되는 능동 구성요소들)를 더 도시한다. 이 예에서, 능동 구성요소(402G)의 도 어는 그것이 객체(에이전트 또는 다른 구성요소와 같은)가 임계 거리 내에서 검출될 때 신호를 송신 하는 거리 센서로서 구현되는, 구성요소 신호(402H)를 수신할 때 개방될 수 있다. 예를 들어, 반사광, 초음파 사운드, 블루투스 접근, 및/또는 기타와 같은, 접근 또는 모션 검출을 위한 임의의 적합한 메커니즘이 사용될 수 있다. 이 예에서, 구성요소(402M)를 운반하기 위해 협력하는 에이전트들(104L, 104M)은 구성요소(402H)의 거 리 센서를 활성화하여, 구성요소(402H)가 객체의 검출을 나타내는 신호를 발산하게 한다. 구성요소(402G)의 도 어는 개방됨으로써 응답하며, 에이전트들(104L, 104M)이 구조로 진행하는 것을 허용한다. 도 18은 또한 구성요소들의 그것의 가상 모델 및 물리적 환경 간 불일치를 생성할 수 있는, 붕괴를 점검하는 에이전트(104N)를 도시한다. 아래에서 보다 상세하게 설명될 바와 같이, 시스템은 예를 들어, 물리적 환경의 검출된 상태에 기초하여 가상 환경을 조절함으로써, 또는 물리적 환경이 가상 환경과 합치하게 하도록 물리적 환경들(예를 들어 이동 에이전트들 및/또는 구성요소들에 의해)을 만듦으로써 그러한 검출된 불일치들에 반응할 수 있다. 적어도 일 실시예에서, 이동 에이전트들은 서로에 대한 및/또는 표면에 대한 그것들의 상대적인 위치 들을 확인하기 위해 서로와 통신할 수 있다. 적어도 일 실시예에서, 표면은 편리한 저장 및 분해를 제공하 기 위해 회전가능한 또는 폴딩가능한 매트로 구현된다; 대안적으로, 표면은 강성일 수 있거나 또는 다수의 서로 맞물리는 조각들을 가질 수 있다. 작업면은 구성요소들(블럭들과 같은)이 조작되고 집합될 수 있는 영역을 제공하도록 의도된다. 적어 도 일 실시예에서, 작업면은, 배치될 때, 구성요소들를 집합시키기 위한 실질적으로 평평한 영역을 제공한다. 그러나, 적어도 일 실시예에서, 어떤 특별한 표면도 제공될 필요는 없고, 구성요소들이 바닥, 테이블 또는 임의의 다른 이용가능한 편리한 표면 상에서 조작 및 집합될 수 있다. 또한, 적어도 일 실시예에서, 시스템은 작업면의 제한들을 너머 구성요소 기능을 용이하게 한다. 다른 실시예들에서, 구성 요소 배치 형태들은 가변적 표면을 수용할 수 있다; 예를 들어, 작업면은 다양한 높이들에서 상호연결된 별개의 평평한(및/또는 평평하지 않은) 영역들에 걸쳐 이어질 수 있다. 예시적인 목적들을 위해, 작업면은 어떤 마킹들도 없는 무지의 직사각형 표면으로서 도 18에 도시된다. 그 러나, 적어도 일 실시예에서, 작업면은 기계-판독가능한 코드들 및/또는 다른 마킹들을 포함할 수 있다. 이제 도 14를 참조하면, 기계-판독가능한 코드들을 포함하는 작업면의 예가 도시된다. 이러한"}
{"patent_id": "10-2015-7033682", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "예에서, 표면은 육방정계 격자를 포함한다; 그러나, 해당 기술분야의 통상의 기술자는 격자들의 다른 유형 들 또는 격자가 전혀 없는 것을 포함하는 임의의 다른 배열체가 가능하다는 것을 인식할 것이다. 또한, 코드들 은 임의의 적합한 형태를 취할 수 있고 도 14에 도시된 특정한 코드들과 유사할 필요는 없다. 수동 구성요소들 이제 도 4를 참조하여, 적어도 일 실시예에 따라 몇몇 구성요소 유형의 성격들일 수 있는 대표적인 피처들을 가 지는 그리고 블럭들로서 구현되는, 작업면 맨 위의 수동 구성요소들(402A 내지 402D)의 몇몇 예가 도시된 다. 도 4는 또한 포크(fork)-형 호이스트(hoist)가 구비되는 이동 에이전트의 예를 도시한다. 수동 구성요소들은 기능적으로 불활성인 요소들을 포함한다. 그러한 구성요소들의 일례는 불활성 블럭들이 며, 이는 큐브들, 직사각형 직육면체들, 또는 임의의 다른 적합한 형상일 수 있다. 이들 요소들은 그것들을 시 스템에서의 다른 요소들에 유용하게 만드는 마크들을 가질 수 있고/있거나, 그것들은 구조적 역할로 쓰일 수 있 다. 일반적으로, 수동 구성요소들은 상태를 임의로 변경할 수 없다. 다양한 실시예들에서, 수동 구성요소에 관한 관련 데이터는 구성요소에 첨부되거나, 프린트되거나, 근접하게 배치되는 기계-판독가능한 코드의 임의의 형태를 포함하여, 임의의 적합한 방식으로 저장 및/또는 인 코딩될 수 있다; 그러한 코드는 임의의 또는 모든 광학적으로 또는 자기적으로 판독가능한 마크들, RFID 태크들, 및/또는 기타를 포함할 수 있다. 이제 도 17을 참조하면, 다양한 실시예들에 따른, 기계-판독가능한 코 드들의 예들이 도시된다; 그러나, 다른 실시예들에서, 기계-판독가능한 코드들은 임의의 적합한 형태를 취 할 수 있다. 임의의 적합한 수단을 사용하여, 그러한 관련 데이터를 저장 및/또는 인코딩하는 것은, 구성요소 와 작업하고/하거나, 구성요소를 조작하고/하거나, 구성요소 주위 환경에서 작동하는 이동 에이 전트들에 의해 그러한 데이터의 판독 또는 디코딩하는 것을 가능하게 한다. 그러한 실시예들은 외부 에이 전트 또는 다른 개체의 기능을 지원하는 한편, 구성요소는 여전히 수동 요소이다. 유사하게, 몇몇 실시예 에서, 수동 구성요소들이 빌딩을 위해 사용될 수 있고 다양한 위치들 또는 배향들로 배치될 수 있고/있거 나, 유사한 또는 다른 부류들의 피어 구성요소들과 배열체들로 적층될 수 있지만, 이러한 역할은 수동적인 것이고 그러한 구성요소들은 여전히 수동으로서 분류될 수 있다. 수동 구성요소들은 배치 동안 정렬을 용이하게 하고 서로 인접한 구성요소들과의 어느 정도의 고정 또는 수동 맞물림(예를 들어, 중력 핏)을 제공할 수 있는 인터페이싱 요소들을 가지는 것에 관해 반-능동 또는 능동 구성요소들과 유사할 수 있다; 그러나, 일반적으로, 수동 구성요소들은 임의의 기능적 전자 기 술 또는 작동가능한 메커니즘들이 부족하다(또는 그것들이 그러한 요소들을 포함하는 경우, 요소들은 비기능적 이거나 본 출원에 설명된 동작들에 관련 없는 동작들을 수행한다). 구성요소(402B)는 표면 기하학적 구조를 가지는 구성요소의 예이다. 이 경우에서, 표면 기하학적 구조는 구성요소(402B)의 면들이 하향으로 배향되는지 또는 에지가 포크들을 향해 직교하여 제공되는지에 관계없이 호 이스트의 포크들을 수용하도록 구성된다. 구성요소(402C)는 그것의 베이스 상에서 이 형태의 도치에 맞을 수 있는 그것의 상부 표면으로부터 연장하는 상승된 기하학적 피처를 가지는(그렇게 함으로써 이 디자인의 구성요소들이 서로 맞물려 적층하는 것을 가능하게 한다) , 다른 예이다. 구성요소(402D)는 구성요소를 위 에서 들어올리는 것을 용이하게 하는, 기하학적 피처의 베이스에 추가된 일자형 개구들을 갖는, 구성 요소(402C)의 피처와 유사한 상승된 기하학적 피처를 가지는, 또 다른 예이다. 바람직한 실시예에서의 수행에 관해, 작업면은 또한 수동 구성요소로 간주될 수 있다. 작업면은 마크들, 기계-판독가능한 코드들, RFID 태그들, 및/또는 표면 상의 구성요소들의 배치 및 이동 에이 전트의 네비게이션을 용이하게 하는 임의의 다른 적합한 요소들을 포함할 수 있다.반-능동 구성요소들 반-능동 구성요소들은 다양한 잠재적인 구성요소 유형들을 포함한다. 본 출원에서의 설명의 목적들을 위해, 반-능동 구성요소는 수동 구성요소들과 유사한 기본 속성들을 가질 수 있으나, 또한 사용자들 및/또는 이동 에이전트들에 의해 제어될 수 있는 기능을 소유할 수 있다. 예를 들어, 반-능동 구성요소 는 기계적 또는 다른 상태 변화를 겪을 수 있다. 그러한 구성요소의 예는 다른 구성요소와 맞물 리는 것을 가능하게 하는 기계적 시스템을 가지는 구성요소이다. 그러한 시나리오에서, 이동 에이전트는 반-능동 구성요소를 작동하기 위해 배치되는 조작자를 가지고 구성될 수 있다. 예를 들어, 회전가능한 확 장 로드는 구성요소 상의 소켓에 연결할 수 있다; 소켓을 회전함으로써, 이동 에이전트는 하나 이상 의 인접 구성요소들 상의 표면 피처에 걸쇠를 거는 인터로크 피스들을 체결할 수 있다. 유사한 결과는 구 성요소들 간 결합력을 제공하는 자석들을 이용하여 성취될 수 있다; 이 경우에서, 구성요소들을 조작 하는 작업들이 주어지는 이동 에이전트들은 구성요소에 함유되는 자석이 코일을 통해 전류를 보냄으 로써 아암에 부착하는 것 또는 상기 자석을 해제하는 것을 가능하게 하기 위해 대안적으로 조작자의 단부에 페 라이트 자심을 갖는 자석 코일을 채용할 수 있다. 하나 이상의 반-능동 구성요소들이 상태 변화할 수 있는 하나 이상의 요소(들)를 포함하는 다른 구성들이 가능하다. 이제 도 5를 참조하면, 각 면 상의 중앙에 위치되는 직사각형 또는 정사각형 리세스 및 각 에지로부 터의 원형 리세스 오프셋을 가지는 블럭 구성요소(402E)의 예가 도시된다. 철을 함유한 패널(미도시)은 리 세스의 면 상에 잠재적으로 존재하는 임의의 식별 마크들 또는 피처들이 그것이 같은 높이로 장착되면 인 접 표면들로 인한 마모 또는 스크래칭을 줄여주는 경향이 있을 수 있도록 각 리세스 내에 고정될 수 있다. 도 5는 또한 블럭 구성요소(402E)와 같은 구성요소들을 위치결정하는 작업이 주어지는 이동 에이전트(미도시)에 의해 장착되거나 다르게 제어되는 것으로 가정할 수 있는, 조작 툴, 또는 조작자를 도시한다. 이 경우에서, 조작자는 구성요소(402E)의 면 상에 원형 리세스들과 일치시키기 위한 대응하는 크기 및 간격의 돌출부들을 지닌다. 조작자의 중심에 구성요소(402E)의 리세스와의 접촉을 보증하기 위해 그것의 장착면에 단단히 놓이는, 전자석으로 작동하도록 구성되는 철을 함유한 물질 또는 영구 자석 일 수 있는 링 요소가 있다. 조작자가 구성요소(402E)에 적용될 때, 링 요소 및 리세스 패 널 사이의 자기 흡인을 통해 생성되는 인력은 둘 사이의 고정도를 생성하고, 그렇게 함으로써 조작자를 제 어하는 이동 에이전트가 구성요소(402E)를 이동시키거나, 들어올리거나, 다르게 조작하는 것을 가능하게 한다. 리세스들 및 돌출부들 간 접합하는 기하학적 구조들은 서로 맞물릴 때 조작자에 관한 구성요소"}
{"patent_id": "10-2015-7033682", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "(402E)의 배향 및 위치 상에 예측가능성 및 일관성의 보증을 제공한다. 해당 기술분야의 통상의 기술자는 공간 에서 구성요소(402E)와 같은 구성요소를 배치 및 이동하는데 있어서 정밀도를 유지하는 것의 중요성은 조 작자의 위치와 같은 알려진 위치에 대해 구성요소의 상대적인 위치의 인식에 의존한다. 그러나, 다른 기술들이 그러한 정밀도를 보증하기 위해 사용될 수 있다. 구성요소 크기와 같은 인자들에 의존하는 것, 조작자의 위치 및 관련 모션 제어의 작업 지식에 대한 제한 들 및 피처 기하학적 구조들 및 위치를 일치시키는 것, 조작자를 접합하는 피처들의 인터로크를 보장할 방 법으로 구성요소(402E)의 면에 성공적으로 적용하는 것이 어려워질 수 있다는 것이 또한 이해될 수 있다. 다수의 기술 중 임의의 기술은 구성요소(402E)에 대한 조작자의 위치결정을 용이하게 하는데 사용될 수 있 다. 예를 들어, 적어도 일 실시예에서, 카메라 또는 유사한 이미징 디바이스는 조작자의 중심축과 같 은 장소에 배치될 수 있다. 이런 실시예에서, 구성요소(402E)의 오목 영역들 상의 또는 가까운 임의의 적 합한 마크(들)(미도시)은 중심 지점 또는 몇몇 다른 알려진 지점의 편리한 식별을 가능하게 하기 위한 방법으로 구성될 수 있고, 따라서 패널의 중심에 매칭하는 회전 배향을 갖는 패널의 중심에 직교하는 백터를 따르는 정렬 조작자는 접합하는 피처들이 의도한 대로 서로 맞물릴 수 있다는 것을 보증할 수 있다. 구성요소(402E)가 체결되고 그것의 위치 또는 배향이 의도한 대로 변경되면, 조작자 및 구성요소(402E) 간 점착을 지속하는 자기력은 두 개의 본체를 함께 고정하는 전자석을 작동시키는 전류를 중단시킴으로써 또는 그러한 자석이 구성 (402E)을 조작자에 고정시킬 수 있는 영구적인 자석의 힘을 무효화할 수 있는 배열로 전자석에 전류를 인 가함으로써 약화될 수 있다. 유사한 방식으로 자석들의 자연적인 흡인을 지역적으로 무효화하는 것은 또한 이동 에이전트가 자기력에 의해 구속되는 구성요소들을 분리할 수 있는 수단이다."}
{"patent_id": "10-2015-7033682", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "해당 기술분야의 통상의 기술자는 위에서 설명된 자기 결합이 이동 에이전트가 구성요소(402E)와 같은 구성요소 들을 조작할 수 있는 단지 일례인 것을 인식할 것이다. 설명된 바와 같이, 구성요소(402E)와 같은 반-능동구성요소들의 상태 변화들은 그러한 조작을 용이하게 할 수 있다. 아무리 그러한 상태 변화들이 수행되도, 조작자 및 구성요소(402E) 간 작동가능한 인터로크는 이동 에이전트가 체결 및 조작하는 능력을 가지는 것 일 수 있다. 적어도 일 실시예에서, 이동 에이전트는 서로 기계적으로 연결되는 것으로부터 이익을 얻는 구성요소들의 어셈블리를 구축하기 위해 구성요소(402E)와 같은 구성요소들을 사용한다. 서로 부착하기 위한 구성요소들 의 기계적 또는 다른 수단에 대한 잠재적인 이점은 이것들이 종래 벽과 같은, 유사한 구성요소들의 어셈블리들인지, 또는 그것의 맨위에 장착되는 뾰족한 블럭에 걸쇠를 거는 블럭과 같은, 비유사한 구성요소 유 형들인지에 관계 없이, 이동 에이전트들이 구축할 수 있는 구조들의 안정성 또는 강도를 개선하는 것에 놓인다. 설명된 예에서, 메커니즘은 래칭 메커니즘의 상태(예를 들어, 잠겨있지 않은 또는 잠긴)를 변화시키기 위한 에 너지를 제공하기 위해 외부 조작자에 의존할 수 있거나 의존하지 않을 수 있다. 적어도 일 실시예에서, 반-능동 구성요소(구성요소(402E)와 같은)는 그것의 기능적 동작을 지원하기 위해 그 자체의 내부 파워 서플라이 (미도시)를 가질 수 있다."}
{"patent_id": "10-2015-7033682", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "해당 기술분야의 통상의 기술자는 반-능동 구성요소들의 많은 다른 유형들이 사용될 수 있다는 것을 인식 할 것이다. 반-능동 구성요소들의 다른 예들은 조명 또는 상태를 전하기 위한 LED들, 통합된 출입구들을 갖는 구성요소들 또는 LCD 디스플레이들을 포함하는 구성요소들이 구비된 것들일 수 있고, 이들 중 임의의 구성요소는 지시를 제공하는 무선 신호의 수신 또는 구성요소의 표면 변경 위치 상의 기계적 스위 치와 같은 잠재적으로 광범위한 수단에 기초하여 상태를 변화시킬 수 있다. 반-능동 구성요소들은 또한 그 자체로는 구조적 요소들(블럭들)과 유사하지 않을 수 있고 그것들의 주요 기능으로서 그러한 역할을 제공하지 않을 수 있는 형태들을 가정할 수 있다. 이러한 종류의 반-능동 구성요소들의 예들은 이동 에이전트들이 그것들의 작업들을 수행하는데 있어서 용이하게 하거나 보다 양호하게 하는 구성요소들을 포함한다. 하나 의 예는 플랫폼을 낮은 높이로부터 바닥에서 멀리 보다 높은 위치로 상승시킬 수 있는 시저 리프트를 이용하여 장착되는 휠이 달린 섀시이다. 그러한 구성요소는 전형적인 구조상의 블럭 형태와 실질적으로 상이할 것으 로 예상되며, 상기 플랫폼을 상승 및 그것을 승강 및 하강시키거나 플랫폼이 보다 큰 구조들을 구축하는데 있어 서 도울 수 있는 위치로 이동시키기 위한 동작을 이동 에이전트에 의한 가능하게 하도록 설계될 수 있다. 이러한 방식으로, 이러한 성질의 반-능동 구성요소들은 (이 경우에서, 구축 장비의 종류로서) 툴들의 기능 적 역할을 이행할 수 있다. 반-능동 구성요소로서 휠이 달린 플랫폼의 예는 이러한 구성요소 유형의 공통적인 특성들일 수 있는 것을 예시한다. 구성요소가 단일 이동 에이전트 또는 협력하여 동작하는 다수의 이동 에이전트(예를 들어, 하나의 이동 에이전트는 휠이 달린 플랫폼들을 수동 구성요소들이 배치되어야 할 위치들로 이 동시키는 한편 다른 이동 에이전트는 지정된 위치들에 구성요소들을 배치하기 위해 플랫폼 상에 위치 된다)에 의한 동작을 위해 설계될 수 있다는 것을 이해할 수 있다. 대안적으로, 플랫폼은 또한 구성요소들(40 2)을 조작 및 접지력 있게 밀착시키기 위한 이동 에이전트의 하드웨어와 유사한 하드웨어가 구비될 수 있다. 이 러한 방식으로, 이러한 예에서의 반-능동 구성요소는 이동 에이전트의 조작 및 배치 능력을 확장하는 역할을 한다. 능동 구성요소들 능동 구성요소는 주로 이동 에이전트로부터의 직접적인 기계적 또는 전기적 입력 또는 지시 없이 기 능들을 자체적으로 동작하거나 다르게 수행하는 그것들의 능력에 의해 구분된다. 구성요소들의 이 카테고 리는 가장 다용적이고 자율적일 뿐만 아니라 기능적인 가장 광범위한 유형들을 제공한다. 그것들은 그 외에 기 능에 관하여 반-능동 구성요소들과 유사할 수 있으나, 상당한 정도로 독립적으로 동작할 수 있다. 이들 구 성요소들은 예를 들어, 액션으로 이어지는 프로세스들을 트리거하는 센서들을 포함할 수 있고/있거나, 그 것들은 프로그램된 루틴을 따를 수 있다. 임의의 수의 특화된 구성요소는 이러한 카테고리에 꼭 들어맞을 수 있다. 이들 구성요소들 중 일부는 수동 또는 반-능동 구성요소들과 동일한 표면상의 기하학적 구조를 가질 수 있어, 그것들이 예를 들어, 수 동 및/또는 반-능동 구성요소들의 구축된 구조들 내에 적층하는 것을 가능하게 한다. 그러나, 능동 구성요 소들은 또한 물리적 지원을 너머 추가적인 기능을 제공할 수 있다. 일례는 그것의 부근에서의 모션을 검출 하기 위해 그것의 면 상에 센서를 구비하는 구성요소이다. 그러한 구성요소는 예를 들어, 배터리를 동력으로 이용하는 전동 도어를 포함하는 다른 능동 구성요소에 무선 신호를 송신하도록 프로그램될 수 있 다. 제2 구성요소가 제1 구성요소로부터 신호를 수신할 때, 그것은 도어 메커니즘을 작동시켜 구성요소를 관통하는 통행을 가능하게 한다. 다른 예에서, 능동 구성요소는 가로등과 유사한 타이밍 스킴을 채용하고 도개교를 상승 및 하강함으로써 트래픽의 흐름을 제어할 수 있다. 기능적 하드웨어, 통신 수단 및 아마도 어느 정도의 프로그램가능성을 조합하 여(구성요소가 독립적인 호스트 디바이스에 의해 직접 제어되지 않는 경우), 광범위한 가능성들이 쌍방향 빌딩 환경을 생성하는데 있어서 능동 구성요소들의 역할들을 위해 존재한다. 따라서 능동 구성요소들(40 2)은 예를 들어, 사운드 디바이스들, 디지털 디스플레이 스크린들, 광들 및/또는 작업면 상에서 작동하는 이동 에이전트들의 활동에 직접 응답하고/하거나 영향을 주는 메커니즘들, 및/또는 그것들의 임의의 조합 과 같은 임의의 적합한 요소들을 다양하게 구비할 수 있다. 반-능동 구성요소들이 구조적 역할을 제공하지 않았던 작동가능한 구성요소들 또는 툴들을 포함했던 것과 동일한 방식으로, 기능적이고 높은 자율도 양자로 동 작하는, 이동 에이전트들은 그것들 자체로 능동 구성요소의 유형으로 간주될 수 있다. 명확성을 위해, 그러한 에이전트들이 또한 본 출원에 설명된 상황하에서 능동 구성요소의 유형인 것으로 간주 될 수 있더라도, 이동 에이전트들을 수반하는 다음 설명은 이와 같이 그것들을 계속 나타낼 것이다. 따라 서, 도 18의 예에서, 구성요소들은 수동 및/또는 반-능동일 수 있으나, 에이전트들은 능동 구성요소 의 유형으로 간주될 수 있다. 능동 구성요소의 하나의 특정한 유형은 일정 레벨의 자율적인 이동성을 가지는 이동 에이전트이다. 이동 에이전트들은 완전히 자율적으로 작동할 수 있고/있거나, 그것들은 개별적으로 또는 일부 중앙 제어 유닛을 통해 사용자에 의해 제어될 수 있다. 대안적으로, 이동 에이전트들은 중앙 제어 유닛에서의 자율적 인 제어 메커니즘들에 의해 지시되는 바와 같이 작동할 수 있다. 적어도 일 실시예에서, 이동 에이전트들 및 다른 능동 구성요소들은 제어 유닛 또는 사용자에 의해 지정될 수 있는 고-레벨 목적들을 달성하려고 시도하도록 기능하면서, 그러한 목적들을 달성하기 위해 저 레벨로 자율적으로 기능할 수 있다. 이제 도 1을 참조하면, 전력, 센싱, 프로세싱, 및 통신 요소들, 뿐만 아니라 액추에이터들 및 (선택적으로) 출 력 디바이스(들)을 포함하는, 일 실시예에 따른 이동 에이전트의 개념적 아키텍처를 도시하는 블록도가 도"}
{"patent_id": "10-2015-7033682", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "시된다. 해당 기술분야의 통상의 기술자는 이동 에이전트에 포함되는 것으로 도 1에서 도시된 다양한 요소 들이 단지 대표적이고, 요소들 중 일부가 선택적일 수 있다는 것을 인식할 것이다. 또한, 대안적인 실시예들에 서, 도 1에 도시되지 않은 다른 요소들이 이동 에이전트에 포함될 수 있다. 또한, 요소들의 상이한 구성들 을 가지는 이동 에이전트들들의 상이한 유형들이 포함될 수 있다. 전력 요소는 이동 에이전트에 전력을 제공한다. 전력은 예를 들어, 배터리, 솔라 셀, 및/또는 기타와 같은, 임의의 적합한 소스로부터 제공될 수 있다. 센싱 요소(들)(또느 센서들)은 예를 들어, 광학, 가속, 회전, 음향, 인코딩 어셈블리들(예를 들어, 마그네 틱 휠 인코더들), 및/또는 압력/힘 및 거리 센서들(예를 들어, 적외선 또는 초음파 기반)과 같은, 요소들 중 임 의의 적합한 요소 또는 조합을 포함할 수 있다. 다양한 실시예들에 따라, 센서들은 이동 에이전트가 위치(위치확인)를 결정 및 모니터링하고, 다른 구성요소들을 식별하고, 구성요소들을 조작하는 등과 같은 다양한 기능들을 하도록 도울 수 있다. 센서들은 그것의 이용가능한 작업들 중 이동 에이전트의 수행에 수반되는 임의의 활동들을 수행하는데 있어서 사용될 수 있다. 또한, 일부 실시예들에서, 일부 센서들 은 그것이 위치와 관련됨에 따라 구체적인 회전각 또는 회전율들에 관한 정보를 제공하는 휠 인코더들과 같은 에이전트의 내부 상태들을 모니터링하도록 지시될 수 있다. 외부-지시 센서들은 초음파 거리 센 서들과 같은 단순한 센서들뿐만 아니라 2D 영상 장치들과 같은 복잡한 구성요소들을 포함할 수 있다. 적어도 일 실시예에서, 외부-지시 센서들은 이동 에이전트의 환경의 상태를 모니터링하는 역할을 할 수 있고 에 이전트의 조작 또는 다른 구성요소들의 수송에 관한 정보를 포함하여, 그것 내 변화들을 검출할 수 있다. 에이전트는 또한 예를 들어, 마이크로컨트롤러 및 임의의 관련 메모리 모듈들, 및/또는 임의의 다른 적합 한 요소들과 같은, 내장 프로세서(들)의 임의의 적합한 유형을 포함할 수 있다. 에이전트는 또한 임의의 알려진 기술들에 따라 구현될 수 있고 임의의 적합한 표준들에 따를 수 있는, 통 신 모듈(들)의 임의의 적합한 유형을 포함할 수 있다. 예들은 블루투스, 와이-파이 및/또는 라디오 주파수 또는 적외선 광, 및/또는 기타를 사용하는 것들과 같은 임의의 적합한 무선 및/또는 유선 기술들을 포함한다. 통신 모듈들은 임의의 이용가능한 통신 네트워크를 통해 통신할 수 있다. 에이전트는 또한 이동 에이전트 및/또는 그것의 환경의 측면들에 대한 변화에 직접적으로(또는 간접 적으로) 영향을 주도록 작동할 수 있는, 액추에이터(들)의 임의의 적합한 유형을 포함할 수 있다. 그러한 변화들은 예를 들어, 에이전트를 이동 또는 재-배향하는 것, 및/또는 구성요소들 및/또는 다른 에이전트들 (예를 들어, 블럭들 또는 다른 구성요소들을 픽업 및 이동하기 위한)과 상호작용하는 것을 포함할 수 있다. 액추에이터들은 추진 메커니즘, 모터들, 음성 코일들, 아암들, 및 기타와 같은 기계적 감지의 변화 를 가져오는 요소들을 포함할 수 있다. 출력 디바이스(들)이 선택적이나, 에이전트는 또한 그러한 디바이스들을 포함할 수 있다. 그러한 출 력 디바이스(들)는 사용자들에 의해 인지가능한 출력을 제공하기에 적합한 임의의 요소들을 포함할 수 있 다; 예들은 스피커들, LED들, 및/또는 LCD 디스플레이들을 포함한다. 출력은 시각적, 청각적, 촉각적, 및/또는 그것들의 임의의 조합일 수 있다. 적어도 일 실시예에서, 출력 디바이스(들)는 그것들의 센서(들)를 통해 다른 에이전트들에 시그널링할 수 있는 출력을 생성(또는 다른 에이전트들에 시그널링을 발행) 할 수 있다; 예를 들어, 하나의 에이전트는 다른 에이전트에 의해 생성되는 출력에 응답할 수 있다. 에이전트에 의해 생성된 그러한 출력은 그것이다른 에이전트들에 의해 인지가능한 경우에도 인간들 에 의해 인지가능할 수 있거나 인지가능하지 않을 수 있다. 출력 디바이스(들)는, 포함될 때, 액추에이터 의 유형으로 간주될 수 있다. 디바이스(들)에 의해 생성된 출력의 예들은 사용자에게 이동 에이전트가 이행; 감정 응답의 표시, 피 드백, 요청의 상세한 표현(디바이스 상의 전용 사용자 인터페이스를 통해 그렇게 행하는 것에 대한 대안으로서 또는 그것에 대한 추가로서); 및/또는 기타를 요구하는 요청을 가진다는 통지를 포함한다. 적어도 일 실시예에서, 이동 에이전트는 도 1에서 식별되는 일부 또는 모든 요소의 다수의 카피들을 포함 할 수 있다. 반대로, 이동 에이전트가 도 1에 식별되는 모든 요소를 포함할 필요는 없다. 이동 에이전트들 이 다양한 형태들을 가정할 수 있기 때문에, 하드웨어 구성들은 에이전트의 특정한 기능적 성능들에 따라 달라질 수 있다. 적어도 일 실시예에서, 이동 에이전트들은 잘업 환경에 관한 그것들의 위치 및 배향에 관한 데이터를 인식 및 유지한다. 적어도 일 실시예에서, 에이전트들이 작동하는 작업면은 에이전트 위치확인을 지원하도 록 개선될 수 있는 평면을 제공한다. 작동면이 평평할 필요는 없다; 오히려, 적어도 일 실시예에서 그것은 곡률 들, 불연속성들, 및/또는 다른 불규칙성들을 가질 수 있다. 위치확인 적어도 일 실시예에서, 이동 에이전트들은 서로 협력, 경쟁, 및 다르게 상호작용하기 위해 뿐만 아니라, 모션 또는 이동성을 수반하는 작업들의 최적의 수행을 가능하게 하고 지원하기 위해, 공간에서 그것들의 현재 위치 및 배향에 대한 작업 지식을 가진다. 경로 계획, 객체 조작 및 다수의 에이전트들 간 활동의 조정과 같은 상위 레벨의 프로세스들은 개별적인 에이전트들 또는 위치 및 배향에 대한 지속적인 모니터링을 제공 함으로써 구현된다. 에이전트들은 에이전트들 간 상호작용의 다양한 유형들을 가능하게 하기 위해, 다른 에이전트들의 위치들을 인식할 수 있다. 적어도 일 실시예에서, 시스템은 환경 네 에이전트들의 위치들의 가상 모델을 유지한다. 그러한 가상 모델 은 중앙 집중식으로, 및/또는 분산 방식으로 저장될 수 있고, 그것들이 다른 에이전트들에 대한 그리고 작 업면, 구성요소들, 및/또는 다른 환경적 요소들에 대한 그것들의 상대적인 위치들을 인식할 수 있도 록 개별적인 에이전트들에 이용가능하게 만들어질 수 있다. 적어도 일 실시예에서, 시스템 및 방법은 물리 적 환경 내 에이전트들의 실제 물리적 위치들 및 가상 환경에서 그러한 에이전트들의 가상 표현들의 대응하는 위치들 간 패리티를 유지한다. 2013년 8월 9일에 출원된, \"하나 이상의 컴퓨팅 디바이스를 갖는 로봇 시스템의 통합\"(대리인 문서 번호 ANK002)에 대한 관련 미국 실용 출원 제13/963,638호에 설명된 바와 같이, 패 리티를 유지하는 것은 물리적 및 가상 위치들을 검출하는 것, 및 그에 따라 하나와 다른 하나를 조절하는 것을 포함할 수 있다. 우선순위는 물리적 환경에 주어질 수 있고, 이 경우 가상 위치들이 물리적 위치들의 검출에 기 초하여 조절될 수 있다. 대안적으로, 우선순위가 가상 환경에 주어질 수 있고, 이 경우 에이전트들은 가상 환경에서의 대응하는 요소들의 위치들과 일치시키기 위해 그것들 자체 및/또는 구성요소들을 이동시키도록 지시된다. 가상 및 물리적 환경들 간 패러티를 유지하는 것은 몇몇 이유로 인해 유익할 수 있다. 적어도 일 실시예에서, 에이전트들은 환경의 가상 표현에 기초하여 액션들을 계획하고 이벤트들에 응답한다; 따라서, 물리적 환경 및 그것의 가상 모델 간 차이는 액션들의 성공적인 실행을 복잡하게 만들 수 있다. 따라서, 패리티를 유지하는것은 에이전트들이 불일치를 검출하고 그것들을 교정하는 것을 도움으로써, 그것들의 계획된 액션들을 보 다 정확하게 수행하는 것을 도울 수 있다. 또한, 의도되지 않은 이벤트들 또는 활동의 계획된 코스를 벗어난 이벤트들은 작업에 개입된 하나 이상의 에이 전트를 방해할 수 있다. 예를 들어, 블럭들의 구조가 인간 방관자에 의한 의도적인 파괴 행위에 의해서든 지 또는 몇몇 다른 이유로든지, 붕괴되는 경우, 시스템은 적어도 일 실시예에서, 물리적 환경이 실질적으로 그 것의 가상 모델에서 벗어났다는 것을 에이전트들이 인식할 수 있는 메커니즘을 제공한다. 에이전트들(10 4)은 또한 그러한 불일치가 부분적으로 또는 완전히 무관할 수 있는 가상 모델의 상태에 맞춰 계획되었던 액션 들의 현재 세트를 계속하는 것을 불가능하게 할 수 있다는 것을 인식할 수 있다. 따라서, 적어도 일 실시예에서, 시스템은 검출의 이용가능한 수단을 통해 결정되는 바와 같은 에이전트들 및 구성요소들의 장소, 위치 및/또는 배향과 같은 정보를 획득하고, 그러한 정보를 가상 모델에서의 대응 하는 공간과 비교하며, 그에 따라 물리절 및/또는 가상 환경들을 조절함으로써 가상 및 물리적 환경들 간 패리 티를 유지한다. 적어도 일 실시예에서, 임의의 차이의 크기 및 그것이 존재하는 지속기간 양자에 대해, 그것의 물리적 환경 및 가상 표현 간에 나타날 수 있는 임의의 차이들을 최소화하는 것이 가장 바람직하다. 그러나, 특 히 성격의 요소들이 본 출원에 설명된 바와 같은 에이전트들의 동작에 영향을 주는 다른 실시예들에서, 패 리티가 물리적 및 가상 사이에서 상실되는 시간 및 에이전트가 이에 응답하여 액션들을 조절하는 시간 사 이의 지연들은 에이전트에 의해 보여지는 인식의 전반적인 인상에 또는 에이전트에 의해 보여지도록 의도되는 성격적 특성들에 대해 강화를 제공할 수 있다. 예를 들어, 에이전트가 그것들의 액션들이 낮은 인식의 종래의 관념들과 유사한 경향을 갖게 하도록 의도되는 성격 프로필을 가지는 경우, 보다 긴 지체 시간이 물리적 및 가상 환경 간에 실질적인 차이를 생성하는 이벤트가 발생하는 시간 및 에이전트의 그러한 이벤트에 대 한 응답 사이에 도입될 수 있다. 이것과 관련하여, 물리적 및 가상 간 패리티를 유지하도록 시도하는 프로세스 들이 차이를 검출할 수 있지만, 에이전트에 성격의 요소들을 제공하는 것과 관련된 알고리즘들은 차이에 대한 그것의 식별 및 그것에 대한 그것의 응답에서 에이전트를 인위적으로 지연시킬 수 있다. 본 출원에서 논의 된 바와 같이, 그러한 지체 시간은 또한 인간 관찰자들에게 엔터테인먼트의 소스를 제공할 수 있다. 물리적 구조의 붕괴에 대한 앞서 언급한 예와 같은, 물리적 환경 및 가상 표현 간 불일치를 야기하는 계획되지 않은 이벤트들은 또한 에이전트의 성격 프로필의 부분일 수 있는 감정 응답과 연관된 하나 이상의 액션들 에 대한 트리거들의 역할을 할 수 있다. 예를 들어, 빌딩 프로세스에 대한 방해로서, 다 부서져 가는 구조는 구 축 사업에의 인간 참여자에 대해 사기를 저하시키고 좌절시키는 이벤트일 가능성이 있을 수 있다. 따라서, 본 시스템의 상황하에서, 에이전트는 예를 들어, 고속으로 원형들로 가는 에이전트 또는 의인화된 속성 들(예를 들어, 곁눈질, 아래로 내려간 이마들 및 눈 색상을 적색으로 전환하는 것, 가청의 소음들 또는 분노를 표현하는 음성, 및/또는 기타를 제시하도록 이미지들을 애미네이트하는 눈들 및 눈썹들을 표현하도록 의도되는 이미지들을 보통 도시하는 LCD 디스플레이)을 전달하는 디스플레이의 외관의 변화와 같은 좌절의 표시들을 투영 할 수 있다. 일반적으로, 시스템은 이벤트들에 대한 감정 응답들을 전달하기 위해 신체적 언어의 광범위한 사회 적 방언을 이용할 수 있는는 물리적 또는 디지털 애니메이션의 큐들을 사용할 수 있다. 불일치가 검출되면, 적어도 몇몇 실시예에서, 물리적 환경 및 그것의 가상 표현 간 패리티를 유지하기 위해, 시 스템은 불일치의 정도 및 성질을 점검하기 위해 에이전트들을 모을 수 있다. 임의의 구성요소들(블럭 들과 같은)을 가지는 구조의 붕괴의 경우, 물리적 및 가상 간 패리티를 복원하는 프로세스들이 일정 시간이 걸 릴 수 있고 그것들의 새로운 위치 들 및 장소들에 관한 데이터를 제공하기 위해 흩어진 구성요소들 주위를 네비게이트하는 다수의 에이전트를 수반할 수 있다는 것을 이해할 수 있다. 그러한 경우들에서, 특히 에이 전트의 액션들을 가이드하는 프로세스들이 구조를 재건하려는 시도에 영향을 줄 수 있는 경우, 시스템은 경관의 그러한 점검이 응답을 만들어 내기 전에 완료되게 할 수 있다. 일부 경우들에서, 일부 구성요소들 이 에이전트들이 이용가능한 관찰의 위치들 및 모든 수단으로부터 다른 것들에 의해 눈에 띄지 않기 때문 에 또는 구성요소들이 더 이상 형식적 환경에 있지 않기 때문에(예를 들어, 에이전트들은 테이블 상 에서 작동하고 있고 하나 이상의 구성요소는 바닥 아래로 떨어졌다), 구조의 제어되지 않은 붕괴와 같은 불일치에 따른 환경의 점검은 모든 구성요소의 불완전한 매핑을 낼 수 있다. 특히 불일치 이전의 물리전 공간에서의 구성요소들의 구성을 복원하는 것에 대해, 구조에 이전에 존재한 모든 구성요소의 소재 확인 불능의 예에서와 같이, 그러한 상황에 도입되는 불확실성은 에이전트들에 대해 만들어진 액션들을 요인으 로 포함할수 있다. 일부 실시예들은 또한 재건을 위한 영역을 정리하기 위해 및/또는 붕괴에 수반되었던 구성요 소들, 및 이들 중에서, 더 이상 소재가 확인되지 않는 구성요소들(예를 들어, 그것들이 에이전트들에 액세스가능한 영역들 밖으로 추락된 경우)을 평가하기 위해 구성요소들을 정렬하는 것 및 구조화하는 것을포함하는 점검 프로세스에 관여하는 에이전트들을 포함할 수 있다. 이를 완료하기 위해, 그 후 에이전트들 은 구성요소들을 사용하여 재건하고 필요에 따라 다른 곳에서 이용가능한 다른 것들을 이용하여 없어 진 것들에 대해 추가하든지, 사용자에게 추가 지시가 요구된다는 것을 통지하든지, 또는 이에 응답하여 일부 다 른 액션을 수행하든지, 액션의 방침을 결정할 수 있다. 위치확인은 임의의 적합한 수단을 사용하여 수행될 수 있다. 적어도 일 실시예에서, 이를테면 신호들을 발산하 고 신호 반사의 수신에 기초하여 위치를 결정함으로써, 능동적 방법이 사용된다. 이것들은 초음파-기반 또는 광 -기반 측정 기술들을 포함한다. 이러한 유형의 접근법은 발산된 신호에 따라 응답하도록 트리거될 수 있는 비콘 들 또는 반사체들과 같은 작업 환경의 범위에 계획적으로 배치되는 요소들에 의해 강화될 수 있다. 카메라 또는 물리적(공간적) 환경에 관한 데이터를 수집하는 다른 광학-기반 수단으로부터 이미지들을 획득하는 것에 기초하 는 방법들을 포함하는, 보다 수동적인 방법들이 또한 존재한다. 수동적 프로세스들은 또한 그러한 마커들을 인 식하기 위해 개발된 시스템들에 의해 보다 용이한 위치확인을 위한 환경을 구조화하도록 의도되는 마커들 또는 다른 요소들을 사용할 수 있다. 자기장 검출에 의존하는 시스템들과 같은 비-광학 수동 시스템들에 대해서, 에 이전트 동작을 위해 이용가능한 공간의 범위 내 마커들의 일부 분산이 위치확인을 위해 사용될 수 있다. 적어도 일 실시예에서, 이동 에이전트들이 작동하는 작업면(또는 매트)은 표면 상에 존재하는 판독가능한 코드(예를 들어 광학, RFID, 및/또는 자기 코드들)에 의해 위치확인 정보를 제공할 수 있다. 적어도 일 실시예에서, 2010년 5월 27일에 출원되고 미국 특허 제8,353,737호로서 2013년 1월 15일에 발행된, \"자율적 으로 제어되는 완구용 차량들의 분산 시스템\"(대리인 문서 번호 ANK001)에 대해 관련된 미국 실용 출원 제 12/788,605호에 설명된 바와 같이, 에이전트는 에이전트의 환경 및 해당 환경 내 그것의 위치에 관해 결정하기 위해 표면 상의 마크들을 광학적으로 검출 및 디코딩할 수 있다. 그러나, 다른 실시예들에서, 작 업면은 생략될 수 있고/있거나 위치확인 정보를 제공하지 않을 수 있다; 오히려, 이동 에이전트들은 예를 들어 환경 내 객체들 또는 신호들을 이용하는 삼각측량, 다른 에이전트들 및/또는 기준 피처들의 광 학적 검출, 또는 그것들의 임의의 조합을 포함하는, 그것들 자체의 위치를 알아내기 위한 다른 메커니즘들을 사 용할 수 있다. 임의의 다수의 접근법은 코드들의 판독 및/또는 지역 관측에 기초하여 배향 또는 배향의 결정을 가능하게 하는 기준 지점들 또는 정보를 이용하여 환경을 구조화하는데 사용될 수 있다. 예를 들어, 적어도 일 실시예에서, 이 동 에이전트들은 에이전트 상의 카메라가 광학 코드를 포함하는 작업면의 일부분의 이미지들을 수집하는 관측의 광학 시스템을 채용한다. 광학 코드는 임의의 적합한 패턴 또는 유사한 구조의 마크를 포함할 수 있다. 비-광학 코드들(RFID 및/또는 마그네틱 코드들)을 수반하는 다른 시스템들이 또한 사용될 수 있다. 예를 들어, 상기-참조된 관련 미국 특허 제8,353,737호에 설명된 바와 같이, 작업면은 선호되는 이동 경로 또는 경로들과 동일 선상에 있는 광학적으로 판독가능한 인코딩 기법을 포함할 수 있다. 이러한 방식에서, 코드 들은 이동 에이전트에 대한 트랙 세그먼트를 따르는 위치에 관한 정보를 제공할 수 있다. 따라서 그러한 방법은 많은 특정한 기준 지점 중 하나에 위치측정의 수단을 제공하고 그 자체를 코드 구조에서의 규칙성의 이 점을 취함으로써 그러한 지점들 간 상대적 위치를 추정하는 것에 부여한다. 이제 도 16을 참조하면, 그러한 구 조에 따라 배열되는 코드들(601A, 601B)의 예들이 도시된다. 적어도 일 실시예에서, 도 16의 예들에 도시된 바와 같이, 선호되는 이동 경로 또는 경로들과 동일 선상에 위치 되고 밀접하게 이격되는 반복적인 틱 마크들(tick marks) 또는 유사한 표지들의 라인으로 구성되는, 미터 라인 이 포함된다. 이러한 방식에서 기준으로서 미터 라인을 사용하여, 상대적 위치결정이 코드의 기준 지점에 의해 수립되는 임의의 절대적 위치에 기초하여 산출될 수 있는 정밀도가 주어진 길이에 따른 미터 라인의 구성 틱 마 크들 또는 대시들의 빈도에 의해 정의될 수 있다. 다른 접근법들이 안내 경로로서 제공되는 라인에 직접적으로 미터링하는 것을 통합시킬 수 있다. 예를 들어, 도 6 및 도 14의 육방정계 격자와 같은 격자를 형성하는 코드들 에서, 틱 마크들 또는 몇몇 다른 표지(들)는 격자의 셀들 간 경계들에 포함될 수 있다. 도 16의 예시적인 코드(601A)에 도시된 바와 같이, 적어도 일 실시예에서, 균일한 폭의 라인을 사용하기 보다, 시스템은 폭이 보다 두꺼운 섹션 및 보다 좁은 섹션 사이를 규칙적인 단계들로 오가는 라인을 사용한다. 경로는 여전히 연속적이지만, 폭의 단계적인 변화들에 대한 규칙적인 간격은 대칭적인 구형파와 유사한 외관을 낸다; 이것은 다른 위치적 정보 마크들 간 이동 거리들을 모니터링하기에 유용할 수 있다. 또 다른 실시예들에서, 예시적인 코드(601B)에 도시된 바와 같이, 이동 경로의 폭은 그것이 톱니 모양 형태와 보다 일치하는 외관으로 확대 및 축소되도록 규칙적인 간격을 두고 선형적으로 변화할 수 있다. 그러한 접근법 은 최대 및 최소 폭들에 관한 임의의 특정한 지점에서 라인의 폭에 따른 경로를 따르는 확대 및 축소 지점들 간상대적 위치의 결정을 용이하게 한다. 적어도 일 실시예에서, 위치확인을 인코딩하는 기법이 채택되고, 여기서 이동 에이전트들은 선호되는 작업 환경 내 이동 경로들(예를 들어, 상기 설명된 바와 같은 및/또는 상기-참조된 관련 특허에서의 트랙 세그먼트를 따르는)을 가질 수 있다. 그러나, 인코딩 기법이 특정한 이동 경로 또는 경로들과 연관되지 않은 위치확인을 지 원하는 것이 바람직할 수 있다. 예를 들어, 기준 정보의 인코딩은 표면에서 떠난 관측의 가능한 배향들로부터의 인식을 지원할 수 있다. 이것은 예를 들어, 성공적인 인식을 가능하게 하기 위한 마크 또는 마크들의 관측에 대 해 선호되는 또한 심지어 필수적인 배향이 존재하는 경우, 관측 데이터가 정확한 배향을 찾도록 조절될 수 있도 록, 관측 동안 수집되는 데이터를 분석함으로써 성취될 수 있다. 그러한 시나리오의 예는 작업면 상의 인코딩된 정보를 포함하는 패턴 또는 패턴의 일부분에 대해 수집되는 이미지들을 수반할 수 있다. 패턴이 분석을 위해 선 호되는 배향을 가지는 경우, 프로세싱은 선호된 배향을 찾기 위해 표면의 이미지를 조절할 수 있다. 이 예에서, 마크들은 위치의 결정을 가능하게 할 수 있다. 마크의 선호된 배향에서 떠난 관측 배향을 정정하는 프로세스들 은 또한 작업면에 관한 에이전트의 배향을 제공할 수 있다. 적어도 일 실시예에서, 코드들은 다수의 배향으로부터 판독되도록 설계되는 마크들로서 제시된다. 이제 도 6을 참조하면, 다수의 배향으로부터 판독될 수 있는 그러한 기계-판독가능한 코드들의 예들이 도시된다. 코드 들은 예를 들어, 위에서 설명된 배열들 및 방법론들 중 임의의 것과 관련하여 사용될 수 있고, 예를 들어, 일 실시예에 따라, 표면 상에서 작동하는 에이전트의 위치확인을 지원하기 위해 작업면에 걸쳐 사용될 수 있다. 도 6에 도시된 바와 같이, 적어도 일 실시예에서, 데이터는 가변적 라인 두께들의 동심의 육각형들 및 원형들로"}
{"patent_id": "10-2015-7033682", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "인코딩되어, 실질적으로 일련의 방사 바코드들을 구성한다. 그러나, 해당 기술분야의 통상의 기술자는 기계-판 독가능한 코드들의 임의의 다른 유형들이 사용될 수 있고, 그러한 코드들이 임의의 적합한 형태 및 외관을 취할 수 있다는 것을 인식할 것이다; 그것들은 인간의 눈에 가시적일 수 있거나 가시적이지 않을 수 있 다. 적어도 일 실시예에서, 인코딩된 데이터는 지역적 위치 정보(예를 들어, 기준 기점에 대한 순차적 거리들) 를 포함할 수 있다. 그러나, 코드들이 다수의 방향으로부터 판독하는 것을 지원하도록 의도되기 때문에, 코드들에 대한 관측자의 배향을 추정하는 것이 보다 어려워질 수 있다. 이에 대한 교정으로서, 추가 마킹 이 배향을 표시함으로써 코드들을 강화할 수 있다. 이러한 강화를 제공하는 편리한 접근법의 예는 기준 배 향 또는 선호되는 기준 방향을 표시하는 화살표 또는 점선을 이용하여 배향을 표시하기 위해 동심으로 구조화된 마크의 중심을 예비하는 것이다. 그러나, 그것은 기준 배향을 수립하는 임의의 형태를 가정할 수 있기 때문에, 표지는 자기 나침판의 레이아웃의 익숙한 관례를 사용할 수 있거나 사용하지 않을 수 있다. 이제 도 15를 참조 하면, 다양한 유형들의 배향 표지들을 포함하는 기계-판독가능한 코드들의 예들이 도시된다."}
{"patent_id": "10-2015-7033682", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "그러나, 해당 기술분야의 통상의 기술자는 배향 표지들이 임의의 원하는 외관 또는 형태를 취할 수 있다는 것을 인식할 것이다. 다른 실시예에서, 정보는 신속 대응(QR) 코드들 또는 기타와 같은, 선호된 배향을 가지는 기계-판독가능한 코드 들로 인코딩될 수 있다. QR 코드들(또는 기타)에 기초하는 마킹 기법을 사용하는 것에 대한 이점은 기하학적 구 조가 격자 패턴으로 배열하도록 배치된다는 것 및 기법이 작은 공간에 상대적으로 다량의 정보를 인코딩하기에 적합하다는 것이다. QR 코드들은 척도뿐만 아니라 선호된 배향을 표시하는 기준 마크들을 포함한다. 적어도 일 실시예에서, 시스템은 QR 코드들(또는 기타)의 형태로 마크들의 격자를 포함하는 작업면을 제공한다. 도 6 과 관련하여 이전에 설명된 방사 또는 육방정계 코드들을 갖는 것과 같이, QR 코드들은 고유한 식별 코드 들, 재료 ID들, 및/또는 기타와 같은 다양한 정보를 포함할 수 있다. 표면 상에 인접하는 코드들은 상이한 정보 를 제공할 수 있다. 이제 도 20을 참조하면, 각 동심 코드 기법을 사용하여, 다양한 실시예들에 따라, 코드 유형들의 추가적인 예들 이 도시된다. 코드들(601C, 601D, 601E, 601F, 601G)의 각 예에서, 데이터는 각 셀의 중심으로부터 방사 상으로 순서화되는 라인 가중치 순으로 인코딩된다. 적어도 일 실시예에서, 각 셀의 중심의 빈 공간 은 예를 들어 구체적인 공간적 기준, 기본 방향에 대한 기준, 및/또는 영역 지정(이를테면 하나의 빌딩 영역 대 다른 빌딩 영역을 표시하기 위한)을 표시하기 위해, 마커 또는 다른 식별자로 채워질 수 있다. 이들 예 들의 일부에서, 각 셀의 경계를 이루는 미터 라인은 셀들에 걸쳐 전환하는 위치확인을 위한 기준을 제공한다. 대안적으로, 코드(601E)에 도시된 바와 같이, 셀들은 경계들을 수립하기 위해 서로 떨어져 이 격될 수 있다. 적어도 일 실시예에서, 라인 가중치들은 구체적인 코드 요소(셀과 같은)의 값을 표시할 수 있고, 따라서 셀의 중심 주위에 방사상으로 배열되는 폐곡선들의 시퀀스가 인코딩된 정보를 내기 위해 각 방사상의 라인 가중 치들에 따라 판독될 수 있다. 적어도 일 실시예에서, 셀들은 상대적 위치에 대한 정보를 추정하는 능력을 제공하기 위해, 일정한 크기를 갖고 규칙적인 형태로 배열되고, 인코딩된 정보가 공간적 위치를 포함하고/하거 나 셀이 그래픽 요소로서 또는 판독가능한 데이터로서 셀 내에 마킹된 어느 하나의 기준 지점을 포 함하는 경우들에서, 전역적 위치가 알려진 공간적 위치의 지점에서 떨어진 상대적인 위치로부터 결정될 수 있다. 일부 상황들에서, 특정한 표면 상에 인코딩된 데이터의 상이한 유형들을 제공하는 것이 유용할 수 있다. 예를 들어, 다수의 작업면이 동시에 사용될 수 있는 실시예들에서, 각 표면은 특정한 표면을 고 유하게 식별하는 개재된 코드들을 포함할 수 있다. 대안적으로, 본 출원에 설명된 코드들 중 임의의 코드는 또한 사용 시 특정한 표면을 식별하는 정보를 포함할 수 있다. 그러한 기술은 그렇지 않으면 서로 혼동될 수 있는 다수의 표면을 사용함으로써 도입되는 잠재적인 불확실성들을 회피하도록 도울 수 있다. 이제 도 19를 참조하여, 코드 유형들의 혼합된 사용을 가지는 작업면의 예가 도시된다. 육각형 코드들 (601A)은 다수의 방향으로부터의 판독을 용이하게 한다; 밀접하게 이격된 코드 라인들은 빌딩을 위해 지정되는 표면의 영역들에서의 위치확인을 정확하게 한다. 따라서 그러한 코드들(601A)은 블럭들과 같은 구성요소들 의 일반적인 배치에 적합하다. 코드(601B)는 수송을 위해 지정되는 표면의 영역에 위치되고, 따라서 구성요소 조장 및 배치를 위해 전형적으로 사용되는 보다 느린 모션보다 빠른 속도로 직선 이동쪽으로 배치된다. 따라서, 코드(601B) 내 마킹 들은 더 길고 더 떨어져 이격된다. 적어도 일 실시예에서, 도 19의 예에 도시된 바와 같이, 코드(601B)는 하나 의 코드 구역으로부터 다른 코드 구역으로의 수송을 인식하는 것을 돕기 위해, 각 측의 경계를 이루는 화이트 사각-이(tooth) 미터 바들을 포함한다. 일부 경우들에서, 약간의 불확실성이 다른 코드 베이스에 새로운 기준 위치를 수립하기 위해 하나의 코드 베이스에 알려진 위치를 떠나는 에이전트 간 시간에 존재할 수 있다. 위치확인에 대해, 데이터의 일부분이 작업면에 대한 기준 기점(매트 또는 다른 작업면의 경우에서, 특정한 코너와 같은)에 대한 코드 내 코드의 기하학적 중심 또는 일부 다른 지점으로부터 순차적 거리들에 있을 수 있 다. 추가적인 정보는 그 자체 코드의 치수들을 포함할 수 있다; 대안적으로, 코드 치수들은 지정되고 에이전트 또는 그것의 관리 제어 시스템에 의해 미리 알려질 수 있다; 예를 들어, 에이전트는 코드의 기준 지 점의 순차적 거리들과 결합될 때 코드의 윤곽 내 임의의 지점에 대한 위치확인을 가능하게 하는 룩-업 정보를 참조할 수 있다. QR 코드들이 선호된 배향을 가지는 한편, 적어도 일 실시예에서, 코드들은 임의의 배향에서 판 독될 수 있고, 코드들 내 기준 지점들은 에이전트가 선호되는 배향을 결정하는 것을 가능하게 할 수 있다; 이로부터, 코드(그리고 그에 의한 작업면)에 대한 관측의 상대적인 배향이 결정될 수 있다. 방사상으로 설계된 인코딩 기법 또는 QR 코드들과 같은 선호된 배향을 갖는 인코딩 방법 중 어느 하나를 사용하 는 경우에서, 코드 마크들 간 크기의 균일함을 유지하는 것이 반드시 필요한 것은 아니다. 적어도 일 실시예에 서, 작업면의 몇몇 부분은 이동 에이전트들의 정밀한 이동들이 다른 영역들에서 보다 중요할 수 있는 영역 들을 가질 수 있다. 예는 구조들의 수송 루트로서 전용되도록 의도되고 따라서 깨끗하게 유지되는 작업면 의 부분들을 포함할 수 있고, 위치 확인에 대한 매우 엄격한 정밀도는 덜 필요할 수 있으나, 대신 그러한 영역 들을 통해 빠른 네비게이션을 지지할 수 있다. 이 경우에서, 빠른 속도로 이동하는 동안 참조하기에 보다 양호 할 수 있는 보다 큰 코드들은 이들 영역들에 대한 보다 양호한 선택일 수 있는 한편 이동 에이전트들에 의 해 건립되는 구조들을 지지하도록 의도되는 작업면의 구역들에서는 에이전트들이 보다 작은 허용오차들로 그것들의 위치결정 및 구성요소 배치를 보다 양호하게 제어하게 하기 위해 보다 작은 크기의 코드들로부터 이익을 얻을 수 있다. 적어도 일 실시예에서, 전체 코드가 데이터를 디코딩하기 위해 캡처될 필요는 없다. 이것은 특히 방사상 코딩 기술이 사용될 때 적용가능할 수 있다. 그러한 기법의 이점들 중 하나는 중심점으로부터 데이터의 전방향 제시 가 단일 방사상 벡터의 가시성으로부터 완전한 인코딩 데이터를 판독하는 것을 가능하게 한다는 것이다. 따라서, 방사상 코딩은 해석을 위해 코드 이미지의 전체 캡처를 필요로 하는 인코딩 기법과 대조적으로, 코드의 단지 일부분이 가시적이거나 캡처될 때 인코딩된 데이터를 완전히 판독하는 것의 보다 큰 가능성을 제공할 수 있다. 따라서 논의된 위치확인 방법들은 마크들의 패턴을 구성하는 코드 내에 위치적 데이터를 인코딩하기 위한 기술 들을 더 제공한다. 그러나, 다른 실시예들에서, 다른 방법들은 이동 에이전트가 작업면 상의 하나 이 상의 코드의 해석으로부터 위치 및 배향을 추정하는데 사용된다. 지역적 코드들에 저장된 데이터를 디코딩하는것에 의존하지 않는 일 실시예에서, 작업면 상의 마크들의 전체 패턴의 레이아웃이 미리 알려질 수 있고, 따라서 위치의 결정은 보다 큰 패턴 내 대응하는 위치(들)에 대해 지역적 관측 시 캡처되는 코드들과 매칭하는 것에 기초한다. 이 시나리오에서, 접근법은 보다 큰 공간적 피처 세트 내 지역적 피처들의 서브세트를 식별하는 것에 기초하여 맵 상의 위치를 찾는 것과 유사하다. 예를 들어, 에이전트 동작을 위해 의도되는 작업면 또는 표면의 그러한 부분들을 커버하는 마크들의 패턴은 패턴의 지역적 관측이 다수의 잠재적인 위치를 내지 않도록 반복적이지 않은 패턴에서의 픽셀들로 구성 될 수 있다. 이런 실시예에서, 가장 적은 수의 픽셀이 전체 패턴을 구성하는 보다 큰 세트 내 지역적 피처들의 매칭을 가능하게 하기 위해 관측 내에서 캡처된다. 지역적 피처들과 매칭 시, 관측된 배향은 위치확인 프로세스 의 부분으로서 저장된 바와 같은 전역적 기준 패턴의 배향과 매칭하기 위해 일정 방식의 재-배향을 필요로 하는 지역적 패턴을 내는 것이 가능하다. 변환이 패턴을 재배향하기 위해 적용될 수 있다; 그러한 변환은 또한 작업 면에 대한 관측의 배향에 관한 정보를 낸다. 시스템 아키텍처 적어도 일 실시예에서, 시스템은 임의의 적합한 수단을 사용하여 서로 통신할 수 있는 다양한 구성요소들을 사 용하여 구현된다. 적어도 일 실시예에서, 2013년 8월 9일에 출원된 \"하나 이상의 컴퓨팅 디바이스를 갖는 로봇 시스템의 통합\"(대리인 문서 번호 ANK002)에 대한 관련 미국 실용 출원 제13/963,638호에 설명된 바와 같이, 제 어가 에이전트들 및 무선으로 연결된 중앙 디바이스 사이에 분할되거나 이동 에이전트 사이에서 더 나뉘는 이동 에이전트들의 세트, 작동 환경의 물리적 상태 및 가상 상태 간 패티티를 능동적으로 유지하는 중앙 디바이스, 및 사용자에게 이동 에이전트의 모션 및 액션들의 직접 제어를 제공하도록 전용되는 디바 이스를 사용하여 구현될 수 있다. 이제 도 13을 참조하면, 일 실시예에 따른 구현 아키텍처가 도시된다. 도 13에 도시된 바와 같이, 적어도 일 실 시예에서, 시스템은 호스트 디바이스에 의해 호스팅되며, 이는 이동성이든 정지 상태든, 예를 들어 스마트폰, 태블릿, 랩탑 컴퓨터, 또는 기타, 및/또는 그것들의 임의의 조합과 같은 임의의 적합한 컴퓨팅 디바 이스 상에 구현될 수 있다. 적어도 일 실시예에서, 호스트 디바이스는 전체 시스템의 동작들을 구현하는 소프트웨어에 포함되는 다양한 알고리즘들을 지원 및 실행한다. 호스트 디바이스 및 관련 소프트웨어는 본 출원에서 기지국 또는 중앙 제어 유닛으로서 총괄적으로 지칭된다. 도 13은 호스트 디바이스를 통과하는 모든 통신을 도시하지만, 대안적인 실시예들에서, 에이전트들은 서로 직접 통신할 수 있고, 호스트 디바이 스는 완전히 생략될 수도 있다. 다양한 상이한 디바이스들 중 임의의 디바이스는 호스트 디바이스로서 역할을 할 수 있다; 예들은 스마트 폰들, 태블릿 컴퓨터들, 랩탑 컴퓨터들, 데스크탑 컴퓨터들, 비디오 게임 콘솔들, 및/또는 시스템에 대한 제어 소프트웨어를 지원할 수 있는 임의의 다른 컴퓨팅 디바이스를 포함한다. 적어도 일 실시예에서, 그러한 디바이 스는 예를 들어 그리고 제한 없이: 캘리포니아, 쿠퍼티노의 애플사로부터 이용가능한, iOS 또는 MacOS, 캘리포 니아, 마운틴 뷰의 구글사로부터 이용가능한, 안드로이드; 또는 워싱턴, 레드몬드의 마이크로소프트사로부터 이 용가능한, 윈도우즈를 포함하는, 임의의 적합한 운영 시스템을 사용할 수 있다. 적어도 일 실시예에서, 호스트 디바이스는 캘리포니아, 적합한 소프트웨어 애플리케이션(\"앱\")을 실행하는, 쿠퍼티노의 애플사로부터 이 용가능한 캘리포니아, 쿠퍼티노의 애플사로부터 이용가능한, 아이폰 또는 아이패드이다. 적어도 일 실시예에서, 호스트 디바이스를 제어하기 위한 소프트웨어는 게임플레이, 구축, 협동, 충돌, 및/또는 기타를 포함하는 에이전트들 간 상호작용들을 계획, 조정 및 수행하기 위한 그리고 물리적 공간에서 에이전트들을 작 동하기 위한 게임플레이 구조 및 적절한 기능을 포함하는 다운로드가능한 애플리케이션(\"앱)\"과 같은, 임의의 적합한 수단을 통해 제공될 수 있다; 이들 상호작용들은 규칙들에 따라, 그리고 사용자 입력, 인공 지능, 또는 그것들의 조합의 지시하에서 발생할 수 있다. 적어도 일 실시예에서, 호스트 디바이스는 에이전트들 의 상태를 유지하고, 에이전트들에 그리고 그것들로부터 명령들을 송수신한다. 호스트 디바이스는 또 한 시스템과의 사용자 상호작용을 용이하게 하기 위한 적합한 사용자 인터페이스를 포함할 수 있다. 본 출원에 제공된 설명의 목적들을 위해, 에이전트들은 이동 에이전트들로서 지칭되나, 그러한 에이 전트들의 일부 또는 전부가 정적일 수 있다. 위에서 설명된 바와 같이, 에이전트들은 수동, 반-능동, 및 능동을 포함하는, 다른 구성요소들 및 요소들을 포함하는 아키텍처 프레임워크 내 구성요소의 유형일 수 있다. 적어도 일 실시예에서, 에이전트들은 완구용 구축 차량들과 같은 차량들이나, 그것들은 다른 객 체들 또는 구성요소들일 수 있다. 적어도 일 실시예에서, 호스트 디바이스는 명령들이 호스트 디바이스 상에서 실행하는 알고리즘들로 부터 비롯되든 호스트 디바이스를 통해 라우팅되나 물리적으로 존재하거나 원격에 위치되는 사용자들(109D 내지 109K)에 의해 제어되는 제어 디바이스들(101D 내지 101K)로부터 비롯되든, 에이전트들에 송신되는 제 어 명령들 및 모든 활동을 위한 중앙 노드이다. 다른 실시예들에서, 호스트 디바이스가 모든 활동 및 제어 명령들을 위한 중앙 노드일 필요는 없는 보다 분산된 아키텍처가 구현될 수 있다. 도 13에 도시된 예는 특정한 수의 제어기들(101D 내지 101K), 에이전트들, 및 AI-제어 에이전트들(104J)을"}
{"patent_id": "10-2015-7033682", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 11, "content": "포함한다. 해당 기술분야의 통상의 기술자는 도 13에 도시되고 본 출원에 설명되는 요소들의 특정한 수들은 단 지 예시적이고, 시스템이 임의의 다른 수들을 사용하여, 그리고/또는 적절하다면 생략되는 요소들 중 일부를 가 지고 구현될 수 있다는 것을 인식할 것이다. 또한, 에이전트들은 차량들로서 도 13에 도시되지만, 그것들 은 임의의 적합한 형상을 가정할 수 있다. 도 13의 아키텍처에서, 시스템은 중앙 집중된 방식으로 구현되고, 여기서 제어기들(101D 내지 101K) 및 에이전트들은 다른 요소들과 함께, 호스트 디바이스와 통신한다. 도시된 바와 같이, 적어도 일 실시 예에서, 다수의 사용자(또는 플레이어들)은 다수의 에이전트를 제어할 수 있는 한편, 다른 에이전트 들(104J)은 인공 지능에 의해 제어될 수 있다. 도 13에 도시된 바와 같이, 임의의 수의 외부 디바이스는 예를 들어 셀룰러/인터넷 연결과 같은, 임의의 적합한 통신 프로토콜을 통해 호스트 디바이스에 연결될 수 있다. 다양한 외부 디바이스들은 호스트 디바 이스와 동일할 수 있거나 동일하지 않을 수 있다. 외부 디바이스들 중 일부 또는 전부는 제어기들로서 역 할한다. 도 13은 임의의 수의 제어기들(101J, 101K)(각각, 사용자들(109J, 109K)에 의해 제어되는)을 갖는 게임 콘솔(101B): 랩탑 컴퓨터(101D)(사용자(109D)에 의해 제어되는); 독립형 제어기(101E)(사용자(109E)에 의해 제 어되는); 및 스마트폰들(101F, 101G, 및 101H)(각각, 사용자들(109F, 109G, 및 109H)에 의해 제어되는)을 포함 하여, 제어기들로서 사용될 수 있는 디바이스들의 다양한 예들을 도시한다. 적어도 일 실시예에서, 제어기들 중 임의의 제어기 또는 전부는 적합한 소프트웨어 애플리케이션(\"앱\")을 실행하는, 캘리포니아, 쿠퍼티노 의 애플사로부터 이용가능한, 아이폰 또는 아이패드일 수 있다. 제어기들(101J, 101K, 101E)은 예를 들어 콘솔 게임 디바이스들을 이용하여 공통적으로 사용되는 제어기들을 포함하는, 임의의 적합한 유형일 수 있다. 적어도 일 실시예에서, 게임 또는 플레이 환경은 호스트 디바이스 상에서 호스팅된다. 호스트 디바이스 는 소프트웨어의 지시하 가상 환경에서 뿐만 아니라 물리적 환경(표면 상과 같은)의 물리적 공간에서 에이전트들, 구성요소들, 및/또는 다른 요소들의 게임플레이 및/또는 다른 조작을 지원한다; 가상 환 경의 상태는 호스트 디바이스 상의 및/또는 다른 곳의 메모리에 유지된다. 2013년 8월 9일에 출원된, \"하나 이상의 컴퓨팅 디바이스를 갖는 로봇 시스템의 통합\"(대리인 문서 번호 ANK002)에 대한 관련 미국 실용 출원 제13/963,638호에 설명된 바와 같이, 적어도 일 실시예에서, 호스트 디바 이스 상에서 실행되는, 기지국 소프트웨어는 에이전트들 및 구성요소들의 위치들을 포함하는, 환경의 가상 모델을 유지하고, 물리적 공간에서의 에이전트들 및 구성요소들의 검출된 위치들을 이용 하여 그러한 가상 모델을 조화시키기 위한 동작들을 수행할 수 있다. 이런 방법에서, 호스트 디바이스는 계속해서 에이전트들 및/또는 구성요소들의 위치, 방향, 속도 및 다른 측면들에 관해 저장된 정보를 업데이트함으로써 물리적 환경에서의 이벤트들을 이용하여 패리티를 유지한다. 적어도 일 실시예에서, 호스트 디바이스는 임의의 지점에서 제 시간에 물리적 환경 및 가상 환경의 상태들이 동일하다는 것(또는 실질적 으로 동일하다는 것), 또는 적어도 가상 환경의 상태가 게임플레이용들로 적어도 충분한 정확도의 물리적 상태 의 표현이라는 것을 보장한다. 적어도 일 실시예에서, 시스템은 상태들 간 양-방향 영향을 가능하게 하고, 따라 서 가상 공간에서 발생하는 이벤트들은 물리적 상태에 영향을 줄 수 있고 그 역도 마찬가지이다. 우선순위는 본 출원에 그리고 관련 특허 출원에 설명된 바와 같이, 가상 또는 물리적 상태 중 어느 하나에 주어질 수 있다. 적어도 일 실시예에서, 인공 지능 소프트웨어는 호스트 디바이스 상에서 실행하고 하나 이상의 에이전트 (104J)를 제어하기 위한 명령들을 발행한다(무선 통신 메커니즘들 또는 다른 메커니즘들을 통해). 다른 실시예 들에서, 에이전트들(104J)을 제어하기 위한 소프트웨어는 다른 곳에 위치될 수 있고/있거나, 에이전트들(104J) 그것들 자체 상에서 실행할 수 있다. 적어도 일 실시예에서, 호스트 디바이스는 동시에 에이전트를 제어하는 인간 사용자(109A)를 위한 제 어 유닛으로 역할을 할 수 있다. 그러한 기능은 호스트 디바이스 상에서 제공될 수 있는 한편 호스트 디바 이스는 또한 다른 차량들을 제어하는 다른 디바이스들(101D 내지 101K)로부터 들어오는 제어 명령들 을 위한 전달자 및 해석자로서 역할을 한다. 다른 실시예에서, 호스트 디바이스는 인간 사용자를 위 한 중앙 유닛으로서 역할하는 것이 아니라, 전용 중앙 제어 유닛으로 작동한다. 플레이어 제어기(101D 내지 101K)는 호스트 디바이스와 직접 통신할 수 있거나 그것들은 중간 디바이스들 을 통해 통신할 수 있다. 예를 들어, 도 1에서, 제어기들(101J 및 101K)은 게임 콘솔(101B)을 통해 호스트 디바 이스와 통신한다. 유사하게, 연결들의 임의의 수의 티어들(tiers)은 호스트 디바이스로 다시 네트워 킹되는 일련의 디바이스들을 통해 호스트 디바이스에 연결하는 하나 이상의 스마트폰과 같은, 호스트 디바 이스 및 플레이어 제어기들(101D 내지 101K) 사이에 구성될 수 있다."}
{"patent_id": "10-2015-7033682", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 12, "content": "해당 기술분야의 통상의 기술자에 의해 사용자들의 수 및 AI-제어 상대들의 수가 증가함에 따라, 호스트 디바이스에 대한 성능 요구들이 마찬가지로 증가한다는 것이 이해될 수 있다. 에이전트들 의 수 및 호스트 디바이스의 성능에 따라, 예를 들어, 컴퓨터 요건들의 증가들이 성능에 영향을 줄 수 있다. 적어도 일 실시예에서, 시스템은 분산 환경에서 구현되고, 여기서, 예를 들어, 호스트 디바이스는 연결되어 상기 로직의 수행을 지원할 수 있는 임의의 수의 디바이스에 그것의 로직의 부분들을 분산하는 성능을 가진다. 이들 의 예들은 스마트폰들, 태블릿 컴퓨터들, 랩탑들, 게임 콘솔들, 및/또는 기타를 포함하나, 또한 그것에 할당되 는 로직을 실행하기 위한 필수적인 지원을 제공할 수 있는 임의의 적합한 디바이스들일 수 있다. 적어도 일 실 시예에서, 예를 들어, 운영 시스템과 연관되는 프로세싱 작업들 중 일부는 하나 이상의 제어기(101D 내지 101H)에 분산될 수 있다. 분산이 지역적으로 남을 필요는 없다; 적어도 일 실시예에서; 로직은 예를 들어, 하나 이상의 원격에 위치된 서 버들(미도시)에 분산될 수 있다. 호스트 디바이스의 구조에 대한 모듈식 디자인은 그 자체를 편리한 로직 의 분산에 제공할 수 있고, 호스트 디바이스로부터 분담되는 로직 프로세스들의 유형이 기능 또는 프로세 스의 하나의 특정한 유형일 필요는 없다. 적어도 일 실시예에서, 예를 들어, 로직의 분산은 컴퓨터의 및 메모리 요구에 따라 우선순위화될 수 있고, 따라서 그것들 대부분의 부담이 큰 호스트 디바이스의 자원들이 먼저 다른 곳에 할당될 것이다. 제어기들(101D 내지 101H)과 및/또는 그것들 간에 통신하도록 채용되는 무선 인터페이스는 사용자의 제어 하에서 에이전트들에 연결하는데 사용되는 것과 동일할 필요는 없다. 예를 들어, 호스트 디바이스는 와이-파이를 통해 제어기들(101D 내지 101H)과 통신하는 한편, 호스트 디바이스는 블루투스를 통해 에이전 트들과 통신하는 것이 가능하다. 그러한 경우, 호스트 디바이스는 고-전력 프로토콜(와이-파이와 같 은) 및 저-전력 프로토콜(블루투스와 같은) 간 브릿지로서 역할을 할 수 있다. 그러한 접근법의 이점은 호스트 디바이스를 통해 사용자들에 의해 제어되거나 호스트 디바이스에 의해 직접 제어되는(AI 제어하 에이전트들(104J)의 경우) 에이전트들이 제한된 전력 수요예측을 가지는 경우들에서 이해될 수 있다. 위에서 설명된 바와 같이, 제어기들(101D 내지 101H)은 임의의 적합한 디바이스들을 사용하여 구현될 수 있다. 또한, 무선 게임패드들 또는 조이스틱들과 같은, 보다 덜 복잡한 제어기들(101J, 101K)이 사용될 수 있다. 호스 트 디바이스와의 직접 통신을 지원하는 무선 통신 모듈을 구비하지 않는 게임패드 또는 조이스틱(101J, 101K)이 사용되는 경우들에서, 호스트 디바이스에의 연결은 게임 콘솔(101B) 또는 다른 중개자를 통해, 또 는 호스트 디바이스 상의 적절한 포트에 연결하는 동글(dongle)(미도시)의 사용을 통해 달성될 수 있다. 그러한 동글은 제어기에 무선으로 연결하고 연결되는 포트를 통해 통신수단들을 통과한다. 동글의 대안적 인 실시예들은 호스트 디바이스와 호환가능한 무선 프로토콜 및 제어기와 호환가능한 무선 프로토콜 간 브릿지를 구현하는 유닛들을 포함할 수 있다. 차량들(104B 내지 104F)에 호스트 디바이스를 통해 사용자의 명령들을 전달하는 것에 더하여, 제어기 들(101D 내지 101H)은 또한 게임들의 현재 상태를 반영하는 호스트 디바이스로부터의 업데이트들을 수신할 수 있다. 적어도 일 실시예에서, 일부 또는 모든 제어기(101D 내지 101H)는 그러한 수신된 상태 정보에 기초하 여 플레이 경험을 강화할 수 있기 위해, 하나 이상의 출력 디바이스(디스플레이, 스피커, 햅틱 출력 메커니즘들, 및/또는 기타와 같은)를 구비할 수 있다. 그러한 강화들은 예를 들어, 그렇지 않으면 사용자 에게 보이지 않는 세부사항들을 제공하거나 현실 감각을 증가시키기 위해 게임 트랙 상의 액션을 표현 및/또는 그러한 액션을 증폭하는 렌더링들, 햅틱 출력(예를 들어, 진동) 및/또는 오디오를 포함할 수 있다. 적어도 일 실시예에서, 일부 또는 모든 제어기(101D 내지 101H)를 통해 사용자들에 제시되는 시각, 촉각, 및/또는 청각 정보는 각 디바이스에 고유할 수 있다. 다양한 에이전트들은 임의의 주어진 시간에 상이한 상태들에 있을 수 있다(예를 들어, 위치, 속도, 상태, 액션, 및 기타에 대하여); 또한, 단일 에이전트를 제어하는 다수의 사용자의 경우에서, 사용자 역할들 또는 제어는 상이할 수 있다. 따라서, 각 사용자(10 9)에게 제시되는 다양한 큐들 및 데이터는 사용자의 특정한 역할 및 에이전트의 현태 상태로 조정될 수 있다.다양한 실시예들에서, 제어기들(101D 내지 101H)의 사용자들은 물리적으로 존재할 수 있고, 따라서 제어기들 (101D 내지 101H)은 호스트 디바이스와 직접 통신한다(블루투스와 같은 무선 프로토콜을 통해). 대안적으 로, 제어기들(101D 내지 101H)의 사용자들은 원격에 위치되고 호스트 네트워크(네트워크와 같은)를 통해 연결될 수 있다. 제어기들(101D 내지 101H)은 게임 상태에 관해 호스트 디바이스로부터 다시 보고되는 정 보에 의존할 수 있다. 상기에서 언급된 바와 같이, 적어도 일 실시예에서, 다수의 사용자는 게임에서 단일 에이전트를 제어 할 수 있다. 예를 들어, 세 명의 사용자는 단일 에이전트를 제어할 수 있으며 여기서 한 명의 사용자 가 방향 및 속도 제어를 제공하고 있고, 다른 사용자가 에이전트 상의 포크리프트 또는 아암들 을 제어할 수 있으며, 제3 사용자가 보조적인 조작 요소를 제어할 수 있다. 그러한 시나리오에서, 제어기 들은 각 사용자에 의해 충족되는 역할에 조정되는 정보를 제공한다. 적어도 일 실시예에서, 시스템은 전체 구축 작업 할당과 같은, 고-레벨 기능들이 이동 에이전트들 외부의 제어 디바이스에 의해 상정되고, 개별적인 구성요소들의 조작과 같은, 저-레벨 명령들이 각 이동 에이전트 가 내장되어 관리되도록 제어 분배를 제공하는 아키텍처를 사용하여 구현된다. 그러한 아키텍처은 예를 들 어, 상기-인용된 관련 출원들에 설명된 기술들을 사용하여 구현될 수 있다. 다른 실시예들에서, 임의의 다른 적 합한 아키텍처가 예를 들어 피어 디바이스들에 보다 계산적으로 집중적인 프로세스들을 분담하는 것에 반드시 의존할 필요는 없는 것들을 포함하여 사용될 수 있다. 적어도 일 실시예에서, 에이전트들이 프로세싱 또는 다른 고- 또는 저-레벨 기능을 위한 피어 디바이스들 에 의존할 필요는 없더라도, 그러한 디바이스는 사용자가 하나 이상의 이동 에이전트들에 명령을 제공하는 것을 가능하게 하기 위해 여전히 제공될 수 있다. 구성요소 인식 적어도 일 실시예에서, 상이한 유형들의 구성요소들은 작업면 상에서 동시에 사용 중일 수 있다; 이 들 구성요소들은 이동 에이전트들 및/또는 다른 구성요소들을 포함할 수 있다. 실제로, 작업면 은 그 자체로 수동 구성요소의 유형으로 간주될 수 있다. 언급된 바와 같이, 구성요소들은 수동, 반-능동 또는 능동으로 분류될 수 있고, 설명된 바와 같이, 구성요소들은 그것들의 물리적 속성들의 크기, 형상, 질량 및/또는 다른 다른들에서 상이할 수 있다. 시스템이 최적으로 기능하기 위해, 적어도 일 실시 예에서 이동 에이전트들을 제어하는 시스템은 구성요소들을 인식하고 각 개별적인 구성요소의 유형을 결정한다. 구성요소들은 또한 특정한 기능에 관하여 그것들을 구별하는 다른 속성들을 가질 수 있다; 그러한 차이점 들은 시각적 검사 상으로 분명할 수 있거나 분명하지 않을 수 있다. 적어도 일 실시예에서, 작업면 상에서 작동 하는 이동 에이전트들은 구성요소들을 성공적으로 그리고 확실하게 이동 및 조작하기 위해, 일부 기 준 지점에 대해 및/또는 작업면 상에서 구성요소들의 위치 및 배향을 결정할 뿐만 아니라 정확하게 및 확실하게 구성요소들(다른 이동 에이전트들을 포함하는)을 식별하는 능력을 가진다. 임의의 수의 방법은 구성요소 위치/배향 인식 및 구성요소 유형 인식을 위해 사용될 수 있다. 적어도 일 실시예에서, 1) 기계-판독가능한 코드들, 2) 순수한 이미지 프로세싱 및 3) 구조형 광 중 적어도 하나를 채용하 는, 광학-기반 접근법이 사용될 수 있다. 이들 방법들은 단독으로 또는 서로 임의의 조합으로 사용될 수 있다. 예를 들어, 구조형 광 접근법이 단독으로 또는 다른 방법들 중 하나 또는 양자에 대한 추가로서, 사용될 수 있 다. 구조형 광 스캐너는 하나 이상의 에이전트에 포함될 수 있다. 구조형 광의 적용에 대한 하나의 예는 현장에서, 격자와 같은, 픽셀들의 알려진 패턴의 투영, 및 표면들에 부딪칠 때 알려진 패턴을 변형시키는 방식 을 관측하는 것을 수반한다. 따라서, 구조형 광은 공간의 기하학적 불연속을 낸다. 구조형 광이 색상 또는 텍스 쳐에 관한 정보를 생략할 수 있기 때문에, 색상에 기초하여 검출가능한 구성요소들의 차이들은 구조형 광 방법들에 의해 용이하게 구별되지 않을 수 있다. 추가적으로, 구조형 광 기법의 해상도에 관해 크지 않은 표면 피처들의 차이들에 기초한 구분들은 또한 검출하기에 어려울 수 있다. 따라서, 적어도 일 실시예에서, 하나 이 상의 추가 인식 방법들을 이용하는 구조형 광을 추가하는 것이 유용할 수 있다. 기계-판독가능한 코드들을 사용하는 실시예에서, 작업면 상의 위치확인을 용이하게 하기 위해 이전에 설명 된 방법들의 특정한 측면들이 구성요소 인식과 유사한 방식으로 그것들 자체를 제공할 수 있다. 특히, QR 코드들과 같은 인코딩된 데이터 및/또는 기하학적 패턴의 사용은 구성요소 유형, 면, 및/또는 배향을 인식 하는 것을 도울 수 있다. 적어도 일 실시예에서, QR 코드와 같은 2D 인코딩 기법의 사용(구성요소의 면에 마킹하기 위한)은 기계-판독가능한 코드의 임의의 관측 시 선호되는 구성요소 배향을 암시할 수 있다. 구성요소 유형과 같은 중요한 구성요소 특성들, 구성요소 치수들 또는 구성요소의 특정한 면(마크가 적용된)을 식별하는데 도움이 될 수 있는 추가적인 정보가 기계-판독가능한 코드 내로 인코딩될 수 있다. 적어도 일 실시예에서, 인코딩 기법은 구성요소의에 대한 이동 에이전트의 인식을 용이하게 하기 위 해 제공된다; 이 기법은 예를 들어, 순서화된 시퀀스와 같은 적절한 구조로 인코딩된 데이터를 구조화할 수 있 다. 그러한 시퀀스의 예는 3 디지트 코드이고 먼저 두 개의 디지트들은 구성요소 유형을 식별하고 마지막 디지 트는 구성요소의 특정한 면을 표시한다(예를 들어, 큐브의 형상의 구성요소는 여섯 개의 가능한 특정한 면: 북, 동, 남, 서, 상 및 하를 가질 수 있다). 그러한 접근법은 이동 에이전트들이 특정한 구성 요소 유형 ID 코드에 대응하는 구성요소 기하학적 구조에 관해 이용가능한 정보를 가지는 것을 가능하게 한다. 그러한 정보는 이동 에이전트 상의 메모리에 저장될 수 있거나 필요 시 다운로드 또는 액세스될 수"}
{"patent_id": "10-2015-7033682", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 13, "content": "있다. 해당 기술분야의 통상의 기술자는 그러한 인코딩 기법이 단지 대표적인 것, 및 다른 기법들이 사용될 수 있다는 것을 인식할 것이다. 다른 실시예에서, 이미지 데이터 및/또는 ID 코드는 프로세싱을 위한 다른 디바이스로 전달된다. 그러한 접근법 이 예를 들어, 이동 에이전트들이 호스트 디바이스와 같은 단일 디바이스에 의해 중앙 집중적으로 제 어 또는 모니터링되는 실시예들에서 사용될 수 있다. 따라서 이미지 데이터 및/또는 ID 코드는 이동 에이전트 에 전송된 해석된 결과들을 이용하여, 또는 이동 에이전트에 전송된 그러한 결과들에 기초한 명령들 을 이용하여, 호스트 디바이스에서 프로세싱될 수 있다. 또 다른 실시예들에서, 구성요소의 면의 직교하는 치수들 또는 구성요소 형상 및 및 면 치수들 또는 다른 정의 특성들을 캡처하는 후속 정보와 같은, 구성요소 정보 그것들 자체는 인코딩된 데이터에 통"}
{"patent_id": "10-2015-7033682", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 14, "content": "합될 수 있다. 해당 기술분야의 통상의 기술자는 일부 상황들에서, 설명된 ID 인코딩 기법이 또한 종래 큐브 형 태로부터 벗어나거나 보다 복잡한 기하학적 구조들을 갖는 구성요소들(예를 들어, 이제까지 유용한 크기로 논의된 바와 같은 코드들을 대체하기에 불충분한 크기 또는 비율의 면들로 구성된 기하학적 구조들을 갖는 구성 요소들)의 특징을 나타내도록 배치되지 않을 수 있다는 것을 인식할 것이다. 그러한 경우들에서, 대안적인 인코딩 포맷들은 구성요소의 면 상에 코딩된 마크에 크기, 유형, 및 배향 데이터를 제공하는 기본 접 근법을 여전히 유지하면서, 광범위한 형태들에 보다 적합한 것으로 고려될 수 있다. 선호되는 배향에 대한 기준을 제공하는 기계-판독가능한 코드(또한 \"마크\"로서 지칭되는)의 외관이 관측자에 직 교하는 마킹된 표면의 상대적 회전 배향을 결정하는데 사용될 수 있는 것처럼, 관측된 기계-판독가능한 코드의 형상이 그것의 표면에 직교하여 볼 때 그것의 외관에서 외관상 벗어나는 방식은 관측 지점에 대해 공간에서의 구성요소의 상대적 위치 및 배향에 대한 정보를 제공한다. 특히, 표준 기하학적 포맷을 고수하는 그래픽 데이터 인코딩 기법이 채용되는 상황들에서, 관측된 기계-판독가능한 코드의 표준 포맷과의 편차는 에이전트 상의 카메라 또는 스캐너에 관한 구성요소의 위치 및 배향을 결정하는데 사용될 수 있다. 예를 들어, QR 코드에 대해, 가정된 형태는 정사각형이다. 그러한 코드가 코드의 중심에 직교하는 벡터 외측에 보일 때, 관측하는 관점을 예측가능한 방법들로 형상을 왜곡한다. 기하학적 구조들이 관점에 의해 어떻게 변형 되는지에 대한 이해에 기초하여, 시스템은 관측자에 대해 코드를 지니는 면의 상대적인 위치 및 배향을 추정할 수 있다. 따라서, 적어도 일 실시예에서, 시스템은 코드의 정상 외관 및 크기의 지식을 사용하여, 상대적인 거 리 및 배향을 내기 위해 코드의 관측된 외관을 프로세싱하며, 이들 양자는 진전된 지식을 통해, 또는 코드를 판 독함으로써, 또는 양자의 일부 조합에 의해 이용가능하게 만들어질 수 있다. 일부 경우들에서, 이미지 해상도, 관측 거리, 및/또는 다른 요인들은 코딩된 면의 상대적 위치 및 배향을 분석 하는데 있어서 시스템의 정확도를 제한할 수 있다. 결과적으로, 적어도 일 실시예에서, 다른 방법들은 코딩된 마크들의 외관의 분석을 통해 제공되는 정보를 추가하는데 사용된다. 예를 들어, 추가적인 마크들은 하나 이상 의 위치의 구성요소 상에 제공될 수 있다. 평평한 표면들을 갖는 구성요소 형태들에 대해, 코너 지점들은 구성요소의 기하학적 구조 상의 용이하게 식별가능한 지점들과 일치하는 기준들을 수립하기 위해 마킹될 수 있다. 예를 들어, 큐브-형 블럭인 구성요소에 대해, 기준 마크들은 큐브의 여덟 개의 코너에 배치될 수 있고, 네 개의 마크는 큐브-형 블럭의 임의의 특정한 면에 인접하게 위치된다. 구성요소의 면이 그것 상에 위치된 코드 마크보다 큰 경우들에서, 면들의 제한들(즉, 코너들)에 위치된 기준 마크들은 관측점에 관해 특정한 면의 위치 및 배향을 식별하는 것을 도울 수 있는 향상된 관점을 제공한다. 다양한 실시예들에서, 그러한 기준 마크들은 다수의 형태 중 임의의 형태를 가정할 수 있다. 적어도 일 실시예 에서, 마크 및 구성요소의 면에 대한 그것의 관계의 인식의 신뢰성을 향상하는 역할을 하는 기법이 채택된다. 이제 도 7a 내지 도 7c를 참조하면, 그것들이 블럭과 같은 큐브-형 구성요소의 면 상에 나타날 수 있 기 때문에, 기준 마크들의 일부 예들이 도시된다. 도 7a에 도시된 바와 같이, 기준 마크들 간 알려진 거리들은 카메라 또는 스캐너(미도시)로부터 구성요소의 상대적인 위치 및 배향을 결정하는데 사용될 수 있다. 그러한 기준 마크들은 위에서 설명된 바와 같은 기계-판독가능한 코드들에 더하여 면들 상에 배치될 수 있다; 그러나, 그러한 기계-판독가능한 코드들은 명확성을 위하여 도 7a 내지 도 7c에서 생략된다. 도 7b에 도시된 바와 같이, 적어도 일 실시예에서, 면의 각 코너에 위치된 마크는 그것이 관련된 기 하학적 코너를 가리키도록 성형 및 배향될 수 있다. 그러한 접근법은 관측이 다수의 면 또는 하나 이상의 면 및/또는 코드의 불완전한 뷰를 포함할 때 별개의, 개별적인 면들의 분해를 용이하게 할 수 있다. 그 러한 경우들에서, 각 마크가 관련된 기하학적 지점을 나타내는, 기준 마크들로부터의 데이터 지점들 의 점군의 생성은 별개의 면들로 정확하게 분해하는 것을 시도할 수 있는 지점들의 세트를 낼 수 있다. 이 에 대한 하나의 이유는 코너 위치를 표시하는 공간적 자료가 그것을 정의하는 표면들이 어떻게 수렴되는지를 반 드시 표시하는 것은 아니라는 것이다. 수학적 용어들로 표현하여, 3-차원 큐브에 대해 단지 단일 코너 지점의 지식을 가지는 경우, 그 교차점이 코너 지점을 정의하는 세 개의 면들 중 임의의 면에 대해 유효한 위치들 은 모든 3 차원에서 코너 지점에 대해 회전되는 큐브의 전방위의 가능한 위치적 솔루션들로 구성된다. 따라서, 마킹된 지점에 상대적인 면의 확대 방향의 표시를 제공하기 위한 기준 마크들의 사용은 기준 지점들 의 점 군으로부터 면들의 분해를 용이하게 할 수 있다. 일부 경우들에서, 별개의 면들에 대한 기준 마크들은 특정한 유리한 위치들로부터의 관측이 기준 지 점에 대한 애매성 또는 마크를 식별하는 어려움을 낼 수 있도록 아주 근접하여 위치될 수 있다. 예를 들어, 기준 마킹 기법이 큐브의 모든 면 상의 코너 위치들에서 마크들을 사용하면, 가시적인 하나보 다 많은 그것의 정의 면들을 갖는 코너를 제시하는 관측점에 대한 큐브의 배향이 마찬가지로 다수의 기준 마크를 드러내 보일 것이다. 기준 마크들이 큐브의 지역적 에지들로 완전히 확장하면, 그 결과로 생 긴 종합한 형상을 별개의 기준 마크들로 분해하는 것이 어려워질 수 있다. 이러한 이유로, (도 7a 내지 도 7c에 도시된 바와 같이) 각 면의 에지로부터 떨어진 기준 마크들을 오프셋하는 것이 바람직할 수 있 고, 따라서 동일한 지점을 표시하는 다수의 기준 마크들을 포함할 수 있는 관측들이 이와 같이 보다 용이 하게 식별될 수 있다. 면들의 공간 특성들을 결정하는 수단으로서 코너 지점들을 마킹하는 상기-설명된 기술들은 단지 현재 시스 템 및 방법과 관련하여 사용될 수 있는 접근법의 일례이다. 다른 기술들이 사용될 수 있다. 예를 들어, 에지들 은 코너 지점들과 유사한 방식으로 기하학적 묘사의 기준을 제공하고, 라인 또는 에지 검출은 코너 마킹 기법에 추가하여 또는 개별적으로 추구될 수 있는 대안적인 수단을 제공한다. 에지 검출은 이미지 프로세싱의 해당 기 술분야에 잘 알려져 있고, 현재 시스템 및 방법의 상황하에서, 특히 잠재적인 구성요소 기하학적 구조들이 미리 알려질 수 있거나 획득될 수 있는 경우(구성요소 ID 코드와 같은 수단에 의해), 특히 유용할 수 있다. 일부 경 우들에서, 에지들은 지점보다는 곡선 또는 벡터로서의 그것들의 정의 때문에, 코너들에 대한 이점들을 제공할 수 있다. 따라서, 적어도 일 실시예에서, 마킹 기법들은 코너 마킹 접근법에 대한 대안으로서 또는 코너들에 추 가하여 강조된 에지들에 지시될 수 있다. 임의의 적합한 형태가 기계-판독가능한 코드들 및/또는 기준 마크들을 이용하여 표면들에 마킹하기 위해 사용될 수 있다. 적어도 일 실시예에서, 색상은 특정한 구성요소 유형들 또는 그것들의 측면들을 식별하는 것을 더 돕기 위해 사용될 수 있다. 적어도 일 실시예에서, 마킹은 잉크(임의의 적합한 색상의 또는 색상들의 조합의)를 인가함으로써, 및/또는 텍스처링 또는 릴리프에 의해, 및/또는 일정한 재료 변형에 의해 완수될 수 있다. 적어도 일 실시예에서, 마크들은 가시 스펙트럼에서 투명한, 그러나 초음파 또는 적외선 주파수들과 같은 가시적인 범위 밖의 광 파장들에서 가시적인 잉크를 이용하여 표면들에 적용될 수 있다. 이 접근법에 대한 이점 은 마크들이 사용자에게 보이지 않고 따라서 구성요소들의 외관을 손상 또는 산란하게 하지 않는다는 것이다. 구성요소들이 잠재적으로 복잡한 표면들을 가질 수 있고/있거나 기계적 또는 다른 기능을 가질 수 있기 때 문에, 일부 구성요소들이 기계-판독가능한 코드 또는 기준 마크(들)를 위치시키기에 충분하거나 편리한 영역이 없는 면들을 가질 수 있다는 것이 가능하다. 이들 경우들에서, 다르게 존재할 수 있는 식별마크들(기계-판독가능한 코드 또는 기준 마크(들))의 전부 또는 일부의 지원 불능에도 불구하고, 구 성요소가 면과 같은, 표면의 존재를 입증하는 메커니즘을 포함하는 것이 여전히 바람직할 수 있다. 적어도 일 실시예에서, 코드 및/또는 기준 마크(들)이 불완전한 표시가 제공된다(기계-판독가능한 코 드 또는 기준 마크(들)에 추가하여 또는 그의 부분으로서). 그러한 접근법은 완전한 기계-판독가능한 코드를 캡처하려고 시도할 때 표면의 반복된 관측들을 단출시키는 역할을 할 수 있다. 따라서, 적어도 일 실시예에서, 패턴을 특정한 면 상의 완전히 이용가능한 공간에 걸쳐 적용될 수 있고, 여기서 그러한 패턴은 구성요소 면을 코딩하는데 적용되는 마크들(기계-판독가능한 코드 또는 기준 마크(들))의 유형과 구분된다; 그러한 패턴은 불완전한 기계-판독가능한 코드 또는 기준 마크 (들)을 표시한다. 예는 배향이 면의 우세한 에지로부터 45° 오프셋인 스트라이프 패턴이다. 이 패턴 을 검출하는 관측은 해당 면의 기하학적 한계들의 일부 부분을 가능한 상세하게 기술하면서, 구성요소 면 이 불완전하거나 아무런 인코딩된 데이터도 존재하지 않는다는 것을 결정할 수 있다. 이 방식에서, 시스템 은 여전히 (다른 구성요소들에 대한 그리고 표면에 대한 그것의 관계뿐만 아니라) 구성요소의 전체 공간적 위치결정 및 배향의 포괄적인 이해를 발전시키는 것에 관련될 수 있는 정보를 획득할 수 있다. 따라서, 본 출원에 설명된 기술들을 사용하여, 시스템 및 방법은 작업면 상에서 작동하는 이동 에이전트들 의 위치확인을 지원하고 블럭들과 같은 구성요소들과 그러한 이동 에이전트들의 상호작용을 용 이하게 하는 환경을 제공한다. 본 출원에 설명된 기술들은 이동 에이전트들이 이동 에이전트들, 다른 구성요소들, 및/또는 작업면(그 자체로 구성요소로서 간주될 수 있는)에 대한 그러한 구성요소 들의 위치 및/또는 배향을 결정하는 것을 가능하게 하는데 사용될 수 있다. 적어도 일 실시예에서, 각 이동 에이전트는 작동 환경 및/또는 상기 환경 내 그것의 위치의 한계들에 대한 이해를 가진다; 따라서, 구성요소들의 식별 및 인식의 프로세스들 및 에이전트의 알려진 위치 및 배 향에 관한 그것들의 공간적 배치를 통해, 각 에이전트는 전역적 기준 지점(예를 들어, 작업면 상의 공통적인 기점 지점일 수 있는) 및/또는 작동 환경의 한계들의 상황하 구성요소들의 공간적 배치를 이해할 수 있다. 결과적으로, 작업면 및 다른 구성요소들 양자는 이동 에이전트들에 의한 위치확인을 함께 또는 개별적으로 지원할 수 있는 구조화된 환경을 구성한다. 다양한 실시예들에서, 시스템은 구성요소 배열의 현재 지식 및 작업면 중 어느 하나 또는 양자를 사용할 수 있고/있거나, 하나로부터 다른 하나로 전환할 수 있다. 이동 에이전트가 그것의 현재 위치로부터 어느 정도 떨어진 알려진 위치로 특정한 구성요소를 이동시키는 작업이 주어지는 일례에서, 시스템은 바람직하 게는 간편한 방식으로 구성요소를 들어올리거나, 잡거나 또는 그것의 위치를 다르게 취하기 위해 에이전트 를 배치하는 방식으로, 구성요소의 위치로 에이전트를 가져갈 경로를 계획할 수 있다. 이동 에 이전트가 구성요소의 위치로 이동하거나 또는 그것의 의도된 다음 위치로 구성요소를 가지고 이 동하고 있지만, 에이전트는 작업면 상에 기준을 위해 인코딩되거나 다르게 마킹된 정보를 사용할 수 있다(또는 전역적 위치를 참조하여). 그러나, 이동 에이전트가 구성요소에 충분히 밀접하면, 구성요 소에 대한 에이전트의 위치 및 배향은 작업면 상의 이동 에이전트의 절대적 위치보다 구성 요소를 캡처 또는 조작하는 즉각적인 작업과 관련될 수 있다. 캡처 또는 조작을 위해 식별된 구성요소 에 대해 대신 위치를 찾는 것에 지시된 것으로 작업면을 통해 전역적 위치 및 배향을 모니터링하는 것에 대한 강조에서의 전환은 예를 들어, 타겟 구성요소의 매핑된 위치에 존재하는 잠재적인 에러를 인식하는 것에 기초할 수 있다. 이동 에이전트를 구성요소의 근접 위치로 유도하기 위해 맵 데이터에 따르는 것은 이동 에이전트에 가시선 없이 능률적으로 그리고 확실하게 구성요소들에 도달하는 수단을 제공 한다. 에이전트의 내장 센서들을 통해 제공되는 프로세싱 데이터를 통해 에이전트에 대한 구성요소 위치 및 배향을 결정하는 것이 가능해지도록 이동 에이전트가 구성요소에 가까워지면, 구성요 소가 에이전트에 의해 캡처될 때까지 이 접근법으로 전환하는 것이 바람직할 수 있다. 그러한 지점에 서, 이동 에이전트는 작업면에 대한(또는 에이전트의 전역적 위치에 대한) 위치를 찾는 것으로 복귀할 수 있다. 유사하게, 그것의 의도된 위치 및 배향에서의 구성요소의 배치는 마찬가지로 이동 에이전트에 의해 운반되는 구성요소의 의도된 최종 위치 및 배향에 잠재적으로 인접한 다른 구성요소들에 대한 위치를 우선적으로 찾는 것으로의 전환을 수반할 수 있다. 그러한 경우에서, 구성요소의 공간적 데이터는 구성요 소 및 배치된 구성요소의 최종 위치와 관련된 임의의 다른 구성요소들(예를 들어, 배치된 구성 요소의 위치 아래에 적층된 구성요소들)의 기하학적 구조들뿐만 아니라 이동 에이전트의 기하학 적 구조들의 알려진 기하학적 구조들을 활용하고 예를 들어 이동 에이전트 상에 설치된 하향-지향된 카메라에의해, 작업면의 위치확인 기법에 의해 지원되는 것이 허용하는 한도로 정확하게 수립될 수 있다. 적어도 일 실시예에서, 다수의 이동 에이전트는 협력적으로(또는 가상이든 실제이든, 경쟁적으로, 또는 서 로 충돌하며) 작업하거나 개별적인 작업들로 바쁜, 작업면 상에서 동시에 작동할 수 있다. 이동 에이전트 들이 능동적으로 서로 협력하는지와 관계없이, 작업면의 별개의 관측들을 통해 유도된 정보는 작업면 환경의 단일, 전역적 모델로 조합될 수 있다. 데이터의 그러한 종합은 상기 구성요소들의 각각의 위치 및 배향에 관한 보다 정확한 정보뿐만 아니라 작업면의 관련 공간에 위치된 모든 구성요소의 보다 포괄 적인 또는 보다 복잡한 개관을 낼 수 있다. 아마도, 시스템이 이동 에이전트들이 작동하고 있는 물리적 공 간의 가상 모델이 호스트 디바이스와 같은 중앙 노드에 속하는 아키텍처를 채용하면, 그러한 모델은 전체 적으로 또는 부분적으로 그러한 데이터를 제공하기 위해 구비될 수 있는 이동 에이전트들 및/또는 구성요 소들의 다른 유형들을 통해 개별적으로 획득되는 모든 구성요소 유형들, 위치들, 및 배향들에 관한 모든 관련 정보를 통합시킬 수 있다. 이 방식에서, 작업면의 관련 부근의 구성요소들의 포괄적인 표현이 생성될 수 있다. 2013년 8월 9일에 출원된, \"하나 이상의 컴퓨팅 디바이스를 갖는 로봇 시스템의 통합\"(대리인 문서 번호 ANK002)에 대한 관련 미국 실용 출원 제13/963,638호에 설명된 바와 같이, 그 후 그러한 포괄적인 표 현은 대응하는 가상 표현들과 구성요소들, 작업면, 및/또는 이동 에이전트들의 물리적 위치들 및 배향들을 조화하기 위해서 뿐만 아니라, 구성요소들, 작업면, 및/또는 이동 에이전트들의 가 상 표현을 구축 및/또는 유지하는데 사용될 수 있다. 별개의 이동 에이전트들로부터 유도된 구성요소 유형, 위치 및/또는 장소에 관한 정보가 정확히 일치하지 않을 수 있는 가능성으로 인해, 적어도 일 실시예에서 작동 환경의 단일 표현을 구축 및 유지하는데 있어서의 차이들을 조화시키기 위한 메커니즘이 구현될 수 있다. 데이터는 잠재적인 에러에 따라 우선순위화될 수 있고, 따라서 최저 에러를 갖는 데이터는 보다 큰 에러를 갖는 데이터를 수행하는 별개의 소스들로부터의 정보를 종합 하는데 있어 보다 큰 가중치를 지닌다. 예를 들어, 하나는 구성요소에 밀접한 유리한 위치에 있고 다른 하나는 더 멀리 떨어진 위치에 있는, 두 개의 이동 에이전트가 작업면 상의 별개의 위치들로부터 동일한 구성요소를 관측하는 것을 가정 하자. 이동 에이전트들이 동일한 정확도를 가지고 작업면으로부터 그것들 자체의 위치 및 배향을 유 도하고 양자가 구성요소를 관측하기 위해 동일한 카메라 이미징 기술을 채용하고 있다면, 구성요소에 보다 가깝에 위치된 이동 에이전트가 대부분의 경우들에서 더 멀리 떨어져 위치된 에이전트보다 서로 본 구성요소의 공간적 배치에 관해 보다 신뢰할 수 있는 정보를 제공할 것이라고 기대된다. 관측 각도의 차이들, 하나의 이동 에이전트가 이동하면서 구성요소를 관측하고 있는 경우, 또는 하나가 부분적으 로 차단된 뷰를 가지는 경우과 같은, 다양한 요인들이 그러한 예에서의 데이터의 품질에 영향을 미칠 수 있다. 다른 차이점들이 또한 관측의 조건들로 존재할 수 있다. 적어도 일 실시예에서, 그러한 요인들 중 임의의 요인 또는 전부가 두 개의 소스로부터 데이터를 우선순위화하는데 고려될 수 있다."}
{"patent_id": "10-2015-7033682", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 15, "content": "해당 기술분야의 통상의 기술자는 다른 기법들이 상이한 소스들로부터 수신된 모순되는 데이터를 우선순위호하 기 위해 사용될 수 있다는 것을 인식할 것이다. 적어도 일 실시예에서, 이동 에이전트들(및/또는 다른 구성요소들)은 작업면을 포함하는 환경의 물리 적 상태의 정확한 가상 표현을 구축 및 유지하기 위해 진행중인 모니터링 및/또는 탐색에 참여한다. 적어도 일 실시예에서, 이동 에이전트들이 구성요소들을 이용하여 이미 파퓰레이팅된 공간으로 도입될 것이라고 기대될 수 있다. 또한, 일부 상황들에서, 구성요소 구성들은 어셈블리가 뜻하지 않게 붕괴될 수 있거나 의 도적으로 해체될 때, 예측하기 어려운 방법들로 변경될 수 있다. 어느 하나의 경우에서, 에이전트들은 구 축된 가상 표현 및 물리적 상태 간 불일치들을 인식하도록 구성될 수 있다. 본 출원에 논의된 바와 같이, 에이전트들 및/또는 구성요소들의 가상 표현 및 물리적 위치들 간 충돌 의 경우들에서, 적절한 조절들이 물리적 위치들 및/또는 가상 표현 중 어느 하나 또는 양자에 대해 이루어질 수 있다. 우선순위는 적절한 대로, 가상 또는 물리 중 어느 하나에 주어질 수 있다. 이제 도 8을 참조하면, 이동 에이전트들이 가상 상태 및 물리적 상태 간 패리티를 유지하기 위해 지속적으 로 채용할 수 있는 프로세스를 설명하는 흐름도가 도시된다. 도 8에 도시된 단계들 및 기능들은 단지, 이동 에 이전트의 별개의 작업일 수 있거나, 그것들은 다른 활동들과 조합될 수 있거나 그러한 다른 활동들과 동시 에 수행될 수도 있다. 그러한 조화를 위한 추가적인 기술들이 예를 들어, 본 출원에 참조로서 통합되는, 2013년 8월 9일에 출원된, \"하나 이상의 컴퓨팅 디바이스를 갖는 로봇 시스템의 통합\"(대리인 문서 번호 ANK002)에 대 한 관련 미국 실용 출원 제13/963,638호에 설명된다.방법은 800에서 시작한다. 초기에, 이동 에이전트는 관측 & 모니터 상태에 있으며, 이는 다른 작업들 과 동시에 수행될 수 있는 서비스 기능으로서 구현될 수 있다. 이러한 상태에 있는 동안, 에이전트는 이벤 트 통지의 대안적인 형태들을 통해 수신되거나 다른 이동 에이전트들 중 어느 하나로부터, 외부 소스들로 부터 정보를 수신하고/하거나 이벤트들을 검출할 수 있다. 예를 들어, 이동 에이전트는 가속도계에 의해 픽업되는 작업면에서의 진동들 또는 쓰러지는 구성요소들과 일치하는 사운드를 검출할 수 있다. 적어도 일 실시예에서, 단계에서, 어떠한 이벤트도 검출되지 않는 경우, 에이전트는 작업면의 모든 영역이 탐색되었는지를 결정한다; 그렇다면, 방법은 관측 & 모니터 상태로 돌아간다. 영역들이 탐색되지 않은 상태로 남아있으면, 적어도 일 실시예에서, 추가 탐색이 예를 들어 작업면 상의 위치 이동 과 같은 특정하게 조절함으로써, 배향을 변경함으로써, 및/또는 몇몇 다른 동작을 수행함으로써 수행될 수 있다. 그 후 방법은 관측 & 모니터 상태로 돌아간다. 예를 들어 구성요소의 존재를 검출하는 이동 에이전트에 의한, 이벤트의 검출에 응답하여, 구성 요소 인식 단계가 시작된다. 여기서, 이동 에이전트는 상태가 변경된 구성요소를 인식하려고 시 도한다. 구성요소가 성공적으로 인식되면, 이동 에이전트는 보고 & 업데이트 단계를 수행하고, 여기서 그 결과로 생긴 구성요소 유형, 위치 및 배향에 관한 정보가 물리적 공간의 가상 표현에 업데이트된다. 이벤트가 보고되고, 가상 환경이 그에 따라 업데이트되면, 방법은 관측 & 모니터 상태로 돌아간다. 검출 및 인식은 이를테면 구성요소가 우수한 관측 데이터에 응답하여 약간 변형될 때, 작은 발 생들에 응답하여, 또는 이를테면 구성요소가 긴 거리를 이동될 때, 또는 부서진 구성요소의 분산이 갑자기 작업면 상에서 검출될 때, 또는 적층된 구성요소 어셈블리가 붕괴 또는 예기치 않은 제거의 결과로서 그것의 이전 위치에서 사라질 때, 보다 큰 발생들에 응답하여 수행될 수 있다. 단계에서, 검출된 구성요소가 성공적으로 인식되지 않으면, 적어도 일 실시예에서 이동 에이전트 는 대안적인 유리한 위치가 가능한지를 결정할 수 있다; 그렇다면, 에이전트는 그것이 식별된 구성요소 또는 그렇게 하기 위한 다 소진된 이용가능한 이점들을 가질 때까지 인식되지 않은 구성요소 에 대한 그것의 초점을 유지하면서, 그것의 유리한 위치를 조절하려고 시도한다. 조절 후, 방법 은 검출 및 인식이 다시 시도될 수 있도록 단계로 돌아간다. 적어도 일 실시예에서, 단계에서 어떠한 대안적인 유리한 위치들도 가능하지 않은 경우, 이동 에이전트 는 사용자 지원이 이용가능할 수 있는지를 결정하고, 그렇다면, 사용자(또는 다른 소스)로부터의 지 원을 요청할 수 있다. 적어도 일 실시예에서, 그러한 요청은 사용자에게 시스템 또는 그것의 이동 에이전 트들이 인식할 수 없는 물리적 상태의 측면들이 있다는 것을 통지함으로써 수행될 수 있다. 그러한 통지에 응답하여, 사용자는 예를 들어 다르게 인식가능할 수 있는 블럭들의 무질서한 더미를 해체함으로써 및/또는 작 업면 상에 존재할 수 있는 비-블럭 구성요소들(즉, 블럭들로서 인식가능한 구성요소들의 생태계 에 이질적인 아이템들)을 제거함으로써 적절한 해결을 제공할 수 있을 수 있다. 단계에서, 사용자 지원이 이용가능하지 않은 경우, 이동 에이전트는 이전에 설명된 해체 및 제거 프 로세스 그 자체를 실행하려고 시도할 수 있다. 예를 들어, 이동 에이전트는 구성요소 또는 다른 객체를 식별하려는 시도들을 중단하고 대신 작업면으로부터 그것들 제거하려고 시도할 때를 결정하기 위한 임의의 적합한 기술을 사용할 수 있다; 그러한 결정은 예를 들어 구성요소를 식별하려는 미리결정된 수의 실패된 시도에 도달하는 것, 및/또는 다른 규준들에 기초하여, 이동 에이전트 또는 호스트 디바이스, 또는 일부 다른 구성요소에 의해 자동적으로 이루어질 수 있다. 적어도 일 실시예에서, 도 8에 도시된 프로세스 흐름은 동작이 일부 트리거 이벤트, 명령, 또는 다른 조건에 기 초한 임의의 적합한 시간에 종료될 수 있더라도, 완료를 표시하는 것이 아니라, 관측 & 모니터 단계로 돌 아가는 루프를 표시한다는 것이 주의되어야 한다. 적어도 일 실시예에서, 임의의 수의 이동 에이전트는 도 8에 도시된 것들과 유사한 프로세스 흐름들을 동 시에 수행할 수 있다; 그러한 병령 동작은 단일 에이전트로부터 초래할 수 있는 것보다 빠른 작업면 의 환경에서의 물리적 공간의 보다 정확한 표현을 야기할 수 있다. 다수의 에이전트의 사용은 향상된 프로 세스 흐름에 대한 기회들을 제공할 수 있다. 예를 들어, 객체 인식 초기 실패의 경우들에서, 다수의 에이전트 는 구성요소 또는 다른 객체의 성공적인 인식의 가능성을 증가시키면서, 관측 데이터를 동시에 수집 및 공유할 수 있다. 유사하게, 에이전트들은 구성요소들 또는 다른 객체들을 해체할 때 효율성을 향 상시키는 것을 가능하게 하기 위해 협력할 수 있다.이동 에이전트들에 작업면 주위 환경의 물리적 상태의 변화들을 검출하는 능력을 제공하는 것은 시스 템 및 방법이 액션들의 수행 및 계획에 대한 근거로서 사용되는 그것의 가상 표면 및 물리적 상태 간 일관성을 유지하게 한다. 이 점과 관련한 강력한 성능이 변화들에 대해 호의적인 응답을 낼 수 있더라도, 변화를 검출하 는데 있어서의 지체는 반드시 시스템이 사용자에게 끌어내는 주의도를 감소시킬 필요가 없다. 사실, 이동 에이 전트가 그것의 환경의 예기치 않은 또는 계획되지 않은 변화를 검출하는데 필요한 시간은 사용자들에게 즐 거움의 소스일 수 있다. 이동 에이전트가 변화 이벤트를 검출하도록 잘 배치되지 않은 순간에 구성요소 구성 또는 배치를 교체하는 일부 사용자들을 상상하여, 그 후 이동 에이전트가 차이를 검출하고, 변 화를 인식하며, 결과적으로 만약 있다면, 이에 응답하여 취할 액션을 결정하는 것이 얼마나 오래 걸릴 것인지를 알아보는 것을 기다릴 수 있다. 작업면의 공유된 표현에 따르는 다수의 이동 에이전트의 동작은 그 자체를 작업들을 수행하기 위해 이동 에이전트들(1040 간 협력을 조직하는데 부여한다. 따라서, 적어도 일 실시예에서, 복수의 이동 에이전트는 개별적으로 공유된 목적물에 기여할 수 있거나, 작업을 공유할 수 있다. 예를 들어, 두 개의 이동 에이전트 는 그것만으로 너무 부피가 크거나 너무 무거울 수 있거나 그 외 단일 이동 에이전트에 의해 관리되 기에 너무 통제하기 힘들 수 있는 구성요소들의 어셈블리 또는 단일 구성요소를 운반할 수 있다. 이제 도 9를 참조하면, 각각 구성요소(402F)의 어느 하나의 단부로부터의, 두 개의 이동 에이전트가 물리 적 로드(구성요소(402F))를 체결하고 들어올리는 예가 도시된다. 그 후 에이전트들은 그것들의 공유된 화 물에 대해 의도된 위치로 조정하여 이동한다. 그러한 작업은 계획 및 모션 제어 양자, 뿐만 아니라 그러한 협력 을 가능하게 하는 메커닉들을 필요로 한다. 예를 들어, 도 9의 우변에 도시된 바와 같이, 아크를 따라 구 성요소(402F)를 이동시키는 것은 아래에서 보다 상세하게 설명될 바와 같이, 두 개의 에이전트 간 협력될 동작들을 조종하는 것을 필요로 한다. 다양한 실시예들에서, 이동 에이전트들에 설계되는 보행 수단은 예를 들어 트랙들 또는 휠들, 및/또는 기 타와 같은 시스템들을 돌리는, 다리가 있는 시스템들을 포함하는, 몇몇 형태 중 임의의 형태를 취할 수 있다. 본 출원에 설명되고 도시되는 특정한 보행 기술들을 단지 대표적인 것이다. 적어도 일 실시예에서, 상이한 에이 전트들은 상이한 보행 수단을 가질 수 있다; 적어도 일 실시예에서, 시스템 및 방법은 협력 액션들을 포함 하는, 계획 및 수행 액션들에 있어서 다양한 이동 에이전트들에 대한 보행 수단의 성질(및 그것들의 각각 의 성능들 및/또는 한계들)을 고려한다. 도 9의 현재 예에서, 이동 에이전트들이 구성요소들을 들어올리고 제어하는데 사용되는 그것들의 하드웨어 에 대한 그것들의 보행 시스템들을 회전하는 능력 또는 회전하지 않고 작업면에 평행한 수평면 내 임의의 벡터 로 자의적으로 이동하는 능력(크랩과 유사한 자유도를 갖는 다리 어셈블리와 같은) 중 어느 하나를 가진다는 것 이 중요하게 여겨질 수 있다. 따라서, 적어도 일 실시에에서, 시스템은 도 9의 예에 도시된 바와 같이, 공유된 화물을 수송하는 두 개의 이동 에이전트가 어떻게 턴할 수 있는지를 고려하는데 있어서 그러한 유연성을 고려한 다. 특히, 위에서 설명된 바와 같이, 도 9는 구성요소(402F)를 수송하는데 있어서 두 개의 이동 에이전트들 협 력을 도시한다. 도 9의 좌변은 직선으로 수송하기 위한 배열을 도시하는 한편, 우변은 이동 경로가 직선으로부 터 벗어날 때(이를테면 아크를 따라) 그것의 호이스트 및 운반 시스템과 관계없이 각 에이전트의 이 동 시스템의 회전을 가능하게 하는 기계적 시스템의 중요성을 예시한다. 보편적인 다리들은 단일 결합 유 닛으로서 그것들의 회전을 가능하게 하는 한편 회전 조인트를 통해 리프팅 시스템에 연결되는 이동 플랫폼(90 3)은 트랙 또는 휠이 달린 에이전트들이 공유된 화물(구성요소(402F))의 수송 시 힌지 지점들로서 역할을 하게 한다. 본 출원에 설명되는 특정한 시스템은 구성요소들의 조정된 수송에 수반되는 복잡성을 해결하는 고유한 이점들을 제공한다; 피어 디바이스의 중앙 집중식 제어에 기초한 네트워크 아키텍처를 사용함으로써, 시 스템 및 방법은 다수의 이동 에이전트 간 그러한 작업을 보다 용이하게 조정할 수 있다. 일부 경우들에서, 구성요소 어셈블리들을 건설하는데 있어서 공간적 제약들은 그것의 최종 위치에서 구성요소 의 편리한 배치를 불가능하게 할 수 있다. 예를 들어, 의도가 두 개의 미리-존재하는 구성요소들 간 좁은 공간으로 두 개의 이동 에이전트에 의해 운반되는 구성요소를 슬라이딩하는 것이라면, 기계적 디자인 및 공간적 구성에 따라, 에이전트들이 그것의 최종 위치로 직접 운반된 구성요소를 배치하는 것이 가능하지 않을 수 있다. 그러한 경우들에서, 두 개의 이동 에이전트의 모션을 조정하는 계획 시스템 및 방법은 예를 들어, 이동 에이전트들이 최종 위치 근처 편리한 위치에 어셈블리를 배치한 후 일부 대안 적인 수단(이를테면 원하는 위치로 단독 또는 협력하여 미는) 을 통해 어셈블리를 위치시키게 할 수 있다.감정 적어도 일 실시예에서, 시스템은 그것들의 작업들을 수행하는 동안 감정의 의미있는 표현들뿐만 아니라 이동 에 이전트들 간 정교한 상호작용들을 지속적으로 학습할 수 있는 상황에 따라 인지하는 강력한 플랫폼을 제공 한다. 그러한 응답 시스템은 많은 형태를 가정할 수 있다. 일부 경우들에서, 감정들은 이동 에이전트들에 의해 수행되는 작업들의 기본 수행을 실질적으로 바꾸지 않고 경험에 대해 증가된 풍부함을 제공할 수 있다. 다 른 경우들에서, 이벤트들에 대한 감정 반응들은 진행 중에 있든 계획된 것들이든 작업들의 수행 또는 시퀀스에 대한 결과를 지닐 수 있다. 이제 도 10을 참조하면, 이동 에이전트가 일 실시예에 따라, 사용자로부터 구성요소를 요청하는 시나 리오의 윤곽을 나타내는 프로세스 흐름도가 도시된다. 처음에, 지원이 사용자, 특히 이동 에이전트에 근접 한 특정한 위치에 블럭을 배치하도록 요구되는 사용자로부터 요청된다. 요청이 이루어지면, 에이전트 가 다른 이동 에이전트들, 또는 그것들의 일부 조합에 의해 보고되거나 관측을 통해, 작업면 상 에서 발생하는 이벤트들을 모니터링하는 동안 대기 기간이 시작된다. 이벤트들은 요청의 이행을 나타내는 매치가 존재하는지를 결정하기 위해, 에이전트의 요청과 비교하여 검토된다. 관련 이벤트가 검출 또는 보 고되고, 인식되며, 요청에 매치하는 것으로 결정되면, 이동 에이전트는 프로세스의 시 초에 지원에 대한 요청을 유발했던 작업을 재개하고, 방법이 종료된다. 단계에서, 이벤트가 인식되거나, 단계에서, 이벤트가 요청에 매치하지 않는 것으로 결정되면, 방법 은 단계로 돌아간다. 이 프로세스 동안 그리고 요청에 매치하는 이벤트가 발생할 때까지, 경과 시간이 한계, ta에 대해 모니터링된다 ; 한계를 초과하는 것은 단계로의 복귀를 유발하고, 여기서 사용자는 지원이 다시 요구된다. 이제 도 11을 참조하면, 도 10에 도시된 바와 동일한 결과들을 지원하는 프로세스가 도시되지만, 추가적인 결과 들 및/또는 상태들로서 감정 보답들을 포함한다. 이들 잠재적인 감정 반응들 및/또는 상태들의 도입은 이 예에 서 보다 복잡한 상호작용을 제공한다. 일부 경우들에서, 이들 새로운 결과들은 (도 10과 관련하여 위에어 설명 된 바와 같이) 감정 상태의 부재 시 발생할 수 있는 기대된 출력과 동일하지 않다. 오락 제품들의 장르에서, 그 러한 예기치 않은 결과들은 그것들이 표현할 수 있는 다양성 및 놀라움에 대해 인식될 수 있다. 현재 예에서, 이것들이 단지 예들로서 제시되지만, 작업과 관련하여 제공될 수 있는 감정 상태들은 광범위한 카 테고리들(긍정, 부정, 중용 그리고 혼동) 하에서 식별된다. 제공될 수 있는 특정한 상태들 및 그것들이 어떻게 구현되는지가 달라질 수 있다는 것을 인식할 것이다. 또한, 적어도 일 실시예에서, 그러한 감정 보답들은 예를 들어, 에이전트가 얼마나 길게 대기할 용의가 있 는지(ta) 또는 요청이 몇 번 반복될 수 있는지(Ar)와 같은 파라미터들에 영향을 줄 수 있다. 감정들은 그것들 자 체를 많은 상이한 방법으로 나타낼 수 있기 때문에, 다른 실시예들은 성격의 시뮬레이션들을 포함하는, 다른 감 정 반응들을 제공 및 구현할 수 있다. 또한 이제 도 2를 참조하면, 일반적인 성격 유형에 따른 프로세스에서의 다양한 단계들에서 액션들을 알리는 파 라미터들 및 응답들의 세트를 도시하는 표가 도시된다. 예를 들어, \"외향 긍정\" 성격 유형에 맞는 이동 에 이전트는 보다 큰 인내심, 우호적인 관계를 나타내는 감정 반응들을 나타내고 성격 프로필이 \"민감 부정\" 인 이동 에이전트보다 호의적인 출력을 낼 가능성이 더 많다. 그러한 반응들은 도 11과 관련하여 위에서 도시된 방법에 직접 적용가능할 수 있다. 이동 에이전트가 대기 상태 에 있는 동안 어떠한 이벤트도 검출되지 않으면, 방법은 경과 시간이 일정한 미리결정된 지속기간(ta)에 도달했는지를 확인한다; ta가 도달되었으면, 방법은 사용자에게 이루어진 도움 요청들의 수가 일정한 미리 결정된 양(Ar)을 초과하는지를 결정한다. 도움 요청들의 수가 Ar을 아직 초과하지 않았으면, 방법은 요청 을 반복하기 위해 단계로 돌아간다. 단계에서, 도움 요청들의 수가 Ar을 초과했으면, 에이전트 는 부정적 감정 및/또는 물리적 액션을 나타내고, 방법이 종료된다. 다양한 성격 유형들의 부 정적인 정서 표현 및/또는 물리적 액션들의 예들이 도 2의 표에 도시된다. 도 2의 표에 도시된 바와 같이, ta 및 Ar은 이동 에이전트의 성격 유형에 따라 달라질 수 있다. 이러한 방 식에서, 외향 긍정 이동 에이전트가 본래 요청을 반복하기 전에 대기할 지속기간은 민감 부정 이동 에이전 트가 대기할 것이고, 과묵 긍정 이동 에이전트가 대기하는 한 마찬가지로 대기할 지속기간보다 더 길게 이루어질 수 있다. 유사하게, 민감 부정 이동 에이전트는 ta가 도달된 후 본래 요청을 반복하지 않을 것이고(Ar=1) 대신 부정적 감정 표현 및/또는 부정적 물리적 액션을 이용하여 처리되지 않은 요청에 반응할 것이다. 도 11은 또한 감정 표면 및/또는 물리적 액션이 보여질 수 있는 다른 경우들을 포함한다. 예를 들어, 이벤트가 검출되고 보고되나, 이벤트가 인식되지 않으면, 에이전트는 단계로 돌아가기 전에 혼동 감정 표현 및/또는 물리적 액션을 나타낼 수 있다. 다른 예로서, 이벤트가 검출되고, 인식되며 , 요청에 매치하는 것으로 결정되면, 경과 시간(t) 및 도움 요청들(A)의 수가 각각의 임계값(ta 및 Ar)을 이전에 초과했는지에 대한 결정이 이루어진다. 그렇다면, 적어도 일 실시예에서, 에이전트는 중용의 감정 표면 및/또는 물리적 액션을 나타내고 그 후 그것의 작업을 재개하기 전에 긍정적 감 정 표현 및/또는 물리적 액션을 나타낸다. 경과 시간(t) 또는 도움 요청들(A)의 수가 각각의 임계값(ta 및 Ar)을 이전에 초과하지 않았다면, 에이전트는 중용의 감정 표현 및/또는 물리적 액션을 나타내지 않으 나, 단지 그것의 작업을 재개하기 전에 긍정적 감정 표현 및/또는 물리적 액션으로 바로 진행한다. 다른 변형들이 특정한 특성들 및 이벤트들에 따라, 가능하다. 도 2는 이동 에이전트들의 상이한 성격 유형들에 대한 반응들의 다양한 유형들을 구성하는 액션들을 설명 한다. 일반적으로, 표에 작성된 성격 유형들은 서로 연관된 반응들 및 파라미터들에 대한 약칭 지정으로 역할을 할 수 있다. 도 2에서의 표는 예로서 역할을 하도록 의도된다; 해당 기술 분야의 통상의 기술자는 많은 상이한 접근법이 본 출원에 설명된 기술들에 따라 그것들에 대한 성격들 및 그에 따른 성향들 또는 특성을 정의할 때 사용될 수 있 다는 것을 인식할 것이다. 도 2의 예에서, 표는 프로세스 흐름에서 특정한 단계들 또는 상태들에 대응하여 설정 된 반응들을 제공한다. 그러나, 다른 표현들이 가능하다; 예를 들어, 다른 실시예에서, 성격 파라미터들은 반대 성격들 간 척도 상의 지점들의 면에서 정의될 수 있다. 이제 도 3을 참조하면, 그러한 기법에서 채용될 수 있는 성격들의 많은 예를 제시하는 표가 도시된다. 그러한 접근법은 별개의 유형들을 사용하여 일반적으로 정의 될 수 있는 성격들의 보다 다양한 세트를 낼 수 있다. 임의의 수의 성격은 성격의 치수들을 정의하는데 사용될 수 있다. 성격 유형을 정의하는 다수의 파라미터는 파 라미터들의 보다 짧은 세트를 이해할 수 있는 치밀함들을 낼 수 있으나, 특성들을 전역적 행동 성질로 어떻게 조합하는지를 이해하는 능력은 이해하기에 보다 어려울 수 있다. 적어도 일 실시예에서, 시스템은 그 결과로 생 긴 행동들이 적어도 다소 일관적이라는 것을 보장하기 위해(예를 들어, 한 번 완전히 절제되고 완전히 무분별한 성격, 또는 완전히 냉정하고 완전히 외향적인 성격을 정의하는 것을 회피하기 위해), 특정한 에이전트에 할당될 수 있는 특성들 또는 연관성들에 제약들을 부과할 수 있다. 행동 특성들의 액션을 예측하는 수학적 모델들에 적합한 형태로의 정제는 심리학 분야의 특정한 세그먼트들에서 인식가능한 연구의 대상이었다. 행동 및 결정들에 대한 모델링 기법은 또한 인공 지능 분야에 알려져 있다. 적 어도 일 실시예에서, 시스템은 그것 주위에서 발생하는 이벤트들에 대한 이동 에이전트의 감정 기질 및 감 정 반응을 결정하기 위해 시스템을 사용한다. 시스템은 물리적 환경에서 발생하는 이벤트들에 감정들의 동적 시 스템을 연결하는 역할을 하고, 물리적 환경에서 발생하는 이벤트들에 대한 시스템의 영향을 설명한다. 적어도 일 실시예에서, 감정 반응들은 본 출원에 설명된 시스템의 동작에서 중요한 역할을 수행할 수 있다. 시 스템은 물리적 작업들을 수행하는 이동 에이전트들에 감정적인 성능을 부여할 수 있을 뿐만 아니라, 그것 은 그러한 이동 에이전트들에 의해 생성된 빌딩 구조들과 연관된 추가 기능을 제공할 수도 있다. 적어도 일 실시에에서, 감정은 예를 들어 에이전트들에 의해 수행된 작업들에 중요하게 영향을 주지 않는 사운드들, 제스처들, 또는 다른 액션들 및/또는 출력을 도입하기 위해, 비-기능적인 방법들로 이동 에이전트들 의 행동들에 통합될 수 있다. 그러나, 다른 실시예들에서, 감정들(예를 들어, 이동 에이전트의 성격 프로필에 의해 정의된)은 이동 에이전트의 기능적 동작에 영향을 줄수 있다. 작업들을 수행하는 이동 에이 전트의 능력과 주어진 상황에 적절한 감정들을 표현하는 시스템을 결합함으로써, 시스템은 인지 및 성격의 훨씬 더 강렬한 투영을 생성할 수 있다. 적어도 일 실시예에서, 성격의 파라미터들은 결과들이 그것에 대한 어 떠한 감정적인 구성요소를 가지지 않는 시스템을 이용하여 가능한 것에서 상당히 벗어나게 하는, 기능적 및 실 질적 방법들로 이동 에이전트들의 행동들에 영향을 주기 위해, 이동 에이전트에 이용가능한 잠재적인 액션들을 포함하는 모델로의 입력들로서 역할을 하게 만들어질 수 있다.이제 도 12를 참조하면, 이동 에이전트가 사용자로부터 구성요소를 요청하는 예가 도시된다. 도면에 도시된 바와 같이, 구축된 구성요소들의 여섯 개의 상태가 있고, 각각은 두 개의 별개의 구성요소 어셈블리(1201Y, 1201Z)를 갖는다. 이 시나리오에서, 각 구성요소 어셈블리(1201Y, 1201Z)는 상이한 이동 에이 전트의 진행중인 작업의 결과이고, 좌측 상의 어셈블리(1201Y)는 사용자로부터 구성요소를 요청하는 로봇에 의해 구축 중이다. 여섯 개의 상태의 각각은 구축의 상이한 예들을 묘사한다. 상태들의 좌측 컬럼 (1202A1, 1202A2, 1202A3)은 감정들이 이동 에이전트들에 의해 수행되는 작업들의 코스에 영향을 주지 않는 구 축 스테이지들의 진행 시퀀스이다. 상태들의 우측 컬럼(1202B1, 1202B2, 1202B3)은 유사한 진행이나, 이동 에이 전트들이 액션의 그것들의 코스에 잠재적으로 영향을 주는 감정들을 디스플레이(또는 모델링)하는 진행이 다. 상태들(1202A1 및 1202B1)은 동일하고 이 예에 대해 매칭 시작 지점을 표시한다. 양 시나리오들에서, 좌측 상의 구성요소 어셈블리(1201Y)를 구축하는 이동 에이전트는 사용자에게 그것의 어셈블리(1201Y)에 추가하기 위 한 두 개의 구성요소에 대한 요청을 시그널링한다; 양 시나리오에서, 사용자는 (도 11과 관련하여 위에서 설명된 바와 같이) 요청을 반복하기 전에 이동 에이전트가 얼마나 대기할 것인지를 구술하는 시간 제한 내에 응 답할 수 있다. 도 12의 좌변에서, 상태(1202A1)로부터 상태(1202A2)로의 새로운 구축의 부재 시 지연의 결과가 분명하다. 이동 에이전트는 그것의 요청(도 11의 방법에 대해)을 반복하고 계속 대기한다. 그러나, 도 12의 우변에서, 이동 에이전트의 액션의 코스는 긴 대기 시간에 대한 그것의 감정 반응에 의해 영향을 받는다. 예시의 목적들을 위해, 이동 에이전트의 성격 프로필을 정의하는 성격들이 척도의 일단부 상에 \"절제\" 및 그것의 반대 제한으로서 \"변덕\", 또는 반대 제한들로서 \"공감\" 및 \"무관심\"과 같은 특성들을 척 도화하는 것을 포함한다고 여기는 것이 편리하다. 도시된 예에서, 구성요소를 요청하는 이동 에이전트는 \"순종\"보다 \"반항\"에 가까운 경향들을 입증할 뿐만 아니라, 절제보다 변덕에 실질적으로 가깝고 마찬가지로 공 감보다 냉담에 가까운 파라미터 설정에 의해 설명된다. 따라서, 설정들의 이 조합은 그것의 주요 작업들의 실행 시 적절한 프로세스를 보다 무시하는 경향이 있는 성격을 설명할 가능성이 있다. 예에서, 시스템은 감정 반응들이 물리적 환경에서 취해진 액션들에 영향을 주게 한다. 따라서, 초기 상태 (1202B1)로부터, 상기-설명된 성격들을 가지는 이동 에이전트는 사용자가 요청된 구성요소(들)을 제 공하기 위해 지루한 대기를 참을 가능성이 적다. 이동 에이전트는 이웃하는 어셈블리(1201Z)가 그것들을 사용자로부터 요청된 그것에 매치하는 구성요소들을 포함한다는 것을 인식할 수 있다. 그것의 성격 특성들 (즉, 반항, 무관심, 및 변덕)이 그것의 결정들에 영향을 주는 것을 가능하게 하는 제어 시스템 및 그것의 감정 기질이 주어지면, 이동 에이전트는 그 자체의 어셈블리(1201Y)에 배치하기 위해 이웃하는 어셈블리(1201 Z)로부터 구성요소들를 훔치는 경향이 있을 수 있다. 상태(1202B2)는 그러한 행동의 결과를 표시하고, 여 기서 어셈블리(1201Z)로부터의 두 개의 구성요소는 어셈블리(1201Y)에 배치되었다. 그러한 액션의 결과는 감정 반응이 물리적 액션의 계획 및 수행에 영향을 주게 하는 시스템이 어떻게 비-감정 보답들(예를 들어, 효율성)에 따라 계획된 이벤트들의 코스에 날카롭게 영향을 줄 수 있는지를 나타낸다. 설명된 예에서 감정 영향들은 모든 후속 이벤트들의 시퀀스를 통해 지속될 수 있다는 것을 인식할 수 있다. 예 를 들어, 어셈블리(1201Z)를 구축하는데(훔쳐진 구성요소(들)로부터)참여하는 이동 에이전트가 짧은 신경질 및 변덕의 성격 프로필을 가지는 경우, 에이전트는 절도의 동작(이동 에이전트들에 의해 취해진 모 든 이벤트 및 액션에 대해 보다 큰 시스템의 모니터링에 의해 제공되는)을 인식할 수 있고, 보복할 수 있다. 따 라서, 상태(1202B3)에서, 어셈블리(1201Y)는 짧은-기질의 이웃하는 에이전트가 어셈블리(1201Y)에서 사용 하기 위해 그것의 어셈블리(1201Z)로부터 구성요소들을 훔친 이동 에이전트에 물리적으로 그리고 보 복적으로 응답할 때 잠재적인 출력을 해체하거나 파괴하였다. 상태들(1202A3 및 1202B3)의 비교는 이동 에이전트들의 계획 및 수행 활동들로의 물리적 이벤트들에 응답 한 감정 시스템의 도입이 어떻게 물리적 환경에서의 이벤트들의 코스를 교체할 수 있는지를 예시한다. 상태 (1202A3)는 계획된 종료 상태를 단독으로 달성하여 집중되는 프로세스들을 고수하는 시스템의 종료 상태이다. 상태(1202B3)는 이동 에이전트들에 주어진 감정 기질들이 그것들의 개별적인 작업들의 계획 수행에 영향을 주도록 허용되는 경우를 나타낸다. 상태(1202A3)에서, 구성요소들에 대한 이동 에이전트의 요청을 만 족하는 사용자에 있어서의 지연은 구성요소들을 대한 이동 에이전트의 의도된 사용의 수행을 단지 지 연시킬 가능성이 있을 수 있다. 그에 반해, 상태(1202B3)에서, 이동 에이전트는 절제 및 공감의 약한 관념 및 조급과 같은 감정 성격들을 디스플레이한다; 이는 상태(1202A3)에서 달성되는 목적에서 더 멀리 떨어진 상태(1202B3)로 이어지는 이벤트들을 유발한다. 적어도 일 실시예에서, 이동 에이전트들은 많은 상이한 형태를 가정할 수 있고 또한 특화된 역할들을 가정 할 수 있다; 예를 들어, 이동 에이전트는 감독의 주요 역할을 가질 수 있다. 하나의 성능에서, 그러한 감 독은 개별적인 에이전트들의 성능에 관해 특히 복잡한 작업에 개입되는 많은 이동 에이전트의 조정에 유용할 수 있다. 적어도 일 실시예에서, 감독 역할을 하는 이동 에이전트들은 에이전트들 중 하나 이 상이 변덕스러운 경향들을 낼 수 있는 성격 프로필들을 가지는 경우 잠재적으로 중요한 역할, 하나 또는 양자의 액션들에 대한 논란에 빠질 수 있는 이동 에이전트들에 진압 또는 교정 효과를 제공할 수 있다. 에이전트는 임의의 적합한 수단에 의해 감독 역할을 수행할 수 있다; 예를 들어, 그것은 동일한 공간 내 또는 공동 작업에서 작업하는 에이전트들의 팀에 대한 가시선 및/또는 물리적 접근에 기초하여 다른 에이 전트들의 행동을 관측할 수 있다. 상기에서 논의된 바와 같이, 적어도 일 실시예에서, 시스템은 공간에서 에이전트의 위치를 추적하는 가상 모델을 유지한다; 그에 따라, 시스템은 감독 에이전트가 에이전트 들의 잠재적으로 변덕스러운 그룹의 임계 문턱 거리 내에 있는지를 결정하기 위해 그러한 모델을 사용할 수 있다. 다른 기술들이 또한 예를 들어 거리에 따라 달라지는 감독 에이전트의 유효성에 개연성을 부여함 으로써, 또는 가시선을 갖는 거리를 조합함으로써 사용될 수 있고, 따라서 감독 에이전트의 다른 것들 및 잠재적으로 다루기 힘들거나 충돌하는 에이전트들 사이에서 순서를 유지하는 능력은 감독 에이전트가 그것 의 시야 내 감독하에 있는 에이전트들을 가지는지 및 근접성 양자에 따른다. 개연성에 의거한 결정들은 또한 행 동을 취하는 경향이 있을 수 있는 에이전트의 기질과 같은, 추가적인 요소들을 감안할 수 있다; 보다 변덕 스러운 상태들에 있을 수 있는 에이전트들은 감독 에이전트의 상대적인 근접에도 불구하고 행동을 취 할 가능성이 보다 많을 수 있다. 이 방식에서, 안 좋게 행동하는 인간들의 고정유형에 대한 유사성들이 분명해 진다: 에이전트는 감독 에이전트가 충분히 멀리 떨어지거나 다르게 효과적으로 감독할 수 없는 경우 (예를 들어, 그것이 적정하게 근접하나 주의의 집중(예를 들어, 카메라 또는 영상 장비 또는 에이전트의 일반적 인 배향)이 다른 곳을 향하는 경우) 다른 에이전트에 대해 부정적인 행위들 또는 행동을 나타낼 가능성이 보다 많을 수 있다. 본 출원에 제공된 설명들에서, 용어 \"감정\"은 이동 에이전트의 그것의 의도된 작업의 중요한 부분일 가능 성이 없는 액션들 및 표현들에 관한 다양한 양상들을 포함한다. 이것들은 예를 들어, 만족 또는 좌절의 표시들 을 포함할 수 있거나, 그것들은 계획된 이벤트들 동안 직접적인 물리적 결과를 지니는 방법으로 그것들 자체를 나타낼 수 있다. 예를 들어, 도 12와 관련하여 위에서 설명된 바와 같이, 호의적이지 않은 반응들은 의도된 작 업 또는 일련의 작업들의 진행을 방해할 수 있다. 따라서, 적어도 일 실시예에서, 시스템은 덜 예측가능하고 그 에 따라 특히 가변적인 성격들의 다수의 이동 에이전트가 작업의 사업에 참여하고 있을 때, 보다 놀랍고 흥미로운 특정한 작업들의 구현을 이룰 수 있다. 위에서 설명된 바와 같이, 일부 상황들에서, 에이전트-간 성격 충돌들은 원하는 목적을 향한 진행을 당혹스럽게 만들 수 있다. 다른 상황들에서, 성격들을 가지는 에이전트들 간 상호작용들이 유익하거나 해로울 수 있는 비-대립적 시나리오들이 발생할 수 있다. 예를 들어, 조급하고 무분별한 강한 성격들이 주어지는 이동 에이전트 들은 보다 높은 속도로 구성요소들을 수송할 수 있고 그것들은 덜 신중하게 배치할 수 있다. 결과는 과도한 서두름 및 부주의함으로부터 초래되는 이벤트들(또는 다른 파괴 이벤트들)의 붕괴로 인한 보다 느린 구 축, 또는 구조의 보다 빠른 완료일 수 있다. 게다가, 작업면의 주변 에지를 너머 굴러 떨어지는 구성요소를 야기하는 어셈블리 붕괴와 같은, 위험한 기 회들을 겪게 하는 상황들을 또한 고려할 수 있다. 이전에 논의된 바와 같이, 이동 에이전트들은 작업면 에 기초한 위치확인을 보충하기 위한 랜드마크들로서 구성요소 면들을 사용할 수 있다. 이 경우, 이 동 에이전트는 정도를 벗어난 구성요소를 쫓아 작업면의 경계들을 떠나서, 네비게이션을 위해 구성요소 면에 그리고 마찬가지로 왕복 트립 상의 네비게이션을 위해 작업면 상의 구성요소들에 의존 할 수 있다. 그러나, 네비게이션가능한 표면의 성질이 이동 에이전트에 알려지지 않았기 때문에 작업면을 떠나는 것은 상당한 위험을 겪게 한다. 따라서, \"대담한\" 이동 에이전트(무분별한, 절제되지 않은 그리고 변덕스러운 특성들의 일부 강한 조합을 가지는 것과 같은)는 작업면을 떠나 위험을 무릅쓰고 갈 수 있고 성공적으로 복귀하거나 프로세스 중에 손실될 수 있다. 보다 순종적이고 신중한 이동 에이전트들은 구성요 소를 검색하기 위한 사용자로부터의 도움을 요청할 수 있거나, 구성요소를 작업면을 떠나 위험 을 무릅쓰고 가기보다는, 도달불가능한 것으로 여길 수 있다. 적어도 일 실시예에서, 이동 에이전트들은 그것들의 \"경험들\"과의 연계들을 학습하거나 발전시킬 수 있고, 계획 및 감정 반응들과 조합하여, 그것들의 후속 액션들에 그러한 연계들을 적용할 수 있다. 이 방식에서, 그러 한 학습은 시스템 구성요소들 사이에 통신 및 구성요소 위치확인의 상기-설명된 성능들을 추가한다. 감정 반응을 구술하는 기능들뿐만 아니라, 작업면 상의 모든 구성요소에 대한 작업 지식은 의미있는 방법으로 학습하기 위한 기능 시스템을 건립하기 위해 강력한 기반과 결합한다. 이런 점에서, 학습은 기술들의 상황을 가정할 수 있다. 예를 들어, 적어도 일 실시예에서, 처음으로 배치되는 이동 에이전트들은 의도적으로 제한되는 구성요소들 을 조작 및 수송하기 위한 성능을 가질 수 있다. 일정한 시간의 기간 후, 에이전트들은 그것들의 기 술 세트가 예를 들어 누적 동작 시간 또는 반복되는 단순한 액션들의 횟수에 기초하여, 증가하게 하는 경험을 획득할 수 있다. 적어도 일 실시예에서, 이동 에이전트의 기술 세트가 확장되는 비율은 사용자가 그것들이 건립하는 디자인들을 발전시키는데 있어서 에이전트의 성능들의 제한들을 얼마나 밀고 나가는지에 직접적 으로 결부될 수 있다. 적어도 일 실시예에서, 미래 행위는 이동 에이전트들의 과거의 특정 이벤트들에 결부될 수 있다. 예를 들 어, 에이전트는 과거 경험에서, 붕괴와 같은 호의적이지 않은 이벤트를 야기한 어셈블리 단계에서 매우 신 중하게 진행할 수 있다. 적어도 일 실시예에서, 에이전트는 예를 들어, 과거의 대담한 액션들이 호의적인 또는 호의적이지 않은 결과들로 이어진 정도에 기초하여 위험들을 취하도록 그것의 경향을 조절함으로써, 과거 경험으로부터 학습할 수 있다. 적어도 일 실시예에서, 에이전트들은 서로 친밀감 및 관계들을 가질 수 있고, 따라서 제1 에이전트의 경험들은 제1 에이전트가 친밀감 또는 관계를 가지는 그러한 에이전트(들)과 같은, 다른 에이전트 (들)의 미래 행위에 영향을 줄 수 있다. 학습은 또한 감성 반응의 영역에서의 이동 에이전트들의 미래 행위를 알리거나 그에 영향을 미치도록 적용 될 수 있다. 하나의 이동 에이전트가 제2 이동 에이전트의 어셈블리로부터 구성요소들을 훔친, 도 12에 도시된 예로 돌아가: 제1 이동 에이전트가 제2 이동 에이전트(104의 반응)(제1 이동 에이전트 의 어셈블리를 쓰러뜨리는)을 보면, 제1 이동 에이전트는 이후 접촉들에 있어서 제2 이동 에이전트 의 존재시 그것의 행위를 변화시킬 수 있다. 사실, 양 에이전트들은 예를 들어 서로 협력하는 것에 대한 반항 또는 심지어 서로를 향한 반감 또는 분개의 정도를 시뮬레이션하기 위해, 이전 상호작용에 기초하여 서로에 대해 그것들의 미래 행위를 변화시킬 수 있다. 적어도 일 실시예에서, 그러한 행위가 매니페스트를 변화시키는 정도는 그것들의 특성들에 기초한 응답을 결정 하는 에이전트의 성격들 및 기능들에 귀속되는 특성들에 따를 수 있다. 높은 인내도를 갖는 이동 에이전트 는 예를 들어, 적어도, 이전에 그것의 동작을 방해한 이동 에이전트와의 후속 접촉에 있다면, 그것의 행위를 매우 약간 바꿀 수 있다. 인내심이 덜한 에이전트는 다른 에이전트에 의해 취해지는 부정 액 션에 보다 빠르게 반응할 수 있다. 또한, 적어도 일 실시예에서, 새로운 경험들은 배치들을 이동시킬 수 있고 단일 이벤트의 효과들은 반복에 의해 강화되지 않고 제 시간에 사라질 수 있다."}
{"patent_id": "10-2015-7033682", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 16, "content": "상기 설명 및 참조된 도면들은 가능한 실시예들에 대하여 특정한 세부사항들을 제시한다. 해당 기술분야의 통산 의 기술자들은 다른 실시예들이 가능하다는 것을 인식할 것이다. 먼저, 구성요소들의 특정한 명명, 용어들의 대 문자화, 속성들, 데이터 구조들, 또는 임의의 다른 프로그래밍 또는 구조적 측면은 필수적이거나 중요하지 않고, 본 출원에서 설명된 메커니즘들은 상이한 명칭들, 포맷들, 또는 프로토콜들을 가질 수 있다. 또한, 시스 템은 하드웨어 및 소프트웨어의 조합을 통해, 또는 완전히 하드웨어 요소들로, 또는 완전히 소프트웨어 요소들 로 구현될 수 있다. 또한, 본 출원에서 설명된 다양한 시스템 구성요소들 간 기능의 특정한 분산은 단지 예시적 인 것이고, 필수적인 것이 아니다; 단일 시스템 구성요소에 의해 수행되는 기능들은 대신 다수의 구성요소에 의 해 수행될 수 있고, 다수의 구성요소에 의해 수행되는 기능들은 대신 단일 구성요소에 의해 수행될 수 있다. \"일 실시예\" 또는 \"실시예\"에 대한 설명의 언급은 실시예들과 관련하여 설명된 특정한 피처, 구조, 또는 특성이 적어도 일 실시예에 포함된다는 것을 의미한다. 설명서에서의 다양한 위치들에서의 절들 \"일 실시예에서\" 또는 \"적어도 일 실시예에서\"의 출현은 반드시 동일한 실시예를 참조하는 전부는 아니다. 몇몇 실시예는 단독으로 또는 임의의 조합으로, 상기-설명된 기술들을 수행하기 위한 시스템 또는 방법을 포함 할 수 있다. 다른 실시예들은 컴퓨팅 디바이스 또는 다른 전자 디바이스에서의 프로세서가 상기-설명된 기술들 을 수행하게 하기 위해, 매체 상에 인코딩된, 컴퓨터 프로그램 코드 및 비-일시적 컴퓨터-판독가능한 저장 매체를 포함하는 컴퓨팅 프로그램 제품을 포함할 수 있다. 상기의 일부 부분들은 컴퓨팅 디바이스의 메모리 내 데이터 비트들 상의 동작들의 알고리즘들 및 상직적 표현들"}
{"patent_id": "10-2015-7033682", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 17, "content": "의 면에서 제공된다. 이들 알고리즘 설명들 및 표현들은 해당 기술분야의 다른 기술자들에게 그들의 작업의 본 질을 최대한 효과적으로 전달하기 위해 데이터 프로세싱 분야들에서의 통상의 기술자들에 의해 사용되는 수단이 다. 알고리즘은 여기에, 그리고 일반적으로, 설명된 결과로 이어지는 단계들(명령들)의 자기-모순이 없는 시퀀 스이도록 구상된다. 단계들은 물리량들의 물리적 조작들을 필요로 하는 것들이다. 보통, 필수적이지는 않지만, 이들 수량들은 저장, 수송, 조합, 비교 및 다르게 조작될 수 있는 전기, 자기 또는 광학 신호들의 형태를 취한 다. 때로는, 주로 일반적인 용법을 이유로, 이들 신호들을 비트들, 값들, 요소들, 심볼들, 문자들, 용어들, 수 들, 또는 기타로 나타내는 것이 편리하다. 또한, 때로는, 일반성을 잃지 않고, 모듈들 또는 코드 디바이스들로 서 물리량들의 물리적 조작들을 필요로 하는 단계들의 특정한 배열들을 나타내는 것이 편리하다. 그러나, 모든 이들 및 유사한 용어는 적절한 물리량들과 연관되는 것이고 단지 이들 수량들에 적용되는 편리한 라벨들인 것을 명심해야 한다. 다음 논의로부터 명백할 바와 같이 구체적으로 다르게 언급되지 않는 한, 명세서 전반에 걸쳐, \"프로세싱\" 또는 \"컴퓨팅\" 또는 \"산출\" 또는 \"디스플레이\" 또는 \"결정\" 또는 기타와 같은 용어들 을 활용하는 논의들은, 컴퓨터 시스템 메모리들 또는 레지스터들 또는 다른 그러한 정보 저장장치, 전송 또는 디스플레이 디바이스들 내 물리(전자)량들로서 표현되는 데이터를 조작 및 변환하는, 컴퓨터 시스템, 또는 유사 한 전자 컴퓨팅 모듈 및/또는 디바이스의 액션 및 프로세스들을 나타낸다는 것이 이해된다. 특정한 측면들은 알고리즘의 형태로 본 출원에서 설명된 프로세스 단계들 및 명령들을 포함한다. 프로세스 단계 들 및 명령들은 소프트웨어, 펌웨어 및/또는 하드웨어로 구현될 수 있고, 소프트웨어로 구현될 때, 다양한 운영 시스템에 의해 사용되는 상이한 플랫폼들 상에 존재하고 그것들에서 작동되도록 다운로드될 수 있다. 몇몇 실시예는 본 출원에서의 동작들을 수행하기 위한 장치에 관한 것이다. 이 장치는 특히 요구된 목적들을 위 해 구축될 수 있거나, 그것은 컴퓨팅 디바이스에 저장된 컴퓨터 프로그램에 의해 선택적으로 활성화 또는 재구 성되는 범용 컴퓨팅 디바이스를 포함할 수 있다. 그러한 컴퓨터 프로그램은 이들에 제한되지는 않으나, 플로피 디스크들, 광 디스크들, CD-ROM들, DVD-ROM들, 자기-광 디스크들, 판독-전용 메모리들(ROM들), 랜덤 액세스 메 모리들(RAM들), EPROM들, EEPROM들, 플래시 메모리, 고체 상태 드라이브들, 자기 또는 광 카드들, 애플리케이션 특정 집적 회로들(ASIC들)을 포함하는 임의의 유형의 디스크, 또는 전자 명령들을 저장하기에 적합하고 각각 컴 퓨터 시스템 버스에 결합되는 임의의 유형의 매체와 같은, 컴퓨터 판독가능한 매체에 저장될 수 있다. 또한, 본 출원에서 언급되는 컴퓨팅 디바이스들은 단일 프로세서를 포함할 수 있거나 증가된 컴퓨팅 성능을 위해 다수의 프로세스 디자인들을 채용하는 아키텍처들일 수 있다. 본 출원에 제공되는 알고리즘들 및 디스플레이들은 임의의 특정한 컴퓨팅 디바이스, 가상화된 시스템, 또는 다 른 장치와 본질적으로 관련되지 않는다. 다양한 범용 시스템들은 또한 본 출원의 기술들과 함께 프로그램들을 이용하여 사용될 수 있거나, 그것은 요구된 방법 단계들을 수행하기 위해 보다 특화된 장치를 구축하기에 편리 한 것으로 드러날 수 있다. 다양한 이들 시스템들에 대해 요구된 구조는 본 출원에 제공된 설명으로부터 명백할 것이다. 또한, 본 출원에 제시된 시스템 및 방법은 임의의 특정한 프로그램 언어를 참조하여 설명되지 않는다. 다양한 프로그래밍 언어들이 본 출원에 설명된 기술들을 구현하는데 사용될 수 있고, 특정한 언어들에 대한 상 기 임의의 언급들은 단지 예시적인 목적들을 위해 제공된다는 것이 이해될 것이다. 따라서, 다양한 실시예들은 컴퓨터 시스템, 컴퓨팅 디바이스, 또는 다른 전자 디바이스, 또는 그것들의 임의의 조합 또는 복수를 제어하기 위한 소프트웨어, 하드웨어, 및/또는 다른 요소들을 포함할 수 있다. 그러한 전자"}
{"patent_id": "10-2015-7033682", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 18, "content": "디바이스는 예를 들어, 해당 기술분야에 잘 알려진 기술들에 따른, 프로세서, 입력 디바이스(키보드, 마우스, 터치패드, 트랙패드, 조이스틱, 트랙볼, 마이크로폰, 및/또는 그것들의 임의의 조합과 같은), 메모리, 장기 저 장장치(자기 저장장치, 광 저장장치, 및/또는 기타와 같은), 및/또는 네트워크 연결성을 포함할 수 있다. 그러 한 전자 디바이스는 휴대용 또는 비-휴대용일 수 있다. 사용될 수 있는 전자 디바이스들의 예들은 이동 전화, 개인 디지털 보조장치, 스마트폰, 키오스크, 서버 컴퓨터, 기업 컴퓨팅 디바이스, 데스크탑 컴퓨터, 랩탑 컴퓨 터, 태블릿 컴퓨터, 소비자 전자 디바이스, 또는 기타를 포함한다. 본 출원에 설명된 시스템 또는 방법을 구현 하기 위한 전자 디바이스는 예를 들어 그리고 제한 없이: 리눅스; 워싱턴, 레드몬드의 마이크로소프트사로부터 이용가능한, 마이크로소프트 윈도우즈; 캘리포니아, 쿠퍼티노의 애플사로부터 이용가능한, 맥 OS X; 캘리포니아, 쿠퍼티노의 애플사로부터 이용가능한, iOS; 캘리포니아, 마운틴 뷰의 구글사로부터 이용가능한, 안 드로이드; 및/또는 디바이스 상의 사용을 위해 채택되는 임의의 다른 운영 시스템과 같은 임의의 운영 시스템을"}
{"patent_id": "10-2015-7033682", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 19, "content": "사용할 수 있다.제한된 수의 실시예들이 본 출원에 설명되지만, 상기 설명의 혜택을 가지는, 당해 기술분야의 통상의 기술자들 은 청구항들의 범위에서 벗어나지 않는 다른 실시예들이 창안될 수 있다는 것을 이해할 것이다. 또한, 본 명세 서에 사용되는 언어는 주로 가독성 및 교수적 목적들을 위해 주로 선택되었고, 발명의 청구 대상을 물질을 상세 하게 기술하거나 제한하도록 선택된 것이 아닐 수 있다는 것이 주의되어야 한다. 따라서, 본 발명은 예시적이나, 제한하지 않는 것으로 의도된다."}
{"patent_id": "10-2015-7033682", "section": "도면", "subsection": "도면설명", "item": 1, "content": "첨부한 도면들은 몇몇 실시예를 예시한다. 설명과 함께, 그것들은 실시예들의 원리들 및 운용상 역학을 설명하"}
{"patent_id": "10-2015-7033682", "section": "도면", "subsection": "도면설명", "item": 2, "content": "기 위해 제공된다. 해당 기술분야의 통상의 기술자는 도면들에 예시된 특정한 실시예들이 단지 대표적이고, 범 위를 제한하도록 의도되지 않는다는 것을 인식할 것이다. 도 1은 일 실시예에 따른 이동 에이전트를 도시하는 블록도이다. 도 2는 일 실시예에 따라, 일반적인 성격 유형에 따른 행위들을 알리는 응답들 및 파라미터들의 세트를 도시하 는 표이다. 도 3은 일 실시예에 따라, 대립하는 성격들 사이 척도로 지점들에 관하여 정의될 수 있는 감정 성격들의 세트를 도시하는 표이다. 도 4는 일 실시예에 따라 몇몇 구성요소 유형의 성격들일 수 있는 피처들의 예들을 도시한다. 도 5는 일 실시예에 따라, 각 면 상의 중심에 위치된 직사각형 리세스 및 각 에지로부터의 원형 리세스 오프셋 을 갖는 블럭 구성요소의 예를 도시한다. 도 6은 다양한 실시예들에 따라, 다수의 배향으로부터 판독되도록 설계되는 마크들로 제시되는 기계-판독가능한 코드들의 예들을 도시한다. 도 7a 내지 도 7c는 다양한 실시예들에 따라, 그것들이 블럭과 같은 큐브-형 구성요소의 면 상에 보일 수 있을 때 기준 마크들의 예들을 도시한다. 도 8은 일 실시예에 따라, 이동 에이전트들이 가상 상태 및 물리적 상태 간 패리티를 유지하기 위해 지속적으로 채용할 수 있는 방법을 도시하는 흐름도이다. 도 9는 일 실시예에 따라, 두 개의 이동 에이전트가 어느 하나의 단부로부터 각각 물리 부하를 체결하고 들어올 리며 그것들의 공유 화물을 위해 의도된 위치로 조정하여 이동하는 예를 도시한다.도 10은 일 실시예에 따라, 이동 에이전트가 사용자로부터의 구성요소를 요청하는 시나리오를 도시하는 흐름도 이다. 도 11은 일 실시예에 따라, 이동 에이전트가 사용자로부터의 구성요소를 요청하는 시나리오를 도시하는 흐름도 이며, 여기서 이동 에이전트는 감정 상태들을 나타낼 수 있다. 도 12는 일 실시예에 따라, 이동 에이전트가 구축의 다양한 상태들에 있는 동안 사용자로부터의 구성요소를 요 청하는 예들을 도시한다. 도 13은 일 실시예에 따른 구현 아키텍처를 도시하는 블록도이다. 도 14는 일 실시예에 따라, 기계-판독가능한 코드를 갖는 작업면의 예를 도시한다. 도 15는 다양한 실시예들에 따라, 배향 지표들을 포함하는 기계-판독가능한 코드들의 예들을 도시한다. 도 16은 다양한 실시예들에 따라, 가변적 코드 라인들의 예들을 도시한다. 도 17은 다양한 실시예들에 따라, 기계-판독가능한 코드들의 예들을 도시한다. 도 18은 일 실시예에 따라, 작업면 상의 구성요소들을 조작하는 몇몇 이동 에이전트의 예를 도시한다. 도 19는 일 실시예에 따라, 혼합된 코드 유형들을 가지는 작업면의 예를 도시한다. 도 20은 다양한 실시예들에 따라, 코드 유형들의 추가적인 예들을 도시한다."}
