{"patent_id": "10-2023-0025351", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0131818", "출원번호": "10-2023-0025351", "발명의 명칭": "연합 학습 모델 기반의 지능형 디지털 트윈 시스템 및 그 운영 방법", "출원인": "제주대학교 산학협력단", "발명자": "김도현"}}
{"patent_id": "10-2023-0025351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "연합 학습 모델 기반의 지능형 디지털 트윈 시스템의 운영 방법에 있어서,물리적 공간과 사이버 공간 객체의 학습 모델을 동기화하기 위하여 사이버 공간에서 물리적인 현실 공간의 사물에 대응하는 객체를 상호 연결하는 제1 단계;상기 사이버 공간의 객체를 통해 상기 물리적 공간의 환경 및 상황을 인식하고 주변 환경을 제어하기 위하여 상기 물리적 공간의 사물의 데이터와 학습 모델을 상기 사이버 공간으로 전송하고 이를 수신하는 제2 단계;상기 전송 및 수신된 데이터를 통해 상기 디지털 트윈 시스템에서 각각의 물리적 사물 내에서 생성된 학습 모델을 상기 사이버 공간에서 해당하는 사이버 객체와 연결한 네트워크를 가상화하고, 학습 모델 및 수행 결과를 가시화하고 공유 및 관리하는 제3 단계; 및상기 공유한 학습 모델들을 조합하고 연합 학습 모델을 생성하여 효과적으로 시뮬레이션, 추론 및 예측을 수행하고, 상기 물리적 공간의 사물에 다시 상기 연합 학습 모델을 재배포하여 향상된 상황 인지 및 환경 제어를 수행할 수 있도록 지원하는 제4 단계;를 포함하는 것을 특징으로 하는 연합 학습 모델 기반의 지능형 디지털 트윈 운영 방법."}
{"patent_id": "10-2023-0025351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 제2 단계는, 연합 학습을 수행하는 적어도 하나 이상인 복수의 물리적 공간의 사물이 상기 물리적 공간의로컬 데이터를 학습하고 학습된 모델의 매개변수를 데이터 공유 프로토콜을 통해 상기 사이버 공간의 연합 서버와 복수의 학습 모델을 공유하는 단계; 및상기 사이버 공간의 연합 서버가 상기 복수의 연합 물리적 공간의 사물의 속성이 반영되어 동기화된 가상 객체를 제공하고, 전송받은 매개변수와 모델들 중에서 최적의 모델을 선택하기 위해 상기 물리적 공간 및 사이버 공간 각 객체의 학습 모델을 상호 동기화하는 단계;를 포함하는 것을 특징으로 하는 연합 학습 모델 기반의 지능형 디지털 트윈 운영 방법."}
{"patent_id": "10-2023-0025351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,상기 제2 단계는, 상기 물리적 공간의 연합 물리적 공간의 사물은 딥러닝 모델을 이용하여 로컬 데이터를 학습하고 학습된 모델의 정보를 데이터 공유 프로토콜을 통해 상기 연합 서버에 전송하고, 상기 사이버 공간의 연합서버는 상기 물리적 공간의 사물 객체의 데이터와 학습 모델에 해당하는 매개변수와 그라디언트 정보를 수신하는 단계;를 포함하는 것을 특징으로 하는 연합 학습 모델 기반의 지능형 디지털 트윈 운영 방법."}
{"patent_id": "10-2023-0025351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서,상기 제3 단계는, 상기 사이버 공간의 연합 서버에서 각각의 물리적 객체 내에서 생성된 학습 모델로부터 가상공개특허 10-2024-0131818-3-화 속성을 활용하여 연합 학습 참여를 수행할 수 있도록 학습 모델을 가상화하고 관리하는 단계;를 포함하는 것을 특징으로 하는 연합 학습 모델 가상화 기반의 지능형 디지털 트윈 운영 방법."}
{"patent_id": "10-2023-0025351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서,상기 제3 단계는, 상기 사이버 공간의 연합 서버에서 학습 모델의 상태를 모니터링 하는 단계 및 학습 모델의설정 파라미터를 세팅하는 단계를 포함하며, 이때 상기 물리적 공간의 사물의 가상 객체를 통해 상기 연합 물리적 공간의 사물의 로컬 및 글로벌 성능을 모니터링하고 학습 프로세스를 제어하며, 상기 연합 물리적 공간의 사물로부터 수신된 모델 매개변수(weights) 및그라디언트(gradients) 정보의 파라미터를 세팅하는 것을 특징으로 하는 연합 학습 모델 기반의 지능형 디지털트윈 운영 방법."}
{"patent_id": "10-2023-0025351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 1에 있어서,상기 제3 단계는, 상기 사이버 공간의 연합 서버에서 상기 연합 물리적 공간의 사물의 성능 결과 테이블과 성능메트릭을 디지털 트윈 환경에서 시각화하여 어플리케이션을 통해 제공하는 단계;를 포함하는 것을 특징으로 하는 연합 학습 모델 기반의 지능형 디지털 트윈 운영 방법."}
{"patent_id": "10-2023-0025351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 1에 있어서,상기 제4 단계는, 상기 사이버 공간의 연합 서버에서 학습 모델을 이용하여 시뮬레이션 하는 단계 및 학습 모델을 이용한 예측을 수행하는 단계를 포함하며,상기 사이버 공간의 연합 서버는 상기 시뮬레이션 및 예측 결과를 바탕으로 최적의 학습 모델을 선택하고, 선택된 최적의 글로벌 모델을 상기 연합 물리적 공간의 사물로 제공하는 것을 특징으로 하는 연합 학습 모델 기반의지능형 디지털 트윈 운영 방법."}
{"patent_id": "10-2023-0025351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "연합 학습 모델 기반의 지능형 디지털 트윈 시스템에 있어서,물리적 공간과 사이버 공간에서의 학습 모델의 동기화를 위하여 사이버 공간에서 물리적인 현실 공간의 사물에대응하는 객체를 동일하게 설정하는 사이버 공간의 연합 서버;상기 사이버 공간의 객체를 통해 상기 물리적 공간의 환경 및 상황을 인식하고 주변 환경을 정밀하게 제어하기위하여 상기 물리적 공간의 사물의 데이터를 상기 연합 서버로 전송하는 물리적 공간의 복수의 사물;를 포함하며,상기 연합 서버는 상기 수신된 물리적 사물의 데이터를 통해 디지털 트윈 시스템에서 각각의 물리적 사물에서생성된 학습 모델을 상기 사이버 공간에서 학습하고 공유 및 관리하며, 상기 공유한 복수의 학습 모델들을 조합하여 성능을 향상시키고 상기 물리적 공간의 사물에 다시 재배포하여 향상된 상황 인지 및 환경 제어를 수행하는 것을 특징으로 하는 연합 학습 모델 기반의 지능형 디지털 트윈 시스템."}
{"patent_id": "10-2023-0025351", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 연합 학습 모델 기반 지능형 디지털 트윈 시스템 및 운영 방법에 관한 것으로, 물리적 공간과 사이버 공간 객체의 학습 모델을 동기화하기 위하여 사이버 공간에서 물리적인 현실 공간의 사물에 대응하는 객체를 상 호 연결하는 제1 단계, 사이버 공간의 객체를 통해 물리적 공간의 환경 및 상황을 인식하고 주변 환경을 제어하 (뒷면에 계속)"}
{"patent_id": "10-2023-0025351", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 연합 학습 모델 기반의 지능형 디지털 트윈 시스템 및 그 운영 방법에 관한 것으로, 보다 상세하게는 원격으로 배포된 물리적 공간의 사물과 해당 학습 프로세스를 가상으로 모니터링하고 제어하기 위한 학습 모델 기반의 지능형 디지털 트윈 시스템 및 방법에 관한 것이다. 보다 상세하게는, 사이버 공간에서 현실 공간의 객체(장치)를 동일하게 가지면서 이들 사이버 공간의 객체를 통 해 효과적으로 물리 공간의 상황을 정확하게 인식하고, 주변 환경을 정밀하게 제어하기 위해 각 물리 객체에서 기계학습 프로그램을 이용하여 학습 모델을 생성한 후에, 이것을 사이버 공간의 서버에 전달하여 여러 물리 객 체의 사이버 객체의 학습 모델을 상호 동기화하여 공유 관리한다. 복수의 학습 모델을 융합 처리한 연합 학습 모델을 기반으로 보다 효과적으로 시뮬레이션, 추론 및 예측을 수행하며, 이를 위해 물리 객체와 사이버 객체를 상호 연결하고, 이들을 연결한 객체의 네트워크를 가상화하고, 학습 모델을 동기화하고, 객체, 네트워크, 학습 모델 및 수행 결과 등을 가시화하고, 시뮬레이션, 추론 및 예측을 수행하는 지능형 디지털 트윈 시스템을 제공 하고자 한다."}
{"patent_id": "10-2023-0025351", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공 지능(Artificial Intelligence: AI)이 비약적으로 발전하고 있다. AI는 무인 자동차, 금융 및 의료를 포함 하여 더 복잡한 문제를 해결할 수 있는 잠재력을 보여준다. 그러나 AI는 복잡한 문제를 해결하기 위해 빅 데이 터가 필요한다. 예를 들어, AlphaGo는 우수한 결과를 얻기 위해 300,000개의 게임을 훈련하였다. 또한 데이터는 고립되어 있으므로 대부분의 경우 중앙 엔터티에 데이터를 융합하기 어렵다. 이에 Gossip Learning(GL), Swarm Learning(SL) 및 Federated Learning(FL)을 포함한 다양한 솔루션을 제안되었다. Gossip Learning은 서버리스(severless)이며, 모든 물리적 공간의 사물이 P2P 방식으로 서로 연결된 학습을 배 포한다. 각 물리적 공간의 사물에는 네트워크의 다른 노드와 공유되지 않는 자체 로컬 데이터가 있다. 학습된 모델은 각 물리적 공간의 사물에서 브로드캐스트되고, 다른 물리적 공간의 사물은 다른 집계 전략을 사용하여 모델을 수신하고 업데이트한다. Swarm Learning(SL)은 각 노드가 자체 로컬 모델을 훈련하고 네트워크의 다른 노드와 공유하는 분산형 협업 모 델 훈련 전략이기도 하다. PSO(Particle Swarm Optimization)와 마찬가지로 SL에서는 각 노드를 입자로 취급하 고 하나의 글로벌 모델을 찾는다. Federated Learning(FL)의 경우에는 집계 프로세스가 서버에서 수행되며 글로벌 모델이 서버와 공유된다. 이에 수신된 모델을 연합 환경에서 융합하기 위한 다양한 집계 기법이 제안되었다. 한편, DT(Digital Twin)는 물리적 장치의 가상 객체를 생성하고 물리적 IoT 환경을 제어 및 모니터링함으로써 IoT에서 중요한 역할을 한다. 가상화 기능으로 인해 산업용 IoT(IIoT)에서 디지털 트윈의 사용이 증가하고 있다. 기존에는 디지털 트윈이 IIoT에 사용되는 물리적 장치의 특성을 캡처할 수 있도록 IIoT용 적응형 연합 학 습이 제안된 바 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 등록특허공보 제10-2448724호(2022.09.29)"}
{"patent_id": "10-2023-0025351", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 원격으로 배포된 물리적 공간의 사물과 해당 학습 프로세스를 가상으로 모니터링하고 제어하기 위한 학습 모델을 제안하며, 디지털 트윈 기반 연합 학습(Digital Twin based Federated Learning: DT-FL) 프레임워크를 제안하고자 한다. 보다 구체적으로, 본 발명에 따르면 현실 공간의 객체(사물) 또는 장치를 사이버 공간에서도 동일하게 가지고 사이버 공간상의 객체를 통해 효과적으로 물리 공간의 상황을 인식하고 주변 환경을 제어하는 디지털 트윈에서, 각 물리적 객체 내에 기계학습 프로그램을 통해 학습 모델을 생성하고, 이것을 사이버 공간에 전달하여 동일한 여러 사이버 객체의 학습 모델을 공유하고 관리하며, 더불어 공유한 학습 모델들을 조합하여 성능을 향상시켜 물리적 객체에 다시 재배포하여 향상된 상황 인지 및 환경 제어를 수행할 수 있도록 지원하고자 한다. 즉, 데이터와 객체의 디지털 트윈뿐만 아니라 “학습 모델의 디지털 트윈”을 통해 물리 공간의 학습 모델과 사 이버 공간의 학습 모델을 상호 동기화 시킬 수 있는 것이다. 본 발명은 디지털 트윈의 가상화 속성을 활용하여 장치의 동적 등록 및 연합 학습 참여를 수행할 수 있도록 하 고, 각 장치는 디지털 트윈 환경에 가상 객체를 가지고 있으며, 가상 객체는 물리적 객체의 모든 속성을 반영한 다. 본 발명은 디지털 트윈에서 협력 연합 학습을 지원하고, 학습 프로세스는 디지털 트윈에서 모니터링하고 제어할 수 있도록 하며, 예측 결과와 성능 메트릭은 디지털 트윈의 대화형 웹 애플리케이션을 통해 시각화 하여 제공된 다. 본 발명에서 디지털 트윈의 장치에서 협력 연합 학습 서버로의 모델 전송은 IoT 연결에 의해 수행되도록 하며, 다른 제어 명령 및 모니터링 정보는 HTTP 프로토콜에 의해 송수신 된다. 본 발명에서는 물리 객체와 사이버 객체와 상호 연결하고, 이들을 연결한 객체의 네트워크를 가상화하고, 객체, 네트워크, 학습 모델 및 수행 결과 등을 가시화하고, 학습 모델을 동기화하고, 시뮬레이션, 추론 및 예측을 수 행하는 지능형 디지털 트윈 시스템 프레임워크를 제공한다."}
{"patent_id": "10-2023-0025351", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명은 전술한 문제를 해결하기 위해 안출된 것으로서, 연합 학습 모델 기반의 지능형 디지털 트윈 시스템의 운영 방법에 있어서, 물리적 공간과 사이버 공간 객체의 학습 모델을 동기화하기 위하여 사이버 공간에서 물리 적인 현실 공간의 사물에 대응하는 객체를 상호 연결하는 제1 단계; 상기 사이버 공간의 객체를 통해 상기 물리 적 공간의 환경 및 상황을 인식하고 주변 환경을 제어하기 위하여 상기 물리적 공간의 사물의 데이터와 학습 모 델을 상기 사이버 공간으로 전송하고 이를 수신하는 제2 단계; 상기 전송 및 수신된 데이터를 통해 상기 디지털 트윈 시스템에서 각각의 물리적 사물 내에서 생성된 학습 모델을 상기 사이버 공간에서 해당하는 사이버 객체와 연결한 네트워크를 가상화하고, 학습 모델 및 수행 결과를 가시화하고 공유 및 관리하는 제3 단계; 및 상기 공 유한 학습 모델들을 조합하고 연합 학습 모델을 생성하여 효과적으로 시뮬레이션, 추론 및 예측을 수행하고, 상 기 물리적 공간의 사물에 다시 상기 연합 학습 모델을 재배포하여 향상된 상황 인지 및 환경 제어를 수행할 수 있도록 지원하는 제4 단계;를 포함한다. 아울러, 제2 단계는 연합 학습을 수행하는 적어도 하나 이상인 복수의 물리적 공간의 사물이 상기 물리적 공간 의 로컬 데이터를 학습하고 학습된 모델의 매개변수를 데이터 공유 프로토콜을 통해 상기 사이버 공간의 연합 서버와 복수의 학습 모델을 공유하는 단계; 및 사이버 공간의 연합 서버가 상기 복수의 연합 물리적 공간의 사 물의 속성이 반영되어 동기화된 가상 객체를 제공하고, 전송받은 매개변수와 모델들 중에서 최적의 모델을 선택 하기 위해 상기 물리적 공간 및 사이버 공간 각 객체의 학습 모델을 상호 동기화하는 단계;를 포함할 수 있다. 상기 제2 단계는, 상기 물리적 공간의 연합 물리적 공간의 사물은 딥러닝 모델을 이용하여 로컬 데이터를 학습 하고 학습된 모델의 정보를 데이터 공유 프로토콜을 통해 상기 연합 서버에 전송하고, 상기 사이버 공간의 연합 서버는 상기 물리적 공간의 사물 객체의 데이터와 학습 모델에 해당하는 매개변수와 그라디언트 정보를 수신하 는 단계;를 포함할 수 있다. 상기 제3 단계는, 상기 사이버 공간의 연합 서버에서 각각의 물리적 객체 내에서 생성된 학습 모델로부터 가상 화 속성을 활용하여 연합 학습 참여를 수행할 수 있도록 학습 모델을 가상화하고 관리하는 단계;를 포함할 수 있다. 상기 제3 단계는, 상기 사이버 공간의 연합 서버에서 학습 모델의 상태를 모니터링 하는 단계 및 학습 모델의 설정 파라미터를 세팅하는 단계를 포함하며, 이때 상기 물리적 공간의 사물의 가상 객체를 통해 상기 연합 물리적 공간의 사물의 로컬 및 글로벌 성능을 모니터링하고 학습 프로세스를 제어하며, 상기 연합 물리적 공간의 사 물로부터 수신된 모델 매개변수(weights) 및 그라디언트(gradients) 정보의 파라미터를 세팅하는 것을 특징으로 한다. 상기 제3 단계는, 상기 사이버 공간의 연합 서버에서 상기 연합 물리적 공간의 사물의 성능 결과 테이블과 성능 메트릭을 디지털 트윈 환경에서 시각화하여 어플리케이션을 통해 제공하는 단계;를 포함할 수 있다. 상기 제4 단계는, 상기 사이버 공간의 연합 서버에서 학습 모델을 이용하여 시뮬레이션 하는 단계 및 학습 모델 을 이용한 예측을 수행하는 단계를 포함하며, 상기 사이버 공간의 연합 서버는 상기 시뮬레이션 및 예측 결과를 바탕으로 최적의 학습 모델을 선택하고, 선택된 최적의 글로벌 모델을 상기 연합 물리적 공간의 사물로 제공하 는 것을 특징으로 한다. 한편, 연합 학습 모델 기반의 지능형 디지털 트윈 시스템에 있어서, 물리적 공간과 사이버 공간에서의 학습 모 델의 동기화를 위하여 사이버 공간에서 물리적인 현실 공간의 사물에 대응하는 객체를 동일하게 설정하는 사이 버 공간의 연합 서버; 상기 사이버 공간의 객체를 통해 상기 물리적 공간의 환경 및 상황을 인식하고 주변 환경 을 정밀하게 제어하기 위하여 상기 물리적 공간의 사물의 데이터를 상기 연합 서버로 전송하는 물리적 공간의 복수의 사물;를 포함하며, 상기 연합 서버는 상기 수신된 물리적 사물의 데이터를 통해 디지털 트윈 시스템에서 각각의 물리적 사물에서 생성된 학습 모델을 상기 사이버 공간에서 학습하고 공유 및 관리하며, 상기 공유한 복 수의 학습 모델들을 조합하여 성능을 향상시키고 상기 물리적 공간의 사물에 다시 재배포하여 향상된 상황 인지 및 환경 제어를 수행하는 것을 특징으로 한다."}
{"patent_id": "10-2023-0025351", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면 사이버 공간에서 현실 공간의 객체(장치)를 동일하게 가지고 사이버 공간의 객체를 통해 효과 적으로 물리 공간의 상황을 인식하고 주변 환경을 제어하는 디지털 트윈에서 각 물리적 객체 내에 기계학습 프 로그램을 통해 학습 모델을 생성하고, 이것을 사이버 공간에 전달하여 동일한 여러 사이버 객체의 학습 모델을 공유하고 관리하며, 더불어 공유한 학습 모델들을 조합하여 성능을 향상시켜 물리적 객체에 다시 재배포하여 향 상된 상황 인지 및 환경 제어를 수행할 수 있도록 지원함으로써, 데이터와 객체의 디지털 트윈뿐만 아니라 학습 모델의 디지털 트윈이 가능해진다. 이로써 물리 공간의 학습 모델과 사이버 공간의 학습 모델을 상호 동기화 시킬 수 있게 된다. 또한, 본 발명에 따르면 디지털 트윈의 객체와 데이터 동기화 측면에서, 디지털 트윈 환경 내에서 모델 매개 변 수를 변경할 수 있도록 하여, 사용자가 머신 러닝 모델의 성능을 미세 조정하고 실시간으로 조정하여 동작을 최 적화할 수 있다. 또한, 모델과 장치 상태를 동기화함으로써 물리적 객체 또는 시스템의 상태를 정확하게 제공하여 디지털 트윈 플랫폼의 효율적인 모델 동기화를 제공할 수 있다. 또한, 본 발명에 따르면 디지털 트윈 환경 내에서 연합 학습에 사용되는 장치 노드를 시각화하며, 학습 장치 노 드를 가상화함으로써 협력 연합 학습 시스템과 구성 요소를 시각적으로 표현할 수 있다. 이를 통해 사용자는 협력 연합 학습 시스템의 동작을 모니터링하고 이해할 수 있을 뿐만 아니라 성능을 최적화 하는 데 필요한 조정을 할 수 있다. 또한, 본 발명에 따른 디지털 트윈 환경은 가상 구성 요소에서 생성된 가상 환경의 제어를 제공하여, 사용자는 물리적 구성 요소에 직접 액세스할 필요 없이 가상 구성 요소와 상호 작용하고 협력 연합 학습 시스템을 실시간 으로 조정할 수 있다. 이와 같이 디지털 트윈이 가상 환경을 제어할 수 있게 함으로써 제안된 디지털 트윈 플랫폼은 협력 연합 학습 시스템을 관리하고 최적화하는 효율적인 방법을 제공할 수 있다. 또한, 디지털 트윈 플랫폼에서 각 장치 노드의 결과를 디지털 트윈 환경 내에서 시각화하여, 사용자가 협력 연 합 학습 시스템의 성능을 쉽게 모니터링하고 이해할 수 있으며, 필요에 따라 실시간으로 조정하여 성능을 최적 화할 수 있다. 또한, 각 장치 노드의 결과를 시각화함으로써 협력 연합 학습 시스템의 성능에 대한 통찰력을 제공하고, 사용자 가 성능을 향상시키기 위해 학습 정보에 입각한 결정을 내릴 수 있도록 한다. 본 발명에 따르면 현실 세계의 물리 사물에서 기계학습 알고리즘을 이용하여 학습 모델을 생성한 후에, 이것을 사이버 공간의 서버에 전달하여 여러 물리 객체의 사이버 객체의 학습 모델을 동기화하여 공유 관리하고, 여러 학습 모델을 융합 처리한 연합 학습 모델을 기반으로 보다 효과적인 시뮬레이션, 추론 및 예측을 수행할 수 있 다. 이렇게 여러 사물에서 생성된 학습 모델을 융합한 연합 학습 모델을 이용하는 지능형 디지털 트윈 시스템을 통 해 사이버 공간에서 현실 공간의 객체를 동일하게 가지면서 이들 사이버 공간의 객체를 통해 효과적으로 물리 공간의 상황을 정확하게 인식하고 주변 환경을 정밀하게 제어할 수 있다."}
{"patent_id": "10-2023-0025351", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변환을 가할 수 있고 여러 가지 실시예를 가질 수 있는 바, 특정 실시예들을 도면에 예시하고 상세한 설명에 상세하게 설명하고자 한다. 그러나, 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변환, 균등물 내지 대체물을 포함하는 것으로 이해되어 야 한다. 다만, 실시형태를 설명함에 있어서, 관련된 공지 기능 혹은 구성에 대한 구체적인 설명이 본 발명의 요지를 불 필요하게 흐릴 수 있다고 판단되는 경우 그에 대한 상세한 설명은 생략한다. 또한, 도면에서의 각 구성요소들의 크기는 설명을 위하여 과장될 수 있으며, 실제로 적용되는 크기를 의미하는 것은 아니다. 또한, 명세서 전체에서, 일 구성요소가 다른 구성요소와 \"연결된다\" 거나 \"접속된다\" 등으로 언급된 때에는, 상 기 일 구성요소가 상기 다른 구성요소와 직접 연결되거나 또는 직접 접속될 수도 있지만, 특별히 반대되는 기재 가 존재하지 않는 이상, 중간에 또 다른 구성요소를 매개하여 연결되거나 또는 접속될 수도 있다고 이해되어야 할 것이다. 또한, 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 연합 학습(Federated Learning: FL)은 각 노드에서 로컬 모델을 학습하고 데이터 자체 대신 모델 매개변수를 공 유함으로써 데이터 프라이버시 문제를 해결한다. 또한, 연합 서버는 모델 집계 기술을 사용하여 수신된 모델을 집계하고 결과 모델을 연결된 물리적 공간의 사물에 브로드캐스트한다.본 발명은 원격으로 배포된 물리적 공간의 사물과 해당 학습 프로세스를 가상으로 모니터링하고 제어하기 위한 디지털 트윈 기반 연합 학습(Digital Twin based Federated Learning: DT-FL) 프레임워크를 제안하고자 한다. 연결 지향 프로토콜인 OCF(Open Connectivity Foundation) Iotivity는 연합 물리적 공간의 사물을 연합 서버와 연결하여 패킷 전달을 보장한다. OCF Iotivity는 모델의 가중치를 서버와 송수신하고 HTTP(Hyper Text Transfer Protocol)를 사용하여 물리적 공간의 사물의 로컬 학습을 모니터링한다. 물리적 공간의 사물로부터 부분적으로 훈련된 모델을 받은 후 서버는 모델의 성능을 고려하여 정규분포 방식으 로 최적의 모델 선택을 수행한다. 마지막으로 가장 최고의 모델을 집계하여 최종 모델이 물리적 공간의 사물에 게 브로드캐스트된다. DT-FL 프레임워크는 분류 및 회귀 데이터 세트와 함께 사용할 수 있으며 해당 데이터에 대한 모델 아키텍처는 디지털 트윈 플랫폼에서 설계할 수 있다. 연합 학습(Federated Learning: FL) 프레임워크는 물리적 공간의 사물의 로컬 데이터를 유지하여 글로벌 모델을 학습하는 데 사용된다. 각 물리적 공간의 사물에는 다양한 소스에서 수집한 자체 로컬 데이터가 포함되어 있다. 데이터는 물리적 공간 의 사물에서 수집 및 저장되며 데이터 샘플은 다른 물리적 공간의 사물 또는 서버와 공유되지 않는다. 모델은 로컬에서 훈련되고, 훈련된 매개변수는 데이터 공유 프로토콜을 통해 서버와 공유된다. 로컬 모델은 부 분적으로 훈련되고, 훈련된 모델 가중치는 서버와 공유된다. 서버는 글로벌 모델을 달성하기 위해 다양한 집계 방법을 적용하고 마지막으로 글로벌 모델이 모든 물리적 공간의 사물에 브로드캐스트된다. 물리적 공간의 사물별로 딥러닝 모델을 먼저 로컬 모델로 선택하고 로컬 학습 데이터를 사용하여 로컬 모델을 학습시킨다. 딥 러닝 모델은 복잡한 문제를 해결하기 위해 방대한 데이터가 필요하다. 각 물리적 공간의 사물이 데이터를 서버에 공유하려면 모든 로컬 데이터가 서버에서 병합되어 빅 데이터 문제가 된다. 빅데이터 문제를 해결하기 위해서는 서버에 높은 연산 능력과 자원이 필요하다. 스마트 리소스가 제한된 IoT 장치가 시계열 데이터를 생성하는 경우 중앙 엔터티에 대한 지속적인 연결이 필요 한다. 연합은 물리적 공간의 사물의 로컬 데이터를 유지하고 학습된 모델을 서버와 공유하여 이 문제에 대한 솔 루션을 제공한다. 각 물리적 공간의 사물의 로컬 데이터에 대한 모델 학습은 심층 신경망의 일반화 속성에 맞지 않을 수 있다. 연 합은 지역적으로 훈련된 모델보다 더 일반화된 모든 지역적으로 훈련된 모델을 결합하여 글로벌 모델을 형성한 다. 연합에서 물리적 공간의 사물 장치는 일반적으로 계산 능력 및 스토리지 크기 측면에서 연합 서버에 비해 리소스가 제한적이다. 리소스가 제한된 장치는 각 서버 라운드에 대해 모델을 부분적으로 훈련하고 훈련된 모델을 서버로 보낸다. 연 합의 물리적 공간의 사물 수는 연합 서버의 계산 능력에 정비례한다. 물리적 공간의 사물은 연합 서버에 등록할 수 있으며 글로벌 학습 모델의 일부가 될 수 있다. 연합 서버에서의 연합 물리적 공간의 사물의 등록 및 참여는 상기 디지털 트윈 플랫폼의 가상 자산에 의해 이루 어질 수 있다. 각 장치는 디지털 트윈 환경에서 가상 객체가 존재한다. 가상 객체는 물리적 객체의 모든 속성을 반영한다. 도 1은 물리적 장치의 가상 엔터티가 첫 번째 계층에 설계되고 물리적 장치와 연결이 설정되는 디지털 트윈에서 가상 객체의 제어 속성을 보여준다. 가상 객체가 물리적 객체와 동기화되어야 하는 경우 동기화 속성이 중요하 다. 연합 학습 프로세스는 디지털 트윈에서 모니터링 및 제어할 수 있으며, 예측 결과 및 성능 메트릭은 디지털 트윈의 대화형 웹 애플리케이션에서 시각화된다. 연합 물리적 공간의 사물에서 연합 서버로의 모델 전송은 IoTivity 연결을 통해 이루어지며, 기타 제어 명령 및 모니터링 정보는 HTTP 프로토콜을 통해 송수신된다. OCF IoTivity는 장치 간 통신을 위해 CoAP(Constrained Application Protocols)를 사용한다. 본 발명에서는 CoAP와 HTTP 기반의 에지 컴퓨팅 프레임워크를 활용하였다. HTTP는 모니터링 및 제어 명령을 보내는 데 사용되 며, OCF IoTivity 프로토콜은 압축된 모델을 전송하는 데 사용된다. 실험을 위해 네트워크를 통해 DNN 모델을 훈련하고, 각 물리적 공간의 사물에 대한 전역 모델의 수렴을 시각화한다. 디지털 트윈 플랫폼은 모든 딥 러닝 모델(모델을 저장하고 모델 목록에 추가해야 함) 및 데이터 세트(데이터 세트를 물리적 공간의 사물에 배포하고디지털 트윈의 데이터 세트 목록에 나열해야 함)에 사용할 수 있다. 본 발명에 따른 DT-FL 프레임워크의 특징은 다음과 같다. 1) 원격으로 배포된 연합 물리적 공간의 사물의 가상 객체는 디지털 트윈 환경에서 성능 및 학습 프로세스를 가 상으로 모니터링하고 제어하도록 설계되었다. 2) OCF IoTivity 및 HTTP 프로토콜은 모델 전송을 효율적으로 수행하기 위해 단일 프레임워크에서 사용된다. 3) 대화형 디지털 트윈 기반 웹 애플리케이션은 모든 문제(분류 또는 회귀)에 대한 딥 러닝 모델을 생성하도록 설계되었다. 4) 연합 물리적 공간의 사물은 디지털 트윈 플랫폼에 등록되며 각 물리적 공간의 사물의 로컬 및 글로벌 성능이 모니터링된다. 5) 최고의 글로벌 모델을 달성하기 위해 정규 분포 기반의 최상의 물리적 공간의 사물 선택 방법을 채택한다. 6) 본 발명의 프레임워크는 8개의 연합 물리적 공간의 사물과 함께 에너지 소비 데이터에 대해 테스트되고 지연 시간과 로컬 및 글로벌 모델 성능 측면에서 평가된다. 연합 학습은 물리적 공간의 사물의 로컬 데이터를 유지하고 훈련된 모델 가중치를 전송하여 데이터 프라이버시 문제를 해결할 수 있다. 프라이버시는 스마트 홈 사용자의 주요 관심사이다. 본 발명에 따른 모델은 각 건물에 대해 훈련된 스마트 건물의 에너지 소비 데이터를 고려하였다. 물리적 공간의 사물과 서버 간의 안전한 통신을 위해 IIoT용 블록체인 지원 데이터 공유 메커니즘이 사용되었다. 또한 신뢰도 부족은 협업 학습에서 고려해야 할 핵심 요소이기 때문에, 연합 사용자 간의 신뢰를 구축하는 데에는 블록체인이 사용된다. 통신 보호와 상호 신뢰를 구축하기 위해 3계층의 아키텍처가 제안되었다. 전송 매체는 물리적 장치를 가상화 하는 또 다른 중요한 구성 요소이다. FL(Federated Learning)은 글로벌 모델 훈련 동안 데이터 대신 모델 가중치에만 의존하는 분산 훈련으로 인하여 IoT 및 네트워크의 핵심 기술이 되었다. 전역 모델의 성능은 분산 학습 중에 사용되는 집계 방법에 따라 크게 달라진다. Federated Averaging(FedAvg)은 서버에서 모델 매개변수를 집계하는 가장 간단한 기술이다. 개인화 된 FedAvg 기법도 각 물리적 공간의 사물의 성능을 고려하고 가중치를 최상의 가중치로 업데이트하도록 제안된 다. FedAvg는 통신 효율적이지만 공격을 받을 수 있는 페더레이션 서버라는 하나의 중앙 엔터티에 의존하며 개 인 정보가 손상될 수 있다. 따라서, 분산 환경에서 FedAvg를 사용하기 위해 DFedAvgM 모델이 사용될 수 있으며, 이 두 가지 유형의 연합 학습 아키텍처 중에서 하나는 물리적 공간의 사물-서버(client-server) 아키텍처이고 다른 하나는 피어-투-피어(peer-to-peer) 아키텍처이다. 물리적 공간의 사물-서버 아키텍처에는 중앙 엔터티가 있으며, 모든 연합 물리적 공간의 사물은 글로벌 모델 학습을 위해 중앙 엔터티와 통신한다. 피어-투-피어 아키 텍처는 서버가 각 반복에서 선택된 물리적 공간의 사물에서 동적으로 선택되는 분산형 아키텍처이다. 물리적 공간의 사물이 서버(물리적 공간의 사물-서버 아키텍처의 경우) 또는 동적 서버(피어 투 피어 아키텍처 의 경우)에 공유하는 정보에는 모델 매개변수(모델 가중치) 또는 기울기 정보가 포함된다. 가중치 공유의 경우, 서버는 집계 기술을 적용하고, 결과 가중치 매트릭스를 물리적 공간의 사물에 반환한다. 그라디언트(gradient) 의 경우 물리적 공간의 사물은 그라디언트를 계산하고 서버와 공유한다. 연합 서버는 그라디언트 집계 기술을 적용하고 집계된 값을 물리적 공간의 사물에 반환한다. 가중치 공유 방식은 부분 학습된 로컬 모델의 가중치 행 렬을 서버와 공유하기 때문에 잦은 동기화가 필요하지 않는다. 로컬 모델은 다른 연합 노드에서 다른 분포를 갖 는 로컬 데이터 세트에서 학습된다. 로컬 데이터 세트는 가로, 세로 또는 혼합으로 구분될 수 있다. 제안된 방 법에서는 데이터가 수평적으로 분할되는 수평 연합 학습을 기반으로 한다. 물리적 공간의 사물은 모델 매개변수(가중치) 및 그라디언트(gradient) 정보의 두 가지 유형의 정보를 서버와 공유한다. 본 발명에 따르면 모델 파라미터를 서버와 공유한다. 매개 변수 공유를 위해서는 물리적 공간 의 사물과 서버 간의 연결이 빨라야 대용량 파일을 전송할 수 있다. 모델 전송 지연을 처리하기 위해 다양한 통 신 효율적인 연합 학습 기술을 도입되었다. 제안된 방법에서는 압축된 모델을 전송하기 위해 OCF 연결 프레임워 크를 활용하고 모니터링 및 제어 명령을 전송하기 위해 HTTP를 사용한다. 연합 학습 전략은 각 노드의 지식을 네트워크의 다른 노드로 전송한다. 연합의 각 노드에는 자체 데이터가 있으 며 로컬 모델은 로컬 데이터에서 학습된다. 로컬 모델은 서버와 공유되어 수신된 모델을 집계하고 글로벌 모델 을 다시 물리적 공간의 사물로 브로드캐스트한다. 제안된 방법에서는 연합의 지식 전달 능력을 고려하여 정보가풍부한 건물의 지식을 정보가 부족한 건물로 이전하였다. 서울 시내 8개 주거용 건물의 에너지 사용량 데이터를 이용하여 로컬 모델을 학습시킨다. 각 서버 라운드 후 전역 모델이 건물로 전달되고 로컬 유효성 검사 데이터에 대해 유효성이 검사된다. 에너지 소비 예측은 환경에서의 중요성으로 인해 확립된 발명 분야가 되었다. 에너지 소비의 실제 데이터에 잡 음이 있을 수 있으며 로컬 모델의 성능이 영향을 받을 수 있다. 본 발명에서는 에너지 건물에 대한 지식을 연합 서버에 모델을 집약할 때 다른 건물로 이전한다. 본 발명은 집계에 가장 적합한 모델을 선택하기 위해 정규분포 기반 물리적 공간의 사물 선택 방법을 활용하였다. 마지막으로 글로벌 모델은 등록된 모든 물리적 공간의 사물 에게 브로드캐스트된다. 디지털 트윈 플랫폼은 물리적 공간의 사물을 모니터링 및 제어하고 글로벌 및 로컬 모 델의 결과를 시각화하는 데 사용된다. [표 1]"}
{"patent_id": "10-2023-0025351", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "아래에서는 본 발명에 따른 데이터 셋을 설명하기로 한다. 본 발명에 따른 디지털 트윈 기반 연합 학습(DT-FL) 모델은 대한민국의 한 발명 기관에서 제공하는 에너지 소비 데이터 세트에서 테스트되었으며, 프레임워크가 유연하며 모든 모델 및 데이터 세트와 함께 사용할 수 있다. 데 이터 세트에는 서울에 위치한 주거용 건물 8개의 에너지 소비 및 환경 매개변수가 포함되어 있다. 각 FL(Federated Learning) 물리적 공간의 사물에는 건물 하나의 데이터 세트가 포함되어 있으며 로컬 데이터에서 모델을 학습한다. 또한 요일, 날짜 및 월을 포함하여 기존 기능에서 일부 시간 기능을 추출한다. 표 1은 기존 및 추출된 시간적 특징 목록 및 설명을 나타내고 있다. 최종 처리된 데이터는 연합 물리적 공간의 사물을 통해 배포되고, 디지털 트윈 플랫폼이 물리적 공간의 사물 등록을 시작한다. 데이터 분포는 수평적이며 물리적 공간의 사물마다 샘플 수가 다르다. 수평적 연합 학습(Federated Learning: FL)은 다음과 같이 정의할 수 있다. Di가 물리적 공간의 사물 i의 로컬 데이터셋이고 Di(S ∈ Di)의 샘플 s가 s = (sID, Sfearure, Slabel)인 벡터일 때, SID ∈ Xi ID, Sfeature ∈ Xi feature 및 Slabel ∈ Xi label, 즉 SID , Sfeature 및 Slabel은 각각 샘플 ID, 샘플 특징 및 샘플 레 이블을 나타내고, SID ∈ Xi ID, Sfeature ∈ Xi feature 및 Slabel ∈ Xi label은 각각 ID 공간, 특징 공간 및 레이블 공간 을 나타낸다. 물리적 공간의 사물의 로컬 데이터에 동일한 기능 공간과 다른 ID 공간이 있는 경우, 즉 Xi feature =Xj feature이고, Xi ID≠Xj ID 인 경우, 분포는 수평적이다. 또한, 수직적 연합 학습(FL)에서 특징 공간은 다르고 ID 공간은동일하며, 즉 Xi feature ≠Xj feature이고, Xi ID=Xj ID이다. 다른 연합 물리적 공간의 사물의 데이터 분포는 표 2에 표시 된 바와 같다. [표 2]"}
{"patent_id": "10-2023-0025351", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "연합 학습(Federated Learning: FL)을 위한 디지털 트윈을 설명하면 아래와 같다. 연합 프레임워크를 위하여 디지털 트윈은 연합 물리적 공간의 사물의 모니터링과 제어 시에는 HTTP를 사용하고, 모델의 공유 시에는 OCF IoTivity를 사용한다. 제어 명령은 플라스크 서버(flask server)를 사용하여 HTTP로 전 송되고, 도 2에 도시된 바와 같이 모델이 OCF IoTivity에서 공유 및 수신된다. 디지털 트윈 지원 앱은 로컬 IP 및 등록된 포트에서 각 물리적 공간의 사물에서 실행된다. 각 물리적 공간의 사물의 데이터가 기능 수 측면에서 동일하기 때문에 서버는 초기 모델 아키텍처를 공유한다. 또한 각 물리적 공간의 사물은 동일한 아키텍처를 사 용하므로 추출된 가중치 행렬의 모양이 동일하고 쉽게 집계할 수 있다. 본 발명의 방법의 순서를 설명하면 다음 과 같다. 1) 디지털 트윈을 시작하고 IP 주소와 포트를 사용하여 연합 물리적 공간의 사물을 등록한다. 2) 각 물리적 공간의 사물에서 디지털 트윈 지원 앱을 배포하고 시작한다. 3) 도 4에 도시된 바와 같이 전체 시스템의 초기 구성을 설정한다. 4) 디지털 트윈에서 서버를 시작한다. 5) 디지털 트윈에서 물리적 공간의 사물을 시작한다. 6) 도 10의 알고리즘 1은 학습 중 물리적 공간의 사물이 수행하는 단계를 보여주고 있다. 7) 도 10의 알고리즘 2는 모든 물리적 공간의 사물로부터 모델을 받은 후, 물리적 공간의 사물 선택 방법과 집 계 프로세스를 보여주고 있다. 물리적 노드는 디지털 트윈 플랫폼에서 등록되고, 연합 노드의 가상 객체가 생성된다. 도 3은 본 발명에 따른 물리적 장치와 가상 장치의 동기화 및 연결성을 도시하고 있다. 모든 노드는 HTTP 프로토콜을 사용하여 등록되고, 모델은 OCF Iotivity를 사용하여 공유된다. 본 발명에서는 성 능 기반 가중치 집계를 사용하여 수신 모드의 가중치를 집계한다. 집계된 모델은 IoTivity를 사용하여 물리적 공간의 사물에 브로드캐스트된다. 도 3은 모델 전송을 병렬화하기 위해 서버가 모든 물리적 공간의 사물에 동적 가상 포트를 할당하는 것을 보여 준다. 디지털 트윈 사용자는 모델을 설계하고 물리적 공간의 사물을 등록하며 연합 학습을 위한 구성을 설정한 다. 연합 프로세스를 시작한 후 구성이 생성되어 등록된 물리적 공간의 사물로 전송된다. 물리적 공간의 사물은 구성을 수락하고 서버에서 받은 지침에 따라 훈련 프로세스를 시작한다. 디지털 트윈 보조 애플리케이션은 물리 적 공간의 사물에 배포되어 물리적 공간의 사물의 상태 및 성능을 전송한다.도 4는 본 발명에 따른 연합 학습을 위해 제안된 디지털 트윈(DT)의 블록도이다. 아키텍처의 맨 아래 계층은 IoT 장치의 네트워크를 나타낸다. 디지털 트윈 보조 애플리케이션은 글로벌 모델 학 습의 제어와 모니터링을 위해 IoT 장치에 배포된다. 초기 모델은 디지털 트윈에 준비되어 등록된 고객에게 방송 된다. 모델 준비에는 은닉층 선택, 손실 함수, 활성화 함수, 옵티마이저 및 학습률이 포함된다. 또한 디지털 트 윈은 로컬 데이터의 특성을 고려하고 모델의 입력 및 출력 계층을 준비하기 위해 로컬 데이터의 입력 및 출력 차원을 제공한다. 마지막으로 디지털 트윈은 매개변수를 연합 서버로 보내면 연합 서버는 모델을 준비하고 이를 물리적 공간의 사 물에 브로드캐스트한다. 연합 물리적 공간의 사물은 수신된 모델을 학습하고 부분적으로 학습된 모델을 서버로 보낸다. 서버는 수신된 모델을 집계하여 물리적 공간의 사물로 다시 보낸다. 모든 물리적 공간의 사물은 디지털 트윈에 의해 등록, 모니터링 및 제어된다. 이후부터는 성능을 기반으로 하는 가중치 집계 방법을 설명하기로 한다. 로컬 모델의 집계는 글로벌 모델의 성능에 중요한 역할을 한다. 제안된 프레임워크는 서버에서 집계 기법으로 FedAvg를 사용했다. 먼저 연합 서버는 임의의 가중치로 초기 모델을 브로드캐스트하고 물리적 공간의 사물은 로 컬 업데이트를 수행한다( ≥ 1). [수학식 1]"}
{"patent_id": "10-2023-0025351", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "여기서, k는 물리적 공간의 사물 번호이고 t는 이전 서버 라운드에서 완료된 전체 로컬 업데이트이다. 연합 물리적 공간의 사물 k에 로컬 데이터 샘플 xk,1, xk,2, ..., xk,nk이 포함된 경우, 각 물리적 공간의 사물의 로컬 손실은 다음과 같이 정의할 수 있다. [수학식 2]"}
{"patent_id": "10-2023-0025351", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "여기서, l(.;.)는 사용자가 정의한 손실 함수이며 물리적 공간의 사물 k의 성능으로 간주된다. 물리적 공간의 사물는 가중치 를 서버로 보내고, 수신 모델에서 새 로운 글로벌 모델을 생성하기 위해 집계가 수행된다. 물리적 공간의 사물의 참여 측면에서 주로 두 가지 유형의 집계가 서버에서 수행된다. 전체 장치의 참여: 이러한 유형의 집계에서는 물리적 공간의 사물의 성능을 분석하지 않고 등록된 모든 물 리적 공간의 사물의 가중치를 집계한다.[수학식 3]"}
{"patent_id": "10-2023-0025351", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "모든 장치의 참여는 글로벌 모델에 심각한 영향을 미칠 수 있다. 예를 들어, 연합 네트워크에 10개의 물리적 공 간의 사물이 있고 두 물리적 공간의 사물의 성능이 기준에 미치지 못하는 경우, 이러한 물리적 공간의 사물의 참여는 글로벌 모델에 부정적인 영향을 미친다. 일부 장치의 참여: 일부 장치의 참여 시에는 물리적 공간의 사물의 다양한 성능 메트릭을 고려하여 선택된 다. 집계를 위해 최상의 모델이 선택되는 전략이 더 현실적이다. 글로벌 모델은 선택된 물리적 공간의 사물의 가중치를 집계하여 얻는다. [수학식 4]"}
{"patent_id": "10-2023-0025351", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "여기서 St는 번째 서버 라운드에서 선택된 물리적 공간의 사물의 집합이다. 본 제안 발명에서는 정규 분포 기반 물리적 공간의 사물 선택 메커니즘이 채택된다. [수학식 5]"}
{"patent_id": "10-2023-0025351", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "여기서, 는 모든 물리적 공간의 사물의 성능을 의미하고, 는 모든 물리적 공간의 사물 성능의 표준 편차이다. 각 서버 라운드에 대해 성능(손실) 분포를 계산하고, 도 5와 하기의 수학식 6과 같이 손실이 임계값 미만인 경 우 물리적 공간의 사물를 선택한다.[수학식 6]"}
{"patent_id": "10-2023-0025351", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "디지털 트윈 구현을 위한 디지털 트윈 장치 등록을 설명하기로 한다. 데이터 세트 및 디지털 트윈 지원 응용 프로그램을 물리적 공간의 사물에 배포한 후 물리적 공간의 사물은 디지 털 트윈 플랫폼에서 IP 주소 및 포트 번호를 사용하여 등록된다. 디지털 트윈 지원 애플리케이션에는 모델 학습 및 발신자/수신자 모듈이 포함되어 있다. 디지털 트윈 지원은 디지털 트윈에서 제어 명령을 전송하여 장치를 모 니터링하고 제어하는 데에도 사용된다. 도 6은 본 발명에 따른 물리적 장치를 가상 장치로 표현한 것을 도시하고 있다. 도 6은 IP 주소와 포트 번호를 사용하여 장치를 디지털 트윈에 추가할 때 장치에서 사용할 수 있는 컨트롤을 보 여주고 있다. 물리적 연합 물리적 공간의 사물의 가상 객체는 디지털 트윈 플랫폼에서 시작할 수 있다. 등록된 장치 목록은 상태 및 데이터 분포와 함께 디지털 트윈 플랫폼에 표시된다. 처음에 서버는 모델을 준비하 기 위해 등록된 물리적 공간의 사물에게 메타데이터를 요청한다. 활성 등록 장치는 로컬 데이터(샘플 수 및 기 능 수)의 정보를 반환한다. 로컬 데이터의 정보를 고려하여 모델을 준비하고 활성 등록 물리적 공간의 사물에게 브로드캐스트한다. 도 7에 도시된 바와 같이 오프라인인 등록 장치의 인스턴스도 제어 및 정보 없이 디지털 트윈에 표시된다. 활성 장치만이 글로벌 모델을 얻기 위해 연합 프로세스에 참여한다. 활성 연합 물리적 공간의 사물을 시작한 후, 물 리적 공간의 사물은 초기 구성으로서 로컬 학습을 시작할 때까지 기다리게 된다. 각 물리적 공간의 사물에 대한 구성은 서버에서 생성된다. 도 8에 도시된 바와 같이 디지털 트윈은 사용자가 세팅한 설정을 고려하고 물리적 공간의 사물 및 서버에 대한 여러 JSON 설정 파일을 생성한다. 초기 설정에는 서버에서 할당한 노드의 고유 ID, 데이터 세트 이름, 서버의 Ip와 포트, 모델 이름, 서버 라운드 및 로컬 에포크가 포함된다. 충돌을 피하기 위해 서버의 포트는 각 연합 물 리적 공간의 사물에 동적으로 할당된다. 먼저 서버는 사용 가능한 포트 검색을 시작한 다음, 각 물리적 공간의 사물에 고유한 포트를 할당하고, 등록된 IP 및 포트에서 각 물리적 공간의 사물에 구성 파일을 보낸다. 서버 라운드가 완료되면 디지털 트윈 플랫폼에서 각 물리적 공간의 사물의 성능을 시각화 할 수 있다. 장치를 활성화하고 첫 번째 라운드를 완료한 후, 도 9와 같이 성능 이력을 디지털 트윈에서 시각화 할 수 있다. 성능 이력에는 다양한 평가 메트릭이 포함되며 모델 생성 중에 변경할 수 있다. 이하 본 발명에 따른 연합 실행 결과를 설명하기로 한다. 로컬 및 글로벌 모델의 성능 평가 시에는 다음의 평가 메트릭이 사용되었다. 평균 절대 오차(MAE): MAE는 실제 값과 예측 값의 절대 차이 값이다. [수학식 7]"}
{"patent_id": "10-2023-0025351", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "R2 점수: R2 점수는 모델의 정확도를 나타내는 반면 R2 값이 높을수록 모델의 성능이 우수함을 나타낸다. [수학식 8]"}
{"patent_id": "10-2023-0025351", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 11, "content": "MAE는 그라디언트 하강법(gradient descent)을 사용하여 모델을 훈련하기 위한 손실 함수로도 사용된다. 아래에서는 연합 서버와 연합 물리적 공간의 사물의 동기화 및 연결을 설명하기로 한다. OCF IoTivity는 CoAP 프로토콜을 사용하여 데이터와 명령을 전송한다. 본 발명의 디지털 트윈 모델의 효과를 설 명하기 위하여 각 물리적 공간의 사물의 대기 및 학습 시간을 계산하였다. 도 11은 본 발명에 따른 모든 서버 라운드에 대한 각 연합 물리적 공간의 사물의 학습 시간을 도시하고 있다. 첫 번째 라운드는 모델 학습 시간을 보여주고 나머지 라운드는 미세 조정 시간을 보여주고 있다. 첫 번째 라운 드의 경우 가중치는 무작위이다. 나머지 라운드에서는 서버에서 공유하는 집계 가중치가 사용되었다. 학습 시간 은 기계의 용량과 데이터 분포에 따라 크게 달라진다. 모든 물리적 공간의 사물은 동일한 리소스를 사용하므로 학습 시간은 로컬 데이터 세트의 샘플 수에 따라 다르다. 건물마다 층이 다르기 때문에 데이터 세트의 분포는 샘플 수 측면에서 동일하지 않고 독립적(non-IID)이다. 대기 시간은 물리적 공간의 사물이 학습을 마치고 서버의 응답을 기다리는 시간을 나타낸다. 서버는 모든 물리 적 공간의 사물이 학습 프로세스를 완료하고 JSON 압축 가중치 매트릭스를 공유할 때까지 기다린다. 가중치는 JSON으로 변환되고 JSON 압축기 Python 라이브러리를 사용하여 압축된다. 도 12는 각 물리적 공간의 사물에 대한 가중 시간은 나타내고 있다. 도 11과 도 12는 서버가 모든 물리적 공간 의 사물이 훈련 과정을 마칠 때까지 기다리기 때문에 훈련 시간이 적은 물리적 공간의 사물은 대기 시간이 높다 는 것을 보여주고 있다. 대기 시간은 모델을 보내고 받는 RTT(왕복 시간)도 나타낸다. 모델 전송 시간도 대기 시간에 영향을 미친다. 학습 후 물리적 공간의 사물은 집계된 모델을 기다리고 있기 때문이다. 따라서, 왕복 시 간을 줄이기 위해 모델 전송에 OCF IoTivity를 사용한다. 모델 전송을 위해 제안된 디지털 트윈 프레임워크에서 OCF IoTivity의 효율성을 보여주기 위해 각 물리적 공간 의 사물에 대한 모델 크기와 모델 전송 시간을 비교한다. 도 13은 각 물리적 공간의 사물의 평균 모델 크기와 평균 전송 시간을 보여주고 있다. OCF IoTivity의 모델 전 송 시간이 HTTP 프로토콜보다 훨씬 짧다는 것은 수치로 확인할 수 있다. 각 물리적 공간의 사물은 고유한 서버 포트와 결합되어 여러 물리적 공간의 사물이 동시에 학습 프로세스를 완료하면 병렬로 모델 전송이 가능한다. 또한 집계 프로세스 후 서버는 집계된 가중치를 전용 포트에서 각 물리적 공간의 사물로 병렬 브로드캐스트한다. 본 발명에 따른 로컬 모델과 글로벌 모델의 융합 방법을 설명하면 다음과 같다. 연합 학습의 각 물리적 공간의 사물은 하나의 주거용 건물에 대한 로컬 데이터를 가지고 있으며 로컬 모델은 해 당 데이터에 대해 학습을 받는다. 디지털 트윈 플랫폼은 모델 배포를 수행하고 물리적 공간의 사물은 로컬 데이 터에서 수신된 모델을 학습한다. 또한 연합 구성은 디지털 트윈 플랫폼에서 각 물리적 공간의 사물로 분산되어 서버와 모델 가중치 및 성능을 송수신한다. 일 실시예에서는 5개의 로컬 라운드와 50개의 서버 라운드가 글로벌 모델을 훈련하는 데 사용되었다. 각 서버 라운드에서 로컬 모델은 5세대 동안 학습되었다. 부분적으로 훈련된 모델의 가중치는 집계를 위해 서버와 공유 되었다. 또한, MSE가 모델의 성능을 평가하기 위한 손실 함수로 선택되었다. 서버에서 물리적 공간의 사물은 로 컬 데이터에 대한 성능을 기준으로 선택되었다. 실험은 집계 프로세스에서 물리적 공간의 사물의 전체 및 부분 참여에 대해 수행되었다. 도 5에서와 같이 물리적 공간의 사물의 일부 참여를 위해 두 개의 사분위수가 고려되 었다. 첫 번째 실험에서는 손실의 평균(μ)보다 적은 손실을 가진 물리적 공간의 사물를 선택하고, 또 다른 실험에서 는 μ + σ보다 적은 손실을 가진 물리적 공간의 사물를 선택하였다. 각 물리적 공간의 사물에 대한 로컬 모델과 글로벌 모델의 융합 결과를 비교해보면 결과는 글로벌 모델(μ + σ)의 수렴성과 성능이 다른 글로벌 모델보다 우수하게 나타난다. 본 발명에서는 에너지 소비 예측을 위한 지능형 디지털 트윈 기반 연합학습 프레임워크를 제시하였다. 프레임워 크는 에너지 소비 데이터에 대해 테스트되고 네트워크를 통해 배포되며 디지털 트윈 웹 인터페이스에서 글로벌 모델의 분산 학습을 제어하였다. 본 발명에서 제안된 프레임워크는 디지털 트윈을 사용하여 서버 라운드, 로컬 에포크, 서버 IP 및 포트를 포함한 연합 매개변수를 설정한다. 모니터링 및 제어 명령은 HTTP로 전송되고 모델 의 매개변수는 OCF IoTivity에서 송수신된다. 디지털 트윈 지원 애플리케이션은 가상 인스턴스에서 물리적 장치 를 제어하기 위해 연합 물리적 공간의 사물에서 개발 및 배포된다. 연합에 대한 모델 관리는 디지털 트윈에 포 함되어 디지털 트윈에서 모델의 아키텍처를 설계하고 초기 모델을 브로드캐스트한다. 디지털 트윈 모델 관리는 로컬 데이터의 입력 및 출력 차원을 설정하여 모든 로컬 데이터에 대한 모델을 설계할 수 있다. 초기 모델은 지 정된 에포크에 대해 훈련되고 가중치는 OCF IoTivity를 사용하여 서버로 전송된다. 정규 분포 방법은 집계 전에 최상의 모델을 선택하고 손실이 큰 모델을 삭제하는 데 사용된다. 정규 분포의 다양한 사분위수가 모델 선택을 위한 임계값을 설정하는 데 사용된다. 최고의 모델이 집계되어 등록된 모든 물리적 공간의 사물에게 브로드캐스 트된다. 물리적 공간의 사물은 특정 에포크에 대해 수신된 모델을 미세 조정하고 가중치를 다시 서버로 전송한 다. 결과는 서버로 모델을 전송하는 데 IoTivity를 사용하는 효과를 보여준다. 또한 모델 집계에 대한 물리적 공간의 사물의 부분 참여(최상의 모델 선택)는 물리적 공간의 사물의 전체 참여보다 더 나은 결과를 나타낸다. 정규분포의 처음 3사분위수를 기준으로 부분 참여로 달성한 글로벌 모델은 모든 물리적 공간의 사물에 대한 일 반화와 타사에 비해 빠른 수렴을 보여준다. 본 발명에 따르면 HTTP와 CoAP 프로토콜을 사용하여 장치와 장치 노드 간의 통신이 용이하다. 본 발명에 따르면 사물인터넷(IoT)을 위해 설계된 오픈 소스 소프트웨어 프레임워크인 IoT를 사용하며, IoT는 IoT 장치를 위한 안 전하고 확장 가능한 통신 인프라를 제공하여 데이터와 정보의 효율적인 전송을 가능하게 하며, HTTP와 CoAP를 사용하여 견고하고 단순하면서도 네트워크의 장치 간에 신뢰할 수 있고 사용하기 쉬운 통신을 보장할 수 있다. 또한, 본 발명에 따르면 디지털 트윈 플랫폼에서 장치 노드를 모니터링할 수 있다. 즉, 사용자는 각 장치 노드 에 대한 실시간 데이터 및 성능 메트릭을 볼 수 있을 뿐만 아니라 디지털 트윈 환경 내에서 장치 노드의 상태를 제어하고 수정할 수 있다. 이와 같이 본 발명에 따른 디지털 트윈 플랫폼은 장치 노드의 실시간 모니터링 및 제 어를 가능하게 함으로써, 협력 연합 학습 시스템을 관리하고 최적화하는 편리하고 효율적인 방법을 제공할 수 있다. 또한, 본 발명에 따른 디지털 트윈 플랫폼은 각 장치 노드의 결과를 그래프와 표 형태로 시각화하여 제공함으로 써, 각 장치 노드의 성능에 대한 명확하고 포괄적인 개요를 제공하여, 사용자가 전체적으로 협력 연합 학습 시 스템의 성능을 쉽게 이해할 수 있도록 한다. 또한, 각 장치 노드의 결과 테이블과 그 성능 메트릭은 디지털 트 윈(DT) 환경 내에서도 시각화되며, 사용자는 정확도, 오류율 및 수렴 시간과 같은 메트릭을 포함하여 각 장치 노드의 성능에 대한 자세한 정보를 제공받을 수 있다. 이 정보를 시각화함으로써 사용자는 개선 영역을 식별하 고 협력 연합 학습 시스템의 성능을 최적화하기 위한 정보에 입각한 결정을 내릴 수 있다. 또한, 본 발명에 따른 디지털 트윈 플랫폼에서는 사물인터넷(IoT) 장치가 협력 연합 학습 장치로 사용되며, 협 력 연합 학습 모델은 모니터링 및 제어되는 물리적 구성 요소를 나타내는 이러한 IoT 장치에서 훈련된다. 이와같은 IoT 장치는 일반적으로 작고, 저전력이며, 저렴하여 협력 연합 학습 장치로 사용하기에 이상적이다. 또한, IoT 장치는 종종 다양한 센서와 액추에이터를 갖추고 있으며, 이는 표현되는 물리적 구성 요소를 모니터링하고 제어하는 데 사용될 수 있다. 이를 통해 사용자는 물리적 구성 요소의 동작과 성능에 대한 귀중한 통찰력을 얻 고 이러한 구성 요소를 실시간으로 제어할 수 있다. 그 뿐만 아니라, IoT 장치는 인터넷에 연결되어 디지털 트 윈 환경 및 다른 IoT 장치와 통신하고 데이터를 교환할 수 있다. 이를 통해 협력 연합 학습 장치 노드가 실시간 으로 데이터를 교환하고 협력 연합 학습 시스템의 성능을 향상시킬 수 있다. 또한, 본 발명에 따르면 협력 연합 학습(FL)을 위한 제안된 디지털 트윈 플랫폼에서는 인공지능(AIoT) 네트워크 를 사용하여 협력 연합 학습 장치 노드를 연결할 수 있다. AIoT 네트워크는 기존의 디지털 트윈 환경에서 사용 되는 기존 AIoT 네트워크에 비해 장치 노드를 연결하기 위한 보다 고급스럽고 지능적인 솔루션을 제공한다. 이 와 같이 AIoT 네트워크는 기존 AIoT 네트워크와 마찬가지로 협력 연합 학습 장치 노드가 실시간으로 통신하고 데이터를 교환할 수 있으며, 추가적인 지능 및 기계 학습 기능을 제공하여 협력 연합 학습 장치 노드가 교환되 는 데이터를 학습하고 적응할 수 있도록 한다. 이를 통해 협력 연합 학습 장치 노드는 더 많은 정보에 입각한 결정을 내리고 협력 연합 학습 시스템의 성능을 향상시킬 수 있으며, 실시간 데이터 교환을 가능하게 하고 기계 학습 기능을 제공함으로써 협력 연합 학습 시스템의 성능과 지능을 향상시킬 수 있다. 본 발명에서는 실시간 장치 모니터링 및 제어 메커니즘을 제안하였다. 본 발명에서는 장치 등록, 모니터링, 제 어 및 결과 시각화가 고려되며 본 발명에 따르면 연합 물리적 공간의 사물의 지연 시간과 동기화하였으며, 물리 적 공간의 사물과 서버에서 OCF Iotivity를 사용하여, 모델 전송 지연 시간을 최소화하였다. 전술한 바와 같은 본 발명의 상세한 설명에서는 구체적인 실시예에 관해 설명하였다. 그러나 본 발명의 범주에 서 벗어나지 않는 한도 내에서는 여러 가지 변형이 가능하다. 본 발명의 기술적 사상은 본 발명의 전술한 실시 예에 국한되어 정해져서는 안 되며, 청구범위 뿐만 아니라 이 청구범위와 균등한 것들에 의해 정해져야 한다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13"}
{"patent_id": "10-2023-0025351", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 12, "content": "임시명세서(첨부)공개특허10-2024-0131818 -30-"}
{"patent_id": "10-2023-0025351", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 디지털 트윈 시스템에서 가상 객체의 제어 속성을 도시한 도면이다. 도 2는 본 발명에 따른 연합 학습 모델 기반 지능형 디지털 트윈 시스템 및 방법을 설명하기 위한 도면이다. 도 3은 본 발명에 따른 물리적 장치와 가상 장치의 동기화 및 연결을 설명하기 위한 도면이다. 도 4는 본 발명에 따른 연합 학습 모델 기반 지능형 디지털 트윈 시스템을 설명하기 위한 블록도이다. 도 5는 본 발명에 따른 글로벌 모델을 위한 일부 장치의 참여를 설명하기 위한 그래프이다. 도 6은 본 발명에 따른 물리적 장치의 가상 장치로의 표현을 도시한 도면이다. 도 7에 본 발명에 따른 디지털 트윈에서 제공하는 등록 장치의 인스턴스도 제어 및 정보를 도시한 도면이다. 도 8은 본 발명에 따른 디지털 트윈에서 제공하는 사용자가 세팅한 설정에 따른 물리적 공간의 사물 및 서버의 설정을 설명하기 위한 도면이다. 도 9는 본 발명에 따른 디지털 트윈에서 제공하는 연합 물리적 공간의 사물의 성능 이력을 도시한 도면이다. 도 10은 본 발명에 따른 학습 중 물리적 공간의 사물이 수행하는 단계의 알고리즘 1과, 모든 물리적 공간의 사 물로부터 모델을 받은 후 물리적 공간의 사물 선택 방법과 집계 프로세스인 알고리즘 2를 도시한 도면이다. 도 11은 본 발명에 따른 모든 서버 라운드에 대한 각 연합 물리적 공간의 사물의 학습 시간을 도시하고 있다. 도 12는 본 발명에 따른 각 물리적 공간의 사물에 대한 가중 시간은 도시하고 있다. 도 13은 본 발명에 따른 각 물리적 공간의 사물의 평균 모델 크기와 평균 전송 시간을 도시하고 있다."}
