{"patent_id": "10-2008-0019442", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2009-0094477", "출원번호": "10-2008-0019442", "출원인": "건국대학교 산학협력단", "발명자": "최동국"}}
{"patent_id": "10-2008-0019442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "지능형 개인 맞춤 건강관리 기록시스템에 있어서사용자 또는 진료기관으로부터 기본정보, 외래진료정보, 입원ㆍ수술정보, 건강검진정보, 산모관리정보 및 신생아관리정보를 포함하는 건강정보를 입력받아 건강관리서버로 송신하고, 갱신된 건강정보를 수신하여 출력하는개인단말기(100); 및상기 개인단말기로부터 수신한 건강정보를 기저장된 건강정보와 대응되도록 갱신하여 갱신된 건강정보를 상기개인단말기로 송신하는 건강관리서버(200); 를 포함하는 것을 특징으로 하는 지능형 개인 맞춤 건강관리 기록시스템."}
{"patent_id": "10-2008-0019442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 건강관리서버(200)는,사용자의 신상정보, 활력상태정보, 특수이력정보, 가족력정보 및 보험상품정보를 포함하는 상기 기본정보를 갱신ㆍ관리하는 기본정보모듈(210);사용자의 진료검사정보, 투약정보를 포함하는 상기 외래진료정보를 갱신ㆍ관리하는 외래진료모듈(220);사용자가 입원한 병원명, 입원기간, 입원방법을 포함하는 입원내역정보, 수술내역정보, 사용자가 수술한병원명, 수술날짜, 수혈유무 및 수혈종류를 포함하는 입원ㆍ수술검사정보 및 입원ㆍ수술투약정보를 포함하는 상기 입원ㆍ수술정보를 최근날짜순으로 색인하여 갱신ㆍ관리하는 입원ㆍ수술모듈(230);사용자의 허리둘레, 콜레스테롤, 혈압, 중성지방 및 혈당정보를 포함하는 상기 건강검진정보를 갱신ㆍ관리하는건강검진모듈(240);사용자의 임신일, 최종 월경일, 인신 전ㆍ후의 체중변화, 임신의 횟수, 출산의 횟수, 자녀수, 자연 유산수, 인공 유산수, 이상증상(뇨단백, 간염, 간염항체)을 포함하는 상기 산모관리정보를 갱신ㆍ관리하는 산모관리모듈(250); 및신생아정보, 재태기간정보, 신생아건강정보, 신생아예방접종정보, 신생아발육생장정보 및 성장일기정보를 포함하는 상기 신생아관리정보를 갱신ㆍ관리하는 신생아관리모듈(260); 을 포함하는 것을 특징으로 하는 지능형 개인 맞춤 건강관리 기록시스템."}
{"patent_id": "10-2008-0019442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서,상기 기본정보모듈(210)은,사용자의 성명, 성별, 거주지, 알레르기 유무, 가족력 유무 및 연락처를 포함하는 상기 신상정보를 수정ㆍ갱신하는 회원정보부(211);사용자의 신장, 몸무게, 혈액형, 혈압, 맥박, 흡연여부와 흡연량 및 음주여부와 음주량을 포함하는 상기 활력상태정보를 수정ㆍ갱신하는 활력상태부(212);사용자의 알레르기 발생일, 발생원인, 반응 및 치료방법을 포함하는 상기 특수이력정보를 수정ㆍ갱신하는 특수이력부(213);사용자의 직계존속에 대한 주요질병, 사망질환 및 현재 발병질환을 포함하는 상기 가족력정보를 수정ㆍ갱신하는가족력관리부(214);사용자가 가입한 복수개의 보험상품에 대한 보험가입자명, 보험사명, 보장범위, 약관, 월 납입액 및 계약ㆍ만료일을 포함하는 상기 보험상품정보를 수정ㆍ갱신하는 보험관리부(215); 및상기 신상정보, 활력상태정보, 특수이력정보, 가족력정보 및 보험상품정보를 저장ㆍ갱신하는 기본정보DB(260);- 2 -공개특허 10-2009-0094477를 더 포함하는 것을 특징으로 하는 지능형 개인 맞춤 건강관리 기록시스템."}
{"patent_id": "10-2008-0019442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 2에 있어서,상기 외래진료모듈(220)은,외래진료시 검사받은 상기 사용자의 진료검사명, 검사기관, 검사목적 및 진단명을 포함하는 상기 진료검사정보를 수정ㆍ갱신하는 진료검사기록부(221);사용자의 처방전에 따른 투약일자, 약품명, 제약회사명, 복용기간 및 복용법을 포함하는 상기 투약정보를 수정ㆍ갱신하는 진료투약정보부(222); 및상기 진료검사정보 및 투약정보를 저장ㆍ갱신하는 외래진료DB(223); 를 더 포함하는 것을 특징으로 하는 지능형개인 맞춤 건강관리 기록시스템."}
{"patent_id": "10-2008-0019442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 2에 있어서,상기 진료검사정보는,상기 사용자가 진료시 검사받은 MRIㆍCTㆍX-ray사진, 진단서 및 처방전을 포함하는 것을 특징으로 하는 지능형개인 맞춤 건강관리 기록시스템."}
{"patent_id": "10-2008-0019442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 2에 있어서,상기 입원ㆍ수술모듈(230)은,사용자가 입원ㆍ수술 기간동안 검사받은 검사명, 입원ㆍ수술기관, 입원ㆍ수술목적 및 진단명을 포함하는 상기입원ㆍ수술검사정보를 갱신ㆍ수정하는 입원ㆍ수술검사기록부(231);사용자가 입원ㆍ수술 기간동안 처방받은 처방전의 투약일자, 약품명, 제약회사명, 복용기간 및 복용법을 포함하는 상기 입원ㆍ수술투약정보를 갱신ㆍ수정하는 입원ㆍ수술투약정보부(232); 및상기 입원내역정보, 수술내역정보, 입원ㆍ수술검사정보 및 입원ㆍ수술투약정보를 저장ㆍ갱신하는 입원ㆍ수술DB(233); 를 더 포함하는 것을 특징으로 하는 지능형 개인 맞춤 건강관리 기록시스템."}
{"patent_id": "10-2008-0019442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 2에 있어서,상기 건강검진모듈(240)은,상기 건강검진정보를 저장ㆍ갱신하는 건강검진DB(241); 를 더 포함하는 것을 특징으로 하는 지능형 개인 맞춤건강관리 기록시스템."}
{"patent_id": "10-2008-0019442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 2에 있어서,상기 산모관리모듈(250)은,상기 산모관리정보를 저장ㆍ갱신하는 산모관리DB(251); 를 더 포함하는 것을 특징으로 하는 지능형 개인 맞춤건강관리 기록시스템."}
{"patent_id": "10-2008-0019442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 2에 있어서,상기 신생아관리모듈(260)은,- 3 -공개특허 10-2009-0094477신생아의 출생일, 성별, 출생병원, 전문의 성명, 출생시 몸무게, 혈액형, 혈액타입, 분만형태 및 신생아활력지표를 포함하는 상기 신생아정보를 갱신ㆍ수정하는 신생아정보부(261);임산부의 정기적인 검진에 따른 초음파사진 및 태아의 발육상태를 포함하는 상기 재태기간정보를 갱신ㆍ수정하는 재태기록부(262);신생아의 진료기록, 투약기록, 입원ㆍ수술기록을 포함하는 상기 신생아건강정보를 갱신ㆍ수정하는 신생아건강기록부(263);신생아의 예방접종 순서와 접종기간 및 접종횟수를 포함하는 상기 신생아예방접종정보를 갱신ㆍ수정하는 예방접종기록부(264);신생아의 키, 몸무게, 머리둘레 및 치아개수를 포함하는 상기 신생아발육생장정보를 갱신ㆍ수정하는 발육생장관리부(265);신생아의 성장발육에 따른 건강일상 및 사진을 포함하는 상기 성장일기정보를 갱신ㆍ수정하는 성장일기부(266);및상기 신생아정보, 재태기간정보, 신생아건강정보, 신생아예방접종정보, 신생아발육생장정보 및 성장일기정보를저장ㆍ갱신하는 신생아관리DB(267); 를 더 포함하는 것을 특징으로 하는 지능형 개인 맞춤 건강관리기록시스템.명 세 서발명의 상세한 설명 기 술 분 야본 발명은 건강관리 기록시스템에 관한 것으로서, 더욱 상세하게는 개인의 각종 검사결과를 포함하는 건강정보 <1>를 출생에서부터 노년기에 이르기까지 평생에 걸쳐 개인 홈페이지 형태로 저장, 관리 및 보유하는 기술에 관한것이다. 배 경 기 술근래에 우리나라는 급격한 고령화 및 생활양식 변화로 지속적 관리를 요하는 각종 질환과 암, 고혈압, 당뇨 등 <2>과 같은 만성 질환 등의 다양한 질환이 급증하고 있으며, 건강에 대한 관심이 증대됨에 따라 해마다 개인 지출하는 의료비가 지속적으로 증가하고 있는 실정이다.또한, 세계 의료계는 의료시장의 전면개방을 앞두고 글로벌 경쟁력 강화와 고객서비스 개선을 위해 빠르게 정보 <3>화되고 있으며, 환자의 진료에 EMR(Electronic Medical Record: 전자의료기록) 시스템을 도입함으로써, 진료차트의 전산화를 꾀하고, 이에 따라 신속한 업무처리와 인력 및 비용 절감함과 아울러 환자의 대기시간을 단축시키는 효과가 있다.그러나, 이러한 EMR 시스템은 병원마다 개별적으로 구축하여 운영되고 있는바, 각각 병원간의 호환이 어렵고, <4>막대한 양의 자료 저장 및 관리에 한계가 있어 일정기간(최대 5년) 내외의 최신 데이터만 보존하고 있는 실정이다.이러한 EMR 시스템의 대안으로 보건복지부가 주관하여 2030년 서비스를 목표로 EHR(Electronic Health Record: <5>전자건강기록) 시스템을 병원 중심(Hospital-oriented)으로 구축ㆍ추진하고 있으나, 방대한 자료의 관리와 시스템 통합의 표준화, 개인의 건강정보 접근 어려움, 개인정보유출의 우려 등 산적한 문제를 떠안고 있으며, 무엇보다 EHR 시스템의 개발ㆍ보급되기까지 상당한 시간이 소요되어 국민들이 실질적인 혜택을 보장받기 어렵다. 발명의 내용 해결 하고자하는 과제본 발명은 상기와 같은 문제점을 해소하고자 안출된 것으로서, 자신의 각종 검사결과를 포함하는 건강 의료기록 <6>정보를 건강관리서버를 통해 스스로 평생 관리할 수 있도록 함으로써, 출생에서부터 노년기까지 평생에 걸쳐 모든 건강관련 정보들을 기록ㆍ관리하며, 개인단말기를 통해 장소에 제약됨 없이 언제 어디서든 열람ㆍ갱신할 수- 4 -공개특허 10-2009-0094477있도록 한다. 과제 해결수단이러한 기술적 과제를 달성하기 위한 지능형 개인 맞춤형 건강관리 기록시스템은, 사용자 또는 진료기관으로부 <7>터 기본정보, 외래진료정보, 입원ㆍ수술정보, 건강검진정보, 산모관리정보 및 신생아관리정보를 포함하는 건강정보를 입력받아 건강관리서버로 송신하고, 갱신된 건강정보를 수신하여 출력하는 개인단말기; 및 개인단말기로부터 수신한 건강정보를 기저장된 건강정보와 대응되도록 갱신하여 갱신된 건강정보를 개인단말기로 송신하는건강관리서버; 를 포함한다.또한, 건강관리서버는, 사용자의 신상정보, 활력상태정보, 특수이력정보, 가족력정보 및 보험상품정보를 포함하 <8>는 기본정보를 갱신ㆍ관리하는 기본정보모듈; 사용자의 진료검사정보 및 투약정보를 포함하는 외래진료정보를갱신ㆍ관리하는 외래진료모듈; 사용자가 입원한 병원명, 입원기간, 입원방법을 포함하는 입원내역정보, 수술내역정보, 사용자가 수술한 병원명, 수술날짜, 수혈유무 및 수혈종류를 포함하는 입원ㆍ수술검사정보 및 입원ㆍ수술투약정보를 포함하는 입원ㆍ수술정보를 최근날짜순으로 색인하여 갱신ㆍ관리하는 입원ㆍ수술모듈; 사용자의허리둘레, 콜레스테롤, 혈압, 중성지방 및 혈당정보를 포함하는 건강검진정보를 갱신ㆍ관리하는 건강검진모듈;사용자의 임신일, 최종 월경일, 인신 전ㆍ후의 체중변화, 임신의 횟수, 출산의 횟수, 자녀수, 자연 유산수, 인공 유산수, 이상증상(뇨단백, 간염, 간염항체)을 포함하는 산모관리정보를 갱신ㆍ관리하는 산모관리모듈; 및 사용자 신생아의 신생아정보, 재태기간정보, 신생아건강정보, 신생아예방접종정보, 신생아발육생장정보 및 성장일기정보를 포함하는 신생아관리정보를 갱신ㆍ관리하는 신생아관리모듈; 을 포함한다.바람직하게 기본정보모듈은, 사용자의 성명, 성별, 거주지, 알레르기 유무, 가족력 유무 및 연락처를 포함하는 <9>신상정보를 수정ㆍ갱신하는 회원정보부; 사용자의 신장, 몸무게, 혈액형, 혈압, 맥박, 흡연여부와 흡연량 및 음주여부와 음주량을 포함하는 활력상태정보를 수정ㆍ갱신하는 활력상태부; 사용자의 알레르기 발생일, 발생원인,반응 및 치료방법을 포함하는 특수이력정보를 수정ㆍ갱신하는 특수이력부; 사용자의 직계존속에 대한 주요질병,사망질환 및 현재 발병질환을 포함하는 가족력정보를 수정ㆍ갱신하는 가족력관리부; 사용자가 가입한 복수개의보험상품에 대한 보험가입자명, 보험사명, 보장범위, 약관, 월 납입액 및 계약ㆍ만료일을 포함하는 보험상품정보를 수정ㆍ갱신하는 보험관리부; 및 신상정보, 활력상태정보, 특수이력정보, 가족력정보 및 보험상품정보를 저장ㆍ갱신하는 기본정보DB; 를 더 포함한다.또한 바람직하게 외래진료모듈은, 외래진료시 검사받은 사용자의 진료검사명, 검사기관, 검사목적 및 진단명을 <10>포함하는 진료검사정보를 수정ㆍ갱신하는 진료검사기록부; 사용자의 처방전에 따른 투약일자, 약품명, 제약회사명, 복용기간 및 복용법을 포함하는 투약정보를 수정ㆍ갱신하는 진료투약정보부; 및 진료검사정보 및 투약정보를 저장ㆍ갱신하는 외래진료DB; 를 더 포함한다.또한 바람직하게 입원ㆍ수술모듈은, 사용자가 입원ㆍ수술 기간동안 검사받은 검사명, 입원ㆍ수술기관, 입원ㆍ수 <11>술목적 및 진단명을 포함하는 입원ㆍ수술검사정보를 갱신ㆍ수정하는 입원ㆍ수술검사기록부; 사용자가 입원ㆍ수술 기간동안 처방받은 처방전의 투약일자, 약품명, 제약회사명, 복용기간 및 복용법을 포함하는 입원ㆍ수술투약정보를 갱신ㆍ수정하는 입원ㆍ수술투약정보부; 및 입원내역정보, 수술내역정보, 입원ㆍ수술검사정보 및 입원ㆍ수술투약정보를 저장ㆍ갱신하는 입원ㆍ수술DB; 를 더 포함한다.또한 바람직하게 건강검진모듈은, 건강검진정보를 저장ㆍ갱신하는 건강검진DB; 를 더 포함한다. <12>또한 바람직하게 산모관리모듈은, 산모관리정보를 저장ㆍ갱신하는 산모관리DB; 를 더 포함한다. <13>그리고 바람직하게 신생아관리모듈은, 신생아의 신생아 출생일, 성별, 출생병원, 전문의 성명, 출생시 몸무게, <14>혈액형, 혈액타입, 분만형태 및 신생아활력지표를 포함하는 신생아정보를 갱신ㆍ수정하는 신생아정보부; 임산부의 정기적인 검진에 따른 초음파사진 및 태아의 발육상태를 포함하는 재태기간정보를 갱신ㆍ수정하는 재태기록부; 신생아의 진료기록, 투약기록, 입원ㆍ수술기록을 포함하는 신생아건강정보를 갱신ㆍ수정하는 신생아건강기록부; 신생아의 예방접종 순서와 접종기간 및 접종횟수를 포함하는 신생아예방접종정보를 갱신ㆍ수정하는 예방접종기록부; 신생아의 키, 몸무게, 머리둘레 및 치아개수를 포함하는 신생아발육생장정보를 갱신ㆍ수정하는 발육생장관리부; 신생아의 성장발육에 따른 건강일상 및 사진을 포함하는 성장일기정보를 갱신ㆍ수정하는 성장일기부; 및 신생아정보, 재태기간정보, 신생아건강정보, 신생아예방접종정보, 신생아발육생장정보 및 성장일기정보를 저장ㆍ갱신하는 신생아관리DB; 를 더 포함한다. 효 과- 5 -공개특허 10-2009-0094477상기와 같은 본 발명에 따르면, 건강관리서버를 통해 각종 검사결과를 포함하는 자신의 건강 의료기록 정보를 <15>스스로 평생 관리할 수 있도록 함으로써, 출생에서부터 노년기까지 평생에 걸쳐 모든 건강관련 정보들을 기록ㆍ관리하며, 개인단말기를 통해 장소에 제약됨 없이 언제 어디서든 열람ㆍ갱신할 수 있는 효과가 있다. 또한, 사용자가 직접 의료기록 정보를 관리함 따라 개인정보 유출을 사전에 차단하는 효과도 있다. <16>그리고, 진료기관에 종속됨 없이 사용자의 건강정보를 언제 어디에서든지 참고할 수 있고, 이전 검사 기록, 예 <17>방접종 기록 등 건강기록의 활용으로 불필요한 검사 배제 등에 따른 인적ㆍ물적 자원의 낭비를 미연에 방지함과아울러 사용자의 건강관리 및 증진을 도모하는 효과도 있다. 발명의 실시를 위한 구체적인 내용본 발명의 구체적인 특징 및 이점들은 첨부도면에 의거한 다음의 상세한 설명으로 더욱 명백해질 것이다. 이에 <18>앞서, 본 명세서 및 청구범위에 사용된 용어나 단어는 발명자가 그 자신의 발명을 가장 최선의 방법으로 설명하기 위해 용어의 개념을 적절하게 정의할 수 있다는 원칙에 입각하여 본 발명의 기술적 사상에 부합하는 의미와개념으로 해석되어야 할 것이다. 또한, 본 발명에 관련된 공지 기능 및 그 구성에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에는, 그 구체적인 설명을 생략하였음에 유의해야 할 것이다.도 1은 본 발명에 따른 지능형 개인 맞춤 건강관리 기록시스템(S)을 나타내는 구성도로서, 도시된 바와 같이, <19>개인단말기(100) 및 건강관리서버(200)를 포함한다.이하에서는 그 언급을 생략하겠으나, 본 발명의 개인단말기(100)와 건강관리서버(200)간 정보의 송수신은 정보 <20>통신망을 통해 이루어지는 것으로 상정하며, 개인단말기는 개인컴퓨터(PC) 및 인터넷 통신가능한 모바일 장치를포함한다.개인단말기(100)는 사용자 또는 진료기관으로부터 기본정보, 외래진료정보, 입원ㆍ수술정보, 건강검진정보, 산 <21>모관리정보 및 신생아관리정보를 포함하는 이른바, '건강정보'를 입력받아 건강관리서버(200)로 송신하며, 갱신된 건강정보를 수신하여 출력한다.한편, 건강관리서버(200)는 개인단말기(100)로부터 수신한 건강정보를 기저장된 건강정보와 대응되도록 갱신하 <22>여 갱신된 건강정보를 개인단말기(100)로 송신하는 기능을 수행하는바, 기본정보모듈(210), 외래진료모듈(220),입원ㆍ수술모듈(230), 건강검진모듈(240), 산모관리모듈(250) 및 신생아관리모듈(260)을 포함한다.도 2를 참조하여 살펴보면, 기본정보모듈(210)은 건강정보에 포함된 기본정보를 독출하여 사용자의 신상정보와, <23>활력상태정보, 특수이력정보, 가족력정보 및 보험상품정보을 포함하는 기본정보를 갱신ㆍ관리하는 기능을 수행하는바, 회원정보부(211), 활력상태부(212), 특수이력부(213), 가족력관리부(214), 보험관리부(215) 및 기본정보DB(216)를 포함한다.회원정보부(211)는 도 3에 도시된 바와 같이, 사용자의 성명, 성별, 거주지, 알레르기 유무, 가족력 유무 및 연 <24>락처를 포함하는 신상정보를 수정ㆍ갱신토록 한다.활력상태부(212)는 사용자의 신장, 몸무게, 혈액형, 혈압, 맥박, 흡연여부와 흡연량 및 음주여부와 음주량을 포 <25>함하는 사용자의 활력상태정보를 수정ㆍ갱신토록 하여 관리한다. 예를 들면 도 4에 도시된 바와 같이, 사용자가입력한 활력상태정보를 확인ㆍ갱신하여 지속적인 자기관리가 가능하다.특수이력부(213)는 사용자의 알레르기 발생일, 발생원인, 반응 및 치료방법을 포함하는 특수이력정보를 수정ㆍ <26>갱신토록 한다. 예를 들면 사용자가 도 5에 도시된 바와 같이 입력한 특수이력정보를 참고로 알레르기질환을 숙지토록하여 알레르기로 인한 2차 발명을 미연에 방지할 수 있다.가족력관리부(214)는 조부모, 부모, 사용자, 자녀를 포함하는 직계존속의 주요질병, 사망질환 및 현재 발병질환 <27>을 포함하는 가족력정보을 수정ㆍ갱신토록 하여 유전에 따른 취약질환을 대비하도록 한다.보험관리부(215)는 사용자가 가입한 복수개의 보험상품에 대한 보험가입자, 보험사명, 보장범위, 약관, 월 납입 <28>액 및 계약ㆍ만료일을 포함하는 보험상품정보를 수정ㆍ갱신토록 한다. 도 6에 도시된 바와 같이, 사용자가 가입한 보험상품정보를 입력하여 체계적인 보험관리를 가능케 한다.기본정보DB(216)는 신상정보, 활력상태정보, 특수이력정보, 가족력정보, 및 보험상품정보를 저장ㆍ갱신한다. <29>또한, 도 7을 참조하면, 외래진료모듈(220)은 건강정보에 포함된 외래진료정보를 독출하여 사용자의 진료검사정 <30>- 6 -공개특허 10-2009-0094477보 및 투약정보를 최근날짜순으로 색인하여 갱신ㆍ관리하는 기능을 수행하는바, 진료검사기록부(221), 진료투약정보부(222) 및 외래진료DB(223)를 포함한다. 예를 들면 도 8에 도시된 바와 같이, 사용자의 외래진료정보를 기록하고, 이를 최근날짜순으로 색인하여 빈번히 유발되는 질병에 대한 대처를 가능케 함과 아울러 타병원에서의진료시 해당 의사에게 참고자료로 제출할 수 있도록 한다.진료검사기록부(221)는 외래진료시 검사받은 사용자의 진료검사명, 검사기관, 검사목적 및 진단명을 포함하는 <31>진료검사정보를 수정ㆍ갱신토록 한다. 예를 들면 도 9에 도시된 바와 같이, 진료검사정보를 최근날짜순으로 색인하여 검사기록을 관리하고, 진료시 검사받았던 각종 파일(MRIㆍCTㆍX-ray사진, 진단서 및 처방전)을 저장ㆍ관리하여 타병원에서의 불필요한 재진료를 방지하도록 한다.진료투약정보부(222)는 사용자의 처방전에 따른 투약일자, 약품명, 제약회사명, 복용기간 및 복용법을 포함하는 <32>투약정보를 갱신ㆍ수정토록 하여 약물 오용으로 인한 폐해를 예방함은 물론 타병원에서의 진료에 참고할 수 있도록 한다. 예를 들면 도 10에 도시된 바와 같이, 투약정보를 최근날짜순으로 색인하여 투약기록을 관리하고,진료시 발부받은 처방전을 저장ㆍ관리하여 타병원에서의 처방전 발부에 참고하도록 한다.외래진료DB(223)는 진료검사정보 및 투약정보를 저장ㆍ갱신한다. <33>또한, 도 11을 참조하면, 입원ㆍ수술모듈(230)은 건강정보에 포함된 입원ㆍ수술정보를 독출하여 사용자가 입원 <34>한 병원명, 입원기간, 입원방법을 포함하는 입원내역정보와, 사용자가 수술한 병원명, 수술날짜, 수혈유무 및수혈종류를 포함하는 수술내역정보와, 입원ㆍ수술검사정보 및 입원ㆍ수술투약정보를 최근날짜순으로 색인하여갱신ㆍ관리하는 기능을 수행하는바, 입원ㆍ수술검사기록부(231), 입원ㆍ수술투약정보부(232), 및 입원ㆍ수술DB(233)를 포함한다. 예를 들면 도 12에 도시된 바와 같이, 사용자의 입원ㆍ수술내역정보를 저장ㆍ관리토록 하여 타병원에서의 입원ㆍ수술시 참고할 수 있도록 한다.입원ㆍ수술검사기록부(231)는 사용자가 입원ㆍ수술 기간동안 검사받은 사용자의 검사명, 입원ㆍ수술기관, 입원 <35>ㆍ수술목적 및 진단명을 포함하는 입원ㆍ수술검사정보를 갱신ㆍ수정한다.입원ㆍ수술투약정보부(232)는 사용자가 입원ㆍ수술 기간동안 처방받은 처방전의 투약일자, 약품명, 제약회사명, <36>복용기간 및 복용법을 포함하는 입원ㆍ수술투약정보를 갱신ㆍ수정토록 하여 약물 오용으로 인한 폐해를 예방토록하며, 입원ㆍ수술DB(233)는 입원내역정보, 수술내역정보, 입원ㆍ수술검사정보 및 입원ㆍ수술투약정보를 저장ㆍ갱신한다.또한, 도 13에 도시된 바와 같이, 건강검진모듈(240)은 건강정보에 포함된 건강검진정보를 독출하여 사용자의 <37>허리둘레, 콜레스테롤, 혈압, 중성지방 및 혈당정보를 포함하는 건강검진정보를 갱신ㆍ관리하는 기능을 수행하는바 , 건강검진정보를 저장ㆍ갱신하는 건강검진DB(241)를 포함한다. 예를 들면 도 14에 도시된 바와 같이, 사용자가 입력한 건강검진정보를 참고하여 누적된 건강검진정보에 대한 시계열적인 건강관리를 도모한다.또한, 도 15에 도시된 바와 같이, 산모관리모듈(250)은 건강정보에 포함된 산모관리정보를 독출하여 사용자의 <38>임신일, 최종 월경일, 인신 전ㆍ후의 체중변화, 임신의 횟수, 출산의 횟수, 자녀수, 자연 유산수, 인공 유산수,이상증상(뇨단백, 간염, 간염항체)을 포함하는 산모관리정보를 갱신ㆍ관리하는 기능을 수행하는바, 산모관리정보를 저장ㆍ갱신하는 산모관리DB(251)를 포함한다. 예를 들면 사용자가 도 16에 도시된 바와 같이, 산모관리정보를 갱신토록 하여 태아에게 유발될 위험요소를 미연에 방지하도록 한다.그리고, 신생아관리모듈(260)은 도 17에 도시된 바와 같이, 건강정보에 포함된 신생아관리정보를 독출하여 사용 <39>자가 신생아의 신생아정보, 재태기간정보, 신생아건강정보, 신생아예방접종정보, 신생아발육생장정보 및 성장일기정보를 포함하는 신생아관리정보를 갱신ㆍ관리하는 기능을 수행하는바, 신생아정보부(261), 재태기록부(262), 신생아건강기록부(263), 예방접종기록부(264), 발육생장관리부(265), 성장일기부(266) 및 신생아관리DB(267)를 포함한다.신생아정보부(261)는 사용자의 신생아 출생일, 성별, 출생병원, 전문의 성명, 출생시 몸무게, 혈액형, <40>혈액타입, 분만형태 및 신생아활력지표(Apgar score)를 포함하는 신생아정보를 갱신ㆍ수정토록 한다. 예를 들어사용자가 도 18에 도시된 바와 같은 신생아정보를 갱신ㆍ관리토록하고, 신생아의 출생시와 현재 기록을 참고로신생아의 정상발육에 참고자료로 활용토록 한다.재태기록부(262)는 임산부의 정기적인 검진에 따른 초음파사진 및 태아의 발육상태를 포함하는 재태기간정보를 <41>갱신ㆍ수정토록 한다.신생아건강기록부(263)는 사용자가 신생아의 진료기록, 투약기록, 입원ㆍ수술기록을 포함하는 신생아건강정보를 <42>- 7 -공개특허 10-2009-0094477갱신ㆍ수정토록 한다.예방접종기록부(264)는 사용자가 신생아 예방접종의 순서와 접종기간 및 접종횟수를 포함하는 신생아예방접종정 <43>보를 갱신ㆍ수정토록 한다. 예를 들면 도 19에 도시된 바와 같이, 사용자가 신생아예방접종정보에 따른 예방접종 완료후 이와 대응되는 신생아예방접종정보를 체크하고, 체크된 신생아예방접종정보를 갱신하여 지속적인 관리가 가능하다.발육생장관리부(265)는 사용자가 신생아의 키, 몸무게, 머리둘레 및 치아개수를 포함하는 신생아발육생장정보를 <44>갱신ㆍ수정토록 한다. 예를 들면 도 20에 도시된 바와 같이, 사용자가 지속적으로 갱신한 신생아발육생장정보에따른 차트를 통해 신생아의 소아비만 및 소아성인병을 예방하고, 신생아의 발육생장이 정상범위에서 벗어나지않도록 관리할 수 있다.성장일기부(266)는 사용자가 신생아의 성장발육에 따른 건강일상 및 사진을 포함하는 성장일기정보를 갱신ㆍ수 <45>정토록하며, 신생아관리DB(267)는 신생아정보, 재태기간정보, 신생아건강정보, 신생아예방접종정보, 신생아발육생장정보 및 성장일기정보를 저장ㆍ갱신한다.이상으로 본 발명의 기술적 사상을 예시하기 위한 바람직한 실시예와 관련하여 설명하고 도시하였지만, 본 발명 <46>은 이와 같이 도시되고 설명된 그대로의 구성 및 작용에만 국한되는 것이 아니며, 기술적 사상의 범주를 일탈함이 없이 본 발명에 대해 다수의 변경 및 수정이 가능함을 당업자들은 잘 이해할 수 있을 것이다. 따라서, 그러한 모든 적절한 변경 및 수정과 균등물들도 본 발명의 범위에 속하는 것으로 간주되어야 할 것이다.도면의 간단한 설명도 1은 본 발명에 따른 지능형 개인 맞춤 건강관리 기록시스템을 나타내는 구성도, <47>도 2는 본 발명의 건강관리서버에 따른 기본정보모듈을 나타내는 구성도, <48>도 3은 본 발명의 기본정보모듈에 따른 회원정보부를 예시한 도면, <49>도 4는 본 발명의 기본정보모듈에 따른 활력상태부를 예시한 도면, <50>도 5는 본 발명의 기본정보모듈에 따른 특수이력부를 예시한 도면, <51>도 6은 본 발명의 기본정보모듈에 따른 보험관리부를 예시한 도면, <52>도 7은 본 발명의 건강관리서버에 따른 외래진료모듈을 나타내는 구성도, <53>도 8은 본 발명의 건강관리서버에 따른 외래진료모듈을 예시한 도면, <54>도 9는 본 발명의 외래진료모듈에 따른 진료검사기록부를 예시한 도면, <55>도 10은 본 발명의 외래진료모듈에 따른 진료투약정보부를 예시한 도면, <56>도 11은 본 발명의 건강관리서버에 따른 입원ㆍ수술모듈을 나타내는 구성도, <57>도 12는 본 발명의 건강관리서버에 따른 입원ㆍ수술모듈을 예시한 도면, <58>도 13은 본 발명의 건강관리서버에 따른 건강검진모듈을 나타내는 구성도, <59>도 14는 본 발명의 건강관리서버에 따른 건강검진모듈을 예시한 도면, <60>도 15는 본 발명의 건강관리서버에 따른 산모관리모듈을 나타내는 구성도, <61>도 16은 본 발명의 건강관리서버에 따른 산모관리모듈을 예시한 도면, <62>도 17은 본 발명의 건강관리서버에 따른 신생아관리모듈을 나타내는 구성도, <63>도 18은 본 발명의 신생아관리모듈에 따른 신생아정보부를 예시한 도면, <64>도 19는 본 발명의 신생아관리모듈에 따른 예방접종기록부를 예시한 도면, <65>도 20은 본 발명의 신생아관리모듈에 따른 발육생장관리부를 예시한 도면. <66>** 도면의 주요 부분에 대한 부호의 설명 ** <67>S: 맞춤형 건강관리 기록시스템 100: 개인단말기 <68>- 8 -공개특허 10-2009-0094477110: 입력모듈 120: 통신모듈 <69>130: 출력모듈 140: 제어모듈 <70>200: 건강관리서버 210: 기본정보모듈 <71>211: 회원정보부 212: 활력상태부 <72>213: 특수이력부 214: 가족력관리부 <73>215: 보험관리부 216: 기본정보DB <74>220: 외래진료모듈 221: 진료검사기록부 <75>222: 진료투약정보부 223: 외래진료DB <76>230: 입원ㆍ수술모듈 231: 입원ㆍ수술검사기록부 <77>232: 입원ㆍ수술투약정보부 233: 입원ㆍ수술DB <78>240: 건강검진모듈 241: 건강검진DB <79>250: 산모관리모듈 251: 산모관리DB <80>260: 신생아관리모듈 261: 신생아정보부 <81>262: 재태기록부 263: 신생아건강기록부 <82>264: 예방접정기록부 265: 발육생장관리부 <83>266: 성장일기부 267: 신생아관리DB <84>- 9 -공개특허 10-2009-0094477도면 도면1- 10 -공개특허 10-2009-0094477 도면2 도면3- 11 -공개특허 10-2009-0094477 도면4 도면5- 12 -공개특허 10-2009-0094477 도면6 도면7- 13 -공개특허 10-2009-0094477 도면8 도면9- 14 -공개특허 10-2009-0094477 도면10 도면11- 15 -공개특허 10-2009-0094477 도면12 도면13- 16 -공개특허 10-2009-0094477 도면14 도면15- 17 -공개특허 10-2009-0094477 도면16 도면17- 18 -공개특허 10-2009-0094477 도면18 도면19- 19 -공개특허 10-2009-0094477 도면20- 20 -공개특허 10-2009-0094477"}
{"patent_id": "10-2008-0019442", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 지능형 개인 맞춤형 건강관리 기록시스템에 관한 것으로서, 사용자 또는 진료기관으로부터 기본정보, 신생아관리정보, 산모관리정보, 외래진료정보, 입원ㆍ수술정보, 건강검진정보 등을 포함하는 건강정보를 입력받 아 건강관리서버로 송신하고, 갱신된 건강정보를 수신하여 출력하는 개인단말기; 및 개인단말기로부터 수신한 건 강정보를 기저장된 건강정보와 대응되도록 갱신하여 갱신된 건강정보를 개인단말기로 송신하는 건강관리서버; 를 포함하는 것을 특징으로 한다. 상기와 같은 본 발명에 따르면, 건강관리서버를 통해 각종 검사결과를 포함하는 자신의 건강 의료기록 정보를 스 스로 평생 관리할 수 있도록 함으로써, 출생에서부터 노년기까지 평생에 걸쳐 모든 건강관련 정보들을 기록ㆍ관 리하며, 개인단말기를 통해 장소에 제약됨 없이 언제 어디서든 열람ㆍ갱신할 수 있고, 사용자가 직접 의료기록 정보를 관리함 따라 개인정보 유출을 사전에 차단하며, 진료기관에 종속됨 없이 사용자의 건강정보를 참고할 수 있어 불필요한 검사에 따른 인적ㆍ물적 자원의 낭비를 미연에 방지함과 아울러 사용자의 건강관리 및 증진을 도 모한다."}
{"patent_id": "10-2008-0019442", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 건강관리 기록시스템에 관한 것으로서, 더욱 상세하게는 개인의 각종 검사결과를 포함하는 건강정보 <1> 를 출생에서부터 노년기에 이르기까지 평생에 걸쳐 개인 홈페이지 형태로 저장, 관리 및 보유하는 기술에 관한 것이다."}
{"patent_id": "10-2008-0019442", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "근래에 우리나라는 급격한 고령화 및 생활양식 변화로 지속적 관리를 요하는 각종 질환과 암, 고혈압, 당뇨 등 <2> 과 같은 만성 질환 등의 다양한 질환이 급증하고 있으며, 건강에 대한 관심이 증대됨에 따라 해마다 개인 지출 하는 의료비가 지속적으로 증가하고 있는 실정이다. 또한, 세계 의료계는 의료시장의 전면개방을 앞두고 글로벌 경쟁력 강화와 고객서비스 개선을 위해 빠르게 정보 <3> 화되고 있으며, 환자의 진료에 EMR(Electronic Medical Record: 전자의료기록) 시스템을 도입함으로써, 진료차 트의 전산화를 꾀하고, 이에 따라 신속한 업무처리와 인력 및 비용 절감함과 아울러 환자의 대기시간을 단축시 키는 효과가 있다. 그러나, 이러한 EMR 시스템은 병원마다 개별적으로 구축하여 운영되고 있는바, 각각 병원간의 호환이 어렵고, <4> 막대한 양의 자료 저장 및 관리에 한계가 있어 일정기간(최대 5년) 내외의 최신 데이터만 보존하고 있는 실정이 다. 이러한 EMR 시스템의 대안으로 보건복지부가 주관하여 2030년 서비스를 목표로 EHR(Electronic Health Record: <5> 전자건강기록) 시스템을 병원 중심(Hospital-oriented)으로 구축ㆍ추진하고 있으나, 방대한 자료의 관리와 시스 템 통합의 표준화, 개인의 건강정보 접근 어려움, 개인정보유출의 우려 등 산적한 문제를 떠안고 있으며, 무엇 보다 EHR 시스템의 개발ㆍ보급되기까지 상당한 시간이 소요되어 국민들이 실질적인 혜택을 보장받기 어렵다."}
{"patent_id": "10-2008-0019442", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "발명의 내용 해결 하고자하는 과제 본 발명은 상기와 같은 문제점을 해소하고자 안출된 것으로서, 자신의 각종 검사결과를 포함하는 건강 의료기록 <6> 정보를 건강관리서버를 통해 스스로 평생 관리할 수 있도록 함으로써, 출생에서부터 노년기까지 평생에 걸쳐 모 든 건강관련 정보들을 기록ㆍ관리하며, 개인단말기를 통해 장소에 제약됨 없이 언제 어디서든 열람ㆍ갱신할 수 - 4 -공개특허 10-2009-0094477있도록 한다. 과제 해결수단 이러한 기술적 과제를 달성하기 위한 지능형 개인 맞춤형 건강관리 기록시스템은, 사용자 또는 진료기관으로부 <7> 터 기본정보, 외래진료정보, 입원ㆍ수술정보, 건강검진정보, 산모관리정보 및 신생아관리정보를 포함하는 건강 정보를 입력받아 건강관리서버로 송신하고, 갱신된 건강정보를 수신하여 출력하는 개인단말기; 및 개인단말기로 부터 수신한 건강정보를 기저장된 건강정보와 대응되도록 갱신하여 갱신된 건강정보를 개인단말기로 송신하는 건강관리서버; 를 포함한다. 또한, 건강관리서버는, 사용자의 신상정보, 활력상태정보, 특수이력정보, 가족력정보 및 보험상품정보를 포함하 <8> 는 기본정보를 갱신ㆍ관리하는 기본정보모듈; 사용자의 진료검사정보 및 투약정보를 포함하는 외래진료정보를 갱신ㆍ관리하는 외래진료모듈; 사용자가 입원한 병원명, 입원기간, 입원방법을 포함하는 입원내역정보, 수술내 역정보, 사용자가 수술한 병원명, 수술날짜, 수혈유무 및 수혈종류를 포함하는 입원ㆍ수술검사정보 및 입원ㆍ수 술투약정보를 포함하는 입원ㆍ수술정보를 최근날짜순으로 색인하여 갱신ㆍ관리하는 입원ㆍ수술모듈; 사용자의 허리둘레, 콜레스테롤, 혈압, 중성지방 및 혈당정보를 포함하는 건강검진정보를 갱신ㆍ관리하는 건강검진모듈; 사용자의 임신일, 최종 월경일, 인신 전ㆍ후의 체중변화, 임신의 횟수, 출산의 횟수, 자녀수, 자연 유산수, 인 공 유산수, 이상증상(뇨단백, 간염, 간염항체)을 포함하는 산모관리정보를 갱신ㆍ관리하는 산모관리모듈; 및 사 용자 신생아의 신생아정보, 재태기간정보, 신생아건강정보, 신생아예방접종정보, 신생아발육생장정보 및 성장일 기정보를 포함하는 신생아관리정보를 갱신ㆍ관리하는 신생아관리모듈; 을 포함한다. 바람직하게 기본정보모듈은, 사용자의 성명, 성별, 거주지, 알레르기 유무, 가족력 유무 및 연락처를 포함하는 <9> 신상정보를 수정ㆍ갱신하는 회원정보부; 사용자의 신장, 몸무게, 혈액형, 혈압, 맥박, 흡연여부와 흡연량 및 음 주여부와 음주량을 포함하는 활력상태정보를 수정ㆍ갱신하는 활력상태부; 사용자의 알레르기 발생일, 발생원인, 반응 및 치료방법을 포함하는 특수이력정보를 수정ㆍ갱신하는 특수이력부; 사용자의 직계존속에 대한 주요질병, 사망질환 및 현재 발병질환을 포함하는 가족력정보를 수정ㆍ갱신하는 가족력관리부; 사용자가 가입한 복수개의 보험상품에 대한 보험가입자명, 보험사명, 보장범위, 약관, 월 납입액 및 계약ㆍ만료일을 포함하는 보험상품정 보를 수정ㆍ갱신하는 보험관리부; 및 신상정보, 활력상태정보, 특수이력정보, 가족력정보 및 보험상품정보를 저 장ㆍ갱신하는 기본정보DB; 를 더 포함한다. 또한 바람직하게 외래진료모듈은, 외래진료시 검사받은 사용자의 진료검사명, 검사기관, 검사목적 및 진단명을 <10> 포함하는 진료검사정보를 수정ㆍ갱신하는 진료검사기록부; 사용자의 처방전에 따른 투약일자, 약품명, 제약회사 명, 복용기간 및 복용법을 포함하는 투약정보를 수정ㆍ갱신하는 진료투약정보부; 및 진료검사정보 및 투약정보 를 저장ㆍ갱신하는 외래진료DB; 를 더 포함한다. 또한 바람직하게 입원ㆍ수술모듈은, 사용자가 입원ㆍ수술 기간동안 검사받은 검사명, 입원ㆍ수술기관, 입원ㆍ수 <11> 술목적 및 진단명을 포함하는 입원ㆍ수술검사정보를 갱신ㆍ수정하는 입원ㆍ수술검사기록부; 사용자가 입원ㆍ수 술 기간동안 처방받은 처방전의 투약일자, 약품명, 제약회사명, 복용기간 및 복용법을 포함하는 입원ㆍ수술투약 정보를 갱신ㆍ수정하는 입원ㆍ수술투약정보부; 및 입원내역정보, 수술내역정보, 입원ㆍ수술검사정보 및 입원ㆍ 수술투약정보를 저장ㆍ갱신하는 입원ㆍ수술DB; 를 더 포함한다. 또한 바람직하게 건강검진모듈은, 건강검진정보를 저장ㆍ갱신하는 건강검진DB; 를 더 포함한다. <12> 또한 바람직하게 산모관리모듈은, 산모관리정보를 저장ㆍ갱신하는 산모관리DB; 를 더 포함한다. <13> 그리고 바람직하게 신생아관리모듈은, 신생아의 신생아 출생일, 성별, 출생병원, 전문의 성명, 출생시 몸무게, <14> 혈액형, 혈액타입, 분만형태 및 신생아활력지표를 포함하는 신생아정보를 갱신ㆍ수정하는 신생아정보부; 임산부 의 정기적인 검진에 따른 초음파사진 및 태아의 발육상태를 포함하는 재태기간정보를 갱신ㆍ수정하는 재태기록 부; 신생아의 진료기록, 투약기록, 입원ㆍ수술기록을 포함하는 신생아건강정보를 갱신ㆍ수정하는 신생아건강기 록부; 신생아의 예방접종 순서와 접종기간 및 접종횟수를 포함하는 신생아예방접종정보를 갱신ㆍ수정하는 예방 접종기록부; 신생아의 키, 몸무게, 머리둘레 및 치아개수를 포함하는 신생아발육생장정보를 갱신ㆍ수정하는 발 육생장관리부; 신생아의 성장발육에 따른 건강일상 및 사진을 포함하는 성장일기정보를 갱신ㆍ수정하는 성장일 기부; 및 신생아정보, 재태기간정보, 신생아건강정보, 신생아예방접종정보, 신생아발육생장정보 및 성장일기정 보를 저장ㆍ갱신하는 신생아관리DB; 를 더 포함한다. 효 과 - 5 -공개특허 10-2009-0094477상기와 같은 본 발명에 따르면, 건강관리서버를 통해 각종 검사결과를 포함하는 자신의 건강 의료기록 정보를 <15> 스스로 평생 관리할 수 있도록 함으로써, 출생에서부터 노년기까지 평생에 걸쳐 모든 건강관련 정보들을 기록ㆍ 관리하며, 개인단말기를 통해 장소에 제약됨 없이 언제 어디서든 열람ㆍ갱신할 수 있는 효과가 있다. 또한, 사용자가 직접 의료기록 정보를 관리함 따라 개인정보 유출을 사전에 차단하는 효과도 있다. <16> 그리고, 진료기관에 종속됨 없이 사용자의 건강정보를 언제 어디에서든지 참고할 수 있고, 이전 검사 기록, 예 <17> 방접종 기록 등 건강기록의 활용으로 불필요한 검사 배제 등에 따른 인적ㆍ물적 자원의 낭비를 미연에 방지함과 아울러 사용자의 건강관리 및 증진을 도모하는 효과도 있다. 발명의 실시를 위한 구체적인 내용 본 발명의 구체적인 특징 및 이점들은 첨부도면에 의거한 다음의 상세한 설명으로 더욱 명백해질 것이다. 이에 <18> 앞서, 본 명세서 및 청구범위에 사용된 용어나 단어는 발명자가 그 자신의 발명을 가장 최선의 방법으로 설명하 기 위해 용어의 개념을 적절하게 정의할 수 있다는 원칙에 입각하여 본 발명의 기술적 사상에 부합하는 의미와 개념으로 해석되어야 할 것이다. 또한, 본 발명에 관련된 공지 기능 및 그 구성에 대한 구체적인 설명이 본 발 명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에는, 그 구체적인 설명을 생략하였음에 유의해야 할 것 이다. 도 1은 본 발명에 따른 지능형 개인 맞춤 건강관리 기록시스템(S)을 나타내는 구성도로서, 도시된 바와 같이, <19> 개인단말기 및 건강관리서버를 포함한다. 이하에서는 그 언급을 생략하겠으나, 본 발명의 개인단말기와 건강관리서버간 정보의 송수신은 정보 <20> 통신망을 통해 이루어지는 것으로 상정하며, 개인단말기는 개인컴퓨터(PC) 및 인터넷 통신가능한 모바일 장치를 포함한다. 개인단말기는 사용자 또는 진료기관으로부터 기본정보, 외래진료정보, 입원ㆍ수술정보, 건강검진정보, 산 <21> 모관리정보 및 신생아관리정보를 포함하는 이른바, '건강정보'를 입력받아 건강관리서버로 송신하며, 갱신 된 건강정보를 수신하여 출력한다. 한편, 건강관리서버는 개인단말기로부터 수신한 건강정보를 기저장된 건강정보와 대응되도록 갱신하 <22> 여 갱신된 건강정보를 개인단말기로 송신하는 기능을 수행하는바, 기본정보모듈, 외래진료모듈, 입원ㆍ수술모듈, 건강검진모듈, 산모관리모듈 및 신생아관리모듈을 포함한다. 도 2를 참조하여 살펴보면, 기본정보모듈은 건강정보에 포함된 기본정보를 독출하여 사용자의 신상정보와, <23> 활력상태정보, 특수이력정보, 가족력정보 및 보험상품정보을 포함하는 기본정보를 갱신ㆍ관리하는 기능을 수행 하는바, 회원정보부, 활력상태부, 특수이력부, 가족력관리부, 보험관리부 및 기본정 보DB를 포함한다. 회원정보부는 도 3에 도시된 바와 같이, 사용자의 성명, 성별, 거주지, 알레르기 유무, 가족력 유무 및 연 <24> 락처를 포함하는 신상정보를 수정ㆍ갱신토록 한다. 활력상태부는 사용자의 신장, 몸무게, 혈액형, 혈압, 맥박, 흡연여부와 흡연량 및 음주여부와 음주량을 포 <25> 함하는 사용자의 활력상태정보를 수정ㆍ갱신토록 하여 관리한다. 예를 들면 도 4에 도시된 바와 같이, 사용자가 입력한 활력상태정보를 확인ㆍ갱신하여 지속적인 자기관리가 가능하다. 특수이력부는 사용자의 알레르기 발생일, 발생원인, 반응 및 치료방법을 포함하는 특수이력정보를 수정ㆍ <26> 갱신토록 한다. 예를 들면 사용자가 도 5에 도시된 바와 같이 입력한 특수이력정보를 참고로 알레르기질환을 숙 지토록하여 알레르기로 인한 2차 발명을 미연에 방지할 수 있다. 가족력관리부는 조부모, 부모, 사용자, 자녀를 포함하는 직계존속의 주요질병, 사망질환 및 현재 발병질환 <27> 을 포함하는 가족력정보을 수정ㆍ갱신토록 하여 유전에 따른 취약질환을 대비하도록 한다. 보험관리부는 사용자가 가입한 복수개의 보험상품에 대한 보험가입자, 보험사명, 보장범위, 약관, 월 납입 <28> 액 및 계약ㆍ만료일을 포함하는 보험상품정보를 수정ㆍ갱신토록 한다. 도 6에 도시된 바와 같이, 사용자가 가입 한 보험상품정보를 입력하여 체계적인 보험관리를 가능케 한다. 기본정보DB는 신상정보, 활력상태정보, 특수이력정보, 가족력정보, 및 보험상품정보를 저장ㆍ갱신한다. <29> 또한, 도 7을 참조하면, 외래진료모듈은 건강정보에 포함된 외래진료정보를 독출하여 사용자의 진료검사정 <30> - 6 -공개특허 10-2009-0094477보 및 투약정보를 최근날짜순으로 색인하여 갱신ㆍ관리하는 기능을 수행하는바, 진료검사기록부, 진료투약 정보부 및 외래진료DB를 포함한다. 예를 들면 도 8에 도시된 바와 같이, 사용자의 외래진료정보를 기 록하고, 이를 최근날짜순으로 색인하여 빈번히 유발되는 질병에 대한 대처를 가능케 함과 아울러 타병원에서의 진료시 해당 의사에게 참고자료로 제출할 수 있도록 한다. 진료검사기록부는 외래진료시 검사받은 사용자의 진료검사명, 검사기관, 검사목적 및 진단명을 포함하는 <31> 진료검사정보를 수정ㆍ갱신토록 한다. 예를 들면 도 9에 도시된 바와 같이, 진료검사정보를 최근날짜순으로 색 인하여 검사기록을 관리하고, 진료시 검사받았던 각종 파일(MRIㆍCTㆍX-ray사진, 진단서 및 처방전)을 저장ㆍ관 리하여 타병원에서의 불필요한 재진료를 방지하도록 한다. 진료투약정보부는 사용자의 처방전에 따른 투약일자, 약품명, 제약회사명, 복용기간 및 복용법을 포함하는 <32> 투약정보를 갱신ㆍ수정토록 하여 약물 오용으로 인한 폐해를 예방함은 물론 타병원에서의 진료에 참고할 수 있 도록 한다. 예를 들면 도 10에 도시된 바와 같이, 투약정보를 최근날짜순으로 색인하여 투약기록을 관리하고, 진료시 발부받은 처방전을 저장ㆍ관리하여 타병원에서의 처방전 발부에 참고하도록 한다. 외래진료DB는 진료검사정보 및 투약정보를 저장ㆍ갱신한다. <33> 또한, 도 11을 참조하면, 입원ㆍ수술모듈은 건강정보에 포함된 입원ㆍ수술정보를 독출하여 사용자가 입원 <34> 한 병원명, 입원기간, 입원방법을 포함하는 입원내역정보와, 사용자가 수술한 병원명, 수술날짜, 수혈유무 및 수혈종류를 포함하는 수술내역정보와, 입원ㆍ수술검사정보 및 입원ㆍ수술투약정보를 최근날짜순으로 색인하여 갱신ㆍ관리하는 기능을 수행하는바, 입원ㆍ수술검사기록부, 입원ㆍ수술투약정보부, 및 입원ㆍ수술 DB를 포함한다. 예를 들면 도 12에 도시된 바와 같이, 사용자의 입원ㆍ수술내역정보를 저장ㆍ관리토록 하 여 타병원에서의 입원ㆍ수술시 참고할 수 있도록 한다. 입원ㆍ수술검사기록부는 사용자가 입원ㆍ수술 기간동안 검사받은 사용자의 검사명, 입원ㆍ수술기관, 입원 <35> ㆍ수술목적 및 진단명을 포함하는 입원ㆍ수술검사정보를 갱신ㆍ수정한다. 입원ㆍ수술투약정보부는 사용자가 입원ㆍ수술 기간동안 처방받은 처방전의 투약일자, 약품명, 제약회사명, <36> 복용기간 및 복용법을 포함하는 입원ㆍ수술투약정보를 갱신ㆍ수정토록 하여 약물 오용으로 인한 폐해를 예방토 록하며, 입원ㆍ수술DB는 입원내역정보, 수술내역정보, 입원ㆍ수술검사정보 및 입원ㆍ수술투약정보를 저장 ㆍ갱신한다. 또한, 도 13에 도시된 바와 같이, 건강검진모듈은 건강정보에 포함된 건강검진정보를 독출하여 사용자의 <37> 허리둘레, 콜레스테롤, 혈압, 중성지방 및 혈당정보를 포함하는 건강검진정보를 갱신ㆍ관리하는 기능을 수행하 는바 , 건강검진정보를 저장ㆍ갱신하는 건강검진DB를 포함한다. 예를 들면 도 14에 도시된 바와 같이, 사 용자가 입력한 건강검진정보를 참고하여 누적된 건강검진정보에 대한 시계열적인 건강관리를 도모한다. 또한, 도 15에 도시된 바와 같이, 산모관리모듈은 건강정보에 포함된 산모관리정보를 독출하여 사용자의 <38> 임신일, 최종 월경일, 인신 전ㆍ후의 체중변화, 임신의 횟수, 출산의 횟수, 자녀수, 자연 유산수, 인공 유산수, 이상증상(뇨단백, 간염, 간염항체)을 포함하는 산모관리정보를 갱신ㆍ관리하는 기능을 수행하는바, 산모관리정 보를 저장ㆍ갱신하는 산모관리DB를 포함한다. 예를 들면 사용자가 도 16에 도시된 바와 같이, 산모관리정 보를 갱신토록 하여 태아에게 유발될 위험요소를 미연에 방지하도록 한다. 그리고, 신생아관리모듈은 도 17에 도시된 바와 같이, 건강정보에 포함된 신생아관리정보를 독출하여 사용 <39> 자가 신생아의 신생아정보, 재태기간정보, 신생아건강정보, 신생아예방접종정보, 신생아발육생장정보 및 성장 일기정보를 포함하는 신생아관리정보를 갱신ㆍ관리하는 기능을 수행하는바, 신생아정보부, 재태기록부 , 신생아건강기록부, 예방접종기록부, 발육생장관리부, 성장일기부 및 신생아관리 DB를 포함한다. 신생아정보부는 사용자의 신생아 출생일, 성별, 출생병원, 전문의 성명, 출생시 몸무게, 혈액형, <40> 혈액타입, 분만형태 및 신생아활력지표(Apgar score)를 포함하는 신생아정보를 갱신ㆍ수정토록 한다. 예를 들어 사용자가 도 18에 도시된 바와 같은 신생아정보를 갱신ㆍ관리토록하고, 신생아의 출생시와 현재 기록을 참고로 신생아의 정상발육에 참고자료로 활용토록 한다. 재태기록부는 임산부의 정기적인 검진에 따른 초음파사진 및 태아의 발육상태를 포함하는 재태기간정보를 <41> 갱신ㆍ수정토록 한다. 신생아건강기록부는 사용자가 신생아의 진료기록, 투약기록, 입원ㆍ수술기록을 포함하는 신생아건강정보를 <42> - 7 -공개특허 10-2009-0094477갱신ㆍ수정토록 한다. 예방접종기록부는 사용자가 신생아 예방접종의 순서와 접종기간 및 접종횟수를 포함하는 신생아예방접종정 <43> 보를 갱신ㆍ수정토록 한다. 예를 들면 도 19에 도시된 바와 같이, 사용자가 신생아예방접종정보에 따른 예방접 종 완료후 이와 대응되는 신생아예방접종정보를 체크하고, 체크된 신생아예방접종정보를 갱신하여 지속적인 관 리가 가능하다. 발육생장관리부는 사용자가 신생아의 키, 몸무게, 머리둘레 및 치아개수를 포함하는 신생아발육생장정보를 <44> 갱신ㆍ수정토록 한다. 예를 들면 도 20에 도시된 바와 같이, 사용자가 지속적으로 갱신한 신생아발육생장정보에 따른 차트를 통해 신생아의 소아비만 및 소아성인병을 예방하고, 신생아의 발육생장이 정상범위에서 벗어나지 않도록 관리할 수 있다. 성장일기부는 사용자가 신생아의 성장발육에 따른 건강일상 및 사진을 포함하는 성장일기정보를 갱신ㆍ수 <45> 정토록하며, 신생아관리DB는 신생아정보, 재태기간정보, 신생아건강정보, 신생아예방접종정보, 신생아발육 생장정보 및 성장일기정보를 저장ㆍ갱신한다. 이상으로 본 발명의 기술적 사상을 예시하기 위한 바람직한 실시예와 관련하여 설명하고 도시하였지만, 본 발명 <46> 은 이와 같이 도시되고 설명된 그대로의 구성 및 작용에만 국한되는 것이 아니며, 기술적 사상의 범주를 일탈함 이 없이 본 발명에 대해 다수의 변경 및 수정이 가능함을 당업자들은 잘 이해할 수 있을 것이다. 따라서, 그러 한 모든 적절한 변경 및 수정과 균등물들도 본 발명의 범위에 속하는 것으로 간주되어야 할 것이다."}
