{"patent_id": "10-2023-7028264", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0135622", "출원번호": "10-2023-7028264", "발명의 명칭": "트랜스듀서 어레이 배치 최적화를 위한 의료 이미지 향상 방법, 시스템 및 장치", "출원인": "노보큐어 게엠베하", "발명자": "샤미르, 루벤 루비"}}
{"patent_id": "10-2023-7028264", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "3차원 모델을 생성하기 위한 컴퓨터로 구현된 방법으로, 상기 컴퓨터는 하나 이상의 프로세서들 및 상기 하나이상의 프로세서들에 의하여 억세스 가능한 메모리를 포함하고, 상기 메모리는 상기 하나 이상의 프로세서들에의하여 실행될 때 상기 컴퓨터가 상기 방법을 수행하게 하는 명령들을 저장하며, 상기 방법은:제1 이미지 양식의 상기 환자의 신체의 제1 부분의 제1 이미지 데이터를 수신하는 단계;제2 이미지 양식의 상기 환자의 신체의 제2 부분의 제1 이미지 데이터를 수신하는 단계;상기 제2 이미지 양식에서 상기 제1 이미지 양식으로 상기 이미지 데이터를 수정하는 단계 및상기 제1 이미지 양식의 제1 이미지 데이터와 상기 제2 이미지 양식의 수정된 이미지 데이터에 기초하여, 상기환자 신체의 상기 제2 부분 및 상기 제1 부분의 3차원 모델을 생성하는 단계를 포함하는 방법."}
{"patent_id": "10-2023-7028264", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 방법은이미지 양식 변환 모델을 생성하는 단계를 더 포함하며, 상기 제2 이미지 양식에서 상기 제1 이미지 양식으로 상기 제2 이미지 데이터를 수정하는 단계는, 상기 제2 이미지 양식의 상기 제2 이미지 데이터에 상기 이미지 양식 변환 모델을 적용하는 단계를 포함하는 방법."}
{"patent_id": "10-2023-7028264", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 이미지 양식 변환 모델을 생성하는 단계는복수의 대상의 제1 이미지 양식의 상기 환자 신체의 상기 제1 부분에 대한 복수의 이미지 데이터를 수신하는 단계; 및복수의 대상의 제2 이미지 양식의 상기 환자 신체의 상기 제2 부분에 대한 제2 복수의 이미지 데이터를 수신하는 단계를 포함하며, 상기 이미지 양식 변환 모델은 상기 제1 복수의 이미지 데이터 및 상기 제2 복수의 이미지 데이터의 분석에 기초하여 생성되는 방법."}
{"patent_id": "10-2023-7028264", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 분석은 생성적 적대적 네트워크(GAN, generative adversary network) 분석, MedGAN 분석, 초해상도 GAN 분석, pix2pixGAN 분석, 사이클GAN 분석, 디스코GAN 분석, Fila-sGAN 분석, 투영 적대적 네트워크(PAN, projectiveadversary network) 분석, 변형 자동 인코더(VAE, variational auto encoder) 분석 및 회귀 분석 중 적어도 하나를 포함하는 방법."}
{"patent_id": "10-2023-7028264", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 공개특허 10-2023-0135622-3-상기 방법은,상기 환자의 상기 제2 부분 및 상기 제1 부분의 상기 3차원 모델에 기초하여 상기 환자 신체의 상기 제2 부분 및 상기 제1 부분의 적어도 하나를 따라 트랜스듀서 어레이 배치 맵을 결정하는 단계를 더 포함하는 방법."}
{"patent_id": "10-2023-7028264", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "3차원 모델을 생성하기 위한 컴퓨터로 구현된 방법으로, 상기 컴퓨터는 하나 이상의 프로세서들 및 상기 하나이상의 프로세서들에 의하여 억세스 가능한 메모리를 포함하고, 상기 메모리는 상기 하나 이상의 프로세서들에의하여 수행될 때 상기 컴퓨터가 상기 방법을 수행하게 하는 명령어를 저장하고, 상기 방법은:환자 신체의 제1 부분의 제1 이미지 데이터를 수신-상기 신체의 상기 제1 부분은 완전한 신체보다 부족함- 하는단계;복수 대상체의 상기 신체의 복수의 제2 이미지 데이터를 수신하는 단계;상기 제1 이미지 데이터 및 상기 완전한 신체 모델에 기초하여 상기 신체의 제2 부분의 제3 이미지 데이터를 생성하는 단계 및상기 제1 이미지 데이터와 상기 제3 이미지 데이터에 기초하여 상기 환자의 상기 신체의 3차원 모델을 생성하는단계를 포함하는 방법."}
{"patent_id": "10-2023-7028264", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 복수의 제2 이미지 데이터 각각을 제1 부분 이미지 데이터 및 제2 부분 이미지 데이터로 분할-상기 제1 부분 이미지 데이터는 상응하는 대상체의 상기 신체의 상기 제1 부분을 포함하고, 상기 제2 부분 이미지 데이터는상기 상응하는 대상체의 상기 신체의 또다른 부분을 포함함-하는 단계를 더 포함하는 방법."}
{"patent_id": "10-2023-7028264", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 방법은, 상기 복수의 대상체 각각에 대한 상기 제1 부분 이미지 데이터 및 제2 부분 이미지 데이터의 분석을 수행하는단계를 더 포함하는 방법."}
{"patent_id": "10-2023-7028264", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 분석은 통계적 형상 분석, 능동적 외관 분석 또는 글로벌 이미지 통계 분석 중 적어도 하나를 포함하는 방법."}
{"patent_id": "10-2023-7028264", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제6항에 있어서,상기 제1 이미지 데이터에 기초하여상기 환자의 신체 부분에 대한 상기 3차원 모델을 생성하기 위하여 상기 환자의 신체 부위에 대한 상기 제2 부분의 이미지 데이터가 요청됨을 결정하는 단계를 더 포함하는 방법."}
{"patent_id": "10-2023-7028264", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제6항에 있어서,상기 환자의 상기 신체의 상기 3차원 모델에 기초하여 상기 환자의 상기 신체를 따른 트랜스듀서 어레이 배치 맵을 결정하는 단계를 더 포함하는 방법.공개특허 10-2023-0135622-4-청구항 12 제6항에 있어서,상기 신체 부분은 머리이고, 상기 신체 부분의 상기 제1 이미지 데이터는 상기 환자의 상기 머리의 꼭대기 부분을 포함하지 않는 방법."}
{"patent_id": "10-2023-7028264", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "3차원 모델을 생성하기 위한 컴퓨터로 구현된 방법으로, 상기 컴퓨터는 하나 이상의 프로세서들과 상기 하나 이상의 프로세서들에 의하여 억세스 가능한 메모리를 포함하고, 상기 메모리는 상기 하나 이상의 프로세서들에의하여 수행될 때 상기 컴퓨터가 상기 방법을 수행하게 하는 명령어들을 저장하며, 상기 방법은:제1 이미지 해상도의 환자 신체의 부분의 제1 이미지 데이터를 수신하는 단계;복수의 대상체의 복수의 제2 이미지 데이터를 수신하는 단계;상기 복수의 제2 이미지 데이터에 기초하여 상기 제1 이미지 데이터의 해상도를 향상시킬 초해상도 모델을 결정하는 단계; 및 상기 제1 이미지 데이터 및 상기 초해상도 모델에 기초하여 제2 이미지 해상도의 상기 환자 신체의 상기 부분의제3 이미지 데이터를 생성- 상기 제2 이미지 해상도는 상기 제1 이미지 해상도보다 큼- 하는 단계를 포함하는방법."}
{"patent_id": "10-2023-7028264", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서, 상기 복수의 대상체의 상기 복수의 제2 이미지를 수신하는 단계는: 상기 제1 이미지 해상도에서, 복수의 대상체에 대한 상기 환자의 신체의 상기 부분과 동일한 부분의 제1 복수의제2 이미지 데이터를 수신하는 단계; 및상기 복수의 대상체에 대한 상기 신체의 동일한 부분에 대한 복수의 제2 이미지 데이터의 제2 복수의 제2 이미지 데이터를 상기 제2 이미지 해상도로 수신하는 단계를 포함하고, 상기 초해상도 모델을 결정하는 단계는 상기 제1 복수의 제2 이미지 데이터 및 상기 제2 복수의 제2 이미지 데이터의 분석을 수행하는 단계를 포함하는 방법."}
{"patent_id": "10-2023-7028264", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서, 상기 분석은 생성적 적대적 네트워크(GAN, generative adversary network) 분석, MedGAN 분석, 초해상도 GAN 분석, pix2pixGAN 분석, 사이클GAN 분석, 디스코GAN 분석, Fila-sGAN 분석, 투영 적대적 네트워크(PAN, projectiveadversary network) 분석, 변형 자동 인코더(VAE, variational auto encoder) 분석 및 회귀 분석 중 적어도 하나를 포함하는 방법."}
{"patent_id": "10-2023-7028264", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "3차원 모델을 생성하는 컴퓨터 구현 방법으로, 컴퓨터는 하나 이상의 프로세서 및 하나 이상의 프로세서에 의해 액세스 가능한 메모리를 포함하고, 메모리는 하나 이상의 프로세서에 의해 실행될 때 컴퓨터가 컴퓨터 구현 방법 을 수행하게 하는 명령을 저장하며, 방법은: 제1 이미지 양식에서 환자 신체의 제1 부분의 제1 이미지 데이터를 수신하는 단계, 제2 이미지 양식에서 환자 신체의 제2 부분의 제2 이미지 데이터를 수신하는 단계 제2 이미지 양 식에서 제1 이미지 양식으로 제2 이미지 데이터를 수정하는 단계 및 제1 이미지 양식의 제1 이미지 데이터 및 제 2 이미지 양식의 수정된 제2 이미지 데이터에 기초하여, 환자 신체의 제1 부분 및 제2 부분의 3차원 모델을 생성 하는 단계를 포함한다."}
{"patent_id": "10-2023-7028264", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 출원은 2021년 1월 22일에 출원된 미국 가출원 제63/140,635호 및 2022년 1월 18일에 출원된 미국 비가출원 제17/578,241호에 우선권을 주장하며, 이는 모든 목적을 위해 본 출원서 전체에 참조로 통합되어 있다."}
{"patent_id": "10-2023-7028264", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "종양 치료 필드(TT필드)는 중간 주파수 범위 내의 저강도 교류 전기장으로, 미국 특허(U.S. Pat. No. 7,565,205 에 기재된 바와 같이 종양을 치료하는데 사용될 수 있다. TT필드는 환자의 신체에 트랜스듀서를 배치하고 트랜스듀서 사이에 교류 전압을 가함으로써 관심 영역에 비침습적으로 유도된다. 환자 신체에 대한 트랜스듀서의 효 과적인 위치를 결정하기 위해 환자 신체 일부의 3차원 모델을 평가할 수 있다."}
{"patent_id": "10-2023-7028264", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "그러나 환자에 대해 사용 가능한 이미지 데이터에 신체의 일부가 누락되어 있거나, 이미지 데이터의 해상도가 3 차원 모델을 생성하기에 충분하지 않거나, 신체의 첫 번째 부분에 대한 이미지 데이터가 신체의 두 번째 부분에 대한 이미지 데이터와 이미지 양식이 다르기 때문에 3차원 모델을 생성하기에 충분한 이미지 데이터를 사용할 수 없을 수 있다. 따라서 이러한 문제로 인해 환자 신체 부위의 3차원 모델이 생성되지 않아 TT필드를 유도하기 위해 트랜스듀서를 환자 신체에 효과적으로 배치하지 못할 수 있다."}
{"patent_id": "10-2023-7028264", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 측면은 3차원 모델을 생성하는 컴퓨터 구현 방법에 관한 것으로, 컴퓨터는 하나 이상의 프로세서 및 하나 이상의 프로세서에 의해 액세스 가능한 메모리를 포함하고, 메모리는 하나 이상의 프로세서에 의해 실 행될 때 컴퓨터가 방법을 수행하게 하는 명령을 저장하며, 이 방법은 다음을 포함한다: 제1 이미지 양식에서 환 자 신체의 제1 부분의 제1 이미지 데이터를 수신하는 단계; 제2 이미지 양식에서 환자 신체의 제2 부분의 제2 이미지 데이터를 수신하는 단계; 제2 이미지 양식에서 제1 이미지 양식으로 제2 이미지 데이터를 수정하는 단계; 및 제1 이미지 양식의 제1 이미지 데이터 및 제2 이미지 양식의 수정된 제2 이미지 데이터에 기초하여, 환자 신체의 제1 부분 및 제2 부분의 3차원 모델을 생성하는 단계를 포함한다. 상기한 본 발명의 양식은 예시적인 것이며, 본 발명의 다른 양식 및 변형은 다음의 실시예에 대한 상세한 설명 으로부터 명백할 것이다."}
{"patent_id": "10-2023-7028264", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하면 트랜스듀서 어레이 배치 최적화를 위한 의료 이미지 향상 방법, 시스템 및 장치가 제공된다."}
{"patent_id": "10-2023-7028264", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "발명가들이 발견한 바와 같이, 공개된 주제는 불완전하거나 일관되지 않은 이미지 세트가 주어졌을 때 환자 신 체 일부의 3차원 모델을 생성하는 방법과 시스템을 제공한다. 이어서 3차원 모델을 사용하여 환자의 신체에 트 랜스듀서를 배치할 위치를 결정하여 TTField를 생성할 수 있다. 환자 신체의 불완전하거나 일관되지 않은 이미지 세트는, 예를 들어, 환자 신체의 일부가 누락된 이미지 세트, 3차원 모델을 생성하기에 불충분한 해상도의 이미지 세트, 또는 환자 신체의 두 번째 부분에 대한 이미지 데이 터와 다른 이미지 양식을 갖는 환자 신체의 첫 번째 부분에 대한 이미지 세트일 수 있다. 이러한 불완전하거나 일관되지 않은 이미지 세트가 주어지면, 하나 이상의 본 발명의 기술을 사용하여 환자 신체 일부의 3차원 모델 이 생성될 수 있다.도 1은 환자의 두 이미지 스캔에 기초하여 환자의 신체 부위의 3차원 이미지를 생성하는 예시적인 방법의 순서도로서, 여기서, 두 이미지 스캔의 적어도 일부가 환자의 신체 부위의 상이한 부분을 포함하고, 두 이미지 스캔이 상이한 이미지 양식(modality)을 갖는 경우, 도 1은 두 이미지 스캔의 순서도를 도시한 것이다. 상이한 이미지 양식을 갖는 환자의 두 이미지는 각각 동일한 환자 신체 부위의 이미지일 수 있다. 본 명세서에 설명된 방법은 환자의 임의의 신체 부위에 대해 구현될 수 있다. 1110에서, 환자 지원 시스템은 제1 이미지 양식으로 환자 신체 부위의 제1 부분의 제1 이미지 데이터를 수신할 수 있다. 예를 들어, 환자 신체 부위의 제1 부분은 환자 머리의 제1 부분일 수 있다. 또한, 제1 이미지 데이터는 환자 머리의 제2 부분의 적어도 일부를 포함하지 않을 수 있다. 예를 들어, 제1 이미지 데이터는 환자 머리(예컨대, 또는 다른 신체 부위)의 하부 부분을 포함할 수 있지만, 환자 머리(예컨대, 또는 다른 신체 부 위)의 상부 부분의 적어도 일부는 포함하지 않을 수 있다. 1120에서, 환자 지원 시스템은 제1 이미지 양식과 다른 제2 이미지 양식으로 환자 신체의 제2 부분에 대 한 제2 이미지 데이터를 수신할 수 있다. 예를 들어, 환자 신체 부위의 제2 부분은 환자 머리의 제2 부분일 수 있다. 또한, 제2 이미지 데이터는 환자 머리의 제1 부분의 적어도 일부를 포함하지 않을 수 있다. 예를 들어, 제2 이미지 데이터는 환자 머리(예컨대, 또는 다른 신체 부위)의 상부 부분을 포함할 수 있지만, 환자 머리(예 컨대, 또는 다른 신체 부위)의 하부 부분의 적어도 일부는 포함하지 않을 수 있다. 수신된 제1/제2 이미지 데이터에 대한 이미지 양식은 엑스레이 컴퓨터 단층 촬영(CT) 데이터일 수 있고, 제2 이 미지 데이터는 엑스레이 CT 데이터일 수 있다. 다른 예에서, 제1/제2 이미지 양식은 단일 광자 방출 컴퓨터 단 층 촬영(SPECT) 데이터, 자기 공명 영상(MRI) 데이터, 양전자 방출 단층 촬영(PET) 데이터 등 중 임의의 하나이 고, 제2 이미지는 SPECT 데이터, MRI 데이터, PET 데이터 등을 포함할 수 있다. 제1/제2 이미지 데이터는 이미 징 데이터, 로컬 데이터베이스, 또는 원격 이미지 데이터베이스로부터 예측 모델링 애플리케 이션에 의해 수신될 수 있다. 제1 이미지 데이터 및 제2 이미지 데이터는 환자의 신체 부위의 동일 또는 상이한 방향에서 촬영될 수 있다. 환자 신체 부위의 제1 이미지 데이터 및 제2 이미지 데이터는 동일 또는 상이 한 시간에 촬영될 수 있다. 1130에서, 환자 지원 시스템은 제1 이미지 데이터에 대한 제1 이미지 양식과 제2 이미지 데이터에 대한 제2 이미지 양식과 일치하지 않는다고 결정할 수 있다. 예측 모델링 애플리케이션은 제1 이미지 스캔 및 제2 이미지 스캔 각각에 대한 파일의 양식 필드를 비교하여 제1 이미지 스캔 및 제2 이미지 스캔 각각에 대한 양식이 동일한지 또는 다른지를 결정할 수 있다. 양식 필드는 이미지 스캔의 양식을 나타내는 표시기를 제공할 수 있다. 예측 모델링 애플리케이션이 제1 이미지 스캔 및 제2 이미지 스캔의 각 양식에 대한 양식 필드 의 정보를 비교하여 동일하다고 판단하는 경우, 예측 모델링 애플리케이션은 제1 이미지 스캔 및 제2 이 미지 스캔을 사용하여 실질적으로 1170에서 설명한 대로 환자의 신체 부분의 전체 3차원 이미지를 생성할 수 있 다. 이 예에서, 예측 모델링 애플리케이션은 제1 이미지 스캔 및 제2 이미지 스캔의 각 이미지 양식에 대 한 양식 필드의 정보를 비교하고 양식이 다른지 판단한다. 예측 모델링 애플리케이션은 다른 피험자에 대한 신체 부위의 복수의 이미지에 액세스할 수 있다. 이 복 수의 이미지는 피험자에 대한 제1 이미지 양식에서 신체 부위의 제1 부분의 이미지 데이터를 포함하는 이미지의 제1 부분 및 피험자에 대한 제2 이미지 양식에서 신체 부위의 제2 부분의 이미지 데이터를 포함하는 이미지의 제2 부분을 포함할 수 있다. 이러한 복수의 이미지들은 환자 지원 시스템의 이미지 데이터베이스에 저장되고/되거나 환자 지원 시스템으로부터 원격에 위치할 수 있는 다른 이미지 데이터베이스로부 터 액세스될 수 있다. 예측 모델링 애플리케이션은 데이터베이스(1018, 1020)를 쿼리하여 하나의 이미지 양식으로부터 다른 이 미지 양식으로 이미지를 변환하는 모델을 개발하기 위한 복수의 이미지를 검색할 수 있다. 쿼리는, 예를 들어, 환자 이외의 피험자에 대해, 데이터베이스 내의 어떤 이미지가 동일한 피험자에 대한 것이며, 제1 이미지 양식 에서 피험자의 신체 부위의 제1 부분의 이미지 데이터 및 제2 이미지 양식에서 피험자의 신체 부위의 제2 부분 에 대한 별도의 이미지 데이터를 포함하는지 결정할 수 있다. 이 쿼리를 충족하는 이미지 데이터 그룹은 양식 변환 모델을 생성할 때 분석을 위해 선택될 수 있다. 양식 변환 모델 생성에 사용되는 피사체 이미지의 수는 구성 가능하며, 환자 이외의 피사체에 대한 이미지 데이 터보다 더 많은 수일 수 있다. 특정 실시예들에서, 쿼리 기준을 만족하는 피사체의 목표 또는 임계값 수는 양식 변환 모델을 생성하기 위해 만족되어야 한다. 특정 실시예에서, 목표 임계값은 쿼리를 만족하는 적어도 5명의 피험자에 대한 이미지 데이터일 수 있다. 예를 들어, 목표 임계값은 쿼리를 만족하는 15-50개의 피사체에 대한이미지 데이터 범위에 있을 수 있다. 특정 예시 실시예에서, 예측 모델링 애플리케이션은 목표 임계값과 동일한 피험자 수에 대해 제1 이미지 양식에서 신체 부위의 제1 부분에 대한 이미지 데이터 및 제2 이미지 양식에서 신체 부위의 제2 부분에 대한 이 미지 데이터만을 수집할 수 있다. 다른 실시예들에서, 예측 모델링 애플리케이션은 목표 임계값을 만족하고 이 미지 데이터베이스에서 이용 가능한 임의의 수의 피험자에 대해 제1 이미지 양식에서 신체 부분의 제1 부분에 대한 이미지 데이터 및 제2 이미지 양식에서 신체 부분의 제2 부분에 대한 이미지 데이터를 수집할 수 있다. 데이터베이스(1018, 1020)의 쿼리는 또한 하나 이상의 다른 쿼리 최적화 인자들을 포함할 수 있다. 예를 들어, 이러한 요소들 중 적어도 일부는 환자/피험자의 하나 이상의 물리적 속성에 기초할 수 있다. 예를 들어, 쿼리 최적화 인자들은 환자의 나이, 나이 범위, 환자의 신장, 신장 범위, 환자의 성별, 환자의 인종, 환자의 체중, 체중 범위, 환자의 하나 이상의 질병, 상태 또는 이상, 신체 부위의 하나 이상의 치수, 신체 부위의 하나 이상 의 치수의 비율, 또는 이와 같은 것들 중 하나 이상을 포함할 수 있다. 특정 실시예에서, 복수의 초해상도 모델 은 이러한 쿼리 최적화 인자 중 하나 이상에 기초하여 생성될 수 있다. 쿼리에 포함할 인자의 수 및/또는 유형 의 결정은 사용자에 의해 구성 및/또는 결정될 수 있다. 1140에서, 예측 모델링 애플리케이션은 다수의 다른 피험자에 대한 신체 부분의 적어도 제1 부분의 제1 복수의 이미지 데이터를 수신할 수 있다. 이러한 다른 피험자들에 대한 신체 부위의 적어도 제1 부분의 이미지 는 제1 이미지 양식(예컨대, MRI)일 수 있다. 신체 부위의 적어도 제1 부분의 이미지들은 데이터베이스(1018, 1020)의 쿼리에 기초하여 수신될 수 있다. 데이터베이스의 쿼리는 하나 이상의 쿼리 최적화 인자를 포함할 수도 있고 포함하지 않을 수도 있다. 1150에서, 예측 모델링 애플리케이션(예컨대, 또는 환자 지원 시스템의 다른 부분)은 제1 이미지 데이터가 수신된 피험자 수에 대한 신체 부위의 적어도 제2 부분의 제2 복수의 이미지 데이터를 수신할 수 있다. 이들 피험자에 대한 신체 부위의 적어도 제2 부분의 이미지 데이터는 제2 이미지 양식(예컨대, 엑스레이 CT)일 수 있다. 신체 부위의 제2 부분의 이미지들은 데이터베이스(1018, 1020)의 쿼리에 기초하여 수신될 수 있 다. 데이터베이스의 쿼리는 하나 이상의 쿼리 최적화 인자를 포함할 수도 또는 포함하지 않을 수도 있다. 1160에서, 예측 모델링 애플리케이션은 환자 신체의 제2 부분의 제2 이미지를 제2 이미지 양식으로부터 제1 이미지 양식으로 변환할 수 있다. 예를 들어, 예측 모델링 애플리케이션은 인공지능 기법을 사용하여 제1 이미지 양식에서 다른 피험자의 신체 부위의 적어도 제1 부분에 대한 제1 복수의 이미지 데이터 및 제2 이 미지 양식에서 다른 피험자의 신체 부위의 적어도 제2 부분에 대한 제2 복수의 이미지 데이터를 사용하여 제2 이미지 양식의 이미지 데이터를 제1 이미지 양식의 이미지 데이터로 변환하기 위한 이미지 양식 변환 모델을 생 성할 수 있다. 예를 들어, 예측 모델링 애플리케이션은 이미지 양식 번역 모델을 생성하기 위해 생성적 적대적 네트워크 (GAN, generative adversary network) 분석의 형태를 적용할 수 있다. 예를 들어, 예측 모델링 애플리케이션 은 이미지 양식 변환 모델을 생성하기 위해 MedGAN 분석을 적용할 수 있다. 다른 예들에서, 예측 모델링 애플리케이션은 초해상도 GAN, pix2pix GAN, 사이클GAN, 디스코GAN, 및 Fila-sGAN을 포함하되 이에 국한 되지 않는 다른 형태의 GAN 분석을 적용할 수 있다. 다른 실시예들에서, 예측 모델링 애플리케이션은 이 미지 양식 변환 모델을 생성하기 위해 다른 형태의 모델링, 예를 들어 투영 적대적 네트워크(PAN, projective adversary network) 또는 변형 자동 인코더(VAE, variational auto encoder)를 적용할 수 있다. 이미지 양식 변환 모델이 제1 이미지 양식에서 다른 피험자의 신체 부위의 적어도 제1 부분에 대한 제1 복수의 이미지 데이터 및 제2 이미지 양식에서 다른 피험자의 신체 부위의 적어도 제2 부분에 대한 제2 복수의 이미지 데이터에 기초하여 생성되면, 예측 모델링 애플리케이션은 제2 이미지 양식에서 환자의 신체 부위의 제2 부분에 대한 이미지 스캔에 모델을 적용하여 제2 이미지 스캔을 제2 이미지 양식(예를 들어, 예를 들어, 엑스레 이 CT) 및/또는 환자 신체 부위의 제1 부분에 대한 제1 이미지 스캔과 동일한 제1 이미지 양식(예컨대, MRI) 및 /또는 동일한 이미지 양식으로 변환할 수 있다. 1170에서, 예측 모델링 애플리케이션은 제1 이미지 양식의 환자의 신체 부위의 제1 부분의 제1 이미지 데 이터 및 제1 이미지 양식의 환자의 신체 부위의 제2 부분의 변환된 제2 이미지 데이터에 기초하여 환자의 신체 부위의 완전한 3차원 모델을 생성할 수 있다. 예를 들어, 제1 이미지 및 환자에 대한 변환된 제2 이미지가 동일 한 이미지 양식이므로, 예측 모델링 애플리케이션은 환자 신체 부위의 제1 이미지 데이터 위에 환자 신체 부위의 제2 부분의 변환된 제2 이미지 데이터의 전부 또는 일부를 오버레이하거나 결합할 수 있고, 변환된 제2이미지 데이터에는 있지만 제1 이미지 데이터에는 없는 환자 신체 부위의 부분을 제1 이미지 데이터에 추가할 수 있다. 예를 들어, 신체 부위는 환자의 머리일 수 있다. 제1 이미지는 환자 머리의 일부를 포함할 수 있지만, 환자 머리의 다른 부분(예를 들어, 환자 머리의 상부 부분의 적어도 일부)이 누락될 수도 있다. 변환된 제2 이 미지 데이터는 제1 이미지 데이터에서 누락된 원하는 신체 부위의 일부를 포함할 수 있다. 예를 들어, 변환된 제2 이미지 데이터는 환자 머리의 상부를 포함할 수 있지만, 환자 머리의 전부를 포함하지 않을 수도 있다. 예 측 모델링 애플리케이션은 제1 이미지 데이터에서 누락된 신체 부위 부분에 대한 변환된 제2 이미지의 이 미지 데이터를 취하고, 그 이미지 데이터를 제1 이미지 데이터에 추가하여 조직, 장기, 종양 등과 같은 내부 구 조를 포함하는 환자 신체 부위의 전부 또는 일부의 3차원 공간에서의 디지털 표현을 생성함으로써 환자 머리의 완전한 3차원 모델을 생성할 수 있다. 도 2는 환자의 신체 부위의 일부를 포함하는 단일 이미지 스캔에 기초하여 환자의 신체 부위의 3차원 이미지를 생성하고, 이미지 데이터가 환자의 신체 부위의 다른 부분을 포함하지 않는 예시적인 방법의 순서도이다. 1210에서, 환자 지원 시스템은 환자 신체 부위의 제1 부분의 제1 이미지 데이터를 수신할 수 있다. 제1 이미지는 환자 신체 부위의 제2 부분의 적어도 일부를 포함하지 않을 수 있다. 1220에서, 환자 지원 시스템은 신체 부위의 완전한 3차원 모델을 생성하기 위해 환자 신체 부위의 제2 부 분이 필요하다고 결정할 수 있다. 예를 들어, 환자 지원 시스템은 제1 이미지 데이터를 평가하고, 이미지 데이터가 환자의 신체 부위에 대한 TT필드의 전달을 모델링하는 데 필요한 신체 부위의 일부만을 포함한다고 결 정할 수 있다. 1230에서, 예측 모델링 애플리케이션은 환자의 신체 부위와 동일한 하나 이상의 피험자의 신체 부위의 이 미지 데이터에 대한 데이터베이스를 쿼리할 수 있다. 쿼리에 대한 응답으로, 예측 모델링 애플리케이션은 환자 이외의 복수의 피험자에 대한 신체 부위의 복수의 이미지 데이터를 수신할 수 있다. 예측 모델링 애플리케 이션은 데이터베이스(1018, 1020)를 쿼리하여 신체 부위 완성 모델을 개발하기 위한 복수의 이미지를 검 색하여 신체 부위의 추가 부분을 나타내는 이미지 데이터를 환자의 신체 부위의 제1 이미지 데이터에 추가할 수 있다. 예를 들어, 신체 부위의 제1 이미지 데이터에 신체 부위의 추가 부분을 나타내는 이미지 데이터를 추가하 면 환자의 신체 부위에 대한 완전한 또는 보다 완전한 이미지가 생성될 수 있다. 쿼리는 예를 들어, 환자 이외 의 피험자에 대해 데이터베이스에서 피험자의 신체 부위와 동일한 신체 부위의 이미지를 결정할 수 있다. 쿼리 는 환자의 이미지와 동일한 피험자의 신체 부위 이미지에 대한 이미지 데이터를 포함하도록 범위를 좁힐 수 있 으며, 여기서 피험자의 이미지 데이터는 환자에 대한 첫 번째 이미지 데이터보다 완전하거나 더 완전한 신체 부 위 이미지를 나타낸다. 이 쿼리를 만족하는 이미지 데이터는 신체 부위 완성 모델을 생성할 때 분석을 위해 선 택될 수 있다. 1240에서, 예측 모델링 애플리케이션은 각 피사체에 대한 수신된 이미지 데이터를 적어도 두 부분으로 분 할할 수 있다. 예를 들어, 예측 모델링 애플리케이션은 각 피험자의 신체 부위에 대한 수신된 이미지 데 이터를 신체 부위의 제1 부분을 포함하는 제1 부분과 신체 부위의 제2 부분을 포함하는 제2 부분으로 분할할 수 있다. 예를 들어, 제1 부분은 일반적으로 임상 스캔에 포함되는 신체 부위의 일부일 수 있다. 예시적인 머리의 경우, 제1 부분은 머리의 상단 부분을 제외한 머리의 대부분 및/또는 각 피사체에 대한 머리의 하나 이상의 측 면 부분일 수 있다. 예를 들어, 두 번째 부분은 일반적으로 임상 스캔에 포함되지 않는 신체 부위의 일부일 수 있다. 1250에서, 예측 모델링 애플리케이션은 이미지 데이터로부터 신체 부위의 전체 또는 일부의 나머지를 생 성하기 위한 신체 부위 완성 모델을 결정할 수 있다. 예측 모델링 애플리케이션은 인공지능 기법과 복수 의 피험자의 신체 부위 이미지 데이터의 제1 부분 및 제2 부분을 사용하여 환자의 신체 부위 이미지 데이터로부 터 신체 부위의 전체 또는 일부의 나머지를 생성하기 위한 신체 부위 완성 모델을 결정할 수 있다. 일 예에서, 예측 모델링 애플리케이션은 신체 부위 완성 모델을 결정하기 위해 복수의 피험자의 신체 부위에 대한 이 미지 데이터의 제1 부분 및 제2 부분의 통계적 형상 분석(statistical shape analysis)을 이용할 수 있다. 다른 예에서, 예측 모델링 애플리케이션은 신체 부위 완성 모델을 결정하기 위해 복수의 피사체의 신체 부위에 대한 이미지 데이터의 제1 부분 및 제2 부분의 능동적 외관 모델링(active appearance modeling)을 채용할 수 있다. 다른 예에서, 예측 모델링 애플리케이션(predictive modeling application , 1014)은 신체 부위 완성 모 델을 결정하기 위해 복수의 피사체의 신체 부위에 대한 이미지 데이터의 제1 부분 및 제2 부분의 글로벌 이미지 통계를 이용할 수 있다. 신체 부위 완성 모델을 결정하는 데 사용되는 제안된 기법 중 임의의 기법은 머리 이미 지 통계 및 복수의 피험자의 신체 부위에 대한 이미지 데이터의 제1 부분 및 제2 부분의 세그먼트에서 머리 및/또는 뇌 구조 사이의 기하학적 관계를 모델링할 수 있다. 대규모 데이터 세트에 대한 훈련 후, 머신 러닝 회귀 자(machine learning regressors, 예: 랜덤 포레스트)를 통합하여 제1 이미지 데이터에서 신체 부위의 누락된 부분을 예측할 수 있다. 다른 예에서, 예측 모델링 애플리케이션은 신체 부위의 시뮬레이션된 이미지 스 캔의 다수(예를 들어, 100개 이상, 1000개 이상, 5000개 이상)를 포함하도록 평가되는 데이터 세트를 증가시키 기 위해 GAN 분석(예를 들어, MedGAN, 초해상도 GAN, pix2pix GAN, CycleGAN, DiscoGAN, 및 Fila-sGAN)을 사용 할 수 있다. 복수의 피험자의 신체 부위에 대한 이미지 데이터의 제1 부분 및 제2 부분은 일부 컨볼루션 블록을 포함하는 인공 신경망에 입력으로 입력될 수 있으며, 결정된 신체 부위 완성 모델 내에서 신체 부위의 누락된 부분을 포함하는 전체 신체 부위(예: 전체 머리, 몸통, 팔, 다리 등)의 이미지를 출력하도록 훈련될 수 있다. 1260에서, 예측 모델링 애플리케이션은 신체 부위 완성 모델을 환자의 신체 부위의 제1 부분의 제1 이미 지 스캔에 적용할 수 있다. 예를 들어, 신체 부위 완성 모델은 인공지능 기법을 통해 환자의 신체 부위 제1 부 분의 이미지 데이터에 적용되어, 신체 부위의 제1 이미지 스캔에 포함되지 않은 환자의 신체 부위 잔여 부분의 전부 또는 적어도 일부를 결정할 수 있다. 1270에서, 예측 모델링 애플리케이션은 환자의 신체 부위의 제1 부분의 이미지 데이터를 보완하고 이에 기초하는, 환자의 신체 부위의 제2 부분에 대한 제2 이미지 데이터를 생성할 수 있다. 신체 부위의 제2 부분에 대한 이미지 데이터는 환자 신체 부위의 제2 부분을 나타내는 3차원의 신중한 이미지일 수 있다. 일 예에서, 환 자의 신체 부위의 제2 부분을 나타내는 제2 이미지 데이터는 제1 이미지 데이터에 포함되지 않은 신체 부위의 나머지 부분일 수 있다. 1280에서, 예측 모델링 애플리케이션은 환자의 신체 부위의 제1 부분의 제1 이미지 데이터 및 생성된 환 자의 신체 부위의 제2 부분의 제2 이미지 데이터에 기초하여 환자의 신체 부위(또는 신체 부위의 일부)에 대한 완전한 3차원 모델을 생성할 수 있다. 도 3은 환자 신체 부위의 저해상도 이미지(예컨대, SPECT 스캔 또는 PET 스캔)에 기초하여 환자 신체 부위의 고 해상도 3차원 이미지(예컨대, MRI)를 생성하는 예시적인 방법의 순서도이다. 저해상도 이미지 스캔의 이 미지 데이터는 환자의 신체 부위 전체 또는 신체 부위 일부의 이미지 데이터일 수 있다. 1310에서, 예측 모델링 애플리케이션은 복수의 다른 대상체에 대한 신체 부위의 복수의 제1 이미지 데이 터를 제1 해상도로 수신할 수 있다. 제1 해상도는 고해상도일 수 있다(예컨대, MRI 또는 엑스레이 CT 이미지). 각각의 제1 이미지 데이터는 동일한 이미지 양식일 수 있다. 복수의 제1 이미지 데이터는 데이터베이스(1018, 1020)의 쿼리에 기초하여 수신될 수 있다. 쿼리는 최적화 인자를 포함하거나 포함하지 않을 수 있다. 예측 모델링 애플리케이션은 데이터베이스(1018, 1020)를 쿼리하여, 환자의 신체 부위의 저해상도 이미지 데이터(예컨대, SPECT 스캔 또는 PET 스캔)에 기초하여 고해상도 이미지 데이터(예컨대, MRI)를 생성하는 모델 을 개발하기 위한 복수의 이미지를 검색할 수 있다. 예를 들어, 쿼리는 환자 이외의 피사체에 대해 데이터베이 스에 있는 이미지 중 동일한 피사체에 대한 고해상도 및 저해상도의 피사체 신체 부위 이미지 데이터를 모두 포 함하는 이미지를 결정할 수 있다. 이 쿼리를 충족하는 이미지 데이터 그룹은 초고해상도 모델을 생성할 때 분석 을 위해 선택될 수 있다. 초고해상도 모델의 생성에 사용되는 피험자 이미지의 수는 구성 가능하며, 환자 이외 의 피험자보다 더 많은 수일 수 있다. 특정 실시예들에서, 초고해상도 모델을 생성하기 위해서는 쿼리 기준을 만족하는 피사체의 목표 또는 임계값 수가 충족되어야 한다. 특정 실시예에서, 목표 임계값은 쿼리를 만족하는 적어도 100명의 피험자에 대한 이미지 데이터일 수 있다(예: 신체 부위에 대한 저해상도 이미지 데이터 및 고해 상도 이미지 데이터). 예를 들어, 목표 임계값은 쿼리를 만족하는 50-5000개의 피사체에 대한 이미지 데이터 범 위에 있을 수 있다. 특정 예시 실시예에서, 예측 모델링 애플리케이션은 목표 임계값과 동일한 피사체 수 에 대해 신체 부위에 대한 저해상도 이미지 데이터 및 고해상도 이미지 데이터만 수집할 수 있다. 다른 예시적 인 실시예에서, 예측 모델링 애플리케이션은 목표 임계값을 만족하고 이미지 데이터베이스(1018, 1020)에 서 이용 가능한 임의의 수의 피사체들에 대해 신체 부위에 대한 저해상도 이미지 데이터 및 고해상도 이미지 데 이터를 수집할 수 있다. 1320에서, 예측 모델링 애플리케이션은 복수의 피사체에 대한 복수의 신체 부위의 복수의 제2 이미지 데 이터를 수신할 수 있다. 따라서, 각 피사체에 대해, 예측 모델링 애플리케이션은 신체 부위의 제1 이미지 데이터와 제2 이미지 데이터를 모두 수신할 수 있다. 복수의 제2 이미지 데이터 각각은 제2 해상도일 수 있다. 제2 해상도는 저해상도일 수 있다. 복수의 제2 이미지 데이터 각각은 동일한 이미지 양식일 수 있으며, 제1 이 미지 데이터의 이미지 양식과 상이할 수 있다. 복수의 제2 이미지 데이터는 데이터베이스(1018, 1020)의 쿼리에 기초하여 수신될 수 있다. 쿼리는 최적화 인자를 포함할 수도 있고 포함하지 않을 수도 있다.1330에서, 예측 모델링 애플리케이션은 저해상도(예컨대, SPECT 데이터 또는 PET 데이터)의 환자 신체 부위의 이미지 데이터에 기초하여 고해상도(예컨대, MRI)의 환자 신체 부위의 이미지 데이터를 생성하기 위한 초해상도 모델을 결정할 수 있다. 예를 들어, 예측 모델링 애플리케이션은 복수의 피험자에 대한 신체 부위의 복수 의 제1 이미지 데이터 및 복수의 피험자에 대한 신체 부위의 복수의 제2 이미지 데이터를 사용하여 인공지능 기 법을 이용하여 환자의 신체 부위의 저해상도 이미지 데이터에 기초하여 환자의 신체 부위의 고해상도 이미지 데 이터를 생성하기 위한 초고해상도 모델을 생성할 수 있다. 예를 들어, 예측 모델링 애플리케이션은 복수 의 피험자에 대한 신체 부위의 복수의 제1 영상 데이터 및 복수의 제2 영상 데이터에 대해 생성적 적대 신경망 (GAN) 분석의 형태를 적용하여 초고해상도 모델을 생성할 수 있다. 예를 들어, 예측 모델링 애플리케이션(101 4)은 메드간 분석을 적용하여 초고해상도 모델을 생성할 수 있다. 다른 예들에서, 예측 모델링 애플리케이션 은 초고해상도 GAN, 픽셀2픽스 GAN, 사이클GAN, 디스코GAN, 및 필라-sGAN을 포함하되 이에 국한되지 않는 다른 형태의 GAN 분석을 적용할 수 있다. 예측 모델링 애플리케이션은 초해상도 모델을 생성하기 위해 다 른 형태의 모델링(예컨대, 회귀 모델 또는 컨볼루션 네트워크)을 적용할 수 있다. 1340에서, 예측 모델링 애플리케이션은 환자의 신체 부위의 이미지 데이터를 수신할 수 있다. 신체 부위 의 이미지 데이터는 저해상도(예를 들어, MRI 이미지 데이터의 해상도보다 낮은 해상도)인 제2 해상도일 수 있 다. 1350에서, 복수의 피사체(예컨대, 사람)에 대한 복수의 제1 해상도의 신체 부위의 복수의 제1 이미지 데이터 및 복수의 제2 해상도의 신체 부위의 복수의 제2 이미지 데이터에 기초하여 초고해상도 모델이 생성되면, 예측 모 델링 애플리케이션은 그 모델을 제2 해상도로 수신된 환자 신체 부위의 이미지 데이터에 적용할 수 있다. 특정 예들에서, 초고해상도 모델은 환자에 대한 신체 부위의 이미지 데이터를 수신하기 전에 생성될 수 있다. 다른 실시예들에서, 초고해상도 모델은 환자에 대한 신체 부위의 이미지 데이터를 수신한 후에 생성될 수 있다. 1360에서, 예측 모델링 애플리케이션은 제1 해상도로 환자의 신체 부위의 이미지 데이터를 생성할 수 있 다. 제1 해상도의 환자 신체 부위의 이미지 데이터의 생성은, 제2 해상도의 환자 신체 부위의 수신된 이미지 데 이터에 초고해상도 모델을 적용하는 것에 기초할 수 있다. 제1 해상도는 제2 해상도보다 높을 수 있다. 생성된 제1 해상도의 환자 신체 부위 영상 데이터는 제2 해상도의 환자 신체 부위 영상 데이터와 초해상도 모델을 기반 으로 환자 신체 부위의 완전한 3차원 모델일 수 있다. 도 4는 환자 신체의 일부에 TT필드를 전달하기 위한 트랜스듀서 어레이 레이아웃을 결정하기 위한 예시적인 방 법에 대한 순서도이다. 방법은 장치, 환자 지원 시스템, 환자 모델링 애플리케이션 및/또는 본원에 설명된 다른 장치/구성요소 중 하나 이상에 의해 완료될 수 있다. 1410에서, 환자 신체의 일부의 3차원 모델이 수신될 수 있다. 예를 들어, 3차원 모델은 환자 모델링 애플리케이 션에 의해 수신될 수 있다. 3차원(3D) 모델은 도 1 내지 도 3 중 하나 이상에서 생성된 3D 모델일 수 있으 며, 환자의 신체 부위 또는 신체 부위의 일부를 포함할 수 있다. 1420에서, 환자 신체의 일부의 3D 모델 내에서 관심 영역(ROI)이 결정될 수 있다. 1430에서, 시뮬레이션된 전기장 분포가 결정될 수 있다. 1440에서, 선량 메 트릭이 결정될 수 있다. 예를 들어, 선량 메트릭은 시뮬레이션된 전기장 분포에 기초하여 결정될 수 있다. 예를 들어, 선량 메트릭은 트랜스듀서 어레이에 대한 복수의 위치 쌍의 각 위치 쌍에 대해 결정될 수 있다. 1450에서, 트랜스듀서 어레이의 위치 쌍들 사이의 각도 제한을 만족하는 복수의 위치 쌍들의 하나 이상의 위치 쌍 세트가 결정된다. 예를 들어, 각도 제한은 복수의 트랜스듀서 어레이 쌍들 사이의 직교 각도 및/또는 표시될 수 있다. 예를 들어, 각도 제한은 복수의 쌍의 트랜스듀서 어레이들 사이의 각도 범위일 수 있고/또는 표시될 수 있다. 1460에서, 하나 이상의 후보 트랜스듀서 어레이 레이아웃 맵이 결정될 수 있다. 예를 들어, 하나 이상 의 후보 트랜스듀서 어레이 레이아웃 맵은 선량 메트릭 및 각도 제한을 만족하는 하나 이상의 위치 쌍의 세트에 기초하여 결정될 수 있다. 일부 예에서, 방법은 하나 이상의 후보 트랜스듀서 어레이 레이아웃 맵의 적어 도 하나의 위치에서 적어도 하나의 트랜스듀서 어레이에 대한 시뮬레이션된 방향 또는 시뮬레이션된 위치를 조 정하고, 적어도 하나의 트랜스듀서 어레이에 대한 시뮬레이션된 방향 또는 시뮬레이션된 위치를 조정하는 것에 기초하여 최종 트랜스듀서 어레이 레이아웃 맵을 결정하는 것을 포함할 수 있다. 도 5는 환자 지원 시스템의 비제한적인 실시예를 포함하는 환경을 나타내는 블록 다이어그램이다. 일 양식에서, 설명된 임의의 방법의 일부 또는 모든 단계는 본 명세서에 기술된 바와 같이 컴퓨팅 디바이스에서 수행될 수 있다. 환자 지원 시스템은 전기장 발생기(EFG) 구성 애플리케이션, 환자 모델링 애플리케 이션, 이미징 데이터, 운영 체제(O/S), 예측 모델링 애플리케이션, 이미지 데이터베이스 중 하나 이상을 저장하도록 구성된 하나 또는 복수의 컴퓨터를 포함할 수 있다. 환자 지원 시스템은 하드웨어 아키텍처 측면에서, 일반적으로 하나 이상의 프로세서, 메모리 시스 템, 입력/출력(I/O) 인터페이스 및 네트워크 인터페이스를 포함하는 디지털 컴퓨터일 수 있 다. 이러한 구성 요소들(1004, 1006, 1008, 및 1010)은 로컬 인터페이스를 통해 통신적으로 결합된다. 프 로세서는 소프트웨어, 특히 메모리 시스템에 저장된 소프트웨어의 실행을 위한 하드웨어 디바이스 일 수 있다. 환자 지원 시스템이 작동 중일 때, 프로세서는 메모리 시스템 내에 저장된 소프 트웨어를 실행하고, 메모리 시스템과 데이터를 송수신하고, 소프트웨어에 따라 환자 지원 시스템의 동작을 일반적으로 제어하도록 구성될 수 있다. 환자 지원 시스템은 하나 이상의 프로세서 및 하나 이상 의 프로세서에 의해 액세스 가능한 메모리를 포함하는 컴퓨터일 수 있으며, 여기서 메모리는 하나 이상의 프로 세서에 의해 실행될 때 컴퓨터가 본원에 개시된 방법 중 하나 이상을 수행하도록 하는 명령어를 저장한다. 환자 모델링 애플리케이션은 이미징 데이터에 따라 환자의 신체 일부의 3D 모델을 생성하도록 구성될 수 있다. 이미징 데이터는 임의의 유형의 시각 데이터, 예를 들어 단일 광자 방출 컴퓨터 단층 촬영 (SPECT) 이미지 데이터, 엑스레이 컴퓨터 단층 촬영(CT) 데이터, 자기 공명 영상(MRI) 데이터, 양전자 방출 단 층 촬영(PET) 데이터 및 광학 기기에 의해 캡처될 수 있는 데이터를 포함할 수 있다. 특정 구현에서, 이미지 데 이터는 3D 스캐너로부터 획득되거나 3D 스캐너에 의해 생성된 3D 데이터를 포함할 수 있다. 환자 모델링 애플리 케이션은 또한 환자 모델 및 하나 이상의 전기장 시뮬레이션에 기초하여 3D 어레이 레이아웃 맵을 생성하 도록 구성될 수 있다. 환자 신체의 일부에 대한 어레이 배치를 적절하게 최적화하기 위해, MRI 이미징 데이터와 같은 이미징 데이터는 환자 모델링 애플리케이션에 의해 분석되어 종양을 구성하는 관심 영역을 식별 할 수 있다. 일 양식에서, 환자 모델링 애플리케이션은 종양의 위치 및 범위에 기초하여 환자에 대한 바람 직한 트랜스듀서 어레이 레이아웃을 결정하도록 구성될 수 있다. 일 양식에서, 환자 모델링 애플리케이션 은 환자에 대한 3D 어레이 레이아웃 맵을 결정하도록 구성될 수 있다. 네트워크 인터페이스는 환자 지원 시스템으로부터 송신 및 수신하는 데 사용될 수 있다. 도 5의 예 에서, 환자 지원 시스템의 메모리 시스템의 소프트웨어는 EFG 구성 애플리케이션, 환자 모델 링 애플리케이션, 이미징 데이터, 예측 모델링 애플리케이션, 이미지 데이터베이스 및 운영 시스템을 포함할 수 있다. 예측 모델링 애플리케이션은 복수의 피사체로부터의 이미지 데이터에 기초하여 이미지 데이터 모델을 생 성하기 위한 하나 이상의 모델링 애플리케이션일 수 있다. 예측 모델링 애플리케이션은 생성적 적대 네트워크 (GAN) 분석, 메드간 분석, 초해상도 GAN, 픽셀2픽스 GAN, 사이클간, 디스코간, 필라-sGAN, 투영적 적대 네트워 크(PAN) 분석, 변형 자동 인코더(VAE), 분석, 회귀 분석 또는 컨볼루션 네트워크 분석 중 어느 하나 이상을 수 행하도록 구성될 수 있다. 예를 들어, 예측 모델링 애플리케이션은 대상 이미지 데이터의 분석을 수행하 기 위해 하나 이상의 인공 지능 기법을 사용할 수 있다. 도 6은 전기 치료 치료를 위한 예시적인 장치를 도시한다. 장치는 전기장 생성기 및 하나 이상 의 트랜스듀서 어레이를 포함할 수 있다. 장치는 전기장 발생기를 통해 TT필드를 생성하고, 하 나 이상의 트랜스듀서 어레이를 통해 신체의 영역으로 TT필드를 전달하도록 구성될 수 있다. 전기장 생성 기는 신호 발생기와 통신하는 하나 이상의 프로세서를 포함할 수 있다. 전기장 발생기는 프로세서 및 신호 발생기의 성능을 제어하도록 구성된 제어 소프트웨어를 포함할 수 있다. 제어 소프트웨어는 하나 이상의 프로세서에 의해 액세스 가능한 메모리에 저장될 수 있다. 신호 생성기 는 파형 또는 펄스 트레인 형태의 하나 이상의 전기 신호를 생성할 수 있다. 신호 생성기는 예를 들 어, 약 50 kHz 내지 약 500 kHz 범위의 주파수에서 교류 전압 파형을 생성하도록 구성될 수 있다. 전압은 치료 대상 조직의 전기장 강도가 예를 들어, 약 0.1V/cm 내지 약 10V/cm 범위에 있을 수 있도록 구성될 수 있다. 전기장 생성기의 하나 이상의 출력은 신호 생성기의 한쪽 단부에 부착되는 하나 이상의 전도성 리드에 결합될 수 있다. 전도성 리드의 반대쪽 끝은 전기 신호에 의해 활성화되는 하나 이상의 트랜 스듀서 어레이에 연결된다. 신호 생성기의 출력 파라미터는 필드의 강도, 파동의 주파수, 및 하나 이 상의 트랜스듀서 어레이의 최대 허용 온도를 포함할 수 있다. 출력 파라미터는 프로세서와 함께 제어 소프트웨어에 의해 설정 및/또는 결정될 수 있다. 하나 이상의 트랜스듀서 어레이 어레이는 하나 이상의 전극을 포함할 수 있다. 전극은 생체적합 성일 수 있고 연성 회로 기판에 결합될 수 있다. 전극, 하이드로젤 및 연성 회로 기판은 하나 이상의 트랜스듀서 어레이를 신체에 제 위치에 유지하고 피부와 지속적으로 직접 접촉하도록 하기 위해 저 자극성 의료용 접착 붕대에 부착될 수 있다. 각 트랜스듀서 어레이는 트랜스듀서 어레이 아래의피부 온도를 측정하기 위한 서미스터와 같은 하 이상의 센서를 포함할 수 있다. 하나 이상의 트랜스듀서 어레이 는 크기가 다양할 수 있고, 다양한 수의 전극을 포함할 수 있다. 트랜스듀서 어레이는 환자의 머리, 몸통, 팔 또는 다리와 같은 환자 신체의 특정 부위에 배치되도록 구성될 수 있다. 일 실시예에서, 전극은 세라믹 디스크일 수 있고, 각각의 세라믹 디스크는 직경이 약 2 cm 및 두께가 약 1 mm일 수 있다. 다른 예에서, 전극들은 디스크 형태가 아닌 세라믹 요소일 수 있다. 또 다른 예에서, 전극 들은 복수의 평면 도체들 위에 배치된 비-세라믹 유전체 재료일 수 있다. 평평한 도체 위에 배치되는 비세 라믹 유전체 재료의 예로는 인쇄 회로 기판의 패드 또는 평평한 금속 조각 위에 배치된 폴리머 필름이 포함될 수 있다. 특정 실시예에서, 용량성 결합되지 않은 전극 어레이를 사용하는 트랜스 듀서도 사용될 수 있다. 이러 한 상황에서, 각 전극 요소는 전도성 요소와 신체 사이에 절연 유전체 층이 배치되지 않고, 피험자의 신체 에 배치되도록 구성된 전도성 물질의 영역을 사용하여 구현될 수 있다. 다른 실시예에서, 트랜스듀서는 단일 전 극 요소만을 포함할 수 있다. 예를 들어, 단일 전극 요소는 기판 상에 배치된 유연한 유기 물질 또는 유연한 유 기 복합체일 수 있다. 또 다른 예로서, 트랜스듀서는 기판이 없는 유연한 유기 물질 또는 유연한 유기 복합체를 포함할 수 있다. 본 발명의 실시예와 함께 사용하기 위한 트랜스듀서를 구현하기 위한 다른 대체 구조도 (a) 피험자의 신체에 TT 필드를 전달할 수 있고 (b) 본 명세서에 명시된 위치에 배치될 수 있는 한 사용될 수 있다. 본 발명은 다음과 같은 다른 예시적인 실시예를 포함한다. 예시적 실시예 1: 3차원 모델을 생성하기 위한 명령어를 포함하는 비일시적 컴퓨터 판독 가능 매체로, 상기 명 령어가 컴퓨터에 의해 실행될 때 방법이 수행되며, 상기 방법은: 제1 이미지 양식의 환자 신체의 제1 부분의 제 1 이미지 데이터를 수신하는 단계, 제2 이미지 양식의 환자 신체의 제2 부분의 제2 이미지 데이터를 수신하는 단계, 제2 이미지 양식에서 제1 이미지 양식으로 제2 이미지 데이터를 수정하는 단계 및 제1 이미지 양식의 제1 이미지 데이터 및 제2 이미지 양식의 수정된 제2 이미지 데이터에 기초하여, 환자 신체의 제1 부분 및 제2 부분 의 3차원 모델을 생성하는 단계를 포함한다. 예시적 실시예 2: 3차원 모델을 생성하기 위한 명령어를 포함하는 비일시적 컴퓨터 판독 가능 매체로, 상기 명 령어가 컴퓨터에 의해 실행될 때 방법이 수행되며, 상기 방법은: 환자의 신체 부위의 제1 부분의 제1 이미지 데 이터를 수신하는 단계로, 상기 신체 부위의 제1 부분은 완전한 신체 부위보다 부족하고, 복수의 피험자에 대한 신체 부위의 복수의 제2 이미지 데이터를 수신하는 단계, 상기 복수의 제2 이미지 데이터에 기초하여, 신체 부 위 완성 모델을 결정하는 단계, 상기 신체 부위 완성 모델 및 상기 제1 이미지 데이터에 기초하여, 신체 부위의 제2 부분의 제3 이미지 데이터를 생성하는 단계, 상기 제1 이미지 데이터 및 제3 이미지 데이터에 기초하여, 환 자 신체 부위의 3차원 모델을 생성하는 단계를 포함한다. 예시적 실시예 3: 3차원 모델을 생성하기 위한 명령어를 포함하는 비일시적 컴퓨터 판독 가능 매체로, 상기 명 령어가 컴퓨터에 의해 실행될 때 방법이 수행되며, 상기 방법은: 제1 이미지 해상도로 환자 신체 일부의 제1 이 미지 데이터를 수신하는 단계, 복수의 피사체에 대한 복수의 제2 이미지 데이터를 수신하는 단계, 복수의 제2 이미지 데이터에 기초하여, 제1 이미지 데이터의 해상도를 증가시키기 위한 초해상도 모델을 결정하는 단계 및 초해상도 모델 및 제1 이미지 데이터에 기초하여, 제2 이미지 해상도로 환자 신체 일부의 제3 이미지 데이터를 생성하는 단계로, 제2 이미지 해상도는 제1 이미지 해상도보다 크다. 예시적 실시예 4: 3차원 모델을 생성하는 시스템으로, 시스템은 하나 이상의 프로세서 및 하나 이상의 프로세서 에 의해 액세스 가능한 메모리를 포함하고, 메모리는 하나 이상의 프로세서에 의해 실행될 때 시스템이 방법을 수행하도록 하는 명령을 저장하며, 상기 방법은: 제1 이미지 양식의 환자 신체의 제1 부분의 제1 이미지 데이터 를 수신하는 단계, 제2 이미지 양식의 환자 신체의 제2 부분의 제2 이미지 데이터를 수신하는 단계, 제2 이미지 양식에서 제1 이미지 양식으로 제2 이미지 데이터를 수정하는 단계, 제1 이미지 양식의 제1 이미지 데이터 및 제2 이미지 양식의 수정된 제2 이미지 데이터에 기초하여, 환자 신체의 제1 부분 및 제2 부분의 3차원 모델을 생성하는 단계를 포함한다. 예시적 실시예 5: 3차원 모델을 생성하는 시스템으로, 시스템은 하나 이상의 프로세서 및 하나 이상의 프로세 서에 의해 액세스 가능한 메모리를 포함하고, 메모리는 하나 이상의 프로세서에 의해 실행될 때 시스템이 방법 을 수행하도록 하는 명령을 저장하며, 상기 방법은: 환자의 신체 부위의 제1 부분의 제1 이미지 데이터를 수신 하는 단계로, 상기 신체 부위의 제1 부분은 완전한 신체 부위보다 부족하고, 복수의 피험자에 대한 신체 부위의 복수의 제2 이미지 데이터를 수신하는 단계, 상기 복수의 제2 이미지 데이터에 기초하여 신체 부위 완성 모델을결정하는 단계, 상기 신체 부위 완성 모델 및 상기 제1 이미지 데이터에 기초하여 신체 부위의 제2 부분의 제3 이미지 데이터를 생성하는 단계 및 상기 제1 이미지 데이터 및 제3 이미지 데이터에 기초하여 환자 신체 부위의 3차원 모델을 생성하는 단계를 포함한다. 예시적 실시예 6: 3차원 모델을 생성하는 시스템으로, 시스템은 하나 이상의 프로세서 및 하나 이상의 프로세서 에 의해 액세스 가능한 메모리를 포함하고, 메모리는 하나 이상의 프로세서에 의해 실행될 때 시스템이 방법을 수행하도록 하는 명령을 저장하며, 상기 방법은: 제1 이미지 해상도로 환자 신체 일부의 제1 이미지 데이터를 수신하는 단계, 복수의 피사체에 대한 복수의 제2 이미지 데이터를 수신하는 단계, 복수의 제2 이미지 데이터에 기초하여 제1 이미지 데이터의 해상도를 증가시키기 위한 초해상도 모델을 결정하는 단계, 초해상도 모델 및 제 1 이미지 데이터에 기초하여 제2 이미지 해상도로 환자 신체 일부의 제3 이미지 데이터를 생성하는 단계로, 제2 이미지 해상도는 제1 이미지 해상도보다 큰 것을 포함하는 방법. 예시적 실시예 7: 컴퓨터 구현된 3차원 모델을 생성하는 방법으로, 컴퓨터는 하나 이상의 프로세서 및 하나 이 상의 프로세서에 의해 액세스 가능한 메모리를 포함하고, 메모리는 하나 이상의 프로세서에 의해 실행될 때 컴 퓨터가 방법을 수행하게 하는 명령어를 저장하며, 방법은: 제1 이미지 양식에서 환자 신체의 제1 부분의 제1 이 미지 데이터를 수신하는 단계, 제2 이미지 양식에서 환자 신체의 제2 부분의 제2 이미지 데이터를 수신하는 단 계, 제2 이미지 양식에서 제1 이미지 양식으로 제2 이미지 데이터를 수정하는 단계, 제1 이미지 양식의 제1 이 미지 데이터 및 제2 이미지 양식의 수정된 제2 이미지 데이터에 기초하여, 환자 신체의 제1 부분 및 제2 부분의 3차원 모델을 생성하는 단계를 포함한다. 예시적 실시예 8: 예시적 실시예 7의 컴퓨터로 구현된 방법으로, 제1 이미지 양식은 자기 공명 영상(MRI)을 포 함한다. 예시적 실시예 9: 예시적 실시예 7의 컴퓨터로 구현된 방법으로, 환자 신체의 제1 부분은 환자 신체 부위의 제1 부분이고, 환자 신체 부위의 제2 부분은 환자 신체 부위의 제2 부분이다. 예시적 실시예 10: 예시적 실시예 7의 컴퓨터로 구현된 방법으로, 신체 부위는 머리, 몸통, 팔, 또는 다리 중 하나이다. 예시적 실시예 11: 컴퓨터 구현된 3차원 모델을 생성하는 방법으로, 컴퓨터는 하나 이상의 프로세서 및 하나 이 상의 프로세서에 의해 액세스 가능한 메모리를 포함하고, 메모리는 하나 이상의 프로세서에 의해 실행될 때 컴 퓨터가 방법을 수행하게 하는 명령어를 저장하며, 방법은: 환자의 신체 부위의 제1 부분의 제1 이미지 데이터를 수신하는 단계로, 상기 신체 부위의 제1 부분은 완전한 신체 부위보다 부족하고, 복수의 피험자에 대한 신체 부 위의 복수의 제2 이미지 데이터를 수신하는 단계, 상기 복수의 제2 이미지 데이터에 기초하여, 신체 부위 완성 모델을 결정하는 단계, 상기 신체 부위 완성 모델 및 상기 제1 이미지 데이터에 기초하여, 신체 부위의 제2 부 분의 제3 이미지 데이터를 생성하는 단계, 상기 제1 이미지 데이터 및 상기 제3 이미지 데이터에 기초하여, 환 자 신체 부위의 3차원 모델을 생성하는 단계를 포함한다. 예시적 실시예 12: 예시적 실시예 11의 컴퓨터로 구현된 방법으로, 3차원 모델은 환자의 신체 부위에 대한 완전 한 모델이다. 예시적 실시예 13: 컴퓨터로 구현된 3차원 모델을 생성하는 방법으로, 컴퓨터는 하나 이상의 프로세서 및 하나 이상의 프로세서에 의해 액세스 가능한 메모리를 포함하고, 메모리는 하나 이상의 프로세서에 의해 실행될 때 컴퓨터가 방법을 수행하게 하는 명령을 저장하며, 방법은: 제1 이미지 해상도로 환자 신체 일부의 제1 이미지 데이터를 수신하는 단계, 복수의 피사체에 대한 복수의 제2 이미지 데이터를 수신하는 단계, 복수의 제2 이미지 데이터에 기초하여, 제1 이미지 데이터의 해상도를 증가시키기 위한 초해상도 모델을 결정하는 단계, 초해상도 모델 및 제1 이미지 데이터에 기초하여, 제2 이미지 해상도로 환자 신체 일부의 제3 이미지 데이터를 생성하는 단계로, 제2 이미지 해상도는 제1 이미지 해상도보다 더 큰 것을 포함한다. 예시적 실시예 14: 예시적 실시예 13의 컴퓨터로 구현된 방법으로, 제1 이미지 해상도는 자기 공명 이미징을 포 함한다. 본 개시의 임의의 제목 또는 일부에 예시된 실시예는 본 명세서에 달리 명시되지 않거나 문맥에 의해 명확하게 모순되지 않는 한, 동일 또는 다른 제목 또는 본 개시의 다른 일부에 예시된 실시예와 결합될 수 있다. 청구범위에 정의된 본 발명의 범위를 벗어나지 않고 설명된 실시예에 대한 수많은 수정, 변경 및 변경이 가능한 다. 본 발명은 설명된 실시예에 한정되는 것이 아니라, 다음 청구범위의 언어에 의해 정의된 전체 범위 및 이에대응하는 균등한 범위를 갖는 것이 의도된 것이다."}
{"patent_id": "10-2023-7028264", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 환자의 두 이미지 스캔을 기반으로 환자의 신체 부위에 대한 3차원 이미지를 생성하는 방법의 예시 순서 도이다. 도 2는 환자의 단일 이미지 스캔을 기반으로 환자의 신체 부위에 대한 3차원 이미지를 생성하는 방법의 예시 순 서도이다. 도 3은 환자 신체 부위의 저해상도 이미지를 기반으로 환자 신체 부위의 고해상도 3차원 이미지를 생성하는 방 법의 예시적인 순서도이다. 도 4는 환자 신체 일부에 TTField를 전달하기 위한 트랜스듀서 어레이 레이아웃을 결정하는 방법의 예시를 보여 주는 순서도이다. 도 5는 작동 환경의 예시를 보여주는 블록 다이어그램이다. 도 6은 전기 치료용 장치의 예시를 도시한 도면이다."}
