{"patent_id": "10-2022-0044580", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0141249", "출원번호": "10-2022-0044580", "발명의 명칭": "용접 품질을 예측하기 위한 분석 및 알고리즘의 사용", "출원인": "브란손 울트라소닉스 코포레이숀", "발명자": "존 폴 쿠르피에브스키"}}
{"patent_id": "10-2022-0044580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "시스템에 있어서,프로세서 및 메모리를 구비하는 컴퓨터를 포함하되, 상기 프로세서 및 메모리는,적어도 2개의 부품을 용접부로 결합하는 용접기에 의한 용접 프로세스 동안 생성되는 용접 파라미터 데이터를수신하고,적어도 하나의 예측된 용접 품질 파라미터를 생성하기 위해서 상기 수신된 용접 파라미터 데이터를 데이터 분석모델에 입력하고,상기 예측된 용접 품질 파라미터를 용접 품질 파라미터 임계값과 비교하고,상기 적어도 하나의 예측된 용접 품질 파라미터와 상기 용접 품질 파라미터 임계값 사이의 상기 비교의 결과,및 상기 적어도 하나의 예측된 용접 품질 파라미터 중 적어도 하나를 나타내는 출력을 생성하도록 구성된, 시스템."}
{"patent_id": "10-2022-0044580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 데이터 분석 모델은, 용접 파라미터 데이터를 용접 품질 데이터와 연관시키는 실제 용접 데이터에 기반하는 훈련(training) 절차 동안 훈련되는, 시스템."}
{"patent_id": "10-2022-0044580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 데이터 분석 모델은, 지도 학습 알고리즘, 비지도 학습 알고리즘, 회귀 알고리즘, 분류 알고리즘, 인공 지능 신경망 알고리즘, 의사결정 트리 알고리즘, 랜덤 포레스트(random forest) 알고리즘, K 최근접 이웃(Knearest neighbor) 알고리즘, 나이브 베이즈(Nave Bayes) 알고리즘, 서포트 벡터 머신(support vectormachine) 알고리즘, 및 그래디언트 부스팅 회귀(gradient boosting regression) 알고리즘 중 적어도 하나에 기반하는, 시스템."}
{"patent_id": "10-2022-0044580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 적어도 하나의 예측된 용접 품질 파라미터는, 상기 용접부의 박리 강도, 당김(pull)/인장 강도, 파열(burst) 압력, 및 광학적 외관 중 적어도 하나를 나타내는, 시스템."}
{"patent_id": "10-2022-0044580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 용접 프로세스 동안 생성된 상기 용접 파라미터 데이터는, 전류 데이터, 전압 데이터, 전력 데이터 및 주파수 데이터 중 적어도 하나를 포함하여, 상기 용접기의 초음파 전력 공급 장치에 의해서 상기 용접기의 초음파변환기에 공급되는 전기 에너지에 대응되는 상기 용접기의 상기 초음파 전력 공급 장치에 의해 생성되는 데이터를 포함하는, 시스템."}
{"patent_id": "10-2022-0044580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 용접 프로세스 동안 생성되는 상기 용접 파라미터 데이터는, 상기 용접기의 혼의 이동 거리/깊이, 상기 혼공개특허 10-2022-0141249-3-의 힘, 및 상기 혼의 속도/하방 속력(down speed) 중 적어도 하나를 포함하여, 상기 혼을 이동시키는 액추에이터에 의해 생성된 데이터를 포함하는, 시스템."}
{"patent_id": "10-2022-0044580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 용접 프로세스 동안 생성된 상기 용접 파라미터 데이터는, 온도 센서, 레이저 진동계, 위치 측정 센서, 응력/변형률 센서, 충격 센서, 및 카메라 중 적어도 하나를 포함하는 적어도 하나의 센서에 의해 생성된 데이터를포함하는, 시스템."}
{"patent_id": "10-2022-0044580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 용접 파라미터 데이터는 상기 용접 프로세스의 기간에 걸쳐 일련의 용접 파라미터 값을 갖는 용접 그래프데이터를 포함하는, 시스템."}
{"patent_id": "10-2022-0044580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 프로세서 및 메모리는, 상기 용접 그래프 데이터 내의 어노말리(anomaly)를 식별하기 위해 매트릭스 프로파일링을 사용하여 상기 용접 그래프 데이터를 분석하도록 추가로 구성되는, 시스템."}
{"patent_id": "10-2022-0044580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 적어도 2개의 부품은 와이어들의 번들(bundle)을 포함하는, 시스템."}
{"patent_id": "10-2022-0044580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서,상기 용접기는, 초음파 용접기, 레이저 용접기, 진동/마찰 용접기, 적외선 용접기, 적외선 예열 시스템을 구비한 복합 진동 용접기, 스핀 용접기, 및 핫 플레이트 용접기 중 하나인, 시스템."}
{"patent_id": "10-2022-0044580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1항에 있어서,용접 파라미터 데이터를 용접 품질 데이터와 연관시키는 실제 용접 데이터에 기반하는 튜닝 절차를 활용함으로써 상기 용접기가 상기 현장에서 작동된 후, 상기 데이터 분석 모델이 다시 캘리브레이션되도록 구성된,시스템."}
{"patent_id": "10-2022-0044580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "방법에 있어서,적어도 2개의 부품을 용접부로 결합하는 용접기에 의한 용접 프로세스 동안 생성된 용접 파라미터 데이터를, 프로세서 및 메모리를 구비하는 컴퓨터로 수신하는 단계;적어도 하나의 예측된 용접 품질 파라미터를 생성하기 위해서 상기 수신된 용접 파라미터 데이터를, 상기 컴퓨터로 데이터 분석 모델에 입력하는 단계;상기 적어도 하나의 예측된 용접 품질 파라미터를 용접 품질 파라미터 임계값과, 상기 컴퓨터로 비교하는 단계;및상기 적어도 하나의 예측된 용접 품질 파라미터와 상기 용접 품질 파라미터 임계값 사이의 상기 비교의 결과,및 상기 적어도 하나의 예측된 용접 품질 파라미터 중 적어도 하나를 나타내는 출력을, 상기 컴퓨터로 생성하는단계를 포함하는 방법.공개특허 10-2022-0141249-4-청구항 14 제13항에 있어서,용접 파라미터 데이터를 용접 품질 데이터와 연관시키는 실제 용접 데이터에 기반하는 훈련 절차 동안 상기 데이터 분석 모델을 훈련시키는 단계를 더 포함하는 방법."}
{"patent_id": "10-2022-0044580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제13항에 있어서,상기 데이터 분석 모델은, 지도 학습 알고리즘, 비지도 학습 알고리즘, 회귀 알고리즘, 분류 알고리즘, 인공 지능 신경망 알고리즘, 의사결정 트리 알고리즘, 랜덤 포레스트(random forest) 알고리즘, K 최근접 이웃(Knearest neighbor) 알고리즘, 나이브 베이즈(Nave Bayes) 알고리즘, 서포트 벡터 머신(support vectormachine) 알고리즘, 및 그래디언트 부스팅 회귀(gradient boosting regression) 알고리즘 중 적어도 하나를 포함하는, 방법."}
{"patent_id": "10-2022-0044580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제13항에 있어서,상기 적어도 하나의 예측된 용접 품질 파라미터는, 상기 용접부의 박리 강도, 당김(pull)/인장 강도, 상기 용접부의 파열(burst) 압력, 및 광학적 외관 중 적어도 하나를 나타내는, 방법."}
{"patent_id": "10-2022-0044580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제13항에 있어서,상기 용접 프로세스 동안 생성된 상기 용접 파라미터 데이터는, 전류 데이터, 전압 데이터, 전력 데이터 및 주파수 데이터 중 적어도 하나를 포함하여, 상기 용접기의 초음파 전력 공급 장치에 의해서 상기 용접기의 초음파변환기에 공급되는 전기 에너지에 대응되는 상기 용접기의 상기 초음파 전력 공급 장치에 의해 생성되는 데이터를 포함하는, 방법."}
{"patent_id": "10-2022-0044580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제13항에 있어서,상기 용접 프로세스 동안 생성되는 상기 용접 파라미터 데이터는, 상기 용접기의 혼의 이동 거리/깊이, 상기 혼의 힘, 및 상기 혼의 속도/하방 속력(down speed) 중 적어도 하나를 포함하여, 상기 혼을 이동시키는 액추에이터에 의해 생성된 데이터를 포함하는, 방법."}
{"patent_id": "10-2022-0044580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제13항에 있어서,상기 용접 프로세스 동안 생성된 상기 용접 파라미터 데이터는, 온도 센서, 레이저 진동계, 위치 측정 센서, 응력/변형률 센서, 충격 센서, 및 카메라 중 적어도 하나를 포함하는 적어도 하나의 센서에 의해 생성된 데이터를포함하는, 방법."}
{"patent_id": "10-2022-0044580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제13항에 있어서,상기 용접 파라미터 데이터는 상기 용접 프로세스의 기간에 걸쳐 일련의 용접 파라미터 값을 갖는 용접 그래프데이터를 포함하는, 방법."}
{"patent_id": "10-2022-0044580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제20항에 있어서,상기 용접 그래프 데이터 내의 어노말리를 식별하기 위해 매트릭스 프로파일링을 사용하여 상기 용접 그래프 데공개특허 10-2022-0141249-5-이터를, 상기 컴퓨터로 분석하는 단계를 더 포함하는 방법."}
{"patent_id": "10-2022-0044580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "시스템에 있어서,프로세서 및 메모리를 구비하는 컴퓨터를 포함하되, 상기 프로세서 및 메모리는,적어도 2개의 부품을 용접부로 결합하는 용접기에 의한 용접 프로세스 동안 생성되는 용접 파라미터 데이터를수신하고,상기 용접 파라미터 데이터를 적어도 하나의 임계값과 비교하는 것에 기반하여 상기 용접 파라미터 데이터의 어노말리를 제거함으로써 상기 용접 파라미터 데이터를 필터링하고,상기 용접 파라미터 데이터의 임의의 어노말리로 인해, 상기 용접 파라미터 데이터가 거부되었다는 것을 나타내는 출력을 생성하고,적어도 하나의 예측된 용접 품질 파라미터를 생성하기 위해서 상기 필터링된 용접 파라미터 데이터를 데이터 분석 모델에 입력하고,상기 예측된 용접 품질 파라미터를 용접 품질 파라미터 임계값과 비교하고,상기 적어도 하나의 예측된 용접 품질 파라미터와 상기 용접 품질 파라미터 임계값 사이의 상기 비교의 결과,및 상기 적어도 하나의 예측된 용접 품질 파라미터 중 적어도 하나를 나타내는 출력을 생성하도록 구성된, 시스템."}
{"patent_id": "10-2022-0044580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제22항에 있어서,상기 용접 파라미터 데이터를 적어도 하나의 임계값과 비교하는 것에 기반하여 상기 용접 파라미터 데이터에서어노말리를 제거하는 것은 통계적 프로세스 제어 알고리즘을 활용하는 것을 포함하는, 시스템."}
{"patent_id": "10-2022-0044580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제23항에 있어서,상기 통계적 프로세스 제어 알고리즘은 상기 용접 파라미터 데이터의 적어도 하나의 데이터 값을 상기 적어도하나의 데이터 값에 대응되는 민값(mean value)과 비교하고, 상기 적어도 하나의 데이터 값이 미리 결정된 수의표준 편차보다 더 많이 상기 민값으로부터 떨어져 있는 것에 응답하여 상기 적어도 하나의 데이터 값을 어노말리(anomaly)로 분류하는, 시스템."}
{"patent_id": "10-2022-0044580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제22항에 있어서,상기 용접 파라미터 데이터를 적어도 하나의 임계값과 비교하는 것에 기반하여 상기 용접 파라미터 데이터에서어노말리를 제거하는 것은, 상기 용접 파라미터 데이터를 높은 임계값 및 낮은 임계값과 비교하는 것, 및 상기용접 파라미터 데이터가 상기 높은 임계값보다 더 크거나 상기 낮은 임계값보다 더 낮은 것에 응답하여 상기 용접 파라미터 데이터를 어노말리로 분류하는 것을 포함하는, 시스템."}
{"patent_id": "10-2022-0044580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "제25항에 있어서,상기 높은 임계값 및 상기 낮은 임계값은 사용자 정의 가능한, 시스템."}
{"patent_id": "10-2022-0044580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "제22항에 있어서,상기 데이터 분석 모델은, 지도 학습 알고리즘, 비지도 학습 알고리즘, 회귀 알고리즘, 분류 알고리즘, 인공 지능 신경망 알고리즘, 의사결정 트리 알고리즘, 랜덤 포레스트(random forest) 알고리즘, K 최근접 이웃(K공개특허 10-2022-0141249-6-nearest neighbor) 알고리즘, 나이브 베이즈(Nave Bayes) 알고리즘, 서포트 벡터 머신(support vectormachine) 알고리즘, 및 그래디언트 부스팅 회귀(gradient boosting regression) 알고리즘 중 적어도 하나에 기반하는, 시스템."}
{"patent_id": "10-2022-0044580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_28", "content": "시스템에 있어서,프로세서 및 메모리를 구비하는 컴퓨터를 포함하되, 상기 프로세서 및 메모리는,적어도 2개의 부품을 용접부로 결합하는 용접기에 의한 용접 프로세스 동안 생성되는 용접 파라미터 데이터를수신하고,상기 용접 파라미터 데이터를 높은 임계값 및 낮은 임계값과 비교하는 것에 기반하여 상기 용접 파라미터 데이터의 제1 어노말리를 제거함으로써 상기 용접 파라미터 데이터를 필터링하고,통계적 프로세스 제어 알고리즘에 기반하여 상기 용접 파라미터 데이터에서 제2 어노말리를 제거함으로써 상기용접 파라미터 데이터를 필터링하고,상기 용접 파라미터 데이터의 상기 제1 어노말리 및 상기 제2 어노말리로 인해, 상기 용접 파라미터 데이터가거부되었다는 것을 나타내는 출력을 생성하고,적어도 하나의 예측된 용접 품질 파라미터를 생성하기 위해서 상기 필터링된 용접 파라미터 데이터를 적어도 하나의 데이터 분석 모델에 입력하고,상기 예측된 용접 품질 파라미터를 용접 품질 파라미터 임계값과 비교하고,상기 적어도 하나의 예측된 용접 품질 파라미터와 상기 용접 품질 파라미터 임계값 사이의 상기 비교의 결과,및 상기 적어도 하나의 예측된 용접 품질 파라미터 중 적어도 하나를 나타내는 출력을 생성하도록 구성된, 시스템."}
{"patent_id": "10-2022-0044580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "제28항에 있어서,상기 통계적 프로세스 제어 알고리즘은 상기 용접 파라미터 데이터의 적어도 하나의 데이터 값을 상기 적어도하나의 데이터 값에 대응되는 민값(mean value)과 비교하고, 상기 적어도 하나의 데이터 값이 미리 결정된 수의표준 편차보다 더 많이 상기 민값으로부터 떨어져 있는 것에 응답하여 상기 적어도 하나의 데이터 값을 어노말리(anomaly)로 분류하는, 시스템."}
{"patent_id": "10-2022-0044580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_30", "content": "제28항에 있어서,상기 적어도 하나의 데이터 분석 모델은, 지도 학습 알고리즘, 비지도 학습 알고리즘, 회귀 알고리즘, 분류 알고리즘, 인공 지능 신경망 알고리즘, 의사결정 트리 알고리즘, 랜덤 포레스트(random forest) 알고리즘, K 최근접 이웃(K nearest neighbor) 알고리즘, 나이브 베이즈(Nave Bayes) 알고리즘, 서포트 벡터 머신(supportvector machine) 알고리즘, 및 그래디언트 부스팅 회귀(gradient boosting regression) 알고리즘 중 적어도 하나를 포함하는, 시스템."}
{"patent_id": "10-2022-0044580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_31", "content": "제28항에 있어서,상기 적어도 하나의 데이터 분석 모델은, 지도 학습 알고리즘, 비지도 학습 알고리즘, 회귀 알고리즘, 분류 알고리즘, 인공 지능 신경망 알고리즘, 의사결정 트리 알고리즘, 랜덤 포레스트(random forest) 알고리즘, K 최근접 이웃(K nearest neighbor) 알고리즘, 나이브 베이즈(Nave Bayes) 알고리즘, 서포트 벡터 머신(supportvector machine) 알고리즘, 및 그래디언트 부스팅 회귀(gradient boosting regression) 알고리즘 중 적어도 하공개특허 10-2022-0141249-7-나를 포함하는, 시스템."}
{"patent_id": "10-2022-0044580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_32", "content": "제28항에 있어서,상기 적어도 하나의 데이터 분석 모델은, 회귀 알고리즘, 분류 알고리즘, 의사결정 트리 알고리즘, 랜덤 포레스트 알고리즘, K 최근접 이웃 알고리즘, 나이브 베이즈 알고리즘, 서포트 벡터 머신 알고리즘, 및 그래디언트 부스팅 회귀 알고리즘 중 적어도 하나, 및 인공 지능 신경망 알고리즘을 포함하는, 시스템."}
{"patent_id": "10-2022-0044580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_33", "content": "시스템에 있어서,프로세서 및 메모리를 구비하는 컴퓨터를 포함하되, 상기 프로세서 및 메모리는,용접 파라미터, 및 상기 용접 파라미터와 연관된 용접 품질 데이터를 포함하는 용접 파라미터 훈련 데이터를 수신하고,복수의 대응되는 예측된 용접 품질 파라미터를 생성하기 위해 상기 수신된 용접 파라미터 훈련 데이터를 복수의데이터 분석 모델에 입력하고,상기 예측된 용접 품질 파라미터 각각을 상기 알려진 용접 품질 데이터와 비교하고,상기 비교에 기반하여 상기 복수의 데이터 분석 모델로부터 특정 데이터 분석 모델을 선택하고,적어도 2개의 부품을 용접부로 결합하는 용접기에 의한 용접 프로세스 동안 생성되는 실제 용접 파라미터 데이터를 수신하고,적어도 하나의 예측된 용접 품질 파라미터를 생성하기 위해서 상기 실제 용접 파라미터 데이터를 상기 특정 데이터 분석 모델에 입력하고,상기 예측된 용접 품질 파라미터를 용접 품질 파라미터 임계값과 비교하고,상기 적어도 하나의 예측된 용접 품질 파라미터와 상기 용접 품질 파라미터 임계값 사이의 상기 비교의 결과,및 상기 적어도 하나의 예측된 용접 품질 파라미터 중 적어도 하나를 나타내는 출력을 생성하도록 구성된, 시스템."}
{"patent_id": "10-2022-0044580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_34", "content": "제33항에 있어서,상기 복수의 데이터 분석 모델 각각은, 지도 학습 알고리즘, 비지도 학습 알고리즘, 회귀 알고리즘, 분류 알고리즘, 인공 지능 신경망 알고리즘, 의사결정 트리 알고리즘, 랜덤 포레스트(random forest) 알고리즘, K 최근접이웃(K nearest neighbor) 알고리즘, 나이브 베이즈(Nave Bayes) 알고리즘, 서포트 벡터 머신(supportvector machine) 알고리즘, 및 그래디언트 부스팅 회귀(gradient boosting regression) 알고리즘 중 적어도 하나에 기반하는, 시스템."}
{"patent_id": "10-2022-0044580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_35", "content": "제33항에 있어서,상기 적어도 하나의 예측된 용접 품질 파라미터는, 상기 용접부의 박리 강도, 당김(pull)/인장 강도, 파열(burst) 압력, 및 광학적 외관 중 적어도 하나를 나타내는, 시스템."}
{"patent_id": "10-2022-0044580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_36", "content": "방법에 있어서,용접 파라미터, 및 상기 용접 파라미터와 연관된 용접 품질 데이터를 포함하는 용접 파라미터 훈련 데이터를,프로세서 및 메모리를 구비하는 컴퓨터로 수신하는 단계;공개특허 10-2022-0141249-8-복수의 대응되는 예측된 용접 품질 파라미터를 생성하기 위해 상기 수신된 용접 파라미터 훈련 데이터를, 상기컴퓨터로 복수의 데이터 분석 모델에 입력하는 단계;상기 예측된 용접 품질 파라미터 각각을 상기 알려진 용접 품질 데이터와, 상기 컴퓨터로 비교하는 단계;상기 비교에 기반하여 상기 복수의 데이터 분석 모델로부터 특정 데이터 분석 모델을, 상기 컴퓨터로 선택하는단계;적어도 2개의 부품을 용접부로 결합하는 용접기에 의한 용접 프로세스 동안 생성되는 실제 용접 파라미터 데이터를, 상기 컴퓨터로 수신하는 단계;적어도 하나의 예측된 용접 품질 파라미터를 생성하기 위해서 상기 실제 용접 파라미터 데이터를, 상기 컴퓨터로 상기 특정 데이터 분석 모델에 입력하는 단계;상기 예측된 용접 품질 파라미터를 용접 품질 파라미터 임계값과, 상기 컴퓨터로 비교하는 단계; 및상기 적어도 하나의 예측된 용접 품질 파라미터와 상기 용접 품질 파라미터 임계값 사이의 상기 비교의 결과,및 상기 적어도 하나의 예측된 용접 품질 파라미터 중 적어도 하나를 나타내는 출력을, 상기 컴퓨터로 생성하는단계를 포함하는 방법."}
{"patent_id": "10-2022-0044580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_37", "content": "제36항에 있어서,상기 복수의 데이터 분석 모델 각각은, 지도 학습 알고리즘, 비지도 학습 알고리즘, 회귀 알고리즘, 분류 알고리즘, 인공 지능 신경망 알고리즘, 의사결정 트리 알고리즘, 랜덤 포레스트(random forest) 알고리즘, K 최근접이웃(K nearest neighbor) 알고리즘, 나이브 베이즈(Nave Bayes) 알고리즘, 서포트 벡터 머신(supportvector machine) 알고리즘, 및 그래디언트 부스팅 회귀(gradient boosting regression) 알고리즘 중 적어도 하나에 기반하는, 방법."}
{"patent_id": "10-2022-0044580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_38", "content": "제36항에 있어서,상기 적어도 하나의 예측된 용접 품질 파라미터는, 상기 용접부의 박리 강도, 당김(pull)/인장 강도, 파열(burst) 압력, 및 광학적 외관 중 적어도 하나를 나타내는, 방법."}
{"patent_id": "10-2022-0044580", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "용접 품질을 예측하기 위해 분석 및 알고리즘을 사용하기 위한 시스템 및 방법이 제공되고, 이는 프로세서 및 메 모리를 구비하는 컴퓨터를 포함하되, 프로세서 및 메모리는, 적어도 2개의 부품을 용접부로 결합하는 용접기에 의한 용접 프로세스 동안 생성되는 용접 파라미터 데이터를 수신하고, 적어도 하나의 예측된 용접 품질 파라미터 를 생성하기 위해서 수신된 용접 파라미터 데이터를 데이터 분석 모델에 입력하고, 예측된 용접 품질 파라미터를 용접 품질 파라미터 임계값과 비교하고, 적어도 하나의 예측된 용접 품질 파라미터와 용접 품질 파라미터 임계값 사이의 비교의 결과, 및 적어도 하나의 예측된 용접 품질 파라미터 중 적어도 하나를 나타내는 출력을 생성하도 록 구성된다."}
{"patent_id": "10-2022-0044580", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "관련 출원에 대한 교차 참조 본 출원은 2021년 7월 22일자로 출원된 미국 임시 출원 제63/224,648호의 이익을 주장한다. 본 출원은 또한, 2021년 4월 12일자로 출원된 인도 임시 특허 출원 제202121017108호의 이익 및 우선권을 주장한다. 위 출원들 각각의 전체 개시내용은 본원에 인용되어 포함된다. 본 개시내용은 용접 품질을 예측하기 위해 분석을 사용하는 시스템 및 방법에 관한 것으로, 보다 구체적으로는, 용접부의 품질을 평가하고 예측하기 위해서, 회귀, 분류 및/또는 인공 지능 모델 및 알고리즘을 포함하여, 기계 학습을 사용하는 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2022-0044580", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "이 항목은, 반드시 선행 기술일 필요는 없는 본 개시내용과 관련된 배경 정보를 제공한다. 용접 디바이스는 두 개 이상의 피공작물 또는 부품을 함께 용접하기 위해서 사용된다. 예를 들어, 초음파 금속 용접기를 사용하여, 금속 피공작물이 함께 용접될 수 있다. 플라스틱 피공작물들은, 예를 들어, 초음파 플라스 틱 용접기, 레이저 용접기, 진동/마찰 용접기, 적외선 용접기, 스핀 용접기, 핫 플레이트 용접기를 사용하여, 그리고/또는, 적외선(IR) 예열을 하는 진동 용접(청정 진동 기술이라고도 함), 핫 가스 용접, 무선 주파수 용접또는 열 스테이킹을 사용함으로써 함께 용접될 수 있다. 전통적으로, 용접 품질을 결정하기 위해, 용접된 피공작물의 최대 100%일 수 있는 미리 결정된 샘플 레이트 (sample rate)로 용접된 피공작물 그룹으로부터 다수의 피공작물이 샘플링되고 테스트된다. 박리 강도 테스트 및 당김(인장) 강도 테스트와 같은 일부 유형의 테스트는 전통적으로, 테스트된 부품에 파괴적인 테스트 절차를 활용하며, 결과적으로, 양호한 부품이 테스트 프로세스 동안 파괴된다. 용접되는 부품의 양과 샘플 레이트에 따 라, 파괴 테스트로 인한 비용이 상당할 수 있다. 예를 들어, 공장이 생산 라인당 하루 30,000개의 용접된 부품 의 생산량으로, 그리고 1,000개당 1회의 파괴 테스트의 테스트 샘플 레이트로 가동되면, 생산 라인당 하루 30개 의 부품이 파괴된다. 각각의 부품의 비용이 $30인 경우, 파괴된 부품으로 인한 비용은 생산 라인당 하루 $900이 될 것이다. 공장이 8개의 생산 라인을 포함하고 있는 경우, 파괴된 부품으로 인한 일일 비용은 $7,200이 될 것 이고, 파괴 테스트 동안 파괴된 부품으로 인한 결과적인 연간 비용은 $2,600,000가 될 것이다. 이러한 예가 보 여주는 바와 같이, 파괴 테스트로 인한 비용은 상당할 수 있다."}
{"patent_id": "10-2022-0044580", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 항목은 개시내용의 전반적인 요약을 제공하고, 특징부의 전부 또는 전체 범위의 포괄적인 개시내용이 아니다. 시스템이 제공되고, 이는 프로세서 및 메모리를 구비하는 컴퓨터를 포함하되, 프로세서 및 메모리는, 적어도 2 개의 부품을 용접부로 결합하는 용접기에 의한 용접 프로세스 동안 생성되는 용접 파라미터 데이터를 수신하고, 적어도 하나의 예측된 용접 품질 파라미터를 생성하기 위해서 수신된 용접 파라미터 데이터를 데이터 분석 모델 에 입력하고, 예측된 용접 품질 파라미터를 용접 품질 파라미터 임계값과 비교하고, 적어도 하나의 예측된 용접 품질 파라미터와 용접 품질 파라미터 임계값 사이의 비교의 결과, 및 적어도 하나의 예측된 용접 품질 파라미터 중 적어도 하나를 나타내는 출력을 생성하도록 구성된다. 방법이 또한 제공되고, 이는 적어도 2개의 부품을 용접부로 결합하는 용접기에 의한 용접 프로세스 동안 생성된 용접 파라미터 데이터를, 프로세서 및 메모리를 구비하는 컴퓨터로 수신하는 단계, 적어도 하나의 예측된 용접 품질 파라미터를 생성하기 위해서 수신된 용접 파라미터 데이터를, 컴퓨터로 데이터 분석 모델에 입력하는 단계, 적어도 하나의 예측된 용접 품질 파라미터를 용접 품질 파라미터 임계값과, 컴퓨터로 비교하는 단계, 및 적어도 하나의 예측된 용접 품질 파라미터와 용접 품질 파라미터 임계값 사이의 비교의 결과, 및 적어도 하나의 예측된 용접 품질 파라미터 중 적어도 하나를 나타내는 출력을, 컴퓨터로 생성하는 단계를 포함한다. 다른 시스템이 제공되고, 이는 프로세서 및 메모리를 구비하는 컴퓨터를 포함하되, 프로세서 및 메모리는, 적어 도 2개의 부품을 용접부로 결합하는 용접기에 의한 용접 프로세스 동안 생성되는 용접 파라미터 데이터를 수신 하고, 용접 파라미터 데이터를 적어도 하나의 임계값과 비교하는 것에 기반하여 용접 파라미터 데이터의 어노말 리를 제거함으로써 용접 파라미터 데이터를 필터링하고, 용접 파라미터 데이터의 임의의 어노말리로 인해, 용접 파라미터 데이터가 거부되었다는 것을 나타내는 출력을 생성하고, 적어도 하나의 예측된 용접 품질 파라미터를 생성하기 위해서 필터링된 용접 파라미터 데이터를 데이터 분석 모델에 입력하고, 예측된 용접 품질 파라미터를 용접 품질 파라미터 임계값과 비교하고, 적어도 하나의 예측된 용접 품질 파라미터와 용접 품질 파라미터 임계 값 사이의 비교의 결과, 및 적어도 하나의 예측된 용접 품질 파라미터 중 적어도 하나를 나타내는 출력을 생성 하도록 구성된다. 다른 시스템이 제공되고, 이는 프로세서 및 메모리를 구비하는 컴퓨터를 포함하되, 프로세서 및 메모리는, 적어 도 2개의 부품을 용접부로 결합하는 용접기에 의한 용접 프로세스 동안 생성되는 용접 파라미터 데이터를 수신 하고, 용접 파라미터 데이터를 높은 임계값 및 낮은 임계값과 비교하는 것에 기반하여 용접 파라미터 데이터의 제1 어노말리를 제거함으로써 용접 파라미터 데이터를 필터링하고, 통계적 프로세스 제어 알고리즘에 기반하여 용접 파라미터 데이터에서 제2 어노말리를 제거함으로써 용접 파라미터 데이터를 필터링하고, 용접 파라미터 데 이터의 제1 어노말리 및 제2 어노말리로 인해, 용접 파라미터 데이터가 거부되었다는 것을 나타내는 출력을 생 성하고, 적어도 하나의 예측된 용접 품질 파라미터를 생성하기 위해서 필터링된 용접 파라미터 데이터를 적어도 하나의 데이터 분석 모델에 입력하고, 예측된 용접 품질 파라미터를 용접 품질 파라미터 임계값과 비교하고, 적어도 하나의 예측된 용접 품질 파라미터와 용접 품질 파라미터 임계값 사이의 비교의 결과, 및 적어도 하나의 예측된 용접 품질 파라미터 중 적어도 하나를 나타내는 출력을 생성하도록 구성된다. 다른 시스템이 제공되고, 이는 프로세서 및 메모리를 구비하는 컴퓨터를 포함하되, 프로세서 및 메모리는, 용접 파라미터, 및 용접 파라미터와 연관된 용접 품질 데이터를 포함하는 용접 파라미터 훈련 데이터를 수신하고, 복 수의 대응되는 예측된 용접 품질 파라미터를 생성하기 위해 수신된 용접 파라미터 훈련 데이터를 복수의 데이터 분석 모델에 입력하고, 예측된 용접 품질 파라미터 각각을 알려진 용접 품질 데이터와 비교하고, 비교에 기반하 여 복수의 데이터 분석 모델로부터 특정 데이터 분석 모델을 선택하고, 적어도 2개의 부품을 용접부로 결합하는 용접기에 의한 용접 프로세스 동안 생성되는 실제 용접 파라미터 데이터를 수신하고, 적어도 하나의 예측된 용 접 품질 파라미터를 생성하기 위해서 실제 용접 파라미터 데이터를 특정 데이터 분석 모델에 입력하고, 예측된 용접 품질 파라미터를 용접 품질 파라미터 임계값과 비교하고, 적어도 하나의 예측된 용접 품질 파라미터와 용 접 품질 파라미터 임계값 사이의 비교의 결과, 및 적어도 하나의 예측된 용접 품질 파라미터 중 적어도 하나를 나타내는 출력을 생성하도록 구성된다. 다른 방법이 제공되고, 이는 용접 파라미터, 및 용접 파라미터와 연관된 용접 품질 데이터를 포함하는 용접 파 라미터 훈련 데이터를, 프로세서 및 메모리를 구비하는 컴퓨터로 수신하는 단계, 복수의 대응되는 예측된 용접 품질 파라미터를 생성하기 위해 수신된 용접 파라미터 훈련 데이터를, 컴퓨터로 복수의 데이터 분석 모델에 입 력하는 단계, 예측된 용접 품질 파라미터 각각을 알려진 용접 품질 데이터와, 컴퓨터로 비교하는 단계, 상기 비 교에 기반하여 복수의 데이터 분석 모델로부터 특정 데이터 분석 모델을, 컴퓨터로 선택하는 단계, 적어도 2개 의 부품을 용접부로 결합하는 용접기에 의한 용접 프로세스 동안 생성되는 실제 용접 파라미터 데이터를, 컴퓨 터로 수신하는 단계, 적어도 하나의 예측된 용접 품질 파라미터를 생성하기 위해서 실제 용접 파라미터 데이터 를, 컴퓨터로 특정 데이터 분석 모델에 입력하는 단계, 예측된 용접 품질 파라미터를 용접 품질 파라미터 임계 값과, 컴퓨터로 비교하는 단계, 및 적어도 하나의 예측된 용접 품질 파라미터와 용접 품질 파라미터 임계값 사 이의 비교의 결과, 및 적어도 하나의 예측된 용접 품질 파라미터 중 적어도 하나를 나타내는 출력을, 컴퓨터로 생성하는 단계를 포함한다."}
{"patent_id": "10-2022-0044580", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "적용 가능성의 추가 영역은 본원에 제공된 설명으로부터 명백해질 것이다. 이 요약의 설명 및 특정 실시예는 단 지 예시를 위한 것이고, 본 개시내용의 범위를 제한하도록 의도되지 않는다."}
{"patent_id": "10-2022-0044580", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "예시적인 실시형태는 수반된 도면을 참조하여 이제 더 완전하게 설명될 것이다. 본 개시내용은 용접 품질을 예측하기 위해 분석을 사용하는 시스템 및 방법을 제공한다. 예를 들어, 본 개시내 용은, 용접 프로세스 동안 모니터링되거나 감지되는 용접 파라미터에 기반하여 금속 용접, 플라스틱 용접 및/또 는 다중 재료 용접의 품질을 평가하고 예측하기 위해서, 회귀, 분류, 및/또는 인공 지능(AI) 모델 및 알고리즘 을 포함하여, 데이터 분석 및 기계 학습을 사용하는 시스템 및 방법을 포함한다. 본 개시내용은 용접 예를 제공 하지만, 본 개시내용은, 열 스테이킹(thermal staking), 리벳팅 및/또는, 임의의 기타 기계적 결합 프로세스와 같은 다른 기계적 결합 프로세스에 동일하게 적용 가능하여, 결합 프로세스의 품질이 본 개시내용에 따라 평가 되고 예측될 수 있다. 이러한 방식으로, 본 개시내용의 시스템 및 방법은 데이터 분석 및 기계 학습을 사용하여 모니터링되거나 감지된 용접 파라미터에 기반하여 특정 피공작물의 용접 품질의 하나 이상의 메트릭(metric)을 정확하고 효율적으로 예측할 수 있고, 파괴적인 테스트 및 결과적인 용접된 피공작물의 폐기된 생산 로트(lot) 를 잠재적으로 감소시키거나 제거한다. 이와 같이, 파괴적인 테스트 또는 폐기된 로트의 비용은 본원에 설명된 정확하고 효율적인 테스트 절차의 사용에 의해서 경감되거나 회피될 수 있다. 본 개시내용의 시스템 및 방법은, 회귀 및 분류 알고리즘 또는 모델과 같은 지도 학습 알고리즘 또는 모델로 분 류되는 데이터 분석 및 기계 학습 알고리즘 또는 모델을 활용할 수 있다. 추가적으로 또는 대안적으로, 본 개시 내용의 시스템 및 방법은, AI 신경망 알고리즘 또는 모델과 같은 비지도 학습 알고리즘 또는 모델로 분류되는 데이터 분석 및 기계 학습 알고리즘 또는 모델을 활용할 수 있다. 예를 들어, 본 개시내용의 시스템 및 방법에 의해 활용되는 데이터 분석 및 기계 학습 알고리즘 또는 모델은, 아래에서 더 자세히 논의되는 바와 같이, 의사 결정 트리 알고리즘 또는 모델, 랜덤 포레스트 알고리즘 또는 모델, K 최근접 이웃(KNN: nearest neighbor) 알 고리즘 또는 모델, 나이브 베이즈(Nave Bayes) 알고리즘 또는 모델, 서포트 벡터 머신 알고리즘 또는 모델, 및/또는 AI 신경망 알고리즘 또는 모델을 포함할 수 있다. 본 개시내용은 용접기로부터 데이터를 모니터링하고 수신하는 품질 모니터링 시스템 및 방법을 포함한다. 예를 들어, 모니터링된 그리고 수신된 용접 파라미터 데이터 및/또는 그래프는, 용접 프로세스 동안 용접기에 의해서 생성되거나 사용되는 전류, 전압, 전력, 주파수, 시간, 거리/깊이, 힘, 속도 및/또는 기타 데이터 파라미터에 관한 데이터를 포함할 수 있다. 예를 들어, 용접 그래프 데이터는 시간 대 전력, 시간 대 용접 깊이와 같은 용 접 프로세스로부터의 시리즈 데이터, 및/또는 용접 그래프 데이터를 생성하기 위해 경시적으로 매핑된 용접 프 로세스로부터의 기타 적용 가능한 데이터를 포함할 수 있다. 추가적으로 또는 대안적으로, 품질 모니터링 시스 템은, 온도 센서로부터의 온도 데이터, 레이저 진동계 위치 측정값, 응력/변형률 데이터, 카메라로부터의 결과 적인 용접부의 이미지 데이터, 초음파 스택(stack)의 진동을 나타내는 충격 센서로부터의 진동 데이터 등과 같 은 용접 프로세스 외부의 센서로부터 용접 파라미터 데이터를 수신할 수 있다. 품질 모니터링 시스템 및 방법은 용접 파라미터 데이터를 입력으로서 수신하고, 위와 아래에서 논의되는 바와 같이, 데이터 분석 및 기계 학습을 사용하여 용접 파라미터 데이터를 처리하고, 결과적인 용접의 품질을 나타내고/내거나 이에 대응되는 출력을 생 성한다. 예를 들어, 품질 모니터링 시스템 및 방법은 다양한 입력을 처리하고, 박리 강도, 당김(pull)/인장 강 도, 파열(burst) 압력, 외관 등과 같은 용접 강도의 품질을 나타내는 예측된 값을 생성 및 출력할 수 있다. 다 음으로, 예측된 값은, 용접된 부품이 충분한 용접 강도/품질을 갖는지 여부를 결정하기 위해서 미리 결정된 임 계값과 비교될 수 있다. 추가적으로 또는 대안적으로, 품질 모니터링 시스템은, 특정 용접이 예상된 프로세스를 따랐고/거나 미리 결정된 임계값 초과 또는 미만의 품질 특성의 어떤 측정값을 달성했는지 여부에 기반하여, 예 측된 용접 품질 메트릭 또는 측정값이 충분한지 여부를 나타내는 출력을 예측된 값과 미리 결정된 임계값의 비 교에 기반하여 생성할 수 있다. 도 1 및 도 2를 참조하면, 본 개시내용에 따른 용접 품질을 예측하기 위해 데이터 분석 및 기계 학습을 사용하 는 예시적인 초음파 용접기 시스템(10, 11)이 도시된다. 도 1에 도시된 초음파 용접기 시스템은 적어도 2개 의 금속 부품을 용접하도록 구성되는 한편, 도 2에 도시된 초음파 용접기 시스템은 적어도 2개의 플라스틱 부품을 용접하도록 구성된다. 용접될 적어도 2개의 부품은 함께 용접될 단지 2개의 부품, 또는 함께 용접될 3개 이상의 부품, 예를 들어, 와이어 묶음, 3개 이상의 부품의 스택, 또는 함께 용접되고 결합될 부품의 임의의 다른 적절한 그룹을 포함할 수 있다. 초음파 용접기 시스템(10, 11) 각각은, 초음파 변환기에 전력 을 제공하는 초음파 전력 공급 장치, 부스터, 및 초음파 혼(horn) 을 포함한다. 초음파 용접 분야 의 당업자에 의해 일반적으로 이해되는 바와 같이, 초음파 혼은 초음파 변환기 및 부스터로부터 피 공작물, 즉 함께 용접되는 부품들로 기계적 에너지를 전달하는 금속 막대이다. 초음파 혼은 일반적으로, 초 음파 변환기에 의해 생성되는 공진 주파수에서 1/2 파장 길이이다. 예를 들어, 20-60 kHz의 주파수에서 전 원로부터의 전기 에너지는 초음파 변환기에 의해 기계적 에너지로 변환된다. 초음파 변환기에서 변 환된 기계적 에너지는, 부스터 및 초음파 혼을 통해 함께 용접될 금속 부품들(도 1) 또는 플라스틱 부품들(도 2)과 같은 애플리케이션으로 전달된다. 부스터 및 초음파 혼은 기계적 에너지를 전달하 는 기능과 초음파 변환기로부터의 기계적 진동을 게인 팩터(gain factor)에 의해 변형하는 기능을 수행한다. 초음파 용접기 시스템(10, 11)은 초음파 용접기 시스템(10, 11)의 적용 가능한 구성요소에 결합된 입 력부 및 출력부를 갖는 제어기에 의해 각각 제어된다. 예를 들어, 전원는 제어기를 포함할 수 있거나, 제어 기는 전원와 별개의 디바이스일 수 있다. 용접 프로세스 후, 부품들(20, 30)은 용접부에 의해 함께 결 합된다. 혼의 팁 상에 발생되는 기계적 진동은 부품들(20, 30)을 함께 용접하는 작업을 수행하는 모션(motion)이다. 혼 팁은 티타늄이나 다른 고강도 경질 재료로 만들 수 있다. 함께 용접될 부품들(20, 30)은 모루(anvil) 상에 함께 배치되는 것과 같이, 혼 팁에 인접하게 배치된다. 혼 팁은 액추에이터에 의해 이동되어, 함께 용접될 부품들(20, 30) 중 상부 부품과 접촉된다. 초음파 혼은 용접될 부품들(20, 30)에 진동을 부여하는 방식으로 진동한다. 즉, 초음파 혼은 부품들(20, 30)의 서로에 대한 진동 압축/압축해제를 유발하여, 용접 계면에서 서로 인접하는 부품들(20, 30)의 표면이 가열되어, 결국 함께 용융되고 용접부를 형성한다. 도 1 및 도 2는 각각 예로서 초음파 용접기 시스템(10, 11)을 도시하지만, 본 개시내용은 다른 유형의 용접기 및 피공작물 처리 디바이스에 동일하게 적용 가능하다. 예를 들어, 초음파 용접기 이외에, 본 개시내용의 용접 품질을 예측하기 위해 분석을 사용하는 시스템 및 방법은 또한 레이저 용접 시스템, 진동/마찰 용접 시스템, 적 외선 용접 시스템, 적외선(IR) 예열 시스템과 결합된 진동 용접(청정 진동 기술이라고도 함), 스핀 용접 시스템 및/또는 핫 플레이트 용접 시스템에 적용 가능하다. 또한, 금속 용접기 및 플라스틱 용접기의 실시예가 도 1 및 도 2를 참조하여 위에서 논의되었지만, 본 개시내용은 다중 재료 용접기와 같은 다른 용접기, 및 기타 기계적 결합 프로세스에 동일하게 적용될 수 있다. 또한, 본 개시내용은 용접 예를 제공하지만, 본 개시내용은, 열 스 테이킹(thermal staking), 리벳팅 및/또는, 임의의 기타 기계적 결합 프로세스와 같은 다른 기계적 결합 프로세 스에 동일하게 적용 가능하여, 결합 프로세스의 품질이 본 개시내용에 따라 평가되고 예측될 수 있다. 초음파 용접기 및 기타 피공작물 처리 디바이스에 관한 추가 세부사항은, 2020년 7월 28일자로 발행된 발명의 명칭이 \"Dynamic Adjustment of Weld Parameter of an Ultrasonic Welder\"인 출원인의 공동으로 양도된 미국 특허 제 10,722,973호, 및 2020년 12월 15일자로 발행된 발명의 명칭이 \"Work Piece Processing Device with Servo- Elastic Actuator System with Compliance Elastic Member and Weight Compensation Elastic Member\"인 출원 인의 공동으로 양도된 미국 특허 번호 제10,864,608호에 포함되며, 이들 둘은 이들의 전체로 인용되어 포함된다. 도 1 및 도 2에 도시된 바와 같이, 초음파 용접기 시스템(10, 11)은 각각 품질 모니터링 시스템을 포함한다. 품질 모니터링 시스템은 품질 모니터링과 관련된 다양한 용접 파라미터를 수신한다. 예를 들어, 품질 모니터링 시스템은, 예를 들어, 전원에 의해 초음파 변환기에 제공되는 전기 에너지의 전류, 전압, 전력 및/또는 주파수를 나타내는 데이터를 포함하여, 제공되는 전기 에너지의 전기적 특성에 기반하여 초 음파 전원로부터 용접 파라미터를 수신할 수 있다. 추가적으로, 용접 파라미터는, 용접을 위해 제공되는 전 기 에너지의 시작 시간, 정지 시간, 또는 지속 시간과 같은, 전기 에너지가 전원에 의해 제공되는 시간의 양과 관련된 데이터를 포함할 수 있다. 추가적으로 또는 대안적으로, 품질 모니터링 시스템은 또한, 예를 들어, 혼의 이동 거리/깊이, 부품들(20, 30)에 대한 혼의 힘, 및/또는 혼의 속도 또는 하방 속력 (down speed)를 나타내는 데이터를 포함하는, 액추에이터에 의한 혼의 움직임의 특성에 기반하여 액추 에이터로부터 용접 파라미터를 수신할 수 있다. 추가적으로 또는 대안적으로, 액추에이터로부터의 용접 파라미터는 또한 용접부의 용접 붕괴 및/또는 용접 유지와 관련된 데이터를 포함할 수 있다. 추가적으로 또 는 대안적으로, 품질 모니터링 시스템은 또한 초음파 용접기 시스템(10, 11)에 포함된 하나 이상의 센서 로부터 용접 파라미터를 수신할 수 있다. 센서는, 예를 들어, 하나 이상의 온도 센서, 레이저 진동계, 위치 측정 센서, 스트레스/스트레인 센서, 충격 센서 및/또는 카메라를 포함할 수 있다. 온도 센서는 온도 데이터를 측정하고, 이를 품질 모니터링 시스템에 제공할 수 있다. 레이저 진동계는 진동 용접기 실시형태에서 초음파 스택의 진동 데이터, 또는 진동 용접기의 진동 데이터를 측정하고, 이를 제공할 수 있다. 위치 측정 센 서는 혼의 그리고/또는 용접되는 부품들(20, 30)의 위치 데이터를 제공할 수 있다. 응력/변형률 센서는 용 접되는 부품들(20, 30)의 응력/변형률 데이터를 제공할 수 있다. 충격 센서는 초음파 스택의 진동 데이터를 제 공할 수 있다. 카메라는 용접되는 부품들(20, 30)의 이미지 데이터를 제공할 수 있다. 품질 모니터링 시스템, 전력 공급 장치, 액추에이터, 및/또는 센서가 있다면, 각각은 품질 모 니터링 시스템과 유선 또는 무선 통신 연결을 통해 이러한 데이터를 통신하기 위한 충분한 통신 인터페이스 를 포함한다. 일부 실시형태에서, 품질 모니터링 시스템은 초음파 용접기 시스템(10, 11)과 동일한 위치에 위치된 품질 모니터링 컴퓨터를 포함할 수 있다. 이러한 경우에, 초음파 전원, 액추에이터, 및/또는 센서가 있 는 경우에, 이는 본 개시내용에 따라 처리를 위해 다양한 용접 파라미터 및 데이터를 품질 모니터링 컴퓨터에 전달할 수 있고, 품질 모니터링 컴퓨터는 품질 모니터링 컴퓨터의 사용자에게 출력을 제공하기 위해 컴퓨터 모 니터 및/또는 디스플레이 또는 터치스크린 디바이스와 같은 출력 디바이스에 연결될 수 있다. 다른 실시형태에 서, 품질 모니터링 컴퓨터는 용접기와 통합될 수 있다. 예를 들어, 품질 모니터링 컴퓨터는 초음파 전원 내 에 내장될 수 있고, 사용자에게 출력을 제공하기 위한 출력 디바이스에 연결될 수 있다. 다른 실시형태에서, 품 질 모니터링 시스템은 최종 사용자의 통합 생산 업무 플랫폼(MES: manufacturing enterprise system)과 통합될 수 있다. 다른 실시형태에서, 품질 모니터링 시스템은 초음파 용접기 시스템(10, 11)과 동일한 위치에 위치 된 품질 모니터링 클라이언트 컴퓨터, 및 초음파 용접기 시스템(10, 11)과 다른 위치에 원격으로 위치된 품질 모니터링 서버 컴퓨터를 포함할 수 있다. 이러한 경우, 품질 모니터링 클라이언트 컴퓨터는 본 개시내용에 따라, 초음파 전원, 액추에이터, 및/또는 센서(있는 경우)로부터 다양한 용접 파라미터 및 데이터 를 수신할 수 있고, 처리를 위해 다양한 용접 파라미터 및 데이터를 품질 모니터링 서버에 전달할 수 있다. 예 를 들어, 품질 모니터링 컴퓨터는, Microsoft Azure 클라우드 서비스, Amazon Web Services, 또는 Google 클라 우드 컴퓨팅 서비스를 활용하는 클라우드 환경과 같이, 초음파 용접기 시스템(10,11)의 위치 또는 시설로부터 원격인 클라우드 환경으로 구현될 수 있다. 다른 예를 들어, 품질 모니터링 컴퓨터/시스템은 Emerson Electric Co.로부터 이용 가능한 Plantweb쪠 디지털 에코시스템을 사용하여 구현될 수 있다. 도 3을 참조하면, 품질 모니터링 시스템의 품질 모니터링 컴퓨터/서버가 도시된다. 위에서 언급된 바 와 같이, 일부 실시형태에서, 품질 모니터링 컴퓨터/서버는 독립형 컴퓨터로서 기능할 수 있고, 초음파 용 접기 시스템(10, 11)과 동일한 위치 또는 시설에 위치될 수 있고, 이러한 경우에, 초음파 전원, 액추에이터 , 및/또는 센서 (있는 경우)로부터 다양한 용접 파라미터를 직접적으로 수신할 수 있다. 다른 실시형태 에서, 품질 모니터링 컴퓨터/서버는 서버로서 기능할 수 있고, 예를 들어, 클라우드 환경에서 또는 통합 생산 업무 플랫폼(MES)에서와 같이, 초음파 용접기 시스템(10, 11)으로부터 원격으로 위치될 수 있다. 이러한 경우에, 품질 모니터링 클라이언트는 초음파 전원, 액추에이터, 및/또는 센서(있는 경우)로부터 다 양한 용접 파라미터 및 데이터를 수신할 수 있고, 서버로서 기능하는 품질 모니터링 컴퓨터/서버에 다양한 용접 파라미터 및 데이터를 전달할 수 있다. 품질 모니터링 컴퓨터/서버는 중앙 처리 장치(CPU), 메모리, 네트워크 인터페이스, 휘발성 기억장치, 및 입력/출력 인터페이스를 포함할 수 있다. 메모리는 품질 모니터링 컴퓨터/서버 의 애플리케이션을 위한 그리고 오퍼레이팅 시스템(OS: operating system)를 위한 실행 가능한 코드를 저장한다. 메모리는 또한, 품질 모니터링 모듈에 대한 실행 가능한 품질 모니터링 코드, 훈련 모듈에 대한 훈련 코드, 데이터 분석 모듈에 대한 데이터 분석 코드, 및 품질 예측 모듈에 대한 품질 예측 코드를 저장하며, 이들은 아래에서 더 자세히 논의된다. OS는, 품질 모니터링 코드, 훈련 코드, 데이터 분석 코드, 및 품질 예측 코드를 포함하여, 품질 모니터링 컴퓨터/서버의 바 이너리 실행 파일을 실행하는 것, 및 하드웨어 리소스의 입력/출력을 조정하는 것을 핸들링한다. 품질 모니터링 컴퓨터/서버는 전용 하드웨어를 갖는 물리적 디바이스, 용접기와 통합된 디바이스, 및/또는 용접기에 내장 된 디바이스일 수 있다. 대안적으로, 품질 모니터링 컴퓨터/서버는 전용 하드웨어 리소스의 일부를 공유하 는 버추얼 머신(virtual machine)으로서 구현될 수 있다. 도 4를 참조하면, 본 개시내용에 따라 용접 품질을 평가하고 예측하기 위해 데이터 분석 및 기계 학습을 사용하 는 시스템 및 방법에 대한 방법론의 개요가 예시된다. 처음에, 아래에서 더 상세히 논의되는 바와 같이, 훈련 데이터는, 회귀 모델, 분류 모델, 및/또는 AI 신경망 모델과 같은 데이터 분석 모델을 개발하고 훈련 하기 위해 학습 또는 훈련 프로세스에서 사용된다. 데이터 분석 모델은, 예를 들어, 랜덤 포레스트모델(random forest model), 의사결정 트리 모델, 서포트 벡터(support vector) 회귀 모델, 및/또는 Catboost 또는 SGBoost와 같은 그래디언트 부스팅 회귀 모델을 포함할 수 있다. 예를 들어, 훈련 데이터는, 공지의 또는 실제의 용접 품질 파라미터와 관련하여 저장된 다양한 용접 파라미터 또는 그래프를 포함할 수 있다. 훈련 프로세스에서, 용접 파라미터는 입력된 용접 파라미터에 기반하여 하나 이상의 예측된 용접 품질 파라미터를 생 성하도록 데이터 분석 모델을 훈련시키기 위해서 사용된다. 다음으로, 예측된 용접 품질 파라미터는 연관 된 입력된 용접 파라미터에 대한 실제 용접 품질 파라미터와 비교되고, 데이터 분석 모델은 다음으로, 예 측된 용접 품질 파라미터(들)와 실제 용접 품질 파라미터(들) 간의 차이에 기반하여 조정, 수정 및/또는 튜닝될 수 있다. 학습 또는 훈련 프로세스는 다음으로, 훈련 데이터로부터 입력된 용접 파라미터의 다음 세 트에 대해 계속된다. 학습 또는 훈련 프로세스는 데이터 분석 모델이 입력된 용접 파라미터의 주어진 세트에 대한 실제 용접 품질 파라미터와 동일하거나, 미리 결정된 허용 오차 이내인 예측된 용접 품질 파라미터 를 일관되고 정확하게 생성할 수 있을 때까지 계속되고 반복된다. . 예를 들어, 학습 또는 훈련 프로세스 는, 데이터 분석 모델에 의한 품질 예측의 정확도가 미리 결정된 정확도 임계값, 예를 들어, 95% 정확도보 다 더 클 때까지 계속되고 반복될 수 있다. 대안적으로, 학습 또는 훈련 프로세스는 모든 훈련 데이터 가 활용될 때까지 계속되고 반복될 수 있다. 훈련 프로세스가 완료되면, 데이터 분석 모델은, 초음파 용접기 시스템(10, 11)과 같은 실제 용접기 시스템에 의해 수행되는 실제 용접에 대한 용접 품질 파라미터를 예 측하기 위해서, 실제 라이브(live) 용접 파라미터 데이터에 대한 예측 프로세스에서 사용될 수 있다. 도 4의 실시예에서, 예측 프로세스는 용접부의 예측된 박리 강도에 대응되는 용접 품질 파라미터를 생성하 기 위해 사용된다. 도 4에 예시된 바와 같이, 예측 프로세스에서, 예측된 박리 강도는, 이 경우, 12 뉴턴 또는 12 N인 박리 임계값과 비교된다. 예측된 박리 강도와 같은 예측된 용접 품질 파라미터 및/또는 비교의 결 과는 출력되고 품질 관리 프로세스에 전달될 수 있으며, 이로써, 미리 결정된 임계값 미만인 예측된 용접 품질 파라미터, 예를 들어 예측된 박리 강도는 추가 평가를 거치고/거나 폐기, 교체 또는 수리된다. 도 5를 참조하면, 훈련 모드의 품질 모니터링 모듈을 도시하는 블록도가 도시된다. 품질 모니터링 모듈 은 훈련 모듈, 데이터 분석 모듈, 및 품질 예측 모듈을 포함한다. 품질 모니터링 모듈 , 훈련 모듈, 데이터 분석 모듈, 및 품질 예측 모듈은, 도 3에 도시되고 위에서 논의된 바 와 같이 메모리에 저장된 품질 모니터링 코드, 훈련 코드, 데이터 분석 코드, 및 품질 예 측 코드를 실행하는 품질 모니터링 컴퓨터/서버에 의해 구현될 수 있다. 도 5에 도시된 바와 같이, 품질 모니터링 모듈은, 품질 모니터링 모듈 및 품질 모니터링 컴퓨터/서버에 액세스 가능한 컴 퓨터 판독가능 저장 매체로부터 훈련 데이터를 수신한다. 위에서 논의된 바와 같이, 훈련 데이터는 알려진 또는 실제 용접 품질 파라미터와 관련하여 저장된 다양한 용접 파라미터를 포함할 수 있다. 훈련 모드에 서, 품질 모니터링 모듈의 훈련 모듈은 알려진 실제 용접 품질 파라미터를 갖는 실제 용접에 대응되 는 저장된 용접 파라미터를 검색하고, 저장된 용접 파라미터를 데이터 분석 모듈에 입력하며, 이 데이터 분석 모듈은, 입력된 용접 파라미터에 기반하여 하나 이상의 예측된 용접 품질 파라미터를 생성하기 위해서 데 이터 분석 모델을 활용한다. 다음으로, 훈련 모듈은, 입력된 용접 파라미터와 연관되고 훈련 데이터 에 포함된, 연관된 입력 용접 파라미터에 대해 실제 용접 품질 파라미터와 예측된 용접 품질 파라미터를 비교한 다. 비교에 기반하여, 훈련 모듈은, 예측된 용접 품질 파라미터와 실제 용접 품질 파라미터 간의 차이에 기반하여 데이터 분석 모델을 조정, 수정 및 튜닝하도록 데이터 분석 모듈에 지시할 수 있다. 훈련 모듈는 다음으로, 훈련 데이터로부터 입력된 용접 파라미터의 다음 세트에 대해 계속된다. 품질 모니 터링 모듈 및 훈련 모듈은, 데이터 분석 모듈이 훈련 데이터로부터 입력된 용접 파라미터의 주 어진 세트에 대해 실제 용접 품질과 동일하거나 미리 결정된 허용 오차 내에 있는 예측된 용접 품질 파라미터를 일관되고 정확하게 생성할 때까지, 또는 품질 모니터링 모듈 및 훈련 모듈이 훈련 데이터 세트 의 추가 엔트리를 다 사용할 때까지, 훈련 모드에서 이러한 방식으로 동작을 계속한다. 예를 들어, 품질 모니터 링 모듈 및 훈련 모듈은, 데이터 분석 모듈에 의한 품질 예측의 정확도가, 95% 정확도와 같은, 미리 결정된 정확도 임계값보다 클 때까지 훈련 모드로 동작될 수 있다. 대안적으로, 품질 모니터링 모듈 및 훈련 모듈은, 모든 훈련 데이터가 활용될 때까지, 훈련 모드에서 동작을 계속할 수 있다. 이 시점 에서, 품질 모니터링 모듈은 훈련 모드로부터 품질 예측 모드로 스위칭될 수 있고, 초음파 용접기 시스템 (10, 11)과 같은 실제 용접기 시스템에 의해 수행되는 실제 용접에 대한 용접 품질 파라미터를 예측하기 위해서, 실제 라이브 용접 파라미터 데이터에 사용될 수 있다. 도 6을 참조하면, 훈련 프로세스를 위한 방법이 도시되고, 602에서 시작된다. 방법은 품질 모니터링 컴퓨터/서버 및, 예를 들어, 품질 모니터링 모듈의 훈련 모듈 및 데이터 분석 모듈에 의해 수행될 수 있다. 604에서, 훈련 모듈은 훈련 데이터로부터 용접 파라미터 데이터 및 실제 용접 품질파라미터 데이터를 검색한다. 606에서, 훈련 모듈은 용접 파라미터 데이터를 데이터 분석 모듈에 입 력하며, 이 데이터 분석 모듈은, 예측된 용접 품질 파라미터를 생성하기 위해서 용접 파라미터 데이터를 데이터 분석 모델에 입력한다. 608에서, 훈련 모듈은 예측된 용접 품질 파라미터를 실제 용접 품질 파라미터 와 비교하고, 610에서, 훈련 모듈은 비교에 기반하여 데이터 분석 모델을 조정하도록 데이터 분석 모듈 에 지시한다. 612에서, 훈련 모듈은, 프로세싱을 위해 훈련 데이터에서 임의의 추가 엔트리가 이용 가능한지 여부를 결정한다. 612에서, 훈련 데이터의 추가 엔트리가 이용 가능하지 않을 때, 방법 은 616에서 종료된다. 612에서, 훈련 데이터에서 추가적인 엔트리가 이용 가능할 때, 훈련 모듈은 614로 진행된다. 614에서, 훈련 모듈은 예측된 용접 품질 파라미터의 현재 정확도를 정확도 임계값과 비교 함으로써 훈련 모드에서 동작을 계속할지 여부를 결정한다. 예를 들어, 훈련 모듈은 현재 정확도를 미리 결정된 정확도 임계값, 예를 들어, 95% 정확도와 비교할 수 있다. 데이터 분석 모듈이 미리 결정된 정확도 임계값보다 더 큰 정확도로 예측된 용접 품질 파라미터를 생성할 때, 훈련 모듈은 614로 진행되고, 훈련 프로세스를 종료한다. 614에서, 현재 정확도가 미리 결정된 정확도 임계값보다 작을 때, 훈련 모듈은 604 로 루프백(loop back)되고, 훈련 데이터로부터 다음 세트의 데이터를 검색한다. 도 7을 참조하면, 품질 모니터링 모드의 품질 모니터링 모듈을 도시하는 블록도가 도시된다. 품질 모니터 링 모드에서, 품질 예측 모듈은, 초음파 용접기 시스템(10, 11)과 같은, 실제 용접기 시스템으로부터 용접 파라미터 입력 데이터를 수신한다. 위에서 상세히 논의된 바와 같이, 용접 파라미터 입력 데이터는, 초음파 전 원, 액추에이터, 및/또는 센서(들)(있는 경우)로부터 수신된 용접 파라미터 데이터를 포함할 수 있 다. 품질 예측 모듈은 다음으로, 수신된 용접 파라미터 입력 데이터를 데이터 분석 모듈에 입력하며, 이 데이터 분석 모듈은, 입력된 용접 파라미터 데이터에 기반하여 용접에 대한 예측된 용접 품질 파라미터를 생 성하기 위해서 수신된 용접 파라미터 입력 데이터를 데이터 분석 모델에 입력한다. 데이터 분석 모듈(50 4)은 예측된 용접 품질 파라미터를 품질 예측 모듈에 반환하며, 이 품질 예측 모듈은 다음으로, 예측된 용 접 품질 파라미터를 출력한다. 예측된 용접 품질 파라미터는 품질 모니터링 모듈 및/또는 별도의 품질 제 어 프로세스 또는 디바이스에 의해 수행되는 품질 제어 프로세스에서 미리 결정된 임계 품질과 비교될 수 있다. 예측된 용접 품질 파라미터가 미리 결정된 임계 품질보다 더 작을 때, 용접부 및/또는 연관된 제품은 추가 평가 를 거치고/거나, 폐기, 교체 또는 수리될 수 있다. 품질 모니터링 모드에서, 품질 모니터링 모듈은 고정된 알고리즘을 활용할 수 있으며, 이로써 데이터 분석 모듈 및 데이터 분석 모델은 훈련 프로세스가 종료될 때 고정되고, 품질 모니터링 모드에서 라이브 작동 중에는 더 이상 업데이트, 조정, 수정 및/또는 튜닝되지 않는다. 대안적으로, 품질 모니터링 모듈은 능동 학습 알고리즘을 활용할 수 있으며, 이로써 실제 용접부가 현장에서 테스트되고, 테스트 데이터가, 실제 용접 품질 파라미터를 품질 모니터링 모듈에 의해 출력된 예측된 용접 품질 파라미터와 비교하기 위해서 사용된다. 이러한 경우에, 품질 모니터링 모듈은 비교의 결과에 기반하여 데이터 분석 모델을 업데이트, 조정, 수정 및/또는 튜닝할 수 있어, 데이터 분석 모듈 및 품질 예측 모듈의 정확도가 라이브 동작 동안 개선될 수 있고, 시설의 현장에서의 실제 동작 및 용접 조건에 적응될 수 있다. 도 8을 참조하면, 품질 모니터링 프로세스를 위한 방법이 도시되고, 802에서 시작된다. 방법은 품질 모니터링 컴퓨터/서버 및, 예를 들어, 품질 모니터링 모듈의 품질 예측 모듈 및 데이터 분석 모 듈에 의해 수행될 수 있다. 804에서, 품질 예측 모듈은, 초음파 용접기 시스템(10, 11)과 같은, 실제 용접기 시스템으로부터 용접 파라미터 입력 데이터를 수신한다. 806에서, 품질 예측 모듈은 용접 파라미터 데이터를 데이터 분석 모듈에 입력하며, 이 데이터 분석 모듈은, 예측된 용접 품질 파라미터를 생성하기 위해서 용접 파라미터 데이터를 데이터 분석 모델에 입력한다. 808에서, 품질 예측 모듈은 데이터 분 석 모듈로부터 예측된 용접 품질 파라미터를 수신하고, 예측된 용접 품질 파라미터를 미리 결정된 품질 임 계값과 비교한다. 810에서, 품질 예측 모듈은, 예측된 용접 품질 파라미터, 및/또는, 예측된 용접 품질 파 라미터와 미리 결정된 품질 임계값 사이의 비교 결과를 나타내는 출력을 생성한다. 예를 들어, 예측된 용접 품 질 파라미터가 미리 결정된 임계 품질보다 더 작을 때, 용접부 및/또는 연관된 제품은 추가 평가를 거치고/거나, 폐기, 교체 또는 수리될 수 있다. 대안적으로, 일부 실시형태에서, 808에서의 비교는 생략될 수 있고, 품질 예측 모듈은 810에서 예측된 용접 품질 파라미터를 단순히 출력할 수 있다. 811에서, 품질 모 니터링 프로세스가 종료된다. 데이터 분석 알고리즘 본 개시내용의 품질 모니터링 시스템 및 방법은, 용접 프로세스 동안 결정, 생성 및/또는 감지되는 용접 파라미 터에 기반하여, 주어진 용접부에 대한 용접 품질을 예측하거나 추정하기 위해, 회귀, 분류 및/또는 AI 모델 및알고리즘을 포함하여, 데이터 분석 및 기계 학습을 활용한다. 위에서 논의된 바와 같이, 본 개시내용의 시스템 및 방법은, 회귀 및 분류 알고리즘 또는 모델과 같은 지도 학습 알고리즘 또는 모델, 및/또는 AI 신경망 알고리 즘 또는 모델과 같은 비지도 학습 알고리즘 또는 모델을 활용할 수 있다. 예를 들어, 본 개시내용의 시스템 및 방법에 의해 활용되는 데이터 분석 및 기계 학습 알고리즘 또는 모델은 의사결정 트리 알고리즘 또는 모델, 랜 덤 포레스트 알고리즘 또는 모델, K 최근접 이웃(KNN: K nearest neighbor) 알고리즘 또는 모델, 나이브 베이즈 알고리즘 또는 모델, 서포트 벡터 머신 알고리즘 또는 모델, 및/또는 AI 신경망 알고리즘 또는 모델을 포함할 수 있다. 일부 실시형태에서, 본 개시내용의 품질 모니터링 시스템 및 방법은, CatBoost 및/또는 SGBoost로 지 칭되는 의사결정 트리에 대한 그래디언트 부스팅 회귀 알고리즘과 같은, 의사결정 트리에 대한 그래디언트 부스 팅 회귀 알고리즘을 포함할 수 있다. 예를 들어, CatBoost 그래디언트 부스팅 회귀 알고리즘은, 오버피팅을 극 복하기 위한 순서가 정해진 부스팅의 피쳐(feature), 범주형 피쳐(categorical feature)에 대한 네이티브 핸들 링(native handling), 및 더 빠른 실행을 위해 무의식 트리(oblivious tree) 또는 대칭 트리를 사용하는 것을 포함한다. 예를 들어, XGBoost 그래디언트 부스팅 회귀 알고리즘은, 트리의 클레버 페널티화(clever penalization), 리프 노드의 비례 축소, Newton Boosting, 추가 무작의화(extra randomization) 파라미터, 단 일 분산 시스템 및 코어 외 계산(single, distributed systems and out-of-core computation)에 대한 구현의 피쳐를 포함한다. 일부 실시형태에서, 본 개시내용의 품질 모니터링 시스템 및 방법은, 앙상블 기계 학습 알고 리즘인 랜덤 의사결정 포레스트라고도 하는 랜덤 포레스트 회귀 알고리즘을 포함할 수 있다. 랜덤 포레스트 회 귀 알고리즘은, 훈련 프로세스 동안 다수의 의결정 트리를 구성하고, 클래스의 모드 또는 개별 트리의 민 (mean)/평균(average) 예측인 클래스를 출력함으로써 동작하는 앙상블 학습 방법을 포함한다. 다른 실시형태에서, 본 개시내용의 품질 모니터링 시스템 및 방법은, 용접 프로세스 동안 결정, 생성 및/또는 감지되는 용접 파라미터에 기반하여, 주어진 용접부에 대한 용접 품질을 예측하거나 추정하기 위해, 인공 신경 망의 사용을 포함할 수 있다. 특정 데이터 분석 알고리즘이 위에서 논의되었지만, 프로세스 동안 결정, 생성 및/또는 감지되는 입력된 파라미 터에 기반하여 용접 품질과 같은 파라미터를 예측하거나 추정하는 기능을 포함하는 임의의 다른 기계 학습(지도 /구조화 또는 비구조화/비지도) 알고리즘이 본 개시내용에 따라 사용될 수 있다. 또한, 매트릭스 프로파일링 어노말리(matrix profiling anomaly) 방법은 아래에서 더 자세히 논의되는 바와 같 이 어노말리에 대한 용접 그래프 데이터를 검색하기 위해서 사용할 수 있다. 용접 품질 파라미터 본 개시내용의 품질 모니터링 시스템 및 방법은 용접 프로세스 동안 결정, 생성 및/또는 감지되는 입력된 용접 파라미터에 기반하여 용접부의 용접 품질을 예측하거나 추정한다. 위에서 논의된 실시예에서 언급된 바와 같이, 본 개시내용의 품질 모니터링 시스템은, 박리 강도 및/또는 당김/인장 강도와 같은 용접 강도의 품질을 나타내 는 예측된 값을 생성할 수 있다. 특정 용접 품질 파라미터가 위의 실시예에서 논의되었지만, 용접 품질 평가를 위한 모든 방법론이 사용될 수 있다. 예를 들어, 본 개시내용의 품질 모니터링 시스템 및 방법은 다음 용접 품 질 파라미터들 중 어느 하나를 예측하거나 추정함으로써 용접 품질을 예측하거나 추정할 수 있다: 용접 씰의 무결성을 측정하기 위한 가스 누출 검출. 전자 장치에 전원을 공급하고 결과를 측정함으로써 매립된 전자 장치를 테스트하는 것. 예를 들어, 용접 프로세 스가 내부 전자 장치를 손상시키지 않도록 하기 위해 테일 램프가 점등될 수 있다. 인장 강도. 부품들을 분리하여 용접 강도를 측정하는 파괴적인 방법. 박리 강도. 용접부를 박리시키는 파괴적인 방법. 전선 접속(wire splicing)에서 더 빈번하게 사용됨. 박리 강도 는 종종 당김(인장) 강도와 다르다. 파열 또는 버스트(Burst) 강도. 용기가 버스트될 때까지 가압되는 파괴적 방법. 이것은 용접 강도의 메트릭이다. 임계 길이 측정. 이것은, 예를 들어, 다이, 피팅을 체크하는 도구, 자(ruler) 또는 레이저 측정 디바이스로 측 정될 수 있다. 측정은 전체 부품, 또는 용접 깊이와 같은 용접부의 일부 치수일 수 있다. 열 감지. 용접은 종종 재료 내에서 더 높은 국부적 온도를 초래한다. 열전대, IR 카메라, IR 온도계 또는 레이 저 온도계 빔/총이 용접 영역의 온도를 측정하기 위해서 사용될 수 있다.자동 광학 검사(AOI: Automatic Optical Inspection) / 비디오 이미지 처리. 고객은 기록 보관 및 품질 관리를 위해 용접부의 디지털 사진 또는 비디오를 촬영한다. 이것은 추적 가능성이 더 중요한 의료 산업에서 더 일반적 이다. 외관. 사람이나 기계에 의한 외관 검사(Visual inspection)는 종종 용접 품질을 체크하기 위해서 사용된다. 검 사관은 기포, 가닥(strand), 과잉 용접 재료(일명 \"플래시\"), 용접 틈(과소 용접), 균열, 응력선, 번 마크(burn mark) 및 기타 시각적 특징을 찾는다. 금속 용접에서, 고객은 특히 산화의 징후인 변색을 찾는다. 현미경 및 확 대상이 사용될 수 있다. 광학 3D 표면 캐닝(surface canning)과 같은 계측. Gom, Zeiss 및 Nikon과 같은 공급업체는 표면 치수를 결정 하기 위해 다양한 초점 또는 레이저를 사용하는 기계를 공급한다. 부품의 3D 스캔은 용접 전이나 후에 이상적인 부품이나 특정 부품과 어떻게 비교되는지 보여줄 수 있다. 잔류 내부 응력 측정. 용접 프로세스는 내부 부품 응력을 생성할 수 있으며, 이는 종종 열 어닐링(오븐에서)을 사용하여 완화된다. 낙하 테스트. 손상을 측정하기 위해 표준 테스트 방법에 따라 부품들이 낙하된다. 전기 저항 또는 전도도. 와이어들 및 스폿들의 금속 용접에 사용됨. 광 흡수. 플라스틱은 용접 후 투명하거나 불투명할 수 있고, 이는 관찰되거나 측정될 수 있다. X-레이 단층촬영. X-레이는 부품들 또는 조립체의 내부 구조를 이미지화하여 어노말리를 찾기 위해서 사용될 수 있다. 표면 프로파일링 또는 표면 거칠기. 용접부 근처 또는 용접부에서 멀리 떨어져 있는 부품의 표면 토폴로지 또는 거칠기의 측정. 프로파일로미터, 주사 터널링 현미경(STM: scanning tunneling microscope), 선형 가변 차동 변압기, 간섭 측정 프로파일러(interferometric profiler), 주사 프로브와 같은, 이러한 기준을 측정할 수 있는 많은 유형의 디바이스가 있다. 전단 강도 용접부에 전단력을 가하는 파괴적인 방법. 파쇄 저항, 압축 또는 변형. 조립체를 변형, 파단, 비산(shatter) 또는 붕괴시키기 위해 샘플 상의 압축 하중을 측정하는 파괴 테스트. 크리프(creep) 시험. 시간이 지남에 따라 응력 하의 부품의 변형을 결정하기 위해서 사용됨. 열적 시험. 시간 경과에 따른 주요 속성의 변화를 측정하기 위한 고온, 저온 또는 열적 사이클링. 습도 또는 염수 분무 테스트. 고객 제품을 가혹한 환경 조건에 노출시킴. 영의 계수 테스트. 재료에 대한 응력의 함수로서의 변형률의 변화율. 층간박리 강도 테스트. 박리 테스트와 유사하지만, 박막 도포물에 대한 것임. \"클라이밍 드럼(climbing drum)\" 이 사용될 수 있다. 경도 시험. 재료 또는 부품의 듀로미터(durometer) 측정. Rockwell 경도계와 같은 시험 장비가 사용될 수 있다. 밀폐성(일명 기밀성 또는 수밀성). 용접부 및 용기의 누출 여부가 테스트될 수 있다. 횡단면. 용접부 또는 부품을 절단하는 파괴적인 방법. 화학 분석. 용접된 부품들 및 조립체는 화학 성분에 대해서 테스트될 수 있다. 가스 크로마토그래피. 화학 조성을 결정하기 위해 아웃가싱(outgassing)을 측정함. 입자성 물질 측정. 먼지 또는 중량 측정(ppm(parts per million) 또는 부피당 입자 수(particles per volume)) - 클린룸, 공기 덕트, 미세유체에서 더 가능성이 높음. 피로. 부품의 수명이나 주기를 평가하기 위한 반복적인 동작. 밀도. 조립체의 부품의 부피당 무게 측정. X-레이 회절. X선이 샘플의 원소 입자에 부딪힌 후 어떻게 회절되는지 프로파일을 측정하기 위해서 재료에 X선 을 발사하는 것. 오염. 용접부에 특이 물질, 외래 재료 혼입 또는 과잉 재료가 있는지 검사(예: 치약 튜브 용접의 경우, 검사 프 로세스는 튜브 외부에 치약이 있는지 찾는 것이었다). 공진. 조립체의 부품의 공진 주파수를 찾기 위한 테스트(용접기 주파수 근처의 공진 주파수에서 진동하기 때문 에 부품을 재설계하는 고객이 종종 있다). 폐쇄 루프 정정 위에서 상세히 논의된 바와 같이, 본 개시내용의 품질 모니터링 시스템 및 방법은, 용접 프로세스 동안 결정, 생성 및/또는 감지되는 용접 파라미터에 기반하여, 주어진 용접부에 대한 용접 품질을 예측하거나 추정하기 위 해, 데이터 분석 및 기계 학습 알고리즘 및 모델을 활용한다. 용접 품질을 예측하거나 추정하는 것 외에도, 본 개시내용의 품질 모니터링 시스템 및 방법은, 후속 용접을 위한 용접 프로세스의 작동 특성을 조정하기 위해 용 접 프로세스에 대한 폐쇄 루프 정정을 수행하기 위한 시스템 및 방법을 포함할 수 있다. 예를 들어, 용접 품질 을 조정하고 증가시키기 위해, 본 개시내용의 품질 모니터링 시스템 및 방법은 전원에 의해 초음파 변환기 에 공급되는 전기 에너지를 조정하기 위한, 혼의 움직임과 혼에 의해 가해지는 힘을 조정하기 위한, 그 리고/또는 용접 프로세스의 다른 제어 가능한 측면을 조정하기 위한 폐루프 정정을 포함할 수 있다. 사례 연구 #1 데이터 세트는 플라스틱 i-빔 부품들에 대한 설정된 레시피를 사용하여 에너지 모드에서 실행되는 Branson GSX- E1 용접기의 200개 용접부에서 생성되었다. 측정된 변수는 최대 힘, 용접 붕괴, 용접 시간, 피크 전력 등을 포 함하였다. 용접 후 인장 강도는 도 9a 내지 도 9c, 도 10a 및 도 10b에 도시된 바와 같이 수행되고 기록되었다. 용접 품질의 정량적 측정인 인장 강도 값을 예측하기 위해 데이터에 대해 다음 모델이 실행되었다: 의사결정 트리 알고리즘 랜덤 포레스트 알고리즘 K-최근접 이웃 나이브 베이즈 알고리즘 서포트 벡터 머신 (SVM) 알고리즘 인공 신경망 알고리즘 결과는 다음과 같았다: 표 1 알고리즘/모델 모델 훈련 정확도 모델 검증 정확도 모델 테스트 정확도 의사결정 트리 97% 99% 96% 랜덤 포레스트 98% 98% 94% KNN 83% 86% 87% 나이브 베이즈 54% 67% 72% 서포트 벡터 머신 54% 67% 72% 인공 신경망 52% 69% 71% 사례 연구 #2 다른 데이터 세트는 Branson GMX-W1 와이어 스플라이서(wire splicer)로부터의 500개의 용접부로부터 생성되었 다. 다음 모델이 용접 품질을 예측하고 추정하기 위해서 데이터에 대해 실행되었다: 랜덤 포레스트, 의사결정 트리, 서포트 벡터 회귀 (SVM), XGBoost, Catboost, 뉴럴 네트워크. 결과는 다음과 같았다: 표 2 회귀 기술 정확도 랜덤 포레스트 97.34% 의사결정 트리 92.99%SVR 96.25% XGBoost 95.57% Catboost 97% 뉴럴 네트워크 97.34% 이러한 사례 연구는, 기존 전력 공급 장치 데이터에 대해 기계 학습을 사용하는 방법론이 금속 용접 및 플라스 틱 결합 제품을 모두 정확하게 예측하는 알고리즘을 개발할 수 있다는 결론을 내렸다. 이 결론은 다음 논문에"}
{"patent_id": "10-2022-0044580", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "요약되어 있는 바와 같이 현재 학계의 최첨단 전통적 사고방식에 반대되는 것이다: 문헌 [Balz, I., Abi Raad, E, Rosenthal E., et. Al. Process monitoring of ultrasonic metal welding battery tabs using external sensor data. Journal of Advanced Joining Processes Vol 1 (March 2020)]. 사례 연구 #3: 매트릭스 프로파일링 어노말리 본 개시내용에 따르면, 매트릭스 프로파일링 어노말리(matrix profiling anomaly) 방법은 아래에서 더 자세히 논의되는 바와 같이 어노말리에 대한 용접 그래프 데이터를 검색하기 위해서 사용할 수 있다. Matrix Profiling Anomalies라고 하는 방법이 용접 그래프 데이터에서 용접 어노말리를 검색하기 위해서 사용되 었다. 시각적 표현이 도 11에 도시된다. 이 방법에서, 파라미터 대 시간(이 경우, 용접 깊이 대 시간 및 전력 대 시간)의 그래프는 50개의 데이터 포인트 또는 50 ms 간격과 같은 더 작은 데이터 세트로 분할된다. 이들은 다음으로, 알려진 어노말리와 비교된다. 매트릭스 프로파일 그래프의 피크는 성능의 상당한 변화를 나타낸다. 도 12를 참조하면, 예시적인 초음파 용접기 시스템(10, 11)의 블록도가 도시되고, 상술된 바와 같이, 품질 모니 터링 시스템, 초음파 전력 공급 장치, 액추에이터, 및 하나 이상의 센서(있는 경우)를 포함한 다. 초음파 용접기 장치는 도 1 및 도 2를 참조하여 위에서 설명된 바와 같이, 예를 들어, 변환기, 부 스터, 및 혼(도 12에 미도시)을 포함할 수 있다. 위에서 설명된 바와 같이, 품질 모니터링 시스템 은, 회귀 및 분류 알고리즘 또는 모델과 같은 지도 학습 알고리즘 또는 모델, 또는 AI 신경망 알고리즘 또는 모 델과 같은 비지도 학습 알고리즘 또는 모델을 포함하여, 기계 학습 알고리즘 또는 모델, 및 데이터 분석을 사용 하는 데이터 분석 모듈을 포함할 수 있다. 품질 모니터링 시스템에 의해 사용되는 알고리즘, 예를 들 어 회귀 및 분류 알고리즘 또는 모델/AI 신경망 알고리즘 또는 모델은 도 12에서 904에 도시된다. 상술된 바와 같이, 품질 모니터링 시스템은, 예를 들어, 전원에 의해 초음파 변환기에 제공되는 전기 에너지의 전류, 전압, 전력 및/또는 주파수를 나타내는 데이터를 포함하여, 제공되는 전기 에너지의 전기적 특성과 같은 용접 파라미터 입력을 수신할 수 있다. 위에서 추가로 설명된 바와 같이, 품질 모니터링 시스템은, 용접을 위해 제공되는 전기 에너지의 시작 시간, 정지 시간, 또는 지속 시간과 같은, 전기 에너지가 전원에 의해 제공되는 시간의 양과 관련된 데이터를 포함하는 용접 파라미터 입력을 수신할 수 있다. 추가적으로 또는 대안 적으로, 품질 모니터링 시스템은 또한, 예를 들어, 혼의 이동 거리/깊이, 부품들(20, 30)에 대한 혼 의 힘, 및/또는 혼의 속도 또는 하방 속력(down speed)를 나타내는 데이터를 포함하는, 액추에이터(2 2)에 의한 혼의 움직임의 특성에 기반하여 액추에이터로부터 용접 파라미터를 수신할 수 있다. 추가적 으로 또는 대안적으로, 액추에이터로부터의 용접 파라미터는 또한 용접부의 용접 붕괴 및/또는 용접 유 지와 관련된 데이터를 포함할 수 있다. 추가적으로 또는 대안적으로, 품질 모니터링 시스템은 또한 초음파 용접기 시스템(10, 11)에 포함된 하나 이상의 센서로부터 용접 파라미터를 수신할 수 있다. 센서는, 예 를 들어, 하나 이상의 온도 센서, 레이저 진동계, 위치 측정 센서, 스트레스/스트레인 센서, 충격 센서 및/또는 카메라를 포함할 수 있다. 온도 센서는 온도 데이터를 측정하고, 이를 품질 모니터링 시스템에 제공할 수 있다. 레이저 진동계는 진동 용접기 실시형태에서 초음파 스택의 진동 데이터, 또는 진동 용접기의 진동 데이터 를 측정하고, 이를 제공할 수 있다. 위치 측정 센서는 혼의 그리고/또는 용접되는 부품들(20, 30)의 위치 데이터를 제공할 수 있다. 응력/변형률 센서는 용접되는 부품들(20, 30)의 응력/변형률 데이터를 제공할 수 있 다. 충격 센서는 초음파 스택의 진동 데이터를 제공할 수 있다. 카메라는 용접되는 부품들(20, 30)의 이미지 데 이터를 제공할 수 있다. 위에서 설명된 바와 같이, 품질 모니터링 시스템은, 예측된 용접 품질 파라미터를 생성하고/하거나, 예측된 용접 품질 파라미터와 미리 결정된 임계값의 비교 결과를 생성하기 위해, 용접 파라미 터 데이터를 수신하고, 도 12의 904에 도시된 데이터 분석 및 기계 학습 알고리즘 또는 모델을 활용한다. 생성 된 예측된 용접 품질 파라미터, 및/또는 예측된 용접 품질 파라미터와 미리 결정된 임계값의 비교 결과가 도 12 의 906에서 보여진다. 비교에 기반하여, 예를 들어, 품질 모니터링 시스템은 대응되는 용접부를 OK 또는 의 심되는 것으로 분류할 수 있다. 예를 들어, 용접 품질 파라미터가 용접부의 예상된 박리 강도에 대응되는 경우, 예측된 박리 강도가 미리 결정된 임계값보다 더 크면, 품질 모니터링 시스템은 대응되는 용접부를 OK로 분류할 수 있고, 예측된 박리 강도가 미리 결정된 임계값보다 더 작으면, 의심되는 것으로 분류할 수 있다. 품질 모니터링 시스템은 생성된 예측된 용접 품질 파라미터, 및/또는 예측된 용접 품질 파라미터의 비교 결과, 즉 OK 또는 의심스러운 것의 분류를 인간-기계 인터페이스(HMI: human-machine interface) 디스플레이에 출력할 수 있다. 예를 들어, HMI 디스플레이는, 용접부의 실제 예측된 당김 강도와 같은 실제 예측된 용접 품질 파라미터, 및/또는 용접 품질 파라미터와 미리 결정된 임계값의 비교의 결과를 디스플레이할 수 있다. 도 12의 904에 도시된 단일 데이터 분석 및 기계 학습 알고리즘 또는 모델을 활용하는 품질 모니터링 시스템 은 수신된 용접 파라미터 입력에 기반하여 예측된 용접 품질 파라미터를 결정할 수 있지만, 일부 경우에 품 질 모니터링 시스템은 총체적 어노말리를 포함하는 용접 파라미터 입력 데이터에 의해 방해를 받을 수 있다. 다시 말해, 일부 경우에, 단일 데이터 분석 및 기계 학습 알고리즘 또는 모델을 활용하는 품질 모니터링 시스템은, 용접 파라미터 입력 데이터가 정상 또는 평균 용접 파라미터 입력 데이터로부터 매우 멀리 떨어 져 있는 경우, 용접부의 용접 품질을 예측하는 데 어려움을 겪는다. 이러한 이유로, 도 13을 참조하여 도시된 다른 실시형태에서, 품질 모니터링 시스템(50')은, 용접 파라미터 데 이터가, 데이터 분석 및 기계 학습 알고리즘 또는 모델, 즉, 도 13의 904에 도시된 회귀 및 분류 알고리즘 또는 모델/AI 신경망 알고리즘 또는 모델에 입력되기 전에 용접 파라미터 입력 데이터의 추가 데이터 처리 레이어를 포함할 수 있다. 예를 들어, 품질 모니터링 시스템(50')은, 904에서 용접 파라미터 입력 데이터가 회귀 및 분류 알고리즘 또는 모델/AI 신경망 알고리즘 또는 모델에 입력되기 전에 용접 파라미터 입력 데이터를 처리하고 용 접 파라미터 입력 데이터의 그로스 어노말리에 대응되는 용접을 제거하기 위해서, 도 13의 910에 도시된 통계적 프로세스 제어(SPC: statistical process control) 알고리즘을 활용한다. 예를 들어, 품질 모니터링 시스템 (50')의 SPC 알고리즘은 용접 파라미터 입력 데이터의 각각의 데이터 값을 분석하고, 이를 용접 파라미터 입력 데이터의 SPC 중앙값에 비교하고, SPC 민(mean)으로부터 미리 결정된 수의 표준 편차보다 더 큰 용접 파라 미터 입력 데이터에 대응되는 용접부를 거부할 수 있다. 도 13에 도시된 바와 같이, SPC 데이터 분석에 기반하 여 의심되는 것으로서 거부된 용접부는 도 13의 912에서 보여진다. 거부된/의심되는 용접부를 나타내는 출력은 HMI 디스플레이에 출력된다. 용접 파라미터 입력 데이터의 데이터 값이 SPC 민(mean)으로부터 미리 정해진 수의 표준 편차 이내인 경우, 용접 파라미터 데이터는, 도 12와 관련하여 위에서 상세히 논의된 바와 같이, 처 리를 위해 도 13의 904에 도시된 회귀 및 분류 알고리즘 또는 모델/AI 신경망 알고리즘 또는 모델에 입력된다. 위에서 설명된 바와 같이, 예측된 용접 품질 파라미터, 및/또는 예측된 용접 품질 파라미터와 미리 결정된 임계 값의 비교 결과가 HMI 디스플레이 상에 디스플레이된다. 이러한 방식으로, 품질 모니터링 시스템(50')의 정확도는, 용접 파라미터 데이터가 회귀 및 분류 알고리즘 또는 모델/AI 신경망 알고리즘 또는 모델에 입력되기 전에 용접 파라미터 입력 데이터를 분석하고 그로스 어노 말리를 제거하기 위한 SPC 알고리즘 포함하여, 다수의 알고리즘의 사용에 의해 향상될 수 있다. 이러한 방 식으로, 용접 파라미터 데이터는 회귀 및 분류 알고리즘 또는 모델/AI 신경망 알고리즘 또는 모델에 의한 처리 전에 그로스 어노말리를 제거하기 위해 사전 처리되거나 필터링된다. 예를 들어, 그로스 어노말리를 갖는 용접 파라미터 입력 데이터를 생성하는 용접부는 다음의 결과일 수 있다: 과도한 수의 금속 호일의 층, 너무 적 은 수의 금속 호일의 층, 오일이 묻어 마찰이 감소하는 재료 샘플, 잘못된 금속 사용, 적절한 끝 부분 또는 커 버가 없는 용접부, 잘못된 영역의 용접부, 두 번의 단일 샘플(single sample twice), 산화된 재료, 혼 팁이 고 정구와 잘 정렬되지 않음, 잘못된 혼이나 모루가 사용됨, 및/또는 용접 파라미터 입력 데이터에서 그로스 어노 말리를 생성하는 임의의 다른 문제. 도 13은 2개의 데이터 처리 레이어, 즉 SPC 알고리즘 및 회귀 및 분류 알고리즘 또는 모델/AI 신경망 알고 리즘 또는 모델의 사용을 예시하지만, 데이터 처리의 추가 레이어가 또한, 시스템의 정확도를 더 높이기 위해서 사용될 수 있다. 예를 들어, 도 14를 참조하면, 3개 이상의 알고리즘을 활용하는 품질 모니터링 시스템 (50'')의 다른 실시형태가 도시된다. 품질 모니터링 시스템(50'')은, 품질 모니터링 시스템(50'')이 SPC 알고리 즘 이전에 상한 및 하한 알고리즘을 활용하는 것을 제외하고는, 품질 모니터링 시스템(50')과 유사하 다. 예를 들어, 상한 및 하한 알고리즘은 용접 파라미터 입력 데이터의 데이터 값을 상한 및 하한 임계값 과 비교하기 위해서 사용될 수 있다. 상한 및 하한을 벗어나는, 즉 상한 임계값보다 높고 하한 임계값보다 낮은 대응되는 용접 파라미터 입력 데이터를 갖는 용접부는 912에서 의심되는 것으로서 거부될 수 있다. 상한 및 하 한 임계값 내의 대응되는 용접 파라미터 입력 데이터를 갖는 임의의 용접부는 도 12에 도시된 품질 모니터링 시 스템(50')을 참조하여 위에서 설명된 것과 유사한 처리를 위한 SPC 알고리즘으로 전달될 수 있다. 상한 및 하한 은 미리 결정된 임계값일 수 있고/있거나, 사용자 조정 가능한 임계값일 수 있다. 예를 들어, 상한 및 하한은 품질 모니터링 시스템(50'')의 사용자에 의해서 조정될 수 있는 디폴트 임계값 설정으로 초기화될 수 있다.3개의 알고리즘이 도 13에 도시되지만, 임의의 수(N)의 알고리즘이 사용될 수 있다. 예를 들어, 회귀 및 분류 알고리즘 또는 모델 및/또는 AI 신경망 알고리즘 또는 모델의 추가 레이어가 SPC 알고리즘과 회귀 및 분류 알고리즘 또는 모델/AI 신경망 알고리즘 또는 모델 사이에 포함될 수 있다. 또한, 904에 도시된 회귀 및 분류 알고리즘 또는 모델/AI 신경망 알고리즘 또는 모델이 다수의 레이어로 나누어질 수 있다. 예를 들어, 데이 터 처리의 한 레이어는 회귀 및 분류 알고리즘 또는 모델을 사용하는 처리를 포함할 수 있는 한편, 별도의 레이 어는 AI 신경망 알고리즘 또는 모델을 사용한 처리를 포함할 수 있다. 예를 들어, 품질 모니터링 시스템은, 상 한 및 하한 알고리즘 레이어; SPC 알고리즘 레이어; 의사결정 트리 알고리즘, 랜덤 포레스트 알고리즘, KNN 알 고리즘, 나이브 베이즈 알고리즘 등을 활용하는 회귀 및 분류 레이어; 및 AI 신경망 알고리즘 레이어를 포함하 여, 4개의 데이터 처리 레이어를 활용할 수 있다. 이러한 방식으로, 다수의 레이어의 데이터 처리 알고리즘의 사용은 용접 파라미터 입력 데이터에서 그로스 어노 말리를 보다 효과적으로 제거하고 용접 품질을 보다 정확하게 예측할 수 있다. 이와 같이, 다수의 레이어의 데 이터 처리 알고리즘을 사용하면 시스템이 더욱 강건해지고 노이즈 및 비정상적인 데이터에 덜 영향을 받는다. 위의 실시형태에서와 같이, HMI 디스플레이는 예측된 용접 품질 파라미터, 및/또는 예측된 용접 품질 파라 미터와 미리 결정된 임계값의 비교의 결과를 나타내는 출력을 디스플레이할 수 있다. HMI 디스플레이는 또 한, 상한 및 하한 알고리즘 또는 SPC 알고리즘과 같은 특정 처리 알고리즘에 기반하여 특정 용접부가 의심되는 것으로서 거부되었다는 것을 나타내는 출력을 디스플레이할 수 있다. 사례 연구 #4: 단대단(End-to-End) 실시예 본 개시내용에 따르면, 약 1,000개의 프로세스 데이터 레코드의 또 다른 세트가 랩에서 생성되어 모델을 훈련시 키기 위해서 사용되었다. 본 사례 연구에서, 용접 기계로부터 나오는 초음파 프로세스는 특성상 매우 비선형적 이었고, 필드들 간 음의 상관관계를 가졌고, 고장 사례가 거의 없었다. 훈련 데이터는 누락된 속성, 속성 값, 노이즈 또는 아웃라이어에 대해 사전 처리되었고 모델링 전에 복제되었다. 또한, 데이터 불균형을 극복하기 위해 SMOTE(Synthetic Minority Oversampling Technique)가 적용되었다. SMOTE는 문헌 [\"SMOTE: Synthetic Minority Over-sampling Technique,\" Journal of Artificial Intelligence Research 16 321-357, published 06/02]에서 설명된다. 훈련 데이터는 다음 열을 포함했다: 사이클 수, 당기는 힘, 에너지, 트리거 압력, 압력, 진폭, 시간, 전력, 사 전 높이 및 높이. 모델링 및 훈련 프로세스 모델링 연습의 일환으로, 각각의 피쳐(열)에 대한 피쳐 중요도는 다음을 사용하여 계산되었다: 차원 축소 기계 학습 기술 주성분 분석(PCA: Principal Component Analysis) (문헌 [\"Multivariate Statistical Data Analysis-Principal Component Analysis (PCA),\" International Journal of Livestock Research, 7, 60- 78, ]에서 설명된 바와 같음); 다항식 피쳐(문헌 [Feature modeling using polynomial classifiers and stepwise regression,\" Neurocomputing, Volume 73, Issues 10-12, June 2010, pages 1752-1759]에서 설명된 바와 같음); 및 일반화된 판별 분석(GDA: Generalized Discriminant Analysis)(문헌 [\"Generalized Discriminant Analysis algorithm for feature reduction in Cyber Attack Detection,\" International Journal of Computer Science and Information Security (IJCSIS), Vol. 6, No. 1, 2009]에서 설명된 바와 같 음). 훈련 데이터는 70% 훈련 데이터 와 30% 테스트 데이터로 분할되었고, 각각의 하이퍼파라미터를 사용하여 비선형 데이터에 대한 5개의 알고리즘이 훈련되었다. 모델 가중치는 무작위로 초기화되었고, SGD(Stochastic Gradient Descent)(문헌 [\"An overview of gradient descent optimization algorithms, arXiv:1609.94747v2, June 15, 2017]에서 설명된 바와 같음)는 훈련의 일부로서 가중치를 조정하기 위해서 사용되었다. 모든 모델은 표에서 보여지는 바와 같이, 출력으로서 \"파워(N)\", \"용접 시간(sec)\", \"높이(mm)\" 및 \"사전 높이 (Pre-height)(mm)\" 및 \"당기는 힘(N)\" 피쳐를 가졌다: 표 3 사이클 카운트에너지 용접 시간(sec)파워(N)사전-높이 (mm)높이(mm)당기는 힘(N) 2 400 0.261580.0010.24 10.12 293 401 0.261600.0010.24 10.06 125.7 4 401 0.291460.0010.24 10.08 139.3 5 401 0.31460.0010.26 10.04 194 6 400 0.311400.0010.24 10.06 214.4 7 400 0.321360.0010.24 10.06 195.6 모델 평가 훈련된 모델은 30% 검증 데이터에 대해서 그리고 원본 데이터의 거의 모든 통계적 속성을 그대로 유지한 실제 데이터의 합성 버전으로 테스트 및 평가되었다. 랜덤 포레스트 및 CatBoost가 최상의 성능으로 귀결되었다. 모 델 평가에 대한 결과의 표는 다음과 같다: 표 4 회귀-분류기 임계값 = 200 N 임계값 = 175 N 임계값 = 150 N 랜덤 포레스트93.54 96.77 100 CatBoost 95.16 96.77 100 XGB 90.32 96.77 100 SVR 93.54 96.77 100 ANN 93.54 96.77 100 모델은 700개 행이 있는 데이터 세트에서 훈련되었다. 예측은 300개 행이 있는 데이터 세트를 기반으로 했다. 모델 예측 가장 성능이 좋은 모델이 배치 가능한(deployable) 분석 엔진 코드의 일부로 배치되도록 선택되었다. 모델로의 프로세스 데이터 흐름은 라이브 용접 세션 동안 모델이 모든 용접에 대한 프로세스 데이터를 수신하도 록 조직되며, 이 데이터는 다음으로, 결과적으로 가능한 \"당기는 힘\"을 예측하기 위해서 사용된다. 표 5 시간 전력 사전 높이 높이 예측된 당기는 힘임계값 양호/ 의심 0.441451 10.56 10.38 158 150 양호 0.73521 9.78 9.66 123 150 의심 예측된 당기는 힘은 다음으로, 용접 품질을 결정하는 최소 임계 당기는 힘과 비교된다. 예측된 당기는 힘이 임 계값보다 작으면, 용접 작업이 의심스러운 것으로 분류된다. 그렇지 않으면, 용접 작업이 양호로 분류된다. 사례 연구 #5: 자동화된 기계 학습 본 개시내용에 따르면, 자동화된 기계 학습 피쳐는 용접 분석 엔진의 사용자가 오프라인 모델링 및 훈련을 위해 생산 데이터를 송신하는 것을 회피하기 위해 온프레미스(on-premises)에서 자신의 데이터를 사용하여 자신의 모 델을 훈련시키는 것을 허용한다. 이 피쳐를 통해, 용접 분석 엔진은 주어진 훈련 데이터 세트에 대한 최적의 하이퍼파라미터 값과 함께 최상의 알고리즘 및/또는 알고리즘 스택을 자동으로 평가하고 선택할 수 있다. 이러한 방식으로, 현재의 자동화된 기계 학습 피쳐는 기계 학습 모델의 선택, 구성 및 파라미터화를 자동화하고, 유전 프로그래밍(Genetic Programming), 확률적 베이지안 최적화 및 앙상블 구성(Stochastic Bayesian optimization and ensemble construction)의 최근 이점을 활용한다. 시스템은 주어진 데이터 세트에 대한 최적의 하이퍼 파라미터 값을 사용하여 우수한 예측 모델 또는 앙상블을 구축하고 평가하기 위해 필요한 일반적인 작업 중 일부를 자동화한다. 예를 들어, 도 15에 도시된 바와 같이, 시스템은, 데이터 클리닝(cleaning), 피쳐 제거 및 선택, 모델 선택, 하이퍼파라미터 튜닝 , 및 모델 검증을 포함하여, 다음 작업을 자동화한다. 결과적으로, 자동화 시스템은 우수한 예측 모드/앙상블 모델을 위해 수행될 액션의 최상의 파이프라인을 구축한다. 자체 파라미터 값과 주어진 데이터 세트에 대한 다수의 사전 처리 단계를 사용하여 많은 기계 학습 알고리즘을 피팅하려고 시도함으로써, 시스템이 더 양호한 성능의 알고리즘 및 튜닝 값을 찾으려고 시도할 때, 파이프라인이 자주 업데이트된다. 시스템은, 교차 검증 스코어, 즉 모든 세대에 대한 정확도를 비교함으로써 최고 스코어 파이프라인을 찾기 위해 서 유전자 프로그래밍 알고리즘을 사용한다. 시스템은 모델 예측의 오류를 최소화하는 일련의 연산자를 찾기 위 해서 다양한 추정기, 피쳐 선택기, 피쳐 생성자, 알고리즘, 모델 및 파라미터를 검색한다. 다수의 세대에 대한 최상의 스코어는 아래에 제시된다(최상 파이프라인: LinearSVR(input_matrix, C=5.0, dual=False, epsilon=1.0, loss=squared_spsilon_insensitive, tol=0.1): 표 6 세대 1- 현재 최선의 내부 CV 스코어: -7.380055494232506 세대 2- 현재 최선의 내부 CV 스코어: -7.380055494232506 세대 3- 현재 최선의 내부 CV 스코어: -7.380055494232506 세대 4- 현재 최선의 내부 CV 스코어: -7.380055494232506 세대 5- 현재 최선의 내부 CV 스코어: -7.380055494232506 ... 세대 100- 현재 최선의 내부 CV 스코어: -7.290683170843617 다음 표는 두 개의 예측된 당기는 힘 열(column)을 포함한다: 미세 튜닝된 모델의 예측; 및 자동화된 기계 학습(AutoML)으로부터의 예측. 데이터는 자동차 배터리 용접 응용분야에 대응되고, 결과적인 테스트 정확 도는 97.8%였다. 표 7 용접 시간 (sec)사전- 높이 (mm)사후- 높이 (mm)피크 전력 (Watt s)붕괴 (mm)실제 당기 는 힘(N)예측된 당기는 힘절대 델타예측된 결과실제 결과 예측된 당기는 힘 (AutoML)절대 델타 (AutoML) 이러한 방식으로, 본 개시내용의 시스템 및 방법은, 테스트 데이터에 대해 상이한 알고리즘 및 모델을 사용하는 것, 용접 품질을 가장 정확하게 예측하는 알고리즘 또는 모델을 평가 및 선택하는 것, 및 다음으로 라이브 용접 파라미터 데이터를 사용하여 앞으로 용접 품질을 예측하기 위해 선택된 알고리즘 또는 모델 사용을 사용하는 것 을 포함한다. 또한, 품질 모니터링 시스템이 시간에 걸쳐 현장에서 사용되면, 용접기 하드웨어 및 기타 시스템 구성요소가 프 로세스 드리프트의 영향을 받을 수 있고, 품질 모니터링 시스템이 처음 설치된 때와 동일하게 작동되지 않을 수 있다. 이와 같이, 본 개시내용은 시간 경과에 따른 현장에서의 시스템 사용으로 인한 프로세스 드리프트를 처리 하도록 품질 모니터링 시스템에 의해 사용되는 선택된 알고리즘 또는 모델을 튜닝하고 체크하기 위해 품질 모니 터링 시스템을 업데이트하는 것을 포함한다. 예를 들어, 품질 모니터링 시스템은 새로운 테스트 데이터 세트에 사용될 수 있고, 품질 모니터링 시스템에 의해서 사용되는 내부 파라미터에 의해서 사용되는 알고리즘 또는 모 델은 프로세스 드리프트를 처리하고 용접 품질을 보다 정확하게 예측하기 위해 현장에서 다시 튜닝되고 다시 캘 리브레이션될 수 있다. 즉, 용접 파라미터 데이터를 용접 품질 데이터와 연관시키는 실제 용접 데이터에 기반하 는 튜닝 절차를 활용함으로써 용접기가 현장에서 작동된 후, 데이터 분석 모델이 다시 캘리브레이션될 수 있다. 전술된 설명은 본질적으로 단지 예시적이고, 본 개시내용, 이의 적용, 또는 사용을 제한하도록 결코 의도되지 않는다. 본 개시내용의 광범위한 교시는 다양한 형태로 구현될 수 있다. 따라서, 본 개시내용은 특정 실시예를 포함하지만, 본 개시내용의 진정한 범위는, 도면, 명세서, 및 다음 청구범위의 연구에 따라 다른 수정예가 명백 해질 것이기 때문에, 이렇게 제한되어서는 안 된다. 방법 내의 하나 이상의 단계가 본 개시내용의 원리를 변경 하지 않으면서 상이한 순서로(또는 동시에) 실행될 수 있다는 것이 이해되어야 한다. 또한, 각각의 실시형태가 특정 특징부를 갖는 것으로 위에서 설명되지만, 본 개시내용의 임의의 실시형태와 관련하여 설명된 이러한 특징 부들 중 임의의 하나 이상은, 그 조합이 명시적으로 설명되지는 않지만, 임의의 다른 실시형태에서 구현될 수있고/있거나, 이의 특징부와 조합될 수 있다. 다시 말해서, 설명된 실시형태들은 상호 배타적이지 않고, 하나 이상의 실시형태와 다른 실시형태의 순열은 본 개시내용의 범위 내에 있다. 요소들 사이(예: 모듈들 사이)의 공간적 및 기능적 관계는, \"연결된\", \"인게이지된\", \"인터페이스된\" 및 \"결합 된\"을 포함하여, 다양한 용어를 사용하여 설명된다. \"직접적인\" 것으로 명시적으로 설명되지 않는 한, 제1 요소 와 제2 요소 간의 관계가 위의 개시내용에서 설명될 때, 이 관계는 제1 요소와 제2 요소 사이에 다른 개재 요소 가 존재하지 않는 직접적인 관계, 및 제1 요소와 제2 요소 사이에 하나 이상의 개재 요소가 (공간적으로 또는 기능적으로) 존재하는 간접적인 관계를 또한 포함한다. 본원에서 사용되는 바와 같이, 구절 'A, B, 및 C 중 적어도 하나'는 비배타적 논리 OR을 사용하여, 논리(A OR B OR C)를 의미하는 것으로 해석되어야 한다. 예를 들어, 구절 'A, B 및 C 중 적어도 하나'는 (i) A 단독; (ii) B 단독; (iii) C 단독; (iv) A와 B 함께; (v) A와 C 함께; (vi) B와 C 함께; (vii) A, B 및 C 함께 중 어느 하나 를 포함하는 것으로 해석되어야 한다. 구절 'A, B 및 C 중 적어도 하나'는 \"A 중 적어도 하나, B 중 적어도 하 나 및 C 중 적어도 하나\"를 의미하는 것으로 해석되어서는 안 된다. 도면에서, 화살촉에 의해 표시되는 바와 같이, 화살표의 방향은 일반적으로 관심이 있는 정보(예: 데이터 또는 지침)의 흐름을 도면에 나타낸다. 예를 들어, 요소 A와 요소 B가 다양한 정보를 교환하지만 요소 A로부터 요소 B로 전송되는 정보가 예시와 관련이 있는 경우, 화살표는 요소 A로부터 요소 B로 가리킬 수 있다. 이 단방향 화 살표는 요소 B로부터 요소 A로 다른 정보가 전송되지 않는 것을 의미하지 않는다. 또한, 요소 A로부터 요소 B로 전송된 정보의 경우, 요소 B는 정보에 대한 요청, 또는 정보의 수신 확인을 요소 A에 보낼 수 있다. 용어 서브 세트는 반드시 적절한 서브세트를 필요로 하지 않는다. 다시 말해서, 제1 세트의 제1 서브세트는 제1 세트와 같 은 공간에 걸쳐 있을(동일할) 수 있다. 본원에서, 아래 정의를 포함하여, \"모듈\" 또는 \"컨트롤러\"라는 용어는 \"회로\"라는 용어로 대체될 수 있다. \"모 듈\"이라는 용어는, 코드를 실행하는 프로세서 하드웨어(공유, 전용, 또는 그룹), 및 프로세서 하드웨어에 의해 실행되는 코드를 저장하는 메모리 하드웨어(공유, 전용, 또는 그룹)를 지칭하거나, 이의 일부이거나, 이를 포함 할 수 있다. 모듈은 하나 이상의 인터페이스 회로를 포함할 수 있다. 일부 실시예에서, 인터페이스 회로(들)는, 근거리 통신 망(LAN) 또는 개인 무선 통신망(WPAN: wireless personal area network)에 연결되는 유선 또는 무선 인터페이 스를 구현할 수 있다. LAN의 예는 IEEE(Institute of Electrical and Electronics Engineers) 표준 802.11- 2016(WIFI 무선 네트워킹 표준으로도 알려짐 함) 및 IEEE 표준 802.3-2015(이더넷 유선 네트워킹 표준으로도 알 려짐)이다. WPAN의 예는 IEEE 표준 802.15.4(ZigBee Alliance의 ZIGBEE 표준을 포함함), 및 Bluetooth SIG(Special Interest Group)의 BLUETOOTH 무선 네트워킹 표준(Bluetooth SIG의 Core Specification 버전 3.0, 4.0, 4.1, 4.2, 5.0 및 5.1을 포함함)이다. 모듈은 인터페이스 회로(들)를 사용하여 다른 모듈과 통신할 수 있다. 모듈이 다른 모듈과 논리적으로 직접 통 신하는 것으로서 본 개시내용에서 묘사될 수 있지만, 다양한 구현예에서, 모듈은 실제로 통신 시스템을 통해 통 신할 수 있다. 통신 시스템은, 허브, 스위치, 라우터, 및 게이트웨이와 같은 물리적 그리고/또는 가상 네트워킹 장비를 포함한다. 일부 구현예에서, 통신 시스템은 인터넷과 같은 광역 네트워크(WAN)에 연결되거나 이를 트래 버스(traverse)한다. 예를 들어, 통신 시스템은, MPLS(Multiprotocol Label Switching) 및 VPN(가상 사설망)을 포함한 기술을 사용하여 인터넷 또는 점대점 임대 회선을 통해 서로 연결된 다수의 LAN을 포함할 수 있다. 다양한 구현예에서, 모듈의 기능은 통신 시스템을 통해 연결된 다수의 모듈들 사이에 분산될 수 있다. 예를 들 어, 다수의 모듈이 로드 밸런싱 시스템에 의해 분산된 동일한 기능을 구현할 수 있다. 추가 실시예에서, 모듈의 기능은 서버(원격 또는 클라우드로도 알려짐) 모듈과 클라이언트(또는 사용자) 모듈 간에 분할될 수 있다. 예를 들어, 클라이언트 모듈은, 클라이언트 디바이스에서 그리고 서버 모듈과 네트워크 통신으로 실행되는 네이티브 또는 웹 애플리케이션을 포함할 수 있다. 위에서 사용된 용어 코드는 소프트웨어, 펌웨어 및/또는 마이크로코드를 포함할 수 있고, 프로그램, 루틴, 기능, 클래스, 데이터 구조 및/또는 오브젝트(object)를 지칭할 수 있다. 공유 프로세서 하드웨어는 다수의 모 듈로부터의 일부 또는 전체 코드를 실행하는 단일 마이크로프로세서를 포함한다. 그룹 프로세서 하드웨어는, 추 가 마이크로프로세서와 함께 하나 이상의 모듈로부터의 일부 또는 전체 코드를 실행하는 마이크로프로세서를 포 함한다. 다수의 마이크로프로세서에 대한 참조는 개별 다이 상의 다수의 마이크로프로세서, 단일 다이 상의 다 수의 마이크로프로세서, 단일 마이크로프로세서의 다수의 코어, 단일 마이크로프로세서의 다수의 스레드, 또는위의 조합을 포함한다. 공유 메모리 하드웨어는 다수의 모듈로부터의 일부 또는 전체 코드를 저장하는 단일 메모리 디바이스를 포함한 다. 그룹 메모리 하드웨어는, 다른 메모리 디바이스와 결합하여, 하나 이상의 모듈로부터의 일부 또는 전체 코 드를 저장하는 메모리 디바이스를 포함한다. 메모리 하드웨어라는 용어는 컴퓨터 판독 가능 매체라는 용어의 서브세트이다. 본원에서 사용되는 컴퓨터 판독 가능 매체라는 용어는 매체를 통해 전파되는(예를 들어, 반송파에서) 일시적인 전기 또는 전자기 신호를 포함하 지 않고; 따라서, 컴퓨터 판독 가능 매체라는 용어는 유형적이고 비일시적인 것으로 간주된다. 비일시적 컴퓨터 판독 가능 매체의 비제한적인 예는 비휘발성 메모리 디바이스(예: 플래시 메모리 디바이스, 소거 가능한 프로그 램 가능 읽기 전용 메모리 디바이스, 또는 마스크 읽기 전용 메모리 디바이스), 휘발성 메모리 디바이스(예: 정 적 랜덤 액세스 메모리 디바이스 또는 동적 랜덤 액세스 메모리 디바이스), 자기 저장 매체(예: 아날로그 또는 디지털 자기 테이프 또는 하드 디스크 드라이브) 및 광학 저장 매체(예: CD, DVD 또는 Blu-ray 디스크)이다. 본원에서 설명된 장치 및 방법은 컴퓨터 프로그램으로 구현된 하나 이상의 특정 기능을 실행하도록 범용 컴퓨터 를 구성함으로써 생성된 특수 목적 컴퓨터에 의해 부분적으로 또는 전체적으로 구현될 수 있다. 위에서 설명된 기능적 블록 및 순서도 요소는 소프트웨어 사양으로서 역할을 하며, 이 사양은 숙련된 기술자나 프로그래머의 일상적인 작업에 의해 컴퓨터 프로그램으로 변형될 수 있다. 컴퓨터 프로그램은 적어도 하나의 비일시적 컴퓨터 판독 가능 매체에 저장된 프로세서 실행 가능 명령어를 포함 한다. 컴퓨터 프로그램은 또한, 저장된 데이터를 포함하거나 이에 의존할 수 있다. 컴퓨터 프로그램은 특수 목 적 컴퓨터의 하드웨어와 상호 작용하는 바이오스(BIOS: Basic Input/Output System), 특수 목적 컴퓨터의 특정 디바이스와 상호 작용하는 디바이스 드라이버, 하나 이상의 운영 체제, 사용자 애플리케이션, 백그라운드 서비 스, 백그라운드 애플리케이션 등을 포함할 수 있다. 컴퓨터 프로그램은 (i) HTML(하이퍼텍스트 마크업 언어), XML(확장 가능한 마크업 언어) 또는 JSON(JavaScript Object Notation)과 같이, 파싱될 설명 텍스트(descriptive text), (ii) 어셈블리 코드, (iii) 컴파일러에 의 해 소스 코드로부터 생성된 목적 코드, (iv) 인터프리터에 의한 실행을 위한 소스 코드, (v) JIT 컴파일러에 의 한 컴파일 및 실행을 위한 소스 코드 등을 포함할 수 있다. 단지 예로서, 소스 코드는, C, C++, C#, Objective C, Swift, Haskell, Go, SQL, R, Lisp, Java®, Fortran, Perl, Pascal, Curl, OCaml, JavaScript®, HTML5 (Hypertext Markup Language 5th revision), Ada, ASP (Active Server Pages), PHP (PHP: Hypertext Preprocessor), Scala, Eiffel, Smalltalk, Erlang, Ruby, Flash®, Visual Basic®, Lua, MATLAB, SIMULINK, 및 Python®를 포함하는 언어로부터의 신택스를 사용하여 작성될 수 있다. 예시적인 실시형태는, 본 개시내용이 철저하고, 범위를 당업자에게 충분하게 전달할 수 있도록 제공된다. 본 개 시내용의 실시형태에 대한 완전한 이해를 제공하기 위해, 특정 구성요소, 디바이스 및 방법의 예와 같은 다수의 특정 세부사항이 제시된다. 특정 세부사항이 채용될 필요가 없다는 것, 예시적인 실시형태가 많은 상이한 형태 로 구현될 수 있다는 것, 및 어느 것도 본 개시내용의 범위를 제한하는 것으로 해석되어서는 안 된다는 것이 당 업자에게 명백할 것이다. 일부 예시적인 실시형태에서, 공지된 프로세스, 공지된 디바이스 구조체 및 공지된 기 술은 상세하게 설명되지 않는다. 본원에서 사용된 용어는 단지 특정한 예시적 실시형태를 설명하기 위한 것이고, 한정하도록 의도되지 않는다. 단수 형태 \"일(및 하나)\" 및 \"그(및 이)\"는, 본원에서 사용될 때, 문맥이 명확하게 다르게 나타내지 않는다면, 또한 복수 형태를 포함하도록 의도될 수 있다. 용어 \"포함하다\", \"포함하는\", \"갖는\" 및 \"구비하는\"은 포함적이 고, 따라서 명시되는 특징부, 정수, 단계, 동작, 요소, 및/또는 구성요소의 존재를 특정하나, 하나 이상의 다른 특징부, 정수, 단계, 동작, 요소, 구성요소 및/또는 이들의 그룹의 존재 또는 추가를 배재하지 않는다. 본원에 설명된 방법 단계, 프로세스 및 동작은, 수행의 순서로서 구체적으로 식별되지 않는 한, 논의되거나 예시된 특 정 순서로의 수행을 반드시 필요로 하는 것으로서 해석되어서는 안 된다. 추가적 또는 대안적 단계가 채용될 수 있다는 것이 또한 이해될 것이다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9a 도면9b 도면9c 도면10a 도면10b 도면11 도면12 도면13 도면14 도면15"}
{"patent_id": "10-2022-0044580", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본원에 설명된 도면은 모든 가능한 구현예가 아니라 선택된 실시형태의 단지 예시를 위한 것이며, 본 개시내용 의 범위를 제한하도록 의도되지 않는다. 도 1은 본 개시내용에 따른 용접기 및 품질 모니터링 시스템의 블록도이다. 도 2는 본 개시내용에 따른 다른 용접기 및 품질 모니터링 시스템의 블록도이다. 도 3은 본 개시내용에 따른 품질 모니터링 컴퓨터/서버의 블록도이다. 도 4는 본 개시내용에 따른 품질 모니터링 방법의 흐름도이다. 도 5는 본 개시내용에 따른 훈련 모드의 품질 모니터링 모듈의 블록도이다. 도 6은 본 개시내용에 따른 품질 모니터링 시스템을 위한 훈련 프로세스의 흐름도이다. 도 7은 본 개시내용에 따른 품질 모니터링 모드에서의 품질 모니터링 모듈의 블록도이다. 도 8은 본 개시내용에 따른 품질 모니터링 방법의 흐름도이다. 도 9a 내지 도 9c는 본 개시내용의 사례 연구로부터의 데이터의 그래프를 예시한다. 도 10a 및 도 10b는 본 개시내용의 사례 연구로부터의 데이터의 그래프를 예시한다. 도 11은 본 개시내용의 사례 연구로부터의 데이터의 그래프를 예시한다. 도 12는 본 개시내용에 따른, 회귀 및 분류 알고리즘 또는 모델/AI 신경망 알고리즘 또는 모델을 사용하는 품질 모니터링 시스템의 블록도이다. 도 13은 본 개시내용에 따른, 통계적 프로세스 제어 알고리즘, 및 회귀 및 분류 알고리즘 또는 모델/AI 신경망 알고리즘 또는 모델을 사용하는 품질 모니터링 시스템의 블록도이다.도 14는 본 개시내용에 따른, 상한 및 하한, 통계적 프로세스 제어 알고리즘, 및 회귀 및 분류 알고리즘 또는 모델/AI 신경망 알고리즘 또는 모델을 사용하는 품질 모니터링 시스템의 블록도이다. 도 15는 본 개시내용에 따른, 기계 학습으로 자동화되는 공통 작업을 나타내는 흐름도이다. 대응되는 참조 번호들은 도면의 여러 개의 도를 통해 대응되는 부분들을 나타낸다."}
