{"patent_id": "10-2023-0016893", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0124082", "출원번호": "10-2023-0016893", "발명의 명칭": "지능형 반사 표면의 배치 위치 선정 방법 및 장치", "출원인": "한양대학교 에리카산학협력단", "발명자": "전상운"}}
{"patent_id": "10-2023-0016893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "실내 공간의 기지국과 벽면 사이에 위치하는 장애물에 의한, 음영 지역을 결정하는 단계;상기 벽면의 전체 영역 중, 상기 음영 지역을 제외한 영역에서, 지능형 반사 표면에 대한 적어도 하나의 후보배치 위치를 선정하는 단계; 및상기 후보 배치 위치 중에서, 상기 기지국의 커버리지 영역의 크기가 최대가 되는 후보 배치 위치를, 상기 지능형 반사 표면의 배치 위치로 결정하는 단계를 포함하는 지능형 반사 표면의 배치 위치 선정 방법."}
{"patent_id": "10-2023-0016893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,상기 음영 지역을 결정하는 단계는상기 기지국과 상기 벽면 사이에서, 상기 장애물에 대한 한쌍의 가상 접선을 생성하여 상기 음영 지역을 결정하는지능형 반사 표면의 배치 위치 선정 방법."}
{"patent_id": "10-2023-0016893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2항에 있어서,상기 음영 지역을 결정하는 단계는상기 음영 지역이 최대가 되는 상기 가상 접선을 생성하는지능형 반사 표면의 배치 위치 선정 방법."}
{"patent_id": "10-2023-0016893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 2항에 있어서,상기 후보 배치 위치를 선정하는 단계는상기 음영 지역을 제외한 영역에서, 상기 가상 접선과 상기 벽면의 교차점을 상기 후보 배치 위치로 선정하는지능형 반사 표면의 배치 위치 선정 방법."}
{"patent_id": "10-2023-0016893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4항에 있어서,상기 지능형 반사 표면의 배치 위치는상기 지능형 반사 표면의 일단에 대한 배치 위치이며,상기 지능형 반사 표면의 타단은공개특허 10-2024-0124082-3-상기 음영 지역을 제외한 영역에 위치하는지능형 반사 표면의 배치 위치 선정 방법."}
{"patent_id": "10-2023-0016893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1항에 있어서,상기 기지국의 커버리지 영역의 크기가 최대가 되는 후보 배치 위치를, 상기 지능형 반사 표면의 배치 위치로결정하는 단계는상기 장애물에 대한 특징 정보, 상기 기지국의 위치 정보 및 상기 후보 배치 위치를 미리 학습된 인공 신경망에입력하여, 상기 기지국의 커버리지 영역의 크기가 최대가 되는 후보 배치 위치를 결정하는지능형 반사 표면의 배치 위치 선정 방법."}
{"patent_id": "10-2023-0016893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6항에 있어서,상기 특징 정보는 상기 장애물의 형상이 원형인 경우, 상기 장애물의 위치 및 반경 정보를 포함하는지능형 반사 표면의 배치 위치 선정 방법."}
{"patent_id": "10-2023-0016893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 6항에 있어서,상기 특징 정보는 상기 장애물의 형상이 사각형인 경우, 상기 장애물의 위치, 길이 및 각도 정보를 포함하는지능형 반사 표면의 배치 위치 선정 방법."}
{"patent_id": "10-2023-0016893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8항에 있어서,상기 장애물의 각도 정보는상기 장애물의 길이 방향과 상기 실내 공간의 기준 벽면 사이의 각도에 대한 정보인지능형 반사 표면의 배치 위치 선정 방법."}
{"patent_id": "10-2023-0016893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "메모리; 및상기 메모리와 전기적으로 연결된 적어도 하나의 프로세서를 포함하며,상기 프로세서는실내 공간의 기지국과 벽면 사이에 위치하는 장애물에 의한, 음영 지역을 결정하고,상기 벽면의 전체 영역 중, 상기 음영 지역을 제외한 영역에서, 지능형 반사 표면에 대한 적어도 하나의 후보공개특허 10-2024-0124082-4-배치 위치를 선정하며,상기 후보 배치 위치 중에서, 상기 기지국의 커버리지 영역의 크기가 최대가 되는 후보 배치 위치를, 상기 지능형 반사 표면의 배치 위치로 결정하는 지능형 반사 표면의 배치 위치 선정 장치."}
{"patent_id": "10-2023-0016893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "실내 공간의 구조 정보, 상기 실내 공간에 포함된 기지국의 위치 정보 및 상기 실내 공간에 포함된 장애물의 특징 정보를 입력받는 단계;상기 구조 정보, 위치 정보 및 특징 정보를 이용하여, 상기 실내 공간의 벽면과 상기 기지국 사이에 위치하는상기 장애물에 의한, 음영 지역을 결정하는 단계;상기 벽면의 전체 영역 중, 상기 음영 지역을 제외한 영역에서, 지능형 반사 표면에 대한 적어도 하나의 후보배치 위치를 선정하는 단계; 및상기 후보 배치 위치 중에서, 상기 기지국의 커버리지 영역의 크기가 최대가 되는 후보 배치 위치를, 상기 지능형 반사 표면의 배치 위치로 결정하는 단계를 포함하는 지능형 반사 표면의 배치 위치 선정 방법."}
{"patent_id": "10-2023-0016893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11항에 있어서,상기 특징 정보는상기 장애물의 형상이 원형인 경우, 상기 장애물의 위치 및 반경 정보를 포함하는지능형 반사 표면의 배치 위치 선정 방법."}
{"patent_id": "10-2023-0016893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 11항에 있어서,상기 특징 정보는 상기 장애물의 형상이 사각형인 경우, 상기 장애물의 위치, 길이 및 각도 정보를 포함하는지능형 반사 표면의 배치 위치 선정 방법."}
{"patent_id": "10-2023-0016893", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "기지국의 커버리지가 최대가 될 수 있는, 지능형 반사 표면의 최적 위치를 선정하는 방법 및 장치가 개시된다. 개시된 지능형 반사 표면의 배치 위치 선정 방법은 실내 공간의 기지국과 벽면 사이에 위치하는 장애물에 의한, 음영 지역을 결정하는 단계; 상기 벽면의 전체 영역 중, 상기 음영 지역을 제외한 영역에서, 지능형 반사 표면에 대한 적어도 하나의 후보 배치 위치를 선정하는 단계; 및 상기 후보 배치 위치 중에서, 상기 기지국의 커버리지 영역의 크기가 최대가 되는 후보 배치 위치를, 상기 지능형 반사 표면의 배치 위치로 결정하는 단계를 포함한다."}
{"patent_id": "10-2023-0016893", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 지능형 반사 표면의 배치 위치 선정 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2023-0016893", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "종래의 다중안테나 빔포밍 기법은 초고주파 통신 대역의 장애물에 의한 전파 차단 특성으로 인하여, 안정적인 통신 채널의 확보에 한계가 있다. 특히 다양한 장애물이 존재하는 실내 환경의 경우, LoS(Line-of-Sight) 채널 형성이 어렵기 때문에, 5G/6G 초고주파 통신 시스템의 성능 보장이 쉽지 않다. 이러한 한계를 극복하기 위하여 최근 지능형 반사 표면(RIS: Reconfigurable Intelligent Surface)을 활용한 빔포밍 기법들이 개발되고 있다. 지능형 반사 표면은 다이오드, 저항, 인덕터, 캐패시터와 다수의 수동소자로 이루어진 형태로, 각 수동소자는 자신에게 반사되는 전자기파의 위상을 독립적으로 바꿀 수 있는 능력을 가지고 있으며, 이러한 특성을 이용하여 지능형 반사 표면은 무선 통신 환경 채널을 유리하게 바꿀 수 있다. 또한, 지능형 반사 표면은 직접 신호를 송 출하지 않고 수동 소자를 이용하므로, 전력 소모량과 가격면에서 굉장한 이점을 가지고 있으며, 이러한 특성은 기존 기술의 한계점을 뛰어넘을 가능성을 가지고 있다. 장애물로 인해 다중 경로 손실, 침투 손실 및 신호 차단이 발생하는 밀리미터파 또는 테라헤르츠 주파수 대역에 서, 지능형 반사 표면을 지원하는 시스템의 전체 성능을 개선하려면, 지능형 반사 표면의 배치 위치를 최적화하 는 것이 중요하다. 관련 선행문헌으로 특허 문헌인 대한민국 공개특허 제2022-0156599호, 대한민국 등록특허 제10-2429714호, 제 10-2330915호, 및 비특허 문헌인 \"인공 지능형 반사 표면(AIRS: Artificial Intelligent Reflecting Surface) 연구, 정민채, 한국통신학회, 2021\"가 있다."}
{"patent_id": "10-2023-0016893", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 기지국의 커버리지가 최대가 될 수 있는, 지능형 반사 표면의 최적 위치를 선정하는 방법 및 장치를 제공하기 위한 것이다."}
{"patent_id": "10-2023-0016893", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 목적을 달성하기 위한 본 발명의 일실시예에 따르면, 실내 공간의 기지국과 벽면 사이에 위치하는 장애 물에 의한, 음영 지역을 결정하는 단계; 상기 벽면의 전체 영역 중, 상기 음영 지역을 제외한 영역에서, 지능형 반사 표면에 대한 적어도 하나의 후보 배치 위치를 선정하는 단계; 및 상기 후보 배치 위치 중에서, 상기 기지 국의 커버리지 영역의 크기가 최대가 되는 후보 배치 위치를, 상기 지능형 반사 표면의 배치 위치로 결정하는 단계를 포함하는 지능형 반사 표면의 배치 위치 선정 방법이 제공된다. 또한 상기한 목적을 달성하기 위한 본 발명의 다른 실시예에 따르면, 상기 메모리와 전기적으로 연결된 적어도 하나의 프로세서를 포함하며, 상기 프로세서는 실내 공간의 기지국과 벽면 사이에 위치하는 장애물에 의한, 음 영 지역을 결정하고, 상기 벽면의 전체 영역 중, 상기 음영 지역을 제외한 영역에서, 지능형 반사 표면에 대한 적어도 하나의 후보 배치 위치를 선정하며, 상기 후보 배치 위치 중에서, 상기 기지국의 커버리지 영역의 크기 가 최대가 되는 후보 배치 위치를, 상기 지능형 반사 표면의 배치 위치로 결정하는 지능형 반사 표면의 배치 위 치 선정 장치가 제공된다. 또한 상기한 목적을 달성하기 위한 본 발명의 또 다른 실시예에 따르면, 실내 공간의 구조 정보, 상기 실내 공 간에 포함된 기지국의 위치 정보 및 상기 실내 공간에 포함된 장애물의 특징 정보를 입력받는 단계; 상기 구조 정보, 위치 정보 및 특징 정보를 이용하여, 상기 실내 공간의 벽면과 상기 기지국 사이에 위치하는 상기 장애물 에 의한, 음영 지역을 결정하는 단계; 상기 벽면의 전체 영역 중, 상기 음영 지역을 제외한 영역에서, 지능형 반사 표면에 대한 적어도 하나의 후보 배치 위치를 선정하는 단계; 및 상기 후보 배치 위치 중에서, 상기 기지 국의 커버리지 영역의 크기가 최대가 되는 후보 배치 위치를, 상기 지능형 반사 표면의 배치 위치로 결정하는 단계를 포함하는 지능형 반사 표면의 배치 위치 선정 방법이 제공된다."}
{"patent_id": "10-2023-0016893", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일실시예에 따르면, 기지국의 커버리지 영역의 크기가 최대가 될 수 있는, 지능형 반사 표면의 최적 위치가 선정될 수 있다. 또한 본 발명의 일실시예에 따르면, 지능형 반사 표면의 최적 위치 선정에 필요한 계산의 복잡도와 비용이 감소 될 수 있다."}
{"patent_id": "10-2023-0016893", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변경을 가할 수 있고 여러 가지 실시예를 가질 수 있는 바, 특정 실시예들을 도면에 예시하고 상세한 설명에 상세하게 설명하고자 한다. 그러나, 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어 야 한다. 각 도면을 설명하면서 유사한 참조부호를 유사한 구성요소에 대해 사용하였다. 지능형 반사 표면을 이용하여, 실내 공간에서 기지국의 커버리지 영역을 최대화하기 위해서는, 다양한 후보 위 치에 지능형 반사 표면을 배치한 후, 커버리지 영역을 계산하는 과정이 필요하다. 이러한 방식으로 지능형 반사 표면의 최적 위치를 결정할 경우, 계산에 소요되는 비용이 증가하고 계산 복잡도도 증가할 수 밖에 없다. 이에 본 발명은 계산 복잡도와 비용이 감소할 수 있는, 지능형 반사 표면의 배치 위치 선정 방법을 제안한다. 본 발명은 지능형 반사 표면의 최적 위치가 될 수 있는 후보 배치 위치를 선정하고, 후보 배치 위치로부터 지능 형 반사 표면의 최적 위치를 결정한다. 본 발명의 일실시예는, 실내 공간에 위치하는 장애물에 의한 음영 지역을 고려하여, 지능형 반사 표면의 후보 배치 위치를 선정하고, 기지국의 커버리지 영역의 크기가 최대가 되는 후보 배치 위치를, 지능형 반사 표면의 배치 위치로 결정한다. 그리고 본 발명의 일실시예는 기지국의 커버리지 영역의 크기가 최대가 되는 후보 배치 위치를 결정하기 위해, 인공 신경망을 이용할 수 있다. 본 발명의 일실시예에 따르면, 장애물에 의한 음영 지역을 고려하여, 지능형 반사 표면의 후보 배치 위치를 선 정하고, 이러한 후보 배치 위치로부터 기지국의 커버리지 영역의 크기가 최대가 될 수 있는 지능형 반사 표면의 최적 위치를 결정함으로써, 계산 복잡도와 비용이 감소할 수 있다. 본 발명의 일실시예에 따른 배치 위치 선정 방법은 메모리 및 메모리와 전기적으로 연결된 적어도 하나의 프로 세서를 포함하는 컴퓨팅 장치에서 수행될 수 있으며, 프로세서는 배치 위치를 선정하기 위한 일련의 과정을 처 리한다. 이하에서, 본 발명에 따른 실시예들을 첨부된 도면을 참조하여 상세하게 설명한다. 도 1은 본 발명의 일실시예에 따른 지능형 반사표면의 배치 위치 선정 방법을 설명하기 위한 도면이다. 도 1을 참조하면, 본 발명의 일실시예에 따른 컴퓨팅 장치는 실내 공간의 기지국(BS)과 벽면 사이에 위치하는 장애물에 의한, 음영 지역을 결정(S110)한다. 음영 지역은, 장애물에 의해 LoS 채널이 형성되지 않는 지역을 의 미하며, 음영 지역을 결정하기 위해, 실내 공간의 구조 정보, 실내 공간에 포함된 기지국의 위치 정보 및 실내 공간에 포함된 장애물의 특징 정보가 컴퓨팅 장치로 입력될 수 있다. 컴퓨팅 장치는 입력된 정보를 이용하여, 음영 지역을 결정할 수 있다. 실내 공간의 구조 정보는 실내 공간의 형상, 실내 공간의 크기, 실내 공간의 벽면 사이의 거리 등에 대한 정보 를 포함할 수 있으며, 장애물의 특징 정보는 장애물의 형상, 장애물의 위치, 장애물의 길이, 장애물의 각도 등에 대한 정보를 포함할 수 있다. 컴퓨팅 장치는 실내 공간 벽면의 전체 영역 중 음영 지역을 제외한 영역에서, 지능형 반사 표면에 대한 적어도 하나의 후보 배치 위치를 선정(S120)한다. 즉, 지능형 반사 표면의 후보 배치 위치는, 벽면의 전체 영역 중에서, 음영 지역을 제외한 나머지 영역인, LoS 채널이 형성될 수 있는 영역에서 선정될 수 있다. 컴퓨팅 장치는 선정된 후보 배치 위치 중에서, 기지국의 커버리지 영역의 크기가 최대가 되는 후보 배치 위치를, 지능형 반사 표면의 배치 위치로 결정(S130)한다. 컴퓨팅 장치는 미리 학습된 인공 신경망을 이용하여, 지능형 반사 표면의 배치 위치를 결정할 수 있으며, 인공 신경망의 학습을 위해, 지도 학습 및 비지도 학습 모 두 이용될 수 있다. 도 2 및 도 3은 본 발명의 일실시예에 따른 후보 배치 위치 선정 방법을 설명하기 위한 도면이다. 본 발명의 일실시예에 따른 컴퓨팅 장치는 단계 S110에서, 기지국과 벽면 사이에서, 장애물에 대한 한쌍의 가상 접선을 생성하여 음영 지역을 결정할 수 있다. 이 때, 컴퓨팅 장치는 기지국의 커버리지 영역의 크기가 최대가 될 수 있도록, 음영 지역이 최대가 되는 가상 접선을 생성하여, 음영 지역을 결정할 수 있다. 도 2는 3개의 원형 장애물에 의한 음영 지역이 표시된 도면이며, 도 3은 3개의 사각형 장애물에 의한 음영 지역 이 표시된 도면이다. 컴퓨팅 장치는 일실시예로서, 2차원 평면 상에서 정의된 실내 공간과 장애물을 이용하여, 음영 지역을 결정할 수 있다. 도 2에 도시된 바와 같이, 컴퓨팅 장치는 기지국과 실내 공간의 벽면 사이에서, 원형 장애물(231, 232, 233)에 대한 한쌍의 가상 접선을 생성하고, 가상 접선의 내부 영역과 벽면이 접하는 영역을, 음영 지역으 로 결정할 수 있다. 제1원형 장애물에 의한 음영 지역은, 제1 및 제2가상 접선과 벽면이 만나 생성되는 2 개의 교차점(241, 242) 사이의 벽면 영역에 대응되며, 제2원형 장애물에 의한 음영 지역은 제3 및 제4가상 접선과 벽면이 만나 생성되는 2개의 교차점(243, 244) 사이의 벽면 영역에 대응된다. 제3원형 장애물에 의 한 음영 지역은, 제2원형 장애물에 의한 음영 지역에 포함된다. 도 3에 도시된 바와 같이, 사각형 장애물이 배치된 경우에도, 컴퓨팅 장치는 사각형 장애물(331, 332, 333)에 대한 한쌍의 가상 접선을 생성하여 음영 지역을 결정할 수 있다. 제1사각형 장애물에 의한 음영 지역은, 제1 및 제2가상 접선과 벽면이 만나 생성되는 2개의 교차점(341, 342) 사이의 벽면 영역에 대응되며, 제2사각형 장애물에 의한 음영 지역은 제3 및 제4가상 접선과 벽면이 만나 생성되는 2개의 교차점(343, 344) 사이의 벽면 영역에 대응된다. 제3원형 장애물에 의한 음영 지역은, 제5 및 제6가상 접선과 벽면이 만나 생성되는 2개의 교차점(345, 346) 사이의 벽면 영역에 대응된다. 그리고 컴퓨팅 장치는 벽면의 전체 영역 중 음영 지역을 제외한 영역에서, 가상 접선과 벽면의 교차점을, 지능 형 반사 표면에 대한 후보 배치 위치로 선정한다. 도 2에서는 제1 내지 제4교차점(241 내지 244)이, 후보 배치 위치로 선정될 수 있으며, 도 3에서는 제1 내지 제6교차점(341 내지 346) 중에서, 음영 지역을 제외한 영역에 포함되는 교차점인 제1교차점, 제2교차점, 제3교차점 및 제6교차점이, 후보 배치 위치로 선정될 수 있다. 여기서, 후보 배치 위치는 지능형 반사 표면의 일단에 대한 배치 위치를 나타내며, 도 2 및 도 3에 도시된 바와 같이, 후보 배치 위치에 지능형 반사 표면(251 내지 254, 351 내지 354)이 배치될 경우, 지능형 반사 표면(251 내지 254, 351 내지 354))의 타단은, 음영 지역을 제외한 벽면 영역에 위치하게 된다. 도 4는 본 발명의 일실시예에 따른 인공 신경망을 나타내는 도면이다. 전술된 바와 같이, 컴퓨팅 장치는 미리 학습된 인공 신경망을 이용하여, 지능형 반사 표면의 배치 위치를 결정 할 수 있으며, 컴퓨팅 장치는 장애물에 대한 특징 정보, 기지국의 위치 정보 및 후보 배치 위치를 미리 학습된 인공 신경망에 입력하여, 기지국의 커버리지 영역이 최대가 되는 후보 배치 위치를 결정할 수 있다. 도 4에 도시된 바와 같이, 인공 신경망은 입력층, 은닉층, 출력층을 포함할 수 있으며, 입력층 으로 장애물에 대한 특징 정보,( ) 기지국의 위치 정보( ) 및 후보 배치 위치( )가 입력되며, 출력층은 선정된 후보 배치 위치 중, 기지국의 커버리지 영역이 최대가 되는 후보 배치 위치 ( )를 출력한다. 출력층의 노드의 개수는, 후보 배치 위치의 최대 개수에 대응될 수 있으 며, 후보 배치 위치의 최대 개수(T)는 장애물의 개수(I)의 2배일 수 있다. 출력층의 노드는 각각 후보 배치 위치에 할당될 수 있으며, 보상의 기대값인 Q값을 출력할 수 있다. 출력 된 Q값중 최대값을 출력한 노드에 대응되는 후보 배치 위치가, 지능형 반사 표면의 배치 위치로 결정될 수 있다. 인공 신경망은, 기지국의 커버리지 영역이 최대가 되도록 보상하는 보상 함수를 통해 학습될 수 있다. 지도 학 습 과정에서는, 인공 신경망에 의해 결정된 지능형 반사 표면의 배치 위치가 정답값에 대응될 경우 1, 그렇지 않은 경우 0을 보상으로 제공하는 보상 함수가 이용될 수 있다. 그리고 비지도 학습 과정에서는, 인공 신경망에 의해 결정된 지능형 반사 표면의 배치 위치에 의한 기지국의 커버리지 영역의 크기에 따라서, 보상이 제공되는 보상 함수가 이용될 수 있다. 기지국의 커버리지 영역의 크기가 클수록 높은 보상이 제공된다. 장애물에 대한 특징 정보는 장애물의 형상이 원형인 경우, 장애물의 위치 및 반경 정보를 포함할 수 있으며, 여 기서 위치 정보는 원형 장애물의 중심 위치일 수 있다. 그리고 장애물의 형상이 사각형인 경우, 특징 정보는 장애물의 위치, 길이 및 각도 정보를 포함할 수 있다. 여 기서 사각형 장애물의 위치는 꼭지점의 위치, 중심 위치 등 실시예에 따라서 다양하게 설정될 수 있으며, 사각 형 장애물의 길이는 사각형 장애물의 최대 길이에 대응될 수 있다. 또한 장애물의 각도 정보는, 장애물의 길이 방향과 실내 공간의 기준 벽면 사이의 각도에 대한 정보일 수 있다. 예컨대, 도 3에서, 제4 내지 제5교차점이 위치한 벽면이 기준 벽면일 수 있으며, 제1장애물에 대한 각도는 제1장애물의 길이 방향(L)과, 제4 내지 제5교차점이 위치한 벽면 사이의 각도에 대응될 수 있다. 장애물의 형상 이 사각형인 경우, 장애물의 각도에 따라서 음영 지역 역시 달라지기 때문에, 본 발명의 일실시예는 사각형 장 애물의 각도 정보를 이용하여 기지국의 커버리지 영역이 최대가 되는 지능형 반사 표면의 배치 위치를 결정한다. 후보 배치 위치는 전술된 교차점의 위치에 대응될 수 있다. 도 5 및 도 6은 본 발명의 일실시예에 따라서 선정된 배치 위치에, 지능형 반사 표면이 배치된 예시를 나타내는 도면이다. 도 5는 5개의 원형 장애물과 3개의 지능형 반사 표면이 배치된 실내 공간에서의 기지국의 커버리지 영역을 나타 내며, 도 6은 5개의 사각형 장애물과 3개의 지능형 반사 표면이 배치된 실내 공간에서의 기지국의 커버리지 영 역을 나타낸다. 도 5(a) 및 도 6(a)는 지능형 반사 표면이 배치되지 않은 상황에서의 기지국의 커버리지 영역 (파란색)을 나타내며, 도 5(b) 및 도 6(b)는 지능형 반사 표면이 배치된 상황에서, 기지국의 커버리지 영역(파 란색) 및 지능형 반사 표면에 의해 추가된 기지국의 커버리지 영역(빨간색)을 나타낸다. 전술된 바와 같이, 지능형 반사 표면의 일단은, 가상 접선과 벽면의 교차점에 배치되며, 지능형 반사 표면의 타 단은 음영 지역을 제외한 벽면 영역에 위치한다. 도 5 및 도 6에 도시된 바와 같이, 본 발명의 일실시예에 따라서 지능형 반사 표면이 배치된 경우, 음영 지역이 거의 없이 실내 공간 전체가, 기지국의 커버리지 영역에 대응됨을 알 수 있다. 도 7 및 도 8은 본 발명의 일실시예에 따른, 기지국의 커버리지 영역의 크기를 설명하기 위한 도면이다. 도 7은 3개의 원형 장애물이 실내 공간에 포함된 환경, 도 8은 3개의 사각형 장애물이 실내 공간에 포함된 환경 에서, 지능형 반사 표면에 대한 후보 배치 위치의 개수에 따른, 기지국의 커버리지 영역의 크기를 나타낸다. 도 7 및 도 8에서는, 기지국의 커버리지 영역의 크기의 최대값이 1로 표현되어 있다. 도 7 및 도 8에서 Optimal은 기지국의 커버리지 영역의 크기가 최대가 되는 최적의 배치 위치에 지능형 반사 표 면이 배치된 경우를 나타내며, Full search in Q*는 실내 공간을 격자화하여 도출된 후보 배치 위치로부터 지능 형 반사 표면의 배치 위치가 선정된 경우를 나타낸다. SL in Q* 및 UL in Q*는 본 발명의 일실시예에 따라서 지능형 반사 표면의 배치 위치가 선정된 경우를 나타내며, SL in Q*는 지도 학습 방법, UL in Q*는 비지도 학습 방법이 이용된 경우를 나타낸다. 마지막으로 Random은 랜덤하게 지능형 반사 표면의 배치 위치가 선정된 경우를 나타낸다. 도 7 및 도 8에 도시된 바와 같이, 본 발명의 일실시예에 따르면, Optimal이나, Full search in Q*과 비교하여, 기지국의 커버리지 영역의 크기에 큰 차이가 없음을 알 수 있다. 이와 같이 본 발명의 일실시예에 따르면, 낮은 계산 복잡도와 비용으로, 지능형 반사 표면의 최적 배치 위치가 선정될 수 있다. 앞서 설명한 기술적 내용들은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴 퓨터 판독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 실시예들을 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴 퓨터 판독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행 하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포 함한다. 하드웨어 장치는 실시예들의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성 될 수 있으며, 그 역도 마찬가지이다. 이상과 같이 본 발명에서는 구체적인 구성 요소 등과 같은 특정 사항들과 한정된 실시예 및 도면에 의해 설명되 었으나 이는 본 발명의 보다 전반적인 이해를 돕기 위해서 제공된 것일 뿐, 본 발명은 상기의 실시예에 한정되 는 것은 아니며, 본 발명이 속하는 분야에서 통상적인 지식을 가진 자라면 이러한 기재로부터 다양한 수정 및 변형이 가능하다. 따라서, 본 발명의 사상은 설명된 실시예에 국한되어 정해져서는 아니되며, 후술하는 특허청 구범위뿐 아니라 이 특허청구범위와 균등하거나 등가적 변형이 있는 모든 것들은 본 발명 사상의 범주에 속한다 고 할 것이다."}
{"patent_id": "10-2023-0016893", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시예에 따른 지능형 반사표면의 배치 위치 선정 방법을 설명하기 위한 도면이다. 도 2 및 도 3은 본 발명의 일실시예에 따른 후보 배치 위치 선정 방법을 설명하기 위한 도면이다. 도 4는 본 발명의 일실시예에 따른 인공 신경망을 나타내는 도면이다. 도 5 및 도 6은 본 발명의 일실시예에 따라서 지능형 반사 표면이 배치된 경우의 기지국의 커버리지 영역을 설 명하기 위한 도면이다. 도 7 및 도 8은 본 발명의 일실시예에 따른, 기지국의 커버리지 영역의 크기를 설명하기 위한 도면이다."}
