{"patent_id": "10-2023-7005707", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0042313", "출원번호": "10-2023-7005707", "발명의 명칭": "이산화탄소 전해조의 성능을 향상 및 유지하기 위한 방법 및 시스템", "출원인": "세게디 투도마네게템", "발명자": "달바스, 페렌크"}}
{"patent_id": "10-2023-7005707", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "기체 이산화탄소(CO2)의 연속 전기분해용 전해조의 성능을 향상시키는 방법으로서,상기 전해조는, 애노드 촉매 층을 갖는 적어도 하나의 애노드, 가스 확산 전극(GDE)으로서 형성된 캐소드 촉매층을 갖는 캐소드, 상기 애노드와 상기 캐소드 사이에 배치된 이온 전도성 분리막 층, 상기 애노드와 접하도록형성된 애노드 격실, 및 상기 캐소드와 접하도록 형성된 캐소드 격실을 포함하고, 상기 방법은, - 상기 캐소드 격실을 통해 기체 CO2의 흐름을 유도하고, 선택적으로 상기 캐소드 격실을 통해 액체 캐소드액의흐름을 유도하고, 및 상기 애노드 격실을 통해 애노드액의 흐름을 유도하고, 전해조에서 상기 CO2의 전기분해를수행함으로써, 상기 CO2를 상기 전해조를 떠나는 적어도 하나의 생성물로 전환하는 단계, 및- (i) 알칼리 또는 알칼리 토금속 양이온을 함유하는 액체 흐름, 또는 (ii) 이소프로판올 증기, 에탄올 증기, 기체 암모니아, N2H4, HCl, 이산화황 및 아산화질소 중 적어도 하나를포함하는 기체 흐름중 하나를 때때로 상기 캐소드 격실을 통해 유도하여 GDE를 활성화는 단계를 포함하는, 전해조 성능의 향상 방법."}
{"patent_id": "10-2023-7005707", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 알칼리 또는 알칼리 토금속 양이온을 함유하는 액체 흐름이 적어도 하나의 용해된 촉진제의 액체흐름이고, 상기 적어도 하나의 촉진제가 화합물 NaCl, LiF, Li3PO4, Cs2CO3, Na2CO3, Li2CO3, K2CO3, Rb2CO3,CaSO4, NaNO3, K2SO4, KHCO3, NaHCO3, LiHCO3, CsHCO3, RbHCO3, RbOH, FrOH, NH3, CsOH, KOH, NaOH, Ca(OH)2,Ba(OH)2, Mg(OH)2, BaHCO3, Mg(HCO3)2, MgCO3, BaCO3, CaCO3, Sr(OH)2, SrCO3, Sr(HCO3)2의 그룹으로부터 선택되는방법."}
{"patent_id": "10-2023-7005707", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 액체 흐름 중 촉진제 농도가 0.001 내지 5 mol/dm3, 더욱 바람직하게는 0.01 내지 3 mol/dm3, 가장 바람직하게는 0.1 내지 1 mol/dm3인 방법."}
{"patent_id": "10-2023-7005707", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항 내지 제3항 중 어느 한 항에 있어서, 상기 캐소드 격실을 통해 유도되는 흐름의 총 부피는 상기 캐소드 격실의 빈 부피의 0.01 내지 1,000 배, 보다바람직하게는 0.1 내지 100 배, 가장 바람직하게는 1 내지 50 배인 방법."}
{"patent_id": "10-2023-7005707", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항 내지 제4항 중 어느 한 항에 있어서, 상기 캐소드 격실을 통해 GDE를 습윤화할 수 있는 추가 흐름을 때때로 유도하는 단계를 추가로 포함하는 방법.공개특허 10-2023-0042313-3-청구항 6 제5항에 있어서, 적어도 2개의 상이한 용매의 용매 혼합물로서 GDE를 습윤화할 수 있는 상기 추가 흐름을 제공하는 단계를 추가로 포함하는 방법."}
{"patent_id": "10-2023-7005707", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,아세톤, 아세토니트릴, 클로로포름, 디에틸 에테르, 디에틸렌 글리콜, 디메틸포름아미드, 에틸 아세테이트, 에틸렌 글리콜, 글리세롤, 테트라하이드로푸란, 크실렌, 물, 탈이온수, 메탄올, 에탄올, 1-프로판올, 2-프로판올,1-부탄올, 2-부탄올, 펜탄올, 펜탄, 헥산, 헵탄, 및 시클로헥산으로 이루어진 그룹으로부터 선택되는 용매 중어느 하나를 추가로 포함하는 방법."}
{"patent_id": "10-2023-7005707", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제5항 내지 제7항 중 어느 한 항에 있어서, 상기 적어도 하나의 촉진제를 용해하기 위해 GDE를 습윤화할 수 있는 상기 추가 흐름을 사용하는 단계를 추가로포함하는 방법."}
{"patent_id": "10-2023-7005707", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항 내지 제8항 중 어느 한 항에 있어서, 알칼리 농도가 0 내지 3M인 알칼리성 액체의 그룹으로부터 애노드액을 선택하는 단계를 추가로 포함하는 방법."}
{"patent_id": "10-2023-7005707", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 순수한 탈이온수를 애노드액으로 이용하는 단계를 추가로 포함하는 방법."}
{"patent_id": "10-2023-7005707", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항 내지 제10항 중 어느 한 항에 있어서, 상기 액체 흐름 및 상기 기체 흐름 중 하나를 기체 CO2의 흐름과 사용시 액체 캐소드액의 흐름과 동시에 캐소드격실을 통해 상기 액체 흐름과 상기 기체 흐름 중 하나를 유도하는 단계를 추가로 포함하는 방법."}
{"patent_id": "10-2023-7005707", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1항 내지 제11항 중 어느 한 항에 있어서, 상기 전해조를, 단일 전해조 셀로서, 또는 전해조 셀의 전기적 연결 측면에서 직렬로 연결되고, 상기 전해조의캐소드 격실을 통해 유도된 액체 흐름 기체 흐름 측면에서 직렬/병렬로 연결된 다수의 전해조 셀로 구성된 전해조 셀 스택으로서 상기 전해조를 구축하는 단계를 추가로 포함하는 방법."}
{"patent_id": "10-2023-7005707", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "기체 이산화탄소(CO2)의 연속 전기분해를 위한 전해조의 성능을 유지하는 방법으로서, 상기 전해조는 애노드 촉매 층을 갖는 애노드, 가스 확산 전극(GDE)으로 형성된 캐소드 촉매 층을 갖는 캐소드,상기 애노드와 상기 캐소드 사이에 배치된 이온 전도성 분리막 층, 상기 애노드와 접하도록 형성된 애노드격실, 및 상기 캐소드와 접하도록 형성된 캐소드 격실을 포함하고, 상기 방법은,(a) 기체 CO2의 흐름, 및 선택적으로 액체 캐소드액의 흐름을 캐소드 격실을 통해 유도하고 애노드액의 흐름을애노드 격실을 통해 유도함으로써, 상기 전해조를 작동시켜 상기 CO2의 전기분해를 수행하고, 상기 전해조 스택공개특허 10-2023-0042313-4-을 떠나는 생성물 스트림으로 상기 CO2를 전환하는 단계;(b) 상기 전해조 스택에 진입하기 전에 기체 CO2 흐름의 적어도 하나의 파라미터를 모니터링함으로써 상기 전해조의 실제 전해조 성능의 제1 측정 데이터 특성 세트를 얻는 단계;(c) 상기 전해조에서 나간 후 상기 생성물 스트림의 적어도 하나의 파라미터를 모니터링함으로써 상기 전해조의실제 전해조 성능의 제2 측정 데이터 특성 세트를 얻는 단계;(d) 단계(b) 및 (c)에서 얻어진 상기 측정 데이터 세트를 상기 전해조의 원하는 전해조 성능을 나타내는 전해조의 작동 파라미터의 공칭 또는 사전 설정 값과 비교함으로써 상기 전해조의 실제 전해조 성능의 적어도 하나의디스크립터 특성을 얻는 단계;(e) 단계(d)에서 결정된 상기 디스크립터 중 하나는 상기 전해조의 실제 전해조 성능이 미리 규정된 최소 전해조 성능 미만임을 의미하는 경우, 상기 전해조의 성능을 증가시키기 위해 제1항 내지 제11항 중 어느 한 항에따른 공정을 개시하는 단계;(f) 상기 전해조를 연속적으로 작동 시키면서 단계(b) 내지 (d)를 반복함으로써 상기 디스크립터를 업데이트하는 단계; 및(g) 단계(d)에서 결정된 상기 모든 디스크립터는 상기 전해조의 실제 전해조 성능이 원하는 전해조 성능을 초과했음을 의미하는 경우, 제1항 내지 제11항 중 어느 한 항에 따른 방법을 종료하는 단계를 포함하는, 전해조의 성능 유지 방법."}
{"patent_id": "10-2023-7005707", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서, 단계(b)에서 적어도 하나의 파라미터로서 기체 CO2 흐름의 압력, 온도, 유속 및 수분 함량 중 적어도 하나를 모니터링하는 단계를 추가로 포함하는 방법."}
{"patent_id": "10-2023-7005707", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제13항 또는 제14항에 있어서, 단계(c)에서 적어도 하나의 파라미터로서 상기 생성물 스트림의 압력, 온도, 수분 함량, pH 값, 유속, 및 조성중 적어도 하나를 모니터링하는 단계를 추가로 포함하는 방법."}
{"patent_id": "10-2023-7005707", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제13항 내지 제15항 중 어느 한 항에 있어서, 상기 전해조 내의 압력 증가, 상기 생성물 스트림의 조성, 상기 전해조의 총 전류 밀도 감소율, 셀/셀 스택 전압 증가로 이루어진 그룹으로부터 상기 적어도 하나의 디스크립터(descriptor)를 선택하는 단계를 추가로 포함하는 방법."}
{"patent_id": "10-2023-7005707", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제13항 내지 제16항 중 어느 한 항에 있어서, 단일 전해조 셀로서, 또는 상기 전해조 셀의 전기적 연결 측면에서 직렬로 연결되고, 상기 전해조의 캐소드 격실을 통해 유도된 액체 흐름 및 기체 흐름 측면에서 직렬/병렬로 연결된 다수의 전해조 셀로 구성된 전해조 셀스택으로서 상기 전해조를 구축하는 단계를 추가로 포함하는 방법."}
{"patent_id": "10-2023-7005707", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제13항 내지 제17항 중 어느 한 항에 있어서, 상기 방법은 바람직하게는 인공 지능의 감시 하에 자동으로 수행되는 방법."}
{"patent_id": "10-2023-7005707", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "공개특허 10-2023-0042313-5-기체 이산화탄소(CO2)를 생성물 스트림으로 연속 전기분해적 전환 중에 전해조 셀(100, 100\")의 전해조 성능을향상 및 유지하기 위한 시스템(200, 300)으로서, 상기 시스템(200, 300)은,애노드 촉매 층을 갖는 적어도 하나의 애노드, 가스 확산 전극(GDE)으로 형성된 캐소드 촉매 층을 갖는 캐소드,상기 애노드와 상기 캐소드 사이에 배치된 이온 전도성 분리막 층, 상기 애노드와 접하도록 형성된 애노드격실, 및 상기 캐소드와 접하도록 형성된 캐소드 격실을 포함하는 전해조 셀(100, 100')로서, 상기 전해조 셀(100, 100')이 단일 전해조 셀 및 셀의 전기적 연결 측면에서 직렬로 연결되고 상기 캐소드 격실을 통해 유도된물질 흐름의 측면에서 직렬/병렬로 연결된 다수의 전해조 셀로 이루어진 전해조 셀 스택 중 하나로서 제공되는,전해조 셀(100, 100');기체 CO2의 공급원;액체 애노드액 공급원;선택적으로 액체 캐소드액 공급원;셀(100, 100\")의 캐소드 격실을 통해, 상기 액체 캐소드액 공급원으로부터, 사용되는 경우, 상기 기체 CO2 공급원으로부터의 기체 CO2 및 선택적으로 액체 캐소드액을 유도하는 캐소드 측 순환 어셈블리; 상기 셀(100, 100\")의 애노드 격실을 통해 상기 액체 애노드액 공급원으로부터 액체 애노드액을 유도하는 애노드 측 순환 어셈블리; 및 (i) 알칼리 또는 알칼리 토금속 양이온을 함유하는 액체 흐름, 또는(ii) 캐소드 측 순환 어셈블리에 의해 GDE를 활성화하기 위해 때때로 상기 캐소드 격실을 통해 유도하는 이소프로판올 증기, 에탄올 증기, 기체 암모니아, N2H4, HCl, 이산화황 및 아산화질소 중 적어도 하나를 포함하는 기체흐름 중 하나를 제공하기 위한, 상기 캐소드 측 순환 어셈블리와 유체 연통하는 재생/활성화 서브시스템(202)을 포함하는, 전해조 성능의 향상 및 유지 시스템(200, 300)."}
{"patent_id": "10-2023-7005707", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서, 재생/활성화 서브시스템(202)은, GDE를 습윤화할 수 있는 적어도 하나의 용매에 용해된 화합물인 NaCl, LiF,Li3PO4, Cs2CO3, Na2CO3, Li2CO3, K2CO3, Rb2CO3, CaSO4, NaNO3, K2SO4, KHCO3, NaHCO3, LiHCO3, CsHCO3, RbHCO3,RbOH, FrOH, NH3, CsOH, KOH, NaOH, Ca(OH)2, Ba(OH)2, Mg(OH)2, BaHCO3, Mg(HCO3)2, MgCO3, BaCO3, CaCO3,Sr(OH)2, SrCO3, Sr(HCO3)2의 그룹으로부터 선택된 알칼리 또는 알칼리-토금속 양이온의 공급원으로서 적어도 하나의 촉진제를 저장하기 위한 적어도 하나의 촉진제 탱크(230)를 포함하는 시스템(200, 300)."}
{"patent_id": "10-2023-7005707", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제19항에 있어서, 상기 재생/활성화 서브시스템(202)은 이소프로판올 증기, 에탄올 증기, 기체 암모니아, 기체 상태의 N2H4, HCl,이산화황 및 아산화질소의 그룹으로부터 선택되는 적어도 하나의 촉진제를 저장하기 위한 적어도 하나의 촉진제탱크(230)를 포함하는 시스템(200, 300),"}
{"patent_id": "10-2023-7005707", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제19항 또는 제20항에 있어서, 상기 재생/활성화 서브시스템(202)은, 아세톤, 아세토니트릴, 클로로포름, 디에틸에테르, 디에틸렌글리콜, 디메틸포름아미드, 에틸아세테이트, 에틸렌글리콜, 글리세롤, 테트라하이드로푸란, 크실렌, 물, 탈이온수, 메탄올,에탄올, 1-프로판올, 2-프로판올, 1-부탄올, 2-부탄올, 펜탄올, 펜탄, 헥산, 헵탄, 및 시클로헥산으로 이루어진그룹으로부터 선택되는 적어도 하나의 용매를 저장하기 위한 적어도 하나의 용매 탱크(240, 245)를 추가로 포함하는 시스템(200, 300).공개특허 10-2023-0042313-6-청구항 23 제19항 내지 제22항 중 어느 한 항에 있어서, 상기 애노드 측 순환 어셈블리는 전해조 셀(100, 100')의 애노드 격실을 통해 애노드액을 리프레싱 및 순환하기위한 애노드액 리프레셔 유닛(360)을 추가로 포함하는 시스템(300)."}
{"patent_id": "10-2023-7005707", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제19항 내지 제23항 중 어느 한 항에 있어서, 상기 캐소드 측 순환 어셈블리는, 상기 시스템(200, 300) 작동에 대한 파라미터 특징의 제1 세트를 제공하기 위해 상기 전해조 셀(100, 100')의 상향류에 배치된 제1 센서 세트(210), 및 상기 시스템(200, 300) 작동에 대한파라미터 특징의 제2 세트를 제공하기 위해 상기 전해조 셀(100, 100')의 하향류에 배치된 제2 센서 세트(210\")를 추가로 포함하는 시스템(200, 300)."}
{"patent_id": "10-2023-7005707", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제19항 내지 제24항 중 어느 한 항에 있어서, 상기 캐소드 측 순환 어셈블리는 상기 생성물 스트림을 모니터링하고 상기 전해조 셀(100, 100')을 떠난 상기생성물 스트림의 물리적/화학적 파라미터를 측정하기 위한 분석기 유닛(209, 225)를 추가로 포함하는 시스템(200, 300)."}
{"patent_id": "10-2023-7005707", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "제19항 내지 제25항 중 어느 한 항에 있어서, 상기 캐소드 측 순환 어셈블리는 상기 기체 CO2가 상기 전해조(100, 100')에 진입하기 전에 상기 기체 CO2를 가습하기 위해 상기 전해조 셀(100, 100')의 상향류에 배치된 가습기(340)를 추가로 포함하는 시스템(300)."}
{"patent_id": "10-2023-7005707", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "제26항에 있어서, 상기 캐소드 측 순환 어셈블리는 상기 시스템(300) 작동에 대한 파라미터 특징의 제3 세트를 제공하기 위해 상기 가습기(340)의 하향류 및 상기 전해조 셀(100, 100')의 상향류에 배치된 제3 센서 세트(210')를 추가로 포함하는 시스템(300)."}
{"patent_id": "10-2023-7005707", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_28", "content": "제19항 내지 제27항 중 어느 한 항에 있어서, 상기 제1 및 제2 파라미터 세트뿐만 아니라 상기 물리적/화학적 파라미터를 얻기 위한 제어 서브시스템(201)을추가로 포함하고, 알칼리 또는 알칼리 토금속 양이온을 함유하는 액체 흐름 및 상기 캐소드 격실을 통한 기체흐름 중 하나를 제공하는 단계를 수행하기 위해 얻어진 파라미터를 기반으로 상기 재생/활성화 서브시스템(202)을 작동하도록 구성된 시스템(200, 300)."}
{"patent_id": "10-2023-7005707", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "제28항에 있어서, 상기 제어 서브시스템(201)은 또한 상기 제3 파라미터 세트를 얻도록 구성되는 시스템(300)."}
{"patent_id": "10-2023-7005707", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_30", "content": "제28항 또는 제29항에 있어서, 상기 제어 서브시스템(201)은 제1항 내지 제11항 중 어느 한 항에 따른 방법 또는 제13항 내지 제17항 중 어느한 항에 따른 방법을 자동으로 수행하기 위해 인공 지능 서브유닛을 구비하거나 또는 인공 지능 서브유닛으로서구현되는 시스템(300). 공개특허 10-2023-0042313-7-청구항 31 제19항 내지 제30항 중 어느 한 항에 있어서, 상기 전해조 셀(100, 100')은 제로-갭(zero-gap) 전해조 셀(100) 및 비-제로 갭(non-zero gap) 전해조 셀(100') 중 하나인 시스템(200, 300)."}
{"patent_id": "10-2023-7005707", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 기체 이산화탄소(CO2)의 연속 전기분해를 위한 전해조의 성능을 향상/지속시키는 방법 및 시스템 에 관한 것으로, 여기서 전해조는 적어도 애노드 촉매 층을 갖는 애노드, 가스 확산 전극(GDE)으로 형 성된 캐소드 촉매 층을 갖는 캐소드, 상기 애노드와 상기 캐소드 사이에 배치된 이온 전도성 분리막 층, 상기 애 (뒷면에 계속)"}
{"patent_id": "10-2023-7005707", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 기체 이산화탄소의 전기분해를 통해 고 부가가치 제품을 제조하는 분야에 관한 것이다. 특히, 본 발 명은 전환율 및 효율의 손실 없이 장기간 동안 이산화탄소 전해조의 연속 작동 중에 이산화탄소 전해조의 성능 을 향상 및 유지하기 위한 방법 및 시스템에 관한 것이다. 상기 이산화탄소 전해조는 단일 전해조 셀 또는 다중 전해조 셀로 구성된, 즉 전해조 셀 스택(cell-stack)을 포함하는 이산화탄소 전해조일 수 있다. 전해조 셀 스택 은 여러 개의 전해조 셀로 구성되며, 여기서 개별 셀은 셀의 전기적 연결 측면에서 직렬로 연결되고, 전해조의 흐름 관리, 즉 전해조를 통해 유도되는 액체 흐름과 가스 흐름 측면에서 직렬/병렬로 연결된다."}
{"patent_id": "10-2023-7005707", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "이산화탄소(CO2)는 온실 가스이다. 따라서 재생 에너지를 사용하여 운송 연료 및 범용 화학 물질로 전환하는 것 은 제품 생성과 탄소 배출의 환경 개선을 동시에 수행하는 부가가치 접근 방식이다. CO2의 전기 화학적 환원(및 수소화)으로부터 잠재적으로 파생될 수 있는, 전 세계적으로 생산되는 많은 양의 화학 물질은 이 전략의 중요성 을 더욱 강조한다. 재생 에너지(예를 들어, 태양열 또는 풍력 에너지)를 사용하는 화학 물질의 전기 합성은 친 환경적이고 보다 지속 가능한 화학 산업에 기여한다. 다양한 CO2 파생 제품으로 인해, 고분자 전해질 멤브레인 (Polymer-Electrolyte Membrane, PEM) 기반 전해조가 특히 매력적이다. PEM 기반 CO2 전해조의 일반적인 구성은 촉매 층(제로-갭 셀(zero gap cell))과 직접 접촉하거나 액체층(애노드 측과 캐소드 측에 각각 애노드액 및 캐소드액)에 의해 촉매 층과 분리되는 분리막(이온 교환 멤브레인 또는 다 이어프램)으로 구성된다. 캐소드 전기촉매는 다공성 가스 확산층(GDL)에 고정되어 캐소드 가스 확산 전극(GDE) 을 형성한다. 제로-갭 전해조는 액체 캐소드액(catholyte) 없이 기능하므로, 더 낮은 셀 전압에서의 작동이 가능해진다(결과 적으로 에너지 효율이 높아짐). 그러나 알칼리성 애노드액(anolyte)을 사용하는 제로-갭 CO2 전해조의 오랜 시 간 연속 작동은 캐소드에 침전물 형성을 초래한다. 이것은 비-제로 갭(non-zero gap) 장치(즉, 액체 캐소드액이 흐르는 곳)의 경우에도 마찬가지이지만, 그 정도는 더 적어진다. 이 결정체 형성은 애노드 측으로부터 캐소드 측으로의 애노드액 양이온의 교차로 인해(제로-갭 셀에서) 또는 캐소드액의 존재로 인해(비-제로 갭 셀에서) 발 생하는 금속-탄산염 또는 금속-중탄산염(예를 들어, K2CO3 또는 KHCO3)의 형성에 기인한다. 캐소드 GDE의 침전물 형성은 반응물 가스가 촉매 층으로 가는 길을 차단하여 전해조 성능을 감소시킨다. 이것은 또한 셀 내의 압력 상승으로 이어져 셀 내의 요소를 왜곡시키고, 즉 셀의 완전성이 손상되고 셀의 전해조 성능 손실을 초래할 수 있다. 따라서, 이를 방지하려면 재생이 필요하다. 이하, 본 명세서에서 '전해조 재생'이라는 용어는 전해조의 성능을 회복시키는 과정을 의미한다. 연속 동작도 문제가 되는 경우, 전해조를 분해하지 않고 침전물을 기계적 및/또는 화학적으로 동원하거나 용해할 필요가 있다. 이에 대한 시도는 CO2 가스 스트림에 물 또는 수증기를 연속적으로 투여하는 것이다. 이 해결책은 현재 최신 기 술을 나타내지만, 셀의 범람을 유발하여 CO2 환원 생성물 형성에 대한 선택성이 감소하고, H2 발생이 증가할 수 있다. 또한, 이러한 전기화학 셀의 GDE는 소수성이 되도록 설계되어, 반응물 CO2가 가스 상태에서 촉매 표면에 도달하는 대신, 충분한 양의 물에 용해되어 전환 공정에서 대량 수송 제한을 초래한다. 따라서 전해조의 캐소드 격실(compartment)을 물로 린스하는 경우, GDE 후면(예를 들어, 가스 유동 패턴)에 형성된 침전물만을 제거할 수 있지만, GDL의 기공에 형성된 침전물은 제거할 수 없다. GDE의 기공 구조에 물을 압입하기 위해서는, 과도한 힘(즉, 압력)이 필요하며, 이로 인해 GDL의 구조가 손상되고 (미세)균열이 형성된다. 이러한 미세 균열로 인해, 물이 GDL을 통해 흐를 수 있으므로, 일정 시간이 지나면 전체 GDE가 침수되어 이러한 장치의 장기간 작동을 방해한다. 따라서 재생 용액은 사용된 GDE의 친수성/소수성 특성과 전해조의 작동 조건에 맞게 조정되어야 한다. 음이온 교환 멤브레인(AEM) 기반 작동은, 원칙적으로 알칼리성 용액(가장 일반적으로 KOH, NaOH 또는 CsOH) 또 는 물이 애노드에 공급되는지 여부와 무관하다(애노드 전기 촉매가 두 매체 모두에서 기능하는 경우). 그럼에도 불구하고, 탈이온수를 애노드액으로 사용하는 제로-갭 CO2 전해조의 성능(생성물 형성 속도 및 선택성 측면에 서)은, 산업 응용 분야에서 불만족스럽게 낮은 것으로 밝혀졌다. 알칼리성 애노드액과 순수한 탈이온수를 사용 한 전해조의 작동의 주된 차이점은, 최초의 경우에 금속 양이온이 애노드로부터 캐소드로 멤브레인을 가로질러 캐소드 촉매 층의 표면에 이러한 이온이 존재하게 한다는 것이다. 전해조 셀 또는 스택에서 전기분해에 의한 연속 CO2 전환 분야에서, 많은 기술적 해결책이 알려져 있다."}
{"patent_id": "10-2023-7005707", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "특히, B. Endrodi 등은 CO2 환원을 위한 연속 흐름 전해조 개발의 최신 기술에 대한 포괄적인 요약을 제공한다 (Prog. Energy Combus. Sci. 2017, 62, pp.133-154. https://doi.org/10.1016/j.pecs.2017.05.005 참조). 이 논문은 전해조의 일부 가능한 실시형태, 효율적인 작동을 위해 가장 중요한 기준 및 디스크립터(descriptor), 가능한 일부 전해조 고장 메커니즘을 설명한다. 또한 검토는 전기화학 셀(미세 유체 또는 멤브레인 기반)의 기 본 설계 개념, 사용된 재료(예를 들어, 촉매, 지지체 등) 및 작동 조건(예를 들어, 전해질 유형, 압력의 역할, 온도 등)을 망라한다. 미국 특허 출원 공개 2018/0274109 A1에서는, 유체 제어 및 전기화학 계측 프레임워크를 포함하여 CO2 전해조를 위한 전체 작동 환경을 갖춘 장치에 대해 기술하고 있다. 그것은 셀의 캐소드 또는 애노드 측에 물을 주입하여 재생시킬 수 있는 재생 공급 장치를 포함한다. 상기 특허출원 공개에 따르면, 상기 재생 공급 장치는, 셀 전압, 셀 전류 면에서 셀 작동이 만족스럽지 않을 때 및/또는 원하는 제품의 패러데이 효율이 요청 기준을 만족하지 않을 때 작동되어야 한다. 미국 특허출원 공개 US 2019/0127865 A1에서는, 연속적인 CO2 환원을 위한 전해조의 가능한 실시형태에 대해서 기술하고 있다. 가장 중요한 전해조 요소와 작동 조건이 설명되어 있다. 특히, 상기 특허출원 공개에서는, 입력 생성물을 출력 생성물로 전환하기 위해 바이폴라 멤브레인 전기분해를 포함하는 전기화학 장치 및 방법에 대해 기재하고 있다. 일부 실시형태에서는 캐소드로서의 GDE, 자동 해리를 용이하게 하도록 구성된 바이폴라 멤브레 인, 및 액체 전해질 스타일 전극 또는 GDE로서 구성될 수 있는 애노드를 포함한다. 일부 실시형태에서, 전기화 학 장치는 기체 일산화탄소 또는 이산화탄소와 기체 산소의 다른 환원 생성물 또는 수소, 메탄 또는 메탄올과 같은, 탈분극기의 산화 생성물을 포함할 수 있는 출력 생성물을 생성하기 위해, 기체 이산화탄소 및 물을 포함 하는 입력 생성물을 이용하도록 설계된 CO2 전해조로서 구성될 수 있다. B. Endrodi 등(자세한 내용은 ACS Energy Lett. 2019, 4, pp. 1770-1777; https://doi.org/10.1021/acsenergylett.9b01142 참조)은 생성물 형성 속도 및/또는 전환 효율을 높이기 위해 단일 전기화학 스택(stack)에서 여러 전해조 셀을 적층할 수 있는 가능성에 대해 교시하고 있다. 물 또는 고온 수증기로 전해조 셀의 캐소드를 린스(rinse)하는 것은 전해조 셀 스택의 성능을 유지하기 위한 전략으로 제시되 고 있다. 또한, H형 전기화학 셀 및 미세유체 CO2 전해조에 대한 이전 연구는 CO2의 전기화학적 환원에서 알칼리 양이온의 촉진 효과를 입증하였다(자세한 내용은 J. Am. Chem. Soc. 2017, 139, pp. 11277-11287 참조). 이러한 효 과는 제로-갭 CO2 전해조에서 아직 관찰되거나 보고되지 않았으며, 그 이유는 아마도 이 경우 액체 캐소드액이 부족하기 때문일 것이다. 그러나 인용된 선행 기술 중 어느 것도, CO2 전해조가 오랜 시간 동안 연속적으로, 즉 손상되거나 막힌 GDE를 세정하거나 교체하는 유지 보수를 위한 주기적인 중단 없이, 작동될 때 발생하는, 위에서 언급한 문제에 대한 해결책을 제안하지 않고 있다. 유사하게, 탈이온수를 애노드액으로 사용하여 안정적(즉, 적어도 약 150 시간의 지속 시간)이고 높은 전류 밀도 (즉, 400 mA cm-2 이상)로 작동을 수행할 수 있는 이러한 CO2 전해조는 이전에 어느 것도 입증되지 않았다. 따라서, 중단 없이, 즉 상기 전해조를 분해할 필요 없이 연속적으로 작동하는 CO2 전해조의 유지보수를 수행할 수 있는 기술이 필요하다. 달리 말하면, CO2 가스 공급식 전해조의 전기화학적 성능 또는 전해조 성능을 유지하기 위해 작동 중인 CO2 전해조의 재생을 가능하게 하는 새로운 작동 공정 및 시스템이 필요하다. 따라서 탈이온수 또는 알칼리성 용액을, 특히 안정성과 전류 밀도 측면에서 애노드액으로 사용하는 현재의 CO2 가스 공급식 전해조의 전기화학적 성능 또는 전해조 성능을 향상시키는 기술이 또한 필요하다. 이에 비추어, 본 발명의 주요 목적은, 시간 경과에 따른 전해조 성능 손실 측면에서, 최신 CO2 가스 공급식 전 해조의 단점을 제거하거나 적어도 완화하는 데 있다. 본 발명의 다른 목적은 오랜 지속 시간에 걸쳐 중단 없이(예를 들어, 유지보수를 위해 전해조 셀(들)을 분해하 지 않고) 애노드액으로서 탈이온수 또는 알칼리성 용액을 사용하는 CO2 가스 공급식 전해조를 작동시키는 방법을 제공하는 데 있다. 본 발명의 또 다른 목적, 양태, 특징, 및 장점은 이하에서 설명될 것이다."}
{"patent_id": "10-2023-7005707", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에서는, CO2 가스 공급식 전해조에서 시간이 지남에 따라 캐소드 GDE의 기공을 형성하고 그것을 막는 침 전물의 화학적 동원은, CO2 전해조의 작동 중에 때때로, 바람직하게는 주기적으로 캐소드 GDE를 습윤화할 수 있 는 캐소드 격실에 재생제를 도입하여 캐소드의 재생을 수행함으로써 간단하게 향상될 수 있음을 알아냈다. 특히, 재생제는 재생될 전해조 셀 또는 셀 스택 내에서 사용되는 캐소드 GDE(들)에 대해 적절한 습윤 특성을 갖 는 액체 용매이다. 바람직하게는, 재생제는, 함께 혼합될 때, 재생될 전해조 셀 또는 셀 스택 내에서 사용된 캐 소드 GDE(들)에 대해 적절한 습윤 특성의 용매 혼합물을 형성하는 적어도 2종의 액체 용매의 혼합물 형태로 제 공된다. 습윤 능력의 결과로, 재생제는 GDE(들)의 기공으로 들어갈 수 있고, GDE(들)의 기공 구조를 파괴하지 않고 기공으로부터 침전물을 용해 및 배출할 수 있다. 특정 GDE에 대해 적절한 습윤 특성을 갖는 재생제를 얻기 위해, 다수의 용매 또는 이들의 혼합물이 사용될 수 있다. 특히, 아세톤, 아세토니트릴, 클로로포름, 디에틸 에테르, 디에틸렌 글리콜, 디메틸 포름아미드, 에틸 아 세테이트, 에틸렌 글리콜, 글리세롤, 테트라하이드로푸란, 크실렌, 물, 탈이온수, 메탄올, 에탄올, 1-프로판올, 2-프로판올, 1-부탄올, 2-부탄올, 펜탄올, 펜탄, 헥산, 헵탄, 시클로헥산은 재생될 GDE와 상용성이 있는 용매 혼합물을 형성하기 위해 단독으로 또는 조합하여 재생제로서 동등하게 사용될 수 있다. 사용할 재생제의 선택 (즉, 용매 혼합물의 경우 성분 및 성분 비율)은 관련 GDE의 습윤성에 따라 달라진다. GDE의 습윤성은 제조업체 의 사양으로부터 알려져 있거나 전해조를 조립하기 전에 측정될 수 있기 때문에, 재생제의 종류, 특히 전해조의 연속 작동 중에 후속 재생에 적용할 성분/조성을 결정하는 것은 숙련된 기술자의 일상적인 작업이다. 구체적인 예로서, 물은 탄소 기반 폴리테트라플루오로에틸렌(PTFE)를 함유하는 GDE(예를 들어, Sigracet 39BC, Freudenberg H23C6등 )에 PTFE의 소수성으로 인해 침투할 수 없으므로, 극성이 적은 재생제(예를 들어, 물/이소 프로판올 혼합물)을 사용할 필요가 있는 반면, 다공성 티타늄 프릿(frit)으로 형성된 GDE는 물이 GDE를 적절하 게 습윤화하기 때문에 물에 의해 재생될 수 있다. 적어도 약 1:3의 부피비를 갖는 2-프로판올(이소프로판올) 및 탈이온수(이하, 'DI 수'라 함)의 용매 혼합물이 특히 바람직하고; 상기 용매 혼합물에서 이소프로판올 비율이 높을수록, 용매 혼합물은 습윤 특성 면에서 탄소 기반 GDE에 대해 더 적합하고 상용성이 있다는 사실이 밝혀졌 다. 또한, 본 발명에서는, 특정 GDE 및 재생제의 경우, 전해조의 완전한 재생에는 단일 용매 또는 용매 혼합물 형태 의 일정량의 재생제가 필요하다는 사실도 알아냈다. 즉, 전해조를 재생하는 데 사용되는 재생제의 양을 이 양 이상으로 올리면, 예를 들어 더 이상 전환 효율이 향상되지 않는다. 특히, GDE 및 재생을 위해 선택되는 재생제 에 따라, 재생제의 최대량은 GDE(들)을 함유하는 전해조 셀 또는 셀 스택의 캐소드 격실의 빈 부피의 약 0.01 내지 1,000 배, 보다 바람직하게는 약 0.1 내지 100 배, 가장 바람직하게는 약 1 내지 50 배 범위이다. 이 부피 는, 예를 들어 적어도 실험적으로 결정될 수 있기 때문에, CO2 가스 공급식 전해조의 캐소드 GDE(들)의 1회 재생 주기에서 사용될 재생제의 양(부피)을 결정하는 것은 숙련된 기술자에게 일상적인 작업이다. 본 발명에서는, 제로-갭 CO2 가스 공급식 전해조에서 높은 반응 속도를 달성하기 위해서는, 알칼리성 전해질로 연속 작동하는 동안 분리 멤브레인을 통한 양이온 침투가 핵심이라는 것을 밝혀냈다. 본 발명에서는, 놀랍게도, 순수 탈이온수를 애노드액으로 하여 전해조를 계속 작동시키는 동안, 소량의 특히 알 칼리 및/또는 알칼리 토금속 용액(예를 들어, KOH, NaOH, CsOH 및 유사 화합물) 또는 기타 적절한 화합물을 전 해조 셀 또는 셀 스택의 캐소드 격실에 도입함으로써, CO2 환원율과 선택도가 모두 증가하고, 즉 전해조 성능이 향상된다. 증가 정도는 전해조 셀 또는 셀 스택의 캐소드 격실에 주입된 알칼리 또는 알칼리 토금속 용액으로 캐소드(들) 또는 오히려 캐소드 GDE(들)의 습윤성과 상관관계가 있다. 이하, \"전해조의 활성화\"라는 용어는 용 매 또는 용매 혼합물을 함유하는 전해질(또는 촉진제)을 캐소드 격실에 주입하는 공정을 지칭한다. 따라서, 본 발명에서는, 바람직하게는 전해조의 재생과 동시에 수행되는 캐소드 GDE의 주기적 활성화를 수행함으로써, 전해 조 성능이 수시로 증가될 수 있고, 즉 전해조 성능이 전해조 작동 중에 오랜 기간 동안 유지될 수 있음을 알아 냈다. 상기 활성화는 또한 전해조의 재생 전 또는 후에 수행될 수 있다. 촉진제는 액체 또는 가스 상태로 이용될 수 있다. 촉진제의 액상은 상기 촉진제를 액체 용매, 바람직하게는 재 생에 사용되는 용매 혼합물에 용해함으로써 얻어진다. 촉진제로서, NaCl, LiF, Li3PO4, Cs2CO3, Na2CO3, Li2CO3, K2CO3, Rb2CO3, CaSO4, NaNO3, K2SO4, KHCO3, NaHCO3, LiHCO3, CsHCO3, RbHCO3, RbOH, FrOH, NH3, CsOH, KOH, NaOH, Ca(OH)2, Ba(OH)2, Mg(OH)2, BaHCO3, Mg(HCO3)2, MgCO3, BaCO3, CaCO3, Sr(OH)2, SrCO3, Sr(HCO3)2 뿐만 아니라 이들의 임의의 혼합물의 그룹으로부터 선택된 임의 의 화합물은 재생을 위해 사용되는 액체 용매, 바람직하게는 용매 혼합물에 용해되어 사용될 수 있다. KOH, NaOH, CsOH의 화합물이 특히 바람직하다. 기상 촉진제로서, 사용된 촉매에 따라, 이소프로판올 증기, 에탄올 증기, 암모니아, N2H4, HCl, 이산화황, 아산 화질소 및 이들의 혼합물의 그룹으로부터 선택된 화합물이 사용될 수 있다. 또한 강한 극성의 기상 화합물도 촉 진제로 사용될 수 있다. 이러한 촉진제는 촉매 층에 대한 특정 흡착을 기반으로 작용하여 전자 및 흡착 특성을 변경한다. 전해조 셀 또는 셀 스택에서 발생하는 전기화학 반응의 화학양론과 AEM의 화학적 특성으로 인해, pH는 캐소드 격실에서 항상 알칼리성이다. 본 발명에서는, 놀랍게도, 위에서 언급한 알칼리성 촉진제 외에도, 중성 및 심지 어 산성 화합물을 사용하여 활성화를 수행할 수 있음을 밝혀냈다. 이러한 관찰에서는, 촉진제의 화학적 성질이 용액의 pH보다 더 중요하다는 것과 이론에 얽매이지 않고 GDE의 활성화를 위한 언급된 기상 촉진제의 적용 가능 성을 설명할 수도 있음을 확인하였다. 또한, 본 발명에서는, 특정 GDE 및 촉진제의 경우, 전해조를 완전히 활성화하려면 촉진제의 특정 농도가 필요하 다는 사실도 밝혀냈다. 즉, 캐소드 GDE의 활성화에 사용되는 촉진제의 농도를 이 농도 이상으로 올리면, 예를 들어 더 이상의 향상된 전환 효율이 측정되지 않는다. GDE 및 활성화를 위해 선택된 촉진제에 따라, 촉진제의 최대 농도는 약 0.001 내지 5 mol.dm-3, 더 바람직하게는 약 0.01 내지 3 mol.dm-3, 가장 바람직하게는 0.1 내지 1 mol.dm-3이다. 또한, 본 발명에서는, 전해조 셀에 주입된 알칼리 및/또는 알칼리 토금속 용액에 존재하는 양이온(또는 촉진 제)의 흡착, 즉 캐소드 GDE의 촉매 상의 전기 흡착이 CO2의 지속적인 전해 전환 중에 캐소드의 적절한 기능을 유지하는 것뿐만 아니라 적절한 기능을 돕는다는 사실을 밝혀냈다. CO2 가스 공급식 전해조는, 작동 시, 전기화 학적으로 분극되기 때문에, 이러한 경우 전기흡착이 증가한다. 그럼에도 불구하고, 촉진제의 흡착은 CO2 전해조 가 작동하지 않을 때에도 발생한다(미미한 정도로). 따라서 활성화는 유지 보수 기간 중에, 즉 전해조가 어떻든 작동하지 않을 때 수행될 수 있다. 이러한 발견으로 인해, 공정의 정밀화를 가능하게 하고, 의심할 여지 없이 기체 CO2의 연속적인 전해 전환 공정 의 작동 복잡성과 비용을 줄여 산업적 구현을 가속화하는 활성화 용액을 주기적으로 주입하여 애노드액으로서 탈이온수를 사용하여 제로-갭 또는 비-제로 갭 전해조 셀 또는 셀 스택으로 구성된 CO2 가스 공급식 전해조를 작 동하기 위한 시스템을 설계할 수 있다. 특히, 상기 목적은, 청구항 1에 따라, 연속적으로 작동되는 CO2 가스 공급식 전해조의 성능을 향상시키는 공정에 의해 달성된다. 전해조 성능을 향상시키기 위한 공정의 더욱 바람직한 변형은 청구항 2 내지 12에 제시되어 있 다. 상기 목적은 청구항 13에 따라, 연속적으로 작동되는 CO2 가스 공급식 전해조의 성능을 유지하는 공정에 의 해 추가로 달성된다. 전해조 성능을 유지하기 위한 공정의 바람직한 변형은 청구항 13 내지 18에 제시되어 있다. 또한, 상기 목적은 청구항 19에 따라 연속적으로 작동되는 CO2 가스 공급식 전해조 셀의 전해조 성능을 향상시키고 유지하기 위한 시스템에 의해 추가로 달성된다. 본 발명에 따른 시스템의 바람직한 추가 실시형태는 청구항 20 내지 31에 의해 규정된다. 여기서, 상기 활성화 공정은, 가장 중요한 작동 파라미터만 언급하면, 압력, 온도, 전류/전압 값, 생성물 선택 성, 유속, 습도, 생성물 구성 등의 측면에서 전해조 성능을 연속적으로 모니터링하고 평가하기 위해, 다중 센서 를 통해 획득한 측정 데이터를 기반으로 필요에 따라 주어진 시간 간격으로 인간 작업자에 의해 수시로 수행될 수 있다는 점에 유의해야 한다. 선택적으로, 상기 시간 간격은 또한, 최적의 작동이 핵심 특징이 아닌 경우, 미 리 설정된 간격일 수 있다. 그러나 바람직하게 활성화 공정은 자동화 방식으로 수행된다. 이를 위해, CO2 전해조 작동을 담당하는 시스템에 는, 예를 들어 전해조 성능을 연속적으로 모니터링하고 평가하는 여러 센서로부터 수신한 데이터에 비추어 활성 화 필요성에 대한 결정을 할 수 있는 인공 지능 서브유닛으로서 구현되거나 그로 설치된 처리 및 제어 유닛이 장착된다. 따라서 압력, 온도, 전류/전압 값, 생성물 선택성, 유속, 생성물 조성(또는 이들의 조합) 측면에서 특정 기준에 도달하면, 활성화 공정이 시작되고 자동으로 수행된다. 마찬가지로, 전해조 셀의 재생도 상기 처리 및 제어 유닛의 감시 하에 발생할 수 있다. 이하의 설명 및 상세하게 논의된 실시예로부터 명백한 바와 같이, 본 발명에 따른 활성화 공정은, 오랜 시간 동 안 유지 보수 필요 및 따라서 중단 없이, 애노드(즉, 애노드액으로서)에서 탈이온수 공급물을 갖는 CO2 가스 공 급식 전해조의 작동을 가능하게 하고, 전체 기술을 단순화하는 동시에 더욱 환경적으로 지속 가능하게 한다."}
{"patent_id": "10-2023-7005707", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 1, "content": "도 1a는 기체 CO2를 다른 생성물로 전환하기 위한 제로-갭 전해조 셀의 가능한 실시형태를 개략적으로 예 시한다. 상기 전해조 셀은, 아래로부터 위로, 적어도 일 측에 유체 유입구(5a) 및 유체 배출구(5b)가 있고 타 측에는 유동 패턴(10')이 형성된 적어도 애노드 집전체, 일 측에 촉매 층(미도시)을 갖는 애노드 전극 , 상기 촉매 층과 직접 접촉하는 멤브레인, 일 측에 멤브레인과 직접 접촉하는 캐소드 촉매 층(미도시), 타 측에 캐소드 전극, 및 가스 유동 패턴(6')이 일 측에 형성(캐소드 전극과 직접 접촉)된 캐소드 집전체를 포함하고, 상기 가스 유입구(5a')와 배출구(5b')는 타 측에 형성된다. 숙련된 기술자에게 분명한 바와 같이, 각각의 애노드 전극 및 캐소드 전극은 가스 확산 전극(각각의 촉매 층을 가짐)의 형태 로 제공될 수 있다. 상기 전해조 셀은 또한 다수의 전해조 층(셀)으로 이루어진 전해조 셀 스택으로서 구 성될 수 있다. 이 경우 다중 전해조 층은 애노드, 애노드 촉매, 멤브레인, 캐소드 촉매 및 캐소드 요소를 반복 하여 층이 서로 적층되어 있다. 인접한 층들 사이에는, 바람직하게는 일 측에서 애노드로 작용하고 타 측에서는 캐소드로 작용하는 바이폴라 플레이트가 사용된다. 이러한 바이폴라 플레이트는 문헌에 알려져 있다. 도 1b는 기체 CO2를 다른 생성물로 전환하기 위한 비-제로 갭 전해조 셀(100')의 가능한 실시형태를 개략적으로 예시한다. 상기 전해조(100')는, 아래로부터 위로, 애노드 집전체, 촉매 층을 갖는 애노드 전극, 유입구 (5a) 및 배출구(5b)를 갖는 애노드액 유동 채널, 멤브레인, 유입구(5a\") 및 배출구(5b\")를 갖는 캐소드액 유동 채널, 멤브레인과 마주보는 캐소드 촉매 층(미도시), 상기 캐소드 촉매 층을 지지하는 캐소드 전극 , 유입구(5a') 및 배출구(5b')를 갖는 기체 CO2용 가스 채널, 및 캐소드 집전체 을 포함한다. 선택적 으로, 단일 전해질 용액은, 애노드액 유동 채널, 멤브레인 및 캐소드액 유동 채널을 대체하여, 애노드 촉매 층과 캐소드 촉매 층을 분리하는 데 사용될 수 있다. 각 채널에는 적어도 하나의 유입구와 적어도 하나의 배출구가 있다. 숙련된 기술자에게 분명한 바와 같이, 각각의 애노드 전극 및 캐소드 전극은 가스 확산 전극(각각의 촉매 층을 가짐)의 형태로 제공될 수 있다. 상기 전해조 셀(100')은 또한 다수의 전해조 셀로 이루 어진 전해조 셀 스택으로 구성될 수 있다. 이 경우, 여러 전해조 셀은, 애노드, 애노드 촉매, 애노드액, 멤브레 인, 캐소드액, 캐소드 촉매, 캐소드 및 가스 채널, 및 캐소드 요소가 반복하여, 서로 적층되어 있다. 전해조 셀(100, 100')에 적용되는 애노드 집전체, 캐소드 집전체, 애노드 전극, 캐소드 전극, 촉 매 및 유동 채널(2,3,4) 및 유동 패턴(6',10') 뿐만 아니라 그 기능과 가능한 설계는 문헌에 동일하게 알려져 있다. 또한, 멤브레인은, 예를 들어 몇 가지만 언급하면, Fumasep, Selemion, PiperION 및 Sustainion이란 상품명 으로 구입할 수 있는 음이온 교환 멤브레인이며, 이는 작동 중에 전기분해 셀(100, 100')의 캐소드 측과 애노드 측 사이에서 그 벌크를 통해 음이온(예를 들어, OH-, HCO3- 및 CO32- 이온; 전하)의 이동을 가능하게 하는 반면, 상기 셀(100, 100')을 통해 애노드 측으로부터 캐소드 측으로 확산하는 물(H2O)은 캐소드 측에서 CO2의 전해적환원에 참여한다. 이 경우에, 어떤 전자도 멤브레인을 통해 수송되지 않기 때문에, 상기 멤브레인은 셀 (100, 100')의 캐소드 측과 애노드 측 사이에서 실제로 이온 전도체로서 작용한다. 이하에서는, 기체 CO2를 본 발명에 따른 생성물 스트림으로의 연속 전해 전환 중에 전해조 셀의 전해조 성능을 향상 및 유지하기 위한 시스템의 작동뿐만 아니라 그의 일부 바람직한 실시형태를 상세히 설명한다. 여기서, 두 가지 유형의 셀 작동 사이에는 약간의 차이가 있고 숙련된 기술자에게 분명하지만, 제로-갭 전해조 셀과 비-제 로 갭 전해조 셀이 함께 설명되며, 예를 들어, 비-제로 갭 전해조 셀의 경우, 이용되는 액체 캐소드액은 셀을 통해 흐른다. 적절한 경우 차이점도 간략하게 설명한다. 도 2는, 예를 들어 보수 유지를 위해 정지하지 않고 오랜 시간 동안 연속식으로, 애노드액으로서 0 내지 3 M의 알칼리 농도를 갖는 알칼리성 애노드액(역시 DI 수 포함)을 사용하고, 고 전류 밀도에서의 전기분해에 의해 추 후 이용을 위해 기체 CO2를 하나 이상의 생성물로 전환하기 위해, CO2 가스 공급식 제로-갭 전해조 셀 및 비-제로 갭 전해조 셀(100') 모두와 함께 사용될 수 있는 시스템의 가능한 실시형태를 예시한다. 이를 위 해, 상기 시스템은 셀(100, 100')의 전통적인 작동을 위한 제어 서브시스템 및 때때로 필요에 따라 셀(100, 100')의 캐소드의 재생 및/또는 활성화를 수행하기 위한 재생/활성화 서브시스템을 포함한다. 제 어 서브시스템 및 재생/활성화 서브시스템은 서로 작동 가능하게 결합되어 있다. 제어 서브시스템의 일부로서, CO2 공급원은 셀(100, 100')에서 일어나는 전환을 위한 CO2 공급원료를 제공한다. 상기 CO2 공급원은 적합한 재료, 예를 들어 스테인레스강으로 제조된 배관을 통해 셀(100, 100')의 캐소드 측의 유입구(예를 들어, 도 1a의 유입구(5a') 또는 도 1b의 유입구(5a'))에 연결된다. 상기 CO2 공급원은 캐소드 측 순환 어셈블리를 형성하기 위해 CO2 공급원료의 정확한 계량 및 분배를 보장하기 위해 제어식 분배 밸브(미도시)를 구비할 수 있다. 선택적으로, 가습기(도 2에 미도시)는 주어진 양의 수증기를 CO2 공급원료에 첨가/혼합하기 위해 배관에 삽입될 수 있다. 셀(100, 100') 내에서 전기분해를 통해 CO2로부터 생성된 기체 생성물은, 소비되지 않은 CO2를 함유할 수도 있는 혼합물로서 셀(100, 100')의 캐소드 측의 적절한 배출구(예를 들어, 도 1a의 배출구(5b') 또는 도 1b의 배출구(5b'))를 통해, 적절한 재료, 이를테면 스테인리스 강으로 제조된 배관으로 배출된다. 상기 배관은 셀(100, 100')로부터 다양한 분석기 유닛, 예를 들어 (가스)유량 측정 유닛 및/또는 (가스)조성 측정 유닛으로 생성물을 수송한다. 유량 측정 유닛은 전해조 셀(100, 100')을 떠나는 생성물의 (기체)혼합물의 유속을 측정한다. 숙련된 기술자에게 명백한 바와 같 이, 임의의 종류의 (기체)유량계가 여기에 적용될 수 있다. 조성 측정 유닛은 전해조 셀(100, 100')을 떠 나는 생성물의 (기체)혼합물의 조성을 측정 및 결정한다. 숙련된 기술자에게 명백한 바와 같이, 어떤 종류의 조 성 측정 장치도 적용될 수 있다. 제1 센서 세트는 전해조 셀(100, 100')로 유입되기 전에 CO2 공급원료의 다양한 파라미터를 측정하기 위해 전해조 셀(100, 100') 상향류의 배관을 따라 배열된다. 상기 제1 센서 세트는 적어도 하나의 압력 게 이지, 적어도 하나의 온도 센서를 포함하고, 선택적으로 예를 들어 CO2 공급원료가 가습되어 수증기를 함유하는 경우 적어도 하나의 수분 센서를 포함한다. 제2 센서 세트(210\")는 전해조 셀(100, 100')을 떠나는 생성물(들)의 다양한 파라미터를 측정하기 위해 전해조 셀(100, 100') 하향류의 배관을 따라 배열된다. 상기 제2 센서 세트(210\")는 적어도 하나의 압력 게이지, 적어도 하나의 온도 게이지, 적어도 하나의 수분 센서, 및 적어도 하나의 pH 센서를 포함한다. 상기 제2 센서 세트(210\")는 셀(100, 100')의 배출구(예를 들어, 도 1a의 배출구(5b') 또는 도 1b의 출구(5b', 5b\"))와 적용 된 분석기 유닛의 유입구 사이에 우선적으로 배치된다. 제어 서브시스템의 일부로서, 애노드액을 함유하는 액체 탱크는 적절한 재료, 예를 들어 스테인 레스 강으로 제조된 배관을 통해 셀(100, 100')의 애노드 측 유입구(예를 들어, 도 1a의 유입구(5a) 또는 도 1b의 유입구(5a))와 유체 연통하여 애노드 측 순환 어셈블리를 형성한다. 애노드 측과 액체 탱크 사이 의 셀(100, 100')의 애노드 측에 폐쇄된 연속 유동 경로를 형성하기 위해, 전해조 셀(100, 100')의 애노드 측의 배출구(예를 들어, 도 1a의 유입구(5b) 또는 도 1b의 유입구(5b))는 또한 적합한 재료, 예를 들어 스테인리스 강으로 제조된 배관을 통해 상기 액체 탱크와 유체 연통된다. 폐쇄된 유동 경로를 통해, 애노드액 은 펌프에 의해 애노드 측과 액체 탱크 사이에서, 애노드 자체에 형성된 유체 채널의 적절한 시 스템을 통해 순환되어, 셀(100, 100') 내의 애노드 측에서의 전기화학 반응(들)에서 손상되는 애노드액을리프레싱(refresh)한다(필요한 경우). 상기 펌프는 바람직하게는 배관에 삽입된다. 비-제로 갭 CO2 전해조 셀(100')을 사용하는 경우, 전해질 용기, 전해질 용액, 펌프 및 배관의 추가 세트가, 바 람직하게는 캐소드 측 순환 어셈블리의 일부로서 적용되어(미도시), 셀(100') 내의 캐소드액을, 마찬가지로 시 스템 내의 애노드액, 펌프 및 배관으로 순환시킨다. 이러한 일련의 추가 수단의 실제 구현 은 숙련된 기술자의 일상적인 작업으로 간주되고 및/또는 문헌에서 찾을 수 있다. 바람직하게는, 애노드액은 순수한 DI 수이지만, 문헌에 따라 CO2 전해조에 사용하기에 적합한 모든 종류의 알칼리성 애노드액일 수 있다. 특히, 애노드액은 알칼리 농도가 0 내지 3M인 알칼리성 액체인 것이 바람직하다. 또한, 숙련된 기술자에게 공지된 바와 같이, 사용되는 애노드액의 유형은 음이온 교환 멤브레인의 유형 및 전해조 셀(100, 100') 자체에 적용된 촉매에 따라 달라진다. 제어 서브시스템의 일부로서, 처리 및 제어 유닛(도 2에 도시되지 않음)이 또한 제공된다. 처리 및 제어 유닛은 센서의 상기 제1 센서 세트 및 센서의 상기 제2 센서 세트(210\") 내의 임의의 센서 요소뿐만 아니 라 임의의 분석기 유닛, 즉 유량 측정 유닛 및 조성 측정 유닛과 연결되어(예를 들어, 전기적으로), 수동 또는 자동 방식으로(이후에 설명) 상기 시스템에 결합된 전해조 셀(100, 100')의 작동을 제어하기 위 해, 시스템에서 측정된 다양한 물리적 및 화학적 파라미터의 측정값을 나타내는 신호(예를 들어, 전기적 신호)를 수신한다. 숙련된 기술자에게 또한 명백한 바와 같이, 시스템은 또한 전해조 셀(100, 100')에 에너지를 공급하기 위 해 적절한 전력 공급 장치(미도시)를 포함한다. 이를 위해, 전해조 셀(100, 100')을 극성화하기 위해, 전력 공 급 장치의 네거티브 폴(pole)은 상기 셀(100, 100')의 캐소드 측과 전기적으로 연결되는 반면, 전력 공급 장치 의 포지티브 폴은 셀(100, 100')의 애노드 측과 전기적으로 연결된다. 전력 공급 장치는 그리드 자체이거나 로 컬 전기 소스(예를 들어, 태양열, 풍력, 원자력)일 수 있다. 배터리는 일회용이든 보조 배터리이든 전원 공급 장치로 동일하게 사용될 수 있다. 필요한 경우, 상기 전력 공급 장치는 또한 상기 펌프뿐만 아니라 처리 및 제어 유닛에 에너지를 공급한다. 또한, 재생/활성화 서브시스템의 일부로서, 촉진제 탱크, 적어도 제1 용매 탱크, 및 제2 용매 탱크가 제공된다. 상기 촉진제 탱크는 기상 또는 액상의 촉진제를 함유한다. 상기 제1 용매 탱 크는 제1 액체 용매를 함유하고, 상기 제2 용매 탱크는 바람직하게는 상기 제1 용매와 상 이한 제2 액체 용매를 함유한다. 다른 촉진제 물질과 우선적으로 다른 가능한 추가 촉진제 물질을 각각 함 유하는 추가 촉진제 탱크도 제공될 수 있다. 다른 용매와 우선적으로 다른 가능한 추가 용매를 각각 함유하는 추가 용매 탱크도 제공될 수 있다. 선택적으로, 재생/활성화를 위해 용매 혼합물 대신 단지 하나의 용매가 사용 되는 경우, 제1 및 제2 용매 탱크(240, 245)뿐만 아니라 상기 추가 용매 탱크는 단일 용매 탱크로 대체될 수 있 다. 그러나 다음에서 이러한 목적을 위해 적어도 2개의 상이한 용매를 사용하는 시스템의 이러한 실시형태 가 상세히 설명된다. 상기 모든 탱크, 즉 촉진제 탱크, 제1 용매 탱크, 제2 용매 탱크 뿐만 아니라 임의의 다른 촉진 제 탱크 및 용매 탱크는, 존재하는 경우, 숙련된 기술자에 의해 알려진 적절한 밸브를 통해 혼합 탱크와 유체 연통된다. 혼합 탱크는 제어된 양의 상기 용매(241, 246) 뿐만 아니라 선택적으로 적어도 하나의 촉 진제를 수용하고 혼합하여, 선택적으로 촉진제 물질도 포함하는 용매 혼합물을 형성할 수 있다. 상기 혼합 탱크는 적합한 재료, 예를 들어 스테인리스 강으로 제조된 배관을 통해 셀(100, 100')의 캐소드 측의 유입구(예를 들어, 도 1a의 유입구(5a') 또는 도 1b의 유입구(5a'))와 유체 연통된다. 바람직하게는, 제어된 분 배 밸브(도 2에 예시되지 않음)는 유체 흐름의 양, 즉 전해조 셀(100, 100')의 상기 유입구로 공급되거나 주입 되는 촉진제 물질과의 용매 혼합물의 양을 제어하기 위해 배관에 삽입된다. 모든 밸브는 처리 및 제어 유 닛을 완전히 제어하기 위해 처리 및 제어 유닛과 작동 가능하게 결합되어 있다. 임의의 제1, 제2 및 추가 용매 탱크(240, 245)에 함유된 용매(241, 246)는 아세톤, 아세토니트릴, 클로로포름, 디에틸 에테르, 디에틸렌 글리콜, 디메틸포름아미드, 에틸 아세테이트, 에틸렌 글리콜, 글리세롤, 테트라하이드 로푸란, 크실렌, 물, DI 수, 메탄올, 에탄올, 1-프로판올, 2-프로판올, 1-부탄올, 2-부탄올, 펜탄올, 펜탄, 헥 산, 헵탄, 시클로헥산, 및 더 높은 온도에서 이들의 증기 및 임의의 유사한 화합물로 구성된 그룹에서 선택된다. 또한, 기체 용매, 즉 이를테면 HCl, HBr, SO2, NH3 등의 알칼리성 또는 산성 증기는 시스템에서 약간의 사소한 수정과 함께 동일하게 사용될 수 있다.촉진제 탱크(들)에 함유된 액상(즉, 용해된) 촉진제(들)는 NaCl, LiF, Li3PO4, Cs2CO3, Na2CO3, Li2CO3, K2CO3, Rb2CO3, CaSO4, NaNO3, K2SO4, KHCO3, NaHCO3, LiHCO3, CsHCO3, RbHCO3, RbOH, FrOH, NH3, CsOH, KOH, NaOH, Ca(OH)2, Ba(OH)2, Mg(OH)2, BaHCO3, Mg(HCO3)2, MgCO3, BaCO3, CaCO3, Sr(OH)2, SrCO3, Sr(HCO3)2 뿐만 아 니라 이들의 임의의 혼합물로 이루어진 그룹으로부터 선택된다. 또한 숙련된 기술자에게 명백한 바와 같이, 촉 진제는 고체 물질로도 제공될 수 있다. 이러한 경우, 상기 액상 촉진제를 얻기 위해서는, 먼저 고체 촉진 제를 적합한 용매에 용해하여야 한다. 촉진제 탱크(들)에 함유된 기상 촉진제(들)는 이소프로판올 증기, 에탄올 증기, 암모니아, N2H4, HCl, 이산 화황, 아산화질소 뿐만 아니라 혼합 또는 함께 혼합될 때 성분들이 서로 반응하지 않는 이들의 임의의 혼합물로 구성된 그룹으로부터 선택된다. 작동 시, 시스템의 CO2 공급원에 의해 공급되는 이산화탄소는 CO2 가스 공급식 전해조 셀(100, 10 0')의 캐소드 측으로 공급된다. 제시된 CO2 전해조 시스템에서, 생성물은 상기 셀(100, 100')에서 일어나 는 전기분해 반응에서 형성된다. 셀(100, 100') 내에서 사용되는 촉매와 적용된 CO2 전기분해 반응 조건에 따라 다양한 생성물이 얻어진다: 여기서 망라적인 예로서 (i) 합성가스(조성이 조절된 CO/H2 혼합물), (ii) 메탄, (iii) 에틸렌, (iv) 메탄올, 및 (v) 에탄올이 언급된다. 캐소드 부분에서 형성되는 생성물은 셀(100, 100')을 떠난 후, 생성물 분석기 유닛, 즉 유량 측정 유닛으로 도입된 다음, 조성 측정 장치로 도입되어 생성 물 유량 및 생성물 조성을 결정한다. 측정된 데이터에 기초하여, 셀(100, 100') 내에서 진행되는 전기분해 공정 의 물질 균형이 결정될 수 있고, 전환 공정을 제어/조절하기 위해 사용될 수 있다. 애노드액은 펌프 에 의해 셀(100, 100')의 애노드 측으로 직접 연속적으로 공급된다. 상기 애노드액은 셀(100, 100')의 애 노드 측을 통해 흐르고, 그 경로를 따라 전기분해 반응에서 형성되는 기체 산소를 수집한다. 애노드액의 스트림이 셀(100, 100')을 떠나 상기 셀로 재순환되기 전에, 그 산소 함량이 바람직하게 방출된다. 특히, 숙련된 기술자에게 분명한 바와 같이, 다른 부가가치 애노드 공정(물의 산화 외에, 예를 들어 염소 형성 또는 알코올 산화)을 CO2 전환에 조합시킬 수 있다. 상기 시스템/셀(100, 100')의 아키텍처(architecture)는 물 의 산화에 전혀 국한되지 않는다. 또한, 시스템의 작동 중에, CO2 공급원료 및 생성물의 다양한 물리적 파 라미터(예를 들어, 압력, 온도, 습도 등)가 측정되거나, 또는 측정된 데이터에 대한 응답으로서 전해조 셀(100, 100\")이 원활하고 원하는 대로 작동하도록 상기 밸브를 작동시키는 처리 및 제어 유닛을 통해 제1 및 제2 센서 세트(210, 210\")에 의해 모니터링된다. 작동 파라미터는 숙련된 기술자에게 알려져 있지만, 상기 제어/조절의 구현은 일상적인 작업으로 간주된다. 여기서, 애노드액으로는 알칼리 농도가 0 내지 3M인 알칼리성 애노드액이 사용된다(순수 DI 수를 사용하는 경우도 포함). 알칼리성 애노드액을 사용하는 경우, 본 발명의 개념과 조화를 이루며 시스템과 함께 사용되는 CO2 가스 공급식 전해조 셀(100, 100')의 오랜 기능 기간을 달성하기 위해(이와 관련하여 실시예 3 및 도 6 참조), 셀(100, 100')의 캐소드 측은, 침전물 형성으로 인한 막힘을 방지하도록, 셀(100, 100')의 캐소드 에 인접하게 위치한 캐소드 격실을 재생제, 즉 적절한 용매 또는 혼합 탱크에서 제조된 적어도 2개의 상이 한 용매(241, 246)의 용매 혼합물로 때때로 플러싱함으로써 재생된다. 상기 재생은 수동으로 또는 센서 세트 (210, 210\")에 의해 측정된 파라미터 값에 기초하여 자동 방식으로 바람직하게는 주기적으로 수행된다. 상기 재 생은 처리 및 제어 유닛의 완전한 제어 하에 혼합 탱크로부터 상기 자동화된 밸브에 의해 셀(100, 100')의 유입구(예를 들어, 도 1a의 유입구(5a') 또는 도 1b의 유입구(5a'))로 CO2를 공급함과 동시에 수행된다. 따라서, 그의 재생을 위해 전해조 셀(100, 100')을 정지시키거나 중단할 필요가 없다. 또한, 발명의 개념과 조화를 이루며, 전해조 성능을 향상(이와 관련하여, 예를 들어, 실시예 4 내지 10 참조)시 키고 및/또는 시스템과 함께 사용되는 CO2 가스 공급 전해조 셀(100, 100')의 기능 기간을 추가로 연장(예 를 들어, 실시예 7 참조)하기 위해서, 셀(100, 100')의 캐소드 측은 적절한 전해질, 즉 적어도 하나의 촉진제 를 촉진제 탱크로부터 셀(100, 100')의 캐소드에 인접하게 위치된 캐소드 격실로 때때로 주입함으로 써 활성화된다. 상기 활성화는 수동으로 또는 센서 세트(210, 210\")에 의해 측정된 파라미터 값에 기초하여 자 동화된 방식으로 바람직하게는 주기적으로 수행된다. 바람직하게는, 활성화는 재생과 동시에 수행된다. 즉, 적 어도 하나의 촉진제는 함께 혼합된 상기 적어도 두 개의 용매(241, 246)와 함께 혼합 탱크에 분배되 고, 이렇게 얻어진 촉진제(들)을 함유하는 용매 혼합물은 처리 및 제어 장치의 제어 하에 자동화 밸브에 의해셀(100, 100')의 유입구를 통해 혼합 탱크로부터 캐소드 격실로 주입된다. 따라서, 활성화를 위해 전해조 셀(100, 100')을 중지하거나 중단할 필요도 없다. 숙련된 기술자에게 명백한 바와 같이, 기상 촉진제는 자연적 으로 약간의 사소한 변경과 함께 유사한 일련의 단계에서 활성화를 위해 사용될 수 있다. 활성화는 재생과 별도로 수행될 수도 있다. 특히 순수 DI 수를 애노드액으로 사용하는 경우, 재생 주기를 간단히 생략할 수 있다. 그러한 경우에, 처리 및 제어 유닛의 제어 하에, 액체 또는 기체의 적어도 하나의 촉진 제만이 자동화 밸브에 의해 캐소드 격실로 주입된다. 필요한 경우, 용매 탱크 중 하나, 예를 들어, 제3 용 매 탱크(도 2에 예시되지 않음)는 농도를 조절하기 위해 촉진제를 위한 적합한 추가 용매를 함유하는데 사 용될 수 있다. 실제로, 시스템에 사용되는 전해조 셀(100, 100'), 특히 캐소드 측 GDE에 따라, 셀(100, 100')의 활성화는 특정 농도의 촉진제를 필요로 한다. 즉, 캐소드 GDE를 활성화하는 데 사용되는 촉진제의 농도를 이 농도 이상으로 올리면, 셀(100, 100')의 전해조 성능이 더 이상 향상되지 않는다. GDE 및 촉진제에 따라, 촉진제의 최대 농도는 약 0.001 내지 5 mol.dm-3, 보다 바람직하게는 약 0.01 내지 3 mol.dm-3, 가장 바람 직하게는 0.1 내지 1 mol.dm-3이고, 이는 상기 제3 용매 탱크에 용매를 적용함으로써 쉽게 얻어질 수 있다. 시스템에서 전해조 셀(100, 100')을 활성화하기 위해, 촉진제로서 KOH, NaOH, CsOH를 사용하는 것이 특히 바람직하다. 전술한 바와 같이, 전해조 셀(100, 100')의 재생 및/또는 활성화는, 셀(100, 100')이 작동 중일 때, 즉 극성일 때 수행된다. 그러나 숙련된 기술자에게도 명백한 바와 같이, 상기 재생 및/또는 활성화는 셀(100, 100')의 스 위치 오프 상태에서도 본 발명에 따른 시스템에 의해 수행될 수 있다. 도 3은, 예를 들어 보수 유지를 위해 정지하지 않고 오랜 시간 동안 애노드액으로서 0 내지 3 M의 알칼리 농도 를 갖는 애노드액을 사용하고 연속식으로, 고 전류밀도에서의 전기분해에 의해, 추후 이용을 위해 기체 CO2를 하 나 이상의 생성물로 전환하도록, CO2 가스 공급식 제로-갭 전해조 셀 및 비-제로 갭 전해조 셀(100')과 함 께 사용될 수 있는 시스템의 가능한 추가 실시형태를 예시한다. 도 3에서, 시스템의 특정 구성요소는 도 2에 도시된 시스템의 구성요소에 대응하고, 따라서 동일한 참조 번호로 표시된다. 그럼에도 불구하고, 시스템은 시스템에서 연속적으로 모니터링되는 작동 파라미터에 비추어 필요에 따라 때때로 재생 및/ 또는 활성화와 함께 전해조 셀(100, 100')의 완전 자동 작동을 가능하게 하는 일부 추가 유닛을 포함한다. 특히, 시스템의 가능한 실시형태에서, 템퍼링된(tempered) 가습기는 CO2 공급원과 전해조 셀 (100, 100') 사이의 배관 내부로 삽입되어 CO2 공급원료의 수증기 함량을 제어 및 조정함으로써 전기분해 를 위해 가습된 CO2 공급원료를 제공한다. 기체 CO2 내 수분 함량의 자동 모니터링은, 가습기와 전해조 셀 (100, 100') 사이에 배치된 수분 센서를 포함하는 제3 센서 세트(210')에 의해 지원된다. 제3 센서 세트(210') 는 가습기의 하향류 및 전해조 셀(100, 100')의 상향류에 배관을 따라 배치된다. 상기 제3 센서 세트 (210')의 각 센서 요소는 작동 중인 시스템에 대한 추가 측정 데이터를 제공하기 위해 처리 및 제어 유닛 과 전기적으로 연결된다. 본 발명의 목적을 위해, 숙련된 기술자에게 명백한 바와 같이, 임의의 종류의 가습기 가 적용 가능하다. 특정 예로서, Cellkraft AB(스웨덴), PermaPure(미국) 또는 Fumatech GmbH(독일)의 멤브레 인 가습기 또는 유사한 가습기가 사용될 수 있다. 시스템의 또 다른 가능한 실시형태에서, 재생/활성화 서브시스템(202')은, 배관에 내장된 주입 루프 를 통해, 전해조 셀(100, 100')의 캐소드 측의 유입구(예를 들어, 도 1a의 유입구(5a') 또는 도 1b의 유입 구(5a'))와 유체 연통한다. 여기서, 자동화 밸브는 각각의 탱크(230, 240, 245)로부터의 활성화/재생 화합 물로 주입 루프를 채우는 데 사용되며, 따라서 혼합 탱크가 필요하지 않다. 활성화/재생 화합물은 추가 자 동화 밸브의 제어된 개폐에 의해 주입 루프로부터 배관의 CO2 스트림으로 주입될 수 있다. 밸브 (327, 328)는 처리 및 제어 유닛(또한 제어 서브시스템의 일부; 도 3에 도시되지 않음)에 의해 작동된다. 주입된 혼합물의 임의의 온도, 조성 및 pH는 모두 제3 센서 세트(210')에도 제공된 각각의 센서 요소에 의해 연 속적으로 모니터링 및 제어된다. 시스템의 또 다른 가능한 실시형태에서, 활성화를 수행한 후에 전해조 셀(100, 100')을 통과한 촉진제를 회수하기 위해 촉진제 재순환 서브시스템이 또한 제공된다. 촉진제 재순환 서브시스템은, 촉진제 탱 크를 연결하는 배관과, 상기 처리 및 제어 유닛과 전기적으로 연결된 적절한 자동화 밸브를 통해, 전해조 셀(100, 100')의 배출구(예를 들어, 도 1a의 배출구(5b') 또는 도 1b의 배출구(5b',5b\")와 생성물 분석기 유닛(여기서, 예를 들어 유량 측정 유닛의 것)의 유입구 사이에 배치된 배관의 섹션으로 구성된다. 배관과 배관의 상기 섹션 사이에 선택적인 유동 연결을 제공하는 밸브는 바람직하게는 3-경로 제어 밸브이다. 배관과 촉진제 탱크 사이의 흐름 연결을 제공하는 밸브는 양방향 밸브인 것이 바람직하다. 밸브들(322, 321) 사이에는, 분리된 촉진제를 정화하는 정제 유닛과 셀(100, 100')로부터 나 오는 기상과 액상(촉진제 함유)을 분리하는 액체/가스 분리막 유닛이 배관에 삽입된다. 촉진제 재순환 서브시스템은 재생/활성화 서브시스템(202')과 동시에 작동을 시작하며, 이는 촉진제를 전 해조 셀(100, 100')에 주입하고, 상기 셀(100, 100')를 통과한 후 촉진제 재순환 서브시스템에 의해 생성 물 스트림으로부터 분리된다. 정제된 촉진제는 활성화/재생 서브시스템(202')의 촉진제 유체 탱크로 재순 환된다. 이 서브시스템의 작동은 시스템의 제어 서브시스템 부분의 처리 및 제어 유닛에 의해 유발되고 연속적으로 모니터링된다. 시스템의 또 다른 가능한 추가 실시형태에서는, 손상된 애노드액을 리프레싱하고 액체 탱크로 재순환시키는 애노드액 리프레셔 유닛이 또한 제공된다. 상기 애노드액 리프레셔 유닛은 적합한 재료, 예를 들어 스테인리스강으로 제조된 배관(305, 306)을 통해 액체 탱크와 유체 연통한다. 펌프 는 액체 탱크와 상기 애노드액 리프레셔 유닛 사이에서 애노드액의 순환을 실행하기 위해 배관 들(305, 306) 중 하나에 삽입된다. 바람직하게는, 시스템의 제어 서브시스템 부분의 처리 및 제어 유 닛의 감시 하에 조성 측정 유닛에 의해 측정된 애노드액의 조성이 필요한 경우, 애노드액 리프레셔 유닛은 주기적으로 작동한다. 애노드액 리프레셔 유닛의 적용은 전기분해 공정의 운영 비용을 절감한 다. 적합한 애노드액 리프레셔 유닛은 숙련된 기술자에게 알려져 있고 상업적으로 입수 가능하다. 애노드 액 리프레셔 유닛은 Metrohm Titrando 또는 Mettler Toledo(스위스) 자동 적정기와 같은 pH 및 농도 제어 기구일 수 있으며, 이는 애노드액의 조성을 모니터링하고 화학물질을 애노드액에 투여하여 원래 조성 을 복원한다. 상기 애노드액 리프레셔 유닛은 또한 전해조 셀(100, 100')로 공급되는 새로운 애노드액의 품질을 더 개선하기 위해 배관(305, 306)에 삽입된 액체/기체 및 액체/고체 분리막을 포함할 수 있다. 바람직하게는, 제어 서브시스템의 처리 및 제어 유닛은 인공 지능(AI) 서브유닛으로 장착되거나 구현된다. 여기서, 감시 하에 관련된 전해조 셀(100, 100')에 적절하게 연결된 시스템(200, 300)의 작동 패턴으로 학습될 수 있거나 그로부터 자체 학습이 가능한 모든 AI 시스템(예를 들어, 신경망 또는 하나 이상의 협동 신경망 등을 기반으로 함)이 본 발명에서 적합하다. AI 서브유닛은 전해조 셀(100,100')뿐만 아니라 시스템(200,300) 전체의 작동을 담당한다. 이 서브 유닛은 시스템(200, 300)(즉, 기체 및 액체 관리를 위한 자동화 밸브, 전해조 셀 또 는 셀 스택, 전력 공급 장치, 다양한 센서, 분석기 유닛, 예를 들어 (기체)유량계, (기체)조성 측정 장치 등)의 주요 하드웨어 프레임워크와 다양한 서브유닛으로부터의 모든 데이터를 모니터링, 수집 및 평가하는 PC 제어 (반)자동 소프트웨어를 작동한다. 이를 기반으로, 최대 공정 효율을 유지하기 위해, 시스템(200, 300)은 서브유 닛의 데이터로부터 구축된 디스크립터를 통해, 작동 조건(예를 들어, 온도, 가스 유량, 전해조 전압/전류, 압력 등)을 자동으로 최적화한다. 디스크립터 중 임의의 것이 미리 규정된(또는 선택적으로 학습 프로세스의 일부로 서 AI 서브유닛 자체에 의해 설정된) (예를 들어 더 낮은) 임계값에 도달/초과할 때, 제어 서브시스템의 처리 및 제어 유닛은 재생/활성화 서브시스템 및 프로모터 재순환 서브시스템의 작동을 유발한다. 예를 들어, 전해조 셀(100, 100') 내의 압력 증가는 그 가스 채널의 차단을 나타내며 재생/활성화 작동을 시작한다. 유사하 게, 재생/활성화 작동은, 조성 측정 유닛에 의해 연속적으로 측정 및 분석되는 캐소드 생성물 스트림의 조 성이 유용한 생성물 대 원치 않는 부산물 비율(즉, 너무 낮은 CO/H2 비율)의 측면에서 만족스럽지 않을 때 시작 된다. 또한, 전해조 셀(100, 100')의 정전압 작동 중에(실시예 1의 도 4a 참조) 총 전류 밀도가 10분의 미리 설 정된 시간 동안 특정 임계 속도보다 빠르게 감소할 때 또는 대안적으로 특정 임계값(예를 들어, 100 mA cm-2 h- 1)의 셀/셀 스택 전압 증가 시에, 재생 작동이 개시될 수도 있다. 최적화된 작동의 일부로서, 상기 디스크립터 모두가 전해조 셀(100, 100')의 원하는 동작을 전체적으로 나타내는 각각의 추가(예를 들어, 상한) 임계값에 도 달하거나 초과할 때, 재생/활성화 작동은 시스템(200, 300)에 의해 중단된다. 시스템의 작동뿐만 아니라 시스템의 구조에 대해 시스템의 구조에 영향을 미치는 변형에 비추어 볼 때, 시스템의 작동, 특히 이에 의해 수행되는 재생/활성화 방식은 숙련된 기술자에게 명백하므로 여기 서는 상세하게 설명하지 않는다. 이하, 본 발명에 따른 재생/활성화 공정의 일부 추가 양태는 실험에 기초하여, 하기 실시예 1 내지 10을 통해 보다 상세히 설명된다. 실시예 1: 캐소드 재생/활성화 없이 전해조 작동 본 실시예에서는 알칼리성 애노드액으로 연속 작동하는 중에 전해조 셀의 성능 저하를 보여준다. 감소하는 전류 (따라서 생성물 형성 속도)는 침전물 형성과 관련이 있으며 결과적으로 전해조에서 부적절한 가스 관리가 발생 한다. 도 4a는 알칼리성 1M 수산화칼륨(KOH) 애노드액을 사용하여 일정한 셀 전압(ΔU = 3.0V)에서 연속 작동 중 연속 전류 감소를 도시한다. 여기서, 캐소드는 Sigracet39BC 카본 페이퍼에 3 mg cm-2의 은(Ag) 캐소드 촉매를 스프레이 코팅에 의해 고정화 함으로써 형성되었다. 애노드에서는, 다공성 티타늄 프릿에 1 mg cm-2의 Ir black을 고정화하였다. 측정은 애노 드액으로서 T = 50 ℃의 1M KOH를 애노드 격실에 연속적으로 공급하여(약 9 cm3 cm-2 min-1의 공급 속도에서) 수 행된 반면, 캐소드 격실은 u = 12.5 cm3 cm-2 min-1의 유속에서 가습된 CO2(T = 50 ℃의 탈이온수 사용)로 퍼징 (purge)되었다. 도 4b는 GDE에 침전물이 형성되어 촉매 층으로 가는 가스 경로를 차단하여 부적절한 가스 관리가 발생함을 도시 한다. 또한, 도 4c는 알칼리성 애노드액(1M KOH)을 사용하여 CO2의 연속 유동 전기분해에 GDE를 사용한 후 GDE의 마이 크로 CT 이미지를 도시한다. 밝은 부분은 GDE(예를 들어, 탄소 섬유)의 구조를 도시한다. 어둡고 검은색 영역은 GDE(전해조의 가스 유동 채널에서 형성됨) 상부와 기공 내에 침전물의 존재를 증명한다. 즉, 캐소드 재생/활성화 없이 CO2 전해조를 작동하면, GDE, 즉 GDE의 후면과 공극 내 모두에서 침전물이 명확하 게 형성된다. 실시예 2: GDE의 습윤 특성의 중요성 본 실시예는 재생/활성화 액체(또는 임의로 촉진제를 함유하는 용매 혼합물)의 조성이 GDE의 더 깊은 영역, 따 라서 촉매 층에 접근할 수 있도록 조정되어야 함을 분명히 나타낸다. 도 5는 탄소 기반 GDL을 다양한 용매 혼합물로 습윤화하는 예를 도시한다. 본 실시예에서 물만으로는 탄소 GDL 을 습윤화하지 못하므로, GDL 구조를 파괴할 수 있는 과도한 힘(예를 들어, 압력)에 의해서만 강제로 가능하게 할 수 있다. 그러나 DI 수에 IPA(이소프로판올)를 첨가함으로써 용매 혼합물의 소수성을 증가시키면 GDL의 습윤 성이 향상된다. 특히, 적어도 약 25 V/V% IPA(IPA/DI 수의 부피비 1:3) 함량을 갖는 DI 수/이소프로판올의 용매 혼합물은 GDL을 완전히 습윤화한다. 따라서 이러한 용매 혼합물은 GDL 자체를 손상시키지 않고 GDL의 기공에 쉽 게 주입될 수 있다. 캐소드를 습윤화할 수 있고, 이에 따라 본 발명에 따른 활성화 공정에 적용할 수 있는 용매 혼합물의 조성은 GDL의 선택에 따라 달라지지만, 용매 혼합물/GDL의 적절한 쌍 및 상기 용매 혼합물의 유용한 조성을 결정하는 것은 숙련된 기술자에게 일상적인 작업이다. 실시예 3: 연속 작동을 위한 주기적 재생의 효과 본 실시예는 주기적인 재생이 적용될 때 알칼리성 애노드액을 사용하여 고 전류 밀도에서 CO2 전해조를 연속적으 로 작동할 수 있음을 증명한다. 이를 위해, 도 6은 ΔU = 3.2 V에서 8시간 동안 CO2 전해조의 연속 작동 중에 CO 및 H2 형성에 대한 부분 전류 밀도를 도시한다. 전해조의 캐소드는 전기분해의 각 시간 후에 재생되었다. 본 실시예에 따르면, 전해조 성능 (전류 밀도, 선택도)은 주기적인 재생에 의해 유지된다. 여기서, 캐소드는 Sigracet39BC 카본 페이퍼에 1 mg cm-2의 Ag 캐소드 촉매를 스프레이 코팅에 의해 고정화함으 로써 형성되었다. 애노드에서는, 다공성 티타늄 프릿에 1 mg cm-2의 Ir black을 고정화하였다. 측정은 T = 60 ℃의 0.1M 수산화세슘(CsOH) 애노드액을 애노드 격실에 연속적으로 공급하여(약 9 cm3 cm-2 min-1의 공급 속도에서) 수행된 반면, 캐소드 격실은 u = 12.5 cm3 cm-2 min-1의 유속에서 가습된 CO2(T = 60 ℃의 탈이온수)로 퍼징 되었다. 전해조 셀에서, PiperION TP-85 멤브레인을 사용하여 애노드와 캐소드를 분리하였다. 실시예 4: 캐소드 GDE 활성화에 미치는 상이한 용매 중 전해질의 효과 본 실시예는 용해된 촉진제(들)를 사용할 때 용매가 캐소드 활성화에 결정적이라는 것을 증명한다. 도 7a 및 7b는, 전해조의 캐소드가 ΔU = 3.1V에서 연속 전기분해 중에 활성화될 때, 순수한 DI 수 애노드액을 적용한 경우의 두 가지 측정을 도시한다. 두 경우 모두에서, 10 cm3의 0.5M KOH 용액을 가스 스트림에 주입하고, 반응물 CO2 가스에 의해 캐소드 격실로 운반하였다. 도 7a에 도시된 측정에서는 순수한 DI 수가 용매 로 사용되었지만, 도 7b에 도시된 측정에서는 캐소드 GDE를 습윤화하는 데 적합한 이소프로판올/DI 수 혼합물이 사용되었다. 효과는 두 경우에서 유사하지만, GDE를 적절하게 습윤화하는 용매 혼합물을 사용하여 훨씬 더 큰 활성화도가 발생한다. 여기서, 캐소드는 Sigracet39BC 카본 페이퍼에 3 mg cm-2의 Ag 캐소드 촉매를 스프레이 코팅에 의해 고정화하여 형성되었다. 애노드에 대해서는, 다공성 티타늄 프릿에 1 mg cm-2의 Ir black을 고정화하였다. 측정은, T = 60 ℃의 DI 수를 애노드액으로서 애노드 격실에 연속적으로 공급하여(약 9 cm3 cm-2 min-1의 공급 속도로) 수행된 반 면, 캐소드 격실은 u = 12.5 cm3 cm-2 min-1의 유속에서 가습된 CO2(T = 60 ℃의 탈이온수 사용)를 사용하여 퍼징 되었다. 전해조 셀에서, Sustainion X37-50 멤브레인을 사용하여 애노드와 캐소드를 분리하였다. 실시예 5: 상이한 전해질을 사용한 캐소드 GDE 활성화에 대한 양이온(촉진제로서)의 효과 본 실시예는 상이한 전해질 용액이 촉진제로서 작용할 수 있음을 증명한다. 활성화도는 사용된 촉진제에 따라 달라진다. 본 실시예에서는, 캐소드의 활성화에 용해된 전해질을 사용한 경우의 상이한 음이온의 효과를 증명한 다. 도 8a는 애노드액으로서 DI 수를 적용하는 ΔU = 3.1 V에서의 연속 전기분해 중에 캐소드 GDE를 습윤화하는 데 적합한 이소프로판올/DI 수 혼합물에서 10 cm3의 상이한 알칼리성 용액(c = 0.5 M)으로 활성화된 전해조의 캐소 드에 대한 전류측정시 곡선(chronoamperometric curve)을 도시한다. 도 8b는 애노드액으로서 DI 수를 적용하는 ΔU = 3.1V에서의 전기분해 중에 캐소드 GDE를 습윤화하기에 적합한 이소프로판올/DI 수의 혼합물에서 10 cm3의 상이한 알칼리성 용액(c = 0.5 M)으로 활성화된 CO2 전해조의 캐소드를 사용하여, CO 및 H2 생성에 대해 얻어진 부분 전류 밀도를 예시한다. 촉진제 용액은 가스 스트림으로 주입되고, 반응물의 CO2 가스에 의해, 즉, 전해조의 작동과 동시에 캐소드 격실로 운반되어, 전체 전류 밀도와 부분 전류 밀도가 크게 증가되었다. 여기서, 캐소드는 Sigracet39BC 카본 페이퍼에 3 mg cm-2의 Ag 캐소드 촉매를 스프레이 코팅에 의해 고정화함으 로써 형성되었다. 애노드에서는, 다공성 티타늄 프릿에 1 mg cm-2의 Ir black을 고정화하였다. 측정은 애노드액 으로서 T = 60 ℃의 순수한 DI 수를 애노드 격실에 연속적으로 공급하여(약 9 cm3 cm-2 min-1의 공급 속도로) 수 행된 반면, 캐소드 격실은 유속 u = 12.5 cm3 cm-2 min-1에서 가습된 CO2 (T=60 ℃ DI 수를 사용)로 퍼징되었다. 전해조 셀에서, Sustainion X37-50 멤브레인을 사용하여 애노드와 캐소드를 분리하였다. 본 실시예에서는, 용액의 부피, 농도 및 음이온을 변경하지 않고 양이온의 유형만 변경하였다. 실시예 6: 상이한 전해질을 사용한 캐소드 GDE의 활성화에 대한 음이온(촉진제로서)의 효과 본 실시예에서는 상이한 전해질 용액이 촉진제로서 작용할 수 있음을 증명한다. 활성화도는 사용된 촉진제에 따 라 달라진다. 본 실시예에서는, 캐소드 활성화를 위해 용해된 전해질을 사용하는 경우에 대해 상이한 음이온의 효과를 증명한다. 도 9a는, 애노드액으로서 DI 수를 적용하는, ΔU = 3.1에서의 연속 전기분해 중에 캐소드 GDE를 습윤화하기에 적합한 IPA/DI 수의 혼합물에서 10 cm3의 상이한 칼륨염 용액(c(K+) = 0.5 M)으로 활성화된 CO2 전해조의 캐소 드를 사용한 경우의 전류측정시 곡선을 도시한다. 도 9b는, 애노드액으로서 DI 수를 적용하는, ΔU = 3.1 V에서의 연속 전기분해 중에 캐소드 GDE를 습윤화하는 데 적합한 이소프로판올/DI 수 혼합물에서 10 cm3의 다양한 칼 륨 염 용액(c(K+) = 0.5 M)으로 활성화된 전해조의 캐소드를 사용하는 경우에 CO 및 H2 생성에 대해 얻어진 부 분 전류 밀도를 도시한다. 촉진제 용액을 가스 스트림에 주입하고, 반응물의 CO2 가스에 의해 캐소드 격실로 운 반하여 전체 및 부분 전류 밀도를 크게 증가시켰다. 여기서, 캐소드는 Sigracet39BC 카본 페이퍼에 3 mg cm-2의 Ag 캐소드 촉매를 스프레이 코팅에 의해 고정화함으 로써 형성되었다. 애노드에서는, 다공성 티타늄 프릿에 1 mg cm-2의 Ir black을 고정화하였다. 측정은 애노드액 으로서 T = 60 ℃의 DI 수를 애노드 격실에 연속적으로 공급하여(약 9 cm3 cm-2 min-1의 공급 속도로) 수행된 반 면, 캐소드 격실은 u = 12.5 cm3 cm-2 min-1의 유속에서 가습된 CO2(T = 60 ℃의 DI 수를 사용)로 퍼징되었다. 전 해조 셀에서, Sustainion X37-50 멤브레인을 사용하여 애노드와 캐소드를 분리하였다. 본 실시예에서는, 용액의 부피, 칼륨 양이온 및 농도를 변경하지 않고 음이온의 유형(따라서 용액의 pH)만을 변 경하였다. 실시예 7: 장기간 CO2 전기분해에 대한 주기적 캐소드 활성화의 효과 본 실시예는 주기적인 활성화가 수행될 때 애노드액으로서 순수한 DI 수를 사용하여 전해조가 연속적으로 작동 될 수 있음을 증명한다. 도 10은, 애노드액으로서 DI 수를 적용하는, ΔU = 3.2 V에서 224시간 동안 CO2 전해조의 연속 작동 중에 CO 및 H2 형성에 대한 부분 전류 밀도를 도시한다. 전해조의 캐소드는 5 cm3의 1M CsOH를 CO2 가스 스트림에 주입함으 로써 주기적으로(매 12시간마다) 활성화되었으며, 이를 캐소드 GDE로 운반하였다. 본 실시예에 따라, 전해조 성 능(전류 밀도, 선택도)은 주기적인 활성화에 의해 유지된다. 여기서, 캐소드는 Sigracet39BC 카본 페이퍼에 1 mg cm-2의 Ag 캐소드 촉매를 스프레이 코팅에 의해 고정화함으 로써 형성되었다. 애노드에서는 다공성 티타늄 프릿에 1 mg cm-2의 Ir black을 고정화하였다. 측정은 T = 60 ℃ 의 DI 수를 애노드 격실에 연속적으로 공급하여(약 9 cm3 cm-2 min-1의 공급 속도로) 수행된 반면, 캐소드 격실은 u = 12.5 cm3 cm-2 min-1의 유속에서 가습된 CO2(T = 60 ℃의 탈이온수 사용)로 퍼징되었다. 애노드와 캐소드를 분리하기 위해, 15 μm 두께의 PTFE 강화 PiperION TP-85 멤브레인을 전해조 셀에 사용하였다. 실시예 8: 캐소드 GDE의 활성화에 대한 상이한 음이온 교환 멤브레인의 효과 본 실시예는 캐소드 GDE 활성화가 상업적으로 이용 가능하고 상이한 음이온 교환 멤브레인으로 조립된 전해조 셀에서 수행될 수 있음을 도시한다. 본 실시예는 활성화 효과가 일반적이며 특정 공급자의 특정 생성물에 국한 되지 않음을 증명한다. 도 11은 애노드액으로서 DI 수를 적용하여 ΔU = 3.1 V에서의 CO2 전해조의 연속 작동 중에 CO 형성에 대한 전 체 및 부분 전류 밀도를 도시한다. 전해조의 캐소드는 CO2 가스 스트림에 10 cm3의 1 M KOH를 주입함으로써 활성 화되었으며, 이를 캐소드 GDE로 운반하였다. 본 실시예에 따르면, 전해조 성능(전류 밀도, 선택도)은 각 유형의 음이온 교환 멤브레인에 대한 활성화 공정을 수행할 때 상당히 증가하며, 이는 즉각적인 전류 증가에 의해 명확 하게 나타나진다. 여기서, 캐소드는 Sigracet39BC 카본 페이퍼에 3 mg cm-2의 Ag 캐소드 촉매를 스프레이 코팅에 의해 고정화함으 로써 형성되었다. 애노드에서는, 다공성 티타늄 프릿에 1 mg cm-2의 Ir black을 고정화하였다. 측정은 애노드로 서 T = 60 ℃의 DI 수를 애노드 격실에 연속적으로 공급하여(약 9 cm3 cm-2 min-1의 공급 속도로) 수행된 반면, 캐소드 격실은 u = 12.5 cm3 cm-2 min-1의 유속에서 가습된 CO2(T = 60 ℃의 DI 수를 사용)로 퍼징되었다. 실시예 9: 활성액의 필요량 본 실시예에서는 캐소드의 GDE 활성화 효율이 활성액의 부피에 따라 달라진다는 것을 도시한다. 본 실시예에서, 활성화 효율의 증가는 활성화를 위해 상이한 부피의 0.5 M의 KOH 용액(캐소드 GDE를 습윤화하기에 적합한 이소 프로판올/물 용매 혼합물에서)을 사용하여 캐소드 격실의 자유 부피의 최대 10 배까지 증가하는 것으로 밝혀졌 다. 추가 부피 증가는 추가 효율성 증가로 이어지지 않았다. 도 12에서는, 상이한 부피의 0.5M KOH 용액(캐소드 GDE를 습윤화하는 데 적합한 이소프로판올/DI 수 용매의 혼 합물에서)으로 캐소드를 활성화한 후, ΔU = 3.1 V에서 애노드액으로서 T = 60 ℃의 DI 수를 사용하는 정전압 전기분해 중에 H2 및 CO 형성에 대해 측정된 부분 전류 밀도가 제시되어 있다. 여기서, 캐소드는 Sigracet39BC 카본 페이퍼에 3 mg cm-2의 Ag 캐소드 촉매를 스프레이 코팅에 의해 고정화함으 로써 형성되었다. 애노드에서는, 다공성 티타늄 프릿에 1 mg cm-2의 Ir black을 고정화하였다. 측정은 T=60 ℃의 DI 수를 애노드 격실에 연속적으로 공급하여(약 9 cm3 cm-2 min-1의 공급 속도로) 수행된 반면, 캐소드 격실은 u = 12.5 cm3 cm-2 min-1의 유속에서 가습된 CO2(T = 60 ℃의 탈이온수 사용)로 퍼징되었다. 전해조 셀에서, Sustainion X37-50 멤브레인을 사용하여 애노드와 캐소드를 분리하였다. 실시예 10: 활성액의 필요한 농도 본 실시예에서는, 캐소드의 GDE 활성화의 효율이 활성액의 농도에 따라 달라진다는 것을 증명한다. 본 실시예에 서, 활성화 효율의 증가는 캐소드 GDE를 습윤화하는 데 적합한 이소프로판올/물의 혼합물에 용해된 10 cm3의 KOH 용액을 사용하여 0.5M 농도까지 증가하는 것으로 밝혀졌다. 추가 농도 증가는 추가 효율성 증가로 이어지지 않았다. 도 13에서는, 상이한 농도의 10 cm3의 KOH 용액(캐소드 GDE를 습윤화하는 데 적합한 이소프로판올/물 용매의 혼 합물에 용해됨)으로 캐소드를 활성화한 후, 애노드액으로서 T = 60 ℃의 DI 수를 사용하는, ΔU = 3.1V에서 정 전압 전기분해 중에 H2 및 CO 형성에 대해 측정된 부분 전류 밀도가 제시되어 있다. 여기서, 캐소드는 Sigracet39BC 카본 페이퍼에 3 mg cm-2의 Ag 캐소드 촉매를 스프레이 코팅에 의해 고정화함으 로써 형성되었다. 애노드에서는, 다공성 티타늄 프릿에 1 mg cm-2의 Ir black을 고정화하였다. 측정은 애노드액 으로서 T = 60 ℃의 DI 수를 애노드 격실에 연속적으로 공급하여(약 9 cm3 cm-2 min-1의 공급 속도로) 수행된 반 면, 캐소드 격실은 u = 12.5 cm3 cm-2 min-1의 유속으로 가습된 CO2(T = 60 ℃의 탈이온수)에 의해 퍼징되었다. 전해조 셀에서, Sustainion X37-50 멤브레인을 사용하여 애노드와 캐소드를 분리하였다."}
{"patent_id": "10-2023-7005707", "section": "도면", "subsection": "도면설명", "item": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명을 상세히 설명한다. 도 1a는 기체 CO2를 다른 생성물로 전환하기 위한 제로-갭 전해조 셀의 설계를 개략적으로 예시한다. 도 1b는 기체 CO2를 다른 생성물로 전환하기 위한 비-제로 갭 전해조 셀의 설계를 개략적으로 예시한다. 도 2는 CO2 전해조의 성능을 유지하기 위한 시스템의 가능한 실시형태를 도시한다. 도 3은 완전히 자동화된 방식으로 CO2 전해조의 성능을 유지하기 위한 시스템의 가능한 추가 실시형태를 예시한 다. 도 4a, 4b 및 4c는, 캐소드 재생/활성화 없이 알칼리성 애노드액으로 연속 작동되는, 전류 감소, 막힌 가스 확 산 전극의 사진, 및 CO2 전해조에 사용된 상기 가스 확산 전극의 마이크로 CT 이미지를 각각 나타낸다. 도 5는 다양한 물/이소프로판올 용매 혼합물로 탄소 기반 가스 확산 층을 습윤화하는 예를 도시한다. 도 6은 주기적 재생으로 8시간 동안 CO2 전해조의 연속 작동 중에 시간의 함수로서 CO 및 H2 형성에 대한 부분 전류 밀도를 도시한다. 도 7a 및 7b는 순수한 탈이온수 내의 1M KOH 용액 및 캐소드 GDE를 습윤화하기에 적합한 이소프로판올/물의 용 매 혼합물로 각각 캐소드 GDE의 활성화를 수행하는 CO2 전해조의 연속 작동 중에 시간 경과에 따른 총 전류 밀 도를 예시한다. 도 8a 및 8b는 연속 전기분해 중에 이소프로판올/물의 용매 혼합물에서 10 cm3의 상이한 알칼리성 용액(c = 0.5 M)으로 활성화된 DI 수 애노드액 공급식 CO2 전해조의 캐소드의 시간전류법(chronoamperometric) 곡선이다. 도 9a 및 9b는, 연속 전기분해 동안 이소프로판올/물의 용매 혼합물에서 10 cm3의 상이한 칼륨 염 용액(c(K+) =0.5 M)으로 활성화된 DI 수 애노드액 공급식 CO2 전해조의 캐소드에 대한 시간전류법 곡선이다. 도 10은 각 12시간의 전기분해 후 물/이소프로판올 중 5 cm3의 1M CsOH 용액으로 주기적인 캐소드 활성화와 함 께 224 시간 동안 DI 수 애노드액 공급식 CO2 전해조의 연속 작동 중 시간 경과에 따른 CO 및 H2 형성에 대한 부 분 전류 밀도를 도시한다. 도 11은 다양한 음이온 교환 멤브레인, 특히 A: Class T Sustainion X37-50, B: PiperION TP-85 32 ㎛, C: Fumasep FAB-PK-130에 대한 캐소드 활성화를 갖는 DI 수 애노드액 공급식 CO2 전해조의 연속 작동 중 시간 경과 에 따른, CO 형성에 대한 전체 및 부분 전류 밀도를 도시한다. 도 12는 촉진제(여기서는 KOH)를 함유하는 용매 혼합물의 다양한 양(부피)에 대해 캐소드 활성화를 갖는 DI 수 애노드액 공급식 CO2 전해조 셀을 사용하여, 정전압 전기분해 동안 H2 및 CO 형성에 대해 측정된 부분 전류 밀도 를 도시한다. 도 13은 촉진제(여기서는 KOH)를 함유하는 용매 혼합물의 다양한 농도에 대해 캐소드 활성화를 갖는 DI 수 애노 드액 공급식 CO2 전해조 셀을 사용하여, 정전압 전기분해 동안 H2 및 CO 형성에 대해 측정된 부분 전류 밀도를 도시한다."}
