{"patent_id": "10-2023-7002488", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0028466", "출원번호": "10-2023-7002488", "발명의 명칭": "반도체 제조 환경의 자동화된 지원", "출원인": "라보로 인코포레이티드", "발명자": "오베랄 악샤이"}}
{"patent_id": "10-2023-7002488", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "시스템으로서,반도체 제조 시스템의 웨이퍼 핸들링 시스템으로서, 처리하기 위해 하나 이상의 웨이퍼를 홀딩하도록 구성된,상기 웨이퍼 핸들링 시스템;상기 하나 이상의 웨이퍼를 물리적으로 처리하도록 구성된 하나 이상의 처리 구성요소;상기 처리 구성요소를 작동시키도록 구성된 제어기; 및상기 반도체 제조 시스템과 통신하고 사용자 문의에 응답하도록 구성된 텍스트 봇을 포함하는, 시스템."}
{"patent_id": "10-2023-7002488", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 사용자 문의는 음성 사용자 문의인, 시스템."}
{"patent_id": "10-2023-7002488", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "시스템으로서,반도체 제조 시스템의 웨이퍼 핸들링 시스템으로서, 처리하기 위해 하나 이상의 웨이퍼를 홀딩하도록 구성된,상기 웨이퍼 핸들링 시스템;상기 하나 이상의 웨이퍼를 물리적으로 처리하도록 구성된 처리 구성요소;상기 처리 구성요소를 작동시키도록 구성된 제어기; 및상기 반도체 제조 시스템과 통신하고 음성 사용자 문의에 응답하도록 구성된 스피치 봇으로서, 상기 제어기에액세스하고 사용자 응답 입력에 기초하여 상기 처리 구성요소를 작동시키도록 추가로 구성되는, 상기 상기 스피치 봇을 포함하는, 시스템."}
{"patent_id": "10-2023-7002488", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "시스템으로서,반도체 제조 시스템의 웨이퍼 핸들링 시스템으로서, 처리하기 위해 하나 이상의 웨이퍼를 홀딩하도록 구성된,상기 웨이퍼 핸들링 시스템;상기 하나 이상의 웨이퍼를 물리적으로 처리하도록 구성된 처리 구성요소;상기 처리 구성요소를 작동시키도록 구성된 제어기; 및상기 반도체 제조 시스템과 통신하는 인공 지능(AI) 엔진으로서, 상기 AI는 사용자 문의에 응답하도록구성되는, 상기 인공 지능(AI) 엔진을 포함하는, 시스템."}
{"patent_id": "10-2023-7002488", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "시스템으로서,반도체 제조 시스템의 웨이퍼 핸들링 시스템으로서, 처리하기 위해 하나 이상의 웨이퍼를 홀딩하도록 구성된,상기 웨이퍼 핸들링 시스템;공개특허 10-2023-0028466-3-상기 하나 이상의 웨이퍼를 물리적으로 처리하도록 구성된 처리 구성요소;상기 처리 구성요소를 작동시키도록 구성된 제어기; 및상기 반도체 제조 시스템과 통신하는 자연어 처리(natural-language processing: NLP) 봇으로서, 사용자 문의에응답하도록 구성되는, 상기 NLP 봇을 포함하는 시스템."}
{"patent_id": "10-2023-7002488", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "시스템으로서,반도체 제조 시스템의 웨이퍼 핸들링 시스템으로서, 처리하기 위해 하나 이상의 웨이퍼를 홀딩하도록 구성된,상기 웨이퍼 핸들링 시스템;상기 하나 이상의 웨이퍼를 물리적으로 처리하도록 구성된 처리 구성요소;상기 처리 구성요소를 작동시키도록 구성된 제어기; 및상기 반도체 제조 시스템과 통신하는 대화형 봇으로서, 사용자 문의에 응답하도록 구성되는, 상기 대화형 봇을 포함하는, 시스템."}
{"patent_id": "10-2023-7002488", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 대화형 봇은 상기 사용자 문의에 대한 다수의 답변과 함께 상황에 맞는 응답을 제공하도록 구성되는, 시스템."}
{"patent_id": "10-2023-7002488", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서, 상기 사용자 문의는 장애 처리 문제(trouble-shooting problem)와 관련되고;상기 대화형 봇은,과거 로그의 의사결정 논리적 경로 분석;가장 널리 공지된 방법; 또는장애 처리 의사결정 트리 가이드(trouble-shooting decision-making-tree guide)중 하나 이상에 기초하여 상기 사용자 문의에 대한 응답을 제공하도록 구성되는, 시스템."}
{"patent_id": "10-2023-7002488", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제6항에 있어서, 상기 대화형 봇과 통신하는 증강 현실(AR) 웨어러블 장비를 더 포함하되, 상기 AR 웨어러블 장비는 상기 사용자 질의를 상기 대화형 봇으로 전송하고 응답 데이터를 수신하도록 구성되는, 시스템."}
{"patent_id": "10-2023-7002488", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 대화형 봇 및 상기 AR 웨어러블 장비와 통신하는 가상 현실(VR) 웨어러블 장비를 더 포함하되, 상기 VR 웨어러블 장비는 상기 사용자 질의를 상기 대화형 봇으로 전송하고 응답 데이터를 수신하도록 구성되는, 시스템."}
{"patent_id": "10-2023-7002488", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제6항에 있어서, 상기 대화형 봇과 통신하는 가상 현실(VR) 웨어러블 장비를 더 포함하되, 상기 VR 웨어러블 장비는 상기 사용자 질의를 상기 대화형 봇으로 전송하고 응답 데이터를 수신하도록 구성되는, 시스템."}
{"patent_id": "10-2023-7002488", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제6항에 있어서, 상기 대화형 봇과 통신하는 사용자 웨어러블 장비를 더 포함하되, 상기 사용자 웨어러블 장비는 상기 사용자 질의를 상기 대화형 봇으로 전송하고 응답 데이터를 수신하도록 구성되는, 시스템.공개특허 10-2023-0028466-4-청구항 13 제12항에 있어서, 상기 사용자 웨어러블 장비는 마이크로폰 및 스피커를 포함하는, 시스템."}
{"patent_id": "10-2023-7002488", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서, 상기 사용자 웨어러블 장비는 상기 대화형 봇으로의 상기 사용자 질의에 응답하여 비디오 클립(video clip)을 디스플레이하도록 구성된 디스플레이를 포함하는, 시스템."}
{"patent_id": "10-2023-7002488", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서, 상기 사용자 웨어러블 장비는 비디오를 녹화하고 원격 디스플레이로 상기 비디오를 전송하도록 구성된 카메라를 포함하는, 시스템."}
{"patent_id": "10-2023-7002488", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "시스템으로서,하나 이상의 반도체 제조 시스템과 통신하는 인공 지능(AI) 엔진을 포함하되, 상기 AI 엔진은,대응하는 운영 매뉴얼로부터 추출되고 변환된 데이터를 포함하는 공정 데이터 스토어에 대해서 액세스하고;상기 하나 이상의 반도체 제조 시스템의 작동을 모니터하고 고장 상태를 예측하도록 구성되는, 시스템."}
{"patent_id": "10-2023-7002488", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서, 상기 AI 엔진은 관찰된 도구 작동 파라미터와 비교된 디바이스 수율을 높이도록 구성된 권장도구 작동 파라미터를 제공하도록 추가로 구성되는, 시스템."}
{"patent_id": "10-2023-7002488", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "시스템으로서,하나 이상의 반도체 제조 시스템과 통신하는 인공 지능(AI) 엔진을 포함하되, 상기 AI 엔진은,대응하는 운영 매뉴얼로부터 추출되고 변환된 데이터를 포함하는 공정 데이터 스토어에 대해서 액세스하고;상기 하나 이상의 반도체 제조 시스템의 작동 및 수율을 향상시키도록 결정된 권장된 동작을 모니터링하도록 구성되는, 시스템."}
{"patent_id": "10-2023-7002488", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "시스템으로서,하나 이상의 반도체 웨이퍼를 물리적으로 처리하도록 구성된 처리 구성요소;상기 처리 구성요소를 작동시키도록 구성된 제어기; 및사용자 문의에 응답하도록 구성된 대화형 봇을 포함하는, 시스템."}
{"patent_id": "10-2023-7002488", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서, 상기 대화형 봇은,사용자 입력; 또는액세스된 가장 널리 공지된 방법중 하나 이상에 기초하여 상기 반도체 웨이퍼 중 하나 이상의 처리를 개시하도록 추가로 구성되는, 시스템."}
{"patent_id": "10-2023-7002488", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "일 실시형태에서, 시스템은 반도체 제조 시스템의 웨이퍼 핸들링 시스템을 포함한다. 웨이퍼 핸들링 시스템은 처 리를 위해 하나 이상의 웨이퍼를 홀딩하도록 구성된다. 시스템은 또한 하나 이상의 웨이퍼를 물리적으로 처리하 도록 구성된 하나 이상의 처리 구성요소; 처리 구성요소를 작동시키도록 구성된 제어기; 및 반도체 제조 시스템 과 통신하고 사용자 문의에 응답하도록 구성된 텍스트 봇을 포함한다."}
{"patent_id": "10-2023-7002488", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시내용은 일반적으로 반도체 디바이스의 제조에 관한 것이다."}
{"patent_id": "10-2023-7002488", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "집적 회로(IC)와 같은 반도체 디바이스는 전형적으로 도구 또는 반도체 도구로서 지칭될 수 있는 특수 반도체 제조 장비를 사용하여 제조된다. 반도체 디바이스를 제조하는 공정은 통상적으로 웨이퍼를 물리적으로 처리하는 다양한 단계를 수반한다. 예를 들어, 재료 증착은 다른 수단 중에서 스핀 온 증착, 화학 기상 증착(CVD) 및 스 퍼터링 증착에 의해 달성될 수 있다. 코터-디벨로퍼(coater-developer) 및 증착 챔버와 같은 도구는 웨이퍼에 재료를 추가하기 위해 사용될 수 있다. 재료 패턴화는 스캐너 및 스테퍼 도구를 사용하여 포토리소그래피를 통 해 달성될 수 있다. 포토리소그래피를 사용하여, 화학 방사선의 패턴에 대한 노출은 막에서 패턴화된 용해도 변 화를 유발한다. 가용성 재료는 그런 다음 용해되고 제거될 수 있다. 재료 에칭은 다양한 에칭 도구를 사용하여 수행될 수 있다. 에칭 도구는 플라즈마 기반 에칭, 증기 기반 에칭 또는 유체 기반 에칭을 사용할 수 있다. 화 학 기계적 폴리싱 도구는 재료를 기계적으로 제거하고 웨이퍼를 평탄화할 수 있다. 노 및 기타 가열 장비는 재 료를 어닐링, 경화 또는 성장시키기 위해 사용될 수 있다. 계측 도구는 다양한 스테이지에서 제조 정확도를 측 정하기 위해 사용된다. 프로버는 기능을 테스트할 수 있다. 패키징 도구는 칩을 원하는 디바이스와 통합할 형태로 하기 위해 사용될 있 다. 다른 도구는 노, CVD 챔버, 스테퍼, 스캐너, 물리적 기상 증착, 원자층 에처(etcher), 이온 주입기 등이 있 다. 전형적으로, 반도체 디바이스의 제조에는 많은 도구가 수반된다. 일련의 반도체 도구의 지속적이고 정확하고 정밀한 작동은 디바이스 수율을 증가시킬 수 있다. 그러나, 이러한 도구는 디바이스 고장 또는 재료 실패로 인해 예정되지 않은 유지 보수뿐만 아니라 주기적인 유지 보수를 요구 하는 경향이 있다. 실제로, 반도체 산업은 종종 긴 지연, 가동 중단 시간 및 공정 도구의 생산성 및 감가상각 비용에서의 손실에 상당한 비용이 드는 수율 손실을 경험한다. 반도체 제조 도구는 복잡한 경향이 있으며, 비용 및 시간이라는 점에서 서비스 및 수리 비용이 비쌀 수 있다. 많은 디바이스 제조업체는 전 세계에 걸쳐서 분산 된 팹(fab)을 가지고 있다. 따라서, 전문 기술자 및 엔지니어의 이동 지연은 수리 및 유지 보수 비용에 추가될 수 있다. 또한, 공정 도구에 대한 유지 보수 리소스와 교육 시간은 증가하고 있다. 도구의 유지 보수와 수리와는 별도로, 도구 사용을 개선하는 것은 또한 시간 소모적이고 비싸다. 더 나은 결과 를 위해 레시피와 도구 사용 파라미터를 식별하고 개선하는 것은 어렵고 시간 소목적이다. 분산된 반도체 제조 환경은 모든 장비에 모범 사례를 적용하는 문제를 증가시킬 수 있다. 특정 실시형태는 반도체 장비에 대한 가상 참석자 및 가상 컨설턴트(봇(bot)) 비서를 제공한다. 특정 실시형태 는 반도체 제조 도구에 대한 소프트웨어 봇, 인공 지능(AI), 기계 학습(ML) 및 자연어 처리(natural-language processing: NLP)를 사용하는 것을 포함한다. 특정 실시형태에서, 봇, AI 엔진, ML 프로그램 및 언어 처리(LP) 엔진은 헤드셋 및 웨어러블 시각 디스플레이와 같은 사용자 통신 디바이스와 통합되어, 사용자 지원 및 자동화 된 최적화를 전 세계적으로 개별 도구에 제공한다. 특정 실시형태는 공정 도구의 사용 및 유지 보수를 위한 정확한 복사 모델의 신속한 구현을 가능하게 한다. 특 정 실시형태는 스마트 자동화 도구가 제조 흐름에서 일관성을 유지하는 것을 가능하게 한다. 특정 실시형태에서, 원격, 가상 또는 증강 현실 액세스가 제공된다. 가상 분석 및 관리가 또한 제공될 수 있다. 본 명세서에 개시된 실시형태는 예시에 불과하며, 본 개시내용의 범위가 이에 한정되는 것은 아니다. 특정 실시 형태는 본 명세서에 개시된 실시형태의 구성요소, 요소, 특징, 기능, 동작 또는 단계를 모두 또는 일부 포함하 거나, 전혀 포함하지 않을 수 있다. 청구될 수 있는 요지는 첨부된 청구범위에서 제시된 특징들의 특정 조합을 포함할 뿐만 아니라 다른 특징들의 조합도 포함한다. 또한, 본 명세서에 기술되거나 도시된 임의의 실시형태 또 는 특징은 별도의 청구항에서, 또는 본 명세서에 기술되거나 예시된 임의의 실시형태 또는 특징과, 또는 첨부된 청구항의 임의의 특징과 임의의 조합으로 청구될 수 있다. 또한, 본 개시내용이 특정 이점을 제공하는 것으로서 특정 실시형태를 설명하거나 예시하지만, 특정 실시형태는 이러한 이점을 제공하지 않거나, 일부 또는 전부를 제공할 수 있다."}
{"patent_id": "10-2023-7002488", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "특정 실시형태는 가상 참석자 및 가상 컨설턴트(예컨대, 봇 또는 소프트웨어 봇)를 통해 반도체 장비에 대한 자 동화된 지원을 제공한다. 특정 실시형태는 반도체 제조 도구에 대한 소프트웨어 봇, AI, ML 및 NLP를 사용하는 것을 포함한다. 특정 실시형태에서, 봇, AI 엔진, ML 프로그램 및 LP 엔진은 사용자 통신 디바이스(예컨대, 헤 드셋 및 웨어러블 시각 디스플레이)와 통합되어, 사용자 지원 및 자동화된 최적화를 전 세계적으로 개별 도구에 제공한다. 특정 실시형태는 반도체 도구에 부착되거나 이와 통신하는 데이터 구동 및 모델 구동 AI 및 ML 엔진을 포함한다. 특정 실시형태의 이점은 더 긴 장비 가동 시간, 더 낮은 평균 고장 간격(MTBF), 더 낮은 평균 수리 시간(MTTR), 또는 산출하는데 더 빠른 양보 램프를 포함한다. 특정 실시형태는 시스템 또는 도구 크리프를 더 잘 예측하거나 또는 공정 크리프를 보다 잘 예측할 수 있다. 특정 실시형태는 공정 엔지니어, 설비, 유지 보수 및 현장 서비스를 위한 원격 팹 관리뿐만 아니라 원격 도구 액세스를 제공한다. 예시적인 실시형태는 텍스트 봇(text bot) 또는 텍스트 스피치 봇(text speech bot)을 가지는 반도체 공정 도구 (반도체 제조 시스템)을 포함한다. 반도체 제조 시스템은 처리를 위해 하나 이상의 웨이퍼(기판)를 홀딩하도록 구성된 웨이퍼 핸들링 시스템을 포함할 수 있다. 웨이퍼는 기존의 원형 실리콘 웨이퍼를 포함할 수 있지만, 다 른 기판을 또한 포함한다. 다른 기판은 디스플레이 및 태양광 패널과 같은 평면 패널을 포함할 수 있다. 웨이퍼 핸들링 시스템은 에지 홀더, 서셉터(susceptor), 정전기 척(electrostatic chuck) 등을 포함하는 기판 홀더뿐만 아니라 웨이퍼 수용 포트, 로봇식 웨이퍼 아암 및 운송 시스템을 포함할 수 있지만 이에 제한되지 않는다. 일부 실시형태에서, 웨이퍼 핸들링 시스템은 처리 동안 웨이퍼를 홀딩하는 플레이트만큼 간단할 수 있다. 특정 실시형태에서, 반도체 제조 시스템은 웨이퍼의 하나 이상의 표면을 물리적으로 처리하도록 구성된 처리 구 성요소를 포함한다. 특정 처리 구성요소는 도구 및 수행될 처리의 유형에 의존한다. 특정 실시형태는 임의의 수 또는 유형의 공정 도구에서 기능한다. 예를 들어, 에처 도구를 사용하여, 처리 구성요소는 웨이퍼를 수용하기 위한 개구가 있는 처리 챔버를 포함할 수 있다. 처리 챔버는 진공 압력에 맞게 조정될 수 있다. 연결된 진공 장 치는 챔버 내에서 원하는 압력을 생성할 수 있다. 가스 전달 시스템은 공정 가스 또는 공정 가스들을 챔버에 전 달할 수 있다. 통전 메커니즘(energizing mechanism)은 플라즈마를 생성하기 위해 가스에 통전할 수 있다. 무선 주파수 소스 또는 기타 전력 전달 시스템은 챔버에 바이어스를 전달하여 이온을 방향성으로 가속하도록 구성할 수 있다. 마찬가지로, 코터-디벨로퍼 도구에 대해, 이러한 처리 구성요소는 웨이퍼를 홀딩하고 웨이퍼를 회전시 키는 척, 액체(예를 들어, 포토레지스트, 디벨로퍼 또는 기타 막 형성 또는 세척 유체)를 분배하도록 위치된 액 체 분배 노즐을 포함할 수 있다. 이해할 수 있는 바와 같이, 코터-디벨로퍼 도구는 임의의 다른 종래의 부품을 포함할 수 있다. 특정 실시형태에서, 반도체 제조 시스템은 처리 구성요소를 작동시키도록 구성된 제어기를 포함한다. 제어기는 도구 상에 위치되거나, 또는 원격으로 위치되어 도구에 연결될 수 있다. 반도체 제조 시스템은 반도체 제조 시 스템과 통신하는 텍스트 봇을 포함한다. 텍스트 봇은 다양한 대안적인 아키텍처를 가질 수 있다. 예를 들어, 텍 스트 봇(또는 자연어 프로세서 또는 대화형 봇과 같은 본 명세서의 다른 엔진)은 도구에 위치된 대응 프로세서 및 메모리(도구 내에 있거나, 도구에 장착되거나, 또는 그렇지 않으면 도구에 부착됨)를 가질 수 있다. 대안적 으로, 봇 실행 하드웨어는 도구(또는 팹)에 인접한 서버 뱅크에서와 같이 원격에 위치되거나, 또는 봇은 지리적 으로 떨어져 있는 동안(예를 들어, 별도의 국가에서) 실행될 수 있다. 구성은 중복, 다중 또는 보완 봇을 가질 수 있다. 예를 들어, 특정 실시형태는 어느 하나의 봇이 문의에 응답하고 동작을 실행할 수 있는 원격 봇뿐만 아니라 온-툴(on-tool) 봇을 포함할 수 있다. 대안적으로, 온-툴 봇은 하나의 그룹 또는 유형의 문의(예를 들어, 진단 정보)을 해결할 수 있는 반면, 원격 서버 기반 봇은 고장을 예측하고 최적화를 위한 동작을 제안하 기 위해, 심층 학습 및 네트워크 데이터뿐만 아니라 통합 흐름 내의 다른 도구로부터의 데이터에 액세스할 수 있다. 특정 실시형태에서, 텍스트 봇은 사용자(도구 사용자 또는 원격 사용자)로부터의 문의를 돌려주거나 응답하도록 구성된다. 텍스트 봇은 또한 웨이퍼 처리 또는 도구 유지 보수와 같은 도구에 대한 행동을 실행할 수 있다. 비 제한적인 예로서, 텍스트 봇은 결함 검출 및 분류(FDC)를 위해 사용될 수 있다. 예를 들어, 주어진 공정 도구에 서 작업하는 사용자는 도구 고장 또는 결함 상태에 직면한다. 운영자 교육 또는 전문 기술자 가용성에 의존하는 대신, 사용자는 고장 상태를 해결하는 것과 같은 텍스트 질의(text query)를 입력할 수 있다. 텍스트 봇은 솔루 션, 추가 질문, 정보 등으로 응답할 수 있다. 솔루션 및 추가 도움은 텍스트, 오디오, 비디오, 증강 현실(AR) 및 자동화된 동작의 형태일 수 있다. 예를 들어, 주어진 공정 도구는 고장이 있다. 텍스트 문의를 통해, 사용자 는 도구 고장을 해결하기 위한 솔루션을 요청한다. 입력은 사용자에 의해 입력된 오류 코드일 수 있거나, 또는 텍스트 봇은 오류 코드 및 진단 데이터에 전자적으로 액세스할 수 있다. 텍스트 봇은 도구를 수리하기 위해 수 행해야 하는 단계와 같은 답변을 텍스트로 돌려주거나, 특정 수리 절차를 지원하거나 설명하기 위해 문서 및 이 미지를 디스플레이할 수 있다. 대안적으로, 텍스트 봇은 도구를 수리하는 단계를 보여주는 비디오에 액세스할 수 있다. 예를 들어, 포커스 링이 도구 고장의 일부로서 식별되면, 텍스트 봇 또는 반도체 제조 시스템은 포커 스 링을 교체하기 위해 가장 널리 공지된 방법을 보여주는 비디오를 돌려줄 수 있다. 도구 고장 대신, 문제가 불균일한 에칭과 같은 불량 처리와 관련되면, 주어진 가스, 온도 또는 에칭할 막에 대한 에칭 균일성을 개선하 는 방법에 대한 문의는 텍스트 봇을 통해 입력될 수 있고, 그런 다음, 텍스트 봇은 주어진 에칭에 대해 가장 널 리 공지된 레시피를 돌려줄 수 있다. 이러한 가장 널리 공지된 레시피는 네트워크에서의 임의의 다른 도구에서 사용되는 데이터로부터, 또는 대응하는 조직 외부로부터와 같은 확장된 네트워크로부터 얻어질 수 있다. 특정 실시형태에서, 반도체 제조 시스템은 텍스트 봇, 스피치 봇 또는 대화형 봇을 포함한다. 이러한 반도체 제 조 시스템은 반도체 제조 시스템과 통신하는 스피치 봇을 포함할 수 있고, 사용자의 음성 문의에 응답하도록 구 성될 수 있다. 스피치 봇(또는 다른 봇)은 고급 공정 제어(APC)뿐만 아니라 기본 공정 제어를 포함하는 시스템 구성요소에 액세스하고 이를 작동시키도록 구성될 수 있다. 특정 실시형태에서, 봇은 수율을 향상시킬 뿐만 아 니라 수율 손실의 원인을 식별하기 위해 사용될 수 있다. 봇과 응답은 메트릭 중심일 수 있다. 예를 들어, 응답 은 MTBF를 늘리고, 가동 시간을 늘리고, MTTR을 줄이고, 대기열 시간 변동을 줄이는 입력을 제공할 수 있고, 자 격 메트릭을 고려할 수 있다. 스피치 봇은 사용자가 요청하는 가장 논리적이고 관련성이 높은 정보의 상황별 검 색을 위해 사용된다. NLP 봇에서의 AI/ML 엔진은 사용자 경험으로부터 실시간으로 학습할 수 있다. 이러한 봇이 교육되는 또 다른 방법은 장애 처리를 지원하는 것이다. 이러한 경우에, 봇은 장애 처리 의사 결정 논리 트리와 함께 다양한 로그 및 과거 동작을 수집하여, 사용자가 장애 처리를 위한 올바른 정보에 액세스하도록 돕거나 주 제 전문가에게 원격 에스컬레이션을 유도한다. 특정 실시형태에서, 봇은 AI 엔진을 사용하여 구현될 수 있다. 사용자는 헤드셋과 헤드업 디스플레이를 사용하 여 AI 대화형 봇에 연결될 수 있다. 이러한 것은 어시스턴트 몰입형 경험(assistant-immersed experience)을 제공한다. AI 번역은 Copy Exact 정기 유지 보수와 운영 및 유지 보수를 위한 가장 널리 공지된 방법(BKM)을 지 원한다. 헤드락 원격 포인팅(Headlock remote pointing)은 Copy Exact 오류 복구를 지원할 수 있다. 특정 실시 형태에서, 반도체 제조 시스템은 AR 사용자 하드웨어를 가진다. 도구 사용 및 도구 유지 보수/수리는 모두 AR 또는 가상 현실(VR) 시스템에서 비디오를 통해 캡처되어 사용자에게 전달될 수 있다. 특정 실시형태는 구조화되 지 않은 AR 비디오 획득 학습을 포함할 수 있다. 실시형태는 디지털 변환 자동화 증강을 포함할 수 있다. 특정 실시형태에서, 비디오 녹화 시스템은 세계 어느 곳에서나 사용자의 유지 보수 동작 및 운영 동작을 도구에 녹화한다. 심층 학습 및 AI 분석은 특정 동작(뿐만 아니라 대응하는 비디오)을 가장 높은 수율, 가장 긴 고장 간격 등을 위한 가장 널리 공지된 방법과 상관시킬 수 있다. 특정 솔루션과 대응하는 비디오가 식별된 후에, 다 른 사용자가 동일하거나 유사한 문제에 직면할 때마다, 온-툴 가상 비서는 식별된 최상의 솔루션에 액세스하고, 대응하는 비디오와 함께 솔루션을 디스플레이할 수도 있다. 이에 따라, 이러한 비디오는 전문 엔지니어 및 기술 자와 관련된 이동 및 비용 없이 전문 솔루션을 제공한다. 특정 실시형태에서 가상 비서 또는 컨설턴트는 반도체 도구에 대한 일반적인 지식뿐만 아니라 도구별 특성화에 액세스할 수 있다. 데이터는 또한 설계 기술 최적화 및 통합 흐름을 설명할 수 있다. 예를 들어, 주어진 패턴화 공정은 전형적으로 막 형성용 스핀 코터, 패턴 노광용 스테퍼, 에칭 마스크 형성을 위한 디벨로퍼, 패턴 전사용 에처, 컨포멀 막 형성용 증착기 등과 같은 다수의 공정 도구를 사용한다. 이러한 모든 도구는 패턴 곱셈 흐름 (pattern multiplication flow)에서 사용될 수 있다. 대화형 봇은 예를 들어 주어진 피치 쿼드 흐름(pitch quad flow)에서 수율을 최대화하기 위한 최상의 도구와 작동 파라미터를 찾기 위해 문의를 받을 수 있다. 특정 실시형태는 많은 도구, 많은 조직, 매뉴얼, 사용자 입력에 걸친 심층 학습을 포함한다. 이러한 학습은 모 델 기반 및 데이터 기반 분석 모두를 위해 팹 데이터를 준비하고 구조화하여 사용자 인터페이스 플랫폼에 공급될 수 있다. 시스템은 도구 및 팹에 걸쳐서 확장 가능한 데이터 수집 인터페이스를 포함한다. 사용자 인터페이 스 플랫폼은 대화형 봇, AI, NLP, 오디오/비디오 및 AR 시스템을 사용한다. 특정 실시형태의 장점은 도구에 대 한 사용자 매뉴얼과 그에 대한 답변이 봇 비서에 의해 쉽게 액세스 가능하다는 것이다. 이러한 것은 도구에 대 해 작업하기 전에 도구의 주어진 사용자 매뉴얼이 연구될 필요가 없다는 것을 의미한다. 일 실시형태는 반도체 장비를 위한 온-툴 AI의 사용을 포함한다. 하나 이상의 AI 엔진이 반도체 제조 시스템에 통합된다. 대안적으로, AI 엔진은 반도체 제조 시스템과 네트워크 통신하고 있다. 이러한 AI 엔진은 고장 수정, 작동 최적화 및 고장 수리와 같은 많은 작동으로 사용자(로컬 및 원격)를 지원할 수 있다. 다른 예시적인 실시형태는 반도체 제조 시스템 상의 NLP 봇을 포함한다. NLP 봇은 도구 가동 시간을 늘리는 것 과 같은 다양한 작업 및 작동을 위해 사용될 수 있다. NLP 봇은 사용자로부터의 자연어 입력에 응답하는 가상 비서 또는 가상 컨설턴트 인터페이스를 포함한다. NLP 봇은 자연어 문의를 구문 분석하고, 대응하는 데이터 또 는 결과를 불러올 수 있다. NLP 봇은 음성 입력 또는 키 입력 질의를 수신할 수 있다. 음성-텍스트 엔진은 음성 문의를 텍스트로 변환하는 것을 도울 수 있다. 반도체 제조 시스템에서 NLP 봇을 가지는 것은 음성 기반 장애 처리, 도구의 최적화뿐만 아니라 음성 제어를 가능하게 한다. 다른 예시적인 실시형태는 MTTR 및 MTBF를 개선하 기 위해 반도체 제조 시스템 상의 NLP 봇 또는 LP 봇을 사용한다. 다른 예시적인 실시형태는 반도체 제조 시스템 상의 AI 엔진 또는 대화형 봇과 통신하는 헤드기어 시스템을 포 함한다. 헤드기어 시스템은 주어진 도구와 접속하기 위한 웨어러블 입력 및 출력을 포함한다. 이러한 헤드기어 시스템은 스피커, 마이크로폰을 포함할 수 있고, 또한 시각적 디스플레이를 포함할 수 있다. 헤드기어 시스템은 자연어 입력을 수신할 수 있다. 헤드기어 시스템 또는 헤드기어 유닛과 통신하는 프로세서는 음성 언어를 텍스 트로 변환하여, 반도체 제조 시스템 상의 텍스트 봇 또는 대화형 봇과 상호 작용할 수 있다. 특정 실시형태는 NLP 엔진을 통한 텍스트 매뉴얼의 수집, 및 반도체 장비에 대한 대화형 AI 인터페이스를 생성 하는 AI 교육 결정 매트릭스를 포함한다. 따라서, 특정 실시형태에서, 가상 컨설턴트로부터의 응답은 제품 매뉴 얼, 및 프리젠테이션, 지식 문서, 비디오 및 기타 데이터와 같은 많은 다른 소스로부터의 지식을 활용한다. AI 엔진은 또한 도구 진단, 경보, 전달 로그, 계측 데이터, 및 이미지, 제조 운영 관리 소프트웨어, 사용자 메모, 및 사용자 인터페이스 콘솔 액세스를 포함하는 동적 소스로부터 데이터를 수집할 수 있다. 데이터 수집을 위해, 하나 이상의 데이터 서버가 다양한 미가공 데이터를 수신하도록 구성될 수 있다. 데이터는 임의의 도구 관련 리소스로부터 소비될 수 있다. 예를 들어, 데이터는 장비 제조업체뿐만 아니라 칩 제조업체의 서버로부터 추출될 수 있다. 데이터는 구조화 및 비구조화된 소스로부터 추출, 변환 및 로드된다. 데이터 전처 리 단계를 실행할 수 있다. 이러한 것은 키 쌍 인덱싱, 문장 분할, 토큰화, 품사 태깅, 괄호 수정 등을 포함할 수 있다. 데이터 전처리는 진단 데이터 학습을 또한 포함할 수 있다. 이러한 것은 데이터 구조화, 파라미터에 기초하여 경보를 트리거링하는 질의를 위한 애플리케이션 프로그램 인터페이스가 있는 모델 생성, 또는 요청 시 에 그래프 가져오기를 포함할 수 있다. 데이터 분석은 푸시 통지를 이용하여 크리프(creep), 드리프트(drift) 또는 비정상적인 경보를 해결하도록 사용될 수 있다. 데이터 전처리 후에, 모델 선택이 실행될 수 있다. 이것은 토픽 모델링, 기계 번역, 대화 시스템 분석, 질의 서 열 및 질문 답변을 포함할 수 있다. 모델 선택 및 생성은 지식 그래프 또는 매트릭스에 입력될 수 있다. 선택적 향상은 대화형 관리 정보 시스템 및 실행 정보 시스템을 형성하는 것을 포함할 수 있다. 이러한 것은 예를 들어 협업 지식 기반, 과제/작업에 대한 추천 시스템, 주기 시간 통찰력 등을 제공한다. 특정 실시형태에서, 대화형 AI 엔진은 사용자 질의, 명령 및 동작에 응답하여 이러한 모델 및 시스템 중 일부 또는 전부에 액세스할 수 있다. 일부 실시형태에서, AI 엔진은 도구 사용, 레시피 선택, 작동 파라미터, 및 기 타 동작을 모니터링하고, 그런 다음 사용자에게 최적화된 레시피를 제안하고, 잠재적 오류를 경고 또는 예측하 고, 가동 시간을 늘리기 위해 수리를 권장하고, 일반적으로 가동 시간과 수율을 높이기 위해 다른 동작 및 제안 을 권장할 수 있다. 다양한 인터페이스가 사용될 수 있다. 인터페이스는 고급 NLP 및 AI 봇 기능, AR 사용자 인 터페이스, 컴퓨터 비전 생산성, 원격 도구 액세스 IT 인프라, 팹 분석, 및 디지털 트윈 및 가상 팹 운영을 포함 할 수 있다. 특정 실시형태는 하나 초과의 질문 및 하나 초과의 답변이 있는 질문 및 답변을 나타내도록 구성된 다중 계층적 대화를 가지는 온-툴 대화형 AI 시스템을 포함한다. 특정 실시형태에서, AI 엔진은 반도체 제조 환경의 다른 영 역으로부터의 계측 데이터를 연결하여, 반도체 장비의 성능 및 동작 품질을 이롭게 할 수 있다. 특정 실시형태 에서, 반도체 제조 환경은 예를 들어 몇 가지 도구가 있는 방 또는 다른 공간, 대규모 팹, 또는 다른 건물 및지리적 영역에 위치된 도구를 포함할 수 있다. 특정 실시형태는 액세스 가능한 도구로부터의 데이터, 및 전 세 계의 데이터를 활용할 수 있다. 특정 실시형태에서, AI 엔진은 세계 어느 위치에서도 사용되는 도구로부터 계측 데이터를 분석하고, 최상의 성능의 도구(들)를 식별하고, 최상의 성능의 도구(들)에 속하지 않는 도구에 대한 작동 파라미터를 권장할 수 있다. 특정 실시형태는 사용자에 의해 사용 가능하거나 착용 가능한 AR 디바이스와 접속하는 AI 엔진을 사용하는 것을 포함한다. 예를 들어, AR 장비를 사용하여, 사용자(예컨대, 현장 서비스 엔지니어)는 수리 또는 서비스를 위해 반도체 제조 시스템의 일부를 관찰할 수 있으며, 정보는 그 특정 반도체 제조 시스템에 직접 오버레이된다. 이 러한 것은 도구 기술자의 교육 시간을 단축할 수 있다. 모든 서비스 절차를 다루는 광범위한 수업을 제공하는 대신, 자세한 지침이 주문형 도구로 기술자에게 제공될 수 있다. 이미지와 비디오는 디바이스 부품에서 오버레 이될 수 있다. 오디오 지침은 비디오를 수반할 수 있다. 연결된 대화형 봇은 \"이 트랙 도구 상의 저항 펌프에 어떻게 액세스합니까?\"와 같은 자연어 요청에 응답할 수 있다. AR 시스템은 액세스 패널로 사용자를 안내하고, 제거할 패스너를 표시하고, 펌프의 위치를 디스플레이하고, 수리/교체 방법을 지시할 수 있다. 임의의 적절한 질문은 자습서를 통해 답해질 수 있으며, 어떠한 유형의 이미지 형식도 화살표 또는 시각적으로 강조된 부분과 같은 도구에 오버레이될 수 있다. 특정 실시형태에서, AR 시스템은 도구 수리뿐만 아니라 도구 사용에도 유용할 수 있다. 특정 실시형태에서, AR 시스템은 웨이퍼 로딩, 레시피 생성, 제어 패널 액세스 및 설명에 대해 사용자에게 지시할 수 있다. 특정 실시 형태에서 AR 및 AI 시스템은 가장 널리 공지된 방법을 체계적으로 제공할 수 있어서, 정확히 동일한 방법이 반 도체 산업의 다수의 응용에서 사용될 수 있다. 예를 들어, 사용자는 다른 재료에 선택적인 실리콘-게르마늄 층 을 에칭할 필요가 있다. 이러한 층은 80%의 실리콘과 20%의 게르마늄을 포함할 수 있다. 사용자는 SiGe 80/20을 에칭하기 위한 가장 널리 공지된 방법을 대화형 봇 또는 AR 시스템에 요청하고, 대화형 봇은 하나 이상의 답변 을 돌려준다. 답변은 관심 도구에 대한 에칭을 위한 BKM을 포함할 수 있으며, 원하는 재료를 더 높은 정확도로 에칭할 다른 도구를 나타낼 수도 있다. AR에 더하여, 특정 실시형태는 VR을 활용한다. 특정 실시형태에서, AI 엔진 및 관련 데이터 처리는 반도체 환경 으로부터 심층 학습을 실행하여, 동일한 사용자가 이용할 수 있는 동일한 정보를 가지는 것에 의해 Copy Exact 절차가 될 수 있는 절차를 생성할 수 있다. AR 및 VR 시스템은 도구 사용과 도구 교육 모두에 사용될 수 있다. 주어진 도구를 작동시키고 서비스하는 방법을 배우기 위해 사용자가 거리를 이동하는 대신, 지침은 가상 현실을 통해 제공될 수 있다. 사용자는 헤드셋을 통해 노 도구를 서비스하거나 플라즈마 기반 에칭 레시피를 시작하는 방법을 알 수 있다. 가상 교육 후에, 도구에 있는 동안, AR은 도구 사용을 지원하여, Copy Exact가 구현되는 것 을 보장하도록 사용될 수 있다. 헤드셋 및 기타 비디오 녹화 장비는 비디오 클립(video clip)을 녹화하고 생성하도록 사용될 수 있으며, 이는 그런 다음 Copy Exact 상태에 대한 BKM으로서 식별될 수 있다. BKM의 식별은 수동 분류에 의해 또는 AI 엔진으 로부터의 분석에 의해 실행될 수 있다. 예를 들어, 노련한 현장 서비스 기술자는 일반적이지 않은 도구 수리를 수행하고 헤드셋으로부터 공정을 기록할 수 있다. 사용자는 그런 다음 대화형 AI 봇에게 방금 수행된 공정이 특 정 문제를 해결하는 최상의 방식이라고 말한다. 관련된 NLP 봇은 해당 코멘트를 구문 분석하고, 비디오 클립을 식별하며, 후속 사용자에 의한 액세스를 위해 해당 비디오 클립을 데이터 매트릭스에 저장할 수 있다. 후속 사 용자는 그 특정 문제에 대한 임의의 솔루션이 있는지를 대화형 봇/AI 엔진에 요청할 수 있다. 대화형 봇은 그런 다음 답변으로 응답하고, 관련 비디오 클립을 디스플레이하며, AR 지원도 제공할 수 있다. 일부 실시형태에서, 헤드기어 또는 웨어러블 사용자 디바이스는 음성 명령을 통해 AI 텍스트 인터페이스에 대한 액세스를 제공하고, 반도체 제조 시스템(들)에 제어 가능하게 연결된다. AI 엔진에 대한 질의로부터 수집된 정 보는 특정 반도체 제조 시스템의 사용자를 위한 데이터의 그래픽 표현을 형성하는데 사용될 수 있다. AI 엔진 또는 기타 분석 도구를 통한 심층 학습은 반도체 제조 시스템의 온보드 작동 능력의 기능을 향상시키기 위해 반도체 제조 시스템에서 사용될 수 있다. AI 엔진의 응답 및 동작은 사용자 문의 또는 도구 사용에 대한 백그라운드 모니터링에 대한 응답일 수 있다. AI 엔진은 반도체 장비의 상이한 부분들로부터의 데이터 세트를 비교 및 대조하도록 구성된 웹 인터페이스를 포함할 수 있다. 도구의 AI 엔진은 가장 널리 공지된 방법 사이의 비교를 제공하고, 심층 학습을 적용하여 가능한 방법의 세트 중에서 어떤 방법이 더 잘 수행되는지를 확립할 수 있다. 이러한 비교는 AI 분석에 기초할 수 있다. 특정 실시형태는 특정 절차에 대한 최선의 방법을 식별하고 저장할 뿐만 아니라 그 절차를 업데이트 및 추적하 는 AI 엔진 및 심층 학습 시스템을 포함할 수 있다. 이러한 BKM 모니터링은 주어진 BKM의 효능 또는 BKM의 대체를 위한 후보 방법을 결정하는 데이터의 세트에 대해 검증될 수 있다. 특정 실시형태는 인터넷에 연결됨이 없이 폐쇄형 시스템에서 온보드 또는 온-툴 AI를 사용할 수 있다. 이러한 폐쇄형 시스템 AI는 반도체 장비의 가치와 기능을 향상시키기 위해 로컬 데이터 환경의 로컬 미니마(local minima) 및 최적화를 이해하도록 구성될 수 있다. 최적화 파라미터의 예는 가동 시간, MTBF, MTTR, 전반적인 장 비 효율성(OEE)뿐만 아니라 AI 응답 및 동작으로부터 성능 메트릭을 향상시키는 기타 파라미터를 포함한다. 특정 실시형태에서, 반도체 제조 시스템 AI 엔진은 일정한 피드백 조건 또는 피드 포워드 조건의 업데이트를 생 성하는 고급 공정 제어(APC) 기술뿐만 아니라 기본 도구 제어 시스템에 연결될 수 있다. 특정 실시형태에서, 반 도체 제조 시스템 AI 엔진은 온보드 오류 코드의 분석을 진단 및 생성하고, 사용자(또는 사용자 인터페이스)에 그 오류 코드로부터 복구하는 절차를 전달하도록 구성될 수 있다. 특정 실시형태는 NLP 엔진이 있는 텍스트 봇을 가지는 반도체 제조 시스템을 포함한다. NLP 엔진은 그런 다음 서면 또는 음성 사용자 문의를 구문 분석하고, 저장된 데이터(온-툴 또는 네트워크 기반)에 액세스하고 텍스트 응답을 제공할 수 있다. 특정 실시형태에서, AI 및 심층 학습 엔진은 나중에 리콜을 위해 특정 반도체 도구 또는 관련 도구에서 전문가 사용자에 의해 이전에 수행된 주어진 성능 및 기록 경험을 이미지화하도록 사용될 수 있다. 헤드기어는 특정 반 도체 제조 시스템에서 온보드(또는 네트워크화된) AI에 의해 검색될 수 있는 이러한 절차 비디오 클립을 녹화하 는데 사용될 수 있다. 특정 실시형태는 2개의 헤드기어를 포함한다. 하나의 헤드기어 유닛은 가상 현실의 환경에서 사용될 수 있는 반 면에, 또 다른 헤드기어 유닛은 반도체 제조 시스템의 원격 접근성을 촉진하기 위해 AR의 환경에서 사용될 수 있다. VR 또는 AR의 주어진 헤드기어 유닛은 AR 또는 VR인 다른 헤드기어에 연결될 수 있다. 따라서, 원격 VR 또는 AR 사용자는 지원이나 교육 또는 협업을 위해 로컬 AR 또는 VR 사용자와 연결될 수 있다. 특정 실시형태는 반도체 장비의 특정 부분 상의 AI 엔진 또는 시스템과 상호 작용하는 다른 전문가에 의해 사용되는 AR 시스템에 액세스하기 위한 헤드기어 또는 다른 사용자 인터페이스의 사용을 포함할 수 있다. 원격 사용자는 학습하거나 평가하기 위해 로컬 사용자를 관찰할 수 있다. 추가로 또는 대안으로서, 원격 사용자는 AR 장비 및 AI 엔진을 통해 로컬 사용자에게 지시할 수 있다. 특정 실시형태에서, 원격 및 로컬 AR/VR 사용자는 로컬 영역 네트워크를 통해 동일한 건물 또는 캠퍼스 내로부터 서로 및 주어진 도구에 연결될 수 있거나, 또는 인터넷을 통해 상당한 거리 또는 국제간 거리에 걸쳐서 연결될 수 있다. 따라서, 전문가를 관심 도구의 현장으로 운반하는 것은 불필 요할 수 있다. 대신 원격 또는 로컬 위치로부터, 초보자와 전문가 사용자는 서로 상호 작용하고 관심 도구 상의 하나 이상의 봇과 대화할 수 있다. 도구 또는 반도체 환경에 의존하여, 도구는 다양한 수준의 자동화된 지원을 위한 텍스트 봇, NLP 대 텍스트 봇, 가상 교환원 및 AI 엔진을 가질 수 있다. 특정 실시형태에서, 반도체 제조 시스템의 AI 엔진은 구조화된 학습을 통해 특정 반도체 제조 시스템의 입력 및 출력 데이터와 작동 효율성을 최적화하는 방법을 학습하도록 구성된다. 도구 상의 AI 엔진(또는 도구와 네트워 크 통신하는)은 해당 도구의 기능을 최적화하기 위해 반도체 제조 시설(또는 시설들)의 다른 곳에서 이용 가능 한 관련 수율 데이터를 연결하도록 구성된다. 특정 실시형태에서, 온-툴 자동화 비서(텍스트 봇, NLP 봇, 언어 봇, AI 엔진)는 현장 서비스 엔지니어링으로 확대되기 전에 정보 및 리소스의 제1 지점으로서 기능할 수 있다. 도 1은 예시적인 반도체 제조 시스템을 도시한다. 이러한 도구는 반도체 웨이퍼 또는 다른 마이크로 제작 기판을 처리/취급하도록 구성된 임의의 장치일 수 있다. 예를 들어, 반도체 제조 시스템은 코터-디벨 로퍼, 스캐너, 에처, 노, 도금 도구, 계측 도구 등일 수 있다. 사용자는 공정 엔지니어, 기술자, 현장 서 비스 엔지니어 등과 같은 임의의 운영자일 수 있다. 반도체 제조 시스템은 온보드 가상 컨설턴트를 포함한다. 가상 컨설턴트는 LP 또는 NLP를 이용한 텍스트 챗 봇, 음성 대 텍스트 챗 봇, 가상 비서, 또는 AI 엔진 중 임의의 것으로서 또는 이들의 조합으로서 구현될 수 있다. 이러한 시스템을 사용하여, 주어진 사용 자는 주어진 웨이퍼 처리 공정을 수행하는 방법, 주어진 시간 프레임에 오류가 기록되었는 지, 특정 구성요소가 어떻게 수리 또는 교체되는지 등과 같은 임의의 질문에 대한 답변을 가상 컨설턴트에게 직접 질의할 수 있다. 도 2는 예시적인 반도체 제조 시스템을 추가로 도시한다. 특정 반도체 제조 시스템이 설명되고 예시되었지만, 본 개시내용은 임의의 적절한 반도체 제조 시스템을 고려한다. 도 2의 예에서, 반도체 제조 시스템은 예를 들어 진공 챔버, 서셉터, 유도 코일, 분배 노즐, 광학 기기 및 기타 종래의 특징부를 포함할 수 있는 공정 구성 요소를 포함한다. 웨이퍼 핸들링 시스템은 사용자 또는 웨이퍼 카트리지로부터 웨이퍼를 수용하고, 처리 모듈로 이송하고, 입력/출력 포트 또는 도구 내의 다른 모듈로 복귀시키기 위한 핸들러 및 관련 로봇을 포함할 수 있다. 제어기는 로봇, 밸브, 스핀 컵, 노출 칼럼 및 임의의 다른 도구 구성요소의 제어를 포함하 여, 도구를 제어하기 위해 도구 프로세서, 메모리 및 관련 전자 기기를 모두 포함할 수 있다. 사용자 인터페이 스는 임의의 디스플레이 스크린, 물리적 제어부, 원격 네트워크 인터페이스, 로컬 인터페이스 등을 포함할 수 있다. 가상 컨설턴트는 어떠한 네트워크 연결도 없이 즉시 사용하기 위해 반도체 제조 시스템 상에 또 는 내에 설치될 수 있다. 추가로 또는 대안으로서, 가상 컨설턴트는 인접한 서버 또는 네트워크에 설치될 수 있다. 가상 컨설턴트는 원격 위치에 설치될 수 있고, 임의의 수의 다양한 도구를 연결하거나 지원할 수 있다. 도 3은 데이터 수집, 검색 및 심층 학습을 위한 예시적인 아키텍처를 도시한다. 데이터 소스(222, 223, 224)는 데이터를 추출하기 위해 액세스될 수 있다. 이러한 데이터는 포맷되거나 미가공될 수 있다. 데이터 프로세서 는 ETL 모듈, 정적 및 동적 데이터(232, 234)로부터 학습하기 위한 엔진, 및 NLP 엔진과 같은 임의의 다른 데이터 학습 및 포맷 엔진을 포함할 수 있다. 처리된 데이터는 가상 컨설턴트에게 이용되거나 푸시될 수 있다. 가상 컨설턴트는 주어진 네트워크에 위치되거나 또는 반도체 제조 시스템 내에 위치될 수 있다. 로컬 사용자(105-1)는 예를 들어 반도체 제조 시스템에 있는 대화형 봇에 직접 액세스할 수 있다. 원격 사용자(105-2)는 또한 네트워크 연결을 통해 반도체 제조 시스템에 액세스할 수 있다. 도 4는 사용자와 예시적인 가상 비서 사이의 예시적인 상호 작용을 도시한다. 도 4의 예에서, 로컬 사용자(105- 1)는 반도체 제조 시스템에 물리적으로 액세스할 수 있다. 이러한 것은 임의의 사용자 입력을 통해 달성될 수 있다. 이러한 예에서, 로컬 사용자(105-1)는 AR 헤드셋을 착용하고 있다. 이러한 것은 도구 또는 제어 패널 을 볼 때 부품 및 구성요소의 시각적 오버레이를 포함할 수 있다. AR 헤드셋을 통해, 로컬 사용자(105-1)는 자 연어 음성에 의한 것과 같이 가상 컨설턴트와 통신할 수 있다. 가상 컨설턴트는 오디오, 텍스트, 비 디오 또는 기타 미디어를 통해 답변을 돌려줄 수 있다. 가상 컨설턴트는 온-툴 또는 네트워크에 위치될 수 있고, 저장된 실시간 데이터를 검색하기 위해 데이터 프로세서에 액세스할 수 있다. 원격 사용자(105-2)는 가상 컨설턴트 및 로컬 사용자(105-1) 모두와 통신할 수 있다. VR 헤드셋을 사용하여, 원격 사용자는 로컬 사용자(105-1)로부터의 비디오 및 오디오를 보고, 로컬 사용자(105-1)에게 명령어를 전송할 수 있다. 두 사용자 모두 협업하거나 전문가 및 초보자일 수 있다. 예를 들어, 전문가 사용자는 원격지에 위치될 수 있고, 다른 국가 또는 지역에 있을 수 있는 위치에 위치된 로컬 사용자를 지원할 수 있다. 대안적으로, 로컬 사용자는 도구 운영 및 유지 보수에 대해 다양한 원격 사용자를 교육하는 전문가일 수 있다. 사용자와 특정 가상 비서 사 이의 특정한 상호 작용이 기술되고 예시되었지만, 본 명세서는 사용자와 임의의 적절한 가상 비서 사이의 어떠 한 적합한 상호 작용도 고려한다. 도 5는 예시적인 스마트-봇 솔루션을 도시한다. 도 5의 예에서, 팹 도구를 위한 AI/ML 기반 솔루션은 공정 엔지 니어링 효율성, 도구 및 장비 전반에 걸친 웨이퍼 균일성, 장비 가동 시간을 개선하기 위해 제공된다. 이해할 수 있는 바와 같이, 임의의 적절한 수의 사용자 및 대화형 봇 구성은 반도체 제조 시스템을 위한 자동화된 지원 을 제공하기 위해 고려된다. 특정 실시형태에서, 교육이나 여행 없이 지원이 제공될 수 있다. 도 6은 예시적인 컴퓨터 시스템을 도시한다. 특정 실시형태에서, 하나 이상의 컴퓨터 시스템은 본 명세서에 기술되거나 도시된 하나 이상의 방법의 하나 이상의 단계를 수행한다. 특정 실시형태에서, 하나 이상 의 컴퓨터 시스템은 본 명세서에 기술되거나 예시된 기능을 제공한다. 특정 실시형태에서, 하나 이상의 컴퓨터 시스템에서 실행되는 소프트웨어는 본 명세서에서 설명되거나 예시된 하나 이상의 방법의 하나 이 상의 단계를 수행하거나 본 명세서에서 설명되거나 예시된 기능을 제공한다. 특정 실시형태는 하나 이상의 컴퓨 터 시스템의 하나 이상의 부분을 포함한다. 여기에서, 컴퓨터 시스템에 대한 언급은 컴퓨팅 디바이스를 포함할 수 있으며, 적절한 경우 그 반대도 가능하다. 또한, 컴퓨터 시스템에 대한 언급은 적절한 경우 하나 이 상의 컴퓨터 시스템을 포함할 수 있다. 본 개시내용은 임의의 적절한 수의 컴퓨터 시스템을 고려한다. 본 개시내용은 임의의 적절한 물리적 형태 를 취하는 컴퓨터 시스템을 고려한다. 예로서 그리고 제한없이, 컴퓨터 시스템은 임베디드 컴퓨터 시스템, 시스템 온 칩(SOC), 단일 보드 컴퓨터 시스템(SBC)(예를 들어, 컴퓨터 온 모듈(COM) 또는 시스템 온 모 듈(SOM)), 데스크톱 컴퓨터 시스템, 랩톱 또는 노트북 컴퓨터 시스템, 대화형 키오스크, 메인프레임, 컴퓨터 시 스템의 메시, 휴대폰, 개인 휴대 정보 단말기(PDA), 서버, 태블릿 컴퓨터 시스템, AR/VR 디바이스 또는 이들 중 둘 이상의 조합일 수 있다. 적절한 경우, 컴퓨터 시스템은 하나 이상의 컴퓨터 시스템을 포함하거 나; 단일 또는 분산되거나; 다수의 위치에 걸쳐 있거나; 다수의 머신에 걸쳐 있거나; 다수의 데이터 센터에 걸 쳐 있거나; 또는 하나 이상의 네트워크에서 하나 이상의 클라우드 구성요소를 포함할 수 있는 클라우드에 상주 할 수 있다. 적절한 경우, 하나 이상의 컴퓨터 시스템은 실질적인 공간적 또는 시간적 제한 없이 본 명세서에서 설명되거나 예시된 하나 이상의 방법의 하나 이상의 단계를 수행할 수 있다. 예로서 그리고 제한없이, 하나 이상의 컴퓨터 시스템은 본 명세서에 기술되거나 예시된 하나 이상의 방법의 하나 이상의 단계를 실 시간으로 또는 일괄 모드로 수행할 수 있다. 하나 이상의 컴퓨터 시스템은 적절한 경우, 상이한 시간에 또는 상이한 위치에서 본 명세서에 기술되거나 예시된 하나 이상의 방법의 하나 이상의 단계를 수행할 수 있다. 특정 실시형태에서, 컴퓨터 시스템은 프로세서, 메모리, 저장 장치, 입력/출력(I/O) 인터페이스, 통신 인터페이스 및 버스를 포함한다. 비록 본 개시내용이 특정 배열로 특정 수 의 특정 구성요소를 가지는 특정 컴퓨터 시스템을 설명하고 예시하지만, 본 개시내용은 임의의 적절한 배열로 임의의 적절한 수의 임의의 적절한 구성요소를 가지는 임의의 적절한 컴퓨터 시스템을 고려한다. 특정 실시형태에서, 프로세서는 컴퓨터 프로그램을 만드는 것과 같은 명령어를 실행하기 위한 하드웨어를 포함한다. 예로서 그리고 제한없이, 명령어를 실행하기 위해, 프로세서는 내부 레지스터, 내부 캐시, 메 모리 또는 저장 장치로부터 명령어를 검색(또는 인출)하고; 이를 디코딩하고 실행하고; 그런 다음 하나 이상의 결과를 내부 레지스터, 내부 캐시, 메모리 또는 저장 장치에 기록할 수 있다. 특정 실 시형태에서, 프로세서는 데이터, 명령어 또는 어드레스를 위한 하나 이상의 내부 캐시를 포함할 수 있다. 본 개시내용은 적절한 경우 임의의 적절한 수의 임의의 적절한 내부 캐시를 포함하는 프로세서를 고려한 다. 예로서 그리고 제한없이, 프로세서는 하나 이상의 명령어 캐시, 하나 이상의 데이터 캐시, 및 하나 이상의 변환 색인 버퍼(TLB)를 포함할 수 있다. 명령어 캐시에 있는 명령어는 메모리 또는 저장 장치 에 있는 명령어의 사본일 수 있으며, 명령어 캐시는 프로세서에 의한 해당 명령어의 검색 속도를 높일 수 있다. 데이터 캐시에 있는 데이터는 프로세서에서 실행되는 명령어가 동작시키는 메모리 또는 저장 장치에 있는 데이터; 프로세서에서 실행되는 후속 명령어에 의한 액세스를 위해 또는 메 모리 또는 저장 장치에 기록하기 위해 프로세서에서 실행된 이전 명령어의 결과; 또는 기타 적합한 데이터의 사본일 수 있다. 데이터 캐시는 프로세서에 의한 판독 또는 기록 작업의 속도를 높일 수 있다. TLB는 프로세서의 가상 어드레스 변환 속도를 높일 수 있다. 특정 실시형태에서, 프로세서는 데이터, 명령어 또는 어드레스에 대한 하나 이상의 내부 레지스터를 포함할 수 있다. 본 개시내용은 적절한 경 우 임의의 적절한 수의 임의의 적절한 내부 레지스터를 포함하는 프로세서를 고려한다. 적절한 경우, 프 로세서는 하나 이상의 산술 논리 유닛(ALU)을 포함하거나; 멀티 코어 프로세서이거나; 또는 하나 이상의 프로세서를 포함할 수 있다. 본 개시내용이 특정 프로세서를 설명하고 예시하지만, 본 개시내용은 임의의 적절한 프로세서를 고려한다. 특정 실시형태에서, 메모리는 프로세서가 실행할 명령어 또는 프로세서가 동작시킬 데이터를 저장하기 위한 메인 메모리를 포함한다. 예로서 그리고 제한없이, 컴퓨터 시스템은 저장 장치 또는 다른 소스(예를 들어, 다른 컴퓨터 시스템 등)로부터 메모리로 명령어를 로드할 수 있다. 프로세서 는 그런 다음 메모리로부터 내부 레지스터 또는 내부 캐시로 명령어를 로드할 수 있다. 명령어를 실행하기 위해, 프로세서는 내부 레지스터 또는 내부 캐시로부터 명령어를 검색하고, 이들을 디코딩할 수 있다. 명령어의 실행 동안 또는 실행 후에, 프로세서는 하나 이상의 결과(중간 또는 최종 결과일 수 있음)를 내부 레지스터 또는 내부 캐시에 기록할 수 있다. 프로세서는 그런 다음 이러한 결과 중 하나 이 상을 메모리에 기록할 수 있다. 특정 실시형태에서, 프로세서는 (저장 장치 또는 기타와 대 비되는 바와 같은) 하나 이상의 내부 레지스터 또는 내부 캐시 또는 메모리에서 명령어만을 실행하고, (저장 장치 또는 기타와 대비되는 바와 같은) 하나 이상의 내부 레지스터 또는 내부 캐시 또는 메모리 에 있는 데이터만을 동작시킨다. 하나 이상의 메모리 버스(각각 어드레스 버스 및 데이터 버스를 포함할 수 있음)는 프로세서를 메모리에 연결할 수 있다. 버스는 아래에 설명된 바와 같이 하나 이 상의 메모리 버스를 포함할 수 있다. 특정 실시형태에서, 하나 이상의 메모리 관리 유닛(MMU)은 프로세서(100 2)와 메모리 사이에 상주하고, 프로세서에 의해 요청된 메모리에 대한 액세스를 용이하게 한 다. 특정 실시형태에서, 메모리는 랜덤 액세스 메모리(RAM)를 포함한다. 이러한 RAM은 적절한 경우 휘발 성 메모리일 수 있다. 적절한 경우, 이러한 RAM은 동적 RAM(DRAM) 또는 정적 RAM(SRAM)일 수 있다. 또한, 적절 한 경우, 이러한 RAM은 단일 포트 또는 다중 포트 RAM일 수 있다. 본 개시내용은 임의의 적절한 RAM을 고려한다. 메모리는 적절한 경우 하나 이상의 메모리를 포함할 수 있다. 본 개시내용이 특정 메모 리를 설명하고 예시하지만, 본 개시내용은 임의의 적절한 메모리를 고려한다. 특정 실시형태에서, 저장 장치는 데이터 또는 명령어를 위한 대용량 저장 장치를 포함한다. 예로서 그리 고 제한없이, 저장 장치는 하드 디스크 드라이브(HDD), 플로피 디스크 드라이브, 플래시 메모리, 광 디스 크, 자기 광 디스크, 자기 테이프 또는 범용 직렬 버스(USB) 드라이브 또는 이들 중 둘 이상의 조합을 포함할수 있다. 저장 장치는 적절한 경우 이동식 또는 비이동식(또는 고정) 매체를 포함할 수 있다. 저장 장치 는 적절한 경우 컴퓨터 시스템의 내부 또는 외부에 있을 수 있다. 특정 실시형태에서, 저장 장치 는 비휘발성 솔리드 스테이트 메모리이다. 특정 실시형태에서, 저장 장치는 판독 전용 메모리(RO M)를 포함한다. 적절한 경우, 이러한 ROM은 마스크 프로그래밍 ROM, 프로그램 가능 ROM(PROM), 소거 가능 PROM(EPROM), 전기적 소거 가능 PROM(EEPROM), 전기적 변경 가능 ROM(EAROM) 또는 플래시 메모리 또는 이들 중 둘 이상의 조합일 수 있다. 본 개시내용은 임의의 적절한 물리적 형태를 취하는 대용량 저장 장치를 고려 한다. 저장 장치는 적절한 경우 프로세서와 저장 장치 사이의 통신을 용이하게 하는 하나 이 상의 저장 장치 제어 유닛을 포함할 수 있다. 적절한 경우, 저장 장치는 하나 이상의 저장 장치를 포함할 수 있다. 본 개시내용이 특정 저장 장치를 기술하고 예시하지만, 본 개시내용은 임의의 적절한 저장 장 치를 고려한다. 특정 실시형태에서, I/O 인터페이스는 컴퓨터 시스템과 하나 이상의 I/O 디바이스 사이의 통신을 위한 하나 이상의 인터페이스를 제공하는 하드웨어, 소프트웨어 또는 둘 모두를 포함한다. 컴퓨터 시스템(100 0)은 적절한 경우 이러한 I/O 디바이스 중 하나 이상을 포함할 수 있다. 이들 I/O 디바이스 중 하나 이상은 사 람과 컴퓨터 시스템 사이의 통신을 가능하게 할 수 있다. 예로서 제한 없이, I/O 디바이스는 키보드, 키 패드, 마이크로폰, 모니터, 마우스, 프린터, 스캐너, 스피커, 스틸 카메라, 스타일러스, 태블릿, 터치 스크린, 트랙볼, 비디오 카메라, 다른 적합한 I/O 디바이스 또는 이들 중 둘 이상의 조합을 포함할 수 있다. I/O 디바이 스는 하나 이상의 센서를 포함할 수 있다. 본 개시내용은 임의의 적절한 I/O 디바이스 및 이들을 위한 임의의 적절한 I/O 인터페이스를 고려한다. 적절한 경우, I/O 인터페이스는 프로세서가 이들 I/O 디 바이스 중 하나 이상을 구동하는 것을 가능하게 하는 하나 이상의 디바이스 또는 소프트웨어 드라이버를 포함할 수 있다. I/O 인터페이스는 적절한 경우 하나 이상의 I/O 인터페이스를 포함할 수 있다. 본 개시내 용이 특정 I/O 인터페이스를 설명하고 예시하지만, 본 개시내용은 임의의 적절한 I/O 인터페이스를 고려한다. 특정 실시형태에서, 통신 인터페이스는 컴퓨터 시스템과 하나 이상의 다른 컴퓨터 시스템 또 는 하나 이상의 네트워크 사이의 통신(예를 들어, 패킷 기반 통신 등)을 위한 하나 이상의 인터페이스를 제공하 는 하드웨어, 소프트웨어, 또는 둘 모두를 포함한다. 예로서 그리고 제한없이, 통신 인터페이스는 이더넷 또는 다른 유선 기반 네트워크와 통신하기 위한 네트워크 인터페이스 제어기(NIC) 네트워크 어댑터, 또는 WI-FI 네트워크와 같은 무선 네트워크와 통신하기 위한 무선 NIC(WNIC) 또는 무선 어댑터를 포함할 수 있다. 본 개시 내용은 임의의 적절한 네트워크 및 이를 위한 임의의 적절한 통신 인터페이스를 고려한다. 예로서 그리고 제한없이, 컴퓨터 시스템은 애드혹 네트워크, 개인 영역 네트워크(PAN), 근거리 통신망(LAN), 광역 통신 망(WAN), 대도시 통신망(MAN), 또는 인터넷의 하나 이상의 부분 또는 이들 중 둘 이상의 조합과 통신한다. 이러 한 네트워크 중 하나 이상의 하나 이상의 부분은 유선 또는 무선일 수 있다. 예로서, 컴퓨터 시스템은 무 선 PAN(WPAN)(예를 들어, BLUETOOTH WPAN 등), WI-FIFl 네트워크, WI-MAX 네트워크, 셀룰러 전화 네트워크(예 를 들어, GSM(Global System for Mobile Communication) 네트워크) 또는 기타 적합한 무선 네트워크 또는 이들 중 둘 이상의 조합과 통신할 수 있다. 컴퓨터 시스템은 적절한 경우 이들 네트워크 중 임의의 네트워크를 위한 임의의 적절한 통신 인터페이스를 포함할 수 있다. 통신 인터페이스는 적절한 경우 하나 이상 의 통신 인터페이스를 포함할 수 있다. 본 개시내용이 특정 통신 인터페이스를 설명하고 예시하더라도, 본 개시내용은 임의의 적절한 통신 인터페이스를 고려한다. 특정 실시형태에서, 버스는 컴퓨터 시스템의 구성요소를 서로 연결하는 하드웨어, 소프트웨어, 또 는 양자 모두를 포함한다. 예로서 제한 없이, 버스는 가속 그래픽 포트(AGP) 또는 기타 그래픽 버스, 향 상된 산업 표준 아키텍처(EISA) 버스, 전면 버스(FSB), 하이퍼트랜스포트(HT) 인터커넥트, 산업 표준 아키텍처 (ISA) 버스, INFINIBAND 상호 연결, 적은 핀 수(LPC) 버스, 메모리 버스, 마이크로 채널 아키텍처(MCA) 버스, 주변 구성 요소 상호 연결(PCI) 버스, PCI 익스프레스(PCIe) 버스, 직렬 고급 기술 부착(SATA) 버스, 비디오 전 자 표준 협회 로컬(VLB) 버스 또는 다른 적합한 버스 또는 이들 중 둘 이상의 조합을 포함할 수 있다. 버스 는 적절한 경우 하나 이상의 버스를 포함할 수 있다. 본 개시내용이 특정 버스를 설명하고 예시하 더라도, 본 개시내용은 임의의 적절한 버스 또는 상호접속을 고려한다. 여기에서, 컴퓨터 판독 가능한 비일시적 저장 매체 또는 매체들은 적절한 경우에, 하나 이상의 반도체 기반 또 는 다른 집적 회로(IC)(예를 들어, 필드 프로그래밍 가능 게이트 어레이(FPGA) 또는 주문형 IC(ASIC)), 하드 디 스크 드라이브(HDD), 하이브리드 하드 드라이브(HHD), 광 디스크, 광 디스크 드라이브(ODD), 광자기 디스크, 광 자기 드라이브, 플로피 디스켓, 플로피 디스크 드라이브(FDD), 마그네틱 테이프, 솔리드 스테이트 드라이브 (SSD), RAM 드라이브, 안전 디지털 카드 또는 드라이브, 기타 적절한 컴퓨터 판독 가능 비일시적 저장 매체 또는 이들 중 두 가지 이상의 적절한 조합 등)를 포함할 수 있다. 컴퓨터 판독 가능한 비일시적 저장 매체는 적절 한 경우에 휘발성, 비휘발성 또는 휘발성 및 비휘발성의 조합일 수 있다. 여기에서, \"또는\"은 달리 명시적으로 나타내거나 문맥상 달리 나타내지 않는 한 포괄적이며 배타적이지 않다. 따라서, 본 명세서에서, \"A 또는 B\"는 달리 명시적으로 나타내지 않거나 문맥상 달리 나타내지 않는 한 \"A, B 또는 둘 모두\"를 의미한다. 더욱이, \"및\"은 달리 명시적으로 나타내지 않거나 문맥에 의해 달리 나타내지 않는 한 둘 모두 공동 및 여러 개이다. 따라서, 본 명세서에서, \"A 및 B\"는 달리 명시적으로 나타내지 않거나 문맥상 달리 나타내지 않는 한 \"A 및 B, 공동으로 또는 각자\"를 의미한다. 본 개시내용의 범위는 당업자가 이해할 수 있는 본 명세서에 기술되거나 예시된 예시적인 실시형태에 대한 모든 변경, 대체, 변형, 대안 및 수정을 포함한다. 본 개시내용의 범위는 본 명세서에 기술되거나 예시된 예시적인 실시형태로 한정되지 않는다. 또한, 본 명세서에 개시된 실시형태는 예시일 뿐이며, 본 개시내용의 범위는 이러 한 것으로 한정되지 않는다. 특정 실시형태는 본 명세서에 개시된 실시형태의 구성요소, 요소, 특징부, 기능, 동작 또는 단계를 모두, 일부 포함하거나, 전혀 포함하지 않을 수 있다. 또한, 본 개시내용이 특정 구성요소, 요소, 특징부, 기능, 동작 또는 단계를 포함하는 것으로서 본 명세서의 각각의 실시형태를 설명하고 도시하더라 도, 이들 실시형태 중 임의의 것은 당업자가 이해할 수 있는 본 명세서의 어느 곳에서나 설명되거나 예시된 구 성요소, 요소, 특징부, 기능, 동작 또는 단계의 임의의 조합 또는 순열을 포함할 수 있다. 청구될 수 있는 요지는 첨부된 청구범위에서 제시된 특징부들의 특정 조합뿐만 아니라 다른 특징부들의 조합을 포함한다. 또한, 본 명세서에 기술되거나 예시된 임의의 실시형태 또는 특징부는 별도의 청구항에서 또는 본 명 세서에 기술되거나 예시된 임의의 실시형태 또는 특징부 또는 첨부된 청구범위의 임의의 특징부와 임의의 조합 으로 청구될 수 있다. 또한, 본 개시내용이 특정 이점을 제공하는 것으로서 특정 실시형태를 설명하거나 예시하 더라도, 특정 실시형태는 이러한 이점을 제공하지 않거나, 일부 또는 전부를 제공할 수 있다. 본 발명에 따른 실시형태는 특히 방법, 저장 매체, 시스템 및 컴퓨터 프로그램 제품에 관한 첨부된 청구항에 개 시되며, 하나의 청구항 카테고리, 예를 들어 방법에 언급된 임의의 특징부는 마찬가지로 다른 청구항 카테고리, 예를 들어, 시스템에서 청구될 수 있다. 첨부된 청구범위의 종속성 또는 참조는 형식적인 이유로만 선택된다. 그러나, 임의의 이전 청구항(특히 다중 종속성)을 고의적으로 참조로부터 초래되는 임의의 요지도 마찬가지로 청구될 수 있으며, 그래서 청구항과 그 특징부의 어떠한 조합도 개시되고 첨부된 청구범위에서 선택된 종속항에 관계없이 청구될 수 있다. 청구될 수 있는 요지는 첨부된 청구범위에 기재된 바와 같은 특징부의 조합뿐만 아니 라 청구항에서의 특징부의 임의의 다른 조합을 포함하며, 청구항에서 언급된 각각의 특징부는 청구항에서 임의 의 다른 특징부 또는 다른 특징부의 조합과 조합될 수 있다. 청구항의 다른 기능. 또한, 본 명세서에 기술되거 나 묘사된 실시형태 및 특징 중 임의의 것은 별도의 청구항에서 또는 본 명세서에 기술되거나 묘사된 임의의 실 시형태 또는 특징부 또는 첨부된 청구범위의 특징부 중 임의의 특징부와 조합으로 청구될 수 있다. 특정 기능을 수행하도록 적응, 배열, 가능, 구성, 활성화, 동작 가능 또는 동작하는 장치 또는 시스템 또는 장 치 또는 시스템의 구성요소에 대한 첨부된 청구 범위의 참조는 장치, 시스템 또는 구성요소가 그렇게 적응, 배 열, 가능, 구성, 활성화, 동작 가능 또는 동작하는 한 특정 기능이 활성화, 켜짐 또는 잠금 해제되는지 여부에 관계없이 그 장치, 시스템, 구성요소를 포함한다.도면 도면1 도면2 도면3 도면4 도면5 도면6"}
{"patent_id": "10-2023-7002488", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 예시적인 반도체 제조 시스템을 도시한다. 도 2는 도 1의 예시적인 반도체 제조 시스템을 추가로 도시한다. 도 3은 데이터 수집, 검색, 및 심층 학습을 위한 예시적인 아키텍처를 도시한다. 도 4는 사용자와 예시적인 가상 비서 사이의 예시적인 상호 작용을 도시한다. 도 5는 예시적인 스마트 봇 솔루션을 도시한다. 도 6은 예시적인 컴퓨터 시스템을 도시한다."}
