{"patent_id": "10-2017-0143676", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0048593", "출원번호": "10-2017-0143676", "발명의 명칭": "카메라 및 마이크를 이용한 스마트 미러 기반 개인 헬스케어 정보 보호 방법 및 시스템", "출원인": "부산대학교 산학협력단", "발명자": "김호원"}}
{"patent_id": "10-2017-0143676", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "웨어러블 디바이스 또는 외부 장치로 검진한 건강 정보가 저장된 데이터베이스로부터 사용자의 건강 정보를 조회하는 건강정보 조회부;스마트 미러의 화면과 스피커를 통해 상기 사용자의 건강 정보가 제공되도록 제어하는 제어부; 및상기 사용자의 신원 확인, 미등록 사용자 확인, 사용자 등록, 사용자 인원 확인 및 사용자 명령어를 처리하는사용자 인식부;를 포함하는 카메라 및 마이크를 이용한 스마트 미러 기반 개인 헬스케어 정보 보호 시스템."}
{"patent_id": "10-2017-0143676", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 건강정보 조회부는,상기 데이터베이스로부터 사용자의 혈당수치를 검색하여 제공하는 혈당수치 조회 모듈;상기 데이터베이스로부터 사용자의 혈압수치를 검색하여 제공하는 혈압수치 조회 모듈;상기 데이터베이스로부터 사용자의 체온수치를 검색하여 제공하는 체온 조회 모듈;상기 데이터베이스로부터 사용자의 심박수 정보를 검색하여 제공하는 심박수 조회 모듈;상기 데이터베이스로부터 사용자의 날씨 별 건강진단 정보를 검색하여 제공하는 진단내용 조회 모듈;을 포함하는 카메라 및 마이크를 이용한 스마트 미러 기반 개인 헬스케어 정보 보호 시스템."}
{"patent_id": "10-2017-0143676", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,상기 스마트 미러를 통해 제공되는 화면을 제어하는 화면 제어부; 및상기 스마트 미러를 통해 제공되는 소리를 제어하는 스피커 제어부;를 포함하는 카메라 및 마이크를 이용한 스마트 미러 기반 개인 헬스케어 정보 보호 시스템."}
{"patent_id": "10-2017-0143676", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 3에 있어서,상기 화면 제어부는,상기 혈당수치 조회 모듈이 조회한 상기 사용자의 혈당수치를 그래프로 표시하도록 제어하는 혈당수치 출력 모듈;상기 혈압수치 조회 모듈이 조회한 혈압수치를 그래프로 표시하도록 제어하는 혈압수치 출력 모듈;상기 체온조회 모듈이 조회한 체온수치를 그래프로 표시하도록 제어하는 체온조회 모듈;상기 심박수 조회 모듈이 조회한 심박수 정보를 그래프로 표시하도록 제어하는 심박수출력 모듈;공개특허 10-2019-0048593-3-사용자 이외의 미등록 사용자의 안면이 감지되고, 상기 미등록 사용자가 상기 스마트 미러를 통해 상기 사용자의 건강 정보를 확인할 수 있는 거리에 있는 경우, 상기 스마트 미러의 화면을 블라인드 처리하는 화면 블라인드 처리 모듈;상기 스마트 미러가 상기 사용자의 건강 정보를 제공 시에, 상기 사용자의 위치에 따라 시야각을 제어하는 시야각 제어 모듈;상기 스마트 미러 상에서 상기 사용자의 건강 정보를 출력할 위치와 크기를 제어하며, 상기 미등록 사용자가 일정 거리 이내로 감지되면 상기 스마트 미러를 블라인드 처리하고, 상기 사용자 이외의 미등록 사용자가 일정 거리 이상으로 감지되면 상기 건강 정보의 출력 윈도우를 작은 크기로 조절하여 상기 사용자의 위치로 이동하여표시하도록 제어하는 출력 윈도우 제어 모듈; 및상기 진단내용 조회 모듈이 검색한 사용자의 날씨 별 건강진단 정보를 표시하도록 제어하는 진단내용 출력모듈;을 포함하는 카메라 및 마이크를 이용한 스마트 미러 기반 개인 헬스케어 정보 보호 시스템."}
{"patent_id": "10-2017-0143676", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 3에 있어서,상기 스피커 제어부는,상기 사용자의 목소리의 크기 또는 상기 사용자와 상기 스마트 미러와의 거리에 따라 출력되는 음량을 제어하는음량 제어 모듈; 및상기 스마트 미러를 통해 제공되는 소리가 상기 사용자의 방향으로 출력되도록 제어하는 소리 방향 제어 모듈;을 포함하는 카메라 및 마이크를 이용한 스마트 미러 기반 개인 헬스케어 정보 보호 시스템."}
{"patent_id": "10-2017-0143676", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 1에 있어서,상기 사용자 인식부는,상기 사용자의 안면 인식을 통해 사용자를 확인하는 안면 인식부; 및상기 사용자의 목소리를 통해 사용자 인증 또는 명령을 처리하는 음성 인식부;를 포함하는 카메라 및 마이크를 이용한 스마트 미러 기반 개인 헬스케어 정보 보호 시스템."}
{"patent_id": "10-2017-0143676", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 6에 있어서,상기 안면 인식부는,사용자의 안면을 인식하여 사용자를 확인하는 안면 인식 모듈;상기 사용자 이외의 미등록 사용자를 인식하는 외부인 탐지 모듈; 및새로운 사용자의 등록 시 상기 새로운 사용자의 안면 정보를 등록하는 안면 등록 모듈;을 포함하는 카메라 및 마이크를 이용한 스마트 미러 기반 개인 헬스케어 정보 보호 시스템."}
{"patent_id": "10-2017-0143676", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "공개특허 10-2019-0048593-4-청구항 7에 있어서,상기 음성 인식부는,사용자의 음성 명령어를 인식하여 텍스트로 변환하는 음성 인식 모듈;사용자의 음성을 인식하여 등록된 사용자와의 음성 일치 여부를 판단하여 인증을 처리하는 화자 인증 모듈;상기 텍스트로 변환된 음성 명령어를 수신하여 명령을 처리하는 음성 명령 처리 모듈; 및새로운 사용자의 등록 시 목소리 정보를 저장하는 화자 등록 모듈;을 포함하는 카메라 및 마이크를 이용한 스마트 미러 기반 개인 헬스케어 정보 보호 시스템."}
{"patent_id": "10-2017-0143676", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "사용자 인식부가 사용자의 안면을 인식하여 상기 사용자가 인증 및 인가된 사용자인지 판단하는 제1 단계;상기 사용자 인식부가 상기 사용자가 인증 및 인가된 사용자로 판단한 경우, 제어부가 음성인식 프로세스에 의해 스마트 미러의 화면과 스피커를 통해 상기 사용자의 건강 정보가 제공되도록 제어하는 제2 단계; 및상기 사용자 인식부가 상기 사용자가 인증 및 인가되지 않은 사용자로 판단한 경우, 상기 제어부가 외부인 탐지및 블라인드 처리를 실행하는 제3 단계;를 포함하는 카메라 및 마이크를 이용한 스마트 미러 기반 개인 헬스케어 정보 보호 방법."}
{"patent_id": "10-2017-0143676", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 9에 있어서,상기 제1 단계는,사용자 인식부가 새로운 사용자의 안면을 인식하여 새로운 사용자를 등록하는 단계;를 더 포함하는 카메라 및 마이크를 이용한 스마트 미러 기반 개인 헬스케어 정보 보호 방법."}
{"patent_id": "10-2017-0143676", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 10에 있어서,상기 새로운 사용자를 등록하는 단계는,상기 사용자 인식부가 새로운 사용자의 등록 명령이 입력되는지 판단하는 단계;상기 사용자 인식부가 새로운 사용자의 등록 명령이 입력된 것으로 판단하면, 사용자 등록 과정을 수행하는 단계;상기 사용자 인식부가 사용자 정보를 입력 받는 단계; 및상기 사용자 인식부가 상기 새로운 사용자의 목소리를 등록하는 단계;를 포함하는 카메라 및 마이크를 이용한 스마트 미러 기반 개인 헬스케어 정보 보호 방법."}
{"patent_id": "10-2017-0143676", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 9에 있어서,상기 제2 단계는,상기 사용자 인식부가 사용자의 안면을 인식하여 동작하는 단계;공개특허 10-2019-0048593-5-상기 사용자 인식부가 상기 사용자의 음성을 통해 사용자를 인증하는 단계;상기 사용자 인식부가 상기 사용자의 음성 명령을 입력 받는 단계;상기 제어부가 상기 음성 명령에 따라 상기 사용자의 건강 정보를 제공하는 단계;를 포함하는 카메라 및 마이크를 이용한 스마트 미러 기반 개인 헬스케어 정보 보호 방법."}
{"patent_id": "10-2017-0143676", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 9에 있어서,상기 제3 단계는,상기 사용자 인식부가 사용자의 안면을 인식하여 동작하는 단계;상기 사용자 인식부가 상기 사용자를 외부인인 미등록 사용자인지 판단하는 단계;상기 사용자 인식부가 상기 사용자를 미등록 사용자로 판단하면, 상기 미등록 사용자가 일정 거리 이내에 있는지 판단하는 단계;상기 사용자 인식부가 상기 미등록 사용자가 일정 거리 이내에 있는 것으로 판단하면, 상기 스마트 미러를 블라인드 처리하는 단계; 및상기 사용자 인식부가 상기 미등록 사용자가 일정 거리 이내에 있지 않은 것으로 판단하면, 상기 건강 정보의출력 윈도우를 작은 크기로 조절하여 상기 사용자의 위치로 이동하여 표시하도록 제어하는 단계;를 포함하는 카메라 및 마이크를 이용한 스마트 미러 기반 개인 헬스케어 정보 보호 방법."}
{"patent_id": "10-2017-0143676", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 카메라 및 마이크를 이용한 스마트 미러 기반 개인 헬스케어 정보 보호 방법 및 시스템에 관한 것으로, 본 발명에 따른 카메라 및 마이크를 이용한 스마트 미러 기반 개인 헬스케어 정보 보호 시스템은 웨어러 블 디바이스 또는 외부 장치로 검진한 건강 정보가 저장된 데이터베이스로부터 사용자의 건강 정보를 조회하는 건강정보 조회부; 스마트 미러의 화면과 스피커를 통해 상기 사용자의 건강 정보가 제공되도록 제어하는 제어부; 및 상기 사용자의 신원 확인, 미등록 사용자 확인, 사용자 등록, 사용자 인원 확인 및 사용자 명령어를 처리하는 사용자 인식부;를 포함한다."}
{"patent_id": "10-2017-0143676", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 실시예는 카메라 및 마이크를 이용한 스마트 미러 기반 개인 헬스케어 정보 보호 방법 및 시스템에 관한 것이다."}
{"patent_id": "10-2017-0143676", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 사물 인터넷 분야의 기술 발달로 다양한 스마트 어플리케이션이 등장하고 있으며, 다른 분야의 기술을 융 합하여 새로운 응용 서비스를 제공하려는 움직임도 보인다. 예를 들면, 스마트 미러에 카메라와 마이크를 탑재하여 안면 인식 및 음성인식 기술과 같은 인공지능 기술이 적 용되고 있다. 최근에는 IoT 헬스케어 분야는 대학교 및 기업에서 스마트 미러를 이용한 건강정보 제공 및 관련 어플리케이션 개발 연구가 진행되고 있는데, 병원 또는 공공장소에서 스마트 미러 서비스를 제공함에 있어서 개인정보가 외부 에 노출될 가능성이 높다. 따라서, 개인정보에 대한 보호 기술 연구가 필요한 실정이다."}
{"patent_id": "10-2017-0143676", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술한 문제를 해결하기 위해 안출된 것으로서, 스마트 미러를 통해 제공되는 개인 건강정보를 보호 하기 위한 방법 및 시스템을 제시하고자 한다.보다 구체적으로, 본 발명은 화자인식을 통해 사용자와 외부인의 음성을 구분하고, 카메라에 의한 외부인 탐지 시 화면 블라인드 및 스마트 미러 화면 제어 기술을 이용하여 사용자 조작 없이도 프라이버시 보호가 가능하도 록 하고, 안면 및 목소리 인식에 의한 사용자 인증 기능을 강화하여, 화면이 넓은 스마트 미러에 표시된 개인정 보를 외부인에게 노출되지 않도록 하고자 한다."}
{"patent_id": "10-2017-0143676", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "전술한 문제를 해결하기 위한 본 실시예에 따른 카메라 및 마이크를 이용한 스마트 미러 기반 개인 헬스케어 정 보 보호 시스템은 웨어러블 디바이스 또는 외부 장치로 검진한 건강 정보가 저장된 데이터베이스로부터 사용자 의 건강 정보를 조회하는 건강정보 조회부; 스마트 미러의 화면과 스피커를 통해 상기 사용자의 건강 정보가 제 공되도록 제어하는 제어부; 및 상기 사용자의 신원 확인, 미등록 사용자 확인, 사용자 등록, 사용자 인원 확인 및 사용자 명령어를 처리하는 사용자 인식부;를 포함한다. 본 발명의 다른 일실시예에 따르면, 상기 건강정보 조회부는 상기 데이터베이스로부터 사용자의 혈당수치를 검 색하여 제공하는 혈당수치 조회 모듈; 상기 데이터베이스로부터 사용자의 혈압수치를 검색하여 제공하는 혈압수 치 조회 모듈; 상기 데이터베이스로부터 사용자의 체온수치를 검색하여 제공하는 체온 조회 모듈; 상기 데이터 베이스로부터 사용자의 심박수 정보를 검색하여 제공하는 심박수 조회 모듈; 상기 데이터베이스로부터 사용자의 날씨 별 건강진단 정보를 검색하여 제공하는 진단내용 조회 모듈;을 포함할 수 있다. 본 발명의 다른 일실시예에 따르면, 상기 스마트 미러를 통해 제공되는 화면을 제어하는 화면 제어부; 및 상기 스마트 미러를 통해 제공되는 소리를 제어하는 스피커 제어부;를 포함할 수 있다. 본 발명의 다른 일실시예에 따르면, 상기 화면 제어부는 상기 혈당수치 조회 모듈이 조회한 상기 사용자의 혈당 수치를 그래프로 표시하도록 제어하는 혈당수치 출력 모듈; 상기 혈압수치 조회 모듈이 조회한 혈압수치를 그래 프로 표시하도록 제어하는 혈압수치 출력 모듈; 상기 체온조회 모듈이 조회한 체온수치를 그래프로 표시하도록 제어하는 체온조회 모듈; 상기 심박수 조회 모듈이 조회한 심박수 정보를 그래프로 표시하도록 제어하는 심박수 출력 모듈; 사용자 이외의 미등록 사용자의 안면이 감지되고, 상기 미등록 사용자가 상기 스마트 미러를 통해 상기 사용자의 건강 정보를 확인할 수 있는 거리에 있는 경우, 상기 스마트 미러의 화면을 블라인드 처리하는 화면 블라인드 처리 모듈; 상기 스마트 미러가 상기 사용자의 건강 정보를 제공 시에, 상기 사용자의 위치에 따 라 시야각을 제어하는 시야각 제어 모듈; 상기 스마트 미러 상에서 상기 사용자의 건강 정보를 출력할 위치와 크기를 제어하며, 상기 미등록 사용자가 일정 거리 이내로 감지되면 상기 스마트 미러를 블라인드 처리하고, 상 기 사용자 이외의 미등록 사용자가 일정 거리 이상으로 감지되면 상기 건강 정보의 출력 윈도우를 작은 크기로 조절하여 상기 사용자의 위치로 이동하여 표시하도록 제어하는 출력 윈도우 제어 모듈; 및 상기 진단내용 조회 모듈이 검색한 사용자의 날씨 별 건강진단 정보를 표시하도록 제어하는 진단내용 출력 모듈;을 포함할 수 있다. 본 발명의 다른 일실시예에 따르면, 상기 스피커 제어부는 상기 사용자의 목소리의 크기 또는 상기 사용자와 상 기 스마트 미러와의 거리에 따라 출력되는 음량을 제어하는 음량 제어 모듈; 및 상기 스마트 미러를 통해 제공 되는 소리가 상기 사용자의 방향으로 출력되도록 제어하는 소리 방향 제어 모듈;을 포함할 수 있다. 본 발명의 다른 일실시예에 따르면, 상기 사용자 인식부는 상기 사용자의 안면 인식을 통해 사용자를 확인하는 안면 인식부; 및 상기 사용자의 목소리를 통해 사용자 인증 또는 명령을 처리하는 음성 인식부;를 포함할 수 있 다. 본 발명의 다른 일실시예에 따르면, 상기 안면 인식부는 사용자의 안면을 인식하여 사용자를 확인하는 안면 인 식 모듈; 상기 사용자 이외의 미등록 사용자를 인식하는 외부인 탐지 모듈; 및 새로운 사용자의 등록 시 상기 새로운 사용자의 안면 정보를 등록하는 안면 등록 모듈;을 포함할 수 있다. 본 발명의 다른 일실시예에 따르면, 상기 음성 인식부는 사용자의 음성 명령어를 인식하여 텍스트로 변환하는 음성 인식 모듈; 사용자의 음성을 인식하여 등록된 사용자와의 음성 일치 여부를 판단하여 인증을 처리하는 화 자 인증 모듈; 상기 텍스트로 변환된 음성 명령어를 수신하여 명령을 처리하는 음성 명령 처리 모듈; 및 새로운 사용자의 등록 시 목소리 정보를 저장하는 화자 등록 모듈;을 포함할 수 있다. 본 발명의 일실시예에 따른 카메라 및 마이크를 이용한 스마트 미러 기반 개인 헬스케어 정보 보호 방법은 사용 자 인식부가 사용자의 안면을 인식하여 상기 사용자가 인증 및 인가된 사용자인지 판단하는 제1 단계; 상기 사 용자 인식부가 상기 사용자가 인증 및 인가된 사용자로 판단한 경우, 제어부가 음성인식 프로세스에 의해 스마트 미러의 화면과 스피커를 통해 상기 사용자의 건강 정보가 제공되도록 제어하는 제2 단계; 및 상기 사용자 인 식부가 상기 사용자가 인증 및 인가되지 않은 사용자로 판단한 경우, 상기 제어부가 외부인 탐지 및 블라인드 처리를 실행하는 제3 단계;를 포함한다. 본 발명의 다른 일실시예에 따르면, 상기 제1 단계는 사용자 인식부가 새로운 사용자의 안면을 인식하여 새로운 사용자를 등록하는 단계;를 더 포함할 수 있다. 본 발명의 다른 일실시예에 따르면, 상기 새로운 사용자를 등록하는 단계는, 상기 사용자 인식부가 새로운 사용 자의 등록 명령이 입력되는지 판단하는 단계; 상기 사용자 인식부가 새로운 사용자의 등록 명령이 입력된 것으 로 판단하면, 사용자 등록 과정을 수행하는 단계; 상기 사용자 인식부가 사용자 정보를 입력 받는 단계; 및 상 기 사용자 인식부가 상기 새로운 사용자의 목소리를 등록하는 단계;를 포함할 수 있다. 본 발명의 다른 일실시예에 따르면, 상기 제2 단계는 상기 사용자 인식부가 사용자의 안면을 인식하여 동작하는 단계; 상기 사용자 인식부가 상기 사용자의 음성을 통해 사용자를 인증하는 단계; 상기 사용자 인식부가 상기 사용자의 음성 명령을 입력 받는 단계; 상기 제어부가 상기 음성 명령에 따라 상기 사용자의 건강 정보를 제공 하는 단계;를 포함할 수 있다. 본 발명의 다른 일실시예에 따르면, 상기 제3 단계는 상기 사용자 인식부가 사용자의 안면을 인식하여 동작하는 단계; 상기 사용자 인식부가 상기 사용자를 외부인인 미등록 사용자인지 판단하는 단계; 상기 사용자 인식부가 상기 사용자를 미등록 사용자로 판단하면, 상기 미등록 사용자가 일정 거리 이내에 있는지 판단하는 단계; 상기 사용자 인식부가 상기 미등록 사용자가 일정 거리 이내에 있는 것으로 판단하면, 상기 스마트 미러를 블라인드 처리하는 단계; 및 상기 사용자 인식부가 상기 미등록 사용자가 일정 거리 이내에 있지 않은 것으로 판단하면, 상기 건강 정보의 출력 윈도우를 작은 크기로 조절하여 상기 사용자의 위치로 이동하여 표시하도록 제어하는 단 계;를 포함할 수 있다."}
{"patent_id": "10-2017-0143676", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따르면 화자인식을 통해 사용자와 외부인의 음성을 구분하고, 카메라에 의한 외부인 탐지 시 화면 블라인드 및 스마트 미러 화면 제어 기술을 이용하여 사용자 조작 없이도 프라이버시 보호가 가능하도 록 하고, 안면 및 목소리 인식에 의한 사용자 인증 기능을 강화하여, 화면이 넓은 스마트 미러에 표시된 개인정 보를 외부인에게 노출되지 않도록 할 수 있다."}
{"patent_id": "10-2017-0143676", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 첨부한 도면을 참조하여 바람직한 본 발명의 일실시예에 대해서 상세히 설명한다. 다만, 실시형태를 설명함에 있어서, 관련된 공지 기능 혹은 구성에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수있다고 판단되는 경우 그에 대한 상세한 설명은 생략한다. 또한, 도면에서의 각 구성요소들의 크기는 설명을 위 하여 과장될 수 있으며, 실제로 적용되는 크기를 의미하는 것은 아니다. 본 발명은 IoT 헬스케어 응용 분야로서, 스마트 미러를 통해 보여주는 개인 건강정보를 보호하기 위한 방법을 제시하는 것에 목적이 있다. 이를 위하여 스마트 미러에 카메라와 스피커 및 마이크와 마이크를 연결하고, 사용자 안면 인식 및 화자 인식을 통해 혈당수치, 혈압수치, 체온, 심박수, 진단 내용을 표시한다. 또한, 개인 건강 정보 누출을 막기 위해 상시 외부인 탐지 시스템 및 화자 인증 시스템이 동작하여 스마트 미러 블라인드 기능 및 외부 목소리 탐지 및 차단 기능을 제공한다. 도 1은 본 발명의 일실시예에 따른 카메라 및 마이크를 이용한 스마트 미러 기반 개인 헬스케어 정보 보호 시스 템의 구성도이고, 도 2는 본 발명의 일실시예에 따른 건강정보 조회부의 구성도이고, 도 3은 본 발명의 일실시 예에 따른 제어부의 구성도이며, 도 4 및 도 5는 본 발명의 일실시예에 따른 사용자 인식부의 구성도이다. 이후부터는 도 1 내지 도 5를 참조하여 카메라 및 마이크를 이용한 스마트 미러 기반 개인 헬스케어 정보 보호 시스템의 구성을 설명하기로 한다. 도 1에 도시된 바와 같이 카메라 및 마이크를 이용한 스마트 미러 기반 개인 헬스케어 정보 보호 시스템은 건강 정보 조회부, 제어부, 사용자 인식부 및 데이터베이스를 포함하여 구성될 수 있다. 건강정보 조회부는 데이터베이스로부터 사용자의 개인정보를 조회하며, 상기 데이터베이스에는 웨어러블 디바이스 또는 외부에서 검진한 건강 정보가 저장되어 있다. 제어부는 스마트 미러의 화면과 스피커를 통해 상기 사용자의 건강 정보가 제공되도록 제어한다. 또한, 사용자 인식부는 상기 사용자의 신원 확인, 미등록 사용자 확인, 사용자 등록, 사용자 인원 확인 및 사용자 명령어를 처리하며, 상기 사용자 인식부는 안면 인식부 및 음성 인식부를 포함하여 구성 될 수 있다. 도 2를 참조하면, 상기 건강정보 조회부는 혈당수치 조회 모듈, 혈압수치 조회 모듈, 체온 조회 모듈, 심박수 조회 모듈, 진단내용 조회 모듈를 포함하여 구성된다. 혈당수치 조회 모듈은 데이터베이스로부터 사용자의 혈당수치를 검색하여 조회하고, 혈압수치 조회 모듈은 데이터베이스로부터 사용자의 혈압수치를 검색하여 조회한다. 또한, 체온 조회 모듈은 데이터베이스로부터 사용자의 체온수치를 검색하여 조회하고, 심박수 조회 모듈은 데이터베이스로부터 사용자의 심박수 정보를 검색하여 조회하며, 진단내용 조회 모듈는 데이터베이스로부터 사용자의 날씨 별 건강 진단정보를 검색하여 조회한다. 도 3을 참조하면, 상기 제어부는 화면 제어부와 스피커 제어부를 포함하여 구성되며, 상기 화면 제어부는 스마트 미러를 통해 제공되는 화면을 제어하고, 스피커 제어부는 스마트 미러를 통해 제공 되는 소리를 제어한다. 보다 상세하게는, 화면 제어부에서는 스마트 미러에 출력되는 건강정보 그래프의 위치와 크기를 조정하는 기능, 화면 블라인드 처리 기능, 화면 시야각 제어기능을 수행하고, 스피커 제어부는 스마트 미러의 스피 커 음량, 소리 방향 제어를 수행한다. 이때, 상기 화면 제어부는 혈당수치 출력 모듈, 혈압수치 출력 모듈, 체온 출력 모듈, 심 박수 출력 모듈, 화면 블라인드 처리 모듈, 시야각 제어 모듈, 출력 윈도우 제어 모듈, 진 단내용 출력 모듈로 구성된다. 상기 혈당 수치 출력 모듈은 혈당수치 조회 모듈이 조회한 혈당수치 데이터를 스마트 미러를 통해 그 래프로 출력하고, 혈압수치 출력 모듈은 혈압수치 조회 모듈로부터 조회한 혈압수치 데이터를 스마트 미러를 통해 그래프로 출력한다. 또한, 체온 출력 모듈은 체온 조회 모듈로부터 조회한 체온 데이터를 스마트 미러를 통해 그래프로 출력하하고, 심박수 출력 모듈는 심박수 조회 모듈로부터 조회한 심박수 데이터를 스마트 미러를 통 해 그래프로 출력한다. 화면 블라인드 처리 모듈은 스마트 미러 화면을 블라인드 처리하며, 안면 인식부에서 사용자 이외의 등록되지 않은 사용자인 외부인 안면이 탐지되고, 상기 외부인이 스마트 미러에 표시된 모든 정보를 확인할 수 있는 거리에 있을 시 화면의 모든 출력 정보를 블라인드 처리한다. 시야각 제어 모듈은 스마트 미러에 개인 건강정보 출력 시 사용자의 위치에 따라 시야각을 제어하는 모듈 로서, 안면 인식부를 통해 사용자의 위치를 파악하고, 해당 각도로만 화면을 볼 수 있도록 패널의 시야각 을 조절한다. 출력 윈도우 제어 모듈은 스마트 미러를 통해 표시되는 출력 윈도우 내부에 표시되는 혈당수치, 혈압수치, 체언, 심박수 정보를 제어하고, 스마트 미러 화면내에 출력 윈도우를 표시할 위치와 크기를 제어한다. 이때, 상 기 출력 윈도우 제어 모듈은 사용자 이외의 외부인이 탐지되며, 상기 외부인이 일정 거리 이내로 감지되면 상기 스마트 미러를 블라인드 처리하고, 상기 외부인이 스마트 미러에 표시된 정보를 정확히 볼 수 없을 정도로 거리가 먼 경우에는 출력 윈도우 크기를 작게 조정하며, 상기 출력 윈도우를 사용자의 위치로 이동시켜 외부인 이 사용자의 건강정보를 볼 수 없게 한다. 진단내용 출력 모듈은 데이터베이스로부터 사용자의 날짜 별 건강 진단정보를 검색하여 조회한다. 또한, 상기 스피커 제어부는 음량 제어모듈 및 소리 방향 제어 모듈로 구성된다. 상기 음량 제어모듈은 인식되는 사용자의 목소리의 크기와 스마트 미러와의 거리에 따라 음량 제어를 수행 하며, 안면 인식부와 음성 인식부에서 송신되는 정보에 따라 음량을 제어한다. 또한, 소리 방향 제어 모듈은 사용자의 음성 명령 시 발생하는 음성 답변을 다른 외부인이 듣지 못하도록 소리가 사용자 방향으로만 출력되도록 제어한다. 도 4에 도시된 상기 안면 인식부는 카메라를 통해 입력되는 영상 이미지 데이터를 처리하며, 사용자의 안 면 인식을 통해 신원을 확인하는 기능, 등록되지 않은 외부인 탐지 기능, 새로운 사용자 등록 시 안면 정보 수 집기능을 수행한다. 또한, 도 5에 도시된 음성 인식부는 음성 인식을 통해 화자의 인원을 확인하는 기능, 화자 명령어 처리 기 능, 새로운 사용자 등록 시 목소리 저장 기능을 수행한다. 보다 구체적으로 도 4를 참고하면, 상기 안면 인식부는 안면 인식 모듈, 외부 탐지 모듈, 안면 등록 모듈을 포함하여 구성된다. 안면 인식 모듈은 사용자의 안면을 인식하여 신분을 확인하고, 외부 탐지 모듈은 사용자 이외의 외부 인을 인식하며, 안면 등록 모듈은 새로운 사용자 등록 시 안면 정보를 저장하여 등록한다. 또한, 보다 구체적으로 도 5를 참조하면, 상기 음성 인식부는 음성 인식 모듈, 화자 인증 모듈, 음성 명령 처리 모듈, 화자 등록 모듈로 구성된다. 음성 인식 모듈은 사용자의 음성 명령어를 인식하는 모듈로서 음성 명령어를 텍스트로 변환하여(speech- to-text) 음성 명령 처리 모듈로 전달한다. 음성 명령 처리 모듈은 상기 텍스트로 변환된 음성 명령어를 수신하여 명령을 처리한다. 또한, 화자 인증 모듈는 음성 인식을 통하여 사전에 저장된 사용자의 목소리 일치 여부를 판단하며, 화자 등록 모듈은 새로운 사용자 등록 시 목소리 정보를 저장한다. 도 6은 본 발명의 일실시예에 따른 카메라 및 마이크를 이용한 스마트 미러 기반 개인 헬스케어 정보 보호 방법 을 설명하기 위한 흐름도이다. 이후부터는 도 6을 참조하여 본 발명의 일실시예에 따른 카메라 및 마이크를 이용한 스마트 미러 기반 개인 헬 스케어 정보 보호 방법을 설명하기로 한다. 도 6을 참조하면, 사용자 인식부가 먼저 사용자 안면 인식을 실행하고(S601), 사용자의 인증 및 인가 프로세스 에 해당하는지 판단한다(S602). 상기 사용자 인식부가 사용자의 인증 및 인가 프로세스에 해당한다고 판단할 경우, 상기 음성 인식 프로세스를 실행하여(S603) 제어부가 의해 스마트 미러의 화면과 스피커를 통해 상기 사용자의 건강 정보가 제공되도록 제 어하거나, 또는 외부인 탐지 프로세스를 실행할 수 있다(S604).한편, 사용자 인식부는 사용자 안면 인식이 동작 중일 때 새로운 사용자 등록을 할 수 있다. 이와 같은 사용자 등록 명령은 스마트 미러의 UI 인터페이스에 의해 실행되거나, 음성 명령을 통해서 실행될 수 있다. 도 7은 참조하여 본 발명의 일실시예에 따른 새로운 사용자의 등록 방법을 설명하기 위한 흐름도이다. 이후부터는 도 7을 참조하여 본 발명의 일실시예에 따른 새로운 사용자의 등록 방법을 설명하기로 한다. 도 7을 참조하면, 먼저 대기중에(S701), 사용자 인식부가 새로운 사용자의 등록 명령이 입력되는지 판단한다 (S702). 이때, 사용자 등록 탐지는 스마트 미러 UI 조작에 의해서 발생할 수 있고, 음성 명령을 통해서도 발생 할 수 있다. 이후에, 사용자 인식부가 새로운 사용자의 등록 명령이 입력된 것으로 판단하면, 사용자 등록 과정을 수행하여 (S703), 사용자 기본 정보인 ID, 성명, 연락처를 입력 받고, 사용자 인식부가 카메라를 통해 사용자의 안면 데 이터를 수집하여 등록하며(S704), 마이크를 통해 사용자의 목소리 데이터를 수집하여 등록한다(S705). 상기 안 면 데이터와 음성 데이터는 사용자 인증 시에 사용된다. 도 8은 본 발명의 일실시예에 따른 외부인 탐지 및 블라인드 처리를 실행하는 방법을 설명하기 위한 흐름도이다. 이후부터는 도 8을 참조하여 본 발명의 일실시예에 따른 외부인 탐지 및 블라인드 처리를 실행하는 방법을 설명 하기로 한다. 도 8을 참조하면, 사용자 인식부가 사용자의 안면을 인식하여 동작한다(S801). 사용자 인식부가 상기 사용자를 미등록 사용자인 외부인으로 판단하면(S802), 상기 미등록 사용자가 개인의 건 강 정보가 노출될 수 있는 위험 거리 이내에 있는지 판단한다(S803) 상기 사용자 인식부가 상기 미등록 사용자가 일정 거리 이내에 있는 것으로 판단하면, 상기 스마트 미러를 블라 인드 처리한다(S804). 한편, 상기 사용자 인식부가 상기 미등록 사용자가 일정 거리 이내에 있지 않은 것으로 판단하면, 상기 건강 정 보의 출력 윈도우를 작은 크기로 조절하여 상기 사용자의 위치로 이동하여 표시하도록 제어한다(S805) 이때, 만약 사용자가 스마트 미러에서 사라진다면 프로세스는 종료되고 초기상태로 돌아간다. 도 9는 본 발명의 일실시예에 따른 사용자의 건강 정보를 제공하는 방법을 설명하기 위한 흐름도이다. 이후부터는 도 9를 참조하여 본 발명의 일실시예에 따른 사용자의 건강 정보를 제공하는 방법을 설명하기로 한 다. 도 9를 참조하면, 먼저 사용자 인식부가 사용자의 안면을 인식하여 동작하고(S901), 음성명령을 내리는 사용자 (화자)의 인증 여부를 판단한다(S902). 사용자 인식부가 상기 사용자를 인증한 경우에는, 상기 사용자의 음성 명령을 입력 받아 인식하고(S903), 제어 부가 상기 음성 명령에 따라 상기 사용자의 건강 정보를 스마트 미러의 화면 상에 그래프로 출력하여 제공한다 (S904). 이와 같이, 본 발명의 실시예에 따르면 화자인식을 통해 사용자와 외부인의 음성을 구분하고, 카메라에 의한 외 부인 탐지 시 화면 블라인드 및 스마트 미러 화면 제어 기술을 이용하여 사용자 조작 없이도 프라이버시 보호가 가능하도록 하고, 안면 및 목소리 인식에 의한 사용자 인증 기능을 강화하여, 화면이 넓은 스마트 미러에 표시 된 개인정보를 외부인에게 노출되지 않도록 할 수 있다. 전술한 바와 같은 본 발명의 상세한 설명에서는 구체적인 실시예에 관해 설명하였다. 그러나 본 발명의 범주에 서 벗어나지 않는 한도 내에서는 여러 가지 변형이 가능하다. 본 발명의 기술적 사상은 본 발명의 전술한 실시 예에 국한되어 정해져서는 안 되며, 특허청구범위뿐만 아니라 이 특허청구범위와 균등한 것들에 의해 정해져야 한다.부호의 설명 100: 개인 헬스케어 정보 보호 시스템 110: 건강정보 조회부 120: 제어부 130: 사용자 인식부 131: 안면 인식부 132: 음성 인식부"}
{"patent_id": "10-2017-0143676", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시예에 따른 카메라 및 마이크를 이용한 스마트 미러 기반 개인 헬스케어 정보 보호 시스 템의 구성을 도시한 도면이다. 도 2는 본 발명의 일실시예에 따른 건강정보 조회부의 구성도이다. 도 3은 본 발명의 일실시예에 따른 제어부의 구성도이다. 도 4 및 도 5는 본 발명의 일실시예에 따른 사용자 인식부의 구성도이다. 도 6은 본 발명의 일실시예에 따른 카메라 및 마이크를 이용한 스마트 미러 기반 개인 헬스케어 정보 보호 방법 을 설명하기 위한 흐름도이다. 도 7은 참조하여 본 발명의 일실시예에 따른 새로운 사용자의 등록 방법을 설명하기 위한 흐름도이다. 도 8은 본 발명의 일실시예에 따른 외부인 탐지 및 블라인드 처리를 실행하는 방법을 설명하기 위한 흐름도이다. 도 9는 본 발명의 일실시예에 따른 사용자의 건강 정보를 제공하는 방법을 설명하기 위한 흐름도이다."}
