{"patent_id": "10-2022-0004505", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0108865", "출원번호": "10-2022-0004505", "발명의 명칭": "차량용 드론 도킹 스테이션 및 이의 제어 방법", "출원인": "현대자동차주식회사", "발명자": "황진호"}}
{"patent_id": "10-2022-0004505", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "에 있어서,이송장치에는 상하방향으로 연장된 레일, 레일에 연결되어 상하방향으로 슬라이딩되며 화물이 적재되는 적재플레이트 및 레일에 결합되어 적재플레이트는 상하방향으로 이동시키는 구동장치가 포함된 것을 특징으로 하는 차량용 드론 도킹 스테이션."}
{"patent_id": "10-2022-0004505", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,가이드패널의 하부에 마련되고, 중앙부가 관통되어 이송장치와 연결되어 화물이 통과되는 관통홀이 마련된 베이스패널; 및베이스패널의 상부에 마련되어 가이드패널과 연결되어 가이드패널을 슬라이딩시키거나 회전시키는 액추에이터;를 더 포함하는 것을 특징으로 하는 차량용 드론 도킹 스테이션."}
{"patent_id": "10-2022-0004505", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서,액추에이터에는 베이스패널의 중앙에서 외측으로 연장된 리드스크류, 리드스크류에 치합되어 리드스크류의 회전에 따라 리드스크류가 연장된 방향으로 이동되고, 상부로 가이드패널이 결합되는 스크류너트 및 리드스크류에연결되어 리드스크류를 회전시키는 제1구동모터가 포함된 것을 특징으로 하는 차량용 드론 도킹 스테이션."}
{"patent_id": "10-2022-0004505", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 3에 있어서,리드스크류 및 피니언기어는 복수의 가이드패널의 개수에 대응되도록 마련되고, 액추에이터에는 리드스크류의 단부에 마련된 제1기어 및 원형으로 형성되어 복수의 제1기어를 연결하는 제1랙기어가 포함되고,제1구동모터에는 회전축에 제2기어가 마련되고, 제2기어는 제1랙기어어와 연결되어 제1구동모터의 회전에 따라복수개의 리드스크류가 회전되는 것을 특징으로 하는 차량용 드론 도킹 스테이션."}
{"patent_id": "10-2022-0004505", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 2에 있어서,베이스패널를 루프패널에 회전 가능하게 결합시키는 회전베어링;을 더 포함하고,액추에이터에는 베이스패널 및 베이스패널의 상부에 연결된 가이드패널을 회전시키도록 루프패널 측에 결합되고베이스패널과 연결된 제2구동모터가 포함된 것을 특징으로 하는 차량용 드론 도킹 스테이션."}
{"patent_id": "10-2022-0004505", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 5에 있어서액추에이터에는 베이스패널의 외측면을 따라 원형으로 연장되며 결합된 제2랙기어가 포함되고,제2구동모터의 회전축에는 제2랙기어와 치합되는 제3기어가 마련되어 제2구동모터의 회전에 따라 제2랙기어가회전되는 것을 특징으로 하는 차량용 드론 도킹 스테이션.공개특허 10-2023-0108865-3-청구항 7"}
{"patent_id": "10-2022-0004505", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 1에 있어서,루프패널에 마련되어 가이드패널 및 이송장치를 커버링하는 썬루프글라스;를 더 포함하는 것을 특징으로 하는차량용 드론 도킹 스테이션."}
{"patent_id": "10-2022-0004505", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 1에 있어서,드론이 가이드패널에 안착시 드론의 위치를 감지하는 감지센서;을 더 포함하고,제어부는 감지센서에서 감지된 드론의 위치를 기반으로 가이드패널을 회전시키거나 슬라이딩시키는 것을 특징으로 하는 차량용 드론 도킹 스테이션."}
{"patent_id": "10-2022-0004505", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 9에 있어서,드론에는 감지센서에서 감지하는 감지 기준 포인트가 마련되고, 감지센서 감지 기준 포인트를 감지하여 드론의위치를 확인하는 것을 특징으로 하는 차량용 드론 도킹 스테이션."}
{"patent_id": "10-2022-0004505", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 10에 있어서,감지센서는 복수개가 가이드패널의 측방에 이격되어 배치되고, 드론에 마련된 감지 기준 포인트의 위치를 감지하고, 제어부는 감지센서에서 감지한 감지기준 포인트의 위치를 기반으로 가이드패널의 회전각도를 연산하여 회전시키는 것을 특징으로 하는 차량용 드론 도킹 스테이션."}
{"patent_id": "10-2022-0004505", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 1에 있어서,제어부는 드론과 무선통신으로 통신하고, 드론으로부터 도킹 신호를 수신하면, 가이드패널이 외측으로 확장되도록 제어하는 것을 특징으로 하는 차량용 드론 도킹 스테이션."}
{"patent_id": "10-2022-0004505", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 12에 있어서,제어부는 드론이 가이드패널에 착륙한 것이 감지센서에서 감지된 경우 확장된 가이드패널을 축소시키고, 이송장치에 위치한 화물의 위치에 드론이 대응되도록 가이드패널을 회전시키는 것을 특징으로 하는 차량용 드론 도킹스테이션."}
{"patent_id": "10-2022-0004505", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 1의 차량용 드론 도킹 스테이션의 제어 방법으로서,드론이 차량용 드론 도킹 스테이션에 도킹하는 도킹 신호를 수신하는 단계;복수개의 가이드패널을 외측으로 확장시키는 단계;드론이 가이드패널에 도킹시 이송장치에 위치한 화물과 드론의 위치가 대응되도록 복수개의 가이드패널을 내측공개특허 10-2023-0108865-4-으로 슬라이딩시키며 회전시키는 단계; 및화물과 드론의 위치가 대응시 이송장치를 작동시키는 단계;를 포함하는 차량용 드론 도킹 스테이션의 제어방법."}
{"patent_id": "10-2022-0004505", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "청구항 13에 있어서,도킹하는 드론의 위치를 감지하는 단계;를 더 포함하고,제어하는 단계는 감지하는 단계에서 감지한 드론의 위치를 기반으로 가이드패널을 슬라이딩 또는 회전시키는 것을 특징으로 하는 차량용 드론 도킹 스테이션의 제어 방법."}
{"patent_id": "10-2022-0004505", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "청구항 13에 있어서,도킹 신호를 수신하는 단계 이후 가이드패널 및 이송장치를 커버링하는 썬루프글라스를 개방하는 단계;를 더 포함하는 것을 특징으로 하는 차량용 드론 도킹 스테이션의 제어 방법."}
{"patent_id": "10-2022-0004505", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명에 따르면, 드론에 적재되거나 또는 드론이 이송한 화물을 상하방향으로 이동시키는 이송장치; 차량의 루 프에 마련되고 이송장치의 상단부에 연결되어 상부에 드론이 안착되며, 이송장치를 감싸는 패널로 형성되고 외측 으로 슬라이딩 또는 중앙부를 기준으로 회전이 가능하도록 마련된 가이드패널; 및 드론이 가이드패널에 안착시 이송장치에 위치된 화물에 드론이 대응되도록 가이드패널을 회전시키거나 슬라이딩시키는 제어부;를 포함하는 차 량용 드론 도킹 스테이션이 소개된다."}
{"patent_id": "10-2022-0004505", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 차량용 드론 도킹 스테이션 및 이의 제어 방법에 관한 것으로, 구체적으로 차량에 적재된 화물을 드 론으로 배송하기 위해 차량에 마련된 드론 도킹스테이션에 관한 기술이다."}
{"patent_id": "10-2022-0004505", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "드론은 기존 비행장치에 비해 무인화 및 자동조종, 정지비행이 용이한 장점으로 다양한 분야에 활용되고 있다. 군사 및 측량, 촬영, 방재, 보안 분야에서 공공 목적 달성을 위해 확대되고 있으며, 산업 분야에서는 아마존 (DHL, 대한통운 등) 회사를 중심으로 운송 및 배달 업무 등에 활용될 예정이다. 상기 업무에 활용하기 위하여 드론의 비행 안전성 확보 기술, 목표 지점까지 자동 비행 기술, 자동 이·착륙 기술, 물품 자동 승·하차 기술, 안정적 비행시간 확대 기술이 필요하다. 최근 드론 비행 제어에 인공지능(AI) 기술도 도입되어, 주변의 장애물 을 자동 인식하고, 장애물과 충돌을 자동 회피하는 자율비행 단계에 접근하고 있다. 이러한 드론을 이용하여 차량으로 이송된 화물을 고객에게 배송하기 위해 차량의 루프부에 드론이 도킹되고, 차 량의 화물을 루프 측으로 이송하여 드론에 적재시키거나 또는 드론으로부터 배송된 화물을 루프 측에서 차량으 로 이송하는 기술이 요구되어져 왔다."}
{"patent_id": "10-2022-0004505", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "상기의 배경기술로서 설명된 사항들은 본 발명의 배경에 대한 이해 증진을 위한 것일 뿐, 이 기술분야에서 통상 의 지식을 가진 자에게 이미 알려진 종래기술에 해당함을 인정하는 것으로 받아들여져서는 안 될 것이다. 선행기술문헌 특허문헌 (특허문헌 0001) KR 10-2020-0013352 A"}
{"patent_id": "10-2022-0004505", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 이러한 문제점을 해결하기 위하여 제안된 것으로, 화물 차량에 드론이 루프 측 도킹되어 차량의 화물 을 드론에 적재시키기 위해 차량에 마련되어 화물을 루픅측으로 이송하고 드론이 루프 측에 도킹될 수 있는 차 량용 드론 도킹 스테이션을 제공하는 것에 그 목적이 있다."}
{"patent_id": "10-2022-0004505", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 따른 차량용 드론 도킹 스테이션은 드론에 적재되거나 또는 드론이 이송한 화물을 상하방향으로 이동 시키는 이송장치; 차량의 루프에 마련되고 이송장치의 상단부에 연결되어 상부에 드론이 안착되며, 이송장치를 감싸는 패널로 형성되고 외측으로 슬라이딩 또는 중앙부를 기준으로 회전이 가능하도록 마련된 가이드패널; 및 드론이 가이드패널에 안착시 이송장치에 위치된 화물에 드론이 대응되도록 가이드패널을 회전시키거나 슬라이딩 시키는 제어부;를 포함한다. 가이드패널의 하부에 마련되고, 중앙부가 관통되어 이송장치와 연결되어 화물이 통과되는 관통홀이 마련된 베이 스패널; 및 베이스패널의 상부에 마련되어 가이드패널과 연결되어 가이드패널을 슬라이딩시키거나 회전시키는 액추에이터;를 더 포함할 수 있다. 액추에이터에는 베이스패널의 중앙에서 외측으로 연장된 리드스크류, 리드스크류에 치합되어 리드스크류의 회전 에 따라 리드스크류가 연장된 방향으로 이동되고, 상부로 가이드패널이 결합되는 스크류너트 및 리드스크류에 연결되어 리드스크류를 회전시키는 제1구동모터가 포함될 수 있다. 리드스크류 및 피니언기어는 복수의 가이드패널의 개수에 대응되도록 마련되고, 액추에이터에는 리드스크류의 단부에 마련된 제1기어 및 원형으로 형성되어 복수의 제1기어를 연결하는 제1랙기어가 포함되고, 제1구동모터에 는 회전축에 제2기어가 마련되고, 제2기어는 제1랙기어어와 연결되어 제1구동모터의 회전에 따라 복수개의 리드 스크류가 회전될 수 있다. 베이스패널를 루프패널에 회전 가능하게 결합시키는 회전베어링;을 더 포함하고, 액추에이터에는 베이스패널 및 베이스패널의 상부에 연결된 가이드패널을 회전시키도록 루프패널 측에 결합되고 베이스패널과 연결된 제2구동 모터가 포함될 수 있다. 액추에이터에는 베이스패널의 외측면을 따라 원형으로 연장되며 결합된 제2랙기어가 포함되고, 제2구동모터의 회전축에는 제2랙기어와 치합되는 제3기어가 마련되어 제2구동모터의 회전에 따라 제2랙기어가 회전될 수 있다. 이송장치에는 상하방향으로 연장된 레일, 레일에 연결되어 상하방향으로 슬라이딩되며 화물이 적재되는 적재플 레이트 및 레일에 결합되어 적재플레이트는 상하방향으로 이동시키는 구동장치가 포함될 수 있다. 루프패널에 마련되어 가이드패널 및 이송장치를 커버링하는 썬루프글라스;를 더 포함할 수 있다. 드론이 가이드패널에 안착시 드론의 위치를 감지하는 감지센서;을 더 포함하고, 제어부는 감지센서에서 감지된 드론의 위치를 기반으로 가이드패널을 회전시키거나 슬라이딩시킬 수 있다. 드론에는 감지센서에서 감지하는 감지 기준 포인트가 마련되고, 감지센서 감지 기준 포인트를 감지하여 드론의 위치를 확인할 수 있다. 감지센서는 복수개가 가이드패널의 측방에 이격되어 배치되고, 드론에 마련된 감지 기준 포인트의 위치를 감지 하고, 제어부는 감지센서에서 감지한 감지기준 포인트의 위치를 기반으로 가이드패널의 회전각도를 연산하여 회 전시킬 수 있다. 제어부는 드론과 무선통신으로 통신하고, 드론으로부터 도킹 신호를 수신하면, 가이드패널이 외측으로 확장되도 록 제어할 수 있다. 제어부는 드론이 가이드패널에 착륙한 것이 감지센서에서 감지된 경우 확장된 가이드패널을 축소시키고, 이송장 치에 위치한 화물의 위치에 드론이 대응되도록 가이드패널을 회전시킬 수 있다. 본 발명에 따른 차량용 드론 도킹 스테이션의 제어 방법은 드론이 드론 도킹 스테이션에 도킹하는 도킹 신호를 수신하는 단계; 복수개의 가이드패널을 외측으로 확장시키는 단계; 드론이 가이드패널에 도킹시 이송장치에 위 치한 화물과 드론의 위치가 대응되도록 복수개의 가이드패널을 내측으로 슬라이딩시키며 회전시키는 단계; 및 화물과 드론의 위치가 대응시 이송장치를 작동시키는 단계;를 포함한다. 도킹하는 드론의 위치를 감지하는 단계;를 더 포함하고, 제어하는 단계는 감지하는 단계에서 감지한 드론의 위 치를 기반으로 가이드패널을 슬라이딩 또는 회전시킬 수 있다. 도킹 신호를 수신하는 단계 이후 가이드패널 및 이송장치를 커버링하는 썬루프글라스를 개방하는 단계;를 더 포 함할 수 있다."}
{"patent_id": "10-2022-0004505", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 차량용 드론 도킹 스테이션은 차량의 루프에 드론이 도킹되는 가이드패널이 마련되고, 가이드패 널의 중앙부에 차량의 상하방향으로 화물을 이송하는 이송장치가 마련되어 가이드패널에 드론이 도킹시 이송장 치를 통해 차량의 하부에서 루프 측으로 화물을 이송시켜 드론에 화물을 적재시키거나 드론으로부터 이송된 화 물을 루프 측에서 차량의 하부로 이송시킴에 따라 차량의 화물을 드론을 통해 고객에게 배송하는 것을 편리하게 할 수 있는 효과가 있다. 또한, 가이드패널이 복수개로 형성되어 드론이 도킹시 외측으로 슬라이딩되고, 드론이 도킹이 완료시 가이드패 널이 중심측으로 슬라이딩되고, 중앙부의 화물에 정렬되도록 회전됨으로써 드론에 화물을 정확하게 적재할 수 있는 효과가 있다."}
{"patent_id": "10-2022-0004505", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서 또는 출원에 개시되어 있는 본 발명의 실시예들에 대해서 특정한 구조적 내지 기능적 설명들은 단지 본 발명에 따른 실시예를 설명하기 위한 목적으로 예시된 것으로, 본 발명에 따른 실시예들은 다양한 형태로 실 시될 수 있으며 본 명세서 또는 출원에 설명된 실시 예들에 한정되는 것으로 해석되어서는 아니 된다. 본 발명에 따른 실시 예는 다양한 변경을 가할 수 있고 여러 가지 형태를 가질 수 있으므로 특정실시 예들을 도 면에 예시하고 본 명세서 또는 출원에 상세하게 설명하고자 한다. 그러나 이는 본 발명의 개념에 따른 실시 예 를 특정한 개시 형태에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균 등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 제1 및/또는 제2 등의 용어는 다양한 구성 요소들을 설명하는데 사용될 수 있지만, 상기 구성 요소들은 상기 용 어들에 의해 한정되어서는 안 된다. 상기 용어들은 하나의 구성 요소를 다른 구성 요소로부터 구별하는 목적으 로만, 예컨대 본 발명의 개념에 따른 권리 범위로부터 이탈되지 않은 채, 제1 구성요소는 제2 구성요소로 명명 될 수 있고, 유사하게 제2 구성요소는 제1 구성요소로도 명명될 수 있다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있 다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 구성요소들 간의 관 계를 설명하는 다른 표현들, 즉 \"~사이에\"와 \"바로 ~사이에\" 또는 \"~에 이웃하는\"과 \"~에 직접 이웃하는\" 등도 마찬가지로 해석되어야 한다. 본 명세서에서 사용한 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도 가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 명세서에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 실시된 특징, 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것들의 존재 또는 부가가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미이다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의미인 것으로 해석되어야 하며, 본 명세서에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 이하, 첨부한 도면을 참조하여 본 발명의 바람직한 실시 예를 설명함으로써, 본 발명을 상세히 설명한다. 각 도 면에 제시된 동일한 참조부호는 동일한 부재를 나타낸다. 본 발명의 예시적인 실시예에 따른 제어부는 차량의 다양한 구성 요소의 동작을 제어하도록 구성된 알고리 즘 또는 상기 알고리즘을 재생하는 소프트웨어 명령어에 관한 데이터를 저장하도록 구성된 비휘발성 메모리(도 시되지 않음) 및 해당 메모리에 저장된 데이터를 사용하여 이하에 설명되는 동작을 수행하도록 구성된 프로세서 (도시되지 않음)를 통해 구현될 수 있다. 여기서, 메모리 및 프로세서는 개별 칩으로 구현될 수 있다. 대안적으 로는, 메모리 및 프로세서는 서로 통합된 단일 칩으로 구현될 수 있다. 프로세서는 하나 이상의 프로세서의 형 태를 취할 수 있다. 도 1은 본 발명의 일 실시예에 따른 차량용 드론 도킹 스테이션이 화물 차량에 결합된 사시도, 도 2 는 본 발명의 일 실시예에 따른 차량용 드론 도킹 스테이션의 사시도, 도 3은 본 발명의 일 실시예에 따른 차량용 드론 도킹 스테이션의 가이드패널의 작동을 도시한 도면, 도 4는 본 발명의 일 실시예에 따른 차량용 드론 도킹 스테이션의 베이스패널의 사시도이다. 도 1 내지 도 4를 참조하여 본 발명에 따른 차량용 드론 도킹 스테이션의 바람직한 실시예에 대해 알아보 도록 한다. 최근 차량의 목적에 따라 제조되는 PBV(Purpose Built Vehicle 목적 기반 차량)이 제조되고 있다. 이에 따라 차량의 목적 중 화물을 운송하는 화물 차량이 제조될 수 있으며, 화물 차량에 적재된 화 물을 드론을 통해 고객에게 배송하기 위해 차량에 드론이 도킹되기 위한 장치를 위해 본 발명이 고안 되었다. 도 1에 도시된 바와 같이 화물 차량의 일측에는 화물을 적재하는 적재공간과 분리된 공간에 차량용 드론 도킹 스테이션이 마련될 수 있으며, 이를 통해 드론에 화물을 적재하거나 또는 드론에서 적재 된 화물이 화물 차량으로 운송될 수 있다. 본 발명에 따른 차량용 드론 도킹 스테이션은 구체적으로 드론에 적재되거나 또는 드론이 이송 한 화물을 상하방향으로 이동시키는 이송장치; 차량의 루프에 마련되고 이송장치의 상단부에 연결되 어 상부에 드론이 안착되며, 이송장치를 감싸는 패널로 형성되고 외측으로 슬라이딩 또는 중앙부를 기준으로 회전이 가능하도록 마련된 가이드패널; 및 드론이 가이드패널에 안착시 이송장치(20 0)에 위치된 화물에 드론이 대응되도록 가이드패널을 회전시키거나 슬라이딩시키는 제어부;를 포 함한다. 도 2에 도시된 바와 같이 이송장치는 상하방향으로 연장되어 화물을 하방에서 상방으로 이동시키거나 또는 상방의 화물을 하방으로 이동시킬 수 있다. 드론은 프로펠러를 통해 수직상승 및 수직 착지가 가능하며, 이를 통해 차량의 루프 측에서 도킹이 가능하 게 된다. 이때 차량의 루프 측에 착륙한 드론을 도킹하기 위해 차량의 루프에는 가이드패널이 마련되 어 가이드패널에 드론이 도킹될 수 있으며, 가이드패널은 이송장치에 연결되어 이송장치 에 의해 차량의 하부에서 상부로 화물을 이동시켜 가이드패널에 안착된 드론에 화물을 적재하거 나 또는 드론으로부터 이송된 화물을 차량의 루프 측에서 하부로 이송할 수 있다. 도 3에 도시된 바와 같이 드론이 가이드패널에 안착시 가이드패널은 복수개의 패널로 마련되고 중앙부가 이송장치와 연결되고, 복수의 패널은 외측으로 확장되도록 슬라이딩되어 드론이 안정적으로 가이드패널에 착륙할 수 있는 효과가 있다. 또한, 드론이 가이드패널에 안착된 이후 외측으로 슬라이딩된 가이드패널은 다시 중앙부 측으로 슬라이딩되며, 이후 가이드패널의 중앙부에서 이송장치를 통해 이송된 화물이 드론에 적재되기 위해 드론을 화물 위치에 정렬하기 위해 가이드패널이 중앙부를 중심으로 회전됨으로써 화물과 드론 이 정렬되고, 화물이 드론에 적재되거나 드론에 적재된 화물이 이송장치로 전달될 수있다. 가이드패널의 하부에 마련되고, 중앙부가 관통되어 이송장치와 연결되어 화물이 통과되는 관통홀이 마련된 베이스패널; 및 베이스패널의 상부에 마련되어 가이드패널과 연결되어 가이드패널 을 슬라이딩시키거나 회전시키는 액추에이터;를 더 포함할 수 있다. 도 4에 도시된 바와 같이 가이드패널의 하부에 배치되고, 루프패널과 회전 가능하게 연결된 베이스패널 이 마련되고, 베이스패널과 가이드패널은 서로 연결될 수 있으며, 가이드패널은 베이스패 널의 중앙부로부터 외측으로 슬라이딩 가능하게 연결될 수 있다. 또한, 베이스패널에 결합되어 베이스패널의 중앙부를 중심을 기준으로 베이스패널을 회전시키거 나 가이드패널을 중앙부를 기준으로 외측으로 슬라이딩시키는 액추에이터가 마련됨으로써 드론 을 중앙부에 위치한 화물에 정렬시킬 수 있다. 액추에이터의 구체적 실시예는 아래에서 후술한다. 도 5는 본 발명의 일 실시예에 따른 차량용 드론 도킹 스테이션의 리드스크류 및 스크류너트를 도시한 도면, 도 6은 도 5의 A-A 단면도, 도 7은 도 5의 B-B 단면도이다. 액추에이터에는 베이스패널의 중앙에서 외측으로 연장된 리드스크류, 리드스크류에 치합되 어 리드스크류의 회전에 따라 리드스크류가 연장된 방향으로 이동되고, 상부로 가이드패널이 결 합되는 스크류너트 및 리드스크류에 연결되어 리드스크류를 회전시키는 제1구동모터가 포 함될 수 있다. 도 5에 도시된 바와 같이 리드스크류는 베이스패널의 중앙부에서 외측으로 연장되도록 마련되며, 복 수개가 베이스패널의 중앙부를 기준으로 원주방향으로 이격되어 배치될 수 있으며, 스크류너트는 리 드스크류에 치합되어 리드스크류의 회전에 따라 리드스크류의 길이방향으로 이동될 수 있으며, 리드스크류의 회전방향에 따라 이동방향이 변경될 수 있다. 또한, 리드스크류는 제1구동모터와 연결되어 회전될 수 있으며, 제어부는 제1구동모터의 회 전을 제어할 수 있다. 제1구동모터는 복수개로 마련되어 리드스크류에 각각 연결되거나 하나의 제1구동모터와 복수개 의 리드스크류를 연결시키는 연결부재가 마련될 수 있다. 스크류너트는 상부에 가이드패널이 결합되어 리드스크류가 회전시 리드스크류의 길이방향 으로 이동됨에 따라 가이드패널을 리드스크류의 길이방향으로 슬라이딩시킬 수 있다. 리드스크류 및 피니언기어는 복수의 가이드패널의 개수에 대응되도록 마련되고, 액추에이터에는 리드스크류의 단부에 마련된 제1기어 및 원형으로 형성되어 복수의 제1기어를 연결하는 제1랙기 어가 포함되고, 제1구동모터에는 회전축에 제2기어가 마련되고, 제2기어는 제1랙기어(54 0)어와 연결되어 제1구동모터의 회전에 따라 복수개의 리드스크류가 회전될 수 있다. 도 4 내지 5에 도시된 바와 같이 1개의 제1구동모터를 사용하여 복수 개의 리드스크류를 회전시키기 위해 리드스크류의 단부에는 제1기어가 결합되어 리드스크류와 함께 회전될 수 있으며, 또한 복 수개의 제1기어를 서로 연결하기 위해 베이스패널의 중심을 기준으로 링 형상으로 형성된 제1랙기어 가 제1기어와 서로 치합되어 복수개의 리드스크류를 연결할 수 있다. 또한, 제1구동모터의 회전축에 결합되어 회전되는 제2기어가 마련되고, 제2기어는 제1랙기어와 치합되어 제1구동모터 의 회전시 제1렉기어는 회전될 수 있다. 이때 제1랙기어는 베이스패널과 상대 회전이 가능하며, 이에 따라 회전되어 리드스크류를 회전시킬 수 있다. 이를 통해 1개의 제1구동모터를 통해 복수개의 리드스크류를 회전시킴에 따라 원가를 절감할 수 있는 효과가 있다. 베이스패널를 루프패널에 회전 가능하게 결합시키는 회전베어링;을 더 포함하고, 액추에이터에 는 베이스패널 및 베이스패널의 상부에 연결된 가이드패널을 회전시키도록 루프패널 측에 결합 되고 베이스패널와 연결된 제2구동모터가 포함될 수 있다. 도 7에 도시된 바와 같이 베이스패널은 회전베어링을 통해 루프패널에 회전 가능하게 결합될 수 있다. 이에 따라 베이스패널이 회전시 상부로 연결된 가이드패널은 동시에 회전될 수 있다. 액추에이터에는 베이스패널의 외측면을 따라 원형으로 연장되며 결합된 제2랙기어가 포함되고, 제2구동모터의 회전축에는 제2랙기어와 치합되는 제3기어가 마련되어 제2구동모터의 회전 에 따라 제2랙기어가 회전될 수 있다. 이러한 베이스패널을 회전시키기 위해 루프패널에 제2구동모터가 결합되며, 제2구동모터의 회전 축에는 제3기어가 결합될 수 있으며, 베이스패널의 외측을 따라 링 형상으로 형성되어 베이스패널 과 결합된 제2랙기어가 마련되고 제3기어어와 제2랙기어가 서로 치합되어 제2구동모터 의 작동에 따라 제3기어 및 제2랙기어가 회전됨에 딸 베이스패널 및 가이드패널이 중 앙부를 중심으로 회전될 수 있다. 제1기어, 제2기어 및 제3기어와 제1랙기어 및 제2랙기어는 원형 회전이 좀 더 부드럽 게 되도록 헬리컬기어로 형성될 수 있다. 도 8은 본 발명의 일 실시예에 따른 차량용 드론 도킹 스테이션의 이송장비의 분해 사시도이다. 이송장치에는 상하방향으로 연장된 레일, 레일에 연결되어 상하방향으로 슬라이딩되며 화물이 적재되는 적 재플레이트 및 레일에 결합되어 적재플레이트는 상하방향으로 이동시키는 구동장치가 포함될 수 있다. 도 1 및 도 8을 더 참조하면, 이송장치의 상단부는 베이스패널과 가이드패널에 연결될 수 있으 며, 하부에서 상부로 화물을 이송하여 화물을 드론에 적재시키거나 또는 드론을 통해 이송된 화물을 하방으로 이송할 수 있다. 이송장치에는 화물을 지지하는 적재플레이트가 마련되고 상하방향으로 연장되어 적재플레이트가 슬라이딩되는 레일이 적재플레이트의 측방으로 배치되며, 적재플레이트 및 레일에 연결되어 적재플레 이트가 레일을 따라 상하방향으로 이동시키는 구동장치가 마련될 수 있다. 구동장치는 밸트, 풀리 및 모터 구동방식의 구조로 형성되어 적재플레이트가 밸트에 연결되고 모터가 풀리를 회전시킴에 따라 밸트가 이동되어 적재플레이트가 상하방향으로 이동될 수 있다. 상기는 구동장치의 일 실시예로서 적재플레이트를 상하방향으로 이동시키는 다양한 종류의 구동장치 가 마련될 수 있다. 루프패널에 마련되어 가이드패널 및 이송장치를 커버링하는 썬루프글라스;를 더 포함할 수 있다. 도 6 내지 7에 도시된 바와 같이 썬루프글라스는 루프패널에 슬라이딩되도록 결합되고, 가이드패널의 상부에서 슬라이딩되도록 마련되어 드론이 도킹되지 않는 경우 비 또는 외부 이물질이 차량 내부로 투입되 는 것을 방지하기 위해 슬라이딩되어 가이드패널 및 이송장치의 상부를 커버링하고, 드론이 도 킹되는 경우 가이드패널 및 이송장치가 개방되도록 슬라이딩 될 수 있다. 이를 통해 외부의 이물질로부터 차량용 드론 도킹 스테이션을 보호할 수 있으며, 고장을 방지할 수 있는 효과가 있다. 드론이 가이드패널에 안착시 드론의 위치를 감지하는 감지센서;을 더 포함하고, 제어부 는 감지센서에서 감지된 드론의 위치를 기반으로 가이드패널을 회전시키거나 슬라이딩시킬 수 있다. 도 5에 도시된 바와 같이 가이드패널의 측면에는 감지센서가 마련될 수 있으며, 감지센서는 드 론이 가이드패널에 안착된 것을 확인할 수 있으며, 가이드패널에 드론이 안착된 것을 감지 시 감지센서는 제어부로 감지신호를 송신하며, 제어부는 이때 제1구동모터 또는 제2구동모터 를 제어하여 확대되었던 가이드패널을 축소하고, 드론과 화물을 정렬하도록 가이드패널을 회전시킬 수 있다. 드론에는 감지센서에서 감지하는 감지 기준 포인트가 마련되고, 감지센서 감지 기준 포인 트를 감지하여 드론의 위치를 확인할 수 있다. 감지센서는 복수개가 가이드패널의 측방에 이격되어 배치되고, 드론에 마련된 감지 기준 포인트 의 위치를 감지하고, 제어부는 감지센서에서 감지한 감지기준 포인트의 위치를 기반으로 가이드 패널의 회전각도를 연산하여 회전시킬 수 있다. 제어부는 드론과 무선통신으로 통신하고, 드론으로부터 도킹 신호를 수신하면, 가이드패널 이 외측으로 확장되도록 제어할 수 있다. 제어부는 드론으로부터 도킹신호를 수신하게 되면, 가이드패널을 외측으로 확장하도록 제1구동모 터를 제어할 수 있으며, 이를 통해 드론이 안착되는 면적을 크게하여 드론이 안정적으로 가이드 패널에 안착될 수 있다. 제어부는 드론이 가이드패널에 착륙한 것이 감지센서에서 감지된 경우 확장된 가이드패널 을 축소시키고, 이송장치에 위치한 화물의 위치에 드론이 대응되도록 가이드패널을 회전시 킬 수 있다. 드론이 가이드패널에 안착되면, 제어부는 제1구동모터를 제어하여 가이드패널을 중심 측으로 다시 슬라이딩시켜 드론이 가이드패널의 중앙부에 위치한 화물에 대응되도록 위치시킬 수 있 다. 또한, 감지센서는 드론의 위치를 감지하며, 제어부는 감지센서에서 감지된 드론의 위 치를 기반으로 드론과 화물이 대응되는 회전각도를 연산하고, 연산된 회전각도만큼 베이스패널를 회 전시켜 드론과 화물을 정확하게 대응시켜 드론에 화물을 정확하게 적재시킬 수 있는 효과가 있다. 도 9는 본 발명의 일 실시예에 따른 차량용 드론 도킹 스테이션의 제어방법의 순서도이다. 도 9를 참조하여 본 발명에 따른 차량용 드론 도킹 스테이션의 바람직한 실시예에 대해 알아보도록 한다. 본 발명에 따른 차량용 드론 도킹 스테이션의 제어 방법은 드론이 드론 도킹 스테이션에 도킹하 는 도킹 신호를 수신하는 단계(S10); 복수개의 가이드패널을 외측으로 확장시키는 단계(S12); 및 드론 이 가이드패널에 도킹시 이송장치에 위치한 화물과 드론의 위치가 대응되도록 복수개의 가 이드패널을 내측으로 슬라이딩시키며 회전시키는 단계(S20); 및 화물과 드론의 위치가 대응시 이송장 치를 작동시키는 단계(S30);를 포함한다. 도킹하는 드론의 위치를 감지하는 단계(S13);를 더 포함하고, 슬라이딩시키며 회전시키는 단계(S20)는 감 지하는 단계에서 감지한 드론의 위치를 기반으로 가이드패널을 슬라이딩 또는 회전시킬 수 있다. 드론이 가이드패널에 안착되는 것이 감지시 가이드패널을 내측으로 슬라이딩시키는 단계(S21)가 진행되고, 드론의 위치를 감지시 가이드패널을 회전시키는 단계(S22)가 진행될 수 있다. 도킹 신호를 수신하는 단계(S10) 이후 가이드패널 및 이송장치를 커버링하는 썬루프글라스를 개 방하는 단계(S11);를 더 포함할 수 있다. 발명의 특정한 실시예에 관련하여 도시하고 설명하였으나, 이하의 특허청구범위에 의해 제공되는 본 발명의 기 술적 사상을 벗어나지 않는 한도 내에서, 본 발명이 다양하게 개량 및 변화될 수 있다는 것은 당 업계에서 통상 의 지식을 가진 자에게 있어서 자명할 것이다."}
{"patent_id": "10-2022-0004505", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 차량용 드론 도킹 스테이션이 화물 차량에 결합된 사시도, 도 2는 본 발명의 일 실시예에 따른 차량용 드론 도킹 스테이션의 사시도, 도 3은 본 발명의 일 실시예에 따른 차량용 드론 도킹 스테이션의 가이드패널의 작동을 도시한 도면, 도 4는 본 발명의 일 실시예에 따른 차량용 드론 도킹 스테이션의 베이스패널의 사시도, 도 5는 본 발명의 일 실시예에 따른 차량용 드론 도킹 스테이션의 리드스크류 및 스크류너트를 도시한 도면, 도 6은 도 5의 A-A 단면도, 도 7은 도 5의 B-B 단면도, 도 8은 본 발명의 일 실시예에 따른 차량용 드론 도킹 스테이션의 이송장비의 분해 사시도, 도 9는 본 발명의 일 실시예에 따른 차량용 드론 도킹 스테이션의 제어방법의 순서도이다."}
