{"patent_id": "10-2024-0124524", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0042663", "출원번호": "10-2024-0124524", "발명의 명칭": "대상체의 CT 치과용 X선 이미징을 위한 솔루션", "출원인": "팔로덱스 그룹 오이", "발명자": "폴라리, 미카"}}
{"patent_id": "10-2024-0124524", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "대상체(300)의 컴퓨터 단층촬영(CT) 치과용 X선 이미징을 위한 치과용 X선 이미징 시스템(100)으로서,치과용 X선 이미징 유닛(102)으로서,X선을 방출하기 위한 X선 소스 부분(114),상기 소스 부분(114)으로부터 상기 X선을 수신하기 위한 X선 이미징 검출기 부분(116), 및상기 X선 소스 부분(114) 및 상기 X선 이미징 검출기 부분(116)을 포함하는 갠트리 부분(gantry part)(112)을 포함하는, 상기 치과용 X선 이미징 유닛(102); 및제어 시스템(106)으로서,적어도 하나의 관심 있는 영역(ROI)의 표시를 포함하는 스캔 요청을 수신하도록;상기 대상체(300)의 2개의 X선 스카우트 이미지(302, 304)를 획득하기 위해 상기 치과용 X선 이미징 유닛(102)의 부분을 제어하도록;상기 X선 스카우트 이미지(302, 304)에 대해 적어도 하나의 트레이닝된 검출 모델(616)을 적용함으로써 상기 적어도 하나의 ROI와 연관된 상기 2개의 X선 스카우트 이미지(302, 304)로부터 상기 대상체(300)의 적어도 하나의타깃 구조를 검출하도록;상기 검출된 적어도 하나의 타깃 구조에 적어도 부분적으로 기초하여 상기 치과용 X선 이미징 유닛(102)의 시야(FOV) 데이터를 정의하도록; 그리고상기 대상체(300)의 치과용 CT X선 이미징 데이터를 획득하기 위해 CT 스캔 상기 대상체(300)에 대해 정의된 상기 FOV 데이터를 구현하도록 상기 치과용 X선 이미징 유닛(102)의 부분을 제어하도록구성되는, 상기 제어 시스템(106)을 포함하는, 치과용 X선 이미징 시스템(100)."}
{"patent_id": "10-2024-0124524", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 FOV 데이터는 FOV 위치 및 FOV 크기를 포함하는, 치과용 X선 이미징 시스템(100)."}
{"patent_id": "10-2024-0124524", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항 또는 제2항에 있어서, 상기 대상체의 2개의 X선 스카우트 이미지(302, 304)는 측면(LAT) 뷰 각도 X선 스카우트 이미지(302) 및 후방-전방(PA) 뷰 각도 X선 스카우트 이미지(304)를 포함하는, 치과용 X선 이미징 시스템(100)."}
{"patent_id": "10-2024-0124524", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항 내지 제3항 중 어느 한 항에 있어서, 상기 제어 시스템(106)은 또한상기 2개의 X선 스카우트 이미지(302, 304)에 대한 상기 치과용 X선 이미징 유닛(102)의 이미징 기하학적 구조를 표현하는 이미징 기하학적 구조 데이터를 얻도록; 그리고상기 얻어진 이미징 기하학적 구조 데이터를 사용함으로써 상기 검출된 적어도 하나의 타깃 구조를 3D 디바이스공개특허 10-2025-0042663-3-좌표로 변환하도록 구성되는, 치과용 X선 이미징 시스템(100)."}
{"patent_id": "10-2024-0124524", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항 내지 제4항 중 어느 한 항에 있어서, 상기 스캔 요청은 적어도 하나의 대상체 관련된 파라미터를 표현하는 대상체 데이터 및/또는 요구된 이미징 프로그램을 표현하는 이미징 프로그램 데이터를 더 포함하는, 치과용X선 이미징 시스템(100)."}
{"patent_id": "10-2024-0124524", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 대상체 데이터 및/또는 상기 이미징 프로그램 데이터는 상기 FOV 데이터의 정의에서 사용되는, 치과용 X선 이미징 시스템(100)."}
{"patent_id": "10-2024-0124524", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항 내지 제6항 중 어느 한 항에 있어서, 상기 적어도 하나의 트레이닝된 검출 모델(616)은 기계 학습(ML) 모델 또는 인공 지능(AI) 모델인, 치과용 X선 이미징 시스템(100)."}
{"patent_id": "10-2024-0124524", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항 내지 제7항 중 어느 한 항에 있어서, 상기 적어도 하나의 트레이닝된 검출 모델(616)은 X선 스카우트 이미지(302, 304) 둘 다에 대해 트레이닝된 적어도 하나의 공통 트레이닝된 검출 모델을 포함하는, 치과용 X선 이미징 시스템(100)."}
{"patent_id": "10-2024-0124524", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항 내지 제7항 중 어느 한 항에 있어서, 상기 적어도 하나의 트레이닝된 검출 모델(616)은 각각의 X선 스카우트 이미지(302, 304)에 대해 트레이닝된 상이한 적어도 하나의 트레이닝된 검출 모델을 포함하는, 치과용 X선이미징 시스템(100)."}
{"patent_id": "10-2024-0124524", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항 내지 제9항 중 어느 한 항에 있어서, 상기 적어도 하나의 트레이닝된 검출 모델(616)은 상기 X선 스카우트 이미지(302, 304)에 이미징된 상기 대상체(300)의 영역에 의존하는, 치과용 X선 이미징 시스템(100)."}
{"patent_id": "10-2024-0124524", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항 내지 제10항 중 어느 한 항에 있어서, 상기 2개의 X선 스카우트 이미지(302, 304)로부터 상기 대상체(300)의 적어도 하나의 타깃 구조를 검출하는 것은 랜드마크 기반 검출, 바운딩 박스 기반 검출 및/또는 대상체분할 기반 검출에 기초하는, 치과용 X선 이미징 시스템(100)."}
{"patent_id": "10-2024-0124524", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 상기 랜드마크 기반 검출에서, 상기 적어도 하나의 ROI와 연관된 적어도 하나의 랜드마크(402)는 상기 X선 스카우트 이미지(302, 304)에 대해 상기 적어도 하나의 트레이닝된 검출 모델(616)을 적용함으로써 상기 2개의 X선 스카우트 이미지(302, 304)로부터 검출되는, 치과용 X선 이미징 시스템(100).공개특허 10-2025-0042663-4-청구항 13 컴퓨터 단층촬영(CT) 치과용 X선 이미징을 위한 방법으로서, 상기 방법은 제1항 내지 제12항 중 어느 한 항에따른 X선 치과용 이미징 시스템(100)에 의해 수행되고, 상기 방법은,적어도 하나의 관심 있는 영역(ROI)의 표시를 포함하는 스캔 요청을 수신하는 단계(210);상기 대상체(300)의 2개의 X선 스카우트 이미지(302, 304)를 획득하기 위해 상기 치과용 X선 이미징 유닛(102)의 부분을 제어하는 단계(220);상기 X선 스카우트 이미지(302, 304)에 대해 적어도 하나의 트레이닝된 검출 모델(616)을 적용함으로써 상기 적어도 하나의 ROI와 연관된 상기 2개의 스카우트 이미지(302, 304)로부터 상기 대상체(300)의 적어도 하나의 타깃 구조를 검출하는 단계(230);상기 검출된 적어도 하나의 타깃 구조에 적어도 부분적으로 기초하여 상기 치과용 X선 이미징 유닛(102)의 시야(FOV) 데이터를 정의하는 단계(240); 및상기 대상체(300)의 CT 치과용 X선 이미지 데이터를 획득하기 위해 상기 대상체(300)의 CT 스캔에 대해 정의된상기 FOV 데이터를 구현하도록 상기 치과용 X선 이미징 유닛(102)의 부분을 제어하는 단계(260)를 포함하는, 방법."}
{"patent_id": "10-2024-0124524", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "컴퓨터 프로그램(614)으로서, 상기 프로그램(614)이 제1항 내지 제12항 중 어느 한 항에 따른 X선 치과용 이미징 시스템(100)에 의해 실행될 때, 상기 X선 치과용 이미징 시스템(100)으로 하여금 제13항에 따른 방법을 수행하게 하는 명령어를 포함하는, 컴퓨터 프로그램(614)."}
{"patent_id": "10-2024-0124524", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "유형의 비휘발성 컴퓨터 판독 가능한 매체로서, 제1항 내지 제12항 중 어느 한 항에 따른 X선 치과용 이미징 시스템(100)에 의해 실행될 때, 상기 X선 치과용 이미징 시스템(100)으로 하여금 제14항에 따른 방법을 수행하게하는 명령어를 포함하는, 유형의 비휘발성 컴퓨터 판독 가능한 매체."}
{"patent_id": "10-2024-0124524", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 대상체의 컴퓨터 단층촬영(CT) 치과용 X선 이미징을 위한 치과용 X선 이미징 시스템에 관한 것이다. 시스템은, X선 소스 부분, X선 이미징 검출기 부분 및 갠트리 부분을 포함하는 치 과용 X선 이미징 유닛; 및 제어 시스템을 포함한다. 제어 시스템은, 적어도 하나의 관심 있는 영 (뒷면에 계속)"}
{"patent_id": "10-2024-0124524", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 일반적으로, 치과용 X선 이미징의 기술 분야에 관한 것이다. 특히, 본 발명은 컴퓨터 단층촬영(CT) 치과용 X선 이미징에 관한 것이다."}
{"patent_id": "10-2024-0124524", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "치과용 X선 이미징 유닛은 전형적으로, X선 소스 부분 및 X선 이미징 검출기 부분을 가지는 갠트리 부분(gantry part), 즉, 회전 부분을 포함한다. X선 소스 부분은 대상체, 예를 들어, 환자의 머리를 통해 X선 이미징 검출기 부분으로 이동하는 X선 빔을 제공한다. 컴퓨터 단층촬영(CT) 치과용 X선 이미징에서, X선 빔은 갠트리 부분이 대상체 주위를 회전하도록 배열될 때, 수직 회전 축 주위에 원통형 시야(FOV)를 형성한다. 원통형 FOV의 위치 및 치수는 CT 스캔에 포함될 대상체의 해부학적 구조가 원통형 FOV 내부에 있도록 정의되어야 한다. 환자 지지 액세서리는 전형적으로, 환자의 머리를 가능한 한 고정된 상태로 지지하기 위해 사용된다. 대상체(예 를 들어, 앞니 및/또는 측두하악관절(temporomandibular joint: TMJ))의 어떤 특정 영역(즉, 환자의 어떤 특정 해부학적 구조)을 위해 의도된 환자 지지 액세서리의 사용은 상기 어떤 특정 영역이 치과용 X선 이미징 유닛에대해 알려진 위치에 있고, 따라서 FOV의 3D 위치가 사전에 알려질 수 있음을 가능하게 한다. 그러나, 이것은 상 기 특정 영역이 신뢰 가능하게 이미징될 수 있지만, 다른 영역에 대해 환자 지지 액세서리가 존재하지 않음을 단지 가능하게 한다. 또한, 이 어떤 특정 영역에 대한 환자 지지 액세서리의 조립은 시간 소모적이다. 하나의 전통적인 FOV 위치 지정 및 치수화 접근법은 X선 스카우트 이미지, 즉, 전형적으로 90도 각도로 취해진 한 세트의 2개의 X선 투영 이미지를 사용한 것에 기초하고, 치과용 X선 이미징 유닛의 사용자, 예를 들어, 조작 자는 X선 스카우트 이미지에 의해 FOV를 수동적으로 배치하고 치수화한다. 조작자에 의한 수동 FOV 위치 지정 및 치수화는 시간 소모적이고 조작자에 의한 해부학적 지식 및 기술을 요구한다. 또 다른 알려진 FOV 위치 지정 및 치수화 접근법은 광학 스카우트 이미지를 사용한 것에 기초하고, 치과용 X선 이미징 유닛의 사용자는 광학 스카우트 이미지에 의해 FOV를 수동으로 배치하고 치수화한다. 그러나, 광학 스카 우트 이미지 기반 FOV 위치 지정 및 치수화는 환자의 치과용 해부학적 구조가 광학 스카우트 이미지에 도시되지 않기 때문에 정확하지 않다. 따라서, 광학 스카우트 이미지 기반 FOV 위치 지정 및 치수화에 더하여 X선 스카우 트 이미지 기반 FOV 위치 지정 및 치수화가 또한 필요하고, 이는 결과적으로 이미징 시간을 증가시킨다. 게다가, 광학 스카우트 이미지 기반 FOV 위치 지정 및 치수화는 X선 치과용 이미징 유닛이 하나 이상의 광학 카 메라를 포함할 것을 요구하고, 이는 X선 치과용 이미징 유닛의 가격을 증가시킨다."}
{"patent_id": "10-2024-0124524", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "다음 내용은 다양한 본 발명의 실시형태의 일부 양태의 기본적인 이해를 제공하기 위해 단순화된 요약을 제공한"}
{"patent_id": "10-2024-0124524", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 3, "content": "다. 요약은 본 발명의 광범위한 개요가 아니다. 이는 본 발명의 핵심 또는 중요한 요소를 식별하도록 의도되지"}
{"patent_id": "10-2024-0124524", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 4, "content": "않고 본 발명의 범위를 상세하게 기술하도록 의도되지도 않는다. 다음의 요약은 단지, 본 발명의 일부 개념을 본 발명의 실시형태를 예시화하는 더 상세한 설명에 대한 서두로서 단순화된 형태로 제공한다. 본 발명의 목적은 대상체의 컴퓨터 단층촬영(CT) 치과용 X선 이미징을 위한 치과용 X선 이미징 시스템 및 방법 을 제공하는 것이다. 본 발명의 또 다른 목적은 대상체의 CT 치과용 X선 이미징을 위한 치과용 X선 이미징 시스 템 및 방법이 이미징 시간을 감소시키고 이미징 정확도를 개선하는 것을 가능하게 하는 것이다. 본 발명의 목적은 각각의 독립 청구항에 정의된 바와 같이 치과용 X선 이미징 시스템, 방법, 컴퓨터 프로그램 및 유형의 비휘발성 컴퓨터 판독 가능한 매체에 의해 달성된다. 제1 양태에 따르면, 대상체의 컴퓨터 단층촬영(CT) 치과용 X선 이미징을 위한 치과용 X선 이미징 시스템이 제공 되고, 시스템은, 치과용 X선 이미징 유닛으로서: X선을 방출하기 위한 X선 소스 부분, 소스 부분으로부터 X선을 수신하기 위한 X선 이미징 검출기 부분, 및 X선 소스 부분 및 X선 이미징 검출기 부분을 포함하는 갠트리 부분 을 포함하는, 상기 치과용 X선 이미징 유닛 및 제어 시스템을 포함하고, 상기 제어 시스템은, 적어도 하나의 관 심 있는 영역(ROI)의 표시를 포함하는 스캔 요청을 수신하고; 대상체의 2개의 X선 스카우트 이미지를 획득하기 위해 치과용 X선 이미징 유닛의 부분을 제어하고; X선 스카우트 이미지에 대해 적어도 하나의 트레이닝된 검출 모델을 적용함으로써 적어도 하나의 ROI와 연관된 2개의 X선 스카우트 이미지로부터 대상체의 적어도 하나의 타 깃 구조를 검출하고; 검출된 적어도 하나의 타깃 구조에 적어도 부분적으로 기초하여 치과용 X선 이미징 유닛의 시야(FOV) 데이터를 정의하고; 대상체의 치과용 CT X선 이미징 데이터를 획득하기 위해 CT 스캔 대상체에 대해 정의된 FOV 데이터를 구현하도록 치과용 X선 이미징 유닛의 부분을 제어하도록 구성된다. FOV 데이터는 FOV 위치 및 FOV 크기를 포함할 수 있다. 대상체의 2개의 X선 스카우트 이미지는 측면(LAT) 뷰 각도 X선 스카우트 이미지 및 후방-전방(PA) 뷰 각도 X선 스카우트 이미지를 포함할 수 있다. 제어 시스템은 또한 2개의 X선 스카우트 이미지에 대한 치과용 X선 이미징 유닛의 이미징 기하학적 구조를 표현 하는 이미징 기하학적 구조 데이터를 얻고; 얻어진 이미징 기하학적 구조 데이터를 사용함으로써 검출된 적어도 하나의 타깃 구조를 3D 디바이스 좌표로 변환하도록 구성될 수 있다. 스캔 요청은 적어도 하나의 대상체 관련된 파라미터를 표현하는 대상체 데이터 및/또는 요구된 이미징 프로그램 을 표현하는 이미징 프로그램 데이터를 더 포함할 수 있다. 대상체 데이터 및/또는 이미징 프로그램 데이터는 FOV 데이터의 정의에서 사용될 수 있다. 적어도 하나의 트레이닝된 검출 모델은 기계 학습(ML) 모델 또는 인공 지능(AI) 모델일 수 있다. 적어도 하나의 트레이닝된 검출 모델은 적어도 하나의 공통 트레이닝된 검출 모델을 포함할 수 있고, 이는 X선 스카우트 이미지 둘 다에 대해 트레이닝될 수 있다. 대안적으로, 적어도 하나의 트레이닝된 검출 모델은 상이한 적어도 하나의 트레이닝된 검출 모델을 포함할 수 있고, 이는 각각의 X선 스카우트 이미지에 대해 트레이닝될 수 있다. 대안적으로 또는 부가적으로, 적어도 하나의 트레이닝된 검출 모델은 X선 스카우트 이미지에 이미징된 대상체의 영역에 의존할 수 있다. 2개의 X선 스카우트 이미지로부터 대상체의 적어도 하나의 타깃 구조를 검출하는 것은 랜드마크 기반 검출, 바 운딩 박스 기반 검출 및/또는 대상체 분할 기반 검출에 기초할 수 있다. 랜드마크 기반 검출에서, 적어도 하나의 ROI와 연관된 적어도 하나의 랜드마크는 X선 스카우트 이미지에 대해 적어도 하나의 트레이닝된 검출 모델을 적용함으로써 2개의 X선 스카우트 이미지로부터 검출될 수 있다. 제2 양태에 따르면, 컴퓨터 단층촬영(CT) 치과용 X선 이미징을 위한 방법이 제공되고, 방법은 상기 설명된 X선 치과용 이미징 시스템에 의해 수행되고, 방법은, 적어도 하나의 관심 있는 영역(ROI)의 표시를 포함하는 스캔 요청을 수신하는 단계; 대상체의 2개의 X선 스카우트 이미지를 획득하기 위해 치과용 X선 이미징 유닛의 부분을 제어하는 단계; X선 스카우트 이미지에 대해 적어도 하나의 트레이닝된 검출 모델을 적용함으로써 적어도 하나 의 ROI와 연관된 2개의 스카우트 이미지로부터 대상체의 적어도 하나의 타깃 구조를 검출하는 단계; 검출된 적 어도 하나의 타깃 구조에 적어도 부분적으로 기초하여 치과용 X선 이미징 유닛의 시야(FOV) 데이터를 정의하는 단계; 및 대상체의 CT 치과용 X선 이미지 데이터를 획득하기 위해 대상체의 CT 스캔에 대해 정의된 FOV 데이터 를 구현하도록 치과용 X선 이미징 유닛의 부분을 제어하는 단계를 포함한다. 제3 양태에 따르면, 컴퓨터 프로그램이 제공되고, 컴퓨터 프로그램은 프로그램이 상기 설명된 X선 치과용 이미 징 시스템에 의해 실행될 때, X선 치과용 이미징 시스템으로 하여금 상기 설명된 방법을 수행하게 하는 명령어 를 포함한다. 제4 양태에 따르면, 유형의 비휘발성 컴퓨터 판독 가능한 매체가 제공되고, 컴퓨터 판독 가능한 매체는 상기 설 명된 X선 치과용 이미징 시스템에 의해 실행될 때, X선 치과용 이미징 시스템으로 하여금 상기 설명된 방법을 수행하게 하는 명령어를 포함한다. 부가적인 목적 및 이의 장점과 함께, 구성 및 동작 방법 둘 다에 관한 본 발명의 다양한 예시적이고 비제한적인 실시형태는 첨부 도면과 관련하여 읽을 때 특정 예시적이고 비제한적인 실시형태의 다음의 설명으로부터 최상으 로 이해될 것이다. 동사 \"포함하는(to comprise)\" 및 \"포함하는(to include)\"은, 이 문서에서, 나열되지 않은 특징의 존재를 배제 하지 않고 요구하지도 않는 개방된 제한으로서 사용된다. 종속 청구항에서 나열된 특징은 달리 명시적으로 언급 되지 않는 한 상호 자유롭게 조합 가능하다. 또한, 이 문서 전체에서 영어의 관사(\"a\" 또는 \"an\")에 수반되는 단수 형태의 사용이 복수를 배제하지 않는다는 것을 이해해야 한다."}
{"patent_id": "10-2024-0124524", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이 설명에서, 우리는 치과용 X선 이미징 프로세스의 상이한 단계에 관해 다음의 어휘를 사용한다. 용어 방사는 단지 조사를 포함하는 단계, 즉, X선 소스가 대상체를 통해 X선 이미징 검출기로 이동하는 X선 빔을 제공하고 있는 단계를 의미한다. 대상체는 방사하는 동안 가능한 한 정지된 즉, 움직이지 않는 상태로 유지될 것으로 예 상될 수 있다. 방사하는 동안, 치과용 X선 이미징 유닛의 하나 이상의 부분은 움직일 수 있다. 용어 스캐닝은 결과적으로, 치과용 X선 이미징 유닛의 하나 이상의 부분을 방사하고 이동시키는 것을 포함하는 단계를 의미한 다. 스캐닝은 X선 이미지를 제공하기 위해 X선 이미징 유닛의 하나 이상의 부분을 정확한 위치에 배치하는 것을 포함하지 않는다. 용어 이미징은 방사, 스캐닝 및 위치 지정을 포함하는 전체 프로세스를 의미한다. 도 1은 대상체, 예를 들어, 환자(명확성을 위해 대상체는 도 1에 도시되지 않음)의 치과용 X선 이미 징을 위한 치과용 X선 이미징 시스템의 일례를 예시한다. 이미징 시스템은 치과용 X선 이미징에서, 예를 들어, 구강외 치과용 X선 이미징에서, 대상체 또는 교정 타깃으로부터 X선 이미지 데이터를 획득하기 위한 치과용 X선 이미징 유닛을 포함한다. 획득된 X선 이미지 데이터는 이미징된 대상체의 적어도 일 부로부터 3차원(3D) X선 볼륨을 재구성하기 위해 사용된다. 치과용 X선 이미징 시스템은 제어 시스템(10 6)을 더 포함한다. 제어 시스템은 치과용 X선 이미징 유닛에 전기적으로 및/또는 통신 가능하게 결합 될 수 있다. 제어 시스템의 구현은 독립형 유닛으로서 또는 분산된 제어 리소스를 제공하는 복수의 독립형 유닛 사이의 분산된 제어 환경으로서 행해질 수 있다. 바람직하게, 제어 시스템은 내장된 컴퓨터일 수 있 다. 제어 시스템은, 예를 들어, 치과용 X선 이미징 유닛의 제어 유닛을 포함할 수 있다. 제어 시스템 은 치과용 X선 이미징 유닛 외부에 있는 하나 이상의 컴퓨팅 유닛을 더 포함할 수 있다. 치과용 X선 이미징 유닛의 제어 유닛은 적어도 부분적으로 치과용 X선 이미징 유닛의 동작을 제어하도록 구성된 다. 치과용 X선 이미징 유닛의 제어 유닛은 치과용 X선 이미징 유닛에 근접하게 위치될 수 있거나 치 과용 X선 이미징 유닛의 제어 유닛은 치과용 X선 이미징 유닛 내에 내장될 수 있다. 치과용 X선 이미징 유닛은 컴퓨터 단층촬영(CT) 이미징 절차(즉, 이미징 모드)를 수행하도록 구성된다. CT 이미징은, 예를 들어, 빔이 원뿔 형상 빔인 원뿔형 빔 CT(CBCT) 이미징이거나, 예를 들어, 빔이 피라미드 형상 빔, 반달 형상 원뿔형 빔, 또는 임의의 다른 형상의 빔인 다른 유형의 CT 이미징일 수 있다. CT 이미징은 이미 징된 대상체의 적어도 일부로부터 3D 볼륨을 재구성하기 위한 X선 이미지 데이터를 야기한다(즉, 생성한다). 도 1은 본 발명의 개념과 함께 사용하기 위한 치과용 X선 이미징 유닛의 단지 하나의 예를 예 시한다. 치과용 X선 이미징 유닛은 지지 기둥 상에 이동 가능하게 지지될 수 있는 운반 부분을 포함한다. 운반 부분은 운반을 수직 방향으로 지지 기둥을 따라 위아래로 이동시키도록 구성되 는 가이드 모터(도 1에 도시되지 않음)에 의해 수직 방향(V)으로 위아래로 이동될 수 있다. 상부 선반은 수평(H) 평면에서 상부 선반에 대해 회전 가능한 갠트리 부분, 즉, 회전 부분을 지지하도록 구성된다. 상부 선반 및/또는 갠트리 부분은 갠트리 부분을 회전시키도록 구성된 회전 모터(도 1에 도시되지 않음)를 포함할 수 있다. 대안적으로 또는 부가적으로, 상부 선반 및/또는 갠트리 부분(11 2)은 기둥 주위로 상부 선반을 선회시키도록 구성된 선회 모터(도 1에 도시되지 않음)를 포함할 수 있다. 상부 선반 및/또는 갠트리 부분은 대안적으로 또는 부가적으로, 선형 움직임(들)을 제공하도록 구성된 적어도 하나의 선형 모터(도 1에 도시되지 않음)를 포함할 수 있다. 대안적으로 또는 부가적으로, 치과 용 X선 이미징 유닛은 지지 구조(도 1에 도시되지 않음)에, 예시적으로 기둥에 의해 지지되는 벽에 장착될 수 있다. 치과용 X선 이미징 유닛은 X선 소스 부분 및 X선 이미징 검출기 부분을 더 포함하고, 이는 X선 이미징 데이터의 획득에서 사용된다. 갠트리 부분은 소스 부분 및 이미징 검출기 부분을 구현하고 지지한다. 갠트리 부분은 도 1에서 제공된 바와 같이, 실질적으로 문자(C)의 형태를 가질 수 있고, 이 결과 소스 부분은 갠트리 부분의 하나의 단부 상에 부착될 수 있고 이미징 검출기 부분은 갠트 리 부분의 다른 단부 상에 부착될 수 있어서 소스 부분 및 이미징 검출기 부분이 서로 마주보게 한다. X선 소스 부분은 이미징되는 대상체, 예를 들어, 환자의 머리를 통해 X선을 X선 이미징 검출기 부분으로 방출하는(즉, X선 빔을 생성하는) X선 소스를 포함하고, 이는 소스 부분으로부터의 방출된 X선을 수신하는 적어도 하나의 X선 검출기를 포함한다. X선 이미징 검출기 부분은 또한, 노출된 X선, 즉, 이미징된 대상체로부터 X선 이미징 데이터를 생성한다. 치과용 X선 이미징 유닛은 또한, X선 소스 부분이 X선의 빔을 제한 및/또는 형성하기 위해 시준기 (도 1에 도시되지 않음)를 포함한다. X선은 대상체의 일부, 예를 들어, 환자의 해부학적 부분, 예를 들어, 환자의 머리를 통과한다. X선이 통과하는 해부학적 구조는 다양한 양의 X선 에너지를 흡수할 수 있다. 대 상체를 통과한 후에, 감쇠된 X선은 X선 이미징 검출기 부분에 의해 수신된다. X선 이미징 검출기 부 분은 수신된 X선 에너지의 크기를 변환하고 적어도 하나의 X선 검출기에서 흡수되지 않은 X선을 나타내는 디지털화된 출력, 즉, X선 이미지 데이터를 생성하도록 구성된다. X선 소스 부분으로부터 X선의 빔의 단일 방출에 대응하는 X선 이미징 검출기 부분으로부터의 디지털화된 출력의 컬렉션은 이미징되는 대상체, 예를 들어, 환자의 머리의 투영 이미지로 참조될 수 있다. 또한, 치과용 X선 이미징 유닛은 환자를 지지하기 위해 사용될 수 있는 환자 지지 부분(124, 126)(도 1에 서 제공된 바와 같지만, 반드시 그런 것은 아님)을 포함할 수 있다. 환자 지지 부분(124, 126)은 턱 지지 부분 및/또는 머리 지지 부분을 포함할 수 있다. 턱 지지 부분은 환자의 턱 끝을 지지할 수 있고 머 리 지지 부분은 환자의 이마 또는 관자놀이를 지지할 수 있다. 치과용 X선 이미징 유닛은 운반 으로부터 연장되는 하부 선반을 포함할 수 있다. 하부 선반은 도 1의 예시적인 치과용 X선 이미징 유 닛에서와 같이 턱 지지 부분을 포함할 수 있다. 머리 지지 부분은 도 1의 예시적인 치과용 X선 이미징 유닛에서와 같이 상부 선반으로부터 갠트리 부분을 통해 연장될 수 있다. 대안적으로, 하부 선반은 또한 머리 지지 부분을 포함할 수 있다. 환자 지지 부분, 즉, 턱 지지 부분 및/또 는 머리 지지 부분은 선택적일 수 있고, 환자의 위치 지정은 다른 방식으로 수행될 수 있다. 치과용 X선 이미징 유닛은 환자가 파지하기 위해 핸들을 더 포함할 수 있다. 갠트리 부분은, 예를 들어, 회전 모터에 의해 회전될 수 있다. 갠트리 부분의 회전은 X선 소스 부분 및 X선 이미징 검출기 부분을 이미징될 대상체 주위로, 예를 들어, 동작 경로를 따라 회전 축 주위 로 회전시킨다. X선 소스 부분에 의해 방출된 X선 빔은 갠트리 부분이 환자 주위로 회전할 때, 회전 축 주위로 3D 원통형 시야(FOV)를 형성한다. 3D 원통형 FOV는 스캔에 포함될 대상체의 해부학적 구조(들) 이 3D 원통형 FOV 내부에 있도록 치수화되고 배치되어야 한다. X선 소스 부분 및 X선 이미징 검출기 부분 이 대상체 주위로 회전됨에 따라, 치과용 X선 이미징 유닛은 회전의 증분 각도로 취해진 대상체 의 복수의 투영 이미지를 획득하도록 동작한다. 치과용 X선 이미지는 X선 이미지 데이터를 치과용 X선 이 미지로 재구성함으로써 복수의 투영 이미지로부터 형성될 수 있다. 다음으로, 대상체, 예를 들어, 환자의 CT 치과용 X선 이미징을 위한 방법의 적어도 일부 예시적인 양태는 도 2를 참조하여 정의된다. 도 2는 방법을 흐름도로서 예시한다. 방법은 상기 논의된 치과용 X선 시스템에 의해 수행된다. 대상체의 CT 치과용 이미징은 바람직하게 CBCT 치과용 이미징일 수 있다. 단계에서, 제어 시스템은 스캔 요청을 수신한다. 스캔 요청은 적어도 하나의 관심 있는 영역(ROI)의 표시를 포함한다. 적어도 하나의 ROI는 CT 스캔에 포함될 대상체의 적어도 하나의 영역(예를 들어, 적어도 하나의 타깃 해부학적 구조)을 표현한다. 예를 들어, 적어도 하나의 ROI는, 단일 치아, 치아의 범위, 치열궁(상 악 또는 하악), 치열궁 둘 다(상악 및 하악), 측두하악 관절(TMJ), TMJ 둘 다, 전체 치열 및 TMJ 중 적어도 하 나를 포함할 수 있지만, 이로 제한되지 않는다. 스캔 요청은 적어도 하나의 대상체 관련된 파라미터(예를 들어, 연령, 크기, 등)를 표현하는 대상체 데이터 및/또는 요구된 이미징 프로그램을 표현하는 이미징 프로그램 데이 터(예를 들어, 스캔에서 사용될 복용량의 표시를 포함하는 복용량 정보, 스캔에서 사용될 해상도의 표시를 포함 하는 해상도 정보, 등)를 더 포함할 수 있다. 스캔 요청은 또한, 환자 식별 데이터(예를 들어, 환자 이름, 환자 식별 번호, 사진, 지문, 망막 스캔, 얼굴 인식 및/또는 다른 생체 인식 데이터, 등)를 포함할 수 있다. 스캔 요 청은 사용자 인터페이스 부분(140a, 140b)을 통해 로컬적으로 또는 원격으로 수신될 수 있다. 사용자 인터페이 스 부분(140a)은, 예를 들어, 치과용 X선 이미징 유닛이 위치되는 것과 동일한 위치에 위치될 수 있고, 즉, 스캔 요청은 로컬적으로 수신될 수 있다. 예를 들어, 치과용 X선 이미징 유닛은 도 1의 예시적인 치과 용 X선 이미징 유닛에서와 같이, 사용자 인터페이스 부분(140a), 예를 들어, 터치 스크린을 포함할 수 있다. 치과용 X선 이미징 유닛의 조작자는 사용자 인터페이스 부분(140a)을 통해 스캔 요청을 입력할 수 있 다. 대안적으로 또는 부가적으로, 사용자 인터페이스 부분(140b)은, 예를 들어, 치과용 X선 이미징 유닛이 위치되는 위치보다는 또 다른 위치에 위치될 수 있고, 즉, 사용자 인터페이스 부분(140b)은 치과용 X선 이미징 유닛으로부터 원격에 위치되고, 제어 시스템과 통신 가능하게 결합될 수 있다. 이 경우에, 스캔 요청 은 원격으로 수신될 수 있다. 일례에 따르면, 초기 FOV 데이터는 수신된 스캔 요청에 기초하여 정의될 수 있다. 초기 FOV 데이터는 FOV의 초기 위치 및 FOV의 초기 크기(즉, FOV의 초기 치수)를 포함할 수 있다. 단계에서, 제어 시스템은 대상체의 2개의(비평행) X선 스카우트 이미지(302, 304), 예를 들어, 대상체의 제1 X선 스카우트 이미지 및 대상체의 제2 스카우트 이미지를 획득하기 위해 치 과용 X선 이미징 유닛의 부분을 제어한다. 2개의 X선 스카우트 이미지(302, 304)는 2차원(2D) X선 투영 이 미지이다. 바람직하게, 2개의 X선 스카우트 이미지(302, 304)는 서로 직교하여, 즉, 90도 각도로 획득된다. 가 장 바람직하게, 2개의 스카우트 이미지는 대상체의 측면(LAT) 뷰 각도 X선 스카우트 이미지, 즉, LAT 스카우트 이미지, 및 대상체의 후방-전방(PA) 뷰 각도 X선 스카우트 이미지, 즉, PA 스카우트 이미지 를 포함한다. 도 3a는 대상체의 LAT 스카우트 이미지를 획득하기 위한 대상체의 측면 이미징의 일례를 개략적으로 도시한다. 도 3b는 대상체의 PA 스카우트 이미지를 획득하기 위한 대상체의 후방-전방 이미징의 일례를 개략적으로 예시한다. 도 3c는 측면 이미징에 의해 획득된 대상체의 LAT 스카 우트 이미지의 일례를 개략적으로 예시한다. 도 3d는 후방-전방 이미징에 의해 획득된 대상체의 PA 스카우트 이미지의 일례를 개략적으로 예시한다. 단계에서, 제어 시스템은 자동화된 검출을 사용함으로써 수신된 스캔 요청에 표시된 적어도 하나의 ROI와 연관된 2개의 X선 스카우트 이미지(302, 304)로부터 대상체의 적어도 하나의 타깃 구조(예를 들어, 대상체의 적어도 하나의 해부학적 타깃 구조)를 검출한다. 자동화된 검출은 X선 스카우트 이미지(302, 304)에 대해 적어도 하나의 트레이닝된 검출 모델을 적용하는 것을 포함한다. 즉, 단계에서, 제어 시 스템은 X선 스카우트 이미지(302, 304)에 대해 적어도 하나의 트레이닝된 검출 모델을 적용함으로써 수신된 스캔 요청에 표시된 적어도 하나의 ROI와 연관된 2개의 X선 스카우트 이미지(302, 304)로부터 대상체 의 적어도 하나의 타깃 구조를 검출한다. 여전히 즉, 단계에서, 제어 시스템은 X선 스카우트 이 미지(302, 304)에 대해 적어도 하나의 트레이닝된 검출 모델을 적용함으로써 X선 스카우트 이미지(302, 304) 둘 다로부터의 수신된 스캔 요청에 표시된 적어도 하나의 ROI와 연관된 대상체의 동일한 적어도 하나 의 구조를 검출한다. 2개의 X선 스카우트 이미지(302, 304)는 적어도 하나의 트레이닝된 검출 모델의 입력 데이터로서 사용되고 적어도 하나의 ROI와 연관된 대상체의 적어도 하나의 타깃 구조는 적어도 하나의 트 레이닝된 검출 모델의 출력 데이터로서 얻어진다. 대상체의 적어도 하나의 타깃 구조의 검출은 적어 도 하나의 타깃 구조가 로컬화됨을 의미하고, 즉, 각각의 X선 스카우트 이미지(302, 304)에서의 이의 공간적 위 치가 정의되고, 이의 신원(예를 들어, 라벨의 이름)이 정의된다. 표현 \"적어도 하나의 ROI와 연관된 대상체 의 적어도 하나의 타깃 구조\"는 이 출원 전체에서, 대상체의 적어도 하나의 타깃 구조가 적어도 하나 의 ROI의 영역 내에 있고/있거나(예를 들어, 적어도 하나의 ROI에 포함됨) 적어도 하나의 ROI의 영역 내에 대상 체의 적어도 하나의 타깃 구조를 검출하기 위해 사용될 수 있는 대상체의 적어도 하나의 해부학적 구 조(적어도 하나의 ROI의 영역 밖에 있음)일 수 있음을 의미한다. 즉, ROI의 영역 내에 있는 대상체의 적어 도 하나의 타깃 구조는 직접적으로 및/또는 간접적으로 검출될 수 있다. 적어도 하나의 트레이닝된 검출 모델은 X선 스카우트 이미지(302, 304) 둘 다에 대해 트레이닝된 적어도 하나의 공통 트레이닝된 검출 모델을 포함할 수 있다. 이 경우에, 제어 시스템은 제1 X선 스카우트 이미지 로부터의 수신된 스캔 요청에 표시된 적어도 하나의 ROI와 연관된 대상체의 적어도 하나의 타깃 구조 를 검출하기 위해 제1 X선 스카우트 이미지(예를 들어, LAT 스카우트 이미지)에 대해 적어도 하나의 공통 트레이닝된 검출 모델 및 제2 X선 스카우트 이미지로부터의 수신된 스캔 요청에 표시된 적어도 하나 의 ROI와 연관된 대상체의 적어도 하나의 타깃 구조를 검출하기 위해 제2 X선 스카우트 이미지(예를 들어, PA 스카우트 이미지)에 대해 동일한 적어도 하나의 공통 트레이닝된 검출 모델을 적용할 수 있다. 대안적으로, 적어도 하나의 트레이닝된 검출 모델은 각각의 X선 스카우트 이미지(302, 304)에 대해 트레이닝된 상이한 적어도 하나의 검출 모델을 포함할 수 있다. 상기 논의된 바와 같이, 2개의 X선 스카우트 이미지(302, 304)는 서로 평행하지 않다. 따라서, 상이한 적어도 하나의 트레이닝된 검출 모델은 상이한 시야각에 대해 트레이닝될 수 있다. 즉, 상이한 적어도 하나의 검출 모델은 제1 X선 스카우트 이미지(예를 들어, LAT 스 카우트 이미지)에 대해 트레이닝될 수 있고 상이한 적어도 하나의 검출 모델은 제2 X선 스카우트 이 미지(예를 들어, PA 스카우트 이미지)에 대해 트레이닝될 수 있다. 적어도 하나의 트레이닝된 검출 모델이각각의 X선 스카우트 이미지(302, 304)에 대해 트레이닝된 상이한 적어도 하나의 검출 모델을 포함할 때, 제1 스카우트 이미지에 대해 트레이닝된 적어도 하나의 검출 모델은, 예를 들어, 적어도 하나의 트레이닝 된 제1 검출 모델로서 칭해질 수 있고 제2 스카우트 이미지에 대해 트레이닝된 적어도 하나의 검출 모델은, 예를 들어, 적어도 하나의 트레이닝된 제2 검출 모델로서 칭해질 수 있다. 이 경우에, 제어 시스 템은 제1 X선 스카우트 이미지로부터의 수신된 스캔 요청에 표시된 적어도 하나의 ROI와 연관된 대상 체의 적어도 하나의 타깃 구조를 검출하기 위해 제1 X선 스카우트 이미지(예를 들어, LAT 스카우트 이미지)에 대해 적어도 하나의 트레이닝된 제1 검출 모델 및 제2 X선 스카우트 이미지로부터의 수신 된 스캔 요청에 표시된 적어도 하나의 ROI와 연관된 대상체의 적어도 하나의 타깃 구조를 검출하기 위해 제2 X선 스카우트 이미지(예를 들어, PA 스카우트 이미지)에 대해 적어도 하나의 트레이닝된 제2 검출 모 델을 적용할 수 있다. 적어도 하나의 트레이닝된 검출 모델은 X선 스카우트 이미지(302, 304)에서 이미징된 대상체의 영역 에 의존할 수 있다. 즉, 상이한 트레이닝된 검출 모델은 대상체의 상이한 영역에 대해 트레이닝될 수 있다. 예를 들어, 적어도 하나의 트레이닝된 검출 모델은 대상체의 다음의 영역 중 적어도 하나에 대 해 트레이닝될 수 있다: 상악 치아의 영역, 하악 치아의 영역, 상악 및 하악 치아 둘 다의 영역 및/또는 TMJ의 영역, 등. 스카우트 이미지 둘 다(예를 들어, LAT 스카우트 이미지 및 PA 스카우트 이미지)(302, 304)에 대한 적어도 하나의 공통 트레이닝된 검출 모델은 대상체의 상이한 영역에 대해 트레이닝될 수 있다. 유사 하게, 제1 X선 스카우트 이미지(예를 들어, LAT 스카우트 이미지)에 대한 적어도 하나의 트레이닝된 제1 검출 모델은 대상체의 상이한 영역에 대해 트레이닝될 수 있고 제2 X선 스카우트 이미지(예를 들어, PA 스카우트 이미지)에 대한 적어도 하나의 트레이닝된 제2 검출 모델은 대상체의 상이한 영역 에 대해 트레이닝될 수 있다. X선 스카우트 이미지(302, 304)에 이미징된 대상체의 영역에 의존하여, X선 스카우트 이미지(302, 304)에 대한 적절한 적어도 하나의 트레이닝된 검출 모델이 선택될 수 있다. 적어도 하나의 트레이닝된 검출 모델은 트레이닝 데이터를 사용함으로써 형성될 수 있다. 적어도 하나의 검출 모델의 트레이닝은 바람직하게, 지도된 트레이닝, 즉, 지도된 학습일 수 있지만, 또한 다른 트레이닝 패러다임, 예를 들어, 지도되지 않은 학습, 강화 학습, 또는 2개 이상의 트레이닝 패러다임을 포함하는 하이브 리드 패러다임이 사용될 수 있다. 지도된 트레이닝에서, 트레이닝 데이터는 입력 트레이닝 데이터 및 출력 트레 이닝 데이터를 포함한다. 입력 트레이닝 데이터는, 예를 들어, 복수의 X선 스카우트 이미지를 포함할 수 있다. 입력 트레이닝 데이터에 포함된 복수의 X선 스카우트 이미지는, 예를 들어, 이전에 수집된 X선 스카우트 이미지 를 포함할 수 있다. 이전에 수집된 X선 스카우트 이미지는 바람직하게, 환자의 X선 스카우트 이미지를 포함할 수 있다. 대안적으로 또는 부가적으로, 이전에 수집된 X선 스카우트 이미지는 팬텀(예를 들어, 건조 두개골)의 X선 스카우트 이미지를 포함할 수 있다. 대안적으로 또는 부가적으로, 입력 트레이닝 데이터에 포함된 복수의 X 선 스카우트 이미지는 시뮬레이팅된 및/또는 인공 X선 스카우트 이미지를 포함할 수 있다. 데이터 증강은 또한, 또 다른 입력 트레이닝 데이터를 생성하기 위해 사용될 수 있다. 출력 트레이닝 데이터는, 예를 들어, 해부학적 구조의 주석, 예를 들어, 해부학적 구조의 위치 및 신원을 표현하는 주석 데이터를 포함할 수 있다. 출력 트레 이닝 데이터는 수동 프로세스, 예를 들어, 인간 전문가에 의해, 반자동화된 프로세스에서, 또는 완전 자동화된 프로세스에서 생성될 수 있다. 적어도 하나의 트레이닝된 검출 모델은 하나 이상의 기계 학습(ML) 방법 또 는 하나 이상의 인공 지능(AI) 방법에 기초할 수 있다. 즉, 적어도 하나의 트레이닝된 검출 모델은 ML 모 델 또는 AI 모델일 수 있다. 예를 들어, 적어도 하나의 트레이닝된 검출 모델은 트리 기반 기계 학습(ML) 방법, 예를 들어, 의사 결정 트리, 및 특히 회귀 트리에 기초할 수 있다. 단일 트리의 힘을 활용하기 위해, 다 수의 트리가 조합될 수 있다(즉, 앙상블). 바람직하게, 적어도 하나의 트레이닝된 검출 모델은 회귀 트리 ML 방법의 앙상블에 기초할 수 있다. 대안적으로, 적어도 하나의 트레이닝된 검출 모델은 합성곱 신경망 (CNN)에 기초할 수 있다. 적어도 하나의 트레이닝된 검출 모델은 제어 시스템의 메모리 부분에 저장될 수 있다. 다수의 트레이닝된 검출 모델이 상기 논의된 바와 같이 사용될 수 있을지라도, 각각의 트 레이닝된 검출 모델은 동일한 ML 방법 또는 AI 방법, 예를 들어, 앙상블 회귀 트리 ML 방법 또는 CNN에 대 한 것이다. 2개의 X선 스카우트 이미지(302, 304)로부터 대상체의 적어도 하나의 타깃 구조를 검출하는 것은 랜드마크 기반 검출, 바운딩 박스 기반 검출 및/또는 대상체 분할 기반 검출에 기초할 수 있다. 랜드마크 기반 검출과 바 운딩 박스 기반 검출의 조합은 각각의 X선 스카우트 이미지(302, 304)에 있는 영역의 바운딩 박스 검출에 이어 서 검출된 영역 내부에 적용된 랜드마크 기반 검출을 포함할 수 있다. 랜드마크 기반 검출에서, 적어도 하나의 ROI와 연관된 적어도 하나의 랜드마크는 자동화된 검출을 사용함으로써, 즉, X선 스카우트 이미지(302, 304)에 대해 적어도 하나의 트레이닝된 검출 모델을 적용함으로써 각각의 X선 스카우트 이미지(302, 304)로부터검출된다. 즉, 각각의 X선 스카우트 이미지(302, 304)는 적어도 하나의 트레이닝된 검출 모델의 입력 데이 터로서 사용될 수 있고 적어도 하나의 랜드마크는 적어도 하나의 트레이닝된 검출 모델의 출력 데이 터로서 얻어질 수 있다. 표현 \"적어도 하나의 ROI와 연관된 적어도 하나의 랜드마크\"은 이 출원 전체에서, 적어 도 하나의 랜드마크가 적어도 하나의 ROI의 영역 내에 있고/있거나(예를 들어, 적어도 하나의 ROI에 포함됨) 적 어도 하나의 ROI의 영역 내에서 적어도 하나의 랜드마크를 검출하기 위해 사용될 수 있는 적어도 하나의 랜드마 크(적어도 하나의 ROI의 영역 외부에 있음)일 수 있음을 의미한다. 즉, ROI의 영역 내의 적어도 하나의 랜드마 크는 직접적으로 및/또는 간접적으로 검출될 수 있다. 적어도 하나의 랜드마크의 일부 비제한적 예는 하악 치아, 상악 치아, TMJ, 전비강극(ANS), 후비강극(PNS), 및/또는 임의의 다른 두개골 구조를 포함할 수 있다. 랜 드마크 중 일부는 ROI와 직접적으로 관련될 수 있고 랜드마크 중 일부는 프록시 정보로서 사용될 수 있는 안정적인 두개골 구조일 수 있다. 예를 들어, ANS는 상악 치아 뿌리 바로 위에 위치되고, 따라서 상악 뿌 리의 가장 상부(superior) 위치가 추정될 필요가 있으면, ANS는 이에 대한 프록시 정보로서 사용될 수 있다. 도 4a는 LAT 스카우트 이미지로부터 상악 치아를 검출하기 위해 의도된 랜드마크의 비제한적 예를 개략 적으로 예시한다. 도 4b는 PA 스카우트 이미지로부터 상악 치아를 검출하기 위해 의도된 랜드마크의 비제한적 예를 개략적으로 예시한다. 도 4a 및 도 4b의 예에서, 점선 타원 내부의 작은 원은 랜드마크를 표현한다. 도 4a의 예에서, 사용된 트레이닝된 검출 모델은 상악 치아의 영역에서 LAT 스카우트 이미지 에 대해 트레이닝된다. 도 4b의 예에서, 사용된 트레이닝된 검출 모델은 상악 치아의 영역에서 PA 스 카우트 이미지에 대해 트레이닝된다. 단계에서, 제어 시스템은 단계에서 검출된 적어도 하나의 타깃 구조에 적어도 부분적으로 기초 하여 치과용 X선 이미징 유닛의 FOV 데이터를 정의한다. FOV 데이터는 FOV 위치 및 FOV 크기(즉, FOV의 치 수)를 포함할 수 있다. 바람직하게, 단계에서, 제어 시스템은 단계에서 검출된 적어도 하나의 타깃 구조에 기초하여 FOV 데이터를 정의한다. 대안적으로, 초기 FOV 데이터가 상기 논의된 바와 같이 스캔 요 청에 기초하여 정의되면, 제어 시스템은 단계에서 검출된 적어도 하나의 타깃 구조에 부분적으로 기 초하여 그리고 초기 FOV 데이터에 부분적으로 기초하여 FOV 데이터를 정의할 수 있다. 예를 들어, FOV 크기(또 는 FOV의 적어도 하나의 치수)는 초기 FOV 데이터에 기초하여 정의될 수 있거나 FOV 위치는, 예를 들어, 초기 FOV 데이터에 기초하여 정의될 수 있다. 비제한적 예에 따르면, FOV 위치는 단계에서 검출된 대상체의 적 어도 하나의 타깃 구조에 기초하여 정의될 수 있고 FOV 크기는 초기 FOV 데이터에 기초하여 정의될 수 있거나, 그 반대의 경우도 마찬가지다. FOV 위치는, 예를 들어, FOV의 중심 수직 축(즉, FOV 중심 축)일 수 있다. 적어 도 하나의 타깃 구조가 단일 구조(예를 들어, 단일 치아)를 포함하면, 제어 시스템은 FOV 중심 축을 정의 할 수 있어서 FOV 중심 축이 단일 구조의 중심을 통해 이동(즉, 통과)하게 한다. 대안적으로, 적어도 하나의 타 깃 구조가 다수의 구조(예를 들어, 다수의 치아)를 포함하면, 제어 시스템은 FOV 중심 축을 정의할 수 있 어서 FOV 중심 축이 다수의 구조의 중심을 통해 이동하게 한다. 다수의 구조의 중심은, 예를 들어, 평균화(예를 들어, 산술 평균, 기하 평균, 또는 가중된 평균, 등)를 사용함으로써 정의될 수 있다. FOV의 치수는, 예를 들어, FOV의 수평 치수(예를 들어, FOV의 폭, 즉, FOV의 직경, 또는 FOV의 반경), 및 FOV의 수직 치수(예를 들 어, FOV의 수직 높이)를 포함할 수 있다. 적어도 하나의 타깃 구조가 단일 구조를 포함하면, 제어 시스템 은, 예를 들어, 구조의 수평 치수에 기초하여 FOV의 수평 치수를 추정할 수 있다. 대안적으로, 적어도 하나의 타깃 구조가 다수의 구조를 포함하면, 제어 시스템은, 예를 들어, 각각의 구조에 대해 정의된 FOV 중심 축 으로부터의 거리를 정의함으로써 FOV의 수평 치수를 추정할 수 있고 이 거리의 최대치는 FOV의 반경으로서 사용 될 수 있다. FOV의 폭, 즉, FOV의 직경은 FOV의 반경에 기초하여 정의될 수 있다. FOV의 수직 치수는 FOV의 가 장 상부 지점 및 FOV의 가장 하부(inferior) 지점에 기초하여 정의될 수 있다. FOV의 가장 상부 지점을 정의하 기 위해, 제어 시스템은 적어도 하나의 타깃 구조의 가장 상부 지점을 정의하고 동일한 레벨에서 FOV의 상 단을 할당할 수 있고, 즉, 적어도 하나의 타깃 구조의 정의된 가장 상부 지점은 FOV의 가장 상부 지점으로서 할 당된다. 타깃 적어도 하나의 타깃 구조가 다수의 구조를 포함하면, 이 다수의 구조 모두의 가장 상부 지점은 FOV의 가장 상부 지점으로서 할당될 수 있다. FOV의 가장 하부 지점을 정의하기 위해, 제어 시스템은 적어 도 하나의 타깃 구조의 가장 하부 지점을 정의하고 동일한 레벨에서 FOV의 하단을 할당할 수 있고, 즉, 적어도 하나의 타깃 구조의 정의된 가장 하부 지점은 FOV의 가장 하부 지점으로서 할당된다. 적어도 하나의 타깃 구조 가 다수의 구조를 포함하면, 이 다수의 구조 모두의 가장 하부 지점은 FOV의 가장 하부 지점으로서 할당될 수 있다. 일례에 따르면, 안전 마진은 FOV의 수평 차원 및 FOV의 수직 차원에 부가될 수 있다. 안전 마진의 크기는, 예를 들어, 고정될 수 있고 이는 대상체, ROI, 및/또는 이미징 프로그램 데이터에 의존할 수 있다. 안전 마진은 FOV의 수평 차원 및 FOV의 수직 차원에 대해 동일할 수 있다. 대안적으로, 상이한 안전 마진은 FOV의 수평 차원및 수직 차원에 부가될 수 있다. 일례에 따르면, 대상체 데이터 및/또는 이미징 프로그램 데이터는 FOV 데이터 정의에서, 예를 들어, 안전 마진의 정의에서 사용될 수 있다. FOV 데이터는 단계에서 3D 이미징 디바이스 좌표(즉, 치과용 X선 이미징 유닛의 좌표)로 정의될 수 있다. 단계에서 검출된 대상체의 적어도 하나의 타깃 구조가 2D 이미지 좌표로 제공됨에 따라, 검출 된 적어도 하나의 타깃 구조는 3D 이미징 디바이스 좌표로 변환될 수 있다. 변환은 2개의 X선 스카우트 이미지 (302, 304)에 대한 치과용 X선 이미징 유닛의 이미징 기하학적 구조를 표현하는 이미징 기하학적 구조 데 이터를 사용함으로써 수행될 수 있다. 제어 시스템은, 예를 들어, 2개의 X선 스카우트 이미지가 획득될 때, 즉, 단계에서, 2개의 X선 스카우트 이미지의 획득과 관련하여 이미징 기하학적 구조 데이터를 얻을 수 있다. 제어 시스템은 얻어진 이미징 기하학적 구조 데이터를 사용함으로써 검출된 적어도 하나의 타깃 구 조를 3D 이미징 디바이스 좌표로 변환할 수 있다. 이미징 기하학적 구조 데이터를 사용하여, X선 스카우트 이미 지(302, 304)로부터 검출된 적어도 하나의 타깃 구조의 위치는 3D 이미징 디바이스 좌표로 변환될 수 있다. 예 를 들어, 동일한 타깃 구조(들)가 2개의 X선 스카우트 이미지에서(예를 들어, LAT 스카우트 이미지 및 PA 스카우트 이미지에서) 검출될 때, 타깃 구조(들)는 얻어진 이미징 기하학적 구조 데이터를 사용함으로써 3D 이미징 디바이스 좌표에 매핑될 수 있다. 변환은, 예를 들어, 교차선 방법을 적용함으로써 수행될 수 있다. 다음으로, 타깃 구조를 3D 이미징 디바이스 좌표로 변환하기 위해 하나의 타깃 구조에 대한 교차선 방법을 적용 하는 일례가 설명된다. 그러나, 교차선 방법은 문제의 타깃 구조를 3D 이미징 디바이스 좌표로 변환하기 위해 각각의 타깃 구조에 대해 유사하게 적용될 수 있다. 이미징 디바이스 좌표에서의 X선 소스의 위치는 이미징 기 하학적 구조 데이터로부터 정의될 수 있다. 유사하게, 이미징 디바이스 좌표에서의 X선 검출기의 위치는 이미징 기하학적 구조 데이터로부터 정의될 수 있다. X선 검출기의 위치와 X선 검출기에서의(즉, X선 스카우트 이미지 (302, 304)에서의) 검출된 타깃 구조를 조합함으로써, X선 스카우트 이미지(302, 304)에서의 검출된 타깃 구조 의 위치는 이미징 디바이스 좌표로 표현될 수 있다. 따라서, X선 소스로부터 X선 검출기에서의 검출된 타깃 구 조의 위치로의 선 원점은 이미징 디바이스 좌표에 형성될 수 있다. 2개의 비평행 X선 스카우트 이미지(302, 304)가 존재하기 때문에, 검출된 타깃 구조에 대한 2개의 비평행 선이 형성될 수 있다. 이미징 디바이스 좌표에 서의 검출된 타깃 구조의 위치는 이어서, 교차선 방법을 적용함으로써 풀어질 수 있다. 교차선 방법에 더하여, 많은 유사한 대안적인 방법, 예를 들어, 2D 평면과 선의 교차, 평면(예를 들어, 수평면) 상에 투영된 것에서의 2개의 선의 교차, 등이 존재한다. 이 대안적인 방법 또는 임의의 다른 알려진 방법의 각각은 이미징 기하학적 구조 데이터가 이용 가능할 때, 적어도 하나의 타깃 구조를 3D 이미징 디바이스 좌표로 변환하기 위해 사용될 수 있다. FOV 데이터를 정의한 후에, 선택적 단계에서, 제어 시스템은 하나 이상의 사용자 인터페이스 디바이 스, 예를 들어, 사용자 인터페이스 부분(140a)을 통해, 검토 및 승인을 위해 X선 스카우트 이미지(302, 304) 위 에 겹쳐진 정의된 FOV 데이터를 치과용 X선 이미징 유닛의 조작자에게 출력할 수 있다. 이것은 조작자가 정의된 FOV 데이터의 정확성을 검토할 수 있는 것을 가능하게 한다. 조작자가 정의된 FOV 데이터에 만족하면, 조작자는 정의된 FOV 데이터를 승인할 수 있다. 대안적으로, 조작자가 정의된 FOV 데이터에 만족하지 않으면, 조작자는 FOV 데이터를 승인하기 전에 사용자 인터페이스 부분(140a)을 통해 FOV 위치 및/또는 FOV의 적어도 하 나의 치수를 수동으로 조정할 수 있다. 단계에서, 제어 시스템은 대상체의 치과용 CT X선 이미지 데이터를 획득하기 위해 대상체 의 CT 스캔을 위한 정의된 FOV 데이터를 구현하도록 치과용 X선 이미징 유닛의 부분을 제어한다. 대칭 CT 이미징의 경우에, 제어 시스템은 CT 스캔의 시작 위치로 이동하기 위해 치과용 X선 이미징 유닛의 갠 트리 부분을 제어하고, 회전 축은 단계에서 정의된 FOV의 중심 축과 정렬된다. 회전 축은 갠트리 부 분의 기계적 회전 축 또는 가상 회전 축일 수 있다. 가상 회전 축은, 예를 들어, 갠트리 부분의 기계 적 회전 축을 원형 경로를 따라 이동시킴으로써 얻어질 수 있고, 이 결과 가상 회전 축은 상기 원형 경로의 중 심에 형성될 수 있다. 오프셋된 CT 이미징의 경우에, CT 스캔의 시작 위치는 단계에서 정의된 FOV의 중심 축으로부터 알려진 방향으로 알려진 양만큼, 즉, 알려진 오프셋 벡터만큼 오프셋될 수 있다. 제어 시스템 은 X선 소스 부분의 시준기에 의해 FOV의 정의된 수평 치수에 대응하도록 FOV의 수평 치수(50 4)를 조정할 수 있다. FOV의 수직 치수는 시준기에 의해 FOV의 정의된 수직 치수에 대응하도록 조정될 수 있다. 예를 들어, FOV의 수직 치수는 X선 소스 부분의 시준기를 제어함으로써 조정될 수 있어서 FOV의 가장 상부 지점이 FOV의 정의된 가장 상부 지점에 대응하게 하고/하거나 FOV(50 2)의 가장 하부 지점이 FOV의 정의된 가장 하부 지점에 대응하게 한다. X선 소스 부분의 시준기는 조 정 가능한 슬릿을 포함할 수 있다. 시준기의 슬릿의 크기는 FOV의 수평 치수를 조정하기 위해 수평 방향으로 그리고 FOV의 수직 치수를 조정하기 위해 수직 방향으로 조정될 수 있다. 도 5a는FOV의 수평 치수를 조정하는 일례를 개략적으로 예시한다. 이 예에서 수평 치수는 FOV의 폭, 즉, FOV의 직경이다. FOV의 직경은 수평 방향으로 시준기의 슬릿의 크기를 조정함으로 써 조정될 수 있다. 수평 방향의 시준기의 슬릿의 크기, 즉, 슬릿의 폭은 점선 화살표로 도 5a에 예 시된다. 시준기의 슬릿이 수평 방향으로 커질수록 FOV의 직경이 커진다. 즉, 시준기의 슬 릿을 수평 방향으로 폐쇄함으로써, FOV의 직경이 더 작게 조정될 수 있고 시준기의 슬릿을 수평 방향으로 개방함으로써, FOV의 직경이 더 크게 조정될 수 있다. 도 5b는 FOV의 수직 치수 를 조정하는 일례를 개략적으로 예시한다. 이 예에서 수직 치수는 FOV의 높이이다. FOV의 높이 은 수직 방향으로 시준기의 슬릿의 크기를 조정함으로써 조정될 수 있다. 수직 방향의 시준기의 슬릿의 크기, 즉, 슬릿의 높이는 도 5b에서 점선 화살표로 예시된다. 시준기의 슬릿이 수직 방향으로 커질수록, FOV의 높이가 커진다. 즉, 시준기의 슬릿을 수직 방향으로 폐쇄함으로써, FOV의 높이는 더 작게 조정될 수 있고 시준기의 슬릿을 수직 방향으로 개방함으로써, FOV의 높이(51 0)는 더 크게 조정될 수 있다. 단계에서, 회전축이 CT 스캔의 시작 위치로 이동되고 FOV의 수평 치수 및 수직 치수가 단계에서 조정 된 후에, 제어 시스템은 대상체의 치과용 CT X선 이미징 데이터를 획득하기 위해 대상체를 스캔 하도록 치과용 X선 이미징 유닛의 부분을 제어한다. 단계에서 제어하는 것은 대상체의 치과용 CT X선 이미징 데이터를 획득하기 위해 회전축을 중심으로 CT 스캔의 동작 경로에 따라 회전하기 위해 갠트리 부분을 제어하는 것을 포함할 수 있다. 동작 경로는, 예를 들어, 회전축을 중심으로 원형 경로 또는 비원 형 경로, 예를 들어, 타원 경로일 수 있다. 원형 경로 또는 비원형 경로는 회전축을 중심으로 완전 회전 또는 부분 회전일 수 있다. 비원형 회전 경로는, 예를 들어, 원형 경로로부터 벗어나는 동작 경로, 예를 들어, 타원 경로를 따라 갠트리 부분을 이동시킴으로써 생성될 수 있다. 회전 축에 대한 다른 기술 또는 정렬은 당업 자에 의해 인식될 바와 같이 또한 사용될 수 있다. 도 6은 치과용 X선 이미징 시스템의 제어 시스템의 개략적인 예를 예시한다. 제어 시스템은 프 로세서 부분, 데이터 전송 부분, 사용자 인터페이스 부분, 및 메모리 부분을 포함할 수 있 다. 프로세서 부분은 사용자 및/또는 컴퓨터 프로그램(소프트웨어) 개시된 명령어를 수행하고, 데이터를 프로세싱하도록 구성된다. 프로세서 부분은 적어도 하나의 프로세서를 포함할 수 있다. 메모리 부분 은 데이터를 저장하고 유지하도록 구성된다. 데이터는 명령어, 컴퓨터 프로그램, 적어도 하나의 트레이닝된 검 출 모델 및 임의의 데이터 파일일 수 있다. 메모리 부분은 적어도 하나의 메모리를 포함할 수 있다. 메모리 부분은 데이터 전송 부분을 제어하기 위해 적어도 하나의 데이터 전송 애플리케이션, UI 부분을 제어하기 위해 사용자 인터페이스 애플리케이션 및 제어 시스템의 동작을 제어하기 위해 컴퓨터 프로그램(코드)을 더 포함할 수 있다. 프로세서 부분과 함께, 메모리 부분 및 컴퓨터 프 로그램은 상기 설명된 바와 같이 제어 시스템으로 하여금 적어도 하나 이상의 방법 단계 및/또는 제 어 시스템의 동작을 구현하게 할 수 있다. 데이터 전송 부분은 제어 명령을 다른 유닛, 예를 들어, 치과용 X선 이미징 유닛으로 전송하도록 구성될 수 있다. 게다가, 데이터 전송 부분은 다른 유닛, 예 를 들어, 치과용 X선 이미징 유닛, 사용자 인터페이스 부분(140b), 데이터베이스(들) 및/또는 임의의 다른 외부 유닛으로부터 데이터를 수신할 수 있다. 사용자 인터페이스(UI) 부분은 제어 명령을 입력하고, 정보 및/또는 명령어를 수신하고, 정보를 디스플레이하도록 구성될 수 있다. UI 부분은 적어도 디스플레이, 스 크린, 터치스크린, 적어도 하나의 기능 키, 키보드, 유선 또는 무선 원격 제어기, 또는 임의의 다른 사용자 입 력 및/또는 출력 디바이스를 포함할 수 있다. 컴퓨터 프로그램은 컴퓨터, 예를 들어, 제어 시스템과 함께 사용하기 위해 이 안에 구현된 컴퓨터 프로그램 코드를 지니는 유형의 비휘발성(비일시적) 컴퓨터 판 독 가능한 매체에 포함될 수 있는 컴퓨터 프로그램 제품일 수 있다. 상기 설명된 CT 치과용 X선 이미징 방법은 치과용 X선 이미징 유닛의 조작자에 의한 수동 FOV 위치 지정이 필요하지 않기 때문에, 이미징 시간을 감소시키는 것을 가능하게 한다. 또한, FOV 위치 지정은 치과용 X선 이미 징 유닛의 조작자에 의한 해부학적 지식 및 기술에 의존하지 않는다. 따라서, 상기 설명된 CT 치과용 X선 이미징 방법은 이미징 정확도를 개선한다. FOV 위치 지정이 조작자에 의한 해부학적 지식 및 기술에 의존하지 않을지라도, 상기 설명된 CT 치과용 X선 이미징 방법은 조작자의 기술에 대한 지원을 제공한다. 상기 주어진 설명에서 제공된 특정 예는 첨부된 청구항의 적용 가능성 및/또는 해석을 제한하는 것으로서 해석 되어서는 안 된다. 상기 주어진 설명에서 제공된 예의 목록 및 그룹은 달리 명시적으로 언급되지 않는 한 포괄 적이지 않다.도면 도면1 도면2 도면3a 도면3b 도면3c 도면3d 도면4a 도면4b 도면5a 도면5b 도면6"}
{"patent_id": "10-2024-0124524", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 발명의 실시형태는 첨부 도면의 도면에서, 제한으로서가 아닌 예로서 예시된다. 도 1은 대상체의 치과용 X선 이미징을 위한 치과용 X선 이미징 시스템의 일례를 개략적으로 예시된다. 도 2는 대상체의 CBCT 치과용 이미징을 위한 방법의 일례를 개략적으로 예시된다. 도 3a는 대상체의 측면(LAT) 이미징의 일례를 개략적으로 예시된다. 도 3b는 후방-전방(PA) 이미징 대상체의 일례를 개략적으로 예시된다. 도 3c는 대상체의 LAT 스카우트 이미지의 일례를 개략적으로 예시된다. 도 3d는 대상체의 PA 스카우트 이미지의 일례를 개략적으로 예시된다. 도 4a는 대상체의 LAT 스카우트 이미지로부터 상악 치아를 검출하기 위해 의도된 랜드마크의 비제한적 예를 개략적으로 예시된다. 도 4b는 대상체의 PA 스카우트 이미지로부터 상악 치아를 검출하기 위해 의도된 랜드마크의 비제한적 예를 개략 적으로 예시된다. 도 5a는 시야(FOV)의 수평적 차원을 조정하는 일례를 개략적으로 예시된다. 도 5b는 FOV의 수직적 차원을 조정하는 일례를 개략적으로 예시된다. 도 6은 치과용 X선 이미징 시스템의 제어 시스템의 일례를 개략적으로 예시된다."}
