{"patent_id": "10-2020-7025653", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0108907", "출원번호": "10-2020-7025653", "발명의 명칭": "블록체인에 기록된 제한된 정보의 맞춤형 뷰", "출원인": "아메리코프 인베스트먼트스 엘엘씨", "발명자": "시몬스 조던"}}
{"patent_id": "10-2020-7025653", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "컴퓨터 장치로서,하나 이상의 컴퓨터 판독 가능 저장 매체;상기 하나 이상의 컴퓨터 판독 가능 저장 매체에 작동 가능하게 결합된 하나 이상의 프로세서; 및상기 하나 이상의 컴퓨터 판독 가능 저장 매체에 저장된 프로그램 명령을 포함하며,상기 프로그램 명령이 상기 하나 이상의 프로세서에 의해 실행될 때, 상기 하나 이상의 프로세서로 하여금, 적어도,노드의 분산 네트워크의 사용자 장치에서 복수의 사용자가 요청한 블록 엔트리들 - 상기 블록 엔트리들 각각은,액세스 레벨과 각각 연관된 복수의 데이터 부분들을 포함함 -의 블록체인을 유지하게 하고,블록 엔트리의 하나 이상의 데이터 부분들을 보기 위한 요청 - 상기 요청은, 적어도 하나의 액세스 레벨과 연관된 액세스 코드를 포함함 -을 수신하게 하고;상기 액세스 레벨과 연관된 하나 이상의 데이터 부분들을 식별하기 위해 상기 블록 엔트리들의 블록체인으로 상기 요청의 상기 액세스 코드를 평가하게 하고;상기 액세스 레벨과 연관된 상기 하나 이상의 데이터 부분들을 포함하는 상기 블록 엔트리의 맞춤형 뷰(customized view)를 생성하게 하는,컴퓨터 장치."}
{"patent_id": "10-2020-7025653", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 블록 엔트리들의 블록체인으로 상기 요청의 상기 액세스 코드를 평가하는 것은, 상기 하나 이상의 프로세서가 상기 액세스 레벨과 연관된 상기 하나 이상의 데이터 부분들을 보기 위하여 액세스를 검증하는 암호화 코드를 처리하도록 구성되는 것을 포함하는,컴퓨터 장치."}
{"patent_id": "10-2020-7025653", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 하나 이상의 상기 프로세서는 또한, 상기 블록 엔트리들 내의 상기 복수의 데이터 부분들 각각에 대해 상기 노드의 분산 네트워크에서 적어도 하나의 공개된 위치를 나타내는 상기 블록 엔트리들 내의 상기 복수의 데이터 부분들 각각에 대한 포인터를 유지하도록 구성되고,상기 액세스 레벨과 연관된 상기 하나 이상의 데이터 부분들을 포함하는 상기 블록 엔트리의 상기 맞춤형 뷰를생성하는 것은, 상기 하나 이상의 프로세서가 상기 블록 엔트리들의 상기 복수의 데이터 부분들 각각에 대한 상기 포인터를 사용하여 상기 액세스 레벨과 연관된 상기 하나 이상의 데이터 부분들을 검색하도록 구성되는 것을포함하는,컴퓨터 장치."}
{"patent_id": "10-2020-7025653", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 사용자 장치에서 상기 복수의 사용자가 요청한 상기 블록 엔트리들의 블록체인을 유지하는 것은, 상기 하나 이상의 프로세서가 각각의 상기 액세스 레벨과 연관된 상기 하나 이상의 데이터 부분들에 대한 별도의 블록공개특허 10-2020-0108907-3-엔트리를 유지하도록 구성되는 것을 포함하고,상기 액세스 레벨과 연관된 상기 하나 이상의 데이터 부분들을 식별하기 위해 상기 블록 엔트리들의 블록체인으로 상기 요청의 상기 액세스 코드를 평가하는 것은, 상기 하나 이상의 프로세서가 각각의 상기 액세스 레벨과연관된 상기 하나 이상의 데이터 부분들에 대한 상기 블록체인들 중 하나를 보기 위하여 액세스를 검증하고자상기 액세스 코드를 처리하도록 구성되는 것을 포함하는,컴퓨터 장치."}
{"patent_id": "10-2020-7025653", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 사용자 장치에서 상기 복수의 사용자가 요청한 상기 블록 엔트리들의 블록체인을 유지하는 것은, 상기 하나 이상의 프로세서가 각각의 상기 액세스 레벨과 연관된 상기 하나 이상의 데이터 부분들에 대한 별도의 블록체인을 유지하도록 구성되는 것을 포함하고,상기 액세스 레벨과 연관된 상기 하나 이상의 데이터 부분들을 식별하기 위하여 상기 블록 엔트리들의 블록체인으로 상기 요청의 상기 액세스 코드를 평가하는 것은, 상기 하나 이상의 프로세서가 각각의 상기 액세스 레벨과연관된 상기 하나 이상의 데이터 부분들에 대한 상기 블록체인들 중 하나를 보기 위하여 액세스를 검증하고자상기 액세스 코드를 처리하도록 구성되는 것을 포함하는,컴퓨터 장치."}
{"patent_id": "10-2020-7025653", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서,상기 블록 엔트리의 적어도 상기 데이터 부분을 보기 위한 상기 수신된 요청은, 상기 블록 엔트리의 적어도 상기 데이터 부분을 보기 위한 인벤토리 추적 요청을 포함하는,컴퓨터 장치."}
{"patent_id": "10-2020-7025653", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서,상기 블록 엔트리의 적어도 상기 데이터 부분을 보기 위한 상기 수신된 요청은, 상기 블록 엔트리의 적어도 상기 데이터 부분을 보기 위한 재무 감사 요청을 포함하는,컴퓨터 장치."}
{"patent_id": "10-2020-7025653", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1 항에 있어서,상기 블록 엔트리의 적어도 상기 데이터 부분을 보기 위한 상기 수신된 요청은, 상기 블록 엔트리의 적어도 상기 데이터 부분을 보기 위한 게임 규제 요청을 포함하는,컴퓨터 장치."}
{"patent_id": "10-2020-7025653", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1 항에 있어서,상기 블록 엔트리의 최소한의 데이터 부분과 연관된 상기 액세스 레벨은, 비공개 액세스 레벨, 허가 액세스 레벨 및 공개 액세스 레벨 중 적어도 하나를 포함하는,컴퓨터 장치."}
{"patent_id": "10-2020-7025653", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "블록체인 트랜잭션의 맞춤형 뷰를 생성하는 방법으로서,공개특허 10-2020-0108907-4-노드의 분산 네트워크의 사용자 장치에서 복수의 사용자가 요청한 블록 엔트리들 - 상기 블록 엔트리들 각각은,액세스 레벨과 각각 연관된 복수의 데이터 부분들을 포함함 -의 블록체인을 유지하는 단계;블록 엔트리의 하나 이상의 데이터 부분들을 보기 위한 요청 - 상기 요청은, 적어도 하나의 액세스 레벨과 연관된 액세스 코드를 포함함 -을 수신하는 단계;상기 액세스 레벨과 연관된 하나 이상의 데이터 부분들을 식별하기 위하여 상기 블록 엔트리들의 블록체인으로상기 요청의 상기 액세스 코드를 평가하는 단계; 및상기 액세스 레벨과 연관된 상기 하나 이상의 데이터 부분들을 포함하는 상기 블록 엔트리의 맞춤형 뷰를 생성하는 단계를 포함하는, 방법."}
{"patent_id": "10-2020-7025653", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 10 항에 있어서,상기 블록 엔트리들의 블록체인으로 상기 요청의 상기 액세스 코드를 평가하는 단계는, 상기 액세스 레벨과 연관된 상기 하나 이상의 데이터 부분들을 보기 위하여 액세스를 검증하도록 암호화 코드를 처리하는 단계를 포함하는,방법."}
{"patent_id": "10-2020-7025653", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 10 항에 있어서,상기 블록 엔트리들 내의 상기 복수의 데이터 부분들 각각에 대한 적어도 하나의 공개된 위치를 나타내는 상기블록 엔트리들 내의 상기 복수의 데이터 부분들 각각에 대한 포인터를 유지하는 단계를 더 포함하고,상기 액세스 레벨과 연관된 상기 하나 이상의 데이터 부분들을 포함하는 상기 블록 엔트리의 상기 맞춤형 뷰를생성하는 단계는, 상기 블록 엔트리들의 상기 복수의 데이터 부분들 각각에 대한 상기 포인터를 사용하여 상기액세스 레벨과 연관된 상기 하나 이상의 데이터 부분들을 검색하는 단계를 포함하는,방법."}
{"patent_id": "10-2020-7025653", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 10 항에 있어서,상기 사용자 장치에서 상기 복수의 사용자가 요청한 상기 블록 엔트리들의 블록체인을 유지하는 단계는, 각각의액세스 레벨과 연관된 상기 하나 이상의 데이터 부분들에 대한 별도의 블록 엔트리를 유지하는 단계를포함하고,상기 액세스 레벨과 연관된 상기 하나 이상의 데이터 부분들을 식별하기 위해 상기 블록 엔트리들의 블록체인으로 상기 요청의 상기 액세스 코드를 평가하는 단계는, 각각의 상기 액세스 레벨과 연관된 상기 하나 이상의 데이터 부분들에 대한 상기 블록체인들 중 하나를 보기 위하여 액세스를 검증하도록 상기 액세스 코드를 처리하는단계를 포함하는,방법."}
{"patent_id": "10-2020-7025653", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 10 항에 있어서,상기 사용자 장치에서 상기 복수의 사용자가 요청한 상기 블록 엔트리들의 블록체인을 유지하는 단계는, 각각의상기 액세스 레벨과 연관된 상기 하나 이상의 데이터 부분들에 대한 별도의 블록체인을 유지하는 단계를 포함하고,상기 액세스 레벨과 연관된 상기 하나 이상의 데이터 부분들을 식별하기 위해 상기 블록 엔트리들의 블록체인으로 상기 요청의 상기 액세스 코드를 평가하는 단계는, 각각의 상기 액세스 레벨과 연관된 상기 하나 이상의 데공개특허 10-2020-0108907-5-이터 부분들에 대한 상기 블록체인들 중 하나를 보기 위하여 액세스를 검증하도록 상기 액세스 코드를 처리하는단계를 포함하는,방법."}
{"patent_id": "10-2020-7025653", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 10 항에 있어서,상기 블록 엔트리의 적어도 상기 데이터 부분을 보기 위한 상기 수신된 요청은, 상기 블록 엔트리의 적어도 상기 데이터 부분을 보기 위한 인벤토리 추적 요청을 포함하는,방법."}
{"patent_id": "10-2020-7025653", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 10 항에 있어서,상기 블록 엔트리의 적어도 상기 데이터 부분을 보기 위한 상기 수신된 요청은, 상기 블록 엔트리의 적어도 상기 데이터 부분을 보기 위한 재무 감사 요청을 포함하는,방법."}
{"patent_id": "10-2020-7025653", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 10 항에 있어서,상기 블록 엔트리의 적어도 상기 데이터 부분을 보기 위한 상기 수신된 요청은, 상기 블록 엔트리의 적어도 상기 데이터 부분을 보기 위한 게임 규제 요청을 포함하는,방법."}
{"patent_id": "10-2020-7025653", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 10 항에 있어서,상기 블록 엔트리의 최소한의 데이터 부분과 연관된 상기 액세스 레벨은, 비공개 액세스 레벨, 허가 액세스 레벨 및 공개 액세스 레벨 중 적어도 하나를 포함하는,방법."}
{"patent_id": "10-2020-7025653", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 10 항에 있어서,상기 데이터 부분과 연관된 상기 액세스 레벨은, 보안 허가 레벨을 포함하는,방법."}
{"patent_id": "10-2020-7025653", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 19 항에 있어서,상기 블록 엔트리는, 상기 보안 허가 레벨을 기반으로 한 교정 매핑을 포함하고,상기 방법은, 상기 블록 엔트리의 상기 하나 이상의 데이터 부분들 중 일부를 난독화하도록 상기 교정 매핑을적용하는 단계를 더 포함하는,방법."}
{"patent_id": "10-2020-7025653", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제 10 항에 있어서,상기 블록 엔트리는, 상기 적어도 하나의 액세스 레벨을 기반으로 한 복수의 교정 매핑을 포함하는,공개특허 10-2020-0108907-6-방법."}
{"patent_id": "10-2020-7025653", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "블록 엔트리의 하나 이상의 데이터 부분들을 보기 위한 사용자로부터의 요청 - 상기 사용자로부터의 요청은, 적어도 하나의 액세스 레벨과 연관되어 있음 - 을 수신하는 단계;상기 사용자와 연관된 상기 적어도 하나의 액세스 레벨을 기반으로, 상기 블록 엔트리의 상기 하나 이상의 데이터 부분들의 맞춤형 뷰를 생성하는 단계를 포함하는, 방법."}
{"patent_id": "10-2020-7025653", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제 22 항에 있어서,상기 적어도 하나의 액세스 레벨은, 보안 허가 레벨을 포함하는,방법."}
{"patent_id": "10-2020-7025653", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제 23 항에 있어서,상기 블록 엔트리는, 상기 적어도 하나의 액세스 레벨을 기반으로 한 교정 매핑을 포함하고,상기 방법은, 상기 블록 엔트리의 상기 하나 이상의 데이터 부분들 중 일부를 난독화하기 위하여 상기 교정 매핑을 적용하는 단계를 더 포함하는,방법."}
{"patent_id": "10-2020-7025653", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제 24 항에 있어서,상기 블록 엔트리는, 적어도 하나의 액세스 레벨을 기반으로 한 복수의 교정 매핑을 포함하는,방법."}
{"patent_id": "10-2020-7025653", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "시스템으로서,복수의 블록 엔트리들을 갖는 블록체인; 및데이터 플랫폼을 포함하되상기 데이터 플랫폼은,상기 복수의 블록 엔트리들 중 하나로부터 하나 이상의 데이터 부분들을 보기 위한 요청 - 상기 요청은, 적어도하나의 액세스 레벨과 연관되어 있음 - 을 수신하고,상기 블록체인에 액세스하여 상기 적어도 하나의 액세스 레벨에 대응하는 상기 하나 이상의 데이터 부분들을 검색하고,상기 적어도 하나의 액세스 레벨을 기반으로, 상기 블록 엔트리의 상기 하나 이상의 데이터 부분들의 맞춤형 뷰를 생성하도록 구성된,시스템."}
{"patent_id": "10-2020-7025653", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "제 26 항에 있어서,상기 블록체인은, 비공개 블록체인, 공개 블록체인, 또는 하이브리드 블록체인을 포함하는,공개특허 10-2020-0108907-7-시스템."}
{"patent_id": "10-2020-7025653", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_28", "content": "제 26 항에 있어서,상기 하나 이상의 데이터 부분들이 상기 블록체인에 추가되고, 상기 복수의 블록 엔트리들을 자동으로 감사할때, 상기 하나 이상의 데이터 부분들을 수집하기 위한 인공 지능 엔진이나 기계 학습 엔진을 더 포함하는,시스템."}
{"patent_id": "10-2020-7025653", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "제 26 항에 있어서,상기 데이터 플랫폼은, 상기 하나 이상의 데이터 부분들을 복호화함으로써 상기 맞춤형 뷰를 생성하는,시스템."}
{"patent_id": "10-2020-7025653", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_30", "content": "방법으로서,장치들로부터 복수의 사용자에 의한 트랜잭션 - 상기 트랜잭션 각각은, 권한 레벨과 각각 연관된 복수의 트랜잭션 세그먼트들을 포함함 - 의 분산 원장을 유지하는 단계;하나 이상의 트랜잭션 세그먼트들을 보기 위한 요청 - 상기 요청은, 상기 트랜잭션의 상기 하나 이상의 트랜잭션 세그먼트들의 뷰(view)와 연관된 액세스 식별자를 포함함 - 을 수신하는 단계;상기 액세스 식별자와 연관된 상기 하나 이상의 트랜잭션 세그먼트들을 식별하기 위하여 상기 트랜잭션의 상기하나 이상의 트랜잭션 세그먼트들의 뷰로 상기 요청의 상기 액세스 식별자를 평가하는 단계;상기 액세스 식별자와 연관된 상기 하나 이상의 트랜잭션 세그먼트들을 포함하는 상기 트랜잭션의 맞춤형 뷰를생성하는 단계를 포함하는, 방법."}
{"patent_id": "10-2020-7025653", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_31", "content": "프로그램 명령이 저장된 하나 이상의 비일시적 컴퓨터 판독 가능 매체로서,상기 프로그램 명령은, 프로세싱 시스템에 의해 실행될 때, 상기 프로세싱 시스템으로 하여금, 적어도,사용자 장치에서 복수의 사용자가 요청한 블록 엔트리들 - 상기 블록 엔트리들 각각은, 액세스 레벨과 각각 연관된 복수의 데이터 부분들을 포함함 - 의 블록체인을 유지하게 하고;블록 엔트리의 하나 이상의 데이터 부분들을 보기 위한 요청 - 상기 요청은, 적어도 하나의 액세스 레벨과 연관된 액세스 코드를 포함함 - 을 수신하게 하고;상기 액세스 레벨과 연관된 하나 이상의 데이터 부분들을 식별하기 위하여 상기 블록 엔트리들의 블록체인으로상기 요청의 상기 액세스 코드를 평가하게 하고;상기 액세스 레벨과 연관된 상기 하나 이상의 데이터 부분들을 포함하는 상기 블록 엔트리의 맞춤형 뷰를 생성하게 하는,하나 이상의 비일시적 컴퓨터 판독 가능 매체."}
{"patent_id": "10-2020-7025653", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_32", "content": "재무 기록의 맞춤형 뷰를 생성하는 방법으로서,노드의 분산 네트워크의 사용자 장치에서 복수의 사용자가 요청한 뱅킹 엔트리들 - 상기 뱅킹 엔트리들 각각은,액세스 레벨과 각각 연관된 복수의 계좌 번호들 및 계좌 금액들을 포함함 - 의 블록체인을 유지하는 단계;뱅킹 엔트리의 하나 이상의 계좌 번호들 및 계좌 금액들을 보기 위한 요청 - 상기 요청은, 적어도 하나의 액세공개특허 10-2020-0108907-8-스 레벨과 연관된 액세스 코드를 포함함 - 을 수신하는 단계;상기 액세스 레벨과 연관된 하나 이상의 계좌 번호들 및 계좌 금액들을 식별하기 위하여 상기 뱅킹 엔트리들의블록체인으로 상기 요청의 상기 액세스 코드를 평가하는 단계; 및상기 액세스 레벨과 연관된 상기 하나 이상의 계좌 번호들 또는 계좌 금액들을 포함하는 상기 뱅킹 엔트리의 맞춤형 뷰를 생성하는 단계를 포함하는, 방법."}
{"patent_id": "10-2020-7025653", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_33", "content": "의료 기록의 맞춤형 뷰를 생성하는 방법으로서,노드의 분산 네트워크의 사용자 장치에서 복수의 사용자가 요청한 환자 기록들 - 상기 환자 기록들 각각은, 액세스 레벨과 각각 연관된 복수의 의료 진단들 및 치료들을 포함함 - 의 블록체인을 유지하는 단계;환자 기록의 하나 이상의 의료 진단들 및 치료들을 보기 위한 요청 - 상기 요청은, 적어도 하나의 액세스 레벨과 연관된 권한 코드를 포함함 - 을 수신하는 단계;상기 액세스 레벨과 연관된 하나 이상의 의료 진단들 및 치료들을 식별하기 위하여 상기 환자 기록들의 블록체인으로 상기 요청의 상기 권한 코드를 평가하는 단계; 및상기 액세스 레벨과 연관된 상기 하나 이상의 의료 진단들 및 치료들을 포함하는 상기 환자 기록의 맞춤형 뷰를생성하는 단계를 포함하는, 방법."}
{"patent_id": "10-2020-7025653", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_34", "content": "게임 베팅의 맞춤형 뷰를 생성하는 방법으로서,노드의 분산 네트워크의 사용자 장치에서 복수의 사용자가 요청한 게임 베팅들 - 상기 게임 베팅들 각각은, 액세스 레벨과 각각 연관된 복수의 플레이어 기록들, 예측 결과들 및 베팅 금액들을 포함함 - 의 블록체인을 유지하는 단계;게임 베팅의 하나 이상의 플레이어 기록들, 예측 결과들 및 베팅 금액들을 보기 위한 요청 - 상기 요청은, 적어도 하나의 액세스 레벨과 연관된 핀(pin) 코드를 포함함 - 을 수신하는 단계;상기 액세스 레벨과 연관된 하나 이상의 플레이어 기록들, 예측 결과들 및 베팅 금액들을 식별하기 위하여 상기게임 베팅들의 블록체인으로 상기 요청의 상기 핀 코드를 평가하는 단계; 및상기 액세스 레벨과 연관된 상기 하나 이상의 플레이어 기록들, 예측 결과들 및 베팅 금액들을 포함하는 상기게임 베팅의 맞춤형 뷰를 생성하는 단계를 포함하는, 방법."}
{"patent_id": "10-2020-7025653", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_35", "content": "총기 판매(firearm sale)의 맞춤형 뷰를 생성하는 방법으로서,노드의 분산 네트워크의 사용자 장치에서 복수의 사용자가 요청한 총기 판매들 - 상기 총기 판매들 각각은, 액세스 레벨과 각각 연관된 복수의 구매자 이름들, 나이들 및 운전면허 번호들을 포함함 - 의 블록체인을 유지하는 단계;총기 판매의 하나 이상의 구매자 이름들, 나이들 및 운전면허 번호들을 보기 위한 요청 - 상기 요청은, 적어도하나의 액세스 레벨과 연관된 지문을 포함함 - 을 수신하는 단계;상기 액세스 레벨과 연관된 하나 이상의 구매자 이름들, 나이들 및 운전면허 번호들을 식별하기 위하여 상기 총기 판매의 블록체인으로 상기 요청의 상기 지문을 평가하는 단계; 및상기 액세스 레벨과 연관된 상기 하나 이상의 구매자 이름들, 나이들 및 운전면허 번호들을 포함하는 상기 총기판매의 맞춤형 뷰를 생성하는 단계를 포함하는, 공개특허 10-2020-0108907-9-방법."}
{"patent_id": "10-2020-7025653", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_36", "content": "의약 인벤토리 로그들의 맞춤형 뷰를 생성하는 방법으로서,노드의 분산 네트워크의 사용자 장치에서 복수의 사용자가 입력한 의약 인벤토리 로그들 - 상기 의약 인벤토리로그들 각각은, 액세스 레벨과 각각 연관된 복수의 제약 제조업체들, 유통 업체들 및 소매 업체들을 포함함 -의 블록체인을 유지하는 단계;상기 의약 인벤토리 로그의 하나 이상의 제약 제조업체들, 유통 업체들 및 소매 업체들을 보기 위한 요청 - 상기 요청은, 적어도 하나의 액세스 레벨과 연관된 바코드를 포함함 -을 수신하는 단계;상기 액세스 레벨과 연관된 하나 이상의 제약 제조업체들, 유통 업체들 및 소매 업체들을 식별하기 위하여 상기의약 인벤토리 로그의 블록체인으로 상기 요청의 상기 바코드를 평가하는 단계; 및상기 액세스 레벨과 연관된 하나 이상의 제약 제조업체들, 유통업체들 및 소매업체들을 포함하는 상기 의약 인벤토리 로그의 맞춤형 뷰를 생성하는 단계를 포함하는, 방법."}
{"patent_id": "10-2020-7025653", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "블록체인 트랜잭션의 맞춤형 뷰를 생성하기 위한 시스템, 방법 및 소프트웨어가 본 명세서에 개시된다. 사용자 장치에서 복수의 사용자가 요청한 블록 엔트리의 블록체인은 노드의 분산 네트워크에 유지된다. 블록 엔트리는 각각 액세스 레벨과 연관된 복수의 데이터 부분을 포함한다. 적어도 하나의 액세스 레벨과 연관된 액세스 코드 를 포함하는 블록 엔트리의 하나 이상의 데이터 부분을 보기 위한 요청이 수신된다. 요청의 액세스 코드는 액세 스 레벨과 연관된 하나 이상의 데이터 부분을 식별하기 위해 블록 엔트리의 블록체인으로 평가된다. 액세스 레 벨과 연관된 하나 이상의 데이터 부분을 포함하는 블록 엔트리의 맞춤형 뷰가 생성된다."}
{"patent_id": "10-2020-7025653", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "관련 특허 출원 상호 참조 본 출원은 2018년 3월 6일자로 출원된 \"블록체인에 기록된 제한된 트랜잭션의 맞춤형 뷰\"라는 명칭의 미국 가특 허 출원 제62/639,393호 및 2018년 7월 23일자로 출원된 \"블록체인에 기록된 제한된 정보의 맞춤형 뷰\"라는 명 칭의 미국 가특허 출원 제62/701,947호에 대해 우선권을 주장하고, 이들 모두는 모든 목적을 위해 그 전체가 참 조로서 본 명세서에 통합된다. [기술 분야] 본 발명의 양태는 컴퓨팅 하드웨어 및 소프트웨어 기술에 관한 것이며, 특히, 블록체인에 기록된 제한된 트랜잭 션의 맞춤형 뷰를 생성하는 것에 관한 것이다."}
{"patent_id": "10-2020-7025653", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "사용자 네트워크는 블록체인을 통해 데이터의 디지털 원장을 만들고 네트워크의 다른 사용자 사이에서 데이터를 공유할 수 있다. 이전 데이터베이스 구조와 달리, 블록체인 데이터베이스는 대규모 분산 네트워크에 분산된 복 수의 독립 노드에 의해 유지된다. 트랜잭션이 블록체인 데이터베이스에 기록될 때, 데이터가 분산 네트워크의 2개 이상의 노드에 저장되기 때문에, 데이터베이스에서 해당 데이터를 변경하거나 제거하는 것이 불가능한 것은 아니지만 매우 어렵다. 따라서 데이터는 복수의 사용자에 의해 블록체인 데이터베이스에 추가되고, 기록된 데 이터를 변경하기 위해서는 이들 각각의 사용자(또는 대부분의 사용자)가 변경에 동의해야 한다. 블록체인 데이 터베이스에서 데이터를 추가, 편집 및 제거하는 이러한 제어 분배는, 특히, 사용자가 서로 익숙하지 않은 경우 에 네트워크에서의 사용자간에 신뢰를 생성한다. 블록체인 트랜잭션의 맞춤형 뷰를 생성하기 위해 향상된 시스템, 방법 및 소프트웨어 애플리케이션이 본 명세서 에 개시된다. 사용자 장치에서 복수의 사용자가 요청한 블록 엔트리의 블록체인은 노드의 분산 네트워크에 유 지된다. 블록 엔트리는 각각 액세스 레벨과 연관된 복수의 데이터 부분을 포함한다. 적어도 하나의 액세스 레 벨과 연관된 액세스 코드를 포함하는 블록 엔트리의 하나 이상의 데이터 부분을 보기 위한 요청이 수신된다. 요청의 액세스 코드는 액세스 레벨과 연관된 하나 이상의 데이터 부분을 식별하기 위해 블록 엔트리의 블록체인 으로 평가된다. 액세스 레벨과 연관된 하나 이상의 데이터 부분을 포함하는 블록 엔트리의 맞춤형 뷰가 생성된 다. 다양한 실시예는 소유자가 비공개이지만 공인된 기관이나 개인이 보고 감사할 수 있는 공개 원장의 정보를 저장 하고 이에 대한 액세스를 제공하는 기술을 제공한다. 정보를 비공개로 유지하도록 요청하는 전세계적인 개인 정보 보호법이 있다. 다양한 실시예는 데이터가 올바른 형식으로 저장되고 규정된 방식으로만 액세스할 수 있 도록 보장함으로써 이러한 개인 정보 보호법의 준수를 보장할 수 있다. 또 다른 예로, 기업과 정부가 그들의 비공개 정보나 지식 또는 영업 비밀이 알려지는 것을 원하지 않는 경우가 있다. 이들 그룹은 숨길 것이 없지만, 사람, 기업, 정부 등의 운영 방식에 대한 조회 가능성이나 지식을 가진 누군가가 공개 포럼에서 그들의 모든 정보를 가지고 있으면 손실, 도난 및 경쟁 심화가 발생할 수 있다. 예를 들어, 게임 산업에서, 고객의 사회 보장 번호, 생체 인식, 주소, 사진, 운전면허증, 이전 게임 플레이, IRS 세금 고지서, 승패, 보상(comp), 고객 카드/선수 카드 번호 정보, 생년월일, 알려진 동료, 배우자/여자 친 구, 좋아하는 팀, 좋아요/싫어요 활동, 팁 금액, 자산에서의 ATM 사용, 알려진 전자 지갑, 사용된 신용/직불 카 드, 사용된 암호 화폐 지갑 등은 모두 다른 고객 정보와 함께 블록체인에 보관될 수 있다. 고객은 이 정보 중 어떤 것도 공개 형식으로 보기를 원하지 않을 것이며, 공개 액세스로 인해 카지노에 대한 법적 책임이 발생할 수 있다. 다양한 실시예는 다양한 암호화 및 해싱 기술을 사용하여 데이터를 블록체인에 안전하게 저장하고 공 인된 사용자만 데이터를 볼 수 있도록 한다. 예를 들어, 고객은 토너먼트에 참가할 수 있고, 그의 이름이나 플 레이어 번호는 공개 포럼에서 그를 식별하는 데 사용될 수 있지만, 다른 비공개 정보는 사용자, 적절한 카지노 직원, 감사관(auditor), 규제 기관 등을 포함하는, 올바른 액세스 권한이 있는 사용자 이외의 다른 사람이 볼 수는 없다. 물류는 기술의 또 다른 직접적인 적용을 제공한다. 예를 들어, 패키지나 화물의 추적, 한 장소에서 다른 장소 로의 상품 이동(movement of commodities)이 중요하다. 화물이 어디서 왔는지 그리고 어디로 가는지 운송되는 것에 모든 정보가 포함될 수 있다. 다양한 지점에서, 화물을 스캔하여 특정 시간에서의 화물의 정확한 위치를 알 수 있다. 이것은 블록체인 기록에 입력될 수 있다. 또한, 화물이 특정 선박, 트럭, 밴 또는 기타 배송 메 커니즘(예컨대, 배송 드론)과 연관될 수 있고, 해당 배송 메커니즘의 GPS 위치는 실시간으로, 요청시 또는 특정 시간 간격으로 추적될 수 있다. 구매자, 판매자, 소유자 보험 정보 등과 같은 추가 정보는 물론 블록체인에 기 록된 GPS와 연계된 체제비(demurrage)도 보고될 수 있다. 기업 및/또는 정부는 모든 사람이 다양한 이유로 그 들의 비즈니스를 알기를 원하지 않지만, 검사관, 통제관 또는 규제 기관에는 특정 시간/장소에서 그들이 무엇을 하고 있었는지 감사하고 증명할 수 있는 능력이 필요하다. 사물을 비공개로 유지하는 능력은 필수이다. 이와 같이 다양한 실시예는 정보를 저장하기 위해 비공개, 공개 및 하이브리드 블록체인의 조합을 사용할 수 있다. 또한 다양한 암호화 체계와 액세스 레벨은 데이터의 개별적인 부분과 연관되어 필요할 때 액세스를 허용하는 반 면 필요하거나 원하는 경우에는 프라이버시를 보장할 수 있다. 일부 실시예에서, 이 기술은 방위 산업에 특정 애플리케이션을 제공할 수 있다. 예를 들어, 미국 정부는 구매, 물류, 공급, 병력 이동 등을 감사하고 통제할 수 있는 능력이 필요하다. 이 정보가 적에게 넘어 가면 치명적인 결과를 초래할 수 있다. 정보를 비공개로 유지하기 위해 정보의 특정 양태를 난독화하는 것은 임무의 성공에 필수적이다. 데이터를 분류하고 액세스를 허용하는 능력은 필요한 사람만 데이터에 액세스할 수 있는 능력(예 컨대, 보기, 모니터링, 작업 또는 감사 등)을 갖도록 하는 동시에 권한이 없는 사람은 데이터 부분을 볼 수 없 도록 하는 데 필수적이다. 일부 실시예에서, 시스템은 질의와 관련된 문서를 자동으로 검토하고, 사용자의 허 가 상태에 기초하여 하나 이상의 교정 필터를 자동으로 적용할 수 있다. 일부 실시예는 데이터 플랫폼이 전자 투표 기계에 연결되게 한다. 이들 기계는 투표자, 투표 용지에 대한 정보 를 직접 보고하고, 블록체인에 저장하기 위해 데이터 플랫폼에 투표할 수 있다. 데이터 플랫폼은 투표 기록을 암호화하고 투표 기록에 액세스하기 위한 액세스 레벨을 설정할 수 있다. 예를 들어, 투표 기계는 개인 정보, 사회 보장 번호, 주소, 정당, 생체 인식, 운전면허 번호, 사진 등을 수집할 수 있다. 따라서 선거에 사용되는 이 정보의 대부분을 대중으로부터 비공개로 유지해야 하며 일부 정보(예컨대, 특정 선거에서 투표한 사람, 그들 의 소속 정당 등)는 공개될 수 있다. 더욱이, 일부 실시예는 유권자 사기 행위를 식별 및/또는 제거하기 위한 자동화 기술의 사용을 제공한다. 예를 들어, 일부 실시예는 인공 지능 엔진이나 기계 학습 엔진을 사용하여 블 록체인에 저장된 투표자 데이터를 검토하고 중복 투표자, 불법 투표자 등을 식별할 수 있다. 또한, 위에 제공된 예에서, 이 기술은 은행 업무, 배심원 투표, 법원 절차, 헬스케어, 총기 판매, 소매 판매, 제약, 연금, 재무 트랜잭션, 보험 및 감사와 데이터의 공개 보기와 데이터의 비공개 보기 등이 필요한 많은 다 른 응용 프로그램에 사용될 수 있다. 본 기술의 일부 실시예는 하이브리드 포맷 하에서 선택적 마커를 사용할 수 있다. 예를 들어, 일부 실시예에서, 시스템은 사물을 비공개(액세스 권한이 없는 사람은 볼 수 없음), 공개(모든 사람이 볼 수 있음)또는 이 둘의 하이브리드(일부 정보는 공개이고 일부 정보는 비공개)로 설정하는 기능을 가질 수 있다. 공개 블록체인이 사용되어야 하고 모든 사람이 볼 수 있도록 완전히 투명해질 수 있는 상황이 있다. 또한 개인 정보 보호법을 준수하기 위해 일부 정보의 일부 프라이버시가 요청되거나 단지 사람들이 자신이 하이브리드 포맷이 될 어떤 일을 하는 데 책임이 있는 사람이나 조직이라는 것을 다른 사람이 알기를 원하지 않는다는 사실만을 예 고하는 경우도 있다. 특정 정보를 난독화하거나 비공개로 유지하는 기능은 위의 산업에 필수적이다. 비공개나 하이브리드 포맷을 사용하는 다양한 실시예에 따르면, 데이터를 보호하기 위한 적어도 두 가지의 옵션 이 있다. 예를 들어, 일부 실시예에서, 잠금 해제에 암호화를 적용함으로써 정보의 완전한 난독화가 이루어질 수 있다. 일부 실시예는 데이터의 일부가 제한되고 다양한 개인이 액세스할 수 있도록 다중 계층 암호화를 사 용할 수 있다. 하이브리드 작동 모드에서, 일부 정보는 공개되거나 투명하게 보일 수 있지만, 다른 정보는 난 독화되거나 비공개로 유지될 것이다. 몇몇 경우에, 데이터 액세스 레벨을 지정하기 위해 마커가 사용될 수 있 다. 마커는 감사관, 선거 공무원, 통제관 등에게 사용자가 누구인지를 보여주는 무언가일 수 있으며 시민 1 또 는 고객 200과 같은 숫자일 수 있다. 일부 실시예에서는 코덱을 사용할 수 있는데, 코덱은 사용자가 누구인지 아무도 알 수 없도록 사용자의 신원을 스크램블링하여 신원을 비공개로 유지하는 시스템에 의해 제어될 수 있다. 블록체인의 감사 또는 관리를 담당하는 사람만이 책임 당사자가 누구인지 파악할 수 있다. 일부 실시예 에서 코덱은 감사 및 설명이 필요하지 않는 한 이 정보를 제공하지 않는다. 일부 실시예에서, 감사 기능을 사용자 인터페이스에 통합하여 (예컨대, 가상 버튼 클릭 시) 사용자에게 모든 정 보 또는 일부 정보(예컨대, 컬럼, 포맷, 섹션 등)를 비공개, 공개 및 제한된 액세스로 허용하는 기능을 제공할 수 있다. 일부 실시예는 사용자가 비공개로 유지되는 것을 두 번 또는 세 번 확인할 수 있는 실시간 모니터링/ 감사 기능을 제공한다. 일부 실시예에서, 패스워드, 2자 인증자(two-party authenticator)나 3자 인증자 (three-party authenticator)를 포함하는 패스워드, 다중 서명 등은 사용자가 블록체인에 들어가는 정보를 제출, 추가 또는 첨부할 수 있도록 하는 블록체인에 의해 구동되는 분산형 애플리케이션(DApp: decentralized application)의 일부일 수 있다. 일부 실시예에서, 이 정보는 분산 방식으로 설정될 수 있으므로 정보가 자동 으로 삽입되고 테스트되고 실시간으로 분산 네트워크에서 모니터링되어 허용되지 않는 당사자가 정보를 유출하 거나 해킹하거나 볼 수 없다."}
{"patent_id": "10-2020-7025653", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "본 요약은 이하의 상세한 설명에서 더 자세히 설명되는 개념을 단순한 형태로 소개하기 위해 제공된다. 본 요 약은 청구된 주제의 주요 특징 또는 필수 기능을 확인하기 위한 것이 아니고, 청구된 주제의 범주를 제한하는 데 사용하도록 의도된 것도 아니다. 예들의 추가적인 양태, 특징 및/또는 이점은 다음의 설명에서 부분적으로 설명될 것이고, 부분적으로 설명으로부터 명백해질 것이고, 또는 본 발명의 실행에 의해 학습될 수 있다."}
{"patent_id": "10-2020-7025653", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "블록체인은 데이터의 블록체인을 생성하고 분산 네트워크에서 사용자간에 데이터를 공유하는 것이 일반화되었다. 이전 데이터베이스 구조와 달리, 블록체인 데이터베이스는 대규모 노드의 분산 네트워크에 분산 된 복수의 독립 노드에 의해 유지된다. 공개 블록체인은 모든 사용자가 블록체인 블록에 데이터(여기서는 트랜 잭션 또는 블록 엔트리라고도 함)를 입력하고 기록할 수 있는 디지털 원장이다. 트랜잭션이 블록체인 데이터베 이스에 기록될 때, 데이터가 분산 네트워크의 2개 이상의 노드에 저장되기 때문에, 데이터베이스에서 트랜잭션 데이터를 변경하거나 제거하는 것이 불가능한 것은 아니지만 매우 어렵다. 따라서 복수의 사용자가 데이터를 블록체인 데이터베이스에 추가하고 데이터를 추가, 편집 또는 제거하는 것에 의해 기록된 데이터를 변경하는 것 은 대부분의 사용자나 주통제관이 변경 사항을 감독하고 공동 서명자(cosigner)(예컨대, 관리자와 직원, 감사관 과 책임자 등)가 변경 사항에 동의해야 한다. 또한 각 블록에는 데이터, 현재 블록의 해시 및 이전 블록의 해시가 포함된다. 블록체인은 또한 트랜잭션을 시 작하는 사용자 이름, 트랜잭션과 관련된 당사자의 다른 사용자 이름, 타임 스탬프, 실행 가능 코드 등 트랜잭션 과 관련된 다른 정보와 같은 트랜잭션에 대한 추가 상세 정보를 블록에 저장할 수 있다. 해시는 블록과 블록 내에 저장된 트랜잭션 데이터를 식별한다. 해시는 다른 모든 해시에서 고유하고 블록이 변경될 때마다 변경된 다. 각 블록에는 이전 블록의 해시가 포함되어 있으므로, 블록은 블록체인으로 알려진 것을 형성한다. 블록을 임의로 변조하면 해당 블록의 해시도 변경된다. 따라서 블록체인의 다른 모든 블록은 더 이상 이전 블록의 유 효한 해시를 포함하지 않기 때문에 무효로 될 것이다. 블록체인에서 각 후속 블록의 해시를 변경하는 것이 가능할 수 있지만, 사설 및 공용 네트워크 모두에서 분산 네트워크의 각 노드에 저장된 각 블록체인을 변경하는 것은 거의 불가능할 것이다. 블록체인을 형성하기 위해 이전 해시를 저장하고 블록체인의 전체 사본을 분산 네트워크(비공개, 허가 및 공용)의 각 노드에 배포하는 이 조합은, 특히, 사용자가 서로 익숙하지 않은 경우(예컨대, 공용 네트워크), 사용자와 네트워크의 저장된 트랜잭 션 사이에서 신뢰 시스템을 생성한다. 본 발명의 예는 블록체인 트랜잭션의 맞춤형 뷰를 생성하기 위한 시스템, 처리 및 애플리케이션을 설명한다. 사용자 장치에서 복수의 사용자가 요청한 블록 엔트리의 블록체인은 노드의 분산 네트워크에 유지된다. 블록 엔트리는 각각 액세스 레벨과 연관된 복수의 데이터 부분을 포함한다. 적어도 하나의 액세스 레벨과 연관된 액 세스 코드(예컨대, 해시, 비공개키, 생체 인식, 패스워드, PIN 등)를 포함하는 블록 엔트리의 하나 이상의 데이 터 부분을 보기 위한 요청이 수신된다. 요청의 액세스 코드는 액세스 레벨과 연관된 하나 이상의 데이터 부분 을 식별하기 위해 블록 엔트리의 블록체인으로 평가된다. 액세스 레벨과 연관된 하나 이상의 데이터 부분을 포함하는 블록 엔트리의 맞춤형 뷰가 생성된다. 일부 실시예에서, 블록체인에 저장된 데이터의 일부는 개별적으 로 암호화될 수 있다. 이와 같이, 액세스 코드와 연관된 액세스 레벨에 따라, 데이터의 일부만의 암호 해독이 승인되거나 사용할 수 있는 반면 다른 부분은 보안이 유지될 수 있다. 본 논의에서 인식할 수 있는 기술적 효과는 사용자가 액세스 권한이 있는 입력 데이터(예컨대, 은행 기관의 재 무 기록, 고객/공급 업체 추적 인벤토리, 게임 규제 위원회의 준수 데이터, 정부 또는 준 정부 기관의 분류된 문서, 의료 기관의 건강 기록, PCII(Protected Critical Infrastructure Information), 정부 감사관/조사관에 게 필요한 데이터 등)를 식별하고 블록체인 트랜잭션에 기록된 데이터에 대한 맞춤형 뷰를 제공하는 데 있어 효 율성이 증가한다는 것이다. 본 명세서에 설명된 일부 실시예는 또한 사용자가 블록체인 항목으로부터 데이터의 일부에 액세스할 권한이 있는 경우에만 사용자에 대한 액세스를 허용함으로써 보안을 향상시킨다. 또한, 일부 실시예는 언제, 누가 다양한 데이터에 액세스했는지를 나타내는 불변 로그를 제공할 수 있다. 또한, 일부 실시 예에서, (예컨대, 인공 지능 엔진이나 기계 학습 엔진에 의한) 자동 검토를 행하여 특정 이벤트(예컨대, 내부자 거래, 자금 세탁, 부정 행위, 유권자 사기 등)를 탐지할 수 있다. 보다 구체적으로, 하나의 구현예는 사용자의 민감한 정보(예컨대, 자금 세탁(AML: Anti-Money Laundering) 또는 고객 파악(KYC: Know Your Customer) 정책 문서, (ADD) 계정 번호, 계좌 잔액, 계좌 명세서)를 제한하는 뱅킹 트랜잭션의 맞춤형 뷰를 생성하는 비일상적인 프로세스를 제공할 수 있지만, 외부 은행 기관이나 사용자가 트랜 잭션에 사용할 수 있는 자금이 계좌에 있는지 확인할 수 있게 한다. 또 다른 시나리오는 블록체인에서의 트랜 잭션을 감사하는 비일상적인 프로세스를 제공하는 동시에 감사관이 트랜잭션의 전체 버전을 볼 수 없게 한다. 예를 들어, 국세청(IRS: Internal Revenue Service)은 이전 과세 연도 내에 수행된 모든 통화 트랜잭션에 대한 감사를 요청할 수 있다. 그러나 감사를 받는 회사는 각 트랜잭션에 대해 전체 고객 성명과 주소 목록을 제공할 필요가 없다. 트랜잭션의 맞춤형 뷰를 제공함으로써, IRS는 트랜잭션 금액의 정확성을 확신할 수 있으며, 회사 는 고객의 익명성을 유지할 수 있다. 본 논의의 추가적인 기술 효과는 게임 규제 산업에서 인정될 수 있다. 예를 들어, 본 명세서에 설명된 하나의 구현예는 베팅액을 숨기면서 게임 베팅의 결과를 보는 비일상적인 프로세스를 제공한다. 이는 플레이어가 자신 의 머니 팟(money pot)에 대한 프라이버시를 유지할 수 있게 하면서, 게임 커뮤니티에서 우위 플레이어(예컨대, 카드 카운터 등)를 모니터링할 때 유용할 수 있다. 또 다른 예에서, 게임 위원회는 각 플레이어에 대한 일부 개인 정보를 보기 위해 트랜잭션의 맞춤형 뷰를 요청할 수 있지만(예컨대, 각 플레이어가 갬블링에 합법적인 나 이인지를 확인, 각 플레이어가 블랙리스트에 등재되어 있는지를 확인, 플레이어 핸들/닉네임), 다른 개인 정보 (예컨대, 게임 구매에 사용된 신용 카드 번호, 각 플레이어의 법적 성명 등)는 볼 수 없게 할 수 있다. 또 다른 예로는 네바다 게임 위원회(Nevada Gaming Commission)가 게임 시설에 대한 면허를 원하는 신청자로부 터 이전 비즈니스 관계, 고용 기록, 범죄 기록 및 재정적 안정성에 대한 공개 문서를 요청할 수 있다. 그러나 신청자는 범죄 행위에 대한 말소 기록을 제공할 필요가 없다. 따라서 문서의 뷰는 네바다 게임 위원회가 요청 하는 문서 부분만 표시하고 관련성이 없거나 라이선스를 찾는 데 필요하지 않은 데이터를 생략, 수정 또는 난독 화하도록 맞춤화될 수 있다. 일부 실시예에서, 시스템은 개인 정보를 수집하고 기본적인 기밀 정보를 공개하지 않고 의사 결정에 사용할 수 있는 공개 점수, 등급 또는 기타 지표를 생성할 수 있다. 일부 실시예에서, 시스템은 수집된 추가 정보에 대한 추가 공개 및 비공개 데이터 소스에 연결할 수 있다. 예를 들어, 공개 정보는 FBI 보고서, 신용 보고서, 배경 보고서 등일 수 있다. 이 추가 정보는 개인의 기록이나 프로필의 일부로 블록체인에 저장될 수 있다. 이것은 검증의 제 2 요소로서 사회 보장 번호, 운전면허증, 얼굴 인식 또는 지문으로 이루어질 수 있다. 따라서 한 사 람이 카지노에 들어가서 게임을 하기 위해 카드를 등록하면, 그 사람이 실제로 누구인지에 대한 빅 데이터가 수 집될 수 있고, 자신이라고 말하는 그 사람이 합법적이고, 재산 상 허용되거나 게임이 가능한지 확인하기 위해 카지노, 감사관 및 규제자에게만 정보가 제공될 수 있다. 또 다른 실시예에서, 패키지 배송 및 인벤토리 운송을 추적하는 비일상적인 프로세스에 대한 기술적 효과가 인 식될 수 있다. 예를 들어, 하나 이상의 패키지를 출발지에서 스캐닝한 다음, 하나의 화물 유닛에서 패키지가 운송되기 시작하면 다시 한 번 스캐닝할 수 있다. 운송 회사는 패키지 중 하나의 수취인이 자신의 상자와 연관 된 데이터를 볼 수 있도록 하지만 수취인이 화물 유닛의 다른 패키지와 연관된 트랜잭션에 저장된 다른 모든 데 이터를 볼 수는 없게 할 수 있다. 따라서 자신의 패키지의 위치, 출발 시각 및 예상 도착 시각을 설명하는 수 신자의 트랜잭션에 대한 맞춤형 뷰만이 활성화된다. 제품과 연관된 추가 정보는 또한 제조자, 판매자, 체크 포 인트 위치, 체크 포인트 직원, 품질 관리 매니저, 테스트 센터 및 배송 프로세스를 통한 보관 체인과 같은 제품물류뿐만 아니라 운송 중에 화물 유닛에 액세스한 개인에 대한 세부 정보를 블록체인에 수집 및 저장할 수 있다. 언제든지 또는 수신 시, 수신 당사자는 수신자의 상태에 따라 이 정보의 일부를 볼 수 있게 할 수 있지 만, 모든 정보를 볼 수는 없다. 예를 들어, 갬블링 시설이나 규제 기관은, 신뢰할 수 있는 주사위 제조업체로 부터 전달되는 동안, 주사위가 변형되지 않았는지 확인하기 위해 관리 체인과 함께 제조된 주사위에 대한 선택 적인 제품 정보를 볼 수 있다. 이 데이터는 맞춤형 뷰로 표시될 수 있다. 또한, 본 명세서의 예에서는 블록 엔트리의 블록체인을 사용한 요청의 액세스 코드가 액세스 레벨과 연관된 하 나 이상의 데이터 부분을 보기 위해 액세스를 검증하는 암호화 코드를 처리함으로써 평가될 수 있다고 설명한다. 다른 예에서, 포인터는 또한 블록 엔트리 내의 복수의 데이터 부분의 각각에 대해 적어도 하나의 공 개된 위치를 나타내는 블록 엔트리 내의 복수의 데이터 부분의 각각에 대해 유지된다. 또한 본 예에서, 맞춤형 뷰는 블록 엔트리 내의 복수의 데이터 부분 각각에 대한 포인터를 사용하여 액세스 레벨과 연관된 하나 이상의 데이터 부분을 검색함으로써 생성된다. 데이터 일부에 액세스하려면, 핀 코드, 패스워드, 지문, 바코드, 망막 스캔, 토큰, 질문지(questionnaire) 또는 2 요소, 다중 요소 또는 추가 보안 인증자를 포함하는 임의의 다른 유 형의 액세스 결정 방법을 사용해야 한다. 추가 예에서, 사용자 장치로부터 복수의 사용자에 의해 요청된 블록 엔트리의 블록체인은 각각의 액세스 레벨과 연관된 하나 이상의 데이터 부분에 대한 별도의 블록 엔트리를 유지함으로써 유지된다. 또한 이 시나리오에서, 요청의 액세스 코드는 각 액세스 레벨과 연관된 더 많은 데이터 부분에 대한 하나 이상의 블록 엔트리를 보기 위해 검증된다. 일부 구현예에서, 사용자 장치로부터 복수의 사용자에 의해 요청된 블록 엔트리의 블록체인은 각각의 액세스 레벨과 연관된 하나 이상의 데이터 부분에 대해 별도의 블록체인을 유지함으로써 유지된다. 또 한 이 구현예에서, 요청의 액세스 코드는 각각의 액세스 레벨과 연관된 더 많은 데이터 부분에 대한 하나 이상 의 블록 엔트리를 보기 위해 검증된다. 일부 예에서, 블록 엔트리의 하나 이상의 데이터 부분을 보기 위해 수신 요청은 인벤토리 추적 요청을 포함한다. 다른 예에서, 블록 엔트리의 하나 이상의 데이터 부분을 보기 위해 수신 요청은 재무 감사 요청을 포함한다. 일부 시나리오에서, 블록 엔트리의 하나 이상의 데이터 부분을 보기 위해 수신 요청은 게임 규제 요 청을 포함한다. 다른 시나리오에서, 블록 엔트리의 하나 이상의 데이터 부분과 연관된 액세스 레벨은 비공개 액세스 레벨, 허가 액세스 레벨 및 공개 액세스 레벨 중 적어도 하나를 포함한다. 그러나, 추가 예에서, 블록 엔트리와 연관된 액세스 레벨은 비공개 액세스 레벨, 허가 액세스 레벨 및 공개 액세스 레벨 중 적어도 하나를 포함한다. 본 발명은 다양한 실시예를 설명하지만, 추가적인 산업에서의 기술적 개선을 위해 추가적인 예가 포함될 수 있 다는 것을 이해해야 한다. 산업의 예로는 방위 및 보안, 금융 및 보험, 소매(예컨대, 총기), 판매 및 라이센싱, 의료 기록, 회계, 운송 및 물류, 약물 및 제약, 대마초, 석유 및 가스, 에너지 및 상품, 국가 안보 등이 포함될 수 있다. 도면을 참조하면, 도 1은 본 발명의 양태가 실행될 수 있는 예시적인 향상 시스템의 관리를 위한 처리 동작에 관한 예시적인 동작 아키텍처를 도시한다. 운영 환경은 블록체인 네트워크를 포함한다. 블록 체인 네트워크는 사용자의 승인된 액세스 레벨에 기초하여 블록체인 항목에서 데이터의 일부를 볼 수 있도 록 사용자를 인증하는 맥락에서 뷰 맞춤화 프로세스를 사용한다. 블록체인 네트워크는 뷰 맞춤화 프 로세스를 수행하기에 적합한 지원 아키텍처의 다양한 하드웨어와 소프트웨어 요소를 포함할 수 있다. 그 러한 대표적인 아키텍처 중 하나가 제어기와 관련하여 도 16에 도시되어 있다. 서버 노드(110~112)는 블록체인 애플리케이션을 실행할 수 있는 하나 이상의 서버 및 장치를 포함한다. 서버 노드(110~112)와 상호 작용하는 사용자 장치는 개인용 컴퓨터, 휴대폰, 휴대용 장치, 태블릿 컴퓨터, 데스크톱 컴퓨터, 랩톱 컴퓨터, 웨어러블 컴퓨팅 장치, 투표 기계, 게임기, 전자 금융 거래소, 보안 시스템 또는 컴퓨터 의 조합이나 그들의 변형을 포함하는 임의의 다른 폼 팩터를 포함하지만, 이것으로 제한되는 것은 아니다. 보다 구체적으로, 도 2는, 여기에 설명된 바와 같이, 블록체인에 기록된 제한된 트랜잭션에 대한 맞춤형 뷰를 생성하기 위해, 언급된 바와 같이, 블록체인 네트워크에 의해 사용될 수 있는 뷰 맞춤화 프로세스를 도시한다. 뷰 맞춤화 프로세스의 일부 또는 모든 단계는 맞춤형 뷰 특징을 수행하기 위해 사용되는 애플 리케이션의 구성 요소(들)의 맥락에서 프로그램 명령으로 구현될 수 있다. 프로그램 명령은 도 1의 맥락에서 도 2의 단계를 부언하여 블록체인 네트워크가 다음과 같이 작동하도록 지시한다. 동작 중에, 블록체인 네트워크는 사용자 장치로부터 복수의 사용자에 의해 요청된 블록 엔트리의 블록체인 을 유지하고, 여기서, 블록 엔트리의 각각은 액세스 레벨과 각기 연관된 복수의 부분을 포함한다(단계 201). 블록체인 데이터베이스는 서버 노드(110~112)의 블록체인 네트워크에 분산된 복수의 독립적인 사용 자에 의해 유지된다. 블록체인은 블록체인의 블록에 데이터를 입력 및 기록하기 위해 임의의 사용자 (예컨대, 공개 블록체인), 특정 사용자 집합(예컨대, 사설 블록체인), 또는 개인과 공용 사용자의 조합(예컨대, 하이브리드 블록체인)에 개방된 디지털 원장이다. 블록체인은 다중 사용자에 의해 추가되고 분산 네트워 크의 다중 노드(110~112)에 의해 기록될 수 있다. 블록은 블록 엔트리(140~142)를 포함한다. 블록 엔트리(140~142)는 게임 베팅, 인벤토리 기록, 의료 기록, 은행 및 재무 기록, 스마트 계약 및 그 밖의 다른 유형의 조합 또는 변형을 포함하는 다양한 유형의 데이 터를 포함할 수 있다. 예를 들어, 사용자는 다른 사용자와 계약을 체결한 다음 분산 네트워크 환경의 노드 (110~112)의 블록체인에 블록 엔트리로서 계약을 저장함으로써 블록 엔트리를 생성할 수 있다. 다른 예로서, 전자 장치(예컨대, 전자 투표 기계, 갬블링 기계, 하나 이상의 서버에서 실행되는 감사 소프트웨 어, 최종 사용자 장치 등)는 자동으로 블록체인 네트워크에 연결될 수 있고 요청 데이터가 블록 엔트리에 추가 될 수 있다. 데이터 부분이 포함된 새로운 블록 엔트리를 추가하기 위해, 블록체인은 지분 증명(PoS: Proof of Stake), 작업 증명(PoW: Proof of Work), 위임 지분 증명(DPoS: Delegated Proof of Stake) 등과 같은 합의 프로토콜을 사용 할 수 있다. 예를 들어, PoW에서, 서버 노드(110~112)가 블록체인에 추가될 다음 블록 엔트리을 선택하는 리더로 선출되기 위해서는 특정 서버 노드가 특정 퍼즐이나 수학적 문제에 대한 솔루션(일반적으로 무차별 대입)을 찾아야 한다. 솔루션을 찾으면, 서버 노드는 유효성 확인을 위해 솔루션을 다른 노드에 게시한다. 노 드의 합의가 솔루션이 정확하다는 데 동의하면, 새로운 블록 엔트리를 블록체인에 추가할 수 있다. 작업 증명 의 예로는 SHA-256, Blake-256, CryptoNight, Quark, SHA-256, SHA-3, 4crypt, scrypt-jane, HEFTY1이나 다른 것 또는 이들의 조합을 들 수 있다. 반대로, PoS는 서버 노드의 참여와 리스크의 가치(예컨대, 지분)를 기반으 로 한다. DPoS는 블록체인에 항목을 추가할지 여부에 대해 투표하는 네트워크의 검증자 수를 대표자 집합(예컨 대, 투표자)으로 제한하여 높은 수준의 확장성을 제공하는 PoS의 효율적인 변형이다. 블록 엔트리(140~142)의 각각은 또한 데이터 부분(150~155)을 포함한다. 데이터 부분(150~155)은 각각의 블록 엔트리(140~142)를 구성하고, 사용자 요청이나 트랜잭션 포맷(표준형과 맞춤형)에 기초하여 세그먼트로 분할될 수 있는 구성 요소를 포함한다. 예를 들어, 사용자가 데이터의 일부를 기밀로 플래그하면 트랜잭션에서 데이터 의 일부가 비공개로 할당될 수 있다. 데이터가 이전에 비공개로 할당된 카테고리에 속하는 경우, 데이터의 일 부를 비공개로 할당할 수도 있다. 예를 들어, 사용자는 모든 신용 카드 번호를 비공개로 분류할 수 있다. 반 대로, 데이터의 일부는 사용자가 공개나 허가로 할당할 수도 있다. 일부 구현예에서, 데이터의 일부는 발신자 나 제어하는 사용자가 권한을 제공하는 경우에만 수신 사용자가 액세스할 수 있는 것으로 지정될 수 있다(예컨 대, 트랜잭션의 발신자가 블록 엔트리와 모든 데이터 부분을 비공개로 할당하고 데이터의 일부를 보는 기능은 서명 약관 양식(signature terms and condition form)을 통한 동의가 필요함). 이 사용자 동의 기능은 사용자 가 사용자 동의 섹션을 통해 동의를 제공하게 하는 액세스 플랫폼에 포함될 수 있다. 본 기술의 일부 실시예는 블록체인에 데이터를 추가하기 위한 기존 프로토콜 및 워크플로우를 수정한다. 예를 들어, 일부 실시예에서, 서버 노드(110~112)는 데이터의 일부를 식별하거나 하나 이상의 카테고리로 분류하는 데 필요하다. 예를 들어, 인공 지능이나 기계 학습을 사용하여 데이터를 하나 이상의 카테고리(예컨대, 전자 메일 주소, 사회 보장 번호 등)로 분류할 수 있다. 일부 실시예에서, 분산 애플리케이션(DApp)은 데이터의 초 기 정렬 및 범주화(categorization)를 담당할 수 있다. 블록 엔트리(140~142)가 추가되면, 일반적으로 이전 블 록의 해시와 타임 스탬프를 포함하는 엔트리의 시초선(initial line)은 엔트리 내의 데이터 카테고리에 대한 정 보, 각 데이터 부분에 대한 액세스 레벨, 액세스 제한 등을 포함하도록 수정될 수 있다. 예를 들어, 일부 실시 예는 블록 엔트리 내에 저장된 인덱스 및/또는 액세스 레벨 정보를 생성할 수 있다. 이와 같이, 나중에 데이터 를 검색할 때, 데이터를 쉽게 식별하거나 적절한 액세스 레벨과 연관시킬 수 있다. 여전히, 일부 실시예에서, 데이터 추가를 담당하는 서버 노드는 데이터를 구성하고, 상이한 데이터 부분(150~155)에 대해 상이한 암호화 레벨을 설정할 수 있다. 다른 실시예에서, 블록체인에서 암호화된 데이터 저장소를 복호화하고, 정보를 분류하 고, 액세스 레벨 허가를 적용함으로써 맞춤형 뷰를 생성하기 위해 (예컨대, 블록체인 네트워크와 연결 장치 사 이에 있는 데이터 플랫폼에서) 미들웨어(middleware)를 사용할 수 있다. 일부 시나리오에서, 사용자는 트랜잭션의 모든 데이터를 공개로 할당하고, 데이터의 개별 세그먼트를 비공개로 선택적으로 할당하는 기본 설정을 설정할 수 있으며, 그 반대의 경우도 마찬가지이다. 마찬가지로, 일반 대중 이 데이터를 사용할 수는 없지만 감사위원회 위원, 법 집행관, 정부 규제 담당자, 의료진 등과 같은 다양한 그룹의 사용자가 액세스할 수 있는 경우, 데이터의 일부가 허가된 것으로 할당될 수 있다. 다른 예에서, 블록체 인은 데이터의 일부를 비공개, 허가 또는 공개로 할당하기 위한 기본 규칙을 포함할 수 있다. 예를 들어, 블록체인은 임의의 사회 보장 번호가 자동으로 비공개 액세스에 설정되어야 하는 것으로 결정 할 수 있다. 본 명세서에 포함된 몇몇 예와 실시예가 비공개, 허가 또는 공개로 분류될 주요 액세스 레벨을 설 명하지만, 본 발명의 범주 내에서 임의의 수의 액세스 레벨 카테고리가 인식될 수 있음을 이해해야 한다. 또한, 액세스 레벨의 상태는 특정 이벤트의 검출에 기초하여 자동으로 변경되거나 업데이트될 수 있다. 예를 들어, 거래(deal)에 관한 모든 데이터는 시스템이 관련 데이터의 일부 또는 전체에 대해 액세스 레벨을 공개로 변경할 수 있는 기간 동안 비공개로 유지될 수 있다. 다음 동작에서, 블록체인 네트워크는 적어도 하나의 액세스 레벨과 연관된 액세스 코드를 포함하는, 사용 자로부터 블록 엔트리의 하나 이상의 데이터 부분(150~155)을 보기 위한 요청을 수신한다(단계 202). 이 보기 요청은 게임 베팅의 한 참가자와 같이, 블록 엔트리에 저장된 트랜잭션의 당사자인 사용자에 의해 시 작될 수 있다. 사용자는 소득 데이터를 확인하는 세무 감사관, 양도 대리인 또는 제 3 자 재무 관리인 보유 주 식 및 채권, 채권자를 대신하여 채무 상환금을 회수하는 서비스 제공자 또는 최근 회사 배당 트랜잭션을 보는 주주와 같이 트랜잭션에 관심이 있지만 트랜잭션에 직접 관여하지 않는 사용자일 수도 있다. 다음 동작에서, 액세스 코드는 액세스 레벨과 연관된 하나 이상의 데이터 부분을 식별하기 위해 블록 엔트리의 블록체인으로 평가된다(단계 203). 액세스 코드는 공무원, 택배 직원, 은행 관리자 등과 같이, 사용자 상태에 기초하여 사용자에게 지정될 수 있다. 액세스 코드는 액세스 레벨이나 데이터 부분과 연관된 사용자에게 제공 된 암호화 코드(예컨대, 개인 키나 해시)에 기초하여 결정될 수 있다. 액세스 코드는 패스워드, 서명, 지문, 바코드, 프로세싱 칩, 질문지, 생체 인식, 토큰 및 사용자가 액세스 레벨과 연관된 데이터 부분(150~155)에 액 세스하는 권한을 확인할 수 있는 기타 방법에 기초하여 추가 검증될 수 있다. 일부 예시적인 시나리오에서, 데 이터 부분(150~155)은 그들의 연관된 액세스 레벨에 기초하여 상이한 블록체인이나 블록 엔트리로 분리될 수 있 다. 이 시나리오에서, 액세스 레벨과 연관된 데이터 부분을 보기 위해 블록체인이나 블록 엔트리에 액세스하도 록 액세스 코드가 필요할 수 있다. 최종 동작에서, 액세스 레벨과 연관된 하나 이상의 데이터 부분(150~155)을 포함하는 블록 엔트리의 맞춤형 뷰 가 생성된다(단계 204). 맞춤형 뷰는 데이터 액세스 플랫폼에 의해 생성될 수 있다. 맞춤형 뷰는 검증된 액세 스 레벨과 연관된 데이터 부분만을 통합하도록 수정될 수 있거나, 허가되지 않은 데이터 부분이 기록 뷰에서 블 랙 아웃된 모든 데이터 부분(150~155)을 포함할 수 있다. 맞춤형 뷰는 사용자 장치의 블록체인 애플리케이션 (예컨대, DApp)에서 표면화되거나, 기록 메시지의 형태로 사용자에게 전송되거나, 사용자 또는 사용자 그룹에 임의의 다른 방식으로 표시될 수 있다. 다양한 실시예에 따르면, 블록체인에 데이터의 추가, 보안 수준 스크리닝, 데이터 범주화, 액세스 레벨 할당, 감사 및/또는 다른 기능은 모두 자체적으로 수행될 수 있다. 예를 들어, 사용자가 카지노에 들어가면, 다양한 시스템(예컨대, 감시 카메라, 주차장 카메라, 고객 카드 시스템, 룸 액세스 시스템, 엔터테인먼트 데이터베이스 등)에서 블록체인에 추가되는 데이터가 수집될 수 있다. 데이터의 양이 주어지면, 인공 지능 엔진 및/또는 기 계 학습 엔진(예컨대, 지원 벡터 기계, 인공 신경망, 베이지안 네트워크(Bayesian networks), 지도 학습 (supervised learning), 자율 학습(unsupervised learning) 및/또는 다른 기술을 사용함)을 사용하여 블록체인 에 추가할 수 있는 관련 데이터를 식별, 연관 및 분류할 수 있다. 데이터 자체는 검색 및/또는 향후 수집을 위 해 색인화될 수 있다. 다른 실시예에서, 데이터는 분할되어 플레이어의 프로필에 추가될 수 있다. 데이터의 다양한 부분을 서로 다른 액세스 레벨로 할당할 수 있으므로, 데이터를 요청하는 사람은 자신의 액세스 레벨에 적합한 데이터 부분만 자동으로 제공받을 수 있다. 마찬가지로, 데이터를 자동으로 검토하거나 감사하여 위반 사항(예컨대, 갬블링 규칙 위반, 부정 행위, 결탁(collusion), 갬블링이 금지된 사람 등)을 식별할 수 있다. 카지노 모니터링과 마찬가지로, 본 기술의 다양한 실시예는 사람이 해당 검토 내용을 감독하지 않아도 자동으로 데이터를 검토할 수 있는 업종(vertical)에 적용될 수 있다. 예를 들어, 일부 실시예는 개인에 대한 생체 인식 이나 데이터를 얻기 위해 보안 데이터 세트(사설 블록체인에 저장될 수 있음)와 인터페이싱할 수 있다. 이와 같이, 정부 기관(예컨대, ICE 또는 국토 안보부)은 개인을 식별하고 특정 데이터, 활동 및/또는 위치에 대한 액 세스 권한을 부여해야 하는지 여부를 결정하는 데 사용될 수 있는 데이터를 제공할 수 있다. 예를 들어, 시스 템의 다양한 실시예는 신뢰할 수 있는 여행자 프로그램을 위해 개인을 선별하는 데 사용될 수 있다. 예를 들어, 개인이 공항에 들어가면, 감시 카메라는 인공 지능 엔진이나 기계 학습 엔진에 의해 수집될 수 있는 비디 오 데이터를 수집할 수 있다. 이 데이터는 차량 번호판, 여행 기록, 생체 인식 데이터 등과 연계될 수 있고,초기에는 개인을 식별하여 위반이 진행 중인지 판단하거나, (예컨대, 빠른 검열을 위해) 개인을 사전 검열하거 나, 또는 사용자가 비행기나 기타 여행 방법을 통한 입국을 거부할 수 있는지를 판단할 수 있다. 일부 실시예 에서, 개인이 운전면허증을 스캔하도록 할 수 있고, 시스템은 신분증을 합법적 또는 사기로 자동 분류하여 결정 을 돕기 위해 블록체인의 기록을 검색할 수 있다. 도 3은 본 기술의 다양한 실시예에 따른 분산 원장 아키텍처를 활용하는 블록체인 데이터 플랫폼의 다양한 구성 요소를 도시한다. 도 3에 도시된 바와 같이, 블록체인 데이터 플랫폼은 하나 이상의 서버(305A~305N)를 사용할 수 있다. 각 서버는 블록체인 인터페이스, 모니터링 메커니즘, 클라이언트 인터페이스, 규칙 엔진, 암호화/복호화 모듈, 분석 모듈, 이벤트 모듈, 멀티팩터 인증 모듈, 보고서 생 성기, 및/또는 로그, 가입자 정책, 트랜잭션 정책, 위치 정책 등을 저장하기 위한 데이터베이스 및/ 또는 데이터베이스를 포함할 수 있다. 또한, 블록체인 서버(305A~305N)는 블록체인, 클라이언트 , 신뢰할 수 있는 데이터 소스 및/또는 기록과 연결할 수 있다. 이들 모듈, 구성 요소 또는 데이터베이스의 각각은 특수 목적 하드웨어(예컨대, 하나 이상의 ASICS, PLD, FPGA 등)나, 소프트웨어 및/또는 펌웨어를 사용하여 적절하게 프로그래밍된 프로그래밍 가능 회로(예컨대, 하나 이상 의 마이크로프로세서나 마이크로제어기 등), 또는 특수 목적 하드웨어와 프로그래밍 가능 회로의 조합으로 구현 될 수 있다. 본 기술의 다른 실시예는 다른 모듈, 애플리케이션, 데이터베이스 및/또는 구성 요소와 함께 이들 모듈과 구성 요소 중 일부, 전부를 포함하거나 포함하지 않을 수 있다. 아울러, 일부 실시예는 이들 모듈과 구 성 요소 중 둘 이상을 단일 모듈로 통합하고/통합하거나 이들 모듈 중 하나 이상의 기능의 일부를 다른 모듈과 연관시킬 수 있다. 예를 들어, 일 실시예에서, 규칙 엔진 및 이벤트 모듈은 사용자 단말의 다양한 규칙과 이벤트 정책을 식별하고 시행하기 위해 단일 모듈로 결합될 수 있다. 클라이언트는 클라이언트 인터페이스를 사용하여 블록체인 서버(305A~305N) 중 하나에 연결할 수 있 다. 클라이언트는 클라이언트가 블록 엔트리(또는 그것의 선택된 부분)에 들어가 볼 수 있게 하는 블록체인 서버(305A~305N)로부터 펌웨어 또는 소프트웨어를 다운로드(또는 사전 설치)할 수 있다. 블록 엔트리 는 다양한 트랜잭션(예컨대, 재무 트랜잭션, 게임 베팅, 의료 기록, 인벤토리 추적 등)과 다양한 액세스 레벨 (비공개, 허가, 공개 등)을 포함할 수 있다. 일부 실시예에서, 블록체인 서버(305A~305N)는 각 트랜잭션의 하 나 이상의 부분을 보기 위해 액세스를 검증하도록 암호화 코드를 처리한다. 일부 실시예에서 블록체인 서버(305A~305N)는 블록 엔트리 내의 복수의 부분 각각에 대한 적어도 하나의 공개된 위치를 나타내는, 블록 엔트리 내의 복수의 부분 각각에 대한 포인터를 유지할 수 있다. 블록 엔트리의 각 부 분에 대한 포인터를 사용하여 액세스 레벨과 연관된 부분을 검색함으로써 블록 엔트리의 맞춤형 뷰가 생성될 수 있다. 다른 실시예에서, 블록체인 서버(305A~305N)는 각각의 액세스 레벨과 연관된 데이터 부분에 대해 별도의 블록 엔트리를 유지할 수 있다. 블록체인 서버(305A~305N)는 액세스 레벨과 연관된 데이터 부분을 식별하기 위 해 블록체인의 블록 엔트리로 요청의 액세스 코드를 평가할 수 있다. 일부 시나리오에서, 블록체인 서버 (305A~305N)는 각각의 액세스 레벨과 연관된 데이터 부분에 대한 별도의 블록체인을 유지할 수 있다. 그런 다 음 블록체인 서버(305A~305N)는 액세스 레벨과 연관된 데이터 부분을 식별하기 위해 블록체인으로 요청의 액세스 코드를 평가할 수 있다. 일부 예에서, 블록체인에 저장된 정보는 암호화/복호화 모듈을 사용하여 암호화될 수 있다. 일부 실 시예에서, 암호화/복호화 모듈은 다양한 비동형 암호화(non-homomorphic encryption) 및/또는 동형 암호화 (homomorphic encryption)를 사용할 수 있다. 비동형 암호화는 더 강력한 보안 속성을 제공할 수 있지만, 동형 암호화를 사용하면, 복호없이 인코딩된 데이터에 대한 계산을 가능하게 할 수 있다. 결과적으로, 게임 시스템 의 다양한 구성 요소는 민감한 데이터의 노출없이 데이터의 일부에서 상호 작용하고 작동할 수 있다. 모니터링 메커니즘은 트랜잭션 및 사용자 활동을 모니터링할 수 있다. 이것은 클라이언트, 비디오 감시 시스템, 고객 카드 시스템, 키 엔진, 생체 인식 센서 및 다른 외부 시스템과 같은 외부 소스로부터 정보를 수신하는 것을 포함할 수 있지만, 이것으로 제한되는 것은 아니다. 일부 실시예에서, 사용자가 통화 트랜잭션, 의료 기록, 게임 베팅, 인벤토리 활동 로그 등에 들어가거나 액세스하도록 허용하기 전에, 멀티팩터 인증이 사 용될 수 있다. 예를 들어, 환자가 의료 기록에 액세스할 때, 멀티팩터 인증 모듈은 다양한 유형의 인증 (예컨대, 개인 핀, 생체 인식, 토큰 등)을 요청하기 위해 사용될 수 있다. 규칙 엔진은 클라이언트 에 제공되는 트랜잭션 인터페이스에 규칙을 중첩할 수 있다. 이들 규칙은 데이터베이스에 저장된 다양한 정책(예컨대, 가입자 정책, 트랜잭션 정책, 위치 정책 등)에 기초할 수 있다. 분석 모듈은 계층, 클라이 언트, 게임, 의료 진단, 급여, 패키지 전달, 지불금, 계정 및/또는 기타 시스템 구성 요소나 활동에 대한 다양한 분석을 생성할 수 있다. 이 정보는 보고서 생성기에 의해 트랜잭션의 맞춤형 뷰를 생성하는 데 사용될 수 있다. 제한된 액세스 모듈을 사용하여 각 트랜잭션에서 데이터의 서로 다른 부분 및 서로 다른 사용자/사용자 유 형에 대한 맞춤형 액세스 요건을 생성할 수 있다. 보상은 블록체인 내의 기록에 저장될 수 있다. 액세스 요건은 트랜잭션을 입력하는 사용자에 의해 생성되고, 이전에 지정된 사용자 선호도에 기초하거나, 다른 당사자가 요청하는 정책(예컨대, 1996년 HIPAA(Health Insurance Portability and Accountability Act), 갬블 최소 연령에 대한 주법(tate laws for minimum age to gamble) 등에서 요청하는 의료 기록에 대한 허용 접근 권한)에 의해 결정될 수 있으며, 해당 액세스 정책에 기초하여 기록에 대한 맞춤형 뷰를 제공할 수 있다. 데이 터베이스 및/또는 데이터베이스는 로그, 가입자 정책, 트랜잭션 정책, 위치 정책 등을 저장하는 데 사용될 수 있다. 이들은 블록체인과 연관된 기록으로부터 검색된 데이터의 로컬 저장소일 수 있다. 또한, 서버(305A~305N) 및 블록체인은 외부 이벤트(예컨대, 스포츠 이벤트의 결과, 벤더/구매자 저널 엔트 리의 조정 등) 또는 기록에 저장된 데이터를 결정하는 데 필요한 정보(예컨대, 보안 허가 상태)의 검증을 위해 신뢰할 수 있는 데이터 소스와 연결할 수 있다. 도 4는 블록체인에 기록된 제한된 트랜잭션의 맞춤형 뷰를 생성하기 위한 향상된 애플리케이션 구현예의 블록도 를 도시한다. 블록도는 인벤토리 블록 엔트리, 데이터 플랫폼, 서버(420~422), 블록체인 (430~432) 및 기록을 포함한다. 블록 엔트리는 블록체인에 영구적으로 기록될 임의의 데이터 트랜잭션을 나타낸다. 블록 엔트리는 채굴자에 의해 후속적으로 처리되고 데이터 플랫폼에 의해 블록체인의 마지막 블록에 추가된다. 블록 엔 트리는 본 명세서에서 제품, 구매자 및 가격으로 표현된 데이터의 일부를 더 포함한다. 각 데이터 부분은 개별적으로 표현되지만, 데이터 부분은 블록 엔트리로 표현된 하나의 트랜잭션의 일부라는 점에 유의해야 한다. 블록 엔트리는 분산 원장 플랫폼 환경에서 실행되고 기록된 임의의 트랜잭션이나 계약을 포함할 수 있다. 이 예에서, 블록 엔트리는 인벤토리에 대한 구매 주문을 포함할 수 있다. 데이터 플랫폼은 블록체인 애플리케이션을 호스팅할 수 있는 임의의 컴퓨팅 시스템이나 시스템을 나타내며, 도 16의 제어기가 대표적이다. 데이터 플랫폼은 트랜잭션을 블록체인에 기록하기 위한 안전한 분산 원장 시스템을 제공한다. 데이터 플랫폼은 세무 감사관, 금융 기관, 게임 규제 위원회, 고객, 회사 직원 등과 같은 다양한 사용자에 의해 액세스될 수 있는 복수의 분산 네트워크 노드에 걸쳐 구현될 수 있다. 데이터 플랫폼은 또한 서버(420~422)를 포함할 수 있다. 서버(420~422)는 분산 네트워크 노드가 통신할 수 있는 임의의 컴퓨팅 시스템이나 시스템을 나타낼 수 있다. 예들은 사용자 장치의 운영 사용자가 블록체인에 추가되고 분산 네트워크의 네트워크 노드간에 분산될 트랜잭션을 전송할 수 있도록, 대응하는 애플리케이션이나 서비스를 구비하는 다른 장치를 포함한다. 예들은 미디어 서버, 웹 서버, 및 사용자 장치와 네트워크 노드에서 트랜잭션 데이터를 전송하거나 수신할 수 있는 다른 유형의 엔드 포인트를 포함한다. 일부 실시예에서, 데이터 플랫폼은 데이터를 저장하도록 승인된 서버(420~422)를 동적으로 선택할 수 있다. 예를 들어, 회사나 정부는 블록체인이 저장되는 서버 노드에 지리적 제한이나, 암호화 표준이나, 네트워크 보안 표준이나, 또는 다른 제한 을 둘 수 있다. 따라서 데이터 플랫폼은 이들 제한에 기초하여 동적으로 선택된 서버의 물류를 관리할 수 있다. 예를 들어, 특정 서버가 공격을 받거나 해킹당한 것으로 간주되면, 데이터 플랫폼은 블록체인 네트 워크에서 해당 서버를 동적으로 제거하고, 필요한 경우, 하나 이상의 추가 서버를 추가하는 것을 고려할 수 있 다. 이와 같이, 데이터의 각 소유자는 데이터를 저장해야 하는 위치와 해당 서버 그룹에 필요한 최소 IT 표준 에 대한 선택 기준을 설정할 수 있다. 블록도는 블록체인(430~432)을 더 포함한다. 블록체인(430~432)은 암호화를 사용하여 연계되고 보호되는 블록이라고 하는 기록 목록이 지속적으로 증가하고 있다. 블록체인(430~432)의 각 블록은 타임스탬프와 해시를 포함한다. 해시는 현재 블록의 암호화 해시와 블록체인 내의 이전 블록의 암호화 해시를 모두 포함한다. 각 블록에는 블록 엔트리와 연관된 데이터도 포함되어 있다. 이 예시 시나리오에서, 데이터의 각 부분(제품, 구매 자 및 가격)은 각기 다른 블록과 별도의 블록체인(430~432)에 기록되었다. 또한, 각각의 블록체인(430~432)은 별도의 액세스 레벨과 연관된다. 예를 들어, 블록체인은 분산 원장과 상호 작용하는 임의의 사용자가 각 블록 내에 저장된 블록 및 데이터 부분을 볼 수 있게 하는 공용 액세스 블록 체인이다. 공개 사용자는 블록체인에서 트랜잭션을 보는 데 관심이 있는 임의의 사용자일 수 있으며, 이 데이터 부분에 대한 프라이버시는 존재하지 않는다. 반대로, 블록체인은 내부 회사 직원과 같은 승인된사용자만이 데이터 부분에 액세스하여 볼 수 있는 사설 블록체인이다. 이 예시 시나리오에서, 구매자는 블록체 인에 별도로 저장되었으며, 트랜잭션을 시작하는 회사 내의 관리자와 같이, 데이터에 독점적으로 액세스하 는 사용자를 제외하고 블록체인 네트워크에서 상호 작용하는 모든 사용자에게는 비공개이다. 블록체인은 모든 사용자가 볼 수 없지만, 한정된 당사자 집단만이 블록에 기록된 데이터 부분을 볼 수 있다는 것을 의미하 는 허가 블록체인이다. 가격은 블록체인 내에 저장되었으며, 감사관이나 통제관과 같은 데이터에 대한 액 세스가 허용된 당사자가 볼 수 있다. 기록은 사용자가 블록 엔트리에 저장된 트랜잭션 데이터 보기를 요청할 때 볼 수 있는 내용을 예시한 다. 기록은 블록 엔트리에 본래 입력되어 있던 모든 데이터 부분을 포함하거나 포함하지 않을 수 있 으며, 요청 사용자에 의해 제공된 권한 및 데이터의 각 부분이 연관된 액세스 레벨에 기초하여 생성된다. 도 5는 블록체인에 기록된 제한된 트랜잭션의 맞춤형 뷰를 생성하기 위한 구현예의 흐름도를 도시한다. 뷰 맞 춤화 프로세스의 일부 또는 모든 단계는 맞춤형 뷰 특징을 수행하기 위해 사용되는 애플리케이션의 구성 요소(들)의 맥락에서 프로그램 명령으로 구현될 수 있다. 동작 중에서, 데이터 플랫폼은 블록체인(430~432)의 블록에서 유지될 블록 엔트리를 수신한다(단계 501). 블록 엔트리는 사용자에 의해 노드의 분산 네트워크의 사용자 장치로부터 요청되며 데이터 부분을 포함한다. 다음에 데이터 플랫폼은 해당 엔트리를 승인한다(예컨대, 채굴자가 블록에서 해시를 검증함) (단계 502). 블록이 검증되지 않으면, 트랜잭션(블록 엔트리)이 거절된다(단계 503). 그러나, 블록이 승 인되면, 데이터의 각 부분은 액세스 레벨이 평가되고, 확인된 액세스 레벨에 기초하여 각각의 블록체인 (430~432)의 블록에 추가된다(단계 504). 다음 동작에서, 데이터 플랫폼은 블록 엔트리의 하나 이상의 데이터 부분을 보기 위한 요청을 수신하고, 여기서, 요청은 적어도 하나의 액세스 레벨과 연관된 액세스 코드를 포함한다(단계 505). 액세스 코드는 공개, 허가 또는 비공개 액세스 레벨과 연관될 수 있다. 다음에 데이터 플랫폼은 각각의 데이터 부분에 대한 개 별 블록의 각 기록을 유지하는 각 블록체인(430~432)을 통해 요청에서의 액세스 코드를 평가한다(단계 506). 요청 사용자와 연관된 액세스 코드가 공개된 것으로 결정되면, 요청 사용자에 대해 블록 엔트리로부터 제 품만을 나타내는 맞춤형 뷰(예컨대, 기록)가 생성될 것이다(단계 507). 요청 사용자와 연관된 액세스 코 드가 허가되는 것으로 결정되면, 요청 사용자에 대해 블록 엔트리로부터 제품 및 가격을 나타내는 맞춤형 뷰가 생성될 것이다(단계 508). 요청 사용자와 연관된 액세스 코드가 비공개인 것으로 결정되면, 요청 사용자 에 대해 블록 엔트리로부터 데이터의 모든 부분(즉, 제품, 구매자 및 가격)을 나타내는 맞춤형 뷰가 생성 될 것이다(단계 509). 흐름도에 대한 다른 구현예는 갬블링 검증 프로세스의 맥락에서 이루어질 수 있다. 예를 들어, 큰 임계값 승리에 베팅하는 사용자는 카지노 관리자의 승인이 필요할 수 있다. 이 예시 시나리오에서, 카지노 관리자가 사용자에게 베팅을 승인했는지 확인하기 위해, 베팅 대금이 지급될 때, 블록체인의 사용자 데이터에 대한 액세 스가 필요할 수 있다. 도 6은 블록체인에 기록된 제한된 트랜잭션의 맞춤형 뷰를 생성하기 위한 향상된 애플리케이션의 대안적인 구현 예의 블록도를 도시한다. 블록도는 게임 베팅 블록 엔트리, 데이터 플랫폼, 서버(620~622), 블 록체인, 액세스 플랫폼 및 기록을 포함한다. 블록 엔트리는 블록체인에 영구적으로 기록될 임의의 데이터 트랜잭션을 나타낸다. 블록 엔트리는 채굴자에 의해 후속적으로 처리되고 데이터 플랫폼에 의해 블록체인의 마지막 블록에 추가된다. 블록 엔 트리는 본 명세서에서 베팅액, 신용 카드 번호 및 나이로 표현된 데이터의 일부를 더 포함한다. 각 데이 터 부분은 개별적으로 표현되지만, 데이터 부분은 블록 엔트리로 표현된 하나의 트랜잭션의 일부라는 점에 유의해야 한다. 블록 엔트리는 분산 원장 플랫폼 환경에서 실행되고 기록된 임의의 트랜잭션이나 계약을 포함할 수 있다. 그러나, 본 예에서, 블록 엔트리는 갬블링 베팅을 포함한다. 베팅에 직접 참여하지 않 는 제 3 자 관찰자와 같은 요청 사용자는 블록체인의 일부 데이터를 볼 수 있지만, 블록 엔트리를 보 기 위해서는 액세스 코드가 필요할 수 있다. 액세스 코드는 생체 인증의 형태일 수 있다. 데이터 플랫폼은 블록체인 애플리케이션을 호스팅할 수 있는 임의의 컴퓨팅 시스템이나 시스템을 나타내며, 도 16의 제어기가 대표적이다. 데이터 플랫폼은 트랜잭션을 블록체인에 기록하기 위한 안전한 분산 원장 시스템을 제공한다. 데이터 플랫폼은 감사관, 금융 기관, 게임 규제 위원회, 고객, 회 사 직원 등과 같은 다양한 사용자에 의해 액세스될 수 있는 복수의 분산 네트워크 노드에 걸쳐 구현될 수 있다.데이터 플랫폼은 또한 서버(620~622)를 포함한다. 서버(620~622)는 분산 네트워크 노드가 통신할 수 있는 임의의 컴퓨팅 시스템이나 시스템을 나타낼 수 있다. 예들은 사용자 장치의 운영 사용자가 블록체인에 추가되 고 분산 네트워크의 네트워크 노드간에 분산될 트랜잭션을 전송할 수 있도록, 대응하는 애플리케이션이나 서비 스를 구비하는 다른 장치를 포함한다. 예들은 미디어 서버, 웹 서버, 및 사용자 장치와 네트워크 노드에서 트 랜잭션 데이터를 전송하거나 수신할 수 있는 다른 유형의 엔드 포인트를 포함한다. 블록도은 블록체인을 더 포함한다. 블록체인은 암호화를 사용하여 연계되고 보호되는 블록이라 고 하는 기록 목록이 지속적으로 증가하고 있다. 블록체인의 각 블록은 타임스탬프와 해시를 포함한다. 해시는 현재 블록의 암호화 해시와 블록체인 내의 이전 블록의 암호화 해시를 모두 포함한다. 각 블록에는 블 록 엔트리와 연관된 데이터도 포함되어 있다. 이 예시 시나리오에서, 데이터의 각 부분(베팅액, 신용 카드 번 호 및 나이)은 별도의 암호화 코드를 사용하여 블록체인에 기록되어 있다. 추가로, 블록체인의 각 데이터 부분과 연관된 각각의 암호화 코드는 별도의 액세스 레벨과 연관된다. 예 를 들어, 베팅액은 분산 원장과 상호 작용하는 임의의 사용자가 블록의 데이터 부분을 볼 수 있게 하는 공개 액 세스 암호화 코드와 연관된다. 공개 사용자는 베팅액을 보는 데 관심이 있는 임의의 사용자일 수 있으며, 이 데이터 부분에 대한 프라이버시는 존재하지 않는다. 반대로, 신용 카드 번호는 내부 회계 부서와 같이, 권한을 가진 사용자만이 액세스하여 볼 수 있는 비공개 암호화 코드와 연관된다. 나이는 모든 사용자가 아닌 한정된 당사자 집단만이 볼 수 있는 허가 암호화 코드와 연관된다. 예를 들어, 모든 플레이어가 갬블링 베팅을 할 수 있는 합법적인 나이인지 확인하기 위해 게임 위원회가 나이를 볼 것을 요청할 수 있다. 그러나 베팅의 다른 플 레이어나 관찰자는 각 플레이어의 나이를 볼 수 없을 것이다. 액세스 플랫폼은 블록체인 엔트리 데이터에 액세스하기 위한 사용자 요청을 검증할 수 있는 임의의 컴퓨팅 시스템이나 시스템을 나타내며, 도 16의 제어기가 대표적이다. 액세스 플랫폼은 블록체인에 기록된 데이터 부분과 요청 사용자를 위한 기록의 생성 사이에 보안 암호화 조정자(secure encryption mediator)를 제공한다. 액세스 플랫폼은 세무 감사관, 금융 기관, 게임 규제 위원회, 고객, 회사 직원 등 과 같은 다양한 사용자에 의해 액세스될 수 있는 복수의 분산 네트워크 노드에 걸쳐 구현될 수 있다. 기록 은 사용자가 블록 엔트리에 저장된 트랜잭션 데이터 보기를 요청할 때 볼 수 있는 내용을 예시한다. 기록은 블록 엔트리에 본래 입력되어 있던 모든 데이터 부분을 포함하거나 포함하지 않을 수 있으며, 요청 사용자에 의해 제공된 권한 및 데이터의 각 부분이 연관된 액세스 레벨에 기초하여 생성된다. 도 7은 블록체인에 기록된 제한된 트랜잭션의 맞춤형 뷰를 생성하기 위한 구현예의 흐름도를 도시한다. 뷰 맞 춤화 프로세스의 일부 또는 모든 단계는 맞춤형 뷰 특징을 수행하기 위해 사용되는 애플리케이션의 구성 요소(들)의 맥락에서 프로그램 명령으로 구현될 수 있다. 동작 중에서, 데이터 플랫폼은 블록체인의 블록에서 유지될 블록 엔트리를 수신한다(단계 701). 블록 엔트리는 사용자에 의해 노드의 분산 네트워크의 사용자 장치로부터 요청되며 데이터 부분을 포함한 다. 다음에 데이터 플랫폼은 해당 엔트리를 승인한다(예컨대, 채굴자가 블록에서 해시를 검증함)(단계 702). 블록이 검증되지 않으면, 트랜잭션(블록 엔트리)이 거절된다(단계 703). 그러나, 블록이 승인되면, 데이터의 각 부분은 액세스 레벨이 평가되어 블록체인에 추가되고(단계 704), 확인된 액세스 레 벨에 기초하여 암호화 코드도 함께 추가된다(단계 705). 다음 동작에서, 액세스 플랫폼은 블록 엔트리의 하나 이상의 데이터 부분을 보기 위한 요청을 수신하고, 여기서, 요청은 적어도 하나의 액세스 레벨과 연관된 암호화 코드를 포함한다(단계 706). 암호화 코드는 공개, 허가 또는 비공개 액세스 레벨과 연관될 수 있다. 그 후, 액세스 플랫폼은 블록체인의 데이터 부분 각각을 사용하여 요청의 암호화 코드를 평가한다(단계 707). 요청 사용자와 연관된 암호화 코드가 공개된 것으 로 결정되면, 요청 사용자에 대해 블록 엔트리로부터 베팅액만을 나타내는 맞춤형 뷰(예컨대, 기록) 가 생성될 것이다(단계 708). 요청 사용자와 연관된 암호화 코드가 허가되는 것으로 결정되면, 요청 사용자에 대해 블록 엔트리로부터 베팅액 및 나이를 나타내는 맞춤형 뷰가 생성될 것이다(단계 709). 요청 사용자 와 연관된 암호화 코드가 비공개인 것으로 결정되면, 요청 사용자에 대해 블록 엔트리로부터 데이터의 모 든 부분(즉, 베팅액, 신용카드 번호 및 나이)을 나타내는 맞춤형 뷰가 생성될 것이다(단계 710). 도 8은 블록체인에 기록된 제한된 트랜잭션의 맞춤형 뷰를 생성하기 위한 향상된 애플리케이션의 대안적인 구현 예의 블록도를 도시한다. 블록도은 자금 이체 블록 엔트리, 데이터 플랫폼, 서버(820~822), 블 록체인, 액세스 플랫폼 및 기록을 포함한다.블록 엔트리는 블록체인에 영구적으로 기록될 임의의 데이터 트랜잭션을 나타낸다. 블록 엔트리는 채굴자에 의해 후속적으로 처리되고 데이터 플랫폼에 의해 블록체인의 마지막 블록에 추가된다. 블록 엔 트리는 본 명세서에서 트랜잭션의 당사자, 은행 계좌 번호 및 사용 가능 자금으로 표현된 데이터의 일부를 더 포함한다. 각 데이터 부분은 개별적으로 표현되지만, 데이터 부분은 블록 엔트리로 표현된 하나의 트 랜잭션의 일부라는 점에 유의해야 한다. 블록 엔트리는 분산 원장 플랫폼 환경에서 실행되고 기록된 임의 의 트랜잭션이나 계약을 포함할 수 있다. 그러나, 본 예에서, 블록 엔트리는 한 사용자의 은행 계좌에서 다른 사용자의 은행 계좌로 돈을 이체하는 은행 트랜잭션을 포함한다. 데이터 플랫폼은 블록체인 애플리케이션을 호스팅할 수 있는 임의의 컴퓨팅 시스템이나 시스템을 나타내며, 도 16의 제어기가 대표적이다. 데이터 플랫폼은 트랜잭션을 블록체인에 기록하기 위한 안전한 분산 원장 시스템을 제공한다. 데이터 플랫폼은 세무 감사관, 금융 기관, 게임 규제 위원회, 고객, 회사 직원 등과 같은 다양한 사용자에 의해 액세스될 수 있는 복수의 분산 네트워크 노드에 걸쳐 구현될 수 있다. 데이터 플랫폼은 또한 서버(820~822)를 포함한다. 서버(820~822)는 분산 네트워크 노드가 통신할 수 있는 임의의 컴퓨팅 시스템이나 시스템을 나타낼 수 있다. 예들은 사용자 장치의 운영 사용자가 블록체인에 추가되 고 분산 네트워크의 네트워크 노드간에 분산될 트랜잭션을 전송할 수 있도록, 대응하는 애플리케이션이나 서비 스를 구비하는 다른 장치를 포함한다. 예들은 미디어 서버, 웹 서버, 및 사용자 장치와 네트워크 노드에서 트 랜잭션 데이터를 전송하거나 수신할 수 있는 다른 유형의 엔드 포인트를 포함한다. 블록도은 블록체인을 더 포함한다. 블록체인은 암호화를 사용하여 연계되고 보호되는 블록이라 고 하는 기록 목록이 지속적으로 증가하고 있다. 블록체인의 각 블록은 타임스탬프와 해시를 포함한다. 해시는 현재 블록의 암호화 해시와 블록체인 내의 이전 블록의 암호화 해시를 모두 포함한다. 각 블록에는 블 록 엔트리와 연관된 데이터도 포함되어 있다. 이 예시 시나리오에서, 데이터의 각 부분(당사자, 계좌 번호 및 사용 가능 자금)은 별도의 액세스 레벨 플래그를 사용하여 블록체인에 기록되어 있다. 추가로, 블록체인의 각 데이터 부분과 연관된 각각의 액세스 레벨 플래그는 별도의 액세스 레벨과 연관된 다. 예를 들어, 당사자는 분산 원장과 상호 작용하는 임의의 사용자가 블록의 데이터 부분을 볼 수 있게 하는 공개 액세스 플래그와 연관된다. 공개 사용자는 트랜잭션의 당사자를 보는 데 관심이 있는 임의의 사용자일 수 있으며, 이 데이터 부분에 대한 프라이버시는 존재하지 않는다. 반대로, 계좌 번호는 각 당사자에 대한 이체 은행과 같이, 권한을 가진 사용자만이 액세스하여 볼 수 있는 비공개 액세스 플래그와 연관된다. 사용 가능 자 금은 모든 사용자가 아닌 한정된 당사자 집단만이 볼 수 있는 허가 액세스 플래그와 연관된다. 예를 들어, 자 금 트랜잭션을 완료하기 위해 송금 계좌에서 자금을 사용할 수 있는지 확인하기 위해 수취 은행이 사용 가능 자 금을 볼 것을 요청할 수 있다. 액세스 플랫폼은 블록체인 엔트리 데이터에 액세스하기 위한 사용자 요청을 검증할 수 있는 임의의 컴퓨팅 시스템이나 시스템을 나타내며, 도 16의 제어기가 대표적이다. 액세스 플랫폼은 블록체인에 기록된 데이터 부분과 요청 사용자를 위한 기록의 생성 사이에 보안 액세스 플래그 조정자(secure access flag mediator)를 제공한다. 액세스 플랫폼은 세무 감사관, 금융 기관, 게임 규제 위원회, 고객, 회사 직 원 등과 같은 다양한 사용자에 의해 액세스될 수 있는 복수의 분산 네트워크 노드에 걸쳐 구현될 수 있다. 기 록은 사용자가 블록 엔트리에 저장된 트랜잭션 데이터 보기를 요청할 때 볼 수 있는 내용을 예시한다. 기록은 블록 엔트리에 본래 입력되어 있던 모든 데이터 부분을 포함하거나 포함하지 않을 수 있으며, 요청 사용자에 의해 제공된 권한 및 데이터의 각 부분이 연관된 액세스 레벨에 기초하여 생성된다. 도 9는 블록체인에 기록된 제한된 트랜잭션의 맞춤형 뷰를 생성하기 위한 구현예의 흐름도를 도시한다. 뷰 맞 춤화 프로세스의 일부 또는 모든 단계는 맞춤형 뷰 특징을 수행하기 위해 사용되는 애플리케이션의 구성 요소(들)의 맥락에서 프로그램 명령으로 구현될 수 있다. 동작 중에서, 데이터 플랫폼은 블록체인의 블록에서 유지될 블록 엔트리를 수신한다(단계 901). 블록 엔트리는 사용자에 의해 노드의 분산 네트워크의 사용자 장치로부터 요청되며 데이터 부분을 포함한 다. 다음에 데이터 플랫폼은 해당 엔트리를 승인한다(예컨대, 채굴자가 블록에서 해시를 검증함)(단계 902). 블록이 검증되지 않으면, 트랜잭션(블록 엔트리)이 거절된다(단계 903). 그러나, 블록이 승인되면, 데이터의 각 부분은 액세스 레벨이 평가되어 블록체인에 추가되고(단계 904), 확인된 액세스 레 벨에 기초하여 액세스 플래그도 함께 추가된다(단계 905).다음 동작에서, 액세스 플랫폼은 블록 엔트리의 하나 이상의 데이터 부분을 보기 위한 요청을 수신하고, 여기서, 요청은 적어도 하나의 액세스 레벨과 연관된 액세스 코드를 포함한다(단계 906). 액세스 코드는 공개, 허가 또는 비공개 액세스 레벨과 연관될 수 있다. 그 후, 액세스 플랫폼은 블록체인의 데이터 부분 각각을 사용하여 요청의 액세스 코드를 평가한다(단계 907). 요청 사용자와 연관된 액세스 코드가 공개된 것으 로 결정되면, 요청 사용자에 대해 블록 엔트리로부터 당사자만을 나타내는 맞춤형 뷰(예컨대, 기록) 가 생성될 것이다(단계 908). 요청 사용자와 연관된 액세스 코드가 허가되는 것으로 결정되면, 요청 사용자에 대해 블록 엔트리로부터 당사자 및 사용 가능 자금을 나타내는 맞춤형 뷰가 생성될 것이다(단계 909). 요 청 사용자와 연관된 액세스 코드가 비공개인 것으로 결정되면, 요청 사용자에 대해 블록 엔트리로부터 데 이터의 모든 부분(즉, 당사자, 계좌 번호 및 사용 가능 자금)을 나타내는 맞춤형 뷰가 생성될 것이다(단계 910). 도 10은 블록체인에 기록된 제한된 트랜잭션의 맞춤형 뷰를 생성하기 위한 재무 감사 시나리오의 구현예에서의 예시적인 운영 아키텍처를 도시한다. 작동 중에, 사용자는 서비스와 교환하여 지불금을 사용자 에게 이체한다. 트랜잭션 기록은 사용자로부터 데이터베이스로 전송되어 서비스명과 지출비 를 표시한다. 그런 다음 기록은 서버를 통해 블록체인에 유지된다. 이 시나리오에서, 트랜잭션은 또한 사용자에 의해 수신단에 기록되고, 여기서, 수익 및 서비스를 나타내는 트랜잭션 기록은 데이터베이 스로 전송되고 서버를 통해 블록체인에 유지된다는 점에 유의해야 한다. 다음 동작에서, 정부 세무 감사관은 사용자에 대해 기록된 이익을 볼 것을 요청한다. 사용자 는 기록에 기록된 서비스나 사용자의 지출 비용을 볼 권한이 없을 수 있다. 서버는 요청을 수신하고, 이 시점에서 사용자가 사용자에 대한 이익을 볼 수 있는 권한만 있음을 나타내는 액세스 코드를 처리할 수 있다. 그 다음, 서버에 의해 사용자에 대한 이익만을 나타내는 사용자에 대한 맞춤형 뷰가 사용자에 대해 생성된다. 사용자는 트랜잭션의 전체 기록을 볼 수 없지만, 사용 자는 사용자의 이익을 나타내는 기록의 일부가 블록체인에 유지되었기 때문에 유효하다고 신 뢰할 수 있다. 도 11은 블록체인에 기록된 제한된 트랜잭션의 맞춤형 뷰를 생성하기 위한 게임 규제 시나리오의 구현예에서의 대안적인 운영 아키텍처를 도시한다. 작동 중에, 사용자는 사용자와 스포츠 베팅에 서명한 다. 스포츠 베팅의 기록은 사용자로부터 예측 팀과 사용자(1110~1111)의 운전면허 번호를 가리키는 데이 터베이스로 전송된다. 그런 다음 기록은 서버를 통해 블록체인에 유지된다. 이 시나리오에 서, 트랜잭션은 또한 스포츠 스코어링 위원회로부터 게임의 공식 스코어를 나타내는 데이터베이스 로 해당 게임의 공식 스코어를 전송하기 시작한다는 점에 유의해야 한다. 게임의 공식 점수는 데이터베이스 로 전송되고 서버를 통해 블록체인에 유지된다. 다음 동작에서, 스포츠 베팅 관리 사용자는 블록체인으로부터 게임의 공식 점수와 함께 예측 결과 를 볼 것을 요청할 수 있다. 사용자는 각 사용자(1110~1111)의 운전면허증을 볼 권한이 없을 수 있다. 서버는 요청을 수신하고, 이 시점에서 사용자가 각 사용자(1110~1111)의 예측 결과와 공식 점수를 볼 수 있는 권한만 있음을 나타내는 액세스 코드를 처리할 수 있다. 그 다음, 사용자에 대한 예측 결과 와 공식 점수만을 나타내는 기록의 맞춤형 뷰가 서버에 의해 생성된다. 사용자는 트랜잭션의 전체 기록을 볼 수 없지만, 사용자는 이 데이터가 블록체인에 유지되어 있기 때문에 사용자(1110~1111) 가 파일에 유효한 운전면허증을 보유하고 있음을 나타내는 기록 부분을 신뢰할 수 있다. 도 12는 블록체인에 기록된 제한된 트랜잭션의 맞춤형 뷰를 생성하기 위한 인벤토리 추적 시나리오 구현예에서 의 대안적인 운영 아키텍처를 도시한다. 동작 동안에, 사용자는 패키지의 화물을 사용자에 게 전달하여 사용자가 패키지 A를 추적하는 것을 포함하여 다양한 사용자에게 전달한다. 패키지의 화물에 대한 출발 시각 트랜잭션 기록은 사용자로부터 패키지 A와 패키지 B의 출발 시각을 나타내는 데이 터베이스로 전송된다. 그런 다음 기록은 서버을 통해 블록체인에 유지된다. 이 시나리오에 서, 패키지의 화물에 대한 도착 시각 트랜잭션은 또한 사용자에 의해 수신단에 기록되고, 여기서, 패키지 A와 패키지 B의 도착 시각을 나타내는 트랜잭션 기록은 데이터베이스로 전송되고 서버를 통 해 블록체인에 유지된다는 점에 유의해야 한다. 다음 작업에서 패키지 A를 추적하는 사용자는 패키지 A에 대해 기록된 출발 시각과 도착 시각을 볼 것을 요청한다. 사용자는 패키지 B에 대해 기록된 출발 시각과 도착 시각을 볼 권한이 없을 수 있다. 서버 는 요청을 수신하고, 이 시점에서 사용자는 패키지 A에 대해 기록된 출발 시각과 도착 시각을 볼수 있는 권한만 있음을 나타내는 액세스 코드를 처리한다. 그런 다음, 서버에 의해 패키지 A에 대해 기 록된 출발 시각 및 도착 시각만을 나타내는 기록의 맞춤형 뷰가 사용자에 대해 생성된다. 도 13은 블록체인에 기록된 제한된 트랜잭션의 예시적인 맞춤형 뷰를 도시한다. 도 13은 블록체인 애플리케이 션을 기본적으로 또는 웹 브라우저의 컨텍스트에서 실행하거나, 애플리케이션을 스트리밍하거나, 임의의 다른 방식으로 애플리케이션을 실행할 수 있는 하나 이상의 장치를 포함하는 컴퓨팅 시스템를 포함한다. 컴퓨 팅 시스템은 급여 트랜잭션 기록의 맞춤형 뷰를 생성하기에 적합한 지원 아키텍처의 다양한 하드웨어 및 소프트웨어 요소를 포함할 수 있다. 그러한 대표적인 아키텍처 중 하나가 제어기와 관련하여 도 16에 도 시되어 있다. 컴퓨팅 시스템은 또한 본 명세서에 설명된 처리에 따라 블록체인 트랜잭션의 완전한 기록을 유지할 수 있 는 블록체인 애플리케이션 구성 요소를 포함한다. 사용자 인터페이스는 블록체인 애플리케이션 구 성 요소에 의해 생성될 수 있는 맞춤형 뷰를 포함한다. 사용자 인터페이스는 사용자가 볼 수 있는 권한이 있는 블록 엔트리로부터의 데이터 부분을 디스플레이할 수 있다. 사용자는 처음에 급여에 있는 각 직원 의 이름과 같은 블록 엔트리의 공개 부분만을 볼 수 있는 액세스 권한을 가질 수 있다. 그런 다음 데이터의 허가 부분을 보기 위한 요청에서 암호화 코드를 전송할 수 있다. 컴퓨팅 시스템이 암호화 코드를 검증하면, 데이터의 허가 부분이 맞춤형 뷰에 추가될 수 있다. 데이터의 허가 부분에는 급여 트랜잭션에서 각 직원의 임금과 생년월일이 포함된다. 그러나 각 직원의 사회 보장 번호는 비공개로 유지 될 수 있으므로 사용자는 맞춤형 뷰에서 사회 보장 데이터를 볼 수 없을 것이다. 도 14는 블록체인에 기록된 제한된 트랜잭션의 대안적인 맞춤형 뷰의 예시를 도시한다. 도 14는 블록체인 의 사본을 저장하는 서버 노드를 포함한다. 블록체인은 블록 및 블록과 같이 해시 코드를 사용하여 체인화된 블록을 저장한다. 각 블록에는 데이터의 일부로 더 세분화될 수 있는 트랜잭션 이 포함된다. 예를 들어, 블록은 온라인 포커 게임 베팅 엔트리를 저장한다. 베팅 엔트리 는 각 플레이어의 이름, 각 플레이어의 베팅액, 각 플레이어가 베팅에 사용할 수 있는 자금액 및 플레이어 순위 인덱스를 포함한다. 게임 통계, 승/패 비율 등과 같은 추가 데이터가 블록에 포함될 수도 있다는 점에 유의해야 한다. 각 사용자가 베팅 엔트리에 액세스할 경우, 각 사용자가 볼 수 있는 데이터 부분을 나타내는 체크 표시가 포함 된다. 예를 들어, Sue는 모바일 장치를 사용하여 포커 게임 베팅 엔트리에 액세스하고 있다. 이 예시 시나리오에서, 일반인이 이름과 베팅액을 액세스할 수 있으므로, Sue는 각 플레이어의 이름과 베팅액을 볼 수 있는 권한이 있다. Sue는 자신의 자금액과 순위도 비공개로 액세스할 수 있다. 그러나 Sue는 사용 가능 자금 과 다른 플레이어의 순위에 액세스할 수 없다. 모바일 장치에 디스플레이된 맞춤형 뷰에서 알 수 있는 바와 같이, Sue는 승인된 데이터 부분은 볼 수 있고 승인되지 않은 데이터 부분을 보는 것은 차단 된다. 도 15는 블록체인에 기록된 제한적이거나 민감한 데이터의 맞춤형 뷰를 제공할 수 있는 데이터 액세스 시스템의 구현예에서의 대안적인 운영 아키텍처를 도시한다. 도 15에 도시된 바와 같이, 사용자(1510A~1510N)는 다양한 전자 장치를 사용하여 문서, 전자 기록, 물리적 위치(예컨대, 금고, 방, 건물, 영역 등) 또는 정보에 대한 액세 스를 요청할 수 있다. 예를 들어, 다양한 실시예에 따르면, 사용자(1510A~1510N)는 사용자에게 분류된 정보(예 컨대, 상태 또는 조직의 비밀)나 제한된 영역에 대하여 액세스하는 것을 허용하는 보안 허가와 같은 상이한 액 세스 레벨을 가질 수 있다. 일반적으로 모든 문서 및/또는 데이터에 액세스하기 위해서는 보안 허가(예컨대, 기밀, 비밀, 일급 비밀 등)만으로는 충분하지 않다. 그 대신 개인도 특정 정보를 알아야 한다. 요청은 상이한 시스템(예컨대, 애플리케이션, 키 카드 시스템, 지문 판독기, 생체 인식 장치, 패스워드, 멀티팩 터 인증 등)으로부터의 요청을 번역하고 검증할 수 있는 액세스 제어 프레임 워크에 제출될 수 있다. 검 증 시, 액세스 제어 프레임 워크는 다양한 보안 프로토콜을 사용하여 요청을 처리할 수 있는 보안 애플리케이터 에 요청을 제출할 수 있다. 예를 들어, 요청 문서나 위치의 보안 수준은 추가적인 다중 검증(예컨대, 패 스워드와 하드웨어 장치, 생체 인식, 위치 확인, PIN, 패스워드 등)을 요청할 수 있다. 일부 실시예에서, 보안 애플리케이션은 데이터와 연관된 블록체인의 블록 내의 필드 또는 메타데이터로부터 이 정보를 가져올 수 있다. 블록체인에 저장된 문서나 데이터(1550A~1550B)는 \"알아야 할 필요가 있다\"거나 액세스 레벨(예컨대, 준 법 감시인 대 회사의 하위 레벨 직원, 보안 허가 레벨이 높은 개인 대 보안 허가 레벨이 낮은 개인 등)이 다른 상이한 개인이 액세스할 수 있는 필드나 부분이 다를 수 있다. 예를 들어, 일부 실시예에서, 다양한 교정 매핑이 블록체인에 저장되고, 사용자(1510A~1510N)에게 제시되기 전에 문서 생성기에 의해 적용될 수 있다. 이와 같이, 동일한 문서나 데이터를 요청하는 두 사용자에게 서로 다른 결과가 표시될 수 있다. 예를 들어, 정보 액세스 요청의 자유도는 일반인이 사용할 수 있는 것으로 간주되는 수정된 문서를 생성할 수 있는 반면, 보안 허가를 받고 알아야 할 필요가 있는 개인에게는 다른 액세스 레벨이 제공될 것이다. 다양한 실시예에 따르면, 사용자로부터 초기 요청이 수신될 수 있다. 시스템은 요청에 부합하는 정보를 식별하고, FOIA 요청에 관한 요청에 응답하기 위한 타이머 기간(예컨대, 30일)을 설정할 수 있다. 그러면 시스템은 요청 에 부합하는 각 정보에 임의의 분류 제한이 있는지 여부를 결정할 수 있다. 정보가 제한되지 않은 것으로 결정 되면(예컨대, 분류 레벨 없음), 시스템은 검사없이 정보를 포함하는 응답으로 요청한 사용자에게 응답할 수 있 다. 이러한 유형의 특징은 (예컨대, 직원 간의 검토 우선 순위 지정 및 재할당에 의해) 공무원의 업무량을 줄 이고 응답 기간을 충족시킨다. 일부 실시예에서, 충분한 시간이 남아 있으면, 시스템은 인적 검토를 요청하고, 전송 전에 포함된 정보를 승인할 수 있다. 시스템이 기밀 정보를 식별하면, 시스템은 다음에 액세스 및 허가를 평가한다. 예를 들어, 데이터를 요청한 사 람이 관리자보다 더 높은 액세스/허가 권한을 가진 경우, 정보는 자동으로 전송된다. 그 다음, 보안 허가를 준 수하기 위해 수정이 이루어져야 하는 경우, 문서 생성기는 임의의 필요한 수정을 적용하고/적용하거나 응 답에 포함되지 않아야 하는 문서를 제거할 수 있다. 도 15에 도시되지 않았지만, 일부 실시예는 데이터 및/또 는 메타데이터를 검토하고 포함되지 않아야 하는 부분을 식별하기 위해 기계 학습/인공 지능 구성 요소를 포함 할 수 있다. 다른 실시예에는 다양한 정보를 추구하는 다른 유형의 개인(예컨대, 갬블러, 은행 고객, 감사를 수행하는 규제 기관 등에 대한 정보를 검색하는 사람들)이 포함될 수 있다. 이러한 사용 사례가 많이 존재한다. 또한, 일부 실시예는 요청을 제출하고, 블록체인으로부터 정보를 검색하고, 다른 애플리케이션(예컨대, 다른 Dapp)과 통신 하기 위해 분산형 피어-투-피어 네트워크(decentralized peer-to-peer network)에서 실행되는 백엔드 코드 (backend code)를 갖는 분산형 애플리케이션(Dapp)을 사용할 수 있다. 보안 애플리케이터는 또한 사용자의 자격 증명이나 보안 레벨의 상태를 검토할 수 있다. 사용자의 기록 은 블록체인에 저장될 수 있다. 예를 들어, 배경 조사, 은행 계좌 정보, 여행 정보, 사용자와 연관된 프 로젝트(과거 및 현재), 가족 이력, 병력, 자격 증명, 생체 인식, 패스워드, 서명 등에 관한 정보가 사용자의 기 록에 저장될 수 있다. 보안 애플리케이터는 그 정보를 검색하고 데이터나 문서의 맞춤형 뷰를 생성하는 데 정보를 활용할 수 있다. 도 16은 호스트 컴퓨터 시스템의 컴퓨터 시스템화를 나타내는 예시적인 머신을 도시하는 블록도를 도시한다. 제어기는 한 명 이상의 사용자, 클라이언트/터미널 장치, 사용자 입력 장치, 주변 장 치, 선택적 코프로세서 장치(들)(예컨대, 암호화 프로세서 장치) 및 네트워크를 포함하는 엔 티티와 통신할 수 있다. 사용자는 네트워크를 통해 단말 장치를 거쳐 제어기와 연결할 수 있다. 일부 실시예에서, 단말 장치와 제어기 간의 통신의 전부 또는 일부는 암호화될 수 있다. 다양한 법률, 표준 또는 모범 사례는 다양한 유형의 데이터, 정보, 코드, 신호화 등을 저장, 전송 및/또는 활용 하기 위해 암호화를 요청할 수 있다. 컴퓨터는 CPUs(Central Processing Units)나 프로세서를 사용하여 정보를 처리할 수 있다. 프로세서는 프로그 래밍 가능 범용 또는 특수 목적용 마이크로프로세서, 프로그래밍 가능 제어기, ASICs(Application-Specific Integrated Circuits), PLDs(Programmable Logic Devices), 임베디드 구성 요소, 이러한 장치의 조합 등을 포 함할 수 있다. 프로세서는 사용자 및/또는 시스템 생성 요청에 응답하여 프로그램 구성 요소를 실행한다. 이 들 구성 요소 중 하나 이상은 소프트웨어, 하드웨어 또는 하드웨어와 소프트웨어 모두에서 구현될 수 있다. 프 로세서는 명령어(예컨대, 작동 및 데이터 명령어)를 전달하여 다양한 작업을 가능하게 한다. 제어기는 특히 클록, CPU, ROM 및 RAM과 같은 메모리, 및 코프로세서를 포함할 수 있다. 이들 제어기 구성 요소는 시스템 버스에 연결될 수 있고, 시스템 버스를 통해 인 터페이스 버스에 연결될 수 있다. 또한, 사용자 입력 장치, 주변 장치, 코프로세서 장치 등은 인터페이스 버스를 통해 시스템 버스에 연결될 수 있다. 인터페이스 버스는 프 로세서 인터페이스, 입출력 인터페이스(I/O), 네트워크 인터페이스, 저장 인터페이스 등과 같은 복수의 인터페이스 어댑터에 연결될 수 있다. 프로세서 인터페이스는 코프로세서 장치와 코프로세서 간의 통신을 용이하게 할 수 있다. 일 구현예에서, 프로세서 인터페이스는 요청이나 데이터의 암호화 및 복호화를 촉진할 수 있다. 입출력 인터페이스(I/O)는 오디오, 데이터, 비디오 인터페이스, 무선 송수신기 등(예컨대, Bluetooth®, IEEE 894a-b, 직렬, USB(Universal Serial Bus), DVI(Digital Visual Interface), 802.11a/b/g/n/x, 셀룰러 등)을 처리하기 위한 것과 같은 프로토콜을 사용하여 사용자 입력 장치, 주변 장치, 코프로세서 장치 및/또는 이와 유사한 것, 및 제어기의 구성 요소 간의 통신을 용이하게 한다. 네트워크 인터페이 스는 네트워크와 통신할 수 있다. 네트워크를 통해, 제어기는 원격 단말 장치 에 액세스할 수 있다. 네트워크 인터페이스는 직접 연결, 이더넷, IEEE 802.11a-x, 미라캐스트 (miracast) 등과 같은 무선 연결과 같은 다양한 유무선 연결 프로토콜을 사용할 수 있다. 대화형 게임 시스템 의 일부 구성 요소는 다양한 프로토콜을 포함하거나 다른 협회나 규제 기관에서 정한 다양한 표준이나 인증을 준수할 수 있다. 예를 들어, 일부 실시예는 슬롯 어카운팅 시스템(SAS) 프로토콜을 사용하거나 G2S(Game to System) 표준을 준수할 수 있다. 네트워크의 예는 인터넷, LAN(Local Area Network), MAN(Metropolitan Area Network), WAN(Wide Area Network), 무선 네트워크(예컨대, WAP(Wireless Application Protocol) 사용), 보안 사용자 지정 연결 등을 포 함한다. 네트워크 인터페이스는, 일부 양태에서, 컴퓨터 네트워크에서 데이터에 대한 액세스/프록시 권 한을 제어 및/또는 관리할 수 있고, 상이한 머신 및/또는 애플리케이션 간의 다양한 신뢰 수준을 추적할 수 있 는 방화벽을 포함할 수 있다. 방화벽은, 예를 들어, 이러한 다양한 엔터티 간의 트래픽 흐름 및 리소스 공유를 규제하기 위해, 특정 기계와 애플리케이션 세트, 기계와 기계, 및/또는 애플리케이션과 애플리케이션 사이에 사 전 결정된 액세스 권한을 시행할 수 있는 하드웨어 및/또는 소프트웨어 구성 요소의 임의 조합을 포함하는 임의 수의 모듈일 수 있다. 방화벽은, 예를 들어, 개인, 기계 및/또는 애플리케이션에 의한 객체의 액세스 및 작동 권한과 허가권이 존재하 는 상황을 포함하여 권한을 상세히 설명하는 액세스 제어 목록에 대한 액세스 권한을 추가로 관리 및/또는 액세 스할 수 있다. 방화벽의 기능에 포함되거나 이를 수행하는 다른 네트워크 보안 기능은, 예를 들어, 본 발명의 신규 기술에서 벗어나지 않고, 침입 방지, 침입 감지, 차세대 방화벽, 개인 방화벽 등으로 될 수 있지만, 이것으로 한정되는 것은 아니다. 제어기는 지불액을 전송 및 수신하기 위해 네트워크 인터페이스를 사 용할 수 있다는 것을 이해해야 한다. 지불은 Bluetooth®를 사용하는 NFC(National Fighting Club) 애플리케 이션 탭과 같은 제어기에 의해 실행되는 애플리케이션에 의해 구동될 수 있다. 저장 인터페이스는 저장 장치, 이동식 디스크 장치 등과 같은 복수의 저장 장치와 통신할 수 있다. 스토리지 인터페이스는 SATA(Serial Advanced Technology Attachment), IEEE 894, 이더넷, 광섬유, USB 등과 같은 다양한 연결 프로토콜을 사용할 수 있다. 사용자 입력 장치 및 주변 장치는 I/O 인터페이스 및 잠재적으로 다른 인터페이스, 버스 및/ 또는 구성 요소에 연결될 수 있다. 사용자 입력 장치는 카드 판독기, 지문 판독기, 조이스틱, 키보드, 마이크로폰, 마우스, 원격 제어 장치, 망막 판독기, 터치 스크린, 센서 등을 포함할 수 있다. 주변 장치(161 0)는 안테나, 오디오 장치(예컨대, 마이크로폰, 스피커, 등), 카메라, 외부 프로세서, 통신 장치, RFIDs(Radio Frequency Identifiers), 스캐너, 프린터, 저장 장치, 트랜시버 등을 포함할 수 있다. 코프로세서 장치(161 5)는 인터페이스 버스를 통해 제어기에 연결될 수 있고, 마이크로 제어기, 프로세서, 인터페이스 또는 다른 장치를 포함할 수 있다. 컴퓨터 실행 가능 명령 및 데이터는 프로세서에 의해 액세스할 수 있는 메모리(예컨대, 레지스터, 캐시 메모리, RAM, 플래시, 등)에 저장될 수 있다. 이러한 저장된 명령 코드(예컨대, 프로그램)는 원하는 동작을 수행하기 위해 프로세서 구성 요소, 마더 보드 및/또는 다른 시스템 구성 요소와 결합할 수 있다. 제어기는 온칩 CPU 메모리(예컨대, 레지스터), RAM, ROM 및 저장 장치를 포함하는 다양한 형태의 메모리를 사용할 수 있다. 저장 장치는 고정형 또는 착탈형 자기 디스크 드라이브, 광학 드라이브, 고체 상태 메 모리 장치 및 기타 프로세서 판독 가능 저장 매체와 같은 임의의 수의 유형의 비일시적 저장 장치나 시스템을 사용할 수 있다. 메모리에 저장된 컴퓨터 실행 가능 명령은 특정 작업을 수행하거나 특정 추상 데이터 유형을 구현하는 루틴, 프로그램, 객체, 구성 요소, 데이터 구조 등과 같은 하나 이상의 프로그램 모듈을 갖는 대화형 게임 플랫폼을 포함할 수 있다. 예를 들어, 메모리는 운영 시스템(OS) 구성 요소, 모듈 및 다른 구성 요 소, 데이터베이스 테이블 등을 포함할 수 있다. 이들 모듈/구성 요소는 인터페이스 버스를 통해 액세스 가능한 외부 저장 장치를 포함하여 저장 장치로부터 저장 및 액세스될 수 있다. 데이터베이스 구성 요소는 저장된 데이터를 처리하기 위해 프로세서에 의해 실행되는 프로그램을 저장할 수 있 다. 데이터베이스 구성 요소는 관계형이고 확장 가능하며 안전한 데이터베이스 형태로 구현될 수 있다. 이러 한 데이터베이스의 예로는 DB2, MySQL, Oracle, Sybase 등이 있다. 대안적으로, 데이터베이스는 어레이, 해시, 목록, 스택, 구조화된 텍스트 파일(예컨대, XML), 테이블 등과 같은 다양한 표준 데이터 구조를 사용하여 구현 될 수 있다. 이러한 데이터 구조는 메모리 및/또는 구조화된 파일에 저장될 수 있다. 제어기는 \"LAN\"(Local Area Network), \"WAN\"(Wide Area Network), 인터넷 등과 같은 통신 네트워크를 통 해 링크된 원격 처리 장치에 의해 태스크나 모듈이 수행되는 분산 컴퓨팅 환경에서 구현될 수 있다. 분산 컴퓨 팅 환경에서, 프로그램 모듈이나 하위 루틴은 로컬 및 원격 메모리 저장 장치 모두에 위치될 수 있다. 분산 컴 퓨팅은 처리를 위해 부하 균형 및/또는 집계 자원에 사용될 수 있다. 대안적으로, 제어기의 양태는 인터 넷이나 다른 네트워크(무선 네트워크 포함)를 통해 전자적으로 분산될 수 있다. 당업자는 대화형 게임 시스템 의 일부가 서버 컴퓨터에 상주할 수 있고, 대응하는 부분이 클라이언트 컴퓨터에 상주할 수 있음을 인식할 것이다. 제어기의 양태에 대한 특정한 데이터 구조 및 데이터의 전송은 또한 본 발명의 범주 내에 포함된다. 특정한 발명적 양태가 전술한 개시 내용으로부터 인식될 수 있으며, 그 중 다음과 같은 다양한 예가 있다. 도면에 제공된 기능 블록도, 운영 시나리오와 시퀀스, 및 흐름도는 본 발명의 새로운 양태를 수행하기 위한 예 시적인 시스템, 환경 및 방법론을 나타낸다. 설명을 단순화하기 위해, 여기에 포함된 방법은 기능 블록도, 운 영 시나리오나 시퀀스, 또는 흐름도의 형태일 수 있으며, 일련의 동작으로 설명될 수 있지만, 방법은 행위의 순 서로 제한되지 않으며, 그에 따라 일부 행위는 본 명세서에 도시되고 설명된 것과는 다른 순서 및/또는 다른 행 위와 동시에 발생할 수 있다. 당업자는 방법이 상태 다이어그램에서와 같이 일련의 상호 연관된 상태나 이벤트 로 대안적으로 표현될 수 있음을 이해하고 인식할 것이다. 더욱이, 방법론에 설명된 모든 행위가 새로운 구현 에 필요한 것은 아니다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13 도면14 도면15 도면16"}
{"patent_id": "10-2020-7025653", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 발명의 많은 양태는 다음 도면을 참조하여 더 잘 이해될 수 있다. 이들 도면과 관련하여 몇몇 구현예가 설 명되지만, 본 발명은 본 명세서에 개시된 구현예로 제한되지 않는다. 반대로, 의도하는 바는 모든 대안, 수정 및 등가물을 포괄하는 것이다. 도 1은 블록체인에 기록된 제한된 트랜잭션의 맞춤형 뷰를 생성하기 위해 향상된 애플리케이션을 구현하기 위한 운영 아키텍처를 도시한다. 도 2는 블록체인에 기록된 제한된 트랜잭션의 맞춤형 뷰를 생성하기 위해 향상된 애플리케이션의 구현예에 사용 되는 맞춤형 뷰 프로세스를 도시한다. 도 3은 블록체인에 기록된 제한된 트랜잭션의 맞춤형 뷰를 생성하기 위한 구현예에서 분산 원장 아키텍처의 다 양한 구성 요소를 도시한다. 도 4는 블록체인에 기록된 제한된 트랜잭션의 맞춤형 뷰를 생성하기 위한 향상된 애플리케이션 구현예의 블록도 를 도시한다. 도 5는 블록체인에 기록된 제한된 트랜잭션의 맞춤형 뷰를 생성하기 위한 향상된 애플리케이션 구현예의 흐름도 를 도시한다. 도 6은 블록체인에 기록된 제한된 트랜잭션의 맞춤형 뷰를 생성하기 위한 향상된 애플리케이션 구현예의 블록도 를 도시한다. 도 7은 블록체인에 기록된 제한된 트랜잭션의 맞춤형 뷰를 생성하기 위한 향상된 애플리케이션 구현예의 흐름도를 도시한다. 도 8은 블록체인에 기록된 제한된 트랜잭션의 맞춤형 뷰를 생성하기 위한 향상된 애플리케이션 구현예의 블록도 를 도시한다. 도 9는 블록체인에 기록된 제한된 트랜잭션의 맞춤형 뷰를 생성하기 위한 향상된 애플리케이션 구현예의 흐름도 를 도시한다. 도 10은 블록체인에 기록된 제한된 트랜잭션의 맞춤형 뷰를 생성하기 위한 재무 감사 시나리오의 구현예에서의 예시적인 운영 아키텍처를 도시한다. 도 11은 블록체인에 기록된 제한된 트랜잭션의 맞춤형 뷰를 생성하기 위한 게임 규제 시나리오의 구현예에서의 대안적인 운영 아키텍처를 도시한다. 도 12는 블록체인에 기록된 제한된 트랜잭션의 맞춤형 뷰를 생성하기 위한 인벤토리 추적 시나리오 구현예에서 의 대안적인 운영 아키텍처를 도시한다. 도 13은 블록체인에 기록된 제한된 트랜잭션의 예시적인 맞춤형 뷰를 도시한다. 도 14는 블록체인에 기록된 제한된 트랜잭션의 대안적인 맞춤형 뷰의 예시를 도시한다. 도 15는 블록체인에 기록된 제한적이거나 민감한 데이터의 맞춤형 뷰를 제공할 수 있는 데이터 액세스 시스템의 구현예에서의 대안적인 운영 아키텍처를 도시한다. 도 16은 도면에 예시되고 이하의 상세한 설명에서 논의되는 임의의 아키텍처, 프로세스, 운영 시나리오 및 운영 시퀀스를 포함하여 본 명세서에 개시된 기술을 구현하기에 적합한 컴퓨팅 시스템을 도시한다."}
