{"patent_id": "10-2024-7038257", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0012563", "출원번호": "10-2024-7038257", "발명의 명칭": "기본 안전 메시지의 프로세싱 관리", "출원인": "퀄컴 인코포레이티드", "발명자": "첸, 총"}}
{"patent_id": "10-2024-7038257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "기본 안전 메시지(basic safety message, BSM)의 프로세싱을 관리하기 위한 차량의 V2X(vehicle-to-everything) 시스템의 프로세서에 의해 수행되는 방법으로서,수신된 BSM의 관련성 값을, 상기 BSM의 보안 프로세싱을 행하기 전에 계산하는 단계;상기 BSM의 관련성 값이 관련성 임계치를 충족하는지 여부를 결정하는 단계; 및상기 BSM의 관련성 값이 상기 관련성 임계치를 충족하지 않는다고 결정하는 것에 응답하여, 보안 프로세싱을 수행하지 않고 상기 BSM의 프로세싱을 중지하는 단계를 포함하는, 방법."}
{"patent_id": "10-2024-7038257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 BSM의 관련성 값이 상기 관련성 임계치를 충족한다고 결정하는 것에 응답하여, 상기 BSM의 보안 프로세싱을 수행하고, 상기 BSM에 대해 오작동 검출 동작을 수행하는 단계를 추가로 포함하는, 방법."}
{"patent_id": "10-2024-7038257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 BSM의 보안 프로세싱을 수행하는 것은 상기 BSM의 암호화 검증을 수행하는 것을포함하는, 방법."}
{"patent_id": "10-2024-7038257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서, 상기 BSM에 대해 오작동 검출 동작을 수행하는 것은 상기 BSM의 의미론적 검증을 수행하는 것을 포함하는, 방법."}
{"patent_id": "10-2024-7038257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 수신된 BSM에 대한 관련성 값을 계산하는 단계는 상기 차량과 상기 BSM의 발신자의 역 충돌 시간(inverse time-to-collision)에 기초하여 상기 관련성 값을 계산하는 단계를 포함하는, 방법."}
{"patent_id": "10-2024-7038257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 수신된 BSM에 대한 관련성 값을 계산하는 단계는 상기 차량과 상기 BSM의 발신자의 상대속도를 상기 차량에서부터 상기 BSM의 발신자까지의 거리로 나눈 것에 기초하여 상기 관련성 값을 계산하는 단계를 포함하는, 방법."}
{"patent_id": "10-2024-7038257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 상기 V2X 통신 시스템의 프로세싱 능력 및 상기 차량의 기동 능력에 기초하여 상기 관련성 임계치를 결정하는 단계를 추가로 포함하는, 방법."}
{"patent_id": "10-2024-7038257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 V2X 통신 시스템의 반응 시간 및 상기 차량의 제동 시간에 기초하여 상기 관련성 임계치를 결정하는 단계를 추가로 포함하는, 방법."}
{"patent_id": "10-2024-7038257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "차량의 V2X 통신 시스템으로서,프로세서를 포함하고, 상기 프로세서는 프로세서 실행가능 명령들로, 수신된 BSM의 관련성 값을, 상기 BSM의 보안 프로세싱을 행하기 전에 계산하도록;공개특허 10-2025-0012563-3- 상기 BSM의 관련성 값이 관련성 임계치를 충족하는지 여부를 결정하도록; 그리고 상기 BSM의 관련성 값이 상기 관련성 임계치를 충족하지 않는다고 결정하는 것에 응답하여, 보안 프로세싱을수행하지 않고 상기 BSM의 프로세싱을 중지하도록 구성되는, V2X 통신 시스템."}
{"patent_id": "10-2024-7038257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 프로세서는 프로세서 실행가능 명령들로, 상기 BSM의 관련성 값이 상기 관련성 임계치를충족한다고 결정하는 것에 응답하여, 상기 BSM의 보안 프로세싱을 수행하도록, 그리고 상기 BSM에 대해 오작동검출 동작을 수행하도록 추가로 구성되는, V2X 통신 시스템."}
{"patent_id": "10-2024-7038257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서, 상기 프로세서는 프로세서 실행가능 명령들로, 상기 BSM의 암호화 검증을 수행하도록 추가로구성되는, V2X 통신 시스템."}
{"patent_id": "10-2024-7038257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항에 있어서, 상기 프로세서는 프로세서 실행가능 명령들로, 상기 BSM의 의미론적 검증을 수행하도록 추가로 구성되는, V2X 통신 시스템."}
{"patent_id": "10-2024-7038257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제9항에 있어서, 상기 프로세서는 프로세서 실행가능 명령들로, 상기 차량과 상기 BSM의 발신자의 역 충돌 시간에 기초하여 상기 관련성 값을 계산하도록 추가로 구성되는, V2X 통신 시스템."}
{"patent_id": "10-2024-7038257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제9항에 있어서, 상기 프로세서는 프로세서 실행가능 명령들로, 상기 차량과 상기 BSM의 발신자의 상대 속도를상기 차량에서부터 상기 BSM의 발신자까지의 거리로 나눈 것에 기초하여 상기 관련성 값을 계산하도록 추가로구성되는, V2X 통신 시스템."}
{"patent_id": "10-2024-7038257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제9항에 있어서, 상기 프로세서는 프로세서 실행가능 명령들로, 상기 V2X 통신 시스템의 프로세싱 능력 및 상기차량의 기동 능력에 기초하여 상기 관련성 임계치를 결정하도록 추가로 구성되는, V2X 통신 시스템."}
{"patent_id": "10-2024-7038257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제9항에 있어서, 상기 프로세서는 프로세서 실행가능 명령들로, 상기 V2X 통신 시스템의 반응 시간 및 상기 차량의 제동 시간에 기초하여 상기 관련성 임계치를 결정하도록 추가로 구성되는, V2X 통신 시스템."}
{"patent_id": "10-2024-7038257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "차량의 V2X 시스템으로서,수신된 BSM의 관련성 값을, 상기 BSM의 보안 프로세싱을 행하기 전에 계산하기 위한 수단;상기 BSM의 관련성 값이 관련성 임계치를 충족하는지 여부를 결정하기 위한 수단; 및상기 BSM의 관련성 값이 상기 관련성 임계치를 충족하지 않는다고 결정하는 것에 응답하여, 보안 프로세싱을 수행하지 않고 상기 BSM의 프로세싱을 중지하기 위한 수단을 포함하는, V2X 통신 시스템."}
{"patent_id": "10-2024-7038257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서, 상기 BSM의 관련성 값이 상기 관련성 임계치를 충족한다고 결정하는 것에 응답하여, 상기 BSM의 보안 프로세싱을 수행하고, 상기 BSM에 대해 오작동 검출 동작을 수행하기 위한 수단을 추가로 포함하는,V2X 통신 시스템."}
{"patent_id": "10-2024-7038257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에 있어서, 상기 BSM의 보안 프로세싱을 수행하기 위한 수단은 상기 BSM의 암호화 검증을 수행하기 위한공개특허 10-2025-0012563-4-수단을 포함하는, V2X 통신 시스템."}
{"patent_id": "10-2024-7038257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제18항에 있어서, 상기 BSM에 대해 오작동 검출 동작을 수행하기 위한 수단은 상기 BSM의 의미론적 검증을 수행하기 위한 수단을 포함하는, V2X 통신 시스템."}
{"patent_id": "10-2024-7038257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제17항에 있어서, 상기 수신된 BSM에 대한 관련성 값을 계산하기 위한 수단은 상기 차량과 상기 BSM의 발신자의역 충돌 시간에 기초하여 상기 관련성 값을 계산하기 위한 수단을 포함하는, V2X 통신 시스템."}
{"patent_id": "10-2024-7038257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제17항에 있어서, 상기 수신된 BSM에 대한 관련성 값을 계산하기 위한 수단은 상기 차량과 상기 BSM의 발신자의상대 속도를 상기 차량에서부터 상기 BSM의 발신자까지의 거리로 나눈 것에 기초하여 상기 관련성 값을 계산하기 위한 수단을 포함하는, V2X 통신 시스템."}
{"patent_id": "10-2024-7038257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제17항에 있어서, 상기 V2X 통신 시스템의 프로세싱 능력 및 상기 차량의 기동 능력에 기초하여 상기 관련성 임계치를 결정하기 위한 수단을 추가로 포함하는, V2X 통신 시스템."}
{"patent_id": "10-2024-7038257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제17항에 있어서, 상기 V2X 통신 시스템의 반응 시간 및 상기 차량의 제동 시간에 기초하여 상기 관련성 임계치를 결정하기 위한 수단을 추가로 포함하는, V2X 통신 시스템."}
{"patent_id": "10-2024-7038257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "프로세서 실행가능 명령들이 저장된 비일시적 프로세서 판독가능 저장 매체로서, 상기 저장된 프로세서 실행가능 명령들은 차량의 V2X 통신 시스템의 프로세서로 하여금,수신된 BSM의 관련성 값을, 상기 BSM의 보안 프로세싱을 행하기 전에 계산하는 것;상기 BSM의 관련성 값이 관련성 임계치를 충족하는지 여부를 결정하는 것; 및상기 BSM의 관련성 값이 상기 관련성 임계치를 충족하지 않는다고 결정하는 것에 응답하여, 보안 프로세싱을 수행하지 않고 상기 BSM의 프로세싱을 중지하는 것을 포함하는 동작들을 수행하게 하도록 구성되는, 비일시적 프로세서 판독가능 저장 매체."}
{"patent_id": "10-2024-7038257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "제25항에 있어서, 상기 저장된 프로세서 실행가능 명령들은 상기 V2X 통신 시스템의 프로세서로 하여금, 상기BSM의 관련성 값이 상기 관련성 임계치를 충족한다고 결정하는 것에 응답하여, 상기 BSM의 보안 프로세싱을 수행하는 것, 그리고 상기 BSM에 대해 오작동 검출 동작을 수행하는 것을 추가로 포함하는 동작들을 수행하게 하도록 추가로 구성되는, 비일시적 프로세서 판독가능 저장 매체."}
{"patent_id": "10-2024-7038257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "제25항에 있어서, 상기 저장된 프로세서 실행가능 명령들은 상기 V2X 통신 시스템의 프로세서로 하여금, 상기수신된 BSM에 대한 관련성 값을 계산하는 것이 상기 V2X 통신 시스템을 포함하는 차량과 상기 BSM의 발신자의역 충돌 시간에 기초하여 상기 관련성 값을 계산하는 것을 포함하도록 하는 동작들을 수행하게 하도록 추가로구성되는, 비일시적 프로세서 판독가능 저장 매체."}
{"patent_id": "10-2024-7038257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_28", "content": "제25항에 있어서, 상기 저장된 프로세서 실행가능 명령들은, 상기 V2X 통신 시스템의 프로세서로 하여금, 상기수신된 BSM에 대한 관련성 값을 계산하는 것이 상기 V2X 통신 시스템을 포함하는 차량과 상기 BSM의 발신자의상대 속도를 상기 차량에서부터 상기 BSM의 발신자까지의 거리로 나눈 것에 기초하여 상기 관련성 값을 계산하공개특허 10-2025-0012563-5-는 것을 포함하도록 동작들을 수행하게 하도록 추가로 구성되는, 비일시적 프로세서 판독가능 저장 매체."}
{"patent_id": "10-2024-7038257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "제25항에 있어서, 상기 저장된 프로세서 실행가능 명령들은 상기 V2X 통신 시스템의 프로세서로 하여금, 상기V2X 통신 시스템의 프로세싱 능력 및 상기 차량의 기동 능력에 기초하여 상기 관련성 임계치를 결정하는 것을추가로 포함하는 동작들을 수행하게 하도록 추가로 구성되는, 비일시적 프로세서 판독가능 저장 매체."}
{"patent_id": "10-2024-7038257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_30", "content": "제25항에 있어서, 상기 저장된 프로세서 실행가능 명령들은 상기 V2X 통신 시스템의 프로세서로 하여금, 상기V2X 통신 시스템의 반응 시간 및 상기 차량의 제동 시간에 기초하여 상기 관련성 임계치를 결정하는 것을 추가로 포함하는 동작들을 수행하게 하도록 추가로 구성되는, 비일시적 프로세서 판독가능 저장 매체."}
{"patent_id": "10-2024-7038257", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "다양한 실시예들은 기본 안전 메시지(BSM)의 프로세싱을 관리하기 위한 차량의 V2X 시스템을 위한 방법들 및 시 스템들을 포함한다. 다양한 실시예들은 수신된 BSM의 관련성 값을, BSM의 보안 프로세싱을 행하기 전에 계산하 는 것, BSM의 관련성 값이 관련성 임계치를 충족하는지 여부를 결정하는 것, 및 BSM의 관련성 값이 관련성 임계 치를 충족하지 않는다고 결정하는 것에 응답하여, BSM의 프로세싱을 중지하는 것을 포함할 수 있다."}
{"patent_id": "10-2024-7038257", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "관련 출원들 본 출원은 2022년 5월 26일자로 출원된 미국 정규 출원 제17/804,108호의 우선권의 이익을 주장하며; 그 전체 내용은 본 명세서에 참조로 포함된다."}
{"patent_id": "10-2024-7038257", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "V2X(Vehicle-to-Everything) 시스템들은 C-V2X(Cellular Vehicle-to-Everything), DSRC(Dedicated Short Range Communication), 및 ITS-G5와 같은 관련 표준 하에서 정의된 프로토콜들 및 메시징을 채용할 수 있다. 이러한 표준은 차량 기반 무선 통신을 위한 기초로서 역할을 하고, 지능형 고속도로와 자율 및 반자율 주행 차 량을 지원하며 고속도로 교통 시스템의 전반적인 효율 및 안전을 개선하는 데 사용될 수 있다. V2X 통신 시스 템들의 엘리먼트(element)는 기본 안전 메시지(Basic Safety Messages, BSM) 또는 협력 인식 메시지 (Cooperative Awareness Message, CAM)와 같은 교통 안전을 개선하기 위해 다른 차량들이 수신하고 프로세싱할 수 있는 V2X 메시지들을 차량이 브로드캐스팅할 수 있는 능력이다. V2X 통신 시스템들은 다른 차량으로부터 또는 노변 유닛(Roadside Unit, RSU)들과 같은 ITS(Intelligent Transportation System) 인프라구조 디바이스들로부터 수신된 BSM 또는 CAM 내에서 부정확하거나 의도적으로 잘 못된 정보를 검출하도록 구성될 수 있다. 그러나, 부정확하거나 잘못된 정보를 검출하기 위한 BSM들 또는 CAM 들의 프로세싱은 컴퓨팅 리소스 집약적이다. 수신 차량의 안전 또는 동작들과 무관한 BSM들 또는 CAM들을 불필 요하게 프로세싱하는 것은 유한한 V2X 컴퓨팅 리소스들을 소비한다. 다양한 양태들은 기본 안전 메시지(BSM)의 프로세싱을 관리하기 위한 V2X 통신 시스템의 프로세서에 의해 수행 될 수 있는 방법들을 포함한다. 다양한 양태들은, V2X 통신 시스템 프로세서가, 수신된 BSM의 관련성 값을, BSM의 보안 프로세싱을 행하기 전에 계산하는 것, BSM의 관련성 값이 관련성 임계치를 충족하는지 여부를 결정 하는 것, 및 BSM의 관련성 값이 관련성 임계치를 충족하지 않는다고 결정하는 것에 응답하여, BSM의 프로세싱을 중지하는 것을 포함할 수 있다. 일부 양태들은, BSM의 관련성 값이 관련성 임계치를 충족한다고 결정하는 것에 응답하여, BSM의 보안 프로세싱 을 수행하는 것, 그리고 BSM에 대해 오작동 검출 동작을 수행하는 것을 포함할 수 있다. 일부 양태들에서, BSM 의 보안 프로세싱을 수행하는 것은 BSM의 암호화 검증을 수행하는 것을 포함할 수 있다. 일부 양태들에서, BSM 에 대해 오작동 검출 동작을 수행하는 것은 BSM의 의미론적 검증을 수행하는 것을 포함할 수 있다. 일부 양태들에서, 수신된 BSM에 대한 관련성 값을 계산하는 것은 차량과 BSM의 발신자의 역 충돌 시간(inverse time-to-collision)에 기초하여 관련성 값을 계산하는 것을 포함할 수 있다. 일부 양태들에서, 수신된 BSM에 대한 관련성 값을 계산하는 것은 차량과 BSM의 발신자의 상대 속도를 차량에서부터 BSM의 발신자까지의 거리로 나눈 것에 기초하여 관련성 값을 계산하는 것을 포함할 수 있다. 일부 양태들은 V2X 통신 시스템의 프로세싱 능력 및 차량의 기동 능력에 기초하여 관련성 임계치를 결정하는 것을 포함할 수 있다. 일부 양태들은 V2X 통신 시스템 및/또는 차량 자율/반자율 주행 시스템의 반응 시간 및 차량의 제동 시간에 기초하여 관련성 임계치 를 결정하는 것을 포함할 수 있다."}
{"patent_id": "10-2024-7038257", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "추가 양태는 메모리 및 위에서 요약된 방법 중 임의의 방법의 동작을 수행하도록 구성된 프로세서를 포함하는"}
{"patent_id": "10-2024-7038257", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 3, "content": "차량 프로세싱 시스템을 포함한다. 추가의 양태들은 위에서 요약된 방법들 중 임의의 방법에 대응하는 기능들 을 수행하기 위한 다양한 수단을 갖는 차량 V2X 통신 시스템을 포함할 수 있다. 추가의 양태들은 차량 V2X 통"}
{"patent_id": "10-2024-7038257", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 4, "content": "신 시스템의 프로세서로 하여금 위에서 요약된 방법들 중 임의의 방법에 대응하는 다양한 동작들을 수행하게 하 도록 구성된 프로세서 실행가능 명령들이 저장된 비일시적 프로세서 판독가능 저장 매체를 포함할 수 있다."}
{"patent_id": "10-2024-7038257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "다양한 실시예들을 첨부 도면을 참조하여 상세히 설명할 것이다. 가능하다면, 동일한 참조 번호는 도면 전체에 걸쳐 동일하거나 유사한 부분을 나타내는 데 사용될 것이다. 특정 예 및 구현예와 관련된 언급은 예시적인 목 적을 위한 것이고, 청구범위의 범주를 제한하도록 의도되지 않는다. 다양한 실시예들은 기본 안전 메시지(BSM) 또는 협력 인식 메시지(CAM)(본 명세서에서 집합적으로 \"기본 안전 메시지\" 또는 \"BSM\"으로 지칭됨)와 같은 V2X 메시지의 프로세싱을 관리하기 위한 차량 V2X 통신 시스템의 방법 들 및 프로세서들을 포함하며, 이에 따라, V2X 통신 시스템은 수신된 BSM의 관련성에 기초하여 수신된 BSM에 대 해 보안 프로세싱 및 오작동 검출을 선택적으로 수행하여, 컴퓨테이션(computation) 비용 및 리소스 소비를 감 소시키게 된다. 본 명세서에서 사용되는 바와 같이, 용어 \"차량\"은 대체적으로 오작동 보고들의 송신을 관리하도록 구성될 수 있는 자동차, 오토바이, 트럭, 버스, 열차, 보트, 및 임의의 다른 타입의 차량 V2X 가능 시스템 중 임의의 것을 지칭한다. 용어 \"시스템 온 칩(SOC)\"은 본 명세서에서 단일 기판 상에 집적된 다수의 리소스 및/또는 프로세서를 포함하는 단일 집적 회로(IC) 칩을 나타내는 데 사용된다. 단일 SOC는 디지털, 아날로그, 혼합 신호, 및 라디오 주파수 기능을 위한 회로를 포함할 수 있다. 단일 SOC는 또한, 임의의 수의 범용 및/또는 특수 프로세서(디지털 신호 프로세서(digital signal processor, DSP), 모뎀 프로세서, 비디오 프로세서 등), 메모리 블록(예를 들어, ROM, RAM, 플래시 등), 및 리소스(예를 들어, 타이머, 전압 조정기, 발진기 등)를 포함할 수 있다. SOC는 또한집적된 리소스 및 프로세서를 제어할 뿐만 아니라 주변 디바이스를 제어하기 위한 소프트웨어를 포함할 수 있다. 용어 \"시스템 인 패키지(system in a package, SIP)\"는 본 명세서에서 둘 이상의 IC 칩들, 기판들, 또는 SOC들 상의 다수의 리소스들, 컴퓨테이셔널 유닛(computational unit)들, 코어들, 및/또는 프로세서들을 포함하는 단 일 모듈 또는 패키지를 지칭하는 데 사용될 수 있다. 예를 들어, SIP는 다수의 IC 칩 또는 반도체 다이가 수직 구성으로 적층되는 단일 기판을 포함할 수 있다. 유사하게, SIP는 다수의 IC 또는 반도체 다이가 통합 기판으 로 패키징되는 하나 이상의 MCM(multi-chip module)을 포함할 수 있다. SIP는 또한, 고속 통신 회로부를 통해 서로 커플링되며, 예컨대 단일 마더보드 상에 또는 단일 무선 디바이스 내에, 매우 근접하게 패키징되는 다수의 독립적인 SOC들을 포함할 수 있다. SOC의 근접성은 고속 통신 및 메모리와 리소스의 공유를 용이하게 한다. V2X 통신들에서, V2X 통신 시스템들은 BSM들이 신뢰할만하고 신뢰가능한지 여부를 결정하기 위해 보안 프로세싱 (예를 들어, 하나 이상의 암호화 검증 및/또는 검증 동작들) 및 하나 이상의 오작동 검출 동작들(예를 들어, BSM들의 의미론적 검증, 인증 동작들, 무결성 결정 동작들, 부인방지 결정 동작들 등)을 수행함으로써 수신된 BSM들을 평가한다. V2X 통신 시스템은 전형적으로 V2X 차량 시스템들, 노변 유닛(RSU)들, 기지국들, 및 V2X 통 신 시스템의 다른 참여자들을 포함하며, V2X 통신량은 많을 수 있다. 보안 프로세싱 및 오작동 검출을 수행하 는 것은 수신 V2X 통신 시스템의 상당한 양의 컴퓨테이셔널 리소스들을 소비할 수 있다. 다양한 실시예들은, 차량 프로세싱 시스템에 의해 수신된 BSM이 차량에 관련되는지 여부에 기초하여, BSM에 대 해 보안 프로세싱뿐만 아니라 오작동 검출 프로세싱을 선택적으로 수행하도록 구성된 차량 V2X 통신 수신 및 프 로세싱 시스템(\"V2X 통신 시스템\")을 포함한다. 다양한 실시예들에서, V2X 통신 시스템은, 수신된 BSM이, V2X 통신 시스템이 BSM에 대해 보안 프로세싱, 의미론적 검증, 및 오작동 검출을 수행해야 할 정도의 관련성 또는 중요성 레벨로 상승하는지 여부를 결정할 수 있다. V2X 통신 시스템들에 대한 기술 표준들은 전형적으로, 수신 된 BSM에 대해 보안 프로세싱을 수행하는 것, 및 이어서 BSM이 보안 프로세싱 동작들을 통과하는 경우 BSM에 대 해 의미론적 검증 및 오작동 검출을 수행하는 것을 요구한다. 다양한 실시예들은, V2X 통신 시스템이 V2X 통신 시스템과 무관하다고 결정하는 BSM들을 프로세싱하는 데 달리 사용될 프로세싱 리소스들을, V2X 통신 시스템이 보존할 수 있게 한다. 일부 실시예들에서, V2X 통신 시스템은 수신된 BSM의 관련성 값을, BSM의 보안 프로세싱 및 의미론적 검증을 행하기 전에 계산하고, BSM의 관련성 값이 관련성 임계치를 충족하는지 여부를 결정하고, BSM의 관련성 값이 관련성 임계치를 충족하지 않는다고 결정하는 것에 응답하여 보안 프로세싱 및 의미론적 검 증을 행하기 전에 BSM의 프로세싱을 중지할 수 있다. 일부 실시예들에서, V2X 통신 시스템은, BSM의 관련성 값 이 관련성 임계치를 충족한다고 결정하는 것에 응답하여, BSM의 보안 프로세싱을 행하거나 수행할 수 있고, BSM 에 대해 의미론적 검증 및 하나 이상의 오작동 검출 동작들을 수행할 수 있다. 일부 실시예들에서, BSM의 보안 프로세싱을 행하는 것은, BSM의 관련성 값이 관련성 임계치를 충족한다고 결정 하는 것에 응답하여, BSM의 암호화 검증을 수행하는 것을 포함할 수 있다. 예를 들어, BSM은 디지털 서명 또는 인증 코드를 포함할 수 있다. 일부 실시예들에서, V2X 통신 시스템은 BSM의 의미론적 검증을 수행할 수 있다. 예를 들어, V2X 통신 시스템은, BSM의 관련성 값이 관련성 임계치를 충족한다고 결정하는 것에 응답하여, BSM의 디지털 서명 또는 인증 코드를 검증하거나 입증하기 위한 하나 이상의 동작들을 수행할 수 있다(예를 들어, BSM 의 의미론적 검증을 수행함). 일부 실시예들에서, 수신된 BSM에 대한 관련성 값을 계산하는 것은, 차량과 BSM의 발신자의 역 충돌 시간에 기 초하여 관련성 값을 계산하는 것을 포함할 수 있다. 일부 실시예들에서, V2X 통신 시스템은 차량과 BSM의 발신 자의 상대 속도를 차량에서부터 BSM의 발신자까지의 거리로 나눈 것에 기초하여 관련성 값을 계산할 수 있다. 예를 들어, V2X 통신 시스템은 관련성 값을 다음과 같이 표현할 수 있으며,"}
{"patent_id": "10-2024-7038257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기서 relativeSpeed는 수신 V2X 통신 시스템과 BSM의 발신자의 상대 속도를 표현하며, distance는 수신 V2X 통신 시스템과 BSM의 발신자 사이의 거리를 표현한다. 일부 실시예들에서, V2X 통신 시스템은 수신된 BSM의 속 도 필드의 값에 기초하여 BSM의 발신자의 속도를 결정할 수 있다. 일부 실시예들에서, V2X 통신 시스템은 V2X 통신 시스템의 위치 정보(예를 들어, 글로벌 포지셔닝 시스템(Global Positioning System, GPS) 정보, 기지국 삼각측량 정보, 노변 유닛(RSU)과 같은 V2X 인프라구조로부터의 위치 정보 등)뿐만 아니라, 수신된 BSM의 포지 션 필드의 값에 기초하여 V2X 수신기와 BSM의 발신자 사이의 거리를 결정할 수 있다. 일부 실시예들에서, 관련성 값이 낮을수록, BSM의 관련성이 적어지고, V2X 통신 시스템에 의해 BSM을 프로세싱하는 것이 덜 긴급해지며; 이에 반해, 관련성 값이 높을수록, BSM의 관련성이 많아지고, V2X 통신 시스템에 의해 BSM을 프로세싱하는 것이 더 긴급해진다. 상기에 언급된 바와 같이, V2X 통신 시스템은 BSM의 관련성 값이 관련성 임계치를 충족하는지 여부를 결정할 수 있다. 일부 실시예들에서, V2X 통신 시스템은 V2X 통신 시스템의 프로세싱 능력 및 차량의 기동 능력에 기초하 여 관련성 임계치를 결정할 수 있다. 예를 들어, V2X 통신 시스템은 프로세싱 속도, 프로세싱 용량, 컴퓨트 처 리량을 표현하는 하나 이상의 메트릭들 또는 값들, 또는 V2X 통신 시스템 또는 차량 자율/반자율 주행 프로세싱 시스템의 프로세싱 능력을 표현하는 다른 적합한 값을 결정할 수 있다. V2X 통신 시스템은 또한, 정지 거리, 최대 달성가능 감속 레이트, 기동 능력, 차량의 속도 등과 같은 차량의 기동 능력을 표현하는 하나 이상의 메트 릭들 또는 값들을 결정할 수 있다. 일부 실시예들에서, V2X 통신 시스템은 또한 차량의 기동 능력의 결정에서 교통 조건들 또는 환경 조건들에 기 초하여 하나 이상의 값들을 결정할 수 있다. 예를 들어, 최대 달성가능 감속 레이트는 차량의 제동 능력 및 또 한 다양한 환경 조건들(예를 들어, 젖은 또는 빙판 도로들은 최대 달성가능 감속 레이트를 감소시킬 수 있음)에 의존할 수 있다. 다른 예로서, 교통량이 많거나 혼잡한 교통 조건들은 안전하게 제동하거나 방향을 바꾸는 차 량의 능력을 감소시켜, 차량의 기동 능력을 감소시킬 수 있다. 일부 실시예들에서, V2X 통신 시스템은 V2X 통신 시스템의 반응 시간 및 차량의 제동 시간에 기초하여 관련성 임계치를 결정할 수 있다. 예를 들어, V2X 통신 시스템은 관련성 임계치를 다음과 같이 표현할 수 있으며:"}
{"patent_id": "10-2024-7038257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "여기서 α는 관련성 임계치를 표현하며, rt는 V2X 통신 시스템의 반응 시간의 값을 표현하며, bt는 차량의 제동 시간의 값을 표현하며, c는 1보다 크거나 같을 수 있는 상수를 표현한다. 제동 시간은 차량이 완전히 정지하는 데 요구되는 시간량일 수 있다. 일부 실시예들에서, 제동 시간은 차량이 V2X 통신 시스템과 BSM의 발신자 사이 에서 실질적으로 제로(zero)인 상대 속도를 달성하는 데 요구되는 시간량일 수 있다. 일부 실시예들에서, 제동 시간은, 차량이 BSM의 발신자와의 충돌을 회피하기 위해 충분히 제동하는 데 요구되는 시간량일 수 있다. 다양한 실시예들은, V2X 통신 시스템들이 BSM에 대해 보안 프로세싱 및/또는 하나 이상의 오작동 검출 동작들을 수행하기 위해 유한한 컴퓨팅 리소스들을 사용할지 여부를 동적으로 결정할 수 있게 하여, 차량에 대해 관련성 이 낮거나 없는 BSM들의 보안 프로세싱을 수행하는 데 요구되는 컴퓨팅 리소스들을 절약함으로써, 차량들 내의 V2X 통신 시스템들의 동작을 개선할 수 있다. 다양한 실시예들은, V2X 통신 시스템이 V2X 통신 시스템과 무관 하다고 결정하는 BSM들을 프로세싱하는 데 달리 사용될 프로세싱 리소스들을, V2X 통신 시스템이 보존할 수 있 게 한다. 도 1a는 다양한 실시예들을 구현하기에 적합한 예시적인 통신 시스템을 예시하는 시스템 블록도이다. 통 신 시스템은 5G 뉴 라디오(New Radio, NR) 네트워크, ITS V2X 무선 네트워크, 및/또는 롱 텀 에볼루션 (Long-Term Evolution, LTE) 네트워크와 같은 임의의 다른 적합한 네트워크를 포함한다. 하기의 설명들에서 5G 네트워크 및 5G 네트워크 엘리먼트들에 대한 참조는 예시적인 목적들을 위한 것이며, 제한하는 것으로 의도되지 않는다. 통신 시스템은 코어 네트워크, 다수의 기지국들, 및 무선 통신 능력들을 포함하는 V2X 통신 시 스템을 장착한 차량을 포함한 다양한 모바일 디바이스를 포함하는 이종 네트워크 아키텍처를 포함할 수 있다. 기지국은 유선 통신 링크를 통해 코어 네트워크와 통신할 수 있다. 통신 시스템 은 또한 V2X 무선 통신 링크들을 통해 차량들과의 V2X 통신들을 지원하는 노변 유닛들을 포함할 수 있다. 기지국은 무선 통신 링크를 통해 무선 디바이스들(예를 들어, 차량의 V2X 통신 시스템)과 통신하는 네트워크 엘리먼트이고, 노드 B, LTE 진화된 노드B(eNodeB 또는 eNB), 액세스 포인트(access point, AP), 라디오 헤드, 송신 수신 포인트(transmit receive point, TRP), 뉴 라디오 기지국(NR BS), 5G 노드B(NB), 차세대 노드B(gNodeB, gNB) 등으로 지칭될 수 있다. 각각의 기지국은 특정 지리적 영역 또는 \"셀\"에 대한 통신 커버리지를 제공할 수 있다. 3GPP에서, 용어 \"셀\"은 그 용어가 사용되는 맥락에 따라, 기지국의 커버리지 영역, 이 커버리지 영역을 서빙하는 기지국 서브시스템, 또는 이들의 조합을 지칭할 수 있다. 코어 네트워크 는 LTE 코어 네트워크(예를 들어, EPC(Evolved Packet Core) 네트워크), 5G 코어 네트워크, 도 1b를 참조하여 설명된 바와 같은 디스어그리게이팅된 네트워크 등과 같은 임의의 타입의 코어 네트워크일 수 있다. 노변 유닛들은 유선 또는 무선 통신 링크를 통해 코어 네트워크와 통신할 수 있다. 노변 유닛 들은 V2X 통신 시스템 자율 및 반자율 주행 기능들에 유용한 정보를 다운로드하기 위해 그리고 V2X 통신 시스템으로부터 오작동 보고들과 같은 정보를 수신하기 위해 V2X 무선 통신 링크들을 통해 V2X 통신 시스템 장착 차량들과 통신할 수 있다. 오작동 기관 네트워크 컴퓨팅 디바이스(Misbehavior Authority network computing device, MA)는 유선 또 는 무선 통신 링크를 통해 코어 네트워크와 통신할 수 있다. MA는 때때로 V2X 통신 시스템 에 의해 전송될 수 있는 바와 같은 오작동 보고들을 V2X 통신 시스템으로부터 수신할 수 있다. 무선 통신 링크들은 복수의 캐리어 신호들, 주파수들, 또는 주파수 대역들을 포함할 수 있고, 이들의 각각 은 복수의 논리 채널들을 포함할 수 있다. 무선 통신 링크들(122, 124)은 하나 이상의 라디오 액세스 기술 (radio access technology, RAT)들을 활용할 수 있다. 무선 통신 링크에서 사용될 수 있는 RAT들의 예들은 3GPP LTE, 3G, 4G, 5G(예컨대, NR), GSM, 코드 분할 다중 액세스(Code Division Multiple Access, CDMA), 광대 역 코드 분할 다중 액세스(Wideband Code Division Multiple Access, WCDMA), WiMAX(Worldwide Interoperability for Microwave Access), 시간 분할 다중 액세스(Time Division Multiple Access, TDMA), 및 다른 모바일 텔레포니 통신 기술 셀룰러 RAT들을 포함한다. 통신 시스템 내의 다양한 무선 통신 링크들 중 하나 이상에서 사용될 수 있는 RAT의 다른 예는 Wi-Fi, LTE-U, LTE-Direct, LAA, MuLTEfire, 및 지그비, 블 루투스, 및 블루투스 저에너지(LE)와 같은 비교적 단거리 RAT과 같은 중거리 프로토콜을 포함한다. 도 1b는 다양한 실시예들 중 임의의 것에 따른, 지도 데이터를 차량들에 통신하기에 그리고 업데이트된 객체/특 징 위치 데이터를 통신하기에 적합한 V2X 및/또는 5G 네트워크의 일부일 수 있는 예시적인 디스어그리게이팅된 기지국 아키텍처를 예시하는 시스템 블록도이다. 도 1a 및 도 1b를 참조하면, 디스어그리게이팅된 기지국 아키텍처는, 백홀 링크를 통해 코어 네트워크와 직접적으로, 또는 E2 링크를 통한 근-실시간(Near- Real Time, Near-RT) RAN 지능형 제어기(RAN Intelligent Controller, RIC), 또는 서비스 관리 및 오케스 트레이션(Service Management and Orchestration, SMO) 프레임워크와 연관된 비-실시간(Non-Real Time, Non-RT) RIC, 또는 둘 모두와 같은 하나 이상의 디스어그리게이팅된 기지국 유닛들을 통해 코어 네트워크 와 간접적으로 통신할 수 있는 하나 이상의 중앙 유닛(central unit, CU)들을 포함할 수 있다. CU는 F1 인터페이스와 같은 각자의 미드홀 링크들을 통해 하나 이상의 분산형 유닛(distributed unit, D U)들과 통신할 수 있다. DU들은 각자의 프론트홀 링크들을 통해 하나 이상의 라디오 유닛(radio unit, RU)들과 통신할 수 있다. RU들은 하나 이상의 라디오 주파수(radio frequency, RF) 액세스 링크들을 통해 각자의 UE들과 통신할 수 있다. 일부 구현예들에서, V2X 통신 시스템과 같은 사용자 장비(user equipment, UE)는 다수의 RU들에 의해 동시에 서빙될 수 있다. 유닛들(즉, CU들, DU들, RU들)뿐만 아니라 근-RT RIC들, 비-RT RIC들 및 SMO 프레임 워크 각각은 유선 또는 무선 송신 매체를 통해 신호들, 데이터 또는 정보(집합적으로 신호들)를 수신 또는 송신하도록 구성된 하나 이상의 인터페이스들을 포함하거나, 하나 이상의 인터페이스들에 커플링될 수 있다. 유닛들 각각, 또는 유닛들의 통신 인터페이스들에 명령들을 제공하는 연관된 프로세서 또는 제어기는 송신 매체 를 통해 다른 유닛들 중 하나 이상과 통신하도록 구성될 수 있다. 예를 들어, 유닛들은 다른 유닛들 중 하나 이상에 대한 유선 송신 매체를 통해 신호들을 수신 또는 송신하도록 구성된 유선 인터페이스를 포함할 수 있다. 추가적으로, 유닛들은 다른 유닛들 중 하나 이상에 대한 무선 송신 매체를 통해 신호들을 수신 또는 송신하거나, 또는 둘 모두를 행하도록 구성된 수신기, 송신기 또는 트랜시버(이를테면, 라디오 주파수(RF) 트랜 시버)를 포함할 수 있는 무선 인터페이스를 포함할 수 있다. 일부 양태들에서, CU는 하나 이상의 상위 계층 제어 기능들을 호스팅할 수 있다. 이러한 제어 기능들은 RRC(radio resource control), PDCP(packet data convergence protocol), SDAP(service data adaptation protocol) 등을 포함할 수 있다. 각각의 제어 기능은 CU에 의해 호스팅되는 다른 제어 기능들과 신호들을 통신하도록 구성된 인터페이스로 구현될 수 있다. CU는 사용자 평면 기능(즉, CU-UP(Central Unit ― User Plane)), 제어 평면 기능(즉, CU-CP(Central Unit ― Control Plane)), 또는 이들의 조합을 핸들링하도록 구성될 수 있다. 일부 구현예들에서, CU는 하나 이상의 CU-UP 유닛들 및 하나 이상의 CU-CP 유닛들로 논 리적으로 분할될 수 있다. CU-UP 유닛은 O-RAN 구성으로 구현될 때 E1 인터페이스와 같은 인터페이스를 통해 CU-CP 유닛과 양방향으로 통신할 수 있다. CU는, 필요에 따라, 네트워크 제어 및 시그널링을 위해 DU들 과 통신하도록 구현될 수 있다.DU는 하나 이상의 RU들의 동작을 제어하기 위한 하나 이상의 기지국 기능들을 포함하는 논리 유닛에 대응할 수 있다. 일부 양태들에서, DU는 3GPP(3rd Generation Partnership Project)에 의해 정의된 것들 과 같이 기능 분할에 적어도 부분적으로 의존하여, RLC(radio link control) 계층, MAC(medium access control) 계층, 및 하나 이상의 높은 PHY(physical) 계층들(예를 들어, FEC(forward error correction) 인코딩 및 디코딩, 스크램블링, 변조 및 복조 등을 위한 모듈들) 중 하나 이상을 호스팅할 수 있다. 일부 양태들에서, DU는 하나 이상의 낮은 PHY 계층들을 추가로 호스팅할 수 있다. 각각의 계층(또는 모듈)은 DU에 의 해 호스팅되는 다른 계층들(및 모듈들)과 또는 CU에 의해 호스팅되는 제어 기능들과 신호들을 통신하도록 구성된 인터페이스로 구현될 수 있다. 하위 계층 기능은 하나 이상의 RU들에 의해 구현될 수 있다. 일부 배치들에서, DU에 의해 제어되는 RU는, 하위 계층 기능 분할과 같은 기능 분할에 적어도 부분적으로 기초하여, RF 프로세싱 기능들, 또는 낮은-PHY 계층 기능들(예컨대, 고속 푸리에 변환(fast Fourier transform, FFT), 역 FFT(iFFT), 디지털 빔포밍, 물리 랜덤 액세스 채널 (physical random access channel, PRACH) 추출 및 필터링 등을 수행함), 또는 양자 모두를 호스팅하는 논리 노드에 대응할 수 있다. 이러한 아키텍처에서, RU(들)는 하나 이상의 UE들 과의 OTA(over the air) 통신을 핸들링하도록 구현될 수 있다. 일부 구현예들에서, RU(들)와의 제어 및 사용자 평면 통신의 실시간 및 비-실시간 양태들은 대응하는 DU에 의해 제어될 수 있다. 일부 시나리 오들에서, 이러한 구성은 DU(들) 및 CU가 vRAN 아키텍처와 같은 클라우드-기반 RAN(radio access network) 아키텍처에서 구현되는 것을 가능하게 할 수 있다. SMO 프레임워크는 비-가상화된 및 가상화된 네트워크 엘리먼트들의 RAN 배치 및 프로비저닝(provisionin g)을 지원하도록 구성될 수 있다. 비-가상화된 네트워크 엘리먼트들에 대해, SMO 프레임워크는, 동작들 및 유지보수 인터페이스(예컨대, O1 인터페이스)를 통해 관리될 수 있는 RAN 커버리지 요건들에 대한 전용 물리 리소스들의 배치를 지원하도록 구성될 수 있다. 가상화된 네트워크 엘리먼트들에 대해, SMO 프레임워크는 클라우드 컴퓨팅 플랫폼 인터페이스(이를테면, O2 인터페이스)를 통해 네트워크 엘리먼트 수명 사이클 관리를 수행하기 위해(이를테면, 가상화된 네트워크 엘리먼트들을 인스턴스화하기 위해) 클라우드 컴퓨팅 플랫폼(이를 테면, O-Cloud(open cloud))과 상호작용하도록 구성될 수 있다. 그러한 가상화된 네트워크 엘리먼트들은 CU들, DU들, RU들, 및 근-RT RIC들을 포함할 수 있지만 이들로 제한되지 않는다. 일부 구현예들에서, SMO 프레임워크는 O1 인터페이스를 통해, 4G RAN의 하드웨어 양태, 이를테면, O-eNB(open eNB)와 통신할 수 있다. 추가적으로, 일부 구현예들에서, SMO 프레임워크는 O1 인터페이스를 통해 하나 이상의 RU들과 직접적으로 통신할 수 있다. SMO 프레임워크는 또한 SMO 프레임워크의 기 능을 지원하도록 구성된 비-RT RIC를 포함할 수 있다. 비-RT RIC는 RAN 엘리먼트들 및 리소스들, 모델 훈련 및 업데이트들을 포함하는 AL/ML(Artificial Intelligence/Machine Learning) 워크플로우들, 또는 근-RT RIC에서의 애플리케이션들/특징들의 정책 기 반 안내의 비-실시간 제어 및 최적화를 가능하게 하는 논리 함수를 포함하도록 구성될 수 있다. 비-RT RIC는 근-RT RIC에 커플링되거나 그와 (이를테면, A1 인터페이스를 통해) 통신할 수 있다. 근-RT RIC는 하나 이상의 CU들, 하나 이상의 DU들, 또는 둘 모두뿐만 아니라 O-eNB를 근-RT RIC(16 4)와 연결시키는 (이를테면, E2 인터페이스를 통한) 인터페이스에 걸친 데이터 수집 및 액션들을 통해 RAN 엘리 먼트들 및 리소스들의 근-실시간 제어 및 최적화를 가능하게 하는 논리 함수를 포함하도록 구성될 수 있다. 일부 구현예들에서, 근-RT RIC에 배치될 AI/ML 모델들을 생성하기 위해, 비-RT RIC는 외부 서버들로 부터 파라미터들 또는 외부 강화 정보를 수신할 수 있다. 그러한 정보는 근-RT RIC에 의해 활용될 수 있 고, 비-네트워크 데이터 소스들로부터 또는 네트워크 기능들로부터 SMO 프레임워크 또는 비-RT RIC에 서 수신될 수 있다. 일부 예들에서, 비-RT RIC 또는 근-RT RIC는 RAN 거동 또는 성능을 튜닝하도록 구성될 수 있다. 예를 들어, 비-RT RIC는 성능에 대한 장기 추세들 및 패턴들을 모니터링하고, AI/ML 모 델들을 채용하여 SMO 프레임워크(이를테면, O1을 통한 재구성)를 통해 또는 RAN 관리 정책들(이를테면, A1 정책들)의 생성을 통해 정정 액션들을 수행할 수 있다. 도 1c는 다양한 실시예들을 구현하기에 적합한 통신 시스템을 예시하는 시스템 블록도이다. 도 1a 내지 도 1c를 참조하면, 통신 시스템은 3대의 차량들(12, 14, 16)을 포함할 수 있다. 각각의 차량(12, 14, 16)은, 각각이 다른 차량의 V2X 통신 시스템들(예를 들어, 104, 106, 108)에 의해 수신 및 프로세싱하기 위한 기본 안전 메시지들(30, 40, 50)과 같은 V2X 메시지들을 주기적으로 브로드캐스팅하도록 구성된 V2X 통신 시스 템(104, 106, 108)을 각각 포함할 수 있다. 차량 위치, 속도, 방향, 제동, 및 다른 정보를 공유함으로써, 차량 들은 안전한 간격을 유지하고 잠재적인 충돌들을 식별하여 회피할 수 있다. 예컨대, 선행 차량으로부터 기본 안전 메시지를 수신하는 후행 차량은 차량의 속도 및 위치를 결정할 수 있고, 이는 결국 차량 이 속도를 맞추어서 안전한 간격 거리를 유지할 수 있게 한다. 선행 차량들이 제동장치를 밟을 때 기본 안전 메시지들을 통해 통보됨으로써, 선행 차량이 급정지할 때에도 후행 차량의 V2X 통신 시 스템이 동시에 제동장치를 밟아 안전한 간격 거리를 유지할 수 있다. 다른 예로서, 트럭 차량 내 의 V2X 통신 시스템은 2대의 차량들(12, 16)로부터 기본 안전 메시지(30, 50)를 수신하고, 따라서 트럭 차 량이 충돌을 회피하기 위해 교차로에서 정지해야 한다는 것을 통지받을 수 있다. 차량 V2X 탑재 장비(104, 106, 108) 각각은 다양한 근접 통신 프로토콜들 중 임의의 프로토콜을 사용하여 서로 통신할 수 있다. 추가적 으로, 차량들은 검출된 V2X 오작동에 대한 오작동 보고뿐만 아니라 검출된 기본 안전 메시지들에 관한 데이터 및 정보를 통신 네트워크를 통하여 통신 링크들(60, 61, 62)을 거쳐 OEM(original equipment manufacturer)(70, 72) 및/또는 MA(예를 들어, 132)로 송신할 수 있을 수 있다. 오작동 보고는 (예를 들 어, 통신 링크(64, 66)를 통해) MA로 직접적으로 송신될 수 있다. 다른 실시예들에서, 오작동 보고는 먼저, 사전-프로세싱을 위해 OEM 서버들(70, 72)과 같은 오작동 보고 사전-프로세싱 유닛으로 통신 링크들(64, 66)을 통해 송신될 수 있다. 이어서, 사전-프로세싱된 오작동 보고는 오작동 보고 사전-프로세싱 서버들(70, 72)로부터 통신 링크들(64, 66)을 통해 MA로 송신될 수 있다. 다른 실시예들에서, 오작동 보고는 MA에 서, 차량과 같은 차량으로부터 수신될 수 있다. MA는 차량으로부터 수신된 오작동 보고를 통신 링 크들(64, 66)을 통해 OEM 서버들(70, 72)로 중계할 수 있다. 추가적으로, OEM 서버들(70, 72)은 확인 보고들을 통신 링크들(64, 66)을 통해 MA에 제공할 수 있다. 도 2a는 다양한 실시예들을 구현하기에 적합한 예시적인 통신 시스템의 컴포넌트 도면이다. 도 1a 내지 도 2a를 참조하면, 시스템은 V2X 통신 시스템을 포함하는 차량을 포함할 수 있다. 차량 V2X 통 신 시스템은 차량 내 네트워크, 인포테인먼트 시스템, 다양한 센서들, 다양한 액추에이터 들, 및 안테나에 커플링된 라디오 모듈과 같은 다양한 시스템들 및 디바이스들과 통신할 수 있 다. 차량 V2X 통신 시스템은 또한 노변 유닛들, 셀룰러 통신 네트워크 기지국들, 및 다른 외부 디바이스들과 통신할 수 있다. V2X 통신 시스템은 프로세서, 메모리, 입력 모듈, 출력 모듈, 및 라디오 모듈 을 포함할 수 있다. 프로세서는 메모리(즉, 비일시적 저장 매체)에 커플링될 수 있고, 본 명세서에 서 설명된 다양한 실시예에 따른 방법의 동작을 수행하기 위해 메모리에 저장된 프로세서 실행가능 명령으 로 구성될 수 있다. 또한, 프로세서는 차량 내 디스플레이를 제어할 수 있는 출력 모듈에, 그리고 운전자 입력뿐만 아니라 차량 센서로부터의 정보를 수신하기 위한 입력 모듈에 커플링될 수 있다. V2X 통신 시스템은 하나 이상의 ITS 참여자들(예를 들어, 스테이션들), 노변 유닛, 및 기지국 또는 다른 적합한 네트워크 액세스 포인트와 통신하도록 구성된 라디오 모듈에 커플링된 V2X 안테나 를 포함할 수 있다. V2X 안테나 및 라디오 모듈은 V2X 통신을 통해 동적 교통 흐름 특징 정보를 수 신하도록 구성될 수 있다. 다양한 실시예들에서, V2X 통신 시스템은 차량 내 네트워크, 인포테인먼트 시 스템, 다양한 센서들, 다양한 액추에이터들, 및 라디오 모듈과 같은 복수의 정보 소스들로 부터 정보를 수신할 수 있다. V2X 통신 시스템은 아래에서 추가로 설명되는 바와 같이, 센서 데이터 외에 지도 데이터를 사용하여 자율 또는 반자율 주행 기능들을 수행하도록 구성될 수 있다. 차량 내 네트워크의 예로는 CAN(Controller Area Network), LIN(Local Interconnect Network), FlexRay 프로토콜을 사용하는 네트워크, MOST(Media Oriented Systems Transport) 네트워크, 및 자동차 이더넷 네트워 크를 포함한다. 차량 센서들의 예들로는 위치 결정 시스템(예컨대, GNSS(Global Navigation Satellite Systems) 시스템, 카메라, 레이더(radar), 라이다(lidar), 초음파 센서, 적외선 센서, 및 다른 적합한 센서 디 바이스들 및 시스템들)을 포함한다. 차량 액추에이터들의 예들로는, 예컨대 조향장치, 제동장치, 엔진 동 작, 조명, 방향 지시등 등을 위한, 다양한 물리적 제어 시스템들을 포함한다. 도 2b는 V2X 통신 시스템에 커플링될 수 있고 다양한 실시예들을 구현하기에 적합할 수 있는 예시적인 차 량 자율/반자율 주행 시스템의 컴포넌트들을 예시하는 컴포넌트 블록도이다. 자율/반자율 주행 시스템 은 차량 내에 활용될 수 있는 다양한 서브시스템들, 통신 엘리먼트들, 컴퓨테이셔널 엘리먼트들, 컴 퓨팅 디바이스들 또는 유닛들을 포함할 수 있다. 도 1a 내지 도 2a를 참조하면, 자율/반자율 주행 시스템 내의 다양한 컴퓨테이셔널 엘리먼트들, 컴퓨팅 디바이스들 또는 유닛들은 데이터 및 커맨드(command)들을 차량 내 네트워크를 통해 서로 통신하는(예컨대, 도 2b 내에 화살표들로 표시됨) 컴퓨팅 디바이스들의 시스템 (즉, 서브시스템들) 내에 구현될 수 있다. 일부 구현예들에서, 자율/반자율 주행 시스템 내의 다양한 컴 퓨테이셔널 엘리먼트들, 컴퓨팅 디바이스들 또는 유닛들은 단일 컴퓨팅 디바이스, 예컨대, 별개의 스레드들, 프로세스들, 알고리즘들 또는 컴퓨테이셔널 엘리먼트들 내에 구현될 수 있다. 따라서, 도 2b에 예시된 각각의 서 브시스템/컴퓨테이셔널 엘리먼트는 또한, 대체적으로 본 명세서에서 차량 자율/반자율 주행 시스템을 구성 하는 컴퓨테이셔널 \"스택\" 내의 \"계층\"으로 지칭된다. 그러나, 다양한 실시예들을 설명하는데 있어서 용어 계 층 및 스택의 사용은, 비록 그것이 잠재적인 구현 실시예이지만, 대응하는 기능이 단일 차량 컴퓨팅 디바이스 내에 구현되는 것을 암시하거나 요구하도록 의도되지 않는다. 오히려, 용어 \"계층\"의 사용은 독립적인 프로세 서들을 갖는 서브시스템들, 하나 이상의 컴퓨팅 디바이스들에서 실행되는 컴퓨테이셔널 엘리먼트들(예를 들어, 스레드들, 알고리즘들, 서브루틴들 등), 및 서브시스템들과 컴퓨테이셔널 엘리먼트들의 조합들을 포함하도록 의 도된다. 자율/반자율 주행 시스템은 레이더 및/또는 라이다 지각 계층, 카메라 지각 계층, 포지셔닝 엔 진 계층, 지도 데이터베이스, 지도 융합 및 중재 계층, 루트 계획 계층, 동작 모드 평가 계층, 센서 융합 및 도로 세계 모델(road world model, RWM) 관리 계층, 모션 계획 및 제어 계층 , 및 거동 계획 및 예측 계층을 포함할 수 있다. 계층들(222 내지 240)은 단지 자율/반자율 주행 시 스템의 하나의 예시적인 구성 내의 일부 계층들의 예들일 뿐이다. 다른 구성들에서, 다른 지각 센서들을 위한 추가적인 계층들(예컨대, 라이다 지각 계층 등), 계획 및/또는 제어를 위한 추가적인 계층들, 모델링을 위 한 추가적인 계층들 등과 같은 다른 계층들이 포함될 수 있고/있거나, 계층들(222 내지 240) 중 특정 계층이 자 율/반자율 주행 시스템으로부터 배제될 수 있다. 계층들(222 내지 240) 각각은 도 2b에서 화살표들로 예 시된 바와 같이 데이터, 컴퓨테이셔널 결과들, 및 커맨드들을 교환할 수 있다. 추가로, 자율/반자율 주행 시스 템은 센서들(예컨대, 레이더, 라이다, 카메라들, 관성 측정 유닛들(inertial measurement unit, IMU) 등), 내비게이션 정보 소스들(예컨대, 글로벌 포지셔닝 시스템(GPS) 수신기들, IMU 등), 차량 네트워크들(예컨 대, CAN 버스), 및 메모리 내의 데이터베이스들(예컨대, 디지털 지도 데이터)로부터 데이터를 수신하고 프로세 싱할 수 있다. 자율/반자율 주행 시스템은 차량 제어 커맨드들 또는 신호들을 자율 주행 시스템 (autonomous driving system, ADS) 차량 제어 유닛에 출력할 수 있으며, 이는 차량 조향장치, 스로틀, 및 제동장치 제어들과 직접적으로 인터페이싱하는 시스템, 서브시스템 또는 컴퓨팅 디바이스이다. 도 2a에 예시된 자율/반자율 주행 시스템 및 ADS 차량 제어 유닛의 구성은 단지 예시적인 구성이고, 차량 관리 시스 템 및 다른 차량 컴포넌트들의 다른 구성들이 사용될 수 있다. 일례로서, 도 2b에 예시된 자율/반자율 주행 시 스템 및 ADS 차량 제어 유닛의 구성은 자율 또는 반자율 주행 동작을 위해 구성된 차량에서 사용될 수 있는 한편, 상이한 구성은 비-자율 주행 차량에서 사용될 수 있다. 레이더 및/또는 라이다 지각 계층은 하나 이상의 검출 및 레인징 센서(ranging sensor)들, 예컨대, 레이더 (예컨대, 132) 및/또는 라이다(예컨대, 138)로부터 데이터를 수신하고, 차량 부근 내의 다른 차량들 및 객 체들의 위치들을 인식하고 결정하기 위해 데이터를 프로세싱할 수 있다. 레이더 지각 계층은 객체들 및 차량들을 인식하고 그러한 정보를 센서 융합 및 RWM 관리 계층에 전달하기 위해 뉴럴 네트워크 프로세싱 및 인공지능 방법들의 사용을 포함할 수 있다. 카메라 지각 계층은 카메라들과 같은 하나 이상의 카메라들로부터 데이터를 수신하고, 차량 부근 내 의 다른 차량들 및 객체들의 위치들을 인식하고 결정하기 위해 데이터를 프로세싱할 수 있다. 카메라 지각 계 층은 객체들 및 차량들을 인식하고 그러한 정보를 센서 융합 및 RWM 관리 계층에 전달하기 위해 뉴럴 네트워크 프로세싱 및 인공지능 방법들의 사용을 포함할 수 있다. 포지셔닝 엔진 계층은 레이더 및/또는 라이다 지각 계층, 카메라 지각 계층, 및 내비게이션 정 보의 다양한 소스들로부터 데이터를 수신하고, 차량의 포지션을 결정하기 위해 데이터 및 정보를 프로세싱 할 수 있다. 내비게이션 정보의 다양한 소스들은 GPS 수신기, IMU, 및/또는 CAN 버스를 통해 연결된 다른 소스 들 및 센서들을 포함할 수 있지만, 이에 제한되지 않는다. 포지셔닝 엔진 계층은 또한, 카메라들과 같은 하나 이상의 카메라들 및/또는 레이더들, 라이다들 등과 같은 차량 부근의 객체들에 대한 방향들 및 거리들을 식별하고 결정할 수 있는 임의의 다른 이용가능 센서로부터의 입력들을 활용할 수 있다. 자율/반자율 주행 시스템은 다양한 실시예들에 따라 차량 V2X 통신 시스템을 포함하거나 그에 커플링 될 수 있다. 계층들(222 내지 240) 중 하나 이상은 V2X 통신 시스템에 정보를 제공하거나 그로부터 정보 를 수신할 수 있다. V2X 통신 시스템은 하이웨이(highway) 통신 시스템들을 이용하여, 예컨대, V2X 통신 링크들(예를 들어, 124)을 통해 통신하도록 그리고/또는 셀룰러 무선 통신 링크들(예를 들어, 122)을 통해, 예 컨대, 5G 셀룰러 네트워크들을 통해 원격 정보 소스들(예를 들어, 컴퓨팅 디바이스)로 통신하도록 구성될 수 있다.지도 융합 및 중재 계층은 근방의 객체들 및 특징들에 관한 위치 정보를 위해 지도 데이터베이스에 액세스하고, 포지셔닝 엔진 계층으로부터 출력된 위치파악(localizing)/내비게이션 정보를 수신하고, 교통 차선 내의 위치, 길 지도 내의 포지션 등과 같은 지도 내의 차량의 포지션을 추가로 결정하기 위해 데이터 를 프로세싱할 수 있으며, 센서 데이터는 메모리(예컨대, 메모리)에 저장될 수 있다. 일부 지도 객체들 및 특징들 내의 위치 정보와 센서 정확도 및 정밀도와 유사하게, GPS 포지션 픽스(position fix)들은 일부 오류를 포함하고, 따라서 지도 융합 및 중재 계층은 도로 내의 그리고 근처의 객체들 및 특 징들에 관한 GPS 좌표들, 센서 데이터, 및 지도 데이터 사이의 중재에 기초하여 도로 내의 차량의 최상의 추측 위치를 결정하도록 기능할 수 있다. 예컨대, GPS 좌표들은 2차선 도로의 중간 근처에 있는 차량을 센서 데이터 에 배치할 수 있지만, 지도 융합 및 중재 계층은 차량이 주행 방향과 일치하는 주행 차선과 정렬될 가능성 이 가장 높음을 주행 방향으로부터 결정할 수 있다. 지도 융합 및 중재 계층은 중재된 지도 위치 정보를 센서 융합 및 RWM 관리 계층에 전달할 수 있다. 루트 계획 계층은 차량이 특정 목적지까지 따라갈 루트를 계획하기 위해 조작자 또는 디스패처로부터 의 입력들뿐만 아니라 센서 데이터를 활용할 수 있다. 루트 계획 계층은 지도 기반 위치 정보를 센서 융 합 및 RWM 관리 계층에 전달할 수 있다. 그러나, 센서 융합 및 RWM 관리 계층 등과 같은 다른 계층 들에 의한 이전 지도의 사용은 요구되지 않는다. 예컨대, 다른 스택들은 제공되는 지도 없이 지각 데이터에만 기초하여 차량을 동작시키고/시키거나 제어하여, 차선들, 경계들, 및 지각 데이터가 수신될 때의 로컬 지도의 개념을 구성할 수 있다. 동작 모드 평가 계층을 포함하는 실시예들에서, 그 프로세싱 계층은 적절한 ADS 주행 모드를 선택하기 위 해 근방의 객체들 및 특징들에 관한 안전 및/또는 신뢰도 정보를 사용할 수 있다. 일부 실시예들에서, 동작 모 드 평가 계층은 현재의 자율 또는 반자율 주행 모드가 주행 환경 내의 근방의 객체들 및 특징들에 관한 안 전 및/또는 신뢰도 정보의 관점에서 적절한지 또는 그것에 부합하는지 여부를 결정할 수 있다. 센서 융합 및 RWM 관리 계층은 레이더 및/또는 라이다 지각 계층, 카메라 지각 계층, 지도 융합 및 중재 계층, 루트 계획 계층, 및 동작 모드 평가 계층에 의해 생성된 데이터 및 출력들을 수 신하고, 그러한 입력들 중 일부 또는 모두를 사용하여 도로, 도로 상의 다른 차량들, 및 차량 부근 내의 다른 객체들에 관련해 차량의 위치 및 상태를 추정하거나 개선할 수 있다. 예컨대, 센서 융합 및 RWM 관 리 계층은 카메라 지각 계층으로부터의 이미저리(imagery) 데이터를 지도 융합 및 중재 계층으 로부터의 중재된 지도 위치 정보와 조합하여, 교통 차선 내의 차량의 결정된 포지션을 개선할 수 있다. 다른 예로서, 센서 융합 및 RWM 관리 계층은 카메라 지각 계층으로부터의 객체 인식 및 이미저리 데이터를 레이더 및/또는 라이다 지각 계층으로부터의 객체 검출 및 레인징 데이터와 조합하여, 차량 부근의 다른 차량들 및 객체들의 상대적 포지션을 결정하고 개선할 수 있다. 다른 예로서, 센서 융합 및 RWM 관리 계층 은 다른 차량 포지션들 및 주행 방향들에 관한 정보를 V2X 통신들로부터 (이를테면 CAN 버스를 통해) 수신 하고, 그 정보를 레이더 및/또는 라이다 지각 계층 및 카메라 지각 계층으로부터의 정보와 조합하여, 다른 차량들의 위치들 및 모션들을 개선할 수 있다. 센서 융합 및 RWM 관리 계층은 차량의 개선된 위치 및 상태 정보뿐만 아니라 차량 부근의 다른 차량들 및 객체들의 개선된 위치 및 상태 정보를 모션 계획 및 제어 계층 및/또는 거동 계획 및 예측 계층에 출력할 수 있다. 추가 예로서, 센서 융합 및 RWM 관리 계층은 차량에게 속도, 차선, 주행 방향 또는 다른 내비게이션 엘리먼트(들)를 변경하도록 지시하는 동적 교통 제어 명령들을 사용하고, 그 정보를 다른 수신된 정보와 조합하 여 개선된 위치 및 상태 정보를 결정할 수 있다. 센서 융합 및 RWM 관리 계층은 차량의 개선된 위치 및 상태 정보뿐만 아니라 차량 부근의 다른 차량들 및 객체들의 개선된 위치 및 상태 정보를 모션 계획 및 제어 계층, 거동 계획 및 예측 계층 및/또는 차량으로부터 멀리 떨어져 있는 디바이스들, 이를 테면 데이터 서버, 다른 차량들 등에 무선 통신들을 통해서, 이를테면 C-V2X 연결들, 다른 무선 연결들 등을 통 해서 출력할 수 있다. 또 다른 추가의 예로서, 센서 융합 및 RWM 관리 계층은 레이더 및/또는 라이다 지각 계층, 카메라 지 각 계층, 다른 지각 계층 등으로부터의 지각 데이터와 같은 다양한 센서들로부터의 지각 데이터 및/또는 하나 이상의 센서들 자체들로부터의 데이터를 모니터링하여, 차량 센서 데이터에서의 조건들을 분석할 수 있다. 센서 융합 및 RWM 관리 계층은 임계치에 있거나 그것을 초과하거나 그 미만인 센서 측정치들, 발생하는 특 정 타입들의 센서 측정치들 등과 같은 센서 데이터에서의 조건들을 검출하도록 구성될 수 있고, 그리고 무선 통 신들을 통해서, 이를테면 C-V2X 연결들, 다른 무선 연결들 등을 통해서 거동 계획 및 예측 계층 및/또는차량으로부터 멀리 떨어져 있는 디바이스들, 이를테면 데이터 서버, 다른 차량들 등에 제공되는 차량(10 2)의 개선된 위치 및 상태 정보의 부분으로서 센서 데이터를 출력할 수 있다. 자율 주행 차량 V2X 통신 시스템의 거동 계획 및 예측 계층은 다른 차량들 및/또는 객체들의 향후의 거동들을 예측하기 위해, 차량의 개선된 위치 및 상태 정보와 센서 융합 및 RWM 관리 계층으로부터 출력된 다른 차량들 및 객체들의 위치 및 상태 정보를 사용할 수 있다. 예컨대, 거동 계획 및 예측 계층 은 그러한 정보를 사용하여 차량의 차량 포지션 및 속도 및 다른 차량 포지션들 및 속도에 기초하여 그 차량 부 근의 다른 차량들의 향후의 상대적 포지션들을 예측할 수 있다. 그러한 예측들은, 호스트 및 다른 차량들이 도 로를 따라 주행할 때 상대적 차량 포지션들에의 변경들을 예상하기 위해 지도 데이터 및 루트 계획으로부터의 정보를 고려할 수 있다. 거동 계획 및 예측 계층은 다른 차량 및 객체 거동 및 위치 예측들을 모션 계획 및 제어 계층에 출력할 수 있다. 추가적으로, 거동 계획 및 예측 계층은 차량의 모션을 제어하 기 위한 제어 신호들을 계획하고 생성하기 위해 위치 예측들과 조합하여 객체 거동을 사용할 수 있다. 예컨대, 루트 계획 정보, 도로 정보에서의 개선된 위치, 및 다른 차량들의 상대적 위치들 및 모션들에 기초하여, 거동 계획 및 예측 계층은 차량이, 이를테면 다른 차량들로부터의 최소 간격을 유지하거나 달성하고/하거 나, 회전하거나 나갈 준비를 하기 위해 차선들을 변경하고 가속할 필요가 있다고 결정할 수 있다. 그 결과, 거 동 계획 및 예측 계층은, 그러한 차선 변경 및 가속을 시행하기 위해 필요한 그러한 다양한 파라미터들과 함께, 모션 계획 및 제어 계층 및 ADS 차량 제어 유닛에 명령될 스로틀 설정에 대한 변경 및 휠들에 대한 조향 각도를 계산하거나 또는 달리 결정할 수 있다. 하나의 그러한 파라미터는 컴퓨팅된 핸들(steering wheel) 커맨드 각도일 수 있다. 모션 계획 및 제어 계층은 센서 융합 및 RWM 관리 계층으로부터의 데이터 및 정보 출력들, 지도 데이 터베이스로부터의 지도 데이터, 그리고 다른 차량 및 객체 거동뿐만 아니라 거동 계획 및 예측 계층 으로부터의 위치 예측들을 수신하고, 이러한 정보를 사용하여 차량의 모션을 제어하기 위한 제어 신호들을 계획하고 생성하며, 그러한 제어 신호들이 차량에 대한 안전 요건들을 충족한다는 것을 검증할 수 있다. 예컨대, 루트 계획 정보, 도로 정보에서의 개선된 위치, 및 다른 차량들의 상대적 위치들 및 모션들에 기초하여, 모션 계획 및 제어 계층은 다양한 제어 커맨드들 또는 명령들을 검증하여 ADS 차량 제어 유닛 에 전달할 수 있다. ADS 차량 제어 유닛은 모션 계획 및 제어 계층으로부터 커맨드들 또는 명령들을 수신하고, 그러한 정 보를 차량의 휠 각도, 제동장치 및 스로틀을 제어하기 위한 기계적 제어 신호들로 변환할 수 있다. 예컨 대, ADS 차량 제어 유닛은 대응하는 제어 신호들을 핸들 제어기에 전송함으로써 컴퓨팅된 핸들 커맨드 각 도에 응답할 수 있다. 다양한 실시예들에서, V2X 통신 시스템은 센서 데이터, 포지션 데이터, 차량 데이터, 및 탑재 센서들에 의 해 차량 주변 환경에 대해 수집된 데이터를 송신하기 위해 무선 통신 링크들을 통해 다른 V2X 통신 시스템 참여 자들(예를 들어, 다른 차량들(12, 14, 16))과 통신할 수 있다. 그러한 정보는 다른 V2X 통신 시스템 참여자들 에게 중계하기 위한 저장된 센서 데이터를 업데이트하기 위해 다른 V2X 통신 시스템 참여자들에 의해 사용할 수 있다. 다양한 실시예들에서, 차량 V2X 통신 시스템은 차량 및 점유자 안전에 영향을 줄 수 있는 다양한 계층들의 다양한 커맨드들, 계획, 또는 다른 결정들의 안전 검사들 또는 감독을 수행하는 기능을 포함할 수 있다. 그러 한 안전 검사 또는 감독 기능은 전용 계층 내에서 구현되거나 다양한 계층들 사이에 분산되어 기능의 일부로서 포함될 수 있다. 일부 실시예들에서, 다양한 안전 파라미터들이 메모리에 저장될 수 있고, 안전 검사들 또는 감독 기능은 결정된 값(예컨대, 근방의 차량과의 상대적 간격, 도로 중앙선으로부터의 거리 등)을 대응하는 안 전 파라미터(들)와 비교하고, 안전 파라미터가 위반되거나 위반될 경우에 경고 또는 커맨드를 발행할 수 있다. 예컨대, 거동 계획 및 예측 계층(또는 별개의 계층)의 안전 또는 감독 기능은 (센서 융합 및 RWM 관리 계 층에 의해 정의된 바와 같은) 다른 차량과 (예컨대, 센서 융합 및 RWM 관리 계층에 의해 개선된 세계 모델(world model)에 기초한) 차량 사이의 현재의 또는 향후의 간격 거리를 결정하고, 그 간격 거리를 메모리에 저장된 안전한 간격 거리 파라미터와 비교하고, 현재의 또는 예측된 간격 거리가 안전한 간격 거리 파라미터를 위반하는 경우에 가속, 감속, 또는 방향전환하라는 명령들을 모션 계획 및 제어 계층에 발행할 수 있다. 다른 예로서, 모션 계획 및 제어 계층(또는 별개의 계층)의 안전 또는 감독 기능은 결정된 또는 명령된 핸 들 커맨드 각도를 안전한 휠 각도 제한 또는 파라미터와 비교하고, 명령된 각도가 안전한 휠 각도 한도를 초과 하는 것에 응답하여 오버라이드(overrid) 커맨드 및/또는 경보를 발행할 수 있다.메모리에 저장된 일부 안전 파라미터들은 최대 차량 속도와 같이 정적일 수 있다(즉, 시간이 지남에 따라 변하 지 않음). 메모리에 저장된 다른 안전 파라미터들은, 파라미터들이 차량 상태 정보 및/또는 환경 조건들에 기 초하여 연속적으로 또는 주기적으로 결정되거나 업데이트된다는 점에서 동적일 수 있다. 안전 파라미터들의 비 제한적인 예들은 최대 안전 속도, 최대 제동 압력, 최대 가속도, 및 안전 휠 각도 한도를 포함하며, 이들 모두 는 도로 및 날씨 조건들의 함수일 수 있다. 도 3a는 다양한 실시예들에 따른, 차량 V2X 프로세싱 시스템에서 사용하기 위한 시스템 온 칩(SOC)의 예시 적인 컴포넌트들을 예시하는 블록도이다. 도 1a 내지 도 3a를 참조하면, 프로세싱 디바이스 SOC는 다수의 이종 프로세서들, 이를테면 디지털 신호 프로세서(DSP), 모뎀 프로세서, 이미지 및 객체 인식 프로세 서, 모바일 디스플레이 프로세서, 애플리케이션 프로세서, 및 리소스 및 전력 관리(resource and power management, RPM) 프로세서를 포함할 수 있다. 프로세싱 디바이스 SOC는 또한 이종 프로 세서들(303, 304, 306, 307, 308, 317) 중 하나 이상에 연결된 하나 이상의 코프로세서들(예컨대, 벡터 코-프로세서)을 포함할 수 있다. 프로세서들 각각은 하나 이상의 코어들 및 독립적인/내부 클록을 포함할 수 있다. 각각의 프로세서/코어는 다른 프로세서들/코어들과 독립적으로 동작들을 수행할 수 있다. 예컨대, 프로 세싱 디바이스 SOC는 제1 타입의 운영 체제(예컨대, FreeBSD, LINUX, OS X 등)를 실행하는 프로세서 및 제 2 타입의 운영 체제(예컨대, Microsoft Windows)를 실행하는 프로세서를 포함할 수 있다. 일부 실시예들에서, 애플리케이션 프로세서는 SOC의 메인 프로세서, 중앙 처리 장치(central processing unit, CPU), 마 이크로프로세서 유닛(microprocessor unit, MPU), 산술 논리 유닛(arithmetic logic unit, ALU) 등일 수 있다. 그래픽 프로세서는 그래픽 처리 장치(graphics processing unit, GPU)일 수 있다. 프로세싱 디바이스 SOC는 또한 센서 데이터, 아날로그-디지털 컨버전(analog-to-digital conversion)들, 무선 데이터 송신들을 관리하기 위한, 그리고 웹 브라우저에서 렌더링하기 위해 인코딩된 오디오 및 비디오 신 호들을 프로세싱하는 것과 같은 다른 특수화된 동작들을 수행하기 위한 아날로그 회로부 및 맞춤형 회로부(31 4)를 포함할 수 있다. 프로세싱 디바이스 SOC는 시스템 컴포넌트들 및 리소스들, 이를테면 전압 조 정기들, 발진기들, 위상-동기 루프들, 주변 브리지들, 데이터 제어기들, 메모리 제어기들, 시스템 제어기들, 액 세스 포트들, 타이머들, 및 컴퓨팅 디바이스 상에서 실행되는 프로세서들 및 소프트웨어 클라이언트들(예컨대, 웹 브라우저)을 지원하기 위해 사용되는 다른 유사한 컴포넌트들을 더 포함할 수 있다. 프로세싱 디바이스 SOC는 또한 하나 이상의 카메라(예컨대, 1차 카메라, 웹캠, 3D 카메라 등)의 동작들, 카메라 펌웨어로부터의 비디오 디스플레이 데이터, 이미지 프로세싱, 비디오 사전-프로세싱, VFE(video front- end), 인-라인 JPEG, 고선명 비디오 코덱 등을 포함하고, 제공하고, 제어하고 그리고/또는 관리하는 CAM(camera actuation and management)을 위한 특수 회로부를 포함한다. CAM은 독립적인 프로세싱 유닛일 수 있고/있거나 독립적인 또는 내부 클록을 포함할 수 있다. 일부 실시예들에서, 이미지 및 객체 인식 프로세서는 다양한 실시예들에 수반되는 이미지 프로세싱 및 객 체 인식 분석들을 수행하도록 구성된 프로세서 실행가능 명령들 및/또는 특수 하드웨어로 구성될 수 있다. 예 컨대, 이미지 및 객체 인식 프로세서는 다른 차량들을 인식하고/하거나 식별하기 위해 CAM을 통해 카 메라들로부터 수신된 이미지들을 프로세싱하는 동작들을 수행하고, 그렇지 않으면 설명된 바와 같은 카메라 지 각 계층의 기능들을 수행하도록 구성될 수 있다. 일부 실시예들에서, 프로세서는 설명된 바와 같이 레이더 또는 라이다 데이터를 프로세싱하고 레이더 및/또는 라이다 지각 계층의 기능들을 수행하도록 구성 될 수 있다. 시스템 컴포넌트들 및 리소스들, 아날로그 및 맞춤형 회로부, 및/또는 CAM은 카메라들, 레이더, 라이다, 전자 디스플레이들, 무선 통신 디바이스들, 외부 메모리 칩들 등과 같은 주변 디바이스들과 인터페이싱 하기 위한 회로부를 포함할 수 있다. 프로세서들(303, 304, 306, 307, 308)은 재구성가능 로직 게이트(logic gate)들의 어레이를 포함하고/하거나 버스 아키텍처(예를 들어, CoreConnect, AMBA 등)를 구현할 수 있는, 상호 연결/버스 모듈을 통해 하나 이상의 메모리 엘리먼트들, 시스템 컴포넌트들 및 리소스들, 아날 로그 및 맞춤형 회로부, CAM, 및 RPM 프로세서에 상호연결될 수 있다. 통신들은 고급 상호연결 들, 이를테면 고성능 NoC(network-on chip)들에 의해 제공될 수 있다. 프로세싱 디바이스 SOC는 SOC 외부의 리소스들, 이를테면 클록 및 전압 조정기와 통신하기 위한 입력/출력 모듈(예시되지 않음)을 추가로 포함할 수 있다. SOC 외부의 리소스들(예컨대, 클록, 전압 조정 기)은 내부 SOC 프로세서들/코어들 중 둘 이상(예컨대, DSP, 모뎀 프로세서, 그래픽 프로세서 , 애플리케이션 프로세서 등)에 의해 공유될 수 있다.일부 실시예들에서, 프로세싱 디바이스 SOC는 차량(예컨대, 100)에서 사용하기 위한 제어 유닛(예컨대, 140)에 포함될 수 있다. 제어 유닛은 설명된 바와 같이, 전화 네트워크(예컨대, 180), 인터넷, 및/또는 네트워 크 서버(예컨대, 184)와의 통신을 위한 통신 링크들을 포함할 수 있다. 프로세싱 디바이스 SOC는 또한, 모션 센서들(예컨대, IMU의 가속도계들 및 자이로스코프들), 사용자 인터 페이스 엘리먼트들(예컨대, 입력 버튼들, 터치 스크린 디스플레이 등), 마이크로폰 어레이들, 물리적 조건들(예 컨대, 위치, 방향, 모션, 배향, 진동, 압력 등)을 모니터링하기 위한 센서들, 카메라들, 나침반들, GPS 수신기 들, 통신 회로(예컨대, Bluetooth®, WLAN, WiFi 등), 및 현대 전자 디바이스들의 다른 널리 공지된 컴포넌트들 을 포함해서, 센서들로부터의 센서 데이터를 수집하기에 적합한 추가적인 하드웨어 및/또는 소프트웨어 컴포넌 트들을 포함할 수 있다. 도 3b는 다양한 실시예들에 따라 구성된 차량 V2X 통신 시스템의 엘리먼트들을 예시하는 컴포넌트 블록도 이다. 도 1a 내지 도 3b를 참조하면, 차량(예를 들어, 102)의 V2X 통신 시스템은 노변 유닛, 셀룰러 네트워크 기지국, 및/또는 하나 이상의 다른 차량들(12, 14, 16)과 통신하도록 구성될 수 있다. 차량 V2X 통신 시스템은 하나 이상의 프로세서, 메모리, 라디오 모듈, 및 다른 컴포넌트를 포함할 수 있다. 차량 프로세싱 시스템은 본 명세서에서 프로세서에 기인하는 기능을 제공하기 위해 함께 동작하는 복수의 하드웨어, 소프트웨어, 및/또는 펌웨어 컴포넌트를 포함할 수 있다. 메모리는 정보를 전자적으로 저장하는 비일시적 저장 매체를 포함할 수 있다. 메모리의 전자 저장 매체는 차량 프로세싱 시스템과 일체형으로(즉, 실질적으로 제거 불가능하게) 제공되는 시스템 스토리지, 및/또는 예를 들어 포트(예를 들어, 범용 직렬 버스(universal serial bus, USB) 포트, 파이어와이어 (firewire) 포트 등) 또는 드라이브(예를 들어, 디스크 드라이브 등)를 통해 차량 V2X 통신 시스템에 제거 가능하게 연결가능한 이동식 스토리지 중 하나 또는 둘 모두를 포함할 수 있다. 다양한 실시예에서, 메모리 는 전기 전하 기반 저장 매체(예를 들어, EEPROM, RAM 등), 솔리드 스테이트 저장 매체(예를 들어, 플래시 드라이브 등), 광학적으로 판독가능한 저장 매체(예를 들어, 광학 디스크 등), 자기적으로 판독가능한 저장 매 체(예를 들어, 자기 테이프, 자기 하드 드라이브, 플로피 드라이브 등), 및/또는 다른 전자적으로 판독가능한 저장 매체 중 하나 이상을 포함할 수 있다. 메모리는 하나 이상의 가상 저장 리소스(예를 들어, 클라우드 스토리지, 가상 사설 네트워크, 및/또는 다른 가상 저장 리소스)를 포함할 수 있다. 메모리는 차량 V2X 통신 시스템이 본 명세서에 설명된 바와 같이 기능할 수 있게 하는 소프트웨어 알고리즘, 프로세서 (들)에 의해 결정된 정보, 하나 이상의 다른 차량(12, 14, 16)으로부터 수신된 정보, 노변 유닛으로 부터 수신된 정보, 기지국으로부터 수신된 정보, 및/또는 다른 정보를 저장할 수 있다. 프로세서(들)는 차량 V2X 통신 시스템에서 정보 프로세싱 능력들을 제공하도록 구성될 수 있는 하나 이상의 로컬 프로세서를 포함할 수 있다. 이와 같이, 프로세서(들)는 디지털 프로세서, 아날로그 프로세 서, 정보를 프로세싱하도록 설계된 디지털 회로, 정보를 프로세싱하도록 설계된 아날로그 회로, 상태 머신, 및/ 또는 정보를 전자적으로 프로세싱하기 위한 다른 메커니즘 중 하나 이상을 포함할 수 있다. 프로세서(들)(20 5)가 단일 엔티티로서 도 3b에 도시되어 있지만, 이는 단지 예시적인 목적을 위한 것이다. 일부 실시예에서, 프로세서(들)는 복수의 프로세싱 유닛을 포함할 수 있다. 이러한 프로세싱 유닛은 물리적으로 동일한 디 바이스 내에 위치될 수 있거나, 또는 프로세서(들)는 차량 내에 분산되고 협력하여 동작하는 복수의 디바 이스들의 프로세싱 기능을 표현할 수 있다. 차량 V2X 통신 시스템은 하나 이상의 명령 모듈들을 포함할 수 있는 머신 판독가능 명령들에 의해 구 성될 수 있다. 명령 모듈은 컴퓨터 프로그램 모듈을 포함할 수 있다. 다양한 실시예들에서, 명령 모듈들은 관 련성 계산 모듈, 관련성 임계치 모듈, 관련성 결정 모듈, 프로세싱 중지/진행 모듈, 송신/ 수신(transmit/receive, TX/RX) 모듈, 보안 프로세싱 모듈, 오작동 검출 모듈, 및/또는 다른 모듈들 중 하나 이상을 포함할 수 있다. 관련성 계산 모듈은 수신된 BSM의 관련성 값을, BSM의 보안 프로세싱을 행하기 전에 계산하도록 구성될 수 있다. 관련성 계산 모듈은 차량과 BSM의 발신자의 역 충돌 시간에 기초하여 관련성 값을 계산하도록 구성 될 수 있다. 관련성 계산 모듈은 차량과 BSM의 발신자의 상대 속도를 차량에서부터 BSM의 발신자까지의 거리로 나눈 것에 기초하여 관련성 값을 계산하도록 구성될 수 있다. 관련성 임계치 모듈은 V2X 통신 시스템의 프로세싱 능력 및 차량의 기동 능력에 기초하여 관련성 임계치를 결정하도록 구성될 수 있다. 관련성 임계치 모듈은 V2X 통신 시스템 및/또는 차량 자율/반자율 주행 시스템의 반응 시간 및 차량의 제동 시간에 기초하여 관련성 임계치를 결정하도록 구성될 수 있다. 관련성 결정 모듈은 BSM의 관련성 값이 관련성 임계치를 충족하는지 여부를 결정하도록 구성될 수 있다. 프로세싱 중지/진행 모듈은, BSM의 관련성 값이 관련성 임계치를 충족하지 않는다고 결정하는 것에 응답하 여, BSM의 프로세싱을 중지하도록 구성될 수 있다. 프로세싱 중지/진행 모듈은, BSM의 관련성 값이 관련 성 임계치를 충족한다고 결정하는 것에 응답하여, BSM의 보안 프로세싱을 행하도록 그리고 BSM에 대해 하나 이 상의 오작동 검출 동작들을 수행하도록 구성될 수 있다. TX/RX 모듈은 라디오 모듈과 같은 차량 프로세싱 시스템의 통신 디바이스들의 동작들을 제어하도록 구성될 수 있다. 보안 프로세싱 모듈은, BSM의 관련성 값이 관련성 임계치를 충족한다고 결정하는 것에 응답하여, BSM의 보 안 프로세싱을 수행하도록 구성될 수 있다. 보안 프로세싱 모듈은, BSM의 관련성 값이 관련성 임계치를 충족한다고 결정하는 것에 응답하여, BSM의 암호화 검증을 수행하도록 구성될 수 있다. 오작동 검출 모듈은, BSM의 관련성 값이 관련성 임계치를 충족한다고 결정하는 것에 응답하여, BSM의 오작 동 검출을 수행하도록 구성될 수 있다. 오작동 검출 모듈은 BSM의 의미론적 검증을 수행하도록 구성될 수 있다. 프로세서(들)는 소프트웨어, 하드웨어, 펌웨어, 소프트웨어, 하드웨어 및/또는 펌웨어의 일부 조합, 및/또 는 프로세서(들)에서 프로세싱 능력을 구성하기 위한 다른 메커니즘들에 의해 모듈들(332 내지 346) 및/또 는 다른 모듈들을 실행하도록 구성될 수 있다. 상이한 모듈들(332 내지 346)에 의해 제공되는 기능의 설명은 예시적인 목적을 위한 것이며, 모듈들(332 내지 346) 중 임의의 모듈이 설명된 것보다 더 많거나 더 적은 기능을 제공할 수 있기 때문에 제한되도록 의도되지 않는다. 예를 들어, 모듈들(332 내지 346) 중 하나 이상은 제거될 수 있고, 그 기능의 일부 또는 전부는 모듈 들(332 내지 346) 중 다른 모듈들에 의해 제공될 수 있다. 다른 예로서, 프로세서(들)는 모듈들(332 내지 346) 중 하나에 아래에 기인하는 기능의 일부 또는 전부를 수행할 수 있는 하나 이상의 추가 모듈들을 실행하도 록 구성될 수 있다. 도 4a는 다양한 실시예들에 따른, 오작동 보고들의 송신을 관리하기 위한 차량 V2X 통신 시스템의 프로세서에 의해 수행되는 예시적인 방법(400a)의 프로세스 흐름도이다. 도 1a 내지 도 4a를 참조하면, 방법(400a)은 (집 합적으로 \"차량 프로세서\"로 지칭되는) 하드웨어 엘리먼트들, 소프트웨어 엘리먼트들, 또는 하드웨어와 소프트 웨어 엘리먼트들의 조합으로 구현될 수 있는 V2X 통신 시스템의 프로세서(예를 들어, 205, 300) 또는 다른 차량 프로세서(예를 들어, 205, 220, 300)에 의해 수행될 수 있다. 블록에서, 프로세서는 수신된 BSM의 관련성 값을, BSM의 보안 프로세싱을 행하기 전에 계산할 수 있다. 일부 실시예들에서, 수신된 BSM에 대한 관련성 값을 계산하는 것은, 차량과 BSM의 발신자의 역 충돌 시간에 기 초하여 관련성 값을 계산하는 것을 포함할 수 있다. 일부 실시예들에서, 수신된 BSM에 대한 관련성 값을 계산 하는 것은, 차량과 BSM의 발신자의 상대 속도를 차량에서부터 BSM의 발신자까지의 거리로 나눈 것에 기초하여 관련성 값을 계산하는 것을 포함할 수 있다. 블록의 동작들을 수행하기 위한 수단은 관련성 계산 모듈 을 실행하는 프로세서(예를 들어, 205, 303, 304, 306, 307, 308, 310)를 포함할 수 있다. 블록에서, 프로세서는 BSM의 관련성 값이 관련성 임계치를 충족하는지 여부를 결정할 수 있다. 일부 실시 예들에서, 블록의 동작들의 일부로서, 차량 프로세서는 V2X 통신 시스템, 자율/반자율 주행 시스템의 프로 세싱 능력 및/또는 차량의 기동 능력에 기초하여 관련성 임계치를 결정할 수 있다. 일부 실시예들에서, 블록 의 동작들의 일부로서, 프로세서는 V2X 통신 시스템, 자율/반자율 주행 시스템의 반응 시간 및/또는 차량 의 제동 시간에 기초하여 관련성 임계치를 결정할 수 있다. 블록의 동작들을 수행하기 위한 수단은 관련 성 결정 모듈을 실행하는 프로세서(예를 들어, 205, 303, 304, 306, 307, 308, 310)를 포함할 수 있다. 블록에서, 일부 실시예들에서, 프로세서는 BSM의 관련성 값이 관련성 임계치를 충족하지 않는다고 결정하 는 것에 응답하여, 보안 프로세싱을 수행하지 않고 BSM의 프로세싱을 중지할 수 있다. 보안 프로세싱을 수행하 지 않고, BSM의 프로세싱을 유예함으로써, 그리고 일부 실시예들에서, BSM을 삭제함으로써, 차량 프로세서는 차 량에 대한 관련성이 전혀 없거나 거의 없을 BSM을 검증하고 입증하는 데 요구되는 프로세싱 리소스들 및 시간을 쓰는 것을 회피할 수 있다. 블록의 동작들을 수행하기 위한 수단은 프로세싱 중지/진행 모듈을 실행 하는 프로세서(예를 들어, 205, 303, 304, 306, 307, 308, 310)를 포함할 수 있다.차량 프로세서는 때때로, 예컨대, 차량 프로세서가 BSM의 발신자로부터 새로운 BSM을 수신할 때, 블록들(402 내 지 406)의 동작들을 반복할 수 있다. 도 4b는 다양한 실시예들에 따른, 오작동 보고들의 송신을 관리하기 위한 방법(400a)의 일부로서 차량 V2X 통신 시스템의 프로세서에 의해 수행될 수 있는 예시적인 동작들(400b)의 프로세스 흐름도이다. 도 1a 내지 도 4b를 참조하면, 동작들(400b)은 (집합적으로 \"차량 프로세서\"로 지칭되는) 하드웨어 엘리먼트들, 소프트웨어 엘리먼 트들, 또는 하드웨어와 소프트웨어 엘리먼트들의 조합으로 구현될 수 있는 V2X 통신 시스템의 프로세서(예를 들 어, 205, 300) 또는 다른 차량 프로세서(예를 들어, 205, 220, 300)에 의해 수행될 수 있다. 블록에서, 프로세서는 BSM의 발신자로부터 BSM을 수신할 수 있다. 블록의 동작들을 수행하기 위한 수단은 TX/RX 모듈 및 라디오 모듈을 실행하는 프로세서(예를 들어, 205, 303, 304, 306, 307, 308, 310)를 포함할 수 있다. 블록에서, 프로세서는 설명된 바와 같이 수신된 BSM의 관련성 값을, BSM의 보안 프로세싱을 행하기 전에 계산할 수 있다. 결정 블록에서, 프로세서는 설명된 바와 같이 BSM의 관련성 값이 관련성 임계치를 충족하는지 여부를 결정 할 수 있다. 블록의 동작들을 수행하기 위한 수단은 관련성 결정 모듈을 실행하는 프로세서(예를 들 어, 205, 303, 304, 306, 307, 308, 310)를 포함할 수 있다. BSM의 관련성 값이 관련성 임계치를 충족하지 않는다고 결정하는 것(즉, 결정 블록 = \"아니오\")에 응답하 여, 차량 프로세서는 설명된 바와 같이 블록에서 보안 프로세싱을 수행하지 않고 BSM의 프로세싱을 중지할 수 있다. BSM의 관련성 값이 관련성 임계치를 충족한다고 결정하는 것(즉, 결정 블록 = \"예\")에 응답하여, 프로세서 는 블록에서 BSM에 대해 보안 프로세싱을 수행할 수 있다. 일부 실시예들에서, 보안 프로세싱은 BSM의 암 호화 검증을 수행하는 것을 포함할 수 있다. 블록의 동작들을 수행하기 위한 수단은 보안 프로세싱 모듈 을 실행하는 프로세서(예를 들어, 205, 303, 304, 306, 307, 308, 310)를 포함할 수 있다. 결정 블록에서, 프로세서는 BSM이 보안 프로세싱을 통과하는지 여부를 결정할 수 있다. 결정 블록의 동작들을 수행하기 위한 수단은 보안 프로세싱 모듈을 실행하는 프로세서(예를 들어, 205, 303, 304, 306, 307, 308, 310)를 포함할 수 있다. BSM이 보안 프로세싱을 통과하지 않는다고 결정하는 것(즉, 결정 블록 = \"아니오\")에 응답하여, 프로세서 는 블록에서 BSM을 프로세싱하는 것을 중지할 수 있다. 블록의 동작들을 수행하기 위한 수단은 프로 세싱 중지/진행 모듈을 실행하는 프로세서(예를 들어, 205, 303, 304, 306, 307, 308, 310)를 포함할 수 있다. BSM이 보안 프로세싱을 통과한다고 결정하는 것(즉, 결정 블록 = \"예\")에 응답하여, 프로세서는 블록(41 2)에서 BSM에 대해 오작동 검출을 수행할 수 있다. 블록의 동작들을 수행하기 위한 수단은 오작동 검출 모듈을 실행하는 프로세서(예를 들어, 205, 303, 304, 306, 307, 308, 310)를 포함할 수 있다. 결정 블록에서, 프로세서는 오작동이 BSM에서 검출되는지 여부를 결정할 수 있다. 결정 블록의 동작 들을 수행하기 위한 수단은 오작동 검출 모듈을 실행하는 프로세서(예를 들어, 205, 303, 304, 306, 307, 308, 310)를 포함할 수 있다. 오작동이 BSM에서 검출된다고 결정하는 것(즉, 결정 블록 = \"예\")에 응답하여, 프로세서는 블록에서 BSM을 프로세싱하는 것을 중지할 수 있다. 블록의 동작들을 수행하기 위한 수단은 프로세싱 중지/진행 모 듈을 실행하는 프로세서(예를 들어, 205, 303, 304, 306, 307, 308, 310)를 포함할 수 있다. 오작동이 BSM에서 검출되지 않는다고 결정하는 것(즉, 결정 블록 = \"아니오\")에 응답하여, 프로세서는 블 록에서 BSM을 관련 V2X 애플리케이션에 전달할 수 있다. V2X 애플리케이션은 다양한 차량 동작들을 수행 하기 위해 BSM 내의 정보를 사용할 수 있다. 블록의 동작들을 수행하기 위한 수단은 프로세서(예컨대, 205, 303, 304, 306, 307, 308, 310)를 포함할 수 있다. 차량 프로세서는 때때로, 예컨대, 프로세서가 BSM의 발신자로부터 새로운 BSM을 수신할 때, 블록들(401 내지 418)의 동작들을 반복할 수 있다. 도 5는 다양한 실시예들과 함께 사용하기에 적합한 네트워크 컴퓨팅 디바이스의 컴포넌트 블록도이다. 도 1a 내지 도 5를 참조하면, (도 6a 내지 도 6e를 참조하여 설명된 실시예들을 포함하지만 그에 제한되지 않는) 다양한 실시예들이 다양한 컴퓨팅 디바이스들 상에 구현될 수 있으며, 그 예가 서버 디바이스의 형태로 도 5에 예시된다. 네트워크 컴퓨팅 디바이스는 휘발성 메모리 및 디스크 드라이브와 같은 대용량 비휘 발성 메모리에 커플링된 프로세서를 포함할 수 있다. 네트워크 컴퓨팅 디바이스는 또한, 프로세서 에 커플링된 플로피 디스크 드라이브, CD(compact disc) 또는 DVD(digital video disc) 드라이브와 같은 주변 메모리 액세스 디바이스를 포함할 수 있다. 네트워크 컴퓨팅 디바이스는 또한, 다른 시스템 컴 퓨터들 및 서버들에 커플링된 인터넷 및/또는 로컬 영역 네트워크와 같은 네트워크와의 데이터 연결들을 확립하 기 위해 프로세서에 커플링된 네트워크 액세스 포트들(또는 인터페이스들)을 포함할 수 있다. 네트 워크 컴퓨팅 디바이스는 무선 통신 링크에 연결될 수 있는 전자기 방사선을 전송 및 수신하기 위한 하나 이상의 트랜시버들을 포함할 수 있다. 네트워크 컴퓨팅 디바이스는 주변기기들, 외부 메모리, 또는 다른 디바이스들에 커플링하기 위한 추가적인 액세스 포트들, 이를테면 USB, 파이어와이어, 썬더볼트 (Thunderbolt) 등을 포함할 수 있다. 구현예를 다음 단락에서 설명한다. 하기의 구현예들 중 일부가 예시적인 방법들의 관점에서 설명되지만, 추가 의 예시적인 구현예들은 하기의 구현예들의 방법들의 동작들을 수행하기 위해 프로세서 실행가능 명령들로 구성 된 프로세서를 포함하는 탑재 유닛, 모바일 디바이스 유닛, 또는 모바일 컴퓨팅 유닛일 수 있는 V2X 통신 시스 템에 의해 구현되는 하기의 단락들에서 논의되는 예시적인 방법들; 하기의 구현예들의 방법들의 기능들을 수행 하기 위한 수단을 포함하는 차량 V2X 통신 시스템에 의해 구현되는 하기의 단락들에서 논의되는 예시적인 방법 들, 및 V2X 통신 시스템의 프로세서로 하여금 하기의 구현예들의 방법들의 동작들을 수행하게 하도록 구성된 프 로세서 실행가능 명령들이 저장된 비일시적 프로세서 판독가능 저장 매체로서 구현되는 하기의 단락들에서 논의 되는 예시적인 방법들을 포함할 수 있다. 예 1. 기본 안전 메시지(BSM)의 프로세싱을 관리하기 위한 차량의 V2X 통신 시스템의 프로세서에 의해 수행되 는 방법으로서, 수신된 BSM의 관련성 값을, BSM의 보안 프로세싱을 행하기 전에 계산하는 단계; BSM의 관련성 값이 관련성 임계치를 충족하는지 여부를 결정하는 단계; 및 BSM의 관련성 값이 관련성 임계치를 충족하지 않는 다고 결정하는 것에 응답하여, 보안 프로세싱을 수행하지 않고 BSM의 프로세싱을 중지하는 단계를 포함하는, 방 법. 예 2. 예 1에 있어서, BSM의 관련성 값이 관련성 임계치를 충족한다고 결정하는 것에 응답하여, BSM의 보안 프 로세싱을 수행하고, BSM에 대해 오작동 검출 동작을 수행하는 단계를 추가로 포함하는, 방법. 예 3. 예 2에 있어서, BSM의 보안 프로세싱을 수행하는 것은 BSM의 암호화 검증을 수행하는 것을 포함하는, 방 법. 예 4. 예 2에 있어서, BSM에 대해 오작동 검출 동작을 수행하는 것은 BSM의 의미론적 검증을 수행하는 것을 포 함하는, 방법. 예 5. 예 1 내지 예 4 중 임의의 예에 있어서, 수신된 BSM에 대한 관련성 값을 계산하는 단계는 차량과 BSM의 발신자의 역 충돌 시간에 기초하여 관련성 값을 계산하는 단계를 포함하는, 방법. 예 6. 예 1 내지 예 5 중 임의의 예에 있어서, 수신된 BSM에 대한 관련성 값을 계산하는 단계는 차량과 BSM의 발신자의 상대 속도를 차량에서부터 BSM의 발신자까지의 거리로 나눈 것에 기초하여 관련성 값을 계산하는 단계 를 포함하는, 방법. 예 7. 예 1 내지 예 6 중 임의의 예에 있어서, V2X 통신 시스템의 프로세싱 능력 및 차량의 기동 능력에 기초 하여 관련성 임계치를 결정하는 단계를 추가로 포함하는, 방법. 예 8. 예 1 내지 예 7 중 임의의 예에 있어서, V2X 통신 시스템, 또는 자율 또는 반자율 주행 시스템의 반응 시간 및 차량의 제동 시간에 기초하여 관련성 임계치를 결정하는 단계를 추가로 포함하는, 방법. 도시되고 설명된 다양한 실시예는 청구범위의 다양한 특징을 예시하기 위한 예로서만 제공된다. 그러나, 임의 의 주어진 실시예와 관련하여 도시되고 설명된 특징은 관련된 실시예로 반드시 제한되는 것은 아니고, 도시되고 설명되는 다른 실시예와 사용되거나 조합될 수 있다. 더 나아가, 청구범위는 어느 하나의 예시적인 실시예에 의해 제한되도록 의도되지 않는다. 예를 들어, 방법의 동작 중 하나 이상은 방법의 하나 이상의 동작에 대해 대체되거나 이와 조합될 수 있다. 전술한 방법 설명 및 프로세스 흐름도는 단지 예시적인 예로서 제공될 뿐이며, 다양한 실시예의 동작이 제시된 순서로 수행되어야 함을 요구하거나 암시하도록 의도되지 않는다. 당업자에 의해 이해될 바와 같이, 전술한 실 시예에서 동작 순서는 임의의 순서로 수행될 수 있다. \"그 후\", \"그런 다음\", \"다음에\" 등과 같은 단어는 동작 순서를 제한하도록 의도되지 않고; 이러한 단어는 단순히 방법의 설명을 통해 독자를 안내하는 데 사용된다. 추가로, 예를 들어 관사 \"a\", \"an\" 또는 \"the\"를 사용하여 청구범위 엘리먼트를 단수형으로 언급하는 것은 그 엘리먼트를 단수형으로 제한하는 것으로 해석되어서는 안 된다. 본 명세서에 개시된 실시예와 관련하여 설명된 다양한 예시적인 논리 블록, 모듈, 회로, 및 알고리즘 동작은 전 자 하드웨어, 컴퓨터 소프트웨어, 또는 둘 모두의 조합으로서 구현될 수 있다. 이러한 하드웨어와 소프트웨어 의 상호 교환성을 명확하게 예시하기 위해, 다양한 예시적인 컴포넌트, 블록, 모듈, 회로, 및 동작을 대체적으 로 그들의 기능 측면에서 위에서 설명하였다. 그러한 기능이 하드웨어로 구현될지 또는 소프트웨어로 구현될지 는 특정 애플리케이션 및 전체 시스템에 대해 부과된 설계 제약들에 의존한다. 당업자는 각 특정 애플리케이션 에 대해 다양한 방식으로 설명된 기능을 구현할 수 있지만, 이러한 구현 결정은 청구범위의 범주로부터 벗어나 는 것으로 해석되어서는 안 된다. 본 명세서에 개시된 실시예들과 관련하여 설명된 다양한 예시적인 로직들, 논리 블록들, 모듈들, 및 회로들을 구현하는 데 사용되는 하드웨어는 범용 프로세서, 디지털 신호 프로세서(DSP), 주문형 집적회로(ASIC), 필드 프 로그래밍가능 게이트 어레이(FPGA) 또는 다른 프로그래밍가능 로직 디바이스, 이산 게이트 또는 트랜지스터 로 직, 이산 하드웨어 컴포넌트들, 또는 본 명세서에서 설명된 기능들을 수행하도록 설계되는 이들의 임의의 조합 으로 구현 또는 수행될 수 있다. 범용 프로세서는 마이크로프로세서일 수 있지만, 대안적으로, 프로세서는 임 의의 종래의 프로세서, 제어기, 마이크로제어기, 또는 상태 머신일 수 있다. 또한, 프로세서는 컴퓨팅 디바이 스들의 조합, 예컨대 DSP와 마이크로프로세서의 조합, 복수의 마이크로프로세서들, DSP 코어와 결합된 하나 이 상의 마이크로프로세서들, 또는 임의의 다른 그러한 구성으로서 구현될 수 있다. 대안적으로, 일부 동작 또는 방법은 주어진 기능에 특정한 회로에 의해 수행될 수 있다. 하나 이상의 실시예에서, 설명된 기능은 하드웨어, 소프트웨어, 펌웨어, 또는 이들의 임의의 조합으로 구현될 수 있다. 소프트웨어로 구현되는 경우, 기능은 비일시적 컴퓨터 판독가능 저장 매체 또는 비일시적 프로세서 판독가능 저장 매체에 하나 이상의 명령 또는 코드로 저장될 수 있다. 본 명세서에 개시된 방법이나 알고리즘 의 동작은 비일시적 컴퓨터 판독가능 또는 프로세서 판독가능 저장 매체에 상주할 수 있는 프로세서 실행가능 소프트웨어 모듈로 구현될 수 있다. 비일시적 컴퓨터 판독가능 또는 프로세서 판독가능 저장 매체는 컴퓨터 또 는 프로세서에 의해 액세스될 수 있는 임의의 저장 매체일 수 있다. 비제한적인 예로서, 이러한 비일시적 컴퓨 터 판독가능 또는 프로세서 판독가능 저장 매체는 RAM, ROM, EEPROM, 플래시 메모리, CD-ROM이나 다른 광학 디 스크 스토리지, 자기 디스크 스토리지나 다른 자기 저장 디바이스, 또는 원하는 프로그램 코드를 명령이나 데이 터 구조의 형태로 저장하는 데 사용될 수 있으며 컴퓨터에 의해 액세스될 수 있는 임의의 다른 매체를 포함할 수 있다. 본 명세서에서 사용된 디스크(disk) 및 디스크(disc)는 CD(compact disc), 레이저 디스크(disc), 광 학 디스크(disc), DVD(digital versatile disc), 플로피 디스크(disk) 및 블루-레이 디스크(disc)를 포함하며, 여기서 디스크(disk)들은 일반적으로 데이터를 자기적으로 재생하지만, 디스크(disc)들은 레이저를 이용하여 광 학적으로 데이터를 재생한다. 위의 조합이 또한 비일시적 컴퓨터 판독가능 및 프로세서 판독가능 저장 매체의 범주 내에 포함된다. 부가적으로, 방법이나 알고리즘의 동작은 컴퓨터 프로그램 제품에 통합될 수 있는 비일시 적 프로세서 판독가능 저장 매체 및/또는 컴퓨터 판독가능 저장 매체에 코드 및/또는 명령 중 하나 또는 임의의 조합 또는 세트로서 상주할 수 있다. 개시된 실시예의 전술한 설명은 당업자가 청구범위를 작성하거나 이용할 수 있도록 제공된다. 이러한 실시예에 대한 다양한 수정은 당업자에게 용이하게 자명할 것이고, 본 명세서에서 정의된 대체적인 원리는 청구범위의 범 주로부터 벗어남이 없이 다른 실시예에 적용될 수 있다. 따라서, 본 개시내용은 본 명세서에 도시된 실시예에 제한되도록 의도된 것이 아니라, 다음의 청구범위 및 본 명세서에 개시된 원리 및 신규 특징과 일치하는 가장 넓은 범주에 부합되어야 한다.도면 도면1a 도면1b 도면1c 도면2a 도면2b 도면3a 도면3b 도면4a 도면4b 도면5"}
{"patent_id": "10-2024-7038257", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 명세서에 통합되며 본 명세서의 일부를 구성하는 첨부 도면은 청구범위의 예시적인 실시예를 도시하고, 주어 진 전반적인 설명 및 상세한 설명과 함께 본 명세서의 특징을 설명하도록 제공한다. 도 1a는 다양한 실시예들을 구현하기에 적합한 예시적인 통신 시스템을 예시하는 시스템 블록도이다. 도 1b는 다양한 실시예들 중 임의의 것을 구현하기에 적합한 예시적인 디스어그리게이팅된(disaggregated) 기지 국 아키텍처를 예시하는 시스템 블록도이다. 도 1c는 다양한 실시예들을 구현하기에 적합한 통신 시스템을 예시하는 시스템 블록도이다. 도 2a는 다양한 실시예들을 구현하기에 적합한 예시적인 차량 V2X 통신 시스템의 컴포넌트 도면이다. 도 2b는 다양한 실시예들을 구현하기에 적합한 예시적인 차량 자율/반자율 주행 시스템 V2X 통신 시스템의 컴포 넌트들을 예시하는 컴포넌트 블록도이다. 도 3a는 다양한 실시예들에 따른, 차량 V2X 통신 시스템에서 사용하기 위한 시스템 온 칩(system on chip, SO C)의 컴포넌트들을 예시하는 블록도이다. 도 3b는 다양한 실시예들에 따라 구성된 차량 V2X 통신 시스템의 엘리먼트들을 예시하는 컴포넌트 블록도이다. 도 4a는 다양한 실시예들에 따른, 오작동 보고들의 송신을 관리하기 위한 차량 V2X 통신 시스템의 프로세서에 의해 수행되는 예시적인 방법의 프로세스 흐름도이다. 도 4b는 다양한 실시예들에 따른, 오작동 보고들의 송신을 관리하기 위한 방법들의 일부로서 차량 V2X 통신 시 스템의 프로세서에 의해 수행될 수 있는 예시적인 동작들의 프로세스 흐름도이다. 도 5는 다양한 실시예들과 함께 사용하기에 적합한 컴퓨팅 디바이스의 컴포넌트 블록도이다."}
