{"patent_id": "10-2014-0083574", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2016-0004719", "출원번호": "10-2014-0083574", "발명의 명칭": "콘텐츠 제공 방법 및 장치", "출원인": "삼성전자주식회사", "발명자": "임새미"}}
{"patent_id": "10-2014-0083574", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에서의 콘텐츠 제공 방법에 있어서,콘텐츠의 속성을 분석하여 상기 콘텐츠의 제1 영역과 상기 제1 영역과 연관된 상기 콘텐츠의 제2 영역을 매핑시키는 매핑 테이블을 생성하는 동작과,상기 매핑 테이블에 관련된 제2 영역의 콘텐츠 정보를 제2 전자 장치로 전송하고, 상기 콘텐츠의 제1 영역을 출력부에 출력하는 동작을 포함하는 방법."}
{"patent_id": "10-2014-0083574", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 생성하는 동작은,상기 콘텐츠의 속성으로서 상기 콘텐츠에 포함된 데이터의 종류, 상기 콘텐츠의 페이지 번호, 상기 콘텐츠의 레이어 및 상기 콘텐츠의 마디수 중 적어도 하나를 분석하는 동작을 포함하는 방법."}
{"patent_id": "10-2014-0083574", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 생성하는 동작은,상기 콘텐츠로부터 상기 콘텐츠의 속성을 획득하거나, 상기 콘텐츠를 분석하여 상기 콘텐츠의 속성을 생성하거나, 및 사용자로부터 상기 콘텐츠의 속성을 설정받는 것 중 적어도 하나를 수행하는 동작을 포함하는 방법."}
{"patent_id": "10-2014-0083574", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 생성하는 동작은,상기 콘텐츠를 선택받는 동작과,상기 제2 전자 장치와 연결되는지 여부를 검출하는 동작과,상기 선택된 콘텐츠의 속성에 기초하여 상기 연결된 제2 전자 장치에 상기 콘텐츠의 제1 영역 또는 상기 콘텐츠의 제2 영역을 매핑하여 상기 매핑 테이블을 생성하는 동작을 포함하는 방법."}
{"patent_id": "10-2014-0083574", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 생성하는 동작은,상기 연결된 제2 전자 장치가 적어도 두 개 이상인 경우, 각 제2 전자 장치로부터 각 장치 타입을 수신하는 동작과,상기 콘텐츠의 속성 및 상기 각 장치 타입에 기초하여 각 제2 전자 장치에 상기 콘텐츠의 제1 영역 또는 상기콘텐츠의 제2 영역을 매핑하여 상기 매핑 테이블을 생성하는 동작을 포함하는 방법."}
{"patent_id": "10-2014-0083574", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 생성하는 동작은,상기 콘텐츠가 악보와 관련된 경우, 상기 악보에 포함된 악기를 분석하는 동작과,복수의 제2 전자 장치로부터 각 장치 타입을 수신하는 동작과,상기 각 장치 타입에 기초하여 각 제2 전자 장치와 상기 분석된 악보의 악기를 매핑하여 상기 매핑 테이블을 생성하는 동작을 포함하는 방법."}
{"patent_id": "10-2014-0083574", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2016-0004719-2-제6항에 있어서, 상기 출력하는 동작은,음을 분석하여 상기 음과 관련된 악보의 마디를 확인하는 동작과,상기 마디와 관련된 콘텐츠 정보를 각 제2 전자 장치로 전송하고, 상기 마디와 관련된 악보를 표시부를 통해 표시하는 동작을 포함하는 방법."}
{"patent_id": "10-2014-0083574", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 매핑 테이블을 상기 제2 전자 장치로 전송하는 동작을 더 포함하는 방법."}
{"patent_id": "10-2014-0083574", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서, 상기 출력하는 동작은,표시부에 상기 콘텐츠의 제1 영역을 표시하고, 상기 제2 전자 장치가 일정거리 이내에 위치하는 경우, 상기 표시부에 표시되지 않는 제2 영역의 콘텐츠 정보를 상기 제2 전자 장치로 전송하는 동작을 포함하는 방법."}
{"patent_id": "10-2014-0083574", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 출력하는 동작은,사용자의 입력을 감지하는 동작과,상기 사용자의 입력에 대응하여 상기 표시부에 상기 콘텐츠의 제3 영역을 표시하고, 상기 표시부에 표시되지 않는 제4 영역의 콘텐츠 정보를 상기 제2 전자 장치로 전송하는 동작을 포함하는 방법."}
{"patent_id": "10-2014-0083574", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "콘텐츠의 속성을 분석하여 상기 콘텐츠의 제1 영역과 상기 제1 영역과 연관된 상기 콘텐츠의 제2 영역을 매핑시키는 매핑 테이블을 생성하는 제어부와,상기 매핑 테이블에 관련된 제2 영역의 콘텐츠 정보를 제2 전자 장치로 전송하는 통신부와, 상기 콘텐츠의 출력하는 출력부를 포함하는 전자 장치."}
{"patent_id": "10-2014-0083574", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 상기 제어부는,상기 콘텐츠의 속성으로서 상기 콘텐츠에 포함된 데이터의 종류, 상기 콘텐츠의 페이지 번호, 상기 콘텐츠의 레이어 및 상기 콘텐츠의 마디수 중 적어도 하나를 분석하는 분석 모듈을 포함하는 전자 장치."}
{"patent_id": "10-2014-0083574", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서, 상기 제어부는,상기 콘텐츠로부터 상기 콘텐츠의 속성을 획득하거나, 상기 콘텐츠를 분석하여 상기 콘텐츠의 속성을 생성하거나, 및 사용자로부터 상기 콘텐츠의 속성을 설정받는 전자 장치."}
{"patent_id": "10-2014-0083574", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제1항에 있어서, 상기 콘텐츠를 선택받는 입력부를 더 포함하고,상기 제어부는,상기 제2 전자 장치와 연결되는지 여부를 검출하는 검출 모듈과, 상기 선택된 콘텐츠의 속성에 기초하여 상기연결된 제2 전자 장치에 상기 콘텐츠의 제1 영역 또는 상기 콘텐츠의 제2 영역을 매핑하여 상기 매핑 테이블을생성하는 생성 모듈을 포함하는 전자 장치.공개특허 10-2016-0004719-3-청구항 15 제14항에 있어서, 상기 통신부는, 상기 연결된 제2 전자 장치가 적어도 두 개 이상인 경우, 각 제2 전자 장치로부터 각 장치 타입을 수신하고,상기 생성 모듈은, 상기 콘텐츠의 속성 및 상기 각 장치 타입에 기초하여 각 제2 전자 장치에 상기 콘텐츠의 제1 영역 또는 상기 콘텐츠의 제2 영역을 매핑하여 상기 매핑 테이블을 생성하는 전자 장치."}
{"patent_id": "10-2014-0083574", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제11항에 있어서, 상기 제어부는, 상기 콘텐츠가 악보와 관련된 경우, 상기 악보에 포함된 악기를 분석하는 분석 모듈을포함하고,상기 통신부는, 복수의 제2 전자 장치로부터 각 장치 타입을 수신하고,상기 제어부는, 상기 각 장치 타입에 기초하여 각 제2 전자 장치와 상기 분석된 악보의 악기를 매핑하여 상기매핑 테이블을 생성하는 생성 모듈을 포함하는 전자 장치."}
{"patent_id": "10-2014-0083574", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서, 상기 제어부는, 음을 분석하여 상기 음과 관련된 악보의 마디를 확인하고,상기 통신부는, 상기 마디와 관련된 콘텐츠 정보를 각 제2 전자 장치로 전송하고, 상기 마디와 관련된 악보를 표시하는 표시부를 더 포함하는 전자 장치."}
{"patent_id": "10-2014-0083574", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제11항에 있어서, 상기 통신부는, 상기 매핑 테이블을 상기 제2 전자 장치로 전송하는 전자 장치."}
{"patent_id": "10-2014-0083574", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제11항에 있어서, 상기 콘텐츠의 제1 영역을 표시하는 표시부를 더 포함하고,상기 통신부는, 상기 제2 전자 장치가 일정거리 이내에 위치하는 경우, 상기 표시부에 표시되지 않는 제2 영역의 콘텐츠 정보를 상기 제2 전자 장치로 전송하는 전자 장치."}
{"patent_id": "10-2014-0083574", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서, 상기 제어부는, 사용자의 입력을 감지하고,상기 표시부는, 상기 사용자의 입력에 대응하여 상기 콘텐츠의 제3 영역을 표시하고, 상기 통신부는, 상기 표시부에 표시되지 않는 제4 영역의 콘텐츠 정보를 상기 제2 전자 장치로 전송하는 전자장치."}
{"patent_id": "10-2014-0083574", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "콘텐츠의 속성을 분석하여 상기 콘텐츠의 제1 영역과 상기 제1 영역과 연관된 상기 콘텐츠의 제2 영역을 매핑시키는 매핑 테이블을 생성하는 제어부와, 상기 매핑 테이블에 관련된 제2 영역의 콘텐츠 정보를 제2 전자 장치로전송하는 통신부와, 상기 콘텐츠의 출력하는 출력부를 포함하는 제1 전자 장치와,상기 매핑 테이블에 관련된 제2 영역의 콘텐츠 정보를 수신하는 통신부와, 상기 제2 영역의 콘텐츠 정보에 기초공개특허 10-2016-0004719-4-하여 상기 콘텐츠의 제2 영역을 출력하는 출력부를 포함하는 제2 전자 장치를 포함하는 콘텐츠 제공 시스템."}
{"patent_id": "10-2014-0083574", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 다양한 실시예는 콘텐츠의 속성을 분석하여 상기 콘텐츠의 제1 영역과 상기 제1 영역과 연관된 상기 콘텐츠의 제2 영역을 매핑시키는 매핑 테이블을 생성하는 동작과, 상기 매핑 테이블에 관련된 제2 영역의 콘텐츠 정보를 제2 전자 장치로 전송하고, 상기 콘텐츠의 제1 영역을 출력부에 출력하는 동작을 포함하는 콘텐츠 제공 방법 및 장치를 제공한다. 또한, 다른 실시예도 가능하다."}
{"patent_id": "10-2014-0083574", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 다수의 전자 장치들로 콘텐츠를 제공하는 방안에 관한 것이다."}
{"patent_id": "10-2014-0083574", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "N 스크린(N-screen)은 하나의 멀티미디어 콘텐츠(영화, 음악 등)를 N개의 기기에서 \"연속적으로\" 즐길 수 있는 기술(또는 서비스)를 말한다. 예를 들어, 사용자가 가정에서 TV로 보던 방송이나 영화를, 외출하면서 스마트 폰이나 태블릿 PC(또는 노트북)로 '이어 볼 수' 있는 것이 N스크린이다. 어떤 기기든 마지막까지 보던 장면 다음부터 N개의 IT 기기에서 시청할 수 있는 것이다. 참고로, 하나의 콘텐츠를 여러 기기에서 볼 수 있는 것을 일컬어 'OSMU(one source multi use)'라 한다. 또한, 이어보기뿐 아니라 TV로 드라마를 시청하면서 그와 관련된 추가 정보, 이를 테면 미공개 영상이나 촬영지 /소품 정보 등도 스마트폰이나 태블릿 PC로 볼 수 있다. 참고로, 특정 주제에 관한 다양한 정보를 접할 수 있 는 것을 일컬어 'ASMD(adaptive source multi device)'라 한다."}
{"patent_id": "10-2014-0083574", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "ASMD 방식은 콘텐츠의 기획단계에서부터 다양한 기기에 부가 콘텐츠를 전송할 수 있도록 제작된다. N-Screen 시 나리오에서 다양한 사용자 경험을 제공하기 위해서는 콘텐츠 자체가 N-Screen 형태로 제작되어야 하지만, OSMU 방식은 기존에 보급되어 있는 콘텐츠를 사용하여 확장된 사용자 경험을 제공할 수 있기 때문에 ASMD 방식보다 비교적 구현이 쉽고, 사용 방법도 간단한 편이다. 종래의 N-Screen 환경의 OSMU 방식은 하나의 콘텐츠를 다른 기기에 동일하게 재생하는 방법으로, 다수의 사용자 들이 동일한 동기화된 영상을 볼 수 있는 방법에 관한 것이다. 하나의 콘텐츠를 동시에 다수의 기기들의 화면 을 통해 이용하는 것에는 적합한 방법이지만, 하나의 콘텐츠에 대해 동기화된 상이한 화면들을 다수의 기기들로 표시하는 방법에 대한 사용자 니즈(needs)를 해결할 수 있는 방법에 대한 고려는 없다. 본 발명의 다양한 일실시예는 휴대 단말기와 표시 장치가 서로 다른 화면을 보여주면서, 동기화된 동작을 수행 하는 것으로, 하나의 콘텐츠를 사용 목적에 따라 다양하게 활용할 수 있는콘텐츠 콘텐츠 제공 방법 및 장치를 제공함을 목적으로 한다."}
{"patent_id": "10-2014-0083574", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 다양한 일실시예에 따른 전자 장치를 이용한 콘텐츠 제공 방법은 콘텐츠의 속성을 분석하여 상기 콘 텐츠의 제1 영역과 상기 제1 영역과 연관된 상기 콘텐츠의 제2 영역을 매핑시키는 매핑 테이블을 생성하는 동작 과, 상기 매핑 테이블에 관련된 제2 영역의 콘텐츠 정보를 제2 전자 장치로 전송하고, 상기 콘텐츠의 제1 영역 을 출력부에 출력하는 동작을 포함할 수 있다. 본 발명의 다양한 실시예에 따른 전자 장치는 콘텐츠의 속성을 분석하여 상기 콘텐츠의 제1 영역과 상기 제1 영 역과 연관된 상기 콘텐츠의 제2 영역을 매핑시키는 매핑 테이블을 생성하는 제어부와, 상기 매핑 테이블에 관련 된 제2 영역의 콘텐츠 정보를 제2 전자 장치로 전송하는 통신부와, 상기 콘텐츠의 출력하는 출력부를 포함할 수 있다."}
{"patent_id": "10-2014-0083574", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "다양한 일실시예에 따르면, 콘텐츠의 속성에 따라 하나의 콘텐츠를 적어도 2 이상의 영역으로 분류하여 다수의 전자 장치들을 통해 재생할 수 있어, 하나의 콘텐츠를 사용 목적에 따라 다양하게 활용할 수 있다. 다양한 실시예에 따르면, 간단한 조작으로, OSMU 콘텐츠를 ASMD같은 효과를 낼 수 있도록 하여, 전자 장치 별로 필요한 정보를 분리하여 보여줄 수 있다. 다양한 실시예에 따르면, 하나의 콘텐츠를 필요에 따라 각각 다르게 동기화하여 동기화된 콘텐츠에 해당하는 전 자 장치로 제공할 수 있다. 다양한 실시예에 따르면, 휴대 단말기와 스마트 TV 등의 다른 기기와 연동하여, 상기 스마트 TV의 킬러 콘텐츠 가 부족한 상황에서 상기 휴대 단말기와 연동된 스마트 TV 콘텐츠를 제공할 수 있다. 다양한 실시예에 따르면, 콘텐츠 제작사들과 협업을 통해 새로운 contents 생태계를 조성할 수 있는 기반 환경 을 조성할 수 있다. 또한, 기존에 보급되어 있는 콘텐츠를 최소한의 수정 또는 사용자의 설정 정보를 이용하여 다양한 형태로 응용하여 활용할 수 있다."}
{"patent_id": "10-2014-0083574", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면들을 참조하여 다양한 실시예들을 상세히 설명한다. 이때, 첨부된 도면들에서 동일한 구성 요 소는 가능한 동일한 부호로 나타내고 있음에 유의해야 한다. 또한 본 발명의 요지를 흐리게 할 수 있는 공지 기능 및 구성에 대한 상세한 설명은 생략할 것이다. 하기의 설명에서는 본 발명의 다양한 실시 예들에 따른 동 작을 이해하는데 필요한 부분만이 설명되며, 그 이외 부분의 설명은 본 발명의 요지를 흩트리지 않도록 생략될 것이라는 것을 유의하여야 한다. 본 개시 가운데 사용될 수 있는 \"포함한다\" 또는 \"포함할 수 있다\" 등의 표현은 개시된 해당 기능, 동작 또는 구성요소 등의 존재를 가리키며, 추가적인 하나 이상의 기능, 동작 또는 구성요소 등을 제한하지 않는다. 또한, 본 개시에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요 소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 개시에서 \"또는\" 등의 표현은 함께 나열된 단어들의 다양한, 그리고 모든 조합을 포함한다. 예를 들어, \"A 또는 B\"는, A를 포함할 수도, B를 포함할 수도, 또는 A 와 B 모두를 포함할 수도 있다. 본 개시 가운데 \"제1\", \"제2\", \"첫째\", 또는 \"둘째\", 등의 표현들이 본 개시의 다양한 구성요소들을 수식할 수 있지만, 해당 구성요소들을 한정하지 않는다. 예를 들어, 상기 표현들은 해당 구성요소들의 순서 및/또는 중요도 등을 한정하지 않는다. 상기 표현들은 한 구성요소를 다른 구성요소와 구분 짓기 위해 사용될 수 있다. 예 를 들어, 제1 사용자 기기와 제 2 사용자 기기는 모두 사용자 기기이며, 서로 다른 사용자 기기를 나타낸다. 예를 들어, 본 개시의 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하 게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있 다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해될 수 있어야 할 것이다. 본 개시에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 개시를 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥 상 가지는 의미와 일치하는 의미를 가지는 것으로 해석되어야 하며, 본 개시에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식 적인 의미로 해석되지 않는다. 본 개시에서 마스터 단말기는 \"전자 장치\" 또는 \"제1 전자 장치\"로 기재하고, 슬레이브 단말기는 \"제2 전자 장 치\", \"제3 전자 장치\", \"제2-1 전자 장치\"로 기재한다. 또한 제1 전자 장치와 제2 전자 장치에 동일하게 포함 된 구성요소들에 대해서, 제1 전자 장치에 포함된 구성요소 앞에는 \"제1\"을 붙이고, 제2 전자 장치에 포함된 구 성요소 앞에는 \"제2\"를 붙여, 제1 전자 장치와 제2 전자 장치에 포함된 구성요소가 혼동되지 않도록 한다. 본 개시에 따른 전자 장치는, 통신 기능이 포함된 장치일 수 있다. 예를 들면, 전자 장치는 스마트 폰 (smartphone), 태블릿 PC(tablet personal computer), 이동 전화기(mobile phone), 화상전화기, 전자북 리더기 (e-book reader), 데스크탑 PC(desktop personal computer), 랩탑 PC(laptop personal computer), 넷북 컴퓨터 (netbook computer), PDA(personal digital assistant), PMP(portable multimedia player), MP3 플레이어, 모 바일 의료기기, 카메라(camera), 또는 웨어러블 장치(wearable device)(예: 전자 안경과 같은 head-mounted- device(HMD), 전자 의복, 전자 팔찌, 전자 목걸이, 전자 앱세서리(appcessory), 전자 문신, 또는 스마트 와치 (smartwatch))중 적어도 하나를 포함할 수 있다. 어떤 실시예들에 따르면, 전자 장치는 통신 기능을 갖춘 스마트 가전 제품(smart home appliance)일 수 있다. 스마트 가전 제품은, 예를 들자면, 전자 장치는 텔레비전, DVD(digital video disk) 플레이어, 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스(set-top box), TV 박스(예를 들면, 삼성 HomeSyncTM, 애플TVTM, 또는 구글 TVTM), 게임 콘솔(game consoles), 전자 사전, 전자 키, 캠코더(camcorder), 또는 전자 액자 중 적어도 하나를 포함할 수 있다. 어떤 실시예들에 따르면, 전자 장치는 각종 의료기기(예: MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 초음파기 등), 네비게이션(navigation) 장치, GPS 수 신기(global positioning system receiver), EDR(event data recorder), FDR(flight data recorder), 자동차 인포테인먼트(infotainment) 장치, 선박용 전자 장비(예: 선박용 항법 장치 및 자이로 콤파스 등), 항공 전자기 기(avionics), 보안 기기, 차량용 헤드 유닛, 산업용 또는 가정용 로봇, 금융 기관의 ATM(automatic teller뭩 machine) 또는 상점의 POS(point of sales) 중 적어도 하나를 포함할 수 있다. 어떤 실시예들에 따르면, 전자 장치는 통신 기능을 포함한 가구(furniture) 또는 건물/구조물의 일부, 전자 보 드(electronic board), 전자 사인 입력장치(electronic signature receiving device), 프로젝터(projector), 또는 각종 계측기기(예: 수도, 전기, 가스, 또는 전파 계측 기기 등) 중 적어도 하나를 포함할 수 있다. 본 개 시에 따른 전자 장치는 전술한 다양한 장치들 중 하나 또는 그 이상의 조합일 수 있다. 또한, 본 개시에 따른 전자 장치는 플렉서블 장치일 수 있다. 또한, 본 개시에 따른 전자 장치는 전술한 기기들에 한정되지 않음은 당 업자에게 자명하다. 이하, 첨부된 도면을 참조하여 다양한 실시예에 따른 전자 장치에 대해서 살펴본다. 다양한 실시예에서 이용되 는 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공지능 전자 장치)를 지칭할 수 있다.도 1은 다양한 실시예에 따른 전자 장치를 포함하는 네트워크 100 환경을 도시한 도면이다. 도 1을 참조하면, 상기 전자 장치 101는 버스 110, 프로세서 120, 메모리 130, 입출력 인터페이스 140, 디스플 레이 150, 통신 인터페이스 160 및 제어부 170을 포함할 수 있다. 상기 버스 110는 전술한 구성요소들을 서로 연결하고, 전술한 구성요소들 간의 통신(예: 제어 메시지)을 전달하 는 회로일 수 있다. 상기 프로세서 120는, 예를 들면, 상기 버스 110를 통해 전술한 다른 구성요소들(예: 상기 메모리 130, 상기 입 출력 인터페이스 140, 상기 디스플레이 150, 상기 통신 인터페이스 160, 또는 상기 제어부 170 등)로부터 명령 을 수신하여, 수신된 명령을 해독하고, 해독된 명령에 따른 연산이나 데이터 처리를 실행할 수 있다. 상기 메모리 130는, 상기 프로세서 120 또는 다른 구성요소들(예: 상기 입출력 인터페이스 140, 상기 디스플레 이 150, 상기 통신 인터페이스 160, 또는 상기 제어부 170 등)로부터 수신되거나 상기 프로세서 120 또는 다른 구성요소들에 의해 생성된 명령 또는 데이터를 저장할 수 있다. 상기 메모리 130는, 예를 들면, 커널 131, 미 들웨어 132, 어플리케이션 프로그래밍 인터페이스(API: application programming interface) 133 또는 어플리 케이션 134 등의 프로그래밍 모듈들을 포함할 수 있다. 전술한 각각의 프로그래밍 모듈들은 소프트웨어, 펌웨 어, 하드웨어 또는 이들 중 적어도 둘 이상의 조합으로 구성될 수 있다. 상기 커널 131은 나머지 다른 프로그래밍 모듈들, 예를 들면, 상기 미들웨어 132, 상기 API 133 또는 상기 어플 리케이션 134에 구현된 동작 또는 기능을 실행하는 데 사용되는 시스템 리소스들(예: 상기 버스 110, 상기 프로 세서 120 또는 상기 메모리 130 등)을 제어 또는 관리할 수 있다. 또한, 상기 커널 131은 상기 미들웨어 132, 상기 API 133 또는 상기 어플리케이션 134에서 상기 전자 장치 101의 개별 구성요소에 접근하여 제어 또는 관리 할 수 있는 인터페이스를 제공할 수 있다. 상기 미들웨어 132는 상기 API 133 또는 상기 어플리케이션 134이 상기 커널 131과 통신하여 데이터를 주고받을 수 있도록 중개 역할을 수행할 수 있다. 또한, 상기 미들웨어 132는 상기 어플리케이션 134로부터 수신된 작업 요청들과 관련하여, 예를 들면, 상기 어플리케이션 134 중 적어도 하나의 어플리케이션에 상기 전자 장치 101의 시스템 리소스(예: 상기 버스 110, 상기 프로세서 120 또는 상기 메모리 130 등)를 사용할 수 있는 우선 순위를 배정하는 등의 방법을 이용하여 작업 요청에 대한 제어(예: 스케쥴링 또는 로드 밸런싱)을 수행할 수 있다. 상기 API 133는 상기 어플리케이션 134이 상기 커널 131 또는 상기 미들웨어 132에서 제공되는 기능을 제어하기 위한 인터페이스로, 예를 들면, 파일 제어, 창 제어, 화상 처리 또는 문자 제어 등을 위한 적어도 하나의 인터 페이스 또는 함수(예: 명령어)를 포함할 수 있다. 다양한 실시예에 따르면, 상기 어플리케이션 134은 SMS/MMS 어플리케이션, 이메일 어플리케이션, 달력 어플리케 이션, 알람 어플리케이션, 건강 관리(health care) 어플리케이션(예: 운동량 또는 혈당 등을 측정하는 어플리케 이션) 또는 환경 정보 어플리케이션(예: 기압, 습도 또는 온도 정보 등을 제공하는 어플리케이션) 등을 포함할 수 있다. 추가적으로 또는 대체적으로, 상기 어플리케이션 134은 상기 전자 장치 101와 외부 전자 장치(예: 전 자 장치 104) 사이의 정보 교환과 관련된 어플리케이션일 수 있다. 상기 정보 교환과 관련된 어플리케이션은, 예를 들어, 상기 외부 전자 장치에 특정 정보를 전달하기 위한 알림 전달(notification relay) 어플리케이션, 또는 상기 외부 전자 장치를 관리하기 위한 장치 관리(device management) 어플리케이션을 포함할 수 있다. 예를 들면, 상기 알림 전달 어플리케이션은 상기 전자 장치 101 의 다른 어플리케이션(예: SMS/MMS 어플리케이 션, 이메일 어플리케이션, 건강 관리 어플리케이션 또는 환경 정보 어플리케이션 등)에서 발생한 알림 정보를 외부 전자 장치(예: 전자 장치 104)로 전달하는 기능을 포함할 수 있다. 추가적으로 또는 대체적으로, 상기 알 림 전달 어플리케이션은, 예를 들면, 외부 전자 장치(예: 전자 장치 104)로부터 알림 정보를 수신하여 사용자에 게 제공할 수 있다. 상기 장치 관리 어플리케이션은, 예를 들면, 상기 전자 장치 101와 통신하는 외부 전자 장 치(예: 전자 장치 104)의 적어도 일부에 대한 기능(예: 외부 전자 장치 자체(또는, 일부 구성 부품)의 턴온/턴 오프 또는 디스플레이의 밝기(또는, 해상도) 조절), 상기 외부 전자 장치에서 동작하는 어플리케이션 또는 상기 외부 전자 장치에서 제공되는 서비스(예: 통화 서비스 또는 메시지 서비스)를 관리(예: 설치, 삭제 또는 업데이 트)할 수 있다. 다양한 실시예에 따르면, 상기 어플리케이션 134은 상기 외부 전자 장치(예: 전자 장치 104)의 속성(예: 전자 장치의 종류)에 따라 지정된 어플리케이션을 포함할 수 있다. 예를 들어, 외부 전자 장치가 MP3 플레이어인 경 우, 상기 어플리케이션 134은 음악 재생과 관련된 어플리케이션을 포함할 수 있다. 유사하게, 외부 전자 장치가 모바일 의료기기인 경우, 상기 어플리케이션 134은 건강 관리와 관련된 어플리케이션을 포함할 수 있다. 한 실시예에 따르면, 상기 어플리케이션 134은 전자 장치 101에 지정된 어플리케이션 또는 외부 전자 장치(예: 서 버 106 또는 전자 장치 104)로부터 수신된 어플리케이션 중 적어도 하나를 포함할 수 있다. 상기 입출력 인터페이스 140은 입출력 장치(예: 센서, 키보드 또는 터치 스크린)를 통하여 상기 사용자로부터 입력된 명령 또는 데이터를, 예를 들면, 상기 버스 110를 통해 상기 프로세서 120, 상기 메모리 130, 상기 통신 인터페이스 160, 또는 상기 제어부 170에 전달할 수 있다. 예를 들면, 상기 입출력 인터페이스 140은 터치스크 린을 통하여 입력된 사용자의 터치에 대한 데이터를 상기 프로세서 120로 제공할 수 있다. 또한, 상기 입출력 인터페이스 140은, 예를 들면, 상기 버스 110을 통해 상기 프로세서 120, 상기 메모리 130, 상기 통신 인터페이 스 160, 또는 상기 제어부 170로부터 수신된 명령 또는 데이터를 상기 입출력 장치(예: 스피커 또는 디스플레이)를 통하여 출력할 수 있다. 예를 들면, 상기 입출력 인터페이스 140은 상기 프로세서 120를 통하여 처리된 음성 데이터를 스피커를 통하여 상기 사용자에게 출력할 수 있다. 상기 디스플레이 150은 상기 사용자에게 각종 정보(예: 멀티미디어 데이터 또는 텍스트 데이터 등)을 표시할 수 있다. 상기 통신 인터페이스 160은 상기 전자 장치 101와 외부 장치(예: 전자 장치 104 또는 서버 106) 간의 통신을 연결할 수 있다. 예를 들면, 상기 통신 인터페이스 160은 무선 통신 또는 유선 통신을 통해서 네트워크 162에 연결되어 상기 외부 장치와 통신할 수 있다. 상기 무선 통신은, 예를 들어, Wifi(wireless fidelity), BT(Bluetooth), NFC(near field communication), GPS(global positioning system) 또는 cellular 통신(예: LTE, LTE-A, CDMA, WCDMA, UMTS, WiBro 또는 GSM 등) 중 적어도 하나를 포함할 수 있다. 상기 유선 통신은, 예 를 들어, USB(universal serial bus), HDMI(high definition multimedia interface), RS-232(recommended standard 232) 또는 POTS(plain old telephone service) 중 적어도 하나를 포함할 수 있다. 한 실시예에 따르면, 상기 네트워크 162는 통신 네트워크(telecommunications network)일 수 있다. 상기 통신 네트워크 는 컴퓨터 네트워크(computer network), 인터넷(internet), 사물 인터넷(internet of things) 또는 전화망(telephone network) 중 적어도 하나를 포함할 수 있다. 한 실시예에 따르면, 상기 전자 장치 101와 외부 장치 간의 통신을 위한 프로토콜(예: transport layer protocol, data link layer protocol 또는 physical layer protocol)은 어플리케이션 134, 어플리케이션 프로그래밍 인터페이스 133, 상기 미들웨어 132, 커널 131 또는 통신 인터페이스 160 중 적어도 하나에서 지원될 수 있다. 제어부 170은 콘텐츠의 속성을 분석하여 상기 콘텐츠의 제1 영역과 상기 제1 영역과 연관된 상기 콘텐츠의 제2 영역을 매핑시키는 매핑 테이블을 생성할 수 있다. 상기 콘텐츠는 텍스트, 이미지, 오디오, 동영상 및 음성 중 적어도 하나로 구성된 것이다. 상기 콘텐츠는 메모리 130에 저장된 것이거나, 스트리밍 서비스 또는 다운로드 서비스로 다운로드 받은 것일 수 있다. 상기 콘텐츠의 속성은 상기 콘텐츠에 포함된 데이터의 종류, 상기 콘텐 츠의 페이지 번호, 상기 콘텐츠의 레이어 및 상기 콘텐츠의 마디수 중 적어도 하나일 수 있다. 상기 제어부 170 은 상기 콘텐츠로부터 상기 콘텐츠의 속성을 획득하거나, 상기 콘텐츠를 분석하여 상기 콘텐츠의 속성을 생성하 거나, 상기 사용자로부터 상기 콘텐츠의 속성을 설정받을 수 있다. 상기 매핑 테이블은 상기 콘텐츠의 속성별로 상기 콘텐츠에 포함된 복수의 영역들이 분류되고, 분류된 각 영역을 출력할 전자 장치에 매핑한 것일 수 있다. 상기 매핑 테이블은 상기 콘텐츠의 각 영역에 대한 참조번호를 포함할 수 있다. 상기 매핑 테이블을 생성하기 위해서는, 전자 장치 101는 제2 전자 장치와 연결될 수 있다. 상기 제2 전자 장치는 외부 장치로서, 도 1에서는 전자 장치 104를 의미할 수 있다. 상기 제2 전자 장치는 전자 장치 101와 유사하게, 스마트 폰, 태블릿 PC, TV 와 같은 표시 장치일 수 있다. 전자 장치 101이 제2 전자 장치 간의 연결은 서로 데이터를 주고 받을 수 있는 상태임을 의미한다. 예컨대, 제어부 170은 콘텐츠가 \"Ebook\"인 경우, 책의 홀수 페이지를 제1 영역, 책의 짝수 페이지를 제2 영역으로 분류하고, 상기 제1 영역을 전자 장치 101에 매핑하고, 상기 제2 영역을 상기 제2 전자 장치에 매핑시켜 상기 매핑 테이블을 생성할 수 있다. 이때, 매핑된 제1 영역과 제2 영역 간에는 출력할 시점이 서로 동기화된 것을 의미한다. 상기 통신 인터페이스 160은 상기 매핑 테이블에 관련된 제2 영역의 콘텐츠 정보를 상기 제2 전자 장치로 전송 할 수 있다. 상기 제2 영역의 콘텐츠 정보는 상기 제2 영역에 대한 콘텐츠이거나, 상기 제2 영역에 대한 콘텐츠 의 참조번호일 수 있다. 상기 제2 전자 장치는 상기 콘텐츠의 제2 영역을 출력할 수 있다. 상기 입출력 인터페 이스 140은 상기 콘텐츠의 제1 영역을 출력할 수 있다. 상기 출력한다는 것은 스피커를 통해 상기 콘텐츠의 제1 영역과 연관된 음을 출력하거나, 상기 디스플레이 150를 통해 상기 콘텐츠의 제1 영역을 표시하는 것을 의미할 수 있다.다양한 실시예들에 따르면, 입출력 인터페이스 140은 상기 콘텐츠를 선택받을 수 있다. 상기 제어부 170은 상 기 제2 전자 장치와 연결되는지 여부를 검출하고, 상기 선택된 콘텐츠의 속성에 기초하여 상기 연결된 제2 전자 장치에 상기 콘텐츠의 제1 영역 또는 상기 콘텐츠의 제2 영역을 매핑하여 상기 매핑 테이블을 생성할 수 있다. 예를 들어, 상기 연결된 제2 전자 장치가 적어도 두 개 이상인 경우, 상기 통신 인터페이스 160은 각 제2 전자 장치로부터 장치 타입을 수신할 수 있다. 상기 제어부 170은 상기 콘텐츠의 속성 및 상기 각 장치 타입에 기초 하여 각 제2 전자 장치에 상기 콘텐츠의 제1 영역 또는 상기 콘텐츠의 제2 영역을 매핑하여 상기 매핑 테이블을 생성할 수 있다. 다양한 실시예들에 따르면, 상기 제어부 170은 상기 콘텐츠가 악보와 관련된 경우, 상기 악보에 포함된 악기를 분석할 수 있다. 상기 통신 인터페이스 160은 각 제2 전자 장치로부터 장치 타입을 수신할 수 있다. 상기 제어 부 170은 상기 각 장치 타입에 기초하여 각 제2 전자 장치와 상기 분석된 악보의 악기를 매핑하여 상기 매핑 테 이블을 생성할 수 있다. 상기 제어부 170은 음을 분석하여 상기 음과 관련된 악보의 마디를 확인할 수 있다. 상기 통신 인터페이스 160은 상기 마디와 관련된 콘텐츠 정보를 상기 각 제2 전자 장치로 전송할 수 있다. 상기 디스플레이 150은 상기 마디와 관련된 악보를 표시할 수 있다. 상기 제2 전자 장치도 상기 마디와 관련된 악보 를 표시할 수 있다. 상기 통신 인터페이스 160은 상기 매핑 테이블을 상기 제2 전자 장치로 전송할 수 있다. 이 경우, 상기 제2 전 자 장치는 전자 장치 101의 메모리 130에 저장된 콘텐츠 및 상기 매핑 테이블을 저장할 수 있다. 이때, 상기 제 2 전자 장치는 상기 수신된 제2 영역의 콘텐츠 정보로서 상기 제2 영역에 대한 참조번호를 수신할 수 있다. 상 기 제2 전자 장치는 상기 매핑 테이블 및 상기 제2 영역에 대한 참조번호를 기반으로 상기 콘텐츠의 제2 영역을 출력할 수 있다. 즉, 상기 제2 전자 장치는 전자 장치 101가 제1 영역을 출력하는 것에 맞춰 상기 제2 영역을 출력할 수 있다. 예를 들어, 상기 제2 전자 장치는 상기 제2 영역을 상기 제1 영역과 동시에 출력하거나, 상기 제1 영역보다 늦게 또는 빠르게 출력할 수도 있다. 다양한 실시예들에 따르면, 상기 디스플레이 150은 상기 콘텐츠의 제1 영역을 표시할 수 있다. 상기 제2 전자 장치가 일정거리 이내에 위치하는 경우, 상기 통신 인터페이스 160은 상기 디스플레이 150에 표시되지 않는 상 기 제2 영역의 콘텐츠 정보를 상기 제2 전자 장치로 전송할 수 있다. 표시되지 않는 제2 영역을 상기 제2 전자 장치에 표시하는 실시예는 서로 다른 두 영역을 각각 표시하는 실시예와 조금 다른 방식으로 전자 장치들 간에 연결이 수행될 수 있다. 예를 들어, 상기 일정거리는 제1 전자 장치와 제2 전자 장치가 접촉되거나, 서로 다른 두 영역을 각각 표시하는 실시예보다 두 전자 장치들 간의 거리가 가까울 수 있다. 상기 제2 전자 장치는 상기 콘텐츠의 제2 영역을 표시할 수 있다. 상기 입출력 인터페이스 140은 사용자의 입력을 감지하고, 상기 디스플 레이 150은 상기 사용자의 입력에 대응하여 상기 콘텐츠의 제3 영역을 표시할 수 있다. 상기 통신 인터페이스 160은 상기 디스플레이 150에 표시되지 않는 상기 콘텐츠의 제4 영역의 콘텐츠 정보를 상기 제2 전자 장치로 전 송할 수 있다. 상기 제2 전자 장치는 상기 콘텐츠의 제4 영역을 표시할 수 있다. 예를 들어, 상기 제2 전자 장치는 상기 제4 영역을 상기 제3 영역과 동시에 출력하거나, 상기 제3 영역보다 늦게 또는 빠르게 출력할 수도 있다. 도 2는 다양한 실시예에 따른 전자장치를 도시한 블록도이다. 도 2를 참고하면, 전자 장치 200은 제어부 210, 출력부 220, 표시부 230, 통신부 240, 메모리 250 및 입력부 260을 포함할 수 있다. 입력부 260은 사용자로부터 상기 콘텐츠를 선택받을 수 있다. 상기 콘텐츠는 텍스트, 이미지, 오디오, 동영상 및 음성 중 적어도 하나로 구성된 것이다. 상기 콘텐츠는 메모리(예: 도 1의 메모리 130 또는 도 2의 메모리 250)에 저장된 것이거나, 스트리밍 서비스 또는 다운로드 서비스로 다운로드 받은 것일 수 있다. 입력부 260(예: 도 1의 입출력 인터페이스 140)은 숫자 또는 문자 정보를 입력받고 각종 기능들을 설정하기 위한 다수 의 키들을 포함할 수 있다. 이러한 키들은 메뉴 불러오기 키, 화면 온/오프 키, 전원 온/오프 키 및 볼륨 조절 키 등을 포함할 수 있다. 입력부 260은 사용자 설정 및 전자 장치 200의 기능 제어와 관련한 키 이벤트를 생성 하여 제어부 210로 전달한다. 키 이벤트는 전원 온/오프 이벤트, 볼륨 조절 이벤트, 화면 온/오프 이벤트, 셔 터 이벤트 등을 포함할 수 있다. 제어부 210은 이러한 키 이벤트에 응답하여 상기한 구성들을 제어한다. 한편, 입력부 260의 키는 하드 키(hard key)라 하고 표시부 230에 표시되는 가상의(virtual) 키는 소프트 키 (soft key)로 지칭될 수 있다. 제어부 210(예: 도 1의 제어부 170 또는 프로세서 120)은 전자 장치 200의 전반적인 동작 및 전자 장치 200의 내부 구성들 간의 신호 흐름을 제어하고, 데이터를 처리하는 기능을 수행하고, 배터리에서 상기 구성들로의 전원 공급을 제어한다. 제어부 210은 CPU(central processing unit)와, GPU(graphic processing unit)를 포함한 다. 주지된 바와 같이 CPU는 자료의 연산 및 비교와, 명령어의 해석 및 실행 등을 수행하는 컴퓨터 시스템의 핵 심적인 제어 유닛이다. GPU는 CPU를 대신하여, 그래픽과 관련한 자료의 연산 및 비교와, 명령어의 해석 및 실행 등을 수행하는 그래픽 제어 유닛이다. CPU와 GPU은 각각, 두 개 이상의 독립 코어(예, 쿼드 코어(quad-core))가 단일 집적 회로로 이루어진 하나의 패키지(package)로 통합될 수 있다. 또한 CPU와 GPU는 하나의 칩으로 통합 (SoC; System on Chip)된 것일 수 있다. 또한 CPU와 GPU는 멀티 레이어(multi layer)로 패키징(packaging)된 것일 수도 있다. 한편 CPU 및 GPU를 포함하는 구성은 AP(Application Processor)라고 지칭될 수 있다. 제어부 210은 분석 모듈 211, 생성 모듈 212, 검출 모듈 213 및 확인 모듈 214를 포함할 수 있다. 검출 모듈 213은 제2 전자 장치와 연결되는지 여부를 검출할 수 있다. 분석 모듈 211은 상기 선택된 콘텐츠의 속성으로서 상기 콘텐츠에 포함된 데이터의 종류, 상기 콘텐츠의 페이지 번호, 상기 콘텐츠의 레이어 및 상기 콘텐츠의 마 디수 중 적어도 하나를 분석할 수 있다. 예컨대, 상기 데이터의 종류는 텍스트, 이미지, 동영상, 심벌, 아이콘, 및 기호 중 적어도 하나일 수 있다. 예를 들어, 분석 모듈 211은 상기 콘텐츠를 분석하여 상기 콘텐츠가 이미 지와 텍스트로 구성된 것임을 속성으로서 획득 또는 생성할 수 있다. 상기 페이지 번호는 페이지 수, 짝수 및 홀수 중 적어도 하나일 수 있다. 예를 들어, 분석 모듈 211은 상기 콘텐츠가 \"Ebook\"인 경우, 상기 콘텐츠의 페이지 번호를 분석할 수 있다. 분석 모듈 211은 상기 콘텐츠를 분석하여 상기 콘텐츠가 총 몇페이지로 구성되 어 있고, 왼쪽 페이지, 오른쪽 페이지로 구성된 것임을 속성으로서 획득 또는 생성할 수 있다. 또는, 분석 모 듈 211은 상기 콘텐츠를 분석하여 페이지 번호가 홀수인 페이지, 페이지 번호가 짝수인 페이지로 구성된 것임을 속성으로서 획득 또는 생성할 수 있다. 상기 콘텐츠의 레이어는 데이터가 레이어별로 구분되는 것으로, 데이터 의 종류에 따라 레이어가 나눠질 수 있다. 예컨대, 분석 모듈 211은 상기 콘텐츠를 분석하여 이미지는 제1 레 이어, 텍스트는 제2 레이어로 구성된 것임을 속성으로서 획득 또는 생성할 수 있다. 상기 콘텐츠의 마디수는 상기 콘텐츠를 출력하는 단위일 수 있다. 예를 들어, 분석 모듈 211은 상기 콘텐츠를 분석하여 상기 콘텐츠가 악보인 경우, 악보가 총 몇 마디로 구성되어 있고, 한번에 출력할 마디수는 10 마디인 속성을 획득 또는 생성할 수 있다. 또는, 분석 모듈 211은 상기 사용자로부터 상기 속성을 설정받을 수도 있다. 분석 모듈 211은 상기 콘텐츠로부 터 상기 속성을 획득할 수 없거나, 상기 콘텐츠를 분석하여도 상기 속성을 획득할 수 없는 경우, 상기 사용자로 부터 상기 속성을 설정받을 수 있다. 또는, 분석 모듈 211은 속성을 획득하였더라도, 상기 사용자로부터 속성 을 설정받은 경우, 상기 획득한 속성보다 상기 설정된 속성이 우선시 될 수 있다. 또는, 분석 모듈 211은 상기 획득한 속성과 상기 설정된 속성 중에서 우선순위를 상기 사용자로부터 설정받을 수도 있다. 생성 모듈 212은 상기 콘텐츠의 속성에 기초하여 상기 콘텐츠의 제1 영역과 상기 제1 영역과 연관된 상기 콘텐 츠의 제2 영역을 매핑시키는 매핑 테이블을 생성할 수 있다. 상기 매핑 테이블(mapping table)은 상기 콘텐츠 의 속성별로 상기 콘텐츠에 포함된 복수의 영역들이 분류되고, 분류된 각 영역을 출력할 전자 장치에 매핑한 것 일 수 있다. 예컨대, 상기 매핑 테이블은 콘텐츠 자체에 대한 정보가 포함될 수도 있고, 상기 콘텐츠에 포함된 영역을 식별하기 위한 참조번호가 포함될 수도 있다. 상기 매핑 테이블은 상기 제1 영역의 참조번호, 상기 제2 영역의 참조번호를 포함할 수 있다. 상기 생성된 매핑 테이블은 메모리 250에 저장될 수 있다. 상기 매핑 테이 블을 생성하기 위해서, 전자 장치 200는 제2 전자 장치(예: 도 1의 전자 장치 104)와 연결될 수 있다. 상기 제2 전자 장치는 전자 장치 101와 유사하게, 스마트 폰, 태블릿 PC, TV와 같은 표시 장치일 수 있다. 전자 장치 200 와 상기 제2 전자 장치 간의 연결은 서로 데이터를 주고 받을 수 있는 상태임을 의미한다. 생성 모듈 212는 상기 콘텐츠의 속성에 기초하여 상기 연결된 제2 전자 장치에 상기 콘텐츠의 제1 영역 또는 상 기 콘텐츠의 제2 영역을 매핑하여 상기 매핑 테이블을 생성할 수 있다. 이하, 표 1, 2에서는 전자 장치 200와 제2 전자 장치가 일대일로 연결된 일례를 설명한다. 표 1 제1 영역 제2 영역 이미지 1 텍스트 1 이미지 2 텍스트 2 이미지 3 텍스트 3 이미지 4 텍스트 4 표 1을 참고하면, 생성 모듈 212은 상기 분석된 콘텐츠가 이미지와 텍스트로 구성된 경우, 콘텐츠의 이미지가 포함된 영역을 제1 영역으로, 상기 콘텐츠의 텍스트가 포함된 영역을 제2 영역으로 분류할 수 있다. 이때, 상기 제1 영역은 상기 제2 영역과 시간적으로 또는 내용적으로 연관된 것이다. 예를 들어, 이미지 1은 텍스트 1과 연 관되고, 이미지 2는 텍스트 2와 연관되며, 이미지 3은 텍스트 3과 연관된 것이다. 생성 모듈 212은 상기 제1 영 역을 전자 장치 200에 매핑하고, 상기 제2 영역을 상기 제2 전자 장치에 매핑시켜 상기 매핑 테이블을 생성할 수 있다. 표 2 제1 영역 제2 영역 1 페이지 2 페이지 3 페이지 4 페이지 5 페이지 6 페이지 7 페이지 8 페이지 표 2를 참고하면, 생성 모듈 212은 상기 분석된 콘텐츠가 \"Ebook\"인 경우, 콘텐츠의 홀수 페이지를 제1 영역으 로, 상기 콘텐츠의 짝수 페이지를 제2 영역으로 분류할 수 있다. 이때, 상기 제1 영역은 상기 제2 영역과 시간 적으로 또는 내용적으로 연관된 것이다. 예를 들어, 1 페이지는 2 페이지와 연관되고, 3 페이지는 4 페이지와 연관되며, 5 페이지는 6 페이지와 연관된 것이다. 생성 모듈 212은 상기 제1 영역을 전자 장치 200에 매핑하고, 상기 제2 영역을 상기 제2 전자 장치에 매핑시켜 상기 매핑 테이블을 생성할 수 있다. 표 1과 유사하게, 생성 모듈 212은 콘텐츠의 제1 레이어를 제1 영역으로, 상기 콘텐츠의 제2 레이어를 제2 영역 으로 분류하고, 상기 제1 영역을 전자 장치 200에 매핑하고, 상기 제2 영역을 상기 제2 전자 장치에 매핑시켜 상기 매핑 테이블을 생성할 수 있다. 이때, 상기 제1 레이어에는 이미지가 포함되고, 상기 제2 레이어에는 텍스 트가 포함될 수 있다. 통신부 240(예: 도 1의 통신 인터페이스 160)은 상기 매핑 테이블에 관련된 제2 영역의 콘텐츠 정보를 상기 제2 전자 장치로 전송할 수 있다. 통신부 240은 DLNA(Digital Living Network Alliance), Allshare, WIFI Direct 의 miracast 중 어느 하나로 상기 제2 전자 장치로 상기 제2 영역의 콘텐츠 정보를 전송할 수 있다. 통신부 240은 제어부 210의 제어 하에, 네트워크를 통해 외부장치와 음성 통화, 화상 통화 또는 데이터 통신을 수행한 다. 통신부 240은 송신되는 신호의 주파수를 상승변환 및 증폭하는 무선주파수 송신부와, 수신되는 신호의 주파 수를 저잡음 증폭 및 하강 변환하는 무선주파수 수신부를 포함한다. 또한 통신부 240은 이동 통신부(예컨대, 3 세대(3-Generation) 이동통신모듈, 3.5(3.5-Generation)세대 이동통신모듈 또는 4(4-Generation)세대 이동통신 모듈 등), 디지털 방송 모듈(예컨대, DMB 모듈) 및 근거리 통신부(예, 와이파이(Wi-Fi) 모듈, 블루투스 (bluetooth) 모듈, NFC(Near Field Communication) 모듈)을 포함한다. 출력부 220은 제어부 210의 제어에 따라 상기 콘텐츠의 제1 영역을 출력할 수 있다. 출력부 220은 화면을 표시 하는 표시부 230 및 음을 출력하는 스피커를 포함할 수 있다. 즉, 표시부 230은 상기 콘텐츠의 제1 영역을 표 시할 수 있다. 상기 스피커는 상기 콘텐츠의 제1 영역에 대응하는 음을 출력할 수 있다. 표시부 230 및 상기 스피커는 상기 콘텐츠의 제1 영역에 따라 동시에 또는 시간차를 두고 출력할 수 있다. 출력부 220는 마이크 (MIC) 및 스피커(SPK)를 포함할 수 있다. 출력부 220은 스피커(SPK) 및 마이크(MIC)와 결합하여 음성 인식, 음 성 녹음, 디지털 레코딩(recording) 및 통화를 위한 오디오 신호(예, 음성 데이터)의 입력 및 출력을 수행한다. 출력부 220은 제어부 210으로부터 오디오 신호를 수신하고, 수신한 오디오 신호를 아날로그로 D/A 변환하고 증 폭한 후 스피커(SPK)로 출력한다. 출력부 220은 마이크(MIC)로부터 수신한 오디오 신호를 디지털로 A/D 변환한 후 제어부 210으로 제공한다. 스피커(SPK)는 오디오 신호를 음파(sound wave)로 변환하여 출력한다. 마이크 (MIC)는 사람이나 기타 소리원(sound source)들로부터 전달된 음파를 오디오 신호로 변환한다. 다양한 실시예들에 따르면, 출력부 220는 상기 제1 영역을 표시부 230 또는 스피커로 출력하면서, 제어부 210은 상기 제1 영역과 매칭된 제2 영역을 메모리 250에 저장된 매핑 테이블에서 찾아, 상기 제2 영역의 콘텐츠 정보 를 상기 제2 전자 장치에 전송하고, 상기 제2 전자 장치는 상기 수신된 제2 영역을 출력할 수 있다. 즉, 통신 부 240은 상기 콘텐츠 정보로서, 상기 콘텐츠의 제2 영역을 전송할 수 있다. 상기 제2 전자 장치는 상기 콘텐 츠의 제2 영역을 수신하여, 상기 제2 영역을 출력할 수 있다. 이때, 상기 제2 전자 장치는 상기 콘텐츠를 메모 리에 저장하지 않고, 출력할 상기 콘텐츠의 제2 영역을 수신하여 출력할 수 있다. 다양한 실시예들에 따르면, 통신부 240은 메모리 250에 저장된 상기 매핑 테이블을 상기 제2 전자 장치로 전송 할 수 있다. 이 경우, 상기 제2 전자 장치는 상기 콘텐츠 및 상기 매핑 테이블을 메모리에 저장할 수 있다.통신부 240은 상기 콘텐츠 정보로서, 상기 제2 영역의 참조번호를 전송할 수 있다. 상기 제2 전자 장치는 상기 매핑 테이블에 기초하여 상기 제2 영역의 참조번호와 연관된 제2 영역을 추출할 수 있다. 이는, 상기 전자 장치 200이 상기 제2 전자 장치로 제2 영역을 출력하라고 명령하는 것으로, 상기 제2 전자 장치는 상기 제2 영역의 참조번호를 상기 매핑 테이블에서 찾아 상기 메모리에 저장된 콘텐츠의 제2 영역을 출력할 수 있다. 위에서는 전자 장치 200와 제2 전자 장치가 일대일로 연결된 경우를 예로 들어 설명하였다. 이하에서는 전자 장 치 200와 복수의 제2 전자 장치가 일대N으로 연결된 경우를 예로 들어 설명한다. 표 3 제1 영역 제2 영역 101 페이지 1~3 페이지 102 페이지 4~5 페이지 103 페이지 6 페이지 104 페이지 7~10 페이지 표 3을 참고하면, 분석 모듈 211은 콘텐츠가 \"Ebook\"이며, 문제 페이지와 해답 페이지로 구성된 150 페이지의 학습지로 분석할 수 있다. 분석 모듈 211은 \"Ebook\"의 학습지를 상기 문제 페이지는 1~100 페이지이고, 상기 해 답 페이지는 101~150 페이지로 분석할 수 있다. 또는 분석 모듈 211은 사용자로부터 1~100 페이지는 문제 페이 지이며, 101~150 페이지는 해답 페이지로 설정받을 수도 있다. 이하에서는 전자 장치 200가 콘텐츠를 분석하여 매핑 테이블을 생성하는 것으로 설명하지만, 상기 사용자가 설정한 상기 콘텐츠의 속성에 기초하여 상기 매핑 테이블을 생성할 수 있다. 즉, 상기 사용자가 상기 매핑 테이블을 직접 설정할 수도 있다. 생성 모듈 212은 상 기 해답 페이지의 102 페이지를 제1 영역으로, 상기 문제 페이지의 4~5 페이지를 제2 영역으로 분류할 수 있다. 또한, 생성 모듈 212은 상기 해답 페이지의 103 페이지를 제1 영역으로, 상기 문제 페이지의 6 페이지를 제2 영 역으로 분류할 수 있다. 이때, 상기 제1 영역은 상기 제2 영역과 내용적으로 연관된 것이다. 예를 들어, 101 페 이지는 1~3 페이지와 연관되고, 102 페이지는 4~5 페이지와 연관되며, 103 페이지는 6 페이지와 연관된 것이다. 생성 모듈 212은 상기 제1 영역을 전자 장치 200에 매핑하고, 상기 제2 영역을 제2 전자 장치에 매핑시켜 상기 매핑 테이블을 생성할 수 있다. 이때, 상기 제2 전자 장치는 적어도 두 개 이상일 수 있다. 이하에서는 제2 전자 장치가 복수개(예: N개, N은 2 이상의 자연수)인 것으로 설명한다. 왜냐하면, 학습지의 경우 선생님과 한명 이상의 학생들이 함께 볼 가능성이 높기 때문이다. 상기 복수의 제2 전자 장치들은 학생들이 소유한 또는 학생이 사용하는 전자 장치일 수 있다. 통신부 240는 상기 복수의 제2 전자 장치들로부터 각 장치 타입을 수신할 수 있다. 상기 장치 타입은 상기 제2 전자 장치가 속하는 콘텐츠의 영역의 속성 또는 상기 제2 전자 장치가 수신하고자 하는 콘텐츠의 영역에 대한 것일 수 있다. 상기 장치 타입은 상기 제2 전자 장치의 제2 사용자가 설정할 수 있다. 여기서는, 상기 콘텐츠가 학습지이기 때문에, 상기 복수의 제2 전자 장치들의 장치 타입은 문제 페이지가 속한 영역에 대한 것일 수 있다. 여기서, 상기 복수의 제2 전자 장치들의 장치 타입은 모두 동일할 수 있다. 생성 모듈 212은 상기 콘텐츠 의 속성 및 상기 장치 타입에 기초하여 상기 복수의 제2 전자 장치들에 상기 콘텐츠의 제2 영역을 매핑하여 상 기 매핑 테이블을 생성할 수 있다. 통신부 240는 상기 복수의 제2 전자 장치들로 모두 동일한 제2 영역의 콘텐 츠 정보를 전송할 수 있다. 출력부 220는 상기 콘텐츠의 제1 영역을 출력할 수 있다. 예를 들어, 표시부 230는 상기 콘텐츠의 제1 영역을 표시할 수 있다. 표 4 제1 영역 제2 영역 제3 영역 제4 영역 지휘자 바이올린1 바이올린 2 첼로 1~10 101 201 301 11~20 102 202 302 21~30 103 203 303 31~40 104 204 304 표 4를 참고하면, 분석 모듈 211은 콘텐츠가 350 페이지로 구성된 \"악보책\"이며, 악기별 악보가 모두 포함된 총 보와, 악기에 따른 악보만 포함된 것으로 분석할 수 있다. 생성 모듈 212은 악기별 악보가 모두 포함된 총보를 제1 영역으로, 악기별 악보를 제2 영역으로 분류할 수 있다. 상기 제1 영역은 지휘자가 보는 것이며, 상기 제2영역은 악기를 연주하는 연주자가 보는 것일 수 있다. 만약, 상기 악기가 두 개 이상인 경우, 상기 제2 영역은 악기에 따라 제2 영역, 제3 영역, 제4 영역으로 구분할 수 있다. 표 4를 참고하면, 생성 모듈 212은 제1 악기인 \"바이올린 1\"을 제2 영역으로, 제2 악기인 \"바이올린 2\"를 제3 영역으로, 제3 악기인 \"첼로\"를 제4 영역으로 분 류할 수 있다. 예를 들어, 상기 제1 영역은 지휘자가 보는 총보, 상기 제2 영역은 바이올린을 연주하는 연주자 1이 보는 악보, 상기 제3 영역은 바이올린을 연주하는 연주자 2가 보는 악보, 상기 제3 영역은 첼로를 연주하는 연주자가 보는 악보일 수 있다. 이때, 상기 제1 영역은 상기 제2 영역과 시간적으로 또는 내용적으로 연관된 것 이다. 예를 들어, 1~10 페이지는 101, 201, 301 페이지와 연관되고, 11~20 페이지는 102, 202, 302 페이지와 연관되며, 21~30 페이지는 103, 203, 303 페이지와 연관된 것이다. 생성 모듈 212은 상기 제1 영역은 전자 장치 200에 매핑하고, 상기 제2 영역 내지 제4 영역을 해당하는 각 제2 전자 장치에 매핑하여 매핑 테이블을 생성할 수 있다. 표 4에서는 악기별로 악보가 페이지별로 나눠져 있는 일례를 설명하고 있지만, 분석 모듈 211은 악기 별 악보가 모두 포함된 총보를 분석하여 상기 총보에서 악기별로 악보를 추출할 수도 있다. 이때, 상기 제2 전자 장치는 적어도 두 개 이상일 수 있다. 전자 장치 200이 아닌 전자 장치는 모두 제2 전자 장치로 해석될 수 있다. 이하에서는 제2 전자 장치가 복수개(예: N개, N은 2 이상의 자연수)인 것으로 설명한다. 왜냐하면, 악보의 경우 지휘자와 한명 이상의 연주자들이 함께 볼 가능성이 높기 때문이다. 상기 복 수의 제2 전자 장치들은 연주자들이 소유한 또는 연주자들이 사용하는 전자 장치일 수 있다. 여기서, 발명의 이 해를 돕기 위해, 상기 복수의 제2 전자 장치들은 제2 전자 장치, 제3 전자 장치, 제4 전자 장치를 포함할 수 있 다. 예를 들어, 바이올린 1을 연주하는 연주자의 전자 장치는 제2 전자 장치로, 바이올린 2를 연주하는 연주자 의 전자 장치는 제3 전자 장치로, 첼로를 연주하는 연주자의 전자 장치는 제4 전자 장치로 설명한다. 이때, 상 기 제2 전자 장치 내지 상기 제4 전자 장치는 각각 하나이거나, 두 개 이상일 수 있다. 통신부 240는 상기 복수 의 제2 전자 장치들로부터 각 장치 타입을 수신할 수 있다. 여기서는, 상기 콘텐츠가 악보이기 때문에, 상기 장 치 타입은 악기에 대한 정보일 수 있다. 즉, 상기 복수의 제2 전자 장치들의 장치 타입은 각각 상이할 수 있다. 예를 들면, 상기 제2 전자 장치의 제2 장치 타입은 \"바이올린 1\"이고, 상기 제3 전자 장치의 제3 장치 타입은 \"바이올린 2\"이며, 상기 제4 전자 장치의 제4 장치 타입은 \"첼로\"일 수 있다. 생성 모듈 212은 상기 콘텐츠의 속성 및 상기 장치 타입에 기초하여 각 제2 전자 장치 내지 제4 전자 장치에 상기 콘텐츠의 제2 영역 내지 제4 영역을 매핑하여 상기 매핑 테이블을 생성할 수 있다. 통신부 240는 상기 제2 전자 장치로 제2 영역의 콘텐츠 정보를 전송하고, 상기 제3 전자 장치로 제3 영역의 콘텐츠 정보를 전송하며, 상기 제4 전자 장치로 제4 영역의 콘텐츠 정보를 전송할 수 있다. 즉, 통신부 240는 각 제2 내지 제4 전자 장치들로 각각 다른 영역의 콘텐츠 정 보를 전송할 수 있다. 각 영역의 콘텐츠 정보는 콘텐츠 자체이거나, 영역의 참조번호(페이지 번호)일 수 있다. 출력부 220는 상기 콘텐츠의 제1 영역을 출력할 수 있다. 예를 들어, 표시부 230는 상기 콘텐츠의 제1 영역을 표시할 수 있다. 표 4를 참고하면, 통신부 240은 상기 제2 전자 장치로 101 페이지의 콘텐츠 정보를 전송하고, 제3 전자 장치로 201 페이지의 콘텐츠 정보를 전송하며, 제4 전자 장치로 301 페이지의 콘텐츠 정보를 전송할 수 있다. 표시부 230은 1~10 페이지의 악보를 표시할 수 있다. 일례로서, 표시부 230은 상기 콘텐츠 정보의 전 송과 동시에 또는 시간차를 두고, 1~10 페이지의 악보를 표시할 수 있다. 다양한 실시예들에 따르면, 확인 모듈 214는 출력부 220의 마이크로부터 수신되는 음을 분석하여 상기 음과 관 련된 총보의 마디를 확인할 수 있다. 제어부 210은 상기 사용자의 손 또는 기타 수단으로부터 악보를 넘기는 입 력을 받는 경우, 다음 페이지로 넘어가는 입력으로 처리할 수 있다. 상기 입력은 구부리거나, 회전하거나, 빨리 넘기거나 하는 등의 입력일 수 있다. 또는, 상기 사용자가 손 또는 기타 수단으로부터 악보를 넘기지 않더라도, 제어부 210은 마이크로부터 연주되는 음을 분석하여, 주멜로디를 인지할 수 있다. 이 경우, 제어부 210은 상기 분석된 음을 통해 상기 음과 관련된 총보의 마디를 확인함으로써, 하나의 악보(예를 들면, 주멜로디를 연주하는 바이올린 악보)의 페이지가 넘어가는 것으로 인지되면, 다른 악보에도 해당 페이지와 연관된 페이지를 보여주도 록 하는 명령을 전달할 수 있다. 이를 위해, 통신부 240은 상기 마디와 관련된 정보를 상기 각 제2 전자 장치 로 전송할 수 있다. 상기 제2 전자 장치는 상기 마디와 관련된 정보를 이용하여 상기 마디와 관련된 악보를 표 시할 수 있다. 예를 들어, 표 4의 매핑 테이블을 참고하면, 제어부 210은 수신되는 음을 분석하여 상기 음과 관련된 악보의 마 디를 \"11~20\"로 확인할 수 있다. 제어부 210은 상기 확인된 악보의 마디인 \"11~20\"을 제1 영역으로 보고, 상기 제1 영역과 연관된 제2 영역 내지 제4 영역을 상기 표 4의 매핑 테이블을 참고하여 식별할 수 있다. 통신부 240 은 상기 제2 전자 장치로 102 페이지의 콘텐츠 정보를 전송하고, 제3 전자 장치로 202 페이지의 콘텐츠 정보를 전송하며, 제4 전자 장치로 302 페이지의 콘텐츠 정보를 전송할 수 있다. 표시부 230은 11~20 페이지의 악보를 표시할 수 있다.다양한 실시예들에 따르면, 표시부 230은 상기 콘텐츠의 제1 영역을 표시할 수 있다. 이 경우, 상기 제2 전자 장치가 일정거리 이내에 위치하는 경우, 통신부 240은 표시부 230에 표시되지 않는 제2 영역의 콘텐츠 정보를 상기 제2 전자 장치로 전송할 수 있다. 상기 제2 전자 장치는 상기 콘텐츠의 제2 영역을 표시할 수 있다. 상 기 제2 영역은 표시부 230에 제1 영역을 표시하고 있는 동안, 표시부 230에 표시되지 않는 영역일 수 있다. 예 컨대, 상기 제2 영역은 스크롤을 움직여야지만 표시부 230에 표시되는 영역일 수 있다. 통신부 240은 표시부 230를 통해 표시되지 않는 제2 영역의 콘텐츠 정보를 상기 제2 전자 장치로 전송함으로써, 상기 제2 전자 장치 가 표시부 230에 표시되지 않는 상기 콘텐츠의 제2 영역을 표시할 수 있다. 입력부 260는 사용자로부터 입력을 받을 수 있다. 상기 입력은 스크롤을 상, 하, 좌, 우로 움직이는 명령일 수 있다. 또는, 상기 입력은 구부리거 나, 회전하거나, 빨리 넘기거나 하는 등의 입력일 수 있다. 표시부 230은 상기 사용자의 입력에 따라 상기 콘텐 츠의 제3 영역을 표시할 수 있다. 표시부 230에 상기 콘텐츠의 제3 영역이 표시되면, 통신부 240은 표시부 230 에 표시되지 않는 상기 콘텐츠의 제4 영역의 콘텐츠 정보를 상기 제2 전자 장치로 전송할 수 있다. 이 경우, 상기 제2 전자 장치는 상기 콘텐츠의 제4 영역을 표시할 수 있다. 상기 제2 전자 장치는 전자 장치 200의 표시 부 230에 표시되는 콘텐츠의 영역과 연동하여 표시할 영역이 결정될 수 있다. 메모리 250은 콘텐츠 및 매핑 테이블을 저장한다. 메모리 250은 전자 장치 200의 동작을 위해 요구되는 소프트 웨어, 및 전자 장치 200의 사용에 의해 수신되거나 또는 생성되는 다양한 데이터를 저장할 것이다. 메모리 250 은 제어부 210이 그로부터 판독하거나 또는 그에 기록할 수 있는 디지털 스토리지의 임의의 형식을 포함할 수 있다. 기능들을 수행하기 위해 하나 이상의 프로그램들은 메모리 250에 저장될 수 있다. 메모리 250은 제어부 210의 보조기억장치(secondary memory unit)로써, 디스크, 램(RAM), 롬(ROM) 및 플래시 메모리 등을 포함한다. 메모리 250은 전자 장치 200에서 생성된 데이터(예컨대, 연락처) 그리고 통신부 240을 통해 외부로부터 수신한 데이터(예, 메시지, 동영상 파일)를 저장한다. 메모리 250은 이미지(예컨대, 키패드, 동영상, 메시지 등)의 크 기 정보 및 이미지의 표시 영역 정보를 포함한다. 표시부 230(예: 도 1의 디스플레이 150)은 제어부 210의 제어 하에 이미지를 화면(screen on which at least one image is shown)에 표시한다. 즉, 제어부 210이 데이터를 화면에 표시할 이미지로 처리(예컨대, 디코딩 (decoding))하여 버퍼에 저장하면, 표시부 230은 버퍼에 저장된 이미지를 아날로그 신호로 변환하여 화면에 표 시한다. 표시부 230은 액정 표시 장치(Liquid Crystal Display; LCD), OLED(Organic Light Emitted Diode), AMOLED(Active Matrix Organic Light Emitted Diode) 또는 플랙서블 디스플레이(Flexible display)로 구성될 수 있다. 이외에도, 도 2의 전자 장치 200는 도 1의 전자 장치 101에 포함된 구성요소들을 더 포함할 수 있다. 본 발명의 다양한 실시예에 따른 전자 장치는 콘텐츠의 속성을 분석하여 상기 콘텐츠의 제1 영역과 상기 제1 영 역과 연관된 상기 콘텐츠의 제2 영역을 매핑시키는 매핑 테이블을 생성하는 제어부와, 상기 매핑 테이블에 관련 된 제2 영역의 콘텐츠 정보를 제2 전자 장치로 전송하는 통신부와, 상기 콘텐츠의 출력하는 출력부를 포함할 수 있다. 상기 제어부는, 상기 콘텐츠의 속성으로서 상기 콘텐츠에 포함된 데이터의 종류, 상기 콘텐츠의 페이지 번호, 상기 콘텐츠의 레이어 및 상기 콘텐츠의 마디수 중 적어도 하나를 분석하는 분석 모듈을 포함할 수 있다. 상기 제어부는, 상기 콘텐츠로부터 상기 콘텐츠의 속성을 획득하거나, 상기 콘텐츠를 분석하여 상기 콘텐츠의 속성을 생성하거나, 및 사용자로부터 상기 콘텐츠의 속성을 설정받을 수 있다. 상기 전자 장치는 상기 콘텐츠를 선택받는 입력부를 더 포함하고, 상기 제어부는, 상기 제2 전자 장치와 연결되 는지 여부를 검출하는 검출 모듈과, 상기 선택된 콘텐츠의 속성에 기초하여 상기 연결된 제2 전자 장치에 상기 콘텐츠의 제1 영역 또는 상기 콘텐츠의 제2 영역을 매핑하여 상기 매핑 테이블을 생성하는 생성 모듈을 포함할 수 있다. 상기 통신부는, 상기 연결된 제2 전자 장치가 적어도 두 개 이상인 경우, 각 제2 전자 장치로부터 각 장치 타입 을 수신할 수 있다. 상기 생성 모듈은, 상기 콘텐츠의 속성 및 상기 각 장치 타입에 기초하여 각 제2 전자 장치 에 상기 콘텐츠의 제1 영역 또는 상기 콘텐츠의 제2 영역을 매핑하여 상기 매핑 테이블을 생성할 수 있다. 상기 제어부는, 상기 콘텐츠가 악보와 관련된 경우, 상기 악보에 포함된 악기를 분석하는 분석 모듈을 포함할 수 있다. 상기 통신부는, 복수의 제2 전자 장치로부터 각 장치 타입을 수신할 수 있다. 상기 제어부는, 상기 각 장치 타입에 기초하여 각 제2 전자 장치와 상기 분석된 악보의 악기를 매핑하여 상기 매핑 테이블을 생성하는 생성 모듈을 포함할 수 있다.상기 제어부는, 음을 분석하여 상기 음과 관련된 악보의 마디를 확인하고, 상기 통신부는, 상기 마디와 관련된 콘텐츠 정보를 각 제2 전자 장치로 전송할 수 있다. 상기 전자 장치는 상기 마디와 관련된 악보를 표시하는 표 시부를 더 포함할 수 있다. 상기 통신부는, 상기 매핑 테이블을 상기 제2 전자 장치로 전송할 수 있다. 상기 표시부는, 상기 콘텐츠의 제1 영역을 표시하고, 상기 통신부는, 상기 제2 전자 장치가 일정거리 이내에 위 치하는 경우, 상기 표시부에 표시되지 않는 제2 영역의 콘텐츠 정보를 상기 제2 전자 장치로 전송할 수 있다. 상기 제어부는, 사용자의 입력을 감지하고, 상기 표시부는, 상기 사용자의 입력에 대응하여 상기 콘텐츠의 제3 영역을 표시하고, 상기 통신부는, 상기 표시부에 표시되지 않는 제4 영역의 콘텐츠 정보를 상기 제2 전자 장치 로 전송할 수 있다. 도 3은 본 발명의 다양한 실시예에 따른 콘텐츠 제공 방법을 도시한 흐름도이다. 본 발명의 콘텐츠 제공 방법 은 전자 장치(예: 도 1의 전자 장치 101 또는 도 2의 전자 장치 200)에 의해 수행될 수 있다. 도 3에서 설명하 는 전자 장치는 제1 전자 장치로 해석될 수 있으며, 마스터 단말기에 해당한다. 도 3을 참고하면, 동작 310에서, 상기 전자 장치의 제어부(예: 도 1의 제어부 170 또는 도 2의 제어부 210)는 사용자로부터 콘텐츠를 선택받을 수 있다. 상기 콘텐츠는 텍스트, 이미지, 오디오, 동영상 및 음성 중 적어도 하나로 구성된 것이다. 상기 콘텐츠는 메모리(예: 도 1의 메모리 130 또는 도 2의 메모리 250)에 저장된 것이거 나, 스트리밍 서비스 또는 다운로드 서비스로 다운로드 받은 것일 수 있다. 동작 320에서, 상기 제어부는 상기 선택된 콘텐츠의 속성을 분석할 수 있다. 상기 콘텐츠의 속성은 상기 콘텐 츠에 포함된 데이터의 종류, 상기 콘텐츠의 페이지 번호, 상기 콘텐츠의 레이어 및 상기 콘텐츠의 마디수 중 적 어도 하나일 수 있다. 상기 제어부는 상기 콘텐츠로부터 상기 콘텐츠의 속성을 획득하거나, 상기 콘텐츠를 분석 하여 상기 콘텐츠의 속성을 생성하거나, 상기 사용자로부터 상기 콘텐츠의 속성을 설정받을 수 있다. 예컨대, 상기 데이터의 종류는 텍스트, 이미지, 동영상, 심벌, 아이콘, 및 기호 중 적어도 하나일 수 있다. 상기 페이 지 번호는 페이지 수, 짝수 및 홀수 중 적어도 하나일 수 있다. 상기 콘텐츠의 레이어는 데이터가 레이어별로 구분되는 것으로, 데이터의 종류에 따라 레이어가 나눠질 수 있다. 예컨대, 상기 콘텐츠에 포함된 이미지는 제1 레이어, 상기 콘텐츠에 포함된 텍스트는 제2 레이어로 구분될 수 있다. 상기 콘텐츠의 마디수는 상기 콘텐츠를 출력하는 단위일 수 있다. 예컨대, 상기 콘텐츠가 악보인 경우, 상기 악보가 총 몇 마디로 구성되어 있고, 한 번에 출력할 마디수는 몇 마디인지 속성을 분석할 수 있다. 상기 전자 장치의 통신부(예: 도 1의 통신 인터페이 스 160, 도 2의 통신부 240)는 동작 310 및 동작 320을 수행하는 동안 언제든지 제2 전자 장치(예: 도 1의 전자 장치 104)와 연결할 수 있다. 전자 장치와 상기 제2 전자 장치 간의 연결은 서로 데이터를 주고 받을 수 있는 상태임을 의미한다. 예컨대, 상기 통신부는 상기 제2 전자 장치와 페어링하거나, 특정 통신 방식으로 상기 제2 전자 장치와 연결할 수 있다. 동작 330에서, 상기 제어부는 상기 콘텐츠의 속성에 기초하여 상기 콘텐츠의 제1 영역과 상기 제1 영역과 연관 된 상기 콘텐츠의 제2 영역을 매핑시키는 매핑 테이블을 생성할 수 있다. 상기 매핑 테이블은 상기 콘텐츠의 속 성별로 상기 콘텐츠에 포함된 복수의 영역들이 분류되고, 분류된 각 영역을 출력할 전자 장치에 매핑한 것일 수 있다. 예컨대, 상기 매핑 테이블은 콘텐츠 자체에 대한 정보가 포함될 수도 있고, 상기 콘텐츠에 포함된 영역을 식별하기 위한 참조번호가 포함될 수도 있다. 상기 제어부는 상기 콘텐츠의 제1 영역을 상기 전자 장치(자기 자 신)에 매핑하고, 상기 콘텐츠의 제2 영역을 상기 제2 전자 장치에 매핑하여 상기 매핑 테이블을 생성할 수 있다. 예를 들면, 상기 제어부는 콘텐츠의 이미지가 포함된 영역을 제1 영역으로, 상기 콘텐츠의 텍스트가 포함 된 영역을 제2 영역으로 분류하고, 상기 콘텐츠의 제1 영역을 상기 전자 장치(자기 자신)에 매핑하고, 상기 콘 텐츠의 제2 영역을 상기 제2 전자 장치에 매핑하여 상기 매핑 테이블을 생성할 수 있다. 또는, 상기 제어부는 콘텐츠의 홀수 페이지가 포함된 영역을 제1 영역으로, 상기 콘텐츠의 짝수 페이지가 포함된 영역을 제2 영역으 로 분류한 매핑 테이블을 생성할 수 있다. 또는, 상기 제어부는 콘텐츠의 제1 레이어를 제1 영역으로, 상기 콘 텐츠의 제2 레이어를 제2 영역으로 분류한 매핑 테이블을 생성할 수 있다. 또는, 상기 제어부는 콘텐츠의 총보 를 제1 영역으로, 악기별 악보를 제2 영역으로 분류한 매핑 테이블을 생성할 수 있다. 상기 콘텐츠가 총보인 경우, 상기 제2 영역은 악기에 따라 제3 영역, 제4 영역으로 분류될 수 있다. 상기 제어부는 상기 생성된 매핑 테이블을 상기 메모리에 저장할 수 있다. 상기 매핑 테이블 생성이 완료되면, 동작 330에서, 상기 통신부는 상기 매핑 테이블을 상기 제2 전자 장치로 전송할 수 있다. 또는, 상기 통신부는 상기 매핑 테이블을 상기 제2 전자 장치로 전송하지 않을 수도 있다.동작 340에서, 상기 통신부는 상기 매핑 태이블에 관련된 상기 제2 영역의 콘텐츠 정보를 상기 제2 전자 장치로 전송할 수 있다. 예를 들어, 상기 통신부는 DLNA, Allshare, WIFI Direct의 miracast 중 어느 하나로 상기 제2 전자 장치로 상기 제2 영역의 콘텐츠 정보를 전송할 수 있다. 상기 전자 장치의 출력부(예: 도 1의 입출력 인터 페이스 140 또는 도 2의 출력부 220)는 상기 콘텐츠의 제1 영역을 출력할 수 있다. 예를 들어, 상기 출력부는 스피커로 상기 콘텐츠의 제1 영역에 대응하는 음을 출력하거나, 상기 표시부에 상기 콘텐츠의 제1 영역을 표시 할 수 있다. 상기 출력한다는 것은 오디오 및/또는 비디오를 재생한다는 의미를 포함할 수 있다. 상기 통신부는 상기 제2 전자 장치와 일대일로 연결될 수도 있고(1:1), 복수의 제2 전자 장치들과 일대N으로 연 결될 수도 있다. 상기 제2 전자 장치가 복수개인 경우, 상기 통신부는 상기 복수의 제2 전자 장치들로부터 각 장치 타입을 수신할 수 있다. 상기 장치 타입은 상기 제2 전자 장치가 속하는 콘텐츠의 영역의 속성 또는 상기 제2 전자 장치가 수신하고자 하는 콘텐츠의 영역에 대한 것일 수 있다. 상기 장치 타입은 상기 제2 전자 장치의 제2 사용자가 설정할 수 있다. 상기 복수의 제2 전자 장치들의 장치 타입은 모두 동일하거나, 각각 다를 수 있 다. 예를 들어, 상기 두 개의 제2 전자 장치들의 장치 타입들이 동일한 경우, 상기 통신부는 상기 콘텐츠의 2페 이지를 두 개의 제2 전자 장치들로 전송하고, 상기 출력부는 상기 콘텐츠의 1 페이지를 재생할 수 있다. 또는, 상기 두 개의 제2 전자 장치들의 장치 타입들이 각각 상이한 경우, 상기 통신부는 상기 콘텐츠의 2페이지를 제2 전자 장치로 전송하고, 상기 콘텐츠의 3페이지를 제3 전자 장치로 전송하며, 상기 출력부는 상기 콘텐츠의 1페 이지를 재생할 수 있다. 다양한 실시예들에 따르면, 상기 출력부가 상기 제1 영역을 출력하는 동안, 상기 제어부는 상기 제1 영역과 매 칭된 제2 영역을 상기 메모리에 저장된 매핑 테이블에서 검색하고, 상기 통신부는 상기 검색된 제2 영역의 콘텐 츠 정보를 상기 제2 전자 장치에 전송할 수 있다. 상기 제2 전자 장치는 상기 수신된 제2 영역을 출력할 수 있 다. 즉, 통신부 240은 상기 콘텐츠 정보로서, 상기 제2 영역에 해당하는 콘텐츠 자체를 전송할 수 있다. 상기 제2 전자 장치는 상기 콘텐츠의 제2 영역을 수신하여, 상기 제2 영역을 출력할 수 있다. 이때, 상기 제2 전자 장치는 상기 콘텐츠를 메모리에 저장하지 않고, 출력할 상기 콘텐츠의 제2 영역을 수신하여 출력할 수 있다. 다양한 실시예들에 따르면, 상기 통신부는 상기 메모리에 저장된 상기 매핑 테이블을 상기 제2 전자 장치로 전 송할 수 있다. 이 경우, 상기 제2 전자 장치는 상기 콘텐츠 및 상기 매핑 테이블을 메모리에 저장할 수 있다. 상기 통신부는 상기 콘텐츠 정보로서, 상기 제2 영역의 콘텐츠 정보를 전송할 수 있다. 상기 제2 전자 장치는 상기 메모리에 저장된 콘텐츠 및 매핑 테이블에 기초하여 제2 영역을 추출할 수 있다. 상기 제2 전자 장치는 상기 매핑 테이블에서 상기 제2 영역의 참조번호를 검색하여 상기 메모리에 저장된 상기 콘텐츠의 제2 영역을 출력할 수 있다. 다양한 실시예들에 따르면, 상기 제어부는 상기 출력부의 마이크로부터 수신되는 음을 분석하여 상기 음과 관련 된 총보의 마디를 확인할 수 있다. 상기 제어부는 상기 사용자의 손 또는 기타 수단으로부터 악보를 넘기는 입 력을 받는 경우, 다음 페이지로 넘어가는 입력으로 처리할 수 있다. 또는, 상기 사용자가 손 또는 기타 수단으 로부터 악보를 넘기지 않더라도, 상기 제어부는 마이크로부터 연주되는 음을 분석하여, 주멜로디를 인지할 수 있다. 이 경우, 상기 제어부는 상기 분석된 음을 통해 상기 음과 관련된 총보의 마디를 확인함으로써, 하나의 악보(예를 들면, 주멜로디를 연주하는 바이올린 악보)의 페이지가 넘어가는 것으로 인지되면, 다른 악보에도 해 당 페이지와 연관된 페이지를 보여주도록 하는 명령을 전달할 수 있다. 이를 위해, 상기 통신부는 상기 마디와 관련된 정보를 상기 각 제2 전자 장치로 전송할 수 있다. 상기 제2 전자 장치는 상기 마디와 관련된 정보를 이 용하여 상기 마디와 관련된 악보를 표시할 수 있다. 다양한 실시예들에 따르면, 상기 표시부는 상기 콘텐츠의 제1 영역을 표시할 수 있다. 이 경우, 상기 제2 전자 장치가 일정거리 이내에 위치하는 경우, 상기 통신부는 상기 표시부에 표시되지 않는 제2 영역의 콘텐츠 정보를 상기 제2 전자 장치로 전송할 수 있다. 상기 제2 전자 장치는 상기 콘텐츠의 제2 영역을 표시할 수 있다. 상 기 제2 영역은 상기 표시부에 제1 영역을 표시하고 있는 동안, 표시부 230에 표시되지 않는 영역일 수 있다. 예컨대, 상기 제2 영역은 스크롤을 움직여야지만 상기 표시부에 표시되는 영역일 수 있다. 상기 입력은 스크롤 을 상, 하, 좌, 우로 움직이는 명령일 수 있다. 상기 표시부는 상기 사용자의 입력에 따라 상기 콘텐츠의 제3 영역을 표시할 수 있다. 상기 표시부에 상기 콘텐츠의 제3 영역이 표시되면, 상기 통신부는 상기 표시부에 표시 되지 않는 상기 콘텐츠의 제4 영역의 콘텐츠 정보를 상기 제2 전자 장치로 전송할 수 있다. 이 경우, 상기 제2 전자 장치는 상기 콘텐츠의 제4 영역을 표시할 수 있다. 상기 제2 전자 장치는 전자 장치 200의 상기 표시부에 표시되는 콘텐츠의 영역과 연동하여 표시할 영역이 결정될 수 있다. 도 4a를 참고하면, 콘텐츠 제공 시스템은 도면부호 400으로 도시한 제1 전자 장치(예: 도 1의 전자 장치 101, 또는 도 2의 전자 장치 200)와 도면부호 410으로 도시한 제2 전자 장치로 구성될 수 있다. 제1 전자 장치 400은 스마트폰과 같은 휴대 단말기이거나, 태블릿 PC와 같은 컴퓨터이거나, TV와 같은 표시 장치 중 어느 하나일 수 있다. 또한, 제2 전자 장치 410은 스마트폰과 같은 휴대 단말기이거나, 태블릿 PC와 같은 컴퓨터이거나, TV와 같은 표시 장치 중 어느 하나일 수 있다. 즉, 상기 제1 전자 장치와 상기 제2 전자 장치의 종류(휴대 단말기, 태블릿 PC, TV)는 콘텐츠에 따라, 사용자에 따라 다르게 적용될 수 있다. 도 4a 내지 도 4c는 본 발명의 다양한 실시예에 따라 콘텐츠 제공 시스템을 도시한 도면이다. 도 4a를 참고하면, 콘텐츠 제공 시스템은 도면부호 400으로 도시한 제1 전자 장치(예: 도 1의 전자 장치 101, 또는 도 2의 전자 장치 200)와 도면부호 410으로 도시한 제2 전자 장치로 구성될 수 있다. 제1 전자 장치 400은 스마트폰과 같은 휴대 단말기이거나, 태블릿 PC와 같은 컴퓨터이거나, TV와 같은 표시 장치 중 어느 하나일 수 있다. 또한, 제2 전자 장치 410은 스마트폰과 같은 휴대 단말기이거나, 태블릿 PC와 같은 컴퓨터이거나, TV와 같은 표시 장치 중 어느 하나일 수 있다. 즉, 상기 제1 전자 장치와 상기 제2 전자 장치의 종류(휴대 단말기, 태블릿 PC, TV)는 콘텐츠에 따라, 사용자에 따라 다르게 적용될 수 있다. 도 4b를 참고하면, 동작 401에서, 제1 전자 장치 400는 제2 전자 장치 410로 요청 신호를 전송할 수 있다. 제1 전자 장치 400는 DLNA, Allshare, WIFI Direct의 miracast 중 어느 하나로 상기 제2 전자 장치로 상기 요청 신 호를 전송할 수 있다. 상기 요청 신호는 기선정된 영역 내에 위치한 임의의 제2 전자 장치에 전송될 수 있다. 또는 상기 요청 신호는 연결을 요청하기 위한 것으로, 제1 전자 장치 400의 식별번호, 이름, 장치 타입 등에 대 한 정보를 포함할 수 있다. 동작 402에서, 제2 전자 장치 410은 상기 요청 신호에 대한 응답 신호를 전송할 수 있다. 상기 응답 신호는 상기 제2 전자 장치 400의 식별번호, 이름 등에 대한 정보를 포함할 수 있다. 동작 403 에서, 제1 전자 장치 400은 상기 응답 신호를 수신하고, 장치 타입을 요청할 수 있다. 상기 장치 타입은 제2 전 자 장치 410에게 전송할 영역에 대한 정보를 알기 위한 것이다. 예를 들어, 상기 장치 타입은 제2 전자 장치 410가 속하는 콘텐츠의 영역의 속성 또는 제2 전자 장치 410가 수신하고자 하는 콘텐츠의 영역에 대한 것일 수 있다. 상기 장치 타입은 제2 전자 장치 401의 제2 사용자가 설정할 수 있다. 동작 404에서, 제2 전자 장치 410 은 상기 장치 타입을 제1 전자 장치 400로 전송할 수 있다. 상기 장치 타입이 수신되면, 동작 405에서, 제1 전 자 장치 400와 제2 전자 장치 410는 연결이 완료될 수 있다. 동작 406에서, 제1 전자 장치 400은 사용자로부터 출력할 콘텐츠를 선택받고, 선택된 콘텐츠를 분석할 수 있다. 상기 콘텐츠는 텍스트, 이미지, 동영상, 문서, 음악 중 적어도 하나를 포함하는 멀티미디어 콘텐츠일 수 있다. 제1 전자 장치 400은 상기 선택된 콘텐츠의 속성으로서 상기 콘텐츠에 포함된 데이터의 종류, 상기 콘텐츠의 페 이지 번호, 상기 콘텐츠의 레이어 및 상기 콘텐츠의 마디수 중 적어도 하나를 분석할 수 있다. 동작 407에서, 제1 전자 장치 400은 상기 콘텐츠의 속성에 기초하여 상기 콘텐츠의 제1 영역과 상기 제1 영역과 연관된 상기 콘텐츠의 제2 영역을 매핑시키는 매핑 테이블을 생성할 수 있다. 상기 매핑 테이블은 상기 콘텐츠 의 속성별로 상기 콘텐츠에 포함된 복수의 영역들이 분류되고, 분류된 각 영역을 출력할 전자 장치에 매핑한 것 일 수 있다. 제1 전자 장치 400은 상기 매핑 테이블을 메모리에 저장할 수 있다. 동작 408에서, 제1 전자 장치 400은 상기 매핑 테이블을 제2 전자 장치 410로 전송할 수 있다. 또는, 제1 전자 장치 400은 상기 매핑 테이블을 제2 전자 장치 410로 전송하지 않을 수도 있다. 동작 409 및 동작 411에서, 제1 전자 장치 400은 상기 매핑 태이블에 관련된 상기 제2 영역의 콘텐츠 정보를 상 기 제2 전자 장치로 전송하고, 상기 콘텐츠의 제1 영역을 출력할 수 있다. 제1 전자 장치 400은 동작 409 및 동 작 411을 동시에 수행하거나, 동작 409을 먼저 수행하고, 동작 411을 수행하거나, 동작 411을 먼저 수행하고, 동작 409을 수행할 수도 있다. 여기서, 제1 전자 장치 400와 제2 전자 장치 410은 각각 상기 제1 영역과 상기 제2 영역을 동시에 출력할 수 있 다. 또는, 제1 전자 장치 400와 제2 전자 장치 410은 콘텐츠에 따라 시간차를 두고 상기 제1 영역과 상기 제2 영역을 출력할 수 있다. 도 4c 참고하면, 동작 421에서, 제1 전자 장치 400은 사용자로부터 출력할 콘텐츠를 선택받고, 선택된 콘텐츠를 분석할 수 있다. 상기 콘텐츠는 텍스트, 이미지, 동영상, 문서, 음악 중 적어도 하나를 포함하는 멀티미디어 콘텐츠일 수 있다. 제1 전자 장치 400은 상기 선택된 콘텐츠의 속성으로서 상기 콘텐츠에 포함된 데이터의 종류, 상기 콘텐츠의 페이지 번호, 상기 콘텐츠의 레이어 및 상기 콘텐츠의 마디수 중 적어도 하나를 분석할 수 있다. 동작 422에서, 제1 전자 장치 400는 제2 전자 장치 410로 요청 신호를 전송할 수 있다. 제상기 요청 신호는 기 선정된 영역 내에 위치한 임의의 제2 전자 장치에 전송될 수 있다. 또는 상기 요청 신호는 연결을 요청하기 위 한 것으로, 제1 전자 장치 400의 식별번호, 이름, 장치 타입 등에 대한 정보를 포함할 수 있다. 동작 423에서, 제2 전자 장치 410은 상기 요청 신호에 대한 응답 신호를 전송할 수 있다. 상기 응답 신호는 상기 제2 전자 장 치 400의 식별번호, 이름 등에 대한 정보를 포함할 수 있다. 동작 424에서, 제1 전자 장치 400은 상기 응답 신 호를 수신하고, 장치 타입을 요청할 수 있다. 상기 장치 타입은 제2 전자 장치 410에게 전송할 영역에 대한 정 보를 알기 위한 것이다. 예를 들어, 상기 장치 타입은 제2 전자 장치 410가 속하는 콘텐츠의 영역의 속성 또는 제2 전자 장치 410가 수신하고자 하는 콘텐츠의 영역에 대한 것일 수 있다. 상기 장치 타입은 제2 전자 장치 401의 제2 사용자가 설정할 수 있다. 동작 425에서, 제2 전자 장치 410은 상기 장치 타입을 제1 전자 장치 400 로 전송할 수 있다. 상기 장치 타입이 수신되면, 동작 426에서, 제1 전자 장치 400와 제2 전자 장치 410는 연결 이 완료될 수 있다. 동작 427에서, 제1 전자 장치 400은 상기 콘텐츠의 속성에 기초하여 상기 콘텐츠의 제1 영역과 상기 제1 영역과 연관된 상기 콘텐츠의 제2 영역을 매핑시키는 매핑 테이블을 생성할 수 있다. 상기 매핑 테이블은 상기 콘텐츠 의 속성별로 상기 콘텐츠에 포함된 복수의 영역들이 분류되고, 분류된 각 영역을 출력할 전자 장치에 매핑한 것 일 수 있다. 제1 전자 장치 400은 상기 매핑 테이블을 메모리에 저장할 수 있다. 동작 428에서, 제1 전자 장치 400은 상기 매핑 테이블을 제2 전자 장치 410로 전송할 수 있다. 또는, 제1 전자 장치 400은 상기 매핑 테이블을 제2 전자 장치 410로 전송하지 않을 수도 있다. 동작 429 및 동작 430에서, 제1 전자 장치 400은 상기 매핑 태이블에 관련된 상기 제2 영역의 콘텐츠 정보를 상 기 제2 전자 장치로 전송하고, 상기 콘텐츠의 제1 영역을 출력할 수 있다. 제1 전자 장치 400은 동작 429 및 동 작 430을 동시에 수행하거나, 동작 429를 먼저 수행하고, 동작 430을 수행하거나, 동작 430을 먼저 수행하고, 동작 429를 수행할 수도 있다. 여기서, 제1 전자 장치 400와 제2 전자 장치 410은 각각 상기 제1 영역과 상기 제2 영역을 동시에 출력할 수 있 다. 또는, 제1 전자 장치 400와 제2 전자 장치 410은 콘텐츠에 따라 시간차를 두고 상기 제1 영역과 상기 제2 영역을 출력할 수 있다. 도 5a는 본 발명의 다양한 실시예에 따른 다른 전자 장치와 연동하여 콘텐츠를 제공하는 화면의 일례를 도시한 도면이다. 도 5a는 제1 전자 장치에서 제2 전자 장치와 연동하여 콘텐츠를 출력하기 위한 화면을 도시한 것이다. 도 5a에 서 540은 상기 제1 전자 장치를 의미하고, 550은 상기 제2 전자 장치를 의미할 수 있다. 제1 전자 장치 540이 제2 전자 장치 550를 표시할 때는 제2 전자 장치 550의 이름 \"LN 46230T\"를 표시할 수 있다. 제2 전자 장치 550의 이름은 제2 전자 장치 550의 제2 사용자에 의해 설정된 것일 수 있다. 도 5a 및 도 5b에서 제1 사용자는 제1 전자 장치 540를 사용하는 또는 소유한 사용자를 의미하고, 제2 사용자는 제2 전자 장치 550를 사용하는 또 는 소유한 사용자를 의미할 수 있다. 이는 발명의 이해를 돕기 위한 것으로, 본 발명을 제한하는 것은 아니다. 제1 전자 장치 540은 \"N-Screen Manager\"라는 서비스를 통해 출력할 수 있는 콘텐츠의 목록을 표시할 수 있다. 상기 콘텐츠의 목록은 도면부호 510과 같은 Ebook 살찐 곰돌이, 도면부호 520과 같은 Composer 영웅교향곡, 도 면부호 530과 같은 Ebook 수학문제집을 포함할 수 있다. 상기 제1 사용자가 상기 콘텐츠 목록의 양 옆의 스크 롤을 클릭하면, 제1 전자 장치 540은 현재 화면에는 보이지 않던 다른 콘텐츠를 표시할 수 있다. 상기 제1 사용 자가 상기 콘텐츠 목록 중에서 하나를 선택하면, 제1 전자 장치 540는 제1 전자 장치 540 및 제2 전자 장치 550 에서 재생될 콘텐츠 정책(예: N Screen Policy)을 도면부호 560과 같은 \"Contents Configuration\" 파일에서 불 러오고, \"Contents Configuration\"을 기반으로 제1 영역을 표시하고, 상기 제1 사용자가 drag and drop 방식으 로 제2 전자 장치 550와 해당 정책을 연동시킬 수 있다. N Screen Policy는 콘텐츠를 출력할 매핑 테이블을 간략하게 표시한 것으로, 예컨대, 제1 전자 장치 540은 A 패 턴으로 콘텐츠를 출력하고, 제2 전자 장치 550는 B 패턴으로 콘텐츠를 출력하는 것을 의미한다. 도 5a에 도시 한 바와 같이, A 패턴은 \"Picture Mode\"로 이미지를 표시하는 패턴이고, 상기 이미지는 1, 3, 5, 7 페이지와 같 은 홀수 페이지에 포함되어, 제1 전자 장치 540는 책의 홀수 페이이지를 제1 영역으로서 출력하는 것을 의미한 다. B 패턴은 \"Text Mode\"로 텍스트를 표시하는 패턴이고, 상기 텍스트는 2, 4, 6, 8 페이지와 같은 짝수 페이 지에 포함되어, 제2 전자 장치 550는 책의 짝수 페이이지를 제2 영역으로서 출력하는 것을 의미한다. 상기 제1 영역과 상기 제2 영역을 서로 동기화하기 위하여, 콘텐츠의 속성이 필요한데, 상기 콘텐츠의 속성은 콘텐츠로부 터 획득하거나, 제1 전자 장치 540이 상기 콘텐츠를 분석하여 생성하거나, 상기 제1 사용자로부터 상기 콘텐츠의 속성을 설정받을 수 있다. 도면부호 560과 같은 Contents Configuration을 상기 제1 사용자가 선택하면, 제1 전자 장치 540는 상기 콘텐츠 의 속성을 상기 콘텐츠로부터 획득할 수 있다. 도면부호 570과 같은 Device Configuration을 상기 제1 사용자 가 선택하면, 제1 전자 장치 540는 상기 콘텐츠를 분석하여 상기 콘텐츠의 속성을 생성할 수 있다. 도면부호 580과 같은 User Configuration 1, 또는 581과 같은 User Configuration 2를 상기 제1 사용자가 선택하면, 제1 전자 장치 540는 상기 제1 사용자로부터 상기 콘텐츠의 속성을 설정받을 수 있다. 도면부호 580과 같은 User Configuration 1의 콘텐츠 속성과 581과 같은 User Configuration 2의 콘텐츠의 속성은 서로 다를 수 있다. 도 5b는 본 발명의 다양한 실시예에 따른 종래기술과 본원발명의 차이점을 도시한 도면이다. 도 5b는 종래기술의 \"N-Screen Manager\"(왼쪽)와 본원발명의 \"N-Screen Manager\"(오른쪽)간의 차이점을 이해하 기 쉽게 비교한 화면을 도시한 것이다. 종래기술에 따르면(왼쪽 박스), 도면부호 500a와 같은 Device 1(예: 제 1 전자 장치)이 원본 콘텐츠 C를 표시부 1에 표시할 때, 도면부호 500b와 같은 Device 2(예: 제2 전자 장치)는 동일하게 원본 콘텐츠 C를 표시부 2에 표시하는 것을 의미한다. 그러나, 본원발명에 따르면(오른쪽 박스), 500a와 같은 Device 1은 원본 콘텐츠 C를 영역 A-1을 표시부 1에 표시할 때, 도면부호 500b와 같은 Device 2 (예: 제2 전자 장치)는 영역 A-1과 연관된 영역 B-1을 표시부 2에 표시하는 것을 의미한다. 본원발명에 따르면, Device 1과 Device 2가 동일한 원본 콘텐츠를 표시할 때, Device 1은 원본 콘텐츠 C의 영역 A-1을 표시 하고, Device 2는 원본 콘텐츠 C의 영역 B-1을 표시함으로써, Device 1과 Device 2는 서로 다른 영역을 표시하 는 것을 의미한다. 도 5c는 본 발명의 다양한 실시예에 따른 두 전자 장치 간의 콘텐츠 제공 방법을 도시한 흐름도이다. 도 5c를 참고하면, 동작 501에서, Device 1(예: 제1 전자 장치)과 Device 2(예: 제2 전자 장치)는 서로 연결된 다. Device 1과 Device 2는 서로 데이터를 주고 받을 수 있는 상태임을 의미한다. 동작 502에서, Device 1은 사 용자의 선택에 따라 Ebook 어플리케이션을 활성화하고, Ebook 어플리케이션 내 하나의 컨텐츠를 Nscreen으로 설 정할 것을 선택받을 수 있다. 즉, Device 1은 선택된 콘텐츠의 제1 영역과 상기 제1 영역과 연관된 상기 콘텐츠 의 제2 영역을 매핑시키는 매핑 테이블 502a를 생성할 수 있다. 매핑 테이블 502a는 콘텐츠의 제1 영역(1 페이 지, 2 페이지)을 Device 1의 표시부 1에 표시할 때, 콘텐츠의 제2 영역(101 페이지, 102~104 페이지)을 Device 2의 표시부 2에 표시하도록 하는 것이다. 동작 503에서, Device 1은 Device 2로 콘텐츠 공유 플레이 명령을 전 송하고, 콘텐츠명, 매핑 테이블, Device 1의 페이지 넘버(1 페이지)를 전송할 수 있다. 이때, Device 1은 상기 표시부 1에 1 페이지를 표시할 수 있다. 동작 504에서, Device 2는 상기 콘텐츠 공유 플레이 명령에 따라 Ebook 어플리케이션을 활성화하고, 매핑 테이 블을 참조하여 표시부 2에 101 페이지를 표시할 수 있다. 동작 505에서, Device 1은 사용자의 입력에 따라 콘텐츠의 페이지를 넘길 수 있다. 동작 506에서, Device 1은 Device 2로 콘텐츠의 변화를 알리고, 콘텐츠명 Device 1의 페이지 넘버(2 페이지)를 전송할 수 있다. 이때, Device 1은 상기 표시부 1에 2 페이지를 표시할 수 있다. 동작 507에서, Device 2는 상기 매핑 테이블을 참조하여 102 페이지를 표시할 수 있다. 도 6a 및 도 6b는 본 발명의 다양한 실시예에 따른 콘텐츠의 페이지별로 매핑하여 콘텐츠를 재생하는 동작을 도 시한 도면이다. 도 6b는 아이, 유아 대상 콘텐츠에 대해서, 유치원과 같은 곳에서 활용될 수 있는 실시예이다. 곰돌이가 그려진 도면부호 660은 제2 전자 장치의 화면이고, 텍스트(곰돌이는 매일 밥을 많이 먹어 체중이 점점 늘었어요)가 표 시된 도면부호 670은 제1 전자 장치의 화면의 일례이다. 제2 전자 장치는 제2 사용자인 아이가 보는 것이고, 제1 전자 장치는 제1 사용자인 어른이 보는 것일 수 있다. 도 6b는 아이와 어른에게 서로 다른 내용을 보여 주 기 위해 활용된 일례이다. 이하에서는 도 6a를 참고하여 도 6b와 같은 화면을 표시하기 위한 방법을 설명한다 도 6a를 참고하면, 동작 610에서, 제1 전자 장치는 도 5a의 \"Ebook 살찐 곰돌이\"에 해당하는 콘텐츠를 선택받을 수 있다. 동작 620에서, 제1 전자 장치는 제2 전자 장치와 연결할 수 있다. 연결하는 방법은 도 4c와 같이 수행 된다. 동작 630에서, 제1 전자 장치는 상기 선택된 콘텐츠의 속성을 분석할 수 있다. 일반적인 동화책에서 한 페이지에는 그림이, 다른 한 페이지에는 글이 나오는 경우가 있는데, 제1 전자 장치는 텍스트 위주의 화면을 표시하고, 제2 전자 장치는 그림 위주의 화면을 표시할 수 있다. 동작 640에서, 제1 전자 장치는 상기 콘텐츠의 제1 페이지는 자신에게 매핑시키고, 상기 콘텐츠의 제2 페이지를 제2 전자 장치에 매핑시켜 매핑 테이블을 생성할 수 있다. 예를 들어, 제1 전자 장치는 1,3,5,7 순으로 홀수 페 이지에 매핑하고, 제2 전자 장치에는 2,4,6,8 인 짝수 페이지를 매핑하여 매핑 테이블을 생성할 수 있다. 동작 601에서, 제1 전자 장치는 제2 전자 장치로 매핑 테이블을 전송할 수 있다. 또는 제1 전자 장치는 매핑 테 이블을 전송하지 않을 수도 있다. 동작 650에서, 제1 전자 장치는 제2 페이지의 콘텐츠 정보를 제2 전자 장치로 전송하고, 상기 콘텐츠의 제1 페 이지를 재생할 수 있다. 다양한 실시예들에 따르면, 제1 전자 장치는 사용자의 입력에 응답하여 표시되는 텍스트가 다음 텍스트로 넘어 가면, 제2 전자 장치에게 상기 다음 텍스트에 대응하는 이미지를 표시하도록 명령할 수 있다. 상기 명령은 상 기 다음 텍스트에 해당하는 페이지 번호 또는, 상기 다음 텍스트에 대응하는 이미지가 포함된 페이지 번호를 포 함한 것일 수 있다. 반대로, 제2 전자 장치는 사용자의 입력에 응답하여 이미지가 다음 이미지로 넘어가면, 제1 전자 장치에게 상기 다음 이미지에 대응하는 텍스트를 표시하도록 명령할 수 있다. 즉, 제1 전자 장치와 제2 전 자 장치는 사용자의 입력을 감지하여, 감지된 입력에 해당하는 페이지를 출력하고, 동시에 또는 시간차를 두고 상대방 전자 장치(제1 전자 장치 또는 제2 전자 장치)로 출력할 페이지에 대한 명령을 전달하거나, 출력할 페이 지를 전송할 수 있다. 예를 들어, 제1 전자 장치에서 페이지를 넘기는 제스처, 예컨대, 스크롤, 플링 등의 입 력이 감지되면, 현재 표시되는 페이지의 다음 페이지 또는 이전 페이지를 표시할 수 있다. 이와 더불어, 제2 전자 장치는 제1 전자 장치의 변화를 감지하여, 현재 표시되는 페이지의 다음 페이지 또는 이전 페이지를 표시 할 수 있다. 예를 들어, 제1 전자 장치가 1 페이지를 표시하는 중에, 다음 페이지로의 이동을 원하는 스크롤 입 력을 수신한 경우, 3페이지를 표시할 수 있다. 제2 전자 장치는 2 페이지를 표시하는 중에, 제1 전자 장치의 상기 스크롤 입력에 대응하여 4페이지를 표시할 수 있다. 제1 전자 장치와 제2 전자 장치는 사용자로부터 수신 되는 입력을 서로 송, 수신하여 공유할 수 있다. 도 7a 및 도 7b는 본 발명의 다양한 실시예에 따른 콘텐츠의 레이어별로 매핑하여 콘텐츠를 재생하는 동작을 도 시한 도면이다. 도 7b는 동일한 콘텐츠에 대해 콘텐츠의 레이어를 분리하여, 각 레이어별로 각 전자 장치에서 출력하는 실시예 를 도시한 화면이다. 예컨대, 하나의 전자 장치에서 표시하는 경우에는 곰돌이가 그려진 도면부호 760과 같은 이미지 레이어와 텍스트가 표시된 도면부호 770과 같은 텍스트 레이어를 함께 디스플레이시켜 하나의 화면을 구 성할 수 있다. 그런데, 두 개의 전자 장치에서 표시하는 경우에는 두 개의 레이어를 분리하여, 이미지 레이어 는 제2 전자 장치에서 출력하도록 하고, 텍스트 레이어는 제1 전자 장치에서 출력하도록 할 수 있다. 이때의, 제2 전자 장치는 제2 사용자인 아이가 보는 것이고, 제1 전자 장치는 제1 사용자인 어른이 보는 것일 수 있다. 이하에서는 도 7a를 참고하여 도 7b와 같은 화면을 표시하기 위한 방법을 설명한다. 도 7a를 참고하면, 동작 710에서, 제1 전자 장치는 도 5a의 \"Ebook 살찐 곰돌이\"에 해당하는 콘텐츠를 선택받을 수 있다. 동작 720에서, 제1 전자 장치는 제2 전자 장치와 연결할 수 있다. 연결하는 방법은 도 4c와 같이 수행 된다. 동작 730에서, 제1 전자 장치는 상기 선택된 콘텐츠의 속성을 분석할 수 있다. 동작 740에서, 제1 전자 장치는 상기 콘텐츠의 제1 레이어는 자신에게 매핑시키고, 상기 콘텐츠의 제2 레이어를 제2 전자 장치에 매핑시 켜 매핑 테이블을 생성할 수 있다. 동작 701에서, 제1 전자 장치는 제2 전자 장치로 매핑 테이블을 전송할 수 있다. 또는 제1 전자 장치는 매핑 테 이블을 전송하지 않을 수도 있다. 동작 750에서, 제1 전자 장치는 제2 레이어의 콘텐츠 정보를 제2 전자 장치로 전송하고, 상기 콘텐츠의 제1 레 이어를 재생할 수 있다. 도 8a 내지 도 8c는 본 발명의 다양한 실시예에 따른 복수의 제2 전자 장치들에 동일한 콘텐츠를 출력하는 동작 을 도시한 도면이다. 도 8a은 복수의 제2 전자 장치들로 동일한 콘텐츠를 출력하는 일례로서, 콘텐츠가 도 8b와 같이 학습지와 관련 된 경우일 수 있다. 예를 들면, 도면부호 810은 선생님이 보는 제1 전자 장치이고, 도면부호 820, 821, 822, 823, 824, 825는 학생들이 보는 복수의 제2 전자 장치들이다. 복수의 제2 전자 장치들(820 내지 825)은 제2-1 전자 장치 820, 제 2-2 전자 장치 821, 제2-3 전자 장치 822, 제2-4 전자 장치 823, 제2-5 전자 장치 824, 제2-6 전자 장치 825를 포함할 수 있다. 도 8b는 학생(제2 사용자)의 제2 전자 장치와 선생님(제1 사용자)의 제1 전자 장치로 서로 다른 내용을 표시하 는 일례를 도시한 도면이다. 도면부호 830은 상기 제2 전자 장치의 화면으로, 제2 전자 장치는 상기 학습지와 관련된 문제 페이지(문제: A가 치즈의 5분의 1을 먹고 ...)를 표시할 수 있다. 또한, 도면부호 840은 상기 제1 전자 장치의 화면으로, 제1 전자 장치는 상기 문제 페이지에 대한 해답 페이지(4/5*4/9=16/45 ...)를 표시할 수 있다. 이하에서는 도 8c를 참고하여 도 8b와 같은 화면을 표시하기 위한 방법을 설명한다. 도 8c를 참고하면, 동작 801에서, 제1 전자 장치는 도 5a의 \"Ebook 수학 문제집\"에 해당하는 콘텐츠를 선택받을 수 있다. 동작 802에서, 제1 전자 장치는 제2 전자 장치와 연결할 수 있다. 연결하는 방법은 도 4c와 같이 수행 된다. 동작 803에서, 제1 전자 장치는 상기 복수의 제2 전자 장치들(예: 도 8a의 820 내지 825)로부터 각 장치 타입을 수신할 수 있다. 상기 장치 타입은 상기 제2 전자 장치가 속하는 콘텐츠의 영역의 속성 또는 상기 제2 전자 장치가 수신하고자 하는 콘텐츠의 영역에 대한 것일 수 있다. 여기서는, 상기 콘텐츠가 학습지이기 때문에, 상기 복수의 제2 전자 장치들의 장치 타입은 문제 페이지가 속한 영역에 대한 것일 수 있다. 동작 804에서, 제1 전자 장치는 상기 선택된 콘텐츠의 속성을 분석할 수 있다. 예를 들어, 제1 전자 장치는 학 습지가 총 150 페이지로 구성되고, 상기 문제 페이지는 1~100 페이지이고, 상기 해답 페이지는 101~150 페이지 로 분석할 수 있다. 동작 805에서, 제1 전자 장치는 상기 콘텐츠의 속성 및 상기 장치 타입에 기초하여 상기 복수의 제2 전자 장치들에 상기 콘텐츠의 제2 영역을 매핑하여 상기 매핑 테이블을 생성할 수 있다. 상기 매핑 테이블은 101 페이지를 제1 영역으로, 101의 페이지와 관련된 문제 페이지를 1-3페이지로 하여 제2 영역으로 분 류하고, 상기 제1 영역은 제1 전자 장치에 상기 제2 영역은 제2 전자 장치에 매핑할 것일 수 있다. 동작 806a에서, 제1 전자 장치는 제2-1 전자 장치(예: 도 8a의 820)로 매핑 테이블을 전송하거나, 전송하지 않 을 수도 있다. 동작 806b에서, 제1 전자 장치는 제2-2 전자 장치(예: 도 8a의 821)로 매핑 테이블을 전송하거나, 전송하지 않을 수도 있다. 동작 806c에서, 제1 전자 장치는 제2-3 전자 장치(예: 도 8a의 822)로 매핑 테이블을 전송하거나, 전송하지 않을 수도 있다. 동작 807에서, 제1 전자 장치는 제2 영역의 콘텐츠 정보를 제2-1 전자 장치로 전송하고, 동작 808에서, 제1 전 자 장치는 제2 영역의 콘텐츠 정보를 제2-2 전자 장치로 전송하며, 동작 809에서, 제1 전자 장치는 제2 영역의 콘텐츠 정보를 제2-3 전자 장치로 전송할 수 있다. 동작 811에서, 제1 전자 장치는 상기 콘텐츠의 제1 영역을 표시할 수 있다. 제1 전자 장치는 동작 807 내지 809와 동작 811을 동시에 수행하거나, 동작 807 내지 809을 먼 저 수행하고, 동작 811을 수행하거나, 동작 811을 먼저 수행하고, 동작 807 내지 809을 수행할 수도 있다. 다양한 실시예에 따르면, 101 페이지는 1 페이지에 대응하는 제1 영역(예컨대, 상단), 2 페이지에 대응하는 제2 영역(예컨대, 중간), 3페이지에 대응하는 제3 영역(예컨대, 하단)을 포함할 수 있다. 상기 제1 영역 내지 상기 제3 영역의 크기는 동일할 수도 있고, 다를 수도 있다. 상기 선생님의 입력에 따라, 제1 전자 장치가 101 해답 페이지의 제1 영역을 표시하는 경우, 복수의 제2 전자 장치들은 1 페이지를 표시할 수 있다. 제1 전자 장치는 상기 선생님이 상기 해답 페이지를 넘기는 제스처, 예컨대, 스크롤, 플링 등의 입력이 감지되면, 101 해답 페이 지의 제2 영역을 표시할 수 있다. 이와 더불어, 제2 전자 장치는 제1 전자 장치의 변화를 감지하여, 2 페이지 를 표시할 수 있다. 다양한 실시예들에 따르면, 제1 전자 장치가 팝업창 형태로 다른 페이지를 열더라도, 복수의 제2 전자 장치들은 기존의 페이지를 그대로 유지하도록 할 수 있다. 예를 들어, 제1 전자 장치가 파워 포인트(PPT)와 같은 문서에 대해서 복수의 제2 전자 장치들과 연결하여 표시하는 경우, 보조도면, 보조링크 등을 열더라도 복수의 제2 전자 장치들은 기존 페이지를 유지할 수 있다. 제1 전자 장치는 콘텐츠에 reference를 부가하고, 이후 reference를 이용하여 해당 페이지를 바로 검색할 수 있다. 하나의 콘텐츠에 대한 동기화된 서비스 제공을 통해 니즈가 다른 다수의 사용자들에게 콘텐츠 활용성을 높일 수 있다. 도 9a 내지 도 9c는 본 발명의 다양한 실시예에 따른 복수의 제2 전자 장치들로 서로 다른 콘텐츠를 출력하는 동작을 도시한 도면이다. 도 9a는 복수의 제2 전자 장치들로 서로 다른 콘텐츠를 출력하는 실시예로서, 콘텐츠가 도 9b와 같이 오케스트 라 악보와 관련된 경우일 수 있다. 예를 들면, 도면부호 910은 지휘자가 보는 제1 전자 장치이고, 도면부호920, 930, 940은 연주자가 보는 복수의 제2 전자 장치들이다. 복수의 제2 전자 장치들(920 내지 940)은 제2 전 자 장치 920, 제3 전자 장치 930, 제4 전자 장치 940를 포함할 수 있다. 제2 전자 장치 920는 악보의 바이올린 1을 연주하는 연주자의 전자 장치이고, 제3 전자 장치 930는 악보의 바이올린 2를 연주하는 연주자의 전자 장치 이며, 제4 전자 장치 940는 악보의 첼로를 연주하는 연주자의 전자 장치일 수 있다. 도 9b는 지휘자(제1 사용자)의 제1 전자 장치와 연주자(제2 사용자)의 제2 전자 장치로 서로 다른 내용을 표시 하는 일례를 도시한 도면이다. 도면부호 910a는 제1 전자 장치의 화면으로, 제1 전자 장치는 오케스트라 연주 (Mozart의 Eine Kleine Nachtmusik K. 525)와 관련하여 지휘자가 보는 총보를 표시할 수 있다. 또한, 도면부 호 920a는 제2 전자 장치의 화면으로, 제2 전자 장치는 연주자가 보는 악보를 표시할 수 있다. 예를 들어, 910a 에 도시한 총보에는 911에 도시한 바이올린 1, 912에 도시한 바이올린 2, 913에 도시한 첼로에 대한 악보가 모 두 포함될 수 있다. 그 중에서 바이올린 1에 해당하는 악보는 920a과 같이 바이올린 1을 연주하는 연주자의 제2 전자 장치 920a로 전송될 수 있다. 이하에서는 도 9c를 참고하여 도 9b와 같은 화면을 표시하기 위한 방법을 설명한다. 도 9c를 참고하면, 동작 901에서, 제1 전자 장치는 도 5a의 \"Composer 영웅 교향곡\"에 해당하는 콘텐츠를 선택 받을 수 있다. 동작 902에서, 제1 전자 장치는 복수의 제2 전자 장치들과 연결하고, 복수의 제2 전자 장치들로 부터 장치 타입을 수신할 수 있다. 연결 및 수신하는 방법은 도 4c와 같이 수행된다. 상기 장치 타입은 상기 제 2 전자 장치가 속하는 콘텐츠의 영역의 속성 또는 상기 제2 전자 장치가 수신하고자 하는 콘텐츠의 영역에 대한 것일 수 있다. 여기서는, 상기 콘텐츠가 오케스트라 악보이기 때문에, 상기 복수의 제2 전자 장치들의 장치 타 입은 악기에 대한 것일 수 있다. 여기서, 복수의 제2 전자 장치들은 제2 전자 장치, 제3 전자 장치, 제4 전자 장치를 포함할 수 있다. 동작 903에서, 제1 전자 장치는 상기 선택된 콘텐츠의 속성을 분석할 수 있다. 예를 들어, 제1 전자 장치는 상 기 오케스트라 악보책이 총 400 페이지로 구성되고, 1~100 페이지는 악기에 대한 악보를 모두 포함하는 총보이 고, 101~200 페이지는 바이올린 1에 해당하는 악보이고, 201~300 페이지는 바이올린 2에 해당하는 악보이고, 301~400 페이지는 첼로에 해당하는 악보인 것으로 분석할 수 있다. 동작 904에서, 제1 전자 장치는 상기 콘텐츠 의 속성 및 상기 장치 타입에 기초하여 상기 복수의 제2 전자 장치들에 상기 콘텐츠의 제2 영역을 매핑하여 상 기 매핑 테이블을 생성할 수 있다. 상기 제2 영역은 악기에 따라 제2 영역, 제3 영역, 제4 영역으로 구분할 수 있다. 제1 전자 장치는 제1 악기인 \"바이올린 1\"을 제2 영역으로, 제2 악기인 \"바이올린 2\"를 제3 영역으로, 제 3 악기인 \"첼로\"를 제4 영역으로 분류할 수 있다. 예를 들어, 1~10 페이지는 제1 영역이고, 101 페이지는 제2 영역이고, 201 페이지는 제3 영역이며, 301 페이지는 제4 영역일 수 있다. 11~20 페이지는 제1 영역이고, 102 페이지는 제2 영역이고, 202 페이지는 제3 영역이며, 302 페이지는 제4 영역일 수 있다. 제1 전자 장치는 제1 영역은 자기 자신에게 매핑하고, 제2 영역은 제2 전자 장치에 매핑하고, 제3 영역은 제3 전자 장치에 매핑하며, 제4 영역은 제4 전자 장치에 매핑하여 상기 매핑 테이블을 생성할 수 있다. 예를 들어, 표 4와 같이, 상기 매핑 테이블의 제1 영역은 총보에 관한 페이지 번호이고, 상기 제2 영역은 바이올린 1과 관련된 악보에 관한 페이지 번호이고, 제3 영역은 바이올린 2와 관련된 악보에 관한 페이지 번호이며, 제4 영역은 첼로와 관련된 악보에 관 한 페이지 번호일 수 있다. 동작 905a에서, 제1 전자 장치는 제2 전자 장치(예: 도 9a의 920)로 매핑 테이블을 전송하거나, 전송하지 않을 수도 있다. 동작905b에서, 제1 전자 장치는 제3 전자 장치(예: 도 9a의 930)로 매핑 테이블을 전송하거나, 전송 하지 않을 수도 있다. 동작 905c에서, 제1 전자 장치는 제4 전자 장치(예: 도 9a의 940)로 매핑 테이블을 전송 하거나, 전송하지 않을 수도 있다. 동작 906에서, 제1 전자 장치는 제2 영역의 콘텐츠 정보를 제2 전자 장치로 전송하고, 동작 907에서, 제1 전자 장치는 제3 영역의 콘텐츠 정보를 제3 전자 장치로 전송하며, 동작 908에서, 제1 전자 장치는 제4 영역의 콘텐 츠 정보를 제4 전자 장치로 전송할 수 있다. 동작 909에서, 제1 전자 장치는 상기 콘텐츠의 제1 영역을 재생할 수 있다. 제1 전자 장치는 동작 906 내지 908과 동작 909를 동시에 수행하거나, 동작 906 내지 908을 먼저 수행 하고, 동작 909를 수행하거나, 동작 909를 먼저 수행하고, 동작 906 내지 908을 수행할 수도 있다. 다양한 실시예들에 따르면, 제1 전자 장치는 사용자의 손이나 기타 수단(예: 전자펜) 등에 의해 페이지 넘김 입 력(예: 제스쳐)이 감지되면, 입력에 대응하는 악보를 표시할 수 있다. 이와 더불어, 제1 전자 장치는 제2 전자 장치 내지 제4 전자 장치로 상기 입력에 대응하는 악보를 표시하도록 하는 콘텐츠 정보를 전송할 수 있다. 또는, 상기 사용자가 손 또는 기타 수단으로부터 악보를 넘기지 않더라도, 제1 전자 장치는 마이크로부터 연주 되는 음을 분석하여, 주멜로디를 인지할 수 있다. 즉, 제1 전자 장치는 상기 분석된 음을 통해 상기 음과 관련된 악보의 마디를 확인함으로써, 하나의 악보의 페이지가 넘어가는 것으로 인지되면, 제2 전자 장치 내지 제4 전자 장치에도 넘어간 페이지와 연관된 페이지를 보여주도록 하는 명령을 전달할 수 있다. 이를 위해, 제1 전자 장치는 상기 마디와 관련된 콘텐츠 정보를 제2 전자 장치 내지 제4 전자 장치로 전송할 수 있다. 제2 전자 장치 내지 제4 전자 장치는 상기 마디와 관련된 정보를 이용하여 상기 마디와 관련된 악보를 표시할 수 있다. 도 10a 및 도 10b는 본 발명의 다양한 실시예에 따른 콘텐츠를 표시하는 동작을 도시한 도면이다. 도 10a는 제1 전자 장치(도 1의 전자 장치 101, 도 2의 전자 장치 200)의 표시부(도 1의 디스플레이 150 또는 도 2의 표시부 230)에서 콘텐츠의 제1 영역을 표시하는 중에, 상기 표시부에 표시되지 않는 상기 콘텐츠의 제2 영역을 제2 전자 장치(도 1의 전자 장치 104)에서 표시하기 위한 일례를 도시한 흐름도이다. 도 10a의 실시예는 도 3a의 실시예와 조금 다른 방식으로 전자 장치들 간에 연결이 수행될 수 있다. 예를 들어, 제1 전자 장치와 제2 전자 장치는 접촉되거나, 도 3a의 실시예보다 제1 전자 장치와 제2 전자 장치 간의 거리가 가까울 수 있다. 동작 1010에서, 상기 제1 전자 장치는 콘텐츠의 제1 영역을 표시할 수 있다. 예컨대, 상기 콘텐츠는 제1 영역 및 상기 제1 영역과 연관된 제2 영역으로 구성되고, 상기 표시부의 크기 한계로 인해 상기 제1 전자 장치는 상 기 제1 영역만 표시할 수 있다. 종래에는, 상기 제2 영역을 보기 위해서는 상기 제1 전자 장치의 제1 사용자는 스크롤을 상, 하, 좌, 우로 움직이는 입력을 하여, 상기 제2 영역이 상기 표시부에 표시되도록 하고 있다. 그 러나, 본 발명에서는 상기 제1 전자 장치와 연결된 제2 전자 장치를 통해 상기 제2 영역이 표시되도록 제어할 수 있다. 동작 1020에서, 상기 제1 전자 장치는 상기 제2 전자 장치와 일정 거리 이내에 위치할 수 있다. 상기 제1 전자 장치는 상기 제2 전자 장치와 연결된 상태일 수 있다. 상기 제1 전자 장치는 상기 제2 전자 장치와 연결함으로 써, 상기 제2 전자 장치와 데이터를 송, 수신이 가능하다. 상기 제1 전자 장치는 DLNA, Allshare, WIFI Direct 의 miracast 중 어느 하나의 방법으로 상기 제2 전자 장치와 통신할 수 있다. 또는, 상기 제1 전자 장치는 블루 투스, NFC 방식으로 상기 제2 전자 장치와 통신할 수 있다. 동작 1030에서, 상기 제1 전자 장치는 표시부에 표시되지 않은 상기 제2 영역의 콘텐츠 정보를 제2 전자 장치로 전송할 수 있다. 상기 표시되지 않은 상기 콘텐츠의 제2 영역을 상기 제2 전자 장치로 전송하기 위해, 상기 제1 전자 장치는 도 2 내지 도 3에서 설명한 바와 같이, 매핑 테이블을 생성할 수도 있다. 또는, 상기 제1 전자 장 치는 상기 매핑 테이블을 생성하지 않고, 표시되지 않은 제2 영역의 콘텐츠 정보를 상기 제2 전자 장치로 전송 할 수 있다. 예를 들어, 상기 제1 전자 장치는 상기 매핑 테이블을 상기 제2 전자 장치로 미리 전송한 경우, 상 기 제2 영역의 콘텐츠 정보로서 상기 제2 영역과 연관된 참조번호를 상기 제2 전자 장치로 전송할 수 있다. 또 는, 상기 제1 전자 장치는 상기 제2 영역의 콘텐츠 정보로서 상기 콘텐츠의 제2 영역 자체를 상기 제2 전자 장 치로 전송할 수도 있다. 상기 제2 전자 장치는 상기 제1 전자 장치가 상기 콘텐츠의 제1 영역을 표시하는 중에, 상기 콘텐츠의 제2 영역을 표시할 수 있다. 동작 1040에서, 상기 제1 전자 장치는 사용자 입력을 감지할 수 있다. 상기 사용자 입력이란 페이지를 넘기는 제스처, 예컨대, 스크롤, 플링 등의 입력일 수 있다. 또는, 상기 입력은 구부리거나, 회전하거나, 빨리 넘기거 나 하는 등의 입력일 수 있다. 동작 1050에서, 상기 제1 전자 장치는 상기 사용자 입력에 대응하여 상기 콘텐츠의 제3 영역을 표시하고, 표시 되지 않은 제4 영역의 콘텐츠 정보를 상기 제2 전자 장치로 전송할 수 있다. 예컨대, 상기 콘텐츠는 상기 제1 영역 및 상기 제2 영역 이외에 차례로 제3 영역 및 제4 영역을 더 포함할 수 있다. 종래에는, 상기 제3 영역을 보기 위해서는 상기 제1 전자 장치의 제1 사용자는 스크롤을 상, 하, 좌, 우로 움직이는 입력을 하여, 차례로 상기 제2 영역을 표시하고, 제3 영역을 상기 표시부에 표시되도록 하고 있다. 그러나, 본 발명에서는 상기 제1 전자 장치와 연결된 제2 전자 장치를 통해 상기 제2 영역이 표시되고 있으므로, 상기 제1 전자 장치는 상기 제1 영역을 표시하고, 곧바로 제3 영역을 표시할 수 있다. 상기 제1 전자 장치가 상기 콘텐츠의 제3 영역을 표시하 는 중에는, 상기 콘텐츠의 제4 영역이 상기 표시부에 표시되지 않는다. 상기 제1 전자 장치는 상기 표시되지 않 은 제4 영역의 콘텐츠 정보를 상기 제2 전자 장치로 전송함으로써, 상기 제2 전자 장치는 상기 콘텐츠의 제4 영 역을 표시할 수 있다. 이렇게, 상기 제2 전자 장치는 상기 제1 전자 장치의 변화를 감지하여, 현재 상기 제1 전자 장치에서 표시되지 않는 페이지를 표시할 수 있다. 도 10b는 두 전자 장치들이 일정거리 이내에 위치한 상황에서 서로 다른 2개의 상기 전자 장치들에서 표시되는 내용이 서로 동기화되어 표시되는 화면을 도시한 것이다. 2개의 전자 장치들은 마치 책을 보는 것과 같은 형태 로 이용할 수 있는 환경을 제공한다.제1 영역 a와 제2 영역 b로 구성된 콘텐츠를 표시할 때, 1060과 같은 하나의 제1 전자 장치(도 1의 전자 장치 101, 도 2의 전자 장치 200)는 표시부의 크기 한계로 인해 상기 제1 영역 a만 표시할 수 있다. 종래에는, 상기 제2 영역 b를 보기 위해서는 제1 전자 장치 1060의 제1 사용자는 스크롤을 아래로 움직이는 입력을 하여, 상기 제2 영역 b가 제1 전자 장치 1060의 제1 표시부에 표시되도록 하고 있다. 그런데, 본 발명에서는 제1 전자 장 치 1060과 연결된 도면부호 1070과 같은 제2 전자 장치를 통해 상기 제2 영역 b가 표시되도록 제어할 수 있다. 제2 전자 장치 1070은 제1 전자 장치 1060과 일정거리 이내에 위치하여 통신 연결된 것일 수 있다. 즉, 제1 전 자 장치 1060과 제2 전자 장치 1070이 나란히 도시한 오른쪽 도면에서, 제1 전자 장치 1060은 아래 방향으로 스 크롤이 입력되면, 제2 전자 장치 1070에서도 이를 인지하여 pair로 상기 콘텐츠의 더 아랫영역을 보여주면서 동 기화되도록 하는 것이다. 제1 전자 장치 1060은 제1 영역 a를 표시하는 중에, 아래방향으로 스크롤이 입력되면, 상기 제2 영역 b의 다음 페이지인 제3 영역(도시하지 않음)을 표시할 수 있다. 제2 전자 장치 1070 은 상기 제3 영역과 이어지고 제1 전자 장치 1060에는 표시되지 않은 제4 영역(도시하지 않음)을 표시할 수 있 다. 다양한 실시예들에 따른 전자 장치를 이용한 콘텐츠 제공 방법은 콘텐츠의 속성을 분석하여 상기 콘텐츠의 제1 영역과 상기 제1 영역과 연관된 상기 콘텐츠의 제2 영역을 매핑시키는 매핑 테이블을 생성하는 동작과, 상기 매 핑 테이블에 관련된 제2 영역의 콘텐츠 정보를 제2 전자 장치로 전송하고, 상기 콘텐츠의 제1 영역을 출력부에 출력하는 동작을 포함할 수 있다. 상기 생성하는 동작은, 상기 콘텐츠의 속성으로서 상기 콘텐츠에 포함된 데이터의 종류, 상기 콘텐츠의 페이지 번호, 상기 콘텐츠의 레이어 및 상기 콘텐츠의 마디수 중 적어도 하나를 분석하는 동작을 포함할 수 있다. 상기 생성하는 동작은, 상기 콘텐츠로부터 상기 콘텐츠의 속성을 획득하거나, 상기 콘텐츠를 분석하여 상기 콘 텐츠의 속성을 생성하거나, 및 사용자로부터 상기 콘텐츠의 속성을 설정받는 것 중 적어도 하나를 수행하는 동 작을 포함할 수 있다. 상기 생성하는 동작은, 상기 콘텐츠를 선택받는 동작과, 상기 제2 전자 장치와 연결되는지 여부를 검출하는 동 작과, 상기 선택된 콘텐츠의 속성에 기초하여 상기 연결된 제2 전자 장치에 상기 콘텐츠의 제1 영역 또는 상기 콘텐츠의 제2 영역을 매핑하여 상기 매핑 테이블을 생성하는 동작을 포함할 수 있다. 상기 생성하는 동작은, 상기 연결된 제2 전자 장치가 적어도 두 개 이상인 경우, 각 제2 전자 장치로부터 각 장 치 타입을 수신하는 동작과, 상기 콘텐츠의 속성 및 상기 각 장치 타입에 기초하여 각 제2 전자 장치에 상기 콘 텐츠의 제1 영역 또는 상기 콘텐츠의 제2 영역을 매핑하여 상기 매핑 테이블을 생성하는 동작을 포함할 수 있다. 상기 생성하는 동작은, 상기 콘텐츠가 악보와 관련된 경우, 상기 악보에 포함된 악기를 분석하는 동작과, 복수 의 제2 전자 장치로부터 각 장치 타입을 수신하는 동작과, 상기 각 장치 타입에 기초하여 각 제2 전자 장치와 상기 분석된 악보의 악기를 매핑하여 상기 매핑 테이블을 생성하는 동작을 포함할 수 있다. 상기 출력하는 동작은, 음을 분석하여 상기 음과 관련된 악보의 마디를 확인하는 동작과, 상기 마디와 관련된 콘텐츠 정보를 각 제2 전자 장치로 전송하고, 상기 마디와 관련된 악보를 표시부를 통해 표시하는 동작을 포함 할 수 있다. 상기 방법은 상기 매핑 테이블을 상기 제2 전자 장치로 전송하는 동작을 더 포함할 수 있다. 상기 출력하는 동작은, 표시부에 상기 콘텐츠의 제1 영역을 표시하고, 상기 제2 전자 장치가 일정거리 이내에 위치하는 경우, 상기 표시부에 표시되지 않는 제2 영역의 콘텐츠 정보를 상기 제2 전자 장치로 전송하는 동작을 포함할 수 있다. 상기 출력하는 동작은, 사용자의 입력을 감지하는 동작과, 상기 사용자의 입력에 대응하여 상기 표시부에 상기 콘텐츠의 제3 영역을 표시하고, 상기 표시부에 표시되지 않는 제4 영역의 콘텐츠 정보를 상기 제2 전자 장치로 전송하는 동작을 포함할 수 있다. 도 11은 다양한 다른 실시예에 따른 전자 장치의 블록도를 도시한다. 도 11를 참고하면, 전자 장치 1101는 도 1에 도시된 전자 장치 111 또는 도 2에 도시한 전자 장치 200의 전체 또는 일부를 구성할 수 있다. 상기 전자 장치 1101는 하나 이상의 어플리케이션 프로세서(AP: application processor) 1110, 통신 모듈 1120, SIM(subscriber identification module) 카드 1124, 메모리 1130, 센서 모 듈 1140, 입력 장치 1150, 디스플레이 1160, 인터페이스 1170, 오디오 모듈 1180, 카메라 모듈 1191, 전력관리모듈 1195, 배터리 1196, 인디케이터 1197 및 모터 1198 를 포함할 수 있다. 상기 AP 1110는 운영체제 또는 응용 프로그램을 구동하여 상기 AP 1110에 연결된 다수의 하드웨어 또는 소프트 웨어 구성요소들을 제어할 수 있고, 멀티미디어 데이터를 포함한 각종 데이터 처리 및 연산을 수행할 수 있다. 상기 AP 1110는, 예를 들면, SoC(system on chip) 로 구현될 수 있다. 한 실시예에 따르면, 상기 AP 1110는 GPU(graphic processing unit, 미도시)를 더 포함할 수 있다. 상기 통신 모듈 1120(예: 상기 통신 인터페이스 160)은 상기 전자 장치 1101(예: 상기 전자 장치 101)와 네트워 크를 통해 연결된 다른 전자 장치들(예: 전자 장치 104 또는 서버 106) 간의 통신에서 데이터 송수신을 수행할 수 있다. 한 실시예에 따르면, 상기 통신 모듈 1120은 셀룰러 모듈 1121, Wifi 모듈 1123, BT 모듈 1125, GPS 모듈 1127, NFC 모듈 1128 및 RF(radio frequency) 모듈 1129를 포함할 수 있다. 상기 셀룰러 모듈 1121은 통신망(예: LTE, LTE-A, CDMA, WCDMA, UMTS, WiBro 또는 GSM 등)을 통해서 음성 통화, 영상 통화, 문자 서비스 또는 인터넷 서비스 등을 제공할 수 있다. 또한, 상기 셀룰러 모듈 1121은, 예를 들면, 가입자 식별 모듈(예: SIM 카드 1124)을 이용하여 통신 네트워크 내에서 전자 장치의 구별 및 인증을 수 행할 수 있다. 한 실시예에 따르면, 상기 셀룰러 모듈 1121은 상기 AP 1110이 제공할 수 있는 기능 중 적어도 일부 기능을 수행할 수 있다. 예를 들면, 상기 셀룰러 모듈 1121은 멀티 미디어 제어 기능의 적어도 일부를 수 행할 수 있다. 한 실시예에 따르면, 상기 셀룰러 모듈 1121은 커뮤니케이션 프로세서(CP: communication processor)를 포함할 수 있다. 또한, 상기 셀룰러 모듈 1121은, 예를 들면, SoC로 구현될 수 있다. 도 11에서는 상기 셀룰러 모듈 1121(예: 커뮤니케이션 프로세서), 상기 메모리 1130 또는 상기 전력관리 모듈 1195 등의 구성요소들이 상기 AP 1110와 별개의 구성요소로 도시되어 있으나, 한 실시예에 따르면, 상기 AP 1110이 전술한 구성요소들의 적어도 일부(예: 셀룰러 모듈 1121)를 포함하도록 구현될 수 있다. 한 실시예에 따르면, 상기 AP 1110 또는 상기 셀룰러 모듈 1121(예: 커뮤니케이션 프로세서)은 각각에 연결된 비휘발성 메모리 또는 다른 구성요소 중 적어도 하나로부터 수신한 명령 또는 데이터를 휘발성 메모리에 로드 (load)하여 처리할 수 있다. 또한, 상기 AP 1110 또는 상기 셀룰러 모듈 1121은 다른 구성요소 중 적어도 하나 로부터 수신하거나 다른 구성요소 중 적어도 하나에 의해 생성된 데이터를 비휘발성 메모리에 저장(store)할 수 있다. 상기 Wifi 모듈 1123, 상기 BT 모듈 1125, 상기 GPS 모듈 1127 또는 상기 NFC 모듈 1128 각각은, 예를 들면, 해당하는 모듈을 통해서 송수신되는 데이터를 처리하기 위한 프로세서를 포함할 수 있다. 도 11에서는 셀룰러 모듈 1121, Wifi 모듈 1123, BT 모듈 1125, GPS 모듈 1127 또는 NFC 모듈 1128이 각각 별개의 블록으로 도시되 었으나, 한 실시예에 따르면, 셀룰러 모듈 1121, Wifi 모듈 1123, BT 모듈 1125, GPS 모듈 1127 또는 NFC 모듈 1128 중 적어도 일부(예: 두 개 이상)는 하나의 integrated chip(IC) 또는 IC 패키지 내에 포함될 수 있다. 예 를 들면, 셀룰러 모듈 1121, Wifi 모듈 1123, BT 모듈 1125, GPS 모듈 1127 또는 NFC 모듈 1128 각각에 대응하 는 프로세서들 중 적어도 일부(예: 셀룰러 모듈 1121에 대응하는 커뮤니케이션 프로세서 및 Wifi 모듈 1123에 대응하는 Wifi 프로세서)는 하나의 SoC로 구현될 수 있다. 상기 RF 모듈 1129는 데이터의 송수신, 예를 들면, RF 신호의 송수신을 할 수 있다. 상기 RF 모듈 1129는, 도 시되지는 않았으나, 예를 들면, 트랜시버(transceiver), PAM(power amp module), 주파수 필터(frequency filter) 또는 LNA(low noise amplifier) 등을 포함할 수 있다. 또한, 상기 RF 모듈 1129는 무선 통신에서 자 유 공간상의 전자파를 송수신하기 위한 부품, 예를 들면, 도체 또는 도선 등을 더 포함할 수 있다. 도 11에서는 셀룰러 모듈 1121, Wifi 모듈 1123, BT 모듈 1125, GPS 모듈 1127 및 NFC 모듈 1128이 하나의 RF 모듈 1129을 서로 공유하는 것으로 도시되어 있으나, 한 실시예에 따르면, 셀룰러 모듈 1121, Wifi 모듈 1123, BT 모듈 1125, GPS 모듈 1127 또는 NFC 모듈 1128 중 적어도 하나는 별개의 RF 모듈을 통하여 RF 신호의 송수신을 수행 할 수 있다. 상기 SIM 카드 1124는 가입자 식별 모듈을 포함하는 카드일 수 있으며, 전자 장치의 특정 위치에 형성된 슬롯에 삽입될 수 있다. 상기 SIM 카드 1124는 고유한 식별 정보(예: ICCID(integrated circuit card identifier)) 또는 가입자 정보(예: IMSI(international mobile subscriber identity))를 포함할 수 있다. 상기 메모리 1130(예: 상기 메모리 130)는 내장 메모리 1132 또는 외장 메모리 1134를 포함할 수 있다. 상기 내장 메모리 1132는, 예를 들면, 휘발성 메모리(예를 들면, DRAM(dynamic RAM), SRAM(static RAM), SDRAM(synchronous dynamic RAM) 등) 또는 비휘발성 메모리(non-volatile Memory, 예를 들면, OTPROM(one timeprogrammable ROM), PROM(programmable ROM), EPROM(erasable and programmable ROM), EEPROM(electrically erasable and programmable ROM), mask ROM, flash ROM, NAND flash memory, NOR flash memory 등) 중 적어도 하나를 포함할 수 있다. 한 실시예에 따르면, 상기 내장 메모리 1132는 Solid State Drive (SSD)일 수 있다. 상기 외장 메모리 1134는 flash drive, 예를 들면, CF(compact flash), SD(secure digital), Micro-SD(micro secure digital), Mini- SD(mini secure digital), xD(extreme digital) 또는 Memory Stick 등을 더 포함할 수 있다. 상기 외장 메모리 1134는 다양한 인터페이스를 통하여 상기 전자 장치 1101과 기능적으로 연결될 수 있다. 한 실시예에 따르면, 상기 전자 장치 1101는 하드 드라이브와 같은 저장 장치(또는 저장 매체)를 더 포함할 수 있다. 상기 센서 모듈 1140은 물리량을 계측하거나 전자 장치 1101의 작동 상태를 감지하여, 계측 또는 감지된 정보를 전기 신호로 변환할 수 있다. 상기 센서 모듈 1140은, 예를 들면, 제스처 센서 1140A, 자이로 센서 1140B, 기 압 센서 1140C, 마그네틱 센서 1140D, 가속도 센서 1140E, 그립 센서 1140F, 근접 센서 1140G, color 센서 1140H(예: RGB(red, green, blue) 센서), 생체 센서 1140I, 온/습도 센서 1140J, 조도 센서 1140K 또는 UV(ultra violet) 센서 1140M 중의 적어도 하나를 포함할 수 있다. 추가적으로 또는 대체적으로, 상기 센서 모 듈 1140은, 예를 들면, 후각 센서(E-nose sensor, 미도시), EMG 센서(electromyography sensor, 미도시), EEG 센서(electroencephalogram sensor, 미도시), ECG 센서(electrocardiogram sensor, 미도시), IR(infra red) 센 서(미도시), 홍채 센서(미도시) 또는 지문 센서(미도시) 등을 포함할 수 있다. 상기 센서 모듈 1140은 그 안에 속한 적어도 하나 이상의 센서들을 제어하기 위한 제어 회로를 더 포함할 수 있다. 상기 입력 장치 1150은 터치 패널(touch panel) 1152, (디지털) 펜 센서(pen sensor) 1154, 키(key) 1156 또는 초음파(ultrasonic) 입력 장치 1158를 포함할 수 있다. 상기 터치 패널 1152은, 예를 들면, 정전식, 감압식, 적외선 방식 또는 초음파 방식 중 적어도 하나의 방식으로 터치 입력을 인식할 수 있다. 또한, 상기 터치 패널 1152은 제어 회로를 더 포함할 수도 있다. 정전식의 경우, 물리적 접촉 또는 근접 인식이 가능하다. 상기 터 치 패널 1152은 택타일 레이어(tactile layer)를 더 포함할 수도 있다. 이 경우, 상기 터치 패널 1152은 사용 자에게 촉각 반응을 제공할 수 있다. 상기 (디지털) 펜 센서 1154는, 예를 들면, 사용자의 터치 입력을 받는 것과 동일 또는 유사한 방법 또는 별도 의 인식용 쉬트(sheet)를 이용하여 구현될 수 있다. 상기 키 1156는, 예를 들면, 물리적인 버튼, 광학식 키 또 는 키패드를 포함할 수 있다. 상기 초음파(ultrasonic) 입력 장치 1158는 초음파 신호를 발생하는 입력 도구를 통해, 전자 장치 1101에서 마이크(예: 마이크 1188)로 음파를 감지하여 데이터를 확인할 수 있는 장치로서, 무 선 인식이 가능하다. 한 실시예에 따르면, 상기 전자 장치 1101는 상기 통신 모듈 1120를 이용하여 이와 연결 된 외부 장치(예: 컴퓨터 또는 서버)로부터 사용자 입력을 수신할 수도 있다. 상기 디스플레이 1160(예: 상기 디스플레이 150)은 패널 1162, 홀로그램 장치 1164 또는 프로젝터 1166을 포함 할 수 있다. 상기 패널 1162은, 예를 들면, LCD(liquid-crystal display) 또는 AM-OLED(active-matrix organic light-emitting diode) 등일 수 있다. 상기 패널 1162은, 예를 들면, 유연하게(flexible), 투명하게 (transparent) 또는 착용할 수 있게(wearable) 구현될 수 있다. 상기 패널 1162은 상기 터치 패널 1152과 하 나의 모듈로 구성될 수도 있다. 상기 홀로그램 장치 1164은 빛의 간섭을 이용하여 입체 영상을 허공에 보여줄 수 있다. 상기 프로젝터 1166는 스크린에 빛을 투사하여 영상을 표시할 수 있다. 상기 스크린은, 예를 들면, 상기 전자 장치 1101의 내부 또는 외부에 위치할 수 있다. 한 실시예에 따르면, 상기 디스플레이 1160은 상기 패널 1162, 상기 홀로그램 장치 1164, 또는 프로젝터 1166를 제어하기 위한 제어 회로를 더 포함할 수 있다. 상기 인터페이스 1170는, 예를 들면, HDMI(high-definition multimedia interface) 1172, USB(universal serial bus) 1174, 광 인터페이스(optical interface) 1176 또는 D-sub(D-subminiature) 1178를 포함할 수 있 다. 상기 인터페이스 1170는, 예를 들면, 도 1에 도시된 통신 인터페이스 160에 포함될 수 있다. 추가적으로 또는 대체적으로, 상기 인터페이스 1170는, 예를 들면, MHL(mobile high-definition link) 인터페이스, SD(secure Digital) 카드/MMC(multi-media card) 인터페이스 또는 IrDA(infrared data association) 규격 인터 페이스를 포함할 수 있다. 상기 오디오 모듈 1180은 소리(sound)와 전기신호를 쌍방향으로 변환시킬 수 있다. 상기 오디오 모듈 1180의 적어도 일부 구성요소는, 예를 들면, 도 1 에 도시된 입출력 인터페이스 140에 포함될 수 있다. 상기 오디오 모듈 1180은, 예를 들면, 스피커 1182, 리시버 1184, 이어폰 1186 또는 마이크 1188 등을 통해 입력 또는 출력 되는 소리 정보를 처리할 수 있다. 상기 카메라 모듈 1191은 정지 영상 및 동영상을 촬영할 수 있는 장치로서, 한 실시예에 따르면, 하나 이상의 이미지 센서(예: 전면 센서 또는 후면 센서), 렌즈(미도시), ISP(image signal processor, 미도시) 또는 플래 쉬 (flash, 미도시)(예: LED 또는 xenon lamp)를 포함할 수 있다. 상기 전력 관리 모듈 1195은 상기 전자 장치 1101의 전력을 관리할 수 있다. 도시하지는 않았으나, 상기 전력 관리 모듈 1195은, 예를 들면, PMIC(power management integrated circuit), 충전 IC(charger integrated circuit) 또는 배터리 또는 연료 게이지(battery or fuel gauge)를 포함할 수 있다. 상기 PMIC는, 예를 들면, 집적회로 또는 SoC 반도체 내에 탑재될 수 있다. 충전 방식은 유선과 무선으로 구분 될 수 있다. 상기 충전 IC는 배터리를 충전시킬 수 있으며, 충전기로부터의 과전압 또는 과전류 유입을 방지할 수 있다. 한 실시예에 따르면, 상기 충전 IC는 유선 충전 방식 또는 무선 충전 방식 중 적어도 하나를 위한 충 전 IC를 포함할 수 있다. 무선 충전 방식으로는, 예를 들면, 자기공명 방식, 자기유도 방식 또는 전자기파 방 식 등이 있으며, 무선 충전을 위한 부가적인 회로, 예를 들면, 코일 루프, 공진 회로 또는 정류기 등의 회로가 추가될 수 있다. 상기 배터리 게이지는, 예를 들면, 상기 배터리 1196의 잔량, 충전 중 전압, 전류 또는 온도를 측정할 수 있다. 상기 배터리 1196는 전기를 저장 또는 생성할 수 있고, 그 저장 또는 생성된 전기를 이용하여 상기 전자 장치 1101에 전원을 공급할 수 있다. 상기 배터리 1196는, 예를 들면, 충전식 전지(rechargeable battery) 또는 태 양 전지(solar battery)를 포함할 수 있다. 상기 인디케이터 1197는 상기 전자 장치 1101 혹은 그 일부(예: 상기 AP 1110)의 특정 상태, 예를 들면, 부팅 상태, 메시지 상태 또는 충전 상태 등을 표시할 수 있다. 상기 모터 1198는 전기적 신호를 기계적 진동으로 변 환할 수 있다. 도시되지는 않았으나, 상기 전자 장치 1101는 모바일 TV 지원을 위한 처리 장치(예: GPU)를 포함 할 수 있다. 상기 모바일 TV지원을 위한 처리 장치는, 예를 들면, DMB(digital multimedia broadcasting), DVB(digital video broadcasting) 또는 미디어플로우(media flow) 등의 규격에 따른 미디어 데이터를 처리할 수 있다. 본 발명의 다양한 실시예에 따른 전자 장치의 전술한 구성요소들 각각은 하나 또는 그 이상의 부품(component) 으로 구성될 수 있으며, 해당 구성 요소의 명칭은 전자 장치의 종류에 따라서 달라질 수 있다. 본 발명의 다양 한 실시예에 따른 전자 장치는 전술한 구성요소 중 적어도 하나를 포함하여 구성될 수 있으며, 일부 구성요소가 생략되거나 또는 추가적인 다른 구성요소를 더 포함할 수 있다. 또한, 본 발명의 다양한 실시예에 따른 전자 장치의 구성 요소들 중 일부가 결합되어 하나의 개체(entity)로 구성됨으로써, 결합되기 이전의 해당 구성 요소 들의 기능을 동일하게 수행할 수 있다."}
{"patent_id": "10-2014-0083574", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "그리고 본 명세서와 도면에 개시된 실시 예들은 본 발명의 내용을 쉽게 설명하고, 이해를 돕기 위해 특정 예를 제시한 것일 뿐이며, 본 발명의 범위를 한정하고자 하는 것은 아니다. 따라서 본 발명의 범위는 여기에 개시된 실시 예들 이외에도 본 발명의 기술적 사상을 바탕으로 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위 에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2014-0083574", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 다양한 실시예에 따른 전자 장치를 포함하는 네트워크 환경을 도시한 도면이다. 도 2는 다양한 실시예에 따른 전자장치를 도시한 블록도이다. 도 3은 본 발명의 다양한 실시예에 따른 콘텐츠 제공 방법을 도시한 흐름도이다. 도 4a 내지 도 4c는 본 발명의 다양한 실시예에 따라 콘텐츠 제공 시스템을 도시한 도면이다. 도 5a는 본 발명의 다양한 실시예에 따른 다른 전자 장치와 연동하여 콘텐츠를 제공하는 화면의 일례를 도시한 도면이다. 도 5b는 본 발명의 다양한 실시예에 따른 종래기술과 본원발명의 차이점을 도시한 도면이다. 도 5c는 본 발명의 다양한 실시예에 따른 두 전자 장치 간의 콘텐츠 제공 방법을 도시한 흐름도이다. 도 6a 및 도 6b는 본 발명의 다양한 실시예에 따른 콘텐츠의 페이지별로 매핑하여 콘텐츠를 재생하는 동작을 도 시한 도면이다. 도 7a 및 도 7b는 본 발명의 다양한 실시예에 따른 콘텐츠의 레이어별로 매핑하여 콘텐츠를 재생하는 동작을 도 시한 도면이다. 도 8a 내지 도 8c는 본 발명의 다양한 실시예에 따른 복수의 제2 전자 장치들에 동일한 콘텐츠를 출력하는 동작 을 도시한 도면이다. 도 9a 내지 도 9c는 본 발명의 다양한 실시예에 따른 복수의 제2 전자 장치들로 서로 다른 콘텐츠를 출력하는 동작을 도시한 도면이다. 도 10a 및 도 10b는 본 발명의 다양한 실시예에 따른 콘텐츠를 표시하는 동작을 도시한 도면이다. 도 11은 본 발명의 다양한 실시예에 따른 전자 장치를 도시한 블록도이다."}
