{"patent_id": "10-2018-0144918", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0063337", "출원번호": "10-2018-0144918", "발명의 명칭": "인공신경망을 이용하여 사용자의 동작 의도를 학습하는 방법 및 장치", "출원인": "광운대학교 산학협력단", "발명자": "박철수"}}
{"patent_id": "10-2018-0144918", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "움직임 센서부로부터 사용자의 움직임을 측정한 신호에 대한 정보를 수신하는 단계;기 학습된 인공신경망을 이용하여 상기 사용자의 움직임을 측정한 신호에 대한 정보에 대응하는 사용자의 동작의도를 출력하는 단계; 뇌파 센서부로부터 상기 사용자에 대해 측정된 뇌파 신호에 대한 정보를 수신하는 단계; 및상기 뇌파 신호에 대한 정보에 대응하는 사용자의 동작 의도가 상기 출력된 사용자의 동작 의도와 일치하지 않는 경우, 상기 출력된 사용자의 동작 의도에 대한 레이블을 상기 뇌파 신호에 대한 정보에 대응하는 사용자의동작 의도로 수정하여 상기 기 학습된 인공신경망에 입력하는 단계를 포함하는, 인공신경망을 이용하여 사용자의 동작 의도를 학습하는 방법."}
{"patent_id": "10-2018-0144918", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,상기 출력된 사용자의 동작 의도의 레이블을 상기 뇌파 신호에 대한 정보에 대응하는 사용자의 동작 의도로 인식하도록 학습하는 단계를 더 포함하는, 인공신경망을 이용하여 사용자의 동작 의도를 학습하는 방법."}
{"patent_id": "10-2018-0144918", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항에 있어서,상기 뇌파 신호에 대한 정보에 대응하는 사용자의 동작 의도가 상기 출력된 사용자의 동작 의도와 일치하는지여부를 상기 뇌파 신호에 대한 정보, 상기 뇌파 신호에 대한 정보에 대응하는 사용자의 동작 의도, 상기 사용자의 움직임을 측정한 신호에 대한 정보에 대응하는 사용자의 동작 의도 및 상기 출력된 사용자의 동작 의도 간에미리 정의된 맵핑 관계에 기초하여 판단하는 단계를 더 포함하는, 인공신경망을 이용하여 사용자의 동작 의도를학습하는 방법."}
{"patent_id": "10-2018-0144918", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3항에 있어서,상기 미리 정의된 맵핑 관계는 다음 표에서의 각 행 별로 대응되는 관계를 포함하는, 인공신경망을 이용하여 사용자의 동작 의도를 학습하는 방법:공개특허 10-2020-0063337-3-."}
{"patent_id": "10-2018-0144918", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4항에 있어서,상기 제 1, 제 2 및 제 3 주파수는 서로 간에 배수 관계가 아닌 것을 특징으로 하는, 인공신경망을 이용하여 사용자의 동작 의도를 학습하는 방법."}
{"patent_id": "10-2018-0144918", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1항에 있어서,상기 측정된 뇌파 신호는 점멸 자극에 의해 유발된 신호에 해당하는, 인공신경망을 이용하여 사용자의 동작 의도를 학습하는 방법."}
{"patent_id": "10-2018-0144918", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1항에 있어서,상기 사용자의 동작 의도를 출력하는 단계는 상기 사용자의 움직임에 대해 측정된 신호가 미리 정의한 특징 값이상으로 판단되는 경우에 수행되는, 인공신경망을 이용하여 사용자의 동작 의도를 학습하는 방법."}
{"patent_id": "10-2018-0144918", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7항에 있어서,상기 미리 정의한 특징 값은 근전도 신호의 평균 신호 세기를 포함하는, 인공신경망을 이용하여 사용자의 동작의도를 학습하는 방법."}
{"patent_id": "10-2018-0144918", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1항에 있어서,상기 인공신경망은 심층신경망(Deep Neural Networks, DNN)을 포함하는, 인공신경망을 이용하여 사용자의 동작의도를 학습하는 방법."}
{"patent_id": "10-2018-0144918", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "공개특허 10-2020-0063337-4-제 1항에 있어서,상기 움직임 센서부 및 상기 뇌파 센서부는 상기 사용자가 휴대착용 가능한 것을 특징으로 하는, 인공신경망을이용하여 사용자의 동작 의도를 학습하는 방법."}
{"patent_id": "10-2018-0144918", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "움직임 센서부로부터 사용자의 움직임을 측정한 신호에 대한 정보를 수신하는 통신부; 및기 학습된 인공신경망을 이용하여 상기 사용자의 움직임을 측정한 신호에 대한 정보에 대응하는 사용자의 동작의도를 출력하는 프로세서를 포함하되,상기 통신부는 뇌파 센서부로부터 상기 사용자에 대해 측정된 뇌파 신호에 대한 정보를 수신하고,상기 프로세서는 상기 뇌파 신호에 대한 정보에 대응하는 사용자의 동작 의도가 상기 출력된 사용자의 동작 의도와 일치하지 않는 경우, 상기 출력된 사용자의 동작 의도의 레이블을 상기 뇌파 신호에 대한 정보에 대응하는사용자의 동작 의도로 수정하여 상기 기 학습된 인공신경망에 입력하는, 인공신경망을 이용하여 사용자의 동작의도를 학습하는 장치."}
{"patent_id": "10-2018-0144918", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11항에 있어서,상기 프로세서는 상기 출력된 사용자의 동작 의도의 레이블을 상기 뇌파 신호에 대한 정보에 대응하는 사용자의동작 의도로 인식하도록 학습하는, 인공신경망을 이용하여 사용자의 동작 의도를 학습하는 장치."}
{"patent_id": "10-2018-0144918", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 11항에 있어서,상기 프로세서는 상기 뇌파 신호에 대한 정보에 대응하는 사용자의 동작 의도가 상기 출력된 사용자의 동작 의도와 일치하는지 여부를 상기 뇌파 신호에 대한 정보, 상기 뇌파 신호에 대한 정보에 대응하는 사용자의 동작의도 및 상기 사용자의 움직임을 측정한 신호에 대한 정보에 대응하는 사용자의 동작 의도 간에 미리 정의된 맵핑 관계에 기초하여 판단하는, 인공신경망을 이용하여 사용자의 동작 의도를 학습하는 장치."}
{"patent_id": "10-2018-0144918", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13항에 있어서,상기 미리 정의된 맵핑 관계는 다음 표에서의 각 행 별로 대응되는 관계를 포함하는, 인공신경망을 이용하여 사용자의 동작 의도를 학습하는 장치:공개특허 10-2020-0063337-5-."}
{"patent_id": "10-2018-0144918", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 14항에 있어서,상기 제 1, 제 2 및 제 3 주파수는 서로 간에 배수 관계가 아닌 것을 특징으로 하는, 인공신경망을 이용하여 사용자의 동작 의도를 학습하는 장치."}
{"patent_id": "10-2018-0144918", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 11항에 있어서,상기 측정된 뇌파 신호는 점멸 자극에 의해 유발된 신호에 해당하는, 인공신경망을 이용하여 사용자의 동작 의도를 학습하는 장치."}
{"patent_id": "10-2018-0144918", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 11항에 있어서,상기 프로세서는 상기 사용자의 움직임에 대해 측정된 신호가 미리 정의한 특징 값 이상으로 판단되는 경우에상기 사용자의 움직임에 대해 측정된 신호에 대응하는 사용자의 동작 의도를 출력하는, 인공신경망을 이용하여사용자의 동작 의도를 학습하는 장치."}
{"patent_id": "10-2018-0144918", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 17항에 있어서,상기 미리 정의한 특징 값은 근전도 신호의 평균 신호 세기를 포함하는, 인공신경망을 이용하여 사용자의 동작의도를 학습하는 장치."}
{"patent_id": "10-2018-0144918", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 11항에 있어서,상기 인공신경망은 심층신경망(Deep Neural Networks, DNN)을 포함하는, 인공신경망을 이용하여 사용자의 동작의도를 학습하는 장치.공개특허 10-2020-0063337-6-청구항 20 제 11항에 있어서,상기 움직임 센서부 및 상기 뇌파 센서부는 상기 사용자가 휴대착용 가능한 것을 특징으로 하는, 인공신경망을이용하여 사용자의 동작 의도를 학습하는 장치."}
{"patent_id": "10-2018-0144918", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제 11항에 있어서,상기 뇌파 센서부는 Electroencephalography (EEG) 센서를 포함하는, 인공신경망을 이용하여 사용자의 동작 의도를 학습하는 장치."}
{"patent_id": "10-2018-0144918", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제 11항에 있어서,상기 움직임 센서부는 근전도 센서부 또는 가속도 센서부를 포함하는, 인공신경망을 이용하여 사용자의 동작 의도를 학습하는 장치."}
{"patent_id": "10-2018-0144918", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제 22항에 있어서,상기 사용자의 움직임에 대해 측정된 신호는 상기 사용자의 근전도 신호 또는 가속도 신호를 포함하는, 인공신경망을 이용하여 사용자의 동작 의도를 학습하는 장치."}
{"patent_id": "10-2018-0144918", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제 1항 내지 제 10항 중 어느 한 항에 기재된 인공신경망을 이용하여 사용자의 동작 의도를 학습하는 방법을 컴퓨터에서 실행시키기 위한 프로그램을 기록한 컴퓨터로 읽을 수 있는 기록매체."}
{"patent_id": "10-2018-0144918", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "인공신경망을 이용하여 사용자의 동작 의도를 학습하는 방법은 움직임 센서부로부터 사용자의 움직임을 측정한 신호에 대한 정보를 수신하는 단계; 기 학습된 인공신경망을 이용하여 상기 사용자의 움직임을 측정한 신호에 대 한 정보에 대응하는 사용자의 동작 의도를 출력하는 단계; 뇌파 센서부로부터 상기 사용자에 대해 측정된 뇌파 신호에 대한 정보를 수신하는 단계; 및 상기 뇌파 신호에 대한 정보에 대응하는 사용자의 동작 의도가 상기 출력 된 사용자의 동작 의도와 일치하지 않는 경우, 상기 출력된 사용자의 동작 의도에 대한 레이블을 상기 뇌파 신호 에 대한 정보에 대응하는 사용자의 동작 의도로 수정하여 상기 기 학습된 인공신경망에 입력하는 단계를 포함할 수 있다."}
{"patent_id": "10-2018-0144918", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공신경망을 이용하여 사용자의 동작 의도를 학습하는 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2018-0144918", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공지능 사물(예를 들어, 자율주행 자동차) 시장이 성장함에 따라, 기존에 운전할 수 없었던 장애인이나 노인 들도 자동차를 이용할 수 있을 것으로 전망된다. 그러나, 이러한 장애인의 경우, 신체가 자유롭지 않아 자동차 내부기능을 조작하고 싶어도 마음대로 조작할 수 없다는 어려움이 있다. 장애인이나 노인의 경우 신체적 부자연 스러움으로 인해 따라 움직임에 따른 노이즈가 클 것으로 예상된다. 이런 노이즈로 인해 종래의 학습된 모델의 성능이 떨어질 것으로 예상된다. 본 발명에서는 신체가 자유롭지 않 은 사용자가 디바이스(예를 들어, 자동차) 내부기능을 마음대로 조작하여 사용하는데 어려움이 없도록 하기 위 해 학습된 모델의 성능을 지속적으로 시스템을 학습시켜주는 장치를 제안하고자 한다."}
{"patent_id": "10-2018-0144918", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명에서 이루고자 하는 기술적 과제는 인공신경망을 이용하여 사용자의 동작 의도를 학습하는 방법을 제공 하는 데 있다. 본 발명에서 이루고자 하는 다른 기술적 과제는 인공신경망을 이용하여 사용자의 동작 의도를 학습하는 장치를 제공하는 데 있다. 본 발명에서 이루고자 하는 또 다른 기술적 과제는 인공신경망을 이용하여 사용자의 동작 의도를 학습하는 방법 을 컴퓨터에서 실행시키기 위한 프로그램을 기록한 컴퓨터로 읽을 수 있는 기록매체를 제공하는 데 있다. 본 발명에서 이루고자 하는 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급하지 않은"}
{"patent_id": "10-2018-0144918", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "또 다른 기술적 과제들은 아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하 게 이해될 수 있을 것이다."}
{"patent_id": "10-2018-0144918", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기의 기술적 과제를 달성하기 위한, 인공신경망을 이용하여 사용자의 동작 의도를 학습하는 방법은 움직임 센 서부로부터 사용자의 움직임을 측정한 신호에 대한 정보를 수신하는 단계; 기 학습된 인공신경망을 이용하여 상 기 사용자의 움직임을 측정한 신호에 대한 정보에 대응하는 사용자의 동작 의도를 출력하는 단계; 뇌파 센서부 로부터 상기 사용자에 대해 측정된 뇌파 신호에 대한 정보를 수신하는 단계; 및 상기 뇌파 신호에 대한 정보에 대응하는 사용자의 동작 의도가 상기 출력된 사용자의 동작 의도와 일치하지 않는 경우, 상기 출력된 사용자의 동작 의도에 대한 레이블을 상기 뇌파 신호에 대한 정보에 대응하는 사용자의 동작 의도로 수정하여 상기 기 학 습된 인공신경망에 입력하는 단계를 포함할 수 있다. 상기 방법은, 상기 출력된 사용자의 동작 의도의 레이블을 상기 뇌파 신호에 대한 정보에 대응하는 사용자의 동 작 의도로 인식하도록 학습하는 단계를 더 포함할 수 있다. 상기 방법은, 상기 뇌파 신호에 대한 정보에 대응하는 사용자의 동작 의도가 상기 출력된 사용자의 동작 의도와 일치하는지 여부를 상기 뇌파 신호에 대한 정보, 상기 뇌파 신호에 대한 정보에 대응하는 사용자의 동작 의도, 상기 사용자의 움직임을 측정한 신호에 대한 정보에 대응하는 사용자의 동작 의도 및 상기 출력된 사용자의 동 작 의도 간에 미리 정의된 맵핑 관계에 기초하여 판단하는 단계를 더 포함할 수 있다. 미리 정의된 맵핑 관계는 다음 표에서의 각 행 별로 대응되는 관계를 포함할 수 있다."}
{"patent_id": "10-2018-0144918", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "여기서, 제 1, 제 2 및 제 3 주파수는 서로 간에 배수 관계가 아닌 특징으로 한다. 상기 측정된 뇌파 신호는 점 멸 자극에 의해 유발된 신호에 해당할 수 있다. 상기 사용자의 동작 의도를 출력하는 단계는 상기 사용자의 움직임에 대해 측정된 신호가 미리 정의한 특징 값 이상으로 판단되는 경우에 수행되고, 상기 미리 정의한 특징 값은 근전도 신호의 평균 신호 세기를 포함할 수 있다. 상기 인공신경망은 심층신경망(Deep Neural Networks, DNN)을 포함할 수 있다. 상기 움직임 센서부 및 상 기 뇌파 센서부는 상기 사용자가 휴대착용 가능한 것을 특징으로 할 수 있다. 상기의 다른 기술적 과제를 달성하기 위한, 인공신경망을 이용하여 사용자의 동작 의도를 학습하는 장치는 움직 임 센서부로부터 사용자의 움직임을 측정한 신호에 대한 정보를 수신하는 통신부; 및 기 학습된 인공신경망을이용하여 상기 사용자의 움직임을 측정한 신호에 대한 정보에 대응하는 사용자의 동작 의도를 출력하는 프로세 서를 포함하되, 상기 통신부는 뇌파 센서부로부터 상기 사용자에 대해 측정된 뇌파 신호에 대한 정보를 수신하 고, 상기 프로세서는 상기 뇌파 신호에 대한 정보에 대응하는 사용자의 동작 의도가 상기 출력된 사용자의 동작 의도와 일치하지 않는 경우, 상기 출력된 사용자의 동작 의도의 레이블을 상기 뇌파 신호에 대한 정보에 대응하 는 사용자의 동작 의도로 수정하여 상기 기 학습된 인공신경망에 입력한다. 상기 프로세서는 상기 출력된 사용자의 동작 의도의 레이블을 상기 뇌파 신호에 대한 정보에 대응하는 사용자의 동작 의도로 인식하도록 학습할 수 있다. 상기 프로세서는 상기 뇌파 신호에 대한 정보에 대응하는 사용자의 동작 의도가 상기 출력된 사용자의 동작 의 도와 일치하는지 여부를 상기 뇌파 신호에 대한 정보, 상기 뇌파 신호에 대한 정보에 대응하는 사용자의 동작 의도 및 상기 사용자의 움직임을 측정한 신호에 대한 정보에 대응하는 사용자의 동작 의도 간에 미리 정의된 맵 핑 관계에 기초하여 판단할 수 있다. 상기 측정된 뇌파 신호는 점멸 자극에 의해 유발된 신호에 해당할 수 있다. 상기 프로세서는 상기 사용자의 움 직임에 대해 측정된 신호가 미리 정의한 특징 값 이상으로 판단되는 경우에 상기 사용자의 움직임에 대해 측정 된 신호에 대응하는 사용자의 동작 의도를 출력한다. 상기 미리 정의한 특징 값은 근전도 신호의 평균 신호 세 기를 포함한다. 상기 인공신경망은 심층신경망(Deep Neural Networks, DNN)을 포함한다. 상기 움직임 센서부 및 상기 뇌파 센서부는 상기 사용자가 휴대착용 가능한 것을 특징으로 한다. 뇌파 센서부는 Electroencephalography (EEG) 센서를 포함한다. 상기 움직임 센서부는 근전도 센서부 또는 가속도 센서부를 포 함한다. 상기 사용자의 움직임에 대해 측정된 신호는 상기 사용자의 근전도 신호 또는 가속도 신호를 포함한다."}
{"patent_id": "10-2018-0144918", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 사용자의 동작 의도를 학습하는 방법은 사용자의 동작 의도 인식을 머신러닝 알고 리즘을 모델을 사용하여 디바이스를 조작할 때 발생하는 오류를 줄일 수 있다. 본 발명에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효과들은"}
{"patent_id": "10-2018-0144918", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2018-0144918", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명에 따른 바람직한 실시 형태를 첨부된 도면을 참조하여 상세하게 설명한다. 첨부된 도면과 함께 이하에 개시될 상세한 설명은 본 발명의 예시적인 실시형태를 설명하고자 하는 것이며, 본 발명이 실시될 수 있는 유일한 실시형태를 나타내고자 하는 것이 아니다. 이하의 상세한 설명은 본 발명의 완전한 이해를 제공하기 위해서 구체적 세부사항을 포함한다. 그러나, 당업자는 본 발명이 이러한 구체적 세부사항 없이도 실시될 수 있 음을 안다. 몇몇 경우, 본 발명의 개념이 모호해지는 것을 피하기 위하여 공지의 구조 및 장치는 생략되거나, 각 구조 및 장치의 핵심기능을 중심으로 한 블록도 형식으로 도시될 수 있다. 또한, 본 명세서 전체에서 동일한 구성요소에 대해서는 동일한 도면 부호를 사용하여 설명한다. 본 발명은 인공신경망을 이용하여 사용자의 동작 의도를 학습하는 방법과 이를 위한 학습 장치를 제안하고자 한 다. 학습 장치는 사용자가 착용하고 있는 뇌파 센서부 및 움직임 센서부(예를 들어, 근전도 센서부 혹은 가속도 센서부 등이 있고, 이하에서는 설명의 편의를 위해 근전도 센서부로 예시하여 설명한다)로부터의 각각 뇌파 신 호 및 근전도 신호를 수신하여 인공신경망을 이용하여 사용자의 동작 의도를 학습한다. 본 발명을 설명하기에 앞서 뇌파 센서부 및 움직임 센서부에 대해 간략히 설명한다. 뇌파 센서부(일 예로서 electroencephalography (EEG) 센서)는 신경계에서 뇌신경 사이에 신호가 전달될 때 생 기는 전기의 흐름을 측정한다. 뇌의 전기적 활동에 대한 신경생리학적 측정 방법에는 두피에 부착한 전극을 통 해 기록하는 방법이 있다. 도 1은 뇌파 센서 시스템의 일 예로서 10-20 EEG 시스템를 나타낸 도면이다. EEG를 측정하기 위해서는 두피 위의 전극 위치가 필요한데, 그 측정 방법을 위한 시스템으로 10-20 EEG 시스템 을 사용할 수 있다. 10-20 EEG 시스템은 도 1에 도시한 것과 같고 이름은 기술적(descriptive)으로 붙여진 것이다. \"10-20\"의 10과 20은 NASION(anterior)과 INION(posterior) 사이의 거리의 10%와 20%를 참고한 것이다. 도 1에서 표시한 채널 명칭에서 홀수는 항상 머리의 왼쪽 편의 전극위치를 말하며, 짝수는 머리의 오른쪽 편의 전극 위치를 말한다. \"z\"라는 글자는 NASION(Nz)와 INION(Iz)간의 중심 혹인 중앙선 사이의 어떤 점을 표시할 때 사용된다. F, C, P, O, T는 뇌 영역을 뜻하는 머리글자로서, F는 전두엽(Frontal), C는 중추신경(Central), P는 측두엽(Parietal), O는 후두엽(Occipital), T는 두정엽(Temporal)을 나타낸다. 도 1에서 NASION은 이마 아래, 코 위에 있는 작은 notch를 말하고, INION은 목 위, 후두부(occiput) 기저의 작 은 bump 혹은 융기를 말한다. 이 두 점의 거리는 줄자 등을 이용하여 측정할 수 있으며, 센티미터로 측정하는 것이 정확하고 전형적인 측정치는 36 센치미터이다. NASION에서 이 거리의 10% 위가 FP1과 FP2라고 불리는 두 개의 prefrontal lobe site 간의 중간점이다. 또한, NASION과 INION 간 거리의 20%를 더 간 곳이 Fz이다. Fz에서 NASION과 INION이 20%를 더 움직이면 NASION과 INION의 중간 지점인 Cz이다. 일 예로서, 뇌파는 진동하는 주파수의 범위에 따라 인위적으로 델타 (δ)파(0.2 ~ 3.99 Hz), 쎄타(θ)파(4 ~ 7.99 Hz), 알파(α) 파(8 ~ 12.99 Hz), 베타 β파(13 ~ 29.99 Hz), 감마 g파(30~50 Hz)로 구분한다. 델타파는 주로 정상인의 깊은 수면 시나 신생아의 경우 두드러지게 나타난다. 쎄타파는 정서 안정 또는 수면으로 이어지 는 과정에서 주로 나타나는 파이며 기억력, 창의력, 집중도 등의 다양한 상태와 관련되어 있다. 알파파는 긴장 이완과 같은 편안한 상태에서 주로 나타나며, 안정되고 편안한 상태일수록 진폭이 증가한다. 베타파는 주로 전 두부에서 많이 나타나며, 깨어 있을 때, 말할 때와 같이 모든 의식적인 활동을 할 때 나타난다. 특히 불안한 상 태나 긴장시, 복잡한 계산처리 시에 우세하게 나타난다. 감마파는 베타파보다 더 빠르게 진동하는 형태로 정서 적으로 더욱 초조한 상태이거나, 추리, 판단 등의 고도의 인지정보처리와 관련된다. 도 1에서는 본 발명에 따른 웨어러블 디바이스의 뇌파 센서가 측정하는 뇌파 측정 채널을 예시하고 있다. 뇌파 채널로서 Fp1, A1, A2, Cz 총 4개가 사용될 수 있고, 뇌파 센서 중 EEG1은 Fp1 채널에서 졸음과 집중도를 측정 하며, EEG 2는 Cz 채널 (EEG2) 에서 졸음을 측정한다. A1 채널은 REF (Reference)로 사용되며 A2 채널은 GND(Ground)로 사용된다. 다음은 뇌파 신호의 특징 값들이 될 수 있는 예시이다. 1. Mean: 뇌파 신호의 평균 신호 세기를 나타낸다. 2. Standard deviation: 뇌파 신호 세기의 표준 편차를 나타낸다. 3. Zero Crossing: 뇌파 신호를 2차 미분하였을 때 zero crossing의 개수를 나타낸다. 4. Kurtosis: 신호의 4차 모멘텀을 표준 편차의 제곱으로 정규화한 값으로, 신호 세기의 확률 분포의 peakedness를 판별하는 수치를 나타낸다. 5. Crest factor: 신호의 peak값의 비율. Kurtosis와 유사하며 신호의 Impluseness를 기술하는 특징값이다. 6. Power Spectrum Density: 뇌파 신호의 푸리에 변환을 통해 생성된 power spectrum density를 나타낸다. 7. Correlation: 뇌파 신호의 자기상관(auto-correlation)을 나타낸다. 8. Threshold Crossing: 1개의 Epoch에서 특정 임계(Threshold)를 넘는 필터링된 Raw Data의 개수를 나타낸다. 9. Skewness: 뇌파 신호의 3차 모멘텀으로서, 신호 세기의 분포가 bias된 정도를 나타낸다. 10. Entropy: 신호의 predictability를 측정한 것을 나타낸다. 11. Band Energy: 스트레스와 관련된 주파수 영역의 에너지를 나타낸다. 12. Spectral Flux: 신호의 시주파수 분석 시 파워 스펙트럼(power spectrum)의 시간에 따른 변화율을 의미 (PSD(t)/PSD(t-1)) 다음으로 근전도 센서부에 대해 설명한다. 근전도 센서부는 웨어러블 디바이스로서 사용자의 손목 혹은 팔 등에 착용 가능한 가능한 형태 일 수 있다. 근 전도 센서부는 각각 사용자의 생체 신호를 센싱하여 근전도 신호에 대한 데이터를 추출 혹은 획득할 수 있다. 근전도 센서부는 EMG(electromyography) 센서 등이 있을 수 있다. 이때, 바람직하게는 EMG의 경우 최소 초당 400Hz의 샘플링으로 값을 받아와 진행하도록 할 수 있다. 근전도 센서부는 산출한 혹은 추출한 근전도 신호에 대한 데이터 혹은 정보를 본 발명의 학습 장치로 전달할 수 있다. 이때, 근전도 센서부는 추출한 근전도 신호에 대한 데이터를 디지털 신호의 데이터로 변환하여 본 발명의 학습 장치로 전달할 수 있다. EMG 신호에서의 추출 값 혹은 특징 값 1. Mean: 근전도 신호의 평균 신호 세기를 나타낸다. 2. Standard deviation: 근전도 신호 세기의 표준 편차를 나타낸다. 3. Zero Crossing: 근전도 신호를 2차 미분하였을 때 zero crossing의 개수를 나타낸다. 4. Kurtosis: 신호의 4차 모멘텀을 표준 편차의 제곱으로 정규화한 값으로, 신호 세기의 확률 분포의 peakedness를 판별하는 수치를 나타낸다. 5. Crest factor: 신호의 peak값의 비율. Kurtosis와 유사하며 신호의 Impluseness를 기술하는 특징값이다. 6. Power Spectrum Density: 근전도 신호의 푸리에 변환을 통해 생성된 power spectrum density를 나타낸다. 7. Correlation: 근전도 신호의 자기상관(auto-correlation)을 나타낸다. 8. Threshold Crossing: 1개의 Epoch에서 특정 임계(Threshold)를 넘는 필터링된 Raw Data의 개수를 나타낸다. 9. Skewness: 근전도 신호의 3차 모멘텀으로서, 신호 세기의 분포가 bias된 정도를 나타낸다. 10. Entropy: 신호의 predictability를 측정한 것을 나타낸다. 11. Band Energy: 집중력과 관련된 주파수 영역의 에너지를 나타낸다. 12. Spectral Flux: 신호의 시주파수 분석 시 power spectrum의 시간에 따른 변화율을 의미(PSD(t)/PSD(t-1)) 이하, 본 발명에 따른 인공신경망을 이용하여 사용자의 동작 의도를 학습하는 방법에 대해 전제 사항에 해당하 는 딥러닝(Deep Learning), 인공신경망, 심층신경망 등에 대해 간략히 설명한다. 딥러닝이란 인간의 신경망(Neural Network) 이론을 이용한 인공신경망(Artificial Neural Network, ANN)의 일 종으로, 계층 구조(Layer Structure)로 구성하면서 입력층(Input layer)과 출력층(Output layer) 사이에 하나 이상의 숨겨진 층(Hidden layer)(이하, 중간층이라 지칭함)을 갖고 있는 심층 신경망(Deep Neural Network, DNN)을 지칭하는 기계학습(Machine Learning) 모델 또는 알고리즘의 집합입니다. 간단히 말하면, 딥러닝(Deep Learning)은 심층 계층을 가진 인공신경망이라 할 수 있다. 사람의 뇌는 250억 개의 신경세포로 구성되어 있다고 추정됩니다. 뇌는 신경세포로 이루어지며, 각각의 신경세 포(뉴런, Neuron)는 신경망을 구성하는 신경세포 1개를 지칭한다. 신경세포는 1개의 세포체(cell body)와 세포 체의 돌기인 1개의 축삭(Axon or nurite) 및 보통 여러 개의 수상돌기(dendrite or protoplasmic process)를 포함하고 있다. 이러한 신경세포들 간의 정보 교환은 시냅스라고 부르는 신경세포 간의 접합부를 통하여 전달됩 니다. 신경세포 하나만 떼어 놓고 보면 매우 단순하지만, 이러한 신경세포들이 모이면 인간의 지능을 지닐 수 있다. 수상돌기에서 다른 신경세포들이 보내는 신호를 전달받는 부분(Input)이고 축색돌기는 세포체로부터 아주 길게 뻗어가는 부분으로 다른 신경세포에 신호를 전달하는 부분(Output)이다. 신경세포들 사이의 신호를 전달해 주는 축색돌기와 수상돌기 간을 연결해주는 시냅스라는 연결부가 있는데, 신경세포의 신호를 무조건 전달하는 것이 아니라, 신호 강도가 일정한 값(임계치, Threshold) 이상이 되어야 신호를 전달하는 것이다. 즉, 각 시냅 스마다 연결강도가 다를 뿐만 아니라 신호를 전달할지 말지를 결정하게 되는 것이다. 인공지능의 한 분야인 인공신경망(ANN)은 생물학(통상 인간)의 뇌 구조(신경망)를 모방하여 모델링한 수학적 모 델이다. 즉, 인공신경망은 이러한 생물학적 신경세포의 정보처리 및 전달 과정을 모방하여 구현한 것이다. 인간 의 뇌가 문제를 해결하는 방식과 유사하게 구현한 것으로서 신경망은 각 신경세포가 독립적으로 동작하는 하기 때문에 병렬성이 뛰어나다. 또한, 많은 연결선에 정보가 분산되어 있어서 몇몇 신경세포에 문제가 발생해도 전 체에 큰 영향을 주지 않으므로 일정 수준의 오류에 강하고 주어진 환경에 대한 학습 능력을 갖고 있다. 심층신경망(Deep neural network)는 인공신경망의 후손이라 볼 수 있으며, 기존의 한계를 뛰어넘어서 과거에 수 많은 인공 지능 기술이 실패를 겪었던 영역에 성공 사례를 거두고 인공신경망의 최신 버전이다. 생물학적 신경 망을 모방하여 인공신경망을 모델링한 내용을 살펴보면 처리 단위(Processing unit) 측면에서는 생물적인 뉴런 (neurons)이 노드(nodes)로, 연결성(Connections)은 시냅스(Synapse)가 가중치(weights)로 다음 표 1과 같이 모델링 되었다. 표 1 생물학적 신경망 인공신경망 세포체 노드(node) 수상돌기 입력(input) 축삭(Axon) 출력(output) 시냅스 가중치(weight) 도 2는 인공신경망의 계층 구조(layer structure)를 예시한 도면이다. 인간의 생물학적 신경세포가 하나가 아닌 다수가 연결되어 의미 있는 작업을 하듯, 인공신경망의 경우도 개별 뉴런들을 서로 시냅스를 통해 서로 연결시켜서 복수개의 계층(layer)이 서로 연결되어 각 층간의 연결 강도는 가중치로 수정(update) 가능합니다. 이와 같이 다층 구조와 연결강도로 학습과 인지를 위한 분야에 활용됩니다. 각 노드들은 가중치가 있는 링크들로 연결되어 있고, 전체 모델은 가중치를 반복적으로 조정하면서 학습을 한다. 가중치는 장기 기억을 위한 기본 수단으로서 각 노드들의 중요도를 표현한다. 간단히 이야기하면, 인공신 경망은 이들 가중치를 초기하고 훈련시킬 데이터 세트로 가중치를 갱신하여 조정하여 전체 모델을 훈련시키는 것입니다. 훈련이 완료된 후에 새로운 입력값이 들어오면 적절한 출력값을 추론해 내게 된다. 인공신경망의 학 습원리는 경험의 일반화로부터 지능이 형성되는 과정이라고 보면 되고 bottom-up 방식으로 이루어지게 된다. 도 2에서 중간층이 2개 이상(즉 5~10개)일 경우를 층이 깊어진다고 보고 심층신경망(Deep Neural Netowkr)이라 하 며, 이러한 심층신경망을 통해서 이루어진 학습과 추론 모델을 딥러닝이라고 지칭할 수 있다. 인공신경망은 입력과 출력을 제외하고 하나의 중간계층(통상적으로 은닉계층, 'hidden layer'라 지칭함)을 가지 고 있어도 어느 정도의 역할을 수행할 수 있지만, 문제의 복잡도가 커지면 노드의 수 또는 계층의 수를 증가시 켜야 한다. 이 중에서 계층의 수를 증가시켜 다층구조 모델을 가져가는 것이 효과적인데, 효율적인 학습이 불가 능하고 네트워크를 학습하기 위한 계산량이 많다는 한계로 인해 활용 범위가 제한적이다. 그러나, 위와 같이 기존의 한계점이 극복됨으로써, 인공신경망은 깊은 구조(Deep Structure)를 가져갈 수 있게 되었습니다. 이로 인해 복잡하고 표현력 높은 모델을 구축할 수 있게 되어 음성인식, 얼굴인식, 물체인식, 문자 인식 등 다양한 분야에서 획기적인 결과들이 발표되고 있다. 심층 신경망(Deep Neural Network, DNN)은 입력층(input layer)과 출력층(output layer) 사이에 여러 개의 은 닉층(hidden layer)들로 이뤄진 인공신경망(Artificial Neural Network, ANN)이다. 심층 신경망은 일반적인 인 공신경망과 마찬가지로 복잡한 비선형 관계(non-linear relationship)들을 모델링할 수 있다. 예를 들어, 물체식별 모델을 위한 심층 신경망 구조에서는 각 물체가 영상의 기본적 요소들의 계층적 구성으로 표현될 수 있다. 이때, 추가 계층들은 점진적으로 모인 하위 계층들의 특징들을 규합시킬 수 있다. 심층 신경망의 이러한 특징은, 비슷하게 수행된 인공신경망에 비해 더 적은 수의 유닛(unit, node)들 만으로도 복잡한 데이터를 모델 링할 수 있게 해준다. 이전의 심층 신경망들은 보통 앞먹임 신경망으로 설계되어 왔지만, 최근의 연구들은 심층 학습 구조들을 순환 신경망(Recurrent Neural Network, RNN)에 성공적으로 적용했다. 일례로 언어 모델링(language modeling) 분야 에 심층 신경망 구조를 적용한 사례 등이 있다. 합성곱 신경망(Convolutional Neural Network, CNN)의 경우에 는 컴퓨터 비전(computer vision) 분야에서 잘 적용되었을 뿐만 아니라, 각각의 성공적인 적용 사례에 대한 문 서화 또한 잘 되어 있다. 더욱 최근에는 합성곱 신경망이 자동음성인식(Automatic Speech Recognition, ASR)을 위한 음향 모델링(acoustic modeling) 분야에 적용되었으며, 기존의 모델들 보다 더욱 성공적으로 적용되었다는 평가를 받고 있다. 심층 신경망은 표준 오류역전파 알고리즘으로 학습될 수 있다. 이때, 가중치(weight)들은 아 래의 등식을 이용한 확률적 경사 하강법(stochastic gradient descent)을 통하여 갱신될 수 있다. 도 3은 본 발명에 따른 인공신경망을 이용하여 사용자의 동작 의도를 학습하는 학습 장치의 블록도를 예시한 도 면이다. 도 3을 참조하면, 인공신경망을 이용하여 사용자의 동작 의도를 학습하는 학습 장치는 통신부 및 프 로세서를 포함할 수 있다. 사용자의 동작 의도를 학습하는 학습 장치 내에서 통신부 및 프로세 서는 전기적으로 연결되어 있다. 통신부는 움직임 센서부로부터 사용자의 움직임을 측정한 신호를 무선통신 등의 방식으로 수신한다. 프로 세서는 기 학습된 인공신경망을 이용하여 사용자의 움직임을 측정한 신호에 대응하는 사용자의 동작 의도 를 출력(혹은 추정, 결정)할 수 있다. 그리고, 통신부가 뇌파 센서부로부터 상기 사용자에 대해 측정된 뇌 파 신호에 대한 정보를 수신하면, 프로세서는 상기 뇌파 신호에 대한 정보에 대응하는 사용자의 동작 의도 가 상기 출력된 사용자의 동작 의도와 일치하지 않는지 여부를 판단한다. 만약 일치하는 않는 경우, 프로세서 는 출력된 사용자의 동작 의도의 레이블(혹은 정답)을 상기 뇌파 신호에 대한 정보에 대응하는 사용자의 동작 의도로 수정하여 기 학습된 인공신경망에 입력한다. 상기 프로세서는 기 학습된 인공신경망에서 출력된 사용자의 동작 의도의 레이블(혹은 정답)을 상기 뇌파 신호에 대한 정보에 대응하는 사용자의 동작 의도로 수정하여 인식하도록 학습한다. 프로세서는 상기 뇌파 신호에 대한 정보에 대응하는 사용자의 동작 의도가 상기 출력된 사용자의 동작 의도와 일치하는지 여부를 상기 뇌파 신호에 대한 정보, 상기 뇌파 신호에 대한 정보에 대응하는 사용자의 동작 의도, 상기 사용자의 움직임을 측정한 신호에 대한 정보에 대응하는 사용자의 동작 의도 및 상기 출력된 사용자의 동작 의도 간에 미리 정의된 맵핑 관계에 기초하여 판단할 수 있다. 여기서, 미리 정의된 맵핑 관계는 다음 표 2에서의 각 행 별로 대응되는 관계를 포함할 수 있다. 표 2 뇌파 센서부에서 수신된 뇌 파 신호의 주파수뇌파 신호로부터 추정된 사 용자의 동작 의도움직임 센서부(예를 들어, 근저도 센서부, 가속도 센 서부 등)로부터 수신한 상 기 사용자의 움직임을 측 정한 신호에 대한 정보기 학습된 인공신경망을 통해 출력된 사용자의 동 작 의도 제 1 주파수 A 동작을 의도 제 1 움직임 반응 A 동작을 의도 제 2 주파수 B 동작을 의도 제 2 움직임 반응 B 동작을 의도 제 3 주파수 C 동작을 의도 제 3 움직임 반응 C 동작을 의도 표 2를 참조하면, 미리 정의된 맵핑 관계 혹은 규칙은 뇌파 센서부에서 수신된 뇌파 신호의 주파수가 제 1 주파 수, 제 1 주파수에 대응되는 사용자의 동작 의도는 A 동작이고, 이 경우 움직임 센서부로부터 수신한 사용자의 움직임을 측정한 신호에 대한 정보는 제 1 움직임 반응이며, 제 1 움직임에 대응되는 사용자의 동작 의도도 A 동작이라는 것이다. 예를 들어, 표 2를 참조하여 설명하면, 프로세서는 기 학습된 인공신경망을 통해 사용 자의 동작 의도가 B 동작을 의도한 것으로 출력한다고 가정하자. 이 경우 프로세서가 통신부로부터 수신한 뇌파 신호의 주파수가 제 1 주파수라고 한다면, 제 1 주파수에 대응하는 사용자의 동작 의도는 A 동작이 므로 출력된 사용자의 동작 의도인 B 동작과 일치하지 않다고 판단할 수 있다. 그러면, 프로세서는 기 학 습된 인공신경망을 통해 출력된 사용자의 동작 의도에 오류가 있음을 파악하여, 사용자의 동작 의도의 레이블(혹은 정답)을 상기 뇌파 신호에 대한 정보에 대응하는 사용자의 동작 의도(B 동작)로 수정하여 기 학습된 인공 신경망에 입력한다. 이와 같이, 점멸 자극을 발생시켜 사용자가 자극을 바라봤을 때 사용자의 뇌에 생성되는 뇌 파를 모니터링하여 학습 시스템에 대한 답을 제공하고 학습 시스템은 이 답을 이용해 증분 학습하는 것을 제안 하고자 한다. 여기서, 상기 측정된 뇌파 신호는 점멸 자극에 의해 유발된 신호에 해당할 수 있다. 프로세서는 사용자의 움직임에 대해 측정된 신호가 미리 정의한 특징 값 이상으로 판단되는 경우에 사용자의 움직임에 대해 측정된 신호에 대응하는 사용자의 동작 의도를 결정할 수 있다. 인공신경망은 심층신경망(Deep Neural Networks, DNN) 을 포함할 수 있다. 그리고, 뇌파 센서부는 Electroencephalography (EEG) 센서를 포함할 수 있다. 움직임 센서 부는 근전도 센서부 또는 가속도 센서부를 포함할 수 있다. 사용자의 움직임에 대해 측정된 신호는 상기 사용자 의 근전도 신호 또는 가속도 신호를 포함할 수 있다. 이하에서는 설명의 편의를 위해 움직임 센서부를 근전도 센서부로 가정하여 설명할 것이다. 도 4는 본 발명에 따른 인공신경망을 이용하여 사용자의 동작 의도를 학습하는 방법을 간략히 설명한 흐름도이 다. 도 4를 참조하면, 인공신경망을 이용하여 사용자의 동작 의도를 학습하는 장치는 움직임 센서부로부터 사 용자의 움직임을 측정한 신호에 대한 정보를 수신한다. 인공신경망을 이용하여 사용자의 동작 의도를 학습하는 장치는 기 학습된 인공신경망을 이용하여 상기 사용자의 움직임을 측정한 신호에 대한 정보에 대응하는 사 용자의 동작 의도를 출력한다. 인공신경망을 이용하여 사용자의 동작 의도를 학습하는 장치는 뇌파 센서부 로부터 상기 사용자에 대해 측정된 뇌파 신호에 대한 정보를 수신한다. 그리고 인공신경망을 이용하여 사용자의 동작 의도를 학습하는 장치는 뇌파 신호에 대한 정보에 대응하는 사용자의 동작 의도가 상기 출력된 사용 자의 동작 의도와 일치하는지 여부를 판단한다. 일치하지 않는다고 판단되는 경우, 상기 출력된 사용자의 동작 의도에 대한 레이블을 상기 뇌파 신호에 대한 정 보에 대응하는 사용자의 동작 의도로 수정하여 상기 기 학습된 인공신경망에 입력할 수 있다. 그리고, 인공신경망을 이용하여 사용자의 동작 의도를 학습하는 장치는 상기 출력된 사용자의 동작 의도의 레이블을 상기 뇌파 신호에 대한 정보에 대응하는 사용자의 동작 의도로 인식하도록 학습할 수 있다. 인공신경 망을 이용하여 사용자의 동작 의도를 학습하는 장치는 상기 뇌파 신호에 대한 정보에 대응하는 사용자의 동작 의도가 상기 출력된 사용자의 동작 의도와 일치하는지 여부를 상기 뇌파 신호에 대한 정보, 상기 뇌파 신 호에 대한 정보에 대응하는 사용자의 동작 의도, 상기 사용자의 움직임을 측정한 신호에 대한 정보에 대응하는 사용자의 동작 의도 및 상기 출력된 사용자의 동작 의도 간에 미리 정의된 맵핑 관계에 기초하여 판단할 수 있 다. 여기서 미리 정의된 맵핑 관계는 상기 표 2와 같다. 상기 측정된 뇌파 신호는 점멸 자극에 의해 유발된 신호에 해당할 수 있다. 인공신경망을 이용하여 사용자의 동 작 의도를 학습하는 장치는 상기 사용자의 동작 의도를 출력하는 단계는 상기 사용자의 움직임에 대해 측 정된 신호가 미리 정의한 특징 값 이상으로 판단되는 경우에 수행한다. 상기 미리 정의한 특징 값은 근전도 신 호의 평균 신호 세기를 포함할 수 있다. 상기 움직임 센서부 및 상기 뇌파 센서부는 상기 사용자가 휴대착용 가 능한 것이다. 도 5는 본 발명에 따른 인공신경망을 이용하여 사용자의 동작 의도를 학습하는 장치를 포함하는 시스템을 예시한 도면이다. 도 5에 도시된 바와 같이, 사용자(예를 들어, 신체장애인 혹은 노인)가 운전하고 있는 상황이라고 가정한 다. 학습 장치는 EMG 센서로부터 근전도 반응에 대한 신호를 수신할 수 있다. 학습 장치는 기 학습된 인공신경망을 이용하여 근전도 분류 알고리즘에 기초하여 사용자의 동작 의도를 추정 혹은 출력한다. 이 때, 학습 장치는 사용자의 EEG 센서로부터 뇌파 신호에 대한 정보(사용자에 대해 측정된 뇌파 주파수 에 대한 정보 등)를 수신한다. 학습 장치는 출력된 사용자의 동작 의도와 상기 수신한 뇌파 주파수에 대한 정보에 대응하는 사용자의 동작 의도가 일치하는지 여부를 판단한다. 만약, 일치하지 않는 경우 학습 장치(30 0)는 수신한 데이터를 이용해 증분 학습을 수행한다. 즉, 학습 장치는 상기 출력된 사용자의 동작 의도에 대한 레이블을 상기 뇌파 신호에 대한 정보에 대응하는 사용자의 동작 의도로 수정하여 상기 기 학습된 인공신 경망에 입력하고, 상기 출력된 사용자의 동작 의도의 레이블을 상기 뇌파 신호에 대한 정보에 대응하는 사용자 의 동작 의도로 인식하도록 학습할 수 있다. EEG 센서는 사용자가 자동차 내에 구비된 복수의 점멸 자극을 위한 디스플레이(헤드업 디스플레 이)(530, 531, 532, 533) 중 어느 한 디스플레이를 시청함에 따라 사용자의 뇌에서 측정된 뇌파 주파수를 산출할 수 있다. 각 디스플레이는 자동차 내에서 서로 다른 위치에 구비되어 있으며 각 디스플레이에서 점멸되 는 신호의 주파수는 서로 배수 관계가 아니다. 그리고, 각 위치 별로 해당하는 디스플레이에 대응되는 사용자의 동작 의도가 다르게 매칭되어 있으며, 사용자는 이 매칭 관계를 인식하고 있다고 가정한다. 예를 들어, 사용자자 자동차 내부 기능 중에서 A 동작(예를 들어, 음악을 재생)을 의도하기 위해 팔을 위 로 움직였다고 가정하자. 사용자는 A 동작에 대응되는 해당 위치의 디스플레이에서의 점멸 자극을 쳐다본 다. 그러나, 학습 장치에서 사용자의 팔을 위로 움직인 근전도 반응에 대한 정보를 입력받아 기 학습 된 인공신경망(혹은 근전도 분류 알고리즘)을 이용하여 출력한 사용자의 동작 의도가 A 동작(예를 들어, 음악을 재생)이 아니라 다른 동작인 B 동작 (에어컨을 ON)이면, 학습 장치는 이는 사용자의 움직임에 대한 노이즈 등에 따른 잘못된 결과가 나온 것으로 처리한다. 학습 장치는 수신한 뇌파 주파수에 대한 정보에 기초하여 사용자의 진정한 동작 의도인 A 동작(예를 들어, 음악을 재생)을 기 학습된 인공 신경망에 입력하여 증분 학습한다. 도 6은 사용자가 15Hz의 자극 영상을 시청하는 경우에 EEG 센서에서 검출되는 뇌파에 대한 그래프를 나타낸 것이다. 사용자가 15Hz의 자극 영상을 시청하는 경우 자극 영상의 주파수의 비례하는 주파수가 뇌에 관측된다. 예 를 들어, EEG 센서는 15Hz의 배수인 15Hz, 30Hz, 45Hz의 뇌파를 도 6에서와 같이 검출할 수 있다. 사용자 가 15Hz의 자극 영상을 시청하는 경우 자극 영상의 주파수의 비례하는 주파수가 뇌에 관측되기 때문에, 자 동차 내에 구비된 복수의 점멸 자극을 위한 디스플레이(헤드업 디스플레이)(530, 531, 532, 533) 각각에서의 점 멸 신호의 주파수는 서로 배수 관계가 아니어야 한다. 예를 들어, 디스플레이(헤드업 디스플레이)(530, 531, 532, 533) 각각에서의 점멸 신호의 주파수는 각각 15Hz, 17Hz, 18Hz, 19Hz 일 수 있다. 도 7은 본 발명에 따른 인공신경망을 이용하여 사용자의 동작 의도를 학습하는 방법을 구체적으로 예시한 흐름 도이다. 도 7을 참조하면, 사용자(예를 들어, 지체 장애인)는 뇌파 측정을 위한 뇌파 측정 밴드(혹은 뇌파 센서부) 및 근전도 측정을 위한 근전도 센서부를 착용한 채 운전하고 있는 상황이라고 가정한다. 사용자가 착용한 뇌파 센서부와 근전도 센서부는 모니터링을 수행하고, 특징 값을 추출하여 특징 값이 소정의 임계값을 넘는지 여부를 판단한다. 근전도 센서부는 추출된 근전도 반응에 대한 특징 값이 소정의 임계값을 넘는다고 판단하면 학습 장 치의 통신부으로 무선 방식 등으로 송신한다. 여기서 특징 값은 근전도 신호의 평균 세기일 수도 있 다. 학습 장치의 프로세서는 근전도 센서부로부터 수신한 근전도에 대한 정보를 기 학습된 인공신경망의 근전도 분류 알고리즘을 이용하여 사용자의 동작 의도를 출력 혹은 추정한다. 그리고, 학습 장치의 통신부는 뇌파 센서부로부터 동작 확인을 위한 SSVEP 자극 생성에 대해 측정된 뇌파 신호에 대한 정보를 수신한다. 이때, 학습 장치의 프로세서는 뇌파 분류 알고리즘 혹은 기 설정 된 규칙에 의해 수신된 뇌파 신호에 대한 정보에 대응하는 사용자의 동작 의도를 파악할 수 있다. 학습 장치 의 프로세서는 근전도 알고리즘 분류기에 의해 출력된 사용자의 동작 의도와 뇌파 분류 알고리즘 (혹 은 기설정된 규칙)에 의해 파악된 사용자의 동작 의도가 일치하는지 여부를 판단한다. 일치하지 않으면, 학습 장치의 프로세서는 해당 근전도 반응에 대한 정보의 레이블을 수정한다. 수정 한 후, 학습 장치의 프로세서는 뇌파 알고리즘 기기 제어를 수행하고, 관찰된 근전도와 SSVEP 반응 뇌파를 증분 학습을 위한 데이터 세트에 저장하여 기학습된 인공신경망을 학습한다. 이상에서 설명한 바와 같이, 사용자의 의도 인식을 머신러닝 알고리즘을 모델을 사용하여 디바이스를 조작할 때 발생하는 오류를 줄이기 위한 학습하는 방법과 이를 위한 학습 장치를 제안하였다. 이상에서 설명된 실시예들은 본 발명의 구성요소들과 특징들이 소정 형태로 결합된 것들이다. 각 구성요소 또는 특징은 별도의 명시적 언급이 없는 한 선택적인 것으로 고려되어야 한다. 각 구성요소 또는 특징은 다른 구성요 소나 특징과 결합되지 않은 형태로 실시될 수 있다. 또한, 일부 구성요소들 및/또는 특징들을 결합하여 본 발명 의 실시예를 구성하는 것도 가능하다. 본 발명의 실시예들에서 설명되는 동작들의 순서는 변경될 수 있다. 어느 실시예의 일부 구성이나 특징은 다른 실시예에 포함될 수 있고, 또는 다른 실시예의 대응하는 구성 또는 특징과 교체될 수 있다. 특허청구범위에서 명시적인 인용 관계가 있지 않은 청구항들을 결합하여 실시예를 구성하거나출원 후의 보정에 의해 새로운 청구항으로 포함시킬 수 있음은 자명하다. 본 발명은 본 발명의 필수적 특징을 벗어나지 않는 범위에서 다른 특정한 형태로 구체화될 수 있음은 당업자에 게 자명하다. 따라서, 상기의 상세한 설명은 모든 면에서 제한적으로 해석되어서는 아니되고 예시적인 것으로 고려되어야 한다. 본 발명의 범위는 첨부된 청구항의 합리적 해석에 의해 결정되어야 하고, 본 발명의 등가적 범위 내에서의 모든 변경은 본 발명의 범위에 포함된다."}
{"patent_id": "10-2018-0144918", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 발명에 관한 이해를 돕기 위해 상세한 설명의 일부로 포함되는, 첨부 도면은 본 발명에 대한 실시예를 제공 하고, 상세한 설명과 함께 본 발명의 기술적 사상을 설명한다. 도 1은 뇌파 센서 시스템의 일 예로서 10-20 EEG 시스템를 나타낸 도면이다. 도 2는 인공신경망의 계층 구조(layer structure)를 예시한 도면이다. 도 3은 본 발명에 따른 인공신경망을 이용하여 사용자의 동작 의도를 학습하는 학습 장치의 블록도를 예시한 도 면이다. 도 4는 본 발명에 따른 인공신경망을 이용하여 사용자의 동작 의도를 학습하는 방법을 간략히 설명한 흐름도이 다. 도 5는 본 발명에 따른 인공신경망을 이용하여 사용자의 동작 의도를 학습하는 장치를 포함하는 시스템을 예시한 도면이다. 도 6은 사용자가 15Hz의 자극 영상을 시청하는 경우에 EEG 센서에서 검출되는 뇌파에 대한 그래프를 나타낸 것이다. 도 7은 본 발명에 따른 인공신경망을 이용하여 사용자의 동작 의도를 학습하는 방법을 구체적으로 예시한 흐름 도이다."}
