{"patent_id": "10-2020-0015417", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0017446", "출원번호": "10-2020-0015417", "발명의 명칭": "휴대용 전자 장치", "출원인": "삼성전자주식회사", "발명자": "최종민"}}
{"patent_id": "10-2020-0015417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "휴대용 전자 장치에 있어서, 측벽을 관통하게 형성된 제1 오프닝과, 상기 제1 오프닝에 인접하게 배치되며 상기 측벽을 관통하게 형성된 제2오프닝을 포함하는 하우징;상기 제1 오프닝을 통해 상기 하우징에 착탈 가능하게 결합하는 트레이 구조로서, 상기 제2 오프닝에 상응하게정렬되도록 형성된 트레이 홀을 포함하는 상기 트레이 구조; 및적어도 부분적으로 상기 제2 오프닝의 내부로 배치된 밀봉 부재를 포함하고,상기 밀봉 부재는, 적어도 부분적으로 상기 제2 오프닝에 삽입되는 연장부(extending portion)로서, 제1 단부와, 상기 제1단부에 대향하는(opposite to) 제2 단부를 포함하는 상기 연장부; 상기 제2 단부에 형성되어 상기 제2 오프닝을 통해 상기 연장부가 상기 하우징으로부터 이탈하는 것을방지하며, 상기 연장부보다 더 큰 직경을 가지는 걸림턱(stopping portion); 및 상기 제1 단부와 상기 제2 단부 사이에서 상기 연장부의 외측면(outer surface)에 배치되며 상기 제2오프닝을 밀봉하는 적어도 하나의 제1 밀봉부를 포함하는 휴대용 전자 장치."}
{"patent_id": "10-2020-0015417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서, 상기 밀봉 부재는 상기 연장부에 형성된 적어도 하나의 홈을 더 포함하고, 상기 적어도 하나의 제1 밀봉부가 부분적으로 상기 적어도 하나의 홈 내에 배치된 휴대용 전자 장치."}
{"patent_id": "10-2020-0015417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서, 상기 적어도 하나의 제1 밀봉부는, 상기 적어도 하나의 홈 내에 배치된 제1 구조물; 및상기 제1 구조물의 외측면에서 돌출되어 상기 제2 오프닝의 내측면에 접촉하는 제2 구조물을 포함하는 휴대용전자 장치."}
{"patent_id": "10-2020-0015417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3 항에 있어서, 상기 제1 구조물의 외측면이 상기 연장부의 외측면과 일치되는(flush with) 휴대용 전자장치."}
{"patent_id": "10-2020-0015417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2 항에 있어서, 상기 적어도 하나의 홈은 상기 연장부의 원주 방향을 따라 연장된 휴대용 전자 장치."}
{"patent_id": "10-2020-0015417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2020-0017446-3-제2 항에 있어서, 상기 적어도 하나의 제1 밀봉부의 다른 일부가 상기 제2 오프닝의 내측면에 접촉하는 휴대용전자 장치."}
{"patent_id": "10-2020-0015417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1 항에 있어서, 상기 적어도 하나의 제1 밀봉부는 링 형상으로 형성된 휴대용 전자 장치."}
{"patent_id": "10-2020-0015417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1 항에 있어서, 상기 제1 오프닝에 대응하도록 상기 하우징 내부에 배치되어, 상기 제1 오프닝을 통해 상기 하우징으로 삽입된상기 트레이 구조의 일부를 수용하는 소켓; 및상기 소켓에 인접하면서 상기 제2 오프닝에 대응하도록 상기 하우징 내부에 배치된 릴리즈(release)를 더 포함하고, 상기 걸림턱은 상기 측벽의 내측면과 상기 릴리즈 사이에 배치된 휴대용 전자 장치."}
{"patent_id": "10-2020-0015417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8 항에 있어서, 상기 밀봉 부재는 상기 트레이 홀을 통해 상기 제1 단부로 가해지는 외부의 힘에 의해 상기릴리즈를 가압하도록 설정된(configured to press the release in response to an external force) 휴대용 전자 장치."}
{"patent_id": "10-2020-0015417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8 항에 있어서, 상기 릴리즈는 상기 밀봉 부재의 이동에 따라 상기 소켓에 수용된 상기 트레이 구조를 배출하도록 설정된(configured to release) 휴대용 전자 장치."}
{"patent_id": "10-2020-0015417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10 항에 있어서, 상기 제2 오프닝은 적어도, 상기 소켓에 수용된 상기 트레이 구조를 배출하기 위해 상기 밀봉 부재가 이동하는 거리에 상응하는 길이를 가지는 휴대용 전자 장치."}
{"patent_id": "10-2020-0015417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제8 항에 있어서, 상기 밀봉 부재는, 상기 측벽의 내측면과 상기 릴리즈 사이의 거리보다 더 큰 길이를 가지게형성된 휴대용 전자 장치."}
{"patent_id": "10-2020-0015417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제1 항에 있어서, 상기 트레이 구조는, 적어도 하나의 저장 매체를 수용하며, 상기 제1 오프닝을 통해 상기 하우징의 내부로 삽입되는 수용부;상기 수용부와 상기 트레이 구조의 한 단부 사이에서 연장되며, 적어도 부분적으로 상기 제1 오프닝에 수용되는연장 구조물; 및공개특허 10-2020-0017446-4-상기 연장 구조물의 외측면에 배치되어 상기 제1 오프닝을 밀봉하는 적어도 하나의 제2 밀봉부를 포함하는 휴대용 전자 장치."}
{"patent_id": "10-2020-0015417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13 항에 있어서, 상기 트레이 구조는 상기 한 단부에 배치된 전면 커버부를 더 포함하고, 상기 트레이 홀이 상기 전면 커버부에 형성된 휴대용 전자 장치."}
{"patent_id": "10-2020-0015417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제13 항에 있어서, 상기 적어도 하나의 제2 밀봉부의 일부가 상기 제1 오프닝의 내측면에 접촉하는 휴대용 전자장치."}
{"patent_id": "10-2020-0015417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제1 항에 있어서, 상기 제2 오프닝은 상기 제1 오프닝보다 작게 형성된 휴대용 전자 장치."}
{"patent_id": "10-2020-0015417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제1 항에 있어서, 상기 밀봉 부재는 상기 제2 오프닝의 길이 방향을 따라 이동하는 휴대용 전자 장치."}
{"patent_id": "10-2020-0015417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제1 항에 있어서, 상기 걸림턱은 상기 측벽의 내측면에 간섭되어 상기 연장부가 상기 제2 오프닝을 통해 상기하우징으로부터 이탈하는 것을 방지하는 휴대용 전자 장치."}
{"patent_id": "10-2020-0015417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제1 항에 있어서, 상기 트레이 구조는 일단에 배치된 전면 커버부를 더 포함하고,상기 트레이 홀이 상기 전면 커버부에 형성되며,상기 측벽은 홈부(recessed portion)를 포함함으로써, 상기 트레이 구조가 상기 하우징으로 삽입된 상태에서 상기 홈부에 상기 전면 커버부를 수용하며, 상기 제1 오프닝과 상기 제2 오프닝이 상기 홈부 내에 배치된 휴대용 전자 장치."}
{"patent_id": "10-2020-0015417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19 항에 있어서, 상기 전면 커버부는, 그 둘레(side periphery)의 크기(outer dimension)가 상기 제1 오프닝보다 크게 형성되고, 상기 트레이 구조가 상기 하우징으로 삽입된 상태에서 상기 전면 커버부가 상기 홈부 내에 배치되는 휴대용 전자 장치."}
{"patent_id": "10-2020-0015417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제20 항에 있어서, 상기 트레이 구조가 상기 하우징으로 삽입된 상태에서, 상기 전면 커버부의 외측면이 상기공개특허 10-2020-0017446-5-측벽의 외측면과 일치되는(flush with) 휴대용 전자 장치."}
{"patent_id": "10-2020-0015417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "휴대용 전자 장치에 있어서, 측벽과, 상기 측벽을 관통하게 형성된 제1 오프닝과, 상기 측벽을 관통하게 형성되며 상기 제1 오프닝에 인접하게 배치된 제2 오프닝을 포함하는 하우징;상기 제1 오프닝을 통해 상기 하우징의 착탈 가능하게 결합하는 트레이 구조; 및적어도 부분적으로 상기 제2 오프닝 내에 배치된 제1 밀봉 부재를 포함하고, 상기 제1 밀봉 부재는, 적어도 부분적으로 상기 제2 오프닝에 삽입되는 연장부(extending portion)로서, 제1 단부와, 상기 제1단부에 대향하는(opposite to) 제2 단부를 포함하는 상기 연장부; 상기 제2 단부에 형성되어 상기 제2 오프닝을 통해 상기 연장부가 상기 하우징으로부터 이탈하는 것을방지하며, 상기 연장부보다 더 큰 직경을 가지는 걸림턱(stopping portion); 및 상기 제1 단부와 상기 제2 단부 사이에서 상기 연장부의 외측면(outer surface)에 배치되며 상기 제2오프닝을 밀봉하는 적어도 하나의 밀봉부를 포함하는 휴대용 전자 장치."}
{"patent_id": "10-2020-0015417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제22 항에 있어서, 상기 제1 밀봉 부재는 상기 연장부에 형성된 적어도 하나의 홈을 더 포함하고, 상기 제1 밀봉 부재의 일부가 상기 적어도 하나의 홈에 배치된 휴대용 전자 장치."}
{"patent_id": "10-2020-0015417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제23 항에 있어서, 상기 적어도 하나의 밀봉부는, 상기 적어도 하나의 홈 내에 배치된 제1 구조물; 및상기 제1 구조물의 외측면에서 돌출되어 상기 제2 오프닝의 내측면과 접촉하는 제2 구조물을 포함하는 휴대용전자 장치."}
{"patent_id": "10-2020-0015417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제24 항에 있어서, 상기 제1 구조물의 외측면이 상기 연장부의 외측면과 일치되는 휴대용 전자 장치."}
{"patent_id": "10-2020-0015417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "제23 항에 있어서, 상기 적어도 하나의 홈은 상기 연장부의 원주 방향을 따라 연장된 휴대용 전자 장치."}
{"patent_id": "10-2020-0015417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "제23 항에 있어서, 상기 적어도 하나의 밀봉부의 다른 일부가 상기 제2 오프닝의 내측면에 접촉하는 휴대용 전자 장치.공개특허 10-2020-0017446-6-청구항 28 제22 항에 있어서, 상기 적어도 하나의 밀봉부는 링 형상으로 형성된 휴대용 전자 장치."}
{"patent_id": "10-2020-0015417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "제22 항에 있어서, 상기 제1 오프닝에 대응하도록 상기 하우징 내부에 배치되어, 상기 제1 오프닝을 통해 상기 하우징으로 삽입된상기 트레이 구조의 일부를 수용하는 소켓; 및상기 소켓에 인접하면서 상기 제2 오프닝에 대응하도록 상기 하우징 내부에 배치된 릴리즈(release)를 더 포함하고, 상기 걸림턱은 상기 측벽의 내측면과 상기 릴리즈 사이에 배치된 휴대용 전자 장치."}
{"patent_id": "10-2020-0015417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_30", "content": "제29 항에 있어서, 상기 제1 밀봉 부재는 상기 제1 단부로 가해지는 외부의 힘에 의해 상기 릴리즈를 가압하도록 설정된 휴대용 전자 장치."}
{"patent_id": "10-2020-0015417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_31", "content": "제29 항에 있어서, 상기 릴리즈는 상기 제1 밀봉 부재의 이동에 따라 상기 소켓에 수용된 상기 트레이 구조를배출하도록 설정된(configured to release) 휴대용 전자 장치."}
{"patent_id": "10-2020-0015417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_32", "content": "제31 항에 있어서, 상기 제2 오프닝은 적어도, 상기 소켓에 수용된 상기 트레이 구조를 배출하기 위해 상기 제1 밀봉 부재가 이동하는 거리에 상응하는 길이를가지는 휴대용 전자 장치."}
{"patent_id": "10-2020-0015417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_33", "content": "제29 항에 있어서, 상기 제1 밀봉 부재는, 상기 측벽의 내측면과 상기 릴리즈 사이의 거리보다 더 큰 길이를 가지게 형성된 휴대용 전자 장치."}
{"patent_id": "10-2020-0015417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_34", "content": "제22 항에 있어서, 상기 트레이 구조에 배치되어 상기 제1 오프닝을 밀봉하는 제2 밀봉 부재를 더 포함하는 휴대용 전자 장치."}
{"patent_id": "10-2020-0015417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_35", "content": "제34 항에 있어서, 상기 트레이 구조는, 적어도 하나의 저장 매체를 수용하며, 상기 제1 오프닝을 통해 상기 하우징의 내부로 삽입되는 수용부; 및상기 수용부와 상기 트레이 구조의 한 단부 사이에서 연장되며, 적어도 부분적으로 상기 제1 오프닝에 수용되는공개특허 10-2020-0017446-7-연장 구조물을 포함하고, 상기 제2 밀봉 부재가 상기 연장 구조물의 외측면에 배치된 휴대용 전자 장치."}
{"patent_id": "10-2020-0015417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_36", "content": "제22 항에 있어서, 상기 제2 오프닝은 상기 제1 오프닝보다 작게 형성된 휴대용 전자 장치."}
{"patent_id": "10-2020-0015417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_37", "content": "제22 항에 있어서, 상기 제1 밀봉 부재는 상기 제2 오프닝의 길이 방향을 따라 이동하는 휴대용 전자 장치."}
{"patent_id": "10-2020-0015417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_38", "content": "제22 항에 있어서, 상기 걸림턱은 상기 측벽의 내측면에 간섭되어 상기 연장부가 상기 제2 오프닝을 통해 상기하우징으로부터 이탈하는 것을 방지하는 휴대용 전자 장치."}
{"patent_id": "10-2020-0015417", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 문서에 개시된 다양한 실시예에 따르면, 휴대용 전자 장치는, 측벽을 관통하게 형성된 제1 오프닝과, 상기 제 1 오프닝에 인접하게 배치되며 상기 측벽을 관통하게 형성된 제2 오프닝을 포함하는 하우징; 상기 제1 오프닝을 통해 상기 하우징에 착탈 가능하게 결합하는 트레이 구조로서, 상기 제2 오프닝에 상응하게 정렬되도록 형성된 (뒷면에 계속)"}
{"patent_id": "10-2020-0015417", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시예는 전자 장치에 관한 것으로, 예를 들면, 저장 매체를 수납하는 휴대용 전자 장치에 관 한 것이다."}
{"patent_id": "10-2020-0015417", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전자 장치라 함은, 가전제품으로부터, 전자 수첩, 휴대용 멀티미디어 재생기, 이동통신 단말기, 태블릿 PC, 영 상/음향 장치, 데스크톱 / 랩톱 컴퓨터, 차량용 내비게이션 등, 탑재된 프로그램에 따라 특정 기능을 수행하는 장치를 의미한다. 예를 들면, 이러한 전자 장치들은 저장된 정보를 음향이나 영상으로 출력할 수 있다. 전자 장 치의 집적도가 높아지고, 초고속, 대용량 무선통신이 보편화되면서, 최근에는, 이동통신 단말기 하나에 다양한 기능이 탑재되고 있다. 예를 들면, 통신 기능뿐만 아니라, 게임과 같은 엔터테인먼트 기능, 음악/동영상 재생과 같은 멀티미디어 기능, 모바일 뱅킹 등을 위한 통신 및 보안 기능, 일정 관리나 전자 지갑 등의 기능이 하나의 전자 장치에 집약되고 있는 것이다. 전자 수첩, 휴대용 멀티미디어 재생기, 이동통신 단말기, 태블릿 PC와 같이 휴대하고 다니면서 사용하는 전자 장치들을 일반적으로 디스플레이 장치와 배터리를 탑재하고 있으며, 바형, 폴더형, 슬라이딩형의 외관을 가지고 있었다. 최근에는 전자통신 기술이 발달함에 따라 전자 장치가 소형화되어, 손목(wrist)이나 두부(head)와 같은 신체의 일부에 착용할 수 있는 전자 장치가 상용화되기에 이르렀다. 또한, 전자 장치의 디자인을 중시하는 사용 자의 선호도에 따라, 금속 소재로 이루어진 케이스 또는 케이스의 일부(예: 케이스의 테두리)를 구비한 전자 장 치가 등장하고 있고, 배터리가 전자 장치에서 탈착되지 않고 전자 장치의 내부에 일체로 고정되는 전자 장치가 등장하고 있다. 이러한 전자 장치는 사용자 식별 모듈 카드(SIM card; subscriber identification module card)나 메모리 카드 등 저장 매체를 이용하여 사용자 인증 등의 보안 기능이나 저장 용량을 확장하는데 활용할 수 있다. 전자 장치 에는 소켓이 설치되어 저장 매체를 탈착 가능하게 구성할 수 있는데, 전자 장치의 구조에 따라 저장 매체를 트 레이에 장착하여 전자 장치의 내부로 삽입할 수 있다."}
{"patent_id": "10-2020-0015417", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "전자 장치에는 트레이를 전자 장치에서 배출시키기 위한 홀이 형성된 경우, 이러한 홀을 통해 외부로부터 물, 먼저 등 이물질이 전자 장치의 내부로 유입될 수 있다.따라서, 본 발명의 다양한 실시예는 전자 장치에 형성된 홀을 통해 이물질이 유입되는 것을 방지하는 방수/방진 구조를 가진 전자 장치를 제공하고자 한다."}
{"patent_id": "10-2020-0015417", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 문서에 개시된 다양한 실시예에 따르면, 휴대용 전자 장치는, 측벽을 관통하게 형성된 제1 오프닝과, 상기 제1 오프닝에 인접하게 배치되며 상기 측벽을 관통하게 형성된 제2 오프닝을 포함하는 하우징; 상기 제1 오프닝 을 통해 상기 하우징에 착탈 가능하게 결합하는 트레이 구조로서, 상기 제2 오프닝에 상응하게 정렬되도록 형성 된 트레이 홀을 포함하는 상기 트레이 구조; 및 적어도 부분적으로 상기 제2 오프닝의 내부로 배치된 밀봉 부재 를 포함하고, 상기 밀봉 부재는, 적어도 부분적으로 상기 제2 오프닝에 삽입되는 연장부(extending portion)로서, 제1 단부와, 상기 제1 단부에 대향하는(opposite to) 제2 단부를 포함하는 상기 연장부; 상기 제2 단부에 형성되어 상기 제2 오프닝을 통해 상기 연장부가 상기 하우징으로부터 이탈하는 것을 방지하며, 상기 연장부보다 더 큰 직경을 가지는 걸림턱(stopping portion); 및 상기 제1 단부와 상기 제2 단부 사이에서 상기 연장부의 외측면 (outer surface)에 배치되며 상기 제2 오프닝을 밀봉하는 적어도 하나의 제1 밀봉부를 포함할 수 있다. 본 문서에 개시된 다양한 실시예에 따르면, 휴대용 전자 장치는, 측벽과, 상기 측벽을 관통하게 형성된 제1 오 프닝과, 상기 측벽을 관통하게 형성되며 상기 제1 오프닝에 인접하게 배치된 제2 오프닝을 포함하는 하우징; 상 기 제1 오프닝을 통해 상기 하우징의 착탈 가능하게 결합하는 트레이 구조; 및 적어도 부분적으로 상기 제2 오 프닝 내에 배치된 제1 밀봉 부재를 포함하고, 상기 제1 밀봉 부재는, 적어도 부분적으로 상기 제2 오프닝에 삽입되는 연장부(extending portion)로서, 제1 단 부와, 상기 제1 단부에 대향하는(opposite to) 제2 단부를 포함하는 상기 연장부; 상기 제2 단부에 형성되어 상 기 제2 오프닝을 통해 상기 연장부가 상기 하우징으로부터 이탈하는 것을 방지하며, 상기 연장부보다 더 큰 직 경을 가지는 걸림턱(stopping portion); 및 상기 제1 단부와 상기 제2 단부 사이에서 상기 연장부의 외측면 (outer surface)에 배치되며 상기 제2 오프닝을 밀봉하는 적어도 하나의 밀봉부를 포함할 수 있다."}
{"patent_id": "10-2020-0015417", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 다양한 실시예에 따른 전자 장치는, 제2 오프닝의 일부분을 밀봉하는 방수 부재를 포함함으로써, 제2 오프닝을 통해 베젤의 내부로 이물질이 유입되는 것을 방지할 수 있다. 또한, 방수 부재는 외력을 받은 경우 제 2 오프닝에서 이동되어, 트레이에 외력을 전달하여 트레이가 베젤의 외부로 배출될 수 있다."}
{"patent_id": "10-2020-0015417", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 다양한 실시예들이 첨부된 도면을 참조하여 기재된다. 실시예 및 이에 사용된 용어들은 본 발 명에 기재된 기술을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 및 /또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유사 한 참조 부호가 사용될 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 본 발명의 다양한 실시예에서, \"A 또는 B\" 또는 \"A 및/또는 B 중 적어도 하나\" 등의 표현은 함께 나열 된 항목들의 모든 가능한 조합을 포함할 수 있다. \"제 1,\" \"제 2,\" \"첫째,\" 또는 \"둘째,\"등의 표현들은 해당 구 성요소들을, 순서 또는 중요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용 될 뿐 해당 구성요소들을 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에 \"(기능적으 로 또는 통신적으로) 연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로 연결되거나, 다른 구성요소(예: 제 3 구성요소)를 통하여 연결될 수 있다. 본 발명의 다양한 실시예에서, \"~하도록 구성된(또는 설정된)(configured to)\"은 상황에 따라, 예를 들면, 하드 웨어적 또는 소프트웨어적으로 \"~에 적합한,\" \"~하는 능력을 가지는,\" \"~하도록 변경된,\" \"~하도록 만들어진,\" \"~를 할 수 있는,\" 또는 또는 \"~하도록 설계된\"과 상호 호환적으로(interchangeably) 사용될 수 있다. 어떤 상 황에서는, \"~하도록 구성된 장치\"라는 표현은, 그 장치가 다른 장치 또는 부품들과 함께 \"~할 수 있는\" 것을 의 미할 수 있다. 예를 들면, 문구 \"A, B, 및 C를 수행하도록 구성된(또는 설정된) 프로세서\"는 해당 동작을 수행 하기 위한 전용 프로세서(예: 임베디드 프로세서), 또는 메모리 장치에 저장된 하나 이상의 소프트웨어 프로그 램들을 실행함으로써, 해당 동작들을 수행할 수 있는 범용 프로세서(예: CPU 또는 application processor)를 의 미할 수 있다. 본 발명의 다양한 실시예들에 따른 전자 장치는, 예를 들면, 스마트폰, 태블릿 PC, 이동 전화기, 영상 전화기, 전자책 리더기, 데스크탑 PC, 랩탑 PC, 넷북 컴퓨터, 워크스테이션, 서버, PDA, PMP(portable multimedia player), MP3 플레이어, 의료기기, 카메라, 또는 웨어러블 장치 중 적어도 하나를 포함할 수 있다. 웨어러블 장 치는 액세서리형(예: 시계, 반지, 팔찌, 발찌, 목걸이, 안경, 콘택트 렌즈, 또는 머리 착용형 장치(head- mounted-device(HMD)), 직물 또는 의류 일체형(예: 전자 의복), 신체 부착형(예: 스킨 패드 또는 문신), 또는 생체 이식형 회로 중 적어도 하나를 포함할 수 있다. 어떤 실시예들에서, 전자 장치는, 예를 들면, 텔레비전, DVD(digital video disk) 플레이어, 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스, 홈 오토매이션 컨트롤 패널, 보안 컨트롤 패널, 미디어 박스(예: 삼성 HomeSyncTM, 애플TVTM, 또는 구글 TVTM), 게임 콘솔(예: XboxTM, PlayStationTM), 전자 사전, 전자 키, 캠코더, 또는 전자 액자 중 적어도 하 나를 포함할 수 있다. 다른 실시예에서, 전자 장치는, 각종 의료기기(예: 각종 휴대용 의료측정기기(혈당 측정기, 심박 측정기, 혈압 측정기, 또는 체온 측정기 등), MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 또는 초음파기 등), 네비게이션 장치, 위성 항법 시스템(GNSS(global navigation satellite system)), EDR(event data recorder), FDR(flight data recorder), 자동차 인포테인먼 트 장치, 선박용 전자 장비(예: 선박용 항법 장치, 자이로 콤파스 등), 항공 전자기기(avionics), 보안 기기, 차량용 헤드 유닛(head unit), 산업용 또는 가정용 로봇, 드론(drone), 금융 기관의 ATM, 상점의 POS(point of sales), 또는 사물 인터넷 장치 (예: 전구, 각종 센서, 스프링클러 장치, 화재 경보기, 온도조절기, 가로등, 토 스터, 운동기구, 온수탱크, 히터, 보일러 등) 중 적어도 하나를 포함할 수 있다. 어떤 실시예에 따르면, 전자 장치는 가구, 건물/구조물 또는 자동차의 일부, 전자 보드(electronic board), 전자 사인 수신 장치(electronic signature receiving device), 프로젝터, 또는 각종 계측 기기(예: 수도, 전기, 가스, 또는 전파 계측 기기 등) 중 적어도 하나를 포함할 수 있다. 다양한 실시예에서, 전자 장치는 플렉서블하거나, 또는 전술한 다양한 장치들 중 둘 이상의 조합일 수 있다. 본 발명의 다양한 실시예에 따른 전자 장치는 전술한 기기들에 한정되지 않는다. 본 발명의 다양한 실시예에서, 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하 는 장치(예: 인공지능 전자 장치)를 지칭할 수 있다. 도 1은 본 발명의 다양한 실시예 중 하나에 따른 전자 장치를 나타내는 사시도이다. 도 2는 도 1에 도시된 전자 장치의 제2 오프닝에 외부 부재가 삽입되어 트레이가 외부로 배출되는 모습을 나타내는 사시도이다. 도 1 및 도 2를 참조하면, 본 발명의 다양한 실시예 중 하나에 따른 전자 장치는 상기 전자 장치의 정면을 형성하는 정면(front) 유리 커버, 상기 전자 장치의 후면을 형성하는 후면 커버 및 상기 정면 유리 커버 및 상기 후면 커버 사이에 의해 형성된 공간을 둘러싸는 베젤을 포함할 수 있다. 상기 정면 유리 커버는 유리 재질로 이루어질 수 있다. 다만, 상기 정면 유리 커버는 유리 재질로 이 루어진 것에 한정되지 않고, 강화 플라스틱 등 투명성을 가지는 다양한 소재로 이루어질 수 있다. 상기 베젤은 상기 후면 커버와 일체로 또는 별도로(separately) 형성될 수 있다. 상기 베젤은 제1 크 기의 제1 오프닝, 및 상기 제1 크기보다 작은 제2 오프닝을 포함할 수 있다. 상기 제2 오프닝은 상기 제1 오프 닝에 인접하여 배치될 수 있다. 상기 베젤은 플라스틱(plastic) 재질, 예를 들면, 폴리카보네이트 (polycarbonate) 재질로 이루어질 수 있다. 다만, 상기 베젤은 폴리카보네이트 재질에 한정되지 않고, 다 양한 플라스틱 재질로 이루어질 수 있다. 또한, 상기 베젤과 상기 후면 커버는 금속 재질로 이루어질 수 있다. 또한, 본 발명의 다양한 실시예에 따르면, 상기 베젤는 금속 재질로 이루어지면서 상기 후면 커버는 플라스틱 재질로 이루어질 수 있다. 그리고, 상기 금속 재질의 베젤는 상기 전자 장치의 안테나 방사 체로 활용될 수 있다. 또한, 상기 공간에는 회로 기판이 구비되고, 상기 회로 기판은 상기 전자 장치를 구 동하기 위해 필요한 제어부, 통신회로부 등을 탑재되고, 이어폰 잭, USB 커넥터와 연결되는 각종 연결단자들이 탑재될 수 있다. 상기 베젤에는 키패드, 수화부, 마이크 홀 등 다양한 입출력 장치, 근조도 센서 등 다양한 센서 및 카메라가 장착될 수 있다. 또한, 본 발명의 다양한 실시예에 따른 전자 장치는 디스플레이 및 트레이를 포함할 수 있다. 상기 디스플레이는 상기 공간 내에 내장되고, 상기 정면 유리 커버를 통하여 노출된 화면 영역을 포함할 수 있다. 상기 정면 유리 커버의 후면에 구비되고, 터치 패널을 구비할 수 있다. 상기 정면 유리 커버 는 상기 디스플레이를 통해 출력되는 화면을 투과시킬 수 있다. 상기 정면 유리 커버는 상기 터치 패널과 일체로 구성되어 입력 장치의 기능을 제공할 수 있다. 또한, 상기 정면 유리 커버의 일면은 곡면으로 이루 어질 수 있다. 예를 들면, 상기 정면 유리 커버의 양측면은 휘어지게 되어, 상기 정면 유리 커버의 전면 뿐만 아니라 양측면에 영상 또는 아이콘 등 이미지가 표시될 수 있다. 상기 트레이는 저장 매체를 수용하는 홈을 포함하고, 베젤의 일면, 예를 들면, 상기 베젤의 상 면에 탈착 가능하게 결합될 수 있다. 상기 저장 매체(S)는 에스디 카드(secure digital card; SD card)나 마이 크로 에스디 카드(micro SD card) 등 메모리 카드 또는 사용자 식별 모듈 카드(subscriber identity module card; SIM card)를 포함할 수 있다. 상기 트레이의 외측면은 상기 베젤의 일면에 대응되는 평면 또는 곡면으로 이루어져 상기 베젤과 함께 상기 전자 장치의 외형과 일체화된 외관을 이룰 수 있다. 그리 고, 상기 트레이의 외측면에는 후술할 베젤의 제2 오프닝에 대응하여 상기 트레이를 인출하기 위한 트레이 홀이 형성될 수 있다. 상기 베젤에 장착된 상기 트레이를 상기 베젤의 외부로 배출하기 위해, 상기 트레이 홀에 는 외부 부재가 삽입될 수 있다. 상기 외부 부재는 상기 트레이 홀에 대응되는 로드형태로 이루 어지면서 사용자가 그립할 수 있는 그립부로 이루어질 수 있으나, 다만, 이에 한정되지 않고, 클립, 펜, 상기 전자 장치에 탑재된 전자펜 또는 상기 제2 오프닝에 설치된 스위치 등 상기 제2 오프닝에 삽입될 수 있는 다양 한 구조로 이루어질 수 있다. 도 2에 도시된 바와 같이, 상기 외부 부재가 상기 트레이 홀에 삽입되 면서 힘을 가하면, 상기 트레이는 상기 베젤에서 분리되면서 상기 베젤의 외부로 배출될 수 있 다. 도 3은 본 발명의 다양한 실시예 중 다른 하나에 따른 전자 장치를 나타내는 사시도이다. 본 실시예를 설명함에 있어, 선행 실시예와 유사한 및/또는 선행 실시예를 통해 용이하게 이해될 수 있는 구성요소들에 대해서는 도면 의 참조번호를 동일하게 부여하거나 생략하고, 그 상세한 설명 또한 생략될 수 있다. 도 3을 참조하면, 본 발명의 다양한 실시예 중 다른 하나에 따른 전자 장치는 베젤, 디스플레이 및 트레이(205, 206)들을 포함할 수 있다. 상기 베젤의 상측면에는 이어폰 잭과 연결되는 제1 연결단자 및 유에스비(USB) 단자와 연결되는 제2 연결단자를 구비할 수 있다. 상기 디스플레이는 상기 베젤의 전면을 이루면서 평평한 형상을 가질 수 있다. 상기 트레이(205, 206)들은 상기 베젤의 측면에 장착되고, 상기 트레이(205, 206)들 각각은 서로 인접하게 배치될 수 있다. 그리고, 상기 트레이(205, 206)들은 서로 다른 저장 매체를 수용하여 상기 베젤에 장착될 수 있다. 예를 들면, 상기 트레이(205, 206)들은 메모리 카드를 수용하는 제1 트레이 및 사용자 식별 모듈 카드를 수용하는 제2 트레이를 구비할 수 있다. 반대로, 상기 제1 트레이는 사용자 식별 모듈 카드를 수용하고, 상기 제2 트레이는 메모리 카드를 수용할 수 있다. 또한, 상기 제1 트레이 및 상기 제2 트 레이 각각은 메모리 카드와 사용자 식별 모듈 카드가 모두 구비되는 구조를 가질 수 있다. 또한, 사용자 식별 모듈 카드는 제1 사용자 식별 모듈 카드와 제2 사용자 식별 모듈 카드를 구비하고, 상기 제1 트레이 및 상기 제2 트레이 각각은 제1 사용자 식별 모듈 카드와 제2 사용자 식별 모듈 카드 각각을 구비할 수 있 다. 상기 제1 트레이에는 제1 트레이 홈이 형성될 수 있고, 상기 제1 트레이 홈과 상기 제2 트레이 홈의 내경이 동일하여 하나의 외부 부재가 상기 제1 트레이 홈 및 상기 제2 트레이 홈에 삽입되어 상기 제1 트레이와 상기 제2 트레이를 상기 베젤의 외부로 배출시킬 수 있다. 도 4는 본 발명의 다양한 실시예에 따른 전자 장치를 포함하는 네트워크 환경을 나타내는 도면이다. 도 4를 참조하여, 다양한 실시예에서의, 네트워크 환경 내의 전자 장치(예: 상술한 전자 장치(100, 200))가 기재된다. 전자 장치는 버스(11a), 프로세서(11b), 메모리(11c), 입출력 인터페이스(11e), 디스플 레이(11f), 및 통신 인터페이스(11g)를 포함할 수 있다. 어떤 실시예에서는, 전자 장치는, 구성요소들(11a- 11g) 중 적어도 하나를 생략하거나 다른 구성요소를 추가적으로 구비할 수 있다. 버스(11a)는, 예를 들면, 구성요소들(11b-11g)을 서로 연결하고, 구성요소들 간의 통신(예: 제어 메시지 및/또는 데이터)을 전달하는 회로를 포함할 수 있다. 프로세서(11b)는, 중앙처리장치, 어플리케이션 프로세서, 또는 커뮤니케이션 프로세서 (communication processor(CP)) 중 하나 또는 그 이상을 포함할 수 있다. 프로세서(11b)는, 예를 들면, 전자 장치의 적어도 하나의 다른 구성요소들의 제어 및/또는 통신에 관한 연산이나 데이터 처리를 실행할 수 있 다. 메모리(11c)는, 휘발성 및/또는 비휘발성 메모리를 포함할 수 있다. 메모리(11c)는, 예를 들면, 전자 장치 의 적어도 하나의 다른 구성요소에 관계된 명령 또는 데이터를 저장할 수 있다. 한 실시예에 따르면, 메모리 (11c)는 소프트웨어 및/또는 프로그램을 저장할 수 있다. 메모리(11c)는, 예를 들면, 내장 메모리 또는 외 장 메모리를 포함할 수 있다. 내장 메모리는, 예를 들면, 휘발성 메모리(예: DRAM, SRAM, 또는 SDRAM 등), 비휘 발성 메모리(예: OTPROM(one time programmable ROM), PROM, EPROM, EEPROM, mask ROM, flash ROM, 플래시 메 모리, 하드 드라이브, 또는 솔리드 스테이트 드라이브 (SSD) 중 적어도 하나를 포함할 수 있다. 외장 메모리는 플래시 드라이브(flash drive), 예를 들면, CF(compact flash), SD(secure digital), Micro-SD, Mini-SD, xD(extreme digital), MMC(multi-media card) 또는 메모리 스틱 등을 포함할 수 있다. 외장 메모리는 다양한 인터페이스를 통하여 전자 장치와 기능적으로 또는 물리적으로 연결될 수 있다. 프로그램은, 예를 들면, 커널(18a), 미들웨어(18b), 어플리케이션 프로그래밍 인터페이스(API)(18c), 및/또는 어플리케이션 프로 그램(또는 \"어플리케이션\")(18d) 등을 포함할 수 있다. 커널(18a), 미들웨어(18b), 또는 API(18c)의 적어도 일 부는, 운영 시스템으로 지칭될 수 있다. 커널(18a)은, 예를 들면, 다른 프로그램들(예: 미들웨어(18b), API(18c), 또는 어플리케이션 프로그램(18d))에 구현된 동작 또는 기능을 실행하는 데 사용되는 시스템 리소스 들(예: 버스(11a), 프로세서(11b), 또는 메모리(11c) 등)을 제어 또는 관리할 수 있다. 또한, 커널(18a)은 미들 웨어(18b), API(18c), 또는 어플리케이션 프로그램(18d)에서 전자 장치의 개별 구성요소에 접근함으로써, 시스템 리소스들을 제어 또는 관리할 수 있는 인터페이스를 제공할 수 있다. 미들웨어(18b)는, 예를 들면, API(18c) 또는 어플리케이션 프로그램(18d)이 커널(18a)과 통신하여 데이터를 주 고받을 수 있도록 중개 역할을 수행할 수 있다. 또한, 미들웨어(18b)는 어플리케이션 프로그램(18d)으로부터 수 신된 하나 이상의 작업 요청들을 우선 순위에 따라 처리할 수 있다. 예를 들면, 미들웨어(18b)는 어플리케이션 프로그램(18d) 중 적어도 하나에 전자 장치의 시스템 리소스(예: 버스(11a), 프로세서(11b), 또는 메모리 (11c) 등)를 사용할 수 있는 우선 순위를 부여하고, 상기 하나 이상의 작업 요청들을 처리할 수 있다. API(18 c)는 어플리케이션(18d)이 커널(18a) 또는 미들웨어(18b)에서 제공되는 기능을 제어하기 위한 인터페이스로, 예 를 들면, 파일 제어, 창 제어, 영상 처리, 또는 문자 제어 등을 위한 적어도 하나의 인터페이스 또는 함수(예: 명령어)를 포함할 수 있다. 입출력 인터페이스(11e)는, 예를 들면, 사용자 또는 다른 외부 기기로부터 입력된 명령 또는 데이터를 전자 장치의 다른 구성요소(들)에 전달하거나, 또는 전자 장치의 다른 구성요소(들)로부터 수신된 명령 또는 데이터를 사용자 또는 다른 외부 기기로 출력할 수 있다. 디스플레이(11f)는, 예를 들면, 액정 디스플레이(LCD), 발광 다이오드(LED) 디스플레이, 유기 발광 다이오드 (OLED) 디스플레이, 또는 마이크로 전자기계 시스템(MEMS) 디스플레이, 또는 전자종이(electronic paper) 디스 플레이를 포함할 수 있다. 디스플레이(11f)는, 예를 들면, 사용자에게 각종 콘텐츠(예: 텍스트, 이미지, 비디오, 아이콘, 또는 심볼 등)을 표시할 수 있다. 디스플레이(11f)는, 터치 스크린을 포함할 수 있으며, 예를 들면, 전자 펜 또는 사용자의 신체의 일부를 이용한 터치, 제스쳐, 근접, 또는 호버링 입력을 수신할 수 있다. 통신 인터페이스(11g)는, 예를 들면, 전자 장치와 외부 장치(예: 제 1 외부 전자 장치, 제 2 외부 전자 장치, 또는 서버) 간의 통신을 설정할 수 있다. 예를 들면, 통신 인터페이스(11g)는 무선 통신 또는 유 선 통신을 통해서 네트워크에 연결되어 외부 장치(예: 제 2 외부 전자 장치 또는 서버)와 통신할 수 있다. 무선 통신은, 예를 들면, LTE(long-term evolution), LTE-A(LTE Advance), CDMA(code division multiple access), WCDMA(wideband CDMA), UMTS(universal mobile telecommunications system), WiBro(Wireless Broadband), 또는 GSM(Global System for Mobile Communications) 등 중 적어도 하나를 사용할 수 있다. 한 실 시예에 따르면, 무선 통신은, 예를 들면, WiFi(wireless fidelity), 블루투스, 블루투스 저전력(BLE), 지그비 (Zigbee), NFC(near field communication), 자력 시큐어 트랜스미션(Magnetic Secure Transmission), 라디오 프리퀀시(RF), 또는 보디 에어리어 네트워크(BAN) 중 적어도 하나를 포함할 수 있다. 한 실시예에 따르면, 무선 통신은 GNSS를 포함할 수 있다. GNSS는, 예를 들면, GPS(Global Positioning System), Glonass(Global Navigation Satellite System), Beidou Navigation Satellite System(이하 \"Beidou\") 또는 Galileo, the European global satellite-based navigation system일 수 있다. 이하, 다양한 실시예에서는, \"GPS\"는 \"GNSS\"와 상호 호환적으로 사용될 수 있다. 유선 통신은, 예를 들면, USB(universal serial bus), HDMI(high definition multimedia interface), RS-232(recommended standard232), 전력선 통신, 또는 POTS(plain old telephone service) 등 중 적어도 하나를 포함할 수 있다. 네트워크는 텔레커뮤니케이션 네트워크, 예를 들 면, 컴퓨터 네트워크(예: LAN 또는 WAN), 인터넷, 또는 텔레폰 네트워크 중 적어도 하나를 포함할 수 있다. 제 1 및 제 2 외부 전자 장치(12, 13) 각각은 전자 장치와 동일한 또는 다른 종류의 장치일 수 있다. 다양 한 실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 다른 하나 또는 복수의 전자 장치 (예: 전자 장치(12,13), 또는 서버에서 실행될 수 있다. 한 실시예에 따르면, 전자 장치가 어떤 기능이 나 서비스를 자동으로 또는 요청에 의하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으 로 실행시키는 대신에 또는 추가적으로, 그와 연관된 적어도 일부 기능을 다른 장치(예: 전자 장치(12, 13), 또 는 서버)에게 요청할 수 있다. 다른 전자 장치(예: 전자 장치(12, 13), 또는 서버)는 요청된 기능 또는 추가 기능을 실행하고, 그 결과를 전자 장치로 전달할 수 있다. 전자 장치는 수신된 결과를 그대로 또 는 추가적으로 처리하여 요청된 기능이나 서비스를 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 도 5은 본 발명의 다양한 실시예 중 또 다른 하나에 따른 전자 장치를 나타내는 분리 사시도이다. 도 6은 본 발 명의 다양한 실시예 중 또 다른 하나에 따른 전자 장치의 트레이가 제1 멤버에 분리된 모습을 나타내는 사시도 이다. 도 7은 본 발명의 다양한 실시예 중 또 다른 하나에 따른 전자 장치의 트레이가 제1 멤버에 장착되는 모 습을 나태는 사시도이다. 본 실시예를 설명함에 있어, 선행 실시예와 유사한 및/또는 선행 실시예를 통해 용이 하게 이해될 수 있는 구성요소들에 대해서는 도면의 참조번호를 동일하게 부여하거나 생략하고, 그 상세한 설명 또한 생략될 수 있다. 도 5 내지 도 7을 참조하면, 본 발명의 다양한 실시예 중 또 다른 하나에 따른 전자 장치는 하우징, 회로 기판, 지지부(또는 후면 커버, 전면 커버), 트레이 및 핀을 포함할 수 있다. 상기 하우징은 상기 베젤(301a)과 상기 후면 커버와 함께 상기 전자 장치의 외형을 이루면서 상기 전자 장 치의 기계적인 강성을 제공할 수 있다. 상기 회로 기판은 상기 하우징에 수용되고, 어플리케이션 프로세서(application processor; AP), 통 신 모듈, 메모리, 오디오 모듈, 전원관리 모듈 등의 집적회로 칩, 저장 매체용 소켓, 각종 센서 및 커넥터, 안 테나 장치나 외부 기기 접속용 커넥터 등의 전자 부품들이 탑재될 수 있다. 상기 지지부는 상기 하우징에 수용되면서 볼트 결합 방식을 통해 상기 하우징의 내측면과 결합 될 수 있다. 상기 지지부는 상기 하우징의 기계적 강성을 향상시킬 수 있으며, 내부의 각종 전자 부 품들을 서로에 대하여 보호, 격리시킬 수 있다. 예컨대, 상기 회로 기판에는 집적 회로 칩 등 각종 전자 부품들이 탑재되는 바, 상기 하우징의 전면에 구비되는 디스플레이(미도시)와 전자 부품들이 접촉할 경우, 상기 디스플레이의 손상을 유발할 수 있다. 상기 지지부는 상기 회로 기판과 디스플레이 사이에 배치 되어 상기 전자 부품들이 상기 디스플레이에 직접 접촉하는 것을 차단할 수 있다. 또한, 상기 지지부는 상 기 전자 부품들이 작동하면서 발생되는 전자기파를 차폐하여 다른 전자 부품들의 작동에 영향을 미치는 것을 차 단할 수 있다. 예컨대, 상기 지지부가 상기 회로 기판과 상기 디스플레이 사이에 배치됨으로써, 상기 디스플레이는 다른 전자 부품들의 전자기파에 영향을 받지 않고 안정된 동작을 수행할 수 있다. 또한, 상기 지 지부는 상기 회로 기판을 장착, 고정할 수 있는 각종 구조물들을 제공할 수 있으며, 상기 디스플레이 를 지지하여 상기 디스플레이의 형태를 안정적으로 유지할 수 있다. 또한, 본 발명의 다양한 실시예에 따르면, 상기 지지부는 상기 후면 커버에 해당될 수 있다. 상기 지지부는 상기 베젤(301a)과 함께 상기 전자 장치의 외관을 이룰 수 있다. 또한, 본 발명의 다양한 실시예에 따르면, 상기 지지부는 상기 전면 커버에 해당될 수 있다. 상기 베젤(301a)의 외측면에는 제1 오프닝이 형성되고, 상기 트레이가 상기 제1 오프닝을 경유 하여 상기 베젤(301a)의 내부로 삽입될 수 있다. 그리고, 상기 베젤(301a)에는 상기 제1 오프닝에 인접하 게 형성되는 제2 오프닝이 형성될 수 있다. 상기 제2 오프닝에는 외부 부재(109, 도 1)가 삽입될 수 있다. 상기 핀은 상기 제2 오프닝에 삽입되어 상기 제2 오프닝의 일부분을 밀봉할 수 있다. 상기 핀 은 제1 부분으로 지칭될 수 있다. 상기 핀에 대한 자세한 설명은 이후 도면을 참조하여 후술하기로 한다.상기 제1 멤버는 상기 하우징의 내측면과 상기 회로 기판 사이에 구비되어 상기 회로 기판 상에 장착될 수 있다. 상기 제1 멤버는 상기 트레이에 수용된 저장 매체와 전기적으로 연결될 수 있 다. 그리고, 상기 제1 멤버에는 상기 제1 멤버에 장착된 트레이를 상기 제1 멤버에서 분 리하도록 하는 제2 멤버를 구비할 수 있다. 상기 제2 멤버는 상기 제1 멤버의 내측면과 인접하 게 구비되면서 상기 제2 멤버의 길이 방향을 따라 이동할 수 있다. 다만, 상기 제2 멤버는 상기 제1 멤버의 내측면과 인접하게 구비되는 것에 한정되지 않고, 상기 제1 멤버의 외측면과 인접하게 구비될 수 있다. 그리고, 상기 핀은 상기 제2 멤버의 일단과 접할 수 있고, 상기 제2 멤버에 힘을 전달 하여 상기 제2 멤버를 상기 제2 멤버의 길이 방향을 따라 이동시킬 수 있다. 도 8은 본 발명의 다양한 실시예 중 또 다른 하나에 따른 전자 장치의 트레이를 나타내는 사시도이다. 도 9는 본 발명의 다양한 실시예 중 또 다른 하나에 따른 전자 장치의 트레이를 나타내는 평면도이다. 도 8 및 도 9를 참조하면, 상기 트레이는 저장매체를 수용하는 수용부를 구비할 수 있다. 상기 트레 이는 상기 메모리 카드 또는 상기 사용자 식별 모듈 카드 중 적어도 하나를 수용할 수 있다. 또한, 본 발 명의 다양한 실시예에 따른 상기 수용부는 제1 저장 매체가 수용되는 제1 수용 공간, 제2 저장 매체 가 수용되는 제2 수용 공간 및 상기 제1 수용공간과 상기 제2 수용 공간를 분리하는 구획부 를 구비할 수 있다. 여기서, 상기 제1 저장 매체는 메모리 카드이고, 상기 제2 저장 매체는 사용자 식별 모듈 카드일 수 있다. 반대로, 상기 제1 저장 매체는 사용자 식별 모듈 카드이고, 상기 제2 저장 매체는 메모리 카드일 수 있다. 또한, 상기 제1, 2 저장 매체는 메모리 카드일 수 있다. 또한, 상기 트레이에는 상기 제1 저장 매체와 상기 제2 저장 매체가 모두 수용되어 상기 제1 저장 매체와 상기 제2 저장 매체를 동시에 사용할 수 있다. 또한, 상기 트레이에는 상기 제1 저장 매체 또는 상기 제2 저장 매체 중 어느 하나만이 수용되더 라도 사용될 수 있다. 그리고, 상기 트레이의 일단에는 상기 제2 오프닝에 대응되는 트레이 홀 이 형성될 수 있다. 도 10은 본 발명의 다양한 실시예 중 또 다른 하나에 따른 전자 장치의 제1 부분을 나타내는 사시도이다. 도 11 은 본 발명의 다양한 실시예 중 또 다른 하나에 따른 전자 장치의 제1 부분을 나타내는 측면도이다. 도 12는 본 발명의 다양한 실시예 중 또 다른 하나에 따른 전자 장치의 제1 부분을 다른 방향에서 바라본 측면도이다. 도 10 및 도 12를 참조하면, 상기 핀(예: 제1 부분)는 상기 제2 오프닝(312, 도 5)에 삽입될 수 있다. 상 기 제1 부분은 상기 제1 부분의 일단로부터 연장된 제 2 단부 및 상기 제1 부분의 외주면 을 따라 돌출 형성되는 방수 부재를 구비할 수 있다. 여기서, 상기 방수 부재은 제1 방수 부재 로 지칭될 수 있다. 상기 제1 부분은 플라스틱 재질 또는 금속 재질로 이루어질 수 있다. 상기 제1 부분은 상기 제1 부분 의 외주면을 따라 형성되는 홈을 구비하여 상기 방수 부재의 일부분(375a)이 상기 홈에 수용될 수 있다. 그리고, 상기 제1 부분의 단면의 장직경(R2)은 상기 제1 부분의 단면의 단직경(R1)보다 작게 형성되 어 상기 제1 부분의 단면이 타원 형상으로 이루어질 수 있다. 상기 제1 부분의 단면이 타원 형상으로 이루어짐에 따라, 상기 제1 부분이 상기 제2 오프닝(312, 도 5)에 삽입된 상태에서, 상기 제1 부분의 중심에 대해 회전운동하는 것을 방지할 수 있다. 다만, 상기 제1 부분의 단면이 타원 형상으로 이루어지는 것에 한정되지 않고, 원형 또는 다각형으로 이루어질 수 있다. 상기 제1 부분은 제1 단부와 제2 단부를 포함할 수 있다. 제 1 단부는 상기 외부 부재의 눌림에 의하여 상 기 제2 멤버와 접촉할 수 있고, 제2 단부는 상기 외부 부재에 의하여 눌릴 수 있다. 상기 제 2 단부는 상기 제2 오프닝(312, 도 5)의 내경보다 큰 외경을 가지게 되어 상기 제2 오프닝(312, 도 5)의 내측단에 걸릴 수 있다. 즉, 상기 제 2 단부는 상기 제1 부분이 상기 제2 오프닝(312, 도 5)을 관통하여 상기 베젤(301a)의 외부로 이탈되는 것을 방지할 수 있다. 상기 방수 부재는 실리콘 재질로 이루어질 수 있다. 다만, 상기 방수 부재는 실리콘 재질로 이루어진 것에 한정되지 않고, 탄성력을 가진 다양한 재질로 이루어질 수 있다. 상기 방수 부재는 상기 홈에 수용되 어 상기 제1 부분에 결합되는 제1 돌출부(375a) 및 상기 제1 돌출부(375a)로부터 연장되어 돌출 형성되는 제2 돌출부(375b)를 구비할 수 있다. 상기 제1 돌출부(375a)는 접착제에 의해 상기 홈에 부착되거나 상기 제1 부분 과 함께 인서트 사출 방식으로 상기 제1 부분에 결합될 수 있다. 상기 제2 돌출부(375b)는 상기 제1 돌출부(375a)와 일체로 형성될 수 있다. 도 13 내지 도 17을 참조하여, 본 발명의 다양한 실시예에 따른 전자 장치의 구성요소들이 조립되는 과정을 살 펴보기로 한다. 도 13은 본 발명의 다양한 실시예 중 또 다른 하나에 따른 전자 장치의 제1 부분이 제2 오프닝에 조립되기 전의 모습을 나타내는 사시도이다. 도 13을 참조하면, 상기 제1 부분은 상기 하우징의 내부로부터 상기 하우징의 외부 방향으로 상 기 제2 오프닝에 삽입할 수 있다. 이때, 상기 제 2 단부(372, 도 12)가 상기 제2 오프닝의 내측단에 걸릴 수 있다. 도 14는 본 발명의 다양한 실시예 중 또 다른 하나에 따른 전자 장치의 제1 멤버와 회로 기판을 나타내는 사시 도이다. 도 15는 도 14에 도시된 제1 멤버와 회로 기판이 하우징에 장착된 모습을 나타내는 사시도이다. 도 14 및 도 15를 참조하면, 상기 제1 멤버은 상기 회로 기판에 탑재되어 상기 회로 기판과 전 기적으로 연결될 수 있다. 그리고, 상기 제1 멤버는 상기 회로 기판과 함께 상기 하우징의 내측 면에 배치될 수 있다. 상기 제1 멤버는 상기 제1 오프닝과 대응되는 위치에 배치되고, 상기 제2 멤버 는 상기 제1 부분의 길이방향과 동일한 방향으로 배치될 수 있다. 도 16은 도 14에 도시된 제1 멤버에 트레이가 수납되기 전의 모습을 나타내는 사시도이다. 도 17은 도 14에 도 시된 제1 멤버에 트레이가 수납된 상태를 나타내는 사시도이다. 도 16 및 도 17을 참조하면, 상기 트레이는 상기 제1 오프닝 을 경유하여 상기 제1 멤버에 장착 될 수 있다. 상기 트레이가 상기 제1 멤버에 완전히 장착된 후, 상기 트레이에 수용된 저장 매 체는 상기 제1 멤버과 전기적으로 연결됨에 따라, 상기 회로 기판과 전기적으로 연결될 수 있다. 도 18은 본 발명의 다양한 실시예 중 또 다른 하나에 따른 전자 장치의 제1 멤버와 트레이를 나타내는 평면도이 다. 본 실시예를 설명함에 있어, 선행 실시예와 유사한 및/또는 선행 실시예를 통해 용이하게 이해될 수 있는 구성요소들에 대해서는 도면의 참조번호를 동일하게 부여하거나 생략하고, 그 상세한 설명 또한 생략될 수 있다. 도 18을 참조하면, 본 발명의 다양한 실시예 중 또 다른 하나에 따른 전자 장치는 트레이, 제1 멤버 및 제2 멤버를 포함할 수 있고, 상기 트레이가 상기 제1 멤버에서 배출되는 작동 과정을 살펴보 기로 한다. 상기 트레이가 상기 제1 멤버에 장착된 상태에서, 상기 제2 멤버가 제1 방향(①)으로 상기 외부 부재에 의해 눌리게 되면, 상기 제2 멤버가 상기 제1 방향(①)으로 이동되면서 상기 제2 멤버의 일부 분이 상기 트레이에 상기 제1 방향(①)의 반대방향인 제2 방향(②)으로 힘을 가할 수 있다. 이에 따라, 상 기 트레이는 상기 제2 방향(②)으로 상기 제1 멤버에서 배출될 수 있다. 도 19는 도 18에 도시된 트레이를 나타내는 사시도이다. 도 20은 도 18에 도시된 트레이가 하우징에 수납된 상 태를 나타내는 단면도이다. 도 21은 도 18에 도시된 트레이가 하우징에 수납된 상태를 나타내는 평면도이다. 도 19 내지 도 21을 참조하면, 상기 트레이는 저장 매체를 수용하는 수용부, 상기 수용부로부터 연장된 연장부, 및 상기 연장부에 돌출 형성되는 다른(another) 방수 부재를 구비할 수 있다. 여기서, 상기 다른 방수 부재는 제2 방수 부재로 지칭될 수 있다. 상기 연장부는 상기 수용부와 상기 트레이의 헤드 사이에 구비될 수 있다. 그리고, 상기 연장부 는 상기 연장부의 외측면을 따라 형성되는 트레이 홈을 구비할 수 있다. 상기 다른 방수 부재는 실리콘 재질로 이루어지면서 상기 트레이 홈에 수용되는 제1 트레이 방수 부재 (455a) 및 상기 제1 트레이 방수 부재(455a)로부터 연장되어 돌출 형성되는 제2 트레이 방수 부재(455b)를 구비 할 수 있다. 상기 제1 트레이 방수 부재(455a)는 접착제에 의해 상기 트레이 홈에 부착되거나 상기 연장부와 함 께 인서트 사출 방식으로 상기 연장부에 결합될 수 있다. 상기 트레이가 상기 제1 오프닝을 통 해 상기 하우징 내부로 삽입되고, 상기 제2 트레이 방수 부재(455b)는 상기 제1 오프닝의 내벽에 밀 착되어 상기 제1 오프닝를 통해 외부로부터 물 등 이물질이 유입되는 것을 방지할 수 있다. 상기 트레이의 헤드은 상기 연장부와 결합될 수 있다. 상기 트레이의 헤드은 금속 재질로 이루 어져 금속 재질로 이루어진 하우징의 외관과 조화를 이룰 수 있다. 또한, 금속 재질의 트레이의 헤드(45 1)은 전자 장치의 안테나 방사체로 활용될 수 있다. 다만, 상기 트레이의 헤드은 금속 재질로 이루어진 것에 한정되지 않고, 플라스틱 재질 등 다양한 재질로 이루어질 수 있다. 또한, 상기 수용부와 상기 연장부 는 금속 재질로 이루어져 상기 트레이의 헤드와 함께 안테나 방사체로 활용될 수 있다. 다만, 상기 수용부와 상기 연장부는 금속 재질로 이루어지는 것에 한정되지 않고, 플라스틱 재질 등 다양한 재질 로 이루어질 수 있다. 도 22는 본 발명의 다양한 실시예 중 또 다른 하나에 따른 전자 장치의 의 제2 오프닝에 제1 부분이 조립되는 모습을 나타내는 사시도이다. 도 23은 도 22에 도시된 전자 장치의 제2 오프닝에 제1 부분이 삽입된 모습을 나 타내는 사시도이다. 도 24는 도 22에 도시된 전자 장치의 제2 오프닝에 제1 부분이 삽입된 모습을 나타내는 단 면 사시도이다. 도 25는 도 22에 도시된 전자 장치의 제2 오프닝에 제1 부분이 삽입된 모습을 나타내는 단면도 이다. 도 26은 본 발명의 다양한 실시예 중 또 다른 하나에 따른 전자 장치의 트레이가 하우징에서 배출되는 과 정을 나타내는 순서도이다. 도 22 내지 도 26을 참조하면, 상기 제1 부분은 상기 제2 오프닝에 삽입되어 상기 제1 부분이 상기 제2 오프닝의 일부분과 밀착될 수 있다. 상기 제1 부분은 방수 부재를 구비하고, 상기 제1 부분은 상기 제1 부분의 외주면을 따라 형성되는 홈을 구비하여 상기 방수 부재의 일부분(475a)이 상 기 홈에 수용될 수 있다. 그리고, 상기 방수 부재는 상기 홈에 수용되는 제1 돌출부(475a) 및 상기 제1 돌 출부(475a)로부터 연장되어 돌출 형성되는 제2 돌출부(475b)를 구비할 수 있다. 상기 제2 돌출부(475b)는 상기 제2 오프닝의 내벽에 밀착되어 상기 제2 오프닝을 통해 외부로부터 상기 하우징의 내부로 물 등 이물질이 유입되는 것을 방지할 수 있다. 본 발명의 다양한 실시예에 따른 전자 장치의 트레이가 하우징에서 배출되는 방법(S10)은 상기 제2 오프닝(41 2)에 상기 외부 부재를 삽입시키는 동작(S11), 상기 외부 부재를 이용하여 상기 제1 부분(예: 핀 )에 힘을 인가하는 동작(S12), 상기 제1 부분(예: 핀)이 상기 제2 오프닝에서 이동하는 동작(S13), 상기 제1 부분이 상기 제2 멤버에 힘을 인가하여 상기 제2 멤버가 상기 트레이에 힘을 직 접적으로 또는 간접적으로 인가하는 동작(S14) 및 상기 트레이를 상기 하우징의 외부로 배출시키는 동작(S15)을 포함할 수 있다. 상기 제2 오프닝에 상기 외부 부재를 삽입시키는 동작(S11)은 외부 부재가 상기 트레이의 헤드 에 형성된 트레이 홈을 경유하여 상기 제2 오프닝에 삽입되는 동작일 수 있다. 상기 외부 부재를 이용하여 상기 제1 부분에 힘을 인가하는 동작(S12)은 상기 외부 부재가 상기 제1 방향(①)으로 상기 방수 부재에 힘을 가하는 동작일 수 있다. 상기 제1 부분이 상기 제2 오프닝에서 이동하는 동작(S13)는 상기 제2 돌출부(475b)가 상기 제2 오프닝 의 내벽에 밀착된 상태로 이동되는 동작으로서, 상기 제2 돌출부(475b)가 상기 제2 오프닝의 내벽에 밀착된 상태로 이동되더라도 상기 제2 돌출부(475b)가 상기 제1 돌출부(475a)와 일체로 구비되어 상기 홈에서 이탈되지 않고 상기 제1 부분에 견고하게 결합될 수 있다. 상기 제2 멤버가 상기 트레이에 힘을 인가하는 동작(S14)은 상기 외부 부재로부터 힘을 전달받 은 상기 제1 부분이 상기 제2 멤버에 힘을 전달한 후, 상기 제1 부분로부터 힘을 전달받은 제2 멤버가 상기 트레이를 상기 제1 방향의 반대방향인 제2 방향(예: 상기 하우징의 외측방향)으로 상기 트레이에 힘을 인가하는 동작일 수 있다. 또한, 본 발명의 다양한 실시예에 따르면, 상기 제2 멤버 가 상기 트레이에 힘을 직접적으로 인가하는 동작에 한정되지 않고, 상기 제2 멤버와 상기 트레 이 사이에 매개체(예: 후술할 회동부)가 구비되어 상기 제2 멤버가 상기 매개체를 통해 간접적으로 상기 트레이에 힘을 인가할 수 있다. 상기 트레이를 상기 하우징의 외부로 배출시키는 동작(S15)는 상기 제2 멤버로부터 힘을 인가받 은 트레이가 상기 제2 방향으로 배출되는 동작일 수 있다. 이와 같이, 본 발명의 다양한 실시예에 따른 전자 장치는 제1 부분이 상기 제2 오프닝을 밀봉하여 외 부로부터 이물질의 유입을 차단하면서 아울러 상기 제2 오프닝을 통해 이동하여 상기 트레이가 상기 하우징에서 배출되는 힘을 전달하는 역할을 수행할 수 있다. 도 27은 본 발명의 다양한 실시예 중 또 다른 하나에 따른 전자 장치의 제1 부분을 나타내는 단면도이다. 도 28 은 도 27에 도시된 제1 부분이 제2 오프닝에 삽입된 모습을 나타내는 단면도이다. 도 27 및 도 28을 참조하면, 본 발명의 다양한 실시예 중 또 다른 하나에 따른 전자 장치는 하우징, 제1 부분 및 제2 멤버를 포함할 수 있다. 본 실시예를 설명함에 있어, 선행 실시예와 유사한 및/또는 선 행 실시예를 통해 용이하게 이해될 수 있는 구성요소들에 대해서는 도면의 참조번호를 동일하게 부여하거나 생 략하고, 그 상세한 설명 또한 생략될 수 있다. 상기 제1 부분은 홈, 제 2 단부 및 방수 부재를 구비할 수 있다. 상기 방수 부재는 실리콘 재질로 이루어질 수 있다. 또한, 상기 링의 단면은 원통 형상으로 이루어질 수 있다. 상기 제1 부분이 상기 제2 오프닝에 삽입된 상태에서, 상기 방수 부재는 상기 제2 오프닝의 내벽과 밀착되어 상기 제2 오프닝으로부터 이물질이 상기 하우징의 내부로 유입되는 것을 방지할 수 있다. 도 29는 본 발명의 다양한 실시예 중 또 다른 하나에 따른 전자 장치의 핀을 나타내는 단면도이다. 도 29를 참조하면, 본 발명의 다양한 실시예 중 또 다른 하나에 따른 전자 장치는 베젤, 핀, 제2 멤 버 및 방수 부재를 포함할 수 있다. 본 실시예를 설명함에 있어, 선행 실시예와 유사한 및/또는 선행 실시예를 통해 용이하게 이해될 수 있는 구성요소들에 대해서는 도면의 참조번호를 동일하게 부여하거나 생략하 고, 그 상세한 설명 또한 생략될 수 있다 상기 핀은 제2 오프닝에 삽입되어 제1 방향(①)의 외력을 전달받아 상기 제2 멤버에 외력을 전 달할 수 있다. 상기 방수 부재는 상기 제2 오프닝의 내벽에 구비될 수 있다. 상기 제2 오프닝의 내벽에는 그루 브가 형성되고, 상기 방수 부재의 일부분이 상기 그루브에 수용될 수 있다. 상기 방수 부재는 상기 그루브에 수용되어 상기 제2 오프닝의 내벽에 결합되는 제1 방수 구조와 상기 제1 방수 구조 로부터 연장되어 돌출 형성된 제2 방수 구조를 구비할 수 있다. 상기 제2 방수 구조는 상기 제1 방수 구조와 일체로 형성되고, 상기 핀의 외주면을 따라 밀착될 수 있다. 도 30은 본 발명의 다양한 실시예 중 또 다른 하나에 따른 전자 장치의 제1 부분을 나타내는 단면도이다. 본 실 시예를 설명함에 있어, 선행 실시예와 유사한 및/또는 선행 실시예를 통해 용이하게 이해될 수 있는 구성요소들 에 대해서는 도면의 참조번호를 동일하게 부여하거나 생략하고, 그 상세한 설명 또한 생략될 수 있다 도 30을 참조하면, 본 발명의 다양한 실시예 중 또 다른 하나에 따른 전자 장치의 방수 부재(608a)는 제1 방수 구조(681a) 및 제2 방수 구조(683b)를 구비하고, 상기 제2 오프닝의 내측단에 구비될 수 있다. 상기 방수 부재(608a)가 상기 제2 오프닝의 내측단에 구비됨에 따라, 상기 제1 방수 구조(681a)를 수용하는 그루브를 제작하기 용이할 수 있다. 도 31은 본 발명의 다양한 실시예 중 또 다른 하나에 따른 전자 장치의 방수 부재를 나타내는 단면도이다. 본 실시예를 설명함에 있어, 선행 실시예와 유사한 및/또는 선행 실시예를 통해 용이하게 이해될 수 있는 구성요소 들에 대해서는 도면의 참조번호를 동일하게 부여하거나 생략하고, 그 상세한 설명 또한 생략될 수 있다 도 31을 참조하면, 본 발명의 다양한 실시예 중 또 다른 하나에 따른 전자 장치는 하우징, 핀, 제2 멤버 및 방수 부재를 포함할 수 있다. 상기 방수 부재는 상기 제2 오프닝의 내벽에 인접하게 구비될 수 있다. 상기 방수 부재는 상기 제2 오프닝의 입구에 부착되는 제1 방수 구조 및 상기 제1 방수 구조로부터 연장되어 돌출 형성되는 제2 방수 구조를 구비할 수 있다. 상기 제2 방수 구조는 상기 핀의 외주면을 따라 밀착되어 상기 제 2 오프닝을 통해 상기 하우징의 내부로 유입되는 이물질을 차단할 수 있다. 이와 같이, 본 발명의 다양한 실시예에 따른 전자 장치의 방수 부재는 상기 제2 오프닝의 외측에 구비됨에 따라, 방수 부재의 파손시 방 수 부재의 교체가 용이할 수 있다. 도 32는 본 발명의 다양한 실시예 중 또 다른 하나에 따른 전자 장치의 회동부를 나타내는 평면도이다. 도 33은 도 32에 도시된 회동부가 회동하여 트레이가 배출되는 모습을 나타내는 평면도이다. 본 실시예를 설명함에 있어, 선행 실시예와 유사한 및/또는 선행 실시예를 통해 용이하게 이해될 수 있는 구성요소들에 대해서는 도면 의 참조번호를 동일하게 부여하거나 생략하고, 그 상세한 설명 또한 생략될 수 있다 도 32 및 도 33을 참조하면, 본 발명의 다양한 실시예에 따른 전자 장치는 제1 오프닝을 구비하는 하우징, 트레이, 핀 및 회동부를 포함할 수 있다. 상기 핀는 하우징에 형성된 제2 오프닝에 구비되어 상기 제2 오프닝의 일부분을 밀봉시킬 수 있다.상기 회동부는 상기 제2 오프닝과 상기 제1 오프닝 사이에 배치되고, 상기 회동부는 상기 핀에 걸리는 제1 회동 부분, 상기 제1 회동 부분와 연결되면서 상기 트레이의 일단에 걸리는 제2 회 동 부분 및 상기 제1 회동 부분와 상기 제2 회동 부분 사이에 배치되는 제3 회동 부분를 구비할 수 있다. 상기 제3 회동 부분는 상기 하우징에서 회전 가능하게 결합되어 상기 제1, 3 회동부가 상기 제3 회동 부분를 중심으로 회동될 수 있다. 외부 부재(미도시)가 상기 제1 방향(①)으로 상기 제2 오프닝에 삽입되면, 상기 외부 부재가 상기 핀(80 7)을 가압하여 상기 핀이 상기 제2 오프닝에서 이동될 수 있다. 그리고, 상기 핀은 상기 제1 회 동 부분에 걸려 상기 제1 회동 부분를 상기 제3 회동 부분에 대해 회동시킬 수 있다. 이때, 상 기 제3 회동 부분는 상기 트레이의 일단에 힘을 가하게 되어 상기 트레이가 상기 제2 방향(②) 으로 이동될 수 있다. 상술한 바와 같이, 본 문서에 개시된 다양한 실시예에 따르면, 휴대용 전자 장치(예: 도 1 내지 도 3, 도 4 내 지 도 7의 전자 장치(100, 200, 11, 12, 13, 300))는, 측벽(예: 도 1 또는 도 2의 베젤)을 관통하게 형성 된 제1 오프닝(예: 도 5의 제1 오프닝)과, 상기 제1 오프닝에 인접하게 배치되며 상기 측벽을 관통하게 형 성된 제2 오프닝(예: 도 5의 제2 오프닝)을 포함하는 하우징(예: 도 1 또는 도 2에서, 적어도 유리 커버 과 베젤이 조합된 구조물); 상기 제1 오프닝을 통해 상기 하우징에 착탈 가능하게 결합하는 트레이 구조(예: 도 5의 트레이 구조)로서, 상기 제2 오프닝에 상응하게 정렬되도록 형성된 트레이 홀(예: 도 8의 트레이 홀)을 포함하는 상기 트레이 구조; 및 적어도 부분적으로 상기 제2 오프닝의 내부로 배치된 밀봉 부재(예: 도 10의 방수 부재 또는 밀봉 부재)를 포함하고, 상기 밀봉 부재는, 적어도 부분적으로 상기 제2 오프닝에 삽입되는 연장부(extending portion)(예: 도 10의 제1 부분)로서, 제1 단부와, 상기 제1 단부에 대향하는(opposite to) 제2 단부를 포함하는 상기 연장부; 상기 제2 단부에 형성되어 상기 제2 오프닝을 통해 상기 연장부가 상기 하우징으로부터 이탈하는 것을 방지하며, 상 기 연장부보다 더 큰 직경을 가지는 걸림턱(stopping portion)(예: 도 10의 제2 단부 형상); 및 상기 제1 단부와 상기 제2 단부 사이에서 상기 연장부의 외측면(outer surface)에 배치되며 상기 제2 오프닝을 밀봉하는 적어도 하나의 제1 밀봉부(예: 도 10 또는 도 25의 돌출부(375, 475))를 포함할 수 있다. 다양한 실시예에 따르면, 상기 밀봉 부재는 상기 연장부에 형성된 적어도 하나의 홈(예: 도 25의 제1 부분 외주면에 형성되며, 돌출부의 일부를 수용하는 홈)을 더 포함하고, 상기 적어도 하나의 제1 밀봉부가 부분 적으로 상기 적어도 하나의 홈 내에 배치될 수 있다. 다양한 실시예에 따르면, 상기 적어도 하나의 제1 밀봉부는, 상기 적어도 하나의 홈 내에 배치된 제1 구조물(예: 도 25의 제1 돌출부(475a)); 및 상기 제1 구조물의 외측면에서 돌출되어 상기 제2 오프닝의 내측면 에 접촉하는 제2 구조물(예: 도 25의 제2 돌출부(475b))을 포함할 수 있다. 다양한 실시예에 따르면, 상기 제1 구조물의 외측면이 상기 연장부의 외측면과 일치(도 10 또는 도 25 참조)될 수 있다. 다양한 실시예에 따르면, 상기 적어도 하나의 홈은 상기 연장부의 원주 방향을 따라 연장될 수 있다. 다양한 실시예에 따르면, 상기 적어도 하나의 제1 밀봉부의 다른 일부(예: 도 25의 제2 돌출부(475b))가 상기 제2 오프닝의 내측면에 접촉할 수 있다. 다양한 실시예에 따르면, 상기 적어도 하나의 제1 밀봉부는 링 형상으로 형성될 수 있다. 다양한 실시예에 따르면, 상기와 같은 휴대용 전자 장치는, 상기 제1 오프닝에 대응하도록 상기 하우징 내부에 배치되어, 상기 제1 오프닝을 통해 상기 하우징으로 삽입된 상기 트레이 구조의 일부를 수용하는 소켓(예: 도 6 또는 도 7의 제1 멤버); 및 상기 소켓에 인접하면서 상기 제2 오프닝에 대응하도록 상기 하우징 내부에 배 치된 릴리즈(release)(예: 도 6 또는 도 7의 제2 멤버)를 더 포함하고, 상기 걸림턱은 상기 측벽의 내측면 과 상기 릴리즈 사이에 배치(도 25 참조)될 수 있다. 다양한 실시예에 따르면, 상기 밀봉 부재는 상기 트레이 홀을 통해 상기 제1 단부로 가해지는 외부의 힘에 의해 상기 릴리즈를 가압하도록 설정될 수 있다. 다양한 실시예에 따르면, 상기 릴리즈는 상기 밀봉 부재의 이동에 따라 상기 소켓에 수용된 상기 트레이 구조를 배출하도록 설정될 수 있다. 다양한 실시예에 따르면, 상기 제2 오프닝은 적어도 상기 밀봉 부재가 이동하는 거리, 다시 말해서, 상기 소켓 에 수용된 상기 트레이 구조를 배출하기 위해 상기 밀봉 부재가 이동하는 거리에 상응하는 길이를 가질 수 있다. 다양한 실시예에 따르면, 상기 밀봉 부재는, 상기 측벽의 내측면과 상기 릴리즈 사이의 거리보다 더 큰 길이를 가지게 형성될 수 있다. 다양한 실시예에 따르면, 상기 트레이 구조는, 적어도 하나의 저장 매체를 수용하며, 상기 제1 오프닝을 통해 상기 하우징의 내부로 삽입되는 수용부(예: 도 8 또는 도 9의 수용부); 상기 수용부와 상기 트레이 구조의 한 단부(예: 도 8 또는 도 9의 일단) 사이에서 연장되며, 적어도 부분적으로 상기 제1 오프닝에 수용되는 연장 구조물(예: 도 19의 트레이 방수 부재가 배치된 부분); 및 상기 연장 구조물의 외측면에 배치되어 상 기 제1 오프닝을 밀봉하는 적어도 하나의 제2 밀봉부(예: 도 19의 트레이 방수 부재)를 포함할 수 있다. 다양한 실시예에 따르면, 상기 트레이 구조는 상기 한 단부에 배치된 전면 커버부(예: 도 8 또는 도 9의 일단 의 형상 구조물)를 더 포함하고, 상기 트레이 홀이 상기 전면 커버부에 형성될 수 있다. 다양한 실시예에 따르면, 상기 적어도 하나의 제2 밀봉부의 일부가 상기 제1 오프닝의 내측면에 접촉할 수 있다. 다양한 실시예에 따르면, 상기 제2 오프닝은 상기 제1 오프닝보다 작게 형성(도 5 참조)될 수 있다. 다양한 실시예에 따르면, 상기 밀봉 부재는 상기 제2 오프닝의 길이 방향을 따라 이동할 수 있다. 다양한 실시예에 따르면, 상기 걸림턱은 상기 측벽의 내측면에 간섭되어 상기 연장부가 상기 제2 오프닝을 통해 상기 하우징으로부터 이탈하는 것을 방지할 수 있다. 다양한 실시예에 따르면, 상기 트레이 구조는 일단에 배치된 전면 커버부를 더 포함하고, 상기 트레이 홀이 상 기 전면 커버부에 형성되며, 상기 측벽은 홈부(recessed portion)를 포함함으로써, 상기 트레이 구조가 상기 하 우징으로 삽입된 상태에서 상기 홈부에 상기 전면 커버부를 수용하며, 상기 제1 오프닝과 상기 제2 오프닝이 상 기 홈부 내에 배치될 수 있다. (도 1, 도 2 및/또는 도 5 참조) 다양한 실시예에 따르면, 상기 전면 커버부는, 그 둘레(side periphery)의 크기(outer dimension)가 상기 제1 오프닝보다 크게 형성되고, 상기 트레이 구조가 상기 하우징으로 삽입된 상태에서 상기 전면 커버부가 상기 홈 부 내에 배치될 수 있다. 다양한 실시예에 따르면, 상기 트레이 구조가 상기 하우징으로 삽입된 상태에서, 상기 전면 커버부의 외측면이 상기 측벽의 외측면과 일치될 수 있다.(may be flush with)(예: 도 1 참조) 본 문서에 개시된 다양한 실시예에 따르면, 휴대용 전자 장치는, 측벽과, 상기 측벽을 관통하게 형성된 제1 오 프닝과, 상기 측벽을 관통하게 형성되며 상기 제1 오프닝에 인접하게 배치된 제2 오프닝을 포함하는 하우징; 상 기 제1 오프닝을 통해 상기 하우징의 착탈 가능하게 결합하는 트레이 구조; 및 적어도 부분적으로 상기 제2 오 프닝 내에 배치된 제1 밀봉 부재(예: 도 10의 방수 부재 또는 밀봉 부재)를 포함하고, 상기 제1 밀봉 부재는, 적어도 부분적으로 상기 제2 오프닝에 삽입되는 연장부(extending portion)로서, 제1 단 부와, 상기 제1 단부에 대향하는(opposite to) 제2 단부를 포함하는 상기 연장부; 상기 제2 단부에 형성되어 상 기 제2 오프닝을 통해 상기 연장부가 상기 하우징으로부터 이탈하는 것을 방지하며, 상기 연장부보다 더 큰 직 경을 가지는 걸림턱(stopping portion); 및 상기 제1 단부와 상기 제2 단부 사이에서 상기 연장부의 외측면 (outer surface)에 배치되며 상기 제2 오프닝을 밀봉하는 적어도 하나의 밀봉부(예: 도 10 또는 도 25의 돌출부 (375, 475))를 포함할 수 있다. 다양한 실시예에 따르면, 상기 제1 밀봉 부재는 상기 연장부에 형성된 적어도 하나의 홈을 더 포함하고, 상기 제1 밀봉 부재의 일부가 상기 적어도 하나의 홈에 배치될 수 있다. 다양한 실시예에 따르면, 상기 적어도 하나의 밀봉부는, 상기 적어도 하나의 홈 내에 배치된 제1 구조물; 및 상 기 제1 구조물의 외측면에서 돌출되어 상기 제2 오프닝의 내측면과 접촉하는 제2 구조물을 포함할 수 있다. 다양한 실시예에 따르면, 상기 제1 구조물의 외측면이 상기 연장부의 외측면과 일치될 수 있다. 다양한 실시예에 따르면, 상기 적어도 하나의 홈은 상기 연장부의 원주 방향을 따라 연장될 수 있다. 다양한 실시예에 따르면, 상기 적어도 하나의 밀봉부의 다른 일부가 상기 제2 오프닝의 내측면에 접촉할 수 있 다. 다양한 실시예에 따르면, 상기 적어도 하나의 밀봉부는 링 형상으로 형성될 수 있다. 다양한 실시예에 따르면, 상기와 같은 휴대용 전자 장치는, 상기 제1 오프닝에 대응하도록 상기 하우징 내부에 배치되어, 상기 제1 오프닝을 통해 상기 하우징으로 삽입된 상기 트레이 구조의 일부를 수용하는 소켓; 및 상기 소켓에 인접하면서 상기 제2 오프닝에 대응하도록 상기 하우징 내부에 배치된 릴리즈(release)를 더 포함하고, 상기 걸림턱은 상기 측벽의 내측면과 상기 릴리즈 사이에 배치될 수 있다. 다양한 실시예에 따르면, 상기 제1 밀봉 부재는 상기 제1 단부로 가해지는 외부의 힘에 의해 상기 릴리즈를 가 압하도록 설정될 수 있다. 다양한 실시예에 따르면, 상기 릴리즈는 상기 제1 밀봉 부재의 이동에 따라 상기 소켓에 수용된 상기 트레이 구 조를 배출하도록 설정될 수 있다. (may be configured to release) 다양한 실시예에 따르면, 상기 제2 오프닝은 적어도 상기 밀봉 부재가 이동하는 거리, 다시 말해서, 상기 소켓 에 수용된 상기 트레이 구조를 배출하기 위해 상기 제1 밀봉 부재가 이동하는 거리에 상응하는 길이를 가질 수 있다. 다양한 실시예에 따르면, 상기 제1 밀봉 부재는, 상기 측벽의 내측면과 상기 릴리즈 사이의 거리보다 더 큰 길 이를 가지게 형성될 수 있다. 다양한 실시예에 따르면, 상기와 같은 휴대용 전자 장치는, 상기 트레이 구조에 배치되어 상기 제1 오프닝을 밀 봉하는 제2 밀봉 부재(예: 도 19의 트레이 방수 부재)를 더 포함할 수 있다. 다양한 실시예에 따르면, 상기 트레이 구조는, 적어도 하나의 저장 매체를 수용하며, 상기 제1 오프닝을 통해 상기 하우징의 내부로 삽입되는 수용부; 및 상기 수용부와 상기 트레이 구조의 한 단부 사이에서 연장되며, 적 어도 부분적으로 상기 제1 오프닝에 수용되는 연장 구조물을 포함하고, 상기 제2 밀봉 부재가 상기 연장 구조물 의 외측면에 배치될 수 있다. 다양한 실시예에 따르면, 상기 제2 오프닝은 상기 제1 오프닝보다 작게 형성될 수 있다. 다양한 실시예에 따르면, 상기 제1 밀봉 부재는 상기 제2 오프닝의 길이 방향을 따라 이동할 수 있다. 다양한 실시예에 따르면, 상기 걸림턱은 상기 측벽의 내측면에 간섭되어 상기 연장부가 상기 제2 오프닝을 통해 상기 하우징으로부터 이탈하는 것을 방지할 수 있다. 그리고, 본 발명의 다양한 실시예는 개시된, 기술 내용의 설명 및 이해를 위해 제시된 것이며, 기재된 기술의 범위를 한정하는 것은 아니다. 따라서, 본 발명의 범위는, 본 발명의 기술적 사상에 근거한 모든 변경 또는 다 양한 다른 실시예를 포함하는 것으로 해석되어야 한다."}
{"patent_id": "10-2020-0015417", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 다양한 실시예 중 하나에 따른 전자 장치를 나타내는 사시도이다. 도 2는 도 1에 도시된 전자 장치의 제2 오프닝에 외부 부재가 삽입되어 트레이가 외부로 배출되는 모습을 나타 내는 사시도이다. 도 3은 본 발명의 다양한 실시예 중 다른 하나에 따른 전자 장치를 나타내는 사시도이다. 도 4는 본 발명의 다양한 실시예에 따른 전자 장치를 포함하는 네크워크 환경을 나타내는 도면이다. 도 5은 본 발명의 다양한 실시예 중 또 다른 하나에 따른 전자 장치를 나타내는 분리 사시도이다. 도 6은 본 발명의 다양한 실시예 중 또 다른 하나에 따른 전자 장치의 트레이가 제1 멤버에 분리된 모습을 나타 내는 사시도이다. 도 7은 본 발명의 다양한 실시예 중 또 다른 하나에 따른 전자 장치의 트레이가 제1 멤버에 장착되는 모습을 나 태는 사시도이다. 도 8은 본 발명의 다양한 실시예 중 또 다른 하나에 따른 전자 장치의 트레이를 나타내는 사시도이다. 도 9는 본 발명의 다양한 실시예 중 또 다른 하나에 따른 전자 장치의 트레이를 나타내는 평면도이다. 도 10은 본 발명의 다양한 실시예 중 또 다른 하나에 따른 전자 장치의 제1 부분을 나타내는 사시도이다. 도 11은 본 발명의 다양한 실시예 중 또 다른 하나에 따른 전자 장치의 제1 부분을 나타내는 측면도이다.도 12는 본 발명의 다양한 실시예 중 또 다른 하나에 따른 전자 장치의 제1 부분을 다른 방향에서 바라본 측면 도이다. 도 13은 본 발명의 다양한 실시예 중 또 다른 하나에 따른 전자 장치의 제1 부분이 제2 오프닝에 조립되기 전의 모습을 나타내는 사시도이다. 도 14는 본 발명의 다양한 실시예 중 또 다른 하나에 따른 전자 장치의 제1 멤버와 회로 기판을 나타내는 사시 도이다. 도 15는 도 14에 도시된 제1 멤버와 회로 기판이 베젤에 장착된 모습을 나타내는 사시도이다. 도 16은 도 14에 도시된 제1 멤버에 트레이가 수납되기 전의 모습을 나타내는 사시도이다. 도 17은 도 14에 도시된 제1 멤버에 트레이가 수납된 상태를 나타내는 사시도이다. 도 18은 본 발명의 다양한 실시예 중 또 다른 하나에 따른 전자 장치의 제1 멤버와 트레이를 나타내는 평면도이 다. 도 19는 도 18에 도시된 트레이를 나타내는 사시도이다. 도 20은 도 18에 도시된 트레이가 베젤에 수납된 상태를 나타내는 단면도이다. 도 21은 도 18에 도시된 트레이가 베젤에 수납된 상태를 나타내는 평면도이다. 도 22는 본 발명의 다양한 실시예 중 또 다른 하나에 따른 전자 장치의 의 제2 오프닝에 제1 부분이 조립되는 모습을 나타내는 사시도이다. 도 23은 도 22에 도시된 전자 장치의 제2 오프닝에 제1 부분이 삽입된 모습을 나타내는 사시도이다. 도 24는 도 22에 도시된 전자 장치의 제2 오프닝에 제1 부분이 삽입된 모습을 나타내는 단면 사시도이다. 도 25는 도 22에 도시된 전자 장치의 제2 오프닝에 제1 부분이 삽입된 모습을 나타내는 단면도이다. 도 26은 본 발명의 다양한 실시예 중 또 다른 하나에 따른 전자 장치의 트레이가 베젤에서 배출되는 과정을 나 타내는 순서도이다. 도 27은 본 발명의 다양한 실시예 중 또 다른 하나에 따른 전자 장치의 제1 부분을 나타내는 단면도이다. 도 28은 도 27에 도시된 제1 부분이 제2 오프닝에 삽입된 모습을 나타내는 단면도이다. 도 29는 본 발명의 다양한 실시예 중 또 다른 하나에 따른 전자 장치의 제1 부분을 나타내는 단면도이다. 도 30은 본 발명의 다양한 실시예 중 또 다른 하나에 따른 전자 장치의 제1 부분을 나타내는 단면도이다. 도 31은 본 발명의 다양한 실시예 중 또 다른 하나에 따른 전자 장치의 제1 부분을 나타내는 단면도이다. 도 32는 본 발명의 다양한 실시예 중 또 다른 하나에 따른 전자 장치의 회동부를 나타내는 평면도이다. 도 33은 도 32에 도시된 회동부가 회동하여 트레이가 배출되는 모습을 나타내는 평면도이다."}
