{"patent_id": "10-2019-0149418", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0061629", "출원번호": "10-2019-0149418", "발명의 명칭": "멀티 캐패시터 기반의 인공신경망 동작 방법 및 이를 위한 장치", "출원인": "한국전자통신연구원", "발명자": "김용주"}}
{"patent_id": "10-2019-0149418", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인공신경망 디바이스가, 에너지 하베스팅 모듈을 기반으로 전력을 생성하고, 멀티 캐패시터를 기반으로 상기 전력을 저장하는 단계;상기 인공신경망 디바이스가, 무선 네트워크를 기반으로 내부에 구비된 뉴로모픽 컴퓨팅 모듈과 외부 뉴로모픽시스템 사이에 스파이크(SPIKE) 신호를 송수신하는 단계; 및상기 인공신경망 디바이스가, 상기 멀티 캐패시터를 구성하는 복수개의 캐패시터들 중 일부를 사용하여 상기 뉴로모픽 컴퓨팅 모듈을 구성하는 전체 뉴런들 중 상기 스파이크 신호를 수신한 일부 뉴런에게만 전력을 제공하는단계를 포함하는 것을 특징으로 하는 멀티 캐패시터 기반의 인공신경망 동작 방법."}
{"patent_id": "10-2019-0149418", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "멀티 캐패시터 기반의 인공신경망 동작 방법 및 이를 위한 장치가 개시된다. 본 발명의 일실시예에 따른 인공신 경망 동작 방법은 인공신경망 디바이스가, 에너지 하베스팅 모듈을 기반으로 전력을 생성하고, 멀티 캐패시터를 기반으로 상기 전력을 저장하는 단계; 상기 인공신경망 디바이스가, 무선 네트워크를 기반으로 내부에 구비된 뉴 로모픽 컴퓨팅 모듈과 외부 뉴로모픽 시스템 사이에 스파이크(SPIKE) 신호를 송수신하는 단계; 및 상기 인공신경 망 디바이스가, 상기 멀티 캐패시터를 구성하는 복수개의 캐패시터들 중 일부를 사용하여 상기 뉴로모픽 컴퓨팅 모듈을 구성하는 전체 뉴런들 중 상기 스파이크 신호를 수신한 일부 뉴런에게만 전력을 제공하는 단계를 포함한 다."}
{"patent_id": "10-2019-0149418", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 멀티 캐패시터를 이용한 인공신경망 디바이스와 그 동작 방법에 관한 것으로, 특히 인공지능 분야에 서 멀티 캐패시터를 기반으로 초저전력으로 동작 가능한 두뇌모사 하드웨어 시스템을 구성하는 기술에 관한 것 이다."}
{"patent_id": "10-2019-0149418", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근에 많이 연구되고 있는 인공지능 분야는 약인공지능과 강인공지능으로 세분화할 수 있다. 약인공지능은 어 떤 특정한 한가지 분야의 주어진 일을 인간의 지시에 따라 수행하는 인공지능을 의미하는데 요즘에 많이 연구되 고 있는 DNN(Deep Neural Network)가 약인공지능 방식에 해당한다. 강인공지능의 대표적인 연구분야로는 뉴로모 픽 컴퓨팅이 있다. 뉴로모픽 컴퓨팅은 뇌의 동작 방식을 하드웨어 형태로 모방하여 만든 회로를 통해 인간의 뇌 기능을 모사하려는 공학 분야에 해당한다. 이렇게 만들어진 회로를 뉴로모픽 회로라고 부르며, 이러한 뉴로모픽 회로를 사용하여 인공지능을 수행하는 것을 뉴로모픽 컴퓨팅이라고 한다. 뉴로모픽 컴퓨팅 방식은 회로 자체가 뉴런과 시냅스만으로 구성되기 때문에 기존의 머신러닝 방법보다 적은 면 적에서 저전력으로 높은 인공지능 시스템을 구현할 수 있다. 즉, 머신러닝은 뇌의 동작을 추상화시켜 CPU나 GPU 에서 전체를 동작시키는 방식이지만, 뉴로모픽 컴퓨팅은 인간의 뇌를 모사하여 구비된 뉴런 세포들 중 입력 신 호에 반응하는 뉴런 부분만 동작시키는 방식이므로, 머신러닝에 비해 전력소모가 훨씬 적을 것으로 예상한다. 이러한 뉴로모픽 컴퓨팅 시스템은 하드웨어적으로 다양한 형태로 연구 및 개발되고 있다. 이러한 하드웨어들은 두뇌를 최대한 비슷하게 모사하면서도 전력 소모와 성능 관점에서 효율적으로 동작하도록 구현된다. 하지만, 이 런 결과물들은 단순히 뉴런과 시냅스를 하드웨어적으로 잘 구현하는 데에만 집중하고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국 공개 특허 제10-2018-0028966호, 2018년 3월 19일 공개(명칭: 신경망 하드웨어 가속기 아 키텍처 및 그 동작 방법)"}
{"patent_id": "10-2019-0149418", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 다른 신경망과 자유롭게 협업 가능하여 대규모 신경망 구축이 가능한 초저전력의 협업 인공신 경망 디바이스 구조를 제안하는 것이다. 또한, 본 발명의 목적은 공간적인 제약이 없고 외부에서 전력을 공급받지 않아도 자가발전으로 동작함으로써 어 느 곳에나 적용할 수 있는 인공신경망 디바이스를 제공하는 것이다. 또한, 본 발명의 목적은 자체적으로 측정한 가공되지 않은 데이터를 내부 신경망에서 일차적으로 처리하고, 네 트워크를 통해 2차 신경망에 전달함으로써 전체 시스템의 오버헤드를 줄일 수 있는 인공신경망 디바이스를 제공 하는 것이다."}
{"patent_id": "10-2019-0149418", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 목적을 달성하기 위한 본 발명에 따른 멀티 캐패시터 기반의 인공신경망 동작 방법은 인공신경망 디바이 스가, 에너지 하베스팅 모듈을 기반으로 전력을 생성하고, 멀티 캐패시터를 기반으로 상기 전력을 저장하는 단 계; 상기 인공신경망 디바이스가, 무선 네트워크를 기반으로 내부에 구비된 뉴로모픽 컴퓨팅 모듈과 외부 뉴로 모픽 시스템 사이에 스파이크(SPIKE) 신호를 송수신하는 단계; 및 상기 인공신경망 디바이스가, 상기 멀티 캐패 시터를 구성하는 복수개의 캐패시터들 중 일부를 사용하여 상기 뉴로모픽 컴퓨팅 모듈을 구성하는 전체 뉴런들 중 상기 스파이크 신호를 수신한 일부 뉴런에게만 전력을 제공하는 단계를 포함한다. 이 때, 복수개의 캐패시터들은 각각 용량이 상이할 수 있다. 이 때, 전력을 제공하는 단계는 상기 복수개의 캐패시터들 중 상기 일부 뉴런을 동작하는데 필요한 필요 전력에 상응하는 용량을 갖는 일부 캐패시터를 선택하여 사용할 수 있다. 이 때, 뉴로모픽 컴퓨팅 모듈은 상기 외부 뉴로모픽 시스템과 연결되어 대규모 협업 신경망을 구성할 수 있다. 이 때, 뉴로모픽 컴퓨팅 모듈은 상기 인공신경망 디바이스에 구비된 센서 및 액츄에이터 중 적어도 하나와 연결 되어 소규모 신경망으로 동작할 수 있다. 이 때, 스파이크 신호를 송수신하는 단계는 상기 뉴로모픽 컴퓨팅 모듈에서 상기 스파이크 신호를 생성하여 상 기 외부 뉴로모픽 시스템으로 송신하는 경우, 상기 무선 네트워크의 활성화 여부에 따라 상기 스파이크 신호를 비휘발성 버퍼에 저장하는 단계; 및 상기 무선 네트워크가 활성화되는 시점에 상기 스파이크 신호를 상기 외부 뉴로모픽 시스템으로 송신하는 단계를 포함할 수 있다. 또한, 본 발명의 일실시예에 따른 인공신경망 디바이스는, 에너지 하베스팅 모듈을 기반으로 전력을 생성하고, 멀티 캐패시터를 기반으로 상기 전력을 저장하고, 무선 네트워크 모듈을 기반으로 뉴로모픽 컴퓨팅 모듈과 외부 뉴로모픽 시스템 사이에 스파이크(SPIKE) 신호를 송수신하고, 상기 멀티 캐패시터를 구성하는 복수개의 캐패시 터들 중 일부를 사용하여 상기 뉴로모픽 컴퓨팅 모듈을 구성하는 전체 뉴런들 중 상기 스파이크 신호를 수신한 일부 뉴런에게만 전력을 제공하는 프로세서; 및 상기 스파이크 신호를 일시적으로 저장하는 비휘발성 버퍼를 포 함한다. 이 때, 복수개의 캐패시터들은 각각 용량이 상이할 수 있다. 이 때, 프로세서는 상기 복수개의 캐패시터들 중 상기 일부 뉴런을 동작하는데 필요한 필요 전력에 상응하는 용 량을 갖는 일부 캐패시터를 선택하여 사용할 수 있다. 이 때, 뉴로모픽 컴퓨팅 모듈은 상기 외부 뉴로모픽 시스템과 연결되어 대규모 협업 신경망을 구성할 수 있다. 이 때, 뉴로모픽 컴퓨팅 모듈은 상기 인공신경망 디바이스에 구비된 센서 및 액츄에이터 중 적어도 하나와 연결 되어 소규모 신경망으로 동작할 수 있다. 이 때, 프로세서는 상기 뉴로모픽 컴퓨팅 모듈에서 상기 스파이크 신호를 생성하여 상기 외부 뉴로모픽 시스템 으로 송신하는 경우, 상기 무선 네트워크의 활성화 여부에 따라 상기 스파이크 신호를 비휘발성 버퍼에 저장하 고, 상기 무선 네트워크가 활성화되는 시점에 상기 스파이크 신호를 상기 외부 뉴로모픽 시스템으로 송신할 수 있다."}
{"patent_id": "10-2019-0149418", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 다른 신경망과 자유롭게 협업 가능하여 대규모 신경망 구축이 가능한 초저전력의 협업 인공 신경망 디바이스 구조를 제안할 수 있다. 또한, 본 발명은 공간적인 제약이 없고 외부에서 전력을 공급받지 않아도 자가발전으로 동작함으로써 어느 곳에 나 적용할 수 있는 인공신경망 디바이스를 제공할 수 있다. 또한, 본 발명은 자체적으로 측정한 가공되지 않은 데이터를 내부 신경망에서 일차적으로 처리하고, 네트워크를 통해 2차 신경망에 전달함으로써 전체 시스템의 오버헤드를 줄일 수 있는 인공신경망 디바이스를 제공할 수 있 다."}
{"patent_id": "10-2019-0149418", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명을 첨부된 도면을 참조하여 상세히 설명하면 다음과 같다. 여기서, 반복되는 설명, 본 발명의 요지를 불 필요하게 흐릴 수 있는 공지 기능, 및 구성에 대한 상세한 설명은 생략한다. 본 발명의 실시형태는 당 업계에서 평균적인 지식을 가진 자에게 본 발명을 보다 완전하게 설명하기 위해서 제공되는 것이다. 따라서, 도면에서의 요소들의 형상 및 크기 등은 보다 명확한 설명을 위해 과장될 수 있다. 이하, 본 발명에 따른 바람직한 실시예를 첨부된 도면을 참조하여 상세하게 설명한다. 도 1은 본 발명의 일실시예에 따른 대규모 협업 신경망 시스템을 나타낸 도면이다. 도 1을 참조하면, 본 발명의 일실시예에 따른 대규모 협업 신경망 시스템은 본 발명에서 제안하는 인공신경망 디바이스가 네트워크를 기반으로 외부 뉴로모픽 시스템들(130-1~130-n)과 스파이크 신호를 송수신하 는 구조에 상응하게 구현될 수 있다. 이 때, 인공신경망 디바이스는 내부에 구비된 에너지 하베스팅 모듈을 기반으로 전력을 생성하고, 멀티 캐 패시터를 기반으로 전력을 저장할 수 있다. 또한, 인공신경망 디바이스는 네트워크 또는 무선 네트워크를 기반으로 내부에 구비된 뉴로모픽 컴퓨 팅 모듈과 외부 뉴로모픽 시스템(130-1~130-n) 사이에 스파이크(SPIKE) 신호를 송수신할 수 있다. 이 때, 뉴로모픽 컴퓨팅 모듈은 외부 뉴로모픽 시스템(130-1~130-n)과 연결되어 대규모 협업 신경망을 구 성할 수 있다. 이 때, 뉴로모픽 컴퓨팅 모듈에서 스파이크 신호를 생성하여 외부 뉴로모픽 시스템(130-1~130-n)으로 송신하는 경우, 무선 네트워크의 활성화 여부에 따라 스파이크 신호를 비휘발성 버퍼에 저장할 수 있다. 이 때, 무선 네트워크가 활성화되는 시점에 스파이크 신호를 외부 뉴로모픽 시스템(130-1~130-n)으로 송신할 수 있다. 이 때, 네트워크는 기존에 이용되는 네트워크 및 향후 개발 가능한 네트워크를 모두 포괄하는 개념이다. 예를 들면, 네트워크는 인터넷 프로토콜(IP)을 통하여 대용량 데이터의 송수신 서비스 및 끊기는 현상이 없는 데이터 서비스를 제공하는 아이피망, 아이피를 기반으로 서로 다른 망을 통합한 아이피망 구조인 올 아이피(All IP)망 등일 수 있으며, Wibro(Wireless Broadband)망, WCDMA를 포함하는 3세대 이동통신망, HSDPA(High Speed Downlink Packet Access)망 및 LTE 망을 포함하는 3.5세대 이동통신망, LTE advanced를 포함하는 4세대 이동통 신망, 위성통신망 및 와이파이(Wi-Fi)망 중에서 하나 이상을 결합하여 이루어질 수 있다.이 때, 뉴로모픽 컴퓨팅 모듈은 인공신경망 디바이스에 구비된 센서 및 액츄에이터 중 적어도 하나와 연결 되어 소규모 신경망으로 동작할 수도 있다. 또한, 인공신경망 디바이스는 멀티 캐패시터를 구성하는 복수개의 캐패시터들 중 일부를 사용하여 뉴로모 픽 컴퓨팅 모듈을 구성하는 전체 뉴런들 중 스파이크 신호를 수신한 일부 뉴런에게만 전력을 제공할 수 있다. 이 때, 복수개의 캐패시터들은 각각 용량이 상이할 수 있다. 이 때, 복수개의 캐패시터들 중 일부 뉴런을 동작하는데 필요한 필요 전력에 상응하는 용량을 갖는 일부 캐패시 터를 선택하여 사용할 수 있다. 이와 같이 본 발명에 따른 인공신경망 디바이스를 이용하여 대규모 협업 신경망 시스템을 구축함으로 서 저전력 및 저비용으로도 높은 인공지능 시스템을 구현할 수 있다. 도 2는 본 발명의 일실시예에 따른 멀티 캐패시터 기반의 인공신경망 동작 방법을 나타낸 동작 흐름도이다. 도 2를 참조하면, 본 발명의 일실시예에 따른 멀티 캐패시터 기반의 인공신경망 동작 방법은 인공신경망 디바이 스가 에너지 하베스팅 모듈을 기반으로 전력을 생성하고, 멀티 캐패시터를 기반으로 전력을 저장한다(S210). 이 때, 에너지 하베스팅 모듈의 종류는 특정 방식으로 한정되지 않고, 인공신경망 디바이스를 사용하는 환경에 적합한 다양한 방식을 사용할 수 있다. 예를 들어, 태양광 방식, 압전 방식, RF 방식 등 다양한 방식의 에너지 하베스팅 모듈을 이용할 수 있다. 이 때, 멀티 캐패시터는 인공신경망 디바이스의 내부에 구비된 모듈들이 프로세서에 의해 선택적으로 동작할 수 있도록 캐패시터 사이즈를 조절하면서 상황에 따른 용량의 전력을 제공할 수 있다. 예를 들어, 저전력만 필요한 뉴로모픽 컴퓨팅 모듈을 동작시키는 경우에는 멀티 캐패시터의 일부만 사용하도록 조절함으로써 캐패시터 용량 을 낮출 수 있다. 또한, 본 발명의 일실시예에 따른 멀티 캐패시터 기반의 인공신경망 동작 방법은 인공신경망 디바이스가 무선 네트워크를 기반으로 내부에 구비된 뉴로모픽 컴퓨팅 모듈과 외부 뉴로모픽 시스템 사이에 스파이크(SPIKE) 신 호를 송수신한다(S220). 이 때, 본 발명에 따른 인공신경망 디바이스에 적용된 뉴로모픽 컴퓨팅 모듈은 여러 뉴로모픽 시스템들 중 memrister와 같은 비휘발성 메모리가 적용된 비휘발성 뉴로모픽 시스템으로 구현될 수 있다. 또한, 본 발명에 따른 인공신경망 디바이스에 적용된 뉴로모픽 컴퓨팅 모듈은, 대부분의 뉴로모픽 시스템과 같 이 뉴로모픽 컴퓨팅 모듈을 구성하는 전체 뉴런들에 동시에 전력을 공급하지 않고, 작동을 원하는 일부 뉴런에 만 전력을 공급하여 동작시킬 수 있는, 선택적 실행이 가능한 구조에 상응할 수 있다. 따라서, 본 발명에 따른 뉴로모픽 컴퓨팅 모듈에서는 임의로 뉴런과 시냅스를 구성하여 동작시킬 수 있다. 이 때, 내부의 뉴로모픽 컴퓨팅 모듈이 외부 뉴로모픽 시스템과 스파이크 신호를 송수신하면서 데이터 입출력이 수행될 수 있다. 또한, 도 4에 도시된 것처럼 인공신경망 디바이스에 센서 및 액츄에이터가 구비된 경우, 센서 및 액츄에이터를 이용하여 외부와 입출력을 수행할 수도 있다. 이 때, 뉴로모픽 컴퓨팅 모듈은 외부 뉴로모픽 시스템과 연결되어 대규모 협업 신경망을 구성할 수 있다. 이 때, 뉴로모픽 컴퓨팅 모듈에서 스파이크 신호를 생성하여 외부 뉴로모픽 시스템으로 송신하는 경우, 무선 네 트워크의 활성화 여부에 따라 스파이크 신호를 비휘발성 버퍼에 저장할 수 있다. 이 때, 무선 네트워크가 활성화되는 시점에 스파이크 신호를 외부 뉴로모픽 시스템으로 송신할 수 있다. 예를 들어, 도 6을 참조하면, 인공신경망 디바이스의 뉴로모픽 컴퓨팅 모듈에서 외부 뉴로모픽 시스템으로 송신 할 스파이크 신호를 생성하고(S610), 무선 네트워크가 활성화된 상태인지 여부를 판단할 수 있다(S615). 단계(S615)의 판단결과 무선 네트워크가 활성화된 상태이면, 바로 외부 뉴로모픽 시스템으로 스파이크 신호를 송신하여 데이터를 전달할 수 있다(S620). 그러나, 단계(S615)의 판단결과 무선 네트워크가 활성화되지 않은 상태이면, 일단 비휘발성 버퍼에 생성된 스파 이크 신호를 저장해두었다가(S630), 향후 무선 네트워크가 활성화되면 외부 뉴로모픽 시스템으로 스파이크 신호를 송신할 수 있다. 이 때, 무선 네트워크는 기존에 이용되는 네트워크 및 향후 개발 가능한 네트워크를 모두 포괄하는 개념이다. 예를 들면, 무선 네트워크는 인터넷 프로토콜(IP)을 통하여 대용량 데이터의 송수신 서비스 및 끊기는 현상이 없는 데이터 서비스를 제공하는 아이피망, 아이피를 기반으로 서로 다른 망을 통합한 아이피망 구조인 올 아이 피(All IP)망 등일 수 있으며, Wibro(Wireless Broadband)망, WCDMA를 포함하는 3세대 이동통신망, HSDPA(High Speed Downlink Packet Access)망 및 LTE 망을 포함하는 3.5세대 이동통신망, LTE advanced를 포함하는 4세대 이동통신망, 위성통신망 및 와이파이(Wi-Fi)망 중에서 하나 이상을 결합하여 이루어질 수 있다. 이 때, 뉴로모픽 컴퓨팅 모듈은 인공신경망 디바이스에 구비된 센서 및 액츄에이터 중 적어도 하나와 연결되어 소규모 신경망으로 동작할 수 있다. 예를 들어, 도 4를 참조하면, 본 발명의 일실시예에 따른 인공신경망 디바이스는 별도로 센서 및 액츄에이 터를 구비할여 외부 신호를 수신하거나, 외부로 신호를 전달할 수 있다. 즉, 무선 네트워크 모듈 을 기반으로 외부 뉴로모픽 시스템과 대규모 협업 신경망을 구축할 수도 있지만, 센서 및 액츄에이터 를 통해 뉴로모픽 컴퓨팅 모듈만으로 동작할 수도 있다. 이와 같이 본 발명의 일실시예에 따른 인공신경망 디바이스는 대규모와 소규모의 신경망을 자유롭게 구성할 수 있으므로 상황에 따라 적합한 신경망으로 재구성되어 사용될 수 있다. 또한, 본 발명의 일실시예에 따른 멀티 캐패시터 기반의 인공신경망 동작 방법은 인공신경망 디바이스가 멀티 캐패시터를 구성하는 복수개의 캐패시터들 중 일부를 사용하여 뉴로모픽 컴퓨팅 모듈을 구성하는 전체 뉴런들 중 스파이크 신호를 수신한 일부 뉴런에게만 전력을 제공한다(S230). 예를 들어, 본 발명에 따른 뉴로모픽 컴퓨팅 모듈은 비휘발성 뉴로모픽 시스템에 상응하는 것으로, 스파이크 신 호가 들어온 일부 뉴런만 활성화되고 나머지 뉴런들은 비활성화 상태일 수 있다. 따라서, 스파이크 신호에 의해 활성화되는 일부 뉴런에만 전력을 공급하여 동작함으로써 저전력으로도 동작할 수 있다. 이 때, 복수개의 캐패시터들은 각각 용량이 상이할 수 있다. 즉, 멀티 캐패시터는 서로 다른 용량의 캐패시터들 을 조합하여 만든 것으로, 인공신경망 디바이스의 프로세서를 통해서 멀티 캐패시터에 포함된 각각의 캐패시터 의 개폐 여부를 조절할 수 있다. 예를 들어, 도 5를 참조하면, 본 발명의 일실시예에 따른 멀티 캐패시터는 캐패시터들의 조합으로 구성될 수 있고, 이와 같은 구조의 멀티 캐패시터를 기반으로 인공신경망 디바이스의 상황에 따라 다른 전력 용량을 제 공할 수 있다. 이 때, 복수개의 캐패시터들 중 일부 뉴런을 동작하는데 필요한 필요 전력에 상응하는 요량을 갖는 일부 캐패시 터를 선택하여 사용할 수 있다. 이 때, 멀티 캐패시터에서는 인공신경망 디바이스에서 동작하는 모듈을 고려하여 캐패시터 용량을 줄임으로써 캐패시터를 사용할 때 파워 소모의 주요 원인인 누수 전력을 감소시킬 수 있다. 반대로, 무선 네트워크를 사용 할 때에는 한번에 많은 전력이 필요하므로, 멀티 캐패시터를 통해 캐패시터 용량을 늘려서 무선 네트워크 모듈 이 충분히 동작할 수 있는 전력을 저장하도록 할 수도 있다. 또한, 도 2에는 도시하지 아니하였으나, 본 발명의 일실시예에 따른 멀티 캐패시터 기반의 인공신경망 동작 방 법은 상술한 인공신경망 동작 과정에서 발생하는 다양한 정보를 별도의 저장모듈에 저장할 수 있다. 이와 같은 멀티 캐패시터 기반의 인공신경망 동작 방법을 통해 다른 신경망과 자유롭게 협업하여 대규모 신경망 을 구축할 수 있다. 또한, 공간적인 제약이 없고 외부에서 전력을 공급받지 않아도 자가발전으로 동작함으로써 어느 곳에나 적용할 수 있는 인공신경망 디바이스를 제공할 수 있다. 도 3은 본 발명의 일실시예에 따른 인공신경망 디바이스를 나타낸 도면이다. 도 3을 참조하면, 본 발명의 일실시예에 따른 인공신경망 디바이스는 프로세서, 멀티 캐패시터, 에너지 하베스팅 모듈, 뉴로모픽 컴퓨팅 모듈, 비휘발성 버퍼 및 무선 네트워크 모듈을 포 함한다. 프로세서는 에너지 하베스팅 모듈을 기반으로 전력을 생성하고, 멀티 캐패시터를 기반으로 전력 을 저장한다. 이 때, 에너지 하베스팅 모듈의 종류는 특정 방식으로 한정되지 않고, 인공신경망 디바이스를 사용하 는 환경에 적합한 다양한 방식을 사용할 수 있다. 예를 들어, 태양광 방식, 압전 방식, RF 방식 등 다양한 방식 의 에너지 하베스팅 모듈을 이용할 수 있다. 이 때, 멀티 캐패시터는 인공신경망 디바이스의 내부에 구비된 모듈들이 프로세서에 의해 선택 적으로 동작할 수 있도록 캐패시터 사이즈를 조절하면서 상황에 따른 용량의 전력을 제공할 수 있다. 예를 들어, 저전력만 필요한 뉴로모픽 컴퓨팅 모듈을 동작시키는 경우에는 멀티 캐패시터의 일부만 사용하 도록 조절함으로써 캐패시터 용량을 낮출 수 있다. 또한, 프로세서는 무선 네트워크 모듈을 기반으로 뉴로모픽 컴퓨팅 모듈과 외부 뉴로모픽 시스 템 사이에 스파이크(SPIKE) 신호를 송수신한다. 이 때, 본 발명에 따른 인공신경망 디바이스에 적용된 뉴로모픽 컴퓨팅 모듈은 여러 뉴로모픽 시스템 들 중 memrister와 같은 비휘발성 메모리가 적용된 비휘발성 뉴로모픽 시스템으로 구현될 수 있다. 또한, 본 발명에 따른 인공신경망 디바이스에 적용된 뉴로모픽 컴퓨팅 모듈은, 대부분의 뉴로모픽 시 스템과 같이 뉴로모픽 컴퓨팅 모듈을 구성하는 전체 뉴런들에 동시에 전력을 공급하지 않고, 작동을 원하는 일 부 뉴런에만 전력을 공급하여 동작시킬 수 있는, 선택적 실행이 가능한 구조에 상응할 수 있다. 따라서, 본 발 명에 따른 뉴로모픽 컴퓨팅 모듈에서는 임의로 뉴런과 시냅스를 구성하여 동작시킬 수 있다. 이 때, 내부의 뉴로모픽 컴퓨팅 모듈이 외부 뉴로모픽 시스템과 스파이크 신호를 송수신하면서 데이 터 입출력이 수행될 수 있다. 또한, 도 4에 도시된 다른 실시예처럼 인공신경망 디바이스에 센서 및 액츄 에이터가 구비된 경우, 센서 및 액츄에이터를 이용하여 외부와 입출력을 수행할 수도 있다. 이 때, 뉴로모픽 컴퓨팅 모듈은 외부 뉴로모픽 시스템과 연결되어 대규모 협업 신경망을 구성할 수 있다. 이 때, 뉴로모픽 컴퓨팅 모듈에서 스파이크 신호를 생성하여 외부 뉴로모픽 시스템으로 송신하는 경 우, 무선 네트워크의 활성화 여부에 따라 스파이크 신호를 비휘발성 버퍼에 저장할 수 있다. 이 때, 무선 네트워크가 활성화되는 시점에 스파이크 신호를 외부 뉴로모픽 시스템으로 송신할 수 있다. 예를 들어, 도 6을 참조하면, 인공신경망 디바이스의 뉴로모픽 컴퓨팅 모듈에서 외부 뉴로모픽 시스템으로 송신 할 스파이크 신호를 생성하고(S610), 무선 네트워크가 활성화된 상태인지 여부를 판단할 수 있다(S615). 단계(S615)의 판단결과 무선 네트워크가 활성화된 상태이면, 바로 외부 뉴로모픽 시스템으로 스파이크 신호를 송신하여 데이터를 전달할 수 있다(S620). 그러나, 단계(S615)의 판단결과 무선 네트워크가 활성화되지 않은 상태이면, 일단 비휘발성 버퍼에 생성된 스파 이크 신호를 저장해두었다가(S630), 향후 무선 네트워크가 활성화되면 외부 뉴로모픽 시스템으로 스파이크 신호 를 송신할 수 있다. 이 때, 무선 네트워크는 기존에 이용되는 네트워크 및 향후 개발 가능한 네트워크를 모두 포괄하는 개념이다. 예를 들면, 무선 네트워크는 인터넷 프로토콜(IP)을 통하여 대용량 데이터의 송수신 서비스 및 끊기는 현상이 없는 데이터 서비스를 제공하는 아이피망, 아이피를 기반으로 서로 다른 망을 통합한 아이피망 구조인 올 아이 피(All IP)망 등일 수 있으며, Wibro(Wireless Broadband)망, WCDMA를 포함하는 3세대 이동통신망, HSDPA(High Speed Downlink Packet Access)망 및 LTE 망을 포함하는 3.5세대 이동통신망, LTE advanced를 포함하는 4세대 이동통신망, 위성통신망 및 와이파이(Wi-Fi)망 중에서 하나 이상을 결합하여 이루어질 수 있다. 이 때, 뉴로모픽 컴퓨팅 모듈은 인공신경망 디바이스에 구비된 센서 및 액츄에이터 중 적어도 하나와 연결되어 소규모 신경망으로 동작할 수 있다. 예를 들어, 도 4를 참조하면, 본 발명의 일실시예에 따른 인공신경망 디바이스는 별도로 센서 및 액츄에이 터를 구비할여 외부 신호를 수신하거나, 외부로 신호를 전달할 수 있다. 즉, 무선 네트워크 모듈 을 기반으로 외부 뉴로모픽 시스템과 대규모 협업 신경망을 구축할 수도 있지만, 센서 및 액츄에이터 를 통해 뉴로모픽 컴퓨팅 모듈만으로 동작할 수도 있다. 이와 같이 본 발명의 일실시예에 따른 인공신경망 디바이스는 대규모와 소규모의 신경망을 자유롭게 구성할 수 있으므로 상황에 따라 적합한 신경망으로 재구성되어 사용될 수 있다. 또한, 프로세서는 멀티 캐패시터를 구성하는 복수개의 캐패시터들 중 일부를 사용하여 뉴로모픽 컴퓨 팅 모듈을 구성하는 전체 뉴런들 중 스파이크 신호를 수신한 일부 뉴런에게만 전력을 제공한다. 예를 들어, 본 발명에 따른 뉴로모픽 컴퓨팅 모듈은 비휘발성 뉴로모픽 시스템에 상응하는 것으로, 스파이크 신 호가 들어온 일부 뉴런만 활성화되고 나머지 뉴런들은 비활성화 상태일 수 있다. 따라서, 스파이크 신호에 의해 활성화되는 일부 뉴런에만 전력을 공급하여 동작함으로써 저전력으로도 동작할 수 있다. 이 때, 복수개의 캐패시터들은 각각 용량이 상이할 수 있다. 즉, 멀티 캐패시터는 서로 다른 용량의 캐패 시터들을 조합하여 만든 것으로, 인공신경망 디바이스의 프로세서를 통해서 멀티 캐패시터에 포함된 각각 의 캐패시터의 개폐 여부를 조절할 수 있다. 예를 들어, 도 5를 참조하면, 본 발명의 일실시예에 따른 멀티 캐패시터는 캐패시터들의 조합으로 구성될 수 있고, 이와 같은 구조의 멀티 캐패시터를 기반으로 인공신경망 디바이스의 상황에 따라 다른 전력 용량을 제 공할 수 있다. 이 때, 복수개의 캐패시터들 중 일부 뉴런을 동작하는데 필요한 필요 전력에 상응하는 요량을 갖는 일부 캐패시 터를 선택하여 사용할 수 있다. 이 때, 멀티 캐패시터에서는 인공신경망 디바이스에서 동작하는 모듈을 고려하여 캐패시터 용량을 줄임으 로써 캐패시터를 사용할 때 파워 소모의 주요 원인인 누수 전력을 감소시킬 수 있다. 반대로, 무선 네트워크를 사용할 때에는 한번에 많은 전력이 필요하므로, 멀티 캐패시터를 통해 캐패시터 용량을 늘려서 무선 네트워크 모듈이 충분히 동작할 수 있는 전력을 저장하도록 할 수도 있다. 이와 같은 멀티 캐패시터 기반의 인공신경망 디바이스를 이용함으로써 다른 신경망과 자유롭게 협업하여 대규모 신경망을 구축할 수 있다. 또한, 자체적으로 측정한 가공되지 않은 데이터를 내부에서 일차적으로 처리하고, 네트워크를 통해 2차 신경망 으로 전달함으로써 전체 시스템의 오버헤드를 감소시킬 수도 있다. 이상에서와 같이 본 발명에 따른 멀티 캐패시터 기반의 인공신경망 동작 방법 및 이를 위한 장치는 상기한 바와 같이 설명된 실시예들의 구성과 방법이 한정되게 적용될 수 있는 것이 아니라, 상기 실시예들은 다양한 변형이 이루어질 수 있도록 각 실시예들의 전부 또는 일부가 선택적으로 조합되어 구성될 수도 있다."}
{"patent_id": "10-2019-0149418", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시예에 따른 대규모 협업 신경망 시스템을 나타낸 도면이다. 도 2는 본 발명의 일실시예에 따른 멀티 캐패시터 기반의 인공신경망 동작 방법을 나타낸 동작 흐름도이다. 도 3은 본 발명의 일실시예에 따른 인공신경망 디바이스를 나타낸 도면이다. 도 4는 본 발명의 다른 실시예에 따른 인공신경망 디바이스를 나타낸 도면이다. 도 5는 본 발명에 따른 멀티 캐패시터의 일 예를 나타낸 도면이다. 도 6은 본 발명의 일실시예에 따른 인공신경망 동작 방법 중 외부 뉴로모픽 시스템으로 스파이크 신호를 송신하 는 과정을 상세하게 나타낸 동작흐름도이다."}
