{"patent_id": "10-2024-0109423", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0026135", "출원번호": "10-2024-0109423", "발명의 명칭": "제품 객체 정보를 제공하기 위한 방법 및 장치", "출원인": "항저우 알리바바 인터내셔널 네트워크 테크놀로지", "발명자": "장 레이"}}
{"patent_id": "10-2024-0109423", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "제품 객체 정보를 제공하기 위한 방법으로서,표적 사용자에게 제공될 적어도 하나의 표적 제품 객체 및 그 원본 설명 정보를 식별하는 단계;상기 표적 사용자의 국가 또는 지역 속성 정보를 결정하는 단계;상기 표적 사용자의 국가 또는 지역 속성 정보에 기초하여 현지 표현에 맞게 상기 원본 설명 정보를 처리하여표적 설명 정보를 생성하는 단계; 및상기 적어도 하나의 표적 제품 객체에 대응하는 표적 설명 정보를 상기 표적 사용자의 클라이언트 디바이스에제공하여 지정된 웹페이지에 상기 표적 설명 정보를 제공하는 단계를 포함하는, 방법."}
{"patent_id": "10-2024-0109423", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 상기 표적 사용자의 국가 또는 지역 속성 정보에 기초하여 상기 현지 표현에 맞게 상기 원본 설명 정보를 처리하여 상기 표적 설명 정보를 생성하는 단계는, 인공 지능(AI) 대규모 매개변수 모델을 활용하여 상기 원본 설명 정보를 이해하는 단계, 및상기 표적 사용자의 국가 또는 지역 속성 정보에 기초하여 상기 현지 표현에 맞게 상기 원본 설명 정보를 처리하여 상기 표적 설명 정보를 생성하는 단계를 포함하는, 방법."}
{"patent_id": "10-2024-0109423", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서, 상기 표적 제품 객체는 다수의 재고 관리 단위(SKU)와 연관되고; 상기 표적 사용자의 국가 또는 지역 속성 정보에 기초하여 상기 현지 표현에 맞게 상기 원본 설명 정보를 처리하여 상기 표적 설명 정보를 생성하는 단계는, 상기 SKU에 대응하는 원본 설명 정보를 현지 표현에 맞게 처리하여 상기 표적 설명 정보를 생성함으로써 다양한현지 표현에 기초하여 다른 국가 또는 지역 속성 정보를 가진 사용자에게 동일한 SKU에 대해 다른 표적 설명 정보를 제공하는 단계를 포함하는, 방법."}
{"patent_id": "10-2024-0109423", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서, 상기 원본 설명 정보는 상기 표적 제품 객체의 원본 텍스트 내용을 포함하고; 상기 표적 사용자의 국가 또는 지역 속성 정보에 기초하여 상기 현지 표현에 맞게 상기 원본 설명 정보를 처리하여 상기 표적 설명 정보를 생성하는 단계는, 상기 표적 사용자의 국가 또는 지역 속성 정보에 기초하여 상기 현지 표현에 맞게 상기 표적 제품 객체의 원본텍스트 내용을 변환하여 지정된 웹페이지에 표시하기 위한 표적 텍스트 내용을 생성하는 단계를 포함하는,방법."}
{"patent_id": "10-2024-0109423", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 4에 있어서, 상기 표적 사용자의 국가 또는 지역 속성 정보에 기초하여 상기 현지 표현에 맞게 상기 표적 제품 객체의 원본 텍스트 내용을 변환하는 것은, 상기 원본 텍스트 내용에 포함된 제품 이름 및/또는 형용사와 관련된 키워드를 상기 국가 또는 지역 속성 정보공개특허 10-2025-0026135-3-에 대응하는 현지 일반 용어로 변환하는 것을 포함하는, 방법."}
{"patent_id": "10-2024-0109423", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 4에 있어서, 상기 원본 텍스트 내용은 상기 원본 제목 텍스트 내용을 포함하고; 상기 표적 사용자의 국가 또는 지역 속성 정보에 기초하여 상기 현지 표현에 맞게 상기 표적 제품 객체의 원본 텍스트 내용을 변환하는 것은, 상기 표적 제품 객체가 속한 제품의 범주에 대해 상기 국가 또는 지역 속성 정보에 대응하는 인구 통계의 속성선호도에 기초하여 제품 속성의 표현과 관련된 텍스트 내용에 맞게 상기 원본 제목 텍스트 내용을 처리하는 것을 포함하는, 방법."}
{"patent_id": "10-2024-0109423", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 4에 있어서, 상기 원본 텍스트 내용은 원본 사용자 리뷰 텍스트 내용을 포함하고; 상기 표적 사용자의국가 또는 지역 속성 정보에 기초하여 상기 현지 표현에 맞게 상기 표적 제품 객체의 원본 텍스트 내용을 변환하는 것은, 상기 국가 또는 지역 속성 정보에 따라 현지 사용자 리뷰의 표시를 우선시하기 위해 상기 표적 사용자의 국가또는 지역 속성 정보에 기초하여 상기 원본 사용자 리뷰 텍스트 내용을 재정렬하는 것을 포함하는, 방법."}
{"patent_id": "10-2024-0109423", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 4 내지 7 중 어느 한 항에 있어서, 상기 표적 사용자의 국가 또는 지역 속성 정보에 기초하여 상기 현지표현에 맞게 상기 표적 제품 객체의 원본 텍스트 내용을 변환하는 것은, 상기 원본 텍스트 내용과 상기 표적 사용자의 국가 또는 지역 속성 정보를 AI 대규모 매개변수 모델에입력하여, 상기 AI 대규모 매개변수 모델이 상기 표적 사용자의 국가 또는 지역 속성 정보에 기초하여 상기 현지 표현에 맞게 상기 표적 제품 객체의 원본 텍스트 내용을 변환하는 것을 수행하도록 하는 단계를 포함하되;상기 AI 대규모 매개변수 모델은 또한 상기 국가 또는 지역 속성 정보에 대응하는 현지 표현에 기초하여 변환된텍스트 내용을 현지 문법적 표현 및/또는 현지 문맥적 일관성 스타일에 맞게 조정하여 상기 표적 텍스트 내용을생성하는 데 사용되는, 방법."}
{"patent_id": "10-2024-0109423", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 1에 있어서, 상기 원본 설명 정보는 상기 표적 제품 객체의 원본 속성/매개변수 설명을 포함하고; 상기표적 사용자의 국가 또는 지역 속성 정보에 기초하여 상기 현지 표현에 맞게 상기 원본 설명 정보를 처리하여상기 표적 설명 정보를 생성하는 것은, 상기 표적 사용자의 국가 또는 지역 속성 정보에 기초하여 상기 현지 표현에 맞게 상기 표적 제품 객체의 원본속성/매개변수 설명을 변환하여 지정된 웹페이지에 표시하기 위한 표적 속성/매개변수 설명을 생성하는 것을 포함하는, 방법."}
{"patent_id": "10-2024-0109423", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 9에 있어서, 상기 표적 사용자의 국가 또는 지역 속성 정보에 기초하여 상기 현지 표현에 맞게 상기 표적 제품 객체의 원본 속성/매개변수 설명을 변환하는 것은, 상기 표적 제품 객체가 서로 다른 속성 값/매개변수 값을 갖는 다수의 재고 관리 단위(SKU)와 연관되는 경우,상기 국가 또는 지역 속성 정보에 대응하는 현지에서 일반적으로 사용되는 속성 값/매개변수 값을 갖는 SKU의표시를 우선시하기 위해 상기 SKU를 재정렬하는 것을 포함하는, 방법."}
{"patent_id": "10-2024-0109423", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 9 또는 10에 있어서, 상기 표적 사용자의 국가 또는 지역 속성 정보에 기초하여 상기 현지 표현에 맞게상기 표적 제품 객체의 원본 속성/매개변수 설명을 변환하는 것은, 상기 원본 속성/매개변수 설명 정보와 상기 표적 사용자의 국가 또는 지역 속성 정보를 AI 대규모 매개변수 모공개특허 10-2025-0026135-4-델에 입력하여, 상기 AI 대규모 매개변수 모델이 상기 표적 사용자의 국가 또는 지역 속성 정보에 기초하여 상기 현지 표현에 맞게 상기 표적 제품 객체의 원본 속성/매개변수 설명을 변환하는 것을 수행하도록 하는 것을포함하는, 방법."}
{"patent_id": "10-2024-0109423", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 1에 있어서, 상기 원본 설명 정보는 상기 표적 제품 객체의 원본 리치 미디어 정보를 포함하고; 상기 표적 사용자의 국가 또는 지역 속성 정보에 기초하여 상기 현지 표현에 맞게 상기 원본 설명 정보를 처리하여 상기 표적 설명 정보를 생성하는 것은, 상기 표적 사용자의 국가 또는 지역 속성 정보에 기초하여 상기 현지 표현에 맞게 상기 표적 제품 객체의 원본리치 미디어 정보를 변환하여 상기 지정된 웹페이지에 표시하기 위한 표적 리치 미디어 정보를 생성하는 것을포함하는, 방법."}
{"patent_id": "10-2024-0109423", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 12에 있어서, 상기 원본 리치 미디어 정보는 원본 이미지 정보를 포함하고; 상기 표적 사용자의 국가적또는 지역 속성 정보에 기초하여 상기 현지 표현에 맞게 상기 표적 제품 객체의 원본 리치 미디어 정보를 변환하는 것은, 상기 표적 사용자의 국가적 또는 지역 속성 정보에 기초하여 상기 원본 이미지 정보의 구성 스타일, 모델 유형및/또는 분위기 요소를 변환하여 상기 국가적 또는 지역 속성 정보에 대응하는 현지 선호도와 부합하는 표적 이미지 정보를 생성하는 것을 포함하는, 방법."}
{"patent_id": "10-2024-0109423", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 12에 있어서, 상기 원본 리치 미디어 정보는 원본 오디오 정보를 포함하고; 상기 표적 사용자의 국가 또는 지역 속성 정보에 기초하여 상기 현지 표현에 맞게 상기 표적 제품 객체의 원본리치 미디어 정보를 변환하는 것은, 상기 표적 사용자의 국가 또는 지역 속성 정보에 기초하여 상기 원본 오디오 정보를 변환하여 상기 국가 또는지역 속성 정보에 대응하는 현지 선호도와 부합하는 표적 오디오 정보를 생성하는 것을 포함하는, 방법."}
{"patent_id": "10-2024-0109423", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제품 객체 정보를 제공하기 위한 방법으로서, 표적 사용자에 대해 제공되는 적어도 하나의 표적 제품 객체의 표적 설명 정보를 서버로부터 수신하는단계로서, 상기 표적 설명 정보는 상기 표적 사용자의 국가적 또는 지역 속성 정보에 기초하여 상기 현지 표현에 맞게 상기 표적 제품 객체의 원본 설명 정보를 변환함으로써 생성되는, 상기 수신하는 단계; 및적어도 하나의 표적 제품 객체의 표적 설명 정보를 지정된 웹페이지에 표시하는 단계를 포함하는, 방법."}
{"patent_id": "10-2024-0109423", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "컴퓨터 프로그램을 저장하는 컴퓨터 판독 가능 저장 매체로서,상기 컴퓨터 프로그램은, 상기 프로세서에 의해 실행될 때, 청구항 1 내지 15 중 어느 한 항에 설명된 방법 단계를 구현하는 명령어를 포함하는, 컴퓨터 판독 가능 저장 매체."}
{"patent_id": "10-2024-0109423", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "전자 디바이스로서,하나 이상의 프로세서; 및상기 하나 이상의 프로세서와 연관된 메모리를 포함하되, 상기 메모리는 상기 하나 이상의 프로세서에 의해 판독되어 실행될 때 청구항 1 내지 15 중 어느공개특허 10-2025-0026135-5-한 항에 설명된 방법 단계를 수행하는 프로그램 명령어를 저장하는, 전자 디바이스."}
{"patent_id": "10-2024-0109423", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 출원의 실시형태는 제품 객체 정보를 제공하기 위한 방법 및 전자 디바이스를 제시한다. 방법은 표적 사용자 에게 제공될 적어도 하나의 표적 제품 객체 및 그 원본 설명 정보를 식별하는 단계; 표적 사용자의 국가 또는 지 역 속성 정보를 결정하는 단계; 표적 사용자의 국가 또는 지역 속성 정보에 기초하여 현지 표현에 맞도록 원본 설명 정보를 처리하여 표적 설명 정보를 생성하는 단계; 및 적어도 하나의 표적 제품 객체에 대응하는 표적 설명 정보를 표적 사용자의 클라이언트 디바이스에 제공하여 지정된 웹페이지에 표적 설명 정보를 제공하는 단계를 포 함한다. 이러한 실시형태는 지정된 웹페이지에 제품 객체 정보를 표현하여 \"각 개인에 대해 맞춤화된 경험\"을 달 성하고, 사용자 경험을 향상시켜 클릭률과 전환율을 증가시킬 수 있게 할 수 있다."}
{"patent_id": "10-2024-0109423", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 출원은 정보 기술 분야에 관한 것이고, 보다 상세하게는 제품 객체 정보를 제공하기 위한 방법 및 전자 디바 이스에 관한 것이다."}
{"patent_id": "10-2024-0109423", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "제품 정보 서비스 시스템에서 \"각 개인에 대한 맞춤형 경험\"은 일반적으로 더 나은 판매 성과를 달성하기 위해 다양한 소비자에게 다른 제품 추천을 맞춤화하는 전략을 말한다. 전통적인 제품 추천은 범주, 가격, 판매량 및 기타 요인과 같은 제품 자체의 속성에 기초한다. 반면, \"개인화된 추천\"은 소비자의 관심사, 구매 내역 및 행동 과 같은 요인에 기초하여 소비자에 기반하여 제품을 추천하는 것이다. 이 \"각 개인에 대한 맞춤형 경험\" 접근 방식은 제품 클릭률, 전환율 및 기타 지표를 개선하는 데 긍정적인 영향 을 미친다. 그러나, 사용자 경험을 더욱 향상시키고 클릭률 및 전환율과 같은 지표를 개선하는 방법은 이 기술 분야의 전문가에게 여전히 주요 관심사이다. 본 출원의 실시형태는 표적 웹페이지에서 제품 객체의 프런트엔드 설명 정보의 표현에서 \"각 개인에 대한 맞춤 형 경험\"을 실현할 수 있게 하는 제품 객체 정보를 제공하는 방법과 전자 디바이스를 제공한다. 이는 사용자 경 험을 향상시키고 클릭률 및 전환율과 같은 지표를 개선하는 데 도움을 준다. 본 출원은 다음의 솔루션을 제공한다: 제품 객체 정보를 제공하기 위한 방법으로서, 표적 사용자에게 제공될 적어도 하나의 표적 제품 객체 및 그 원본 설명 정보를 식별하는 단계; 표적 사용자의 국가 또는 지역 속성 정보를 결정하는 단계; 표적 사용자의 국가 또는 지역 속성 정보에 기초하여 현지 표현에 맞게 원본 설명 정보를 처리하여 표적 설명 정보를 생성하는 단계; 및 적어도 하나의 표적 제품 객체에 대응하는 표적 설명 정보를 표적 사용자의 클라이언트 디바이스에 제공하여 지 정된 웹페이지에 표적 설명 정보를 제공하는 단계를 포함하는, 방법. 본 출원에서, 표적 사용자의 국가 또는 지역 속성 정보에 기초하여 현지 표현에 맞게 원본 설명 정보를 처리하 여 표적 설명 정보를 생성하는 단계는, 인공 지능(AI) 대규모 매개변수 모델을 활용하여 원본 설명 정보를 이해하는 단계, 및 표적 사용자의 국가 또는 지역 속성 정보에 기초하여 현지 표현에 맞게 원본 설명 정보를 처리하여 표적 설명 정보를 생성하는 단계를 포 함한다. 본 출원에서, 표적 제품 객체는 다수의 재고 관리 단위(SKU)와 연관되고; 표적 사용자의 국가 또는 지역 속성 정보에 기초하여 현지 표현에 맞게 원본 설명 정보를 처리하여 표적 설명 정보를 생성하는 단계는, SKU에 대응하는 원본 설명 정보를 현지 표현에 맞게 처리하여 표적 설명 정보를 생성함으로써 다양한 현지 표현 에 기초하여 다른 국가 또는 지역 속성 정보를 가진 사용자에게 동일한 SKU에 대해 다른 표적 설명 정보를 제공 하는 단계를 포함한다. 본 출원에서, 원본 설명 정보는 표적 제품 객체의 원본 텍스트 내용을 포함하고; 표적 사용자의 국가 또는 지역 속성 정보에 기초하여 현지 표현에 맞게 원본 설명 정보를 처리하여 표적 설명 정보를 생성하는 단계는, 표적 사용자의 국가 또는 지역 속성 정보에 기초하여 현지 표현에 맞게 표적 제품 객체의 원본 텍스트 내용을 변환하여 지정된 웹페이지에 표시하기 위한 표적 텍스트 내용을 생성하는 단계를 포함한다. 본 출원에서, 표적 사용자의 국가 또는 지역 속성 정보에 기초하여 현지 표현에 맞게 표적 제품 객체의 원본 텍 스트 내용을 변환하는 것은, 원본 텍스트 내용에 포함된 제품 이름 및/또는 형용사와 관련된 키워드를 국가 또는 지역 속성 정보에 대응하는 현지 일반 용어로 변환하는 것을 포함한다. 본 출원에서, 원본 텍스트 내용은 원본 제목 텍스트 내용을 포함하고; 표적 사용자의 국가 또는 지역 속성 정보에 기초하여 현지 표현에 맞게 표적 제품 객체의 원본 텍스트 내용을 변환하는 것은, 또한 표적 제품 객체가 속한 제품의 범주에 대해 국가 또는 지역 속성 정보에 대응하는 인구 통계의 속성 선호도에 기초하여 제품 속성의 표현과 관련된 텍스트 내용에 맞게 원본 제목 텍스트 내용을 처리하는 것을 포함한다. 본 출원에서, 제품 속성의 표현과 관련된 텍스트 내용에 맞게 원본 제목 텍스트 내용을 처리하는 것은, 원본 제목 텍스트 내용에 포함된 제품 속성 표현과 관련된 표적 텍스트 내용을 삭제하거나 다른 속성 값으로 변 환하거나, 제품 속성 표현과 관련된 텍스트 내용을 원본 제목 텍스트 내용에 추가하는 것을 포함한다. 본 출원에서, 원본 텍스트 내용은 원본 사용자 리뷰 텍스트 내용을 포함하고; 표적 사용자의 국가 또는 지역 속성 정보에 기초하여 현지 표현에 맞게 표적 제품 객체의 원본 텍스트 내용을 변환하는 것은, 국가 또는 지역 속성 정보에 따라 현지 사용자 리뷰의 표시를 우선시하기 위해 표적 사용자의 국가 또는 지역 속성 정보에 기초하여 원본 사용자 리뷰 텍스트 내용을 재정렬하는 것을 포함한다. 본 출원에서, 표적 사용자의 국가 또는 지역 속성 정보에 기초하여 현지 표현에 맞게 표적 제품 객체의 원본 텍 스트 내용을 변환하는 것은, 원본 텍스트 내용과 표적 사용자의 국가 또는 지역 속성 정보를 AI 대규모 매개변수 모델에 입력하여, AI 대규 모 매개변수 모델이 표적 사용자의 국가 또는 지역 속성 정보에 기초하여 현지 표현에 맞게 표적 제품 객체의 원본 텍스트 내용을 변환하는 것을 수행하도록 하는 단계를 포함하고; AI 대규모 매개변수 모델은 또한 국가 또는 지역 속성 정보에 대응하는 현지 표현에 기초하여 변환된 텍스트 내 용을 현지 문법적 표현 및/또는 현지 문맥적 일관성 스타일에 맞게 조정하여 표적 텍스트 내용을 생성하는 데 사용된다. 본 출원에서, AI 대규모 매개변수 모델에 입력된 정보는 미리 수립된 지식 기반 및/또는 규칙을 추가로 포함한 다. 지식 기반은 특정 국가/지역의 다수의 현지 표현에 대응하는 현지 일반 용어, 속성 선호도 정보 및/또는 현 지 문법적 표현에 대한 지식을 포함한다. 본 출원에서, 원본 설명 정보는 표적 제품 객체의 원본 속성/매개변수 설명을 포함하고: 원본 설명 정보에 대한 현지 기반 처리를 수행하여 표적 설명 정보를 생성하는 것은, 표적 사용자의 국가 또는 지역 속성 정보에 기초하여 현지 표현에 맞게 표적 제품 객체의 원본 속성/매개변수 설명을 변환하여 지정된 웹페이지에 표시하기 위한 표적 속성/매개변수 설명을 생성하는 것을 포함한다. 본 출원에서, 표적 사용자의 국가 또는 지역 속성 정보에 기초하여 현지 표현에 맞게 표적 제품 객체의 원본 속 성/매개변수 설명을 변환하는 것은, 표적 사용자의 국가 또는 지역 속성 정보에 기초하여 표적 제품 객체의 원본 속성/매개변수 설명을 일반적으로 사용되는 현지 표준 또는 단위로 변환하는 것을 포함한다. 본 출원에서, 표적 사용자의 국가 또는 지역 속성 정보에 기초하여 현지 표현에 맞게 표적 제품 객체의 원본 속 성/매개변수 설명을 변환하는 것은, 표적 제품 객체가 서로 다른 속성 값/매개변수 값을 갖는 다수의 재고 관리 단위(SKU)와 연관되는 경우, 국가 또는 지역 속성 정보에 대응하는 현지에서 일반적으로 사용되는 속성 값/매개변수 값을 갖는 SKU의 표시를 우선 시하기 위해 SKU를 재정렬하는 것을 포함한다. 본 출원에서, 표적 사용자의 국가 또는 지역 속성 정보에 기초하여 현지 표현에 맞게 표적 제품 객체의 원본 속 성/매개변수 설명을 변환하는 것은, 원본 속성/매개변수 설명 정보와 표적 사용자의 국가 또는 지역 속성 정보를 AI 대규모 매개변수 모델에 입력하 여, AI 대규모 매개변수 모델이 표적 사용자의 국가 또는 지역 속성 정보에 기초하여 현지 표현에 맞게 표적 제 품 객체의 원본 속성/매개변수 설명을 변환하는 것을 수행하도록 하는 것을 포함한다. 본 출원에서, 원본 설명 정보는 표적 제품 객체의 원본 리치 미디어 정보를 포함하고; 표적 사용자의 국가 또는 지역 속성 정보에 기초하여 현지 표현에 맞게 원본 설명 정보를 처리하여 표적 설명 정보를 생성하는 것은, 표적 사용자의 국가 또는 지역 속성 정보에 기초하여 현지 표현에 맞게 표적 제품 객체의 원본 리치 미디어 정 보를 변환하여 지정된 웹페이지에 표시하기 위한 표적 리치 미디어 정보를 생성하는 것을 포함한다. 본 출원에서, 원본 리치 미디어 정보는 원본 이미지 정보를 포함하고; 표적 사용자의 국가적 또는 지역 속성 정보에 기초하여 현지 표현에 맞게 표적 제품 객체의 원본 리치 미디어 정보를 변환하는 것은, 표적 사용자의 국가적 또는 지역 속성 정보에 기초하여 원본 이미지 정보의 구성 스타일, 모델 유형 및/또는 분 위기 요소를 변환하여 국가적 또는 지역 속성 정보에 대응하는 현지 선호도와 부합하는 표적 이미지 정보를 생 성하는 것을 포함한다. 본 출원에서, 방법은 원본 이미지 정보와 표적 사용자의 국가 또는 지역 속성 정보를 AI 대규모 매개변수 모델 에 입력하여, AI 대규모 매개변수 모델이 원본 이미지 정보의 구성 스타일, 모델 유형 및/또는 분위기 요소를 변환할 수 있도록 하는 단계를 추가로 포함한다. 본 출원에서, 원본 이미지 정보의 모델 유형을 변환할 때, 방법은 표적 제품 객체의 속성/매개변수 정보에 기초 하여 모델 유형의 변환을 수행할지 여부를 결정하는 단계를 추가로 포함한다. 본 출원에서, 원본 리치 미디어 정보는 원본 오디오 정보를 포함하고; 표적 사용자의 국가 또는 지역 속성 정보에 기초하여 현지 표현에 맞게 표적 제품 객체의 원본 리치 미디어 정 보를 변환하는 것은, 표적 사용자의 국가 또는 지역 속성 정보에 기초하여 원본 오디오 정보를 변환하여 국가 또는 지역 속성 정보에 대응하는 현지 선호도와 부합하는 표적 오디오 정보를 생성하는 것을 포함한다. 제품 객체 정보를 제공하기 위한 방법으로서, 표적 사용자에 대해 제공된 적어도 하나의 표적 제품 객체의 표적 설명 정보를 서버로부터 수신하는 단계로서, 표적 설명 정보는 표적 사용자의 국가적 또는 지역 속성 정보에 기초하여 현지 표현에 맞게 표적 제품 객체의 원본 설명 정보를 변환함으로써 생성되는, 수신하는 단계; 및 적어도 하나의 표적 제품 객체의 표적 설명 정보를 지정된 웹페이지에 표시하는 단계를 포함한다. 제품 객체 정보를 제공하기 위한 장치는, 표적 사용자에 대해 제공되는 적어도 하나의 표적 제품 객체 및 그 원본 설명 정보를 결정하도록 구성된 원본 설명 정보 결정 유닛; 표적 사용자의 국가 또는 지역 속성 정보를 결정하도록 구성된 사용자 속성 정보 결정 유닛; 표적 사용자의 국가 또는 지역 속성 정보에 기초하여 현지 표현에 맞게 원본 설명 정보를 처리하여 표적 설명 정보를 생성하도록 구성된 현지화 처리 유닛; 및 표적 사용자에 대응하는 클라이언트에게 적어도 하나의 표적 제품 객체에 대응하는 표적 설명 정보를 제공하고 표적 설명 정보를 표적 페이지를 통해 제공하도록 구성된 정보 제공 유닛을 포함한다. 제품 객체 정보를 제공하기 위한 장치는, 표적 사용자를 위해 서버에서 제공하는 적어도 하나의 표적 제품 객체의 표적 설명 정보를 수신하도록 구성된 정보 수신 유닛으로서, 표적 설명 정보는 현지 표현을 사용하여 표적 사용자의 국가 또는 지역 속성에 기초하여 표적 제품 객체의 원본 설명 정보를 처리함으로써 생성되는, 정보 수신 유닛; 및 적어도 하나의 표적 제품 객체의 표적 설명 정보를 지정된 웹페이지에 제공하도록 구성된 정보 제공 유닛을 포 함한다. 컴퓨터 프로그램을 저장하는 컴퓨터 판독 가능 저장 매체로서, 컴퓨터 프로그램은 프로세서에 의해 실행될 때 전술된 방법 중 임의의 방법 단계를 구현하는 명령어를 포함하는, 컴퓨터 판독 가능 저장 매체. 전자 디바이스로서, 하나 이상의 프로세서; 및 하나 이상의 프로세서와 연관된 메모리를 포함하고, 메모리는 프로그램 명령어를 저장하도록 구성되고, 프로그 램 명령어는, 하나 이상의 프로세서에 의해 판독되어 실행될 때, 전술된 방법 중 임의의 방법 단계를 수행하는, 전자 디바이스. 본 출원에서 제공하는 구체적인 실시형태에 따르면, 다음의 기술적 효과가 개시된다: 본 출원의 실시형태를 통해, 표적 제품 객체에 대한 정보를 표적 사용자에게 제공할 필요가 있을 때, 표적 제품 객체의 원본 설명 정보와 표적 사용자의 국가 또는 지역 속성 정보를 먼저 얻을 수 있다. 그런 다음, 표적 사용 자의 국가 또는 지역 속성 정보에 기초하여, 원본 설명 정보를 현지 표현을 사용하여 처리하여 표적 설명 정보 를 생성할 수 있다. 그런 다음 이 표적 설명 정보는 표적 페이지를 통해 표적 사용자에게 제공될 수 있다. 이러 한 방식으로, 표적 페이지에 제공된 제품 객체의 설명 정보의 표현은 \"각 개인에 대한 맞춤형 경험\"을 달성하고, 표적 사용자의 국가/지역의 현지화 선호도와 더 잘 부합하여, 사용자의 쇼핑 열정을 더 쉽게 자극하 고, 사용자 경험을 향상시키고, 결과적으로 클릭률 및 전환율과 같은 지표를 개선할 수 있다. 선호되는 접근 방식에서, 다중 모달 내용(multimodal content)의 이해, 생성 및 기타 양태에서 인공 지능(AI) 대규모 매개변수 모델의 기능을 활용하여 제품 설명 정보의 현지화 기반 변환을 지원할 수 있다. 이를 통해 효 율성을 개선하고 변환된 텍스트 내용의 맥락적 일관성을 강화할 수 있다. 나아가, AI 대형 모델에서 생성된 내 용의 더 높은 유용성과 정확성을 보장하기 위해 특정 샘플과 규칙을 사용하여 사전에 표적화된 훈련을 수행할 수 있다. 본 출원의 임의의 제품을 구현하는 것이 반드시 전술된 장점을 모두 동시에 달성하는 것은 아니라는 것을 이해 해야 한다."}
{"patent_id": "10-2024-0109423", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 출원의 실시형태의 기술적 해결책은 첨부 도면과 함께 아래에서 명확하고 완전하게 설명될 것이다. 설명된 실시형태는 본 출원의 실시형태의 일부일 뿐, 전부는 아니라는 것이 명백하다. 본 출원의 실시형태에 기초하여 이 기술 분야의 통상의 기술자가 얻은 모든 다른 실시형태는 본 출원의 보호 범위에 속한다. 첫째, 본 출원의 실시형태를 구현하는 동안, 본 발명자들은 현재의 전자 상거래 분야에서 \"각 개인에 대한 맞춤 형 경험\"이 이미 상당히 성숙되었음을 발견했다. 그러나, 이는 주로 제품 매칭의 관점에서 개인화를 달성한다.다른 사용자에게 동일한 제품의 프런트엔드 표현(제목, 설명 이미지, 제품 소개 등 포함, 그러나 여기에는 제품 이미지를 생성하는 방법이 있지만, 주로 주요 이점을 강조하고 사용 시나리오로 제한됨)은 일관되게 유지된다. 그러나, 이러한 \"일관된\" 표현은 특히 다른 국적/지역의 사용자 간에 문화적, 습관적, 및 선호도 차이가 상당한 국경 간 전자 상거래 맥락에서 다양한 사용자의 쇼핑 열의를 불러일으키는 데 실패한다. 개인화된 현지화를 제 품 정보의 프런트엔드 표현에도 적용하면 사용자 경험을 더욱 향상시켜 클릭률 및 전환율과 같은 지표를 개선할 수 있다. 예를 들어, 관습적인 용어로, \"비디오\"는 홍콩에서 \" \"[병음: shixun]라고 불리고, 중국 본토에 서는 \" \"[병음: shipin]이라고 불리고; 중국 본토에서 \"오렌지\"는 대만에서 \"柳丁\"[병음: liuding]이라고 불리고; \"보조 배터리\"는 홍콩에서 \"尿袋\"[병음: niaodai]라고 불리는 등이다. 추가로, 시각적 표현 면에서 다 른 국적/지역의 사용자는 다른 선호도를 가지고 있다. 예를 들어, 브라질 사용자는 일반적으로 생동감 있고 다 채로운 구성을 선호하는 반면, 유럽과 북미 사용자는 미니멀리스트 표현을 선호하는 경향이 있으며; 예를 들어, 신발 사이즈는 미국에서는 6사이즈로 표시되는데, 이는 중국에서는 235 사이즈에 대응하고, 유럽에서는 37 사이 즈에 대응한다. 제품 모델과 관련하여, 아시아 사용자는 일반적으로 날씬한 체형을 가진 아시아 모델을 보는 데 더 익숙한 반면, 유럽과 북미 사용자는 일반적으로 풍만한 체형을 가진 그 지역의 모델을 보는 데 더 익숙하다. 이러한 표현의 차이는 사용자 경험에 상당한 영향을 미치며, 매칭하는 표현을 사용하면 현지에서 인지도를 얻을 가능성이 더 높다. 따라서, 본 출원의 실시형태에서, 대응하는 솔루션이 제공된다. 이 솔루션에서, 사용자에게 추천할 제품을 결정 할 때, 또는 사용자의 검색 요청에 기초하여 검색 기준을 충족하는 제품을 반환할 때, 제품 설명 정보의 프런트 엔드 표현이 변환될 수 있다. 이 변환은 설명 정보를 표적 사용자의 국가/지역의 현지화 습관과 더욱 부합시킨 다. 변환된 설명 정보는 표적 페이지를 통해 현재 표적 사용자에게 제공되어, 표적 사용자에게 더욱 친숙하고 매력적인 경험을 제공한다. 구체적으로, 설명 정보의 프런트엔드 표현을 변환할 때, 이는 텍스트 정보, 속성 매개변수 정보, 및 리치 미디 어 정보(이미지, 오디오 등 포함)와 같은 다양한 모달리티(modality)의 설명 정보를 사용자의 위치에 더 적합한 현지 표현으로 변환하는 것을 포함할 수 있다. 바람직한 실시형태에서, 인공 지능(AI) 모델 및 기타 관련 모델 의 기능을 활용하여 다중 모달 제품 설명 정보의 현지화 변환을 달성할 수 있다. 이를 통해 변환된 설명 정보가 더 유창하고 자연스러워져 간단한 키워드 대체에서 발생할 수 있는 어색한 문장과 같은 문제를 피할 수 있다. 처리 효율성도 더 높아져 변환 프로세스를 수백 밀리초의 시간 프레임 내에 완료할 수 있어서 전체 솔루션의 구 현을 보다 잘 지원할 수 있다. 본 출원의 실시형태에서 제공하는 솔루션은 AI 모델을 통해 다양한 모달리티의 설명적 정보를 변환하는 것을 포 함하므로, 더 나은 이해를 위해 AI 모델(특히 주로 아래에서 예로 사용될 AI 대규모 매개변수 모델)의 관련 개 념에 대한 간략한 소개가 필요하다. AI 대형 모델이라고도 하는 AI 대규모 매개변수 모델은 기초 모델의 한 종 류를 말한다. 이러한 모델은 방대한 양의 데이터를 사용하여 훈련된 방대한 수의 매개변수를 특징으로 하며, 이 를 통해 광범위한 다운스트림 작업에 적응할 수 있다. AI 대규모 모델의 경우, 방대한 수의 매개변수(모델이 계 속 반복됨에 따라 매개변수 수는 일반적으로 수백만에서 수십억, 수조, 그리고 그 이상으로 기하급수적으로 증 가함)를 갖는 특성이 있을 뿐만 아니라 다수의 모달리티도 지원한다. 처음에는 AI 대형 모델이 이미지, 텍스트, 음성, 및 비디오와 같은 단일 모달리티 내에서 단일 작업을 지원했다. 그러나, 이 모델은 점차 다수의 모달리티 에 걸쳐 다양한 작업을 지원하도록 진화했다. 다시 말해, 대형 모델은 일반적으로 다수의 모달리티에 대한 효율 적인 이해 능력, 교차 모달 인식 능력, 및 다양한 작업에 걸쳐 전송하고 실행하는 능력을 보유하고 있다. 이 모 델은 심지어 인간의 뇌와 유사한 다중 모달 정보 인식 능력을 보일 수도 있다. 다른 관점에서, AI 대형 모델은 \"인공 지능 사전 훈련된 대형 모델\"의 약자로, \"사전 훈련\"과 \"대형 모델\"을 모 두 포함한다. 이 두 가지 양태의 조합은 새로운 AI 패러다임을 생성하고, 여기서 모델은 대규모 데이터 세트에 대해 사전 훈련된 후 미세 조정 없이 또는 최소한의 미세 조정만으로 다양한 다운스트림 적용을 지원할 수 있다. 다시 말해, AI 대형 모델은 \"대규모 사전 훈련 + 미세 조정\" 패러다임의 이점을 얻어 다양한 다운스트림 작업에 잘 적응하고 강력한 일반성을 보여준다. 공유 매개변수가 있는 AI 대형 모델의 이러한 범용 기능은 다양 한 다운스트림 적용 시나리오에서 대응하는 미세 조정과 함께 우수한 성능을 제공하여 다른 작업으로 일반화하 는 데 어려움을 겪는 기존 AI 모델의 한계를 극복한다. 처리 결과의 관점에서, 전술한 AI 대형 모델은 또한 생성 모델 범주에 속한다. 이러한 모델은 특징에 기초하여 결과를 예측할 수 있을 뿐만 아니라 데이터가 생성되는 방식을 \"이해\"하고 이러한 이해를 사용하여 새로운 데이터를 \"생성\"할 수도 있다. AI 대형 모델에 대한 기존 지식과 전술한 기능의 지원을 통해, 본 출원의 실시형태에서 제품 설명 정보의 현지 화 변환을 보다 잘 구현할 수 있다. 예를 들어, 제품의 원본 설명 정보와 현재 표적 사용자의 국가 또는 지역 속성 정보는 AI 대형 모델에 입력될 수 있다. 그런 다음 AI 대형 모델은 대응하는 키워드 변환, 속성/매개변수 정보 변환, 이미지 변환 및 기타 처리를 수행할 수 있다. 추가로, 텍스트 내용의 경우, 모델은 변환된 키워드 및 기타 요소에 기초하여 현지 문법적 표현 습관을 처리하여 문맥적 일관성을 보장할 수 있다. 이를 통해 변환 된 텍스트가 현재 표적 사용자의 현지 문법적 표현 습관에 더욱 부합하고 더욱 유창해져서 직접 키워드 대체로 부터 발생할 수 있는 어색한 문장과 같은 문제를 피할 수 있다. 도 1을 참조하면 시스템 아키텍처의 관점에서, 본 출원의 실시형태는 제품 정보 서비스 시스템에서 구현될 수 있다. 시스템은 구체적으로 클라이언트측과 서버측을 포함할 수 있다. 클라이언트측은 주로 프런트엔드 웹페이 지를 표시하고, 사용자와 상호 작용하는 데 사용되는 반면, 서버측은 주로 특정 데이터를 제공하는 일을 담당한 다. 본 출원의 실시형태에서, 특정 AI 모델과 관련 구성 요소는 서버측에 저장될 수 있다. 설명 정보의 변환이 수행된 후 변환된 설명 정보는 표시 및 추가 처리를 위해 클라이언트측으로 반환된다. 물론, 실제 적용에서는 \"에지 + 클라우드\" 모두의 계산 자원을 최대한 활용할 수 있다. 일부 간단한 논리의 경우, 클라이언트측의 계 산 자원은 에지측 계산을 위해 사용될 수 있는 반면, 보다 복잡한 논리는 클라우드 서버 등에서 계산될 수 있다. 다음은 본 출원의 실시형태에서 제공하는 특정 구현에 대한 상세한 설명이다. 실시형태 1 첫째, 서버측의 관점에서, 실시형태 1은 제품 객체 정보를 제공하기 위한 방법을 제공한다(도 2 참조). 이 방법 은, 단계 201: 표적 사용자에게 제공될 적어도 하나의 표적 제품 객체 및 그 원본 설명 정보 식별하는 단계를 포함 할 수 있다. 이 실시형태에서, 제품 설명 정보의 현지 표현의 변환은 다양한 시나리오에서 적용될 수 있다. 예를 들어, 이러 한 시나리오 중 하나는 제품 추천 시나리오일 수 있다. 즉, 표적 사용자에게 제품을 추천해야 할 때, 표적 사용 자의 과거 행동 기록, 선호도 및 기타 정보에 기초하여 추천할 적어도 하나의 표적 제품을 결정할 수 있다(이 프로세스는 제품 차원에서 \"각 개인에 대한 맞춤형 경험\"을 이미 달성할 수 있음). 그런 다음, 추천된 제품의 정보를 페이지에 표시할 때, 현지 표현에 기초하여 정보를 처리하여 제품 수준에서 \"각 개인에 대한 맞춤형 경 험\"을 달성할 수도 있고; 대안적으로 검색 시나리오에서 사용자가 키워드 또는 이미지를 입력할 때 검색 기준을 충족하는 적어도 하나의 표적 제품이 매칭될 수 있다. 이 경우에, 검색 시나리오에서 기존 기술은 또한 제품 차 원에서 \"각 개인에 대한 맞춤형 경험\"을 달성할 수 있다. 그런 다음, 이러한 제품 검색 결과의 정보를 페이지에 표시할 때, 현지 표현에 기초하여 정보를 처리하여 제품 정보 표현 수준에서 \"각 개인에 대한 맞춤형 경험\"을 달성할 수도 있다. 추가로, 특정 제품의 세부 정보를 사용자에게 표시할 때, 특정 설명 정보는 현지 표현 변환 처리 등을 거칠 수 있다. 즉, 실시형태에서, 특정 현지 표현 변환 처리가 다양한 시나리오에서 적용될 수 있다. 대응하여, 이는 추천 제품 정보 흐름 페이지, 제품 검색 결과 페이지, 및 제품 세부 정보 페이지와 같은 다양한 유형의 페이지에 제품 설명 정보의 프런트엔드 표현 차원에서 \"각 개인에 대한 맞춤형 경험\"을 달성할 수 있다. 여기서 표적 제품의 원본 설명 정보는 제품 정보 데이터베이스로부터 얻어질 수 있다. 일반적으로, 이 정보는 제품이 나열될 때 상인이 제공하며, 제목, 리치 미디어 정보(이미지, 비디오, 오디오 등 포함), 및 속성/매개변 수 정보를 포함한다. 추가로, 제품의 원본 설명 정보는 사용자 리뷰 및 기타 설명 정보를 포함할 수도 있다. 요 약하면, 특정 페이지에 표시해야 하는 모든 정보는 변환할 설명 정보로 간주될 수 있다. 변환 처리를 수행할 때, 모든 설명 정보를 변환하거나 이의 일부만을 변환하는 등을 수행할 수 있다. 실제 응용에서 동일한 표적 제품이 다수의 서로 다른 SKU(재고 관리 단위, 재고 측정의 기본 단위)와 연관될 수 있다는 점에 유의해야 한다. 이는 동일한 세부 정보 페이지를 공유할 수 있지만 각 SKU는 일반적으로 고유한 대 응하는 이미지, 제목 및 기타 설명 정보를 가진다. 예를 들어, 의류 품목은 S, M, L의 세 가지 사이즈와, 검정 과 흰색의 두 가지 색상으로 제공될 수 있다. 주문하기 전에 사용자는 일반적으로 세부 정보 페이지(일반적으로 세부 정보 페이지에 화면의 절반이 중복하여 표시됨)의 옵션을 통해 SKU 선택 인터페이스를 열어 특정 사이즈, 색상 및 기타 속성을 선택해야 한다. 예를 들어, 사용자가 S 사이즈와 흰색 색상을 선택하면 이는 사용자가 S 사이즈와 흰색 색상의 SKU를 구매하려고 의도하는 것을 나타낸다. SKU 선택 인터페이스를 통해 다양한 SKU에 대한 정보를 표시할 때 서로 다른 SKU에 대해 서로 다른 대표 이미지가 제공될 수 있다. 예를 들어, 전술한 사례 에서 서로 다른 색상의 의류 품목은 각각 고유한 이미지 등을 가질 수 있다. 기존 방식에서 서로 다른 사용자가 이 SKU 선택 인터페이스를 볼 때 표시되는 정보는 동일한 SKU에 대응하는 이미지를 포함하여 동일하다. 그러나, 본 출원의 실시형태에서, 이 SKU 선택 인터페이스에 표시되는 설명 정보는 현재 사용자의 국가 또는 지역에 기 초하여 현지 표현 처리를 거칠 수도 있다. 이를 통해 서로 다른 국가/지역의 현지 표현 방법에 따라 처리되었기 때문에 서로 다른 국가/지역의 사용자는 동일한 제품의 동일한 SKU에 대해 서로 다른 설명 정보를 보는 것이 보 장된다. 구체적으로, 이 솔루션은 동일한 SKU에 대해 국가 및 사용자 정보와 같은 요인을 고려하고, AI 생성 방 법을 사용하여 서로 다른 현지화 또는 개인화 프로세스를 수행한다. 여기에는 원본 텍스트 내용의 제품 이름 및 /또는 형용사와 관련된 키워드를 국가 또는 지역 속성에 대응하는 일반적으로 사용되는 현지 용어로 변환하는 것이 포함된다. 대안적으로, 표적 제품의 범주에 대한 국가 또는 지역 속성에 대응하는 인구의 속성 선호도에 기초하여 원본 제목 텍스트 내용은 제품 속성을 표현하는 것으로 변환될 수 있다. 추가로, 표적 사용자의 국가 또는 지역 속성에 기초하여 원본 사용자 리뷰 텍스트 내용은 국가 또는 지역 속성에 대응하는 현지 사용자 리뷰 표시를 우선시하기 위해 재정렬될 수 있다."}
{"patent_id": "10-2024-0109423", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "요약하면, 실시형태에서 각 SKU에 대응하는 원본 설명 정보를 얻는 것도 가능하다. 이후, 현지화 프로세스 동안, 이러한 SKU에 대응하는 원본 설명 정보는 현지 표현에 기초하여 처리될 수 있다. 이를 통해 다른 국가/지 역의 사용자는 동일한 SKU에 대해 다른 표적 설명 정보를 보는 것이 보장된다. 예를 들어, SKU의 제목, 이미지 및 기타 정보는 현지 표현 처리를 거칠 수 있다. 구체적으로, 흑백으로 이용 가능한 의류 품목의 전술된 예에서 각 색상은 다른 SKU 이미지에 대응한다. 본 출원의 실시형태에서, 사용자 A와 B가 다른 국가/지역에 있는 경우, 두 사용자가 모두 제품의 \"흰색\" 변형을 보더라도 \"흰색\"에 대해 표시되는 SKU 이미지는 다를 수 있으며, 각각 은 고유한 현지 표현을 가질 수 있다. 단계: 표적 사용자의 국가 또는 지역 속성 정보를 결정하는 단계. 제품의 원본 설명 정보를 결정하는 것에 더하여, 표적 사용자가 속한 특정 국가/지역을 포함하여 특정 표적 사 용자의 국가 또는 지역 속성도 결정될 수 있다. 이 정보는 사용자의 국가/지역을 확인하기 위해 예를 들어 사용 자의 IP(인터넷 프로토콜) 주소, 자주 사용하는 배송 주소 및 기타 정보를 사용하는 것과 같은 다양한 방법으로 결정될 수 있다. 추가로, 사용자가 특정 국가/지역에 살고 있지만 원래는 다른 국가/지역 출신이고 원본 습관을 유지하는 경우가 있다. 따라서, 사용자의 과거 행동 기록도 실제 국가 또는 지역 속성을 결정하는 데 사용될 수 있다. 예를 들어, 사용자의 IP 주소는 국가 A에 있음을 나타내지만 검색 기록 및 쇼핑 습관은 국가 B에서 온 것 일 가능성이 더 높다는 것을 시사하는 경우, 국가 B가 사용자의 국가/지역 속성으로 사용될 수 있다. 특정 구현예에서, 사용자의 국가 또는 지역 속성 정보를 얻는 것에 더하여 다른 사용자 프로파일 데이터도 획득 될 수 있다는 점에 유의해야 한다. 여기에는 사용자가 남성인지 여성인지, 그리고 청년인지, 중년인지, 노인인 지와 같은 정보가 포함된다. 이 사용자 프로파일 데이터는 다른 차원에서 제품의 프런트엔드 설명 정보를 개인 화하는 데에도 사용될 수 있다. 단계 203: 표적 사용자의 국가 또는 지역 속성 정보에 기초하여 현지 표현에 맞게 원본 설명 정보를 처리하여 표적 설명 정보를 생성하는 단계. 적어도 하나의 표적 제품 및 그 원본 설명 정보, 및 표적 사용자의 국가 또는 지역 속성을 결정한 후, 원본 설 명 정보는 이러한 국가 또는 지역 속성에 기초하여 현지화되어 표적 설명 정보가 생성될 수 있다. 특정 원본 설명 정보는 텍스트 정보, 이미지 정보, 속성/매개변수 설명 등과 같은 다양한 정보 모달리티를 포함 할 수 있다. 다양한 정보 모달리티는 별도로 처리될 수 있거나, 특정 정보 모달리티만이 처리될 수 있다. 구체적으로, 텍스트 정보의 경우, 이는 제품 제목, 제품 세부 정보 페이지의 텍스트 및 이미지 세부 정보, 사용 자 리뷰 내용 및 기타 텍스트 관련 정보를 포함할 수 있으며, 이 모든 정보는 변환될 수 있다. 물론, 제품 나열 페이지(예를 들어, 추천 제품 정보 흐름 페이지 또는 검색 결과 페이지)의 경우 텍스트와 이미지 세부 정보 또 는 사용자 리뷰가 포함되지 않을 수 있다. 따라서, 변환은 제목 부분 등에만 적용될 수 있다. 구체적으로, 텍스트 정보에 대한 변환 처리를 수행할 때, 표적 제품의 원본 텍스트 정보는 표적 사용자의 국가 또는 지역 속성에 기초하여 현지화되어 표적 페이지에 표시되는 표적 텍스트가 생성된다. 텍스트 정보의 현지화 기반 변환을 수행할 때 가장 기본적인 변환에는 원본 텍스트 정보의 제품 이름 및/또는 형용사와 관련된 키워드를 국가 또는 지역 속성에 대응하는 일반적으로 사용되는 현지 용어로 변환하는 것이 포 함될 수 있다. 예를 들어, 제품의 원본 제목에 \"橙子\"[병음: Chengzi](오렌지)라는 용어가 포함되어 있고, 현재표적 사용자가 대만 출신인 경우 \"橙子\"[병음: Chengzi](오렌지)라는 용어는 \"柳丁\"(병음: Liuding; 대만 방언 으로 \"오렌지\")로 변환될 수 있다. 유사하게, 원본 제목에 형용사 \"漂亮\"(병음: Piaoliang; 아름다운)이 포함되 어 있고, 현재 표적 사용자가 홍콩 출신인 경우 \"漂亮\"는 \" \"(병음: Liang; 홍콩 방언으로 \"아름다운\")로 변 환될 수 있다. 추가로, 원본 제목 텍스트 정보를 변환하는 동안 제목 텍스트에 제품 속성의 표현과 관련된 내용이 포함되는 경 우가 있을 수 있다. 이러한 경우 명사 및 형용사와 같은 키워드를 일반적으로 사용되는 현지 용어로 변환하는 것 외에 제품 속성과 관련된 텍스트 내용은 표적 제품의 범주에 대해 국가 또는 지역 속성에 대응하는 인구의 속성 선호도에 기초하여 변환될 수도 있다. 제품 속성 표현과 관련된 텍스트 내용을 변환할 때 다양한 방법이 사용될 수 있다. 예를 들어, 원본 제목 텍스트에서 제품 속성 표현과 관련된 표적 텍스트 내용이 삭제되거나 다 른 속성 값으로 변환될 수 있고, 또는 제품 속성 표현과 관련된 텍스트 내용은 원본 제목 텍스트에 추가되는 등 이 수행될 수 있다. 예를 들어, \"보온병(thermos cup)\"과 같은 제품의 경우 용량 특징을 강조하기 위해 제목 텍스트는 \"500ml\"과 같 은 특정 매개변수 값을 포함할 수 있다. 그러나, 일부 지역의 사용자는 용량이 \"375ml\"인 \"보온병\"을 선호할 수 있다. 제품이 또한 \"375ml\"에 대응하는 SKU(재고 관리 단위)를 갖는 경우 이 지역의 사용자에게 제품 정보를 표 시할 때 제목의 속성 값 \"500ml\"은 \"375ml\"로 변경될 수 있다. 유사하게, \"보조 배터리\"와 같은 제품의 경우 중 국 본토의 사용자는 \"대용량\" 기능에 더 관심이 있을 수 있으므로 제목이 \"20000mAh\"와 같은 속성 값을 포함할 수 있다. 그러나, 홍콩의 사용자는 용량 정보에 관심이 없을 수 있다. 따라서, 표적 사용자가 홍콩에 있는 경우 제목에서 \"20000mAh\" 속성 값이 제거되는 등이 수행될 수 있다. 추가로, 특정 텍스트 정보는 사용자 리뷰 내용을 포함할 수도 있다. 변환 처리를 수행할 때 명사 및 형용사와 같은 키워드를 일반적으로 사용되는 현지 용어로 변환하는 것 외에 원본 사용자 리뷰 텍스트 내용은 표적 사용 자의 국가 또는 지역 속성에 기초하여 재정렬될 수도 있다. 이는 표적 사용자의 국가 또는 지역 속성에 대응하 는 현지 사용자 리뷰 텍스트 내용의 표시를 우선시한다. 다시 말해, 국경 간 전자 상거래 시나리오에서 동일한 제품을 리뷰하는 사용자는 전 세계의 다른 지역으로부터 올 수 있다. 현재 사용자와 동일하거나 유사한 국가/지 역에 있는 사용자의 리뷰가 사용자에게 더 관련성이 있을 수 있다. 따라서, 실시형태에서 현재 표적 사용자의 국가 또는 지역 속성에 대응하는 현지 사용자 리뷰 텍스트 내용은 우선시될 수 있다. 이를 통해 표적 사용자가 표적 제품의 사용자 리뷰를 볼 때 이러한 현지 사용자 리뷰를 먼저 볼 수 있는 것이 보장된다. 텍스트 정보의 현지화 기반 변환을 수행하는 과정에서는 전통적인 방법을 사용할 수 있다는 점에 유의해야 한다. 예를 들어, 사전에 데이터를 수집하고 분석함으로써 다양한 국가/지역에서 일반적으로 사용되는 용어의 대응 어휘 데이터베이스를 구축할 수 있다. 이러한 방식으로 실제 변환 과정 동안 어휘 데이터베이스를 질의 (query)함으로써 키워드 교체를 수행할 수 있다. 그러나, 이 방법은 비용이 많이 들고 어휘 데이터베이스의 규 모와 유형이 매우 제한적이다. 예를 들어, 특정 키워드에 특정 국가/지역의 어휘 데이터베이스에 대응하는 일반 적으로 사용되는 용어가 없는 경우 변환을 달성할 수 없다. 추가로, 이 간단한 키워드 교체 방법은 문맥적 일관 성이 부족한 텍스트를 생성하거나 표적 사용자의 국가/지역에서 사용되는 구문과 매칭하지 않는 문법적 표현을 생성할 수 있다. 위의 문제를 해결하기 위해, AI 대형 모델을 활용하여 선호하는 방법으로 텍스트 내용의 현지화 기반 변환을 달 성할 수 있다. 구체적으로, 일부 기존 AI 대형 모델은 내용과 지식이 매우 풍부하고, 자연어로 표현된 \"질문\"을 이해할 수 있으며, 특정 질문에 기초하여 새로운 내용을 생성할 수 있다. 새로이 생성된 텍스트 내용은 일반적 으로 맥락 및 기타 양태에서 좋은 일관성을 보인다. 따라서, 본 출원의 바람직한 실시형태에서, 원본 제목 텍스 트와 표적 사용자의 국가 또는 지역 속성 정보를 AI 대규모 매개변수 모델에 입력할 수 있다. 이 AI 모델은 표 적 제품의 원본 제목 텍스트의 현지화 기반 변환을 수행한다. 나아가, AI 모델은 변환된 텍스트 내용을 추가로 처리할 수도 있다. 예를 들어, 국가 또는 지역 속성 정보에 대응하는 현지 표현 방식에 기초하여 AI 모델은 변 환된 텍스트 내용을 처리하여 현지 문법적 표현 습관을 준수하고/하거나 문맥적 일관성을 유지하여 표적 텍스트 내용을 생성하는 것을 보장할 수 있다. 일부 일반적인 AI 대형 모델의 경우, 특정 텍스트 내용의 현지화 기반 변환을 위해 이러한 모델을 직접 활용하 는 것은 내용 생성을 위한 AI 모델의 기존 지식에 전적으로 의존한다. 이 경우에, 생성된 텍스트 내용이 충분히 정확하지 않은 경우가 있을 수 있다. 따라서, 특정 구현예에서, AI 대형 모델이 생성한 내용이 실시형태의 적용 시나리오에 더 적합한 것을 보장하기 위해 AI 대형 모델을 표적화된 훈련으로 사전 훈련할 수 있다. 즉, AI 대 형 모델은 풍부한 내용을 포함하지만 실시형태에서 설명한 시나리오에 대한 귀중한 정보를 효과적으로 추출하는것이 중요하다. 이 프로세스는 궁극적으로 AI 대형 모델이 생성한 내용이 인간의 개입 없이도 높은 신뢰성을 갖 는 것을 보장한다. 이러한 목표를 달성하기 위해, 훈련 동안 하나의 접근 방식은 AI 대형 모델에 긍정적 및 부정적 샘플을 모두 입 력하는 것이다. 이러한 샘플에는 다양한 국가/지역에 대해 대응하는 현지 변환 결과와 함께 제품 제목 및 기타 텍스트 내용이 포함될 수 있다. 이러한 샘플을 AI 대형 모델에 입력함으로써 모델은 텍스트 내용의 현지화 기반 변환 프로세스에 필요한 특정 \"지식\"을 학습할 수 있다. 전술한 접근 방식은 샘플을 구성하는 데 상당한 작업 부하와 높은 훈련 비용을 수반할 수 있다. 따라서, 다른 접근 방식에서 보다 풍부한 정보를 포함하는 보다 포괄적인 어휘 데이터베이스가 AI 대형 모델을 사용하여 사전 구축될 수 있다. 이 어휘 데이터베이스는 그런 다음 모델의 입력으로 사용될 수 있다. 이 사전 구축된 어휘 데 이터베이스를 활용함으로써 AI 대형 모델은 특정 텍스트 내용의 변환 및 기타 처리를 수행하여 AI 대형 모델이 생성된 내용의 사용 가능성을 어느 정도 향상시킬 수 있다. 구체적으로, 초기 단계에서 다수의 국가/지역에서 일반적으로 사용되는 용어의 긍정적 및 부정적 샘플을 포함하는 소규모 사전을 준비할 수 있다(예를 들어, 중국 본토의 \" \"[병음: Shipin](비디오)와 홍콩의 \" \"[병음: Shixun](비디오)와 같은 용어 간의 대응 관계). 이러한 샘플은 AI 대형 모델에 입력될 수 있다. 추가로, 특정 국가/지역의 고유한 현지화 요구 사항을 해결하기 위해 특정 규칙을 수립할 수 있다. 예를 들어, 홍콩에서는 출력이 중국어 번체로 표시되어야 하는 반 면, 대만에서는 하카 방언으로 표시되어야 하는 등이다. 추가로, 주요 범주를 식별하고 이러한 주요 범주에 기 초하여 규칙을 수립할 수 있다. 앞서 언급한 긍정적 및 부정적 샘플을 규칙과 함께 입력함으로써, AI 대형 모델 은 데이터를 생성할 뿐만 아니라 일반화된 결과를 생성하도록 명령받을 수 있다. 이것은 AI 대형 모델이 제공된 소규모 샘플과 규칙에 기초하여 일반화될 수 있음을 의미한다. 예를 들어, 샘플이 \"橙子[병음: Chengzi](중국 본토) - 柳丁[병음: Liuding](대만)\" 쌍을 포함하는 경우, 모델은 인터넷에서 \"橙子\"[병음: Chengzi] 범주와 관 련된 모든 용어를 검색하여 다른 국가/지역에서 일반적으로 사용되는 용어를 식별할 수 있다. 이러한 방식으로, AI 대형 모델은 제한된 샘플 세트에 기초하여 일반화될 수 있다. 일반화 프로세스는 또한 실시형태에 설명된 시 나리오에 특화되어 AI 대형 모델에 대한 관련 지식으로 입력되는 특정 규칙을 따라야 한다. 명사 관련 키워드에 대한 보다 포괄적인 어휘 데이터베이스를 구축하는 것에 더하여, 유사한 처리를 형용사 관련 키워드에 적용할 수 있다. 이를 통해 AI 대형 모델은 형용사에 대한 현지화 기반 변환도 수행할 수 있다. 추가로, 명사와 형용사 간에는 일반적으로 특정한 결합 관계가 있어서, 모든 명사와 형용사를 함께 사용할 수 있는 것은 아니기 때문에, 더 나은 결과를 얻기 위해 호환성에 기초하여 특정 명사와 형용사에 태그를 추가하여 단어 매칭에 허용되는 조합 등을 지정할 수 있다. 나아가, 앞서 언급한 샘플과 규칙을 사용하여 AI 대형 모델은 생성하는 내용을 검증하고 내용에 점수를 매길 수 도 있다. 지속적인 최적화와 훈련을 통해 생성된 내용이 실시형태에서 설명된 적용 시나리오에 대한 사용 가능 성 요구 사항을 충족하는 것을 보장하는 것이 목표이다. 위의 방법에서, 보다 포괄적인 어휘 데이터베이스가 오프라인에서 생성되었기 때문에, 텍스트 내용의 현지화 기 반 변환 프로세스가 더욱 정교해질 수 있다. 원본 텍스트 내용, 현재 표적 사용자의 국가 또는 지역 속성 정보, 및 오프라인에서 생성된 어휘 데이터베이스가 AI 대형 모델에 입력될 수 있다. 이를 통해 AI 대형 모델은 어휘 데이터베이스에 기초하여 키워드를 일반적으로 사용되는 현지 용어로 대체할 수 있다. 추가로, 모델은 특히 문 법적 표현의 현지화를 수행하고 문맥적 일관성을 보장할 수 있다. 이러한 방식으로, 어휘 데이터베이스가 사전 에 오프라인에서 생성되었으므로(그리고 주기적으로 업데이트될 수 있으므로), AI 대형 모델은 어휘 데이터베이 스에 질의하여 대체해야 할 특정 표적 키워드를 얻을 수 있다. 그런 다음, 문법적 및 문맥적 일관성과 같은 양 태만을 처리하면, 내용 생성 효율성을 더욱 개선하고 실시간 요구 사항을 더 잘 충족할 수 있다. 어휘 데이터베 이스에 특정 국가/지역에서 일반적으로 사용되는 용어가 포함되어 있지 않은 경우, AI 대형 모델은 웹 전체에서 지식을 검색하는 등의 작업을 통해 이들 용어를 파악할 수도 있다. 유사하게, 다수의 국가/지역에 대응하는 현지 문법적 표현 습관과 속성 선호도 정보 샘플도 AI 대형 모델에 입 력될 수 있다. 이를 통해 AI 대형 모델은 속성 선호도 및 현지 문법적 표현 습관과 관련된 지식을 획득할 수 있 어서, 모델은 텍스트에서 속성 표현과 관련된 내용의 현지 변환을 수행하고, 최종 생성된 텍스트 내용이 문법적 및 기타 양태에서 현지 표현 습관과 더 잘 부합하도록 할 수 있다. 이러한 방식으로, 특정 제품의 설명적 정보 를 표적 사용자를 위해 변환해야 할 때, AI 대형 모델에 입력되는 정보에는 원본 텍스트 내용과 표적 사용자의 국가 또는 지역 속성뿐만 아니라 미리 수립된 지식 기반 및/또는 규칙 정보가 포함될 수 있다. 특정 지식 기반 에는 다수의 국가/지역에 대해 현지에서 일반적으로 사용되는 용어, 속성 선호도 정보 및/또는 현지 문법적 표현 습관이 포함될 수 있다. 특정 규칙 정보에는 특정 국가/지역에 대한 특별한 현지화 요구 사항 등이 포함될 수 있다. 지식 기반은 다른 방법 중에서도 AI 대형 모델에 의해 오프라인으로 생성될 수 있다. 텍스트 내용에 대한 변환 프로세스는 위에서 소개되었다. 또 다른 유형의 설명적 정보는 제품의 속성/매개변수 설명이다. 다시 말해, 변환이 필요한 원본 설명적 정보에는 속성/매개변수 설명이 포함될 수 있다. 예를 들어, 의류 제품의 경우 속성/매개변수에는 사이즈와 색상이 포함될 수 있다. 가전 제품의 경우 속성/매개변수에는 용 량과 색상 등이 포함될 수 있다. 이러한 속성/매개변수 정보에는 종종 국가/지역마다 다를 수 있는 측정 단위가 포함된다. 예를 들어, 일반적으로 사용되는 제품 사이즈는 신발 사이즈, 의류 사이즈, 무게 등을 포함하여 지역 마다 상당히 다를 수 있다. 구체적으로, 미국에서 6 사이즈 신발은 중국에서 23.5 사이즈에 해당하고, 유럽에서 는 37 사이즈에 해당한다. 따라서, 표적 사용자의 국가 또는 지역 속성에 기초하여 표적 제품의 원본 속성/매개 변수 설명은 현지화 기반 변환 처리를 거칠 수 있다. 이를 통해 표적 속성/매개변수 설명이 생성되고, 이는 표 적 페이지에 표시될 수 있다. 속성/매개변수 설명을 변환할 때 하나의 접근 방식은 표적 사용자의 국가 또는 지역 속성을 사용하여 표적 제품 의 원본 속성/매개변수 설명을 현지 표준 또는 단위로 변환하는 것이다. 예를 들어, 신발의 원본 \"사이즈\" 속성 이 유럽 사이즈로 36, 37, 38로 표현된 경우 미국 사용자의 경우 미국 사이즈로 5, 5.5, 6으로 변환될 수 있는 등이다. 반면에, 표적 제품이 서로 다른 속성/매개변수 값에 해당하는 다수의 SKU와 연관되어 있는 경우, 이러한 SKU를 재정렬하여 사용자의 국가 또는 지역 속성에 해당하는 현지에서 일반적으로 사용되는 속성/매개변수 값을 가진 SKU의 표시를 우선시할 수 있다. 서로 다른 SKU에 해당하는, 500ml 및 375ml와 같은 서로 다른 값을 포함하는 \"용량\" 속성이 있는 \"유아용 젖병\" 제품의 경우, 디폴트 표시는 500ml SKU를 우선시할 수 있다. 그러나, 350ml 가 더 선호되는 용량인 홍콩의 사용자의 경우 350ml SKU를 우선시할 수 있다. 유사하게, 110V 및 220V와 같이 다양한 전압 값을 지원하는 SKU가 있는 특정 전기 제품의 경우, 디폴트 표시는 220V SKU를 우선시할 수 있다. 그러나, 일본과 같은 국가/지역에 있는 사용자의 경우 110V SKU가 우선순위가 지정될 수 있다. 제품의 속성/매개변수 설명에 대해 현지화 기반 변환을 수행할 때 기존 방법을 사용할 수 있다. 대안적으로, 원 본 속성/매개변수 설명과 표적 사용자의 국가 또는 지역 속성을 AI 대규모 매개변수 모델에 입력할 수 있다. 그 런 다음 이 모델은 표적 제품의 원본 속성/매개변수 설명에 대해 현지화 기반 변환을 수행할 수 있다. AI 모델 이 속성/매개변수 관련 설명 정보를 보다 정확하게 변환할 수 있도록 하기 위해 모델을 표적 훈련으로 사전 훈 련할 수 있다. 추가로, 다양한 국가/지역이 다양한 차원에 걸쳐 다양한 속성을 일반적으로 표현하는 방식에 대 한 지식을 AI 모델에 입력할 수 있다. 이를 통해 AI 모델은 보다 유용한 내용을 생성할 수 있다. 텍스트 내용 및 속성/매개변수 설명에 더하여 특정 제품 설명 정보에는 이미지 및 오디오와 같은 리치 미디어 정보도 포함될 수 있다. 이것은 변환이 필요한 원본 설명 정보에는 사진, 비디오 및 오디오와 같은 제품의 리치 미디어 정보도 포함될 수 있음을 의미한다. 따라서 표적 사용자의 국가 또는 지역 속성에 기초하여 표적 제품의 원본 리치 미디어 정보를 현지화 기반 변환 처리를 거쳐 표적 리치 미디어 정보를 생성할 수 있다. 그런 다음 표적 리치 미디어 정보를 지정된 웹페이지에 표시할 수 있다. 이미지 정보를 처리할 때, 현지화 기반 변환에는 이미지의 구성 스타일, 사용된 모델 유형 및/또는 분위기 요소 에 대한 조정이 포함될 수 있다. 구체적으로, 이미지 정보를 처리할 때, 현지화 기반 변환에는 이미지의 구성 스타일, 사용된 모델 유형 및/또는 분위기 요소에 대한 조정이 포함될 수 있다. 제품 구성은 지역 선호도에 기 초하여 재생성될 수 있다. 예를 들어, 브라질의 사용자는 생동감 있고 다채로운 구성을 선호하는 반면, 유럽과 북미의 사용자는 미니멀리스트 스타일을 선호한다. 따라서, 이미지의 구성 스타일은 다른 국가/지역의 사용자의 선호도에 따라 조정될 수 있다. 모델 유형과 관련하여, 미국/유럽 사용자와 아시아 사용자 간에는 상당한 체형 차이가 있다. 아시아 사용자는 상큼하고 날씬해 보이는 모델을 선호하는 반면, 미국과 유럽 사용자는 풍만한 체 형의 모델을 선호할 수 있다. 추가로, 미국과 유럽 지역의 사용자는 일반적으로 풍만한 체형을 가지고 있기 때 문에, 이 체형과 매칭하는 모델을 사용하면 사용자가 제품과 연결감을 느낄 수 있다. 이미지의 분위기 요소는 일반적으로 특정 무드나 분위기를 생성하기 위해 추가된다. 그러나, 일부 요소는 특정 국가/지역의 사용자에게 민감할 수 있다. 예를 들어, \"수박\"은 아프리카 사용자, 특히 아프리카계 미국인 사용자에게 민감한 요소일 수 있다. 따라서, 이러한 분위기 요소는 민감한 요소를 제거하거나 다른 요소로 대체함으로써 조정될 수도 있다. 이미지 내용의 현지화 기반 변환을 수행할 때, 이는 AI 대규모 매개변수 모델을 통해서도 달성될 수 있다. 구체 적으로, AI 모델은 주제 인식, 이미지 추출 및 대체와 같은 작업을 처리할 수 있다. 예를 들어, 모델 유형을 변 환하는 프로세스는 AI 모델이 표적 사용자의 국가/지역에 기초하여 적절한 모델 이미지를 생성함으로써 처리될수 있다. 그런 다음 이러한 새로운 모델 이미지를 현재 제품 이미지와 매칭하여 새로운 제품 이미지를 생성할 수 있다. 예를 들어, 이미지에 원래 드레스를 입은 아시아 모델이 등장하는 경우, 미국 및 유럽 사용자에게 제 품을 표시할 때 이 모델을 미국 및 유럽 지역 사용자의 일반적인 외모와 체형을 가진 모델로 대체할 수 있다. 드레스 이미지를 새로운 모델의 체형에 맞게 조정할 수 있다. 마지막으로, 새로운 모델 이미지를 특정 배경 이 미지 및 분위기 요소와 결합하여 최종 표적 이미지를 생성할 수 있다. 변환된 모델 이미지는 AI 대형 모델에 의해 생성된 가상 모델 형상일 수 있다는 점에 유의해야 한다. 처리 효율 성을 높이기 위해, 특정 국가/지역의 대표적인 가상 모델 이미지를 사전에 오프라인에서 생성할 수 있다. 변환 프로세스 동안, 이러한 사전 저장된 이미지로부터 적합한 가상 모델 이미지를 선택하고 특정 제품 이미지를 이 가상 모델과 매칭시킬 수 있다. 각 국가/지역은 다수의 서로 다른 가상 모델 이미지를 가질 수 있다. 이를 통해 다수의 제품이 포함된 페이지에서 서로 다른 제품 이미지와 함께 서로 다른 가상 모델 이미지를 사용할 수 있으 므로 동일한 페이지의 다수의 제품에 동일한 가상 모델 이미지가 표시되는 시나리오를 피할 수 있다. 추가로, 제품 이미지를 가상 모델 이미지와 매칭시킬 때 제품의 특정 속성/매개변수를 고려해야 한다. 예를 들 어, 일부 의류 소재는 탄력성이 부족하거나 사이즈가 작아서 미국 및 유럽의 풍만한 체형 사용자에게 적합하지 않을 수 있다. 이러한 경우, 미국과 유럽 사용자를 대표하는 모델로 대체할 필요가 없을 수 있으므로 잠재적인 소비자 혼란이나 오해의 소지가 있는 정보를 피할 수 있다. 실제로, AI 대형 모델을 모델 변환에 사용하는 경우 제품의 특정 속성/매개변수도 AI 모델에 입력될 수 있다. 이를 통해 AI 모델은 포괄적인 결정을 내리고 적절한 변환 결과를 출력할 수 있다. 특정 제품의 원본 설명 정보에 비디오의 배경 음악과 같은 오디오 정보도 포함되어 있는 경우, 이 오디오 정보 도 현지화 기반 변환을 거칠 수 있다. 예를 들어, 표적 사용자가 인도 출신인 경우, 제품의 배경 음악을 인도 지역의 스타일을 반영하는 오디오로 대체할 수 있는 등일 수 있다. 단계 204: 표적 사용자의 클라이언트 디바이스에 하나 이상의 표적 제품에 대응하는 표적 설명 정보를 제공하여 지정된 웹페이지에 표적 설명 정보를 제공하는 단계. 표적 제품 객체의 텍스트 내용, 속성/매개변수 설명, 멀티미디어 정보 등의 현지 표현 변환 처리 후, 표적 사용 자의 해당 클라이언트에게 반환될 수 있다. 클라이언트는 특정 지정된 웹페이지를 통해 표적 사용자에게 제공한 다. 특정 지정된 웹페이지는 추천 제품 정보 스트림 페이지, 제품 검색 결과 페이지, 제품 세부 정보 페이지 등 일 수 있다."}
{"patent_id": "10-2024-0109423", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "요약하면, 본 출원의 실시형태를 통해, 표적 사용자에게 표적 제품 객체에 대한 정보를 제공할 필요가 있을 때, 표적 제품 객체의 원본 설명 정보와 표적 사용자의 현지 속성 정보를 먼저 얻을 수 있다. 그런 다음, 표적 사용 자의 국가 또는 지역 속성 정보에 기초하여, 원본 설명 정보를 현지 표현에 맞게 처리하여 지정된 웹페이지를 통해 표적 사용자에게 제공될 표적 설명 정보를 생성할 수 있다. 이를 통해, 지정된 웹페이지에서 제공되는 제 품 객체 설명 정보의 표현에서 \"각 개인에 대한 맞춤형 경험\"을 달성할 수 있어 표적 사용자의 국가/지역의 현 지화 선호도와 더욱 부합하게 한다. 이러한 접근 방식은 사용자의 쇼핑 열정을 자극하고, 사용자 경험을 향상시 키고, 결과적으로 클릭률 및 전환율과 같은 지표를 개선할 가능성이 더 높다. 바람직한 방법에서, 다중 모달 내용의 이해와 생성에서 AI 대규모 매개변수 모델의 기능을 활용하여 제품 설명 정보의 현지 표현 변환을 완료하는 데 도움을 줄 수 있다. 이를 통해 효율성을 개선하고 변환된 텍스트 내용의 맥락적 일관성을 강화할 수 있다. 물론, AI 대형 모델에서 생성된 내용의 더 높은 유용성과 정확성을 보장하기 위해 특정 샘플, 규칙 및 기타 방법을 사용하여 AI 모델을 사전 훈련하는 것도 가능하다. 실시형태 2 실시형태 2는 실시형태 1에 대응한다. 클라이언트의 관점에서, 이는 제품 객체 정보를 제공하는 방법을 제공한 다. 도 3을 참조한다. 방법은 구체적으로 하기 단계를 포함할 수 있다: 단계 301: 표적 사용자에 대해 제공되는 적어도 하나의 표적 제품 객체의 표적 설명 정보를 서버로부터 수신하 는 단계로서, 여기서 표적 설명 정보는 표적 사용자의 국가적 또는 지역 속성 정보에 기초하여 현지 표현에 맞 게 표적 제품 객체의 원본 설명 정보를 변환함으로써 생성되는, 수신하는 단계; 및 단계 302: 적어도 하나의 표적 제품 객체의 표적 설명 정보를 지정된 웹페이지에 표시하는 단계. 실시형태 2에 상세히 설명되지 않은 부분은 실시형태 1의 설명이나 본 명세서의 다른 부분을 참조할 수 있으며, 여기서는 반복하지 않는다. 본 출원의 실시형태는 사용자 데이터 사용을 포함할 수 있음에 유의해야 한다. 실제 적용 시, 사용자별 개인 데 이터는 본 명세서에 설명된 솔루션에서 관련 국가의 적용 가능한 법률 및 규정(예를 들어, 명시적인 사용자 동 의, 적절한 사용자 알림 등)을 준수하고, 해당 법률 및 규정의 허용 범위 내에서 사용될 수 있다. 실시형태 1에 대응하여, 본 출원의 실시형태는 또한 제품 객체 정보를 제공하기 위한 디바이스를 제공한다. 도 4를 참조하면, 디바이스는 하기를 포함할 수 있다: 표적 사용자에게 제공될 적어도 하나의 표적 제품 객체 및 그 원본 설명 정보를 식별하도록 구성된 원본 설명 정보 결정 유닛; 표적 사용자의 국가 또는 지역 속성 정보를 결정하도록 구성된 사용자 속성 정보 결정 유닛; 표적 사용자의 국가 또는 지역 속성 정보에 기초하여 현지 표현에 맞게 원본 설명 정보를 처리하여 표적 설명 정보를 생성하도록 구성된 현지화 처리 유닛; 적어도 하나의 표적 제품 객체에 대응하는 표적 설명 정보를 사용자의 클라이언트 디바이스에 제공하여 지정된 웹페이지에 표적 설명 정보를 제공하도록 구성된 정보 제공 유닛. 구체적으로, 현지화 처리 유닛은, 인공 지능(AI) 대규모 매개변수 모델을 활용하여 원본 설명 정보를 이해하고, 사용자의 국가 또는 지역 속성 정 보에 기초하여 현지 표현에 맞게 원본 설명 정보를 처리하여 표적 설명 정보를 생성하는 데 이용될 수 있다. 원본 설명 정보는 표적 제품 객체의 원본 텍스트 내용을 포함하고; 이 경우, 현지화 처리 유닛은, 사용자의 국가 또는 지역 속성 정보에 기초하여 표적 제품 객체의 원본 텍스트 내용에 대한 현지화 표현 변환 처리를 수행하여 표적 텍스트 내용을 생성하여 표적 텍스트 내용을 지정된 웹페이지에 표시할 수 있도록 하는 데 특별히 이용될 수 있다. 구체적으로, 원본 텍스트 내용에 포함된 제품 이름 및/또는 형용사와 관련된 키워드는 국가 또는 지역 속성 정 보에 대응하는 현지 일반 용어로 변환될 수 있다. 원본 텍스트 내용은 원본 제목 텍스트 내용을 포함하고; 이 경우, 현지화 처리 유닛은 또한 구체적으로 표적 제품 객체가 속한 상품의 범주에 대해 국가 또는 지역 속성 정보에 대응하는 인구 통계의 속성 선호도 정 보에 기초하여 제품 속성 표현과 관련된 원본 제목 텍스트 내용의 변환 처리를 수행하는 데 이용될 수 있다. 구체적으로, 제품 속성의 표현과 관련된 원본 제목 텍스트 내용은 삭제되거나, 다른 속성 값으로 변환될 수 있 고, 또는 제품 속성의 표현과 관련된 추가 텍스트 내용이 원본 제목 텍스트 내용에 추가될 수 있다. 대안적으로, 원본 텍스트 내용은 원본 사용자 리뷰 텍스트 내용을 포함하고; 이 경우, 현지화 처리 단위는 또한 구체적으로 표적 사용자의 국가 또는 지역 속성 정보에 기초하여 원본 사용자 리뷰 텍스트 내용을 재정렬하여 국가 또는 지 역 속성 정보에 대응하는 현지 사용자 리뷰 텍스트 내용이 표시되는 우선 순위로 지정되도록 하는 데 이용될 수 있다. 구체적으로, 현지화 처리 유닛은 특히 AI 대규모 매개변수 모델에 원본 텍스트 내용과 사용자의 국가 또는 지역 속성 정보를 입력하여 AI 대규모 매개 변수 모델이 표적 제품 객체의 원본 텍스트 내용에 대한 현지화 표현 변환 처리를 수행할 수 있도록 하는 데 이 용될 수 있고; AI 대규모 매개변수 모델은 또한 국가 또는 지역 속성 정보에 대응하는 현지화 표현 스타일에 따라 변환된 텍스 트 내용을 처리하여 표적 텍스트 내용을 생성하여 현지 문법적 표현 습관 및/또는 문맥적 일관성을 준수하는 것 을 보장하는 데 사용될 수 있다. AI 대규모 매개변수 모델에 정보를 입력하는 것은 또한 미리 수립된 지식 기반 및/또는 규칙 정보를 포함할 수 있고, 여기서 지식 기반은 다수의 국가/지역에 대한 현지 일반 용어, 속성 선호도 정보 및/또는 현지 문법적 표 현 습관을 포함한다. 규칙 정보에는 특정 국가/지역에 대한 특정 현지화 요구 사항이 포함된다. 추가로, 원본 설명 정보는 표적 제품 객체의 원본 속성/매개변수 설명을 포함하고; 이 경우, 현지화 처리 유닛은 특히 사용자의 국가 또는 지역 속성 정보에 기초하여 표적 제품 객체의 원본 속성/매개변수 설명에 대한 현지화 표현 변환 처리를 수행하여 표적 속성/매개변수 설명을 생성하여 표적 속성/매개변수 설명이 지정된 웹페이지에 표시 될 수 있도록 하는 데 이용될 수 있다. 구체적으로, 사용자의 국가 또는 지역 속성 정보에 기초하여, 표적 제품 객체의 원본 속성/매개변수 설명은 현 지에서 일반적으로 사용되는 표준 또는 단위로 변환될 수 있다. 대안적으로, 표적 제품 객체가 서로 다른 속성 값/매개변수 값을 갖는 다수의 재고 관리 단위(SKU)와 연관되어 있는 경우, 이러한 SKU를 재정렬하여 국가 또는 지역 속성 정보에 기초하여 현지에서 일반적으로 사용되는 속성 값/매개변수 값에 대응하는 SKU가 표시되는 우선 순위로 지정되도록 한다. 구체적으로, 현지화 처리 유닛은 특히 사용자의 원본 속성/매개변수 설명 및 국가 또는 지역 속성 정보를 AI 대규모 매개변수 모델에 입력하여, AI 대 규모 매개변수 모델이 표적 제품 객체의 원본 속성/매개변수 설명에 대한 현지화 표현 변환 처리를 수행할 수 있도록 하는 데 이용될 수 있다. 추가로, 원본 설명 정보는 표적 제품 객체의 원본 리치 미디어 정보를 포함하고; 이 경우, 현지화 처리 유닛은 특히 사용자의 국가 또는 지역 속성 정보에 기초하여 표적 제품 객체의 원본 리치 미디어 정보에 대한 현지화 표현 변환 처리를 수행하여 표적 멀티미디어 정보를 생성하여, 표적 리치 미디어 정보가 지정된 웹페이지에 표시될 수 있도록 하는 데 이용될 수 있다. 구체적으로, 원본 멀티미디어 정보는 원본 이미지 정보를 포함하고; 이 경우, 현지화 처리 유닛은 특히 사용자의 국가 또는 지역 속성 정보에 기초하여 원본 이미지 정보의 구성 스타일, 모델 유형 및/또는 대기 요소 에 대한 변환 처리를 수행하여 국가 또는 지역 속성 정보에 대응하는 현지화 선호도와 부합하는 표적 이미지 정 보를 생성하는 데 이용될 수 있다. 구체적으로, 사용자의 원본 이미지 정보와 국가 또는 지역 속성 정보는 AI 대규모 매개변수 모델에 입력되어, AI 대규모 매개변수 모델이 원본 이미지 정보의 구성 스타일, 모델 유형 및/또는 분위기 요소에 대한 변환 처리 를 수행할 수 있도록 할 수 있다. 원본 이미지 정보의 모델 유형에 대한 변환 처리를 수행할 때 표적 제품 객체의 속성/매개변수 정보에 기초하여 변환을 수행할지 여부를 결정할 수 있다. 추가로, 원본 멀티미디어 정보는 원본 오디오 정보를 포함할 수 있고; 이 경우, 현지화 처리 디바이스는 특히 사용자의 국가 또는 지역 속성 정보에 기초하여 원본 오디오 정보에 대한 변환 처리를 수행하여 국가 또는 지역 속성 정보에 대응하는 현지화 선호도와 부합하는 표적 오디오 정보를 생성하는 데 이용될 수 있다. 실시형태 2에 대응하여, 본 출원 실시형태는 또한 제품 객체 정보를 제공하기 위한 디바이스를 제공한다. 도 5 를 참조하면, 디바이스는 하기를 포함할 수 있다: 서버에 의해 표적 사용자에 대해 제공되는 적어도 하나의 표적 제품 객체의 표적 설명 정보를 수신하도록 구성 된 정보 수신 유닛으로서, 표적 설명 정보는 사용자의 국가 또는 지역 속성 정보에 기초하여 현지 표현에 맞게 표적 제품 객체의 원본 설명 정보를 처리함으로써 생성되는, 정보 수신 유닛; 및 적어도 하나의 표적 제품 객체의 표적 설명 정보를 지정된 웹페이지를 통해 제공하도록 구성된 정보 제공 유닛 . 추가로, 본 출원의 실시형태는 또한 컴퓨터 프로그램을 저장하는 컴퓨터 판독 가능 저장 매체를 제공한다. 프로 세서에 의해 실행될 때 프로그램은 전술된 실시형태에 설명된 방법 중 임의의 방법 단계를 구현한다. 전자 디바이스가 제공되되, 해당 전자 디바이스는, 하나 이상의 프로세서; 및 하나 이상의 프로세서와 연관된 메모리를 포함하고, 메모리는 프로그램 명령어를 저장하는 데 사용된다. 프로그 램 명령어가 하나 이상의 프로세서에 의해 판독되어 실행되면, 프로그램 명령어는 전술된 방법 실시형태에서 설 명된 방법 중 임의의 방법 단계를 수행한다. 도 6은 전자 디바이스의 아키텍처를 예시적으로 보여준다. 예를 들어, 디바이스는 휴대전화, 컴퓨터, 디지 털 방송 단말, 메시징 디바이스, 게임 콘솔, 태블릿 디바이스, 의료 디바이스, 피트니스 장비, 개인용 디지털 휴대 정보 단말기, 항공기 등일 수 있다. 도 6을 참조하면, 디바이스는 처리 모듈, 메모리, 전력 모듈, 멀티미디어 모듈, 오디 오 모듈, 입력/출력(I/O) 인터페이스, 센서 모듈, 및 통신 모듈 중 하나 이상을 포함할 수 있다. 처리 모듈은 일반적으로 디스플레이, 전화 통화, 데이터 통신, 카메라 작동 및 녹화와 관련된 동작과 같은 디바이스의 전반적인 동작을 제어한다. 처리 모듈은 본 명세서에서 제공하는 방법 단계의 전부 또는 일부를 완료하기 위한 명령어를 실행하기 위한 하나 이상의 프로세서를 포함할 수 있다. 추가로, 처리 모 듈은 처리 모듈과 기타 모듈 간의 상호 작용을 용이하게 하기 위한 하나 이상의 모듈을 포함할 수 있 다. 예를 들어, 처리 모듈은 멀티미디어 모듈과 처리 모듈 간의 상호 작용을 용이하게 하기 위 한 멀티미디어 모듈을 포함할 수 있다. 메모리는 디바이스의 동작을 지원하기 위해 다양한 유형의 데이터를 저장하도록 구성된다. 이러한 데 이터의 예로는 디바이스에서 동작하는 임의의 적용 또는 방법을 위한 명령어, 연락처 데이터, 전화번호부 데이터, 메시지, 사진, 비디오 등이 있다. 메모리는 정적 랜덤 액세스 메모리(SRAM), 전기적으로 소거 가 능한 프로그래밍 가능 판독 전용 메모리(EEPROM), 소거 가능한 프로그래밍 가능 판독 전용 메모리(EPROM), 프로 그래밍 가능 판독 전용 메모리(PROM), 판독 전용 메모리(ROM), 자기 메모리, 플래시 메모리, 자기 디스크 또는 광 디스크와 같은 임의의 유형의 휘발성 또는 비휘발성 저장 디바이스 또는 이들의 조합으로 구현될 수 있다. 전력 모듈은 디바이스의 다양한 모듈에 전력을 공급한다. 전력 모듈은 전력 관리 시스템, 하나 이상의 전력 공급원, 및 전력을 생성, 관리 및 디바이스에 분배하는 것과 관련된 기타 모듈을 포함할 수 있다. 멀티미디어 모듈은 디바이스와 사용자 사이에 출력 인터페이스를 제공하는 화면을 포함한다. 일부 실 시형태에서, 화면은 액정 디스플레이(LCD)와 터치 패널(TP)을 포함할 수 있다. 화면에 터치 패널이 포함된 경우, 이는 사용자로부터 입력 신호를 수신하기 위해 터치스크린으로 구현될 수 있다. 터치 패널은 터치 패널에 서 터치, 스와이프 및 제스처를 감지하기 위해 하나 이상의 터치 센서를 포함한다. 터치 센서는 터치 또는 스와 이프 동작의 경계뿐만 아니라 터치 또는 스와이프 동작과 관련된 지속 시간과 압력도 감지할 수 있다. 일부 실 시형태에서, 멀티미디어 모듈은 전방 카메라 및/또는 후방 카메라를 포함한다. 디바이스가 촬영 모드 또는 비디오 모드와 같은 동작 모드에 있을 때, 전방 카메라 및/또는 후방 카메라는 외부 멀티미디어 데이터를 수신할 수 있다. 각 전방 및 후방 카메라는 고정 광학 렌즈 시스템이거나 초점 거리 및 광학 줌 기능을 가질 수 있다. 오디오 모듈은 오디오 신호를 출력 및/또는 입력하도록 구성된다. 예를 들어, 오디오 모듈은 디바이 스가 통화 모드, 녹음 모드 또는 음성 인식 모드와 같은 동작 모드에 있을 때 외부 오디오 신호를 수신하 도록 구성된 마이크로폰(MIC)을 포함한다. 수신된 오디오 신호는 메모리에 추가로 저장되거나 통신 모듈 을 통해 전송될 수 있다. 일부 실시형태에서, 오디오 모듈은 또한 오디오 신호를 출력하기 위한 스피 커를 포함한다. I/O 인터페이스는 처리 모듈과 주변 인터페이스 모듈 간의 인터페이스를 제공하며, 주변 인터페이스 모듈에는 키보드, 클릭 휠, 버튼 및 기타 제어부를 포함할 수 있다. 이러한 버튼에는 홈 버튼, 볼륨 버튼, 전력 버튼 및 잠금 버튼이 포함될 수 있지만 이에 국한되지 않는다. 센서 모듈은 디바이스에 대한 다양한 상태 평가를 제공하는 하나 이상의 센서를 포함한다. 예를 들어, 센서 모듈은 디바이스의 개방/폐쇄 상태, 디바이스의 디스플레이 및 키패드와 같은 모듈 의 상대적 위치, 디바이스 또는 이의 모듈 중 하나의 모듈의 위치 변화를 검출할 수 있다. 센서 모듈(61 4)은 또한 사용자와 디바이스 사이의 접촉 유무, 디바이스의 배향, 가속/감속 및 온도 변화를 검출할 수 있다. 센서 모듈은 물리적 접촉 없이 근처 물체의 존재를 검출하도록 구성된 근접 센서를 포함할 수 있 다. 셈서 모듈은 또한 이미징 적용에 사용하기 위한 CMOS 또는 CCD 이미지 센서와 같은 광 센서를 포함할 수 있 다. 일부 실시형태에서, 센서 모듈은 가속도계, 자이로스코프 센서, 자력계, 압력 센서 또는 온도 센서를 포함할 수도 있다. 통신 모듈은 디바이스와 기타 디바이스 간의 유선 또는 무선 통신을 용이하게 하도록 구성된다. 디바 이스는 Wi-Fi와 같은 통신 표준 또는 2G, 3G, 4G/LTE 및 5G와 같은 모바일 통신 네트워크에 기초하는 무선 네트워크에 액세스할 수 있다. 예시적인 실시형태에서, 통신 모듈은 방송 채널을 통해 외부 방송 관리 시 스템으로부터 방송 신호 또는 방송 관련 정보를 수신한다. 또 다른 실시형태에서, 통신 모듈은 또한 단거 리 통신을 용이하게 하기 위해 근거리 무선 통신(NFC) 모듈을 포함한다. 예를 들어, NFC 모듈은 무선 주파수 식 별(RFID), 적외선 데이터 연관(IrDA), 광대역(UWB), 블루투스(BT) 및 기타 기술과 같은 기술에 기초하여 구현될 수 있다. 예시적인 실시형태에서, 디바이스는 하나 이상의 주문별 집적 회로(ASIC), 디지털 신호 프로세서(DSP), 디 지털 신호 처리 디바이스(DSPD), 프로그래밍 가능 논리 디바이스(PLD), 전계 프로그래밍 가능한 게이트 어레이 (FPGA), 제어기, 마이크로제어기, 마이크로프로세서 또는 기타 전자 모듈에 의해 구현되어 전술된 방법을 수행 할 수 있다. 대표적인 실시형태에서, 명령어를 포함하는 비일시적 컴퓨터 판독 가능 저장 매체도 제공되고, 예를 들어, 본 명세서에 의해 제공된 방법을 수행하기 위해 디바이스의 프로세서에 의해 실행될 수 있는 명령어를 포함하는 메모리가 제공된다. 예를 들어, 비일시적 컴퓨터 판독 가능 저장 매체는 ROM, 랜덤 액세스 메모 리(RAM), CD-ROM, 자기 테이프, 플로피 디스크, 광 데이터 저장 디바이스 등일 수 있다. 위의 실시형태의 설명으로부터, 당업자라면 본 출원은 필요한 일반 하드웨어 플랫폼과 결합된 소프트웨어를 통 해 구현될 수 있음을 이해할 수 있을 것이다. 이러한 이해를 바탕으로, 본 출원의 기술적 솔루션 또는 선행 기 술에 기여하는 부분은 소프트웨어 제품의 형태로 구현될 수 있다. 이 컴퓨터 소프트웨어 제품은 ROM/RAM, 자기 디스크, 광 디스크 등과 같은 저장 매체에 저장될 수 있으며, 컴퓨터 디바이스(개인용 컴퓨터, 서버 또는 네트 워크 디바이스 등일 수 있음)가 본 출원의 다양한 실시형태 또는 실시형태의 특정 부분에 설명된 방법을 실행할 수 있도록 하는 여러 명령어를 포함한다. 본 명세서에 있는 다양한 실시형태는 점진적인 방식으로 설명된다. 각 실시형태의 유사하고 동일한 부분은 서로 를 참조한다. 각 실시형태는 다른 실시형태와의 차이점에 초점을 맞춘다. 특히, 시스템 또는 시스템 실시형태의 경우, 이들은 방법 실시형태와 근본적으로 유사하기 때문에 설명이 비교적 간단하다. 관련 부분은 방법 실시형 태에서 참조될 수 있다. 위에서 설명된 시스템 및 시스템 실시형태는 단지 예시일 뿐이다. 별도의 구성 요소로 설명된 유닛은 물리적으로 분리될 수도 있고 분리되지 않을 수도 있으며, 유닛으로 표시된 구성 요소는 물리적 단위일 수도 있고 물리적 단위가 아닐 수도 있다. 이들 유닛은 한 곳에 위치되거나 다수의 네트워크 유닛에 분 산되어 있을 수 있다. 모듈의 일부 또는 전부는 실시형태의 목적을 달성하기 위해 실제 필요에 따라 선택될 수 있다. 당업자라면 창의적인 노력 없이 이를 이해하고 구현할 수 있을 것이다. 본 출원에서 제공하는 제품 객체 정보를 제공하기 위한 방법 및 전자 디바이스가 위에서 상세히 설명되었다. 본 명세서에서 특정 예를 사용하여 본 출원의 원리와 실시형태를 설명하였다. 위의 실시형태에 대한 설명은 단지 본 출원의 방법과 핵심 아이디어를 이해하는 데 도움을 준다. 이 기술 분야의 숙련자라면 본 출원의 개념에 기"}
{"patent_id": "10-2024-0109423", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "초하여 특정 구현 및 적용 범위에 변형을 할 수 있을 것이다. 요약하면, 본 명세서의 내용은 본 출원을 제한하 는 것으로 해석되어서는 안 된다. 도면 도면1 도면2 도면3 도면4 도면5 도면6"}
{"patent_id": "10-2024-0109423", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 출원의 실시형태 또는 선행 기술의 기술적 해결책을 보다 명확히 설명하기 위해, 실시형태에 필요한 도면을 아래에 간략히 소개한다. 아래에 설명된 도면은 본 출원의 단지 일부 실시형태라는 것은 명백하다. 이 기술 분 야의 통상의 기술자라면 창의적인 노력 없이도 이러한 도면에 기초하여 다른 도면을 얻을 수 있을 것이다. 도 1은 본 출원의 실시형태에서 제공하는 시스템 아키텍처의 개략도이고; 도 2는 본 출원의 실시형태에서 제공하는 서버측 방법의 흐름도이고; 도 3은 본 출원의 실시형태에서 제공하는 클라이언트측 방법의 흐름도이고; 도 4는 본 출원의 실시형태에서 제공하는 서버측 디바이스의 개략도이고; 도 5는 본 출원의 실시형태에서 제공하는 클라이언트측 디바이스의 개략도이고; 도 6은 본 출원의 실시형태에서 제공하는 전자 디바이스의 개략도이다."}
