{"patent_id": "10-2017-0030835", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2018-0103625", "출원번호": "10-2017-0030835", "발명의 명칭": "방열 플레이트를 포함하는 배터리 및 이를 포함하는 전자 장치", "출원인": "삼성전자주식회사", "발명자": "김민수"}}
{"patent_id": "10-2017-0030835", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "외부로 노출된 적어도 하나의 도전성 단자를 포함하는 배터리 파우치;상기 적어도 하나의 도전성 단자와 전기적으로 연결된 인쇄회로기판, 상기 인쇄회로기판은 신호 영역 및 비신호영역을 포함하고, 상기 신호 영역에는 상기 도전성 단자와 전기적으로 연결된 보호 회로가 배치되고;상기 비신호 영역과 연결된 방열 플레이트를 포함하는 배터리."}
{"patent_id": "10-2017-0030835", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 배터리 파우치의 측면과 일면이 대면하고 상기 인쇄회로기판을 수용하는 케이스를 더 포함하는 배터리."}
{"patent_id": "10-2017-0030835", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서,상기 케이스의 상기 보호 회로에 대향하는 면에 제1 오프닝이 형성되고,상기 방열 플레이트의 적어도 일부분이 상기 제1 오프닝 상에 위치하도록 정렬된 배터리."}
{"patent_id": "10-2017-0030835", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 3에 있어서,상기 제1 오프닝에 대응하는 상기 방열 플레이트의 영역에 제2 오프닝이 형성된 배터리."}
{"patent_id": "10-2017-0030835", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 4에 있어서,상기 방열 플레이트의 상기 적어도 일부분 및 상기 케이스를 적어도 일부 둘러싸는 마감 부재를 더 포함하고,상기 방열 플레이트의 상기 적어도 일부분에 대향하는 상기 마감 부재의 영역에 제3 오프닝이 형성된 배터리."}
{"patent_id": "10-2017-0030835", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 1에 있어서,상기 방열 플레이트는 상기 배터리 파우치와 대면하지 않는 방향으로 배치되는 배터리."}
{"patent_id": "10-2017-0030835", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 1에 있어서,상기 적어도 하나의 도전성 단자는 제1 도전성 단자 및 제2 도전성 단자를 포함하고,상기 인쇄회로기판은 상기 제1 도전성 단자와 연결된 제1 탭 플레이트 및 상기 제2 도전성 단자와 연결된 제2탭 플레이트를 포함하는 배터리."}
{"patent_id": "10-2017-0030835", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "배터리 셀을 둘러싸고, 상기 배터리 셀과 연결되어 외부로 노출된 적어도 하나의 도전성 단자를 포함하는 파우치;상기 적어도 하나의 도전성 단자와 전기적으로 연결되고, 신호 영역에 적어도 하나의 컴포넌트가 배치된 인쇄회로기판; 및공개특허 10-2018-0103625-3-상기 인쇄회로기판의 비신호 영역과 연결된 방열 부재를 포함하는 배터리."}
{"patent_id": "10-2017-0030835", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 8에 있어서,상기 방열 부재는,상기 적어도 하나의 컴포넌트와 정렬된 위치에 적어도 하나의 오프닝이 형성된 배터리."}
{"patent_id": "10-2017-0030835", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 8에 있어서,상기 방열 부재는,상기 인쇄회로기판으로부터 연장되고, 상기 인쇄회로기판의 커버층이 제거되어 형성된 배터리."}
{"patent_id": "10-2017-0030835", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 8에 있어서,상기 인쇄회로기판을 수용하기 위한 케이스를 더 포함하고,상기 방열 부재는,상기 인쇄회로기판과 플렉서블 부재를 통해 연결되고,상기 플렉서블 부재가 폴딩되어 상기 방열 부재가 상기 케이스의 외측에 배치된 배터리."}
{"patent_id": "10-2017-0030835", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 11에 있어서,상기 방열 부재는,복수 개의 전도층들 및 상기 전도층들 사이에 위치하여 상기 전도층들을 전기적으로 분리하는 적어도 하나의 절연층을 포함하고,상기 플렉서블 부재는 상기 방열 부재와 일체로 형성되면서, 상기 적어도 하나의 절연층이 제거된 형태로 마련된 배터리."}
{"patent_id": "10-2017-0030835", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 11에 있어서,상기 케이스는,일면에 상기 적어도 하나의 컴포넌트와 정렬한 위치에 적어도 하나의 오프닝이 형성된 배터리."}
{"patent_id": "10-2017-0030835", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 11에 있어서,상기 파우치의 외측면 일부로부터 상기 케이스의 외측면을 지나 상기 방열 부재의 외측면까지를 덮도록 부착된커버 시트를 더 포함하고,상기 커버 시트의 상기 적어도 하나의 컴포넌트와 정렬한 위치에 적어도 하나의 오프닝이 형성되고,상기 커버 시트의 내측면에 열전도성 부재가 일체로 형성된 배터리."}
{"patent_id": "10-2017-0030835", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "전자 장치에 있어서,브래킷;공개특허 10-2018-0103625-4-상기 브래킷에 안착되고, 프로세서가 배치된 메인 인쇄회로기판; 및상기 브래킷에 안착되는 배터리를 포함하고,상기 배터리는,배터리 셀;상기 배터리 셀을 둘러싸는 배터리 파우치;상기 배터리 파우치의 외부로 노출된 적어도 하나의 도전성 단자;상기 적어도 하나의 도전성 단자와 전기적으로 연결된 인쇄회로기판, 상기 인쇄회로기판의 신호 영역에 상기 도전성 단자와 전기적으로 연결된 보호 회로가 배치되고;상기 인쇄회로기판의 비신호 영역과 연결된 방열 플레이트를 포함하는 전자 장치."}
{"patent_id": "10-2017-0030835", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "청구항 15에 있어서,상기 배터리는,상기 배터리 파우치의 측면과 일면이 대면하고 상기 인쇄회로기판을 수용하는 케이스를 더 포함하는 전자 장치."}
{"patent_id": "10-2017-0030835", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "청구항 16에 있어서,상기 케이스의 상기 보호 회로에 대향하는 면에 제1 오프닝이 형성되고,상기 방열 플레이트의 적어도 일부분이 상기 제1 오프닝 상에 위치하도록 정렬된 전자 장치."}
{"patent_id": "10-2017-0030835", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "청구항 17에 있어서,상기 제1 오프닝에 대응하는 상기 방열 플레이트의 영역에 제2 오프닝이 형성된 전자 장치."}
{"patent_id": "10-2017-0030835", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "청구항 18에 있어서,상기 방열 플레이트의 상기 적어도 일부분 및 상기 케이스를 적어도 일부 둘러싸는 마감 부재를 더 포함하고,상기 방열 플레이트의 상기 적어도 일부분에 대향하는 상기 마감 부재의 영역에 제3 오프닝이 형성된 전자장치."}
{"patent_id": "10-2017-0030835", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "청구항 15에 있어서,상기 방열 플레이트는 상기 브래킷의 적어도 일면에 대향하도록 배치된 전자 장치."}
{"patent_id": "10-2017-0030835", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "외부로 노출된 적어도 하나의 도전성 단자를 포함하는 배터리 파우치, 상기 적어도 하나의 도전성 단자와 전기적 으로 연결된 인쇄회로기판, 및 방열 플레이트를 포함하고, 상기 인쇄회로기판은 신호 영역 및 비신호 영역을 포 함하고, 상기 신호 영역에는 상기 도전성 단자와 전기적으로 연결된 보호 회로가 배치되고, 상기 방열 플레이트 는 상기 비신호 영역과 연결된 배터리가 개시된다. 이 외에도 명세서를 통해 파악되는 다양한 실시 예가 가능하 다."}
{"patent_id": "10-2017-0030835", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 문서에 개시되는 실시 예들은 방열 플레이트를 포함하는 배터리 및 이를 포함하는 전자 장치와 관련된다."}
{"patent_id": "10-2017-0030835", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전자 장치는 생활 방수를 위해 인셀(in-cell) 타입의 배터리 파우치(battery pouch)를 구비할 수 있다. 배터리 파우치는 배터리 셀, 배터리 보호 회로(protection circuit module, PCM), 파우치, 및 연결부(connecting unit)로 구성될 수 있다.배터리 셀은 충전 전하를 가지고 있으며, 양극 탭(tap)과 음극 탭을 통해 충전 전하를 전자 장치에 전원으로서 공급할 수 있다."}
{"patent_id": "10-2017-0030835", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "배터리 셀을 통해 전자 장치에 전원을 공급하는 과정에서 파워 스위치를 흐르는 전류 패스가 형성되며, 파워 스 위치의 직렬 저항을 포함한 임피던스(impedance) 특성은 배터리 공급 전류에 비례하여 전압 강하(IR drop)와 열 을 발생시킬 수 있다. PCM에서 발생되는 열은 다시 파워 스위치의 임피던스 값을 증가시켜 소모 전류 손실을 증 가시키고, 배터리 사용 시간을 단축시킬 수 있다. 한편, 배터리에 대한 외부 충격에 대해 PCM 부와 배터리 셀을 보호하기 위한 기구 강건 구조가 필요할 수 있다. 예를 들어, PCM 부와 배터리 셀을 감싸도록 보호 케이스가 배치될 수 있다. PCM 부에서 발생된 열이 보호 케이스에 의해 외부로 방출되지 못하고 포켓 형태(예: hot air pocket)로 존재하 는 문제가 발생할 수 있다. 또한, 스위치에서 발생된 열은 PCB(printed circuit board)를 통해 확산될 수 있으 나, PCB layer 상에 존재하는 프리프레그(prepreg; PPG) 계열의 Layer와 Cu layer 간의 열 확산 속도의 차이로 인해 스위치 부품이 위치한 최상층의 Cu layer에 열이 응축된 열섬(heat island) 현상이 발생할 수 있다. 즉, PCM 부에서 발생된 열은 주로 배터리 파우치의 상단 부분에 집중되어 배터리 파우치의 상단 부분과 하단 부분 간의 온도 차이가 더욱 커질 수 있다. 이러한 온도 차이는 배터리 셀의 불안정한 전하 상태를 증가시키는 악영 향을 미칠 수 있다. 본 문서에서 개시되는 실시 예들은, 배터리의 PCM 부에서 발생된 열을 외부로 방출하는 방열 구조를 갖는 배터 리 및 이를 포함하는 전자 장치를 제공할 수 있다."}
{"patent_id": "10-2017-0030835", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 문서에서 개시되는 일 실시 예에 따른 배터리는 외부로 노출된 적어도 하나의 도전성 단자를 포함하는 배터 리 파우치, 상기 적어도 하나의 도전성 단자와 전기적으로 연결된 인쇄회로기판, 및 방열 플레이트를 포함하고, 상기 인쇄회로기판은 신호 영역 및 비신호 영역을 포함하고, 상기 신호 영역에는 상기 도전성 단자와 전기적으 로 연결된 보호 회로가 배치되고, 상기 방열 플레이트는 상기 비신호 영역과 연결될 수 있다. 또한, 본 문서에서 개시되는 일 실시 예에 따른 배터리는 배터리 셀을 둘러싸고 상기 배터리 셀과 연결되어 외 부로 노출된 적어도 하나의 도전성 단자를 포함하는 파우치, 상기 적어도 하나의 도전성 단자와 전기적으로 연 결되고 신호 영역에 적어도 하나의 컴포넌트가 배치된 인쇄회로기판, 및 상기 인쇄회로기판의 비신호 영역과 연 결된 방열 부재를 포함할 수 있다. 또한, 본 문서에서 개시되는 일 실시 예에 따른 전자 장치는 브래킷, 상기 브래킷에 안착되고 프로세서가 배치 된 메인 인쇄회로기판, 및 상기 브래킷에 안착되는 배터리를 포함하고, 상기 배터리는 배터리 셀, 상기 배터리 셀을 둘러싸는 배터리 파우치, 상기 배터리 파우치의 외부로 노출된 적어도 하나의 도전성 단자, 상기 적어도 하나의 도전성 단자와 전기적으로 연결된 인쇄회로기판, 및 방열 플레이트를 포함하고, 상기 인쇄회로기판의 신 호 영역에 상기 도전성 단자와 전기적으로 연결된 보호 회로가 배치되고, 상기 방열 플레이트는 상기 인쇄회로 기판의 비신호 영역과 연결될 수 있다."}
{"patent_id": "10-2017-0030835", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 문서에 개시되는 실시 예들에 따르면, PCM 방열 구조를 통해 배터리의 온도 상승을 해소할 수 있다. 또한, 본 문서에 개시되는 실시 예들에 따르면, PCM 방열 구조를 통해 PCM 부에서 발생된 열이 외부로 방출됨에 따라 PCM 부가 위치한 배터리의 일부 영역의 온도 상승이 억제되고, 이에 따라 PCM 부가 위치한 배터리의 일부 영역과 배터리의 다른 영역 간의 온도 불균형이 해소되어 배터리의 불안정 상태가 완화될 수 있다. 또한, 본 문서에 개시되는 실시 예들에 따르면, 배터리의 온도 상승이 억제됨으로써, 배터리의 온도 상승에 따 른 파워 스위치의 저항 증가가 억제되어 배터리의 사용 시간이 증가될 수 있다. 이 외에, 본 문서를 통해 직접적 또는 간접적으로 파악되는 다양한 효과들이 제공될 수 있다."}
{"patent_id": "10-2017-0030835", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 문서의 다양한 실시 예들이 첨부된 도면을 참조하여 기재된다. 실시 예 및 이에 사용된 용어들은 본 문서에 기재된 기술을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 해당 실시 예의 다양한 변경, 균등물, 및/또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유 사한 참조 부호가 사용될 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함 할 수 있다. 본 문서에서, \"A 또는 B\" 또는 \"A 및/또는 B 중 적어도 하나\" 등의 표현은 함께 나열된 항목들의 모든 가능한 조합을 포함할 수 있다. \"제1\", \"제2\", \"첫째\", 또는 \"둘째\" 등의 표현들은 해당 구성요소들을, 순 서 또는 중요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구 성요소들을 한정하지 않는다. 어떤(예: 제1) 구성요소가 다른(예: 제2) 구성요소에 \"(기능적으로 또는 통신적으 로) 연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 상기 어떤 구성요소가 상기 다른 구성요소에 직접적 으로 연결되거나, 다른 구성요소(예: 제3 구성요소)를 통하여 연결될 수 있다. 본 문서에서, \"~하도록 구성된(또는 설정된)(configured to)\"은 상황에 따라, 예를 들면, 하드웨어적 또는 소프 트웨어적으로 \"~에 적합한\", \"~하는 능력을 가지는\", \"~하도록 변경된\", \"~하도록 만들어진\", \"~를 할 수 있 는\", 또는 \"~하도록 설계된\"과 상호 호환적으로(interchangeably) 사용될 수 있다. 어떤 상황에서는, \"~하도록 구성된 장치\"라는 표현은, 그 장치가 다른 장치 또는 부품들과 함께 \"~할 수 있는\" 것을 의미할 수 있다. 예를 들면, 문구 \"A, B, 및 C를 수행하도록 구성된(또는 설정된) 프로세서\"는 해당 동작을 수행하기 위한 전용 프로 세서(예: 임베디드 프로세서), 또는 메모리 장치에 저장된 하나 이상의 소프트웨어 프로그램들을 실행함으로써, 해당 동작들을 수행할 수 있는 범용 프로세서(예: CPU 또는 application processor)를 의미할 수 있다. 본 문서의 다양한 실시 예들에 따른 전자 장치는, 예를 들면, 스마트폰, 태블릿 PC, 이동 전화기, 영상 전화기, 전자책 리더기, 데스크탑 PC, 랩탑 PC, 넷북 컴퓨터, 워크스테이션, 서버, PDA, PMP(portable multimedia player), MP3 플레이어, 의료기기, 카메라, 또는 웨어러블 장치 중 적어도 하나를 포함할 수 있다. 웨어러블 장 치는 액세서리형(예: 시계, 반지, 팔찌, 발찌, 목걸이, 안경, 콘택트 렌즈, 또는 머리 착용형 장치(head- mounted-device(HMD)), 직물 또는 의류 일체형(예: 전자 의복), 신체 부착형(예: 스킨 패드 또는 문신), 또는 생체 이식형 회로 중 적어도 하나를 포함할 수 있다. 어떤 실시 예들에서, 전자 장치는, 예를 들면, 텔레비전, DVD(digital video disk) 플레이어, 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스, 홈 오토매이션 컨트롤 패널, 보안 컨트롤 패널, 미디어 박스(예: 삼성 HomeSyncTM, 애플TVTM, 또는 구글 TVTM), 게임 콘솔(예: XboxTM, PlayStationTM), 전자 사전, 전자 키, 캠코더, 또는 전자 액자 중 적어도 하 나를 포함할 수 있다.다른 실시 예에서, 전자 장치는, 각종 의료기기(예: 각종 휴대용 의료측정기기(혈당 측정기, 심박 측정기, 혈압 측정기, 또는 체온 측정기 등), MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 또는 초음파기 등), 네비게이션 장치, 위성 항법 시스템(GNSS(global navigation satellite system)), EDR(event data recorder), FDR(flight data recorder), 자동차 인포테인먼 트 장치, 선박용 전자 장비(예: 선박용 항법 장치, 자이로 콤파스 등), 항공 전자기기(avionics), 보안 기기, 차량용 헤드 유닛(head unit), 산업용 또는 가정용 로봇, 드론(drone), 금융 기관의 ATM, 상점의 POS(point of sales), 또는 사물 인터넷 장치 (예: 전구, 각종 센서, 스프링클러 장치, 화재 경보기, 온도조절기, 가로등, 토 스터, 운동기구, 온수탱크, 히터, 보일러 등) 중 적어도 하나를 포함할 수 있다. 어떤 실시 예에 따르면, 전자 장치는 가구, 건물/구조물 또는 자동차의 일부, 전자 보드(electronic board), 전자 사인 수신 장치(electronic signature receiving device), 프로젝터, 또는 각종 계측 기기(예: 수도, 전기, 가스, 또는 전파 계측 기기 등) 중 적어도 하나를 포함할 수 있다. 다양한 실시 예에서, 전자 장치는 플렉서블하거나, 또는 전술한 다양한 장치들 중 둘 이상의 조합일 수 있다. 본 문서의 실시 예에 따른 전자 장치는 전술한 기기들에 한정되지 않는다. 본 문서에서, 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공 지능 전자 장치)를 지칭할 수 있다. 도 1은 일 실시 예에 따른 배터리의 평면도이다. 도 1을 참조하면, 배터리는 배터리 셀을 둘러싸는 파우치(또는 팩), 파우치의 일면 상에 형성된 제1 탭(first tap)(예: 양극 탭)과 제2 탭(second tap)(예: 음극 탭)이 각각 연결되는 제1 탭 플레 이트(first tap plate) 및 제2 탭 플레이트(second tap plate), 제1 탭 플레이트와 제2 탭 플 레이트가 실장되고 배터리 보호 회로(PCM)가 형성된 인쇄회로기판(printed circuit board; PCB), 전 자 장치의 내부 모듈(예: 프로세서, 통신 회로, 메모리, 또는 PMIC(power management integrated circuit) 등)이 실장된 메인 인쇄회로기판과 연결되는 커넥터(connector), 커넥터와 인쇄회로기판을 연결 하는 연결부(connecting unit), 및 인쇄회로기판에서 발생된 열을 외부로 방출하기 위한 방열 부재 (예: 방열 플레이트)를 포함할 수 있다. 상기 배터리 셀은 리튬 이온 배터리 또는 고체 배터리를 포함하고, 파우치에 의해 둘러싸여 보호될 수 있 다. 상기 배터리 셀은 젤리 롤(jelly roll)의 형태로 마련될 수 있으며, 알루미늄 기재 및 전해액 등으로 구성 될 수 있다. 어떤 실시 예에서, 상기 배터리 셀, 파우치, 제1 탭, 제2 탭, 및 PCM을 포함하여 배터리 팩이라 통칭할 수도 있다. 인쇄회로기판에는 PCM 및 각종 컴포넌트들이 실장될 수 있다. 상기 컴포넌트들은 예를 들어, 파워 스위치 (예: 제1 스위치 및 제2 스위치), 저항(resistor), 또는 탭 플레이트(예: 제1 탭 플레이트 및 제2 탭 플레이트) 등을 포함할 수 있다. 인쇄회로기판은 복수 개의 층(layer)으로 구성될 수 있다. 한 예로, 인쇄회로기판은 전도체인 2개의 구리 층(Cu layer), 유전체인 폴리이미드(polyimide; PI) 및/또는 프리프레그(prepreg; PPG) 계열의 층, 및 커버층(cover layer)(예: 필름층(flim layer))으로 구성 될 수 있다. 상기 파워 스위치(예: 제1 스위치 및 제2 스위치)는 과전류(또는 과전압)가 전자 장치로 공급되는 것 을 방지하는 역할을 할 수 있으며, 이중 설계를 위해 복수 개가 마련될 수 있다. 상기 파워 스위치는 내부에 내 부 직렬 저항(internal serial resistance)(RON 저항)이 있어, 전류에 의한 열을 발생시킬 수 있다. 상기 RON 저항은 직렬 임피던스 성분으로 낮은 저항을 유지하고, 열 발생으로 열 상승 시에는 상기 RON 저항이 높아질 수 있다. 상기 탭 플레이트는 상기 배터리 셀과 연결된 탭(예: 제1 탭 및 제2 탭)을 인쇄회로기판과 연결 시킬 수 있다. 예컨대, 제1 탭 플레이트는 제1 탭을 인쇄회로기판과 연결시키고, 제2 탭 플레이 트는 제2 탭을 인쇄회로기판과 연결시킬 수 있다. 상기 탭 플레이트는 판이 구부러진 형상으로 마련되고 구부러진 판이 탭을 감싸는 형태로 탭과 접촉될 수 있다. 한 예로, 상기 탭 플레이트는 구부러진 형상 으로, 탭의 상면 및 하면을 둘러싸면서 레이저(laser) 용접되어 탭과 연결될 수 있다. 커넥터와 인쇄회로기판을 연결하는 연결부는 플렉서블 인쇄회로기판(flexible printed circuit board; FPCB)으로 마련될 수 있다. 한 예로, 연결부는 인쇄회로기판의 일면으로부터 연장된 플렉서블 인쇄회로기판으로 마련될 수 있다. 커넥터는 상기 메인 인쇄회로기판과 전기적으로 연결될 수 있다. 한 실 시 예에 따르면, 커넥터는 보드 대 보드(board-to-board) 연결을 통해 상기 메인 인쇄회로기판을 연결할 수도 있고, 컨택 타입의 경우 메인 인쇄회로기판의 탄성 부재와 연결할 수 있는 컨택 패드(contact pad)를 포함할 수도 있다. 커넥터는 4개의 신호 라인 예컨대, 파워 신호 라인 2개 및 센싱 신호 라인 2개를 포함할 수 있다. 상기 파워 신호 라인은 PMIC의 전력 라인들 중 + 전극 라인 및 - 전극 라인과 각각 연결되는 2 개의 라인 들을 포함할 수 있고, 상기 센싱 신호 라인은 배터리의 상태를 센싱하기 위한 라인으로서, 연료 게이지(fuel gauge)의 제1 전극(예: + 전극) 및 제2 전극(예: - 전극)과 각각 연결되는 2개의 라인들을 포함할 수 있다. 그 러나, 신호 라인의 개수가 이에 한정되는 것은 아니며, 적어도 하나의 추가 신호 라인을 더 포함할 수도 있다. 한 예로, PCM 내에 연료 게이지가 있는 경우, 회로 제어 신호 라인이 추가로 배치될 수 있다. 방열 부재는 인쇄회로기판에서 발생된 열이 전달될 수 있도록 열전도성 물질로 구성될 수 있다. 예컨 대, 방열 부재는 방열판과 같은 기능을 수행할 수 있다. 한 예로, 방열 부재는 인쇄회로기판과 는 다른 별도의 인쇄회로기판으로 마련되거나, 인쇄회로기판으로부터 연장되어 형성될 수 있고, 인쇄회로 기판과 연결되는 부분은 플렉서블한 소재로 마련될 수 있다. 또한, 방열 부재는 상기 인쇄회로 기판의 전도층인 Cu layer를 통해 열을 전달받을 수 있다. 이와 관련하여, 한 실시 예에 따르면, 방열 부재 는 인쇄회로기판에서 발생된 열을 확산시키기 위해, 인쇄회로기판의 컴포넌트들이 실장된 면과 연결될 수 있으며, 커버층(예: 필름층) 및 솔더 마스크층(solder mask layer)이 제거됨으로써 전도층인 Cu layer가 외부로 노출될 수 있다. 이에 따라, 방열 부재의 노출된 면을 통해 전자 장치의 브래킷 또는 하우 징과 직접 접촉되거나 또는 외부 공기를 통해 열을 방출할 수 있다. 어떤 실시 예에서, 방열 부재는 리지 드 인쇄회로기판(rigid PCB)의 PPG 층이 제거된 상태로 마련됨으로써, 유연성이 확보될 수도 있다. 예컨대, 방 열 부재는 플렉서블 인쇄회로기판과 유사한 형태로 마련될 수 있다. 또 다른 예로, 방열 부재는 리지 드 인쇄회로기판으로 마련되고, PCM이 포함된 인쇄회로기판과 연결되는 부분이 플렉서블 인쇄회로기 판으로 마련될 수도 있다. 이에 따라, 플렉서블 인쇄회로기판이 밴딩 영역으로서 기능할 수 있다. 플렉서 블 인쇄회로기판은 커버층(예: 필름층) 및 PPG 층이 제거된 형태로 마련될 수 있다. 어떤 실시 예에서, 방열 부재는 인쇄회로기판의 면적보다 상대적으로 큰 면적을 갖도록 마련될 수 있 다. 예컨대, 방열 부재의 면적을 인쇄회로기판의 면적보다 크게 형성시킴으로써, 외부와 접촉되는 면 적을 늘릴 수 있다. 한 실시 예에 따르면, 방열 부재는 인쇄회로기판과 연결되는 부분이 플렉서블한 소재로 마련될 수 있다. 한 예로, 방열 부재는 플렉서블 인쇄회로기판 형태의 연결되는 부분을 통해 인쇄회로기판 과 연결될 수 있다. 플렉서블 인쇄회로기판 형태의 연결되는 부분은 밴딩 영역(bending area)으로서 기능할 수 있다. 도 2는 일 실시 예에 따른 오프닝을 포함하는 배터리의 평면도이다. 도 2의 배터리는 도 1의 배터리와 동일한 또는 유사한 구성을 포함할 수 있다. 예컨대, 배터리 는 배터리 셀을 둘러싸는 파우치(예: 파우치), PCM이 형성되고 스위치(예: 제1 스위치(예: 제1 스위치) 및 제2 스위치(예: 제2 스위치))가 포함된 인쇄회로기판(예: 인쇄회로기판), 전자 장치의 메인 인쇄회로기판과 연결되는 커넥터(예: 커넥터), 커넥터와 인쇄회로기판을 연결하는 연결부(예: 연결부), 및 인쇄회로기판과 밴딩 영역(예: 플렉서블 인쇄회로기판 )을 통해 연결되며 인쇄회로기판에서 발생된 열을 외부로 방출하기 위한 방열 부재(예: 방 열부재)를 포함할 수 있다. 도 2에 도시된 배터리의 구조에서는, 방열 부재에 의한 열 확산뿐만 아니라 방열 부재에 형성된 오프닝(opening)(또는 에어 홀(air hole))(예: 제1 오프닝 및 제2 오프닝)을 통한 통기 구조가 더 포함된 형태를 나타낸다. 예를 들어, 방열 부재는 밴딩 영역을 통해 밴딩(또는 폴딩(folding))되어 방열 부재와 인쇄회로기판이 대면하는 경우, 상기 오프닝이 인쇄회로기판에 실장된 컴포넌트들 중 주요 열원이 되는 스위치와 정렬될 수 있다. 이에 따라, 스위치로부터 발생된 열이 상기 오프닝을 통해 외부 로 직접 발산될 수 있으며, 외부의 찬 공기(cool air)가 상기 오프닝을 통해 상기 스위치로 유입되어 상기 스위 치의 온도를 낮출 수 있다. 도시된 도면에서는, 방열 부재가 제1 스위치와 정렬된 위치에 제1 오프닝이 형성되고, 제2 스위 치와 정렬된 위치에 제2 오프닝이 형성된 상태를 나타내지만, 이제 한정되는 것은 아니다. 다양한 실 시 예에 따르면, 방열 부재는 상술한 오프닝들 외의 적어도 하나의 다른 오프닝이 상기 제1 오프닝 또는 상기 제2 오프닝과 인접하게 더 형성될 수도 있다. 또한, 도시된 도면에서는 상기 제1 오프닝 및 상기 제2 오프닝이 각각 제1 스위치 및 제2 스위치와 동일한 또는 유사한 폭 및 높이로 형성 된 상태를 나타내지만, 상기 제1 오프닝 및 상기 제2 오프닝의 폭 및 높이는 이에 한정되지 않고, 제1 스위치 및 제2 스위치가 외부와 통할 수 있는 구조라면 어떠한 폭 및 높이로 형성되더라도 무방하 다. 다만, 열이 외부로 보다 잘 나가거나 공기가 내부로 보다 잘 들어올 수 있도록 상기 제1 오프닝 및 상 기 제2 오프닝의 폭 및 높이는 제1 스위치 및 제2 스위치의 폭 및 높이보다 상대적으로 크게 형 성될 수 있다. 도 3은 일 실시 예에 따른 배터리의 측면도이다. 도 3의 배터리는 도 1의 배터리 또는 도 2의 배터리를 측면에서 바라본 상태를 나타낸다. 도 3 에서는, 도 1 및 도 2에서 설명한 동일한 또는 유사한 구성에 대해서는 설명을 생략하도록 한다. 도 3을 참조하면, 배터리는 배터리 셀을 둘러싸는 파우치, 배터리 셀과 연결되고 파우치 의 일면 상에 형성된 탭, 탭과 접촉되어 배터리 셀로부터 공급되는 전류를 인쇄회로기판 에 전달하는 탭 플레이트, 탭 플레이트 및 스위치 등을 포함하는 인쇄회로기판, 인쇄 회로기판과 전자 장치의 메인 인쇄회로기판을 전기적으로 연결하는 커넥터, 커넥터와 인쇄회로 기판을 연결하는 연결부, 및 인쇄회로기판과 밴딩 영역을 통해 연결되며 인쇄회로기판 에서 발생된 열을 외부로 방출하기 위한 방열 부재를 포함할 수 있다. 탭 플레이트는 배터리 셀과 연결된 탭을 인쇄회로기판과 전기적으로 연결시킬 수 있다. 한 예로, 탭 플레이트는 판이 구부러진 형상으로 마련될 수 있으며, 구부러진 판이 탭의 일부(313a)를 감싸는 형태로 접촉할 수 있다. 어떤 실시 예에서, 탭은 배터리 셀과 연결된 부분의 반대 방향의 일 부(313a)가 돌출되도록 형성되고, 탭의 돌출부(313a)가 탭 플레이트의 구부러진 판 사이로 삽입되어 탭 플레이트와 접촉할 수 있다. 이러한 형상은 탭과 탭 플레이트가 보다 안정적으로 접촉되기 위한 구조의 일례를 나타내며, 탭과 탭 플레이트의 접촉 구조가 이에 한정되는 것은 아니다. 도 4는 일 실시 예에 따른 열 확산 경로를 설명하기 위한 도면이다. 도 4를 참조하면, 인쇄회로기판(예: 인쇄회로기판)에서 발생된 열은 밴딩 영역(예: 밴딩 영역 )을 통해 방열 부재(예: 방열 부재)로 전달될 수 있다. 이때, 밴딩 영역을 포함하여 방열 부재는 인쇄회로기판에서 발생된 열을 확산시키는 전도체로서, 인쇄회로기판의 신호 라인 (signal line)을 제외한 비신호 영역(non-signal area)과 연결될 수 있다. 이와 관련하여, 상기 비신호 영역은, 인쇄회로기판의 Cu layer 중 커넥터와 연결된 연결부(43 0)에 배치된 파워 신호 라인(431, 433), 및 배터리의 상태를 센싱하기 위한 센싱 신호 라인과 인쇄회로기 판에 형성된 컴포넌트(예: 제1 스위치, 제2 스위치, 제1 탭 플레이트, 및 제2 탭 플레이트 ) 간을 연결하는 신호 라인들을 제외한 영역을 포함할 수 있다. 또한, 상기 비신호 영역은 상기 컴포 넌트 영역에도 일부 존재할 수 있다. 상기 파워 신호 라인(431, 433)은 파워 공급을 위해 인쇄회로기판에 배치된 PMIC의 전력 라인과 연결될 수 있고, 상기 센싱 신호 라인은 배터리의 상태를 센싱하기 위해 연료 게이지(fuel gauge)와 연결될 수 있다. 도 4의 상단 도면은 인쇄회로기판의 top layer를 나타내고, 하단 도면은 인쇄회로기판의 bottom layer를 나타낸다. 도시된 바와 같이, top layer에 배치된 제1 스위치 및 제2 스위치에서 발 생된 열은 인쇄회로기판의 비신호 영역과 연결된 밴딩 영역을 통해 방열 부재의 일부 영역 으로 전달되고, 전달된 열은 방열 부재의 전체 영역으로 확산될 수 있다. 방열 부재는 신 호 라인들과 연결되지 않은 Cu layer로 구성될 수 있다. 한 실시 예에 따르면, 인쇄회로기판의 top layer와 bottom layer는 비아(via)를 통해 연결될 수 있으며, 이에 따라 열 확산 속도가 증가될 수 있다. 도 5는 일 실시 예에 따른 보호 케이스의 사시도이다. 다양한 실시 예에 따르면, 배터리(예: 배터리(100, 200))는 보호 케이스를 포함할 수 있다. 보호 케이스 는 배터리의 구성 중 배터리 파우치(예: 파우치(110, 210))가 감싸지 못하는 부분(예: 인쇄회로기판(120, 220))을 외부의 충격으로부터 보호할 수 있으며, 돌출 부분(예: 파우치가 감싸지 못하는 부분)이 차지하는 영역 을 줄이기 위해 사용될 수 있다. 예컨대, 보호 케이스는 배터리의 구성 중 주요 회로가 실장된 인쇄회로기 판을 감싸도록 배치될 수 있으며, 인쇄회로기판과 연결된 밴딩 영역(160, 260)을 접는 경우, 밴딩 영역(160, 260)의 형상이 안정적으로 유지되도록 지지할 수 있다. 또한, 보호 케이스는 PCM을 포함한 인쇄회로기판을보호할 수 있고, 배터리 팩 상태에서 인쇄회로기판과 배터리 파우치 간의 충격 전달을 완화시킬 수 있다. 도 5를 참조하면, 보호 케이스는 배터리의 PCM이 포함된 인쇄회로기판(예: 인쇄회로기판(120, 220))이 삽 입될 수 있는 공간을 제공할 수 있다. 한 예로, 보호 케이스는 제1 면 및 상기 제1 면의 일측으 로부터 연장된 제2 면을 포함할 수 있다. 상기 제1 면과 상기 제2 면은 실질직으로 수직하게 배 치될 수 있다. 예컨대, 보호 케이스는 전체적으로 \"ㄱ\"의 형상으로 마련될 수 있다. 이 경우, 인쇄회로기 판이 상기 제2 면 방향으로 삽입되어 상기 제1 면 및 상기 제2 면 사이의 공간에 안착될 수 있다. 그러나, 보호 케이스의 형상이 이에 한정되는 것은 아니다. 보호 케이스는 상기 제1 면 및 상기 제2 면 외의 적어도 하나의 다른 면을 더 포함할 수도 있다. 도시된 도면에서는, 상기 제1 면 및 상기 제2 면과 연결된 제3 면이 더 배치된 상태를 나타낸다. 한 실시 예에 따르면, 보호 케이스의 제1 면 상에는 인쇄회로기판과 연결된 방열 부재(예: 방열 부재 )가 위치할 수 있다. 또한, 보호 케이스의 제1 면에는 적어도 하나의 오프닝(예: 제1 오프닝 및 제2 오프닝)이 형성되어, 방열 부재에 형성된 오프닝(예: 제1 오프닝 및 제2 오프닝) 과 함께 열 및 공기의 이동 통로로 사용될 수 있다. 한 실시 예에 따르면, 보호 케이스의 제3 면에는 인쇄회로기판과 커넥터(예: 커넥터(130, 230))를 연 결하는 연결부(예: 연결부(140, 240))가 외부와 통할 수 있도록 오프닝이 형성될 수 있다. 예컨대, 보호 케이스의 제1 면과 제2 면 사이의 공간에 인쇄회로기판이 삽입된 상태에서, 인쇄회로기판과 연 결된 연결부가 보호 케이스의 제3 면에 형성된 오프닝을 통해 외부로 노출될 수 있다. 도 6은 일 실시 예에 따른 보호 케이스를 이용한 배터리 조립 과정을 설명하기 위한 도면이다. 도 6을 참조하면, 배터리(예: 배터리)는 보호 케이스(예: 보호 케이스)를 이용하여 배터리 파우치가 감싸지 못하는 부분(예: 인쇄회로기판 등)을 외부의 충격으로부터 보호할 수 있다. 예컨대, 보호 케이스의 내측에 마련된 공간에 인쇄회로기판을 삽입함으로써, 인쇄회로기판을 외부의 충 격으로부터 보호할 수 있다. 또한, 인쇄회로기판과 연결된 방열 부재의 밴딩 영역을 접어 배터리가 차지하는 전체 영역 을 줄일 수 있다. 이를 위한, 배터리의 조립 과정을 순차적으로 살펴보면, 우선 인쇄회로기판을 제1 방향(예: 배터리 파우치와 대면하는 방향)으로 삽입하여 보호 케이스에 형성된 공간에 안착시킬 수 있다. 이 후, 보호 케이스를 제2 방향(예: 배터리 파우치와 대면하는 방향)으로 들어올릴 수 있다. 이 경우, 인쇄회로기판과 연결된 탭이 180도 가량 밴딩될 수 있다. 어떤 실시 예에서, 탭(61 1)의 돌출부(611a)가 90도 가량 밴딩되면서, 탭이 전체적으로 180도 가량 밴딩될 수 있다. 보호 케이스가 제2 방향으로 들어올려지면, 인쇄회로기판과 연결된 연결부 및 커넥터(63 0)가 제3 방향(예: 제2 방향의 반대 방향)으로 이동하고, 방열 부재가 배터리 파우치와 대 면하는 방향(예: 제2 방향)으로 이동할 수 있다. 이 경우, 방열 부재는 배터리 파우치와 인쇄회 로기판 사이의 협소한 공간에 위치할 수 없기 때문에, 방열 부재의 밴딩 영역이 제4 방향 (예: 제2 방향의 반대 방향)으로 밴딩됨으로써, 방열 부재가 보호 케이스의 일면 상으로 이동하 여 위치할 수 있다. 결과적으로, 보호 케이스의 일면 하단 방향에는 인쇄회로기판이 안착되고, 상기 일면 상단 방향에는 방열 부재가 위치할 수 있다. 한 실시 예에 따르면, 보호 케이스를 이용해 배터리 파우치가 감싸지 못하는 부분을 파우치 방 향으로 말아서 사용하는 경우, 파우치와 대면하는 부분이 파우치에 밀착될 수 있도록 파우치의 외측에는 접착 부재가 배치될 수 있다. 접착 부재는 예를 들어, 포론 테이프(poron tape)를 포함할 수 있다. 도시된 도면에서와 같이, 접착 부재는 파우치의 적어도 일면 중 탭이 형성되도록 돌출 된 면과 상기 돌출면과 연결된 측면 상에 부착될 수 있다. 도 7은 일 실시 예에 따른 도 6에서의 열 확산 경로를 설명하기 위한 도면이다. 도 7을 참조하면, 배터리(예: 배터리)를 도 6에서와 같이, 보호 케이스(예: 보호 케이스) 를 이용해 배터리 파우치(예: 배터리 파우치)가 감싸지 못하는 부분을 파우치 방향으로 말아서 사용하는 경우, 인쇄회로기판에서 발생된 열의 확산 경로를 변경할 수 있다. 예를 들어, 인쇄회로기판의 스위 치에서 발생된 열은 인쇄회로기판의 비신호 영역과 연결된 밴딩 영역을 통해 방열 부재로 전달되고, 보호 케이스의 외측 일면에 위치하여 외부에 노출된 방열 부재를 통해, 전달된 열이 외부로 방출될 수 있다. 결과적으로, 인쇄회로기판을 보호하는 보호 케이스를 배치하더라도, 방열 부재의 밴딩 영역 의 특성을 이용해 방열 부재를 보호 케이스의 외측에 위치시킬 수 있고, 이를 통해, 배터리 가 차지하는 전체 영역을 줄이면서도 방열 기능까지 확보하는 배터리 구조가 마련될 수 있다. 도 8은 일 실시 예에 따른 보호 케이스에 커버 테이프를 부착시키는 과정을 설명하기 위한 도면이다. 다양한 실시 예에 따르면, 배터리(예: 배터리)를 전자 장치에 장착하기 전에 추가적으로 커버 테이프 (cover tape)를 부착시킬 수 있다. 커버 테이프는 예를 들어, 배터리의 커버 시트(또는 마감 부재)로 서, 배터리 파우치(예: 배터리 파우치)와 일체감을 높이기 위한 용도로 사용될 수 있다. 커버 테이프(87 0)는 제1 면, 상기 제1 면의 반대 방향에 배치된 제2 면, 및 상기 제1 면과 상기 제2 면 사이의 공간을 일부 둘러싸는 제3 면을 포함할 수 있다. 한 실시 예에 따르면, 커버 테이프는 방열 부재(예: 방열 부재)의 열전도를 높이기 위한 수단으 로 활용될 수 있다. 한 예로, 커버 테이프는 필름 형태로 마련되고, 내측에 열전도성 부재(예: 그라파이트 시트(graphite sheet))를 일체형으로 제작함으로써, 열 확산 기능을 수행할 수 있다. 도시된 도면에서와 같이, 보호 케이스(예: 보호 케이스)의 일측면 상에 방열 부재를 제1 방향으로 위치시키고, 커버 테이프를 보호 케이스를 덮도록 제2 방향으로 부착시킬 수 있 다. 예컨대, 커버 테이프는 방열 부재 및 보호 케이스를 모두 덮을 수 있다. 한 실시 예에 따르면, 커버 테이프는 보호 케이스와 대면하는 적어도 일면 상에 펀칭 홀(punching hole)(또는 오프닝)이 형성될 수 있다. 한 예로, 커버 테이프는 제1 면에 제1 펀칭 홀(871a) 및 제2 펀칭 홀(871b)이 형성되고, 제3 면에 제3 펀칭 홀(875a) 및 제4 펀칭 홀(875b)이 형성될 수 있다. 제1 펀칭 홀(871a) 및 제2 펀칭 홀(871b)은 보호 케이스의 제1 면에 형성된 제3 오프닝(851a) 및 제 4 오프닝(851b), 방열 부재에 형성된 제1 오프닝 및 제2 오프닝과 함께 인쇄회로기판에 실 장된 컴포넌트(예: 스위치)에서 발생된 열의 방출 통로로 사용될 수 있다. 예컨대, 인쇄회로기판의 컴포넌트에서 발생된 열은 보호 케이스의 제3 오프닝(851a), 방열 부재의 제1 오프닝, 및 커버 테이프의 제1 펀칭 홀(871a)로 이어지는 제1 열 방출 통로, 및 보호 케이스의 제4 오프닝 (851b), 방열 부재의 제2 오프닝, 및 커버 테이프의 제2 펀칭 홀(871b)로 이어지는 제2 열 방 출 통로로 방출될 수 있다. 한 실시 예에 따르면, 보호 케이스의 제1 면 상에 방열 부재가 놓이고 상기 제1 면을 위에서 바라보았을 때, 보호 케이스의 제1 면에는 상기 방열 부재에 형성된 제1 오프닝과 정렬된 위치에 제3 오프닝(851a)이 형성되고, 제2 오프닝과 정렬된 위치에 제4 오프닝(851b)이 형성될 수 있다. 한 실시 예에 따르면, 보호 케이스는 제2 면 상에 제5 오프닝(853a) 및 제6 오프닝(853b)이 형성될 수 있고, 커버 테이프의 제3 면에 형성된 제3 펀칭 홀(875a) 및 제4 펀칭 홀(875b)은 보호 케이스 의 제2 면에 형성된 제5 오프닝(853a) 및 제6 오프닝(853b)과 함께 인쇄회로기판으로 차가운 공 기가 유입될 수 있는 공기 유입 통로로 사용될 수 있다. 예컨대, 외부의 차가운 공기는 커버 테이프 의 제3 펀칭 홀(875a) 및 보호 케이스의 제5 오프닝(853a)으로 이어지는 제1 공기 유입 통로, 및 커 버 테이프의 제4 펀칭 홀(875b) 및 보호 케이스의 제6 오프닝(853b)으로 이어지는 제2 공기 유입 통 로로 유입될 수 있다. 도 9a는 일 실시 예에 따른 커버 테이프를 통한 방열을 설명하기 위한 도면이고, 도 9b는 일 실시 예에 따른 커 버 테이프에 형성된 오프닝을 통한 통기 구조를 설명하기 위한 도면이며, 도 9c는 일 실시 예에 따른 배터리를 포함하는 전자 장치를 설명하기 위한 도면이다. 도 9a 내지 도 9c를 참조하면, 전자 장치는 배터리(예: 배터리) 및 내부 구성 요소들이 안착되는 브 래킷, 상기 브래킷의 일면 상에 배치된 디스플레이, 디스플레이의 일면 상에 배치되어 디 스플레이를 외부로부터 보호하는 전면 커버, 상기 브래킷의 타면 상에 배치되고 적어도 하나의 통신 회로가 실장된 무선충전 코일 모듈, 및 상기 무선충전 코일 모듈의 외측에 배치되고 전자 장치 의 후면을 커버하는 후면 커버를 포함할 수 있다. 한 실시 예에 따르면, 배터리는 In-cell의 형태로 브래킷에 안착될 수 있다. 배터리는 예를 들어, 배터리 셀을 둘러싸는 파우치, 배터리 셀과 연결되고 파우치의 일측으로부터 돌출된 적어도 하나의 탭, 배터리 셀과 연결된 탭과 탭 플레이트를 통해 전기적으로 연결되는 인쇄회로기판, 전자 장치의 내부 모듈(예: 프로세서, 통신 회로, 메모리, PMIC(power management integrated circuit) 등)이 실장된 메인 인쇄회로기판과 연결되는 커넥터, 커넥터와 인쇄회로기판 을 연결하는 연결부, 및 인쇄회로기판과 밴딩 영역을 통해 연결되며 인쇄회로기판에 서 발생된 열을 외부로 방출하기 위한 방열 부재를 포함할 수 있다. 한 실시 예에 따르면, 배터리는 배터리의 커버 시트로서, 열전도성 부재(예: 그라파이트 시트)가 내측에 일체형으로 제작된 커버 테이프를 포함할 수 있다. 한 예로, 커버 테이프는 배터리 파우치의 돌 출된 부분(예: 탭이 연결된 부분)의 외측면으로부터 시작하여 인쇄회로기판을 둘러싸는 보호 케이스 의 외측면을 지나 방열 부재의 외측면까지 배터리 파우치가 감싸지 못하는 부분을 덮도록 부착 될 수 있다. 이 경우, 열전도성 부재가 일체로 제작된 커버 테이프는 배터리 파우치와의 일체감 을 높이기 위한 용도뿐만 아니라, 방열 부재의 열전도를 높이기 위한 수단으로도 활용될 수 있다. 예를 들 어, 도 9a에 도시된 바와 같이, 인쇄회로기판 상에 실장된 스위치로부터 발생된 열은 밴딩 영역(97 7)을 거쳐 방열 부재로 전달되고, 방열 부재를 덮고 있는 커버 테이프의 내측에 형성된 열전도 성 부재를 통해 커버 테이프의 전역으로 확산될 수 있다. 이를 통해, 방열 부재와 인접한 제1 영역에서뿐만 아니라 커버 테이프의 다른 제2 영역에서도 열이 발산될 수 있다. 한 실시 예에 따르면, 열전도성 부재와 일체형으로 제작된 커버 테이프에는 보호 케이스와 대면 하는 적어도 일면 상에 오프닝(또는 펀칭 홀)이 형성될 수 있다. 한 예로, 커버 테이프는 방열 부재 와 대면하는 면에 제1 펀칭 홀(예: 제1 펀칭 홀(871a) 및 제2 펀칭 홀(871b))이 형성되고, 다른 면에 제2 펀칭 홀(예: 제3 펀칭 홀(875a) 및 제4 펀칭 홀(875b))이 형성될 수 있다. 제1 펀칭 홀은 보호 케이스의 일면에 형성된 제2 오프닝(979a)(예: 제3 오프닝(851a) 및 제4 오프닝 (851b)), 방열 부재에 형성된 제1 오프닝(976a)(예: 제1 오프닝 및 제2 오프닝)과 함께 인쇄회 로기판에 실장된 컴포넌트(예: 스위치)에서 발생된 열의 방출 통로로 사용될 수 있다. 예컨대, 인쇄회로기판의 스위치에서 발생된 열은 보호 케이스의 제2 오프닝(979a), 방열 부재의 제 1 오프닝(976a), 및 커버 테이프의 제1 펀칭 홀로 이어지는 열 방출 통로로 방출될 수 있다. 제2 펀칭 홀은 보호 케이스의 타면에 형성된 제3 오프닝(979b)(예: 제5 오프닝(853a) 및 제6 오프닝 (853b))와 함께 인쇄회로기판으로 차가운 공기가 유입될 수 있는 공기 유입 통로로 사용될 수 있다. 예컨대, 외부의 차가운 공기는 커버 테이프의 제2 펀칭 홀 및 보호 케이스의 제3 오프닝(979b) 으로 이어지는 공기 유입 통로로 유입될 수 있다. 한 실시 예에 따르면, 방열 부재에 형성된 제1 오프닝(976a)은 보호 케이스에 형성된 제2 오프닝 (979a)과 대응되는 크기로 마련될 수 있으나, 방열 부재와 보호 케이스의 접착 면적 확보를 위해 크 기가 조정될 수도 있다. 또한, 커버 테이프에 형성되는 펀칭 홀(예: 제1 펀칭 홀 및 제2 펀칭 홀 )은 마감 처리를 통해 내측에 위치한 오프닝들(예: 제1 오프닝(976a), 제2 오프닝(979a), 및 제3 오프닝 (979b))이 외부에서 시인되지 않도록 하여 일체감을 향상시킬 수 있다. 도 10은 일 실시 예에 따른 보호 케이스의 다른 형태를 설명하기 위한 도면이다. 도 10을 참조하면, 배터리(예: 배터리)는 도 5 내지 도 7에서 설명한 보호 케이스(500, 670, 740) 와는 다른 형태로 마련된 보호 케이스를 포함할 수 있다. 보호 케이스는 인쇄회로기판이 삽 입될 수 있도록 적어도 일면이 개구된 상태로 마련되어야 하는데, 도 5 내지 도 7에서의 보호 케이스(500, 670, 740)는 \"ㄱ\"의 형태로 적어도 두면이 개구된 형태인 반면에, 도 10에서의 보호 케이스는 \"ㄷ\"의 형태로 일면이 개구된 형태로 마련될 수 있다. 보호 케이스의 개구 방향에 따라 인쇄회로기판에서 연장되는 방열 부재의 형태 및 방향이 변 경될 수 있다. 예를 들어, 도 10에서는, \"ㄷ\"의 형상으로 마련된 보호 케이스가 배터리 파우치의 일면 상에 부착된 접착 부재(예: 접착 부재)에 적어도 일면(예: 측면 및 하면)이 부착 되는 형태로 배치될 수 있다. 이 경우, 보호 케이스가 부착되지 않은 개구면을 통해 방열 부재의 밴딩 영역이 노출되어 보호 케이스의 상면으로 밴딩될 수 있다. 이 경우, 방열 부재는 밴딩 영역의 밴딩으로 인해 보호 케이스의 상면 상에 위치할 수 있다. 어떤 실시 예에서, 배 터리는 전자 장치에 장착하기 전에 추가적으로 커버 테이프가 부착될 수 있다. 상기 커버 테이프는 배터 리 파우치와의 일체감을 높이기 위한 용도 및 방열 부재의 열전도를 높이기 위한 수단으로 활용될수 있다. 도 11은 일 실시 예에 따른 열전달 물질을 통한 열 전달을 설명하기 위한 도면이다. 전자 장치(예: 전자 장치)는 배터리의 PCM의 형태가 다양하게 마련될 수 있기 때문에 PCM과 브래킷 사이에 공간적 틈(gap)이 생길 수 있다. 앞서 설명한 실시 예들에서는, PCM과 브래킷 사이 에 형성된 공간적 틈을 이용하여 공기 냉각 방식으로 설계한 PCM 방열 구조를 설명하였다. 도 11에서는, PCM과 브래킷 사이에 형성된 공간적 틈을 열 전달 물질(thermal interface material, T.I.M)로 채워 브래킷을 방열체(heat sink)로 사용하는 방법을 설명하도록 한다. 도 11을 참조하면, 전자 장치의 내측에는 배터리(예: 배터리) 및 내부 구성 요소들이 안착되는 브래 킷(예: 브래킷)을 포함할 수 있다. 배터리는 인쇄회로기판 상에 실장된 컴포넌트(예: 스위치(111 0))로부터 발생된 열이 확산될 수 있도록, 인쇄회로기판으로부터 연장된 방열 부재를 포함할 수 있으며, 방열 부재로 전달된 열이 보다 넓은 영역으로 확산될 수 있도록 탑 시트를 포함할 수 있다. 한 실시 예에 따르면, 탑 시트와 브래킷 사이에는 공간적 틈이 형성될 수 있다. 전자 장치 는 상기 틈 사이에 배치되는 열 전달 물질을 더 포함할 수 있다. 열 전달 물질은 예를 들어, 탑 시트와 브래킷을 연결하는 열 전달 경로의 역할을 수행할 수 있다. 즉, 배터리의 인쇄회 로기판 상에 실장된 컴포넌트(예: 스위치)로부터 발생된 열은 방열 부재를 지나 탑 시트로 전달되 고, 열 전달 물질을 통해 브래킷에 전달될 수 있다. 상술한 바와 같이, 다양한 실시 예에 따르면, 배터리(예: 배터리)는 외부로 노출된 적어도 하나의 도전성 단자를 포함하는 배터리 파우치(예: 파우치), 상기 적어도 하나의 도전성 단자와 전기적으로 연결된 인쇄 회로기판(예: 인쇄회로기판), 및 방열 플레이트(예: 방열 부재)를 포함할 수 있다. 상기 인쇄회로기 판은 신호 영역 및 비신호 영역을 포함하고, 상기 신호 영역에는 상기 도전성 단자와 전기적으로 연결된 보호 회로가 배치될 수 있다. 상기 방열 플레이트는 상기 비신호 영역과 연결될 수 있다. 다양한 실시 예에 따르면, 상기 배터리는 상기 배터리 파우치의 측면과 일면이 대면하고 상기 인쇄회로기판을 수용하는 케이스(예: 보호 케이스(500, 850))를 더 포함할 수 있다. 다양한 실시 예에 따르면, 상기 케이스의 상기 보호 회로에 대향하는 면에 제1 오프닝(예: 제3 오프닝(851a) 또 는 제4 오프닝(851b))이 형성되고, 상기 방열 플레이트의 적어도 일부분이 상기 제1 오프닝 상에 위치하도록 정 렬될 수 있다. 다양한 실시 예에 따르면, 상기 제1 오프닝에 대응하는 상기 방열 플레이트의 영역에 제2 오프닝(예: 제1 오프 닝 또는 제2 오프닝)이 형성될 수 있다. 다양한 실시 예에 따르면, 상기 배터리는 상기 방열 플레이트의 상기 적어도 일부분 및 상기 케이스를 적어도 일부 둘러싸는 마감 부재(예: 커버 테이프)를 더 포함하고, 상기 방열 플레이트의 상기 적어도 일부분에 대향하는 상기 마감 부재의 영역에 제3 오프닝(예: 제1 펀칭 홀(871a) 또는 제2 펀칭 홀(871b))이 형성될 수 있 다. 다양한 실시 예에 따르면, 상기 방열 플레이트는 상기 배터리 파우치와 대면하지 않는 방향으로 배치될 수 있다. 다양한 실시 예에 따르면, 상기 적어도 하나의 도전성 단자는 제1 도전성 단자(예: 제1 탭) 및 제2 도전성 단자(예: 제2 탭)를 포함하고, 상기 인쇄회로기판은 상기 제1 도전성 단자와 연결된 제1 탭 플레이트(예: 제1 탭 플레이트) 및 상기 제2 도전성 단자와 연결된 제2 탭 플레이트(예: 제2 탭 플레이트)를 포함 할 수 있다. 다양한 실시 예에 따르면, 배터리는 배터리 셀을 둘러싸고 상기 배터리 셀과 연결되어 외부로 노출된 적어도 하 나의 도전성 단자를 포함하는 파우치, 상기 적어도 하나의 도전성 단자와 전기적으로 연결되고 신호 영역에 적 어도 하나의 컴포넌트가 배치된 인쇄회로기판, 및 상기 인쇄회로기판의 비신호 영역과 연결된 방열 부재를 포함 할 수 있다. 다양한 실시 예에 따르면, 상기 방열 부재는 상기 적어도 하나의 컴포넌트와 정렬된 위치에 적어도 하나의 오프 닝(예: 제1 오프닝 또는 제2 오프닝)이 형성될 수 있다. 다양한 실시 예에 따르면, 상기 방열 부재는 상기 인쇄회로기판으로부터 연장되고, 상기 인쇄회로기판의 커버층 이 제거되어 형성될 수 있다. 다양한 실시 예에 따르면, 상기 배터리는 상기 인쇄회로기판을 수용하기 위한 케이스를 더 포함하고, 상기 방열 부재는 상기 인쇄회로기판과 플렉서블 부재(예: 밴딩 영역)를 통해 연결되고, 상기 플렉서블 부재가 폴딩 되어 상기 방열 부재가 상기 케이스의 외측에 배치될 수 있다. 다양한 실시 예에 따르면, 상기 방열 부재는 복수 개의 전도층들 및 상기 전도층들 사이에 위치하여 상기 전도 층들을 전기적으로 분리하는 적어도 하나의 절연층을 포함하고, 상기 플렉서블 부재는 상기 방열 부재와 일체로 형성되면서, 상기 적어도 하나의 절연층이 제거된 형태로 마련될 수 있다. 다양한 실시 예에 따르면, 상기 케이스는 일면에 상기 적어도 하나의 컴포넌트와 정렬한 위치에 적어도 하나의 오프닝(예: 제3 오프닝(851a) 또는 제4 오프닝(851b))이 형성될 수 있다. 다양한 실시 예에 따르면, 상기 배터리는 상기 파우치의 외측면 일부로부터 상기 케이스의 외측면을 지나 상기 방열 부재의 외측면까지를 덮도록 부착된 커버 시트(예: 커버 테이프)를 더 포함하고, 상기 커버 시트의 상기 적어도 하나의 컴포넌트와 정렬한 위치에 적어도 하나의 오프닝(예: 제1 펀칭 홀(871a) 또는 제2 펀칭 홀 (871b))이 형성되고, 상기 커버 시트의 내측면에 열전도성 부재가 일체로 형성될 수 있다. 상술한 바와 같이, 다양한 실시 예에 따르면, 전자 장치(예: 전자 장치)는 브래킷(예: 브래킷), 상기 브래킷에 안착되고 프로세서가 배치된 메인 인쇄회로기판(예: 메인 인쇄회로기판), 및 상기 브래킷에 안착 되는 배터리(예: 배터리)를 포함할 수 있다. 상기 배터리는 배터리 셀(예: 배터리 셀), 상기 배터리 셀을 둘러싸는 배터리 파우치(예: 파우치), 상기 배터리 파우치의 외부로 노출된 적어도 하나의 도전성 단 자(예: 탭), 상기 적어도 하나의 도전성 단자와 전기적으로 연결된 인쇄회로기판(예: 인쇄회로기판), 및 방열 플레이트(예: 방열 부재)를 포함할 수 있다. 상기 인쇄회로기판의 신호 영역에 상기 도전성 단자 와 전기적으로 연결된 보호 회로가 배치될 수 있으며, 상기 방열 플레이트는 상기 인쇄회로기판의 비신호 영역 과 연결될 수 있다. 다양한 실시 예에 따르면, 상기 배터리는 상기 배터리 파우치의 측면과 일면이 대면하고 상기 인쇄회로기판을 수용하는 케이스(예: 보호 케이스)를 더 포함할 수 있다. 다양한 실시 예에 따르면, 상기 케이스의 상기 보호 회로에 대향하는 면에 제1 오프닝(예: 제2 오프닝(979a))이 형성되고, 상기 방열 플레이트의 적어도 일부분이 상기 제1 오프닝 상에 위치하도록 정렬될 수 있다. 다양한 실시 예에 따르면, 상기 제1 오프닝에 대응하는 상기 방열 플레이트의 영역에 제2 오프닝(예: 제1 오프 닝(976a))이 형성될 수 있다. 다양한 실시 예에 따르면, 상기 전자 장치는 상기 방열 플레이트의 상기 적어도 일부분 및 상기 케이스를 적어 도 일부 둘러싸는 마감 부재(예: 커버 테이프)를 더 포함하고, 상기 방열 플레이트의 상기 적어도 일부분 에 대향하는 상기 마감 부재의 영역에 제3 오프닝(예: 제1 펀칭 홀)이 형성될 수 있다. 다양한 실시 예에 따르면, 상기 방열 플레이트는 상기 브래킷의 적어도 일면에 대향하도록 배치될 수 있다. 본 문서에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구성된 유닛을 포함하며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로 등의 용어와 상호 호환적으로 사용될 수 있다. \"모듈\"은, 일체로 구성된 부 품 또는 하나 또는 그 이상의 기능을 수행하는 최소 단위 또는 그 일부가 될 수 있다. \"모듈\"은 기계적으로 또 는 전자적으로 구현될 수 있으며, 예를 들면, 어떤 동작들을 수행하는, 알려졌거나 앞으로 개발될, ASIC(application-specific integrated circuit) 칩, FPGAs(field-programmable gate arrays), 또는 프로그램 가능 논리 장치를 포함할 수 있다. 다양한 실시 예에 따른 장치(예: 모듈들 또는 그 기능들) 또는 방법(예: 동작들)의 적어도 일부는 프로그램 모 듈의 형태로 컴퓨터로 판독 가능한 저장 매체에 저장된 명령어로 구현될 수 있다. 상기 명령어가 프로세서에 의 해 실행될 경우, 프로세서가 상기 명령어에 해당하는 기능을 수행할 수 있다. 컴퓨터로 판독 가능한 기록 매체는, 하드디스크, 플로피디스크, 마그네틱 매체(예: 자기테이프), 광기록 매체 (예: CD-ROM, DVD, 자기-광 매체 (예: 플롭티컬 디스크), 내장 메모리 등을 포함할 수 있다. 명령어는 컴파일러 에 의해 만들어지는 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 다양한 실시 예에 따른 모듈 또는 프로그램 모듈은 전술한 구성요소들 중 적어도 하나 이상을 포함하거나, 일부 가 생략되거나, 또는 다른 구성요소를 더 포함할 수 있다. 다양한 실시 예에 따른, 모듈, 프로그램 모듈 또는다른 구성요소에 의해 수행되는 동작들은 순차적, 병렬적, 반복적 또는 휴리스틱하게 실행되거나, 적어도 일부 동작이 다른 순서로 실행되거나, 생략되거나, 또는 다른 동작이 추가될 수 있다."}
{"patent_id": "10-2017-0030835", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시 예에 따른 배터리의 평면도이다. 도 2는 일 실시 예에 따른 오프닝을 포함하는 배터리의 평면도이다. 도 3은 일 실시 예에 따른 배터리의 측면도이다. 도 4는 일 실시 예에 따른 열 확산 경로를 설명하기 위한 도면이다. 도 5는 일 실시 예에 따른 보호 케이스의 사시도이다. 도 6은 일 실시 예에 따른 보호 케이스를 이용한 배터리 조립 과정을 설명하기 위한 도면이다. 도 7은 일 실시 예에 따른 도 6에서의 열 확산 경로를 설명하기 위한 도면이다. 도 8은 일 실시 예에 따른 보호 케이스에 커버 테이프를 부착시키는 과정을 설명하기 위한 도면이다. 도 9a는 일 실시 예에 따른 커버 테이프를 통한 방열을 설명하기 위한 도면이다. 도 9b는 일 실시 예에 따른 커버 테이프에 형성된 오프닝을 통한 통기 구조를 설명하기 위한 도면이다. 도 9c는 일 실시 예에 따른 배터리를 포함하는 전자 장치를 설명하기 위한 도면이다. 도 10은 일 실시 예에 따른 보호 케이스의 다른 형태를 설명하기 위한 도면이다. 도 11은 일 실시 예에 따른 열전달 물질을 통한 열 전달을 설명하기 위한 도면이다."}
