{"patent_id": "10-2019-0132442", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0048311", "출원번호": "10-2019-0132442", "발명의 명칭": "활동 정보 기반 스마트 오피스 시스템", "출원인": "(주)데이터리퍼블릭", "발명자": "엄성민"}}
{"patent_id": "10-2019-0132442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "기업에서 발생되는 활동 정보를 수집하기 위한 시스템에 있어서, 직원들의 단말기들;상기 기업의 여러 지점들에 위치하고, 상기 단말기들과 무선 통신 인터페이스로 통신하기 위한 통신 장치들; 및상기 단말기들과 통신하기 위한 서버를 포함하고,상기 단말기들 각각에는, 실행되는 어플리케이션에 대한 정보를 수집하기 위한 모니터링 어플리케이션이 설치되고,상기 모니터링 어플리케이션은, 상기 단말기들 각각이 상기 기업에 위치할 때에만 실행되고,상기 단말기들은, 제1직원의 제1단말기와 제2직원의 제2단말기를 포함하고,상기 통신 장치들은, 제1지점에 위치한 제1통신 장치와 제2지점에 위치한 제2통신 장치를 포함하고,상기 제1단말기가 상기 제1통신 장치와 접속하면, 상기 제1단말기는 상기 제1단말기와 상기 제1통신 장치가 접속한 시간 정보와 상기 제1통신 장치의 식별 정보를 포함하는 접속 정보를 상기 서버에 전송하고,상기 서버는, 상기 단말기로부터 상기 실행되는 상기 어플리케이션에 대한 정보와 상기 접속 정보를 수신하고,상기 실행되는 상기 어플리케이션에 대한 정보와 상기 접속 정보에 기반하여 활동 정보 로그를 생성하는시스템."}
{"patent_id": "10-2019-0132442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 무선 통신 인터페이스는 Wi-fi 통신이고, 상기 단말기들은 적어도 하나의 스마트폰을 포함하고, 상기 통신 장치들은 적어도 하나의 액세스 포인트를 포함하는 시스템."}
{"patent_id": "10-2019-0132442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 무선 통신 인터페이스는 블루투스 통신 또는 NFC 통신이고, 상기 단말기들은 적어도 하나의 스마트폰을 포함하고, 상기 통신 장치들은 적어도 하나의 비콘 단말기 또는 NFC 태그 단말기를 포함하는 시스템."}
{"patent_id": "10-2019-0132442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 제1통신 장치는 상기 기업의 경계 부근에 위치하고,상기 제2통신 장치는 상기 기업의 내부에 위치하고,상기 서버는, 상기 접속 정보에 기반하여 제1직원의 출퇴근 시간과 업무 외 활동 정보를 상기 활동 정보 로그에기록하고,상기 서버는, 상기 제1단말기가 상기 제1통신 장치와 접속한 후 상기 제2통신 장치와 접속하였으면 상기 제1직원이 상기 제1통신 장치 또는 상기 제2통신 장치와의 접속 시간에 출근한 것으로 판단하고, 상기 제1단말기가상기 제2통신 장치와 접속한 후 상기 제1통신 장치와 접속하고 기준 시간 이내에 다른 통신 장치와의 접속이 없공개특허 10-2021-0048311-3-으면 상기 제1직원이 상기 제1통신 장치 또는 상기 제2통신 장치와의 접속 시간에 퇴근한 것으로 판단하는 시스템."}
{"patent_id": "10-2019-0132442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 서버는, 상기 제1직원의 접속 정보와 상기 제2직원의 접속 정보가 일치하면 상기 제1직원과 상기 제2직원이 만난 것으로 판단하고, 상기 제1직원과 상기 제2직원이 소정 시간 구간 이내에 만난 횟수가 기준 값 이상이면, 상기 제1직원과 상기 제2직원 사이의 친밀도가 높음을 상기 활동 정보 로그에 기록하는 시스템."}
{"patent_id": "10-2019-0132442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 제1통신 장치는 상기 기업의 경계 부근에 위치하고,상기 제2통신 장치는 상기 기업의 내부에 위치하고,상기 제1단말기가 상기 제1통신 장치에 접속한 후 상기 제2통신 장치와 접속하면, 상기 제1단말기에 설치된 상기 모니터링 어플리케이션이 백 그라운드 프로세싱으로 실행되는 시스템."}
{"patent_id": "10-2019-0132442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 제1단말기가 상기 제2통신 장치에 접속한 후 상기 제1통신 장치와 접속하고, 기준 시간 이내에 다른 통신장치와의 접속이 없으면, 상기 제1단말기에 설치된 상기 모니터링 어플리케이션이 실행 종료되는 시스템."}
{"patent_id": "10-2019-0132442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 단말기들은 상기 제1직원의 컴퓨터를 더 포함하고,상기 컴퓨터에는, 상기 컴퓨터의 로그인 정보와 상기 컴퓨터 내에서 실행되는 프로그램들에 대한 정보를 포함하는 컴퓨터 활동 정보를 모니터링하기 위한 프로그램이 설치되고,상기 서버는, 상기 컴퓨터로부터 상기 컴퓨터 활동 정보를 수신하고, 상기 컴퓨터 활동 정보를 상기 활동 정보로그에 기록하는 시스템."}
{"patent_id": "10-2019-0132442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 서버는, 인공 지능 기반의 예측 모델을 활용하여, 상기 제1직원의 출퇴근 시간, 자리 배치, 수행 업무 내용, 및 업무 외 활동 중 적어도 하나에 대한 추천 정보를 생성하고,상기 예측 모델에 대한 학습은, 소정 시간 구간에 대한 상기 제1직원의 활동 정보와 상기 소정 시간 구간에 대한 상기 제1직원의 업무 성과를 각각 입력과 출력으로 적용함으로써 수행되는 시스템."}
{"patent_id": "10-2019-0132442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,기계식 주차장을 더 포함하고,상기 서버는, 상기 직원들과 상기 직원들의 차량 정보를 각각 대응시켜 저장한 데이터베이스를 포함하고,상기 서버는, 상기 제1직원의 출장 정보에 기반하여, 상기 제1직원의 차량에 대한 출차 준비 신호를 상기 기계식 주차장의 컨트롤러로 전송하는 시스템."}
{"patent_id": "10-2019-0132442", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "기업에서 발생되는 활동 정보를 수집하기 위한 시스템이 개시될 수 있다. 시스템은, 직원들의 단말기들, 기업의 여러 지점들에 위치하고, 단말기들과 무선 통신 인터페이스로 통신하기 위한 통신 장치들, 및 단말기들과 통신하 기 위한 서버를 포함하고, 단말기들 각각에는 실행되는 어플리케이션에 대한 정보를 수집하기 위한 모니터링 어 (뒷면에 계속)"}
{"patent_id": "10-2019-0132442", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 기업 또는 오피스에서 운영되는 시스템에 관한 것으로, 보다 구체적으로는 직원들의 다양한 활동들에 의해 수집되는 정보를 분석하고 피드백을 제공하기 위한 스마트 오피스 시스템에 관한 것이다."}
{"patent_id": "10-2019-0132442", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 주52시간 근무제가 정착되고 정시 퇴근 문화가 확산되는 등 개인의 여가 생활과 일과 삶의 균형(working and life balance)에 대한 사회의 관심이 나날이 증가하고 있다. 조사에 따르면, 근로 시간의 단축은 기업의 생 산성을 향상시킬 수 있음은 물론, 근로자의 직장에 대한 만족도 역시 높일 수 있다. 그러나, 직원들은 단축된 근무 시간 내에 기존의 많은 업무량을 처리해야 하고, 기업 역시 정시 퇴근하는 직원 들을 고용하여 기존의 목표나 실적을 달성해야 하는 바, 업무 효율과 생산성의 문제가 중요해지고 있다. 기업에 서는 주어진 업무 시간 내에 직원들의 효율적인 업무 수행을 위해 불필요한 메신저, 흡연, 전화, 잡담 등을 금 지시키는 사내 정책을 추진할 수 있으나 직원들의 활동을 일일이 모니터링하기는 쉽지 않으며 직원들의 활동들 을 객관화된 데이터로 나타내기도 쉽지 않다."}
{"patent_id": "10-2019-0132442", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "직원들의 다양한 활동 정보를 수집하고 그에 기반하여 활동 정보 로그를 생성하기 위한 시스템이 제공될 수 있 다. 본 실시 예가 이루고자 하는 기술적 과제는 상기된 바와 같은 기술적 과제로 한정되지 않으며, 이하의 실시 예 들로부터 또 다른 기술적 과제들이 유추될 수 있다."}
{"patent_id": "10-2019-0132442", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "기업에서 발생되는 활동 정보를 수집하기 위한 시스템은, 직원들의 단말기들, 상기 기업의 여러 지점들에 위치 하고, 상기 단말기들과 무선 통신 인터페이스로 통신하기 위한 통신 장치들, 및 상기 단말기들과 통신하기 위한 서버를 포함하고, 상기 단말기들 각각에는, 실행되는 어플리케이션에 대한 정보를 수집하기 위한 모니터링 어플 리케이션이 설치되고, 상기 모니터링 어플리케이션은, 상기 단말기들 각각이 상기 기업에 위치할 때에만 실행되 고, 상기 단말기들은, 제1직원의 제1단말기와 제2직원의 제2단말기를 포함하고, 상기 통신 장치들은, 제1지점에 위치한 제1통신 장치와 제2지점에 위치한 제2통신 장치를 포함하고, 상기 제1단말기가 상기 제1통신 장치와 접 속하면, 상기 제1단말기는 상기 제1단말기와 상기 제1통신 장치가 접속한 시간 정보와 상기 제1통신 장치의 식 별 정보를 포함하는 접속 정보를 상기 서버에 전송하고, 상기 서버는, 상기 단말기로부터 상기 실행되는 상기 어플리케이션에 대한 정보와 상기 접속 정보를 수신하고, 상기 실행되는 상기 어플리케이션에 대한 정보와 상기 접속 정보에 기반하여 활동 정보 로그를 생성할 수 있다. 상기 무선 통신 인터페이스는 Wi-fi 통신이고, 상기 단말기들은 적어도 하나의 스마트폰을 포함하고, 상기 통신 장치들은 적어도 하나의 액세스 포인트를 포함할 수 있다. 상기 무선 통신 인터페이스는 블루투스 통신 또는 NFC 통신이고, 상기 단말기들은 적어도 하나의 스마트폰을 포 함하고, 상기 통신 장치들은 적어도 하나의 비콘 단말기 또는 NFC 태그 단말기를 포함할 수 있다. 상기 제1통신 장치는 상기 기업의 경계 부근에 위치하고, 상기 제2통신 장치는 상기 기업의 내부에 위치하고, 상기 서버는, 상기 접속 정보에 기반하여 제1직원의 출퇴근 시간과 업무 외 활동 정보를 상기 활동 정보 로그에 기록하고, 상기 서버는, 상기 제1단말기가 상기 제1통신 장치와 접속한 후 상기 제2통신 장치와 접속하였으면 상기 제1직원이 상기 제1통신 장치 또는 상기 제2통신 장치와의 접속 시간에 출근한 것으로 판단하고, 상기 제1 단말기가 상기 제2통신 장치와 접속한 후 상기 제1통신 장치와 접속하고 기준 시간 이내에 다른 통신 장치와의 접속이 없으면 상기 제1직원이 상기 제1통신 장치 또는 상기 제2통신 장치와의 접속 시간에 퇴근한 것으로 판단 할 수 있다. 상기 서버는, 상기 제1직원의 접속 정보와 상기 제2직원의 접속 정보가 일치하면 상기 제1직원과 상기 제2직원 이 만난 것으로 판단하고, 상기 제1직원과 상기 제2직원이 소정 시간 구간 이내에 만난 횟수가 기준 값 이상이 면, 상기 제1직원과 상기 제2직원 사이의 친밀도가 높음을 상기 활동 정보 로그에 기록할 수 있다.상기 제1통신 장치는 상기 기업의 경계 부근에 위치하고, 상기 제2통신 장치는 상기 기업의 내부에 위치하고, 상기 제1단말기가 상기 제1통신 장치에 접속한 후 상기 제2통신 장치와 접속하면, 상기 제1단말기에 설치된 상 기 모니터링 어플리케이션이 백 그라운드 프로세싱으로 실행될 수 있다. 상기 제1단말기가 상기 제2통신 장치에 접속한 후 상기 제1통신 장치와 접속하고, 기준 시간 이내에 다른 통신 장치와의 접속이 없으면, 상기 제1단말기에 설치된 상기 모니터링 어플리케이션이 실행 종료될 수 있다. 상기 단말기들은 상기 제1직원의 컴퓨터를 더 포함하고, 상기 컴퓨터에는, 상기 컴퓨터의 로그인 정보와 상기 컴퓨터 내에서 실행되는 프로그램들에 대한 정보를 포함하는 컴퓨터 활동 정보를 모니터링하기 위한 프로그램이 설치되고, 상기 서버는, 상기 컴퓨터로부터 상기 컴퓨터 활동 정보를 수신하고, 상기 컴퓨터 활동 정보를 상기 활동 정보 로그에 기록할 수 있다. 상기 서버는, 인공 지능 기반의 예측 모델을 활용하여, 상기 제1직원의 출퇴근 시간, 자리 배치, 및 업무 외 활 동 중 적어도 하나에 대한 추천 정보를 생성하고, 상기 예측 모델에 대한 학습은, 소정 시간 구간에 대한 상기 제1직원의 활동 정보와 상기 소정 시간 구간에 대한 상기 제1직원의 업무 성과를 각각 입력과 출력으로 적용함 으로써 수행될 수 있다. 상기 시스템은, 기계식 주차장을 더 포함하고, 상기 서버는, 상기 직원들과 상기 직원들의 차량 정보를 각각 대 응시켜 저장한 데이터베이스를 포함하고, 상기 서버는, 상기 제1직원의 출장 정보에 기반하여, 상기 제1직원의 차량에 대한 출차 준비 신호를 상기 기계식 주차장의 컨트롤러로 전송할 수 있다."}
{"patent_id": "10-2019-0132442", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "직원들의 사내 활동을 모니터링하고 그에 기반하여 분석 결과와 피드백을 제공하기 위한 시스템이 제공될 수 있 다. 이러한 시스템에 기반하여, 직원들의 업무 처리 효율과 기업의 생산성이 향상되고 사회 및 경제적 측면에서 긍정적 효과가 발생할 수 있다."}
{"patent_id": "10-2019-0132442", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자들(이하, 통상의 기술자들)이 본 발명을 용이 하게 실시할 수 있도록, 첨부되는 도면들을 참조하여 몇몇 실시 예가 명확하고 상세하게 설명될 것이다. 도1은 일 실시 예에 따라, 기업에서 발생되는 활동 정보를 수집하기 위한 시스템(스마트 오피스 시스템이라고도 함)을 나타낸다. 도1을 참조하면, 시스템은 영역 내 단말기들(1221, 1222, 1223, 및 1224), 영역 내 여러 지 점들에 위치한 통신 장치들(1241, 1242, 1243, 1244, 및 1245), 및 서버를 포함할 수 있다. 도1의 영역은 기업의 건물 내 또는 기업의 건물들과 부속 공간들(예를 들어, 운동장, 실외 흡연 공간 등)이 위치하는 물리적 공간 또는 지리적 영역을 의미할 수 있다. 영역은 영역의 경계 부근을 포함 할 수 있다. 예를 들어, 영역의 경계 부근은 기업의 주차장, 캠퍼스 출입문, 건물의 정문 등을 포함할 수 있다. 이하, 기업의 공간은 특정된 영역을 의미할 수 있다. 단말기들(1221~1224)은 직원들의 컴퓨터, 스마트폰, 태블릿 PC, 웨어러블 디바이스 등 각종 전자 장치를 포함할 수 있다. 예를 들어, 단말기들(1221~1224)은 제1직원의 제1단말기(1221, 예를 들어, 스마트폰), 제2직원의 제2 단말기(1222, 예를 들어, 스마트폰), 제3직원의 제3단말기(1223, 예를 들어, 태블릿 PC), 또는 제4직원의 제4단 말기(1224, 예를 들어, 컴퓨터)를 포함할 수 있다. 도1의 시스템에는 4개의 단말기들만 도시되었으나 시 스템은 더 많은 단말기들을 포함할 수 있다.시스템은 다양한 형태의 중앙 집중적 컴퓨터 기기 또는 분산적 컴퓨팅 기기로 이루어진 서버를 포 함할 수 있다. 서버는 적어도 하나의 컴퓨팅 장치를 포함할 수 있다. 도1의 시스템에는 서버(140 0)가 영역 외부에 위치하는 것으로 도시되었으나 서버는 영역 내부에 위치할 수도 있으며, 내부와 외부에 분산하여 위치할 수도 있다. 예를 들어, 서버는 중앙 서버, 멀티미디어 컴퓨터, 랩탑 컴퓨터, 데스크탑 컴퓨터, 그리드 컴퓨팅 리소스, 가상화 된 컴퓨터 리소스, 클라우드 컴퓨팅 리소스, 피어-투-피어 분산 컴퓨팅 장치 또는 이들의 조합 일 수 있다. 다만, 일 실시예에 따른 시스템은 블루투스, Wi-Fi(wireless fidelity)와 같은 통신 프로토 콜을 사용하는 디바이스(예를 들어, 단말기) 간 연결을 사용하여 서버 없이 구현될 수도 있다. 이러한 실 시 예에서, 단말기들(1221~1224) 각각은 서버로서 동작할 수 있으며, 단말기들(1221~1224)은 특정 위치에 서 단말기들의 네트워크를 형성하는 서버-클라이언트 모델에 연결될 수 있다. 이하에서 설명되는 서버에 서 수행되는 동작은 단말기들(1221~1224) 중 적어도 하나에서도 수행될 수 있다. 단말기들(1221~1224)은 무선 통신 인터페이스에 기반하여 통신 장치들(1241~1245)과 통신할 수 있다. 무선 통신 인터페이스는 Wi-fi(Wireless Fidelity)와 같은 무선 근거리 통신망(Wireless Local Area Network; WLAN), 블 루투스(Bluetooth)와 같은 무선 개인 통신망(Wireless Personal Area Network; WPAN), 무선 USB(Wireless Universal Serial Bus), 지그비(Zigbee), NFC(Near Field Communication), RFID(Radio-frequency identification), PLC(Power Line communication), 또는 3G(3rd Generation), 4G(4th Generation), LTE (Long Term Evolution), 5G(5th Generation) 등 이동 통신망(mobile cellular network)에 접속 가능한 모뎀 통신 인 터페이스 등을 포함할 수 있다. 상기 블루투스 인터페이스는 BLE(Bluetooth Low Energy)를 지원할 수 있다. 통신 장치들(1241~1245)은 단말기들(1221~1224)과 통신이 가능한 적어도 하나의 액세스 포인트(Access Point, AP)를 포함할 수 있다. 액세스 포인트는 Wi-fi, 블루투스, 지그비 방식의 통신을 지원할 수 있다. 통신 장치들 (1241~1245)은 적어도 하나의 비콘(Beacon) 단말기를 포함할 수 있다. 통신 장치들(1241~1245)은 적어도 하나의 NFC 태그 단말기를 포함할 수 있다. 통신 장치들(1241~1245) 각각은 영역 내의 여러 지점들에 위치할 수 있다. 예를 들어, 제1통신 장치 는 1층 로비에 위치한 액세스 포인트일 수 있으며, 제2통신 장치는 1층 화장실에 위치한 NFC 태그 단말기일 수 있다. 제3통신 장치는 2층 카페에 위치한 비콘 단말기일 수 있으며, 제4통신 장치는 3 층 회의실에 위치한 비콘 단말기일 수 있다. 제5통신 장치는 실외 흡연실에 위치한 액세스 포인트일 수 있다. 통신 장치들은 주차장에 위치한 비콘 단말기(미도시)와 출입문(건물의 출입문 또는 캠퍼스의 출입문)에 위치한 비콘 단말기(미도시)를 포함할 수 있다. 도1의 시스템은 5개의 통신 장치들만 도시되었으나 시스 템은 더 많은 통신 장치들을 포함할 수 있다. 서버는 단말기들(1221~1224) 또는 통신 장치들(1241~1245)과 통신하며, 단말기들(1221~1224) 또는 통신 장치들(1241~1245)로부터 직원들의 활동 정보를 수신하고, 수신된 활동 정보에 기반하여 활동 정보 로그 를 생성할 수 있다. 일 실시 예에 따라, 활동 정보는 직원들의 단말기 상에서의 어플리케이션 실행 정보 및 접 속 정보 중 적어도 하나를 포함할 수 있다. 어플리케이션 실행 정보는, 스마트폰과 같은 모바일 기기의 어플리 케이션 실행 정보 뿐만 아니라 컴퓨터 상의 로그인/로그아웃 정보, 어플리케이션 실행 정보와 같은 컴퓨터 활동 정보를 포함할 수 있다. 단말기들(1221~1224) 각각에는 활동 정보를 획득하기 위한 모니터링 어플리케이션이 설치될 수 있다. 모니터링 어플리케이션은 단말기 상에서 실행되는 어플리케이션에 대한 정보를 수집할 수 있다. 단말기들(1221~1224)은 모니터링 어플리케이션을 통해 획득된 활동 정보를 액세스포인트 또는 게이트웨이를 통해 서버로 전송할 수 있다. 예를 들어, 스마트폰인 제1단말기에 설치된 모니터링 어플리케이션은 스마트폰에 설치된 메신저 어플리케 이션, 카메라 어플리케이션, 웹 브라우저 어플리케이션, 게임 어플리케이션 등의 실행 여부와 실행 시간 등을 모니터링할 수 있다. 제1단말기는 모니터링 어플리케이션을 통해 획득된 어플리케이션 실행 정보를 서버 에 전송할 수 있다. 컴퓨터인 제4단말기에 설치된 모니터링 어플리케이션은 컴퓨터의 로그인 시간, 로그아웃 시간, 컴퓨터 상의 다른 소프트웨어 프로그램의 실행 등과 같은 컴퓨터 활동 정보를 모니터링할 수 있 다. 제4단말기는 모니터링 어플리케이션을 통해 획득된 컴퓨터 활동 정보를 서버에 전송할 수 있다. 모니터링 어플리케이션은 단말기가 영역 내에 위치할 때에만 동작할 수 있다. 예를 들어, 제1단말기 를 휴대한 제1직원이 영역 밖의 자신의 집에 위치해 있을 때에는 제1단말기 상의 모니터링 어플리케이션의 실행은 종료될 수 있다. 일 실시 예에 따라, 제1단말기가 정문에 위치한 비콘 단말기와 1층 로비에 위치한 비콘 단말기와 순차적 으로 접속한 경우, 제1단말기는 영역 내에 위치한 것으로 판단될 수 있고 모니터링 어플리케이션은 실행될 수 있다. 예를 들어, 제1단말기의 프로세서는 1층 로비에 위치한 비콘 단말기로부터 수신된 신호 에 기초하여 모니터링 어플리케이션을 실행시킬 수 있다. 일 실시 예에 따라, 제1단말기가 1층 로비에 위 치한 비콘 단말기와 정문에 위치한 비콘 단말기와 순차적으로 접속하고, 기준 시간 내에 영역 내의 어떠 한 통신 장치와도 접속하지 않은 경우, 제1단말기는 영역 밖에 위치한 것으로 판단될 수 있고 모니 터링 어플리케이션의 실행은 종료될 수 있다. 단말기들(1221~1224)은 통신 장치들(1241~1245)과의 접속에 기반하여, 접속 정보를 서버로 전송할 수 있 다. 접속 정보는, 단말기와 통신 장치가 접속한 시간 정보, 접속된 통신 장치의 식별 정보, 및 접속된 통신 장 치와 대응되는 장소 정보 중 적어도 하나를 포함할 수 있다. 예를 들어, 제1직원이 제1단말기를 휴대하고 2층 카페로 이동한 경우, 제3통신 장치의 신호 도달 거리 안에 제1단말기가 도달하면 제3통신 장치는 제1단말기로 신호를 보내고, 제1단말기 는 제3통신 장치와 접속한 시간 정보를 제3통신 장치의 식별 정보와 함께 서버로 전송 할 수 있다. 제2직원이 제2단말기를 들고 실외 흡연실로 이동한 경우, 제2단말기는 제5통신 장치 와 접속하게 되고 제2단말기는 제5통신 장치와 접속한 시간 정보를 제5통신 장치의 식 별 정보와 함께 서버로 전송할 수 있다. 일 실시 예에 따라, 서버는 단말기들(1221~1224)로부터 단말기들(1221~1224) 각각의 GPS 정보를 수신할 수도 있다. 이러한 실시 예에서, 단말기들(1221~1224)과 통신 장치들(1241~1245) 사이에 별도의 통신이 발생되 지 않아도 서버는 단말기들(1221 내지 1224) 각각의 접속 정보를 획득할 수 있다. 서버는 단말기들(1221~1224)로부터 수신되는 어플리케이션 실행 정보 및 접속 정보 중 적어도 하나에 기 반하여, 활동 정보 로그를 생성할 수 있다. 일 실시 예에 따라, 활동 정보 로그는 어플리케이션 또 는 컴퓨터 프로그램 실행 정보, 출퇴근 시간, 업무 외 활동 정보(카페 이용 시간/횟수, 화장실 이용 시간/횟수, 수면 시간/횟수, 흡연 시간/횟수), 및 친밀도 중 적어도 하나를 포함할 수 있다. 서버는 접속 정보에 기반하여 직원들의 출퇴근 시간 정보를 획득하고 이를 활동 정보 로그에 기록 할 수 있다. 예를 들어, 접속 정보에 기반하여 제1단말기가 영역 내에 진입하는 것으로 판단되면, 서버는 제1단말기가 영역으로 진입한 시간을 제1직원의 출근 시간으로 결정할 수 있다. 반대 로, 제1단말기가 영역 밖으로 나가는 것으로 판단되면, 서버는 제1단말기가 영역 밖으로 나간 시간을 제1직원의 퇴근 시간 또는 외출 시간으로 결정할 수 있다. 출퇴근 시간 정보를 획득 하기 위해, 영역의 경계 부근에 위치한 통신 장치가 사용될 수 있다. 서버는 접속 정보에 기반하여, 직원들의 카페 이용 시간, 화장실 이용 시간, 흡연 시간, 수면 시간과 같 은 업무 외 활동 정보를 결정하고, 이를 활동 정보 로그에 기록할 수 있다. 서버는 접속 정보에 기반하여, 직원들 사이의 만남 여부와 친밀도를 결정할 수 있다. 예를 들어, 서버 는 동일한 시간대에 제1직원의 접속 정보와 제2직원의 접속 정보가 동일하면 제1직원과 제2직원이 만난 것으로 판단할 수 있으며, 소정 시간 구간 내에 만남 횟수가 기준 값 이상이면 제1직원과 제2직원 사이의 친밀 도가 높음을 활동 정보 로그에 기록할 수 있다. 일 실시 예에 따라, 서버는 수집된 활동 정보의 분석에 기반한 피드백을 활동 정보 로그에 더 포함 시킬 수 있다. 예를 들어, 서버는 제1직원이 화장실에 자주 가는 것으로 판단되는 경우, 제1직원의 자리 를 화장실에 가깝게 배치하는 것에 대한 추천 정보를 생성하고 이를 활동 정보 로그에 포함시킬 수 있다. 서버는 제3직원이 스마트폰 메신저 어플리케이션을 기준 시간 이상으로 많이 사용하는 것으로 판단되는 경우, 제3직원에 대한 업무 집중도 점수를 낮게 부여하는 것에 대한 제안을 생성하고 이를 활동 정보 로그 에 포함할 수 있다. 서버는 제5직원의 업무 시간이 과다한 경우, 제5직원의 업무를 다른 직원들에 게 분배하는 것에 대한 제안을 생성하고 이를 활동 정보 로그에 포함시킬 수 있다. 일 실시 예에 따라, 서버는 인공 지능 기반의 예측 모델을 활용하여 직원들의 업무 효율 향상이 기대되는 추천 정보를 생성하고, 이를 피드백에 포함시킬 수 있다. 이러한 실시 예는 도4를 참조하여 후술한다.도2는 일 실시 예에 따라, 단말기가 모니터링 어플리케이션을 실행시키기 위한 방법의 흐름도를 나타낸다. 단계 S2200에서, 단말기는 출입문 또는 주차장과 같은 영역의 경계 부근에 위치한 제6통신 장치와 접속할 수 있다. 단계 S2400에서, 단말기는 건물 내부 또는 사무실과 같은 영역 내부에 위치한 제7통신 장치와 접속할 수 있다. 단계 S2600에서, 단말기는 제6통신 장치와 제7통신 장치가 순차적으로 접속하였으므로 모니터링 어플리케이션을 백 그라운드 프로세싱으로 실행시킬 수 있다. 도3은 일 실시 예에 따라, 단말기가 모니터링 어플리케이션을 실행 종료시키기 위한 방법의 흐름도를 나타낸다. 단계 S3200에서, 단말기는 건물 내부 또는 사무실과 같은 영역 내부에 위치한 제7통신 장치와 접속할 수 있다. 단계 S3400에서, 단말기는 출입문 또는 주차장과 같은 영역의 경계 부근에 위치한 제6통신 장치와 접속할 수 있다. 단계 S3600에서, 단말기는 제6통신 장치와 접속한 이후 기준 시간 내에 영역 내 다른 통신 장치와의 접속 이 없으면(Yes), 모니터링 어플리케이션의 실행을 종료(S3800)시킬 수 있다. 단말기는 제6통신 장치와 접속한 이후 기준 시간 내에 다른 통신 장치와의 접속이 있으면(No), 모니터링 어플리케이션의 실행을 유지(S3900)시킬 수 있다. 도2 내지 3을 참조하여 상술한 방법은, 서버가 접속 정보에 기반하여 출퇴근 시간 정보를 획득하기 위한 방법에도 사용될 수 있다. 예를 들어, 제1직원의 제1단말기가 영역 내부(예를 들어, 건물 내부의 로비 또는 사무실)에 위치한 제1비콘 단말기와 접속한 후 영역의 경계 부근(예를 들어, 건물 출입문, 캠 퍼스 출입문, 또는 주차장)에 위치한 제2비콘 단말기와 접속하고, 기준 시간 이내에 다른 통신 장치와의 접속 기록이 없는 경우, 서버는 제1비콘 단말기 또는 제2비콘 단말기와의 접속 시간을 제1직원의 퇴근 시간으 로 결정할 수 있다. 제2직원의 제2단말기가 영역의 경계 부근(예를 들어, 건물 출입문, 캠퍼스 출입문, 또는 주차장)에 위치한 제2비콘 단말기와 접속한 후 영역 내부(예를 들어, 건물 내부의 로비 또는 사무실)에 위치한 제1 비콘 단말기와 접속한 경우, 서버는 제1비콘 단말기 또는 제2비콘 단말기와의 접속 시간을 제2직원의 출 근 시간으로 결정할 수 있다. 도4는 일 실시 예에 따라, 기업의 생산성을 향상시키기 위한 인공 지능 기반의 예측 모델을 나타낸다. 서버는 인공 지능 기반의 예측 모델을 활용하여 직원들의 활동에 대한 추천 정보를 생성할 수 있다. 추천 정보는 기업의 생산성과 직원 업무 성과의 향상이 기대되는 활동 정보로서, 출퇴근 시간, 자리 배치, 수행 업무 내용, 업무 외 활동(흡연, 커피, 수면 등에 대한 시간이나 횟수) 등에 대한 추천 정보를 포함 할 수 있다. 예측 모델은 인공 지능 알고리즘에 기반하여 생성될 수 있다. 일 실시 예에 따라, 예측 모델 은 입력 레이어, 히든 레이어, 및 출력 레이어를 포함하는 인공 신경망에 기반할 수 있다. 입력 레이어, 히든 레이어, 및 출력 레이어 각각은 복수의 뉴런들을 포함할 수 있으며, 뉴런들은 가중치를 갖는 시냅스들로 연결될 수 있다. 서버는 예측 모델에 직원의 활동 정보를 입력하고, 예측 모델의 출력으로부터 업무 성과를 예측할 수 있다. 예를 들어, 입력되는 활동 정보는 직원의 출근 시간, 퇴근 시간, 자리 배치, 수행 업무 내용, 업무 외 활동, 친밀도 등을 포함할 수 있다. 업무 성과는 실적 달성, 매출액, 프로젝트 수행 횟수, 업무 처리 횟수 등과 같은 정량적인 데이터와 다른 사람의 평가와 같은 정성적인 데이터를 포함할 수 있다. 예측 모델에 대한 학습 및 생성은, 입력에 대응하는 현재의 출력과 목표 출력 사이의 오차율(error rate) 또는 로스(loss)를 감소시키기 위해 시냅스 가중치를 업데이트하는 역 전파(Back Propagation) 알고리즘을 사용 하여 수행될 수 있다. 일 실시 예에 따라, 예측 모델에 대한 학습 및 생성은 과거 소정 기간 동안의 직원 의 활동 정보를 입력으로, 상기 소정 기간의 상기 직원의 업무 성과를 출력으로 적용함으로써 수행될 수 있다. 서버는 예측 모델을 활용하여 직원의 다양한 활동 정보에 대한 업무 성과를 예측하고, 예측된 업무 성과에 기반하여 최적의 업무 성과를 달성할 수 있을 것으로 기대되는 활동 정보를 결정할 수 있다. 예를 들어, 서버는 제1직원과 제2직원이 친밀할수록 두 직원의 업무 성과가 높아지는 것으로 예측되는 경우, 제1직원과 제2직원의 자리를 가깝게 배치하는 것에 대한 추천 정보를 생성할 수 있다. 서버는 제3직원의 출근 시 간이 늦을수록 제3직원의 업무 성과가 높아지는 것으로 예측되는 경우, 제3직원의 출퇴근 시간을 유연하게 조정 하는 것에 대한 추천 정보를 생성할 수 있다. 서버는 제4직원이 과거 수행해온 A 업무를 수행하는 것에 비해 B 업무를 수행할 때 업무 성과가 높아지는 것으로 예측되는 경우, 제4직원에게 A 업무 대신 B 업무를 할당 하는 것에 대한 추천 정보를 생성할 수 있다. 생성되는 추천 정보는 활동 정보 로그에 포함될 수 있다. 도5는 일 실시 예에 따라, 기계식 주차장을 더 포함하는 시스템을 나타낸다. 도5를 참조하면, 시스템은 기계식 주차장을 더 포함할 수 있다. 기계식 주차장에 입고된 차량을 출고부 근처로 이동 배치함으로써, 출장이 예정된 직원들이 차량 출고를 오랫동안 대기하여야 하는 불편함이 해소될 수 있다. 서버는 직원들과 직원들의 차량 정보를 대응시켜 저장한 데이터베이스(DB)를 미리 구축할 수 있다. 데이 터베이스(DB)는 서버의 내부 또는 외부에 위치할 수 있다. 서버는 직원들의 출장 정보나 퇴근 정보를 수신하고, 수신된 출장 정보나 퇴근 정보에 기반하여 출장이 예정된 직원의 차량에 대한 출차 준비 신호를 기계식 주차장의 컨트롤러로 전송할 수 있다. 출장 정보는 출발 예정 시간을 포함할 수 있다. 예를 들어, 제1직원이 자신의 출장 정보(2019년 10월 21일에 14시부터 18시 까지)를 기업에서 운영되는 관리 시스템(예를 들어, 모니터링 어플리케이션이나 포탈 사이트)을 통해 입력하면, 제1직원의 출장 정보는 서버로 전송될 수 있다. 서버는 제1직원의 차량 정보를 데이터베이스(DB)로 부터 조회하고, 제1직원의 차량을 출장 시간의 기준 시간(예를 들어, 30분) 전에 출고부의 근처로 미리 이동시키도록 기계식 주차장의 컨트롤러에게 출차 준비 신호를 전송할 수 있다. 이에 따라, 출장이 예정 된 직원들이 차량 출고를 위해 사무실을 빨리 나올 필요가 없으므로 업무 효율과 생산성이 향상될 수 있다. 설명들은 본 발명을 구현하기 위한 예시적인 구성들 및 동작들을 제공하도록 의도된다. 본 발명의 기술 사상은 위에서 설명된 실시 예들뿐만 아니라, 위 실시 예들을 단순하게 변경하거나 수정하여 얻어질 수 있는 구현들도 포함할 것이다. 또한, 본 발명의 기술 사상은 위에서 설명된 실시 예들을 앞으로 용이하게 변경하거나 수정하여 달성될 수 있는 구현들도 포함할 것이다.도면 도면1 도면2 도면3 도면4 도면5"}
{"patent_id": "10-2019-0132442", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도1은 일 실시 예에 따라, 스마트 오피스 시스템을 나타낸다. 도2는 일 실시 예에 따라, 단말기가 모니터링 어플리케이션을 실행시키기 위한 방법의 흐름도를 나타낸다. 도3은 일 실시 예에 따라, 단말기가 모니터링 어플리케이션을 실행 종료시키기 위한 방법의 흐름도를 나타낸다. 도4는 일 실시 예에 따라, 기업의 생산성을 향상시키기 위한 인공 지능 기반의 예측 모델을 나타낸다. 도5는 일 실시 예에 따라, 기계식 주차장을 포함하는 스마트 오피스 시스템을 나타낸다."}
