{"patent_id": "10-2024-7040055", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0012579", "출원번호": "10-2024-7040055", "발명의 명칭": "복수의 TRP들로부터 복수의 PDCCH 수신을 활성화 하는 방법 및 시스템", "출원인": "삼성전자주식회사", "발명자": "멀가온카르 다타라지 딜립 라우트"}}
{"patent_id": "10-2024-7040055", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "통신 시스템에서 단말에 의해 수행되는 방법에 있어서,상기 통신 시스템에서 셀 내의 복수의 송수신 포인트(TRP: transmission and reception point)들 중 적어도 하나의 TRP와 연관된 적어도 하나의 무선 자원 제어(RRC: radio resource control) 설정 메시지를 수신하는 단계,상기 적어도 하나의 RRC 설정 메시지는 상기 적어도 하나의 TRP와 연관된 하나 이상의 해당 제어 자원 집합(CORESET: control resource set)들에 대한 CORESET 풀의 하나 이상의 인덱스를 포함하고,상기 적어도 하나의 RRC 설정 메시지는 하나 이상의 CORESET들과 상기 하나 이상의 CORESET들 중 각 CORESET과연관된 복수의 탐색 공간들을 설정하기 위해 사용되며; 그리고상기 적어도 하나의 RRC 설정 메시지를 기반으로 상기 복수의 TRP들 중 각 TRP로부터 복수의 PDCCH 중 각 PDCCH의 수신을 활성화 하는 단계를 포함하는 방법."}
{"patent_id": "10-2024-7040055", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 하나 이상의 CORESET들 중 각 CORESET은 매체 접근 제어(MAC: medium access control) 제어 요소(CE:control element)에 의해 지시된 전송 설정 지시자(TCI: transmission configuration indicator) 상태로 설정되는 방법."}
{"patent_id": "10-2024-7040055", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 각 PDCCH의 수신을 활성화 하는 단계는상기 복수의 TRP들로부터 PDCCH를 스케줄링하는 상기 적어도 하나의 RRC 설정 메시지와 연관된 복수의 CORESET들 중 각 CORESET의 CORESET 유형을 식별하는 단계를 포함하고,상기 CORESET 유형은 CORESET과 연관된 상기 복수의 탐색 공간들을 기반으로 단말 전용 CORESET, 비-단말 전용CORESET, 또는 조합 CORESET 중 하나로 식별되는 방법."}
{"patent_id": "10-2024-7040055", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 CORESET의 상기 CORESET 유형은 PDCCH의 단말 전용 수신을 위해 사용되는 상기 복수의 탐색 공간들을 기반으로 상기 단말 전용 CORESET으로 식별되는 방법."}
{"patent_id": "10-2024-7040055", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서,상기 CORESET의 상기 CORESET 유형은 PDCCH의 비-단말 전용 수신을 위해 사용되는 공통 탐색 공간들인 상기 복수의 탐색 공간들을 기반으로 상기 비-단말 전용 CORESET으로 식별되는 방법."}
{"patent_id": "10-2024-7040055", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제3항에 있어서,상기 CORESET의 상기 CORESET 유형은 (i) PDCCH의 단말 전용 수신을 위해 사용되는 상기 복수의 탐색 공간들 중적어도 하나의 탐색 공간 및 (ii) PDCCH의 비-단말 전용 수신을 위해 사용되는 상기 복수의 탐색 공간들 중 적공개특허 10-2025-0012579-3-어도 하나의 탐색 공간을 기반으로 상기 조합 CORESET으로 식별되는 방법."}
{"patent_id": "10-2024-7040055", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 각 PDCCH의 수신을 활성화하는 단계는상기 복수의 CORESET들 중 상기 CORESET 유형이 상기 단말 전용 CORESET인 것에 기반하여 상기 복수의 TRP들 중각 TRP로부터 상기 PDCCH를 수신하기 위해 상기 복수의 CORESET들 중 각 CORESET과 연관된 지시된 TCI 상태를적용하는 단계를 포함하는 방법."}
{"patent_id": "10-2024-7040055", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 각 PDCCH의 수신을 활성화하는 단계는상기 적어도 하나의 RRC 설정 메시지와 연관된 TCI 상태 지시 파라미터를 수신하는 단계, TCI 상태 지시 파라미터에는 통합 TCI 상태의 사용에 대하여 상기 단말에 지시하기 위한 값이 할당됨; 및상기 TCI 상태 지시 파라미터와 상기 적어도 하나의 RRC 설정 메시지를 기반으로 구별되는 지시된 TCI 상태들을적용하는 단계를 포함하는 방법."}
{"patent_id": "10-2024-7040055", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 구별되는 지시된 TCI 상태들을 적용하는 단계는(i) 적어도 하나의 단말 전용 CORESET을 포함하는 상기 복수의 CORESET들 및 (ii) 상기 TCI 상태 지시 파라미터의 상기 값이 1로 설정된 적어도 하나의 조합 CORESET에 기반하여 상기 복수의 TRP들 중 각 TRP로부터 상기PDCCH를 수신하기 위해 상기 복수의 CORESET들 중 각 CORESET과 연관된 지시된 TCI 상태를 적용하는 단계를 포함하는 방법."}
{"patent_id": "10-2024-7040055", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에 있어서,상기 구별되는 지시된 TCI 상태들을 적용하는 단계는상기 복수의 CORESET들의 CORESET 유형이 상기 TCI 상태 지시 파라미터의 상기 값이 1로 설정된 조합 CORESET으로 식별되는 것에 기반하여 상기 복수의 TRP들 중 각 TRP로부터 상기 PDCCH를 수신하기 위해 상기 복수의CORESET들 중 각 CORESET과 연관된 지시된 TCI 상태를 적용하는 단계를 포함하는 방법."}
{"patent_id": "10-2024-7040055", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "통신 시스템의 단말에 있어서,송수신부; 및상기 송수신부와 연결된 프로세서를 포함하고, 상기 프로세서는:상기 통신 시스템에서 셀 내의 복수의 송수신 포인트(TRP: transmission and reception point)들 중 적어도 하나의 TRP와 연관된 적어도 하나의 무선 자원 제어(RRC: radio resource control) 설정 메시지를 수신하고,상기 적어도 하나의 RRC 설정 메시지는 상기 적어도 하나의 TRP와 연관된 하나 이상의 해당 제어 자원 집합(CORESET: control resource set)들에 대한 CORESET 풀의 하나 이상의 인덱스를 포함하고,상기 적어도 하나의 RRC 설정 메시지는 하나 이상의 CORESET들과 상기 하나 이상의 CORESET들 중 각 CORESET과연관된 복수의 탐색 공간들을 설정하기 위해 사용되며; 그리고상기 적어도 하나의 RRC 설정 메시지를 기반으로 상기 복수의 TRP들 중 각 TRP로부터 복수의 PDCCH 중 각 PDCCH의 수신을 활성화 하도록 설정되는 단말.공개특허 10-2025-0012579-4-청구항 12 제11항에 있어서,상기 하나 이상의 CORESET들 중 각 CORESET은 매체 접근 제어(MAC: medium access control) 제어 요소(CE:control element)에 의해 지시된 전송 설정 지시자(TCI: transmission configuration indicator) 상태로 설정되는 단말."}
{"patent_id": "10-2024-7040055", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서,상기 프로세서는 상기 복수의 TRP들로부터 PDCCH를 스케줄링하는 복수의 CORESET들 중 각 CORESET의 CORESET 유형을 식별하도록 설정되고,상기 CORESET 유형은 CORESET과 연관된 상기 복수의 탐색 공간들을 기반으로 단말 전용 CORESET, 비-단말 전용CORESET, 또는 조합 CORESET 중 하나로 식별되는 단말."}
{"patent_id": "10-2024-7040055", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "통신 시스템에서 기지국에 의해 수행되는 방법으로서,상기 기지국에 대응하는 셀 내의 복수의 송수신 포인트(TRP: transmission and reception point)들 중 적어도하나의 TRP와 연관된 적어도 하나의 무선 자원 제어(RRC: radio resource control) 설정 메시지를 전송하는 단계,상기 적어도 하나의 RRC 설정 메시지는 상기 적어도 하나의 TRP와 연관된 하나 이상의 해당 제어 자원 집합(CORESET: control resource set)들에 대한 CORESET 풀의 하나 이상의 인덱스를 포함하고,상기 적어도 하나의 RRC 설정 메시지는 하나 이상의 CORESET들과 상기 하나 이상의 CORESET들 중 각 CORESET과연관된 복수의 탐색 공간들을 설정하기 위해 사용되며; 그리고상기 적어도 하나의 RRC 설정 메시지와 연관된 상기 복수의 TRP들 중 각 TRP로부터 복수의 PDCCH 중 각 PDCCH의전송을 활성화 하는 단계를 포함하는 방법."}
{"patent_id": "10-2024-7040055", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "통신 시스템의 기지국에 있어서,송수신부; 및상기 송수신부와 연결된 프로세서;를 포함하고,상기 프로세서는:상기 기지국에 대응하는 셀 내의 복수의 송수신 포인트(TRP: transmission and reception point)들 중 적어도하나의 TRP와 연관된 적어도 하나의 무선 자원 제어(RRC: radio resource control) 설정 메시지를 전송하고,상기 적어도 하나의 RRC 설정 메시지는 상기 적어도 하나의 TRP와 연관된 하나 이상의 해당 제어 자원 집합(CORESET: control resource set)들에 대한 CORESET 풀의 하나 이상의 인덱스를 포함하고,상기 적어도 하나의 RRC 설정 메시지는 하나 이상의 CORESET들과 상기 하나 이상의 CORESET들 중 각 CORESET과연관된 복수의 탐색 공간들을 설정하기 위해 사용되며; 그리고상기 적어도 하나의 RRC 설정 메시지와 연관된 상기 복수의 TRP들 중 각 TRP로부터 복수의 PDCCH 중 각 PDCCH의전송을 활성화 하도록 설정되는 기지국."}
{"patent_id": "10-2024-7040055", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 더 높은 데이터 전송 속도를 지원하기 위한 5G 또는 6G 통신 시스템에 관한 것이다. 본 개시에 따르면, 복수의 송수신 포인트(TRP: transmission and reception point)들로부터 복수의 물리적 하향링크 제어 채널(PDCCH: Physical Downlink Control Channel)의 수신을 활성화하는 방법 및 단말이 제공된다. 상기 방법은 (뒷면에 계속)"}
{"patent_id": "10-2024-7040055", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 단말(UE: User Equipment)에서 사용되는 무선 통신 표준에 관한 것이다. 보다 구체적으로, 본 개시는 통합(Unified) 전송 설정 지시자(TCI: Transmission Configuration Indicator) 프레임워크를 사용하여 복수의 전송 수신 포인트들(TRPs: Transmission Reception Points)로부터 복수의 물리적 하향링크 제어 채널(PDCCH: Physical Downlink Control Channel) 수신을 활성화 하는 방법 및 시스템에 관한 것이다."}
{"patent_id": "10-2024-7040055", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "5G 이동통신 기술은 높은 전송률과 새로운 서비스가 가능하도록 넓은 주파수 대역을 정의하고 있으며, 3.5 GHz 와 같은 \"Sub 6 GHz\" 대역뿐만 아니라 28 GHz 및 39 GHz를 비롯하여 초고주파(mmWave)로 지칭되는 \"Above 6 GHz\" 대역에서도 구현될 수 있다. 또한, 5G 이동통신 기술보다 50배 빠른 전송률 및 5G 이동통신 기술의 10분의 1 수준인 초저지연(ultra-low latency)을 달성하기 위하여 테라헤르츠 대역(예를 들어, 95 GHz 내지 3 THz 대역)에서 6G 이동통신 기술(Beyond 5G 시스템이라고 함)을 구현하는 것이 고려되어 왔다. 5G 이동통신 기술의 초기에는 초광대역 서비스(enhanced Mobile BroadBand: eMBB), 고신뢰/초저지연 통신 (Ultra Reliable & Low Latency Communications: URLLC), 대규모 기계식 통신 (massive Machine-Type Communications: mMTC)에 대한 서비스 지원과 성능 요구사항 만족을 목표로, 초고주파(mmWave) 대역에서의 전파 경로 손실을 완화하고 전파 전달 거리를 증가시키기 위한 빔포밍(beamforming) 및 거대 배열 다중 입출력 (massive MIMO), 초고주파 자원의 효율적 활용을 위한 뉴머롤로지(numerology, 예를 들어 복수 개의 서브캐리어 간격 운용)와 슬롯 포맷에 대한 동적 운영, 다중 빔 전송 및 광대역을 지원하기 위한 초기 접속 기술, 부분 대 역폭(BandWidth Part: BWP)의 정의 및 운영, 대용량 데이터 전송을 위한 LDPC(Low Density Parity Check) 부호 와 제어 정보의 신뢰성 높은 전송을 위한 폴라 코드(polar code)와 같은 새로운 채널 코딩 방법, L2 선-처리(L2 pre-processing), 특정 서비스에 특화된 전용 네트워크를 제공하는 네트워크 슬라이싱(network slicing) 등에 대한 표준화가 진행되었다. 현재, 5G 이동통신 기술이 지원하고자 했던 서비스들을 고려하여 초기 5G 이동통신 기술의 개선 및 성능 향상을 위한 논의가 진행 중이며, 차량이 전송하는 자신의 위치 및 상태에 관한 정보에 기반하여 자율주행 차량의 주행 판단을 돕고 사용자 편의를 증대하기 위한 V2X(Vehicle-to-Everything), 비면허 대역에서 각종 규제 관련 요구 사항들에 부합하는 시스템 동작을 목적으로 하는 NR-U(New Radio Unlicensed), NR 단말 저전력 소모 기술(UE Power Saving), 지상 망과의 통신이 불가능한 지역에서 커버리지 확보를 위한 단말-위성 직접통신인 비-지상 네 트워크(Non-Terrestrial Network: NTN), 측위(Positioning) 등의 기술에 대한 물리계층 표준화가 진행 중이다. 또한, 타 산업과의 연계 및 융합을 통한 새로운 서비스 지원을 위한 산업 사물 인터넷(Industrial Internet of Things: IIoT), 무선 백홀 링크와 액세스 링크를 통합 지원하여 네트워크 서비스 지역 확장을 위한 노드를 제공 하는 IAB(Integrated Access and Backhaul), 조건부 핸드오버(conditional handover) 및 DAPS(Dual Active Protocol Stack) 핸드오버를 포함하는 이동성 향상 기술(mobility enhancement), 랜덤 액세스 절차를 간소화하 는 2-단계 랜덤 액세스(2-step RACH for NR) 등의 기술에 대한 무선 인터페이스 아키텍쳐/프로토콜 분야의 표준 화가 진행 중이며, 네트워크 기능 가상화(Network Functions Virtualization: NFV) 및 소프트웨어 정의 네트워 킹(Software-Defined Networking: SDN) 기술의 접목을 위한 5G 베이스라인 아키텍쳐(예를 들어, 서비스 기반 아키텍처 또는 서비스 기반 인터페이스), 단말의 위치에 기반하여 서비스를 제공받는 모바일 엣지 컴퓨팅 (Mobile Edge Computing: MEC) 등에 대한 시스템 아키텍쳐/서비스 분야의 표준화도 진행 중이다. 이와 같은 5G 이동통신 시스템이 상용화됨에 따라, 폭발적인 증가 추세에 있는 커넥티드 기기들이 통신 네트워 크에 연결될 것이며, 이에 따라 5G 이동통신 시스템의 기능 및 성능 강화와 커넥티드 기기들의 통합 운용이 필 요할 것으로 예상된다. 이를 위해, 증강 현실(Augmented Reality: AR), 가상 현실(Virtual Reality: AR), 혼합 현실(Mixed Reality: MR) 등을 효율적으로 지원하기 위한 확장 현실(eXtended Reality: XR), 인공지능 (Artificial Intelligence: AI)과 머신러닝(Machine Learning: ML)을 활용한 5G 성능 개선 및 복잡도 감소, AI 서비스 지원, 메타버스 서비스 지원, 드론 통신 등에 대한 새로운 연구가 진행될 예정이다. 또한, 이러한 5G 이동통신 시스템의 발전은 6G 이동통신 기술의 테라헤르츠 대역에서의 커버리지 보장을 위한 신규 파형(waveform), 전차원 다중입출력(Full Dimensional MIMO: FD-MIMO), 어레이 안테나(Array Antenna), 대규모 안테나(large-scale antenna)와 같은 다중 안테나 전송 기술, 테라헤르츠 대역 신호의 커버리지를 개선 하기 위해 메타물질(metamaterial) 기반 렌즈 및 안테나, OAM(Orbital Angular Momentum)을 이용한 고차원 공 간 다중화 기술, RIS(Reconfigurable Intelligent Surface) 기술 뿐만 아니라, 6G 이동통신 기술의 주파수 효 율 향상 및 시스템 네트워크 개선을 위한 전이중화(full-duplex) 기술, 위성(satellite)과 AI를 설계 단계에서부터 활용하고 종단간(end-to-end) AI 지원 기능을 내재화하여 시스템 최적화를 실현하는 AI 기반 통신 기술, 단말 연산 능력의 한계를 넘어서는 복잡도의 서비스를 초고성능 통신과 컴퓨팅 자원을 활용하여 실현하는 차세 대 분산 컴퓨팅 기술 등의 개발에 대한 기반이 될 수 있을 것이다. '전송 설정 지시자'(TCI: Transmission Configuration Indicator)라는 용어는 빔 관리 시그널링 프레임워크를 위한 3GPP(3rd Generation Partnership Project)의 릴리스 15에서 도입되었으며, 여기서 단말(UE: User Equipment)이 수신할 타겟 신호들(PDCCH, 물리적 하향링크 공유 채널(PDSCH: physical downlink shared channel), 채널 상태 정보 기준 신호(CSI-RS: channel state information reference signal))은 소스 신호들과 유사 공동 위치(QCL: Quasi Co Location)이다. 따라서, QCL은 타겟 신호들을 수신하기 위해 따라야 할 채널 파 라미터들에 따라 다른 유형들이 될 수 있다. 또한, 3GPP의 릴리스 15/16의 TCI 프레임워크는 개별 하향링크(DL: downlink) 채널들 및 기준 신호들(RS: reference signals)에 대한 TCI 지시(indication)를 기반으로 한다. 이 는 매우 유연하고 독립적이지만, 많은 시나리오들의 경우 기지국(BS: base station)은 단말과 통신하기 위해 몇 개의 빔만을 필요로 할 수 있으며, 실제 동작의 경우 기지국은 다수의 채널들 및 기준 신호에 대하여 동일한 TCI 상태를 사용한다. 그러나, 이는 각 채널/기준 신호에 대한 중복(redundant) 시그널링을 초래한다. 이러한 중복 시그널링을 없애기 위해, 3GPP의 릴리스 17은 하향링크 및 상향링크(UL: uplink)에서 데이터 및 제 어 정보를 수신하기 위한 공통 TCI 상태를 도입하였다. 따라서, 공통 TCI 상태는 하향링크 및 상향링크에서 데 이터 및 제어 정보를 수신(즉, 타겟 신호들 PDCCH, PDSCH, CSI-RS 수신)하기 위한 다중 채널들/기준 신호에 적 용된다. 보다 구체적으로, TCI 상태는 반송파 집성(CA: carrier aggregation)을 위한 컴포넌트 반송파(CC: Component Carrier)/부분 대역폭(BWP: Bandwidth Part) 또는 CC들/BWP들의 집합에 대하여 설정된다. 이와 같이, 현재 릴리스 17은 하나의 BWP에 정의된 모든 CORESET들에 대하여 하나의 공통 TCI 상태만 지원한다. 공통 TCI 상태의 소스 기준 신호는 설정된 CC들/BWP들의 집합 전체에서 적어도 단말 전용 PDCCH/PDSCH에 대한 QCL 정 보 및/또는 적어도 단말 전용 물리적 상향링크 공유 채널(PUSCH: physical uplink shared channel)/물리적 상 향링크 제어 채널(PUCCH: physical uplink control channel)에 대한 공통 상향링크 송신(TX) 공간 필터(들)를 제공한다. 릴리스 17(이하 Rel-17이라 함)은 PDSCH의 단말 전용 수신과 동일한 지시된 Rel-17 TCI 상태(들)를 공유하지 않 는 하향링크 기준신호 및 컴포넌트 반송파의 모든 CORESET들 또는 그 부분집합에 대한 단말 전용 수신을 위한 통합 TCI 프레임워크를 도입했으나, Rel-17 하향링크 TCI 상태 풀의 타겟 하향링크 기준 신호로 설정될 수 있다. Rel-15/16 TCI 상태 업데이트 시그널링/설정 설계(들)를 재사용하는 Rel-17 메커니즘은 단일 TRP 시나리 오들에 대한 Rel-17 TCI 상태(들)로 이러한 하향링크 기준 신호(들)를 업데이트/설정하기 위해 사용된다. 그러 나, m-TRP 시나리오들의 경우, 통합 TCI 프레임워크는 3GPP 개선사항의 릴리스 18에서 mTRP들을 지원하기 위해 상향링크 및 하향링크에서 하나의 TCI 상태보다 많도록 확장되고 있다. 이와 같이, 통합 TCI 프레임워크의 다중 TCI 상태들로부터 타겟 신호들을 수신하기 위해 단말에 적용될 TCI 상태를 지시하는 시그널링이 존재하지 않는 다. 이상의 논의를 고려할 때, 통합 TCI 프레임워크를 사용하여 복수의 전송 수신 포인트들(TRPs: Transmission Reception Points)로부터 복수의 PDCCH 수신을 활성화 하는 효율적인 방법 및 시스템이 필요하다. 위의 정보는 본 개시의 이해를 돕기 위한 배경 정보로만 제공된다. 위의 내용 중 어느 것도 본 개시에 대한 선 행 기술로 적용될 수 있는지 여부에 대하여 어떠한 결정도, 어떠한 주장도 이루어지지 않았다."}
{"patent_id": "10-2024-7040055", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 통합(Unified) 전송 설정 지시자(TCI: Transmission Configuration Indicator) 프레임워크를 사용하 여 복수의 전송 수신 포인트들(TRPs: Transmission Reception Points)로부터 복수의 물리적 하향링크 제어 채 널(PDCCH: Physical Downlink Control Channel) 수신을 활성화 하는 방법 및 시스템을 제공할 수 있다."}
{"patent_id": "10-2024-7040055", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 양상들은 적어도 전술한 문제들 및/또는 단점들을 해결하고 적어도 후술할 이점들을 제공하기 위한 것이다. 따라서, 본 개시의 양상들은 통합(Unified) 전송 설정 지시자(TCI: Transmission Configuration Indicator) 프레임워크를 사용하여 복수의 전송 수신 포인트들(TRPs: Transmission Reception Points)로부터 복수의 물리적 하향링크 제어 채널(PDCCH: Physical Downlink Control Channel) 수신을 활성화 하는 방법 및시스템을 제공하는 것이다. 추가적인 양상들은 이어지는 설명에서 부분적으로 제시될 것이고, 부분적으로는 설명으로부터 명백해지거나 제 시된 실시예들의 실행을 통해 학습될 수 있을 것이다. 본 개시의 일 양상에 따르면, 복수의 송수신 포인트(TRP: transmission and reception point)들로부터 복수의 PDCCH의 수신을 활성화 하는 방법이 제공된다. 상기 방법은 무선 통신 시스템의 단말이 상기 무선 통신 시스템 에서 셀 내의 복수의 TRP들 중 적어도 하나의 TRP와 연관된 적어도 하나의 무선 자원 제어(RRC: radio resource control) 설정 메시지를 수신하는 단계를 포함한다. 상기 적어도 하나의 RRC 설정 메시지는 상기 적어도 하나의 TRP와 연관된 하나 이상의 해당 제어 자원 집합(CORESET: control resource set)들에 대한 하나 이상의 CORESETpoolindex를 포함한다. 상기 적어도 하나의 RRC 설정 메시지는 하나 이상의 CORESET들과 상기 하나 이상 의 CORESET들 중 각 CORESET과 연관된 복수의 탐색 공간들을 설정하기 위해 사용된다. 상기 방법은 상기 단말이 상기 적어도 하나의 RRC 설정 메시지를 기반으로 상기 복수의 TRP들 중 각 TRP로부터 복수의 PDCCH 중 각 PDCCH 의 수신을 활성화 하는 단계를 포함한다. 본 개시의 다른 양상에 따르면, 복수의 송수신 포인트(TRP: transmission and reception point)들로부터 복수 의 PDCCH의 수신을 활성화 하는 무선 통신 시스템의 단말이 제공된다. 상기 단말은 명령어들을 저장하도록 설정 된 메모리 및 상기 메모리에 저장된 상기 명령어를 실행하여 상기 단말이 상기 무선 통신 시스템에서 셀 내의 복수의 TRP들 중 적어도 하나의 TRP와 연관된 적어도 하나의 무선 자원 제어(RRC: radio resource control) 설 정 메시지를 수신하도록 설정된 프로세서를 포함한다. 상기 적어도 하나의 RRC 설정 메시지는 상기 적어도 하나 의 TRP와 연관된 하나 이상의 해당 제어 자원 집합(CORESET: control resource set)들에 대한 하나 이상의 CORESETpoolindex를 포함한다. 상기 적어도 하나의 RRC 설정 메시지는 하나 이상의 CORESET들과 상기 하나 이상 의 CORESET들 중 각 CORESET과 연관된 복수의 탐색 공간들을 설정하기 위해 사용된다. 상기 단말은 상기 적어도 하나의 RRC 설정 메시지를 기반으로 상기 복수의 TRP들 중 각 TRP로부터 복수의 PDCCH 중 각 PDCCH의 수신을 활 성화 하도록 설정된다. 본 개시의 다른 양상들, 이점들, 및 두드러진 특징들은 첨부된 도면과 함께 본 개시의 다양한 실시예들을 개시 하는 다음의 상세한 설명으로부터 통상의 기술자에게 명백해질 것이다."}
{"patent_id": "10-2024-7040055", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시는 통합 전송 설정 지시자(TCI) 프레임워크를 사용하여 복수의 전송 수신 포인트들(TRPs)로부터 복수의 물리적 하향링크 제어 채널(PDCCH) 수신을 활성화 하는 방법 및 시스템을 제공할 수 있다."}
{"patent_id": "10-2024-7040055", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "첨부 도면을 참조하는 다음의 설명은 청구항 및 그 균등물에 의해 정의된 바와 같이 본 개시의 다양한 실시예들 에 대한 포괄적인 이해를 돕기 위해 제공된다. 이는 이해를 돕기 위한 다양한 구체적인 세부사항들을 포함하지 만 이는 단지 예시로 간주되어야 한다. 따라서, 통상의 기술자라면 본 명세서에 설명된 다양한 실시예들에 대한 다양한 변경들 및 수정들이 본 개시의 범위 및 사상으로부터 벗어나지 않고 이루어질 수 있음을 인식할 것이다. 또한, 명확성과 간결성을 위해 공지의 기능들 및 구성들에 대한 설명은 생략될 수 있다. 다음의 설명 및 청구항에서 사용된 용어들과 단어들은 서지적 의미에 국한되지 않으며, 단지 본 개시의 명확하 고 일관된 이해가 가능하도록 발명자에 의해 사용된 것일 뿐이다. 따라서, 통상의 기술자에게 명백하다시피, 본 개시의 다양한 실시예들에 대한 다음의 설명은 설명의 목적으로만 제공되며 첨부된 청구항 및 그 균등물에 의해 정의되는 본 개시를 한정하기 위한 것이 아니다. 단수 형태의 단어라 하더라도 문맥상 명확하게 달리 지시되지 않는 한 복수의 지시대상을 포함하는 것으로 이해 되어야 한다. 따라서, 예를 들어 “구성의 표면”이라는 언급은 이러한 표면들 중 하나 이상에 대한 언급을 포 함한다. 본 명세서에서, “예시적”이라는 단어는 “예시, 사례, 또는 설명으로 제공됨”을 의미하기 위해 사용된다. 여 기에서 “예시적”으로 설명된 주제의 실시예나 구현이 반드시 다른 실시예들보다 선호되거나 유리한 것으로 해 석되는 것은 아니다. 본 개시는 다양한 변형들 및 대안적 형태들이 가능하지만, 그 구체적인 실시예가 도면에서 예시로 도시되고 아 래에서 상세히 설명될 것이다. 그러나 이는 본 개시를 개시된 특정 형태들로 한정하고자 하는 것이 아니며, 반 대로 본 개시는 그 기술적 사상 및 범위 내에 있는 모든 변형들, 균등물들, 및 대체물들을 포괄하는 것으로 이 해되어야 한다. “포함하다”, “포함하는”, 또는 그 변형들과 같은 용어들은 비-배타적인 포함을 의도하는 것이며, 이에 따라 구성요소들 또는 단계들의 목록을 포함하는 설정, 장치, 또는 방법은 그 구성요소들 또는 단계들만을 포함하는 것이 아니라 명시적으로 나열되지 않거나 그러한 설정, 장치, 또는 방법에 내재되지 않은 다른 구성요소들 또는 단계들도 포함할 수 있다. 다시 말해, 장치 또는 시스템에서 “포함하다”로 시작되는 하나 이상의 구성요소는 다른 제약이 없으면 그 장치 또는 시스템에서 다른 구성요소 또는 추가적인 구성요소의 존재를 배제하지 않는다. 본 개시의 실시예들에 대한 다음의 상세한 설명에서는 첨부 도면을 참조하여 본 개시가 실행될 수 있는 구체적 인 실시예들을 예시로 보여준다. 이러한 실시예들은 통상의 기술자가 본 개시를 실시할 수 있도록 충분하게 상 세히 설명되며, 다른 실시예들이 활용될 수 있을 뿐 아니라 본 개시의 범위를 벗어나지 않고 변경이 가능함을 이해할 것이다. 따라서, 다음의 설명은 제한적인 의미로 받아들여서는 안 된다. 설명의 편의를 위해, 본 개시는 3GPP RAN(3rd Generation Partnership Project Radio Access Network) 표준에 서 정의된 용어들과 명칭들을 사용한다. 보다 구체적으로, 용어들 ‘PDCCH’, ‘PDSCH’, ‘PUSCH’, ‘PUCCH’, ‘하향링크 제어 정보(DCI: 'downlink control information)’, ‘UL’, ‘DL’, ‘TCI 상태’, ‘ 통합 TCI 상태’, ‘지시된 TCI 상태’, ‘CORESET’, ‘CORESETPOOLINDEX’, 및 ‘전송 수신 지점 (Transmission Reception Point)’은 3GPP RAN 표준에 의해 명시된 바와 같이 해석되어야 한다. 용어 ‘전송 수신 지점’은 간단히 TRP로 지칭되고, 단말(이하 ‘UE’로 지칭)로 서비스를 제공하는 TRP들의 집합은 본 개시 전반에 걸쳐 다중-TRP 또는 m-TRP들로 상호교환적으로 지칭된다. 도 1은 본 개시의 실시예에 따른, 무선 통신 시스템의 예시적 표현이다. 도 1을 참조하면, 무선 통신 시스템은 5세대(5G) 통신 시스템의 예이다. 본 개시는 특히 무선 통신 시스템 에서 하나보다 많은 TRP가 단말에 서비스를 제공(즉, PDSCH 데이터 스케줄링)하려는 m-TRP 시나리오에 관한 것이다. 따라서, 무선 통신 시스템에서 셀 내의 복수의 TRP들, 예를 들어 TRP들(102a 및 102b)를 도시한다. 복수의 TRP들(본 명세서에서는 ‘다중-TRP들’ 또는 ‘m-TRP들’이라고도 함)은 유연한 배치 시나리 오들을 통해 신뢰성, 커버리지, 및 용량 성능을 향상시키기 위해 5G 통신 시스템들에서 필수적이다. 예시적 목 적을 위해 도 1에는 두 개의 TRP들(즉, 102a 및 102b)만 도시되어 있지만 셀은 m-TRP 시나리오에서 두 개 보다 많은 TRP들을 포함할 수 있다. 또한, 설명의 용이성을 위해 무선 통신 시스템에 단일 셀만 도시 되어 있지만, 본 개시의 실시예들은 m-TRP 시나리오에서 PDCCH 수신을 활성화 하기 위해 무선 통신 시스템(10 0)에 배열된 복수의 이러한 셀들에서 구현될 수 있다. 따라서, 복수의 TRP들(102a, 102b)은 셀 내에 위치할 수 있으며, 예를 들어 소도시에 걸쳐 있는 매크로셀 (macrocell)일 수 있다. 마이크로셀 내의 복수의 TRP들(102a, 102b)의 위치는 예시적 목적으로 도시되었으며, 복수의 TRP들(102a, 102b)은 펨토셀들(femtocells), 피코셀들(picocells) 또는 마이크로셀들(microcells)에 위 치할 수 있다. 예를 들어, 복수의 TRP들(102a, 102b)은 대규모 장소의 작은 부분인 피코셀에 위치할 수 있다(예 를 들어, 경기장, 기차역, 쇼핑몰, 및 높은 데이터 용량 요구 및 커버리지를 가지는 지역과 같은 고밀도 도시 지역). 일 예에서, 복수의 TRP들(102a, 102b)은 셀 내에 위치할 수 있으며 사전 정의된 거리(즉, 본 명세서에서 커버리지 영역이라고도 함) 내에 위치한 복수의 단말(UE)들에 서비스를 제공할 수 있다. 예를 들어, 복수의 TRP 들(102a, 102b)은 피코셀 내의 복수의 단말들(예: 사용자와 연관된 단말)에 콘텐츠를 보거나 액세스 하는 것과 같은 서비스들을 제공한다. 단말의 예들로는 사용자가 통신하고/하거나 콘텐츠에 액세스하 기 위해 사용하는 모든 장치(예: 휴대폰, 랩톱, 웨어러블, 사물 인터넷(IoT) 등)가 포함되지만 이에 국한되지 않는다. 복수의 TRP들(102a, 102b)은 처리 능력을 가진 계층 스택인 마스터 노드에 의해 제어될 수 있다. 일 실시예에서, 마스터 노드는 셀 내의 차세대 노드 B(gNB) 또는 기지국이며 셀 내의 TRP들 (102a, 102b)을 제어한다. 보다 구체적으로, 마스터 노드는 복수의 TRP들(102a, 102b)과 단말의 연 결을 용이하게 하기 위한 제어 메시지들 및 시그널링들을 생성한다. 예시적인 시나리오에서, 단말을 운용하는 사용자는 여행 중일 수 있으며, 이에 따라 사용자는 다른 지리적 위치로 이동하였을 수 있다. 예를 들어, 사용자는 이웃 셀(도 1에 도시되지 않음)에서 셀 로 이동하였다. 이에 따라, 단말은 해당 셀의 m-TRP들(102a, 102b)로부터 PDCCH 및 PDSCH를 수 신하도록 설정되어야 한다. 3GPP 표준에 명시된 바와 같이, 단말은 PDCCH 수신을 활성화 하기 위한 TCI 상 태들을 적용해야 한다. 본 개시의 다양한 실시예들은 복수의 TRP들로부터 복수의 PDCCH 수신을 활성화 하는 개선된 방법을 개시한다. 보다 구체적으로, 본 개시의 목적은 m-TRP 시나리오에서 다중 TCI 상태들에 대하여 통합 TCI 프레임워크에 대한 CORESETpoolindex를 재사용하는 것이다. 다시 말해, 기지국으로부터의 RRC 설정 메시지는 m-TRP 시나리오를 지 시하는 CORESETpoolindex와 PDCCH 수신을 위해 적용될 통합 TCI 프레임워크의 지시된 TCI 상태의 사용에 대하여 단말에 지시하기 위한 TCI 상태 지시 파라미터와 같은 시그널링 파라미터들을 포함한다. 이러한 RRC 설정 메시지는 복수의 TRP들(102a, 102b)로부터 복수의 PDCCH의 수신을 위해 CORESET 특정 TCI 상태가 단말에 적용되도록 함으로써 m-TRP 절차들을 Rel 17 통합 TCI 상태와 연결한다. 일반적으로, 복수의 CORESET들이 단말 전용 CORESET들인 경우, 임의의 PDCCH 수신 및 각각의 PDSCH 수신에 대하여, 단말은 항상 지시된 Rel-17 TCI 상태를 적용한다. 복수의 CORESET들이 조합 CORESET들이거나 또는 하나의 CORESET이 조합 CORESET 이고 하나의 CORESET이 단말 전용 CORESET인 경우, 복수의 CORESET들에 대한 임의의 PDCCH 수신 및 각각의 PDSCH 수신에 대하여, 단말이 셀과 연관된 지시된 Rel-17 TCI 상태를 적용할지 여부는 RRC 설정 메시지 및 TCI 상태 지시 파라미터에 의해 CORESET마다 결정된다. m-TRP 시나리오에서 릴리스 15/16에서 요구하는 바와 같 이 다중 TCI 상태들을 가지고 규격에 미치는 영향을 줄이기 위해, 릴리스 16의 CORESETpoolindex를 혁신적인 방 식으로 사용하여 다중 DCI 시나리오에 대한 릴리스 17 통합 TCI 규칙들을 적용한다. 복수의 TRP들(102a, 102b) 로부터 단말의 PDCCH 수신을 활성화 하는 것은 도 2, 3, 4a 내지 4c, 5, 및 6을 참조하여 상세히 설명된다. 도 2는 본 개시의 실시예에 따른, 복수의 TRP들(102a, 102b)로부터 복수의 PDCCH의 수신을 활성화 하는 단말 을 도시한다. 전술한 바와 같이, 단말은 무선 통신 시스템에서 5G로 동작 가능하고 여기에 설명 된 하나 이상의 동작들을 수행할 수 있는 임의의 장치이다. 도 2를 참조하면, 단말은 프로세서, 메모리, 입출력 모듈, 및 통신 인터페이스을 포 함하는 것으로 도시되어 있다. 일부 실시예들에서, 단말은 도시된 것보다 더 많거나 더 적은 구성요소들을포함할 수 있다. 단말의 다양한 구성요소들은 하드웨어, 소프트웨어, 펌웨어 또는 이들의 임의의 조합을 사용하여 구현될 수 있다. 또한, 단말의 다양한 구성요소들은 서로 작동적으로 결합될 수 있다. 보다 구체 적으로, 단말의 다양한 구성요소들은 통신 채널 매체(예: 버스, 상호연결 등)를 사용하여 서로 통신할 수 있다. 일 실시예에서, 프로세서는 다중 코어 프로세서, 단일 코어 프로세서, 또는 하나 이상의 다중 코어 프로세 서와 하나 이상의 단일 코어 프로세서의 조합으로 구현될 수 있다. 예를 들어, 프로세서는 코프로세서 (coprocessor), 마이크로프로세서, 컨트롤러, 디지털 신호 프로세서(DSP: digital signal processor), DSP를 수반하거나 수반하지 않는 처리 회로, 또는 마이크로컨트롤러 유닛(MCU: microcontroller unit), 하드웨어 가속 기, 특수 목적 컴퓨터 칩 등을 비롯한 그 밖의 다양한 처리 장치들 중 하나 이상으로 구현될 수 있다. 일 실시예에서, 메모리는 본 명세서에서 명령어들로 지칭되는 기계 실행 명령어들(machine executable instructions)을 저장할 수 있다. 일 실시예에서, 프로세서는 소프트웨어 명령어들의 실행자 (executor)로서 구현된다. 이와 같이, 프로세서는 본 명세서에서 설명된 하나 이상의 동작들을 수행하기 위해 메모리에 저장된 명령어들을 실행할 수 있다. 메모리는 도 3, 4a 내지 4c, 및 5를 참조하여 자세히 설명되는 바와 같이 각각의 기능들을 수행하기 위해 프로세서가 액세스 가능한 모든 유형의 저장소일 수 있다. 예를 들어, 메모리는 하나 이상의 휘발성 또는 비휘발성 메모리들 또는 이들의 조합을 포함할 수 있다. 예를 들어, 메모리는 플래시 메모리, 마스크 롬(mask ROM(read only memory)), 프로그래밍 가능 ROM (PROM: programmable ROM), 소거 가능 PROM(EPROM: erasable PROM), 램(RAM: random access memory) 등과 같은 반도체 메모리들로 구현될 수 있다. 실시예에서, 메모리는 연관 테이블(association table)을 저장할 수 있다. 연관 테이블은 CORESETPOOLINDEX, CORESET 들 및 TRP 간의 연관들과 같은(그러나 이에 한정되지 않음) 연관들을 포함한다. 3GPP 표준에서, 복수의 TRP들 (102a, 102b) 중 각각의 TRP는 서로 다른 CORESET들에 의해 구별된다(즉, 각각의 CORESET은 하나의 TRP에만 대 응한다). 예를 들면, TRP(102a)는 CORESET P와 연관될 수 있고, TRP(102b)는 CORESET Q와 연관될 수 있다. 이 에 따라, 서로 다른 TRP들은 서로 다른 CORESET 그룹들을 사용하여 복수의 PDCCH들을 전송할 수 있다. 따라서, 서로 다른 CORESET 그룹들의 CORESET들은 서로 다른 CORESET 그룹 인덱스들(이하 ‘CORESETPoolIndex’라고 함)에 의해 구별된다. 이 파라미터를 사용하면, 단말은 동일한 CORESETPoolIndex를 가지는 CORESET들에서 PDCCH에 의해 스케줄링된 모든 데이터가 동일한 TRP 또는 서로 다른 TRP들로부터 온다고 가정할 수 있다. 예를 들어, CORESET P가 CORESETPoolIndex = 1과 연관되어 있으면, CORESET P로부터 수신된 PDCCH는 단일 TRP(예: TRP 102a)와 연관된다. 이러한 연관들은 연관 테이블에 저장된다. CORESET을 설정하는 예는 뒤에서 도 3을 참조 하여 설명된다. 실시예에서, 프로세서는 다음에 대하여 명령어들을 실행하도록 설정된다: 적어도 하나의 무선 자 원 제어(RRC: Radio Resource Control) 설정 메시지의 수신, 적어도 하나의 RRC 설정 메시지와 관련된 TCI 상태 지시 파라미터의 수신, 복수의 CORESET들의 CORESET 유형의 결정, TCI 상태 지시 파라미터 및 적 어도 하나의 RRC 설정 메시지에 기반하여 구별되는 지시된 TCI 상태의 적용, 적어도 하나의 RRC 설정 메시 지의 CORESET 유형 및 TCI 상태 지시 파라미터 값에 기반하여 복수의 TRP들(102a, 102b) 중 각각의 TRP로부터 PDCCH를 수신하기 위해 복수의 CORESET들 중 각각의 CORESET과 연관된 지시된 TCI 상태의 적용. 또한, 프로세서 는 복수의 TRP들로부터 복수의 PDCCH의 수신을 활성화 하기 위한 명령어들을 실행하도록 설정된다. 실시예에서, 입출력(I/O) 모듈은 기지국, 복수의 TRP들(102a, 102b), 및/또는 단말의 사용자와 같은 주변 장치들로부터 입력을 수신하고 출력을 제공하도록 설정된 메커니즘들을 포함할 수 있다. 단말에 대한 입력 수신 및 출력 제공을 가능하게 하기 위해, 입출력 모듈은 적어도 하나의 입력 인터페이스 및/또 는 적어도 하나의 출력 인터페이스를 포함할 수 있다. 입력 인터페이스의 예로는 키보드, 마우스, 조이스틱, 키 패드, 터치 스크린, 소프트 키들, 마이크 등이 포함될 수 있지만, 이에 한정되지 않는다. 출력 인터페이스의 예 로는 발광 다이오드 디스플레이, 박막 트랜지스터(TFT: thin-film transistor) 디스플레이, 액정 디스플레이, 액티브 매트릭스 유기 발광 다이오드(AMOLED: active-matrix organic light-emitting diode) 디스플레이, 마이 크, 스피커, 벨소리 등과 같은 디스플레이가 포함될 수 있지만, 이에 한정되지 않는다. 실시예에서, 통신 인터페이스는 무선 통신 시스템의 다른 엔티티들, 예를 들어 마스터 노드(즉, 기지 국(gNB))와 같은 다른 네트워크 노드들 또는 미디어 콘텐츠에 액세스하거나 미디어 콘텐츠를 송수신하기 위한 TRP들의 집합(즉, TRP들 102a 및 102b)과 통신하도록 설정된 메커니즘들을 포함할 수 있다. 이와 같이, 통신 인 터페이스는 적어도 하나의 RRC 설정 메시지를 수신하도록 설정된다. 실시예에서, 마스터 노드(즉, 기지국(gNB))는 단말에 대한 적어도 하나의 RRC 설정 메시지를 생성한다. 이미 설명한 바와 같이, 적어도 하 나의 RRC 설정 메시지는 단말이 셀 내의 복수의 TRP들(102a, 102b)과 연결할 수 있도록 한다. 실시예 에서, 마스터 노드는 복수의 RRC 설정 메시지들(R1, R2)를 복수의 TRP들(102a, 102b)로 전송하고, TRP들 (102a, 102b)은 이를 단말로 전달한다. 예를 들어, RRC 설정 메시지 R1은 단말로의 전송 및 TRP(102a)로부터의 PDCCH 스케줄링을 위해 마스터 노드에 의해 TRP(102a)로 전송된다. 마찬가지로, RRC 설 정 메시지 R2는 단말로의 전송 및 TRP(102b)로부터의 PDCCH 스케줄링을 위해 마스터 노드에 의해 TRP(102b)로 전송된다. 다른 실시예에서, 단일 RRC 설정 메시지 R12는 마스터 노드에 의해 TRP(102a)로 전 송될 수 있다. 이러한 경우, TRP(102a)는 단말이 TRP들(102a, 102b)로부터 PDCCH를 수신하도록 설정하기 위해 단말로 RRC 설정 메시지 R12를 전송한다. 실시예에서, 복수의 TRP들(102a, 102b) 중 TRP(예: TRP 102a)로부터 수신된 적어도 RRC 설정 메시지 R12는 적 어도 다음을 포함한다: 적어도 하나의 TRP(102a, 102b)와 연관된 하나 이상의 해당 CORESET들에 대한 하나 이상 의 CORESETpoolindex. 다른 실시예에서, 개별 RRC 설정 메시지들 R1 및 R2가 TRP들(102a, 102b)로 각각 전송되 는 경우, 각각의 RRC 설정 메시지(즉, R1 및 R2)는 TRP와 연관된 CORESET에 대한 CORESETpoolindex를 포함한다. 예를 들어, R1은 TRP(102a)와 연관된 CORESET에 대한 CORESETpoolindex를 포함하고 R2는 TRP(102b) 와 연관된 CORESET에 대한 CORESETpoolindex를 포함한다. CORESET에 대한 CORESETpoolindex는 해당 CORESET에 대한 CORESET 풀의 인덱스이다. 예를 들어, CORESET P가 TRP(102a)와 연관되어 있으면, RRC 설정 메시지 R1의 일부로서 CORESETpoolindex = 0이 수신될 수 있다. 일반적으로, 각각의 RRC 설정 메시지는 해당 CORESET 및 그 CORESET과 연관된 복수의 탐색 공간들(S1, S2, …, Sn)을 설정하기 위해 사용된다. 본 개시를 설명하기 위해 TRP와 연관된 CORESET에 대한 CORESETpoolindex 데이 터 필드만이 RRC 설정 메시지와 관련하여 지시되지만, RRC 설정 메시지는 CORESET 관련 식별(ID: identification), CORESET과 관련된 TCI 정보, CORESET의 시간/주파수 자원 설정과 같이 3GPP 표준에 의해 정 의된 다양한 파라미터들과 관련된 복수의 데이터 필드들을 포함할 수 있다. 탐색 공간은 PDCCH가 전달될 수 있는 하향링크 자원 그리드(grid)의 영역을 의미한다. 일반적으로, CORESET은 복수의 탐색 공간들, 예를 들어 4개의 탐색 공간들을 가진다. 따라서, 단말은 PDCCH를 찾기 위해 이러한 탐색 공간들 전체에서 블라인드 디코딩(blind decoding)을 수행한다. 탐색 공간들은 3GPP 표준에 정의되어 있으 며 다음 중 하나일 수 있다: 단말 특정 탐색 공간(USS: UE specific search space), 공통 탐색 공간(CSS: common search space) 유형 0, CSS 유형 0A, CSS 유형 1, CSS 유형 2, CSS 유형 3. 예에서, CORESET은 4개의 USS를 가질 수 있다. 다른 예에서, CORESET은 하나의 USS와 유형 0, 1 및 2의 3개의 CSS들을 가질 수 있다. CORESET을 설정하는 예는 도 3을 참조하여 다음에서 설명한다. 도 3은 본 개시의 실시예에 따른, 복수의 CORESET들을 설정하는 표현이다. 이미 설명한 바와 같이, 각각의 CORESET은 복수의 TRP들(102a, 102b)의 TRP와 연관되어 있다. 따라서, 각각의 CORESET은 RRC 설정 메시지에 지 시된 바와 같이 RRC 파라미터 CORESETPoolIndex와 연관되어 있다. 다시 말해, CORESET 풀의 인덱스는 CORESET 그룹 ID를 의미할 수 있다. 일 예에서, CORESET 풀의 인덱스(예: CORESETPoolIndex)는 0 또는 1로 설정될 수 있다. 도 3을 참조하면, 이 예시적 표현에서, 부분 대역폭(BWP: Bandwidth Part)은 복수의 CORESET들(302a, 302b, 302c, 302d)(즉, CORESET 1, CORESET 2, CORESET 3, CORESET 4)을 가진다. 이들 CORESET들의 각각은 복 수의 TRP들(102a, 102b) 중 하나의 TRP와 연관될 수 있다. 예를 들어, CORESET 1은 TRP(102a)와 연관될 수 있 고, CORESET 2는 TRP(102b)와 연관될 수 있다. 이 예시적 표현에서, CORESET들(302a, 302c, 302d)(즉, CORESET 1, CORESET 3, CORESET 4)은 단일 풀에 속하고 CORESETPoolIndex = 0으로 표현되는 반면, CORESET(302b)(즉, CORESET 2)는 다른 풀에 속하고 CORESETPoolIndex = 1로 표현된다. 또한, 이러한 CORESET들(302a, 302b, 302c, 302d)의 각각은 CORESET 관련 ID, 및 RRC 설정 메시지에 명시된 CORESET과 관련된 TCI 정보와 연관될 수 있다. 보다 구체적으로, 동일한 CORESETPoolindex를 가지는 CORESET들은 도 3에 도시된 릴리스 17 통합 TCI 프레임워크에 따라 구별되는 TCI 상태들과 연관된다. 실시예에서, 복수의 CORESET들의 각 CORESET은 매체 접근 제어(MAC: Medium Access Control) 제어 요소(CE: Control Element)에 의해 지시된 TCI 상태로 설정된다. 예를 들어, MAC CE는 CORESET 1을 CORESET ID #5 및 TCI 상태 X로, CORESET 2를 CORESET ID #3 및 TCI 상태 Y로, CORESET 3을 CORESET ID #2 및 TCI 상태 X로, CORESET 4를 CORESET ID #6 및 TCI 상태 X로 설정한다. 이와 같이, MAC CE는 각각의 CORESET 을 서로 다른 TCI 상태를 가지는 서로 다른 CORESETPoolIndex로 설정한다. TCI 상태 X/Y는 m-TRP 시나리오에대한 릴리스 17 통합 TCI를 기반으로 하는 PDSCH-config에서 설정된 TCI 상태 ID를 의미한다. 또한, 각 TRP로부 터의 RRC 설정 메시지는 CORESET ID와 관련된 정보, 및 복수의 TRP들(102a, 102b)의 각 TRP에 대한 CORESET과 관련된 TCI 정보를 포함할 수도 있다. 통신 인터페이스는 또한 적어도 하나의 RRC 설정 메시지와 관련하여 TCI 상태 지시 파라미터(Tp)를 수신한 다. TCI 상태 지시 파라미터에는 통합 TCI 상태의 사용에 대하여 단말에 지시하기 위한 값이 할당된다. 일 실시예에서, TCI 상태 지시 파라미터(Tp)는 지시된 릴리스 17 TCI 상태를 따르는 1비트 지시(indication)이다. 다시 말해, TCI 상태 지시 파라미터와 나중에 설명될 적어도 하나의 RRC 설정 메시지를 기반으로 단말에 구별되는 지시된 TCI 상태들이 적용된다. 통신 인터페이스는 적어도 하나의 RRC 설정 메시지와 TCI 상태 지시 파라미터(Tp)를 프로세서에 전달한다. 프로세서는 메모리의 명령어들과 함께 본 명세 서에 설명된 하나 이상의 동작들을 수행하도록 설정된다. 프로세서는 복수의 TRP들(102a, 102b)로부터 PDCCH를 스케줄링하는 복수의 CORESET들의 CORESET 유형을 결정하도록 설정된다. 이미 설명한 바와 같이, 각각의 TRP는 하나 이상의 CORESET과 연관된다. 보다 구체적으로, 각각의 TRP는 그 자신의 PDCCH를 통해 그 자신의 PDSCH를 스케줄링하기 때문에, 프로세서는 서로 다른 TRP들로부터 개별적으로 PDCCH들을 모니터링할 필요가 있다. 따라서, 서로 다른 TRP들, 즉 복수의 TRP들(102a, 102b)은 서로 다른 CORESET들에 의해 구별된다. 일 예에서, CORESET(302a)는 TRP(102a)와 연관될 수 있고, CORESET(302b)는 TRP(102b)와 연관될 수 있다. 다른 예에서, CORESET(302a, 302c)는 TRP(102a)와 연 관될 수 있고, CORESET(302b, 302d)는 TRP(102b)와 연관될 수 있다. 실시예에서, CORESET의 CORESET 유형은 단 말 전용(UE-dedicated) CORESET, 비-단말 전용(non-UE-dedicated) CORESET 및 조합(combination) CORESET 중 하나로 CORESET과 연관된 복수의 탐색 공간들에 기반하여 결정된다. 실시예에서, 복수의 탐색 공간들(S1, S2, …, Sn)이 PDCCH의 단말 전용 수신을 위해 사용되는 경우, CORESET의 CORESET 유형은 단말 전용 CORESET으로 결정된다. 다시 말해, 예를 들어 복수의 탐색 공간들 S1, S2, S3, S4가 PDCCH의 단말 전용 수신을 위한 USS 또는 CSS 유형 3인 경우, CORESET은 단말 전용 CORESET으로 분류된다. 실시 예에서, CORESET의 복수의 탐색 공간들이 PDCCH의 비-단말 전용 수신을 위해 사용되는 공통 탐색 공간들인 경우, CORESET의 CORESET 유형은 비-단말 전용 CORESET으로 결정된다. 일 예에서, 복수의 탐색 공간들 S1, S2, S3, S4가 CSS 유형 0, 0A, 1, 2인 경우, CORESET은 비-단말 전용 CORESET으로 분류된다. 실시예에서, 복수의 탐색 공간들 중 적어도 하나의 탐색 공간이 PDCCH의 단말 전용 수신을 위해 사용되고 복수의 탐색 공간들 중 적 어도 하나의 탐색 공간이 PDCCH의 비-단말 전용 수신을 위해 사용되는 경우, CORESET의 CORESET 유형은 조합 CORESET으로 결정된다. 일 예에서, 탐색 공간들 S1, S3, S4가 각각 CSS 유형 0, 0A 및 1인 반면, 탐색 공간 S2 가 USS인 경우, CORESET은 조합 CORESET으로 분류된다. 따라서, 프로세서는 복수의 TRP들(102a, 102b)로 부터 수신된 PDCCH를 스케줄링하는 적어도 하나의 RRC 설정 메시지와 연관된 복수의 CORESET들 중 각 CORESET의 CORESET 유형을 결정하도록 설정된다. 일 예에서, TRP들(102a, 102b)과 연관된 모든 CORESET들은 단말 전용 CORESET들이다. 다른 예에서, 복수의 TRP들(102a, 102b)과 연관된 모든 CORESET들은 비-단말 전용 CORESET들이 다. 또 다른 예에서, 102a 및 102b와 연관된 CORESET들은 조합 CORESET들이다. 도 4a는 본 개시의 실시예에 따른, 대응하는 복수의 TRP들로부터 복수의 PDCCH의 수신을 활성화 하는 예시적 시 나리오를 도시한다. 도 4a를 참조하면, 대응하는 복수의 TRP들(102a, 102b)로부터 복수의 PDCCH 수신을 활성화 하는 예시적 시나리 오가 본 개시의 실시예에 따라 도시되어 있다. 보다 구체적으로, 시나리오는 릴리스 17 통합 TCI 프 레임워크에 따라 단일/다중 지시된 TCI 상태들로 설정된 하나 또는 다중 CORESET(CORESET 그룹)에 대한 CORESETpoolindex의 예시적 설정이다. 이 예시적 시나리오에서, TRP(102a)와 연관된 CORESET(이하 CORESET X라 함) 및 TRP(102b)와 연관된 CORESET(이하 CORESET Y라 함)은 모두 단말 전용 CORESET들로 결 정된다. 다시 말해, CORESET X 및 CORESET Y에서 복수의 탐색 공간들은 PDCCH의 단말 전용 수신을 위한 USS 또 는 CSS 유형 3이다. 보다 구체적으로, 서로 다른 CORESETpoolindex를 가지는 M-DCI 시나리오의 경우, 단말 이 단말 전용 PDCCH를 수신하도록 PDCCH-Config에 설정된 CORESET들 또는 공통 탐색 공간(CSS: common search space) 유형 3 또는 사용자 특정 탐색 공간(USS: User specific search space) 유형의 탐색 공간만 가 지는 CORESET들이다. 따라서, 하나의 CC/BWP에 대하여 설정된 CSS 유형 3/USS 유형의 탐색 공간만 가지는 모든 CORESET들은 CORESETpoolindex 0 또는 1을 가진다. 예를 들어, CORESET X는 CORESETPoolIndex = 0이고 CORESET Y는 CORESETPoolIndex = 1이다. 실시예에서, 복수의 CORESET들의 CORESET 유형이 단말 전용 CORESET인 경우, 프로세서는 복수의 TRP들 (102a, 102b)의 각 TRP로부터 PDCCH를 수신하기 위해 복수의 CORESET들(즉, CORESET X 및 CORESET Y)의 각 CORESET과 연관된 지시된 TCI 상태를 적용하도록 설정된다. 예를 들어, 단말 전용 PDCCH에 대하여 사용되는 CORESET(즉, CORESET X) 또는 CSS 유형 3 또는 USS의 탐색 공간(탐색 공간 404a, 404b 참조)만 가지는 CORESET은 CORESETpoolindex가 0으로 설정되어 TCI 상태 X를 가지고, 다른 단말 전용 PDCCH에 대하여 사용되거 나 CSS 유형 3 또는 USS의 탐색 공간(탐색 공간 408a, 408b 참조)을 가지는 CORESET은 CORESETpoolindex가 1로 설정되어 TCI 상태 Y를 가진다. 도 2를 참조하면, 메모리에 저장된 명령어들와 협력하여 프로세서는 적어도 하나의 RRC 설정 메 시지와 관련하여 TCI 상태 지시 파라미터(Tp)를 수신한다. 일 실시예에서, TCI 상태 지시 파라미터(Tp)에는 단 말에 통합 TCI 상태의 사용에 대하여 지시하기 위한 값이 할당된다. 일 실시예에서, TCI 상태 지시 파라미 터는 CORESET과 연관된 지시된 Rel-17 TCI 상태가 PDCCH 수신을 활성화 하기 위해 단말에 적용되어야 하는 지 여부를 프로세서에 지시한다. 즉, TCI 상태 지시 파라미터(Tp)는 각각의 CORESET과 연관된 지시된 릴리 스 17 TCI 상태를 따르는 1비트 지시이다. 따라서, TCI 상태 지시 파라미터와 적어도 하나의 RRC 설정 메시지를 기반으로 CORESET과 연관된 구별되는 지시된 TCI 상태가 PDCCH 수신을 활성화 하기 위해 단말에 적용된다. 일반적으로, TCI 상태 지시 파라미터(Tp)가 ‘1’로 설정된 경우, 해당 RRC 설정 메시지가 수신된 TRP와 연관된 CORESET의 통합된 TCI 상태가 PDCCH 수신을 활성화 하기 위해 단말에 적용된다. 보다 구체적으로, 복수의 TRP들(102a, 102b)과 연관된 복수의 CORESET들의 CORESET 유형이 적어도 하나의 단말 전용 CORESET 및 적 어도 하나의 조합 CORESET, 및 조합 CORESET 중 하나로 결정되는 경우, TCI 상태 지시 파라미터(Tp)는 1로 설정된다. 이러한 두 개의 시나리오들이 도 4b 및 4c를 참조하여 추가로 설명된다. 도 4b는 본 개시의 실시예에 따른, 대응하는 복수의 TRP들로부터 복수의 PDCCH의 수신을 활성화 하는 예시적 시 나리오를 도시한다. 도 2와 함께 도 4b를 참조하면, 복수의 TRP들(102a, 102b)로부터 복수의 PDCCH 수신을 활성화 하는 예시적 시나 리오가 본 개시의 다른 실시예에 따라 설명된다. 보다 구체적으로, 이 시나리오는 지시된 릴리스 17 TCI 상태들을 따르는 두 개의 CORESET들(452, 456)(즉, CORESET X 및 CORESET Y)을 묘사하는데, 여기서 두 개 의 CORESET들(452, 456)은 모두 CORESET X 및 Y 각각과 연관된 단말 전용 및 비-단말 전용 유형의 탐색 공간을 가진다. 다시 말해, CORESET X 및 CORESET Y는 릴리스 17의 통합 TCI 프레임워크에 따라 구별되는 TCI 상태들과 연관된 조합 CORESET들이다. 실시예에서, 복수의 CORESET들(452, 456)이 적어도 하나의 단말 전용 CORESET(즉, CORESET X/CORESET 452)과 적어도 하나의 조합 CORESET(CORESET Y/CORESET 456)을 포함하고 TCI 상태 지시 파라미터의 값이 1로 설정된 경우, 프로세서는 복수의 TRP들(102a, 102b)의 각 TRP로부터 PDCCH를 수신하기 위해 복수의 CORESET들 (452, 456)(즉, CORESET X 및 CORESET Y)의 각 CORESET과 연관된 지시된 TCI 상태를 적용하도록 설정된다. 또한, 릴리스 17 통합 TCI 프레임워크를 기반으로 하는 TCI 상태들을 가지는 M>1 및/또는 N>1의 경우, 각각의 CORESET(즉, CORESET X 및 CORESET Y)은 다음을 가진다: CSS 유형 0/0A/1/2의 하나의 탐색 공간 및 하 나의 CSS 유형 3 또는 USS 유형, 이때 이러한 CORESET 유형들에 대하여 TCI 상태 지시 파라미터(Tp)가 1로 설정 되어 단말 전용 PDCCH를 수신하고 서로 다른 CORESETpoolindex를 가진다. 예를 들어, CORESET X는 CORESETPoolIndex = 0을 가지고 CORESET Y는 CORESETPoolIndex = 1을 가진다. 일반적으로, 모든 CORESET들 (452, 456)은 각각 454b 및 458b로 표시된 CSS 유형 0/0A/1/2의 탐색 공간 하나 및 각각 454a 및 458a로 표시 된 CSS 유형 3 또는 USS 유형의 탐색 공간 하나를 가지고, 이러한 CORESET 유형에 대하여 TCI 상태 지시 파라미 터(Tp)가 1로 설정되고, 하나의 CC/BWP가 CORESETpoolindex 0 또는 1을 가지도록 설정된다. 따라서, 서로 다른 /구별되는 CORESETpoolindex를 가지는 조합 CORESET 유형의 CORESET들(즉, CORESET X 및 CORESET Y)과 연관된 TCI 상태들이다. 예를 들어, CORESET X는 TCI 상태 X와 연관되고 CORESET Y는 TCI 상태 Y와 연관된다. 이 예시적 시나리오에서, CORESET들 X 및 Y는 MDCI에 사용되는데, 여기서 두 CORESET(즉, CORESET X 및 CORESET Y)은 모두 조합 CORESET들이다. 즉, CSS 유형 0/0A/1/2를 가지는 CORESET X/Y의 적어도 하나의 탐색 공간 및 CSS 유형 3 또는 USS를 가지는 CORESET X/Y의 적어도 하나의 탐색 공간이다. 이러한 유형의 CORESET들 에 대하여 TCI 상태 지시 파라미터(Tp)가 1로 설정되면, CORESETpoolindex가 0으로 설정된 CORESET X는 TCI 상 태 X와 연관되고, CORESETpoolindex가 1로 설정된 단말 전용 PDCCH를 위해 사용되는 CORESET Y는 TCI 상태 Y를 갖게 된다. 도 4c는 본 개시의 실시예에 따른, 대응하는 복수의 TRP들로부터 복수의 PDCCH의 수신을 활성화 하는 예시적 시 나리오를 도시한다.도 2와 함께 도 4c를 참조하면, 복수의 TRP들(102a, 102b)로부터 복수의 PDCCH 수신을 활성화 하는 예시적 시나 리오가 본 개시의 또 다른 실시예에 따라 설명된다. 이 예시적 시나리오에서, 두 개의 CORESET들(472, 476)(즉, CORESET X 및 CORESET Y)은 단말 전용 CORESET 및 조합 CORESET이다. 다시 말해, CORESET X는 단말 전용 탐색 공간만을 가지고 CORESET Y는 단말 전용 및 비-단말 전용 탐색 공간을 모두 가진다. 보다 구체적으로, CORESET X는 474a로 표시된 오직 하나의 CSS 유형 3 또는 USS 및 474b로 표시된 적어도 하나의 CSS 유형 0/0A/1/2를 가진다. CORESET Y는 각각 478b 및 478a로 표시된 적어도 하나의 CSS 유형 0/0A/1/2 및 하나 의 CSS 유형 3 또는 USS를 가진다. 이 예시적 시나리오에서 TCI 상태 지시 파라미터가 1로 설정된 경우, CORESET들 X 및 Y는 Release17 통합 TCI 프레임워크를 기반으로 서로 다른 CORESETpoolindex 및 구별되는 TCI 상태들을 가진다. 일반적으로, CSS 유 형 3 또는 USS만을 가지는 단말 전용 CORESET 유형의 CORESET X 및 CSS 유형 0/0A/1/2 의 하나의 탐색 공간과 하나의 CSS 유형 3 또는 USS를 가지는 다른 CORESET(즉, CORESET Y)는 TCI 상태 지시 파라미터가 1로 설정되고 서로 다른 지시된 TCI 상태를 가진다. 실시예에서, 복수의 CORESET들의 CORESET 유형이 TCI 상태 지시 파라미터의 값이 1로 설정된 조합 CORESET으로 결정되는 경우, 프로세서는 복수의 TRP들(102a, 102b)의 각 TRP로부터 PDCCH를 수신하기 위해 복수의 CORESET들(즉, CORESET X 및 CORESET Y)의 각 CORESET과 연관된 지시된 TCI 상태를 적용하도록 설정된다. 일 예에서, TCI 상태 지시 파라미터(Tp)가 1로 설정되는 경우, CORESETpoolindex = 0과 연관된 CORESET X는 TCI 상태 X를 가지고, CORESETpoolindex = 1과 연관된 다른 CORESET Y는 TCI 상태 Y를 가진다. 도 5는 본 개시의 실시예에 따른, 복수의 TRP들로부터 복수의 PDCCH의 수신을 활성화 하는 방법을 도시한 흐름 도이다. 흐름도에 도시된 방법은 예를 들어 단말에 의해 실행될 수 있다. 단말의 일부 예들로는 5G 신규 무선 액세스 네트워크(New Radio Access Network)를 통해 5G 코어에 연결되고 인터넷과 같은 데이터 네트워크 (DN: Data Network)에 연결되는 5G 스마트폰 또는 5G 셀룰러 장치가 포함되지만 이에 한정되지 않는다. 흐름도 의 동작들 및 흐름도에서의 동작 조합들은 예를 들어 하드웨어, 펌웨어, 프로세서, 회로 및/또는 하나 이상의 컴퓨터 프로그램 명령어들을 포함하는 소프트웨어의 실행과 연관된 다른 장치에 의해 구현될 수 있다. 이 방법 의 동작들은 단말 내에 구현된 프로세서의 도움으로 여기에 설명된다. 방법의 동작들은 단 말이 아닌 시스템/장치(예를 들어, 단말로부터 원격으로 배치되고 단말과 통신적으로 연결된 시 스템)의 하나 이상의 프로세서들을 사용하여 설명 및/또는 실행될 수 있다. 방법은 동작 502에서 시작된다. 도 5를 참조하면, 방법의 동작 502에서, 무선 통신 시스템 내의 단말(UE: User Equipment), 예를 들 어 도 2, 3, 및 4a 내지 4c를 참조하여 도시되고 설명된 단말에 의해, 적어도 하나의 무선 자원 제어(RRC: Radio Resource Control) 설정 메시지가 무선 통신 시스템의 셀 내의 복수의 TRP들(102a 및 102b) 중 적어도 하나의 TRP와 관련하여 수신된다. 일 실시예에서, 적어도 하나의 RRC 설정 메시지는 적어도 하나의 TRP와 연관된 하나 이상의 해당 CORESET들에 대한 하나 이상의 CORESETpoolindex를 포함한다. 예를 들어, RRC 설정 메시지 R12는 TRP들(102a, 102b)과 연관된 CORESETPoolIndex를 포함한다. 따라서, TRP들(102a, 102b) 모 두로부터 PDCCH를 스케줄링하기 위해 RRC 설정 메시지는 단말로의 전송을 위해 마스터 노드에 의해 TRP(102a 또는 102b)로 전송될 수 있다. 다른 실시예에서, 두 개의 RRC 설정 메시지들 R1 및 R2는 TRP들(102a, 102b)로부터 PDCCH를 수신하도록 단말을 설정하기 위해 마스터 노드로부터 TRP들(102a, 102b)로 각각 전송될 수 있다. 따라서, RRC 설정 메시지 R1은 TRP(102a)와 연관된 CORESETPoolIndex를 포함하고 RRC 설정 메 시지 R2는 TRP(102b)와 연관된 CORESETPoolIndex를 포함한다. 적어도 하나의 RRC 설정 메시지는 도 3을 참조하 여 설명한 바와 같이 하나 이상의 CORESET들 및 그 CORESET들의 각 CORESET과 연관된 복수의 탐색 공간들을 설 정하기 위해 사용된다. 각각의 RRC 설정 메시지는 도 3을 참조하여 설명된 바와 같이 대응하는 CORESET 및 그 CORESET과 연관된 복수의 탐색 공간들을 설정하기 위해 사용된다. 방법의 동작 504에서, 단말은 적어도 하나의 RRC 설정 메시지를 기반으로 복수의 TRP들(102a 및 102b)의 각 TRP로부터 복수의 PDCCH들의 각 PDCCH를 수신하는 것이 가능하다. 복수의 TRP들(102a, 102b)로부터 복수의 PDCCH 수신이 가능하도록 하는 것은 도 4a 내지 4c를 참조하여 도시되고 설명된 다양한 시나리오들을 참 조하여 설명되었으며 간결성을 위해 여기에서는 설명하지 않는다.방법의 동작들의 순서는 반드시 제시된 것과 동일한 순서로 실행될 필요는 없다. 또한, 하나 이상의 동작 들이 그룹화되어 단일 단계의 형태로 수행될 수도 있고, 하나의 동작이 병렬적으로 또는 순차적으로 수행되는 여러 개의 하위 단계들을 가질 수 있다. 도 6은 본 개시의 실시예에 따른, 복수의 TRP들(102a, 102b)로부터 복수의 PDCCH의 수신을 활성화 하는 무선 통 신 시스템 내의 단말의 블록도를 도시한다. 단말은 중앙 처리 장치(“CPU” 또는 “프로세서”)를 포함할 수 있다. 프로세서는 적어도 하나 의 데이터 프로세서를 포함할 수 있다. 프로세서는 통합 시스템(버스) 컨트롤러, 메모리 관리 제어 장치, 부동 소수점 장치(floating point unit), 그래픽 처리 장치, 디지털 신호 처리 장치 등과 같은 특수 처리 장치 를 포함할 수 있다. 단말은 단말(도 2에 도시됨)과 유사할 수 있다. 프로세서는 입출력(I/O) 인터페이스를 통해 하나 이상의 입출력 장치(도시되지 않음)와 통신하도록 배치될 수 있다. 입출력 인터페이스는 오디오, 아날로그, 디지털, 모노, RCA, 스테레오, IEEE(institute of electrical and electronics engineers)-1394, 직렬 버스, USB(universal serial bus), 적외선, PS/2, BNC, 동축, 컴포넌트, 컴포지트, DVI(digital visual interface), HDMI(high-definition multimedia interface), RF(Radio Frequency) 안테나, S-비디오, VGA(video graphics array), IEEE 802.n/b/g/n/x, Bluetooth, 셀룰러(예: CDMA(code-division multiple access), HSPA+(high-speed packet access), GSM(global system for mobile communications), LTE(long-term evolution), WiMax 등)과 같은(이에 한정되지 않음) 통신 프로토콜들/방법들을 사용할 수 있다. 입출력 인터페이스를 사용하여 단말은 하나 이상의 입출력 장치들과 통신할 수 있다. 예를 들어, 입 력 장치는 안테나, 키보드, 마우스, 조이스틱, (적외선) 리모컨, 카메라, 카드 리더기, 팩스기, 동글, 생 체인식 판독기, 마이크, 터치 스크린, 터치패드, 트랙볼, 스타일러스, 스캐너, 저장 장치, 트랜시버, 비디오 장 치/소스 등일 수 있다. 출력 장치는 프린터, 팩스기, 비디오 디스플레이(예: 음극선관(CRT), 액정 디스플 레이(LCD), 발광 다이오드(LED), 플라스마, 플라스마 디스플레이 패널(PDP), 유기 발광 다이오드 디스플레이 (OLED) 등), 오디오 스피커 등일 수 있다. 일부 실시예들에서, 단말은 통신 네트워크를 통해 원격 장치들에 연결된다. 원격 장치들은 예를 들어 5G 네트워크 서비스들과 같이 단말에 서비스들을 제공하는 복수의 TRP들(102a, 102b)일 수 있다. 프로세서는 네트워크 인터페이스를 통해 통신 네트워크와 통신하도록 배치될 수 있다. 네 트워크 인터페이스는 통신 네트워크와 통신할 수 있다. 네트워크 인터페이스는 직접 연결, 이더 넷(예: twisted pair 10/100/1000 Base T), 전송 제어 프로토콜/인터넷 프로토콜(TCP/IP), 토큰 링, IEEE 802.11a/b/g/n/x 등을 포함하는(이에 한정되지 않음) 연결 프로토콜들을 사용할 수 있다. 통신 네트워크는 직접 상호 연결, 로컬 영역 네트워크(LAN), 광역 네트워크(WAN), 무선 네트워크(예: 무선 애플리케이션 프로토 콜 사용), 인터넷 등을 포함할 수 있다(이에 한정되지 않음). 네트워크 인터페이스 및 통신 네트워크(60 9)를 사용하여 단말은 원격 장치들과 통신할 수 있다. 네트워크 인터페이스는 직접 연결, 이더 넷(예: twisted pair 10/100/1000 Base T), 전송 제어 프로토콜/인터넷 프로토콜(TCP/IP), 토큰 링, IEEE 802.11a/b/g/n/x 등을 포함하는(이에 한정되지 않음) 연결 프로토콜들을 사용할 수 있다. 통신 네트워크는 직접 상호 연결, 전자 상거래 네트워크, 피어 투 피어(P2P) 네트워크, 로컬 영역 네트워 크(LAN), 광역 네트워크(WAN), 무선 네트워크(예: 무선 애플리케이션 프로토콜 사용), 인터넷, Wi-Fi, 3GPP 등 을 포함한다(이에 한정되지 않음). 제1 네트워크와 제2 네트워크는 전용 네트워크 또는 공유 네트워크일 수 있 으며, 이는 다양한 프로토콜들(예: HTTP(Hypertext Transfer Protocol), TCP/IP(Transmission Control Protocol/Internet Protocol), WAP(Wireless Application Protocol) 등)을 사용하여 서로 통신하는 서로 다른 유형의 네트워크들의 연합을 나타낸다. 또한, 제1 네트워크와 제2 네트워크는 라우터, 브리지, 서버, 컴퓨팅 장 치, 저장 장치 등을 포함한 다양한 네트워크 장치들을 포함할 수 있다. 일부 실시예들에서, 프로세서는 저장 인터페이스를 통해 메모리(예: 도 6에 도시되지 않은 RAM, ROM 등)와 통신하도록 배치될 수 있다. 저장 인터페이스는 SATA(Serial Advanced Technology Attachment), IDE(Integrated Drive Electronics), IEEE-1394, USB(Universal Serial Bus), 파이버 채널, SCSI(Small Computer Systems Interface) 등과 같은 연결 프로토콜들을 사용하여 메모리 드라이브, 이동식 디 스크 드라이브 등을 포함하는(이에 한정되지 않음) 메모리에 연결될 수 있다. 메모리 드라이브는 또한 드 럼, 자기 디스크 드라이브, 자기 광 드라이브, 광 드라이브, RAID(Redundant Array of Independent Discs), 솔리드 스테이트 메모리 장치, 솔리드 스테이트 드라이브 등을 포함할 수 있다. 메모리는 사용자 인터페이스, 운영 체제, 웹 서버 등을 포함하는(이에 한정되지 않음) 프 로그램 또는 데이터베이스 구성요소들의 집합을 저장할 수 있다. 일부 실시예들에서, 단말은 본 개시에서 설명된 바와 같이 데이터, 변수, 레코드 등과 같은 사용자/애플리케이션 데이터를 저장할 수 있다. 이러한 데이 터베이스는 Oracle 또는 Sybase 와 같은 내결함성, 관계형, 확장 가능, 보안 데이터베이스로 구현될 수 있다. 운영 체제은 단말의 자원 관리 및 운영을 용이하게 할 수 있다. 운영 체제의 예들은 APPLE MACINTOSH OS X, UNIX , UNIX 유사 시스템 배포판(예: BERKELEY SOFTWARE DISTRIBUTION™(BSD), FREEBSD™, NETBSD™, OPENBSD™ 등), LINUX DISTRIBUTIONS™ (예: RED HAT™, UBUNTU™, KUBUNTU™ 등), IBM™ OS/2, MICROSOFT™ WINDOWS™(XP™, VISTA™/7/8, 10 등), APPLE IOS™, GOOGLE ANDROID™, BLACKBERRY OS 등을 포함한다(이에 한정되지 않음). 일부 실시예들에서, 단말은 웹 브라우저에 저장된 프로그램 구성요소를 구현할 수 있다. 웹 브라우저는 하 이퍼텍스트 뷰잉 애플리케이션, 예를 들어 MICROSOFT INTERNET EXPLORER™, GOOGLE CHROME™, MOZILLA FIREFOX™, APPLE SAFARI™ 등일 수 있다. 보안 웹 브라우징은 보안 하이퍼텍스트 전송 프로토콜(HTTPS), 보안 소켓 계층(SSL), 전송 계층 보안(TLS) 등을 사용하여 제공될 수 있다. 웹 브라우저는 AJAX™, DHTML™, ADOBER FLASH™, JAVASCRIPT™, JAVA™, 애플리케이션 프로그래밍 인터페이스(API) 등과 같은 기능들을 활용할 수 있다. 일부 실시예들에서, 단말은 메일 서버에 저장된 프로그램 구성요소를 구현할 수 있다. 메일 서버는 Microsoft Exchange와 같은 인터넷 메일 서버 등일 수 있다. 메일 서버는 ASP™, ACTIVEX™, ANSI™ C++/C#, MICROSOFT , .NET™, CGI SCRIPTS™, JAVA™, JAVASCRIPT™, PERL™, PHP™, PYTHON™, WEBOBJECTS™ 등의 시 설들을 활용할 수 있다. 메일 서버는 인터넷 메시지 액세스 프로토콜(IMAP), 메시징 애플리케이션 프로그래밍 인터페이스(MAPI), MICROSOFT 익스체인지, 우편 프로토콜(POP), 단순 메일 전송 프로토콜(SMTP) 등과 같은 통 신 프로토콜들을 활용할 수 있다. 일부 실시예들에서, 단말은 메일 클라이언트 저장 프로그램 구성요소를 구현할 수 있다. 메일 클라이언트는 APPLE MAIL™, MICROSOFT ENTOURAGE™, MICROSOFT OUTLOOK™, MOZILLA THUNDERBIRD™ 등의 메일 보기 애플리케이션일 수 있다. 도 6을 참조하여 설명된 방법 또는 도 2, 3, 4a 내지 4c 및 5를 참조하여 설명된 단말의 하나 이상의 동작 들은 하나 이상의 컴퓨터 판독 가능 매체(예: 하나 이상의 광학 매체 디스크, 휘발성 메모리 구성요소(예: DRAM 또는 SRAM) 또는 비휘발성 메모리 또는 저장 구성요소(예: 하드 드라이브 또는 플래시 메모리 구성요소와 같은 솔리드 스테이트 비휘발성 메모리 구성요소)와 같은 비-일시적 컴퓨터 판독 가능 매체)에 저장되고 컴퓨터(예: 랩탑 컴퓨터, 넷북, 웹북, 태블릿 컴퓨팅 장치, 스마트 폰 또는 기타 모바일 컴퓨팅 장치와 같은 모든 적합한 컴퓨터)에서 실행되는 컴퓨터 실행 가능 명령어를 포함하는 소프트웨어를 사용하여 구현될 수 있다. 이러한 소 프트웨어는 예를 들어 단일 로컬 컴퓨터에서 실행될 수 있다. 도 7은 본 개시의 실시예에 따른 전자 장치를 도시한다. 도 7을 참조하면, 전자 장치는 프로세서, 송수신부 및 메모리를 포함할 수 있다. 그러나 도시된 구성요소들이 모두 필수적인 것은 아니다. 전자 장치는 도 7에 도시된 구성요소들보다 더 많거나 적은 구성요소들로 구현될 수 있다. 또한, 프로세서 및 송수신부 및 메모리는 다른 실시예에 따 라 단일 칩으로 구현될 수 있다. 전자 장치는 전술한 단말에 대응할 수 있다. 상기 구성요소들에 대하여 자세히 설명한다. 프로세서는 제안된 기능, 프로세스, 및/또는 방법을 제어하는 하나 이상의 프로세서들 또는 그 밖의 처리 장치들을 포함할 수 있다. 전자 장치의 동작은 프로세서에 의해 구현될 수 있다. 송수신부는 송신 신호를 상향 변환하고 증폭하기 위한 RF 송신기와 수신 신호의 주파수를 하향 변환하기 위한 RF 수신기를 포함할 수 있다. 그러나 다른 실시예에 따르면, 송수신부는 구성요소들에서 도시된 것보 다 더 많거나 적은 구성요소들에 의해 구현될 수 있다. 송수신부는 프로세서에 연결되어 신호를 송신 및/또는 수신할 수 있다. 신호는 제어 정보 및 데이터 를 포함할 수 있다. 또한, 송수신부는 무선 채널을 통해 신호를 수신하여 프로세서에 신호를 출력할 수 있다. 송수신부는 무선 채널을 통해 프로세서으로부터 출력된 신호를 송신할 수 있다. 메모리는 전자 장치에 의해 획득된 신호에 포함된 제어 정보 또는 데이터를 저장할 수 있다. 메모리 는 프로세서에 연결되고 제안된 기능, 프로세스, 및/또는 방법에 대한 적어도 하나의 명령어 또는 프 로토콜 또는 파라미터를 저장할 수 있다. 메모리는 ROM 및/또는 RAM 및/또는 하드 디스크 및/또는 CD-ROM 및/또는 DVD 및/또는 그 밖의 저장 장치들을 포함할 수 있다. 도 8은 본 개시의 실시예에 따른 기지국을 도시한다. 도 8을 참조하면, 기지국은 프로세서, 송수신부 및 메모리을 포함할 수 있다. 그러나 도시 된 구성요소들이 모두 필수적인 것은 아니다. 기지국은 도 8에 도시된 구성요소들보다 더 많거나 적은 구 성요소들로 구현될 수 있다. 또한, 프로세서와 송수신부 및 메모리는 다른 실시예에 따라 단일 칩으로 구현될 수 있다. 기지국은 전술한 기지국(gNB)에 대응할 수 있다. 상기 구성요소들에 대하여 자세히 설명한다. 프로세서는 제안된 기능, 프로세스, 및/또는 방법을 제어하는 하나 이상의 프로세서들 또는 그 밖의 처리 장치들을 포함할 수 있다. 기지국의 동작은 프로세서에 의해 구현될 수 있다. 송수신부는 송신 신호를 상향 변환하고 증폭하기 위한 RF 송신기와 수신 신호의 주파수를 하향 변환하기 위한 RF 수신기를 포함할 수 있다. 그러나 다른 실시예에 따르면, 송수신부는 구성요소들에서 도시된 것보 다 더 많거나 더 적은 구성요소들에 의해 구현될 수 있다. 송수신부는 프로세서에 연결되어 신호를 송신 및/또는 수신할 수 있다. 신호는 제어 정보 및 데이터 를 포함할 수 있다. 또한, 송수신부는 무선 채널을 통해 신호를 수신하여 프로세서에 신호를 출력할 수 있다. 송수신부은 무선 채널을 통해 프로세서으로부터 출력된 신호를 송신할 수 있다. 메모리는 기지국에 의해 획득된 신호에 포함된 제어 정보 또는 데이터를 저장할 수 있다. 메모리 는 프로세서에 연결되고 제안된 기능, 프로세스, 및/또는 방법에 대한 적어도 하나의 명령어 또는 프 로토콜 또는 파라미터를 저장할 수 있다. 메모리는 ROM 및/또는 RAM 및/또는 하드 디스크 및/또는 CD-ROM 및/또는 DVD 및/또는 그 밖의 저장 장치들을 포함할 수 있다. 더욱이, 하나 이상의 컴퓨터 판독 가능 저장 매체가 본 개시에 따른 실시예들을 구현하는 데 활용될 수 있다. 컴퓨터 판독 가능 저장 매체는 프로세서가 읽을 수 있는 정보 또는 데이터가 저장될 수 있는 모든 유형의 물리 적 메모리를 의미한다. 따라서, 컴퓨터 판독 가능 저장 매체는 프로세서(들)가 본 명세서에서 설명된 실시예들 에 따른 단계들을 수행하도록 하는 명령어들을 비롯하여 하나 이상의 프로세서가 실행하기 위한 명령어들을 저 장할 수 있다. 용어 “컴퓨터 판독 가능 매체”는 유형의 물품들(tangible items)을 포함하는 것이며 반송파 (carrier waves) 및 일시적 신호(transient signals)를 제외하는 것으로 이해되어야 된다. 즉 비-일시적(non- transitory)이다. 예로는 램(RAM: Random Access Memory), 롬(ROM: Read-Only Memory), 휘발성 메모리, 비휘발 성 메모리, 하드 드라이브, CD ROM, DVD, 플래시 드라이브, 디스크, 및 기타 주지의 물리적 저장 매체가 있다. 본 개시의 다양한 실시예들은 수많은 이점들을 제공한다. 본 개시의 실시예들은 통합 TCI 프레임워크를 사용하 여 복수의 TRP들로부터 복수의 PDCCH를 수신할 수 있도록 하는 방법 및 시스템을 제공한다. 일반적으로, 통합 TCI 프레임워크는 상향링크 및 하향링크에서 하나보다 많은 TCI 상태들로 확장되고 있으며 TCI 상태들의 수를 늘리는 사용 사례는 m-TRP 시나리오에 있다. 본 개시는 다중 TCI 상태에 대한 새로운 릴리스 17 통합 TCI 프레 임워크에 대한 CORESETpoolindex를 재사용하고 있다. 다시 말해, 각 TRP로부터의 RRC 설정 메시지에는 m-TRP 시 나리오를 지시하는 CORESETpoolindex 및 PDCCH 수신에 적용될 통합 TCI 프레임워크의 지시된 TCI 상태의 사용에 대하여 단말에 지시하기 위한 TCI 상태 지시 파라미터와 같은 시그널링 파라미터들이 포함된다. 이러한 RRC 설정 메시지들은 복수의 TRP들로부터 복수의 PDCCH의 수신을 위해 CORESET 특정 TCI 상태가 단말에 적 용되도록 함으로써 m-TRP 절차들을 Rel 17 통합 TCI 상태와 연결한다. 보다 구체적으로, TCI 상태 지시 파라미 터(Tp)는 지시된 릴리스 17 TCI 상태를 따르는 1비트 지시이다. 통상의 기술자라면 일반적으로 본 명세서에서 사용되는 용어들은 “개방형” 용어로 의도된다는 것을 이해할 것 이다(예: 용어 “포함하는”은 “포함하지만 이에 한정되지 않음”으로 해석해야 하고, 용어 “가지는”은 “적 어도 가지는”으로 해석해야 하고, 용어 “포함한다”는 “포함하지만 이에 한정되지 않음”으로 해석해야 함 등). 예를 들어, 이해를 돕기 위해, 상세한 설명에는 “적어도 하나” 및 “하나 이상”이라는 도입 문구를 사 용하는 설명이 포함될 수 있다. 그러나 이러한 문구의 사용에 의해 시작되는 설명이 해당 부분을 하나만 포함하 여 개시함을 의미하는 것으로 해석되어서는 안 된다. 심지어 도입 문구 “하나 이상” 또는 “적어도 하나”가단수형 문구과 함께 설명에 포함되어 있는 경우에도 마찬가지이다. 또한, 설명에서 특정 부분이 명시적으로 서 술되라도 통상의 기술자라면 그러한 서술이 적어도 서술된 횟수를 의미하는 것으로 해석되어야 함을 알 것이다 (예를 들어, 다른 수정어 없이 “두 개의 서술들”만 기재하더라도 이는 일반적으로 적어도 두 개의 서술들 또 는 두 개 이상의 서술들을 의미함). 본 개시는 다양한 실시예들을 참조하여 도시되고 설명되었지만, 통상의 기술자라면 첨부된 청구항 및 그 균등물 에 의해 정의된 본 개시의 기술적 사상 및 범위를 벗어나지 않고도 다양한 변경들이 이루어질 수 있음을 이해할 것이다."}
{"patent_id": "10-2024-7040055", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 개시의 특정 실시예들의 상기 및 그 밖의 양상들, 특징들, 및 이점들은 첨부 도면과 함께 다음의 설명으로부 터 더욱 명확해질 것이다. 도 1은 본 개시의 실시예에 따른, 5G 네트워크의 셀 내의 복수의 TRP들을 나타내는 무선 통신 시스템의 개략적 표현을 도시한다. 도 2는 본 개시의 실시예에 따른, 복수의 TRP들로부터 복수의 PDCCH의 수신을 활성화 하는 단말을 도시한다. 도 3은 본 개시의 실시예에 따른, 복수의 CORESET들을 설정하는 것을 도시한다. 도 4a는 본 개시의 실시예에 따른, 대응하는 복수의 TRP들로부터 복수의 PDCCH의 수신을 활성화 하는 예시적 시 나리오를 도시한다. 도 4b는 본 개시의 실시예에 따른, 대응하는 복수의 TRP들로부터 복수의 PDCCH의 수신을 활성화 하는 예시적 시 나리오를 도시한다. 도 4c는 본 개시의 실시예에 따른, 대응하는 복수의 TRP들로부터 복수의 PDCCH의 수신을 활성화 하는 예시적 시 나리오를 도시한다. 도 5는 본 개시의 실시예에 따른, 복수의 TRP들로부터 복수의 PDCCH의 수신을 활성화 하는 방법을 도시한 흐름 도이다. 도 6은 본 개시의 실시예에 따른, 복수의 TRP들로부터 복수의 PDCCH의 수신을 활성화 하는 단말의 블록도를 도시한다. 도 7은 본 개시의 실시예에 따른 전자 장치를 도시한다. 도 8은 본 개시의 실시예에 따른 기지국을 도시한다. 도면을 통틀어 동일한 참조 번호들은 동일하거나 유사한 구성요소들, 특징들, 및 구조들을 나타내기 위해 사용 된다."}
