{"patent_id": "10-2022-0033103", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0135752", "출원번호": "10-2022-0033103", "발명의 명칭": "체수분 변화율 예측 장치 및 시스템, 체수분 변화율 예측 방법, 컴퓨터 판독 가능한 기록 매", "출원인": "이은호", "발명자": "이은호"}}
{"patent_id": "10-2022-0033103", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인체에 부착된 하나 이상의 전극 사이의 거리 데이터를 수신하도록 구성된 제1 정보 수집부;상기 인체의 임피던스 데이터를 소정 시간 간격으로 수신하도록 구성된 제2 정보 수집부;상기 제2 정보 수집부가 수신한 상기 임피던스 데이터 중 체수분 관련 주파수 영역의 체수분 관련 임피던스 데이터를 추출하도록 구성된 임피던스 추출부; 및상기 체수분 관련 임피던스 데이터 및 상기 거리 데이터를 이용하여 상기 인체의 체수분 변화율을 산출하도록구성된 체수분 변화율 예측부를 포함하는, 체수분 변화율 예측 장치."}
{"patent_id": "10-2022-0033103", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 임피던스 추출부는, 8kHz 내지 64kHz의 상기 체수분 관련 주파수 영역의 하나 이상의 주파수에 대응하는상기 체수분 관련 임피던스 데이터를 추출하고, 상기 체수분 관련 임피던스 데이터는 저항 값 및 리액턴스 값중 적어도 하나를 포함하는, 체수분 변화율 예측 장치."}
{"patent_id": "10-2022-0033103", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 체수분 변화율 예측부에 의하여 산출된 상기 체수분 변화율에 기초하여 하나 이상의 체수분 단계를 결정하도록 구성된 프로세서를 더 포함하고,상기 하나 이상의 체수분 단계는 상기 체수분 변화율이 0인 상태에 대응되는 기준 단계, 양수인 상태에서 증가하는 상기 체수분 변화율에 대응되는 하나 이상의 플러스 단계, 및 음수인 상태에서 감소하는 상기 체수분 변화율에 대응되는 하나 이상의 마이너스 단계를 포함하는, 체수분 변화율 예측 장치."}
{"patent_id": "10-2022-0033103", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 프로세서는, 체수분 변화율의 변동에 대한 민감도를 기준으로 하나 이상의 사용자 등급을 구분하고, 상기사용자 등급에 기초하여 상기 하나 이상의 체수분 단계의 인접 단계 차이값을 조절하는, 체수분 변화율 예측 장치."}
{"patent_id": "10-2022-0033103", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서,상기 프로세서는, 상기 하나 이상의 체수분 단계의 절대값을 이용하여 사용자의 위험도를 산출하고,상기 위험도는 상기 체수분 단계의 절대값이 증가할수록 증가하는, 체수분 변화율 예측 장치."}
{"patent_id": "10-2022-0033103", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 프로세서는, 체수분 변화 속도를 더 이용하여 상기 위험도를 산출하고,상기 체수분 변화율이 상기 기준 단계를 향하여 변동될 경우, 상기 위험도는 감소하는, 체수분 변화율 예측 장치."}
{"patent_id": "10-2022-0033103", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2023-0135752-3-제1항에 따른 상기 체수분 변화율 예측 장치; 및상기 하나 이상의 전극, 및 상기 임피던스 데이터를 측정하도록 구성된 임피던스 측정부를 포함하는 센서부를포함하는, 체수분 변화율 예측 시스템."}
{"patent_id": "10-2022-0033103", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "인체에 부착된 하나 이상의 전극 사이의 거리 데이터를 수신하는 단계;상기 인체의 임피던스 데이터를 소정 시간 간격으로 수신하는 단계;상기 임피던스 데이터 중 체수분 관련 주파수 영역의 체수분 관련 임피던스 데이터를 추출하는 단계; 및상기 체수분 관련 임피던스 데이터 및 상기 거리 데이터를 이용하여 상기 인체의 체수분 변화율을 산출하는 단계를 포함하는, 체수분 변화율 예측 방법."}
{"patent_id": "10-2022-0033103", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 따른 상기 체수분 변화율 예측 방법을 포함하는 동작을 프로세서가 수행하기 위한 명령어를 포함하는,컴퓨터 프로그램."}
{"patent_id": "10-2022-0033103", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 따른 상기 컴퓨터 프로그램을 저장하고 있는, 컴퓨터 판독 가능 기록매체."}
{"patent_id": "10-2022-0033103", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 체수분 변화율 예측 장치는 인체에 부착된 하나 이상의 전극 사이의 거리 데이터를 수신하도록 구성된 제1 정보 수집부, 인체의 임피던스 데이터를 소정 시간 간격으로 수신하도록 구성된 제2 정보 수집부, 제2 정보 수집부가 수신한 임피던스 데이터 중 체수분 관련 주파수 영역의 체수분 관련 임피던스 데이터 를 추출하도록 구성된 임피던스 추출부, 및 체수분 관련 임피던스 데이터 및 거리 데이터를 이용하여 인체의 체 수분 변화율을 예측하도록 구성된 체수분 변화율 예측부를 포함할 수 있다. 이에, 국소적인 인체 부위에 전극은 부착하는 것만으로 임피던스 분석에 따라 체수분 변화율을 예측할 수 있어 보다 선제적으로 환자의 위험에 대응 할 수 있다."}
{"patent_id": "10-2022-0033103", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 체수분 변화율 예측 장치 및 시스템, 체수분 변화율 예측 방법, 컴퓨터 판독 가능한 기록 매체 및 컴 퓨터 프로그램에 대한 것으로서, 비침습적인 방법인 생체전기 임피던스 분석법(bio-electrical impedance analysis)과 인공지능 분석 기술을 이용하여 와이어리스(wireless) 형태의 전극 패치를 이용하여 사용자(환자) 의 상대적 체수분의 변화의 정도를 연속적으로 측정하기 위한 체수분 변화율 예측 장치 및 시스템, 체수분 변화 율 예측 방법, 컴퓨터 판독 가능한 기록 매체 및 컴퓨터 프로그램에 관한 것이다."}
{"patent_id": "10-2022-0033103", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로, 저혈량증(hypovolemia) 및 체수분량 감소(fluid depletion)는 관류부족 (hypoperfusion)을 초래하 여 여러 중요한 장기의 저산소증 및 장기 손상을 발생시 킬 수 있다. 또한, 과혈량증(hypervolemia) 및 체수분 량 과다(fluid overload)는 혈관 밖 간질액과 세포 내액 증가로 부종을 유발하여 조직 관류를 저해하고 저산소 증 및 장기 손상을 초래할 수 있다. 이에, 수술을 시행 받는 환자, 외상 환자, 중증환자의 경우 출혈, 폐혈증, 급성신장손상 등으로 인해 체수분량 과다에 빠지기 쉽고, 투석환자의 경우 체수분량의 급격한 감소로 인한 저혈 압 발생이 많게는 70%정도의 환자에서 발생한다고 보고되고 있는 실정이다. 따라서, 혈역학적 안정성 유지 및 말초 조직으로의 관류를 적절하게 유지하기 위해 정상 혈량(normovolemia)으로 유지하는 것은 환자, 특히 중증 환자의 예후를 향상시키는데 있어서 매우 중요할 수 있다. 최근, 임상에서 사용되는 과혈량증을 진단하기 위해 사용되는 방법은 수액 투여 후 체중의 변화량, 흉부 X- ray같이 과혈량증에 인해 임상적인 변화가 일어난 후에 그것을 확인하는 수준에 그치고 있으며, 체수분의 변화 율은 조기 진단에 어려움이 있다. 또한, 말기 신장질환 환자에서 투석 중 적절한 체수분량 상태를 유지하기 위 한 도구로 혈압 측정 및 투석 후 체중 측정을 시행하고 있으나, 이는 부정확하고 조기 진단이 어려움이 있을 수 있다. 또한, 기존의 연속적으로 혈관 내 용적 및 체수분량을 측정하는 방법들은 중심정맥압, 동맥압 파형, 심초음파를 이용한 방법들이 있으나 침습적이거나 저혈량증만을 측정할 수 있고, 체수분량 과다를 측정하지 못할 수 있었다. 비침습적으로 생체전기 임피던스 분석법을 이용한 진단 제품이 있으나 체수분량 과다를 측정하지는 못 하며, 전신에서 측정이 이루어지므로 주변 조건에 영향을 크게 받고 환자의 상태에 따라 적용의 제한이 있을 수있어 문제되고 있다. 이에, 위와 같은 다양한 기존의 문제점을 해결하면서 비침습적인 임피던스 분석법 및 인공지능 기술을 이용하여 연속적으로 체수분 변화율을 측정할 수 있는 방법에 대한 필요성이 대두되고 있다."}
{"patent_id": "10-2022-0033103", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 과제는, 인체의 팔, 다리 말단 등의 국소적인 부분에 전극을 부착하여 부분적인 임 피던스를 측정하고, 전극의 거리 데이터 및 임피던스 데이터를 이용하여 체내 수분량의 변화를 유추하는 것에 그 목적이 있다. 본 발명의 해결하고자 하는 다른 과제는, 체수분 변화율에 기초한 복수의 단계, 및 사용자의 체수분 변화 민감 도에 기초한 복수의 사용자 위험 단계를 결정하여, 체수분의 변화에 체계적으로 대응할 수 있는 것에 그 목적이 있다. 본 발명의 과제들은 이상에서 언급한 과제들로 제한되지 않으며, 언급되지 않은 또 다른 과제들은 아래의 기재 로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0033103", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "전술한 바와 같은 과제를 해결하기 위하여 본 발명의 일 실시예에 따른 체수분 변화율 예측 장치는 인체에 부착 된 하나 이상의 전극 사이의 거리 데이터를 수신하도록 구성된 제1 정보 수집부, 인체의 임피던스 데이터를 소 정 시간 간격으로 수신하도록 구성된 제2 정보 수집부, 제2 정보 수집부가 수신한 임피던스 데이터 중 체수분 관련 주파수 영역의 체수분 관련 임피던스 데이터를 추출하도록 구성된 임피던스 추출부, 및 체수분 관련 임피 던스 데이터 및 거리 데이터를 이용하여 인체의 체수분 변화율을 산출하도록 구성된 체수분 변화율 예측부를 포 함할 수 있다. 이에, 국소적인 인체 부위에 전극은 부착하는 것만으로 임피던스 분석에 따라 체수분 변화율을 예측할 수 있어 보다 선제적으로 환자의 위험에 대응할 수 있다. 기타 실시예의 구체적인 사항들은 상세한 설명 및 도면들에 포함되어 있다."}
{"patent_id": "10-2022-0033103", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기와 같은 본 발명에 따르면, 아래와 같은 다양한 효과들을 가진다. 본 발명은 팔 또는 다리 말단의 국소적인 부분에 전극을 부착하여 부분적인 임피던스를 측정하여 전체 체수분 변화율을 예측할 수 있으며, 이에, 간섭 현상 및 적용 제한의 단점을 효과적으로 보완할 수 있다. 또한, 본 발명은 급속한 체수분량의 변화가 일어날 수 있는 중환자, 큰 수술을 받는 환자, 외상환자, 투석환자 등의 조기 진단 및 치료로 환자의 예후를 향상시킬 수 있고, 궁극적으로 의료비 절감 효과를 낼 수 있다. 또한, 본 발명은 체수분 변화율의 모니터링이 중요한 심부전 등의 심장 질환자의 생활 모니터링 분야 및 피트니 스 분야에서 보조 도구로 활용 가능할 수 있으며, 체수분 과다 모니터링 시스템으로 활용될 수 있는 효과가 있 다. 또한, 본 발명은 체수분과 관련된 임피던스 정보를 이용하여 체수분 변화율을 예측함으로써, 다른 임피던스 정 보에 의해 노이즈가 발생되는 것을 방지할 수 있는 효과가 있다. 또한, 본 발명은 체수분에 관련된 임피던스 정보를 이용하여 체수분 변화율을 예측함으로써, 체수분 변화율의 예측을 위한 계산량 및 소요되는 시간을 현저하게 줄일 수 있는 효과가 있다. 또한, 본 발명은 체수분 상태가 과한 상태를 효과적으로 감지할 수 있는 효과 가 있다. 또한, 본 발명은 체수분 변화율을 모니터링함으로써, 수술 중 체수분 변화율에 따라 환자의 상태가 악화되는 것 을 방지할 수 있는 효과가 있다. 본 발명에 따른 효과는 이상에서 예시된 내용에 의해 제한되지 않으며, 더욱 다양한 효과들이 본 명세서 내에 포함되어 있다."}
{"patent_id": "10-2022-0033103", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 본 발명의 다양한 실시 예를 첨부된 도면을 참조하여 상세히 설명한다. 본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현"}
{"patent_id": "10-2022-0033103", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "될 것이며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하며, 본 발명이 속하는 기술분야에서 통상의 지 식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정 의될 뿐이다. 본 발명의 실시예를 설명하기 위한 도면에 개시된 형상, 크기, 비율, 각도, 개수 등은 예시적인 것이므로 본 발 명이 도시된 사항에 한정되는 것은 아니다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성 요소를 지칭한다. 또한, 본 발명을 설명함에 있어서, 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐 릴 수 있다고 판단되는 경우 그 상세한 설명은 생략한다. 본 명세서 상에서 언급된 '포함한다', '갖는다', '이 루어진다' 등이 사용되는 경우 '~만'이 사용되지 않는 이상 다른 부분이 추가될 수 있다. 구성 요소를 단수로 표현한 경우에 특별히 명시적인 기재 사항이 없는 한 복수를 포함하는 경우를 포함한다. 구성 요소를 해석함에 있어서, 별도의 명시적 기재가 없더라도 오차 범위를 포함하는 것으로 해석한다. 위치 관계에 대한 설명일 경우, 예를 들어, '~상에', '~상부에', '~하부에', '~옆에' 등으로 두 부분의 위치 관 계가 설명되는 경우, '바로' 또는 '직접'이 사용되지 않는 이상 두 부분 사이에 하나 이상의 다른 부분이 위치 할 수도 있다. 비록 제1, 제2 등이 다양한 구성요소들을 서술하기 위해서 사용되나, 이들 구성요소들은 이들 용어에 의해 제한 되지 않는다. 이들 용어들은 단지 하나의 구성요소를 다른 구성요소와 구별하기 위하여 사용하는 것이다. 따라 서, 이하에서 언급되는 제1 구성요소는 본 발명의 기술적 사상 내에서 제2 구성요소일 수도 있다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성 요소를 지칭한다. 도면에서 나타난 각 구성의 크기 및 두께는 설명의 편의를 위해 도시된 것이며, 본 발명이 도시된 구성의 크기 및 두께에 반드시 한정되는 것은 아니다. 본 발명의 여러 실시예들의 각각 특징들이 부분적으로 또는 전체적으로 서로 결합 또는 조합 가능하며, 당업자 가 충분히 이해할 수 있듯이 기술적으로 다양한 연동 및 구동이 가능하며, 각 실시예들이 서로에 대하여 독립적 으로 실시 가능할 수도 있고 연관 관계로 함께 실시 가능할 수도 있다.도 1은 본 발명의 일 실시예에 따른 체수분 변화율 예측 시스템을 설명하기 위한 블록도이다. 도 2는 본 발명의 일 실시예에 따른 체수분 변화율 예측 시스템의 적용예를 설명하기 위한 도면이다. 도 3 및 도 4는 본 발명의 일 실시예에 따른 체수분 변화율 예측 시스템의 센서부를 설명하기 위한 도면이다. 도 5는 본 발명의 일 실시예 에 따른 체수분 변화율 예측 장치를 설명하기 위한 블록도이다. 도 6은 본 발명의 일 실시예에 따른 체수분 변 화율 예측 방법을 설명하기 위한 순서도이다. 도 7은 본 발명의 일 실시예에 따른 체수분 변화율 예측 장치의 모니터링부를 나타낸 도면이다. 도 1 내지 도 7을 참조하면, 본 발명의 일 실시예에 따른 체수분 변화율 예측 시스템은 인체에 부착 된 전극(120, 130) 사이의 거리 데이터 및 임피던스 데이터를 이용하여 인체의 체수분 변화율을 예측할 수 있는 시스템이다. 이때 체수분 변화율은 기준 시점(예를 들면, 체수분 변화율의 예측을 시작하는 시점, 또는 사용자 에 의하여 지정된 특정 시점)에서의 체수분량을 기준으로 시간이 흐름에 따라 변화된 체수분량의 비율(또는 체 수분량의 상대적 변화량)을 의미할 수 있다. 즉, 기준 시점에서의 체수분 변화율은 0%일 수 있고, 시간이 흐름 에 따라 체수분 변화율은 증가하거나 감소할 수 있다. 기준 시점 이후의 특정 시점에서 체수분량이 기준 시점의 체수분량보다 10% 증가한 경우, 체수분 변화율은 +10%일 수 있다. 또한, 기준 시점 이후의 특정 시점에서 체수 분량이 기준 시점의 체수분량보다 20% 감소할 경우, 체수분 변화율은 -20%일 수 있다. 이처럼, 체수분 변화율 예측 시스템은 기준 시점의 체수분량을 기준으로 변화된 체수분량의 비율인 체수분 변화율을 예측하는 시 스템일 수 있다. 이때, 체수분 변화율 예측 시스템은 도 2에 도시된 것과 같이 인체의 손목에 착용하는 전자 시계와 같은 형태를 가질 수도 있으나, 이에 제한되지는 않는다. 체수분 변화율 예측 시스템은 센서부 및 체수분 변화율 예측 장치를 포함한다. 체수분 변화율 예측 시스템의 센서부는 측정 대상 예컨대, 환자의 생체 임피던스 데이터를 측정하는 구성요소이다. 센서부의 복수의 전극(120, 130)은 환자의 인체에 부착되어 인체 내에 교류 전류를 흐르게 하고, 센서부의 임피던스 측정부는 인체로부터 출력된 전압 신호를 이용하여 임피던스를 측정할 수 있다. 도 3에 도시된 바와 같이, 센서부는 환자의 인체 예컨대, 환자의 팔에 부착될 수 있다. 센서부는 사각 플레이트 형상의 베이스 부재가 마련될 수 있다. 베이스 부재의 크기 및 넓이는 도 3에 도시된 것에 제한되지 않으며, 필요에 따라 더 작은 크기 및 넓이로 변화될 수 있다. 베이스 부재의 상부에는 센서부의 복수의 전극(120, 130)들이 이격되어 배치될 수 있다. 복수의 전극 (120, 130)들은 제1 전극부 및 제2 전극부을 포함할 수 있다. 센서부 의 제1 전극부는 제 1 전극과 제2 전극이 쌍을 이루도록 구성될 수 있으며, 제2 전극부는 제3 전극과 제4 전극 이 쌍을 이루도록 구성될 수 있다. 제1 전극부와 제2 전극부는 이격 배치될 수 있다. 이때, 복 수의 전극(120, 130)의 개수는 이에 한정되지는 않는다. 도 4를 참조하면, 제1 전극 내지 제4 전극은 베이스 부재 상에서 일렬로 배치될 수 있다. 이때, 제1 전극 및 제2 전극 사이의 이격 거리인 제1 거리(D1) 및 제3 전극 및 제4 전극 사이의 이격 거리인 제3 거리(D3)는 4.5cm 내지 5.5cm일 수 있으나 이에 제한되지는 않는다. 또한, 제1 전극부의 전극들 중 제2 전극부와 가장 인접한 전극인 제2 전극과 제2 전극부의 전극들 중 제1 전극부 와 가장 인접한 전극인 제4 전극 사이의 이격 거리인 제1 거리(D1)는 임계 범위, 예를 들어 15cm 내 지 25cm일 수 있고, 바람직하게는 20cm일 수 있으나, 이에 제한되지는 않는다. 이때, 제1 거리(D1)의 임계 범위 는 변경될 수 있다. 제2 전극의 중심과 제4 전극의 중심 사이의 제1 거리(D1)는 증가할수록 체수분 변화율 예측 정확도가 향상될 수 있다. 하지만, 제2 전극의 중심과 제4 전극의 중심 사이의 제1 거리(D1)가 25cm를 초과한 경우, 예측 정확도가 오히려 저하될 수 있고, 따라서 제2 전극의 중심과 제4 전극의 중심 사이의 제1 거리(D1)는 15cm 내지 25cm 사이에서 결정되는 것이 효과적일 수 있다. 제2 전극과 제4 전극 사이의 제1 거리(D1)은 미리 설정된 임계 범위 내에서 사용자에 따라 임의로 조 절될 수 있다. 예컨대, 사용자가 성인 남자인 경우, 제1 거리(D1)는 미리 설정된 임계 범위 중 상대적으로 높은 값(예를 들면, 최대값)으로 설정될 수 있으며, 사용자가 어린이 또는 여자인 경우, 제1 거리(D1)는 미리 설정된 임계 범위 중 상개적으로 낮은 값(예를 들면, 최소값)으로 설정될 수 있다. 센서부는 제1 거리(D1), 제2 거리(D2) 및 제3 거리(D3) 중 적어도 하나를 포함하는 거리 데이터를 생성할 수 있고, 이를 체수분 변화율 예측 장치로 전달할 수 있다. 그러나, 이에 제한되지 않으며, 거리 데이터는 체수분 변화율 예측 장치에 사용자 또는 관리자에 의하여 직접 입력되거나, 외부 서버로부터 전달될 수도 있다. 그리고, 센서부는 제1 전극부 및 제2 전극부 각각을 이용하여 미리 설정된 시간 간격으로(주기 적으로) 인체에 교류 전류를 인가하여 전기적인 경로를 형성하고, 인체로부터 전압 신호를 측정하여 다 양한 주파수에 대응되는 임피던스 값을 측정할 수 있다. 보다 구체적으로, 센서부는 제1 전극을 통하여 인체에 교류 전류를 인가하여 전기적인 경로를 형 성하고, 제2 전극을 통하여 인체로부터 측정된 전압 신호를 출력할 수 있다. 또한, 센서부는 제3 전극을 통하여 인체에 교류 전류를 인가하여 전기적인 경로를 형성하고, 제4 전극을 통하여 인체 로부터 측정된 전압 신호를 출력할 수 있다. 센서부의 임피던스 측정부는 제1 전극 및 제3 전극에 교류 전류를 인가할 수 있고, 제2 전 극 및 제4 전극으로부터 출력되는 전압 신호 기초하여 임피던스를 측정하여 임피던스 데이터를 생성 할 수 있다. 임피던스 측정부에서 측정되는 임피던스 데이터는 임피던스값(Z), 저항값(R), 및 리액턴스값(X) 중 적어도 하나를 포함할 수 있다. 그리고, 리액턴스값(X)은 유도성 리액턴스값(XL) 및 용량성 리액턴스값(XC) 중 적어도 하나를 포함할 수 있다. 이때, 임피던스 측정부는 다양한 주파수에 대응되는 임피던스 데이터를 측정할 수 있다. 즉, 임피던스 데이터는 다양한 주파수에 대응되는 임피던스값(Z), 저항값(R), 및 리액턴스값(X)을 포함할 수 있다. 이때, 센서부는 임피던스 데이터를 측정할 경우, 일정 시간 예컨대, 1분 동안의 측정된 임피던스의 평균값 을 계산하여 초기 임피던스 데이터를 결정할 수 있다. 체수분 변화율 예측 시스템의 체수분 변화율 예측 장치는 센서부로부터 수신한 임피던스 데이 터 및 거리 데이터를 이용하여 체수분 변화율을 예측하는 구성이다. 구체적으로, 체수분 변화율 예측 장치는 제1 정보 수집부와, 제2 정보 수집부와, 임피던스 추출 부와, 체수분 변화율 예측부를 포함할 수 있다. 체수분 변화율 예측 시스템의 체수분 변화율 예측 장치가 수행하는 체수분 변화율 예측 방법에 대하 여 보다 상세히 설명한다. 먼저, 체수분 변화율 예측 장치의 제1 정보 수집부는 센서부로부터 인체에 부착된 하나 이 상의 전극(120, 130) 사이의 거리 데이터를 수신한다(S110). 제1 정보 수집부는 사용자의 인체에 이격 부착된 전극들(120, 130) 사이의 거리 데이터를 수집할 수 있다. 거리 데이터는 제1 전극부 중 제2 전극부와 가장 인접한 제2 전극과 제2 전극부 중 제1 전극부와 가장 인접한 제4 전극 사이의 제1 거리(D1)을 포함할 수 있다. 이어서, 체수분 변화율 예측 장치의 제2 정보 수집부는 센서부로부터 인체의 임피던스 데이 터를 미리 설정된 시간 간격으로 주기적으로 수신한다(S120). 임피던스 데이터는 앞서 설명한 것과 같이, 센서 부의 임피던스 측정부에 의하여 생성된 데이터일 수 있다. 이어서, 체수분 변화율 예측 장치의 임피던스 추출부는 제2 정보 수집부가 수신한 임피던스 데 이터 중 체수분 관련 주파수 영역의 임피던스 데이터인 체수분 관련 임피던스 데이터를 추출한다(S130). 구체적으로, 센서부의 임피던스 측정부는 다양한 주파수 영역에 대응하는 임피던스 데이터를 생성할 수 있 다. 이때, 임피던스 추출부는 다양한 주파수 영역 중 체수분 관련 주파수 영역만을 선별하여 이에 대응되 는 체수분 관련 임피던스 데이터를 추출할 수 있다. 체수분 관련 주파수 영역은 8kHz 내지 64kHZ의 대역일 수 있고, 보다 구체적으로, 8kHz, 16kHz, 32kHz, 50kHz 및 64kHz의 주파수 영역일 수 있다. 체수분 관련 주파수 영역은 이에 제한되지 않으며, 필요에 따라 다른 주파수 영역이 선택될 수도 있다. 이어서, 체수분 변화율 예측부는 임피던스 추출부로부터 추출된 체수분 관련 주파수 영역에서의 체수 분 관련 임피던스 데이터와, 전극들 사이의 거리 데이터를 이용하여 체수분 변화율을 산출한다(S140).체수분 변화율은 전극들 사이의 거리 데이터(예를 들면, 제1 거리(D1))이 증가할 경우 증가할 수 있다. 또한, 체수분 변화율은 기준 시점에서 측정된 초기 체수분 관련 임피던스 데이터와 기준 시점 이후의 체수분 관련 임 피던스 데이터의 변화율의 비율에 의하여 산정될 수 있다. 구체적으로, 체수분 변화율 예측부는 아래의 수학식 1에 의해 체수분의 변화율(△Wt(%))를 예측할 수 있다. <수식 1>"}
{"patent_id": "10-2022-0033103", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "여기서, R8 은 8kHz에서의 저항값을 의미하고, XC16 은 16kHz에서의 리액턴스 값을 의미하고, Z16 은 16kHz에서의 임피던스 값을 의미하고, Z50 은 50kHz에서의 임피던스 값을 의미하고, length(m)는 전극들 사이의 거리값(제1 거리(D1))을 의미할 수 있다. 이때, 상수 1.09, 2.8585. 0.369, 0.155, 0.632는 임의의 가중치 값을 의미하며, 그 값은 변경될 수 있다. 특히, 1.09는 오프셋(offset) 값이며, 초기 값을 계산할 때 균형을 맞추기 위해 사용 된 값일 수 있다. 이러한 가중치 값 및 수식은 측정 대상에 따라 변경될 수 있다. 체수분 변화율 예측부는 추출된 임피던스 값들 중 초기 임피던스 값과 환자의 체수분 초기값을 저장할 수 있다. 체수분 변화율 예측부는 초기 임피던스 값과 두번째 측정된 임피던스 값을 이용하여 변화율을 산출 할 수 있다. 도 7을 참조하면, 체수분 변화율 예측 장치는 모니터링부를 더 포함할 수 있다. 모니터링부는 예측된 현재의 체수분 변화율 및 앞으로의 체수분 변화율의 추이를 예측할 수 있다. 모니터링부는 시간에 따른 체수분 변화율을 보여주는 제1 표시부와, 체수분 변화율을 숫자로 보여주 는 제2 표시부와, 예측되는 체수분 변화율을 보여주는 제3 표시부를 포함할 수 있다. 모니터링부는 체수분 변화율이 미리 설정된 목표값 범위를 초과하거나 미 달할 경우, 위험 상황을 단계별 로 보여주는 제4 표시부를 포함할 수 있다. 예컨대, 체수분 변화율이 5% 초과되거나 5% 미달될 경우, 제1 경고등이 점등될 수 있다. 체수분 변화율이 10% 초과되거나 10% 미달될 경우, 제2 경고등이 점등될 수 있다. 체 수분 변화율이 15% 초과되거나 15% 미달될 경우, 제3 경고등이 점등될 수 있다. 이때, 미리 설정된 목표값은 변 경될 수 있다. 모니터링부는 사용자 입력창에 의해 입력된 사용자의 정보를 보여주는 제 5 표시부를 포함할 수 있다. 모니터링부는 START 버튼을 누르게 되면, 사용자 입력창이 출력되며, 사용자 입력창에 환자 번호 및 특성 정보를 입력하고 위험 목표로 하는 타겟 정보를 입력하면 측정이 시작될 수 있다. 도 6을 참조하면, 체중 변화량 예측 장치를 이용하여 측정된 체중 변화율 예측값과 실제 측정된 체중의 변화율 을 비교해 보면, 체중 변화량 예측 장치를 이용하여 측정된 체중 변화율 예측값은 시간이 지나더라도 실제 측정 된 체중의 변화율과 유사하게 나타남을 알 수 있다. 또한, 다른 실시예에 따른 체수분 변화율 예측 장치는 메모리와, 프로세서와 통신용 인터페이스를 포함할 수 있 다. 통신용 인터페이스는 전극들 사이의 거리 데이터 및 임피던스 데이터를 획득할 수 있다. 메모리는 전극들 사이의 거리 데이터 및 임피던스 데이터를 저장할 수 있다. 프로세서는 제1 정보 수집부, 제2 정보 수집부, 임피던스 추출부, 체수분 변화율 예측부 및 모니터링부를 포함 할 수 있으며, 제1 정보 수집부, 제2 정보 수집부, 임피던스 추출부, 체수분 변화율 예측부 및 모니터링부는 하 나의 프로세서에 의해 실행되는 프로그램에 의해 구현될 수있다. 여기서, 프로그램은 메모리에 저장될 수 있다. 프로세서는 수집된 임피던스 데이터 중 체수분 관련 주파수 영역의 임피던스 데이터를 추출하고, 상기 추출된 임피던스 데이터 및 상기 거리 데이터를 이용하여 체수분 변화율을 예측하고, 예측된 체수분 변화율을 모니터링 할 수 있다. 체수분 변화율 예측 시스템의 센서부는 1분간 임피던스 데이터의 기준값(Base Value)을 측정하고, 1분간 교정 값(Calibration Value)를 측정할 수 있다. 체수분 변화율 예측 장치는 이러한 1분간의 기준치와 교정치를 이용 하여 초기 체수분 변화율을 구한 뒤 식에 대입하여 초기화(Zero Base)를 설정할 수 있다. 센서부는 노이즈를 줄이기 위해 30 초 동안 임피던스를 측정할 수 있고 측정된 임피던스의 평균값을 임피던스 데이터로 이용할 수 있다. 도 9는 본 발명의 다른 실시예에 따른 체수분 변화율 예측 시스템을 설명하기 위한 도면이다. 본 발명의 다른 실시예에 따른 체수분 변화율 예측 장치, 시스템 및 체수분 변화율 예측 방법은, 도 1 내지 도 7의 체수분 변화 율 예측 장치, 시스템 및 체수분 변화율 예측 방법과 비교하여, 아래의 일련의 과정들을 프로세서가 더 수행하는 것을 제외하면 실질적으로 동일하므로, 중복 설명은 생략한다. 도 9를 참조하면, 체수분 변화율 예측 장치의 프로세서는 체수분 변화율에 기초하여 하나 이상의 체수분 단계를 결정할 수 있다. 구체적으로, 체수분 변화율은 체수분 변화율 예측부에 의하여 예측될 수 있고, 프로세서는 체수분 변화율 의 값(%)에 기초하여 체수분 변화율이 하나 이상의 체수분 단계 중 어느 체수분 단계인지 결정할 수 있다. 하나 이상의 체수분 단계는 기준 단계, 하나 이상의 플러스 단계(양의 단계), 및 하나 이상의 마이너스 단계(음 의 단계)를 포함할 수 있다. 각각의 체수분 단계들은 체수분 변화율의 값(%)에 따라 대응되도록 결정될 수 있다. 체수분 단계 중 기준 단계는 체수분 변화율을 측정하기 시작하는 초기 시점 또는 미리 지정된 특정 시점에서의 체수분 변화율에 대응되는 단계일 수 있다. 앞서 설명한 것과 같이, 체수분 변화율은 측정이 시작되는 시점에서 0%라고 설정될 수 있고, 프로세서는 이러한 0%의 체수분 변화율인 상태를 기준 단계에 대응시킬 수 있다. 기준 단계는 0단계라고 명명할 수도 있다. 체수분 단계 중 하나 이상의 플러스 단계는 양수인 상태에서 증가하는 체수분 변화율에 대응되는 체수분 단계일 수 있다. 즉, 플러스 단계는 기준 단계에서의 체수분 변화율보다 더 높은 체수분 변화율에 대응될 수 있다. 플 러스 단계는 예를 들면 1단계, 2단계, 3단계 등의 양의 정수의 단계들을 포함할 수 있고, 값이 증가할수록(절대 값이 증가할수록) 대응되는 체수분 변화율은 더 높아질 수 있다. 체수분 단계 중 하나 이상의 마이너스 단계는 음수인 상태에서 감소하는 체수분 변화율에 대응되는 체수분 단계 일 수 있다. 즉, 마이너스 단계는 기준 단계에서의 체수분 변화율보다 더 낮은 체수분 변화율에 대응될 수 있다. 마이너스 단계는 예를 들면 -1단계, -2단계, -3단계 등의 음의 정수의 단계들을 포함할 수 있고, 값이 감 소할수록(절대값이 증가할수록) 대응되는 체수분 변화율은 더 낮아질 수 있다. 이때, 체수분 단계들의 인접 단계 차이값은 미리 설정된 값일 수 있고, 사용자 또는 관리자에 의하여 임의로 조 절될 수 있다. 인접 단계 차이값은 체수분 단계들 중 서로 인접한 단계들 사이의 체수분 변화율 차이값을 의미 할 수 있다. 예를 들면, 도 9(a)에서의 인접 단계 차이값은 제1 인접 단계 차이값(SD1)일 수 있고, 제1 인접 단 계 차이값(SD1)은 10%일 수 있다. 즉, 도 9(a)에서의 체수분 단계들은 체수분 변화율이 10% 증가하거나 감소할 때마다 체수분 단계가 증가하거나 감소할 수 있다. 따라서, 도 9(a)의 기준 단계의 체수분 변화율이 0%인 경우, 1단계의 체수분 변화율은 10%이고, 2단계의 체수분 변화율은 20%이고, -1단계의 체수분 변화율은 -10%일 수 있 다. 일 실시예에 따르면, 체수분 변화율 예측 장치의 프로세서는 사용자(환자)의 사용자 등급에 기초하여 인접 단계 차이값을 조절할 수 있다. 사용자 등급이란 체수분의 변화에 민감한 정도를 나타내는 등급으로서, 사용자 등급 이 높아질수록 체수분의 변화에 더 민감한 사용자라고 판단될 수 있다. 수술환자, 노인, 어린이, 중환자 등은 동일한 수치의 체수분 변화율의 증감에 일반인보다 더 민감하게 반응해야 할 수 있다. 즉, 0%에서 30%로 체수분변화율이 증가한 경우, 일반인은 큰 건강상의 문제가 없을 수 있으나, 수술환자, 중환자 등은 건강 위험도가 클 수 있다. 따라서, 의사, 사용자, 관리자 등은 해당 사용자(환자)의 건강 상태 등에 기초하여 사용자 등급을 산 정하여 체수분 변화율 예측 장치에 전달할 수 있다. 그리고, 체수분 변화율 예측 장치의 프로세서는 사용자 등급이 증가할수록 인접 단계 차이값을 감소시킬 수 있 고, 사용자 등급이 감소할수록 인접 단계 차이값을 증가시킬 수 있다. 예를 들면, 도 9(b)의 사용자 등급은 도 9(a)의 사용자 등급보다 작을 수 있고, 이에, 도 9(b)의 제2 인접 단계 차이값(SD2)은 도 9(a)의 제1 인접 단계 차이값(SD1)보다 클 수 있다. 또한, 도 9(c)의 사용자 등급은 도 9(a)의 사용자 등급보다 클 수 있고, 이에, 도 9(c)의 제3 인접 단계 차이값(SD3)은 도 9(a)의 제1 인접 단계 차이값(SD1)보다 작을 수 있다. 이에, 사용자 등급이 높은 수술환자, 중환자 등 체수분 변화율의 변동에 민감한 사용자(환자)의 경우, 체수분 변화율의 변동에 더욱 민감하게 반응하여 체수분 단계가 빠르게 변화될 수 있다. 일 실시예에 따르면, 체수분 변화율 예측 장치의 프로세서는 체수분 단계에 기초하여 사용자의 위험도를 산출할 수 있다. 사용자의 위험도는 체수분 변화율이 기준 단계에서의 체수분 변화율과 비교하여 증가하거나 감소한 정 도에 대응되는 위험도로서, 환자의 몸속의 체수분이 기준 시점(기준 단계)에서의 체수분 변화율(0%)를 기준으로 증가하거나 감소할수록 사용자의 위험도는 증가할 수 있다. 구체적으로, 프로세서는 체수분 단계의 절대값을 이용하여 사용자의 위험도를 산출할 수 있고, 아래의 '수식 2'에 의하여 위험도를 산출할 수 있다. <수식 2> 위험도 = A * X 수식 2에 대하여 보다 상세하게 설명하면, 수식 2의 체수분 단계 팩터(A * X)는 체수분 단계의 절대값을 의미하 는 X와 체수분 단계의 절대값 X의 가중치를 의미하는 A의 곱일 수 있다. 이때, 가중치 A는 양의 값일 수 있다. 기준 단계에서 체수분 단계의 절대값 X는 0일 수 있고, 사용자의 위험도는 0일 수 있다. 플러스 단계 및 마이너 스 단계에서 체수분 단계의 절대값 X는 양수(1, 2, 3쪋)일 수 있고, 체수분 단계가 플러스 단계에서 증가하거나 마이너스 단계에서 감소할 경우, 사용자의 위험도는 증가할 수 있다. 수식 2의 위험도에서의 가중치 A는 사용자, 관리자 등에 의하여 미리 설정된 값으로 고정되어 있을 수 있다. 그 러나, 이에 제한되지 않으며, 가중치 A는 특정 체수분 단계에서 다르게 설정될 수 있다. 구체적으로, 체수분 단계들 중 특정 체수분 단계(예를 들면, 3단계 및 -2단계)에서의 가중치 A는 나머지 체수분 단계에서의 가중치 A보다 크게 설정될 수 있다. 이러한 경우, 해당 특정 체수분 단계(예를 들면, 3단계 및 -2단 계)에서의 위험도는 다른 단계에서의 위험도보다 가중치가 적용될 수 있다. 또한, 이와 달리, 가중치 A는 체수분 단계의 절대값이 증가할수록 값이 증가할 수 있다. 이러한 경우, 체수분 단계가 플러스 단계에서 증가하거나 마이너스 단계에서 감소할 경우 대응되는 위험도에는 더욱 큰 가중치가 적 용될 수 있다. 또한, 이와 달리, 체수분 단계들 중 특정 체수분 단계(예를 들면, 2단계 및 -4단계)가 선택되고, 특정 체수분 단계(예를 들면, 2단계 및 -4단계)의 절대값 이상의 절대값을 가진 체수분 단계들(예를 들면, 2단계 이상의 플 러스 단계들, 및 -4단계 이하의 마이너스 단계들)은 나머지 체수분 단계들(예를 들면, -3단계 내지 1단계)보다 가중치 A가 더 클 수 있다. 일 실시예에 따르면, 체수분 변화율 예측 장치의 프로세서는 체수분 단계의 절대값 및 체수분 변화 속도를 모두 이용하여 사용자의 위험도를 산출할 수도 있다. 앞서 설명한 것과 같이 프로세서는 '수식 2'에 의하여 사용자의 위험도를 산출할 수 있었으며, 이에 더하여 체수분 변화 속도까지 이용한 아래의 '수식 3'에 의하여 위험도를 산출할 수도 있다. <수식 3> 위험도 = A * X + B * Y 수식 3에 대하여 보다 상세하게 설명하면, 수식 3에 의하여 위험도는 체수분 단계 팩터(A * X)과 체수분 변화 속도 팩터(B * Y)의 합일 수 있다. 이때, 체수분 단계 팩터(A * X)는 수식 2의 체수분 단계 팩터(A * X)와 실질 적으로 동일한 바, 중복 설명은 생략한다. 수식 3의 체수분 변화 속도 팩터(B * Y)는 체수분 변화 속도를 의미하는 Y와 체수분 변화 속도 Y의 가중치를 의 미하는 B의 곱일 수 있다. 구체적으로, 체수분 변화 속도 Y는 특정 시점(현재 시점)의 체수분 변화율에서 미리 설정된 시간 간격 이전의 시점의 체수분 변화율을 뺀 값을 미리 설정된 시간 간격으로 나눈 값일 수 있다. 체수분 변화 속도 Y를 산출하 는데 이용되는 시간 간격은 미리 설정되어 있을 수 있으며, 사용자, 관리자, 의사 등에 의하여 변경될 수도 있 다. 체수분 변화 속도 Y는 체수분 단계가 감소하는 경우 음수일 수 있고, 체수분 단계가 증가하는 경우 양수일 수 있다. 그리고, 체수분 변화 속도 Y의 가중치 B는, 체수분 단계가 기준 단계를 향하여 변화되는 경우 체수분 변화 속도 팩터(B * Y)가 음수이고 체수분 단계가 기준 단계로부터 멀어지도록 변화되는 경우 체수분 변화 속도 팩터(B * Y)가 양수가 되도록, 그 값이 변화될 수 있다. 구체적으로, 체수분 변화 속도 Y의 가중치 B는 특정 시점(현재 시점)의 체수분 단계가 플러스 단계인 경우 양의 값을 가질 수 있다. 이러한 경우, 체수분 단계가 플러스 단계에서 증가할 경우 체수분 변화 속도 Y는 양수일 수 있고, 가중치 B가 양의 값임에 따라 체수분 변화 속도 팩터(B * Y)는 양의 값일 수 있다. 이에, 위험도는 증가 될 수 있다. 그리고, 체수분 단계가 플러스 단계에서 감소할 경우 체수분 변화 속도는 음수일 수 있고, 가중치 B가 양의 값임에 따라 체수분 변화 속도 팩터(B * Y)는 음의 값일 수 있다. 이에, 위험도는 감소할 수 있다. 또한, 체수분 변화 속도 Y의 가중치 B는 특정 시점(현재 시점)의 체수분 단계가 마이너스 단계인 경우 음의 값 을 가질 수 있다. 이러한 경우, 체수분 단계가 마이너스 단계에서 증가할 경우 체수분 변화 속도 Y는 양수일 수 있고, 가중치 B가 음의 값임에 따라 체수분 변화 속도 팩터(B * Y)는 음의 값일 수 있다. 이에, 위험도는 감소 될 수 있다. 그리고, 체수분 단계가 마이너스 단계에서 감소할 경우 체수분 변화 속도는 음수일 수 있고, 가중 치 B가 음의 값임에 따라 체수분 변화 속도 팩터(B * Y)는 양의 값일 수 있다. 이에, 위험도는 증가할 수 있다. 이처럼 가중치 B의 값이 체수분 단계가 플러스 단계인지 마이너스 단계인지에 따라 양의 값 또는 음의 값으로 변화됨에 따라, 프로세서는 체수분 단계가 기준 단계로부터 멀어지는 변화를 보일 경우 이에 대응하여 위험도를 증가시킬 수 있고, 체수분 단계가 기준 단계와 가까워지는 변화를 보일 경우 이에 대응하여 위험도를 감소시킬 수 있다. 일 실시예에 따르면, 체수분 변화율 측정 시스템은 프로세서에 의하여 산출된 체수분 단계 및 위험도 중 적어도 하나에 기초하여 사용자(환자), 보호자, 의료진 등에게 경고 메시지(경고 알람) 등을 전송할 수 있다. 체수분 단계의 절대값이 증가하거나 위험도가 증가할수록 경고 메시지의 주기, 세기 등은 더욱 증가할 수 있다. 본 문서의 다양한 실시예들은 기기(machine)(예: 컴퓨터)로 읽을 수 있는 저 장 매체(machine-readable storage media)(예: 메모리(내장 메모리 또는 외장 메모리))에 저장된 명령어를 포함하는 소프트웨어(예: 프로 그램)로 구현될 수 있다. 기기는, 저장 매체로부터 저장된 명령어를 호출하고, 호출된 명령어에 따라 동작이 가 능한 장치로서, 개시된 실시예들에 따른 전자 장치를 포함할 수 있다. 상기 명령이 제어부에 의해 실행될 경우, 제어부가 직접, 또는 상기 제어부의 제어하에 다른 구성요소들을 이용하여 상기 명령에 해당하는 기능을 수행할 수 있다. 명령은 컴파일러 또는 인터프리터에 의해 생성 또는 실행되는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장매체는, 비일시적(non-transitory) 저장매체의 형태로 제공될 수 있다. 여기서, 비일시적은 저장매체 가 신호(signal)를 포함하지 않으며 실재(tangible)한다는 것을 의미할 뿐 데이터가 저장매체에 반영구적 또는 임시적으로 저장됨을 구분하지 않는다. 실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다.일 실시예에 따르면, 컴퓨터 판독 가능한 기록매체에 저장되어 있는 컴퓨터 프로그램은, 본 실시예에 따른 체수 분 변화율 예측 방법을 포함하는 동작을 프로세서가 수행하기 위한 명령어를 포함할 수 있다. 일 실시예에 따르면, 컴퓨터 프로그램을 저장하고 있는 컴퓨터 판독 가능 기 록매체는, 컴퓨터 프로그램이 본 실시예에 따른 체수분 변화율 예측 방법을 포함하는 동작을 프로세서가 수행하기 위한 명령어를 포함할 수 있다. 상기에서 설명한 체수분 변화율 예측 장치 및 방법은 수술중 환자에게 적용하여 즉각적인 체수분 변화율을 얻을 수 있다는 점에서 유용하지만, 수술을 받지 않는 환자나 일반인에게도 적용될 수 있다. 상기에서는 도면 및 실시예를 참조하여 설명하였지만, 해당 기술 분야의 숙 련된 당업자는 하기의 특허청구범위 에 기재된 실시예의 기술적 사상으로부터 벗어나지 않는 범위 내에서 실시예는 다양하게 수정 및 변경시킬 수 있음은 이해할 수 있을 것이다. 본 발명의 다양한 실시예는 하나 이상이 서로 결합되어 새로운 실시예를 구성할 수 있음은 물론이다. 본 발명의 다양한 실시예에 따른 체수분 변화율 예측 장치는 인체에 부착된 하나 이상의 전극 사이의 거리 데이 터를 수신하도록 구성된 제1 정보 수집부, 인체의 임피던스 데이터를 소정 시간 간격으로 수신하도록 구성된 제 2 정보 수집부, 제2 정보 수집부가 수신한 임피던스 데이터 중 체수분 관련 주파수 영역의 체수분 관련 임피던 스 데이터를 추출하도록 구성된 임피던스 추출부, 및 체수분 관련 임피던스 데이터 및 거리 데이터를 이용하여 인체의 체수분 변화율을 예측하도록 구성된 체수분 변화율 예측부를 포함할 수 있다. 본 발명의 다른 특징에 따르면, 임피던스 추출부는, 8kHz 내지 64kHz의 체수분 관련 주파수 영역의 하나 이상의 주파수에 대응하는 체수분 관련 임피던스 데이터를 추출하고, 체수분 관련 임피던스 데이터는 저항 값 및 리액 턴스 값 중 적어도 하나를 포함할 수 있다. 본 발명의 또 다른 특징에 따르면, 체수분 변화율 예측부에 의하여 산출된 체수분 변화율에 기초하여 하나 이상 의 체수분 단계를 결정하도록 구성된 프로세서를 더 포함하고, 하나 이상의 체수분 단계는 체수분 변화율이 0인 상태에 대응되는 기준 단계, 양수인 상태에서 증가하는 체수분 변화율에 대응되는 하나 이상의 플러스 단계, 및 음수인 상태에서 감소하는 체수분 변화율에 대응되는 하나 이상의 마이너스 단계를 포함할 수 있다. 본 발명의 또 다른 특징에 따르면, 프로세서는, 체수분 변화율의 변동에 대한 민감도를 기준으로 하나 이상의 사용자 등급을 구분하고, 사용자 등급에 기초하여 하나 이상의 체수분 단계의 인접 단계 차이값을 조절할 수 있 다. 본 발명의 또 다른 특징에 따르면, 프로세서는, 하나 이상의 체수분 단계의 절대값을 이용하여 사용자의 위험도 를 산출하고, 위험도는 체수분 단계의 절대값이 증가할수록 증가할 수 있다. 본 발명의 또 다른 특징에 따르면, 프로세서는, 체수분 변화 속도를 더 이용하여 위험도를 산출하고, 체수분 변 화율이 기준 단계를 향하여 변동될 경우, 위험도는 감소할 수 있다. 본 발명의 다양한 실시예에 따른 체수분 변화율 예측 시스템은 체수분 변화율 예측 장치, 및 하나 이상의 전극, 및 임피던스 데이터를 측정하도록 구성된 임피던스 측정부를 포함하는 센서부를 포함할 수 있다. 본 발명의 다양한 실시예에 따른 체수분 변화율 예측 방법은 인체에 부착된 하나 이상의 전극 사이의 거리 데이 터를 수신하는 단계, 인체의 임피던스 데이터를 소정 시간 간격으로 수신하는 단계, 임피던스 데이터 중 체수분 관련 주파수 영역의 체수분 관련 임피던스 데이터를 추출하는 단계, 및 체수분 관련 임피던스 데이터 및 거리 데이터를 이용하여 인체의 체수분 변화율을 산출하는 단계를 포함할 수 있다. 본 발명의 다양한 실시예에 따른 컴퓨터 프로그램은 체수분 변화율 예측 방법을 포함하는 동작을 프로세서가 수 행하기 위한 명령어를 포함할 수 있다. 본 발명의 다양한 실시예에 따른 컴퓨터 판독 가능 기록매체는 컴퓨터 프로그램을 저장하고 있을 수 있다. 이상에서, 본 발명이 구체적인 구성요소 등과 같은 특정 사항들과 한정된 실시 예 및 도면에 의해 설명되었으나, 이는 본 발명의 보다 전반적인 이해를 돕기 위해서 제공된 것일 뿐, 본 발명이 상기 실시예들에 한정되는 것은 아니며, 본 발명이 속하는 기술 분야에서 통상적인 지식을 가진 자라면 이러한 기재로부터 다양 한 수정 및 변형을 꾀할 수 있다. 따라서, 본 발명의 사상은 상기 설명된 실시예에 국한되어 정해져서는 아니되며, 후술하는 청구범위뿐만 아니라 이 청구범위와 균등하게 또는 등가적으로 변형된 모든 것들은 본 발명의 사상의 범주에 속한다고 할 것이다."}
{"patent_id": "10-2022-0033103", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 체수분 변화율 예측 시스템을 설명하기 위한 블록도이다. 도 2는 본 발명의 일 실시예에 따른 체수분 변화율 예측 시스템의 적용예를 설명하기 위한 도면이다. 도 3 및 도 4는 본 발명의 일 실시예에 따른 체수분 변화율 예측 시스템의 센서부를 설명하기 위한 도면이다. 도 5는 본 발명의 일 실시예에 따른 체수분 변화율 예측 장치를 설명하기 위한 블록도이다. 도 6은 본 발명의 일 실시예에 따른 체수분 변화율 예측 방법을 설명하기 위한 순서도이다. 도 7은 본 발명의 일 실시예에 따른 체수분 변화율 예측 장치의 모니터링부를 나타낸 도면이다. 도 8은 본 발명의 일 실시예에 따른 체수분 변화량 예측 장치에 의해 측정된 실제값과 예측값을 나타낸 그래프 이다. 도 9는 본 발명의 다른 실시예에 따른 체수분 변화율 예측 시스템을 설명하기 위한 도면이다."}
