{"patent_id": "10-2022-0119028", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0040237", "출원번호": "10-2022-0119028", "발명의 명칭": "인공신경망을 사용한 복합건축물의 화재 피난허용시간 추정 프로그램을 기록한 컴퓨터 판독", "출원인": "서울시립대학교 산학협력단", "발명자": "김강수"}}
{"patent_id": "10-2022-0119028", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인공신경망을 사용한 복합건축물의 화재 피난허용시간 추정 프로그램을 기록한 컴퓨터 판독 가능 저장매체로서, (a) 주요 변수는 연료(fuel)의 종류와 화원의 위치로 설정하여 복합 건축물 의 화재시나리오에 대한 시뮬레이션을 수행하고 결과에 대한 데이터베이스를 구축하는 단계; (b) 온도(Temperature), 가시거리(Visibility), 산소(O2), 이산화탄소(CO2) 및 일산화탄소(CO)의 농도를 포함하여 인공신경망의 입력층의 입력변수로 설정하는단계;(c) 인공신경망 입력층에 입력된 입력변수를 바탕으로 활성함수(f1)를 사용하여 계산하여 입력층에서 인공신경망의 은닉층으로 전달하도록 하는 단계; 및 (d) 인공신경망의 은닉층에서 출력층으로 활성함수(f2)를 적용하여계산하여출력층에서 정규화된 출력값(tn)을 출력하도록 하는 단계;를 포함하여 이루지는 데이터베이스를 바탕으로 인공신경망에서 학습시켜 출력값을 출력하도록 하는 것을 특징으로 하는 인공신경망을 사용한 복합건축물의화재 피난허용시간 추정 프로그램을 기록한 컴퓨터 판독 가능 저장매체."}
{"patent_id": "10-2022-0119028", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 복합 건축물의 화재에 대한 변수 고려시 화재실과 비화재실로 따로 분류하고, 비화재실의 경우 화원으로부터의 거리의 범위에 따라 복수의 그룹으로 분류하여 데이터베이스를 구축하고, 인공신경망 학습은 화재실과 비화재실로 나누어 수행하도록 하는 것을 특징으로 하는 인공신경망을 사용한 복합건축물의 화재 피난허용시간 추정 프로그램을 기록한 컴퓨터 판독 가능 저장매체."}
{"patent_id": "10-2022-0119028", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 인공신경망을 사용한 복합건축물의 화재 피난허용시간 추정 프로그램에 대한 것이며, 복합건축물에 대 한 화재시뮬레이션결과를 기반으로 데이터베이스를 구축하고 이를 인공신경망에 적용하여 피난허용시간을 추정하 도록 하는 추정 프로그램을 기록한 컴퓨터 판독 가능 저장매체에 관한 것이다."}
{"patent_id": "10-2022-0119028", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공신경망을 사용한 복합건축물의 화재 피난허용시간 추정 프로그램을 기록한 컴퓨터 판독 가능 저 장매체에 관한 것으로서, 일반적인 복합건축물에 대한 화재시뮬레이션 결과를 기반으로 데이터베이스를 구축하 고 이를 인공신경망에 적용하여 피난허용시간을 추정하는 프로그램 방법에 관한 것이다."}
{"patent_id": "10-2022-0119028", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "복합건축물에서 화재가 발생하는 경우에는 피난방향과 연기 및 화염의 진행방향이 일치하여 인명피해가 크게 발 생하는 문제점이 있었다. 건축물에서 화재 시 생성되는 연기로 인하여 재실자의 가시거리는 급격히 감소되며, 이는 곧 재실자의 보행속도 감소 및 피난시간의 증가로 이어져 인명피해가 크게 발생하고 있기 때문에, 성능기반 피난설계를 위해서는 건축 물 별로 복잡한 화재 및 피난 시뮬레이션을 수행해야만 하며 이는 수많은 인력과 시간이 소요된다는 단점이 있 었다. 따라서, 대형 복합건축물의 성능기반 피난설계를 위하여 신속하며 합리적인 피난허용시간 추정방법이 요구되고 있다. 본 발명의 배경이 되는 기술로는 특허등록 제1471643호 \"3차원 공간기반의 화재 피난 시뮬레이션 시스템 및 시"}
{"patent_id": "10-2022-0119028", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "뮬레이션 방법\"(특허문헌 1)이 있다. 상기 배경기술에서는 '가상 공간 내에 아바타를 배치시켜 화재 발생에 따 른 피난 이동 및 피난 결과를 예측하기 위한 화재 피난 시뮬레이션 시스템에 있어서, 상기 아바타에 대한 데이 터를 포함하는 아바타 모듈; 상기 가상 공간을 저작하여 공간 토폴로지를 형성하고, 상기 가상 공간에 대한 공 간 데이터를 포함하는 공간 모듈; 상기 가상 공간에서 발생하는 화재에 의한 시뮬레이션 결과를 포함하는 화재 모듈; 상기 아바타가 공간에서 이동하는 방법에 대한 데이터를 포함하는 피난모듈;및 상기 모듈들과 연결되고, 상기 모듈들에 의한 결과에 기초하여 화재 피난 시뮬레이션을 실시하여 시뮬레이션 결과를 도출하는 플랫폼을 포함하는 3차원 공간 기반의 화재 피난 시뮬레이션 시스템'을 제안하여 화재 시뮬레이션 오픈 플랫폼을 제공하고, 국 내 실정에 부합하는 피난 시뮬레이션의 구현이 가능하며, 3차원 공간정보를 통해통합적이고 가시적인 피난 시뮬 레이션 상태를 확인할 수 있도록 한다."}
{"patent_id": "10-2022-0119028", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 3, "content": "그러나 상기 배경기술은 시뮬레이션 방법이 복잡하고 실시간으로 피난허용시간을 추정할 수 없는 문제점이 있었 다."}
{"patent_id": "10-2022-0119028", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은, 현장에서 계측된 데이터를 바탕으로 유독가스 및 온도 값을 입력만 하면 데이터베이스에 근거하여 실시간으로 피난허용시간을 추정할 수 있는 프로그램을 제공하는 것이다."}
{"patent_id": "10-2022-0119028", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명은 인공신경망을 사용한 복합건축물의 화재 피난허용시간 추정 프로그램이다. 본 발명의 (a) 주요 변수 는 연료(fuel)의 종류와 화원의 위치로 설정하여 복합 건축물의 화재시나리오에 대한 시뮬레이션을 수행하고 결 과에 대한 데이터베이스를 구축하는 단계; (b) 온도(Temperature), 가시거리(Visibility), 산소(O2), 이산화탄 소(CO2) 및 일산화탄소(CO)의 농도를 포함하여 인공신경망의 입력층의 입력변수로 설정하는 단계; (c) 인공신경 망 입력층에 입력된 입력변수를 바탕으로 활성함수(f1)를 사용하여 계산하여 입력층에서 인공신경망의 은닉층으 로 전달하도록 하는 단계; (d) 인공신경망의 은닉층에서 출력층으로 활성함수(f2)를 적용하여 계산하여 출력층에 서 정규화된 출력값(tn)을 출력하도록 하는 단계;를 포함하여 이루어져, 주어진 데이터베이스를 바탕으로 인공신 경망에서 학습시켜 출력값을 출력하도록 하며, 출력값(tn)은 다음과 같은 식이다."}
{"patent_id": "10-2022-0119028", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "또한, (a) 단계에서, 복합 건축물의 화재에 대한 변수 고려시 화재실과 비화재실로 따로 분류하고, 비화재실의 경우 화원으로부터의 거리의 범위에 따라 복수의 그룹으로 분류하도록 하는 것을 특징으로 하는 인공신경망을 사용한 복합건축물의 화재 피난허용시간 추정 프로그램을 제공하고자 한다. 또한, (c) 단계에서, 피난허용시간(t)은 t = tmin+tn(tmax-tmin) (여기서, tmax : 인공신경망 학습에 사용된 출력값 의 최대값, tmin : 인공신경망 학습에 사용된 출력값의 최소값)이다. 또한, 비화재실의 경우 화원으로부터의 거 리의 범위를 그룹 1: 1 m - 15 m, 그룹 2: 16 m - 25 m, 그룹 3: 26 m - 50 m 로 분류한다."}
{"patent_id": "10-2022-0119028", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 인공신경망을 사용한 복합건축물의 화재 피난허용시간 추정 프로그램은 일반적인 복합건축물을 대상 으로 다양한 시나리오에 대한 화재 시뮬레이션을 수행하고 데이터베이스를 구축하였으며 데이터베이스와 인공신 경망을 활용하여 화재 시 복합건축물의 피난허용시간을 추정할 수 있도록 하여, 기존의 피난허용시간 평가방법 과 달리 복잡한 화재 및 피난 시뮬레이션을 생략할 수 있도록 할 수 있으며, 특히 본 발명은 현장에서 계측된 데이터를 바탕으로 유독가스 및 온도 값을 입력만 하면 데이터베이스에 근거하여 실시간으로 피난허용시간을 추 정할 수 있도록 하는 매우 유용한 효과가 있다."}
{"patent_id": "10-2022-0119028", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서 본 발명은 첨부된 도면에 제시된 실시 예를 참조하여 상세하게 설명이 되지만 제시된 실시 예는 본 발 명의 명확한 이해를 위한 예시적인 것으로 본 발명은 이에 제한되지 않는다. 이하 바람직한 실시예에 따라 본 발명의 기술적 구성을 상세히 설명하면 다음과 같다. 도 1은 본 발명의 복합건축물의 화재 피난허용시간 추정 방법에 대한 흐름도이다. 도 1에서와 같이, 본 발명의 복합건축물의 화재 피난허용시간 추정방법은 먼저, 1 단계로 화재시뮬레이션 수행 및 피난가능시간 평가하고, 화재시뮬레이션 데이터베이스 구축한 뒤, 2 단계로 인공지능 기반 피난가능시간 예 측 알고리즘 개발하여, 3단계로 개발된 인공지능 알고리즘의 검증을 하도록 한다. 도 2는 복합건축물의 화재시뮬레이션 결과에 기반한 데이터베이스구축 과정을 도시한 도이다. 도 2 및 표 1에서와 같이, 데이터베이스의 구축을 위해 Fire Dynamics Simulator (FDS) 를 활용하여 전형적인 복합 건축물의 총 60개의 화재시나리오에 대한 시뮬레이션을 수행하였으며, 시뮬레이션의 주요 변수는 연료 (fuel)의 종류와 화원의 위치로 설정하였다. [표 1]"}
{"patent_id": "10-2022-0119028", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "연료는 총 5가지(Ethanol, Kerosene, Polystyrene, Polyurethane foams, Wood (red oak))의 종류, 화원의 위치 는 12개의 구획으로 계획하였으며, 각 시나리오별로 화재실 및 비화재실의 온도(Temperature),가시거리 (Visibility), 산소(O2), 이산화탄소(CO2) 및 일산화탄소(CO)의 농도를 측정하여 데이터베이스를 구축한다. 본 발명에서는 Fire Dynamics Simulator (FDS) 를 활용하여 전형적인 복합 건축물의 총 60개의 화재시나리오에 대한 복합건축물에 대한 화재 시뮬레이션을 수행하였다. 표 1에서와 같이 화재 시나리오의 주요 변수로는 연료(fuel)의 종류와 화원의 위치로 설정하였다. 연료는 상업용 건축물 내 가연물의 종류를 고려하여 Ethanol, Kerosene, Polystyrene, Polyurethane foams, Wood (red oak) 로 계획하였으며, 화원의 위치는 도 2에서와 같이, 12개의 구획으로 계획하였으며, 각 시나리오 별로 화재실 및 비화재실의 온도(Temperature), 가시거리(Visibility), 산소(O2), 이산화탄소(CO2) 및 일산화탄 소(CO)의 농도를 측정하여 데이터베이스를 구축하였다. 본 발명에서 수행한 화재 시뮬레이션에서는 화재성장을 중간(Medium)으로 설정하였으며, 환기조건은 자연환기 상태를 가정하고, 1m 의 간격으로 측정장치리 배치하며, 측정장치는 인명안전기준에 따라 바닥에서 18m의 높이에 설치하였으며, 화재실 및 비화재실의 온도(Temperature), 가시거리(Visibility), 산소(O2), 이산화탄소(CO2) 및 일산화탄소(CO)의 농도를 측정하였다. 화재 시뮬레이션 결과에 대한 데이터베이스 구축은 화재실과 비화재실로 나누어 수행하였다. 도 3은 인공신경망 학습을 위한 데이터베이스의 정규화 및 분류 과정을 도시한 도이고, 도 4는 복합건축물의 대 한 인공신경망 모델 구성을 도시한 도이다. 도 3에서와 같이, 데이터베이스는 인공신경망 학습을 위해 화재실및 비화재실로 그룹을 분류하였으며, NFPA(National Fire Protection Association)의 인명안전 기준에 따라 정규화하였고, 또한, 비화재실의 경우에 는 화원으로부터의 거리에 따라 3가지 데이터베이스 그룹으로 분류하였다.(그룹 1: 1 m - 15 m, 그룹 2: 16 m - 25 m, 그룹 3: 26 m - 50 m) 인공신경망은 데이터베이스를 기반으로 입력변수와 출력변수 간의복잡한 비선형 관 계를 규명하는 데에 활용할 수 있다. 인공신경망 모델에는 뉴런이라는 정보처리 인자가 존재하며, 뉴런은 입력변수와 출력변수 간 관계의 강도를 나 타내는 서로 다른 가중치(weight)로 연결되어 있다. 학습(training)은 가중치 값을 계속적으로 수정하여 오차를 최소화시키는 단계를 의미하며, 인공신경망에서 가중치 값을 계속적으로 수정하여 오차를 최소화시키도록 학습 시켜 출력값을 출력하도록 한다. 인공신경망 모델은 입력층(input layer), 은닉층(hidden layer) 및 출력층(output layer)으로 구성되며, 가중 치는 각 뉴런에 따라 다르게 적용되며, 역치(bias)는 은닉층과 출력층의 뉴런에만 적용된다. 본 발명에서는 입력층에서 은닉층으로의 전달을 위한 활성화 함수로써 Hyperbolic tangent sigmoid 활성함수를 사용하며, 출력층에서는 Pure Linear활성함수를 적용하였다. 인공신경망 학습은 화재실과 비화재실로 나누어 수행하였으며, 입력변수로써 피난허용시간 평가에 필수적인 영 향인자를 모두 고려하도록 한다. 화재실에 대한 인공신경망 모델의 경우에는 입력층은 온도(Temperature), 가시거리(Visibility), 산소(O2), 이 산화탄소(CO2) 및 일산화탄소(CO)를 고려하여 총6개, 은닉층은 5개, 출력층은 피난허용시간으로 구성하였다. 비화재실에 대한 인공신경망 모델의 경우에는 추가적으로 화원으로 부터의 거리를 고려하여 총 7개의 입력층으 로 구성하였다. 상술한 단계에서 구축된 데이터베이스에서 인공신경망 모델의 학습(training), 검증(validation) 및 확인(tes t)에 각각 70%, 15% 및 15% 의 데이터가 사용되었으며, 이 과정에서 데이터는 무작위로 선택되었다. 출력값(tn)은 제안한 알고리즘에 기반하여 다음과 같은 함수로 표현 할 수 있다. - 식 (여기서, xn : 정규화된 입력값 tn : 정규화된 출력값 W1 : 입력값과 은닉측 간의 가중치 W2 : 은닉층과 출력층의 가중치 b1 : 입력값과 은닉측 간의 역치값 b2 : 은닉층과 출력층의 역치값 f1 : 은닉층의 활성함수 f2 : 출력층의 할성함수)으로 출력된다. 도 5는 인공신경망 모델의 입력층과 은닉층간의 계산 과정을 도시한도이다. 도 5에서와 같이, 인공신경망 모델의 학습(training), 검증(validation) 및 확인(test)에 각각 70%, 15% 및 15% 의 데이터가 사용되었으며, 이 과정에서 데이터는 무작위로 선택되었다. 계산 과정은 다음과 같다. 식에서의 ①, ②, ③, ④의 순서로 계산을 하며, ① (1-(abs(2 x ([xn]-1)))) ② [W1] x ① ③ ②+b1 ④"}
{"patent_id": "10-2022-0119028", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "입력층에서 은닉층으로 전달을 위한 활성화 함수로써 ④에서와같이, Hyperbolic tangent sigmoid 활성함수를 사 용하였다. 활성화 함수는 일정 값을 넘어서면 1, 그 이하는 0 값을 출력하기 위해 시그모이드 함수를 사용하며, 모든 실수 값을 0과 1사이의 값으로 변환시킨다. 입력값 x와 각각의 입력값에 대한 가중치(weight) 세타값(θ)으로계산된 결과를 시그모이드 함수에 입력하여 0 과 1사이의 값으로 바꾸며, 보통 0.5를 기준으로 0.5 미만은 0, 0.5이상은 1에 대응되도록 하여 활성화 함수 (Activation Function)로 사용한다. 도 6은 인공신경망 모델의 은닉층과 출략층간의 계산 과정을 도시한도이다. 도 6에서와 같이, 출력층에서는 Pure linear 활성함수를 적용하였으며 계산 과정은 다음과 같이 식에서의 ⑤, ⑥, ⑦의 순서로 계산하도록 한다. 최종적으로 정규화된 출력값이 tn으로써 나타나게 되며, 피난허용시간은 t로 나타나도록 하였다. ⑤ [W2] x ④ + [b2] ⑥ tn = (1 + ⑤)/2 ⑦ t = tmin+tn(tmax-tmin) (여기서, tmax : 인공신경망 학습에 사용된 출력값의 최대값 tmin : 인공신경망 학습에 사용된 출력값의 최소값) 이상에서 설명된 실시예들은 하드웨어 구성요소, 소프트웨어 구성요소, 및/또는 하드웨어 구성요소 및 소프트웨 어 구성요소의 조합으로 구현될 수 있다. 예를 들어, 실시예들에서 설명된 장치, 방법 및 구성요소는, 예를 들 어, 프로세서, 콘트롤러, ALU(arithmetic logic unit), 디지털 신호 프로세서(digital signal processor), 마 이크로컴퓨터, FPGA(field programmable gate array), PLU(programmable logic unit), 마이크로프로세서, 또는 인스트럭션(instruction)을 실행하고 응답할 수 있는 다른 어떠한 장치와 같이, 하나 이상의 범용 컴퓨팅 장치 또는 특수 목적 컴퓨팅 장치를 이용하여 구현될 수 있다. 처리 장치는 운영 체제(OS) 및 상기 운영 체제 상에서 수행되는 하나 이상의 소프트웨어 애플리케이션을 수행할 수 있다. 또한, 처리 장치는 소프트웨어의 실행에 응 답하여, 데이터를 접근, 저장, 조작, 처리 및 생성할 수도 있다. 이해의 편의를 위하여, 처리 장치는 하나가 사"}
{"patent_id": "10-2022-0119028", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "용되는 것으로 설명된 경우도 있지만, 해당 기술분야에서 통상의 지식을 가진 자는, 처리 장치가 복수 개의 처 리 요소(processing element) 및/또는 복수 유형의 처리 요소를 포함할 수 있음을 알 수 있다. 예를 들어, 처리 장치는 복수 개의 프로세서 또는 하나의 프로세서 및 하나의 콘트롤러를 포함할 수 있다. 또한, 병렬 프로세서 (parallel processor)와 같은, 다른 처리 구성(processing configuration)도 가능하다. 소프트웨어는 컴퓨터 프로그램(computer program), 코드(code), 인스트럭션(instruction), 또는 이들 중 하나 이상의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결합적으로(collectively) 처리 장치를 명령할 수 있다. 소프트웨어 및/또는 데이터는, 처리 장치에 의하여 해석되거나 처 리 장치에 명령 또는 데이터를 제공하기 위하여, 어떤 유형의 기계, 구성요소(component), 물리적 장치, 가상 장치(virtual equipment), 컴퓨터 저장 매체 또는 장치에 영구적으로, 또는 일시적으로 구체화(embody)될 수 있 다. 소프트웨어는 네트워크로 연결된 컴퓨터 시스템 상에 분산되어서, 분산된 방법으로 저장되거나 실행될 수도 있다. 소프트웨어 및 데이터는 하나 이상의 컴퓨터 판독 가능 기록 매체에 저장될 수 있다. 실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 실시예를 위하여 특별히 설계 되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가 능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD- ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체 (magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도 록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 상기된 하드웨어 장치는 실시예의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도 록 구성될 수 있으며, 그 역도 마찬가지이다."}
{"patent_id": "10-2022-0119028", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "이상과 같이 실시예들이 비록 한정된 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가진 자라면 상기를 기초로 다양한 기술적 수정 및 변형을 적용할 수 있다. 예를 들어, 설명된 기술들이 설명된 방법과 다른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다."}
{"patent_id": "10-2022-0119028", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 명세서에서 첨부되는 다음의 도면들은 본 발명의 바람직한 실시예를 예시하는 것이며, 발명의 상세한 설명과 함께 본 발명의 기술사상을 더욱 이해시키는 역할을 하는 것이므로, 본 발명은 첨부한 도면에 기재된 사항에만 한정되어서 해석되어서는 아니 된다. 도 1은 본 발명의 복합건축물의 화재 피난허용시간 추정 방법에 대한 흐름도이다. 도 2는 복합건축물의 화재시뮬레이션 결과에 기반한 데이터베이스 구축 과정을 도시한 도이다.도 3은 인공신경망 학습을 위한 데이터베이스의 정규화 및 분류 과정을 도시한 도이다. 도 4는 복합건축물의 대한 인공신경망 모델 구성을 도시한 도이다. 도 5는 인공신경망 모델의 입력층과 은닉층간의 계산 과정을 도시한 도이다. 도 6은 인공신경망 모델의 은닉층과 출략층간의 계산 과정을 도시한 도이다."}
