{"patent_id": "10-2023-7023277", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0124952", "출원번호": "10-2023-7023277", "발명의 명칭": "개별 미세 위치 식별자를 표시하고 사용하기 위한 시스템및 방법", "출원인": "더블유쥐알에스 라이센싱 컴퍼니 엘엘씨", "발명자": "핸콕 에스. 리"}}
{"patent_id": "10-2023-7023277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인간 대 인간, 인간 대 디바이스 및 디바이스 대 디바이스의 통신, 입력, 출력 및 디스플레이에 사용되는 하나이상의 영숫자 단축 코드(alphanumeric shortcode) 미세 위치 식별자(micro-location identifier) 중 하나를사용하여 미세 위치를 식별하고 참조하기 위한 시스템으로서,사용자 인터페이스와 디스플레이를 포함하는 전자 디바이스; 및하나 이상의 프로세서를 포함하되, 상기 프로세서는,사용자가 대상 영역을 참조하여 하나 이상의 미세 위치 식별자를 상기 전자 디바이스의 사용자 인터페이스를 사용하여 엔터, 입력, 발성(speak), 주시(see), 선택 또는 통신할 수 있게 하고;상기 대상 영역과 할당된 참조 대상 영역을 결정하고;대상 영역을 참조하여 상기 미세 위치 식별자를 분석하고 사용하도록 구성된, 미세 위치를 식별하고 참조하기위한 시스템."}
{"patent_id": "10-2023-7023277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 미세 위치 식별자는 대상 영역과 참조 대상 영역에 기초하고, 위도와 경도, 범용 횡축 메르카토르(Universal Transverse Mercator), 군용 그리드 참조 체계(Military Grid Reference) 또는 미국 국내그리드(United States National Grid)와 같은 글로벌 동종 중심 2차원 좌표계의 미리 선택된 정밀도 수준에 기초하여 최하위 자릿수의 일부를 표시하는 단계; b) 상기 대상 영역의 크기에 기초하여 자기 중심 2차원 또는 3차원 좌표계의 미리 선택된 정밀도 수준에 기초하여 상기 최하위 자릿수의 일부를 표시하는 단계; c) 상기 대상영역을 참조하여 하나 이상의 특정 미세 위치에 대한 특정 미세 위치 식별자를 할당하는 단계; d) 암호화 키 없이는 사용될 수 없는 방식으로 암호화된 전술된 것 중 하나; e) 암호화 키 없이는 사용될 수 없는 방식의 랜덤한 미세 위치 식별자; 및 f) 상기 대상 영역과 참조 대상 영역에 대한 전술된 것의 하이브리드 조합 중 적어도하나를 참조하여 결정되는, 미세 위치를 식별하고 참조하기 위한 시스템."}
{"patent_id": "10-2023-7023277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 하나 이상의 프로세서는 a) 2차원 영역을 참조하여 결정된 미리 정해진 대상 영역; b) 3차원 영역을 참조하여 결정된 미리 정해진 대상 영역 및; c) 기존 부동산 구획, 공원, 블록, 개발지, 캠퍼스,건물 조합, 프로젝트, 건물, 거주지, 아파트 또는 기타 구조물이나 하위 구조물을 참조하여 결정된 미리 정해진2차원 또는 3차원 대상 영역 중 적어도 하나에 의해 상기 대상 영역을 결정하도록 구성된, 미세 위치를 식별하고 참조하기 위한 시스템."}
{"patent_id": "10-2023-7023277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 하나 이상의 프로세서는 인공 지능과, 자연어와 인지 처리를 이용한 알고리즘 중 하나 또는 둘 다에 의해 결정된 용도별로 사용자에 의해 제공된 다른 일반적인 위치 또는 상기 대상 영역의 일반화된이름에 기초하여 상기 대상 영역을 결정하는, 미세 위치를 식별하고 참조하기 위한 시스템."}
{"patent_id": "10-2023-7023277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 사용자 인터페이스는 텍스트, 음성, 선택, 뇌 통신 인터페이스, 및 하이퍼링크 중 적어도하나에 기초하여 사용자가 상기 미세 위치 식별자를 입력할 수 있도록 구성된, 미세 위치를 식별하고 참조하기위한 시스템."}
{"patent_id": "10-2023-7023277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2023-0124952-2-제1항에 있어서, 상기 하나 이상의 프로세서는 상기 하나 이상의 미세 위치 식별자와 관련된 임의의 입력 또는통신에 응답하여 상기 미세 위치 식별자에 의해 식별된 하나 이상의 미세 위치와 관련된 추가 정보, 검색 결과또는 서비스를 사용하거나 포함하도록 구성된, 미세 위치를 식별하고 참조하기 위한 시스템."}
{"patent_id": "10-2023-7023277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 상기 하나 이상의 프로세서는 상기 하나 이상의 미세 위치 식별자, 상기 대상 영역 중 하나 이상을 명확하게 하도록 구성되고, 또는 상기 하나 이상의 프로세서는 a) 상기 미세 위치 식별자 또는 대상 영역중 하나 이상과 관련된 일반적인 좌표 위치 또는 기타 정보, b) 사용자의 신원, 및 c) 사용자와 사용 중 하나와관련된 사용자 및 디바이스 생성 컨텍스트 정보 또는 상기 사용자 또는 사용과 관련된 일반적인 좌표 또는 기타정보 중 하나를 포함하여, 송신 또는 수신 전자 디바이스 또는 원격 서버 중 하나에 의해 제공되거나 알려지거나 결정 가능한 정보를 사용하여 상기 대상 영역을 선택하거나 결정하는, 미세 위치를 식별하고 참조하기 위한시스템."}
{"patent_id": "10-2023-7023277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 하나 이상의 프로세서는 상기 대상 미세 위치 식별자를 식별하기 위해 디지털 지도, 디스플레이, 항공, 위성 및 기타 이미지, 도면, 평면도, 개략도 상에 상기 미세 위치 식별자를 표시하도록 구성된,미세 위치를 식별하고 참조하기 위한 시스템."}
{"patent_id": "10-2023-7023277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서, 상기 하나 이상의 미세 위치 식별자 각각은 a) xy 또는 xyz 형식으로 구성되고 구조화된 1 내지 10개의 숫자 또는 영숫자 문자; b) 계층적이고 중첩된 형식으로 구성되고 구조화된 1 내지 10개의 숫자 또는영숫자 문자; c) 1 내지 10개의 숫자 또는 영숫자 랜덤화된 문자; 또는 d) 하이브리드 xy, xyz, 계층적/중첩된또는 랜덤한 형식으로 구성되고 구조화된 1 내지 10개의 숫자 또는 영숫자 문자 중 하나로 구성된, 미세 위치를식별하고 참조하기 위한 시스템."}
{"patent_id": "10-2023-7023277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서, 상기 미세 위치 식별자는 a) 상기 미세 위치에 대해 1-미터 범용 횡축 메르카토르 좌표 쌍으로부터 유도된 1-미터 및 10-미터 최하위 자릿수 쌍, b) 상기 미세 위치에 대해 1-미터 범용 횡축 메르카토르 좌표 쌍으로부터 유도된 1-미터, 10-미터 및 100-미터 최하위 자릿수 쌍, c) 상기 미세 위치에 대해 1-미터 범용횡축 메르카토르 좌표 쌍으로부터 유도된 1-미터, 10-미터, 100-미터, 및 1,000-미터 최하위 자릿수 쌍, d) 상기 미세 위치에 대해 1-미터 범용 횡축 메르카토르 좌표 쌍으로부터 유도된 1-미터, 10-미터, 100-미터, 1,000-미터 및 10,000-미터 최하위 자릿수 쌍, 및 e) 상기 대상 영역에 대한 참조 대상 영역에 의해 수립된 앵커로부터의 상기 미세 위치의 거리에 기초하여 요구되는 최소 수의 쌍인 것으로 자동적으로 결정되는 전술된 것 중 하나 중 하나로 구성된, 미세 위치를 식별하고 참조하기 위한 시스템."}
{"patent_id": "10-2023-7023277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "인간 대 인간, 인간 대 디바이스 및 디바이스 대 디바이스의 통신, 입력, 출력 및 디스플레이에 사용되는 하나이상의 영숫자 단축 코드 미세 위치 식별자 중 하나를 사용하여 미세 위치를 식별하고 참조하기 위한 방법으로서,사용자가 대상 영역을 참조하여 하나 이상의 미세 위치 식별자를 전자 디바이스의 인터페이스를 사용하여 엔터,입력, 발성, 주시, 선택 또는 통신할 수 있게 하는 단계;상기 대상 영역과 할당된 참조 대상 영역을 결정하는 단계; 및하나 이상의 프로세서가 대상 영역을 참조하여 상기 미세 위치 식별자를 분석하고 사용하는 단계를 포함하는, 미세 위치를 식별하고 참조하기 위한 방법."}
{"patent_id": "10-2023-7023277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 상기 미세 위치 식별자는 대상 영역과 참조 대상 영역에 기초하고, a) 위도와 경도, 범용 횡축 메르카토르, 군용 그리드 참조 체계 또는 미국 국내 그리드와 같은 글로벌 동종 중심 2차원 좌표계의 미리공개특허 10-2023-0124952-3-선택된 정밀도 수준에 기초하여 최하위 자릿수의 일부를 표시하는 단계; b) 상기 대상 영역의 크기에 기초하여자기 중심 2차원 또는 3차원 좌표계의 미리 선택된 정밀도 수준에 기초하여 상기 최하위 자릿수의 일부를 표시하는 단계; c) 상기 대상 영역을 참조하여 하나 이상의 특정 미세 위치에 대한 특정 미세 위치 식별자를 할당하는 단계; 및 d) 암호화 키 없이는 사용될 수 없는 방식으로 암호화된 전술된 것 중 하나; e) 암호화 키 없이는사용될 수 없는 방식의 랜덤한 미세 위치 식별자; 및 f) 전술된 참조 대상 영역의 하이브리드 조합 중 적어도하나를 참조하여 결정되는, 미세 위치를 식별하고 참조하기 위한 방법."}
{"patent_id": "10-2023-7023277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서, 상기 대상 영역은 a) 2차원 영역을 참조하여 결정된 미리 정해진 대상 영역; b) 3차원 영역을참조하여 결정된 미리 정해진 대상 영역; 및 c) 기존 부동산 구획, 공원, 블록, 개발지, 캠퍼스, 건물 조합, 프로젝트, 건물, 거주지, 아파트 또는 기타 구조물이나 하위 구조물을 참조하여 결정된 미리 정해진 2차원 또는 3차원 대상 영역 중 적어도 하나에 의해 상기 하나 이상의 프로세서에 의해 결정되는, 미세 위치를 식별하고 참조하기 위한 방법."}
{"patent_id": "10-2023-7023277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서, 상기 대상 영역은 상기 하나 이상의 프로세서에 의해 미리 결정되지 않고, 상기 하나 이상의프로세서는 인공 지능과, 자연어와 인지 처리를 사용하는 알고리즘 중 하나 또는 둘 다에 의해 결정되는 용도별로 사용자에 의해 제공되는 다른 일반적인 위치 또는 상기 대상 영역에 대한 일반화된 이름에 기초하여 상기 대상 영역을 결정하는, 미세 위치를 식별하고 참조하기 위한 방법."}
{"patent_id": "10-2023-7023277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11항에 있어서, 상기 사용자에 의한 미세 위치 식별자의 입력은 텍스트, 음성, 선택, 뇌 통신 인터페이스 및하이퍼링크 중 적어도 하나에 기초하는, 미세 위치를 식별하고 참조하기 위한 방법."}
{"patent_id": "10-2023-7023277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제11항에 있어서, 상기 하나 이상의 프로세서는 상기 하나 이상의 미세 위치와 관련된 임의의 입력 또는 통신에응답하여 상기 미세 위치 식별자에 의해 식별된 하나 이상의 미세 위치와 관련된 추가 정보, 검색 결과 또는 서비스를 사용하거나 포함하는, 미세 위치를 식별하고 참조하기 위한 방법."}
{"patent_id": "10-2023-7023277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제11항에 있어서, 상기 하나 이상의 프로세서에 의해 적절한 것으로 결정된 경우, 상기 하나 이상의 프로세서는상기 하나 이상의 미세 위치 식별자, 상기 대상 영역 중 하나 이상을 명확하게 하고, 또는 상기 하나 이상의 프로세서는 a) 상기 미세 위치 식별자 또는 대상 영역 중 하나 이상과 관련된 일반적인 좌표 위치 또는 기타정보, b) 상기 사용자의 신원, 및 c) 사용자와 사용 중 하나와 관련된 사용자 및 디바이스 생성 컨텍스트 정보또는 사용자 또는 사용과 관련된 일반적인 좌표 또는 기타 정보 중 하나를 포함하여 송신 또는 수신 전자 디바이스 또는 원격 서버 중 하나에 의해 제공되거나 알려지거나 결정 가능한 정보를 사용하여 상기 대상 영역을 선택하거나 결정하는, 미세 위치를 식별하고 참조하기 위한 방법."}
{"patent_id": "10-2023-7023277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서, 상기 하나 이상의 프로세서는 상기 대상 미세 위치 식별자를 식별하기 위해 디지털 지도, 디스플레이, 항공, 위성 및 기타 이미지, 도면, 평면도, 개략도 상에 상기 미세 위치 식별자를 표시하도록구성된, 미세 위치를 식별하고 참조하기 위한 방법."}
{"patent_id": "10-2023-7023277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제11항에 있어서, 상기 하나 이상의 미세 위치 식별자 각각은 a) xy 또는 xyz 형식으로 구성되고 구조화된 1 내지 10개의 숫자 또는 영숫자 문자; b) 계층적이고 중첩된 형식으로 구성되고 구조화된 1 내지 10개의 숫자 또는영숫자 문자; c) 1 내지 10개의 숫자 또는 영숫자 랜덤화된 문자; 또는 d) 하이브리드 xy, xyz, 계층적/중첩된또는 랜덤한 형식으로 구성되고 구조화된 1 내지 10개의 숫자 또는 영숫자 문자 중 하나로 구성된, 미세 위치를식별하고 참조하기 위한 방법.공개특허 10-2023-0124952-4-청구항 20 제11항에 있어서, 상기 미세 위치 식별자는 a) 상기 미세 위치에 대해 1-미터 범용 횡축 메르카토르 좌표 쌍으로부터 유도된 1-미터 및 10-미터 최하위 자릿수 쌍, b) 상기 미세 위치에 대해 1-미터 범용 횡축 메르카토르좌표 쌍으로부터 유도된 1-미터, 10-미터 및 100-미터 최하위 자릿수 쌍, c) 상기 미세 위치에 대해 1-미터 범용 횡축 메르카토르 좌표 쌍으로부터 유도된 1-미터, 10-미터, 100-미터, 및 1,000-미터 최하위 자릿수 쌍, d)상기 미세 위치에 대해 1-미터 범용 횡축 메르카토르 좌표 쌍으로부터 유도된 1-미터, 10-미터, 100-미터,1,000-미터 및 10,000-미터 최하위 자릿수 쌍, 및 e) 상기 대상 영역에 대한 참조 대상 영역에 의해 수립된 앵커로부터의 미세 위치의 거리에 기초하여 요구되는 최소 수의 쌍인 것으로 자동으로 결정되는 전술된 것 중 하나 중 하나로 구성된, 미세 위치를 식별하고 참조하기 위한 방법."}
{"patent_id": "10-2023-7023277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "지도 또는 다른 시각적 디스플레이 상에 하나 이상의 미세 위치를 참조하거나 표시하기 위해 사용자가 미세 위치 식별자로서 영숫자 단축 코드를 식별하고 입력할 수 있게 하는 방법으로서,대상 영역과 관련된 지도, 다이어그램, 위성 이미지 또는 기타 이미지 상에 하나 이상의 미세 위치를 식별, 선택 또는 표시하기 위해 사용자가 하나 이상의 문자를 포함하는 숫자 또는 영숫자 단축 코드를 전자 디바이스의인터페이스를 통해 엔터, 입력, 발성, 선택 또는 사용할 수 있게 하는 단계; 및하나 이상의 프로세서가 대상 영역을 참조하여 상기 미세 위치 식별자를 분석하고 사용하는 단계를 포함하는, 미세 위치 식별자로서 영숫자 단축 코드를 식별하고 입력할 수 있게 하는 방법."}
{"patent_id": "10-2023-7023277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "지도 또는 다른 시각적 디스플레이 상에 하나 이상의 미세 위치를 참조하거나 표시하기 위해 사용자가 미세 위치 식별자로서 영숫자 단축 코드를 식별하고 입력할 수 있게 하는 시스템으로서,사용자 인터페이스와 디스플레이를 포함하는 전자 디바이스; 및하나 이상의 프로세서를 포함하되, 상기 프로세서는,대상 영역과 관련된 지도, 다이어그램, 위성 이미지 또는 기타 이미지 상에 하나 이상의 미세 위치를 식별, 선택 또는 표시하기 위해 사용자가 하나 이상의 문자를 포함하는 숫자 또는 영숫자 단축 코드를 상기 전자 디바이스의 인터페이스를 통해 엔터, 입력, 발성, 선택 또는 사용할 수 있게 하고; 대상 영역을 참조하여 상기 미세 위치 식별자를 분석하고 사용하도록 구성된, 미세 위치 식별자로서 영숫자 단축 코드를 식별하고 입력할 수 있게 하는 시스템."}
{"patent_id": "10-2023-7023277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "사람 대 사람, 사람 대 디바이스 및 디바이스 대 디바이스의 식별, 지정, 통신, 입력, 출력 및 디스플레이를 위해 미세 위치 식별자에 표시되는 자릿수가 제1 위치에 대해 하나 이상의 미세 위치를 이산적으로 식별하는 데필요한 최소 자릿수가 되도록 두 개 이상의 영숫자 단축 코드 미세 위치 식별자를 사용하여 제1 위치를 참조하여 하나 이상의 미세 위치를 식별하고 참조하기 위한 방법으로서,표시되는 최소 자릿수가 좌표계 및 제3 위치로부터의 거리에 기초하여 필요한 최소 자릿수가 되도록 알려진 위치로부터의 거리에 기초하여 2차원 xy 좌표계의 최하위 자릿수를 전자 디바이스의 디스플레이 상에 표시하는 단계;사용자가 대상 영역을 참조하여 하나 이상의 미세 위치 식별자를 상기 전자 디바이스의 인터페이스를 사용하여엔터, 입력, 발성, 주시 또는 선택할 수 있게 하는 단계; 및하나 이상의 프로세서가 대상 영역을 참조하여 상기 미세 위치 식별자를 분석하고 사용하는 단계를 포함하는, 하나 이상의 미세 위치를 식별하고 참조하기 위한 방법."}
{"patent_id": "10-2023-7023277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "공개특허 10-2023-0124952-5-사람 대 사람, 사람 대 디바이스 및 디바이스 대 디바이스의 식별, 지정, 통신, 입력, 출력 및 디스플레이를 위해 미세 위치 식별자에 표시되는 자릿수가 제1 위치에 대해 하나 이상의 미세 위치를 이산적으로 식별하는 데필요한 최소 자릿수가 되도록 두 개 이상의 영숫자 단축 코드 미세 위치 식별자를 사용하여 제1 위치를 참조하여 하나 이상의 미세 위치를 식별하고 참조하기 위한 시스템으로서,사용자 인터페이스와 디스플레이를 포함하는 전자 디바이스; 및하나 이상의 프로세서를 포함하고, 상기 프로세서는, 표시되는 최소 자릿수가 좌표계와 제3 위치로부터의 거리에 기초하여 필요한 최소 자릿수가 되도록 알려진 위치로부터의 거리에 기초하여 2차원 xy 좌표계의 최하위 자릿수를 상기 전자 디바이스의 디스플레이 상에표시하고;사용자가 대상 영역을 참조하여 하나 이상의 미세 위치 식별자를 상기 전자 디바이스의 인터페이스를 사용하여엔터, 입력, 발성, 주시 또는 선택할 수 있게 하고;대상 영역을 참조하여 상기 미세 위치 식별자를 분석하고 사용하도록 구성된, 하나 이상의 미세 위치를 식별하고 참조하기 위한 시스템."}
{"patent_id": "10-2023-7023277", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "인간 대 인간, 인간 대 기계, 기계 대 기계의 입력, 통신, 검색, 데이터베이스, 위치, 작은 지리적 영역에 대한 기타 지리적 제품 및 서비스, 디바이스, 키워드, 제품 및 서비스를 위한 특정 지리적 영역과 관련된 극히 짧은 영숫자 미세 위치 식별자(MLID)를 생성, 선별, 소유, 제어 및 사용하는 시스템 및 방법이 제공된다. MLID는 정해 지거나 정해지지 않은 고정, 가변 및/또는 주관적으로 결정된 관련 대상 영역(SA)과 MLID를 연관시킴으로써 AI 지원 디바이스 및 서비스를 통해 사용될 수 있는 극히 짧고 단순하며 일관된 개별 식별자를 제공한다."}
{"patent_id": "10-2023-7023277", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "관련 출원 데이터 본 출원은 공동 계류 중인 미국 가출원 번호 63/122,385(출원일: 2020년 12월 7일, 전체 개시 내용은 본 명세서 에 참조에 의해 명확히 원용됨)의 이익을 주장한다. 기술 분야 본 출원은 장소, 재산, 건물 및 기타 구조물 안과 근처의 개별 소규모 인간 규모 대상 영역과 관련된 인간 대 인간, 인간 대 기계, 기계 대 기계의 통신, 지도, 방향, 배달, 검색, 및 위치 분석, 디바이스, 키워드, 제품 및 서비스를 위한 극히 짧은 영숫자 미세 위치 식별자를 생성, 선별 및 사용하기 위한 디바이스, 시스템 및 방법에 관한 것이다. 본 출원은 또한 인공 지능과 기타 시스템 및 방법을 통해 이러한 미세 위치 식별자를 해석하고 분 석하고, 이 미세 위치 식별자를 디지털 및 인쇄 지도 및 기타 볼 수 있는 콘텐츠에 최적으로 표시하고, 미세 위 치 식별자를 사용하여 미세 위치 정보, 지도, 제품 및 서비스에 대한 액세스를 촉진하는 것에 관한 것이다."}
{"patent_id": "10-2023-7023277", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "위치를 참조하는 방법에는 여러 가지가 있지만 일반적으로 길고 번거롭다. 오늘날 미세 위치(예를 들어, 건물의 문, 들판의 나무, 주차장의 주차 공간)를 참조하는 간결하고 개별적이며 보편적인 미세 위치 식별자를 제공하는 시스템이 없다. 또한 1) 지리적 위치를 디지털 방식으로 참조하는 현재 표준 또는 단일화된 방법이 없으며, 2) 위치에 대해 단일화된 지리적 데이터베이스 또는 \"진정한 단일 소스\"가 없다. 오늘날 인간에 의한 대부분의 미세 위치 참조는 구어체이며, 기존 거리 주소 및 일반적인 단어 설명에 기초한다. 사용자가 자신이 있는 위치를 결정할 수 있다고 가정하면 이 미세 위치를 다른 사람이나 기계에 전달 하기가 어렵다. 인간이 위도나 경도 또는 임의의 다른 글로벌 참조 시스템을 참조하여 미세 위치를 전달하는 경 우는 드물다. 인간, 기계 및 컴퓨터는 과학, 지리 정보 및 데이터베이스 시스템(GIS) 목적, 글로벌 위치 확인 시스템(GPS) 및 기타 매핑, 내비게이션 및 지리 공간 통신 서비스를 위해 다양한 유형의 지리적 참조를 사용한 다. 이러한 글로벌 지리 공간 참조 시스템(\"글로벌 시스템\")은 일반적으로 전체 지구 또는 기타 행성 또는 공간 체를 위해 설계된 글로벌 좌표 시스템이다. 예를 들어, 위도/경도(\"Lat/Lon\")는 좌표 위도/경도 쌍으로 임의의 2차원 위치를 참조할 수 있도록 한다. 일례로 북위 32도 47분 38.1초와, 서경 117도 21분 4.12초이지만, 위도/ 경도에 대한 수많은 대안적인 형식이 있고, 정밀한 위도/경도 참조에는 특정 데이텀에 대한 추가 참조 또는 행 성에 대한 좌표의 배향이 필요하다. 넓은 지역을 포괄하는 다른 글로벌 시스템은 군용 그리드 참조 시스템 (\"MGRS\"), 범용 횡축 메르카토르(\"UTM\") 및 미국의 경우 미국 국내 그리드(\"USNG\")와 같은 글로벌 그리드 시스 템이다. 가장 일반적인 위치 참조 시스템은, 국가마다, 심지어 국가 내 도시마다 형식과 구조가 다르고, 수많은 구어체 규칙과 현지 지식의 적용을 받는 기존 거리 주소(\"기존 거리 주소\")에 기초한다. 나아가, 이러한 기존 거리 주 소는 세계 많은 지역에서 특별히 잘 개발되거나 선별되지 않았으며, 이는 글로벌 시스템에서 제공하는 정밀도 수준을 거의 제공하지 않는다. 기존 거리 주소는 길고 번거롭고 비표준적인 것에 더하여 미세 위치(아래에 정의 됨) 참조, 매핑, 내비게이션, 정보 및 데이터 캡처/사용, 서비스 및 통신에 필요한 정밀도 수준을 제공하기에 부적절하다. 미세 위치 또는 미세 위치들이라는 용어는 지구 상의 한 지점, 건물 또는 기타 구조물 안이나 부근 의 한 지점, 문, 주차 공간, 테이블의 좌석 또는 해변, 주차장, 큰 방 등의 기타 위치와 같은 정확한 위치를 말 한다. 미세 위치에는 디바이스, 건물 구조물의 구성요소가 포함될 수도 있고, 또한 고정 또는 이동 가능 여부에 관계없이 주차 공간, 방, 하역장, 저장 유닛 등과 같은 작고 지정된 영역(예를 들어, 선박 또는 기타 이동식 컨 테이너에 할당된 영역)이 포함될 수도 있다. 글로벌 시스템은, 보다 세분화된 참조가 추가됨에 따라 보다 정밀하고 세분화된 글로벌 영역 또는 다른 시스템 에서 시작하여 모두 위에서 아래로 작동하도록 설계되었다. 따라서, 위도/경도, MGRS, UTM, USNG 등으로 10피트 정밀 참조를 달성하려면 수많은 자릿수가 필요하다. 영역이나 위치가 작을수록 원하는 정밀도가 높을수록 이러 한 글로벌 시스템 하에서 참조하는 데 더 많은 자릿수가 필요하다. 따라서, 실질적으로 사용자는 미세 위치 식 별 또는 참조를 위한 글로벌 시스템을 거의 사용하지 않는다. 나아가, 이러한 글로벌 시스템은 더 큰 위치를 비 행, 운전, 내비게이팅 또는 위치 참조할 때 또는 도시, 건물, 거주지, 거리 주소 및 기타 더 큰 영역에 대해 ' 까마귀가 날아가는 것처럼' 근접도 또는 방위/방향을 결정할 때에는 충분히 잘 작동하지만, 이러한 글로벌 시스 템은 미세 위치를 식별, 이해, 참조, 사용 및 전달하기 위해 인간이 일상적으로 사용하기에는 사실상 가치가 없 을 정도로 너무 길고 번거롭고 비효율적이다. 이것은 특히 작은 공공 장소, 특정 사무실 또는 방, 심지어 화장 실이나 옷장의 위치에 대해 1 피트 내지 20 피트 또는 사람과 바로 근접한 휴먼 스케일이다. 이는 건물, 마당, 들판 또는 유사한 미세 위치 또는 더 큰 사무실, 거주지 및 기타 건물, 호텔 안 또는 근처의 작은 영역(예를 들 어, 나무, 움푹 들어간 곳 또는 정확한 주차 공간)을 참조하는 데 그다지 좋지 않다. 기존의 글로벌 시스템과 기존 거리 주소의 한계는 인간이 디지털 디바이스 없이 펜과 종이 지도로 사용했을 때 에는 문제가 되지 않았지만, 이들은 오늘날의 디지털 디바이스, 시각적 디스플레이, 컴퓨터 및 기타 디바이스 통신 및/또는 내비게이션과 함께 인간이 사용하기에는 부적절하고 비효율적이다. 미세 위치를 식별하고 전달하 기 위한 더 나은 시스템의 부족은 새로운 기술 및 디바이스의 채택 및 사용을 방해하고, 미세 위치 빅 데이터를 캡처, 저장, 선별, 관리 및 분석하기 위해 인간 및/또는 기계 간의 실시간 미세 위치(\"RTML\") 지리 공간 참조 및 관련 정보 및 서비스뿐만 아니라 RTML 데이터 및 통신 구조를 위한 강력하고 효율적이며 정밀한 새로운 디지 털 인프라가 크게 필요하다. 지난 몇 년 동안 자율 주행 차량(AV), 인공 지능(AI), 기계 학습(ML), 증강 현실(AR), 가상 현실(VR), 드론, 로 봇, 및 이동, 배달, 자산 관리를 위한 다른 디바이스 및 유사 시스템(개별적으로 \"자율 주행 디바이스\" 또는 \"AD\" 및 통칭하여 \"자율 주행 디바이스\" 또는 \"AD\")을 포함하여 인간, 차량 및 기타 디바이스 지원 내비게이션 및 길 찾기를 위한 새로운 기술과 숫자와 기능 디바이스의 엄청난 성장이 있었다. 현재 글로벌 시스템은 고도로 훈련되고 숙련된 엔지니어, 프로그래머 및 운영자와 정교한 디바이스 및 기계에 의해 사용될 수 있지만, 이들은 문서, 이메일, 텍스트 메시지, 스프레드시트, 데이터베이스 및 기타 컴퓨터 프로그램과 문서를 위한 일상적인 인간 사용과 음성 및 기타 인간-기계 인터페이스에서는 비참하게 실패한다. 현재 미세 위치를 즉시 식별하고 파악하고 전달하는 간단하고 짧고 효과적인 방법은 없다. SoFi 경기장 주차장 의 어디에 차를 주차했는지 또는 음식 배달을 원하는 사용자가 어디에 있는지에 대한 질문에 \"그래, 우리는 서 경 117도 34분 12.73초, 북위 33도 12분 47.32초에 주차했어!\"라고 응답하는 사용자의 어려움을 상상해 보자. 그리고 오늘날 이용할 수 있는 짧고 단순하며 이산적이고 정밀한 2차원 또는 3차원 미세 위치 참조를 가능하게 하는 더 나은 대안도 오늘날 없다. 인간은 부정확하고 모호한 길고 구어체적인 설명에 속한다. 디지털 지도에서 위치를 식별하고(예를 들어, 핀 떨어뜨리기) 이 '핀'을 다른 사람과 공유하는 것이 가능하지만 핀 공유는 일반 적으로 이질적인 디바이스 및 시스템에서 작동하지 않고, 이러한 핀에 대한 기본 참조는 보통 길고 번거로운 위 도/경도 좌표이다. 위도/경도는 고도 또는 층수 정보를 제공하지 않는다. 또한, 다른 사람, 기계, 메시지 또는 음성 지원 디바이스 및 서비스를 사용하여 구두 또는 텍스트로 하나 이상의 위치를 식별, 전달 및 구별할 수 있 는 효과적인 시스템이 없다. 인간은 일반적으로 위치 참조를 알려진 영역, 거리, 관심 지점 등의 이름, 일반 랜드마크와 연관시키고 일반적 으로 기본 좌표 또는 방향(N, S, E, W 또는 NW, NE, SW 또는 SE) 및 거리를 마일, 피트, 킬로미터 또는 미터로 참조한다. 더 나은 대안이 없기 때문에 인간은 길고 주관적이며 비표준화되고 모호하고 구어체이며 매우 가변적인 미세 위치 및 디바이스 참조를 사용하는 것으로 분류된다. 이것은 인간과 기계에 최적이 아니고 부적절하며, 더 나은 시스템이 절실히 필요하다. 예를 들어, 알 수 없는 위치에 있는 사람은 전통적인 기존 거리 또는 우편 주소(예를 들어, 4590 MacArthur Blvd., Newport Beach, CA)를 사용할 수 있지만, 심지어 전체 재산 수준에서 그리고 확실히 알려진 위치나 재산 안, 주변 또는 근처의 위치에 대한 미세 위치 수준에서 거리 주소에는 수많 은 고유한 문제가 있다. 이것은 특히 지상 높이(AGL), 고도, 층 및 기타 3D 참조를 포함하는 3차원 미세 위치 참조에 대한 증가하는 요구에서 그러하다. 나아가, \"4590 MacArthur Blvd. Newport Beach, CA, 92660\"의 주소 또는 참조는 이 위치에 있는 건물, 건물의 중앙, 앞문 또는 뒷문, 거리로부터 공공 또는 사설 주차장으로 가는 입구, 이와 관련된 7 에이커의 구획 또는 건물 위, 근처 또는 안의 사무실 또는 다른 위치 중 임의의 것에 있는 가? 사용자와 기계는 특정 '거리 주소' 상에, 내에 또는 근처에 있는 미세 위치를 어떻게 참조하거나 통신하는 가? 다른 예로는 거리로부터 주차장으로의 진입 지점, 다양한 장애인, 승합차 공유 또는 기타 특수 주차 구역, 주차 구조물 또는 건물의 입구, 쓰레기 보관 구역, 특정 자동차가 점유하고 있는 정확한 주차 공간, EV 충전소, 특정 사무실, 문, 건물의 하위 구성 요소 등)를 포함한다. 구조화된 미세 위치 참조를 위한 임의의 방법의 부재와 전통적인 기존 거리 주소의 정규화 부족은 또 다른 문제 이자 지리학자, 매핑 및 GIS 소프트웨어 엔지니어의 엄청난 노력의 원천이다. 기존 거리 주소와 관련 미세 위치 는 일반적으로 디폴트로 이러한 주소와 위치를 사람이 참조하거나, 음성 처리하거나, 심지어 매일 수많은 디바 이스 및 소프트웨어 프로그램에 입력함으로써 수많은 다른 방식으로 종종 표현된다. 다양한 수준의 성공으로 전 세계적으로 전통적인 기존 거리 주소를 명확하게 하고 선별하는 데 전념하는 중요한 산업, 학문 분야 및 비즈니 스가 있다. 그러나, 이러한 산업은 증가하는 2D 및 3D 미세 위치 요구 사항과 문제를 해결하기 시작하지 않았으 며, 현재의 기본 인프라는 차세대 RTML 서비스, 통신 및 정보 요구 사항을 지원하기에 부적절하다. 따라서, 오 늘날 인간이 쉽고 빠른 인간 인식 및 내비게이션에 필요하거나 요구되는 정밀도, 간결성 및 명확성 수준으로 인 간이 미세 위치를 주소 확인, 참조 및 전달할 수 있는 시스템이 없다. 마지막으로, 이는 AI 및 음성 지원 및 기 타 디바이스와 시스템을 갖춘 성장하는 다국어 음성 환경에서 특히 그렇다. GPS와 관련 데이터베이스의 개발로 사람과 디바이스가 RTML 수준의 실외에서 탐색하는 방식이 변경되었지만 로 컬 수준에서 로컬 위치 확인 시스템(\"LPS\")이라고 하는 수많은 새로운 미세 위치 파악 기술 및 시스템이 있다. LPS는 캠퍼스, 프로젝트, 건물 또는 기타 작은 특징부 또는 구조물(일반적으로 미세 위치) 안과 주변의 실내 및 /또는 문 근처 위치에 더 중점을 두고, 층, 고도, 디바이스 및 무한히 정확한 위치로 확장될 수 있다. LPS는 포 인트 클라우드를 생성하거나 사용하여 1cm 정밀도로 디지털 가상 트윈(virtual twin)을 생성할 수 있다. 그러나, 극히 정밀한 LPS 없이도 인간은 디지털 또는 기타 지도, 이미지, 비디오 및 폰 스크린을 볼 수 있고, 거의 무한한 정밀도로 이 지도에서 미세 위치를 시각적으로 또는 다른 방식으로 식별할 수 있다. 현재 부족한 것은 이러한 기술이 제공하는 정밀도에 상응하는 표준화된 방식으로 정확한 미세 위치 참조를 식별, 언어화, 음성화 및 전달하는 방법이다. 예를 들어, 일반 iPhone은 현재 다른 LPS 시스템을 참조하지 않고 몇 미터 이내의 실외 위치 정보만을 제공할 수 있으며, 이러한 시스템은 현재 훨씬 더 정밀하거나 3차원적인 참 조를 제공하지 않는다. 그럼에도 불구하고, 사용자는 하나 이상의 매우 정밀한 미세 위치 또는 방을 확대하고, 보고, 정확히 찾아 미세 위치 또는 디바이스를 식별할 수 있다. 그러나, 거의 모든 다른 디바이스 및 서비스로 해석되거나 사용될 수 있는 임의의 구조화된 방식으로 정확한 미세 위치를 기록, 입력, 저장 또는 전달할 수 있 는 간단하고 간결하며 이산적이고 명확한 방법은 없다. 마지막으로, 많은 비디오, 증강 현실(AR) 및 가상 현실 (VR) 시스템이 실제 세계와 가상 세계의 규모로 RTML 이미지, 비디오 및 정보를 캡처하고 있다(통칭하여 이러한 기술, 디바이스 및 패러다임은 본 명세서에서 통칭하여 \"메타버스\"라고 한다). 그러나, 메타버스는 미세 위치 정보를 캡처, 선별, 관리 및 배포하는 이미지, 디지털 가상 트윈, 레이더, 라이다, 비콘, 초광대역 LPS 시스템 측정 및 기타 기술에 의해 구동되지만, 이러한 기술과 시스템 중 어느 것도 현재 텍스트 및 음성 RTML 전달을 위한 실행 가능한 방법을 제공하지 않는다. 필요한 것은 1) 미세 위치 참조, 내비게이션 및 서비스를 위한 더 작은 영역을 정의하고; 2) 기계와 인간이 이 러한 영역을 3차원(x, y 및 z)에서 간단하고 짧고 명확한 인간 규모 RTML 참조와 연관시킬 수 있고; 3) 사람과 기계 간에 이러한 참조를 실시간으로 공유할 수 있고; 및/또는 4) 인간과 기계가 이러한 미세 위치를 보고, 이 해하고, 신속하고 명확하게 전달할 수 있도록 하는 새로운 시스템과 방법이다. 또한 시스템과 방법이 단순화되 고 인간 친화적이며 표준화된 참조뿐만 아니라 RTML 지리 공간 데이터의 선형 대 비선형 지리 공간 검색이 가능 하도록 설계된 새로운 데이터 구조를 통해 보다 효율적인 기계 학습, 지리 분석, 빅 데이터 및 비즈니스 지능을"}
{"patent_id": "10-2023-7023277", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "위해 다양한 크기의 축약되고 구조화된 핀포인트 및 영역 참조를 모두 가능하게 하는 것이 유리할 것이다. 발명의 내용 본 출원은 통칭하여 MLID 및 RTML 참조라고 하고 개별적으로는 \"MLID\" 또는 \"RTML 참조\"라고 하는 매우 짧고 이 산적인 숫자, 영숫자 및/또는 영문자 미세 위치 식별자, 이름, 숫자, 이름/숫자 조합, 주소, 참조 또는 단축 코 드를 생성하고 가능하게 하는 디바이스, 시스템 및 방법에 관한 것이다. MLID는 또한 때때로 본 명세서에서 1M 또는 1-미터 숫자라고도 한다. 중요한 것은 MLID가 생성되고, 구조화되고, 사용되고 개별 대상 영역과 연관된다 는 점이다. 통칭하여 이러한 잘 정의된 영역 또는 일반적인 영역은 \"대상 영역\" 또는 \"SA\"라고 한다. AI와 기타 방법을 사용하여 MLID를 관련 대상 영역에 연관시킴으로써 인간과 기계는 정확한 미세 위치를 더 빠르고 정확하 면서도 간결하게 식별, 참조 및 통신하고 미세 위치 정보, 서비스 및 통신에 액세스할 수 있다. MLID 및 RTML 참조는 인간이 거의 모든 디바이스, 시스템, 언어, 소프트웨어 및 플랫폼에 걸쳐 사용하기 쉬운 미세 위치 참조 를 위한 근본적으로 새로운 시스템을 제공한다. 시스템의 주요 목표는 인간을 위한 단순성, 간결성, 정밀성, 상 호 운용성 및 유연성이다. 그러나, 시스템은 또한 보다 효율적이고 효과적인 인간 인터페이스 및 통신을 용이하 게 하는 추가적인 이점 때문에 인간 인터페이스뿐만 아니라 인간 인터페이스와 AI에 의존하고 내부의 기계 및 컴퓨터 프로그래밍, AI, AR, ML, 및 VR, 및 AD에 상당한 장점을 제공한다. 일례에 따르면, 인간 대 인간, 인간 대 디바이스 및 디바이스 대 디바이스의 통신, 입력, 출력 및 디스플레이에 사용되는 하나 이상의 영숫자 단축 코드(alphanumeric shortcode) 미세 위치 식별자(micro-location identifier) 중 하나를 사용하여 미세 위치를 식별하고 참조하기 위한 시스템으로서, 사용자 인터페이스와 디스 플레이를 포함하는 전자 디바이스; 및 하나 이상의 프로세서를 포함하고, 프로세서는, 사용자가 대상 영역을 참 조하여 하나 이상의 미세 위치 식별자를 전자 디바이스의 사용자 인터페이스를 사용하여 엔터, 입력, 발성 (speak), 주시(see), 선택 또는 통신할 수 있게 하고; 대상 영역과 할당된 참조 대상 영역을 결정하고; 대상 영 역을 참조하여 미세 위치 식별자를 분석하고 사용하도록 구성된, 미세 위치를 식별하고 참조하기 위한 시스템이 제공된다. 다른 예에 따르면, 인간 대 인간, 인간 대 디바이스 및 디바이스 대 디바이스의 통신, 입력, 출력 및 디스플레 이에 사용되는 하나 이상의 영숫자 단축 코드 미세 위치 식별자 중 하나를 사용하여 미세 위치를 식별하고 참조 하기 위한 방법으로서, 사용자가 대상 영역을 참조하여 하나 이상의 미세 위치 식별자를 전자 디바이스의 인터 페이스를 사용하여 엔터, 입력, 발성, 주시, 선택 또는 통신할 수 있게 하는 단계; 대상 영역과 할당된 참조 대 상 영역을 결정하는 단계; 및 하나 이상의 프로세서가 대상 영역을 참조하여 미세 위치 식별자를 분석하고 사용 하는 단계를 포함하는, 미세 위치를 식별하고 참조하기 위한 방법이 제공된다. 또 다른 예에 따르면, 사람 대 사람, 사람 대 디바이스 및 디바이스 대 디바이스의 식별, 지정, 통신, 입력, 출 력 및 디스플레이를 위해 미세 위치 식별자에 표시되는 자릿수가 제1 위치에 대해 하나 이상의 미세 위치를 이 산적으로 식별하는 데 필요한 최소 자릿수가 되도록 두 개 이상의 영숫자 단축 코드 미세 위치 식별자를 사용하 여 제1 위치를 참조하여 하나 이상의 미세 위치를 식별하고 참조하기 위한 시스템으로서, 사용자 인터페이스와 디스플레이를 포함하는 전자 디바이스; 및 하나 이상의 프로세서를 포함하고, 프로세서는, 표시되는 최소 자릿 수가 좌표계와 제3 위치로부터의 거리에 기초하여 필요한 최소 자릿수가 되도록 알려진 위치로부터의 거리에 기 초하여 2차원 xy 좌표계의 최하위 자릿수를 전자 디바이스의 디스플레이 상에 표시하고; 사용자가 대상 영역을 참조하여 하나 이상의 미세 위치 식별자를 전자 디바이스의 인터페이스를 사용하여 엔터, 입력, 발성, 주시 또 는 선택할 수 있게 하고; 대상 영역을 참조하여 미세 위치 식별자를 분석하고 사용하도록 구성된, 시스템이 제 공된다. 또 다른 예에 따르면, 사람 대 사람, 사람 대 디바이스 및 디바이스 대 디바이스의 식별, 지정, 통신, 입력, 출 력 및 디스플레이를 위해 미세 위치 식별자에 표시되는 자릿수가 제1 위치에 대해 하나 이상의 미세 위치를 이 산적으로 식별하는 데 필요한 최소 자릿수가 되도록 두 개 이상의 영숫자 단축 코드 미세 위치 식별자를 사용하 여 제1 위치를 참조하여 하나 이상의 미세 위치를 식별하고 참조하기 위한 방법으로서, 표시되는 최소 자릿수가 좌표계 및 제3 위치로부터의 거리에 기초하여 필요한 최소 자릿수가 되도록 알려진 위치로부터의 거리에 기초하 여 2차원 xy 좌표계의 최하위 자릿수를 전자 디바이스의 디스플레이 상에 표시하는 단계; 사용자가 대상 영역을 참조하여 하나 이상의 미세 위치 식별자를 전자 디바이스의 인터페이스를 사용하여 엔터, 입력, 발성, 주시 또 는 선택할 수 있게 하는 단계; 및 하나 이상의 프로세서가 대상 영역을 참조하여 미세 위치 식별자를 분석하고 사용하는 단계를 포함하는, 하나 이상의 미세 위치를 식별하고 참조하기 위한 방법이 제공된다. 본 발명의 다른 양태 및 특징은 첨부된 도면과 함께 취해진 다음의 설명을 고려함으로써 명백해질 것이다."}
{"patent_id": "10-2023-7023277", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "예를 설명하기 전에, 본 발명은 설명된 특정 실시예로 제한되지 않고 물론 변할 수 있는 것으로 이해된다. 또한, 본 발명의 범위는 첨부된 청구범위에 의해서만 제한될 것이기 때문에, 본 명세서에서 사용된 용어는 단지 특정 예를 설명하기 위한 것일 뿐 본 발명을 제한하려고 의도된 것이 아닌 것으로 이해된다. 값의 범위가 제공되는 경우, 문맥에서 달리 명시하지 않는 한, 하한 단위의 10분의 1까지 이 범위의 상한과 하 한 사이의 각 중간 값도 구체적으로 개시된 것으로 이해된다. 임의의 명시된 값 또는 명시된 범위 내의 중간 값 과 그 명시된 범위 내의 임의의 다른 명시된 또는 중간 값 사이의 각각의 더 작은 범위는 본 발명 내에 포함된 다. 이들 더 작은 범위의 상한과 하한은 독립적으로 이 범위에 포함되거나 제외될 수 있고, 더 작은 범위에 어 느 한 쪽이 포함되거나, 어느 쪽도 포함되지 않거나 양쪽 한계값이 포함되는 각각의 범위는 또한 명시된 범위에 서 임의의 구체적으로 배제된 한계에 따라 본 발명 내에 포함된다. 명시된 범위가 한계 중 하나 또는 모두를 포 함하는 경우, 포함된 한계 중 하나 또는 모두를 제외한 범위도 본 발명에 포함된다. 달리 정의되지 않는 한, 본 명세서에 사용된 모든 기술적 및 과학적 용어는 본 발명이 속하는 기술 분야의 통상 의 기술자가 일반적으로 이해하는 것과 동일한 의미를 갖는다. 본 명세서에 설명된 것과 유사하거나 등가인 임 의의 방법 및 물질이 본 발명의 실시 또는 시험에 사용될 수 있지만, 일부 잠재적이고 예시적인 방법 및 물질이 이제 설명된다. 본 명세서 및 첨부된 청구범위에서 사용된 단수 형태의 요소와 \"상기\" 요소는 문맥상 명백하게 달리 지시하지 않는 한, 복수의 요소를 포함한다는 점에 유의해야 한다. 따라서, 예를 들어 \"화합물\"이라는 언급은 복수의 이 러한 화합물을 포함하고, \"중합체\"라는 언급은 하나 이상의 중합체와 당업자에게 알려진 등가물의 언급을 포함 하는 등으로 이해된다. 본 명세서에 설명된 시스템 및 방법은 미세 위치 수준에서 위치의 작은 핵 요소로 시작하여 근본적으로 새로운 접근 방식을 제공할 수 있다. 기존의 모든 글로벌 시스템은 글로벌 시스템으로 시작하고 본질적으로 더 많은 자 릿수를 추가하여 더 높은 세분성 및 정밀도를 달성하기 위해 하향식 접근 방식을 사용하지만, 본 발명의 시스템 및 방법은 상향식 접근 방식으로 이러한 접근 방식과 반대이며, 이에 의해 미세 위치는 사용, 컨텍스트 또는 필 요에 따라 변할 수 있는 일반적으로 매우 작은 특정 영역 내에서 고유한 매우 짧고 고유한 MLID 참조로 제공된 다. 이 짧은 MLID 참조는 대상 영역이 커짐에 따라 고유성을 유지하기 위해 필요에 따라 증가될 수 있지만 일반 적으로 임의의 주어진 또는 관련 대상 영역 또는 사용에 필요한 범위까지만 증가될 수 있다. 설명을 위해, 예를 들어 주어진 주택, 아파트 또는 기타 건물 주변의 100 x 100-야드 영역의 작은 영역 내에서만 고유한 1 x 1-야 드 영역(예를 들어, 12.83)에 대한 2D 미세 위치 참조는 그럼에도 불구하고 임의의 이러한 아파트, 거주지 또는 건물 안팎의 대부분의 필요와 사용에 적합하다. 애리조나주 피닉스에 있는 주택 근처의 12.83 MLID라는 언급은 또한 프랑스 파리에 있는 주택 근처의 미세 위치를 참조하는 것과 관련이 있을 것 같지 않다. 이 새로운 상향식 접근 방식은 알려지거나 결정 가능한 대상 영역에 대한 대부분의 미세 위치 사용 및 시스템에 대해 극히 짧지만 고유하고 개별적인 MLID를 가능하게 한다. 이 시스템은 매우 짧은 고유한 MLID(일반적으로 다양한 크기 및 범위의 영역과 관련된 2 내지 8 문자/자릿수)로 다양한 정밀도 및 범위의 미세 위치 참조를 참조하거나 표시할 수 있다. 이러한 영역에는 a) 구체적으로 명명되 거나 연관된 관련 영역, 또는 b) 그럼에도 불구하고 MLID가 관련 영역, 거리 또는 사용 사례와 별개인 방식으로 유도, 구성 및 선별된 영역이 포함되지만 이로 제한되지 않는다. SA에 이름이 지정되고 특정 이름에 대한 \"이름 +숫자\"(\"NaNo\") MLID 참조에서 MLID와 결합하거나, 식별된 지역화되거나 기존 명명된 지리적 영역이 사용될 수 있지만, 시스템은 또한 MLID가 정확한 RTML 위치, 디바이스 등을 효과적으로 전달하는 것을 보장하기 위해 AI 및 기타 방법을 사용하여 MLID 참조를 알려지거나 확인할 수 있는 다른 정보와 결합시킴으로써 NaNo 조합 없이 사용할 수도 있다. 나아가, 공식적으로 이름이 지정된 SA는 MLID를 명확하게 할 필요가 없지만 MLID는 종종 많 은 MLID 참조의 지배적인 구성 요소가 되는 데 도움이 되고 그렇게 될 가능성이 있다. 나아가, 시스템은 특정SA 및 MLID의 소유자/생성자가 문자 및/또는 숫자의 다른 방법 또는 배열에 기초하여 SA(각각 \"대상 영역에의 참조\" 또는 \"RSA\")에 대한 하나 이상의 관련 RTML 참조 시스템을 정의할 수 있게 한다. 동일하게 명명된 SA의 소유자는 다수일 수 있고(문맥상 명확히 함이 필요함), 단일 SA는 또한 임의의 파생 RSA를 포함하여 SA의 사용 을 수정하거나 공유하기 위해 다수의 소유자의 승인이 (동의하는 방식으로) 필요한 방식으로 다수의 소유자가 공동으로 소유할 수 있다. 본 발명의 시스템 및 방법은 사용자와 기계가 SA와 연관된 미세 위치에 대한 RTML 참조에 대한 MLID를 명확하게 참조할 수 있게 할 수 있으며, 모든 미세 위치는 다양한 방식으로 하나 이상의 SA와 연관될 수 있다. SA에 대한 RSA는 일반적으로 SA 내에서 MLID가 유효할 수 있도록 SA의 전체 범위를 포괄하지만 반드시 포괄해야 하는 것은 아니다. 임의의 주어진 RSA에 대한 RTML 참조 시스템은 1) 소유자/생성자 또는 시스템에 의해 선택된 고정된 고유한 SA 및 위치 특정 자기 중심적, 즉 사용자 또는 위치 중심, 좌표, 위치 참조 시스템, 2) 동종 중심(allocentric) 글 로벌 시스템에 기초하고 이와 일치하고/하거나 이를 조정하는 시스템, 3) 계층적, 순차적, 하이브리드, 세그먼 트화 또는 기타 구조화된 이름 지정, 번호 지정 및 참조 시스템, 4) 특정 미세 위치에 할당된 MLID, 및/또는 5) 하나 이상의 대상 영역 또는 대상 영역에 대한 전술된 방법의 하이브리드 조합을 포함하지만 이로 제한되지 않 는, 예를 들어, 도 4에 참조된 것과 같이 다양한 방법으로 결정될 수 있다. 좌표계에 기초한 MLID는 일반적으로 다양한 간격 측정에 기초하거나 이와 일치하는 일련의 xy 또는 계층적 숫자 쌍이지만, RSA는 또한 좌표 참조(예를 들어, xy 또는 계층적) 및 구체적으로 지정되거나 할당된 식별자의 조합 을 더 포함할 수 있다. 이러한 경우에, RSA는 RSA 알고리즘에 따라 짝수의 자릿수를 가진 MLID가 사용되는 할당 된 미세 위치를 나타내기 위해 홀수 자릿수를 가진 MLID를 사용하도록 정의될 수 있다. 나아가, 많은 예에서 MLID는 1 미터 또는 높은 정밀도를 갖기 때문에, 할당된 MLID에 짝수 자릿수가 포함되어 있음에도 불구하고 홀 수 및 짝수 할당된 MLID를 모두 사용하도록 RSA를 설계할 수 있으며, 그렇지 않은 경우 좌표에 할당되는 좌표 MLID 참조는 인접한 좌표를 자동으로 참조할 수 있다. 예를 들어, 건물 소유자가 건물에 대한 RSA를 4자릿수 xy 좌표로 정의하지만 특정 방에 층 및 방 번호와 일치하도록 4자리 숫자 MLID(예를 들어, 3층 412호실은 3412호) 를 할당하기를 원하는 경우, 그럼에도 불구하고 RTML 시스템은 3412에서 3413 또는 일부 다른 인접한 미세 위치 에 대한 좌표를 할당할 수 있다. RSA 소유자는 MLID를 할당하거나 결정하기 위해 방법의 임의의 조합을 유연하게 사용할 수 있도록 임의의 특정 SA에 대한 RSA의 기반을 정의할 수 있는 유연성을 가진다. 임의의 주어진 SA에 대한 RSA 및 MLID에는 해수면 위 의 고도 등을 포함하는 3차원 참조가 포함될 수 있다는 점을 이해하는 것이 중요하다. 중요한 것은 건물 및 기 타 구조물의 경우 SA, RSA 및 MLID에는 종종 건물의 층 또는 기타 수준에 기초하여 추가 구조 정의가 필요하다 는 것이다. 미세 위치가 지상 48피트 위에 있는 것을 알아도 이것이 대상 미세 위치가 위치된 건물의 층에 대한 적절한 정보를 제공하지도 않고 MLID로 표시된 특정 미세 위치를 탐색하고 길을 찾는 방법을 제공하지도 않는다. MLID는 또한 이 미세 위치로 또는 이 미세 위치 근처로 긴급, 배달 또는 기타 서비스를 촉진하기 위해 이러한 RTML 정보에 대한 액세스를 제공할 수 있다. 이러한 유연성, 데이터 구조, 사용자 인터페이스, 사용자 경험, 시각적 프레젠테이션 및 통신에도 불구하고, 액 세스 API 및 기타 알고리즘과 방법론은 컴퓨터, 데이터베이스, 데이터 분석 및 기계를 위한 다양한 계산(예를 들어, 거리 및 방위, 근접도, 간격 측정 등), 검색, 구조 데이터 및 기타 기능을 위해서 뿐만 아니라 사람과 기 계 모두를 위해 표준화되고 단순화되도록 설계되었다. 특정 SA에 대한 선택 사항인 이름은 사람에게 친숙한 개별 식별자(예를 들어, NBCA(Newport Beach California))이거나, 또는 일반적으로 4590 MacArthur Blvd, Newport Beach, CA, 92660과 같은 기존 거리 주소 로 참조되거나 또는 연관된 x 에이커 구획에 대한 NBCA.4590MacB이거나, 또는 이 주소의 건물 내부 특정 회의실 에 대한 NBCA.4590MacB.ConfRm5일 수 있다. 그러나, RTML 시스템은 많은 경우 특정 SA의 필요성을 제거할 수 있 는 AI을 포함한 다양한 방법론을 사용하여 MLID 미세 위치와 주어진 영역에 대한 다양한 SA를 연관시킬 수 있으 므로 이러한 선택적 식별자를 사용할 필요가 없다. 예를 들어, \"NBCA.4590MacB\"와 연관된 MLID \"734.123\"은 연관되고 할당된 SA일 수도 있고 아닐 수도 있는 NBCA.4590MacB 환경 내의 정확한 미세 위치를 식별할 수 있다. 나아가, 다른 곳에서 논의된 바와 같이, MLID 734.123은 글로벌 시스템, 로컬화된 또는 2D, 3D 또는 기타 맞춤 좌표 시스템에 의해 유도될 수 있고, 또는 SA 와 관련하여 특정 지정된 미세 위치 또는 디바이스에 할당되거나 지정될 수 있다. 중요한 것은 미리 결정된 SA 및 RSA는 선택 사항이고 인간 및/또는 기계 사용을 위해 정의되고 최적화될 수 있 다는 것이다. AI 및 ML를 통해 SA, RSA를 사용에 따라 분석, 상호 관련시켜 더 큰 공간 영역 구조 패턴을 이해, 조정 및 개선할 수 있다. 따라서 SA 및 RSA 정의 및 환경은 '퍼지' 또는 '탄력적' 검색, 자연어 처리(\"NLP\") 및 AI를 용이하게 하는 동시에 명확하고 정확한 RTML MLID 미세 위치 참조를 제공한다. 전체 RTML 시스템에는 모든 또는 특정 사용자에 대한 선택적 가시성 및 관련 공간 참조 시스템을 포함하여 구체 적으로 명명되거나 지정된 모든 SA 및 RSA 및 관련 메타데이터에 대한 레지스트리 및 클리어링하우스가 포함된 다. 수많은 지리 공간 MLID 및 MLID 참조 시스템이 있다는 사실에도 불구하고, MLID는 모두 일반적으로 유사하 고 친숙한 표준화된 인간 기계 인터페이스(HMI) 및 시각적 디스플레이를 사용하여 디바이스 간 상호 운용성을 용이하게 하고, 일반적으로 SA 및 RSA의 크기 또는 기타 관련 영역 및 MLID 사용 컨텍스트에 따라 몇 개의 숫자 또는 영숫자 자리를 용이하게 한다. 따라서, 인간 인터페이스, 인지, 인식 및 단순성 관점에서 MLID의 일관성은 인간의 이해 또는 이질적인 시스템 학습의 필요성을 피한다. 통신용 전화 번호 및 인터넷용 도메인 이름과 마찬 가지로 MLID는 바로 작동하고 이를 통해 인간이 처음부터 서로 간에 그리고 기계와 간결하고 정확하며 명확하게 미세 위치를 참조할 수 있다. SA, 이름 및 MLID는 일반적으로 현지 언어(上海 대 상하이) 또는 인간 규모 근접도를 사용하여 랜드마크, 즉 이 름난 장소에 기초하여 위치, 지리 참조 및 길 찾기에 대한 인간의 개념에 본질적으로 부합한다. 나아가, RTML 시스템은 미세 위치를 참조하는 데 필요한 간결함, 콤팩트함, 제한된 단어 및 영숫자 문자를 강조하기 때문에 다국어 통신 및 사용을 용이하게 한다. 예를 들어, 상하이 4762.8812 및 上海 4762.8812(중국어 표시)는 상하이 근처의 동일한 미세 위치에 대해 동일한 MLID를 제공하며, SA의 일반 이름은 길고 번거로운 기존 거리 주소 및 다수의 언어에 걸친 기타 구어체 설명보다 다양한 언어에 걸쳐 더 쉽게 사용될 수 있는 소수의 숫자 문자와 결 합된다. 따라서, MLID는 다양한 디바이스, 서비스, 언어 및 방언에 걸쳐 RTML 미세 위치 참조를 크게 향상시킨 다. 그러나, 설계상 MLID는 본질적으로 다국어이며 다양한 언어 및 참조와 함께 사용될 수도 있다. 외국 여행이 흔 한 세상에서 언어 제한은 종종 위치 참조 및 통신을 방해한다. 별칭 SA 및 MLID도 다수의 언어로 정의 및/또는 사용되어, 제한된 문자와 자릿자, 극히 짧고 일반적으로 배타적이거나 주로 숫자인 MLID로 전 세계적으로 작동 하는 다국어의 정확한 RTML 위치 참조 솔루션을 용이하게 하여, 보조 영역 및 지점에 대한 MLID를 오늘날에는 불가능한 정밀성, 간결성 및 보안을 모두 갖춘 다수의 언어에 걸쳐 전 세계적으로 쉽게 식별할 수 있도록 한다. 또한 보다 세분화된 RTML 정보를 캡처, 액세스 및 사용하기 위한 LPS 시스템 및 방법이 필요하다. 현재 비디오 및 포인트 클라우드 시스템은 건물 X의 스위트(Suite) 542의 5층에 7개의 문이 있음을 알거나 캡처할 수 있으며, 이미지, 포인트 클라우드 또는 기타 유사한 기계 데이터 구조에서 센티미터 정밀도로 모든 문의 정확한 위치를 식별할 수 있다. 그러나, 포인트 클라우드와 비디오는 현재 이러한 문에 대해 축약되고 간단한 사람이 읽을 수 있는 인터페이스 또는 RTML MLID를 캡처 및 제공하지 않으며, 모든 문 뒤에 있는 것에 대한 RTML 정보 에 대한 액세스도 제공하지 않는다. MLID를 통해 사용자는 음성 인터페이스에 대한 미세 위치를 식별 및 참조할 수 있고, MLID를 통해 이름, 키워드 및 기타 참조를 수립할 수 있다. 이 RTML 정보는 구조화된 및 비-구조화되 고 보통 동적이다. 그런 다음 MLID를 사용하여 미세 위치와 디바이스를 참조할 뿐만 아니라 미세 위치와 디바이 스에 대한 정보에 액세스하고 미세 위치와 디바이스와 상호 작용할 수 있다. 나아가, LPS 이미지, 라이다 또는 기타 디바이스는 벽에 있는 조명이나 기타 스위치를 캡처할 수 있지만 이들은 스위치가 제어하는 정보에 대한 보편적인 액세스를 캡처하거나 제공하지 못 한다. RTML 시스템 및 MLID는 대부분이 SA와 관련이 없는 글로벌 시 스템을 이용할 필요 없이 관련된 SA에 대한 임의의 이러한 미세 위치(이 경우에 스위치 디바이스)에 대한 RTML 정보의 식별, 참조 및 액세스를 용이하게 한다. 따라서, SA, RSA 및 MLID는 미세 위치 수준에서 사용하도록 최 적화될 수 있다. 마지막으로, VR 또는 AR 인터페이스가 없고 이러한 디바이스와 인터페이스가 있더라도, 현재 지리 참조 시스템은 인간에게 친숙하지 않고, 본 발명의 시스템 및 방법은 AR, VR 및 디지털 콘텐츠의 새로운 메타버스에 대한 이 RTML 정보의 HMI, 인간 및 AI 인지, 상호 작용, 통신 및 사용을 가능하게 하고 실질적으로 개선하고 돕고 지원할 수 있다. 주어진 SA에 대한 MLID를 가능하게 하는 시스템 및 방법의 일 양태는 임의의 주어진 SA 크기에 대해 원하는 수 준의 2D, 3D 또는 기타 좌표 정밀도를 제공하는 데 필요한 최하위 자릿수(\"LSD\")를 이용하는 기능이다. 예를 들 어 RSA가 글로벌 UTM이고 SA의 최대 범위가 25 미터이고 원하는 정밀도가 1 미터인 경우, 2D MLID는 SA 내에서 알려진 가능한 모든 MLID가 고유하고 이산 참조를 제공하는 것을 보장하도록 4자릿수만 있으면 된다. RSA가 위 도/경도이고 원하는 정밀도가 약 1 야드이고 SA가 적도에서 약 50 야드 범위인 경우, 그런 다음 2D MLID는 주어 진 SA의 모든 MLID가 고유한 것을 보장하도록 4자릿수만 있으면 된다. 예를 들어 미세 위치의 위도가-117.859254이고 경도가 33.665333이고 대상 영역의 범위가 50야드 미만이라고 가정한다. 위도/경도 기반 RSA의 일례에서, MLID는 전술된 것의 마지막 3개의 최하위 자릿수 또는 254.333으로부터 유도될 수 있다. 그리고 동일 한 SA의 부근 미세 위치는 243.340으로 참조될 수 있다. RTML 시스템은 MLID를 경도 -117.859 및 위도 33.665 근처의 알려지거나 결정 가능한 SA와 연관시키기 때문에, 사용자가 길고 번거로운 위도 경도를 사용할 필요가 없고 MLID 254.333 또는 243.340을 사용하여 두 개의 근접한 위치를 참조할 수 있다. 유사하게, RTML 시스템의 모든 사용자는 위치에 대한 정보를 얻고, 기록하고, 데이터베이스나 스프레드시트에 저장하고, 텍스트, 이메일 을 보내거나 이를 다른 방법으로 전달할 수 있다. SA, RSA 및 MLID에 대한 변수 옵션 중 하나는 지리 공간 논리이다. 많은 경우에 MLID의 문자는 (전화 번호 시스 템과 유사하게) 작동하는 한, 관련이 없지만, 인간과 기계가 MLID 문자(주로 숫자)를 해석하고 정신적으로 지리 공간 관계를 생성하는 경우가 있을 것이다. 여기서 본 발명자는 1) 알려진 영역, 장소, 사물과 관련하여, 특히 글로벌 기본 방향(북쪽, 남쪽, 동쪽 및 서쪽) 및 배향과 관련하여 주어진 2D 또는 3D MLID를 xy 또는 xyz 좌표 와 연관시키는 인간의 능력(그리고 AI와 기타 기계는 아마도 인간이 생각하는 방식과 유사한 방식으로 처리할 것임) 및 2) 기계(그리고 때때로 일부 상황에서는 인간)가 계산, 검색, 체계적인 데이터 저장 및 분석, 구조, 면적 및 선형 간격 측정, 크기, 범위, 방위 등(이 중 일부의 예는 도 29 내지 도 32에 포함되어 있음)을 수행할 수 있도록 MLID 문자/숫자의 기본이 되는 다양한 계산, 알고리즘 및 관계를 가능하게 하는 공간, 관계 및 기타 특성을 MLID에 포함하도록 \"지리 공간 논리\"를 정의한다. 많은 경우에 RSA는 예를 들어, 2D xy 좌표계의 더 큰 숫자가 더 북쪽과 동쪽 지점에 대해 더 커지도록 지리 공간 논리를 가능하게 하도록 구조화되거나 사용된다. 따 라서, 지리 공간 논리는 MLID 734.815가 123.238의 북쪽과 동쪽에 있는 것을 보장한다. 특정 SA, RSA 및 MLID 에 대한 지리 공간 논리를 달성하려면 특수 시스템 및 프로세스가 필요하다. 또한 위도/경도에 기초하여 MLID가 지리 공간 논리를 유지하려면 최하위 자릿수를 더 추가해야 한다(이 경우에 9와 5는 9254.5333의 약간 더 큰 MLID를 생성한다)(이 경우에 이 위치는 서반구에 있고 더 동쪽 위치는 경도가 더 작기 때문에 지리 공간적 논리가 반전됨)는 것이 주목된다. 더 간단한 예는 1 미터의 원하는 2D 정밀도에 기초하여 다른 RSA에서 사용하는 메트릭 시스템 및 (실제와 달리) 자북극(magnetic north)과 거의 일치하는 100 미터 미만의 SA에 대해 100 x 100-미터 셀 내의 메트릭 기반 조정 시스템에 기초하여 자기 중심적 고객 SA 및 RSA로 설명될 수 있다. 이 예에서, 4자릿수 MLID는 100 x 100-미터 좌표계 내 10,000개의 1-미터 셀 중 임의의 셀에 대해 1-미터 정밀도를 제공하며, 이러한 MLID는 지리 공간 논 리를 유지한다. 즉, xy 형식에서 x 및 y와 연관된 더 큰 숫자를 가진 MLID는 더 작은 숫자를 가진 MLID의 북쪽 과 동쪽에 있다. 도 9 내지 도 13에 예시된 바와 같이 보다 상세한 프로세스의 필요성을 추가로 설명하기 위해, 동일한 SA에 대한 RSA가 USNG와 같은 글로벌 시스템에 기초하는 경우 SA가 100 x 100-미터 USNG 셀 내에 완전히 있는지 여부를 결정해야 한다. 만약 그런 경우 RSA는 4자릿수 MLID로 지리 공간 논리를 유지한다. 만약 그렇지 않은 경우 지리 공간 논리를 보장하기 위해 자릿수를 추가하여 RSA를 조정해야 한다. 모든 세부 사항을 설명하 지 않고 이 원하는 정밀도와 크기 SA에 대해, SA가 100 x 100-미터 USNG 셀 내에 완전히 있지 않다고 가정하면, MLID가 43.21인 미세 위치가 실제로 지리 공간 논리를 제공하지 않는 74.62의 MLID를 갖는 미세 위치의 북쪽과 동쪽에 있을 가능성이 있다. 이 예에서 지리 공간 논리를 달성하기 위해, RSA는 100-미터 미만의 범위에도 불구 하고 6자릿수를 포함하여 MLID가 774.662인 미세 위치의 북동쪽에 있는 미세 위치에 대한 843.721의 MLID가 원 하는 경우 지리 공간 논리를 달성하도록 정의되어야 한다. SA, RSA 및 MLID는 숫자가 표준화된 참조 시스템(예를 들어, USNG)에 기초하는 경우 임의의 위치 숫자 사이의 거리 방위 관계 때문에 임의의 2개 이상의 미세 위치 사이의 또는 이 미세 위치에 대한 거리, 방위, 면적 등을 계산 기능으로 신속하게 결정할 수 있는 방식으로 지리 공간 논리와 함께 또는 없이 구조화되고 할당될 수 있다. 예를 들어, 주어진 RSA에 대한 6자리 MLID가 1-미터 정밀도를 갖는 경우 345.176은 233.124의 동쪽으로 112 미터, 북쪽으로 52 미터이고, 두 위치 사이의 거리와 방향을 결정하기 위해 쉽게 계산될 수 있다. 나아가, 표준 거리와 방위는 테이블에 저장되거나, 알고리즘으로 계산될 수 있고, 다양한 기능을 통해 액세스될 수 있어 서, 다양한 대상 영역을 포함하는 다양한 표준화된 그리드 내의 임의의 두 지점 사이의 거리와 방향을 결정하기 위해 CPU를 많이 사용하는 위도/경도 계산이 더 이상 필요하지 않게 한다. 나아가 시스템은 근접도 검색, 거리 및 방향 결정(계산 또는 데이터베이스 조회)을 수행하거나, 저장, 검색 및 분석을 위해 대량의 지리 공간 데이 터를 구성 및 질의하기 위해 테이블 및 다양한 최적 조회를 쉽게 생성할 수 있게 한다. 마지막으로 지리 공간적 논리를 달성하려면 중요한 새로운 단계와 프로세스가 필요하지만, SA와 RSA를 정의할 때 주요 요소가 간결하고 MLID가 임의의 주어진 SA에 대해 고유하고 기능함을 보장하는 데 최소 자릿수를 이용 하는 것이 필요하도록 점점 더 많은 지리 공간 처리 및 시각화가 디바이스와 디스플레이에서 지원되거나 독점적으로 사용됨에 따라 지리 공간 논리가 관련되지 않을 수 있다. 유사하게, 본 명세서의 다른 곳에서 개시된 바와 같이, RSA는 임의의 주어진 SA에 대해 암호화, 할당 및/또는 랜덤한 수를 이용할 수 있고, 이는 대부분의 경우 지리 공간 논리와 일치하지 않아 이를 관련 없게 만들 수 있다. 설명을 위해, 도 9에서 지점 2는 지점 1의 북동쪽에 있다. 지리 공간 논리에는 지점 2의 MLID(xy 좌표 대안으로 RSA를 포함)가 각각 지점 1의 x 숫자와 y 숫자보다 모두 큰 x 숫자와 y 숫자로 구성되는 것이 필요하다. 그러나, 이 예에서는 SA 범위가 주어진 RSA(UTM)의 다수의 100 x 100-미터 셀을 포함하기 때문에, 지점 2의 4자 리 MLID(MLID = 12.21)는 지점 1의 4자리 MLID(MLID = 89.98)보다 크지 않다. 그러므로, 지점 1의 북쪽과 동쪽 에 있는 지점 2의 MLID가 지점 1의 x 및 y 성분보다 작은 x 및 y 성분을 갖기 때문에 지리 공간 논리가 존재하 지 않는다. 따라서 이 SA와 RSA에 대한 4자리 MLID에는 사람과 기계에 대한 지리 공간 논리의 장점이 없다. 지 리 공간 논리가 필요한 경우 지리 공간 논리를 달성하기 위해 주어진 SA에 대한 RTML 시스템 또는 RSA를 미리 결정하거나 자동으로 또는 수동으로 조정하여 MLID의 길이를 6자리로 늘려서 지점 2의 6자리 MLID는 이제 312.421이 되고 지점 1의 6자리 MLID는 289.398로 되도록 하면 두 경우 모두 지점 2의 x 및 y 값이 지점 1보다 크기 때문에 지리 공간 논리를 달성할 수 있고, 이는 지리 공간 논리와 일치한다. 본 발명의 시스템 및 방법은 위도와 경도로부터 유도된 LSD를 사용하여 MLID를 사용하도록 조정될 수 있지만, 위도/경도는 남반구와 서반구에서 위도와 경도 좌표가 각각 북쪽과 동쪽인 더 큰 x와 y 좌표의 일반적인 구성을 따르지 않는 것을 포함하여 다양한 이유로 최적이 아니다. 따라서, 본 발명의 시스템 및 방법은 지리 공간 논리 를 달성하기 위해 일부 수준에서 참조 시퀀스를 선택적으로 반전시킴으로써 위도/경도를 조정할 수 있다. RTML 분야의 당업자에게는 MLID에 대한 기본 기반으로서 위도/경도를 사용하여 본 발명의 시스템 및 방법을 사용하는 방식을 매핑할 수 있음이 명백하다. 임의의 주어진 사용 사례에 대해 SA 및 RSA에 지리 공간 논리가 필요하지 않은 경우 본 명세서에 설명된 LID용 시스템 및 방법을 사용하여 위도/경도용 LSD를 기본 형식으로 사용할 수 있다. 전술된 바에도 불구하고 MLID, RSA 및 SA 시스템은 지리 공간 논리를 필요로 하지 않으며 실제로도 필요로 할 것 같지 않다. MLID는 인간과 기계가 지리 공간 논리에 관계없이 미세 위치 정보를 캡처, 선별 및 통신할 수 있 도록 충분하고 극히 축약된 개별 미세 위치 참조를 제공한다. 나아가, 임의의 주어진 SA 또는 RSA에 대한 MLID 는 고유할 수 있으며, 특정 SA 및 RSA와 함께 이 특정 사용에서 정확하고 개별적인 미세 위치 참조를 제공할 수 있다. 식별, 참조, 통신 및 사용의 대부분이 기계와 함께 있거나 또는 기계에 의해 향상될 것이기 때문에 임의 의 주어진 관련 SA에 대해 정확한 미세 위치를 이산적으로 식별하기 위해 MLID가 작동하는 한, 지리 공간 논리 의 기계 조작이 필요하거나 요구될 것 같지 않다. 기계 또는 사람이 건물 내부 또는 심지어 특정 방이나 건물 내부를 탐색할 때 LPS 시스템과 MLID, RTML 정보 및 통신 시스템은 특정 방, 건물 또는 관련 SA 내부 탐색을 위해 최적화될 수 있다. 일 양태에서, 시스템은 RTML 정보의 자동 및 수동 수정, 피드백, 향상, 반복 조정 및 개선을 통해 RTML 정보, MLID의 실시간 자동 검증 및 업데이트, 반복 데이터 피드백, 수정, 및 AI 지원 시스템(통칭하여 \"데이터 피드백 시스템\")을 통해 지도 이미 지의 실시간 자동 검증 및 업데이트를 가능하게 할 수 있고, 이를 통해 모든 사용자와 디바이스는 피드백을 제 공하여 미세 위치에 대한 RTML 정보를 실시간으로 수정, 조정 및 개선하여 RTML 정보를 지속적이고 반복적으로 업데이트하고 최적화할 수 있다. 도 1과 도 2에 도시된 바와 같이 RTML 시스템은 다양한 AI, ML 및 기타 방법을 사용하여 이러한 참조 및 정보를 해석하고 분석하는 방식으로 SA 및 MLID의 공통 레지스트리/클리어링하우스를 통해 배포되는 정보를 실시간 변 경 가능하게 한다. 이 시스템은 또한 RTML 데이터 피드백 시스템을 통해 새롭거나 변하거나 오래되었거나 업데 이트된 역사적 이름, 별칭, 구어체 영역 및 참조의 진화 및 사용을 가속화한다. 이 시스템의 한 가지 잠재적 장점은 모든 MLID가 유도된 방법이나 MLID의 기본 기초에 관계없이 사실상 동일한 방식으로 모든 MLID를 인식 및 사용하여 실제 MLID를 생성하거나 지원하는 기본 RSA 시스템에도 불구하고 일관 된 외관, 느낌 및 구조를 이용할 수 있다는 것이다. 따라서 기본 RTML 참조가 다른 기본 방법론과 시스템에 기 초하더라도 사용자와 디바이스/기계는 일관되고 표준적인 형식과 인터페이스로 정보를 학습하고 이용할 수 있다. 이러한 개념의 초기 예로서 아래에서 보다 상세히 개시된 바와 같이 nnn.nnn의 1m 위치 숫자는 다음을 포함하여 많은 방법으로 결정될 수 있다: a) MLID는 다양한 정밀도 수준으로 위도 경도 또는 UTM과 같은 xy 또는 xyz 좌표 시스템에 기초하여 로컬 RSA에 대한 참조에 기초할 수 있다; b) MLID는 랜덤일 수 있다; c) MLID는 암호화 및/또는 랜덤화될 수 있다; d) 숫자는 순차적이거나 구조화되거나 경기장의 좌석 또는 시스템과 방법의 임의의 조합과 같이 명시적으로 레 이블이 지정된 위치와 연관될 수 있다. SA와 RSA는 전술된 대안으로 제한되지 않으며, 무제한 구조 옵션에 기초할 수 있다. 예를 들어, SA와 RSA는 하 나의 정의된 영역이나 심지어 인접한 영역일 필요가 없다. 좌표는 글로벌 시스템과 일치할 필요도 없고 심지어 북쪽/남쪽 선이 있는 위도 또는 글로벌 시스템과 평행할 필요가 없으며 임의의 방향으로 기울어지거나 회전될 수 있다. SA는 임의의 형상이나 크기일 수 있고, RSA는 보안 또는 기타 목적을 위해 암호화되거나 동적인 MLID 를 제공할 수 있다. 중요한 것은 전술된 많은 사례에서 모든 디바이스와 서비스에 걸쳐 친숙함, 단순함, 및 잠 재적 보편성 및 상호 운용성을 제공하기 위해 거의 동일한 인터페이스를 통해 거의 동일한 방식으로 사람과 기 계에 MLID를 제공한다는 것이다. 따라서 MLID 273.992는 273과 992가 좌표계에 의해 유도되는 2차원 좌표계에서 대략 1야드 xy 정사각형 영역을 나타낼 수 있고, 또는 MILD 273.992는 건물 구조, 평면도 및 기타 정보를 포함 하는 계층적 RTML LPS 시스템에서 특정 방 또는 공간에서 입방형 또는 다른 영역을 나타낼 수 있다. 그럼에도 불구하고 인간과 기계 인터페이스는 유리하게는 동일한 시스템, 입력, 출력 및 인터페이스 및 273.992의 친숙한 MLID 형식을 사용하여 이러한 다양한 미세 위치를 식별 및 참조하거나 MLID에 대한 정보에 액세스하여 정보를 획득하고, 이 정보를 본 명세서에 개시된 시스템 및 방법의 결과로서 SA, 미세 위치 또는 디바이스와 연관된 다 른 것이나 디바이스 또는 심지어 참조된 미세 위치와 공유하고, 인터페이스하고 통신할 수 있다. SoFi 경기장에 서 MLID 숫자의 구두 전달은 참조되거나 연관된 미세 위치, SA, RSA 및 컨텍스트 또는 사용에 따라 시스템에서 임의의 수의 다양한 방법으로 구조화되고 사용될 수 있다. 따라서 인간은 서로 다른 위치 및 방법론에 대해 서 로 다른 SA 및 RSA 시스템을 배울 필요가 없는 데, 이는 이들이 모두 동일한 방식으로 존재하고 사용되며 MLID 는 정밀한 미세 위치(및 이 위치와 관련된 RTML 정보)에 대한 보편적인 참조일 수 있기 때문이다. 나아가 기계 인터페이스와 데이터 구조는 다수의 다른 SA 및 RSA 시스템에 대해 프로그래밍될 필요가 없다. RTML 시스템은 더 넓은 영역을 위한 것일 수도 있다. 예를 들어, 도 14에는 상하이 시의 대형 SA는 36, 3685, 3685.43, 3685.4396 및 3685.4396.32의 MLID가 상하이의 SA에 또는 부근에 10 x 10-킬로미터, 1 x 1-킬로미터, 100 x 100-미터, 10 x 10-미터, 1 x 1-미터의 다양한 크기의 개별 위치/영역을 각각 참조하도록 예시되어 있다. 이 RSA는 자기 중심적 100 x 100-km 좌표계에 기초하여 상하이의 RSA 내 또는 근처에 있는 임의의 미세 위치에 대해 10자리만을 사용하여 100억 개의 고유한 1-미터 MLID를 달성한다. 그러나 대부분의 사용에서 SA와 RSA는 상당히 더 작아서 상당히 더 적은 자릿수, 종종 4자릿수 또는 6자릿수로 1 미터 정밀도를 달성할 수 있다. 이 예에서 MLIB 시스템의 효율성을 추가로 예시하기 위해 임의의 2, 4, 6, 8 및 10자리 MLID는 고유하며, 각각 10, 100, 1,000 및 10,000 미터의 임의의 범위 내에서 개별적이다. 따라서 nnn.nnn의 임의의 주어진 MLID와 도 14에 도시된 이 SA/RSA 조합에 대해 다음으로 가장 가까운 동일한 MLID는 1km 또는 약 0.61마일 떨어져 있다. 따라서 RTML 시스템이 실제 또는 결정된 SA를 유도할 수 있고 범위가 1km 미만인 경우 이 예의 MLID는 SA 및 RSA에 대해 고유할 것이다. 유사하게, 이 SA 및 RSA에서 nn.nn의 MLID를 사용하면 MLID는 대부분의 건물, 주택 및 기타 유사한 구획 및 구조물의 범위 또는 SA 및 RSA의 가장 가능성이 높은 결정 요인인 기존 거리 주소의 범 위를 초과하는 100 미터 내에서 고유하다. RSA는 숫자일 필요가 없으며, 영숫자와 심지어 전체 영문자 식별자를 이용할 수 있다. 예를 들어, MLID는 xy, 계층, 할당 또는 랜덤한 참조에 기초하는지 여부에 상관 없이 AB.23 또는 81.MT 형식으로 구조화될 수 있다. 많 은 사용에서, 숫자 SA는 당업자에게 명백한 영숫자 및 영문자만의 MLID에 비해 뚜렷한 장점을 가진다. 특정 MLID가 결정되면 RTML 시스템은 AI 및 기타 처리 논리 및 방법을 포함한 자동화된 절차를 사용하여 사용자 및 사용과 관련된 위치 컨텍스트(일반적으로 SA) 또는 기타 컨텍스트 및/또는 일반 위치 또는 MLID를 이용하여 MLID의 실제 지리적 좌표 또는 기타 식별자를 결정한다. 구체적으로 지정된 SA에 더하여 이 위치 컨텍스트의 가 능한 소스는 사용자 및/또는 사용 중인 디지털 디바이스(들)의 신원 및 마지막으로 알려진 위치; 알려진 위치가 있거나 없는 Wi-Fi 라우터, 셀 타워 또는 기타 안테나(예를 들어, 5G, WAAS 등)를 통한 이 디바이스(들)의 통신 및 연결에 관한 데이터; MLID 및 그 디지털 디바이스(들)의 수신자(들) 또는 사용자(들)의 신원; 사용자 및 수 신자(들)의 최근 또는 과거 위치; (자동차, 자전거 등을 통한) 그 움직임; 기타 소스 및 주변 환경(예를 들어, 통신 채널, 이전 또는 이후 구두, 텍스트, 이미지 또는 기타 통신에 포함된 정보, 사진(가시광선 또는 적외선스펙트럼), 소리(주변 또는 기타)를 포함하는 임의의 연관된 이미지, 라이다, 위성, 등을 포함한다. AI는 MLID의 명확화, 미세 위치 및 정확한 의미 결정을 가능하게 하기 위해 모든 이용 가능하거나 결정 가능한 정보를 동화하고 해석하는 데 사용될 수 있다. 예를 들어 USNG를 사용하여 1 미터 정밀도의 표준 RSA에서 MLID 가 347.919인 경우 가장 가까운 동일한 MLID(즉, 347.919)는 약 1km 떨어져 있다. 따라서 시스템이 최소 1km의 정확도로 사용자의 일반적인 위치를 결정할 수 있는 경우 시스템은 MLID의 정확한 지리적 좌표를 결정하기 위해 MLID를 자동으로 쉽게 명확하게 할 수 있다. 그럼에도 불구하고 MLID가 다른 RSA에 기초하는 경우 RTML 시스템 은 MLID가 나타내는 미세 위치와 연관된 정확한 지리적 좌표(및 기타 정보)를 결정할 수 있다. 동시에 AI, AR, AV 및 기타 자동화된 절차 및/또는 방법을 사용하여 사용자의 SA와 관련된 정보를 캡처하고 잠재적으로 증강할 수 있으므로 해당 SA 및 이와 연관된 임의의 RSA를 실시간으로 지속적으로 정의할 수 있다. RTML 시스템의 이 배경 처리는 시스템이 MLID, RSA, SA를 실시간으로 반복할 수 있으므로 모든 사용자 및 수신자에 대한 1m 위치 숫자의 의미를 지속적으로 확장하고 개선한다. MLID는 사람이 읽을 수 있고 쉽게 전달할 수 있는 암호화된 스트링 또는 단어일 수 있지만 RTML 시스템에서 제 공하는 키 또는 기타 방법론 없이는 지리 공간적으로 또는 다른 방법으로 해석할 수 없다. 암호화된 MLID의 경 우 승인된 사람만이 MLID 미세 위치 또는 기타 보조 정보에 액세스할 수 있다. MLID는 랜덤이거나 캠퍼스 또는 시설 지도와 같은 기존 공간 참조 시스템으로부터 유도될 수 있다. 이러한 영숫자 스트링의 지리적 의미는 RTML 시스템에서 동적으로 업데이트될 수도 있다. 따라서 MLID는 일반적으로 본질적으로 지리 공간적이며, 인간의 지 리 공간 인식을 할 수 있는 반면, MLID는 선택적으로 RTML 제공 키를 통해 승인된 수신자 및/또는 문의자를 제 외하고 지리적으로 불투명하도록 RSA 및 기타 방법론에 기초할 수 있다. 예를 들어, 도 27에서 구획 C107, 행 8, 좌석 11에 있는 경기장의 좌석(\"대상 좌석\")은 인간의 판독 가능성과 탐색을 가능하게 하고 임의의 판독자/사용자에게 특정 정보를 자동으로 제공하기 위해 C107.8.11 또는 C1078.11 또는 심지어 \"JoesSeat\"의 MLID를 가질 수 있다. 경기장 지도에서 이것은 2D(xy) 또는 3D(xyz) RSA 지리적 좌 표로 변환될 수 있으며, 이 지리적 좌표는 예를 들어 대상 좌석이 위치된 경기장의 SA의 특정 약 1 미터 큐브에 대해 241.909.32로 표현될 수 있다. xy 또는 xyz RTML 좌표 MLID는 또한 랜덤하게 할당되고/되거나 암호화되거 나 또는 지리 공간 논리를 제공하도록 설계될 수 있다. 나아가 \"JoesSeat\"는 모든 이벤트에 대해 다른 좌석을 참조하거나 또는 심지어 사용 또는 사용자(들)의 컨텍스트에 기초할 수 있다. 이러한 지리 참조 접근 방식 중 임의의 방식은 또한 누구라도 JoesSeat를 찾거나, 이로 탐색하거나, 이에 대한 정보를 얻거나, 이와 상호 작용 하여 RTML 서버 또는 시스템을 이용하고, 인증된 문의자로서 자격 증명을 제시하고, 사용자의 SoFi 경기장 좌석 의 지리적 위치를 해석할 것을 요구할 수 있다. 따라서 누구라도 MLID를 사용하여 특정 위치를 빠르고 쉽게 보 고, 알고, 입력하고, 기록하고, 기억하고, 구두로 전달할 수 있지만, 이들은 알려진 좌표계에 기초하여 및/또는 RTML 시스템의 승인을 통해 RSA 없이는 실제로 위치를 지리 참조할 수 없다. 이러한 MLID를 보거나 듣거나 알 수 있는 다른 사람은 그 지리 공간적 의미에 액세스할 수 없다. 따라서 사람은 대상 좌석에 대한 MLID를 구두로 자유롭게 전달할 수 있으며, 통신을 엿듣는 사람은 MLID를 사용할 수 없다. 나아가, 미국 특허 번호 9,678,986, 9,928,252 및 10,565,239에 개시된 바와 같이, SA와 RSA의 '소유자'(예를 들어, 경기장, 사용자 또는 기타)는 디바이스 또는 사용자의 신원 및 위치를 포함하여 수많은 조건, 컨텍스트 등에 기초하여 실시간으로 RTML 시스 템을 통한 정보에 대한 액세스를 제어할 수 있다. 도 16 내지 도 19에서 제시된 바와 같이 RSA는 SA(지점 X)의 임의의 주어진 앵커 또는 참조 지점에 대한 미세 위치의 근접도에 기초하여 가변 자릿수를 사용하도록 설계 및 할당될 수 있다. 예를 들어, 임의의 주어진 지점 X(이 예에서 SA를 최소한으로 정의할 수 있음)에 대해 RSA는 선택적으로 1) 단 2자릿수만으로 지점 X를 중심으 로 10 x 10-미터 영역 내의 임의의 미세 위치(Y), 2) 단 4자릿수만으로 지점 X을 중심으로 이 10 x 10-미터 영 역을 초과하지만 100 x 100-미터 영역 내에 있는 임의의 미세 위치, 3) 단 6자릿수만으로 지점 X을 중심으로 100 x 100-미터 영역을 초과하지만 1 x 1-킬로미터 영역 내에 있는 임의의 미세 위치, 4) 8자릿수로 지점 X을 중심으로 1 x 1-km 영역을 초과하지만 10 x 10-km 영역 내에 있는 임의의 미세 위치 등에 대해 MLID를 정의할 수 있다. 이 자동 크기 조정 기능(자동 크기 조정)은 앵커 지점으로부터의 거리에 기초하여 가변 길이 MLID를 사용하여 지구상의 임의의 지점을 지구상의 임의의 다른 지점과 비교하여 식별할 수 있는 특정 글로벌 RSA로 자 동화된 프로세스를 가능하게 한다. 앵커 지점은 기존 거리 주소와 관련된 지점을 포함하여 임의의 알려진 위치 일 수 있다. 따라서 자동 크기 조정 예시는 이 지점과 관련된 대부분의 미세 위치에 대해 임의의 지점에 비해 극히 짧은 MLID를 가능하게 한다. 예를 들어, 사용자와 기계가 대부분 집에서 100 미터 이내에 있는 집과 관련 된 미세 위치를 참조할 가능성이 훨씬 더 높으며, 사용자나 기계가 관련 앵커 또는 SA로부터 6마일 떨어진 미세 위치에 대해 MLID를 사용할 가능성은 매우 낮다. 따라서 자동 크기 조정은 대부분의 MLID가 4자릿수 또는 6자릿수가 되도록 하여 사용을 더욱 단순화하게 하고 짧은 4자리 및 6자리 MLID의 효율성을 향상시킬 수 있다. 동시에 MLID는 스크린 또는 헤드업 디스플레이 상에 MLID를 제공, 표시 또는 전달하여 사용자가 중요하게는 제3 자와 그리고 선택적으로 암호화된 MLID와 미세 위치를 식별하고 보고 기억하고 구두로 전달하거나 사용할 수 있 게 함으로써 AR, AV 및 기타 비디오 시스템과 디바이스의 유용성을 향상할 수 있다. 예를 들어, 본 명세서에 설 명된 기능이 가능한 모바일 폰 또는 디지털 쌍안경을 사용하는 사람은 경기장에 걸쳐 열리는 이벤트에서 친구의 경기장 좌석을 정확히 찾아낸 다음 이 좌석 또는 좌석 위치를 보고 사용하여 MLID를 통해 다른 사람에게 구두로 전달할 수 있고, 다른 사람은 구두로 MLID를 다른 디바이스에 입력하여 미세 위치를 식별할 수 있다. 누구라도 먼저 폰 또는 기타 디바이스로부터 MLID를 읽거나, 좌석에 표시된 디지털로 인쇄되거나 또는 티켓에 인쇄된 MLID를 읽거나, 좌석에 있는 QR 또는 기타 코드를 스캔하거나 구두로 입력하거나 또는 레이블 또는 기타 디스플 레이로부터 판독하는 것을 포함하여 임의의 다수의 방법으로 MLID를 얻은 다음 MLID 참조를 쉽게 전달하고 사용 하여 음성, 링크 또는 기타 텍스트, 소셜 미디어, 이메일, 그룹 채팅을 통해 미세 위치 정보를 얻거나 또는 Siri, Alexa, Google Voice 등과 같은 음성 서비스 및 디바이스와의 요청, 통신 또는 기타 상호 작용을 통해 승 인된 범위 내에서 RTML 위치 및 정보를 얻음으로써 전자 디바이스를 사용하여 MLID를 다른 사용자의 전자 디바 이스에 전달함으로써 미세 위치를 제공할 수 있다. 소셜 미디어와 이와 유사한 사용의 경우 MLID는 지리적 위치와 관련된 인터넷 API, 웹 게시, 채팅방 또는 챗봇 대화를 통해 정보를 얻을 뿐만 아니라, 미세 위치와 관련된 상업 및 위치별 정보, 제품, 서비스, 광고, 검색 결 과 및 기타 서비스를 얻는 것을 포함하여 다양한 목적을 위해 SA 및 연관된 RSA를 통해 RTML 시스템에 의해 종 종 매개되는 단순하지만 세분화되고 정확한 위치 참조를 제공한다. 이 시스템은 또한 MLID, SA 및 연관된 RSA의 AI 지원 의인화를 가능하게 한다. MLID는 하나 이상의 미세 위치 또는 영역을 간단하게 지정하는 데에도 사용될 수 있다. 예는 a) USNG 셀 10km 또는 1km 영역/셀 48 또는 3981과 정렬될 수도 있는 미리 정해진 10km 또는 1km 정사각형 영역에 대한 LA48 또는 LA3981; b) 특정 호텔 방 또는 호텔의 풀사이드 장소; c) 긴 위도 경도 숫 자 또는 기타 좌표 없이 참조할 수 있는 공원 또는 강이나 해변을 따른 지점에서의 특정 관점; d) 특정 건물, 층, 사무실 또는 건물의 기타 편의 시설; e) 특정 디바이스, 장비 또는 연관된 작업 또는 무대 공간; f) 책상, 열린 업무에서 워크스테이션 또는 열린 작업 공간, 작업 호텔 환경, 또는 g) 특정 위치와 관련된 특정 유형의 디바이스, 서비스 또는 키워드를 포함한다. MLID는 챗봇 및 기타 방법을 통해 MLID를 참조하여 미세 위치와의 AI 지원 상호 작용을 가능하게 하고 촉진한다. MLID를 통한 미세 위치의 객체화 및 참조는 비선형 지리 공간 데 이터 구조 및 검색보다 훨씬 더 효율적인 지형 공간 데이터의 선형 검색을 가능하게 하는 새롭고 고유하며 효율 적인 영역 위치 참조를 통해 미세 위치 정보의 AI 지원 빅 데이터 구조, 저장, 선별 및 검색을 가능하게 하고 촉진한다. MLID는 개인 길 찾기, 내비게이션, 레거시 및 인간 구동 또는 로봇/드론 배송, 게임 및 게임화, 토큰, 수집품 및 가상 소유권, 자산 관리 및 유지 관리, 광고, 마케팅 및 판촉, 응급 서비스 및 기타 공공 안전 및 보안 시스 템을 포함하지만 이로 제한되지 않는 수많은 위치별 목적에 사용될 수 있다. 시스템은 또한 다양한 미세 위치 또는 영역과 연관된 MLID, SA 및 RSA의 진실성, 정밀도 및 효율성을 지속적으 로 결정하고 측정하기 위한 AI 및/또는 기타 알고리즘을 포함할 수 있다. AI, ML 및 NLP를 사용하여 클라우드 소싱 데이터 피드백 시스템을 통해 MLID, SA 및 RSA를 인식, 해석, 향상 및 선별한다. 예를 들어 RTML 시스템은 음성 인식을 통해 MLID 사용을 추적할 수 있다. 사용자가 일반적으로 역사적으로 SoFi 경기장 안팎의 MLID에 대 해 SA SoFi 경기장을 참조한 경우, 경기장의 이름 또는 후원이 맥도날드 경기장으로 변경되면, 시스템은 SA 이 름 \"맥도날드 경기장\"을 인식하기 위해 모니터링하고 조정하고 수정하고, b) AI, ML 및 NLP를 사용하여 SA 맥도 날드 경기장이 이전에 일반적으로 SoFi 경기장으로 지칭 및/또는 명명된 SA 또는 위치와 동일하다는 것을 시간 에 따라 학습하고/하거나, c) MLID의 수많은 사용으로부터 SoFi 경기장으로부터 맥도날드 경기장으로 변화를 학 습하고 관련 SA/RSA를 자동으로 업데이트할 수 있다. 데이터 발견 하위 시스템이 SA를 자동으로 정의 및/또는 예비하는 데 이용할 알려진 장소에 대한 공식, 비공식, 구어체 및 기타 지리적 이름과 별칭의 출처는 무수히 많다. 진행 중인 클라우드 소싱을 위한 데이터 피드백 시 스템은 일반 대중과 특정 개인 또는 개인 그룹 모두를 위해 이러한 지리적 장소에 대한 SA를 정제하고 유지하는 데 도움을 주는 데, 이는 그 사용이 AI로 채굴되고 처리되어 시간에 따라 RTML 시스템을 확장 및 개선할 수 있 기 때문이다. 인공 지능과 기계 학습은 SA, RSA 및 MLID를 생성, 식별, 할당, 선별, 반복하는 데 중요한 역할을 한다. AI는 알려진 데이터베이스, 소셜 미디어 게시물 및 트래픽, 전통적인 인쇄, 방송 및 기타 참조, RTML 시스템의 새로운 디지털 요청 및 사용을 분석함으로써 건물, 기존 거리 주소, 도시, 장소, 지역에 대한 SA, RSA 및 MLID 및 이름 및 참조를 자동으로 생성, 모니터링, 조정 및 분배하는 데 사용될 수 있다. 이러한 프로세스와 시스템 중 일부는 도 28에 예시되어 있으며, 일반화된 SA 사용뿐만 아니라 정의 및 사전 설정된 SA의 사용을 컴파일, 집계 및 분석하는 것을 포함한다. AI 분석을 사용, 연관된 또는 기타 SA 이름, 구어체 참조 등에 적용하여 수백만 개 의 SA 규모로 RSA를 생성하고 조정할 수 있다. 예를 들어 특정 거리 이름/교차로 또는 특정 지역이나 기업에 대 한 사용자 참조를 모니터링할 수 있다. 홀리데이 인 호텔(Holiday Inn Hotel)이 그 브랜드/플래그를 라마다 (Ramada)로 변경하여 사용자가 이제 라마다 호텔 근처의 MLID를 참조하는 경우 AI는 선호하는 SA, RSA 또는 심 지어 MLID를 조정하여 이 변경 사항을 반영할 수 있다. 유사하게, 사용자가 장기간 동안 홀리데이 인 호텔에 대 한 SA 또는 연관 MLID의 참조를 중단하는 경우 AI는 이 위치에 플래그를 지정하고/하거나 추가 분석을 수행하여 이 위치가 영구적으로 폐쇄되었는지를 결정할 수 있다. AI는 또한 지도 이미지를 특히 2D 및 3D 좌표계에 기초 하여 MLID 참조, 특히 MLID 및 RSA와 동기화하고 이를 채운 다음, 건물의 특징부(예를 들어, 모든 층의 모든 문 뒤에 있는 것)에 이름과 설명을 할당하고 조정하고, RSA의 선호하는 크기와 유형 및 SA의 주어진 유형 또는 크 기에 대한 버퍼링 영역 등을 선택하고 할당하는 데 사용될 수 있다. MLID는 임의의 특정 SA에 대한 임의의 특정 참조 없이 임의의 다른 알려진 위치에 대한 정밀한 미세 위치 참조 로 사용될 수도 있다. 예를 들어, 승차장 픽업 및 하차 위치와 같이 구체적으로 지정된 위치의 맥락에서 MLID는 임의의 이러한 위치와 연관되거나 이러한 위치 근처에 있는 승차자 또는 자동차의 정밀한 위치를 식별하고 전달 하는 데 사용될 수 있다. 예를 들어, 사용자 1의 폰 또는 기타 모바일 디바이스는 짧은 MLID를 사용하여 임의의 승차장 위치 근처에 있는 사용자 1의 정밀한 위치를 식별하고 표시할 수 있고, 이를 통해 사용자 1은 \"나의 MLID는 7314이다\" 또는 보다 간단히 \"7314\"와 같이 구두로 또는 간단한 입력, 텍스트, 진술 또는 기타 통신으로 이 위치를 전달할 수 있다. 통신 컨텍스트에서 통신과 관련된 특정 승차장 또는 기타 픽업 위치를 이미 식별했 을 가능성이 있으므로 극히 짧은 MLID를 통해 RTML 시스템은 MLID가 참조하는 정확한 미세 위치를 식별할 수 있 다. 따라서 7314라는 간단한 언급은 이러한 목적을 위한 정밀한 미세 위치를 식별하는 데 적합하다. 물론 사용 자는 항상 \"나는 승차장 산타 클라라 광장(Santa Clara Square) 5에 있고 나의 MLID는 7314이다\" 또는 \"승차장 산타 클라라 광장 5 MLID 7314\"라고 더 길고 더 긴 설명을 전달할 수 있는 옵션을 가진다. 더 긴 설명이 필요하 지는 않지만 이는 NLP와 기타 음성 서비스에서 일반적일 수 있고, 이를 통해 본질적으로 사용자는 처음부터 거 의 모든 언어와 방언을 초월하는 방식으로 간결하고 명확하며 정밀하게 미세 위치를 효과적으로 식별, 발음 및 전달할 수 있다. 특정 미세 위치에 대한 짧고 간결하며 명확한 참조를 제공하는 것에 더하여 MLID는 또한 유리하게는 지리 공간 인간 인터페이스, 통신 및 심지어 공간 영역 인식을 단순화하기 위해 미리 정의되고 표준화된 영역 참조를 용이 하게 할 수 있다. 이 RTML 시스템은 검색, 빅 데이터, BI 및 GIS 근접도 결정을 위해, 획정된 맞춤 직사각형의 뒤죽박죽 대신 초기 검색을 위해, 그리고 또한 아래에 보다 상세히 설명된 바와 같이 더 빠르고 더 효율적이고 더 정확한 거리, 방위, 경로 검색 또는 계산을 위해 일련의 사전 설정 영역을 생성하고 채우는 데 선택적으로 사용될 수 있다. 추가 예로서, 본 명세서의 시스템 및 방법은 표준 크기 영역(예를 들어, 동일한 크기의 10 x 10km 영역에 대해 LA3821, LA3842 및 KCMO3821)의 단순화된 참조를 제공할 수 있으며, 이 영역은 그렇지 않은 경우 각 참조마다 4 개의 위도 경도 또는 다른 좌표 쌍을 필요로 한다. 유사하게 LA384216, LA384426 및 KCMO384216은 임의의 원하 는 범위에 대해 정확한 1 x 1-km 영역 등을 참조할 수 있다. 이러한 참조 시스템은 기존의 이질적이고 다소 랜 덤화된 우편 번호 형상 및 크기에 대한 대안으로 사용될 수 있으며, 다양한 도시 또는 기타 지역 내외의 인구 통계학적 영역을 컴파일하고 구성하는 보다 구조화되고 표준화되고 평등한 방법을 제공할 수 있다. 다음은 몇 가지 예시이다: SA, RSA 및 심지어 MLID는 단일화된 클리어링하우스 레지스트리, 블록체인 또는 기타 분산 원장을 통해, 또는 RTML MLID 미세 위치, 정보 및 통신 시장을 통해 정의 및 사용, 소유, 선별, 판매, 이전, 임대, 관리, 및 사용 을 잠재적으로 수익화하기 위해 기타 가상 소유권 및 시장을 통해 수립, 유지 및 액세스될 수 있다. 도시, 카운 티, 물, 학교, 및 공익 사업 또는 서비스 지구 및 기타 정치적 하위 부서, 지역 협회 및 기타 기관은 공식적으 로 구조화되고 이름이 지정되고 정의된 관련 SA의 소유권을 생성 및/또는 주장하여 지리적 경계 내 또는 근처에 있는 하나 이상의 SA에 대한 기본 인프라 및 핵심 및 기타 정보를 제공, 선별 및 분배하는 것을 도와줄 수 있다. 이러한 소유자는 자신이 소유, 관리 또는 통제하는 영역 및/또는 하위 영역과 각 SA와 연관된 일부 또는 모든 미세 위치, 정치적 하위 부서 또는 다른 영역에 대한 SA를 유지, 선별 및 제어할 뿐만 아니라 사용자 및 애플리케이션 개발자 또는 서비스 제공업체와 소유자 간의 소액 결제를 통해 지오코딩 또는 기타 액세스, 사용 및/또는 데이터 수수료를 통해 MLID 및 RTML 정보 게시 및 액세스/검색 시스템을 관리하고 수익화할 수 있다. 도 2는 SA, RSA 및/또는 MLID의 소유자가 지도 회사 및 주소 확인 회사, 승차 공유, 배달 회사, 로봇 및 드론 운영자, 광고주, 데이터 집계업체, 소매업체, 이메일 및 기타 통신 회사 등을 포함하여 최종 사용자 또는 중개 인에 의한 이러한 RTML 시스템의 사용과 그 관련 정보, 서비스 및 SA, RSA 및/또는 MLID에 대한 시스템과의 통 신에 대해 지불하거나 지불해야 하는 다양한 주요 당사자 및 시스템을 보여준다. 이러한 사용에 대한 SA, RSA 및 MLID의 가치 때문에 최종 사용자와 이러한 다른 당사자로부터의 결제는 보다 경제적으로 발전되고 견고한 커 뮤니티에 비해 RTML 정보를 효과적으로 수익화할 수 없는 소규모 및 소기업 및 거주지를 포함하는 소외된 커뮤 니티와 경제적으로 어려움을 겪고 있는 도시 및 농촌 지역 사회를 위한 SA, RSA 및 MLID의 생성, 선별 및 관리 를 펀딩하는 것을 도와줄 수 있고, 사용자로부터 이 소유자로의 소액 결제(또는 기타 결제)는 이러한 커뮤니티 가 보다 평등한 RTMLS 시스템에서 이러한 RTML 시스템을 개발, 유지 및 수익화할 수 있도록 보조금을 주거나 인 센티브를 제공할 수 있다. 도 1 및 도 2에 약술된 RTML 클리어링하우스의 주요 측면에는 극히 정밀한 (심지어 원하는 경우 무한히 정확한) RTML MLID 참조, RTML 정보를 향상시키기 위한 AD로부터 실시간 기계 학습 및 인공 지능의 사용, 상호 운용성 및 편재성을 위한 RTML 정보의 정규화 및 익명화를 위한 시스템 및 방법, 향상된 실시간 프라이버시 조치 및 시 스템, 소규모의 소외된 커뮤니티, 기업 및 대중에 대한 보조금, 향상된 상거래, RTML 시스템 및/또는 지속 가능 한 인프라에 대한 자발적 또는 수익화 가능한 사용 또는 기타 기반 지속 가능성 수수료, RTML 시스템 및/또는 기타 이동, 이동성, 배달 및 서비스 비용을 상쇄하고 비즈니스 및 사회적 지능 및 데이터를 발전시키기 위해 고 안된 서비스 수수료를 포함한다. MLID는 도로, 거리, 건물 또는 기타 랜드마크가 없는 지역에서 특히 유용하다. 예로는 공원, 해변, 호수, 강, 가변 테이블, 좌석이 있는 넓은 야외 공간 등을 포함한다. 이러한 상황에서 MLID는 고객, 배달 직원 또는 디바 이스(예를 들어, 드론 또는 기타 로봇 배송 시스템)가 정확한 위치를 결정하고 간략하고 정확하게 전달할 방법 이 없는 위치로 미세 위치 참조 및 배송을 크게 촉진한다. 많은 경우 당사자들은 종종 어렵고 비효율적인 긴 대 화를 통해 정확한 위치를 구두로 설명하고, 서로를 찾아 눈에 보이는 랜드마크, 사람들의 그룹 또는 기타 많은 비효율적이고 모호한 설명을 참조하여 정확한 위치를 설명하고/하거나 배송을 신속히 처리하기 위해 식별 가능 한 랜드마크를 식별하고 도보로 이동하는 것이 요구된다. 인간 간의 이러한 전달은 어렵지만 Siri, Alexa 및 기 타 NLP 시스템과 같은 기계로는 사실상 불가능하다. 유사하게, 대형 수영장이나 야외 공간(예를 들어, 컨벤션센터, 야외 수영장 또는 라스베이거스의 기타 모임 장소 등, 테마파크 등)에는 사용자가 자신의 정확한 위치를 알만한 시각적 랜드마크가 불충분하여 다른 사람이나 음성 가능 시스템에 위치를 잘 전달할 수 없다. 따라서 MLID는 사람과 기계/디바이스의 통신 및 활동을 크게 향상시킬 수 있다. 레스토랑, 상점 또는 기타 목적지와 매 우 가까운 주차장에서도 도로변 및 매장 내 픽업, BOPIS(온라인 구매 후 매장에서 픽업) 및 기타 배송은 이러한 MLID가 고정으로 할당되는지 또는 xy, xyz, 하이브리드 또는 본 명세서에 설명된 다른 시스템 및 방법에 의해 결정되는지에 상관없이 고정된 미리 지정된 픽업 장소에 대해 또는 목적지 근처의 동적 및 가변 주차 지점에 대 해 MLID를 사용하여 크게 촉진될 수 있다. MLID는 인간, 환경, 군사 또는 법 집행, 국경 보안, 봉쇄, 자연 재해 또는 기타 긴급 사태에 필요한 바에 따라 수립되거나 도출된 임시 SA 및 RSA 또는 기존 SA 및 RSA에 기초하는지 여부에 상관없이 911 및 기타 긴급 서비 스 상황에서 특히 유용하다. MLID는 또한 환자 또는 기타 응급 장비, 서비스 등에 대한 액세스 및/또는 정확한 경로를 제공하고, 이러한 환자, 위치 및 장비와 관련된 정보에 대한 액세스를 제공하는 데 도움을 줄 수 있다. MLID는 또한 아파트, 호텔 방 및 기타 건물과 연관되어 거의 모든 브랜드, 건물 및 기타 구조물에 걸쳐 범용 인 터페이스 및 공통 참조 시스템을 제공하여 또한 임의의 이러한 방 또는 위치를 식별, 파악 및 탐색 또는 길 찾 기 할 뿐만 아니라 이러한 방 또는 위치(예를 들어, 특징부, 디바이스, 사진, 뷰 등)에 관한 정보 찾기를 촉진 할 수 있다. MLID는 간단하고 빠른 음성 및 기타 인터페이스를 통해 다양한 앱, 음성, 웹사이트 및 기타 서비스 와 시스템(예를 들어, 근접도 중심 검색, 광고, 보안 결제, RTML 정보 액세스 등)을 촉진하여 미세 위치의 명확 한 지정을 촉진할 수 있다. 건물, 층, 조경, 건축 및 기타 유형의 사양, 평면도, 청사진 및 기타 시스템은 MLID를 사용 및 표시하여 상호 운용성, 정밀도를 향상시키고, 관련 자산, SA 등의 내부, 위 또는 주변의 미세 위치 참조를 포함하여 작업자, 엔지니어, 건축가, 배달 서비스로/로부터의 음성, 디지털 및 기타 전달을 촉진하고 용이하게 할 수 있다. MLID 는 배달을 위한 건설 프로젝트, 영구 또는 임시 스테이징 또는 배치 영역 수립, 대체 프로젝트 진입점 등에 유 용하다. 짧은 MLID는 계획 및 준설 측량, 작업 주문에서 번거롭고 비표준인 위도/경도 좌표를 대체하는 계획 및 사양, 건설 프로젝트 또는 현장 안팎에서 미세 위치의 참조, 문서화 및 공유를 위한 AI 지원 AR, VR 및 유사한 시스템에 특히 유용하고, 건설 관리자 및 다른 사람이 필요에 따라 실시간으로 MLID를 조정하고 수정할 수 있다. 마지막으로, MLID의 사용은 특히 MLID가 프로젝트 및 목적지로의 배송 및 운송에 사용되는 경우 사용 및 사용 출처에 대한 중요한 데이터를 생성한다. AD의 경우 MLID는 관리자와 작업자가 픽업 및 하차 위치, 스테이 징 영역 등을 지정하고 프로젝트 안팎에서 자산과 자원 배치를 문서화할 수 있는 간단한 공통 인터페이스를 제 공한다. MLID는 디지털 광고판에서 건물의 출구 표지판이나 공원의 트레일 표지판에 이르기까지 임의의 표지판, 기둥, 벽, 천장 또는 기타 물품이나 디바이스에 추가되어, 사용자가 정확한 미세 위치를 즉시 알고 전달하고/하거나 간판 또는 미세 위치(들)와 관련된 추가 관련 정보, 제품 및 서비스에 액세스하는 것을 도와줄 수 있다. MLID는 어떤 목적으로든 스키 슬로프, 자전거 도로, 호수, 공원, 경주 또는 마라톤 코스의 정확한 위치를 식별하거나 이러한 정확한 위치에 대한 추가 관련 정보를 찾거나 제공하거나 액세스하는 데 사용될 수 있다. 나아가 이러한 표지판, 승강기 등과 관련된 MLID를 등록하고 사용하여 모든 미세 위치, 장소, 건물, 프로젝트, 표지판, 승강기 등의 디지털 트윈을 생성 및 탐색하고 관련 정보에 디지털 방식으로 또는 음성으로 액세스하는 것을 촉진할 수 있다. 도 20 내지 도 24에 도시된 바와 같이 상업, 소매, 산업 및 주거용 부동산 소유자, 운영자 및 점유자가 MLID를 사용하여 유틸리티 정보(예를 들어, 차단 값, 주요 구성 요소 등), 조경(예를 들어, 특정 나무, 관목, 스프링클 러 헤드 또는 수리 또는 서비스를 위한 기타 정확한 위치 식별) 등을 위해 재산 내부 및 주변의 할당되거나 할 당되지 않은 미세 위치에 대한 정확한 미세 위치 참조를 신속하게 캡처하고, 문서, 스프레드시트 또는 데이터베 이스에 저장, 추가할 수 있다. MLID는 내부 또는 개인 사용으로 제한될 수 있으며, 방문자, 서비스 제공자, 배 달 서비스, 드론 및 로봇 AD, 응급 구조대원, 정부 또는 민간 유틸리티 등을 포함하는 다른 자와 공유하기 위해 암호화되거나 공개적으로 제공될 수 있다. MLID의 간결함과 정확성은 1) 사용자의 불만, 시간, 비용, 연료/배출 을 줄이고, 2) 훨씬 더 큰 효율성, 정확성 및 정밀도를 가능하게 하고, 3) 에러와 낭비되는 시간, 비용, 나쁜 결과를 줄이고, 4) 데이터 수집 및 분석을 위한 구조화된 RTML 프레임워크를 제공한다. MLID는 AD 또는 사람의 진입과 진출, 기타 재산 또는 공역 액세스 지점과 경로를 정의하고 모니터링할 뿐만 아니라 길 찾기 또는 정의, 모니터링하고 승인된 입구, 방문, 및 경로를 쉽게 수익화하기 위한 경로와 지점을 쉽게 캡처하는 데 쉽게 사용 될 수 있다. 예를 들어 공역은 MLID로 정의 및 참조될 수 있고, SA는 3차원 영역을 포함하도록 정의될 수 있으 며, RSA는 도 20에 도시된 바와 같이 x, y 및 z 형식으로 정의될 수 있으며, 여기서 z는 MSL, AGL, 층 또는 기타 척도로 표현된다. 필수 또는 선택 사항인 인바운드 및 아웃바운드 드론 배송 또는 보안 경로는 일련의 3D MLID 및 지점으로 쉽게 정의, 저장 및 전달된 다음, 정의된 전체 공역에 대한 MLID로 집계될 수 있다. MLID, SA 및 RSA 사용을 모니터링하고 효율성 및 개선을 위해 수익화할 수 있으며, 사용, 규정 준수, 추적 등에 기반한 수익화를 통해 수익화할 수 있다. 예를 들어 드론 경로는 \"128.118에서 이 자산에 대한 SA를 입력한 후 144.300 으로 직접 진행하여 드롭 구역으로 이동하는\" 것으로 정의될 수 있다. 패키지를 낙하한 후 SA(공역 및 3D RSA 포함)를 출발하기 전에 183.214로 바로 나가 이 자산으로 이동한다. 대안적으로, MLID는 공역 또는 지정된 경로 전부를 식별할 수 있다. 수많은 지도 기반, 항공, 드론, 위성 및 기타 이미지, 평면도, 디지털 및 인쇄 지도, 엔지니어링 도면, 계획 및 사양, 디지털 또는 아날로그 사진, PDF, geoPDF, AR, VR, 및 기타 비디오 디스플레이, 평면도, 내부 LiDAR 포인 트 클라우드 등(통칭하여 \"지도 이미지\")에 걸쳐 2D 및 3D 지리 공간 참조 및 좌표를 상관시켜 다양한 스케일링 및 프로젝션 에러를 조정하는 것은 불가능하지는 않지만 어렵다. 현재 미세 위치 주소 참조가 다수의 지도 이미 지에 걸쳐 상호 운용 가능하고 일관성이 있는 것을 보장하는 방식으로 미세 위치를 동기화하고 좌표 참조하기 위한 실행 가능한 시스템은 없다. SA, RSA 및 MLID는 다양한 유형의 별도 2D 및 3D 지도 이미지를 상관 및/또는 동기화하는 데 사용함으로써 이 지도 이미지 동기화 및 상호 운용성 문제와 요구 사항을 해결하는 데 도움을 주는 데 사용될 수 있다. 이는 지 도 이미지에 표시된 영역에 대한 RSA 및 SA를 사용하여 각 지도 이미지에서 하나 이상의 알려진 지점을 자동으 로 조정함으로써 달성될 수 있다. 예시를 위해 건물 X의 NE 및 SE 코너에 대한 MLID가 각각 34.12 및 22.14이고, SA 및 RSA가 4자리 MLID로 1 미터 정밀도를 제공한다고 가정한다. 그러면 이러한 미세 위치에 대한 MLID를 사용하여 이질적인 지도 이미지를 조정하고 별도의 지도 이미지에 걸쳐 RTML 위치 참조를 동기화하여 건 물 X의 NE 및 SE 코너가 모든 지도 이미지에서 각각 34.12 및 22.14가 되도록 할 수 있다. 이 동기화는 또한 지 도 이미지의 임의의 다른 미세 위치에 대한 MLID를 효과적으로 조정하여 모든 이질적인 지도 이미지를 거의 보 편적인 RTML 참조 및 매핑 시스템으로 효과적으로 동기화한다. 이를 통해 MLID는 일종의 매핑 공통어로서 서로 다른 지도 이미지 간에 상호 운용성을 제공할 수 있다. 유리하게는 MLID는 매우 짧고 제한된 숫자 문자 집합으 로 구성되기 때문에 MLID는 또한 발성 및 서면/시각적 단어 모두에 대해 수많은 언어와 방언에 걸쳐 사용하는 데에도 도움을 준다. 지도 이미지에 대한 이러한 동기화 및 상관 조정은 인간을 위해 단순화될 수 있고/있거나 수많은 기본 문서 및 디지털 데이터베이스를 동기화하기 위해 프로그램 및 AI에 의해 AD를 위해 자동화될 수 있 다. geoPDF와 같은 일부 이미지 지향 문서 유형에는 진행 중에 발견하고 동기화할 수 있는 2D 지리 공간 참조가 내장되어 있다. 이것은 수동으로 달성되거나 또는 본 명세서에 개시된 AI 또는 다른 시스템 및 방법을 사용하여 달성할 수 있다. SA, RSA 및 MLID는 다양한 수준의 암호화, 제한된 액세스 및 패스워드 보호 등을 제공하는 RSA를 채택함으로써 SA와 MLID 간의 모호한 위치 참조 및 연관을 강화하고 프라이버시를 강화하는 데 사용될 수 있다. 이것은 사용 자의 실제 거리 주소가 아닌 인접하거나 인근 기존 거리 주소를 참조하는 MLID를 사용하여 정확한 픽업, 하차 또는 배달 위치를 지정함으로써 승차 공유, 배달 및 기타 사용에 대한 추가 보호 및 프라이버시 수준을 제공할 수 있다. 그럼에도 불구하고 예를 들어, 1234 메인 스트리트(Main Street)에 거주하는 사용자는 픽업 장소의 MLID를 377.181로 지정하고, 1245 메인 스트리트의 주소 또는 메인 스트리트와 그랜드 애비뉴(Grand Avenue)의 코너 근 처 377.181을 SA로 지정하여 모든 당사자와 디바이스가 사용자의 실제 거주지를 참조하지 않고 정확한 픽업 위 치를 식별할 수 있게 한다. 유사하게, MLID는 대형 아파트 단지 또는 기타 대형 부동산 캠퍼스, 프로젝트 또는 개발지에서 재산 내 또는 근처의 정확한 픽업, 하차 또는 배달 위치를 지정하고 정확한 아파트 번호 또는 주소 를 명확하게 하는 데 사용될 수 있다. 예를 들어, 1000 메인 스트리트의 아파트 24B의 점유자는 아파트 24B를 참조하지 않고 MLID 위치 숫자 910.183을 지정하여 배달 서비스(또는 아마도 배달 직원)가 사용자의 정확한 거 주지 정보에 액세스하지 않는 것을 보장할 수 있다. 나아가 MLID는 로비 위치, 단지 입구 근처, 수영장, 옆문 또는 기타 영역 근처의 특정 위치를 포함하여 임의의 근처의 미세 위치를 참조할 수 있다. RTML 시스템, MLID, SA 및 RSA는 공동 소유자가 지정하고 관리하며 모든 소유자 및/또는 해당 사용자가 공동 소 유자의 전부 또는 일부의 허가 없이 수정 없이 MLID를 사용하는 것을 보장할 수 있고, 공동 소유자의 개별 소유 권은 SA, RSA 및 MLID의 추가 유효성, 제어 및 이용 가능성을 제공하기 위해 블록체인 또는 기타 분산 원장, 레 지스트리 또는 기타 시스템에 의해 수용될 수 있다. 특정 SA, RSA 또는 MLID가 특정 기존 거리 주소 또는 일부 다른 영역과 관련되어 있는지 여부에 관계없이 둘 이상의 당사자(예를 들어, 공동 임차인, 공동 세입자 또는 차 용인과 대출 기관)는 SA 및 관련 RSA 및 MLID를 공동으로 소유하고 통제할 수 있다. 대출 상황에서 차용인, 대출 기관 및 소유자는 대출, 평가 또는 기타 목적을 위해 담보로 사용할 자산의 전부 또는 일부를 지정할 수 있 으며, 이들은 공동으로 소유한 SA, RSA 또는 MLID의 생성, 선별 또는 유지 동안 임의의 지점에서 동의할 수 있 기 때문에 모든 당사자의 동의 없이 변경될 수 없는 특정 SA 또는 RSA와 연관된 일련의 MLID에 의해 재산에 구 체적으로 정의된 SA 및 RSA를 지정하는 데 취소 불가능하게 동의할 수 있다. MLID, SA 및 RSA의 이러한 공동 소 유권을 통해 임의의 당사자는 단기 또는 장기적으로 관련 정보 또는 데이터 및 정보를 공유, 사용, 향상 또는 꾸밀 수 있다. 나아가 이러한 공동 소유권은 다수의, 대부분의 또는 모든 당사자가 임의의 이러한 변경, 조치 또는 심지어 사용에 대해 합의하거나 동의할 것을 요구할 수 있다. MLID는 도 14에 도시된 바와 같이 디지털 쌍으로 계층적으로 정렬 및/또는 중첩된 방식으로 정의 및 배열될 수 있다. 이 RSA 구조는 근접도 기반 데이터 구조, 빅 데이터 및 분석을 용이하게 한다. 예를 들어, 임의의 주어진 SA에 대해 MLID는 정밀도가 증가하는 중첩 타일로 구현될 수 있다. UTM과 일치하는 RSA를 갖는 SA의 MLID 31.2811에서 \"31\"은 특정 100 x 100-미터 UTM 셀을 참조할 수 있고, \"28\"은 31 100m UTM 셀 내부의 10 x 10-미 터 셀을 참조할 수 있고, \"11\"은 28 10m UTM 셀 내부의 1 x 1 미터 영역/지점을 참조할 수 있다. 이 중첩된 구 조는 MLID에 대한 데이터(또는 이러한 MLID가 지리 공간적으로 참조하는 데이터) 구조 및 텍스트 검색이 MLID 특성(예를 들어, 100m 셀 참조에 \"31\"이 있는 이 SA에 대한 MLID가 있는 모든 레코드, 또는 100m 및 10m 셀 참 조에 3128이 있는 모든 레코드)을 검색할 수 있게 한다. 이를 통해 복잡한 지리 공간 데이터 구조 및 비선형 GIS 검색 메커니즘보다 훨씬 간단한 MLID 참조 및 구조로 위치 태그된 빅 데이터의 쉽고 간단한 텍스트 검색 및 선형 데이터 구조를 위한 지리 공간 데이터 구조 및 검색 메커니즘을 가능하게 한다. 따라서 MLID는 미세 위치 데이터 구조, 검색 및 참조의 효율성과 단순성을 크게 향상시키는 방식으로 건물, 집, 아파트, 거주지, 사무실 등과 같은 더 작은 영역과 연관되거나 근처와 연관된 지리 정보, 특히 미세 위치 정보를 저장, 색인 및 검색하 는 데 사용될 수 있다. 텍스트 키 및 검색은 다른 유형의 비선형 및 다차원 지리 공간 검색보다 잘 확립되어 있 고 보다 효율적이다. 나아가 SA는 기존 위치, 장소, 정치적 하위 부서, 영역(예를 들어, 우편 번호, 도시, 지구, 공원 및 기타 경계)에 대해 생성될 수도 있으며, RSA는 이러한 영역 내부 또는 이러한 영역의 미세 위치 를 추가로 지리 공간적으로 분할하거나 참조하는 데 사용될 수 있다. 이러한 경우 MLID를 사용하여 미세 위치를 추가로 식별하거나 데이터베이스, 피벗 테이블 및 기타 데이터 구조에서 기존 영역 및 경계(예를 들어, 우편 번 호) 내의 하위 영역에 기초하여 데이터를 분할할 수 있다. 유리하게는 하위 영역에 대한 MLID 참조는 이러한 참 조가 구조화되든지 또는 비구조화되든지 관계없이 더 큰 영역 내의 더 세분화된 영역에 대한 편리하고 간단하며 간단한 참조를 제공한다. 도 29 내지 도 32는 액셀 스프레드시트 및 기타 데이터베이스 구조에서 간단한 단일 셀/필드 지리 공간적 위치 식별자에 MLID를 사용하는 예를 포함한다. 마지막으로 SA는 도 36에 도시된 바와 같 이 선 또는 세장형 영역(예를 들어, 강, 도로, 하이킹 또는 자전거, 오솔길, 철도, 하이웨이 등)을 따라 지정될 수 있다. RSA는 MLID 숫자가 이러한 선 또는 세장형 영역을 따라 위치를 참조할 수 있도록 설계될 수 있다. 예 를 들어 기존 시스템 및 프로세스를 사용하여 MLID 지정 영역(위치 참조와 여러 SA의 비교 영역을 용이하게 하 기 위해 특정 형상과 크기의 미리 정해진 표준 영역에 대한 영역의 MLID를 사용하여 예를 들어 LA3823 또는 NYC3121에서 인구 및 기타 인구 통계, 가구 수, 소화전, 건물 유형 등)에 대한 GIS 데이터를 보다 쉽게 지정하 고 분석할 수 있다. 이러한 시스템은 더 많은 자릿수를 가진 RSA(예를 들어, 한 예에서 1km 영역의 경우 LA3981, 100-미터와 10-미터 영역의 경우 각각 LA3981.39 또는 LA3981.3973)를 사용함으로써 다양한 수준의 정 밀도 및/또는 영역 크기에서 단순화된 검색에 사용될 수 있다. RTML 시스템은 API 및 유사한 메커니즘을 통해 SA, RSA 및 MLID와 관련된 실시간 데이터 및 정보에 대한 액세스 를 제공한다. 나아가 MLID는 URL 스트링과 API 요청에 위도/경도 xy 좌표를 포함하는 기존 방법보다 더 정확하 고 단순하며 정확한 방식으로 MLID가 참조하는 미세 위치와 관련된 정보 또는 데이터를 참조 및/또는 요청하기 위해 URL 스트링과 API 요청에 사용될 수 있다. 나아가 MLID를 사용하면 보편적으로 이해되고 복호 가능한 위도 /경도가 아니라 인코딩 또는 암호화된 MLID를 사용하여 보안, 안전 및 프라이버시를 향상시킬 수 있다. 일상의 소비자가 일상적으로 사용하기에는 너무 길고 번거로울 뿐만 아니라 위도/경도 계산은 대부분의 인간 규 모 적용에 필요한 것보다 더 정확하다. 지도 이미지는 위도/경도 기반 좌표와 완벽하게 정렬되는 경우가 거의 없다. 일상적인 목적을 위해 인간이 경험하고 이해하는 \"편평 지구\"(xy 또는 xyz)와 위도/경도 사이에는 근본적 인 단절이 있다. 위도/경도 이외의 시스템에 기초하는 SA, RSA 및 MLID는 사람을 위한 구형 위도/경도 측지 시 스템이 지도, 시각적 및 기타 디스플레이 등에서 위치를 참조, 표시, 통신 및 묘사할 뿐만 아니라 \"빅 데이터\" 리포지토리에서 지리 공간 데이터를 저장, 검색 및 검색한다는 점에서 인간과 기계 모두에 더 나은 서비스를 제 공한다. 임의의 주어진 SA에 대한 RSA는 또한 숫자 문자(31 또는 47)를 결정하는 방식(예를 들어, 할당하는 방식 또는 2D 또는 3D RSA 좌표)에 상관없이 사용자에 의미를 갖는 영숫자 문자(주자장 31 또는 문 47에 대해 각각 P31 또 는 D47)를 더 포함할 수 있다. MLID에는 임의의 주어진 SA에 대한 명명된 위치, 키워드 또는 기타 용어도 포함 될 수 있으며, 임의의 주어진 SA에 할당된 이러한 명명된 위치, 키워드 또는 기타 용어는 특정 미세 위치 또는 다른 것을 참조할 수 있다. 유사하게 SA의 이름에도 하나 이상의 숫자가 포함될 수 있다. 따라서 이름과 연관된 ID 또는 위치가 Z9934인 경우 9934는 SA의 이름의 일부이며 영역을 지정할 수 있다. 또는 9934는 Z로 참조되는 SA에 대한 MLID 미세 위치 참조일 수 있다. 영숫자 이름과 숫자도 서로 얽혀서 함께 사용될 수 있다. 예를 들어 Z9934.810.791은 Z9934를 SA의 이름으로 이용할 수 있는 반면, 810.791은 RSA에서 지정한 특정 xy 또는 xyz 좌 표계에 기초하여 MLID일 수 있다. 이 참조에 대한 SA 및 RSA의 소유자 또는 선별자는 SA, 원하는 경우 선택 사 항인 SA 이름, 및 RSA를 모두 선택하여 MLID를 결정할 수 있다. 전술된 결정 중 임의의 결정에도 불구하고 사용자는 구두 또는 텍스트로 SA 및/또는 MLID를 참조하고 사용할 수 있으며, RTML 시스템은 제로 또는 명목상의 모호성으로 작동한다. 예를 들어, Z9934 SA 내의 사용자는 Siri 또 는 기타 음성 가능 디바이스나 서비스를 통해 \"저기요, 선생님, 앞으로 30분 안에 810.791로 음식 배달이 필요 합니다. 내 옵션은 무엇입니까?\"라고 단순히 말함으로써 구두 요청을 할 수 있고, RTML 시스템은 음성 서비스가 810.791의 정확한 위치(예를 들어, 콜로라도주 덴버의 18321 메인 스트리트 건물 4층에 있는 회의실 472)를 알 수 있도록 한다. 정규화된 SA 및 RSA는 전 세계적에 걸쳐 단순성과 상호 운용성을 위해 제공되지만 소유자는 특정 목적 또는 특 정 영역에 대한 내부 또는 외부 사용을 위해 SA 및 RSA를 정의할 수 있다. 브랜드, 기업, 대학 캠퍼스, 도시, 건물 및 프로젝트 소유자는 모든 지역에서 일관되게 SA의 이름을 지정하거나 사용자 정의될 수 있다. 예를 들어, 모든 맥도날드에 대한 SA는 MCDnnnn일 수 있다(여기서 nnnn은 기존 레스토랑 번호 또는 더 큰 RSA와 연관 된 다른 번호를 나타냄)(예를 들어, SA 및 RSA는 도 14의 예와 유사한 주요 도시 주변의 전체 100 x 100-km 영 역을 포함함), 맥도날드 레스토랑과 관련 영역은 만약 있다 하더라도 100 미터 범위를 초과하는 경우가 드물기 때문에 맥도날드는 항상(또는 일반적으로) 표준 100m 정사각형 RSA를 갖는 nn.nn 형식으로 위치에 대한 RSA를 정의할 수 있다. 따라서 MCD1274.9182는 맥도날드 레스토랑 번호 1274 근처에서 1-미터 정밀도로 정확한 MLID 미세 위치를 지정할 수 있다. SA 및 RSA는 소유주 또는 소유주 그룹에 의해 수시로 조정되어 토지 덩어리가 이동할 때 기존 시스템의 정확한 위치 참조가 시간에 따라 변하지 않는다는 점에 유의하는 것이 중요하다. 현재는 육지 덩어리가 이동할 때 매우 정밀한 위도와 경도 좌표가 이러한 이동과 함께 변한다. 예를 들어, 건물 코너에 대한 특정 데이텀의 위도/경도 는 오늘 -117.123456789 및 32.123456789이고 20년 후에는 -117.123456786 및 32.123456783일 수 있다. 반대로 MLID가 LA1234.981.198인 미세 위치(981.198이 정확한 1 미터 정사각형 위치를 참조할 수 있도록 하는 표준 100km RSA 좌표계 사용)는 항상 정확한 미세 위치(981.198)에 대한 정확한 MLID를 유지하는 데, 이는 SA용 RSA(LA1234)용 앵커는 임의의 지구 이동 또는 변위를 반영하도록 조정되기 때문이다. MLID의 이러한 안정성은 지도 이미지를 SA 및 RSA로 조정하는 능력과 함께 결합되어 MLID가 수많은 이질적인 지도, 지도 이미지, 언어 및 방언에 걸쳐 GIS 및 미세 위치의 진정한 공용어가 될 수 있도록 지원한다. SA 및 RSA는 또한 자동으로 생성되거나 또는 AI를 사용하여 및 건물, 구획, 장소, 기존 배달 가능한 거리 주소, 아파트, 지도 이미지 등의 기존 데이터베이스를 사용하여 확장 가능한 프로세스 및 절차를 통해 생성되어 임의 의 주어진 미세 위치, 기존 거리 주소, 건물, 프로젝트, 장소 또는 기타 위치에 대해 기본 또는 디폴트 SA 및 최적의 RSA를 생성할 수 있다. 거리 주소와 구획 번호는 또한 SA에 대한 축약된 이산 이름/ID가 있는 AI 및 기 타 알고리즘을 사용하여 대규모로 축약될 수 있으며, AI를 사용하여 수백만 개의 재산에 대한 RSA의 초기, 제안 된 또는 최종 지정을 최적화하고 자동화할 수 있다. AI와 이러한 시스템을 사용하여 SA와 RSA는 현재 미국에서 약 1억 8천만 개의 배달 가능한 주소에 전개될 수 있으며, 아마도 수십억 개의 알려진 다른 알려진 위치 및 하 위 위치(예를 들어, 거리, 교차로, 가로등, 유틸리티 플랜트, 스위치, 발전기 등)(이들 중 다수는 현재 기존 거 리 주소(너무 크고 일반적임)와 아마도 길고 번거로운 위도 및 경도 좌표가 아닌 정확한 위치를 참조하는 표준 방법이 없어서, 짧은 MLID보다 기능이 훨씬 더 제한적이고 일반 작업자와 소비자에게 어색하고 번거롭고 어렵다)에도 전개될 수 있다. MLID 및 MLID에 대한 SA 및 RSA 파라미터를 정의하고 KML 및/또는 GeoJSON 또는 유사한 파일, API 및 컴퓨터 기능에 포함시켜 다양한 GIS 시스템에 걸쳐 상호 운용성과 효율적인 RTML 참조를 가능하도록 할 수 있다. 나아 가, RTML 시스템은 SA 및 관련 RSA의 레지스트리, 및 이러한 SA 및 RSA 및 다른 것들이 필요에 따라 액세스할 수 있게 하는 해당 파라미터에 대한 쉬운 액세스를 가능하게 하는 클리어링하우스를 이용할 수 있어서 도 1 내 지 도 3에서 제시된 바와 같이 이러한 레지스트리에서 항상 RTML 정보를 얻을 수 있다. 대안적으로 특정 사용자가 내부적으로 이러한 정보를 사용하는 시스템은 SA 또는 RSA의 임의의 변경 사항을 기록하고 사용하고/하거나 적절하게 조정하는 것을 보장하기 위해 주기적으로 또는 필요에 따라 RTML 레지스트리와 동기화될 수 있다. 예 를 들어 RSA가 임의의 주어진 SA에 대한 표준 UTM 또는 USNG에 기초하는 경우 시스템은 USNG를 현재 RSA로 지정 한다. 그러나 RSA가 다른 시스템 또는 사용자 정의 시스템을 기초하는 경우 레지스트리 및/또는 KML 또는 GeoJSON 파일은 이러한 RSA에 대한 파라미터를 제공하고 이러한 KML 및 GeoJSON 파일에는 적절하게 정의되고 연 관된 SA, RSA, MLID 등, 기본 SA 및 RSA 내 또는 주변의 인근 또는 하위 위치에 대한 RSA 정보도 포함될 수 있 다. MLID는 또한 미국 특허 번호 9,678,986, 9,928,252 및 10,565,239에 개시된 다양한 유형의 스마트 주소 위치 ID를 포함하여 다른 주소 및 위치 참조 시스템에 액세스하거나 이와 연관될 수 있다. 따라서 MLID는 이러한 참 조된 특허 문헌에 개시된 바와 같이 위치 식별자로 변환되는 전화번호, 생체 인식 속성, 도메인 이름/URL, 소셜 미디어 핸들, 이메일 주소 또는 임의의 다른 비위치 식별자(예를 들어, 번호판, VIN, UUID, 보트 또는 비행기 등록 등)에 연결된 고정 또는 가변 SA와 연관될 수 있다. 예를 들어, 사용자 1은 라스베이거스의 대형 컨벤션 센터에서 사용자 1의 정확한 미세 위치에 대한 MLID를 전화 통화 중에 사용자 2(또는 다수의 사용자)에 (구두로 또는 디바이스를 통해 자동으로) 제공할 수 있고, 사용자 2(또는 다른 사용자)는 그런 다음 사용자 1의 정확한 미세 위치를 식별하기 위해 컨벤션 시설 내에서 연관된 RSA가 있는 전화 번호에 대한 기본 SA의 ID로서 사용자 1의 전화 번호와 연관시킴으로써 컨벤션 센터 내 또는 근처에서 사용자 1의 정확한 미세 위치를 식별할 수 있다. 유사하게, 배달 서비스는 시설에 임의의 다른 유형의 공간 또는 위치 참조 시스템이 있는지 여부에 관계 없이 대규모 컨벤션 또는 컨퍼런스 센터에 걸쳐 배달을 촉진하기 위해 사용자 1의 MLID 숫자를 이용할 수 있다. 유리하게도, 컨벤션 센터가 라스베거스, 뉴올리언스 또는 임의의 다른 위치에 있는지 여부에 관계없이 시스템 및 심지어 다수의 시스템이 사용자 1 및 사용자 2(또는 다른 사용자)에 대해 정확히 동일한 방식으로 수행된다. RTML 시스템 사용자는 또한 SA 또는 RSA와 연관된 기본 재산, 건물, 장소 또는 다른 장소를 자동으로 더 포함할 수 있는 각 특정 SA 및 RSA에 대한 사용 약관에 동의해야 하거나 수락하도록 허용될 수 있다. 예를 들어, 사용 은 법적 또는 기타 통지를 인정하고/하거나 기본 재산에 대한 액세스 약관에 동의하거나 구내에 방문하고 입장 하기 위한 임시 라이센스 조건을 인정하고 동의해야 할 수 있다. MLID를 사용하는 사용자는 MLID 및 관련 내비 게이션, 길 찾기, 정보 또는 관련 서비스를 사용할 수 있는 권한을 부여받기 전에 재산에 관한 특정 통지 및 공 개의 수신을 인정하고 특정 액세스 약관에 동의해야 할 수 있고, 이 경우 숫자를 사용하는 사용자는 특정 법적 또는 기타 통지 또는 정보에 대해 조언을 받았거나 특정 액세스 및 사용 조건에 명시적 또는 암묵적으로 동의한 것을 확립한 것이 된다. RTML 시스템은 사용에 대한 정보, 데이터 피드백 시스템을 통한 사용자의 피드백, 및 SA, RSA 및 MLID에 관한 기타 정보(변경, 에러 수정 및 기타 정보 포함)를 실시간으로 캡처하여 데이터를 획득하여 후속 사용자를 위한 시스템의 효율성을 향상시키고 모든 사용자와 사용을 반복하여 MLID를 SA 및 RSA와 연관시키는 시스템을 개선시 킨다. 이러한 데이터 피드백 시스템은 MLID를 사용하여 디바이스 및 사용으로부터 피드백을 요구하거나 자동화 함으로써 SA 및 MLID와 연관된 미세 위치를 실시간으로 조정하는 데 사용될 수 있다. 예를 들어 비좌표 또는 좌 표 MLID가 일반적으로 소유자 1의 사무실 스위트와 연관되어 있고, 건물78의 4층 SW 코너에 있는 소유자 1의 사 무실 스위트에 위치된 종업원 X의 사무실이 (AD 또는 사람을 사용하여) 배달 서비스 A에서 사용되고, 종업원 X 의 사무실에 대한 MLID에 에러가 있거나 최적이 아닌 것을 확인한 경우 배달 서비스 A는 이러한 정보를 SA의 소 유자 또는 기타 운영자에게 보고해야 할 수 있다. 따라서 소유자 1 및/또는 종업원 X가 최근 예를 들어 건물78 (또는 건물79)의 3층 NW 코너에 있는 새 사무실로 이사했고, 소유자 1의 사무실에 대한 MLID를 조정하는 데 실 패한 경우, 시스템은 소유자 1 및/또는 종업원 X의 위치를 새 위치로 자동 조정 및 반복하여 동일한 MLID를 사 용하는 모든 서비스의 향후 배달이 소유자 1의 사무실 스위트 또는 종업원 X의 사무실의 새 위치로 이루어지도 록 할 수 있다. 따라서 종업원 X의 사무실에 대한 MLID는 동일하게 유지되지만 RSA 및 RTML 시스템은 데이터 피 드백 시스템의 결과로 새 위치를 반영하도록 조정된다. 이 세분화된 데이터 잔해, 자가 반복 및 수정은 모든 사 용자를 위한 사용자 및 데이터 피드백 루프의 구성 요소이며, AI 구성 요소 및 기능이 모든 사용자와 사용 및 진행 중인 데이터 분석 및 비즈니스 인텔리전스에 대해 SA, RSA 및 MLID를 반복, 조정 및 최적화하여 모든 사용 자, 지도 및 디바이스에 걸쳐 시스템을 지속적으로 개선하는 데 도움을 준다. MLID는 또한 위치 및 관련 정보에 대한 영구 또는 임시 진입 및 액세스 권한과 연관될 수 있다. 따라서 78.01의 집 1로 배송을 위한 일반적인 MLID는 조건, 컨텍스트 또는 임의의 수의 변수에 따라 소유자가 통제하는 특정 날 짜 및 시간에 자동으로 활성화 및/또는 비활성화될 수 있다. 중요한 것은 MLID가 짧고, 링크, QR 코드, 텍스트, 이메일, 구두, 방송 및 기타 통신 및 시각화에서 사용을 용이하게 하며, LID의 주요 위치 내부 및 주변에서 더세분화되고 정확한 위치 참조가 있는 선행 기술에 개시된 일반 LID 및 위치 이름을 통해 미세 위치의 사용 및 통신을 향상시키기 위해 보완적이고 크게 제공될 수 있다는 것이다. 명명되거나 명명되지 않은 SA, RSA 및 MLID는 RTML 시스템 운영자가 소유 및 제어하거나, 또는 SA, RSA, MLID 및 RTML 시스템의 구조에 따라 재산으로서 양도, 임대 또는 할당될 수 있다. 이러한 권리에는 한 명 이상의 소 유자가 할당되고 초기에 지정된 다음, 한 명 이상의 소유자가 재판매, 사용의 수익화, 관련 위치 또는 위치 정 보 또는 이러한 사용과 관련된 데이터 또는 분석에의 액세스를 통해 또는 임의의 다른 방식으로 수익을 창출하 기 위해 이러한 권리를 주장 및/또는 구매할 수 있다. 인터넷 브라우저, 애플리케이션 및 기타 소프트웨어 프로그램(예를 들어, Excel, Google docs, Salesforce, PowerPoint, Word, 내비게이션 및 매핑 소프트웨어 애플리케이션 및 디바이스, AD 등)은 MLID를 이용하여 모든 이미지에 걸쳐 MLID가 정확함을 보장하기 위해 사용자가 보는 이질적인 지도 기반, 이미지, 문서(예를 들어, PDF), 다이어그램, 평면도 등을 동기화할 수 있다. 예를 들어, 여러 컨텍스트, 콘텐츠, 사용자 및 사용에 기초 하여 적절한 SA 및 RSA에 기초하여 표시되는 콘텐츠 및/또는 MLID를 자동으로 표시 및/또는 조정하여 사실상 모 든 웹사이트 및 콘텐츠에 걸쳐 1m 위치 숫자를 사용할 수 있도록 브라우저 확장을 전개할 수 있다. SA, RSA 및 MLID는 또한 SA, MLID 및 미세 위치와 관련된 정확한 위치 또는 목적지 및 작은 영역(예를 들어, 건 물 또는 사무실, 소매점, 스케이트장, 공원, 일반 또는 특정 유형의 야외 공간 등)에 정확하게 타겟 광고 또는 유사한 메시지를 제공하기 위해 마케팅 및 광고 목적으로 사용될 수 있다. MLID는 근접도 기반 광고, 마케팅, 정보 배포 및 기타 시스템을 활성화하고 지원하여 종종 건물, 사무실 또는 심지어 고용주 수준을 의미하는 사용 자의 정확한 미세 위치에 기초하여 정보를 보다 정확하게 제공하거나 배포할 수 있다. 광고주 및 기타 마케터는 MLID에 대한 액세스 권한을 구매하여 특정 미세 위치와 관련하여 광고 단위를 표시하고, 임의의 SA 또는 MLID와 관련된 근접도 기반 검색을 위한 키워드 또는 검색어에 대한 독점 또는 우선권을 구매할 수 있다. MLID는 또한 모든 SA 또는 MLID에 대한 유료 검색 패러다임을 지원하여 극도의 세분성 및 효율성을 제공할 수 있다. 예를 들 어, 매우 가까이 있거나 주어진 SA 내에 위치된 판매자는 주어진 MLID 또는 SA 근처의 근접도 기반 검색에 대한 검색 결과의 배치에 입찰할 수 있다. 이 기능을 통해 인근 레스토랑이나 다른 판매자가 인근 고객에게 액세스할 수 있을 뿐만 아니라 SA 및 MLID는 배달과 관련된 판매자 RTML 정보를 MLID에 제공하여 특정 MLID에 대한 배달 을 보다 정확하고 효율적으로 만드는 데 도움을 준다. 이러한 RTML 정보에는 예를 들어 회의실의 정확한 위치에 대한 신속한 액세스, 건물의 정확한 방향 및 길 찾기, 특별한 액세스 및 연락처 정보, 정확한 배달 위치(회의실 내, 층의 프런트 데스크, 건물 로비 또는 아마도 주차장 구역의 다른 MLID 내)가 포함될 수 있다. 이러한 정보 에는 또한 고용주, 종업원 또는 방문자와 관련된 주문에 대한 청구 정보도 포함될 수 있으며, 이는 회의실 예약 시스템과 추가로 통합되어 주문 또는 배송 시 객실을 사용한 것으로 알려졌거나 예약했을 수 있는 적절한 당사 자에게 주문이 자동으로 청구될 수 있도록 한다. MLID는 사용자가 이 위치로 직접 이동할 수 있도록 지원하는 자세한 정보, 음성 또는 시각적 안내 또는 기타 정 보와 함께 매점 또는 기타 목적지 내부의 제품 또는 서비스에 대한 소비자 참조, 검색 및 길 찾기를 위한 특정 범주 또는 유형의 제품에 대한 정확한 미세 위치 또는 심지어 브랜드 및/또는 특정 제품 및 SKU에 대한 MLID를 사용자에게 제공함으로써 모든 소매점 채널에 걸쳐 위치 참조를 표준화하고 정규화하는 데 사용될 수 있다. MLID는 하나 이상의 매장으로 이동하는 경로에서 사용자에게 제공될 수 있으며, MLID는 원하는 제품에 대해 매 장 내 정확한 위치에 기초하여 사용자에게 제공되는 방향, 길 찾기 및 정보를 최적화하기 위해 매장 내부의 정 확한 위치를 참조하는 데 사용될 수 있다. 예를 들어, 사용자는 식료품점, 구내 매장 또는 기타 소형, 중형, 대 형 또는 특정 제품이나 서비스가 진열되어 있는 '빅 박스' 소매점 X 내부의 정확한 1-미터 영역을 나타내는 4자 릿수 MLID(예를 들어, 3981)를 포함하는 판촉 문자 메시지를 받을 수 있다. 그런 다음 사용자는 소매점 X 및 MLID 3981에 대한 방향을 모바일 전자 디바이스의 Siri, Alexa 또는 일부 다른 음성 서비스에 요청할 수 있으며, 음성 서비스는 소매점 X뿐만 아니라 거리로부터 정확한 주차장 입구까지의 방향, 최적의 주차 및 건물 진입, 기본 SA 또는 RSA에 관계없이 정확한 MLID 3981까지의 정확한 길 찾기, 지도 이미지, 구두 지침 등을 전 자 디바이스를 통해 제공할 수 있다. MLID는 특정 브랜드, 제품 또는 기타 물품을 찾는 매장 내 사용자에게도 제공될 수 있으며, 사용자 인터페이스는 MLID가 작은 전문 매점의 특정 통로 및 선반 또는 거대한 목재 마당에 서 정확한 위치를 나타내는지 여부에 관계없이 일관되고 친숙한 인터페이스로 MLID를 제공할 수 있다. MLID는 또한 임의의 지도 이미지에 표시되어 사용자가 제품의 특정 위치로 내비게이션하는 것을 도와줄 수 있다. 이 예 에서 MLID는 2D 또는 3D 좌표계 또는 임의의 다른 지리 공간적 구조(예를 들어, 통로에 대한 참조 또는 임의의 통로까지의 거리)에 기초할 수 있다. 유리하게는, 사용자는 임의의 다른 주어진 저장소의 특정 또는 고유한 통 로, 선반 또는 다른 조직 참조에 관계없이 임의의 매장 또는 목적지에서 임의의 위치에 대한 임의의 제품에 대한 MLID를 듣거나, 입력하거나, 말하거나, 지정할 수 있다. 특정 사용자의 MLID의 사용은 액세스 검증 및/또는 다양한 목적을 위한 사용을 포함하여 다양한 보안, 법적 및 기타 목적을 위해 추적 및 로깅될 수 있다. MLID의 간결함, 콤팩트함 및 표준화로 인해 MLID는 시각 장애인 또는 신체 장애가 있는 사용자가 식별하고 참조 하는 데 특히 적합하다. MLID는 사용자 또는 서비스에 의해 쉽게 음성으로 전달되며, 다른 디바이스와 서비스에 서 사용하기 위해 정확한 위치를 효과적으로 전달할 수 있다. 예를 들어 시각 장애인은 자신의 정확한 위치를 알고 통신할 수 있도록 요청 시 MLID 위치의 국부적 음성 방송을 활성화할 수 있다. MLID의 표시는 신체적 또는 정신적 장애가 있는 사용자가 이 미세 위치를 학습하거나, 전달하거나 이 미세 위치에 대한 정보를 얻을 수 있 도록 점자 또는 기타 통신 방법으로 표시되거나 제공될 수 있다. MLID의 간결함, 콤팩트함 및 표준화는 시계, 스마트 안경 등과 같은 소형 디바이스를 포함하여 거의 임의의 디 바이스에서 다른 장애인을 위한 축약된 위치 참조를 용이하게 한다. 예를 들어 언어 장애가 있는 사람은 자동 탐색 기능이 있는 전자 휠체어용 내비게이션 디바이스에 일련의 MLID를 입력할 수 있다. 뇌파 또는 텔레파시 통 신은 MLID의 길이 또는 미세 위치의 기타 전달 길이를 매우 적은 자릿수로 줄이는 동시에 다양한 유형의 미세 위치 참조에 대해 상당한 세분성과 유연성을 제공하기 때문에 보다 효과적이다. MLID는 도 25에 도시된 바와 같이 착용 가능한 디바이스와 함께 표시 및 사용될 수 있고, 여기서 3825의 MLID는 특정 방 안이나 근처의 특정 위치 또는 물품을 식별한다. MLID는 디바이스 또는 물품에 할당되거나 방 안이나 근처의 2D 또는 3D 영역을 나타낼 수 있다. 어느 쪽이든 사용자 경험과 인터페이스는 사실상 동일하며, MLID가 디바이스에 할당되거나 시각적 포인터를 사용하여 미세 위치를 선택하고 식별하는 경우 사용자는 스크린이나 디 바이스에서 위치를 볼 수 있다. 또는 사용자는 AR 또는 VR 헤드셋, 스마트 안경, 기타 디스플레이를 통해 임의 의 미세 위치의 MLID를 보거나, 임의의 물품의 QR 코드 또는 기타 코드를 스캔하여 위치를 식별, 공유하거나 디 바이스 또는 미세 위치에 대한 정보를 얻거나 공유할 수 있다. 대안적으로 MLID는 장소 설정 번호 1 또는 장소 설정 번호 2에 대한 미세 위치를 참조할 수 있고, AI 지원 디지털 웨이터가 어떤 식사가 어느 장소로 배달되는 지 식별할 수 있다. 나아가 사용자는 임의의 위치(위치 또는 나무, 자동차 또는 기타 물체)에 대해 표시된 MLID 와 함께 창 안팎을 보면서 쌍안경, 망원경 또는 기타 관찰 디바이스를 사용할 수 있다. RTML 시스템의 SA, RSA 및 MLID 및 관련 정보는 또한 사용자 정의 및 선택적으로 다른 사용자에 대해 사용될 수 있다. 예를 들어, MLID를 사용하여 건물의 회의실 또는 기타 방 위치를 식별하는 데 사용자 정의된 다른 정보가 제공될 수 있다. AI 및 기타 시스템을 통해 RTML 시스템은 사용자를 구분하고 각 사용자마다 다른 인터페이스와 최적의 MLID를 제공할 수 있다. 예를 들어, 회의실, SA, RSA 및 MLID를 제어하는 고용주의 고위 종업원은 필요 에 따라 맞춤화된 특정 정보 및 서비스를 제공받을 수 있지만, 대부분의 종업원은 다른 MLID, 액세스, 정보 및 서비스를 제공받는다. 유사하게 유지 관리 및 서비스 직원에는 이 위치에서 서비스 가능한 자산과 관련하여 다 른 MLID, 액세스, 정보 및 서비스가 필요할 수 있다. 마지막으로, 근처에 거주하는 사용자는 인근 호텔이나 공 항까지 승차 공유가 필요할 가능성이 훨씬 높은 더 높은 멀리 거주하는 사용자와는 다른 MLID, 정보 및 서비스 를 제공받을 수 있다. 도 26은 출발지 또는 목적지로 사용되는 특정 MLID에 의해 촉진되는 맞춤형 승차 공유 서비스의 예를 보여준다. 승차 공유 또는 자율 주행 차량 서비스를 위한 정확한 픽업 및 하차 지점을 제공함으로써 MLID는 시간, 가격 및 기타 옵션을 나란히 또는 순차로 정확하게 비교할 수 있도록 하여 사용자가 다양한 대안적인 벤더 중에서 선택 할 수 있는 비교를 촉진하게 한다. MLID를 사용하여 근처 판매자에 액세스하는 것과 유사하게 MLID는 대안적으 로 사전 설정된 픽업 및 하차 위치를 포함하여 보다 세분화된 위치 참조를 제공하여 임의의 주어진 승차에 대한 정확한 가격/시간/제품 비교를 가능하게 하고 또한 정확한 픽업 위치를 지정함으로써 이행을 보다 효율적이고 신속하게 만든다. (예를 들어, 나는 4872 브로드 스트리트(Broad Street) 근처 47.82에 있다. 여기서 MLID 47.82는 픽업 장소의 정확한 위치를 식별한다.) 도 33 내지 도 35는 SA, RSA, MLD 및 RTML 시스템으로 수립, 개선 및 향상될 수 있는 기능적 근접도를 보여주지 만 이러한 구성 요소와 시스템이 필수적인 것은 아니다. 근접도는 웹스터(Webster)에 의하면 \"공간, 시간 또는 관계의 인근성\"으로 정의된다. 주변 및 지역 검색, 지역 길 찾기, 배달, 승차 공유 픽업 및 하차, 및 심지어 일 상적인 신체적 필요를 검색하는 범주에서 근접도는 대부분 자주 범위와 방위에 의해 정의되고 결정된다. 대부분 의 차량 내비게이션 시스템은 내비게이션 가능한 이동 옵션(주로 거리, 도로 및 하이웨이 등), 내비게이션 가능 하지 않은 지리적 장벽(예를 들어, 강, 산, 다리 등)을 고려하지만 종종 초기 및 최종 근접도는 여전히 하나의 지점에서 다른 지점으로 '까마귀가 날아가듯이' 거리로 결정된다. 그런 다음 이 근접도의 적용은 더 높은 '관계 적 근접도'를 구축하기 위해 운전, 도보 또는 기타 이동 시간을 계산하는 시스템으로 개선된다. 그러나 이러한시스템은 건물, 프로젝트, 구조물 등 내부의 로컬 위치 확인 시스템(\"LPS\") 및 건물 내부 또는 인근 영역 및 위 치에 대한 건물 내부 연결에 일상적으로 적용되지 않았다. 따라서 일반적으로 시간으로 측정되거나 또는 가능하 게는 거리로 측정되는 기능적 근접도라고 하는 새로운 유형의 근접도가 필요하다. 그러나 기능적 근접도의 초점 은 범위와 방위에 있는 것이 아니라 경로, 장애물, 길 찾기 및 접근성에 있다. 기능적 근접도는 또한 안전, 비 용, 위험 요소, 요소에 대한 노출, 장애물, 휠체어 또는 기타 요구 사항 등을 포함하여 하나 이상의 다른 요소 에 기초할 수 있다. 기능적 근접도는 제품과 서비스, 배달, 승차 공유 서비스 및 기타 것에 대한 검색을 크게 향상시킨다. 보행자를 위한 기능적 근접도는 다른 교통 수단과 다를 수 있다. 기능적 근접도는 여러 방식으로 결정될 수 있지만, 본 발명의 시스템 및 방법은 (MLID일 수는 있으나 MLID로 요구되는 것은 아니고 또는 RSA에 의해 정해질 수 있는) 일련의 중간 지점(waypoint)에 기초하여 AI와 함께 또는 AI 없이 결정된 기능적 접근도에 적용될 수 있는 확장 가능한 시스템을 생성할 수 있고, 이 중간 지점은 관련 위치와 연관되거나, 또는 AI에 의 해 관련 SA 또는 다른 영역에 걸쳐 잠재적으로 논리적으로 또는 랜덤하게 배포되거나, 또는 시스템으로 하여금 이러한 기능적 근접도 중간 지점을 사용하여 위치에 액세스하여 하나 이상의 미세 위치 간의 기능적 근접도를 결정할 수 있게 할 수 있다. 가장 일반적인 중간 지점은, 현재 전개되고 있으며 승차장®으로 알려진, 승차 공유 및 배달을 위한 새로운 유 형의 표준화된 사전 설정 픽업 및 하차 위치일 수 있다. 이러한 승차장 위치는 일반적으로 승차 공유 및 배달에 최적화되어 있으며 인근 모든 미세 위치에 대한 정확한 기능적 근접도를 제공하지 않을 수 있지만 승차장 위치 는 매우 빠르고 쉽고 효율적으로 거의 최적의 FP를 얻을 수 있는 고도로 확장 가능하고 효과적인 방법을 제공한 다. 일례에서, SA, RSA, MLID의 생성자 및 소유자는 다양한 경로, 장애물 및 기타 요소에 기초하여 최적의 승차 장 위치를 선택하거나 결정하여 하나 이상의 물체 또는 위치 간의 진정한 근접도 또는 인접도(시간, 거리 또는 일부 다른 척도)를 결정할 수 있다. 많은 기업과 기타 위치는 승차 공유 및 기타 이동 및 위치(들)를 오가는 길 찾기를 위해 최적의 승차장 위치(예를 들어, SA SCSquare 승차장 5)를 제공하고 게시할 가능성이 높다. 자전거 타는 사람, 보행자, 휠체어 등에 대한 기능적 근접도는 각각의 최적 및 관련 승차장 위치를 비교함으로써 임의 의 두 위치 사이에서 쉽게 결정될 수 있다. 두 개 이상의 기업이 기본 승차장 위치를 공유하는 경우 이들은 공 통 기본 승차장 위치를 공유하지 않는 둘 이상의 기업보다 서로 더 가깝다. 기능적 근접도에 대한 관련 위치는 승차장 위치 또는 심지어 임의의 다른 별도로 사용되는 위치일 필요는 없지만 일련의 현재 또는 심지어 디지털 기능적 근접도 기준점일 수 있다. 기능적 근접도를 사용하면 xy 또는 심지어 xyz 근접도를 참조하지 않고도 실 시간으로 인근 기업과 근접한 다른 위치를 쉽게 결정할 수 있다. 도 8을 참조하면, 본 명세서에 설명된 다양한 방법 및/또는 기능을 수행하기 위한 시스템의 예가 도시되어 있다. 도시된 바와 같이, 시스템은 사용자 디바이스(10, 20, 30, n), 서버 및 MLID 레지스트리와 같 은 네트워크에 연결된 다양한 디바이스를 포함한다. 추가적으로 또는 대안적으로, 시스템은 또한 네트워 크를 통해 서버 및/또는 레지스트리와 통신하기 위해 네트워크에 연결된 하나 이상의 소유자 전자 디바이스(단순화를 위해 하나만 도시됨)를 포함할 수 있다. 예를 들어, 광역 통신망(\"WAN\"), 근거리 통신망(\"LAN\"), 인트라넷, 무선 네트워크, 단문 메시지 서비스(\"SMS\") 또는 전화 네트워크를 포함하는 네트워크에 연결된 다양한 디바이스, 예를 들어, 다양한 모바일 및 기타 사용자 컴퓨터, 전화, 차량 내비게이션 시스템, 및 사설 또는 공공 네트워크에 연결된 다른 디바이스를 포함하여 본 명 세서에 설명된 시스템 및 방법에 따라 소유자 및/또는 사용자가 MLID를 수립, 선별, 제어, 검색 및/또는 사용하 기 위해 클라이언트, 서버 및 기타 시스템이 생성될 수 있다. 예를 들어, 임의의 이러한 네트워크는 WAN, LAN 및/또는 무선 네트워크를 포함하여 여러 상이한 유형의 네트워크를 포함할 수 있다. 다수의 다른 유형의 네트워 크를 포함하는 이러한 네트워크 중 하나는 인터넷이다. 임의의 전자 디바이스, 예를 들어 사용자 디바이스(10-n), 소유자 디바이스, 및/또는 시스템을 구현하는 다 른 디바이스는 임의의 이러한 네트워크를 통해 통신할 수 있는 데스크탑 컴퓨터, 랩탑 컴퓨터, 모바일 또는 셀 룰러 전화기, 개인용 휴대 정보 단말기(예를 들어, 팜 파일럿 디바이스, 블랙베리 디바이스 등), 안경 또는 기 타 착용 가능 컴퓨팅 디바이스, 대화형 텔레비전, 차량 또는 휴대용 내비게이션 시스템, 키오스크, 로비 또는 엘리베이터 모니터 또는 기타 전자 디바이스일 수 있다. 일반적으로, 전자 디바이스(10-n 또는 70)는 하나 이상 의 프로세서, 메모리 및/또는 저장 디바이스, 통신 인터페이스, 및/또는 사용자 인터페이스, 예를 들어 디스플 레이, 키보드, 마우스 및 기타 유형의 대화형 인터페이스(음성, 모션 등)를 포함할 수 있다. 예를 들어, 인터페 이스는 마이크로폰, 키보드, 터치스크린, 카메라 등과 같은 하나 이상의 입력 디바이스, 및 디스플레이, 스피커, 표시기 등과 같은 하나 이상의 출력 디바이스를 포함할 수 있다. 디바이스(10-n 또는 70)는 예를 들어, 본 명세서의 다른 곳에 설명된 MLID와 관련된 관심 물품에 제공되거나 관 심 물품으로 전달되는 정보 또는 파일 또는 관심 물품과 관련된 다른 정보에 MLID를 포함하는 것을 초래할 수 있는 MLID 또는 다른 요청을 입력함으로써 서버 및/또는 MLID 레지스트리와 상호 작용할 수 있다. MLID 레지스트리와 데이터베이스, 클리어링하우스, 액세스 및 제어, 회계 및 기타 모듈은 본 명세서의 다른 곳 에 설명된 수행되는 방법과 관련된 다양한 기능을 수행하기 위한 하나 이상의 하드웨어 기반 구성 요소 및/또는 소프트웨어 기반 모듈을 포함할 수 있다. 다양한 특정 목적 또는 특정 또는 특정 유형의 MLID를 위해 다수의 상 호 운용 가능하거나 별개의 MLID 레지스트리 및 모듈을 사용할 수 있다. 예를 들어, 서버는 예를 들어, 시스템에 의해 수행되는 방법에 관련된 사용자(10-n) 및/또는 다른 당사 자와 함께 예를 들어 하나 이상의 프로세서, 메모리 및/또는 저장 디바이스, 및 네트워크를 통해 통신하기 위한 통신 인터페이스를 포함하는, 하나 이상의 데이터베이스와 통신하는 하나 이상의 컴퓨터 시스템, 예를 들 어, 서버를 포함할 수 있다. 서버는 본 명세서의 다른 곳에 설명된 수행되는 방법과 관련된 다양한 기능을 수행하기 위한 하나 이상의 하드웨어 기반 구성요소 및/또는 소프트웨어 기반 모듈을 포함할 수 있다. 단 하나 의 서버만이 도시되어 있지만, 본 명세서에 설명된 기능을 수행하기 위해 협력적으로 동작하는 다수의 서버 (미도시)가 동일하거나 상이한 위치에 제공될 수 있는 것으로 이해된다. 서버의 하드웨어 및/또는 다른 구 성 요소 및/또는 시스템의 다른 구성 요소는 미국 특허 번호 5,839,088, 8,935,220 및 10,229,216(전체 내용이 본 명세서에 포함됨)에 개시된 것과 유사할 수 있다. 본 발명은 다양한 변형 및 대안적 형태를 취할 수 있지만, 특정 예가 도면에 도시되고 본 명세서에 상세히 설명 되었다. 그러나, 본 발명은 개시된 특정 형태 또는 방법으로 제한되지 않고, 반대로 본 발명은 첨부된 청구범위 내에 있는 모든 수정, 균등물 및 대안을 포함하는 것으로 이해된다."}
{"patent_id": "10-2023-7023277", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 발명은 첨부된 도면과 함께 읽을 때 다음의 상세한 설명으로부터 가장 잘 이해된다. 일반적인 관례에 따라 도면의 다양한 특징과 디자인 요소는 축척에 맞게 그려져 있지 않다는 점에 유의해야 한다. 반대로 다양한 특징 부와 디자인 요소의 치수는 명료함을 위해 임의로 확장되거나 축소된다. 도면에는 다음 그림이 포함되어 있다. 도 l은 RTML 시스템의 운영자, 재산의 소유자 및 SA, RSA 및 MLID, 및 정보 클리어링하우스의 다양한 구성 요소, 다양한 제3자 개발자, 시스템 및 서비스로의 데이터 및 정보 흐름을 포함하여 전체 RTML 시스템의 예시적 인 구성 요소 시스템 및 관련 당사자 및 주요 구성 요소를 보여주는 다이어그램이다. 도 2는 제공자, 개발자, 서비스 및 최종 사용자를 매핑하기 위한 정보 클리어링하우스를 통한 RTML 데이터 및 정보의 흐름뿐만 아니라 이러한 당사자로부터 재산 및 SA의 소유자 및 운영자로의 데이터의 사용, 조정 및 기타 데이터와 결제 흐름을 포함하여 RTML 시스템의 예시적인 구성 요소 시스템 및 관련 당사자 특징부를 보여주는 다이어그램이다. 도 3은 RTML 레지스트리 시스템의 예에 포함될 수 있는 액세스 시스템 및 방법으로서 SA, RSA, MLID 및 RTML 레 지스트리 시스템의 생성, 저장, 관리, 배포, 추적 및 사용과 관련된 예시적인 구성 요소 시스템 및 관련 참여자 및 관계를 보여주는 다이어그램이다. 도 4는 글로벌 시스템, 글로벌 시스템의 로컬 부분, 자기 중심적 앵커 및 변수를 갖는 구체적으로 정의된 SA, 및 맞춤 설계된 RSA를 포함하여 RSA를 정의하고 구현하기 위한 대안적 카테고리 및 대안적 방법의 예를 보여주 는 다이어그램이다. 도 5는 레지스트리 및 검증, 액세스 및 제어 도구, 회계 및 소액 결제 엔진, 데이터 잔해, 보고, 반복 개선 및 분석을 포함하여 RTML 시스템의 특징부 및 모듈의 예시적인 구조적 구성 요소를 보여주는 다이어그램이다. 도 6은 SA 또는 RSA의 사용 또는 선택, MLID의 인코딩 및 디코딩, 선택적으로 MLID와 관련된 정보 및 서비스에 의 액세스, 사용 로깅, 및 기본 SA 또는 MLID 정보 또는 RSA 구현의 선택적 반복 및 개선을 포함할 수 있는 예 시적인 MLID 액세스 및 처리 단계를 보여주는 개략도이다. 도 7은 SA 또는 선택적 SA의 식별 가능성과 이용 가능성 또는 MLID 및/또는 향후 MLID에 대한 적절한 SA의 생성 에 기초한 예시적인 MLID 분석 논리 및 흐름을 보여주는 개략도이다. 도 8은 본 명세서의 시스템 및 방법에 따라 MLID를 등록 및/또는 사용하기 위한 시스템의 예시적인 네트워크 아 키텍처를 보여주는 개략도이다. 도 9는 SA가 UTM 셀 내에 완전히 포함되지 않은 글로벌 시스템(UTM)의 일부를 참조하여 대안적인 SA 및 RSA를 보여주는 도면이다. 도 10은 예상되는 정밀도에 기초한 가능성 있는 자릿수에 대한 옵션 및 지리 공간 논리(아래에 정의됨)를 보장 하기 위한 옵션의 스케줄과 임의의 주어진 SA에 대한 적절한 RSA를 자동으로 결정하기 위한 예시적인 논리 시퀀 스 및 흐름을 도시한다. 도 11은 기본 RSA에 대한 SA의 크기 및 커버리지 및 원하는 정밀도 수준에 기초하여 SA와 RSA 사이의 관계에 따 라 자릿수를 자동으로 결정하기 위한 2개의 예시적인 프로세스(100 미터 및 1 킬로미터)를 도시한다. 도 12는 원하는 동작 지리 정보 논리 및 정밀도에 기초하여 기본 RSA의 형식뿐만 아니라 소유자가 암호화, 암호 화 키 또는 지리 정보 논리 없이 랜덤화된 RSA를 선택하는 시퀀스와 흐름을 선택하거나 결정하기 위한 예시적인 시퀀스 및 흐름의 다이어그램을 포함한다. 도 13은 향후 SA 이름 및 참조를 개선하기 위해 사용자 사용 및 관련 영역 참조를 모니터링하기 위해 AI의 사용 을 포함하여 실시간으로 연관된 이름 및 SA에 대한 참조를 반복할 뿐만 아니라 기존 명명된 장소, 신원을 갖는 정의된 SA 이름 및 참조를 처리하기 위한 예시적인 논리 시퀀스 및 흐름을 도시한다. 도 14는 각각 2, 4, 6, 8 및 10 자릿수의 MLID로 표준화된 10km, 1km, 100m, 10m 및 1m 정밀한 참조를 제공하 도록 구조화된 대안적인 MLID 영역 참조를 갖는, 주요 도시 주변 지역을 커버하기 위한 예시적인 100 X 100-킬 로미터 SA 및 RSA의 예를 예시하는 일련의 지도 이미지를 포함한다. 도 15는 호수 위 또는 주변의 특정 위치에 대한 MLID 참조를 보여주는 예시적인 지도 및 위성 이미지를 포함한다. 도 16은 임의의 주어진 미세 위치에 대한 MLID에서 필요한 자릿수를 최소화하기 위해 SA 및 RSA에 대한 앵커로 부터의 상대적인 거리에 따라 가변하는 길이를 갖는 MLID를 가능하게 하는 가변 RSA의 예의 다이어그램을 포함 한다. 도 17은 SA의 앵커에 대한 참조된 미세 위치의 위치에 기초하여 2, 4, 6 및 8 자릿수의 MLID를 갖는 자동화된 변수 RSA의 예를 예시하는 일련의 지도 이미지를 포함한다. 도 18은 SA의 앵커로부터의 거리에 기초하여 다수의 위치에 대한 4, 6 및 8 자릿수의 가변적인 RSA LID를 보여 주는 예시적인 지도 이미지를 포함한다. 도 19는 SA의 앵커로부터의 거리에 기초하여 다수의 위치에 대한 4, 6 및 8 자릿수의 가변적인 RSA LID를 보여 주는 예시적인 위성 이미지를 포함한다. 도 20은 SA 및 RSA에 기초하여 정의된 드론 착륙 및 접근 경로의 예에 더하여 건물 주변의 3차원 SA 및 RSA, 승 차 공유, 건물 내부 및 드론 착륙 구역을 위한 미세 위치를 정의하는 예시를 포함한다. 도 21은 건축된 건물의 디지털 복제 또는 트윈으로 기본 재산 및 건물과 관련된 정보를 구성, 캡처 및 표시하기 위해 MLID를 사용하는 것과 함께 건물에 대한 3차원 SA 및 RSA를 정의하는 예를 포함한다. 도 22는 텍스트 메시지 및 이메일을 통해 표시되고 공유되는 특정 재산, SA 및 RSA와 관련된 미세 위치에 대한 MLID를 공유하기 위한 예시적인 방법을 포함한다. 도 23은 특정 SA 및 RSA 내의 다양한 위치에 할당된 다수의 MLID를 SA 및 MLID를 참조하여 접근되는 RTML 정보 와 함께 공유하는 예를 보여준다. 도 24는 특정 SA 및 RSA에 대한 미세 위치를 참조하고 공유하기 위한 MLID와, 텍스트, 채팅, 매핑 및 공유를 위 한 다양한 관련 기능을 표시하는 모바일 애플리케이션의 예를 보여준다. 도 25는 방에 대한 SA 또는 RSA의 미세 위치를 참조하기 위해 착용 가능한 디바이스에 MLID를 표시하는 예를 보 여준다. 도 26은 가격, 시간 및 서비스를 비교하기 위해 사용자가 특정 MLID를 오가는 여행에 대한 대안적인 승차 공유 서비스를 신속하게 시작할 수 있도록 하는 모바일 웹 애플리케이션의 스크린샷 시퀀스의 예를 보여준다. 도 27은 MLID에 대한 대안적인 RSA 구조를 갖는 좌석을 포함하는 특정 미세 위치에 대한 MLID를 갖는 대형 경기 장에 대한 SA, RSA 및 MLID의 예를 보여준다. 도 28은 AI 시스템의 주요 구성 요소뿐만 아니라 SA, RSA 및 MLID의 참조 및 사용을 개선하고 향상시키기 위해 SA, RSA 및 MLID의 사용을 캡처하고 분석하는 AI 및 ML 엔진의 다양한 예시적인 구성 요소를 보여준다. 도 29는 이러한 SA와 관련된 미세 위치를 지정하고 식별하기 위해 레코드 및 필드와 연관된 MLID를 사용하는 스 프레드시트 데이터베이스의 예를 보여준다. 도 30은 지리 공간 및 RTML 검색, 분류, 조작 및 기타 기능을 위한 기존 도구의 사용을 가능하게 하기 위해 예 시적인 스프레드시트 데이터베이스에서 지리 공간 로케이터 및 식별자로서 MLID를 이용하는 예를 보여준다. 도 31은 고급 지리 공간 및 RTML 검색, 분류, 조작 및 기타 기능을 위해 기존 스프레드시트 도구를 사용할 수 있도록 예시적인 스프레드시트 데이터베이스에서 가변 크기 영역 및 정밀도 수준을 갖는 지리 정보 로케이터로 서 MLID를 사용하는 예를 보여준다. 도 32는 고급 지리 정보 및 RTML 검색, 분류, 조작 및 기타 기능을 위해 기존 스프레드시트 도구를 사용할 수 있도록 예시적인 스프레드시트 데이터베이스에서 가변 크기 영역 및 정밀도 수준을 나타내는 계층적 지리 정보 로케이터로서 MLID를 사용하는 예를 보여준다. 도 33은 의도된 목적지에 대한 최적의 승차 공유 하차 및 픽업 위치를 결정하기 위해 MLID로 기능적 근접도를 결정 및 사용하는 예의 다이어그램을 도시한다. 도 34는 최적의 승차 공유 하차 및 픽업 위치를 결정하기 위해 건물 구조물 내부 위치에 대한 MLID를 사용한 기 능적 근접도를 결정 및 사용하는 예의 다이어그램을 도시한다. 도 35는 건물 및 기타 구조물의 입구로부터 최적의 승차 공유 하차 및 픽업 위치를 결정하기 위해 건물 및 기타 구조물 내부의 위치에 대한 MLID로 기능적 근접도를 결정 및 사용하는 예의 다이어그램을 도시한다. 도 36은 강, 도로, 하이웨이 등과 같은 세장형 지역에 대해 가변 크기의 SA, RSA, MLID를 결정하고 사용하는 예 를 도시한다. 도 37은 다양한 크기의 영역에 대한 글로벌 시스템의 구성요소에 기초하여 RSA에 대해 SA 및 MLID를 명명하고 연관시키는 예를 도시한다."}
