{"patent_id": "10-2022-0055641", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0155866", "출원번호": "10-2022-0055641", "발명의 명칭": "폐음을 기초로 인공호흡기 튜브의 막힘 정도를 식별하는 시스템, 및 제어 방법", "출원인": "주식회사 소연메디칼", "발명자": "박만식"}}
{"patent_id": "10-2022-0055641", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "시스템에 있어서,인공호흡기 튜브에 설치되어 폐음을 수신하는 마이크; 및상기 폐음이 변환된 오디오 데이터를 기초로 상기 인공호흡기 튜브의 막힘 정도를 식별하는, 프로세서;를 포함하는, 시스템."}
{"patent_id": "10-2022-0055641", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 프로세서는,상기 오디오 데이터에 대하여 주파수 변환을 수행하여 오디오 특성을 획득하고, 상기 획득된 오디오 특성을 기초로 상기 인공호흡기 튜브의 막힘 정도를 식별하는, 시스템."}
{"patent_id": "10-2022-0055641", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 프로세서는,상기 오디오 데이터에 STFT(Short-Time Fourier Transform)를 적용하여 스펙트로그램을 획득하고,상기 획득된 스펙트로그램에 Gray Filtering을 수행하여 그레이 이미지를 획득하고,상기 획득된 그레이 이미지에 Convolution Masking을 수행하여 콘볼루션 이미지를 획득하고,상기 획득된 콘볼루션 이미지에 포함된 라인의 수에 따라 상기 인공호흡기 튜브의 막힘 정도를 산출하는, 시스템."}
{"patent_id": "10-2022-0055641", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 프로세서는,상기 마이크를 통해 획득된 제1 오디오 데이터를 호기음의 주기에 따라 복수의 서브 데이터로 구분하고,상기 구분된 복수의 서브 데이터의 평균을 산출하여 제2 오디오 데이터를 획득하고,상기 제2 오디오 데이터에 상기 STFT를 적용하여 상기 스펙트로그램을 획득하는, 시스템."}
{"patent_id": "10-2022-0055641", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 막힘 정도는,상기 인공호흡기 튜브의 단면 내에서 이물질에 의해 막힌 영역의 비율, 및 이물질이 상기 인공호흡기 튜브의 길이 방향에 따라 분포한 길이 중 적어도 하나를 포함하는, 시스템."}
{"patent_id": "10-2022-0055641", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 프로세서는,공개특허 10-2023-0155866-3-상기 오디오 데이터에 MFCC(Mel Frequency Cepstral Coefficient)를 적용하여 복수의 계수의 값을 획득하고,상기 획득된 복수의 계수의 값 중 적어도 하나를 기반으로 상기 인공호흡기 튜브의 막힘 정도를 식별하는, 시스템."}
{"patent_id": "10-2022-0055641", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 프로세서는,상기 인공호흡기 튜브의 막힘 정도가 각각 제1 상태, 제2 상태, 제3 상태일 때, 상기 마이크를 통해 수신되는오디오 데이터에 MFCC를 적용하여 상태 별로 상기 복수의 계수의 값을 획득하고,상기 복수의 계수 중 상태 별 편차가 큰 계수를 선택하고,상기 선택된 계수의 값을 바탕으로, 상기 인공호흡기 튜브의 막힘 정도를 모니터링하는, 시스템."}
{"patent_id": "10-2022-0055641", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 시스템은,상기 인공호흡기 튜브를 통과하는 기체의 압력 또는 유량을 측정하기 위한 적어도 하나의 센서;를 더 포함하고,상기 프로세서는,상기 센서를 통해 획득된 센싱 데이터를 바탕으로, 상기 인공호흡기 튜브의 막힘 정도를 모니터링하는, 시스템."}
{"patent_id": "10-2022-0055641", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "시스템의 제어 방법에 있어서,인공호흡기 튜브에 설치된 마이크를 통해, 폐음을 수신하는 단계; 및상기 폐음이 변환된 오디오 데이터를 기초로 상기 인공호흡기 튜브의 막힘 정도를 식별하는 단계;를 포함하는,시스템의 제어 방법."}
{"patent_id": "10-2022-0055641", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "시스템이 개시된다. 본 시스템은, 인공호흡기 튜브에 설치되어 폐음을 수신하는 마이크, 및 폐음이 변환된 오디 오 데이터를 기초로 인공호흡기 튜브의 막힘 정도를 식별하는 프로세서를 포함한다."}
{"patent_id": "10-2022-0055641", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 폐음을 기초로 인공호흡기 튜브의 막힘 정도를 식별하는 시스템에 관한 것으로, 보다 상세하게는, 폐 음의 오디오 데이터를 주파수 변환하여 막힘 정도를 판단하는 시스템이며, 보조적으로는 압력 센서와 기체 유량 센서를 선택적으로 사용하여 측정 신뢰성을 향상시키는 장치에 관한 것이다."}
{"patent_id": "10-2022-0055641", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공호흡기는 호흡 곤란을 치료하고 합병증을 줄일 수 있어, 환자의 생명을 연장해 줄 수 있는 현대의학의 매우 중요한 의료장치로, 최근 유행하는 코로나 외 고혈압, 심장병, 각종 호흡기 질환에 사용되고 있다. 인공호흡기와 연관한 장비인 의료용 온습도 조절기는 일반적으로 온도계가 구비된 워터챔버와 조절기 본체, 호 흡튜브로 구성되며, 적절하게 가온 및 가습된 가스를 공급하기 위한 기술이 필요하다. 환자의 호흡가스를 데워주거나 습도를 조절하기 위한 의료기기로 비강 고유량 치료, 수면 무호흡증 치료 등 외 부에서 힘이나 기구를 이용하여 분당 환기량을 공급하는 기계적 환기가 필요한 환자들에게 주로 사용되며, 특히 호흡곤란, 저산소증을 호소하는 코로나의 중증 환자에게 필수로, 환자의 상태 등을 모니터링을 위한 기술 개발 이 활발하게 진행되고 있다. 선행기술문헌 특허문헌(특허문헌 0001) 공개특허공보 제10-2021-0032919호(호흡과 관련된 소리를 분석하기 위한 방법, 시스템 및 비일 시성의 컴퓨터 판독 가능한 기록 매체)"}
{"patent_id": "10-2022-0055641", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 폐음에 따라 인공호흡기 자체의 결함을 감지하여 알릴 수 있는 시스템 및 제어 방법을 제공한다. 특히, 본 개시는, 인공호흡기 튜브의 막힘 정도를 판별하는 데에 유의미한 오디오 특성을 추출하기 위해 주파수 변환을 수행하는 시스템의 구체적인 동작을 제공한다. 더불어 측정의 정확성을 향상시키기 위하여 공기의 압력 또는 유량을 측정하여 전체적인 막힘 정도를 판별한다. 또한 폐음을 측정하는데 있어서 주변의 환경 음향잡음의 영향을 감소시키기 위한 자동 주변 음향잡음 제거기능 을 가진다. 본 개시의 목적들은 이상에서 언급한 목적으로 제한되지 않으며, 언급되지 않은 본 개시의 다른 목적 및 장점들 은 하기의 설명에 의해서 이해될 수 있고, 본 개시의 실시 예에 의해 보다 분명하게 이해될 것이다. 또한, 본 개시의 목적 및 장점들은 특허 청구 범위에 나타낸 수단 및 그 조합에 의해 실현될 수 있음을 쉽게 알 수 있을 것이다."}
{"patent_id": "10-2022-0055641", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시 예에 따른 시스템은, 인공호흡기 튜브에 설치되어 폐음을 수신하는 마이크, 상기 폐음이 변 환된 오디오 데이터를 기초로 상기 인공호흡기 튜브의 막힘 정도를 식별하는, 프로세서를 포함한다. 상기 프로세서는, 상기 오디오 데이터에 대하여 주파수 변환을 수행하여 오디오 특성을 획득하고, 상기 획득된 오디오 특성을 기초로 상기 인공호흡기 튜브의 막힘 정도를 식별할 수 있다. 이 경우, 상기 프로세서는, 상기 오디오 데이터에 STFT(Short-Time Fourier Transform)를 적용하여 스펙트로그 램을 획득하고, 상기 획득된 스펙트로그램에 Gray Filtering을 수행하여 그레이 이미지를 획득하고, 상기 획득 된 그레이 이미지에 Convolution Masking을 수행하여 콘볼루션 이미지를 획득하고, 상기 획득된 콘볼루션 이미 지에 포함된 라인의 수에 따라 상기 인공호흡기 튜브의 막힘 정도를 산출할 수 있다. 여기서, 상기 프로세서는, 상기 마이크를 통해 획득된 제1 오디오 데이터를 호기음의 주기에 따라 복수의 서브 데이터로 구분하고, 상기 구분된 복수의 서브 데이터의 평균을 산출하여 제2 오디오 데이터를 획득하고, 상기 제2 오디오 데이터에 상기 STFT를 적용하여 상기 스펙트로그램을 획득할 수도 있다. 상기 막힘 정도는, 상기 인공호흡기 튜브의 단면 내에서 이물질에 의해 막힌 영역의 비율, 및 이물질이 상기 인 공호흡기 튜브의 길이 방향에 따라 분포한 길이 중 적어도 하나를 포함할 수 있다. 상기 프로세서는, 상기 오디오 데이터에 MFCC(Mel Frequency Cepstral Coefficient)를 적용하여 복수의 계수의 값을 획득하고, 상기 획득된 복수의 계수의 값 중 적어도 하나를 기반으로 상기 인공호흡기 튜브의 막힘 정도를 식별할 수 있다. 이 경우, 상기 프로세서는, 상기 인공호흡기 튜브의 막힘 정도가 각각 제1 상태, 제2 상태, 제3 상태일 때, 상 기 마이크를 통해 수신되는 오디오 데이터에 MFCC를 적용하여 상태 별로 상기 복수의 계수의 값을 획득하고, 상 기 복수의 계수 중 상태 별 편차가 큰 계수를 선택하고, 상기 선택된 계수의 값을 바탕으로, 상기 인공호흡기 튜브의 막힘 정도를 모니터링할 수 있다. 한편, 상기 시스템은, 상기 인공호흡기 튜브를 통과하는 기체의 압력 또는 유량을 측정하기 위한 적어도 하나의 센서를 더 포함할 수 있다. 이 경우, 상기 프로세서는, 상기 센서를 통해 획득된 센싱 데이터를 바탕으로, 상기 인공호흡기 튜브의 막힘 정도를 모니터링할 수 있다. 본 개시의 일 실시 예에 따른 시스템의 제어 방법은, 인공호흡기 튜브에 설치된 마이크를 통해, 폐음을 수신하 는 단계, 상기 폐음이 변환된 오디오 데이터를 기초로 상기 인공호흡기 튜브의 막힘 정도를 식별하는 단계를 포 함한다.더불어 폐음에 의한 튜브의 막힘 정도 측정의 신뢰성과 정확성을 올리기 위하여 인공호흡기 튜브에 함께 설치된 공기 압력센서 또는 공기유량센서로 공기의 흐름에 관한 부가정보를 습득하여 신호처리에 함께 사용한다."}
{"patent_id": "10-2022-0055641", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시에 따른 시스템은, 폐음을 분석하여 인공호흡기 튜브의 막힘 정도를 정량적으로 분석해내어 인공호흡기 내지는 호흡관 장치의 원활한 작동 여부를 실시간으로 모니터링할 수 있다. 본 개시에 따른 시스템은, 인공호흡기 튜브의 막힘 정도와 연관성을 가지는 폐음의 구체적인 오디오 특성을 추 출할 수 있는 구체적인 알고리즘을 활용한다는 점에서 종래 기술과 다른 독창적인 효과를 가지고 있다. 또한 시스템의 신뢰성을 향상시키기 위하여 압력 또는 유량신호를 측정하여 전체적인 신호처리에 함께 사용한다."}
{"patent_id": "10-2022-0055641", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시에 대하여 구체적으로 설명하기에 앞서, 본 명세서 및 도면의 기재 방법에 대하여 설명한다. 먼저, 본 명세서 및 청구범위에서 사용되는 용어는 본 개시의 다양한 실시 예들에서의 기능을 고려하여 일반적 인 용어들을 선택하였다. 하지만, 이러한 용어들은 당해 기술 분야에 종사하는 기술자의 의도나 법률적 또는 기 술적 해석 및 새로운 기술의 출현 등에 따라 달라질 수 있다. 또한, 일부 용어는 출원인이 임의로 선정한 용어 도 있다. 이러한 용어에 대해서는 본 명세서에서 정의된 의미로 해석될 수 있으며, 구체적인 용어 정의가 없으 면 본 명세서의 전반적인 내용 및 당해 기술 분야의 통상적인 기술 상식을 토대로 해석될 수도 있다. 또한, 본 명세서에 첨부된 각 도면에 기재된 동일한 참조번호 또는 부호는 실질적으로 동일한 기능을 수행하는 부품 또는 구성요소를 나타낸다. 설명 및 이해의 편의를 위해서 서로 다른 실시 예들에서도 동일한 참조번호 또 는 부호를 사용하여 설명한다. 즉, 복수의 도면에서 동일한 참조 번호를 가지는 구성요소를 모두 도시되어 있다 고 하더라도, 복수의 도면들이 하나의 실시 예를 의미하는 것은 아니다. 또한, 본 명세서 및 청구범위에서는 구성요소들 간의 구별을 위하여 \"제1\", \"제2\" 등과 같이 서수를 포함하는 용어가 사용될 수 있다. 이러한 서수는 동일 또는 유사한 구성요소들을 서로 구별하기 위하여 사용하는 것이며이러한 서수 사용으로 인하여 용어의 의미가 한정 해석되어서는 안 된다. 일 예로, 이러한 서수와 결합된 구성 요소는 그 숫자에 의해 사용 순서나 배치 순서 등이 제한되어서는 안 된다. 필요에 따라서는, 각 서수들은 서로 교체되어 사용될 수도 있다. 본 명세서에서 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함하다\" 또는 \"구성되다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이 들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성 요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 개시의 실시 예에서 \"모듈\", \"유닛\", \"부(part)\" 등과 같은 용어는 적어도 하나의 기능이나 동작을 수행하는 구성요소를 지칭하기 위한 용어이며, 이러한 구성요소는 하드웨어 또는 소프트웨어로 구현되거나 하드웨어 및 소프트웨어의 결합으로 구현될 수 있다. 또한, 복수의 \"모듈\", \"유닛\", \"부(part)\" 등은 각각이 개별적인 특정 한 하드웨어로 구현될 필요가 있는 경우를 제외하고는, 적어도 하나의 모듈이나 칩으로 일체화되어 적어도 하나 의 프로세서로 구현될 수 있다. 또한, 본 개시의 실시 예에서, 어떤 부분이 다른 부분과 연결되어 있다고 할 때, 이는 직접적인 연결뿐 아니라, 다른 매체를 통한 간접적인 연결의 경우도 포함한다. 또한, 어떤 부분이 어떤 구성요소를 포함한다는 의미는, 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것 을 의미한다. 도 1a는 본 개시의 일 실시 예에 따른 시스템의 구성을 설명하기 위한 블록도이다. 도 1a를 참조하면, 시스템은 마이크 및 프로세서를 포함할 수 있다. 시스템은 적어도 하나 의 인공호흡기용 호흡관 장치와 결합된 적어도 하나의 전자 기기를 포함할 수 있다. 인공호흡기용 호흡관 장치는, 환자와 인공호흡기 사이에 마련되어, 환자로부터 공급되는 호흡가스와 환자로부터 배출되는 배출가스를 상호 분기시키는 분기부를 포함할 수 있다. 분기부를 기준으로 하나 이상의 인공호흡기 튜 브(: 분기관)가 형성될 수 있다. 구체적으로, 분기부는, Y자 형상으로 구성될 수 있으며, 환자와 연결되는 제1 분기관, 제1 분기관과 인공호흡기 사이를 연결하여 호흡가스를 환자로 공급시키는 제2 분기관, 및 제1 분기관과 인공호흡기 사이를 연결하여 환자 로부터 배출되는 배출가스를 인공호흡기로 유입시키는 제3 분기관을 포함할 수 있다. 분기부(: 분배기)의 구조 및 분기부에 내장될 수 있는 센서와 관련된 구체적인 내용은 도 10을 통해 후술한다. 마이크는 폐음을 수신하기 위한 구성으로, 상술한 분기부 내지는 적어도 하나의 인공호흡기 튜브 상에 설 치될 수 있다. 마이크는 오디오 신호를 전기적인 신호로 변환하기 위한 적어도 하나의 변환기를 포함할 수 있다. 프로세서는 시스템을 전반적으로 제어하기 위한 구성이다. 프로세서는 마이크와 연결되어 오디오 신호가 변환된 오디오 데이터를 획득할 수 있다. 프로세서는 CPU, AP, DSP(Digital Signal Processor) 등과 같은 범용 프로세서, GPU, VPU(Vision Processing Unit) 등과 같은 그래픽 전용 프로세서 또는 NPU와 같은 인공지능 전용 프로세서 등을 포함할 수 있 다. 인공지능 전용 프로세서는, 특정 인공지능 모델의 훈련 내지는 이용에 특화된 하드웨어 구조로 설계될 수 있다. 본 개시의 일 실시 예에 따른 프로세서는 마이크를 통해 수신된 폐음이 변환된 오디오 데이터를 기초 로 인공호흡기 튜브의 막힘 정도를 식별할 수 있다. 여기서, 막힘 정도는, 인공호흡기 튜브의 단면 내에서 이물질에 의해 막힌 영역의 비율, 및 이물질이 인공호흡 기 튜브의 길이 방향에 따라 분포한 길이 중 적어도 하나를 포함할 수 있다. 막힘 정도는, 후술할 도 5를 통해 보다 쉽게 이해될 수 있다. 프로세서는 오디오 데이터에 대하여 주파수 변환을 수행하여 오디오 특성을 획득하고, 획득된 오디오 특성 을 기초로 인공호흡기 튜브의 막힘 정도를 식별할 수 있는 바, 이하 도면들을 통해 보다 자세히 설명한다. 도 1b는 본 개시의 일 실시 예에 따른 시스템의 기능적 구성을 설명하기 위한 블록도이다. 도 1b를 참조하면, 마이크는 외부 잡음 검출 마이크 및 폐음 검출 마이크(112. 폐음 검출 센서로도 지칭 가능)를 각각 포함할 수 있다. 일 예로, 폐음 검출 마이크는 분기부 내지는 인공호흡기 튜브 내에 설 치될 수 있고, 외부 잡음 검출 마이크는 인공호흡기 튜브의 외부 시작점 내지는 외측면에 설치될 수 있으 나, 이에 한정되지 않는다. 도 1b를 참조하면, 시스템은 능동 소음 제거 및 자동 이득 제어를 위한 모듈, ADC(아날로그 디지털 컨버터) 및 폐음 신호 처리를 위한 DSP(Digital Signal Processor)를 각각 포함할 수 있다. 본 모듈들은, 소프 트웨어 및/또는 하드웨어로 구성될 수 있으며, 프로세서의 제어에 따라 동작할 수 있다. 일 실시 예로, 시스템은 폐음 검출 마이크를 통해 획득된 오디오 데이터에서 외부 잡음 검출 마이크 를 통해 획득된 잡음 데이터에 매칭되는 신호를 적어도 일부 차감하여 외부 잡음의 영향을 최소화할 수 있 다. 이때, 시스템은 잡음이 최소화된 폐음 오디오 데이터를 디지털 신호로 변환하고(아날로그 -> 디지털 변 환), 디지털로 변환된 폐음 오디오 신호를 분석하여 인공호흡기 튜브의 막힘 정도 등을 식별할 수 있다. 도 2는 본 개시의 일 실시 예에 따른 시스템의 제어 방법을 설명하기 위한 흐름도이고, 도 3은 본 개시의 일 실 시 예에 따른 시스템이 오디오 데이터를 단계 별로 처리하는 과정을 설명하기 위한 도면이다. 먼저, 프로세서는 오디오 데이터에 STFT(Short-Time Fourier Transform)를 적용하여 스펙트로그램을 획득 할 수 있다(S210). 구체적으로, 도 3을 참조하면, 프로세서는 마이크를 통해 획득된 오디오 데이터를 호기음의 주 기에 따라 복수의 서브 데이터로 구분할 수 있다. 호기음은, 호흡관 장치의 호기음에 해당할 수 있으며, 일정 주기에 따라 감지될 수 있다. 각 서브 데이터는, 호 기음과 호기음 사이의 시간 구간에 대한 오디오 데이터에 해당한다. 여기서, 프로세서는 구분된 복수의 서브 데이터의 평균을 산출하여 오디오 데이터를 획득할 수 있다. 그리고, 프로세서는 오디오 데이터에 STFT를 적용하여 스펙트로그램을 획득할 수 있다. 이 경우, 프로세서는 일정 구간만큼 중첩되면서 순차적으로 이어지는 프레임에 따라 오디오 데이터를 부분부분 추출하여 주파수 변환을 수행할 수 있다. 이때, 각 프레임의 길이(: 윈도우의 길이)가 길수록 주파수 해상도가 높고, 짧을수록 시간 해상도가 높다. 그리고, 프로세서는 획득된 스펙트로그램에 Gray Filtering을 수행하여 그레이 이미지를 획득할 수 있다(S220). Gray Filtering은, 이미지의 밝기는 유지하면서 색상과 채도 정보를 제거하기 위한 동작으로, 예를 들어 RGB 이 미지를 그레이 이미지로 변환하기 위한 과정이다. 다음으로, 프로세서는 그레이 이미지에 Convolution Masking을 수행하여 콘볼루션 이미지를 획 득할 수 있다(S230). Convolution Masking은, 각각의 대상 픽셀에 대하여, 대상 픽셀과 그 주변 픽셀들을 활용하여 새로운 픽셀 값을 얻는 일종의 공간 영역 필터링에 해당할 수 있다. 이 경우, 대상 픽셀에 적용되는 가중치를 가운데 값으로 하는 마스크(ex. 3 by 3 pixels mask, 5 by 5 pixels mask 등)가 활용될 수 있으며, 마스크 내 각 픽셀 가중치의 합은 0에 해당할 수 있다. 예를 들어, 이하와 같은 마스크들 중 하나가 활용될 수 있다."}
{"patent_id": "10-2022-0055641", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "그 결과, 인접한 픽셀 값 간의 차이가 큰 부분일수록 더 강조된 콘볼루션 이미지가 획득될 수 있다. 그리고, 프로세서는 획득된 콘볼루션 이미지에 포함된 라인의 수에 따라 인공호흡기 튜브의 막힘 정 도를 식별할 수 있다(S240).관련하여, 도 4는 본 개시의 시스템의 성능과 관련하여 실험적으로 확인된 오디오 특성과 막힘 정도의 상관 관 계를 설명하기 위한 도면이다. 도 4의 좌측에는, 막힘 정도의 수치(0, 20, 50, 80 %)마다 상술한 과정(도 2, 도 3)을 통해 획득된 콘볼루션 이 미지로부터 라인만이 남겨진 이미지들이 도시되어 있다. 도 4의 우측 그래프를 참조하면, 막힘 정도의 수치에 따라 선의 개수가 달라지는 것이 확인된다. 전반적으로, 막힘 정도가 20 %를 넘어간 이후부터는 막힘 정도가 클수록 라인의 수가 줄어드는 경향성이 확인된다. 한편, 막 힘 정도가 0%에서 20% 사이인 경우 이러한 경향성이 명확하지 않으나, 추가적인 실험을 통해 다른 양상이 나타 나는 것도 가능한 것으로 보인다. 즉, 프로세서는 상술한 S240 과정에서 이미지에 포함된 라인의 수에 따라 인공호흡기 튜브의 막힘 정 도를 식별할 수 있다. 구체적으로, 프로세서는 실시간으로 수신되는 폐음의 오디오 데이터를 상술한 과정 (도 2, 도 3)에 따라 처리하여 라인의 수를 식별하고, 식별된 라인의 수를 바탕으로 막힘 정도를 판단할 수 있 다. 이를 위해, 시스템의 메모리 상에는 막힘 정도에 매칭되는 라인의 수에 대한 정보가 저장될 수 있다. 이 경우, 프로세서는 콘볼루션 이미지에 포함된 라인의 수 및 메모리에 저장된 상술한 정보를 활용하여 인공호흡기 튜브의 막힘 정도를 식별할 수 있다. 한편, 상술한 실시 예들을 통해서는 주로 막힘 정도에 있어 단면적이 막힌 비율(ex. 20%, 50%, 80%)을 위주로 설명되었으나, 본 개시에 따른 프로세서는 이물질에 따라 막힌 영역의 튜브 방향의 길이를 식별할 수도 있 다. 관련하여, 도 5는 인공호흡기 튜브의 막힘 정도와 길이 개념을 설명하고 비교 방식을 표현하기 위한 도면이다. 도 5를 참조하면, 인공호흡기 튜브의 단면이 20%, 50%, 80% 비율로 막힌 비교군 외에, 인공호흡기 튜브의 길이 방향으로 이물질이 5mm, 15mm, 30mm 길이로 채워진 비교군이 제공될 수 있다. 즉, 단면이 막힌 비율 및/또는 이물질이 채워진 길이에 따라 오디오 데이터의 오디오 특성(ex. 라인의 수, 라인 의 분포, 라인의 선명도 등)가 구분될 수 있는 바, 프로세서는 오디오 데이터의 오디오 특성을 활용하여 막힘 정도를 상세하게 파악하는 것도 가능하다. 그리고, 막힘 정도를 판단하기 위한 폐음의 오디오 특성은, 상술한 STFT 기반의 콘볼루션 이미지의 라인의 수 외에도, 다양한 기법에 의해 획득되는 적어도 하나의 변수로 구성될 수 있다. 일 실시 예로, 프로세서는 오디오 데이터에 MFCC(Mel Frequency Cepstral Coefficient)를 적용하여 복수 의 계수의 값을 획득하고, 획득된 복수의 계수의 값 중 적어도 하나를 기반으로 인공호흡기 튜브의 막힘 정도를 식별할 수 있다. 관련하여, 도 6은 인공호흡기 튜브의 막힘 정도에 따른 표준 MFCC의 계수 값의 차이를 설명하기 위한 도면이다. 도 6은, 도 5에서 5mm를 기준으로 단면의 막힘 비율(20%, 50%, 80%)을 다르게 한 경우 각각의 계수 값을 비교한 결과를 도시한 것이다. 프로세서는 인공호흡기 튜브의 막힘 정도가 각각 제1 상태(ex. 5mm-20%), 제2 상태(ex. 5mm-50%), 제3 상 태(ex. 5mm-80%)일 때, 마이크를 통해 수신되는 오디오 데이터에 MFCC를 적용하여 상태 별로 복수의 계수 의 값을 획득하고, 복수의 계수 중 상태 별 편차가 큰 계수를 선택할 수 있다. 즉, 도 6을 참조하면, 4가지 정도(ex. Coefficient 5, 7, 8, 10)의 계수가 유의미한 차이를 보였기 때문에, 해 당 계수들이 선택될 수 있다. 이후, 프로세서는 선택된 계수의 값을 바탕으로 인공호흡기 튜브의 막힘 정도를 모니터링할 수 있다. 구체 적으로, 프로세서는 실시간으로 수신되는 폐음의 오디오 데이터에 MFCC를 적용하여 앞서 선택된 계수의 값 을 식별하고, 식별된 계수의 값을 바탕으로 막힘 정도(ex. 특정 상태)를 판단할 수 있다. 한편, 도 7은 인공호흡기 튜브의 막힘 정도에 따른 Delta MFCC의 계수 값의 차이를 설명하기 위한 도면이다. 도 7은, 도 5에서 5mm를 기준으로 단면의 막힘 비율(20%, 50%, 80%)을 다르게 한 경우 각각의 계수 값을 비교한 결 과를 도시한 것이다. 도 7을 참조하면, 4가지 정도(ex. Coefficient 5, 7, 9, 11)의 계수가 유의미한 차이를 보였기 때문에, 해당 계 수들이 선택될 수 있다. 즉, Delta MFCC를 기준으로 했을 때, 프로세서는 해당 계수의 값을 바탕으로 막힘 정도를 판단할 수 있다. 상술한 다양한 실시 예에 따라 막힘 정도가 일정 상태에 다다른 것으로 식별되면, 프로세서는 적어도 하나 의 외부 장치 또는 시스템 내 출력부를 통해 막힘 정도를 알릴 수 있다. 그 결과, 인공호흡기 튜브 내 이 물질의 막힘 정도가 편리하게 관리되어 의료 기기의 상태 및 환자의 건강이 유지될 수 있다. 한편, 일 실시 예로, 프로세서는 상술한 MFCC를 통해 폐음의 오디오 데이터를 처리한 결과 인공호흡기 튜 브의 꺾인 정도를 식별할 수도 있다. 꺾인 정도는, 인공호흡기 튜브가 휜 각도를 의미할 수 있으며, 삽관된 상태로 오랜 시간이 지나면서 점차 튜브 의 각도가 변하는 상황에 대비하기 위한 것이다. 구체적으로, 프로세서는 폐음의 오디오 데이터에 MFCC를 적용하는 한편, Mel spectrum에서 Cepstral 분석 을 수행하여 복수의 계수(Coefficient)의 값을 식별할 수 있다. 이는, 폐음의 고유한 특징을 수치로 나타낸 것 이다. 이후, 프로세서는 Mel-Filter Bank(: 사람의 달팽이 관을 기반으로 만든 필터)를 활용하여 Cepstral 분석 을 수행할 수 있다. 일 예로, 프로세서는 Mel-Filter를 적용한 결과 도출된 모든 Filter bank 에너지에 Log를 취할 수 있다. 이 경우, 고주파 영역과 저주파 영역이 분리될 수 있다. 또한, 일 예로, 프로세서는 DCT(Discrete Cosine Transform)를 활용하여 Cepstral 분석을 수행함으로써 기본 주파수를 식별할 수도 있다. 상술한 과정에 따라 MFCC histogram에 따른 복수의 계수의 값이 도출될 수 있다. 일 예로, 프로세서는 인 공호흡기 튜브의 꺾인 정도(ex. 각도 30°, 100°, 170°)마다 복수의 계수의 값을 식별하여 비교할 수 있으며, 여기서 꺾인 정도에 따른 차이가 비교적 큰 계수를 하나 이상 선택할 수 있다. 그리고, 프로세서는 실시간 으로 수집되는 폐음의 오디오 데이터를 분석하여 상기 선택된 계수의 값을 획득한 뒤, 계수의 값에 따라 꺾인 정도를 식별할 수 있다. 한편, 도 8은 본 개시의 다양한 실시 예에 따른 시스템의 구성을 설명하기 위한 블록도이다. 도 8을 참조하면, 시스템은 마이크 및 프로세서 외에도 통신부, 사용자 입력부, 출력 부 등을 포함할 수 있다. 통신부는 전자 장치가 다양한 외부 장치와 데이터를 송수신하기 위한 구성으로, 통신을 위한 적어도 하나의 회로를 포함할 수 있다. 통신부는 TCP/IP(Transmission Control Protocol/Internet Protocol), UDP(User Datagram Protocol), HTTP(Hyper Text Transfer Protocol), HTTPS(Secure Hyper Text Transfer Protocol), FTP(File Transfer Protocol), SFTP(Secure File Transfer Protocol), MQTT(Message Queuing Telemetry Transport) 등의 통신 규 약(프로토콜)을 이용하여 하나 이상의 외부 전자 장치와 다양한 정보를 송수신할 수 있다. 이를 위해, 통신부는 유선 통신 및/또는 무선 통신을 통해 구현된 네트워크를 기반으로, 외부 장치와 연결 될 수 있다. 이때, 통신부는 외부 장치와 직접적으로 연결될 수도 있지만, 네트워크를 제공하는 하나 이상 의 외부 서버(ex. ISP(Internet Service Provider))를 통해서 외부 전자 장치와 연결될 수도 있다. 네트워크는 영역 또는 규모에 따라 개인 통신망(PAN; Personal Area Network), 근거리 통신망(LAN; Local Area Network), 광역 통신망(WAN; Wide Area Network) 등일 수 있으며, 네트워크의 개방성에 따라 인트라넷 (Intranet), 엑스트라넷(Extranet), 또는 인터넷(Internet) 등일 수 있다. 무선 통신은 LTE(long-term evolution), LTE-A(LTE Advance), 5G(5th Generation) 이동통신, CDMA(code division multiple access), WCDMA(wideband CDMA), UMTS(universal mobile telecommunications system), WiBro(Wireless Broadband), GSM(Global System for Mobile Communications), DMA(Time Division Multiple Access), WiFi(Wi-Fi), WiFi Direct, Bluetooth, NFC(near field communication), Zigbee 등의 통신 방식 중 적어도 하나를 포함할 수 있다. 유선 통신은 이더넷(Ethernet), 광 네트워크(optical network), USB(Universal Serial Bus), 선더볼트 (ThunderBolt) 등의 통신 방식 중 적어도 하나를 포함할 수 있다.여기서, 통신부는 상술한 유무선 통신 방식에 따른 네트워크 인터페이스(Network Interface) 또는 네트워 크 칩을 포함할 수 있다. 한편, 통신 방식은 상술한 예에 한정되지 아니하고, 기술의 발전에 따라 새롭게 등장 하는 통신 방식을 포함할 수 있다. 일 실시 예로, 인공호흡기 튜브의 막힘 정도가 일정 상태에 다다른 것으로 식별된 경우, 프로세서는 통신 부를 통해 인공호흡기 튜브의 막힘 정도에 대한 정보를 적어도 하나의 외부 전자 장치(ex. 서버, 사용자 단말, 관리자 단말 등)로 전송할 수 있다. 사용자 입력부는 사용자 명령 또는 사용자 정보 등을 입력 받기 위한 구성이다. 사용자 입력부는 터 치 센서, 버튼, 카메라, 마이크, 키보드 등으로 구현될 수 있다. 일 실시 예로, 프로세서는 사용자 입력에 따라 폐음의 오디오 데이터를 분석하여 막힘 정도를 식별/모니터 링할 수 있다. 출력부는 다양한 정보를 출력하여 사용자에게 제공하기 위한 구성이다. 출력부는 디스플레이, 스피커 등을 포함할 수 있다. 일 실시 예로, 프로세서는 인공호흡기 튜브의 막힘 정도에 대한 정보를 표시하도록 디스플레이를 제어할 수 있다. 또한, 인공호흡기 튜브의 막힘 정도가 일정 상태에 해당하는 경우, 프로세서는 출력부를 통 해 알림 내지는 경고를 제공할 수도 있다. 한편, 상술한 마이크 외에도 시스템은 다양한 센서를 활용하여 튜브 내 공기의 상태를 파악할 수 있 다. 관련하여, 도 9는 공기 압력센서 등을 통해 공기의 흐름에 관한 부가정보를 습득하기 위한 시스템의 상세한 구 성을 설명하기 위한 블록도이다. 도 9를 참조하면, 본 개시의 일 실시 예에 따른 시스템은 마이크, 프로세서, 통신부, 사용 자 입력부, 출력부 외에 메모리를 포함함은 물론, 압력 센서, 기체 유량 센서, 온도 센서 등을 더 포함할 수 있다. 메모리는 전자 장치의 구성요소들의 전반적인 동작을 제어하기 위한 운영체제(OS: Operating System) 및 전자 장치의 구성요소와 관련된 적어도 하나의 인스트럭션 또는 데이터를 저장하기 위한 구성이다. 메모리는 ROM, 플래시 메모리 등의 비휘발성 메모리를 포함할 수 있으며, DRAM 등으로 구성된 휘발성 메모 리를 포함할 수 있다. 또한, 메모리는 하드 디스크, SSD(Solid state drive) 등을 포함할 수도 있다. 압력 센서는 환자에게 투입되는 기체 및/또는 환자로부터 배출되는 기체의 압력을 측정하기 위한 구성이다. 압력 센서는 상술한 분기부 내지는 인공호흡기의 튜브 상에 설치될 수 있다. 기체 유량 센서는 환자에게 투입되는 기체 및/또는 환자로부터 배출되는 기체의 유량을 측정하기 위한 구 성이다. 기체 유량 센서는 상술한 분기부 내지는 인공호흡기의 튜브 상에 설치될 수 있다. 온도 센서는 환자에게 투입되는 기체 및/또는 환자로부터 배출되는 기체의 온도를 측정하기 위한 구성이다. 온도 센서는 상술한 분기부 내지는 인공호흡기의 튜브 상에 설치될 수 있다. 관련하여, 도 10은 본 개시의 일 실시 예에 따른 시스템에 포함되는 센서들이 설치될 수 있는 내장형 분배기를 설명하기 위한 도면이다. 도 10을 참조하면, 분배기는 환자와 연결되는 제1 분기관, 제1 분기관과 인공호흡기 사이를 연결하여 호흡 가스를 환자로 공급시키는 제2 분기관, 및 제1 분기관과 인공호흡기 사이를 연결하여 환자로부터 배출되는 배출 가스를 인공호흡기로 유입시키는 제3 분기관을 포함하여 Y자 형태로 구성될 수 있다. 이때, 3개의 분기관이 만나는 지점에 압력 센서, 기체 유량 센서, 폐음 검출 마이크 등이 설치 될 수 있으며, 제2 분기관(흡기용)의 시작 지점에 온도 센서가 설치될 수 있다. 시스템은, 상술한 센서들의 센싱 데이터를 바탕으로 인공호흡기 튜브 내 각 분기관의 온도 내지는 습도 등 을 제어할 수 있다. 관련하여, 도 11은 본 개시의 일 실시 예에 따라 들숨과 날숨의 흐름을 구분하여 온습도를 조절하는 시스템의 구성을 설명하기 위한 도면이다.도 11을 참조하면, 제2 분기관(흡기용) 및 제3 분기관(호기용) 각각에는 수분의 응결을 방지하기 위한 히터가 내장될 수 있다. 또한, 제2 분기관 상에는 온습도 조절기가 내장될 수 있다. 이때, 본 개시의 일 실시 예에 따른 시스템은 상술한 히터 내지는 온습도 조절기를 제어하기 위한 주 제어 장치(Main Controller)를 포함할 수 있다. 주 제어 장치는 상술한 프로세서로 구성되거나 또는 프로세서 에 의해 제어될 수 있다. 예를 들어, 프로세서는 출력부(150. ex: 디스플레이)를 통해 각 센서의 센싱 데이터를 실시간으로 제공할 수 있다. 또한, 프로세서는 각 센서의 센싱 데이터를 모니터링하여 인공호흡기 튜브의 막힘 정도를 분석할 수 있다. 예를 들어, 인공호흡기 튜브의 유량이 임계 유량 미만이 되거나, 인공호흡기 튜브의 압력이 임계 압력 이상이 되는 경우, 막힘 정도가 일정 수치 이상인 것으로 식별될 수 있다. 한편, 프로세서는 측정된 압력 또는 유량을 폐음에 대한 오디오 신호 처리와 연계하여 동작할 수도 있다. 일 실시 예로, 프로세서는 폐음의 분석 결과 외에 측정된 압력/유량을 종합적으로 고려하여 인공호흡기 튜 브의 막힘 정도를 분석할 수 있다. 또한, 프로세서는 각 분기관의 온도 내지는 습도를 제어할 수도 있다. 구체적으로, 상술한 센싱 데이터 및 /또는 폐음을 바탕으로 막힘 정도를 판별함에 있어, 온도 내지는 습도 조건을 일정하게 유지한 채로 다른 변수 (ex. 유량, 압력, 폐음(오디오 신호) 등)를 측정하여 막힘 정도를 식별할 수 있다. 예를 들어, 프로세서는 온도 내지는 습도가 일정하게 유지되도록 온습도 조절기 등을 제어할 수 있으며, 온도 내지는 습도가 일정하게 유지된 상태에서 기체 유량, 압력, 폐음 등을 실시간으로 측정 내지는 분석하여 막힘 정도를 식별할 수 있다. 한편, 이상에서 설명된 다양한 실시 예들은 서로 저촉되거나 모순되지 않는 한 두 개 이상의 실시 예가 서로 결 합되어 구현될 수 있다. 한편, 이상에서 설명된 다양한 실시 예들은 소프트웨어(software), 하드웨어(hardware) 또는 이들의 조합된 것 을 이용하여 컴퓨터(computer) 또는 이와 유사한 장치로 읽을 수 있는 기록 매체 내에서 구현될 수 있다. 하드웨어적인 구현에 의하면, 본 개시에서 설명되는 실시 예들은 ASICs(Application Specific Integrated Circuits), DSPs(digital signal processors), DSPDs(digital signal processing devices), PLDs(programmable logic devices), FPGAs(field programmable gate arrays), 프로세서(processors), 제어기 (controllers), 마이크로 컨트롤러(micro-controllers), 마이크로 프로세서(microprocessors), 기타 기능 수행 을 위한 전기적인 유닛(unit) 중 적어도 하나를 이용하여 구현될 수 있다. 일부의 경우에 본 명세서에서 설명되는 실시 예들이 프로세서 자체로 구현될 수 있다. 소프트웨어적인 구현에 의하면, 본 명세서에서 설명되는 절차 및 기능과 같은 실시 예들은 별도의 소프트웨어 모듈들로 구현될 수 있다. 상술한 소프트웨어 모듈들 각각은 본 명세서에서 설명되는 하나 이상의 기능 및 작동을 수행할 수 있다. 한편, 상술한 본 개시의 다양한 실시 예들에 따른 시스템에서의 처리동작을 수행하기 위한 컴퓨터 명령어 (computer instructions) 또는 컴퓨터 프로그램은 비일시적 컴퓨터 판독 가능 매체(non-transitory computer- readable medium)에 저장될 수 있다. 이러한 비일시적 컴퓨터 판독 가능 매체에 저장된 컴퓨터 명령어 또는 컴 퓨터 프로그램은 특정 기기의 프로세서에 의해 실행되었을 때 상술한 다양한 실시 예에 따른 시스템에서의 처리 동작을 상술한 특정 기기가 수행하도록 한다. 비일시적 컴퓨터 판독 가능 매체란 레지스터, 캐쉬, 메모리 등과 같이 짧은 순간 동안 데이터를 저장하는 매체 가 아니라 반영구적으로 데이터를 저장하며, 기기에 의해 판독(reading)이 가능한 매체를 의미한다. 비일시적 컴퓨터 판독 가능 매체의 구체적인 예로는, CD, DVD, 하드 디스크, SSD, 블루레이 디스크, USB, 메모리카드, ROM 등이 있을 수 있다. 이상에서는 본 개시의 바람직한 실시 예에 대하여 도시하고 설명하였지만, 본 개시는 상술한 특정의 실시 예에"}
{"patent_id": "10-2022-0055641", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "한정되지 아니하며, 청구범위에서 청구하는 본 개시의 요지를 벗어남이 없이 당해 개시에 속하는 기술분야에서 통상의 지식을 가진 자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 개시의 기술 적 사상이나 전망으로부터 개별적으로 이해되어서는 안될 것이다."}
{"patent_id": "10-2022-0055641", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1a는 본 개시의 일 실시 예에 따른 시스템의 구성을 설명하기 위한 블록도, 도 1b는 본 개시의 일 실시 예에 따른 시스템의 기능적 구성을 설명하기 위한 블록도, 도 2는 본 개시의 일 실시 예에 따른 시스템의 제어 방법을 설명하기 위한 흐름도, 도 3은 본 개시의 일 실시 예에 따른 시스템이 오디오 데이터를 단계 별로 처리하는 과정을 설명하기 위한 도면, 도 4는 본 개시의 시스템의 성능과 관련하여 실험적으로 확인된 오디오 특성과 막힘 정도의 상관 관계를 설명하 기 위한 도면, 도 5는 인공호흡기 튜브의 막힘 정도와 길이 개념을 설명하고 비교 방식을 표현하기 위한 도면, 도 6은 인공호흡기 튜브의 막힘 정도에 따른 표준 MFCC의 계수 값의 차이를 설명하기 위한 도면, 도 7은 인공호흡기 튜브의 막힘 정도에 따른 Delta MFCC의 계수 값의 차이를 설명하기 위한 도면, 그리고 도 8은 본 개시의 다양한 실시 예에 따른 시스템의 구성을 설명하기 위한 블록도이다. 도 9는 공기 압력센서 등을 통해 공기의 흐름에 관한 부가정보를 습득하기 위한 시스템의 상세한 구성을 설명하 기 위한 블록도, 도 10은 본 개시의 일 실시 예에 따른 시스템에 포함되는 센서들이 설치될 수 있는 센서 내장형 분배기를 설명 하기 위한 도면, 그리고 도 11은 본 개시의 일 실시 예에 따라 들숨과 날숨의 흐름을 구분하여 온습도를 조절하는 시스템의 구성을 설명 하기 위한 도면이다."}
