{"patent_id": "10-2022-7024591", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0117292", "출원번호": "10-2022-7024591", "발명의 명칭": "최적화된 분말 생산", "출원인": "바스프 에스이", "발명자": "슈나이더, 하이더"}}
{"patent_id": "10-2022-7024591", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "화학적 생산 플랜트(110)를 제어 및/또는 모니터링하기 위한 컴퓨터에 의해 구현되는(computer-implemented) 방법으로서,상기 화학적 생산 플랜트(110)는, 적어도 하나의 배치 프로세스(114)를 포함하는 적어도 하나의 프로세스 체인(112)을 포함하고, 상기 방법은,a) 적어도 하나의, 입력 데이터를 결정하는 단계(132) ― 상기 입력 데이터는 적어도 하나의 품질 기준 및 생산플랜트 레이아웃 데이터를 포함하고, 상기 결정하는 단계는, 적어도 하나의 통신 인터페이스(158)를 통해, 상기생산 플랜트 레이아웃 데이터를 리트리브(retrieve)하고 상기 품질 기준에 관한 정보를 수신하는 단계를 포함함―;b) 적어도 하나의 예측 단계(134) ― 상기 예측 단계에서, 상기 입력 데이터에 대해 적어도 하나의 훈련된 모델(136)을 적용함으로써, 상기 화학적 생산 플랜트(110)를 동작시키기 위한 동작 조건들이 결정되고, 상기 훈련된모델(136)은, 이력 생산 실행들로부터의 센서 데이터에 대해 훈련됨으로써 적어도 부분적으로 데이터 주도됨(data-driven) ―; 및c) 상기 동작 조건들이 제공되는 적어도 하나의 제어 및/또는 모니터링 단계(140)를 포함하는, 컴퓨터에 의해 구현되는 방법."}
{"patent_id": "10-2022-7024591", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 화학적 생산 플랜트(110)는 적어도 2개의 순차적 프로세스를 포함하는, 컴퓨터에 의해 구현되는 방법."}
{"patent_id": "10-2022-7024591", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항 또는 제2항에 있어서,상기 화학적 생산 플랜트(110)는 결정된 동작 조건들에 따라 제어되는, 컴퓨터에 의해 구현되는 방법."}
{"patent_id": "10-2022-7024591", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,각각의 제어가능한 요소에 대해 상기 동작 조건들이 제공되고, 상기 훈련된 모델(136)은, 실제 생산 프로세스에서 직접 제어가능한, 제어가능한 파라미터들을 예측하도록 구성되는, 컴퓨터에 의해 구현되는 방법."}
{"patent_id": "10-2022-7024591", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항 내지 제4항 중 어느 한 항에 있어서,상기 훈련된 모델은, 상기 품질 기준을 달성하기 위한, 처리 체인(112)을 통한 최상의 경로에 관한 동작 조건들을 제공하도록 구성되는, 컴퓨터에 의해 구현되는 방법."}
{"patent_id": "10-2022-7024591", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항 내지 제5항 중 어느 한 항에 있어서,상기 화학적 생산 플랜트(110)의 실행들에 대한 생산 계획은 결정된 동작 조건들에 기반하여 결정되는, 컴퓨터에 의해 구현되는 방법."}
{"patent_id": "10-2022-7024591", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2022-0117292-3-제1항 내지 제6항 중 어느 한 항에 있어서,상기 품질 기준에 관한 정보는 적어도 하나의 고객 규격을 포함하고, 상기 고객 규격은 적어도 하나의 품질 파라미터에 대한 적어도 하나의 범위를 포함하는, 컴퓨터에 의해 구현되는 방법."}
{"patent_id": "10-2022-7024591", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항 내지 제7항 중 어느 한 항에 있어서,상기 생산 플랜트 레이아웃 데이터는 실시간 데이터를 포함하고, 상기 실시간 데이터는 상기 화학적 생산 플랜트(110)의 현재 상태에 관한 정보를 포함하는, 컴퓨터에 의해 구현되는 방법."}
{"patent_id": "10-2022-7024591", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항 내지 제8항 중 어느 한 항에 있어서,상기 생산 플랜트 레이아웃 데이터는 미리 정의된 레이아웃 파라미터들을 포함하고, 상기 미리 정의된 레이아웃파라미터들은 상기 통신 인터페이스를 통해 적어도 하나의 데이터베이스로부터 리트리브되는, 컴퓨터에 의해 구현되는 방법."}
{"patent_id": "10-2022-7024591", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항 내지 제9항 중 어느 한 항에 있어서,상기 화학적 생산 플랜트(110)는 연속적 처리(122)를 위해 구성되는, 컴퓨터에 의해 구현되는 방법."}
{"patent_id": "10-2022-7024591", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항 내지 제10항 중 어느 한 항에 있어서,상기 화학적 생산 플랜트(110)에 의한 생산은 복수의 생산 단계들을 포함하고, 상기 훈련된 모델(136)은, 단일생산 단계에 대한 또는 생산 단계들의 그룹에 대한 상기 동작 조건들을 예측하도록 구성되는, 컴퓨터에 의해 구현되는 방법."}
{"patent_id": "10-2022-7024591", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1항 내지 제11항 중 어느 한 항에 있어서,상기 훈련된 모델(136)은 하이브리드 모델인, 컴퓨터에 의해 구현되는 방법."}
{"patent_id": "10-2022-7024591", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제1항 내지 제12항 중 어느 한 항에 있어서,상기 훈련된 모델(136)은 적어도 하나의 서브-모델을 포함하고, 상기 서브-모델은 화이트 박스 모델, 하이브리드 모델, 또는 데이터 주도 모델 중 하나 이상인, 컴퓨터에 의해 구현되는 방법."}
{"patent_id": "10-2022-7024591", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 훈련된 모델(136)은, 화이트 박스 모델들이거나 하이브리드 모델들 또는 순수 데이터 주도 모델들인 복수의 서브-모델들을 포함하고, 각각의 서브-모델은, 동작 조건들을 예측하는 것 또는 상기 동작 조건들을 예측하는 다른 서브-모델들에 입력을 제공하는 것을 담당하는, 컴퓨터에 의해 구현되는 방법."}
{"patent_id": "10-2022-7024591", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제1항 내지 제14항 중 어느 한 항에 있어서,상기 훈련된 모델(136)은 화이트 박스 모델(142)과 블랙 박스 모델(144)의 조합을 포함하고, 상기 화이트 박스모델(142)은 물리-화학적 법칙들에 기반하고, 상기 블랙 박스 모델(144)은 이력 생산 실행들로부터의 센서 데이터에 기반하는, 컴퓨터에 의해 구현되는 방법.공개특허 10-2022-0117292-4-청구항 16 제15항에 있어서,상기 블랙 박스 모델(144)은, 기계 학습, 심층 학습, 신경망들, 또는 다른 형태의 인공 지능 중 하나 이상을 사용함으로써 구축되는, 컴퓨터에 의해 구현되는 방법."}
{"patent_id": "10-2022-7024591", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제1항 내지 제16항 중 어느 한 항에 있어서,상기 화학적 생산 플랜트(110)는 적어도 하나의 분말을 생산하도록 구성되는 분말 생산 플랜트이고, 상기 분말은, 카르보닐 철 분말(CIP); 철 분말; 카본 블랙; 니켈; 철; 산화아연; 이산화티타늄으로 이루어진 그룹으로부터 선택되는 적어도 하나의 분말인, 컴퓨터에 의해 구현되는 방법."}
{"patent_id": "10-2022-7024591", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "화학적 생산 플랜트(110)를 제어 및/또는 모니터링하기 위한 컴퓨터 프로그램으로서,상기 컴퓨터 프로그램은 구체적으로는 애플리케이션이고, 상기 화학적 생산 플랜트(110)는, 적어도 하나의 배치프로세스(114)를 포함하는 적어도 하나의 프로세스 체인(112)을 포함하고, 상기 컴퓨터 프로그램은, 상기 프로그램이 컴퓨터 또는 컴퓨터 네트워크에 의해 실행될 때, 상기 컴퓨터 또는 상기 컴퓨터 네트워크로 하여금,i) 입력 데이터를 결정하는 단계 ― 상기 입력 데이터는 적어도 하나의 품질 기준 및 생산 플랜트 레이아웃 데이터를 포함하고, 상기 결정하는 단계는, 적어도 하나의 통신 인터페이스를 통해, 상기 생산 플랜트 레이아웃데이터를 리트리브하고 상기 품질 기준에 관한 정보를 수신하는 단계를 포함함 ―;ii) 상기 입력 데이터에 대해 적어도 하나의 훈련된 모델(136)을 적용함으로써, 상기 화학적 생산 플랜트(110)를 동작시키기 위한 동작 조건들을 결정하는 단계 ― 상기 훈련된 모델(136)은, 이력 생산 실행들로부터의 센서데이터에 대해 훈련됨으로써 적어도 부분적으로 데이터 주도됨 ―; 및iii) 상기 동작 조건들을 제공하는 단계를 수행하게 하는 명령어들을 포함하는, 컴퓨터 프로그램."}
{"patent_id": "10-2022-7024591", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "화학적 생산 플랜트(110)를 제어 및/또는 모니터링하기 위한 제어 시스템(156)으로서,상기 화학적 생산 플랜트(110)는, 적어도 하나의 배치 프로세스(114)를 포함하는 적어도 하나의 프로세스 체인(112)을 포함하고, 상기 제어 시스템(156)은, 입력 데이터의 결정을 위해 구성되는 적어도 하나의 통신 인터페이스(158)를 포함하고, 상기 입력 데이터는, 적어도 하나의 품질 기준 및 생산 플랜트 레이아웃 데이터를 포함하고, 상기 통신 인터페이스(158)는, 상기 생산 플랜트 레이아웃 데이터를 리트리브하고 상기 품질 기준에 관한정보를 수신하도록 구성되고, 상기 제어 시스템(156)은, 상기 입력 데이터에 대해 적어도 하나의 훈련된 모델(136)을 적용함으로써 상기 화학적 생산 플랜트(110)를 동작시키기 위한 동작 조건들을 결정하도록 구성되는 적어도 하나의 예측 유닛(160)을 포함하고, 상기 훈련된 모델(136)은, 이력 생산 실행들로부터의 센서 데이터에대해 훈련됨으로써 적어도 부분적으로 데이터 주도되며, 상기 제어 시스템(156)은, 상기 동작 조건들을 제공하도록 구성되는 적어도 하나의 출력 디바이스(162)를 포함하는, 제어 시스템(156)."}
{"patent_id": "10-2022-7024591", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서,상기 제어 시스템(156)은, 제1항 내지 제17항 중 어느 한 항에 따른, 화학적 생산 플랜트(110)를 제어 및/또는모니터링하기 위한 방법을 수행하도록 구성되는, 제어 시스템(156)."}
{"patent_id": "10-2022-7024591", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "생산 플랜트를 제어 및/또는 모니터링하기 위한 컴퓨터에 의해 구현되는 방법이 제안된다. 생산 플랜트 는, 적어도 하나의 배치 프로세스를 포함하는 적어도 하나의 프로세스 체인을 포함한다. 방법은 다음의 단계들을 포함한다: a) 적어도 하나의, 입력 데이터를 결정하는 단계 ― 입력 데이터는 적어도 하나 (뒷면에 계속)"}
{"patent_id": "10-2022-7024591", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은, 생산 플랜트를 제어 및/또는 모니터링하기 위한 컴퓨터에 의해 구현되는(computer-implemented) 방 법, 컴퓨터 프로그램, 및 제어 시스템에 관한 것이다. 본 발명은 구체적으로, 카본 블랙, 니켈, 철, 산화아연, 또는 이산화티타늄 생산과 같은 산업적 분말 생산에 사용될 수 있다. 다른 응용들이 가능하다."}
{"patent_id": "10-2022-7024591", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "카본 블랙, 니켈, 철, 산화아연, 또는 이산화티타늄과 같은, 1 내지 100 nm의 전형적인 입자 크기들을 갖는 고 순도의 나노-크기의 분말 및 0.1 내지 10 ㎛의 전형적인 입자 크기를 갖는 마이크로-크기의 분말의 산업적 분말 생산은, 연속적 화염(continuous flame), 고온-벽(hot-wall), 또는 분무 열분해(spray pyrolysis) 반응기들을 수반하는 에어로졸 프로세스에서 수행될 수 있다. 예컨대, 카르보닐 철 분말(CIP) 생산은, US 2612440, GB 695925, US 2597701, US 2851347, DE 1433361, DE 3216362, DE 3428121, DE 3940347, US 4197118, US 4113480, SU 1186398, DE 102005030613, WO 2014/049016, CN 103046033, 및 문헌들 [Syrkin, Tolmasski, Petrova, Translated from Poroshkovaya Metallurgiya, No. 7 , pp. 38-44, July, 1966, Mittasch, Zeitschrift angewandte Chemie, \" Eisencarbonyl und Carbonyleisen\", 28.07.1928, , 827, Syrkin; Translated from Poroshkovaya Metallurgiya, No. 3, pp. 75-84, May-June, i964 Original article submitted January 27, i963 \"About New process using atomization of liquid IPC into an decomposer\", 및 Ebenhoech, Progress in powder Metallurgy , 1986, \"Carbonyl iron powder production, properties and applications\"]에 의해 설명된다. 미가공 분말 특성들, 이를테면, 입자 크기 분포, 형태학적 구조, 응집도, 표면 화학성질, 또는 상 조성은, 에어 로졸 반응기에서의 화학 반응 및 입자 성장에 강하게 의존한다. 미가공 분말 특성들은, 유닛 동작들 또는 반응 기들, 이를테면, 밀(mill)들, 스크린(screen)들, 체(sieve)들, 오븐들, 하소기(calciner)들, 회전식 가마 (rotary kiln)들, 또는 유동층(fluidized bed)들에서의 후속하는 기계적, 열적, 및/또는 혼합된 열적 및/또는 화학적 프로세스들에 의해 추가로 개질될 수 있다. 에어로졸 반응기 및 후속하는 유닛 동작들 또는 반응기들 둘 모두의 제어는, 응용 특정 분말 특성들을 결정함에 있어 중요하다. 실제로, 응용 특정 분말 특성들을 결정 하는 제1 원리 법칙들은 알려져 있지 않다. 따라서, 생산 프로세스들의 제어는 높은 수준의 경험론 및 수동 최 적화를 수반하며, 이는, 분말 생산을 복잡하게 하고 오류가 발생하기 쉽게 한다. WO 2019/188931 A1은, 권취 조건 생성 디바이스, 권취 디바이스, 권취 결함 수준 예측 값 생성 디바이스, 권취 조건 계산 방법, 권취 방법, 및 권취 결함 수준 예측 값 생성 방법을 설명한다. 권취 조건 생성 디바이스에는, 입력 유닛, 출력 유닛, 및 조건 계산 유닛이 제공되고, 여기서, 조건 계산 유닛은, 표적 권취 품질을 충족하는 권취 웹이 생산될 때 사용되는 권취 파라미터와 권취 조건의 조합을 교시 데이터로서 사용하여 기계 학습에 의 해 생성되는 학습 모델을 제공받고, 학습 모델을 사용하여, 입력 유닛으로부터 입력된 새로운 권취 웹의 권취 파라미터로부터 새로운 권취 웹의 권취 조건을 계산하며, 출력 유닛은 권취 조건을 출력한다. 권취 파라미터는, 웹의 폭, 웹을 운반하는 속도, 및 웹의 권취 길이를 포함한다. 권취 조건은, 웹의 권취의 시작 시 의 웹의 장력 및 웹의 권취의 종료 시의 웹의 장력을 포함한다. 해결해야 할 문제 따라서, 위에 언급된 기술적 난제들을 해결하는 방법들 및 디바이스들을 제공하는 것이 바람직하다. 구체적으 로, 생산 플랜트의 덜 복잡하고 강건하며 개선된 제어를 허용하는, 생산 플랜트를 제어 및/또는 모니터링하기 위한 디바이스들 및 방법들이 제공될 것이다. 이러한 문제는, 독립항들의 특징들을 갖는, 생산 플랜트를 제어 및/또는 모니터링하기 위한 컴퓨터에 의해 구현 되는 방법, 컴퓨터 프로그램, 및 제어 시스템에 의해 해결된다. 격리된 방식으로 또는 임의의 임의적 조합들로 실현될 수 있는 유리한 실시예들은 종속항들에 열거된다. 하기에서 사용되는 바와 같이, \"갖다\", \"포함하다\" 또는 \"구비하다\"라는 용어들 또는 이들의 임의적인 문법적 변형들은 비-배타적인 방식으로 사용된다. 그에 따라, 이러한 용어들은, 이러한 용어들에 의해 도입되는 특징 외에, 이 맥락에서 설명된 엔티티에 어떠한 추가적인 특징들도 존재하지 않는 상황 및 하나 이상의 추가적인 특 징이 존재하는 상황 둘 모두를 지칭할 수 있다. 예로서, \"A가 B를 갖는다\", \"A가 B를 포함한다\" 및 \"A가 B를 구비한다\"라는 표현들은, B 외에, A에 어떠한 다른 요소도 존재하지 않는 상황(즉, A가 단독으로 그리고 배타적 으로 B로 이루어진 상황), 및 B 외에, 요소 C, 요소들 C 및 D 또는 더 추가적인 요소들과 같은 하나 이상의 추가적인 요소가 엔티티 A에 존재하는 상황 둘 모두를 지칭할 수 있다. 추가로, 특징 또는 요소가 한 번 또는 한 번 초과로 존재할 수 있다는 것을 표시하는 \"적어도 하나\", \"하나 이 상\"이라는 용어들 또는 유사한 표현들은 전형적으로, 개개의 특징 또는 요소가 도입될 때 한 번만 사용될 것임 이 유의되어야 한다. 하기에서, 대부분의 경우들에, 개개의 특징 또는 요소를 지칭할 때, 개개의 특징 또는 요 소가 한 번 또는 한 번 초과로 존재할 수 있다는 사실에도 불구하고, \"적어도 하나\" 또는 \"하나 이상\"이라는 표 현들은 반복되지 않을 것이다. 추가로, 하기에서 사용되는 바와 같이, \"바람직하게\", \"더 바람직하게\", \"특히\", \"더 상세하게\", \"구체적으로\", \"더 구체적으로\"라는 용어들 또는 유사한 용어들은, 대안적인 가능성들을 제한함이 없이 임의적인 특징들과 함 께 사용된다. 그에 따라, 이러한 용어들에 의해 도입되는 특징들은 임의적인 특징들이고 어떠한 방식으로든 청 구항들의 범위를 제한하도록 의도되지 않는다. 본 발명은, 통상의 기술자가 인식할 수 있는 바와 같이, 대안적 인 특징들을 사용하여 수행될 수 있다. 유사하게, \"본 발명의 실시예에서\" 또는 유사한 표현들에 의해 도입되 는 특징들은, 본 발명의 대안적인 실시예들에 관한 어떠한 제한도 없이, 본 발명의 범위에 관한 어떠한 제한들 도 없이, 그리고 그러한 방식으로 도입되는 특징들이 본 발명의 다른 임의적인 또는 임의적이지 않은 특징들과 조합될 가능성에 관한 어떠한 제한도 없이, 임의적인 특징들인 것으로 의도된다. 본 발명의 제1 양상에서, 생산 플랜트를 제어 및/또는 모니터링하기 위한 컴퓨터에 의해 구현되는 방법이 제안 된다."}
{"patent_id": "10-2022-7024591", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "본원에서 사용되는 바와 같은 \"컴퓨터에 의해 구현되는\"이라는 용어는 광의의 용어이고, 관련 기술분야의 통상 의 기술자에게 그 용어의 통상적이고 관례적인 의미로 주어져야 하며, 특수한 또는 맞춤화된 의미로 제한되지 않아야 한다. 이 용어는 구체적으로, 제한 없이, 데이터 처리 수단, 이를테면, 적어도 하나의 프로세서를 포함 하는 데이터 처리 수단을 사용함으로써 완전히 또는 부분적으로 구현되는 프로세스를 지칭할 수 있다. 그에 따 라, \"컴퓨터\"라는 용어는 일반적으로, 적어도 하나의 데이터 처리 수단, 이를테면, 적어도 하나의 프로세서를 갖는 디바이스 또는 디바이스들의 조합 또는 네트워크를 지칭할 수 있다. 컴퓨터는 부가적으로, 하나 이상의 추가적인 구성요소, 이를테면, 데이터 저장 디바이스, 전자 인터페이스 또는 인간-기계 인터페이스 중 적어도 하나를 포함할 수 있다."}
{"patent_id": "10-2022-7024591", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 3, "content": "본원에서 사용되는 바와 같은 \"생산 플랜트\"라는 용어는 광의의 용어이고, 관련 기술분야의 통상의 기술자에게 그 용어의 통상적이고 관례적인 의미로 주어져야 하며, 특수한 또는 맞춤화된 의미로 제한되지 않아야 한다. 이 용어는 구체적으로, 제한 없이, 적어도 하나의 생성물을 생산 및/또는 제조 및/또는 생성 및/또는 처리하기 위한 디바이스 또는 디바이스들의 시스템 또는 디바이스들의 복합체를 지칭할 수 있다. 생산 플랜트는 화학적 생산 플랜트일 수 있다. 특히, 생산 플랜트는, 적어도 하나의 분말을 생산하도록 구성되는 분말 생산 플랜트일 수 있다. \"화학적 생산 플랜트\"라는 용어는, 제한 없이, 하나 이상의 화학적 생성물의 제조, 생산, 또는 처리, 즉, 화학 적 생산 플랜트에 의해 수행되는 제조 또는 생산 프로세스 또는 처리의 산업적 목적을 위해 사용되는 임의의 기 술적 기반구조를 지칭할 수 있다. 그에 따라서, 화학적 생산 플랜트는, 프로세스 플랜트, 제약 플랜트, 화석 연료 처리 설비, 이를테면, 석유 및/또는 천연 가스 웰, 정유 공장, 석유-화학적 플랜트, 분해 플랜트(cracking plant) 등 중 하나 이상일 수 있다. 화학적 생산 플랜트는 심지어, 증류소, 처리 플랜트, 또는 재활용 플랜트 중 임의의 것일 수 있다. 화학적 생산 플랜트는 심지어, 위에 주어진 예들 중 임의의 것 또는 그와 유사한 것 들의 조합일 수 있다. 추가로, 화학적 생산 플랜트는 전형적으로, 복수의 센서들, 및 화학적 생산 플랜트에서 프로세스와 관련된 적어도 하나의 파라미터 또는 프로세스 파라미터를 제어하기 위한 적어도 하나의 제어 시스 템을 포함한다. 그러한 제어 기능들은 일반적으로, 센서들 중 적어도 하나로부터의 적어도 하나의 측정 신호에 대한 응답으로 제어 시스템 또는 제어기에 의해 수행된다. 본 개시내용에서 \"화학적 생성물\"이라는 용어는, 임의의 산업적 생성물, 이를테면, 화학적, 제약, 영양, 화장품, 생물학적 생성물, 음료, 직물, 금속, 플라스틱 또는 심지어 이들의 조합 중 임의의 것을 지칭할 수 있 다. 화학적 생성물은, 전적으로 천연 성분들로 이루어질 수 있거나 또는 적어도 부분적으로 하나 이상의 합성 성분을 포함할 수 있다. 화학적 생성물의 일부 비-제한적인 예들은, 유기 또는 무기 조성물들, 단량체들, 중합 체들, 발포체들, 살충제들, 제초제들, 비료들, 사료, 영양 생성물들, 전구체들, 제약들, 또는 처리 생성물들, 또는 이들의 성분들 또는 활성 성분들 중 임의의 하나 이상이다. 일부 경우들에서, 화학적 생성물은 심지어, 최종 사용자 또는 소비자에 의해 사용가능한 생성물, 예컨대, 화장품 또는 제약 조성물일 수 있다. 화학적 생 성물은 심지어, 추가적인 하나 이상의 생성물을 만드는 데 사용가능한 생성물일 수 있는데, 예컨대, 화학적 생성물은, 신발용 밑창들을 제조하는 데 사용가능한 합성 발포체 또는 자동차 외장에 사용가능한 코팅일 수 있다. 화학적 생성물은, 임의의 형태, 예컨대, 고체, 반고체, 페이스트, 액체, 유화액, 용액, 펠릿(pellet)들, 과립 (granule)들, 또는 분말의 형태일 수 있다. 부가적으로 또는 대안적으로, 화학적 생성물은 심지어, 서비스 생 성물, 예컨대, 복원 또는 폐기물 처리, 이를테면 재활용, 화학적 처리, 이를테면, 하나 이상의 화학적 생성물로 의 분해 또는 용해일 수 있다. 생산 플랜트는, 열 교환기, 칼럼(column), 이를테면 분별 칼럼, 노(furnace), 반응 챔버, 분해 유닛, 저장 탱크, 압출기, 펠릿화기, 침전기, 블렌더, 혼합기, 절단기, 경화 튜브, 기화기, 필터, 체, 파이프라인, 스택, 필터, 밸브, 액추에이터, 밀, 변환기, 운반 시스템, 회로 차단기, 기계류, 예컨대, 대형(heavy duty) 회전 장비, 이를테면, 터빈, 발전기, 미분쇄기(pulverizer), 압축기, 산업용 팬, 펌프, 수송 요소, 이를테면 컨베이 어 시스템, 모터 등 중 임의의 하나 이상과 같은 처리 유닛들 또는 처리 유닛들로 또한 표시되는 장비를 포함할 수 있다. \"장비\"라는 용어는, 생산 플랜트 내의 임의의 하나 이상의 자산을 지칭할 수 있다. 비-제한적인 예 들로서, 장비는, 컴퓨팅 유닛들 또는 제어기들, 센서들,액추에이터들, 엔드 이펙터 유닛들, 수송 요소들, 이를 테면 컨베이어 시스템들, 열 교환기들, 이를테면 가열기들, 노들, 냉각 유닛들, 반응기들, 혼합기들, 밀러들, 초퍼(chopper)들, 압축기들, 슬라이서들, 압출기들, 건조기들, 분무기들, 압력 또는 진공 챔버들, 튜브들, 빈 (bin)들, 사일로들, 및 산업적 플랜트에서 생산을 위해 또는 생산 동안에 직접 또는 간접적으로 사용되는 임의 의 다른 종류의 장치 중 임의의 하나 이상 또는 이들의 조합 중 임의의 것을 지칭할 수 있다. 바람직하게는, 장비는 구체적으로, 생산 프로세스에서 직접 또는 간접적으로 수반되는 그러한 자산들, 장치들 또는 구성요소들 을 지칭한다. 더 바람직하게는, 화학적 생성물의 성능에 영향을 줄 수 있는 그러한 자산들, 장치들, 또는 구성 요소들이다. 장비는 완충(buffer)될 수 있거나 장비는 비-완충(unbuffer)될 수 있다. 더욱이, 장비는 혼합을 수반한거나 혼합이 없거나 분리를 수반하거나 분리가 없을 수 있다. 혼합이 없는 비-완충형 장비의 일부 비-제 한적인 예들은 컨베이어 시스템 또는 벨트, 압출기, 펠릿화기, 및 열 교환기이다. 혼합이 없는 완충형 장비의 일부 비-제한적인 예들은 완충 사일로, 빈들 등이다. 혼합이 있는 완충형 장비의 일부 비-제한적인 예들은 혼 합기가 있는 사일로, 혼합 용기, 절단 밀, 이중 콘 블렌더, 경화 튜브 등이다. 혼합이 있는 비-완충형 장비의 일부 비-제한적인 예들은 정적 또는 동적 혼합기 등이다. 분리가 있는 완충형 장비의 일부 비-제한적인 예들은 칼럼, 분리기, 추출, 박막 기화기, 필터, 체 등이다. 장비는 심지어, 저장 또는 패키징 요소, 이를테면, 옥타 빈 충전(octabin filling), 드럼, 백(bag), 탱크 트럭일 수 있거나 이를 포함할 수 있다. 생산 플랜트는 적어도 하나의 프로세스 체인을 포함한다. 본원에서 사용되는 바와 같은 \"프로세스 체인\"이라는"}
{"patent_id": "10-2022-7024591", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 4, "content": "용어는 광의의 용어이고, 관련 기술분야의 통상의 기술자에게 그 용어의 통상적이고 관례적인 의미로 주어져야 하며, 특수한 또는 맞춤화된 의미로 제한되지 않아야 한다. 이 용어는 구체적으로, 제한 없이, 적어도 하나의 처리 유닛에서 또는 복수의 처리 유닛들에서 수행되는 일련의 프로세스들 또는 생산 단계들을 지칭할 수 있다. 프로세스 체인은, 동시에 수행될 수 있는 단계들 또는 프로세스들 및/또는 연속적으로 수행될 수 있는 단계들 또는 프로세스들을 포함할 수 있다. 프로세스 체인은 적어도 하나의 생산 라인을 포함할 수 있다. 프로세스 체인은, 다수의 생산 라인들, 특히, 병렬로 동작될 수 있는 다수의 생산 라인들을 포함할 수 있다. 생산 플랜트는, 적어도 2개의 순차적 프로세스, 특히, 적어도 2개의 화학적 프로세스를 포함할 수 있다. \"순차 적 프로세스\"라는 용어는, 서로 이어지는 적어도 2개의 프로세스를 지칭할 수 있다. 프로세스들 각각은 상이한 동작 파라미터들을 가질 수 있다. 구체적으로, 후속하는 제2 프로세스는 이전의 제1 프로세스에 의해 영향을 받을 수 있으며, 여기서, 특히, 제1 프로세스의 적어도 하나의 파라미터가 제2 프로세스로부터의 파라미터들을 결정할 수 있다. 별개의 파라미터들을 갖는 순차적 프로세스들은, 특히, 2개의 프로세스 중 적어도 하나가 화 학적 프로세스인 경우, 제어하기가 더 힘들거나 더 어려울 수 있다. 본 발명에 따른 제어 및/또는 모니터링하 기 위한 방법은, 순차적 프로세스들의 신뢰가능한 단순화된 제어를 허용할 수 있다. 프로세스 체인은 적어도 하나의 배치(batch) 프로세스를 포함한다. 본원에서 사용되는 바와 같은 \"배치 프로세"}
{"patent_id": "10-2022-7024591", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 5, "content": "스\"라는 용어는 광의의 용어이고, 관련 기술분야의 통상의 기술자에게 그 용어의 통상적이고 관례적인 의미로 주어져야 하며, 특수한 또는 맞춤화된 의미로 제한되지 않아야 한다. 이 용어는 구체적으로, 제한 없이, 처리 유닛들이 시간순 순서로 있고 생산 프로세스와 직접 관련되는 프로세스를 지칭할 수 있다. 프로세스 체인은 다 수의 배치 프로세스들을 포함할 수 있다. 배치 프로세스는, 생성물의 적어도 하나의 특성을 제어하도록 구성될 수 있다. 배치 프로세스는, 적어도 하나의 기계적 및/또는 적어도 하나의 열적 및/또는 적어도 하나의 화학적 프로세스를 포함할 수 있다. 배치 프로세스는, 밀링, 혼합, 체질(sieving), 스크리닝, 수소 어닐링, 코팅, 및 이들의 조합들 중 하나 이상을 포함하는, 마감 동작들로 또한 표시되는 처리 유닛 동작들을 포함할 수 있다. 생산 플랜트는, 적어도 하나의 밀, 적어도 하나의 스크린, 적어도 하나의 체, 적어도 하나의 오븐, 적어도 하나의 하소기, 적어도 하나의 회전식 가마, 적어도 하나의 유동층으로 이루어진 그룹으로부터 선택되는 적어도 하 나의 유닛을 포함할 수 있다. 프로세스 체인은 적어도 하나의 연속적 프로세스를 포함할 수 있다. 본원에서 사용되는 바와 같은 \"연속적 프"}
{"patent_id": "10-2022-7024591", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 6, "content": "로세스\"라는 용어는 광의의 용어이고, 관련 기술분야의 통상의 기술자에게 그 용어의 통상적이고 관례적인 의미 로 주어져야 하며, 특수한 또는 맞춤화된 의미로 제한되지 않아야 한다. 이 용어는 구체적으로, 제한 없이, 중 단이 없는 흐름 생산 방법을 지칭할 수 있다. 프로세스 체인은, 배치 및 연속적 프로세스들을 포함할 수 있다. 프로세스 체인은, 반-연속적 및/또는 반-배치(semi-batch) 프로세스들을 포함할 수 있다. 예컨대, 프로세스 체 인은, 적어도 하나의 연속적 프로세스 및 복수의 배치 프로세스들을 포함할 수 있다. 생산 플랜트는, 연속적 처리 및/또는 배치 처리를 위해 구성될 수 있다. 생산 플랜트는, 복수의 병렬의 연속적 및/또는 배치 프로세스 들을 포함할 수 있다. 연속적 및/또는 배치 프로세스들은 상이한 방식들로 조합될 수 있다. 연속적 및 배치 프로세스들의 조합은, 적어도 하나의 기준, 이를테면, 생성물에 대한 품질에 의존할 수 있다. 연속적 및 배치 프로세스들의 조합은, 품질 기준에 기반하여 프로세스 체인을 통한 최상의 경로를 취하도록 선택될 수 있다. 부가적으로, 다른 기준들, 이를테면 주문 대기열(order queue) 등이 가능할 수 있다. 예컨대, 생산 플랜트는, 적어도 하나의 분말을 생산하도록 구성되는 분말 생산 플랜트일 수 있다. 분말은, 예 컨대 1 내지 100 nm의 입자 크기들을 갖는 나노-크기의 분말, 또는 예컨대 0.1 내지 10 ㎛의 입자 크기들을 갖 는 마이크로-크기의 분말일 수 있다. 분말은, 카르보닐 철 분말(CIP); 철 분말; 카본 블랙; 니켈; 철; 산화아 연; 이산화티타늄으로 이루어진 그룹으로부터 선택되는 적어도 하나의 분말일 수 있다. 특히, 생산 플랜트는, 카르보닐 철 분말(CIP)의 생산을 위한 분말 생산 플랜트일 수 있다. 카르보닐 철 분말은, 금속 사출 성형, 코일 코어들, 레이더 흡수, 다이아몬드 툴들 등을 위한 것과 같은 다양한 산업적 응용 들을 위해 생산될 수 있다. CIP는 고순도의 마이크로-크기의 철 분말이다. CIP는 철 펜타카르보닐의 열 분해 에 의해 생산될 수 있다. CIP는, 가스상 철 펜타카르보닐(IPC)이 Fe 및 CO로 분해되는 고온-벽 에어로졸 프로 세스를 통해 생산될 수 있다. 생산 플랜트는, 적어도 하나의 증발기를 포함할 수 있거나 적어도 하나의 증발기 에 연결될 수 있다. 생산 플랜트는 적어도 하나의 반응기를 포함할 수 있다. 반응기는, 프로세스 체인의 연속 적 프로세스일 수 있거나 그 일부일 수 있다. 별개의 카르보닐화-플랜트 또는 업스트림 프로세스 단계에서 생 성될 수 있는 액체 철 펜타카르보닐(IPC)은 증발기에 공급될 수 있으며, 여기서, 액체는 약 104 ℃까지 가열된 다. IPC는 비등되고, 생성된 순수 가스는 생산 플랜트의 반응기에 공급될 수 있다. 반응기는, 특정 길이 및 직경을 갖는 원통형 반응기일 수 있다. 반응기는 550 ℃까지 벽-가열될 수 있다. IPC는 흡열 반응에서 철 및 5 몰 CO-가스로 정량적으로 분해된다. 반응 구역 내의 온도는 전형적으로 250 ℃ 내지 350 ℃이다. 가스 상에 서 형성된 Fe-입자들은 ㎛-크기의 구형 입자들일 수 있다. 반응기에 의해 생성된 미가공 CIP는 전형적으로 일부 불순물들을 함유하는데, 예컨대, 경질 CIP는 C 또는 N 또 는 O(∑~2 wt%)를 함유하며, 이는, 촉매 활성 철 입자들의 표면 상에서 발생하는 상이한 부반응들로부터 비롯된 다. 구체적으로, 시스템에 암모니아가 공급되지 않는 경우, Fe-탄화물들 및 -산화물들이 구조에서 발견될 수 있고; 암모니아가 반응 가스들에 부가되는 경우, Fe-산화물들은 거의 형성되지 않지만, -질화물들 및 -탄화물들 이 형성된다. 미가공 CIP 특성들은, 공급물 조성, 유입 가스들의 온도들, 반응기 기하학적 구조, 반응기 크기, 반응기 벽 온도 중 하나 이상을 통해 제어될 수 있다. 프로세스 체인은 적어도 하나의 미가공 CIP 분류 단계를 포함할 수 있으며, 여기서, 생성된 미가공 CIP를 적어도 2개 이상의 분획(fraction)으로 분류하기 위해, IPC 1 몰당 5몰의 CO와 같은 반응기의 배출 가스(off-gas) 또는 반응기의 최하부에서 반응기에 형성되는 물질이 사용 될 수 있다. IPC 및 미가공 CIP 생산은 연속적 프로세스로 행해질 수 있다. 미가공 CIP는, 완성된 생성물을 생산하기 위해 적어도 하나의 배치 프로세스에서 추가로 처리될 수 있다. 위에 약술된 바와 같이, 프로세스 체인은 적어도 하나의 배치 프로세스를 포함한다. 예컨대, 미가공 CIP는 컨테이터 들 내로 공급될 수 있고, 그 후, 요망되는 그리고/또는 계획된 그리고/또는 원하는 완성된 생성물의 요건들에 따라 상이한 배치 프로세스들에서 처리될 수 있다. 생산 플랜트는, 상이한 종류의 완성된 CIP, 소위 등급들을 생성하도록 구성될 수 있다. 등급들은, 다수의 생산 라인들 상에서 생성될 수 있다. 등급들은, 응용 특정 특 성들 및 품질 기준들에 의존할 수 있다. 품질 기준들은, CIP의 산업적 응용에 의해 특정될 수 있다. 품질 기 준들은, 응용에 대한 적절한 기능을 보장하기 위해 정의될 수 있다. 완성된 CIP 생성물의 특성들은, 입자 크기 분포, 형태학적 구조, 응집도, 표면 화학성질, 및 상 조성 중 하나 이상을 포함할 수 있다. 완성된 CIP 생성물 의 특성들, 즉, 프로세스 체인의 결과는, 밀링, 혼합, 체질, 스크리닝, 수소 어닐링, 코팅, 및 이들의 조합들 중 하나 이상을 포함하는 후속 고체 처리 유닛 동작들에 의해 제어될 수 있다. 생산 플랜트는, 적어도 하나의 밀, 적어도 하나의 스크린, 적어도 하나의 체, 적어도 하나의 오븐, 적어도 하나의 하소기, 적어도 하나의 회전식 가마, 적어도 하나의 유동층으로 이루어진 그룹으로부터 선택되는 적어도 하나의 유닛을 포함할 수 있다. 미가공 CIP 특성들은, 기계적 및/또는 열적 및/또는 화학적 프로세스들에 의해 개질될 수 있다. 밀링은, 응집 체들 및/또는 응집물들을 파괴하는 것을 포함할 수 있다. 혼합은, 더 큰 배치들을 균질화하는 것을 포함할 수 있다. 체질은, 입자 크기 분포의 미세 조정을 포함할 수 있다. 특성들의 후속 조정은, 많은 기업 노하우 및/ 또는 수동 배치 조작들을 요구할 수 있다. CIP의 생산 프로세스는, 다양한 규격들을 충족시키기 위해 높은 수준의 유연성을 요구한다. 분말 생산에서, 중 간 품질 검사들 및/또는 분말 특성들을 지배하는 현상의 제1 원리 이해가 종종 누락되고/거나 불완전하므로, 모 든 각각의 생산 단계에서 품질 문제들을 검출하는 것은 일반적으로 어렵다. 이는, 잘못된 또는 적합하지 않은 생성물이 상이한 단계들에 걸쳐 달성되고 프로세스 체인의 끝에 있는 최종 품질 확인에서만 검출되는 것을 초래 할 수 있다. 그러한 조건들 하에서는, 생산 실패들 및 적합하지 않은 CIP 배치들의 생산의 위험성이 높다. 본 발명은, 요구되는 특성들 및/또는 품질 기준들을 충족시키기 위해 최적의 생산 조건들 하에서의 생산을 허용하 는 방법을 제안한다. 방법은, 구체적으로는 주어진 순서로 수행될 수 있는, 다음의 방법 단계들을 포함한다. 그럼에도 불구하고, 상 이한 순서가 또한 가능하다. 추가로, 방법 단계들 중 2개 이상을 완전히 또는 부분적으로 동시에 수행하는 것 이 가능하다. 추가로, 방법 단계들 중 하나 이상 또는 심지어 전부가 한 번 수행될 수 있거나 반복적으로 수행 될 수 있는데, 이를테면, 한 번 또는 여러 번 반복될 수 있다. 추가로, 방법은, 열거되지 않은 부가적인 방법 단계들을 포함할 수 있다. 방법은 다음의 단계들을 포함한다: a) 적어도 하나의, 입력 데이터를 결정하는 단계 ― 입력 데이터는 적어도 하나의 품질 기준 및 생산 플랜트 레 이아웃 데이터를 포함하고, 이 단계는, 적어도 하나의 통신 인터페이스를 통해, 생산 플랜트 레이아웃 데이터를 리트리브(retrieve)하고 품질 기준에 관한 정보를 수신하는 단계를 포함함 ―; b) 적어도 하나의 예측 단계 ― 예측 단계에서, 입력 데이터에 대해 적어도 하나의 훈련된 모델을 적용함으로써, 생산 플랜트를 동작시키기 위한 동작 조건들이 결정되고, 훈련된 모델은, 이력 생산 실행들로부 터의 센서 데이터에 대해 훈련됨으로써 적어도 부분적으로 데이터 주도됨(data-driven) ―; c) 동작 조건들이 제공되는 적어도 하나의 제어 및/또는 모니터링 단계."}
{"patent_id": "10-2022-7024591", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 7, "content": "본원에서 사용되는 바와 같은 \"입력 데이터\"라는 용어는 광의의 용어이고, 관련 기술분야의 통상의 기술자에게 그 용어의 통상적이고 관례적인 의미로 주어져야 하며, 특수한 또는 맞춤화된 의미로 제한되지 않아야 한다. 이 용어는 구체적으로, 제한 없이, 훈련된 모델에 대한 입력 값 또는 파라미터 및/또는 훈련된 모델에 채워질 수 있는 데이터를 지칭할 수 있다. 훈련된 모델은, 입력 데이터에 기반하여 적어도 하나의 예측을 생성하도록 구성된다. 입력 데이터는, 품질 기준을 특성화할 수 있는 적어도 하나의 파라미터의 정량화가능한 변수일 수 있거나 이를 포함할 수 있다. 입력 데이터는, 플랜트 레이아웃 데이터를 특성화할 수 있는 적어도 하나의 파라 미터의 정량화가능한 변수일 수 있거나 이를 포함할 수 있다. 입력 데이터는 품질 기준을 포함한다. 본원에서 사용되는 바와 같은 \"품질 기준\"이라는 용어는 광의의 용어이"}
{"patent_id": "10-2022-7024591", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 8, "content": "고, 관련 기술분야의 통상의 기술자에게 그 용어의 통상적이고 관례적인 의미로 주어져야 하며, 특수한 또는 맞 춤화된 의미로 제한되지 않아야 한다. 이 용어는 구체적으로, 제한 없이, 생성물, 특히 완성된 생성물의 적어 도 하나의 특성, 이를테면, 값 또는 범위를 지칭할 수 있다. 품질 기준은 응용 의존적 품질 기준일 수 있다. 품질 기준은, 입자 크기 분포, 형태학적 구조, 응집도, 표면 화학성질, 및 상 조성 중 하나 이상을 포함할 수 있다. 품질 기준은 적어도 하나의 고객 규격을 포함할 수 있다. 고객 규격은, 적어도 하나의 품질 파라미터에 대한 적어도 하나의 범위를 포함할 수 있다. 품질 파라미터에 기반하여, 고객 가치 체인(customer value chain)을 따른 추가적인 처리가 수행될 수 있다. 훈련된 모델에는, 품질 기준들에 관한 입력 데이터, 특히, 입 력 파라미터들이 공급될 수 있다. 입력 파라미터들 중 일부는 고객에 의해 제공될 수 있다. 고객 입력에 기반 하여 다른 것들이 결정될 수 있다. 예컨대, 고객은, 산업적 응용 및 그러한 응용과 관련된 규격들을 특정할 수 있다. 생성물 특성들에 관한 부가적인 입력 파라미터들이 데이터베이스로부터 계산되거나 리트리브될 수 있다. 품질 기준은, 통신 인터페이스를 통해 고객에 의해 제공될 수 있다. 본원에서 사용되는 바와 같은 \"통신 인터"}
{"patent_id": "10-2022-7024591", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 9, "content": "페이스\"라는 용어는 광의의 용어이고, 관련 기술분야의 통상의 기술자에게 그 용어의 통상적이고 관례적인 의미 로 주어져야 하며, 특수한 또는 맞춤화된 의미로 제한되지 않아야 한다. 이 용어는 구체적으로, 제한 없이, 정 보를 전송하도록 구성되는 경계를 형성하는 아이템 또는 요소를 지칭할 수 있다. 특히, 통신 인터페이스는, 이를테면, 예컨대 다른 디바이스 상으로 정보를 전송 또는 출력하기 위해, 계산 디바이스, 예컨대 컴퓨터로부터 정보를 전송하도록 구성될 수 있다. 부가적으로 또는 대안적으로, 통신 인터페이스는, 이를테면, 정보를 수신 하기 위해, 계산 디바이스 상으로, 예컨대 컴퓨터 상으로 정보를 전송하도록 구성될 수 있다. 통신 인터페이스 는 구체적으로, 정보를 전송 또는 교환하기 위한 수단을 제공할 수 있다. 특히, 통신 인터페이스는, 데이터 전 송 연결들, 예컨대, 블루투스(Bluetooth), NFC, 유도성 결합 등을 제공할 수 있다. 예로서, 통신 인터페이스는, 네트워크 또는 인터넷 포트, USB 포트, 및 디스크 드라이브 중 하나 이상을 포함하는 적어도 하 나의 포트일 수 있거나 이를 포함할 수 있다. 통신 인터페이스는, 적어도 하나의 웹 인터페이스일 수 있다. 입력 데이터는, 생산 플랜트 레이아웃 데이터를 포함한다. 본원에서 사용되는 바와 같은 \"생산 플랜트 레이아"}
{"patent_id": "10-2022-7024591", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 10, "content": "웃 데이터\"라는 용어는 광의의 용어이고, 관련 기술분야의 통상의 기술자에게 그 용어의 통상적이고 관례적인 의미로 주어져야 하며, 특수한 또는 맞춤화된 의미로 제한되지 않아야 한다. 이 용어는 구체적으로, 제한 없이, 특히, 아래에서 더 상세히 설명될 바와 같은 화이트 박스 모델에서 사용될 수 있는 물리-화학적 값들을 지칭할 수 있다. 예컨대, 생산 플랜트 레이아웃 데이터는, 생산 플랜트에 관한 정보, 이를테면, 생산 팬트 (pant)의 설계, 및/또는 상태, 이를테면, 동작 중, 유지보수 중, 유지보수 계획됨, 현재 동작 상태, 예컨대 열 화 상태를 포함할 수 있다. 설계는, 당면한 물리적 반응기 설계를 특정하는 파라미터들, 이를테면, 반응기 기 하학적 구조, 반응기들의 수, 플랜트 레이아웃, 이를테면 연속적 프로세스 또는 배치 프로세스를 포함할 수 있 다. 생산 플랜트 레이아웃 데이터는 실시간 데이터를 포함할 수 있다. 실시간 데이터는, 생산 플랜트의 현재 상태에 관한 정보를 포함할 수 있다. \"현재 상태에 관한 정보\"라는 용어는, 예컨대, 생산 플랜트의 하나 이상 의 센서로부터의 센서 데이터를 통해 획득된, 동작 상태에 관한 임의적 정보를 지칭할 수 있다. 생산 플랜트 레이아웃 데이터는 미리 정의된 레이아웃 파라미터들을 포함할 수 있다. 예컨대, 미리 정의된 레이아웃 파라미 터들은, 기하학적 구조, 규격들, 이를테면, 최소 온도, 최대 온도, 속도 등 중 하나 이상을 포함할 수 있다. 미리 정의된 레이아웃 데이터는 화이트 박스 모델을 위해 또는 스케줄링을 위해 사용될 수 있다. 미리 정의된 레이아웃 파라미터들은, 통신 인터페이스를 통해 적어도 하나의 데이터베이스로부터 리트리브될 수 있다. 본원"}
{"patent_id": "10-2022-7024591", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 11, "content": "에서 사용되는 바와 같은 \"데이터베이스\"라는 용어는 광의의 용어이고, 관련 기술분야의 통상의 기술자에게 그 용어의 통상적이고 관례적인 의미로 주어져야 하며, 특수한 또는 맞춤화된 의미로 제한되지 않아야 한다. 이 용어는 구체적으로, 제한 없이, 정보, 이를테면, 적어도 하나의 데이터 저장 디바이스에 저장된 정보의 임의적 집합을 지칭할 수 있다. 데이터베이스는, 정보가 저장된 적어도 하나의 데이터 저장 디바이스를 포함할 수 있 다. 특히, 데이터베이스는 정보의 임의적 집합을 포함할 수 있다. 데이터베이스는, 적어도 하나의 서버, 복수 의 서버들을 포함하는 적어도 하나의 서버 시스템, 적어도 하나의 클라우드 서버, 또는 클라우드 컴퓨팅 기반구 조로 이루어진 그룹으로부터 선택되는 적어도 하나의 데이터베이스일 수 있거나 이를 포함할 수 있다. 데이터 베이스는, 데이터를 저장하도록 구성되는 적어도 하나의 저장 유닛을 포함할 수 있다."}
{"patent_id": "10-2022-7024591", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 12, "content": "본원에서 사용되는 바와 같은 \"예측\"이라는 용어는 광의의 용어이고, 관련 기술분야의 통상의 기술자에게 그 용 어의 통상적이고 관례적인 의미로 주어져야 하며, 특수한 또는 맞춤화된 의미로 제한되지 않아야 한다. 이 용 어는 구체적으로, 제한 없이, 훈련된 모델의 결과를 지칭할 수 있다. 예측은, 특히, 품질 기준을 충족시키기 위한 적어도 하나의 동작 조건의 예상 값일 수 있다. 훈련된 모델은, 요구되는 응용 특정 생성물 특성들, 특히, 분말 특성들을 산출하는 최적의 생산 프로세스 조건들을 예측하도록 구성될 수 있다. 다시 말해서, b) 단계에서의 동작 조건들의 결정은, 생산 플랜트를 동작시키기 위한 동작 조건들을 예측하는 것을 포함할 수 있 다. 구체적으로, 예측 단계에서, 생산 플랜트를 동작시키기 위한 예측 동작 조건들이 결정된다. 제어 및/또는 모니터링 단계는 예측 동작 조건들에 기반할 수 있다. 제어 및/또는 모니터링 단계는 예측 동작 조건들을 제공 하는 것을 포함할 수 있다. b) 단계에서 결정된 동작 조건들은 최상의 경로에 관한 정보를 포함할 수 있다. 예측 동작 조건들은 프로세스 체인을 통한 최상의 경로를 포함할 수 있다. 본원에서 사용되는 바와 같은"}
{"patent_id": "10-2022-7024591", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 13, "content": "\"경로\" 또는 \"생산 경로\"라는 용어는 광의의 용어이고, 관련 기술분야의 통상의 기술자에게 그 용어의 통상적이 고 관례적인 의미로 주어져야 하며, 특수한 또는 맞춤화된 의미로 제한되지 않아야 한다. 이 용어는 구체적으 로, 제한 없이, 유닛 동작들의 조합 및/또는 처리 유닛들의 조합 및/또는 특히, 생산 플랜트에서 생산 프로세스 동안 수행 및/또는 통과되는 연속적 및/또는 배치 프로세스들을 포함하는 프로세스들 또는 생산 단계들의 조합"}
{"patent_id": "10-2022-7024591", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 14, "content": "을 지칭할 수 있다. 본원에서 사용되는 바와 같은 \"최상의 경로\"라는 용어는 광의의 용어이고, 관련 기술분야 의 통상의 기술자에게 그 용어의 통상적이고 관례적인 의미로 주어져야 하며, 특수한 또는 맞춤화된 의미로 제 한되지 않아야 한다. 이 용어는 구체적으로, 제한 없이, 적어도 하나의 품질 기준의 관점에서의 생산 플랜트를 통한 최적의 경로를 지칭할 수 있다. 그에 따라, 최적의 경로는 구체적으로, 적어도 하나의 품질 기준을 최대 화 또는 최소화하는 복수의 가능한 경로들로부터 선택되는 경로일 수 있다. 최상의 경로는, 표적 경로 및/또는 최종 경로 및/또는 계획된 경로일 수 있다. 예컨대, 배치 프로세스는, 품질 기준 및/또는 생산 플랜트의 작업부하에 따라, 생산 플랜트를 통한 상이한 경로들을 포함할 수 있다. 상이한 처리 유닛 동작들은, 적어도 하나 의 품질 기준의 관점에서 최적에 도달하고/거나 최적을 보장하도록 조합될 수 있다."}
{"patent_id": "10-2022-7024591", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 15, "content": "본원에서 사용되는 바와 같은 \"동작 조건\"이라는 용어는 광의의 용어이고, 관련 기술분야의 통상의 기술자에게 그 용어의 통상적이고 관례적인 의미로 주어져야 하며, 특수한 또는 맞춤화된 의미로 제한되지 않아야 한다. 이 용어는 구체적으로, 제한 없이, 생산 플랜트를 동작시키기 위한 생산 프로세스 조건들, 특히, 생산 플랜트의 하나의 유닛 또는 복수의 유닛들 또는 심지어 모든 유닛들에 대한 생산 프로세스 조건들을 지칭할 수 있다. 동 작 조건들은, 연속적 처리 유닛들에 대한 동작 조건들, 이를테면, 체적 또는 질량 유량들, 유입 조성, 유입 온 도, 농도들, 압력, 반응기 벽 온도들, 반응기 기하학적 구조, 반응기 크기 중 하나 이상을 포함할 수 있다. 동 작 조건들은, 배치 처리 유닛들에 대한 동작 조건들, 이를테면, 체류 시간, 압력, 체적 또는 질량 유량들, 유입 조성, 유입 온도, 농도들, 벽 온도들, 투입 레시피, 반응기 기하학적 구조, 반응기 크기 중 하나 이상을 포함할 수 있다."}
{"patent_id": "10-2022-7024591", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 16, "content": "본원에서 사용되는 바와 같은 \"훈련된 모델\"이라는 용어는 광의의 용어이고, 관련 기술분야의 통상의 기술자에 게 그 용어의 통상적이고 관례적인 의미로 주어져야 하며, 특수한 또는 맞춤화된 의미로 제한되지 않아야 한다. 이 용어는 구체적으로, 제한 없이, 적어도 하나의 훈련 데이터 세트에 대해 훈련되었고 적어도 하나의 입력 변 수에 대한 적어도 하나의 표적 변수를 예측하도록 구성되는 수학적 모델을 지칭할 수 있다. 구체적으로, 입력 변수는 품질 기준 및 플랜트 레이아웃 데이터일 수 있고, 표적 변수는 동작 조건들일 수 있다. 훈련된 모델은, 이력 생산 실행들로부터의 센서 데이터에 대해 훈련됨으로써 적어도 부분적으로 데이터 주도된다. 본원에서 사"}
{"patent_id": "10-2022-7024591", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 17, "content": "용되는 바와 같은 \"데이터 주도 모델\"이라는 용어는 광의의 용어이고, 관련 기술분야의 통상의 기술자에게 그 용어의 통상적이고 관례적인 의미로 주어져야 하며, 특수한 또는 맞춤화된 의미로 제한되지 않아야 한다. 이 용어는 구체적으로, 제한 없이, 경험적 예측 모델을 지칭할 수 있다. 구체적으로, 데이터 주도 모델은 실험적 데이터의 분석으로부터 도출된다. 데이터 주도 모델은 기계 학습 툴일 수 있다. 훈련된 모델은, 프로세스 제어, 물리적 반응기 설계, 플랜트 레이아웃, 및 생산 실행들로부터의 데이터와 연관 된 생산된 분말의 품질 기준들 중 하나 이상을 포함하는 이력 데이터로 훈련될 수 있다. 훈련된 모델은, 이력 생산 플랜트 레이아웃 데이터, 적어도 하나의 이력 품질 기준, 및 이력 동작 조건들을 반영하는 센서 데이터 중 하나 이상을 포함하는 이력 생산 실행들로부터의 데이터에 대해 훈련될 수 있다. 일반적으로, 모델의 훈련은, 함수, 이러한 경우에서는 플랜트 레이아웃 데이터를 재현하는 것에 기반할 수 있으며, 여기서, 품질 기준들은 함수들의 변수들이고, 동작 조건들은 함수 값들이다. 동작 조건들이 센서 데이터에 의해 반영되기 때문에, 모 델의 훈련은 센서 데이터에 기반한다. 게다가, 모델의 훈련은, 이력 플랜트 레이아웃 데이터 및 품질 기준들에 적어도 부분적으로 기반할 수 있다. \"이력 생산 실행\"이라는 용어는, 과거의 또는 더 이른 시점에서의 생산 실 행들을 지칭한다. 이력 생산 실행들은, 프로세스 제어, 물리적 반응기 설계, 플랜트 레이아웃, 및 생산 실행들 의 센서 데이터 중 하나 이상으로부터의 데이터와 연관된 생산된 생성물들의 품질 기준들을 포함할 수 있다. 센서 데이터는, 적어도 하나의 온도 센서, 체적 또는 질량 유량 센서, 압력 센서, 입자 카운트 센서, 중량 센서 로부터의 데이터를 포함할 수 있다. 본원에서 사용되는 바와 같이, \"적어도 부분적으로 데이터 주도 모델\"이라"}
{"patent_id": "10-2022-7024591", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 18, "content": "는 용어는 광의의 용어이고, 관련 기술분야의 통상의 기술자에게 그 용어의 통상적이고 관례적인 의미로 주어져 야 하며, 특수한 또는 맞춤화된 의미로 제한되지 않아야 한다. 이 용어는 구체적으로, 제한 없이, 훈련된 모델 이 데이터 주도 모델 부분들 및 다른 모델 부분들을 포함한다는 사실을 지칭할 수 있다. 훈련된 모델은 하이브리드 모델일 수 있다. 하이브리드 모델은, 제1 원리 부분들, 소위 화이트 박스뿐만 아니 라 데이터 주도 부분들, 소위 블랙 박스를 포함하는 모델을 지칭할 수 있는데, 예컨대, 문헌 [review paper of Moritz von Stoch et al.: \"Hybrid semi-parametric modeling in process systems engineering: Past, present and future\", 2014, Computers & Chemical Engineering, pergamon press, Oxford, GB, vol. 60, 31 August 2013, pages 86 to 101 XP028792356, ISSN: 0098-1354, DOI: 10.1016/J.COMPCHEMENG.2013.08.008]을 참조한다. 훈련된 모델은, 화이트 박스 모델 및 블랙 박스 모델의 조합을 포함할 수 있다. 화이트 박스 모델 은 물리-화학적 법칙들에 기반할 수 있다. 물리-화학적 법칙들은 제1 원리들로부터 도출될 수 있다. 물리-화 학적 법칙들은, 화학 동역학, 질량, 운동량, 및 에너지 보존 법칙들, 임의적 차원에서의 입자 개체군 중 하나 이상을 포함할 수 있다. 화이트 박스 모델은, 개개의 프로세스 단계를 지배하는 물리-화학적 법칙들에 따라 선 택될 수 있다. 블랙 박스 모델은, 이력 생산 실행들로부터의 센서 데이터에 기반할 수 있다. 블랙 박스 모델 은, 기계 학습, 심층 학습, 신경망들, 또는 다른 형태의 인공 지능 중 하나 이상을 사용함으로써 구축될 수 있 다. 블랙 박스 모델은, 훈련과 테스트 데이터 사이의 양호한 적합도를 산출하는 임의의 모델일 수 있다. 훈련된 모델은, 직렬 또는 병렬 아키텍처를 포함할 수 있다. 직렬 아키텍처에서, 화이트 박스 모델의 출력이 블랙 박스 모델에 대한 입력으로서 사용되거나 블랙 박스 모델의 출력이 화이트 박스 모델에 대한 입력으로서 사용된다. 병렬 아키텍처에서, 화이트 박스 모델 및 블랙 박스 모델의 조합된 출력이, 이를테면 출력들의 중첩 에 의해 결정된다. 직렬 및 병렬 아키텍처의 추가적인 세부사항들에 대해, 문헌 [the review paper of Moritz von Stoch et al.: \"Hybrid semi-parametric modeling in process systems engineering: Past, present and future\", 2014, Computers & Chemical Engineering, pergamon press, Oxford, GB, vol. 60, 31 August 2013, pages 86 to 101 XP028792356, ISSN: 0098-1354, DOI: 10.1016/J.COMPCHEMENG.2013.08.008]에 대한 참조가 이 루어진다. 예컨대, 미가공 CIP 생산 단계에서, 프로세스 제어 데이터 및 반응기 기하학적 구조에 기반하여 모 델을 훈련시키는 데 3개의 서브-모델이 사용될 수 있다. 제1 서브-모델은, 화이트 박스 모델로서 화학 동역학 및 개체군 수지 솔버(population balance solver)를 갖는 하이브리드 모델 및 이력 데이터에 대해 훈련된 블랙 박스 보정기의 역할을 하는 데이터 주도 모델에 기반하여 평균 입자 직경을 예측할 수 있다. 이러한 제1 서브- 모델은, 화이트 박스 모델의 출력이 블랙 박스 모델에 대해 입력되는 직렬 아키텍처를 가질 수 있거나, 또는 제 1 서브-모델은 병렬 아키텍처를 가질 수 있다. 제2 서브-모델은, 제1 서브-모델로부터의 입력들 및 전산 유체 역학(Computational fluid Dynamics)(CFD)을 통해 획득된 체류 시간 분포들에 기반하여 입자 크기 분포를 예측 할 수 있다. 체류 시간 분포들이 개체군 수지 솔버를 통해 변환되어 입자 크기 분포들(PSD)이 획득된다. 컴퓨 팅된 PSD와 이력 데이터 사이의 오류는 데이터 주도 모델에 의해 학습될 수 있고, 이어서, 임의적 예측들에 대 해 적용될 수 있다. 제2 서브-모델은 병렬 아키텍처를 가질 수 있다. 제3 서브-모델은, 제1 서브-모델 및 이 력 훈련 데이터에 의해 제공되는 특징들에 기반하여 화학적 조성을 예측할 수 있다. 제3 서브-모델은 직렬 아 키텍처를 가질 수 있으며, 여기서, 블랙 박스 모델의 출력은 화이트 박스 모델에 입력된다. 다른 예들이 또한 가능할 수 있다. 훈련된 모델은, 적어도 하나의 서브-모델, 특히, 복수의 서브-모델들을 포함할 수 있다. 예컨대, 서브-모델은 화이트 박스 모델일 수 있고/거나 서브-모델들 중 적어도 하나가 화이트 박스 모델일 수 있다. 훈련된 모델은, 이를테면, 생산 단계들 중 적어도 하나에 대한 그리고/또는 프로세스 단계들 중 적어도 하나에 대한 그리고/또 는 적어도 하나의 생산 라인에 대한 복수의 서브-모델들을 포함할 수 있으며, 이들은 화이트 박스 모델들이거나, 하이브리드 모델들 또는 순수 데이터 주도 모델들이다. 각각의 서브-모델은, 동작 조건들을 예 측하는 것 또는 동작 조건들을 예측하는 다른 서브-모델들에 입력을 제공하는 것을 담당할 수 있다. 훈련된 모 델은, 실제 생산 프로세스에서 직접 제어가능한, 제어가능한 파라미터들을 예측하도록 구축된다. 그러한 파라 미터들은, 생산 플랜트 레이아웃 파일의 메타 데이터를 통해 플래그 지정될 수 있다. 본원에서 사용되는 바와"}
{"patent_id": "10-2022-7024591", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 19, "content": "같은 \"제어가능한 파라미터\"라는 용어는 광의의 용어이고, 관련 기술분야의 통상의 기술자에게 그 용어의 통상 적이고 관례적인 의미로 주어져야 하며, 특수한 또는 맞춤화된 의미로 제한되지 않아야 한다. 이 용어는 구체 적으로, 제한 없이, 생산 프로세스에서 설정될 수 있는 파라미터를 지칭할 수 있다. 제어가능한 파라미터들은, 예컨대, 체적 또는 질량 유량들, 유입 조성, 유입 온도, 농도들, 압력, 반응기 벽 온도들 중 하나 이상을 포함 할 수 있다. 생산 플랜트에 의한 생산은 복수의 생산 단계들을 포함할 수 있다. 훈련된 모델은, 단일 생산 단계 또는 생산 단계들의 그룹을 표현할 수 있다. 훈련된 모델은, 단일 생산 단계에 대한 또는 생산 단계들의 그룹에 대한 동 작 조건들을 예측하도록 구성된다. 이상적으로, 각각의 제어가능한 요소를 포함하는 전체 프로세스 체인이 예 측될 수 있다. 생산 플랜트는 적어도 하나의 생산 라인을 포함할 수 있다. 생산 플랜트는 다수의 생산 라인들을 포함할 수 있 다. 생산 라인들은 병렬로 동작될 수 있다. 훈련된 모델은, 단일 생산 라인 또는 생산 라인들의 그룹에 대한 동작 조건들을 예측하도록 구성될 수 있다. 예컨대, 생산 라인은, 적어도 하나의 반응기 및 적어도 하나의 고 체 처리 유닛을 포함할 수 있다. 훈련된 모델은, 반응기 및/또는 고체 처리 유닛들에 대한 동작 조건들을 예측 하도록 구성될 수 있다. 위에 약술된 바와 같이, 프로세스 체인은, 연속적 및 배치 프로세스들의 임의적 조합들을 포함할 수 있다. 훈 련된 모델은, 품질 기준을 달성하기 위해 처리 체인을 통한 최상의 경로에 관한 동작 조건들을 제공하도록 구성 될 수 있다. 부가적으로, 처리 체인을 통한 최상의 경로를 결정하기 위한 다른 기준들, 이를테면 순서 대기열 등이 고려될 수 있다. 훈련된 모델은, 미가공 CIP 생성물을 위한 반응기 상에서의 CIP 생산과 같은 생산 프로세스의 일부 또는 연속적 프로세스를 포함하고/거나 커버할 수 있다. 부가적으로, CIP 등급들로 이어지는 미가공 생성물을 완성하기 위 한 배치 프로세스는 훈련된 모델에 포함될 수 있다. 이러한 마감 동작들은, 예컨대, 밀링, 분류, 수소 어닐링, 코팅, 및 이들의 조합들을 포함할 수 있다. 훈련된 모델은, 프로세스 체인의 각각의 배치 프로세스에 관한 유닛 동작들을 포함할 수 있다. 유닛 동작들은, 산업적 응용 및 개개의 생성물 특성들, 특히 CIP 특성들에 따라, 미리 정의된 조합 세트로서 훈련된 모델에 포함될 수 있다. 구체적으로, 배치 프로세스는, 그러한 경우에 중간 품질 기준을 제공할 수 있는 생산 프로세스의 일부 또는 연속적 프로세스를 커버하는 훈련된 모델의 출력에 기 반하여 모델링될 수 있다. 모든 각각의 배치 프로세스 또는 경로는 자신 고유의 모델을 가질 수 있다. 각각의 유닛 동작 조합에 대해, 모델은, 입력 데이터, 특히 고객의 입력에 따라 예측하도록 훈련되고 선택될 수 있다. 훈련된 모델은, 프로세스 체인을 통한 미리 정의된 경로에 대한 모델을 포함할 수 있다. 예컨대, 특히 CIP 생 산에 대해, 훈련된 모델은, 반응기 및 미리 정의된 유닛 동작들에 관한 모델 부분들을 포함할 수 있다. 예컨대, 동작 조건들이 결정되는 매칭 또는 적합 경로가 품질 기준에 기반하여 선택되는 복수의 상이한 미리 정 의된 경로들이 존재할 수 있다. 프로세스 체인을 통한 미리 정의된 경로에 대해 대안적으로, 적어도 하나의 최 적화 문제가 목적 함수에 기반하여 정의될 수 있다. 예컨대, 최적의 동작 조건들 및 연속적 및 배치 프로세스 의 최적의 조합을 찾기 위해 그래프 이론이 사용될 수 있다. 그에 따라, 최상의 경로들이 훈련될 수 있고, 동 작 조건들에 부가하여 예측될 수 있다."}
{"patent_id": "10-2022-7024591", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 20, "content": "본원에서 사용되는 바와 같은 \"제어\"라는 용어는 광의의 용어이고, 관련 기술분야의 통상의 기술자에게 그 용어 의 통상적이고 관례적인 의미로 주어져야 하며, 특수한 또는 맞춤화된 의미로 제한되지 않아야 한다. 이 용어 는 구체적으로, 제한 없이, 생산 플랜트의 적어도 하나의 파라미터를 결정 및/또는 조정하는 것을 지칭할 수 있"}
{"patent_id": "10-2022-7024591", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 21, "content": "다. 본원에서 사용되는 바와 같은 \"모니터링\"이라는 용어는 광의의 용어이고, 관련 기술분야의 통상의 기술자 에게 그 용어의 통상적이고 관례적인 의미로 주어져야 하며, 특수한 또는 맞춤화된 의미로 제한되지 않아야 한 다. 이 용어는 구체적으로, 제한 없이, 생산 플랜트의 적어도 하나의 파라미터를 정량적 및/또는 정성적으로 결정하는 것을 지칭할 수 있다. 적어도 하나의 파라미터는 생산 플랜트의 동작 조건들과 관련된다. 제어 및/ 또는 모니터링 단계에서, 예측 동작 조건들이 제공된다. 구체적으로, 제어 및/또는 모니터링 단계는 예측 동작 조건들에 기반할 수 있다. \"제공\"이라는 용어는, 특히, 생산 플랜트의 적어도 하나의 제어기 또는 스케줄러에 대한 적어도 하나의 출력을 생성하는 것을 지칭할 수 있다. 동작 조건들은 적어도 하나의 출력 채널을 통해 제 공될 수 있다. 생산 플랜트는 결정된 동작 조건들에 따라 제어될 수 있다. 각각의 제어가능한 요소에 대한 동 작 조건들이 제공될 수 있다. 훈련된 모델은, 실제 생산 프로세스에서 직접 제어가능한, 제어가능한 파라미터 들을 예측하도록 구성될 수 있다. 그러한 파라미터들은, 생산 플랜트 레이아웃 파일의 메타 데이터를 통해 플 래그 지정될 수 있다. 특히, 미가공 CIP 생산 프로세스의 반응기는, 최적의 결과에 도달하도록, 제공된 동작 조건들에 따라 제어될 수 있다. 방법은, 제어 시스템, 이를테면, 아래에서 더 상세히 설명되는 제어 시스템을 사용하는 단계를 포함할 수 있다. 방법은, 결정된 동작 조건들에 기반하여 생산 플랜트의 실행들에 대한 생산 계획을 결정하는 단계를 포함할 수 있다. 방법은, 제어 시스템 및/또는 스케줄러를 제어하는 것에 의해, 그리고 특히, 최적의 생산 계획에 의해 생산 플랜트를 제어하는 것을 허용할 수 있다. 일단 고객이 요망되는 규격을 포함하여 주문을 하면, 훈련된 모 델을 이용하여 최적의 동작 조건들이 결정될 수 있다. 전체 생산 계획이 제어 시스템에 의해 평가될 수 있고/ 거나 스케줄러에 전달될 수 있으며, 제어 시스템 및/또는 스케줄러는, 예컨대, 품질 기준들, 반응기 할당, 동작 조건들, 원재료의 프라이즈(prize)들, 긴급성들, 배치 크기들 등에서의 유사성에 기반하여 착신 생산 실행들을 순위화할 수 있다. 부가적으로, 제어 시스템 및/또는 스케줄러는, 최종 생산 배치들을 픽업하고 그들을 고객의 위치로 수송하기 위해, 요구되는 수송 터미널들이 현장에 있도록 촉발하는 물류유통(logistic)을 위해 수송 계 획 시스템과 통신할 수 있다. 부가적으로, 제어 시스템 및/또는 스케줄러는, 완전히 디지털화된 생산 계획에 기반하여 재고 수준들을 예상하기 위해 사용될 수 있다. 본 발명의 추가적인 양상에서, 생산 플랜트를 제어 및/또는 모니터링하기 위한 컴퓨터 프로그램, 구체적으로는 애플리케이션이 제안된다. 생산 플랜트는, 적어도 하나의 배치 프로세스를 포함하는 적어도 하나의 프로세스 체인을 포함하며, 여기서, 컴퓨터 프로그램은, 프로그램이 컴퓨터 또는 컴퓨터 네트워크에 의해 실행될 때, 컴 퓨터 또는 컴퓨터 네트워크로 하여금 다음의 단계들을 수행하게 하는 명령어들을 포함한다: i) 입력 데이터를 결정하는 단계 ― 입력 데이터는 적어도 하나의 품질 기준 및 생산 플랜트 레이아웃 데이터를 포함하고, 이 단계는, 적어도 하나의 통신 인터페이스를 통해, 생산 플랜트 레이아웃 데이터를 리트리브하고 품 질 기준에 관한 정보를 수신하는 단계를 포함함 ―; ii) 입력 데이터에 대해 적어도 하나의 훈련된 모델을 적용함으로써, 생산 플랜트를 동작시키기 위한 동작 조건 들을 결정하는 단계 ― 훈련된 모델은, 이력 생산 실행들로부터의 센서 데이터에 대해 훈련됨으로써 적어도 부 분적으로 데이터 주도됨 ―;iii) 동작 조건들을 제공하는 단계. 본원에서 사용되는 용어들 대부분의 가능한 정의들에 대해, 위의 또는 아래에서 더 상세히 설명되는 바와 같은 컴퓨터에 의해 구현되는 방법의 설명에 대한 참조가 이루어질 수 있다. 구체적으로, 컴퓨터 프로그램은, 컴퓨터 판독가능 데이터 캐리어 상에 그리고/또는 컴퓨터 판독가능 저장 매체 상에 저장될 수 있다. 본원에서 사용되는 바와 같이, \"컴퓨터 판독가능 데이터 캐리어\" 및 \"컴퓨터 판독가능 저장 매체\"라는 용어들은 구체적으로, 컴퓨터 실행가능 명령어들을 저장한 하드웨어 저장 매체와 같은 비-일시 적인 데이터 저장 수단을 지칭할 수 있다. 컴퓨터 판독가능 데이터 캐리어 또는 저장 매체는 구체적으로, 랜덤 액세스 메모리(RAM) 및/또는 판독 전용 메모리(ROM)와 같은 저장 매체일 수 있거나 이를 포함할 수 있다. 프로그램이 컴퓨터 또는 컴퓨터 네트워크 상에서 실행될 때 본원에 포함된 실시예들 중 하나 이상에서의 본 발 명에 따른 방법을 수행하기 위한 프로그램 코드 수단을 갖는 컴퓨터 프로그램 제품이 본원에서 추가로 개시되고 제안된다. 구체적으로, 프로그램 코드 수단은, 컴퓨터 판독가능 데이터 캐리어 및/또는 컴퓨터 판독가능 저장 매체 상에 저장될 수 있다. 컴퓨터 또는 컴퓨터 네트워크 내로, 이를테면, 컴퓨터 또는 컴퓨터 네트워크의 작업 메모리 또는 메인 메모리 내로 로딩된 후에 본원에 개시된 실시예들 중 하나 이상에 따른 방법을 실행할 수 있는 데이터 구조가 저장된 데이터 캐리어가 본원에서 추가로 개시되고 제안된다. 프로그램이 컴퓨터 또는 컴퓨터 네트워크 상에서 실행될 때 본원에 개시된 실시예들 중 하나 이상에 따른 방법 을 수행하기 위한, 기계 판독가능 캐리어 상에 저장된 프로그램 코드 수단을 갖는 컴퓨터 프로그램 제품이 본원 에서 추가로 개시되고 제안된다. 본원에서 사용되는 바와 같이, 컴퓨터 프로그램 제품은 거래가능 제품으로서 의 프로그램을 지칭한다. 제품은 일반적으로, 임의적 포맷으로, 이를테면 페이퍼 포맷으로, 또는 컴퓨터 판독 가능 데이터 캐리어 상에 존재할 수 있다. 구체적으로, 컴퓨터 프로그램 제품은 데이터 네트워크를 통해 배포 될 수 있다. 본 발명의 추가적인 양상에서, 생산 플랜트를 제어 및/또는 모니터링하기 위한 제어 시스템이 제안된다. 생산 플랜트는, 적어도 하나의 배치 프로세스를 포함하는 적어도 하나의 프로세스 체인을 포함한다. 제어 시스템은, 입력 데이터의 결정을 위해 구성되는 적어도 하나의 통신 인터페이스를 포함한다. 입력 데이터는, 적어도 하나 의 품질 기준 및 생산 플랜트 레이아웃 데이터를 포함한다. 통신 인터페이스는, 생산 플랜트 레이아웃 데이터 를 리트리브하고 품질 기준에 관한 정보를 수신하도록 구성된다. 제어 시스템은, 입력 데이터에 대해 적어도 하나의 훈련된 모델을 적용함으로써 생산 플랜트를 동작시키기 위한 동작 조건들을 결정하도록 구성되는 적어도 하나의 예측 유닛을 포함한다. 훈련된 모델은, 이력 생산 실행들로부터의 센서 데이터에 대해 훈련됨으로써 적 어도 부분적으로 데이터 주도된다. 제어 시스템은, 동작 조건들을 제공하도록 구성되는 적어도 하나의 출력 디 바이스를 포함한다."}
{"patent_id": "10-2022-7024591", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 22, "content": "본원에서 사용되는 바와 같은 \"예측 유닛\"이라는 용어는 광의의 용어이고, 관련 기술분야의 통상의 기술자에게 그 용어의 통상적이고 관례적인 의미로 주어져야 하며, 특수한 또는 맞춤화된 의미로 제한되지 않아야 한다. 이 용어는 구체적으로, 제한 없이, 바람직하게는 적어도 하나의 데이터 처리 디바이스를 사용함으로써, 더 바람 직하게는, 적어도 하나의 프로세서 및/또는 적어도 하나의 주문형 집적 회로(application-specific integrated circuit)를 사용함으로써 예측을 수행하도록 적응되는 임의적 디바이스를 지칭할 수 있다. 그에 따라, 예로서, 예측 유닛은, 하나 이상의 프로그래밍가능 디바이스, 이를테면, 하나 이상의 컴퓨터, 주문형 집적 회로(ASIC), 필드 프로그래밍가능 게이트 어레이(FPGA), 또는 위에 언급된 예측을 수행하도록 구성되는 다른 디바이스를 포 함할 수 있다. 그에 따라, 예로서, 적어도 하나의 예측 유닛은, 다수의 컴퓨터 명령들을 포함하는 소프트웨어 코드가 저장된 적어도 하나의 데이터 처리 디바이스를 포함할 수 있다. 예측 유닛은, 명명된 동작들 중 하나 이상을 수행하기 위한 하나 이상의 하드웨어 요소를 제공할 수 있고/거나 명명된 동작들 중 하나 이상을 수행하 기 위한 소프트웨어가 실행되는 하나 이상의 프로세서를 제공할 수 있다."}
{"patent_id": "10-2022-7024591", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 23, "content": "본원에서 사용되는 바와 같은 \"출력 디바이스\"라는 용어는 광의의 용어이고, 관련 기술분야의 통상의 기술자에 게 그 용어의 통상적이고 관례적인 의미로 주어져야 하며, 특수한 또는 맞춤화된 의미로 제한되지 않아야 한다. 이 용어는 구체적으로, 제한 없이, 훈련된 모델의 적어도 하나의 결과를, 예컨대 적어도 하나의 스케줄러에 제 공하도록 구성되는 디바이스를 지칭할 수 있다. 출력 디바이스는 적어도 하나의 디스플레이 디바이스를 포함할 수 있다. 제어 시스템은, 결정된 동작 조건들에 따라 생산 플랜트를 제어 및/또는 모니터링하도록 구성되는 적어도 하나 의 제어 유닛을 포함할 수 있다. 제어 시스템은, 생산 플랜트를 스케줄링하도록 구성되는 스케줄러 유닛을 더 포함할 수 있다. 스케줄러 유닛은, 결정된 동작 조건들에 기반하여 생산 플랜트의 실행들에 대한 생산 계획을 결정하도록 구성될 수 있다. 제어 시스템은, 방법을 참조하는 선행하는 청구항들 중 임의의 하나의 청구항에 따라 생산 플랜트를 제어 및/또는 모니터링하기 위한 방법을 수행하도록 구성될 수 있다. 본원에서 사용되는 용어들 대부분의 가능한 정의들에 대해, 위의 또는 아래에서 더 상세히 설명되는 바와 같은 컴퓨터에 의해 구현 되는 방법의 설명에 대한 참조가 이루어질 수 있다."}
{"patent_id": "10-2022-7024591", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 24, "content": "요약하면, 그리고 추가적인 가능한 실시예들을 배제함이 없이, 다음의 실시예들이 구상될 수 있다: 실시예 1: 생산 플랜트를 제어 및/또는 모니터링하기 위한 컴퓨터에 의해 구현되는 방법에서, 생산 플랜트는 적 어도 하나의 배치 프로세스를 포함하는 적어도 하나의 프로세스 체인을 포함하고, 방법은, 다음의 단계들을 포 함한다: a) 적어도 하나의, 입력 데이터를 결정하는 단계 ― 입력 데이터는 적어도 하나의 품질 기준 및 생산 플랜트 레 이아웃 데이터를 포함하고, 이 단계는, 적어도 하나의 통신 인터페이스를 통해, 생산 플랜트 레이아웃 데이터를 리트리브하고 품질 기준에 관한 정보를 수신하는 단계를 포함함 ―; b) 적어도 하나의 예측 단계 ― 예측 단계에서, 입력 데이터에 대해 적어도 하나의 훈련된 모델을 적용함으로써, 생산 플랜트를 동작시키기 위한 동작 조건들이 결정되고, 훈련된 모델은, 이력 생산 실행들로부 터의 센서 데이터에 대해 훈련됨으로써 적어도 부분적으로 데이터 주도됨 ―; c) 동작 조건들이 제공되는 적어도 하나의 제어 및/또는 모니터링 단계. 실시예 2: 선행하는 실시예에 따른 방법에서, 생산 플랜트는 적어도 2개의 순차적 프로세스를 포함한다. 실시예 3: 선행하는 실시예 중 임의의 하나의 청구항에 따른 방법에서, 생산 플랜트는 결정된 동작 조건들에 따 라 제어된다. 실시예 4: 선행하는 실시예에 따른 방법에서, 각각의 제어가능한 요소에 대한 동작 조건들이 제공되고, 훈련된 모델은, 실제 생산 프로세스에서 직접 제어가능한, 제어가능한 파라미터들을 예측하도록 구성된다. 실시예 5: 선행하는 실시예들 중 임의의 하나의 실시예에 따른 방법에서, 훈련된 모델은, 품질 기준을 달성하기 위한, 처리 체인을 통한 최상의 경로에 관한 동작 조건들을 제공하도록 구성되고, b) 단계에서 결정된 동작 조 건들은 처리 체인을 통한 최상의 경로를 포함한다. 실시예 6: 선행하는 실시예들 중 임의의 하나의 실시예에 따른 방법에서, 결정된 동작 조건들에 기반하여 생산 플랜트의 실행들에 대한 생산 계획이 결정된다. 실시예 7: 선행하는 실시예들 중 임의의 하나의 실시예에 따른 방법에서, 품질 기준에 관한 정보는 적어도 하나 의 고객 규격을 포함하고, 고객 규격은 적어도 하나의 품질 파라미터에 대한 적어도 하나의 범위를 포함한다. 실시예 8: 선행하는 실시예들 중 임의의 하나의 실시예에 따른 방법에서, 생산 플랜트 레이아웃 데이터는 실시 간 데이터를 포함하고, 실시간 데이터는 생산 플랜트의 현재 상태에 관한 정보를 포함한다. 실시예 9: 선행하는 실시예들 중 임의의 하나의 실시예에 따른 방법에서, 생산 플랜트 레이아웃 데이터는 미리 정의된 레이아웃 파라미터들을 포함하고, 미리 정의된 레이아웃 파라미터들은 통신 인터페이스를 통해 적어도 하나의 데이터베이스로부터 리트리브된다. 실시예 10: 선행하는 실시예들 중 임의의 하나의 실시예에 따른 방법에서, 생산 플랜트는 연속적 처리를 위해 구성된다. 실시예 11: 선행하는 실시예들 중 임의의 하나의 실시예에 따른 방법에서, 생산 플랜트에 의한 생산은 복수의 생산 단계들을 포함하고, 훈련된 모델은, 단일 생산 단계에 대한 또는 생산 단계들의 그룹에 대한 동작 조건들 을 예측하도록 구성된다. 실시예 12: 선행하는 실시예들 중 임의의 하나의 실시예에 따른 방법에서, 훈련된 모델은 하이브리드 모델이다. 실시예 13: 선행하는 실시예들 중 임의의 하나의 실시예에 따른 방법에서, 훈련된 모델은 적어도 하나의 서브- 모델을 포함하고, 서브-모델은 화이트 박스 모델, 하이브리드 모델, 또는 데이터 주도 모델 중 하나 이상이다. 실시예 14: 선행하는 실시예들 중 임의의 하나의 실시예에 따른 방법에서, 훈련된 모델은, 화이트 박스 모델들 이거나 하이브리드 모델들 또는 순수 데이터 주도 모델들인 복수의 서브-모델들을 포함하고, 각각의 서브-모델 은 동작 조건들을 예측하는 것 또는 동작 조건들을 예측하는 다른 서브-모델들에 입력을 제공하는 것을 담당한 다. 실시예 15: 선행하는 실시예들 중 임의의 하나의 실시예에 따른 방법에서, 훈련된 모델은 화이트 박스 모델과 블랙 박스 모델의 조합을 포함하고, 화이트 박스 모델은 물리-화학적 법칙들에 기반하고, 블랙 박스 모델은 이 력 생산 실행들로부터의 센서 데이터에 기반한다. 실시예 16: 선행하는 실시예에 따른 방법에서, 물리-화학적 법칙은 화학 동역학, 질량, 운동량, 및 에너지의 보 존 법칙들, 임의적 차원에서의 입자 개체군 중 하나 이상을 포함한다. 실시예 17: 2개의 선행하는 실시예 중 임의의 하나의 실시예에 따른 방법에서, 블랙 박스 모델은, 기계 학습, 심층 학습, 신경망들, 또는 다른 형태의 인공 지능 중 하나 이상을 사용함으로써 구축된다. 실시예 18: 3개의 선행하는 실시예 중 임의의 하나의 실시예에 따른 방법에서, 훈련된 모델은 직렬 또는 병렬 아키텍처를 포함한다. 실시예 19: 선행하는 실시예에 따른 방법에서, 직렬 아키텍처에서, 화이트 박스 모델의 출력이 블랙 박스 모델 에 대한 입력으로서 사용되거나 블랙 박스 모델의 출력이 화이트 박스 모델에 대한 입력으로서 사용되고, 병렬 아키텍처에서, 화이트 박스 모델 및 블랙 박스 모델의 조합된 출력은, 이를테면 출력들의 중첩에 의해 결정된다. 실시예 20: 선행하는 실시예들 중 임의의 하나의 실시예에 따른 방법에서, 훈련된 모델은, 프로세스 제어, 물리 적 반응기 설계, 플랜트 레이아웃, 및 생산 실행들로부터의 데이터와 연관된 생산된 분말의 품질 기준들 중 하 나 이상을 포함하는 이력 데이터로 훈련된다. 실시예 21: 선행하는 실시예들 중 임의의 하나의 실시예에 따른 방법에서, 생산 플랜트는 적어도 하나의 분말을 생산하도록 구성되는 분말 생산 플랜트이고, 분말은, 카르보닐 철 분말(CIP); 철 분말; 카본 블랙; 니켈; 철; 산화아연; 이산화티타늄으로 이루어진 그룹으로부터 선택되는 적어도 하나의 분말이다. 실시예 22: 생산 플랜트를 제어 및/또는 모니터링하기 위한 컴퓨터 프로그램, 구체적으로는 애플리케이션으로서, 생산 플랜트는, 적어도 하나의 배치 프로세스를 포함하는 적어도 하나의 프로세스 체인을 포함하고, 컴퓨터 프로그램은, 프로그램이 컴퓨터 또는 컴퓨터 네트워크에 의해 실행될 때, 컴퓨터 또는 컴퓨터 네트워크로 하여금 다음의 단계들을 수행하게 하는 명령어들을 포함한다: i) 입력 데이터를 결정하는 단계 ― 입력 데이터는 적어도 하나의 품질 기준 및 생산 플랜트 레이아웃 데이터를 포함하고, 이 단계는, 적어도 하나의 통신 인터페이스를 통해, 생산 플랜트 레이아웃 데이터를 리트리브하고 품 질 기준에 관한 정보를 수신하는 단계를 포함함 ―; ii) 입력 데이터에 대해 적어도 하나의 훈련된 모델을 적용함으로써, 생산 플랜트를 동작시키기 위한 동작 조건 들을 결정하는 단계 ― 훈련된 모델은, 이력 생산 실행들로부터의 센서 데이터에 대해 훈련됨으로써 적어도 부 분적으로 데이터 주도됨 ―; iii) 동작 조건들을 제공하는 단계. 실시예 23: 생산 플랜트를 제어 및/또는 모니터링하기 위한 컴퓨터에 의해 구현되는 방법에서, 생산 플랜트는 적어도 하나의 배치 프로세스를 포함하는 적어도 하나의 프로세스 체인을 포함하고, 방법은, 다음의 단계들: - 적어도 하나의, 입력 데이터를 결정하는 단계 ― 입력 데이터는 적어도 하나의 품질 기준 및 생산 플랜트 레 이아웃 데이터를 포함하고, 이 단계는, 적어도 하나의 통신 인터페이스를 통해, 생산 플랜트 레이아웃 데이터를 리트리브하고 품질 기준에 관한 정보를 수신하는 단계를 포함함 ―; - 적어도 하나의 예측 단계 ― 예측 단계에서, 입력 데이터에 대해 적어도 하나의 훈련된 모델을 적용함으 로써, 생산 플랜트를 동작시키기 위한 동작 조건들이 결정되고, 훈련된 모델은, 이력 생산 실행들로부터의 센서 데이터에 대해 훈련됨으로써 적어도 부분적으로 데이터 주도됨 ―; - 동작 조건들이 제공되는 적어도 하나의 제어 및/또는 모니터링 단계를 포함하며, 예측 단계에서 결정되는 동작 조건들은, 처리 체인을 통한 최상의 경로를 포함한다. 실시예 24: 선행하는 실시예에 따른 방법에서, 방법은, 실시예 1 내지 실시예 21 중 임의의 하나의 실시예에 따 른 제어 및/또는 모니터링하기 위한 방법에 따라 생산 플랜트를 제어 및/또는 모니터링하는 단계를 포함한다. 실시예 25: 생산 플랜트를 제어 및/또는 모니터링하기 위한 제어 시스템에서, 생산 플랜트는, 적어도 하나의 배 치 프로세스를 포함하는 적어도 하나의 프로세스 체인을 포함하고, 제어 시스템은, 입력 데이터의 결정을 위해 구성되는 적어도 하나의 통신 인터페이스를 포함하고, 입력 데이터는, 적어도 하나의 품질 기준 및 생산 플랜트 레이아웃 데이터를 포함하고, 통신 인터페이스는, 생산 플랜트 레이아웃 데이터를 리트리브하고 품질 기준에 관 한 정보를 수신하도록 구성되고, 제어 시스템은, 입력 데이터에 대해 적어도 하나의 훈련된 모델을 적용함으로 써 생산 플랜트를 동작시키기 위한 동작 조건들을 결정하도록 구성되는 적어도 하나의 예측 유닛을 포함하고, 훈련된 모델은, 이력 생산 실행들로부터의 센서 데이터에 대해 훈련됨으로써 적어도 부분적으로 데이터 주도되 며, 제어 시스템은, 동작 조건들을 제공하도록 구성되는 적어도 하나의 출력 디바이스를 포함한다. 실시예 26: 선행하는 실시예에 따른 제어 시스템에서, 제어 시스템은, 결정된 동작 조건들에 따라 생산 플랜트 를 제어 및/또는 모니터링하도록 구성되는 적어도 하나의 제어 유닛을 포함한다. 실시예 27: 선행하는 실시예에 따른 제어 시스템에서, 제어 시스템은, 생산 플랜트를 스케줄링하도록 구성되는 스케줄러 유닛을 더 포함하고, 스케줄러 유닛은, 결정된 동작 조건들에 기반하여 생산 플랜트의 실행들에 대한 생산 계획을 결정하도록 구성된다. 실시예 28: 3개의 선행하는 실시예 중 임의의 하나의 실시예에 따른 제어 시스템에서, 제어 시스템은, 방법을 참조하는 선행하는 실시예들 중 임의의 하나의 실시예에 따른 생산 플랜트를 제어 및/또는 모니터링하기 위한 방법을 수행하도록 구성된다."}
{"patent_id": "10-2022-7024591", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 1, "content": "도 1은 본 발명에 따른, 생산 플랜트를 제어 및/또는 모니터링하기 위한 예시적인 컴퓨터에 의해 구현되는 방법의 실시예를 도시한다. 도 2a 및 도 2b는 생산 플랜트의 예시적인 실시예들을 도시한다. 생산 플랜트는 화학적 생산 플랜트 일 수 있다. 특히, 생산 플랜트는, 적어도 하나의 분말을 생산하도록 구성되는 분말 생산 플랜트일 수 있 다. 생산 플랜트는, 적어도 하나의 배치 프로세스를 포함하는 적어도 하나의 프로세스 체인을 포함한다. 프로세스 체인은, 적어도 하나의 처리 유닛에서 또는 복수의 처리 유닛들에서 수행되는 일련의 프로세스들 또는 생산 단계들을 포함할 수 있다. 프로세스 체인은, 동시에 수행될 수 있는 단계들 또는 프로세스들 및/또는 연속적으로 수행될 수 있는 단계들 또는 프로세스들을 포함할 수 있다. 프로세스 체인 은 적어도 하나의 생산 라인을 포함할 수 있다. 프로세스 체인은, 다수의 생산 라인들, 특히, 병렬로 동작될 수 있는 다수의 생산 라인들을 포함할 수 있다. 도 2a에 도시된 바와 같이, 프로세스 체인(11 2)은, \"라인 1\" 내지 \"라인 n\"으로 표시된 n개의 생산 라인을 포함할 수 있으며, n은 양의 정수이다. 도 2a에 도시된 실시예에서, 생산 라인들은 병렬로 동작된다. 배치 프로세스는, 시간순 순서로 배열되고 생산 프로세스와 직접 관련될 수 있는 처리 유닛들을 포함할 수 있다. 프로세스 체인은 다수의 배치 프로세스들을 포함할 수 있다. 배치 프로세스는, 생성물 의 적어도 하나의 특성을 제어하도록 구성될 수 있다. 배치 프로세스는, 적어도 하나의 기계적 및/또는 적어도 하나의 열적 및/또는 적어도 하나의 화학적 프로세스를 포함할 수 있다. 배치 프로세스는, 밀링, 혼합, 체질, 스크리닝, 수소 어닐링, 코팅, 및 이들의 조합들 중 하나 이상을 포함하는, 마감 동작들로 또한 표 시되는 처리 유닛 동작들을 포함할 수 있다. 생산 플랜트는, 적어도 하나의 밀, 적어도 하나의 스크 린, 적어도 하나의 체, 적어도 하나의 오븐, 적어도 하나의 하소기, 적어도 하나의 회전식 가마, 적어도 하나의 유동층으로 이루어진 그룹으로부터 선택되는 적어도 하나의 유닛을 포함할 수 있다. 도 2a에 도시된 바와 같이, 프로세스 체인, 특히, 생산 라인들 각각은, \"유닛 1\" 내지 \"유닛 n\"으로 표시된 n개의 유닛 을 포함할 수 있으며, n은 양의 정수이다. 프로세스 체인은 적어도 하나의 연속적 프로세스를 포함할 수 있다. 프로세스 체인은, 배치 프 로세스들 및 연속적 프로세스들을 포함할 수 있다. 프로세스 체인은, 반-연속적 및/또는 반-배 치 프로세스들을 포함할 수 있다. 예컨대, 프로세스 체인은, 적어도 하나의 연속적 프로세스 및 복 수의 배치 프로세스들을 포함할 수 있다. 생산 플랜트는, 연속적 처리 및/또는 배치 처리를 위해 구 성될 수 있다. 생산 플랜트는, 복수의 병렬의 연속적 프로세스들 및/또는 배치 프로세스들을 포함할 수 있다. 연속적 프로세스들 및/또는 배치 프로세스들은 상이한 방식들로 조합될 수 있다. 연속적 프로세스들 및 배치 프로세스들의 조합은, 적어도 하나의 기준, 이를테면, 생성물에 대한 품 질에 의존할 수 있다. 연속적 프로세스들 및 배치 프로세스들의 조합은, 품질 기준에 기반하여 프로 세스 체인을 통한 최상의 경로를 취하도록 선택될 수 있다. 부가적으로, 다른 기준들, 이를테면 주문 대 기열 등이 가능할 수 있다. b) 단계에서 결정된 동작 조건들은 최상의 경로에 관한 정보를 포함할 수 있다. 경로는, 유닛 동작들의 조합 및/또는 처리 유닛들의 조합 및/또는 특히, 생산 플랜트에서 생산 프로세스 동안 수행 및/또는 통과되는 연속적 및/또는 배치 프로세스들을 포함하는 프로세스들 또는 생산 단계들의 조합일 수 있다. 최상의 경로는, 적어도 하나의 품질 기준의 관점에서의 생산 플랜트를 통한 최적의 경로일 수 있다. 그에 따라, 최적의 경로는 구체적 으로, 적어도 하나의 품질 기준을 최대화 또는 최소화하는 복수의 가능한 경로들로부터 선택되는 경로일 수 있 다. 최상의 경로는, 표적 경로 및/또는 최종 경로 및/또는 계획된 경로일 수 있다. 예컨대, 배치 프로세스는, 품질 기준 및/또는 생산 플랜트의 작업부하에 따라, 생산 플랜트를 통한 상이한 경로들을 포함할 수 있다. 상 이한 처리 유닛 동작들은, 적어도 하나의 품질 기준의 관점에서 최적에 도달하고/거나 최적을 보장하도록 조합 될 수 있다. 도 2b는 유닛 1 내지 유닛 6의 조합이 상이한 2개의 가능한 경로 a) 및 b)를 갖는 실시예를 도시 한다. 최상의 경로는, 요망되는 화학적 생성물, 구체적으로는 그의 품질 기준에 따라 선택될 수 있다. 예컨대, 생산 플랜트는, 적어도 하나의 분말을 생산하도록 구성되는 분말 생산 플랜트일 수 있다. 분말은, 예컨대 1 내지 100 nm의 입자 크기들을 갖는 나노-크기의 분말, 또는 예컨대 0.1 내지 10 ㎛의 입자 크 기들을 갖는 마이크로-크기의 분말일 수 있다. 분말은, 카르보닐 철 분말(CIP); 철 분말; 카본 블랙; 니켈; 철; 산화아연; 이산화티타늄으로 이루어진 그룹으로부터 선택되는 적어도 하나의 분말일 수 있다. 예컨대, 도 2a에 도시된 바와 같이, 생산 플랜트는, 카르보닐 철 분말(CIP)의 생산을 위한 분말 생산 플랜 트일 수 있다. 카르보닐 철 분말은, 금속 사출 성형, 코일 코어들, 레이더 흡수, 다이아몬드 툴들 등을 위한 것과 같은 다양한 산업적 응용들을 위해 생산될 수 있다. CIP는 고순도의 마이크로-크기의 철 분말이다. CIP 는 철 펜타카르보닐의 열 분해에 의해 생산될 수 있다. CIP는, 가스상 철 펜타카르보닐(IPC)이 Fe 및 CO로 분 해되는 고온-벽 에어로졸 프로세스를 통해 생산될 수 있다. 생산 플랜트는, 적어도 하나의 증발기를 포함 할 수 있거나 적어도 하나의 증발기에 연결될 수 있다. 도 2a에서, 철 펜타카르보닐의 유입은 원재료 및 참조 번호 124로서 표시된다. 생산 플랜트는 적어도 하나의 반응기를 포함할 수 있다. 반응기는, 프로세스 체인의 연속적 프로세스일 수 있거나 그 일부일 수 있다. 별개의 카르보닐화-플랜트 또는 업스트림 프로세스 단계에서 생성될 수 있는 액체 철 펜타카르보닐(IPC)은 증발기에 공급될 수 있으며, 여기서, 액체는 약 104 ℃까지 가열된다. IPC는 비등되고, 생성된 순수 가스는 반응기에 공급될 수 있다. 반응기 는, 특정 길이 및 직경을 갖는 원통형 반응기일 수 있다. 반응기는 550 ℃까지 벽-가열될 수 있다. IPC는 흡열 반응에서 철 및 5 몰 CO-가스로 정량적으로 분해된다. 반응 구역 내의 온도는 전형적으로 250 ℃ 내지 350 ℃이다. 가스 상에서 형성된 Fe-입자들은 ㎛-크기의 구형 입자들일 수 있다. 도 2a에서 \"미가공 분말\" 및 참조 번호 128로서 표시된 미가공 CIP는, 적어도 하나의 배치 프로세스에서 추가로 처리되어, 도 2a에서 \"완성된 분말\" 및 참조 번호 138로서 표시된 완성된 생성물을 생산할 수 있다. 예 컨대, 미가공 CIP는 컨테이터들 내로 공급될 수 있고, 그 후, 요망되는 그리고/또는 계획된 그리고/또는원하는 완성된 생성물의 요건들에 따라 상이한 배치 프로세스들에서 처리될 수 있다. 생산 플랜트는, 상이한 종류의 완성된 CIP, 소위 등급들을 생성하도록 구성될 수 있다. 등급들은, 다수의 생산 라인들 상에서 생성될 수 있다. 등급들은, 응용 특정 특성들 및 품질 기준들에 의존할 수 있다. 품질 기 준들은, CIP의 산업적 응용에 의해 특정될 수 있다. 품질 기준들은, 응용에 대한 적절한 기능을 보장하기 위해 정의될 수 있다. 도 2a에서 \"완성된 분말\" 및 참조 번호 138로서 표시되는 완성된 CIP 생성물의 특성들은, 입 자 크기 분포, 형태학적 구조, 응집도, 표면 화학성질, 및 상 조성 중 하나 이상을 포함할 수 있다. 완성된 CIP 생성물의 특성들, 즉, 프로세스 체인의 결과는, 밀링, 혼합, 체질, 스크리닝, 수소 어닐링, 코팅, 및 이들의 조합들 중 하나 이상을 포함하는 후속 고체 처리 유닛 동작들에 의해 제어될 수 있다. 생산 플랜트 는, 적어도 하나의 밀, 적어도 하나의 스크린, 적어도 하나의 체, 적어도 하나의 오븐, 적어도 하나의 하 소기, 적어도 하나의 회전식 가마, 적어도 하나의 유동층으로 이루어진 그룹으로부터 선택되는 적어도 하나의 유닛을 포함할 수 있다. 미가공 CIP 특성들은, 기계적 및/또는 열적 및/또는 화학적 프로세스들에 의해 개질될 수 있다. 밀링은, 응집체들 및/또는 응집물들을 파괴하는 것을 포함할 수 있다. 혼합은, 더 큰 배치들을 균질 화하는 것을 포함할 수 있다. 체질은, 입자 크기 분포의 미세 조정을 포함할 수 있다. 특성들의 후속 조정은, 많은 기업 노하우 및/또는 수동 배치 조작들을 요구할 수 있다. 도 1을 다시 참조하면, 방법은 다음의 단계들을 포함한다: a) 적어도 하나의, 입력 데이터를 결정하는 단계(참조 번호 132로 표시됨) ― 입력 데이터는 적어도 하나의 품 질 기준 및 생산 플랜트 레이아웃 데이터를 포함하고, 이 단계는, 적어도 하나의 통신 인터페이스를 통해, 생산 플랜트 레이아웃 데이터를 리트리브하고 품질 기준에 관한 정보를 수신하는 단계를 포함함 ―; b) 적어도 하나의 예측 단계(참조 번호 134로 표시됨) ― 예측 단계에서, 입력 데이터에 대해 적어도 하나의 훈 련된 모델을 적용함으로써, 생산 플랜트를 동작시키기 위한 동작 조건들이 결정되고, 훈련된 모델 은, 이력 생산 실행들로부터의 센서 데이터에 대해 훈련됨으로써 적어도 부분적으로 데이터 주도됨 ―; c) 동작 조건들이 제공되는 적어도 하나의 제어 및/또는 모니터링 단계(참조 번호 140으로 표시됨). 품질 기준은 응용 의존적 품질 기준일 수 있다. 품질 기준은, 입자 크기 분포, 형태학적 구조, 응집도, 표면 화학성질, 및 상 조성 중 하나 이상을 포함할 수 있다. 품질 기준은 적어도 하나의 고객 규격을 포함할 수 있 다. 고객 규격은, 적어도 하나의 품질 파라미터에 대한 적어도 하나의 범위를 포함할 수 있다. 품질 파라미터 에 기반하여, 고객 가치 체인을 따른 추가적인 처리가 수행될 수 있다. 훈련된 모델에는, 품질 기준들에 관한 입력 데이터, 특히, 입력 파라미터들이 공급될 수 있다. 입력 파라미터들 중 일부는 고객에 의해 제공될 수 있다. 고객 입력에 기반하여 다른 것들이 결정될 수 있다. 예컨대, 고객은, 산업적 응용 및 그러한 응용과 관련된 규격들을 특정할 수 있다. 생성물 특성들에 관한 부가적인 입력 파라미터들이 데이터베이스로부터 계산 되거나 리트리브될 수 있다. 생산 플랜트에 관한 정보는, 생산 플랜트의 설계 및/또는 상태, 이를테면, 동작 중, 유지보수 중, 유지보 수 계획됨, 현재 동작 상태, 예컨대 열화 상태에 관한 정보일 수 있다. 설계는, 당면한 물리적 반응기 설계를 특정하는 파라미터들, 이를테면, 반응기 기하학적 구조, 반응기들의 수, 플랜트 레이아웃, 이를테면 연속적 프 로세스 또는 배치 프로세스를 포함할 수 있다. 생산 플랜트 레이아웃 데이터는 실시간 데이터를 포함할 수 있 다. 실시간 데이터는, 생산 플랜트의 현재 상태에 관한 정보를 포함할 수 있다. 생산 플랜트 레이아웃 데이터 는 미리 정의된 레이아웃 파라미터들을 포함할 수 있다. 미리 정의된 레이아웃 파라미터들은, 통신 인터페이스 를 통해 적어도 하나의 데이터베이스로부터 리트리브될 수 있다. 데이터베이스는, 정보가 저장된 적어도 하나 의 데이터 저장 디바이스를 포함할 수 있다. 특히, 데이터베이스는 정보의 임의적 집합을 포함할 수 있다. 데 이터베이스는, 적어도 하나의 서버, 복수의 서버들을 포함하는 적어도 하나의 서버 시스템, 적어도 하나의 클라 우드 서버, 또는 클라우드 컴퓨팅 기반구조로 이루어진 그룹으로부터 선택되는 적어도 하나의 데이터베이스일 수 있거나 이를 포함할 수 있다. 데이터베이스는, 데이터를 저장하도록 구성되는 적어도 하나의 저장 유닛을 포함할 수 있다. 예측은, 특히, 품질 기준을 충족시키기 위한 적어도 하나의 동작 조건의 예상 값일 수 있다. 훈련된 모델(13 6)은, 요구되는 응용 특정 생성물 특성들, 특히, 분말 특성들을 산출하는 최적의 생산 프로세스 조건들을 예측 하도록 구성될 수 있다. 동작 조건들은, 연속적 처리 유닛들에 대한 동작 조건들, 이를테면, 체적 또는 질량 유량들, 유입 조성, 유입 온도, 농도들, 압력, 반응기 벽 온도들, 반응기 기하학적 구조, 반응기 크기 중 하나 이상을 포함할 수 있다.동작 조건들은, 배치 처리 유닛들에 대한 동작 조건들, 이를테면, 체류 시간, 압력, 체적 또는 질량 유량들, 유 입 조성, 유입 온도, 농도들, 벽 온도들, 투입 레시피, 반응기 기하학적 구조, 반응기 크기 중 하나 이상을 포 함할 수 있다. 훈련된 모델은, 이력 생산 실행들로부터의 센서 데이터에 대해 훈련됨으로써 적어도 부분적으로 데이터 주 도된다. 구체적으로, 데이터 주도 모델은 실험적 데이터의 분석으로부터 도출된다. 데이터 주도 모델은 기계 학습 툴일 수 있다. 훈련된 모델은, 프로세스 제어, 물리적 반응기 설계, 플랜트 레이아웃, 및 생산 실행 들로부터의 데이터와 연관된 생산된 분말의 품질 기준들 중 하나 이상을 포함하는 이력 데이터로 훈련될 수 있 다. 센서 데이터는, 적어도 하나의 온도 센서, 체적 또는 질량 유량 센서, 압력 센서, 입자 카운트 센서, 중량 센서로부터의 데이터를 포함할 수 있다. 훈련된 모델은 하이브리드 모델일 수 있다. 도 3은 본 발명에 따른 훈련된 모델의 실시예를 도시한 다. 하이브리드 모델은, 제1 원리 부분들, 소위 화이트 박스뿐만 아니라 데이터 주도 부분들, 소위 블랙 박스 를 포함하는 모델을 지칭할 수 있는데, 예컨대, 문헌 [review paper of Moritz von Stoch et al.: \"Hybrid semi-parametric modeling in process systems engineering: Past, present and future\", 2014, Computers & Chemical Engineering, pergamon press, Oxford, GB, vol. 60, 31 August 2013, pages 86 to 101 XP028792356, ISSN: 0098-1354, DOI: 10.1016/J.COMPCHEMENG.2013.08.008]을 참조한다. 훈련된 모델은, 화이트 박스 모델 및 블랙 박스 모델의 조합을 포함할 수 있다. 화이트 박스 모델은 물리-화학 적 법칙들에 기반할 수 있다. 물리-화학적 법칙들은, 화학 동역학, 질량, 운동량, 및 에너지 보존 법칙들, 임 의적 차원에서의 입자 개체군 중 하나 이상을 포함할 수 있다. 화이트 박스 모델은, 개개의 프로세스 단계를 지배하는 물리-화학적 법칙들에 따라 선택될 수 있다. 블랙 박스 모델은, 이력 생산 실행들로부터의 센서 데이터에 기반할 수 있다. 블랙 박스 모델은, 기계 학습, 심층 학습, 신경망들, 또는 다른 형태의 인공 지능 중 하나 이상을 사용함으로써 구축될 수 있다. 블랙 박스 모델은, 훈련과 테스트 데이터 사이의 양 호한 적합도를 산출하는 임의의 모델일 수 있다. 도 4는 훈련된 모델의 실시예의 구성을 도시한다. 특히, 데이터 주도 모델이 생성되는 실험적 데이터 및 화이트 박스 모델이 생성되는 이론적 데이터가 도시 된다. 훈련된 모델은, 직렬 또는 병렬 아키텍처를 포함할 수 있다. 직렬 아키텍처에서, 화이트 박스 모델 의 출력이 블랙 박스 모델에 대한 입력으로서 사용되거나 블랙 박스 모델의 출력이 화이트 박스 모델에 대한 입력으로서 사용된다. 병렬 아키텍처에서, 화이트 박스 모델 및 블랙 박스 모델 의 조합된 출력이, 이를테면 출력들(146, 148)의 중첩에 의해 결정된다. 직렬 및 병렬 아키텍처의 추가적인 세부사항들에 대해, 문헌 [the review paper of Moritz von Stoch et al.: \"Hybrid semi-parametric modeling in process systems engineering: Past, present and future\", 2014, Computers & Chemical Engineering, pergamon press, Oxford, GB, vol. 60, 31 August 2013, pages 86 to 101 XP028792356, ISSN: 0098-1354, DOI: 10.1016/J.COMPCHEMENG.2013.08.008]에 대한 참조가 이루어진다. 도 3은 화이트 박스 모델 및 블랙 박스 모델의 조합된 출력이 가산으로 계산되는 직렬 아키텍처의 실시예들을 도시한다. 훈련된 모델은, 적어도 하나의 서브-모델, 특히, 복수의 서브-모델들을 포함할 수 있다. 예컨대, 서브-모 델은 화이트 박스 모델일 수 있고/거나 서브-모델들 중 적어도 하나가 화이트 박스 모델일 수 있다. 훈련된 모 델은, 이를테면, 생산 단계들 중 적어도 하나에 대한 그리고/또는 프로세스 단계들 중 적어도 하나에 대한 그리고/또는 적어도 하나의 생산 라인에 대한 복수의 서브-모델들을 포함할 수 있으며, 이들은 화이트 박 스 모델들이거나, 하이브리드 모델들 또는 순수 데이터 주도 모델들이다. 각각의 서브-모델은, 동작 조건들을 예측하는 것 또는 동작 조건들을 예측하는 다른 서브-모델들에 입력을 제공하는 것을 담당할 수 있다. 훈련된 모델은, 실제 생산 프로세스에서 직접 제어가능한, 제어가능한 파라미터들을 예측하도록 구축된다. 그러 한 파라미터들은, 생산 플랜트 레이아웃 파일의 메타 데이터를 통해 플래그 지정될 수 있다. 생산 플랜트에 의한 생산은 복수의 생산 단계들을 포함할 수 있다. 훈련된 모델은, 단일 생산 단계 또는 생산 단계들의 그룹을 표현할 수 있다. 훈련된 모델은, 단일 생산 단계에 대한 또는 생산 단계들의 그룹에 대한 동작 조건들을 예측하도록 구성된다. 이상적으로, 각각의 제어가능한 요소를 포함하는 전체 프로 세스 체인이 예측될 수 있다. 훈련된 모델은, 단일 생산 라인 또는 생산 라인들의 그룹에 대한 동작 조건들을 예측하도록 구성될 수 있다. 예컨대, 생산 라인은, 적어도 하나의 반응기 및 적어도 하나의 처리 유닛을 포함할 수 있다. 훈련된 모델은, 반응기 및/또는 고체 처리 유닛들에 대한 동작 조건들을 예측하도록 구성될 수 있다.위에 약술된 바와 같이, 프로세스 체인은, 연속적 및 배치 프로세스들의 임의적 조합들을 포함할 수 있다. 훈련된 모델은, 품질 기준을 달성하기 위해 처리 체인을 통한 최상의 경로에 관한 동작 조건들을 제 공하도록 구성될 수 있다. 부가적으로, 처리 체인을 통한 최상의 경로를 결정하기 위한 다른 기준들, 이를테면 순서 대기열 등이 고려될 수 있다. 훈련된 모델은, 미가공 CIP 생성물을 위한 반응기 상에서의 CIP 생산 과 같은 생산 프로세스의 일부 또는 연속적 프로세스를 포함하고/거나 커버할 수 있다. 부가적으로, CIP 등급들로 이어지는 미가공 생성물을 완성하기 위한 배치 프로세스는 훈련된 모델에 포함될 수 있다. 이러한 마감 동작들은, 예컨대, 밀링, 분류, 수소 어닐링, 코팅, 및 이들의 조합들을 포함할 수 있다. 훈련된 모델은, 프로세스 체인의 각각의 배치 프로세스에 관한 유닛 동작들을 포함할 수 있다. 유닛 동작들은, 산업적 응용 및 개개의 생성물 특성들, 특히 CIP 특성들에 따라, 미리 정의된 조합 세트로 서 훈련된 모델에 포함될 수 있다. 구체적으로, 배치 프로세스는, 그러한 경우에 중간 품질 기준을 제공할 수 있는 생산 프로세스의 일부 또는 연속적 프로세스를 커버하는 훈련된 모델의 출력에 기반 하여 모델링될 수 있다. 모든 각각의 배치 프로세스 또는 경로는 자신 고유의 모델을 가질 수 있다. 각 각의 유닛 동작 조합에 대해, 모델은, 입력 데이터, 특히 고객의 입력에 따라 예측하도록 훈련되고 선택될 수 있다. 훈련된 모델은, 프로세스 체인을 통한 미리 정의된 경로에 대한 모델을 포함할 수 있다. 예컨대, 특 히 CIP 생산에 대해, 훈련된 모델은, 반응기 및 미리 정의된 유닛 동작들에 관한 모델 부분들을 포함할 수 있다. 예컨대, 동작 조건들이 결정되는 매칭 또는 적합 경로가 품질 기준에 기반하여 선택되는 복수의 상이한 미리 정의된 경로들이 존재할 수 있다. 프로세스 체인을 통한 미리 정의된 경로에 대해 대안적으로, 적어 도 하나의 최적화 문제가 목적 함수에 기반하여 정의될 수 있다. 예컨대, 최적의 동작 조건들 및 연속적 프로 세스 및 배치 프로세스의 최적의 조합을 찾기 위해 그래프 이론이 사용될 수 있다. 그에 따라, 최상 의 경로들이 훈련될 수 있고, 동작 조건들에 부가하여 예측될 수 있다. 예컨대, 배치 프로세스는, 품질 기준 및/또는 생산 플랜트의 작업부하에 따라, 생산 플랜트를 통한 상이한 경로들을 포함할 수 있다. 예컨대, 도 2a의 생산 라인들에 대해, 유닛 동작들 및 유닛들은, 적어도 하나의 품질 기준의 관 점에서 최적에 도달하고/거나 최적을 보장하는 것이 가능하도록 조합될 수 있다. 도 2a에 추가로 도시된 바와 같이, 생산 플랜트는 제어 시스템에 의해 제어될 수 있다. 제어 시스템 은, 입력 데이터의 결정을 위해 구성되는 적어도 하나의 통신 인터페이스를 포함한다. 통신 인터페 이스는, 생산 플랜트 레이아웃 데이터를 리트리브하고 품질 기준에 관한 정보를 수신하도록 구성된다. 제 어 시스템은, 입력 데이터에 대해 적어도 하나의 훈련된 모델을 적용함으로써 생산 플랜트를 동 작시키기 위한 동작 조건들을 결정하도록 구성되는 적어도 하나의 예측 유닛을 포함한다. 제어 시스템 은, 동작 조건들을 제공하도록 구성되는 적어도 하나의 출력 디바이스를 포함한다. 생산 플랜트는 결정된 동작 조건들에 따라 제어될 수 있다. 각각의 제어가능한 요소에 대한 동작 조건들 이 제공될 수 있다. 훈련된 모델은, 실제 생산 프로세스에서 직접 제어가능한, 제어가능한 파라미터들을 예측하도록 구성될 수 있다. 그러한 파라미터들은, 생산 플랜트 레이아웃 파일의 메타 데이터를 통해 플래그 지정될 수 있다. 특히, 미가공 CIP 생산 프로세스의 반응기는, 최적의 결과에 도달하도록, 제공된 동작 조건들에 따라 제어될 수 있다. 방법은, 결정된 동작 조건들에 기반하여 생산 플랜트의 실행들에 대한 생산 계획을 결정하는 단계를 포함 할 수 있다. 방법은, 제어 시스템 및/또는 스케줄러를 제어하는 것에 의해, 그리고 특히, 최적의 생산 계 획에 의해 생산 플랜트를 제어하는 것을 허용할 수 있다. 일단 고객이 요망되는 규격을 포함하여 주문을 하면, 훈련된 모델을 이용하여 최적의 동작 조건들이 결정될 수 있다. 전체 생산 계획이 제어 시스템에 의 해 평가될 수 있고/거나 스케줄러에 전달될 수 있으며, 제어 시스템 및/또는 스케줄러는, 예컨대, 품질 기준들, 반응기 할당, 동작 조건들, 원재료의 프라이즈들, 긴급성들, 배치 크기들 등에서의 유사성에 기반하여 착신 생 산 실행들을 순위화할 수 있다. 부가적으로, 제어 시스템 및/또는 스케줄러는, 최종 생산 배치들을 픽업 하고 그들을 고객의 위치로 수송하기 위해, 요구되는 수송 터미널들이 현장에 있도록 촉발하는 물류유통을 위해 수송 계획 시스템과 통신할 수 있다. 부가적으로, 제어 시스템 및/또는 스케줄러는, 완전히 디지털화된 생산 계획에 기반하여 재고 수준들을 예상하기 위해 사용될 수 있다. 다른 예에서, 방법은, 특히 열가소성 폴리우레탄(TPU) 또는 팽창된 열가소성 폴리우레탄(expanded thermoplastic polyurethane)(ETPU)을 생산하기 위한 폴리우레탄 생산 플랜트들에서 적용될 수 있다. 도 1을 다시 참조하면, 본 발명에 따른, 생산 플랜트의 모니터링 및/또는 제어를 위한 컴퓨터에 의해 구현 되는 방법의 추가적인 구현이 도시된다. 도 5a 및 도 5b는 생산 플랜트의 예시적인 실시예들을 도시한다. 생산 플랜트는 화학적 생산 플랜트 일 수 있다. 특히, 생산 플랜트는, 적어도 하나의 폴리우레탄, 더 특정하게는 하나의 TPU 및/또는 하나의 ETPU를 생산하도록 구성되는 폴리우레탄 생산 플랜트일 수 있다. 생산 플랜트는, 적어도 하나의 배치 프 로세스를 포함하는 적어도 하나의 프로세스 체인을 포함한다. 프로세스 체인은, 적어도 하나의 처리 유닛에서 또는 복수의 처리 유닛들에서 수행되는 일련의 프로세스들 또는 생산 단계들을 포함할 수 있다. 프로세스 체인은, 동시에 수행될 수 있는 단계들 또는 프로세스들 및/또는 연속적으로 수행될 수 있는 단 계들 또는 프로세스들을 포함할 수 있다. 프로세스 체인은 적어도 하나의 생산 라인을 포함할 수 있 다. 프로세스 체인은, 다수의 생산 라인들, 특히, 병렬로 동작될 수 있는 다수의 생산 라인들을 포함할 수 있다. 도 5a에 도시된 바와 같이, 프로세스 체인은, \"라인 1\" 내지 \"라인 n\"으로 표시된 n개의 생산 라인을 포함할 수 있으며, n은 양의 정수이다. 도 5a에 도시된 실시예에서, 생산 라인들은 병렬로 동작된다. 배치 프로세스는, 시간순 순서로 배열되고 생산 프로세스와 직접 관련될 수 있는 처리 유닛들을 포함할 수 있다. 프로세스 체인은 다수의 배치 프로세스들을 포함할 수 있다. 배치 프로세스는, 생성물 의 적어도 하나의 특성을 제어하도록 구성될 수 있다. 배치 프로세스는, 적어도 하나의 기계적 및/또는 적어도 하나의 열적 및/또는 적어도 하나의 화학적 프로세스를 포함할 수 있다. 배치 프로세스는, 압출, 공급 혼합, 발포(blowing), 착색 중 하나 이상을 포함하는, 마감 동작들로 또한 표시되는 처리 유닛 동작들 을 포함할 수 있다. 생산 플랜트는, 적어도 하나의 압출기, 적어도 하나의 주입기(injector), 적어 도 하나의 천공 판, 오토클레이브(autoclave)로 이루어진 그룹으로부터 선택되는 적어도 하나의 유닛을 포 함할 수 있다. 도 5a에 도시된 바와 같이, 프로세스 체인, 특히, 생산 라인들 각각은, \"유닛 1\" 내 지 \"유닛 n\"으로 표시된 n개의 유닛을 포함할 수 있으며, n은 양의 정수이다. 프로세스 체인은 적어도 하나의 연속적 프로세스를 포함할 수 있다. 프로세스 체인은, 배치 프 로세스들 및 연속적 프로세스들을 포함할 수 있다. 프로세스 체인은, 반-연속적 및/또는 반-배 치 프로세스들을 포함할 수 있다. 예컨대, 프로세스 체인은, 적어도 하나의 연속적 프로세스 및 복 수의 배치 프로세스들을 포함할 수 있다. 생산 플랜트는, 연속적 처리 및/또는 배치 처리를 위해 구 성될 수 있다. 생산 플랜트는, 복수의 병렬의 연속적 프로세스들 및/또는 배치 프로세스들을 포함할 수 있다. 연속적 프로세스들 및/또는 배치 프로세스들은 상이한 방식들로 조합될 수 있다. 연속적 프로세스들 및 배치 프로세스들의 조합은, 적어도 하나의 기준, 이를테면, 생성물에 대한 품 질에 의존할 수 있다. 연속적 프로세스들 및 배치 프로세스들의 조합은, 품질 기준에 기반하여 프로 세스 체인을 통한 최상의 경로를 취하도록 선택될 수 있다. 부가적으로, 다른 기준들, 이를테면 주문 대 기열 등이 가능할 수 있다. b) 단계에서 결정된 동작 조건들은 최상의 경로에 관한 정보를 포함할 수 있다. 경로는, 유닛 동작들의 조합 및/또는 처리 유닛들의 조합 및/또는 특히, 생산 플랜트에서 생산 프로세스 동안 수행 및/또는 통과되는 연속적 및/또는 배치 프로세스들을 포함하는 프로세스들 또는 생산 단계들의 조합일 수 있다. 최상의 경로는, 적어도 하나의 품질 기준의 관점에서의 생산 플랜트를 통한 최적의 경로일 수 있다. 그에 따라, 최적의 경로는 구체적 으로, 적어도 하나의 품질 기준을 최대화 또는 최소화하는 복수의 가능한 경로들로부터 선택되는 경로일 수 있 다. 최상의 경로는, 표적 경로 및/또는 최종 경로 및/또는 계획된 경로일 수 있다. 예컨대, 배치 프로세스는, 품질 기준 및/또는 생산 플랜트의 작업부하에 따라, 생산 플랜트를 통한 상이한 경로들을 포함할 수 있다. 상 이한 처리 유닛 동작들은, 적어도 하나의 품질 기준의 관점에서 최적에 도달하고/거나 최적을 보장하도록 조합 될 수 있다. 도 5b는 유닛 1 내지 유닛 6의 조합이 상이한 2개의 가능한 경로 a) 및 b)를 갖는 실시예를 도시 한다. 최상의 경로는, 요망되는 화학적 생성물, 구체적으로는 그의 품질 기준에 따라 선택될 수 있다. 예컨대, 생산 플랜트는, 적어도 하나의 폴리우레탄, 더 특정하게는 하나의 TPU 및/또는 하나의 ETPU를 생 산하도록 구성되는 폴리우레탄 생산 플랜트일 수 있다. 예컨대, 도 5a에 도시된 바와 같이, 생산 플랜트는, 폴리우레탄, 특히 TPU 및/또는 ETPU의 생산을 위한 폴 리우레탄 생산 플랜트일 수 있다. TPU 및 ETPU는, 다양한 산업적 응용들, 예컨대, 발포체들, 절연 물질, 신발 밑창들, 케이스들을 위해 생산될 수 있고, 이러한 다양한 산업적 응용들에 따라, 상이한 특성들이 요구될 수 있 다. 본 출원의 의미에서, 이러한 특성들은 품질 기준들일 수 있다. ETPU는, TPU를 팽창시킴으로써 TPU로부터 생산될 수 있다. 도 5a에서, TPU 생산의 유입 예비중합체들은 원재료 및 참조 번호 524로서 표시된다. 생산 플랜트는 적어도 하나의 반응기를 포함할 수 있다. 반응기 는, 프로세스 체인의 연속적 프로세스일 수 있거나 그 일부일 수 있다. 반응기는, TPU를 생산 하기 위한 중합 프로세스를 위한 반응기일 수 있다. 도 5a의 참조 번호 528은 TPU를 표시하고, 적어도 하나의 배치 프로세스에서 추가로 처리되어, 도 5a에서 참조 번호 538로서 표시되는 완성된 생성물이 생산될 수 있다. 예컨대, TPU는 컨테이터들 내로 공급될 수 있고, 그 후, 요망되는 그리고/또는 계획된 그리고/또는 원하는 완성된 생성물의 요건들에 따라 상이한 배치 프 로세스들에서 처리될 수 있다. 생산 플랜트는, 상이한 종류의 최종 생성물들을 생산하도록 구성될 수 있다. 최종 생성물들은, 다수의 생산 라인들 상에서 생산될 수 있다. 최종 생성물들은, 응용 특정 특 성들 및 품질 기준들에 의존할 수 있다. 품질 기준들은, 최종 생성물의 산업적 응용에 의해 특정될 수 있다. 품질 기준들은, 응용에 대한 적절한 기능을 보장하기 위해 정의될 수 있다. 도 5a에서 참조 번호 538로서 표시 된 완성된 최종 생성물의 특성들은, 입자 크기 분포, 형태학적 구조, 경도, 세공(pore) 크기, 및 상 조성 중 하 나 이상을 포함할 수 있다. 완성된 최종 생성물, 즉, 프로세스 체인의 결과의 특성들은, 후속 처리 유닛 동작들에 의해 제어될 수 있다. TPU 특성들은, 기계적 및/또는 열적 및/또는 화학적 프로세스들에 의해 개질될 수 있다. TPU는, 후속 용융 프로세스에서 용융이 더 균일하게 이루어질 수 있도록 밀링될 수 있다. 혼합은, 더 큰 배치들을 균질화하는 것을 포함할 수 있다. 체질은, 입자 크기 분포의 미세 조정을 포함할 수 있다. 특 성들의 후속 조정은, 많은 기업 노하우 및/또는 수동 배치 조작들을 요구할 수 있다. 비-제한적인 예로서, \"TPU\"는, 프로세스에서, 예컨대, 업스트림 생산 프로세스 및 다음의 형태의 투입 (input) 물질을 사용하여 업스트림 산업적 플랜트에서 생산될 수 있다: 이소시아네이트: 4,4'-메틸렌 디페닐 디이소시아네이트(MDI) 체인 연장제(Chain extender): 1,4-부탄디올 폴리올: 폴리 테트라히드로푸란(폴리THF) 추가적인 첨가제들, 이를테면, 촉매들, 안정화제들, 및/또는 항산화제들이 업스트림 산업적 프로세스의 상세사 항들에 따라 부가될 수 있다. TPU 및/또는 ETPU를 생산하기 위한 임의의 다른 적합한 프로세스가 사용될 수 있 다. TPU 생산은, 48D(12개의 하우징)의 프로세스 길이를 갖는 코페리온(Coperion) 사의 이축 스크류(twin-screw) 압 출기 ZSK58 MC에서 수행하는 것을 수반할 수 있다. 압출기로부터의 용융물(중합체 용융물)의 배출은 기어 펌프 에 의하여 수행될 수 있다. 용융 필터처리 후에, 중합체 용융물은, 40 - 90 ℃의 가열 와류층(vortex bed)에서 지속적으로 건조될 수 있는 수중 과립화에 의하여 과립들로 처리될 수 있다. 폴리올, 체인 연장제, 및 디이소 시아네이트뿐만 아니라 촉매가 제1 구역 내로 투입될 수 있다. 위에 설명된 바와 같은 추가적인 첨가제들의 부 가는 구역 8에서 발생한다. 하우징 온도는 범위가 150 내지 230 ℃이다. 용융 및 수중 과립화는 210 - 230 ℃ 의 용융 온도들로 수행될 수 있다. 스크류 속도는 180 내지 240 rpm일 수 있다. 처리량은 범위가 180 내지 220 kg/h일 수 있다. TPU 생산에 대해 이러한 예에서 나타낸 것 이외의 부가적인 생산 단계들이 존재하거나 존 재하지 않을 수 있다. ETPU의 생산를 위한 배치 또는 반-배치 프로세스들의 예들은 다음과 같을 수 있다. 추가적인 비-제한적인 예로서, ETPU 생산, 또는 TPU로부터의 팽창된 입자들(발포된 과립들)의 생산은, 44 mm의 스크류 직경 및 42의 길이 대 직경 비를 갖는 이축 스크류 압출기가, 후속 용융 펌프, 스크린 교환기를 갖는 시 동 밸브, 천공 판, 및 수중 과립화와 함께 사용되는 것을 수반할 수 있다. 열가소성 폴리우레탄은 0.02 wt.% 미만의 잔류 수분을 획득하기 위해 80 ℃에서 3시간 동안 처리하기 전에 건조된다. 사용된 TPU는, 중량 투입 디바이스를 통해 이축 스크류 압출기의 공급물 내로 투입될 수 있다. 물질들을 이축 스크류 압출기의 공급물 내로 투입한 후에, 물질들은 용융되고 혼합될 수 있다. 후속하여, 추진제들 CO2 및 N2는 각각 하나의 주입기를 통해 부가될 수 있다. 나머지 압출기 길이는, 중합체 용융물 내로의 추진제의 균질 혼입에 사용될 수 있다. 압출기 후에, 중합체/추진제 혼합물은, 천공 판 내로 스크린 교환기를 갖는 시동 밸브를 통해 기어 펌프에 의하 여 천공 판 내로 가압될 수 있다. 천공 판을 통해, 개별 스트랜드들이 생산될 수 있다. 이러한 스트랜드들은 수중 과립화 유닛의 가압 절단 챔버로 운반될 수 있으며, 여기서, 스트랜드들은 과립들로 절단되고, 추가로, 과 립들이 팽창되는 동안 용수(water)와 함께 수송될 수 있다. 프로세스 용수로부터의 팽창된 입자들 또는 과립들 의 분리는 원심 건조기에 의하여 행해질 수 있다. 압출기, 중합체들, 및 추진제들의 총 처리량은 40 kg/h일 수 있다. 원심 건조기에 의한 용수로부터의 팽창된 과립들의 분리 후에, 팽창된 과립들은, 입자들의 추가적인 분석을 왜곡시키지 않기 위해 입자 내의 가능한 수분뿐만 아니라 잔여 표면 용수를 제거하기 위해 60 ℃에서 3시 간 동안 건조될 수 있다. 이러한 프로세스에 따른 ETPU 생산은 하나의 유닛, 예컨대 유닛 1로 간주될 수 있다. 압출기에서의 처리에 부가하여, 팽창된 입자들은 또한 오토클레이브에서 생산될 수 있다. 이러한 목적을 위해, 압력 용기는 고체/액체 상으로 80 %의 충전도로 충전될 수 있으며, 여기서, 상 비는 0.32이다. 여기서, 고체 상은 TPU이고, 액체 상은 용수와 탄산칼슘 및 표면-활성 물질의 혼합물이다. 이러한 고체/액체 상에 압력을 가 하면, 사전에 질소로 헹궈진 밀폐식 압력 용기 내로 발포제/추진제(부탄)가 가압될 수 있다. 압력 용기는 고체 /액체 상을 50 ℃의 온도에서 교반함으로써 가열될 수 있고, 이어서, 질소가 8 bar의 압력까지 압력 용기 내로 가압될 수 있다. 후속하여, 요망되는 함침 온도에 도달할 때까지 추가적인 가열이 수행될 수 있다. 함침 온도 및 함침 압력에 도달할 때, 주어진 유지 시간 후에 밸브를 통해 압력 용기가 이완될 수 있다. 이러한 프로세스 에 따른 ETPU 생산은 하나의 유닛, 예컨대 유닛 2로 간주될 수 있다. ETPU 생산에 대해 이러한 예에서 나타낸 것 이외의 부가적인 생산 단계들이 존재하거나 존재하지 않을 수 있다. TPU 생산 프로세스 및/또는 ETPU 생산 프로세스들은 위의 대표적인 예들에서 나타낸 것과 동일할 수 있거나 동"}
{"patent_id": "10-2022-7024591", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "일하지 않을 수 있다. 관련 기술분야의 통상의 기술자들은, 특정 생산 프로세스가 본 교시들의 범위 또는 일반 성을 제한하지 않는다는 것을 인식할 것이다. TPU는 상이한 유닛으로 나타낸 추가적인 배치 프로세스에서 안료들로 착색될 수 있다. 도 1을 다시 참조하면, 방법은 다음의 단계들을 포함한다: a) 적어도 하나의, 입력 데이터를 결정하는 단계(참조 번호 132로 표시됨) ― 입력 데이터는 적어도 하나의 품 질 기준 및 생산 플랜트 레이아웃 데이터를 포함하고, 이 단계는, 적어도 하나의 통신 인터페이스를 통해, 생산 플랜트 레이아웃 데이터를 리트리브하고 품질 기준에 관한 정보를 수신하는 단계를 포함함 ―; b) 적어도 하나의 예측 단계(참조 번호 134로 표시됨) ― 예측 단계에서, 입력 데이터에 대해 적어도 하나의 훈 련된 모델을 적용함으로써, 생산 플랜트를 동작시키기 위한 동작 조건들이 결정되고, 훈련된 모델 은, 이력 생산 실행들로부터의 센서 데이터에 대해 훈련됨으로써 적어도 부분적으로 데이터 주도됨 ―; c) 동작 조건들이 제공되는 적어도 하나의 제어 및/또는 모니터링 단계(참조 번호 140으로 표시됨). 품질 기준은 응용 의존적 품질 기준일 수 있다. 품질 기준은, 입자 크기 분포, 형태학적 구조, 경도, 세공 크 기, 및 상 조성 중 하나 이상을 포함할 수 있다. 품질 기준은 적어도 하나의 고객 규격을 포함할 수 있다. 고 객 규격은, 적어도 하나의 품질 파라미터에 대한 적어도 하나의 범위를 포함할 수 있다. 품질 파라미터에 기반 하여, 고객 가치 체인을 따른 추가적인 처리가 수행될 수 있다. 훈련된 모델에는, 품질 기준들에 관한 입 력 데이터, 특히, 입력 파라미터들이 공급될 수 있다. 입력 파라미터들 중 일부는 고객에 의해 제공될 수 있다. 고객 입력에 기반하여 다른 것들이 결정될 수 있다. 예컨대, 고객은, 산업적 응용 및 그러한 응용과 관 련된 규격들을 특정할 수 있다. 생성물 특성들에 관한 부가적인 입력 파라미터들이 데이터베이스로부터 계산되 거나 리트리브될 수 있다. 생산 플랜트에 관한 정보는, 생산 플랜트의 설계 및/또는 상태, 이를테면, 동작 중, 유지보수 중, 유지보 수 계획됨, 현재 동작 상태, 예컨대 열화 상태에 관한 정보일 수 있다. 설계는, 당면한 물리적 반응기 설계를 특정하는 파라미터들, 이를테면, 반응기 기하학적 구조, 반응기들의 수, 플랜트 레이아웃, 이를테면 연속적 프 로세스 또는 배치 프로세스를 포함할 수 있다. 생산 플랜트 레이아웃 데이터는 실시간 데이터를 포함할 수 있 다. 실시간 데이터는, 생산 플랜트의 현재 상태에 관한 정보를 포함할 수 있다. 생산 플랜트 레이아웃 데이터 는 미리 정의된 레이아웃 파라미터들을 포함할 수 있다. 미리 정의된 레이아웃 파라미터들은, 통신 인터페이스 를 통해 적어도 하나의 데이터베이스로부터 리트리브될 수 있다. 데이터베이스는, 정보가 저장된 적어도 하나 의 데이터 저장 디바이스를 포함할 수 있다. 특히, 데이터베이스는 정보의 임의적 집합을 포함할 수 있다. 데 이터베이스는, 적어도 하나의 서버, 복수의 서버들을 포함하는 적어도 하나의 서버 시스템, 적어도 하나의 클라 우드 서버, 또는 클라우드 컴퓨팅 기반구조로 이루어진 그룹으로부터 선택되는 적어도 하나의 데이터베이스일 수 있거나 이를 포함할 수 있다. 데이터베이스는, 데이터를 저장하도록 구성되는 적어도 하나의 저장 유닛을 포함할 수 있다. 예측은, 특히, 품질 기준을 충족시키기 위한 적어도 하나의 동작 조건의 예상 값일 수 있다. 훈련된 모델(13 6)은, 요구되는 응용 특정 생성물 특성들을 산출하는 최적의 생산 프로세스 조건들을 예측하도록 구성될 수 있 다.동작 조건들은, 연속적 처리 유닛들에 대한 동작 조건들, 이를테면, 체적 또는 질량 유량들, 유입 조성, 유입 온도, 농도들, 압력, 반응기 벽 온도들, 반응기 기하학적 구조, 반응기 크기 중 하나 이상을 포함할 수 있다. 동작 조건들은, 배치 처리 유닛들에 대한 동작 조건들, 이를테면, 체류 시간, 압력, 체적 또는 질량 유량들, 유 입 조성, 유입 온도, 농도들, 벽 온도들, 투입 레시피, 반응기 기하학적 구조, 반응기 크기 중 하나 이상을 포 함할 수 있다. 훈련된 모델은, 이력 생산 실행들로부터의 센서 데이터에 대해 훈련됨으로써 적어도 부분적으로 데이터 주 도된다. 구체적으로, 데이터 주도 모델은 실험적 데이터의 분석으로부터 도출된다. 데이터 주도 모델은 기계 학습 툴일 수 있다. 훈련된 모델은, 프로세스 제어, 물리적 반응기 설계, 플랜트 레이아웃, 및 생산 실행 들로부터의 데이터와 연관된 생산된 폴리우레탄의 품질 기준들 중 하나 이상을 포함하는 이력 데이터로 훈련될 수 있다. 센서 데이터는, 적어도 하나의 온도 센서, 체적 또는 질량 유량 센서, 압력 센서, 입자 카운트 센서, 중량 센서로부터의 데이터를 포함할 수 있다. 훈련된 모델은 하이브리드 모델일 수 있다. 도 3은 본 발명에 따른 훈련된 모델의 실시예를 도시한 다. 하이브리드 모델은, 제1 원리 부분들, 소위 화이트 박스뿐만 아니라 데이터 주도 부분들, 소위 블랙 박스 를 포함하는 모델을 지칭할 수 있는데, 예컨대, 문헌 [review paper of Moritz von Stoch et al.: \"Hybrid semi-parametric modeling in process systems engineering: Past, present and future\", 2014, Computers & Chemical Engineering, pergamon press, Oxford, GB, vol. 60, 31 August 2013, pages 86 to 101 XP028792356, ISSN: 0098-1354, DOI: 10.1016/J.COMPCHEMENG.2013.08.008]을 참조한다. 훈련된 모델은, 화이트 박스 모델 및 블랙 박스 모델의 조합을 포함할 수 있다. 화이트 박스 모델은 물리-화학 적 법칙들에 기반할 수 있다. 물리-화학적 법칙들은, 화학 동역학, 질량, 운동량, 및 에너지 보존 법칙들, 임 의적 차원에서의 입자 개체군 중 하나 이상을 포함할 수 있다. 화이트 박스 모델은, 개개의 프로세스 단계를 지배하는 물리-화학적 법칙들에 따라 선택될 수 있다. 블랙 박스 모델은, 이력 생산 실행들로부터의 센서 데이터에 기반할 수 있다. 블랙 박스 모델은, 기계 학습, 심층 학습, 신경망들, 또는 다른 형태의 인공 지능 중 하나 이상을 사용함으로써 구축될 수 있다. 블랙 박스 모델은, 훈련과 테스트 데이터 사이의 양 호한 적합도를 산출하는 임의의 모델일 수 있다. 도 4는 훈련된 모델의 실시예의 구성을 도시한다. 특히, 데이터 주도 모델이 생성되는 실험적 데이터 및 화이트 박스 모델이 생성되는 이론적 데이터가 도시 된다. 훈련된 모델은, 직렬 또는 병렬 아키텍처를 포함할 수 있다. 직렬 아키텍처에서, 화이트 박스 모델 의 출력이 블랙 박스 모델에 대한 입력으로서 사용되거나 블랙 박스 모델의 출력이 화이트 박스 모델에 대한 입력으로서 사용된다. 병렬 아키텍처에서, 화이트 박스 모델 및 블랙 박스 모델 의 조합된 출력이, 이를테면 출력들(146, 148)의 중첩에 의해 결정된다. 직렬 및 병렬 아키텍처의 추가적인 세부사항들에 대해, 문헌 [the review paper of Moritz von Stoch et al.: \"Hybrid semi-parametric modeling in process systems engineering: Past, present and future\", 2014, Computers & Chemical Engineering, pergamon press, Oxford, GB, vol. 60, 31 August 2013, pages 86 to 101 XP028792356, ISSN: 0098-1354, DOI: 10.1016/J.COMPCHEMENG.2013.08.008]에 대한 참조가 이루어진다. 도 3은 화이트 박스 모델 및 블랙 박스 모델의 조합된 출력이 가산으로 계산되는 직렬 아키텍처의 실시예들을 도시한다. 훈련된 모델은, 적어도 하나의 서브-모델, 특히, 복수의 서브-모델들을 포함할 수 있다. 예컨대, 서브-모 델은 화이트 박스 모델일 수 있고/거나 서브-모델들 중 적어도 하나가 화이트 박스 모델일 수 있다. 훈련된 모 델은, 이를테면, 생산 단계들 중 적어도 하나에 대한 그리고/또는 프로세스 단계들 중 적어도 하나에 대한 그리고/또는 적어도 하나의 생산 라인에 대한 복수의 서브-모델들을 포함할 수 있으며, 이들은 화이트 박 스 모델들이거나, 하이브리드 모델들 또는 순수 데이터 주도 모델들이다. 각각의 서브-모델은, 동작 조건들을 예측하는 것 또는 동작 조건들을 예측하는 다른 서브-모델들에 입력을 제공하는 것을 담당할 수 있다. 훈련된 모델은, 실제 생산 프로세스에서 직접 제어가능한, 제어가능한 파라미터들을 예측하도록 구축된다. 그러 한 파라미터들은, 생산 플랜트 레이아웃 파일의 메타 데이터를 통해 플래그 지정될 수 있다. 생산 플랜트에 의한 생산은 복수의 생산 단계들을 포함할 수 있다. 훈련된 모델은, 단일 생산 단계 또는 생산 단계들의 그룹을 표현할 수 있다. 훈련된 모델은, 단일 생산 단계에 대한 또는 생산 단계들의 그룹에 대한 동작 조건들을 예측하도록 구성된다. 이상적으로, 각각의 제어가능한 요소를 포함하는 전체 프로 세스 체인이 예측될 수 있다. 훈련된 모델은, 단일 생산 라인 또는 생산 라인들의 그룹에 대한 동작 조건들을 예측하도록 구성될 수 있다. 예컨대, 생산 라인은, 적어도 하나의 반응기 및 적어도 하나의 처리 유닛을 포함할 수 있다. 훈련된 모델은, 반응기 및/또는 고체 처리 유닛들에 대한동작 조건들을 예측하도록 구성될 수 있다. 위에 약술된 바와 같이, 프로세스 체인은, 연속적 및 배치 프로세스들의 임의적 조합들을 포함할 수 있다. 훈련된 모델은, 품질 기준을 달성하기 위해 처리 체인을 통한 최상의 경로에 관한 동작 조건들을 제 공하도록 구성될 수 있다. 부가적으로, 처리 체인을 통한 최상의 경로를 결정하기 위한 다른 기준들, 이를테면 순서 대기열 등이 고려될 수 있다. 훈련된 모델은, 반응기 상에서의 폴리우레탄 생산과 같은 생산 프로세 스의 일부 또는 연속적 프로세스를 포함하고/거나 커버할 수 있다. 부가적으로, 최종 생성물로 이어지는 미가공 생성물을 완성하기 위한 배치 프로세스는 훈련된 모델에 포함될 수 있다. 이러한 마감 동작 들은, 예컨대, TPU들을 팽창시키는 것, 밀링하는 것을 포함할 수 있다. 훈련된 모델은, 프로세스 체인 의 각각의 배치 프로세스에 관한 유닛 동작들을 포함할 수 있다. 유닛 동작들은, 산업적 응용 및 개개의 생성물 특성들에 따라, 미리 정의된 조합 세트로서 훈련된 모델에 포함될 수 있다. 구체 적으로, 배치 프로세스는, 그러한 경우에 중간 품질 기준을 제공할 수 있는 생산 프로세스의 일부 또는 연 속적 프로세스를 커버하는 훈련된 모델의 출력에 기반하여 모델링될 수 있다. 모든 각각의 배치 프 로세스 또는 경로는 자신 고유의 모델을 가질 수 있다. 각각의 유닛 동작 조합에 대해, 모델은, 입 력 데이터, 특히 고객의 입력에 따라 예측하도록 훈련되고 선택될 수 있다. 훈련된 모델은, 프로세스 체인을 통한 미리 정의된 경로에 대한 모델을 포함할 수 있다. 예컨대, 특 히 TPU 및/ ETPU 생산에 대해, 훈련된 모델은, 반응기 및 미리 정의된 유닛 동작들에 관한 모델 부분들을 포함할 수 있다. 예컨대, 동작 조건들이 결정되는 매칭 또는 적합 경로가 품질 기준에 기반하여 선택되는 복수 의 상이한 미리 정의된 경로들이 존재할 수 있다. 프로세스 체인을 통한 미리 정의된 경로에 대해 대안적 으로, 적어도 하나의 최적화 문제가 목적 함수에 기반하여 정의될 수 있다. 예컨대, 최적의 동작 조건들 및 연 속적 프로세스 및 배치 프로세스의 최적의 조합을 찾기 위해 그래프 이론이 사용될 수 있다. 그에 따라, 최상의 경로들이 훈련될 수 있고, 동작 조건들에 부가하여 예측될 수 있다. 예컨대, 배치 프로세스(51 4)는, 품질 기준 및/또는 생산 플랜트의 작업부하에 따라, 생산 플랜트를 통한 상이한 경로들을 포함 할 수 있다. 예컨대, 도 5a의 생산 라인들에 대해, 유닛 동작들 및 유닛들은, 적어도 하나의 품질 기준의 관점에서 최적에 도달하고/거나 최적을 보장하는 것이 가능하도록 조합될 수 있다. 도 5a에 추가로 도시된 바와 같이, 생산 플랜트는 제어 시스템에 의해 제어될 수 있다. 제어 시스템 은, 입력 데이터의 결정을 위해 구성되는 적어도 하나의 통신 인터페이스를 포함한다. 통신 인터페 이스는, 생산 플랜트 레이아웃 데이터를 리트리브하고 품질 기준에 관한 정보를 수신하도록 구성된다. 제 어 시스템은, 입력 데이터에 대해 적어도 하나의 훈련된 모델을 적용함으로써 생산 플랜트를 동 작시키기 위한 동작 조건들을 결정하도록 구성되는 적어도 하나의 예측 유닛을 포함한다. 제어 시스템 은, 동작 조건들을 제공하도록 구성되는 적어도 하나의 출력 디바이스를 포함한다. 생산 플랜트는 결정된 동작 조건들에 따라 제어될 수 있다. 각각의 제어가능한 요소에 대한 동작 조건들 이 제공될 수 있다. 훈련된 모델은, 실제 생산 프로세스에서 직접 제어가능한, 제어가능한 파라미터들을 예측하도록 구성될 수 있다. 그러한 파라미터들은, 생산 플랜트 레이아웃 파일의 메타 데이터를 통해 플래그 지정될 수 있다. 특히, 폴리우레탄 생산 프로세스의 반응기는, 최적의 결과에 도달하도록, 제공된 동작 조건들에 따라 제어될 수 있다. 방법은, 결정된 동작 조건들에 기반하여 생산 플랜트의 실행들에 대한 생산 계획을 결정하는 단계를 포함 할 수 있다. 방법은, 제어 시스템 및/또는 스케줄러를 제어하는 것에 의해, 그리고 특히, 최적의 생산 계 획에 의해 생산 플랜트를 제어하는 것을 허용할 수 있다. 일단 고객이 요망되는 규격을 포함하여 주문을 하면, 훈련된 모델을 이용하여 최적의 동작 조건들이 결정될 수 있다. 전체 생산 계획이 제어 시스템에 의 해 평가될 수 있고/거나 스케줄러에 전달될 수 있으며, 제어 시스템 및/또는 스케줄러는, 예컨대, 품질 기준들, 반응기 할당, 동작 조건들, 원재료의 프라이즈들, 긴급성들, 배치 크기들 등에서의 유사성에 기반하여 착신 생 산 실행들을 순위화할 수 있다. 부가적으로, 제어 시스템 및/또는 스케줄러는, 최종 생산 배치들을 픽업 하고 그들을 고객의 위치로 수송하기 위해, 요구되는 수송 터미널들이 현장에 있도록 촉발하는 물류유통을 위해 수송 계획 시스템과 통신할 수 있다. 부가적으로, 제어 시스템 및/또는 스케줄러는, 완전히 디지털화된 생산 계획에 기반하여 재고 수준들을 예상하기 위해 사용될 수 있다. 참조 번호들의 목록 110 생산 플랜트 112 프로세스 체인 114 배치 프로세스 116 생산 라인 118 유닛 동작들 120 유닛 122 연속적 프로세스 124 원재료 126 반응기 128 미가공 분말 132 입력 데이터의 결정 134 예측 단계 136 훈련된 모델 138 완성된 분말 140 제어 및 모니터링 단계 142 화이트 박스 모델 144 블랙 박스 모델 146 출력 148 출력 150 조합된 출력 152 실험적 데이터 154 이론적 데이터 156 제어 시스템 158 통신 인터페이스 160 예측 유닛 162 출력 디바이스 도면 도면1 도면2a 도면2b 도면3 도면4 도면5a 도면5b"}
{"patent_id": "10-2022-7024591", "section": "도면", "subsection": "도면설명", "item": 1, "content": "실시예들의 후속하는 설명에서, 바람직하게는 종속항들과 함께, 추가적인 임의적 특징들 및 실시예들이 더 상세 히 개시될 것이다. 여기서, 개개의 임의적 특징들은, 통상의 기술자가 인식할 바와 같이, 격리된 방식으로 뿐 만 아니라 임의의 임의적인 실현가능한 조합으로 실현될 수 있다. 본 발명의 범위는 바람직한 실시예들에 의해 제한되지 않는다. 도면들에서 실시예들이 개략적으로 도시된다. 여기서, 이러한 도면들에서의 동일한 참조 번 호들은 동일하거나 기능적으로 필적하는 요소들을 지칭한다. 도면들에서: 도 1은 본 발명에 따른 예시적인 방법의 실시예를 도시한다. 도 2a 및 도 2b는 생산 플랜트의 실시예들을 도시한다. 도 3은 본 발명에 따른 훈련된 모델의 실시예를 도시한다. 도 4는 훈련된 모델의 구성을 도시한다. 도 5a 및 도 5b는 생산 플랜트의 실시예들에 대해 도시한다."}
