{"patent_id": "10-2022-7009911", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0054633", "출원번호": "10-2022-7009911", "발명의 명칭": "동작 모드 레지스터", "출원인": "마이크론 테크놀로지, 인크.", "발명자": "트로이아, 알베르토"}}
{"patent_id": "10-2022-7009911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "장치로서,메모리 어레이, 및상기 메모리 어레이에 연결된 제어기 - 상기 제어기는 모드 레지스터 쓰기 커맨드를 수신하고, 상기 장치가 정상 동작 모드에 비해 감소된 전력 소비량을 갖는 동작 모드를 나타내는 값을 쓰도록구성된 레지스터를 포함함 - 를 포함하는, 장치."}
{"patent_id": "10-2022-7009911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 레지스터는 상기 장치가 정상 동작 모드에 비해 감소된 전력 소비량을 갖는 감소된 전력소비 모드에 있을 때 장치의 동작 모드를 수정하기 위한 모드 레지스터 쓰기 커맨드를 수용하기만 하는, 장치."}
{"patent_id": "10-2022-7009911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상이한 모드 레지스터 쓰기 커맨드가 장치의 동작 모드를 감소된 전력 소비 모드에 비해 증가된 전력 소비량을 갖는 증가된 전력 소비 모드로 수정하기 위한 것인, 장치."}
{"patent_id": "10-2022-7009911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서, 감소된 전력 소비 모드는 장치가 리프레시 동작을 수행하지 못하게 디세이블(disable)하는, 장치."}
{"patent_id": "10-2022-7009911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항 또는 제2항에 있어서, 메모리 어레이에 저장된 데이터를 이용해 인공 지능 동작을 수행하도록 구성된 인공 지능(AI) 가속기를 더 포함하는, 장치."}
{"patent_id": "10-2022-7009911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "시스템으로서,메모리 시스템 제어기,상기 메모리 시스템 제어기에 연결된 제1 메모리 디바이스 - 상기 제1 메모리 디바이스는 제1 메모리 어레이를포함하고 제1 메모리 디바이스 제어기는 메모리 시스템 제어기로부터 제1 모드 레지스터 쓰기 커맨드를 수신하고, 그리고,상기 제1 메모리 디바이스의 제1 모드 레지스터를 제1 메모리 디바이스가 정상 동작 모드에 비해 감소된 전력소비량을 갖는 동작 모드를 나타내는 값으로 쓰도록 구성됨 - , 및메모리 시스템 제어기에 연결된 제2 메모리 디바이스 - 상기 제2 메모리 디바이스는 제2 메모리 어레이를 포함하고 제2 메모리 디바이스 제어기는상기 메모리 시스템 제어기로부터 제2 모드 레지스터 쓰기 커맨드를 수신하고,제2 메모리 디바이스의 제2 모드 레지스터를 인공 지능(AI) 동작을 수행하는 것을 나타내는 값으로 쓰도록 구성됨 - 를 포함하는, 시스템."}
{"patent_id": "10-2022-7009911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2022-0054633-3-제6항에 있어서, 제2 메모리 디바이스는 제2 메모리 어레이 내 AI 동작의 입력의 위치를 식별하는 제3 레지스터를 포함하는, 시스템."}
{"patent_id": "10-2022-7009911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항 또는 제7항에 있어서, 제2 메모리 디바이스는 제2 메모리 어레이 내 AI 동작의 출력의 위치를 식별하는제4 레지스터를 포함하는, 시스템."}
{"patent_id": "10-2022-7009911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제6항 또는 제7항에 있어서, 제2 메모리 디바이스는 AI 동작의 상태를 식별하는 제5 레지스터를 포함하는, 시스템."}
{"patent_id": "10-2022-7009911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "방법으로서,메모리 시스템 제어기로부터 메모리 디바이스에서 모드 레지스터 쓰기 커맨드를 수신하는 단계,메모리 디바이스의 모드 레지스터를 메모리 디바이스가 정상 동작 모드에 비해 감소된 전력 소비량을 갖는 동작모드를 나타내는 값으로 쓰는 단계, 및모드 레지스터에 써진 값에 적어도 부분적으로 기초하여 메모리 디바이스의 하나 이상의 구성요소로부터 전력공급을 제거하는 단계를 포함하는, 방법."}
{"patent_id": "10-2022-7009911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서, 메모리 디바이스의 커맨드/주소 버스로의 전력 공급을 유지하는 단계, 및메모리 디바이스의 타 구성요소로부터 전력 공급을 제거하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2022-7009911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항에 있어서,모드 레지스터에 써진 값에 적어도 부분적으로 기초하여 하나 이상의 DRAM 또는 메모리 디바이스로부터 데이터를 상기 메모리 디바이스에 연결된 비휘발성 메모리 어레이로 전송하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2022-7009911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제10항 내지 제12항 중 어느 한 항에 있어서,메모리 시스템 제어기로부터 메모리 디바이스에 상이한 모드 레지스터 쓰기 커맨드를 수신하는 단계,메모리 디바이스의 모드 레지스터를 정상 동작 모드를 나타내는 상이한 값으로 쓰는 단계, 및상기 모드 레지스터에 써진 상이한 값에 적어도 부분적으로 기초하여 메모리 디바이스의 하나 이상의 구성요소로의 전력 공급을 복구하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2022-7009911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제10항 내지 제12항 중 어느 한 항에 있어서,모드 레지스터에 써진 값에 적어도 부분적으로 기초하여 메모리 디바이스에 연결된 비휘발성 메모리 어레이로부터 메모리 디바이스의 DRAM으로 데이터를 전송하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2022-7009911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "방법으로서,제어기로부터 제1 모드 레지스터 쓰기 커맨드 및 제2 모드 레지스터 쓰기 커맨드를 전송하는 단계, 제1 메모리 디바이스가 제1 모드 레지스터 쓰기 커맨드를 수신하는 것에 응답하여, 제1 메모리 디바이스의 제1공개특허 10-2022-0054633-4-모드 레지스터를 제1 메모리 디바이스가 정상 동작 모드에 비해 감소된 전력 소비량을 갖는 동작 모드를 나타내는 값으로 쓰는 단계, 및제2 메모리 디바이스가 제2 모드 레지스터 쓰기 커맨드를 수신하는 것에 응답하여, 제2 메모리 디바이스의 제2모드 레지스터를 제2 메모리 디바이스에서 인공 지능(AI) 동작을 수행하는 것을 나타내는 값으로 쓰는 단계를포함하는, 방법."}
{"patent_id": "10-2022-7009911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서, 제1 메모리 디바이스의 제1 모드 레지스터를 쓰기 전에, 제1 메모리 디바이스의 제3 모드 레지스터를 데이터를 제1 메모리 디바이스에서 제3 메모리 디바이스로 전송하는 것을 나타내는 값으로 쓰는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2022-7009911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제15항 또는 제16항에 있어서, 제2 메모리 디바이스의 제2 모드 레지스터를 쓰기 전에, 제1 메모리 디바이스의제4 모드 레지스터를 제4 메모리 디바이스로부터 제2 메모리 디바이스로 인공 지능(AI) 데이터를 전송하는 것을나타내는 값으로 쓰는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2022-7009911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제15항 또는 제16항에 있어서, 제2 메모리 디바이스의 제5 모드 레지스터를 AI 동작의 결과를 제어기로 전송하는 것을 나타내는 값으로 쓰는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2022-7009911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제15항에 있어서, 제어기로부터 제1 메모리 디바이스에서 제3 모드 레지스터 쓰기 커맨드를 수신하는 단계를 더포함하는, 방법."}
{"patent_id": "10-2022-7009911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서, 제2 메모리 디바이스가 AI 동작을 완료하는 것에 응답하여 상기 제어기로부터 제1 메모리 디바이스에서 제3 모드 레지스터 쓰기 커맨드를 수신하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2022-7009911", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시 내용은 메모리에서의 동작 모드를 수정하는 것과 관련된 장치 및 방법을 포함한다. 예시적인 장치는 메 모리 어레이 및 메모리 어레이에 연결된 제어기를 포함할 수 있고, 제어기는 모드 레지스터 쓰기 커맨드를 수신 하고 장치가 정상 동작 모드에 비해 감소된 전력 소비를 갖는 동작 모드를 나타내는 값을 쓰도록 구성된 레지스 터를 포함한다."}
{"patent_id": "10-2022-7009911", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시 내용은 일반적으로 메모리 디바이스와 관련되며, 더 구체적으로, 메모리에서의 동작 모드를 수정하기 위한 장치 및 방법과 관련된다."}
{"patent_id": "10-2022-7009911", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "메모리 디바이스는 일반적으로 컴퓨터 또는 그 밖의 다른 전자 디바이스의 내부, 반도체, 집적 회로로서 제공된 다. 여러 다른 유형의 메모리, 가령, 휘발성 및 비휘발성 메모리가 존재한다. 휘발성 메모리는 이의 데이터를 유지하기 위해 전력을 필요로 할 수 있으며 랜덤-액세스 메모리(RAM: random-access memory), 동적 랜덤 액세스 메모리(DRAM: dynamic random access memory), 및 동기식 동적 랜덤 액세스 메모리(SDRAM: synchronous dynamic random access memory) 등을 포함한다. 비휘발성 메모리는 전력이 공급되지 않을 때 저장된 데이터를 보유함으로써 영속 데이터를 제공할 수 있으며 예시로서 NAND 플래시 메모리, NOR 플래시 메모리, 리드 온리 메 모리(ROM: read only memory), 전기 소거 가능 프로그램 가능 ROM(EEPROM: Electrically Erasable Programmable ROM), 소거 가능 프로그램 가능 ROM(EPROM: Erasable Programmable ROM), 및 저항 가변 메모리, 가령, 상 변화 랜덤 액세스 메모리(PCRAM: phase change random access memory), 저항 랜덤 액세스 메모리 (RRAM: resistive random access memory), 및 자기저항 랜덤 액세스 메모리(MRAM: magnetoresistive random access memory) 등을 포함할 수 있다. 메모리는 다양한 전자 응용분야에서 휘발성 및 비휘발성 데이터 스토리지로서도 사용된다. 비휘발성 메모리는, 예를 들어, 개인 컴퓨터, 휴대용 메모리 스틱, 디지털 카메라, 셀룰러 전화기, 휴대용 음악 플레이어, 가령, MP3 플레이어, 영화 플레이어 및 그 밖의 다른 전자 디바이스에서 사용될 수 있다. 메모리 셀은 어레이로 배열될 수 있으며, 이때 어레이는 메모리 디바이스에서 사용된다."}
{"patent_id": "10-2022-7009911", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시 내용은 메모리에서의 동작 모드를 수정하는 것과 관련된 장치 및 방법을 포함한다. 메모리 디바이스에 대한 동작 모드는 메모리 디바이스가 리프레시(refresh) 동작을 수행하지 않고 메모리 디바이스의 커맨드 인터 페이스(command interface)가 메모리 디바이스를 증가된 전력 소비 모드(예를 들어, 정상 작동 모드)로 두라는 커맨드만 수락하는 감소 전력 소비 모드를 포함할 수 있다. 예시적인 장치는 메모리 어레이 및 메모리 어레이에 연결된 제어기를 포함할 수 있고, 제어기는 모드 레지스터 쓰기 커맨드를 수신하고 장치가 정상 동작 모드에 비 해 감소된 전력 소비를 갖는 동작 모드를 나타내는 값을 쓰도록 구성된 레지스터를 포함한다. 종종 인공 지능(AI) 시스템은 한 번에 여러 메모리 구성요소를 액세스하는데, 이는 전력 소비량을 증가시킬 수 있다. 메모리 디바이스의 동작 모드를 감소된 전력 소비 모드로 수정함으로써, 메모리 디바이스의 전력 소비가 감소될 수 있고 인공 지능 시스템을 포함하는 시스템의 전체 전력 소비가 감소될 수 있다. 동작 모드를 수정하는 것은 모드 레지스터 쓰기 커맨드를 수신하는 것에 응답하여 동작 모드를 나타내는 값을 제어기 상의 레지스터에 씀으로써 메모리 디바이스의 전력 소비를 감소 및/또는 증가시키는 것을 포함할 수 있 다. 제어기는 인공 지능 동작을 수행하는 것을 나타내는 값으로 써질 수 있는 상이한 레지스터를 더 포함할 수 있다. 인공 지능(AI) 가속기는 메모리 어레이에 저장된 데이터를 사용하여 인공 지능 동작을 수행할 수 있다. 본 개시내용의 다음의 상세한 설명에서, 본 개시내용의 일부를 형성하고 본 개시 내용의 다수의 실시예가 어떻 게 실시될 수 있는지를 예시적으로 나타내는 첨부 도면이 참조된다. 이들 실시예는 해당 분야의 통상의 기술자 가 본 개시 내용의 실시예를 실시할 수 있기에 충분히 상세하게 기재되어 있으며, 그 밖의 다른 실시예가 사용 될 수 있고, 프로세스, 전기, 및/또는 구조적 변화가 본 개시 내용의 범위 내에서 이뤄질 수 있음이 이해될 것 이다. 본 명세서에서 사용될 때, 지시자 \"N\"은 그렇게 지시된 다수의 특정 특징부가 본 개시 내용의 다수의 실 시예에 포함될 수 있음을 나타낸다. 본 명세서에서 사용될 때, \"다수의(a number of)\" 무엇은 하나 이상의 이러한 것을 지칭할 수 있다. 예를 들어, 다수의 메모리 디바이스는 하나 이상의 메모리 디바이스를 지칭할 수 있다. 또한, 특히 도면에서 참조 번호와 관련하여 본 명세서에서 사용되는 지시자, 가령, \"N\" 및 \"X\"은 그렇게 지시된 다수의 특정 특징부가 본 개시 내 용의 다수의 실시예에 포함될 수 있음을 나타낸다. 본 명세서의 도면은 첫 번째 숫자 또는 숫자들이 도면 번호에 대응하고 나머지 숫자가 도면의 요소 또는 구성요 소를 식별하는 번호 지정 규칙을 따른다. 상이한 도면들 간 유사한 요소 또는 구성요소가 유사한 숫자의 사용으 로 식별될 수 있다. 이해될 바와 같이, 본 명세서의 다양한 실시예에서 도시된 요소는 본 개시 내용의 다수의 추가 실시예를 제공하기 위해 추가, 교환 및/또는 제거될 수 있다. 또한, 도면에 제공된 요소의 비율 및 상대적축척은 본 개시 내용의 다양한 실시예를 설명하기 위한 것이며 한정의 의미로 사용되도록 의도된 것이 아니다. 도 1a은 본 개시 내용의 다수의 실시예에 따르는 메모리 디바이스를 포함하는 컴퓨팅 시스템의 형태 를 한 장치의 블록도이다. 본 명세서에서 사용될 때, 메모리 디바이스, 메모리 어레이(125-1, ... , 125- N), 메모리 제어기, 및/또는 AI 가속기가 개별적으로 \"장치\"로 간주될 수도 있다. 도 1a에 도시된 바와 같이, 호스트는 메모리 디바이스에 연결될 수 있다. 호스트는 랩톱 컴퓨터, 개인용 컴퓨터, 디지털 카메라, 디지털 기록 및 재생 디바이스, 모바일 전화기, PDA, 메모리 카드 판독 기, 인터페이스 허브, 그 밖의 다른 호스트 시스템일 수 있고, 메모리 액세스 디바이스, 예를 들어 프로세서를 포함할 수 있다. 해당 분야의 통상의 기술자는 \"프로세서\"가 하나 이상의 프로세서, 가령, 병렬 처리 시스템, 다수의 코프로세서 등을 의도할 수 있음을 알 것이다. 호스트는 메모리 디바이스와 통신하기 위한 호스트 제어기를 포함한다. 호스트 제어기는 메모리 디바이스에 커맨드를 전송할 수 있다. 호스트 제어기는 메모리 디바이스, 메모리 디바이 스 상의 메모리 제어기, 및/또는 메모리 디바이스 상의 AI 가속기와 통신하여 AI 동작, 데 이터 읽기, 데이터 쓰기, 및/또는 데이터 소거, 그 밖의 다른 동작을 수행할 수 있다. 물리적 호스트 인터페이 스는 메모리 디바이스와 물리적 호스트 인터페이스에 대해 호환 가능한 리셉터를 갖는 호스트 간에 제어, 주소, 데이터 및 그 밖의 다른 신호를 전달하기 위한 인터페이스를 제공할 수 있다. 신호는 다수의 버스, 가령, 데이터 버스 및/또는 주소 버스 상에 호스트와 메모리 디바이스 간에 통신될 수 있다. 호스트 및 메모리 디바이스는 메모리 자원을 공유하는 여러 디바이스들 사이에서 일관성(예를 들어, 캐시 일관성)을 제공할 수 있는 표준화된 프로토콜 또는 프로토콜들을 포함하는 하나 또는 여러 프로토콜을 사용하여 통신할 수 있다. 일부 예에서, 호스트와 메모리 디바이스는 CXL(Compute Express Link), CCIX(Cache Coherent Interconnect for Accelerators), Gen-Z, OpenCAPI(Open Coherent Accelerator Processor Interface), JEDEC의 LPDDRx, JEDEC의 NVDIMM-P, 또는 PCIe(Peripheral Component Interconnect Express) 또 는 이러한 인터페이스 표준의 일부 조합을 이용해 통신한다. 메모리 디바이스는 제어기, AI 가속기, 및 메모리 어레이(125-1, ... , 125-N)를 포함할 수 있 다. 메모리 디바이스는 저전력 더블 데이터 레이트 동적 랜덤 액세스 메모리, 가령, LPDDR5 디바이스 및/ 또는 그래픽 더블 데이터 레이트 동적 랜덤 액세스 메모리, 가령, GDDR6 디바이스, 그 밖의 다른 유형의 디바이 스일 수 있다. 메모리 어레이(125-1, ... , 125-N)는 다수의 메모리 셀, 가령, 휘발성 메모리 셀(가령, DRAM 메 모리 셀, 그 밖의 다른 유형의 휘발성 메모리 셀), 및/또는 비휘발성 메모리 셀(가령, RRAM 메모리 셀, 그 밖의 다른 유형의 비휘발성 메모리 셀)을 포함할 수 있다. 메모리 디바이스는 메모리 어레이(125-1, ... , 125- N)에 데이터를 읽기 및/또는 쓰기할 수 있다. 메모리 어레이(125-1, ... , 125-N)는 메모리 디바이스에서 수행되는 AI 동작 동안 사용되는 데이터를 저장할 수 있다. 메모리 어레이(125-1, ... , 125-N)는 신경망의 입 력, 출력, 가중치 행렬 및 바이어스 정보, 및/또는 메모리 디바이스에서 AI 동작을 수행하기 위해 AI 가속 기에 의해 사용되는 활성화 기능 정보를 저장할 수 있다. 호스트 제어기, 메모리 제어기, 및/또는 메모리 디바이스 상의 AI 가속기는 제어 회로, 가 령, 하드웨어, 펌웨어, 및/또는 소프트웨어를 포함할 수 있다. 하나 이상의 실시예에서, 호스트 제어기, 메모리 제어기, 및/또는 AI 가속기는 물리적 인터페이스를 포함하는 인쇄 회로 기판에 연결된 주문형 집적 회로(ASIC)일 수 있다. 또한, 메모리 디바이스 상의 메모리 제어기는 레지스터를 포함할 수 있다. 레지스터는 AI 동작을 수행하기 위해 AI 가속기에 대한 정보를 제공하도록 프로그래밍될 수 있다. 레지스터는 임의의 개수의 레지스터를 포함할 수 있다. 레지스터는 호스트, 메모리 제어 기, 및/또는 AI 가속기에 의해 쓰기 및/또는 읽힐 수 있다. 레지스터는 AI 가속기에 대한 입력, 출력, 신경망, 및/또는 활성화 기능 정보를 제공할 수 있다. 레지스터는 메모리 디바이스에 대 한 동작의 모드를 선택하기 위해 모드 레지스터를 포함한다. 메모리 디바이스의 정상 동작과 연관된 레지스터로의 액세스를 금지하고 AI 동작과 연관된 레지스터로의 액세스를 허용하는 워드, 가령, 0xAA 및/또는 0x2AA를 레지스터에 씀으로써, AI 동작 모드가 선택될 수 있다. 또한, AI 동작 모드는 메모리 디바이스 에 저장된 키에 의해 인증되는 암호화 알고리즘을 사용하는 서명(signature)을 사용하여 선택될 수 있다. 레지스터는 또한 메모리 어레이(125-1, ... , 125-N) 내에 위치할 수 있고 제어기에 의해 액세스될 수 있다. AI 가속기는 AI 동작을 수행하기 위해 하드웨어 및/또는 소프트웨어/펌웨어를 포함할 수 있다. 하드웨어는 AI 동작과 연관된 논리 연산을 수행하기 위해 덧셈기/곱셈기를 포함할 수 있다. 메모리제어기 및/또는 AI 가속기는 AI 동작을 수행하기 위해 호스트로부터 커맨드를 수신할 수 있다. 메모리 디바이스는 AI 가속기, 메모리 어레이(125-1, ... , 125-N) 내 데이터, 및 레지스터 내 정보를 이용해 호스트로부터의 커맨드에서 요청된 AI 동작을 수행할 수 있다. 메모리 디바이스는 AI 동작 의 정보, 가령, 결과 및/또는 에러 정보를 호스트로 다시 보고할 수 있다. AI 가속기에 의해 수행되 는 AI 동작은 외부 처리 자원을 사용하지 않고 수행될 수 있다. 메모리 어레이(125-1, ... , 125-N)는 메모리 시스템을 위한 주 메모리를 제공할 수 있거나 메모리 시스템 전체 에 걸쳐 추가 메모리 또는 스토리지로서 사용될 수 있다. 각각의 메모리 어레이(125-1, ... , 125-N)는 메모리 셀의 다수의 블록을 포함할 수 있다. 메모리 셀의 블록은 메모리 디바이스에 의해 수행되는 AI 동작 동안 사용되는 데이터를 저장하는 데 사용될 수 있다. 메모리 어레이(125-1, ... , 125-N)는 예를 들어 DRAM 메모리 셀을 포함할 수 있다. 실시예는 특정 유형의 메모리 디바이스로 제한되지 않는다. 예를 들어, 메모리 디바이스 는 RAM, ROM, DRAM, SDRAM, PCRAM, RRAM, 3D XPoint 및 플래시 메모리 등을 포함할 수 있다. 도 1a의 실시예는 본 개시 내용의 실시예들을 모호하게 하지 않도록 예시되지 않은 추가 회로를 포함할 수 있다. 예를 들어, 메모리 디바이스는 I/O 회로를 통한 I/O 연결을 통해 제공된 주소 신호를 래칭하기 위한 주소 회로를 포함할 수 있다. 주소 신호는 행 디코더 및 열 디코더에 의해 수신 및 디코딩되어 메모리 어레이 (125-1, ... , 125-N)를 액세스할 수 있다. 해당 분야의 통상의 기술자라면 주소 입력 연결의 개수가 메모리 어 레이(125-1, ... , 125-N)의 밀도 및 아키텍처에 따라 달라질 수 있음을 알 것이다. 도 1b는 본 개시 내용의 다수의 실시예에 따르는 인공 지능(AI) 가속기를 갖는 메모리 디바이스를 갖는 컴퓨팅 시스템을 포함하는 컴퓨팅 시스템의 형태를 한 장치의 블록도이다. 본 명세서에서 사용될 때, 메모리 디바이스 (120-1, 120-2, 120-3, 1204-4, 및 120-X), 제어기, 및/또는 메모리 시스템이 개별적으로 \"장치\"로 간주될 수도 있다. 도 1b에 도시된 바와 같이, 호스트는 메모리 시스템에 연결될 수 있다. 호스트는 랩톱 컴퓨터, 개인용 컴퓨터, 디지털 카메라, 디지털 기록 및 재생 디바이스, 모바일 전화기, PDA, 메모리 카드 판독기, 인터 페이스 허브, 그 밖의 다른 호스트 시스템일 수 있고, 메모리 액세스 디바이스, 예를 들어 프로세서를 포함할 수 있다. 해당 분야의 통상의 기술자는 \"프로세서\"가 하나 이상의 프로세서, 가령, 병렬 처리 시스템, 다수의 코프로세서 등을 의도할 수 있음을 알 것이다. 호스트는 메모리 시스템과 통신하기 위한 호스트 제어기를 포함한다. 호스트 제어기는 메 모리 시스템에 커맨드를 전송할 수 있다. 메모리 시스템은 제어기 및 메모리 디바이스(120-1, 120-2, 120-3, 120-4, 및 120-X)를 포함할 수 있다. 메모리 디바이스(120-1, 120-2, 120-3, 120-4 및 120-X)는 도 1a와 관련하여 앞서 기재된 메모리 디바이스일 수 있고 AI동작을 수행하기 위한 하드웨어 및/또는 소프 트웨어/펌웨어를 갖는 AI 가속기를 포함할 수 있다. 호스트 제어기는 제어기 및/또는 메모리 디바이 스(120-1, 120-2, 120-3, 120-4, 및 120-X)와 통신하여 AI 동작을 수행하고, 다른 작업 외에, 데이터를 읽고, 데이터를 쓰고, 및/또는 데이터를 소거할 수 있다. 물리적 호스트 인터페이스는 메모리 시스템과 물리적 호스트 인터페이스에 대해 호환 가능한 리셉터를 갖는 호스트 간에 제어, 주소, 데이터 및 그 밖의 다른 신호를 전달하기 위한 인터페이스를 제공할 수 있다. 신호는 다수의 버스, 가령, 데이터 버스 및/또는 주소 버 스 상에 호스트와 메모리 시스템 간에 통신될 수 있다. 메모리 시스템은 버스를 통해 메모리 디바이스(120-1, 120-2, 120-3, 및 120-4)에 연결된 제어기 를 포함할 수 있다. 메모리 시스템의 메모리 디바이스의 일부 또는 전체를 동작시킬 때 버스의 전체 대역폭이 소비될 수 있도록 버스가 구성될 수 있다. 예를 들어, 도 1b에 나타난 4개의 메모리 디바이스 (120-1, 120-2, 120-3, 및 120-4) 중 두 개의 메모리 디바이스가 버스의 전체 대역폭을 사용하면서 동작하 도록 구성될 수 있다. 제어기는 특정 시간 주기 동안, 가령, 동시에, 동작하도록 메모리 디바이스(120-1 및 120-3)을 선택할 수 있는 선택 라인 상의 커맨드를 전송할 수 있다. 제어기는 특정 시간 주기 동 안, 가령, 동시에, 동작하도록 메모리 디바이스(120-2 및 120-X)을 선택할 수 있는 선택 라인 상의 커맨드 를 전송할 수 있다. 다수의 실시예에서, 제어기는 메모리 디바이스(120-1, 120-2, 120-3, 및 120-4)의 임 의의 조합을 선택하기 위해 선택 라인(117 및 119) 상의 커맨드를 전송하도록 구성될 수 있다. 다수의 실시예에서, 선택 라인 상의 커맨드는 메모리 디바이스(120-1 및 120-3)를 선택하는 데 사용될 수 있고 선택 라인 상의 커맨드는 메모리 디바이스(120-2 및 120-4)를 선택하는 데 사용될 수 있다. 선택된 메모리 디바이스는 AI 동작의 수행 중에 사용될 수 있다. AI 동작과 연관된 데이터는 버스 상에서 선택된 메모리 디바이스(120-1, 120-2, 120-3 및 120-4) 간에 복사 및/또는 전송될 수 있다.선택 라인은 메모리 디바이스(120-1 및 120-3)의 전원 켜기(예를 들어, 전원 공급을 유지 및/또는 복원) 및/또는 전원 끄기(예를 들어, 전원 제거)를 위해 동작 모드를 수정하는 데 사용될 수 있고 선택 라인은 메모리 디바이스(120-2 및 120-4)의 전원 켜기(가령, 정상 동작 모드 및/또는 증가된 전력 소비 모드) 및/또는 전원 끄기(가령, 감소된 전력 소비 모드)를 위한 동작 모드를 수정하는 데 사용될 수 있다. 메모리 디바이스 (120-1, 120-2, 120-3 및 120-4) 중 하나 이상은 메모리 시스템의 전력 소비를 제어하기 위해 감소된 전력 소비 모드에 있을 수 있다. 일부 예에서, 메모리 디바이스(120-1, 120-2, 120-3, 및 120-4) 중 하나 이상이, 하 나 이상의 메모리 디바이스(120-1, 120-2, 120-3, 및 120-4)가 정상 동작 모드에 비해 감소된 전력 소비를 갖는 감소된 전력 소비 모드에 있음으로써, 더 많이 전력이, 하나 이상의 메모리 디바이스(120-2, 120-3, 및 120- 4)가 AI 동작을 수행하도록 감소된 전력 소비 모드에 비해 증가된 전력 소비를 갖는 정상 동작 모드 및/또는 증 가된 전력 소비 모드인 메모리 디바이스(120-1, 120-2, 120-3, 및 120-4) 중 하나 이상으로 향하게 할 수 있다. 예를 들어, 호스트 제어기 및/또는 메모리 시스템 제어기는 전력을 절약하기 위해 메모리 디바이스 (120-1 및 120-3)의 동작 모드를 감소된 전력 소비 모드로 수정하기 위한 모드 레지스터 쓰기 커맨드를 전송, 및/또는 AI 동작을 수행하기 위해 메모리 디바이스(120-2 및 120-4)의 동작 모드를 정상 동작 모드 및/또는 증 가된 전력 소비 모드로 수정하기 위한 모드 레지스터 쓰기 커맨드를 전송할 수 있다. 일부 예에서, 하나 이상의 메모리 디바이스(120-1, 120-2, 120-3 및 120-4)는 전원 공급을 제거함으로써 감소된 전력 소비 모드에 놓일 수 있다. 메모리 디바이스(120-1, 120-2, 120-3, 및 120-4) 중 하나 이상의 동작 모드가, 메모리 디바이스(120-1, 120- 2, 120-3, 및 120-4) 중 하나 이상이 리프레시 동작을 수행하지 않거나 및/또는 커맨드 인터페이스가 메모리 디 바이스(120-1, 120-2, 120-3, 및 120-4) 중 하나 이상을 정상 동작 모드 및/또는 증가된 전력 소비 모드로 두기 위한 커맨드만 수용하는 감소된 전력 소비 모드로 수정될 수 있다. 예를 들어, 메모리 디바이스의 커맨드/주소 버스(가령, 선택 라인(117 및 119))로의 전원 공급은, 하나 이상의 메모리 디바이스(120-1, 120-2, 120-3, 및 120-4)가 모드 레지스터 쓰기 또는 모드 레지스터 읽기 커맨드를 수신할 수 있기 위한 최소 전력 레벨에 적어도 부분적으로 기초하여, 유지될 수 있다. 감소된 전력 소비 모드로 진입하기 전에, 메모리 디바이스(120-1, 120- 2, 120-3 및 120-4) 중 하나 이상은 데이터를 상이한 메모리 디바이스로 전송할 수 있다. 상이한 메모리 디바이 스는 메모리 디바이스(120-1, 120-2, 120-3, 및 120-4) 중 하나 이상 및/또는 메모리 디바이스(120-X)일 수 있 다. 메모리 디바이스(120-X)는 휘발성 및/또는 비휘발성 메모리를 포함할 수 있다. 예를 들어, 메모리 디바이스 (120-X)는 비휘발성 메모리일 수 있고 메모리 시스템 및/또는 메모리 디바이스(120-1, 120-2, 120-3, 및 120- 4) 중 하나 이상에 전원이 공급되지 않을 때 운영 체제(OS) 데이터, 애플리케이션, 및 사용자 데이터를 저장할 수 있다. 다수의 실시예에서, 메모리 디바이스에 의해 수행되는 애플리케이션은 AI 동작을 포함할 수 있다. AI 동작을 수 행하는 동안 하나 이상의 메모리 디바이스(120-1, 120-2, 120-3 및 120-4)가 감소된 전력 소비 모드가 되는 것 에 응답하여, AI 동작은 일시 중지될 수 있고 AI 동작으로부터의 데이터가 메모리 디바이스(120-X) 및/또는 하 나 이상의 메모리 디바이스(120-1, 120-2, 120-3 및 120-4)로 전송될 수 있다. 하나 이상의 메모리 디바이스 (120-1, 120-2, 120-3 및 120-4)가 정상 동작 모드 및/또는 증가된 전력 소비 모드로 되돌아갈 때, AI 동작으로 부터의 데이터는 다시 하나 이상의 메모리 디바이스(120-1, 120-2, 120-3 및 120-4)로 다시 전송될 수 있고 AI 동작은 일시 중지된 곳에서 계속될 수 있다. 일부 예에서, AI 동작은 하나 이상의 메모리 디바이스(120-1, 120-2, 120-3 및 120-4)이 감소된 전력 소비 모드 로 들어가기 전에 완료될 수 있다. 하나 이상의 메모리 디바이스(120-1, 120-2, 120-3 및 120-4)는 감소된 전력 소비 모드가 될 수 있거나 및/또는 하나 이상의 메모리 디바이스(120-1, 120-2, 120-3 및 120-4)는 AI 동작의 출력을 제외하고 감소된 전력 소비 모드가 될 수 있다. 예를 들어, 출력은 하나 이상의 메모리 디바이스(120-1, 120-2, 120-3 및 120-4)로부터 읽힐 때까지 리프레시될 수 있다. 하나 이상의 메모리 디바이스(120-1, 120-2, 120-3 및 120-4)로부터 출력이 읽히면, 출력을 포함하는 하나 이상의 메모리 디바이스(120-1, 120-2, 120-3 및 120-4)는 감소된 전력 소비 모드가 될 수 있다. 메모리 디바이스(120-1, 120-2, 120-3 및 120-4) 중 하나 이상이 AI 동작을 수행하는 데 사용되는 인공 지능 (AI) 데이터를 AI 동작을 수행하는 중인 메모리 디바이스(120-1, 120-2, 120-3, 및 120-4) 중 하나 이상에 전 송할 수 있다. 일부 예에서, AI 동작을 수행하기 위한 AI 데이터는 메모리 디바이스들(120-1, 120-2, 120-3 및 120-4) 중 하나 이상이 감소된 전력 소비 모드가 된 것에 응답하여 AI 동작을 수행하기 위해 상이한 메모리 디 바이스로 전송될 수 있다. 예를 들어, AI 동작 및/또는 AI 데이터는 메모리 디바이스(120-2)가 감소된 전력 소 비 모드가 되는 것에 응답하여 AI 동작을 수행하기 위해 메모리 디바이스(120-1)로 전송될 수 있다. AI 데이터와 관련되지 않은 그 밖의 다른 데이터는 메모리 디바이스(120-2)가 감소된 전력 소비 모드가 되는 것에 응답하 여 상이한 메모리 디바이스, 예를 들어, 메모리 디바이스(120-X)로 전송될 수 있다. 일부 예에서, AI 동작을 수 행 중이었던 하나 이상의 메모리 디바이스(120-1, 120-2, 120-3, 및 120-4)가 AI 동작을 완료한 것에 응답하여, 감소된 전력 소비 모드에 있었던 메모리 디바이스(120-1, 120-2, 120-3 및 120-4) 중 하나 이상이 정상 동작 모 드 및/또는 증가된 전력 소비 모드에 있을 수 있다. 도 2는 본 개시 내용의 다수의 실시예에 따르는 인공 지능(AI) 가속기를 갖는 메모리 디바이스 상의 다수의 레 지스터의 블록도이다. 레지스터는 AI 레지스터일 수 있고 AI 가속기, 제어기 및/또는 메모리 디바이스의 메모리 어레이(가령, 도 1의 AI 가속기, 메모리 제어기 및/또는 메모리 어레이(125-1, ... , 125- N))에 의해 사용되기 위한, 입력 정보, 출력 정보, 신경망 정보, 및/또는 활성화 기능 정보, 그 밖의 다른 유형 의 정보를 포함할 수 있다. 레지스터는 호스트, AI 가속기 및/또는 제어기(가령, 도 1의 호스트, AI 가속 기, 메모리 제어기)로부터의 커맨드에 기초하여 읽기 및/또는 쓰기될 수 있다. 레지스터(232-0)는 메모리 디바이스의 AI 모드와 연관된 파라미터를 정의할 수 있다. 레지스터(232-0) 내 비트 는 AI 동작을 시작하고, AI 동작을 재시작하며, 레지스터의 내용이 유효함을 가리키고, 레지스터로부터 콘텐츠 를 지우고, 및/또는 AI 모드를 끝낼 수 있다. 레지스터(232-1, 232-2, 232-3, 232-4 및 232-5)는 AI 동작에 사용되는 입력의 크기, AI 동작에 사용되는 입력 의 수, AI 동작에서 사용되는 시작 주소 및 종료 주소를 정의할 수 있다. 레지스터(232-7, 232-8, 232-9, 232- 10 및 232-11)는 AI 동작의 출력 크기, AI 동작에서의 출력 수, AI 동작의 출력의 시작 주소 및 종료 주소를 정 의할 수 있다. 레지스터(232-12)는 AI 동작 동안 사용되는 입력 뱅크, 뉴런 뱅크, 출력 뱅크, 바이어스 뱅크, 활성화 기능, 및 임시 뱅크의 사용을 가능하게 하도록 사용될 수 있다. 레지스터(232-13, 232-14, 232-15, 232-16, 232-17, 232-18, 232-19, 232-20, 232-21, 232-22, 232-23, 232- 24 및 232-25)는 AI 동작 중에 사용되는 신경망을 정의하는 데 사용될 수 있다. 레지스터(232-13, 232-14, 232-15, 232-16, 232-17, 232-18, 232-19, 232-20, 232-21, 232-22, 232-23, 232-24, 및 232-25)는 AI 동작 중에 사용되는 신경망의 뉴런 및/또는 레이어의 크기, 개수 및 위치를 정의할 수 있다. 레지스터(232-26)는 AI 가속기의 디버깅/유지 모드를 인에이블(enable)하고 출력이 AI 동작의 레이어에서 관측 되게 할 수 있다. 레지스터(232-26)는 활성화가 AI 동작 동안 적용되어야 하고 AI 동작이 AI 동작에서 앞으로 나아갈 수 있음(가령, AI 동작에서 다음 단계 수행)을 나타낼 수 있다. 레지스터(232-26)는 레이어의 출력이 있 는 임시 블록이 유효함을 나타낼 수 있다. 임시 블록 내 데이터는 호스트 및/또는 메모리 디바이스 상의 제어기 에 의해 변경되어, 변경된 데이터가 AI 동작이 앞으로 나아갈 때 AI 동작에 사용될 수 있다. 레지스터(232-27, 232-28 및 232-29)는 디버깅/유지 모드가 AI 동작을 중지하고, 신경망의 콘텐츠를 변경하며, 레이어의 출력을 관측할 수 있는 레이어를 정의할 수 있다. 레지스터(232-30, 232-31, 232-32 및 232-33)는 AI 동작에 사용되는 임시 뱅크의 크기 및 AI 동작에 사용되는 임시 뱅크의 시작 주소와 종료 주소를 정의할 수 있다. 레지스터(232-30)는 AI 동작에서 사용되는 제1 임시 뱅 크의 시작 주소 및 종료 주소를 정의할 수 있고 레지스터(232-33)는 AI 동작에 사용되는 제1 임시 뱅크의 시작 주소와 종료 주소를 정의할 수 있다. 레지스터(232-31 및 232-32)는 AI 동작에 사용되는 임시 뱅크의 크기를 정 의할 수 있다. 레지스터(232-34, 232-35, 232-36, 232-37, 232-38 및 232-39)는 AI 동작에서 사용되는 활성화 기능과 연관될 수 있다. 레지스터(232-34)는 활성화 기능 블록의 사용을 인에이블하고, 각각의 뉴런에 대한 활성화 기능의 사 용을 인에이블하며, 각각의 레이어에 대한 활성화 기능을 인에이블하며, 외부 활성화 기능의 사용을 인에이블할 수 있다. 레지스터(232-35)는 활성화 기능의 위치의 시작 주소와 종료 주소를 정의할 수 있다. 레지스터(232- 36, 232-37, 232-38 및 232-39)는 활성화 기능 및/또는 커스텀 정의된 활성화 기능의 입력(가령, x축) 및 출력 (가령, y축)의 분해능을 정의할 수 있다. 레지스터(232-40, 232-41, 232-42, 232-43 및 232-44)는 AI 동작에 사용되는 바이어스 값의 크기, AI 동작에서 사용되는 바이어스 값의 수, 및 AI 동작에서 사용되는 바이어스 값의 시작 주소 및 종료 주소를 정의할 수 있다. 레지스터(232-45)는 AI 계산을 위한 상태 정보를 제공하고 디버그/유지 모드에 대한 정보를 제공할 수 있다. 레 지스터(232-45)는 디버깅/유지 모드를 인에이블하고, AI 가속기가 AI 동작을 수행하고 있음을 나타내고, AI 가속기의 전체 기능이 사용되어야 함을 나타내고, AI 동작의 행렬 계산만 수행되어야 함을 나타내거나, 및/또는 AI 동작이 다음 뉴런 및/또는 레이어로 진행할 수 있음을 나타낼 수 있다. 레지스터(232-46)는 AI 동작에 관한 에러 정보를 제공할 수 있다. 레지스터(232-46)는 AI 동작의 시퀀스에 에러 가 있음, AI 동작의 알고리즘에 에러가 있음, ECC가 정정할 수 없는 데이터 페이지에 에러가 있음, 및/또는 ECC 가 정정할 수 없는 데이터의 페이지에 에러가 있었음을 나타낼 수 있다. 레지스터(232-47)는 AI 동작에서 사용될 활성화 기능을 나타낼 수 있다. 레지스터(232-47)는 사전 정의된 다수 의 활성화 기능 중 하나가 AI 동작에서 사용될 수 있음 및/또는 블록에 위치하는 커스텀 활성화 기능이 AI 동작 에서 사용될 수 있음을 나타낼 수 있다. 레지스터(232-48, 232-49 및 232-50)는 AI 동작이 실행되고 있는 뉴런 및/또는 레이어를 나타낼 수 있다. AI 동 작 중 에러가 발생한 경우, 레지스터(232-48, 232-49 및 232-50)는 에러가 발생한 뉴런 및/또는 레이어를 나타 낼 수 있다. 레지스터(232-51)는 메모리 디바이스의 동작 모드를 수정할 수 있다. 메모리 디바이스 제어기는 레지스터(232- 51)에 동작 모드를 나타내는 값을 씀으로써 동작 모드를 수정하도록 인에이블될 수 있다. 동작 모드는 예를 들 어 감소된 전력 소비 모드, 증가된 전력 소비 모드 및/또는 정상 동작 모드일 수 있다. 도 3a 및 3b는 본 개시 내용의 다수의 실시예에 따르는 인공 지능(AI) 가속기를 갖는 메모리 디바이스 상의 다 수의 레지스터 내 다수의 비트의 블록도이다. 각각의 레지스터(332-0, ... , 332-50)는 다수의 비트, 즉, 비트 (334-0, 334-1, 334-2, 334-3, 334-4, 334-5, 334-6, 및 334-7)를 포함하여, AI 동작 수행과 연관된 정보를 나 타낼 수 있다. 레지스터(332-0)는 메모리 디바이스의 AI 모드와 연관된 파라미터를 정의할 수 있다. 레지스터(332-0)의 비트 (334-5)는 읽기/쓰기 비트일 수 있으며 1b로 프로그래밍될 때 AI 동작의 정교화가 시작 부분에서 재시작할 수 있음을 나타낼 수 있다. AI 동작이 재시작되면 레지스터(332-0)의 비트(334-5)가 0b로 재설정될 수 있다. 레 지스터(332-0)의 비트(334-4)는 읽기/쓰기 비트일 수 있으며 1b로 프로그래밍될 때 AI 동작의 정교화가 시작 될 수 있음을 나타낼 수 있다. AI 동작이 시작되면 레지스터(332-0)의 비트(334-4)가 0b로 재설정될 수 있 다. 레지스터(332-0)의 비트(334-3)는 읽기/쓰기 비트일 수 있고 AI 레지스터의 콘텐츠가 1b로 프로그램될 때 유효 하고 0b로 프로그램될 때 무효임을 나타낼 수 있다. 레지스터(332-0)의 비트(334-2)는 읽기/쓰기 비트일 수 있으며 1b로 프로그래밍될 때 AI 레지스터의 콘텐츠가 비워질 것임을 나타낼 수 있다. 레지스터(332- 0)의 비트(334-1)는 읽기 전용 비트일 수 있고 AI 가속기가 사용 중이고 1b로 프로그래밍될 때 AI 동작을 수행하고 있음을 나타낼 수 있다. 레지스터(332-0)의 비트(334-0)는 쓰기 전용 비트일 수 있으며 1b로 프로그래 밍될 때 메모리 디바이스는 AI 모드를 종료해야 함을 나타낼 수 있다. 레지스터(332-1, 332-2, 332-3, 332-4 및 332-5)는 AI 동작에서 사용되는 입력의 크기, AI 동작에서 사용되는 입력의 수, AI 동작에서 사용되는 입력의 시작 주소 및 종료 주소를 정의할 수 있다. 레지스터(332-1 및 332- 2)의 비트(334-0, 334-1, 334-2, 334-3, 334-4, 334-5, 334-6 및 334-7)는 AI 동작에서 사용되는 입력의 크기 를 정의할 수 있다. 입력의 크기는 입력의 비트 수 및/또는 유형, 가령, 부동 소수점, 정수, 및/또는 더블 (double), 그 밖의 다른 유형과 관련된 입력의 폭을 나타낼 수 있다. 레지스터(332-3 및 332-4)의 비트(334-0, 334-1, 334-2, 334-3, 334-4, 334-5, 334-6 및 334-7)는 AI 동작에서 사용되는 입력의 수를 나타낼 수 있 다. 레지스터(332-5)의 비트(334-4, 334-5, 334-6 및 334-7)는 AI 동작에 사용되는 입력의 메모리 어레이 내 블록의 시작 주소를 나타낼 수 있다. 레지스터(332-5)의 비트(334-0, 334-1, 334-2 및 334-3)는 AI 동작 에 사용되는 입력의 메모리 어레이 내 블록의 종료 주소를 나타낼 수 있다. 시작 주소와 종료 주소 가 동일 주소인 경우 AI 동작에 대해 단 하나의 블록의 입력만 나타난다. 레지스터(332-7, 332-8, 332-9, 332-10 및 332-11)는 AI 동작의 출력 크기, AI 동작의 출력의 개수, AI 동작의 출력의 시작 주소와 종료 주소를 정의할 수 있다. 레지스터(332-7 및 332-8)의 비트(334-0, 334-1, 334-2, 334-3, 334-4, 334-5, 334-6 및 334-7)는 AI 동작에서 사용되는 출력의 크기를 정의할 수 있다. 출력의 크기는 출력의 비트 수 및/또는 유형, 가령, 부동 소수점, 정수, 및/또는 더블, 그 밖의 다른 유형에 대한 출력 의 폭을 나타낼 수 있다. 레지스터(332-9 및 332-10)의 비트(334-0, 334-1, 334-2, 334-3, 334-4, 334-5, 334- 6, 및 334-7)는 AI 동작에서 사용되는 출력의 수를 나타낼 수 있다. 레지스터(332-11)의 비트(334-4, 334-5, 334-6, 및 334-7)는 AI 동작에 사용되는 출력의 메모리 어레이 내 블록의 시작 주소를 나타낼 수있다. 레지스터(332-11)의 비트(334-0, 334-1, 334-2, 및 334-3)는 AI 동작에 사용되는 출력의 메모리 어레이 내 블록의 종료 주소를 나타낼 수 있다. 시작 주소와 종료 주소가 동일 주소인 경우 AI 동작에 대해 단 하나의 블록의 입력만 나타난다. 레지스터(332-12)는 AI 동작 동안 사용되는 입력 뱅크, 뉴런 뱅크, 출력 뱅크, 바이어스 뱅크, 활성화 기능, 및 임시 뱅크의 사용을 인에이블하도록 사용될 수 있다. 레지스터(332-12)의 비트(334-0)가 입력 뱅크를 인에이블 하고, 레지스터(332-12)의 비트(334-1)가 신경망 뱅크를 인에이블하며, 레지스터(332-12)의 비트 (334-2)가 출력 뱅크를 인에이블하고, 레지스터(332-12)의 비트(334-3)가 바이어스 뱅크를 인에이블 하며, 레지스터(332-12)의 비트(334-4)가 활성화 기능 뱅크를 인에이블하며, 레지스터(332-12)의 비트 (334-5 및 334-6)가 제1 임시 뱅크를 인에이블하고 제2 임시 뱅크를 인에이블할 수 있다. 레지스터(332-13, 332-14, 332-15, 332-16, 332-17, 332-18, 332-19, 332-20, 332-21, 332-22, 332-23, 332- 24, 및 332-25)는 AI 동작 중에 사용되는 신경망을 정의하는 데 사용될 수 있다. 레지스터(332-13 및 332-14)의 비트(334-0, 334-1, 334-2, 334-3, 334-4, 334-5, 334-6, 및 334-7)는 AI 동작에서 사용되는 행렬에서 행의 수 를 정의할 수 있다. 레지스터(332-15 및 332-16)의 비트(334-0, 334-1, 334-2, 334-3, 334-4, 334-5, 334-6, 및 334-7)는 AI 동작에서 사용되는 행렬에서 열의 수를 정의할 수 있다. 레지스터(332-17 및 332-18)의 비트(334-0, 334-1, 334-2, 334-3, 334-4, 334-5, 334-6, 및 334-7)는 AI 동작 에서 사용되는 뉴런의 크기를 정의할 수 있다. 뉴런의 크기는 입력의 비트 수 및/또는 유형, 가령, 부동 소수점, 정수, 및/또는 더블(double)과 관련된 뉴런의 폭을 나타낼 수 있다. 레지스터(332-19, 332-20, 및 322- 21)의 비트(334-0, 334-1, 334-2, 334-3, 334-4, 334-5, 334-6, 및 334-7)는 AI 동작에서 사용되는 신경망의 뉴런의 수를 나타낼 수 있다. 레지스터(332-22)의 비트(334-4, 334-5, 334-6 및 334-7)는 AI 동작에 사용 되는 뉴런의 메모리 어레이에 있는 블록의 시작 주소를 나타낼 수 있다. 레지스터(332-5)의 비트(334-0, 334-1, 334-2, 및 334-3)는 AI 동작에 사용되는 뉴런의 메모리 어레이에 있는 블록의 종료 주소를 나타낼 수 있다. 시작 주소와 종료 주소가 동일 주소인 경우 AI 동작에 대해 단 하나의 블록의 뉴런만 나타 난다. 레지스터(332-23, 332-24, 및 322-25)의 비트(334-0, 334-1, 334-2, 334-3, 334-4, 334-5, 334-6, 및 334-7)는 AI 동작에서 사용되는 신경망의 레이어의 수를 나타낼 수 있다. 레지스터(332-26)는 AI 가속기의 디버깅/유지 모드를 인에이블하고 출력이 AI 동작의 레이어에서 관측되게 할 수 있다. 레지스터(332-26)의 비트(334-0)는 AI 가속기가 디버깅/유지 모드에 있고 AI 동작 동안 활성화 기능이 적용되어야 함을 나타낼 수 있다. 레지스터(332-26)의 비트(334-1)는 AI 동작이 AI 동작에서 앞으로 나아 갈 수 있음(예를 들어, AI 동작에서 다음 단계를 수행)을 나타낼 수 있다. 레지스터(232-26)의 비트(334- 2) 및 비트(334-3)는 레이어의 출력이 있는 임시 블록이 유효함(388 및 389)을 나타낼 수 있다. 임시 블록 내 데이터는 호스트 및/또는 메모리 디바이스 상의 제어기에 의해 변경되어, 변경된 데이터가 AI 동작이 앞으로 나 아갈 때 AI 동작에 사용될 수 있다. 레지스터(332-27, 332-28, 및 332-29)의 비트(334-0, 334-1, 334-2, 334-3, 334-4, 334-5, 334-6, 및 334- 7)가 디버깅/유지 모드가 AI 동작을 중지하고 레이어의 출력을 관측할 레이어를 정의할 수 있다. 레지스터(332-30, 332-31, 332-32 및 332-33)는 AI 동작에서 사용되는 임시 뱅크의 크기와 AI 동작에 사용되는 임시 뱅크의 시작 주소와 종료 주소를 정의할 수 있다. 레지스터(332-30)의 비트(334-4, 334-5, 334-6 및 334- 7)는 AI 동작에 사용되는 제1 임시 뱅크의 시작 주소를 정의할 수 있다. 레지스터(332-30)의 비트(334-0, 334-1, 334-2, 및 334-3)는 AI 동작에 사용되는 제1 임시 뱅크의 종료 주소를 정의할 수 있다. 레지스터 (332-31 및 332-32)의 비트(334-0, 334-1, 334-2, 334-3, 334-4, 334-5, 334-6 및 334-7)는 AI 동작에서 사용 되는 임시 뱅크의 크기를 정의할 수 있다. 임시 뱅크의 크기는 입력의 비트 수 및/또는 유형, 가령, 부동 소수점, 정수, 및/또는 더블(double), 그 밖의 다른 유형과 관련된 임시 뱅크의 폭을 나타낼 수 있다. 레지스터 (332-33)의 비트(334-4, 334-5, 334-6, 및 334-7)는 AI 동작에서 사용되는 제2 임시 뱅크의 시작 주소를 정의할 수 있다. 레지스터(332-34)의 비트(334-0, 334-1, 334-2, 및 334-3)는 AI 동작에서 사용되는 제2 임시 뱅크의 종료 주소를 정의할 수 있다. 레지스터(332-34, 332-35, 332-36, 332-37, 332-38, 및 332-39)는 AI 동작에서 사용되는 활성화 기능과 연관될 수 있다. 레지스터(332-34)의 비트(334-0)는 활성화 기능 블록의 사용을 인에이블할 수 있다. 레지스터 (332-34)의 비트(334-1)는 뉴런에서 그 AI를 유지하고 각각의 뉴런에 대한 활성화 기능의 사용을 인에이 블할 수 있다. 레지스터(332-34)의 비트(334-2)는 레이어에서 AI를 유지하고 각각의 레이어에 대한 활성화 기능의 사용을 인에이블할 수 있다. 레지스터(332-34)의 비트(334-3)는 외부 활성화 기능의 사용을 인에이블할 수 있다. 레지스터(332-35)의 비트(334-4, 334-5, 334-6, 및 334-7)는 AI 동작에 사용되는 활성화 기능 뱅크의 시작 주 소를 정의할 수 있다. 레지스터(332-35)의 비트(334-0, 334-1, 334-2 및 334-3)는 AI 동작에서 사용되는 활성화 기능 뱅크의 종료 주소를 정의할 수 있다. 레지스터(332-36 및 332-37)의 비트(334-0, 334-1, 334-2, 334-3, 334-4, 334-5, 334-6 및 334-7)는 활성화 기능의 입력(가령, x-축)의 분해능을 정의할 수 있다. 레지스터(332-38 및 332-39)의 비트(334-0, 334-1, 334-2, 334-3, 334-4, 334-5, 334-6 및 334-7)는 커 스텀 활성화 기능의 주어진 x-축에 대해 활성화 기능의 해상도 및/또는 출력(가령, y-축)을 정의할 수 있 다. 레지스터(332-40, 332-41, 332-42, 332-43, 및 332-44)는 AI 동작에서 사용되는 바이어스 값의 크기, AI 동작 에서 사용되는 바이어스 값의 수, AI 동작에서 사용되는 바이어스 값의 시작 주소 및 종료 주소를 정의할 수 있 다. 레지스터(332-40 및 332-41)의 비트(334-0, 334-1, 334-2, 334-3, 334-4, 334-5, 334-6 및 334-7)는 AI 동 작에서 사용되는 바이어스 값의 크기를 정의할 수 있다. 바이어스 값의 크기는 바이어스 값의 비트 수 및 /또는 유형, 가령, 부동 소수점, 정수, 및/또는 더블(double), 그 밖의 다른 유형과 관련된 바이어스 값의 폭을 나타낼 수 있다. 레지스터(332-42 및 332-43)의 비트(334-0, 334-1, 334-2, 334-3, 334-4, 334-5, 334-6, 및 334-7)는 AI 동작에서 사용되는 바이어스 값의 수를 나타낼 수 있다. 레지스터(332-44)의 비트(334-4, 334-5, 334-6, 및 334-7)는 AI 동작에 사용되는 바이어스 값의 메모리 어레이 내 블록의 시작 주소를 나 타낼 수 있다. 레지스터(332-44)의 비트(334-0, 334-1, 334-2, 및 334-3)는 AI 동작에서 사용되는 바이어스 값 의 메모리 어레이에 있는 블록의 종료 주소를 나타낼 수 있다. 시작 주소와 종료 주소가 동 일 주소인 경우 AI 동작에 대해 단 하나의 블록의 바이어스 값만 나타난다. 레지스터(332-45)는 AI 계산을 위한 상태 정보를 제공하고 디버그/유지 모드에 대한 정보를 제공할 수 있다. 레 지스터(332-45)의 비트(334-0)는 디버깅/유지 모드를 활성화할 수 있다. 레지스터의 비트(334-1)은 AI 가 속기가 사용 중(busy)이고 AI 동작을 수행하고 있음을 나타낼 수 있다. 레지스터(332-45)의 비트(334- 2)는 AI 가속기가 켜져 있음(on) 및/또는 AI 가속기의 전체 기능이 사용되어야 함을 나타낼 수 있다. 레 지스터(332-45)의 비트(334-3)는 AI 동작의 행렬 계산만 이루어져야 함을 나타낼 수 있다. 레지스터(332- 45)의 비트(334-4)는 AI 동작이 앞으로 나아갈 수 있고 다음 뉴런 및/또는 레이어로 진행할 수 있음을 나 타낼 수 있다. 레지스터(332-46)는 AI 동작에 관한 에러 정보를 제공할 수 있다. 레지스터(332-46)의 비트(334-3)는 AI 동작의 시퀀스에 에러가 있음을 나타낼 수 있다. 레지스터(332-46)의 비트(334-2)는 AI 동작의 알고리즘에 에러 가 있음을 나타낼 수 있다. 레지스터(332-46)의 비트(334-1)는 ECC가 정정할 수 없는 페이지 내 에러가 있었음을 나타낼 수 있다. 레지스터(332-46)의 비트(334-0)는 ECC가 정정할 수 있는 페이지 내 에러가 있 었음을 나타낼 수 있다. 레지스터(332-47)는 AI 동작에서 사용되기 위한 활성화 기능을 나타낼 수 있다. 레지스터(332-47)의 비트(334- 0, 334-1, 334-2, 334-3, 334-4, 334-5 및 334-6)는 다수의 지정 활성화 기능 중 하나가 AI에서 사용될 수 있 음을 나타낼 수 있다. 레지스터(332-47)의 비트(334-7)는 블록에 있는 커스텀 활성화 기능이 AI 동 작에서 사용될 수 있음을 나타낼 수 있다. 레지스터(332-48, 332-49, 및 332-50)는 AI 동작이 실행되고 있는 뉴런 및/또는 레이어를 나타낼 수 있다. 레지 스터(332-48, 332-49 및 332-50)의 비트(334-0, 334-1, 334-2, 334-3, 334-4, 334-5, 334-6 및 334-7)는 AI 동작이 실행 중인 뉴런 및/또는 레이어의 주소를 나타낼 수 있다. AI 동작 동안 에러가 발생한 경우, 레지스터 (332-48, 332-49, 및 332-50)는 에러가 발생한 뉴런 및/또는 레이어를 나타낼 수 있다. 레지스터(332-51)는 메모리 디바이스의 동작 모드를 수정할 수 있다. 레지스터(332-51)의 비트(334-0, 334-1, 334-2, 334-3, 334-4, 334-5, 334-6 및 334-7)는 하나 이상의 메모리 디바이스의 동작 모드가 수정되게 인에이 블할 수 있다. 예를 들어, 비트(334-0)는 제1 상태(가령, 제1 값)로 프로그래밍(예를 들어, 쓰기)되어 제1 메모 리 디바이스의 동작 모드를 감소된 전력 소비 모드로 수정 및/또는 제2 상태(가령, 제2 값)로 프로그래밍되어 제1 메모리 디바이스의 동작 모드를 증가된 전력 소비 모드 및/또는 정상 동작 모드로 수정할 수 있다. 일부 예 에서, 제1 메모리 디바이스는 비트(334-0, 334-1, 334-2, 334-3, 334-4, 334-5, 334-6, 및 334-7) 중 하나 이 상을 이용해 이진 숫자를 할당 받아 제1 메모리 디바이스의 동작 모드를 수정할 수 있다. 예를 들어, 제1 메모 리 디바이스는 비트(334-0, 334-2, 334-4, 및 334-6)가 제1 상태로 프로그래밍되고 비트(334-1, 334-3, 334-5, 및 334-7)가 제2 상태로 프로그래밍되는 것에 응답하여 감소된 전력 소비 모드가 될 수 있고, 비트(334-0, 334-2, 334-4, 및 334-6)가 제2 상태로 프로그래밍되고 비트(334-1, 334-3, 334-5, 및 334-7)가 제1 상태로 프로그 래밍되는 것에 응답하여 증가된 전력 소비 모드 및/또는 정상 동작 모드가 될 수 있다. 메모리 디바이스는 호스트 제어기 및/또는 메모리 시스템 제어기로부터 모드 레지스터 쓰기 커맨드를 수신하여 메모리 디바이스의 동작 모드를 수정할 수 있다. 일부 예에서, 메모리 디바이스가 감소된 전력 소비 모드에 있 을 때, 레지스터(332-51)는 메모리 디바이스를 증가된 전력 소비 모드 및/또는 정상 동작 모드가 되게 하도록 모드 레지스터 쓰기 커맨드를 수용하기만 할 수 있다. 레지스터가 수용할 수 있는 커맨드의 수를 제한하면 감소 된 전력 소비 모드에서 메모리 디바이스가 소비하는 전력의 양을 감소시킬 수 있다. 도 4는 본 개시 내용의 다수의 실시예에 따르는 인공 지능(AI) 가속기를 갖는 메모리 디바이스의 다수의 블록의 블록도이다. 입력 블록은 입력 데이터가 저장된 메모리 어레이 내 블록이다. 입력 블록 내 데이터는 AI 동작을 위한 입력으로서 사용될 수 있다. 입력 블록의 주소는 레지스터(가령, 레지스터(도 2의 232- 5 및 도 3a의 332-5))에 나타날 수 있다. 실시예는 복수의 입력 블록이 있을 수 있으므로 하나의 입력 블록으로 한정되지 않는다. 데이터 입력 블록은 호스트로부터 메모리 디바이스로 전송될 수 있다. 데이터는 AI 동작 이 데이터를 사용하여 메모리 디바이스 상에서 수행되어야 함을 나타내는 커맨드를 수반할 수 있다. 출력 블록은 AI 동작으로부터의 출력 데이터가 저장되는 메모리 어레이 내 블록이다. 출력 블록 내 데이터는 AI 동작으로부터의 출력을 저장하고 호스트로 전송하는데 사용될 수 있다. 출력 블록의 주소는 레지스터(가령, 레지스터(도 2의 232-11 및 도 3a의 332-11))에 나타날 수 있다. 실시예는 복수의 출력 블 록이 있을 수 있으므로 하나의 출력 블록으로 제한되지 않는다. 출력 블록 내 데이터는 AI 동작의 완료 및/또는 유지 시에 호스트로 전송될 수 있다. 임시 블록(444-1 및 444-2)은 AI 동작이 수행되는 동안 데이터가 일시적으로 저장되는 메모리 어레이의 블록일 수 있다. AI 동작이 AI 동작에 대해 사용되는 신경망의 뉴런 및 레이어를 통해 반복되는 동안 데이터는 임시 블록(444-1 및 444- 2)에 저장될 수 있다. 임시 블록의 주소는 레지스터(30 및 33)(가령, 레지스터(도 2의 232-30 및 232-33 및 도 3b의 332-30 및 332-33))에 나타날 수 있다. 실시예는 복수의 임시 블록이 있을 수 있으므로 두 개의 임 시 블록으로 제한되지 않는다. 활성화 기능 블록은 AI 동작을 위한 활성화 기능이 저장되는 메모리 어레이의 블록이다. 활성화 기능 블록 은 호스트 및/또는 AI 가속기에 의해 생성되는 지정 활성화 기능 및/또는 커스텀 활성화 기능을 저장할 수 있다. 활성화 기능 블록의 주소는 레지스터(가령, 레지스터(도 2의 232-35 및 도 3b의 332-35))에 나 타날 수 있다. 복수의 활성화 기능 블록이 존재할 수 있기 때문에 실시예는 하나의 활성화 기능 블록으로 한정 되지 않는다. 바이어스 값 블록은 AI 동작에 대한 바이어스 값이 저장되는 메모리 어레이의 블록이다. 바이어스 값 블록 의 주소는 레지스터(가령, 레지스터(도 2의 232-44 및 도 3b의 332-44))에 나타날 수 있다. 실시예는 복수의 바이어스 값 블록이 있을 수 있으므로 하나의 바이어스 값 블록으로 제한되지 않는다. 신경망 블록(450-1, 450-2, 450-3, 450-4, 450-5, 450-6, 450-7, 450-8, 450-9, 및 450-10)은 AI 동작을 위한 신경망이 저장되는 메모리 어레이 내 블록이다. 신경망 블록(450-1, 450-2, 450-3, 450-4, 450-5, 450-6, 450- 7, 450-8, 450-9 및 450-10)은 AI 동작에서 사용되는 뉴런 및 레이어에 대한 정보를 저장할 수 있다. 신경망 블 록(450-1, 450-2, 450-3, 450-4, 450-5, 450-6, 450-7, 450-8, 450-9, 및 450-10)의 주소는 레지스터(가령, 레지스터(도 2의 232-22 및 도 3a의 332-22)) 내에 나타날 수 있다. 도 5는 본 개시 내용의 다수의 실시예에 따르는 인공 지능(AI) 가속기를 갖는 메모리 디바이스 내 예시적 인공 지능 프로세스를 예시하는 흐름도이다. AI 동작의 시작에 응답하여 AI 가속기는 입력 데이터 및 신경망 데 이터를 입력 및 신경망 블록에 각각 쓸 수 있다. AI 가속기는 입력 데이터 및 신경망 데이터를 사용하여 AI 동작을 수행할 수 있다. 결과는 임시 뱅크(544-1 및 544-2)에 저장될 수 있다. 임시 뱅크(544-1 및 544-2)는 AI 동작 동안 행렬 계산을 수행하고, 바이어스 데이터를 추가하고, 및/또는 활성화 기능을 적용하는 동안 데이터를 저장하는 데 사용될 수 있다. AI 가속기는 임시 뱅크(544-1 및 544-2) 및 바이어스 값 데이터에 저장된 AI 동작의 일부 결과를 수신하고 AI 동작 바이어스 값 데이터의 일부 결과를 사용하여 AI 동작을 수행할 수 있다. 결과는 임시 뱅크(544-1 및 544-2)에 저장될 수 있다. AI 가속기는 임시 뱅크(544-1 및 544-2)에 저장된 AI 동작의 일부 결과 및 활성화 기능 데이터를 수신하고 AI 동작의 일부 결과 및 활성화 기능 데이터를 이용해 AI 동작을 수행할 수 있다. 결과는 출력 뱅크에 저장될 수 있다. 도 6은 본 개시 내용의 다수의 실시예에 따른 메모리에서의 동작 모드를 수정하기 위한 예시적 방법을 예시하는 흐름도이다. 도 6에 기재된 방법은 예를 들어, 도 1a 및 1b에 도시된 메모리 디바이스, 가령, 메모리 디바이스 를 포함하는 메모리 시스템에 의해 수행될 수 있다. 블록에서, 방법은 메모리 시스템 제어기로부터 메모리 디바이스에서 모드 레지스터 쓰기 커맨드를 수신하 는 단계를 포함할 수 있다. 메모리 시스템 제어기는 메모리 디바이스의 동작 모드를 수정 및/또는 AI 동작을 수 행하기 위한 커맨드를 전송할 수 있다. 일부 예에서, 메모리 시스템은 메모리 디바이스의 동작 모드를 감소된 전력 소비 모드, 증가된 전력 소비 모드, 또는 전체 전력 소비 모드로 수정하기 위한 커맨드를 전송할 수 있다. 블록에서, 방법은 메모리 디바이스의 모드 레지스터를 메모리 디바이스가 정상 동작 모드에 비해 감소된 전력 소비를 갖는 동작 모드를 나타내는 값으로 쓰는 단계를 포함할 수 있다. 일부 예들에서, 메모리 디바이스 가 감소된 전력 소비량을 가질 때, 메모리 디바이스는 리프레시 동작을 수행하지 않고 커맨드 인터페이스가 메 모리 디바이스를 감소된 전력 소비 모드에 비교해 증가된 전력 소비량을 갖는 증가된 전력 소비 모드 및/또는 정상 동작 모드로 두기 위한 커맨드를 수용하기만 한다. 일부 예에서, 메모리 디바이스가 감소된 전력 소비 모드로 들어가기 전에 AI 동작이 완료될 수 있다. 전체 메모 리 디바이스는 감소된 전력 소비 모드로 들어갈 수 있거나 및/또는 메모리 디바이스는 AI 동작으로부터의 출력 을 제외하고 감소된 전력 소비 모드로 들어갈 수 있다. 예를 들어, 출력이 메모리 디바이스로부터 읽힐 때까지 출력이 리프레시될 수 있다. 메모리 디바이스로부터 출력이 읽히면 출력을 포함한 전체 메모리 디바이스가 감소 된 전력 소비 모드로 들어갈 수 있다. 블록에서, 방법은 모드 레지스터에 써진 값에 적어도 부분적으로 기초하여 메모리 디바이스의 하나 이상 의 구성요소로부터 전력 공급을 제거하는 단계를 포함할 수 있다. 일부 예에서, 메모리 디바이스의 커맨드/주소 버스로의 전력 공급이 유지될 수 있고 메모리 디바이스의 타 구성요소로부터 전력 공급이 제거될 수 있다. 메모 리 디바이스가 모드 레지스터 쓰기 또는 모드 레지스터 읽기 커맨드를 수신하기 위한 최소 전력 레벨에 적어도 부분적으로 기초하여 커맨드/주소 버스로의 전력 공급이 유지될 수 있다. 다수의 실시예에서, 메모리 디바이스 의 적어도 하나의 DRAM으로 전력이 유지될 수 있고 전력 공급이 제거되는 하나 이상의 구성요소는 메모리 디바 이스의 다른 DRAM을 포함할 수 있다. 특정 실시예가 여기에 예시되고 설명되었지만, 해당 분야의 통상의 기술자는 동일한 결과를 달성하도록 계산된 배열이 도시된 특정 실시예를 대체할 수 있음을 이해할 것이다. 본 개시 내용은 본 개시 내용의 다양한 실시예 의 변형 또는 수정을 포함하도록 의도된다. 상기 기재는 한정이 아니라, 설명을 위한 것으로 이뤄졌음이 이해되 어야 한다. 본 명세서에 특정하게 기재된 상기 실시예 및 그 밖의 다른 실시예의 조합이 상기 기재를 읽은 해당 분야의 통상의 기술자에게 자명할 것이다. 본 개시 내용의 다양한 실시예의 범위는 상기 구조 및 방법이 사용되 는 다른 응용분야를 포함한다. 따라서, 본 개시 내용의 다양한 실시예의 범위는 이하의 청구 범위 및 이러한 청 구범위에 수반되는 전체 등가물을 참조하여 결정되어야 한다. 상기의 상세한 설명에서, 다양한 특징은 개시 내용을 간소화하기 위한 목적으로 단일 실시예에서 함께 그룹 지 어진다. 이 개시 방법은 본 개시 내용의 개시된 실시예가 각각의 청구항에서 명시적으로 언급된 것보다 더 많은 특징을 사용해야 한다는 의도를 반영하는 것으로 해석되어서는 안 된다. 오히려, 이하의 청구항이 반영하는 바 와 같이, 발명의 주제는 하나의 개시된 실시예의 모든 특징보다 적다. 따라서, 이하의 청구 범위는 상세한 설명 에 포함되며, 각각의 청구 범위는 개별 실시예로서 그 자체로 존재한다.도면 도면1a 도면1b 도면2 도면3a 도면3b 도면4 도면5 도면6"}
{"patent_id": "10-2022-7009911", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1a는 본 개시 내용의 다수의 실시예에 따르는 인공 지능(AI) 가속기를 갖는 메모리 디바이스를 포함하는 컴 퓨팅 시스템의 형태를 한 장치의 블록도이다. 도 1b는 본 개시 내용의 다수의 실시예에 따르는 인공 지능(AI) 가속기를 갖는 메모리 디바이스를 갖는 컴퓨팅 시스템을 포함하는 컴퓨팅 시스템의 형태를 한 장치의 블록도이다. 도 2는 본 개시 내용의 다수의 실시예에 따르는 인공 지능(AI) 가속기를 갖는 메모리 디바이스 상의 다수의 레 지스터의 블록도이다. 도 3a 및 3b는 본 개시 내용의 다수의 실시예에 따르는 인공 지능(AI) 가속기를 갖는 메모리 디바이스 상의 다 수의 레지스터 내 다수의 비트의 블록도이다. 도 4는 본 개시 내용의 다수의 실시예에 따르는 인공 지능(AI) 가속기를 갖는 메모리 디바이스의 다수의 블록의 블록도이다. 도 5는 본 개시 내용의 다수의 실시예에 따르는 인공 지능(AI) 가속기를 갖는 메모리 디바이스 내 예시적 인공 지능 프로세스를 예시하는 흐름도이다. 도 6은 본 개시 내용의 다수의 실시예에 따른 메모리에서의 동작 모드를 수정하기 위한 예시적 방법을 예시하는 흐름도이다."}
