{"patent_id": "10-2014-0000207", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2015-0080756", "출원번호": "10-2014-0000207", "발명의 명칭": "멀티윈도우 제어 방법 및 이를 지원하는 전자 장치", "출원인": "삼성전자주식회사", "발명자": "홍순열"}}
{"patent_id": "10-2014-0000207", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "복수개의 윈도우를 표시하는 과정에 있어서,이벤트 발생에 대응하여 상기 복수개의 윈도우 중 적어도 하나의 특정 윈도우 크기를 변경하는 과정;상기 특정 윈도우의 크기가 정해진 크기 이상으로 확장되면 상기 특정 윈도우와 관련한 기능 처리를 수행하는포커싱을 할당하는 과정;을 포함하는 멀티윈도우 제어 방법."}
{"patent_id": "10-2014-0000207", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 특정 윈도우의 크기 확장에 대응하여 적어도 하나의 다른 윈도우의 크기를 감소시키는 과정;상기 적어도 하나의 다른 윈도우의 크기가 정해진 크기 이하로 감소되면 할당된 포커싱을 해제하는 과정;상기 적어도 하나의 다른 윈도우의 크기가 정해진 크기 이하로 감소되면 크기가 감소된 윈도우의 입력을 비활성화 상태로 천이시키는 과정;상기 적어도 하나의 다른 윈도우의 크기가 정해진 크기 이하로 감소되면 크기가 감소된 윈도우의 표시 효과를변경하는 과정; 중 적어도 하나의 과정을 더 포함하는 멀티윈도우 제어 방법."}
{"patent_id": "10-2014-0000207", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 크기가 감소된 윈도우 관련 이벤트를 수신하는 과정;상기 윈도우 관련 이벤트에 의해 지정된 윈도우를 정해진 크기로 확장하는 과정;상기 지정된 윈도우에 포커싱을 할당하는 과정;을 더 포함하는 멀티윈도우 제어 방법."}
{"patent_id": "10-2014-0000207", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 복수개의 윈도우들이 배치된 경계 영역에 상기 윈도우들의 크기 조정을 제어하는 핸들러를 출력하는 과정;을 더 포함하는 멀티윈도우 제어 방법."}
{"patent_id": "10-2014-0000207", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 변경하는 과정이상기 핸들러의 이동에 대응하여 상기 특정 윈도우의 크기를 변경하는 과정;을 포함하는 멀티윈도우 제어 방법."}
{"patent_id": "10-2014-0000207", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 핸들러를 터치하는 터치 이벤트에 대응하여 상기 복수개의 윈도우들을 사전 정의된 일정 비율의 크기로 조정하는 과정;을 더 포함하는 멀티윈도우 제어 방법."}
{"patent_id": "10-2014-0000207", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,공개특허 10-2015-0080756-3-상기 특정 윈도우의 포커싱을 유지하는 과정;을 더 포함하는 멀티윈도우 제어 방법."}
{"patent_id": "10-2014-0000207", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제4항에 있어서,상기 변경하는 과정이상기 핸들러의 이동 이벤트를 수신하는 과정;상기 핸들러의 이동 이벤트에 대응하여 상기 특정 윈도우를 확장하는 과정;을 포함하는 멀티윈도우 제어 방법."}
{"patent_id": "10-2014-0000207", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 포커싱 할당을 만족하는 윈도우의 정해진 크기를 지시하는 가이드 정보를 출력하는 과정;을 더 포함하는멀티윈도우 제어 방법."}
{"patent_id": "10-2014-0000207", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 특정 윈도우 관련 메뉴 아이템을 상기 윈도우들의 경계 영역에 인접된 영역에 배치하는 과정;윈도우 스위칭 이벤트를 수신하는 과정;상기 윈도우 스위칭 이벤트에 대응하여 상기 특정 윈도우를 다른 윈도우가 배치되었던 위치로 이동시키는 과정;상기 메뉴 아이템을 상기 특정 윈도우와 함께 이동시키면서 윈도우들의 경계 영역에 인접된 영역에 배치하는 과정;을 더 포함하는 멀티윈도우 제어 방법."}
{"patent_id": "10-2014-0000207", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "전자 장치에 있어서,복수개의 윈도우를 표시하는 표시 모듈;이벤트 발생에 대응하여 상기 복수개의 윈도우 중 적어도 하나의 특정 윈도우 크기를 변경하면서 상기 특정 윈도우의 크기가 정해진 크기 이상으로 확장되면 상기 특정 윈도우와 관련한 기능 처리를 수행하는 포커싱을 할당하는 제어 모듈;을 포함하는 멀티윈도우 제어를 지원하는 전자 장치."}
{"patent_id": "10-2014-0000207", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 제어 모듈이 상기 특정 윈도우의 크기 확장에 대응하여 적어도 하나의 다른 윈도우의 크기를 감소시키며, 상기 적어도 하나의 다른 윈도우의 크기가 정해진 크기 이하로 감소되면 할당된 포커싱을 해제하는 멀티윈도우 제어를 지원하는전자 장치."}
{"patent_id": "10-2014-0000207", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 제어 모듈이 상기 다른 윈도우의 크기가 정해진 크기 이하로 감소되면 크기가 감소된 적어도 하나의 윈도우의 입력을 비활성화 상태로 천이시키는 멀티윈도우 제어를 지원하는 전자 장치."}
{"patent_id": "10-2014-0000207", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12항에 있어서,공개특허 10-2015-0080756-4-상기 표시 모듈이 상기 다른 윈도우의 크기가 정해진 크기 이하로 감소되면 크기가 감소된 적어도 하나의 윈도우의 표시 효과를변경하여 표시하는 멀티윈도우 제어를 지원하는 전자 장치."}
{"patent_id": "10-2014-0000207", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제12항에 있어서,상기 제어 모듈이 상기 크기가 감소된 윈도우 관련 이벤트를 수신하면, 상기 윈도우 관련 이벤트에 의해 지정된 윈도우를 정해진크기로 확장하고 상기 지정된 윈도우에 포커싱을 할당하는 멀티윈도우 제어를 지원하는 전자 장치."}
{"patent_id": "10-2014-0000207", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제11항에 있어서,상기 표시 모듈이 상기 복수개의 윈도우들이 배치된 경계 영역에 상기 윈도우들의 크기 조정을 제어하는 핸들러를 출력하는 멀티윈도우 제어를 지원하는 전자 장치."}
{"patent_id": "10-2014-0000207", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서,상기 제어 모듈이 상기 핸들러와 관련한 핸들러 터치 이벤트에 대응하여 상기 복수개의 윈도우들을 사전 정의된 일정 비율의 크기로 조정하고 상기 특정 윈도우의 포커싱을 유지하도록 제어하는 멀티윈도우 제어를 지원하는 전자 장치."}
{"patent_id": "10-2014-0000207", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제16항에 있어서,상기 제어 모듈이 상기 핸들러와 관련한 핸들러 이동 이벤트에 대응하여 크기가 감소된 윈도우를 확장하고, 확장된 윈도우가 정해진 크기 이상으로 확장되면 확장된 윈도우로 포커싱을 변경하는 멀티윈도우 제어를 지원하는 전자 장치."}
{"patent_id": "10-2014-0000207", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제11항에 있어서,상기 표시 모듈이 상기 포커싱 할당을 만족하는 윈도우의 정해진 크기를 지시하는 가이드 정보를 출력하는 멀티윈도우 제어를 지원하는 전자 장치."}
{"patent_id": "10-2014-0000207", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제11항에 있어서,상기 표시 모듈이 상기 특정 윈도우 관련 메뉴 아이템을 상기 윈도우들의 경계 영역에 인접된 영역에 배치하고 윈도우 스위칭 이벤트에 대응하여 상기 특정 윈도우를 다른 윈도우가 배치되었던 위치로 이동시키면서 상기 메뉴 아이템을 윈도우들의 경계 영역에 인접된 영역에 표시하는 멀티윈도우 제어를 지원하는 전자 장치."}
{"patent_id": "10-2014-0000207", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 멀티윈도우에 관한 것으로, 다양한 실시 예는 복수개의 윈도우를 표시하는 과정, 이벤트 발생에 대응 하여 상기 복수개의 윈도우 중 어느 하나의 특정 윈도우 크기를 변경하는 과정, 상기 특정 윈도우의 크기가 정해 진 크기 이상으로 확장되면 상기 특정 윈도우와 관련한 기능 처리를 수행하는 포커싱을 할당하는 과정을 포함하 는 멀티윈도우 제어 방법과 이를 지원하는 전자 장치를 개시할 수 있다. 여기서 본 발명이 상술한 구성에 한정되 는 것은 아니며, 발명의 상세한 설명에 기재된 다양한 실시 예들로서 이해되어야 할 것이다."}
{"patent_id": "10-2014-0000207", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시 예들은 전자 장치의 멀티윈도우 제어에 관한 것이다."}
{"patent_id": "10-2014-0000207", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 디지털 기술의 발달과 함께 이동통신 단말기, PDA(Personal Digital Assistant), 전자수첩, 스마트 폰, 태블릿 PC(Personal Computer) 등과 같이 이동하면서 통신 및 개인정보 처리가 가능한 전자 장치가 다양하게 출 시되고 있다. 이러한 전자 장치는 각자의 전통적인 고유 영역에 머무르지 않고 다른 단말들의 영역까지 아우르 는 모바일 컨버전스(mobile convergence) 단계에 이르고 있다. 한편, 전자 장치는 기능 수행에 대응하는 화면을 윈도우 형태로 제공하고 있다. 그리고 전자 장치는 복수의 기 능 수행에 대응하여 각각의 윈도우를 표시할 수 있다."}
{"patent_id": "10-2014-0000207", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "그런데, 종래 전자 장치는 복수개의 윈도우를 표시부의 사전 정의된 임의의 위치에 출력하도록 설계되고 있다. 이에 따라, 사용자가 복수개의 윈도우를 운용하는 환경에서, 적절한 정보 확인을 위하여 각각의 윈도우들의 크 기와 위치 등을 조절해야 하는 불편함이 있다. 따라서, 본 발명의 다양한 실시 예에서는 복수개의 윈도우들의 표시 방식을 적응적으로 제어함으로써 사용자의 윈도우 조정을 최소화하여 보다 간편한 윈도우 이용이 가능하도록 지원하는 멀티윈도우 제어 방법 및 이를 지원 하는 전자 장치를 제공한다."}
{"patent_id": "10-2014-0000207", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 과제를 해결하기 위한 본 발명의 다양한 실시 예 중 한 실시 예의 전자 장치는 복수개의 윈도우를 표시하는 표시 모듈, 이벤트 발생에 대응하여 상기 복수개의 윈도우 중 어느 하나의 특정 윈도우 크기를 변경하 면서 상기 특정 윈도우의 크기가 정해진 크기 이상으로 확장되면 상기 특정 윈도우와 관련한 기능 처리를 수행 하는 포커싱을 할당하는 제어 모듈을 포함할 수 있다. 다양한 실시 예에 따르면, 본 발명의 일실시 예의 멀티윈도우 제어 방법은 복수개의 윈도우를 표시하는 과정, 이벤트 발생에 대응하여 상기 복수개의 윈도우 중 어느 하나의 특정 윈도우 크기를 변경하는 과정, 상기 특정 윈도우의 크기가 정해진 크기 이상으로 확장되면 상기 특정 윈도우와 관련한 기능 처리를 수행하는 포커싱을 할 당하는 과정을 포함할 수 있다. 전술한 바와 같은 내용들은 당해 분야 통상의 지식을 가진 자가 후술되는 본 발명의 다양한 실시 예의 구체적인 설명으로부터 보다 잘 이해할 수 있도록 하기 위하여 다양한 실시 예들의 특징들 및 기술적인 장점들을 다소 넓 게 약술한 것이다. 이러한 특징들 및 장점들 이외에도 본 발명의 청구범위의 주제를 형성하는 다양한 실시 예들 의 추가적인 특징들 및 장점들이 후술되는 구체적인 설명으로부터 잘 이해될 것이다."}
{"patent_id": "10-2014-0000207", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상술한 바와 같이 본 발명의 다양한 실시 예들에서 제안하는 멀티윈도우 제어 방법 및 이를 지원하는 전자 장치 에 따르면, 본 발명의 다양한 실시 예는 멀티윈도우 조작을 최소화하면서도 적절한 기능 운용이 가능하도록 지 원한다."}
{"patent_id": "10-2014-0000207", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명(present disclosure)을 설명한다. 본 발명은 다양한 변경을 가할 수 있 고 여러 가지 실시 예를 가질 수 있는 바, 특정 실시 예들이 도면에 예시되고 관련된 상세한 설명이 기재되어 있다. 그러나, 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위 에 포함되는 모든 변경 및/또는 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하 여, 유사한 구성요소에 대해서는 유사한 참조 부호가 사용되었다. 본 발명 가운데 사용될 수 있는“포함한다” 또는 “포함할 수 있다” 등의 표현은 발명된 해당 기능, 동작 또 는 구성요소 등의 존재를 가리키며, 추가적인 하나 이상의 기능, 동작 또는 구성요소 등을 제한하지 않는다. 또 한, 본 발명에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 발명에서 “또는” 등의 표현은 함께 나열된 단어들의 어떠한, 그리고 모든 조합을 포함한다. 예를 들어, “ A 또는 B”는, A를 포함할 수도, B를 포함할 수도, 또는 A와 B 모두를 포함할 수도 있다. 본 발명 가운데 “제 1,”“제2,”“첫째,”또는“둘째,”등의 표현들이 본 발명의 다양한 구성요소들을 수식할 수 있지만, 해당 구성요소들을 한정하지 않는다. 예를 들어, 상기 표현들은 해당 구성요소들의 순서 및/또는 중 요도 등을 한정하지 않는다. 상기 표현들은 한 구성요소를 다른 구성요소와 구분 짓기 위해 사용될 수 있다. 예 를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 어떤 구성요소가 다른 구성요소에 \"연계되어”, “연결되어\" 또는 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속 되어\" 있다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해될 수 있어야 할 것이다. 본 발명에서 사용한 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일 반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥 상 가지는 의미와 일치하는 의 미를 가지는 것으로 해석되어야 하며, 본 발명에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적 인 의미로 해석되지 않는다. 본 발명에 따른 전자 장치는, 표시 기능을 지원할 수 있는 장치일 수 있다. 예를 들면, 전자 장치는 스마트 폰 (smartphone), 태블릿 PC(tablet personal computer), 이동 전화기(mobile phone), 화상전화기, 전자북 리더기 (e-book reader), 데스크탑 PC(desktop personal computer), 랩탑 PC(laptop personal computer), 넷북 컴퓨터 (netbook computer), PDA(personal digital assistant), PMP(portable multimedia player), MP3 플레이어, 모 바일 의료기기, 카메라(camera), 또는 웨어러블 장치(wearable device)(예: 전자 안경과 같은 head-mounted- device(HMD), 전자 의복, 전자 팔찌, 전자 목걸이, 전자 앱세서리(appcessory), 전자 문신, 또는 스마트 와치 (smartwatch))중 적어도 하나를 포함할 수 있다. 어떤 실시 예들에 따르면, 전자 장치는 표시 기능을 갖춘 스마트 가전 제품(smart home appliance)일 수 있다. 스마트 가전 제품은, 예를 들자면, 전자 장치는 텔레비전, DVD(digital video disk) 플레이어, 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스(set-top box), TV 박스(예를 들면, 삼성 HomeSyncTM, 애플TVTM, 또는 구글 TVTM), 게임 콘솔(game consoles), 전자 사전, 전자 키, 캠코더(camcorder), 또는 전자 액자 중 적어도 하나를 포함할 수 있다. 어떤 실시 예들에 따르면, 전자 장치는 각종 의료기기(예: MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 초음파기 등), 네비게이션(navigation) 장치, GPS 수신기(global positioning system receiver), EDR(event data recorder), FDR(flight data recorder), 자동차 인포테인먼트(infotainment) 장치, 선박용 전자 장비(예: 선박용 항법 장치 및 자이로 콤파 스 등), 항공 전자기기(avionics), 보안 기기, 차량용 헤드 모듈, 산업용 또는 가정용 로봇, 금융 기관의 ATM(automatic teller뭩 machine) 또는 상점의 POS(point of sales) 중 적어도 하나를 포함할 수 있다. 어떤 실시 예들에 따르면, 전자 장치는 표시 기능을 포함한 가구(furniture) 또는 건물/구조물의 일부, 전자 보 드(electronic board), 전자 사인 입력장치(electronic signature receiving device), 프로젝터(projector), 또는 각종 계측기기(예: 수도, 전기, 가스, 또는 전파 계측 기기 등) 중 적어도 하나를 포함할 수 있다. 본 발 명에 따른 전자 장치는 전술한 다양한 장치들 중 하나 또는 그 이상의 조합일 수 있다. 또한, 본 개세에 따른 전자 장치는 플렉서블 장치일 수 있다. 또한, 본 발명에 따른 전자 장치는 전술한 기기들에 한정되지 않음은 당 업자에게 자명하다. 이하, 첨부된 도면을 참조하여 다양한 실시 예에 따른 전자 장치에 대해서 살펴본다. 다양한 실시 예에서 이용 되는 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공지능 전자 장치) 를 지칭할 수 있다. 또한, 이하 설명에서 윈도우는 전자 장치의 기능 실행에 따른 정보가 출력되는 일정 영역일 수 있다. 여기서 정 보는 기능 실행과 관련된 다양한 화면 요소를 포함할 수 있다. 예컨대, 정보는 텍스트, 정지 영상 또는 동영상 이미지, 아이콘, 가상 키버튼, 슬라이드 바, 진행 바, 리스트 항목, 썸네일 항목 등 다양한 아이템 중 적어도 하나를 포함할 수 있다. 한 실시 예에 따르면, 윈도우는 배경 화면 상에 새로운 레이어(Layer)의 형태로 출력될 수 있다. 멀티윈도우는 배경 화면의 상부 레이어 영역을 분할하고, 분할된 레이어 영역 상에 복수의 윈도우를 출력하여 구성할 수 있다. 또는 멀티윈도우는 단일 윈도우를 출력한 상태에서 단일 윈도우의 일부 영역을 밀어 올리거나 일정 크기로 조정을 수행하고 이에 대응하여 다른 윈도우를 출력하여 구성할 수도 있다. 다양한 실시 예에 따르면, 윈도우는 배경 화면의 일정 영역을 새 정보 표시를 위하여 갱신함으로써 형성할 수 있다. 예컨대, 전자 장치는 배경 화면의 일부 영역들에 표시된 정보들을 제거하고 해당 영역에 특정 기능 실행 에 따른 정보를 표시하거나 일부 영역들에 기능 실행에 따른 정보를 덮어쓰기 하여 멀티윈도우를 구성할 수 있 다. 멀티윈도우는 배경 화면을 복수개의 영역으로 분할하고, 분할된 영역들에 복수의 기능 실행에 따른 정보를 표시하거나 덮어쓰기 하여 구성할 수 있다. 상술한 바와 같이, 본 발명의 다양한 실시 예들에서 설명되는 멀티윈도우 제어 방법 및 이를 지원하는 전자 장 치는 전자 장치에서 특정 기능 실행에 따라 정보를 표시하는 영역을 윈도우로서 지시하는 것으로, 본문에서 기 재하는 “윈도우”의 명칭에 한정되는 것은 아니다. 따라서, 윈도우는 기능 실행에 따른 정보 표시 영역, 정보 표시 레이어, 팝업, 플레이어, 스크린 등 다양한 용어로 이해될 수 있을 것이다. 도 1은 본 발명의 일실시 예에 따른 전자 장치를 나타낸 도면이다. 도 1을 참조하면, 전자 장치 100은 통신 모듈 110, 입력 모듈 120, 오디오 모듈 130, 표시 모듈 140, 저장 모듈 150, 제어 모듈 160을 포함할 수 있다. 이러한 구성의 전자 장치 100은 멀티윈도우 출력 환경에서 특정 윈도우의 크기가 변경되거나 위치가 변경되면 특정 윈도우의 기능 처리와 관련한 윈도우 포커싱을 자동으로 변경할 수 있다. 윈도우 포커싱 상태는 해당 윈도 우와 관련한 입력 이벤트 수신 대기 상태, 해당 윈도우와 관련된 영상 신호 출력, 해당 윈도우와 관련된 오디오 신호 출력, 해당 윈도우와 관련된 통신 유닛의 활성화, 해당 윈도우와 관련된 화면 효과 적용 중 적어도 하나를 포함할 수 있다. 다양한 실시 예에 따르면, 전자 장치 100은 특정 윈도우가 다른 윈도우와의 위치가 교체되는 윈도우 스위칭이 발생하면, 윈도우 포커싱을 조정할 수 있다. 다양한 실시 예에 따르면, 전자 장치 100은 멀티윈도우의 크기 조 절과 관련하여 표시 모듈 140에 마련된 가상의 핸들러와 관련한 이벤트가 발생하면 멀티윈도우의 크기를 변경할 수 있다. 이 과정에서 전자 장치 100은 변경된 멀티윈도우의 크기에 대응하여 윈도우 포커싱을 자동 조정할 수 있다. 다양한 실시 예에 따른 윈도우는 실행되는 프로그램의 종류에 따라 동일한 구조 또는 다른 구조를 가질 수 있다. 예컨대, 윈도우는 앱이나 위젯 등 프로그램 타입 별로 윈도우를 구성하는 탬플릿 구조가 다를 수 있다. 또한 윈도우를 구성하는 영역의 크기, 복수의 영역들의 배치, 영역들의 개수, 적어도 하나의 영역에 포함되는 가상 키버튼의 종류와 개수 등이 기능 실행에 따른 프로그램별로 다르게 또는 유사하거나 동일하게 정의될 수있다. 일실시 예에 따른 멀티윈도우 환경은 복수개의 윈도우들 중 적어도 두 개의 분할된 화면 영역에 각각 배치되는 형태일 수 있다. 그리고 복수개의 윈도우들은 핸들러의 조절에 대응하여 그 크기가 상호 조율될 수 있다. 예컨 대, 제1 윈도우와 제2 윈도우가 표시 모듈 140에 배치된 상태에서, 핸들러는 제1 윈도우와 제2 윈도우 사이에 배치될 수 있다. 이때, 핸들러 조작 이벤트에 대응하여 제1 윈도우의 크기가 변경되면, 제2 윈도우의 크기가 제 1 윈도우의 크기를 보상(offset)하는 형태로 변경될 수 있다. 통신 모듈 110은 전자 장치 100의 통신 기능과 관련된 적어도 하나의 통신 유닛을 포함할 수 있다. 예컨대, 통 신 모듈 110은 이동통신 유닛, DMB 모듈이나 DVB-H 모듈과 같은 방송수신 유닛, 블루투스 모듈인 지그비 모듈 또는 NEC 모듈과 같은 근거리 통신 유닛, 와이파이 통신 유닛 등 다양한 통신 유닛을 포함할 수 있다. 통신 모 듈 110 운용에 대응하여 전자 장치 100은 특정 윈도우를 표시 모듈 140에 출력할 수 있다. 예컨대, 전자 장치 100은 통신 모듈 110의 음성 통화 기능 지원과 관련한 통화 기능 관련 윈도우를 표시 모듈 140에 출력할 수 있 다. 다양한 실시 예에 따르면, 전자 장치 100은 통신 모듈 110의 웹 접속 기능 지원과 관련한 웹 브라우저 윈도 우, 통신 모듈 110의 방송 수신 기능과 관련한 방송 화면 윈도우, 통신 모듈 110의 스트리밍 데이터 수신에 따 른 영상 윈도우, 근거리 통신 채널 형성에 따른 화면 윈도우를 표시 모듈 140에 출력할 수 있다. 통신 모듈 110 은 상술한 윈도우와 관련된 데이터를 타 전자 장치나 서버 장치로부터 수신하여 제어 모듈 160에 제공할 수 있 다. 상기 전자 장치 100은 상술한 통신 모듈 110 기반의 기능들이 복합적으로 수행되는 경우, 또는 다른 기능들과 함께 복합적으로 수행되는 경우 복수개의 윈도우를 표시 모듈 140에 출력할 수 있다. 전자 장치 100은 통신 모 듈 110 기반으로 복수개의 윈도우들이 출력되는 경우, 각 기능에 대응하는 윈도우들의 크기 및 위치 조정을 수 행할 수 있다. 예컨대, 전자 장치 100은 통신 모듈 110 기반으로 실행되는 복수 개의 윈도우들을 동일 크기를 가지도록 표시 모듈 140에 출력할 수 있다. 전자 장치 100의 제어 모듈 160은 복수개의 윈도우들 중 특정 윈도 우에 대한 포커싱 처리를 수행할 수 있다. 예컨대, 제어 모듈 160은 사용자가 선택한 특정 윈도우 또는 실행 순 서에 따라 최근 선택된 특정 윈도우에 대한 포커싱 처리를 수행할 수 있다. 특정 윈도우가 포커싱되는 경우 해 당 윈도우에 대응하는 통신 모듈과 관련된 신호 처리가 수행될 수 있다. 일실시 예에 따르면, 전자 장치 100은 방송 수신 기능 관련 제1 윈도우와 스트리밍 서비스 관련 제2 윈도우를 출력할 수 있다. 이때 제어 모듈 160은 제1 윈도우가 포커싱되면 방송 수신 유닛이 수신한 영상 신호 및 오디오 신호를 출력하도록 제어할 수 있다. 이 과정에서 제어 모듈 160은 스트리밍 서비스와 관련하여 근거리 통신 유 닛이 수신한 영상 신호 및 오디오 신호의 출력을 제한할 수 있다. 예컨대, 제어 모듈 160은 근거리 통신 유닛이 수신한 영상 신호는 출력하고, 오디오 신호의 출력을 제한할 수 있다. 또는 제어 모듈 160은 근거리 통신 유닛 을 비활성화하고, 비활성화 전에 근거리 통신 유닛이 수신한 일정 영상 신호를 제2 윈도우로 출력하도록 제어할 수도 있다. 입력 모듈 120은 전자 장치 100의 입력 신호를 생성할 수 있다. 입력 모듈 120은 예를 들면, 키패드(key pad), 돔 스위치(dome switch), 터치패드(정압/정전), 조그 휠(jog wheel), 조그 스위치(jog switch) 중 적어도 하나 를 포함할 수 있다. 입력 모듈 120은 전자 장치 100의 외부에 버튼 형태로 구현될 수 있으며, 일부 버튼들은 터 치 패널(touch panel)로 구현될 수도 있다. 한 실시 예에 따르면, 입력 모듈 120은 숫자 또는 문자 정보를 입력 받고 각종 기능들을 설정하기 위한 다수의 키들을 포함할 수 있다. 이러한 키들은 메뉴 불러오기 키, 화면 온/ 오프 키, 전원 온/오프 키 및 볼륨 조절키, 홈 키 등을 포함할 수 있다. 입력 모듈 120은 저장 모듈 150에 저장된 적어도 하나의 앱 151 활성화를 요청하는 입력 신호, 멀티윈도우와 핸 들러가 표시 모듈 140에 출력된 상태에서 핸들러 조작과 관련한 입력 신호, 윈도우들 간의 스위칭 제어를 요청 하는 입력 신호를 생성할 수 있다. 입력 모듈 120은 멀티윈도우가 출력된 상태에서 특정 윈도우 제거를 요청하 는 입력 신호, 또는 새로운 윈도우 출력을 추가로 요청하는 추가 입력 신호를 포함할 수 있다. 추가 입력 신호 는 새로운 앱 151의 활성화 요청과 관련한 신호일 수 있다. 입력 모듈 120은 생성된 입력 신호를 제어 모듈 160 에 전달할 수 있다. 오디오 모듈 130은 전자 장치 100의 오디오 신호를 처리할 수 있다. 예컨대, 오디오 모듈 130은 제어 모듈 160 으로부터 입력 받은 오디오 신호를 스피커(SPK, speaker)로 전송할 수 있다. 오디오 모듈 130은 마이크(MIC, microphone)로부터 입력 받은 음성 등의 오디오 신호를 제어 모듈 160으로 전달하는 기능을 수행할 수 있다. 오 디오 모듈 130은 마이크로부터 수신되는 음성 등의 오디오 신호를 디지털 신호로 변환하여 제어 모듈 160으로 전달할 수 있다. 한 실시 예에 따르면, 오디오 모듈 130은 멀티윈도우가 출력된 환경에서 특정 윈도우와 관련된 오디오 신호를 출력할 수 있다. 여기서 오디오 모듈 130은 멀티윈도우 중 포커싱된 특정 윈도우의 오디오 신호를 출력할 수 있 다. 윈도우 포커싱이 다른 윈도우로 변경되면 오디오 모듈 130은 변경된 윈도우와 관련한 오디오 신호를 출력할 수 있다. 다양한 실시 예에 따르면, 오디오 모듈 130은 멀티윈도우 출력 환경에서 핸들러 조작 또는 윈도우 스위칭과 관 련한 동작이 발생하면 그에 대응하는 안내음이나 효과음을 출력할 수 있다. 또한 오디오 모듈 130은 멀티윈도우 출력 환경에서 새로운 윈도우가 추가로 출력되는 경우 새로 출력된 윈도우와 관련한 오디오 신호를 자동으로 출 력할 수 있다. 또는 오디오 모듈 130은 핸들러 조작을 통하여 윈도우의 크기가 정해진 일정 크기 이상으로 변경 된 윈도우와 관련한 오디오 신호를 출력할 수 있다. 표시 모듈 140에 출력 중인 복수개의 윈도우에 대한 오디오 신호 출력 방식은 설계자 방식이나 사용자 설정 등에 따라 조정되거나 오디오 신호 출력이 생략될 수도 있다. 표시 모듈 140은 전자 장치 100에서 처리되는 기능에 대응하는 다양한 윈도우 중 적어도 하나를 표시(출력)한다. 예를 들어, 전자 장치 100이 통화 모드인 경우 통화와 관련된 사용자 인터페이스(UI, User Interface) 또는 그래픽 사용자 인터페이스(GUI, Graphical UI)를 윈도우 형태로 표시한다. 또한 표시 모듈 140 은 전자 장치 100이 영상통화 모드 또는 촬영 모드인 경우에는 촬영 또는/및 수신된 영상 또는 UI, GUI를 윈도 우 형태로 표시한다. 한 실시 예에 따르면, 표시 모듈 140은 전자 장치 100에서 실행되는 다양한 기능(또는 어 플리케이션)들에 대한 앱 윈도우를 표시한다. 그리고 표시 모듈 140은 상기 앱 윈도우에서 제어 모듈 160의 제 어에 따라 가상 입력 장치(예컨대, 가상의 터치패드)를 활성화하여 나타내고, 상기 가상 입력 장치를 통해 입력 되는 신호를 상기 제어 모듈 160으로 전달한다. 한 실시 예에 따르면, 표시 모듈 140은 적어도 하나의 앱 151에 대응하여 적어도 하나의 앱 윈도우를 출력할 수 있다. 앱 윈도우는 특정 기능 지원과 관련하여 마련된 프로그램 활성화에 대응하는 화면 요소일 수 있다. 예컨 대, 앱 윈도우는 통화 기능 실행에 따른 통화 기능 관련 윈도우일 수 있다. 앱 윈도우는 메모 기능 실행에 따른 메모 기능 관련 윈도우, 동영상 재생에 따른 동영상 관련 윈도우, 방송 수신 기능 관련 윈도우, 파일 편집 기능 관련 윈도우, 갤러리 기능 관련 윈도우, 메시지 작성 윈도우 등 다양한 윈도우를 포함할 수 있다. 다양한 실시 예에 따르면, 앱 윈도우는 핸들러 조작과 관련한 이벤트에 대응하여 크기가 변경될 수 있다. 예컨 대, 제1 기능의 앱 윈도우와 제2 기능의 앱 윈도우가 출력된 상태에서, 제1 기능의 앱 윈도우의 크기가 핸들러 조작에 따라 변경되면 제2 기능의 앱 윈도우의 크기는 제1 기능의 앱 윈도우 크기에 대응하여 변경될 수 있다. 한 실시 예에 따르면, 표시 모듈 140은 제1 앱 윈도우 크기가 커지는 만큼 감소된 크기의 제2 기능의 앱 윈도우 를 표시할 수 있다. 또는 표시 모듈 140은 제1 앱 윈도우 크기가 작아진 만큼 커진 제2 기능의 앱 윈도우를 표 시할 수 있다. 이 과정에서 표시 모듈 140은 제1 앱 윈도우 또는 제2 앱 윈도우에 표시되는 정보의 양 또는 크 기를 변경할 수 있다. 상술한 설명에서 제1 기능과 제2 기능은 전자 장치 100에서 지원되는 특정 프로그램 관련 기능 또는 특정 위젯 관련 기능일 수 있다. 예컨대, 제1 기능과 제2 기능은 카메라 관련 기능, 메모 기능, 문서 편집 기능, 검색 기 능, 영상 재생 기능, 채팅 기능 등 다양한 기능이 될 수 있다. 멀티윈도우 환경에서 제1 기능과 관련한 윈도우 의 크기가 일정 크기 이상 변경되면 포커싱이 변경될 수 있다. 표시 모듈 140은 제어 모듈 160 제어에 따라 포 커싱된 윈도우에 특정 표시 효과를 제공할 수 있다. 예컨대, 포커싱된 윈도우는 하일라이트 될 수 있다. 표시 모듈 140은 제어 모듈 160 제어에 따라 포커싱 되지 않은 윈도우 또는 일정 크기 이하의 윈도우에 특정 표시 효 과를 제공할 수 있다. 예컨대, 포커싱 되지 않은 윈도우 또는 일정 크기 이하의 윈도우는 흐려지거나(diming), 색상이나 밝기가 어두워질 수 있다. 표시 모듈 140은 전자 장치 100의 회전 방향(또는 놓인 방향)에 따라 가로모드에 의한 화면 표시, 세로모드에 의한 화면 표시 및 가로모드와 세로모드 간의 변화에 따른 화면 전환 표시를 지원할 수 있다. 표시 모듈 140은 멀티윈도우 환경에서 가로모드 또는 세로모드 변경이 발생하면 그에 대응하여 윈도우들의 배치 형태 또는 표시 형태를 변경할 수 있다. 또한 표시 모듈 140은 멀티윈도우 환경에서 윈도우들 간의 위치 바꿈에 해당하는 윈도 우 스위칭이 발생하면, 메뉴 위치를 변경하는 메뉴 정렬을 수행할 수 있다. 예컨대, 표시 모듈 140은 핸들러를 포함하는 핸들러 축을 기준으로 메뉴 정렬을 수행할 수 있다. 표시 모듈 140은 액정 디스플레이(LCD, Liquid Crystal Display), 박막 트랜지스터 액정 디스플레이(TFT LCD, Thin Film Transistor-LCD), 발광 다이오드(LED, Light Emitting Diode), 유기 발광 다이오드(OLED, Organic LED), 능동형 OLED(AMOLED, Active Matrix OLED), 플렉서블 디스플레이(flexible display), 벤디드 디스플레이 (bended display), 그리고 3차원 디스플레이(3D display) 중에서 적어도 하나를 포함할 수 있다. 이들 중 일부디스플레이는 외부를 볼 수 있도록 투명형 또는 광투명형으로 구성되는 투명 디스플레이(transparent display) 로 구현될 수 있다. 또한 표시 모듈 140은 터치 패널을 포함하는 터치스크린(touchscreen)으로서 마련되어 출력 장치 이외에 입력 장치로도 사용될 수 있다. 터치 패널은 표시 모듈 140의 특정 부위에 가해진 압력 또는 표시 모듈 140의 특정 부위에 발생하는 정전 용량 등의 변화를 전기적인 입력신호로 변환하도록 구성될 수 있다. 터치 패널은 터치되 는 위치 및 면적뿐만 아니라, 터치 시의 압력까지도 검출할 수 있도록 구성될 수 있다. 한편, 앞서 언급한 바와 같이 본 발명의 표시 모듈 140은 터치패널 및 표시패널을 포함하여 구성된다. 터치패널은 표시패널에 안착 (place on the display unit)될 수 있다. 터치패널은 표시패널 위에 위치하는 애드 온 타입(add-on type)이나 표시패널 내에 삽입되는 온 셀 타입(on-cell type) 또는 인 셀 타입(in-cell type)으로 구현될 수 있다. 터치패 널은 표시 모듈 140에 대한 사용자의 제스처에 응답하는 사용자 입력을 제어 모듈 160으로 전달한다. 여기서 손 가락이나 터치 펜 등 터치 수단에 의해 발생한 사용자 입력은 터치, 멀티 터치, 탭(Tap), 더블 탭(Double Tap), 롱 탭(Long tap), 탭 앤 터치(Tap & touch), 드래그(Drag), 플릭(Flick), 프레스(Press), 핀치인(pinch in) 및 핀치아웃(pinch out) 등을 포함할 수 있다. 상술한 사용자 입력은 멀티윈도우 출력을 요청하는 터치 입력, 멀티 윈도우 출력 상태에서 핸들러 조작과 관련한 터치 입력, 윈도우 스위칭과 관련한 터치 입력 등으로 정의되어 이 용될 수 있다. 저장 모듈 150은 제어 모듈 160의 처리 및 제어를 위한 앱 151을 저장할 수 있다. 앱 151은 전자 장치 100이 지원하는 다양한 기능을 지원하는 프로그램 루틴들을 포함할 수 있다. 예컨대, 앱 151은 음악 재생 기능을 지원하는 앱, 동영상 재생 기능을 지원하는 앱, 파일 편집 기능 앱, 카메라 기능 앱, 채팅 기능 앱, 게임 기능 앱, 알람 앱, 웹 브라우저 앱, 갤러리 앱, 계산기 앱, 음성 검색 앱, 지도 앱, 날씨 앱 등 다양한 앱을 포함할 수 있다. 상기 앱 151은 실행 요청에 대응하여 활성화되고 그에 대응하는 화면을 윈 도우 형태로 표시 모듈 140에 출력할 수 있다. 상기 앱 151은 메뉴 항목으로 제공되거나, 대기 화면이나 메뉴 화면 상에 아이콘 형태로 제공될 수 있다. 여기서 아이콘은 일정 크기를 가지거나 또는 설계 형태에 따라 다양 한 크기를 가질 수 있다. 상술한 저장 모듈 150은 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), 마이크로 타입(micro type), 및 카드 타입(예컨대, SD 카드(Secure Digital Card) 또는 XD 카드(eXtream Digital Card)) 등의 메모리와, 램(RAM, Random Access Memory), SRAM(Static RAM), 롬(ROM, Read-Only Memory), PROM(Programmable ROM), EEPROM(Electrically Erasable PROM), 자기 메모리(MRAM, Magnetic RAM), 자기 디스 크(magnetic disk), 및 광디스크(optical disk) 타입의 메모리 중 적어도 하나의 타입의 기록 매체(storage medium)를 포함할 수 있다. 전자 장치 100은 인터넷 상에서 상기 저장 모듈 150의 저장 기능을 수행하는 웹 스 토리지(web storage)와 관련되어 동작할 수도 있다. 제어 모듈 160은 저장 모듈 150에 저장된 적어도 하나의 앱 151과 관련한 대기 화면이나 메뉴 화면 출력을 지원 할 수 있다. 제어 모듈 160은 대기 화면이나 메뉴 화면에서 적어도 하나의 특정 앱 151 선택에 대응하여 적어도 하나의 윈도우를 출력할 수 있다. 예컨대, 제어 모듈 160은 앱 151선택에 대응하여 앱 윈도우를 출력할 수 있다. 제어 모듈 160은 멀티윈도우 환경 예컨대 복수개의 앱 윈도우 출력 환경을 지원할 수 있다. 일실시 예에 따르면, 제어 모듈 160은 멀티윈도우 환경에서 특정 윈도우의 크기 변경에 따른 포커싱 처리와 윈도우 스위칭 처리와 관련하여 도 2에 도시된 바와 같은 구성을 포함할 수 있다. 한편, 본 발명에서 설명되는 다양한 실시 예들은 소프트웨어(software), 하드웨어(hardware) 또는 이들의 조합 된 것을 이용하여 컴퓨터(computer) 또는 이와 유사한 장치로 읽을 수 있는 기록 매체 내에서 구현될 수 있다. 하드웨어적인 구현에 의하면, 본 발명에서 설명되는 실시 예들은 ASICs(Application Specific Integrated Circuits), DSPs(digital signal processors), DSPDs(digital signal processing devices), PLDs(programmable logic devices), FPGAs(field programmable gate arrays), 프로세서(processors), 제어기 (controllers), 마이크로 컨트롤러(micro-controllers), 마이크로프로세서(microprocessors), 기타 기능 수행 을 위한 전기적인 유닛(unit) 중 적어도 하나를 이용하여 구현될 수 있다. 일부의 경우에 본 명세서에서 설명되 는 실시 예들이 제어 모듈 160 자체로 구현될 수 있다. 소프트웨어적인 구현에 의하면, 본 명세서에서 설명되는 절차 및 기능과 같은 실시 예들은 별도의 소프트웨어 모듈들로 구현될 수 있다. 상기 소프트웨어 모듈들 각각은 본 명세서에서 설명되는 하나 이상의 기능 및 작동을 수행할 수 있다. 도 2는 본 발명의 다양한 실시 예에서 설명되는 제어 모듈의 구성을 나타낸 도면이다. 도 2를 참조하면, 본 발명의 제어 모듈 160은 이벤트 수집 모듈 161, 윈도우 처리 모듈 163, 오디오 처리 모듈 165 및 통신 처리 모듈 167을 포함할 수 있다. 이벤트 수집 모듈 161은 전자 장치 100에서 발생하는 이벤트를 수집할 수 있다. 예컨대, 이벤트 수집 모듈 161 은 입력 모듈 120에서 발생하는 입력 신호를 이벤트로서 수집할 수 있다. 이벤트 수집 모듈 161은 표시 모듈 140의 입력 기능 지원과 관련하여 터치 패널의 전원 공급 등을 제어할 수 있다. 이벤트 수집 모듈 161은 입력 기능의 표시 모듈 140에서 발생하는 터치 이벤트를 수집할 수 있다. 이벤트 수집 모듈 161은 전자 장치 100이 음성 인식 및 명령 기능을 지원하는 경우 그에 대응하여 마이크를 활성화하고, 음성 인식 이벤트를 수집할 수 있다. 이벤트 수집 모듈 161은 전자 장치 100이 다양한 센서를 제공하는 경우, 제스처에 대응하는 센서 정보를 이벤트로서 수집할 수 있다. 예컨대, 이벤트 수집 모듈 161은 가속도 센싱 정보, 지자기 센싱 정보, 접촉 또는 압력 센싱 정보 등 적어도 하나의 센서들로부터 발생하는 적어도 하나의 센싱 정보를 이벤트로서 수집할 수 있 다. 이벤트 수집 모듈 161이 수집한 이벤트는 윈도우 처리 모듈 163에 제공될 수 있다. 일실시 예에 따르면, 이벤트 수집 모듈 161은 멀티윈도우와 핸들러가 출력된 상태에서 핸들러 조작과 관련한 터 치 이벤트를 수집할 수 있다. 이벤트 수집 모듈 161은 멀티윈도우가 배치된 환경에서 특정 윈도우와 다른 윈도 우 간의 위치 변경을 지시하는 터치 이벤트를 수집할 수 있다. 이벤트 수집 모듈 161은 포커싱된 윈도우 상에서 발생하는 터치 이벤트를 수집할 수 있다. 윈도우 처리 모듈 163은 윈도우 각각의 기능 처리를 지원하는 모듈일 수 있다. 윈도우 처리 모듈 163은 이벤트 수집 모듈 161이 제공한 이벤트에 따라 특정 윈도우와 관련한 기능을 처리할 수 있다. 예컨대, 윈도우 처리 모 듈 163은 이벤트 수집 모듈 161로부터 제1 기능 실행을 요청하는 이벤트를 전달받으면 제1 기능 처리를 위한 프 로세서를 할당할 수 있다. 또한 윈도우 처리 모듈 163은 제1 기능이 실행 중인 상태에서 이벤트 수집 모듈 161 로부터 제2 기능 실행을 요청하는 이벤트를 전달받으면 제2 기능 처리를 위한 프로세서를 할당할 수 있다. 윈도 우 처리 모듈 163은 이벤트 수집 모듈 161로부터 전달되는 특정 이벤트를 제1 기능 처리와 관련한 프로세서 또 는 제2 기능 처리와 관련한 프로세서에 전달할 수 있다. 그러면 제1 기능 처리와 관련한 프로세서는 전달된 이 벤트에 대응하여 제1 기능을 수행할 수 있다. 또한 제2 기능 처리와 관련한 프로세서는 전달되는 이벤트에 대응 하여 제2 기능을 수행할 수 있다. 일실시 예에 따르면, 상기 윈도우 처리 모듈 163은 멀티윈도우 출력이 요청되면 핸들러를 출력하도록 제어할 수 있다. 핸들러는 멀티윈도우들의 경계 영역 중 적어도 한 지점에 배치될 수 있다. 윈도우 처리 모듈 163은 핸들 러 조작과 관련한 터치 이벤트를 이벤트 수집 모듈 161로부터 수신할 수 있다. 윈도우 처리 모듈 163은 핸들러 조작과 관련한 터치 이벤트에 대응하여 멀티윈도우들의 크기 조정을 수행할 수 있다. 윈도우 처리 모듈 163은 멀티윈도우들의 크기 조정 과정에서 특정 윈도우가 일정 크기 이상이 되는 경우 해당 윈도우가 포커싱 되도록 제어할 수 있다. 윈도우 처리 모듈 163은 멀티윈도우들의 크기 조정 과정에서 특정 윈도우가 일정 크기 이하가 되는 경우 해당 윈도우가 비활성화되도록 제어할 수 있다. 일실시 예에 따르면, 윈도우 처리 모듈 163은 비활성 화된 윈도우 상에서 발생한 터치 이벤트를 무효 처리할 수 있다. 윈도우 처리 모듈 163은 특정 윈도우의 위치 조정과 관련한 터치 이벤트 예컨대 윈도우 스위칭 이벤트를 이벤트 수집 모듈 161로부터 전달받을 수 있다. 윈도우 처리 모듈 163은 윈도우 스위칭 이벤트에 대응하여 특정 윈도우 들 간의 배치 위치를 조정할 수 있다. 오디오 처리 모듈 165는 윈도우 처리 모듈 163으로부터 윈도우 포커싱 정보를 수신할 수 있다. 오디오 처리 모 듈 165는 윈도우 포커싱 정보를 확인하여 어떠한 윈도우가 포커싱 되어 있는지 확인할 수 있다. 오디오 처리 모 듈 165는 포커싱된 윈도우와 관련하여 출력할 오디오 신호가 있는지 확인할 수 있다. 오디오 처리 모듈 165는 포커싱된 윈도우와 관련한 오디오 신호가 존재하면, 해당 오디오 신호를 오디오 모듈 130을 통해 출력하도록 제 어할 수 있다. 상기 오디오 처리 모듈 165는 이전 포커싱된 윈도우와 관련한 오디오 신호가 존재하면 해당 오디 오 신호의 출력을 제한할 수 있다. 다양한 실시 예에 따르면, 오디오 처리 모듈 165는 포커싱된 윈도우와 관련 하여 오디오 신호가 존재하지 않으면, 이전 포커싱된 윈도우의 오디오 신호를 출력하도록 제어할 수도 있다. 통신 처리 모듈 167은 윈도우 처리 모듈 163으로부터 윈도우 포커싱 정보를 수신할 수 있다. 통신 처리 모듈 167은 윈도우 포커싱 정보를 확인하여 포커싱된 윈도우와 관련한 통신 기능이 존재하는지 확인할 수 있다. 통신 처리 모듈 167은 포커싱된 윈도우와 관련한 통신 기능이 존재하면 해당 통신 기능 지원을 수행할 수 있다. 예컨 대, 근거리 통신 기능과 관련한 윈도우 포커싱이 방송 수신 기능과 관련한 윈도우 포커싱으로 변경될 수 있다. 통신 처리 모듈 167은 근거리 통신 기능과 관련한 근거리 통신 유닛은 대기 상태로 천이시키거나 비활성화하도록 제어할 수 있다. 통신 처리 모듈 167은 방송 수신 기능과 관련한 방송 수신 유닛을 활성화시킬 수 있다. 다양한 실시 예에 따르면, 통신 처리 모듈 167은 웹 접속 기능과 관련하여 포커싱 여부에 따라 통신 채널을 해 제하거나 생성 또는 재연결할 수 있다. 예컨대, 통신 처리 모듈 167은 웹 접속 기능과 관련하여 해당 웹 접속 기능 윈도우가 포커싱된 경우 특정 서버 장치와의 통신 채널을 생성하거나 또는 재연결할 수 있다. 또한, 통신 처리 모듈 167은 웹 접속 기능 윈도우의 포커싱이 해제되는 경우 통신 채널을 해제할 수 있다. 이상에서 설명한 바와 같이 본 발명의 다양한 실시 예에 따른 전자 장치 100은 멀티윈도우 환경에서 특정 윈도 우의 크기 변경 시 포커싱 되는 윈도우를 조정하도록 지원할 수 있다. 이에 따라, 본 발명의 일실시 예에 따른 전자 장치 100은 윈도우 크기 조정과 함께 윈도우 조작을 연속하여 수행할 수 있어 작업의 연속성을 제공할 수 있다. 또한, 본 발명의 일실시 예에 따른 전자 장치 100은 윈도우 크기 조정에 따라 자동으로 오디오 소스를 변 경할 수 있다. 또한 전자 장치 100은 윈도우 크기 조정에 따라 자동으로 통신 모듈의 활성화나 비활성화 또는 대기나 연결 등의 상태 조정을 수행할 수 있다. 다양한 실시 예에 따르면, 본 발명의 일실시 예의 전자 장치 100은 복수개의 윈도우를 표시하는 표시 모듈 140, 이벤트 발생에 대응하여 상기 복수개의 윈도우 중 어느 하나의 특정 윈도우 크기를 변경하면서 상기 특정 윈도 우의 크기가 정해진 크기 이상으로 확장되면 상기 특정 윈도우와 관련한 기능 처리를 수행하는 포커싱을 할당하 는 제어 모듈 160을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 제어 모듈 160은 상기 특정 윈도우의 크기 확장에 대응하여 다른 윈도우의 크기 를 감소시키며, 상기 다른 윈도우의 크기가 정해진 크기 이하로 감소되면 할당된 포커싱을 해제할 수 있다. 다양한 실시 예에 따르면, 상기 제어 모듈 160은 상기 다른 윈도우의 크기가 정해진 크기 이하로 감소되면 크기 가 감소된 윈도우들의 입력을 비활성화 상태로 천이시킬 수 있다. 다양한 실시 예에 따르면, 상기 표시 모듈 140은 상기 다른 윈도우의 크기가 정해진 크기 이하로 감소되면 크기 가 감소된 윈도우들의 표시 효과를 변경하여 표시할 수 있다. 다양한 실시 예에 따르면, 상기 제어 모듈 160은 상기 크기가 감소된 윈도우 관련 이벤트를 수신하면, 상기 윈 도우 관련 이벤트에 의해 지정된 윈도우를 정해진 크기로 확장하고 상기 지정된 윈도우에 포커싱을 할당할 수 있다. 다양한 실시 예에 따르면, 상기 표시 모듈 140은 상기 복수개의 윈도우들이 배치된 경계 영역에 상기 윈도우들 의 크기 조정을 제어하는 핸들러를 출력할 수 있다. 다양한 실시 예에 따르면, 상기 제어 모듈 160은 상기 핸들러 터치 이벤트에 대응하여 상기 복수개의 윈도우들 을 사전 정의된 일정 비율의 크기로 조정하고 상기 특정 윈도우의 포커싱을 유지할 수 있다. 다양한 실시 예에 따르면, 상기 제어 모듈 160은 상기 핸들러 이동 이벤트에 대응하여 크기가 감소된 윈도우를 확장하고, 확장된 윈도우가 정해진 크기 이상으로 확장되면 확장된 윈도우로 포커싱을 변경할 수 있다. 다양한 실시 예에 따르면, 상기 표시 모듈 140은 상기 포커싱 할당을 만족하는 윈도우의 정해진 크기를 지시하 는 가이드 정보를 출력할 수 있다. 다양한 실시 예에 따르면, 상기 표시 모듈 140은 상기 특정 윈도우 관련 메뉴 아이템을 상기 윈도우들의 경계 영역에 인접된 영역에 배치하고 윈도우 스위칭 이벤트에 대응하여 상기 특정 윈도우를 다른 윈도우가 배치되었 던 위치로 이동시키면서 상기 메뉴 아이템을 윈도우들의 경계 영역에 인접된 영역에 표시할 수 있다. 도 3은 본 발명의 한 실시 예에 따른 전자 장치의 멀티윈도우 제어 방법에 관한 도면이다. 도 3을 참조하면, 본 발명의 멀티윈도우 제어 방법은 특정 이벤트가 발생하면 301 과정에서 제어 모듈 160이 해 당 이벤트가 멀티윈도우 관련 이벤트 발생인지 확인할 수 있다. 301 과정에서 발생한 이벤트가 멀티윈도우 관련 이벤트가 아니면 제어 모듈 160은 303 과정으로 분기하여 해당 이벤트의 종류와 특성에 따른 기능 수행을 지원 할 수 있다. 예컨대, 제어 모듈 160은 특정 기능 실행에 따른 윈도우를 표시 모듈 140에 출력하도록 제어할 수 있다. 또는 제어 모듈 160은 이벤트에 대응하여 특정 음원 재생에 따른 오디오 신호를 출력하거나 특정 통신 기 능 수행을 지원할 수 있다. 301 과정에서 멀티윈도우 관련 이벤트가 발생하면, 제어 모듈 160은 305 과정에서 멀티윈도우 및 핸들러 출력을 수행할 수 있다. 멀티윈도우 관련 이벤트는 표시 모듈 140에 멀티윈도우를 출력하도록 요청되는 이벤트일 수 있다. 예컨대, 복수의 앱을 동시 실행하도록 설정된 아이콘이나 메뉴 항목을 선택하는 이벤트가 발생하면, 표시 모듈 140은 멀티윈도우를 출력할 수 있다. 또는 특정 앱 실행에 따른 하나의 윈도우가 출력된 상태에서 추가로 앱 실행 요청이 발생하는 경우 멀티윈도우가 표시 모듈 140에 출력될 수 있다. 여기서 멀티윈도우는 두 개 이상 의 윈도우일 수 있다. 핸들러는 멀티윈도우에 포함된 윈도우들의 모서리 또는 가장자리 중 적어도 한 지점에 배 치될 수 있다. 일실시 예에 따르면, 핸들러는 윈도우들이 서로 마주하고 있는 가장자리 지점 중 적어도 한 곳에 배치될 수 있다. 3개 이상의 윈도우들이 서로 마주하는 경우 핸들러는 3개 이상의 윈도우들이 서로 마주는 지점 예컨대 특정 모서리 지점에 배치될 수 있다. 핸들러는 멀티윈도우의 크기 조정과 관련한 기능 처리를 지원할 수 있다. 핸들러가 일정 지점으로 이동하는 경우, 핸들러의 이동 지점을 기준으로 멀티윈도우들의 크기가 조정될 수 있다. 307 과정에서 제어 모듈 160은 핸들러 관련 이벤트가 발생하는지 확인할 수 있다. 예컨대, 제어 모듈 160은 핸 들러가 출력된 위치의 터치 패널에서 터치 이벤트가 발생하는지 확인할 수 있다. 또는 제어 모듈 160은 핸들러 조작과 관련한 키 버튼이나 키맵 또는 기타 다양한 입력 수단으로부터의 입력 이벤트 발생이 있는지 확인할 수 있다. 307 과정에서 핸들러 관련 이벤트가 발생하면, 제어 모듈 160은 309 과정에서 멀티윈도우 표시 제어 및 포커싱 처리를 수행할 수 있다. 이 과정에서 제어 모듈 160은 핸들러 선택 이벤트에 대응하여 핸들러 이동 방향 등을 가이드하기 위한 가이드 정보를 출력하도록 제어할 수 있다. 제어 모듈 160은 핸들러의 이동에 따라 실시간으로 멀티윈도우의 크기 조정을 수행할 수 있다. 예컨대, 제어 모듈 160은 핸들러와 연관된 복수개의 윈도우들의 가 장자리 중 적어도 하나를 핸들러의 이동에 대응하여 이동시킴으로써 적어도 하나의 특정 윈도우의 크기를 감소 시키거나 증가시킬 수 있다. 제어 모듈 160은 특정 윈도우의 크기 감소 또는 증가에 대응하여 적어도 하나의 다 른 윈도우의 크기를 증가 또는 감소시킬 수 있다. 일실시 예에 따르면, 제어 모듈 160은 멀티윈도우의 표시 제 어를 수행하는 과정에서 특정 윈도우가 정해진 일정 크기 이상으로 변경되는 경우 포커싱 조정을 수행할 수 있 다. 예컨대, 제어 모듈 160은 포커싱 되지 않은 윈도우의 크기가 정해진 크기 이상으로 변경되는 경우 크기가 변경된 윈도우가 포커싱 되도록 제어할 수 있다. 제어 모듈 160은 포커싱된 윈도우의 크기가 정해진 크기 이하 로 변경되는 경우 윈도우의 포커싱을 해제할 수 있다. 제어 모듈 160은 포커싱 처리에 따라 입력 이벤트 수신 대기 상태, 오디오 신호 출력 처리, 통신 채널 형성 또는 통신 모듈 활성화 상태 중 적어도 하나의 처리를 제어 할 수 있다. 다양한 실시 예에 따르면, 핸들러를 터치 하는 동작이 발생하는 경우 제어 모듈 160은 사전 정의된 비율의 멀티 윈도우 상태로 천이시킬 수 있다. 예컨대, 핸들러가 배치된 터치 패널 상에서 사전 정의된 터치 이벤트(더블 탭 이벤트, 핀치 줌 이벤트, 롱 터치 이벤트 등)가 발생하면, 제어 모듈 160은 표시 모듈 140을 균등 분할하고, 균 등 분할된 영역에 멀티윈도우들을 배치할 수 있다. 이때, 제어 모듈 160은 핸들러 터치 이전에 포커싱을 가지고 있는 윈도우가 해당 포커싱을 유지하도록 제어할 수 있다. 또는 제어 모듈 160은 사전 정의된 방식에 따라 특정 윈도우가 포커싱을 가지도록 제어할 수 있다. 307 과정에서 발생된 이벤트가 핸들러 관련 이벤트가 아니면, 제어 모듈 160은 311 과정에서 해당 이벤트가 스 위칭 이벤트인지 확인할 수 있다. 스위칭 이벤트는 특정 윈도우의 위치와 다른 윈도우의 위치를 변경하는 이벤 트일 수 있다. 예를 들면, 스위칭 이벤트는 드래그 이벤트, 스윕 이벤트, 플릭 이벤트 등 특정 윈도우를 표시 모듈 140 상에서 이동시키기 위한 이벤트일 수 있다. 한편, 본 발명의 일실시 예에서 스위칭 이벤트는 상술한 이벤트 종류에 한정되는 것은 아니다. 예컨대, 복수의 윈도우를 선택하는 핀치 줌 이벤트, 순차적으로 특정 윈 도우와 다른 윈도우를 선택하는 이벤트 등도 스위칭 이벤트가 될 수 있다. 다양한 실시 예에 따르면, 제어 모듈 160은 특정 윈도우 선택 시 메뉴를 제공하거나, 특정 윈도우 선택 시 변경할 다른 윈도우를 지정할 수 있는 상 태를 제공하는 등 다양한 방식을 통하여 윈도우 스위칭 이벤트 생성을 지원할 수 있다. 제어 모듈 160은 311 과정에서 윈도우 스위칭 이벤트가 발생하면 313 과정에서 윈도우 스위칭 처리를 수행할 수 있다. 일실시 예에 따르면, 제어 모듈 160은 멀티윈도우 중 특정 윈도우와 관련하여 롱터치 이벤트(특정 윈도우 가 배치된 영역 상에서 일정 시간 이상 유지되는 홀딩 터치 이벤트)가 발생하면, 제어 모듈 160은 해당 윈도우 를 스위칭 가능 상태로 지정할 수 있다. 그리고 제어 모듈 160은 롱터치 이벤트 이후 발생하는 드래그 이벤트에 따라 지정된 윈도우의 위치를 변경할 수 있다. 이때, 제어 모듈 160은 드래그 이벤트 방향 및 이동에 따라 적어 도 일부가 지정된 윈도우가 중첩되거나 또는 일정 영역 이상 중첩되는 윈도우와 지정 윈도우의 위치 변경을 제 어할 수 있다. 제어 모듈 160은 311 과정에서 스위칭 이벤트 발생이 아닌 경우, 315 과정에서 해당 이벤트에 따른 동작을 처리 할 수 있다. 예컨대, 제어 모듈 160은 포커싱된 특정 윈도우 상에서 발생한 이벤트에 대하여 해당 윈도우와 관 련한 기능 처리를 수행할 수 있다. 또는 제어 모듈 160은 특정 윈도우에 대한 포커싱 변경을 요청하는 이벤트인 경우, 해당 이벤트에 따른 포커싱 변경처리를 수행할 수 있다. 제어 모듈 160은 317 과정에서 기능 종료와 관련한 이벤트 발생이 있는지 확인할 수 있다. 제어 모듈 160은 기 능 종료와 관련한 이벤트 발생이 있으면, 멀티윈도우들을 표시 모듈 140에서 제거할 수 있다. 이 과정에서 제어 모듈 160은 제거된 윈도우와 관련한 기능을 종료시키거나 대기 상태로 천이시킬 수 있다. 기능 종료와 관련한 이벤트 발생이 없으면, 제어 모듈 160은 305 과정 이전으로 분기하여 이하 과정을 재수행하도록 지원할 수 있다. 다양한 실시 예에 따르면, 본 발명의 일실시 예에 따른 멀티윈도우 제어 방법은 복수개의 윈도우를 표시하는 과 정, 이벤트 발생에 대응하여 상기 복수개의 윈도우 중 어느 하나의 특정 윈도우 크기를 변경하는 과정, 상기 특 정 윈도우의 크기가 정해진 크기 이상으로 확장되면 상기 특정 윈도우와 관련한 기능 처리를 수행하는 포커싱을 할당하는 과정을 포함할 수 있다. 다양한 실시 예에 따르면, 변경하는 과정은 상기 특정 윈도우의 크기 확장에 대응하여 다른 윈도우의 크기를 감 소시키는 과정, 상기 다른 윈도우의 크기가 정해진 크기 이하로 감소되면 할당된 포커싱을 해제하는 과정, 상기 다른 윈도우의 크기가 정해진 크기 이하로 감소되면 크기가 감소된 윈도우들의 입력을 비활성화 상태로 천이시 키는 과정, 상기 다른 윈도우의 크기가 정해진 크기 이하로 감소되면 크기가 감소된 윈도우들의 표시 효과를 변 경하는 과정 중 적어도 하나의 과정을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 방법은 상기 크기가 감소된 윈도우 관련 이벤트를 수신하는 과정, 상기 윈도우 관련 이벤트에 의해 지정된 윈도우를 정해진 크기로 확장하는 과정, 상기 지정된 윈도우에 포커싱을 할당하는 과정을 더 포함할 수 있다. 다양한 실시 예에 따르면, 상기 복수개의 윈도우들이 배치된 경계 영역에 상기 윈도우들의 크기 조정을 제어하 는 핸들러를 출력하는 과정을 더 포함할 수 있다. 다양한 실시 예에 따르면, 상기 변경하는 과정은 상기 핸들러의 이동에 대응하여 상기 특정 윈도우의 크기를 변 경하는 과정을 더 포함할 수 있다. 다양한 실시 예에 따르면, 상기 방법은 상기 핸들러 터치 이벤트를 수신하는 과정, 상기 핸들러 터치 이벤트에 대응하여 상기 복수개의 윈도우들을 사전 정의된 일정 비율의 크기로 조정하여 배치하는 과정을 더 포함할 수 있다. 상기 방법은 상기 특정 윈도우의 포커싱을 유지하는 과정을 더 포함할 수 있다. 다양한 실시 예에 따르면, 상기 방법은 상기 핸들러 이동 이벤트를 수신하는 과정, 상기 핸들러 이동 이벤트에 대응하여 크기가 감소된 윈도우를 확장하는 과정, 확장된 윈도우가 정해진 크기 이상으로 확장되면 포커싱을 변 경하는 과정을 더 포함할 수 있다. 다양한 실시 예에 따르면, 상기 방법은 상기 포커싱 할당을 만족하는 윈도우의 정해진 크기를 지시하는 가이드 정보를 출력하는 과정을 더 포함할 수 있다. 다양한 실시 예에 따르면, 상기 방법은 상기 특정 윈도우 관련 메뉴 아이템을 상기 윈도우들의 경계 영역에 인 접된 영역에 배치하는 과정, 윈도우 스위칭 이벤트를 수신하는 과정, 상기 윈도우 스위칭 이벤트에 대응하여 상 기 특정 윈도우를 다른 윈도우가 배치되었던 위치로 이동시키는 과정, 상기 메뉴 아이템을 상기 특정 윈도우와 함께 이동시키면서 윈도우들의 경계 영역에 인접된 영역에 배치하는 과정을 더 포함할 수 있다. 도 4는 본 발명의 일실시 예에 따른 멀티윈도우 중 더블 윈도우 운용과 관련한 도면이다. 도 4를 참조하면, 전자 장치 100의 표시 모듈 140은 41 화면에서와 같이 윈도우 401 및 윈도우 402를 포함하는 멀티윈도우를 출력할 수 있다. 윈도우 401 및 윈도우 402는 표시 모듈 140의 전체 화면에서 분할된 일정 영역들 에 배치될 수 있다. 윈도우 401의 일측 가장자리 예를 들면 우측 가장자리와 윈도우 402의 좌측 가장자리를 서 로 대면될 수 있다. 표시 모듈 140은 윈도우 401과 윈도우 402 사이에 핸들러 410은 출력할 수 있다. 핸들러 410은 윈도우 401과 윈도우 402가 서로 마주보는 영역에 배치될 수 있다. 여기서 윈도우 402는 포커싱을 가진 상태일 수 있다. 윈도우 402가 포커싱을 가지도록 특정 터치 이벤트가 발생하거나 또는 특정 메뉴 선택이 발생 할 수 있다. 또는 윈도우 401과 윈도우 402가 표시 모듈 140에 출력되는 과정에서 디폴트로 윈도우 402에 포커 싱이 할당될 수 있다. 또는 윈도우 401이 표시 모듈 140의 전체 화면으로 출력된 상태에서 윈도우 402가 출력되어 멀티윈도우가 구성된 경우, 시간 상 나중에 출력된 윈도우 402에 자동으로 포커싱이 할당될 수도 있다. 표시 모듈 140에 출력된 핸들러 410은 선택하는 이벤트 예컨대, 핸들러 410이 배치된 위치 상에서 발생하는 터 치 이벤트가 수신되면, 제어 모듈 160은 도시된 바와 같이 가이드 정보 420은 출력할 수 있다. 이때, 가이드 정 보 420은 윈도우 401이 포커싱이 자동으로 할당되기 위해 가져야 할 윈도우 크기를 지시하는 정보일 수 있다. 예를 들어, 핸들러 410이 이동하여 43 화면에서와 같이 가이드 정보 420이 지시한 영역까지 윈도우 401 크기가 확대될 수 있다. 제어 모듈 160은 윈도우 401 크기가 정해진 크기 이상으로 확대되면 자동으로 포커싱을 할당할 수 있다. 표시 모듈 140은 윈도우 401 크기 확대에 대응하여 윈도우 402 크기를 감소시킬 수 있다. 제어 모듈 160은 윈도우 402가 정해진 크기 이하로 작아지면 도시된 바와 같이 해당 윈도우의 포커싱을 해제할 수 있다. 제어 모듈 160은 윈도우 402가 정해진 크기 이하로 작아지면 입력 비활성화 상태를 가지도록 처리할 수 있다. 입력 비활성화 상태는 정해진 크기 이하의 윈도우 상에서 발생하는 특정 터치 이벤트를 무시하는 상태일 수 있 다. 43 화면 상태에서 사전 정의된 특정 이벤트 412가 발생하면 제어 모듈 160은 45 화면에서와 같이 멀티윈도우 환 경을 변경할 수 있다. 예를 들면, 정해진 크기 이하로 작아진 윈도우 402 상에서 더블 탭 이벤트 412가 발생하 면 제어 모듈 160은 윈도우 402가 표시 모듈 140에서 일정 크기 이상을 가지도록 조정할 수 있다. 예를 들면, 제어 모듈 160은 윈도우 402가 윈도우 401보다 큰 영역을 가지도록 제어할 수 있다. 또는 제어 모듈 160은 윈도 우 402를 전체 화면으로 표시되도록 제어할 수 있다. 이 과정에서 제어 모듈 160은 윈도우 402가 포커싱을 가지 도록 제어할 수 있다. 제어 모듈 160은 윈도우 401의 입력(예) 터치 입력)을 비활성화 상태가 되도록 제어할 수 있다. 43 화면 상태에서 사전 정의된 특정 이벤트 411이 발생하면 제어 모듈 160은 47 화면에서와 같은 멀티윈도우 변 경을 제어할 수 있다. 예를 들면, 핸들러 410이 배치된 위치 상에서 더블 탭 이벤트 411이 발생하면 제어 모듈 160은 윈도우 401과 윈도우 402가 표시 모듈 140에서 동일한 표시 크기를 가지도록 제어할 수 있다. 이 과정에 서 제어 모듈 160은 윈도우 401이 포커싱을 가지도록 제어할 수 있다. 상술한 특정 이벤트 411, 412를 더블 탭 이벤트로 설명하였으나, 본 발명의 다양한 실시 예들이 이에 한정되는 것은 아니다. 예컨대, 특정 이벤트는 탭 이벤트, 롱 터치 이벤트, 핀치 줌 이벤트 등 다양한 터치 이벤트를 포함할 수 있다. 제어 모듈 160은 포커싱 변경에 따라 표시 효과를 변경할 수 있다. 예컨대, 제어 모듈 160은 포커싱된 윈도우의 테두리를 이전보다 또는 다른 윈도우들보다 밝게 표시할 수 있다. 또는 제어 모듈 160은 포커싱된 윈도우의 테 두리 색이나 모양 등을 변경할 수 있다. 또는 제어 모듈 160은 포커싱된 윈도우의 테두리에 포커싱을 인지할 수 있는 화면 요소를 출력하도록 제어할 수 있다. 상술한 설명에서, 특정 이벤트를 더블 탭으로 예시하였으나 본 발명이 이에 한정되는 것은 아니다. 예컨대, 더 블 탭 이벤트는 핀치 줌 이벤트, 멀티 포인트를 터치하는 탭 이벤트, 스와입 이벤트 등으로 대체될 수 있다. 또 한 특정 이벤트 발생에 따라 윈도우 401과 윈도우 402가 화면을 균등 분할하여 표시되는 상태로 천이되는 것을 설명하였으나, 본 발명이 이에 한정되는 것은 아니다. 예컨대, 제어 모듈 160은 특정 이벤트가 발생하면 43 화 면으로 변경되기 직전 상태 예컨대, 41 상태로 복귀하도록 제어할 수도 있다. 도 5는 본 발명의 일실시 예에 따른 멀티윈도우 중 쿼드 윈도우 운용의 일예를 나타낸 도면이다. 도 5를 참조하면, 표시 모듈 140은 4개의 윈도우들 501, 502, 503, 504를 출력할 수 있다. 4개의 윈도우들 501, 502, 503, 504는 51 화면에서와 같이 균등 분할된 표시 모듈 140의 일정 영역들에 각각 배치될 수 있다. 표시 모듈 140은 4개의 윈도우들 501, 502, 503, 504가 배치된 일정 지점에 핸들러 510은 출력할 수 있다. 일실시 예 에 따르면, 핸들러 510은 윈도우들 501, 502, 503, 504 모두와 동시 연결되는 지점에 배치될 수 있다. 4개의 윈 도우들 501, 502, 503, 504를 출력한 전자 장치 100은 입력 이벤트에 따라 또는 사전 정해진 스케줄 정보 등에 따라 윈도우 502에 포커싱을 할당할 수 있다. 포커싱이 할당된 윈도우 502는 화면 활성화 상태를 가질 수 있다. 전자 장치 100은 윈도우 502와 관련한 영상 신호를 윈도우 502 영역에 출력할 수 있다. 전자 장치 100은 윈도우 502와 관련한 오디오 신호를 오디오 모듈 130을 통해 출력할 수 있다. 전자 장치 100은 윈도우 502와 관련한 통 신 모듈이 존재하면 해당 통신 모듈을 활성화 상태를 가지도록 제어할 수 있다. 특정 윈도우 크기 조정을 위하 여 핸들러 510이 선택되면, 표시 모듈 140은 51 화면에서와 같이 가이드 정보 520은 출력할 수 있다. 가이드 정 보 520는 윈도우들 501, 502, 503, 504의 적어도 일부에 걸쳐서 표시될 수 있다. 가이드 정보 520는 특정 윈도 우의 포커싱 할당과 관련하여 변경되어야 할 최소 크기를 지시하는 정보일 수 있다. 핸들러 510 이동과 관련한 터치 이벤트가 발생할 수 있다. 그리고 핸들러 510이 53에서와 같이 윈도우 502가 배 치된 위치의 가이드 정보 520 지점까지 이동할 수 있다. 이에 대응하여 윈도우 503은 사전 정해진 일정 크기 이 상으로 확대될 수 있다. 제어 모듈 160은 정해진 크기 이상의 윈도우 503에 자동으로 포커싱을 할당할 수 있다. 윈도우 501, 윈도우 502 및 윈도우 504는 사전 정해진 일정 크기 이하로 감소될 수 있다. 제어 모듈 160은 정해 진 크기 이하로 작아진 윈도우 501, 윈도우 502, 윈도우 504를 입력 비활성화 상태로 변경할 수 있다. 이 과정 에서 제어 모듈 160은 정해진 크기 이하의 윈도우들 501, 502, 504의 표시 효과를 변경할 수 있다. 예컨대, 제 어 모듈 160은 정해진 크기 이하의 적어도 하나의 윈도우들 501, 502, 504의 색을 반전시키거나 그림자 효과를 적용할 수 있다. 53 화면 상태에서, 사전 정의된 핸들러 관련 이벤트 511이 발생할 수 있다. 예컨대, 핸들러 510과 관련하여 핸 들러 510을 두 번 터치 하는 더블 탭 이벤트 511이 발생할 수 있다. 정해진 핸들러 관련 이벤트 511이 발생하면, 제어 모듈 160은 윈도우들 501, 502, 503, 504가 사전 정의된 일정 비율의 크기로 표시되도록 제어할 수 있다. 예컨대, 제어 모듈 160은 55 화면에서와 같이 윈도우들 501, 502, 503, 504가 균등하게 표시되도록 제 어할 수 있다. 다양한 실시 예에 따르면, 제어 모듈 160은 적어도 하나의 윈도우들 501, 502, 503, 504가 비균 등한 크기로 표시 모듈 140에 출력되도록 제어할 수도 있다. 또는, 제어 모듈 160은 53 화면 상태가 되기 직전 의 화면 상태로 복귀하도록 제어할 수 있다. 제어 모듈 160은 55 화면 상태에서 특정 윈도우 예컨대 핸들러 관 련 이벤트 511이 발생하기 직전에 포커싱을 가진 윈도우 503이 포커싱을 유지하도록 제어할 수 있다. 다양한 실시 예에 따르면, 53 화면 상태에서 정해진 크기 이하의 윈도우와 관련하여 사전 정의된 윈도우 관련 이벤트 512가 발생할 수 있다. 예컨대, 윈도우 502 상에서 롱 터치 이벤트 또는 더블 탭 이벤트 512가 발생할 수 있다. 제어 모듈 160은 정해진 윈도우 관련 이벤트 512가 발생하면, 57 화면에서와 같이 사전 정의된 일정 비율의 크기를 가지도록 윈도우들 501, 502, 503, 504를 배치할 수 있다. 이 과정에서, 제어 모듈 160은 윈도우 관련 이벤트 512에 대응하는 윈도우 502가 포커싱을 가지도록 제어할 수 있다. 이에 따라, 제어 모듈 160은 윈 도우 503의 포커싱을 해제할 수 있다. 다양한 실시 예에 따르면, 균등 분할된 적어도 하나의 윈도우들 501, 502, 503, 504는 입력 활성화 상태를 가질 수 있다. 예컨대, 제어 모듈 160은 57 화면에서 포커싱은 윈도우 502로 할당하지만, 윈도우 501, 윈도우 503 및 윈도우 504 상에서 발생한 터치 이벤트는 정상적으로 수집하고 처리할 수 있다. 이에 따라, 윈도우 501 상에 배 치된 특정 오브젝트 선택을 위한 터치 이벤트가 발생하면 제어 모듈 160은 윈도우 501 상에서 발생한 터치 이벤 트 처리를 수행할 수 있다. 이때, 제어 모듈 160은 윈도우 502에 할당된 포커싱을 윈도우 501이 가지도록 제어 할 수 있다. 일실시 예에 따르면, 윈도우 502 관련 오디오 신호를 출력하다가, 윈도우 501 상에서 터치 이벤트 가 발생하면 제어 모듈 160은 윈도우 502 관련 오디오 신호 출력을 제한하고, 윈도우 501 관련 오디오 신호 출 력을 제어할 수 있다. 여기서 포커싱이 해제된 윈도우 502는 다른 윈도우들과 같이 해당 윈도우에서 발생한 터 치 이벤트를 유효 이벤트로 인식하고 해당 이벤트에 따른 기능 처리를 할 수 있는 입력 활성화 상태를 가질 수 있다. 한편, 53 화면 상태에서 윈도우 501, 윈도우 502 및 윈도우 504는 입력 비활성화 상태를 가질 수 있다. 그리고 사전 정의된 특정 터치 이벤트가 발생하거나 또는 특정 메뉴 선택 또는 정해진 윈도우 크기를 확보하기 전까지 정해진 크기 이하의 윈도우들 501, 502, 504는 입력 비활성화 상태를 유지할 수 있다. 도 6은 본 발명의 일실시 예에 따른 멀티윈도우 중 쿼드 윈도우 운용의 다른 일예를 나타낸 도면이다. 도 6을 참조하면, 표시 모듈 140은 61 화면에서와 같이 정해진 크기 이하의 윈도우들 601, 602, 604와 포커싱이 할당된 윈도우 603을 표시할 수 있다. 표시 모듈 140은 전체 윈도우들 601, 602, 603, 604의 모서리가 연결된 지점에 핸들러 610은 출력할 수 있다. 핸들러 610는 전체 윈도우들 601, 602, 603, 604의 크기 조정을 지원할 수 있다. 핸들러 610 관련 이벤트 611 예컨대, 핸들러 610과 관련하여 핸들러 610을 롱 터치하는 이벤트 611이 발생하면, 제어 모듈 160은 63 화면에서와 같이 가이드 정보 620은 출력할 수 있다. 가이드 정보 620는 전체 윈도우들 601, 602, 603, 604 중 어느 하나의 윈도우가 포커싱을 할당받기 위해 가져야 하는 크기를 지시할 수 있다. 63 화면에서 윈도우 601은 확장시키기 위한 이벤트가 발생할 수 있다. 예컨대, 윈도우 601이 배치된 영역에서 정해진 윈도우 관련 이벤트 612가 발생하거나, 롱 터치 이벤트 611과 연속하여 핸들러 610이 윈도우 601을 확장 시키는 위치로 이동할 수 있다. 일실시 예에 따르면, 핸들러 610이 아래 방향으로 이동하여 윈도우 601의 크기 가 65 화면에서와 같이 확장될 수 있다. 표시 모듈 140은 65 화면과 같이 윈도우 601 크기를 확장시킨 윈도우들 의 배치를 출력할 수 있다. 윈도우 601이 정해진 크기 이상으로 확대되면, 제어 모듈 160은 65 화면에서와 같이윈도우 601에 포커싱이 할당되도록 제어할 수 있다. 윈도우 601이 일정 크기로 확대됨에 따라 윈도우 602, 윈도 우 603 및 윈도우 604는 정해진 크기 이하로 작아질 수 있다. 제어 모듈 160은 정해진 크기 이하의 윈도우들 602, 603, 604가 입력 비활성화 상태를 가지도록 제어할 수 있다. 이때, 제어 모듈 160은 도시된 바와 같이 정 해진 크기 이하의 윈도우들 602, 603, 604의 표시 효과를 변경할 수 있다. 63 화면 상태에서, 윈도우 604 크기를 확장하는 이벤트가 발생할 수 있다. 예를 들면, 가이드 정보 620에 따라 윈도우 604를 확장시키는 방향인 화면의 좌측 방향으로 핸들러 610가 이동되거나, 윈도우 604가 배치된 영역 상 에서 정해진 특정 터치 이벤트가 발생할 수 있다. 제어 모듈 160은 발생한 이벤트에 따라 67 화면에서와 같이 윈도우 604의 크기를 확장시킬 수 있다. 제어 모듈 160은 윈도우 604가 정해진 크기 이상으로 변경되는 시점에 포커싱을 가지도록 제어할 수 있다. 제어 모듈 160은 정해진 크기 이하의 윈도우들 601, 602, 603이 입력 비활 성화 상태를 가지도록 제어할 수 있다. 도 7은 본 발명의 일실시 예에 따른 멀티윈도우 중 더블 윈도우의 윈도우 스위칭 운용과 관련한 도면이다. 도 7을 참조하면, 표시 모듈 140은 71 화면에서와 같이 윈도우 701 및 윈도우 703을 표시할 수 있다. 윈도우 701 및 윈도우 703 사이에는 핸들러 710은 출력할 수 있다. 윈도우 701은 입력 이벤트 발생에 따라 또는 터치 이벤트에 따라 윈도우 701 상에 메뉴 아이템 705를 출력할 수 있다. 또는 윈도우 701은 핸들러 710 관련 이벤트 발생에 따라 메뉴 아이템 705를 출력할 수 있다. 메뉴 아이템 705는 윈도우 701과 윈도우 703 사이의 경계 영역 에 배치될 수 있다. 예컨대, 메뉴 아이템 705는 윈도우 701과 윈도우 703이 마주보는 면에 인접되는 윈도우 701 영역에 배치될 수 있다. 여기서 메뉴 아이템은 현재 포커싱된 윈도우와 관련한 메뉴 아이템일 수 있다. 이에 따 라, 표시 모듈 140에 출력되는 메뉴 아이템은 핸들러 710 관련 이벤트가 발생하는 시점 또는 메뉴 아이템 호출 과 관련한 이벤트가 발생하는 시점에 포커싱된 윈도우와 관련된 메뉴 아이템일 수 있다. 메뉴 아이템 705는 윈도우 스위칭 항목을 포함할 수 있다. 윈도우 스위칭 항목이 선택되면 윈도우 701 및 윈도 우 703은 윈도우 스위칭 대기 상태를 가질 수 있다. 윈도우 701은 이동시키는 이벤트 발생에 따라, 제어 모듈 160은 73 화면에서와 같이 윈도우 701은 윈도우 703이 배치되었던 위치로 이동시킬 수 있다. 이에 대응하여, 제 어 모듈 160은 윈도우 703은 윈도우 701이 배치되었던 위치로 이동시킬 수 있다. 제어 모듈 160은 윈도우 스위 칭 과정에서 메뉴 아이템 705를 이동시켜 윈도우 701 상에 출력되도록 제어할 수 있다. 이 과정에서 제어 모듈 160은 메뉴 아이템 705를 73 화면에서와 같이 윈도우 703과 윈도우 701의 경계 영역에 인접된 위치에 배치할 수 있다. 다양한 실시 예에 따르면, 제어 모듈 160은 윈도우 701은 롱 터치하는 이벤트를 윈도우 스위칭 이벤트로 인식할 수도 있다. 이에 따라, 제어 모듈 160은 윈도우 701 상에서 롱 터치 이벤트가 발생하면 윈도우 701은 스위칭할 수 있는 상태로 변경할 수 있다. 제어 모듈 160은 윈도우 701은 드래그하는 이벤트 발생에 대응하여 윈도우 701 의 위치를 윈도우 703 위치와 스왑할 수 있다. 도 8은 본 발명의 일실시 예에 따른 멀티윈도우 중 쿼드 윈도우의 윈도우 스위칭 운용과 관련한 도면이다. 도 8을 참조하면, 표시 모듈 140은 81 화면에서와 같이 멀티윈도우 출력 요청에 대응하여 윈도우들 801, 802, 803, 804를 출력할 수 있다. 표시 모듈 140은 윈도우들 801, 802, 803, 804의 경계 영역에 핸들러 810은 출력 할 수 있다. 예컨대, 표시 모듈 140은 윈도우들 801, 802, 803, 804의 꼭짓점이 연결된 위치에 핸들러 810은 출 력할 수 있다. 제어 모듈 160은 윈도우들 801, 802, 803, 804 중 특정 윈도우 예컨대 윈도우 801에 포커싱을 할 당할 수 있다. 제어 모듈 160은 이벤트 발생에 대응하여 또는 디폴트로 메뉴 아이템 805를 윈도우 801 상에 출력할 수 있다. 또는 제어 모듈 160은 핸들러 810 조작과 관련한 이벤트 발생에 대응하여 특정 윈도우와 관련한 메뉴 아이템을 출력하도록 제어할 수 있다. 예컨대, 제어 모듈 160은 현재 포커싱된 윈도우와 관련한 메뉴 아이템 또는 사전 정의된 특정 위치의 윈도우와 관련한 메뉴 아이템을 출력하도록 제어할 수 있다. 메뉴 아이템 805는 윈도우 801과 다른 윈도우 간의 경계 영역에 배치될 수 있다. 예를 들면, 메뉴 아이템 805는 윈도우 801과 윈도우 803 경계 영역에 인접된 위치에 배치될 수 있다. 메뉴 아이템 805는 윈도우 스위칭 항목을 포함할 수 있다. 메뉴 아이템 805 중 윈도우 스위칭 항목이 선택되면, 제어 모듈 160은 윈도우 801은 위치 이동 가능 상태로 변경할 수 있다. 83 화면에서와 같이 윈도우 801은 윈도우 804가 배치되었던 위치로 이동시키는 이벤트가 발생할 수 있다. 제어 모듈 160은 85 화면에서와 같이 해당 이벤트 발생에 대응하여 윈도우 801은 윈도우 804가 배치되었던 위치로 이 동시킴과 아울러, 윈도우 804를 윈도우 801이 배치되었던 위치로 이동시킬 수 있다. 이 과정에서 제어 모듈 160은 메뉴 아이템 805를 함께 이동시킬 수 있다. 그리고 메뉴 아이템 805는 윈도우 801과 다른 윈도우 간의 경계 영역에 인접된 영역에 자동 배치할 수 있다. 85 화면에서 메뉴 아이템 805는 윈도우 801과 윈도우 802 경계 영 역에 인접된 영역에 배치될 수 있다. 상술한 바와 같이 본 발명의 다양한 실시 예에 따른 멀티윈도우 제어 방법 및 이를 지원하는 전자 장치는 멀티 윈도우 환경에서 발생되는 이벤트에 대응하여 윈도우들의 크기 변경과 포커싱 할당 및 메뉴 아이템의 배치 중 적어도 하나를 보다 직관적이며 용이하게 처리할 수 있도록 지원한다. 상술한 설명에서는 멀티윈도우를 더블 윈도우와, 쿼드 윈도우를 예시하여 설명하지만, 본 발명이 이에 한정되는 것은 아니다. 예컨대, 본 발명의 다양한 실시 예에 따르면 멀티윈도우는 윈도우가 개수가 3, 5, 6, 8, 9개 등 다양한 개수의 윈도우를 포함할 수 있다. 이에 따라, 멀티윈도우를 구획하는 구획선은 표시 모듈 140의 균등하 게 또는 비균등하게 분할할 수 있으며, 복수 개를 포함할 수 있다. 또한 멀티윈도우를 구획하는 구획선은 직선 이나 곡선, 나선, 자유 곡선 등 다양한 형태를 포함할 수 있다. 본 발명의 일실시 예에 따른 전자 장치 100은 다양한 구획선으로 구획된 멀티윈도우들에 대하여 특정 크기 이상의 윈도우가 포커싱 되도록 제어할 수 있다. 여기서 전자 장치 100은 복수개의 윈도우들 중 일부 윈도우들 예컨대 2개 이상의 윈도우가 포커싱을 가지도록 제어할 수도 있다. 이 과정에서 전자 장치 100은 복수개의 오디오 소스를 처리할 수도 있으며, 이에 따라 복수 개의 윈도우와 관련한 오디오 신호가 복합적으로 출력될 수도 있다. 한편 다양한 실시 예에 따르면, 상술한 전자 장치 100의 제어 모듈 160은 버스와 적어도 하나의 프로세서를 포 함할 수 있다. 여기서 프로세서는 예컨대, 전자 장치 100에서 설명한 처리 모듈 및 수집 모듈들 중 적어도 하나 를 포함할 수 있다. 또는 윈도우 처리 모듈 163에 포함된 처리 모듈들이 적어도 하나의 프로세서로 구현될 수 있다. 버스는 전자 장치들에 포함된 구성요소들(예: 프로세서, 저장 모듈, 입력 모듈, 표시 모듈 또는 통신 모듈을 서 로 연결하고, 구성요소들 간의 통신(예: 제어 메시지)을 전달하는 회로일 수 있다. 프로세서는 버스를 통해 전자 장치들에 포함된 구성요소들로부터 명령을 수신하여, 수신된 명령을 해독하고, 해 독된 명령에 따른 연산이나 데이터 처리를 수행할 수 있다. 이때, 프로세서는 저장 모듈 150에 저장되어 있는 적어도 하나의 어플리케이션을 실행하여 해당 어플리케이션에 기반하여 서비스를 제공하도록 제어한다. 또한, 프로세서는 하나 이상의 어플리케이션 프로세서(AP: application processor) 또는 하나 이상의 커뮤니케 이션 프로세서(CP: communication processor)를 포함할 수 있다. 여기서, AP 또는 CP는 프로세서 내에 포함되 거나 서로 다른 IC 패키지들 내에 각각 포함될 수 있다. 또한, AP 또는 CP는 하나의 IC 패키지 내에 포함될 수 도 있다. AP는 운영체제 또는 응용 프로그램을 구동하여 AP에 연결된 다수의 하드웨어 또는 소프트웨어 구성요 소들을 제어하고, 멀티미디어 데이터를 포함한 각종 데이터 처리 및 연산을 수행할 수 있다. 여기서, AP는 SoC(system on chip)로 구현될 수 있다. 또한, CP는 멀티미디어 제어 기능의 적어도 일부를 수행할 수 있다. 또 한, CP는 가입자 식별 모듈(예: SIM 카드)을 이용하여 통신 네트워크 내에서 단말의 구별 및 인증을 수행할 수 있다. 이때, CP는 사용자에게 음성 통화, 영상 통화, 문자 메시지 또는 패킷 데이터(packet data)를 포함하는 서비스를 제공할 수 있다. 또한, CP는 통신 모듈의 데이터 송수신을 제어할 수 있다. AP 또는 CP는 각각에 연결된 비휘발성 메모리 또는 다른 구성요소 중 적어도 하나로부터 수신한 명령 또는 데이터를 휘발성 메모리에 로드(load)하여 처리할 수 있다. 또한, AP 또는 CP는 다른 구성요소 중 적어도 하나로부터 수신하거나 다른 구 성요소 중 적어도 하나에 의해 생성된 데이터를 비휘발성 메모리에 저장(store)할 수 있다. CP는 하드웨어를 포 함하는 전자 장치와 네트워크로 연결된 다른 전자 장치들 간의 통신에서 데이터 링크를 관리하고 통신 프로토콜 을 변환하는 기능을 수행할 수 있다. 여기서, CP는 SoC로 구현될 수 있다. 추가적으로, 프로세서는 GPU(graphic processing unit)를 더 포함할 수도 있다. 한편 디지털 기기의 컨버전스(convergence) 추세에 따라 변형이 매우 다양하여 모두 열거할 수는 없으나, 전자 장치 100은 가속도 센서, 자이로 센서, GPS 모듈, NFC(Near Filed Communication) 모듈, 진동 모터, 액세서리 등과 같이 상기에서 언급되지 않은 구성들을 더 포함할 수 있다. 또한 전자 장치 100은 그 제공 형태에 따라 상 기한 구성들에서 특정 구성이 제외되거나 다른 구성으로 대체될 수도 있다. 그리고 본 명세서와 도면에 개시된 본 개시의 실시 예들은 본 개시의 기술 내용을 쉽게 설명하고 본 개시의 이 해를 돕기 위해 특정 예를 제시한 것일 뿐이며, 본 개시의 범위를 한정하고자 하는 것은 아니다. 따라서 본 개 시의 범위는 여기에 개시된 실시 예들 이외에도 본 개시의 기술적 사상을 바탕으로 도출되는 모든 변경 또는 변 형된 형태가 본 개시의 범위에 포함되는 것으로 해석되어야 한다.부호의 설명 100 : 전자 장치 110 : 통신 모듈 120 : 입력 모듈 130 : 오디오 모듈 140 : 표시 모듈 150 : 저장 모듈 160 : 제어 모듈"}
{"patent_id": "10-2014-0000207", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시 예에 따른 전자 장치를 나타낸 도면이다. 도 2는 본 발명의 다양한 실시 예에서 설명되는 제어 모듈의 구성을 나타낸 도면이다. 도 3은 본 발명의 한 실시 예에 따른 전자 장치의 멀티윈도우 제어 방법에 관한 도면이다. 도 4는 본 발명의 일실시 예에 따른 멀티윈도우 중 더블 윈도우 운용과 관련한 도면이다. 도 5는 본 발명의 일실시 예에 따른 멀티윈도우 중 쿼드 윈도우 운용의 일예를 나타낸 도면이다. 도 6은 본 발명의 일실시 예에 따른 멀티윈도우 중 쿼드 윈도우 운용의 다른 일예를 나타낸 도면이다.도 7은 본 발명의 일실시 예에 따른 멀티윈도우 중 더블 윈도우의 윈도우 스위칭 운용과 관련한 도면이다. 도 8은 본 발명의 일실시 예에 따른 멀티윈도우 중 쿼드 윈도우의 윈도우 스위칭 운용과 관련한 도면이다."}
