{"patent_id": "10-2020-0100808", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0020171", "출원번호": "10-2020-0100808", "발명의 명칭": "복수의 카메라를 활용한 스마트 주차관리 장치", "출원인": "사이클롭스 주식회사", "발명자": "최남호"}}
{"patent_id": "10-2020-0100808", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "주차장의 출입구, 이동로 및 주차면의 영상을 촬영하는 제1 카메라(100);상기 제1 카메라와 다른 위치에 설치되어 주차장의 출입구, 이동로 및 주차면의 영상을 촬영하는 제2 카메라(200);상기 제1 카메라(100)가 촬영한 영상(101)과 제2 카메라(200)가 촬영한 영상(201)을 기준시점(303)의 영상(301,302)으로 변환하는 시점변환부(300);상기 제1 카메라의 촬영 범위와 제 2 카메라의 촬영 범위가 중복되는 어느 하나 이상의 장소에 위치하는 기준표시장치(400, 401);상기 제1 카메라(100)와 제2 카메라(200)가 촬영한 영상(101, 201)에서 상기 기준표시장치(400)를 검출하고, 시점변환부(300)가 변환한 영상(301, 302)에서 주차장으로 입장하는 차량을 검출(Multi Object Detection; MOD)하는 검출부(500);상기 시점변환부(300)에 의해 변환된 각각의 영상(301, 302)에 대하여 검출부(500)가 검출한 기준표시장치(401)의 자카드 지수(Jaccard Index) 값을 산출하는 영상평가부(600);상기 영상평가부(600)가 계산한 자카드 지수(Jaccard Index) 값 높은 영상에 대하여 검출부(500)가 검출한 차량을 추적(Multi Object Tracking; MOT)하는 추적부(700);상기 추적부(700)가 추적을 개시한 시간을 기준으로 개별 차량의 주차장 이용시간 및 주차요금을 산출하는 요금산출부(800);를 포함하는 것을 특징으로 하는 스마트 주차관리 장치"}
{"patent_id": "10-2020-0100808", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "상기 제1항에 있어서,상기 기준시점은 주차장의 출입구, 이동로, 주차면 중 어느 하나에 대한 법선과 평행한 것을 특징으로 하는 스마트 주차관리 장치"}
{"patent_id": "10-2020-0100808", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "상기 제2항에 있어서,상기 시점변환부(300)는 homography 방식을 통하여 촬영한 영상(201)을 기준시점(303)의 영상(301, 302)으로 변환하는 것을 특징으로 하는 스마트 주차관리 장치"}
{"patent_id": "10-2020-0100808", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "상기 제3항에 있어서,상기 기준표시장치(400)는 주차장의 출입구 또는 이동로의 노면에 표시된 주행방향 표시자(401)인 것을 특징으로 하는 스마트 주차관리 장치"}
{"patent_id": "10-2020-0100808", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 상호보완적인 복수의 CCTV를 활용한 컴퓨터 비전 기술 기반의 영상인식 기술을 활용한 스마트 주차 관리 장치에 관한 것으로, 보다 구체적으로는 기계적 구성에 있어서는 구입, 설치, 운영 등에 있어 높은 비용을 필요로 하는 차량번호인식기, 차량인식센서 등의 인공지능을 활용한 차량인식 및 차량추적으로 대체하고 논리적 구성에 있어서는 차량번호인식을 차량인식, 차량추적 등으로 대체함으로써 저렴한 비용으로 주차장을 운영할 수 있는 영상인식 기술 기반 스마트 주차관리 시스템의 다중객체인식 개선방안에 관한 것이다."}
{"patent_id": "10-2020-0100808", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 다중객체검출, 다중객체추적 등의 기술을 활용하여 차량번호인식기 등의 구성요소 없이 스마트 주 차관리를 구현할 수 있는 장치에 관한 것으로, 보다 구체적으로는 복수의 카메라 영상을 기준시점으로 변환하고 이들 영상을 활용한 기준표시장치 검출 결과를 바탕으로 보다 정확한 영상만을 사용하는 것을 특징으로 하는 스 마트 주차관리 장치에 관한 것이다."}
{"patent_id": "10-2020-0100808", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "기존의 지능형 주차관리 시스템(장치)이나 주차관리 방법은 차량번호인식기 또는 차량번호인식 단계를 필수적 인 구성요소로 하고 있어 구입, 설치, 운영 등에 있어 높은 비용을 필요로 하며, 양호한 조건에서는 98% 이상의 높은 인식률을 나타내지만 조명 조건, 촬영 각도, 해상도 등의 조건이 좋지 않은 경우에는 70% 이하의 낮은 인 식률을 나타내는 것으로 확인된 바 있다. 아울러, 차량번호판 체계의 변경(7→8자리), 친환경 차량 전용번호판 부여 등과 같은 법제도의 개정이나 정부 정책의 변화가 있을 경우, 외국 혹은 미군 차량 등과 같이 우리나라와 다른 차량번호판 체계를 갖는 경우에는 인식률이 현저히 감소하는 문제점이 부각된 바 있다. 상기의 이유로, 기존 지능형 주차관리 시스템 및 방법의 문제점을 개선하기 위한 다중객체인식, 다중객체추적 등의 컴퓨터 비전 기술을 활용한 영상인식 기반의 새로운 지능형 주차관리 방식이 개발 과정 중에 있으나, 다중 객체추적의 정확도 및 안정성이 담보되지 않아 널리 상용화되지는 못하고 있는 상태이다. 본 발명은 상기와 같은 기존 컴퓨터 비전 기술을 활용한 영상인식 기반 스마트 주차관리 장치의 문제점인 정 확도 및 안정성을 개선하기 위하여 복수의 카메라를 활용한 스마트 주차관리 장치를 제공함을 그 목적으로 하고 있다."}
{"patent_id": "10-2020-0100808", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 기존 스마트 주차관제 시스템에서 필수불가결적인 요소인 차량번호인식기, 차량번호인식 단계 등의 구성요소 없이 인공지능 기반의 차량인식, 차량추적 등의 요소기술을 활용하여 기존 지능형 주차관리 시스템(장 치) 및 방법의 단점, 즉, 좋지 않은 환경여건에서의 차량번호 인식률 저하, 법제도 및 정부정책 변화에 따른 차 량번호 인식률 저하, 해외차량 유입 등에 따른 인식률 저하를 원천적으로 해결하며, 기존 컴퓨터 비전 기술을 활용한 영상인식 기반 스마트 주차관리 장치의 문제점인 정확도 및 안정성을 개선하기 위하여 복수의 카메라를 활용한 스마트 주차관리 장치를 제공함을 그 목적으로 하고 있다."}
{"patent_id": "10-2020-0100808", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기의 기술적 과제를 실현하기 위한 본 발명에 따른 스마트 주차관리 장치는, 주차장의 출입구, 이동로 및 주 차면의 영상을 촬영하는 제1 카메라; 상기 제1 카메라와 다른 위치에 설치되어 주차장의 출입구, 이동로 및 주차면의 영상을 촬영하는 제2 카메라; 상기 제1 카메라가 촬영한 영상과 제2 카메라가 촬영한 영상을 기준시점의 영상(301, 302)으로 변환하는 시점변환부; 상기 제1 카메라의 촬영 범위와 제 2 카메라의 촬영 범위가 중복되는 어느 하나 이상의 장소에 위치하는 기준표시장치; 상기 시점 변환부가 변환한 영상(301, 302)에서 주차장으로 입장하는 차량과 상기 기준표시장치를 검출(Multi Object Detection; MOD)하는 검출부; 상기 시점변환부에 의해 변환된 각각의 영상(301, 302)에 대하 여 검출부가 검출한 기준표시장치의 자카드 지수(Jaccard Index) 값을 산출하는 영상평가부; 상 기 영상평가부가 계산한 자카드 지수(Jaccard Index) 값 높은 영상에 대하여 검출부가 검출한 차량을추적(Multi Object Tracking; MOT)하는 추적부; 상기 추적부가 추적을 개시한 시간을 기준으로 개별 차량의 주차장 이용시간 및 주차요금을 산출하는 요금산출부;를 포함하는 것을 특징으로 하는 스마트 주차 관리 장치를 제공한다"}
{"patent_id": "10-2020-0100808", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 차량번호인식기, 차량인식기(각종 센서류) 등을 포함하지 않고 다중객체인식, 다중객체추적 등과 같 은 컴퓨터 비전 기술 기반의 스마트 주차관리 장치를 제공함으로써 차량번호인식기 기반의 기존 스마트 주차관 리 장치에 비하여 조명, 해상도, 촬영각도 등의 제반 여건 변화에 따른 인식률 저하를 원천적으로 개선함은 물 론 차량번호판 체계의 변경(7→8자리), 친환경 차량 전용번호판 부여 등과 같은 법제도의 개정이나 정부정책의 변화나 해외차량 유입 등에 따른 인식률 의존성(저하)도 원천적으로 개선할 수 있으며, 복수의 카메라 영상을 활용하여 안정성을 제고함은 물론 정확도가 높은 영상만을 사용함으로써 장치의 정확도는 물론 전산처리에 사용 되는 재원도 최소화 할 수 있는 스마트 주차관리 장치를 제공함을 그 목적으로 하고 있다."}
{"patent_id": "10-2020-0100808", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명을 첨부된 도면을 참조하여 상세히 설명하면 다음과 같다. 도 1은 본 발명에 따른 스마트 주차관리 장치의 개략적인 구성으로, 제1 카메라와 제2 카메라는 보안 CCTV용 저해상도 카메라, 최신 고해상도 카메라 등은 물론 이미 상용제품으로 널리 판매 중인 연산처리, 통신 등의 기능을 내장한 다기능카메라가 사용될 수 있으며, 주차장의 출입구, 이동로 및 주차면의 영상을 촬영할 수 있는 장소에 설치한다. 다만, 제2 카메라는 상기 제1 카메라와 다른 위치에 설치된다. 기준표시장치 (400, 401)은 주차장 내부의 지정된 장소에 위치하는 구조물 또는 표식이며, 출입구 또는 이동로의 노면에 표시 된 주행방향 표시자(화살표 등), 주차구획선, 소방안전선 등의 표식이나 경계석, 스토퍼, 요금수납 부스 등과 같이 주차장 내에 위치하는 인조 구조물은 물론 바위 등과 같은 자연 구조물도 사용될 수 있다. 시점변환부은 제1 카메라와 제2 카메라의 영상을 전송받아 기준시점으로 변환하며, 이때 기준 시점은 제1 카메라의 시점, 제2 카메라의 시점, 주차장의 출입구, 이동로, 주차면 중 어느 하나에 대 한 법선과 평행하여 주차장의 평면도를 구현할 수 있는 시점 등이 사용될 수 있다. 영상의 시점을 다른 시점을 기준으로 변환하기 위한 대표적인 방법으로는 homography 가 있으며, 직접적으로 평 면 이미지에서 다른 관점에서의 평면 이미지로 변환을 진행할 수 있는 homography 외에도 voxel coloring, space carving, 그리고 LSTM(Long Short Term Memory), GRU(Gated Recurrent Unit) 등을 CNN과 결합한 3DR2N2(Deep NN for 3D reconstruction) 등의 single/multiple view 3d reconstruction 기술을 활용하여 영상 내 물체들에 대한 3D 모델을 구축한 후, 변경된 시점에서의 2D 이미지(영상)을 생성하는 방식 등을 활용할 수 있다. 상기 homography란 주어진 이미지에 평행이동, 회전, 크기, 시점의 변환 등을 적용하여 변환된 이미지를 얻어 내는 방식이다. 두 개의 카메라가 특정 물체를 동일하지 않은 관점에서 촬영 시, 첫 번째 카메라의 촬영물과 두 번째 카메라의 촬영물 안의 각 점들 사이에서의 관계를 찾아내는 방식이다. 이를 이용하여, 주어진 불변의 기준 표시장치를 기준으로 상기 각 카메라(100, 200)에서의 촬영물(101, 201)들과 기준관점에서의 기준표 시장치의 촬영물 간의 상호관계를 분석하여 영상(101, 201) 내 기준표시장치를 제외한 이미지 또한 기준관점에서의 시점으로 변환할 수 있다. 상기 알고리즘 중 LSTM은 1997년 Hochreiter와 Schmidhuber에 의해 고안되었으며, CTC 학습된 LSTM은 2009년 Graves et al.에 의해 발표된 “Offline Handwriting Recognition with Multidimensional Recurrent Neural Network”를 통해, CNN과 결합된 LSTM은 Vinyals et al.에 의해 발표된 “Show and Tell: A Neural Image Caption Generator”을 통해, GRU의 경우 2014년 조경현, et al.을 통해 발표된 “Learning Phrase Representations using RNN Encoder-Decoder for Statistical Machine Translation”을 통해 공개된 바 있으며 이후 딥러닝 분야에서 널리 활용되고 있다. 상기 검출부, 영상평가부, 추적부에서는 R-CNN(Region-based Convolutional Neural Network), Fast R-CNN, Faster R-CNN, YOLO(You Only Look Once), SSD(Single Shot Multi-box Detector), Deep SORT(Simple Online and Real-Time Tracking), Hungarian(Kuhn-Munkres) 등의 알고리즘을 활용할 수 있다. 상기 검출부는 상기 시점변환부에서 변환된 시점의 영상들(301,302)을 토대로 주차장으로 입장 하는 차량 및 상기 기준표시장치을 검출해낸 후, 해당 정보를 영상평가부로 전송하며, 상기 영상평가 부는 상기 검출부에서 검출한 상기 기준표시장치를 기준으로 각 영상(301, 302)에 대한 기준표 시장치의 자카드 지수(Jaccard Index)를 계산하여 비교하고, 그 중 높은 자카드 지수 값을 가진 영상과 상기 검 출부에서 해당영상에서 특정한 차량 정보를 추적부로 전송한다. 영상 및 차량정보를 전송받은 추적부 는 객체인식 및 특정된 차량에 대한 객체추적을 실시한다. 상기 알고리즘 중 R-CNN 알고리즘은 2014년 CVPR을 통해 발표된 “Rich feature hierarchies for accurate object detection and semantic segmentation Tech report (v5)”을 통해, Fast R-CNN 알고리즘은 2015년 ICCV를 통해 발표된 “Fast R-CNN”을 통해, Faster R-CNN 알고리즘은 2015년 NIPS를 통해 발표된 “Faster R- CNN: Towards Real-Time Object Detection with Region Proposal Networks”를 통해, YOLO v1, v2, v3 알고리 즘은 각각 2016년 CVPR, 2017년 CVPR, 2018년 arXiv에 발표된 “YOLOv3: An Incremental Improvement” 등을 통해, SSD는 2016년 ECCV에 발표된 “SSD: Single Shot MultiBox Detector” 등을 통해, Deep SORT는 2017년 arXiv에 발표된 “Simple Online and Realtime Tracking with a Deep Association Metric” 등을 통해, Hungarian(Kuhn-Munkres)는 2018년 arXiv에 발표된 “A Distributed Version of the Hungarian Method for Multi-Robot Assignment” 등을 통해 공개된 바 있으며 이후 컴퓨터 비전 분야에서 널리 활용되고 있다. 상기 요금산출부는 상기 추적부가 개별 객체에 대한 추적을 개시한 시점을 기준으로 개별 차량의 주 차장 이용시간 및 주차요금을 실시간으로 연속하여 산출하거나 일정 시간단위(예시 : 5초, 10초, 30초, 1분 등)로 산출하게 할 수도 있다. 이상의 내용을 고려할 때, 이 출원 명세서의 특허청구범위에 기재된 발명들은 발명의 상세한 설명에 의하여 뒷"}
{"patent_id": "10-2020-0100808", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "받침되며 이 기술이 속하는 기술분야에서 통상의 지식을 가진 자가 이 발명의 출원 명세서에 기재된 사항을 바 탕으로 용이하게 실시할 수 있음이 명백하다."}
{"patent_id": "10-2020-0100808", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 스마트 주차관리 장치의 개략적인 구성"}
