{"patent_id": "10-2019-0119158", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0037064", "출원번호": "10-2019-0119158", "발명의 명칭": "로봇 청소기", "출원인": "엘지전자 주식회사", "발명자": "김종훈"}}
{"patent_id": "10-2019-0119158", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "바디;바닥과 마주하는 제1 걸레가 하측에 결합되고, 상기 바디에 회전가능하게 결합되는 제1 회전판;바닥과 마주하는 제2 걸레가 하측에 결합되고, 상기 바디에 회전가능하게 결합되는 제2 회전판;상기 제1 걸레 및 상기 제2 걸레와 이격되어 상기 바디에 결합되는 제1 지지바퀴 및 제2 지지바퀴; 및상기 바디의 하측에 형성되고, 바닥과의 상대적인 거리를 감지하도록 이루어지는 제1 하부센서를 포함하고,상기 제1 회전판의 중심과 상기 제2 회전판의 중심을 연결하는 가상의 연결선을 기준으로, 상기 제1 지지바퀴,상기 제2 지지바퀴 및 상기 제1 하부센서는 같은 쪽에 위치하고,상기 제1 하부센서는, 상기 바디의 테두리 방향을 따라 상기 제1 바퀴와 상기 제2 바퀴 사이에 위치하되, 상기연결선으로부터 상기 제1 바퀴 및 상기 제2 바퀴보다 멀리 위치하는,로봇 청소기."}
{"patent_id": "10-2019-0119158", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제1 하부센서에 의해 감지되는 거리에 따라, 상기 제1 회전판 및 상기 제2 회전판 중 어느 하나 이상의 회전이 제어되는,로봇 청소기."}
{"patent_id": "10-2019-0119158", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 제1 하부센서가 감지하는 방향은, 상기 바디의 테두리쪽을 향하여 하향 경사지는,로봇 청소기."}
{"patent_id": "10-2019-0119158", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 제1 회전판의 중심에서 상기 제1 지지바퀴까지의 거리는, 상기 제2 회전판의 중심에서 상기 제2 지지바퀴까지의 거리와 같은,로봇 청소기."}
{"patent_id": "10-2019-0119158", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 제1 지지바퀴는 상기 제2 회전판보다 상기 제1 회전판과 가깝게 위치하고,상기 제2 지지바퀴는 상기 제1 회전판보다 상기 제2 회전판과 가깝게 위치하며,상기 제1 지지바퀴의 중심과 상기 제2 지지바퀴의 중심 간의 수평거리가 L1이고, 상기 제1 회전판의 회전중심과상기 제2 회전판의 회전중심 간의 거리가 L2일 때, L1은 0.8*L2보다 크고 1.2*L2보다 작은,로봇 청소기.공개특허 10-2021-0037064-3-청구항 6 제1항에 있어서,상기 제1 회전판과 상기 제2 회전판은 서로 대칭을 이루고,상기 제1 지지바퀴와 상기 제2 지지바퀴는 서로 대칭을 이루는,로봇 청소기."}
{"patent_id": "10-2019-0119158", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 제1 지지바퀴의 회전축 및 상기 제2 지지바퀴의 회전축은, 상기 연결선과 평행한,로봇 청소기."}
{"patent_id": "10-2019-0119158", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 로봇 청소기의 무게중심이, 상기 제1 회전판의 중심, 상기 제2 회전판의 중심, 상기 제1 지지바퀴의 중심 및 상기 제2 지지바퀴의 중심을각 꼭지점으로 하는 사각형의 연직방향 영역 내부에 위치하는,로봇 청소기."}
{"patent_id": "10-2019-0119158", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 제1 걸레, 상기 제2 걸레, 상기 제1 지지바퀴 및 상기 제2 지지바퀴에 의해 4점 지지되고,상기 제1 하부센서는, 상기 제1 지지바퀴와 상기 제2 지지바퀴 사이에 위치하는,로봇 청소기."}
{"patent_id": "10-2019-0119158", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 연결선을 기준으로 상기 제1 지지바퀴 및 상기 제2 지지바퀴와 같은 쪽에서 상기 바디의 하측에 형성되고,바닥과의 상대적인 거리를 감지하도록 이루어지는 제2 하부센서 및 제3 하부센서를 포함하고,상기 제2 하부센서는, 상기 제1 지지바퀴를 기준으로 상기 제1 하부센서의 반대쪽에 위치하고,상기 제3 하부센서는, 상기 제2 지지바퀴를 기준으로 상기 제1 하부센서의 반대쪽에 위치하는,로봇 청소기."}
{"patent_id": "10-2019-0119158", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서,상기 연결선을 기준으로 상기 제1 지지바퀴 및 상기 제2 지지바퀴와 같은 쪽에서 상기 바디의 하측에 형성되고,바닥과의 상대적인 거리를 감지하도록 이루어지는 제2 하부센서 및 제3 하부센서를 포함하고,상기 제2 하부센서 또는 상기 제3 하부센서에 의해 감지되는 거리에 따라, 상기 제1 회전판 및 상기 제2 회전판중 어느 하나 이상의 회전이 제어되며,상기 제2 하부센서 및 상기 제3 하부센서는,상기 제1 회전판의 중심, 상기 제2 회전판의 중심, 상기 제1 지지바퀴의 중심 및 상기 제2 지지바퀴의 중심을각 꼭지점으로 하는 사각형의 연직방향 영역 외부에 위치하는,공개특허 10-2021-0037064-4-로봇 청소기."}
{"patent_id": "10-2019-0119158", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 연결선으로부터 상기 제2 하부센서까지의 거리 및 상기 연결선으로부터 상기 제3 하부센서까지의 거리는,상기 연결선으로부터 상기 제1 지지바퀴까지의 거리 및 상기 연결선으로부터 상기 제2 지지바퀴까지의 거리보다짧은,로봇 청소기."}
{"patent_id": "10-2019-0119158", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제1항에 있어서,상기 바디에 결합되어 상기 제1 회전판을 회전시키도록 이루어지는 제1 액추에이터;상기 바디에 결합되어 상기 제2 회전판을 회전시키도록 이루어지는 제2 액추에이터; 및상기 제1 하부센서에 의해 감지되는 거리에 따라, 상기 제1 액추에이터 및 상기 제2 액추에이터 중 어느 하나이상의 작동을 제어하는 제어부를 포함하는,로봇 청소기."}
{"patent_id": "10-2019-0119158", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 연결선을 기준으로 상기 제1 하부센서와 같은 쪽에서 상기 바디의 테두리를 따라 결합되되, 상기 바디를상대로 움직이도록 결합되는 범퍼; 및상기 바디에 결합되고, 상기 바디를 상대로 한 상기 범퍼의 움직임을 감지하는 제1 센서를 포함하고,상기 제어부는, 상기 제1 센서에 의한 정보에 따라 상기 제1 액추에이터 및 상기 제2 액추에이터 중 어느 하나이상의 작동을 제어하는,로봇 청소기."}
{"patent_id": "10-2019-0119158", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제1항에 있어서,상기 연결선을 기준으로 상기 제1 하부센서와 같은 쪽에서 상기 바디의 테두리를 따라 결합되되, 상기 바디를상대로 움직이도록 결합되는 범퍼; 및상기 바디에 결합되고, 상기 바디를 상대로 한 상기 범퍼의 움직임을 감지하는 제1 센서를 포함하고,상기 제1 센서에 의한 정보에 따라, 상기 제1 회전판 및 상기 제2 회전판 중 어느 하나 이상의 회전이제어되며,상기 연결선을 기준으로 상기 범퍼와 같은 쪽을 이루는 상기 바디의 가장 낮은 부분은 상기 범퍼의 가장 낮은부분보다 높거나 같은,로봇 청소기."}
{"patent_id": "10-2019-0119158", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 바디의 저면에는 상기 제1 하부센서를 노출시키는 구멍인 제1 센서홀이 구비되고,상기 제1 센서홀은 상기 바디의 테두리를 향하여 하향 경사지는,로봇 청소기.공개특허 10-2021-0037064-5-청구항 17 제16항에 있어서,상기 바디의 저면에는, 상기 제1 센서홀과 연결되는 오목한 홈인 제1 센서홈이 형성되고,상기 범퍼의 저면에는, 상기 제1 센서홈과 연결되는 오목한 홈인 제1 범퍼홈이 형성되며,상기 제1 센서홀, 상기 제1 센서홈 및 상기 제1 범퍼홈은, 상기 바디의 반경방향을 따라 배열되는,로봇 청소기."}
{"patent_id": "10-2019-0119158", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "바디;바닥을 면접촉하며 닦도록, 상기 바디에 회전가능하게 결합되는 제1 걸레 및 제2 걸레;상기 제1 걸레의 앞쪽에서 상기 바디의 하측에 결합되는 제1 지지바퀴;상기 제2 걸레의 앞쪽에서 상기 바디의 하측에 결합되는 제2 지지바퀴;상기 제1 지지바퀴와 상기 제2 지지바퀴의 사이에 위치하되, 상기 제1 지지바퀴 및 상기 제2 지지바퀴보다 앞에서 상기 바디의 하측에 형성되고, 바닥과의 상대적인 거리를 감지하도록 이루어지는 제1 하부센서를 포함하고,상기 제1 하부센서에 의해 감지되는 거리에 따라, 상기 제1 걸레 및 상기 제2 걸레 중 어느 하나 이상의 회전이제어되는,로봇 청소기."}
{"patent_id": "10-2019-0119158", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "바디;상기 바디의 하측에 회전가능하게 결합되는 제1 회전판 및 제2 회전판;상기 제1 회전판의 저면에 탈부착되는 제1 걸레;상기 제2 회전판의 저면에 탈부착되는 제2 걸레;상기 제1 걸레의 앞쪽에서 상기 바디의 하측에 결합되는 제1 지지바퀴;상기 제2 걸레의 앞쪽에서 상기 바디의 하측에 결합되는 제2 지지바퀴; 및상기 제1 지지바퀴와 상기 제2 지지바퀴의 사이에 위치하되, 상기 제1 지지바퀴 및 상기 제2 지지바퀴보다 앞쪽에서 상기 바디의 하측에 형성되고, 바닥과의 상대적인 거리를 감지하도록 이루어지는 제1 하부센서를포함하고,상기 제1 하부센서에 의해 감지되는 거리에 따라, 상기 제1 회전판 및 상기 제2 회전판 중 어느 하나 이상의 회전이 제어되는,로봇 청소기."}
{"patent_id": "10-2019-0119158", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제18항 또는 제19항에 있어서,상기 제1 걸레의 앞쪽에서 상기 바디의 하측에 형성되고, 바닥과의 상대적인 거리를 감지하도록 이루어지는 제2하부센서; 및상기 제2 걸레의 앞쪽에서 상기 바디의 하측에 형성되고, 바닥과의 상대적인 거리를 감지하도록 이루어지는 제3하부센서를 포함하고,상기 바디의 테두리 방향을 따라, 상기 제2 하부센서, 상기 제1 지지바퀴, 상기 제1 하부센서, 상기 제2 지지바퀴 및 상기 제3 하부센서 순서로 배열되는,공개특허 10-2021-0037064-6-로봇 청소기."}
{"patent_id": "10-2019-0119158", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "로봇 청소기가 제공된다. 본 발명의 일 실시예에 따른 로봇 청소기는, 바디, 제1 회전판, 제2 회전판, 제1 걸레, 제2 걸레, 제1 지지바퀴, 제2 지지바퀴 및 제1 하부센서를 포함하여 이루어진다. 제1 하부센서는 바닥과의 상대 적인 거리를 감지하도록 이루어진다. 제1 하부센서는, 제1 지지바퀴와 제2 지지바퀴 사이에 위치하고, 제1 회전 판 및 제2 회전판으로부터 제1 바퀴 및 제2 바퀴보다 멀게 위치한다. 본 발명의 실시예에 따르면, 로봇 청소기가 제1 걸레, 제2 걸레, 제1 지지바퀴 및 제2 지지바퀴에 의해 지지되어 이동할 수 있고, 바닥이 갑자기 낮아지는 낭떠러지를 용이하게 회피할 수 있다."}
{"patent_id": "10-2019-0119158", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 로봇 청소기에 관한 것으로, 보다 상세하게는, 바닥에 접촉하여 회전하면서 걸레질하는 한 쌍의 걸레, 및 걸레와 함께 바닥에 접촉하는 한 쌍의 바퀴를 포함하는 로봇 청소기에 관한 것이다."}
{"patent_id": "10-2019-0119158", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "모터, 각종센서 및 인공지능(AI) 등을 포함하여 이루어지는 로봇청소기는, 청소가 필요한 영역을 스스로 주행하 면서 청소하도록 이루어질 수 있다. 로봇청소기는, 진공에 의해 먼지 등을 흡입하거나, 먼지를 쓸어 담거나, 또는 걸레를 이용하여 청소면을 닦는 형태 등으로 이루어질 수 있다. 로봇청소기와 관련된 선행문헌으로서 한국등록특허 제1613446호(이하, '선행문헌 1'이라고 함)는 '로봇 청소기 및 그의 제어방법'을 개시하고 있으며, 선행문헌 1에 따른 로봇 청소기는 본체, 구동부, 제1 회전 부재 및 제2 회전 부재를 포함하도록 하고 있다. 또한, 선행문헌 1의 로봇 청소기는, 천, 걸레, 부직포, 브러시 등으로 이루 어지는 제1 클리너 및 제2 클리너를 포함하고, 제1 클리너는 제1 회전 부재의 제1 고정 부재에 결합되고, 제2 클리너는 제2 회전 부재의 제2 고정 부재에 결합된다. 선행문헌 1에 따르면, 제1 회전 부재 및 제2 회전 부재의 회전 운동에 의해 제1 클리너와 제2 클리너가 회전함 에 따라 바닥면과의 마찰을 통해 바닥에 고착된 이물질 등을 제거할 수 있고, 바닥면과의 마찰력이 생성되면 그 마찰력은 로봇 청소기를 이동시키는 동력으로 이용될 수 있다. 즉, 선행문헌 1은, 제1 클리너 및 제2 클리너의 회전시, 바닥의 청소 및 로봇 청소기의 이동이 함께 이루어질 수 있음을 기재하고 있다. 그러나 선행문헌 1은, 로봇 청소기가 전체적으로 평평한 면을 이루는 바닥면 상에서 이동하는 것만을 고려하고 있는데, 실제 청소시에는, 바닥면이 단차를 이루며 낮아지거나 바닥면의 높이가 갑자기 낮아지는 경우 등도 있 을 수 있으며, 선행문헌 1은 이러한 경우의 바닥에 대비하지 못하고 있다. 즉, 선행문헌 1에 의할 경우 로봇 청 소기가 바닥 밑으로 떨어져 파손되는 문제점이 발생될 수 있다. 로봇청소기와 관련된 다른 선행문헌으로서 한국등록특허 제2000068호(이하, 선행문헌 2'라고 함)는 청소기를 개 시하고, 이에 따른 청소기는 걸레부를 포함하는 맙 모듈 및 수거모듈을 포함하여 이루어지고, 수거 모듈을 통하 여 바닥의 이물질을 수거하고, 맙 모듈에 의하여 바닥을 닦도록 이루어진다. 그리고 선행문헌 2에 따른 청소기는 낭떠러지의 존재 여부를 감지하는 낭떠러지 감지센서를 포함하도록 하고 있 으며, 수거모듈의 하측에 낭떠러지 감지센서가 구비되도록 하고 있다. 다만, 선행문헌 2는, 보조바퀴보다 상대적으로 뒤쪽에 낭떠러지 센서가 구비되도록 하고 있어, 보조바퀴가 낭떠 러지 센서에 의한 감지를 방해하거나 감지범위를 제한할 수 있으며, 특히 청소기가 앞쪽으로 전진할 때 낭떠러 지 센서에 의한 대비가 제대로 이루어지지 않을 수 있다. 또한, 선행문헌 2의 청소기가 선회하는 경우, 보조바퀴가 낭떠러지로 진입하기 이전에 낭떠러지 센서에 의한 대 비가 제대로 이루어지지 않을 수 있다."}
{"patent_id": "10-2019-0119158", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 일 과제는, 바닥에 접촉하면서 회전하는 한 쌍의 걸레, 및 로봇 청소기를 지지하는 한 쌍의 바퀴를 구비하는 형태의 로봇 청소기에서, 바퀴가 낭떠러지로 진입하기 전에 낭떠러지를 회피할 수 있 는 로봇 청소기를 제공하는 것이다. 본 발명이 해결하고자 하는 다른 과제는, 한 쌍의 바퀴에 의해 로봇 청소기의 안정적인 지지가 이루어지면서, 센서에 의한 낭떠러지의 감지가 바퀴에 의해 제한되거나 방해받지 않고 효과적으로 이루어질 수 있는 로봇 청소 기를 제공하는 것이다.본 발명이 해결하고자 하는 또 다른 과제는, 로봇 청소기의 직진, 선회 또는 곡선방향 이동시, 바퀴가 낭떠러지 로 진입하기 전에 낭떠러지를 회피할 수 있는 로봇 청소기를 제공하는 것이다. 본 발명이 해결하고자 하는 또 다른 과제는, 바퀴 주변에서의 낭떠러지의 감지가 효과적으로 이루어질 수 있는 로봇 청소기를 제공하는 것이다. 본 발명이 해결하고자 하는 또 다른 과제는, 바닥면 위에 위치하는 장애물과의 접촉여부의 감지, 및 낭떠러지의 감지가 모두 효과적으로 이루어질 수 있는 로봇 청소기를 제공하는 것이다."}
{"patent_id": "10-2019-0119158", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 과제를 달성하기 위하여 본 발명의 실시예에 따른 로봇 청소기는, 바디, 제1 걸레 및 제2 걸레를 포함하여 이루어질 수 있다. 본 발명의 실시예에 따른 로봇 청소기는, 별도의 외력이 가해지지 않더라도 스스로 이동할 수 있도록 이루어질 수 있다. 즉, 본 발명의 실시예에 따른 청소기는 통상의 '로봇청소기'와 같이 움직이도록 이루어질 수 있다. 상기 바디는 로봇 청소기의 전체적인 외형을 이루거나, 로봇 청소기의 다른 구성들이 결합되는 프레임과 같이 이루어질 수 있다. 상기 제1 걸레는, 바닥을 면접촉하며 닦도록 이루어지고, 상기 바디에 회전가능하게 결합될 수 있다. 상기 제2 걸레는, 바닥을 면접촉하며 닦도록 이루어지고, 상기 제1 걸레와 이격되어, 상기 바디에 회전가능하게 결합될 수 있다. 본 발명의 실시예에 따른 로봇 청소기는, 제1 회전판 및 제2 회전판을 포함하여 이루어질 수 있고, 상기 제1 걸 레는 상기 제1 회전판을 매개로 상기 바디에 회전가능하게 결합되고, 상기 제2 걸레는 상기 제2 회전판을 매개 로 상기 바디에 회전가능하게 결합될 수 있다. 상기 제1 회전판 및 상기 제2 회전판 각각은 상기 바디에 회전가능하게 결합된다. 상기 제1 회전판은 상기 바디 의 하측에 결합될 수 있고, 상기 제2 회전판 또한 상기 바디의 하측에 결합될 수 있다. 상기 제1 걸레는 상기 제1 회전판의 저면에 탈부착되도록 이루어지고, 상기 제1 회전판에 결합되어 상기 제1 회 전판과 함께 회전할 수 있다. 상기 제1 걸레는, 로봇 청소기의 작동시, 바닥과 마주한다. 상기 제2 걸레는 상기 제2 회전판의 저면에 탈부착되도록 이루어지고, 상기 제2 회전판에 결합되어 상기 제2 회 전판과 함께 회전할 수 있다. 상기 제2 걸레는, 로봇 청소기의 작동시, 바닥과 마주한다. 본 발명의 실시예에 따른 로봇 청소기는, 제1 지지바퀴 및 제2 지지바퀴를 포함하여 이루어지고, 제1 지지바퀴 및 제2 지지바퀴는 바닥면에 닿아 로봇 청소기를 지지하도록 이루어질 수 있다. 본 발명의 실시예에 따른 로봇 청소기는, 로봇 청소기가 낭떠러지로 떨어지는 것을 방지하도록 하기 위하여, 제 1 하부센서를 포함하여 이루어진다. 상기 제1 하부센서는, 상기 바디의 하측에 형성되고, 바닥과의 상대적인 거리를 감지하도록 이루어진다. 상기 제1 하부센서는, 광센서로 이루어질 수 있고, 빛을 조사하는 발광부 및 반사된 빛이 입사되는 수광부를 포함하 여 이루어질 수 있다. 상기 제1 하부센서는 적외선센서로 이루어질 수 있다. 본 발명의 실시예에 따른 로봇 청소기에서, 상기 제1 회전판의 중심과 상기 제2 회전판의 중심을 연결하는 가상 의 연결선을 기준으로, 상기 제1 지지바퀴, 상기 제2 지지바퀴 및 상기 하부센서는 같은 쪽에 위치하도록 이루 어진다. 본 발명의 실시예에 따른 로봇 청소기에서는, 로봇 청소기가 직진 또는 회전함에 있어서, 로봇 청소기가 낭떠러 지로 진입하기 전에 상기 제1 하부센서에 의한 낭떠러지의 감지가 이루어질 수 있도록, 상기 제1 하부센서는, 상기 바디의 테두리 방향을 따라 상기 제1 바퀴와 상기 제2 바퀴 사이에 위치하되, 상기 연결선으로부터 상기 제1 바퀴 및 상기 제2 바퀴보다 멀리 위치한다. 본 발명의 실시예에 따른 로봇 청소기에서는, 상기 제1 하부센서에 의해 감지되는 거리에 따라, 상기 제1 회전 판 및 상기 제2 회전판 중 어느 하나 이상의 회전이 제어될 수 있다. 본 발명의 실시예에 따른 로봇 청소기에서는, 로봇 청소기의 이동방향 앞쪽에 위치하는 낭떠러지의 감지가 신속 하게 이루어지도록, 상기 제1 하부센서가 감지하는 방향은, 상기 바디의 테두리쪽을 향하여 하향 경사지게 이루 어질 수 있다. 본 발명의 실시예에 따른 로봇 청소기에서, 상기 제1 회전판의 중심에서 상기 제1 지지바퀴까지의 거리는, 상기 제2 회전판의 중심에서 상기 제2 지지바퀴까지의 거리와 같게 이루어질 수 있다. 본 발명의 실시예에 따른 로봇 청소기에서, 상기 제1 지지바퀴는 상기 제2 회전판보다 상기 제1 회전판과 가깝 게 위치하고, 상기 제2 지지바퀴는 상기 제1 회전판보다 상기 제2 회전판과 가깝게 위치하며, 상기 제1 지지바 퀴의 중심과 상기 제2 지지바퀴의 중심 간의 수평거리가 L1이고, 상기 제1 회전판의 회전중심과 상기 제2 회전 판의 회전중심 간의 거리가 L2일 때, L1은 0.8*L2보다 크고 1.2*L2보다 작게 이루어질 수 있다. 본 발명의 실시예에 따른 로봇 청소기에서, 상기 제1 회전판과 상기 제2 회전판은 서로 대칭을 이루고, 상기 제 1 지지바퀴와 상기 제2 지지바퀴는 서로 대칭을 이룰 수 있다. 상기 제1 지지바퀴의 회전축 및 상기 제2 지지바퀴의 회전축은, 상기 연결선과 평행하게 이루어질 수 있다. 본 발명의 실시예에서, 상기 로봇 청소기의 무게중심이, 상기 제1 회전판의 중심, 상기 제2 회전판의 중심, 상 기 제1 지지바퀴의 중심 및 상기 제2 지지바퀴의 중심을 각 꼭지점으로 하는 사각형의 연직방향 영역 내부에 위 치할 수 있다. 본 발명의 실시예에 따른 로봇 청소기에서, 상기 제1 걸레, 상기 제2 걸레, 상기 제1 지지바퀴 및 상기 제2 지 지바퀴에 의해 4점 지지되고, 상기 제1 하부센서는, 상기 제1 지지바퀴와 상기 제2 지지바퀴 사이에 위치할 수 있다. 본 발명의 실시예에 따른 로봇 청소기는 제2 하부센서 및 제2 하부센서를 더 포함하여 이루어질 수 있다. 상기 제2 하부센서 및 상기 제3 하부센서는, 상기 연결선을 기준으로 상기 제1 지지바퀴 및 상기 제2 지지바퀴 와 같은 쪽에서 상기 바디의 하측에 형성되고, 바닥과의 상대적인 거리를 감지하도록 이루어질 수 있다. 상기 제2 하부센서 및 상기 제3 하부센서 각각은, 광센서로 이루어질 수 있고, 빛을 조사하는 발광부 및 반사된 빛이 입사되는 수광부를 포함하여 이루어질 수 있다. 상기 제2 하부센서 및 상기 제3 하부센서는 적외선센서로 이루 어질 수 있다. 상기 제2 하부센서는, 상기 제1 지지바퀴를 기준으로 상기 제1 하부센서의 반대쪽에 위치하도록 이루어질 수 있 다. 상기 제3 하부센서는, 상기 제2 지지바퀴를 기준으로 상기 제1 하부센서의 반대쪽에 위치하도록 이루어질 수 있다. 본 발명의 실시예에 따른 로봇 청소기에서, 상기 제2 하부센서 또는 상기 제3 하부센서에 의해 감지되는 거리에 따라, 상기 제1 회전판 및 상기 제2 회전판 중 어느 하나 이상의 회전이 제어될 수 있다. 상기 제2 하부센서 및 상기 제3 하부센서는, 상기 제1 회전판의 중심, 상기 제2 회전판의 중심, 상기 제1 지지 바퀴의 중심 및 상기 제2 지지바퀴의 중심을 각 꼭지점으로 하는 사각형의 연직방향 영역 외부에 위치할 수 있 다. 상기 연결선으로부터 상기 제2 하부센서까지의 거리 및 상기 연결선으로부터 상기 제3 하부센서까지의 거리는, 상기 연결선으로부터 상기 제1 지지바퀴까지의 거리 및 상기 연결선으로부터 상기 제2 지지바퀴까지의 거리보다 짧게 이루어질 수 있다. 본 발명의 실시예에 따른 로봇 청소기는, 제1 액추에이터, 제2 액추에이터 및 제어부를 포함하여 이루어질 수 있다. 상기 제1 액추에이터는, 상기 바디에 결합되어 상기 제1 회전판을 회전시키도록 이루어질 수 있다. 상기 제2 액추에이터는, 상기 바디에 결합되어 상기 제2 회전판을 회전시키도록 이루어질 수 있다. 상기 제어부는, 상기 제1 하부센서에 의해 감지되는 거리에 따라, 상기 제1 액추에이터 및 상기 제2 액추에이터 중 어느 하나 이상의 작동을 제어하도록 이루어질 수 있다. 본 발명의 실시예에 따른 로봇 청소기는 범퍼 및 제1 센서를 포함하여 이루어질 수 있다. 상기 범퍼는, 상기 연결선을 기준으로 상기 제1 하부센서와 같은 쪽에서 상기 바디의 테두리를 따라 결합되되, 상기 바디를 상대로 움직이도록 결합된다. 상기 제1 센서는, 상기 바디에 결합되고, 상기 바디를 상대로 한 상기 범퍼의 움직임을 감지하도록 이루어진다. 상기 제어부는, 상기 제1 센서에 의한 정보에 따라 상기 제1 액추에이터 및 상기 제2 액추에이터 중 어느 하나 이상의 작동을 제어하도록 이루어질 수 있다. 본 발명의 실시예에 따른 로봇 청소기에서, 상기 제1 센서에 의한 정보에 따라, 상기 제1 회전판 및 상기 제2 회전판 중 어느 하나 이상의 회전이 제어될 수 있다. 상기 연결선을 기준으로 상기 범퍼와 같은 쪽을 이루는 상기 바디의 가장 낮은 부분은 상기 범퍼의 가장 낮은 부분보다 높거나 같게 이루어질 수 있다. 본 발명의 실시예에 다른 로봇 청소기에서, 상기 바디의 저면에는 상기 제1 하부센서를 노출시키는 구멍인 제1 센서홀이 구비될 수 있다. 상기 제1 센서홀은 상기 바디의 테두리를 향하여 하향 경사지게 이루어질 수 있다. 상기 바디의 저면에는, 상기 제1 센서홀과 연결되는 오목한 홈인 제1 센서홈이 형성될 수 있다. 상기 범퍼의 저면에는, 상기 제1 센서홈과 연결되는 오목한 홈인 제1 범퍼홈이 형성될 수 있다. 상기 제1 센서홀, 상기 제1 센서홈 및 상기 제1 범퍼홈은, 상기 바디의 반경방향을 따라 배열될 수 있다."}
{"patent_id": "10-2019-0119158", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따른 로봇 청소기는, 바닥에 접촉하면서 회전하는 제1 걸레 및 제2 걸레와, 로봇 청소기를 지지하는 제1 바퀴 및 제2 바퀴를 포함하여 이루어진다. 제1 걸레, 제2 걸레, 제1 바퀴 및 제2 바퀴에 의해 로 봇 청소기의 이동 및 지지가 이루어진다. 제1 하부센서가 바디의 테두리 방향을 따라 제1 바퀴와 제2 바퀴 사이 에 위치하고, 또한 연결선으로부터 제1 바퀴 및 제2 바퀴보다 멀리 위치한다. 이에 따라, 본 발명의 실시예에 따른 로봇 청소기는, 직진(전진)뿐 아니라 선회 또는 곡선방향 이동시에도 낭떠러지를 효과적으로 감지하고 제1 바퀴 또는 제2 바퀴가 낭떠러지로 진입하기 전에 낭떠러지를 효과적으로 회피할 수 있다. 본 발명의 실시예에 따른 로봇 청소기는, 제1 하부센서, 제2 하부센서 및 제3 하부센서를 포함한다. 연결선으로 부터 제2 하부센서까지의 거리 및 연결선으로부터 제3 하부센서까지의 거리는, 연결선으로부터 제1 지지바퀴까 지의 거리 및 연결선으로부터 제2 지지바퀴까지의 거리보다 짧게 이루어진다. 제2 하부센서 및 제3 하부센서는, 제1 회전판의 중심, 제2 회전판의 중심, 제1 지지바퀴의 중심 및 제2 지지바퀴의 중심을 각 꼭지점으로 하는 사 각형의 연직방향 영역 외부에 위치한다. 이에 따라, 로봇 청소기의 전진, 선회 및 곡선방향 이동시 제1 하부센 서, 제2 하부센서 및 제3 하부센서에 의한 낭떠러지의 감지가 제1 바퀴 및 제2 바퀴에 의해 제한되거나 방해받 지 않고, 낭떠러지를 효과적으로 회피할 수 있다. 본 발명의 실시예에 따른 로봇 청소기에서, 제2 하부센서는 제1 지지바퀴를 기준으로 제1 하부센서의 반대쪽에 위치하고, 제3 하부센서는 제2 지지바퀴를 기준으로 제1 하부센서의 반대쪽에 위치하도록 이루어진다. 이에 따 라, 제1 지지바퀴 및 제2 지지바퀴 주변에서 낭떠러지의 감지가 효과적으로 이루어질 수 있다. 본 발명의 실시예에 따른 로봇 청소기는 범퍼 및 제1 센서를 포함하고, 제1 하부센서가 수용되는 구멍인 제1 센 서홀이 바디의 테두리를 향하여 하향 경사지게 이루어진다. 이에 따라, 범퍼 및 제1 센서에 의하여, 바닥면 위 에 위치하는 장애물과의 접촉여부의 감지와, 제1 하부센서에 의하여 낭떠러지의 감지가 모두 효과적으로 이루어 질 수 있는 로봇 청소기를 제공할 수 있다. 본 발명의 실시예에 따른 로봇 청소기에 의해 발휘되는 더욱 구체적인 효과 및 추가적인 효과에 대하여는, 첨부 된 도면을 참조하여 이하에서 설명하도록 한다."}
{"patent_id": "10-2019-0119158", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명을 보다 구체적으로 설명하기 위하여 본 발명에 따른 실시예들을 첨부 도면을 참조하면서 보다 상 세하게 설명하고자 한다. 상세한 설명 전체에 걸쳐 동일한 참조번호는 동일한 구성요소를 나타낸다. 첨부된 도면에 표시된 X방향, Y방향, Z방향은 서로 직교하는 방향이다. 도 1은 본 발명의 일 실시예에 따른 로봇 청소기를 도시한 사시도이고, 도 2는, 도 1에 도시된 로봇 청소기 에서 일부 구성을 분리하여 도시한 도면이고, 도 3은 도 1에 도시된 로봇 청소기를 도시한 배면도이며, 도 4는 도 3에 도시된 로봇 청소기에서 일부 구성을 분리하여 도시한 도면이다. 본 발명의 실시예에 따른 로봇 청소기는 바닥에 놓여 바닥면(B)을 따라 이동하면서 바닥을 청소하도록 이루 어진다. 이에 따라, 이하에서는 로봇 청소기가 바닥에 놓인 상태를 기준으로 상하방향을 정하여 설명하도록 한다. 그리고 제1 회전판 및 제2 회전판을 기준으로, 후술할 제1, 2 지지바퀴(120, 130)가 결합되는 쪽을 앞 쪽으로 정하여 설명한다. 본 발명의 실시예에서 설명되는 각 구성의 ‘가장 낮은 부분’은, 본 발명의 실시예에 따른 로봇 청소기가 바닥에 놓여 사용될 때, 각 구성에서 가장 낮게 위치하는 부분일 수 있고, 또는 바닥과 가장 가까운 부분일 수 있다. 본 발명의 실시예에 따른 로봇 청소기는, 바디, 제1 회전판, 제2 회전판, 제1 걸레 및 제2 걸레를 포함하여 이루어진다. 바디는, 로봇 청소기의 전체적인 외형을 이루거나, 프레임 형태로 이루어질 수 있다. 바디에는 로 봇 청소기를 이루는 각 부품들이 결합될 수 있고, 로봇 청소기를 이루는 일부 부품들은 바디 내부에 수용될 수 있다. 바디는 하부바디(100a)와 상부바디(100b)로 구분될 수 있고, 하부바디(100a)와 상부바디 (100b)가 서로 결합되어 이루어지는 공간상에 로봇 청소기의 부품들이 구비될 수 있다.(도 10 참조)본 발명의 실시예에서, 바디는 상하방향(Z와 평행한 방향) 높이보다 수평방향(X 및 Y와 평행한 방향)의 폭 (또는 직경)이 더 큰 형태로 이루어질 수 있다. 이러한 바디는, 로봇 청소기가 안정된 구조를 이루도록 돕고, 로봇 청소기가 이동(주행)함에 있어서 장애물을 회피하는데 유리한 구조를 제공할 수 있다. 위 또는 아래에서 바라볼 때, 바디는 원형, 타원형, 또는 사각형 등, 다양한 형태로 이루어질 수 있다. 제1 회전판은 소정의 면적을 갖도록 이루어지고, 납작한 판 또는 납작한 프레임 등의 형태로 이루어진다. 이러한 제1 회전판은 대체로 가로로 눕혀지고, 이에 따라, 상하방향 높이보다 수평방향의 폭(또는 직경)이 충분히 더 큰 형태로 이루어진다. 바디에 결합된 제1 회전판은 바닥면(B)과 평행할 수 있고, 또는 바 닥면(B)과 경사를 이룰 수 있다. 제1 회전판은 원형의 판 형태로 이루어질 수 있고, 제1 회전판의 저면은 대체로 원형을 이룰 수 있다. 제1 회전판은, 전체적으로 회전대칭 형태로 이루어질 수 있다. 제1 회전판은, 제1 중앙판, 제1 외곽판 및 제1 스포크를 포함하여 이루어질 수 있다. 제1 중앙판은 제1 회전판의 중심을 이루면서 바디에 회전가능하게 결합된다. 제1 중앙판은 바 디의 하측에 결합될 수 있고, 제1 중앙판의 상면이 바디의 저면을 향하면서 바디에 결합될 수 있다. 제1 회전판의 회전축은 제1 중앙판의 중앙을 관통하는 방향을 따라 형성될 수 있다. 또한, 제1 회 전판의 회전축은 바닥면(B)과 직교하는 방향을 따라 형성될 수 있고, 또는 바닥면(B)과 직교하는 방향 에서 소정의 경사를 이룰 수 있다. 제1 외곽판은 제1 중앙판과 이격되게 제1 중앙판을 둘러싸는 형태로 이루어진다. 제1 스포크는 제1 중앙판과 제1 외곽판을 연결하고, 복수 개로 구비되어 제1 중앙판의 원주방 향을 따라 반복형성된다. 제1 스포크는 등 간격으로 배열될 수 있고, 제1 스포크들 사이에 상하로 관통 된 복수 개의 구멍이 구비되며, 후술할 물공급튜브에서 토출되는 액체(예컨대, 물)가 이러한 구멍(1 4)을 통하여 제1 걸레쪽으로 전달될 수 있다. 본 발명의 실시예에 따른 로봇 청소기에서, 바디에 결합된 제1 회전판의 저면은 바닥면(B)과 소정 의 경사를 이룰 수 있고, 이때 제1 회전판의 회전축은 바닥면(B)에 수직인 방향과 소정의 경사를 이룰 수 있다. 본 발명의 실시예에 따른 로봇 청소기에서, 제1 회전판의 저면이 바닥면(B)과 이루는 각도(θ1)는, 제1 회전판의 회전축이 바닥면(B)에 수직인 방향과 이루는 각도(θ2)와 동일하게 이루어질 수 있다. 이에 따라, 바디를 상대로 제1 회전판이 회전함에 있어서 제1 회전판의 저면은 바닥면(B)과 동일한 각 도를 유지하도록 이루어질 수 있다. 제2 회전판은 소정의 면적을 갖도록 이루어지고, 납작한 판 또는 납작한 프레임 등의 형태로 이루어진다. 이러한 제2 회전판은 대체로 가로로 눕혀지고, 이에 따라, 상하방향 높이보다 수평방향의 폭(또는 직경)이 충분히 더 큰 형태로 이루어진다. 바디에 결합된 제2 회전판은 바닥면(B)과 평행할 수 있고, 또는 바 닥면(B)과 경사를 이룰 수 있다. 제2 회전판은 원형의 판 형태로 이루어질 수 있고, 제2 회전판의 저면은 대체로 원형을 이룰 수 있다. 제2 회전판은, 전체적으로 회전대칭 형태로 이루어질 수 있다. 제2 회전판은, 제2 중앙판, 제2 외곽판 및 제2 스포크를 포함하여 이루어질 수 있다. 제2 중앙판은 제2 회전판의 중심을 이루면서 바디에 회전가능하게 결합된다. 제2 중앙판은 바 디의 하측에 결합될 수 있고, 제2 중앙판의 상면이 바디의 저면을 향하면서 바디에 결합될 수 있다. 제2 회전판의 회전축은 제2 중앙판의 중앙을 관통하는 방향을 따라 형성될 수 있다. 또한, 제2 회 전판의 회전축은 바닥면(B)과 직교하는 방향을 따라 형성될 수 있고, 또는 바닥면(B)과 직교하는 방향 에서 소정의 경사를 이룰 수 있다.제2 외곽판은 제2 중앙판과 이격되게 제2 중앙판을 둘러싸는 형태로 이루어진다. 제2 스포크는 제2 중앙판과 제2 외곽판을 연결하고, 복수 개로 구비되어 제2 중앙판의 원주방 향을 따라 반복형성된다. 제2 스포크는 등 간격으로 배열될 수 있고, 제2 스포크들 사이에 상하로 관통 된 복수 개의 구멍이 구비되며, 후술할 물공급튜브에서 토출되는 액체(물)가 이러한 구멍을 통하 여 제2 걸레쪽으로 전달될 수 있다. 본 발명의 실시예에 따른 로봇 청소기에서, 바디에 결합된 제2 회전판의 저면은 바닥면(B)과 소정 의 경사를 이룰 수 있고, 이때 제2 회전판의 회전축은 바닥면(B)에 수직인 방향과 소정의 경사를 이룰 수 있다. 본 발명의 실시예에 따른 로봇 청소기에서, 제2 회전판의 저면이 바닥면(B)과 이루는 각도(θ3)는, 제2 회전판의 회전축이 바닥면(B)에 수직인 방향과 이루는 각도(θ4)와 동일하게 이루어질 수 있다. 이에 따라, 바디를 상대로 제2 회전판이 회전함에 있어서 제2 회전판의 저면은 바닥면(B)과 동일한 각 도를 유지하도록 이루어질 수 있다. 본 발명의 실시예에 따른 로봇 청소기에서, 제2 회전판은 제1 회전판과 동일하게 이루어질 수 있고, 또는 대칭되게 이루어질 수 있다. 제1 회전판이 로봇 청소기의 왼쪽에 위치하는 것이라면 제2 회전판 는 로봇 청소기의 오른쪽에 위치할 수 있고, 이때 제1 회전판과 제2 회전판은 서로 좌우대칭을 이룰 수 있다. 제1 걸레는 바닥을 향하는 저면이 소정의 면적을 갖도록 이루어지고, 제1 걸레는 납작한 형태로 이루어 진다. 제1 걸레는, 상하방향 높이보다 수평방향의 폭(또는 직경)이 충분히 더 큰 형태로 이루어진다. 제1 걸레가 바디쪽에 결합됨에 있어서 제1 걸레의 저면은 바닥면(B)과 평행할 수 있고, 또는 바닥면 (B)과 경사를 이룰 수 있다. 제1 걸레의 저면은 대체로 원형을 이룰 수 있다. 제1 걸레는, 전체적으로 회전대칭 형태로 이루어질 수 있다. 제1 걸레는 바닥과 접촉하면서 바닥을 닦을 수 있는 다양한 소재로 이루어질 수 있다. 이를 위하여, 제1 걸 레의 저면은, 직물 또는 편물로 이루어지는 천, 부직포 및/또는 소정의 면적을 갖는 브러쉬 등으로 이루어 질 수 있다. 본 발명의 실시예에 따른 로봇 청소기에서, 제1 걸레는 제1 회전판의 저면에 탈부착되고, 제1 회전 판에 결합되어 제1 회전판과 함께 회전하도록 이루어진다. 제1 걸레는 제1 외곽판의 저면에 밀 착결합될 수 있고, 제1 중앙판 및 제1 외곽판의 저면에 밀착결합될 수 있다. 제1 걸레는, 다양한 장치 및 방식을 이용하여, 제1 회전판에 탈부착될 수 있다. 일 실시예에서, 제1 걸 레의 적어도 일부가 제1 회전판에 걸림, 끼움 등의 방식으로 제1 회전판에 결합될 수 있다. 다른 실시예에서, 제1 걸레와 제1 회전판을 결합시키는, 클램프와 같은 별도의 장치가 구비될 수 있다. 또 다른 실시예에서, 한 쌍을 이루며 서로 결합되고 분리되는 체결장치(체결장치의 구체적인 예로서, 서로 인력이 작용하는 한 쌍의 자석, 서로 결합되는 한 쌍의 벨크로(velcro), 또는 서로 결합되는 한 쌍의 단추(암단추와 수 단추) 등이 사용될 수 있다)의 한쪽이 제1 걸레에 고정되고 다른 한쪽이 제1 회전판에 고정될 수 있다. 제1 걸레가 제1 회전판에 결합됨에 있어서, 서로 겹쳐지는 형태로 제1 걸레와 제1 회전판이 결 합될 수 있고, 제1 걸레의 중심이 제1 회전판의 중심과 일치되도록 제1 걸레가 제1 회전판에 결합될 수 있다. 제2 걸레는 바닥을 향하는 저면이 소정의 면적을 갖도록 이루어지고, 제2 걸레는 납작한 형태로 이루어 진다. 제2 걸레는, 상하방향 높이보다 수평방향의 폭(또는 직경)이 충분히 더 큰 형태로 이루어진다. 제2 걸레가 바디쪽에 결합됨에 있어서 제2 걸레의 저면은 바닥면(B)과 평행할 수 있고, 또는 바닥면 (B)과 경사를 이룰 수 있다. 제2 걸레의 저면은 대체로 원형을 이룰 수 있다. 제2 걸레는, 전체적으로 회전대칭 형태로 이루어질 수 있다. 제2 걸레는 바닥과 접촉하면서 바닥을 닦을 수 있는 다양한 소재로 이루어질 수 있다. 이를 위하여, 제2 걸 레의 저면은, 직물 또는 편물로 이루어지는 천, 부직포 및/또는 소정의 면적을 갖는 브러쉬 등으로 이루어 질 수 있다. 본 발명의 실시예에 따른 로봇 청소기에서, 제2 걸레는 제2 회전판의 저면에 탈부착되고, 제2 회전 판에 결합되어 제2 회전판과 함께 회전하도록 이루어진다. 제2 걸레는 제2 외곽판의 저면에 밀 착결합될 수 있고, 제2 중앙판 및 제2 외곽판의 저면에 밀착결합될 수 있다. 제2 걸레는, 다양한 장치 및 방식을 이용하여, 제2 회전판에 탈부착될 수 있다. 일 실시예에서, 제2 걸 레의 적어도 일부가 제2 회전판에 걸림, 끼움 등의 방식으로 제2 회전판에 결합될 수 있다. 다른 실시예에서, 제2 걸레와 제2 회전판을 결합시키는, 클램프와 같은 별도의 장치가 구비될 수 있다. 또 다른 실시예에서, 한 쌍을 이루며 서로 결합되고 분리되는 체결장치(체결장치의 구체적인 예로서, 서로 인력이 작용하는 한 쌍의 자석, 서로 결합되는 한 쌍의 벨크로(velcro), 또는 서로 결합되는 한 쌍의 단추(암단추와 수 단추) 등이 사용될 수 있다)의 한쪽이 제2 걸레에 고정되고 다른 한쪽이 제2 회전판에 고정될 수 있다. 제2 걸레가 제2 회전판에 결합됨에 있어서, 서로 겹쳐지는 형태로 제2 걸레와 제2 회전판이 결 합될 수 있고, 제2 걸레의 중심이 제2 회전판의 중심과 일치되도록 제2 걸레가 제2 회전판에 결합될 수 있다. 본 발명의 실시예에 따른 로봇 청소기는, 바닥면(B)을 따라 직진하도록 이루어질 수 있다. 예를 들어, 로봇 청소기는 청소시 앞(X방향)을 향하여 직진할 수 있고, 또는 장애물 또는 낭떠러지의 회피가 필요한 경우 뒤 를 향하여 직진할 수 있다. 본 발명의 실시예에 따른 로봇 청소기에서, 제1 회전판 및 제2 회전판은, 서로 가까운 쪽이 서로 먼 쪽보다 바닥면(B)과 더 이격되도록, 각각 바닥면(B)과 경사를 이룰 수 있다. 즉, 제1 회전판 및 제2 회전판 은, 로봇 청소기의 중앙에 가까운 쪽보다 로봇 청소기의 중앙에서 먼 쪽이 바닥과 더 가깝게 위치하 도록 이루어질 수 있다.(도 3 및 도 4 참조) 그리고 이때, 제1 회전판의 회전축은 제1 회전판의 저면에 수직하고, 제2 회전판의 회전축(2 5)은 제2 회전판의 저면에 수직하게 이루어질 수 있다. 제1 걸레가 제1 회전판에 결합되고 제2 걸레가 제2 회전판에 결합되면, 제1 걸레와 제2 걸 레는 서로 먼 쪽의 부분이 각각 바닥과 더 강하게 접촉된다. 제1 회전판의 회전시 제1 걸레의 저면과 바닥면(B) 사이에는 마찰력이 발생하며, 이때, 마찰력의 발생 지점 및 방향은 제1 회전판의 회전축에서 벗어나 있으므로, 바닥면(B)을 상대로 하여 제1 회전판이 이동하게 되며, 아울러 로봇 청소기가 바닥면(B)을 따라 이동할 수 있게 된다. 또한, 제2 회전판의 회전시 제2 걸레의 저면과 바닥면(B) 사이에는 마찰력이 발생하며, 이때, 마찰력의 발생지점 및 방향은 제2 회전판의 회전축에서 벗어나 있으므로, 바닥면(B)을 상대로 하여 제2 회전판 이 이동하게 되며, 역시, 이에 따라 로봇 청소기가 바닥면(B)을 따라 이동할 수 있게 된다. 제1 회전판과 제2 회전판이 서로 반대방향으로 동일한 속도로 회전하는 경우, 로봇 청소기는 직선방 향으로 이동할 수 있고, 전진 또는 후진할 수 있다. 예를 들어, 위에서 바라볼 때, 제1 회전판이 반시계방 향으로 회전하고 제2 회전판이 시계방향으로 회전하는 경우 로봇 청소기는 앞으로 이동할 수 있다. 제1 회전판과 제2 회전판 중 어느 하나만이 회전하는 경우, 로봇 청소기는 방향을 전환할 수 있고, 선회할 수 있다. 제1 회전판의 회전속도와 제2 회전판의 회전속도가 서로 다르거나, 제1 회전판과 제2 회전판이 같은 방향으로 회전하는 경우, 로봇 청소기는 방향을 전환하면서 이동할 수 있고, 곡선방향으로 이동할 수 있다. 도 5a는 본 발명의 다른 실시예에 따른 로봇 청소기를 도시한 저면도이고, 도 5b는 본 발명의 실시예에 따른 로봇 청소기에서 제1 하부센서, 제2 하부센서 또는 제3 하부센서가 바디에 결합된 부분을 개 략적으로 도시한 단면도이다. 도 5c 및 도 5d는 본 발명의 또 다른 실시예에 따른 로봇 청소기에서 제1 하부센서, 제2 하부센서 또는 제3 하부센서가 바디에 결합된 부분을 개략적으로 도시한 단면도이다.본 발명의 실시예에 따른 로봇 청소기는 제1 지지바퀴, 제2 지지바퀴 및 제1 하부센서를 포 함하여 이루어진다. 제1 지지바퀴 및 제2 지지바퀴는, 제1 걸레 및 제2 걸레와 함께 바닥과 접촉하도록 이루어질 수 있다. 제1 지지바퀴와 제2 지지바퀴는 서로 이격되며, 각각 통상의 바퀴(wheel)와 같은 형태로 이루어질 수 있다. 제1 지지바퀴 및 제2 지지바퀴는 바닥과 접촉하여 구르면서 이동할 수 있고, 이에 따라 로봇 청소기가 바닥면(B)을 따라 이동할 수 있다. 제1 지지바퀴는 제1 회전판 및 제2 회전판과 이격된 지점에서 바디의 저면에 결합될 수 있고, 제2 지지바퀴 또한 제1 회전판 및 제2 회전판과 이격된 지점에서 바디의 저면에 결합 될 수 있다. 제1 회전판의 중심과 제2 회전판의 중심을 수평방향(바닥면(B)과 평행한 방향)을 따라 연결하는 가상의 선을 연결선(L1)이라고 할 때, 제2 지지바퀴는 연결선(L1)을 기준으로 제1 지지바퀴와 같은 쪽에 위 치하고, 이때, 후술할 보조바퀴는 연결선(L1)을 기준으로 제1 지지바퀴와 다른 쪽에 위치한다. 제1 지지바퀴와 제2 지지바퀴의 간격은, 로봇 청소기의 전체 크기를 고려할 때, 비교적 넓은 형태 로 이루어질 수 있다. 좀 더 구체적으로, 제1 지지바퀴 및 제2 지지바퀴가 바닥면(B)에 놓인 상태(제 1 지지바퀴의 회전축 및 제2 지지바퀴의 회전축이 바닥면(B)과 평행한 상태)에서, 제1 지 지바퀴 및 제2 지지바퀴가 로봇 청소기 하중의 일부를 지지하면서도 옆으로 쓰러지지 않고 세워져 놓일 수 있을 정도의 간격을 갖도록 이루어질 수 있다. 제1 지지바퀴는 제1 회전판의 앞에 위치할 수 있고, 제2 지지바퀴는 제2 회전판의 앞에 위치 할 수 있다. 본 발명의 실시예에 따른 로봇 청소기에서, 전체 무게중심은 제1 지지바퀴 및 제2 지지바퀴 쪽보다, 제1 걸레 및 제2 걸레쪽으로 치우쳐 형성되고, 로봇 청소기의 하중의 지지는 제1 지지바퀴 및 제2 지지바퀴보다 제1 걸레 및 제2 걸레에 의해 크게 이루어진다. 제1 하부센서는 바디의 하측에 형성되어, 바닥(B)과의 상대적인 거리를 감지하도록 이루어진다. 제1 하부센서는, 제1 하부센서가 형성된 지점과 바닥면(B)과의 상대적인 거리를 감지할 수 있는 범위 내 에서 다양하게 이루어질 수 있다. 제1 하부센서에 의해 감지되는, 바닥면(B)과의 상대적인 거리(바닥면에서 수직방향의 거리일 수 있고, 또 는 바닥면에서 경사방향의 거리일 수 있음)가 소정의 값을 초과하는 경우, 또는 소정의 범위를 초과하는 경우는, 바닥면이 갑지가 낮아지는 경우일 수 있으며, 이에 따라 제1 하부센서는 낭떠러지를 감지할 수 있 다. 제1 하부센서는, 광센서로 이루어질 수 있고, 빛을 조사하는 발광부 및 반사된 빛이 입사되는 수광부를 포 함하여 이루어질 수 있다. 제1 하부센서는 적외선센서로 이루어질 수 있다. 제1 하부센서는 클리프센서(Cliff Sensor)로 칭하여 질 수 있다. 제1 하부센서는, 연결선(L1)을 기준으로 제1 지지바퀴 및 제2 지지바퀴와 같은 쪽에 형성된다. 제1 하부센서는 바디의 테두리 방향을 따라 제1 지지바퀴와 제2 지지바퀴 사이에 위치한다. 로봇 청소기에서, 제1 지지바퀴가 상대적으로 좌측에 위치하고 제2 지지바퀴가 상대적 으로 우측에 위치한다면, 제1 하부센서는 대체로 가운데 위치한다. 또한, 연결선(L1)으로부터 제1 하부센서까지의 거리(연결선(L1)에서 수직방향의 거리)는 연결선(L1)으로부 터 제1 지지바퀴 또는 제2 지지바퀴까지의 거리(연결선(L1)에서 수직방향의 거리)보다 길게 이루어진 다. 즉, 제1 하부센서는 지지바퀴보다 더 앞쪽에 형성된다. 제1 하부센서가 바디의 하부면에 형성됨에 있어서, 제1 하부센서에 의한 낭떠러지의 감지가 제1 걸레 및 제2 걸레에 의해 방해받지 않도록, 또한, 로봇 청소기의 전방에 위치하는 낭떠러지의 신속 한 감지를 위하여, 제1 하부센서는 제1 회전판 및 제2 회전판과 충분히 이격된 지점(또한 제1 걸 레 및 제2 걸레와 충분히 이격된 지점)에 형성될 수 있다. 이에 따라, 제1 하부센서는 바디의 테두리에 인접하게 형성될 수 있다. 본 발명의 실시예에 따른 로봇 청소기는, 제1 하부센서에 의해 감지되는 거리에 따라, 작동이 제어되도 록 이루어질 수 있다. 좀 더 구체적으로, 제1 하부센서에 의해 감지되는 거리에 따라, 제1 회전판 및 제2 회전판 중 어느 하나 이상의 회전이 제어될 수 있다. 예를 들어, 제1 하부센서에 의해 감지되는 거리가 소정값을 초과하거나 소정의 범위를 벗어나는 경우, 제1 회전판 및 제2 회전판의 회전이 정지하 면서 로봇 청소기가 정지되거나, 제1 회전판 및/또는 제2 회전판의 회전방향이 전환되면서 로봇 청 소기의 이동방향이 전환되도록 이루어질 수 있다. 본 발명의 실시예에서, 제1 하부센서가 감지하는 방향은, 바디의 테두리쪽을 향하여 하향 경사지게 이루어질 수 있다. 예를 들어, 제1 하부센서가 광센서로 이루어질 때, 제1 하부센서에 의해 조사되는 빛의 방향이, 바닥면(B)에 수직하지 않고, 전방을 향하여 경사지게 이루어질 수 있다.(도 5b 참조) 이에 따라, 제1 하부센서는 제1 하부센서보다 더 앞에 위치하는 낭떠러지를 감지할 수 있고, 비교적 바디의 앞쪽에 위치하는 낭떠리지를 감지할 수 있으며, 로봇 청소기가 낭떠러지로 진입하는 것을 방지 할 수 있다. 바디의 저면에는 제1 하부센서를 노출시키는 구멍인 제1 센서홀이 형성될 수 있다. 즉, 제1 센 서홀을 통하여 제1 하부센서에 의한 낭떠러지의 감지가 이루어질 수 있다. 제1 센서홀은 바디 의 테두리를 향하여 하향 경사지게 이루어질 수 있고, 이에 따라 제1 하부센서는 제1 하부센서 보다 더 앞에 위치하는 낭떠러지를 더욱 효과적으로 감지할 수 있으며, 로봇 청소기가 낭떠러지로 진입하는 것을 방지할 수 있다.(도 5c 참조) 또한, 바디의 저면에는 오목한 홈인 제1 센서홈이 형성될 수 있고, 아울러, 후술할 범퍼의 저면 에는 오목한 홈인 제1 범퍼홈이 형성될 수 있다. 제1 센서홈은 일측이 제1 센서홀에 연결되고, 타측이 바디의 테두리를 향해 연장되어 제1 범퍼홈에 연결된다. 즉, 로봇 청소기의 반경방향을 따 라 제1 센서홀 제1 센서홈 및 제1 범퍼홈이 연속하여 배열되고 서로 연통된다.(도 5d 참조) 제1 센서홀, 제1 센서홈 및 제1 범퍼홈에 의하여 제1 하부센서는, 제1 하부센서보다 더 앞쪽에 위치하는 낭떠러지를 효과적으로 감지할 수 있다. 본 발명의 실시예에 따른 로봇 청소기는, 후술하는 바와 같이, 장애물의 감지를 위한 범퍼를 구비할 수 있다. 이때, 바닥면(B)에 깔려있는 장애물(예컨대, 카펫)의 감지를 위하여, 범퍼의 가장 낮은 부분은 바닥 면(B)과 비교적 가깝게 위치할 필요가 있다. 이처럼, 범퍼의 가장 낮은 부분이 비교적 낮게 이루어지는 경우에도, 제1 센서홈 및 제1 범퍼홈(25 3)이 구비됨으로써, 제1 하부센서는, 제1 하부센서보다 더 앞쪽에 위치하는 낭떠러지를 효과적으로 감지할 수 있다. 도 6a 내지 도 6c는 도 5a에 도시된 로봇 청소기의 직전 및 선회시 제1 하부센서에 의한 낭떠러지(F)의 감지를 설명하는 도면이다. 본 발명의 실시예에 따른 로봇 청소기가 이동함에 있어서, 낭떠러지는 로봇 청소기를 기준으로 임의의 지 점에 위치할 수 있고, 로봇 청소기는 직진, 방향전환, 선회 등의 이동을 할 수 있는데, 본 발명의 실시예에 따른 로봇 청소기는 이러한 경우에도 낭떠러지를 효과적으로 회피하거나 안정적으로 유지될 수 있도록 이루 어진다. 본 발명의 실시예에 따른 로봇 청소기는, 청소시 앞쪽을 향하여 이동(직진)할 수 있고, 이때 제1 걸레, 제2 걸레, 제1 지지바퀴 및 제2 지지바퀴가 바닥에 접촉하며 로봇 청소기의 하중을 지지한다. 로봇 청소기가 바닥면(B)을 따라 전진함에 있어서 제1 하부센서는 낭떠러지(F)의 존재 여부를 감지할 수 있고, 이때, 제1 하부센서에 의한 낭떠러지(F)의 감지는 로봇 청소기의 하중을 지지하는 제1 지지바 퀴 또는 제2 지지바퀴가 낭떠러지(F)로 진입하기 이전에 이루어질 수 있다.(도 6a 참조) 본 발명의 실시예에 따른 로봇 청소기는, 청소시 좌측 또는 우측으로 방향을 전환할 수 있고, 곡선 방향으로 이동할 수 있으며, 이때 제1 걸레, 제2 걸레, 제1 지지바퀴 및 제2 지지바퀴가 바닥에 접촉 하며 로봇 청소기의 하중을 지지한다. 도 6b에 도시된 바와 같이, 로봇 청소기가 좌측으로 방향을 전환하면서 이동할 때, 제1 지지바퀴 및 제 2 지지바퀴가 낭떠러지(F)로 진입하기 이전에 제1 하부센서에 의한 낭떠러지(F)의 감지가 이루어질 수 있고, 적어도 제2 지지바퀴가 낭떠러지(F)로 진입하기 이전에 제1 하부센서에 의한 낭떠러지(F)의 감지가 이루어질 수 있다. 제1 하부센서에 의한 낭떠러지(F)의 감지가 이루어질 때, 로봇 청소기는, 제 1 걸레, 제2 걸레, 제1 지지바퀴 및 제2 지지바퀴에 의해 하중이 지지되고, 적어도, 제1 걸 레, 제2 걸레 및 제2 지지바퀴에 의해 하중이 지지된다. 도 6c에 도시된 바와 같이, 로봇 청소기가 우측으로 회전하면서 이동할 때, 제1 지지바퀴 및 제2 지지 바퀴가 낭떠러지(F)로 진입하기 이전에 제1 하부센서에 의한 낭떠러지(F)의 감지가 이루어질 수 있고, 적어도 제1 지지바퀴가 낭떠러지(F)로 진입하기 이전에 제1 하부센서에 의한 낭떠러지(F)의 감 지가 이루어질 수 있다. 제1 하부센서에 의한 낭떠러지(F)의 감지가 이루어질 때, 로봇 청소기는, 제1 걸레, 제2 걸레, 제1 지지바퀴 및 제2 지지바퀴에 의해 하중이 지지되고, 적어도, 제1 걸레 , 제2 걸레 및 제1 지지바퀴에 의해 하중이 지지된다. 상술한 바와 같이, 본 발명의 실시예에 따른 로봇 청소기에 의하면, 로봇 청소기가 직진하는 경우뿐 아니 라 방향을 전환하는 경우에도, 제1 지지바퀴 및 제2 지지바퀴가 낭떠러지(F)로 진입하기 전에 제1 하 부센세에 의한 낭떠러지(F)의 감지가 이루어질 수 있으며, 로봇 청소기가 낭떠러지(F)로 떨어지는 것을 방지 할 수 있고, 로봇 청소기의 전체적인 균형이 무너지는 것을 방지할 수 있다. 도 7a 및 도 7b는 도 5a에 도시된 로봇 청소기를 도시한 측면도이고, 도 8a 및 도 8b는 도 5a에 도시된 로봇 청소기에서 일부 구성이 배제된 상태를 도시한 측면도이다. 본 발명의 실시예에 따른 로봇 청소기는, 제1 지지바퀴 및 제2 지지바퀴와 함께 보조바퀴를 포함하여 이루어질 수 있다. 보조바퀴는 제1 회전판 및 제2 회전판과 이격되어 바디의 하측에 결합될 수 있다. 보조바퀴는 연결선(L1)을 기준으로 제1 지지바퀴 및 제2 지지바퀴와 다른 쪽에 위치한다. 본 발명의 실시예에서 보조바퀴는, 통상의 바퀴(wheel)와 같은 형태로 이루어질 수 있고, 보조바퀴의 회전축은 바닥면(B)과 평행하게 이루어질 수 있다. 보조바퀴는 바닥과 접촉하여 구르면서 이동할 수 있고, 이에 따라 로봇 청소기가 바닥면(B)을 따라 이동할 수 있다. 다만, 본 발명의 실시예에서 보조바퀴는, 제1 걸레 및 제2 걸레가 바닥과 접촉하는 경우, 바닥과 접촉하지 않도록 이루어진다. 제1 회전판 및 제2 회전판을 기준으로, 제1 지지바퀴 및 제2 지지바퀴는 앞쪽에 위치하고, 보조바퀴는 뒤쪽에 위치한다. 본 발명의 실시예에 따른 로봇 청소기에서, 제1 회전판과 제2 회전판은 서로 대칭(좌우대칭)을 이루 고, 제1 지지바퀴와 제2 지지바퀴는 서로 대칭(좌우대칭)을 이룰 수 있다. 본 발명의 실시예에 따른 로봇 청소기에서, 제1 회전판의 가장 낮은 부분은, 제1 지지바퀴의 가장 낮은 부분과 보조바퀴의 가장 낮은 부분을 연결하는 가상의 제1 기준선(L3)보다 높고, 제1 걸레의 가 장 낮은 부분은 상기 제1 기준선(L3)보다 낮게 이루어질 수 있다.(도 8a 참조) 또한, 제2 회전판의 가장 낮은 부분은, 제2 지지바퀴의 가장 낮은 부분과 보조바퀴의 가장 낮은 부분을 연결하는 가상의 제2 기준선(L4)보다 높고, 제2 걸레의 가장 낮은 부분은 상기 제2 기준선(L4)보다 낮게 이루어질 수 있다.(도 8b 참조) 즉, 본 발명의 실시예에 따른 로봇 청소기는, 제1 걸레가 제1 회전판에 결합되고 제2 걸레가 제 2 회전판에 결합된 상태에서, 제1 지지바퀴, 제2 지지바퀴 및 보조바퀴는 제1 걸레 및 제2 걸레가 바닥과 접촉하는 것을 방해하지 않는다. 이에 따라, 제1 걸레 및 제2 걸레가 바닥과 접촉이 이루어지며, 제1 걸레 및 제2 걸레의 회전 에 의해 걸레질 및 청소가 이루어질 수 있다. 이때, 제1 지지바퀴, 제2 지지바퀴 및 보조바퀴는 모두 바닥에서 이격될 수 있고, 또는 보조바퀴는 바닥에서 이격되고 제1 지지바퀴 및 제2 지지바퀴 는 바닥과 접촉하도록 이루어질 수 있다. 본 발명의 실시예에서, 제1 걸레 및 제2 걸레가 바닥에 접촉하도록 로봇 청소기가 놓인 상태에서, 바닥면(B)으로부터 제1 지지바퀴의 가장 낮은 부분까지의 높이 및 바닥면(B)으로부터 제2 지지바퀴의 가장 낮은 부분까지의 높이는 바닥면(B)으로부터 보조바퀴의 가장 낮은 부분까지의 높이보다 낮게 이루어 진다. 한편, 제1 걸레 및 제2 걸레가 제1 회전판 및 제2 회전판으로부터 분리된 상태에서는 제1 지지 바퀴, 제2 지지바퀴 및 보조바퀴가 바닥에 닿고, 제1 회전판 및 제2 회전판은 바닥으로 부터 이격된다.(도 8a 및 도 8b 참조) 이러한 상태에서, 의도하지 않게 로봇 청소기의 가동(제1 회전판 및 제2 회전판의 회전)이 이루어지 더라도 제1 회전판 및 제2 회전판이 바닥과 접촉하여 마찰하는 것을 방지할 수 있으며, 이에 따라, 제1 회전판과 제2 회전판의 손상을 방지할 수 있고, 또한 바닥의 손상을 방지할 수 있다. 또한 이러한 상태에서 로봇 청소기가 의도하지 않게 바닥에서 이동되더라도, 제1 지지바퀴, 제2 지지바 퀴 및 보조바퀴가 바닥에서 굴러서 이동할 수 있기 때문에, 바닥이 긁히는 것을 방지할 수 있으며, 로봇 청소기의 손상 또는 바닥의 손상을 효과적으로 방지할 수 있다. 도 9a는 본 발명의 또 다른 실시예에 따른 로봇 청소기를 도시한 저면도이고, 도 9b 및 도 9c는 도 9a에 도 시된 로봇 청소기에서 제2 하부센서 또는 제3 하부센서에 의한 낭떠러지의 감지를 설명하는 도면 이다. 도 10은 도 9a에 도시된 로봇 청소기를 도시한 분해사시도이다. 본 발명의 실시예에 따른 로봇 청소기는, 제1 액추에이터, 제2 액추에이터, 배터리, 물통 및 물공급튜브를 포함하여 이루어진다. 제1 액추에이터는, 바디에 결합되어 제1 회전판을 회전시키도록 이루어진다. 제1 액추에이터는, 제1 케이스, 제1 모터, 하나 이상의 제1 기어를 포함하여 이루어질 수 있다. 제1 케이스는, 제1 액추에이터를 이루는 구성들을 지지하고, 바디에 고정결합된다. 제1 모터는 전기모터로 이루어질 수 있다. 복수 개의 제1 기어는 서로 맞물려 회전하도록 이루어지고, 제1 모터와 제1 회전판을 연결하며, 제1 모터의 회전동력을 제1 회전판으로 전달한다. 따라서, 제1 모터의 회전축의 회전시 제1 회전 판이 회전한다. 제2 액추에이터는, 바디에 결합되어 제2 회전판을 회전시키도록 이루어진다. 제2 액추에이터는, 제2 케이스, 제2 모터, 하나 이상의 제2 기어를 포함하여 이루어질 수 있다. 제2 케이스는, 제2 액추에이터를 이루는 구성들을 지지하고, 바디에 고정결합된다. 제2 모터는 전기모터로 이루어질 수 있다. 복수 개의 제2 기어는 서로 맞물려 회전하도록 이루어지고, 제2 모터와 제2 회전판을 연결하며, 제2 모터의 회전동력을 제2 회전판으로 전달한다. 따라서, 제2 모터의 회전축의 회전시 제2 회전 판이 회전한다. 이처럼 본 발명의 실시예에 따른 로봇 청소기에서, 제1 액추에이터의 작동에 의하여 제1 회전판 및 제1 걸레가 회전할 수 있고, 제2 액추에이터의 작동에 의하여 제2 회전판 및 제2 걸레가 회전 할 수 있다. 본 발명의 실시예에서, 제1 액추에이터는 그 무게중심이 제1 회전판이 이루는 연직방향 영역 내 부에 위치할 수 있다. 즉, 제1 액추에이터를 제1 회전판 바로 위에 배치함으로써 제1 액추에이터(16 0)로부터 제1 회전판으로 전달되는 동력의 손실을 최소화하고, 비교적 중량체를 이루는 제1 액추에이터 의 하중이 제1 회전판 쪽으로 가해지도록 함으로써 제1 걸레가 바닥과 충분히 마찰하면서 걸레질 이 이루어지도록 할 수 있다. 또한, 본 발명의 실시예에서, 제2 액추에이터는 그 무게중심이 제2 회전판이 이루는 연직방향 영 역 내부에 위치할 수 있다. 즉, 제2 액추에이터를 제2 회전판 바로 위에 배치함으로써 제2 액추에이터 로부터 제2 회전판으로 전달되는 동력의 손실을 최소화하고, 비교적 중량체를 이루는 제21 구동모듈의 하중이 제2 회전판 쪽으로 가해지되록 함으로써 제2 걸레가 바닥과 충분히 마찰하면서 걸레질이 이루어 지도록 할 수 있다. 제2 액추에이터는 제1 액추에이터와 대칭(좌우대칭)을 이룰 수 있다. 배터리는, 바디에 결합되어 로봇 청소기를 이루는 다른 구성들에 전원을 공급하도록 이루어진다. 배터리는 제1 액추에이터 및 제2 액추에이터에 전원을 공급할 수 있고, 특히, 제1 모터와 제2 모터에 전원을 공급한다. 본 발명의 실시예에서 배터리는, 외부의 전원에 의하여 충전될 수 있으며, 이를 위하여 바디의 일측, 또는 배터리 자체에는 배터리의 충전을 위한 충전단자가 구비될 수 있다. 본 발명의 실시예에 따른 로봇 청소기에서 배터리는, 제1 회전판의 중심, 제2 회전판의 중심, 제1 지지바퀴의 중심 및 제2 지지바퀴의 중심을 각 꼭지점으로 하는 사각형(A)의 연직방향 영역 내부 에 위치할 수 있다. 즉, 배터리는 연결선(L1)을 기준으로 앞쪽에 위치할 수 있다. 본 발명의 실시예에 따른 로봇 청소기에서 배터리는, 그 길이방향이 연결선(L1)과 평행하도록, 바디 에 결합될 수 있다. 물통은, 그 내부에 물과 같은 액체가 저장되도록 내부공간을 구비하는 용기 형태로 이루어진다. 물통(23 0)은 바디에 고정결합될 수 있고, 또는 바디에서 착탈가능하게 결합될 수 있다. 본 발명의 실시예에서 물통은 연결선(L1)을 기준으로 뒤쪽에 위치할 수 있고, 물통은 보조바퀴 상측에 위치할 수 있다. 물공급튜브는, 튜브 또는 파이프 형태로 이루어지고, 그 내부를 통하여 물통 내부의 액체가 흐를 수 있도록 물통과 연결된다. 물공급튜브는, 물통과 연결되는 반대쪽 단부가 제1 회전판 및 제2 회전판의 상측에 위치하도록 이루어지며, 이에 따라 물통 내부의 액체가 제1 걸레 및 제2 걸레 쪽으로 공급될 수 있도록 한다. 본 발명의 실시예에 따른 로봇 청소기에서 물공급튜브는 하나의 관이 2개로 분기된 형태로 이루어질 수 있고, 이때, 분기된 어느 하나의 단부는 제1 회전판 상측에 위치하고, 분기된 다른 하나의 단부는 제2 회전 판 상측에 위치할 수 있다. 본 발명의 실시예에 따른 로봇 청소기에서, 물공급튜브를 통한 액체의 이동을 위하여, 별도의 펌프가 구비될 수 있다. 로봇 청소기의 무게중심은, 제1 회전판의 중심, 제2 회전판의 중심, 제1 지지바퀴의 중심 및 제2 지지바퀴의 중심을 각 꼭지점으로 하는 사각형(A)의 연직방향 영역 내부에 위치할 수 있다. 이에 따라, 로봇 청소기는 제1 걸레, 제2 걸레, 제1 지지바퀴 및 제2 지지바퀴에 의한 지지가 이루어진다. 본 발명의 실시예에 따른 로봇 청소기에서, 제1 액추에이터, 제2 액추에이터, 배터리 및 물 통 각각은, 로봇 청소기에서 비교적 중량체를 이룰 수 있는데, 제1 액추에이터 및 제2 액추에이터 는 연결선(L1) 상에 위치하거나 연결선(L1)과 인접하여 위치하고, 배터리는 연결선(L1)의 앞에 위치 하며 물통은 연결선(L1)의 뒤에 위치함으로써, 로봇 청소기의 전체적인 무게중심이 로봇 청소기 의 중앙부분에 위치하도록 할 수 있고, 이에 따라 제1 걸레 및 제2 걸레가 바닥과 안정되게 접촉되 도록 할 수 있다. 또한, 제1 액추에이터, 제2 액추에이터, 배터리 및 물통 각각이 평면도상 서로 다른 영역 상에 위치함으로써, 안정적인 무게배분이 이루어지면서 비교적 납작한 바디 및 로봇 청소기를 형성할 수 있고, 선반이나 테이블 등의 하측으로 진입이 용이한 로봇 청소기를 형성할 수 있다. 또한, 본 발명의 실시예에 따른 로봇 청소기에 의하면, 물통에 액체가 충분히 수용된 로봇 청소기의 초기구동시 제1 걸레와 제2 걸레만이 바닥과 접촉하면서 청소가 이루어지도록 각 무게를 배분할 수 있 고, 이때, 물통 내부의 액체가 소진되면서 로봇 청소기의 무게중심이 앞쪽으로 이동하는 경우에도, 제1 지지바퀴 및 제2 지지바퀴와 함께 제1 걸레와 제2 걸레가 바닥과 접촉하면서 청소가 이루어질 수 있다. 또한, 본 발명의 실시예에 따른 로봇 청소기는, 물통 내부의 액체의 소진여부에 관계없이, 제1 걸레 및 제2 걸레와 함께 제1 지지바퀴 및 제2 지지바퀴가 바닥과 접촉하면서 청소가 이루어질 수 있다. 본 발명의 실시예에 따른 로봇 청소기는 제2 하부센서 및 제3 하부센서를 포함하여 이루어진다. 제2 하부센서 및 제3 하부센서는, 연결선(L1)을 기준으로 제1 지지바퀴 및 제2 지지바퀴와 같은 쪽에서 바디의 하측에 형성되고, 바닥(B)과의 상대적인 거리를 감지하도록 이루어질 수 있다. 제2 하부센서가 바디의 하부면에 형성됨에 있어서, 제2 하부센서에 의한 낭떠러지(F)의 감지가 제1 걸레 및 제2 걸레에 의해 방해받지 않도록 제2 하부센서는 제1 걸레 및 제2 걸레와 이격되어 형성된다. 또한, 로봇 청소기의 좌측방 또는 우측방에 위치하는 낭떠러지(F)의 신속한 감지를 위하 여, 제2 하부센서는 제1 지지바퀴 또는 제2 지지바퀴로부터 바깥쪽으로 이격된 지점에 형성될 수 있다. 제2 하부센서는 바디의 테두리에 인접하게 형성될 수 있다. 제2 하부센서는, 제1 지지바퀴를 기준으로 제1 하부센서와 반대쪽에 형성될 수 있다. 이에 따라, 제1 지지바퀴의 어느 한쪽에서의 낭떠러지(F)의 감지는 제1 하부센서에 의해 이루어지고, 다른 한쪽에서의 낭떠러지(F)의 감지는 제2 하부센서에 의해 이루어질 수 있으며, 제1 지지바퀴 주변에서 의 낭떠러지(F)의 감지가 효과적으로 이루어질 수 있다. 제3 하부센서가 바디의 하부면에 형성됨에 있어서, 제3 하부센서에 의한 낭떠러지(F)의 감지가 제1 걸레 및 제2 걸레에 의해 방해받지 않도록 제3 하부센서는 제1 걸레 및 제2 걸레와 이격되어 형성된다. 또한, 로봇 청소기의 좌측방 또는 우측방에 위치하는 낭떠러지(F)의 신속한 감지를 위하 여, 제2 하부센서는 제1 지지바퀴 또는 제2 지지바퀴로부터 바깥쪽으로 이격된 지점에 형성될 수 있다. 제2 하부센서는 바디의 테두리에 인접하게 형성될 수 있다. 제3 하부센서는, 제2 지지바퀴를 기준으로 제1 하부센서와 반대쪽에 형성될 수 있다. 이에 따라, 제2 지지바퀴의 어느 한쪽에서의 낭떠러지(F)의 감지는 제1 하부센서에 의해 이루어지고, 다른 한쪽에서의 낭떠러지(F)의 감지는 제2 하부센서에 의해 이루어질 수 있으며, 제2 지지바퀴 주변에서 의 낭떠러지(F)의 감지가 효과적으로 이루어질 수 있다. 본 발명의 실시예에 따른 로봇 청소기는, 바디의 테두리 방향을 따라, 제2 하부센서, 제1 지지바 퀴, 제1 하부센서, 제2 지지바퀴 및 제3 하부센서 순서로 배열되도록 이루어질 수 있다. 제2 하부센서 및 상기 제3 하부센서 각각은, 바닥면(B)과의 상대적인 거리를 감지할 수 있는 범위 내 에서 다양하게 이루어질 수 있다. 제2 하부센서 및 상기 제3 하부센서 각각은, 그 형성되는 위치를 제외하고, 상술한 제1 하부센서와 동일하게 이루어질 수 있다. 제2 하부센서가 형성되는 위치에서 바디에는 제2 센서홀 및 제2 센서홈이 형성되고 범퍼 에는 제2 범퍼홈이 형성될 수 있으며, 제2 센서홀, 제2 센서홈 및 제2 범퍼홈 각각은 상술한 제1 센서홀, 제1 센서홈 및 제1 범퍼홈 각각과 동일하게 이루어질 수 있다. 또한, 제2 하부센서와 제2 센서홀, 제2 센서홈 및 제2 범퍼홈과의 관계는, 제1 하부센서 와 제1 센서홀, 제1 센서홈 및 제1 범퍼홈과의 관계와 동일하게 이루어질 수 있다. 제3 하부센서가 형성되는 위치에서 바디에는 제3 센서홀 및 제3 센서홈이 형성되고 범퍼 에는 제3 범퍼홈이 형성될 수 있으며, 제3 센서홀, 제3 센서홈 및 제3 범퍼홈 각각은 상술한 제1 센서홀, 제1 센서홀 및 제1 범퍼홈 각각과 동일하게 이루어질 수 있다. 또한, 제3 하부센서와 제3 센서홀, 제3 센서홈 및 제3 범퍼홈과의 관계는, 제1 하부센서 와 제1 센서홀, 제1 센서홈 및 제1 범퍼홈과의 관계와 동일하게 이루어질 수 있다. 본 발명의 실시예에 따른 로봇 청소기는, 제2 하부센서에 의해 감지되는 거리에 따라, 작동이 제어되도 록 이루어질 수 있다. 좀 더 구체적으로, 제2 하부센서에 의해 감지되는 거리에 따라, 제1 회전판 및 제2 회전판 중 어느 하나 이상의 회전이 제어될 수 있다. 예를 들어, 제2 하부센서에 의해 감지되는 거리가 소정값을 초과하거나 소정의 범위를 벗어나는 경우, 제1 회전판 및 제2 회전판의 회전이 정지하 면서 로봇 청소기가 정지되거나, 제1 회전판 및/또는 제2 회전판의 회전방향이 전환되면서 로봇 청소기의 이동방향이 전환되도록 이루어질 수 있다. 또한, 본 발명의 실시예에 따른 로봇 청소기는, 제3 하부센서에 의해 감지되는 거리에 따라, 작동이 제 어되도록 이루어질 수 있다. 좀 더 구체적으로, 제3 하부센서에 의해 감지되는 거리에 따라, 제1 회전판 및 제2 회전판 중 어느 하나 이상의 회전이 제어될 수 있다. 예를 들어, 제3 하부센서에 의해 감 지되는 거리가 소정값을 초과하거나 소정의 범위를 벗어나는 경우, 제1 회전판 및 제2 회전판의 회전이 정지하면서 로봇 청소기가 정지되거나, 제1 회전판 및/또는 제2 회전판의 회전방향이 전환되면서 로 봇 청소기의 이동방향이 전환되도록 이루어질 수 있다. 연결선(L1)으로부터 제2 하부센서까지의 거리 및 연결선(L1)으로부터 제3 하부센서까지의 거리는, 연 결선(L1)으로부터 제1 지지바퀴까지의 거리 및 연결선(L1)으로부터 제2 지지바퀴까지의 거리보다 짧 게 이루어질 수 있다. 또한, 제2 하부센서 및 제3 하부센서는, 제1 회전판의 중심, 제2 회전판의 중심, 제1 지지바 퀴의 중심 및 제2 지지바퀴의 중심을 각 꼭지점으로 하는 사각형(A)의 연직방향 영역 외부에 위치한 다. 제2 하부센서가 로봇 청소기의 좌측에 위치할 때, 제3 하부센서는 로봇 청소기의 우측에 위치 할 수 있다. 제2 하부센서와 제3 하부센서는 서로 대칭을 이룰 수 있다. 본 발명의 실시예에 따른 로봇 청소기는, 선회할 수 있고, 이때 제1 걸레, 제2 걸레, 제1 지지바퀴 및 제2 지지바퀴가 바닥에 접촉하며 로봇 청소기의 하중을 지지한다. 로봇 청소기의 좌측에 낭떠러지(F)가 위치하고 로봇 청소기가 좌측으로 방향을 전환하거나 선회할 때, 제 1 지지바퀴 및 제2 지지바퀴가 낭떠러지(F)로 진입하기 이전에 제2 하부센서에 의한 낭떠러지 (F)의 감지가 이루어질 수 있다. 제2 하부센서에 의한 낭떠러지(F)의 감지가 이루어질 때, 로봇 청소기 는, 제1 걸레, 제2 걸레, 제1 지지바퀴 및 제2 지지바퀴에 의해 하중이 지지된다. (도 9b 참조) 또한, 로봇 청소기의 우측에 낭떠러지(F)가 위치하고 로봇 청소기가 우측으로 방향을 전환하거나 회전할 때, 제1 지지바퀴 및 제2 지지바퀴가 낭떠러지(F)로 진입하기 이전에 제3 하부센서에 의한 낭떠 러지(F)의 감지가 이루어질 수 있다. 제3 하부센서에 의한 낭떠러지(F)의 감지가 이루어질 때, 로봇 청소 기는, 제1 걸레, 제2 걸레, 제1 지지바퀴 및 제2 지지바퀴에 의해 하중이 지지된다. (도 9c 참조) 상술한 바와 같이, 본 발명의 실시예에 따른 로봇 청소기에 의하면, 로봇 청소기가 방향을 전환하거나 어 느 한쪽으로 회전할 때 로봇 청소기가 낭떠러지(F)로 떨어지는 것을 방지할 수 있고, 로봇 청소기의 전체 적인 균형이 무너지는 것을 방지할 수 있다. 도 11은 본 발명의 또 다른 실시예에 따른 로봇 청소기 및 그 구성들을 개략적으로 도시한 단면도이다. 본 발명의 실시예에 따른 로봇 청소기는 제어부, 범퍼, 제1 센서 및 제2 센서를 포함하 여 이루어질 수 있다. 제어부는, 기설정된 정보 또는 실시간 정보에 따라, 제1 액추에이터 및 제2 액추에이터의 작동 을 제어하도록 이루어질 수 있다. 제어부의 제어를 위하여 로봇 청소기에는, 응용 프로그램이 저장된 저장매체가 구비될 수 있고, 제어부는, 로봇 청소기로 입력되는 정보, 로봇 청소기에서 출력되는 정 보 등에 따라 응용 프로그램을 구동하여 로봇 청소기를 제어하도록 이루어질 수 있다. 범퍼는, 바디의 테두리를 따라 결합되되, 바디를 상대로 움직이도록 이루어진다. 예를 들어, 범 퍼는, 바디의 중앙쪽으로 가까워지는 방향을 따라 왕복이동가능하게 바디에 결합될 수 있다. 범퍼는 바디의 테두리 일부를 따라 결합될 수 있고, 또는 바디의 테두리 전체를 따라 결합될 수 있다. 본 발명의 실시예에 따른 청소기에서, 연결선(L1)을 기준으로 범퍼와 같은 쪽을 이루는 바디의 가장 낮은 부분은 범퍼의 가장 낮은 부분보다 높거나 같게 이루어질 수 있다. 즉, 범퍼가 바디보다낮거나 같게 이루어질 수 있다. 이에 따라, 비교적 낮은 위치에 있는 장애물이 범퍼와 부딪히고 범퍼(19 0)에 의해 감지될 수 있다. 제1 센서는 바디에 결합되고, 바디를 상대로 한 범퍼의 움직임(상대이동)을 감지하도록 이 루어질 수 있다. 이러한 제1 센서는, 마이크로스위치(microswitch), 포토인터럽터(photo interrupter), 또는 택트스위치(Tact Switch) 등을 이용하여 이루어질 수 있다. 제어부는, 로봇 청소기의 범퍼가 장애물과 접촉한 경우 회피기동할 수 있도록 로봇 청소기를 제어할 수 있고, 제1 센서에 의한 정보에 따라 제1 액추에이터 및/또는 제2 액추에이터의 작동 을 제어하도록 이루어질 수 있다. 예를 들어, 로봇 청소기가 주행하면서 범퍼가 장애물에 접촉한 경우, 제1 센서에 의해 범퍼가 접촉한 위치가 파악될 수 있으며, 제어부는 이러한 접촉 위치를 벗어나 도록, 제1 액추에이터 및/또는 제2 액추에이터의 작동을 제어할 수 있다. 제2 센서는 바디에 결합되고, 장애물과의 상대적인 거리를 감지하도록 이루어질 수 있다. 제2 센서 는 거리센서로 이루어질 수 있다. 제어부는, 제2 센서에 의한 정보에 따라, 로봇 청소기와 장애물 간의 거리가 소정의 값 이하인 경 우, 로봇 청소기의 주행방향이 전환하거나, 로봇 청소기가 장애물과 멀어지도록, 제1 액추에이터 및 /또는 제2 액추에이터의 작동을 제어할 수 있다. 또한 제어부는, 제1 하부센서, 제2 하부센서 또는 제3 하부센서에 의해 감지되는 거리에 따라, 로봇 청소기가 정지하거나 주행방향이 전환되도록, 제1 액추에이터 및/또는 제2 액추에이터(17 0)의 작동을 제어할 수 있다. 도 12는 도 6에 도시된 로봇 청소기에서 각 구성의 크기를 설명하는 도면이다. 상술한 바와 같이, 본 발명의 실시예에 따른 로봇 청소기는, 제1 회전판의 회전시 발생되는 제1 걸레 와 바닥면(B) 간의 마찰력과, 제2 회전판의 회전시 발생되는 제2 걸레와 바닥면(B) 간의 마찰력에 의하여, 이동(주행)이 이루어질 수 있다. 본 발명의 실시예에 따른 로봇 청소기에서, 제1 지지바퀴 및 제2 지지바퀴는, 바닥과의 마찰력에 의해 로봇 청소기의 이동(주행)이 방해가 되지 않을 정도로 이루어질 수 있고, 로봇 청소기의 이동(주 행)시 부하증가를 유발하지 않을 정도로 이루어질 수 있다. 이를 위하여, 제1 지지바퀴의 폭(W2)과 제2 지지바퀴의 폭(W3)은, 제1 회전판의 직경(D1) 또는 제2 회전판의 직경(D2)과 비교할 때 충분히 작게 이루어질 수 있다. 구체적으로, 제1 지지바퀴의 폭(W2) 및 제2 지지바퀴의 폭(W3)은, 제1 회전판의 직경(D1) 또는 제2 회전판의 직경(D1)의 1/10보다 작게 이루어질 수 있다. 그리고 제1 회전판의 직경(D1)과 제2 회전판의 직경(D2) 각각은, 바디의 직경(D5)의 1/3보다 크고 1/2보다 작게 이루어질 수 있고, 제1 걸레의 직경(D3)과 제2 걸레의 직경(D4) 각각은, 바디의 직 경(D5)의 1/3보다 크고 2/3보다 작게 이루어질 수 있다. 상술한 바와 같이 이루어짐으로써, 제1 지지바퀴 및 제2 지지바퀴가 제1 걸레 및 제2 걸레와 함께 바닥에 접촉하여 로봇 청소기가 구동되더라도, 제1 지지바퀴와 바닥면(B) 간의 마찰력 및 제2 지 지바퀴와 바닥면(B) 간의 마찰력은, 제1 걸레와 바닥면(B) 간의 마찰력 및 제2 걸레와 바닥면(B) 간의 마찰력에 비하여 매우 작게 이루어지며, 이에 따라 불필요한 동력손실을 유발하지 않게 되고, 로봇 청소기 의 이동을 방해하지 않는다. 본 발명의 실시예에 따른 로봇 청소기에서, 제1 지지바퀴의 중심과 제2 지지바퀴의 중심 간의 수 평거리(C1)는, 제1 회전판의 회전중심과 제2 회전판의 회전중심간의 수평거리(C2)와 동일하거나 비슷하 게 이루어질 수 있다.(도 5a 참조) 제1 지지바퀴의 중심과 제2 지지바퀴의 중심 간의 수평거리가 C1이고, 제1 회전판의 회전중심과 제2 회전판의 회전중심 간의 거리를 C2라고 할 때, C1은 0.8*C2보다 크고 1.2*C2보다 작게 이루어질 수 있 다. 이에 따라, 본 발명의 실시예에 따른 로봇 청소기는, 제1 지지바퀴, 제2 지지바퀴, 제1 걸레 및 제2 걸레에 의해 안정적인 4점 지지가 가능하다. 본 발명의 실시예에 따른 로봇 청소기에서, 제1 지지바퀴의 회전축 및 제2 지지바퀴의 회전 축은, 연결선(L1)과 평행하게 이루어질 수 있다. 즉, 제1 지지바퀴의 회전축 및 제2 지지바퀴 의 회전축은 바디 상에서 그 위치가 고정(좌우방향으로 고정)될 수 있다. 제1 지지바퀴 및 제2 지지바퀴는, 제1 걸레 및 제2 걸레와 함께 바닥과 접촉할 수 있고, 이 때, 로봇 청소기의 직선 이동을 위하여, 제1 걸레와 제2 걸레는 서로 반대방향으로 동일한 속도로 회전할 수 있는데, 제1 지지바퀴와 제2 지지바퀴는 로봇 청소기의 전후방향 직선이동을 보조하게 된다. 본 발명의 실시예에 따른 로봇 청소기는 보조바퀴몸체를 포함하여 이루어질 수 있다. 이때, 보조바퀴몸 체는 바디의 하측에 회전가능하게 결합되고, 보조바퀴는 보조바퀴몸체에 회전가능하게 결 합된다. 즉, 보조바퀴는 보조바퀴몸체를 매개로 바디에 결합된다. 그리고 보조바퀴의 회전축과 보조바퀴몸체의 회전축은 서로 교차하는 형태로 이루어질 수 있고, 보조바퀴의 회전축의 방향과 보조바퀴몸체의 회전축의 방향은 서로 직교할 수 있다. 예를 들어, 보조바퀴몸체의 회전축은 연직방향을 향하거나 연직방향에서 조금 기울어질 수 있고, 보 조바퀴의 회전축은 수평방향을 향할 수 있다. 본 발명의 실시예에 따른 로봇 청소기에서, 보조바퀴는, 로봇 청소기가 실질적으로 사용되지 않을 때(제1 걸레 및 제2 걸레가 로봇 청소기에서 분리된 상태일 때) 바닥면(B)과 닿게되며, 이러한 상태 에서 로봇 청소기를 옮기고자 하는 경우, 보조바퀴몸체에 의해 보조바퀴가 향하는 방향이 자유롭 게 변형되며, 로봇 청소기의 이동이 용이하게 이루어질 수 있다. 앞에서, 본 발명의 특정한 실시예가 설명되고 도시되었지만 본 발명은 기재된 실시예에 한정되는 것이 아니고, 이 기술 분야에서 통상의 지식을 가진 자는 본 발명의 사상 및 범위를 벗어나지 않고서 다른 구체적인 실시예로 다양하게 수정 및 변형할 수 있음을 이해할 수 있을 것이다. 따라서, 본 발명의 범위는 설명된 실시예에 의하여 정하여 질 것이 아니고 청구범위에 기재된 기술적 사상에 의해 정하여져야 할 것이다."}
{"patent_id": "10-2019-0119158", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 로봇 청소기를 도시한 사시도이다. 도 2는, 도 1에 도시된 로봇 청소기에서 일부 구성을 분리하여 도시한 도면이다. 도 3은 도 1에 도시된 로봇 청소기를 도시한 배면도이다.도 4는 도 3에 도시된 로봇 청소기에서 일부 구성을 분리하여 도시한 도면이다. 도 5a는 본 발명의 다른 실시예에 따른 로봇 청소기를 도시한 저면도이다. 도 5a에서, 제1 회전판 및 제2 회전 판이 점선으로 표시되어 있다. 도 5b는 본 발명의 실시예에 따른 로봇 청소기에서 제1 하부센서, 제2 하부센서 또는 제3 하부센서가 바디에 결 합된 부분을 개략적으로 도시한 단면도이다. 도 5c 및 도 5d는 본 발명의 또 다른 실시예에 따른 로봇 청소기에서 제1 하부센서, 제2 하부센서 또는 제3 하 부센서가 바디에 결합된 부분을 개략적으로 도시한 단면도이다. 도 6a 내지 도 6c는 도 5a에 도시된 로봇 청소기의 직전 및 선회시, 제1 하부센서에 의한 낭떠러지의 감지를 설 명하는 도면이다. 도 7a 및 도 7b는 도 5a에 도시된 로봇 청소기를 도시한 측면도이다. 도 7a 및 도 7b에는 청소기의 하측 부분이 확대된 모습이 함께 도시되어 있다. 도 8a 및 도 8b는 도 5a에 도시된 로봇 청소기에서 일부 구성이 배제된 상태를 도시한 측면도이다. 도 8a 및 도 8b에는 청소기의 하측 부분이 확대된 모습이 함께 도시되어 있다. 도 9a는 본 발명의 또 다른 실시예에 따른 로봇 청소기를 도시한 저면도이다. 도 9a에서, 제1 회전판, 제2 회전 판, 제1 액추에이터 및 제2 액추에이터가 점선으로 표시되어 있다. 도 9b 및 도 9c는 도 9a에 도시된 로봇 청소기에서 제2 하부센서 또는 제3 하부센서에 의한 낭떠러지의 감지를 설명하는 도면이다. 도 10은 도 9a에 도시된 로봇 청소기를 도시한 분해사시도이다. 도 11은 본 발명의 또 다른 실시예에 따른 로봇 청소기 및 그 구성들를 개략적으로 도시한 단면도이다. 도 12는 도 6에 도시된 로봇 청소기에서 각 구성의 크기를 설명하는 도면이다."}
