{"patent_id": "10-2023-0076572", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0176838", "출원번호": "10-2023-0076572", "발명의 명칭": "사물인터넷 기반의 지능형 매장 관리 시스템", "출원인": "(주)포에스텍", "발명자": "김용구"}}
{"patent_id": "10-2023-0076572", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "외부 환경 정보를 검출하는 실외 환경 검출 모듈; 실내 환경 정보를 검출하는 실내 환경 검출 모듈; 지역별 날씨 정보를 예측해서 공유하는 환경 변화 예측 서버; 및 상기 외부 및 실내 환경 정보와 상기 예측된 날씨 정보 및 사용자의 설정 정보에 따라 적어도 하나의 실내 공조제어용 가전기기를 제어해서 실내 환경을 조절하는 통합 제어 모듈; 투명성 도어 및 도어 체결 모듈을 이용해서 출입자의 출입을 차단하는 출입 도어 장치; 출입자의 신체 정보를 검출하는 복수의 촬영부; 출입자에 대한 신체 정보 검출 영상과 신원 확인 또는 미확인 정보를 디스플레이하는 디스플레이 장치; 및 상기 출입자의 체온 정보, 상기 신체 정보, 상기 신원 확인 정보를 순차적으로 확인하여 상기 출입 도어 장치의체결 동작을 제어하는 모니터링 관리 장치를 포함하는 사물인터넷 기반의 지능형 매장 관리 시스템."}
{"patent_id": "10-2023-0076572", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 상기 통합 제어 모듈과 무선 통신을 수행하도록 연계되어 상기 사용자가 응용 프로그램을 통해 실내 환경을 설정 및 변경할 수 있도록 지원하는 이동 통신기기; 및 서로 다른 실내 공간에 각각 구비된 복수의 통합 제어 모듈과 무선 통신을 수행하며 상기 각각의 통합 제어 모듈을 통해 수집된 각 실내 공간별 외부 및 실내 환경 정보와 미리 예측된 날씨 정보에 따라 각각의 실내 공간별실내 환경을 설정 및 변경시키는 통합 관리 서버를 더 포함하는 사물인터넷 기반의 지능형 매장 관리 시스템."}
{"patent_id": "10-2023-0076572", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서, 상기 통합 관리 서버는 복수의 통합 제어 모듈로부터 서로 다른 각각의 실내 공간별 온도, 습도, 미세먼지 농도, 이산화탄소 농도, 일산화탄소 농도를 포함하는 실내 환경 정보를 수신하고, 상기 각각의 실내 공간별 실내 환경 정보와 예측된 날씨 정보에 따라 실내 공간별 온도 최적치, 습도 최적치,미세먼지 감소 수치, 이산화탄소 및 일산화탄소 감소 수치를 실시간으로 가변시켜 설정하며, 상기 가변 설정된 온도 최적치, 습도 최적치, 미세먼지 감소 수치, 이산화탄소 및 일산화탄소 감소 수치에 따라상기 각 실내 공간별 환경 조성용 가전기기들을 개별적으로 제어함으로써, 상기 각 실내 공간별로 실내 온도,습도, 미세먼지 농도, 이산화탄소 및 일산화탄소 농도를 조절하는 사물인터넷 기반의 지능형 매장 관리 시스템."}
{"patent_id": "10-2023-0076572", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 2 항에 있어서, 상기 전면 방향 출입자들의 푸쉬 동작 또는 접촉 동작을 유도하여 상기 출입자들의 지문 이미지를 검출하는 투공개특허 10-2024-0176838-3-명성 센싱 모듈을 더 포함하는 사물인터넷 기반의 지능형 매장 관리 시스템."}
{"patent_id": "10-2023-0076572", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4 항에 있어서, 상기 복수의 촬영부는 상기 출입 도어 장치의 전면 방향으로 배치되어 전면 방향 출입자들을 열화상 카메라로 촬영하고, 상기 출입자들에 대한 열화상 검출 영상 데이터를 생성하는 열화상 촬영부; 및 상기 모니터링 관리 장치의 제어에 따라 상기 전면 방향 출입자들에 대한 적외선 광 검출 영상 데이터를 검출하는 적외선 촬영부를 포함하는 사물인터넷 기반의 지능형 매장 관리 시스템."}
{"patent_id": "10-2023-0076572", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서, 상기 모니터링 관리 장치는 상기 열화상 촬영부로부터 수신되는 출입자의 열화상 검출 영상 데이터를 분석하여 출입자의 얼굴 부위에 대한높이 정보를 검출하는 검출 위치 분석부; 상기 투명성 감지부의 감지 블록 영역을 통해 상기 지문 이미지를 검출하도록 상기 투명성 감지부를 제어하는감지 제어부; 적외선 광 검출 영상 데이터로부터 출입자의 신체 부위 특징 정보를 검출하는 적외선 영상 분석부; 상기 적외선 광 검출 영상 데이터로부터 얼굴 형상 데이터를 검출하여 상기 출입자의 신원을 확인하는 패턴 분석부(920); 및 상기 지문 이미지와 신체 부위 특징 정보를 이용해서 출입자의 신원 정보를 확인하는 중앙 처리부를 포함하는사물인터넷 기반의 지능형 매장 관리 시스템."}
{"patent_id": "10-2023-0076572", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서, 상기 모니터링 관리 장치는 상기 지문 이미지 및 신체 부위 특징 정보와 대응되는 신원 정보를 저장하는 데이터 베이스; 상기 센싱 정보 분석부의 출입자 신원 확인 결과에 따라 출입 차단 신호를 상기 출입 도어 장치의 체결 모듈로전송하는 도어 잠금 제어부를 더 포함하는 사물인터넷 기반의 지능형 매장 관리 시스템."}
{"patent_id": "10-2023-0076572", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 5 항에 있어서, 상기 투명성 감지부는 상기 출입 도어 장치의 투명성 도어와 일체로 형성되거나 상기 투명성 도어의 전면 방향 표면에 투시 가능하게부착되고, 상기 투명성 도어 푸쉬 동작에 따라 접촉된 상기 출입자의 지문 이미지를 검출하는 사물인터넷 기반의 지능형매장 관리 시스템. 공개특허 10-2024-0176838-4-"}
{"patent_id": "10-2023-0076572", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "사물인터넷 기반의 지능형 매장 관리 시스템에 관한 것으로, 일 실시예에 따른 지능형 매장 관리 시스템은 외부 환경 정보를 검출하는 실외 환경 검출 모듈, 실내 환경 정보를 검출하는 실내 환경 검출 모듈, 지역별 날씨 정보 를 예측해서 공유하는 환경 변화 예측 서버, 및 상기 외부 및 실내 환경 정보와 상기 예측된 날씨 정보 및 사용 자의 설정 정보에 따라 적어도 하나의 실내 공조 제어용 가전기기를 제어해서 실내 환경을 조절하는 통합 제어 모듈, 투명성 도어 및 도어 체결 모듈을 이용해서 출입자의 출입을 차단하는 출입 도어 장치, 출입자의 신체 정 보를 검출하는 복수의 촬영부, 출입자에 대한 신체 정보 검출 영상과 신원 확인 또는 미확인 정보를 디스플레이 하는 디스플레이 장치, 및 상기 출입자의 체온 정보, 상기 신체 정보, 상기 신원 확인 정보를 순차적으로 확인하 여 상기 출입 도어 장치의 체결 동작을 제어하는 모니터링 관리 장치를 포함한다."}
{"patent_id": "10-2023-0076572", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 매장 내 공조, 조명 등 실내 환경을 유기적으로 제어하고, 원격으로 화재 감지, 도난 방지, 출입자 통제 및 관리를 수행할 수 있는 사물인터넷 기반의 지능형 매장 관리 시스템에 관한 것이다."}
{"patent_id": "10-2023-0076572", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "대부분의 가정이나 사무실 등의 실내 공간에는 냉난방 등 공조 제어를 위한 냉난방기기가 설치되어 있다. 냉난 방기기는 통상 보일러 및 실내 공조기 등의 작동을 제어하도록 구성되는 것이 일반적이나, 대형 오피스텔 등의 신축 건물에는 냉난방 공조 장치를 원격으로 제어하도록 구성된 것도 있다. 종래의 냉난방기기는 실내 공간의 벽면이나 기둥 등에 개별적으로 설치되어 실내의 온도 조절 용도로 사용되고 있다. 이외에도 필요에 따라 습도 감지기, 이산화탄소 및 일산화탄소 측정기 등이 독립적으로 설치되어 사용되 는 경우도 있다. 이산화탄소 및 일산화탄소 측정기는 감지 결과에 따라 경보만 울리는 수준이다. 최근에는 최저임금 인상, 52시간 근무제도 적용 등으로 인건비 부담이 높아지면서 비대면 거래를 선호하는 언택 트 문화의 확산으로 무인결제, 무인상점 등 리테일 업계의 변화가 가속화되고 있다. 무인 매장은 인건비 절약, 24시간 운영, 편리한 구매 등의 장점으로 리테일 업계에서 큰 관심을 받고 있지만, 아직 해결해야 할 과제가 많이 남아 있다. 매장 관리는 위해, 종래에는 CCTV 등의 모니터링 장치들을 이용해서 수동적이고 감시적으로 화재 감지, 도난 방 지, 출입자 관리를 수행하고 있다. 하지만, 냉난방기기 등의 공조 장치나 매장 내 조명 제어, 출입자 모니터링 등을 모두 관리자가 수동적으로 확인하고 제어해야 하기 때문에 질 높은 실내 환경을 구현하기 어려운 문제점이 있었다. 최근에는 4차 산업혁명에 따라 생활 속 사물들을 유무선 네트워크로 연결해 정보를 공유하는 사물인터넷(IoT) 기술이 다양한 분야에 적용되고 있는 실정이다. 사물인터넷은 각종 사물들에 통신 기능을 내장해 인터넷에 연결되도록 해 사람과 사물, 사물과 사물 간의 인터 넷 기반 상호 소통을 이루는 것으로서, 오프라인 매장 내에서 사용자가 더욱 편리한 쇼핑을 즐길 수 있게 하기 위해 사물인터넷을 기반으로 하는 매장 서비스 시스템에 대한 필요성이 대두되고 있다. 매장 서비스 시스템의 일 예로, 인공지능(AI) 얼굴인식 키오스크, 신용카드 인증에 의한 스마트 편의점, 드론 배송 서비스, 보안업체(에스원)의 무인 매장 솔루션 등 국내 주요 편의점을 비롯하여 일부 무인 매장에서는 하 이브리드 스마트 매장 형식으로 다양한 무인 매장 기술을 테스트하고 있다."}
{"patent_id": "10-2023-0076572", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명에서 이루고자 하는 기술적 과제는 무인 매장에 적용하기 위한 기술 개발의 일환으로 무인 매장 운용/관 제/유지보수 등의 효율적인 매장 운용 기술을 확보할 수 있는 사물인터넷 기반의 지능형 매장 관리 시스템을 제 공하는 것이다. 또한, 무인 매장을 대상으로 고사양 기술을 배제하고 Edge- Device에 기초한 무인 관제 시스템 의 인프라 확대를 위한 기반 기술을 개발하는데 그 목적이 있다. 한편, 본 발명에서 이루고자 하는 추가적인 기술적 과제는 매장 내 공조, 조명 등 실내 환경을 유기적으로 제어 하고, 원격으로 화재 감지, 도난 방지, 출입자 통제 및 관리를 수행할 수 있는 사물인터넷 기반의 지능형 매장 관리 시스템을 제공하는 것이다. 본 발명에서 이루고자 하는 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급하지 않은"}
{"patent_id": "10-2023-0076572", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "또 다른 기술적 과제들은 아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하 게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0076572", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 다양한 실시예에 따른 사물인터넷 기반의 지능형 매장 관리 시스템은 외부 환경 정보를 검출하는 실 외 환경 검출 모듈, 실내 환경 정보를 검출하는 실내 환경 검출 모듈, 지역별 날씨 정보를 예측해서 공유하는 환경 변화 예측 서버, 및 상기 외부 및 실내 환경 정보와 상기 예측된 날씨 정보 및 사용자의 설정 정보에 따라 적어도 하나의 실내 공조 제어용 가전기기를 제어해서 실내 환경을 조절하는 통합 제어 모듈, 투명성 도어 및 도어 체결 모듈을 이용해서 출입자의 출입을 차단하는 출입 도어 장치, 출입자의 신체 정보를 검출하는 복수의 촬영부, 출입자에 대한 신체 정보 검출 영상과 신원 확인 또는 미확인 정보를 디스플레이하는 디스플레이 장치, 및 상기 출입자의 체온 정보, 상기 신체 정보, 상기 신원 확인 정보를 순차적으로 확인하여 상기 출입 도어 장 치의 체결 동작을 제어하는 모니터링 관리 장치를 포함한다. 통합 제어 모듈은 사물인터넷 기반 기기들에서 얻은 데이터를 엣지 디바이스(예를 들어, 잭슨 나노)에서 딥러닝 을 통해 데이터를 분석 및 가공한다. 그리고 통합 관리서버는 통합 제어 모듈을 통해 가공된 데이터 들을 축적, 즉 데이터베이스화 한다. 통합 제어 모듈은 사물인터넷 기반의 통합 플랫폼 내에서 명령어 송수신 과정을 통해 사물인터넷 기반 기기들의 동작을 제어한다. 이를 위해, 통합 제어 모듈은 제조사가 다른 사물인터넷 기반 기기들이 호환되도록 통합 플랫 폼을 구축 및 연계시킬 수 있다. 이에 따라 통합 제어 모듈은 무인 매장의 관리자가 응용 프로그램을 통해 사물 인터넷 기반으로 해당 매장을 관리 및 제어할 수 있다. 이동 통신기기와 통합 관리서버는 시각적인 관제를 위해 웹 이외에도 응용 프로그램 형태로 대쉬보드와 맵 등을 생성하여 데이터들과 제어 툴을 시각화하고, 실시간으로 운용 상황이 모니터링되도록 한다. 통합 제어 모듈과 통합 관리 서버는 CCTV 영상 데이터를 엣지 디바이스 기반의 영상 프로토콜과 영상 처리 프로 그램을 통해 분석해서, CCTV 영상의 움직임 및 환경 변화를 확인한다. 통합 제어 모듈이나 통합 관리 서버는 CCTV 영상 데이터의 딥러닝 분석, 즉 이상 행동 감지 모델과의 비교 분석 과정 등을 통해 CCTV 영상내 방문자의 이상 행동(예를 들어, 흡연, 화재, 절도 등)을 감지하고 감지 결과를 메시지와 음향으로 송출한다. 통합 제어 모듈이나 통합 관리 서버는 매장내 이상 현상 및 방문자 이상 행동 감지시 응용 프로그램을 통해 사 용자의 이동 통신기기로 경고 메시지를 송출하고, 자동으로 112나 119 등의 비상 대응 관계 기관으로 신고 메시 지를 송출할 수 있다. 일 실시예에 따른 사물인터넷 기반의 지능형 매장 관리 시스템은 상기 통합 제어 모듈과 무선 통신을 수행하도 록 연계되어 상기 사용자가 응용 프로그램을 통해 실내 환경을 설정 및 변경할 수 있도록 지원하는 이동 통신기 기, 및 서로 다른 실내 공간에 각각 구비된 복수의 통합 제어 모듈과 무선 통신을 수행하며 상기 각각의 통합 제어 모듈을 통해 수집된 각 실내 공간별 외부 및 실내 환경 정보와 미리 예측된 날씨 정보에 따라 각각의 실내 공간별 실내 환경을 설정 및 변경시키는 통합 관리 서버를 더 포함한다. 일 실시예에 따른 사물인터넷 기반의 지능형 매장 관리 시스템은 전면 방향 출입자들의 푸쉬 동작 또는 접촉 동 작을 유도하여 상기 출입자들의 지문 이미지를 검출하는 투명성 센싱 모듈을 더 포함한다. 상기 복수의 촬영부는 상기 출입 도어 장치의 전면 방향으로 배치되어 전면 방향 출입자들을 열화상 카메라로 촬영하고, 상기 출입자들에 대한 열화상 검출 영상 데이터를 생성하는 열화상 촬영부, 및 상기 모니터링 관리 장치의 제어에 따라 상기 전면 방향 출입자들에 대한 적외선 광 검출 영상 데이터를 검출하는 적외선 촬영부를 포함한다."}
{"patent_id": "10-2023-0076572", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 다양한 실시예에 따른 사물인터넷 기반의 지능형 매장 관리 시스템은 매장 내 공조, 조명 등 실내 환 경을 보다 유기적으로 제어해서 매장 관리 효율을 향상시킬 수 있다. 또한, 원격으로 화재 감지, 도난 방지, 출 입자 통제 및 관리를 수행할 수 있다. 본 발명에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효과들은"}
{"patent_id": "10-2023-0076572", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0076572", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "전술한 목적, 특징 및 장점은 첨부된 도면을 참조하여 상세하게 후술되며, 이에 따라 본 발명이 속하는 기술분 야에서 통상의 지식을 가진 자가 본 발명의 기술적 사상을 용이하게 실시할 수 있을 것이다. 본 발명을 설명함 에 있어서 본 발명과 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에는 상세한 설명을 생략한다. 또한, 본 명세서에서 사용되는 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"구성된다\" 또는 \"포함한다\" 등의 용어는 명세서상에 기재된 여러 구성 요소들, 또는 여러 단계를 반드시 모두 포함하는 것으로 해석되지 않아야 하며, 그 중 일부 구성 요소들 또는 일부 단계들은 포함되지 않을 수도 있고, 또는 추가적인 구성 요소 또는 단계들을 더 포함할 수 있는 것으로 해석되어야 한다. 이하, 첨부된 도면을 참조하여 본 발명의 일 실시예에 따른 실내 환경 통합 제어 시스템에 대해 구체적으로 설 명하도록 한다. 도면에서 동일한 참조부호는 동일 또는 유사한 구성요소를 가리키는 것으로 사용된다. 도 1은 본 발명의 실시 예에 따른 사물인터넷 기반의 지능형 매장 관리 시스템을 구체적으로 나타낸 구성 도면 이다. 도 1에 도시된 매장 관리 시스템은 공기 청정기, 냉방기기, 및 난방기기, 실외 환경 검출모듈 , 실내 환경 검출모듈, 환경 변화 예측 서버, 통합 제어모듈, 이동 통신기기, 출입자 통제 도어, 디스플레이 장치, 모니터링 관리 장치 및 통합 관리서버를 포함한다. 실외 환경 검출 모듈은 특정 매장을 비롯한 사무실 또는 오피스텔 등 미리 설정된 건물이나 공간의 외부 환경 정보(예를 들어, 온도, 습도, 미세먼지 농도, 이산화탄소 농도, 일산화탄소 농도 등)을 실시간으로 검출한 다. 이를 위해, 실외 환경 검출 모듈은 적어도 하나씩의 온도 센서, 습도 센서, 미세먼지 농도 감지센서, 이산화탄소 및 일산화탄소 농도 감지센서 등을 포함해서 전체적인 외부 환경정보를 검출한다. 실외 환경 검출모듈은 블루투스 및 와이 파이 등 사물인터넷 통신을 위한 근거리 무선 통신모듈을 포 함한다. 이에, 실외 환경 검출모듈은 실시간으로 검출되는 온도 정보, 습도 정보, 미세먼지 농도 정보, 이 산화탄소 농도 정보, 일산화탄소 농도 정보 등을 포함하는 외부 환경 정보를 통합 제어모듈로 전송한다. 실내 환경 검출모듈은 가정이나 사무실 또는 오피스텔 등 미리 설정된 실내 공간의 온도, 습도, 미세먼지 농도, 이산화탄소 농도, 일산화탄소 농도 등을 실시간으로 검출한다. 이를 위해, 실내 환경 검출모듈은 적 어도 하나씩의 온도 센서, 습도 센서, 미세먼지 농도 감지센서, 이산화탄소 및 일산화탄소 농도 감지센서 등을포함해서 실내 환경 정보를 검출한다. 실내 환경 검출 모듈은 공기 청정기, 냉방기기, 및 난방 기기 등에 구비된 온도 센서, 습도 센서, 미세먼지 농도 감지센서, 이산화탄소 및 일산화탄소 농도 감지센 서 등을 통해 실내 환경 정보를 검출할 수도 있다. 실내 환경 검출모듈은 블루투스 및 와이 파이 등의 근거리 무선 통신 모듈을 포함해서 구성되거나, 실내 환경 검출 모듈과 일체로 구성될 수도 있다. 이에, 실내 환경 검출모듈은 실시간으로 검출되는 실내 의 온도 정보, 습도 정보, 미세먼지 농도 정보, 이산화탄소 농도 정보, 일산화탄소 농도 정보 등을 포함하는 실 내 환경 정보를 통합 제어모듈로 전송한다. 환경 변화 예측 서버는 위성 영상 정보 및 기상 정보를 분석해서 각 지역의 날씨를 예측 및 예보하는 시스 템의 서버로서, 기상청 예측 시스템의 서버나 날씨 예측 정보 공유 서버, 또는 인터넷 포털 사이트 운용 서버 등이 될 수 있다. 이러한, 환경 변화 예측 서버는 미리 설정된 지역별 온도 정보, 습도 정보, 미세먼지 정 보 등을 포함하는 날씨 정보와 날씨 예측 정보를 실시간으로 공유한다. 통합 제어 모듈은 실외 환경 검출 모듈로부터 실시간으로 검출되는 실외 온도, 습도, 미세먼지 농도, 이산화탄소 농도, 일산화탄소 농도 등을 포함하는 외부 환경 정보를 수신한다. 또한, 통합 제어 모듈은 실내 환경 검출 모듈을 통해 실시간으로 검출된 실내의 온도, 습도, 미세먼 지 농도, 이산화탄소 농도, 일산화탄소 농도 등을 포함하는 실내 환경 정보를 수신한다. 이와 더불어, 환경 변 화 예측 서버나 이동 통신기기를 통해서 미리 설정된 지역별 온도 정보, 습도 정보, 미세먼지 정보 등을 포함하는 날씨 정보와 날씨 예측 정보 또한 실시간으로 수신한다. 통합 제어 모듈은 실시간으로 수신되는 외부 및 실내 환경 정보와 예측된 날씨 정보 및 사용자 설정 정보 에 따라 공기 청정기, 냉방기기, 및 난방기기 등 적어도 하나씩의 환경 조성용 가전기기를 제어 해서 실내 환경을 조절한다. 구체적으로, 통합 제어 모듈은 외부 및 실내 환경 정보와 예측된 날씨 정보 및 사용자 설정 정보에 따라 실내 공간의 온도 최적치, 습도 최적치, 미세먼지 감소 수치, 이산화탄소 및 일산화탄소 감소 수치 등을 실시간 으로 가변시켜 설정한다. 그리고 가변 설정된 온도 최적치, 습도 최적치, 미세먼지 감소 수치, 이산화탄소 및 일산화탄소 감소 수치에 따라 공기 청정기, 냉방기기, 및 난방기기 등 환경 조성용 가전기기를 각각 제어함으로써, 실내 온도, 습도, 미세먼지 농도, 이산화탄소 및 일산화탄소 농도 등을 조절한다. 도 2는 도 1의 통합 제어 모듈과 통합 관리서버간 딥러닝 데이터 분석을 통한 원격 관제 과정을 나타낸 도면이 다. 도 2를 참조하면, 통합 제어 모듈은 공기 청정기, 냉방기기, 및 난방기기, 실외 환경 검출 모듈, 실내 환경 검출모듈, 환경 변화 예측 서버, CCTV 등 사물인터넷 기반 기기들에서 얻은 데 이터를 엣지 디바이스(예를 들어, 잭슨 나노)에서 딥러닝을 통해 데이터를 분석 및 가공한다. 그리고 통합 관리 서버는 통합 제어 모듈을 통해 가공된 데이터들을 축적, 즉 데이터베이스화 한다. 통합 제어 모듈은 사물인터넷 기반의 통합 플랫폼 내에서 명령어 송수신 과정을 통해 공기 청정기, 냉방기기, 및 난방기기, 실외 환경 검출모듈, 실내 환경 검출모듈 등 사물인터넷 기반 기 기들의 동작을 제어한다. 이를 위해, 제조사가 다른 사물인터넷 기반 기기들이 호환되도록 통합 플랫폼을 구축 및 연계시킬 수 있다. 이 경우, 무인 매장의 관리자가 응용 프로그램을 통해 사물인터넷 기반으로 해당 매장을 관리 및 제어할 수 있다. 통합 제어 모듈의 실내 환경 설정 및 제어방법에 대해서는 이후에 첨부된 도면을 참조하여 좀 더 구체적으 로 설명하기로 한다. 도 3은 사용자는 이동 통신기기와 통합 제어 모듈을 통한 사물인터넷 기기들의 통합 제어 과정을 나타낸 참조 도면이다. 도 3을 참조하면, 이동 통신기기는 통합 제어 모듈과 원거리 또는 근거리 무선 통신을 수행하도록 연 계되어, 사용자가 응용 프로그램을 통해 실내 환경을 설정 및 변경할 수 있도록 지원한다. 사용자는 이동 통신기기의 응용 프로그램을 통해 외부 및 실내 환경 정보와 예측된 날씨 정보 등을 실시간 으로 확인할 수 있다. 이에, 사용자는 외부 및 실내 환경 정보와 예측된 날씨 정보, 생활 패턴, 컨디션 등을 모 두 고려해서, 응용 프로그램을 통해 공기 청정기, 냉방기기, 및 난방기기 등 환경 조성용 가전기기들의 구동 모드를 가변시켜 설정할 수 있다. 이동 통신기기를 비롯한 통합 관리서버는 시각적인 관제를 위해 웹 이외에도 응용 프로그램 형태로 대쉬보드와 맵 등을 생성하여 데이터들과 제어 툴을 시각화하고, 실시간으로 운용 상황이 모니터링되도록 한다. 또한, 사용자는 응용 프로그램을 통해 실내 공간의 온도 최적치, 습도 최적치, 미세먼지 감소 수치, 이산화탄소 및 일산화탄소 감소 수치 등을 실시간으로 가변시켜 설정할 수 있다. 이에, 통합 제어 모듈은 이동 통신기 기를 통해 가변 설정된 온도 최적치, 습도 최적치, 미세먼지 감소 수치, 이산화탄소 및 일산화탄소 감소 수치에 따라 각각의 환경 조성용 가전기기들을 제어함으로써, 실내 온도, 습도, 미세먼지 농도, 이산화탄소 및 일산화탄소 농도 등을 조절할 수 있다. 도 4는 도 1의 통합 제어 모듈과 통합 관리 서버의 매장 내 이상 현상 및 방문자 이상 행동 감지 대응과정을 나 타낸 참조 도면이다. 도 4를 참조하면, 사용자는 응용 프로그램을 통해 CCTV 영상을 통해 매상 상황을 실시간으로 확인할 수 있다. 이와 더불어, 통합 제어 모듈이나 통합 관리 서버는 CCTV 영상 데이터를 엣지 디바이스 기반의 영상 프로토콜과 영상 처리 프로그램을 통해 분석해서, CCTV 영상의 움직임 및 환경 변화를 확인할 수 있다. 특히, 통합 제어 모듈이나 통합 관리 서버는 CCTV 영상 데이터의 딥러닝 분석, 즉 이상 행동 감지 모델과의 비교 분석 과정 등을 통해 CCTV 영상 내 방문자의 이상 행동(예를 들어, 흡연, 화재, 절도 등)을 감지하고 감지 결과를 메시지와 음향으로 송출할 수 있다. 예를 들어, 통합 제어 모듈이나 통합 관리 서버는 매장 내 이상 현상 및 방문자 이상 행동 감지시 응용 프로그램을 통해 사용자의 이동 통신기기로 경고 메시지를 송출하고, 자동으로 112나 119 등의 비상 대응 관계 기관으로 신고 메시지를 송출할 수 있다. 통합 관리 서버는 다수의 실내 공간들에 각각의 통합 제어 모듈들이 구성되어 있는 매장 외에도 공장, 오피스텔, 학교, 공공기관 등에서 다수의 실내 공간들에 대한 실내 환경을 개별적으로 제어할 수 있다. 이를 위해, 통합 관리 서버는 서로 다른 실내 공간에 각각 구비된 복수의 통합 제어 모듈과 원거리 무선 통신을 수행한다. 그리고, 통합 관리 서버는 각각의 통합 제어 모듈을 통해 수집된 각 실내 공 간별 외부 및 실내 환경 정보와 미리 예측된 날씨 정보에 따라 각각의 실내 공간별 실내 환경을 설정 및 변경시 키도록 각 공간의 통합 제어 모듈들을 제어한다. 통합 관리 서버는 각각의 통합 제어 모듈을 통해 각각의 실내 공간별 온도, 습도, 미세먼지 농도, 이 산화탄소 농도, 일산화탄소 농도 등을 포함하는 실내 환경 정보를 수신한다. 그리고, 각각의 실내 공간별 실내 환경 정보와 예측된 날씨 정보에 따라 실내 공간별 온도 최적치, 습도 최적치, 미세먼지 감소 수치, 이산화탄소 및 일산화탄소 감소 수치 등을 실시간으로 가변시켜 설정한다. 이어, 통합 관리 서버는 가변 설정된 온도 최적치, 습도 최적치, 미세먼지 감소 수치, 이산화탄소 및 일산 화탄소 감소 수치에 따라 실내 공간별 환경 조성용 가전기기들을 개별적으로 제어함으로써, 실내 공간별로 실내 온도, 습도, 미세먼지 농도, 이산화탄소 및 일산화탄소 농도 등을 조절할 수 있다. 도 5는 도 1에 도시된 통합 제어 모듈을 구체적으로 나타낸 구성 블록도이다. 도 5에 도시된 통합 제어 모듈은 디스플레이 패널, 인터페이스 모듈, 제어부, 제1 통신모 듈, 제2 통신모듈, 제n 통신모듈, 및 전원 공급부를 포함한다. 구체적으로, 디스플레이 패널은 외부 및 실내 환경 정보와 예측된 날씨 정보 및 사용자 설정 정보를 표시 한다. 즉, 기상청의 환경 정보를 비롯하여 외부 및 실내 환경 정보와 사용자가 요구하는 설정 환경 정보를 표시 하고, 연결된 가전기기들의 동작 상태 등이 표시되도록 할 수 있다. 인터페이스 모듈은 이동 통신기기 및 통합 관리 서버와 외부 및 실내 환경 정보와 예측된 날씨 정보 및 사용자 설정 정보를 공유하고, 이동 통신기기를 통해 사용자 설정 정보를 수신 및 전달한다. 사용 자는 인터페이스 모듈을 통해 가전기기들의 동작을 제어하기 위한 사용자 설정 정보를 입력할 수 있다. 제어부는 외부 및 실내 환경 정보와 예측된 날씨 정보 및 사용자 설정 정보에 따라 실내 온도, 습도, 미세 먼지 농도, 이산화탄소 및 일산화탄소 농도가 조절되도록 각 환경 조성용 가전기기의 제어 정보 및 제어 신호를 설정한다. 구체적으로, 제어부는 외부 및 실내 환경 정보와 예측된 날씨 정보 및 사용자 설정 정보에 따라 실내 공간 의 온도 최적치, 습도 최적치, 미세먼지 감소 수치, 이산화탄소 및 일산화탄소 감소 수치 등을 실시간으로 가변시켜 설정할 수 있다. 그리고, 가변 설정된 온도 최적치, 습도 최적치, 미세먼지 감소 수치, 이산화탄소 및 일 산화탄소 감소 수치에 따라 공기 청정기, 냉방기기, 및 난방기기 등 환경 조성용 가전기기를 각 각 제어하기 위한 제어 정보 및 제어 신호를 설정한다. 이에, 제어부는 제어 정보 및 제어 신호를 각각의 환경 조성용 가전기기로 전송하여 실내 온도, 습도, 미세먼지 농도, 이산화탄소 및 일산화탄소 농도 등을 조절 할 수 있다. 제1 통신모듈은 실외 환경 검출 모듈로부터 외부 환경 정보를 수신하여 제어부와 공유한다. 그 리고, 제2 통신모듈은 실내 환경 검출 모듈로부터 실내 환경 정보를 수신하여 제어부와 공유한 다. 또한, 제n 통신모듈은 각각의 환경 조성용 가전기기로 제어부에서 설정된 제어 정보 및 제어 신 호를 전송한다. 제1 내지 제n 통신 모듈(106,107,108)은 블루투스 및 와이 파이 등의 근거리 무선통신 모듈, LTE 등의 원거리 무선 통신 모듈, RS485 등의 유선 통신모듈 등 각각의 유/무선 통신모듈을 선택적으로 포함해서 구성될 수 있다. 도 6은 도 1의 출입자 통제 도어, 디스플레이 장치 및 모니터링 관리 장치를 구체적으로 나타낸 구성도이다. 그 리고 도 7은 도 6에 도시된 출입자 통제 도어, 디스플레이 장치 및 모니터링 관리 장치에 대한 세부 구성 요소 들을 나타낸 구성 블록도이다. 도 6 및 도 7을 참조하면, 사물인터넷 기반의 지능형 매장 관리 시스템은 출입자 통제 및 관리를 위한 장치들로 서, 출입자 통제 도어, 디스플레이 장치, 영상 카메라, 열화상 촬영부, 적외선 촬영부 , 및 모니터링 관리 장치를 더 포함한다. 매장을 비롯한 특정 실내 공간이나 행사 공간 등의 출입구에는 출입자 통제 도어가 설치되며, 출입자 통제 도어는 투명성 도어 및 도어 체결 모듈을 이용해서 출입자의 출입을 차단하거나 통제할 수 있다. 출입자 통제 도어와 인접한 주변 공간에는 디스플레이 장치, 영상 카메라, 열화상 촬영부, 적외선 촬영부 등이 배치될 수 있다. 영상 카메라는 실시간으로 출입구를 촬영하여 출입자들의 출입 영상 데이터를 생성하며, 열화상 촬영부 는 출입자들의 체온 정보가 색온도로 포함되는 열화상 검출 영상 데이터를 생성한다. 또한, 적외선 촬영부 는 출입자들의 신체 일부로 적외선 광을 출사하고, 반사된 적외선 광을 수신하여 출입자들의 신체 일부에 대한 신체 정보를 검출할 수 있다. 열화상 촬영부와 적외선 촬영부는 디스플레이 장치나 별도의 거치대 등에 의해 거치될 수 있다. 또한, 열화상 촬영부와 적외선 촬영부는 출입자 통제 도어의 적어도 어느 한 측면이나 상단부 등에 실장되는 형태로 배치될 수도 있다. 디스플레이 장치는 출입자 통제 도어를 통해 출입하거나 출입이 차단되는 출입자에 대한 영상과 출입 자의 체온 및 검출된 신체 정보 등을 선택적으로 디스플레이한다. 이와 더불어, 디스플레이 장치는 출입자 에 대한 신원 확인 또는 미확인 결과 정보를 선택적으로 디스플레이한다. 디스플레이 장치에는 CCD 카메라 등의 적어도 하나의 영상 카메라가 실장되거나, 디스플레이 장치 에 적어도 하나의 영상 카메라가 내장될 수 있다. 이와 달리, 적어도 하나의 영상 카메라는 출 입자 통제 도어의 적어도 어느 한 측면이나 상단부 등에 실장되는 형태로 배치되거나, 별도의 거치대 등에 의해 거치될 수도 있다. 디스플레이 장치는 적어도 하나의 영상 카메라로 촬영되는 출입자 통제 도어의 전면 방향 촬영 영상을 배경 영상으로 디스플레이한다. 이때, 디스플레이 장치는 모니터링 관리 장치의 제어에 따라 모니터링 관리 장치로부터 입력되는 영상 데이터를 영상으로 디스플레이한다. 따라서, 디스플레이 장치 는 출입하거나 출입이 차단되는 출입자에 대한 영상과 함께 출입자의 체온 정보, 출입자의 지문이나 신체 일부의 패턴 정보, 신원 확인 정보 등을 선택적으로 디스플레이할 수 있다. 디스플레이 장치는 태블릿 PC(Tablet Personal Computer), PMP(Portable Multimedia Player), UMPC(Ultra Mobile PC) 등과 같은 휴대용 전자 기기로 구성될 수 있다. 또한, 디스플레이 장치는 텔레비전, 노트북, 모니터 등의 평판형 디스플레이 기기로 구성될 수 있다. 모니터링 관리 장치는 열화상 촬영부, 적외선 촬영부, 투명성 감지부, 및 영상 카메라 등을 통해 각각 검출되는 출입자의 열화상 검출 영상, 적외선 반사 형상 데이터, 신체 패턴 정보, 지문 정보 등으로부터 출입자의 신체 정보를 추출한다. 그리고, 모니터링 관리 장치는 출입자의 체온 정보, 적 외선 반사 형상 데이터, 신체 패턴 정보, 지문 정보 등을 통한 적어도 하나의 신체 정보, 및 신원 확인 정보를 순차적으로 확인하여, 신원이 확인되는 출입자와 신원이 미확인되는 신원 미상자를 선별한다. 모니터링 관리 장치는 열화상 검출 영상 데이터 분석 결과에 따라 신원이 확인되는 출입자와 신원이 미확 인되는 신원 미상자에 대한 체온 정보가 선택적으로 디스플레이 장치에 표시되도록 영상 데이터를 생성하 여 디스플레이 장치로 공급한다. 또한, 적어도 하나의 신체 정보, 신원 확인 또는 미확인 결과 정보 등이 선택적으로 디스플레이 장치에 표시되도록 영상 데이터를 생성하여 디스플레이 장치로 공급할 수 있 다. 모니터링 관리 장치는 체온 정보가 기준치 이상으로 검출된 출입자, 및 신원 미상자 선별시 바로 출입 차 단 신호를 도어 체결 모듈로 전송함으로써, 도어 체결 모듈에 의해 투명성 도어 및 출입자 통제 도어 가 고정 및 잠금 되도록 한다. 이렇게, 도어 체결 모듈은 출입 차단 신호에 즉각 반응하여 투명성 도 어 및 출입자 통제 도어를 바닥의 고정 틀 등에 고정시킴으로써, 발열 의심자나 신원 미상자가 출입자 통 제 도어를 통과하지 못하도록 통제할 수 있다. 이하, 출입자 통제 도어, 디스플레이 장치, 모니터링 관리 장치 등의 세부 구성 요소들과 각 구 성 요소들의 구동 특징을 좀 더 구체적으로 설명하면 다음과 같다. 도 6과 함께 도 7을 참조하면, 열화상 촬영부는 적어도 하나의 열화상 카메라를 포함한다. 열화상 촬영부 는 출입자 통제 도어의 적어도 어느 한 측면이나 상단부 등에 실장되는 형태로 배치되거나, 별도의 거치대 등에 의해 거치될 수 있다. 열화상 촬영부는 출입자 통제 도어의 전면 방향으로 배치되어, 모니터링 관리 장치의 제어에 따 라 출입자 통제 도어의 전면 방향으로 출입하는 출입자들을 열화상 카메라로 촬영하고, 출입자들의 체온 정보가 색온도 형태로 포함되는 열화상 검출 영상 데이터를 생성한다. 출입자 통제 도어를 향해 다가오는 출입자들에 대한 열화상 검출 영상 데이터는 순차적으로 모니터링 관리 장치로 전송된다. 적외선 촬영부는 열화상 촬영부와 함께 열화상 촬영부와 동일하게 출입자 통제 도어의 전 면 방향으로 배치된다. 적외선 촬영부는 모니터링 관리 장치의 제어에 따라 출입자들의 정면 방향으 로 적외선 광을 방사하고 출입자들에 의해 반사되는 적외선 광을 수광하여, 적외선 광 검출 영상 데이터를 생성 한다. 출입자들에 대한 적외선 광 검출 영상 데이터는 순차적으로 모니터링 관리 장치로 전송된다. 투명성 감지부는 투명한 유리 패널이나 실리콘 패널 또는 투명 필름에 패터닝되어, 투명하게 투시 가능한 타입으로 형성된다. 이러한 투명성 감지부는 출입자 통제 도어의 투명성 도어와 일체로 형성되거나, 투명성 도어의 전면 방향 표면에 투시 가능하게 부착될 수 있다. 투명성 감지부는 출입자 통제 도어 와 인접한 위치에 출입자 통제 도어와는 별도로 배치될 수도 있다. 투명성 감지부는 투명성 도어와 함께 투명하게 구성된 상태로, 투명성 도어를 열기 위한 출입자의 투명성 도어 푸쉬(push) 동작시, 투명성 감지부에 접촉된 출입자의 지문 이미지를 검출할 수도 있다. 투명성 감지 부는 투명한 유리 패널이나 실리콘 패널 또는 투명 필름에 매트릭스 구조로 패터닝된 복수의 발광 다이오 드와 복수의 광학식 포토다이오드를 이용해서 출입자의 지문 감지 신호를 검출하고, 지문 감지 신호를 디지털 변환하여 지문 이미지 데이터를 생성한다. 투명성 감지부는 실시간으로 검출된 출입자의 지문 이미지 데이 터를 모니터링 관리 장치로 전송한다. 모니터링 관리 장치는 검출 위치 분석부, 감지 제어부, 적외선 영상 분석부, 패턴 분석부 , 데이터 베이스, 도어 잠금 제어부, 및 중앙 처리부를 포함한다. 검출 위치 분석부는 출입자의 열화상 검출 영상 데이터를 분석하여 체온이 가장 높게 검출되는 부위, 예를 들어 출입자의 얼굴 부위에 대한 체온 정보를 검출한다. 검출 위치 분석부는 열화상 검출 영상 데이터의 색온도, 채도, 명도 정보 등을 분석하여 체온이 가장 높게 검출되는 부위에 대한 체온 정보를 검출한다. 검출된 체온 정보는 실시간으로 중앙 처리부로 공급한다. 검출 위치 분석부는 열화상 촬영부로부터 수신되는 출입자의 열화상 검출 영상 데이터를 분석하여 체 온이 가장 높게 검출되는 출입자의 얼굴 부위에 대한 높이 정보 및 검출 위치 좌표 정보를 검출한다. 구체적으 로, 검출 위치 분석부는 미리 설정된 열화상 카메라 위치, 및 열화상 검출 영상 데이터의 중심 포인트 간거리 정보를 이용해서 출입자의 열화상 검출 영상 데이터를 적어도 한 프레임 단위로 분석한다. 검출 위치 분석부는 열화상 카메라와 열화상 검출 영상의 중심 포인트 간 거리 정보를 이용해서, 열화상 카메라의 배치 높이 대비 한 프레임 열화상 검출 영상의 중심 포인트 높이를 검출한다. 그리고, 지면 대비 열화 상 검출 영상의 중심 포인트 높이, 열화상 검출 영상의 중심 포인트 높이 대비 열화상 촬영된 출입자 얼굴 부위 의 높이, 지면 대비 출입자 얼굴 부위의 높이 정보, 검출 영상의 중심 포인트 대비 얼굴 부위 좌표 정보를 순차 적으로 검출한다. 최종 분석 및 검출된 지면 대비 출입자 얼굴 부위의 높이 정보와 검출 좌표 정보는 감지 제어 부와 적외선 영상 분석부, 및 패턴 분석부로 각각 전송된다. 감지 제어부는 투명성 감지부의 평면 면적을 미리 설정된 복수의 감지 블록 영역으로 분할해서 구분 하고, 적어도 하나의 감지 블록 영역에서 지문 이미지를 검출하도록 적어도 하나의 감지 블록 영역을 활성화시 켜 구동한다. 도 8은 도 6 및 도 7에 도시된 적외선 촬영부의 적외선 센싱 방향 좌표 설정 방법을 설명하기 위한 도면이다. 도 8을 참조하면, 검출 위치 분석부는 열화상 촬영부의 열화상 영상 검출 높이와 열화상 검출 데이터 의 검출 폭에 따른 전체 열화상 검출 영역을 미리 설정된 복수의 검출 영역(IM1 내지 IMn)으로 분할해서 구분한 다. 검출 위치 분석부는 미리 분할 구분된 복수의 검출 영역(IM1 내지 IMn) 중 출입자 얼굴 부위의 높이 정보 와 대응되는 적어도 하나의 검출 영역(IMb)을 검출한다. 그리고 검출 위치 분석부는 미리 분할 구분된 복 수의 검출 영역(IM1 내지 IMn) 중 출입자 얼굴 부위의 높이 정보와 대응되는 적어도 하나의 검출 영역(IMb)에 대한 블록 배치 정보, 및 검출 좌표 정보(B(x,y))를 생성해서 감지 제어부와 적외선 영상 분석부, 및 패턴 분석부로 각각 전송한다. 도 9는 도 7에 도시된 적외선 영상 분석부의 적외선 검출 영상 분석 방법을 설명하기 위한 도면이다. 도 9를 참조하면, 적외선 촬영부는 출입자 얼굴 부위의 높이 정보와 대응되는 적어도 하나의 검출 영역 (IMb)에 대한 블록 배치 정보, 또는 검출 좌표 정보(B(x,y))를 적외선 영상 분석부를 통해 수신할 수 있다. 적외선 촬영부의 적외선 센싱 방향은 일체로 형성되거나 조립된 방향 전환 기기에 의해 전환 및 변경될 수 있다. 이러한 적외선 촬영부의 적외선 센싱 방향은 출입자 얼굴 부위의 높이 정보와 대응되는 적어도 하나 의 검출 영역(IMb), 또는 검출 방향 좌표 정보(B(x,y))와 대응되는 방향으로 전환될 수 있다. 적외선 촬영부는 적외선 광학 방식을 이용하여 적어도 하나의 검출 영역(IMb), 또는 검출 방향 좌표 정보 (B(x,y))와 대응하는 방향에 위치하는 출입자의 신체 부위에 대한 패턴을 검출할 수 있다. 적외선 촬영부는 복수의 적외선 광원을 이용해서 적외선 광을 출광시키는 복수의 발광부, 및 적어도 하나 의 검출 영역(IMb), 또는 센싱 방향 좌표 정보(B(x,y))와 대응하는 방향에 위치하는 출입자의 얼굴로부터 반사 된 적외선 광을 검출하는 복수의 수광부를 포함한다. 발광부에 포함된 복수의 적외선 광원은 행렬 구조의 적외선 LED 어레이로 구성된다. 그리고, 수광부는 출입자의 얼굴로부터 반사된 적외선 광을 포커싱하는 복수의 렌즈, 및 복수의 렌즈를 통해 수신된 광학 이미지를 전기적 인 이미지 신호로 변환해서 출력하는 복수의 광학 이미지 센서를 포함한다. 여기서, 복수의 광학 이미지 센서는 발광부의 적외선 LED 어레이와 마찬가지로 행렬 구조의 어레이로 구성될 수 있다. 도 9(a)로 도시된 바와 같이, 복수의 광학 이미지 센서 어레이는 출입자의 얼굴로 적외선 광을 출사하고, 도 9(b)로 도시된 바와 같이, 복수의 광학 이미지 센서 어레이는 출입자의 얼굴로부터 반사된 적외선 광량에 따라 반사된 얼굴 형상 데이터를 적외선 영상 분석부로 제공할 수 있다. 적외선 촬영부의 수광부는 검출 위치 분석부의 검출 방향 좌표 정보(B(x,y))에 따라 출입자의 얼굴에 서 반사되는 적외선 광을 연속적으로 검출하고, 적외선 영상 분석부는 적외선 광이 반사된 얼굴 형상 데이 터를 연속적으로 생성해서 패턴 분석부와 공유할 수 있다. 얼굴로 출사된 적외선 광은 얼굴의 정면부에서 정면으로 반사되어, 정면부의 반사 광량이 많을 수 있다. 반면, 얼굴의 측면이나 코의 측면에서는 적외선 광이 난반사되어 산란되고, 검은색의 눈썹이나 동공에서는 적외선 광 이 흡수되어 반사 광량이 적어질 수 있다. 따라서, 출입자의 얼굴 형태에 따라 적외선 광의 반사 광량과 반사 형상은 출입자들별로 모두 상이할 수 있다. 도 10은 도 9에 따른 적외선 영상 분석부의 출입자 신원 정보 검출 방법을 설명하기 위한 도면이다. 구체적으로, 도 10은 적외선 광이 반사된 얼굴 형상 영상 이미지를 도식화한 것이다. 도 10을 참조하면, 얼굴로 출사된 적외선 광은 얼굴의 정면부에서 정면으로 반사되어, 정면부의 반사 광량이 많 을 수 있다. 즉, 밝게 나타날 수 있다. 반면, 얼굴의 측면이나 코의 측면에서는 적외선 광이 난반사되어 산란되고, 검은색의 눈썹이나 동공에서는 적외 선 광이 흡수되어 반사 광량이 적어질 수 있다. 따라서, 출입자의 얼굴 형태에 따라 적외선 광의 반사 광량과 반사 형상은 출입자들별로 모두 상이할 수 있다. 패턴 분석부는 적외선 광이 반사된 얼굴 형상 데이터를 필터링하고, 데이터 베이스에 저장된 출입 허 용자들의 얼굴 형상 데이터들과 각각 비교한다. 패턴 분석부는 필터링된 얼굴 형상 데이터와 미리 저장된 얼굴 형상 데이터들의 비교함으로써, 미리 설정된 오차 범위 내로 유사하게 비교된 출입자의 신원 정보를 검출 한다. 도 10을 참조하면, 패턴 분석부는 적외선 광이 반사된 얼굴 형상 데이터로부터 얼굴 형상에 대한 면적이나 넓이, 가로 및 세로 폭, 가로 또는 세로 방향의 최대 폭과 최소 폭, 얼굴 형상의 외곽 패턴 등 정보를 추출한다. 그리고, 출입 허용자들의 얼굴 형상 데이터들에 포함된 얼굴 형상에 대한 면적이나 넓이, 가로 및 세 로 폭, 가로 또는 세로 방향의 최대 폭과 최소 폭, 얼굴 형상의 외곽 패턴 등 정보와 순차적으로 비교한다. 비 교된 얼굴 형상에 대한 면적이나 넓이, 가로 및 세로 폭, 가로 또는 세로 방향의 최대 폭과 최소 폭, 얼굴 형상 의 외곽 패턴 등의 정보 중 미리 설정된 복수의 정보가 미리 설정된 오차 범위 내로 유사하게 비교되면, 비교된 출입자의 신원 정보를 검출한다. 만일, 신원 정보가 검출되지 않으면 미확인 결과 신호를 중앙 처리부와 도어 잠금 제어부로 전송한다. 도 11은 도 7에 도시된 적외선 영상 분석부의 출입자 신원 정보 검출 방법을 설명하기 위한 또 다른 도면이다. 도 11을 참조하면, 적외선 촬영부는 복수의 발광부를 이용해서 적어도 하나의 검출 영역(IMb), 또는 센싱 방향 좌표 정보(B(x,y))와 대응하는 방향으로 적외선 광을 출사한다. 그리고, 복수의 수광부를 이용해서 적어도 하나의 검출 영역(IMb), 또는 센싱 방향 좌표 정보(B(x,y))와 대응하는 방향에 위치하는 출입자의 얼굴, 눈썹 및 동공으로부터 반사된 적외선 광을 검출한다. 전술한 바와 같이, 적외선 촬영부에 형성된 복수의 수광부는 복수의 렌즈를 통해 수신된 광학 이미지를 전 기적인 이미지 신호로 변환해서 출력하는 복수의 광학 이미지 센서를 포함하며, 복수의 광학 이미지 센서는 발 광부의 적외선 LED 어레이와 마찬가지로 행렬 구조의 어레이(예를 들어, 도 13에 도시된 SS11 내지 SS98 블록의 어레이)로 구성될 수 있다. 복수의 광학 이미지 센서 어레이(SS11 내지 SS98 블록의 어레이)는 출입자의 얼굴, 눈썹 및 동공으로부터 반사 된 적외선 형태에 따라 눈썹 및 동공 패턴들의 형상 데이터를 적외선 영상 분석부로 제공할 수 있다. 다시 말해, 적외선 촬영부의 수광부는 눈썹 및 동공 패턴들을 연속적으로 검출하고, 눈썹 및 동공 패턴들의 형 상 데이터를 연속적으로 생성해서 적외선 영상 분석부로 제공할 수 있다. 적외선 영상 분석부는 눈썹 및 동공 패턴들의 형상 데이터에 대한 신체 부위 패턴 이미지, 즉 출입자의 눈 썹 및 동공 패턴 이미지를 검출한다. 그리고, 눈썹 및 동공 패턴 이미지로부터 눈썹의 두께 정보, 눈썹의 길이 정보, 눈썹 간 거리 정보, 동공의 폭 정보, 동공 간 거리 정보 중 적어도 하나의 정보를 검출해서 중앙 처리부 등으로 전송한다. 중앙 처리부는 적외선 영상 분석부를 통해 검출된 눈썹의 두께 정보, 눈썹의 길이 정보, 눈썹 간 거 리 정보, 동공의 폭 정보, 동공 간 거리 정보 중 적어도 하나의 정보를 데이터 베이스에 저장된 출입 허용 자들의 눈썹의 두께 정보, 눈썹의 길이 정보, 눈썹 간 거리 정보, 동공의 폭 정보, 동공 간 거리 정보 중 적어 도 하나의 정보와 각각 순차적으로 비교한다. 그리고 미리 설정된 오차 범위 내로 유사하게 비교된 출입자의 신 원 정보를 검출한다. 만일, 신원 정보가 검출되지 않으면 미확인 결과 신호를 도어 잠금 제어부로 전송한 다. 도 12는 도 6 및 도 7에 도시된 투명성 감지부의 블록 활성화 방법을 설명하기 위한 도면이다. 그리고 도 13은 도 6 및 도 7에 도시된 투명성 센싱 패널의 세부 구조와 지문 정보 검출 방법을 나타낸 도면이다. 도 12 및 도 13을 참조하면, 감지 제어부는 검출 위치 분석부를 통해 지면 대비 출입자 얼굴 부위의 높이 정보가 수신되면, 얼굴 부위의 높이 정보(또는, 높이 값)에 미리 설정된 평균 얼굴 반지름 길이 값을 가감하여 얼굴 부위의 길이 값(Ph1 또는 Ph2)을 산출한다. 그리고, 얼굴 부위의 높이 정보(또는, 높이 값)으로부터 얼굴 부위 길이 값(Ph1 또는 Ph2)의 적어도 1배 길이 값을 감산하여 출입자의 푸쉬 예측 영역의 높이 값과 길이 값(Hw1 또는 Hw2)을 산출한다. 출입자의 푸쉬 높이는 출입자의 가슴 부위 또는 배 부위와 대응되는 높이에서 이루어질 수 있다. 이에, 감지 제 어부는 출입자의 얼굴 높이 값에서 얼굴 부위 길이 값(Ph1 또는 Ph2)의 적어도 1배 길이 값을 낮추어 감산 함으로써, 출입자의 푸쉬 예측 영역(가슴이나 배 부위)의 높이 값과 길이 값(Hw1 또는 Hw2)을 산출할 수 있다. 감지 제어부는 투명성 감지부의 평면 면적을 미리 설정된 복수의 감지 블록 영역(BL1 내지 BLn)으로 분할해서 구분한다. 여기서, n은 2 이상의 자연수이다. 감지 제어부는 복수의 감지 블록 영역(BL1 내지 BLn) 중 출입자의 푸쉬 예측 영역(가슴이나 배 부위)의 높 이 값과 길이 값(Hw1 또는 Hw2)에 대응되는 적어도 하나의 감지 블록 영역에서 지문 이미지가 검출될 수 있도록 적어도 하나의 감지 블록 영역을 활성화시켜 구동한다. 이때, 감지 제어부는 출입자의 푸쉬 예측 영역의 높이 값과 길이 값(Hw1 또는 Hw2)에 대응되는 적어도 하나의 감지 블록 영역(BL22)으로 접촉 구동 신호들을 공 급한다. 이에, 투명성 감지부는 접촉 구동 신호들이 공급된 적어도 하나의 감지 블록 영역(BL22)으로부터 접촉 감지 신호들을 수신하고, 접촉 감지 신호들을 디지털 신호로 변환하여 지문 이미지 및 지문 이미지 데이터 를 생성할 수 있다. 도 13을 참조하면, 투명성 감지부는 복수의 감지 블록 영역(BL1 내지 BLn)으로 분할 구분될 수 있다. 각각의 감지 블록 영역(BL1 내지 BLn)은 수평 방향으로 나란하게 배열된 복수의 접촉 구동 배선(DVn), 복수의 접촉 구동 배선(DVn)과 교차되도록 수직 방향으로 나란하게 배열된 복수의 접촉 감지 배선(SVn), 복수의 접촉 구동 배선(DVn)과 복수의 접촉 감지 배선(SVn)의 교차 영역들에 각각 형성되어 하나씩의 접촉 구동 배선(DVn) 및 접촉 감지 배선(SVn)과 전기적으로 연결된 복수의 광학식 포토다이오드(PDn)를 포함한다. 복수의 광학식 포토다이오드(PDn)는 각각 연결된 하나씩의 접촉 구동 배선(DVn)으로부터 접촉 구동 신호가 입력 되면, 전면에 접촉된 전면 지문 형상과 접촉 압력에 따라 가변되는 정전 용량에 대응하여 전압 값 또는 전류량 이 가변된 접촉 감지 신호를 각각의 접촉 감지 배선(SVn)으로 전송한다. 투명성 감지부는 각각의 접촉 감 지 배선(SVn)으로 검출되는 접촉 감지 신호들을 전류량이나 전압 크기에 따라 디지털 신호로 변환하고, 미리 설 정된 프레임 크기로 패턴화하여 지문 이미지 및 지문 이미지 데이터를 생성한다. 복수의 접촉 구동 배선(DVn)과 복수의 접촉 감지 배선(SVn)의 교차 영역 중 적어도 하나의 교차 영역에는 하나 씩의 접촉 구동 배선(DVn) 및 접촉 감지 배선(SVn)과 전기적으로 연결된 적어도 하나의 발광 다이오드(LE)가 더 포함된다. 적어도 하나의 발광 다이오드(LE)는 접촉 구동 배선(DVn)으로부터 접촉 구동 신호가 입력되면, 접촉 감지 배선 (SVn)의 전압 대비 접촉 구동 신호의 차 전압 크기에 따라 발광한다. 이와 같이, 적어도 하나의 발광 다이오드 (LE)가 발광하면, 출입자는 적어도 하나의 발광 다이오드(LE)가 발광하는 적어도 하나의 감지 블록 영역(BL22) 을 지문 감지를 위한 감지 블록 영역(BL22)으로 확인하고 푸쉬할 수 있다. 검출 위치 분석부는 적외선 촬영부의 신체 부위 패턴 이미지 검출 방향, 및 검출 방향에 대한 좌표 정보를 설정해서 적외선 촬영부로 전송한다. 중앙 처리부는 지문 이미지와 신체 부위 특징 정보를 이용해서 출입자의 신원 정보를 확인한다. 구체적으로, 중앙 처리부는 투명성 감지부를 통해 검출된 지문 이미지 또는 지문 이미지 데이터를 데 이터 베이스에 저장된 출입 허용자들의 지문 이미지 또는 지문 이미지 데이터들과 각각 비교하고, 미리 설 정된 오차 범위 내로 유사하게 비교된 출입자의 신원 정보를 검출한다. 만일, 신원 정보가 검출되지 않으면 미 확인 결과 신호를 도어 잠금 제어부로 전송한다. 한편, 중앙 처리부는 지문 이미지 또는 지문 이미지 데이터들을 비교해서 검출된 신원 정보, 얼굴 형상 데 이터를 비교해서 검출된 신원 정보, 및 동공과 눈썹 이미지 패턴을 비교해서 검출된 신원 정보를 모두 비교한다. 그리고 지문 이미지 또는 지문 이미지 데이터들을 비교해서 검출된 신원 정보, 얼굴 형상 데이터를 비교해서 검출된 신원 정보, 및 동공과 눈썹 이미지 패턴을 비교해서 검출된 신원 정보가 모두 동일하면 출입자 를 직원이나 관리자 등의 신원 확인 출입자로 판별하고 신원 확인 출입자 정보를 중앙 처리부로 전송한다. 반면, 지문 이미지 또는 지문 이미지 데이터들을 비교해서 검출된 신원 정보, 얼굴 형상 데이터를 비교해서 검 출된 신원 정보, 및 동공과 눈썹 이미지 패턴을 비교해서 검출된 신원 정보가 서로 다르면 미확인 결과 신호를중앙 처리부로 전송한다. 중앙 처리부는 매장 출입자의 체온 검출 정보, 지문이나 신체 부위 패턴 등 적어도 하나의 신체 정보, 신 원 확인 또는 미확인 결과 정보 등이 선택적으로 디스플레이 장치에 표시되도록 영상 데이터를 생성하여 디스플레이 장치로 공급한다. 또한, 중앙 처리부는 지문 이미지 또는 지문 이미지 데이터들을 비교해서 검출된 신원 정보, 얼굴 형상 데 이터를 비교해서 검출된 신원 정보, 및 동공과 눈썹 이미지 패턴을 비교해서 검출된 신원 정보가 서로 다르게 판단되었음을 알리는 신원 정보 미확인 결과를 텍스트 데이터로 생성한다. 그리고, 지문 이미지 또는 지문 이미 지 데이터들을 비교해서 검출된 신원 정보, 얼굴 형상 데이터를 비교해서 검출된 신원 정보, 및 동공과 눈썹 이 미지 패턴을 비교해서 검출된 신원 정보가 서로 다르게 판단되었음을 알리는 신원 정보 미확인 결과가 디스플레 이 장치에 텍스트 영상으로 표시되도록 디스플레이 장치에 텍스트 테이터를 전송한다. 본 명세서와 도면에 개시된 본 발명의 실시 예들은 본 발명의 기술 내용을 쉽게 설명하고, 본 발명의 이해를 돕 기 위해 특정 예를 제시한 것일 뿐이며, 본 발명의 범위를 한정하고자 하는 것은 아니다. 또한, 앞서 설명된 본 발명에 따른 실시예들은 예시적인 것에 불과하며, 당해 분야에서 통상의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 범위의 실시예가 가능하다는 점을 이해할 것이다. 따라서, 본 발명의 진정한 기술적 보호 범위 는 다음의 특허청구범위에 의해서 정해져야 할 것이다."}
{"patent_id": "10-2023-0076572", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시 예에 따른 사물인터넷 기반의 지능형 매장 관리 시스템을 구체적으로 나타낸 구성 도면 이다. 도 2는 도 1의 통합 제어 모듈과 통합 관리서버간 딥러닝 데이터 분석을 통한 원격 관제 과정을 나타낸 도면이 다. 도 3은 사용자는 이동 통신기기와 통합 제어 모듈을 통한 사물인터넷 기기들의 통합 제어 과정을 나타낸 참조 도면이다. 도 4는 도 1의 통합 제어 모듈과 통합 관리 서버의 매장내 이상 현상 및 방문자 이상 행동 감지 대응과정을 나 타낸 참조 도면이다. 도 5는 도 1에 도시된 통합 제어 모듈을 구체적으로 나타낸 구성 블록도이다. 도 6은 도 1의 출입자 통제 도어, 디스플레이 장치 및 모니터링 관리 장치를 구체적으로 나타낸 구성도이다. 도 7은 도 6에 도시된 출입자 통제 도어, 디스플레이 장치 및 모니터링 관리 장치에 대한 세부 구성 요소들을 나타낸 구성 블록도이다. 도 8은 도 6 및 도 7에 도시된 적외선 촬영부의 적외선 센싱 방향 좌표 설정 방법을 설명하기 위한 도면이다. 도 9는 도 7에 도시된 적외선 영상 분석부의 적외선 검출 영상 분석 방법을 설명하기 위한 도면이다. 도 10은 도 9에 따른 적외선 영상 분석부의 출입자 신원 정보 검출 방법을 설명하기 위한 도면이다. 도 11은 도 7에 도시된 적외선 영상 분석부의 출입자 신원 정보 검출 방법을 설명하기 위한 또 다른 도면이다. 도 12는 도 6 및 도 7에 도시된 투명성 감지부의 블록 활성화 방법을 설명하기 위한 도면이다. 도 13은 도 6 및 도 7에 도시된 투명성 센싱 패널의 세부 구조와 지문 정보 검출 방법을 나타낸 도면이다."}
