{"patent_id": "10-2017-0029503", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2018-0102844", "출원번호": "10-2017-0029503", "발명의 명칭": "알루미늄 클래드 판재와 그 제조방법", "출원인": "삼성전자주식회사", "발명자": "전창우"}}
{"patent_id": "10-2017-0029503", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "아노다이징이 가능한 알루미늄 클래드 판재에 있어서,알루미늄 7xxx 계열 합금을 포함하는 심재; 및 상기 심재의 일면 또는 양면에 배치되고, 알루미늄 6xxx 계열 합금 또는 알루미늄 1xxx 계열 합금을 포함하는피복재;를 포함하며, 상기 알루미늄 7xxx 계열 합금은,아연(Zn) 4.0 ~ 8.0 중량 %, 마그네슘(Mg)는 1.0 ~ 3.0 중량 % 및 나머지는 알루미늄(Al)과 불가피한 적어도하나의 불순물을 포함하는 것을 특징으로 하는 알루미늄 클래드 판재."}
{"patent_id": "10-2017-0029503", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,상기 알루미늄 6xxx 계열 합금은, 실리콘(Si) 0.4 ~ 1.4 중량 %, 마그네슘(Mg) 0.6 ~ 1.3 중량 % 및 나머지는 알루미늄(Al)과 불가피한 적어도하나의 불순물을 포함하는 것을 특징으로 하는 알루미늄 클래드 판재."}
{"patent_id": "10-2017-0029503", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2항에 있어서, 상기 알루미늄 클래드 판재는 열처리에 의해, 330 ~ 450MPa의 항복 강도의 특성을 나타내는 것을 특징으로 하는알루미늄 클래드 판재."}
{"patent_id": "10-2017-0029503", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 2항에 있어서, 상기 알루미늄 7xxx 계열 합금의 상기 적어도 하나의 불순물은 실리콘(Si), 철(Fe), 구리(Cu), 망간(Mn), 크롬(Cr), 티타늄(Ti) 중 적어도 하나이며,상기 알루미늄 클래드 판재에서, 상기 구리(Cu)는 총 중량 대비 1.0 ~ 2.0 % 를 포함하도록 조성된 것을 특징으로 하는 알루미늄 클래드 판재."}
{"patent_id": "10-2017-0029503", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 2항에 있어서, 상기 알루미늄 6xxx 계열 합금의 상기 적어도 하나의 불순물은 철(Fe), 구리(Cu), 망간(Mn), 크롬(Cr), 아연(Zn), 티타늄(Ti) 중 적어도 하나이며,상기 구리(Cu)가 총 중량 대비 1.0 % 이하를 포함하도록 조성된 것을 특징으로 하는 알루미늄 클래드 판재."}
{"patent_id": "10-2017-0029503", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2018-0102844-3-제 3항에 있어서,상기 피복재로 상기 알루미늄 6xxx 계열 합금을 접합하고, 상기 알루미늄 6xxx 계열 합금은 상기 알루미늄 클래드 판재의 전체 두께 10 ~ 50% 범위로 구성된 것을 특징으로 하는 알루미늄 클래드 판재."}
{"patent_id": "10-2017-0029503", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 3항에 있어서,상기 피복재로 상기 알루미늄 1xxx 계열 합금을 접합하고, 상기 알루미늄 1xxx 계열 합금은 상기 알루미늄 클래드 판재의 전체 두께의 20% 이하로 구성된 것을 특징으로 하는 알루미늄 클래드 판재."}
{"patent_id": "10-2017-0029503", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 2항에 있어서,적어도 450MPa의 강도를 가지는 상기 알루미늄 7xxx 계열 합금에, 적어도 250MPa의 강도를 가지는 상기 알루미늄 6xxx 계열 합금을 적층하고,상기 적층된 판재는 40 ~ 60%의 압하율로 열간 압연한 것을 특징으로 하는 알루미늄 클래드 판재."}
{"patent_id": "10-2017-0029503", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 2항에 있어서,적어도 450MPa의 강도를 가지는 상기 알루미늄 7xxx 계열 합금에 상기 알루미늄 1xxx 계열 합금을 적층하고,상기 적층된 판재는 10 ~ 20 %의 압하율로 열간 압연한 것을 특징으로 하는 알루미늄 클래드 판재."}
{"patent_id": "10-2017-0029503", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 2항에 있어서,적어도 450MPa의 강도를 가지는 상기 알루미늄 7xxx 계열 합금의 전면에는 적어도 250MPa상기 알루미늄 6xxx 계열 합금을 적층하고, 상기 알루미늄 7xxx 계열 합금의 후면에는 상기 알루미늄 1xxx 계열 합금을 적층하는 것을특징으로 하는 알루미늄 클래드 판재."}
{"patent_id": "10-2017-0029503", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "알루미늄 합금으로 구성된 외장재를 포함하는 전자 장치에 있어서,제 1 방향을 향하는 전면 커버 및 상기 전면 커버의 반대인 제 2 방향을 향하는 후면 커버를 포함하는 하우징으로서, 상기 하우징은 상기 전면 커버의 적어도 일부를 형성하는 투명 영역을 포함하는 하우징;상기 하우징 내에 배치되고, 상기 전면 커버를 통하여 노출된 화면 영역을 포함하는 디스플레이 장치를 포함하고, 상기 하우징은,알루미늄 7xxx 계열 합금을 포함하는 심재; 및 상기 심재의 일면 또는 양면에 배치되고, 알루미늄 6xxx 계열 합금 또는 알루미늄 1xxx 계열 합금을 포함하는 피복재;를 포함하며, 상기 알루미늄 7xxx 계열 합금은, 아연(Zn)5.1 ~ 6.1 중량 %, 마그네슘(Mg)는 2.1 ~ 2.9 중량 % 및 나머지는 알루미늄(Al)과 불가피한 적어도 하나의 불순물을 포함하는 것을 특징으로 하는 전자 장치.공개특허 10-2018-0102844-4-청구항 12 아노다이징이 가능한 알루미늄 클래드 판재의 제조 방법에 있어서,알루미늄 7xxx 계열 합금, 알루미늄 6xxx 계열 합금 또는 알루미늄 1xxx 계열 합금을 마련하는 공정;심재로 상기 알루미늄 7xxx 계열 합금을 배치하고, 상기 심재 영역의 일면 또는 양면에 피복재로 상기 알루미늄6xxx 계열 합금 또는 상기 알루미늄 1xxx 계열 합금을 적층하는 공정;상기 적층된 판재를 480도 내지 520도에서 가열하여 연화시키고, 압연 접합을 수행하는 공정;을 포함하는 것을특징으로 하는 알루미늄 클래드 판재의 제조 방법."}
{"patent_id": "10-2017-0029503", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 12항에 있어서,상기 연화된 판재를 단조 및 성형하는 공정;520도 내지 540도에서 30분 이상 가열한 후 수냉하는 용체화 처리 공정; 및상기 용체화 처리된 판재를 80 내지 180 도에서 8시간 이상 가열한 후 공냉시키는 시효 경화 처리 공정;을 더포함하는 것을 특징으로 하는 알루미늄 클래드 판재의 제조 방법."}
{"patent_id": "10-2017-0029503", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13항에 있어서, 상기 알루미늄 합금 또는 순수 알루미늄을 마련하는 공정에서,상기 심재에 사용하는 상기 알루미늄 7xxx 계열 합금은 항복 강도가 450MPa 이상이거나, 상기 피복재에 사용하는 상기 알루미늄 6xxx 계열 합금은 항복 강도가 250MPa 이상인 것을 특징으로 하는 알루미늄 클래드 판재의 제조 방법."}
{"patent_id": "10-2017-0029503", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 13항에 있어서, 상기 적층된 판재를 가열하여 연화시키는 공정에서,상기 적층된 판재를480도 내지 520도의 온도에서 0.5 내지1.5시간 동안 가열하여 연화시키는 공정을 포함하는것을 특징으로 하는 알루미늄 클래드 판재의 제조 방법."}
{"patent_id": "10-2017-0029503", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 13항에 있어서, 상기 적층된 판재를 압연 접합시키는 공정에서,상기 적층된 판재를 480도 내지 520도의 온도에서 15분 이상 가열하여 계면간의 확산 접합시키는 공정을 포함하고,상기 공정은 상기 적층된 판재를 40 내지 60%의 압하율로 열간 압연하는 것을 특징으로 하는 알루미늄 클래드판재의 제조 방법."}
{"patent_id": "10-2017-0029503", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 15항에 있어서, 상기 적층된 판재를 압연 접합시키는 공정에서,상기 압연 접합 공정은 복수 회 반복 실시하고,상기 피복재에 사용하는 상기 알루미늄 6xxx 계열 합금은 40% 이상의 압하율로 압연 접합시키는 공정을 포함하공개특허 10-2018-0102844-5-는 것을 특징으로 하는 알루미늄 클래드 판재의 제조 방법."}
{"patent_id": "10-2017-0029503", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 12항에 있어서, 상기 연화된 판재를 단조 및 성형하는 공정에서,상기 적층된 판재를 단조 성형 후 5분 이상 가열한 후, 재단조 및 재성형하는 공정을 포함하는 것을 특징으로하는 알루미늄 클래드 판재의 제조 방법."}
{"patent_id": "10-2017-0029503", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 13항에 있어서, 상기 용체화 처리 공정에서,상기 적층된 판재를 500 내지 540 도에서 3.5 내지 4.5 시간 가열한 후 수냉하는 공정을 포함하는 것을 특징으로 하는 알루미늄 클래드 판재의 제조 방법."}
{"patent_id": "10-2017-0029503", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 13항에 있어서, 상기 시효 경화 처리 공정에서,상기 용체화 처리된 판재를 60 내지 100 도에서 12 내지 20시간 동안 가열하는 공정; 상기 가열된 판재를 120 내지 180도에서 18 내지 30시간 가열하는 공정; 및 공냉시키는 공정;을 포함하는 것을 특징으로 하는 알루미늄 클래드 판재의 제조 방법."}
{"patent_id": "10-2017-0029503", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명 다양한 실시예에 따른 아노다이징이 가능한 알루미늄 클래드 판재는, 알루미늄 7xxx 계열 합금을 포함하 는 심재; 및 상기 심재의 일면 또는 양면에 배치되고, 알루미늄 6xxx 계열 합금 또는 알루미늄 1xxx 계열 합금을 포함하는 피복재;를 포함하며, 상기 알루미늄 7xxx 계열 합금은, 아연(Zn) 4.0 ~ 8.0 중량 %, 마그네슘(Mg)는 1.0 ~ 3.0 중량 % 및 나머지는 알루미늄(Al)과 불가피한 적어도 하나의 불순물을 포함할 수 있다. 본 발명의 다양한 실시예에 따른 알루미늄 클래드 판재와 그 제조방법은, 클래드 판재 접합 후 열처리를 통하여 접합 강도를 향상시키고, 강도 저하 없이 시효 경화 시켜, 표면 특성과 기계적 특성이 우수한 클래드 판재를 제 조하고자 한다."}
{"patent_id": "10-2017-0029503", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시 예는, 아노다이징이 가능한 알루미늄 클래드 판재와 그 제조 방법에 관한 것이다."}
{"patent_id": "10-2017-0029503", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 알루미늄은 인류가 지금까지 가장 많이 사용하고, 많은 분야에 적용되어 있는 경량성 금속 소재이다. 알루미늄 합금은 알루미늄을 주요 구성 성분으로 하고 주요 합금 원소로 구리, 마그네슘, 망간, 규소, 주석, 아연 등이 있다. 대부분의 알루미늄의 합금은 우수한 비강도 특성 때문에 항공 산업에 광범위하게 적용되고 있으며, 열 전도성, 반사성, 내식성, 가공성 등이 뛰어나 항공기 외의 방산부품, 자동차 등 군수용과 민수용으로 광범위한 수요가 있다. 알루미늄 합금은 전신용 합금과 주조용 합금으로 구분될 수 있으며, 각각은 열처리용 합금과 비열처리용 합금으로 분류된다. 전신용 합금은 압출(extrusion), 압연(rolling), 단조(forging) 등의 가공에 사용되며, 주 조용 합금은 사형 주조(sand casting), 다이캐스팅(die casting) 등에 사용된다. 알루미늄 합금 소재에 아노다이징을 하면 수 나노미터 사이즈의 직경을 가지는 산화피막(Al2O3)이 균일하게 수 십 마이크로 미터까지 성장하게 되며, 생성된 산화 피막의 경도가 높아 알루미늄의 내마모성을 향상시킬 수 있 다. 전신용 알루미늄 합금에 있어서, 항공기용 재료로서 사용되는 알루미늄 7xxx 계열 합금(예를 들어, Al-Zn계)은"}
{"patent_id": "10-2017-0029503", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "350MPa 이상의 높은 강도로 다양한 구조재료 분야로의 응용이 확대되고 있다. 발명의 내용"}
{"patent_id": "10-2017-0029503", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "스마트 폰 또는 노트북 등의 전자 장치의 대형화, 박형화, 휴대성이 강조됨에 따라 다른 알루미늄 합금계에 비 해 높은 비강도를 가진 알루미늄 7xxx 계열 합금을 전자 장치 외장재에 적용하고자 하는 시도가 이루어지고 있 다. 그러나 이러한 높은 기계적 특성에도 불구하고, 알루미늄 7xxx 계열 합금은 다른 합금계에 비해 낮은 내식성 및 표면처리 특성으로 인해 그 적용에 한계를 가지고 있다. 예를 들면, 순도가 낮아진 알루미늄(Al)을 사용하면서, 아노다이징 처리 시 산화 피막이 불균일하게 성장하거나 높은 첨가 원소의 영향으로 변색이나 얼룩이 발생할 수 있다. 이에 따라, 금속 질감이 균일하게 나타나지 않고, 만족할만한 색상의 구현이 어려워지므로, 전자 장치의 외장재로의 적용하는데 어려움이 있다. 본 발명의 다양한 실시예에 따른 알루미늄 클래드 판재와 그 제조방법은, 7xxx계 알루미늄 합금의 아노다이징 처리시 우수한 아노다이징 특성을 갖는 알루미늄 합금을 피복재로하여 알루미늄 다층 클래드 판재를 제조하고자 한다. 본 발명의 다양한 실시예에 따른 알루미늄 클래드 판재와 그 제조방법은, 클래드 판재의 높은 강도를 위해 심재 영역은 알루미늄 7xxx 계열 합금을 사용하고, 피복재 영역은 아노다이징 특성이 우수한 알루미늄 1xxx계열 합금 이나, 아노다이징이 가능하면서도 높은 강도를 가지는 알루미늄 6xxx계열 합금을 사용하고자 한다. 본 발명의 다양한 실시예에 따른 알루미늄 클래드 판재와 그 제조방법은, 클래드 판재 접합 후 열처리를 통하여 접합 강도를 향상시키고, 강도 저하 없이 시효 경화 시켜, 표면 특성과 기계적 특성이 우수한 클래드 판재를 제 조하고자 한다."}
{"patent_id": "10-2017-0029503", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명 다양한 실시예에 따른 아노다이징이 가능한 알루미늄 클래드 판재는, 알루미늄 7xxx 계열 합금을 포함 하는 심재; 및 상기 심재의 일면 또는 양면에 배치되고, 알루미늄 6xxx 계열 합금 또는 알루미늄 1xxx 계열 합 금을 포함하는 피복재;를 포함하며, 상기 알루미늄 7xxx 계열 합금은, 아연(Zn) 4.0 ~ 8.0 중량 %, 마그네슘(Mg)는 1.0 ~ 3.0 중량 % 및 나머지는 알루미늄(Al)과 불가피한 적어도 하나의 불순물을 포함할 수 있다. 본 발명 다양한 실시예에 따른 아노다이징이 가능한 알루미늄 클래드 판재 제조 방법은, 알루미늄 7xxx 계열 합 금, 알루미늄 6xxx 계열 합금 또는 알루미늄 1xxx 계열 합금을 마련하는 공정; 심재로 상기 알루미늄 7xxx 계열 합금을 배치하고, 상기 심재 영역의 일면 또는 양면에 피복재로 상기 알루미늄 6xxx 계열 합금 또는 상기 알루 미늄 1xxx 계열 합금을 적층하는 공정; 상기 적층된 판재를 480도 내지 520도에서 가열하여 연화시키고, 압연 접합을 수행하는 공정; 상기 연화된 판재를 단조 및 성형하는 공정; 520도 내지 540도에서 30분 이상 가열한 후 수냉하는 용체화 처리 공정; 및 상기 용체화 처리된 판재를 80 내지 180 도에서 8시간 이상 가열한 후 공냉시키 는 시효 경화 처리 공정;을 포함할 수 있다."}
{"patent_id": "10-2017-0029503", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 다양한 실시예에 따른, 알루미늄 클래드 판재와 그 제조방법은 클래드 판재의 높은 강도를 위해 심재 영역은 알루미늄 7xxx 계열 합금을 사용하고, 피복재 영역은 아노다이징 특성이 우수한 알루미늄 1xxx계열 합금 이나, 아노다이징이 가능하면서도 높은 강도를 가지는 알루미늄 6xxx 계열 합금을 사용하고자 한다. 이에 따라, 400 MPa 이상의 높은 항복 강도를 가지면서도 표면 아노다이징 특성이 우수한 알루미늄 클래드 판재를 제조할 수 있다. 본 발명의 다양한 실시예에 따른, 알루미늄 클래드 판재와 그 제조방법은 클래드 판재 제조 후 열처리를 통하여 접합 강도를 향상시키고, 강도 저하 없이 시효 경화 시켜, 표면 특성과 기계적 특성이 우수한 클래드 판재를 제 조할 수 있다."}
{"patent_id": "10-2017-0029503", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 다양한 실시예들이 첨부된 도면을 참조하여 기재된다. 실시예 및 이에 사용된 용어들은 본 발 명에 기재된 기술을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 및 /또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유사 한 참조 부호가 사용될 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 본 발명에서, \"A 또는 B\" 또는 \"A 및/또는 B 중 적어도 하나\" 등의 표현은 함께 나열된 항목들의 모든 가능한 조합을 포함할 수 있다. \"제 1,\" \"제 2,\" \"첫째,\" 또는 \"둘째,\"등의 표현들은 해당 구성요소들을, 순서 또는 중요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구성요 소들을 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에 \"(기능적으로 또는 통신적으로) 연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 상기 어떤 구성요소가 상기 다른 구성요소 에 직접적으로 연결되거나, 다른 구성요소(예: 제 3 구성요소)를 통하여 연결될 수 있다. 본 발명에서, \"~하도록 구성된(또는 설정된)(configured to)\"은 상황에 따라, 예를 들면, 하드웨어적 또는 소프 트웨어적으로 \"~에 적합한,\" \"~하는 능력을 가지는,\" \"~하도록 변경된,\" \"~하도록 만들어진,\" \"~를 할 수 있 는,\" 또는 \"~하도록 설계된\"과 상호 호환적으로(interchangeably) 사용될 수 있다. 어떤 상황에서는, \"~하도록 구성된 장치\"라는 표현은, 그 장치가 다른 장치 또는 부품들과 함께 \"~할 수 있는\" 것을 의미할 수 있다. 예를 들면, 문구 \"A, B, 및 C를 수행하도록 구성된(또는 설정된) 프로세서\"는 해당 동작을 수행하기 위한 전용 프로 세서(예: 임베디드 프로세서), 또는 메모리 장치에 저장된 하나 이상의 소프트웨어 프로그램들을 실행함으로써, 해당 동작들을 수행할 수 있는 범용 프로세서(예: CPU 또는 application processor)를 의미할 수 있다. 본 발명의 다양한 실시예들에 따른 알루미늄 합금을 이용한 다층 클래드 판재는 전자 장치의 케이스 프레임, 베 젤 등에 적용될 수 있다. 본 발명의 다양한 실시예들에 따른 전자 장치는, 예를 들면, 스마트폰, 태블릿 PC, 이동 전화기, 영상 전화기, 전자책 리더기, 데스크탑 PC, 랩탑 PC, 넷북 컴퓨터, 워크스테이션, 서버, PDA, PMP(portable multimedia player), MP3 플레이어, 의료기기, 카메라, 또는 웨어러블 장치 중 적어도 하나를 포함할 수 있다. 웨어러블 장 치는 액세서리형(예: 시계, 반지, 팔찌, 발찌, 목걸이, 안경, 콘택트 렌즈, 또는 머리 착용형 장치(head- mounted-device(HMD)), 직물 또는 의류 일체형(예: 전자 의복), 신체 부착형(예: 스킨 패드 또는 문신), 또는 생체 이식형 회로 중 적어도 하나를 포함할 수 있다. 어떤 실시예들에서, 전자 장치는, 예를 들면, 텔레비전, DVD(digital video disk) 플레이어, 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스, 홈 오토매이션 컨트롤 패널, 보안 컨트롤 패널, 미디어 박스(예: 삼성 HomeSyncTM, 애플TVTM, 또는 구글 TVTM), 게임 콘솔(예: XboxTM, PlayStationTM), 전자 사전, 전자 키, 캠코더, 또는 전자 액자 중 적어도 하 나를 포함할 수 있다.다른 실시예에서, 전자 장치는, 각종 의료기기(예: 각종 휴대용 의료측정기기(혈당 측정기, 심박 측정기, 혈압 측정기, 또는 체온 측정기 등), MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 또는 초음파기 등), 네비게이션 장치, 위성 항법 시스템(GNSS(global navigation satellite system)), EDR(event data recorder), FDR(flight data recorder), 자동차 인포테인먼 트 장치, 선박용 전자 장비(예: 선박용 항법 장치, 자이로 콤파스 등), 항공 전자기기(avionics), 보안 기기, 차량용 헤드 유닛(head unit), 산업용 또는 가정용 로봇, 드론(drone), 금융 기관의 ATM, 상점의 POS(point of sales), 또는 사물 인터넷 장치 (예: 전구, 각종 센서, 스프링클러 장치, 화재 경보기, 온도조절기, 가로등, 토 스터, 운동기구, 온수탱크, 히터, 보일러 등) 중 적어도 하나를 포함할 수 있다. 어떤 실시예에 따르면, 전자 장치는 가구, 건물/구조물 또는 자동차의 일부, 전자 보드(electronic board), 전자 사인 수신 장치(electronic signature receiving device), 프로젝터, 또는 각종 계측 기기(예: 수도, 전기, 가스, 또는 전파 계측 기기 등) 중 적어도 하나를 포함할 수 있다. 다양한 실시예에서, 전자 장치는 플렉서블하거나, 또는 전술한 다양한 장치들 중 둘 이상의 조합일 수 있다. 본 발명의 실시예에 따른 전자 장치는 전술한 기기들에 한정되지 않는다. 본 발명에서, 제조자라는 용어는 전자 장치 또는 클래드 판재를 제조하는 사람 또는 전자 장치 또는 클래드 판 재를 제조하는 장치(예: 인공지능 전자 장치)를 지칭할 수 있다. 본 발명의 다양한 실시예에 따른, 알루미늄 합금(Al alloy)을 이용한 전신용 합금(예를 들어, 주물(외장재))은 금형의 성형 공간에 따라 다양한 형태의 외면을 가질 수 있다. 예를 들어, 아노다이징(양극 산화 피막처리)에 의한 표면 처리에 의하여 제작된 주물의 외면은 치밀한 산화물로 우수한 내식성 및 내마모성과 다양한 색상으로 착색된 장식성 외관을 가질 수 있다. 본 발명은, 다양한 실시예에 따른 아노다이징이 가능한 알루미늄 클래드 판재의 조성 재료 및 그 조성비를 제공 한다. 또 다른 예로, 아노다이징이 가능한 알루미늄 클래드 판재의 제조 방법을 제공한다. 상기 클래드 판재는 접합 및 열처리를 통하여 접합 강도를 향상시키고, 강도 저하 없이 시효 경화 시켜, 표면 특성과 기계적 특성이 우수한 클래드 판재를 가질 수 있다. 본 발명의 일 실시예 따른 알루미늄 합금은, 휴대용 전자기기에 제공되는 두께가 얇고 고강도를 갖춰야 하는 내 외장재를 위한 부품으로 사용될 수 있다. 예를 들어, 상기 휴대용 전자기기에 제공되는 전자장치는, 디스플레이 장치를 포함한 전자 장치일 수 있다. 더욱이, 본 발명의 일 실시예에 따른 알루미늄 합금을 가지고 아노다이징 처리를 통해 만들어진 제품은, 다양한 색상 처리 및 양호한 후처리성 가지고 있어 도금, 도장 등의 용이한 표면 처리를 제공할 수 있다. 도 1은 본 발명의 다양한 실시예에 따른, 알루미늄 합금을 이용한 다층 클래드 판재의 측면 영역을 도시한 단면도이다. 도 2는 본 발명의 다양한 실시예에 따른, 도 1의 알루미늄 다층 클래드 판재의 단면의 사진을 도시하였다. 도 1 및 도 2를 참고하면, 알루미늄 합금을 이용한 다층 클래드 판재은, 알루미늄 7xxx 계열 합금이 심재 영역에 배치되고 알루미늄 6xxx 계열 합금 또는 알루미늄 1xxx 계열 합금(알루미늄 순도 99% 이 상의 합금)이 피복재 영역에 배치될 수 있다. 상기 알루미늄 7xxx 계열 합금의 심재와 상기 알루미늄 6xxx 계열 합금 또는 알루미늄 1xxx 계열 합금의 피복재로 구성된 판재는 아노다이징(anodizing)이 처리하 여 우수한 표면 특성을 가진 클래드 판재를 제조할 수 있다. 하기 [표 1] 은, 다양한 실시예에 따른 알루미늄 클래드 판재에 사용되는 알루미늄 합금의 조성 비율을 제 공한다.표 1"}
{"patent_id": "10-2017-0029503", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "다양한 실시예에 따른, 상기 알루미늄 클래드 판재의 심재 영역에 사용되는 상기 알루미늄 7xxx 계열 합금 은, 알루미늄 합금 가운데 가장 높은 강도(예를 들어, 450MPa 이상)를 가지며, 용접 후 열의 영향을 받는 부분도 자연시효에 의해 모재에 가까운 강도를 회복하기 때문에 뛰어난 조인트 효율을 얻을 수 있다. 상기 [표 1]을 참조하면, 다양한 실시예에 따른 상기 심재 영역에 사용되는 상기 알루미늄 7xxx 계열 합금(11 0)은, 알루미늄(Al), 아연(Zn), 마그네슘(Mg)을 포함하며 구성된, Al-Zn-Mg 계 합금일 수 있다. 예를 들어, 상 기 알루미늄 7xxx 계열 합금은 강도가 매우 강한 Al를 사용할 수 있다. 다양한 실시예에 따른, 상기 알루미늄 7xxx 계열 합금의 조성비를 살펴보면, 알루미늄(Al)은 총 중량 대비 87.5 ~ 91.5 %, 아연(Zn)은 총 중량 대비 4.0 ~ 8.0 %, 마그네슘(Mg)은 총 중량 대비 1.0 ~ 3.0 % 로 조성되고, 기타 불가피한 적어도 하나의 불순물을 포함할 수 있다. 상기 적어도 하나의 불순물은 실리콘(Si), 철(Fe), 구리(Cu), 망간(Mn), 크롬(Cr), 티타늄(Ti) 중 적어도 하나를 포함하여 구성될 수 있다. 예를 들어, 상 기 불순물은 미량으로 포함되어 있으며, 상기 실리콘(Si)은 0.40 이하의 중량%, 상기 철(Fe)은 0.50 이하의 중 량%, 상기 구리(Cu)는 1.2 ~ 2.0 중량%, 상기 망간(Mn)은 0.30 이하의 중량%, 상기 크롬(Cr)은 0.18 ~ 0.28 중 량% 및 상기 티타늄(Ti)은 0.20 이하의 중량%을 함유할 수 있다. 본 발명의 다양한 실시예에 따른, 상기 알루미늄 7xxx 계열 합금은 항복 강도가 적어도 400MPa를 가지는 합금을 사용할 수 있다. 또 다른 예로, 알루미늄 다층 클래드 판재의 고강도를 달성하기 위해 시효경화 시 MgZn2상이 석출될 수 있도록 전술한 아연(Zn) 및 마그네슘(Mg)이 포함된 Al-Zn-Mg계 합금을 사용할 수 있다. 일 실시예에 따른, 상기 마그네슘(Mg)은 내식성, 강도 및 연신율을 향상시키고, 경량화와 피삭성을 향상시키는데 기여할 수 있다. 또 다른 예로, 알루미늄 다층 클래드 판재의 고강도를 달성하기 위해 구리(Cu) 1.0 ~ 2.0 중량%가 첨가된 Al-Zn-Mg-Cu계 합금을 사용할 수 있다. 다양한 실시예에 따른, 상기 알루미늄 다층 클래드 판재의 피복재 영역에 사용되는 상기 알루미늄 6xxx 계 열 합금은 알루미늄 합금 가운데 중간 정도의 강도를 가지며, 내식성 및 용접성이 우수하고 열처리를 통해 양호한 냉간 가공성을 가질 수 있다. 또한 합금 종류에 따라 아노다이징 및 압출 가공성이 우수한 성질을 가지 고 있다. 상기 [표 1]을 참조하면, 다양한 실시예에 따른 피복재 영역에 사용되는 상기 알루미늄 6xxx 계열 합금은, 알루미늄(Al), 실리콘(Si), 마그네슘(Mg)을 포함하며 구성된, Al-Mg-Si 계 합금일 수 있다. 다양한 실시예에 따른, 상기 알루미늄 6xxx 계열 합금의 조성비를 살펴보면, 알루미늄(Al)은 총 중량 대비 97.25 ~ 98.21 %, 실리콘(Si)은 총 중량 대비 0.4 ~ 1.4 %, 마그네슘(Mg)은 총 중량 대비 0.6 ~ 1.3 % 로 조성 되고, 기타 불가피한 적어도 하나의 불순물을 포함할 수 있다. 상기 적어도 하나의 불순물은 철(Fe), 구리(Cu), 망간(Mn), 크롬(Cr), 아연(Zn), 티타늄(Ti) 중 적어도 하나를 포함하여 구성될 수 있다. 예를 들어, 상기 불순 물은 미량으로 포함되어 있으며, 상기 철(Fe)은 0.70 이하의 중량%, 상기 구리(Cu)는 0.15 ~ 0.40 중량%, 상기 망간(Mn)은 0.15 이하의 중량%, 상기 크롬(Cr)은 0.04 ~ 0.35 중량%, 상기 아연(Zn)은 0.25 이하의 중량% 및 상기 티타늄(Ti)은 0.15 이하의 중량%을 함유할 수 있다.본 발명의 다양한 실시예에 따른, 상기 알루미늄 6xxx 계열 합금은 항복 강도가 적어도 250MPa를 가지는 Al 6061 합금을 사용할 수 있다. 또 다른 예로, 아노다이징 처리를 하기 위해서, 구리(Cu)가 1 중량% 이하가 포 함된 Al-Mg-Si 계 합금을 사용할 수 있다. 다양한 실시예에 따른, 상기 알루미늄 다층 클래드 판재의 피복재 영역은 상기 알루미늄 6xxx 계열 합금 외에 알루미늄 1xxx 계열 합금이 사용될 수 있다. 상기 피복재 영역에 사용되는 상기 알루미늄 1xxx 계열 합금은 99% 이상의 알루미늄을 함유하는 순수 알루미늄 합금으로, 주요한 불순물은 철(Fe), 실리콘 (Si)을 포함하며, 상기 불순물이 적어짐에 따라 내식성이 향상되고 유리한 표면 처리가 가능한 특성을 가지고 있다. 다양한 실시예에 따른, 상기 알루미늄 1xxx 계열 합금은 고온에서 접합성이 높다. 예를 들면, 알루미늄 (Al)의 순도가 높아 롤 접합(rolling )이 용이하고, 아노다이징 특성이 우수하다. 상기 알루미늄 1xxx 계열 합 금은 시효경화가 발생하지 않고, 자체강도가 낮기 때문에 전체 판재의 두께에서 상기 알루미늄 6xxx 계열 합금보다 상대적으로 작은 두께로 제조될 수 있다. 본 발명의 다양한 실시예에 따른, 알루미늄 합금을 이용한 다층 클래드 판재는 심재 영역의 두께가 전체 클래드 판재의 50 내지 90% 일 수 있다. 예를 들어, 상기 알루미늄 클래드 판재를 구성하는 알루미늄 합금이 심재 영역에 7xxx계 계열 합금 , 피복재 영역에 6xxx계 계열 합금을 사용하는 경우, 상기 7xxx계 계열 합금은 전체 클래드 판재의 50 내지 90%의 두께를 가지고 상기 6xxx계 계열 합금은 전체 클래드 판재의 10 내지 50%의 두께로 제조될 수 있다. 또 다른 예로, 상기 알루미늄 클래드 판재를 구성하는 알루미늄 합금이 심재 영역에 7xxx계 계열 합금 , 피복재 영역에 1xxx계 계열 합금을 사용하는 경우, 상기 7xxx계 계열 합금은 전체 클래드 판재의 80% 이상의 두께를 가지고 상기 1xxx계 계열 합금은 전체 클래드 판재의 20% 이 하의 두께로 제조될 수 있다. 상기 1xxx계 계열 합금은 시효 경화가 발생하지 않고 자체 강도가 매우 낮아 상기 6xxx계 계열 합금보다 상대적으로 적은 두께로 구성될 수 있다. 본 발명의 다양한 실시예에 따른, 상기 알루미늄 합금을 이용한 다층 클래드 판재 는 압연 후 열처리가 수 행된 것일 수 있다. 일 실시예에 따른, 상기 압연은 상온에서 40 내지 60 %의 압하율로 수행될 수 있으며, 상기 압연이 40 % 미만의 압하율로 수행되는 경우에는 접합하고자 하는 판재 사이의 원자 접근이 어렵기 때문에 클래 트 판재의 접합력이 낮아질 수 있으며, 상기 압연이 60% 를 초과하는 압하율로 수행되는 경우에는 너무 높은 압 하율로 인해 판재들의 압연 자체가 불가능하거나 압연 도중 판재의 균열이 발생할 수 있다. 예를 들어, 상기 알루미늄 클래드 판재를 구성하는 알루미늄 합금이 심재 영역에 7xxx계 계열 합금, 피복재 영역에 6xxx계 계열 합금을 사용하는 경우, 압하율은 40% 이상으로 수행될 수 있다. 또 한 예로, 상기 알루미늄 클래드 판재를 구성하는 알루미늄 합금이 심재 영역에 7xxx계 계열 합금, 피복재 영역에 1xxx계 계열 합금을 사용하는 경우, 압하율은 20 내지 30%까지 수행한 경우에도 압연 접합이 이루어질 수 있다. 상기 1xxx계 계열 합금은 자체 강도가 매우 낮아 상기 6xxx계 계열 합금보다 상대적으로 높은 압하율을 달성하 여 압연 접합이 이루어질 수 있다. 본 발명의 일 실시예에 따른, 알루미늄 합금 클래드 판재는 알루미늄 7xxx 계열 합금을 심재로, 알루 미늄 6xxx 계열 합금 또는 알루미늄 1xxx 계열 합금을 피복재로 한 다층 구조를 구현함에 따라, 두 가지 합금의 장점을 모두 제공할 수 있다. 또 한 예로, 최적의 심재 및 피복재의 두께 비율을 조절하여 높은 항 복강도 및 연신율을 가지며, 표면 처리가 우수한 판재를 제조할 수 있다. 도 3은 본 발명의 다양한 실시예에 따른, 알루미늄 합금을 이용한 다층(3층 구조) 클래드 판재의 측면 영 역을 도시한 단면도이다. 도 3의 알루미늄 클래드 판재의 구조는 도 1 및 도 2의 클래드 판재 구조와 일부 또는 전부가 동일할 수 있다.다양한 실시예에 따른, 알루미늄 합금을 이용한 다층 클래드 판재은, 알루미늄 7xxx 계열 합금이 심 재 영역에 배치되고 알루미늄 6xxx 계열 합금 또는 알루미늄 1xxx 계열 합금(알루미늄 순도 99% 이상 의 합금)이 피복재 영역에 배치될 수 있다. 도 3a를 참조하면, 상기 알루미늄 다층 클래드 판재의 심재 영역에 사용되는 상기 알루미늄 7xxx 계열 합 금은 알루미늄 합금 가운데 가장 높은 강도를 가지며, 알루미늄(Al), 아연(Zn), 마그네슘(Mg)을 포함하며 구성된, Al-Zn-Mg 계 합금일 수 있다. 다양한 실시예에 따른, 상기 알루미늄 다층 클래드 판재의 피복재 영역에 사용되는 상기 알루미늄 6xxx 계열 합금은 알루미늄 합금 가운데 중간 정도의 강도를 가지며, 알루 미늄(Al), 마그네슘(Mg), 실리콘(Si)을 포함하여 구성된, Al-Mg-Si 계 합금일 수 있다. 다양한 실시예에 따른, 상기 알루미늄 다층 클래드 판재는 상기 알루미늄 7xxx 계열 합금의 전면에 상기 알루미늄 6xxx 계열 합금이 배치되고, 상기 알루미늄 7xxx 계열 합금의 후면에 상기 알루미늄 6xxx 계열 합금이 배치될 수 있다. 총 세 개의 알루미늄 합금으로 구성되며, 외면 영역에 표면 처리가 우 수한 상기 알루미늄 6xxx 계열 합금이 배치되어, 외장재로서 유용한 판재를 제공할 수 있다. 이하 구체적 인 내용은, 도 1 및 도 2의 설명을 준용한다. 도 3b를 참조하면, 상기 알루미늄 다층 클래드 판재의 심재 영역에 사용되는 상기 알루미늄 7xxx 계열 합 금은 알루미늄 합금 가운데 가장 높은 강도를 가지며, 알루미늄(Al), 아연(Zn), 마그네슘(Mg)을 포함하며 구성된, Al-Zn-Mg 계 합금일 수 있다. 다양한 실시예에 따른, 상기 알루미늄 다층 클래드 판재의 피복재 영역에 사용되는 상기 알루미늄 1xxx 계열 합금은 99% 이상의 알루미늄을 함유하는 순수 알루미늄 합금일 수 있다. 다양한 실시예에 따른, 상기 알루미늄 다층 클래드 판재는 상기 알루미늄 7xxx 계열 합금의 전면에 상기 알루미늄 1xxx 계열 합금이 배치되고, 상기 알루미늄 7xxx 계열 합금의 후면에 상기 알루미늄 1xxx 계열 합금이 배치될 수 있다. 총 세 개의 알루미늄 합금으로 구성되며, 외면 영역에 표면 처리가 우 수한 상기 알루미늄 1xxx 계열 합금이 배치되어, 외장재로서 유용한 판재를 제공할 수 있다. 이하 구체적 인 내용은, 도 1 및 도 2의 설명을 준용한다. 도 4는 본 발명의 다양한 실시예에 따른, 알루미늄 합금을 이용한 다층(3층 구조) 클래드 판재의 측면 영 역을 도시한 단면도이다. 도 4의 알루미늄 클래드 판재의 구조는 도 1 및 도 2의 클래드 판재 구조와 일부 또는 전부가 동일할 수 있다. 다양한 실시예에 따른, 알루미늄 합금을 이용한 다층 클래드 판재은, 알루미늄 7xxx 계열 합금이 심 재 영역에 배치되고 알루미늄 6xxx 계열 합금 또는 알루미늄 1xxx 계열 합금(알루미늄 순도 99% 이상 의 합금)이 피복재 영역에 배치될 수 있다. 도 4를 참조하면, 상기 알루미늄 다층 클래드 판재는 상기 알루미늄 7xxx 계열 합금의 전면에 상기 알루미늄 6xxx 계열 합금이 배치되고, 상기 알루미늄 7xxx 계열 합금의 후면에 상기 알루미늄 1xxx 계열 합금이 배치될 수 있다. 총 세 개의 알루미늄 합금으로 구성되며, 외면 영역에 표면 처리가 우수한 상기 알루미늄 6xxx 계열 합금 또는 상기 알루미늄 1xxx 계열 합금이 배치되어, 외장재로서 유용한 판재를 제공할 수 있다. 이하 구체적인 내용은, 도 1 및 도 2의 설명을 준용한다. 도 5는 본 발명의 다양한 실시예에 따른, 알루미늄 합금을 이용한 클래드 판재 제조 방법에 관한 흐름도이다. 도 6은 본 발명의 다양한 실시예에 따른, 도 5의 클래드 판재 제조 방법의 공정 순서를 도시하였다. 도 5 및 도 6에 나타난 상기 알루미늄 클래드 판재의 알루미늄 7xxx 계열 합금, 알루미늄 6xxx 계열 합금, 알루미늄 1xxx 계열 합금은, 도 1 에 나타난 알루미늄 클래드 판재의 알루미늄 7xxx 계열 합금, 알루미늄 6xxx 계열 합금, 알루미늄 1xxx 계열 합금 구조와 일부 또는 전부가 동일할 수 있다. 도 1, 5 및 도 6를 참조하면, 공정 10에 따라, 복수 개의 층으로 구성된 알루미늄 클래드 판재에 사용될 알루미늄 7xxx 계열 합금, 알루미늄 6xxx 계열 합금, 알루미늄 1xxx 계열 합금을 마련할 수 있 다. 다양한 실시예에 따른, 상기 알루미늄 7xxx 계열 합금(예를 들어, Al-Zn-Mg계 합금)은 항복 강도가 400MPa 이상인 것으로 마련될 수 있으며, 상기 알루미늄 6xxx 계열 합금(예를 들어, Al-Mg-Si계 합금)은 항복 강도가 250MPa 이상인 것으로 마련될 수 있다. 다양한 실시예에 따른, 상기 알루미늄 7xxx 계열 합금의 조성비에서, 상기 알루미늄(Al)은 총 중량 대비 87.0 ~ 91.0 %, 상기 아연(Zn)은 총 중량 대비 5.1 ~ 6.1 %, 상기 마그네슘(Mg)는 총 중량 대비 2.1 ~ 2.9 % 로 조성되고, 기타 불가피한 적어도 하나의 불순물을 포함할 수 있다. 또 다른 예로, 상기 알루미늄 6xxx 계열 합금의 조성비에서, 상기 알루미늄(Al)은 총 중량 대비 97.25 ~ 98.21 %, 상기 실리콘(Si)은 총 중량 대비 0.40 ~ 0.80 %, 상기 마그네슘(Mg)은 총 중량 대비 0.8 ~ 1.2 % 로 조성되고, 기타 불가피한 적어도 하나의 불 순물을 포함할 수 있다. 이하 구체적인 내용은, 도 1 및 표 1을 인용한다. 상기 복수 개의 알루미늄 합금이 마련된 후에, 공정 20 및 도 6a에 따라, 알루미늄 클래드 판재의 심재 영 역과 피복재 영역을 형성하도록 상기 알루미늄 7xxx 계열 합금, 알루미늄 6xxx 계열 합금 및 또는 알 루미늄 1xxx 계열 합금을 적층할 수 있다. 다양한 실시예에 따라, 심재 영역에는 알루미늄 7xxx 계열 합금을 배치하고, 상기 심재 영역의 일면 또는 양면에는 알루미늄 6xxx 계열 합금 또는 알루미늄 1xxx 계열 합금을 적층할 수 있다. 예를 들어, 상 기 알루미늄 7xxx 계열 합금을 배치한 후에, 상기 알루미늄 7xxx 계열 합금 일면 또는 양면에 알루미 늄 6xxx 계열 합금을 적층할 수 있다. 또 다른 예로, 상기 알루미늄 7xxx 계열 합금을 배치한 후에, 상기 알루미늄 7xxx 계열 합금 일면 또는 양면에 알루미늄 1xxx 계열 합금을 적층할 수 있다. 또 다 른 예로, 상기 알루미늄 7xxx 계열 합금을 배치한 후에, 상기 알루미늄 7xxx 계열 합금의 전면을 향 하는 일면에 상기 알루미늄 6xxx 계열 합금을 배치하고, 상기 일면과 반대 방향을 향하는 타면에 상기 알 루미늄 1xxx 계열 합금을 적층할 수 있다. 본 발명의 일 실시예에 따르면, 2층 또는 3층의 판재 적층 방법을 설명하였으나, 이에 한정된 것은 아니고 심재 영역이 상기 알루미늄 7xxx 계열 합금이 배치된 상태에서 다양한 순서에 의해 상기 알루미늄 6xxx 계열 합 금, 알루미늄 1xxx 계열 합금을 배치하여 4 층 이상의 클래드 판재로 적층할 수 있다. 상기 복수 개의 알루미늄 합금이 적층된 후에, 공정 30 및 도 6b-d에 따라, 상기 적층된 판재를480도 내지 520 도에서 가열하여 연화시키고, 압연 접합 공정을 수행할 수 있다. 다양한 실시예에 따른, 상기 심재 영역으로부터 상기 알루미늄 7xxx 계열 합금 및 알루미늄 6xxx 계열 합 금이 적층된 판재는, 450도 내지 550도의 온도에서 0.5 내지 1.5시간 동안 가열하여 연화시키는 공정(공정 31, 도 6a)이 수행될 수 있다. 예를 들면, 상기 연화 공정(공정 31)은 적층된 판재를480도 내지 520도의 온도에 서 대략 1시간 동안 가열하여 연화시킬 수 있다. 상기 연화된 적층 판재는 열간 압연하여 압연 접합 공정(공정 33, 도 6b)이 수행될 수 있다. 상기 가열하여 연화시키는 공정(공정 31) 및 압연 접합 공정(공정 33)은 제조자 가 판재의 원하는 두께를 달성할 때까지 복수 회 반복할 수 있다. 일 실시예에 따른, 상기 가열, 연화시키는 공정(공정 31) 및 압연 접합 공정(공정 33)의 반복을 통하여, 상기 적층된 판재는 상온에서 40 내지 60 %의 압하율로 수행될 수 있다. 상기 압연이 40 % 미만의 압하율로 수행되는 경우에는 접합하고자 하는 판재 사이의 원자 접근이 어렵기 때문에 클래트 판재의 접합력이 낮아질 수 있으며, 상기 압연이 60% 를 초과하는 압하율로 수행되는 경우에는 너무 높은 압하율로 인해 판재들의 압연 자체가 불가 능하거나 압연 도중 판재의 균열이 발생할 수 있다. 일 실시예에 따른, 상기 알루미늄 클래드 판재를 구성하는 알루미늄 합금이 심재 영역에 7xxx 계열 합금 , 피복재 영역에 6xxx 계열 합금을 사용하는 경우, 압하율은 40% 이상으로 수행될 수 있다. 또 한 예 로, 상기 알루미늄 클래드 판재를 구성하는 알루미늄 합금이 심재 영역에 7xxx 계열 합금, 피복재 영 역에 1xxx 계열 합금을 사용하는 경우, 압하율은 20 내지 30%까지 수행한 경우에도 압연 접합이 이루어질 수 있다. 상기 1xxx 계열 합금은 자체 강도가 매우 낮아 상기 6xxx 계열 합금보다 상대적으로 높은 압하율을 달성하여 압연 접합이 이루어질 수 있다. 상기 가열, 연화시키는 공정(공정 31) 및 압연 접합 공정(공정 33)의 반복을 통하여 원하는 두께의 클래드 판재 를 제조한 후에는, 상기 클래드 판재의 계면간의 확산 접합이 충분히 일어날 수 있도록 압연 사이에 450도 내지 550도의 온도에서 10분 이상 가열하여 확산 접합과 연화가 일어나는 공정(공정 33, 도 6d)을 수행할 수 있다. 예를 들면, 상기 확산 및 연화 공정(공정 33)은 적층된 판재를480도 내지 520도의 온도에서 15분 이상가열하여 연화시킬 수 있다. 상기 소정의 압하율로 제조된 클래드 판재는, 공정 40 및 도 6e에 따라, 단조 및 성형하는 공정을 수행할 수 있다. 상기 단조 및 성형 공정(공정 40, 도 6e)은 적층된 판재를480도 내지 520도에서 가열하여 연화시켜 연 화된 상태의 판재에 공정을 수행할 수 있다. 일 실시예에 따른, 상기 단조 및 성형 공정(공정 40)은 클래드 판재의 적절한 형상을 만들기 위해 경우에 따라서 단조 성형 후 5분 이상 가열 및 재단조 및 재성형하는 공정(공정 41)을 수행할 수 있다. 상기 단조 및 성형 공정(공정 40) 및/또는 재단조 및 재성형 공정(공정 41)을 수행한 후에는, 열처리를 통해 강도를 향상시킬 수 있다. 상기 성형이 완료된 클래드 판재는, 공정 50 및 도 6f에 따라, 열처리 방법의 하나로 가열 및 수냉하는 용 체화 처리 공정을 수행할 수 있다. 상기 용체화 처리란, 고온에서 안정된 조직을 저온에서 그대로 유지시키는 공정으로, 예를 들어, 고온을 유지하 여 재료의 조질 상태를 고온 상태로 유지시킨 후, 순간적으로 급랭함으로써 고온에서 안정된 상을 저온에서 유 지하는 공정이다. 일 실시예에 따른, 상기 알루미늄 클래드 판재를 구성하는 알루미늄 합금은 심재 영역에 7xxx 계열 합금 , 피복재 영역에 6xxx 계열 합금을 사용하는 경우를 설명한다. 상기7xxx계열 합금과6xxx계열 합 금은 둘 다 석출 경화형(precipitation hardening) 합금이나 석출상의 종류가 달라 각 합금의 열처리 온도 및 시간이 다르므로, 상기 알루미늄 클래드 판재의 최적의 강도를 확보하기 위해서는 상기7xxx계열 합금 과6xxx계열 합금의 강도를 동시에 확보할 수 있는 열처리 조건을 확보해야 한다. 하기 [표 2]는 용체화 및 수냉 열처리(공정 50) 및 시효 경화 열처리(공정 60)를 수행한 복수의 실시예의 열처 리 조건을 실험한 예이다. 표 2 상기 [표 2]에 나타난 바와 같이, <실시예 1 내지 실시예 8>을 서로 다른 조건에서 실험하였다. <실시예 1 내지 실시예 4> 상기 실시예 1내지 4에서 제조된 알루미늄 합금 다층 클래드 판재를, 480도의 온도에서 4시간 동안 용체화 처리 및 수냉하였다. 이후 실시예 1 내지 실시예 4는 상이한 조건에 시효 경화 처리를 진행하였다. <실시예 5 내지 실시예 8> 상기 실시예 5내지 8에서 제조된 알루미늄 합금 다층 클래드 판재를, 520도의 온도에서 4시간 동안 용체화 처리 및 수냉하였다. 이후 실시예 5 내지 실시예 8은 상이한 조건에 시효 경화 처리를 진행하였다. 상기 용체화 공정이 완료된 클래드 판재는, 공정 60 및 도 6g에 따라, 열처리 방법의 하나로 시효 경화 처 리 공정을 수행할 수 있다. 상기 시효 경화란, 금속 재료가 일정한 시간 및 적당한 온도 하에서 단단해지는 공정으로, 본래의 불안정한 상 태에서 안정한 상태로 변화하는 과정이다. 상기 변화를 일으키기 위해선, 금속 결정 속 원자의 움직임이 있어야 하며, 상기 움직임이 상온에서 이루어지는 상온 시효 및 가열을 통하여 원자의 움직임을 유도하는 인공 시효가 있으며, 본 발명의 일 실시예에선 소정의 가열 조건으로 알루미늄 합금 클래드 판재를 제조할 수 있다. 일 실시예에 따른, 상기 알루미늄 다층 클래드 판재의 강도는 상이한 열처리 조건에 따라 강도와 연신율이 달라질 수 있다. 상기 [표 2]에 나타난 바와 같이, <실시예 1 내지 실시예 8>을 서로 다른 조건에서 실험하였다. <실시예 1> 상기 실시예 1는, 480도의 온도에서 4시간 동안 용체화 처리 및 수냉 처리된 알루미늄 합금 다층 클래드 판재 를, 120도의 온도에서 24시간 동안 시효 경화 처리를 수행하였다. 상기 처리 결과, 완료된 알루미늄 다층 클래드 판재의 항복 강도는 372MPa가 나타남을 확인할 수 있다. <실시예 2> 상기 실시예 2는, 480도의 온도에서 4시간 동안 용체화 처리 및 수냉 처리된 알루미늄 합금 다층 클래드 판재 를, 160도의 온도에서 18시간 동안 시효 경화 처리를 수행하였다. 상기 처리 결과, 완료된 알루미늄 다층 클래드 판재의 항복 강도는 373MPa가 나타남을 확인할 수 있다. <실시예 3> 상기 실시예 3은, 480도의 온도에서 4시간 동안 용체화 처리 및 수냉 처리된 알루미늄 합금 다층 클래드 판재 를, 180도의 온도에서 8시간 동안 시효 경화 처리를 수행하였다. 상기 처리 결과, 완료된 알루미늄 다층 클래드 판재의 항복 강도는 337MPa가 나타남을 확인할 수 있다. <실시예 4> 상기 실시예 4는, 480도의 온도에서 4시간 동안 용체화 처리 및 수냉 처리된 알루미늄 합금 다층 클래드 판재 를, 80도의 온도에서 16시간 동안 제 1 차 시효 경화 처리를 수행하였다. 상기 제 1 차 시효 경화 처리후, 150도의 온도에서 24시간 동안 제 2 차 시효 경화 처리를 수행하였다. 상기 처리 결과, 완료된 알루미늄 다층 클래드 판재의 항복 강도는 402MPa가 나타남을 확인할 수 있다.<실시예 5> 상기 실시예 5는, 520도의 온도에서 4시간 동안 용체화 처리 및 수냉 처리된 알루미늄 합금 다층 클래드 판재 를, 120도의 온도에서 24시간 동안 시효 경화 처리를 수행하였다. 상기 처리 결과, 완료된 알루미늄 다층 클래드 판재의 항복 강도는 393MPa가 나타남을 확인할 수 있다. <실시예 6> 상기 실시예 6은, 520도의 온도에서 4시간 동안 용체화 처리 및 수냉 처리된 알루미늄 합금 다층 클래드 판재 를, 160도의 온도에서 18시간 동안 시효 경화 처리를 수행하였다. 상기 처리 결과, 완료된 알루미늄 다층 클래드 판재의 항복 강도는 368MPa가 나타남을 확인할 수 있다. <실시예 7> 상기 실시예 7은, 520도의 온도에서 4시간 동안 용체화 처리 및 수냉 처리된 알루미늄 합금 다층 클래드 판재 를, 180도의 온도에서 8시간 동안 시효 경화 처리를 수행하였다. 상기 처리 결과, 완료된 알루미늄 다층 클래드 판재의 항복 강도는 333MPa가 나타남을 확인할 수 있다. <실시예 8> 상기 실시예 8은, 520도의 온도에서 4시간 동안 용체화 처리 및 수냉 처리된 알루미늄 합금 다층 클래드 판재 를, 80도의 온도에서 16시간 동안 제 1 차 시효 경화 처리를 수행하였다. 상기 제 1 차 시효 경화 처리후, 150도의 온도에서 24시간 동안 제 2 차 시효 경화 처리를 수행하였다. 상기 처리 결과, 완료된 알루미늄 다층 클래드 판재의 항복 강도는 410MPa가 나타남을 확인할 수 있다. 상기 [표 2]의 <비교예>는 상기 <실시예(1 내지 8)>과 다른 조건에서 비교 실험한 예이다. 상기 <비교예 1 내지 3>은 합금 다층 클래드 판재를, 520도의 온도에서 4시간 동안 용체화 처리 및 수냉하였다. 이후, 다양한 온도(예를 들어, 120도, 160도, 또는 180도)에서 서로 다른 시간(예를 들어, 12시간, 24시간, 18시간) 동안 시 효 경화 열처리를 진행하였다. 상기 비교예에 따른 실험 결과, 본 발명의 다양한 실시예에 따른 열처리로 제조 된 알루미늄 합금 다층 클래드 판재보다 항복 강도가 떨어지는 것을 확인할 수 있다. 일 예에 따르면 알루미늄 클래드 판재의 재료로서. 심재 영역은 높은 강도를 위해 7xxx계열 합금을 사용하고, 피복재 영역은 아노다이징이 가능하면서도 높은 강도를 가지는 6xxx계열 합금을 사용하였다. 또 한 예로, 상기 [표 2]에 따른 <실시예 1 내지 8>을 통한 알루미늄 클래드 판재 제조방법에 따라 열처리 공 정을 수행하면, 400 MPa 이상의 높은 항복 강도를 가지면서도 표면 아노다이징 특성이 알루미늄 클래드 판재 를 제조할 수 있다. 하기 [표 3]은 본 발명의 다양한 실시예에 따른, 알루미늄 합금 클래드 판재의 아노다이징 후 색차계를 분 석한 내용을 제공한다.표 3"}
{"patent_id": "10-2017-0029503", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "상기 [표 3]을 참조하면, 상기 실시예에 따른 알루미늄 합금 클래드 판재는 심재 영역을 알루미늄 7xxx 계 열 합금, 피복재 영역을 알루미늄 6xxx 계열 합금으로 구성하여, 비교예에 따른 알루미늄 7xxx 계열 합금을 단독으로 사용한 판재에 비하여 표면 처리가 우수한 클래드 판재를 제공할 수 있다. 예를 들어, 상기 알루미늄 7xxx 계열 합금만으로 구성되어 아노다이징 처리된 판재의 색차계 분석 값을 살 펴보면, L 값이 86.16, a 값이 -0.14, b 값이 2.43을 나타냄을 확인할 수 있다. 이에 반하여, 본 발명의 일 실 시예에 따른, 피복재 영역이 알루미늄 6xxx 계열 합금을 포함한 클래드 판재의 색차계 분석 값을 살 펴보면, L 값이 86.05, a 값이 -0.32, b 값이 5.80을 나타냄을 확인할 수 있다. 여기서, 상기 L 값은 명도(밝기)를 나타내며, a 값은 (+)값이 클수록 빨강, (-)값이 클수록 녹색을 나타내고, b 값은 (+)값이 클수록 노랑, (-)값이 클수록 파랑을 나타낸다. 상기 알루미늄 7xxx 계열 합금만으로 구성되어 아노다이징 처리된 판재는 본 발명의 일 실시예와 비교하여, a 및 b 값이 상대적으로 크게 나타나며, 이는 아노다이징 후 황변의 발생으로 착색성 저하를 나타낼 수 있다. 본 발명의 일 실시예에 따른 피복재 영역이 알루미늄 6xxx 계열 합금을 포함한 클래드 판재(10 0)는 우수한 표면 처리를 유지하면서, 심재 영역에 알루미늄 7xxx 계열 합금을 배치하여 높은 항복 강도를 유지할 수 있다. 도 7은 본 발명의 다양한 실시예에 알루미늄 합금으로 구성된 하우징를 포함하는 전자 장치를 나타내 는 분리 사시도이다. 도 7을 참조하면, 본 발명의 다양한 실시예에 따른 전자 장치는, 제 1 방향(-Y)을 향하는 전면 커버 및 상기 전면 커버의 반대인 제 2 방향(+Y)을 향하는 후면 커버를 포함하는 하우징을 포함할 수 있다. 상기 하우징은 상기 전면 커버의 적어도 일부를 형성하는 투명 영역을 포함할 수 있다, 일 실시예에 따른 전자 장치는 상기 하우징 내에 배치되고, 상기 전면 커버를 통하여 노출된 화면 영역을 포 함하는 디스플레이 장치를 포함할 수 있다. 상기 하우징은 아노다이징이 가능한 알루미늄 합금으로 구성되며, 상기 알루미늄 합금은 알루미늄 전술된 7xxx 계열 합금을 포함하는 심재 및 상기 심재의 일면 또는 양면에 배치되고, 알루미늄 6xxx 계열 합금 또는 알루미늄 1xxx 계열 합금을 포함하는 피복재로 구성될 수 있다. 다양한 실시예에 따르면, 상기 하우징은 각종 전자 부품 등을 수용하기 위한 것으로서, 적어도 일부분이 도전성 재질로 이루어질 수 있다. 예컨대, 상기 하우징은 상기 전자 장치의 외측면을 형성하는 측벽 들을 포함할 수 있다. 또는, 상기 하우징은 상기 전자 장치의 외관으로 드러나는 부분은 도전성 재질 이 포함될 수 있다. 상기 하우징의 내부로는 인쇄회로기판 및/또는 배터리가 수용될 수 있다. 예를 들어, 상기 인쇄회로기판에는 프로세서, 통신 모듈, 각종 인터페이스, 전력 관리 모듈, 또는 제어 회 로는 집적회로 칩 형태로 구성되어 상기 인쇄회로기판에 장착될 수 있다. 예를 들어, 상기 제어 회로는 상 술한 프로세서 또는 통신 모듈의 일부일 수 있다. 다양한 실시예에 따르면, 디스플레이 장치는 적어도 부분적으로 무선 전파 또는 자기장을 투과하는 물질로 제작될 수 있다. 예를 들어, 상기 디스플레이 장치는, 강화 유리 재질의 윈도우 부재와, 상기 윈도우 부재 의 내측면에 장착되는 디스플레이 패널을 포함할 수 있다. 상기 윈도우 부재와 디스플레이 장치 사이에는 터치패널이 탑재될 수 있다. 예컨대, 상기 디스플레이 장치는 화면을 출력하는 출력 장치이면서, 터치 스크린 기능이 탑재된 입력 장치로 활용될 수 있다. 상기 전술된 바와 같이, 본 발명 다양한 실시예에 따른 아노다이징이 가능한 알루미늄 클래드 판재는, 알루미늄 7xxx 계열 합금을 포함하는 심재; 및 상기 심재의 일면 또는 양면에 배치되고, 알루미늄 6xxx 계열 합금 또는 알루미늄 1xxx 계열 합금을 포함하는 피복재;를 포함하며, 상기 알루미늄 7xxx 계열 합금은, 아연(Zn) 4.0 ~ 8.0 중량 %, 마그네슘(Mg)는 1.0 ~ 3.0 중량 % 및 나머지는 알루미늄(Al)과 불가피한 적어도 하나의 불순물을 포함할 수 있다. 다양한 실시예에 따르면, 상기 알루미늄 6xxx 계열 합금은, 실리콘(Si) 0.4 ~ 1.4 중량 %, 마그네슘(Mg) 0.6 ~ 1.3 중량 % 및 나머지는 알루미늄(Al)과 불가피한 적어도 하나의 불순물을 포함할 수 있다. 다양한 실시예에 따르면, 상기 알루미늄 클래드 판재는 열처리에 의해, 330 ~ 450MPa의 항복 강도의 특성을 나 타낼 수 있다. 다양한 실시예에 따르면, 상기 알루미늄 7xxx 계열 합금의 상기 적어도 하나의 불순물은 실리콘(Si), 철(Fe), 구리(Cu), 망간(Mn), 크롬(Cr), 티타늄(Ti) 중 적어도 하나이며, 상기 알루미늄 클래드 판재에서 상기 구리(C u)는 총 중량 대비 1.0 ~ 2.0 % 를 포함하도록 조성될 수 있다. 다양한 실시예에 따르면, 상기 알루미늄 6xxx 계열 합금의 상기 적어도 하나의 불순물은 철(Fe), 구리(Cu), 망 간(Mn), 크롬(Cr), 아연(Zn), 티타늄(Ti) 중 적어도 하나이며, 상기 구리(Cu)가 총 중량 대비 1.0 % 이하를 포 함하도록 조성될 수 있다. 다양한 실시예에 따르면, 상기 피복재로 상기 알루미늄 6xxx 계열 합금을 접합하고, 상기 알루미늄 6xxx 계열 합금은 상기 알루미늄 클래드 판재의 전체 두께 10 ~ 50% 범위로 구성될 수 있다. 다양한 실시예에 따르면, 상기 피복재로 상기 알루미늄 1xxx 계열 합금을 접합하고, 상기 알루미늄 1xxx 계열 합금은 상기 알루미늄 클래드 판재의 전체 두께의 20% 이하로 구성될 수 있다. 다양한 실시예에 따르면, 상기 알루미늄 클래드 판재는 적어도 450MPa의 강도를 가지는 상기 알루미늄 7xxx 계 열 합금에, 적어도 250MPa의 강도를 가지는 상기 알루미늄 6xxx 계열 합금을 적층하고, 상기 적층된 판재는 40 ~ 60%의 압하율로 열간 압연할 수 있다. 다양한 실시예에 따르면, 상기 알루미늄 클래드 판재는 적어도 450MPa의 강도를 가지는 상기 알루미늄 7xxx 계 열 합금에 상기 알루미늄 1xxx 계열 합금을 적층하고, 상기 적층된 판재는 20 ~ 20%의 압하율로 열간 압연할 수 있다. 다양한 실시예에 따르면, 상기 알루미늄 클래드 판재는 적어도 450MPa의 강도를 가지는 상기 알루미늄 7xxx 계 열 합금의 전면에는 적어도 250MPa상기 알루미늄 6xxx 계열 합금을 적층하고, 상기 알루미늄 7xxx 계열 합금의 후면에는 상기 알루미늄 1xxx 계열 합금을 적층할 수 있다. 다양한 실시예에 따른, 알루미늄 합금으로 구성된 외장재를 포함하는 전자 장치는, 제 1 방향을 향하는 전면 커 버 및 상기 전면 커버의 반대인 제 2 방향을 향하는 후면 커버를 포함하는 하우징으로서, 상기 하우징은 상기 전면 커버의 적어도 일부를 형성하는 투명 영역을 포함하는 하우징; 상기 하우징 내에 배치되고, 상기 전면 커 버를 통하여 노출된 화면 영역을 포함하는 디스플레이 장치를 포함하고, 상기 하우징은, 알루미늄 7xxx 계열 합금을 포함하는 심재; 및 상기 심재의 일면 또는 양면에 배치되고, 알루미늄 6xxx 계열 합 금 또는 알루미늄 1xxx 계열 합금을 포함하는 피복재;를 포함하며, 상기 알루미늄 7xxx 계열 합금은, 아연(Zn) 4.0 ~ 8.0 중량 %, 마그네슘(Mg)는 1.0 ~ 3.0 중량 % 및 나머지는 알루미늄(Al)과 불가피한 적어도 하나의 불순 물을 포함할 수 있다. 본 발명 다양한 실시예에 따른 아노다이징이 가능한 알루미늄 클래드 판재 제조 방법은, 알루미늄 7xxx 계열 합 금, 알루미늄 6xxx 계열 합금 또는 알루미늄 1xxx 계열 합금을 마련하는 공정; 심재로 상기 알루미늄 7xxx 계열 합금을 배치하고, 상기 심재 영역의 일면 또는 양면에 피복재로 상기 알루미늄 6xxx 계열 합금 또는 상기 알루 미늄 1xxx 계열 합금을 적층하는 공정; 상기 적층된 판재를 480도 내지 520도에서 가열하여 연화시키고, 압연 접합을 수행하는 공정을 포함할 수 있다.다양한 실시예에 따르면, 상기 연화된 판재를 단조 및 성형하는 공정; 520도 내지 540도에서 30분 이상 가열한 후 수냉하는 용체화 처리 공정; 및 상기 용체화 처리된 판재를 80 내지 180 도에서 8시간 이상 가열한 후 공냉 시키는 시효 경화 처리 공정;을 더 포함할 수 있다. 다양한 실시예에 따르면, 상기 알루미늄 합금 또는 순수 알루미늄을 마련하는 공정에서, 상기 심재에 사용하는 상기 알루미늄 7xxx 계열 합금은 항복 강도가 450MPa 이상이거나, 상기 피복재에 사용하는 상기 알루미늄 6xxx 계열 합금은 항복 강도가 250MPa 이상일 수 있다. 다양한 실시예에 따르면, 상기 적층된 판재를 가열하여 연화시키는 공정에서, 상기 적층된 판재를480도 내지 520도의 온도에서 0.5 내지1.5시간 동안 가열하여 연화시키는 공정을 포함할 수 있다. 다양한 실시예에 따르면, 상기 적층된 판재를 압연 접합시키는 공정에서, 상기 적층된 판재를 480도 내지 520도 의 온도에서 15분 이상 가열하여 계면간의 확산 접합시키는 공정을 포함하고, 상기 공정은 상기 적층된 판재를 40 내지 60%의 압하율로 열간 압연할 수 있다. 다양한 실시예에 따르면, 상기 적층된 판재를 압연 접합시키는 공정에서, 상기 압연 접합 공정은 복수 회 반복 실시하고, 상기 피복재에 사용하는 상기 알루미늄 6xxx 계열 합금은 40% 이상의 압하율로 압연 접합시키는 공정 을 포함할 수 있다. 다양한 실시예에 따르면, 상기 적층된 판재를 압연 접합시키는 공정에서, 상기 압연 접합 공정은 복수 회 반복 실시하고, 상기 피복재에 사용하는 상기 알루미늄 1xxx 계열 합금은 20 내지30% 의 압하율로 압연 접합시키는 공정을 포함할 수 있다. 다양한 실시예에 따르면, 상기 연화된 판재를 단조 및 성형하는 공정에서, 상기 적층된 판재를 단조 성형 후 5 분 이상 가열한 후, 재단조 및 재성형하는 공정을 포함할 수 있다. 다양한 실시예에 따르면, 용체화 처리 공정에서, 상기 적층된 판재를 500 내지 540 도에서 3.5 내지 4.5 시간 가열한 후 수냉하는 공정을 포함할 수 있다. 다양한 실시예에 따르면, 시효 경화 처리 공정에서, 상기 용체화 처리된 판재를 60 내지 100 도에서 12 내지 20 시간 동안 가열하는 공정; 상기 가열된 판재를 120 내지 180도에서 18 내지 30시간 가열하는 공정; 및 공냉시키 는 공정;을 포함할 수 있다. 다양한 실시예에 따르면, 상기 알루미늄 클래드 판재는 열처리에 의해, 330 ~ 450MPa의 항복 강도의 특성을 나 타내도록 제조될 수 있다. 이상에서 설명한 본 발명의 다양한 실시예의 전자장치는 전술한 실시 예 및 도면에 의해 한정되는 것은 아니고,"}
{"patent_id": "10-2017-0029503", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "본 발명의 기술적 범위 내에서 여러 가지 치환, 변형 및 변경이 가능함은 본 발명이 속하는 기술분야에서 통상 의 지식을 가진 자에게 있어 명백할 것이다."}
{"patent_id": "10-2017-0029503", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 다양한 실시예에 따른, 알루미늄 합금을 이용한 다층 클래드 판재의 측면 영역을 도시한 단면도이다. 도 2는 본 발명의 다양한 실시예에 따른, 도 1의 알루미늄 다층 클래드 판재의 단면의 사진을 도시하였다. 도 3은 본 발명의 다양한 실시예에 따른, 알루미늄 합금을 이용한 다층(3층 구조) 클래드 판재의 측면 영 역을 도시한 단면도이다. 도 4은 본 발명의 다양한 실시예에 따른, 알루미늄 합금을 이용한 다층(3층 구조) 클래드 판재의 측면 영 역을 도시한 단면도이다. 도 5는 본 발명의 다양한 실시예에 따른, 알루미늄 합금을 이용한 클래드 판재 제조 방법에 관한 흐름도이다. 도 6은 본 발명의 다양한 실시예에 따른, 도 5의 클래드 판재 제조 방법의 공정 순서를 도시하였다."}
