{"patent_id": "10-2022-0176385", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0093270", "출원번호": "10-2022-0176385", "발명의 명칭": "사용자 단말의 동영상 촬영 기능을 이용한 홀로그램 제작 방법 및 상기 방법에 의해 제작된", "출원인": "한국전자기술연구원", "발명자": "홍성희"}}
{"patent_id": "10-2022-0176385", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자 단말의 카메라에 의해, 실제 물체를 촬영하여 m개의 시점 이미지들을 생성하는 단계;서버에 구비된 인공 지능 모델에 의해, 상기 m개의 시점 이미지들을 렌더링하여 상기 m보다 큰 n개의 시점 이미지들을 생성하는 단계;홀로그램 프린터에 의해, 상기 n개의 시점 이미지들에 대응하는 홀로그램 콘텐츠를 기록한 홀로그램 기록 매체를 제조하는 단계;를 포함하는 홀로그램 제작 방법."}
{"patent_id": "10-2022-0176385", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에서,상기 m개의 시점 이미지들을 생성하는 단계는,상기 사용자 단말의 카메라가 임의의 방향으로 움직이면서 상기 실제 물체를 촬영하여 상기 실제 물체의 동영상을 획득하는 단계;상기 사용자 단말의 프로세서가 상기 동영상으로부터 상기 m개의 시점 이미지들을 추출하는 단계; 및상기 사용자 단말의 통신 장치가 상기 m개의 시점 이미지들을 통신 네트워크를 통해 상기 서버로 송신하는단계;를 포함하는 홀로그램 제작 방법."}
{"patent_id": "10-2022-0176385", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에서,상기 n개의 시점 이미지들을 생성하는 단계는상기 NeRF(Neural Radiance Fields) 기반의 상기 n개의 시점 이미지들을 생성하는 단계인 홀로그램 제작 방법."}
{"patent_id": "10-2022-0176385", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1 사용자 단말의 카메라가 원본 보안 코드를 촬영한 동영상으로부터 m개의 시점 이미지들을 추출하고, 인공지능 모델을 기반으로 상기 m개의 시점 이미지들을 렌더링하여 상기 m보다 큰 n개의 시점 이미지들을 생성하고,홀로그램 프린터를 이용하여 상기 n개의 시점 이미지들에 대응하는 홀로그램 보안 코드를 제작하는 단계;제2 사용자 단말의 카메라가 상기 홀로그램 보안 코드를 스캔하여 다수의 홀로그램 이미지들을 획득하는 단계;상기 제2 사용자 단말의 프로세서에 의해, 상기 다수의 홀로그램 이미지들을 결합하여 원본 보안 코드를 복원하는 단계; 및상기 제2 사용자 단말의 프로세서가 상기 원본 보안 코드를 판독하는 단계를 포함하는 홀로그램 보안 코드를 판독하기 위한 방법."}
{"patent_id": "10-2022-0176385", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에서,상기 홀로그램 보안 코드를 제작하는 단계상기 제1 사용자 단말의 카메라가 임의의 방향으로 움직이면서 상기 원본 보안 코드를 촬영하여 상기 원본 보안코드의 동영상을 획득하는 단계;공개특허 10-2024-0093270-3-상기 제1 사용자 단말의 프로세서가 상기 동영상으로부터 상기 m개의 시점 이미지들을 추출하는 단계;상기 제1 사용자 단말의 통신 장치가 상기 m개의 시점 이미지들을 서버로 송신하는 단계;상기 서버의 인공 지능 모델이 상기 m개의 시점 이미지들을 렌더링하여 상기 m보다 큰 n개의 시점 이미지들을생성하는 단계를 포함하는 홀로그램 보안 코드를 판독하기 위한 방법."}
{"patent_id": "10-2022-0176385", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4항에서,상기 인공 지능 모델은 NeRF(Neural Radiance Fields) 모델인 것인 홀로그램 보안 코드를 판독하기 위한 방법."}
{"patent_id": "10-2022-0176385", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제4항에서, 상기 다수의 홀로그램 이미지들을 획득하는 단계는,상기 홀로그램 보안 코드를 사전에 결정된 스캔 방향으로 스캔하여 상기 다수의 홀로그램 이미지들을 획득하는단계인 것인 홀로그램 보안 코드를 판독하기 위한 방법."}
{"patent_id": "10-2022-0176385", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제4항에서,상기 다수의 홀로그램 이미지들을 획득하는 단계는,상기 다수의 홀로그램 이미지들을 획득한 이후 상기 프로세서가 각 홀로그램 이미지에 번호를 부여하는 단계;및상기 프로세서가 상기 사용자 단말의 메모리에 상기 다수의 홀로그램 이미지들과 각 홀로그램 이미지에 부여된번호를 매핑하여 저장하는 단계를 포함하는 홀로그램 보안 코드를 판독하기 위한 방법."}
{"patent_id": "10-2022-0176385", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에서,상기 각 홀로그램 이미지에 번호를 부여하는 단계는,상기 사용자 단말의 모션 인식 센서가, 각 홀로그램 이미지를 획득한 시점에서 상기 사용자 단말의 모션 데이터를 측정하는 단계; 및상기 모션 데이터에 따라 정의된 번호를 각 홀로그램 이미지에 부여하는 단계를 포함하는 홀로그램 보안 코드를 판독하기 위한 방법."}
{"patent_id": "10-2022-0176385", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에서,상기 원본 보안 코드를 복원하는 단계는,상기 사용자 단말의 통신 인터페이스가 상기 서버로부터 상기 번호들의 순서를 나타내는 정보를 수신하는 단계;및상기 정보에 포함된 순서에 따라 상기 다수의 홀로그램 이미지들을 결합하여 상기 원본 보안 코드를 복원하는단계를 포함하는 홀로그램 보안 코드를 판독하기 위한 방법.공개특허 10-2024-0093270-4-청구항 11 제4항에서,상기 다수의 홀로그램 이미지들을 획득하는 단계는,상기 사용자 단말에 설치된 앱을 실행하는 단계;상기 앱이 상기 사용자 단말의 디스플레이를 통해 사전에 결정된 스캔 방향을 표시하는 단계;상기 사용자가 상기 디스플레이에 표시된 상기 스캔 방향에 따라 상기 사용자 단말을 이동시키는 단계; 및상기 사용자 단말의 이동에 따라 상기 카메라가 상기 홀로그램 보안 코드를 스캔하여 상기 다수의 홀로그램 이미지들을 획득하는 단계를 포함하는 홀로그램 보안 코드를 판독하기 위한 방법."}
{"patent_id": "10-2022-0176385", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에서,상기 디스플레이를 통해 표시되는 스캔 방향은 주기적으로 변경되는 것인 홀로그램 보안 코드를 판독하기 위한방법."}
{"patent_id": "10-2022-0176385", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "홀로그램 보안 코드를 판독하기 위한 방법이 개시된다. 이 방법은, 상기 사용자 단말의 카메라에 의해, 상기 홀 로그램 보안 코드를 스캔하여 다수의 홀로그램 이미지들을 획득하는 단계; 상기 사용자 단말의 프로세서에 의해, 상기 다수의 홀로그램 이미지들을 결합하여 원본 보안 코드를 복원하는 단계; 및 상기 프로세서에 의해, 상기 원 본 보안 코드를 판독하는 단계를 포함한다."}
{"patent_id": "10-2022-0176385", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 홀로그램 콘텐츠 제작 기술에 관한 것으로, 보다 상세하게는 스마트 폰과 같은 사용자 단말을 이용하 여 홀로그램 콘텐츠를 제작하는 기술에 관한 것이다."}
{"patent_id": "10-2022-0176385", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "홀로그램 기술은 빛의 간섭 효과를 활용한 기술이다. 홀로그램 콘텐츠는 기준이 되는 빛과 물체에서 반사된 빛 의 간섭 간섭 패턴을 특수 필름상에 기록하는 방식으로 얻을 수 있다. 기존의 홀로그램 제작 방식은 다수의 카메라들과 조명들이 배치된 특수한 환경에서 실제 물체를 촬영하여 획득 한 이미지들을 3차원 스캔 기술을 기반으로 3차원 컴퓨터 그래픽 모델로 모델링한 후, 그 3차원 컴퓨터 그래픽 모델을 컴퓨터 그래픽 상에서 가상으로 구현된 가상 카메라들로 촬영하여 수만 내지 수십 만개의 시점들로 렌더 링한 후, 그 렌더링된 수만 내지 수십 만개의 시점 이미지들을 홀로그램 프린터를 이용하여 특수 필름 상에 기 록하는 방식으로 이루어진다. 이처럼 기존의 홀로그램 제작 방식은 실제 물체를 3차원 컴퓨터 그래픽 모델로 모델링 하기 위해, 다수의 카메 라들과 조명들과 같은 고가의 3차원 캡처 장비들이 필요하고, 3차원 컴퓨터 그래픽 모델로부터 수만 내지 수십 만개의 시점 이미지들을 획득하기 위해 수만 내지 수십만 번의 렌더링 과정이 필요하기 때문에, 제작 비용, 제 작 시간 및 기술적 난이도가 매우 높은 문제점이 있다."}
{"patent_id": "10-2022-0176385", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상술한 문제점을 해결하기 위한 본 발명의 일 목적은 스마트 폰과 같은 사용자 단말의 동영상 촬영 기능을 이용 하여 홀로그램 콘텐츠를 간단하게 제작할 수 있는 홀로그램 제작 방법을 제공하는 데 있다. 본 발명의 다른 목적은 상기 일 목적에 따른 홀로그램 제작 방법에 의해 제작된 홀로그램 콘텐츠를 판독하기 위 한 방법을 제공하는 데 있다."}
{"patent_id": "10-2022-0176385", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 목적을 달성하기 위한 본 발명의 일 측면에 따른 홀로그램 제작 방법은 사용자 단말에 의해, 실제 물체 를 촬영하여 m개의 시점 이미지들을 생성하는 단계; 서버에 구비된 인공 지능 모델에 의해, 상기 m개의 시점 이 미지들을 렌더링하여 상기 m보다 큰 n개의 시점 이미지들을 생성하는 단계; 및 홀로그램 프린터에 의해, 상기 n 개의 시점 이미지들에 대응하는 홀로그램 콘텐츠를 기록된 홀로그램 기록 매체를 제조하는 단계를 포함한다. 본 발명의 다른 일면에 따른 홀로그램 보안 코드를 판독하기 위한 방법은 제1 사용자 단말의 카메라가 원본 보 안 코드를 촬영한 동영상으로부터 m개의 시점 이미지들을 추출하고, 인공 지능 모델을 기반으로 상기 m개의 시 점 이미지들을 렌더링하여 상기 m보다 큰 n개의 시점 이미지들을 생성하고, 홀로그램 프린터를 이용하여 상기 n 개의 시점 이미지들에 대응하는 홀로그램 보안 코드를 제작하는 단계; 제2 사용자 단말의 카메라가 상기 홀로그 램 보안 코드를 스캔하여 다수의 홀로그램 이미지들을 획득하는 단계; 상기 제2 사용자 단말의 프로세서에 의해, 상기 다수의 홀로그램 이미지들을 결합하여 원본 보안 코드를 복원하는 단계; 및 상기 제2 사용자 단말의 프로세서가 상기 원본 보안 코드를 판독하는 단계를 포함한다."}
{"patent_id": "10-2022-0176385", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 사용자 단말(예, 스마트 폰)의 동영상 촬영 기능을 이용하여 수십 개의 시점 이미지들을 획 득하고, 인공 지능 기술을 이용하여 수십 개의 시점 이미지들로부터 수만 내지 수십 만개의 시점 이미지들을 간 단하게 획득한 후, 이처럼 간단하게 획득한 수만 내지 수십 만개의 시점 이미지들을 기반으로 홀로그램 콘텐츠 를 제작함으로써, 홀로그램 콘텐츠 제작에 필요한 제작 비용 및 제작 시간을 크게 줄일 수 있다. 본 발명에 따르면, 고가의 카메라들 및 조명 장치들 없이, 사용자 단말(예, 스마트 폰)의 동영상 촬영 기능을 이용하여 물체를 촬영하기 때문에, 움직이는 물체나 촬영이 어려운 대형 물체에 대한 홀로그램 콘텐츠를 쉽게 제작할 수 있다. 즉, 예를 들어 움직이는 인물 혹은 풍경이나, 대형 문화재처럼 특정 위치에서 수만 내지 수십 만 개의 시점 이미지들을 획득하기가 매우 어려운 대상 물체에 대해서도 사용자 단말(예, 스마트 폰)의 동영상 촬영 기능을 통해 획득한 수십 개의 이미지들만으로도 홀로그램 콘텐츠를 간단하게 제작할 수 있다."}
{"patent_id": "10-2022-0176385", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도 가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포 함하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소,부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일 반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥 상 가지는 의미와 일치하는 의 미를 가진 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 본 발명은, 제작 비용, 제작 시간 및 기술적 난이도가 매우 높은 기존의 홀로그램 콘텐츠 제작의 문제점을 개선 하기 위해, 스마트 폰과 같은 사용자 단말의 동영상 촬영 기능을 이용하여 대상 물체의 수만 내지 수십만 장의 시점 이미지들을 생성하는 방법을 제공한다. 이하, 첨부한 도면들을 참조하여, 사용자 단말의 동영상 촬영 기능을 이용하여 대상 물체에 대한 홀로그램 콘텐 츠를 생성하는데 필요한 수만 내지 수십만 개의 시점 이미지들을 생성하는 방법에 대한 바람직한 실시 예를 보 다 상세하게 설명한다. 도 1은 본 발명의 실시 예에 따른 홀로그램 제작 과정을 설명하기 위한 도면이다. 도 1을 참조하면, 먼저 사용자가 사용자 단말(예, 스마트 폰 등)의 동영상 촬영 기능을 이용하여 사용자 단 말을 임의의 방향으로 움직이면서 실제 물체를 수초(예, 3~5초) 동안 촬영한다. 이때, 임의의 방향 은 사용자가 실제 물체를 홀로그램 형태로 보고 싶어하는 시점들에 따라 결정될 수 있다. 이어, 실제 물체를 촬영하여 획득한 동영상(video)으로부터 상기 시점들에 대응하는 m개(예, 30~40개)의 시 점 이미지들을 추출하는 과정이 수행된다. 이어, 인공 신경망 모델이 상기 추출된 m개의 시점 이미지들을 입력 데이터로 이용하여 n개(예, 10만개)의 시점 이미지들을 생성한다. 이와 같이, 본 발명의 실시 예에서는 인공 신경망 모델을 이용하 여 홀로그램 제작에 필요한 수만 내지 수십만개의 시점 이미지들을 생성함으로써, 홀로그램 제작에 필요한 수만 내지 수십만개의 시점 이미지들을 생성하기 위한 기존의 복잡한 3D 스캔 과정을 생략할 수 있다. 인공 신경망 모델은 서로 다른 시점들에서 촬영된 시점 이미지들의 컬러값, 방향값 및 특징값들을 학습 하여 수만 내지 수십 만개의 시점들을 갖는 시점 이미지들을 렌더링하도록 사전에 학습된 인공 신경망일 수 있다. 인공 신경망 모델은, 예를 들면, NeRF(Representing Scenes as Neural Radiance Fields for View Synthesis) 모델로 구현된 인공 신경망일 수 있다. NeRF 모델은 실제 물체를 촬영한 여러 장의 이미지를 입력 데이터로 이용하여 새로운 시점에서의 물체 이미지를 만들어내는(View synthesis) 모델이다. NeRF 모델은 CVPR(Computer Vision and Pattern Recognition) 2020에서 'Representing Scenes as Neural Radiance Fields for View Synthesis'라는 제목으로 소개된 논문에서 자세히 설명하고 있으므로, 이에 대한 자 세한 설명은 생략하기로 한다. 이어, 홀로그램 프린터의 홀로그램 프린팅 과정을 통해, 상기 인공 신경망 모델에 의해 생성된 n개(예, 10만개)의 시점 이미지들에 대응하는 홀로그램 콘텐츠가 기록된 홀로그램 기록 매체를 생성한다. 이와 같이, 본 발명의 실시 예에 따른 홀로그램 제작 과정은 사용자가 실제 물체를 홀로그램으로 구현하고 싶은 시점에서 스마트폰의 동영상 촬영 기능을 이용하여 간단하게 촬영한 시점 이미지들을 기반으로 홀로그램 콘텐츠 를 제작하기 때문에, 홀로그램 제작에 필요한 수만 내지 수십만개의 시점 이미지들을 생성하기 위한 기존의 복 잡한 3D 스캔 과정을 생략할 수 있다. 도 2는 도 1에 도시된 홀로그램 제작 과정을 구현하기 위한 홀로그램 제작 시스템의 개략적인 구성도이다. 도 2를 참조하면, 본 발명의 실시 예에 따른 홀로그램 제작 시스템은 사용자 단말, 통신 네트워크, 서 버 및 홀로그램 프린터를 포함한다. 사용자 단말은 동영상 촬영 기능과 통신 기능을 갖는 장치로서, 통신 네트워크를 통해 서버와 통 신한다. 사용자 단말은 동영상 촬영 기능과 통신 기능을 갖는 컴퓨팅 장치로서, 컴퓨팅 장치는, 프로세서, 메모리, 저장 장치, 카메라 및 유/무선 통신을 지원하는 통신 장치 등을 포함한다. 프로세서는 적어도 하나의 CPU, 적어도 하나의 GPU, 적어도 하나의 애플리케이션 프로세서, 적어도 하나의 시스템 온 칩(SoC), 적어도 하나의 마이 크로 컨트롤러 유닛 등 중에서 적어도 하나를 포함할 수 있다. 사용자 단말은, 예를 들면, 스마트폰(smartphone), 태블릿 PC(tablet personal computer), 이동전화기 (mobile phone), 화상전화기, 전자북 리더기(e-book reader), 데스크탑 PC(desktop personal computer), 랩탑 PC(laptop personal computer), 넷북 컴퓨터(netbook computer), PDA(personal digital assistant), PMP(portable multimedia player), 의료기기, 보안 기기, 통신 기능을 갖는 카메라(camera), 또는 웨어러블 장 치(wearable device)(예: 전자 안경과 같은 head-mounted-device(HMD), 스마트 와치(smartwatch) 또는 스캐너 (scanner) 중 적어도 하나를 포함할 수 있다. 사용자 단말의 카메라는 임의의 방향(도 1의 50)으로 움직이면서 촬영한 실제 물체(도 1의 5)의 동영상을 생성하여 저장 장치에 저장한다. 사용자 단말의 프로세서는 상기 저장 장치에 저장된 동영상으로부터 사용자가 실제 물체(도 1의 5)를 홀로 그램 형태로 보고 싶어하는 시점들에 대응하는 m개의 시점 이미지들을 추출한다. 사용자 단말의 프로세서는 상기 추출한 m개(예, 30~40개)의 시점 이미지들(도 1의 22)을 포함하는 시점 이 미지 파일을 생성하고, 상기 시점 이미지 파일을 통신 네트워크를 통해 서버로 송신한다. 통신 네트워크는 이동 통신(3G, 4G, 5G, 6G) 및 유/무선인터넷을 포함한다. 본 명세서에서 통신 네트워크 는 게이트웨이, 라우터, 기지국 등을 포함하는 개념으로 사용된다. 서버는 홀로그램 프린팅 서비스 업체에 설치된 컴퓨팅 장치일 수 있다. 서버로 구현된 컴퓨팅 장치는, 프로세서, 메모리, 저장 장치, 및 유/무선 통신을 지원하는 통신 장치 등을 포함한다. 프로세서는 적어 도 하나의 CPU, 적어도 하나의 GPU, 적어도 하나의 애플리케이션 프로세서, 적어도 하나의 시스템 온 칩(SoC), 적어도 하나의 마이크로 컨트롤러 유닛 등 중에서 적어도 하나를 포함할 수 있다. 서버는 통신 네트워크를 통해 사용자 단말로부터 시점 이미지 파일을 수신한다. 서버는 렌 더링 모듈을 포함하며, 렌더링 모듈은 도 1에 도시된 인공 지능 모델을 포함하도록 구성될 수 있 다. 인공 지능 모델은 사용자 단말로부터 수신된 상기 시점 이미지 파일에 포함된 상기 m(예, 30~40)개의 시점 이미지들(도 1의 22)을 렌더링하여 n개(예, 10만개)의 시점 이미지들(도 1의 32)을 생성한다. 홀로그램 프린터는 상기 n개의 시점 이미지들에 대응하는 홀로그램 콘텐츠가 기록된 홀로그램 기록 매체 를 출력한다. 홀로그램 기록 매체는 홀로그램 콘텐츠가 기록된 특정 필름일 수 있다. 홀로그램 프린터 로부터 출력된 홀로그램 기록 매체는 사용자 단말의 사용자에게 배송된다. 앞에서, 서버를 홀로그램 프린팅 서비스 업체에 설치된 장치로 설명하였으나, 이에 한정하지 않고, 서버 는 클라우드 서버일 수 있다. 이 경우, 클라우드 서버는 n개의 시점 이미지들을 생성하여 사용자 단말(2 0)로 송신하고, 사용자 단말은 클라우드 서버로부터 수신한 n개의 시점 이미지들을 홀로그램 프린팅 서비스 업체에 설치된 서버로 송신할 수 있다. 이 경우, 홀로그램 프린팅 서비스 업체에 설치된 서버는 렌더링 모듈을 포함하지 않는다. 도 2에서는 서버와 홀로그램 프린터를 독립된 구성으로 분리하여 도시하였으나, 홀로그램 프린터 는 서버에 포함될 수 있다. 도 3은 본 발명의 실시 예에 따른 홀로그램 제작 방법을 설명하기 위한 흐름도이다. 도 3을 참조하면, S310에서, 사용자 단말에서, 실제 물체를 촬영하여 m개의 시점 이미지들을 생성하는 과정이 수행된다. 이어, S320에서, 서버에서, 인공 지능 모델로 구현된 렌더링 모듈이 상기 m개의 시점 이미지들을 렌 더링하여 상기 m보다 큰 n개의 시점 이미지들을 생성하는 과정이 수행된다. S330에서, 홀로그램 프린터에서, 상기 n개의 시점 이미지들에 대응하는 홀로그램 콘텐츠를 기록된 홀로그램 기록 매체를 제조하는 과정이 수행된다. 이하, 도 3의 홀로그램 제작 방법에 의해 제작된 홀로그램 기록 매체에 기록된 홀로그램 콘텐츠를 판독하는 방 법에 대해 설명하기로 한다. 다만, 이하의 실시 예에서는, 도 3의 홀로그램 제작 방법에 의해 제작된 홀로그램 기록 매체에 기록된 홀로그램 콘텐츠가 QR코드와 같은 보안 코드인 것으로 가정한다. 도 4는 도 3에 도시된 홀로그램 제작 방법에 의해 제작된 홀로그램 콘텐츠로서 홀로그램 보안 코드를 판독하기 위한 방법을 설명하기 위한 흐름도이다. 도 4를 참조하면, S410에서, 제1 사용자 단말(도 1 및 2의 20)의 카메라가 원본 보안 코드를 촬영하여 획득한 동영상으로부터 m개의 시점 이미지들을 추출하고, 인공 지능 모델을 기반으로 상기 m개의 시점 이미지들을 렌더 링하여 상기 m보다 큰 n개의 시점 이미지들을 생성하고, 홀로그램 프린터를 이용하여 상기 n개의 시점 이미지들 에 대응하는 홀로그램 보안 코드를 제작하는 과정이 수행된다. 이어, S420에서, 제2 사용자 단말(도 5의 100)의 카메라가 상기 홀로그램 보안 코드를 스캔하여 다수의 홀로그 램 이미지들을 획득하는 과정이 수행된다. 이어, S430에서, 상기 제2 사용자 단말(도 5의 100)의 프로세서에 의해, 상기 다수의 홀로그램 이미지들을 결합 하여 원본 보안 코드를 복원하는 과정이 수행된다. 이어, 상기 제2 사용자 단말의 프로세서가 상기 원본 보안 코드를 판독하는 과정이 수행된다. 실시 예에서, 상기 홀로그램 보안 코드를 제작하는 과정(S410)은 상기 제1 사용자 단말의 카메라가 임의의 방향 으로 움직이면서 상기 원본 보안 코드를 촬영하여 상기 원본 보안 코드의 동영상을 획득하는 과정, 상기 제1 사 용자 단말의 프로세서가 상기 동영상으로부터 상기 m개의 시점 이미지들을 추출하는 과정, 상기 제1 사용자 단 말의 통신 장치가 상기 m개의 시점 이미지들을 서버로 송신하는 과정 및 상기 서버의 인공 지능 모델이 상기 m 개의 시점 이미지들을 렌더링하여 상기 m보다 큰 n개의 시점 이미지들을 생성하는 과정을 포함할 수 있다. 실시 예에서, 상기 인공 지능 모델은 NeRF(Neural Radiance Fields) 모델일 수 있다. 이하, S420, S430 및 S440에 대해서는 도 5 내지 10을 참조하여 상세히 설명하기로 한다. 도 5는 본 발명의 실시 예에 따른 사용자 단말의 블록도이고, 도 6은 본 발명의 실시 예에 따른 다채널로 분리 된 QR 코드의 예를 설명하기 위한 도면이다. 먼저, 도 5를 참조하면, 사용자 단말는 복제가 불가능하도록 제작된 홀로그램 형태의 보안 코드(이하, '홀 로그램 보안 코드'라 함)를 스캔하고, 스캔된 홀로그램 보안 코드를 판독하는 '컴퓨팅 장치' 또는 '전자 장치' 일 수 있다. 본 명세서의 청구범위에서는 사용자 단말이 '제2 사용자 단말'로 기재되고, 도 1 및 2에 도시 된 사용자 단말이 '제1 사용자 단말'로 기재될 수 있다. 이러한 사용자 단말, 예를 들면, 스마트폰(smartphone), 태블릿 PC(tablet personal computer), 이동전화 기(mobile phone), 화상전화기, 전자북 리 더기(e-book reader), 데스크탑 PC(desktop personal computer), 랩 탑 PC(laptop personal computer), 넷북 컴퓨터(netbook computer), PDA(personal digital assistant), PMP(portable multimedia player), 의료기기, 보안 기기, 카메라(camera), 또는 웨어러블 장치(wearable device)(예: 전자 안경과 같은 head-mounted-device(HMD), 스마트 와치(smartwatch) 또는 스캐너(scanner) 중 적어도 하나로 불릴 수 있다. 어떤 실시 예들에 따르면, 사용자 단말은 통신 기능을 갖춘 스마트 가전 제품(smart home appliance)일 수 있다. 스마트 가전 제품은, 예를 들면, 전자 장치는 텔레비전, DVD(digital video disk) 플레이어, 오디오, 냉 장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스(set-top box), TV 박스(예를 들면, 삼성 HomeSync, 애플TV, 또는 구글 TV), 게임 콘솔(game consoles), 전자 사전, 전자 키, 캠코더(camcorder), 또는 전자 액자 중 적어도 하나를 포함할 수 있다. 어떤 실시 예들에 따르면, 사용자 단말은 각종 의료기기(예: MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 초음파기 등), 네비게이션(navigation) 장치, GPS 수신기(global positioning system receiver), EDR(event data recorder), FDR(flight data recorder), 자동차 인포테인먼트(infotainment) 장치, 선박용 전자 장비(예: 선박용 항법 장치 및 자이로콤파스등), 항공 전자기기(avionics), 보안 기기, 또는 산업용 또는 가정용 로봇 중 적어도 하나를 포함할 수 있다. 어떤 실시 예들에 따르면, 사용자 단말은 통신 기능을 포함한 가구(furniture) 또는 건물/구조물의 일부, 전자 보드(electronic board), 전자 사인 입력장치(electronic signature receiving device), 프로젝터 (projector), 또는 각종 계측기기(예: 수도, 전기, 가스, 또는 전파 계측 기기 등) 중 적어도 하나를 포함할 수 있다. 다양한 실시 예에 따른 사용자 단말은 전술한 다양한 장치들 중 하나 또는 그 이상의 조합일 수 있다. 또 한, 본 개시의 다양한 실시 예에 따른 전자 장치는 전술한 기기들에 한정되지 않음은 당업자에게 자명하다. 본 발명의 실시 예에 따른 사용자 단말에 의해 스캔되는 홀로그램 보안 코드는, 예를 들면, QR 코드일 수 있으나, 이를 한정하는 것은 아니다. 본 발명의 실시 예에 따른 홀로그램 보안 코드는 하나의 원본 보안 코드를 다채널로 분리하여, 다채널로 분리된 보안 코드들을 홀로그램 형태로 암호화한 것일 수 있다. 이처럼 다채널로 분리된 보안 코드들을 홀로그램 형태로 암호화함으로써, 제3자에 의한 복제를 원천적으로 차단 할 수 있다. 예를 들면, 도 6에 도시된 바와 같이, 홀로그램 보안 코드는, 하나의 원본 QR 코드를 4개의 채 널들(CH1~CH4)로 분리하고, 4개의 채널들(CH1~CH4)로 분리된 보안 코드들(10A~10B)을 홀로그램 형태로 암호화하 여 제작될 수 있다. 이때, 각 홀로그램 형태의 보안 코드에서 박스 영역(A, B, C 또는 D)은 실제 QR 코드값이 기록된 영역이고, 그 이외의 영역은 가짜 QR 코드값이 기록된 영역이다. 다시 도 5를 참조하면, 홀로그램 보안 코드를 스캔하고, 스캔된 홀로그램 보안 코드를 판독하기 위해, 사용자 단말은 버스, 프로세서, 메모리, 입출력 인터페이스, 디스플레이, 통신 인터페 이스, 카메라 및 모션 인식 센서를 포함할 수 있다. 버스는 전술한 구성요소들(120~170)을 서로 연결하는 회로일 수 있다. 프로세서는 버스를 통해 전술한 다른 구성요소들(예: 메모리, 입출력 인터페이스, 디스플 레이, 통신 인터페이스 및 음성 인터페이스 모듈)로부터 명령, 데이터 또는 신호를 수신하여, 수신된 명령, 데이터 또는 신호를 해독하고, 해독된 명령에 따른 연산이나 데이터 처리를 실행할 수 있다. 프로 세서는, 예를 들면, 적어도 하나의 CPU, 적어도 하나의 GPU, 마이크로 컨트롤러 유닛(MCU) 및/또는 시스템 온 칩(SoC) 등을 포함할 수 있다. 실시 예에서, 프로세서는 홀로그램 보안 코드(예, 도 2의 10A, 10B, 10C 및 10D)를 스캔하도록 카메라 를 제어할 수 있고, 카메라에 의해 스캔된 홀로그램 보안 코드의 이미지들(이하, '홀로그램 이미지들'이라 함)를 판독하도록 설계된 어플리케이션(또는 앱)을 실행할 수 있다. 실시 예에서, 프로세서 또는 프로세서에 의해 실행된 어플리케이션(또는 앱)은 카메라에 의해 스캔된 다수의 홀로그램 이미지들(예, 10A, 10B, 10C 및 10D)을 결합(조합)하는 이미지 처리를 수행하여 원본 보안 코드(예를 들면, 도 6의 10)를 복원할 수 있다. 실시 예에서, 프로세서 또는 프로세서에 의해 실행된 어플리케이션(또는 앱)은 복원된 원본 보안 코 드(예를 들면, 도 6의 10)를 판독할 수 있다. 실시 예에서, 프로세서 또는 프로세서에 의해 실행된 어플리케이션(또는 앱)은 카메라가 홀로그 램 보안 코드(10')를 스캔하여 획득한 상기 다수의 홀로그램 이미지들(예, 도 6의 10A ~ 10D)에 번호를 부여하 고, 상기 다수의 홀로그램 이미지들과 각 홀로그램 이미지에 부여된 번호를 매핑하여 메모리에 저장할 수 있다. 메모리는 프로세서 또는 다른 구성요소들(130~180)로부터 수신되거나 프로세서 또는 다른 구성 요소들(130~180)에 의해 생성된 명령 또는 데이터를 저장할 수 있다. 메모리는 커널, 미들웨어, 애플 리케이션 프로그래밍 인터페이스(API: application programming interface) 또는 애플리케이션 등의 프로그래 밍 모듈들을 실행 공간을 제공할 수 있다. 여기서, 애플리케이션 프로그래밍 인터페이스(API)는 스캔된 해당 홀 로그램 보안 코드와 링크를 구성하는 특정 스캐닝 API일 수 있다. 전술한 각각의 프로그래밍 모듈들은 소프트웨 어, 펌웨어, 하드웨어 또는 이들 중 적어도 둘 이상의 조합으로 구성될 수 있다. 입출력 인터페이스는, 입출력 장치(예: 센서, 키보드 또는 터치 스크린)를 통하여 사용자로부터 입력된 명 령 또는 데이터를, 예를 들면, 버스를 통해 프로세서, 메모리, 통신 인터페이스, 카메라 또는 모션 인식 센서에 전달할 수 있다. 예를 들면, 입출력 인터페이스는 터치 스크린을 통하여 입력된 사용자의 터치에 대한 데이터를 프로세서로 제공할 수 있다. 또한, 입출력 인터페이스는, 예를 들면, 버스를 통해 프로세서, 메모리, 통신 인터페이스, 또는 음성 인터페이스 모듈 로부터 수신된 명령 또는 데이터를 입출력 장치(예: 스피커 또는 디스플레이)를 통하여 출력할 수 있다. 디스플레이는 프로세서의 제어에 따라 사용자에게 각종 정보를 표시할 수 있다. 여기서 정보는 사용 자 단말의 스캔 방향을 표시할 수 있다. 사용자는 디스플레이에서 표시한 스캔 방향을 참고하여 사용 자 단말을 이동시킨다. 실시 예에서, 디스플레이는 보안을 위해 프로세서의 제어에 따라 사용자 단말의 스캔 방향을 주기적으로 변경하여 표시할 수 있다. 통신 인터페이스는 사용자 단말과 서버 간의 통신을 연결할 수 있다. 예를 들면, 통신 인터페이 스는 무선 통신 또는 유선 통신을 통해서 통신 네트워크에 연결되어 서버와 통신할 수 있다. 무선 통신은, 예를 들어, Wifi(wireless fidelity), BT(Bluetooth), NFC(near field communication), GPS(global positioning system) 또는 cellular 통신(예: LTE, LTE-A, CDMA, WCDMA, UMTS, WiBro 또는 GSM 등) 중 적어도 하나를 포함할 수 있다. 유선 통신은, 예를 들어, USB(universal serial bus), HDMI(high definition multimedia interface), RS- 232(recommended standard 232) 또는 POTS(plain old telephone service) 중 적어도 하나를 포함할 수 있다. 여기서, 통신 네트워크는 컴퓨터 네트워크(computer network), 인터넷(internet), 사물 인터넷(internet of things) 또는 전화망(telephone network) 중 적어도 하나를 포함할 수 있다. 한 실시 예에 따르면, 사용자 단말과 서버 간의 통신을 위한 프로토콜(예: transport layer protocol, data link layer protocol 또는 physical layer protocol))은 애플리케이션, API, 미들웨어, 커널 또는 통신 인터페이스 중 적어도 하나에서 지원될 수 있다. 실시 예에서, 통신 인터페이스는 상기 프로세서의 제어에 따라 상기 다수의 홀로그램 이미지들(예, 도 2에서 10A, 10B, 10C 및 10D)에 부여된 번호들의 순서를 나타내는 정보를 서버로부터 수신할 수 있다. 실시 예에서, 프로세서 또는 프로세서에 의해 실행된 어플리케이션(또는 앱)은 상기 정보에 포함된 번호들의 순서에 따라 상기 다수의 홀로그램 이미지들을 결합(조합)하여 원본 보안 코드(예, 도 6의 10)를 복원 할 수 있다. 카메라는 프로세서 또는 프로세서에 의해 실행된 어플리케이션(또는 앱)의 제어에 따라 상기 홀 로그램 보안 코드(예, 도 6의 10')를 스캔하여 다수의 홀로그램 이미지들(예, 도 2의 10A, 10B, 10C 및 10D)을 획득할 수 있다. 실시 예에서, 카메라는 상기 홀로그램 보안 코드(예, 도 6의 10')를 사전에 결정된 스캔 방향으로 스캔하 여 상기 다수의 홀로그램 이미지들(예, 도 6의 10A, 10B, 10C 및 10D)을 획득할 수 있다. 모션 인식 센서는 상기 다수의 홀로그램 이미지들을 획득한 상기 카메라의 카메라 시점들에서 상기 사용자 단말의 모션 데이터를 측정할 수 있다. 여기서, 모션 데이터는 상기 사용자 단말의 현재 위치 값 및 자세값 등을 포함할 수 있다. 즉, 모션 데이터는 어떤 방향, 어떤 위치 또는/및 어떤 시점(view point)에 서 홀로그램 보안 코드를 스캔하는지를 알 수 있게 하는 측정치일 수 있다. 실시 예에서, 프로세서는 상기 측정된 모션 데이터에 따라 정의된 번호를 상기 다수의 홀로그램 이미지들 에 각각 부여하여, 각 홀로그램 이미지를 식별한다. 모션 데이터를 측정하기 위해, 모션 인식 센서는 가속도 센서, 자계 센서, 자이로 센서와 같이 사용자의 움직임에 따라서 상기 사용자 단말의 현재 위치값 및 자세값과 같은 변화하는 수치를 측정할 수 있는 모든 종류의 센서들을 포함할 수 있다. 도 7은 본 발명의 실시 예에 따른 홀로그램 보안 코드의 스캔 방법을 설명하기 위한 도면이고, 도 8은 본 발명 의 실시 예에 따른 사용자 단말을 통해 제공되는 스캔 방향의 안내 문구를 보여주는 도면이다. 도 7을 참조하면, 사용자는 사용자 단말의 카메라를 사전에 결정된 스캔 방향으로 천천히 움직이 면서 플레이트에 기록된 홀로그램 보안 코드를 스캔한다. 홀로그램 보안 코드가 기록된 플레이트은 특정 매질(예, 유리)로 이루어진 판 부재와 판 부재상에 코팅된 필름을 포함하며, 상기 필름에는 홀로그램 보안 코드가 기록된다. 광원으로부터 방출된 광(예, LED 광)을 상기 필름에 기록된 홀로그램 보안 코드에 조사하면, 서로 다른 시점(view point)에서 서로 다른 홀로그램 이미지들(예, 도 2의 10A, 10B, 10C 및 10D)을 시인할 수 있다. 따라서, 사용자 단말의 카메라는 정해진 스캔 방향으로 상기 필름에 기록된 홀로그램 보안 코드 를 스캔하면, 서로 다른 홀로그램 이미지들(예, 도 2의 10A, 10B, 10C 및 10D)을 획득할 수 있다. 카메라는 사용자 단말의 스캔 방향에 따라 실제 QR 코드값을 갖는 홀로그램 이미지들(10A, 10B, 10C 및 10D)을 획득할 수 있다. 이러한 스캔 방향은 사용자 단말에 설치된 앱의 실행이 되면, 사용자 단말 의 디스플레이를 통해 표시될 수 있다. 그러면, 사용자는 사용자 단말의 디스플레이를 통 해 표시되는 스캔 방향을 확인한 후 사용자 단말을 움직여서 홀로그램 보안 코드에 대한 스캐닝을 시작한 다. 스캔 방향에 의해 실제 QR 코드값을 갖는 홀로그램 이미지들을 획득할 수 있기 때문에, 스캔 방향은 보안측면에 서 중요한 정보들 중에 하나이고, 서버(도 1의 300)과 공유한다. 디스플레이를 통해 안내하는 스캔 방향은, 예를 들면, 위쪽에서 아래쪽으로 이동하는 방향, 아래쪽에서 위 쪽으로 이동하는 방향, 좌측에서 우측으로 이동하는 방향, 우측에서 좌측으로 이동하는 방향 등과 같이 다양하 게 결정될 수 있다. 도 8에서는 사용자 단말의 디스플레이를 통해 안내하는 스캔 방향의 안내 문구로 서, 예를 들면, \"위쪽에서 아래쪽으로 스캔해주세요\"와 같은 안내 문구가 디스플레이에 표시될 수 있다. 스캔 과정에서 획득한 각 홀로그램 이미지에는 사용자 단말의 모션 데이터(위치값 및/또는 자세값)에 따라 식별되는 번호가 부여된다. 예를 들면, 도 7에 도시된 바와 같이, 제1 채널(CH 1)의 홀로그램 이미지(10A)를 획 득한 시점(view point)에서 측정된 사용자 단말의 모션 데이터에 번호 '①'이 부여되고, 제2 채널(CH 2)의 홀로그램 이미지(10B)를 획득한 시점에서 측정된 사용자 단말의 모션 데이터에 번호 '②'가 부여되고, 제3 채널(CH 3)의 홀로그램 이미지(10C)를 획득한 시점에서 측정된 사용자 단말의 모션 데이터에 번호 '③'가 부여되고, 제4 채널(CH 4)의 홀로그램 이미지(10C)를 획득한 시점에서 측정된 사용자 단말의 모션 데이터 에 번호 '④'가 부여될 수 있다. 사용자 단말의 모션 데이터는 사용자 단말의 스캔 과정에서 사용자 단말이 어떤 시점(어떤 위치, 어떤 방향 및 어떤 자세)에서 홀로그램 보안 코드를 스캔했을 때 유효한 코드값(실제 QR 코드값(A, B, C 및 D))을 갖는 홀로그램 이미지를 획득할 수 있는지를 알려주는 중요 정보이다. 모션 데이터와 홀로그램 이미지에 부여되는 번호 사이의 매핑 관계는 사용자 단말과 서버가 사전에 공유하거나, 사용자 단말이 모션 데이터와 상기 모션 데이터에 따라 정의된 번호를 서버로 전송하여, 사용자 단말과 서버가 공유할 수도 있다. 도 9는 본 발명의 실시 예에 따른 원본 보안 코드의 복원 과정을 설명하기 위한 도면이다. 도 9를 참조하면, 복원 과정을 설명하기에 앞서, 제2 채널(CH 2)의 홀로그램 이미지(10B)에 번호 ①이 부여되고, 제3 채널(CH 3)의 홀로그램 이미지(10C)에 번호 ②가 부여되고, 제1 채널(CH 1)의 홀로그램 이미지 (10A)에 번호 ③이 부여되고, 제4 채널(CH 4)의 홀로그램 이미지(10D)에 번호 ④가 부연된 경우를 가정한다. 그 리고, 서버(도 1의 300)로부터 홀로그램 이미지들(10A~10D)의 결합(조합) 순서, 즉, 상기 번호들의 순서가 \"③ →①→②→④\"인 정보를 수신한 것으로 가정한다. 먼저, 카메라가 스캐닝하여 획득한 각 홀로그램 이미지에서 실제 코드값(예, QR 코드값)이 기록된 이미지 영역 을 추출한다. 예를 들면, 제2 채널(CH 2)의 홀로그램 이미지(10B)에서 실제 코드값이 기록된 이미지 영역(B)을 클리핑(clipping: 잘라 내기)하여 부분 이미지(B)을 추출하고, 제3 채널(CH 3)의 홀로그램 이미지(10C)에서 실 제 코드값이 기록된 이미지 영역을 클리핑하여 부분 이미지(C)을 추출하고, 제1 채널(CH 1)의 홀로그램 이미지 (10A)에서 실제 코드값이 기록된 이미지 영역(A)을 클리핑하여 부분 이미지(A)을 추출한다. 그리고, 제4 채널 (CH 4)의 홀로그램 이미지(10D)에서 실제 코드값이 기록된 이미지 영역(D)을 클리핑하여 부분 이미지(D)를 추출 한다. 클리핑 영역의 위치는 홀로그램 이미지들(10A~10D)의 결합(조합) 순서를 나타내는 정보에 포함되어 서버로 부터 제공되거나 사전에 약속된 규칙에 따라 결정될 수 있다. 예를 들면, 특정 모션 데이터에 의해 정의되는 시점(view point)에서 스캔한 홀로그램 이미지(예, 10B)에서는 그 홀로그램 이미지(예, 10B) 내에서 우측 상부 영 역의 이미지(예, B)를 클리핑 영역으로 사전에 정의하고, 다른 특정 모션 데이터에 의해 정의되는 시점에서 스 캔한 홀로그램 이미지(예, 10C)에서는 그 홀로그램 이미지(예, 10C) 내에서 좌측 하부 영역의 이미지(예, C)를 클리핑 영역으로 사전 정의할 수 있다. 각 홀로그램 이미지에서 추출한 부분 이미지들(B, C, A, D)는 서버로부터 수신된 결합(조합) 순서를 나타 내는 상기 번호들의 순서, \"③→①→②→④\"에 따라 결합(조합)될 수 있다. 예를 들면, 부분 이미지(B)는 우측 상부에 배치하고, 부분 이미지(C)는 좌측 하부에 배치하고, 부분 이미지(A) 는 좌측 상부에 배치하고, 부분 이미지(D)는 우측 하부에 배치한 후, 상기 부분 이미지들(B, C, A, D)을 결합 (조합)함으로써, 원본 보안 코드를 복원할 수 있다. 이후, 원본 보안 코드가 복원되면, 복원된 원본 보안 코드의 완전한 코드값을 읽어내기 위한 판독 과정 이 수행된다. 도 10은 본 발명의 실시 예에 따른 홀로그램 보안 코드를 판독하기 위한 방법을 설명하기 위한 흐름도로서, 도 4의 S420 내지 S440을 상세히 설명하기 위한 흐름도이다. 도 10을 참조하면, 먼저, S610에서, 사용자 조작에 따라 사용자 단말에 설치된 앱을 실행하는 과정이 수행 된다. 이어, S620에서, 앱이 디스플레이를 통해 스캔 방향을 안내하는 과정이 수행된다. 여기서, 스캔 방향은 사 전에 결정된 스캔 방향일 수 있으며, 매 판독시마다 주기적으로 변경될 수 있다. 이어, S630에서, 상기 사용자가 상기 디스플레이를 통해 안내하는 상기 스캔 방향에 따라 상기 사용자 단말을 움직이면서 홀로그램 보안 코드를 스캐닝하는 과정이 수행된다. 이어, 카메라가 서로 다른 시점들(view points)에서 스캔된 다수의 홀로그램 이미지들을 획득하는 과정이 수행된다. 여기서, 상기 다수의 홀로그램 이미지들을 획득한 이후 상기 프로세서가 각 홀로그램 이미지에 번호 를 부여한 후, 메모리에 상기 다수의 홀로그램 이미지들과 각 홀로그램 이미지에 부여된 번호를 매핑하여 저장할 수 있다. 실시 예에서, 상기 각 홀로그램 이미지에 번호를 부여하는 과정은 상기 사용자 단말의 모션 인식 센서가 각 홀로그램 이미지를 획득한 시점(view point)에서 상기 사용자 단말의 모션 데이터를 측정하는 과정과 상기 모션 데이터에 따라 정의된 번호를 각 홀로그램 이미지에 부여하는 과정을 포함할 수 있다. 이어, 사용자 단말 또는 프로세서가 상기 다수의 홀로그램 이미지들을 결합하여 원본 보안 코드를 복 원하는 과정이 수행된다. 실시 예에서, 상기 원본 보안 코드를 복원하는 과정은 상기 사용자 단말의 통신 인터페이스가 상기 서버로부터 상기 번호들의 순서를 나타내는 정보를 수신하는 과정과 상기 정보에 포함된 순서에 따라 상기 다수의 홀로그램 이미지들을 결합하여 상기 원본 보안 코드를 복원하는 과정을 포함할 수 있다. 이어, 사용자 단말 또는 프로세서가 상기 복원된 원본 보안 코드를 판독하는 과정이 수행된다. 이상 설명한 바와 같이, 본 발명은 보안 코드(예, QR 코드)를 하나의 이미지가 아니라 다수의 이미지를 하나의 매질에 기록하는 홀로그램 방식으로 제작함으로써, 이러한 홀로그램 형태의 보안 코드를 판독함에 있어서 적어 도 2개의 이미지를 조합해야만 QR 코드의 판독이 가능하기 때문에, 보안 코드의 복제 및 판독을 원천적으로 차 단할 수 있는 효과를 제공할 수 있다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10"}
{"patent_id": "10-2022-0176385", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시 예에 따른 홀로그램 제작 과정을 설명하기 위한 도면이다. 도 2는 도 1에 도시된 홀로그램 제작 과정을 구현하기 위한 홀로그램 제작 시스템의 개략적인 구성도이다. 도 3은 본 발명의 실시 예에 따른 홀로그램 제작 방법을 설명하기 위한 흐름도이다. 도 4는 도 3에 도시된 홀로그램 제작 방법에 의해 제작된 홀로그램 콘텐츠로서 홀로그램 보안 코드를 판독하기 위한 방법을 설명하기 위한 흐름도이다. 도 5는 본 발명의 실시 예에 따른 사용자 단말의 블록도이고, 도 6은 본 발명의 실시 예에 따른 다채널로 분리된 QR 코드의 예를 설명하기 위한 도면이다. 도 7은 본 발명의 실시 예에 따른 홀로그램 보안 코드의 스캔 방법을 설명하기 위한 도면이고, 도 8은 본 발명의 실시 예에 따른 사용자 단말을 통해 제공되는 스캔 방향의 안내 문구를 보여주는 도면이다. 도 9는 본 발명의 실시 예에 따른 원본 보안 코드의 복원 과정을 설명하기 위한 도면이다. 도 10은 본 발명의 실시 예에 따른 홀로그램 보안 코드를 판독하기 위한 방법을 설명하기 위한 흐름도이다."}
