{"patent_id": "10-2020-0108365", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0027472", "출원번호": "10-2020-0108365", "발명의 명칭": "인공신경망을 이용한 판매자의 공급가격 산출 방법 및 이를 이용한 온라인 상거래 중개 서비", "출원인": "주식회사 아이오앤코코리아", "발명자": "구석모"}}
{"patent_id": "10-2020-0108365", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "구매자 정보를 등록 받고 저장하는 구매자 정보 저장부;판매자 정보 및 상기 판매자의 판매 상품에 대한 판매상품정보를 등록 받고 저장하는 판매자 정보 저장부;상기 구매자에 대한 구매자 평가 정보 및 상기 판매자에 대한 판매자 평가 정보를 생성하는 평가 정보 생성부;상기 구매자의 구매 요청 상품에 대해 상기 판매자 정보 저장부에 등록되어 있는 정보를 기초로 제1공급 가격을산출하는 제1공급 가격 산출부; 및상기 구매 요청 상품에 대한 상기 구매자의 요구 항목 및 상기 요구 항목에 대한 상기 판매자 평가 정보를 기초로 추가되거나 감소될 수 있는 예상 보정 비용을 산출하고, 산출된 상기 예상 보정 비용을 상기 제1공급 가격에반영하여 제2공급 가격을 산출하는 제2공급 가격 산출부;를 포함하는 것을 특징으로 하는, 인공신경망을 이용한온라인 상거래 중개 서비스 제공 장치."}
{"patent_id": "10-2020-0108365", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,상기 제2공급 가격 산출부는,상기 구매 요청 상품 및 상기 구매 요청 상품에 대한 상기 구매자의 요구 항목들에 대해 미리 설정된 기준에 따라 서로 다른 가중치를 적용한 후, 상기 예상 보정 비용을 산출하는, 인공신경망을 이용한 온라인 상거래 중개서비스 제공 장치."}
{"patent_id": "10-2020-0108365", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항에 있어서,상기 제2공급 가격 산출부는,상기 구매 요청 상품에 대한 상기 구매자의 요구 항목마다 상기 구매자가 요구한 정도를 평가하여 요구 복잡도를 산출하고, 상기 요구 복잡도의 크기에 비례하여 상기 예상 보정 비용을 산출하는, 인공신경망을 이용한 온라인 상거래 중개 서비스 제공 장치."}
{"patent_id": "10-2020-0108365", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1항에 있어서,상기 제2공급 가격 산출부는,상기 구매 요청 상품에 대한 상기 구매자의 요구 항목에 대해 상기 판매자의 과거 이행 결과에 대한 평가 점수를 기초로 상기 예상 보정 비용을 산출하는, 인공신경망을 이용한 온라인 상거래 중개 서비스 제공 장치."}
{"patent_id": "10-2020-0108365", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4항에 있어서,상기 제2공급 가격 산출부는,상기 과거 거래 결과에 대한 평가 점수가 높을수록 상기 예상 보정 비용은 낮아지고, 상기 과거 거래 결과의 평가 점수가 낮을수록 상기 예상 보정 비용은 증가되도록 상기 예상 보정 비용을 산출하는 것을 특징으로 하는,인공지능을 이용한 온라인 상거래 중개 서비스 제공 장치."}
{"patent_id": "10-2020-0108365", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2022-0027472-3-제1항에 있어서,상기 제2공급 가격 산출부는,상기 구매 요청 상품에 대한 구매 정보 및 상기 판매자의 판매 정보와 상기 판매자의 평가 정보를 입력 정보로하고, 상기 예상 보정 비용을 출력 정보로 하는 기학습된 예상 가격 산출 인공신경망 모듈;을 포함하고,상기 예상 가격 산출 인공신경망 모듈은,상기 예상 보정 비용과 실제 발생한 보정 비용의 차이를 기초로 학습을 수행하는, 인공지능을 이용한 온라인 상거래 중개 서비스 제공 장치."}
{"patent_id": "10-2020-0108365", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6항에 있어서,상기 예상 가격 산출 인공신경망 모듈의 손실함수는,상기 예상 보정 비용의 항목마다 예상된 보정 비용과 실제로 상기 항목마다 발생한 보정 비용의 차이를 포함하고,상기 예상 가격 산출 인공신경망 모듈은,상기 손실함수의 값이 최소가 되도록 상기 예상 가격 산출 인공신경망 모듈의 파라미터를 업데이트 하는, 인공지능을 이용한 온라인 상거래 중개 서비스 제공 장치."}
{"patent_id": "10-2020-0108365", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "구매자 정보를 등록 받고 저장하는 단계;판매자 정보 및 상기 판매자의 판매 상품에 대한 판매상품정보를 등록 받고 저장하는 단계;상기 구매자에 대한 구매자 평가 정보 및 상기 판매자에 대한 판매자 평가 정보를 생성하는 단계;상기 구매자의 구매 요청 상품에 대해 상기 판매자 정보 저장부에 등록되어 있는 정보를 기초로 제1공급 가격을산출하는 단계;상기 구매 요청 상품에 대한 상기 구매자의 요구 항목 및 상기 요구 항목에 대한 상기 판매자 평가 정보를 기초로 추가되거나 감소될 수 있는 예상 보정 비용을 산출하는 단계; 및산출된 상기 예상 보정 비용을 상기 제1공급 가격에 반영하여 제2공급 가격을 산출하는 단계;를 포함하는 것을특징으로 하는, 인공신경망을 이용한 인공신경망을 이용한 판매자의 공급가격 산출 방법."}
{"patent_id": "10-2020-0108365", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "일 실시예에 따른 인공신경망을 이용한 온라인 상거래 중개 서비스 제공 장치는 구매자 정보를 등록 받고 저장하 는 구매자 정보 저장부, 판매자 정보 및 상기 판매자의 판매 상품에 대한 판매상품정보를 등록 받고 저장하는 판 매자 정보 저장부, 상기 구매자에 대한 구매자 평가 정보 및 상기 판매자에 대한 판매자 평가 정보를 생성하는 평가 정보 생성부, 상기 구매자의 구매 요청 상품에 대해 상기 판매자 정보 저장부에 등록되어 있는 정보를 기초 로 제1공급 가격을 산출하는 제1공급 가격 산출부 및 상기 구매 요청 상품에 대한 상기 구매자의 요구 항목 및 상기 요구 항목에 대한 상기 판매자 평가 정보를 기초로 추가되거나 감소될 수 있는 예상 보정 비용을 산출하고, 산출된 상기 예상 보정 비용을 상기 제1공급 가격에 반영하여 제2공급 가격을 산출하는 제2공급 가격 산출부를 포함할 수 있다."}
{"patent_id": "10-2020-0108365", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공신경망을 이용한 판매자의 공급가격 산출 방법 및 이를 이용한 온라인 상거래 중개 서비스 제공 장치에 관한 발명으로서, 보다 상세하게는 구매자가 판매자의 상품을 구매함에 있어서 추가적으로 발생할 수 있 는 예상 비용을 산출한 후, 매입 원가와 함께 예상 비용에 대한 정보를 제공해주는 기술에 관한 발명이다."}
{"patent_id": "10-2020-0108365", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적인 온라인 상거래 시스템 상의 오픈마켓의 개념은, 크게 일반 B2C(Business to Consumer) 쇼핑몰, 몰인몰 (입점형) 쇼핑몰, 오픈(마켓)몰, B2B(Business to Business), B2B2C(Business to Business to Consumer), B2G(Business to Goverment), M-커머스, C-커머스, T-커머스 쇼핑몰 등으로 분류된다. 이때, 일반 B2C 쇼핑몰 은 일반 소비자를 대상으로 운영자가 직접 상품 거래를 하는 형태이며, 몰인몰(입점형) 쇼핑몰은 일반 소비자를 대상으로 운영자 또는 입점한 판매자가 상품 거래를 하는 형태이며, 오픈(마켓)몰은 일반 소비자가 상품 구매와 판매를 하는 형태로 쇼핑몰 운영자에게 판매 위탁을 하는 형태인데 일반적인 결합쇼핑몰은 몰인몰(입점형) 쇼핑 몰과 오픈(마켓)몰의 위탁판매 기능을 결합한 형태를 의미한다.B2B는 쇼핑몰 운영자와 기업 간 거래를 하는 형태이며, B2B2C 는 쇼핑몰 운영자와 판매자가 기업 또는 소비자와 거래하는 형태이다. B2B은 특히, 상품을 중개하는 B2B 사업자가 B2B 전자상거래 중개 업체를 인터넷 상에 쇼핑몰로서 개설하고, 기 업 소비자와 기업 판매자를 회원사로 참여시켜 거래를 중개하여 이에 대한 거래 수수료를 기업 소비자 혹은 기 업 판매자로부터 징수하거나 또는 직접 매입 매출을 일으켜 마진을 얻는 모델이다. 이러한 B2B 시스템에서는 특정 상품을 구매하거나 용역 거래를 원하는 판매자가 상품거래를 위하여 한정되어 있 는 거래처 및 검색을 통한 견적서를 요청해서 가격을 해당 요청을 수령한 판매자(공급 업체)는 발주업체에게 작 성된 견적서를 발송하는 방식을 통해 예상 단가를 알아보거나, 판매자가 상품 거래를 위해 공개해 놓은 정보를 활용하여 예상 단가를 산출하는 방식 등으로 이루어지고 있다. 그러나, 이러한 종래의 입찰시스템은 한정된 업체들 사이에 정보 공유가 이루어짐으로써 견적서를 발행하고 계 약이 성립되는 데 많은 비용과 노력이 발생하고, 그에 비해 거래 성사가 신속하고 명확하게 이루어지지 않는, 이른바 고비용 저효율의 구조로 되어 있다. 또한, 기업과 기업 간의 거래의 경우 일반 소비자들과의 거래와 달리 대규모 상품을 거래하는 경우가 많다 보니, 이러한 특성상 초기 매입원가 뿐만 아니라 추후에 관리비, 판매비 및 유지 보수비 등 다양한 비용이 추가 적으로 많이 발생하게 된다. 그리고 이러한 추가비용은 어느 판매자를 통해서 구입을 하는지에 따라 다르고, 어느 상품을 구매했는지에 따라 다르며, 더 나아가 구매자가 구매하려고 하는 상품에 대한 요구사항이 어떤지에 따라 매번 다르게 발생하므로, 일률적으로 측정할 수 있는 방법이 존재하지 않았다. 따라서, 추가 비용을 단순히 구매자의 느낌만으로는 계산 하다 보니 실제 발생하는 비용과 예상 추가 비용이 일치하지 않아 비용 문제로 인한 많은 어려움이 존재하였으 며, 이로 인해 구매자와 판매자간에 분쟁이 발생하기도 하는 문제점이 존재하였다."}
{"patent_id": "10-2020-0108365", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 일 실시예에 따른 인공신경망을 이용한 판매자의 공급가격 산출 방법 및 이를 이용한 온라인 상거래 중 개 서비스 제공 장치는 상기 설명한 문제점을 해결하기 위해 고안된 발명으로서, 구매자가 판매자의 상품을 구 매함에 있어서 매입 원가를 제외하고 실제로 발생할 수 있는 예상 비용을 추가적으로 산출하여 구매자에게 제공 하는데 그 목적이 있다. 보다 구체적으로, 추가적으로 발생할 수 있는 예상 비용을 산출함에 있어서 구매자가 요구하는 항목들에 대한 판매자들의 과거 거래 내역을 기초로 한 평가 정보를 활용하여 판매자마다 발생할 수 있는 예상 비용을 보다 정 확하게 구매자에게 제공해주는 그 목적이 존재한다."}
{"patent_id": "10-2020-0108365", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시예에 따른 인공신경망을 이용한 온라인 상거래 중개 서비스 제공 장치는 구매자 정보를 등록 받고 저장 하는 구매자 정보 저장부, 판매자 정보 및 상기 판매자의 판매 상품에 대한 판매상품정보를 등록 받고 저장하는 판매자 정보 저장부, 상기 구매자에 대한 구매자 평가 정보 및 상기 판매자에 대한 판매자 평가 정보를 생성하 는 평가 정보 생성부, 상기 구매자의 구매 요청 상품에 대해 상기 판매자 정보 저장부에 등록되어 있는 정보를 기초로 제1공급 가격을 산출하는 제1공급 가격 산출부 및 상기 구매 요청 상품에 대한 상기 구매자의 요구 항목 및 상기 요구 항목에 대한 상기 판매자 평가 정보를 기초로 추가되거나 감소될 수 있는 예상 보정 비용을 산출 하고, 산출된 상기 예상 보정 비용을 상기 제1공급 가격에 반영하여 제2공급 가격을 산출하는 제2공급 가격 산 출부를 포함할 수 있다. 상기 제2공급 가격 산출부는, 상기 구매 요청 상품 및 상기 구매 요청 상품에 대한 상기 구매자의 요구 항목들 에 대해 미리 설정된 기준에 따라 서로 다른 가중치를 적용한 후, 상기 예상 보정 비용을 산출할 수 있다. 상기 제2공급 가격 산출부는, 상기 구매 요청 상품에 대한 상기 구매자의 요구 항목마다 상기 구매자가 요구한 정도를 평가하여 요구 복잡도를 산출하고, 상기 요구 복잡도의 크기에 비례하여 상기 예상 보정 비용을 산출할 수 있다. 상기 제2공급 가격 산출부는, 상기 구매 요청 상품에 대한 상기 구매자의 요구 항목에 대해 상기 판매자의 과거 이행 결과에 대한 평가 점수를 기초로 상기 예상 보정 비용을 산출할 수 있다. 상기 제2공급 가격 산출부는, 상기 과거 거래 결과에 대한 평가 점수가 높을수록 상기 예상 보정 비용은 낮아지 고, 상기 과거 거래 결과의 평가 점수가 낮을수록 상기 예상 보정 비용은 증가하는 것을 특징으로 하는, 인공지 능을 이용한 온라인 상거래 중개 서비스 제공 장치. 상기 제2공급 가격 산출부는, 상기 구매 요청 상품에 대한 정보 및 상기 판매자의 평가 정보를 입력 정보로 하 고, 상기 예상 보정 비용을 출력 정보로 하는 기학습된 예상 가격 산출 인공신경망 모듈을 포함하고, 상기 예상 가격 산출 인공신경망 모듈은 상기 보정 비용과 실제 발생한 보정 비용의 차이를 기초로 학습을 수행할 수 있다. 상기 예상 가격 산출 인공신경망 모듈의 손실함수는, 상기 예상 보정 비용의 항목마다 예상된 보정 비용과 실제 로 상기 항목마다 발생한 보정 비용의 차이를 포함하고, 상기 예상 가격 산출 인공신경망 모듈은, 상기 손실함 수의 값이 최소가 되도록 상기 예상 가격 산출 인공신경망 모듈의 파라미터를 업데이트 할 수 있다. 다른 실시예에 따른 인공신경망을 이용한 인공신경망을 이용한 판매자의 공급가격 산출 방법은 구매자 정보를 등록 받고 저장하는 단계, 판매자 정보 및 상기 판매자의 판매 상품에 대한 판매상품정보를 등록 받고 저장하는 단계, 상기 구매자에 대한 구매자 평가 정보 및 상기 판매자에 대한 판매자 평가 정보를 생성하는 단계, 상기 구매자의 구매 요청 상품에 대해 상기 판매자 정보 저장부에 등록되어 있는 정보를 기초로 제1공급 가격을 산출 하는 단계, 상기 구매 요청 상품에 대한 상기 구매자의 요구 항목 및 상기 요구 항목에 대한 상기 판매자 평가 정보를 기초로 추가되거나 감소될 수 있는 예상 보정 비용을 산출하는 단계 및 산출된 상기 예상 보정 비용을 상기 제1공급 가격에 반영하여 제2공급 가격을 산출하는 단계를 포함할 수 있다."}
{"patent_id": "10-2020-0108365", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "일 실시예에 따른 인공신경망을 이용한 판매자의 공급가격 산출 방법 및 이를 이용한 온라인 상거래 중개 서비 스 제공 장치는 구매자에게 상품에 대한 공급 가격을 제공함에 있어서, 매입 원가 뿐만 아니라 향후 발생될 수 있는 예상 보정 비용까지 포함한 공급 가격을 제공해주므로, 구매자가 실질적으로 발생될 수 있는 총 금액을 용 이하게 알 수 있는 효과가 존재한다. 따라서, 구매자는 상품 구매에 따른 예상 지출 비용을 보다 정확하게 예상 할 수 있어 비용 관리를 효율적으로 할 수 있으며, 판매자와 거래에 관하여 추가적으로 발생하는 비용으로 인한 분쟁 또한 사전에 예방할 수 있는 효과가 존재한다. 또한, 일 실시예에 따른 인공신경망을 이용한 판매자의 공급가격 산출 방법 및 이를 이용한 온라인 상거래 중개 서비스 제공 장치는, 구매자에게 매입원가에 해당하는 제1공급가격과 실제 발생할 수 있는 예상 보정 비용을 반영한 제2공급가격에 대한 정보를 같이 제공하기 때문에, 구매자는 보다 자신에게 맞는 판매자를 선택할 수 있 는 장점이 존재한다."}
{"patent_id": "10-2020-0108365", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명에 따른 실시 예들은 첨부된 도면들을 참조하여 설명한다. 각 도면의 구성요소들에 참조 부호를 부가함에 있어서, 동일한 구성요소들에 대해서는 비록 다른 도면 상에 표시되더라도 가능한 한 동일한 부호를가지도록 하고 있음에 유의해야 한다. 또한, 본 발명의 실시 예를 설명함에 있어, 관련된 공지 구성 또는 기능 에 대한 구체적인 설명이 본 발명의 실시예에 대한 이해를 방해한다고 판단되는 경우에는 그 상세한 설명은 생 략한다. 또한, 이하에서 본 발명의 실시 예들을 설명할 것이나, 본 발명의 기술적 사상은 이에 한정되거나 제한 되지 않고 당업자에 의해 변형되어 다양하게 실시될 수 있다. 또한, 본 명세서에서 사용한 용어는 실시 예를 설명하기 위해 사용된 것으로, 개시된 발명을 제한 및/또는 한정 하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 명세서에서, \"포함하다\", \"구비하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들 이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않 는다. 또한, 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"간접적으로 연결\"되어 있는 경우도 포함하며, 본 명세서에 서 사용한 \"제 1\", \"제 2\" 등과 같이 서수를 포함하는 용어는 다양한 구성 요소들을 설명하는데 사용될 수 있지 만, 상기 구성 요소들은 상기 용어들에 의해 한정되지는 않는다. 아래에서는 첨부한 도면을 참고하여 본 발명의 실시예에 대하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관계없는 부분은 생략한다. 도 1은 본 발명의 일 실시예에 따른 인공신경망을 이용한 공급자의 공급가격 산출 방법 및 이를 이용한 온라인 상거래 중개 시스템의 일부 구성 요소를 도시한 블럭도이다. 도 1을 참조하면, 일 실시예에 따른 온라인 상거래 중개 시스템은 구매자의 구매자 단말 장치, 판 매자의 판매자 단말 장치 및 공급가격 산출 장치를 포함하고 있는 중개 서비스 제공 장치 를 포함할 수 있으며, 중개 서비스 제공 장치는 다수의 구매자(300a, 300b)와 다수의 판매자(400a, 400b) 와 온라인으로 연결되어 운용될 수 있다. 도 1에서는 지면의 한계상 구매자와 판매자를 한정된 수로 기재하였으 나, 본 발명이 이로 한정되는 것은 아니고 더 많은 복수의 구매자와 판매자가 온라인 상거래 중개 시스템에 포함될 수 있다. 온라인 상거래 중개 시스템은 구매자 단말 장치와 중개 서비스 제공 장치 및 판매자 단말 장치 를 통해 구매자(310, Buyer)와 판매자(410, Seller) 사이에 상품 거래 계약의 체결을 유도하고, 이에 대한 정보를 모니터링할 수 있다. 일 실시예에 따라, 구매자는 각각 필요한 상품을 구매자 단말 장치를 통해 수량과 납기를 중개 서비 스 제공 장치에 등록하면 중개 서비스 제공 장치는 해당 상품을 판매 카테고리로 미리 등록한 판매자 의 판매자 단말 장치로 구매자의 상품 구매에 대한 견적 요청을 전달한다. 이후, 판매자 중 공급이 가능한 판매자가 존재하는 경우, 구매자가 요청하는 구매 정보에 대응되는 견적 정보를 생성하 여 중개 서비스 제공 장치에 전달하고, 중개 서비스 제공 장치는 이를 다시 구매자 단말 장치로 송신할 수 있다. 또한, 중개 서비스 제공 장치는 구매자의 견적 요청에 대한 정보를 판매자 단말 장치에게 송신 하지 않고, 중개 서비스 제공 장치에 등록되어 있는 판매자에 대한 판매 정보를 활용하여 구매자의 견적 요청에 대한 견적서를 생성하고, 생성한 견적 내용을 구매자 단말 장치로 송신할 수도 있다. 구매자 단말 장치는 구매자의 제어에 따라 중개 서비스 제공 장치에 접속할 수 있다. 구매자 단 말 장치는 중개 서비스 제공 장치에 접속하여 해당 시스템에 구매자에 대한 각종 정보 및 구매하고자 하는 상품에 대한 구매 정보 등을 입력할 수 있으며, 중개 서비스 제공 장치에 등록된 판매자 및 해당 판 매자의 정보를 검색할 수 있다. 또한, 구매자 단말 장치는 중개 서비스 제공 장치로부터 특정 상품을 판매하는 판매자에 대한 추천 받을 수 있다. 구매자 단말 장치는 구매자의 제어에 따라 특정 상품을 구매하기 위해 판매자를 선정 한 후, 중개 서비스 제공 장치에 구매 요청을 의뢰할 수 있다. 중개 서비스 제공 장치로부터 구매를 요청한 상품에 대한 견적 또는 특정 판매자에 대한 다양한 분석 결과를 수신하는 경우, 구매자 단말 장치 는 수신된 정보들을 구매자 단말 장치의 디스플레이 화면에 표시 할 수 있다.판매자 단말 장치는 판매자의 제어에 따라 중개 서비스 제공 장치에 접속하고, 판매자의 기본 정보 및 판매하려고 하는 상품에 대한 각종 정보를 입력할 수 있다. 따라서, 구매자 단말 장치 및 판매자 단말 장치에는 전용 어플리케이션 또는 범용 어플리케이션을 통 해 중개 서비스 제공 장치에 접속할 수 있는 모바일 단말 장치를 포함할 수 있는데 컴퓨팅 장치를 포함한 다. 예를 들어, PCS(Personal Communication System), GSM(Global System for Mobile communication), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W- Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말, 스마트폰(Smartphone), 스마트 패드(SmartPad), 태블릿 PC, 스마트와치(smart watch), 스마트 글라스(smart glass), 웨어러블 기기(wearable device) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수 있다. 중개 서비스 제공 장치는 구매자와 판매자를 연결하여 거래 계약이 생성되도록 구매자와 판매자를 중개하는 역할을 할 수 있으며, 중개 서비스 제공 장치는 일반적으로 서버로 구현될 수 있 다. 서버는 통상적인 서버를 의미하는 바, 서버는 프로그램이 실행되고 있는 컴퓨터 하드웨어로서, 프린터 제어나 파일 관리 등 네트워크 전체를 감시, 제어하거나, 메인프레임이나 공중망을 통한 다른 네트워크와의 연결, 데이 터, 프로그램, 파일 같은 소프트웨어 자원이나 모뎀, 팩스, 프린터 공유. 기타 장비 등 하드웨어 자원을 공유할 수 있도록 지원할 수 있다. 이러한 서버는 온라인 상거래 중개 시스템에 관련된 앱을 탑재하여 각각 구매자 단말 장치 및 판매자 단말 장치와 네트워크에 의하여 연결됨으로써 URL에 대응하는 인터넷 홈페이지를 관리하고, 단말 장치들(300, 400)의 요청에 따라 해당 URL에 연계된 인터넷 홈페이지 및 거래 내역, 거래 결과에 대한 정보 등을 출력할 수 있다. 중개 서비스 제공 장치는 구매자와 판매자와의 거래를 성사시키기 위해 구매자가 구매하려 고 하는 상품에 대해, 판매자가 입력한 정보를 기초로 예상 가격을 산출하여 산출된 가격 정보를 구매자 단말 장치로 송신하는 공급가격 산출 장치를 포함할 수 있다. 이하 도면을 통해 공급가격 산출 장치 에 대해 자세히 알아보도록 한다. 도2는 일 실시예에 따른 공급가격 산출 장치의 일부 구성 요소를 도시한 블럭도이다. 도 2를 참조하면, 공급가격 산출 장치는 저장부, 평가 정보 생성부, 공급가격 산출부 및 구매자/판매자 매칭부를 포함할 수 있으며, 저장부는 구매자 정보 저장부 및 판매자 정보 저장 부를 포함하고, 가격 산출부는 제1공급가격 산출부 및 제2공급가격 산출부 등을 포함할 수 있다. 구매자 정보 저장부에는 구매자에 대한 기본 정보, 구매자가 구입하려고 하는 상품에 대한 구매 정보를 구 매자로부터 입력 받아 저장될 수 있으며 구매자의 과거 거래 내역에 대한 평가 정보 등이 저장될 수 있다. 구매자에 대한 기본 정보는 구매자 등록을 요청하는 구판매자로부터 기본 정보를 입력 받아 저장할 수 있으며, 구매자에 대한 기본 정보는 구매자의 인적 및 신상 정보 등이 포함될 수 있다. 구매자가 구입하려고 하려는 상품에 대한 구매 정보는 구매자가 구매를 원하는 하는 상품의 구체적인 명칭, 상 품의 수량, 운송 방법, 요청 인도 기한 및 구매자가 특별하게 원하는 각종 요구 사항에 대한 정보 등이 포함될 수 있다. 또한, 구매자 정보 저장부에 등록되는 정보는 구매자가 선호하거나 주로 구입하는 상품에 대한 정보 또는 선호하는 스타일의 판매자에 대한 정보가 저장될 수 있다. 이러한 정보는 구매자 판매자 매칭부가 구매자 에게 추천 판매자 리스트를 제공할 때 기초 정보로 사용될 수 있다. 판매자 정보 저장부는 중개 서비스 제공 장치에 판매자 등록을 요청하는 판매자로부터 기본 정보를 입력 받아 해당 판매자에 대한 판매자 정보가 저장될 수 있다. 구체적으로, 판매자 정보 저장부에는 판매 자에 대한 기본적인 인적 정보와 신상 정보를 포함하는 판매자 정보와, 판매자가 팔고 있는 상품에 대한 판매자 판매 정보(상품의 명칭, 수량 당 가격, 재고, 운송 방법 등)등이 판매자로부터 입력 받은 후 저장될 수 있다. 또한, 구매자가 구매하려고 하는 상품에 대한 구매 정보(상품명, 수량, 운송 조건 등)을 중개 서비스 제공 장치 로 전송하여 구매자 정보 저장부에 저장된 경우, 중개 서비스 제공 장치에 등록되어 있는 복수 의 판매자는 해당 정보를 식별하여 구매자가 구입하려고 하는 상품에 대한 판매 가능 여부를 표기하고 구체적인 금액과 수량 정보를 포함하고 있는 견적 정보를 생성할 수 있다. 이렇게 생성된 정보는 판매자 정보 저장부 에 저장될 수 있다. 판매자 정보를 판매자 정보 저장부에 처음으로 등록하는 과정에서는 판매자는 판매자의 회사에 대한 재무 제표와 같은 기본적인 정보를 입력해야 한다. 등록된 판매자 정보는 중개 서비스 제공 장치 에서 거래 발 생 유무와 관계없이 회사 정보가 변경될 때 마다 즉시 반영되며, 거래가 발생한 경우 평가 정보 생성부가 생성한 판매자에 대한 판매자 평가 정보 또한 판매자 정보 저장부에 저장될 수 있다. 또한, 판매자 정보 저장부에 등록되는 정보에는 판매자가 선호하는 판매 상품에 대한 정보 또는 선호하는 구매자에 대한 정보 등이 저장될 수 있으며, 이렇게 수집된 정보는 추후 구매자/판매자 매칭부에서 판매자 에게 추천 구매자 정보를 제공할 때 기초 정보로 사용될 수 있다. 또한, 판매자 정보 저장부에 등록되는 정보는 판매자가 선호하거나 스타일의 구매자에 대한 정보가 저장될 수 있다. 이러한 정보는 추후 구매자 판매자 매칭부가 판매자에게 추천 구매자 리스트를 제공할 때 기초 정보로 사용될 수 있다. 평가 정보 생성부는 구매자와 판매자를 기준으로 미리 설정되어 있는 평가 항목 대상들에 대해 평가한 평 가 정보를 생성할 수 있으며, 생성된 평가 정보는 제2공급가격 산출부로 송신되어 제2공급가격 산출부 가 제2공급가격을 산출하는데 기초 정보가 될 수 있다. 제2공급가격 산출부가 제2공급가격을 산출하 는 구체적인 방법에 대해서는 후술하도록 한다. 평가 정보는 정적 평가 정보와 동적 평가 정보를 포함할 수 있으며, 정적 정보는 아직 온라인 상거래 중개 서비 스를 이용한 적이 없는 구매자 또는 판매자에 대한 평가 정보를 의미하고, 동적 정보는 구매자 또는 판매자가 온라인 상거래 중개 서비스를 이용한 결과가 있는 경우 온라인 상거래 중개 서비스 제공자 또는 거래 상대방이 평가 항목에 대한 평가한 정보를 의미한다. 정적 정보는 구매자를 기준으로 구매자 정적 정보와 구매자 동적 정보로 나뉘어 질 수 있으며, 동적 정보는 판 매자를 기준으로 판매자 정적 정보와 판매자 동적 정보로 나뉘어 질 수 있다. 구매자를 평가하는 평가 항목과 판매자를 평가하는 평가 항목은 동일한 항목도 존재하나, 그 특성에 맞춰 상이한 항목들도 존재한다. 구매자 정적 평가 정보는 아직 과거 거래 내역이 없는 구매자에 대한 평가 정보를 의미하므로, 온라인 상거래 중개 서비스를 제공하는 제공자가 미리 설정되어 있는 평가 항목들에 대해 구매자가 입력한 구매자 정보 및 구 매자가 상품 구입을 할 때 요구한 사항들을 분석하여 평가한 정보를 의미한다. 판매자 정적 평가 정보 또한, 아직 과거 거래 내역이 없는 판매자에 대한 평가 정보로서, 판매자가 입력한 판매 자 정보 및 판매자가 일반적으로 판매할 때 요구하는 사항에 대한 정보를 기초로 온라인 상거래 중개 서비스를 제공하는 제공자가 미리 설정되어 있는 평가 항목들에 대해 평가한 정보를 의미한다. 구매자 동적 평가 정보는, 온라인 상거래 중개 서비스를 이용한 결과를 기초로 온라인 상거래 중개 서비스를 제 공하는 제공자가 평가 항목에 대해 평가한 평가 정보 및 구매자와 거래를 진행한 판매자가 구매자와 거래한 내 용을 기초로 평가 항목에 대해 평가한 정보를 의미한다. 판매자 동적 평가 정보는, 온라인 상거래 중개 서비스를 이용한 결과를 기초로 온라인 상거래 중개 서비스를 제 공하는 제공자가 평가 항목에 대해 평가한 평가 정보 및 판매자와 거래를 진행한 판매자가 구매자와 거래한 내 용을 기초로 평가 항목에 대해 평가한 정보를 의미한다. 이하 명세서에서는 설명의 편의를 위해 구매자 동적 평 가 정보는 구매자 평가 정보로 지칭하여 설명하고, 판매자 동적 평가 정보는 판매자 평가 정보로 지칭하여 설명 하도록 한다. 평가 항목들은 구매자와 판매자가 거래를 함에 있어서 거래시 준수되어야 하는 항목 또는 거래 진행 상황에 따 라 비용이 추가되거나 또는 감소할 수 있는 요인을 포함하고 있는 항목을 의미한다. 다만, 상품을 구입하고자 하는 구매자와 상품을 판매하고자 하는 판매자의 특성상 상품의 가격에 영향을 미칠 수 있는 항목들이 모두 동 일한 것은 아니므로 성질이 다른 항목들을 각각 포함하고 있을 수 있다. 구체적으로, 판매자의 경우 판매하는 상품들을 구매자가 요구하는 항목들에 맞춰 잘 납품을 하였는지 여부가 주 평가 항목이 될 수 있다. 만약 판매자가 구매자가 요구하는 항목들을 잘 준수하였다면 추가 비용이 발생하지 않지만, 그렇지 않은 경우 추가적으로 비용이 발생할 가능성이 높기 때문이다. 따라서, 판매자 평가 항목들은, 구매자와 판매자가 거래를 함에 있어서 거래시 준수되어야 하는 항목 또는 거래 진행 상황에 따라 비용이 추가되거나 또는 감소할 수 있는 항목들을 의미하며, 크게 유통기한 항목, 화물 패킹 상태 항목, 및 운송 조건 항목으로 나뉘어 질 수 있다. 유통기한 항목은 유통기한을 준수하였는지 여부에 대한 항목으로서, 구매자가 구입하려고 하는 상품에 유통기한 이나 사용기한이 존재하는 경우 또는 판매자가 판매하는 상품들이 전체 사용기한 일 수 이에서 잔존율이 최소 70% 이상인 것을 의미할 수 있다. 화물 패킹 상태 항목은, 온라인 상거래 중개 서비스 제공자 또는 구매자가 요청하는 바에 따라 의 포장 구성을 준수했는지 여부에 대한 항목을 의미한다. 구체적으로, 구매자가 상품을 대량 구매하는 경우 상세한 패킹리스트 를 제공하는지 여부, 각 상품별 박스 수량 및 박스의 내품 수량 정보를 제공하는지 여부, 상품별 동일 유통기한 으로 동일 박스 내품으로 상품들을 제공하는지 여부, 팔레트 단위로 패킹 시 상품 단위로 구분하여 상품을 제공 하는지 여부, 물류센터에 즉시 적치 가능한 형태로 제공하는지 여부, 그 외 온라인 상거래 중개 서비스 제공자 혹은 구매자가 요청하는 사항을 준수하는 지 여부 등에 대한 항목을 포함할 수 있다. 운송 조건 항목은, 구매자 또는 온라인 상거래 중개 서비스 제공자 가 요청한 장소에 해당 상품들을 요청 시점 에 맞춰 제공하는지 여부를 의미하며, 운송 요청 시 상품비용 이외의 추가 운송 비용이 발생하는지 여부, 지정 일시에 맞춰 상품들을 운송하였는지 여부 등이 평가 항목에 포함될 수 있다. 앞서 설명한 판매자 평가 항목은 본 발명의 일 실시예에 불과할 뿐, 이로 한정되는 것은 아니고 온라인 중개 서 비스 제공자가 또는 구매자의 요청에 따라 추가적인 판매자 평가 항목이 발생할 수 있다. 판매자 평가 항목들에 대해서는 구매자 또는 온라인 중개 서비스 제공자가 True / False로 평가하며, 이에 따라 평가 항목 준수율에 대한 정보도 같이 생성될 수 있다. 예를 들어 A 판매자가 10회 거래를 하였는데 특정 항목 에 대해 요구하는 조건을 1회 만족시키지 못한 경우 해당 항목의 준수율을 90%로 평가될 수 있다. 이러한 평가 정보는 구매자와 판매자의 거래가 종료될 때마다 계속 수집이 되며, 이렇게 수집된 판매자에 대한 판매자 평가 정보는 판매자 정보 저장부에 저장될 수 있다. 판매자 평가 항목들에 대해서는 점수로 평가되어 점수 정보 또한 판매자 정보 저장부에 저장될 수 있다. 구매자에 대한 평가 항목의 경우, 구매자는 판매자와 다르게 비용을 지불하는 입장이므로 구매자의 평가 항목은 구매자의 요구 사항들이 얼마나 추가 비용을 발생시키는지 여부를 기준으로 정해진다. , 동일한 상품에 대해 동 일한 수량으로 구매 요청을 한 구매자들이 있더라도, 구매 상품에 대해 요구하는 사항이 많고 까다로운 경우 그 만큼 비용을 더 지출 해야 하기 때문에 구매자 평가 항목은 이러한 점을 고려해서 정해진다. 따라서, 구매자 평가 항목들은, 유통기한 항목, 상품별 수량 오차 허용 범위 항목, 상품 파손 허용 범위 항목, 패킹 형태 요구 항목 및 납품 조건 항목으로 나뉘어 질 수 있으며, 각각의 항목들에 대해 요구사항이 많은 정도 를 요구 복잡도라 지칭하며, 요구 복잡도가 증가할수록 동일 상품을 구매하더라도 그 만큼 발생되는 비용도 증 가하게 된다. 따라서, 요구 복잡도는 각각의 항목들마다 그 기준이 다르며, 온라인 중개 서비스 제공자가 입력 한 각각의 항목들에 대해 평균적인 조건을 기준으로 엄격한 조건을 구매자가 요구하는 경우 요구 복잡도의 크기 는 증가하며, 평균적인 조건보다 완화된 조건을 구매자가 요구하는 경우 요구 복잡도의 크기는 작아진다. 유통기한 항목은 일반적으로 구매자들은 상품별 생산일로부터 가장 빠른 제품을 요구하는 경우가 대부분이나, 그렇지 않고 동일한 생산제품만을 요구할 경우, 특정 시점에 생산된 제품을 요구할 경우, 특정 시점이후 혹은 이전에 생산된 제품을 요구할 경우, 상품별 유통기한 수량이 지정된 경우 또는 그 외 구매자가 일자를 기준으로 요청하는 사항이 많은 경우 유통기한 항목에 대해 요구 복잡도가 증가하게 된다. 상품별 수량 오차 허용 범위 항목은 대규모 제공 시 100% 수량 파악이 불가능하기 때문에 오차 부분은 사후 금 전적으로 보상하는 경우가 일반적이다. 그러나 그렇지 않고 100% 수량 일치 만을 허용하고 불일치시 전량 반품 을 요구하는 경우 상품별 수량 오차 허용 범위 항목에 대한 요구 복잡도는 증가하게 된다. 상품 파손 허용 범위 항목은, 운송 중 상품 파손 시 허용 가능한 범위가 없는 경우, 100% 모두 정상품이 아닐 경우 전량 반품을 요구하는 경우 상품 파손 허용 범위 항목에 대한 요구 복잡도가 증가하게 된다. 패킹 형태 요구 항목은, 구매자가 패킹 형태를 상세하게 요구하는 경우, 특정 박스에 포장을 요구하는 경우, 박 스에 라벨 혹은 식별에 필요한 별도 작업을 요구하는 경우에는 패킹 형태 요구 항목에 대한 요구 복잡도가 증가하게 된다. 납품 조건 항목은, 팔렛의 형태에 제한이 존재하는 경우, 납품 일시 및 납품 장소를 상세하게 요구하는 경우, 납품 기일로 지정된 일시가 상품 주문시 기준 촉박한 경우, 납품 장소로 지정한 장소로 상품을 납품하는 경우 일반적인 운송 비용에 비해 운송 비용이 증가하는 경우 납품 조건 항목에 대한 요구 복잡도가 증가하게 된다. 앞서 설명한 구매 평가 항목은 본 발명의 일 실시예에 불과할 뿐, 이로 한정되는 것은 아니고 온라인 중개 서비 스 제공자가 또는 구매자의 요청에 따라 추가적인 평가 항목이 발생할 수 있다. 구매자 평가 항목들에 대해서는 구매자 또는 온라인 중개 서비스 제공자가 True / False로 평가하며, 이에 따라 평가 항목 준수율에 대한 정보도 같이 생성될 수 있다. 이러한 구매자 평가 정보는 구매자와 판매자의 거래가 종료될 때마다 계속 수집이 되며, 구매자 평가 정보는 구매자 정보 저장부에 저장될 수 있다. 구매자 평가 항목들에 대해서는 점수로 평가되는 경우 점수 정보 또한 구매자 정보 저장부에 저장될 수 있다. 구매자 평가 항목의 평가와 판매자 평가 항목의 평가는 온라인 상거래 중개 서비스를 제공하는 제공자, 구매자 및 판매자가 동시에 실시하며 악의적 평가를 방지하고 평가 정보의 신뢰성을 확보하기 위해 제공자가 미리 설정 해 놓은 최소 평가 수 이상인 된 경우에만 공급가격 산출부에서 공급가격을 산출할 때 이용될 수 있다. 공 급가격 산출부는 미리 설정해 놓은 최소 평가 수가 되지 않은 경우 에는 동적 평가 정보를 활용할 수 는 없고 그 이전까지는 온라인 상거래 중개 서비스 제공자가 입력한 정적 정보가 공급가격을 산출하는데 이용이 된 다. 공급가격 산출부는 판매자가 공급하는 상품에 대한 가격을 산출하는 역할을 할 수 있으며, 제1공급가격 산 출부와 제2공급가격 산출부를 포함할 수 있다. 제1공급가격 산출부는 구매자가 구매를 원하는 상품에 구매 정보를 기준으로 판매자가 제시한 금액들을 반 영하여 가격을 산출할 수 있다. 구체적으로, 제1공급가격 산출부는 구매자가 요청한 상품에 대해 판매자 정보 저장부에 저장되어 있는 단가당 가격을 기준으로 제1공급가격을 산출할 수 있다. 제1공급가격은 매입 원가의 의미로 통용될 수 있다. 예를 들어, 구매자가 특정 상품 X에 대해 1,000개를 구매하기를 원하는 경우 제1공급가격 산출부는 판매 자 정보 저장부에 저장되어 있는 판매자들 중에서 상품 X를 판매하는 판매자들을 검색한 후, 상품 X를 판 매하는 판매자들이 판매자 정보 저장부에 저장해 놓은 상품 X 한 개당 판매하는 금액에 대한 정보를 기초 로 제1공급가격을 산출한다. 예를 들어 제1판매자가 개당 1,000원에 판매하는 경우 제1판매자에 대해서는 총 금 액을 1,000,000원으로 제1공급가격을 산출하고, 제2판매자는 개당 900원에 상품 X를 판매하는 경우 제2판매자에 대해서는 총 금액을 900,000원으로 제1공급가격을 산출한다. 제2공급가격 산출부는 구매자의 구매 요청 상품에 대한 구매자의 요구 항목들에 대해 판매자 평가 정보를 기초로 실제로 추가되거나 감소될 수 있는 예상 보정 비용을 산출하고, 산출된 예상 보정 비용을 제1공급 가격 에 반영하여 제2공급 가격을 산출할 수 있다. 기업과 기업 간의 거래의 경우 일반 소비자들과의 거래와 달리 대규모 상품을 거래하는 경우가 많다 보니, 실제 상품을 구입하는데 발생하는 비용이 초기 매입원가 뿐만 아니라 추후에 관리비, 판매비 및 유지 보수비 등 다양 한 비용이 추가적으로 많이 발생하게 된다. 그러나 이러한 추가비용은 어느 판매자를 통해서 구입을 하는지에 따라 다르고, 구매자가 상품마다 요구하는 요 구 사항이 다르기 때문에, 단순히 수량에 개당 가격을 곱해서 계산된 매입원가만을 기준으로 총 발생 비용을 산 출하면, 추후에 발생된 총 비용과 많이 어긋나는 문제점이 존재하였다. 따라서, 일 실시예에 따른 제2공급가격 산출부는 매입원가에 해당하는 제1공급가격에 구매자가 요구하는 요구 복잡도와 판매자의 평가 정보를 기초로 실제 추가적으로 발생되거나 감소될 수 있는 예상 보정 비용을 산 출하고, 예상된 보정 비용을 제1공급가격에 반영한 제2공급가격을 구매자에게 제공해주는바, 구매자가 보다 현 실적으로 지출될 수 있는 비용에 대한 정보를 제공 받을 수 있는 장점이 존재한다. 이하 도3을 통해 제2공급가 격을 산출하는 방법에 대해 자세히 알아본다. 도 3은 일 실시예에 따른 제2공급가격 산출부의 일부 구성 요소를 도시한 블럭도이다. 도 3을 참조하면, 일 실시예에 다른 제2공급가격 산출부는 요구 항목 결정부, 가중치 조정부, 요구 복잡도 산출부 및 예상 보정 비용 산출부 등을 포함할 수 있다. 도 3에서는 설명의 편의를 위해제2공급가격 산출부의 구성요소를 4개의 부로 분리하여 도시하였지만, 본 발명의 실시예가 이로 한정되는 것은 아니고 4개의 부가 하나의 부로서 제2공급가격 산출부로 실시될 수 있다. 요구 항목 설정부는 구매자가 구매하려고 하는 상품에 대해 구매 요청 정보를 분석하고 일반적으로 요구되 는 사항 이외에 구매자가 추가적으로 요구한 항목이 있는지 판단하고 결정할 수 있다. 요구 항목은 앞서 도 2에서 설명하였던 구매자 평가 항목에 기재되어 있는 평가 항목을 포함할 수 있다. 이에 대한 자세한 설명은 전술하였는바 생략하도록 한다. 가중치 조정부는 요구 항목 결정부에 의해 결정된 구매자의 요구 항목들에 대해 구매자 정보 저장부 에 저장되어 있는 구매자의 정보를 기초로 구매자의 요구 항목들에 대해 가중치를 설정한다. 예를 들어, 구매자의 과거 거래 정보에 의해 구매자가 운송 조건에 대해 요구하는 사항이 많았던 경우, 이 구매자는 운송 조건에 대해 엄격한 조건을 요구하는 구매자로 분류될 수 있으므로, 운송 조건 항목에 가중치를 높게 부여한다. 가중치를 높게 부연한다는 의미는 특정 항목에 대한 예상 발생 비용을 일반적인 경우보다 더 크게 산출한다는 것을 의미한다. 반대로 구매자의 과거 거래 정보에 비추어 보았을 때, 구매자가 패킹 조건에 대해서는 요구하는 사항이 적거나 없었던 경우, 패킹 조건에 대해서는 가중치를 낮게 부여할 수 있다. 가중치를 낮게 부연한다는 의미는 특정 항 목에 대한 예상 발생 비용을 일반적인 경우보다 낮게 산출한다는 것을 의미한다. 요구 복잡도 산출부는 구매 요청 상품에 대한 구매자의 요구 항목마다 구매자가 요구한 정도를 평가하여 요구 복잡도를 산출한다. 각각의 요구 항목마다 미리 설정해 놓은 일반적인 기준에 비해 공급자가 요구한 사항을 비교하여, 일반적인 요 구 사항보다 더 엄격한 조건을 요구한 경우 요구 복잡도는 높게 산출되며, 일반적인 요구 사항보다 더 완화된 조건을 요구한 경우 요구 복잡도는 낮게 산출된다. 예를 들어, 납품 조건 항목 중 납기 기일에 A 상품에 대해서는 통상적으로 1달이 소요되는데, 3주를 요구한 경 우 요구 복잡도는 평균보다 높게 산출되며, 2주를 요구한 경우 요구 복잡도는 더 증가하게 된다. 반대로 납기 기일을 2달로 요구한 경우 요구 복잡도는 평균보다 낮게 산출된다. 예상 보정 비용 산출부는 가중치 조정부 및 요구 복잡도 산출부에 생성된 정보를 기초로 추가되 거나 감소될 수 있는 예상 보정 비용을 산출하고, 산출된 예상 보정 비용을 제1공급가격에 반영하여 최종 공급 가격인 제2공급가격을 산출할 수 있다. 구체적으로, 예상 보정 비용 산출부는 가중치 조정부에 의해 특정 항목에 대해 가중치가 높게 부여된 경우, 그 항목에 대해서는 통상적으로 발생할 수 있는 비용보다 더 높은 가격을 측정하여 그 차이만큼 예상 보 정 비용을 산출한다. 반대로, 다른 특정 항목에 대해 가중치가 낮게 부여되고 그 결과, 그 항목에 대해서는 통 상적으로 발생할 수 있는 비용보다 적게 비용이 발생될 수 있는 경우에는 그 차이만큼 예상 보정 비용을 산출한 다. 전자의 경우 예상 보정 비용이 추가적으로 발생하는 비용으로 계산이 되나, 후자의 경우 예상 보정 비용은 최종 비용을 감소시키는 비용이 될 수 있다. 또한, 예상 보정 비용 산출부는 요구 복잡도 산출부에 의해 특정 항목에 대해 구매자가 높은 조건을 요구하여 요구 복잡도 값이 평균보다 높게 산출된 경우, 그 항목에 대해서는 통상적으로 발생할 수 있는 비용보 다 더 높은 가격을 측정하여 그 차이만큼 예상 보정 비용을 산출한다. 반대로, 다른 특정 항목에 대해 구매자가 낮은 조건을 요구하여 요구 복잡도 값이 평균보다 낮게 산출되고, 그 항목에 대해서는 통상적으로 발생할 수 있는 비용보다 적게 비용이 발생될 수 있는 경우에는 그 차이만큼 예상 보정 비용을 산출한다. 전자의 경우 예상 보정 비용이 추가적으로 발생하는 비용으로 계산이 되나, 후자의 경우 예상 보정 비용은 최종 비용을 감소시키는 비용이 될 수 있다. 또 다른 예로 구매자가 100% 수량이 일치하는 조건을 요구 항목으로 하였을 경우 판매자는 전체 검수 비용을 공 급 가격 이외에 별도로 구매자에게 청구할 수 있어 매입원가는 증가될 가능성이 높고 이러한 경우 판매자가 구 매자의 요구사항을 반영하지 못할 경우에 분쟁으로 이어질 가능성이 높다. 따라서, 예상 보정 비용 산출부(17 4)는 이러한 조건들을 고려하여 예상 보정 비용을 산출한 후, 산출한 예상 보정 비용을 제1공급가격에 포함시켜, 최종 금액인 제2공급가격을 산출할 수 있다.구매자는 매입원가인 제1공급가격 뿐만 아니라 향후 발생 될 수 있는 비용까지 포함한 제2공급각격을 예상할 수 있어 비용 관리를 효율적으로 할 수 있으며, 추후 발생되는 비용으로 인해 판매자와 발생할 수 있는 분쟁 또한 사전에 예방할 수 있는 효과가 존재한다. 또한, 예상 보정 비용 산출부는 예상 보정 비용을 산출함에 있어서, 판매자의 과거 거래 결과에 대한 평가 점수를 기초로 예상 보정 비용을 산출할 수 있다. 만약 판매자에 대한 과거 거래 결과에 대한 평가가 높은 경우 추가로 비용이 발생할 가능성이 낮으므로 예상 보정 비용은 낮게 산출되고, 과거 거래 결과의 평가 점수가 낮을 수록 추가로 비용이 발생할 가능성은 높으므로 예상 보정 비용은 높게 측정될 수 있다. 또한, 예상 보정 비용 산출부는 더 구체적으로 구매자의 요구 항목마다 판매자의 과거 거래 결과에 대한 평가 점수를 기초로 예상 보정 비용을 산출할 수 있다. 예를 들어, 구매자가 납기 기한에 대해 요구 조건을 엄 격하게 제시하였는데 A 판매자의 경우 납기 기한을 잘 지키지 못해 납기 기한 항목에 대한 평가 점수가 낮은 반 면, B판매자의 경우 납기 기한을 잘 지켜 납기 기한 항목에 대해 평가 점수가 높은 경우, A 판매자한테 물품을 구입하는 경우 납기 문제로 인해 비용이 더 발생될 가능성이 높으므로 A 판매자에 대한 예상 보정 비용은 B 판 매자에 대한 예상 보정 비용보다 더 높게 산출될 수 있다. 도 4는 일 실시예에 따라, 제1공급가격과 제2공급가격 정보가 제공되는 서비스의 일 화면을 도시한 도면이고, 도 5는 일 실시예에 따라, 제2공급가격에 영향을 미치는 항목들에 대한 정보가 표시되는 서비스의 일 화면을 도 시한 도면이다. 도 4는 구체적으로 구매자가 ABC 크림 100ML 에 대해 1,000개 수량에 대한 공급가격 견적 요청을 한 경우, 구매 자의 단말 장치에 표시되는 일 화면을 도시한 것이다. 도 4를 참고하면, 구매자가 구입하려고 하는 상품에 대해서는 총 4명의 판매자(SP01, SP02, SP03, SP04)에 대한 견적 가격에 대한 정보가 산출되었으며, 도 4에서 제1공급가격은 요청 수량에 개당 공급가격에 요청 수량 을 곱한 가격을 의미하며, 제2공급가격은 제1공급가역에 예상 보정 비용을 반영하여 산출한 가격이다. 견적 요청 목록을 보면, 판매자 SP04의 제1공급가격이 가장 높지만 예상 보정 비용을 반영한 제2공급가격은 가 장 낮기 산출되었기 때문에 구매자는 판매자 SP04와 거래를 진행하는 것이 구매자 입장에서 최소의 비용으로 거 래를 진행할 수 있다. 따라서, 일 실시예에 따른 공급가격 산출 장치는 매입원가에 해당하는 제1공급가격과 실제 발생할 수 있는 예상 보정 비용을 반영한 제2공급가격에 대한 정보를 같이 구매자에게 제공하기 때문에, 구매자는 보다 자신에 게 맞는 판매자를 선택할 수 있는 장점이 존재한다. 또한, 구매자에게 제공되는 서비스 화면에는 도 4에 도시된 바와 구매자가 요구한 요구사항에 대한 구체적인 정 보가 같이 제공되며, 상세보기 화면을 클릭하면 도 5에 도시된 바와 같이 제2공급가격에 영향을 미친 요소 들을 구체적으로 알 수 있다. 견적 상세 정보에는 제2공급가격에 대한 종합정보, 항목별 예상 요구 달성 비율에 대한 정보 및 항목별 예상 발생 보정 비용에 대한 정보가 포함되어 있다. 따라서, 구매자는 이러한 정보들을 참고로 하여 구매자의 요구 정보들을 변경하고 다시 새로운 견적을 받아 볼 수 도 있다. 또한, 제2공급가격 산출부는 예상 보정 비용을 인공신경망을 이용하여 산출할 수 도 있다. 이하 도6과 도7 을 통해 자세히 알아본다. 도 6과 도 7은 일 실시예에 따른 제2공급가격 산출 인공신경망 모듈에 입력되는 입력 정보와 출력되는 출력 정 보를 도시한 도면이다. 도 6과 도7를 참고하면, 제2공급각격 산출부는 제2공급각격 산출 인공신경망 모듈을 포함할 수 있으 며, 제2공급각격 산출 인공신경망 모듈은 구매 정보와 판매자 정보 및 판매자 평가 정보를 입 력 정보로 하고, 출력 정보를 예상 보정 비용으로 하는 기 학습된 인공신경망 모듈을 포함할 수 있다. 따라 서, 제2공급각격 산출 인공신경망 모듈은 입력 정보를 출력 정보를 추론하는 추론 세션과 입력 정보 및 피드백 정보를 기초로 학습을 수행하는 학습 세션을 포함할 수 있다. 구매 정보는 구매자가 구매하려고 하는 상품에 대한 명칭과 수량 및 요구 요건들에 대한 정보를 포함할 수 있으며, 판매자 정보는 판매자가 판매자 정보 저장부에 저장해 놓은 판매 상품에 대한 매입 원가 정보 를 포함하고, 판매자 평가 정보는 앞서 설명한 판매자 평가 항목들에 대해 온라인 중개 서비스 제공자 및 과거 거래를 진행한 구매자가 평가한 정보를 포함할 수 있다. 구체적으로, 제2공급각격 산출 인공신경망 모듈은 도 7에 도시된 바와 같이 구매 정보, 판매자 정보 및 판매자 평가 정보를 구성하는 각각의 속성은 x1, x2, x3와 같은 제2공급각격 산출 인공신경망 모듈의 입력층(input layer)의 각 노드에 입력되고, w1과 같은 weight을 기반으로 h1, h2, h3와 같은 은닉층 (hidden layer)의 컴퓨팅 이후에 softmax나 ReLU와 같은 cost function을 기반으로 예측되는 예상 보정 비용 가 y1인 출력층(output layer)에서 출력될 수 있다. 예상 보정 비용은 판매자 정보로 입력된 판매 자와 거래를 하는 경우 발생할 수 있는 비용에 대한 정보를 의미한다. 제2공급각격 인공 신경망 모듈은 도 9에 도시된 바와 같이 추천 판매자 정보 및 추천 판매자와의 실제 거래 평가 정보를 기초로 에러(error, -Sigma(yi log pi))를 줄이는 방향으로 은닉층의 weight를 업데이트 시키도록 Back propagation 할 수 있다. 피드백을 수행함에 있어서 손실함수를 이용하여 피드백을 수행할 수 있는데, 제2공급각격 산출 인공신경망 모듈 의 손실함수는 특정 판매자와 거래를 하였을 때 예상한 예상 보정 비용과 실제 발생 비용의 차이 의 절대값이 손실함수가 될 수 있다. 따라서, 제2공급각격 산출 인공신경망 모듈은 이러한 손실함수의 값 이 최소가 되도록 제2공급각격 산출 인공신경망 모듈의 파라미터를 업데이트 할 수 있다. 예를 들어, 구매자 A와 판매자 B를 기준으로 제2공급각격 산출 인공신경망 모듈이 추론한 예상 보정 비용 이 100만원이었는데, 실제 발생한 보정 비용이 70만원인 경우, 제2공급각격 산출 인공신경망 모듈이 추론 하는 예상 보정 비용이 더 증가하는 방향으로 제2공급각격 산출 인공신경망 모듈의 파라미터를 업데이 트하고, 반대로 실제 발생한 보정 비용이 120만원인 경우, 제2공급각격 산출 인공신경망 모듈이 추론하는 예상 보정 비용을 감소시키는 방향으로 제2공급각격 산출 인공신경망 모듈의 파라미터를 업데이트할 수 있다. 도 7과 도 8에서 설명한 바와 같이, 제2공급가격을 산출함에 있어서 인공신경망 모듈을 이용하여 예상 보정 비 용을 산출하는 경우, 기 학습된 인공신경망 구조를 이용하여 자동적으로 예상 보정 비용을 산출하므로, 서비스 제공자가 수동적으로 앞서 설명한 요구 복잡도 항목에 대대 각각 수동적으로 계산할 필요가 없는 효과가 존재한 다. 도 8과 도9는 본 발명의 일 실시예에 따라, 구매자/판매자 매칭 인공신경망 모듈에 입력되는 입력 정보와 출력 되는 출력 정보를 도시한 도면이다. 도 8과 도9를 참고하면, 구매자/판매자 매칭부는 구매자/판매자 매칭 인공신경망 모듈을 포함할 수 있으며, 구매자/판매자 매칭 인공신경망 모듈은 구매자 정보와 판매자 정보를 입력 정보로 하고, 출력 정보를 예상 평가 정보로 하는 기 학습된 인공신경망 모듈을 포함할 수 있다. 따라서, 구매자/판매자 매칭 인공신경망 모듈은 입력 정보를 출력 정보를 추론하는 추론 세션과 입력 정보 및 피드백 정보를 기초로 학습을 수행하는 학습 세션을 포함할 수 있다. 구체적으로, 도 9에 도시된 바와 같이 구매자 정보와 판매자 정보를 구성하는 각 속성은 x1, x2, x3와 같은 구매자/판매자 매칭 인공신경망 모듈의 입력층(input layer)의 각 노드에 입력되고, w1과 같은 weight을 기반으로 h1, h2, h3와 같은 은닉층(hidden layer)의 컴퓨팅 이후에 softmax나 ReLU와 같은 cost function을 기반으로 예측되는 예상 평가 정보가 y1인 출력층(output layer)에서 출력될 수 있다. 입력 정보인 구매자 정보는 구매자에 대한 기본 정보와 더불어 구매자의 평가 정보 등이 포함될 수 있으며, 판매자 정보 또한 판매자에 대한 기본 정보와 더불어 판매자에 대한 판매 상품 정보 및 판매자에 대한 평가 정보 등이 포함될 수 있다. 출력 정보인 예상 평가 정보는 입력정보의 기준이 되는 구매자와 판매자가 실제 거래를 하였을 때, 과거 거래 정보 등을 기초로 추론된 거래 예상 만족도에 대한 점수를 의미한다. 구매자/판매자 매칭 인공신경망 모듈은 구매자를 기준으로 최적의 판매자를 추론하며, 판매자를 기준으로 는 최적으로 구매자를 추론하는 인공신경망 모듈이다. 즉, 구매자/판매자 매칭 인공신경망 모듈은 구매자 를 기준으로 최적의 판매자를 추론하는 경우에는 특정 구매자에 대한 정보와 모든 판매자에 대한 정보를 각각 구매자/판매자 매칭 인공신경망 모듈에 입력한 후, 예상 만족도 점수를 산출하여 예상 평가 정보를 출 력할 수 있다. 예를 들어, 구매자가 10명이 있고 판매자가 10명이 있는 상황에서 A구매자를 기준으로 최적의 판매자를 매칭시 키고 싶은 경우, 판매자 10명에 대한 정보를 개별적으로 A구매자에 대한 구매자 정보와 함께 구매자/판매자 매 칭 인공신경망 모듈에 입력한 후, 추론된 예상 평가 정보 중에서 가장 높은 점수를 취득한 판매자를 A 구 매자에게 연결해줄 수 있다. 반대로, X 구매자를 기준으로 최적의 구매자를 매칭시키고 싶은 경우, 구매자 10명에 대한 정보를 개별적으로 X 판매자에 대한 판매자 정보와 함께 구매자/판매자 매칭 인공신경망 모듈에 입력한 후, 추론된 예상 평가 정보 중에서 가장 높은 점수를 취득한 구매자를 X판매자에게 연결해줄 수 있다. 한편, 구매자/판매자 인공 신경망 모듈은 도 9에 도시된 바와 같이 예상 평가 정보와 실제 거래 평가 정보를 기초로 에러(error, -Sigma(yi log pi))를 줄이는 방향으로 인공신경망 모듈의 은닉층의 weight를 업데이트 시키도록 Back propagation 할 수 있다. 피드백을 수행함에 있어서 손실함수를 이용하여 피드백을 수행할 수 있는데, 구매자/판매자 매칭 인공신경망 모 듈의 손실함수는 특정 판매자와 거래를 하였을 때 추론된 예상 평가 정보에 포함되어 있는 예상 만족 도에 대한 점수와 실제 거래 평가 정보에 포함되어 있는 실제 거래 만족도에 대한 점수의 차이가 될 수 있다. 따라서, 구매자/판매자 매칭 인공신경망 모듈은 이러한 손실함수의 값이 최소가 되도록 구매자/판매자 매 칭 인공신경망 모듈의 파라미터를 업데이트 할 수 있다. 지금까지 본 발명의 구성 및 특징에 대해 다양한 실시예를 통해 알아보았다. 일 실시예에 따른 인공신경망을 이용한 판매자의 공급가격 산출 방법 및 이를 이용한 온라인 상거래 중개 서비 스 제공 장치는 구매자에게 상품에 대한 견적 가격을 제공함에 있어서, 매입 원가 뿐만 아니라 향후 발생될 수 있는 예상 보정 비용까지 포함한 공급 가격을 제공해주므로, 실질적으로 발생될 수 있는 총 금액을 용이하게 알 수 있는 효과가 존재한다. 따라서, 물품 구매에 따른 비용 관리도 효율적으로 할 수 있으며, 추후 예상치 못한 이유로 발생되는 비용으로 인한 분쟁 또한 사전에 예방할 수 있는 효과가 존재한다. 또한, 일 실시예에 따른 인공신경망을 이용한 판매자의 공급가격 산출 방법 및 이를 이용한 온라인 상거래 중개 서비스 제공 장치는, 구매자에게 매입원가에 해당하는 제1공급가격과 실제 발생할 수 있는 예상 보정 비용을 반영한 제2공급가격에 대한 정보를 같이 제공하기 때문에, 구매자는 보다 자신에게 맞는 판매자를 선택할 수 있 는 장점이 존재한다. 한편, 본 명세서에 기재된 \"~부\"로 기재된 구성요소들, 유닛들, 모듈들, 컴포넌트들 등은 함께 또는 개별적이지 만 상호 운용 가능한 로직 디바이스들로서 개별적으로 구현될 수 있다. 모듈들, 유닛들 등에 대한 서로 다른 특 징들의 묘사는 서로 다른 기능적 실시예들을 강조하기 위해 의도된 것이며, 이들이 개별 하드웨어 또는 소프트 웨어 컴포넌트들에 의해 실현되어야만 함을 필수적으로 의미하지 않는다. 오히려, 하나 이상의 모듈들 또는 유 닛들과 관련된 기능은 개별 하드웨어 또는 소프트웨어 컴포넌트들에 의해 수행되거나 또는 공통의 또는 개별의 하드웨어 또는 소프트웨어 컴포넌트들 내에 통합될 수 있다. 특정한 순서로 작동들이 도면에 도시되어 있지만, 이러한 작동들이 원하는 결과를 달성하기 위해 도시된 특정한 순서, 또는 순차적인 순서로 수행되거나, 또는 모든 도시된 작동이 수행되어야 할 필요가 있는 것으로 이해되지 말아야 한다. 임의의 환경에서는, 멀티태스킹 및 병렬 프로세싱이 유리할 수 있다. 더욱이, 상술한 실시예에서 다양한 구성요소들의 구분은 모든 실시예에서 이러한 구분을 필요로 하는 것으로 이해되어서는 안되며, 기술된 구성요소들이 일반적으로 단일 소프트웨어 제품으로 함께 통합되거나 다수의 소프트웨어 제품으로 패키징될 수 있다는 것이 이해되어야 한다. 단말 장치 프로그램(프로그램, 소프트웨어, 소프트웨어 어플리케이션, 스크립트 또는 코드로도 알려져 있음)은 컴파일되거나 해석된 언어나 선험적 또는 절차적 언어를 포함하는 프로그래밍 언어의 어떠한 형태로도 작성될 수 있으며, 독립형 프로그램이나 모듈, 컴포넌트, 서브루틴 또는 단말 장치 환경에서 사용하기에 적합한 다른 유닛을 포함하여 어떠한 형태로도 전개될 수 있다. 부가적으로, 본 특허문헌에서 기술하는 논리 흐름과 구조적인 블럭도는 개시된 구조적인 수단의 지원을 받는 대 응하는 기능과 단계의 지원을 받는 대응하는 행위 및/또는 특정한 방법을 기술하는 것으로, 대응하는 소프트웨 어 구조와 알고리즘과 그 등가물을 구축하는 데에도 사용 가능하다. 본 명세서에서 기술하는 프로세스와 논리 흐름은 입력 데이터 상에서 작동하고 출력을 생성함으로써 기능을 수 행하기 위하여 하나 이상이 단말 장치 프로그램을 실행하는 하나 이상이 프로그래머블 프로세서에 의하여 수행 가능하다. 본 기술한 설명은 본 발명의 최상의 모드를 제시하고 있으며, 본 발명을 설명하기 위하여, 그리고 당업자가 본 발명을 제작 및 이용할 수 있도록 하기 위한 예를 제공하고 있다. 이렇게 작성된 명세서는 그 제시된 구체적인 용어에 본 발명을 제한하는 것이 아니다. 이상에서는 본 발명의 바람직한 실시예를 참조하여 설명하였지만, 해당 기술 분야의 숙련된 당업자 또는 해당 기술 분야에 통상의 지식을 갖는 자라면, 후술될 특허청구범위에 기재된 본 발명의 사상 및 기술 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수정 및 변경시킬 수 있음을 이해할 수 있을 것이다. 따라서, 본 발명의 기술적 범위는 명세서의 상세한 설명에 기재된 내용으로 한정되는 것이 아니라 특허청구범위 에 의해 정해져야 할 것이다."}
{"patent_id": "10-2020-0108365", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 온라인 상거래 시스템의 일부 구성 요소를 도시한 블럭도이다. 도2는 일 실시예에 따른 공급가격 산출 장치의 일부 구성 요소를 도시한 블럭도이다. 도 3은 일 실시예에 따른 제2공급가격 산출부의 일부 구성 요소를 도시한 블럭도이다. 도 4는 일 실시예에 따라, 제1공급가격과 제2공급가격 정보가 제공되는 서비스의 일 화면을 도시한 도면이다. 도 5는 일 실시예에 따라, 제2공급가격에 영향을 미치는 항목들에 대한 정보가 표시되는 서비스의 일 화면을 도 시한 도면이다. 도 6과 도 7은 일 실시예에 따른 제2공급가격 산출 인공신경망 모듈에 입력되는 입력 정보와 출력되는 출력 정 보를 도시한 도면이다. 도 8과 도 9는 일 실시예에 따른 구매자/판매자 매칭 인공신경망 모듈에 입력되는 입력 정보와 출력되는 출력 정보를 도시한 도면이다."}
