{"patent_id": "10-2021-0055007", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0149795", "출원번호": "10-2021-0055007", "발명의 명칭": "지능형 워크플로우 기반의 스마트병원 관리 시스템", "출원인": "주식회사 메디컬에이아이", "발명자": "권준명"}}
{"patent_id": "10-2021-0055007", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "환자의 진단과 처방과 검사결과와 검진정보와 수술정보의 임상데이터를 저장하는 제1웨어하우스;의료기관 운영과 관련된 원무와 자산과 인사와 구매와 재무의 운영데이터를 저장하는 제2웨어하우스;상기 임상데이터와 상기 운영데이터를 전송받아 정형데이터의 용어를 표준화된 데이터로 변환하는 용어 표준화부;상기 임상데이터와 상기 운영데이터를 전송받아 비정형데이터 및 반정형데이터를 구조화하여 정제하는 데이터정제부;상기 표준화된 데이터 및 상기 정제된 데이터를 조합하여 통합데이터로 저장하는 제3웨어하우스; 및미리 생성된 특정 워크플로우를 통해, 상기 통합데이터를 입력으로 하여 특정 결과를 도출하는 분석부;를 포함하는,지능형 워크플로우 기반의 스마트병원 관리 시스템."}
{"patent_id": "10-2021-0055007", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 용어 표준화부는 상기 임상데이터 및 상기 운영데이터의 용어를 국제 표준 임상헬스케어 용어체계에 따라표준화하는것을 특징으로 하는,지능형 워크플로우 기반의 스마트병원 관리 시스템."}
{"patent_id": "10-2021-0055007", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 용어 표준화부는 상기 임상데이터 및 상기 운영데이터의 내용을 영문 형태소기법을 적용하여 형태소를 추출하고, 상기 추출된 형태소 중 명사를 추출해 사전화하고, 언어학적인 규칙을 적용하여 상기 제3웨어하우스의용어표준코드와 매핑시켜서, 상기 용어표준코드에 상응하는 용어로 표준화하는 것을 특징으로 하는,지능형 워크플로우 기반의 스마트병원 관리 시스템."}
{"patent_id": "10-2021-0055007", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 데이터 정제부는 정형데이터를 행과 열의 테이블형태로 변환하며, 비정형데이터의 패턴찾기 또는 텍스트마이닝을 통해 정제하여 테이블형태로 변환하고, 반정형데이터를 전처리하고 구조화하여 정제하여 테이블형태로변환하는 것을 특징으로 하는,지능형 워크플로우 기반의 스마트병원 관리 시스템."}
{"patent_id": "10-2021-0055007", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2022-0149795-3-제4항에 있어서,상기 데이터 정제부는, 수치 범위를 한정하는 반정형데이터의 경우, 수치 범위를 특정 범주에 매칭시켜 특정 범주로의 귀속여부를 구분하여 정형데이터를 변환하여 정제하는 것을 특징으로 하는,지능형 워크플로우 기반의 스마트병원 관리 시스템."}
{"patent_id": "10-2021-0055007", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 분석부의 워크플로우는 자동예약시스템, 병실배정추천시스템, 최적화 진료협력시스템, 근무종합시스템, 물류관리시스템에 구현되는 것을 특징으로 하는,지능형 워크플로우 기반의 스마트병원 관리 시스템."}
{"patent_id": "10-2021-0055007", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은, 환자의 진단과 처방과 검사결과와 검진정보와 수술정보의 임상데이터를 저장하는 제1웨어하우스 , 의료기관 운영과 관련된 원무와 자산과 인사와 구매와 재무의 운영데이터를 저장하는 제2웨어하우스 , 임상데이터와 운영데이터를 전송받아 정형데이터의 용어를 표준화된 데이터로 변환하는 용어 표준화부 , 임상데이터와 운영데이터를 전송받아 비정형데이터 및 반정형데이터를 구조화하여 정제하는 데이터 정제 부, 표준화된 데이터 및 정제된 데이터를 조합하여 통합데이터로 저장하는 제3웨어하우스, 및 미리 생 성된 특정 워크플로우를 통해, 통합데이터를 입력으로 하여 특정 결과를 도출하는 분석부를 포함하여서, 임 상데이터와 운영데이터를 통합한 통합 데이터로 생성하여 사용가치를 높일 수 있는, 지능형 워크플로우 기반의 스마트병원 관리 시스템을 개시한다."}
{"patent_id": "10-2021-0055007", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 임상데이터와 운영데이터를 조합하여 통합데이터로 생성하여서, 용어체계를 통합하여 모든 의료기관 에서 공통적으로 사용할 수 있는 분석데이터로서 통합데이터의 사용가치를 높일 수 있는, 지능형 워크플로우 기 반의 스마트병원 관리 시스템에 관한 것이다."}
{"patent_id": "10-2021-0055007", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "통상, 헬스케어는 임상데이터뿐만 아니라 병원 운영, 경제적 평가, 환자 안전 등의 임상 외적인 데이터가 중요 한 부분을 차지한다. 그러나, 현재의 헬스케어 데이터는 임상데이터 웨어하우스(Clinical Data Warehouse) 관련사업에만 편중해 실효 적 결과를 거두기 어렵다. 이에, 효과적인 의료기관 운영, 안전한 의료 수행, 의료 품질 관리 등의 질환 외적인 기술개발도 절실히 필요하고, 이를 바탕으로 병원 운영 자동화로 헬스케어 서비스 산업을 확장할 수 있다. 한편, 국내에서는 중앙정부주도로 공공빅데이터 활용 서비스를 제공하고 있지만, 이와 같은 플랫폼들은 진료 데 이터 종류와 범위가 협소하며, 민간 병원의 구체적인 진료 정보가 부재하고, 임상과 연관된 데이터를 목적으로 하고 있다. 또한, 비식별데이터를 제공하여 단면조사분석만 가능한데, 다시 말해 특정 데이터가 어떤 사람의 것인지 알 수 없기 때문에 그 사람이 시간이 지남에 따라 어떻게 변화하는 지 등의 연구가 불가능하다. 또한, 국내에서 의료 빅데이터 사업은 상급종합병원 중심으로 이루어지고 있기 때문에 국내 의료의 90%를 차지 하는 중소병원의 데이터를 활용하지 못한 채 반쪽짜리 데이터만 축적되고 있으며, 상급종합병원뿐만 아니라 중 소병원을 포함한 국가 전체의 데이터를 구축하는 것은 정확한 연구와 실효성 있는 성과를 위한 필수적인 요소이 다. 이에, 임상데이터와 운영데이터를 하나의 데이터 웨어하우스로 통합하여 운영하여서, 특정 병원에서 특정 데이 터를 활용하고 분석할 수밖에 없는 한계를 극복할 수 있는 기술이 요구된다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국 등록특허공보 제10-0538577호 (의료 정보의 전산 표준화 방법, 2005.12.22) (특허문헌 0002) 한국 공개특허공보 제10-2017-0061251호 (병원정보 기반의 환자 맞춤형 의료정보 제공 시스템,"}
{"patent_id": "10-2021-0055007", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "2017.06.05) 발명의 내용"}
{"patent_id": "10-2021-0055007", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 사상이 이루고자 하는 기술적 과제는, 임상데이터와 운영데이터를 조합하여 통합데이터로 생성하여서, 용어체계를 통합하여 모든 의료기관에서 공통적으로 사용할 수 있는 분석데이터로서 통합데이터의 사용가치를 높일 수 있는, 지능형 워크플로우 기반의 스마트병원 관리 시스템을 제공하는 데 있다."}
{"patent_id": "10-2021-0055007", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "전술한 목적을 달성하고자, 본 발명의 실시예는, 환자의 진단과 처방과 검사결과와 검진정보와 수술정보의 임상 데이터를 저장하는 제1웨어하우스; 의료기관 운영과 관련된 원무와 자산과 인사와 구매와 재무의 운영데이터를 저장하는 제2웨어하우스; 상기 임상데이터와 상기 운영데이터를 전송받아 정형데이터의 용어를 표준화된 데이 터로 변환하는 용어 표준화부; 상기 임상데이터와 상기 운영데이터를 전송받아 비정형데이터 및 반정형데이터 를 구조화하여 정제하는 데이터 정제부; 상기 표준화된 데이터 및 상기 정제된 데이터를 조합하여 통합데이터 로 저장하는 제3웨어하우스; 및 미리 생성된 특정 워크플로우를 통해, 상기 통합데이터를 입력으로 하여 특정 결과를 도출하는 분석부;를 포함하는, 지능형 워크플로우 기반의 스마트병원 관리 시스템을 제공한다. 여기서, 상기 용어 표준화부는 상기 임상데이터 및 상기 운영데이터를 국제 표준 임상헬스케어 용어체계에 따라 용어를 표준화할 수 있다. 또한, 상기 용어 표준화부는 상기 임상데이터 및 상기 운영데이터의 내용을 영문 형태소기법을 적용하여 형태소 를 추출하고, 상기 추출된 형태소 중 명사를 추출해 사전화하고, 언어학적인 규칙을 적용하여 상기 제3웨어하우 스의 용어표준코드와 매핑시켜서, 상기 용어표준코드에 상응하는 용어로 표준화할 수 있다. 또한, 상기 데이터 정제부는 정형데이터를 행과 열의 테이블형태로 변환하며, 비정형데이터의 패턴찾기 또는 텍 스트 마이닝을 통해 정제하여 테이블형태로 변환하고, 반정형데이터를 전처리하고 구조화하여 정제하여 테이블 형태로 변환할 수 있다. 또한, 상기 데이터 정제부는, 수치 범위를 한정하는 반정형데이터의 경우, 수치 범위를 특정 범주에 매칭시켜 특정 범주로의 귀속여부를 구분하여 정형데이터를 변환하여 정제할 수 있다. 또한, 상기 분석부의 워크플로우는 자동예약시스템, 병실배정추천시스템, 최적화 진료협력시스템, 근무종합시스 템, 물류관리시스템에 구현될 수 있다."}
{"patent_id": "10-2021-0055007", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하면, 임상데이터와 운영데이터를 조합하여 통합데이터로 생성하여서, 용어체계를 통합하여 모든 의료기관에서 공통적으로 사용할 수 있는 분석데이터로서 통합데이터의 사용가치를 높이며, 용어 표준화 및 규 격화를 통해 의료기관의 규모와 상관없이 헬스케어 연구자료로 활용하도록 하고, 통합데이터의 관리 및 활용에 필요한 인력 및 비용을 줄이도록 할 수 있고, 헬스케어 빅데이터 분석자료를 사용할 수 있고, 상급병원중심의 빅데이터 구축 및 인공지능 개발에서 탈피하여 의료빈부격차, 필수 의료소외지역 발생, 의료정보의 불평등의 문 제를 해결할 수 있는 효과가 있다."}
{"patent_id": "10-2021-0055007", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조로 전술한 특징을 갖는 본 발명의 실시예를 더욱 상세히 설명하고자 한다. 본 발명의 실시예에 의한 지능형 워크플로우 기반의 스마트병원 관리 시스템은, 환자의 진단과 처방과 검사결과 와 검진정보와 수술정보의 임상데이터를 저장하는 제1웨어하우스, 의료기관 운영과 관련된 원무와 자산과 인사와 구매와 재무의 운영데이터를 저장하는 제2웨어하우스, 임상데이터와 운영데이터를 전송받아 정형데 이터의 용어를 표준화된 데이터로 변환하는 용어 표준화부, 임상데이터와 운영데이터를 전송받아 비정형데 이터 및 반정형데이터를 구조화하여 정제하는 데이터 정제부, 표준화된 데이터 및 정제된 데이터를 조합하 여 통합데이터로 저장하는 제3웨어하우스, 및 미리 생성된 특정 워크플로우를 통해, 통합데이터를 입력으 로 하여 특정 결과를 도출하는 분석부를 포함하여서, 임상데이터와 운영데이터를 통합한 통합 데이터로 생 성하여 사용가치를 높이는 것을 요지로 한다. 이하, 도 1 내지 도 4를 참조하여, 전술한 구성의 지능형 워크플로우 기반의 스마트병원 관리 시스템을 구체적 으로 상술하면 다음과 같다. 우선, 제1웨어하우스는 환자의 진단과 처방과 검사결과와 검진정보와 수술정보와 X선 촬영정보와 MRI 정보 와 초음파정보와 본스캔 정보 등의 정형, 비정형 또는 반정형의 임상데이터(임상 의료 데이터)를 저장하는 CDW(Clinical Data Warehouse)이다. 다음, 제2웨어하우스는 의료기관 운영과 관련된 원무와 자산과 인사와 구매와 재무의 운영데이터(병원 운 영 데이터)를 저장하는 EDW(Enterprise Data Warehouse)이다. 여기서, 임상데이터 또는 운영데이터는 의료인의 입력에 의해 전송되어 저장되거나 의료장비로부터 전송되어 저 장되고, 이후 각 데이터 조건에 맞는 처리 프로세스를 거쳐 제3웨어하우스에 통합되어 저장될 수 있는데, 처리 프로세스는 후술하는 용어 표준화부 또는 데이터 정제부에 의해 수행될 수 있다. 한편, 용어 표준화부에 선행하는 전처리부(미도시)를 통해, 임상데이터 또는 운영데이터의 유효성을 검사 하여 유효한 임상데이터 또는 운영데이터만을 후속하는 용어 표준화부 또는 데이터 정제부로 제공할 수 있다. 예컨대, 임상데이터 또는 운영데이터에 포함된 비문, 상관도도 낮은 데이터, 또는 유효한 시기가 경 과한 데이터 등을 필터링하여 임상데이터 또는 운영데이터의 질을 높이도록 할 수도 있다. 또한, 용어 표준화부에 선행하는 개인정보 비식별화부(미도시)를 통해, 임상데이터 또는 운영데이터에 포 함된 개인정보를 비식별화하여 개인정보유출을 방지하도록 할 수도 있다. 다음, 용어 표준화부는 임상데이터와 운영데이터를 각각 전송받아 정형데이터의 용어를 표준화된 데이터로 변환하여 표준화한다. 여기서, 용어 표준화부는 임상데이터 및 운영데이터의 용어를 SNOMED-CT 등의 국제 표준 임상헬스케어 용 어체계에 따라 표준화할 수 있다. 예컨대, 용어 표준화부는, 임상데이터의 용어가 국제 표준 임상헬스케어 용어체계에 어긋날 경우, 국제 표 준 임상헬스케어 용어체계 내에서 표준화하고, 운영데이터의 용어는 국제 표준 임상헬스케어 용어체계와 맞지 않는 경우 국제 표준 임상헬스케어 용어체계 내에서 표준화할 수 있다. 구체적으로, 도 3에 예시된 바와 같이, 용어 표준화부는 임상데이터(예를 들면, 의무기록지에 기록된 처방 (description)의 내용) 및 운영데이터의 내용을 영문 형태소기법(Lemmatizer)을 적용하여 형태소를 추출하고, 추출된 형태소 중 명사를 추출해 사전화하고, 언어학적인 규칙(Linguistic Rule)을 적용하여 제3웨어하우스 의 용어표준코드와 매핑시켜서, 용어표준코드에 상응하는 용어로 표준화할 수 있다. 참고로, SNOMED CT는 국제적으로 가장 포괄적이며 다중언어를 지원하는 임상 헬스케어 용어체계로 간주되며, 임 상 문서와 보고서에 사용되는 코드와 용어와 동의어와 정의를 제공하도록 체계적으로 구조화되어 전산적으로 처 리가능한 의학용어(medical term)의 집합이다. 다음, 데이터 정제부는 임상데이터와 운영데이터를 전송받아 비정형데이터 및 반정형데이터를 구조화하고 정제하여 정형데이터로 변환하여서, 제3웨어하우스에 용어 표준화부에 의해 표준화된 정형데이터와 통합되어 저장되도록 할 수 있다. 참고로, 비정형데이터는 그림, 영상, 문서처럼 형태와 구조가 복잡해 정형화되지 않은 데이터를 이르고, 반정형 데이터는 정형데이터처럼 행과 열의 테이블로 구조화되어 있지는 않지만, 여러 전처리를 통해 테이블의 형식으 로 쉽게 변형할 수 있는 데이터를 이른다. 여기서, 데이터 정제부는 정형데이터를 행과 열의 테이블형태로 변환하며, 영상, 병리학, 유전체검사, 이 미지 등 비정형데이터의 패턴찾기 또는 텍스트 마이닝을 통해 정제하여 테이블형태로 변환하고, 반정형데이터를 전처리하고 구조화하여 정제하여 테이블형태로 변환할 수 있다. 한편, 반정형데이터의 변환에 있어서, 데이터 정제부는, 수치 범위를 한정하는 반정형데이터의 경우, 수치 범위를 특정 범주에 매칭시켜 특정 범주로의 귀속여부를 구분하여 정형데이터를 변환하여 정제할 수 있다. 예컨대, “<0.1” 와 같이 적힌 반정형데이터는 <0.1, 0.1< & <0.3, 0.3< 등과 같은 범주를 특정한 후에, 각 범 주마다 0, 1, 2, 3...과 같은 값으로 매칭시켜 특정 범주에 속하는지 속하지 않는지로 구분해서 정형데이터와 같이 사용하도록 할 수 있다. 다음, 제3웨어하우스는 용어 표준화부에 의해 표준화된 데이터 및 데이터 정제부에 의해 정제된 데이터를 조합하여 통합데이터로 저장하여서, 데이터의 관리 및 활용에 필요한 인력 및 비용을 줄이도록 할 수 있다. 여기서, 제3웨어하우스로 전송된 표준화된 데이터와 정제된 데이터는 드래그 앤 드롭(drag & drop)방식으 로 사용자가 원하는 조합으로 통합데이터를 생성할 수 있다. 다음, 분석부는 특정 목적을 위해 미리 생성된 특정 워크플로우를 통해서, 제3웨어하우스의 통합데이 터를 입력으로 하여 이에 상응하는 특정 결과를 도출하여서, 동일한 특정 목적을 위한 특정 결과를 지속적으로 도출하도록 할 수 있다. 여기서, 분석부의 워크플로우는 자동예약시스템, 병실배정추천시스템, 최적화 진료협력시스템, 근무종합시 스템, 물류관리시스템에 구현될 수 있다. 한편, 워크플로우는 규칙기반 모델 또는 기계학습 모델일 수 있으며, 통합데이터는 규칙기반 모델 또는 기계학 습 모델에 입력되어 자동예약, 병실배정추천, 최적화 진료협력, 근무관리, 물류관리 등의 최적의 결과를 도출할수 있다. 예컨대, 도 4의 (a)를 참고하면, 워크플로우로 임상데이터 및 운영데이터 기반 병실배정추천 모델이 적용되는 경우, 제3웨어하우스에 감염 진단, 감염 증상 여부, 연령, 성별, 진료과 등 사용자가 선별한 통합데이터 목록을 병실배정추천 모델에 입력값으로 입력하여, 결과값으로 특정 환자가 입원하기 적절한 병실 또는 병상을 추천해주도록 하여, 의료기관은 병실과 병상을 효율적으로 관리할 수 있다. 또는, 도 4의 (b)를 참고하면, 워크플로우로 의료질 향상(QI, Quality Improvement) 활동추천 모델이 적용되는 경우, 사용자가 선별한 통합데이터 목록을 QI 활동추천 모델에 입력값으로 입력하여, 결과값으로 검사대기시간 을 줄여야 한다든지, 원내 감염질환 발생률이 높으니 특별히 관리해야 한다든지 등의 의료기관에 필요한 QI 활 동이 무엇인지 추천해주도록 할 수 있다. 또한, 도 2를 참고하면, 워크플로우로, 침구점검과 신포괄 수가제와 간호간병과 감염감시와 적정성 평가 등의 의료 행정과 관련된 모델, 검사예약과 물류관리와 근무관리와 병상추천 등의 병원 운영과 관련된 모델, 및 처방 오류와 QI추천과 수술결과와 마약관리 등의 환자 안전과 관련된 모델이 포함될 수 있다. 다음, 시각화부는 전술한 워크플로우를 거쳐 도출된 결과값을 수치, 그래프, 표, 테이블 등의 다양한 형식 으로 시각화하여 구현할 할 수 있고, 각 의료기관의 디스플레이 등의 시각화장치에 맞춰 커스터마이징될 수 있 다. 따라서, 전술한 바와 같은 지능형 워크플로우 기반의 스마트병원 관리 시스템에 의해서, 임상데이터와 운영데이 터를 조합하여 통합데이터로 생성하여서, 용어체계를 통합하여 모든 의료기관에서 공통적으로 사용할 수 있는 분석데이터로서 통합데이터의 사용가치를 높이며, 용어 표준화 및 규격화를 통해 의료기관의 규모와 상관없이 헬스케어 연구자료로 활용하도록 하고, 통합데이터의 관리 및 활용에 필요한 인력 및 비용을 줄이도록 할 수 있 고, 헬스케어 빅데이터 분석자료를 사용할 수 있고, 상급병원중심의 빅데이터 구축 및 인공지능 개발에서 탈피 하여 의료빈부격차, 필수 의료소외지역 발생, 의료정보의 불평등의 문제를 해결할 수 있다. 본 명세서에 기재된 실시예와 도면에 도시된 구성은 본 발명의 가장 바람직한 일 실시예에 불과할 뿐이고, 본 발명의 기술적 사상을 모두 대변하는 것은 아니므로, 본 출원 시점에 있어서 이들을 대체할 수 있는 다양한 균 등물과 변형예들이 있을 수 있음을 이해하여야 한다."}
{"patent_id": "10-2021-0055007", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 의한 지능형 워크플로우 기반의 스마트병원 관리 시스템의 개략적인 구성도를 도시 한 것이다. 도 2는 도 1의 지능형 워크플로우 기반의 스마트병원 관리 시스템의 구현도를 예시한 것이다. 도 3은 도 1의 지능형 워크플로우 기반의 스마트병원 관리 시스템의 용어 표준화부에 의한 형태소 추출 및 매핑 을 각각 예시한 것이다. 도 4는 도 1의 지능형 워크플로우 기반의 스마트병원 관리 시스템의 워크플로우를 예시한 것이다."}
