{"patent_id": "10-2023-7018030", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0098274", "출원번호": "10-2023-7018030", "발명의 명칭": "차량 조명 디바이스의 작동 방법 및 차량 조명 디바이스", "출원인": "발레오 비젼", "발명자": "엘 아이디리시 하피드"}}
{"patent_id": "10-2023-7018030", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "적어도 제1 조명 모듈(1) 및 제2 조명 모듈(2)을 포함하는 차량 조명 디바이스(10)를 작동시키는 방법으로서 -상기 조명 모듈 각각은 고체 상태 광원(3)을 포함함 - , 상기 제1 조명 모듈(1)에 공급되는, 제1 플럭스 평균 값을 가진 제1 예비 전류 프로파일(11)을 제공하는단계와, 상기 제1 예비 전류 프로파일(11)과 연관된 제1 예비 디레이팅(derating) 시간(21)을 추정하는 단계와, 상기 제2 조명 모듈(2)에 공급되는, 제2 플럭스 평균 값을 가진 제2 예비 전류 프로파일(12)을 제공하는단계와, 상기 제2 예비 전류 프로파일과 연관된 제2 예비 디레이팅 시간(22)을 추정하는 단계 - 상기 제2 예비 디레이팅시간(22)은 상기 제1 예비 디레이팅 시간(21)보다 김 - 와, 상기 제1 플럭스 평균 값의 0.96배보다 낮은 플럭스 평균값을 제공하는 제1 전류 프로파일(11')을 상기 제1 조명 모듈(1)에 공급하는 단계와, 상기 제2 플럭스 평균 값의 1.04배보다 높은 플럭스 평균값을 제공하는 제2 전류 프로파일(12')을 상기 제2 조명 모듈(2)에 공급하는 단계를 포함하는 방법."}
{"patent_id": "10-2023-7018030", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 제1 전류 프로파일(11') 및 상기 제2 전류 프로파일(21')은, 제1 전류 값으로 시작해서 사전 결정된 상태에 도달하면 상기 전류 값을 증가시키는 것을 포함하는, 방법."}
{"patent_id": "10-2023-7018030", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 차량 센서로부터 정보를 획득하는 머신 학습 알고리즘에 의해 상기 제1 전류값을 획득하는 단계가 수행되는, 방법."}
{"patent_id": "10-2023-7018030", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항 내지 제3항 중 어느 한 항에 있어서, 광원 온도를 획득하는 단계를 더 포함하고, 상기 방법의 나머지 단계들은, 상기 광원 온도가 사전 결정된 값에 도달하면 트리거되는,방법."}
{"patent_id": "10-2023-7018030", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항 내지 제4항 중 어느 한 항에 있어서, 상기 제1 전류 프로파일(11')은 상기 제1 플럭스 평균 값의 0.94배보다 낮은 플럭스 평균 값을 제공하고, 더 구체적으로 상기 제1 플럭스 평균 값의 0.91배보다 낮은 플럭스 평균 값을 제공하는, 공개특허 10-2023-0098274-3-방법."}
{"patent_id": "10-2023-7018030", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항 내지 제5항 중 어느 한 항에 있어서, 상기 제2 전류 프로파일(12')은 상기 제2 플럭스 평균 값의 1.06배보다 높은 플럭스 평균 값을 제공하고, 더 구체적으로 상기 제1 플럭스 평균 값의 1.09배보다 높은 플럭스 평균 값을 제공하는, 방법."}
{"patent_id": "10-2023-7018030", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항 내지 제6항 중 어느 한 항에 있어서, 상기 제1 예비 디레이팅 시간을 추정하는 것 및/또는 상기 제2 예비 디레이팅 시간을 추정하는 것은, 트레이닝데이터세트로 사전에 트레이닝된 인공 지능 알고리즘을 이용해서 수행되는, 방법."}
{"patent_id": "10-2023-7018030", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 인공 지능 알고리즘은 리지 회귀(ridge regression) 알고리즘을 포함하는, 방법."}
{"patent_id": "10-2023-7018030", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항 내지 제8항 중 어느 한 항에 있어서, 상기 제1 전류 프로파일(11')을 상기 제1 조명 모듈(1)에 공급하는 것과 상기 제2 전류 프로파일(12')을 상기제2 조명 모듈(2)에 공급하는 것은 동시에 수행되지 않고, 상기 제1 전류 프로파일의 공급이 먼저 수행되고, 시간 차를 두고, 상기 제2 전류 프로파일의 공급이 두번째로 수행되는, 방법."}
{"patent_id": "10-2023-7018030", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항 내지 제9항 중 어느 한 항에 있어서, 상기 제1 조명 모듈은 하향등 모듈이고, 상기 제2 조명 모듈은 상향등 모듈인, 방법."}
{"patent_id": "10-2023-7018030", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항 내지 제10항 중 어느 한 항에 있어서, 상기 방법의 단계들은 대응하는 조명 모듈의 광원의 적어도 10%에 적용되는,방법."}
{"patent_id": "10-2023-7018030", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "차량 조명 디바이스로서, 복수의 고체 상태 광원(3)을 포함하는 제1 조명 모듈(1)과, 복수의 고체 상태 광원(3)을 포함하는 제2 조명 모듈(2)과,제1항 내지 제11항 중 어느 한 항에 따른 방법의 단계를 수행하는 제어 요소(4)를 포함하는 차량 조명 디바이스. 공개특허 10-2023-0098274-4-청구항 13 제14항에 있어서, 상기 고체 상태 광원의 온도를 측정하기 위한 서미스터(5)를 더 포함하는 차량 조명 디바이스."}
{"patent_id": "10-2023-7018030", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 차량 조명 디바이스의 동작 방법을 제공하며, 이는 제1 예비 전류 프로파일을 제공하는 단계, 제1 예 비 전류 프로파일과 연관된 제1 예비 디레이팅 시간을 계산하는 단계, 제2 예비 전류 프로파일을 제공하는 단계, 제2 예비 전류 프로파일과 연관된 제2 예비 디레이팅 시간을 계산하는 단계, 제1 조명 모듈에 제1 예비 전류량보 다 낮은 총 전류량을 제공하는 제1 전류 프로파일을 공급하는 단계, 및 제2 조명 모듈에 제2 예비 전류량보다 높 은 총 전류량을 제공하는 제2 전류 프로파일을 공급하는 단계를 포함한다."}
{"patent_id": "10-2023-7018030", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 차량 조명 디바이스 분야에 관한 것으로서, 보다 상세하게는 이들 조명 디바이스에 포함되는 이들 광 원의 온도 제어에 관한 것이다."}
{"patent_id": "10-2023-7018030", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "디지털 조명 디바이스는 차량 제조업체에서 미들 마켓 제품 및 하이 마켓 제품에 점점 더 채택되고 있다. 이들 디지털 조명 디바이스는 일반적으로 고체 상태 광원을 포함하며, 그 작동은 온도에 의해 크게 좌우된다. 이들 요소의 온도 제어는 매우 민감한 측면이 있으며, 온도 제어는 디레이팅(derating)에 의해 수행되는데, 이 는 일반적으로 광원에 공급되는 전류 값을 감소시켜서 출력 플럭스 및 작동 온도가 감소되게 하는 것을 의미한 다. 이 때문에 과열 문제에 대응하기 위해 광원의 성능이 과도하게 커져야 하고, 따라서 작동 값은 허용 가능한 값을 유지하면서도 감소될 수 있다."}
{"patent_id": "10-2023-7018030", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "구동 상태에 관계없이 헤드 램프를 최적의 성능으로 유지하는 것은 매우 어렵다. 종종 하나의 조명 모듈이 다른 조명 모듈보다 빠르게 가열되고, 이 헤드 램프의 높은 내부 온도로 인해서 나머지 조명 모듈에 악영향을 미친다. 한 조명 모듈이 디레이팅될 때 나머지 모듈은 아직 디레이팅 임계값에 도달하지 않았음에도 허용 가능 한 균질성을 보장하기 위해서 나머지 모듈도 영향을 받기 때문에, 이러한 현상은 바람직한 것이 아니다."}
{"patent_id": "10-2023-7018030", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이 문제는 지금까지는 추정되어 왔으며, 이에 대한 해결책이 제공된다. 본 발명은, 본 발명에 따른 차량 조명 디바이스 및 차량 조명 디바이스를 작동시키는 방법에 의해 차량 조명 디 바이스의 광원의 온도를 관리하는 대안의 해결 방안을 제공한다. 본 발명의 바람직한 실시예는 종속 청구항에 정의되어 있다. 별도로 정의되지 않는 한, 본원에서 사용되는 모든 용어(기술 및 과학 용어를 포함)는 본 발명이 속하는 기술 분야에서 관례적인 것으로 해석되어야 한다. 또한, 통상적으로 사용되는 용어는 또한 관련 기술에서 관례적인 것으로 해석되어야 하며, 본원에서 명백하게 정의되지 않는 한, 이상화되거나 지나치게 형식적인 의미로 해석되 어서는 안 된다는 것을 이해할 것이다. 본문에서, 용어 \"포함한다\" 및 그 파생어(\"포함하는\" 등)는 배제의 의미로 이해되어서는 안되며, 즉, 이들 용어 는 설명되고 정의된 것이 추가의 요소, 단계 등을 포함할 수 있을 가능성을 배제하는 것으로 해석되어서는 안된 다. 제1 본 발명의 양상에서, 본 발명은 적어도 제1 조명 모듈 및 제2 조명 모듈을 포함하는 차량 조명 디바이스를 작동시키는 방법을 제공하며, 조명 모듈 각각은 고체 상태 광원을 포함하고, 이 방법은, 제1 조명 모듈에 공급되는, 제1 플럭스 평균 값을 가진 제1 예비 전류 프로파일을 제공하는 단계와, 제1 예비 전류 프로파일과 연관된 제1 예비 디레이팅 시간을 추정하는 단계와, 제2 조명 모듈에 공급되는, 제2 플럭스 평균 값을 가진 제2 예비 전류 프로파일을 제공하는 단계와, 제2 예비 전류 프로파일과 연관된 제2 예비 디레이팅 시간을 추정하는 단계 - 제2 예비 디레이팅 시간은 제1 예 비 디레이팅 시간보다 김 - 와, 제1 플럭스 평균 값의 0.96배보다 낮은 플럭스 평균값을 제공하는 제1 전류 프로파일을 제1 조명 모듈에 공급하 는 단계와, 제2 플럭스 평균 값의 1.04배보다 높은 플럭스 평균값을 제공하는 제2 전류 프로파일을 제2 조명 모듈에 공급하 는 단계를 포함한다. 계산된 제2 예비 디레이팅 시간이 제1 예비 디레이팅 시간보다 길다는 것은 두 조명 모듈 모두에 대해 예비 디 레이팅 시간이 계산된다는 것을 의미하며, 제1 조명 모듈은 디레이팅 시간이 더 짧은 모듈이고 제2 조명 모듈은 디레이팅 시간이 더 긴 모듈이다. 당업계에서, 제1 모듈의 예비 디레이팅 시간은 전체 조명 디바이스의 성능에 악영향을 줄 것인데, 이는 제2 조 명 모듈이 디레이팅될 필요가 없음에도 불구하고 제2 조명 모듈이 디레이팅되게 하기 때문이다. 그러나, 본 발 명의 방법에서, 제2 조명 모듈의 디레이팅 시간이 제2 예비 디레이팅 시간보다 짧으면, 제1 조명 모듈의 디레이 팅 시간을 증가시킨다. 따라서 전체 디레이팅 시간이 연장되어서 플럭스 균질성을 유지하면서 더 긴 시간 동안 우수한 성능을 얻을 수 있다. 전류 프로파일의 높은 변동으로 인해, 조명 모듈들의 디레이팅 시간의 차이가 보상될 수 있다. 이 방법은 추정 된 디레이팅 시간들 사이의 차이가 클 때 특히 바람직하다. 몇몇 특정 실시예에서, 제1 전류 프로파일 및 제2 전류 프로파일은 제1 전류 값으로 시작해서 사전 결정된 상태 에 도달하면 전류 값을 증가시키는 것을 포함한다. 이 방식을 통해서 제1 전류 프로파일 및 제2 전류 프로파일은, 각 순간에 필요한 최소 전류를 제공하도록 최적 화되며, 필요한 경우 전류를 증가시킬 수 있다. 몇몇 특정 실시예에서, 차량 센서로부터 정보를 획득하는 머신 학습 알고리즘에 의해 상기 제1 전류값을 획득하 는 단계가 수행된다. 머신 학습 알고리즘은 차량의 다양한 센서로부터 정보를 획득하고, 선호도가 낮은(less favourable) 조명 모듈 에 대한 최대 디레이팅 시간을 획득하기 위해서 다양한 상황에서 트레이닝 및 테스트된다. 이 머신 학습 알고리즘은 클라우드에 위치되거나 혹은 차량의 제어 유닛에 내장될 수 있다. 몇몇 특정 실시예에서, 차량 센서는, 온도 센서, 차량 속도 센서, 지오포지셔닝 센서, 및 레이더나 라이더 센서 중 적어도 일부를 포함한다. 몇몇 특정 실시예에서, 사전 결정된 상태는, 측정된 광속(luminous flux) 값이 대응하는 플럭스 임계값 아래로 떨어진다는 점을 포함한다. 광속 값은 중요한 파라미터이지만, 조명 디바이스 작동에 대한 정보를 제공하는 유일한 파라미터는 아니다. 광 속으로 전류 값을 제어하면 총 조명 모듈의 허용 가능한 작동을 보장한다. 몇몇 특정 실시예에서, 이 방법은 광원 온도를 획득하는 단계를 더 포함하고, 여기서 사전 결정된 상태는 광원 온도가 사전 결정된 값에 도달한다는 점을 포함한다. 전류를 제어하는 다른 호환 가능한 방법은, 광속의 간접적인 데이터를 제공할 수 있는 온도를 사용하는 것이다. 몇몇 특정 실시예에서, 사전 결정된 상태는 시간 제한에 도달했다는 것을 포함한다. 전류를 제어하는 다른 방법은 타이머를 사용하여 시간에 따른 온도 변화를 추정하는 것이다. 이 경우 데이터를 측정할 필요가 없으며 전류는 자동으로 증가된다. 이것은 시간 패턴이 확고하게 확립되었을 때 수행될 수 있다. 몇몇 특정 실시예에서, 전류 값을 증가시키는 단계는 전류 값을 제1 값으로부터 제2 값으로 증가시키는 것을 포 함하고, 제2 값은 제1 값보다 크지만 제1 값의 1.1배보다는 낮고, 특히 제1 값의 1.05배보다 낮으며, 특히 제1 값의 1.03배보다는 낮다. 이들 예에서, 전류가 작은 범위에서 증가되어서, 전류 값(및 온도)은 허용 가능한 성능을 제공하는 범위 내에서 가능한 한 낮게 유지된다.몇몇 특정 실시예에서, 이 방법은 사전 결정된 조건에 대한 전류 값 증가의 시퀀스를 기록하는 단계를 더 포함 한다. 이 시퀀스는 연속적인 온도 측정을 피하기 위해 시간 기반 패턴을 사용하는 경우에 유용할 수 있다. 몇몇 특정 실시예에서, 제1 조명 모듈은 하향등 모듈이고, 제2 조명 모듈은 상향등 모듈이다. 하향등 모듈과 상 향등 모듈이 때때로 동시에 작동하기 때문에, 이는 약간의 시너지 효과가 있다. 몇몇 특정 실시예에서, 본 방법의 단계는 대응하는 조명 모듈의 광원 중 적어도 10%에 적용된다. 점진적으로 증가하는 전류 값이 동시에 많은 수의 광원에, 예를 들어 사전 결정된 기능을 제공하는 모든 광원에 적용될 수 있다. 따라서 많은 수의 요소에 절전과 균일한 성능이 적용될 수 있다. 몇몇 특정 실시예에서, 본 방법은 광원 온도를 획득하는 단계를 더 포함하고, 이 방법의 나머지 단계들은 광원 온도가 사전 결정된 값에 도달하면 트리거된다. 시스템은 온도와 디레이팅 시간을 지속적으로 감독하지 않아도 된다. 온도 임계값을 생성하면 시스템이 더 편안 해지고 전력 소비가 감소된다. 일부 특정 실시예에서, 제1 전류 프로파일은 제1 플럭스 평균 값의 0.94배보다 낮은 플럭스 평균 값을 제공하고, 더 구체적으로 제1 플럭스 평균 값의 0.91배보다 낮은 플럭스 평균 값을 제공한다. 또한, 제2 전류 프로파일은 제2 플럭스 평균 값의 1.06배 보다 높은 플럭스 평균 값을 제공하고, 더 구체적으로 제1 플럭스 평 균 값의 1.09배보다 높은 플럭스 평균 값을 제공한다. 경우에 따라서는 투영된 광 패턴의 균질성을 손상시킬 수 있는 이러한 값으로, 상당한 디레이팅 시간 결과가 얻 어진다. 경우에 따라 열 안정화가 달성될 수 있다. 몇몇 특정 실시예에서, 제1 예비 디레이팅 시간을 추정하는 것 및/또는 제2 예비 디레이팅 시간을 추정하는 것 은, 트레이닝 데이터세트로 사전에 트레이닝된 인공 지능 알고리즘을 이용해서 수행된다. 몇몇 특정 실시예에서, 인공 지능 알고리즘은 질문을 갖는 질문 트리 구조를 포함하며, 질문에 대한 답변은, 디레이팅 시 간 값으로 변환되는 최종 스코어를 제공한다. 이러한 종류의 방법은 트레이닝 데이터세트를 사용하며, 이는 온도 측정(조명 디바이스 주변에 설치된 서미스터, 외부 온도, 예상 온도 등으로부터), 차량 속도, 도로 상태, 날씨, 주간/야간, 다른 활성 조명 기능, 열 제어 파라미터(LED 디밍, 다른 모듈의 디레이팅, 팬 속도) 및 물리적 헤드램프 파라미터와 같은 다양한 파라 미터를 가진 실험 데이터 그룹이다. 이들 값은 실험적으로 알려진 디레이팅 시간 값과 연관된다. 제어 유닛은 제공되는 파라미터를 사용해서 디레이팅 시간을 정확하게 추정하며, 실제 상태에 직면했을 때 실제 디레이팅 시 간의 추정이 가능한 한 정확하게 된다. 몇몇 특정 실시예에서, 인공 지능 알고리즘은 리지 회귀(ridge regression) 알고리즘을 포함한다. 이 방법에서 사용되는 데이터가 다중 공선성(multicollinearity)의 문제가 있기 때문에, 리지 회귀 알고리즘을 사용하는 것이 바람직하다: 활성화된 조명 기능, 지속 시간 및 각각 모듈의 온도 측정과 같은, 방법에서 사용되 는 일부 파라미터의 거동 사이에는 직접적인 연관성이 있다. 나아가, 한 조명 모듈의 열(heat)은 다른 조명 모 듈의 온도 변화에 직접적인 영향을 미친다. 경우에 따라 조명 패턴은 다른 모듈들을 사용해서 구축되므로, 조명 기능의 디레이팅은 각각의 모듈의 디레이팅 시간에 따라 달라진다. 다중 공선성이 발생하면, 최소 제곱 추정치 는 편향되지 않지만, 이들의 분산이 커서 매우 높은 추정(예측) 오류가 발생할 수 있다. 리지 회귀 알고리즘을 사용하면 회귀 추정치에 어느 정도의 편향을 더해서 표준 오차를 줄일 수 있다. 몇몇 특정 실시예에서, 제1 전류 프로파일을 제1 조명 모듈에 공급하는 것과 제2 전류 프로파일을 제2 조명 모 듈에 공급하는 것은 동시에 수행되지 않고, 제1 전류 프로파일의 공급이 먼저 수행되고, 시간 차를 두고, 제2 전류 프로파일의 공급이 두번째로 수행된다. 이는 전류를 증가시키는 동작이 필요할 때까지 지연되기 때문에, 더 나은 디레이팅 시간을 제공하는 데 도움이 된다. 본 발명의 제2 양상에서, 본 발명은, 차량 조명 디바이스를 제공하고, 이는 복수의 고체 상태 광원을 포함하는 제1 조명 모듈과, 복수의 고체 상태 광원을 포함하는 제2 조명 모듈과, 제1 양상에 따른 방법의 단계를 수행하는 제어 요소를 포함한다. \"고체 상태\"라는 용어는, 반도체를 사용해서 전기를 광으로 변환하는, 고체 상태 전계 발광에 의해 방출되는 광 을 가리킨다. 백열등에 비해서, 고체 상태 조명은 열 발생이 감소되고 낮은 에너지 손실로 가시광선을 생성한다. 일반적으로 작은 질량의 고체 상태 전자 조명 디바이스는, 부서지기 쉬운 유리관/전구 및 길고 가는 필라멘트 와이어에 비해서, 충격 및 진동에 대한 내성이 더 크다. 또한 필라멘트 기화가 없으므로, 잠재적으로 조명 디바이스의 수명을 연장한다. 이러한 유형의 조명의 예로는 조명 소스로서, 전기 필라멘트, 플라즈마 또는 가스가 아닌, 반도체 발광 다이오드(LED), 유기 발광 다이오드(OLED) 또는 폴리머 발광 다이오드(PLED)를 포함 한다. 이 조명 디바이스는 광원의 성능을 효율적으로 관리할 수 있는 바람직한 기능을 제공한다. 몇몇 특정 실시예에서, 차량 조명 디바이스는 고체 상태 광원의 온도를 측정하기 위한 서미스터를 더 포함한다."}
{"patent_id": "10-2023-7018030", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "예시적인 실시예는 당업자가 본원에 개시된 시스템 및 프로세스를 실시하고 구현할 수 있도록 충분히 상세하게 설명된다. 실시예는 많은 대안적인 형태로 제공될 수도 있고, 본원에 제시된 예로 제한되는 것으로 해석되어서 는 안된다는 것을 이해하는 것이 중요하다. 따라서, 실시예는 다양한 방식으로 수정될 수 있고, 다양한 대안의 형태를 취할 수 있지만, 구체적인 실시예는 도면에 도시되어 있으며, 이하에서는 실시예로서 상세히 설명된다. 공개된 특정한 형태로 제한하는 것은 아니다. 반대로, 첨부된 청구항의 범위에 속하는 모든 변경, 균등물 및 대안이 포함되어야 한다. 도 1은 본 발명에 따른 차량 조명 디바이스의 일반적인 사시도를 나타낸다. 이 조명 디바이스는 차량에 설치되며, 복수의 LED를 포함하는 제1 조명 모듈; 복수의 LED를 포함하는 제2 조명 모듈; 제어 요소; 제1 및 제2 조명 모듈의 여러 섹션에서 온도를 측정하기 위한 복수의 서미스터 를 포함한다. 각각의 조명 모듈은 2000 픽셀 이상의 해상도를 가진 고해상도 모듈이다. 그러나 투영 모듈을 생산하는 데 사용 되는 기술로 제한되는 것은 아니다. 이 매트릭스 구성의 제1 예는 모놀리식 소스를 포함한다. 이 모놀리식 소스는 다수의 열과 다수의 행으로 배열 된 모놀리식 전계 발광 요소의 매트릭스를 포함한다. 모놀리식 매트릭스에서, 전계 발광 요소는 공통 기판으로 부터 성장될 수 있고, 개별적으로 또는 전계 발광 소자의 서브세트에 의해 선택적으로 활성화되도록 전기적으로 연결될 수 있다. 기판은 주로 반도체 재료로 이루어질 수 있다. 기판은 하나 이상의 다른 재료, 예를 들어 비반 도체(금속 및 절연체)를 포함할 수 있다. 따라서, 각각의 전계 발광 소자/그룹은 광 픽셀을 형성할 수 있고, 따 라서 그 재료에 전기가 공급될 때 광을 발할 수 있다. 이러한 모놀리식 매트릭스의 구성은 인쇄 회로 기판에 납 땜되도록 의도된 종래의 발광 다이오드에 비해서 선택적으로 활성화 가능한 픽셀을 서로 매우 가깝게 배열할 수 있게 한다. 모놀리식 매트릭스는 공통 기판에 수직으로 측정된 높이의 주 치수가 실질적으로 1마이크로미터와 동일한 전계 발광 소자를 포함할 수 있다. 모놀리식 매트릭스는 매트릭스 배열에 의해 픽셀화된 광 빔의 생성 및/또는 투영을 제어하기 위해 제어 센터에 결합된다. 따라서 제어 센터는 매트릭스 배열의 각각의 픽셀의 발광을 개별적으로 제어할 수 있다. 상술한 바와 달리, 매트릭스 배열은 거울의 매트릭스에 결합된 주 광원을 포함할 수 있다. 따라서, 픽셀화된 광 원은 광을 방출하는 적어도 하나의 발광 다이오드 및 광전자 소자들의 어레이, DMD(디지털 마이크로-미러 디바 이스)로도 알려진 마이크로-미러의 매트릭스로 이루어진 적어도 하나의 메인 광원의 어셈블리에 의해 형성되며, 이는 반사에 의해 주 광원으로부터의 광 광선을 투영 광학 소자로 향하게 한다. 적절한 경우, 보조 광학 요소는 적어도 하나의 광원의 광선을 초점으로 모으고, 이들을 마이크로-미러 어레이의 표면으로 향하게 할 수 있다. 각각의 마이크로 미러는 2개의 고정된 위치, 즉 광선이 투영 광학 소자를 향해 반사되는 제1 위치와 광선이 투 영 광학 소자와는 다른 방향으로 반사되는 제2 위치 사이에서 피벗할 수 있다. 2개의 고정된 위치는 모든 마이 크로 미러에 대해 동일한 방식으로 배향되고, 마이크로 미러의 매트릭스를 지지하는 기준면에 대하여, 그 사양 에 정의된 마이크로 미러의 매트릭스의 특징적인 각도를 형성한다. 이러한 각도는 일반적으로 20° 미만이고, 보통 약 12°일 수 있다. 따라서, 마이크로 미러의 매트릭스에 입사되는 광선의 일부를 반사하는 각각의 마이크 로 미러는 픽셀화된 광원의 기본 방출기를 형성한다. 기본 광빔을 방출하도록 혹은 방출하지 않도록 이 기본 방 출기를 선택적으로 활성화시키기 위한, 미러의 위치 변경의 가동 및 제어는 제어 센터에 의해 제어된다. 다른 실시예에서, 매트릭스 배열은 스캐닝 레이저 시스템을 포함할 수 있으며, 여기서 레이저 광원은 레이저 빔 으로 파장 변환기의 표면을 탐색하도록 구성되는 스캐닝 소자를 향해 레이저 빔을 방출한다. 이 표면의 이미지 는 투영 광학 요소에 의해 캡처된다. 스캐닝 요소의 탐색은, 투영된 이미지에서 어떠한 변위도 인간의 눈이 인식하지 못하도록, 충분히 높은 속도로 수행될 수 있다. 레이저 소스의 점화와 빔의 스캐닝 이동을 동기식으로 제어함으로써, 파장 변환기 소자의 표면에서 선택적으로 활성화될 수 있는 기본 방출기의 매트릭스를 생성할 수 있다. 스캐닝 수단은 레이저 빔의 반사에 의해 파장 변 환기 소자의 표면을 스캐닝하는 이동형 마이크로 미러일 수 있다. 스캐닝 수단으로서 언급된 마이크로 미러는 예를 들어, MEMS(마이크로-전자-기계 시스템(Micro-Electro-Mechanical Systems)) 타입이다. 그러나, 본 발명 은 이러한 스캐닝 수단으로 한정되는 것은 아니며, 회전 소자 상에 배열된 일련의 미러와 같은 다른 종류의 스 캐닝 수단을 사용할 수 있으며, 소자의 회전은 레이저 빔에 의해 투과면을 스캐닝한다. 다른 변형예에서, 광원은 복잡할 수 있고, 발광 다이오드와 같은 광 소자의 적어도 하나의 세그먼트 및 모놀리 식 광원의 표면 부분 모두를 포함할 수 있다. 많은 수의 광원이 서로 매우 가깝기 때문에, 우수한 성능 및 효율을 보장하기 위해서는 열 제어가 매우 중요하 다. 도 2는 본 발명에 따른 방법이 적용되지 않는 경우의 조명 디바이스의 2개의 조명 모듈의 표준 동작에 대한 그 래프이다. 이 도면에 따르면, 제1 조명 모듈은 제1 곡선을 따르며, 시간에 따라 온도를 증가시킨다. 제1 예비 디레이 팅 시간에 도달하면, 제1 조명 모듈은 최대 온도 임계치에 도달하고, 손상을 피하기 위해 디레이팅될 필 요가 있다. 유사하게, 제2 조명 모듈은, 단독으로 설치된 경우에는, 제2 곡선을 따르며, 시간에 따라 온도를 증가시킨 다. 제2 예비 디레이팅 시간에 도달하면, 제2 조명 모듈은 최대 온도 임계치에 도달했을 것이고, 손상을 피하기 위해 디레이팅되어야 한다. 사실, 제2 조명 모듈이, 더 짧은 디레이팅 시간을 가진 제1 조명 모듈과 함 께 설치되기 때문에, 빔의 균질성을 보장하기 위해 제2 예비 디레이팅 시간 이전에 발생하는 제1 예비 디레이팅 시간에 제2 조명 모듈은 디레이팅되어야 하고, 이로써 하향등 모듈을 작동시키지 않으면 상향등 모듈을 사용할 수 없는 규정을 준수한다. 도 3은 본 발명의 방법에 따른 동작이 적용될 때의 제1 모듈 및 제2 모듈의 플럭스-온도 곡선의 변화를 나타낸 다. 제1 모듈은 예비 전류 프로파일을 따르지만, 이 제1 조명 모듈에서 사전 결정된 온도에 도달하면, 본 발 명의 방법이 트리거되고, 제1 예비 디레이팅 시간이 추정된다. 이러한 추정의 특정 예가 도 5로 설명될 것이다. 이후, 제2 모듈은 예비 전류 프로파일을 따르고, 이 방법이 트리거될 때, 동일한 방법에 따라서, 제2 예비 디레이팅 시간도 추정된다. 실제 시나리오에서는, 예비 디레이팅 시간이 더 긴 모듈이 제2 조명 모듈로 간주된다. 이 방법이 트리거되면, 제1 조명 모듈 전류 프로파일은 이 방법이 트리거되기 전에 제1 조명 모듈이 가졌던 플 럭스 평균 값의 0.9배인 플럭스 평균 값을 제공하는 전류 프로파일로 전환된다. 이후, 제2 조명 모듈 전류 프로파일은 전류 프로파일로 스위칭되며, 이는, 이 방법이 트리거되기 전에 제2 조명 모듈이 가졌던 플럭스 평균 값의 1.1배인 플럭스 평균 값을 제공한다. 경우에 따라서는, 제1 모듈에서 전류 프로파일이 먼저 감소되고, 그 후, 규정에 따라 광 패턴의 총 플럭스가 낮 은 임계치에 도달하면, 제2 모듈의 전류 프로파일이 증가된다. 이 시나리오에서는 디레이팅 시간이 훨씬 개선된 다. 이러한 변화는, 최종의 광 패턴의 균질성에 악영향을 미치지만, 보존되는 총 광속을 유지하기 위해 수행된다. 이러한 실질적인 전류 감소에 의해, 제2 모듈의 디레이팅 시간이 크게 증가되고, 때로는 열 안정화가 달성된다. 이 도면에서, 전류 프로파일이 어떻게 일정한 전류 값을 의미하는 것이 아니라 약간의 변화를 의미할지를 관찰 할 수 있다. 기준값이 선택되고, 이어서 강도가약간 증가하여, 상술한 방법의 상태를 만족하는 플럭스 평균 값 을 유지할 수 있다.도 4는, 도 3에 도시된 방법에 의해 생성된, 시간 경과에 따른 온도의 영향을 나타낸다. 이 그래프에서는, 두 조명 모듈의 시간 경과에 따른 온도가 표시된다. 그래프의 상단은 제1 조명 모듈의 변화를 나타낸다. 별도로 결정되지 않았다면, 도 2에 도시된 바와 같이, 제1 곡선은 제1 디레이팅 시간을 제공 할 것이고, 제2 곡선은 디레이팅 시간을 제공할 것이다. 그러나, 조명 모듈에서 플럭스 평균 값을 증가 및 감소시키는 결정으로 인해서, 제1 모듈은 제1 곡선이 아 닌 수정된 곡선(11')을 따르고, 제2 모듈은 제2 곡선이 아닌 수정된 곡선(12')을 따른다. 제1 모듈은 제1 디레이팅 시간에 온도 임계값에 도달하지 않고 수정된 디레이팅 시간(21')에 도달하며, 제2 모듈은 제2 디레이팅 시간에 온도 임계값에 도달하지 않고 수정된 디레이팅 시간(22')에 온도 임계값에 도달한다. 제1 디레이팅 시간과 제2 디레이팅 시간 사이에서 전체 기능의 디레이팅 시간은 더 짧기 때문에 항상 제2 디레이팅 시간보다 짧은 제1 디레이팅 시간이 조명 기능의 디레이팅 시간을 결정한다. 제1 디레이팅 시간 으로부터 수정된 디레이팅 시간(21')까지 개선되었기 때문에, 전체 조명 기능의 디레이팅 시간이 개선된다. 도 5는 시스템이 트레이닝되고 테스트되는 방법의 특정 예를 나타낸다. 서로 다른 학습 데이터세트를 가진 다양 한 예가 제공된다. 각각의 예는 시간에 따라서 다양한 파라미터가 측정되는 일반적인 구동 세션을 포함하며, 다 양한 파라미터는, 온도 측정(조명 디바이스 주변에 설치된 서미스터, 외부 온도, 예상 온도 등으로부터), 차량 속도, 도로 상태, 날씨, 주간/야간, 다른 활성 조명 기능, 열 제어 파라미터(LED 디밍, 다른 모듈의 디레이팅, 팬 속도) 및 물리적 헤드램프 파라미터를 포함한다. 이들 데이터세트 각각은 실험적으로 알려진 디레이팅 시간 값과 연관된다. 이 값은 시스템에 도입되고, 제어 유닛은 디레이팅 시간을 추정한다. 추정 디레이팅 시간을 실 험 시간과 비교해서 오류를 계산한다. 따라서 각각의 트레이닝 데이터세트는 에러 값과 연관된다. 이후 서로 다른 값과 파라미터의 다중 공선성으로 인해서, 리지 회귀 알고리즘을 사용해서 디레이팅 시간 추정을 개선하기 위해서, 제어 유닛에 공급할 감독 규칙 을 만든다."}
{"patent_id": "10-2023-7018030", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 차량 조명 디바이스의 일반적인 사시도를 나타낸다. 도 2는 본 발명에 따른 방법이 적용되지 않는 경우의 조명 디바이스의 2개의 조명 모듈의 표준 동작에 대한 그 래프이다. 도 3은 본 발명의 방법에 따른 동작이 적용될 때의 제1 모듈 및 제2 모듈의 플럭스-온도 곡선의 변화를 나타낸 다. 도 4는, 도 3에 기술된 방법에 의해 생성된 시간 경과에 따른 온도의 영향을 나타낸다. 도 5는 시스템이 트레이닝되고 테스트되는 방법의 특정 예를 나타낸다. 도면에서는 다음의 참조 번호가 사용되었다. 1 : 제1 조명 모듈 2 : 제2 조명 모듈 3 : LED 4 : 제어 요소 5 : 서미스터 6 : 온도 임계 값 7 : 온도 트리거 값 10 : 조명 디바이스 11 : 제1 모듈의 제1 예비 곡선 11' : 제1 모듈의 본 발명의 곡선 12 : 제2 모듈의 제1 예비 곡선 12' : 제2 모듈의 본 발명의 곡선 13 : 제1 예비 전류 프로파일 14 : 제1 수정된 전류 프로파일 21 : 제1 모듈에 대한 제1 예비 디레이팅 온도 21' : 제1 조명 모듈에 대한 본 발명의 디레이팅 시간 22 : 제2 모듈에 대한 제2 예비 디레이팅 온도 22' : 제2 조명 모듈에 대한 본 발명의 디레이팅 시간23 : 제2 예비 전류 프로파일 24 : 제2 수정된 전류 프로파일 100 : 차량"}
