{"patent_id": "10-2021-0188664", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0099369", "출원번호": "10-2021-0188664", "발명의 명칭": "객체의 위치 추정을 위한 가려짐 판별과 객체 좌표 보정", "출원인": "한화비전 주식회사", "발명자": "손찬영"}}
{"patent_id": "10-2021-0188664", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "영상 획득부; 및상기 영상 획득부를 통해 획득된 영상에서 인체의 인식결과를 인디케이팅하는 바운딩 박스의 종횡비(Aspectratio)가 미리 정해진 기준 종횡비(Reference Aspect ratio)보다 작은 경우, 상기 인체의 적어도 일부가 다른객체에 의해 가려진 것으로 판단하고, 상기 바운딩 박스의 좌표정보에 기초하여 상기 인체의 전신길이를 추정하는 프로세서;를 포함하는 감시 카메라."}
{"patent_id": "10-2021-0188664", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 프로세서는,딥러닝 기반의 YOLO(You Only Look Once) 알고리즘을 이용하여 상기 영상에서 객체를 인식하고, 상기 인식된 객체가 사람인 경우, 상기 바운딩 박스의 종횡비와 상기 미리 정해진 기준 종횡비를 비교하는 것을 특징으로 하는감시 카메라."}
{"patent_id": "10-2021-0188664", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 미리 정해진 기준 종횡비는, 상기 감시카메라의 설치 각도에 따라 달라지는 것을 특징으로 하는 감시 카메라."}
{"patent_id": "10-2021-0188664", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 프로세서는,상기 바운딩 박스의 종횡비가 상기 기준 종횡비 보다 작은 경우, 상기 바운딩 박스는 상기 인체 중 두부(head)영역을 포함하는 것으로 판단하고, 상기 두부 영역의 좌표값으로부터 상기 인체의 발끝좌표를 추정하고, 상기발끝좌표에 기초하여 상기 전신길이를 산출하는 것을 특징으로 하는 감시 카메라."}
{"patent_id": "10-2021-0188664", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4 항에 있어서,상기 프로세서는,상기 두부 영역을 포함하는 상기 바운딩 박스의 중앙 좌표값 중 Y 좌표값에, 상기 바운딩 박스의 세로길이의 정수배를 합산한 결과를 상기 인체의 발끝좌표로 추정하는 것을 특징으로 하는 감시 카메라."}
{"patent_id": "10-2021-0188664", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서,상기 정수배의 정수값은, 상기 미리 정해진 기준 종횡비와 상기 감시 카메라의 민감도(sensitivity)를 고려한값을 합산한 값인 것을 특징으로 하는 감시 카메라."}
{"patent_id": "10-2021-0188664", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 4 항에 있어서,공개특허 10-2023-0099369-3-상기 프로세서는,상기 두부 영역을 포함하는 상기 바운딩 박스의 2차원 중앙 좌표값 및 미리 정해진 사람키값에 기초하여 상기 2차원 중앙 좌표값을 상기 감시 카메라의 캘리브레이션 정보에 기초하여 상기 인체의 3차원 좌표값을 구성하고, 상기 3차원 좌표값으로부터 발끝의 3차원 좌표값을 획득하고, 상기 발끝의 3차원 좌표값을 상기 감시카메라의 캘리브레이션 정보에 기초하여 2차원 좌표값으로 변환하여 상기인체의 발끝좌표를 추정하는 것을 특징으로 하는 감시 카메라."}
{"patent_id": "10-2021-0188664", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서,상기 프로세서는,딥러닝 기반의 알고리즘을 이용하여 상기 인체를 인식하고, 상기 인체의 성별을 분류하고,상기 미리 정해진 사람키값은 상기 분류된 성별에 따라 다른값이 적용되는 것을 특징으로 하는 감시 카메라."}
{"patent_id": "10-2021-0188664", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "감시 카메라의 영상 획득부를 통해 획득된 영상에서 객체를 인식하는 단계;상기 객체의 인식 결과를 인디케이팅하는 바운딩 박스의 종횡비(Aspect ratio)와 미리 정해진 기준 종횡비(Reference Aspect ratio)를 비교하는 단계; 및상기 바운딩 박스의 종횡비가 상기 기준 종횡비 보다 작은 경우, 상기 객체의 적어도 일부가 다른 객체에 의해가려진 것으로 판단하고, 상기 바운딩 박스의 좌표 정보에 기초하여 상기 객체의 전체길이를 추정하는 단계;를 포함하는 감시 카메라의 제어 방법."}
{"patent_id": "10-2021-0188664", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9 항에 있어서,상기 객체는 인체를 포함하고,상기 바운딩 박스의 종횡비가 상기 기준 종횡비 보다 작은 경우, 상기 바운딩 박스가 상기 인체의 두부 영역을포함하는 것으로 판단하는 단계;상기 바운딩 박스의 상단부 중앙 좌표값 중 Y 좌표값에, 상기 바운딩 박스의 세로길이의 정수배를 합산한 결과를 상기 인체의 발끝좌표로 추정하는 단계;를 포함하는 감시 카메라의 제어 방법."}
{"patent_id": "10-2021-0188664", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 9 항에 있어서,상기 인식된 객체의 성별을 구별하고,상기 바운딩 박스의 종횡비가 상기 기준 종횡비 보다 작은 경우, 상기 바운딩 박스가 상기 인체의 두부 영역을포함하는 것으로 판단하는 단계;상기 두부 영역을 포함하는 상기 바운딩 박스의 2차원 중앙 좌표값 및 상기 성별에 따라 미리 정해진 사람키값에 기초하여 상기 2차원 중앙 좌표값을 상기 감시 카메라의 캘리브레이션 정보에 기초하여 상기 인체의 3차원좌표값을 구성하는 단계;상기 3차원 좌표값으로부터 발끝의 3차원 좌표값을 획득하는 단계; 및상기 발끝의 3차원 좌표값을 상기 감시카메라의 캘리브레이션 정보에 기초하여 2차원 좌표값으로 변환하여 상기인체의 발끝좌표를 추정하는 단계;를 포함하는 감시 카메라의 제어 방법.공개특허 10-2023-0099369-4-청구항 12 영상 획득부; 및상기 영상 획득부를 통해 획득된 영상에서 인체를 인식하고, 상기 인식된 인체의 적어도 일부가 다른 객체에 의해 가려진 것으로 판단한 경우, 상기 인식된 인체의 인식결과를 인디케이팅 하는 바운딩 박스에 상기 인체의 두부(head)영역 만을 포함하는 것으로 인식하고, 상기 인체의 두부(head)영역의 좌표에 기초하여 상기 인체의 전신 길이를 추정하는 프로세서;를 포함하되,상기 영상 획득부에서 획득한 영상을 입력 데이터로 설정하고, 객체 인식을 출력 데이터로 설정하여 기 학습된신경망 모델을 적용하여 상기 객체를 인식하는 것을 특징으로 하는 감시 카메라."}
{"patent_id": "10-2021-0188664", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 12 항에 있어서,상기 프로세서는,상기 바운딩 박스의 종횡비(Aspect ratio)가 미리 정해진 기준 종횡비(Reference Aspect ratio)보다 작은 경우상기 인체의 적어도 일부가 다른 객체에 의해 가려진 것으로 판단하고,상기 두부 영역의 좌표값으로부터 상기 인체의 발끝좌표를 추정하고, 상기 발끝좌표에 기초하여 상기 전신길이를 산출하는 것을 특징으로 하는 감시 카메라."}
{"patent_id": "10-2021-0188664", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 12 항에 있어서,상기 프로세서는,상기 두부 영역을 포함하는 상기 바운딩 박스의 중앙 좌표값 중 Y 좌표값에, 상기 바운딩 박스의 세로길이의 정수배를 합산한 결과를 상기 인체의 발끝좌표로 추정하되,상기 정수배의 정수값은, 상기 미리 정해진 기준 종횡비와 상기 감시 카메라의 민감도(sensitivity)를 고려한값을 합산한 값인 것을 특징으로 하는 감시 카메라."}
{"patent_id": "10-2021-0188664", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 12 항에 있어서,상기 프로세서는,상기 인식된 객체의 성별을 구별하고, 상기 두부 영역을 포함하는 상기 바운딩 박스의 2차원 중앙 좌표값 및 상기 성별에 따른 미리 정해진 사람키값에 기초하여 상기 2차원 중앙 좌표값을 상기 감시 카메라의 캘리브레이션정보에 기초하여 상기 인체의 3차원 좌표값을 구성하고, 상기 3차원 좌표값으로부터 발끝의 3차원 좌표값을 획득하고, 상기 발끝의 3차원 좌표값을 상기 감시카메라의 캘리브레이션 정보에 기초하여 2차원 좌표값으로 변환하여 상기인체의 발끝좌표를 추정하는 것을 특징으로 하는 감시 카메라."}
{"patent_id": "10-2021-0188664", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "감시 카메라 및 감시 카메라의 제어 방법이 개시된다. 본 명세서의 일 실시예에 따른 감시 카메라는, 획득된 영 상에서 객체를 인식하고, 인식된 객체의 바운딩 박스의 종횡비를 이용하여 다른 객체에 의해 가려진 상태인지 여 부를 판단하고, 가려진 상태인 경우, 바운딩 박스의 좌표 정보에 기초하여 객체 전체 길이를 추정할 수 있다. 이 에 따라 방대한 양의 데이터 베이스를 적용하거나, 장치의 리소스 이용을 최소화하면서도 가려진 객체의 크기 정 보를 효율적으로 확인할 수 있다. 본 명세서는 감시용 카메라, 자율주행 차량, 사용자 단말기 및 서버 중 하나 이상이 인공 지능(Artificial Intelligence) 모듈, 로봇, 증강현실(Augmented Reality, AR) 장치, 가상 현실 (Virtual reality, VT) 장치, 5G 서비스와 관련된 장치 등과 연계될 수 있다."}
{"patent_id": "10-2021-0188664", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 명세서는 감시 카메라에서 영상 처리 방법에 관한 것이다."}
{"patent_id": "10-2021-0188664", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "객체 검출기술에서 물체나 사람 등에 의해 사람이 가려진 경우, 사람을 온전하게 검출하기는 어렵다. 이를 해결 하기 위해 다양한 기술이 연구되고 있다. 다양한 시점에서 촬영된 영상을 이용하거나, 분류기 또는 특징점 기반으로 검출기의 성능이 보완될 수 있다. 그러나, 이러한 방법은 많은 양의 데이터베이스를 요구하거나, 사람이 가려진 경우 신뢰도 높은 정보를 획득하 기 어렵다. 또한, 대부분의 검출기는 사람의 전신 검출 여부만을 고려하여 사람의 3차원적 위치 정보를 고려하 지 않은 문제점들이 있다."}
{"patent_id": "10-2021-0188664", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "전술한 문제를 해결하기 위해 본 명세서의 일 실시예는 많은 양의 데이터베이스 없이도 가려짐 검출결과의 신뢰 성을 높일 수 있는 감시 카메라 및 감시 카메라의 제어 방법을 제공하는 것을 목적으로 한다. 또한, 본 명세서의 일 실시예는 딥러닝 기반의 객체 검출 결과, 검출 객체를 표시하는 바운딩 박스 정보를 활용 하여 가려진 객체의 좌표정보를 효율적으로 보정할 수 있는 감시 카메라 및 감시 카메라의 제어 방법을 제공하 는 것을 목적으로 한다. 본 발명이 이루고자 하는 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급되지 않은"}
{"patent_id": "10-2021-0188664", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "또 다른 기술적 과제들은 이하의 발명의 상세한 설명으로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가 진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0188664", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 명세서의 일 실시예에 따른 감시 카메라는, 영상 획득부; 및 상기 영상 획득부를 통해 획득된 영상에서 인체 의 인식결과를 인디케이팅하는 바운딩 박스의 종횡비(Aspect ratio)가 미리 정해진 기준 종횡비(Reference Aspect ratio)보다 작은 경우, 상기 인체의 적어도 일부가 다른 객체에 의해 가려진 것으로 판단하고, 상기 바 운딩 박스의 좌표정보에 기초하여 상기 인체의 전신길이를 추정하는 프로세서;를 포함한다. 상기 프로세서는, 딥러닝 기반의 YOLO(You Only Look Once) 알고리즘을 이용하여 상기 영상에서 객체를 인식하 고, 상기 인식된 객체가 사람인 경우, 상기 바운딩 박스의 종횡비와 상기 미리 정해진 기준 종횡비를 비교할 수 있다. 상기 미리 정해진 기준 종횡비는, 상기 감시카메라의 설치 각도에 따라 달라질 수 있다. 상기 프로세서는, 상기 바운딩 박스의 종횡비가 상기 기준 종횡비 보다 작은 경우, 상기 바운딩 박스는 상기 인 체 중 두부(head) 영역을 포함하는 것으로 판단하고, 상기 두부 영역의 좌표값으로부터 상기 인체의 발끝좌표를 추정하고, 상기 발끝좌표에 기초하여 상기 전신길이를 산출할 수 있다. 상기 프로세서는, 상기 두부 영역을 포함하는 상기 바운딩 박스의 중앙 좌표값 중 Y 좌표값에, 상기 바운딩 박 스의 세로길이의 정수배를 합산한 결과를 상기 인체의 발끝좌표로 추정할 수 있다. 상기 정수배의 정수값은, 상기 미리 정해진 기준 종횡비와 상기 감시 카메라의 민감도(sensitivity)를 고려한 값을 합산한 값일 수 있다. 상기 프로세서는, 상기 두부 영역을 포함하는 상기 바운딩 박스의 2차원 중앙 좌표값 및 미리 정해진 사람 키값 에 기초하여 상기 2차원 중앙 좌표값을 상기 감시 카메라의 캘리브레이션 정보에 기초하여 상기 인체의 3차원 좌표값을 구성하고, 상기 3차원 좌표값으로부터 발끝의 3차원 좌표값을 획득하고, 상기 발끝의 3차원 좌표값을 상기 감시카메라의 캘리브레이션 정보에 기초하여 2차원 좌표값으로 변환하여 상기 인체의 발끝좌표를 추정할 수 있다. 상기 프로세서는, 딥러닝 기반의 알고리즘을 이용하여 상기 인체를 인식하고, 상기 인체의 성별을 분류하고, 상 기 미리 정해진 사람키값은 상기 분류된 성별에 따라 다른값이 적용될 수 있다. 본 명세서의 일 실시예에 따른 감시 카메라의 제어 방법은, 감시 카메라의 영상 획득부를 통해 획득된 영상에서 객체를 인식하는 단계; 상기 객체의 인식 결과를 인디케이팅하는 바운딩 박스의 종횡비(Aspect ratio)와 미리 정해진 기준 종횡비(Reference Aspect ratio)를 비교하는 단계; 및 상기 바운딩 박스의 종횡비가 상기 기준 종 횡비 보다 작은 경우, 상기 객체의 적어도 일부가 다른 객체에 의해 가려진 것으로 판단하고, 상기 바운딩 박스 의 좌표 정보에 기초하여 상기 객체의 전체길이를 추정하는 단계;를 포함한다. 상기 객체는 인체를 포함하고, 상기 감시 카메라 제어 방법은, 상기 바운딩 박스의 종횡비가 상기 기준 종횡비 보다 작은 경우, 상기 바운딩 박스가 상기 인체의 두부 영역을 포함하는 것으로 판단하는 단계; 및 기 바운딩 박스의 상단부 중앙 좌표값 중 Y 좌표값에, 상기 바운딩 박스의 세로길이의 정수배를 합산한 결과를 상기 인체 의 발끝좌표로 추정하는 단계;를 포함할 수 있다. 상기 객체는 인체를 포함하고, 상기 감시 카메라 제어 방법은, 상기 바운딩 박스의 종횡비가 상기 기준 종횡비 보다 작은 경우, 상기 바운딩 박스가 상기 인체의 두부 영역을 포함하는 것으로 판단하는 단계; 상기 두부 영역 을 포함하는 상기 바운딩 박스의 2차원 중앙 좌표값 및 미리 정해진 사람키값에 기초하여 상기 2차원 중앙 좌표 값을 상기 감시 카메라의 캘리브레이션 정보에 기초하여 상기 인체의 3차원 좌표값을 구성하는 단계; 기 3차원 좌표값으로부터 발끝의 3차원 좌표값을 획득하는 단계; 및 상기 발끝의 3차원 좌표값을 상기 감시카메라의 캘리 브레이션 정보에 기초하여 2차원 좌표값으로 변환하여 상기 인체의 발끝좌표를 추정하는 단계;를 포함할 수 있 다. 본 명세서의 다른 실시예에 따른 감시 카메라는, 영상 획득부; 및 상기 영상 획득부를 통해 획득된 영상에서 인 체를 인식하고, 상기 인식된 인체의 적어도 일부가 다른 객체에 의해 가려진 것으로 판단한 경우, 상기 인체의 인식결과를 인디케이팅하는 바운딩 박스는 상기 인체 중 두부(head) 영역을 포함하는 것으로 판단하고, 상기 두 부 영역의 좌표값으로부터 상기 인체의 발끝좌표를 추정하고, 상기 발끝좌표에 기초하여 상기 인체의 전신길이 를 산출하는 것을 특징으로 하는 프로세서;를 포함한다. 상기 프로세서는, 상기 두부 영역을 포함하는 상기 바운딩 박스의 중앙 좌표값 중 Y 좌표값에, 상기 바운딩 박 스의 세로길이의 정수배를 합산한 결과를 상기 인체의 발끝좌표로 추정할 수 있다. 상기 정수배의 정수값은, 상기 미리 정해진 기준 종횡비와 상기 감시 카메라의 민감도(sensitivity)를 고려한 값을 합산한 값일 수 있다. 상기 프로세서는, 상기 인식된 객체의 성별을 구별하고, 상기 두부 영역을 포함하는 상기 바운딩 박스의 2차원 중앙 좌표값 및 상기 성별에 따른 미리 정해진 사람키값에 기초하여 상기 2차원 중앙 좌표값을 상기 감시 카메 라의 캘리브레이션 정보에 기초하여 상기 인체의 3차원 좌표값을 구성하고, 상기 3차원 좌표값으로부터 발끝의 3차원 좌표값을 획득하고, 상기 발끝의 3차원 좌표값을 상기 감시카메라의 캘리브레이션 정보에 기초하여 2차원 좌표값으로 변환하여 상기 인체의 발끝좌표를 추정할 수 있다. 상기 프로세서는, 상기 인체의 인식결과를 인디케이팅하는 바운딩 박스의 종횡비(Aspect ratio)가 미리 정해진 기준 종횡비(Reference Aspect ratio)보다 작은 경우, 상기 인체의 적어도 일부가 다른 객체에 의해 가려진 것으로 판단할 수 있다. 본 명세서의 다른 실시예에 따른 감시 카메라는, 영상 획득부; 및 상기 영상 획득부를 통해 획득된 영상에서 인 체를 인식하고, 상기 인식된 인체의 적어도 일부가 다른 객체에 의해 가려진 것으로 판단한 경우, 상기 인식된 인체의 인식결과를 인디케이팅 하는 바운딩 박스에 상기 인체의 두부(head)영역 만을 포함하는 것으로 인식하고, 상기 인체의 두부(head)영역의 좌표에 기초하여 상기 인체의 전신 길이를 추정하는 프로세서;를 포함 하되, 상기 영상 획득부에서 획득한 영상을 입력 데이터로 설정하고, 객체 인식을 출력 데이터로 설정하여 기 학습된 신경망 모델을 적용하여 상기 객체를 인식할 수 있다. 상기 객체 인식은 딥러닝 기반의 YOLO(You Only Look Once) 알고리즘이 적용될 수 있다. 상기 프로세서는, 상기 바운딩 박스의 종횡비(Aspect ratio)가 미리 정해진 기준 종횡비(Reference Aspect ratio)보다 작은 경우 상기 인체의 적어도 일부가 다른 객체에 의해 가려진 것으로 판단하고, 상기 두부 영역의 좌표값으로부터 상기 인체의 발끝좌표를 추정하고, 상기 발끝좌표에 기초하여 상기 전신길이를 산출할 수 있다. 상기 프로세서는, 상기 두부 영역을 포함하는 상기 바운딩 박스의 중앙 좌표값 중 Y 좌표값에, 상기 바운딩 박 스의 세로길이의 정수배를 합산한 결과를 상기 인체의 발끝좌표로 추정하되, 상기 정수배의 정수값은, 상기 미 리 정해진 기준 종횡비와 상기 감시 카메라의 민감도(sensitivity)를 고려한 값을 합산한 값일 수 있다. 상기 프로세서는, 상기 인식된 객체의 성별을 구별하고, 상기 두부 영역을 포함하는 상기 바운딩 박스의 2차원 중앙 좌표값 및 상기 성별에 따른 미리 정해진 사람키값에 기초하여 상기 2차원 중앙 좌표값을 상기 감시 카메 라의 캘리브레이션 정보에 기초하여 상기 인체의 3차원 좌표값을 구성하고, 상기 3차원 좌표값으로부터 발끝의 3차원 좌표값을 획득하고, 상기 발끝의 3차원 좌표값을 상기 감시카메라의 캘리브레이션 정보에 기초하여 2차원 좌표값으로 변환하여 상기 인체의 발끝좌표를 추정할 수 있다."}
{"patent_id": "10-2021-0188664", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 명세서의 일 실시예는 많은 양의 데이터베이스 없이도 가려짐 검출결과의 신뢰성을 높일 수 있다. 또한, 본 명세서의 일 실시예는 딥러닝 기반의 객체 검출 결과, 검출 객체를 표시하는 바운딩 박스 정보를 활용 하여 가려진 객체의 좌표정보를 효율적으로 보정할 수 있다. 또한, 감시 카메라의 영상에 가려진 객체가 존재하는 경우, 본 명세서의 일 실세예에 따라 객체의 가려짐 여부 판단 및 가려진 객체의 발끝좌표를 추정함으로써, 가려진 객체의 전체 길이를 효율적으로 획득할 수 있다. 또한, 본 명세서의 일 실시예는 감시 카메라의 영상에 가려진 객체가 존재하는 경우, 가려지지 않은 객체 정보 를 활용하여 객체 간의 실제 거리 도는 객체의 실제 크기를 용이하게 유추할 수 있다. 본 발명에서 얻을 수 있는 효과는 이상에서 언급한 효과로 제한되지 않으며, 언급하지 않은 또 다른 효과들은"}
{"patent_id": "10-2021-0188664", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0188664", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 명세서에 개시된 실시예를 상세히 설명하되, 도면 부호에 관계없이 동일하거 나 유사한 구성요소는 동일한 참조 번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 이하의 설명 에서 사용되는 구성요소에 대한 접미사 \"모듈\" 및 \"부\"는 명세서 작성의 용이함만이 고려되어 부여되거나 혼용 되는 것으로서, 그 자체로 서로 구별되는 의미 또는 역할을 갖는 것은 아니다. 또한, 본 명세서에 개시된 실시 예를 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 명세서에 개시된 실시예의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 또한, 첨부된 도면은 본 명세서에 개시된 실시예를 쉽게 이 해할 수 있도록 하기 위한 것일 뿐, 첨부된 도면에 의해 본 명세서에 개시된 기술적 사상이 제한되지 않으며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소 들은 상기 용어들에 의해 한정되지는 않는다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다.어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있 다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함한다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되 어야 한다. 도 1은 본 명세서의 일 실시예에 따른 감시 카메라의 제어 방법을 구현하기 위한 감시 카메라 시스템을 설명하 기 위한 도면이다. 도 1을 참조하면, 본 명세서의 일 실시예에 따른 감시 카메라의 제어 방법을 구현하기 위한 영상 관리 시스템 은 촬영 장치 및 영상 관리 서버을 포함할 수 있다. 촬영 장치는 특정 장소의 고정된 위치 에 배치되는 촬영용 전자 장치일 수도 있고, 일정한 경로를 따라 자 동 또는 수동으로 움직일 수 있는 촬영용 전자 장치일 수도 있고, 사람 또는 로봇 등에 의하여 이동될 수 있는 촬영용 전자 장치일 수도 있다. 촬영 장치 는 유무선 인터넷에 연결하여 사용하는 IP 카메라일 수 있다. 촬영 장치는 팬(pan), 틸트(tilt), 및 줌(zoom) 기능을 갖는 PTZ 카메라일 수 있다. 촬영 장치는 감시 하는 영역을 녹화하거나 사진을 촬영하는 기능을 가질 수 있다. 촬영 장치는 감시하는 영역에서 발생하는 소리를 녹음하는 기능을 가질 수 있다. 촬 영 장치는 감시하는 영역에서 움직임 또는 소리 등 변화가 발생 할 경우, 이에 대한 알림을 발생시키거나 녹화 또는 사진 촬영을 수행하는 기능을 가질 수 있다. 영상 관리 서버는 촬영 장치를 통하여 촬영된 영상 자체 및/또는 해당 영상을 편집하여 얻어지는 영 상을 수신하여 저장하는 장치일 수 있다. 영상 관리 서버는 수신한 용도에 대응되도록 분석할 수 있다. 예 를 들어, 영상 관리 서버는 영상에서 객체를 검출하기 위해 객체 검출 알고리즘을 이용하여 객체를 검출할 수 있다. 상기 객체 검출 알고리즘은 AI 기반 알고리즘이 적용될 수 있으며, 미리 학습된 인공신경망 모델을 적 용하여 객체를 검출할 수 있다. 한편, 영상 관리 서버는 영상 분석 목적에 맞는 다양한 학습 모델을 저장하고 있을 수 있다. 상기 학습 모 델은, 객체의 객체 분류 기능을 포함할 수 있다. 상기 객체 분류 기능은, 인식된 객체가 사람인지 여부, 사람인 경우, 여성인지 남성인지 등 성별 분류 기능을 포함할 수 있다. 또한, 상기 학습 모델은 인식된 객체가 사람인 경우, 사람의 전신 검출여부를 구분할 수 있는 기능을 포함할 수 있다. 예를 들어, 상기 학습 모델은 본 명세서 의 일 실시예에 적용될 수 있는 사람의 두부 영역(Head Area) 을 검출하는 기능을 포함할 수 있다. 본 명세서의 일 실시예에 따른 딥러닝 객체 인식 알고리즘은 사람을 인식한 경우, 사람의 전신길이 및/또는 사람의 두부 영 역을 구분하여 인식하는 기능을 포함할 수 있다. 본 명세서의 일 실시예에 따르면 사람의 전신 길이가 검출되지 않은 경우 상기 사람의 두부 영역의 크기를 전신 길이 추정에 보완 정보로 활용할 수 있다. 또한, 영상 관리 서버는 수신한 영상을 분석하여 메타 데이터와 해당 메타 데이터에 대한 인덱스 정보를 생성할 수 있다. 영상 관리 서버는 수신한 영상에 포함된 영상 정보 및 /또는 음향 정보를 함께 또는 별도 로 분석하여 메타 데이터와 해당 메타 데이터에 대한 인덱스 정보를 생성할 수 있다. 영상 관리 시스템은 촬영 장치 및/또는 영상 관리 서버와 유무선 통신을 수행할 수 있는 외부 장 치를 더 포함할 수 있다. 외부 장치는 영상 관리 서버로 영상 전체 또는 일부의 제공을 요청하는 정보 제공 요청 신호를 송신 할 수 있다. 외부 장치는 영상 관리 서버로 영상 분석 결과 객체의 존재 여부, 객체의 분류 결과 등 을 요청하는 정보 제공 요청 신호를 송신할 수 있다. 또한 외부 장치는 영상 관리 서버로 영상을 분 석하여 얻어진 메타 데이터 및/또는 메타 데이터에 대한 인덱스 정보를 요청하는 정보 제공 요청 신호를 송신할 수 있다. 영상 관리 시스템은 촬영 장치, 영상 관리 서버, 및/또는 외부 장치 간의 유무선 통신 경로 인 통신망을 더 포함할 수 있다. 통신망은 예컨대 LANs(Local Area Networks), WANs(Wide Area Networks), MANs(Metropolitan Area Networks), ISDNs(Integrated Service Digital Networks) 등의 유선 네트워크나, 무선 LANs, CDMA, 블루투스, 위성 통신 등의 무선 네트워크를 망라할 수 있으나, 본 명세서의 범위가 이 에 한정되는 것은 아니다. 도 2는 본 명세서의 일 실시예에 따른 감시 카메라의 개략적인 블록도이다. 도 2는 도 1에 도시된 카메라의 구성을 나타내는 블록도이다. 도 2를 참조하면,카메라는 지능형 영상분석 기능을 수행하여 상기 영상분석 신호를 생성하는 네트워크 카메라임을 그 예로 설명하나, 본 발명의 실시예에 의한 네트워크 감시 카메라 시스템의 동작이 반드시 이에 한정되는 것은 아니다. 카메라는 이미지 센서, 인코더, 메모리, 이벤트 센서, 프로세서, 및 통신 인터 페이스를 포함한다. 이미지 센서는 감시 영역을 촬영하여 영상을 획득하는 기능을 수행하는 것으로서, 예컨대, CCD(Charge- Coupled Device) 센서, CMOS(Complementary Metal-Oxide-Semiconductor) 센서 등으로 구현될 수 있다. 인코더는 이미지 센서를 통해 획득한 영상을 디지털 신호로 부호화하는 동작을 수행하며, 이는 예컨 대, H.264, H.265, MPEG(Moving Picture Experts Group), M-JPEG(Motion Joint Photographic Experts Group) 표준 등을 따를 수 있다. 메모리는 영상 데이터, 음성 데이터, 스틸 이미지, 메타데이터 등을 저장할 수 있다. 앞서 언급한 바와 같 이, 상기 메타데이터는 상기 감시영역에 촬영된 객체 검출 정보(움직임, 소리, 지정지역 침입 등), 객체 식별 정보(사람, 차, 얼굴, 모자, 의상 등), 및 검출된 위치 정보(좌표, 크기 등)을 포함하는 데이터일 수 있다. 또한, 상기 스틸 이미지는 상기 메타데이터와 함께 생성되어 메모리에 저장되는 것으로서, 상기 영상분석 정보들 중 특정 분석 영역에 대한 이미지 정보를 캡쳐하여 생성될 수 있다. 일 예로, 상기 스틸 이미지는 JPEG 이미지 파일로 구현될 수 있다. 일 예로, 상기 스틸 이미지는 특정 영역 및 특정 기간 동안 검출된 상기 감시영역의 영상 데이터들 중 식별 가 능한 객체로 판단된 영상 데이터의 특정영역을 크롭핑(cropping)하여 생성될 수 있으며, 이는 상기 메타데이터 와 함께 실시간으로 전송될 수 있다. 통신부는 상기 영상 데이터, 음성 데이터, 스틸 이미지, 및/또는 메타데이터를 영상수신/검색장치에 전송한다. 일 실시예에 따른 통신부는 영상 데이터, 음성 데이터, 스틸 이미지, 및/또는 메타데이터를 영 상수신장치에 실시간으로 전송할 수 있다. 통신 인터페이스는 유무선 LAN(Local Area Network), 와이 파이(Wi-Fi), 지그비(ZigBee), 블루투스(Bluetooth), 근거리 통신(Near Field Communication) 중 적어도 하나 의 통신 기능을 수행할 수 있다. AI 프로세서는 인공지능 영상 처리를 위한 것으로서, 본 명세서의 일 실시예에 따라 감시 카메라 시스템 을 통해 획득된 영상에서 학습된 딥러닝 기반의 객체 탐지(Objection Detection) 알고리즘을 적용한다. 상기 AI 프로세서는 시스템 전반에 걸쳐 제어하는 프로세서와 하나의 모듈로 구현되거나 독립된 모듈로 구현 될 수 있다. 본 명세서의 일 실시예들은 객체 인식에 있어서 YOLO(You Only Lock Once) 알고리즘을 적용할 수 있다. YOLO은 객체 검출 속도가 빠르기 때문에 실시간 동영상을 처리하는 감시 카메라에 적당한 AI 알고리즘이 다. YOLO 알고리즘은 다른 객체 기반 알고리즘들(Faster R-CNN, R_FCN, FPN-FRCN 등)과 달리 한 장의 입력 영 상을 리사이즈(Resize)후 단일 신경망을 단 한 번 통과킨 결과로 각 객체의 위치를 인디케이팅하는 바운딩 박스 (Bounding Box)와 객체가 무엇인지 분류 확률을 출력한다. 최종적으로 Non-max suppression을 통해 하나의 객체 를 한번 인식(detection)한다. 한편, 본 명세서에 개시되는 객체 인식 알고리즘은 전술한 YOLO에 한정되지 않고 다양한 딥러닝 알고리즘으로 구현될 수 있음을 밝혀둔다. 도 3은 본 명세서의 일 실시예에 따른 감시 카메라 영상의 분석에 적용되는 AI 장치(모듈)을 설명하기 위한 도 면이다. 도 3을 살펴보면, AI 장치는 AI 프로세싱을 수행할 수 있는 AI 모듈을 포함하는 전자 기기 또는 AI 모듈을 포함하는 서버 등을 포함할 수 있다. 또한, AI 장치는 감시 카메라 또는 영상 관리 서버의 적어도 일부의 구성으로 포함되어 AI 프로세싱 중 적어도 일부를 함께 수행하도록 구비될 수도 있다. AI 프로세싱은 감시카메라 또는 영상 관리 서버의 제어부와 관련된 모든 동작들을 포함할 수 있다. 예를 들어, 감시 카메라 또는 영상 관리 서버는 획득된 영상 신호를 AI 프로세싱 하여 처리/판단, 제어 신호 생성 동작을수행할 수 있다. AI 장치는 AI 프로세싱 결과를 직접 이용하는 클라이언트 디바이스이거나, AI 프로세싱 결과를 다른 기기 에 제공하는 클라우드 환경의 디바이스일 수도 있다. AI 장치는 신경망을 학습할 수 있는 컴퓨팅 장치로서, 서버, 데스크탑 PC, 노트북 PC, 태블릿 PC 등과 같은 다양한 전자 장치로 구현될 수 있다. AI 장치는 AI 프로세서, 메모리 및/또는 통신부를 포함할 수 있다. AI 프로세서는 메모리에 저장된 프로그램을 이용하여 신경망을 학습할 수 있다. 특히, AI 프로세서(2 1)는 감시 카메라의 관련 데이터를 인식하기 위한 신경망을 학습할 수 있다. 여기서, 감시 카메라의 관련 데이 터를 인식하기 위한 신경망은 인간의 뇌 구조를 컴퓨터 상에서 모의하도록 설계될 수 있으며, 인간의 신경망의 뉴런(neuron)을 모의하는, 가중치를 갖는 복수의 네트워크 노드들을 포함할 수 있다. 복수의 네트워크 모드들은 뉴런이 시냅스(synapse)를 통해 신호를 주고 받는 뉴런의 시냅틱 활동을 모의하도록 각각 연결 관계에 따라 데 이터를 주고 받을 수 있다. 여기서 신경망은 신경망 모델에서 발전한 딥러닝 모델을 포함할 수 있다. 딥러닝 모 델에서 복수의 네트워크 노드들은 서로 다른 레이어에 위치하면서 컨볼루션(convolution) 연결 관계에 따라 데 이터를 주고 받을 수 있다. 신경망 모델의 예는 심층 신경망(DNN, deep neural networks), 합성곱 신경망(CNN, convolutional deep neural networks), 순환 신경망(RNN, Recurrent Boltzmann Machine), 제한 볼츠만 머신 (RBM, Restricted Boltzmann Machine), 심층 신뢰 신경망(DBN, deep belief networks), 심층 Q-네트워크(Deep Q-Network)와 같은 다양한 딥 러닝 기법들을 포함하며, 컴퓨터비젼, 음성인식, 자연어처리, 음성/신호처리 등의 분야에 적용될 수 있다. 한편, 전술한 바와 같은 기능을 수행하는 프로세서는 범용 프로세서(예를 들어, CPU)일 수 있으나, 인공지능 학 습을 위한 AI 전용 프로세서(예를 들어, GPU)일 수 있다. 메모리는 AI 장치의 동작에 필요한 각종 프로그램 및 데이터를 저장할 수 있다. 메모리는 비 휘발 성 메모리, 휘발성 메모리, 플래시 메모리(flash-memory), 하드디스크 드라이브(HDD) 또는 솔리드 스테이트 드 라이브(SDD) 등으로 구현할 수 있다. 메모리는 AI 프로세서에 의해 액세스되며, AI 프로세서에 의 한 데이터의 독취/기록/수정/삭제/갱신 등이 수행될 수 있다. 또한, 메모리는 본 발명의 일 실시예에 따른 데이터 분류/인식을 위한 학습 알고리즘을 통해 생성된 신경망 모델(예를 들어, 딥 러닝 모델)을 저장할 수 있다. 한편, AI 프로세서는 데이터 분류/인식을 위한 신경망을 학습하는 데이터 학습부를 포함할 수 있다. 데 이터 학습부는 데이터 분류/인식을 판단하기 위하여 어떤 학습 데이터를 이용할지, 학습 데이터를 이용하여 데이터를 어떻게 분류하고 인식할지에 관한 기준을 학습할 수 있다. 데이터 학습부는 학습에 이용될 학습 데이터를 획득하고, 획득된 학습데이터를 딥러닝 모델에 적용함으로써, 딥러닝 모델을 학습할 수 있다. 데이터 학습부는 적어도 하나의 하드웨어 칩 형태로 제작되어 AI 장치에 탑재될 수 있다. 예를 들어, 데이터 학습부는 인공지능(AI)을 위한 전용 하드웨어 칩 형태로 제작될 수도 있고, 범용 프로세서(CPU) 또 는 그래픽 전용 프로세서(GPU)의 일부로 제작되어 AI 장치에 탑재될 수도 있다. 또한, 데이터 학습부 는 소프트웨어 모듈로 구현될 수 있다. 소프트웨어 모듈(또는 인스트럭션(instruction)을 포함하는 프로그램 모 듈)로 구현되는 경우, 소프트웨어 모듈은 컴퓨터로 읽을 수 있는 판독 가능한 비일시적 판독 가능 기록 매체 (non-transitory computer readable media)에 저장될 수 있다. 이 경우, 적어도 하나의 소프트웨어 모듈은 OS(Operating System)에 의해 제공되거나, 애플리케이션에 의해 제공될 수 있다. 데이터 학습부는 학습 데이터 획득부 및 모델 학습부를 포함할 수 있다. 학습 데이터 획득부는 데이터를 분류하고 인식하기 위한 신경망 모델에 필요한 학습 데이터를 획득할 수 있 다. 모델 학습부는 획득된 학습 데이터를 이용하여, 신경망 모델이 소정의 데이터를 어떻게 분류할지에 관한 판 단 기준을 가지도록 학습할 수 있다. 이 때 모델 학습부는 학습 데이터 중 적어도 일부를 판단 기준으로 이 용하는 지도 학습(supervised learning)을 통하여, 신경망 모델을 학습시킬 수 있다. 또는 모델 학습부는 지도 없이 학습 데이터를 이용하여 스스로 학습함으로써, 판단 기준을 발견하는 비지도 학습(unsupervised learning)을 통해 신경망 모델을 학습시킬 수 있다. 또한, 모델 학습부는 학습에 따른 상황 판단의 결과가 올바른지에 대한 피드백을 이용하여 강화 학습(reinforcement learning)을 통하여, 신경망 모델을 학습시킬 수 있다. 또한, 모델 학습부는 오류 역전파법(error back-propagation) 또는 경사 하강법(gradient decent)을포함하는 학습 알고리즘을 이용하여 신경망 모델을 학습시킬 수 있다. 신경망 모델이 학습되면, 모델 학습부는 학습된 신경망 모델을 메모리에 저장할 수 있다. 모델 학습부 는 학습된 신경망 모델을 AI 장치와 유선 또는 무선 네트워크로 연결된 서버의 메모리에 저장할 수도 있다. 데이터 학습부는 인식 모델의 분석 결과를 향상시키거나, 인식 모델의 생성에 필요한 리소스 또는 시간을 절약하기 위해 학습 데이터 전처리부(미도시) 및 학습 데이터 선택부(미도시)를 더 포함할 수도 있다. 학습 데이터 전처리부는 획득된 데이터가 상황 판단을 위한 학습에 이용될 수 있도록, 획득된 데이터를 전처리 할 수 있다. 예를 들어, 학습 데이터 전처리부는, 모델 학습부가 이미지 인식을 위한 학습을 위하여 획득된 학습 데이터를 이용할 수 있도록, 획득된 데이터를 기 설정된 포맷으로 가공할 수 있다. 또한, 학습 데이터 선택부는, 학습 데이터 획득부에서 획득된 학습 데이터 또는 전처리부에서 전처리된 학 습 데이터 중 학습에 필요한 데이터를 선택할 수 있다.선택된 학습 데이터는 모델 학습부에 제공될 수 있다. 또한, 데이터 학습부는 신경망 모델의 분석 결과를 향상시키기 위하여 모델 평가부(미도시)를 더 포함할 수 도 있다. 모델 평가부는, 신경망 모델에 평가 데이터를 입력하고, 평가 데이터로부터 출력되는 분석 결과가 소정 기준을 만족하지 못하는 경우, 모델 학습부로 하여금 다시 학습하도록 할 수 있다. 이 경우, 평가 데이터는 인식 모델을 평가하기 위한 기 정의된 데이터일 수 있다. 일 예로, 모델 평가부는 평가 데이터에 대한 학습된 인식 모델의 분석 결과 중, 분석 결과가 정확하지 않은 평가 데이터의 개수 또는 비율이 미리 설정되 임계치를 초과 하는 경우, 소정 기준을 만족하지 못한 것으로 평가할 수 있다. 통신부는 AI 프로세서에 의한 AI 프로세싱 결과를 외부 전자 기기로 전송할 수 있다. 예를 들어, 외부 전자 기기는 감시카메라, 블루투스 장치, 자율주행 차량, 로봇, 드론, AR 기기, 모바일 기기, 가전 기기 등을 포함할 수 있다. 한편, 도 3에 도시된 AI 장치는 AI 프로세서와 메모리, 통신부 등으로 기능적으로 구분하여 설 명하였지만, 전술한 구성요소들이 하나의 모듈로 통합되어 AI 모듈로 호칭될 수도 있음을 밝혀둔다. 본 명세서는 감시용 카메라, 자율주행 차량, 사용자 단말기 및 서버 중 하나 이상이 인공 지능(Artificial Intelligence) 모듈, 로봇, 증강현실(Augmented Reality, AR) 장치, 가상 현실(Virtual reality, VT) 장치, 5G 서비스와 관련된 장치 등과 연계될 수 있다. 도 4는 본 명세서의 일 실시예에 따른 감시 카메라의 영상 처리 방법의 흐름도이다. 도 4에 도시된 영상 처리 방법은 도 1 내지 도 3을 통해 설명한 감시 카메라 시스템, 감시 카메라 장치, 감시 카메라 장치에 포함된 프로 세서 또는 제어부를 통해 구현될 수 있다. 설명의 편의를 위해 상기 영상 처리 방법은 도 2에 도시된 감시 카메 라의 프로세서를 통해 다양한 기능들이 제어될 수 있음을 전제로 설명하나, 본 명세서는 이에 한정되 는 것이 아님을 밝혀둔다. 도 4를 참조하면, 감시 카메라는 감시 카메라 영상을 획득한다(S400). 상기 획득된 영상에 적어도 하나의 객체를 포함할 수 있으며, 본 명세서의 일 실시예에 다른 감시 카메라의 제어 방법은 상기 영상에 포함된 객체 의 크기, 객체 간의 거리 등을 유추하는데 활용될 수 있다. 감시 카메라는 획득된 영상에서 객체를 인식할 수 있다(S410). 프로세서는 상기 영상에서 AI 기반의 객체 인식 기술을 이용하여 사람의 전신, 머리, 얼굴 등을 검출할 수 있다. 일 실시예에 따라, 본 명세서는 딥 러닝 기반의 YOLO(You Only Look Once) 알고리즘을 적용하여 획득된 영상에서 객체를 분류하고, 분류된 객체에 대하여 객체 인식 결과를 인디케이팅하기 위한 바운딩 박스를 인식된 객체의 테두리를 따라 표시할 수 있다. 도 5의 (a)를 참조하면, 감시 카메라에서 획득된 영상에 사람이 인식된 경우, 두 종류의 바운딩 박스 예를 들어, 두부 영역에 대응되는 제1 바운딩 박스와, 신체 전체길이에 대응되는 제2 바운딩 박스를 표시 할 수 있다. 한편, 도 5의 (b)를 참조하면, 감시 카메라에서 획득된 영상에 제1 객체 후면에 제2 객체가 위치하는 경우, 제2 객체의 적어도 일부는 제1 객체에 가려진 상태일 수 있다. 이 경우, 프로세서는 제1 객체 및 제2 객체 각각에 대하여 제1 바운딩 박스, 제2 바운딩 박스를 표시할 수 있다. 다 만, 상기 제2 바운딩 박스는 제2 객체 전신의 길이를 포함하지 못한다. 이에 따라 제2 바운딩 박스의 길이는 세로 길이가 짧게 표현될 수 있다. 이 경우, 프로세서는 제2 객체의 정확한 크기 정 보를 활용할 수 없다. 이에 따라, 본 명세서의 일 실시예는, 바운딩 박스의 크기 정보가 미리 정해진 범위를 벗 어나는 경우, 객체 전체의 길이가 포함되지 않은 것으로 판단할 수 있으며, 나아가 해당 객체는 다른 객체에 의 해 가려진 상태인 것으로 간주할 수 있다. 다시 도 4를 참조하면, 프로세서는 바운딩 박스의 종횡비(Aspect Ratio)와 미리 정해진 기준 종횡비 (Reference Aspect Ratio)를 비교할 수 있다(S420). 상기 바운딩 박스의 종횡비는 바운딩 박스의 가로길이 대 세로길이를 의미할 수 있다. 미리 정해진 기준 종횡비 는, 객체 인식 결과로 표시되는 바운딩 박스의 크기와 비교하기 위한 것으로서, 감시 카메라의 설치 각도에 따 라 정해질 수 있다. 예를 들어, 감시 카메라의 설치 각도에 따라 동일한 사람의 전신을 검출한 바운딩 박스의 종횡비가 다를 수 있다. 감시 카메라의 설치 각도는 감시 카메라의 위치를 고정시킨 상태에서 카메라 렌즈가 위 치하는 전단부만 상하로 움직였을 때의 각도를 의미할 수 있다. 감시 카메라가 아래를 향하고 있는 경우 영상에 서 획득되는 사람의 신체길이는 상대적으로 짧을 수 있다. 반대로 감시 카메라가 정면에 가깝게 위치하는 경우 영상에서 획득되는 사람의 신체길이는 상대적으로 길게 보여질 수 있다. 이에 따라 감시 카메라의 설치 각도에 따른 기준 종횡비는 아래의 수식으로 산출될 수 있다. 수학식 1"}
{"patent_id": "10-2021-0188664", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기서, tilt는 CCTV 카메라 설치 각도이며, k,b 는 임의의 실수이다. 프로세서는 종횡비 기교 결과, 바운딩 박스의 종횡비가 기준 종횡비 보다 작은 경우, 영상에서 인식된 객 체가 다른 객체에 의해 가려진 것으로 판단할 수 있다(S430). 즉, 본 명세서의 일 실시예는 영상에서 인식된 객 체가 다른 객체에 의해 가려진 상태여부를 복잡한 영상 분석 결과가 아닌, 종횡비 비교를 통해 효율적으로 판단 할 수 있는 바 감시 카메라의 리소스를 절약하면서 객체의 가려짐 여부를 판단할 수 있다. 프로세서는 인식된 객체의 좌표정보를 보정하여 타 객체에 의해 가려진 객체의 전체 길이를 유추할 수 있 다. 일 실시예에 따라, 프로세서는 바운딩 박스의 좌표 정보에 기초하여 객체의 좌표 정보를 보정하여 객 체 전체 길이를 추정할 수 있다(S440). 프로세서는 바운딩 박스의 종횡비가 기준 종횡비 보다 작지 않은 경우, 영상 속의 객체가 다른 객체에 의 해 가려지지 않은 것으로 판단하고, 획득된 객체의 좌표정보를 유지할 수 있다(S425) 이하, 도 6 내지 7를 참조하여, 바운딩 박스의 좌표 정보를 이용하여 인식된 객체의 좌표를 보정함으로써, 가려 진 객체의 전체 길이를 유추하는 과정을 보다 구체적으로 설명한다. 도 6을 참조하면, 프로세서는 감시 카메라 영상에서 객체가 가려진 것으로 판단한 경우, 상기 바운딩 박스 가 인체의 두부 영역(head area) 만을 포함하는 것으로 판단할 수 있다(S600). 본 명세서의 일 실시예에 적용되 는 딥러닝 기반의 객체 인식 알고리즘은, 사람을 인식한 경우, 사람의 전신, 사람의 두부 영역을 인식하도록 훈 련된 모델일 수 있다. 이에 따라, 상기 딥러닝 기반의 객체 인식 알고리즘은 영상에 사람의 전신을 포함하지 안 는 것으로 판단하는 경우, 사람의 두부 영역만을 인식할 수도 있다. 그러나, 객체 인식 방법에 대해서는 전술한 예로 한정되지 않고 다양하게 변형되어 실시될 수 있음은 물론이다. 프로세서는 바운딩 박스의 좌표 및 바운딩 박스의 세로 길이를 이용하여 인체의 발끝 좌표를 추정할 수 있 다(S610). 감시 카메라의 영상에서 사람 간의 거리를 측정하기 위해서는 검출된 각 사람의 지면에서의 거리를 측정하는 것이 일반적이며, 이에 따라 검출된 각 사람의 지면좌표 즉, 사람의 발끝 좌표를 획득할 필요가 있다. 도 7을 참조하면, 본 명세서의 일 실시예에 따르면, 가려진 객체(인체)의 발끝 좌표 정보를 추정하는 방법을 적 용한다. 프로세서는 가려진 객체의 바운딩 박스(B)의 좌표 정보를 활용하여 상기 객체의 발끝좌표를 산출하며, 상 기 발끝 좌표는 사람의 키 정보에 기초할 수 있다. 프로세서는 두부 영역에 대응하는 바운딩 박스(B)를 이용하여 2차원 영상 좌표계에서 사람의 키를 유추할 수 있다. 구체적으로 2차원 영상 좌표계에서 사람의 키는 바운딩 박스(B)의 세로 길이(LH)의 a 배로 설정될 수 있다. 감시 카메라의 설치 사향, 객체의 거리가 충분한 거리에 위치하는 경우, 사람의 머리 길이와 키의 상관 관계는 감시 카메라의 설치 각도(Tilt)값에 충분히 의존적이다. 이에 따라 사람의 추정된 키는 사람의 머리 길 이의 K(k는 실수)로 정의될 수 있다. 이때 k는 감시 카메라의 기준종횡비+α로 정의되며, 기준 종횡비는 감시 카메라의 설치 각도(Tilt)를 인자로 하는 함수이다. 여기서 α값은 감시 카메라 기능의 민감도(sensitivity)에 대응되는 값일 수 있다. 프로세서는 계산된 2차원 영상 좌표계에서의 사람의 키를 바운딩 박스 상단의 중앙 좌표값에 합산하여 사 람의 발끝 좌표를 계산할 수 있다. 상기 사람의 발끝 좌표는 아래의 수식으로 표현될 수 있다. 수학식 2"}
{"patent_id": "10-2021-0188664", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "여기서,"}
{"patent_id": "10-2021-0188664", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "를 나타낸다. 이상, 도 6 내지 도 7에서 설명한 발끝 좌표 추정 방법은, 사람의 키가 사람의 두부 영역의 길이의 임의의 실수 배로 정의될 수 있음을 가정하여, 상기 가정된 사항에 바운딩 박스의 좌표 정보를 적용함으로써, 가려진 객체의 전체 길이를 유추하는 방법을 설명하였다. 그러나, 본 명세서에서 사람의 발끝 좌표를 추정하는 방법은 전술한 예들에 한정되지 않는다. 도 8은 본 명세서의 일 실시예 따라 바운딩 박스의 종횡비를 이용하여 사람의 발끝 좌표를 추정하는 다른 예시 의 흐름도이다. 도 8을 참조하면, 프로세서는 감시 카메라 영상의 바운딩 박스의 종횡비와 미리 정해진 기준 종횡비를 비 교한 결과, 영상에 포함된 객체(사람)의 적어도 일부가 다른 객체에 의해 가려진 것으로 판단한 경우, 바운딩 박스가 인체의 두부 영역(head area)만 포함하는 것으로 판단할 수 있다(S800). 일 실시예 따라, 본 명세서는 카메라 캘리브레이션 정보를 이용하여 사람의 키를 유추할 수도 있다. 카메라 캘 리브레이션은 2차원 여상 좌표계와 2차원 실세계 좌표계 간의 관계를 구하는 과정일 수 있다. 카메라 캘리브레 이션을 통해 2차원 영상 좌표와 3차원 실세계 좌표값의 변환이 가능하다. 프로세서는 바운딩 박스의 2차원 영상좌표(top_x, top_y)와 미리 정해진 인체 길이값을 이용하여 3차원 좌 표값 (x, y, height)을 구성할 수 있다(S810). 2차원 영상좌표와 3차원 실세계 좌표간의 관계는 아래 수식 3으로 표현될 수 있다. 수학식 3"}
{"patent_id": "10-2021-0188664", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "여기서, 2차원 영상 좌표 : , 3차원 실세계 좌표 :"}
{"patent_id": "10-2021-0188664", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "P : 카메라 내·외부 파라미터, K : 카메라 내부 파라미터, R,T : 카메라 외부 파라미터이다. 따라서, 실제 사람의 키가 180cm인 경우, 특정 2차원 영상 좌표로부터 실제로 180cm 떨어진 지점의 2차원 영상 좌표를 계산하는 것이 가능하며, 사람의 두부 영역을 검출한 바운딩 박스의 상단 중앙의 2차원 영상 좌표가 (top_x, top_y)일 때, (top_x, top_y)의 3차원 실세계 좌표를 (x, y, 180cm)로 가정할 수 있다. 이 경우, 프로 세서는 사람의 발 끝의 3차원 실세계 좌표를 (x, y, 0)로 획득할 수 있으며(S820), 프로세서는 이를 상기 카메라 캘리브레이션 정보를 이용하여 2차원 영상 좌표로 변환하여 사람 발 끝의 2차원 영상 좌표(x_foot, y_foot)를 획득할 수 있다(S830). 한편, S810에서 미리 정해진 인체 길이값은 사람의 성별에 따라 달리 적용될 수 있다. 따라서 프로세서는 딥러닝 기반의 알고리즘을 이용하여 객체를 인식하여 객체의 성별을 분류하고, 분류된 성별이 남성인지 여성인 지 여부에 따라 미리 정해진 인체 길이값을 서로 다르게 적용될 수 있다. 적용되는 인체 길이값은 남성과 여성 각각에 대하여 평균 신장이 적용될 수 있다. 전술한 본 발명은, 프로그램이 기록된 매체에 컴퓨터가 읽을 수 있는 코드로서 구현하는 것이 가능하다. 컴퓨터 가 읽을 수 있는 매체는, 컴퓨터 시스템에 의하여 읽혀질 수 있는 데이터가 저장되는 모든 종류의 기록장치를 포함한다. 컴퓨터가 읽을 수 있는 매체의 예로는, HDD(Hard Disk Drive), SSD(Solid State Disk), SDD(Silicon Disk Drive), ROM, RAM, CD-ROM, 자기 테이프, 플로피 디스크, 광 데이터 저장 장치 등이 있으며, 또한 캐리어 웨이브(예를 들어, 인터넷을 통한 전송)의 형태로 구현되는 것도 포함한다. 따라서, 상기의 상세한 설명은 모든 면에서 제한적으로 해석되어서는 아니되고 예시적인 것으로 고려되어야 한다. 본 명세서의 범위는 첨부된 청구 항의 합리적 해석에 의해 결정되어야 하고, 본 발명의 등가적 범위 내에서의 모든 변경은 본 발명의 범위에 포 함된다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8"}
{"patent_id": "10-2021-0188664", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 명세서에 관한 이해를 돕기 위해 상세한 설명의 일부로 포함되는, 첨부 도면은 본 명세서에 대한 실시예를 제공하고, 상세한 설명과 함께 본 명세서의 기술적 특징을도 설명한다. 도 1은 본 명세서의 일 실시예에 따른 감시 카메라의 영상 처리 방법을 구현하기 위한 감시 카메라 시스템을 설 명하기 위한 도면이다. 도 2는 본 명세서의 일 실시예에 따른 감시 카메라의 개략적인 블록도이다. 도 3은 본 명세서의 일 실시예에 따른 감시 카메라 영상의 분석에 적용되는 AI 장치(모듈)을 설명하기 위한 도 면이다. 도 4는 본 명세서의 일 실시예에 따른 감시 카메라의 제어 방법의 흐름도이다. 도 5는 본 명세서의 일 실시예에 따라 객체 인식 결과를 바운딩 박스로 표시하는 예시를 설명한다. 도 6은 본 명세서의 일 실시예에 따라 바운딩 박스의 종횡비를 이용하여 사람의 발끝 좌표를 추정하는 흐름도이 다. 도 7은 도 6에 도시된 흐름도를 설명하기 위한 도면이다. 도 8은 본 명세서의 일 실시예 따라 바운딩 박스의 종횡비를 이용하여 사람의 발끝 좌표를 추정하는 다른 예시 의 흐름도이다. 본 명세서에 관한 이해를 돕기 위해 상세한 설명의 일부로 포함되는, 첨부 도면은 본 발명에 대한 실시예를 제 공하고, 상세한 설명과 함께 본 발명의 기술적 특징을 설명한다."}
