{"patent_id": "10-2023-7030491", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0159399", "출원번호": "10-2023-7030491", "발명의 명칭": "어두운 색상 및 검정색 플라스틱들의 소팅", "출원인": "솔테라 테크노롤지스 인코포레이티드", "발명자": "쿠마르, 날린"}}
{"patent_id": "10-2023-7030491", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "물질들의 혼합물을 취급하기 위한 시스템으로서,물질들의 혼합물의 중파장 적외선(\"MWIR\") 이미지 데이터를 생성하도록 구성된 MWIR 카메라; 및머신 러닝 시스템을 통해 물질들의 혼합물의 MWIR 이미지 데이터를 처리하여 물질들의 혼합물 중 특정 물질들을어두운 색상 플라스틱 조각들을 함유하는 것으로서 분류하도록 지식 기반으로 구성된 머신 러닝 시스템을 포함하는 데이터 처리 시스템을 포함하고,상기 지식 기반에는 어두운 색상 플라스틱 조각들을 인식하도록 훈련된 이전에 생성된 파라미터들의 라이브러리가 포함되는, 물질들의 혼합물을 취급하기 위한 시스템."}
{"patent_id": "10-2023-7030491", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 어두운 색상 플라스틱 조각들은 검정색 플라스틱 조각들인, 물질들의 혼합물을 취급하기 위한 시스템."}
{"patent_id": "10-2023-7030491", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서,상기 MWIR 카메라를 통과하여 물질들의 혼합물을 이송하도록 구성된 컨베이어 시스템; 및물질들의 혼합물 중 특정 물질들의 분류의 함수로서 물질들의 혼합물로부터 물질들의 혼합물 중 분류된 특정 물질들을 소팅하도록 구성된 소팅 장치를 더 포함하는, 물질들의 혼합물을 취급하기 위한 시스템."}
{"patent_id": "10-2023-7030491", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2 항에 있어서,상기 이전에 생성된 파라미터들의 라이브러리는 MWIR 카메라를 통과하여 이송될 때 검정색 플라스틱 조각들의균질한 샘플들의 세트로부터 포착된 MWIR 이미지들로 훈련된, 물질들의 혼합물을 취급하기 위한 시스템."}
{"patent_id": "10-2023-7030491", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1 항에 있어서,상기 이전에 생성된 파라미터들의 라이브러리는 MWIR 카메라를 통과하여 이송될 때 어두운 색상 플라스틱 조각들의 균질한 샘플들의 세트로부터 포착된 MWIR 이미지들로 훈련된, 물질들의 혼합물을 취급하기 위한 시스템."}
{"patent_id": "10-2023-7030491", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1 항에 있어서,상기 머신 러닝 시스템은 인공 지능 신경망을 포함하며, 상기 파라미터들은 신경망 파라미터들인, 물질들의 혼합물을 취급하기 위한 시스템."}
{"patent_id": "10-2023-7030491", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제2 항에 있어서,상기 MWIR 이미지 데이터는 물질들의 혼합물의 MWIR 분광 이미징의 결과로서 생성되는, 물질들의 혼합물을 취급하기 위한 시스템."}
{"patent_id": "10-2023-7030491", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "공개특허 10-2023-0159399-3-제1 항에 있어서,상기 어두운 색상 플라스틱 조각들은 NIR 분광법을 사용하여 식별될 수 없는, 물질들의 혼합물을 취급하기 위한시스템."}
{"patent_id": "10-2023-7030491", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "어두운 색상 플라스틱 조각들을 포함하는 물질들의 혼합물을 취급하기 위한 방법으로서,물질들의 혼합물의 MWIR 이미지 데이터를 생성하는 단계;어두운 색상 플라스틱 조각들과 관련된 이전에 생성된 MWIR 분광 특성들의 라이브러리를 포함하는 지식 기반으로 구성된 머신 러닝 시스템을 통해 상기 MWIR 이미지 데이터를 처리하는 단계; 및머신 러닝 시스템을 통해 물질들의 혼합물의 MWIR 이미지 데이터의 처리의 함수로서 물질들의 혼합물 중 특정물질들에 어두운 색상 플라스틱 조각들을 포함하는 것으로서 분류를 할당하는 단계를 포함하는, 물질들의 혼합물을 취급하기 위한 방법."}
{"patent_id": "10-2023-7030491", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9 항에 있어서,MWIR 이미지 데이터를 생성하도록 구성된 MWIR 카메라를 통과하여 물질들의 혼합물을 이송하는 단계; 및상기 분류의 함수로서 혼합물로부터 물질들의 혼합물 중 특정 물질들을 소팅하는 단계를 더 포함하는, 물질들의혼합물을 취급하기 위한 방법."}
{"patent_id": "10-2023-7030491", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9 항에 있어서,상기 이전에 생성된 MWIR 분광 특성들의 라이브러리는 MWIR 카메라를 통과하여 이송될 때 어두운 색상 플라스틱조각들을 포함하는 물질 조각들의 균질한 샘플들의 세트의 MWIR 이미지들을 포착하도록 구성된 MWIR 카메라에의해 포착된, 물질들의 혼합물을 취급하기 위한 방법."}
{"patent_id": "10-2023-7030491", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10 항에 있어서,상기 어두운 색상 플라스틱 조각들은 검정색 플라스틱 조각들인, 물질들의 혼합물을 취급하기 위한 방법."}
{"patent_id": "10-2023-7030491", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12 항에 있어서,상기 이전에 생성된 MWIR 분광 특성들의 라이브러리는 MWIR 카메라를 통과하여 이송될 때 검정색 플라스틱 조각들을 포함하는 물질 조각들의 균질한 샘플들의 세트의 MWIR 이미지들을 포착하도록 구성된 MWIR 카메라에 의해포착된, 물질들의 혼합물을 취급하기 위한 방법."}
{"patent_id": "10-2023-7030491", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13 항에 있어서,상기 머신 러닝 시스템은 인공 지능 신경망을 포함하며, 파라미터들은 신경망 파라미터들인, 물질들의 혼합물을취급하기 위한 방법."}
{"patent_id": "10-2023-7030491", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제12 항에 있어서,상기 MWIR 이미지 데이터는 물질들의 혼합물의 MWIR 분광 이미징의 결과로 생성되는, 물질들의 혼합물을 취급하기 위한 방법.공개특허 10-2023-0159399-4-청구항 16 제12 항에 있어서,상기 검정색 플라스틱 조각들은 NIR 분광법을 사용하여 식별될 수 없는, 물질들의 혼합물을 취급하기 위한방법."}
{"patent_id": "10-2023-7030491", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "실행 시 어두운 색상 플라스틱 조각들을 포함하는 분리 가능 물질들의 이질적인 혼합물을 취급하기 위한 방법을수행하는 컴퓨터 판독 가능 저장 매체에 저장된 컴퓨터 프로그램 제품으로서,MWIR 카메라로 포착된 이질적인 물질들의 혼합물 각각의 MWIR 이미지 데이터를 수신하는 것; 그리고머신 러닝 시스템에 의한 MWIR 이미지 데이터의 처리에 기초하여, 머신 러닝 시스템에 의해 물질들의 이질적인혼합물 중 특정 물질들에 어두운 색상 플라스틱 조각들을 포함하는 것으로서 분류를 할당하는 것을 포함하고,상기 분류는 어두운 색상 플라스틱 조각들의 하나 이상의 예들에 대한 이전에 생성된 분류로부터 생성된 지식기반에 기초하는, 컴퓨터 프로그램 제품."}
{"patent_id": "10-2023-7030491", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17 항에 있어서,상기 지식 기반은 어두운 색상 플라스틱 조각들의 하나 이상의 예들의 MWIR 이미지들을 포착하도록 구성된 MWIR카메라에 의해 포착된 관찰된 MWIR 분광 특성들의 라이브러리를 포함하는, 컴퓨터 프로그램 제품."}
{"patent_id": "10-2023-7030491", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18 항에 있어서,자동화 소팅 디바이스가 분류의 함수로서 이질적인 혼합물로부터 물질들의 이질적인 혼합물 중 특정 물질들을소팅할 수 있도록 분류들에 관한 정보를 상기 자동화 소팅 디바이스로 송신하는 것을 더 포함하는, 컴퓨터 프로그램 제품."}
{"patent_id": "10-2023-7030491", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19 항에 있어서,상기 어두운 색상 플라스틱 조각들은 검정색 플라스틱 조각들인, 컴퓨터 프로그램 제품."}
{"patent_id": "10-2023-7030491", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "비전 시스템 또는 하나 이상의 중파장 적외선 카메라들로 구현된 하나 이상의 센서 시스템들을 활용하여 어두운 색상 및/또는 검정색 플라스틱 물질들을 분류 및 소팅하는 시스템들 및 방법들로서, 포착된 이미지 데이터를 머 신 러닝 시스템 내에서 처리하여 물질들 각각을 식별 또는 분류한 다음 이러한 식별 또는 분류에 기초하여 별도 의 그룹들로 소팅할 수 있는 시스템들 및 방법들."}
{"patent_id": "10-2023-7030491", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 출원은 미국 가특허 출원 제63/146,892호 및 미국 가특허 출원 제63/173,301호에 대한 우선권을 주장한다. 본 출원은 미국 가특허 출원 제62/193,332호에 대한 우선권을 주장하는 미국 특허 출원 제15/213,129호(미국 특 허 제10,207,296호로 발행됨)의 일부 계속 출원인 미국 가특허 출원 제62/490,219호에 대한 우선권을 주장하는 미국 특허 출원 제15/963,755호(미국 특허 제10,710,119호로 발행됨)의 일부 계속 출원인 미국 특허 출원 제 16/375,675호(미국 특허 제10,722,922호로 발행됨)의 계속 출원인 미국 특허 출원 제16/939,011호의 일부 계속 출원인 미국 특허 출원 제17/227,245호의 일부 계속 출원인 미국 특허 출원 제17/380,928호의 일부 계속 출원인 미국 특허 출원 제17/495,291호의 일부 계속 출원이며, 이들 모두는 본 명세서에 참고로 포함된다. 본 출원은 또한 미국 특허 출원 제15/963,755호(미국 특허 제10,710,119호로 발행됨)의 일부 계속 출원인 미국 특허 출원 제16/358,374호(미국 특허 제10,625,304호로 발행됨)의 분할 출원인 미국 특허 출원 제16/852,514호의 일부 계 속 출원인 미국 특허 출원 제17/491,415호의 일부 계속 출원이다. 정부 라이선스 권한들 본 개시는 미국 에너지부가 부여한 보조금 제DE-AR0000422호에 따라 미국 정부의 지원을 받아 작성되었다. 미 국 정부는 본 개시에 대해 특정 권리들을 가질 수 있다.기술 분야 본 개시는 일반적으로 플라스틱들의 소팅에 관한 것으로, 특히 도시 또는 산업 고형 폐기물로부터 어두운 색상 및 검정색 플라스틱들의 소팅에 관한 것이다."}
{"patent_id": "10-2023-7030491", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "본란은 본 개시의 예시적인 실시예들과 연관될 수 있는 방면의 다양한 양태들을 소개하기 위한 것이다. 이러한 논의는 본 개시의 특정 양태들에 대한 보다 나은 이해를 용이하게 하는 뼈대를 제공하는 데 도움이 될 것으로 여겨진다. 따라서, 본 란은 이러한 관점에서 읽어야 하며, 반드시 종래 기술을 인정하는 것으로 이해되어야 하 는 것은 아니다. 재활용은 쓰레기로서 버려질 수 있는 물질들(예를 들어, 폐기물 흐름들로부터의)을 수집 및 처리하여 이들을 새 로운 제품들로 바꾸거나 적어도 보다 적절한 처분을 가능하게 하는 공정이다. 재활용은 매립지들로 보내지는 폐기물의 양을 줄이고, 목재, 물 및 광물들과 같은 천연자원들을 보존하며, 국내 물질들의 공급원을 활용하여 경제적 안정성을 높이고, 새로운 원자재들 수집의 필요성을 줄여 오염을 방지하고, 에너지를 절약하므로 지역사 회들과 환경에 이점들이 있다. 수거 후 재활용품들은 물질 회수 시설(\"MRF\")로 보내져 소팅, 세척 및 제조에 사용될 수 있는 물질들로 처리될 수 있다. 결과적으로, 고도로 혼합된 폐기물 흐름들을 경제적으로 소팅하는 처리량이 많은 자동화된 소팅 플랫폼들은 다양한 산업 분야들 전반에서 유용할 것이다. 따라서, 높은 처리량으 로 혼합된 산업 또는 도시 고형 폐기물 흐름들을 식별, 분석 및 분리하여 후속 처리를 위한 고품질 공급원료들 (낮은 수준들의 미량의 오염물질들을 포함할 수 있음)을 경제적으로 생성할 수 있는 비용 효율적인 소팅 플랫폼 들이 필요하다. 전형적으로, MRF들은 많은 물질들을 구별할 수 없어 소팅된 물질들의 품질이 낮고 가치가 낮은 시장들로 제한되거나, 너무 느리고 노동 집약적이며 비효율적이어서 경제적으로 재활용하거나 회수할 수 있는 물질의 양이 제한된다. 도시 고형 폐기물(\"MSW\")은 가정, 상업 및 산업 배출원들을 포괄하는 폐기물 흐름들에 대한 광범위한 용어이다. 이러한 범주들 각각에는 수천 가지의 서로 다른 물질들과 제품들이 있다. EPA는 2017년에 2억 6,780 만 톤의 MSW가 발생했다고 보고했다. 동 MSW의 총 중량 중 13.2 ％에 해당하는 3,537 만 톤이 플라스틱들로 구성되었다. 3,537 만 톤의 플라스틱들 중 296 만 톤(8.4 ％)의 플라스틱은 재활용되었고, 559 만 톤(15.8 ％)은 에너지 회수를 통해 연소되었으며, 2,682 만 톤(75.8 ％)은 매립되었다. 플라스틱들을 더 많이 재활용할 필요가 있는 것은 분명하다. 플라스틱 재활용은 플라스틱 폐기물을 새롭고 유용한 제품들로 재가공하는 것이다. 거의 모든 플라스틱은 생분 해되지 않아 환경에 축적되기 때문에 재활용이 필요하다. 현재, 거의 모든 재활용은 사용한 플라스틱을 재용해 하여 새로운 물품들로 재탄생시키는 소위 기계적 재활용으로 이루어지고 있다. 이는 화학적 수준에서 폴리머를 분해할 수 있으며, 플라스틱 폐기물을 재처리하기 전에 색상과 폴리머 유형별로 소팅해야 하므로 복잡하고 비용 이 많이 든다. 이 과정이 실패하면 일관되지 않은 특성들을 가진 물질들이 생산될 수 있으며, 이는 산업계에서 매력적이지 않다. 공급원료 재활용으로 알려진 대안적 접근 방식에서는 플라스틱 폐기물을 다시 원래의 화학 물질들로 전환한 다음 다시 새로운 플라스틱으로 재가공할 수 있다. 이는 더 많은 재활용을 기대할 수 있지만 에너지 및 자본 비용들이 높다는 단점이 있다. 플라스틱 폐기물은 에너지 회수의 일환으로서 화석 연료들 대신 소각할 수도 있다. 현재, 일부 플라스틱들만 재활용이 가능하다. 플라스틱들이 재활용될 때는 일반적으로 서로 다른 유형들의 플 라스틱들로 소팅된다. 재활용률들도 플라스틱의 유형들에 따라 다르다. 여러 유형들이 일반적으로 사용되며, 각각의 유형마다 화학적 및 물리적 특성들이 다르다. 이는 소팅 및 재처리 용이성의 차이들로 이어지며, 이는 회수된 물질들의 가치와 시장 규모에 영향을 미친다. 단일 물질(예를 들어, 폴리에틸렌 테레프탈레이트 (\"PET\"), 고밀도 폴리에틸렌(\"HDPE\") 및 폴리프로필렌(\"PP\"))로 만들어진 플라스틱 포장 및 제품들은 더 쉽게 재활용할 수 있다. 재활용이 거의 불가능하거나 가끔 재활용이 가능한 플라스틱들에는 폴리염화비닐(\"PVC\"), 저밀도 폴리에틸렌(\"LDPE\"), 선형 저밀도 폴리에틸렌(\"LLDPE\") 및 폴리스티렌(\"PS\")이 포함된다. 추가적으로, 플라스틱은 재활용 횟수가 제한되어 있다. 최신 단일 흐름 MRF들 및 플라스틱 재생업체들에서는 유입되는 물질의 양이 많기 때문에 고속으로 물질을 이동 시키고 소팅할 수 있는 처리 장비가 필요하다. 동시에 가장 순수하고 오염이 적은 흐름들로부터 가장 높은 가 치를 얻게 된다. 이러한 다소 모순적인 목표들을 달성하기 위해, 오늘날의 단일 흐름 MRF들 및 재생업체들은 투과 또는 반사를 통해 근적외선(\"NIR\") 시그니처로 플라스틱 포장을 소팅하는 자동화된 장비를 사용한다. 이러한 센서들은 외부 공급원으로부터의 광의 반사에 의존하며 물질의 표면만 볼 수 있다. 또한, 이 센서로부터 는 폴리머 정보만 포착된다. 예를 들어, NIR 분광법은 투명하고 연한 청색 PET인 #1 유형의 플라스틱들 및 # 2 HDPE는 식별할 수 있지만, #1 유색 PET, #3 PVC, #4 LDPE, #5 PP, #6 PS 및 #7 다층 폴리머들, 복합 폴리머들, 아크릴 및 나일론과 같은 다른 플라스틱들은 거부할 수 있다. 또한, NIR 분광법은 검정색 또는 짙은 유색(어둡 게 착색된) 플라스틱들은 물론 플라스틱 코팅 종이 및 다층 포장(폴리머 다층 필름들로 제작)과 같은 복합 물질 들도 정확하게 식별할 수 없어 잘못된 판독값들을 제공할 수 있다. 대부분의 검정색 플라스틱은 탄소를 사용하 여 착색된다. 검정색 플라스틱들은 자동차 산업, 전자제품들, 식품 포장들, 비닐봉지들 등에 널리 사용된다. 그러나, 검정색 플라스틱들은 가시광선을 흡수할 뿐만 아니라 스펙트럼의 근적외선 부분도 흡수하기 때문에 NIR 분광법에서는 보이지 않는 아쉬운 부작용이 있다. 따라서, '은밀한(stealthy)' 검정색 플라스틱은 검출되지 않 은 채 컨베이어의 단부에 있는 '기타' 통으로 들어가 에너지용으로 태워지거나 매립지에 버려진다. 폐쇄 루프 또는 1 차 재활용에서는 폐플라스틱이 비슷한 품질과 종류의 새 물품들로 다시 재활용된다(예를 들어, 음료수병들을 다시 음료수병들로 바꾸는 것). 그러나, 품질 저하 없이 플라스틱을 지속적으로 기계적으 로 재활용하는 것은 누적된 폴리머 분해와 오염물질 축적 위험으로 인해 매우 어려운 일이다. 많은 폴리머들에 대해 폐쇄 루프 재활용이 연구되어 왔지만, 현재까지 산업적으로 성공한 것은 PET 병 재활용뿐이다. 개방 루프 또는 2 차 재활용(다운사이클링이라고도 함)에서는 재활용할 때마다 플라스틱의 품질이 떨어지기 때 문에 물질이 무한정 재활용할 수 없고 결국 폐기물이 된다. PET 병들을 양털이나 기타 섬유들로 재활용하는 것 이 일반적인 예이며, PET 재활용의 대부분을 차지한다. 새로운 제품을 만들 때 재활용 플라스틱과 원물질 또는 호환 플라스틱들을 혼합하면 폴리머 품질 저하를 상쇄할 수 있다. 열경화성 폴리머들은 녹지 않지만 기계적 재활용을 위한 기술들이 개발되었다. 여기에는 일반적으로 물질을 부 스러기 형태로 분해한 다음 일종의 결합제와 혼합하여 새로운 복합 물질을 형성하는 과정이 포함된다. 공급원료 또는 3 차 재활용(화학적 재활용이라고도 함)에서는 폴리머들을 화학적 구성 블록들(모노머들)로 환원 한 다음 다시 중합하여 새로운 플라스틱들로 만들 수 있다. 열분해와 화학적 해중합은 공급원료 재활용의 두 가지 유형들이다. 에너지 재활용 또는 4 차 재활용이라고도 하는 에너지 회수는 에너지 생산을 위해 화석 연료들 대신 플라스틱 폐기물을 태우는 것을 포함한다. 고철을 재활용할 때 특정 종류들의 플라스틱을 (코크스 대신) 탄소원으로서 사용할 수 있는 공정이 개발되었다. 분쇄된 플라스틱은 특정 적용예들에서 건설 골재 또는 충전재로 사용될 수 있다. 플라스틱 폐기물은 폐기물 에너지화 공정에서 폐기물 재생 연료(\"RDF\")로서 단순 소각하거나 먼저 화학적으로 합성 연료로 전환할 수 있다. 연소시 다량의 염화수소(HCl)를 발생시켜 장비를 부식시키고 연료 제품들의 바람 직하지 않은 염소화를 유발할 수 있으므로, 어떤 방식이든 PVC를 제외하거나 이염소화 기술들을 설치하여 이를 보완해야 한다. 혼합 플라스틱 폐기물은 해중합하여 합성 연료를 만들 수 있다. 이는 원래 플라스틱보다 발열량이 높고 연소 효율이 높을 수 있지만 화석 연료들에 비해 효율은 떨어진다. 다양한 전환 기술들이 연구되어 왔으며, 그 중 열분해가 가장 일반적이다. 열분해에 촉매를 사용하면 더 높은 가치를 지닌 더 나은 제품을 얻을 수 있다. 소 각이 널리 사용되는 것에 비해 플라스틱 연료화 기술들은 플라스틱을 수거하고 소팅하는 데 드는 비용들과 생산 된 연료의 가치가 상대적으로 낮기 때문에 역사적으로 경제성을 확보하는 데 어려움을 겪어왔다."}
{"patent_id": "10-2023-7030491", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시의 다양한 상세 실시예들이 본 명세서에 개시되어 있다. 그러나, 개시된 실시예들은 단지 본 개시의 예 시일 뿐이며, 다양하고 대안적인 형태들로 구현될 수 있다는 것을 이해해야 한다. 도면들은 반드시 실척대로인 것은 아니며, 일부 특징들은 특정 구성요소들의 상세들을 보여주기 위해 과장되거나 최소화될 수 있다. 따라서, 본 명세서에 개시된 특정 구조적 및 기능적 상세들은 제한적인 것으로 해석되어서는 안 되며, 단지 당 업자에게 본 개시의 다양한 실시예들을 사용하도록 교시하기 위한 대표적인 근거로서만 해석되어야 한다. 본 명세서에서 사용되는 바와 같이, \"물질들\"은 금속들(철 및 비철), 금속 합금들, 플라스틱들(본 명세서에 개 시되거나, 산업계에 공지되어 있거나, 장래에 새롭게 생성될 플라스틱들 중 임의의 플라스틱을 포함(그러나, 이 에 제한되지 않음)), 고무, 발포체, 유리(붕규산염 또는 소다 석회 유리 및 다양한 유색 유리를 포함(그러나, 이에 제한되지 않음)), 세라믹들, 종이, 판지, 테프론, PE, 번들 전선들, 절연 피복 전선들, 희토류 원소들, 잎 들, 목재, 식물들, 식물들의 일부들, 직물들, 바이오 폐기물, 포장, 전자 폐기물, 배터리들 및 축전지들, 수명 이 다한 차량들, 채광, 건설, 및 철거 폐기물, 농작물 폐기물들, 산림 잔재물들, 목적 재배 풀들, 목질 에너지 작물들, 미세 조류, 도시 음식물 쓰레기, 음식물 쓰레기, 유해 화학 및 생물의학 폐기물들, 건설 잔해, 농장 폐 기물들, 생물성 물품들, 비생물성 물품들, 특정 탄소 함량이 있는 객체들, 도시 고형 폐기물 내에서 발견될 수 있는 임의의 다른 객체들, 그리고 본 명세서에 공개된 센서 기술들 중 임의의 기술을 포함하는(그러나, 이에 제 한되지 않음) 하나 이상의 센서 시스템들에 의한 것을 포함하는(그러나, 이에 제한되지 않음) 것에 의해 서로 구별될 수 있는 전술한 것들 중 임의의 것의 추가 유형들 또는 분류들을 포함하여, 본 명세서에 공개된 임의의 다른 객체들, 물품들 또는 물질들을 포함하는(그러나, 이에 제한되지 않음) 임의의 물품 또는 객체를 포함할 수 있다. \"물질\"은 화학 원소, 화학 원소들의 화합물 또는 혼합물 또는 화학 원소들의 화합물 또는 혼합물로 구성된 임의 의 물품 또는 객체를 포함할 수 있으며, 여기서 화합물 또는 혼합물의 복잡성은 단순한 것부터 복잡한 것까지 다양할 수 있다. 본 명세서에서 사용되는 바와 같이, \"원소\"는 본 출원의 출원일 이후에 발견될 수 있는 원소 들을 포함하여 원소들의 주기율표의 화학 원소를 의미한다. 본 개시 내에서 \"스크랩\", \"스크랩 조각들\", \"물질 들\" 및 \"물질 조각들\"이라는 용어들은 상호 교환적으로 사용될 수 있다. 업계에서 잘 알려진 바와 같이, '폴리머'는 반복되는 많은 하위 단위들로 구성된 매우 큰 분자들 또는 거대 분 자들로 구성된 성분 또는 물질이다. 폴리머는 자연에서 발견되는 천연 폴리머 또는 합성 폴리머일 수 있다. \"다층 폴리머 필름들\"은 두 개 이상의 서로 다른 조성물들로 구성되고, 최대 약 7.5-8 × 10-4 m의 두께를 가질 수 있다. 층들은 적어도 부분적으로 인접하고, 바람직하지만 선택적으로 공존한다. 본 명세서에서 사용되는 바와 같이, \"플라스틱\", \"플라스틱 조각\" 및 \"플라스틱 물질의 조각\"(이들 모두 상호 교환적으로 사용될 수 있음)이라는 용어들은 하나 이상의 폴리머들 및/또는 다층 폴리머 필름들의 폴리머 조성 물을 포함하거나 이들로 구성되는 임의의 객체를 지칭한다. 본 명세서에 사용되는 바와 같이, \"어두운 색상 플라스틱(dark colored plastic))\"은 NIR 분광법에 의해 다른 더 밝은 유색 플라스틱들과 구별될 수 없는 어두운 색상의 색소를 가진 임의의 유형의 플라스틱 물질이다.본 명세서에 사용되는 바와 같이, \"검정색 플라스틱\"은 실질적으로 검정색인 색소를 가진 임의의 유형의 플라스 틱 물질이다. 본 명세서에서 사용되는 바와 같이, \"화학적 시그니처\"라는 용어는 하나 이상의 분석 기기들에 의해 생성되는 것과 같이 고유한 패턴(예를 들어, 지문 스펙트럼)을 의미하며, 샘플에 하나 이상의 특정 원소들 또는 분자들 (폴리머들 포함)이 존재함을 나타낸다. 원소들 또는 분자들은 유기 및/또는 무기일 수 있다. 이러한 분석 기 기들은 본 명세서에 개시된 센서 시스템들 중 임의의 시스템을 포함한다. 본 개시의 실시예들에 따라, 본 명세 서에 개시된 하나 이상의 센서 시스템들은 물질 조각(예를 들어, 플라스틱 조각)의 화학적 시그니처를 생성하도 록 구성될 수 있다. 본 명세서에 사용되는 바와 같이, \"분획(fraction)\"은 유기 및/또는 무기 원소들 또는 분자들, 폴리머 유형들, 플라스틱 유형들, 폴리머 조성들, 플라스틱들의 화학적 시그니처들, 플라스틱 조각의 물리적 특성들(예를 들어, 색상, 투명도, 강도, 융점, 밀도, 형상, 크기, 제조 유형, 균일성, 자극들에 대한 반응 등) 등의 임의의 특정 조합을 의미하며, 여기에는 본 명세서에 개시된 플라스틱들의 다양한 분류들 및 유형들이 모두 포함된다. 분획 들에 대한 비제한적인 예들에는 하나 이상의 서로 다른 유형들의 플라스틱 조각들이 있으며, 여기에는 LDPE와 상대적으로 높은 비율의 알루미늄; LDPE 및 PP와 상대적으로 낮은 비율의 철; PP와 아연; PE, PET 및 HDPE의 조 합들; 임의의 유형의 적색 LDPE 플라스틱 조각들; PVC를 제외한 플라스틱 조각들의 임의의 조합; 어두운 색상 플라스틱 조각들 및/또는 검정색 플라스틱 조각들; 적어도 부분적으로 어두운 색상 및/또는 검정색 플라스틱 물 질로 구성된 플라스틱 조각들; 특정 유기 및 무기 분자들의 조합을 포함하는 #3 내지 #7 유형 플라스틱들의 조 합들; 하나 이상의 서로 다른 유형들의 다층 폴리머 필름들의 조합들; 특정 오염 물질 또는 첨가제를 포함하지 않는 특정 플라스틱들의 조합들; 융점이 특정 임계값보다 큰 임의의 유형들의 플라스틱들; 복수의 특정 유형들 의 임의의 열경화성 플라스틱; 염소를 포함하지 않는 특정 플라스틱들; 유사한 밀도들을 갖는 플라스틱들의 조 합들; 유사한 극성들을 갖는 플라스틱들의 조합들; 뚜껑들이 부착되지 않은 플라스틱 병들 또는 그 반대의 경우 도 마찬가지로 포함된다. \"촉매 열분해\"는 산소가 없고 촉매가 있는 상태에서 고분자 물질들을 가열하여 이들을 분해하는 것을 수반한다. \"미리결정된\"이라는 용어는 미리 설정되거나 결정된 것을 의미한다. \"스펙트럼 이미징\"은 전자기 스펙트럼의 다수의 대역들을 사용하는 이미징이다. 일반 카메라는 가시광선 스펙 트럼의 적색, 녹색 및 청색(RGB)의 세 파장 대역들에 걸쳐 광을 포착하지만, 스펙트럼 이미징은 RGB를 포함하지 만 그 이상의 광범위한 기술들을 포괄한다. 스펙트럼 이미징은 적외선(예를 들어, MWIR), 가시광선, 자외선 및 /또는 x-선 스펙트럼들을 사용하거나 이들의 일부 조합을 사용할 수 있다. 스펙트럼 데이터 또는 스펙트럼 이 미지 데이터는 스펙트럼 이미지의 디지털 데이터 표현이다. 스펙트럼 이미징에는 가시광선 및 비가시광선 대역 들의 스펙트럼 데이터를 동시에 수집하거나, 가시광선 범위 밖에서 조명을 비추거나, 광학 필터들을 사용하여 특정 스펙트럼 범위를 포착하는 것이 포함될 수 있다. 스펙트럼 이미지의 각각의 픽셀에 대해 수백 개의 파장 대역들을 포착하는 것도 가능하다. 본 명세서에서 사용되는 바와 같이, \"이미지 데이터 패킷\"이라는 용어는 개별 물질 조각의 포착된 스펙트럼 이 미지와 관련된 디지털 데이터의 패킷을 지칭한다. 본 명세서에서 사용되는 바와 같이, \"식별하다\" 및 \"분류하다\"라는 용어들, \"식별\" 및 \"분류\"라는 용어들 및 이 들 용어들의 임의의 파생 용어들은 상호 교환적으로 사용될 수 있다. 본 명세서에서 사용되는 바와 같이, 물질 의 조각을 \"분류한다\"는 것은 해당 물질의 조각이 속하는 물질들의 유형들 또는 부류들을 결정(즉, 식별)하는 것이다. 예를 들어, 본 개시의 특정 실시예들에 따라, 센서 시스템(본 명세서에서 추가로 설명됨)은 물질들을 분류하기 위한 임의의 유형의 정보를 수집 및 분석하도록 구성될 수 있으며, 이러한 분류들은 소팅 시스템 내에 서 활용되어 하나 이상의 물리적 및/또는 화학적 특성들(예를 들어, 사용자가 정의할 수 있음)의 세트의 함수로 서 물질 조각들을 선택적으로 소팅할 수 있으며, 이러한 특성들에는 색상, 질감, 색조, 형상, 밝기, 무게, 밀도, 조성, 크기, 균일성, 제조 유형, 화학적 시그니처, 미리결정된 분획, 방사성 시그니처, 광, 소리 또는 기 타 신호들에 대한 투과성 및 물질 조각들의 배출 및/또는 반사된 전자기 방사선(\"EM\")을 포함한 다양한 필드들 과 같은 자극들에 대한 반응을 포함한다(그러나, 이에 제한되지 않음). 본 명세서에서 사용되는 바와 같이, \" 제조 유형\"은 단조 공정에 의해 형성되거나, (소모성 금속 주조, 영구적 금속 주조 및 분말 야금을 포함하는(그 러나, 이에 제한되지 않음)) 주조에 의해 형성되거나, 단조에 의해 형성되는 금속 부품과 같은 물질 조각이 제 조된 제조 공정, 물질 제거 공정 등의 유형을 의미한다.물질들의 유형들 또는 부류들(즉, 분류)은 사용자가 정의할 수 있으며, 알려진 물질들의 분류에 제한되지 않는 다. 유형들 또는 부류들의 입도(granularity)는 매우 거칠게로부터 매우 세밀하게까지 다양할 수 있다. 예를 들어, 유형들 또는 부류들에는 플라스틱들, 세라믹들, 유리들, 금속들 및 기타 물질들 ― 이러한 유형들 또는 부류들의 입도는 상대적으로 거침 ―; 예를 들어 아연, 구리, 황동, 크롬 플레이트 및 알루미늄과 같은 서로 다 른 금속들 및 금속 합금들 ― 이러한 유형들 또는 부류들의 입도는 더 미세함 ―; 또는 특정 유형들 또는 색상 들의 플라스틱 사이 ― 이러한 유형들 또는 부류들의 입도는 상대적으로 미세함 ―를 포함할 수 있다. 따라서, 유형들 또는 부류들은 예를 들어, 서로 다른 유형들의 플라스틱들과 같이 상당히 서로 다른 조성들의 물질들 사 이(예를 들어, #1 내지 #7 유형들의 플라스틱들 중 임의의 플라스틱 사이)를 구별하거나, 예를 들어 특정 플라 스틱 유형에 속할 수 있는 서로 다른 플라스틱들의 하위 부류들과 같은 거의 동일한 조성의 물질들(예를 들어, MWIR 분광법에 의해 식별/구별할 수 있는 플라스틱들 및 그렇지 않은 플라스틱들) 사이를 구별하도록 구성될 수 있다. 본 명세서에 논의된 방법들 및 시스템들은 분류되기 전에 조성이 완전히 알려지지 않은 물질의 조각들을 정확하게 식별/분류하는 데 적용될 수 있음을 이해해야 한다. 본 개시의 특정 실시예들은 다수의 센서 기술들과 머신 러닝 시스템을 융합하여 플라스틱 소팅 기능들을 향상시 킨다. 센서 기반 소터(sorter) 기술들의 한계들은 각각의 센서가 좁은 범위의 신호들만 검출할 수 있기 때문에 단일 센서의 사용으로 인해 발생한다. 가장 일반적인 소터 센서 유형들은 와전류, 가시 카메라, x-선 투과, 근"}
{"patent_id": "10-2023-7030491", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "적외선 및 x-선 형광(\"XRF\")이며, 다음 표에 요약되어 있다."}
{"patent_id": "10-2023-7030491", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "그러나, MSW 내 플라스틱 조각들은 하나 이상의 유기 폴리머들, 하나 이상의 무기 원소들로 구성될 수 있으며, 많은 서로 다른 색상들, 형상들 및 크기들로 제공된다. 이러한 플라스틱들의 예들로는 감자칩 봉지들, 짜 먹는 주스 상자들, 일부 음료 용기들 및 전자기 민감성 전자 제품 포장이 있다. 본 개시의 특정 실시예들은 이러한 서로 다른 유형들의 플라스틱들을 유기 폴리머 조성 및/또는 무기 원소 조성을 설명할 수 있는 고유한 분류들로 의 소팅을 달성할 수 있는 센서 기반 기술을 사용하여 이러한 폐기물 흐름으로부터 새로운 분획들을 생성한다. 예를 들어, 폴리머들과 무기 원소들의 상대적 조성에 관심이 많은 전환 화학자는 이러한 분획들로 소팅된 재활 용 플라스틱들로부터 특정 제품을 만들 수 있는 하나 이상의 새로운 분획들을 선택할 수 있다. 결과적으로, 본 개시의 실시예들에 따라 구성된 소팅 시스템들은 기존의 최첨단 소팅 기술들로 가능한 것 이상의 분획들을 생산 할 수 있다. 본 명세서에 설명되는 바와 같이, 본 개시의 실시예들은 하나 이상의 서로 다른 유형들의 어두운 색상 및/또는 검정색 플라스틱들을 서로로부터 및/또는 다른 플라스틱들 또는 다른 물질들로부터 분류 및/또는 소팅하기 위해 비전 시스템과 하나 이상의 MWIR 카메라들을 활용하는 센서 시스템의 조합을 활용할 수 있다. 예를 들어, 특정 형상(즉, 미리결정된 분획으로서)의 어두운 색상 및/또는 검정색 플라스틱들은 이러한 조합을 사용 하여 분류 및/또는 소팅될 수 있다. 또한, 본 명세서에 설명되는 바와 같이, 본 개시의 실시예들은 하나 이상의 MWIR 카메라들을 활용하는 센서 시 스템을 활용할 수 있으며, MWIR 카메라(들)의 출력(즉, 스펙트럼 이미징 데이터)이 하나 이상의 서로 다른 유형들의 어두운 색상 및/또는 검정색 플라스틱들을 분류하기 위해 머신 러닝 시스템을 훈련시키는 데 사용되는 방식으로, 훈련된 머신 러닝 시스템은 MSW와 같은 물질들의 흐름으로부터 그러한 어두운 색상 및/또는 검정색 플라스틱들을 분류 및/또는 소팅하는 데 사용될 수 있다. 본 개시의 특정 실시예들은 새로운 제품들(예를 들어, 재활용 방법에 의해) 및/또는 연료들을 생성하기 위해, #3-#7 유형의 플라스틱들의 베일들로부터 미리결정된 분획을 분류 및/또는 소팅하도록 구성될 수 있다. 이러한 분획들의 예시적인 최종 용도들에는 가스들(예를 들어, C1 내지 C4), 연료들(예를 들어, 가솔린, 디젤) 및 진공 가스 오일들이 포함될 수 있다(그러나, 이에 제한되지 않음). 그러나, 유기 및 무기 원소 조성들에 기초한 #3 내지 #7 유형의 플라스틱들의 소팅은 성공적으로 수행된 적이 없다. 본 개시의 실시예들은 플라스틱 물질들의 조각들을 미리결정된 다양한 서로 다른 분획들 또는 특성들 또는 유형 들의 조합들에 따라 분류하도록 구성될 수 있으며, 이는 이하 및 본 개시의 다른 곳에서 개시된다.플라스틱들은 그 특성들에 따라 화학 구조, 극성 및 적용예들에 따라 세 가지 유형들로 분류할 수 있다. 화학 구조와 온도 거동에 따라 플라스틱들은 열가소성 플라스틱들, 열경화성 플라스틱들, 엘라스토머들로 나눌 수 있다. 극성과 관련하여 성질이 서로 다른 원자들이 존재하면 공유 결합들에서 전자들이 가장 전기적으로 음성인 원자 를 향해 이동하여 쌍극자가 생성된다. CI, O, N, F 등과 같은 극성 전기음성 전자들을 포함하는 폴리머들은 극 성 화합물들일 수 있어 물질의 특성들에 영향을 미친다. 극성이 증가하면, 기계적 저항, 경도, 강성, 내열성, 내수성 및 내습성, 내화학성은 물론 수증기와 같은 극성 화합물에 대한 투과성, 금속들에 대한 접착성 및 접착 력도 증가한다. 동시에 극성이 증가하면 열팽창, 전기 절연 용량, 정전하들의 축적 경향 및 극성 분자들(O2, N2)에 대한 투과성이 감소한다. 이러한 방식으로, 폴리올레핀들, 폴리에스테르들, 아세탈들, 할로겐화 폴리머들 등과 같은 서로 다른 제품군들 사이를 구별할 수 있다. 제3 분류는 적용예에 따라 열가소성 물질들에 적용된다. 이러한 제3 분류에는 네 가지 유형들의 플라스틱들이 있다: 표준 플라스틱들 또는 상품들: 가격과 여러 면들에서 우수한 특성들로 인해 대량으로 제조 및 사용되는 플라스 틱들. 일부 예들에는 폴리에틸렌(\"PE\"), 폴리프로필렌(\"PP\"), 폴리스티렌(\"PS\"), 폴리염화비닐(\"PVC\") 또는 공 중합체 아크릴로니트릴 부타디엔 스티렌(\"ABS\")이 있다. 엔지니어링 플라스틱들: 우수한 구조, 투명성, 자체 윤활 및 열 특성들이 필요한 경우에 사용됨. 일부 예들에 는 폴리아미드(\"PA\"), 폴리아세탈(\"POM\"), 폴리카보네이트(\"PC\"), 폴리에틸렌 테레프탈레이트(\"PET\"), 폴리페닐 렌 에테르(\"PPE\") 및 폴리부틸렌 테레프탈레이트(\"PBT\")가 있다. 특수 플라스틱들: 이들 플라스틱들은 투명성과 광 안정성이 높은 폴리메틸메타크릴레이트(PMMA) 또는 온도 및 화학 제품들에 대한 내성이 우수한 폴리테트라플루오로에틸렌(Teflon)과 같은 월등한 정도의 특수한 특성을 지 님. 고성능 플라스틱들: 대부분 내열성이 높은 열가소성 플라스틱. 즉, 이들 플라스틱들은 특히 최대 150 ℃의 고 온들에 대한 기계적 저항성이 우수하다. 폴리이미드(\"PI\"), 폴리설폰(\"PSU\"), 폴리에테르설폰(\"PES\"), 폴리아 릴설폰(\"PAS\"), 폴리페닐렌설파이드(\"PPS\") 및 액정 폴리머들(\"LCP\")이 고성능 플라스틱들이다.. 많은 플라스틱 물품들에는 제조된 폴리머의 유형을 식별하는 기호가 있다. 이러한 수지 식별 코드들, 종종 약 칭으로 RIC들은 국제적으로 사용된다. 총 7 개의 코드들이 있으며, 가장 일반적인 상품 플라스틱들 유형들에 대한 6 개와 그 외의 모든 것을 포괄하는 1 개의 코드가 있다. 이러한 유형들을 본 명세서에서는 폴리머 유형 들 #1 내지 #7 이라고도 한다. 폴리머 유형 #1은 폴리에틸렌 테레프탈레이트(\"PET\")를 가리키고, #2는 고밀도 폴리에틸렌(\"HDPE\")을 가리키고, #3은 폴리염화비닐(\"PVC\")을 가리키고, #4는 저밀도 폴리에틸렌(\"LDPE\")을 가 리키고, #5는 폴리프로필렌(\"PP\")을 가리키고, #6은 폴리스티렌(\"PS\")을 가리키고, #7은 폴리머 유형들 #1 내지 #6에 없는 다른 폴리머들(예를 들어, 아크릴, 폴리카보네이트(\"PC\"), 폴리액틱 섬유들, 폴리락타이드, 나일론, 유리섬유, ABS)을 가리킨다. EU는 ABS와 폴리아미드들도 포함하는 유사한 9 개 코드 목록을 유지한다. PET 플라스틱은 음료수 병들, 약병들, 로프, 의류, 카펫 섬유와 같은 많은 일반 가정용품들을 만드는 데 사용된 다. HDPE 플라스틱은 우유, 모터 오일, 샴푸들 및 컨디셔너들, 비누 병들, 세제, 표백제 용기들을 만드는 데 자주 사용된다. PVC는 모든 종류들의 파이프들과 타일들에 사용되며 배관 파이프들에서 가장 흔히 볼 수 있다. LDPE 제품들에는 집착 필름, 샌드위치 백들, 짜 먹는 병들, 비닐 식료품 봉투들이 포함된다. PP는 도시락들, 마가린 용기들, 요구르트 용기들, 시럽 병들, 처방약 병들 및 플라스틱 병 뚜껑들을 만드는 데 사용된다. 폴리 스티렌 물품들에는 일회용 커피 컵들, 플라스틱 식품 상자들, 플라스틱 수저 및 포장용 발포체가 포함된다. 폴 리카보네이트는 젖병들, 콤팩트 디스크들 및 의료용 보관 용기들에 사용된다. 따라서, 본 개시의 특정 실시예 들에 따라, 머신 러닝 시스템으로 구현된 비전 시스템은 제조된 제품의 유형에 기초하여 이들 서로 다른 유형들 의 플라스틱들을 식별하고 소팅하도록 훈련될 수 있다. 플라스틱 조각들은 포함될 수 있는 첨가제들의 유형들에 따라 분류될 수 있다. 첨가제들은 성능을 향상시키기 위해 플라스틱들에 혼합되는 화합물들로서 안정제들, 필러들 및 염료들을 포함한다. 투명한 플라스틱들은 아직 염색이 되지 않았기 때문에 가치가 가장 높지만, 검정색이나 강한 유색 플라스틱은 포함될 경우 제품이 변색될 수 있기 때문에 가치가 훨씬 낮다. 따라서, 플라스틱은 재활용에 적합한 물질을 제공하기 위해 폴리머 유형과 색상별로 소팅해야 할 수 있다.플라스틱들은 밀도에 기초하여 분류 및 소팅될 수도 있다. 특정 폴리머들은 밀도 범위가 유사하다(예를 들어, PP와 PE, 또는 PET, PS 및 PVC). 플라스틱 조각에 필러의 비율이 높으면 밀도에 영향을 미칠 수 있다. 플라스틱 폐기물은 크게 산업 스크랩(때때로 산업 후 수지라고도 함)과 소비 후 폐기물의 두 가지 범주들로 나 눌 수도 있다. 플라스틱 조각들은 재활용 방법에 따라 분류/소팅될 수도 있다. 기계적 재활용 과정에서 플라스틱들은 폴리머 유형에 따라 150 내지 320 ℃에서 재처리될 수 있으며, 이 과정에서 원치 않는 화학 반응들이 발생하여 폴리머 가 분해될 수 있다. 이는 플라스틱의 물리적 특성들 및 전반적인 품질을 저하시킬 수 있으며, 휘발성 저분자량 화합물들을 생성하여 바람직하지 않은 맛 또는 냄새를 부여할 수 있을 뿐만 아니라 열 변색을 유발할 수 있다. 따라서, 본 개시의 실시예들은 이러한 원치 않는 화학 반응들을 피할 수 있도록 플라스틱 조각들을 분류 및 소 팅하도록 구성될 수 있다. 플라스틱 내에 존재하는 첨가제들은 이러한 열화를 가속화할 수 있다. 예를 들어, 플라스틱의 생분해성을 개선하기 위한 산화 생분해성 첨가제들은 열분해 정도를 증가시킬 수 있다. 마찬가지로, 난연제들은 원치 않는 효과들을 가질 수 있다. 따라서, 본 개시의 실시예들은 플라스틱 조각들을 분류 및 소팅하여 이러한 첨가제들 중 특정 첨가제들이 포함된 플라스틱 조각들이 폐기되도록 구성될 수 있다. 제품의 품질은 플라스틱이 얼마나 잘 소팅되었는지에 따라 크게 달라질 수 있다. 많은 폴리머들은 용융 시 서 로 섞이지 않으며 재처리 과정에서 (기름과 물처럼) 상이 분리된다. 이러한 혼합물들로 만든 제품들은 서로 다 른 폴리머 유형들 사이에 많은 경계들을 포함하며, 이러한 경계들을 가로지르는 응집력이 약하여 기계적 특성들 이 좋지 않다. 따라서, 본 개시의 실시예들은 섞이지 않는 특정 플라스틱 조각들이 동일한 그룹으로 함께 소팅 되지 않도록 플라스틱 조각들을 분류 및 소팅하도록 구성될 수 있다. 본 개시의 특정 실시예들에 따라 본 명세서에 설명된 시스템들 및 방법들은 복수의 물질 조각들(예를 들어, 본 명세서에 개시된 다양한 플라스틱들의 임의의 조합)의 이질적인 혼합물을 수용하며, 이 이질적인 혼합물 내의 적어도 하나의 물질 조각은 하나 이상의 다른 물질 조각들과는 서로 다른 원소들의 성분(예를 들어, 어두운 색 상 및/또는 검정색 플라스틱 물질을 초래함)을 포함하고, 그리고/또는 이 이질적인 혼합물 내의 적어도 하나의 물질 조각은 다른 물질 조각들과 구별될 수 있으며(예를 들어, 시각적으로 분별 가능한 특성들 또는 특징들, 서 로 다른 화학적 시그니처들 등), 시스템들 및 방법들은 이 물질 조각을 그러한 다른 물질 조각들로부터 분리된 그룹으로 식별/분류/소팅하도록 구성된다. 본 개시의 실시예들은 본 명세서에 정의된 바와 같이 임의의 유형들 또는 부류들의 물질들 또는 분획들을 소팅하는 데 활용될 수 있다. 본 개시의 실시예들은 사용자 정의 그룹화들(예를 들어, 물질 유형 분류들 또는 분획들)의 함수로서 물질 조각 들을 별도의 리셉터클들 또는 통(bin)들에 물리적으로 퇴적(예를 들어, 전환 또는 배출)하여 물질 조각들을 그 러한 별도의 그룹들로 소팅하는 것으로 본 명세서에서 설명될 것이다. 일 예로서, 본 개시의 특정 실시예들 내 에서, 물질 조각들은 다른 물질 조각들의 물리적 특성들(예를 들어, 시각적으로 분별 가능한 특성들 또는 특징 들, 서로 다른 화학적 시그니처들 등)과 구별 가능한 물리적 특성들을 갖는 물질 조각들을 분리하기 위해 별도 의 통들로 소팅될 수 있다. 도 1은 본 개시의 다양한 실시예들에 따라 구성된 시스템의 일 예를 예시한다. 컨베이어 시스템은 시스템을 통해 개별 물질 조각들의 하나 이상의 흐름들을 이송하도록 구현될 수 있어, 개별 물질 조 각들 각각이 미리결정된 원하는 그룹들로 추적, 분류 및 소팅될 수 있다. 이러한 컨베이어 시스템은 물질 조각들이 전형적으로 미리결정된 일정한 속도로 이동하는 하나 이상의 컨베이어 벨트로 구현될 수 있 다. 그러나, 본 개시의 특정 실시예들은 물질 조각들이 시스템의 다양한 구성요소들(또는 임의의 다른 유 형의 수직 소터)을 지나 자유 낙하하는 시스템 또는 진동 컨베이어 시스템을 포함하는 다른 유형들의 컨베이어 시스템들로 구현될 수 있다. 이하, 해당되는 경우, 컨베이어 시스템은 컨베이어 벨트로도 지칭될 수 있다. 하나 이상의 실시예들에서, 운반, 자극, 검출, 분류 및 소팅 행위들의 일부 또는 전부가 자동으로, 즉 사람의 개입 없이 수행될 수 있다. 예를 들어, 시스템에서, 하나 이상의 자극들의 공급원들, 하나 이상의 배출 검출기들, 분류 모듈, 소팅 장치 및/또는 다른 시스템 구성요소들은 이러한 그리고 다른 작업들을 자동으 로 수행하도록 구성될 수 있다. 또한, 도 1은 컨베이어 시스템 상의 물질 조각들의 단일 흐름을 예시하고 있지만, 본 개시의 실시예 들은 이러한 물질 조각들의 복수의 흐름들이 서로 병렬로 시스템의 다양한 구성요소들을 통과하는 방식으 로 구현될 수 있다. 예를 들어, 미국 특허 제10,207,296호에 추가로 설명된 바와 같이, 물질 조각들은 단일 컨 베이어 벨트 또는 병렬 컨베이어 벨트들의 세트에서 이동하는 둘 이상의 병렬 단일 흐름들로 분배될 수 있다. 이처럼, 본 개시의 특정 실시예들은 이러한 복수의 병렬 이동 물질 조각들의 흐름들을 동시에 추적, 분류 및 소팅할 수 있다. 본 개시의 특정 실시예들에 따라, 싱귤레이터의 통합 또는 사용은 필요하지 않다. 대신, 컨베 이어 시스템(예를 들어, 컨베이어 시스템)은 단순히 컨베이어 시스템 상에 무작위로 퇴적된 물질 조 각들의 덩어리를 이송할 수 있다. 본 개시의 특정 실시예들에 따라, 물질 조각들을 컨베이어 시스템으로 공급하기 위해 일부 적합한 종 류의 공급기 메커니즘(예를 들어, 다른 컨베이어 시스템 또는 호퍼)이 활용될 수 있으며, 이에 따라 컨베 이어 시스템은 물질 조각들을 시스템 내의 다양한 구성요소들을 지나서 운반할 수 있다. 물질 조각들이 컨베이어 시스템에 의해 수용된 후, 선택적 텀블러/진동기/싱귤레이터가 물질 조각들 의 모음으로부터 개별 물질 조각들을 분리하기 위해 활용될 수 있다. 본 개시의 특정 실시예들 내에서, 컨베이 어 시스템은 컨베이어 시스템 모터에 의해 미리결정된 속도로 이동하도록 작동된다. 이 미리결정된 속도는 운영자가 임의의 잘 알려진 방식으로 프로그래밍 및/또는 조정할 수 있다. 컨베이어 시스템의 미 리결정된 속도의 모니터링은 대안적으로 포지션 검출기를 사용하여 수행될 수 있다. 본 개시의 특정 실시 예들 내에서, 컨베이어 시스템 모터 및/또는 포지션 검출기의 제어는 자동화 제어 시스템에 의 해 수행될 수 있다. 이러한 자동화 제어 시스템은 컴퓨터 시스템의 제어하에 작동될 수 있고, 그리 고/또는 자동화 제어를 수행하기 위한 기능들이 컴퓨터 시스템 내의 소프트웨어에 구현될 수 있다. 컨베이어 시스템은 벨트 컨베이어를 미리결정된 속도로 이동시키기에 적합한 종래의 구동 모터를 채 용하는 종래의 무한 벨트 컨베이어일 수 있다. 종래의 엔코더일 수 있는 포지션 검출기는 컨베이어 시스 템 및 자동화 제어 시스템에 작동식으로 결합되어 컨베이어 벨트의 움직임(예를 들어, 속도)에 대응 하는 정보를 제공할 수 있다. 따라서, 본 명세서에서 추가로 설명되는 바와 같이, 컨베이어 시스템 구동 모터 및/또는 자동화 제어 시스템(및 대안적으로 포지션 검출기를 포함)에 대한 제어들의 활용을 통 해, 컨베이어 시스템 상에서 이동하는 물질 조각들 각각이 식별되면, 위치 및 시간(시스템의 다 양한 구성요소들과 관련됨)에 의해 추적될 수 있으므로, 각각의 물질 조각이 그 부근 내를 통과할 때 시스 템의 다양한 구성요소들이 활성화/비활성화될 수 있다. 그 결과, 자동화 제어 시스템은 물질 조각들 이 컨베이어 시스템을 따라 이동하는 동안 물질 조각들 각각의 위치를 추적할 수 있다. 도 1을 다시 참조하면, 본 개시의 특정 실시예들은 물질 조각들이 컨베이어 시스템 상에서 이동할 때 물질 조각들 각각을 추적하는 수단으로서 비전 또는 광학 인식 시스템 및/또는 물질 조각 추적 디바이스 를 활용할 수 있다. 비전 시스템은 하나 이상의 정지 또는 라이브 액션 카메라들을 활용하여 이동 컨베이어 시스템 상에서 물질 조각들 각각의 포지션(즉, 위치 및 타이밍)을 기록할 수 있다. 비전 시스템은 본 명세서에서 추가로 설명되는 바와 같이, 물질 조각들의 전부 또는 일부의 특정 유 형들의 식별(예를 들어, 분류)을 수행하도록 추가적으로 또는 대안적으로 구성될 수 있다. 예를 들어, 그러한 비전 시스템은 물질 조각들 각각에 대한 정보를 포착하거나 획득하는 데 활용될 수 있다. 예를 들어, 비전 시스템은 본 명세서에 기술된 바와 같이 하나 이상의 특성들(예를 들어, 물리적 및/또는 화학 적 및/또는 방사성 등)의 세트의 함수로서 물질 조각들을 분류 및/또는 선택적으로 소팅하기 위해 시스템 내에서 활용될 수 있는 물질 조각들로부터의 임의의 유형의 정보를 포착 또는 수집하도록 (예를 들어, 머 신 러닝 시스템과 함께) 구성될 수 있다. 본 개시의 특정 실시예들에 따라, 비전 시스템은, 예를 들어 전 형적인 디지털 카메라들 및 비디오 장비에서 활용되는 광학 센서를 사용하여, 물질 조각들 각각의 시각적 이미지들(1 차원, 2 차원, 3 차원 또는 홀로그램 이미징을 포함)을 포착하도록 구성될 수 있다. 광학 센서에 의해 포착된 이러한 시각적 이미지들은 메모리 디바이스에 이미지 데이터로서 저장된다(예를 들어, 이미지 데이 터 패킷들로 포맷됨). 본 개시의 특정 실시예들에 따라, 그러한 이미지 데이터는 광의 광학 파장들(즉, 전형적 인 사람의 눈으로 관찰할 수 있는 광의 파장들) 내에서 포착된 이미지들을 나타낼 수 있다. 그러나, 본 개시의 대안적인 실시예들은 사람의 눈의 시각적 파장들을 벗어나는 광의 파장들로 구성된 물질의 이미지를 포착하도록 구성된 비전 시스템을 활용할 수 있다(예를 들어, MWIR 분광법). 본 개시의 특정 실시예들에 따라, 시스템은 하나 이상의 센서 시스템들로 구현될 수 있으며, 이는 물 질 조각들을 분류/식별하기 위해 비전 시스템과 단독으로 또는 조합하여 활용될 수 있다. 센서 시스 템은 조사되거나 반사된 전자기 방사선을 활용하는(예를 들어, 적외선(\"IR\"), 푸리에 변환 IR(\"FTIR\"), 전 방 적외선(\"FLIR\"), 초근적외선(\"VNIR\"), 근적외선(\"NIR\"), 단파장 적외선(\"SWIR\"), 장파장 적외선(\"LWIR\"), 중파장 적외선(\"MWIR\" 또는 \"MIR\"), X-선 투과(\"XRT\"), 감마선, 자외선(\"UV\"), X-선 형광(\"XRF\"), 레이저 유도 분해 분광법(\"LIBS\"), 라만 분광법, 스토크 방지 라만 분광법, 감마 분광법, 초분광 분광법(예를 들어, 가시 파 장들을 넘어서는 임의의 범위), 음향 분광법, NMR 분광법, 마이크로파 분광법, 테라헤르츠 분광법 및 이들 중 어느 하나에 해당하는 1 차원, 2 차원 또는 3 차원 이미징을 활용하는) 센서 시스템을 포함하여, 플라스틱 조각들의 화학적 시그니처들을 결정하고, 그리고/또는 소팅을 위해 플라스틱 조각들을 분류하기 위한 임의의 유형의 센서 기술 또는 화학적 또는 방사성을 포함하는(그러나, 이에 제한되지 않음) 임의의 다른 유형의 센서 기술에 의해 구성될 수 있다. (예를 들어, 본 명세서에서 센서 시스템으로서 사용하기 위한) 예시적인 XRF 시스 템의 구현은 미국 특허번호 제10,207,296호에 추가로 설명되어 있다. 본 개시의 실시예들 내에서 XRF는 플라스 틱 조각 내의 무기 물질들을 식별하기 위해 사용될 수 있다(예를 들어, 화학적 시그니처 내에 포함시키기 위 해). 이하의 센서 시스템들은 또한 플라스틱 조각들의 화학적 시그니처들을 결정하고, 그리고/또는 소팅을 위해 플라 스틱 조각들을 분류하기 위해 본 개시의 특정 실시예들 내에서 사용될 수 있다. 앞서 개시된 다양한 형태들의 적외선 분광법은 임의의 플라스틱 물질의 기본 폴리머만 아니라 물질에 존재하는 다른 성분들(미네랄 필러들, 공중합체들, 폴리머 혼합물들 등)에 대한 정보를 제공하는 각 플라스틱 조각의 특 정 화학적 시그니처를 얻기 위해 활용될 수 있다. 시차 주사 열량 분석(\"DSC\")은 각각의 물질에 대해 분석된 물질을 가열하는 동안 생성되는 열 전이들을 얻는 열 분석 기법이다. 열 중량 분석(\"TGA\")은 폴리머 비율들, 기타 유기 성분들, 미네랄 필러들, 카본 블랙 등과 관련한 플라스틱 물 질의 성분에 대한 정량적 정보를 제공하는 다른 열 분석 기법이다. 모세관 및 회전 유변학은 크리프 및 변형 저항을 측정하여 고분자 물질들의 유변학적 특성들을 결정할 수 있다. 광학 및 주사 전자 현미경(\"SEM\")은 다층 물질들(예를 들어, 다층 폴리머 필름들)의 층들의 수 및 두께, 폴리머 매트릭스 내 안료 또는 충전제 입자들의 분산 크기, 코팅 결함들, 성분들 간의 상간 형태 등과 관련하여 분석된 물질들의 구조에 대한 정보를 제공할 수 있다. 크로마토그래피(예를 들어, LC-PDA, LC-MS, LC-LS, GC-MS, GC-FID, HS-GC)는 잔류 모노머들, 잉크들 또는 접착 제의 잔류 용매들, 분해 물질들 등뿐만 아니라 UV 안정제들, 항산화제들, 가소제들, 미끄럼 방지제들 등과 같은 플라스틱 물질들의 소량 성분들을 정량화할 수 있다. 본 개시의 실시예들에 따르면, 비전 시스템은 컨베이어 시스템에 근접하여(예를 들어, 위에) 포지셔닝되는 물질 조각들의 MWIR 이미지들(MWIR 영역의 초분광 데이터)을 포착하도록 구성된 하나 이상의 카메라들로 구성될 수 있어서, 물질 조각들의 MWIR 이미지들이 비전 시스템을 통과할 때 포착되도록 할 수 있다. 이러한 카 메라(들)는 MWIR 스펙트럼 범위(2.7 내지 5.3 ㎛)에서 작동하며, 예를 들어 스페심 에프엑스50(Specim FX50) 카 메라(스펙트럴 이미징(Spectral Imaging Ltd.)사의 스페심으로부터 상업적으로 입수가능함)는 MWIR 영역에서 PS, PE, PP, ABS 및 PVC 검정색 플라스틱들, 고무 및 특정 첨가제들, 기타 어두운 색상 플라스틱들을 검출할 수 있다. 도 1은 비전 시스템과 하나 이상의 센서 시스템의 조합으로 예시되어 있지만, 본 개시의 실시예들은 본 명세서에 개시된 센서 기술들 중 임의의 기술 또는 현재 이용 가능하거나 미래에 개발될 임의의 다른 센서 기술들을 활용하는 센서 시스템들의 임의의 조합으로 구현될 수 있음에 유의해야 한다. 도 1은 하나 이상의 센 서 시스템들을 포함하는 것으로 예시되어 있지만, 그러한 센서 시스템(들)의 구현은 본 개시의 특정 실시 예들 내에서 선택적이다. 본 개시의 특정 실시예들 내에서, 비전 시스템과 하나 이상의 센서 시스템들 모두의 조합이 물질 조각들을 분류하는 데 사용될 수 있다. 본 개시의 특정 실시예들 내에서, 본 명세서에 개시된 서로 다른 센서 기술들 중 하나 이상의 임의의 조합이 비전 시스템을 이용하지 않고 물질 조각들을 분류하는 데 사용될 수 있다. 또한, 본 개시의 실시예들은, 이러한 센서/비전 시스템들의 출력 들이 머신 러닝 시스템(본 명세서에 추가 개시된 바와 같음) 내에서 처리되어 이질적인 물질들의 혼합물로부터 물질들을 분류/식별한 다음 서로 소팅할 수 있는 하나 이상의 센서 시스템들 및/또는 비전 시스템들의 임의의 조합을 포함할 수 있다. 본 개시의 대안적인 실시예들에 따라, 비전 시스템 및/또는 센서 시스템(들)은 시스템에 의해 소팅될 종류가 아닌 물질 조각들(예를 들어, 특정 오염 물질, 첨가제, 또는 바람직하지 않은 물리적 특징(예를 들 어, 컨테이너와 서로 다른 유형의 플라스틱으로 형성된 부착식 컨테이너 캡)을 포함하는 플라스틱 조각들)을 식 별하고, 그러한 물질 조각들을 거부하도록 신호를 송신하도록 구성될 수 있다. 이러한 구성에서, 식별된 물질 조각들은 소팅된 물질 조각들을 개별 통들로 물리적으로 전환하기 위해 후술되는 것과 같은 메커니즘들 중 하나를 활용하여 전환/배출될 수 있다.본 개시의 특정 실시예들 내에서, 물질 조각 추적 디바이스 및 수반되는 제어 시스템은 이동 컨베이 어 시스템 상에서 물질 조각들 각각의 포지션(즉, 위치 및 타이밍)과 함께 물질 조각 추적 디바이스 의 근접 내를 통과하는 물질 조각들 각각의 크기들 및/또는 형상들을 측정하도록 활용 및 구성될 수 있다. 이러한 물질 조각 추적 디바이스 및 제어 시스템의 예시적인 작동은 미국 특허 제10,207,296 호에 추가로 설명되어 있다. 대안적으로, 이전에 개시된 바와 같이, 비전 시스템은 컨베이어 시스템(10 3)에 의해 이송될 때 물질 조각들 각각의 포지션(즉, 위치 및 타이밍)을 추적하는 데 활용될 수 있다. 이 처럼, 본 개시의 특정 실시예들은 물질 조각들을 추적하기 위한 물질 조각 추적 디바이스(예를 들어, 물질 조각 추적 디바이스) 없이 구현될 수 있다. 하나 이상의 센서 시스템들을 구현하는 본 개시의 특정 실시예들 내에서, 센서 시스템(들)은 비전 시 스템이 센서 시스템(들)의 근접 내에서 통과할 때 물질 조각들 각각의 화학 성분, 상대 화학 성 분들 및/또는 제조 유형들을 식별하게끔 지원하도록 구성될 수 있다. 센서 시스템(들)은 에너지 배출 공 급원을 포함할 수 있는데, 이는 예를 들어, 물질 조각들 각각으로부터의 반응을 자극하기 위해 전원 장치에 의해 구동될 수 있다. 센서 시스템으로서 XRF 시스템을 구현하는 본 개시의 특정 실시예들에 따르면, 공급원은 미국 특허 제10,207,296호에 추가로 설명된 바와 같이, 인라인 x-선 형광(\"IL-XRF\") 튜브를 포함할 수 있다. 이러한 IL- XRF 튜브는 운반된 물질 조각들의 하나 이상의 흐름들(예를 들어, 단일화된)에 대해 각각 전용인 별도의 x-선 공급원을 포함할 수 있다. 이러한 경우, 하나 이상의 검출기들은 단일화된 흐름들 각각 내의 물질 조각들 로부터 형광 x-선을 검출하기 위한 XRF 검출기들로서 구현될 수 있다. 이러한 XRF 검출기들의 예들은 미 국 특허 제10,207,296호에 추가로 설명되어 있다. 본 개시의 특정 실시예들 내에서, 물질 조각들 각각이 배출 공급원에 근접하여 통과할 때, 센서 시스 템은 물질 조각들을 향해 적절한 감지 신호를 배출할 수 있다. 하나 이상의 검출기들은 활용된 센서 기술의 유형에 적합한 형태로 물질 조각으로부터 하나 이상의 특성들을 감지/검출하도록 포지셔닝 및 구성될 수 있다. 하나 이상의 검출기들 및 연관된 검출기 전자 장치들은 이러한 수신된 감지된 특성 들을 포착하여 신호 처리를 수행하고 감지된 특성들(예를 들어, 스펙트럼 데이터)을 나타내는 디지털화된 정보 를 생성하며, 그 후 이러한 정보는 본 개시의 특정 실시예들에 따라 분석되고, 이는 비전 시스템이 물질 조각들 각각의 분류를 지원하도록 사용될 수 있다. 컴퓨터 시스템 내에서 수행될 수 있는 이러한 분 류는 결정된 분류들에 따라 물질 조각들을 하나 이상의 N(N ≥ 1) 개의 소팅 통들(136...139) 내로 소팅 (예를 들어, 전환/배출)하기 위한 소팅 장치의 N(N > 1) 개의 소팅 디바이스(126...129) 중 하나를 활성화하기 위해 자동화 제어 시스템에 의해 이용될 수 있다. 도 1에는 4 개의 소팅 디바이스들(126...129) 및 소팅 디바이스들과 연관된 4 개의 소팅 통들(136...139)이 단지 비제한적인 예로서 예시되어 있다. 기존의 플라스틱들의 소터들은 컨베이어의 단부에 있는 에어 노즐들이 식별된 플라스틱들의 부류를 두 개의 통 들 중 하나로 배출하는 이진 방식으로 물질들을 소팅하도록 설계되었다. 예를 들어, 4 가지 부류들의 플라스틱 들을 분리해야 하는 경우, 전체 흐름을 이러한 이진 소터를 통해 4 번의 서로 다른 횟수로 통과시켜야 하는데, 이는 흐름에서 단일 객체를 제거하는 것보다 4 배 더 많은 시간이 걸린다. 본 개시의 특정 실시예들에 따르면, 시스템은 플라스틱들의 다수의 분류들을 한 번에 소팅할 수 있다. 소팅 장치는, 컨베이어 벨트 시스템으로부터 복수의 소팅 통들로 물질 조각들을 전환하는 것을 포함하여 (그러나, 이에 제한되지 않음) 선택된 물질 조각들을 원하는 위치로 방향전환하기 위한 임의의 잘 알려진 메커니즘들을 포함할 수 있다. 예를 들어, 소팅 장치는 에어 제트들을 이용할 수 있으며, 에어 제트들 각각은 하나 이상의 분류들에 할당될 수 있다. 에어 제트들(예를 들어, 127) 중 하나가 자동화 제어 시스템으로 부터 신호를 수신하면, 해당 에어 제트는 물질 조각들을 컨베이어 시스템으로부터 해당 에어 제트에 대응하는 소팅 통(예를 들어, 137)으로 전환/분출하게 하는 공기 흐름을 배출한다. 물질 조각들을 컨베이어 벨트로부터 로봇 방식으로 제거하거나, 물질 조각들을 컨베이어 벨트로부터 밀어내거나 (예를 들어, 페인트 브러시 유형 플런저들을 사용하여), 물질 조각이 떨어질 수 있는 컨베이어 시스템에 개구부(예를 들어, 트랩 도어)를 발생시키거나, 에어 제트들을 사용하여 물질 조각들이 컨베이어 벨트의 가장자 리로부터 떨어질 때 별도의 통들로 전환시키는 것과 같은 다른 메커니즘들을 사용하여 물질 조각들을 전환/배출 할 수 있다. 본 명세서에서 사용되는 용어인 푸셔 디바이스는 컨베이어 시스템/디바이스 상에서 또는 컨베이어 시스템/디바이스로부터 객체를 동적으로 변위시키기 위해 활성화될 수 있는 임의의 형태의 디바이스로서, 임의 의 적절한 유형의 기계적 푸싱 메커니즘(예를 들어, ACME 스크류 드라이브), 공압 푸싱 메커니즘 또는 에어 제트 푸싱 메커니즘과 같은 공압, 기계 또는 기타 수단을 사용하여 이를 수행하는 디바이스를 지칭할 수 있다. 일부 실시예들은 컨베이어 시스템의 경로를 따라 서로 다른 위치들에 위치하고, 그리고/또는 서로 다른 전환 경 로 배향들을 갖는 다수의 푸셔 디바이스들을 포함할 수 있다. 다양한 서로 다른 구현예들에서, 본 명세서에 기 술된 이러한 소팅 시스템들은 머신 러닝 시스템에 의해 수행되는 물질 조각들의 분류들에 따라 활성화할 푸셔 디바이스(있는 경우)를 결정할 수 있다. 또한, 활성화할 푸셔 디바이스의 결정은 대상 물품과 동시에 푸셔 디 바이스의 전환 경로 내에 있을 수 있는 다른 객체들의 검출된 존재 및/또는 특성들에 기초할 수 있다. 또한, 컨베이어 시스템을 따른 싱귤레이션이 완벽하지 않은 설비들의 경우에도, 개시된 소팅 시스템들은 다수의 객체 들이 잘 싱귤레이팅되지 않은 경우를 인식할 수 있고, 어떤 푸셔 디바이스가 잠재적으로 근접한 객체들을 분리 하기 위한 최상의 전환 경로를 제공하는지에 기초하여 활성화되어야 하는 복수의 푸셔 디바이스들로부터 동적으 로 선택할 수 있다. 일부 실시예들에서, 대상 객체들로서 식별되는 객체들은 컨베이어 시스템에서 우회되어야 하는 물질을 나타낼 수 있다. 다른 실시예들에서, 대상 객체들로 식별된 객체들은 비대상 물질들이 대신 우회 되도록 컨베이어 시스템에 남아 있어야 하는 물질을 나타낸다. 물질 조각들이 전환/배출되는 N 개의 소팅 통들(136...139) 이외에, 시스템은 컨베이어 시스템 으로부터 전술한 소팅 통들(136...139) 중 임의의 통으로 전환/배출되지 않은 물질 조각들을 수용하는 리 셉터클 또는 통을 더 포함할 수 있다. 예를 들어, 물질 조각의 분류가 결정되지 않은 경우(또는 단 순히 소팅 디바이스들이 조각을 적절하게 전환/배출하지 못했기 때문에), 물질 조각은 컨베이어 시스템 으로부터 N 개의 소팅 통들(136...139) 중 하나로 전환/배출되지 않을 수 있다. 따라서, 통은 분류 되지 않은 물질 조각들이 버려지는 기본 리셉터클로서 작용할 수 있다. 대안적으로, 통은 N 개의 소팅 통 들(136...139) 중 임의의 통에 의도적으로 할당되지 않은 물질 조각들을 수용하는 데 사용될 수 있다. 그런 다 음, 이러한 물질 조각들은 다른 특성들에 따라, 그리고/또는 다른 소팅 시스템에 의해 추가로 소팅될 수 있다. 원하는 물질 조각들의 다양한 분류들에 따라 다수의 분류들을 하나의 소팅 디바이스 및 연관된 소팅 통에 매핑 할 수 있다. 즉, 분류들과 소팅 통들 사이에 일대일 상관관계가 있을 필요는 없다. 예를 들어, 사용자가 특정 분류들의 물질들을 동일한 소팅 통으로 소팅하기를 원할 수 있다(예를 들어, 분획 내에 속하는 서로 다른 플라 스틱 유형들). 이러한 소팅을 달성하기 위해, 물질 조각이 미리결정된 분류들의 그룹(예를 들어, 분획)에 속하는 것으로 분류되면, 동일한 소팅 디바이스가 활성화되어 이들을 동일한 소팅 통으로 소팅할 수 있다. 이 러한 조합 소팅은 소팅된 물질 조각들의 임의의 원하는 조합을 생성하기 위해 적용될 수 있다. 분류들의 매핑 은 사용자에 의해 프로그래밍되어(예를 들어, 컴퓨터 시스템에 의해 작동되는 소팅 알고리즘(예를 들어, 도 7 참조)을 사용하여), 그러한 원하는 조합들을 생성할 수 있다. 또한, 물질 조각들의 분류들은 사용자가 정 의할 수 있으며, 물질 조각들의 임의의 특정 공지된 분류들(예를 들어, 본 명세서에 개시된 분획들)로 제한되지 않는다. 컨베이어 시스템은 원형 컨베이어(도시되지 않음)를 포함할 수 있으므로, 분류되지 않은 물질 조각들은 시 스템의 시작 부분으로 되돌아가서 시스템을 다시 통과한다. 또한, 시스템은 컨베이어 시스템 상에서 이동하는 각각의 물질 조각을 구체적으로 추적할 수 있기 때문에, 일부 종류의 소팅 디바이 스(예를 들어, 소팅 디바이스)가 구현되어 시스템을 통해 미리결정된 횟수의 사이클들 후에 분류에 실패한 물질 조각을 유도/배출할 수 있다(또는 물질 조각들이 통에 수집된다). 본 개시의 특정 실시예들 내에서, 컨베이어 시스템은 예를 들어, 2 개의 벨트들과 같이 직렬로 구성된 다 수의 벨트들로 분할될 수 있는데, 여기서 제1 벨트는 비전 시스템을 지나 물질 조각들을 이송하고, 제2 벨 트는 제2 소팅을 위해 구현된 센서 시스템을 지나 특정 소팅된 물질 조각들을 이송한다. 또한, 이러한 제 2 컨베이어 벨트는 제1 컨베이어 벨트보다 낮은 높이에 위치하여, 물질 조각들이 제1 벨트로부터 제2 벨트로 떨 어지도록 할 수 있다. 센서 시스템을 구현하는 본 개시의 특정 실시예들 내에서, 배출 공급원은 검출 영역 위(즉, 컨베이어 시스템 위)에 위치할 수 있지만; 본 개시의 특정 실시예들은 여전히 수용 가능한 감지된/검출된 물리적 특 성들을 생성하는 다른 포지션들에 배출 공급원 및/또는 검출기들을 배치할 수 있다. 본 명세서에 설명된 시스템들 및 방법들은 다양한 크기들 및 형상들 중 임의의 크기 및 형상을 갖는 개별 물질 조각들을 분류 및/또는 소팅하는 데 적용될 수 있다. 본 명세서에 설명된 시스템들 및 방법들은 주로 개별 물 질 조각들을 소팅하는 것과 관련하여 설명되었지만, 본 명세서에 설명된 시스템들 및 방법들은 이에 제한되지 않는다. 이러한 시스템들 및 방법들은 복수의 물질들로부터의 배출들을 동시에 자극 및/또는 검출하는 데 사용 될 수 있다. 예를 들어, 하나 이상의 컨베이어 벨트들을 따라 직렬로 이송되는 물질들의 싱귤레이팅된 흐름과달리, 다수의 싱귤레이팅된 흐름들이 병렬로 이송될 수 있다. 각각의 흐름은 동일한 벨트 위에 있거나 병렬로 배열된 서로 다른 벨트 위에 있을 수 있다. 또한, 조각들은 하나 이상의 컨베이어 벨트들 상에 (예를 들어, 컨 베이어 벨트를 따라 전반적으로) 무작위로 분배될 수 있다. 따라서, 본 명세서에 설명된 시스템들 및 방법들은 복수의 물질 조각들을 동시에 자극하고, 그리고/또는 복수의 물질 조각들로부터의 배출들을 검출하는 데 사용될 수 있다. 다시 말해, 복수의 물질 조각들은 각각의 물질 조각이 개별적으로 고려되는 것과는 반대로 단일 조각 으로 취급될 수 있다. 따라서, 복수의 물질 조각들은 함께 분류 및 소팅(예를 들어, 컨베이어 시스템으로부터 전환/배출)될 수 있다. 본 명세서에 설명된 시스템들 및 방법들은 주로 물질 조각들의 소팅과 관련하여 설명되었지만, 이러한 시스템들 및 방법들은 해당 용도로만 제한되지 않는다. 다른 적용예들, 예를 들어 물질 조각 내의 요소들(예를 들어, 오 염 물질들)을 식별하거나 물질 조각의 성분을 결정하는 것을 위해 사용될 수 있다. 앞서 언급한 바와 같이, 본 개시의 특정 실시예들은 물질 조각들을 식별, 추적 및/또는 분류하기 위해 하나 이 상의 비전 시스템들(예를 들어, 비전 시스템)을 구현할 수 있다. 본 개시의 실시예들에 따르면, 그러한 비전 시스템(들)은 물질 조각들을 식별 및/또는 분류 및/또는 소팅하기 위해 단독으로 작동하거나, 물질 조각들 을 식별 및/또는 분류 및/또는 소팅하기 위해 하나 이상의 센서 시스템들(예를 들어, 센서 시스템(들))과 조합하여 작동할 수 있다. 소팅 시스템(예를 들어, 시스템)이 그러한 비전 시스템(들)과 단독으로 작동하도록 구성된 경우, 센서 시스템(들)은 시스템에서 생략될 수 있다(또는, 단순히 비활성화될 수 있다). 물질 조각들에 대해 포착된 감지된 특성들/정보의 유형(들)에 관계없이, 정보(예를 들어, 이미지 데이터 패킷들)는 물질 조각들 각각을 식별 및/또는 분류하기 위해 머신 러닝 시스템에 의해 처리되도록 컴퓨터 시스템 (예를 들어, 컴퓨터 시스템)으로 송신될 수 있다. 이러한 머신 러닝 시스템은 신경망(인공 신경망, 심층 신경망, 합성곱 신경망, 순환 신경망, 자동 인코더, 강화 학습 등), 퍼지 논리, 인공 지능(\"AI\"), 딥 러닝 알고 리즘들, 심층 구조 학습 계층 학습 알고리즘들, 서포트 벡터 머신(\"SVM\")(예를 들어, 선형 SVM, 비선형 SVM, SVM 회귀 등), 의사 결정 트리 학습(예를 들어, 분류 및 회귀 트리(\"CART\")), 앙상블 방법들(예를 들어, 앙상블 학습, 랜덤 포레스트들, 배깅 및 붙여넣기, 패치들 및 하위 공간들, 부스팅, 스태킹 등), 차원 축소(예를 들어, 투영, 매니폴드 학습, 주성분 분석 등) 및/또는 예를 들어, deeplearning.net 웹사이트(본 웹사이트 내에서 참 조되는 모든 소프트웨어, 출판물들 및 사용 가능한 소프트웨어에 대한 하이퍼링크들 포함)에 설명되어 있고 공 개적으로 제공되는 것과 같은 딥 머신 러닝 알고리즘들을 구현하는 시스템을 포함하여, 임의의 잘 알려진 머신 러닝 시스템을 구현할 수 있으며, 이는 본 명세서에서 참고로 포함된다. 본 개시의 실시예들 내에서 활용될 수 있는 공개적으로 이용 가능한 머신 러닝 소프트웨어 및 라이브러리들의 비제한적인 예로는 파이썬, OpenCV, 인 셉션, 테아노, 토치, 파이토치, 파일런2, 넘피, 블록들, 텐서플로우, MX넷, 카페, 라자냐, 케라스, 체이너, 매 트랩 딥러닝, CNTK, MatConvNet(컴퓨터 비전 애플리케이션들을 위한 컨볼루션 신경망들을 구현하는 MATLAB 도구 상자), DeepLearnToolbox(딥 러닝을 위한 Matlab 도구 상자(라스무스 버그 팜(Rasmus Berg Palm 제공))), BigDL, Cuda-Convnet(컨볼루션(또는 더 일반적으로 피드 포워드) 신경망들의 빠른 C++/CUDA 구현), Deep Belief Networks, RNNLM, RNNLIB-RNNLIB, matrbm, deeplearning4j, Eblearn. lsh, deepmat, MShadow, Matplotlib, SciPy, CXXNET, Nengo-Nengo, Eblearn, cudamat, Gnumpy, 3-way factored RBM 및 mcRBM, mPoT(자 연 이미지들의 모델들을 훈련하기 위해 CUDAMat 및 Gnumpy를 사용하는 Python 코드), ConvNet, Elektronn, OpenNN, NeuralDesigner, Theano Generalized Hebbian Learning, Apache Singa, Lightnet 및 SimpleDNN이 포 함된다. 본 개시의 특정 실시예들에 따르면, 머신 러닝은 두 스테이지들로 수행될 수 있다. 예를 들어, 먼저, 시스템 이 물질 조각의 실제 분류/소팅을 수행하기 위해 활용되지 않는 오프라인에서 훈련이 수행될 수 있다. 시 스템은, 물질 조각들의 균질 세트들(본 명세서에서는 제어 샘플들이라고도 함)(즉, 동일한 유형들 또는 부 류들의 물질들(예를 들어, 어두운 색상 및/또는 검정색 플라스틱들)을 갖거나 동일한 미리결정된 분획 내에 속 함)이 시스템을 통과하고(예를 들어, 컨베이어 시스템에 의해); 그러한 모든 물질 조각들이 소팅되지 않지만 공통 통(예를 들어, 통)에 수집될 수 있는 머신 러닝 시스템을 훈련시키는 데 이용될 수 있다. 대 안적으로, 훈련은 물질 조각들의 제어 세트들의 감지된 정보(특성들)를 수집하기 위한 일부 다른 메커니즘을 사 용하는 것을 포함하여, 시스템으로부터 멀리 떨어진 다른 위치에서 수행될 수 있다. 이 훈련 스테이지 동 안, 머신 러닝 시스템 내의 알고리즘들은 포착된 정보로부터 특징들을 추출한다(예를 들어, 당업계에 잘 알려진 이미지 처리 기법들 사용). 훈련 알고리즘들의 비제한적인 예들로는 선형 회귀, 경사 하강, 피드 포워드, 다항 식 회귀, 학습 곡선들, 정규화된 학습 모델들, 로지스틱 회귀가 포함된다(그러나, 이에 제한되지 않음). 이 훈련 스테이지에서 머신 러닝 시스템 내의 알고리즘들은 물질들과 그 특징들/특성들(예를 들어, 비전 시스템 및/ 또는 센서 시스템(들)에 의해 포착된 것과 같음(예를 들어, MWIR 분광법을 활용하여 특징들/특성들을 포착함)) 사이의 관계들을 학습하여, 시스템에 의해 수용된 물질 조각들의 이질적인 혼합물을 나중에 분류하기 위한 지식 기반을 생성하고, 그 후 원하는 분류들에 의해 소팅될 수 있다. 이러한 지식 기반은 하나 이상의 라이브 러리들을 포함할 수 있으며, 각각의 라이브러리는 머신 러닝 시스템이 물질 조각들을 분류하는 데 활용하기 위 한 파라미터들(예를 들어, 신경망 파라미터들)을 포함한다. 예를 들어, 하나의 특정 라이브러리는 특정 유형 또는 부류의 물질(예를 들어, 어두운 색상 및/또는 검정색 플라스틱들) 또는 미리결정된 분획에 해당하는 하나 이상의 물질들을 인식(분류)하기 위해 훈련 스테이지에 의해 구성된 파라미터들을 포함할 수 있다. 본 개시의 특정 실시예들에 따르면, 그러한 라이브러리들은 머신 러닝 시스템에 입력될 수 있고, 시스템의 사용자는 시스템의 작동을 조정하기 위해 파라미터들 중 특정 파라미터들을 조정할 수 있다(예를 들어, 머신 러닝 시스템이 이질적인 물질들의 혼합물로부터 특정 물질 조각(예를 들어, 어두운 색상 및/또는 검정색 플라스틱 들)을 얼마나 잘 인식하는지에 대한 임계 효과의 조정). 도 2에 묘사된 바와 같이, 훈련 스테이지 동안, 제어 샘플들인 하나 이상의 특정 유형들, 분류들 또는 분획들의 물질(들) 중 복수의 물질 조각들이 비전 시스템 및/또는 하나 이상의 센서 시스템(들)(예를 들어, 컨베이 어 시스템을 통해)을 지나 전달되어 머신 러닝 시스템 내의 알고리즘들이 그러한 유형 또는 부류의 물질을 나타내는 특징들을 검출, 추출 및 학습하도록 할 수 있다. 예를 들어, 물질 조각들 각각은 플라스틱 조각 의 적어도 일부분이 어두운 색상 플라스틱 물질 및/또는 검정색 플라스틱 물질로 구성되는 하나 이상의 플라스 틱 조각들일 수 있으며, 이러한 훈련 스테이지를 통과하여 머신 러닝 시스템 내의 알고리즘들이 그에 따라 그러 한 플라스틱 조각들을 검출, 인식 및 분류하는 방법을 \"학습\"하도록(훈련받도록) 한다. 하나 이상의 MWIR 카메 라들로 구현되는 비전 시스템(예를 들어, 비전 시스템)을 훈련하는 경우, 머신 러닝 시스템은 어두운 색상 및/또는 검정색인 물질 조각들 사이를 그렇지 않은 것들로부터 구별하도록 훈련된다. 이렇게 하면 적어도 어두 운 색상 플라스틱 물질 및/또는 검정색 플라스틱 물질로 구성된 플라스틱 물질들에 대한 파라미터들의 라이브러 리가 생성된다. 포착된 감지 정보가 입력 데이터로서 주어지면 머신 러닝 시스템 내의 알고리즘들은 N 개의 분 류기들을 사용할 수 있으며, 분류기들 각각은 N 개의 서로 다른 어두운 색상 안료들 및/또는 검정색 안료들 중 하나를 테스트한다. 머신 러닝 시스템은 MSW 또는 본 명세서에 공개된 임의의 다른 물질에서 발견되는 물질들 의 모든 유형들, 부류들 또는 분획들을 포함하여 물질의 모든 유형, 부류 또는 분획을 검출하도록 \"학습\"(훈 련)될 수 있다는 점에 유의해야 한다. 알고리즘들이 확립되고 머신 러닝 시스템이 물질 분류들에 대한 차이점들(예를 들어, 시각적으로 식별 가능한 차이점들)(예를 들어, 사용자 정의 통계적 신뢰도 수준 내에서)을 충분히 학습(훈련)한 후, 서로 다른 물질 분 류들에 대한 라이브러리들이 물질 분류/소팅 시스템(예를 들어, 시스템)으로 구현되어, 물질 조각들의 이 질적인 혼합물(예를 들어, MSW 내에 포함된 바와 같이)로부터 물질 조각들(예를 들어, 어두운 색상 및/또는 검 정색 플라스틱들)을 식별 및/또는 분류하는 데 사용되며, 그 후 소팅이 수행될 경우 그러한 분류된 물질 조각들 을 소팅할 수도 있다. 예를 들어, 이러한 시스템은 하나 이상의 MWIR 카메라들로 구현되는 비전 시스템 으로 구성될 수 있다. 머신 러닝 시스템을 구성, 최적화 및 활용하는 기술들은 관련 문헌에서 찾아볼 수 있는 바와 같이 당업자들에게 알려져 있다. 그러한 문헌의 예들로는 문헌 [Krizhevsky et al., \"ImageNet Classification with Deep Convolutional Networks,\" Proceedings of the 25th International Conference on Neural Information Processing Systems, Dec. 3-6, 2012, Lake Tahoe, Nev.] 및 문헌 [LeCun et al., \"Gradient-Based Learning Applied to Document Recognition,\" Proceedings of the IEEE, Institute of Electrical and Electronic Engineers (IEEE), November 1998]과 같은 출판물들이 포함되며, 이 둘 모두는 전체적으로 본 명세서에 참고로 포함된다. 일 예의 기술에서, 특정 물질 조각과 관련하여 비전 또는 센서 시스템에 의해 포착된 데이터는 (머신 러닝 시스 템을 구현(으로 구성)하는 데이터 처리 시스템(예를 들어, 도 9의 데이터 처리 시스템 내에서) 데이터 값 들의 어레이로서 배열로 처리될 수 있다. 예를 들어, 데이터는 특정 물질 조각과 관련하여 디지털 카메라, 다 른 유형의 이미징 센서(예를 들어, 스페심 에프엑스50과 같은 MWIR 카메라 또는 동등한 유형의 MWIR 카메라) 또 는 다른 유형의 센서 시스템에 의해 포착되고 데이터 값들의 어레이(예를 들어, 이미지 데이터 패킷들)로 처리 된 스펙트럼 데이터일 수 있다. 각각의 데이터 값은 단일 숫자로 표시되거나 값들을 나타내는 일련의 숫자들로 서 표시될 수 있다. 이러한 값들에는 뉴런 가중치 파라미터들(예를 들어, 신경망 사용)이 곱해질 수 있으며, 가능하게는 바이어스(bias)가 추가될 수 있다. 이 값은 뉴런 비선형성에 공급될 수 있다. 뉴런이 출력한 결과값은 이 출력에 후속 뉴런 가중치 값들과 선택적으로 추가된 바이어스를 곱한 후 다시 한 번 뉴런 비선형성에 공급하는 등 기존 값들과 동일하게 처리할 수 있다. 이러한 공정의 각각의 반복을 신경망의 \"레이어\"라고 한다. 최종 레이어의 최종 출력들은 물질 조각과 관련된 포착된 데이터에서 물질(예를 들어, 어두운 색상 및/ 또는 검정색 플라스틱들)이 존재하거나 존재하지 않을 확률들로 해석될 수 있다. 이러한 공정의 예들은 앞서 언급한 참고자료들 \"심층 컨볼루션 네트워크를 사용한 이미지넷 분류\" 및 \"문서 인식에 적용된 그라디언트 기반 학습\"에 자세히 설명되어 있다. 신경망이 구현되는 본 개시의 특정 실시예들에 따르면, 최종 레이어(\"분류 레이어\")로서, 뉴런의 최종 출력 세 트는 물질 조각(예를 들어, 어두운 색상 및/또는 검정색 플라스틱들)이 포착된 데이터와 연관될 가능성을 나타 내도록 훈련된다. 작동 중에 물질 조각이 포착된 데이터와 연관될 가능성이 사용자가 지정한 임계값을 초과하 면, 해당 물질 조각이 실제로 포착된 데이터와 연관된 것으로 결정된다. 이러한 기술들은 특정 포착된 데이터 와 연관된 물질 유형의 존재 여부뿐만 아니라 특정 포착된 데이터의 하위 영역들이 하나의 유형의 물질 또는 다 른 유형의 물질에 속하는지 여부를 결정하도록 확장할 수 있다. 이 공정을 세분화라고 하며, \"완전 컨볼루션\" 신경망들 또는 완전 컨볼루션은 아니지만 컨볼루션 부분을 포함하는(즉, 부분적 컨볼루션) 네트워크들과 같은 신경망들을 사용하는 기술들이 문헌에 나와 있다. 이를 통해 물질의 위치와 크기를 결정할 수 있다. 본 개시는 머신 러닝 기법들에만 제한되지 않음을 이해해야 한다. 물질 분류/식별을 위한 다른 일반적인 기술 들도 사용될 수 있다. 예를 들어, 센서 시스템은 다중 또는 하이퍼 스펙트럼 카메라들을 사용하는 광학 분광 기술들을 활용하여 물질의 스펙트럼 배출들(즉, 스펙트럼 이미징)을 검사함으로써 물질의 유형, 부류 또는 분획 의 존재 유무를 나타낼 수 있는 신호를 제공할 수 있다. 물질 조각의 스펙트럼 이미지들은 템플릿 매칭 알고리 즘에도 사용될 수 있으며, 스펙트럼 이미지들의 데이터베이스를 획득한 스펙트럼 이미지와 비교하여 해당 데이 터베이스로부터 특정 유형들의 물질들이 있는지 여부를 찾는다. 포착한 스펙트럼 이미지의 히스토그램을 히스 토그램들의 데이터베이스와 비교할 수도 있다. 마찬가지로, 낱말 꾸러미 모델(bag of words model)을 규모 불 변 특징 변환(\"SIFT\")과 같은 특징 추출 기법과 함께 사용하여 포착한 스펙트럼 이미지와 데이터베이스의 특징 들 간에 추출된 특징들을 비교할 수 있다. 따라서, 본 명세서에 개시된 바와 같이, 본 개시의 특정 실시예들은 컨베이어 시스템으로부터 어떤 물질 조각들 을 정의된 그룹들로 전환해야 하는지 결정하기 위해 물질들의 하나 이상의 서로 다른 유형들, 부류들 또는 분획 들을 식별/분류하는 것을 제공한다. 특정 실시예들에 따르면, 머신 러닝 기법들은 물질들(예를 들어, 어두운 색상 및/또는 검정색 플라스틱들)의 다양한 하나 이상의 서로 다른 유형들, 부류들 또는 분획들을 식별하기 위 해 신경망을 훈련(즉, 구성)하는 데 활용된다. 스펙트럼 이미지들 또는 다른 유형들의 감지된 정보(예를 들어, MWIR 스펙트럼 데이터)는 (예를 들어, 컨베이어 시스템 상에서 이동하는) 물질들로부터 포착되고, 이러한 물질 들의 식별/분류에 기초하여, 본 명세서에 설명된 시스템들은 어떤 물질 조각이 컨베이어 시스템에 남아 있도록 허용되어야 하는지, 그리고 어떤 물질 조각이 컨베이어 시스템으로부터 전환/제거되어야 하는지(예를 들어, 수 집 통으로 또는 다른 컨베이어 시스템으로 전환) 결정할 수 있다. 본 개시의 특정 실시예에 따르면, 기존 설비(예를 들어, 시스템)를 위한 머신 러닝 시스템은 현재 신경망 파라미터들의 세트를 새로운 신경망 파라미터들의 세트로 대체하여 물질들의 새로운 유형, 부류 또는 분획의 특 성들을 식별/분류하도록 동적으로 재구성될 수 있다. 여기서 한 가지 언급할 점은, 본 개시의 특정 실시예들에 따르면, 물질 조각들의 검출/포착된 특징들/특성들(예 를 들어, 스펙트럼 이미지들)은 반드시 단순히 특별히 식별 가능하거나 분별 가능한 물리적 특성들일 필요는 없 으며; 수학적으로만 표현될 수 있거나 수학적으로 전혀 표현되지 않는 추상적인 공식들일 수 있지만; 그럼에도 머신 러닝 시스템은 훈련 스테이지 동안 제어 샘플들을 분류할 수 있는 패턴들을 찾기 위해 스펙트럼 데이터를 파싱하도록 구성될 수 있다는 점이다. 또한, 머신 러닝 시스템은 물질 조각의 포착된 정보(예를 들어, 스펙트 럼 이미지들)의 하위 섹션들을 취하고 미리정의된 분류들 간의 상관 관계들을 찾으려고 시도할 수 있다. 본 개시의 특정 실시예들에 따르면, 물질 조각들의 제어 샘플들이 비전 시스템 및/또는 센서 시스템(들)에 의해 통과되는 훈련 스테이지를 활용하는 대신, 머신 러닝 시스템의 훈련은 물질 조각들의 데이터/정보가 비전/센서 시스템에 의해 포착될 때, 사용자가 각각의 물질 조각을 식별하는 라벨 또는 주석을 입력하는 라벨링/주석 기술 을 활용하여 수행될 수 있으며, 이는 이질적인 물질 조각들의 혼합물 내에서 물질 조각들을 분류할 때 머신 러 닝 시스템에서 사용할 라이브러리를 생성하는 데 사용될 수 있다. 도 3 내지 도 6을 참조하면, 본 개시의 특정 실시예들은 플라스틱들의 다양한 유형들, 부류들 또는 분획들을 고 유하게 식별하는 방식으로 다수의 센서 기술들(예를 들어, 시각적(\"VIS\"), XRF, NIR 및 MWIR의 임의의 조합)을결합 또는 융합하여 플라스틱들을 유기 및 무기 화학 성분으로 소팅할 수 있도록 구성될 수 있다. 그러나 MSW 에 포함된 이들 플라스틱 조각들은 크기들과 형상들이 서로 매우 다르기 때문에 이들 서로 다른 센서들에서 생 성되는 신호들은 센서들 간에 큰 편차들이 있을 수 있다. 따라서, 머신 러닝과 다양한 센서 기술들의 융합과의 조합을 통해 이러한 큰 편차들에도 불구하고 이러한 신호들의 분류 정확도를 향상시킬 수 있다. 시스템에서 다 수의 서로 다른 센서들을 구현하는 것은 시스템의 비용을 증가시키고, 또한 소팅 속도를 감소시킬 수 있기 때문 에, 본 개시의 특정 실시예들은 경제성을 증가시키면서도 물질들을 충분히 소팅할 수 있도록 더 적은 수의 센서 시스템들(및 그에 따른 더 낮은 자본 및 운영 비용들)을 갖는 시스템(예를 들어, 시스템)을 구현할 수 있 다. 도 4는 물질 조각들(예를 들어, 플라스틱 조각들)이 각각의 물질 조각으로부터 스펙트럼 데이터를 포 착하는 센서 시스템(들)을 지나 컨베이어 시스템에 의해 이송되는 시스템(예를 들어, 시스템)의 단순 화된 개략도를 예시한다. 이 비제한적인 예에서, 센서 시스템(들)은 각각의 물질 조각의 가시 이미지 데 이터를 포착하는 카메라(예를 들어, 비전 시스템), XRF 시스템, NIR 시스템 및 MWIR 시스 템이다. 그러나, 본 명세서에 개시된 임의의 다른 센서 시스템들이 임의의 조합으로 활용될 수 있음에 유 의해야 한다. 도 3 및 도 4를 참조하면, 물질들의 화학적 시그니처들은 하나 이상의 센서 시스템을 사용하여 공정 블록 에서 결정된다. 센서 시스템(들)으로부터 감지/검출/포착된 신호는 각각의 물질 조각에 대해 (예를 들어, 다차 원 데이터 어레이에서) 결합되어 화학적 시그니처를 생성한다. XRF 센서 시스템은 플라스틱 조각들 내에 무기 원소들 또는 분자들의 존재 여부를 결정할 수 있는 반면, NIR 및 MWIR과 같은 하나 이상의 다른 센서 시스템들 을 조합하면 플라스틱 조각들 내에 유기 원소들 또는 분자들의 존재 여부를 결정할 수 있다는 점을 상기해야 한 다. 공정 블록에서, 각각의 물질 조각의 가시 이미지가 포착된다. 공정 블록에서, 각각의 물질 조 각의 포착된 가시 이미지(즉, 연관된 이미지 데이터)는 결정된 화학적 시그니처(즉, 스펙트럼 이미지 데이터)와 연관된다. 도 5 및 도 6은 두 가지 서로 다른 유형들의 플라스틱 물질들―감자칩 봉지와 전자 제품 포장―에 대한 화학적 시그니처들 및 연관된 이미지 데이터의 비제한적인 예시적인 표현들을 예시한다. 쉽게 알 수 있는 바와 같이, 서로 다른 유형들 또는 부류들의 플라스틱 조각들은 서로 다른(고유한) 화학적 시그니처들을 가질 것이며, 이는 본 개시의 실시예들 내에서 플라스틱 폐기물에 대한 분획들 및/또는 분류들(사용자가 정의할 수 있음)을 생성하기 위해 활용된다. 본 개시의 특정 실시예들에 따르면, 특정 화학적 시그니처를 플라스틱 조각 의 특정 유형 또는 부류와 연관시키기 위한 머신 러닝 시스템을 훈련시키기 위해, 도 4에 예시된 시스템을 통해 플라스틱 조각들의 특정 유형들 또는 부류들의 제어 그룹들이 실행될 수 있다. 예를 들어, 도 5에 예시된 예와 관련하여, 다수의 감자칩 봉지들(물리적 조건들 또는 배향들이 서로 다른 봉지 들 또는 서로 다른 브랜드들의 칩들 및/또는 제조업체들과 연관된 봉지들을 포함할 수 있음)에서 포착된 이미지 들이 머신 러닝 시스템을 훈련시키기 위해 처리될 수 있다. 공정 블록은 플라스틱 조각들을 하나 이상의 분획들로 분리하는 것을 포함할 수 있다. 이러한 분획들을 생성하는 방식들에는 여러 가지가 있다. 하나의 방법은 주 원소를 기반으로 제1 티어를 생성한 다음 부 원소들 을 기반으로 제2 및 심지어 제3 티어들을 생성하는 것이다. 예를 들어, 분획들은 먼저 폴리머 유형에 의해 결 정된 다음 알루미늄과 아연과 같은 무기 원소들로 분기될 수 있다. 그런 다음 폴리머들의 혼합물들에 대해 다 른 예시적인 분획들을 만든 다음 무기 원소 조성으로 분기할 수 있다. 주성분 분석, K-평균 클러스터링 및 비 지도 및 준지도 학습과 같은 분획들을 결정하기 위해 이러한 유형의 클러스터링을 수행하는 계산 방법들도 있다. 분획들은 본 명세서에서 추가로 정의된다. 공정 블록에서, 분획들이 결정된 후, 분획들에 관련된 플라스틱 조각들을 소팅하여(예를 들어, 수동으로) 각각의 분획에 대한 제어 그룹을 생성할 수 있다. 각각의 분획은 센서 시스템(들)으로 측정되었기 때문에 각각 의 제어 그룹에는 조각들에 대한 화학 정보가 포함되어 있다. 비전 시스템(예를 들어, 비전 시스템)은 머 신 러닝 시스템을 훈련시켜 이러한 분획들을 식별하는 데 사용될 수 있다. 이 방법을 사용하면, 플라스틱들의 화학 데이터가 시각적 특징들로 전송되어 머신 러닝 시스템이 분류를 학습할 수 있다. 또한, 시스템이 시 각적 이미지들을 기초로 분류를 수행하는 데 사용될 때, 화학 성분에 의해 플라스틱들을 분리한다. 이 방법은 두 객체들이 서로 다르게 보이고 화학 성분들이 서로 다를 때 작동한다. 두 객체들이 동일하거나 매우 유사해 보이지만 화학 성분들이 서로 다른 경우, 두 개 이상의 센서 시스템들을 사용하여 분류를 수행할 수 있다(예를 들어, VIS와 XRF 등). 결정된 분획들은 임의의 원하는 다양한 특정 유기 및/또는 무기 원소들 또는 분자들을 포함할 수 있기 때문에, 공정은 소팅 시스템 내에 구현된 머신 러닝 시스템을 훈련시켜, 하나 이상의 서로 다른 유형들 또는 부류 들의 플라스틱 조각들을 포함하는 적어도 하나의 분획을 생성하도록 서로 다른 플라스틱 조각들의 이질적인 혼 합물을 소팅하게끔 구성되도록 하는 데 활용될 수 있다. 예를 들어, 머신 러닝 시스템이 특정 유기 및/또는 무 기 원소들 또는 분자들의 조합을 포함하는 임의의 플라스틱 조각을 식별하도록 훈련된 경우, 소팅이 완료되면 소팅된 분획에는 모두 동일하지 않은 플라스틱 조각들(즉, 각각의 플라스틱 칩 백은 미리결정된 분획에 의해 정 의된 유기 및/또는 무기 원소들 또는 분자들로 구성되므로 서로 다른 칩들의 브랜드들에 관련된 복수의 플라스 틱 칩 백들)이 포함될 수 있다. 도 7은 본 개시의 특정 실시예들에 따라 비전 시스템 및/또는 하나 이상의 센서 시스템들을 이용하여 물질 조각 들을 분류/소팅하는 공정의 예시적인 실시예들을 묘사하는 순서도를 예시한다. 공정의 다양한 양 태들은 MWIR 분광법이 활용되고 있다는 사실을 설명하기 위해 수정될 수 있음에 유의해야 한다. 공정은 플라스틱 조각들의 이질적인 혼합물을 미리결정된 유형들, 부류들 및/또는 분획들의 임의의 조합으로 분류(예를 들어, 어두운 색상 및/또는 검정색 플라스틱들을 다른 플라스틱들 또는 폐기물로부터 분류)하기 위해 수행될 수 있다. 공정은 도 1의 시스템을 포함하여, 본 명세서에 설명된 본 개시의 실시예들 중 임의의 실시 예 내에서 동작하도록 구성될 수 있다. 공정의 동작은 시스템(예를 들어, 도 1의 컴퓨터 시스템, 비전 시스템 및/또는 센서 시스템)을 제어하는 컴퓨터 시스템(예를 들어, 도 9의 컴퓨터 시스템 ) 내에서를 포함하여, 하드웨어 및/또는 소프트웨어에 의해 수행될 수 있다. 공정 블록에서, 물질 조각들은 컨베이어 시스템 상에 퇴적될 수 있다. 공정 블록에서, 각각의 물질 조각의 컨베이어 시스템 상의 위치는 물질 조각이 시스템을 통과할 때 각각의 물질 조각의 추적을 위해 검출된다. 이는 비전 시스 템에 의해 수행될 수 있다(예를 들어, 컨베이어 시스템 포지션 검출기(예를 들어, 포지션 검출기)와 통신하는 동안 물질 조각을 기본 컨베이어 시스템 물질과 구별함으로써). 대안적으로, 물질 추적 디바이스 를 사용하여 조각들을 추적할 수 있다. 또는, (가시광선, UV, 및 IR을 포함하는(그러나, 이에 제한되지 않음)) 광원을 생성할 수 있고 조각들의 위치를 파악하는 데 사용될 수 있는 검출기를 갖는 임의의 시스템이 사 용될 수 있다. 공정 블록에서, 물질 조각이 비전 시스템 및/또는 센서 시스템(들) 중 하나 이상에 근접 하여 이동하면, 물질 조각의 감지된 정보/특성들이 (예를 들어, 하나 이상의 MWIR 카메라들로 구현되는 센서 시 스템 또는 비전 시스템에 의해) 포착/획득된다. 공정 블록에서, 이전에 개시된 것과 같은 비전 시스템 (예를 들어, 컴퓨터 시스템 내에 구현됨)은 포착된 정보(예를 들어, 각각의 물질 조각으로부터 반사된 MWIR)의 사전 처리를 수행할 수 있으며, 이는 물질 조각들 각각의 정보를 검출(추출)하는데 활용할 수 있다(예 를 들어, 배경(예를 들어, 컨베이어 벨트)으로부터; 다시 말해, 사전 처리는 물질 조각과 배경 사이의 차이를 식별하는 데 활용될 수 있다). 팽창, 임계값, 및 윤곽화와 같은 잘 알려진 이미지 처리 기법들이 물질 조각을 배경과 구별되는 것으로 식별하기 위해 활용될 수 있다. 공정 블록에서, 세분화가 수행될 수 있다. 예 를 들어, 포착된 정보는 하나 이상의 물질 조각들과 관련된 정보를 포함할 수 있다. 추가적으로, 특정 물질 조 각은 그 이미지가 포착될 때 컨베이어 벨트의 이음새에 위치할 수 있다. 따라서, 이러한 경우 개별 물질 조각 의 이미지를 이미지의 배경으로부터 분리하는 것이 바람직할 수 있다. 공정 블록의 예시적인 기술에서, 제1 단계는 이미지의 높은 대비를 적용하는 것이며; 이러한 방식으로, 배경 픽셀들은 실질적으로 모두 검정색 픽셀들로 감소되고, 물질 조각과 관련된 픽셀들 중 적어도 일부는 실질적으로 모두 백색 픽셀들로 밝아진다. 그런 다음 백색인 물질 조각의 이미지 픽셀들이 물질 조각의 전체 크기를 덮도록 확대된다. 이 단계가 끝나면 물질 조각의 위치는 검정색 배경에 모든 백색 픽셀들의 고대비 이미지가 된다. 그런 다음 윤곽화 알고리즘을 사용하여 물질 조각의 경계들을 검출할 수 있다. 경계 정보가 저장되고 그런 다음, 경계 위치들이 원본 이미지 로 전송된다. 그런 다음 원본 이미지에서 이전에 정의한 경계보다 큰 영역에 대해 세분화를 수행한다. 이러한 방식으로 물질 조각이 식별되고 배경으로부터 분리된다. 선택 사항인 공정 블록에서, 물질 조각들은 물질 조각들 각각을 추적하고, 그리고/또는 물질 조각들 크기 및/또는 형상을 결정하기 위해 물질 조각 추적 디바이스 및/또는 센서 시스템의 근접 내에서 컨베이어 시스템을 따라 이송될 수 있으며, 이는 소팅 시스템 내에 XRF 시스템 또는 일부 다른 분광학 센서가 구현되는 경우 유용 할 수 있다. 공정 블록에서, 후 처리가 수행될 수 있다. 후 처리는 머신 러닝 시스템에서 사용할 수 있 도록 준비하기 위해 포착된 정보/데이터의 크기를 조정하는 것을 포함할 수 있다. 또한, 여기에는 물질 조각들 을 분류하는 머신 러닝 시스템의 능력을 향상시키는 방식으로 특정 특성들(예를 들어, 이미지 대비 향상, 이미 지 배경 변경 또는 필터들의 적용)을 수정하는 것이 포함될 수 있다. 공정 블록에서, 데이터의 크기가 조정될 수 있다. 신경망들과 같은 특정 머신 러닝 시스템들에 대한 데이터 입력 요건들에 맞추기 위해 특정 상 황들에서 데이터 크기 조정이 필요할 수 있다. 예를 들어, 신경망들은 전형적인 디지털 카메라들에 의해 포착 된 이미지들의 크기들보다 훨씬 작은 이미지 크기들(예를 들어, 225 x 255 픽셀들 또는 299 x 299 픽셀들)을 요구할 수 있다. 또한, 입력 데이터 크기가 작을수록 분류를 수행하는 데 필요한 처리 시간이 줄어든다. 따라서, 데이터 크기들이 작을수록 궁극적으로 시스템의 처리량을 증가시키고 그 가치를 높일 수 있다. 공정 블록들(3510 및 3511)에서, 각각의 물질 조각은 하나 이상의 MWIR 카메라들에 의해 감지/검출된 특징들에 기초하여 식별/분류된다. 예를 들어, 공정 블록은 하나 이상의 머신 러닝 알고리즘들을 사용하는 신경망 으로 구성될 수 있으며, 이 신경망은 추출된 특징들을 이전에 생성된(예를 들어, 훈련 스테이지에서 생성된) 지 식 기반에 저장된 특징들과 비교하고, 그러한 비교에 기초하여 가장 일치도가 높은 분류를 물질 조각들 각각에 할당한다. 머신 러닝 시스템의 알고리즘들은 자동으로 훈련된 필터들을 사용하여 포착된 정보/데이터를 계층적 방식으로 처리할 수 있다. 그런 다음 필터 응답들은 최종 단계에서 확률이 얻어질 때까지 알고리즘들의 다음 레벨들에서 성공적으로 결합된다. 공정 블록에서, 이러한 확률들은 개개의 물질 조각들이 소팅되어야 하 는 N 개의 소팅 리셉터클들 중 어느 소팅 리셉터클로 소팅되어야 하는지를 결정하기 위해 N 개의 분류들 각각에 대해 사용될 수 있다. 예를 들어, N 분류들 각각은 하나의 소팅 리셉터클에 할당될 수 있고, 고려 중인 물질 조각은 미리정의된 임계값보다 큰 가장 높은 확률을 반환하는 분류에 대응하는 해당 리셉터클에 소팅될 수 있다. 본 개시의 실시예들 내에서, 그러한 미리정의된 임계값들은 사용자에 의해 미리 설정될 수 있다. 확률 들 중 어느 것도 미리결정된 임계값보다 크지 않은 경우, 특정 물질 조각은 이상치 리셉터클(예를 들어, 소팅 리셉터클)로 소팅될 수 있다. 다음으로, 공정 블록에서, 물질 조각의 분류 또는 분류들에 대응하는 소팅 디바이스가 활성화된다. 물질 조각의 이미지가 포착된 시간과 소팅 디바이스가 활성화되는 시간 사이에, 물질 조각은 비전 시스템 및/또는 센 서 시스템(들)의 근접성으로부터 컨베이어 시스템의 하류 위치로 이동하였다(예를 들어, 컨베이어 시스템의 이 송 속도에 따라). 본 개시의 실시예들에서, 소팅 디바이스의 활성화는 물질 조각이 물질 조각의 분류에 매핑된 소팅 디바이스를 통과할 때, 소팅 디바이스가 활성화되고, 물질 조각이 컨베이어 시스템으로부터 연관된 분류 리셉터클로 전환/배출되도록 타이밍이 정해진다. 본 개시의 실시예들 내에서, 소팅 디바이스의 활성화는 물질 조각이 소팅 디바이스 앞을 통과하는 시기를 검출하고 소팅 디바이스의 활성화를 가능하게 하는 신호를 송신하 는 개개의 포지션 검출기에 의해 타이밍이 정해질 수 있다. 공정 블록에서, 활성화된 소팅 디바이스에 대응하는 소팅 리셉터클은 전환/배출된 물질 조각을 수용한다. 도 8은 본 개시의 특정 실시예들에 따라 물질 조각들을 소팅하는 공정의 예시적인 실시예들을 묘사하는 순 서도를 예시한다. 공정의 다양한 양태들은 MWIR 분광법이 활용되고 있다는 사실을 설명하기 위해 수정될 수 있다는 점에 유의해야 한다. 공정은 도 1의 시스템을 포함하여, 본 명세서에 설명된 본 개시의 임의의 실시예들 중 임의의 실시예 내에서 동작하도록 구성될 수 있다. 공정은 공정과 함께 동작하 도록 구성될 수 있다. 예를 들어, 본 개시의 특정 실시예들에 따라, 공정 블록들(803 및 804)은 물질 조각들을 분류 및/또는 소팅하기 위해 머신 러닝 시스템과 함께 구현되는 비전 시스템의 활동들을 머신 러닝 시스템 과 함께 구현되지 않는 센서 시스템(예를 들어, 센서 시스템)과 결합하기 위해 공정 블록(예를 들어, 공정 블록들(3503 내지 3510)과 직렬 또는 병렬로 작동함)에 통합될 수 있다. 공정의 동작은 시스템(예를 들어, 도 1의 컴퓨터 시스템)을 제어하는 컴퓨터 시스템(예를 들어, 도 9 의 컴퓨터 시스템) 내를 포함하여, 하드웨어 및/또는 소프트웨어에 의해 수행될 수 있다. 공정 블록 에서, 물질 조각들은 컨베이어 시스템 상에 퇴적될 수 있다. 다음으로, 선택사항인 공정 블록에서, 물질 조각들은 각각의 물질 조각들을 추적하고, 그리고/또는 물질 조각들의 크기 및/또는 형상을 결정하기 위해 물질 조각 추적 디바이스 및/또는 광학 이미징 시스템과 근접한 컨베이어 시스템을 따라 이송될 수 있다. 공정 블록에서, 물질 조각이 센서 시스템에 근접하여 이동한 경우, 물질 조각은 (예를 들어, 하나 이상의 MWIR 카메라들로부터의) EM 에너지(파동들) 또는 센서 시스템에 의해 활용되는 특정 유형의 센서 기술에 적합한 일부 다른 유형의 자극을 통해 정보를 취득하거나 자극을 받을 수 있다. 공정 블록에서, 물질 조각의 물리적 특성들은 센서 시스템에 의해 감지/검출되고 포착된다. 공정 블록에서, 물질 조각들의 적어도 일부에 대 해, 물질의 유형이 (적어도 부분적으로) 포착된 특성들에 기초하여 식별/분류되며, 이는 비전 시스템과 함 께 머신 러닝 시스템에 의한 분류와 결합될 수 있다. 다음으로, 물질 조각들의 소팅이 수행되어야 하는 경우, 공정 블록에서, 물질 조각의 분류, 또는 분류들에 대응하는 소팅 디바이스가 활성화된다. 물질 조각이 감지된 시간과 소팅 디바이스가 활성화되는 시간 사이에, 물질 조각은 컨베이어 시스템의 이송 속도에 따라 센서 시스템의 근접으로부터 컨베이어 시스템의 하류 위치로 이동한다. 본 개시의 특정 실시예들에서, 소팅 디바이스의 활성화는 물질 조각이 물질 조각의 분류에 매핑된 소팅 디바이스를 통과할 때, 소팅 디바이스가 활성화되고, 물질 조각이 컨베이어 시스템으로부터 연관된 분류 리셉터클로 전환/배출되도록 타이밍이 정해진다. 본 개시의 특정 실시예들 내에서, 소팅 디바이스의 활성화는물질 조각이 소팅 디바이스 앞을 통과하는 시기를 검출하고 소팅 디바이스의 활성화를 가능하게 하는 신호를 송 신하는 개개의 포지션 검출기에 의해 타이밍이 결정될 수 있다. 공정 블록에서, 활성화된 소팅 디바이스 에 대응하는 소팅 리셉터클은 전환/배출된 물질 조각을 수용한다. 본 개시의 특정 실시예들에 따르면, 시스템의 복수의 적어도 일부가 다수의 반복들 또는 소팅 레이어들을 수행하기 위해 연속적으로 함께 연결될 수 있다. 예를 들어, 2 개 이상의 시스템들이 그러한 방식으로 연 결될 때, 컨베이어 시스템은 단일 컨베이어 벨트 또는 다수의 컨베이어 벨트들로 구현될 수 있으며, 물질 조각 들을 소터(예를 들어, 제1 자동화 제어 시스템 및 연관된 하나 이상의 소팅 디바이스들(126...129))에 의 해 이질적인 물질들의 혼합물의 제1 세트의 물질 조각들을 소팅하도록 구성된 제1 비전 시스템(및 특정 실시예 들에 따르면 센서 시스템)을 지나 하나 이상의 리셉터클들(예를 들어, 소팅 통들(136...139))의 제1 세트로 전 달하고, 그 후 물질 조각들을 제2 소터에 의해 이질적인 물질들의 혼합물의 제2 세트의 물질 조각들을 소팅하도 록 구성된 제2 비전 시스템(및 특정 실시예에 따르면 다른 센서 시스템)을 지나 하나 이상의 소팅 통들의 제2 세트 내로 전달한다. 이러한 다단계 소팅에 대한 추가 논의는 미국 공개 특허 출원 번호 제2022/0016675호에 있으며, 이는 본 명세서에 참조로 포함되어 있다. 이러한 연속 시스템들은 그러한 방식으로 함께 연결된 임의의 수의 이러한 시스템들을 포함할 수 있다. 본 개시의 특정 실시예들에 따르면, 각각의 연속 시스템은 이전 시스템(들)과 서로 다른 분류 또는 유형의 물질 을 소팅해 내도록 구성될 수 있다. 본 개시의 다양한 실시예에 따르면, 물질들의 서로 다른 유형들, 부류들 또는 분획들은 머신 러닝 시스템과 함 께 사용하기 위해 각각 서로 다른 유형들의 센서들에 의해 분류될 수 있고, 스크랩 또는 폐기물의 흐름에서 물 질 조각들을 분류하기 위해 결합될 수 있다. 본 개시의 다양한 실시예들에 따르면, 2 개 이상의 센서들로부터의 데이터(예를 들어, 스펙트럼 데이터)는 단일 또는 다수의 머신 러닝 시스템들을 사용하여 결합되어 물질 조각들의 분류를 수행할 수 있다. 본 개시의 다양한 실시예들에 따르면, 다수의 센서 시스템들이 단일 컨베이어 시스템에 장착될 수 있으며, 각각 의 센서 시스템은 서로 다른 머신 러닝 시스템을 활용한다. 본 개시의 다양한 실시예들에 따르면, 다수의 센서 시스템들이 서로 다른 컨베이어 시스템들에 장착될 수 있으며, 각각의 센서 시스템은 서로 다른 머신 러닝 시스 템을 활용할 수 있다. 본 개시의 특정 실시예들은 소팅 후 특정 요소 또는 물질의 미리결정된 중량 또는 체적 비율보다 적은 함량을 갖는 물질들의 질량을 생성하도록 구성될 수 있다. 본 개시의 다양한 실시예들에 따르면, 서로 다른 유형들의 센서 시스템들의 임의의 조합이 본 개시에 개시된 바 와 같이 물질들을 식별/분류하고, 가능하다면 소팅하는 데 활용될 수 있다. 예를 들어, 본 명세서에 개시된 각 이미징 또는 분광 센서는 해당 센서 시스템에 특정한 머신 러닝 시스템에 의해 처리될 수 있도록 물질 조각에서 감지된 정보/특성으로부터 데이터를 생성하는 데 사용될 수 있다. 대안적으로, 임의의 센서 시스템은 머신 러 닝 시스템에 의한 처리 없이, 또는 머신 러닝 시스템에 의한 처리와 함께, 또는 이 둘의 조합으로 사용될 수 있 다. 본 개시의 다양한 실시예들에 따르면, 물질들의 서로 다른 유형들, 부류들 및/또는 분획들은 머신 러닝 시스템 과 함께 사용하기 위해 각각 서로 다른 유형들의 센서 시스템들에 의해 분류될 수 있으며, 폐기물 흐름에서 물 질 조각들을 분류하기 위해 결합될 수 있다. 이제 도 9를 참조하여, 본 개시의 실시예들의 양태들이 구현될 수 있는 데이터 처리(\"컴퓨터\") 시스템을 예시하는 블록도가 묘사되어 있다. (\"컴퓨터\", \"시스템\", \"컴퓨터 시스템\" 및 \"데이터 처리 시스템\"이라는 용 어들은 본 명세서에서 상호 교환적으로 사용될 수 있다). 컴퓨터 시스템, 자동화 제어 시스템, 센서 시스템(들)의 양태들 및/또는 비전 시스템은 컴퓨터 시스템과 유사하게 구성될 수 있다. 컴퓨 터 시스템은 로컬 버스(예를 들어, 주변 장치 구성요소 상호연결(\"PCI\") 로컬 버스 아키텍처)를 이 용할 수 있다. 가속 그래픽스 포트(\"AGP\") 및 산업 표준 아키텍처(\"ISA\") 등과 같은 임의의 적합한 버스 아키 텍처가 이용될 수 있다. 하나 이상의 프로세서들, 휘발성 메모리 및 비휘발성 메모리는 로 컬 버스에 (예를 들어, PCI 브리지(도시되지 않음)를 통해) 연결될 수 있다. 통합 메모리 제어기 및 캐 시 메모리는 하나 이상의 프로세서들에 결합될 수 있다. 하나 이상의 프로세서들은 하나 이상의 중앙 프로세서 유닛들 및/또는 하나 이상의 그래픽스 프로세서 유닛들 및/또는 하나 이상의 텐서 처리 유 닛들을 포함할 수 있다. 로컬 버스에 대한 추가 연결들은 직접 구성요소 상호연결 또는 애드-인 보드들을 통해 이루어질 수 있다. 묘사된 예에서, 통신(예를 들어, 네트워크(LAN)) 어댑터, I/O(예를 들어, 소 형 컴퓨터 시스템 인터페이스(\"SCSI\") 호스트 버스) 어댑터 및 확장 버스 인터페이스(도시되지 않음)는 직접 구성요소 연결을 통해 로컬 버스에 연결될 수 있다. 오디오 어댑터(도시되지 않음), 그래픽스 어댑 터(도시되지 않음) 및 디스플레이 어댑터(디스플레이에 결합됨)는 (예를 들어, 확장 슬롯들에 삽입 된 애드-인 보드들에 의해) 로컬 버스에 연결될 수 있다. 사용자 인터페이스 어댑터는 키보드 및 마우스, 모뎀(도시되지 않음) 및 추가 메모리(도시되 지 않음)를 위한 연결을 제공할 수 있다. I/O 입출력 어댑터는 하드 디스크 드라이브, 테이프 드 라이브 및 CD-ROM 드라이브(도시되지 않음)에 대한 연결을 제공할 수 있다. 운영 체제는 하나 이상의 프로세서들에서 실행될 수 있고, 컴퓨터 시스템 내의 다양한 구성요소들 을 조정하고 제어하는 데 사용될 수 있다. 도 9에서, 운영 체제는 상업적으로 입수 가능한 운영 체제일 수 있 다. 객체 지향 프로그래밍 시스템(예를 들어, 자바, 파이썬 등)은 운영 체제와 함께 실행될 수 있고, 프로그램 들 또는 시스템에서 실행되는 프로그램들(예를 들어, 자바, 파이썬 등)으로부터 운영 체제에 대한 호출을 제공할 수 있다. 운영 체제, 객체 지향 운영 체제 및 프로그램들에 대한 명령들은 하드 디스크 드라이브(343 1)와 같은 비휘발성 메모리 저장 디바이스들에 위치할 수 있고, 프로세서에 의해 실행되도록 휘발 성 메모리에 로딩될 수 있다. 당업자들은 도 9의 하드웨어가 구현예에 따라 달라질 수 있음을 인식할 것이다. 플래시 ROM(또는 등가의 비휘 발성 메모리) 또는 광 디스크 드라이브들 등과 같은 다른 내부 하드웨어 또는 주변 디바이스들이 도 9에 묘사된 하드웨어에 부가적으로 또는 그 대신에 사용될 수 있다. 또한, 본 개시의 임의의 공정들 중 임의의 공정은 멀 티프로세서 컴퓨터 시스템에 적용되거나, 또는 복수의 그러한 시스템들에 의해 수행될 수 있다. 예를 들 어, 머신 러닝 시스템의 훈련은 제1 컴퓨터 시스템에 의해 수행될 수 있고, 소팅을 위한 시스템의 동작은 제2 컴퓨터 시스템에 의해 수행될 수 있다. 다른 예로서, 컴퓨터 시스템은 컴퓨터 시스템이 일부 유형의 네트워크 통신 인터페이스를 포함하는 지 여부에 관계없이, 일부 유형의 네트워크 통신 인터페이스에 의존하지 않고 부팅 가능하도록 구성되는 독립형 시스템일 수 있다. 추가의 예로서, 컴퓨터 시스템은 운영 체제 파일들 또는 사용자 생성 데이터를 저장 하는 비휘발성 메모리를 제공하는 ROM 및/또는 플래시 ROM으로 구성된 내장형 제어기일 수 있다. 도 9에 묘사된 예 및 전술한 예들는 구조적 제한들을 암시하기 위한 것이 아니다. 또한, 본 개시의 양태들의 컴퓨터 프로그램 형태는 컴퓨터 시스템에 의해 사용되는 임의의 컴퓨터 판독 가능한 저장 매체(즉, 플로피 디스 크, 콤팩트 디스크, 하드 디스크, 테이프, ROM, RAM 등)에 상주할 수 있다. 본 명세서에 설명된 바와 같이, 본 개시의 실시예들은 물질 조각들을 식별, 추적, 분류 및/또는 소팅하기 위해 설명된 다양한 기능들을 수행하도록 구현될 수 있다. 이러한 기능들은 하드웨어 및/또는 소프트웨어 내에서, 예를 들어 앞서 언급한 컴퓨터 시스템, 비전 시스템, 센서 시스템(들)의 양태들 및/또는 자동화 제어 시스템과 같은 하나 이상의 데이터 처리 시스템들(예를 들어, 도 9의 데이터 처리 시스템) 내 에서 구현될 수 있다. 그럼에도 불구하고, 본 명세서에 설명된 기능들은 임의의 특정 하드웨어/소프트웨어 플 랫폼으로의 구현을 위해 제한되어서는 안 된다. 당업자가 인식할 수 있는 바와 같이, 본 개시의 양태들은 시스템, 공정, 방법 및/또는 컴퓨터 프로그램 제품으 로서 구체화될 수 있다. 따라서, 본 개시의 다양한 양태들은 전적으로 하드웨어 실시예, 전적으로 소프트웨어 실시예(펌웨어, 상주 소프트웨어, 마이크로 코드 등 포함), 또는 소프트웨어 및 하드웨어 양태들을 결합한 실시 예들의 형태를 취할 수 있으며, 이는 일반적으로 본 명세서에서 \"회로\", \"회로망\", \"모듈\" 또는 \"시스템\"으로 지칭될 수 있다. 또한, 본 개시의 양태들은 컴퓨터 판독 가능 프로그램 코드가 구현된 하나 이상의 컴퓨터 판 독 가능 저장 매체(들)에 구현된 컴퓨터 프로그램 제품의 형태를 취할 수 있다. (그러나, 하나 이상의 컴퓨터 판독 가능 매체(들)의 임의의 조합이 활용될 수 있다. 컴퓨터 판독 가능 매체는 컴퓨터 판독 가능 신호 매체 또는 컴퓨터 판독 가능 저장 매체일 수 있다). 컴퓨터 판독 가능 저장 매체는 예를 들어, 전자, 자기, 광학, 전자기, 적외선, 생물학적, 원자 또는 반도체 시 스템, 장치, 제어기 또는 디바이스 또는 전술한 것들의 임의의 적절한 조합일 수 있으며, 컴퓨터 판독 가능 저 장 매체는 그 자체로 일시적인 신호가 아니다. 컴퓨터 판독 가능 저장 매체의 보다 구체적인 예들(완전하지 않 은 목록)에는 하나 이상의 와이어들을 갖는 전기 연결, 휴대용 컴퓨터 디스켓, 하드 디스크, 랜덤 액세스 메모 리(\"RAM\")(예를 들어, 도 9의 RAM), 읽기 전용 메모리(\"ROM\")(예를 들어, 도 9의 ROM), 지울 수있는 프로그램 가능 읽기 전용 메모리(\"EPROM\" 또는 플래시 메모리), 광섬유, 휴대용 콤팩트 디스크 읽기 전용 메모리(\"CD-ROM\"), 광 저장 디바이스, 자기 저장 디바이스(예를 들어, 도 9의 하드 드라이브) 또는 전술 한 것들의 임의의 적절한 조합이 포함된다. 본 문헌의 맥락에서, 컴퓨터 판독 가능 저장 매체는 명령 실행 시 스템, 장치, 제어기 또는 디바이스에 의해 또는 이와 관련하여 사용하기 위한 프로그램을 포함하거나 저장할 수 있는 임의의 유형적 매체일 수 있다. 컴퓨터 판독 가능 신호 매체에 구현된 프로그램 코드는 무선, 유선, 광섬 유 케이블, RF 등을 포함하는(그러나, 이에 제한되지 않음) 적절한 매체 또는 전술한 것들의 적절한 조합을 사 용하여 전송될 수 있다. 컴퓨터 판독 가능 신호 매체는 예를 들어 기저대역 또는 반송파의 일부로서 컴퓨터 판독 가능 프로그램 코드가 구현된 전파된 데이터 신호를 포함할 수 있다. 이러한 전파된 신호는 전자기, 광학 또는 이들의 임의의 적절한 조합을 포함하는(그러나, 이에 제한되지 않음) 임의의 다양한 형태들을 취할 수 있다. 컴퓨터 판독 가능 신호 매체는, 컴퓨터 판독 가능 저장 매체가 아니며 명령 실행 시스템, 장치, 제어기 또는 디바이스에 의해 또는 이 와 관련하여 사용하기 위한 프로그램을 통신, 전파 또는 전송할 수 있는 임의의 컴퓨터 판독 가능 매체일 수 있 다. 도면들의 순서도 및 블록도들은 본 개시의 다양한 실시예들에 따른 시스템들, 방법들, 공정들 및 프로그램 제품 들의 가능한 구현예들의 아키텍처, 기능성 및 동작을 예시한다. 이와 관련하여, 순서도들 또는 블록도들의 각 블록은 모듈, 세그먼트 또는 코드의 일부를 나타낼 수 있으며, 이는 지정된 논리 기능(들)을 구현하기 위한 하 나 이상의 실행 가능 프로그램 명령들을 포함한다. 또한 일부 구현예들에서는 블록들에 표시된 기능들이 도면 들에 표시된 순서와 다르게 나타날 수 있다는 점에 유의해야 한다. 예를 들어, 연속적으로 도시된 두 블록들이 실제로는 실질적으로 동시에 실행될 수도 있고, 때때로 관련된 기능성에 따라 블록들이 역순으로 실행될 수도 있다. 본 명세서의 실행에서, 순서도 기법은 일련의 순차적인 행위들로 설명될 수 있다. 행위들의 순서와 행위들을 수행하는 주체는 본 교시내용들의 범위를 벗어나지 않는 범위에서 자유롭게 변경될 수 있다. 행위들은 여러 가 지 방식들로 추가, 삭제 또는 변경될 수 있다. 마찬가지로 행위들은 순서를 바꾸거나 반복할 수 있다. 추가로, 공정들, 방법들, 알고리즘들 등이 순차적인 순서로 설명될 수 있지만, 그러한 공정들, 방법들, 알고리 즘들 또는 이들의 임의의 조합은 대안적인 순서들로 수행되도록 작동될 수 있다. 또한, 공정, 방법 또는 알고 리즘 내의 일부 행위들은 적어도 한 시점 동안 동시에 수행될 수 있으며(예를 들어, 병렬로 수행되는 행위들), 전체, 일부 또는 이들의 임의의 조합으로 수행될 수도 있다. 다양한 유형들의 프로세서들(예를 들어, GPU, CPU)에 의해 실행되도록 소프트웨어로 구현된 모듈들 은, 예를 들어, 객체, 절차 또는 함수로서 구성될 수 있는 예를 들어, 하나 이상의 컴퓨터 명령들의 물리적 또 는 논리적 블록들을 포함할 수 있다. 그럼에도 불구하고, 식별된 모듈의 실행 파일들은 물리적으로 함께 위치 할 필요는 없지만, 논리적으로 함께 결합될 때 모듈을 포함하고 모듈의 명시된 목적을 달성하는 서로 다른 위치 들에 저장된 이질적인 명령들을 포함할 수 있다. 실제로 실행 가능 코드의 모듈은 단일 명령이거나 많은 명령 들일 수도 있으며, 여러 서로 다른 코드 세그먼트들, 서로 다른 프로그램들 및 여러 메모리 디바이스들에 분산 되어 있을 수도 있다. 마찬가지로, 운영 데이터(예를 들어, 본 명세서에 설명된 물질 분류 라이브러리들)는 모 듈들 내에서 식별되고 본 명세서에 예시될 수 있으며, 임의의 적절한 형태로 구체화되고 임의의 적절한 유형의 데이터 구조 내에서 구성될 수 있다. 운영 데이터는 단일 데이터 세트로 수집될 수도 있고, 또는 서로 다른 저 장 디바이스들을 포함하여 서로 다른 위치들에 분산될 수도 있다. 데이터는 시스템 또는 네트워크에서 전자 신 호들을 제공할 수 있다. 이러한 프로그램 명령들은 범용 컴퓨터, 특수 목적 컴퓨터 또는 기타 프로그램 가능 데이터 처리 장치(예를 들 어, 제어기)의 하나 이상의 프로세서들 및/또는 제어기(들)에 제공되어 컴퓨터 또는 기타 프로그램 가능 데이터 처리 장치의 프로세서(들)(예를 들어, GPU, CPU)를 통해 실행되는 명령들이 순서도 및/또는 블록도 블록 또는 블록들에 지정된 기능들/행위들을 구현하기 위한 회로망 또는 수단을 생성하도록 기계를 생성할 수 있다. 또한, 블록도들 및/또는 순서도 예시들의 각각의 블록 및 블록도들 및/또는 순서도 예시들의 블록들의 조합들은 지정된 기능들 또는 행위들을 수행하는 특수 목적 하드웨어 기반 시스템들(예를 들어, 하나 이상의 그래픽스 처 리 유닛들(예를 들어, GPU)을 포함할 수 있음) 또는 특수 목적 하드웨어 및 컴퓨터 명령들의 조합들에 의 해 구현될 수 있음에 유의할 것이다. 예를 들어, 모듈은 맞춤형 VLSI 회로들 또는 게이트 어레이들, 로직 칩들, 트랜지스터들, 제어기들 또는 기타 개별 구성요소들과 같은 기성 반도체들을 포함한 하드웨어 회로로 구현될 수 있다. 모듈은 또한 필드 프로그래밍 가능 게이트 어레이들, 프로그래밍 가능 어레이 로직, 프로그래밍 가능 논리 디바이스들 등과 같은 프로그래밍 가능 하드웨어 디바이스들로 구현될 수도 있다. 본 개시의 양태들에 대한 동작들을 수행하기 위한 컴퓨터 프로그램 코드, 즉 명령들은 자바, 스몰토크, 파이썬, C++ 등과 같은 객체 지향 프로그래밍 언어, \"C\" 프로그래밍 언어 또는 이와 유사한 프로그래밍 언어들과 같은 통상적인 절차적 프로그래밍 언어들 또는 본 명세서에 개시된 임의의 머신 러닝 소프트웨어를 포함하는 하나 이 상의 프로그래밍 언어들의 임의의 조합으로 작성될 수 있다. 프로그램 코드는 사용자의 컴퓨터 시스템에서 전 적으로, 사용자의 컴퓨터 시스템에서 부분적으로, 독립형 소프트웨어 패키지로서, 사용자의 컴퓨터 시스템(예를 들어, 소팅에 활용되는 컴퓨터 시스템)에서 부분적으로, 그리고 원격 컴퓨터 시스템(예를 들어, 센서 시스템 훈 련에 활용되는 컴퓨터 시스템)에서 부분적으로, 또는 원격 컴퓨터 시스템 또는 서버에서 전적으로 실행될 수 있 다. 후자의 시나리오에서 원격 컴퓨터 시스템은 근거리 통신망(\"LAN\") 또는 광역 통신망(\"WAN\")을 포함한 임의 의 유형의 네트워크를 통해 사용자의 컴퓨터 시스템에 연결되거나 외부 컴퓨터 시스템(예를 들어, 인터넷 서비 스 제공업체를 사용하여 인터넷을 통해)에 연결될 수 있다. 이러한 프로그램 명령들은 컴퓨터 시스템, 기타 프로그래밍 가능 데이터 처리 장치, 제어기 또는 기타 디바이스 들이 특정 방식으로 작동하도록 지시할 수 있는 컴퓨터 판독 가능 저장 매체에 저장될 수도 있으며, 컴퓨터 판 독 가능 매체에 저장된 명령들은 순서도 및/또는 블록도 블록 또는 블록들에 명시된 기능/행위를 구현하는 명령 들을 포함하는 제조물을 생성한다. 프로그램 명령들은 또한 컴퓨터, 다른 프로그램 가능 데이터 처리 장치, 제어기 또는 다른 디바이스들에 로드되 어 컴퓨터, 다른 프로그램 가능 장치 또는 다른 디바이스들에서 일련의 동작 단계들이 수행되도록 하여 컴퓨터 또는 다른 프로그램 가능 장치에서 실행되는 명령들이 순서도 및/또는 블록도 블록 또는 블록들에 지정된 기능 들/행위들을 구현하기 위한 공정들을 제공하도록 컴퓨터 구현 공정들을 생성할 수 있다. 하나 이상의 데이터베이스들은 다양한 구현예들을 위한 데이터를 저장하고 이에 대한 액세스를 제공하기 위해 호스트에 포함될 수 있다. 당업자는 또한 보안상의 이유들로, 본 개시의 임의의 데이터베이스들, 시스템들 또 는 구성요소들은 단일 위치 또는 다수의 위치들에서 데이터베이스들 또는 구성요소들의 임의의 조합을 포함할 수 있으며, 각각의 데이터베이스 또는 시스템은 방화벽들, 액세스 코드들, 암호화, 암호화 해제 등과 같은 다양 한 적합한 보안 기능들 중 임의의 것을 포함할 수 있음을 이해할 것이다. 데이터베이스는 관계형, 계층형, 객 체 지향 및/또는 이와 같은 임의의 유형의 데이터베이스일 수 있다. 데이터베이스들을 구현하는 데 사용할 수 있는 일반적인 데이터베이스 제품들에는 아이비엠(IBM)의 DB2, 오라클 코포레이션(Oracle Corporation)으로부터 입수 가능한 임의의 데이터베이스 제품들, 마이크로소프트 코포레이션(Microsoft Corporation)의 마이크로소프 트 액세스(Microsoft Access) 또는 임의의 다른 데이터베이스 제품이 포함된다. 데이터베이스는 데이터 테이블 들 또는 조회 테이블들을 포함하여 임의의 적절한 방식으로 구성할 수 있다. 특정 데이터의 연관(예를 들어, 본 명세서에 설명된 소팅 시스템에 의해 처리되는 물질 조각들 각각에 대한)은 당업계에 공지되고 실행되는 임의의 데이터 연계 기법을 통해 달성될 수 있다. 예를 들어, 연관은 수동 또는 자동으로 수행될 수 있다. 자동 연관 기법들에는, 예를 들어, 데이터베이스 검색, 데이터베이스 병합, GREP, AGREP, SQL 등이 포함될 수 있다. 연관 단계는 예를 들어 제조업체 및 소매업체 데이터 테이블들 각각의 키 필 드를 사용하는 데이터베이스 병합 기능으로 수행할 수 있다. 키 필드는 키 필드에 의해 정의된 개체들의 상위 수준 부류에 따라 데이터베이스를 분할한다. 예를 들어, 특정 부류가 제1 데이터 테이블과 제2 데이터 테이블 모두에서 키 필드로서 지정될 수 있으며, 그 후 두 데이터 테이블들은 키 필드의 부류 데이터에 기초하여 병합 될 수 있다. 이러한 실시예들에서, 병합된 각 데이터 테이블들 각각의 키 필드에 대응하는 데이터는 바람직하 게는 동일하다. 그러나, 키 필드들에 동일하지는 않지만 유사한 데이터를 갖는 데이터 테이블들은, 예를 들어, AGREP을 사용하여 병합될 수도 있다. 본 명세서에서는 일부 기능을 수행\"하도록 구성된\" 디바이스 또는 디바이스를 \"구성\"하는 것을 참조한다. 여기 에는 미리정의된 논리 블록들을 선택하고 이들을 논리적으로 연관하여 모니터링 또는 제어 기능들을 포함하는 특정 논리 기능들을 제공하는 것이 포함될 수 있음을 이해해야 한다. 또한, 개조 제어 디바이스의 컴퓨터 소프 트웨어 기반 로직을 프로그래밍하거나, 개별 하드웨어 구성요소들을 배선하거나, 전술한 것 중 임의의 것 또는 전부를 조합하는 것도 포함할 수 있다. 본 명세서의 설명에서, 프로그래밍, 소프트웨어 모듈들, 사용자 선택들, 네트워크 트랜잭션들, 데이터베이스 쿼 리들, 데이터베이스 구조들, 하드웨어 모듈들, 하드웨어 회로들, 하드웨어 칩들, 제어기들 등의 예들과 같은 수 많은 구체적인 상세들이 제공되어, 본 개시의 실시예들에 대한 완전한 이해를 제공한다. 그러나, 관련 기술의당업자는 본 개시가 특정 상세들 중 하나 이상 없이 또는 다른 방법들, 구성요소들, 물질들 등을 사용하여 실시 될 수 있음을 인식할 것이다. 다른 예들에서, 잘 알려진 구조들, 물질들 또는 동작들은 본 개시의 양태들을 모 호하게 하지 않기 위해 상세하게 도시되지 않거나 설명되지 않을 수 있다. 당업자들은 시스템 구성요소들의 다양한 설정들 및 파라미터들(신경망 파라미터들 포함)이 분류 및 소팅되 는 물질들의 유형들, 원하는 분류 및 소팅 결과들, 사용되는 장비의 유형, 이전 분류들의 경험적 결과들, 이용 가능한 데이터 및 기타 요인들에 기초하여 시간이 경과함에 따라 맞춤화되고, 최적화되고, 그리고 재구성될 수 있음을 이해해야 한다. 본 명세서 전체에서 \"일 실시예\", \"실시예들\" 또는 이와 유사한 언어에 대한 언급은 실시예들과 관련하여 설명 된 특정 특징, 구조 또는 특성이 본 개시의 적어도 하나의 실시예에 포함된다는 것을 의미한다. 따라서, 본 명 세서 전체에서 구문들 \"하나의 실시예에서\", \"일 실시예에서\", \"실시예들\", \"특정 실시예들\", \"다양한 실시예들\" 및 이와 유사한 언어의 출현들은 모두 동일한 실시예를 지칭할 수 있지만, 반드시 그렇지는 않다. 또한, 본 개시의 설명된 특징들, 구조들, 양태들 및/또는 특성들은 하나 이상의 실시예들에서 임의의 적절한 방 식으로 결합될 수 있다. 대응적으로, 특징들이 처음에 특정 조합들에서 작용하는 것으로 청구되더라도, 청구된 조합으로부터 하나 이상의 특징들이 경우에 따라 조합으로부터 생략될 수 있으며, 청구된 조합은 하위 조합 또 는 하위 조합의 변형으로 지시될 수 있다. 특정 실시예들과 관련하여 이점들, 장점들 및 문제들에 대한 해결책들이 본 명세서에 설명되어 있다. 그러나, 이점들, 장점들, 문제들에 대한 해결책들 및 이점, 장점 또는 해결책을 발생시키거나 더욱 두드러지게 할 수 있 는 임의의 요소(들)는 청구항들 중 임의의 청구항 또는 모든 청구항들의 중요하거나, 필수적이거나 또는 본질적 인 특징들 또는 요소들로서 해석되어서는 안 된다. 또한, 명시적으로 필수적이거나 중요한 것으로 설명되지 않 는 한, 본 명세서에 설명된 어떠한 구성요소도 본 개시의 실시에 필요하지 않다. 본 명세서에는 많은 상세들이 포함되어 있지만, 이들은 본 개시의 범위 또는 청구될 수 있는 것의 범위의 제한 들로서 해석되어서는 안 되며, 오히려 본 개시의 특정 구현예들에 특정한 특징들에 대한 설명들로 해석되어야 한다. 본 명세서의 주제들은 본 개시, 본 개시의 실시예들 또는 주제들에 따라 개시된 기타 사항을 제한하기 위한 것이 아닐 수 있다. 본 명세서에서, \"또는\"이라는 용어는 포괄적인 것으로 의도될 수 있으며, 여기서 \"A 또는 B\"는 A 또는 B를 포함 하며 또한 A와 B를 모두 포함한다. 본 명세서에서 사용되는 바와 같이, \"및/또는\"이라는 용어는 실체들의 목록 의 맥락에서 사용될 때 실체들이 단독으로 또는 조합하여 존재하는 것을 가리킨다. 따라서, 예를 들어 \"A, B, C 및/또는 D\"라는 문구에는 A, B, C 및 D가 개별적으로 포함될 뿐만 아니라 A, B, C 및 D의 모든 조합들 및 하 위 조합들도 포함된다. 본 명세서에 사용된 용어는 특정 실시예들을 설명하기 위한 목적일 뿐이며, 본 개시를 한정하기 위한 것이 아니 다. 본 명세서에서 사용된 단수 형태들은 문맥에서 달리 명시되지 않는 한 복수 형태들도 포함하는 것으로 간 주될 수 있다. 이하의 청구항들에서 모든 수단들 또는 단계 플러스 기능 요소들의 대응하는 구조들, 물질들, 행위들 및 등가물 들은 구체적으로 청구된 다른 청구된 요소들과 결합하여 기능을 수행하기 위한 임의의 구조, 물질 또는 행위를 포함하도록 의도될 수 있다. 본 명세서에서 사용되는 바와 같이, \"제어기\", \"프로세서\", \"메모리\", \"신경망\", \"인터페이스\", \"소터\", \"디바 이스\", \"푸싱 메커니즘\", \"푸셔 디바이스들\", \"이미징 센서\", \"통\", \"리셉터클\", \"시스템\", \"회로망\"과 같은 용 어들은 각각 당업자들이 인식하고 이해할 수 있는 비일반적 디바이스 요소들을 가리키며, 본 명세서에서는 35 U.S.C. 112(f)를 호출할 목적의 임시 단어들 또는 임시 용어들로서 사용되지 않다. 식별된 특성 또는 상황들과 관련하여 사용되는 본 명세서에 사용되는 바와 같이, '실질적으로'는 식별된 특성 또는 상황을 측정 가능하게 손상시키지 않을 정도로 충분히 작은 편차 정도를 가리킨다. 허용되는 정확한 편차 정도는 일부 경우들에 있어서는 특정 상황에 따라 달라질 수 있다. 본 명세서에서 사용되는 바와 같이, 복수의 물품들, 구조적 요소들, 구성 요소들, 예시적 분획들 및/또는 물질 들은 편의를 위해 공통 목록으로 제시될 수 있다. 그러나, 이러한 목록들은 목록의 각각의 부재가 개별적으로 별개의 고유한 부재로서 식별되는 것처럼 해석되어야 한다. 따라서, 그러한 목록의 개별 부재는 반대되는 표시 들 없이 공통 그룹에 표시되었다는 이유만으로 동일한 목록의 다른 부재와 사실상 동등한 것으로 해석되어서는안 된다. 달리 정의되지 않는 한, 본 명세서에 사용된 모든 기술 및 과학 용어들(예를 들어, 주기율표 내의 폴리머들 또 는 화학 원소들에 사용되는 약어들)은 현재 개시된 주제가 속하는 기술 분야에서 통상의 기술자에게 일반적으로 이해되는 것과 동일한 의미를 갖는다. 본 명세서에 언급된 모든 출판물들, 특허 출원들, 특허들 및 기타 참고 문헌들은 특정 구절이 인용되지 않는 한 그 전체가 참조에 의해 통합된다. 상충되는 경우, 정의들을 포함한 본 명세서가 우선한다. 또한, 물질들, 방법들 및 예들(예를 들어, 나열된 분획들, 플라스틱들)은 예시일 뿐이며 이를 제한하기 위한 것이 아니다. 본 명세서에 설명되지 않은 범위 내에서, 특정 물질들, 처리 행위들 및 회로들에 관한 많은 상세들은 통상적이 며 컴퓨팅, 전자기기들 및 소프트웨어 기술 분야들의 교과서들 및 기타 출처들에서 찾을 수 있다. 달리 명시되지 않는 한, 명세서 및 청구항들에 사용된 성분들, 반응 조건들 등의 양들을 나타내는 모든 숫자들 은 모든 경우들에서 \"약\"이라는 용어에 의해 수정되는 것으로 이해되어야 한다. 따라서, 상반되는 표시가 없는 한, 본 명세서 및 첨부된 청구항들에 명시된 수치 파라미터들은 현재 개시된 주제에 의해 얻으려는 바람직한 특 성들에 따라 달라질 수 있는 근사값들이다."}
{"patent_id": "10-2023-7030491", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 특정 실시예들에 따라 구성된 소팅 시스템의 개략도를 예시한다. 도 2는 머신 러닝 시스템에서 훈련 스테이지 동안 사용되는 물질 조각들의 제어 세트에 대한 예시적인 표현을 예시한다. 도 3은 본 개시의 특정 실시예들에 따라 구성된 순서도를 예시한다. 도 4는 본 개시의 특정 실시예들에 따라 구성된 단순화된 개략도를 예시한다. 도 5 및 도 6은 화학적 시그니처들의 예들을 예시한다. 도 7은 본 개시의 특정 실시예들에 따라 구성된 순서도를 예시한다. 도 8은 본 개시의 특정 실시예들에 따라 구성된 순서도를 예시한다. 도 9는 본 개시의 특정 실시예들에 따라 구성된 데이터 처리 시스템의 블록도를 예시한다."}
