{"patent_id": "10-2024-0083064", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0000483", "출원번호": "10-2024-0083064", "발명의 명칭": "리플로우 오븐의 청소 여부를 판단하는 시스템 및 방법", "출원인": "일리노이즈 툴 워크스 인코포레이티드", "발명자": "옌 성후"}}
{"patent_id": "10-2024-0083064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "리플로우 오븐(100)의 청소 여부를 판단하는 시스템(200)으로서:리플로우 오븐(100)이 폐쇄된 상태일 때, 리플로우(100) 오븐의 내부의 이미지를 취득할 수 있고, 취득된 이미지를 저장할 수 있도록 구성되어 있는 이미지 취득 디바이스(105);저장된 이미지를 처리하여, 리플로우 오븐(100)의 내부의 청결 상태를 확보하도록 구성되어 있는 처리 유닛(107); 및확보된 리플로우 오븐(100)의 내부의 청결 상태에 기초하여 리플로우 오븐을 청소할 필요가 있는지 여부를 판단하도록 구성되어 있는 판단 유닛(108)을 포함하는 것을 특징으로 하는 시스템(200)."}
{"patent_id": "10-2024-0083064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 리플로우 오븐(100)은 리플로우 오븐 챔버(104)를 포함하고, 상기 리플로우 오븐 챔버는 가공대상물이 리플로우 오븐 챔버(104)를 통하여 이송되고 리플로우 오븐 챔버(104)에서 처리될 수 있게 하도록 구성되어 있는 것인 시스템(200)에 있어서,상기 이미지 취득 디바이스(105)는, 리플로우 오븐(100)의 내부의 이미지를 취득하기 위해 리플로우 오븐(100)의 리플로우 오븐 챔버(104)를 통하여 이송되도록 구성되어 있는 것을 특징으로 하는 시스템(200)."}
{"patent_id": "10-2024-0083064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 이미지 취득 디바이스(105)는 리플로우 오븐(100)의 이송 디바이스(102)에 장착되도록 구성되어 있어, 장착된 이미지 취득 디바이스(105)는 이송 디바이스(102)에 의해 리플로우 오븐(100)의 리플로우오븐 챔버(104)를 통하여 이송될 수 있는 것을 특징으로 하는 시스템(200)."}
{"patent_id": "10-2024-0083064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 리플로우 오븐(100)은 리플로우 오븐 챔버 디바이스(103) 및 리플로우 오븐 챔버(104)를 포함하고, 상기 리플로우 오븐 챔버 디바이스(103)는 리플로우 오븐 챔버(104)에서 가공 대상물을 처리하기 위해 리플로우 오븐 챔버(104)에 가스 유동을 전달할 수 있도록 구성되어 있는 것인 시스템(200)에 있어서,리플로우 오븐(100)의 내부의 이미지는 리플로우 오븐(100)의 리플로우 오븐 챔버 디바이스(103)의 표면의 이미지를 포함하는 것을 특징으로 하는 시스템(200)."}
{"patent_id": "10-2024-0083064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 리플로우 오븐(100)은 가공 대상물에 대한 레일(111)의 폭을 조정할 수 있도록 구성된 레일 조정 디바이스(110)를 포함하는 것인 시스템(200)에 있어서,리플로우 오븐(100)의 내부의 이미지는 레일 조정 디바이스(110)의 이미지를 포함하는 것을 특징으로 하는 시스템(200)."}
{"patent_id": "10-2024-0083064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 이미지 취득 디바이스(105)는:리플로우 오븐(100)의 내부를 조명하도록 구성된 광원(501);상기 광원(501)이 리플로우 오븐(100)의 내부를 조명할 때, 리플로우 오븐(100)의 내부의 이미지를 취득하도록구성된 이미지 취득 유닛(502);공개특허 10-2025-0000483-3-상기 이미지 취득 유닛(502) 및 상기 광원(501)의 작동을 제어하여 상기 이미지 취득 유닛(502)이 리플로우 오븐(100)의 내부의 이미지를 취득하게 하고 상기 이미지 취득 유닛(502)에 의해 취득된 이미지를 저장하도록 구성된 컨트롤러(503); 및상기 광원(501), 상기 이미지 취득 유닛(502) 및 상기 컨트롤러(503)에 전력을 공급하도록 구성된 전원(504)을포함하는 것을 특징으로 하는 시스템(200)."}
{"patent_id": "10-2024-0083064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 이미지 취득 디바이스(105)는 추가적으로:상기 광원(501), 상기 이미지 취득 유닛(502), 상기 컨트롤러(503) 및 상기 전원(504)을 수용하고 리플로우 오븐(100)의 열로부터 절연하도록 구성된 하우징(505); 및상기 하우징(505)을 지지하도록 구성되고, 상기 이미지 취득 디바이스(105)가 이송 디바이스(102)에 의해 리플로우 오븐(100)을 통하여 이송될 수 있게 하기 위해 리플로우 오븐(100)의 이송 디바이스(102)에 장착될 수 있도록 구성되는 장착 구조(506)를 포함하는 것을 특징으로 하는 시스템(200)."}
{"patent_id": "10-2024-0083064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 하우징(505)은:상기 광원(501) 및 상기 이미지 취득 유닛(502)의 위에 배치되고, 리플로우 오븐(100)으로부터 상기 광원(501)및 상기 이미지 취득 유닛(502)으로의 열전달을 차단하도록 구성된 투명 파티션(507)을 포함하는 것을 특징으로하는 시스템(200)."}
{"patent_id": "10-2024-0083064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서, 상기 이미지 취득 디바이스(105)는 통합 디바이스인 것을 특징으로 하는 시스템(200)."}
{"patent_id": "10-2024-0083064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "리플로우 오븐(100)의 청소 여부를 판단하는 방법(300)으로서:리플로우 오븐(100)이 폐쇄된 상태일 때, 리플로우 오븐(100)의 내부의 이미지를 취득하는 단계;취득된 이미지를 저장하는 단계;저장된 이미지를 처리하여, 리플로우 오븐(100)의 내부의 청결 상태를 확보하는 단계; 및확보된 리플로우 오븐(100)의 내부의 청결 상태에 기초하여 리플로우 오븐(100)을 청소할 필요가 있는지 여부를판단하는 단계를 포함하는 것을 특징으로 하는 방법(300)."}
{"patent_id": "10-2024-0083064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서, 리플로우 오븐(100)은 리플로우 오븐 챔버(104)를 포함하고, 상기 리플로우 오븐 챔버는 가공대상물이 리플로우 오븐 챔버(104)를 통하여 이송되고 리플로우 오븐 챔버(104)에서 처리될 수 있게 하도록 구성되어 있는 것인 방법(300)에 있어서, 리플로우 오븐(100)의 내부의 이미지를 취득하는 단계는:이미지 취득 디바이스(105)가 리플로우 오븐(100)의 내부의 이미지를 취득하게 하도록, 이미지 취득 디바이스(105)를 리플로우 오븐(100)의 리플로우 오븐 챔버(104)를 통하여 이송하는 단계를 포함하는 것을 특징으로 하는 방법(300)."}
{"patent_id": "10-2024-0083064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 이미지 취득 디바이스(105)를 리플로우 오븐(100)의 리플로우 오븐 챔버(104)를 통하여 이송하는 단계는:이미지 취득 디바이스(105)를 리플로우 오븐(100)의 이송 디바이스(102)에 장착하는 단계, 및 장착된 이미지 취득 디바이스(105)를 이송 디바이스(102)에 의해 리플로우 오븐(100)의 리플로우 오븐 챔버(104)를 통하여 이송공개특허 10-2025-0000483-4-하는 단계를 포함하는 것을 특징으로 하는 방법(300)."}
{"patent_id": "10-2024-0083064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제10항에 있어서, 리플로우 오븐(100)은 리플로우 오븐 챔버 디바이스(103) 및 리플로우 오븐 챔버(104)를 포함하고, 상기 리플로우 오븐 챔버 디바이스(103)는 리플로우 오븐 챔버(104)에서 가공 대상물을 처리하기 위해 리플로우 오븐 챔버(104)에 가스 유동을 전달할 수 있도록 구성되어 있는 것인 방법(300)에 있어서, 리플로우 오븐(100)의 내부의 이미지를 취득하는 단계는:리플로우 오븐(100)의 리플로우 오븐 챔버 디바이스(103)의 표면의 이미지를 취득하는 단계를 포함하는 것을 특징으로 하는 방법(300)."}
{"patent_id": "10-2024-0083064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제10항에 있어서, 리플로우 오븐(100)은 가공 대상물에 대한 레일(111)의 폭을 조정할 수 있도록 구성된 레일조정 디바이스(110)를 포함하는 것인 방법(300)에 있어서, 리플로우 오븐(100)의 내부의 이미지를 취득하는 단계는:레일 조정 디바이스(110)의 이미지를 취득하는 단계를 포함하는 것을 특징으로 하는 방법(300)."}
{"patent_id": "10-2024-0083064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제10항에 있어서, 저장된 이미지를 처리하여, 리플로우 오븐(100)의 내부의 청결 상태를 확보하는 단계는:리플로우 오븐(100)의 내부의 오염 물질의 색상 및 면적을 확보하기 위해 상기 저장된 이미지를 처리하는 단계를 포함하는 것을 특징으로 하는 방법(300)."}
{"patent_id": "10-2024-0083064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제10항에 있어서, 리플로우 오븐(100)을 청소할 필요가 있는지 여부를 판단하는 단계는:인공 지능 트레이닝을 통해 리플로우 오븐(100)을 청소할 필요가 있는지 여부를 판단하는 단계를 포함하는 것을특징으로 하는 방법(300)."}
{"patent_id": "10-2024-0083064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제10항에 있어서, 리플로우 오븐(100)을 청소할 필요가 있는지 여부를 판단하는 단계는:미리 정해놓은 기간 내에 리플로우 오븐(100)을 청소할 필요가 있는가를 판단하는 단계; 및리플로우 오븐(100)을 즉시 청소할 필요가 있는가를 판단하는 단계를 포함하는 것을 특징으로 하는 방법(300)."}
{"patent_id": "10-2024-0083064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제10항에 있어서, 확보된 리플로우 오븐(100)의 내부의 청결 상태에 기초하여 리플로우 오븐(100)을 청소할 필요가 있는지 여부를 판단하는 단계는:확보된 리플로우 오븐(100)의 내부의 청결 상태와 리플로우 오븐(100)의 내부의 기준 청결 상태를 비교하여 리플로우 오븐(100)을 청소할 필요가 있는지 여부를 판단하는 단계를 포함하는 것을 특징으로 하는 방법(300)."}
{"patent_id": "10-2024-0083064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "리플로우 오븐(100)으로서:제1항 내지 제9항에 따른 리플로우 오븐(100)의 청소 여부를 판단하는 시스템(200)을 포함하는 것을 특징으로 하는 리플로우 오븐(100)."}
{"patent_id": "10-2024-0083064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제10항 내지 제18항에 따른 방법(300)을 수행하기 위한 리플로우 오븐(100)."}
{"patent_id": "10-2024-0083064", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본원은 리플로우 오븐의 청소 여부를 판단하는 시스템 및 방법을 제공한다. 상기 시스템은 이미지 취득 디바이 스, 처리 유닛 및 판단 유닛을 포함한다. 상기 이미지 취득 디바이스는, 리플로우 오븐이 폐쇄된 상태일 때, 리 플로우 오븐의 내부의 이미지를 취득하고, 취득된 이미지를 저장한다. 상기 이미지 취득 디바이스는, 리플로우 (뒷면에 계속)"}
{"patent_id": "10-2024-0083064", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본원은 리플로우 오븐에 관한 것이고, 특히 리플로우 오븐의 청소 여부를 판단하는 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2024-0083064", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인쇄 회로 기판을 제조하는 동안, 전자 소자는 일반적으로 \"리플로우 솔더링\"으로 알려진 프로세스를 사용함으 로써 회로 기판에 장착된다. 통상적인 리플로우 솔더링 프로세스에서, 솔더 페이스트(예를 들어, 주석 페이스 트)가 회로 기판의 선택된 영역에 성막되고, 성막된 솔더 페이스트에는 하나 이상의 전자 소자의 와이어 삽입된 다. 그 후에, 회로 기판은 리플로우 오븐을 통과한다. 리플로우 오븐에서, 솔더 페이스트는 리플로우 오븐의 허스(hearth)의 고온 영역에서 리플로우(즉, 용융 또는 리플로우 온도로 가열)되고, 그 후에 전자 소자의 와이 어를 회로 기판에 전기적으로 및 기계적으로 연결하기 위해 허스의 냉각 구역에서 냉각된다. 본원에 사용된 바 와 같이, 용어 \"회로 기판\" 또는 \"인쇄 회로 기판(PCB)\"은, 예를 들어 웨이퍼 기판을 포함하는 임의의 타입의 전자 소자의 기판 어셈블리를 포함한다. 리플로우 오븐에서, 공기 또는 실질적으로 불황성인 가스(예컨대, 질 소)가 일반적으로 작동 가스로서 사용되고, 다른 프로세스 요건을 갖는 회로 기판들에는 다른 작동 가스가 사용 된다. 리플로우 오븐의 허스는 작동 가스로 채워져 있고, 회로 기판은 이송 디바이스에 의해 허스를 통과하게 이송되는 동안 작동 가스에서 솔더링된다."}
{"patent_id": "10-2024-0083064", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "주석 페이스트는 솔더뿐만 아니라 솔더의 젖음을 촉진하고 우수한 솔더 조인트를 제공하는 솔더링 플럭스도 또 한 포함한다. 용제 및 촉매와 같은 다른 첨가제도 또한 주석 페이스트에 포함될 수 있다. 주석 페이스트가 회 로 기판에 인쇄된 후, 회로 기판은 리플로우 오븐의 허스의 복수의 고온 구역을 통과하도록 컨베이어에서 이송 된다. 고온 구역에 있어서의 열은 주석 페이스트를 용융시키고, 주로 솔더링 플럭스를 포함하는 휘발성 유기 화합물(VOCs)을 함유하는 유기 화합물이 증기로 기화되어, \"오염 물질\"을 형성한다. 이러한 오염 물질은 고온 구역에서 작동 가스와 혼합되어 폐가스를 형성한다. 이러한 오염 물질이 리플로우 오븐의 허스에 축적됨으로 인해 몇 가지 문제가 야기될 수 있다. 예를 들어, 회로 기판이 고온 구역으로부터 냉각 구역으로 이송될 때, 오염 물질도 또한 냉각 구역으로 유동하고, 오염 물질은 냉각 구역에서 냉각된 후, 액체 및/또는 고체로 응결되 어 회로 기판 상에 적하될 것이며, 이에 따라 회로 기판을 오염시킬 것이다. 그 결과, 후속 청소 단계가 수행 되어야 한다. 또한, 응결물이 또한 후속 회로 기판에 떨어질 수 있고; 그 결과 회로 기판 상의 소자들이 손상 될 수 있고, 또는 오염된 회로 기판은 후속 단계들에서 청소되어야 한다. 본원의 발명자는, 종래 기술에서는 리플로우 오븐이 사전 계획된 유지 관리를 통해 청소된다는 점을 발견하였다. 그러나, 사전 계획된 유지 관리는 너무 이르거나 너무 늦을 수 있고, 그 결과 바람직하지 않은 가 동 중지 시간을 초래할 수 있으며, 이에 따라 생산 효율이 저하될 수 있다."}
{"patent_id": "10-2024-0083064", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 문제점들을 해결하기 위해, 본원은, 리플로우 오븐이 폐쇄된 상태일 때, 리플로우 오븐의 내부의 청결 상태를 판단하기 위해 리플로우 오븐의 내부의 이미지를 취득한 후, 청결 상태에 기초하여 리플로우 오븐을 청 소할 필요가 있는지 여부를 판단하는, 리플로우 오븐의 청소 여부를 판단하는 시스템 및 방법을 제공한다. 본 원에 따르면, 리플로우 오븐을 합리적인 시간에 청소하고 유지 관리할 것을 사용자에게 메시지로 표시할 수 있 고, 이에 따라 생산 효율이 향상되며 불필요한 가동 중지 시간이 줄어든다. 본원의 제1 양태에 따르면, 본원은 리플로우 오븐의 청소 여부를 판단하는 시스템을 제공한다. 상기 시스템은 이미지 취득 디바이스, 처리 유닛 및 판단 유닛을 포함한다. 상기 이미지 취득 디바이스는, 리플로우 오븐이 폐쇄된 상태일 때, 리플로우 오븐의 내부의 이미지를 취득할 수 있고, 취득된 이미지를 저장할 수 있도록 구성 되어 있다. 상기 처리 유닛은, 저장된 이미지를 처리하여, 리플로우 오븐의 내부의 청결 상태를 확보하도록 구 성되어 있다. 상기 판단 유닛은, 확보된 리플로우 오븐의 내부의 청결 상태에 기초하여 리플로우 오븐을 청소 할 필요가 있는지 여부를 판단하도록 구성되어 있다. 본원의 제1 양태에 따르면, 상기 리플로우 오븐은, 가공 대상물이 리플로우 오븐 챔버를 통하여 이송되고 리플 로우 오븐 챔버에서 처리될 수 있게 하도록 구성된 리플로우 오븐 챔버를 포함한다. 상기 이미지 취득 디바이 스는, 리플로우 오븐의 내부의 이미지를 취득하기 위해 리플로우 오븐의 리플로우 오븐 챔버를 통하여 이송되도 록 구성되어 있다. 본원의 제1 양태에 따르면, 상기 이미지 취득 디바이스는 리플로우 오븐의 이송 디바이스에 장착되도록 구성되 어 있어, 장착된 이미지 취득 디바이스는 이송 디바이스에 의해 리플로우 오븐의 리플로우 오븐 챔버를 통하여 이송될 수 있다. 본원의 제1 양태에 따르면, 리플로우 오븐은 리플로우 오븐 챔버 디바이스와 리플로우 오븐 챔버를 포함한다. 상기 리플로우 오븐 챔버 디바이스는 리플로우 오븐 챔버에서 가공 대상물을 처리하기 위해 리플로우 오븐 챔버 에 가스 유동을 전달할 수 있도록 구성된다. 리플로우 오븐의 내부의 이미지는 리플로우 오븐의 리플로우 오븐 챔버 디바이스의 표면의 이미지를 포함한다. 본원의 제1 양태에 따르면, 리플로우 오븐은 레일 조정 디바이스를 포함한다. 상기 레일 조정 디바이스는 가공 대상물에 대한 레일의 폭을 조정할 수 있도록 구성된다. 리플로우 오븐의 내부의 이미지는 레일 조정 디바이스 의 이미지를 포함한다. 본원의 제1 양태에 따르면, 상기 이미지 취득 디바이스는 광원, 이미지 취득 유닛, 컨트롤러 및 전원을 포함한 다. 상기 광원은 리플로우 오븐의 내부를 조명하도록 구성된다. 상기 이미지 취득 유닛은, 상기 광원이 리플 로우 오븐의 내부를 조명할 때, 리플로우 오븐의 내부의 이미지를 취득하도록 구성된다. 상기 컨트롤러는, 상 기 이미지 취득 유닛 및 상기 광원의 작동을 제어하여 상기 이미지 취득 유닛이 리플로우 오븐의 내부의 이미지 를 취득하게 하고 상기 이미지 취득 유닛에 의해 취득된 이미지를 저장하도록 구성된다. 상기 전원은 상기 광 원, 상기 이미지 취득 유닛 및 상기 컨트롤러에 전력을 공급하도록 구성된다. 본원의 제1 양태에 따르면, 상기 이미지 취득 디바이스는 추가적으로, 하우징과 장착 구조를 포함한다. 상기 하우징은 상기 광원, 상기 이미지 취득 유닛, 상기 컨트롤러 및 상기 전원을 수용하고 리플로우 오븐의 열로부 터 절연하도록 구성된다. 상기 장착 구조는 상기 하우징을 지지하도록 구성되고, 상기 이미지 취득 디바이스가 상기 이송 디바이스에 의해 리플로우 오븐을 통하여 이송될 수 있게 하기 위해 리플로우 오븐의 이송 디바이스 에 장착될 수 있도록 구성된다. 본원의 제1 양태에 따르면, 상기 하우징은 투명 파티션을 포함한다. 상기 투명 파티션은 상기 광원 및 상기 이 미지 취득 유닛의 위에 배치되고, 리플로우 오븐으로부터 상기 광원 및 상기 이미지 취득 유닛으로의 열전달을 차단하도록 구성된다. 본원의 제1 양태에 따르면, 상기 이미지 취득 디바이스는 통합 디바이스이다. 본원의 제2 양태에 따르면, 본원은 리플로우 오븐의 청소 여부를 판단하는 방법을 제공한다. 상기 방법은: 리 플로우 오븐이 폐쇄된 상태일 때, 리플로우 오븐의 내부의 이미지를 취득하는 단계; 취득된 이미지를 저장하는 단계; 저장된 이미지를 처리하여, 리플로우 오븐의 내부의 청결 상태를 확보하는 단계; 및 확보된 리플로우 오 븐의 내부의 청결 상태에 기초하여 리플로우 오븐을 청소할 필요가 있는지 여부를 판단하는 단계를 포함한다. 본원의 제2 양태에 따르면, 리플로우 오븐은 리플로우 오븐 챔버를 포함한다. 상기 리플로우 오븐 챔버는, 가 공 대상물이 리플로우 오븐 챔버를 통하여 이송되고 리플로우 오븐 챔버에서 처리될 수 있게 하도록 구성된다. 리플로우 오븐의 내부의 이미지를 취득하는 단계는: 이미지 취득 디바이스가 리플로우 오븐의 내부의 이미지를 취득하게 하도록, 이미지 취득 디바이스를 리플로우 오븐의 리플로우 오븐 챔버를 통하여 이송하는 단계를 포함 한다. 본원의 제2 양태에 따르면, 이미지 취득 디바이스를 리플로우 오븐의 리플로우 오븐 챔버를 통하여 이송하는 단 계는, 이미지 취득 디바이스를 리플로우 오븐의 이송 디바이스에 장착하는 단계, 및 장착된 이미지 취득 디바이 스를 이송 디바이스에 의해 리플로우 오븐의 리플로우 오븐 챔버를 통하여 이송하는 단계를 포함한다. 본원의 제2 양태에 따르면, 리플로우 오븐은 리플로우 오븐 챔버 디바이스와 리플로우 오븐 챔버를 포함한다. 상기 리플로우 오븐 챔버 디바이스는 리플로우 오븐 챔버에서 가공 대상물을 처리하기 위해 리플로우 오븐 챔버 에 가스 유동을 전달할 수 있도록 구성된다. 리플로우 오븐의 내부의 이미지를 취득하는 단계는: 리플로우 오 븐의 리플로우 오븐 챔버 디바이스의 표면의 이미지를 취득하는 단계를 포함한다. 본원의 제2 양태에 따르면, 리플로우 오븐은 레일 조정 디바이스를 포함한다. 상기 레일 조정 디바이스는 가공 대상물에 대한 레일의 폭을 조정할 수 있도록 구성된다. 리플로우 오븐의 내부의 이미지를 취득하는 단계는:레일 조정 디바이스의 이미지를 취득하는 단계를 포함한다. 본원의 제2 양태에 따르면, 저장된 이미지를 처리하여 리플로우 오븐의 내부의 청결 상태를 확보하는 단계는: 리플로우 오븐의 내부의 오염 물질의 색상 및 면적을 확보하기 위해 상기 저장된 이미지를 처리하는 단계를 포 함한다. 본원의 제2 양태에 따르면, 리플로우 오븐을 청소할 필요가 있는지 여부를 판단하는 단계는: 인공 지능 트레이 닝을 통해 리플로우 오븐을 청소할 필요가 있는지 여부를 판단하는 단계를 포함한다. 본원의 제2 양태에 따르면, 리플로우 오븐을 청소할 필요가 있는지 여부를 판단하는 단계는: 미리 정해놓은 기 간 내에 리플로우 오븐을 청소할 필요가 있는가를 판단하는 것과, 리플로우 오븐을 즉시 청소할 필요가 있는가 를 판단하는 것을 포함한다. 본원의 제2 양태에 따르면, 확보된 리플로우 오븐의 내부의 청결 상태에 기초하여 리플로우 오븐을 청소할 필요 가 있는지 여부를 판단하는 단계는: 확보된 리플로우 오븐의 내부의 청결 상태와 리플로우 오븐의 내부의 기준 청결 상태를 비교하여 리플로우 오븐을 청소할 필요가 있는지 여부를 판단하는 것을 포함한다. 본원의 제3 양태에 따르면, 본원은 전술한 리플로우 오븐의 청소 여부를 판단하는 시스템을 포함하는 리플로우 오븐을 제공한다. 본원의 제4 양태에 따르면, 본원은 전술한 방법을 구현하기 위한 리플로우 오븐을 제공한다."}
{"patent_id": "10-2024-0083064", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본원의 다양한 특정 구현예들이, 본 명세서의 일부를 구성하는 첨부 도면을 참조하여, 이하에 기술된다. \"전방\", \"후방\", \"상측\", \"하측\", \"좌측\" 및 \"우측\" 등과 같이 방향을 나타내는 용어들이 본원의 다양한 실시예 에서의 구조적 부분 및 요소를 기술하기 위해 본원에서 사용되지만, 이들 용어는 설명의 편의를 위해서만 본원 에서 사용되고 첨부 도면에 도시된 예시적인 방향에 기초하여 결정되는 것으로 이해되어야 한다. 본원에 개시 된 실시형태들에서의 배치 구성은 다양한 방향으로 이루어질 수 있으므로, 방향을 나타내는 이러한 용어들은 단 지 예시적인 것이고 제한하는 것으로 간주되어서는 안 된다. 도 1a는 본원에 따른 리플로우 오븐의 사시도이고; 도 1b는 하우징이 제거되어 있는 도 1a에 도시된 리플로우 오븐의 사시도이며; 도 1c는 도 1b의 부분 확대도이고; 도 1d는 개방 상태의 도 1b에 도시된 리 플로우 오븐의 사시도이며; 도 1e는 도 1d의 부분 확대도이고; 도 1f는 도 1b의 좌측면도이며; 도 1g는 도 1f의 부분 확대도로서, 리플로우 오븐의 다양한 구성요소들과 이들 다양한 구성요소들 사이의 관계를 명확 하게 보여준다. 도 1a에 도시된 바와 같이, 리플로우 오븐은 하우징을 포함하고, 리플로우 오븐의 다양한 구성 요소들이 하우징 내에 배치된다. 도 1b 및 도 1c에 도시된 바와 같이, 리플로우 오븐은 이를 통과하 는 가공 대상물(예컨대, 회로 기판)(도시되어 있지 않음)에 고온 처리를 수행한 후 냉각 처리를 수행하도록 구 성된 리플로우 오븐 챔버를 포함한다. 리플로우 오븐 챔버는 수 개의 고온 구역과 수 개의 냉 각 구역에 걸쳐 있다. 리플로우 오븐은 추가적으로, 리플로우 오븐 챔버의 위에 및/또는 아래 에 배치되는 수 개의 리플로우 오븐 챔버 디바이스를 포함한다. 각각의 리플로우 오븐 챔버 디바이스 는 리플로우 오븐 챔버에서 가공 대상물을 처리하기 위해 리플로우 오븐 챔버에 가스 유동을 전 달하도록 구성된다. 고온 구역의 리플로우 오븐 챔버 디바이스는 고온 가스 유동을 리플로우 오븐 챔버에 전달하여 가공 대상물에 고온 처리를 수행한다. 냉각 구역의 리플로우 오븐 챔버 디바이스 는 저온 가스 유동 또는 정상 온도의 가스 유동(예컨대, 외부 환경의 공기 유동)을 리플로우 오븐 챔버 에 전달하여 가공 대상물을 냉각한다. 도 1b-도 1g에 도시된 바와 같이, 리플로우 오븐은 추가적으로 레일, 레일 조정 디바이스 및 이 송 디바이스를 포함한다. 레일은 리플로우 오븐의 프레임에 고정적으로 장착되고 리플로 우 오븐 챔버를 관통한다. 레일 조정 디바이스는 리플로우 오븐 챔버 내에 배치된다. 각각의 레일 조정 디바이스는 한 쌍의 평행한 레일에 걸쳐 있고, 한 쌍의 레일 상에 장착된다. 각각의 레일 조정 디바이스는 레일 조정 디바이스가 장착되는 한 쌍의 레일의 폭을 조정하도록 구성되어 있 어, 조정된 레일은 다양한 치수의 가공 대상물의 이송에 적응할 수 있다. 수 개의 레일 조정 디바이스 가 리플로우 오븐 챔버 내에 배치된다. 각각의 레일 조정 디바이스는 고온 구역들 사이, 냉각 구역들 사이, 또는 고온 구역과 냉각 구역 사이에 위치된다. 본 실시형태에서, 리플로우 오븐은 두 쌍의 레일로 구성된 이중 레인(double lane)을 갖는다. 이중 레인의 각각의 레인은 동일 한 구조로 이루어져 있다. 다른 실시형태에서, 리플로우 오븐은 단일 레인을 갖는다. 그 밖의 실시형태 에서, 리플로우 오븐은 상이한 그리고 적절한 수의 레인을 갖는다. 이송 디바이스는 레일에 장착되고, 레일을 따라 이동할 수 있다. 가공 대상물이 처리될 수 있 도록, 이송 디바이스는 리플로우 오븐의 리플로우 오븐 챔버를 통해 가공 대상물을 이송하도록 구성된다. 이미지 취득 디바이스가 리플로우 오븐의 이송 디바이스에 장착될 수 있다. 장착된 이미지 취득 디바이스는, 리플로우 오븐의 내부의 이미지를 취득하도록, 이송 디바이스에 의해 리플로우 오븐의 리플로우 오븐 챔버를 통하여 이송될 수 있다. 이미지 취득 디바이스는 통합 디바이스이다. 도 1e에 도시된 바와 같이, 상위 블록이 이송 디바이스 및 레일의 확대도를 도시한다. 이송 디바이스는 이송 벨트, 기어 및 수 개의 핀 어셈블리를 포함한다. 각각 의 핀 어셈블리는 수 개의 핀을 포함한다. 이송 벨트는 기어와 맞물리고 부분적으로 레일 에 배치된다. 핀 어셈블리는 이송 벨트에 고정된다. 기어는 이송 구동 기구(도시되어 있 지 않음)에 의해 회전하도록, 이송 벨트를 레일을 따라 이동시키도록, 그리고 이에 따라 핀 어셈블리 를 레일을 따라 이동시키도록 구동된다. 그 밖의 실시형태에서, 이송 디바이스는 다른 적절한 구조를 포함한다. 일 실시형태에서는, 도 1e-도 1g에 도시된 바와 같이, 이미지 취득 디바이스의 장착 구조가 이송 디 바이스의 핀에 장착되어, 이미지 취득 디바이스는 이송 디바이스에 의해 리플로우 오븐 의 리플로우 오븐 챔버를 통하여 이송될 수 있다. 장착 구조는 이송 디바이스의 수 개의 핀 상에 배치된다. 이송 디바이스는, 레일을 따라 이동할 때, 핀을 이동시킬 수 있고, 그리고 이때 핀은 이미지 취득 디바이스를 장착 구조를 통해 이동시킨다. 그 밖의 실시형태에서, 이미지 취득 디바이스는, 이송 디바이스에 의해 리플로우 오븐을 통하여 이송되도록, 다른 적절 한 방법에 의해 이송 디바이스에 장착된다. 도 1b-도 1g는 단지 이중 레인 중 어느 한 레인 상의 하나의 이미지 취득 디바이스만을 도시한다. 작동시, 이중 레인의 각각의 레인 상의 이송 디바이스에 이미 지 취득 디바이스가 마련되고, 이미지 취득 디바이스는 리플로우 오븐의 내부의 이미지를 취득 하기 위해 레인을 따라 리플로우 오븐을 통하여 이송된다. 도 1b 및 도 1f에 도시된 바와 같이, 이미지 취득 디바이스는, 리플로우 오븐이 폐쇄된 상태일 때, 리플로우 오븐의 내부의 이미지를 취득할 수 있고 취득된 이미지를 저장할 수 있도록 구성된다. 리플로우 오븐이 폐쇄된 상태일 때, 이미지 취득 디바이스는, 리플로우 오븐의 내부의 이미지를 취득하도 록, 이송 디바이스에 의해 리플로우 오븐의 리플로우 오븐 챔버를 통하여 이송된다. 일 실시형 태에서, 리플로우 오븐이 폐쇄된 상태일 때, 리플로우 오븐은 정상 작동의 비생산 상태이고, 이 비생 산 상태 동안, 리플로우 오븐을 통과하는 가공 대상물이 없으며, 이미지 취득 디바이스는 리플로우 오븐의 내부의 이미지를 취득하기 위해 리플로우 오븐의 리플로우 오븐 챔버를 통하여 이송된다. 다른 실시형태에서, 리플로우 오븐이 폐쇄된 상태일 때, 리플로우 오븐은 정상 작동 중이 고, 이 정상 작동 동안, 가공 대상물이 처리되기 위해 리플로우 오븐을 통과하며, 이미지 취득 디바이스 는 또한 리플로우 오븐의 내부의 이미지를 취득하기 위해 리플로우 오븐의 리플로우 오븐 챔버 를 통하여 이송된다. 이미지 취득 디바이스에 의해 취득된 리플로우 오븐의 내부의 이미지는, 리플로우 오븐 챔버 디바이스의 표면의 이미지, 레일 조정 디바이스의 이미지 등을 포함한다. 일 실 시형태에서, 리플로우 오븐 챔버 디바이스의 표면의 이미지는, 상위 리플로우 오븐 챔버 디바이스의 바닥면의 이미지(도 1d-도 1g 참조)이다. 이미지 취득 디바이스는, 상위 리플로우 오븐 챔버 디바이 스의 바닥면의 이미지 및/또는 레일 조정 디바이스의 이미지를 획득하기 위해, 리플로우 오븐 을 통하여 상위 리플로우 오븐 챔버 디바이스를 향해 이동하도록 구성된다. 이미지 취득 디바이스는 2개의 이미지 취득 유닛(도 5b-도 5c 참조)을 포함하여, 이미지 취득 디바이 스는 리플로우 오븐을 통하여 이송될 때 리플로우 오븐의 전체 폭 방향에 있어서의 내부 구성요 소들의 이미지를 취득할 수 있다. 도 1g에 도시된 바와 같이, 리플로우 오븐의 폭 방향에 있어서의 이미 지 취득 유닛의 이미지 취득 시야가 점선으로 도시되어 있다. 도 1c는 리플로우 오븐의 길이 방향에 있어서의 이미지 취득 유닛의 이미지 취득 시야와 리플로우 오븐의 폭 방향에 있어서의 이미 지 취득 유닛의 이미지 취득 시야를 도시한다. 다른 실시형태들에서, 이미지 취득 디바이스는 리플 로우 오븐의 내부의 이미지를 취득하기 위해 상이한 그리고 적절한 수의 이미지 취득 유닛을 포함한 다. 이미지 취득 디바이스는, 리플로우 오븐의 다른 구조를 변경하는 일 없이, 이송 디바이스 에 장착 가능하도록 그리고 리플로우 오븐을 통과하도록 구성된다. 도 1g에 도시된 바와 같이, 이미지 취 득 디바이스의 높이는 리플로우 오븐 챔버의 높이보다 작도록 설정된다. 이미지 취득 디바이스(10 5)는 이송 디바이스에 장착될 때, 리플로우 오븐 챔버의 대략 중간 또는 하부 위치에 위치되어, 이미 지 취득 디바이스는 리플로우 오븐 챔버를 통해 원활하게 이송될 수 있고 리플로우 오븐 내의 구성요소들의 이미지를 취득할 수 있다. 도 2a-도 2b에 도시된 바와 같이, 이미지 취득 디바이스에 의해 저장된 이미지(예컨대, 이미지 데이터)가 처리 디바이스의 처리 유닛에 출력될 수 있고, 처리 유닛은 저장된 이미지를 처리하여 리플로우 오븐의 내부의 청결 상태를 확보할 수 있으며, 리플로우 오븐의 내부의 청결 상태를 처리 디바이스 의 판단 유닛에 출력할 수 있다. 판단 유닛은 리플로우 오븐의 내부의 청결 상태에 기초 하여 리플로우 오븐을 청소할 필요가 있는지 여부를 판단할 수 있다. 또한, 리플로우 오븐을 청소할 필요가 있다고 판단될 때, 리플로우 오븐을 청소할 필요가 있다는 표시, 예컨대 리플로우 오븐을 미 리 정해놓은 기간 내에 청소할 필요가 있다는 표시 또는 리플로우 오븐을 즉시 청소할 필요가 있다는 표시 를 표시 디바이스가 사용자에게 보내기 위해, 판단 유닛은 제어 신호를 표시 디바이스에 출력할 수 있다. 본원에 따르면, 리플로우 오븐이 폐쇄된 상태일 때, 리플로우 오븐의 내부의 이미지를 취 득하고, 리플로우 오븐을 청소할 필요가 있는지 여부를 판단하기 위해 상기 이미지를 처리하여, 적절한 시 기에 리플로우 오븐을 청소할 것을 사용자에게 지시한다. 따라서, 본원에 따르면, 리플로우 오븐의 생산 효율이 향상될 수 있고, 리플로우 오븐의 불필요한 가동 중지 시간이 줄어들 수 있다. 회로 기판이 리플로우 오븐의 고온 구역을 통과할 때, 고온 구역의 열이 회로 기판 상의 주석 페이스트를 용융 시킨다. 이러한 경우에, 주로 솔더링 플럭스를 포함하는 휘발성 유기 화합물(VOCs)을 함유하는 유기 화합물이증기로 기화되어, \"오염 물질\"을 형성한다. 회로 기판이 고온 구역으로부터 냉각 구역으로 이송될 때, 오염 물 질도 또한 냉각 구역으로 유동한다. 오염 물질은 냉각 구역에서 냉각된 후에 액체 및/또는 고체로 응결되어 회 로 기판 상에 적하되고, 이에 따라 회로 기판을 오염시킨다. 오염 물질은 냉각 구역에 있어서의 레일 조정 디 바이스의 표면 및 상위 리플로우 오븐 챔버 디바이스의 바닥면 상에 응결될 수 있다. 상위 리 플로우 오븐 챔버 디바이스 및 레일 조정 디바이스의 표면 상에 응결되어 있는 오염 물질은, 소정량 축적된 경우에, 이들 구성요소 아래의 회로 기판 상에 적하될 수 있고, 이에 따라 회로 기판을 오염시킨다. 본 원에 따르면, 리플로우 오븐 챔버 디바이스의 표면의 이미지 및/또는 레일 조정 디바이스의 이미지에 기초하여, 리플로우 오븐의 내부의 청결 상태를 획득한 후, 리플로우 오븐을 청소할 필요가 있는지 여부를 판단한다. 다른 실시형태들에서, 오염 물질은 냉각 구역에 있어서의 리플로우 오븐 내의 다른 구 조에 응결된다. 본원에 따르면, 리플로우 오븐을 청소할 필요가 있는지 여부를 판단하기 위해, 리플로우 오븐 내의 다른 구조의 이미지를 추가적으로 획득한다. 따라서, 본원에 따르면, 리플로우 오븐은 적 절한 시기에 청소될 수 있고, 오염 물질[예컨대, 상위 리플로우 오븐 챔버 디바이스 및 레일 조정 디바이 스 상에 축적된 오염 물질]은 회로 기판 상에 적하되어 회로 기판을 오염시키는 것이 방지되며, 이에 따라 리플로우 오븐의 생산성이 향상되고 불필요한 가동 중지 시간이 줄어든다. 또한, 레일 조정 디바이스 상에 축적된 오염 물질은 추가적으로, 레일 조정 디바이스의 작동 불능, 예를 들어 레일의 폭 조정 불능을 야기하여, 이때 레일 조정 디바이스를 유지 관리하도록, 예컨대 레일 조정 디바이스를 수리 또는 교체하도록, 리플로우 오븐을 셧다운할 필요가 있게 된다. 따라서, 레일 조정 디바이스의 이미지를 획득하고, 이 이미지에 기초하여 리플로우 오븐을 청소할 필요가 있는지 여부를 판단함으로써, 본원에 따르면, 레일 조정 디바이스는 그 정상적인 작동을 보장하도록 적절한 시기에 청소될 수 있으며, 이로써 리플로우 오븐의 불필요한 가동 중지 시간이 줄어든다. 도 2a는 본원의 일 실시형태에 따른 리플로우 오븐의 청소 여부를 판단하는 시스템의 블록도이고, 도 2b는 본원의 다른 실시형태에 따른 리플로우 오븐의 청소 여부를 판단하는 시스템의 블록도이다. 도 2a에 도시된 바와 같이, 일 실시형태에서, 리플로우 오븐의 청소 여부를 판단하는 시스템은 이미 지 취득 디바이스 및 처리 디바이스를 포함한다. 처리 디바이스는 처리 유닛 및 판단 유 닛을 포함한다. 이미지 취득 디바이스는, 리플로우 오븐이 폐쇄된 상태일 때, 리플로우 오븐의 내부의 이미지를 취득할 수 있고, 취득된 이미지를 저장할 수 있도록 구성되어 있다. 이미지 취득 디바이스는 연결 라인 을 통해 처리 디바이스에 연결되고, 저장된 취득 이미지를 연결 라인(예컨대, 데이터 라인)을 통해 처리 디바이스에 출력한다. 처리 디바이스에서, 처리 유닛은, 저장된 이미지를 처리하여 리플로우 오븐의 내부의 청결 상태를 확보하도록 구성되고, 판단 유닛은, 확보된 리플로우 오븐(10 0)의 내부의 청결 상태에 기초하여 리플로우 오븐을 청소할 필요가 있는지 여부를 판단하도록 구성된다. 리플로우 오븐을 청소할 필요가 있는지 여부를 판단하는 것은, 미리 정해놓은 기간 내에 리플로우 오븐 을 청소할 필요가 있는가를 판단하는 것, 또는 리플로우 오븐을 즉시 청소할 필요가 있는가를 판단하 는 것을 포함한다. 일 실시형태에서, 미리 정해놓은 기간은 1주 또는 3일을 포함한다. 다른 실시형태들에서, 미리 정해놓은 기간은 상이한 그리고 적절한 기간을 포함한다. 작동시, 리플로우 오븐이 폐쇄된 상태일 때, 리플로우 오븐의 내부의 이미지를 취득 및 저장하도록 이미지 취득 디바이스가 리플로우 오븐 을 통하여 이송되고, 처리 디바이스는 상기 이미지에 기초하여 미리 정해놓은 기간 내에 리플로우 오 븐을 청소할 필요가 있는지 여부를 판단한다. 미리 정해놓은 기간 내에 리플로우 오븐을 청소할 필 요가 있다고 판단되면, 리플로우 오븐의 내부의 이미지를 다시 취득 및 저장하도록 이미지 취득 디바이스 가 리플로우 오븐을 통하여 이송되고, 그 후에 처리 디바이스는 상기 이미지에 기초하여 리플로 우 오븐을 즉시 청소할 필요가 있는지 여부를 판단한다. 리플로우 오븐을 즉시 청소할 필요가 있다 고 판단되면, 사용자에게 리플로우 오븐을 청소하라는 메시지를 표시한다. 판단 유닛은, 확보된 리플로우 오븐의 내부의 청결 상태에 기초하여 리플로우 오븐을 청소할 필요가 있는지 여부를 인공 지능 트레이닝을 통해 판단하도록 구성되어 있다. 일 실시형태에서, 사용자에 의해 리플로 우 오븐 상에서 수행되는 실제 작동시, 리플로우 오븐을 청소할 필요가 있을 때, 리플로우 오븐(10 0)의 내부의 복수의 이미지를 획득하고, 이들 이미지를, 리플로우 오븐을 청소할 필요가 있음을 나타내는 참조 이미지로서 사용한다. 이미지 데이터는 인공 지능을 통해 트레이닝되어, 판단 유닛은, 이미지 취득 디바이스에 의해 취득된 리플로우 오븐의 내부의 이미지들에 기초하여[예컨대, 추가적으로 리플로우 오븐의 내부의 청결 상태에 기초하여] 리플로우 오븐을 청소할 필요가 있는지 여부를 판단할 수있다. 일 실시형태에서, 판단 유닛은, 확보된 리플로우 오븐의 내부의 청결 상태와 리플로우 오븐의 내부의 기준 청결 상태를 비교하여 리플로우 오븐을 청소할 필요가 있는지 여부를 판단하도록 구성된다. 상기 기준 청결 상태는 참조 이미지의 청결 상태를 포함한다. 확보된 리플로우 오븐의 내부의 청결 상태 와 리플로우 오븐의 내부의 기준 청결 상태가 매칭될 때, 리플로우 오븐을 청소할 필요가 있다고 판 단된다. 리플로우 오븐의 내부의 청결 상태는 리플로우 오븐의 내부의 오염 물질의 색상 및 면적, 예컨대 레일 조정 디바이스 및/또는 리플로우 오븐 챔버 디바이스의 표면 상의 오염 물질의 색상 및 면적을 포함한다. 일 실시형태에서, 오염 물질의 색상은 검정, 노랑 및 연노랑을 포함한다. 색상이 어두울수 록 오염이 더 심각하다는 것을 나타낸다. 검정, 노랑 및 연노랑으로 표시된 오염 물질의 정도는 순서대로 감소 한다. 리플로우 오븐 내의 오염 정도는 또한 오염 물질의 면적에 기초하여 판단될 수 있다. 오염 물질의 면적이 클수록 오염이 더 심각하다는 것을 나타낸다. 판단시, 오염 물질의 색상은 오염 물질의 면적보다 우선 한다. 일 실시형태에서, 오염 물질의 색상이 검정이고 검정 오염 물질의 면적이 면적 임계치에 도달한 경우에 는, 오염이 심각하고 리플로우 오븐을 청소할 필요가 있다고 실질적으로 판단된다. 리플로우 오븐을 청소할 필요가 있다고 판단하는 것은, 미리 정해놓은 기간 내에 리플로우 오븐을 청소할 필요가 있는가를 판단하는 것과, 리플로우 오븐을 즉시 청소할 필요가 있는가를 판단하는 것을 포함한다. 다른 실시형태에서, 시스템은 연결 라인을 통해 처리 디바이스에 연결된 표시 디바이스를 추가적으로 포함한다. 리플로우 오븐을 청소할 필요가 있다고 판단되는 경우, 처리 디바이스는 리플 로우 오븐을 청소하기 위한 제어 신호를 연결 라인을 통해 표시 디바이스에 출력하고, 표시 디 바이스는 상기 제어 신호에 따라, 예를 들어 리플로우 오븐을 청소할 필요가 있음을 사용자에게 표시 한다. 리플로우 오븐을 청소할 필요가 있음을 표시하는 것은, 미리 정해놓은 기간 내에 리플로우 오븐 을 청소할 필요가 있음을 표시하는 것과, 리플로우 오븐을 즉시 청소할 필요가 있음을 표시하는 것을 포함한다. 일 실시형태에서, 표시 디바이스는 디스플레이 디바이스 및/또는 알람 디바이스를 포함한다. 다른 실시형태들에서, 표시 디바이스는 다른 적절한 디바이스 또는 구조를 포함한다. 일 실시형태에서, 처리 디바이스는 리플로우 오븐의 컨트롤러이다. 다른 실시형태에서, 처리 디바이 스는 리플로우 오븐의 컨트롤러와 상이하다. 일 실시형태에서, 표시 디바이스는 리플로우 오븐 의 디스플레이, 지시등 및 경보등이다. 다른 실시형태에서, 표시 디바이스는 리플로우 오븐의 디스플레이, 지시등 및 경보등과 상이하다. 다른 실시형태들에서, 시스템은 리플로우 오븐의 청소 여부를 판단하기 위한 다른 적절한 디바이스 또는 구조를 포함한다. 도 2b에 도시된 바와 같이, 리플로우 오븐은 시스템을 포함한다. 도 2b의 시스템은 도 2a의 시 스템과 동일한 구조를 갖는다. 도 3은 본원에 따른 리플로우 오븐의 청소 여부를 판단하는 방법의 흐름도이다. 도 3에 도시된 바와 같이, 단계 302에서, 리플로우 오븐의 청소 여부를 판단하는 방법이 수행되기 시 작한다. 그 후에, 프로세스는 단계 302에서 단계 304로 진행된다. 단계 304에서는, 리플로우 오븐이 폐쇄된 상태일 때, 리플로우 오븐의 내부의 이미지를 취득한다. 일 실시형태에서, 리플로우 오븐의 내부의 이미지를 취득하는 단계는: 이미지 취득 디바이스가 리플 로우 오븐의 내부의 이미지를 취득하도록, 이미지 취득 디바이스를 리플로우 오븐의 리플로우 오븐 챔버를 통하여 이송하는 단계를 포함한다. 이미지 취득 디바이스를 리플로우 오븐의 리플 로우 오븐 챔버를 통하여 이송하는 단계는: 이미지 취득 디바이스를 리플로우 오븐의 이송 디바 이스에 장착하는 단계, 및 장착된 이미지 취득 디바이스를 이송 디바이스에 의해 리플로우 오븐 의 리플로우 오븐 챔버를 통하여 이송하는 단계를 포함한다. 일 실시형태에서, 리플로우 오븐 이 폐쇄된 상태일 때, 리플로우 오븐은 정상 작동의 비생산 상태이고, 이 비생산 상태 동안, 리플로우 오 븐을 통과하는 가공 대상물이 없으며, 이미지 취득 디바이스는 리플로우 오븐의 내부의 이미지 를 취득하기 위해 리플로우 오븐의 리플로우 오븐 챔버를 통하여 이송된다. 다른 실시형태에서, 리 플로우 오븐이 폐쇄된 상태일 때, 리플로우 오븐은 정상 작동 중이고, 이 정상 작동 동안, 가공 대상 물이 처리되도록 리플로우 오븐을 통과하며, 이미지 취득 디바이스는 또한 리플로우 오븐의 내 부의 이미지를 취득하기 위해 리플로우 오븐의 리플로우 오븐 챔버를 통하여 이송된다. 리플로우 오 븐의 내부의 이미지를 취득하는 것은: 리플로우 오븐의 리플로우 오븐 챔버 디바이스의 표면의 이미지를 취득하는 것 및/또는 레일 조정 디바이스의 이미지를 취득하는 것을 포함한다. 리플로우 오븐챔버 디바이스의 표면의 이미지는, 상위 리플로우 오븐 챔버 디바이스의 바닥면의 이미지를 포 함한다. 그 후에, 프로세스는 단계 304에서 단계 306로 진행된다. 단계 306에서는, 취득된 이미지를 저장한다. 그 후에, 프로세스는 단계 306에서 단계 308로 진행된다. 단계 308에서는, 저장된 이미지를 처리하여, 리플로우 오븐의 내부의 청결 상태를 확보한다. 일 실시형태 에서, 저장된 이미지를 처리하여 리플로우 오븐의 내부의 청결 상태를 확보하는 단계는: 리플로우 오븐 의 내부의 오염 물질의 색상 및 면적을 확보하기 위해 상기 저장된 이미지를 처리하는 단계를 포함한다. 그 후에, 프로세스는 단계 308에서 단계 310로 진행된다. 단계 310에서는, 확보된 리플로우 오븐의 내부의 청결 상태에 기초하여, 리플로우 오븐을 청소할 필 요가 있는지 여부를 판단한다. 일 실시형태에서, 리플로우 오븐을 청소할 필요가 있는지 여부를 판단하는 단계 는: 인공 지능 트레이닝을 통해 리플로우 오븐을 청소할 필요가 있는지 여부를 판단하는 단계를 포함한다. 일 실시형태에서, 사용자에 의해 리플로우 오븐 상에서 수행되는 실제 작동시, 리플로우 오븐을 청소할 필요가 있을 때, 리플로우 오븐의 내부의 복수의 이미지를 획득하고, 이들 이미지를, 리플로우 오븐 을 청소할 필요가 있음을 나타내는 참조 이미지로서 사용한다. 이미지 데이터는 인공 지능을 통해 트레이닝되 어, 판단 유닛은, 이미지 취득 디바이스에 의해 취득된 리플로우 오븐의 내부의 이미지들에 기 초하여[예컨대, 추가적으로 리플로우 오븐의 내부의 청결 상태에 기초하여] 리플로우 오븐을 청소할 필요가 있는지 여부를 판단할 수 있다. 리플로우 오븐을 청소할 필요가 있는지 여부를 판단하는 것은: 미 리 정해놓은 기간 내에 리플로우 오븐을 청소할 필요가 있는가를 판단하는 것과, 리플로우 오븐을 즉 시 청소할 필요가 있는가를 판단하는 것을 포함한다. 일 실시형태에서, 확보된 리플로우 오븐의 내부의 청결 상태에 기초하여 리플로우 오븐을 청소할 필 요가 있는지 여부를 판단하는 단계는: 확보된 리플로우 오븐의 내부의 청결 상태와 리플로우 오븐의 내부의 기준 청결 상태를 비교하여 리플로우 오븐을 청소할 필요가 있는지 여부를 판단하는 것을 포함한다. 상기 기준 청결 상태는 참조 이미지의 청결 상태를 포함한다. 확보된 리플로우 오븐의 내부의 청결 상태와 리플로우 오븐의 내부의 기준 청결 상태가 매칭될 때, 리플로우 오븐을 청소할 필요가 있다고 판단된다. 리플로우 오븐의 내부의 청결 상태는 리플로우 오븐의 내부의 오염 물질의 색상 및 면적, 예컨대 레일 조정 디바이스 및/또는 리플로우 오븐 챔버 디바이스의 표면 상의 오염 물질의 색상 및 면적을 포함한다. 일 실시형태에서, 오염 물질의 색상은 검정, 노랑 및 연노랑을 포함한다. 색상이 어두울수록 오염이 더 심각하다는 것을 나타낸다. 검정, 노랑 및 연노랑으로 표시된 오염 물질의 정도는 순서 대로 감소한다. 리플로우 오븐 내의 오염 정도는 또한 오염 물질의 면적에 기초하여 판단될 수 있다. 오 염 물질의 면적이 클수록 오염이 더 심각하다는 것을 나타낸다. 판단시, 오염 물질의 색상은 오염 물질의 면적 보다 우선한다. 일 실시형태에서, 오염 물질의 색상이 검정이고 검정 오염 물질의 면적이 면적 임계치에 도달 한 경우에는, 오염이 심각하고 리플로우 오븐을 청소할 필요가 있다고 실질적으로 판단된다. 리플로우 오 븐을 청소할 필요가 있다고 판단하는 것은, 미리 정해놓은 기간 내에 리플로우 오븐을 청소할 필요가 있는가를 판단하는 것과, 리플로우 오븐을 즉시 청소할 필요가 있는가를 판단하는 것을 포함한다. 다른 실시형태에서는, 다른 적절한 방법에 의해, 리플로우 오븐을 청소할 필요가 있는지 여부가 판단된다. 그 후에, 상기 프로세스는 단계 310에서 단계 312로 진행되고, 리플로우 오븐의 청소 여부를 판단하는 방법 의 수행이 종료된다. 다른 실시형태에서, 상기 방법은 추가적으로, 리플로우 오븐을 청소할 필요가 있음을 사용자에게 표 시하는 단계를 포함하고, 이 단계는 예를 들어, 미리 정해놓은 기간 내에 리플로우 오븐을 청소할 필요가 있음을 표시하는 것, 또는 리플로우 오븐을 즉시 청소할 필요가 있음을 표시하는 것을 포함한다. 도 4a는 도 1b에 도시된 리플로우 오븐의 리플로우 오븐 챔버 디바이스의 사시도이고, 도 4b는 바닥 에서 바라본 도 4a에 도시된 리플로우 오븐 챔버 디바이스의 사시도이다. 도 4a-도 4b에 도시된 바와 같이, 리플로우 오븐 챔버 디바이스는 하우징을 포함한다. 하우징 은 상측 부분과 4개의 측면 부분을 포함한다. 가스 유동 공급원(도시되어 있지 않음)이 하우징 내에 마련 되고, 가스 유동을 출력하도록 구성된다. 리플로우 오븐 챔버 디바이스는 추가적으로, 바닥에 위치된 바 닥 플레이트를 포함한다. 바닥 플레이트에는 관통 구멍이 마련되고, 바닥 플레이트는 바 닥면을 포함한다. 바닥 플레이트의 바닥면은 리플로우 오븐 챔버를 향해 배치된다. 리플 로우 오븐 챔버 디바이스는, 가스 유동 공급원이 바닥 플레이트의 관통 구멍을 통해 가스 유동 을 전달하여 리플로우 오븐 챔버에 도달하게 하도록 구성된다. 도 4a-도 4b에 도시된 리플로우 오븐 챔버디바이스는, 리플로우 오븐 챔버의 위에 배치되는 상위 리플로우 오븐 챔버 디바이스이다. 상 위 리플로우 오븐 챔버 디바이스는 아래에 있는 리플로우 오븐 챔버에 도달하도록 바닥 플레이트 의 관통 구멍을 통해 가스 유동을 전달한다. 고온 구역에서 발생된 증기 오염 물질이 냉각 구역으로 유동하는 경우, 오염 물질은 냉각 구역의 리플로우 오븐 챔버 디바이스의 표면 상에 응결된다. 오염 물질은 상위 리플로우 오븐 챔버 디바이스의 바닥면 상에 응결된다. 바닥면 상에 축적된 오염 물질이 일정량에 달하는 경우, 오염 물질은 바닥면 에서 이탈되어 아래에 있는 회로 기판 상에 적하되고, 이에 따라 회로 기판을 오염시킨다. 도 5a는 도 1b에 도시된 리플로우 오븐 상의 이미지 취득 디바이스의 사시도이고, 도 5b는 하우징의 일부가 제거되어 있는 도 5a에 도시된 이미지 취득 디바이스의 사시도이며, 도 5c는 도 5a의 분해도이다. 도 5a-도 5c에 도시된 바와 같이, 이미지 취득 디바이스는 하우징 및 장착 구조를 포함한다. 하우징은 이미지 취득 디바이스의 내부 구성요소를 수용하도록 구성된다. 상기 내부 구성요소는 광 원, 이미지 취득 유닛, 컨트롤러 및 전원을 포함한다. 이미지 취득 디바이스가 리플 로우 오븐을 통하여 이송될 때, 하우징은 리플로우 오븐의 열을 하우징의 외부에서 절연할 수 있다. 일 실시형태에서, 하우징은 세라믹 섬유와 같은 절연 재료로 제조된다. 장착 구조는 하우 징을 지지하도록 구성된다. 장착 구조는 견고한 구조이다. 이미지 취득 디바이스가 이송 디바 이스에 의해 리플로우 오븐의 리플로우 오븐 챔버를 통하여 이송될 수 있도록, 장착 구조 는 리플로우 오븐의 이송 디바이스에 장착될 수 있다. 하우징의 상단에 개구가 있다. 개구에는 투명 파티션과 절연판이 마련된다. 투명 파티션은 광원 및 이미지 취득 유닛의 위에 배치되고, 리플로우 오븐으로부터 광원 및 이미지 취득 유닛으로의 열전달을 차단하도록 구성된다. 투명 파티션은, 광원에 의해 출사 된 광이 투명 파티션을 통과하여 리플로우 오븐의 내부 구성요소를 조명할 수 있게 하고, 이미지 취 득 유닛이 조명된 리플로우 오븐의 내부 구성요소의 이미지를 취득할 수 있게 한다. 투명 파티션 이 장착 해제되는 경우, 광원 및 이미지 취득 유닛은 개구를 통해 하우징에 장착될 수 있고 또는 하우징으로부터 장착 해제될 수 있다. 절연판은 컨트롤러 및 전원의 위에 배치되고, 리플로우 오븐으로부터 컨트롤러 및 전원으로의 열전달을 차단하도록 구성된다. 절 연판이 장착 해제되는 경우, 컨트롤러 및 전원은 개구를 통해 하우징에 장착될 수 있 고 또는 하우징으로부터 장착 해제될 수 있다. 절연판은 절연 재료로 제조된다. 도 5b에 도시된 바와 같이, 이미지 취득 디바이스는 광원, 이미지 취득 유닛, 컨트롤러 및 전원을 포함하고, 이들 모두가 하우징에 배치된다. 광원은 리플로우 오븐의 내부를 조명 하도록 구성된다. 일 실시형태에서, 광원은 리플로우 오븐 챔버 디바이스 및/또는 레일 조정 디바이 스를 조명한다. 일 실시형태에서, 광원은 LED 램프와 같은 플래시 램프이다. 이미지 취득 유닛 은, 광원이 리플로우 오븐의 내부를 조명할 때, 리플로우 오븐의 내부의 이미지를 취득하 도록 구성된다. 광원은, 이미지 취득 유닛이 리플로우 오븐의 내부의 선명한 이미지를 취득할 수 있도록, 이미지 취득 유닛을 위한 조명을 제공한다. 컨트롤러는, 이미지 취득 유닛 및 광원 의 작동을 제어하여 이미지 취득 유닛이 리플로우 오븐의 내부의 이미지를 취득하게 하고 이미 지 취득 유닛에 의해 취득된 이미지를 저장하도록 구성된다. 컨트롤러는 연결 라인(도시되어 있지 않음)을 통해 이미지 취득 유닛 및 광원에 연결된다. 컨트롤러는 제어 회로와 저장 회로를 포 함한다. 상기 제어 회로는 이미지 취득 유닛 및 광원의 작동을 제어하도록 구성되고, 상기 저장 회 로는 이미지 취득 유닛에 의해 취득된 이미지 데이터를 저장하도록 구성된다. 일 실시형태에서, 컨트롤러 는 이미지 취득 유닛 및 광원을 동시에 활성화되도록 제어한다. 다른 실시형태에서, 컨트롤러 는 이미지 취득 유닛을 리플로우 오븐을 통하여 이송하는 동안에 광원을 항상 활성화되도 록 제어한다. 컨트롤러는 처리 디바이스에 연결되는 USB 인터페이스와 같은 인터페이스를 포함한다. 컨트롤러는 저장된 이미지 데이터를 인터페이스를 통해 처리 디바이스에 출력하고(도 2a-도 2b 참 조), 이에 따라 처리 디바이스는 상기 이미지 데이터를 처리하여 리플로우 오븐을 청소할 필요가 있 는지 여부를 판단한다. 전원은 광원, 이미지 취득 유닛 및 컨트롤러에 전력을 공급하도록 구성된다. 일 실시형태에서, 전원은 배터리이다. 도 5b-도 5c에 도시된 바와 같이, 이미지 취득 디바이스는 2개의 이미지 취득 유닛을 포함하여, 이미 지 취득 디바이스는 리플로우 오븐을 통하여 이송될 때 리플로우 오븐의 전체 폭 방향에 있어서의 내부 구성요소들의 이미지를 취득할 수 있다. 다른 실시형태들에서, 이미지 취득 디바이스는 리플로우 오븐 의 내부의 이미지를 취득하기 위해 상이한 그리고 적절한 수의 이미지 취득 유닛을 포함한다. 도 5c에 도시된 바와 같이, 장착 구조는 본체 부분과 플랜지를 포함한다. 본체 부분은 상 단에 개구가 있는 개방형 하우징이다. 본체 부분은 전방 부분, 후방 부분, 좌측 부분 , 우측 부분 및 바닥 부분을 구비한다. 좌측 부분의 상단 에지와 우측 부분의 상단 에지는 양자 모두가 플랜지에 연결된다. 플랜지는 이송 디바이스에 장착되도록 구성되고, 예를 들어 이송 디바이스의 핀 어셈블리 상에 배치되어(도 1e-도 1g 참조), 이미지 취득 디바이스는 이송 디바이스에 장착되고 이송 디바이스에 의해 리플로우 오븐을 통하여 이송된다. 다른 실시 형태들에서, 장착 구조는, 이미지 취득 디바이스가 이송 디바이스에 장착되도록 하는 다른 적절 한 구조를 포함한다. 일 실시형태에서, 장착 구조는 일체로 형성된다. 다른 실시형태들에서, 장착 구조 는 다른 적절한 방식으로 형성된다. 다른 실시형태들에서, 이미지 취득 디바이스는, 리플로우 오븐의 내부의 이미지를 취득하도록 리플로 우 오븐을 통하여 이송되기 위하여, 다른 적절한 구조 및/또는 디바이스를 포함한다. 도 6a는 다른 실시형태에 따른 이미지 취득 디바이스의 사시도이고, 도 6b는 도 6a의 분해도이다. 도 6a-도 6b에 도시된 바와 같이, 이미지 취득 디바이스는 이미지 취득 디바이스 및 장착 구조 를 포함한다. 본 실시형태에서, 이미지 취득 디바이스는 2개의 이미지 취득 디바이스를 포함한다. 다른 실시형태들에서, 이미지 취득 디바이스는 상이한 그리고 적절한 수의 이미지 취득 디바이스를 포함한다. 이미지 취득 디바이스는 싱글-레인 리플로우 오븐(도시되어 있지 않음)에 적합하다. 싱 글-레인 리플로우 오븐의 폭은 넓어서, 전체 폭을 따라서 리플로우 오븐의 내부의 이미지를 취 득하기 위해 병렬로 배치된 수 개의 이미지 취득 디바이스가 필요하다. 이미지 취득 디바이스는 추 가적으로, 다른 적절한 구조를 갖는 리플로우 오븐의 내부의 이미지를 취득하도록 구성된다. 전술한 실시 형태에서는, 도 1b-도 1g에 도시된 바와 같이, 리플로우 오븐은 이중 레인을 갖고, 각각의 레인에 이미지 취득 디바이스가 마련된다. 도 6a-도 6b의 이미지 취득 디바이스는 도 5a-도 5c의 이미지 취득 디바이스와 동일한 구조를 갖는다. 장착 구조는, 이미지 취득 디바이스가 이송 디바이스에 의해 리플로우 오븐을 통 하여 이송될 수 있도록, 리플로우 오븐의 이송 디바이스에 장착될 수 있다. 일 실시형태에서, 장착 구조는 이송 디바이스의 핀 어셈블리 상에 배치된다. 이송 디바이스에 의해 이송하는 동 안, 핀 어셈블리는 장착 구조를 이동시키고, 더 나아가 이미지 취득 디바이스를 이동시키도록 이동한다. 장착 구조는 추가적으로, 이미지 취득 디바이스를 지지하도록 구성된다. 도 6a-도 6b에 도시된 바와 같이, 장착 구조는 본체 부분과 제한 부분을 포함한다. 본체 부분은 이미지 취득 디바이 스를 수용하도록 구성된 개구를 포함한다. 이미지 취득 디바이스의 플랜지가 본체 부분 에 의해 막힐 때까지, 이미지 취득 디바이스는 개구를 통과할 수 있다. 이미지 취득 디바이스 의 플랜지가 본체 부분의 비-개구 부분에 배치되어, 본체 부분은 이미지 취득 디바이스 를 지지할 수 있다. 이미지 취득 디바이스가 리플로우 오븐의 수평 방향으로 개구에 실질 적으로 고정된 채로 유지되도록, 각 개구의 치수는 이미지 취득 디바이스의 치수와 실질적으로 동일 하다. 제한 부분은 본체 부분의 전방 에지와 후방 에지에 연결되고, 전방 에지와 후방 에지로부터 하방으로 연장된다. 제한 부분의 길이는 본체 부분의 길이보다 짧아서, 폭 방향으로 연장되는 돌출 부분이 본체 부분의 좌측과 우측에 각각 남겨진다. 각각의 돌출 부분은, 예를 들어 이송 디바 이스의 핀 어셈블리 상에 배치된, 리플로우 오븐의 이송 디바이스에 장착되도록 구성된다. 제한 부분과 돌출 부분은, 장착 구조가 이송 디바이스에 용이하게 장착될 수 있도록 구성 된다. 그 밖의 실시형태에서, 장착 구조는 다른 적절한 구조를 포함한다. 도 7은 도 2a-도 2b에 도시된 처리 디바이스의 블록도이다. 도 7에 도시된 바와 같이, 처리 디바이스 는 버스, 프로세서, 메모리, 입력 인터페이스 및 출력 인터페이스를 포함한다. 프로세서, 메모리, 입력 인터페이스 및 출력 인터페이스는 버스에 연결된다. 프로세 서는 메모리로부터 프로그램(또는 명령)을 판독하고, 프로그램(또는 명령)을 실행하여 리플로우 오븐의 각 구성요소를 제어하고 및/또는 데이터를 처리한다. 프로세서는 추가적으로, 메모리에 데 이터 또는 프로그램(또는 명령)을 기록할 수 있다. 메모리는 프로그램(명령) 또는 데이터를 저장할 수 있 다. 메모리에 있는 명령을 실행시킴으로써, 프로세서는 메모리, 입력 인터페이스 및 출력 인터페이스를 제어할 수 있다. 입력 인터페이스는 연결 라인을 통해 이미지 취득 디바이스로부터 이미지 데이터를 수신하도록 구성된다. 입력 인터페이스는 추가적으로, 수신된 이미지 데이터를 프로세서에 의해 인식 가능한 신 호로 변환하고 이 신호를 프로세서에 출력하도록 구성된다. 프로세서는 수신된 신호를 처리(예컨대, 연산 및 판단)하여 리플로우 오븐을 청소할 필요가 있음을 나타내는 제어 신호를 출력하도록 구성된다. 출력 인터페이스는 프로세서로부터 제어 신호를 수신하고, 제어 신호를 표시 디바이스에 적합한 출력 신호로 변환하며, 출력 신호를 연결 라인을 통해 표시 디바이스에 전송하도록 구성되어 있어, 표시 디바이스는 리플로우 오븐을 청소할 필요가 있다는 표시를 생성하는데, 이 표시에는 예컨대 리 플로우 오븐을 미리 정해놓은 기간 내에 청소할 필요가 있다는 표시와, 리플로우 오븐을 즉시 청소할 필요가 있다는 표시가 포함된다. 본원은 앞서 개략적으로 설명된 실시형태들의 예들을 참조하여 기술되었지만, 알려져 있거나 현재 예측될 또는 머지않아 예측될 다양한 대안, 수정, 변형, 개선 및/또는 실질적 등가물이 당업자에게 명백할 수 있다. 또한, 본 명세서에 기술된 기술적 효과 및/또는 기술적 문제는 제한적인 것이 아니라 예시적인 것이다. 따라서, 본 명세서에 개시된 내용은 다른 기술적 문제를 해결하는 데 사용될 수 있고, 다른 기술적 효과를 갖고 및/또는 다 른 기술적 문제를 해결할 수 있다. 따라서, 위에 제시된 바와 같은 본원의 실시형태들의 예들은 제한하는 것이 아니라 예시적인 것으로 의도되어 있다. 본원의 정신 또는 범위에서 벗어나지 않고서 다양한 변경이 실시될 수 있다. 따라서, 본원은 알려진 또는 이전에 개시된 모든 대안, 수정, 변형, 개선 및/또는 실질적 등가물을 포괄 하도록 의도되어 있다."}
{"patent_id": "10-2024-0083064", "section": "도면", "subsection": "도면설명", "item": 1, "content": "첨부 도면은 일정한 축척에 따라 도시되어 있지 않다. 첨부 도면에서, 서로 다른 도면에 나타내어진 동일한 또 는 거의 동일한 각각의 구성요소는 동일한 참조 부호로 나타내어져 있다. 명료성을 목적으로, 모든 도면에서 모든 구성요소에 부호가 붙여지는 것은 아닐 수 있다. 도면에서: 도 1a는 본원에 따른 리플로우 오븐의 사시도이고; 도 1b는 하우징이 제거되어 있는 도 1a에 도시된 리플로우 오븐의 사시도이며; 도 1c는 도 1b의 부분 확대도이고; 도 1d는 개방 상태의 도 1b에 도시된 리플로우 오븐의 사시도이며; 도 1e는 도 1d의 부분 확대도이고; 도 1f는 도 1b의 좌측면도이며; 도 1g는 도 1f의 부분 확대도이고; 도 2a는 본원의 일 실시형태에 따른 리플로우 오븐의 청소 여부를 판단하는 시스템의 블록도이고; 도 2b는 본원의 다른 실시형태에 따른 리플로우 오븐의 청소 여부를 판단하는 시스템의 블록도이며; 도 3은 본원에 따른 리플로우 오븐의 청소 여부를 판단하는 방법의 흐름도이고; 도 4a는 도 1b에 도시된 리플로우 오븐의 리플로우 오븐 챔버 디바이스의 사시도이며; 도 4b는 바닥에서 바라본 도 4a에 도시된 리플로우 오븐 챔버 디바이스의 사시도이고; 도 5a는 도 1b에 도시된 리플로우 오븐 상의 이미지 취득 디바이스의 사시도이며; 도 5b는 하우징의 일부가 제거되어 있는 도 5a에 도시된 이미지 취득 디바이스의 사시도이고; 도 5c는 도 5a의 분해도이며; 도 6a는 다른 실시형태에 따른 이미지 취득 디바이스의 사시도이고; 도 6b는 도 6a의 분해도이며; 도 7은 도 2a-도 2b에 도시된 처리 디바이스의 블록도이다."}
