{"patent_id": "10-2021-0161287", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0018972", "출원번호": "10-2021-0161287", "발명의 명칭": "뉴럴 네트워크 장치 및 뉴럴 네트워크 장치에 의해 수행되는 처리 방법", "출원인": "삼성전자주식회사", "발명자": "이종은"}}
{"patent_id": "10-2021-0161287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "랜덤 액세스 메모리(random-access memory; RAM)를 이용하는 뉴럴 네트워크 장치에 있어서,입력과 가중치에 기초하여 아날로그 출력 신호를 생성하고, 크로스바 어레이(crossbar array) 구조를 가지는 상기 랜덤 액세스 메모리;기준 신호와 상기 랜덤 액세스 메모리의 상기 아날로그 출력 신호에 기초하여 디지털 출력 신호를 생성하는 아날로그-디지털 컨버터(analog-to-digital converter; ADC) 회로;상기 ADC 회로의 상기 기준 신호를 스케일링(scaling)하는 제1 ADC 스케일러(scaler); 및상기 ADC 회로에 의해 생성된 상기 디지털 출력 신호를 스케일링하는 제2 ADC 스케일러를 포함하는 뉴럴 네트워크 장치."}
{"patent_id": "10-2021-0161287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제1 ADC 스케일러와 상기 제2 ADC 스케일러는 서로 동일한 스케일 요소(scale factor)를 가지는,뉴럴 네트워크 장치."}
{"patent_id": "10-2021-0161287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 제1 ADC 스케일러는,아날로그 영역에서 상기 기준 신호에 대응하는 기준 전압을 스케일 요소로 나누는 것에 의해 상기 기준 전압을조정하는,뉴럴 네트워크 장치."}
{"patent_id": "10-2021-0161287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 제2 ADC 스케일러는,디지털 영역에서 상기 디지털 출력 신호에 상기 스케일 요소를 곱하는 것에 의해 상기 디지털 출력 신호를 조정하는,뉴럴 네트워크 장치."}
{"patent_id": "10-2021-0161287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 제1 ADC 스케일러는,공개특허 10-2023-0018972-3-직렬로 연결된 저항들에 인가되는 기준 전압을 조정하는 것에 의해 상기 기준 신호를 스케일링하는,뉴럴 네트워크 장치."}
{"patent_id": "10-2021-0161287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 제2 ADC 스케일러는,상기 ADC 회로의 상기 디지털 출력 신호에 스케일 요소를 곱한 결과를 출력하는 디지털 곱셈기(digitalmultiplier)를 포함하는,뉴럴 네트워크 장치."}
{"patent_id": "10-2021-0161287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 ADC 회로는,상기 아날로그 출력 신호와 서로 다른 기준 신호에 입력되는 복수의 비교기들을 포함하고,상기 비교기들 각각은, 상기 아날로그 출력 신호와 기준 신호 간의 비교 결과에 기초하여 이진화된 출력 값을출력하는,뉴럴 네트워크 장치."}
{"patent_id": "10-2021-0161287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 입력과 상기 가중치는 각각 양자화되고, 상기 랜덤 액세스 메모리의 상기 크로스바 어레이 구조에 대응되도록 분할(split)된 것인,뉴럴 네트워크 장치."}
{"patent_id": "10-2021-0161287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 랜덤 액세스 메모리는,상기 각각 양자화되고 분할된 입력과 가중치 간의 연산에 의해 생성된 아날로그 값의 부분 합(partial sum)들을생성하는,뉴럴 네트워크 장치."}
{"patent_id": "10-2021-0161287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 ADC 회로는,상기 아날로그 값의 부분 합들을 디지털 값으로 변환하여 디지털 값의 부분 합들을 생성하고, 상기 디지털 값의부분 합들을 누적(accumulation)하여 상기 디지털 출력 신호를 생성하는,공개특허 10-2023-0018972-4-뉴럴 네트워크 장치."}
{"patent_id": "10-2021-0161287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서,상기 제1 ADC 스케일러의 스케일 요소와 상기 제2 ADC 스케일러의 스케일 요소는 양자화 기법으로 도출된 것인,뉴럴 네트워크 장치."}
{"patent_id": "10-2021-0161287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1항에 있어서,상기 랜덤 액세스 메모리는,저항 메모리(resistive RAM)인, 뉴럴 네트워크 장치."}
{"patent_id": "10-2021-0161287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "뉴럴 네트워크 장치에 의해 수행되는 처리 방법에 있어서,입력과 가중치를 수신하는 동작;크로스바 어레이(crossbar array) 구조의 랜덤 액세스 메모리(random-access memory; RAM)를 통해, 상기 입력과 상기 가중치에 기초하여 아날로그 출력 신호를 생성하는 동작;아날로그-디지털 컨버터(analog-to-digital converter; ADC) 회로를 통해, 제1 ADC 스케일러에 의해 스케일링된 기준 신호와 상기 랜덤 액세스 메모리의 상기 아날로그 출력 신호에 기초하여 디지털 출력 신호를 생성하는동작; 및제2 ADC 스케일러를 통해, 상기 ADC 회로에 의해 생성된 상기 디지털 출력 신호에 대한 스케일링을 수행하는 동작을 포함하는 처리 방법."}
{"patent_id": "10-2021-0161287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 제1 ADC 스케일러와 상기 제2 ADC 스케일러는 서로 동일한 스케일 요소를 가지는,처리 방법."}
{"patent_id": "10-2021-0161287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제13항에 있어서,상기 제1 ADC 스케일러에 의해, 아날로그 영역에서 상기 기준 신호를 스케일 요소로 나누는 것에 의해 상기 스케일링된 기준 신호를 생성하는 동작을 더 포함하는 처리 방법."}
{"patent_id": "10-2021-0161287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "공개특허 10-2023-0018972-5-제13항에 있어서,상기 디지털 출력 신호를 스케일링하는 동작은,디지털 영역에서 상기 디지털 출력 신호에 상기 스케일 요소를 곱하는 것에 의해 상기 디지털 출력 신호를 조정하는 동작을 포함하는 처리 방법."}
{"patent_id": "10-2021-0161287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제13항에 있어서,상기 아날로그 출력 신호를 생성하는 동작은,각각 양자화되고 분할된 입력과 가중치 간의 연산에 의해 생성된 아날로그 값의 부분 합들을 생성하는 동작을 포함하는 처리 방법."}
{"patent_id": "10-2021-0161287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서,상기 디지털 출력 신호를 생성하는 동작은,상기 아날로그 값의 부분 합들을 디지털 값으로 변환하여 디지털 값의 부분 합들을 생성하고, 상기 디지털 값의부분 합들을 누적하여 상기 디지털 출력 신호를 생성하는 동작을 포함하는 처리 방법."}
{"patent_id": "10-2021-0161287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제13항 내지 제18항 중 어느 한 항의 방법을 수행하기 위한 명령어를 포함하는 하나 이상의 컴퓨터 프로그램을저장한 컴퓨터 판독 가능 기록 매체."}
{"patent_id": "10-2021-0161287", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "뉴럴 네트워크 장치 및 뉴럴 네트워크 장치에 의해 수행되는 처리 방법이 개시된다. 뉴럴 네트워크 장치는 입력 과 가중치에 기초하여 아날로그 출력 신호를 생성하고, 크로스바 어레이 구조를 가지는 랜덤 액세스 메모리, 기 준 신호와 저항 메모리의 아날로그 출력 신호에 기초하여 디지털 출력 신호를 생성하는 아날로그-디지털 컨버터 회로, ADC 회로의 기준 신호를 스케일링하는 제1 ADC 스케일러, 및 ADC 회로에 의해 생성된 디지털 출력 신호를 스케일링하는 제2 ADC 스케일러를 포함할 수 있다."}
{"patent_id": "10-2021-0161287", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "실시예들은 인-메모리 컴퓨팅 기반 뉴럴 네트워크 장치와 뉴럴 네트워크 장치에 의해 수행되는 처리 방법에 관 한 것이다."}
{"patent_id": "10-2021-0161287", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 딥 뉴럴 네트워크(deep neural network; DNN)의 성공으로 인하여 DNN 알고리즘을 가속화하기 위한 효율적 인 하드웨어에 대한 관심이 증가하고 있다. 저항 메모리(resistive random-access memory; ReRAM) 크로스바 어레이(crossbar array)(RCA)는 최근에 제안된 많은 RCA 기반 DNN 가속기(accelerator)의 기초가 되는 행렬-벡 터 곱셈(matrix-vector multiplication; MVM) 연산들의 효율적인 계산을 가능하게 한다. RCA 기반 DNN 가속기 는 데이터가 저장된 곳에서 바로 계산이 수행되는 아키텍쳐를 가지고 있고, 모든 시냅스 요소들(synaptic elements)을 전용 하드웨어로 구현하여 높은 처리량(throughput)을 제공한다."}
{"patent_id": "10-2021-0161287", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "발명의 내용"}
{"patent_id": "10-2021-0161287", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시예에 따른 뉴럴 네트워크 장치는, 입력과 가중치에 기초하여 아날로그 출력 신호를 생성하고, 크로스바 어레이(crossbar array) 구조를 가지는 랜덤 액세스 메모리; 기준 신호와 상기 랜덤 액세스 메모리의 상기 아날 로그 출력 신호에 기초하여 디지털 출력 신호를 생성하는 아날로그-디지털 컨버터(analog-to-digital converter; ADC) 회로; 상기 ADC 회로의 상기 기준 신호를 스케일링(scaling)하는 제1 ADC 스케일러(scaler); 및 상기 ADC 회로에 의해 생성된 상기 디지털 출력 신호를 스케일링하는 제2 ADC 스케일러를 포함할 수 있다. 상기 제1 ADC 스케일러와 상기 제2 ADC 스케일러는 서로 동일한 스케일 요소(scale factor)를 가질 수 있다. 상기 제1 ADC 스케일러는, 아날로그 영역에서 상기 기준 신호에 대응하는 기준 전압을 스케일 요소로 나누는 것 에 의해 상기 기준 전압을 조정할 수 있다. 상기 제2 ADC 스케일러는, 디지털 영역에서 상기 디지털 출력 신호에 상기 스케일 요소를 곱하는 것에 의해 상 기 디지털 출력 신호를 조정할 수 있다. 일 실시예에 따른 뉴럴 네트워크 장치에 의해 수행되는 처리 방법은, 입력과 가중치를 수신하는 동작; 크로스바 어레이 구조의 랜덤 액세스 메모리를 통해, 상기 입력과 상기 가중치에 기초하여 아날로그 출력 신호를 생성하 는 동작; 아날로그-디지털 컨버터 회로를 통해, 제1 ADC 스케일러에 의해 스케일링된 기준 신호와 상기 랜덤 액 세스 메모리의 상기 아날로그 출력 신호에 기초하여 디지털 출력 신호를 생성하는 동작; 및 제2 ADC 스케일러를 통해, 상기 ADC 회로에 의해 생성된 상기 디지털 출력 신호에 대한 스케일링을 수행하는 동작을 포함할 수 있다. 일 실시예에 따른 뉴럴 네트워크 장치에 의해 수행되는 처리 방법은, 상기 제1 ADC 스케일러에 의해, 아날로그 영역에서 상기 기준 신호를 스케일 요소로 나누는 것에 의해 상기 스케일링된 기준 신호를 생성하는 동작을 더 포함할 수 있다."}
{"patent_id": "10-2021-0161287", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "실시예들에 대한 특정한 구조적 또는 기능적 설명들은 단지 예시를 위한 목적으로 개시된 것으로서, 다양한 형 태로 변경되어 구현될 수 있다. 따라서, 실제 구현되는 형태는 개시된 특정 실시예로만 한정되는 것이 아니며, 본 명세서의 범위는 실시예들로 설명한 기술적 사상에 포함되는 변경, 균등물, 또는 대체물을 포함한다. 제1 또는 제2 등의 용어를 다양한 구성요소들을 설명하는데 사용될 수 있지만, 이런 용어들은 하나의 구성요소 를 다른 구성요소로부터 구별하는 목적으로만 해석되어야 한다. 예를 들어, 제1 구성요소는 제2 구성요소로 명 명될 수 있고, 유사하게 제2 구성요소는 제1 구성요소로도 명명될 수 있다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이해되어야 할 것이다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 명세서에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 설명된 특징, 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것이 존재함 으로 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이들 을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 해당 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가진다. 일반적으로 사용되 는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의미를 갖는 것으로 해석되어야 하며, 본 명세서에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 본 문서에서 설명되는 실시예들은 인-메모리 컴퓨팅에 기초하는 딥 러닝 하드웨어 장치나 인-메모리 컴퓨팅 방 식의 행렬-벡터 곱셈(matrix-vector multiplication)을 사용하는 하드웨어 장치(예: 인공지능 하드웨어 응용, 신호 처리 칩 등)에 적용될 수 있다. 아래 설명에서는 설명의 편의를 위해 저항 메모리(ReRAM)에 기반한 실시 예를 설명하고 있지만, 본 문서의 실시예들은 크로스바 어레이 구조를 가지면서 아날로그 연산(예: 아날로그 덧 셈)을 수행하는 다른 타입의 메모리(SRAM(static RAM), DRAM(dynamic RAM), PRAM(phase change RAM), MRAM(magnetoresistive RAM), FeRAM(ferroelectric RAM) 등)를 이용하는 실시예들에도 모두 적용될 수 있다. 이하, 실시예들을 첨부된 도면들을 참조하여 상세하게 설명한다. 첨부 도면을 참조하여 설명함에 있어, 도면 부호에 관계없이 동일한 구성 요소는 동일한 참조 부호를 부여하고, 이에 대한 중복되는 설명은 생략하기로 한 다. 도 1은 일 실시예에 따른 뉴럴 네트워크 장치의 구성들을 도시하는 블록도이다. 도 1을 참조하면, 뉴럴 네트워크 장치는 인-메모리 컴퓨팅 방식으로 뉴럴 네트워크를 구현한 하드웨어 장 치일 수 있다. 예를 들어, 뉴럴 네트워크 장치는 뉴럴 네트워크의 워크로드를 처리하도록 최적화된 뉴럴 네트워크 가속기일 수 있다. 뉴럴 네트워크 장치는 크로스바 어레이(crossbar array) 구조를 가지는 랜덤 액세스 메모리(RAM)를 이용하여 연산을 수행할 수 있다. 뉴럴 네트워크 장치는 랜덤 액세스 메모리(RAM), ADC 회로, 제1 ADC 스케일러 및 제2 ADC 스케일러를 포함할 수 있다. 랜덤 액세스 메모리는 입력과 가중치에 기초하여 아날로그 출력 신호를 생성할 수 있다. 가중치는 뉴럴 네트워크 장치에 의해 구현되는 뉴럴 네트워크의 파라미터에 속한다. 입력과 가중치는 각각 양자화(이진 화도 수행될 수 있음)되고, 랜덤 액세스 메모리의 크로스바 어레이 구조에 대응되도록 분할(split)된 것일 수 있다. 랜덤 액세스 메모리에는 각각 양자화되고 분할된 입력과 가중치가 입력될 수 있고, 각각 양자화 되고 분할된 입력과 가중치 간의 연산에 의해 생성된 아날로그 값의 부분 합(partial sum)들을 생성할 수 있다. 랜덤 액세스 메모리는 예를 들어 저항 메모리(ReRAM)일 수 있으나, 실시예의 범위가 이에 제한되는 것은 아니며, 크로스바 어레이 구조를 가지는 다른 타입의 메모리일 수 있다. 저항 메모리는 전이금속 산화물에서 관찰되는 저항 변화 현상을 이용하여 저(low) 저항 상태에 대응하는 '1' 또는 고(high) 저항 상태에 대응하는 '0'을 저장하는 방식으로 동작하고, 크로스바 어레이 구조로 구현될 수 있다. 크로스바 어레이 구조의 경우, 데이터를 저장하는 단위 셀을 선택하기 위한 셀 선택 트랜지스터 없이, 비트 라인(bit line)과 워드 라인(word line)의 2개의 전극을 이용하여 구동이 가능하므로 집적도 면에서 장점을 가진다. ADC 회로는 입력된 아날로그 신호를 디지털 신호로 변환할 수 있다. ADC 회로는 기준 신호와 랜덤 액세스 메모리의 아날로그 출력 신호에 기초하여 디지털 출력 신호를 생성할 수 있다. ADC 회로는 랜덤 액세스 메모리에서 출력된 아날로그 값의 부분 합들을 디지털 값으로 변환하여 디지털 값의 부분 합 들을 생성하고, 디지털 값의 부분 합들을 누적(accumulation)하여 디지털 출력 신호를 생성할 수 있다. ADC 회 로는 해당 아날로그 출력 신호와 서로 다른 기준 신호에 입력되는 복수의 비교기들을 포함하고, 비교기들 각각은 아날로그 출력 신호와 기준 신호 간의 비교 결과에 기초하여 이진화된 출력 값을 출력할 수 있다. 제1 ADC 스케일러는 ADC 회로의 기준 신호를 스케일링(scaling)할 수 있다. '스케일링'은 신호의 크 기를 조절하는 것을 의미한다. 제1 ADC 스케일러는 아날로그 영역(analog domain)에서 기준 신호에 대응하는 기준 전압(예: 도 5의 Vref)을 설정된 스케일 요소(scaling factor)로 나누는 것에 의해 기준 전압을 조정 할 수 있다. 제1 ADC 스케일러는 직렬로 연결된 저항들에 인가되는 기준 전압을 조정하는 것에 의해 기준 신호를 스케일링할 수 있다. 제2 ADC 스케일러는 ADC 회로에 의해 생성된 디지털 출력 신호를 스케 일링할 수 있다. 제2 ADC 스케일러는 디지털 영역(digital domain)에서 해당 디지털 출력 신호에 스케일 요소를 곱하는 것에 의해 디지털 출력 신호를 조정할 수 있다. 제2 ADC 스케일러는 ADC 회로의 디지 털 출력 신호에 스케일 요소를 곱한 결과를 출력하는 디지털 곱셈기(digital multiplier) 및 디지털 덧셈기를 포함할 수 있다. 제1 ADC 스케일러는 프리(pre)-ADC 스케일러라고도 지칭될 수 있고, 제2 ADC 스케일러 는 포스트(post)-ADC 스케일러라고도 지칭될 수 있다. 위와 같이, 제1 ADC 스케일러는 기준 전압을 제어하는 것에 의해 아날로그 영역의 신호 스케일을 제어하고, 제2 ADC 스케일러는 디지털 영역의 신호 스케일을 제어할 수 있다. 제1 ADC 스케일러와 제2 ADC 스케일러가 모두 사용되어 스케일 요소와 같은 양자화 파라미터가 실현될 수 있다. 제1 ADC 스케 일러와 제2 ADC 스케일러는 서로 동일한 스케일 요소를 가질 수 있고, 이로 인해 오버헤드를 줄일 수 있다. 제1 ADC 스케일러와 제2 ADC 스케일러의 파라미터로서 동일한 값이 사용될 수 있다. 제1 ADC 스케일러의 스케일 요소와 제2 ADC 스케일러의 스케일 요소는 양자화 기법으로 도출된 것(양자화 이 론에서 도출된 최적의 값)일 수 있고, 제1 ADC 스케일러의 스케일 요소, 제2 ADC 스케일러의 스케일 요소 및 랜덤 액세스 메모리에 입력되는 가중치는 동일한 학습 과정에 의해 최적화된 것일 수 있다. 학습 과정에서는 제1 ADC 스케일러의 스케일 요소 및 제2 ADC 스케일러의 스케일 요소의 최적의 값이 결정 되고, 결정된 최적의 스케일 요소를 기반으로 뉴럴 네트워크 장치에 적용되는 가중치가 학습될 수 있다. 인-메모리 컴퓨팅 기반의 뉴럴 네트워크 하드웨어는 계산을 수행하기 위해 ADC를 필요로 한다. 본 명세서에서 제안된 RCA 기반의 뉴럴 네트워크 장치에서는 행렬-벡터 곱셈(MVM)의 연산이 아날로그 영역에서 수행되고, 아날로그 영역에서의 연산 결과를 디지털 신호로 변환하기 위한 ADC를 필요로 한다. ADC는 일반적으로 면적, 에너지 및 파워 등의 측면에서 큰 오버헤드(overhead)를 차지한다. 제안된 기술에 따르면, 하드웨어의 변경 없 이 제1 ADC 스케일러와 제2 ADC 스케일러를 통해 ADC의 필요 면적을 줄이면서도 높은 정확도를 제공 할 수 있고, ADC의 오버헤드를 크게 줄일 수 있다. 뉴럴 네트워크 장치는 양자화 기법으로부터 도출된 최적의 스케일 요소를 ADC 회로의 파라미터로 사 용함으로써 인-메모리 컴퓨팅 기반의 뉴럴 네트워크 하드웨어에서 요구되는 ADC의 크기를 줄이면서 높은 계산 정확도를 제공할 수 있고, 주변 회로들(peripheral circuits)(예: ADC 회로)의 전력 소비와 필요 면적을 감소시킬 수 있다. 이러한 뉴럴 네트워크 장치는 칩(chip)의 형태로 구현되거나 또는 컴퓨터나 모바일 폰 등의 장치에 탑재될 수 있다. 도 2는 일 실시예에 따른 뉴럴 네트워크 장치에서 수행되는 처리 과정을 설명하기 위한 도면이다. 도 2를 참조하면, 뉴럴 네트워크 장치(예: 도 1의 뉴럴 네트워크 장치)에 뉴럴 네트워크 레이어의 입력 과 뉴럴 네트워크의 가중치가 주어진다. 입력과 가중치는 다차원 배열(n-dimensional array)의 데이터 구조인 텐서(tensor) 데이터 구조를 가질 수 있다. 입력은 이진화(binarization) 및 양자화(Quantization)되어 이진화 및 양자화된 입력이 생성될 수 있다. 이진화 및 양자화된 입력는 뉴럴 네트워크 장치에 포함된 랜덤 액세스 메모리(예: 도 1의 랜덤 액 세스 메모리)의 크로스바 어레이 구조에 대응되도록 분할되어 분할된 입력들이 생성될 수 있다. 이와 유사하게, 가중치도 이진화 및 양자화되어 이진화 및 양자화된 가중치이 생성될 수 있다. 이진 화 및 양자화된 가중치는 랜덤 액세스 메모리의 크로스바 어레이 구조에 대응되도록 분할되어 분할된 가중치들이 생성될 수 있다. 이와 같이, 이진화 및 양자화된 입력과 이진화 및 양자화된 가중치 는 각각 랜덤 액세스 메모리의 크로스바 어레이 구조의 크기에 맞게 분할될 수 있다. 분할된 입력들과 분할된 가중치들이 랜덤 액세스 메모리의 크로스바 어레이 구조에 입력되고, 랜덤 액세스 메모리에서 분할된 입력들과 분할된 가중치들을 기초로 연산이 수행될 수 있다. 연산 은 아날로그 영역에서 수행되고, 예를 들어 컨볼루션 연산에 해당할 수 있다. 각 연산의 수행 결과 로서, 랜덤 액세스 메모리로부터 아날로그 값의 부분 합들이 생성되고, 아날로그 값의 부분 합들은 ADC 회로(예: 도 1의 ADC 회로)에 입력될 수 있다. ADC 회로는 아날로그 값의 부분 합들을 각각 디 지털 값으로 변환하여 디지털 값의 부분 합들을 생성할 수 있다. 이렇게 생성된 디지털 값의 부분 합들은 누적(accumulation)되고, 누적 결과로서 최종 출력에 대응하는 디지털 출력 신호가 생성될 수 있다. 도 3은 일 실시예에 따른 RCA 구조를 포함하는 뉴럴 네트워크 장치의 구조를 도시하는 도면이다. 도 3을 참조하면, 저항 메모리 크로스바 어레이(RCA) 구조를 포함하는 뉴럴 네트워크 장치의 구조가 도시 되어 있다. 뉴럴 네트워크 장치의 구조는 도 1의 뉴럴 네트워크 장치가 랜덤 액세스 메모리로서 저 항 메모리(ReRAM)을 가지는 구조에 대응할 수 있다. 저항 메모리는 크기가 컴팩트(compact)하고, 연 산이 빠르다는 장점이 있다. 일 실시예에서, 저항 메모리는 디지털 값의 입력을 아날로그 값으로 변환하는 디지털-아날로그 컨버터 (digital-to-analog converter; DAC)들, 저(low) 저항 상태 또는 고(high) 저항 상태인지 여부를 기초로 데이터를 저장하는 크로스바 어레이 구조, 및 크로스바 어레이 구조에서의 아날로그 값을 샘플링 (sampling)하고 홀드(hold)하는 샘플 및 홀드 회로들을 포함할 수 있다. 저항 메모리는 저항 메모리 의 행 라인들(row lines)로 입력되는 입력과 저항 메모리의 열 라인들(column lines)로 입력되는 가 중치 간의 연산을 수행하고, 아날로그 값의 부분 합들을 생성할 수 있다. 저항 메모리의 출력인 아날로그 값의 부분 합들은 아날로그 곱셈기들에 전달되고, 아날로그 곱셈기들 은 설정된 스케일 요소에 기초하여 아날로그 값의 부분 합들을 스케일링할 수 있다. 아날로그 곱셈기들 는 아날로그 영역에서 아날로그 값의 부분 합들에 스케일 요소(예: 1/s)를 곱할 수 있다. 아날로그-디지 털 컨버터(ADC) 회로들은 아날로그 값의 부분 합들을 각각 디지털 값으로 변환하여 디지털 값의 부분 합들 을 생성할 수 있다. 디지털 곱셈기들은 ADC 회로들에서 생성된 디지털 값의 부분 합들을 스케일링할 수 있다. 디지털 곱셈기들은 디지털 값의 부분 합들에 스케일 요소(예: s)를 곱할 수 있다. 스케일링된 디지털 값의 부분 합들은 누적되어 최종의 디지털 출력 신호가 생성될 수 있다. 도 4는 일 실시예에 따른 가중치를 분할하는 것을 설명하기 위한 도면이다. 도 4를 참조하면, 일 실시예로서 컨볼루션 레이어에서 텐서 데이터 구조를 가지는 가중치가 랜덤 액세스 메모리의 크로스바 어레이 구조에 대응되도록 분할되는 것을 도시한다. 컨볼루션 레이어를 크로스바 어레이 구조에 맵핑(mapping)하기 위한 다양한 방법들이 있다. 해당 방법들은 가 중치의 3차원 구조를 어떻게 평면화하고, 크로스바 어레이 구조의 입력 행(input rows)에 어떻게 맵핑 (mapping)하는지에 따라 다양할 수 있다. 컨볼루션 레이어를 크로스바 어레이 구조에 맵핑하는 경우, 텐서 데 이터 구조를 가지는 가중치를 예를 들어 P 개 이하의 입력 채널을 가지는 여러 개의 1 X 1 컨볼루션들로 분할할 수 있다. 이용되는 필터(filter)는 예를 들어 K X K(도시된 예에서, K=3)의 필터 크기(filter size)를 가질 수 있다. 각 분할된 가중치 블록은 1 X 1 X P의 형태를 가질 수 있다. P는 크로스바 어레이 구조의 입력 행의 개수를 나타내고, Cin은 입력 채널의 개수를 나타낸다. P X P는 크로스바 어레이 구조의 크기에 대응할 수 있다. 도 5는 일 실시예에 따른 ADC 회로를 도시하는 도면이다. 도 5를 참조하면, ADC 회로(예: 도 1의 ADC 회로)의 일례로서 플래쉬(flash) ADC 회로가 도시되어 있다. ADC 회로는 복수의 저항기들(512, 514, 516, 518), 비교기들(522, 524, 526) 및 인코더를 포 함할 수 있다. ADC 회로에서 기준 신호(예: 기준 전압) Vref로부터 직렬로 연결된 저항기들(512, 514, 516, 518)에 의해 서로 다른 전압들이 생성되고, 각각의 서로 다른 전압은 비교기들(522, 524, 526) 각각에 입력된다. 서로 다른 전압들의 전압 값은 저항기들(512, 514, 516, 518)의 연결 관계를 기초로 전압 분배 법칙에 의해 결정될 수 있 다. 기준 신호 Vref는 제1 ADC 스케일러(예: 도 1의 제1 ADC 스케일러)에 의해 조절될 수 있다. 제1 ADC 스케 일러는 기준 신호 Vref에 스케일 요소를 적용하여 기준 신호 Vref를 스케일링할 수 있다. 제1 ADC 스케일러의 스케일 요소는 뉴럴 네트워크의 가중치를 학습하는 과정에서 가중치와 함께 학습되어 결정될 수 있다. 이와 같이, 아날로그 영역의 스케일러인 제1 ADC 스케일러를 기준 신호 Vref를 이용하는 것으로 구현함으로써, ADC 회 로를 양자화기로 대체하면서 면적 비용(area cost)을 발생시키지 않을 수 있다. 기준 신호 Vref를 조정하 는 것에 의해 아날로그 곱셈기(analog multiplier)를 사용하지 않고도 아날로그 영역에서의 스케일링을 구현할 수 있다. 비교기들(522, 524, 526)에는 각각 랜덤 액세스 메모리(예: 도 1의 랜덤 액세스 메모리)로부터 출력된 아 날로그 값의 아날로그 출력 신호(예: 아날로그 전압 신호) Vin과 기준 신호 Vref로부터 생성된 서로 다른 전압 이 입력된다. 비교기들(522, 524, 526)은 각각 입력된 아날로그 전압 신호와 기준 신호 Vref와 저항기들(512, 514, 516, 518)로부터 생성된 기준 전압 신호를 비교하여, 그 대소 관계에 따라 하이 레벨(high level) 또는 로 우 레벨(low level)의 출력 값을 출력할 수 있다. 비교기들(522, 524, 526)의 출력 값은 인코더에 전달되고, 인코더는 비교기들(522, 524, 526)의 출 력 값에 기초하여 디지털 값의 디지털 출력 신호를 출력할 수 있다. 인코더는 예를 들어 전가산기(full adder)와 가산기(adder)의 조합으로 구성될 수 있고, 비교기들(522, 524, 526)의 출력 값을 2진 코드로 변환하 여 출력할 수 있다. 해당 2진 코드를 병렬 출력으로 출력시키는 것에 의해 ADC 회로의 최종 디지털 출력 신호가 생성될 수 있다. 도 6a 및 도 6b는 일 실시예에 따른 양자화 기법에 기초하여 스케일 요소를 도출하는 것을 설명하기 위한 도면 들이다. 뉴럴 네트워크 장치에 의해 구현되는 뉴럴 네트워크(예: 딥 뉴럴 네트워크(DNN))의 성능을 최적화하기 위한 제1 ADC 스케일러 및 제2 ADC 스케일러의 파라미터(예: 스케일 요소)를 결정하는 방법이 제공된다. ADC의 면적을 줄이기 위한 문제(ADC 감소 문제, ADC reduction problem)를 양자화 문제로 봄으로써, 제안 기술은 RCA 구조를 가지는 뉴럴 네트워크 장치에서 ADC의 정밀도(precision)를 최적화할 수 있다. 제1 단계는 뉴럴 네트워크 그래프를 변환하는 단계로서, 제1 단계에서는 도 6a에 도시된 것과 같이 뉴럴 네트워 크(예: DNN) 그래프를 RCA 블록들과 ADC 블록들로 맵핑하여 변환한다. 뉴럴 네트워크의 가중치 행렬 을 RCA 행렬로 분할(partitioning)하는 것은 가중치-RCA 맵핑(weight-to-RCA mapping)이라고 하며, 가중치-RCA 맵핑은 가중치의 정밀도, 저항 메모리의 셀 정확도(cell precision), RCA 크기, 가중치 텐서의 차원 및 가중치 의 처리 방법 등에 의존한다. 뉴럴 네트워크의 완전 연결 레이어(fully-connected layer)는 도 6a에 도시된 것 과 같은 RCA 블록들에 맵핑될 수 있다. RCA 블록들은 아날로그 값을 처리하여 출력하기 때문에 RCA 블록들에 ADC 블록들이 연결되고, 그 뒤에 각각의 ADC 블록들로부터 출력된 디지털 값을 합산 (summation)(또는 누적)하는 합산 블록이 배치된다. 제2 단계에서는 도 6b에 도시된 것과 같이 ADC 블록들을 양자화기 quantizer, Q) 블록들로 대체한다. 제2 단계에서는, 파라미터들을 최적화하여 제1 단계에서 변환된 뉴럴 네트워크 그래프에 양자화를 적용한다. 양자화기 블록들은 제1 ADC 스케일러(예: 도 1의 제1 ADC 스케일러) 및 제2 ADC 스케일러(예: 도 1의 제2 ADC 스케일러)를 시뮬레이션하는 기능을 수행할 수 있다. 양자화기 블록들은 RCA 블록들의 출력 값을 양자화하고, 입력 값의 스케일을 복원한다. 양자화기 블록들에서는 예를 들어 다음의 수학식 1 과 같은 연산이 수행될 수 있다. 수학식 1"}
{"patent_id": "10-2021-0161287", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기서, 는 양자화의 대상이 되는 입력 값이고, 는 양자화된 입력 값을 나타낸다. 는 수학식 1 연산의 결과 값을 나타내고, s는 스케일 요소(또는 단계 크기)의 파라미터를 나타낸다. b는 ADC의 정밀도(비트 수)를 나타낸다. 는 라운드 연산(round operation)을 나타내고,clip(x, a, b) = min(max(x, a), b)의 연산을 나타 낸다. 스케일 요소 s는 뉴럴 네트워크의 학습 과정 또는 다른 방법(예: 통계적인 방법)을 통해 결정될 수있다. RCA 블록들의 출력 신호(예: 아날로그 값의 출력 전압)에 대응하는 가 스케일 요소 s에 나누어 진다. 이 과정은 제1 ADC 스케일러에 의해 ADC 회로의 기준 전압 Vref(예: 도 5의 기준 전압 Vref)을 1/s 배로 조정하는 것에 의해 구현될 수 있다. ADC 회로의 기준 전압 Vref을 조정함으로써, 아날로그 곱셈기를 사용하지 않고도 아날로그 영역에서의 스케일링을 구현할 수 있게 된다. 제3 단계에서는, 양자화된 뉴럴 네트워크를 다시 RCA 기반 뉴럴 네트워크(예: RCA 기반 가속기)로 다시 맵핑한 다. 양자화 블록들에서는 수학식 1의 라운드 연산의 전과 후에 수행되는 2개의 스케일링 연산들이 있다. 라운드 연산 전에 수행되는 아날로그 영역에서의 스케일링 연산(제1 ADC 스케일러에 의해 수행됨)과 라운드 연 산 후에 수행되는 디지털 영역에서의 스케일링 연산(제2 ADC 스케일러에 의해 수행됨)이다. 스케일 요소의 파 라미터는 뉴럴 네트워크의 전체 레이어, 출력 채널 또는 각각의 RCA 구조 내에서 공유될 수 있다. 전체 레이어 에서 동일한 스케일 요소를 사용하는 경우 스케일링 오버헤드를 줄일 수 있다. 또는, 스케일 요소의 파라미터 가 공유되지 않을 수도 있으며, 이 경우 제1 ADC 스케일러의 스케일 요소는 고유한 값을 가질 수도 있다. 도 7은 일 실시예에 따른 뉴럴 네트워크 장치에 의해 수행되는 처리 방법의 동작들을 도시하는 흐름도이다. 처 리 방법의 동작들은 본 명세서에서 설명되는 뉴럴 네트워크 장치(예: 도 1의 뉴럴 네트워크 장치)에 의해 수행될 수 있다. 도 7을 참조하면, 동작에서 뉴럴 네트워크 장치는 입력과 가중치를 수신할 수 있다. 입력과 가중치는 각 각 양자화(이진화도 수행될 수 있음)되고, 랜덤 액세스 메모리(예: 도 1의 랜덤 액세스 메모리)의 크로스 바 어레이 구조에 대응되도록 분할된 것일 수 있다. 동작에서, 뉴럴 네트워크 장치는 크로스바 어레이 구조의 랜덤 액세스 메모리를 통해, 입력과 가중치에 기 초하여 아날로그 출력 신호를 생성할 수 있다. 랜덤 액세스 메모리는 각각 양자화되고 분할된 입력과 가중치 간의 연산에 의해 생성된 아날로그 값의 부분 합들을 생성할 수 있다. 동작에서, 뉴럴 네트워크 장치는 제1 ADC 스케일러(예: 도 1의 제1 ADC 스케일러)를 통해 아날로그 영역에서 기준 신호를 스케일 요소로 나누는 것에 의해 스케일링된 기준 신호를 생성할 수 있다. 여기서, 기준 신호는 ADC 회로에서 아날로그 출력 신호에 비교 대상이 되는 기준 전압에 대응할 수 있다. 동작에서, 뉴럴 네트워크 장치는, 아날로그-디지털 컨버터(ADC) 회로(예: 도 1으 ADC 회로)를 통해, 제1 ADC 스케일러에 의해 스케일링된 기준 신호와 랜덤 액세스 메모리의 아날로그 출력 신호에 기초하여 디지털 출력 신호를 생성할 수 있다. ADC 회로는 아날로그 값의 부분 합들을 디지털 값으로 변환하여 디지털 값의 부 분 합들을 생성하고, 디지털 값의 부분 합들을 누적하여 디지털 출력 신호를 생성할 수 있다. 동작에서, 뉴럴 네트워크 장치는 제2 ADC 스케일러(예: 도 1의 제2 ADC 스케일러)를 통해, ADC 회로 에 의해 생성된 디지털 출력 신호에 대한 스케일링을 수행할 수 있다. 제2 ADC 스케일러는 디지털 영역에서 디 지털 출력 신호에 스케일 요소를 곱하는 것에 의해 디지털 출력 신호를 조정할 수 있다. 일 실시예에서, 제1 ADC 스케일러와 제2 ADC 스케일러는 서로 동일한 스케일 요소를 가질 수 있다. 이상에서 설명된 실시예들은 하드웨어 구성요소, 소프트웨어 구성요소, 및/또는 하드웨어 구성요소 및 소프트웨 어 구성요소의 조합으로 구현될 수 있다. 예를 들어, 실시예들에서 설명된 장치, 방법 및 구성요소는, 예를 들 어, 프로세서, 콘트롤러, ALU(arithmetic logic unit), 디지털 신호 프로세서(digital signal processor), 마 이크로컴퓨터, FPGA(field programmable gate array), PLU(programmable logic unit), 마이크로프로세서, 또는 명령(instruction)을 실행하고 응답할 수 있는 다른 어떠한 장치와 같이, 범용 컴퓨터 또는 특수 목적 컴퓨터를 이용하여 구현될 수 있다. 처리 장치는 운영 체제(OS) 및 상기 운영 체제 상에서 수행되는 소프트웨어 애플리 케이션을 수행할 수 있다. 또한, 처리 장치는 소프트웨어의 실행에 응답하여, 데이터를 접근, 저장, 조작, 처 리 및 생성할 수도 있다. 이해의 편의를 위하여, 처리 장치는 하나가 사용되는 것으로 설명된 경우도 있지만,"}
{"patent_id": "10-2021-0161287", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "해당 기술분야에서 통상의 지식을 가진 자는, 처리 장치가 복수 개의 처리 요소(processing element) 및/또는 복수 유형의 처리 요소를 포함할 수 있음을 알 수 있다. 예를 들어, 처리 장치는 복수 개의 프로세서 또는 하 나의 프로세서 및 하나의 컨트롤러를 포함할 수 있다. 또한, 병렬 프로세서(parallel processor)와 같은, 다른 처리 구성(processing configuration)도 가능하다. 소프트웨어는 컴퓨터 프로그램(computer program), 코드(code), 명령(instruction), 또는 이들 중 하나 이상의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결합적으로 (collectively) 처리 장치를 명령할 수 있다. 소프트웨어 및/또는 데이터는, 처리 장치에 의하여 해석되거나 처리 장치에 명령 또는 데이터를 제공하기 위하여, 어떤 유형의 기계, 구성요소(component), 물리적 장치, 가상 장치(virtual equipment), 컴퓨터 저장 매체 또는 장치에 영구적으로, 또는 일시적으로 구체화(embody)될 수 있 다. 소프트웨어는 네트워크로 연결된 컴퓨터 시스템 상에 분산되어서, 분산된 방법으로 저장되거나 실행될 수 도 있다. 소프트웨어 및 데이터는 컴퓨터 판독 가능 기록 매체에 저장될 수 있다. 실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단 독으로 또는 조합하여 저장할 수 있으며 매체에 기록되는 프로그램 명령은 실시예를 위하여 특별히 설계되고 구 성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 위에서 설명한 하드웨어 장치는 실시예의 동작을 수행하기 위해 하나 또는 복수의 소프트웨어 모듈로서 작동하 도록 구성될 수 있으며, 그 역도 마찬가지이다."}
{"patent_id": "10-2021-0161287", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "이상과 같이 실시예들이 비록 한정된 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가진 자라면 이를 기초로 다양한 기술적 수정 및 변형을 적용할 수 있다. 예를 들어, 설명된 기술들이 설명된 방법과 다른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다. 그러므로, 다른 구현들, 다른 실시예들 및 특허청구범위와 균등한 것들도 후술하는 특허청구범위의 범위에 속한 다.도면 도면1 도면2 도면3 도면4 도면5 도면6a 도면6b 도면7"}
{"patent_id": "10-2021-0161287", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 따른 뉴럴 네트워크 장치의 구성들을 도시하는 블록도이다. 도 2는 일 실시예에 따른 뉴럴 네트워크 장치에서 수행되는 처리 과정을 설명하기 위한 도면이다. 도 3은 일 실시예에 따른 RCA 구조를 포함하는 뉴럴 네트워크 장치의 구조를 도시하는 도면이다. 도 4는 일 실시예에 따른 가중치를 분할하는 것을 설명하기 위한 도면이다. 도 5는 일 실시예에 따른 ADC 회로를 도시하는 도면이다. 도 6a 및 도 6b는 일 실시예에 따른 양자화 기법에 기초하여 스케일 요소를 도출하는 것을 설명하기 위한 도면 들이다. 도 7은 일 실시예에 따른 뉴럴 네트워크 장치에 의해 수행되는 처리 방법의 동작들을 도시하는 흐름도이다."}
