{"patent_id": "10-2024-0028743", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0133941", "출원번호": "10-2024-0028743", "발명의 명칭": "VR 눈의 피로 수준을 검출하기 위해 시선 추적/눈 메트릭을 사용한 다음 눈의 피로 수준을 낮", "출원인": "주식회사 소니 인터랙티브 엔터테인먼트", "발명자": "에드워드 청"}}
{"patent_id": "10-2024-0028743", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "비디오 게임(video game)과의 상호작용 동안 헤드 마운트 디스플레이(HMD)의 사용자를 지원하는 방법에 있어서,상기 사용자가 상기 HMD의 디스플레이 화면에 렌더링된(rendered) 게임 콘텐츠와 상호작용할 때 사용자의 눈의피로 지표(eye strain indicator)를 모니터링하는 단계-여기서, 상기 눈의 피로 지표는 상기 사용자가 동작하고있는 물리적 환경 내에 분산된 복수의 센서에 의해 캡처된(captured) 상기 사용자의 눈의 이미지 및 기타 얼굴피쳐(feature)로부터 수집됨-;상기 복수의 센서로부터 수집된 상기 눈의 피로 지표를 사용하여 상기 사용자에 대한 눈의 피로 메트릭(eyestrain metric)을 계산하는 단계-여기서, 상기 눈의 피로 메트릭은 상기 사용자가 상기 게임 콘텐츠와 상호작용할 때 상기 사용자가 경험하는 눈의 피로의 수준을 결정하는 데 사용됨-;상기 사용자에 대해 계산된 상기 눈의 피로 메트릭에 기초하여 상기 게임 콘텐츠에 대해 수행될 액션(action)을식별하는 단계-여기서, 상기 액션은 조정될 필요가 있는 상기 게임 콘텐츠와 연관된 하나 이상의 렌더링 속성과상기 하나 이상의 렌더링 속성을 조정하기 위한 커맨드(command)를 식별함-; 및상기 액션을 상기 비디오 게임에 포워딩(forwarding)하는 단계를 포함하고, 상기 액션 수신에 응답하는 상기 비디오 게임은 상기 사용자에게 제시되는 상기 게임 콘텐츠의 상기 하나 이상의 렌더링 속성을 조정하기 위한 상기 커맨드를 실행하고, 상기 하나 이상의 렌더링 속성에 대한 상기 조정은 상기 사용자의 상기 눈의 피로를 줄이기 위해 정의되고,상기 방법의 동작은 컴퓨터의 프로세서에서 실행되는 눈의 피로 검출기 엔진(230)에 의해 수행되는, 방법."}
{"patent_id": "10-2024-0028743", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 눈의 피로 검출기 엔진은 상기 사용자에게 상기 게임 콘텐츠를 제공하는 상기 비디오 게임에 통신 가능하게 연결된 상기 컴퓨터의 운영 체제 내에 통합되거나 상기 게임 콘텐츠를 제공하는 상기 비디오 게임 내에 통합되는, 방법."}
{"patent_id": "10-2024-0028743", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 커맨드는 상기 게임 콘텐츠의 후속 부분이 상기 사용자의 눈의 피로를 유발할 가능성이있는 상기 하나 이상의 렌더링 속성을 포함하고 있음을 검증한 후 상기 게임 콘텐츠의 상기 후속 부분의 상기하나 이상의 렌더링 속성을 조정하기 위해 실행되는, 방법."}
{"patent_id": "10-2024-0028743", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 사용자의 상기 눈의 피로 메트릭은 상기 사용자가 상기 게임 콘텐츠와 상호작용하는 데소비한 시간의 함수로 계산되는, 방법."}
{"patent_id": "10-2024-0028743", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 모니터링되는 눈의 피로 지표는 직접적인 눈의 피로 지표와 간접적인 눈의 피로 지표를포함하고, 상기 직접적인 눈의 피로 지표는 상기 복수의 센서에 의해 캡처된 이미지로부터 결정되고, 상기 간접적인 눈의 피로 지표는 상기 직접적인 눈의 피로 지표로부터 도출되는, 방법."}
{"patent_id": "10-2024-0028743", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 눈의 피로 메트릭은 상기 눈의 피로 지표를 사용하는 머신 러닝 엔진(machine learningengine)에 의해 생성 및 훈련된 눈의 피로 인공 지능(AI) 모델을 사용하여 계산되는, 방법."}
{"patent_id": "10-2024-0028743", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2024-0133941-3-제6항에 있어서, 상기 머신 러닝 엔진은 상기 사용자로부터 수집된 상기 눈의 피로 지표의 각각을 식별하고 고유한 가중치를 적용하고 상기 눈의 피로 AI 모델은 상기 눈의 피로 메트릭을 계산할 때 상기 눈의 피로 지표의각각에 따른 상대적 가중치를 고려하도록 구성되는, 방법."}
{"patent_id": "10-2024-0028743", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서, 상기 눈의 피로 AI 모델은 상기 게임 콘텐츠의 제1 부분을 렌더링하는 동안 상기 사용자로부터수집된 상기 눈의 피로 지표를 사용하여 상기 게임 콘텐츠의 상기 제1 부분에 대한 상기 눈의 피로 메트릭을 계산하는 데 사용되고, 및상기 눈의 피로 AI 모델 및 상기 눈의 피로 메트릭은 상기 게임 콘텐츠의 제2 부분과의 상호작용 동안 상기 사용자로부터 수집된 상기 눈의 피로 지표에서 검출된 변화에 따라 업데이트되고, 상기 사용자의 상기 눈의 피로지표의 상기 변화는 상기 게임 콘텐츠의 상기 제2 부분을 표시하는데 사용되는 상기 렌더링 속성에서 검출된 변화와 상관되는, 방법."}
{"patent_id": "10-2024-0028743", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서, 상기 눈의 피로 지표는 상기 사용자와 상기 게임 콘텐츠의 상호작용 동안 주기적으로 모니터링되고 수집되는, 방법."}
{"patent_id": "10-2024-0028743", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서, 상기 게임 콘텐츠의 상기 렌더링 속성을 조정하기 위한 상기 액션에 포함된 상기 커맨드는 상기 게임 콘텐츠의 상기 렌더링 속성을 점진적으로 조정하기 위한 명령어를 포함하는, 방법."}
{"patent_id": "10-2024-0028743", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서, 상기 게임 콘텐츠의 상기 렌더링 속성을 조정하는 데 사용되는 상기 눈의 피로 메트릭을 계산하는 단계는,복수의 요소를 갖는 기준의 메트릭스를 정의하는 단계-여기서, 상기 매트릭스의 상기 복수의 요소 중 각각의 요소는 하나 이상의 눈의 피로 지표를 포함하는 기준에 의해 정의되며, 상기 하나 이상의 눈의 피로 지표 중 각각의 눈의 피로 지표는 상기 게임 콘텐츠의 일부를 표시하는 데 사용되는 하나 이상의 렌더링 속성에 의해 영향을받음-;상기 매트릭스의 상기 기준을 정의하는데 사용되는 상기 각각의 눈의 피로 지표에 가중치를 할당하는 단계-여기서, 상기 가중치는 상기 각각의 눈의 피로 지표가 상기 사용자의 상기 눈의 피로를 유발하는 데 미치는 영향 정도에 기초하여 할당됨-; 및상기 매트릭스의 개별의 요소를 정의하는데 사용되는 상기 각각의 눈의 피로 지표에 할당된 가중치의 함수로서상기 매트릭스의 상기 각각의 요소에 대한 복합 값(composite value)을 계산하는 단계를 포함하고, 상기 복합값은 상기 게임 콘텐츠의 상기 부분과의 상호작용 동안 상기 사용자가 경험하는 상기 눈의 피로를 야기하는데있어서 상기 각각의 눈의 피로 지표가 갖는 영향 정도를 정량화하는(quantifying), 방법."}
{"patent_id": "10-2024-0028743", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 상기 각각의 기준은 상기 각각의 기준을 정의하는 데 사용되는 상기 각 눈의 피로 지표에 대한 시간 영향을 고려하도록 정의되고, 및상기 각각의 기준을 정의하는데 사용된 상기 시간은 상호작용 시간 및 상기 눈의 피로 지표가 상기 사용자로부터 수집될 때 상기 게임 콘텐츠의 표시 동안 상기 각각의 눈의 피로 지표에 대응하는 상기 렌더링 속성 중 특정속성이 유효한 시간의 양을 포함하는, 방법."}
{"patent_id": "10-2024-0028743", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서, 상기 눈의 피로 메트릭을 계산하는 단계는,상기 게임 콘텐츠의 상기 부분 다음에 상기 사용자를 위해 렌더링될 가능성이 있는 상기 게임 콘텐츠의 후속 부분을 예측하는 단계-여기서, 상기 후속 부분은 상기 비디오 게임의 상기 부분과 연관된 게임 상태 및 상기 사용공개특허 10-2024-0133941-4-자에 의해 제공되는 게임 입력에 기초하여 예측됨-;그 안에 포함된 상기 렌더링 속성을 결정하기 위해 발생할 것으로 예측되는 상기 게임 콘텐츠의 상기 후속 부분을 평가하는 단계; 및상기 게임 콘텐츠의 상기 부분에 이어서 상기 사용자에게 렌더링될 것으로 예측되는 상기 게임 콘텐츠의 상기후속 부분과의 상호작용 동안 사용자에 의해 나타날 가능성이 있는 눈의 피로 지표를 예측하는 단계를포함하고, 상기 후속 부분에 대한 상기 눈의 피로 지표의 상기 예측은 상기 게임 콘텐츠의 상기 부분의 상기 눈의 피로 지표와 상기 게임 콘텐츠의 상기 후속 부분에 포함된 상기 렌더링 속성에 기초하고, 상기 후속 부분에대한 상기 예측된 눈의 피로 지표는 상기 사용자에 대해 계산된 상기 눈의 피로 메트릭을 업데이트하는 데 사용되고,상기 예측된 눈의 피로 지표는 상기 게임 콘텐츠의 상기 후속 부분의 상기 렌더링 속성을 동적으로 조정하기 위한 새로운 액션을 사전에 생성하는 데 사용되고, 상기 후속 부분의 상기 렌더링 속성에 대한 상기 조정은 상기사용자의 눈의 피로를 줄이기 위해 정의되는, 방법."}
{"patent_id": "10-2024-0028743", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서, 상기 새로운 액션은 상기 게임 콘텐츠의 상기 후속 부분과의 상호작용 동안 상기 사용자에 의해 나타날 것으로 예상되는 상기 눈의 피로 지표와 대응하는 상기 렌더링 속성을 포함하도록 식별되고, 상기 새로운 액션은 상기 후속 부분의 상기 눈의 피로 지표에 대응하는 상기 하나 이상의 렌더링 속성이 조정될 양을식별하고, 각각의 상기 하나 이상의 렌더링 속성의 조정량은 상기 눈의 피로 지표 중 상기 하나 이상이 미리 정의된 임계치를 초과하는 양에 따라 정의되는, 방법."}
{"patent_id": "10-2024-0028743", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11항에 있어서, 상기 기준의 매트릭스는 상기 비디오 게임에 대해 구체적으로 정의되고, 상기 비디오 게임과연관된 유형 및 상기 비디오 게임의 상기 게임 콘텐츠와 연관된 상기 렌더링 속성에 따라 정의되는, 방법."}
{"patent_id": "10-2024-0028743", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제11항에 있어서, 상기 식별된 액션은 상기 사용자에게 특정하며 상기 게임 콘텐츠와 연관된 상기 렌더링 속성및 상기 사용자로부터 수집된 상기 눈의 피로 지표에 따라 정의되는, 방법."}
{"patent_id": "10-2024-0028743", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제1항에 있어서, 상기 사용자가 상기 게임 콘텐츠와 상호작용하는 동안 상기 사용자로부터 오디오 입력을 수신하는 단계를 더 포함하고, 상기 오디오 입력은 상기 사용자로부터 수집한 상기 눈의 피로 지표로부터 결정된 상기 눈의 피로 메트릭을 강화하기 위한 추가 입력으로서 사용되는, 방법."}
{"patent_id": "10-2024-0028743", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제1항에 있어서, 상기 액션은 사용자에게 렌더링하기 위한 제안을 포함하고 상기 제안은 상기 사용자에게 상기비디오 게임의 상태를 알리고 경고를 포함하기 위해 팝업 윈도우(pop-up window)에 제공되는, 방법."}
{"patent_id": "10-2024-0028743", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제1항에 있어서, 상기 눈의 피로 메트릭은 상기 사용자의 상기 눈의 피로 지표의 베이스라인 수준을 확립하기위해 상기 HMD를 착용하지 않을 때 상기 사용자의 상기 눈의 피로 지표를 교정하고 눈의 피로를 나타내는 상기눈의 피로 메트릭과 상기 사용자가 경험하는 눈의 피로 수준을 계산하기 위해 상기 사용자가 상기 게임 콘텐츠와 상호작용할 때 상기 사용자로부터 수집된 눈의 피로 지표의 각각을 상기 사용자에 대해 교정된 상기 베이스라인 수준 눈의 피로 지표 중 대응하는 지표와 비교함으로써 계산되며,상기 사용자에 대해 교정된 상기 눈의 피로 지표의 상기 베이스라인 수준은 상기 사용자에 대해 특정한, 방법."}
{"patent_id": "10-2024-0028743", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "비디오 게임과의 상호작용 동안 헤드 마운트 디스플레이(HMD)의 사용자를 지원하는 방법에 있어서,상기 사용자가 게임 콘텐츠의 제1 부분과 상호작용할 때 상기 사용자의 눈의 피로 지표를 모니터링하는 단계-여공개특허 10-2024-0133941-5-기서, 상기 눈의 피로 지표는 상기 사용자가 동작하고 있는 물리적 환경 내에 분산된 복수의 센서로부터 수집됨-;상기 사용자가 상기 게임 콘텐츠의 상기 제1 부분과 상호작용할 때 상기 복수의 센서로부터 수집된 상기 눈의피로 지표를 사용하여 상기 사용자에 대한 눈의 피로 메트릭을 계산하는 단계-여기서, 상기 눈의 피로 메트릭은상기 사용자가 상기 제1 부분과 상호작용할 때 상기 사용자가 경험하는 눈의 피로 수준을 결정하는 데 사용됨-;제2 부분이 상기 사용자에게 눈의 피로를 유발하는 것으로 알려진 하나 이상의 렌더링 속성을 포함하는지 결정하기 위해 상기 제1 부분 이후에 발생할 것으로 예측되는 상기 게임 콘텐츠의 상기 제2 부분을 식별하고 검사하는 단계-여기서, 상기 제2 부분은 상기 제1 부분에 포함된 상기 게임 콘텐츠의 게임 상태와 상기 제1 부분에 있는 상기 사용자의 상호작용성에 기초하여 식별됨-;상기 눈의 피로를 유발할 가능성이 있는 상기 비디오 게임의 상기 제2 부분에 포함된 상기 게임 콘텐츠의 상기하나 이상의 렌더링 속성 중 선택 속성을 조정하기 위한 커맨드를 포함하는 액션을 상기 비디오 게임에 포워딩하는 단계-여기서, 상기 액션은 상기 게임 콘텐츠의 상기 제1 부분을 표시하는 데 사용되는 상기 하나 이상의렌더링 속성과 상기 제2 부분에 포함된 상기 게임 콘텐츠에 대해 식별된 상기 하나 이상의 렌더링 속성에 기초하여 식별됨-; 및상기 제2 부분의 상기 게임 콘텐츠가 상기 제1 부분의 상기 게임 콘텐츠의 렌더링에 이어 렌더링을 위해 선택되도록 검출된 경우 그리고 상기 액션을 수신한 것에 응답하여, 렌더링을 위해 상기 제2 부분의 상기 게임 콘텐츠를 상기 HMD에 포워딩하기 전에, 상기 제2 부분에 포함된 상기 게임 콘텐츠에 대한 상기 하나 이상의 렌더링 속성 중 선택 속성을 동적으로 조정하기 위해 상기 비디오 게임에서 상기 커맨드를 실행하는 단계를 포함하고,상기 방법의 동작은 컴퓨팅 시스템의 프로세서에서 실행되는 눈의 피로 검출기 엔진에 의해 수행되는, 방법."}
{"patent_id": "10-2024-0028743", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제20항에 있어서, 상기 눈의 피로 지표는 상기 게임 콘텐츠의 상기 제1 부분에 있는 상기 게임 콘텐츠의 하나이상의 렌더링 속성과 대응하는, 방법."}
{"patent_id": "10-2024-0028743", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제21항에 있어서, 상기 액션을 비디오 게임에 포워딩하는 단계는,상기 제1 부분과 상기 제2 부분에 포함된 상기 게임 콘텐츠의 상기 하나 이상의 렌더링 속성을 식별하는 단계;상기 제1 부분과 상기 제2 부분에 포함된 상기 게임 콘텐츠와 연관된 상기 렌더링 속성을 사용하여 상기 사용자에 대한 제2 세트의 눈의 피로 메트릭을 계산하는 단계; 및상기 제1 부분 및 상기 제2 부분의 상기 게임 콘텐츠에 대해 계산된 상기 제2 세트의 눈의 피로 메트릭으로부터결정된 눈의 피로 수준이 상기 제1 부분의 상기 게임 콘텐츠에 대해 계산된 상기 눈의 피로 메트릭으로부터 결정된 눈의 피로 수준 이상인 경우 렌더링을 위해 상기 제2 부분의 상기 게임 콘텐츠를 상기 HMD에 포워딩하기전에 상기 제2 부분의 상기 게임 콘텐츠의 렌더링 속성을 조정하기 위해 상기 제1 부분과 제2 부분에 포함된 상기 게임 콘텐츠의 상기 렌더링 속성에 대응하는 상기 액션을 식별하고 포워딩하는 단계를 포함하는, 방법."}
{"patent_id": "10-2024-0028743", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "비디오 게임의 게임 콘텐츠와 상호작용하는 동안 사용자에게 지원을 제공하기 위한 방법 및 시스템은 사용자가 게임 콘텐츠와 상호작용하는 동안 사용자의 눈의 피로 지표를 모니터링하는 것을 포함한다. 눈의 피로 측정 메트 릭은 사용자를 위해 수집된 눈의 피로 지표를 사용하여 계산된다. 비디오 게임에서 수행하는 동작은 눈의 피로 측정 메트릭을 기초로 식별된다. 식별된 동작은 비디오 게임으로 포워딩되며, 비디오 게임은 이를 수신하면 사용 자에게 제공되는 게임 콘텐츠의 하나 이상의 렌더링 속성을 조정하기 위한 커맨드를 실행한다. 조정은 사용자의 눈의 피로를 줄이기 위해 정의된다."}
{"patent_id": "10-2024-0028743", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 사용자의 눈의 피로 경험을 결정하고 콘텐츠의 렌더링 속성을 조정하여 사용자의 눈의 피로를 감소시 키기 위해 눈의 속성을 추적하는 것에 관한 것이다."}
{"patent_id": "10-2024-0028743", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "가상 현실(VR) 디바이스는 사용자가 그 디바이스에 제시된 콘텐츠를 보는 데 완전히 몰입할 수 있기 때문에 인 기가 높아지고 있다. 헤드 마운트 디스플레이, 스마트 안경 등 헤드셋을 사용하여 몰입형 경험(immersive experience)을 구현된다. 그러나 완전한 몰입형 경험을 위해 VR을 채택하는 것은 사용자에게 비용이 발생한다. 예를 들어, 헤드셋은 무겁고 부피가 커서 사용자가 장시간 사용하기가 어렵다. 렌즈와 디스플레이 화면이 가까 워지면 눈의 피로, 멀미(motion sickness) 등의 문제가 발생할 수 있다. 또한 이러한 디바이스를 장기간 사용하면 눈이 건조해지거나 충혈될 수 있다. 이러한 문제로 인해 사용자는 VR 디바이스를 정기적으로 또는 전혀 사용 하지 못하게 된다. 이러한 콘텍스트에서 본 발명의 실시예가 발생한다."}
{"patent_id": "10-2024-0028743", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 구현예는 사용자가 헤드 마운트디스플레이(HMD)와 같은 웨어러블 디바이스에 렌더링된 콘텐츠와 상호 작용할 때 사용자의 눈의 피쳐에 대한 변화를 모니터링하고 캡처함으로써 눈의 피로 지표를 수집하는 시스템 및 방법에 관한 것이다. 캡처된 눈의 피로 지표 데이터는 눈의 피로와 사용자가 경험하는 눈의 피로 수준을 검출하 는 데 사용되는 눈의 피로 메트릭을 결정하기 위해 실질적으로 실시간으로 분석된다. 사용자의 눈의 피로를 결 정한 것에 응답하여, 콘텐츠의 하나 이상의 렌더링 속성을 조정하는 액션이 식별되어 콘텐츠를 제공하는 대화형 실행으로 포워딩된다. 액션 수신에 응답하여, 대화형 애플리케이션은 액션을 수행한다. 액션은 눈의 피로를 유 발하는 것으로 식별된 콘텐츠의 렌더링 속성 중 선택된 속성을 동적으로 조정하는 커맨드를 포함한다. 조정된 콘텐츠는 렌더링을 위해 대화형 애플리케이션에 의해 HMD로 포워딩된다. 조정된 콘텐츠는 사용자가 오랜 기간 동안 콘텐츠와 상호작용할 수 있도록 사용자의 눈의 피로를 줄이는 렌더링 속성을 포함한다. 일 구현예에서, 비디오 게임과의 상호작용 동안 헤드 마운트 디스플레이(HMD)를 착용한 사용자를 지원하는 방법 이 개시된다. 이 방법은 사용자가 HMD의 디스플레이 화면에서 렌더링되는 비디오 게임의 게임 콘텐츠와 상호작 용할 때 사용자의 눈의 피로 지표를 모니터링하는 단계를 포함한다. 눈의 피로 지표는 사용자가 동작하는 물리 적 환경 내에 분산된 복수의 센서에 의해 캡처된 사용자의 눈 및 기타 얼굴 피쳐의 이미지로부터 수집된다. 눈 의 피로 지표는 사용자의 눈의 피로 메트릭을 계산하는 데 사용된다. 눈의 피로 메트릭은 사용자가 경험하는 눈 의 피로 수준을 결정하는 데 사용할 수 있는 세부사항을 제공한다. 계산된 눈의 피로 메트릭을 기초로, 게임 콘 텐츠에 대해 수행될 액션이 식별된다. 액션은 조정될 필요가 있는 비디오 게임의 게임 콘텐츠와 연관된 하나 이 상의 렌더링 속성과 식별된 하나 이상의 렌더링 속성을 조정하기 위한 커맨드를 식별한다. 액션은 비디오 게임 으로 포워딩된다. 비디오 게임은, 액션 수신에 응답하여, 게임 콘텐츠의 하나 이상의 렌더링 속성을 조정하기 위해 커맨드를 실행한다. 조정된 게임 콘텐츠는 사용자가 콘텐츠와 상호작용할 때 사용자의 눈의 피로를 줄이기 위해 렌더링을 위해 HMD의 디스플레이 화면으로 포워딩된다. 대안적인 구현예에서, 비디오 게임과의 상호작용 동안 사용자를 지원하는 방법이 개시된다. 방법은 사용자가 비 디오 게임의 게임 콘텐츠의 제1 부분과 상호작용할 때 사용자의 눈의 피로 지표를 모니터링하는 단계를 포함한 다. 눈의 피로 지표는 사용자가 동작하는 물리적 환경 내에 분산된 복수의 센서로부터 수집된다. 사용자의 눈의 피로 메트릭은 센서에서 수집한 눈의 피로 지표를 사용하여 계산된다. 눈의 피로 메트릭은 사용자가 게임 콘텐 츠의 제1 부분과 상호작용할 때 사용자가 경험하는 눈의 피로 수준을 결정하는 데 사용된다. 게임 콘텐츠의 제2 부분은 제1 부분이 식별된 후에 발생할 것으로 예측된다. 게임 콘텐츠의 제2 부분은 제2 부분이 사용자의 눈의 피로를 유발하는 것으로 알려진 하나 이상의 렌더링 속성을 포함하는지 결정하기 위해 검사된다. 게임 콘텐츠의 제2 부분은 제1 부분에 포함된 게임 콘텐츠의 게임 상태와 제1 부분에 있는 사용자의 상호작용성에 기초하여 식 별된다. 액션이 식별되어 비디오 게임으로 포워딩된다. 액션은 눈의 피로를 유발할 가능성이 있는 비디오 게임 의 제2 부분에 포함된 게임 콘텐츠의 하나 이상의 렌더링 속성 중 선택 속성을 조정하기 위한 커맨드를 포함한 다. 액션은 게임 콘텐츠의 제1 부분을 표시하는 데 사용되는 하나 이상의 렌더링 속성과 제2 부분에 포함된 게 임 콘텐츠에 대해 식별된 하나 이상의 렌더링 속성에 기초하여 식별된다. 제1 부분의 게임 콘텐츠 렌더링에 이 어 제2 부분의 콘텐츠가 렌더링을 위해 선택되는 것으로 검출된 경우 그리고 액션을 수신한 것에 응답하여, 비 디오 게임은 렌더링을 위해 제2 부분의 게임 콘텐츠를 HMD에 포워딩하기 전에 제2 부분에 포함된 게임 콘텐츠에 대한 하나 이상의 렌더링 속성 중 선택 속성을 동적으로 조정하기 위한 커맨드를 실행한다. 본 개시의 다른 양태는 본 개시에 설명된 실시예의 원리를 예시적으로 설명하는 첨부 도면과 함께 취해진 다음 의 상세한 설명으로부터 명백해질 것이다."}
{"patent_id": "10-2024-0028743", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "클라이언트 디바이스에서 사용자에게 제시되는 콘텐츠의 렌더링 속성을 조정하기 위한 시스템 및 방법이 설명된 다. 본 개시의 다양한 구현예는 특정 세부사항의 일부 또는 전부가 없이 실시된다는 점에 유의해야 한다. 다른 경우에, 본 개시의 다양한 실시예를 불필요하게 모호하게 하지 않기 위해 잘 알려진 프로세스 동작은 자세히 설 명되지 않는다. 본 명세서에 설명된 다양한 구현예는 사용자가 헤드 마운트 디스플레이(HMD)와 같은 웨어러블 디바이스와 연관 된 디스플레이 화면에 렌더링되는 대화형 애플리케이션의 콘텐츠와 상호작용할 때, 서버 컴퓨팅 시스템에서 실 행되는 눈의 피로 검출기 모듈이 사용자의 눈의 피로 지표를 모니터링할 수 있게 해주고 눈의 피로 지표를 사용 하여 눈의 피로 메트릭을 계산한다. 눈의 피로 메트릭은 사용자가 HMD의 화면에 렌더링된 콘텐츠와 상호작용할 때 사용자가 경험하는 눈의 피로 수준을 결정하는 데 충분한 세부사항을 제공한다. 콘텐츠는 사용자가 제공한 게임 입력에 응답하여 비디오 게임에 의해 생성된 스트리밍 게임 콘텐츠일 수 있다. 사용자가 경험하는 눈의 피 로 수준에 기초하여, 액션이 식별되어 실행을 위해 비디오 게임에 포워딩될 수 있다. 액션은 눈의 피로 메트릭 을 기초로 식별될 수 있고 게임 콘텐츠와 상호작용하는 동안 사용자에게 눈의 피로를 유발하는 것으로 식별된 게임 콘텐츠의 하나 이상의 렌더링 속성을 조정하기 위한 커맨드를 포함한다. 게임 콘텐츠의 렌더링 속성을 조 정함으로써, 사용자의 눈의 피로를 감소시켜 사용자가 HMD의 사용 범위를 확장할 수 있다. 눈의 피로 지표는 비디오 게임의 게임 콘텐츠와 상호작용할 때 사용자가 동작하고 있는 물리적 환경에 분산된 복수의 센서 및 이미지 캡처 디바이스를 사용하여 캡처된다. 눈의 피로 지표는 HMD 내에서 프로세싱되어 비디오 게임을 실행하고 게임 콘텐츠를 제공하는 컴퓨터나 콘솔로 포워딩된다. 컴퓨터나 콘솔은 사용자에게 로컬이거나원격일 수 있다. 컴퓨터나 콘솔 내에서 실행되는 눈의 피로 검출기 엔진은 눈의 피로 지표를 분석하여 눈의 피 로 메트릭을 정의하는 데 사용되고, 이는 그런 다음 눈의 피로 검출기 엔진에서 게임 콘텐츠에 대해 수행될 액 션을 식별하는 데 사용된다. 액션은 사용자에 대해 식별된 눈의 피로 수준을 유발하는 것으로 알려진 게임 콘텐 츠의 렌더링 속성 중 선택된 속성을 조정하는 것일 수 있다. 콘텐츠 조정을 위해 액션이 비디오 게임으로 포워 딩된다. 액션은 비디오 게임에서 실행될 커맨드를 포함한다. 액션을 수신하는 것에 응답하여, 비디오 게임은 액 션에서 식별된 커맨드를 해석하고 조정될 게임 콘텐츠의 렌더링 속성 중 선택된 속성을 식별하고, 조정을 위해 식별된 렌더링 속성 중 선택된 속성이 게임 콘텐츠의 후속 부분에 포함되어 있는지 검증하고, 및 성공적으로 검 증되면 커맨드를 실행하도록 구성된다. 렌더링 속성 중 선택된 속성이 조정된 게임 콘텐츠의 후속 부분은 렌더 링을 위해 HMD로 포워딩된다. 각각의 사용자는 콘텐츠의 상이한 렌더링 속성에 대해 서로 다른 허용 수준이나 민감도 수준을 가질 수 있다. 결과적으로, 눈의 피로 메트릭은 사용자별로 다르며 콘텐츠의 다양한 렌더링 속성에 대한 각 사용자의 허용/감 도 수준을 기초로 식별된다. 또한, 게임 콘텐츠의 렌더링 속성이 조정되는 정도도 사용자의 허용 수준이나 민감 도 수준에 따라 도출된다. 일부 경우에, 조정의 정도는 사용자의 시각적 특성에 따라 더 도출될 수 있다. 조정 된 콘텐츠에는 사용자에 대한 눈의 피로를 감소시키는 렌더링 속성을 갖는 게임 콘텐츠가 포함된 것으로 나타났 다. 일부 실시예에서, 눈의 피로 검출기 엔진은 비디오 게임 수준과 같은 애플리케이션 수준에서 제공된다. 대 안적인 실시예에서, 눈의 피로 검출기 엔진은 플랫폼 수준(예를 들어, 컴퓨터 또는 콘솔(로컬 또는 원격)의 운 영 체제 수준)에서 제공된다. 명세서 전반에 걸쳐, \"비디오 게임\"을 참조하여 다양한 실시예가 설명되었다. 실시예는 비디오 게임에 제한되지 않고 입력 커맨드의 실행을 통해 지시되는 모든 유형의 대화형 애플리케이션을 나타내도록 확장될 수 있다. 예 시 목적으로만, 대화형 애플리케이션은 게임, 워드 프로세싱, 비디오 프로세싱, 비디오 게임 프로세싱 등을 위 한 애플리케이션을 포함한다. 본 개시의 일반적인 이해를 바탕으로, 사용자에게 지원을 제공하는 특정 구현예가 이제 다양한 도면을 참조하여 더 자세히 설명될 것이다. 본 개시의 다양한 구현예는 특정 세부사항의 일부 또는 전부가 없이 실행될 수 있다 는 점에 유의해야 한다. 다른 경우에, 본 개시의 다양한 실시예를 불필요하게 모호하게 하지 않기 위해 잘 알려 진 프로세스 동작은 자세히 설명되지 않았다. 도 1은 사용자가 웨어러블 디바이스의 디스플레이 화면에 렌더링된 콘텐츠와 상호작용할 때 웨어러블 디바이스 를 사용하여 사용자의 눈의 피로 지표를 모니터링하고 캡처하고 눈의 피로 지표를 사용하여 사용자의 눈의 피로 메트릭을 정의하는 예시 시스템의 단순화된 블록도를 예시한다. 눈의 피로 메트릭은 눈의 피로와 사용자가 경험 하는 눈의 피로 수준을 정의하는 데 사용된다. 사용자가 경험하는 눈의 피로 수준에 기초하여, 콘텐츠의 렌더링 속성 중 특정 속성이 조정된다. 도 1의 시스템은 비디오 게임 애플리케이션의 게임 콘텐츠와 상호작용하기 위해 사용자가 사용하는 것으로 도시되지만, 증강 현실 애플리케이션, 혼합 현실 애플리케이션 또는 기타 유형의 대 화형 애플리케이션의 스트리밍 콘텐츠와 상호 작용하도록 확장할 수도 있다. 사용자는 웨어러블 디바이스(예를 들어, 헤드 마운트 디스플레이(HMD))를 착용하고 있는 것으로 도시 되어 있다. HMD는 안경, 고글, 헬멧과 유사한 방식으로 착용되며, 사용자가 보고 상호 작용할 수 있 도록 HMD와 연관된 디스플레이 화면에 비디오 게임 또는 다른 대화형 애플리케이션의 콘텐츠를 렌더링하도 록 구성된다. 대안적인 구현예에서, HMD 대신에, 사용자는 증강 현실 애플리케이션 또는 다른 대화형 애플리케이션의 콘텐츠를 렌더링하는 데 사용되는 디스플레이 화면을 갖춘 스마트 안경을 착용할 수 있다. 사용 자가 착용하는 웨어러블 디바이스가 HMD인 경우를 고려하면, HMD는 사용자의 눈에 근접한 디스플레이 메커니즘을 제공함으로써 사용자에게 매우 몰입감 있는 경험을 제공한다. HMD는 사용자의 시야의 큰 부분 또는 심지어 전체를 차지하는 디스플레이 영역을 사용자의 눈 각각에 제공할 수 있다. HMD에 제공된 광학 장치를 통해 사용자는 사용자의 눈에 아주 가까이 렌더링된 콘텐츠를 볼 수 있다. 광학장치는 사용자에게 콘텐 츠를 제시할 때 사용자의 시각적 특성을 고려한다. 일 실시예에서, HMD는 컴퓨터에 연결된다. 컴퓨터는 로컬 컴퓨터(예를 들어, 게임 콘솔)이거나 HMD에 원격으로 위치하는 애플리케이션 클라우드의 일부인 컴퓨터일 수 있다. 결과적으로, HMD 와 컴퓨터 사이의 연결은 유선 또는 무선일 수 있다. 컴퓨터(106/또는 클라우드의 일부)는 게임 콘솔, 개 인용 컴퓨터, 노트북, 태블릿 컴퓨터, 모바일 디바이스, 휴대폰, 태블릿, 씬 클라이언트, 셋톱박스의 일부, 미 디어 스트리밍 디바이스, 가상 컴퓨터, 원격 서버 컴퓨터 등을 포함하지만 이에 제한되지 않는 당업계에 알려진 임의의 범용 또는 특수 목적 컴퓨터일 수 있다. 원격 서버 컴퓨터(즉, 클라우드의 일부)와 관련하여, 서버컴퓨터는 애플리케이션 클라우드 시스템의 데이터 센터 내의 클라우드 서버일 수 있다. 데이터 센터는 렌더링을 위해 HMD에 콘텐츠를 제공하는 하나 이상의 대화형 애플리케이션을 호스팅하는 데 필요한 리소스를 제공하 는 복수의 서버를 포함한다. 대화형 애플리케이션은 하나의 데이터 센터 내의 하나 이상의 클라우드 서버에서 인스턴스화되고(instantiated) 또는 여러 데이터 센터에 분산될 수 있는 분산 애플리케이션일 수 있고, 복수의 클라우드 서버에서 인스턴스화될 때, 대화형 애플리케이션의 데이터는 복수의 클라우드 서버에 걸쳐 동기화된다. 일 실시예에서, 대화형 애플리케이션은 비디오 게임 애플리케이션(즉, 가상 현실(VR) 애플리케이션) 또는 증강/ 혼합 현실(AR) 애플리케이션일 수 있으며, 컴퓨터는 비디오 게임 애플리케이션 또는 AR 애플리케이션의 인스턴 스를 실행하고, HMD와 연관된 디스플레이 화면에 렌더링하기 위해 비디오 게임 애플리케이션 또는 AR 애플 리케이션으로부터의 비디오 및 오디오 데이터를 출력하도록 구성된다. 또 다른 구현예에서, 서버는 대화형 애플 리케이션의 인스턴스를 실행할 수 있는 독립형 서버일 수 있거나 또는 대화형 애플리케이션(예를 들어, AR 애플리케이션 또는 비디오 게임 애플리케이션)의 인스턴스를 실행할 수 있는 하나 이상의 가상 머신을 관리하고 실시간 또는 지연된 시간으로 렌더링할 콘텐츠를 제공하도록 구성된 서버일 수 있다. 대안적으로, 서버는 복수의 콘솔을 포함할 수 있고 비디오 게임의 인스턴스는 하나 이상의 콘솔(예를 들어, 게 임 콘솔)로부터 액세스될 수 있다. 콘솔은 독립적인 콘솔이거나 랙 장착형(rack-mounted) 서버 또는 블레이드 서버일 수 있다. 블레이드 서버는 복수의 서버 블레이드를 포함할 수 있으며, 각각의 블레이드는 예를 들어 게 임 콘텐츠 데이터 스트림을 생성하기 위해 비디오 게임 애플리케이션의 단일 인스턴스를 인스턴스화하기 위해 필요한 회로 및 리소스를 갖는다. 다른 형태의 블레이드 서버를 포함한 다른 유형의 클라우드 서버가 또한 대화 형 애플리케이션의 콘텐츠(예를 들어, 게임 콘텐츠 데이터 스트림)를 생성하는 대화형 애플리케이션(예를 들어, 비디오 게임 애플리케이션)의 인스턴스를 실행하는 데 사용될 수 있다. 단순화를 위해, VR 애플리케이션의 콘텐 츠 조정과 관련하여 다양한 실시예가 논의될 것이지만 AR 또는 혼합 현실(MR) 애플리케이션의 콘텐츠 조정에도 확장될 수 있다. 사용자는 글러브 인터페이스 개체(104a) 또는 제어기(104b) 또는 다른 입력 디바이스(예를 들어, 키보드, 마우스 등, 도시되지 않음) 또는 HMD와 연관된 입력 인터페이스를 동작시켜 비디오 게임과 같은 대화형 애 플리케이션에 대한 입력을 제공할 수 있다. 추가적으로, HMD의 외부 표면에 배치된 카메라, HMD 외부 및 물리적 환경 내에 배치되는 하나 이상의 외부 카메라, 내부 카메라(HMD의 내부 표면에 배치된 카 메라)(미도시) 등과 같은 이미지 캡처 디바이스는 사용자가 콘텐츠와 상호작용할 때 사용자가 위치한 대화 형 환경의 이미지뿐만 아니라 사용자의 눈 및 기타 얼굴 피쳐를 캡처하도록 구성될 수 있다. 눈의 피쳐를 캡처 한 이미지를 분석하여 다양한 눈의 피로 지표를 결정할 수 있다. 눈의 피로 지표는 다른 얼굴 피쳐의 이미지와 대화형 환경의 이미지를 사용하여 검증될 수 있고, 이는 사용자, HMD, 글러브 인터페이스 개체 (104a), 제어기(104b) 및/또는 기타 입력 디바이스 및 기타 현실 세계 개체의 위치, 배치, 배향 및/또는 움직임 을 식별하는 데 사용된다. 일 실시예에서, 글로브 인터페이스 개체(104a), 제어기(104b) 등과 같은 입력 디바이 스는 빛과 같은 시각적 지표를 포함하며, 이는 개별의 위치 및 배향을 결정하기 위해 추적될 수 있다. 이미지 캡처 디바이스는 하나 이상의 카메라, 다중 이미지 캡처 디바이스(예를 들어, 입체 카메라 쌍), IR 카메라, 심도 카메라, 또는 이들의 임의의 2개 이상의 조합을 포함한다. 제어기(104b)는 한손 제어기(즉, 사용자의 한 손을 사용하여 동작될 수 있는 제어기) 또는 양손 제어기(즉, 사 용자의 양손을 사용하여 동작될 수 있는 제어기)일 수 있다. 언급된 바와 같이, 제어기는 제어기와 연관된 광을 추적하거나 제어기와 연관된 센서에 의해 제공되는 형상 및/또는 관성 데이터를 추적함으로써 추적될 수 있다. 이러한 다양한 유형의 제어기를 사용하거나 사용자가 만들고 하나 이상의 카메라로 캡처하는 단순한 손 제스처 를 사용하여 HMD와 연관된 디스플레이 화면에 제시된 가상 현실 환경과 인터페이스하고, 이를 제어하고, 조작하고, 상호작용하고, 참여하는 것이 가능하다. HMD는 내장된 센서 및/또는 하나 이상의 조명, 기타 지표(예를 들어, 시각적 마커)를 사용하여 추적되며, 추적으로부터 얻은 데이터는 사용자가 동작하고 있는 물리적 환경 내에서 HMD의 위치와 배향을 식별하는 데 사용될 수 있다. 카메라 및 기타 이미지 캡처 디바이스 외에도, 대화형 환경으로부터 사운드를 캡처하 기 위해 하나 이상의 마이크도 포함된다. 하나 이상의 마이크에 의해 캡처된 사운드는 음원(예를 들어, 사용자, 다른 사용자 또는 다른 음원에 의해 생성된 오디오)의 위치를 식별하기 위해 프로세싱될 수 있다. 식별된 위치 에서 마이크에 의해 캡처된 사운드는 식별된 위치에서 나오지 않는 다른 사운드를 배제하기 위해 선택적으로 필 터링, 활용 또는 프로세싱될 수 있다.일부 실시예에서, 컴퓨터는 네트워크를 통해 애플리케이션 클라우드 또는 대화형 애플리케이션 또는 증강 현실 애플리케이션을 실행하는 서버 컴퓨팅 디바이스와 통신하는 씬 클라이언트로서 기능한다. 대화 형 애플리케이션이 사용자에 의해 게임 플레이를 위해 선택된 비디오 게임 애플리케이션인 경우, 애플리케 이션 클라우드의 서버는 해당 서버의 프로세서 또는 다른 서버의 프로세서를 사용하여 비디오 게임의 인스 턴스를 유지하고 실행하거나 또는 컴퓨터에서 비디오 게임을 인스턴스화한다. 애플리케이션 클라우드(11 2)에서 비디오 게임이 실행되는 경우, 컴퓨터는 HMD, 글러브 인터페이스 개체(104a) 및 이미지 캡처 디바이스(예를 들어, 카메라 및 기타 카메라)로부터의 입력을 애플리케이션 클라우드의 서버로 송신 하고, 이는 실행 중인 비디오 게임의 게임 상태에 영향을 미치기 위해 입력을 프로세싱한다. 비디오 데이터, 오 디오 데이터 및 햅틱 피드백 데이터와 같은 실행 중인 비디오 게임으로부터의 출력은 애플리케이션 클라우드 의 서버에 의해 컴퓨터로 송신된다. 컴퓨터는 애플리케이션 클라우드의 서버로부터 수신된 데이터를 송신 전에 추가로 프로세싱할 수도 있고, 렌더링을 위해 데이터를 관련 디바이스에 직접 송신할 수도 있다. 예를 들어, 비디오 및 오디오 데이터 스트림은 HMD에 제공될 수 있는 반면, 햅틱 피드백 데이터는 글러브 인터페이스 개체(104a) 및/또는 제어기에 제공된다. 일 실시예에서, HMD, 글러브 인터페이스 개체(104a), 제어기(104b), 및 카메라 등과 같은 이미지 캡 처 디바이스 그 자체는 애플리케이션 클라우드에서 서버와 통신하기 위해 네트워크에 독립적으로 직 접 연결되는 네트워크 디바이스(networked device)일 수 있다. 예를 들어, 컴퓨터는 비디오 게임 프로세싱 을 수행하지 않지만 네트워크 트래픽의 통과를 용이하게 하는 라우터와 같은 로컬 네트워크 디바이스일 수 있다. HMD, 글러브 인터페이스 개체(104a), 제어기(104b) 및 카메라에 의한 네트워크로의 연결은 유 선 또는 무선일 수 있다. 추가적으로, 헤드 마운트 디스플레이를 참조하여 설명된 본 개시의 다양한 구현예는 안경, 모바일 디바이 스(예를 들어, 스마트폰, 태블릿 컴퓨팅 디바이스 등) 또는 휴대용 디바이스를 포함하되 이에 제한되지 않는 다 른 웨어러블 디바이스 또는 대화형 디바이스로 확장될 수 있다. 다양한 구현예에서, HMD를 착용한 사용자가 볼 수 있도록 대화형 애플리케이션의 콘텐츠가 렌더링되는 화면은 HMD의 디스플레이 화면이거나 HMD에 통신 가능하게 연결된 외부 디스플레이 화면일 수 있다. 외부 디스플레이 화면은 LCD 디스플레이 화면, 태블릿 컴퓨 팅 디바이스의 화면, 휴대폰의 화면 등과 같은 HMD가 통신 가능하게 연결된 휴대용 컴퓨팅 디바이스와 관 련된 디스플레이 화면, 또는 콘텐츠가 투사될 수 있는 외부 표면일 수 있다. 일 구현예에서, HMD는 사용자가 HMD의 디스플레이 화면에 제시된 콘텐츠와 상호작용할 때 사용자의 눈의 피쳐 및 기타 얼굴 피쳐의 변화를 캡처하는 데 사용되는 복수의 센서 및 이미지 캡처 디바이스를 포함한다. 다른 얼굴 피처를 캡처하는 데 사용되는 일부 센서는 가속도계, 자력계, 자이로스코프, 글로벌 포지 셔닝 시스템 추적기 등과 같은 관성 측정 유닛(IMU) 센서를 포함한다. 이미지 캡처 디바이스는 HMD의 외부 표면에 배치된 전방 대면(forward facing) 카메라, HMD의 내부 표면에 배치되고 사용자의 눈 및 기타 얼굴 피쳐를 향하는 카메라, 사용자를 향하고 HMD를 착용한 사용자가 동작하는 물리적 환경에 배치된 외부 카메라, 심도 카메라 등을 포함한다. 눈의 피쳐 및 기타 얼굴 피쳐의 변화는 HMD에서 렌더링되는 콘텐츠에 응답할 수 있다. 사용자의 눈의 피쳐의 변화를 추적하여 수집된 데이터는 눈 형상의 변화, 뷰 방향, 눈의 움직 임, 눈의 움직임 속도, 동공 크기, 깜박임 패턴, 눈의 충혈 등을 포함한다. 일부 눈의 피쳐에 대한 변화는 잠재 적으로 사용자에게 눈의 피로를 유발할 수 있으므로 이러한 눈의 피쳐의 변화는 눈의 피로 지표라고 한다. 사용 자의 눈의 피로 지표에 대한 변화는 눈의 피로 유형(예를 들어, 충혈 요인, 눈 깜박임 레이트, 눈을 가늘게 뜨 는 횟수 등), 눈의 피로 수준(예를 들어, 충혈 정도, 눈을 가늘게 뜨는 강도), 눈의 피로를 유발했을 가능성이 있는 요인(들) 등과 같은 눈의 피로 메트릭을 계산하는 데 사용된다. HMD에 대한 변화를 추적하여 수집된 데이터는 물리적 환경에서 HMD의 위치, 방향, 배향, 이동, 이동 속도 및 따라서 HMD를 착용한 사용자의 머리의 위치, 방향, 배향, 이동, 이동 속도를 결정하는 데 사용될 수 있다. 다른 얼굴 피쳐의 변화는 사용자의 표정(expression)을 추적하는 데 사용될 수 있다. 다른 얼굴 피쳐 에 대한 변화는 눈의 피쳐에서 검출된 변화로부터 계산된 눈의 피로 메트릭을 검증하는 데 사용된다. 센서에 의 해 캡처된 눈의 피로 지표와 계산된 눈의 피로 메트릭은 콘텐츠의 시간 데이터를 사용하여 콘텐츠와 연관된다. 센서에 의해 캡처된 눈의 피로 지표 외에도, 센서는 사용자가 게임 콘텐츠와 상호 작용하는 동안 사용자의 오디 오 입력을 캡처할 수도 있다. 오디오 입력은 마이크를 사용하여 캡처될 수 있으며 센서에 의해 캡처된 눈의 피 로 지표를 강화하기 위한 추가 입력으로 사용될 수 있다. 콘텐츠와 시간 데이터는 서로 다른 시간에 렌더링되는 콘텐츠의 유형과 눈의 피로 지표의 변화가 센서에 의해 캡처된 시점의 콘텐츠의 렌더링 속성을 결정하는 데 사 용될 수 있다.그런 다음 계산된 눈의 피로 메트릭을 사용하여 눈의 피로와 눈의 피로 수준에 대응하는 액션을 식별하고 해당 액션을 비디오 게임 애플리케이션에 포워딩한다. 액션은 사용자가 경험하는 눈의 피로와 눈의 피로 수준에 대응 하는 렌더링 속성 중 특정 속성을 식별하기 위해 비디오 게임에 의해 해석된다. 액션을 수신하는 것에 응답하여, 비디오 게임 애플리케이션은 그 안에 포함된 커맨드를 실행함으로써 액션을 수행할 수 있다. 액션은 사용자에게 눈의 피로를 유발하는 것으로 알려진 콘텐츠의 렌더링 속성 중 특정 속성이 조정되는 교정 액션일 수 있다. 조정된 콘텐츠는 사용자에 대한 렌더링을 위해 위해 HMD로 포워딩된다. 조정된 콘텐츠는 사용자의 눈 의 피로를 감소시키는 데 도움이 된다. 다양한 센서에 의해 수집되고 사용자가 경험하는 눈의 피로와 눈의 피로 수준을 검출하는 데 사용되는 눈의 피 로 지표는 추가 프로세싱을 위해 눈의 피로 검출기 엔진(도 1에는 도시되지 않음)으로 직접 포워딩된다. 일부 구현예에서, 눈의 피로 검출기 엔진이 애플리케이션 수준에서 이용가능하다. 이러한 구현예에서, 눈의 피로 검 출기 엔진이 게임 로직에 통합될 수 있고, 또는 게임 로직과 상호작용하여 눈의 피로 메트릭을 결정하고 비디오 게임이 취할 수 있는 교정 액션을 식별하여 사용자의 눈의 피로를 줄이기 위해 콘텐츠의 렌더링 속성을 식별하 고 조정한다. 대체 구현예에서, 눈의 피로 검출기 엔진을 플랫폼 수준에서 이용가능하다. 이러한 대체 구현예에 서, 눈의 피로 검출기 엔진은 컴퓨터 운영 체제에 내장되고 눈의 피로 메트릭을 결정하고 비디오 게임이 사용자 의 눈의 피로를 줄이기 위해 취할 수 있는 액션을 식별하는 데 사용되는 소프트웨어 프로그램이다. 식별된 액션 은 운영 체제에 의해 비디오 게임 시스템으로 포워딩되어 비디오 게임이 액션을 수행할 수 있도록 하며, 여기서 액션은 사용자의 눈의 피로를 감소시키기기 위해 비디오 게임에 의해 생성된 콘텐츠에 수행되는 교정 액션일 수 있다. 일부 구현예에서, 눈의 피로 검출기 엔진은 펌웨어로 정의된다. 도 2a는 눈의 피로 검출기 엔진이 비디오 게임의 게임 로직 내에 눈의 피로 검출기 엔진을 내장 함으로써 애플리케이션 수준에서 정의되는 실시예를 예시한다. 대안적인 실시예에서, 눈의 피로 검출기는 독립 적인 소프트웨어 프로그램이거나, 다른 소프트웨어 프로그램과 함께 포함되고 비디오 게임의 게임 로직과 상호작용하도록 구성되는 소프트웨어 프로그램이다. 도시된 바와 같이, 다양한 센서 및 이미지 캡처 디바이스는 사용자의 눈의 피쳐 및 기타 얼굴 피쳐에 대한 변화를 캡처함으로써 눈의 피로 지표와 관련된 데이터를 수집하 는 데 사용된다. 센서에 의해 캡처된 데이터는 크게 직접적인 눈의 피로 지표와 간접적인 눈의 피로 지표 로 분류될 수 있다. 일 실시예에서, 직접적인 눈의 피로 지표는 센서에 의해 관찰되고 캡처되는 눈 및 얼굴 피쳐인 반면, 간접적인 눈의 피로 지표는 직접적인 눈의 피로 지표로부터 도출된다. 예를 들 어, 직접적인 눈의 피로 지표는 깜박임 패턴, 동공의 크기, 눈의 형상, 눈의 위치, 눈의 움직임, 움직임의 방향 등과 관련될 수 있다. 간접적인 눈의 피로 지표는 눈을 가늘게 뜨고 있는 정도, 안구 건조, 충혈 요 인 등과 같은 직접적인 눈의 피로 지표로부터 계산될 수 있다. 예를 들어, 시간이 지남에 따라 눈의 형상 을 모니터링하여 눈을 가늘게 뜨는 수준이 결정될 수 있다. 눈의 피로 검출기는 눈의 피로 메트릭을 계산하기 위해 센서로부터 수집되고 및/또는 직접적인 눈의 피로 지표로부터 도출된 직접적인 눈의 피로 지표(즉, 센서/이미지 캡처 디바이스에 의해 캡처된 지표)와 간접적인 눈의 피로 지표(즉, 직접적인 눈의 피로 지표로부터 도출된 지표기) 모두를 사용한다. 눈의 피로 검출기는 눈의 피로 인공 지능(AI) 모델을 사용하여 사용자가 게임 콘텐츠의 현재 부분과 상호작용할 때 사용자의 눈의 피로 메트릭을 계산할 수 있다. 계산된 눈의 피로 메트릭은 눈의 피로 메트릭을 해석하고, 게임 콘텐츠의 현재 렌더링 부분의 렌더링 속성을 식별하고, 게임 콘텐츠의 후속 부분의 렌더링 속성 을 식별하고, 사용자에 대해 눈의 피로를 유발하는 것으로 알려진 후속 부분의 렌더링 속성 중 특정 속성을 식 별하고, 게임 콘텐츠의 후속 부분의 렌더링 속성 중 특정 속성을 조정하기 위해 액션에 포함된 커맨드를 실행하기 위해 게임 로직 내에서 이용 가능한 게임 액션 설정 로직으로 포워딩된다. 현재 렌더링 부 분으로부터 식별된 눈의 피로 검출기가 미리 정의된 수준보다 높으므로 콘텐츠의 후속 부분에서 조정해야 하는 경우 조정을 위해 렌더링 속성 중 특정 속성이 식별된다. 액션은 후속 부분을 렌더링하기 위해 사용된 렌 더링 속성 중 특정 속성이 게임 콘텐츠의 현재 부분과 동일한 수준에서 계속 렌더링된다는 성공적인 검증 시 개 시된다. 후속 부분에 대한 렌더링 속성의 각각은 커맨드에서 식별된 수준에 따라 조정된다. 조정된 렌더링 속성 을 갖는 후속 부분은 렌더링을 위해 사용자의 HMD로 포워딩된다. 조정된 렌더링 속성은 사용자가 눈의 피 로 없이 콘텐츠를 볼 수 있도록 도와준다. 도 2b는 눈의 피로 검출기 엔진이 운영 체제 내에 눈의 피로 검출기 엔진을 통합함으로써 플랫폼 수 준에서 이용 가능하게 되는 대안적인 실시예를 예시한다. 도 2b에 도시된 실시예와 도 2a에 도시된 실시예 사이 의 차이점은 도 2b의 눈의 피로 검출기 엔진이 컴퓨터 운영 체제의 일부인 반면, 도 2a에 도시된 실시예에 서는 눈의 피로 감지 엔진이 게임 로직의 일부라는 점이다(또는 게임 로직에 액세스할 수 있는다른 대화형 애플리케이션의 일부일 수도 있다). 도 2a에 예시된 실시예와 마찬가지로, 도 2b의 눈의 피로 검출 기는 다양한 센서/이미지 캡처 디바이스로부터 수집된 직접적인 눈의 피로 지표와 직접적인 눈의 피로 지 표로부터 도출된 간접적인 눈의 피로 지표를 수신한다. 수집되고 도출된 눈의 피로 지표는 눈의 피로 메트릭을 계산하기 위해 눈의 피로 검출기 엔진 내의 눈의 피로(AI) 모델에 의해 사용된다. 이렇게 계산된 눈의 피로 메트릭은 운영 체제 액션 설정 로직으로 포워딩된다. 운영 체제 액션 설정 로직 은 (a) HMD에 제시된 콘텐츠의 현재 부분의 다양한 렌더링 속성, (b) 미리 정의된 수준보다 높고 눈이 장 시간 동안 렌더링 속성 중 특정 속성에 노출되면 눈의 피로를 유발할 가능성이 있는 렌더링 속성 중 특정 속성, (c) 콘텐츠의 후속 부분을 표시하는 데 사용되는 렌더링 속성, 및 (d) 현재 부분에서 미리 정의된 수준보다 높 은 렌더링 속성 중 특정 속성이 다음 부분에 포함되는지 여부를 식별한다. 운영 체제 액션 설정 로직이 미 리 정의된 수준보다 높은 렌더링 속성 중 특정 속성이 후속 부분에도 포함되어 있다고 결정하면, 운영 체제 액 션 설정 로직은 렌더링 속성 중 특정 속성을 조정하는 것에 대응하는 액션을 식별하고 실행을 위해 액션을 비디오 게임 시스템에 포워딩한다. 액션은 비디오 게임에 의해 생성된 후속 콘텐츠의 렌더링 속성 중 특정 속성을 동적으로 조정하도록 비디오 게임에 시그널링하는 커맨드를 포함한다. 커맨드는 콘텐츠의 후속 부분을 한 번에 하나의 특정 렌더링 속성으로 조정하라는 비디오 게임에 대한 명령어를 포함할 수 있으며, 특정 렌더링 속성 각각이 조정될 조정 수준을 지정한다. 선택 속성이 조정된 콘텐츠는 렌더링을 위해 사용자 의 HMD로 포워딩되어 사용자가 눈의 피로를 경험하지 않고 조정된 후속 콘텐츠와 상호작용할 수 있도록 한 다. 도 3은 일 실시예에서, 다양한 센서에 의해 수집된 눈의 피로 지표를 프로세싱하고 대화형 애플리케이션의 콘텐 츠와 상호작용하는 사용자에 대한 눈의 피로 메트릭을 계산하는 데 사용되는 눈의 피로 검출기 엔진 의 다양한 컴포넌트를 예시한다. 일부 실시예에서, 눈의 피로 검출기 엔진은 컴퓨터의 프로세서에 의해 실 행되는 소프트웨어 모듈일 수 있다. 일부 실시예에서 눈의 피로 검출기 엔진에 사용된 \"엔진\"이라는 용어 는 특정 기능을 수행하도록 구성된 프로그램 또는 코드의 조각을 의미한다. 프로그램이나 코드는 딥 러닝 알고 리즘을 사용하여 특정 데이터를 프로세싱하고 다른 데이터를 계산할 수 있다. 눈의 피로 검출 엔진의 경우, 프로그램은 다양한 소스로부터 다양한 센서로부터의 눈의 피로 지표, 사용자 및 사용자 프로필 데이터저 장소로부터의 사용자 프로필 데이터, 및 비디오 게임의 게임 콘텐츠와 같은 데이터를 수신하고 다양한 데 이터를 분석하여 그 안에 포함된 데이터 유형을 식별하고 데이터를 분류하도록 구성된다. 일부 실시예에서, 소 프트웨어 프로그램은 센서 및 이미지 캡처 디바이스에 의해 캡처된 이미지가 운영 체제 수준에서 프로세싱될 수 있으며 콘텐츠의 렌더링 속성을 조정하기 위해 교정 액션이 식별되도록 컴퓨터의 운영 체제의 일부이다. 이는 캡처된 이미지를 프로세싱하고 취해야 할 필요한 액션을 식별하기 위해 눈의 피로 검출기 엔진 을 통합하기 위해 콘텐츠를 제공하는 각각의 대화형 애플리케이션이 업데이트되도록 요구하는 것을 방지한다. 대안적인 실시예에서, 눈의 피로 검출기 엔진은 컴퓨터의 하드웨어에 내장될 수 있다. 하드웨어 컴포넌트 는 캡처된 이미지를 수신 및 프로세싱하고 HMD에서 렌더링을 위해 제공되는 콘텐츠의 렌더링 속성을 조정하기 위해 개별 대화형 애플리케이션으로 포워딩하기 위한 적절한 액션을 식별하기 위해 센서와 상호작용하는 데 도움을 줄 수 있다. 일부 실시예에서, 눈의 피로 검출기 엔진은 센서에 의해 캡처된 사용자의 눈 이미지 및 기타 얼굴 피쳐를 수집하고 추가 프로세싱을 위해 애플리케이션 프로그래밍 인터페이스(API)를 통해 컴퓨터(예를 들어, 게임 콘솔 과 같은 로컬 컴퓨터 또는 클라우드 서버와 같은 원격 컴퓨터)에서 실행되는 대화형 애플리케이션으로 포워딩하 는 데 사용되는 소프트웨어 프로그램일 수 있다. 대화형 애플리케이션은 게임 콘텐츠를 제공하는 비디오 게임 애플리케이션일 수 있다. 센서로부터 수집된 데이터를 프로세싱하고, 사용자의 눈의 피로 메트릭을 계산하 고, 콘텐츠에 대해 수행될 액션을 식별하는 것은 비디오 게임 수준에서 수행될 수 있다. 눈의 피로 검출기 엔진이 정의되는 방식(즉, 소프트웨어 컴포넌트 또는 하드웨어 컴포넌트로서 또는 펌웨어일 수 있음)에 관 계없이, 눈의 피로 검출기 엔진은 사용자가 동작하는 물리적 환경에 위치한 복수의 센서 및 이미지 캡처 디바이스에 의해 캡처된 사용자의 눈의 피쳐 및 기타 얼굴 피쳐의 이미지를 수신하고 프로세싱하며 눈의 피로 측정 메트릭을 계산하도록 구성된다. 눈의 피로 검출기 엔진은 센서에 의해 수집된 데이터, 사용자 프로필 데이터, 비디오 게임(즉, 대화형 애 플리케이션)에 의해 제공되는 게임 콘텐츠를 프로세싱하는 데 사용되는 복수의 컴포넌트를 포함한다. 눈의 피로 메트릭을 계산하기 위해 눈의 피로 인공 지능(AI) 모델을 구축하고 훈련하는 데 머신 러닝 엔진이 사용된 다. 그 다음, 눈의 피로 메트릭은 콘텐츠를 조정하기 위해 취할 적절한 액션을 식별하기 위해 액션 설정 로직(236/238)으로 포워딩된다. 눈의 피로 검출기 엔진은 눈의 피로 지표를 프로세싱하는 컴포넌트, 사용자 프로필 데이터를 프로세싱하는 컴포넌트, 게임 콘텐츠를 프로세싱하는 컴포넌트, 다양한 컴포넌트로부터분류된 데이터를 프로세싱하고 눈의 피로 메트릭을 출력으로 식별하는 눈의 피로 AI 모델을 갖춘 머 신 러닝 엔진을 포함한다. 눈의 피로 지표를 프로세싱하기 위한 컴포넌트는 눈의 피로 피쳐 파서 엔진(230a) 및 눈의 피로 피쳐 분류기 엔진(230b)을 포함한다. 사용자 프로필 데이터를 프로세싱하기 위한 컴포넌트는 사용자 프로필 파서 엔진(230c) 및 사용자 프로필 분류기 엔진(230d)을 포함한다. 게임 콘텐츠를 프로세싱하기 위한 컴 포넌트는 콘텐츠 피쳐 파서 엔진(230e)과 콘텐츠 피쳐 분류기 엔진(230f)을 포함한다. 머신 러닝 엔진은 가중치 할당 엔진과 눈의 피로 AI 모델을 포함한다. 사용자는 비디오 게임의 게임 콘텐츠에 대한 액세스를 요청하기 위해 컴퓨터에 로그인할 수 있다. 사용자가 로 그인하면, 사용자 프로필 데이터저장소에 저장된 사용자 프로필 데이터를 사용하여 사용자가 검증된다. 사 용자에 대한 사용자 프로필 데이터는 사용자 식별 정보와 디바이스 선호도(preference)뿐만 아니라 사용자 맞춤 화, 사용자 시각적 및/또는 청각적 특성, 신체적 불구 또는 장애, 콘텐츠 선호도, 사용자가 이용 가능한/액세스 가능한 콘텐츠 유형 등을 포함한다. 사용자 검증은 사용자가 컴퓨터(예를 들어, 로컬 또는 원격 클라우드 서버 에서 사용할 수 있는 게임 콘솔이나 컴퓨터)에 로그인하는 동안 사용자가 제공한 입력 자격증명(credential)을 사용자 프로필 데이터에 저장된 사용자의 대응하는 자격증명과 매칭시킴으로써 수행된다. 사용자가 요청한 비디 오 게임에 대해 사용자가 성공적으로 검증되면, 비디오 게임 및 게임 콘텐츠에 대한 액세스가 사용자에게 제공 된다. 사용자 프로필 데이터에 포함된 세부사항은 사용자를 검증할 뿐만 아니라 사용자에 대한 콘텐츠를 맞춤화 하는 데에도 사용된다. 사용자가 상호작용할 비디오 게임(즉, 대화형 애플리케이션)을 선택하면, 비디오 게임은 컴퓨터에서 실행되고 (로컬로 또는 원격으로) 비디오 게임의 게임 콘텐츠는 렌더링을 위해 HMD로 포워딩된다. 비디오 게임의 선택은 HMD에 제공되는 제어, 제어기에 제공되는 제어 또는 사용자가 동작시키는 다른 입력 디바이스에 제공되는 제어 를 통해 이루어질 수 있다. 비디오 게임은 실질적으로 실시간으로 플레이될 수 있거나 미리 녹화된 이벤트일 수 있으며 라이브 이벤트 또는 미리 녹화된 이벤트의 비디오 게임 콘텐츠가 렌더링을 위해 HMD로 스트리밍된다. 라 이브 이벤트의 경우, HMD의 제어, 제어기의 제어 또는 기타 입력 디바이스의 제어를 사용하거나 입력 인터페이 스를 통해 사용자에 의해 입력이 제공된다. 미리 녹화된 이벤트의 경우, 게임 콘텐츠 데이터저장소에 저장 된 게임 콘텐츠가 검색되고 HMD로 스트리밍된다. 사용자 프로필 파서 엔진(230c)은 사용자가 최초 로그인 시 제공한 프로필 데이터와 사용자의 사용자 프로필에 포함된 추가 데이터를 파싱하여 다양한 종류의 데이터를 식별하고, 사용자 프로필 분류기 엔진(230d)은 다양한 유형의 데이터를 분류한다. 예를 들어, 사용자의 사용자 프로필 데이터는 사용자 식별자와 관련된 데이터, 콘텐 츠 선호도, 디바이스 선호도, 사용자 맞춤화, 사용자 신체적 특성, 사용자 신체적 장애 등을 포함하고 사용자 프로필 분류기 엔진(230d)은 이에 따라 데이터를 분류한다. 사용자의 신체적 특징과 신체적 장애는 사용자에게 콘텐츠를 제공하는 데 사용되는 다양한 렌더링 속성에 대한 사용자의 허용 수준을 설정하고 콘텐츠를 맞춤화하 는 데 사용될 수 있다. 분류된 사용자 프로필 데이터는 추가 프로세싱을 위한 입력으로 머신 러닝 엔진에 포워딩된다. 일 예에서, 사용자의 비디오 게임 선택에 응답하여, 비디오 게임은 컴퓨터에서 실행될 수 있으며(로컬로 또는 원격으로) 비디오 게임의 게임 콘텐츠는 렌더링을 위해 HMD로 포워딩된다. 비디오 게임의 선택은 HMD에 제공되 는 제어, 제어기에 제공되는 제어 또는 사용자가 동작시키는 다른 입력 디바이스에 제공되는 제어를 통해 이루 어질 수 있다. 이 예에서, 비디오 게임은 실질적으로 실시간으로 플레이되며 게임 상태는 HMD나 제어기, 기타 입력 디바이스의 제어를 사용하여 또는 입력 인터페이스를 통해 사용자가 제공하는 게임 입력을 사용하여 업데 이트된다. 업데이트된 게임 상태에 대해 생성된 게임 콘텐츠는 렌더링을 위해 사용자의 HMD로 스트리밍된다. 또 다른 예에서, 비디오 게임의 사용자 선택은 미리 녹화된 게임플레이를 보는 것일 수 있다. 이 예에서, 게임 콘 텐츠 데이터저장소에 저장된 게임 콘텐츠가 검색되어 HMD로 스트리밍된다. 콘텐츠 피쳐 파서 엔진(230e)은 HMD에 렌더링하기 위해 제공되는 게임 콘텐츠를 파싱하여 그 안에 포함된 게임 콘텐츠의 다양한 속성(제공되는 게임 유형, 게임 개체, 게임 장면, 게임 속도, 게임 챌린지, 게임 캐릭터, 게임 도구 등), 콘텐츠를 표시하는 데 사용되는 렌더링 속성 등을 식별하는 데 사용된다. 파싱된 속성은 콘텐츠 피쳐 분류기 엔진(230f)을 사용하여 분류되고, 분류된 게임 콘텐츠는 추가 프로세싱을 위한 입력으로서 머신 러닝 엔 진에 포워딩된다. 사용자가 선택한 게임 콘텐츠는 사용자 상호작용을 위해 HMD로 포워딩된다. 사용자가 콘텐츠와 상호작용하는 동 안, 사용자의 물리적 환경에 배치된 다양한 센서 및 이미지 캡처 디바이스가 활성화되어 사용자의 직접적인 눈 의 피로 지표를 캡처한다. 직접적인 눈의 피로 지표는 사용자가 콘텐츠와 상호작용할 때 눈의 이미지서에 캡처된 눈의 피쳐의 변화(예를 들어, 동공 크기, 형상, 충혈 요인 등의 변화)를 평가함으로써 결정된다. 변화는 사용자가 콘텐츠와 상호작용할 때 이미지에 캡처된 눈의 피쳐를 사용자에 대한 베이스라인 수준을 설정 하는 데 사용된 이미지와 비교함으로써 평가되고 사용자의 베이스라인 수준은 사용자가 HMD를 착용하지 않고 콘 텐츠와 상호 작용하지 않을 때 캡처된 사용자의 눈의 피쳐 및 기타 얼굴 피쳐 이미지를 사용하여 설정되었다. 대안적인 실시예에서, 베이스라인 수준은 사용자에 의한 입력으로서 제공되거나 다른 수단에 의해 또는 다른 소 스로부터 획득된다. 사용자의 얼굴 피쳐의 베이스라인 수준은 사용자 프로필 데이터저장소 내의 사용자 프 로필에 저장될 수 있고 필요할 때 비교를 위해 검색될 수 있다. 직접적인 눈의 피로 지표는 간접적인 눈의 피로 지표를 도출하는 데 사용된다. 센서에 의해 캡처된 직접적인 눈의 피로 지표는 사용자의 눈 형 상에 대한 변화를 포함할 수 있다. 사용자의 눈의 형상의 변화(즉, 눈의 피로도를 직접적으로 표시하는 지표)부 터 사용자가 눈을 가늘게 뜨고 있는지, 눈을 감고 있는지, 아니면 눈을 크게 뜨고 있는지가 결정될 수 있다(즉, 간접적인 눈의 피로 지표 결정). 예를 들어, 사용자가 눈을 가늘게 뜨는 것은 콘텐츠가 너무 밝게 표시되 거나 사용자가 이해하기 어려운 거리에 표시된다는 의미일 수 있다. 센서에 의해 캡처된 이미지는 HMD 또는 컴 퓨터에서 프로세싱되어 직접적인 및 간접적인 눈의 피로 지표를 결정한다. 눈의 피쳐 외에도, 센서는 또한 사용자의 다른 얼굴 피쳐의 이미지, 콘텐츠 렌더링에 사용되는 웨어러블 디바이 스(예를 들어, HMD)의 이미지, 입력을 제공하는 데 사용되는 대화형 디바이스의 이미지, 물리적 환경에 배치된 개체 등을 캡처하도록 구성된다. 기타 얼굴 피쳐, HMD, 대화형 디바이스 및 물리적 환경의 이미지는 HMD 또는 컴퓨터에서 센서가 캡처한 눈의 피쳐의 변화를 추가로 검증하는 데 사용된다. HMD 및 입력 디바이스의 이미지는 내장 센서 및 HMD의 외부 카메라와 HMD 외부의 물리적 환경에 배치된 카메라를 사용하여 개별의 디바이스의 외 부 표면에 배치된 시각적 지표를 추적함으로써 캡처될 수 있다. 내장된 센서, 외향 및 외부 이미지 캡처 디바이 스로부터 수집된 데이터 및 이미지를 사용하여 HMD의 배치, 위치 및 배향을 결정하고, 이를 통해 사용자 머리의 상대적 위치와 물리적 환경에서의 사용자 머리의 상대적 위치가 결정될 수 있다. 눈의 세부사항과 기타 다양한 얼굴 피쳐는 HMD 내부 표면에 있고 사용자의 눈과 기타 얼굴 피쳐를 향해 배향된 내부 카메라를 사용하여 캡처 된다. 다양한 센서 및 이미지 캡처 디바이스는 사용자가 게임 콘텐츠와 상호작용하는 동안 주기적으로 이미지를 캡처하도록 구성될 수 있다. 직접적인 및 간접적인 눈의 피로 지표는 눈의 피로 피쳐 파소 엔진(230a)에 의해 분석되어 본 명세서에 포 함된 다양한 유형의 눈의 피로 지표(예를 들어, 눈의 형상의 변화, 깜박임 패턴 등)와 눈의 피로 지표의 세부사 항(예를 들어, 이러한 변화 정도)을 식별한다. 파싱된 눈의 피로 지표 데이터는 눈의 피로 피쳐 분류기 엔진 (230b)을 이용하여 분류된다. 분류된 눈의 피로 데이터는 추가 프로세싱을 위해 머신 러닝 엔진에 입력으 로 포워딩된다. 머신 러닝 엔진은 다양한 분류기 엔진에 의해 제공되는 입력을 이용하고 입력을 프로세싱한다. 예를 들어, 머신 러닝 엔진은 각각의 눈의 피쳐에서 검출된 변화를 평가하고 변화의 정도와 그러한 변화가 지속되는 시간의 정도를 결정할 수 있다. 평가를 기초로, 머신 러닝 엔진은 특정 눈의 피쳐에 대한 변화가 사용자의 눈의 피로를 유발하는 잠재적 기여 요인으로 간주되는지 여부를 결정할 수 있다. 특정 눈의 피쳐에 대한 변화가 잠재적 기여 요인으로 간주되어야 하는지를 결정하기 위해, 머신 러닝 엔진(23 1)은 사용자에 의해 지정되거나 사용자 프로필 데이터에 포함된 사용자의 허용/민감도 수준의 콘텍스트에서 추 적 가능한 눈의 피쳐의 각각을 검사하여 사용자를 위해 특정 눈의 피쳐의 변화를 더 면밀히 모니터링해야 하는 지 결정한다. 사용자의 눈의 피쳐가 조사된 후, 그런 다음 머신 러닝 엔진은 눈의 피쳐에서 관찰된 변화가 사용자의 관심사임을 고려하고 콘텐츠를 제시할 때 취해야 할 교정 액션을 식별하기 위해 각 눈의 피쳐에 서 관찰되어야 하는 미리 정의된 변화 수준을 설정한다. 민감도나 허용 수준은 사용자마다 다를 수 있으므로, 눈의 피쳐에 대해 설정된 미리 정의된 수준은 사용자마다 다를 수 있다. 또한, 미리 정의된 수준은 게임 콘텐츠 를 제공하는 비디오 게임의 유형(예를 들어, 고강도 게임 또는 저강도 게임)에 따라 콘텐츠별로 다를 수도 있다. 머신 러닝 엔진은 게임 콘텐츠의 일부를 렌더링하는 동안 수집된 분류된 눈의 피로 지표를 검사하여, 부분 을 렌더링하는 동안 캡처된 특정 눈의 피쳐에서 검출된 변화가 눈의 피쳐가 시간이 지남에 따라 변하고, 동일하 게 유지되고, 또는 변화가 중요하지 않은 것에 대해 지정된 미리 정의된 수준을 초과하는지 결정한다. 눈의 피 로 지표 부분마다 다를 수 있으며 이러한 차이는 각 부분에서 게임 콘텐츠를 표시하는 데 사용되는 다양한 렌더 링 속성에 기인할 수 있다. 따라서 해당 부분에서 관찰된 특정 눈 특징의 변화가 미리 정의된 수준을 초과하거 나 시간에 따라 변하는 경우, 머신 러닝 엔진은 특정 눈의 피로 지표를 사용자의 눈의 피로를 유발하는 잠 재적 기여 요인으로 플래그한다. 일부 실시예에서, 특정 눈의 피쳐의 변화는 다른 얼굴 피쳐의 변화를 평가함으로써 추가로 검증될 수 있으며, 여기서 다른 얼굴 피쳐의 변화는 눈의 피쳐의 변화와 관련된 표정의 변화를 나 타낼 수 있다. 일부 실시예에서, 잠재적 기여 요인으로 식별된 눈의 피로 지표는 사용자를 위해 눈의 피로 지표 가 검사된 콘텐츠 부분과 개별의 다른 사용자의 상호 작용 중에 캡처된 다른 사용자의 눈의 피로 지표를 사용하 여 추가로 검증될 수 있다. 일부 실시예에서, 센서는 눈의 형상, 동공의 크기, 눈 깜박임 레이트, 동공의 위치, 눈의 움직임, 이동 속도, 시선 방향, 충혈 요인 등과 같은 관찰된 피쳐를 캡처한다. 시간이 지남에 따라 캡처된 관찰된 피쳐의 이미지는 머신 러닝 엔진에 의해 평가되어 개별의 관찰된 피쳐(즉, 눈의 피로 지표)의 변화를 검출한다. 평가에 기 초하여, 머신 러닝 엔진은 하나 이상의 눈의 피로 지표가 사용자의 눈의 피로에 잠재적인 기여자인 것으로 결정한다. 예를 들어, 사용자가 콘텐츠와 상호작용할 때 동공의 크기가 적어도 미리 정의된 양만큼 증가하였고 이러한 증가가 적어도 미리 정의된 기간 동안 지속되었거나 시간이 지남에 따라 크기가 변하는 경우 동공 크기 의 증가는 사용자의 눈의 피로를 유발하는 잠재적인 요인이 될 수 있다. 눈의 피쳐의 변화는 콘텐츠가 사용자에 게 표시되는 방식으로 인해 발생할 수 있다. 예를 들어, 동공 크기의 증가는 조명이 부족한 게임 콘텐츠로 인해 발생할 수 있다. 마찬가지로, 동공 크기의 감소는 콘텐츠에 너무 많은 빛이 제공되기 때문에 발생할 수 있다. 위의 예에서, 동공의 크기가 콘텐츠의 렌더링 속성에 영향을 받는 것으로 나타났다. 형상, 충혈 요인, 깜박임 패턴, 동공 크기 등과 같은 다양한 눈의 피쳐의 변화가 모니터링되고 검사되어, 각 눈의 피쳐의 변화가 결정될 수 있다. 위에서 언급된 것처럼, 눈의 피쳐의 변화는 콘텐츠의 렌더링 속성에 영향을 받을 수 있다. 사용자가 콘텐츠와 상호작용할 때 사용자에게서 관찰된 눈의 피쳐의 변화를 분석하는 것의 일부로서, 일부 실시 예에서, 머신 러닝 엔진은 사용자에게서 관찰된 눈의 피쳐의 변화에 대한 추가 검증을 수행할 수 있다. 예 를 들어, 머신 러닝 엔진은 콘텐츠의 일부와 상호작용한 다른 사용자에 의해 제공되는 반응을 사용하여 콘 텐츠의 일부에 대해 사용자에게서 검출된 눈의 피쳐의 변화가 다른 사용자에서도 검출되었는지 결정할 수 있다. 머신 러닝 엔진은 해당 부분에 포함된 게임 콘텐츠의 콘텍스트에서 사용자의 눈의 피쳐의 변화를 검사하여 사용자의 하나 이상의 눈의 피쳐에서 검출된 변화와 게임 콘텐츠의 하나 이상의 렌더링 속성 사이의 상관관계를 결정한다. 예를 들어, 사용자가 콘텐츠의 특정 부분과 상호작용하는 동안, 사용자의 동공 크기에서 검출된 변화 가 미리 정의된 한도를 초과한 경우, 특정 부분에 있는 콘텐츠의 렌더링 속성이 검사되어 특정 부분에 콘텐츠를 표시하는 데 사용된 렌더링 속성이 그러한 변화를 야기할 수 있는지를 결정한다. 콘텐츠가 너무 밝게 표시되면 눈의 자연스러운 본능은 통과하는 빛의 양을 줄이기 위해 좁아지는 것(즉, 동공 크기 감소)이라는 것이 잘 알려 져 있다. 마찬가지로 콘텐츠가 너무 어둡게 표시되면 더 많은 빛이 통과할 수 있도록 동공 크기가 증가된다. 콘 텐츠의 렌더링 속성과 동공 크기의 증가의 검사에 기초하여, 머신 러닝 엔진은 동공 크기의 증가를 밝게 표시되는 콘텐츠와 상관시킬 수 있다. 머신 러닝 엔진은 동공 크기에서 검출된 변화가 일시적인지 또는 장 기간 지속되었는지를 결정하기 위해 콘텐츠와 콘텍스트를 추가로 검사할 수 있다. 예를 들어 콘텐츠에 포함된 빛의 섬광으로 인해 순간적인 변화가 발생할 수 있다. 동공 크기의 변화가 짧은 기간 동안 지속되면 머신 러닝 엔진은 동공 크기의 변화를 무시할 것이다. 그러나 동공 크기의 증가가 장기간 지속된다면, 머신 러닝 엔 진은 콘텐츠의 콘텍스트 및 렌더링 속성을 검사하여 변화가 렌더링 속성의 변화(콘텐츠가 너무 밝게 표시 됨)으로 인한 것인지, 아니면 사용자가 경험하는 눈의 피로로 인한 것인지 결정한다. 눈의 피로는 사용자가 HMD 에 표시되는 콘텐츠와 장시간 상호작용한 결과일 수 있다. 따라서 머신 러닝 엔진은 다양한 분류기에 의해 제공되는 모든 입력을 고려하여 사용자에게서 검출된 눈의 피쳐의 변화를 다른 사용자에게서 검출된 변화 및 콘 텐츠와 상관시키고, 변화를 콘텐츠의 일부를 표시하는 데 사용되는 렌더링 속성 중 특정 속성과 연관시킨다. 머 신 러닝 엔진은 사용자에게 제시된 다양한 콘텐츠와 사용자의 반응을 검사하는 것으로부터 딥 러닝을 이용 하여 사용자의 눈의 피쳐 변화가 콘텐츠에 적합하며 사용자별로 또는 콘텐츠별로 다르다는 것을 확립한다. 위의 예는 단일 눈의 피로 지표와 특정 렌더링 속성 사이의 간단한 상관관계를 보여준다. 그러나 게임 콘텐츠를 표시하는 데 사용되는 하나 이상의 렌더링 속성에 의해 영향을 받을 수 있는 눈의 피로 지표가 두 개 이상 있을 수 있다. 각 렌더링 속성이 눈의 피로 지표에 미치는 영향을 더 잘 이해하려면, 머신 러닝 엔진은 눈의 피 로 AI 모델(또는 이하 간단히 \"AI 모델\"이라고 함)을 구축하고 훈련한다. AI 모델은 미디어 콘텐츠의 렌더링 속성과 다양한 센서에 의해 캡처된 사용자의 눈 및 기타 얼굴 피쳐를 사용하여 구축되고 훈련된다. 예를 들어, 미디어 콘텐츠의 속성과 사용자의 관찰 가능한 피쳐는 기준 매트릭스를 정의하는 데 사용되며, 매트릭스 의 각각의 요소는 하나 이상의 눈의 피로 지표(예를 들어, 눈 깜박임 레이트, 동공 크기, 눈 형상, 시선 방향, 동작, 동작 방향 등과 같은 눈의 피쳐 및 사용자의 머리, 코, 입 등의 위치, 방향, 배향과 같은 기타 얼굴 피쳐, 다양한 얼굴 피쳐의 움직임 및 움직임 방향 등)와 관련된 기준에 의해 정의되고, 각각의 피로 지표는 게 임 콘텐츠를 표시하는 데 사용되는 하나 이상의 렌더링 속성에 의해 영향을 받는 하나 이상의 눈의 피쳐 및/또 는 하나 이상의 기타 얼굴 피쳐의 변화를 캡처한다. 콘텐츠의 관찰 가능한 피쳐와 속성 외에도 각각의 기준은사용자의 관찰 가능한 피쳐(예를 들어, 눈 및 기타 얼굴 피쳐)에 대한 상호작용 시간의 영향을 설명하기 위해 시간의 함수로 정의될 수도 있다. 각각의 기준을 정의하는 데 사용되는 시간 요인은 상호작용 시간이 사용자의 관찰 가능한 눈과 얼굴 피쳐에 미치는 영향뿐만 아니라 특정 렌더링 속성이 콘텐츠 일부에 영향을 미치는 시간 의 양도 고려한다. 일부 실시예에서, 개별의 기준을 나타내는 각각의 노드의 변수는 부울 형식(Boolean forma t)으로 정의된다. AI 모델은 상호 연결 노드의 복수의 레이어를 포함하도록 구축되며, 각각의 연속 레이어 의 노드는 이전 레이어의 하나 이상의 노드에 포함된 기준을 추가로 미세하게 튜닝한다(fine-tuning). 머신 러닝 엔진은 가중치 할당 엔진을 사용하여 각각의 기준에 포함된 각각의 눈의 피쳐에 대한 가중 치를 할당하고, 할당된 가중치는 각각의 기준에 포함된 개별의 눈 특징에서 관찰된 변화가 사용자의 눈의 피로 를 유발하는데 미치는 영향의 정도에 대응한다. 일부 실시예에서, 가중치 할당 엔진은 각각의 눈의 피쳐에 대해 별개의 가중치를 할당한다. 다른 실시예에서, 가중치 할당 엔진은 대응하는 눈의 피로 지표와 연관된 사용자의 두 개 이상의 눈의 피쳐에 대해 동일한 가중치를 할당한다. 일부 실시예에서, 특정 눈의 피쳐의 변화는 그 자체 로는 중요하지 않은 것으로 간주될 수 있지만, 그러나 특정 눈의 피쳐에서 관찰된 변화는, 조합된 변화가 개별 적으로는 중요하지 않더라도 사용자의 전반적인 눈의 피로에 여전히 영향을 미칠 수 있기 때문에, 다른 눈의 피 쳐에서 관찰된 변화와 함께 고려할 때 중요할 수 있다. 일부 실시예에서, 사용자의 전반적인 눈의 피로를 결정 하는 데 있어서 각각의 눈의 피쳐가 미치는 영향의 양은 사용자의 시각적 특성에 따라 달라질 수 있다. 예를 들 어, 사용자는 어두운 빛보다 밝은 빛에 더 민감하거나 콘텐츠가 렌더링되는 고속보다 평균 속도에 더 민감할 수 있으며 눈에서 관찰되는 눈의 피로 지표와 사용자의 기타 얼굴 피쳐는 사용자가 게임 콘텐츠와 상호작용할 때 이를 반영할 수 있다(즉, 할당된 가중치는 각 눈의 피쳐가 눈의 피로에 미치는 영향의 수준을 기초로 함). 일부 실시예에서, 하나 이상의 눈의 피로 지표가 사용자의 눈의 피로를 유발하는 요인이 될 수 있으므로, AI 모델 을 구축하는 데 사용되는 매트릭스의 기준 중 특정 기준은 둘 이상의 눈의 피로 지표(즉, 둘 이상의 눈의 피쳐에 대한 변화)를 포함하도록 정의되는 반면, 매트릭스의 기준 중 다른 특정 기준은 단일 눈의 피로 지표를 포함하도록 정의된다. 매트릭스의 각각의 기준을 정의하는 데 사용되는 각각의 눈의 피쳐에 할당된 가중치(들) 는 기준에 대한 복합 값(composite value)을 계산하는 데 사용되며, 복합 값은 개별의 기준을 정의하는 각각의 눈의 피쳐에 할당된 가중치를 통합한 것이다. 각각의 기준에 대해 계산된 복합 값은 메트릭스의 개별의 요소와 연관되어 기준을 정의하는 눈의 피쳐 변수가 사용자의 눈에 미치는 영향을 정량화한다. 일부 실시예에서, 복합 값은 기준(즉, 기준을 정의하는 특정 눈의 피로 지표)이 매트릭스의 다른 기준에 비해 사용자의 눈의 피로를 유 발하는 데 있어서 갖는 상대적인 영향을 정의한다. 기준의 각각이 모니터링되고, 기준에 포함된 임의의 눈의 피 로 지표가 미리 정의된 한계(예를 들어, 수준 또는 값)를 초과하거나 거의 초과하는 경우, 눈의 피로 검출기 엔 진에 이를 나타내도록 지표가 설정된다. 일부 실시예에서, 지표는 매트릭스의 요소와 연관된 AI 모델(23 2)의 노드에 대응하도록 설정된 플래그일 수 있다. 일부 실시예에서, 플래그는 이진수로 정의된다. 지표 외에도, 노드와 연관된 복합 값, 각각의 눈의 피쳐에 할당된 가중치 및 노드의 기준을 정의하는 하나 이상의 눈 의 피쳐가 미리 정의된 한계를 초과하는 정도가 또한 노드에 대해 정의될 수 있다. 관찰 가능한 피쳐를 캡처하는 센서 데이터가 점점 더 많이 수집됨에 따라, AI 모델은 캡처된 센서 데이터 를 포함하도록 정제된다. 머신 러닝 엔진은 훈련된 AI 모델을 사용하여 사용자에 의해 표현된 특정 눈의 피쳐의 세트에 대응하고 사용자를 위해 콘텐츠의 현재 부분을 렌더링하는 데 사용되는 렌더링 속성의 유형 에 대한 출력을 식별한다. 렌더링 속성이 기준에 포함되지 않은 경우, 머신 러닝 엔진은 기준/기준들에 포 함된 눈의 피쳐로부터 식별된 눈의 피로 지표를 분석하고 현재 콘텐츠를 표시하는 데 사용되는 관련 렌더링 속 성을 결정하기 위해 현재 콘텐츠를 검사한다. AI 모델로부터 식별된 출력은 머신 러닝 엔진에 의해 액션 설정 로직(236/238)으로 포워딩된다. 일부 실시예에서, 액션 설정 로직(236/238)으로 포워딩되는 출력은 지표의 설정을 트리거한 기준/기준들을 포함 한다. 일부 다른 실시예에서, 기준에 추가하여, 기준을 플래그하도록 설정된 지표는 또한 액션 설정 로직 (236/238)으로 포워딩된다. 액션 설정 로직(236/238)은 사용자의 눈의 피로를 줄이거나 방지하기 위해 비디오 게임에 의해 취해질 수 있는 액션을 식별하기 위해 기준과 지표(사용 가능한 경우)를 사용한다. 액션(24 0)은 렌더링을 위해 후속 콘텐츠를 HMD로 포워딩하기 전에 특정 하나 이상의 렌더링 속성 및 렌더링 속성 중 특 정 하나 이상이 현재 콘텐츠에 뒤따르는 후속 콘텐츠에 대해 조정되어야 하는 양을 식별하여, 조정된 후속 콘텐 츠가 사용자의 눈의 피로를 감소시키거나 예방할 수 있도록 한다. 조정을 위한 렌더링 속성 중 특정 속성(들)은 사용자에게 제시된 현재 게임 콘텐츠를 분석하여 식별된다. 렌더링 속성 중 특정 속성을 조정하기 위한 액션 은 게임 콘텐츠의 후속 부분이 렌더링 속성 중 특정 속성을 포함한다고 결정할 때 식별된다. 일부 실시예에서, 액션은 특정 방식으로 콘텐츠를 조정하기 위한 명령어를 제공하는 커맨드를 포함한다. 지정된 액션 중 하나는 사용자가 콘텐츠로부터 휴식을 취할 수 있도록 비디오 게임을 일시 중지하는 것이다. 또 다른 액션은 포비티드(foveated) 렌더링을 위해 식별된 콘텐츠의 후속 부분의 섹션(들)을 조정하는 것일 수 있 다. 렌더링 속성을 조정하는 경우, 액션은 비디오 게임의 후속 부분에 대해 조정될 필요가 있는 렌더링 속 성 중 특정 속성과 각각의 식별된 렌더링 속성에 대해 수행되어야 하는 조정의 양을 식별하는 커맨드를 포함한 다. 일부 실시예에서, 커맨드는 또한 한 번에 하나의 렌더링 속성씩 렌더링 속성 중 특정 속성을 조정하기 위한 명령어를 제공한다. 따라서, 머신 러닝 엔진은 눈의 피쳐의 변화를 모니터링하고 사용자의 눈의 피쳐의 변 화에 대응하는 게임 콘텐츠의 콘텍스트에서의 변화를 검사함으로써 눈의 피로 메트릭을 계산한다. 계산된 눈의 피로 메트릭은 계산이 사용자의 시각적 특성과 민감도를 고려하므로 사용자에게 특정하다. 언급된 바와 같이, 머신 러닝 엔진에 의해 식별된 출력은 눈의 피로 검출기 엔진에 의해 액션 설정 로직으로 포워딩된다. 눈의 피로 검출기 엔진이 운영 체제의 일부인 경우, 액션 설정 로직도 운영 체 제의 일부일 수 있다. 눈의 피로 검출기 엔진이 비디오 게임 애플리케이션과 같은 대화형 애플리케이션의 일부인 경우, 액션 설정 로직은 비디오 게임 로직의 일부일 수 있다. 대안적으로, 액션 설정 로직은 조정된 게임 콘텐츠가 렌더링을 위해 사용자의 HMD로 포워딩되기 전에 펌웨어에 포함되거나 비디오 게임 애플리 케이션의 게임 콘텐츠에 액세스할 수 있는 다른 애플리케이션(예를 들어, 위젯)에 내장될 수 있다. 일부 실시예 에서 머신 러닝 엔진에 의해 식별된 출력은 눈의 피로 메트릭(눈의 피로 지표, 복합 값, 플래그된 지 표 등을 식별함) 및 게임 콘텐츠에서 조정되어야 하는 렌더링 속성 중 특정 속성의 지표를 포함한다. 일부 다른 실시예에서, 머신 러닝 엔진에 의해 식별된 출력은 눈의 피로 메트릭을 포함한다. 이러한 실시예에서, 액션 설정 로직(236/238)은 커맨드를 해석하고, HMD에서 렌더링된 현재 콘텐츠를 표시하는 데 사용 되는 렌더링 속성을 식별하고, 조정이 필요한 특정 렌더링 속성을 식별하고, 조정이 필요한 렌더링 속성 중 특 정 속성이 콘텐츠의 후속 부분에도 포함되어 있는지 확인하고, (렌더링 속성이 식별되지 않은 경우) 렌더링 속 성의 특정 속성의 각각이 후속 부분에서 조정되어야 하는 수준을 확인하여 후속 부분의 렌더링 속성을 조정하기 위해 비디오 게임으로 포워딩될 액션을 식별하도록 구성된다. 사용자의 HMD에 게임 콘텐츠를 제공하는 비디오 게임은 액션 게임일 수 있고, 비디오 게임의 후속 부분은 비디 오 게임의 현재 상태와 비디오 게임의 현재 부분에서 사용자가 제공한 입력을 기초로 동적으로 결정될 수 있다. 이러한 경우, 머신 러닝 엔진은 게임 상태와 사용자의 입력을 분석하고 비디오 게임의 게임 로직에 질의함으로써 현재 부분의 렌더링에 이어 렌더링을 위해 식별된 비디오 게임의 후속 부분을 예측할 수 있다. 일 단 식별되면, 비디오 게임에서 발생할 것으로 예측되는 후속 부분은 비디오 게임의 게임 로직에 질의함으 로써 검사되어, 현재 부분 다음에 발생할 것으로 예측되는 게임 콘텐츠의 후속 부분을 렌더링하기 위해 포함되 는 렌더링 속성을 결정한다. 후속 부분에 포함된 게임 콘텐츠를 이용하여, 머신 러닝 엔진은 사용자가 후 속 부분과 상호작용하는 동안 나타날 가능성이 있는 눈의 피로 지표를 예측한다. 눈의 피로 지표의 예측은 사용 자가 게임 콘텐츠의 현재 부분과 상호 작용하는 동안 사용자로부터의 그리고 예측된 후속 부분에 포함된 렌더링 속성으로부터의 검출된 눈의 피로 지표를 기초로 한다. 머신 러닝 엔진은 게임 콘텐츠의 후속 부분에 대한 눈의 피로 메트릭을 계산하고 계산된 눈의 피로 메트릭을 사용하여, 콘텐츠를 보거나 상호작용하기 위해 HMD를 확장 사용하는 동안 사용자가 경험하는 일반적인 문제인, 눈의 피로와 멀미를 경험하지 않고 사용자 가 게임 콘텐츠와 상호작용하는 데 도움을 주기 위해 취해야 할 적절한 액션을 식별한다. 눈의 피로 지표는 시간에 따라 변할 수 있고(예를 들어, 눈 깜박임 레이트 또는 건조함이나 충혈 요인은 사용자 가 장기간에 걸쳐 콘텐츠와 상호작용함에 따라 변할 수 있음) 사용자마다 변할 수 있다는 점에 유의해야 한다. 눈의 피로 검출기 엔진은 각 사용자에 대해 식별될 수 있는 각각의 눈의 피로 지표에 대한 베이스라인 수 준을 교정함으로써 각각의 사용자에 대한 눈의 피로 메트릭을 계산한다. 베이스라인 측정은 사용자가 콘텐 츠와 상호 작용하기 전에 사용자의 눈의 피쳐를 캡처하는 테스트를 수행함으로써 활성 교정을 통해 초기에 확립 된다. 캡처된 눈의 피쳐를 사용하여, 각각의 사용자에 대한 눈의 피로 지표의 베이스라인 수준이 확립될 수 있 다. 사용자가 대화형 애플리케이션의 콘텐츠(예를 들어, 비디오 게임의 게임 콘텐츠)와 상호작용함에 따라, 눈 의 피로 지표는 사용자가 게임 콘텐츠와 상호작용하는 동안 주기적으로 캡처되고 각각의 사용자에 대해 결정된 베이스라인 수준과 비교되어 눈의 피로를 교정한다. 사용자에 대한 눈의 피로의 교정은 사용자의 시각적 특성, 사용자의 선호도 및 게임 콘텐츠 사용자 맞춤화를 기초로 계산되므로 사용자마다 다르다. 또한 교정에서는 각각 의 눈의 피로 지표에 할당된 가중치를 고려하고, 할당된 가중치는 눈의 피로 지표가 검출된 시간과 사용자가 콘 텐츠와 상호작용하는 데 참여한 시간을 반영하도록 조정된다. 일부 실시예에서, 액션 설정 로직(236/238)에 의해 식별된 액션은 수신 시 그 안에 포함된 커맨드를 실행 하라는 명령어와 함께 비디오 게임으로 포워딩된다. 이 커맨드는 비디오 게임에 의해 생성된 후속 게임 콘텐츠의 렌더링 속성 중 어느 속성(들)을 조정할지 지정한다. 일부 다른 실시예에서, 액션을 비디오 게임으로 포워딩하는 대신, 액션은 인코딩 및 송신을 위해 비디오 게임의 게임 콘텐츠를 수신하는 인코더/디코더 모 듈(CODEC)(도시되지 않음)으로 포워딩될 수 있다. CODEC에 대한 액션은 수신 시 커맨드를 실행하라는 명령 어를 포함한다. 이에 대한 응답으로, CODEC은 인코딩 및 렌더링을 위해 HMD로 송신 전에 비디오 게임에서 수신 된 게임 콘텐츠의 후속 부분의 렌더링 속성을 조정함으로써 커맨드를 실행한다. 사용자가 볼 때 조정된 게임 콘 텐츠는 눈의 피로를 줄이는 데 도움이 된다. 도 4a 내지 4c는 일부 구현예에서 시간에 따른 단일 눈의 피로 지표의 변화를 플로팅함으로써 생성된 샘플 그래 프를 예시한다. 도 4a는 사용자가 게임 콘텐츠와 상호작용할 때 시간이 지남에 따라 사용자의 동공 크기(즉, 눈 의 피로 지표)의 변화를 추적하고 평가함으로써 플로팅된 그래프를 예시한다. 그래프 A에 도시된 바와 같이, 사 용자의 동공 크기는 시간이 지나도 크게 변하지 않을 수 있다. 입력 데이터의 다양한 특성과 속성을 살펴보면, 게임 콘텐츠의 렌더링 속성은 시간이 지나도 크게 변하지 않았음을 알 수 있으며, 이는 그래프 A에서 관찰된 사 용자의 동공 크기의 최소 변화와 상관된다. 도 4b는 사용자가 게임 콘텐츠와 상호작용할 때 시간 경과에 따라 캡처된 사용자의 동공 크기 변화를 플로팅함으로써 생성된 또 다른 예시적인 그래프 라인을 예시한다. 그래프 라인 B에 도시된 바와 같이, 동공 크기는 사용자가 게임 콘텐츠와 상호작용하는 동안 짧은 기간 동안 크기가 눈 에 띄게 변한 것으로 나타났으며 그 변화는 적어도 미리 정의된 한계와 동일하다. 게임 콘텐츠의 렌더링 속성을 살펴보면, 동공 크기의 짧은 급증은 사용자에게서 동공 크기의 급증이 관찰된 기간 동안 비디오 게임의 게임 콘 텐츠 내에서 발생한 밝은 빛의 섬광과 상관관계가 있는 것으로 관찰되었다. 이 예에서, 변경은 적어도 미리 정 의된 수준만큼 사용자의 동공 크기가 감소함으로써 보여지며, 여기서 미리 정의된 수준은 백분율 또는 치수 측 정치로 정의된다. 도 4c는 그래프 라인 C가 시간 경과에 따른 동공 크기의 변화에 대해 플롯팅된 또 다른 대체 그래프를 예시한다. 그래프 C에 도시된 바와 같이, 사용자가 게임 콘텐츠와 상호작용하는 동안 동공 크기는 시 간이 지남에 따라 꾸준히 증가하는 도시된다. 입력 데이터의 다양한 특성과 속성을 검토함으로써, 동공 크기의 꾸준한 증가는 게임 콘텐츠의 렌더링 속성의 급격한 변화로 인한 것이 아님을 알 수 있다. 좀 더 자세히 살펴보 면, 꾸준한 증가는 사용자의 게임 콘텐츠와의 상호작용 기간이 길어진 것에 기인한 것으로 결정된다. 이 예에서, 사용자에게서 관찰된 동공 크기의 변경은 시간이 지남에 따라 천천히 꾸준히 증가하는 동공 크기의 증 가였다. 도 5a 및 도 5b는 사용자가 비디오 게임의 게임 콘텐츠와 상호작용할 때 사용자의 눈의 피로 지표(예를 들어, 충혈 요인)의 변화를 플로팅함으로써 생성된 그래프의 샘플 세트를 예시한다. 예를 들어, 그래프 A는 게임 플레 이 초기에는 사용자의 눈이 붉어지는 현상이 별로 나타나지 않았으나, 게임을 계속할수록 붉어짐 요인이 꾸준히 증가하는 시나리오를 나타낸다. 그래프 라인 A'는 게임플레이 시작 시 사용자의 눈이 어느 정도 붉어지는 시나 리오를 나타내며, 이는 사용자가 게임 플레이에 계속 참여하면 천천히 꾸준히 증가한다. 충혈 요인(즉, 눈의 피 로 지표)은 사용자가 비디오 게임을 플레이하는 동안 지속적으로 또는 주기적으로 모니터링되며, 충혈 요인의 증가는 미리 정의된 임계 수준과 주기적으로 비교된다. 충혈 요인이 미리 정의된 임계 수준을 초과하면, 액션 이 식별되고 트리거된다. 도 5b는 그러한 시나리오 중 하나를 예시한다. 도 5b의 그래프 라인 B에 도시된 바와 같이, 사용자의 눈을 모니터링하는 동안, 충혈 요인의 증가가 미리 정의된 임계치를 충족하거나 초과하는 것으로 검출되면, 액션이 눈의 피로 검출기 엔진의 액션 설정 로직(236/238)에 의해 식별되어 비디오 게임으로 송신된다. 액션은 사용자가 게임 플레이에서 휴식을 취하고 눈을 쉴 수 있도록 비디오 게임을 일 시 중지하는 것일 수 있다. 이는 도 5b에 일시 중지 포인트 1로 도시된다. 사용자가 게임플레이를 재개하기를 원할 때, 눈의 피로 검출기 엔진은 일시 정지 포인트부터 비디오 게임의 게임플레이를 시작하기 위한 제2 액션을 식별하고 개시한다. 식별된 액션은 사용자에게서 관찰된 눈의 피로 지표에 따라 달라질 수 있으며, 도 5a 및 5b에 도시된 시나리오에서는 일시 중지 신호가 사용자의 눈의 피로를 줄이는 데 적절한 것으로 도시된다 는 점에 유의해야 한다. 식별된 액션은 비디오 게임의 게임 콘텐츠의 후속 부분에 대해 수행하기 위한 것이며, 게임 콘텐츠의 현재 부분까지 이어지는 사용자의 눈의 피로 지표를 모니터링함으로써 식별된다는 점에 유의해야 한다. 도 6a 및 도 6b는 일부 구현 예에서 사용자가 비디오 게임의 현재 부분과 상호작용하는 동안 눈의 피로 지표의 변화를 플롯팅함으로써 생성되고 비디오 게임의 후속 부분에서 취해야 할 교정 액션을 식별하기 위한 그래프의 또 다른 샘플 세트를 예시한다. 도 6a 및 도 6b에 예시된 그래프 라인은 단일 눈의 피로 지표 또는 복수의 눈의 피로 지표의 변화를 고려함으로써 플로팅된다. 사용자가 게임플레이에 참여하면, HMD에서 렌더링되는 게임플레 이의 현재 부분에 대한 사용자의 눈의 피로 지표가 모니터링된다. 도 6a 및 6b에서, 현재 부분은 점선 직사각형 \"A\"로 도시된다. 눈의 피로 검출기 엔진은 눈의 피로 지표를 미리 정의된 임계 수준과 비교하여 눈의 피로 지표의 임의의 것 또는 집합이 미리 정의된 임계 수준을 초과했는지 확인한다. 눈의 피로 지표가 임계 수준을초과하는 경우, 눈의 피로 검출기 엔진은 머신 러닝 엔진을 사용하여 사용자의 눈의 피로를 줄이기 위해 수행되어야 하는 액션을 식별한다. 눈의 피로 지표가 임계 수준 내에 있는 경우, 눈의 피로 검출기 엔진 은 게임플레이 과정 동안 사용자의 눈의 피로 지표를 계속해서 모니터링한다. 이러한 경우, 눈의 피로 검 출기 엔진은 눈의 피로 지표가 미리 정의된 임계 수준을 초과할 가능성이 있는지 결정하기 위해 게임 콘텐 츠의 후속 부분을 식별하고 검사한다. 게임플레이 중에 사용자가 취할 수 있는 다양한 액션과 경로로 가득한 고 강도 비디오 게임에서, 후속 부분을 예측하는 것은 사용자의 눈의 피로 수준을 결정하고 사용자의 눈의 피로를 줄이는 데 도움이 되도록 비디오 게임 내에서 수행할 액션을 사전에 식별하는 데 유용할 수 있다. 눈의 피로 검출기 엔진은 현재 게임 상태, 현재 게임 콘텍스트, 비디오 게임의 현재 부분에서 사용자가 제 공한 사용자 입력을 기초로 도 6a에서 점선 직사각형 \"B\"로 도시된 게임 콘텐츠의 후속 부분을 예측한다. 눈의 피로 검출기 엔진은 비디오 게임의 후속 부분이 사용자에게 눈의 피로를 유발할 가능성이 있는 게임 콘텐 츠를 포함하도록 설계되었는지 결정하기 위해 비디오 게임 로직에 질의할 수 있다. 예측된 후속 부분에 포 함되는 게임 콘텐츠의 유형을 결정하는 것에 기초하여, 눈의 피로 검출기 엔진은 사용자가 눈의 피로를 경 험할 가능성을 예측할 수 있다. 이러한 예측 결과를 기초로, 눈의 피로 검출기 엔진에 의해 작동되는 액션 설정 로직(236/238)은 사용자를 돕기 위해 비디오 게임 내에서 취해질 수 있는 액션을 식별한다. 액션은 비디오 게임의 게임 콘텐츠의 후속 부분을 제시하기 위해 사용되는 하나 이상의 렌더링 속성을 조정(즉, 축소 또는 강 화)하고 비디오 게임을 일시 중지하고 수신 즉시 액션을 수행하기 위한 명령어를 포함할 수 있다. 액션의 조정 을 위해 둘 이상의 렌더링 속성이 식별된 경우, 액션은 한 번에 하나의 렌더링 속성을 조정하는 명령어를 포함 할 수 있다. 또한 명령어는 이러한 조정이 수행되어야 하는 속도(예를 들어, 점진적, 갑작스러운 등)를 지정할 수도 있다. 식별된 액션은 도 6b에서 점선 직사각형 \"B'\"로 도시된 바와 같이 콘텐츠의 예측된 후속 부분이 실제로 발생하 도록 예정되어 있다는 결정 시 렌더링 속성 중 하나 이상을 교정(즉, 조정)하는 동작을 수행하기 위해 비디오 게임으로 포워딩된다. 비디오 게임은 액션 수신에 응답하여 그 안에 포함된 명령어를 실행함으로써 액션을 수행 한다. 도 6b는 점선 직사각형 'C'로 도시된 바와 같이 비디오 게임에 의해 액션이 수행되는 하나의 그러한 예를 예시한다. 명령어를 기초로, 비디오 게임은 렌더링을 위해 HMD로 포워딩되기 전에 비디오 게임의 후속 부분에 대해 생성된 게임 콘텐츠의 하나 이상의 렌더링 속성을 조정한다. 조정된 후속 부분은, HMD에서 렌더링될 때, 도 6b에 예시된 그래프 라인의 점선 섹션 'D'에 도시된 바와 같이 사용자의 눈의 피로를 줄이는 데 도움이 된다. 도 7a는 일 실시예에서, 사용자가 착용한 HMD에서 렌더링되는 비디오 게임의 게임 콘텐츠와 사용자가 상호작용 할 때 사용자의 눈의 피로를 줄이기 위해 사용되는 방법의 동작 흐름을 예시한다. 이 방법은 동작에서 시 작하는데, 여기서 사용자가 비디오 게임의 게임 콘텐츠를 보고/상호작용할 때 사용자의 눈의 피로 지표가 모니 터링된다. 일부 실시예에서 눈의 피로 지표는 잠재적으로 사용자의 눈의 피로를 유발할 수 있는 사용자의 눈의 피쳐 및 기타 얼굴 피쳐에서 관찰된 변화를 지칭한다. 눈의 피로 지표는 직접적인 눈의 피로 지표(즉, 센 서에 의해 캡처된 관찰된 눈의 피로 지표)와 간접적인 눈의 피로 지표(즉, 직접적인 눈의 피로 지표 로부터 도출됨) 모두를 포함한다. 그런 다음 눈의 피로 지표는 동작에 예시된 바와 같이 눈의 피로 메트릭 을 계산하는 데 사용된다. 눈의 피로 메트릭은 게임 콘텐츠의 현재 부분에서 사용자의 상호작용 중에 수집된 눈 의 피로 지표를 사용자에 대해 확립된 베이스라인 수준과 비교하여 계산된다. 눈의 피로 메트릭은 사용자가 게 임 콘텐츠와 상호작용하는 동안 잠재적으로 경험할 수 있는 눈의 피로 수준을 정의하기 위해 계산된다. 계산된 눈의 피로 메트릭에 기초하여, 동작에 예시된 바와 같이, 게임 콘텐츠에 대해 수행될 액션이 식별 된다. 액션은 잠재적으로 사용자에게 눈의 피로를 유발하는 것으로 식별된 눈의 피로 지표에 대응하며 비디오 게임의 후속 부분에 대해 생성된 게임 콘텐츠에 대한 액션을 수행하기 위한 명령어를 포함한다. 이 액션은 후속 부분에서 조정되어야 하는 특정 렌더링 속성, 렌더링 속성 중 특정 속성을 조정해야 하는 수준, 그러한 조정을 수행해야 하는 모드(예를 들어, 점진적, 갑작스러운 등)을 식별한다. 식별된 액션은 동작에 예시된 바와 같이 실행을 위해 비디오 게임으로 포워딩된다. 비디오 게임은 액션을 개시하고 액션에 포함된 명령어에 따라 렌더링 속성 중 특정 속성을 조정한다. 비디오 게임의 후속 부분에 대해 조정된 게임 콘텐츠는 사용자에게 렌더 링하기 위해 HMD로 송신된다. 도 7b는 대안적인 실시예에서 비디오 게임의 게임 플레이 동안 HMD를 착용하고 디스플레이 화면에 렌더링된 게 임 콘텐츠와 상호작용하는 사용자의 눈의 피로를 줄이기 위한 방법의 동작 흐름을 예시한다. 방법은 동작 에서 시작하며, 여기서 사용자가 게임 콘텐츠의 제1 부분과 상호작용하는 동안 사용자의 눈의 피로 지표가 모니 터링된다. 눈의 피로 지표는 센서(예를 들어, 이미지 캡처 디바이스, IMU 센서 등)에 의해 캡처된 이미지를 사용하여 모니터링된다. 캡처된 눈의 피로 지표는 동작에 예시된 바와 같이 눈의 피로 메트릭을 계산하는 데 사용되며, 눈의 피로 메트릭은 사용자가 현재 경험하고 있는 눈의 피로 수준을 나타낼 수 있다. 방법은 동작으로 진행하고, 여기서 현재 부분 다음에 발생할 것으로 예측되는 비디오 게임의 제2 부분이 식별되고 검사된다. 언급된 바와 같이, 사용자가 비디오 게임을 진행하는 데 사용할 수 있는 많은 액션과 경로 가 있는 고강도 게임에서, 사용자는 여러 경로 중 하나를 선택할 수 있다. 사용자의 눈의 피로를 완화하기 위한 적극적인 교정 액션을 취하기 위해, 눈의 피로 검출기 엔진은 HMD에서 현재 렌더링되는 게임 콘텐츠의 제1 부분, 사용자가 제공한 게임 입력, 제1 부분의 게임 콘텍스트를 분석함으로써 비디오 게임에서 발생할 가능성이 있는 제2 부분을 예측적으로 결정한다. 그 다음, 눈의 피로 검출기 엔진은 비디오 게임 로직에 질의 하여 제2 부분에 포함된 액션 및 챌린지의 유형과 비디오 게임의 제2 부분에 포함될 수 있는 게임 콘텐츠를 식 별한다. 그 다음, 눈의 피로 검출기 엔진은 게임 콘텐츠의 제2 부분을 사용자에게 제시하는데 사용될 렌더 링 특성을 결정하기 위해 제2 부분에 포함될 가능성이 있는 게임 콘텐츠를 검사한다. 계산된 눈의 피로 메트릭 과 제2 부분에서 사용될 가능성이 있는 렌더링 특성을 기초로, 제1 부분에 사용된 렌더링 특성 및 제2 부분에 포함되도록 정의된 렌더링 특성에 대응하는 액션이 식별된다. 식별된 액션은 일부 실시예에서 눈의 피로 검출기 엔진이 사용자에게 눈의 피로를 유발할 가능성이 있다고 결정하는 렌더링 속성 중 특정 속성을 조정하기 위한 명령어 및 수신 시 액션을 실행하라는 명령어와 함께 커맨드를 포함한다. 식별된 액션은 동작에 예시 된 바와 같이 비디오 게임으로 포워딩된다. 비디오 게임은 동작에 예시된 바와 같이 액션의 수신에 응답하 여 커맨드의 실행을 개시하고 커맨드에서 식별되고 제2 부분에 포함된 게임 콘텐츠를 렌더링하는 데 사용되는 렌더링 속성 중 특정 속성을 조정한다. 렌더링 속성의 조정은 조정을 위해 식별된 렌더링 속성 중 특정 속성이 실제로 제2 부분에 포함되어 있고 제2 부분이 제1 부분 다음에 발생하도록 스케줄링되어 있다고 검증한 후에 이 루어진다. 제2 부분의 조정된 게임 콘텐츠는 렌더링을 위해 HMD로 포워딩된다. 조정된 게임 콘텐츠는 사용자의 피로를 줄여 사용자가 과도한 피로 없이 게임 콘텐츠와 상호작용할 수 있도록 돕는다."}
{"patent_id": "10-2024-0028743", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "요약하자면, 렌더링 속성 또는 기타 액션이 현재 부분에서 검출된 눈의 피쳐 및 렌더링 속성을 기초로 게임 콘 텐츠의 후속 부분에 동적으로 적응되는 다양한 실시예가 논의되었다. 눈의 피로 검출기 엔진은 컴퓨터의 운영 체제의 일부이거나 비디오 게임의 일부이다. 렌더링 속성에 의해 영향을 받는 눈의 피쳐(예를 들어, 깜박 임 레이트, 동공 크기, 눈의 형상(예를 들어, 곁눈질) 등)은 기준의 매트릭스를 정의하는 데 사용되며, 각각의 기준은 하나 이상의 눈의 피쳐에 대한 부울 값을 포함하도록 정의된다. 기준이 모니터링되고 특정 기준이 미리 정의된 양이나 수준을 초과하면, 하나 이상의 렌더링 속성이 조정되어야 한다고 비디오 게임에 시그널링하는 플 래그가 발생한다. 플래그와 함께, 플래그를 발생시킨 기준의 세부사항과 기준에 포함된 눈의 피로 지표 중 선택 된 지표(예를 들어, 눈의 피쳐의 변화)가 미리 정의된 수준을 초과한 정도가 또한 비디오 게임과 공유된다. 예 를 들어, 깜박임 레이트가 특정 수준 이상으로 올라가거나(예를 들어, > 10% 또는 15%) 동공 크기가 특정 양만 큼 증가하거나 감소하는 경우(예를 들어, > 10% 또는 15%), 비디오 게임에 대한 플래그가 발생할 수 있다. 일부 실시예에서, 플래그가 발생하여 특정 눈의 피로 메트릭이 높은 수준(예를 들어, 밝기, 속도, 해상도 등과 같은 렌더링 속성)에 있거나 조정이 필요함(예를 들어, 포비티드 영역)을 비디오 게임에 나타내거나 또는 눈의 피로 를 줄이거나 사용자가 경험하는 눈의 피로를 어드레싱하기 위해 사용자에게 제안(예를 들어, 사용자에게 휴식을 취하도록 지시)을 제공한다. 일부 실시예에서, 제안은 팝업 윈도우로 제공된다. 비디오 게임이 멀티 플레이어 게임인 일부 실시예에서, 사용자에게 제안을 제공하는 것 외에도, 비디오 게임은 또한 사용자와 함께 비디오 게 임을 플레이하는 다른 사용자에게 추가 경고 또는 정보 메시지를 제공할 수도 있다. 예를 들어, 사용자에게 휴 식을 제안하는 경우, 비디오 게임은 사용자가 현재 휴식을 취하고 있다는 정보 메시지를 다른 사용자에게 제공 할 수도 있다. 일부 실시예에서, 제안 또는 경고/정보 메시지에는 카운트다운 타이머가 제공될 수 있고, 카운트 다운 타이머는 비디오 게임의 게임 플레이를 언제 재개할지 결정하는 데 사용된다. 추가 경고 또는 정보 메시지 는 사용자에게 언제 게임플레이를 재개할 준비를 해야 하는지 알려주고 사용자가 휴식 후에 게임플레이를 할 준 비가 되었음을 다른 사용자에게 알리기 위해 사용자 및 다른 사용자에게 제공될 수 있다. 플래그는 비디오 게임으로 포워딩되며, 플래그는 액션을 포함할 수 있거나 비디오 게임에서 수행될 액션을 식별 하도록 해석될 수 있다. 예를 들어, 눈의 피로 검출기 엔진은 비디오 게임 내에서 수행될 액션을 지정할 수 있다. 다른 예에서, 눈의 피로 검출기 엔진은 플래그를 비디오 게임에 포워딩하고 비디오 게임은 비디 오 게임에서 수행되어야 하는 액션을 식별하기 위해 플래그에 포함된 정보를 해석할 수 있다. 눈의 피로 메트릭 을 낮추기 위해 비디오 게임에서 조정을 수행하도록 액션이 지정되거나 식별된다. 예를 들어, 액션은 지정하거 나 해석되어 비디오 게임을 일시 중지하거나 포비티드 렌더링을 위해 선택한 부분을 조정하거나 또는 게임 콘텐 츠 부분 내에서 하나 이상의 렌더링 속성을 조정하거나 또는 플래그를 낮추기 위해 비디오 게임에 다른 활동을수행하도록 지시한다 다양한 실시예는 비디오 게임에 대한 게임 콘텐츠의 렌더링 속성을 조정하는 것으로 제한되지 않는다. 일부 실 시예에서, 게임 콘텐츠의 렌더링 속성을 조정하는 대신 또는 조정에 추가하여, 사용자가 게임 입력을 제공하는 데 사용되는 사용자 인터페이스의 렌더링 속성은 사용자가 생리학적 부담 없이 게임 입력을 제공하는 데 도움이 되도록 조정될 수도 있다. 예를 들어, 게임 콘텐츠와 상호작용하기 위한 툴바(toolbar)는 항상 우측에 렌더링될 수 있지만 사용자는 우측에 렌더링된 툴바를 보거나 상호작용하기 위해 긴장해야 할 수도 있다. 따라서, 사용자 가 생리적 피로(예를 들어, 어깨, 목, 머리 또는 눈의 피로) 없이 게임 입력을 제공할 수 있도록 지원하기 위해, 사용자 인터페이스는 적응형 사용자 인터페이스로 정의될 수 있고, 사용자 인터페이스는 사용자 선호도나 사용 편의성에 기초하여 디스플레이 화면의 다른 섹션으로 시프트될 수 있으므로 불필요한 생리적 부담을 피함 으로써 사용자를 지원할 수 있다. 전술한 바와 같이, 눈의 피로 지표는 시간에 의해 영향을 받는다. 예를 들어, HMD를 사용하여 비디오 게임과 상 호작용한 사용자의 눈 깜박임 레이트의 변화는 사용자가 짧은 시간(예를 들어, 5분)보다 오랜 시간(예를 들어, 5시간) 동안 VR에 몰입하는 경우에 더 클 수 있다. 마찬가지로, 사용자의 기력 약화(fall of strength)는 사용 자가 일반적으로 올바르게 수행하는 특정 기능을 수행할 수 없는 것으로부터 검출될 수 있고, 이러한 기력 약화 는 사용자가 게임 콘텐츠에 장시간 몰입함으로써 발생할 수 있으며, 이는 사용자의 눈의 피로나 기타 생리적 긴 장을 의미할 수 있다. 사용자가 경험하는 눈의 피로 유형에 기초하여, 적절한 커맨드가 생성되어 비디오 게임에 전달되는 액션이나 플래그에 포함되며, 이는 사용자가 경험하는 눈의 피로 및/또는 기타 생리적 긴장을 줄이기 위해 수행할 액션의 유형을 결정한다. 액션은 게임 콘텐츠 또는 HMD의 화면에 렌더링되고 비디오 게임에 게임 입력을 제공하는 데 사용되는 대화형 툴에 대해 지정된 디스플레이 설정에서 수행될 수 있다. 운영 체제나 비디 오 게임에 통합된 액션 설정 로직(236/238)은 시간 기반, 사용자 기반, 콘텐츠 기반 등인 사용자로부터 획득된 다양한 메트릭을 사용하여 사용자가 생리학적 부담을 겪지 않고 HMD에서 렌더링된 콘텐츠와 상호작용할 수 있도 록 수행할 적절한 액션을 식별한다. 도 8a는 HMD의 외부 측의 뷰를 갖는 HMD의 예시적인 구현예를 예시한다. HMD는 투시(see- through) 기능을 갖도록 구성될 수도 있고 그렇지 않을 수도 있다. 예시된 바와 같이, HMD는 한 쌍의 렌즈 (즉, 광학장치의 일부)를 포함하며, 사용자가 HMD를 착용할 때 한 쌍의 각 렌즈는 사용자의 각 눈 앞 쪽으로 배향된다. 대안적인 구현예에서, 렌즈는 사용자의 양쪽 눈이 아닌 한쪽 눈 앞에 제공될 수도 있다. 도 6a에 예시된 HMD는 가상 현실 환경을 렌더링하도록 구성된다. HMD는 또한 증강 현실 환경을 렌더링하 도록 구성될 수 있으며, 여기서 디스플레이 화면은 사용자 부근의 현실 세계를 투시할 수 있는 기능을 갖도록 구성된다. 그러한 구현예에서, 렌즈는 사용자가 현실 세계 개체뿐만 아니라 현실 세계 개체의 일부 위에 오버레이되는 가상 요소도 볼 수 있도록 구성된다. 한 쌍의 렌즈는 사용자의 시각 특성에 따라 가상 요소 의 이미지와 현실 세계 개체의 뷰를 조정하도록 구성될 수 있다. HMD는 프레임을 포함한다. 프레임은 관성 측정 유닛(IMU) 센서, 복수의 조명, 마이크, HMD의 기능에 사용되는 이미지 캡처 디바이스, 메모리 및 컴퓨터에 통신 가능하게 연결된 프로세서와 같은 HMD의 일부 구성 요소를 위한 하우징을 제공한다. HMD는 컴퓨터에 액세스하고 상호작용하는 통신 기능을 포함한 다. 또한, HMD는 유선, 무선 또는 3G/4G/5G 통신 등을 이용하여 네트워크에 통신 가능하게 연결될 수 있다. HMD는 운영 체제를 실행할 수 있고 네트워크 인터페이스를 포함할 수 있다. 일 구현예에서, HMD의 프로세서는 예를 들어 제어기(미도시), 글로브 인터페이스 개체(도 1의 104a), 하나 이상의 외부 카 메라(도 1의 109), 컴퓨터 또는 독립형 콘솔(그림 1의 106), 라우터에 통신 가능하게 연결될 수도 있다. 글로브 인터페이스 개체(도 1의 104a)는 사용자가 볼 콘텐츠를 제공하는 대화형 애플리케이션에 입력을 제공하는 데 사 용된다. 외부 카메라는 HMD를 착용한 사용자의 이미지를 캡처하고 이를 HMD나 컴퓨터로 포워딩하여 프로세싱하 는 데 사용된다. HMD는 센서 데이터를 포함하여 다양한 컴포넌트에 의해 제공되는 데이터 중 일부를 프로세싱하 고 추가 프로세싱을 위해 프로세싱된 데이터를 컴퓨터로 포워딩할 수 있다. 컴퓨터는 HMD에 의 해 제공된 데이터를 프로세싱하고 사용자에게 렌더링하기 위해 업데이트된 콘텐츠를 HMD에 제공하는 데 사용될 수 있다. 대안적으로, 컴퓨터는 추가 프로세싱을 위해 HMD에 의해 제공된 프로세싱된 데이터를 클라우드 컴퓨팅 서버로 포워딩할 수 있다. HMD로부터의 데이터는 라우터를 통해 클라우드 컴퓨팅 서버에서 실행되 는 대화형 애플리케이션으로 포워딩될 수 있고, 대화형 애플리케이션으로부터 콘텐츠를 수신할 수 있으며, 이는 이어서 렌더링을 위해 HMD로 포워딩된다. 대안적으로, HMD는 프로세싱된 데이터를 라우터를 통해 클 라우드 컴퓨팅 서버(즉, 도 1의 클라우드의 일부인 원격 서버)에서 실행되는 대화형 애플리케이션에 직접 포워딩하고 이어서 클라우드 컴퓨팅 서버에 의해 제공되는 대화형 애플리케이션의 콘텐츠를 수신할 수 있다.HMD가 라우터를 통해 클라우드 컴퓨팅 디바이스와 직접 통신하는 경우, HMD는 네트워크로 연결된 컴 퓨팅 디바이스가 될 것이다. HMD에 포함된 조명(200A 내지 200H)은 HMD의 프레임 외부 표면에 배치되어 HMD를 추적하는 데 사용된다. 조명(200A 내지 200H)은 특정 형상으로 구성될 수 있으며, 동일하거나 다른 컬러를 가질 수도 있다. 조명(200A, 200B, 200C, 200D)은 HMD의 전방 측 상의 외부 표면에 배치된다. 조명(200E, 200F)은 HMD의 측 표면에 배열되고, 조명(200G, 200H)은 HMD의 코너에 배열된다. 조명(200A 내지 200H)은 HMD의 전방 표면과 측 표면에 걸쳐 배치된다. 조명(200A 내지 200H)의 이미지는 이미지 캡처 디바이스(예 를 들어, 도 1의 외부 카메라)에 의해 캡처될 수 있고 HMD를 착용한 사용자가 존재하는 물리적 환경 에서 HMD의 위치와 배향을 식별하는 데 사용된다. 조명(200A 내지 200H) 중 일부는 이미지 캡처 디바이스 에 대한 HMD의 특정 배향에 따라 보일 수도 있고 보이지 않을 수도 있다는 점에 유의해야 한다. 또한, 이 미지 캡처 디바이스에 대한 HMD의 배향에 따라 조명의 서로 다른 부분(예를 들어, 조명(200G 및 200H))이 이미지 캡처를 위해 노출될 수 있다. 일부 구현에서, 조명은 근처에 있는 다른 사람들에게 HMD의 현재 상태를 나타내도록 구성될 수 있다. 예를 들어, 조명의 일부 또는 전부는 특정 컬러 배열, 강도 설정을 갖도록 구성되거나, 깜박이도록 구성되거나, 특정 온/오프 구성을 갖도록 구성되거나, HMD의 현재 상태를 나타내는 다른 배열을 갖도록 구성될 수 있다. 예 를 들어, 조명은 대화형 애플리케이션이 비디오 게임일 때 비디오 게임의 활성 게임플레이 동안(즉, 활성 타임 라인 동안 또는 사용자가 비디오의 게임 장면 내에서 탐색하는 동안) 대 비디오 게임의 기타 비활성 게임플레이 양태 동안(예를 들어, 비디오 게임의 게임 설정을 구성하는 동안, 메뉴를 탐색하는 동안 또는 일시 중지된 경우) 상이한 구성을 표시하도록 구성될 수 있다. 조명은 또한 게임플레이의 상대적 강도 수준을 나타내도 록 구성될 수도 있다. 예를 들어, 게임 플레이의 강도가 높아질수록 빛의 강도나 깜박이는 레이트도 높아지도록 구성될 수 있다. 이러한 방식으로, 사용자 외부의 사람은 HMD의 조명을 보고 사용자가 강렬한 게임 플레이 에 적극적으로 참여하고 있으며 그 순간에 방해받고 싶지 않을 수 있다는 것을 이해할 수 있다. 다른 예에서, 다른 대화형 애플리케이션과 상호작용할 때 고유한 구성을 표시하도록 조명이 구성될 수 있다. 따라서 조명 은 사용자가 HMD에서 렌더링되는 콘텐츠와 상호작용하고 있는지 여부, 콘텐츠에 대한 사용자의 참여 수준을 사람에게 표시하고 HMD를 착용한 사용자가 존재하는 물리적 환경에서 HMD의 위치에 대해 시스 템에 표시하는 데 사용된다. HMD는 하나 이상의 마이크를 추가로 포함할 수 있다. 예시된 실시예에서, HMD는 HMD의 전방 표 면에 정의된 마이크(204A, 204B)와, HMD의 측 표면에 정의된 마이크(204C)를 포함한다. 마이크의 어레이를 활용하면, 각 마이크의 사운드가 프로세싱되어 사운드 소스의 위치가 결정될 수 있다. 이 정보는 원치 않는 음 원 제외, 음원과 시각적 식별의 연관, 음원의 소리를 삼각측량하여 HMD의 위치와 배향을 정확히 찾아내는 등 다양한 방법으로 활용될 수 있다. 마이크(204A 내지 204C)는 HMD를 착용한 사용자가 존재하는 물리적 환경에서 발생하는 외부 소리를 캡처하는 데 사용된다. HMD는 또한 외부 이미지 캡처 디바이스(도 1의 109) 외에 하나 이상의 이미지 캡처 디바이스를 포함할 수 도 있다. 예시된 실시예에서, HMD는 HMD 전방 면의 외부 표면에 배치된 이미지 캡처 디바이스(202A, 202B)를 포함하는 것으로 도시되어 있다. 입체적인 한 쌍의 이미지 캡처 디바이스를 활용함으로써, HMD의 관점으로부터 주변 환경의 3차원(3D) 이미지와 비디오가 캡처될 수 있다. 이러한 비디오는 사용자에게 HMD(10 2)를 착용하는 동안 \"비디오 투시\" 기능을 제공하기 위해 사용자에게 제시될 수 있다. 이 구현예에서, HMD(10 2)는 투시 기능으로 구성되지 않다. 엄밀히 말하면 사용자는 HMD를 통해 볼 수는 없지만, 그럼에도 불구하 고 이미지 캡처 디바이스(202A 및 202B)에 의해 캡처된 비디오는 마치 HMD를 통해 보는 것처럼 HMD 외부 환경을 볼 수 있는 것과 동일한 기능을 제공할 수 있다. 이러한 비디오는 가상 요소로 증강되어 증강 현실 경험을 제공할 수 있다. 증강은 비디오의 개체 위에 가상 요소를 오버레이함으로써 수행될 수 있거나 다른 방식 으로 비디오의 개체와 조합되거나 혼합될 수 있다. 예시된 실시예에서는 두 개의 카메라가 HMD의 전방 표 면에 도시되어 있지만, HMD에 설치되고 서로 다른 방향으로 배향된 외부를 향하는 카메라가 임의 개수일 수 있다는 것이 이해될 것이다. 예를 들어, 다른 실시예에서, 환경의 추가적인 파노라마 이미지 캡처를 제공하 기 위해 HMD의 측 상에 카메라가 장착될 수 있다. 또 다른 구현예에서, HMD는 사용자가 사용자 근처에 있는 현실 세계의 물리적 환경을 볼 수 있도록 HMD의 디스플레이 스크린이 투명한 투시 기능을 제공할 수 있다. 이 구현예에서, 가상 요소의 이미지는 현 실 세계 개체의 부분 위에 겹쳐질 수 있다. 이 대체 구현예에, HMD는 증강 현실 애플리케이션용으로 구성된다. 도 8b는 본 개시의 일 구현예에 따른 헤드 마운트 디스플레이의 다양한 컴포넌트를 예시한다. 헤드 마운트 디스플레이는 프로그램 명령어를 실행하기 위한 프로세서를 포함한다. 메모리는 저장 목적으로 제공되며, 휘발성 메모리와 비휘발성 메모리를 모두 포함할 수 있다. 사용자가 콘텐츠를 보기 위해 사용할 수 있는 시각적 인터페이스를 제공하는 디스플레이가 포함된다. 헤드 마운트 디스플레이의 전원으로서 배터리가 제공된다. 모션 감지 모듈은 자력계, 가속도계 및 자이로스코프와 같은 다 양한 종류의 모션 감지 하드웨어 중 임의의 것을 포함할 수 있다. 가속도계는 가속도 및 중력에 의한 반력을 측정하기 위한 디바이스이다. 다양한 방향의 가속도 크기와 방 향을 검출하기 위해 단일 및 다중 축 모델이 이용 가능하다. 가속도계는 기울기, 진동, 충격을 감지하는 데 사 용된다. 일 실시예에서, 세 개의 가속도계는 중력의 방향을 제공하는 데 사용되며, 이는 두 각도(세계 공 간 피치 및 세계 공간 롤)에 대한 절대 기준을 제공한다. 자력계는 헤드 마운트 디스플레이 부근의 자기장의 강도와 방향을 측정한다. 일 실시예에서, 세 개의 자력 계가 헤드 마운트 디스플레이 내에서 사용되어 세계 공간 요 각도에 대한 절대 기준을 보장한다. 일 실시 예에서, 자력계는 ±80 마이크로테슬라(microtesla)인 지구 자기장에 걸쳐 있도록 설계된다. 자력계는 금속의 영향을 받으며 실제 요와 함께 단조로운 요 측정을 제공합니다. 주변 환경의 금속으로 인해 자기장이 뒤틀릴 수 있으며, 이로 인해 요 측정이 뒤틀릴 수 있다. 필요한 경우 자이로스코프나 카메라와 같은 다른 센서의 정보를 사용하여 이 뒤틀림(warp)이 교정될 수 있다. 일 실시예에서, 가속도계는 헤드 마운트 디스플레이의 경사 및 방위각을 획득하기 위해 자력계와 함께 사용된다. 일부 구현예에서, 헤드 마운트 디스플레이의 자력계는 근처의 다른 디바이스의 전자석이 비활성화된 시간 동안 판독되도록 구성된다. 자이로스코프는 각운동량의 원리에 기초하여 배향을 측정하거나 유지하기 위한 디바이스이다. 일 실시예에 서, 세 개의 자이로스코프는 관성 감지에 기초하여 개별의 축(x, y 및 z)을 가로지르는 움직임에 대한 정 보를 제공한다. 자이로스코프는 빠른 회전을 검출하는 데 도움이 된다. 그러나 자이로스코프는 절대 기준이 없 으면 시간이 지나면서 드리프트할 수 있다. 이를 위해서는 자이로스코프를 주기적으로 재설정해야 하며, 이는 물체의 시각적 추적을 기반으로 한 위치/배향 결정, 가속도계, 자력계 등과 같은 다른 사용 가능한 정보를 사용 하여 수행될 수 있다. 카메라(도 1의 108)는 실제 환경의 이미지 및 이미지 스트림을 캡처하기 위해 제공된다. 헤드 마운트 디스 플레이에는 하나 이상의 카메라가 포함될 수 있으며, 이는 후방을 향하고 있는 카메라(사용자가 헤드 마운 트 디스플레이의 디스플레이를 볼 때 사용자로부터 멀어지는 방향을 향함), 및 전방을 향하고 있는 카메라 (사용자가 헤드 마운트 디스플레이의 디스플레이를 볼 때 사용자를 향함)을 포함한다. 또한, 헤드 마운트 디스플레이에는 실제 환경에서 개체의 심도 정보를 감지하기 위한 심도 카메라가 포함될 수 있다. 헤드 마운트 디스플레이는 오디오 출력을 제공하기 위한 스피커를 포함한다. 또한, 주변 환경의 소리, 사용자의 음성 등을 포함하여 실제 환경의 오디오를 캡처하기 위해 마이크가 포함될 수 있다. 헤드 마운트 디스플레이는 사용자에게 촉각 피드백을 제공하기 위한 촉각 피드백 모듈을 포함한다. 일 실 시예에서, 촉각 피드백 모듈은 사용자에게 촉각 피드백을 제공하기 위해 헤드 마운트 디스플레이의 움직임 및/또는 진동을 유발할 수 있다. LED는 헤드 마운트 디스플레이의 상태를 시각적으로 표시하는 지표로서 제공된다. 예를 들어, LED는 배터리 수준, 전원 켜짐 등을 나타낼 수 있다. 헤드 마운트 디스플레이가 메모리 카드로부터 정보를 판독 및 기록할 수 있도록 하기 위해 카드 판독기가 제공된다. 주변 디바이스와의 연결을 가능하게 하거나, 다 른 휴대용 디바이스, 컴퓨터 등과 같은 다른 디바이스와의 연결을 가능하게 하기 위한 인터페이스의 일 예로 USB 인터페이스가 포함될 수 있다. 헤드 마운트 디스플레이의 다양한 실시예에서, 헤드 마운트 디스 플레이의 더 큰 연결성을 가능하게 하기 위해 다양한 종류의 인터페이스 중 임의의 것이 포함될 수 있다. WiFi 모듈이 무선 네트워킹 기술을 통해 인터넷 또는 근거리 통신망에 연결을 가능하게 하기 위해 포함된 다. 또한, 헤드 마운트 디스플레이는 다른 디바이스와의 무선 연결을 가능하게 하는 Bluetooth 모듈 을 포함한다. 다른 디바이스에 대한 연결을 위해 통신 링크가 또한 포함될 수 있다. 일 실시예에서, 통신 링크는 무선 통신을 위해 적외선 송신을 활용한다. 다른 실시예에서, 통신 링크는 다른 디바이스와의 통신을 위해 다양한 무선 또는 유선 송신 프로토콜 중 임의의 것을 활용할 수 있다.입력 버튼/센서가 사용자에게 입력 인터페이스를 제공하기 위해 포함된다. 버튼, 터치패드, 조이스틱, 트 랙볼 등과 같은 다양한 종류의 입력 인터페이스가 포함될 수 있다. 초음파 통신 모듈이 초음파 기술을 통 해 다른 디바이스와의 통신을 용이하게 하기 위해 헤드 마운트 디스플레이에 포함될 수 있다. 사용자로부 터 생리학적 데이터를 검출할 수 있도록 바이오 센서가 포함된다. 일 실시예에서, 바이오 센서는 사 용자의 피부를 통해 사용자의 생체전기 신호를 검출하기 위한 하나 이상의 건식 전극을 포함한다. 비디오 입력 은 HMD에서 렌더링하기 위해 기본 프로세싱 컴퓨터(예를 들어, 메인 게임 콘솔)로부터 비디오 신호를 수신 하도록 구성된다. 일부 구현예에서, 비디오 입력은 HDMI 입력이다. 헤드 마운트 디스플레이의 전술한 컴포넌트는 헤드 마운트 디스플레이에 포함될 수 있는 단지 예시적 인 컴포넌트로서 설명되었다. 본 개시의 다양한 실시예에서, 헤드 마운트 디스플레이는 전술한 다양한 컴 포넌트 중 일부를 포함할 수도 있고 포함하지 않을 수도 있다. 헤드 마운트 디스플레이의 실시예는 본 명 세서에 설명된 본 개시의 양태를 용이하게 하기 위해 현재 설명되지 않았지만 해당 기술 분야에 알려진 다른 컴 포넌트를 추가로 포함할 수 있다. 도 9는 본 개시의 다양한 실시예에 따라 사용자 소비 및 상호작용을 위해 HMD에 콘텐츠를 제공하는 데 사용될 수 있는 예시적인 게임 시스템의 블록도이다. 게임 시스템은 네트워크를 통해 하나 이상의 클라 이언트에 비디오 스트림을 제공하도록 구성되며, 클라이언트 중 하나 이상은 HMD, 안경 또는 기 타 웨어러블 디바이스를 포함할 수 있다. 일 구현예에서, 게임 시스템은 게임의 인스턴스가 클라우드 서버 에서 실행되고 콘텐츠가 클라이언트로 스트리밍되는 클라우드 게임 시스템인 것으로 도시된다. 대안적인 구현예에서, 게임 시스템은 게임의 인스턴스를 실행하고 렌더링을 위해 스트리밍 콘텐츠를 HMD에 제공하는 게임 콘솔을 포함할 수 있다. 게임 시스템은 일반적으로 비디오 서버 시스템 및 선택적인 게임 서버 를 포함한다. 비디오 서버 시스템은 최소한의 서비스 품질로 하나 이상의 클라이언트에 비디오 스트림을 제공하도록 구성된다. 예를 들어, 비디오 서버 시스템은 비디오 게임의 상태 또는 관점을 변경하 는 게임 커맨드를 수신하고, 지연 시간을 최소화하면서 이러한 상태 변화를 반영하는 업데이트된 비디오 스트림 을 클라이언트에 제공할 수 있다. 비디오 서버 시스템은 아직 정의되지 않은 포멧을 포함하여 다양한 대체 비디오 포멧으로 비디오 스트림을 제공하도록 구성될 수 있다. 또한, 비디오 스트림은 다양한 프레임 레이 트로 사용자에게 제시하도록 구성된 비디오 프레임을 포함할 수 있다. 일반적인 프레임 레이트는 초당 30프레임, 초당 60프레임, 초당 120프레임이다. 다만, 더 높거나 더 낮은 프레임 레이트가 본 개시의 대안적인 실시예에 포함되어 있다. 본 명세서에서 개별적으로 910A, 910B 등으로 지칭되는 클라이언트는 헤드 마운트 디스플레이, 단말기, 개 인용 컴퓨터, 게임 콘솔, 태블릿 컴퓨터, 전화기, 셋톱박스, 키오스크, 무선 디바이스, 디지털 패드, 독립형 장 치, 휴대용 게임 플레이 디바이스 및/또는 등을 포함할 수 있다. 일반적으로 클라이언트는 인코딩된 비디 오 스트림을 수신하고, 비디오 스트림을 디코딩하고, 결과 비디오를 사용자, 예를 들어 게임 플레이어에게 제공 하도록 구성된다. 인코딩된 비디오 스트림을 수신하고 및/또는 비디오 스트림을 디코딩하는 프로세스는 일반적 으로 클라이언트의 수신 버퍼에 개별 비디오 프레임을 저장하는 것을 포함한다. 비디오 스트림은 클라이언트 에 통합된 디스플레이 또는 모니터나 텔레비전과 같은 별도의 디바이스를 통해 사용자에게 표시될 수 있다. 클라이언트는 선택적으로 둘 이상의 게임 플레이어를 지원하도록 구성된다. 예를 들어, 게임 콘솔은 2명, 3명, 4명 이상의 동시 플레이어를 지원하도록 구성될 수 있다. 이들 플레이어 각각은 별도의 비디오 스트 림을 수신할 수 있거나, 단일 비디오 스트림은 각각의 플레이어에 대해 특별히 생성된, 예를 들어 각각의 플레 이어의 관점에 기초하여 생성된 프레임의 영역을 포함할 수 있다. 클라이언트는 선택적으로 지리적으로 분 산되어 있다. 게임 시스템에 포함된 클라이언트의 수는 1개 또는 2개에서 수천, 수만 또는 그 이상까지 다 양할 수 있다. 본 명세서에서, \"게임 플레이어\"라는 용어는 게임을 플레이하는 사람을 지칭하는 데 사용되며, \"게임 플레잉 디바이스\"라는 용어는 게임을 플레이하는 데 사용되는 디바이스를 지칭하는 데 사용된다. 일부 실시예에서, 게임 플레잉 디바이스는 사용자에게 게임 경험을 전달하기 위해 협력하는 복수의 컴퓨팅 디바이스 를 의미할 수 있다. 예를 들어, 게임 콘솔과 HMD는 비디오 서버 시스템과 협력하여 HMD를 통해 시청되는 게임을 전달할 수 있다. 일 실시예에서, 게임 콘솔은 비디오 서버 시스템으로부터 비디오 스트림을 수신하 고, 게임 콘솔은 렌더링을 HMD로 비디오 스트림을 포워딩하고 또는 비디오 스트림을 업데이트 한다. 클라이언트는 네트워크(도 1의 110)를 통해 비디오 스트림을 수신하도록 구성된다. 네트워크는 전화 네트워크, 인터넷, 무선 네트워크, 전력선 네트워크, 근거리 네트워크, 광역 네트워크, 사설 네트워크 등 을 포함하는 임의의 유형의 통신 네트워크일 수 있다. 전형적인 실시예에서, 비디오 스트림은 TCP/IP 또는 UDP/IP와 같은 표준 프로토콜을 통해 통신된다. 대안적으로, 비디오 스트림은 독점 표준을 통해 통신된다.클라이언트의 일반적인 예는 프로세서, 비휘발성 메모리, 디스플레이, 디코딩 로직, 네트워크 통신 기능 및 입력 디바이스를 포함하는 개인용 컴퓨터이다. 디코딩 로직은 하드웨어, 펌웨어, 및/또는 컴퓨터 판독 가능 매체에 저장된 소프트웨어를 포함할 수 있다. 비디오 스트림을 디코딩(및 인코딩)하기 위한 시스템은 해당 분야 에 잘 알려져 있으며 사용되는 특정 인코딩 방식에 따라 달라진다. 클라이언트는 수신된 비디오를 수정하도록 구성된 시스템을 더 포함할 수 있지만 반드시 그럴 필요는 없다. 예를 들어, 클라이언트는 추가 렌더링을 수행하고, 하나의 비디오 이미지를 다른 비디오 이미지에 오버레 이하고, 비디오 이미지를 자르고 및/또는 등을 수행하도록 구성될 수 있다. 예를 들어, 클라이언트는 I-프 레임, P-프레임 및 B-프레임과 같은 다양한 유형의 비디오 프레임을 수신하고 이러한 프레임을 이미지로 프로세 싱하여 사용자에게 표시하도록 구성될 수 있다. 일부 실시예에서, 클라이언트의 멤버는 비디오 스트림에 대해 추가 렌더링, 셰이딩, 3D로의 변환 또는 유사한 동작을 수행하도록 구성된다. 클라이언트의 멤버는 선택적으로 둘 이상의 오디오 또는 비디오 스트림을 수신하도록 구성된다. 클라이언트의 입력 디바이스는 예를 들어 한손 게임 제어기, 양손 게임 제어기, 제스처 인식 시스템, 시선 인식 시스템, 음성 인식 시스템, 키 보드, 조이스틱, 포인팅 디바이스, 힘 피드백 디바이스, 동작 및/또는 위치 감지 디바이스, 마우스, 터치 스크 린, 신경 인터페이스, 카메라, 아직 개발되지 않은 입력 디바이스 및/또는 등을 포함한다. 클라이언트에 의해 수신된 비디오 스트림(및 선택적으로 오디오 스트림)은 비디오 서버 시스템에 의 해 생성되고 제공된다. 본 명세서의 다른 곳에서 더 설명되는 바와 같이, 이 비디오 스트림은 비디오 프레임을 포함한다(그리고 오디오 스트림은 오디오 프레임을 포함한다). 비디오 프레임은 사용자에게 표시되는 이미지에 의미 있는 기여를 하도록 구성된다(예를 들어, 이는 적절한 데이터 구조에 픽셀 정보를 포함함). 본 명세서에 사용된 바와 같이, \"비디오 프레임\"이라는 용어는 예를 들어 비디오 프레임에 기여하도록, 사용자에게 보여지는 이미지에 효과를 내기 위해 구성된 정보를 주로 포함하는 프레임을 지칭하는 데 사용된다. \"비디오 프레임\"에 관한 본 명세서의 대부분의 교시는 \"오디오 프레임\"에도 적용될 수 있다. 클라이언트는 일반적으로 사용자로부터 입력을 수신하도록 구성된다. 이러한 입력은 비디오 게임의 상태를 변경하거나 게임 플레이에 영향을 미치도록 구성된 게임 커맨드를 포함할 수 있다. 게임 커맨드는 입력 디바이 스를 사용하여 수신될 수 있고 및/또는 클라이언트에서 실행되는 컴퓨팅 명령어에 의해 자동으로 생성될 수 있다. 수신된 게임 커맨드는 클라이언트로부터 네트워크를 통해 비디오 서버 시스템 및/또는 게임 서버로 통신된다. 예를 들어, 일부 실시예에서, 게임 커맨드는 비디오 서버 시스템을 통해 게임 서버로 통신된다. 일부 실시예에서, 게임 커맨드의 개별 복사본은 클라이언트로부터 게임 서버 및 비디오 서버 시스템으로 통신된다. 게임 커맨드의 통신은 선택적으로 커맨드의 아이덴티티에 따라 달라 진다. 게임 커맨드는 클라이언트(910A)에 오디오 또는 비디오 스트림을 제공하는 데 사용되는 다른 경로 또는 통신 채널을 통해 클라이언트(910A)로부터 선택적으로 통신된다. 게임 서버는 선택적으로 비디오 서버 시스템과 다른 엔티티(entity)에 의해 운영된다. 예를 들어, 게 임 서버는 멀티플레이어 게임의 퍼블리셔에 의해 운영될 수 있다. 이 예에서, 비디오 서버 시스템은 선택적으로 게임 서버에 의해 클라이언트로서 보여지고 선택적으로 게임 서버의 관점으로부터 종래 기술 게임 엔진을 실행하는 종래 기술 클라이언트인 것처럼 보이도록 구성된다. 비디오 서버 시스템과 게 임 서버 사이의 통신은 선택적으로 네트워크를 통해 발생한다. 따라서, 게임 서버는 게임 상태 정보를 다수의 클라이언트에 발송하는 종래 기술의 멀티플레이어 게임 서버일 수 있으며, 그 중 하나는 게임 서 버 시스템이다. 비디오 서버 시스템은 게임 서버의 다수의 인스턴스와 동시에 통신하도록 구성 될 수 있다. 예를 들어, 비디오 서버 시스템은 서로 다른 사용자에게 복수의 서로 다른 비디오 게임을 제 공하도록 구성될 수 있다. 이러한 서로 다른 비디오 게임의 각각은 서로 다른 게임 서버에 의해 지원될 수 있고 및/또는 서로 다른 엔티티에 의해 발행될 수 있다(published). 일부 실시예에서, 지리적으로 분산된 여러 인스턴스의 비디오 서버 시스템은 복수의 서로 다른 사용자에게 게임 비디오를 제공하도록 구성된다. 비디 오 서버 시스템의 이들 인스턴스의 각각은 게임 서버의 동일한 인스턴스와 통신할 수 있다. 비디오 서버 시스템과 하나 이상의 게임 서버 사이의 통신은 선택적으로 전용 통신 채널을 통해 발생한다. 예를 들어, 비디오 서버 시스템은 이들 두 시스템 사이의 통신 전용인 고대역폭 채널을 통해 게임 서버 에 연결될 수 있다. 비디오 서버 시스템은 적어도 비디오 소스, I/O 디바이스, 프로세서 및 비일시적 저장소 를 포함한다. 비디오 서버 시스템은 하나의 컴퓨팅 디바이스를 포함하거나 복수의 컴퓨팅 디바이스 사이에 분산될 수 있다. 이러한 컴퓨팅 디바이스는 선택적으로 근거리 통신망과 같은 통신 시스템을 통해 연결된다. 비디오 소스는 비디오 스트림, 예를 들어 스트리밍 비디오 또는 동영상을 형성하는 일련의 비디오 프레임 을 제공하도록 구성된다. 일부 실시예에서, 비디오 소스는 비디오 게임 엔진 및 렌더링 로직을 포함한다. 비디오 게임 엔진은 플레이어로부터 게임 커맨드를 수신하고 수신된 커맨드를 기초로 비디오 게임 상태의 복사 본을 유지하도록 구성된다. 이 게임 상태는 게임 환경의 개체 위치와 일반적인 관점을 포함한다. 게임 상태에는 개체의 속성, 이미지, 컬러 및/또는 텍스처를 또한 포함할 수 있다. 게임 상태는 일반적으로 게임 규칙뿐만 아 니라 이동, 회전, 공격, 초점 설정, 상호작용, 사용 및/또는 등과 같은 게임 커맨드를 기초로 유지된다. 게임 엔진의 일부는 게임 서버 내에 선택적으로 배치된다. 게임 서버는 지리적으로 분산된 클라이언트를 사용하여 여러 플레이어로부터 수신된 게임 커맨드에 기초하여 게임 상태의 복사본을 유지할 수 있다. 이러한 경우, 게임 상태는 게임 서버에 의해 비디오 소스에 제공되며, 여기서 게임 상태의 복사본이 저장되 고 렌더링이 수행된다. 게임 서버는 네트워크를 통해 클라이언트로부터 직접 게임 커맨드를 수 신할 수 있고 및/또는 비디오 서버 시스템을 통해 게임 커맨드를 수신할 수 있다. 비디오 소스는 일반적으로 하드웨어, 펌웨어 및/또는 저장소와 같은 컴퓨터 판독 가능 매체에 저장된 소프트웨어와 같은 렌더링 로직을 포함한다. 이 렌더링 로직은 게임 상태에 기초하여 비디오 스트림의 비디오 프레임을 생성하도록 구성된다. 렌더링 로직의 전부 또는 일부는 선택적으로 그래픽 프로세싱 유닛(GPU) 내에 배치된다. 렌더링 로직은 게임 상태 및 관점에 기초하여 일반적으로 개체 사이의 3차원 공간 관계를 결정하고 및/또는 적절한 텍스처 등을 적용하기 위해 구성된 프로세싱 단계를 포함한다. 렌더링 로직은 일반적으로 클라 이언트와 통신하기 전에 인코딩되는 원시 비디오를 생성한다. 예를 들어 원시 비디오는 Adobe Flash® 표 준, .wav, H.264, H.263, On2, VP6, VC-1, WMA, Huffyuv, Lagarith, MPG-x. Xvid. FFmpeg, x264, VP6-8, realvideo, mp3 등에 따라 인코딩될 수 있다. 인코딩 프로세스는 원격 디바이스의 디코더로 전달하기 위해 선택 적으로 패키징되는 비디오 스트림을 생성한다. 비디오 스트림은 프레임 크기와 프레임 레이트에 의해 특성화된 다. 일반적인 프레임 크기는 800 x 600, 1280 x 920(예를 들어, 920p), 1024 x 768을 포함하지만, 다른 프레임 크기가 또한 사용될 수 있다. 프레임 레이트는 초당 비디오 프레임 수이다. 비디오 스트림은 다양한 유형의 비 디오 프레임을 포함할 수 있다. 예를 들어, H.264 표준은 \"P\" 프레임과 \"I\" 프레임을 포함한다. I-프레임은 디 스플레이 디바이스의 모든 매크로 블록/픽셀을 리프레시하는 정보를 포함하고, P-프레임은 그 서브세트를 리프 레시하는 정보를 포함한다. P-프레임은 일반적으로 I-프레임보다 데이터 크기가 더 작다. 본 명세서에서 사용되 는 용어 \"프레임 크기\"는 프레임 내의 픽셀 수를 지칭하는 것을 의미한다. \"프레임 데이터 크기\"라는 용어는 프 레임을 저장하는 데 필요한 바이트 수를 나타내는 데 사용된다. 대안적인 실시예에서 비디오 소스는 카메라와 같은 비디오 녹화 디바이스를 포함한다. 이 카메라는 컴퓨터 게임의 비디오 스트림에 포함될 수 있는 지연 또는 실시간 비디오를 생성하는 데 사용될 수 있다. 결과 비디오 스트림은 선택적으로 렌더링된 이미지와 스틸(still) 또는 비디오 카메라를 사용하여 녹화된 이미지를 모두 포 함한다. 비디오 소스는 또한 비디오 스트림에 포함될 이전에 녹화된 비디오를 저장하도록 구성된 저장 디 바이스를 포함할 수 있다. 비디오 소스는 또한 개체, 예를 들어 사람의 움직임 또는 위치를 검출하도록 구 성된 모션 또는 위치 감지 디바이스 및 검출된 모션 및/또는 위치에 기초하여 게임 상태를 결정하거나 비디오를 생성하도록 구성된 로직을 포함할 수 있다. 비디오 소스는 선택적으로 다른 비디오에 배치되도록 구성된 오버레이를 제공하도록 구성된다. 예를 들어, 이러한 오버레이는 커맨드 인터페이스, 로그인 명령어, 게임 플레이어에 대한 메시지, 다른 게임 플레이어의 이 미지, 다른 게임 플레이어의 비디오 피드(예를 들어, 웹캠 비디오)를 포함할 수 있다. 터치 스크린 인터페이스 또는 시선 검출 인터페이스를 포함하는 클라이언트(910A)의 실시예에서, 오버레이는 가상 키보드, 조이스틱, 터 치 패드 등을 포함할 수 있다. 오버레이의 한 예에서는 플레이어의 음성이 오디오 스트림에 오버레이된다. 비디 오 소스는 선택적으로 하나 이상의 오디오 소스를 더 포함한다. 비디오 서버 시스템이 둘 이상의 플레이어로부터의 입력에 기초하여 게임 상태를 유지하도록 구성되는 실 시예에서, 각 플레이어는 뷰의 위치와 방향을 포함하는 서로 다른 관점을 가질 수 있다. 비디오 소스는 선 택적으로 각 플레이어의 관점에 기초하여 각 플레이어에 대한 별도의 비디오 스트림을 제공하도록 구성된다. 또 한, 비디오 소스는 클라이언트 각각에 서로 다른 프레임 크기, 프레임 데이터 크기 및/또는 인코딩을 제공하도록 구성될 수 있다. 비디오 소스는 선택적으로 3D 비디오를 제공하도록 구성된다. I/O 디바이스는 비디오 서버 시스템이 비디오, 커맨드, 정보 요청, 게임 상태, 시선 정보, 디바이스 모션, 디바이스 위치, 사용자 모션, 클라이언트 아이덴티티, 플레이어 아이덴티티, 게임 커맨드, 보안 정보, 오디오 및/또는 등과 같은 정보를 발송 및/또는 수신하도록 구성된다. I/O 디바이스는 일반적으로 네트워크 카드 또는 모뎀과 같은 통신 하드웨어를 포함한다. I/O 디바이스는 게임 서버, 네트워크 및/또 는 클라이언트와 통신하도록 구성된다. 프로세서는 로직, 예를 들어 본 명세서에 논의된 비디오 서버 시스템의 다양한 컴포넌트 내에 포함된 소프트웨어를 실행하도록 구성된다. 예를 들어, 프로세서는 비디오 소스, 게임 서버 및/또는 클 라이언트 퀄리파이어(qualifier)의 기능을 수행하기 위해 소프트웨어 명령어로 프로그래밍될 수 있다. 비 디오 서버 시스템은 선택적으로 프로세서의 두 개 이상의 인스턴스를 포함한다. 프로세서는 또 한 비디오 서버 시스템에 의해 수신된 커맨드를 실행하기 위해 또는 본 명세서에서 논의된 게임 시스템 의 다양한 요소의 동작을 조정하기 위해 소프트웨어 명령어로 프로그래밍될 수도 있다. 프로세서는 하나 이상의 하드웨어 디바이스를 포함할 수 있다. 프로세서는 전자 프로세서이다. 저장소는 비일시적 아날로그 및/또는 디지털 저장 디바이스를 포함한다. 예를 들어, 저장소는 비디오 프레임을 저장하도록 구성된 아날로그 저장 디바이스를 포함할 수 있다. 저장소는 컴퓨터 판독 가능 디지 털 저장소, 예를 들어 하드 드라이브, 광학 드라이브 또는 솔리드 스테이트 저장소를 포함할 수 있다. 저장소 는 비디오 프레임, 인공 프레임, 비디오 프레임과 인공 프레임을 모두 포함하는 비디오 스트림, 오디오 프 레임, 오디오 스트림 및/또는 등을 저장하도록 구성된다(예를 들어 적절한 데이터 구조 또는 파일 시스템을 통 해). 저장소는 선택적으로 복수의 디바이스 사이에 분산된다. 일부 실시예에서, 저장소는 본 명세서 의 다른 곳에서 논의된 비디오 소스의 소프트웨어 컴포넌트를 저장하도록 구성된다. 이러한 컴포넌트는 필 요할 때 프로비저닝될 수 있는 포멧으로 저장될 수 있다. 비디오 서버 시스템은 선택적으로 클라이언트 퀄리파이어를 더 포함한다. 클라이언트 퀄리파이어 는 클라이언트(910A 또는 910B)와 같은 클라이언트의 능력을 원격으로 결정하도록 구성된다. 이러한 기능 은 클라이언트(910A) 자체의 기능은 물론 클라이언트(910A)와 비디오 서버 시스템 사이의 하나 이상의 통 신 채널의 기능을 모두 포함할 수 있다. 예를 들어, 클라이언트 퀄리파이어는 네트워크를 통해 통신 채널을 테스트하도록 구성될 수 있다. 클라이언트 퀄리파이어는 클라이언트(910A)의 기능을 수동으로 또는 자동으로 결정(예를 들어 발견)할 수 있다. 수동 결정은 클라이언트(910A)의 사용자와 통신하고 사용자에게 기능 제공을 요청하는 것을 포함한다. 예 를 들어, 일부 실시예에서 클라이언트 퀄리파이어는 클라이언트(910A)의 브라우저 내에 이미지, 텍스트 및 /또는 등을 표시하도록 구성된다. 일 실시예에서, 클라이언트(910A)는 브라우저를 포함하는 HMD이다. 다른 실시 예에서, 클라이언트(910A)는 HMD 상에 표시될 수 있는 브라우저를 갖는 게임 콘솔이다. 표시된 개체는 사용자가 클라이언트(910A)의 운영 체제, 프로세서, 비디오 디코더 유형, 네트워크 연결 유형, 디스플레이 해상도 등과 같은 정보를 입력하도록 요청한다. 사용자가 입력한 정보는 클라이언트 퀄리파이어로 다시 통신된다. 예를 들어, 클라이언트(910A)에서 에이전트를 실행하고 및/또는 클라이언트(910A)에 테스트 비디오를 발송함으 로써 자동 결정이 발생할 수 있다. 에이전트는 웹 페이지에 내장되거나 추가 기능으로 설치된 자바 스크립트 (java script)와 같은 컴퓨팅 명령어를 포함할 수 있다. 에이전트는 클라이언트 퀄리파이어에 의해 선택적 으로 제공된다. 다양한 실시예에서, 에이전트는 클라이언트(910A)의 프로세싱 능력, 클라이언트(910A)의 디코딩 및 디스플레이 능력, 클라이언트(910A)와 비디오 서버 시스템 사이의 통신 채널의 지연 시간 신뢰성 및 대 역폭, 클라이언트(910A)의 디스플레이 유형, 클라이언트(910A)에 방화벽의 존재, 클라이언트(910A)의 하드웨어, 클라이언트(910A)에서 실행되는 소프트웨어, 클라이언트(910A) 내의 레지스트리 항목 및/또는 등을 알아낼 수 있다. 클라이언트 퀄리파이어는 하드웨어, 펌웨어, 및/또는 컴퓨터 판독 가능 매체에 저장된 소프트웨어를 포함 한다. 클라이언트 퀄리파이어는 선택적으로 비디오 서버 시스템의 하나 이상의 다른 요소와 별개인 컴퓨팅 디바이스에 배치된다. 예를 들어, 일부 실시예에서, 클라이언트 퀄리파이어는 클라이언트와 비디오 서버 시스템의 둘 이상의 인스턴스 사이의 통신 채널 특성을 결정하도록 구성된다. 이러한 실시예 에서 클라이언트 퀄리파이어에 의해 발견된 정보는 비디오 서버 시스템의 어떤 인스턴스가 클라이언트 중 하나로 스트리밍 비디오를 전달하는 데 가장 적합한지를 결정하는 데 사용될 수 있다. 본 명세서에 정의된 다양한 실시예는 본 명세서에 개시된 다양한 피쳐를 사용하여 특정 구현예로 조합되거나 조 립될 수 있다는 것이 이해되어야 한다. 따라서, 제공된 예는 단지 몇 가지 가능한 예일 뿐이며, 더 많은 구현예 를 정의하기 위해 다양한 요소를 조합함으로써 가능한 다양한 구현예에 제한되지 않는다. 일부 예에서, 일부 구 현예는 개시된 또는 동등한 구현예의 사상에서 벗어나지 않고 더 적은 수의 요소를 포함할 수 있다.본 개시의 실시예는 휴대용 디바이스, 마이크로프로세서 시스템, 마이크로프로세서 기반 또는 프로그래밍 가능 한 가전제품, 미니컴퓨터, 메인프레임 컴퓨터 등을 포함하는 다양한 컴퓨터 시스템 구성으로 실행될 수 있다. 본 개시의 실시예는 유선 기반 또는 무선 네트워크를 통해 연결된 원격 프로세싱 디바이스에 의해 작업이 수행 되는 분산 컴퓨팅 환경에서도 실시될 수 있다. 일부 실시예에서, 무선 기술을 사용하여 통신이 용이해질 수 있다. 이러한 기술은 예를 들어 5G 무선 통신 기술 을 포함할 수 있다. 5G는 5세대 셀룰러 네트워크 기술이다. 5G 네트워크는 공급자가 담당하는 서비스 영역이 셀 이라는 작은 지리적 영역으로 구분되는 디지털 셀룰러 네트워크이다. 소리와 이미지를 나타내는 아날로그 신호 는 전화기에서 디지털화되고 아날로그-디지털 변환기에 의해 변환되어 비트 스트림으로 송신된다. 셀의 모든 5G 무선 디바이스는 다른 셀에서 재사용되는 주파수 풀에서 트랜시버에 의해 할당된 주파수 채널을 통해 셀의 로컬 안테나 어레이 및 저전력 자동 트랜시버(송신기 및 수신기)와 전파를 통해 통신한다. 로컬 안테나는 고대역폭 광섬유 또는 무선 백홀 연결을 통해 전화 네트워크 및 인터넷에 연결된다. 다른 셀 네트워크와 마찬가지로, 한 셀에서 다른 셀로 이동하는 모바일 디바이스는 자동으로 새로운 셀로 전송된다. 5G 네트워크는 단지 예시적인 유형의 통신 네트워크일 뿐이며, 본 개시의 실시예는 이전 세대의 무선 또는 유선 통신뿐만 아니라 5G 이후의 차세대 유선 또는 무선 기술을 활용할 수도 있다는 것을 이해해야 한다. 위의 실시예를 염두에 두고, 본 개시는 컴퓨터 시스템에 저장된 데이터를 포함하는 다양한 컴퓨터 구현 동작을 채용할 수 있다는 것이 이해되어야 한다. 이러한 동작은 물리량의 물리적 조작이 필요한 동작이다. 본 개시의 일부를 구성하는 본 명세서에 설명된 동작 중 임의의 것은 유용한 머신 동작이다. 본 개시는 또한 이들 동작을 수행하기 위한 디바이스 또는 장치에 관한 것이다. 장치는 필요한 목적에 맞게 특수하게 구성될 수도 있고, 또 는 장치는 컴퓨터에 저장된 컴퓨터 프로그램에 의해 선택적으로 활성화되거나 구성되는 범용 컴퓨터일 수도 있 다. 특히, 다양한 범용 머신은 본 명세서의 교시에 따라 기록된 컴퓨터 프로그램과 함께 사용될 수 있거나, 필 요한 동작을 수행하기 위해 보다 전문화된 장치를 구성하는 것이 더 편리할 수 있다. 방법 동작은 특정 순서로 설명되었지만, 동작 사이에 다른 관리 작업이 수행될 수 있고 동작이 약간 다른 시간 에 발생하도록 조정될 수 있고 또는 수정된 게임 상태를 생성하기 위한 원격 측정 및 게임 상태 데이터의 프로 세싱이 원하는 방식으로 수행되는 한, 프로세싱과 관련된 다양한 간격으로 프로세싱 동작의 발생을 허용하는 시 스템에 배포될 수 있음을 이해해야 한다. 하나 이상의 실시예는 컴퓨터 판독 가능 매체에 컴퓨터 판독 가능 코드로서 제작될 수도 있다. 컴퓨터 판독 가 능 매체는 데이터를 저장할 수 있는 임의의 데이터 저장 디바이스이며, 데이터는 이후 컴퓨터 시스템에 의해 판 독될 수 있다. 컴퓨터 판독 가능 매체의 예는 하드 드라이브, NAS(network attached storage), 판독 전용 메모 리, 랜덤 액세스 메모리, CD-ROM, CD-R, CD-RW, 자기 테이프 및 기타 광학 및 비광학 데이터 저장 디바이스를 포함한다. 컴퓨터 판독 가능 매체는 네트워크로 결합된 컴퓨터 시스템에 분산되어 컴퓨터 판독 가능 코드가 분 산 방식으로 저장되고 실행되는 컴퓨터 판독 가능 유형 매체를 포함할 수 있다. 전술한 실시예는 이해의 명확성을 위해 어느 정도 상세하게 설명되었지만, 첨부된 청구범위의 범위 내에서 특정 변경 및 수정이 실시될 수 있다는 것이 명백할 것이다. 따라서, 본 실시예는 제한적인 것이 아니라 예시적인 것으로 간주되어야 하며, 실시예는 본 명세서에 제공된 세부사항으로 제한되지 않고 첨부된 청구범위의 범위 및 등가물 내에서 수정될 수 있다. 본 명세서에 정의된 다양한 실시예는 본 명세서에 개시된 다양한 피쳐를 사용하여 특정 구현예로 조합되거나 조 립될 수 있다는 것이 이해되어야 한다. 따라서, 제공된 예는 단지 몇 가지 가능한 예일 뿐이며, 더 많은 구현예 를 정의하기 위해 다양한 요소를 조합함으로써 가능한 다양한 구현예에 제한되지 않는다. 일부 예에서, 일부 구 현예는 개시된 또는 동등한 구현예의 사상에서 벗어나지 않고 더 적은 수의 요소를 포함할 수 있다.도면 도면1 도면2a 도면2b 도면3 도면4a 도면4b 도면4c 도면5a 도면5b 도면6a 도면6b 도면7a 도면7b 도면8a 도면8b 도면9"}
{"patent_id": "10-2024-0028743", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 구현예에 따라, 사용자가 컴퓨터에 의해 제공되는 콘텐츠와 상호작용할 때 사용자가 착용하는 웨어러 블 디바이스를 포함하는 시스템의 단순화된 블록도를 나타낸다. 도 2a는 일 구현예에 따라, 눈의 피로 메트릭을 정의하고 애플리케이션에 포워딩하기 위한 액션을 식별하여 렌더링을 위해 웨어러블 디바이스에 포워딩되는 콘텐츠의 렌더링 속성을 조정하기 위해 사용자의 눈 제스처(eye gesture)를 수집하고 프로세싱하는 데 사용되는 시스템의 일부 컴포넌트를 사용하는 단순화된 데이터 흐름을 예 시한다. 도 2b는 대체 구현예에 따라, 눈의 피로 메트릭을 정의하고 애플리케이션에 포워딩하기 위한 액션을 식별하여 렌더링을 위해 웨어러블 디바이스에 포워딩되는 콘텐츠의 렌더링 속성을 조정하기 위해 사용자의 눈 제스처를 수집하고 프로세싱하는 데 사용되는 시스템의 일부 컴포넌트를 사용하는 단순화된 데이터 흐름을 예시한다. 도 3은 구현예에 따라, 사용자의 눈의 피로를 줄이기 위해 비디오 게임에서 수행할 액션을 식별하기 위해 대화 형 애플리케이션(interactive application)(예를 들어, 비디오 게임)에 의해 생성된 콘텐츠의 눈의 피로 메트릭 을 식별하기 위해 머신 러닝 엔진을 사용하는 눈의 피로 검출기 엔진의 단순화된 블록도를 예시한다. 도 4a 내지 4c는 일부 구현예에 따라, 게임 상호작용 시간에 대한 특정 렌더링 속성에 대한 눈의 피로 메트릭을 플롯팅함으로써 생성된 샘플 그래프를 예시한다. 도 5a 내지 5b는 일 구현예에 따라 게임 상호작용 시간에 대해 특정 렌더링 속성(예를 들어, 렌더링 속도, 밝기 또는 해상도)에 대한 눈의 피로 메트릭(예를 들어, 발적 요인)을 플롯팅하고 사용자의 눈의 피로를 감소시키기 위해 비디오 게임에서 수행될 액션을 식별하기 위해 눈의 피로 메트릭을 사용함으로써 생성된 샘플 그래프를 예 시한다. 도 6a 및 6b는 대안적인 구현예에 따라, 게임 상호작용 시간에 걸쳐 사용자가 경험하는 눈의 피로 수준과 사용 자의 눈의 피로를 감소시키기 위해 취해진 게임 내 액션의 샘플 그래프를 예시한다. 도 7a는 일 구현예에 따라, 콘텐츠를 렌더링하는 동안 사용자에 대한 눈의 피로를 감소시키기 위해 콘텐츠의 렌 더링 속성을 조정하는 방법의 동작 흐름을 예시한다. 도 7b는 대안적인 구현예에 따라, 콘텐츠를 렌더링하는 동안 사용자에 대한 눈의 피로를 감소시키기 위해 콘텐 츠의 렌더링 속성을 조정하는 대안적인 방법의 동작 흐름을 예시한다. 도 8a는 일 구현예에 따라, 사용자가 콘텐츠와 상호작용할 때 사용자의 눈 제스처 데이터를 수집하는 데 사용되 는 웨어러블 디바이스에 배치된 다양한 센서 및 시각적 지표(visual indicator)를 예시한다. 도 8b는 일 구현예에 따라 콘텐츠를 요청, 수신 및 렌더링하고 사용자 및 콘텐츠와 사용자의 상호작용에 대해 캡처된 다양한 데이터를 수집하는 데 사용되는 웨어러블 디바이스 내에 배치된 다양한 컴포넌트를 예시한다. 도 9는 사용자로부터의 요청을 프로세싱하고, 본 개시의 다양한 구현예의 양태를 수행하기 위해 사용자에게 콘 텐츠 및 지원을 제공하는 데 사용될 수 있는 예시적인 시스템의 컴포넌트를 예시한다."}
