{"patent_id": "10-2014-0031563", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2015-0108589", "출원번호": "10-2014-0031563", "발명의 명칭": "입출력 인터페이스 제어 방법 및 이를 수행하는 전자 장치", "출원인": "삼성전자주식회사", "발명자": "박차훈"}}
{"patent_id": "10-2014-0031563", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "데이터 통신 모드 또는 충전 모드로 동작 모드의 변경이 가능한 입출력 인터페이스를 포함하는 전자 장치에 있어서, 상기 입출력 인터페이스는외부 전자 장치가 연결되는 커넥터;상기 커넥터와 연결된 전원 공급 라인을 통해 상기 외부 전자 장치에 전원을 공급하는 전원공급부;상기 외부 전자 장치와의 데이터 전송을 제어하는 호스트 컨트롤러; 및상기 전원 공급 라인에 흐르는 전류를 측정하고, 측정한 전류값과 기준값을 비교한 결과에 기반하여 동작 모드를 변경하고, 동작 모드에 따라 상기 전원공급부 및 상기 호스트 컨트롤러의 동작을 제어하는 모드 제어부를 포함하는 전자 장치."}
{"patent_id": "10-2014-0031563", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 전원공급부는상기 전원 공급 라인에 설정값 이상의 전류가 흐르는 것을 방지하는 리미트 회로를 포함하는 전자 장치."}
{"patent_id": "10-2014-0031563", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 모드 제어부는상기 전원 공급 라인에 흐르는 전류를 측정하는 센서 모듈; 및상기 전류값과 상기 기준값을 비교하고, 비교 결과에 따라 비교신호를 출력하는 비교기를 포함하는 전자 장치."}
{"patent_id": "10-2014-0031563", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 모드 제어부는상기 비교신호를 분석하여 상기 전류값이 상기 기준값보다 작으면 동작 모드를 데이터 통신 모드로 변경하고,상기 전류값이 상기 기준값 이상이면 동작 모드를 충전 모드로 변경하는 전자 장치."}
{"patent_id": "10-2014-0031563", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 모드 제어부는동작 모드가 충전 모드인 경우 상기 전원공급부가 상기 외부 전자 장치에 전원을 공급하도록 제어하고, 동작 모드가 데이터 통신 모드인 경우 상기 전원공급부의 전원 공급을 중단시키는 전자 장치."}
{"patent_id": "10-2014-0031563", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 모드 제어부는상기 전원공급부의 동작을 제어하는 차징 컨트롤 IC; 및공개특허 10-2015-0108589-3-사용자의 입력에 따라 동작 모드를 변경하는 임베디드 컨트롤러를 포함하는 전자 장치."}
{"patent_id": "10-2014-0031563", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 상기 모드 제어부는상기 커넥터에 연결된 상기 외부 전자 장치가 연결 해제되면, 동작 모드를 데이터 통신 모드로 변경하는 전자장치."}
{"patent_id": "10-2014-0031563", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 모드 제어부는충전 모드에서 상기 커넥터에 연결된 상기 외부 전자 장치 의 충전이 완료되면, 동작 모드를 데이터 통신 모드로 변경하는 전자 장치."}
{"patent_id": "10-2014-0031563", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서, 상기 모드 제어부는사용자의 모드 변경 명령을 입력 받는 스위치를 포함하는 전자 장치."}
{"patent_id": "10-2014-0031563", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 모드 제어부는사용자로부터 상기 입출력 인터페이스의 동작 모드를 충전 모드로 변경하는 모드 변경 명령이 입력되면, 상기커넥터에 연결된 상기 외부 전자 장치가 충전 모드를 지원하는지 파악하여, 상기 외부 전자 장치가 충전 모드를지원하지 않는 경우, 동작 모드를 데이터 통신 모드로 변경하는 전자 장치."}
{"patent_id": "10-2014-0031563", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서,상기 전원 공급 라인 사이에 삽입되어, 상기 모드 제어부의 전류 측정 대상이 되는 센싱 레지스터를 더 포함하는 전자 장치."}
{"patent_id": "10-2014-0031563", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1항에 있어서, 상기 모드 제어부는상기 입출력 인터페이스의 동작 모드가 충전 모드인 경우, 상기 호스트 컨트롤러의 동작을 중단시키고, 상기 전원공급부가 전원을 공급하도록 제어하는 전자 장치."}
{"patent_id": "10-2014-0031563", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "데이터 통신 모드 또는 충전 모드로 동작 모드의 변경이 가능한 입출력 인터페이스를 구비한 전자 장치가 상기입출력 인터페이스를 제어하는 방법에 있어서,커넥터에 연결된 외부 전자 장치의 연결 상태를 파악하는 과정; 및공개특허 10-2015-0108589-4-상기 외부 전자 장치의 연결이 해제된 경우, 상기 입출력 인터페이스의 동작 모드를 데이터 통신 모드로 변경하는 과정을 포함하는 입출력 인터페이스 제어 방법."}
{"patent_id": "10-2014-0031563", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서, 상기 외부 전자 장치의 연결 상태를 파악하는 과정은,전원 공급 라인을 통하여 상기 외부 전자 장치로 공급되는 전류를 측정하는 과정; 및측정한 전류값이 기준값 미만인 경우 상기 외부 전자 장치의 연결이 해제된 것으로 파악하는 과정을 포함하는입출력 인터페이스 제어 방법."}
{"patent_id": "10-2014-0031563", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제13항에 있어서,상기 입출력 인터페이스의 동작 모드를 확인하는 과정;상기 입출력 인터페이스의 동작 모드가 충전 모드인 경우, 상기 외부 전자 장치에 전원을 공급하는 전원 공급라인의 전류를 측정하는 과정;측정한 전류값과 기준값을 비교하는 과정; 및상기 전류값이 상기 기준값 이하인 경우, 상기 입출력 인터페이스의 동작 모드를 데이터 통신 모드로 변경하는과정을 더 포함하는 입출력 인터페이스 제어 방법."}
{"patent_id": "10-2014-0031563", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제13항에 있어서,사용자로부터 상기 입출력 인터페이스의 동작 모드를 충전 모드로 변경하는 모드 변경 명령을 입력 받는 과정;상기 커넥터에 연결된 상기 외부 전자 장치가 충전 모드를 지원하는지 판단하는 과정; 및상기 외부 전자 장치 가 충전 모드를 지원하지 않는 경우, 상기 입출력 인터페이스의 동작 모드를 데이터 통신모드로 변경하는 과정을 더 포함하는 입출력 인터페이스 제어 방법."}
{"patent_id": "10-2014-0031563", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제13항에 있어서,상기 충전 모드는 DCP(Dedicated Charging Port)모드이고, 상기 데이터 통신 모드는 SDP(StandardDownstreaming Port) 모드 또는 CDP(Charging Downstreaming Port) 모드 중 하나인 입출력 인터페이스 제어 방법."}
{"patent_id": "10-2014-0031563", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제14항에 있어서,상기 입출력 인터페이스의 모드가 충전 모드인 경우, 상기 커넥터에 연결된 상기 외부 전자 장치의 충전이 완료되면, 상기 입출력 인터페이스의 모드를 데이터 통신 모드로 변경하는 과정을 더 포함하는 입출력 인터페이스제어 방법.공개특허 10-2015-0108589-5-청구항 19 제14항에 있어서,상기 입출력 인터페이스의 모드가 데이터 통신 모드인 경우, 상기 커넥터에 연결된 상기 외부 전자 장치가 방전되면, 상기 입출력 인터페이스의 모드를 충전 모드로 변경하는 과정을 더 포함하는 입출력 인터페이스 제어 방법."}
{"patent_id": "10-2014-0031563", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "데이터 통신 모드 또는 충전 모드로 동작 모드의 변경이 가능한 입출력 인터페이스를 포함하는 전자 장치가 상기 입출력 인터페이스를 제어하는 방법을 수행하도록 하는 명령어들을 포함하는 하나 이상의 프로그램이 기록된컴퓨터로 읽을 수 있는 기록 매체에 있어서,상기 입출력 인터페이스 제어 방법은커넥터에 연결된 외부 전자 장치의 연결이 해제된 것을 파악하는 과정; 및상기 외부 전자 장치 의 연결이 해제된 경우, 상기 입출력 인터페이스의 동작 모드를 데이터 통신 모드로 변경하는 과정을 포함하는 컴퓨터로 읽을 수 있는 기록 매체."}
{"patent_id": "10-2014-0031563", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 일 실시예에 의한 전자 장치는 데이터 통신 모드 또는 충전 모드로 모드 변경이 가능한 입출력 인터페 이스를 포함할 수 있다. 본 개시의 일 실시예에 의한 전자 장치는 입출력 인터페이스와 연결 가능한 인터페이스 를 구비하는 외부 전자 장치가 연결되는 커넥터; 상기 커넥터와 연결된 전원 공급 라인을 통해 상기 외부 전자 장치에 전원을 공급하는 전원공급부; 상기 외부 전자 장치와의 데이터 전송을 제어하는 호스트 컨트롤러; 및 상 기 전원 공급 라인에 흐르는 전류를 측정하고, 상기 전류값과 기준값을 비교한 결과에 기반하여 동작 모드를 변 경하고, 동작 모드에 따라 상기 전원공급부 및 상기 호스트 컨트롤러의 동작을 제어하는 모드 제어부를 포함할 수 있다."}
{"patent_id": "10-2014-0031563", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시의 다양한 실시예는 전자 장치와 입출력 인터페이스를 통해 연결되는 외부 전자 기기의 연결 상태를 감 지하고, 입출력 인터페이스의 동작 모드를 변경할 수 있는 입출력 인터페이스 제어 방법 및 이를 수행하는 전자 장치에 관한 것이다."}
{"patent_id": "10-2014-0031563", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근에는 전자 장치들이 입출력 인터페이스로 범용 직렬 버스(Universal Serial Bus, USB)를 포함하고 있는 경 우가 많다. 전자 장치는 입출력 인터페이스를 통해 외부 전자 장치와 연결되어 전자 장치와 외부 전자 장치간 에 데이터를 전송 또는 교환할 수 있다. 입출력 인터페이스는 데이터 통신 기능 이외에 전자 장치에 연결된 외부 전자 장치의 충전 기능을 수행할 수도 있다. 이 경우, 입출력 인터페이스는 각 기능을 수행하기 위한 동 작 모드가 설정될 수 있다. 예를 들어, 입출력 인터페이스는 수행하는 기능에 따라 외부 전자 장치와의 데이터 통신을 주 목적으로 하는 모드와 외부 전자 장치의 충전만을 위한 충전 전용의 모드를 가질 수 있다. 이 경우, 입출력 인터페이스를 포함하는 전자 장치는 사용자의 수동 입력에 따라 입출력 인터페이스의 동작 모드를 데이 터 통신 모드 또는 충전 모드로 변경할 수 있다. 다만, 설정된 입출력 인터페이스의 동작 모드를 사용자가 정 확히 파악하기 힘들기 때문에, 충전 모드로 설정된 전자 장치에 새로운 외부 전자 장치를 연결하는 경우에는 외 부 전자 장치의 인식 불량이 발생하는 문제점이 있었다. 또한, 외부 전자 장치가 충전 모드를 지원하지 않는 경우, 입출력 인터페이스의 동작 모드를 충전 모드로 변경 또는 설정하는 경우에는, 전자 장치에 연결된 외부 전자 장치의 인식 불량 및 동작 불량이 발생하는 문제점이 있었다."}
{"patent_id": "10-2014-0031563", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "외부 전자 장치의 연결 상태 및 충전 모드에서 공급되는 전류 상태에 따라 입출력 인터페이스의 동작 모드를 변 경할 수 있는 입출력 인터페이스 제어 방법 및 이를 수행하는 전자 장치를 제공하고자 한다."}
{"patent_id": "10-2014-0031563", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 다양한 실시 예들에 따른 전자 장치는, 입출력 인터페이스와 연결 가능한 인터페이스를 구비하는 외 부 전자 장치가 연결되는 커넥터, 상기 커넥터와 연결된 전원 공급 라인을 통해 상기 외부 전자 장치에 전원을 공급하는 전원공급부, 상기 외부 전자 장치와의 데이터 전송을 제어하는 호스트 컨트롤러; 및 상기 전원 공급 라인에 흐르는 전류를 측정하고, 상기 전류값과 기준값을 비교한 결과에 기반하여 동작 모드를 변경하고, 동작 모드에 따라 상기 전원공급부 및 상기 호스트 컨트롤러의 동작을 제어하는 모드 제어부를 포함할 수 있다. 본 개시의 다양한 실시 예들에 따른 입출력 인터페이스 제어 방법은, 커넥터에 연결된 외부 전자 장치의 연결 상태를 파악하는 과정 및 상기 외부 전자 장치의 연결이 해제된 경우, 상기 입출력 인터페이스의 동작 모드를 데이터 통신 모드로 변경하는 과정을 포함할 수 있다. 또한, 본 개시의 다양한 실시 예들에 따른 입출력 인터 페이스 제어 방법은, 상기 입출력 인터페이스의 동작 모드를 확인하는 과정; 상기 입출력 인터페이스의 동작 모 드가 충전 모드인 경우, 상기 외부 전자 장치에 전원을 공급하는 전원 공급 라인의 전류를 측정하는 과정, 상기 측정한 전류와 기준값을 비교하는 과정 및 상기 전류가 기준값 이하인 경우, 상기 입출력 인터페이스의 동작 모 드를 데이터 통신 모드로 변경하는 과정을 더 포함할 수 있다. 본 개시의 다양한 실시 예들에 따른 입출력 인터페이스 제어 방법은, 사용자로부터 상기 입출력 인터페이스의 동작 모드를 충전 모드로 변경하는 모드 변경 명령을 입력 받는 과정, 상기 커넥터에 상기 외부 전자 장치가 충 전 모드를 지원하는지 판단하는 과정 및 상기 외부 전자 장치가 충전 모드를 지원하지 않는 경우, 상기 입출력 인터페이스의 동작 모드를 데이터 통신 모드로 변경하는 과정을 포함할 수 있다."}
{"patent_id": "10-2014-0031563", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 다양한 실시 예들에 따른 입출력 인터페이스 제어 방법 및 장치는, 입출력 인터페이스를 통하여 전자 장치에 연결된 외부 전자 장치가 연결 해제된 경우, 입출력 인터페이스의 동작 모드를 데이터 통신 모드로 변경 하여 외부 전자 장치의 인식 불량 및 동작 불량을 방지할 수 있다. 본 개시의 다양한 실시 예들에 따른 입출력 인터페이스 제어 방법 및 장치는, 연결된 외부 전자 장치가 충전이 완료된 경우, 입출력 인터페이스의 동작 모드를 충전 모드에서 데이터 통신 모드로 변경하여 불필요한 충전 동 작을 방지할 수 있다. 본 개시의 다양한 실시 예들에 따른 입출력 인터페이스 제어 방법 및 장치는, 연결된 외부 전자 장치가 충전 기 능을 지원하지 않는 전자 장치인 경우를 감지하여 입출력 인터페이스의 동작 모드를 충전 모드에서 데이터 통신 모드로 변경하여 연결된 외부 전자 장치의 인식 불량 및 동작 불량을 방지할 수 있다. 본 개시의 다양한 실시 예들에 따른 입출력 인터페이스 제어 방법 및 장치는, 상황에 맞춰 입출력 인터페이스의 동작 모드를 변경함으로써, 연결된 전자 장치의 동작 불량 및 인식 불량을 방지할 수 있다."}
{"patent_id": "10-2014-0031563", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 개시(present disclosure)를 설명한다. 본 개시는 다양한 변경을 가할 수 있 고 여러 가지 실시예를 가질 수 있는 바, 특정 실시예들이 도면에 예시되고 관련된 상세한 설명이 기재되어 있 다. 그러나, 이는 본 개시를 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 개시의 사상 및 기술 범위에 포함되는 모든 변경 및/또는 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하 여, 유사한 구성요소에 대해서는 유사한 참조 부호가 사용되었다. 본 개시 가운데 사용될 수 있는 \"포함한다\" 또는 \"포함할 수 있다\" 등의 표현은 개시된 해당 기능, 동작 또는 구성요소 등의 존재를 가리키며, 추가적인 하나 이상의 기능, 동작 또는 구성요소 등을 제한하지 않는다. 또한, 본 개시에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요 소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 개시에서 \"또는\" 등의 표현은 함께 나열된 단어들의 어떠한, 그리고 모든 조합을 포함한다. 예를 들어, \"A 또는 B\"는, A를 포함할 수도, B를 포함할 수도, 또는 A 와 B 모두를 포함할 수도 있다. 본 개시 가운데 \"제1\", \"제2\", \"첫째\" 또는 \"둘째\" 등의 표현들이 본 개시의 다양한 구성요소들을 수식할 수 있 지만, 해당 구성요소들을 한정하지 않는다. 예를 들어, 상기 표현들은 해당 구성요소들의 순서 및/또는 중요도 등을 한정하지 않는다. 상기 표현들은 한 구성요소를 다른 구성요소와 구분 짓기 위해 사용될 수 있다. 예를 들어, 제1 사용자 기기와 제 2 사용자 기기는 모두 사용자 기기이며, 서로 다른 사용자 기기를 나타낸다. 예를 들어, 본 개시의 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있 다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해될 수 있어야 할 것이다. 본 개시에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 개시를 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의 미를 가지는 것으로 해석되어야 하며, 본 개시에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적 인 의미로 해석되지 않는다. 본 개시에 따른 전자 장치는, 통신 기능이 포함된 장치일 수 있다. 예를 들면, 전자 장치는 스마트 폰 (smartphone), 태블릿 PC(tablet personal computer), 이동 전화기(mobile phone), 화상전화기, 전자북 리더기 (e-book reader), 데스크탑 PC(desktop personal computer), 랩탑 PC(laptop personal computer), 넷북 컴퓨터 (netbook computer), PDA(personal digital assistant), PMP(portable multimedia player), MP3 플레이어, 모 바일 의료기기, 카메라(camera), 또는 웨어러블 장치(wearable device)(예: 전자 안경과 같은 head-mounted- device(HMD), 전자 의복, 전자 팔찌, 전자 목걸이, 전자 앱세서리(appcessory), 전자 문신, 또는 스마트 와치 (smartwatch))중 적어도 하나를 포함할 수 있다. 어떤 실시예들에 따르면, 전자 장치는 통신 기능을 갖춘 스마트 가전 제품(smart home appliance)일 수 있다. 스마트 가전 제품은, 예를 들자면, 전자 장치는 텔레비전, DVD(digital video disk) 플레이어, 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스(set-top box), TV 박스(예를 들면, 삼성 HomeSyncTM, 애플TVTM, 또는 구글 TVTM), 게임 콘솔(game consoles), 전자 사전, 전자 키, 캠코더(camcorder), 또는 전자 액자 중 적어도 하나를 포함할 수 있다. 어떤 실시예들에 따르면, 전자 장치는 각종 의료기기(예: MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 초음파기 등), 네비게이션(navigation) 장치, GPS 수 신기(global positioning system receiver), EDR(event data recorder), FDR(flight data recorder), 자동차 인포테인먼트(infotainment) 장치, 선박용 전자 장비(예: 선박용 항법 장치 및 자이로 콤파스 등), 항공 전자기 기(avionics), 보안 기기, 차량용 헤드 유닛, 산업용 또는 가정용 로봇, 금융 기관의 ATM(automatic teller뭩 machine) 또는 상점의 POS(point of sales) 중 적어도 하나를 포함할 수 있다. 어떤 실시예들에 따르면, 전자 장치는 통신 기능을 포함한 가구(furniture) 또는 건물/구조물의 일부, 전자 보 드(electronic board), 전자 사인 입력장치(electronic signature receiving device), 프로젝터(projector),또는 각종 계측기기(예: 수도, 전기, 가스, 또는 전파 계측 기기 등) 중 적어도 하나를 포함할 수 있다. 본 개 시에 따른 전자 장치는 전술한 다양한 장치들 중 하나 또는 그 이상의 조합일 수 있다. 또한, 본 개세에 따른 전자 장치는 플렉서블 장치일 수 있다. 또한, 본 개시에 따른 전자 장치는 전술한 기기들에 한정되지 않음은 당 업자에게 자명하다. 이하, 첨부된 도면을 참조하여 다양한 실시예에 따른 전자 장치에 대해서 살펴본다. 다양한 실시예에서 이용되 는 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공지능 전자 장치)를 지칭할 수 있다. 도 1은 다양한 실시예에 따른, 전자 장치을 포함하는 네트워크 환경를 도시한다. 도 1을 참조하면, 상기 전자 장치는 버스, 프로세서, 메모리, 입출력 인터페이스, 디스플레이, 통 신 인터페이스 및 어플리케이션 제어 모듈을 포함할 수 있다. 상기 버스는 전술한 구성요소들을 서로 연결하고, 전술한 구성요소들 간의 통신(예: 제어 메시지)을 전달 하는 회로일 수 있다. 상기 프로세서는, 예를 들면, 상기 버스를 통해 전술한 다른 구성요소들(예: 상기 메모리, 상기 입출력 인터페이스, 상기 디스플레이, 상기 통신 인터페이스, 또는 상기 어플리케이션 제어 모 듈 등)로부터 명령을 수신하여, 수신된 명령을 해독하고, 해독된 명령에 따른 연산이나 데이터 처리를 실 행할 수 있다. 상기 메모리는, 상기 프로세서 또는 다른 구성요소들(예: 상기 입출력 인터페이스, 상기 디스플 레이, 상기 통신 인터페이스, 또는 상기 어플리케이션 제어 모듈 등)로부터 수신되거나 상기 프 로세서 또는 다른 구성요소들에 의해 생성된 명령 또는 데이터를 저장할 수 있다. 상기 메모리는, 예를 들면, 커널, 미들웨어, 어플리케이션 프로그래밍 인터페이스(API: application programming interface) 또는 어플리케이션 등의 프로그래밍 모듈들을 포함할 수 있다. 전술한 각각의 프로그래 밍 모듈들은 소프트웨어, 펌웨어, 하드웨어 또는 이들 중 적어도 둘 이상의 조합으로 구성될 수 있다. 상기 커널은 나머지 다른 프로그래밍 모듈들, 예를 들면, 상기 미들웨어, 상기 API 또는 상기 어플리케이션에 구현된 동작 또는 기능을 실행하는 데 사용되는 시스템 리소스들(예: 상기 버스, 상 기 프로세서 또는 상기 메모리 등)을 제어 또는 관리할 수 있다. 또한, 상기 커널은 상기 미들 웨어, 상기 API 또는 상기 어플리케이션에서 상기 전자 장치의 개별 구성요소에 접근하여 제어 또는 관리할 수 있는 인터페이스를 제공할 수 있다. 상기 미들웨어는 상기 API 또는 상기 어플리케이션이 상기 커널과 통신하여 데이터를 주고 받을 수 있도록 중개 역할을 수행할 수 있다. 또한, 상기 미들웨어는 상기 어플리케이션로부터 수신 된 작업 요청들과 관련하여, 예를 들면, 상기 어플리케이션 중 적어도 하나의 어플리케이션에 상기 전자 장치의 시스템 리소스(예: 상기 버스, 상기 프로세서 또는 상기 메모리 등)를 사용할 수 있는 우선 순위를 배정하는 등의 방법을 이용하여 작업 요청에 대한 제어(예: 스케쥴링 또는 로드 밸런싱)을 수 행할 수 있다. 상기 API는 상기 어플리케이션이 상기 커널 또는 상기 미들웨어에서 제공되는 기능을 제어 하기 위한 인터페이스로, 예를 들면, 파일 제어, 창 제어, 화상 처리 또는 문자 제어 등을 위한 적어도 하나의 인터페이스 또는 함수(예: 명령어)를 포함할 수 있다. 다양한 실시예에 따르면, 상기 어플리케이션는 SMS/MMS 어플리케이션, 이메일 어플리케이션, 달력 어플리 케이션, 알람 어플리케이션, 건강 관리(health care) 어플리케이션(예: 운동량 또는 혈당 등을 측정하는 어플리 케이션) 또는 환경 정보 어플리케이션(예: 기압, 습도 또는 온도 정보 등을 제공하는 어플리케이션) 등을 포함 할 수 있다. 추가적으로 또는 대체적으로, 상기 어플리케이션은 상기 전자 장치와 외부 전자 장치 (예: 전자 장치) 사이의 정보 교환과 관련된 어플리케이션일 수 있다. 상기 정보 교환과 관련된 어플리케 이션은, 예를 들어, 상기 외부 전자 장치에 특정 정보를 전달하기 위한 알림 전달(notification relay) 어플리 케이션, 또는 상기 외부 전자 장치를 관리하기 위한 장치 관리(device management) 어플리케이션을 포함할 수 있다. 예를 들면, 상기 알림 전달 어플리케이션은 상기 전자 장치 의 다른 어플리케이션(예: SMS/MMS 어플리케이 션, 이메일 어플리케이션, 건강 관리 어플리케이션 또는 환경 정보 어플리케이션 등)에서 발생한 알림 정보를 외부 전자 장치(예: 전자 장치)로 전달하는 기능을 포함할 수 있다. 추가적으로 또는 대체적으로, 상기 알림 전달 어플리케이션은, 예를 들면, 외부 전자 장치(예: 전자 장치)로부터 알림 정보를 수신하여 사용자 에게 제공할 수 있다. 상기 장치 관리 어플리케이션은, 예를 들면, 상기 전자 장치와 통신하는 외부 전자 장치(예: 전자 장치)의 적어도 일부에 대한 기능(예: 외부 전자 장치 자체(또는, 일부 구성 부품)의 턴온/ 턴오프 또는 디스플레이의 밝기(또는, 해상도) 조절), 상기 외부 전자 장치에서 동작하는 어플리케이션 또는 상 기 외부 전자 장치에서 제공되는 서비스(예: 통화 서비스 또는 메시지 서비스)를 관리(예: 설치, 삭제 또는 업 데이트)할 수 있다. 다양한 실시예에 따르면, 상기 어플리케이션은 상기 외부 전자 장치(예: 전자 장치)의 속성(예: 전자 장치의 종류)에 따라 지정된 어플리케이션을 포함할 수 있다. 예를 들어, 외부 전자 장치가 MP3 플레이어인 경 우, 상기 어플리케이션은 음악 재생과 관련된 어플리케이션을 포함할 수 있다. 유사하게, 외부 전자 장치 가 모바일 의료기기인 경우, 상기 어플리케이션은 건강 관리와 관련된 어플리케이션을 포함할 수 있다. 한 실시예에 따르면, 상기 어플리케이션은 전자 장치에 지정된 어플리케이션 또는 외부 전자 장치(예: 서버 또는 전자 장치)로부터 수신된 어플리케이션 중 적어도 하나를 포함할 수 있다. 상기 입출력 인터페이스은, 입출력 장치(예: 센서, 키보드 또는 터치 스크린)를 통하여 사용자로부터 입력 된 명령 또는 데이터를, 예를 들면, 상기 버스를 통해 상기 프로세서, 상기 메모리, 상기 통신 인터페이스, 또는 상기 어플리케이션 제어 모듈에 전달할 수 있다. 예를 들면, 상기 입출력 인터페 이스은 터치 스크린을 통하여 입력된 사용자의 터치에 대한 데이터를 상기 프로세서로 제공할 수 있 다. 또한, 상기 입출력 인터페이스은, 예를 들면, 상기 버스을 통해 상기 프로세서, 상기 메모 리, 상기 통신 인터페이스, 또는 상기 어플리케이션 제어 모듈로부터 수신된 명령 또는 데이터 를 상기 입출력 장치(예: 스피커 또는 디스플레이)를 통하여 출력할 수 있다. 예를 들면, 상기 입출력 인터페이 스은 상기 프로세서를 통하여 처리된 음성 데이터를 스피커를 통하여 사용자에게 출력할 수 있다. 상기 디스플레이은 사용자에게 각종 정보(예: 멀티미디어 데이터 또는 텍스트 데이터 등)을 표시할 수 있 다. 상기 통신 인터페이스은 상기 전자 장치와 외부 장치(예: 전자 장치 또는 서버) 간의 통신 을 연결할 수 있다. 예를 들면, 상기 통신 인터페이스은 무선 통신 또는 유선 통신을 통해서 네트워크 에 연결되어 상기 외부 장치와 통신할 수 있다. 상기 무선 통신은, 예를 들어, Wifi(wireless fidelity), BT(Bluetooth), NFC(near field communication), GPS(global positioning system) 또는 cellular 통신(예: LTE, LTE-A, CDMA, WCDMA, UMTS, WiBro 또는 GSM 등) 중 적어도 하나를 포함할 수 있다. 상기 유선 통신은, 예 를 들어, USB(universal serial bus), HDMI(high definition multimedia interface), RS-232(recommended standard 232) 또는 POTS(plain old telephone service) 중 적어도 하나를 포함할 수 있다. 한 실시예에 따르면, 상기 네트워크는 통신 네트워크(telecommunications network)일 수 있다. 상기 통신 네트워크 는 컴퓨터 네트워크(computer network), 인터넷(internet), 사물 인터넷(internet of things) 또는 전화망(telephone network) 중 적어도 하나를 포함할 수 있다. 한 실시예에 따르면, 상기 전자 장치와 외 부 장치 간의 통신을 위한 프로토콜(예: transport layer protocol, data link layer protocol 또는 physical layer protocol))은 어플리케이션, 어플리케이션 프로그래밍 인터페이스, 상기 미들웨어, 커널 또는 통신 인터페이스 중 적어도 하나에서 지원될 수 있다. 어플리케이션 제어 모듈은, 다른 구성요소들(예: 상기 프로세서, 상기 메모리, 상기 입출력 인 터페이스, 또는 상기 통신 인터페이스 등)로부터 획득된 정보 중 적어도 일부를 처리하고, 이를 다양 한 방법으로 사용자에게 제공할 수 있다. 예를 들면, 상기 어플리케이션 제어 모듈은, 상기 전자 장치 에 구비된 접속 부품의 정보를 인식하고, 접속 부품의 정보를 상기 메모리에 저장하고, 접속 부품의 정보에 기반하여, 어플리케이션를 실행시킬 수 있다. 후술하는 도 2 내지 9를 통하여, 상기 어플리케이션 제어 모듈에 대한 추가적인 정보가 제공된다. 도 2는 본 개시의 다양한 실시예들에 따른 전자 장치의 블록도를 도시한다. 상기 전자 장치는, 예를 들면, 도 1에 도시된 전자 장치의 전체 또는 일부를 구성할 수 있다. 도 2를 참조하면, 상기 전자 장치 는 하나 이상의 어플리케이션 프로세서(AP: application processor), 통신 모듈, SIM(subscriber identification module) 카드, 메모리, 센서 모듈, 입력 장치, 디스플레 이, 인터페이스, 오디오 모듈, 카메라 모듈, 전력관리 모듈, 배터리, 인디케이터 및 모터 를 포함할 수 있다. 상기 AP는 운영체제 또는 응용 프로그램을 구동하여 상기 AP에 연결된 다수의 하드웨어 또는 소프트 웨어 구성요소들을 제어할 수 있고, 멀티미디어 데이터를 포함한 각종 데이터 처리 및 연산을 수행할 수 있다. 상기 AP는, 예를 들면, SoC(system on chip) 로 구현될 수 있다. 한 실시예에 따르면, 상기 AP는 GPU(graphic processing unit, 미도시)를 더 포함할 수 있다. 상기 통신 모듈(예: 상기 통신 인터페이스)은 상기 전자 장치 201(예: 상기 전자 장치)와 네트 워크를 통해 연결된 다른 전자 장치들(예: 전자 장치 또는 서버) 간의 통신에서 데이터 송수신을 수 행할 수 있다. 한 실시예에 따르면, 상기 통신 모듈은 셀룰러 모듈, Wifi 모듈, BT 모듈, GPS 모듈, NFC 모듈 및 RF(radio frequency) 모듈를 포함할 수 있다. 상기 셀룰러 모듈은 통신망(예: LTE, LTE-A, CDMA, WCDMA, UMTS, WiBro 또는 GSM 등)을 통해서 음성 통화, 영상 통화, 문자 서비스 또는 인터넷 서비스 등을 제공할 수 있다. 또한, 상기 셀룰러 모듈은, 예를 들면, 가입자 식별 모듈(예: SIM 카드)을 이용하여 통신 네트워크 내에서 전자 장치의 구별 및 인증을 수 행할 수 있다. 한 실시예에 따르면, 상기 셀룰러 모듈은 상기 AP가 제공할 수 있는 기능 중 적어도 일부 기능을 수행할 수 있다. 예를 들면, 상기 셀룰러 모듈은 멀티 미디어 제어 기능의 적어도 일부를 수 행할 수 있다. 한 실시예에 따르면, 상기 셀룰러 모듈은 커뮤니케이션 프로세서(CP: communication processor)를 포함할 수 있다. 또한, 상기 셀룰러 모듈은, 예를 들면, SoC로 구현될 수 있다. 도 2에서는 상기 셀룰러 모듈 (예: 커뮤니케이션 프로세서), 상기 메모리 또는 상기 전력관리 모듈 등의 구성요소들이 상기 AP와 별개의 구성요소로 도시되어 있으나, 한 실시예에 따르면, 상기 AP가 전술한 구성요소들의 적어 도 일부(예: 셀룰러 모듈)를 포함하도록 구현될 수 있다. 한 실시예에 따르면, 상기 AP 또는 상기 셀룰러 모듈(예: 커뮤니케이션 프로세서)은 각각에 연결된 비휘발성 메모리 또는 다른 구성요소 중 적어도 하나로부터 수신한 명령 또는 데이터를 휘발성 메모리에 로드 (load)하여 처리할 수 있다. 또한, 상기 AP 또는 상기 셀룰러 모듈은 다른 구성요소 중 적어도 하나 로부터 수신하거나 다른 구성요소 중 적어도 하나에 의해 생성된 데이터를 비휘발성 메모리에 저장(store)할 수 있다. 상기 Wifi 모듈, 상기 BT 모듈, 상기 GPS 모듈 또는 상기 NFC 모듈 각각은, 예를 들면, 해당하는 모듈을 통해서 송수신되는 데이터를 처리하기 위한 프로세서를 포함할 수 있다. 도 2에서는 셀룰러 모 듈, Wifi 모듈, BT 모듈, GPS 모듈 또는 NFC 모듈이 각각 별개의 블록으로 도시되었 으나, 한 실시예에 따르면, 셀룰러 모듈, Wifi 모듈, BT 모듈, GPS 모듈 또는 NFC 모듈 중 적어도 일부(예: 두 개 이상)는 하나의 integrated chip(IC) 또는 IC 패키지 내에 포함될 수 있다. 예를 들면, 셀룰러 모듈, Wifi 모듈, BT 모듈, GPS 모듈 또는 NFC 모듈 각각에 대응 하는 프로세서들 중 적어도 일부(예: 셀룰러 모듈에 대응하는 커뮤니케이션 프로세서 및 Wifi 모듈에 대응하는 Wifi 프로세서)는 하나의 SoC로 구현될 수 있다. 상기 RF 모듈는 데이터의 송수신, 예를 들면, RF 신호의 송수신을 할 수 있다. 상기 RF 모듈는, 도 시되지는 않았으나, 예를 들면, 트랜시버(transceiver), PAM(power amp module), 주파수 필터(frequency filter) 또는 LNA(low noise amplifier) 등을 포함할 수 있다. 또한, 상기 RF 모듈는 무선 통신에서 자 유 공간상의 전자파를 송수신하기 위한 부품, 예를 들면, 도체 또는 도선 등을 더 포함할 수 있다. 도 2에서는 셀룰러 모듈, Wifi 모듈, BT 모듈, GPS 모듈 및 NFC 모듈이 하나의 RF 모듈을 서로 공유하는 것으로 도시되어 있으나, 한 실시예에 따르면, 셀룰러 모듈, Wifi 모듈, BT 모듈 , GPS 모듈 또는 NFC 모듈 중 적어도 하나는 별개의 RF 모듈을 통하여 RF 신호의 송수신을 수행 할 수 있다. 상기 SIM 카드(225_1~N)는 가입자 식별 모듈을 포함하는 카드일 수 있으며, 전자 장치의 특정 위치에 형성된 슬 롯(224_1~N)에 삽입될 수 있다. 상기 SIM 카드(225_1~N)는 고유한 식별 정보(예: ICCID(integrated circuit card identifier)) 또는 가입자 정보(예: IMSI(international mobile subscriber identity))를 포함할 수 있다. 상기 메모리(예: 상기 메모리)는 내장 메모리 또는 외장 메모리를 포함할 수 있다. 상기 내장 메모리는, 예를 들면, 휘발성 메모리(예를 들면, DRAM(dynamic RAM), SRAM(static RAM),SDRAM(synchronous dynamic RAM) 등) 또는 비휘발성 메모리(non-volatile Memory, 예를 들면, OTPROM(one time programmable ROM), PROM(programmable ROM), EPROM(erasable and programmable ROM), EEPROM(electrically erasable and programmable ROM), mask ROM, flash ROM, NAND flash memory, NOR flash memory 등) 중 적어도 하나를 포함할 수 있다. 한 실시예에 따르면, 상기 내장 메모리는 Solid State Drive(SSD)일 수 있다. 상기 외장 메모리는 flash drive, 예를 들면, CF(compact flash), SD(secure digital), Micro-SD(micro secure digital), Mini- SD(mini secure digital), xD(extreme digital) 또는 Memory Stick 등을 더 포함할 수 있다. 상기 외장 메모리 는 다양한 인터페이스를 통하여 상기 전자 장치과 기능적으로 연결될 수 있다. 한 실시예에 따르면, 상기 전자 장치는 하드 드라이브와 같은 저장 장치(또는 저장 매체)를 더 포함할 수 있다. 상기 센서 모듈은 물리량을 계측하거나 전자 장치의 작동 상태를 감지하여, 계측 또는 감지된 정보를 전기 신호로 변환할 수 있다. 상기 센서 모듈은, 예를 들면, 제스처 센서(240A), 자이로 센서(240B), 기 압 센서(240C), 마그네틱 센서(240D), 가속도 센서(240E), 그립 센서(240F), 근접 센서(240G), color 센서 (240H)(예: RGB(red, green, blue) 센서), 생체 센서(240I), 온/습도 센서(240J), 조도 센서(240K) 또는 UV(ultra violet) 센서(240M) 중의 적어도 하나를 포함할 수 있다. 추가적으로 또는 대체적으로, 상기 센서 모 듈은, 예를 들면, 후각 센서(E-nose sensor, 미도시), EMG 센서(electromyography sensor, 미도시), EEG 센서(electroencephalogram sensor, 미도시), ECG 센서(electrocardiogram sensor, 미도시), IR(infra red) 센 서(미도시), 홍채 센서(미도시) 또는 지문 센서(미도시) 등을 포함할 수 있다. 상기 센서 모듈은 그 안에 속한 적어도 하나 이상의 센서들을 제어하기 위한 제어 회로를 더 포함할 수 있다. 상기 입력 장치은 터치 패널(touch panel),(디지털) 펜 센서(pen sensor), 키(key) 또는 초음파(ultrasonic) 입력 장치를 포함할 수 있다. 상기 터치 패널은, 예를 들면, 정전식, 감압식, 적외선 방식 또는 초음파 방식 중 적어도 하나의 방식으로 터치 입력을 인식할 수 있다. 또한, 상기 터치 패널 은 제어 회로를 더 포함할 수도 있다. 정전식의 경우, 물리적 접촉 또는 근접 인식이 가능하다. 상기 터 치 패널은 택타일 레이어(tactile layer)를 더 포함할 수도 있다. 이 경우, 상기 터치 패널은 사용 자에게 촉각 반응을 제공할 수 있다. 상기(디지털) 펜 센서는, 예를 들면, 사용자의 터치 입력을 받는 것과 동일 또는 유사한 방법 또는 별도의 인식용 쉬트(sheet)를 이용하여 구현될 수 있다. 상기 키는, 예를 들면, 물리적인 버튼, 광학식 키 또는 키패드를 포함할 수 있다. 상기 초음파(ultrasonic) 입력 장치는 초음파 신호를 발생하는 입력 도구를 통 해, 전자 장치에서 마이크(예: 마이크)로 음파를 감지하여 데이터를 확인할 수 있는 장치로서, 무선 인식이 가능하다. 한 실시예에 따르면, 상기 전자 장치는 상기 통신 모듈를 이용하여 이와 연결된 외부 장치(예: 컴퓨터 또는 서버)로부터 사용자 입력을 수신할 수도 있다. 상기 디스플레이(예: 상기 디스플레이)은 패널, 홀로그램 장치 또는 프로젝터을 포함 할 수 있다. 상기 패널은, 예를 들면, LCD(liquid-crystal display) 또는 AM-OLED(active-matrix organic light-emitting diode) 등일 수 있다. 상기 패널은, 예를 들면, 유연하게(flexible), 투명하게 (transparent) 또는 착용할 수 있게(wearable) 구현될 수 있다. 상기 패널은 상기 터치 패널과 하 나의 모듈로 구성될 수도 있다. 상기 홀로그램 장치은 빛의 간섭을 이용하여 입체 영상을 허공에 보여줄 수 있다. 상기 프로젝터는 스크린에 빛을 투사하여 영상을 표시할 수 있다. 상기 스크린은, 예를 들면, 상기 전자 장치의 내부 또는 외부에 위치할 수 있다. 한 실시예에 따르면, 상기 디스플레이은 상기 패널, 상기 홀로그램 장치, 또는 프로젝터를 제어하기 위한 제어 회로를 더 포함할 수 있다. 상기 인터페이스는, 예를 들면, HDMI(high-definition multimedia interface), USB(universal serial bus), 광 인터페이스(optical interface) 또는 D-sub(D-subminiature)를 포함할 수 있 다. 상기 인터페이스는, 예를 들면, 도 1에 도시된 통신 인터페이스에 포함될 수 있다. 추가적으로 또는 대체적으로, 상기 인터페이스는, 예를 들면, MHL(mobile high-definition link) 인터페이스, SD(secure Digital) 카드/MMC(multi-media card) 인터페이스 또는 IrDA(infrared data association) 규격 인터 페이스를 포함할 수 있다. 특히, 본 개시의 다양한 실시예에 의한 입출력 모드 제어 방법 및 전자 장치는 상기 입출력 인터페이스(예를 들어, USB 인터페이스)가 다양한 모드를 지원하는 경우 상기 입출력 인터페 이스의 모드를 제어하는 방법을 제공할 수 있다. 상기 오디오 모듈은 소리(sound)와 전기신호를 쌍방향으로 변환시킬 수 있다. 상기 오디오 모듈의 적어도 일부 구성요소는, 예를 들면, 도 1 에 도시된 입출력 인터페이스에 포함될 수 있다. 상기 오디오모듈은, 예를 들면, 스피커, 리시버, 이어폰 또는 마이크 등을 통해 입력 또는 출력 되는 소리 정보를 처리할 수 있다. 상기 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있는 장치로서, 한 실시예에 따르면, 하나 이상의 이미지 센서(예: 전면 센서 또는 후면 센서), 렌즈(미도시), ISP(image signal processor, 미도시) 또는 플래 쉬(flash, 미도시)(예: LED 또는 xenon lamp)를 포함할 수 있다. 상기 전력 관리 모듈은 상기 전자 장치의 전력을 관리할 수 있다. 도시하지는 않았으나, 상기 전력 관리 모듈은, 예를 들면, PMIC(power management integrated circuit), 충전 IC(charger integrated circuit) 또는 배터리 또는 연료 게이지(battery or fuel gauge)를 포함할 수 있다. 상기 PMIC는, 예를 들면, 집적회로 또는 SoC 반도체 내에 탑재될 수 있다. 충전 방식은 유선과 무선으로 구분 될 수 있다. 상기 충전 IC는 배터리를 충전시킬 수 있으며, 충전기로부터의 과전압 또는 과전류 유입을 방지할 수 있다. 한 실시예에 따르면, 상기 충전 IC는 유선 충전 방식 또는 무선 충전 방식 중 적어도 하나를 위한 충 전 IC를 포함할 수 있다. 무선 충전 방식으로는, 예를 들면, 자기공명 방식, 자기유도 방식 또는 전자기파 방 식 등이 있으며, 무선 충전을 위한 부가적인 회로, 예를 들면, 코일 루프, 공진 회로 또는 정류기 등의 회로가 추가될 수 있다. 상기 배터리 게이지는, 예를 들면, 상기 배터리의 잔량, 충전 중 전압, 전류 또는 온도를 측정할 수 있다. 상기 배터리는 전기를 저장 또는 생성할 수 있고, 그 저장 또는 생성된 전기를 이용하여 상기 전자 장치 에 전원을 공급할 수 있다. 상기 배터리는, 예를 들면, 충전식 전지(rechargeable battery) 또는 태양 전지(solar battery)를 포함할 수 있다. 상기 인디케이터는 상기 전자 장치 혹은 그 일부(예: 상기 AP)의 특정 상태, 예를 들면, 부팅 상태, 메시지 상태 또는 충전 상태 등을 표시할 수 있다. 상기 모터는 전기적 신호를 기계적 진동으로 변 환할 수 있다. 도시되지는 않았으나, 상기 전자 장치는 모바일 TV 지원을 위한 처리 장치(예: GPU)를 포함 할 수 있다. 상기 모바일 TV지원을 위한 처리 장치는, 예를 들면, DMB(digital multimedia broadcasting), DVB(digital video broadcasting) 또는 미디어 플로우(media flow) 등의 규격에 따른 미디어 데이터를 처리할 수 있다. 본 개시에 따른 전자 장치의 전술한 구성요소들 각각은 하나 또는 그 이상의 부품(component)으로 구성될 수 있 으며, 해당 구성 요소의 명칭은 전자 장치의 종류에 따라서 달라질 수 있다. 본 개시에 따른 전자 장치는 전술 한 구성요소 중 적어도 하나를 포함하여 구성될 수 있으며, 일부 구성요소가 생략되거나 또는 추가적인 다른 구 성요소를 더 포함할 수 있다. 또한, 본 개시에 따른 전자 장치의 구성 요소들 중 일부가 결합되어 하나의 개체 (entity)로 구성됨으로써, 결합되기 이전의 해당 구성 요소들의 기능을 동일하게 수행할 수 있다. 본 개시에 사용된 용어 \"모듈\"은, 예를 들어, 하드웨어, 소프트웨어 또는 펌웨어(firmware) 중 하나 또는 둘 이 상의 조합을 포함하는 단위(unit)를 의미할 수 있다. \"모듈\"은 예를 들어, 유닛(unit), 로직(logic), 논리 블 록(logical block), 부품(component) 또는 회로(circuit) 등의 용어와 바꾸어 사용(interchangeably use)될 수 있다. \"모듈\"은, 일체로 구성된 부품의 최소 단위 또는 그 일부가 될 수 있다. \"모듈\"은 하나 또는 그 이상의 기능을 수행하는 최소 단위 또는 그 일부가 될 수도 있다. \"모듈\"은 기계적으로 또는 전자적으로 구현될 수 있 다. 예를 들면, 본 개시에 따른 \"모듈\"은, 알려졌거나 앞으로 개발될, 어떤 동작들을 수행하는 ASIC(application-specific integrated circuit) 칩, FPGAs(field-programmable gate arrays) 또는 프로그램 가능 논리 장치(programmable-logic device) 중 적어도 하나를 포함할 수 있다. 도 3은 본 개시의 다양한 실시예들에 따른 전자 장치의 구성 및 동작을 설명하기 위한 도면이다. 전자 장치는 전원공급부, 모드 제어부, 커넥터, 및 호스트 컨트롤러를 포함할 수 있 다. 다만, 도 3은 본 개시의 한 실시예에 따른 전자 장치의 동작을 설명하기 위한 일부 구성을 나타낸 것으로 상기 전자 장치는 도 1 및 도 2의 전자장치(100, 200)의 다른 구성요소들을 포함할 수 있다. 본 개시의 일 실시예에 의하면, 전자 장치가 포함하는 입출력 인터페이스는 데이터 통신 모드 또는 충전 모드로 모드 변경이 가능하다. 여기서, 상기 입출력 인터페이스는 도 2에 도시된 입출력 인터페이스를 포 함할 수 있다. 전자 장치의 입출력 인터페이스는 도 3에 도시된 구성을 포함할 수 있다. 이하, 도 3의 외부 전자 장치의 일 예시로 USB 연결 인터페이스를 가지는 USB기기를 중점으로 하여 설명한 다. 이 경우, 입출력 인터페이스는 USB 인터페이스일 수 있다. 다만, 외부 전자 장치는 USB 기기 외에도 전자 장치의 커넥터에 연결되어 데이터를 전송할 수 있는 전자 장치라면 어떠한 외 부 전자 장치라도 가능하고, 사용되는 입출력 인터페이스도 USB 인터페이스로 한정되지 않는다. 본 개시의 다양한 실시예에서, 상기 충전 모드는 DCP(Dedicated Charging Port)모드이고, 상기 데이터 통신 모 드는 SDP(Standard Downstreaming Port) 모드 또는 CDP(Charging Downstreaming Port) 모드 중 하나일 수 있다. DCP 모드는 입출력 인터페이스(예를 들면, USB 인터페이스)가 데이터 통신을 하지 않으며 최 대 1.5A의 충전 기능을 제공하는 모드이고, SDP 모드는 입출력 인터페이스(예를 들면, USB 인터페이스 )가 데이터 통신 기능을 하며 최대 500Ma의 충전 기능을 제공하는 모드이다. CDP 모드는 입출력 인터페이 스(예를 들면, USB 인터페이스)가 데이터 통신 기능을 지원하면서 최대 1.5A의 충전 기능을 제공하는 모드이다. 이하, 도 3을 참조하여 본 개시의 일 실시예에 의한 전자 장치를 설명한다. 전원공급부는 커넥터와 연결된 전원 공급 라인을 통해 외부 전자 장치(예를 들면, USB 기 기)에 전원을 공급할 수 있다. 전원 공급 라인은 전원공급부 와 커넥터를 연결할 수 있 다. 전원 공급 라인은 데이터 및 전원이 전송되는 전송 경로로 사용되는 전자 장치 내의 버스(BUS)일 수 있다. 상기 전원 공급 라인은 데이터 통신 이외에 전원 공급만을 목적으로 하는 브이버스(VBUS)일 수 있 다. 구체적으로, 상기 전원공급부는 상기 전원 공급 라인을 통해 커넥터 및 상기 커넥터 와 연결된 케이블을 통하여 외부 전자 장치에 전원을 공급할 수 있다. 여기서, 상기 외부 전자 장치(36 0)가 케이블 없이 직접 상기 커넥터에 연결된 경우, 상기 전원공급부는 전원 공급 라인 및 커넥 터를 통하여 상기 외부 전자 장치에 전원을 공급할 수 있다. 상기 전원은 전원 공급 라인을 흐 르는 전류일 수 있다. 상기 전원공급부는 도 2의 전력 관리 모듈 및 배터리를 포함할 수 있다. 전원공급부는 상기 전력 관리 모듈 및 상기 배터리에 저장된 전원을 상기 전원 공급 라인 으로 전달할 수 있다. 또는, 상기 전원공급부는 전자 장치가 외부로부터 공급 받는(예를 들면, 상기 전자 장치가 전원 케이블 등을 통해 전원을 공급받는 경우) 전원을 상기 전원 공급 라인에 전달할 수 있다. 본 개시의 일 실시예에 의하면, 전원공급부는 리미트 회로를 포함할 수 있다. 리미트 회로는 전원 공급 라 인에 설정값 이상의 전류가 흐르는 것을 방지할 수 있다. 전원 공급 라인은 고장 또는 사고를 방지하 기 위한 허용 전류값이 정해져 있을 수 있다. 이 경우, 설정값은 상기 허용 전류값 이하의 값으로 설정될 수 있다. 상기 리미트 회로는 상기 전원 공급 라인에 상기 설정값을 초과하는 전류가 흐르지 못하도록 함으 로써, 전자 장치의 고장 및 안전 사고를 방지할 수 있다. 설정값은 사용자가 임의대로 설정 및 변경할 수 있다. 설정값은 사용자가 입력 장치를 통해 입력할 수 있다. 모드 제어부는 전원 공급 라인에 흐르는 전류를 측정할 수 있다. 상기 모드 제어부는 전류를 측정하기 위한 전류계 또는 전류 측정 센서를 구비할 수 있다. 상기 모드 제어부가 전류를 측정하는 지점은 상기 전원 공급 라인 상의 임의의 지 점이면 어떠한 지점이라도 가능하다. 전자 장치는 상기 전원 공급 라인 중간에 삽입되어, 상기 모드 제어부의 전류를 측정 대상이 되 는 센싱 레지스터를 더 포함할 수 있다. 상기 센싱 레지스터는 상기 모드 제어부가 전류를 측 정하는 지점에 삽입되는 저항일 수 있다. 상기 모드 제어부는 측정한 전류값과 기 설정된 기준값을 비교할 수 있다. 기준값은 사용자가 임의대로 설정 및 변경할 수 있다. 사용자는 입력 장치을 통하여 상기 기준값을 입력할 수 있다. 상기 모드 제어 부는 측정한 전류값이 기준값 이상인 경우와 전류값이 기준값 미만인 경우를 구별하여 입출력 인터페이스 의 모드를 다르게 변경할 수 있다. 도 3을 참조하면, 본 개시의 일 실시예에 의하면, 상기 모드 제어부는 센서 모듈 및 비교기를 포함할 수 있다. 센서 모듈은 전원 공급 라인에 흐르는 전류를 측정할 수 있다. 상기 센서 모듈은 전류를 측정 하기 위한 센서를 포함할 수 있다. 상기 센서는 전류를 측정할 수 있는 것이라면 주지의 어떠한 센서라도 가능 하다. 상기 센서 모듈은 측정한 전류값을 비교기로 전송할 수 있다. 상기 센서 모듈은 도 2에 도시된 센서 모듈이거나, 또는 도 2의 센서 모듈을 포함할 수 있다. 즉, 상기 센서 모듈은 물 리량을 계측하거나 전자 장치의 작동 상태를 감지하여, 계측 또는 감지된 정보를 전기 신호로 변환할 수있다. 상기 센서 모듈은, 예를 들면, 제스처 센서(240A), 자이로 센서(240B), 기압 센서(240C), 마그네틱 센서(240D), 가속도 센서(240E), 그립 센서(240F), 근접 센서(240G), color 센서(240H)(예: RGB(red, green, blue) 센서), 생체 센서(240I), 온/습도 센서(240J), 조도 센서(240K) 또는 UV(ultra violet) 센서(240M) 중의 적어도 하나를 포함할 수 있다. 추가적으로 또는 대체적으로, 상기 센서 모듈은, 예를 들면, 후각 센서(E- nose sensor, 미도시), EMG 센서(electromyography sensor, 미도시), EEG 센서(electroencephalogram sensor, 미도시), ECG 센서(electrocardiogram sensor, 미도시), IR(infra red) 센서(미도시), 홍채 센서(미도시) 또는 지문 센서(미도시) 등을 포함할 수 있다. 상기 센서 모듈은 그 안에 속한 적어도 하나 이상의 센서들을 제어하기 위한 제어 회로를 더 포함할 수 있다. 비교기는 상기 측정한 전류값과 기준값을 비교할 수 있다. 이 경우, 상기 비교기는 비교 결과에 따 라 비교신호를 출력할 수 있다. 상기 기준값은 기준 전류값을 나타내는 값으로 사용자가 임의대로 미리 설정 또 는 변경할 수 있다. 상기 비교신호는 전류값이 기준값보다 큰지 작은지 구별할 수 있는 신호라면 어떠한 신호 라도 사용될 수 있다. 예를 들어, 상기 비교기는 전류값이 기준값보다 크면 1(또는, HIGH), 전류값이 기 준값보다 작으면 0(또는 LOW)를 나타내는 비교신호를 출력할 수 있다. 또는, 반대로 상기 비교기는 인버 터를 사용하여 전류값이 기준값보다 크면0(또는 LOW), 전류값이 기준값보다 작으면 1(또는, HIGH)를 나타내는 비교신호를 출력할 수도 있다. 즉, 전류값과 기준값의 크기를 파악할 수 있는 신호라면 사용자의 임의대로 다 양한 비교신호가 사용될 수 있다. 구체적으로, 상기 입출력 인터페이스의 동작 모드가 충전 모드인 경우, 외부 전자 장치(예를 들면, USB 기 기)의 충전이 완료되면 상기 전원 공급 라인을 흐르는 전류가 감소할 수 있다. 예를 들어, USB 기기 의 충전이 진행중인 경우, 상기 전원 공급 라인에는 1.4A 정도의 전류가 흐를 수 있다. 상기 USB 기 기의 충전이 완료되면 전원 공급 라인에 흐르는 전류가 점점 감소하여mA 또는 그 이하의 전류가 흐르게 된다. 이 경우, 상기 기준값을 400mA로 설정하면, 상기 비교기는 USB 기기가 충전 진행 중인 경우에는 측정한 전류값이 기준값 이상임을 나타내는 비교신호를 출력하고, USB 기기의 충전이 완료되면 측정한 전류값이 기준값 미만임을 나타내는 비교신호를 출력할 수 있다. 이와 유사하게, 외부 전자 장치(예를 들면, USB 기기)가 연결 해제된 경우에는 전원 공급 라인을 통 하여 전류가 공급될 곳이 없어지게 되어서 전원 공급 라인에 흐르는 전류가 0A에 가깝게 감소하게 된다. 또는, 상기 USB 기기가 연결 해제된 경우에는 전원 공급 라인에 전류가 흐르지 않거나, 적은 양의 전 류만이 흐를 수 있다. 따라서, 본 개시의 일 실시예에 의한 전자 장치의 비교기는 USB 기기의 연결이 해제된 경우에, 측정한 전류값이 기준값 미만임을 나타내는 비교신호를 출력할 수 있다. 모드 제어부는 비교신호에 기반하여 입출력 인터페이스의 동작 모드를 변경할 수 있다. 상기 모드 제어부는 비교기가 출력하는 비교신호에 응답하여 입출력 인터페이스의 모드를 데이터 통신 모 드 또는 충전 모드 중 어느 하나로 전환할 수 있다. 여기서, 상기 데이터 통신 모드에서는 외부 전자 장치 로 데이터 전송 및 전원 공급이 함께 일어날 수 있다. 또한, 상기 데이터 통신 모드에서는, 전자 장치 와 외부 전자 장치와의 데이터 전송만 있을 수 있다. 다만, 충전 모드는 외부 전자 장치로의 데이터 전송이 일어나지 않고, 충전(전원 공급) 동작만 일어나는 모드를 말한다. 모드 제어부는, 비교기가 출력하는 비교신호를 분석하여 센서 모듈이 측정한 전류값이 기준값 이상인지 미만인지를 판단할 수 있다. 여기서, 모드 제어부는 전류값이 기준값 이상이면, 동작 모드를 데 이터 통신 모드에서 충전 모드로 변경할 수 있다. 반대로, 전류값이 기준값 미만인 경우, 상기 모드 제어부 는 동작 모드를 데이터 통신 모드로 변경할 수 있다. 입출력 인터페이스가 충전 모드인 경우 전류값이 기준값 이상이거나, 또는 입출력 인터페이스가 데이 터 통신 모드인 경우 전류값이 기준값 미만인 경우, 상기 모드 제어부는 입출력 인터페이스의 동작 모드를 변경하지 않고 그대로 유지할 수 있다. 모드 제어부는 입출력 인터페이스의 동작 모드가 충전 모드인 경우, 전원공급부가 외부 전자 장 치(예를 들면, USB 기기)에 전원을 공급하도록 제어하고, 입출력 인터페이스의 모드가 데이터 통신 모드인 경우 상기 전원공급부의 전원 공급을 중단시킬 수 있다. 또는, 모드 제어부는 동작 모드가 충전 모드인 경우와 데이터 통신 모드인 경우에 전원공급부의 전원 공급량을 다르게 제어할 수 있다. 예 를 들어, 모드 제어부는 충전 모드에서는 전원공급부가 1.5A의 전원을 공급하도록 제어하고, 데이터 통신 모드에서는 상기 전원공급부가 0.5A의 전원을 공급하도록 제어할 수 있다. 여기서, 각 동작 모드별 로 전원공급부가 공급하는 전원의 양은 사용자의 임의대로 변경될 수 있다.본 개시의 한 실시예에 의한 전자 장치는 모드 제어부가 차징 컨트롤 IC 및 임베디드 컨트롤러 를 포함할 수 있다, 차징 컨트롤 IC는 전원공급부의 동작을 제어할 수 있다. 상기 차징 컨트롤 IC는 입출력 인터페 이스의 동작 모드가 변경될 때마다 상기 전원공급부가 전원을 공급 또는 중단하도록 제어할 수 있다. 또한, 입출력 인터페이스의 모드가 변경되는 순간에 오류가 발생하는 것을 방지하기 위하여, 상기 차징 컨 트롤 IC는 상기 입출력 인터페이스의 동작 모드를 변경시키는 순간마다 상기 전원공급부의 동작 을 중단시킬 수 있다.(예를 들어, 입출력 인터페이스의 모드를 충전 모드에서 데이터 통신 모드로 변경하 는 경우, 모드 변경을 하기 이전에 먼저 상기 전원공급부의 동작을 중단시킨 후 상기 입출력 인터페이스 의 동작 모드를 변경할 수 있다.) 임베디드 컨트롤러는 사용자의 입력에 따라 상기 입출력 인터페이스의 동작 모드를 변경할 수 있다. 임베디드 컨트롤러은 MICOM(Microcomputer) 또는 I/O 허브 칩(I/O Hub Chip)을 포함할 수 있다. 임베디 드 컨트롤러는 사용자의 모드 변경 명령을 입력 받는 스위치를 포함할 수 있다. 상기 스위치는 전자 장치 외부에 구비되는 물리적 스위치(또는 버튼)일 수 있다. 이 경우, 사용자가 상기 스위치를 조작하여 모드 변경 명령을 입력하면, 상기 임베디드 컨트롤러는 이를 차징 컨트롤 IC에 전달할 수 있다. 따라서, 본 개시의 일 실시예에 의한 전자 장치는 사용자의 수동 입력에 의해 입출력 인터페이스의 동작 모드 를 변경할 수 있다. 다른 실시예에 의하면, 상기 임베디드 컨트롤러는 사용자의 입력을 받는 입력부(미도시)를 포함할 수 있다. 상기 입력부는 도 2의 입력 장치를 포함할 수 있다. 상기 임베디드 컨트롤러는 입력부를 통해 사 용자로부터 입력 받은 정보를 토대로 소프트웨어적으로 입출력 인터페이스의 모드를 변경할 수도 있다. 본 개시의 일 실시예에 의하면, 상기 모드 제어부는 상기 커넥터에 연결된 외부 전자장치(예를 들면, USB 기기)가 연결 해제되면, 상기 입출력 인터페이스의 모드를 데이터 통신 모드로 변경할 수 있다. 상기 모드 제어부는 상기 커넥터에 외부 전자 장치(예를 들면, USB 기기)가 연결되었는지 여부 를 확인할 수 있다. 구체적으로, 상기 커넥터에서 외부 전자 장치(예를 들면, USB 기기)의 연결이 해제된 경우, 모드 제어부가 측정하는 전원 공급 라인의 전류값이 감소하게 된다. 예를 들어, USB 기기가 연결 해제되면서 전류가 흐르는 회로가 끊기는 효과가 발생하여 전원 공급 라인에 전류가 흐 르지 않거나, 아주 적은 양의 전류가 흐를 수 있다. 따라서, 상기 모드 제어부는 전류값이 기준값 이하로 감소하면 외부 전자 장치(USB 기기)가 연결 해제된 것을 감지하고, 입출력 인터페이스의 모드를 데이 터 통신 모드로 변경할 수 있다. 또한, 상기 모드 제어부는 외부 전자 장치(예를 들면, USB 기기)의 연결 상태를 직접 확인할 수도 있 다. 예를 들어, 상기 모드 제어부는 상기 커넥터에 흐르는 전류 또는 상기 커넥터에 인가되는 전압을 측정하여 외부 전자 장치(예를 들면, USB 기기) 연결을 확인할 수 있다. 또는, 상기 모드 제어부 는 상기 커넥터를 통하여 특정 신호를 전송하고, 그에 대한 외부 전자 장치(예를 들면, USB 기 기)의 반응을 확인하여 외부 전자 장치(예를 들면, USB 기기)의 연결 유무를 확인할 수도 있다. 상 기 모드 제어부는 상기 외부 전자 장치(예를 들면, USB 기기)의 연결이 해제된 것을 감지하면, 입출 력 인터페이스의 모드를 충전 모드에서 데이터 통신 모드로 변경할 수 있다. 본 개시의 일 실시예에 의하면, 상기 모드 제어부는 충전 모드에서 상기 커넥터에 연결된 외부 전자 장치(예를 들면, USB 기기)의 충전이 완료된 것을 감지할 수 있다. 구체적으로, 충전 모드에서 전원공급 부가 전원 공급 라인을 통해 충전 전류를 공급하는 경우, 외부 전자 장치의 충전이 완료되면 전 압 차의 감소 등으로 인하여 상기 전원 공급 라인에 흐르는(전원 공급 라인를 통해 공급하는) 전류가 감소할 수 있다. 이 경우, 상기 모드 제어부는 상기 전원 공급 라인에 흐르는 전류를 측정하고, 설 정된 기준값과 비교할 수 있다. 상기 모드 제어부는 전류값이 기준값 이상인지 미만인지를 판단하여, 입 출력 인터페이스의 동작 모드를 변경할 수 있다. 즉, 상기 모드 제어부는 전류값이 기준값 미만이 되는 경우, 동작 모드를 데이터 통신 모드로 변경할 수 있다. 상기 모드 제어부는 직접적으로 외부 전자 장치(예를 들면, USB 기기)의 충전 정도를 실시간으로 확 인할 수도 있다. 따라서, 상기 모드 제어부는 외부 전자 장치의 배터리가 충전이 완료되면 입출력 인터페이스를 충전 모드에서 데이터 통신 모드로 변경하고, 상기 외부 전자 장치의 배터리가 방전되 면 입출력 인터페이스를 데이터 통신 모드에서 충전 모드로 변경할 수도 있다.따라서, 본 발명의 일 실시예에 의한 전자 장치는 연결된 외부 전자 장치의 충전이 완료되면, 동작 모드를 변경하여 불필요한 충전 동작을 멈출 수 있다. 모드 제어부는 사용자의 모드 변경 명령이 입력되면, 상기 커넥터에 연결된 외부 전자 장치가 충전 모드를 지원하는지 파악하여, 상기 외부 전자 장치가 충전 모드를 지원하지 않는 경우, 입출력 인터 페이스의 모드를 데이터 통신 모드로 변경할 수 있다. 예를 들어, 충전 모드를 지원하지 않는 USB 마우스 또는 USB 키보드가 전자장치에 연결된 경우, 모드 제어부는 입출력 인터페이스를 충전 모드로 변경하 려는 모드 변경 명령이 입력되어도 입출력 인터페이스를 데이터 통신 모드로 유지할 수 있다. 상기 모드 변경 명령은 모드 제어부가 구비한 스위치(미도시) 또는, 도 2에 도시한 입력 장치를 통하 여 사용자로부터 입력 받을 수 있다. 즉, 사용자는 수동으로 상기 모드 변경 명령을 입력하여 입출력 인터페이 스의 동작 모드를 변경할 수 있다. 상기 모드 제어부는 입출력 인터페이스의 동작 모드가 데이터 통신 모드인 경우에 상기 모드 변경 명 령이 입력되면 커넥터에 연결된 외부 전자 장치가 충전 모드를 지원하는 것인지 판단할 수 있다. 외 부 전자 장치가 충전 모드를 지원하지 않는 경우에도 사용자의 입력에 따라 입출력 인터페이스를 충 전 모드로 변경하게 되면, 연결된 외부 전자 장치를 제대로 인식하지 못하거나, 외부 전자 장치가 정 상적으로 동작하지 못할 수가 있다. 따라서, 상기 모드 제어부는 외부 전자 장치가 연결되면, 우선 적으로 연결된 외부 전자 장치의 정보를 전송 받아서 외부 전자 장치가 충전 모드를 지원하는지 확인 할 수 있다. 또는, 상기 모드 제어부는 입출력 인터페이스의 모드를 충전 모드로 변경한 후, 전원공 급부가 공급하는 전류를 측정하고, 전류값을 기준값과 비교하여 다시 입출력 인터페이스의 동작 모드를 데이터 통신 모드로 변경할 수도 있다. 구체적으로, 충전 모드에서 외부 전자 장치가 충전 모드를 지원하지 않는 기기인 경우에는, 전원공급부가 전원 공급 라인에 공급하는 전류가 일정 이상 유지되 지 않고 감소할 수 있다. 이 경우, 모드 제어부의 센서 모듈은 상기 전원 공급 라인에 흐르는 전류를 측정할 수 있다. 이후, 모드 제어부의 비교기가 측정한 전류값을 기 설정된 기준값과 비교하 여 비교신호를 출력할 수 있다. 따라서, 상기 모드 제어부는 상기 비교신호에 기반하여 전류값이 기준값 미만이 되는 경우, 동작 모드를 데이터 통신 모드로 변경할 수 있다. 즉, 본 개시의 일 실시예에 의한 전자 장 치는, 사용자의 수동 입력으로 입출력 인터페이스의 동작 모드를 충전 모드로 변경한 경우에도, 연결 된 외부 전자 장치가 충전 모드를 지원하지 않는 장치인 경우 자동으로 입출력 인터페이스의 동작 모 드를 데이터 통신 모드로 전환할 수 있다. 앞서 기술한 본 개시의 다양하 실시예에 의하면, 모드 제어부는 센서 모듈, 비교기, 차징 컨트 롤 IC 및 임베디드 컨트롤러를 포함할 수 있다. 다만, 상기 구성은 모드 제어부의 필수 구성요 소는 아니고, 필요에 따라 일부 구성이 생략될 수 있으며, 각 구성요소의 기능을 종합적으로 수행하는 하나의 모듈 또는 칩으로 구성될 수도 있다. 커넥터는 외부 전자 장치를 연결할 수 있다. 상기 커넥터는 전자 장치의 일 측면에 구비 될 수 있다. 상기 커넥터에는 외부 전자 장치가 직접 연결될 수도 있고, 별도의 케이블을 통해 외부 전자 장치와 연결될 수도 있다. 호스트 컨트롤러는 커넥터에 연결된 외부 외부 전자 장치(예를 들면, USB 기기)와의 데이터 전송을 제어할 수 있다. 상기 호스트 컨트롤러는 상기 입출력 인터페이스의 모드가 충전 모드인 경우에 대 기 상태를 유지하고, 상기 입출력 인터페이스의 모드가 데이터 통신 모드로 변경되면 상기 전자 장치(30 0)와 상기 외부 전자 장치에 저장된 정보를 전송 및 관리할 수 있다. 본 개시의 일 실시예에 의한, 데이터 통신 모드 또는 충전 모드로 동작 모드의 변경이 가능한 입출력 인터페이 스를 포함하는 전자 장치는 외부 전자 장치가 연결되는 커넥터, 상기 커넥터와 연결 된 전원 공급 라인을 통해 상기 외부 전자 장치에 전원을 공급하는 전원공급부, 상기 전원 공급 라인에 흐르는 전류를 측정하고, 상기 측정한 전류값과 기준값을 비교한 결과에 따라 비교신호를 출력하는 모드 제어부, 상기 외부 전자 장치와의 데이터 전송을 제어하는 호스트 컨트롤러 및 상기 비교신호에 기반하여 동작 모드를 변경하고, 동자 모드에 따라 상기 전원공급부 및 상기 호스트 컨트롤러의 동작 을 제어하는 모드 제어부를 포함할 수 있다. 상기 전원공급부는 상기 전원 공급 라인에 설정값 이상의 전류가 흐르는 것을 방지하는 리미트 회로를 포 함할 수 있다. 상기 모드 제어부는 상기 전원 공급 라인에 흐르는 전류를 측정하는 센서 모듈 및 상기 측정한 전류값과 기준값을 비교하고, 비교 결과에 따라 비교신호를 출력하는 비교기를 포함할 수 있다. 상기 모드 제어부는 상기 비교신호를 분석하여 상기 전류값이 상기 기준값보다 작으면 동작 모드를 데이터 통신 모드로 변경하고, 상기 전류값이 상기 기준값 이상이면 동작 모드를 충전 모드로 변경할 수 있다. 상기 모드 제어부는 동작 모드가 충전 모드인 경우 상기 전원공급부가 상기 외부 전자 장치에 전원을 공급하도록 제어하고, 동작 모드가 데이터 통신 모드인 경우 상기 전원공급부의 전원 공급을 중단 시킬 수 있다. 상기 모드 제어부는 상기 전원공급부의 동작을 제어하는 차징 컨트롤 IC 및 사용자의 입력에 따 라 동작 모드를 변경하는 임베디드 컨트롤러를 포함할 수 있다. 상기 모드 제어부는 상기 커넥터에 연결된 상기 외부 전자 장치가 연결 해제되면, 동작 모드를 데이터 통신 모드로 변경할 수 있다. 상기 모드 제어부는 충전 모드에서 상기 커넥터에 연결된 상기 외부 전자 장치의 충전이 완료되 면, 동작 모드를 데이터 통신 모드로 변경할 수 있다. 상기 모드 제어부는 사용자의 모드 변경 명령을 입력 받는 스위치를 포함할 수 있다. 상기 모드 제어부 는 사용자로부터 상기 입출력 인터페이스의 동작 모드를 충전 모드로 변경하는 모드 변경 명령이 입 력되면, 상기 커넥터에 연결된 상기 외부 전자 장치가 충전 모드를 지원하는지 파악하여, 상기 외부 전자 장치가 충전 모드를 지원하지 않는 경우, 동작 모드를 데이터 통신 모드로 변경할 수 있다. 본 개시의 일 실시예에 의한 전자 장치는, 상기 전원 공급 라인 사이에 삽입되어, 상기 측정부 의 전류 측정 대상이 되는 센싱 레지스터를 더 포함할 수 있다. 상기 모드 제어부는 상기 입출력 인터페이스의 동작 모드가 충전 모드인 경우, 상기 호스트 컨트롤러 의 동작을 중단시키고, 상기 전원공급부가 전원을 공급하도록 제어할 수 있다. 도 4는 본 개시의 다양한 실시 예들에 따른 입출력 인터페이스 제어 방법의 순서도이다. 전자 장치는 410과정에서, 커넥터에 연결된 외부 전자 장치(예를 들면, USB 기기)의 연결 상태 를 파악할 수 있다. 구체적으로, 전자 장치는 상기 410 과정에서, 전원공급부가 전원 공급 라인 을 통하여 외부 전자 장치에 전원을 공급할 수 있다. 이 경우, 상기 전원은 충전 전류일 수 있다. 상기 410과정에서는, 모드 제어부가 상기 전원 공급 라인에 흐르는 전류를 측정할 수 있다. 이 경우, 상기 모드 제어부는 상기 측정한 전류를 기준값과 비교할 수 있다. 상기 410과정에서는, 모드 제어 부가 측정한 전류값이 기준값 미만인지 판단할 수 있다. 상기 410 과정에서는, 모드 제어부가 전류 값이 기준값 미만인 경우, 외부 전자 기기가 연결 해제된 것으로 판단하여 입출력 인터페이스의 동작 모드를 데이터 통신 모드로 변경할 수 있다. 충전 모드에서는, 새로운 외부 전자 장치가 연결되어도 데이 터 통신이 이루어지지 않기 때문에 연결되는 외부 전자 장치의 인식 불량이 발생할 수 있다. 따라서, 본 개시의 일 실시예에 의한 입출력 인터페이스 제어 방법은, 전자장치에 연결된 외부 전자 장치가 연결 해제되는 경우에 자동으로 입출력 인터페이스의 동작 모드를 데이터 통신 모드로 변경함으로써, 이후에 새 로운 외부 전자 장치가 연결되는 경우의 인식 불량 및 동작 불량을 방지할 수 있다. 상기 410 과정에서는, 외부 전자 장치가 연결된 것을 감지하면, 전자 장치의 메모리에 저장된 프로그램(또는 어플리케이션)이 AP에 의해 구동될 수 있다. 전자 장치는 410 과정에서, OS 및 어플 리케이션이 실행되어 외부 전자 장치가 연결된 것을 감지하고, 디스플레이 모듈에 외부 전자 장치 가 연결된 것을 알려주는 알림창 또는 팝업(pop-up)창을 표시할 수 있다. 전자 장치는 420 과정에서, 입출력 인터페이스의 동작 모드를 확인하고, 각 모드별 기능을 실행할 수 있다. 구체적으로, 입출력 인터페이스의 동작 모드가 충전 모드인 경우, 전자 장치는 상기 420 과정 에서, 전원공급부에 의해 외부 전자 장치에 전원을 공급할 수 있다. 또한, 입출력 인터페이스 의 모드가 데이터 통신 모드인 경우, 전자 장치는 상기 420 과정에서, 호스트 컨트롤러에 의해 상기 전자 장치와 외부 전자 장치 간의 데이터 전송 및 관리 기능이 실행될 수 있다. 상기 420 과정에서는, 충전 모드의 경우, 전자 장치는 외부 전자 장치와 데이터 전송 동작 없이 외부 전자 장치의 충전 동작만을 수행할 수 있다. 430 과정에서는 입출력 인터페이스의 동작 모드가 충전 모드인 경우와 데이터 통신 모드인 경우의 분기가 발생할 수 있다. 전자 장치는 440 과정에서, 입출력 인터페이스가 충전 모드의 기능을 수행하도록 할 수 있다. 상기 440 과정에서는, 모드 제어부가 전원 공급 라인에 흐르는 전류를 측정할 수 있다. 440과정에서는, 모드 제어부의 센서 모듈이 전원 공급 라인에 흐르는 전류를 측정할 수 있다. 상기 전원 공급 라인에 흐르는 전류는 상기 전원공급부가 외부 전자 장치를 충전하기 위하여 공급하는 전류일 수 있다. 450 과정에서는, 모드 제어부가 상기 측정한 전류를 기준값과 비교할 수 있다. 구체적으로, 전자 장치 에 연결된 외부 전자 장치가 연결이 해제된 경우, 충전 모드에서 전자 장치에 연결된 외부 전자 장치의 충전이 완료된 경우, 또는 전자 장치에 연결된 외부 전자 장치가 충전 모드를 지원하지 않는 장치일 때 입출력 인터페이스가 충전 모드를 계속 유지하는 경우에는 이후에 새로운 외부 전자 장치 의 연결 시 인식 불량 또는 동작 불량이 발생하게 된다. 또한, 상기 언급한 외부 전자 장치의 연결 이 해제되는 경우, 외부 전자 장치의 충전이 완료되는 경우 및 충전 모드를 지원하지 않는 외부 전자 장치 가 연결된 경우에는 상기 전원 공급 라인에 흐르는 전류가 감소하게 된다. 이 경우, 모드 제어부 의 비교기 전류값과 기준값을 비교한 결과를 나타내는 비교신호를 출력할 수 있다. 따라서, 상기 460 과정에서, 모드 제어부는 비교신호에 기반하여 전류값이 기준값 미만이 되는 경우를 판단하여, 입출력 인터페이스의 모드를 데이터 통신 모드로 변경할 수 있다. 반대로, 전원 공급 라인에 흐르는 전류가 상기 기준값 이상이 되는 경우(비교기가 측정한 전류가 기준값 이상임을 나타내는 비교신호를 출력한 경우)에는 전자 장치는 상기 420 과정을 수행할 수 있다. 460과정에서는, 모드 제어부가 입출력 인터페이스의 동작 모드를 변경하면서 전원공급부의 동작 을 제어할 수 있다. 예를 들어, 입출력 인터페이스가 충전 모드에서 데이터 통신 모드로 변경되는 경우, 상기 모드 제어부는 상기 전원공급부를 제어하여 외부 전자 장치에 전원을 공급하는 동작을 중 단시킬 수 있다. 또는, 상기 모드 제어부는 상기 전원공급부가 외부 전자 장치에 공급하는 전 원의 양을 감소시킬 수 있다. 470 과정에서는, 전자 장치의 모드 제어부가 동작 모드를 데이터 통신 모드로 변경할 수 있다. 즉, 본 개시의 일 실시예에 의한 전자 장치는 외부 전자 장치(예를 들면, USB 기기)의 연결이 해제된 경 우에는 입출력 인터페이스의 동작 모드가 항상 데이터 통신 모드로 변경되도록 할 수 있다. 480 과정에서는, 전자 장치가 사용자로부터 모드 변경 명령을 입력 받을 수 있다. 상기 모드 변경 명령은 입력 장치 또는 모드 제어부가 구비한 스위치를 통하여 입력 받을 수 있다. 상기 480 과정에서는, 사용자의 모드 변경 명령 입력이 없으면, 상기 전자 장치가 입출력 인터페이스의 동작 모드를 데이터 통신 모드로 유지할 수 있다. 상기 모드 변경 명령은 입출력 인터페이스를 충전 모드로 변경 요청하는 입 력일 수 있다. 상기 480 과정에서는 모드 변경 명령(충전 모드로 변경하기 위한 사용자의 입력)이 입력되면, 상기 440과정으로 분기할 수 있다. 또한, 본 개시의 일 실시예에 의한 입출력 인터페이스 제어 방법에 의하면, 상기 모드 변경 명령은 전자 장치 가 동작하는 중이라면 어느 때에라도 입력될 수 있다. 이 경우, 상기 전자 장치는 연결되는 외부 전자 장치가 충전 모드를 지원하는지 판단할 수 있다. 따 라서, 전자 장치에 연결된 외부 전자 장치가 충전 모드를 지원하지 않는 경우, 상기 전자 장치 는 입출력 인터페이스의 동작 모드를 데이터 변경 모드로 다시 변경할 수 있다. 따라서, 본 개시의 일 실 시예에 의한 입출력 인터페이스 제어 방법에 의하면, 전자 장치에 충전 모드를 지원하지 않는 외부 전자 장치가 연결된 경우에 지원하지 않는 모드가 설정되어 외부 전자 장치의 인식 불량 및 동작 불량이 발생하는 것을 방지할 수 있다. 본 개시의 일 실시예에 의한 입출력 인터페이스 제어 방법은, 커넥터에 연결된 외부 전자 장치의 연 결이 해제된 것을 파악하는 과정 및 상기 외부 전자 장치의 연결이 해제된 경우, 입출력 인터페이스의 동작 모드를 데이터 통신 모드로 변경하는 과정을 포함할 수 있다. 여기서, 상기 외부 전자 장치의 연결 상태를 파악하는 과정은 전원 공급 라인을 통하여 상기 외부 전 자 장치로 공급되는 전류를 측정하는 과정 및 상기 측정한 전류가 기준값 미만인 경우 상기 외부 전자 장 치의 연결이 해제된 것으로 파악하는 과정을 포함할 수 있다. 본 개시의 한 실시예에 의한 입출력 인터페이스 제어 방법은, 입출력 인터페이스의 동작 모드를 확인하는 과정, 상기 입출력 인터페이스의 동작 모드가 충전 모드인 경우, 외부 전자 장치에 전원을 공급하는 전원 공급 라인의 전류를 측정하는 과정, 상기 측정한 전류와 기준값을 비교하는 과정 및 상기 전류가 기 준값 이하인 경우, 동작 모드를 데이터 통신 모드로 변경하는 과정을 더 포함할 수 있다. 본 개시의 한 실시예에 의한 입출력 인터페이스 제어 방법은, 사용자로부터 상기 입출력 인터페이스의 동 작 모드를 충전 모드로 변경하는 모드 변경 명령을 입력 받는 과정, 상기 커넥터에 연결된 외부 전자 장치 가 충전 모드를 지원하는지 판단하는 과정 및 상기 외부 전자 장치가 전 모드를 지원하지 않는 경우, 상기 입출력 인터페이스의 동작 모드를 데이터 통신 모드로 변경하는 과정을 더 포함할 수 있다. 여기서, 상기 충전 모드는 DCP(Dedicated Charging Port) 모드이고, 상기 데이터 통신 모드는 SDP(Standard Downstreaming Port) 모드 또는 CDP(Charging Downstreaming Port) 모드 중 하나일 수 있다. 본 개시의 한 실시예에 의한 입출력 인터페이스 제어 방법은, 상기 입출력 인터페이스가 충전 모드인 경우, 상기 커넥터에 연결된 외부 전자 장치의 충전이 완료되면 상기 입출력 인터페이스의 동작 모드를 데이터 통신 모드로 변경하는 과정을 더 포함할 수 있다. 본 개시의 한 실시예에 의한 입출력 인터페이스 제어 방법은, 상기 입출력 인터페이스의 모드가 데이터 통 신 모드인 경우, 상기 커넥터에 연결된 외부 전자 장치가 방전되면 상기 입출력 인터페이스의 동작 모드를 충전 모드로 변경하는 과정을 더 포함할 수 있다. 도 5a 및 도 5b는 본 개시의 다양한 실시 예들에 따른 전자 장치를 이용한 외부 전자 장치(예를 들면, USB 기기) 충전 시와 아답터를 이용한 외부 전자 장치 충전 시의 전류와 전압을 나타내는 도면이다. 도 5a는, 아답터를 이용하여 외부 전자 장치를 충전하는 경우의 전류 및 전압을 나타내는 그래프이다. 아 답터를 이용하여 외부 전자 장치를 충전하는 경우, 전자 장치가 충전 모드에서 외부 전자 장치 를 충전하는 경우보다 높은 전압 및 전류가 공급된다. 따라서, 아답터를 이용하여 외부 전자 장치를 충전 할 경우, 보다 빠른 속도로 외부 전자 장치를 충전할 수 있다. 다만, 아답터를 이용한 경우, 데이터 통신 과는 별도로 외부 전자 장치의 충전만을 할 수 있다는 단점이 있다. 도 5b는 본 개시의 다양한 실시 예들에 따른 전자 장치를 이용하여 외부 전자 장치를 충전하는 경우 의 전류 및 전압을 나타낸다. 도 5b를 참조하면, 입출력 인터페이스의 동작 모드가 충전 모드인 경우, 일반적으로 1.2A와 1.4A 사이의 전류를 공급하여 외부 전자 장치를 충전하게 된다. 이 경우, 외부 전자 장치에 4.8V 정도의 전압이 인가될 수 있다. 이 경우, 외부 전자 장치의 충전이 완료되거나 또는, 외부 전자 장치의 연결이 해 제되는 경우에는 충전 전류가 감소할 수 있다. 따라서, 특정 전류값을 기준값으로 설정하여(예를 들면, 400mA) 전류가 상기 기준값 이하로 감소하는 경우에 외부 전자 장치의 충전이 완료된 것을 파악할 수 있다. 또는, 상기 외부 전자 장치가 전자 장치에서 분리되어 연결이 해제된 것을 파악할 수 있다. 따라서, 본 개시의 일 실시예에 의한 입출력 인터페이스 제어 방법 및 전자 장치에 의하면, 충전 모드에서 전원 공 급 라인에 흐르는 전류가 기준값 이하가 되는 경우 입출력 인터페이스의 동작 모드를 데이터 통신 모 드로 변경하여 외부 전자 장치의 충전을 중단하고, 전력 소비를 줄일 수 있다. 충전 모드에서 전자 장치에 외부 전자 장치가 연결되는 경우, 데이터 전송이 이뤄지지 않기 때문에 전자 장치가 외부 전자 장치를 인식하지 못하게 된다. 따라서, 본 개시의 다양한 실시예들에 의한 USB 인터페이스 제어 방법 및 전자 장치에 의하면, 전자 장치 에 다른 외부 전자 장치가 연결될 경우, 데이터 통신 모드에서 외부 전자 장치가 연결되게 함으로써, 연결된 새로운 외부 전자 장치의 인식 불량 및 동작 불량을 방지할 수 있다.본 개시에 따른 모듈 또는 프로그래밍 모듈은 전술한 구성요소들 중 적어도 하나 이상을 포함하거나, 일부가 생 략되거나, 또는 추가적인 다른 구성요소를 더 포함할 수 있다. 본 개시에 따른 모듈, 프로그래밍 모듈 또는 다 른 구성요소에 의해 수행되는 동작들은 순차적, 병렬적, 반복적 또는 휴리스틱(heuristic)한 방법으로 실행될 수 있다. 또한, 일부 동작은 다른 순서로 실행되거나, 생략되거나, 또는 다른 동작이 추가될 수 있다. 본 개시의 일 실시예에 의한 컴퓨터로 읽을 수 있는 기록매체는 입출력 인터페이스 제어 방법을 수행하도록 하 는 명령어들을 포함하는 하나 이상의 프로그램이 기록될 수 있다. 여기서, 상기 입출력 인터페이스 제어 방법은 커넥터에 연결된 외부 전자 장치의 연결이 해제된 것을 파악하는 과정 및 상기 외부 전자 장치의 연결이 해제된 경우, 상기 입출력 인터페이스의 모드를 데 이터 통신 모드로 변경하는 과정을 포함할 수 있다. 다양한 실시예들에 따르면, 본 개시에 따른 장치(예: 모듈들 또는 그 기능들) 또는 방법(예: 동작들)의 적어도 일부는, 예컨대, 프로그래밍 모듈의 형태로 컴퓨터로 읽을 수 있는 저장매체(computer-readable storage medi a)에 저장된 명령어로 구현될 수 있다. 상기 명령어는, 하나 이상의 프로세서(예: 상기 프로세서)에 의해 실행될 경우, 상기 하나 이상의 프로세서가 상기 명령어에 해당하는 기능을 수행할 수 있다. 컴퓨터로 읽을 수 있는 저장매체는, 예를 들면, 상기 메모리가 될 수 있다. 상기 프로그래밍 모듈의 적어도 일부는, 예를 들면, 상기 프로세서에 의해 구현(implement)(예: 실행)될 수 있다. 상기 프로그래밍 모듈의 적어도 일부 는 하나 이상의 기능을 수행하기 위한, 예를 들면, 모듈, 프로그램, 루틴, 명령어 세트(sets of instructions) 또는 프로세스 등을 포함할 수 있다. 상기 컴퓨터로 판독 가능한 기록 매체에는 하드디스크, 플로피디스크 및 자기 테이프와 같은 마그네틱 매체 (Magnetic Media)와, CD-ROM(Compact Disc Read Only Memory), DVD(Digital Versatile Disc)와 같은 광기록 매체(Optical Media)와, 플롭티컬 디스크(Floptical Disk)와 같은 자기-광 매체(Magneto-Optical Media)와, 그 리고 ROM(Read Only Memory), RAM(Random Access Memory), 플래시 메모리 등과 같은 프로그램 명령(예: 프로그 래밍 모듈)을 저장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함될 수 있다. 또한, 프로그램 명령에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실 행될 수 있는 고급 언어 코드를 포함할 수 있다. 상술한 하드웨어 장치는 본 개시의 동작을 수행하기 위해 하 나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지다. 본 명세서와 도면에 개시된 실시 예들은 본 개시의 내용을 쉽게 설명하고, 이해를 돕기 위해 특정 예를 제시한 것일 뿐이며, 본 개시의 범위를 한정하고자 하는 것은 아니다. 따라서 본 개시의 범위는 여기에 개시된 실시 예 들 이외에도 본 개시의 기술적 사상을 바탕으로 도출되는 모든 변경 또는 변형된 형태가 본 개시의 범위에 포함 되는 것으로 해석되어야 한다."}
{"patent_id": "10-2014-0031563", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 다양한 실시예들에 따른 전자 장치를 포함하는 네트워크 환경을 나타내는 도면이다. 도 2는 본 개시의 다양한 실시예들에 따른 전자 장치의 구성을 나타내는 도면이다. 도 3은 본 개시의 다양한 실시예들에 따른 전자 장치의 구성 및 동작을 나타내는 도면이다. 도 4는 본 개시의 다양한 실시예들에 따른 전자 장치의 입출력 인터페이스 제어 방법을 나타내는 순서도이다. 도 5는 본 개시의 다양한 실시 예들에 따른 전자 장치를 이용한 외부 전자 장치 충전 시와 아답터를 이용한 외 부 전자 장치 충전 시의 전류와 전압을 나타내는 도면이다."}
