{"patent_id": "10-2014-0018713", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2015-0097330", "출원번호": "10-2014-0018713", "발명의 명칭": "충전 제어 방법 및 그 장치", "출원인": "삼성전자주식회사", "발명자": "김종민"}}
{"patent_id": "10-2014-0018713", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "컴퓨팅 시스템의 충전 제어 방법에 있어서,상기 컴퓨팅 시스템에 연결된 외부 장치에 대한 충전 방식을 결정하는 동작;상기 충전 방식에 따라 상기 외부 장치를 충전하는 동작;상기 컴퓨팅 시스템 내부의 전류 및 전압을 모니터링 하는 동작; 및상기 모니터링 결과에 기반하여 상기 충전 방식을 변경하는 동작을 포함하는 방법."}
{"patent_id": "10-2014-0018713", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 상기 충전 방식을 결정하는 동작은,사용자에게 선택 가능한 복수 개의 충전 모드를 제시하는(present) 동작;상기 복수 개의 충전 모드 중 하나의 모드를 선택하는 사용자 입력을 수신하는 동작; 및상기 선택된 모드를 상기 충전 방식으로 결정하는 동작을 포함하는 방법."}
{"patent_id": "10-2014-0018713", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서, 상기 충전 방식을 결정하는 동작은,상기 컴퓨팅 시스템의 시스템 부하, 상기 컴퓨팅 시스템에 포함된 자체 배터리 충전 상황, 및 상기 외부 장치의동작 상태 중 적어도 하나에 기반하여 충전 방식을 자동으로 결정하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2014-0018713", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서, 상기 충전 방식을 결정하는 동작은,사용자에게 선택 가능한 충전 전류의 범위를 제시하는 동작;상기 충전 전류의 범위에 해당하는 특정 전류 값에 대한 사용자 입력을 수신하는 동작; 및상기 수신된 사용자 입력에 기반하여, 상기 특정 전류 값에 따라 충전 방식을 결정하는 동작을 포함하는 방법."}
{"patent_id": "10-2014-0018713", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서, 상기 모니터링 하는 동작은,상기 컴퓨팅 시스템에 전기적으로 연결되고 상기 컴퓨팅 시스템으로 전원을 공급하는 어댑터에 의한 입력 전류를 모니터링 하는 동작 또는 상기 컴퓨팅 시스템의 시스템 전압을 모니터링 하는 동작 중 적어도 하나의 동작을포함하는 방법."}
{"patent_id": "10-2014-0018713", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 1에 있어서, 상기 모니터링 하는 동작은,상기 컴퓨팅 시스템에 전기적으로 연결되고 상기 컴퓨팅 시스템으로 전원을 공급하는 어댑터에 의한 입력 전류를 모니터링 하는 동작; 및상기 컴퓨팅 시스템의 시스템 전압을 모니터링 하는 동작 중 적어도 하나의 동작을 포함하는 방법."}
{"patent_id": "10-2014-0018713", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 1에 있어서, 상기 충전 방식을 변경하는 동작은,상기 모니터링 결과, 상기 전류가 기준 전류 값을 초과하거나, 상기 전압이 기준 전압 미만인 경우가 미리 정의공개특허 10-2015-0097330-2-된 횟수 이상 발생하는 경우, 상기 충전 방식을 하위 단계의 충전 방식으로 변경하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2014-0018713", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 1에 있어서, 상기 충전 방식을 변경하는 동작은,상기 모니터링 결과, 상기 전류가 기준 전류 값을 초과하거나 상기 전압이 기준 전압 미만인 경우가 미리 정의된 시간 동안 발생하지 않는 경우, 상기 충전 방식을 상위 단계의 충전 방식으로 변경하는 것을 특징으로 하는방법."}
{"patent_id": "10-2014-0018713", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 6에 있어서, 상기 입력 전류를 모니터링 하는 동작은,상기 입력 전류를 전압으로 변환하고, 상기 변환된 전압이 임계 전압을 초과하는지 여부를 모니터링 하는 방법."}
{"patent_id": "10-2014-0018713", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 6에 있어서, 상기 시스템 전압을 모니터링 하는 동작은,상기 시스템 전압이 기준 전압 이하에서 감지되는지 여부를 모니터링 하는 방법."}
{"patent_id": "10-2014-0018713", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "컴퓨팅 시스템과 연결된 외부 장치의 충전 방식을 제어하는 방법에 있어서,제1 충전 방식으로 상기 외부 장치를 충전하는 동작;상기 컴퓨팅 시스템 내부의 전류 및 전압을 모니터링 하는 동작; 및상기 모니터링 결과에 기반하여 상기 제1 충전 방식을 제2 충전 방식으로 변경하는 동작을 포함하는 방법."}
{"patent_id": "10-2014-0018713", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 11항에 있어서, 상기 전류 및 전압을 모니터링 하는 동작은,미리 정의된 조건에 따라 어댑터 제한 알람 신호를 생성하는 동작; 및상기 어댑터 알림 신호가 기준 횟수 이상 감지되는 경우, 보호 알람 신호를 생성하는 동작을 포함하는 방법."}
{"patent_id": "10-2014-0018713", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 12에 있어서,상기 제2 충전 방식은 상기 제1 충전 방식보다 하위 충전 방식인 것을 특징으로 하는 방법."}
{"patent_id": "10-2014-0018713", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 12에 있어서,상기 어댑터 제한 알람 신호는, 상기 컴퓨팅 시스템으로 제공되는 입력 전류가 임계 값 이상으로 감지되거나,상기 컴퓨팅 시스템의 시스템 전압이 기준 값 이하로 감지되는 경우 발생하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2014-0018713", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "청구항 14에 있어서,상기 어댑터 제한 알림 신호는 제1 시간 동안 유지되는 것을 특징으로 하는 방법."}
{"patent_id": "10-2014-0018713", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "청구항 12에 있어서,상기 보호 알람 신호는 상기 어댑터 제한 알림 신호가 제2 시간 간격으로 상기 기준 횟수 이상 감지되는 경우공개특허 10-2015-0097330-3-생성되는 것을 특징으로 하는 방법."}
{"patent_id": "10-2014-0018713", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "청구항 12에 있어서,상기 보호 알람 신호는 제3 시간 동안 유지되고, 상기 제3 시간 동안 상기 제2 충전 방식은 변경되지 않는 것을특징으로 하는 방법."}
{"patent_id": "10-2014-0018713", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "청구항 11에 있어서,상기 모니터링 결과가 상기 충전 방식의 하향 조정을 지시하는 경우, 상기 제2 충전 방식은 상기 제1 충전 방식에 대하여 하위 충전 방식이고,상기 모니터링 결과가 상기 충전 방식의 상향 조정을 지시하는 경우, 상기 제2 충전 방식은 상기 제1 충전 방식에 대하여 상위 충전 방식인 것을 특징으로 하는 방법."}
{"patent_id": "10-2014-0018713", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "청구항 11에 있어서,상기 모니터링 결과가 상기 충전 방식의 하향 조정을 지시하고, 상기 제1 충전 방식이 최하위 충전 방식인경우, 상기 외부 장치의 충전을 중단하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2014-0018713", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "청구항 11에 있어서,상기 모니터링 결과가 상기 충전 방식의 상향 조정을 지시하고, 상기 제1 충전 방식이 최상위 충전 방식인경우, 상기 제2 충전 방식은 상기 제1 충전 방식과 동일한 충전 방식인 것을 특징으로 하는 방법."}
{"patent_id": "10-2014-0018713", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "외부 장치의 충전 방식을 제어하기 위한 컴퓨팅 시스템에 있어서,상기 외부 장치와 연결을 제공하는 외부 포트;어댑터로부터 제공되는 입력 전류를 모니터링 하기 위한 입력 전류 모니터링부;상기 컴퓨팅 시스템의 시스템 전압을 모니터링 하기 위한 시스템 전압 모니터링 부;상기 입력 전류 모니터링부에 의해 모니터링 된 상기 입력 전류와 상기 시스템 전압 모니터링부에 의해 모니터링된 상기 시스템 전압에 따라 어댑터 제한 알람 신호를 발생시키는 트리거 회로부; 및상기 트리거 회로부에 의해 발생되는 상기 어댑터 제한 알람 신호를 감지하는 컨트롤러를 포함하고,상기 컨트롤러는 상기 어댑터 제한 알람 신호에 기반하여 상기 외부 장치를 충전하는 충전 방식을 변경하는 것을 특징으로 하는 컴퓨팅 시스템."}
{"patent_id": "10-2014-0018713", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "청구항 21에 있어서,상기 컨트롤러는 상기 어댑터 제한 알람 신호가 미리 정해진 시간 간격으로 기준 횟수를 초과하여 감지되는 경우 보호 알람 신호를 생성하고,상기 보호 알람 신호에 따라 상기 충전 방식을 하위 충전 방식으로 변경하는 것을 특징으로 하는 컴퓨팅시스템."}
{"patent_id": "10-2014-0018713", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "공개특허 10-2015-0097330-4-청구항 21에 있어서,상기 컨트롤러는, 미리 정의된 시간 동안, 상기 어댑터 제한 알림 신호가 기준 횟수 이하로 발생하는 경우, 상기 충전 방식을 하위 충전 방식으로 변경하는 것을 특징으로 하는 컴퓨팅 시스템."}
{"patent_id": "10-2014-0018713", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "청구항 21에 있어서,상기 컨트롤러는 상기 외부 장치의 배터리 잔량의 RSOC(Relative State of Charge) 변화량에 기반하여 충전 방식을 변경하는 것을 특징으로 하는 컴퓨팅 시스템."}
{"patent_id": "10-2014-0018713", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "청구항 21에 있어서, 디스플레이 장치 및 입력 장치를 더 포함하고,상기 외부 장치가 상기 외부 포트에 연결되면, 선택 가능한 복수 개의 충전 방식을 상기 디스플레이 장치에 디스플레이 하고,상기 입력 장치를 통해 수신된 사용자 입력에 따라, 상기 복수 개의 충전 방식 중 하나의 충전 방식을 상기 외부 장치에 대한 충전 방식으로 결정하는 것을 특징으로 하는 컴퓨팅 시스템."}
{"patent_id": "10-2014-0018713", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "청구항 25에 있어서,상기 디스플레이 장치와 상기 입력 장치는 하나의 터치 디스플레이 패널로 구현되는 것을 특징으로 하는 컴퓨팅시스템."}
{"patent_id": "10-2014-0018713", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "청구항 21에 있어서,상기 컨트롤러는 상기 충전 방식이 고속 충전 방식으로 결정되는 경우, 상기 외부 장치로 변경된 충전 방식에대한 제어 신호를 전송하고,상기 제어 신호는 상기 외부 장치에서 상기 고속 충전 방식에 따른 배터리 충전을 위한 설정을 위해 이용되는것을 특징으로 하는 컴퓨팅 시스템."}
{"patent_id": "10-2014-0018713", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_28", "content": "컴퓨팅 시스템의 충전 제어 방법에 있어서,상기 컴퓨팅 시스템에 연결된 외부 장치에 대한 충전 방식을 결정하는 동작;상기 충전 방식에 따라 상기 외부 장치를 충전하는 동작;상기 외부 장치의 배터리 잔량의 RSOC를 모니터링 하는 동작; 및상기 RSOC의 변화량에 기반하여 상기 충전 방식을 변경하는 동작을 포함하는 방법.명 세 서기 술 분 야본 발명의 다양한 실시 예들은 컴퓨팅 시스템에서 발생하는 부하에 따라 컴퓨팅 시스템에 연결된 외부 장치의 [0001]충전을 제어하는 기술에 관한 것이다.배 경 기 술랩탑(laptop PC)이나 데스트톱(desktop PC)와 같은 컴퓨팅 시스템은 USB(Universal Serial Bus)나 스마트폰과 [0002]같은 외부 장치와 연결될 수 있는 외부 포트(external port)를 제공한다. 컴퓨팅 시스템은 외부 포트를 통해 연결된 외부 장치와 데이터 교환 및 통신을 할 수 있다.공개특허 10-2015-0097330-5-한편 컴퓨팅 시스템은 외부 포트를 통해 연결된 외부 장치에 대하여 전력을 공급할 수 있다. 일 예로서, 외부 [0003]장치의 배터리는 컴퓨팅 시스템과 연결되어 있는 동안 서서히 충전된다.발명의 내용해결하려는 과제최근 컴퓨팅 시스템과 연결될 수 있는 외부 장치의 배터리 용량과 전력 소모가 급격하게 증가하였다. 예를 [0004]들어, 2010년 출시된 Samsung Galaxy S의 배터리 용량은 1500mAh였는데, 최근 출시된 Samsung Galaxy Note 3의배터리 용량은 3200mAh로 최근 4년간 2배 이상 증가하였다. Samsung Galaxy Note 10.1의 배터리 용량은 약8220mAh로 증가하였다. 이에 따라, 컴퓨팅 시스템을 통한 외부 장치의 충전 시간에 대한 지연이 발생할 수있다. 일반적으로 제조사에서 제공하는 외부 장치(예를 들어, Samsung Galaxy S4)의 전용 어댑터(adaptor)는5V-1A의 충전을 제공한다. 그러나 정격(정품) 충전기가 아닌 컴퓨팅 시스템의 USB 2.0 연결 포트를 통해 외부장치가 충전되는 경우, 500mA의 전류가 공급될 수 있다(USB 3.0의 경우, 900mA의 전류가 공급될 수 있다). 노트북 PC의 USB 연결 포트(예를 들어, USB 2.0)를 통해 방전 상태인 Samsung Galaxy S4의 배터리(용량이 약2600mAh이다)를 충전하는 경우, 약 5시간 30분이 소요될 수 있다. 근래에는 충전 시간을 단축시키기 위하여 강제로 USB 연결 포트를 통한 공급 전류를 증가시키기 위한 장치나 응용프로그램들이 제공되고 있다.그러나 컴퓨팅 시스템도 많은 구성요소(즉, 부하)를 포함하기 때문에, 컴퓨팅 시스템의 시스템 자원을 최대로 [0005]활용하면서 외부 장치에 높은 전력을 공급하기 위해서는 컴퓨팅 시스템에 전력을 제공하는 어댑터(adaptor)의용량을 증가시켜야 하지만, 이는 어댑터의 재료비 상승, 크기 증가 등으로 인하여 제조사와 소비자에게 모두 부담을 줄 수 있다. 또한 기존의 어댑터를 그대로 사용하면서 외부 장치에 높은 전류를 제공하는 경우, 컴퓨팅 시스템이 활용할 수 있는 전력이 충분하지 않아, 컴퓨팅 시스템의 자체 배터리가 방전되거나, 컴퓨팅 시스템이 다운되는 문제점이 발생할 수 있다.따라서, 본 발명의 다양한 실시 예들은, USB 등 외부 포트에 외부 장치가 연결되는 경우, 외부 장치의 전력 소 [0006]모 상태, 컴퓨팅 시스템 및 외부 장치의 부하, 및 어댑터의 용량을 고려하여 효율적으로 충전 상태를 제어하는방법 및 장치를 제공할 수 있다.과제의 해결 수단본 발명의 다양한 실시 예에 따른 컴퓨팅 시스템의 충전 제어 방법은, 상기 컴퓨팅 시스템에 연결된 외부 장치 [0007]에 대한 충전 방식을 결정하는 동작; 상기 충전 방식에 따라 상기 외부 장치를 충전하는 동작; 상기 컴퓨팅 시스템 내부의 전류 및 전압을 모니터링 하는 동작; 및 상기 모니터링 결과에 기반하여 상기 충전 방식을 변경하는 동작을 포함할 수 있다.발명의 효과다양한 실시 예에 따르면, 컴퓨팅 시스템에 연결된 외부 장치의 충전 방식을 사용자의 선택에 따라 결정되도록 [0008]할 수 있다.또한 다양한 실시 예에 따르면, 충전 중 변동하는 전류 또는 전압의 상황에 따라서 충전 방식이 능동적으로 변 [0009]동되도록 하여, 어댑터나 컴퓨팅 시스템에 과부하를 발생시키기 않으면서도 최적의 충전 효율을 제공할 수있다.도면의 간단한 설명도 1은 다양한 실시 예에 따른 어댑터와 외부 장치가 연결된 컴퓨팅 시스템을 나타낸다. [0010]도 2는 다양한 실시 예에 따른 전력 공급의 개념도를 나타낸다.도 3은 다양한 실시 예에 따른 충전 방식 제어를 제공하는 컴퓨팅 시스템 및 외부 장치의 개념도를 나타낸다.도 4는 다양한 실시 예에 따른 제어 회로의 구현 예시를 나타낸다.도 5는 다양한 실시 예에 따른 각각의 회로에서 발생하는 알림 신호의 타이밍 관계를 나타낸다.도 6은 다양한 실시 예에 따른 외부 장치의 충전 방식을 변경하는 프로세스를 나타낸다.공개특허 10-2015-0097330-6-도 7은 다양한 실시 예에 따른 외부 장치의 충전 방식을 변경하는 예시적인 프로세스의 일부를 나타낸다.도 8은 도 7에 도시된 프로세스의 후속 프로세스를 나타낸다.도 9는 다양한 실시 예에 따른 사용자 입력에 기반한 충전 방식이 결정되는 프로세스를 나타낸다.도 10은 외부 장치의 충전 중 사용자 입력에 의해 충전 방식이 변경되는 프로세스를 나타낸다.도 11은 다양한 실시 예에 따른 외부 장치의 충전 방식을 제어하는 일반적인 프로세스의 일부를 나타낸다.도 12는 도 11에 도시된 프로세스의 후속 프로세스를 나타낸다.도 13은 다양한 실시 예들에 따른 전자 장치의 블록도를 도시한다.발명을 실시하기 위한 구체적인 내용이하, 본 발명의 다양한 실시 예가 첨부된 도면과 연관되어 기재된다. 본 발명의 다양한 실시 예는 다양한 변경 [0011]을 가할 수 있고 여러 가지 실시 예를 가질 수 있는바, 특정 실시 예들이 도면에 예시되고 관련된 상세한 설명이 기재되어 있다. 그러나 이는 본 발명의 다양한 실시 예를 특정한 실시 형태에 대해 한정하려는 것이 아니며,본 발명의 다양한 실시 예의 사상 및 기술 범위에 포함되는 모든 변경 및/또는 균등물 내지 대체물을 포함하는것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유사한 참조 부호가사용되었다.본 발명의 다양한 실시 예 가운데 사용될 수 있는 \"포함한다.\" 또는 \"포함할 수 있다.\" 등의 표현은 개시된 해 [0012]당 기능, 동작 또는 구성요소 등의 존재를 가리키며, 추가적인 하나 이상의 기능, 동작 또는 구성요소 등을 제한하지 않는다. 또한 본 발명의 다양한 실시 예에서, \"포함하다.\" 또는 \"가지다.\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 발명의 다양한 실시 예에서 \"또는\" 등의 표현은 함께 나열된 단어들의 어떠한, 그리고 모든 조합을 [0013]포함한다. 예를 들어, \"A 또는 B\"는, A를 포함할 수도, B를 포함할 수도, 또는 A와 B 모두를 포함할 수도 있다.본 발명의 다양한 실시 예 가운데 \"제1\", \"제2\", \"첫째\", 또는 \"둘째\" 등의 표현들이 본 발명의 다양한 실시 예 [0014]의 다양한 구성요소들을 수식할 수 있지만, 해당 구성요소들을 한정하지 않는다. 예를 들어, 상기 표현들은 해당 구성요소들의 순서 및/또는 중요도 등을 한정하지 않는다. 상기 표현들은 한 구성요소를 다른 구성요소와 구분 짓기 위해 사용될 수 있다. 예를 들어, 제1 사용자 기기와 제2 사용자 기기는 모두 사용자 기기이며, 서로다른 사용자 기기를 나타낸다. 예를 들어, 본 발명의 다양한 실시 예의 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다.어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 [0015]직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해될 수 있어야 할 것이다.본 발명의 다양한 실시 예에서 사용한 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 본 발명의 [0016]다양한 실시 예를 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의표현을 포함한다.다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명의 [0017]다양한 실시 예가 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥 상 가지는의미와 일치하는 의미를 가지는 것으로 해석되어야 하며, 본 발명의 다양한 실시 예에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다.본 발명의 다양한 실시 예에 따른 전자 장치는, 통신 기능이 포함된 장치일 수 있다. 예를 들면, 전자 장치는 [0018]스마트 폰(smartphone), 태블릿 PC(tablet personal computer), 이동 전화기(mobile phone), 화상전화기, 전자북 리더기(e-book reader), 데스크톱 PC(desktop personal computer), 랩탑 PC(laptop personal computer), 넷북 컴퓨터(netbook computer), PDA(personal digital assistant), PMP(portable multimedia player), MP3 플공개특허 10-2015-0097330-7-레이어, 모바일 의료기기, 카메라(camera), 또는 웨어러블 장치(wearable device)(예: 전자 안경과 같은 head-mounted-device(HMD), 전자 의복, 전자 팔찌, 전자 목걸이, 전자 앱세서리(appcessory), 전자 문신, 또는 스마트 와치(smartwatch))중 적어도 하나를 포함할 수 있다.어떤 실시 예들에 따르면, 전자 장치는 통신 기능을 갖춘 스마트 가전 제품(smart home appliance)일 수 있다. [0019]스마트 가전 제품은, 예를 들자면, 전자 장치는 텔레비전, DVD(digital video disk) 플레이어, 오디오, 냉장고,에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스(set-top box), TV 박스(예를 들면, 삼성HomeSyncTM, 애플TVTM, 또는 구글 TVTM), 게임 콘솔(game consoles), 전자 사전, 전자 키, 캠코더(camcorder),또는 전자 액자 중 적어도 하나를 포함할 수 있다.어떤 실시 예들에 따르면, 전자 장치는 각종 의료기기(예: MRA(magnetic resonance angiography), [0020]MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 초음파기 등), 네비게이션(navigation)장치, GPS 수신기(global positioning system receiver), EDR(event data recorder), FDR(flight datarecorder), 자동차 인포테인먼트(infotainment) 장치, 선박용 전자 장비(예: 선박용 항법 장치 및 자이로 콤파스 등), 항공 전자기기(avionics), 보안 기기, 차량용 헤드 유닛, 산업용 또는 가정용 로봇, 금융 기관의ATM(automatic teller뭩 machine) 또는 상점의 POS(point of sales) 중 적어도 하나를 포함할 수 있다.어떤 실시 예들에 따르면, 전자 장치는 통신 기능을 포함한 가구(furniture) 또는 건물/구조물의 일부, 전자 보 [0021]드(electronic board), 전자 사인 입력장치(electronic signature receiving device), 프로젝터(projector),또는 각종 계측기기(예: 수도, 전기, 가스, 또는 전파 계측 기기 등) 중 적어도 하나를 포함할 수 있다. 본 발명의 다양한 실시 예에 따른 전자 장치는 전술한 다양한 장치들 중 하나 또는 그 이상의 조합일 수 있다. 또한,본 개세에 따른 전자 장치는 플렉서블 장치일 수 있다. 또한, 본 발명의 다양한 실시 예에 따른 전자 장치는 전술한 기기들에 한정되지 않음은 당업자에게 자명하다.이하, 첨부된 도면을 참조하여 다양한 실시 예에 따른 전자 장치에 대해서 살펴본다. 다양한 실시 예에서 이용 [0022]되는 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공지능 전자 장치)를 지칭할 수 있다.도 1은 다양한 실시 예에 따른 어댑터와 외부 장치가 연결된 컴퓨팅 시스템을 나타낸다. [0023]본 명세서에서 컴퓨팅 시스템(computing system) 200이라 함은, 어댑터 100을 통해 전력을 공급 받으면서, 동시 [0024]에 외부 포트를 포함하고, 외부 포트에 외부 장치가 연결될 수 있는 다양한 형태의 전자 장치를 포함한다. 예를들어, 컴퓨팅 시스템 200은 노트북 PC나 데스크톱 PC(desktop PC), 넷북(netbook PC), 또는 아이맥(iMac)이나올인원 PC(all-in-one PC)의 실시 형태를 포함한다.본 명세서에서 외부 장치(external device) 300이라 함은, 컴퓨팅 시스템 200의 외부 포트와 연결되고 컴퓨팅 [0025]시스템 200에 의해 전력을 공급받는 전자 장치를 포함한다. 일반적으로 외부 장치 300은 독립된 전자 장치(stand-alone device)이지만, 그에 한정되는 것은 아니다. 외부 장치 300은 삼성 갤럭시 S 시리즈와 같은 스마트폰, 삼성 갤럭시 탭, 노트 10.1과 같은 태블릿, 또는 갤럭시 노트와 같은 다양한 전자 장치일 수 있다. 또한외부 장치 300은 갤럭시 카메라, 또는 일반 디지털 카메라일 수 있다. 다양한 실시 예에서, 외부 장치 300은USB 저장장치, 외장 하드 디스크, 카드 리더기일 수 있다. 다양한 실시 예에서, 외부 장치 300은 컴퓨팅 시스템200과 동종의 장치일 수 있다. 예를 들어, 컴퓨팅 시스템 200이 랩탑 PC이고, 외부 장치 300 역시 상기 랩탑 PC의 외부 포트에 연결된 다른 랩탑 PC일 수 있다. 또는 컴퓨팅 시스템 200이 어댑터와 연결 가능하고 외부 포트가 제공되는 형태의 스마트폰 또는 태블릿이고, 외부 장치 300 역시 동종의 다른 스마트폰 또는 태블릿일 수 있다. 본 명세서에서, 컴퓨팅 시스템 200과 외부 장치 300은 모두 전자 장치로 표기되거나 이해될 수 있다.도 1에는 컴퓨팅 시스템 200이 어댑터 100 및 외부 장치 300과 유선으로 연결되는 것으로 도시되었으나, 어댑터 [0026]100, 컴퓨팅 시스템 200, 및 외부 장치 300 사이의 연결은 유선 또는 무선 연결을 통해 구현될 수 있다. 예를들어, 컴퓨팅 시스템 200은 외부 장치 300에 공진 유도방식 또는 자기 유도방식과 같은 무선 충전 방식을 이용하여 전력을 공급할 수 있다. 후술하는 실시 예들은 유선 충전 및 그와 관련된 회로를 중심으로 설명되지만, 컴퓨팅 시스템 200에서 외부 장치 300으로 전력을 제공하는 구성에 대응되는 설명은 당업자 수준에서 무선 충전방식으로 대체될 수 있다.다시 도 1을 참조하면, 어댑터 100은 컴퓨팅 시스템 200에 전력을 공급한다. 도시하지 않았지만, 어댑터 100은 [0027]상시 공급 전원(예를 들어, 가정이나 회사, 공공장소에서 제공되는 AC 전원)과 연결될 수 있다. 어댑터 100은공개특허 10-2015-0097330-8-상시 공급 전원을 컴퓨팅 시스템 200에 적합한 형태의 규격으로 변환하여 컴퓨팅 시스템 200에 전력을 공급할수 있다. 예를 들어, 컴퓨팅 시스템 200이 Samsung ATIV Book 9 series인 경우, 어댑터 100은 40W의 정격 용량을 제공할 수 있다.컴퓨팅 시스템 200은 어댑터 100을 통해 공급받은 전력을 이용하여 컴퓨팅 시스템 200을 구동할 수 있다. 컴퓨 [0028]팅 시스템 200은 자체 배터리를 포함할 수 있다. 컴퓨팅 시스템 200은 공급받은 전력을 이용하여 컴퓨팅 시스템200에 포함된 다양한 부하(예를 들어, 프로세서, 메모리, 저장 장치, 디스플레이 장치(예를 들어, LED 또는AMOLED 디스플레이 장치), 그래픽 프로세서, 스피커, 내장 마이크, 웹 카메라, 네트워크 모듈(예를 들어,802.11 bg/n, 블루투스 4.0, 이더넷 모듈 등) 등)에 공급되고 남은 전력을 자체 배터리를 충전하기 위해 사용할수 있다. 다양한 실시 예에서, 컴퓨팅 시스템 200은 외부 포트에 연결된 외부 장치 300에 전력을 공급하고 여유전력이 남아 있는 경우, 자체 배터리를 충전할 수 있다.도 2는 다양한 실시 예에 따른 전력 공급의 개념도를 나타낸다. [0029]도 2를 참조하면, 어댑터 100으로부터 컴퓨팅 시스템 200으로 전력이 공급된다. 이 전력은 컴퓨팅 시스템 200을 [0030]구동할 때 발생하는 시스템 부하 220에 일부 공급되고, 여유 전력은 컴퓨팅 시스템 200의 자체 배터리 230을 충전하기 위해 사용될 수 있다. 만약 외부 포트 240을 통해 외부 장치 300이 연결되어 있는 경우, 외부 장치 300을 구동하거나, 외부 장치 300 내부에 탑재된 배터리를 충전하기 위해 전력이 공급될 수 있다. 다양한 실시 예에서, 컴퓨팅 시스템 200은 크게 3종류로 전력을 분배할 수 있다. 하나는 컴퓨팅 시스템 200을 구동하기 위한시스템 부하 220에 공급되는 전력이며, 다른 하나는 컴퓨팅 시스템 200의 내장 배터리 230을 충전하기 위한 전력이고, 마지막은 외부 장치 300으로 제공되는 전력이다. 컨트롤러 210은 컴퓨팅 시스템 200 또는 외부 장치300에 따라 전력 배분을 조절할 수 있다. 예를 들어, 컴퓨팅 시스템 200의 구동에 문제가 생기거나 컴퓨팅 시스템 200이 다운되는 현상을 방지하기 위하여 컨트롤러 210은 시스템 부하 220에 전력을 최우선으로 배분할 수 있다. 여유 전력이 있는 경우, 외부 장치 300으로 공급할 수 있다. 외부 장치 300으로 공급되는 전력은 다시 외부장치 300을 구동하기 위한 전력과 외부 장치 300의 배터리를 충전하기 위한 전력으로 구분될 수 있다. 컨트롤러210은 외부 장치 300을 구동하기 위한 전력을 외부 장치 300의 배터리를 충전하기 위한 전력보다 우선하여 공급할 수 있다. 일부 실시 예에서, 컨트롤러 210(또는 컴퓨팅 시스템 200)은 외부 장치 300에서의 전력 사용 우선순위를 제어할 수 없기 때문에, 컨트롤러 210은 외부 장치 300의 컨트롤러 또는 제어부(예를 들어, AP)로 공급되는 전력을 외부 장치 300을 구동하기 위한 전력으로 우선 사용하라는 제어 신호를 제공할 수 있다. 외부 장치300은 이 제어 신호에 따라, 공급된 전력을 배터리 충전 대신 외부 장치 300의 구동을 위해 사용할 수 있다. 만약 컨트롤러 210에서 외부 장치 300의 구동보다 외부 장치 300의 배터리 충전을 수행하라는 제어 신호를 제공하는 경우, 외부 장치 300은 외부 장치 300에 포함된 다양한 구성 요소(예를 들어, AP, 각종 센서 및 모듈)를 비활성화 또는 슬립(sleep) 상태로 전환하고, 배터리 충전에 집중할 수 있다. 그러나 일부 다른 실시 예에서, 컨트롤러 210(또는 컴퓨팅 시스템 200)이 외부 장치 300에서의 전력 사용 우선 순위를 직접 제어할 수 있는 경우,컨트롤러 210(또는 컴퓨팅 시스템 200)은 외부 장치 300으로 제공되는 전원의 공급 경로를 직접 제어할 수있다.다양한 실시 예에서, 컨트롤러 210은 외부 장치 300이 연결되었을 때 발생할 수 있는 다양한 상황에 따라서 전 [0031]력 공급을 제어할 수 있다. 외부 장치 300은 복수 개의 충전 상태를 지원할 수 있다. 예를 들어, 외부 장치 300은 고속 충전 모드, 일반 충전 모드, 및 저속 충전 모드를 지원할 수 있다. 다른 실시 예에서, 외부 장치는 다양한 충전 단계를 제공할 수 있다. 예를 들어, 외부 장치 300의 구동에만 필요한 최소 전력을 공급받고 외부 장치 300의 배터리를 충전하지 않는 1단계부터, 외부 장치 300의 동작을 최소화하고 배터리의 충전을 극대화하는5단계에 해당하는 충전 단계를 제공할 수 있다. 이 경우, 제공되는 전력 또는 전류의 양에 따라 2, 3, 4단계의중간 단계가 존재할 수 있다. 전술한 예시(고속/일반/저속 충전 모드)의 경우, 총 3단계의 충전 단계가 있는 것으로 이해될 수 있다.다양한 실시 예에서, 컨트롤러 210은 컴퓨팅 시스템 200 또는 외부 장치 300의 상태에 따라 충전 방식을 결정할 [0032]수 있다. 컨트롤러 210은 외부 장치 300이 컴퓨팅 시스템 200의 외부 포트에 연결되거나, 미리 연결되어 있던외부 장치 300이 활성화(예를 들어, 전원 ON, 스크린 ON, 또는 잠금 해제)되거나, 또는 기능 키(function key)나 충전 명령을 통해 외부 장치 300의 충전이 시작되는 상황에 있어서, 현재 외부 장치 300에 공급 가능한 전력량을 판단하여 충전 방식을 결정할 수 있다. 일부 실시 예에서, 컴퓨팅 시스템 200은 외부 장치 300이 연결(또는 기타 충전이 시작되는 상황이 발생)되면, 충전 방식을 결정하기 위한 화면을 컴퓨팅 시스템 200의 스크린에디스플레이 할 수 있다. 예를 들어 컴퓨팅 시스템 200은 고속 충전 모드 또는 일반 충전 모드 중 하나를 선택할수 있는 메뉴 화면을 디스플레이 할 수 있다. 사용자로부터 복수 개의 충전 모드 중 하나의 모드를 선택하는 사공개특허 10-2015-0097330-9-용자 입력이 수신되면, 컴퓨팅 시스템 200은 사용자에 의해 선택된 충전 모드를 외부 장치 300의 충전 방식으로결정할 수 있다.다양한 실시 예에서, 컨트롤러 210은 결정된 충전 방식에 따라서 외부 장치 300에 전력을 공급할 수 있다. 그러 [0033]나 외부 장치 300에 대한 충전이 이루어지는 동안, 초기에 결정된 충전 방식을 계속해서 유지하는 것은 바람직하지 않을 수 있다. 예를 들어, 초기에 결정된 충전 방식은 고속 충전인데, 컴퓨팅 시스템 200에서 시스템 자원(system resources)을 많이 사용하는(시스템에 많은 부하를 발생시키는) 작업(예를 들어, 그래픽 작업, 동영상인코딩 작업, 대용량 파일 전송 등)을 수행하는 경우, 시스템 부하 220에 공급되는 전력이 부족하게 될 수있다. 이와 같은 상황에서, 컨트롤러 210은 배터리 230에 저장된 전력을 소모하도록 할 수도 있지만, 극단적인경우, 시스템 부하 220에 공급되는 전력 부족으로 인하여 수행중인 작업에 문제가 생기거나, 시스템 다운이 발생할 수 있다. 따라서 이러한 경우, 컨트롤러 210은 외부 장치 300에 제공되는 충전 방식을 고속 충전 방식에서하위 방식(예를 들어, 일반 충전 방식, 또는 저속 충전 방식)으로 변경할 수 있다.다양한 실시 예에서, 컴퓨팅 시스템 200에서 시스템 자원을 많이 사용하고 있거나, 컴퓨팅 시스템 200의 배터리 [0034]230의 잔량이 거의 없는 상태에서, 컨트롤러 210은 외부 장치 300에 대한 충전 방식을, 예를 들어 저속 충전 모드로 결정할 수 있다. 그러나 시스템 부하 220에 많은 전력이 요구되는 상황이 해제(예를 들어, 다수의 태스크(task)의 종료 등)되거나, 컴퓨팅 시스템 200의 배터리 230의 충전이 완료 또는 일정 기준 이상에 도달한 경우,외부 장치 300으로 제공될 수 있는 전력에 여유가 생길 수 있다. 이와 같은 상황에서, 컨트롤러 210은 충전 방식을 상위 방식(예를 들어, 일반 충전 방식, 또는 고속 충전 방식)으로 변경할 수 있다.다양한 실시 예에서, 컴퓨팅 시스템 200은 외부 장치 300으로 공급되는 충전 전력을 보장하기 위한 조치를 취할 [0035]수 있다. 예를 들어, 컴퓨팅 시스템 200은 자체 배터리 230을 충전하기 위한 충전 전류를 조절(예를 들어, 배터리 230의 충전 전류를 감소시키거나 차단)하여 외부 장치 300으로 충분한 충전 전류가 공급되도록 할 수 있다.일부 실시 예에서, 컴퓨팅 시스템 200은 어댑터 100에 의해 제공되는 전력과, 배터리 230에 의해 제공되는 전력을 합하여 외부 장치 300으로 제공할 수 있다. 또는 컴퓨팅 시스템 200은 어댑터 100에 의해 제공되는 전력 중일정 전력 이상을 외부 장치 300으로 제공하면서, 동시에 시스템 200이 정상적으로 동작하도록 하기 위해 배터리 230에 저장된 전력을 사용할 수 있다. 이 경우, 배터리 230은, 컴퓨팅 시스템 200이 어댑터 100에 연결되어있음에도 불구하고, 서서히 방전될 수 있다.도 3은 다양한 실시 예에 따른 충전 방식 제어를 제공하는 컴퓨팅 시스템 및 외부 장치의 개념도를 나타낸다. [0036]도 3에서, 전력의 흐름은 굵은 실선으로, 제어 신호의 흐름은 점선으로 나타내었다.도 3을 참조하면, 컴퓨팅 시스템 200은 컨트롤러 210, 시스템 부하 220, 배터리 230, 외부 포트 240, 외부 포트 [0037]스위치 250, 디스플레이 260, 입력 장치 270, 입력 전류 모니터링부 211, 시스템 전압 모니터링부 213, 트리거(trigger) 회로부 215, 충전부(charger) 217, 및 외부 포트 전류 제한 IC 219를 포함할 수 있다. 또한 도시하지는 않았지만, 컴퓨팅 시스템은 외부 포트 스위치(switch, SW) 250 전단에 위치한 전압 레귤레이터(예를 들어,5V VR(voltage regulator))를 더 포함할 수 있다.또한, 외부 장치 300은 컨트롤러 310, 충전부 320, 및 배터리 330을 포함할 수 있다. 도시하지는 않았지만, 외 [0038]부 장치 300은 외부 장치 300을 구동하는 프로세서(예를 들어, AP), 메모리, 디스플레이, 각종 센서 및 모듈을더 포함할 수 있다.컨트롤러 210은 트리거 회로부 215로부터 입력 전류 모니터링부 211 및/또는 시스템 전압 모니터링부 213에 의 [0039]한 모니터링 결과에 기반한 트리거 신호를 수신할 수 있다. 또한 컨트롤러 210은 적어도 트리거 신호에 기반하여 충전부 217, 외부 포트 전류 제한 IC 219, 외부 포트 SW 250, 디스플레이 260, 입력 장치 270으로 제어 신호를 제공할 수 있다. 도 3에 명시되지는 않았으나, 컨트롤러 210은 모니터링 상태에 따라 시스템 부하 220 중 적어도 일부를 비활성화 하거나 활성화 하기 위해 제어 신호를 제공할 수도 있다. 컨트롤러 210은 트리거 신호와관계없이 컴퓨팅 시스템 200의 동작을 제어할 수 있다. 설명의 편의를 위하여 컨트롤러 210의 제어 신호 흐름은일방향(→)으로 표시하였으나, 필요에 따라 제어 신호는 양방향(↔)으로 제공될 수 있다. 또한 컨트롤러 210은내부에 보호 알람 신호(protection alarm signal)를 생성하기 위한 회로를 포함할 수 있다. 이와 관련해서 도 4를 참조하여 후술한다.시스템 부하 220은, 전술한 바와 같이 컴퓨팅 시스템 200을 구동할 때 발생하는 부하, 즉 구성요소를 의미한다. [0040]컴퓨팅 시스템 200은 각종 구성요소(components)를 포함하고, 각각의 구성요소는 동작하기 위해서 전력의 공급을 필요로 할 수 있다. 시스템 부하 220은 컴퓨팅 시스템 200이 동작하기 위해 각 구성요소에 공급되는 부하의공개특허 10-2015-0097330-10-총 합을 의미할 수 있다. 다양한 실시 예에서, 컴퓨팅 시스템 200에 포함되지만, 비활성화 또는 슬립 상태인 구성요소는 시스템 부하 220에 포함되지 않을 수 있다. 예를 들어, 외부 그래픽 카드가 장착된 경우, 시스템에 포함된 자체 GPU는 비활성화 상태이며, 따라서 전원 공급이 불필요하기 때문에 시스템 부하 220에 포함되지 않을수 있다. 일부 실시 예에서, 디스플레이 260이 OFF 되는 경우, 디스플레이에는 전력이 공급되지 않고, 따라서디스플레이 260은 시스템 부하 220에서 제외될 수 있다. 즉, 시스템 부하 220은 가변적일 수 있다. 본 명세서에 설명되는 내용에 있어서, 시스템 부하 220은 컴퓨팅 시스템 200의 배터리를 충전하기 위해 동작하 [0041]는 구성요소(예를 들어, 충전부 217 및 배터리 230)와 외부 장치 300으로 전력을 공급하기 위해 사용되는 구성요소(예를 들어, 외부 포트 240, 외부 장치 300의 구성요소)를 포함하지 않을 수 있다. 또한 도 3에는 시스템부하와 별개로 컨트롤러 210, 디스플레이 260, 입력 장치 270 등이 도시되었으나, 전술한 설명의 관점에서, 이와 같은 구성요소들도 시스템 부하 220에 포함되는 것으로 이해될 수 있다. 특히, 시스템 부하 220에 공급되는전력 또는 시스템 부하 220에 걸리는 전압을 판단함에 있어서, 별개로 도시된 구성요소들의 영향이 함께 고려될수 있다.배터리 230과 외부 포트 240에 대해서는 도 2에 전술한 바 있으므로 생략한다. [0042]외부 포트 스위치 250은 외부 포트 240에 전원을 연결할지 여부를 결정하는 스위치 역할을 수행할 수 있다. 예 [0043]를 들어, 외부 포트 스위치 250 전단에 5V VR이 위치하는 경우, 외부 포트 스위치 250은 외부 포트 240을 통해외부 장치 300에 5V의 전원을 연결할 것인지 여부를 결정할 수 있다. 외부 포트 스위치 250은 외부 장치 300이연결되면 자동으로 스위치 ON 될 수 있다 즉, 컴퓨팅 시스템 200에 외부 장치 300이 연결되면, 컨트롤러 210은외부 장치 300에 전원을 인가할 것을 결정하고, 외부 포트 스위치 250으로 외부 포트 스위치 인에이블(enable)신호를 제공할 수 있다. 하이(high) 신호가 인가되면, 외부 포트 스위치 250은 스위치 ON 할 수 있다. 로우(low) 신호가 인가되면, 외부 포트 스위치 250은 스위치를 OFF(즉, 전원 공급 중단)할 수 있다. 외부 포트 스위치 250은 컴퓨팅 시스템 200에 탑재된 소프트웨어에 의해 제어될 수 있다.디스플레이 260은 외부 장치 300이 연결되었을 때, 연결된 외부 장치 300과 관련된 정보(모델 명, 제조사, 지원 [0044]기능, 배터리 용량, 현재의 배터리 충전 방식 등)와 외부 장치 300의 배터리 충전 방식을 선택하기 위한 화면이제공할 수 있다. 디스플레이 260은 터치 패널을 구비한 디스플레이 일 수 있고, 이 경우, 사용자의 터치 입력을수신할 수 있다. 또한, 다양한 실시 예에서, 디스플레이 260은 입력 장치 270과 통합되어 구현될 수 있다.입력 장치 270은 사용자 입력을 수신할 수 있다. 예를 들어, 입력 장치 270은 키보드 또는 마우스를 포함할 수 [0045]있다. 입력 장치 270은 디스플레이 260에 제공되는 사용자 선택 메뉴에 대한 사용자 입력을 수신할 수 있다. 입력 장치 270에 의해 제공되는 전원 스위치(power on switch) 또는 기능 키(function key)에 의해 외부 장치300의 충전 방식 선택 창 또는 선택 메뉴가 디스플레이 260에 제공될 수 있다.입력 전류 모니터링부 211은 어댑터 100으로부터 제공되는 입력 전류를 모니터링 할 수 있다. 이 입력 전류는 [0046]컴퓨팅 시스템 200 및 외부 장치 300으로 공급되는 전류의 총 합에 해당할 수 있다. 만약 외부 장치 300에서 급격하게 고속 충전 모드로 변경되거나, 시스템 부하 220이 급격하게 감소하는 경우, 입력 전류가 증가할 수있고, 순간적으로 안전 기준 또는 어댑터 100이나 컴퓨팅 시스템 200에서 제공하는 기준 값 이상으로 증가할 수있다. 입력 전류 모니터링부 211은 이와 같이 컴퓨팅 시스템 200에 제공되는 입력 전류를 모니터링 하여 모니터링 결과를 트리거 회로부 215로 제공할 수 있다. 입력 전류 모니터링부 211은 입력 전류를 전압으로 변환하여모니터링 결과를 트리거 회로부 215로 제공할 수 있다. 일부 실시 예에서, 입력 전류를 전압으로 변환하는 과정은 트리거 회로부 215에서 수행될 수도 있다. 이와 관련하여 도 4를 참조하여 후술한다.시스템 전압 모니터링부 213은 컴퓨팅 시스템 200을 구동하기 위해 시스템 부하 220에 걸리는 전압(Vsys)을 모니 [0047]터링 할 수 있다. 급변하는 시스템 부하 220에 의해 입력 전류(또는 입력 전류의 전압 변환)는 임계 값 근처에서 지나친 반복 펄스(pulse)를 발생시킬 수 있고, 이에 대응하는 출력은 감지 시스템을 적용하는데 어려움으로작용될 수 있다. 따라서, 시스템 전압(또는 어댑터 전압)을 감지하여 시스템 부하 변동에 의한 전압 변동이 기준 전압(Vth) 이하로 발생하는 경우, 동일한 어댑터 제한 알람 신호가 발생되도록 할 수 있다.트리거 회로부 215는 입력 전류 모니터링부 211 및 시스템 전압 모니터링부 213으로부터 제공된 신호에 기반하 [0048]여 트리거 신호를 생성하여 컨트롤러 210으로 제공할 수 있다. 컨트롤러 210은 이 트리거 신호를 기반으로 각종제어 신호를 생성하여 충전부 217, 외부 포트 전류 제한 IC 219, 외부 포트 SW 250, 디스플레이 260, 입력 장치270으로 제공할 수 있다공개특허 10-2015-0097330-11-충전부(charger) 217은 컨트롤러 210로부터 배터리 230에 충전을 하도록 하는 제어 신호를 수신하면 배터리 230 [0049]에 충전을 시작할 수 있다. 일부 실시 예에서, 충전부 217은 시스템 부하 220 및 외부 장치 300에 제공하고 남는 전력이 있는 경우, 자동으로 배터리 230의 충전을 시작할 수 잇다.외부 포트 전류 제한 IC 219는 외부 포트 240과 연결된 외부 장치 300 사이의 통신(signal)을 통해 외부 장치 [0050]300의 종류를 인식하고 충전 및 통신 여부 등 요구되는 충전 방식(예를 들어, 충전 허용 전류 레벨, 통신 여부등)을 감지하고 설정할 수 있다. 외부 포트 전류 제한 IC 219는 컨트롤러 210으로부터 제공된 제어 신호에 기반하여 외부 장치 300으로 제공되는 전류 또는 외부 장치 300의 통신을 제한하기 위한 신호를 외부 장치 300(또는외부 장치 300의 컨트롤러 310)으로 제공할 수 있다. 이러한 관점에서, 외부 포트 전류 제한 IC 219는 외부 포트 전류/통신 제한 IC 219로 이해될 수 있다. 예를 들어, 디스플레이 260에 제공된 충전 방식 선택 메뉴에서 사용자가 고속 충전 모드(FAST mode)의 충전 방식을 선택한 경우, 외부 포트 전류 제한 IC 219는 컨트롤러 310으로 외부 장치 300을 고속 충전에 적합한 상태로 동작하도록 지시하는 제어 신호를 제공할 수 있다. 예를 들어,컨트롤러 310은 컴퓨팅 시스템 200과 외부 장치 300 사이의 데이터 통신(및 외부 장치 300과 다른 외부 장치 또는 서버와 연결되는 통신)을 중단시키고, 외부 장치 300의 최소 기능만 활성화한 후 고속 충전이 시작되도록 할수 있다. 전술한 동작 중 일부 동작(예를 들어, 데이터 통신 중단)은 컴퓨팅 시스템 200(또는 컨트롤러 210)에의해서 수행될 수도 있다.외부 장치 300은 외부 포트 240을 통해 컴퓨팅 시스템 200과 연결될 수 있다. 외부 장치 300의 컨트롤러 310은 [0051]컴퓨팅 시스템 200으로부터 제공된 제어 신호에 따라 충전을 위한 외부 장치 300의 설정을 조절할 수 있다. 예를 들어, 고속 충전 모드로 충전하는 경우, 데이터 통신을 제한하거나, 외부 장치 300의 AP를 슬립(sleep) 상태로 전환할 수 있다. 외부 장치 300이 저속 모드로 충전되는 경우, 컨트롤러는 공급 전력의 대부분을 외부 장치300을 구동하기 위해 사용되도록 할 수 있다. 충전부 320는 각각의 경우에 공급되는 전력을 배터리 330으로 제공하여, 배터리 330이 충전되도록 할 수 있다.도 4는 다양한 실시 예에 따른 제어 회로의 구현 예시를 나타낸다. [0052]도 4는 도 3에 도시된 입력 전류 모니터링부 211, 시스템 전압 모니터링부 213, 트리거 회로부 215, 및 컨트롤 [0053]러 210을 포함하는 제어 회로일 수 있다. 예를 들어, 회로 410은 입력 전류 모니터링부 211에, 회로 430은 시스템 전압 모니터링부 213에, 회로 420 및 440은 트리거 회로부 215에 각각 대응될 수 있다. 회로 410은 입력 전류를 전압으로 변환할 수 있다.다시 도 4를 참조하면, 회로 410에서, 일단은 어댑터 100과 연결되고, 타단은 시스템 전압과 연결되는 위치에 [0054]감지 저항 Rsense가 위치할 수 있다. 회로 410은 감지 저항을 이용하여 회로 410은 어댑터로부터 입력되는 입력전류를 감지하고, 이를 전압으로 변환하여 Vin_curr로 출력할 수 있다. 회로 420에서 출력 전압 Vin_curr이 임계(threshold) 전압 Vth을 초과하는지 판단될 수 있다. 판단 결과가 OR 게이트(OR gate, 논리합 게이트) A로 제공될 수 있다.회로 430은 시스템 전압 Vsys가 기준 전압 이하인지 판단할 수 있다. 시스템 전압 Vsys가 기준 전압 이하인 경우, [0055]컴퓨팅 시스템 200이 정상적으로 작동하지 않을 수 있기 때문에, 이에 대한 알림이 요구된다. 회로 430에서 판단된 결과, 예를 들어 Low Vsys alarm signal이 OR 게이트 A로 제공될 수 있다. 즉, 다양한 실시 예에 따른 제어회로는 입력 전류(어댑터 전류)와 입력 전압(시스템 전압)의 병렬 구성을 통해, 어댑터 용량이 초과되는지 여부를 정확하게 확인하는 구조를 가질 수 있다.회로 440(트리거 회로부 440)은 OR 게이트 A로 제공된 신호에 기초하여 트리거를 발생시킬 수 있다. 상기 트리 [0056]거는 전압 또는 전류 값이 어댑터 100의 제한 값에 도달하였다는 것을 나타내는 어댑터 제한 알람 신호(adaptorlimit alarm signal)일 수 있다.어댑터 제한 알람 신호는 OR 게이트 A로 알림 신호가 제공될 때마다 발생할 수도 있지만, 일부 실시 예에서는 [0057]딜레이를 가지고 제공될 수 있다. 예를 들어, 회로 440에 포함된 R, L, C 소자(회로 440에는 R 및 C 소자만 도시됨)를 이용하여 지연 시간을 조절할 수 있다. 예를 들어, 지연 시간이 t1인 경우, 어댑터 제한 알람 신호가발생하고 시간 t1이 경과하기 이전에 OR 게이트 A로 임계 전류 또는 기준 전압에 해당하는 신호가 제공되더라도,트리거 회로부 440은 어댑터 제한 알람 신호를 발생시키지 않을 수 있다. 이와 같은 딜레이를 통해 짧은 시간내에 상대적으로 많은 알림 신호가 발생하여, 외부 장치 300의 충전 방식이 계속해서 바뀌는 상황(예를 들어,공개특허 10-2015-0097330-12-일반 충전 모드에서 고속 충전 모드로 변경하자마자 다시 일반 충전 모드로 변경되거나, 혹은 그 반대의 상황의반복)을 방지할 수 있다.컨트롤러 210은 내부에 보호 알람 신호(protection alarm signal)를 생성하기 위한 회로 450을 포함할 수 있다. [0058]회로 450은 예를 들어, 기준 시간(예를 들어, t2) 이내에 어댑터 제한 알람 신호가 미리 정해진 횟수 이상 발생하면 보호 알람 신호를 생성할 수 있다. 이는 회로 내부에서는 순간적인 전압 또는 전류 이상이 발생할 수 있고(예를 들어, 스위치 ON/OFF나 외부 장치 300의 연결 또는 연결 해제시 발생하는 유도 기전력, 유도 전류의 현상등) 한번 또는 소수의 어댑터 제한 알람 신호에 의해 충전 방식을 변경하는 것이 적절하지 않을 수 있기 때문이다. 따라서 어댑터 제한 알람 신호의 발생 주기 또는 발생 횟수가 컴퓨팅 시스템 200의 상황에 따라 미리 정의된 조건을 만족하는 경우, 회로 450은 보호 알람 신호를 생성할 수 있고, 컨트롤러 210은 이 보호 알람 신호에따라 충전 방식이 변경되도록 할 수 있다. 다양한 실시 예에서, 컨트롤러 210은 보호 알람 신호가 발생하면 충전 방식을 현재의 단계보다 한 단계 하위 단계로 조정할 수 있다. 그러나 일부 실시 예에서 컨트롤러 210은 보호 알람 신호에 따라 충전 방식을 임의의 하위 단계로 조정할 수 있다.다양한 실시 예에 따른 제어 회로는 전압 누적 비교기를 포함할 수 있다. 전압 누적 비교기는 입력 전류(입력 [0059]전류의 변환 전압), 어댑터 제한 알람 신호, 또는 OR 게이트 A에서의 전압 레벨을 누적하여, 특정 전압 이상이발생하는 경우 하이 또는 로우를 유지하여, 누적된 전압 레벨이 특정 레벨 이상으로 유지되는 경우, 해당 지점에서 충전 방식이 변경되도록 할 수 있다.또한 어댑터 입력과 함께 고 전력시 배터리 방전 모드가 지원되는 경우, 외부 장치 300의 배터리 330의 잔량 [0060]RSOC(Relative State of Charge) 변화량을 통해 충전 모드를 변경(예를 들어, 고속 충전 모드에서 저속 충전 모드)를 변경할 수 있다. 예를 들어, 컨트롤러 210은 주기적으로, 또는 지속적으로 외부 장치 300의 배터리 330의RSOC를 모니터링 할 수 있다. 컨트롤러 210은 모니터링 된 RSOC의 변화량에 기반하여 충전 방식이 변경되도록할 수 있다. 일반적으로, 배터리가 완전히 방전되거나, 잔량이 얼마 남지 않는 경우에는 빠른 속도로 충전이 이루어지지만, 배터리가 거의 완전 충전 상태에 가까워질수록 충전 속도는 감소할 수 있다. 따라서, 배터리 잔량에 따라서 충전 속도를 변경하는 것이 효율적일 수 있다. 충전 모드가 변경될 때는 디스플레이 260에 알림이 제공될 수 있다. 만약 고속 충전 모드로 재진입을 원하는 경우, 선택 메뉴가 제공될 수 있다. 일부 실시 예에서,배터리가 충전 중인 경우, 컴퓨팅 시스템 200 또는 외부 장치 300의 디스플레이에는 항상, 또는 소정 입력에 의해 충전 모드를 변경할 수 있는 메뉴가 디스플레이 될 수 있다. 일부 실시 예에서, RSOC 변화량이 증가하는 경우, 자동으로 고속 충전 모드로 변경될 수도 있다. 도 5는 다양한 실시 예에 따른 각각의 회로에서 발생하는 알림 신호의 타이밍 관계를 나타낸다. [0061]그래프 1은 모니터링 되는 입력 전류(전압으로 변환된 값)의 변화를 나타낸다. Vth는 입력 전류를 전압으로 변환 [0062]하였을 때, 임계 전압을 나타낼 수 있다. OR 게이트 A에서는 임계 전압이 발생할 때마다 하이(high) 신호가 발생될 수 있다. OR 게이트는 입력 전류에 대한 모니터링 결과뿐만 아니라, 시스템 전압 Vsys에 대한 모니터링 결과(예를 들어, 기준 전압보다 낮은 시스템 전압 Vsys가 검출되는 경우)에 대해서도 하이 신호를 출력할 수 있다(그래프 2)그래프 3을 참조하면, 트리거 회로부 215(또는 회로부 440)에서 발생하는 어댑터 제한 알람 신호는 일정 시간 [0063]t1 동안 발생할 수 있다. 일정 시간 t1 이내에 OR 게이트 A로부터 여러 번의 임계 전압 이상, 또는 기준 전압이하의 전압 값이 발생하더라도, t1 동안 발생된 여러 번의 알람 신호는 한번의 어댑터 제한 알람 신호로 처리될 수 있다.그래프 4를 참조하면, 컨트롤러 210은 트리거 회로부 215에 의해 발생한 어댑터 제한 알람 신호를 일정 시간(예 [0064]를 들어, t2) 간격으로 감지할 수 있다. 컨트롤러 210은 일정 시간 t2 간격으로 어댑터 제한 알람 신호가 하이로 유지되는 횟수를 감지하고, 미리 설정된 횟수 이상 하이 신호가 발생하면, 예를 들어 회로 450은 보호 알람신호(high)를 발생시킬 수 있다.그래프 5를 참조하면, 한 주기 동안 처음 어댑터 제한 알람 하이 신호를 감지한 순간부터 t2가 카운팅 될 수 있 [0065]다. 보호 알람이 발생하고, 일정 시간 t3가 경과하면 t2는 다시 초기화 될 수 있다.그래프 6을 참조하면, 회로 450은 시간 t2 간격으로 미리 설정된 횟수(도시된 예시에서는 3회) 이상 어댑터 제 [0066]한 알람 신호가 감지되면 보호 알람 신호를 생성할 수 있다. 보호 알람 신호가 발생하면 충전 방식이 하위 단계로 변경될 수 있다. 예를 들어, 충전 방식이 고속 충전 모드에서 일반 충전 모드, 또는 저속 충전 모드로 변경공개특허 10-2015-0097330-13-될 수 있다. 보호 알람 신호는 t3동안 지속될 수 있다. 다양한 실시 예에서, 변경된 충전 방식에도 불구하고 입력 전류가 허 [0067]용 값을 초과하거나, 시스템 전압이 여전히 낮게 검출될 수 있다. 이 경우, t3 동안 검출된 신호는 무시될 수있다. 너무 잦은 충전 방식의 변경은 비효율적이거나 사용자에게 불편함을 제공할 수 있다. 시간 t3가 경과하면t2가 리셋되면서 다시 컴퓨팅 시스템 200의 전체 모니터링 프로세스가 시작될 수 있다.도 6은 다양한 실시 예에 따른 외부 장치의 충전 방식을 변경하는 프로세스를 나타낸다. [0068]도 6을 참조하면, 동작 610에서 외부 장치 300의 충전 방식이 결정될 수 있다. 다양한 실시 예에서, 외부 장치 [0069]300이 컴퓨팅 시스템 200에 연결되면, 컴퓨팅 시스템 200은 미리 정의된 일반적인 충전 방식(예를 들어, 5V-0.5A의 전원 공급)으로 외부 장치 300이 충전되도록 할 수 있다. 일부 실시 예에서, 컴퓨팅 시스템 200은 외부장치 300의 특성 및 컴퓨팅 시스템 200의 현재 부하, 컴퓨팅 시스템 200의 자체 배터리 230의 배터리 잔량 중적어도 하나에 기초하여 충전 방식을 결정할 수 있다. 일부 실시 예에서, 컴퓨팅 시스템 200은 외부 장치 300이연결되거나, 사용자로부터 충전과 연관된 특정 입력이 발생한 경우, 충전 방식 결정을 위한 메뉴가 디스플레이되도록 할 수 있다. 디스플레이 된 메뉴에 대한 사용자 입력에 기초하여 충전 방식이 결정될 수 있다.동작 620에서 컴퓨팅 시스템 200은 결정된 충전 방식에 따라 외부 장치 300에 대한 충전을 시작할 수 있다. 충 [0070]전과 함께 컴퓨팅 시스템 200은 현재의 충전 방식, 또는 사용자가 변경할 수 있는 다른 충전 방식, 현재 공급되고 있는 전압 또는 전류에 대한 정보 등을 제공할 수 있다.동작 630에서 컴퓨팅 시스템 200은 컴퓨팅 시스템 200 내부의 전류 및 전압을 모니터링 할 수 있다. 예를 들어, [0071]컴퓨팅 시스템 200은 어댑터 100으로부터 제공되는 입력 전류를 모니터링 할 수 있다. 입력 전류는 전압으로 변환된 값으로 모니터링 될 수 있다. 또한 컴퓨팅 시스템 200은 컴퓨팅 시스템 200을 안정적으로 구동하기 위해시스템 부하에 요구되는 충분한 전압이 인가되고 있는지 모니터링 할 수 있다.동작 640에서, 모니터링 결과 입력 전류가 너무 높거나, 기준 값 이하의 시스템 전압이 검출되는 경우, 충전 방 [0072]식이 변경될 수 있다. 예를 들어, 충전 방식은 4단계에서 3단계로 한 단계 하향 조정될 수 있다. 충전 방식이변경되면 다시 동작 620으로 진행하여 외부 장치 300을 계속해서 충전할 수 있다. 외부 장치 300에 대한 충전이완료되면, 프로세스는 종료된다.도 7은 다양한 실시 예에 따른 외부 장치의 충전 방식을 변경하는 예시적인 프로세스의 일부를 나타낸다. [0073]도 7을 참조하면, 동작 710에서 충전 방식이 결정될 수 있다. 동작 710은 사용자에게 선택 가능한 충전 모드를 [0074]디스플레이하는 동작과, 사용자 입력에 기초하여 선택된 충전 모드를 충전 방식으로 결정하는 동작을 포함할 수있다. 예를 들어, 사용자가 선택 가능한 충전 모드로 고속 충전 모드(FAST mode)와 일반 충전 모드(NORMALmode)가 제공될 수 있다. 일 실시 예에서, 컴퓨팅 시스템 200에서 지원하는 충전 방식의 일부가 사용자에 의해선택되도록 제공될 수 있다. 예를 들어, 저속 충전 모드(SLOW mode)는 컴퓨팅 시스템에 의해 지원되지만, 사용자 선택 메뉴에는 제공되지 않을 수 있다.동작 720에서 결정된 충전 방식이 고속 충전 모드인지 여부가 판단될 수 있다. 만약 결정된 충전 방식이 고속 [0075]충전 모드인 경우 동작 721로 진행하고, 일반 충전 모드인 경우 동작 722로 진행할 수 있다.동작 721에서, 제한 신호의 발생 여부가 판단될 수 있다. 다양한 실시 예에서, 제한 신호는 전술한 입력 전류 [0076]모니터링부 211에 의해 감지된 전류(변환된 전압) 또는 시스템 전압 모니터링부 213에 의해 감지된 전압에 기반하여 생성된 어댑터 전류 제한 알림 신호일 수 있다. 제한 신호가 발생하면 동작 723으로, 제한 신호가 감지되지 않으면 동작 740으로 진행할 수 있다.동작 723에서, 제한 신호, 예를 들어 어댑터 전류 제한 알림 신호의 발생 횟수를 판단할 수 있다. 발생 횟수는 [0077]제1 시간 간격(예를 들어, 시간 간격 t2)으로 제2 시간 기간 동안(예를 들어, 시간 기간 t3) 발생한 어댑터 전류 제한 알림 신호의 횟수를 나타낼 수 있다. 만약에 발생 횟수가 미리 정의된 기준 회수 N(예를 들어, N=3)를초과하는 경우, 동작 725로 진행할 수 있다. 그렇지 않은 경우, 동작 740으로 진행할 수 있다.동작 725에서, 어댑터 전류 제한 알림 신호의 발생 횟수가 미리 정의된 기준 회수 N을 초과하는 경우, 보호 알 [0078]람 신호가 발생할 수 있다. 이 보호 알람 신호는 컨트롤러 210 내부에 위치한 보호 알람 신호 생성 회로 450에의해 발생될 수 있다. 보호 알람 신호가 발생하면, 프로세스는 동작 727로 진행할 수 있다.동작 727에서, 컴퓨팅 시스템 200은 외부 장치 300의 충전 방식을 변경할 수 있다. 현재 충전 방식인 고속 충전 [0079]공개특허 10-2015-0097330-14-모드에서 한 단계 하위 단계인 일반 충전 모드로 충전 방식이 변경될 수 있다. 충전 방식이 변경된 후, 프로세스는 A로 계속 진행할 수 있다. A 이후의 프로세스는 도 8을 참조하여 후술한다.동작 720에서 고속 충전 방식이 아닌 것으로 판단된 경우(즉, 일반 충전 방식인 경우) 동작 722에서 제한 신호 [0080]의 발생 여부가 모니터링 된다. 또한 동작 724에서 제한 신호의 발생 횟수가 판단된다. 동작 722와 동작 724는각각 동작 721 및 723에 대응될 수 있으므로, 중복되는 설명은 생략한다.동작 726에서, 어댑터 전류 제한 알림 신호의 발생 횟수가 미리 정의된 기준 회수 N을 초과하는 경우, 보호 알 [0081]람 신호가 발생할 수 있다. 보호 알람 신호가 발생하면, 프로세스는 동작 728로 진행할 수 있다.동작 728에서, 컴퓨팅 시스템 200은 외부 장치 300의 충전 방식을 변경할 수 있다. 현재 충전 방식인 일반 충전 [0082]모드에서 가장 하위 단계인 저속 충전 모드로 충전 방식이 변경될 수 있다. 충전 방식이 변경되면 충전 모드 타이머가 동작할 수 있다.동작 730에서, 충전 방식이 변경된 시점부터 소정 시간 t가 경과하였는지 여부가 판단될 수 있다. 시간 t가 경 [0083]과하면, 동작 732으로 진행할 수 있다. 도 7의 예시에서, 동작 728에 의해 변경된 충전 방식은 가장 하위 단계의 충전 방식이므로, 추가적인 보호 알람 신호의 발생을 탐지하기 위한 모니터링 동작은 수행되지 않을 수있다.동작 732에서 시간 t가 경과한 것으로 판단되면, 동작 710에서 결정된 충전 방식으로 충전 방식이 다시 변경될 [0084]수 있다(즉, 저속 충전 모드에서 일반 충전 모드로 변경). 사용자에 의해 결정된 충전 방식은 일반 충전 모드이기 때문에, 컴퓨팅 시스템 200은 저속 충전 모드로 소정 시간 t(예를 들어, 30분) 동안 충전을 수행하고, 다시사용자가 초기에 선택했던 일반 충전 모드로 충전 방식을 다시 변경할 수 있다. 충전 방식이 다시 상위 충전 방식으로 변경되면, 컴퓨팅 시스템 200은 보호 알람 신호의 발생을 모니터링 하는 동작(예를 들어, 동작 722 내지동작 726)을 다시 수행할 수 있다. 제한 신호가 발생하지 않거나, 기준 발생 횟수를 초과하지 않는 경우, 동작740에서 현재 결정된 충전 방식이 유지될 수 있다.도 8은 도 7에 도시된 프로세스의 후속 프로세스를 나타낸다. [0085]도 8을 참조하면, 동작 727에서 고속 충전 모드가 일반 충전 모드로 변경된 후 동작 729로 진행된다(프로세스 [0086]A).동작 729에서 제한 신호의 발생 여부가 모니터링 된다. 또한 동작 731에서 제한 신호의 발생 횟수가 판단된다. [0087]동작 729와 동작 731은 각각 동작 721 및 723에 대응될 수 있으므로, 중복되는 설명은 생략한다.동작 729에서 제한 신호가 발생하지 않거나 동작 731에서 제한 신호의 발생 횟수가 미리 정해진 횟수 N 이하인 [0088]경우, 동작 810으로 진행할 수 있다.동작 810에서는, 일반 충전 모드로 변경된 후 시간 t가 경과되었는지 여부가 판단될 수 있다. 시간 t가 경과한 [0089]것으로 판단되면, 동작 710에서 결정된 충전 방식으로 충전 방식이 다시 변경될 수 있다(즉, 일반 충전 모드에서 고속 충전 모드로 변경). 사용자에 의해 결정된 충전 방식은 고속 충전 모드이기 때문에, 컴퓨팅 시스템 200은 일반 충전 모드로 소정 시간 t(예를 들어, 30분) 동안 충전을 수행하고, 다시 사용자가 초기에 선택했던 일반 충전 모드로 충전 방식을 다시 변경할 수 있다. 동작 810에서, 예를 들어 일반 충전 모드로 충전을 수행하는시간 t는, 동작 730에서 저속 충전 모드로 충전을 수행하는 시간 t와 동일하거나 다를 수 있다. 예를 들어, 일반 충전모드로는 20분동안 충전을 수행하고 고속 충전 모드로 변경을 시도할 수 있다. 충전 방식에 따른 모드타이머 t는 시스템에서 임의로 설정되거나, 사용자에 의해 정의될 수 있다.동작 820에서 충전 방식이 다시 고속 충전 방식으로 변경되면, 프로세스는 B로 진행하여 보호 알람 신호의 발생 [0090]을 모니터링 하는 동작(예를 들어, 동작 721 내지 동작 725)이 다시 수행될 수 있다. 제한 신호가 발생하지 않거나, 기준 발생 횟수를 초과하지 않는 경우, 동작 740에서 현재 결정된 충전 방식이 유지될 수 있다.동작 731에서 제한 신호의 발생 횟수가 미리 정해진 횟수 N을 초과하는 경우, 동작 733으로 진행할 수 있다. [0091]동작 733에서, 보호 알람 신호가 발생할 수 있다. 보호 알람 신호가 발생하면, 프로세스는 동작 735로 진행할 [0092]수 있다.동작 735에서, 컴퓨팅 시스템 200은 외부 장치 300의 충전 방식을 변경할 수 있다. 현재 충전 방식인 일반 충전 [0093]모드에서 가장 하위 단계인 저속 충전 모드로 충전 방식이 변경될 수 있다. 충전 방식이 변경되면 충전 모드 타이머가 동작할 수 있다.공개특허 10-2015-0097330-15-동작 737에서, 충전 방식이 변경된 시점부터 소정 시간 t가 경과하였는지 여부가 판단될 수 있다. 시간 t가 경 [0094]과하면, 동작 732으로 진행할 수 있다. 도 8의 동작 737은 도 7의 동작 730에 대응될 수 있다.동작 739에서 시간 t가 경과한 것으로 판단되면, 동작 710에서 결정된 충전 방식으로 충전 방식이 다시 변경될 [0095]수 있다(즉, 저속 충전 모드에서 고속 충전 모드로 변경). 이 경우 사용자에 의해 결정된 충전 방식은 고속 충전 모드이기 때문에, 컴퓨팅 시스템 200은 저속 충전 모드로 소정 시간 t(예를 들어, 30분) 동안 충전을 수행하고, 다시 사용자가 초기에 선택했던 고속 충전 모드로 충전 방식을 다시 변경할 수 있다. 이 실시 예에서, 충전방식은 중간 단계인 일반 충전 모드를 거치지 않고 바로 최하위 충전 방식에서 최상위 충전 방식으로 변경될 수있다. 충전 방식이 변경되면, 프로세스는 B로 진행할 수 있다. 이후의 동작은 전술한 설명으로 대체한다.도 9는 다양한 실시 예에 따른 사용자 입력에 기반한 충전 방식이 결정되는 프로세스를 나타낸다. [0096]도 9를 참조하면, 동작 910에서 컴퓨팅 시스템 200이 특정 작업을 수행하거나, 혹은 대기 상태에 있을 수 있다. [0097]예를 들어, 컴퓨팅 시스템 200은 절전 모드 상태에 있을 수도 있다.동작 920에서 컴퓨팅 시스템 200은 외부 장치 300이 연결되었다는 것을 인식할 수 있다. 연결 인식에 대응하여 [0098]컴퓨팅 시스템 200은 외부 포트 스위치 250을 ON 상태로 변경할 수 있다. 또한 외부 포트 전류 제한 IC 219를통해 외부 장치 300과 통신하여, 외부 장치 300에 관한 정보를 수신할 수 있다. 연결 인식은, 외부 장치 300이물리적으로 연결되는 경우 및 이미 연결된 외부 장치의 전원이 ON 상태로 활성화되거나, 소프트웨어, 또는 회로상에서 연결이 수립되는 경우에 발생할 수 있다. 예를 들어, 사용자는 입력 장치 270의 기능 키를 이용하여 물리적으로 이미 연결되어 있던 외부 장치 300을 소프트웨어 방식으로 인식할 수 있다.동작 930에서 외부 장치 300의 충전이 필요한지 여부를 판단할 수 있다. 동작 930에서 충전이 필요하다고 판단 [0099]되는 경우, 동작 940으로 진행할 수 있다. 외부 장치 300의 충전이 불필요한 경우 동작 910으로 진행하여 컴퓨팅 시스템 200은 일반적인 기능 수행 또는 대기 상태로 진입할 수 있다.동작 940에서 충전이 필요한 경우, 컴퓨팅 시스템 200은 충전 방식에 대한 문의를 제공할 수 있다. 예를 들어, [0100]컴퓨팅 시스템 200은 컴퓨팅 시스템 200의 디스플레이 260에 사용자가 선택할 수 있는 충전 방식이 디스플레이되도록 할 수 있다. 디스플레이 260에는 컴퓨팅 시스템 200이 지원하는 모든 충전 방식이 제공되거나, 복수 개의 충전 방식 중 일부의 충전 방식만이 제공될 수 있다. 일부 실시 예에서, 충전 방식에 대한 문의는 외부 장치300의 디스플레이에 제공될 수 있다. 이 경우, 컨트롤러 210은 컴퓨팅 시스템 200이 지원 가능한 충전 방식을외부 장치 300의 컨트롤러 310으로 제공하고, 컨트롤러 310은 외부 장치 300에서 수용 가능한 충전 방식을 결정하여 외부 장치 300의 디스플레이에 제공할 수 있다.동작 950에서 충전 방식의 문의에 대한 사용자 입력이 수신된다. 충전 방식의 선택 메뉴가 외부 장치 300에서 [0101]제공되는 경우, 외부 장치 300은 충전 방식에 대한 입력을 수신하여, 컴퓨팅 시스템 200의 컨트롤러 210으로 제공할 수 있다.동작 960에서 컴퓨팅 시스템 200은 사용자 입력에 기반하여 충전 방식을 결정할 수 있다. 충전 방식이 [0102]결정되면, 컴퓨팅 시스템은 결정된 충전 방식에 따라 외부 장치 300을 충전하며, 충전 동안 컴퓨팅 시스템 200의 전류 및 전압을 모니터링 하는 동작을 수행할 수 있다. 즉, 프로세스 C는 전술한 도 6의 동작 630, 도 7의동작 721 내지 727 등에 대응될 수 있다.도 10은 외부 장치의 충전 중 사용자 입력에 의해 충전 방식이 변경되는 프로세스를 나타낸다. [0103]도 10을 참조하면, 동작 1010에서 외부 장치 300의 충전 방식이 결정된다. 동작 1020에서 외부 장치 300에 대한 [0104]충전이 수행된다. 외부 장치 300의 충전이 진행되는 동안, 외부 장치 300의 현재 충전 방식에 대한 정보, 예를들어, 제공 전압, 제공 전류, 변경 가능한 다른 충전 방식 등에 대한 정보가 제공될 수 있다. 일부 실시예에서, 외부 장치 300에서 지원 가능한 충전 전류에 대한 선택 메뉴 또는 그래프, 스크롤 등이 제공될 수있다.동작 1030에서 사용자는 충전 방식을 변경할 수 있다. 예를 들어, 사용자는 현재 충전 방식보다 빠른 충전 방식 [0105]을 선택하거나, 느린 충전 방식을 선택할 수 있다. 일부 실시 예에서, 사용자는 외부 장치 300에서 지원 가능한충전 전류의 범위 내에서 임의의 충전 전류를 선택할 수 있다.동작 1040에서, 컴퓨팅 시스템 200은 사용자 입력에 의하여 변경된 충전 방식에 따라 외부 장치 300을 충전할 [0106]수 있다. 컴퓨팅 시스템 200은 변경된 방식으로 충전하면서, 프로세스 D에서 컴퓨팅 시스템 200 내부의 전류 또는 전압을 모니터링 할 수 있다. 프로세스 D는 전술한 도 6의 동작 630, 도 7의 동작 721 내지 727, 도 9의 프공개특허 10-2015-0097330-16-로세스 C 등에 대응될 수 있다.도 11은 다양한 실시 예에 따른 외부 장치의 충전 방식을 제어하는 일반적인 프로세스의 일부를 나타낸다. 이하 [0107]의 설명과 관련하여, 전술한 내용과 중복되는 내용은 생략한다. 전술한 순서도 및 장치, 회로와 관련된 설명에있어서 도 11 및 도 12에 적용 가능한 설명은 도 11 및 도 12에 적용될 수 있다.도 11을 참조하면, 동작 1110에서 충전 방식이 결정될 수 있다. 동작 1120에서 제한 신호(예를 들어, 어댑터 제 [0108]한 알람 신호)의 발생 여부가 판단될 수 있다. 동작 1130에서 제한 신호의 발생 횟수가 미리 정의된 횟수 N을초과하는지 여부가 판단될 수 있다.동작 1120에서 제한 신호가 발생하지 않거나, 발생 횟수가 미리 정의된 횟수 N을 초과하지 않는 경우, 동작 [0109]1170으로 진행할 수 있다. 동작 1170에서 현재 충전 방식이 최상위 충전 방식(예를 들어, 고속 충전 모드)인지여부가 판단될 수 있다. 동작 1170에서 현재 충전 방식이 최상위 충전 방식인 경우, 동작 1180으로 진행하고,현재의 충전 방식이 최상위 충전 방식이 아닌 경우, 프로세스 G로 진행할 수 있다.동작 1120에서 제한 신호가 발생하지 않거나, 발생 횟수가 미리 정의된 횟수 N을 초과하지 않는 경우, 현재의 [0110]컴퓨팅 시스템 200의 충전 상태는 매우 양호하다는 것을 의미할 수 있다. 즉, 컴퓨팅 시스템 200이 시스템 자원을 적게 소모하거나, 컴퓨팅 시스템 200의 배터리 230이 완전 충전된 상태이거나, 외부 장치 300의 배터리 상황이 좋은 경우일 수 있다. 이러한 경우, 컴퓨팅 시스템 200은 외부 장치 300으로 더 많은 충전 전류를 공급하는것이 가능하다. 그러나 현재 충전 방식이 최상위 충전 방식, 즉 시스템 200 또는 외부 장치 300이 지원하는 가장 많은 전류가 공급되고 있는 경우라면, 충전 방식은 그대로 유지될 수 있다. 만약, 현재 충전 방식이 최상위충전 방식이 아닌 경우에, 충전 방식을 상위 방식으로 변경하기 위한 프로세스 G로 진행할 수 있다.다시 동작 1130으로 돌아가서, 제한 신호의 발생 횟수가 미리 정의된 횟수 N을 초과하는 경우, 동작 1140에서 [0111]보호 알람 신호가 발생할 수 있다. 보호 알람 신호가 발생하면, 동작 1150에서 현재 충전 방식이 최하위 충전방식(예를 들어, 저속 충전 모드)인지 판단될 수 있다. 현재 충전 방식이 최하위 충전 방식이 아닌 경우, 충전방식을 한 단계 하향 조정하기 위한 프로세스 E로 진행할 수 있다. 만약 현재 충전 방식이 최하위 충전 방식인경우, 최하위 충전 방식을 이용하는 경우에도 컴퓨팅 시스템 200 또는 어댑터 100에 제한 상황이 발생한다는 것을 의미하므로, 동작 1160에서 외부 장치 300의 충전이 중단될 수 있다.도 12는 도 11에 도시된 프로세스의 후속 프로세스를 나타낸다. [0112]도 11의 동작 1170에서 현재 충전 방식이 최상위 방식이 아닌 경우, 프로세스 G로 진행할 수 있다. 도 12를 참 [0113]조하면, 동작 1230에서, 현재 충전 방식으로 충전을 시작한 후 소정 시간 t가 경과하였는지 판단될 수 있다. 만약 소정 시간 t가 경과하였다면, 동작 1240으로 진행할 수 있다.동작 1240에서 현재 충전 방식이 한 단계 상위 충전 방식으로 조정될 수 있다. 그러나 도 7 및 도 8의 예시에서 [0114]와 같이, 사용자에 의해 설정된 충전 방식이 있는 경우, 복수 개의 상위 충전 방식 중 어느 하나의 충전 방식으로 충전 방식이 상향 조정될 수 있다.도 11의 동작 1150에서, 현재 충전 방식이 최하위 충전 방식이 아닌 경우, 프로세스 E로 진행할 수 있다. 도 12 [0115]를 참조하면, 동작 1210에서 충전 방식이 하향 조정될 수 있다. 동작 1220에서 변경된 충전 방식이 최하위 충전방식인지 여부가 판단될 수 있다. 만약에 하향 조정된 충전 방식이 최하위 충전 방식인 경우, 동작 1230에서 소정 시간 t가 경과하였는지 판단되고, 충전 방식이 변경된 시점부터 소정 시간 t가 경과하였다면, 동작 1240에서충전 방식이 상향 조정될 수 있다. 그러나 동작 1220에서 하향 조정된 충전 방식이 최하위 충전 방식이 아닌 경우, 프로세스 F로 진행하여 컴퓨팅 시스템 200 내부의 전류 및 전압 모니터링 프로세스가 수행될 수 있다. 이는도 7 및 도 8에서 설명된 실시 예에 일부 대응될 수 있다.그러나 일부 실시 예에서, 동작 1220과 동작 1230 사이에서도 모니터링 동작이 수행될 수 있다. 즉, 도 11에서 [0116]전술한 바와 같이, 변경된 충전 방식이 최하위 충전 방식인 경우에도, 모니터링 동작을 수행하고, 최하위 충전방식으로 외부 장치 300을 충전하는 중에도 보호 알람 신호가 발생하면, 충전을 중단할 수 있다.다양한 실시 예에 따른 컴퓨팅 시스템의 충전 제어 방법은, 상기 컴퓨팅 시스템에 연결된 외부 장치에 대한 충 [0117]전 방식을 결정하는 동작; 상기 충전 방식에 따라 상기 외부 장치를 충전하는 동작; 상기 컴퓨팅 시스템 내부의전류 및 전압을 모니터링 하는 동작; 및 상기 모니터링 결과에 기반하여 상기 충전 방식을 변경하는 동작을 포함할 수 있다. 다양한 실시 예에 따른 충전 방식을 결정하는 동작은, 사용자에게 선택 가능한 복수 개의 충전 모드를 제시하는 [0118]공개특허 10-2015-0097330-17-(present) 동작; 상기 복수 개의 충전 모드 중 하나의 모드를 선택하는 사용자 입력을 수신하는 동작; 및 상기선택된 모드를 상기 충전 방식으로 결정하는 동작을 포함할 수 있다. 또한 상기 충전 방식을 결정하는 동작은,상기 컴퓨팅 시스템의 시스템 부하, 상기 컴퓨팅 시스템에 포함된 자체 배터리 충전 상황, 및 상기 외부 장치의동작 상태 중 적어도 하나에 기반하여 충전 방식을 자동으로 결정할 수 있다. 또한 상기 충전 방식을 결정하는동작은, 사용자에게 선택 가능한 충전 전류의 범위를 제시하는 동작; 상기 충전 전류의 범위에 해당하는 특정전류 값에 대한 사용자 입력을 수신하는 동작; 및 상기 수신된 사용자 입력에 기반하여, 상기 특정 전류 값에따라 충전 방식을 결정하는 동작을 포함할 수 있다.다양한 실시 예에 따른 상기 모니터링 하는 동작은, 상기 컴퓨팅 시스템에 전기적으로 연결되고 상기 컴퓨팅 시 [0119]스템으로 전원을 공급하는 어댑터에 의한 입력 전류를 모니터링 하는 동작 또는 상기 컴퓨팅 시스템의 시스템전압을 모니터링 하는 동작 중 적어도 하나의 동작을 포함할 수 있다. 또한 상기 모니터링 하는 동작은, 상기컴퓨팅 시스템에 전기적으로 연결되고 상기 컴퓨팅 시스템으로 전원을 공급하는 어댑터에 의한 입력 전류를 모니터링 하는 동작; 및 상기 컴퓨팅 시스템의 시스템 전압을 모니터링 하는 동작 중 적어도 하나의 동작을 포함할 수 있다. 다양한 실시 예에 따른 상기 충전 방식을 변경하는 동작은, 상기 모니터링 결과, 상기 전류가 기준 전류 값을 [0120]초과하거나, 상기 전압이 기준 전압 미만인 경우가 미리 정의된 횟수 이상 발생하는 경우, 상기 충전 방식을 하위 단계의 충전 방식으로 변경할 수 있다. 또한 상기 충전 방식을 변경하는 동작은, 상기 모니터링 결과, 상기전류가 기준 전류 값을 초과하거나 상기 전압이 기준 전압 미만인 경우가 미리 정의된 시간 동안 발생하지 않는경우, 상기 충전 방식을 상위 단계의 충전 방식으로 변경할 수 있다. 다양한 실시 예에 따른 상기 입력 전류를 모니터링 하는 동작은, 상기 입력 전류를 전압으로 변환하고, 상기 변 [0121]환된 전압이 임계 전압을 초과하는지 여부를 모니터링 할 수 있다.다양한 실시 예에 따른 상기 시스템 전압을 모니터링 하는 동작은, 상기 시스템 전압이 기준 전압 이하에서 감 [0122]지되는지 여부를 모니터링 할 수 있다.다양한 실시 예에 따른 컴퓨팅 시스템과 연결된 외부 장치의 충전 방식을 제어하는 방법은, 제1 충전 방식으로 [0123]상기 외부 장치를 충전하는 동작; 상기 컴퓨팅 시스템 내부의 전류 및 전압을 모니터링 하는 동작; 및 상기 모니터링 결과에 기반하여 상기 제1 충전 방식을 제2 충전 방식으로 변경하는 동작을 포함할 수 있다.다양한 실시 예에 따른 상기 전류 및 전압을 모니터링 하는 동작은, 미리 정의된 조건에 따라 어댑터 제한 알람 [0124]신호를 생성하는 동작; 및 상기 어댑터 알림 신호가 기준 횟수 이상 감지되는 경우, 보호 알람 신호를 생성하는동작을 포함할 수 있다. 이 경우 상기 제2 충전 방식은 상기 제1 충전 방식보다 하위 충전 방식일 수 있다.다양한 실시 예에 따른 상기 어댑터 제한 알람 신호는, 상기 컴퓨팅 시스템으로 제공되는 입력 전류가 임계 값 [0125]이상으로 감지되거나, 상기 컴퓨팅 시스템의 시스템 전압이 기준 값 이하로 감지되는 경우 발생할 수 있다. 또한 상기 어댑터 제한 알림 신호는 제1 시간 동안 유지될 수 있다.다양한 실시 예에 따른 상기 보호 알람 신호는 상기 어댑터 제한 알림 신호가 제2 시간 간격으로 상기 기준 횟 [0126]수 이상 감지되는 경우 생성될 수 있다. 또한 상기 보호 알람 신호는 제3 시간 동안 유지되고, 상기 제3 시간동안 상기 제2 충전 방식은 변경되지 않을 수 있다.다양한 실시 예에 따라, 상기 모니터링 결과가 상기 충전 방식의 하향 조정을 지시하는 경우, 상기 제2 충전 방 [0127]식은 상기 제1 충전 방식에 대하여 하위 충전 방식이고, 상기 모니터링 결과가 상기 충전 방식의 상향 조정을지시하는 경우, 상기 제2 충전 방식은 상기 제1 충전 방식에 대하여 상위 충전 방식일 수 있다.다양한 실시 예에 따라, 상기 모니터링 결과가 상기 충전 방식의 하향 조정을 지시하고, 상기 제1 충전 방식이 [0128]최하위 충전 방식인 경우, 상기 외부 장치의 충전을 중단할 수 있다. 또한 상기 모니터링 결과가 상기 충전 방식의 상향 조정을 지시하고, 상기 제1 충전 방식이 최상위 충전 방식인 경우, 상기 제2 충전 방식은 상기 제1충전 방식과 동일한 충전 방식일 수 있다.도 13은 다양한 실시 예들에 따른 전자 장치의 블록도를 도시한다.11 도 13의 도면 부호는 출원시에 수정하도록 [0129]하겠습니다.도 13을 참조하면, 상기 전자 장치 1300은 하나 이상의 어플리케이션 프로세서(AP: application processor) [0130]공개특허 10-2015-0097330-18-1310, 통신 모듈 1320, SIM(subscriber identification module) 카드 1324, 메모리 1330, 센서 모듈 1340, 입력 장치 1350, 디스플레이 1360, 인터페이스 1370, 오디오 모듈 1380, 카메라 모듈 1391, 전력 관리 모듈1395, 배터리 1396, 인디케이터 1397 및 모터 1398을 포함할 수 있다.상기 AP 1310은 운영체제 또는 응용 프로그램을 구동하여 상기 AP 1310에 연결된 다수의 하드웨어 또는 소프트 [0131]웨어 구성요소들을 제어할 수 있고, 멀티미디어 데이터를 포함한 각종 데이터 처리 및 연산을 수행할 수 있다.상기 AP 1310은, 예를 들면, SoC(system on chip)로 구현될 수 있다. 한 실시 예에 따르면, 상기 AP 1310은GPU(graphic processing unit, 미도시)를 더 포함할 수 있다.상기 통신 모듈 1320은 상기 전자 장치 1300과 네트워크를 통해 연결된 다른 전자 장치들간의 통신에서 데이터 [0132]송수신을 수행할 수 있다. 한 실시 예에 따르면, 상기 통신 모듈 1320은 셀룰러 모듈 1321, Wifi 모듈 1323, BT모듈 1325, GPS 모듈 1327, NFC 모듈 1328 및 RF(radio frequency) 모듈 1329를 포함할 수 있다.상기 셀룰러 모듈 1321은 통신망(예: LTE, LTE-A, CDMA, WCDMA, UMTS, WiBro 또는 GSM 등)을 통해서 음성 [0133]통화, 영상 통화, 문자 서비스 또는 인터넷 서비스 등을 제공할 수 있다. 또한, 상기 셀룰러 모듈 1321은, 예를들면, 가입자 식별 모듈(예: SIM 카드 1324)을 이용하여 통신 네트워크 내에서 전자 장치의 구별 및 인증을 수행할 수 있다. 한 실시 예에 따르면, 전자 장치의 구별을 위해 가입자 식별 모듈 대신 전자 장치를 구동하는 운영체제의 시리얼 번호, 또는 전자 장치의 메인보드에 탑재된 식별 정보 등이 이용될 수 있다. 한 실시 예에 따르면, 상기 셀룰러 모듈 1321은 상기 AP 1310이 제공할 수 있는 기능 중 적어도 일부 기능을 수행할 수 있다.예를 들면, 상기 셀룰러 모듈 1321은 멀티 미디어 제어 기능의 적어도 일부를 수행할 수 있다. 한 실시 예에 따르면, 상기 셀룰러 모듈 1321은 커뮤니케이션 프로세서(CP: communication processor)를 포함할 [0134]수 있다. 또한, 상기 셀룰러 모듈 1321은, 예를 들면, SoC로 구현될 수 있다. 도 13에서는 상기 셀룰러 모듈1321(예: 커뮤니케이션 프로세서), 상기 메모리 1330, 또는 상기 전력관리 모듈 1395 등의 구성요소들이 상기AP 1310와 별개의 구성요소로 도시되어 있으나, 한 실시 예에 따르면, 상기 AP 1310이 전술한 구성요소들의 적어도 일부(예: 셀룰러 모듈 1321)를 포함하도록 구현될 수 있다.한 실시 예에 따르면, 상기 AP 1310 또는 상기 셀룰러 모듈 1321(예: 커뮤니케이션 프로세서)은 각각에 연결된 [0135]비 휘발성 메모리 또는 다른 구성요소 중 적어도 하나로부터 수신한 명령 또는 데이터를 휘발성 메모리에 로드(load)하여 처리할 수 있다. 또한, 상기 AP 1310 또는 상기 셀룰러 모듈 1321은 다른 구성요소 중 적어도 하나로부터 수신하거나 다른 구성요소 중 적어도 하나에 의해 생성된 데이터를 비 휘발성 메모리에 저장(store)할수 있다.상기 Wifi 모듈 1323, 상기 BT 모듈 1325, 상기 GPS 모듈 1327 또는 상기 NFC 모듈 1328 각각은, 예를 들면, [0136]해당하는 모듈을 통해서 송수신되는 데이터를 처리하기 위한 프로세서를 포함할 수 있다. 도 13에서는 셀룰러모듈 1321, Wifi 모듈 1323, BT 모듈 1325, GPS 모듈 1327 또는 NFC 모듈 1328이 각각 별개의 블록으로 도시되었으나, 한 실시 예에 따르면, 셀룰러 모듈 1321, Wifi 모듈 1323, BT 모듈 1325, GPS 모듈 1327 또는 NFC 모듈 1328 중 적어도 일부(예: 두 개 이상)는 하나의 통합칩(integrated chip, IC) 또는 IC 패키지 내에 포함될수 있다. 예를 들면, 셀룰러 모듈 1321, Wifi 모듈 1323, BT 모듈 1325, GPS 모듈 1327 또는 NFC 모듈 1328 각각에 대응하는 프로세서들 중 적어도 일부(예: 셀룰러 모듈 1321에 대응하는 커뮤니케이션 프로세서 및 Wifi 모듈 1323에 대응하는 Wifi 프로세서)는 하나의 SoC로 구현될 수 있다. 상기 RF 모듈 1329는 데이터의 송수신, 예를 들면, RF 신호의 송수신을 할 수 있다. 상기 RF 모듈 1329는, 도시 [0137]되지는 않았으나, 예를 들면, 트랜시버(transceiver), PAM(power amp module), 주파수 필터(frequency filter)또는 LNA(low noise amplifier) 등을 포함할 수 있다. 또한, 상기 RF 모듈 1329는 무선 통신에서 자유 공간상의 전자파를 송수신하기 위한 부품, 예를 들면, 도체 또는 도선 등을 더 포함할 수 있다. 도 13에서는 셀룰러모듈 1321, Wifi 모듈 1323, BT 모듈 1325, GPS 모듈 1327 및 NFC 모듈 1328이 하나의 RF 모듈 1329을 서로 공유하는 것으로 도시되어 있으나, 한 실시 예에 따르면, 셀룰러 모듈 1321, Wifi 모듈 1323, BT 모듈 1325, GPS모듈 1327 또는 NFC 모듈 1328 중 적어도 하나는 별개의 RF 모듈을 통하여 RF 신호의 송수신을 수행할 수 있다.상기 SIM 카드 1324는 가입자 식별 모듈을 포함하는 카드일 수 있으며, 전자 장치의 특정 위치에 형성된 슬롯에 [0138]삽입될 수 있다. 상기 SIM 카드 1324는 고유한 식별 정보(예: ICCID(integrated circuit card identifier)) 또는 가입자 정보(예: IMSI(international mobile subscriber identity))를 포함할 수 있다.상기 메모리 1330은 내장 메모리 1332 또는 외장 메모리 1334를 포함할 수 있다. 상기 내장 메모리 1332는, 예 [0139]를 들면, 휘발성 메모리(예를 들면, DRAM(dynamic RAM), SRAM(static RAM), SDRAM(synchronous dynamic RAM)공개특허 10-2015-0097330-19-등) 또는 비 휘발성 메모리(non-volatile Memory, 예를 들면, OTPROM(one time programmable ROM),PROM(programmable ROM), EPROM(erasable and programmable ROM), EEPROM(electrically erasable andprogrammable ROM), mask ROM, flash ROM, NAND flash memory, NOR flash memory 등) 중 적어도 하나를 포함할수 있다.한 실시 예에 따르면, 상기 내장 메모리 1332는 Solid State Drive(SSD)일 수 있다. 상기 외장 메모리 1334는 [0140]플래시 드라이브(flash drive), 예를 들면, CF(compact flash), SD(secure digital), Micro-SD(micro securedigital), Mini-SD(mini secure digital), xD(extreme digital) 또는 메모리 스틱(Memory Stick) 등을 더 포함할 수 있다. 상기 외장 메모리 1334는 다양한 인터페이스를 통하여 상기 전자 장치 1300과 기능적으로 연결될수 있다. 한 실시 예에 따르면, 상기 전자 장치 1300은 하드 드라이브와 같은 저장 장치(또는 저장 매체)를 더포함할 수 있다.상기 센서 모듈 1340은 물리 량을 계측하거나 전자 장치 1300의 작동 상태를 감지하여, 계측 또는 감지된 정보 [0141]를 전기 신호로 변환할 수 있다. 상기 센서 모듈 1340은, 예를 들면, 제스처 센서 1340A, 자이로 센서 1340B,기압 센서 1340C, 마그네틱 센서 1340D, 가속도 센서 1340E, 그립 센서 1340F, 근접 센서 1340G, color 센서1340H(예: RGB(red, green, blue) 센서), 생체 센서 1340I, 온/습도 센서 1340J, 조도 센서 1340K 또는UV(ultra violet) 센서 1340M 중의 적어도 하나를 포함할 수 있다. 추가적으로 또는 대체적으로, 상기 센서 모듈 1340은, 예를 들면, 후각 센서(E-nose sensor, 미도시), EMG 센서(electromyography sensor, 미도시), EEG센서(electroencephalogram sensor, 미도시), ECG 센서(electrocardiogram sensor, 미도시), IR(infra red) 센서(미도시), 홍채 센서(미도시) 또는 지문 센서(미도시) 등을 포함할 수 있다. 상기 센서 모듈 1340은 그 안에속한 적어도 하나 이상의 센서들을 제어하기 위한 제어 회로를 더 포함할 수 있다.상기 입력 장치 1350은 터치 패널(touch panel) 1352, (디지털) 펜 센서(pen sensor) 1354, 키(key) 1356 또는 [0142]초음파(ultrasonic) 입력 장치 1358를 포함할 수 있다. 상기 터치 패널 1352는, 예를 들면, 정전식, 감압식, 적외선 방식 또는 초음파 방식 중 적어도 하나의 방식으로 터치 입력을 인식할 수 있다. 또한, 상기 터치 패널1352는 제어 회로를 더 포함할 수도 있다. 정전식의 경우, 물리적 접촉 또는 근접 인식이 가능하다. 상기 터치패널 1352는 택타일 레이어(tactile layer)를 더 포함할 수도 있다. 이 경우, 상기 터치 패널 1352는 사용자에게 촉각 반응을 제공할 수 있다. 상기 (디지털) 펜 센서 1354는, 예를 들면, 사용자의 터치 입력을 받는 것과 동일 또는 유사한 방법 또는 별도 [0143]의 인식용 시트(sheet)를 이용하여 구현될 수 있다. 상기 키 1356는, 예를 들면, 물리적인 버튼, 광학식 키 또는 키패드를 포함할 수 있다. 상기 초음파(ultrasonic) 입력 장치 1358는 초음파 신호를 발생하는 입력 도구를통해, 전자 장치 1300에서 마이크(예: 마이크 1388)로 음파를 감지하여 데이터를 확인할 수 있는 장치로서, 무선 인식이 가능하다. 한 실시 예에 따르면, 상기 전자 장치 1300은 상기 통신 모듈 1320을 이용하여 이와 연결된 외부 장치(예: 컴퓨터 또는 서버)로부터 사용자 입력을 수신할 수도 있다.상기 디스플레이 1360은 패널 1362, 홀로그램 장치 1364 또는 프로젝터 1366을 포함할 수 있다. 상기 패널 1362 [0144]는, 예를 들면, LCD(liquid-crystal display) 또는 AM-OLED(active-matrix organic light-emitting diode) 등일 수 있다. 상기 패널 1362는, 예를 들면, 유연하게(flexible), 투명하게(transparent) 또는 착용할 수 있게(wearable) 구현될 수 있다. 상기 패널 1362는 상기 터치 패널 1352과 하나의 모듈로 구성될 수도 있다. 상기홀로그램 장치 1364는 빛의 간섭을 이용하여 입체 영상을 허공에 보여줄 수 있다. 상기 프로젝터 1366는 스크린에 빛을 투사하여 영상을 표시할 수 있다. 상기 스크린은, 예를 들면, 상기 전자 장치 1300의 내부 또는 외부에위치할 수 있다. 한 실시 예에 따르면, 상기 디스플레이 1360은 상기 패널 1362, 상기 홀로그램 장치 1364, 또는 프로젝터 1366를 제어하기 위한 제어 회로를 더 포함할 수 있다.상기 인터페이스 1370은, 예를 들면, HDMI(high-definition multimedia interface) 1372, USB(universal [0145]serial bus) 1374, 광 인터페이스(optical interface) 1376 또는 D-sub(D-subminiature) 1378를 포함할 수 있다. 추가적으로 또는 대체적으로, 상기 인터페이스 1370은, 예를 들면, MHL(mobile high-definition link) 인터페이스, SD(secure Digital) 카드/MMC(multi-media card) 인터페이스 또는 IrDA(infrared data association)규격 인터페이스를 포함할 수 있다.상기 오디오 모듈 1380은 소리(sound)와 전기신호를 쌍방향으로 변환시킬 수 있다. 상기 오디오 모듈 1380은, [0146]예를 들면, 스피커 1382, 리시버 1384, 이어폰 1386 또는 마이크 1388 등을 통해 입력 또는 출력되는 소리 정보를 처리할 수 있다. 공개특허 10-2015-0097330-20-상기 카메라 모듈 1391은 정지 영상 및 동영상을 촬영할 수 있는 장치로서, 한 실시 예에 따르면, 하나 이상의 [0147]이미지 센서(예: 전면 센서 또는 후면 센서), 렌즈(미도시), ISP(image signal processor, 미도시) 또는 플래시 (flash, 미도시)(예: LED 또는 xenon lamp)를 포함할 수 있다.상기 전력 관리 모듈 1395은 상기 전자 장치 1300의 전력을 관리할 수 있다. 도시하지는 않았으나, 상기 전력 [0148]관리 모듈 1395은, 예를 들면, PMIC(power management integrated circuit), 충전 IC(charger integratedcircuit) 또는 배터리 또는 연료 게이지(battery or fuel gauge)를 포함할 수 있다.상기 PMIC는, 예를 들면, 집적회로 또는 SoC 반도체 내에 탑재될 수 있다. 충전 방식은 유선과 무선으로 구분될 [0149]수 있다. 상기 충전 IC는 배터리를 충전시킬 수 있으며, 충전기로부터의 과전압 또는 과전류 유입을 방지할 수있다. 한 실시 예에 따르면, 상기 충전 IC는 유선 충전 방식 또는 무선 충전 방식 중 적어도 하나를 위한 충전IC를 포함할 수 있다. 무선 충전 방식으로는, 예를 들면, 자기공명 방식, 자기유도 방식 또는 전자기파 방식 등이 있으며, 무선 충전을 위한 부가적인 회로, 예를 들면, 코일 루프, 공진 회로 또는 정류기 등의 회로가 추가될 수 있다. 상기 배터리 게이지는, 예를 들면, 상기 배터리 1396의 잔량, 충전 중 전압, 전류 또는 온도를 측정할 수 있다. [0150]상기 배터리 1396는 전기를 저장 또는 생성할 수 있고, 그 저장 또는 생성된 전기를 이용하여 상기 전자 장치1300에 전원을 공급할 수 있다. 상기 배터리 1396는, 예를 들면, 충전식 전지(rechargeable battery) 또는 태양 전지(solar battery)를 포함할 수 있다. 상기 인디케이터 1397는 상기 전자 장치 1300 혹은 그 일부(예: 상기 AP 1310)의 특정 상태, 예를 들면, 부팅 [0151]상태, 메시지 상태 또는 충전 상태 등을 표시할 수 있다. 상기 모터 1398는 전기적 신호를 기계적 진동으로 변환할 수 있다. 도시되지는 않았으나, 상기 전자 장치 1300은 모바일 TV 지원을 위한 처리 장치(예: GPU)를 포함할 수 있다. 상기 모바일 TV지원을 위한 처리 장치는, 예를 들면, DMB(digital multimedia broadcasting),DVB(digital video broadcasting) 또는 미디어 플로우(media flow) 등의 규격에 따른 미디어 데이터를 처리할수 있다.다양한 실시 예에 따른 외부 장치의 충전 방식을 제어하기 위한 컴퓨팅 시스템은, 상기 외부 장치와 연결을 제 [0152]공하는 외부 포트; 어댑터로부터 제공되는 입력 전류를 모니터링 하기 위한 입력 전류 모니터링부; 상기 컴퓨팅시스템의 시스템 전압을 모니터링 하기 위한 시스템 전압 모니터링 부; 상기 입력 전류 모니터링부에 의해 모니터링 된 상기 입력 전류와 상기 시스템 전압 모니터링부에 의해 모니터링된 상기 시스템 전압에 따라 어댑터 제한 알람 신호를 발생시키는 트리거 회로부; 및 상기 트리거 회로부에 의해 발생되는 상기 어댑터 제한 알람 신호를 감지하는 컨트롤러를 포함하고, 상기 컨트롤러는 상기 어댑터 제한 알람 신호에 기반하여 상기 외부 장치를 충전하는 충전 방식을 변경할 수 있다.또한 상기 컨트롤러는 상기 어댑터 제한 알람 신호가 미리 정해진 시간 간격으로 기준 횟수를 초과하여 감지되 [0153]는 경우 보호 알람 신호를 생성하고, 상기 보호 알람 신호에 따라 상기 충전 방식을 하위 충전 방식으로 변경할수 있다.또한 상기 컨트롤러는, 미리 정의된 시간 동안, 상기 어댑터 제한 알림 신호가 기준 횟수 이하로 발생하는 [0154]경우, 상기 충전 방식을 하위 충전 방식으로 변경할 수 있다.또한 상기 컨트롤러는 상기 외부 장치의 배터리 잔량의 RSOC(Relative State of Charge) 변화량에 기반하여 충 [0155]전 방식을 변경할 수 있다.또한 상기 컴퓨팅 시스템은, 디스플레이 장치 및 입력 장치를 더 포함하고, 상기 외부 장치가 상기 외부 포트에 [0156]연결되면, 선택 가능한 복수 개의 충전 방식을 상기 디스플레이 장치에 디스플레이 하고, 상기 입력 장치를 통해 수신된 사용자 입력에 따라, 상기 복수 개의 충전 방식 중 하나의 충전 방식을 상기 외부 장치에 대한 충전방식으로 결정할 수 있다. 또한 상기 디스플레이 장치와 상기 입력 장치는 하나의 터치 디스플레이 패널로 구현될 수 있다.또한 상기 컨트롤러는 상기 충전 방식이 고속 충전 방식으로 결정되는 경우, 상기 외부 장치로 변경된 충전 방 [0157]식에 대한 제어 신호를 전송하고, 상기 제어 신호는 상기 외부 장치에서 상기 고속 충전 방식에 따른 배터리 충전을 위한 설정을 위해 이용될 수 있다본 발명의 다양한 실시 예에 따른 전자 장치의 전술한 구성요소들 각각은 하나 또는 그 이상의 부품(componen [0158]공개특허 10-2015-0097330-21-t)으로 구성될 수 있으며, 해당 구성 요소의 명칭은 전자 장치의 종류에 따라서 달라질 수 있다. 본 발명의 다양한 실시 예에 따른 전자 장치는 전술한 구성요소 중 적어도 하나를 포함하여 구성될 수 있으며, 일부 구성요소가 생략되거나 또는 추가적인 다른 구성요소를 더 포함할 수 있다. 또한, 본 발명의 다양한 실시 예에 따른전자 장치의 구성 요소들 중 일부가 결합되어 하나의 개체(entity)로 구성됨으로써, 결합되기 이전의 해당 구성요소들의 기능을 동일하게 수행할 수 있다.본 발명의 다양한 실시 예에 사용된 용어 \"모듈\"은, 예를 들어, 하드웨어, 소프트웨어 또는 펌웨어(firmware) [0159]중 하나 또는 둘 이상의 조합을 포함하는 단위(unit)를 의미할 수 있다. \"모듈\"은 예를 들어, 유닛(unit), 로직(logic), 논리 블록(logical block), 부품(component) 또는 회로(circuit) 등의 용어와 바꾸어 사용(interchangeably use)될 수 있다. \"모듈\"은, 일체로 구성된 부품의 최소 단위 또는 그 일부가 될 수 있다. \"모듈\"은 하나 또는 그 이상의 기능을 수행하는 최소 단위 또는 그 일부가 될 수도 있다. \"모듈\"은 기계적으로 또는 전자적으로 구현될 수 있다. 예를 들면, 본 발명의 다양한 실시 예에 따른 \"모듈\"은, 알려졌거나 앞으로 개발될, 어떤 동작들을 수행하는 ASIC(application-specific integrated circuit) 칩, FPGAs(field-programmablegate arrays) 또는 프로그램 가능 논리 장치(programmable-logic device) 중 적어도 하나를 포함할 수 있다.그리고 본 명세서와 도면에 개시된 실시 예들은 본 발명의 다양한 실시 예의 내용을 쉽게 설명하고, 이해를 돕 [0160]기 위해 특정 예를 제시한 것일 뿐이며, 본 발명의 다양한 실시 예의 범위를 한정하고자 하는 것은 아니다. 따라서 본 발명의 다양한 실시 예의 범위는 여기에 개시된 실시 예들 이외에도 본 발명의 다양한 실시 예의 기술적 사상을 바탕으로 도출되는 모든 변경 또는 변형된 형태가 본 발명의 다양한 실시 예의 범위에 포함되는 것으로 해석되어야 한다.도면도면1도면2공개특허 10-2015-0097330-22-도면3공개특허 10-2015-0097330-23-도면4도면5공개특허 10-2015-0097330-24-도면6도면7공개특허 10-2015-0097330-25-도면8도면9공개특허 10-2015-0097330-26-도면10도면11공개특허 10-2015-0097330-27-도면12공개특허 10-2015-0097330-28-도면13공개특허 10-2015-0097330-29-"}
{"patent_id": "10-2014-0018713", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "컴퓨팅 시스템의 충전 제어 방법이 개시된다. 상기 방법은, 상기 컴퓨팅 시스템에 연결된 외부 장치에 대한 충전 방식을 결정하는 동작; 상기 충전 방식에 따라 상기 외부 장치를 충전하는 동작; 상기 컴퓨팅 시스템 내부의 전 류 및 전압을 모니터링 하는 동작; 및 상기 모니터링 결과에 기반하여 상기 충전 방식을 변경하는 동작을 포함할 수 있다. 이 외에 다양한 실시 예들이 가능하다."}
{"patent_id": "10-2014-0018713", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시 예들은 컴퓨팅 시스템에서 발생하는 부하에 따라 컴퓨팅 시스템에 연결된 외부 장치의 충전을 제어하는 기술에 관한 것이다."}
{"patent_id": "10-2014-0018713", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "랩탑(laptop PC)이나 데스트톱(desktop PC)와 같은 컴퓨팅 시스템은 USB(Universal Serial Bus)나 스마트폰과 같은 외부 장치와 연결될 수 있는 외부 포트(external port)를 제공한다. 컴퓨팅 시스템은 외부 포트를 통해 연 결된 외부 장치와 데이터 교환 및 통신을 할 수 있다.한편 컴퓨팅 시스템은 외부 포트를 통해 연결된 외부 장치에 대하여 전력을 공급할 수 있다. 일 예로서, 외부 장치의 배터리는 컴퓨팅 시스템과 연결되어 있는 동안 서서히 충전된다."}
{"patent_id": "10-2014-0018713", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "최근 컴퓨팅 시스템과 연결될 수 있는 외부 장치의 배터리 용량과 전력 소모가 급격하게 증가하였다. 예를 들어, 2010년 출시된 Samsung Galaxy S의 배터리 용량은 1500mAh였는데, 최근 출시된 Samsung Galaxy Note 3의 배터리 용량은 3200mAh로 최근 4년간 2배 이상 증가하였다. Samsung Galaxy Note 10.1의 배터리 용량은 약 8220mAh로 증가하였다. 이에 따라, 컴퓨팅 시스템을 통한 외부 장치의 충전 시간에 대한 지연이 발생할 수 있다. 일반적으로 제조사에서 제공하는 외부 장치(예를 들어, Samsung Galaxy S4)의 전용 어댑터(adaptor)는 5V-1A의 충전을 제공한다. 그러나 정격(정품) 충전기가 아닌 컴퓨팅 시스템의 USB 2.0 연결 포트를 통해 외부 장치가 충전되는 경우, 500mA의 전류가 공급될 수 있다(USB 3.0의 경우, 900mA의 전류가 공급될 수 있다). 노트 북 PC의 USB 연결 포트(예를 들어, USB 2.0)를 통해 방전 상태인 Samsung Galaxy S4의 배터리(용량이 약 2600mAh이다)를 충전하는 경우, 약 5시간 30분이 소요될 수 있다. 근래에는 충전 시간을 단축시키기 위하여 강 제로 USB 연결 포트를 통한 공급 전류를 증가시키기 위한 장치나 응용프로그램들이 제공되고 있다. 그러나 컴퓨팅 시스템도 많은 구성요소(즉, 부하)를 포함하기 때문에, 컴퓨팅 시스템의 시스템 자원을 최대로 활용하면서 외부 장치에 높은 전력을 공급하기 위해서는 컴퓨팅 시스템에 전력을 제공하는 어댑터(adaptor)의 용량을 증가시켜야 하지만, 이는 어댑터의 재료비 상승, 크기 증가 등으로 인하여 제조사와 소비자에게 모두 부 담을 줄 수 있다. 또한 기존의 어댑터를 그대로 사용하면서 외부 장치에 높은 전류를 제공하는 경우, 컴퓨팅 시 스템이 활용할 수 있는 전력이 충분하지 않아, 컴퓨팅 시스템의 자체 배터리가 방전되거나, 컴퓨팅 시스템이 다 운되는 문제점이 발생할 수 있다. 따라서, 본 발명의 다양한 실시 예들은, USB 등 외부 포트에 외부 장치가 연결되는 경우, 외부 장치의 전력 소 모 상태, 컴퓨팅 시스템 및 외부 장치의 부하, 및 어댑터의 용량을 고려하여 효율적으로 충전 상태를 제어하는 방법 및 장치를 제공할 수 있다."}
{"patent_id": "10-2014-0018713", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 다양한 실시 예에 따른 컴퓨팅 시스템의 충전 제어 방법은, 상기 컴퓨팅 시스템에 연결된 외부 장치 에 대한 충전 방식을 결정하는 동작; 상기 충전 방식에 따라 상기 외부 장치를 충전하는 동작; 상기 컴퓨팅 시 스템 내부의 전류 및 전압을 모니터링 하는 동작; 및 상기 모니터링 결과에 기반하여 상기 충전 방식을 변경하 는 동작을 포함할 수 있다."}
{"patent_id": "10-2014-0018713", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "다양한 실시 예에 따르면, 컴퓨팅 시스템에 연결된 외부 장치의 충전 방식을 사용자의 선택에 따라 결정되도록 할 수 있다. 또한 다양한 실시 예에 따르면, 충전 중 변동하는 전류 또는 전압의 상황에 따라서 충전 방식이 능동적으로 변 동되도록 하여, 어댑터나 컴퓨팅 시스템에 과부하를 발생시키기 않으면서도 최적의 충전 효율을 제공할 수 있다."}
{"patent_id": "10-2014-0018713", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 다양한 실시 예가 첨부된 도면과 연관되어 기재된다. 본 발명의 다양한 실시 예는 다양한 변경 을 가할 수 있고 여러 가지 실시 예를 가질 수 있는바, 특정 실시 예들이 도면에 예시되고 관련된 상세한 설명 이 기재되어 있다. 그러나 이는 본 발명의 다양한 실시 예를 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 다양한 실시 예의 사상 및 기술 범위에 포함되는 모든 변경 및/또는 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유사한 참조 부호가 사용되었다. 본 발명의 다양한 실시 예 가운데 사용될 수 있는 \"포함한다.\" 또는 \"포함할 수 있다.\" 등의 표현은 개시된 해 당 기능, 동작 또는 구성요소 등의 존재를 가리키며, 추가적인 하나 이상의 기능, 동작 또는 구성요소 등을 제 한하지 않는다. 또한 본 발명의 다양한 실시 예에서, \"포함하다.\" 또는 \"가지다.\" 등의 용어는 명세서상에 기재 된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능 성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 발명의 다양한 실시 예에서 \"또는\" 등의 표현은 함께 나열된 단어들의 어떠한, 그리고 모든 조합을 포함한다. 예를 들어, \"A 또는 B\"는, A를 포함할 수도, B를 포함할 수도, 또는 A와 B 모두를 포함할 수도 있다. 본 발명의 다양한 실시 예 가운데 \"제1\", \"제2\", \"첫째\", 또는 \"둘째\" 등의 표현들이 본 발명의 다양한 실시 예 의 다양한 구성요소들을 수식할 수 있지만, 해당 구성요소들을 한정하지 않는다. 예를 들어, 상기 표현들은 해 당 구성요소들의 순서 및/또는 중요도 등을 한정하지 않는다. 상기 표현들은 한 구성요소를 다른 구성요소와 구 분 짓기 위해 사용될 수 있다. 예를 들어, 제1 사용자 기기와 제2 사용자 기기는 모두 사용자 기기이며, 서로 다른 사용자 기기를 나타낸다. 예를 들어, 본 발명의 다양한 실시 예의 권리 범위를 벗어나지 않으면서 제1 구 성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있 다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해될 수 있어야 할 것이다. 본 발명의 다양한 실시 예에서 사용한 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 본 발명의 다양한 실시 예를 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명의 다양한 실시 예가 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미 를 가지고 있다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥 상 가지는 의미와 일치하는 의미를 가지는 것으로 해석되어야 하며, 본 발명의 다양한 실시 예에서 명백하게 정의하지 않 는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 본 발명의 다양한 실시 예에 따른 전자 장치는, 통신 기능이 포함된 장치일 수 있다. 예를 들면, 전자 장치는 스마트 폰(smartphone), 태블릿 PC(tablet personal computer), 이동 전화기(mobile phone), 화상전화기, 전자 북 리더기(e-book reader), 데스크톱 PC(desktop personal computer), 랩탑 PC(laptop personal computer), 넷 북 컴퓨터(netbook computer), PDA(personal digital assistant), PMP(portable multimedia player), MP3 플레이어, 모바일 의료기기, 카메라(camera), 또는 웨어러블 장치(wearable device)(예: 전자 안경과 같은 head- mounted-device(HMD), 전자 의복, 전자 팔찌, 전자 목걸이, 전자 앱세서리(appcessory), 전자 문신, 또는 스마 트 와치(smartwatch))중 적어도 하나를 포함할 수 있다. 어떤 실시 예들에 따르면, 전자 장치는 통신 기능을 갖춘 스마트 가전 제품(smart home appliance)일 수 있다. 스마트 가전 제품은, 예를 들자면, 전자 장치는 텔레비전, DVD(digital video disk) 플레이어, 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스(set-top box), TV 박스(예를 들면, 삼성 HomeSyncTM, 애플TVTM, 또는 구글 TVTM), 게임 콘솔(game consoles), 전자 사전, 전자 키, 캠코더(camcorder), 또는 전자 액자 중 적어도 하나를 포함할 수 있다. 어떤 실시 예들에 따르면, 전자 장치는 각종 의료기기(예: MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 초음파기 등), 네비게이션(navigation) 장치, GPS 수신기(global positioning system receiver), EDR(event data recorder), FDR(flight data recorder), 자동차 인포테인먼트(infotainment) 장치, 선박용 전자 장비(예: 선박용 항법 장치 및 자이로 콤파 스 등), 항공 전자기기(avionics), 보안 기기, 차량용 헤드 유닛, 산업용 또는 가정용 로봇, 금융 기관의 ATM(automatic teller뭩 machine) 또는 상점의 POS(point of sales) 중 적어도 하나를 포함할 수 있다. 어떤 실시 예들에 따르면, 전자 장치는 통신 기능을 포함한 가구(furniture) 또는 건물/구조물의 일부, 전자 보 드(electronic board), 전자 사인 입력장치(electronic signature receiving device), 프로젝터(projector), 또는 각종 계측기기(예: 수도, 전기, 가스, 또는 전파 계측 기기 등) 중 적어도 하나를 포함할 수 있다. 본 발 명의 다양한 실시 예에 따른 전자 장치는 전술한 다양한 장치들 중 하나 또는 그 이상의 조합일 수 있다. 또한, 본 개세에 따른 전자 장치는 플렉서블 장치일 수 있다. 또한, 본 발명의 다양한 실시 예에 따른 전자 장치는 전 술한 기기들에 한정되지 않음은 당업자에게 자명하다. 이하, 첨부된 도면을 참조하여 다양한 실시 예에 따른 전자 장치에 대해서 살펴본다. 다양한 실시 예에서 이용 되는 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공지능 전자 장치) 를 지칭할 수 있다. 도 1은 다양한 실시 예에 따른 어댑터와 외부 장치가 연결된 컴퓨팅 시스템을 나타낸다. 본 명세서에서 컴퓨팅 시스템(computing system) 200이라 함은, 어댑터 100을 통해 전력을 공급 받으면서, 동시 에 외부 포트를 포함하고, 외부 포트에 외부 장치가 연결될 수 있는 다양한 형태의 전자 장치를 포함한다. 예를 들어, 컴퓨팅 시스템 200은 노트북 PC나 데스크톱 PC(desktop PC), 넷북(netbook PC), 또는 아이맥(iMac)이나 올인원 PC(all-in-one PC)의 실시 형태를 포함한다. 본 명세서에서 외부 장치(external device) 300이라 함은, 컴퓨팅 시스템 200의 외부 포트와 연결되고 컴퓨팅 시스템 200에 의해 전력을 공급받는 전자 장치를 포함한다. 일반적으로 외부 장치 300은 독립된 전자 장치 (stand-alone device)이지만, 그에 한정되는 것은 아니다. 외부 장치 300은 삼성 갤럭시 S 시리즈와 같은 스마 트폰, 삼성 갤럭시 탭, 노트 10.1과 같은 태블릿, 또는 갤럭시 노트와 같은 다양한 전자 장치일 수 있다. 또한 외부 장치 300은 갤럭시 카메라, 또는 일반 디지털 카메라일 수 있다. 다양한 실시 예에서, 외부 장치 300은 USB 저장장치, 외장 하드 디스크, 카드 리더기일 수 있다. 다양한 실시 예에서, 외부 장치 300은 컴퓨팅 시스템 200과 동종의 장치일 수 있다. 예를 들어, 컴퓨팅 시스템 200이 랩탑 PC이고, 외부 장치 300 역시 상기 랩탑 PC 의 외부 포트에 연결된 다른 랩탑 PC일 수 있다. 또는 컴퓨팅 시스템 200이 어댑터와 연결 가능하고 외부 포트 가 제공되는 형태의 스마트폰 또는 태블릿이고, 외부 장치 300 역시 동종의 다른 스마트폰 또는 태블릿일 수 있 다. 본 명세서에서, 컴퓨팅 시스템 200과 외부 장치 300은 모두 전자 장치로 표기되거나 이해될 수 있다. 도 1에는 컴퓨팅 시스템 200이 어댑터 100 및 외부 장치 300과 유선으로 연결되는 것으로 도시되었으나, 어댑터 100, 컴퓨팅 시스템 200, 및 외부 장치 300 사이의 연결은 유선 또는 무선 연결을 통해 구현될 수 있다. 예를 들어, 컴퓨팅 시스템 200은 외부 장치 300에 공진 유도방식 또는 자기 유도방식과 같은 무선 충전 방식을 이용 하여 전력을 공급할 수 있다. 후술하는 실시 예들은 유선 충전 및 그와 관련된 회로를 중심으로 설명되지만, 컴 퓨팅 시스템 200에서 외부 장치 300으로 전력을 제공하는 구성에 대응되는 설명은 당업자 수준에서 무선 충전 방식으로 대체될 수 있다. 다시 도 1을 참조하면, 어댑터 100은 컴퓨팅 시스템 200에 전력을 공급한다. 도시하지 않았지만, 어댑터 100은 상시 공급 전원(예를 들어, 가정이나 회사, 공공장소에서 제공되는 AC 전원)과 연결될 수 있다. 어댑터 100은상시 공급 전원을 컴퓨팅 시스템 200에 적합한 형태의 규격으로 변환하여 컴퓨팅 시스템 200에 전력을 공급할 수 있다. 예를 들어, 컴퓨팅 시스템 200이 Samsung ATIV Book 9 series인 경우, 어댑터 100은 40W의 정격 용량 을 제공할 수 있다. 컴퓨팅 시스템 200은 어댑터 100을 통해 공급받은 전력을 이용하여 컴퓨팅 시스템 200을 구동할 수 있다. 컴퓨 팅 시스템 200은 자체 배터리를 포함할 수 있다. 컴퓨팅 시스템 200은 공급받은 전력을 이용하여 컴퓨팅 시스템 200에 포함된 다양한 부하(예를 들어, 프로세서, 메모리, 저장 장치, 디스플레이 장치(예를 들어, LED 또는 AMOLED 디스플레이 장치), 그래픽 프로세서, 스피커, 내장 마이크, 웹 카메라, 네트워크 모듈(예를 들어, 802.11 bg/n, 블루투스 4.0, 이더넷 모듈 등) 등)에 공급되고 남은 전력을 자체 배터리를 충전하기 위해 사용할 수 있다. 다양한 실시 예에서, 컴퓨팅 시스템 200은 외부 포트에 연결된 외부 장치 300에 전력을 공급하고 여유 전력이 남아 있는 경우, 자체 배터리를 충전할 수 있다. 도 2는 다양한 실시 예에 따른 전력 공급의 개념도를 나타낸다. 도 2를 참조하면, 어댑터 100으로부터 컴퓨팅 시스템 200으로 전력이 공급된다. 이 전력은 컴퓨팅 시스템 200을 구동할 때 발생하는 시스템 부하 220에 일부 공급되고, 여유 전력은 컴퓨팅 시스템 200의 자체 배터리 230을 충 전하기 위해 사용될 수 있다. 만약 외부 포트 240을 통해 외부 장치 300이 연결되어 있는 경우, 외부 장치 300 을 구동하거나, 외부 장치 300 내부에 탑재된 배터리를 충전하기 위해 전력이 공급될 수 있다. 다양한 실시 예 에서, 컴퓨팅 시스템 200은 크게 3종류로 전력을 분배할 수 있다. 하나는 컴퓨팅 시스템 200을 구동하기 위한 시스템 부하 220에 공급되는 전력이며, 다른 하나는 컴퓨팅 시스템 200의 내장 배터리 230을 충전하기 위한 전 력이고, 마지막은 외부 장치 300으로 제공되는 전력이다. 컨트롤러 210은 컴퓨팅 시스템 200 또는 외부 장치 300에 따라 전력 배분을 조절할 수 있다. 예를 들어, 컴퓨팅 시스템 200의 구동에 문제가 생기거나 컴퓨팅 시스 템 200이 다운되는 현상을 방지하기 위하여 컨트롤러 210은 시스템 부하 220에 전력을 최우선으로 배분할 수 있 다. 여유 전력이 있는 경우, 외부 장치 300으로 공급할 수 있다. 외부 장치 300으로 공급되는 전력은 다시 외부 장치 300을 구동하기 위한 전력과 외부 장치 300의 배터리를 충전하기 위한 전력으로 구분될 수 있다. 컨트롤러 210은 외부 장치 300을 구동하기 위한 전력을 외부 장치 300의 배터리를 충전하기 위한 전력보다 우선하여 공급 할 수 있다. 일부 실시 예에서, 컨트롤러 210(또는 컴퓨팅 시스템 200)은 외부 장치 300에서의 전력 사용 우선 순위를 제어할 수 없기 때문에, 컨트롤러 210은 외부 장치 300의 컨트롤러 또는 제어부(예를 들어, AP)로 공급 되는 전력을 외부 장치 300을 구동하기 위한 전력으로 우선 사용하라는 제어 신호를 제공할 수 있다. 외부 장치 300은 이 제어 신호에 따라, 공급된 전력을 배터리 충전 대신 외부 장치 300의 구동을 위해 사용할 수 있다. 만 약 컨트롤러 210에서 외부 장치 300의 구동보다 외부 장치 300의 배터리 충전을 수행하라는 제어 신호를 제공하 는 경우, 외부 장치 300은 외부 장치 300에 포함된 다양한 구성 요소(예를 들어, AP, 각종 센서 및 모듈)를 비 활성화 또는 슬립(sleep) 상태로 전환하고, 배터리 충전에 집중할 수 있다. 그러나 일부 다른 실시 예에서, 컨 트롤러 210(또는 컴퓨팅 시스템 200)이 외부 장치 300에서의 전력 사용 우선 순위를 직접 제어할 수 있는 경우, 컨트롤러 210(또는 컴퓨팅 시스템 200)은 외부 장치 300으로 제공되는 전원의 공급 경로를 직접 제어할 수 있다. 다양한 실시 예에서, 컨트롤러 210은 외부 장치 300이 연결되었을 때 발생할 수 있는 다양한 상황에 따라서 전 력 공급을 제어할 수 있다. 외부 장치 300은 복수 개의 충전 상태를 지원할 수 있다. 예를 들어, 외부 장치 300 은 고속 충전 모드, 일반 충전 모드, 및 저속 충전 모드를 지원할 수 있다. 다른 실시 예에서, 외부 장치는 다 양한 충전 단계를 제공할 수 있다. 예를 들어, 외부 장치 300의 구동에만 필요한 최소 전력을 공급받고 외부 장 치 300의 배터리를 충전하지 않는 1단계부터, 외부 장치 300의 동작을 최소화하고 배터리의 충전을 극대화하는 5단계에 해당하는 충전 단계를 제공할 수 있다. 이 경우, 제공되는 전력 또는 전류의 양에 따라 2, 3, 4단계의 중간 단계가 존재할 수 있다. 전술한 예시(고속/일반/저속 충전 모드)의 경우, 총 3단계의 충전 단계가 있는 것으로 이해될 수 있다. 다양한 실시 예에서, 컨트롤러 210은 컴퓨팅 시스템 200 또는 외부 장치 300의 상태에 따라 충전 방식을 결정할 수 있다. 컨트롤러 210은 외부 장치 300이 컴퓨팅 시스템 200의 외부 포트에 연결되거나, 미리 연결되어 있던 외부 장치 300이 활성화(예를 들어, 전원 ON, 스크린 ON, 또는 잠금 해제)되거나, 또는 기능 키(function key) 나 충전 명령을 통해 외부 장치 300의 충전이 시작되는 상황에 있어서, 현재 외부 장치 300에 공급 가능한 전력 량을 판단하여 충전 방식을 결정할 수 있다. 일부 실시 예에서, 컴퓨팅 시스템 200은 외부 장치 300이 연결(또 는 기타 충전이 시작되는 상황이 발생)되면, 충전 방식을 결정하기 위한 화면을 컴퓨팅 시스템 200의 스크린에 디스플레이 할 수 있다. 예를 들어 컴퓨팅 시스템 200은 고속 충전 모드 또는 일반 충전 모드 중 하나를 선택할 수 있는 메뉴 화면을 디스플레이 할 수 있다. 사용자로부터 복수 개의 충전 모드 중 하나의 모드를 선택하는 사용자 입력이 수신되면, 컴퓨팅 시스템 200은 사용자에 의해 선택된 충전 모드를 외부 장치 300의 충전 방식으로 결정할 수 있다. 다양한 실시 예에서, 컨트롤러 210은 결정된 충전 방식에 따라서 외부 장치 300에 전력을 공급할 수 있다. 그러 나 외부 장치 300에 대한 충전이 이루어지는 동안, 초기에 결정된 충전 방식을 계속해서 유지하는 것은 바람직 하지 않을 수 있다. 예를 들어, 초기에 결정된 충전 방식은 고속 충전인데, 컴퓨팅 시스템 200에서 시스템 자원 (system resources)을 많이 사용하는(시스템에 많은 부하를 발생시키는) 작업(예를 들어, 그래픽 작업, 동영상 인코딩 작업, 대용량 파일 전송 등)을 수행하는 경우, 시스템 부하 220에 공급되는 전력이 부족하게 될 수 있다. 이와 같은 상황에서, 컨트롤러 210은 배터리 230에 저장된 전력을 소모하도록 할 수도 있지만, 극단적인 경우, 시스템 부하 220에 공급되는 전력 부족으로 인하여 수행중인 작업에 문제가 생기거나, 시스템 다운이 발 생할 수 있다. 따라서 이러한 경우, 컨트롤러 210은 외부 장치 300에 제공되는 충전 방식을 고속 충전 방식에서 하위 방식(예를 들어, 일반 충전 방식, 또는 저속 충전 방식)으로 변경할 수 있다. 다양한 실시 예에서, 컴퓨팅 시스템 200에서 시스템 자원을 많이 사용하고 있거나, 컴퓨팅 시스템 200의 배터리 230의 잔량이 거의 없는 상태에서, 컨트롤러 210은 외부 장치 300에 대한 충전 방식을, 예를 들어 저속 충전 모 드로 결정할 수 있다. 그러나 시스템 부하 220에 많은 전력이 요구되는 상황이 해제(예를 들어, 다수의 태스크 (task)의 종료 등)되거나, 컴퓨팅 시스템 200의 배터리 230의 충전이 완료 또는 일정 기준 이상에 도달한 경우, 외부 장치 300으로 제공될 수 있는 전력에 여유가 생길 수 있다. 이와 같은 상황에서, 컨트롤러 210은 충전 방 식을 상위 방식(예를 들어, 일반 충전 방식, 또는 고속 충전 방식)으로 변경할 수 있다. 다양한 실시 예에서, 컴퓨팅 시스템 200은 외부 장치 300으로 공급되는 충전 전력을 보장하기 위한 조치를 취할 수 있다. 예를 들어, 컴퓨팅 시스템 200은 자체 배터리 230을 충전하기 위한 충전 전류를 조절(예를 들어, 배터 리 230의 충전 전류를 감소시키거나 차단)하여 외부 장치 300으로 충분한 충전 전류가 공급되도록 할 수 있다. 일부 실시 예에서, 컴퓨팅 시스템 200은 어댑터 100에 의해 제공되는 전력과, 배터리 230에 의해 제공되는 전력 을 합하여 외부 장치 300으로 제공할 수 있다. 또는 컴퓨팅 시스템 200은 어댑터 100에 의해 제공되는 전력 중 일정 전력 이상을 외부 장치 300으로 제공하면서, 동시에 시스템 200이 정상적으로 동작하도록 하기 위해 배터 리 230에 저장된 전력을 사용할 수 있다. 이 경우, 배터리 230은, 컴퓨팅 시스템 200이 어댑터 100에 연결되어 있음에도 불구하고, 서서히 방전될 수 있다. 도 3은 다양한 실시 예에 따른 충전 방식 제어를 제공하는 컴퓨팅 시스템 및 외부 장치의 개념도를 나타낸다. 도 3에서, 전력의 흐름은 굵은 실선으로, 제어 신호의 흐름은 점선으로 나타내었다. 도 3을 참조하면, 컴퓨팅 시스템 200은 컨트롤러 210, 시스템 부하 220, 배터리 230, 외부 포트 240, 외부 포트 스위치 250, 디스플레이 260, 입력 장치 270, 입력 전류 모니터링부 211, 시스템 전압 모니터링부 213, 트리거 (trigger) 회로부 215, 충전부(charger) 217, 및 외부 포트 전류 제한 IC 219를 포함할 수 있다. 또한 도시하 지는 않았지만, 컴퓨팅 시스템은 외부 포트 스위치(switch, SW) 250 전단에 위치한 전압 레귤레이터(예를 들어, 5V VR(voltage regulator))를 더 포함할 수 있다. 또한, 외부 장치 300은 컨트롤러 310, 충전부 320, 및 배터리 330을 포함할 수 있다. 도시하지는 않았지만, 외 부 장치 300은 외부 장치 300을 구동하는 프로세서(예를 들어, AP), 메모리, 디스플레이, 각종 센서 및 모듈을 더 포함할 수 있다. 컨트롤러 210은 트리거 회로부 215로부터 입력 전류 모니터링부 211 및/또는 시스템 전압 모니터링부 213에 의 한 모니터링 결과에 기반한 트리거 신호를 수신할 수 있다. 또한 컨트롤러 210은 적어도 트리거 신호에 기반하 여 충전부 217, 외부 포트 전류 제한 IC 219, 외부 포트 SW 250, 디스플레이 260, 입력 장치 270으로 제어 신호 를 제공할 수 있다. 도 3에 명시되지는 않았으나, 컨트롤러 210은 모니터링 상태에 따라 시스템 부하 220 중 적 어도 일부를 비활성화 하거나 활성화 하기 위해 제어 신호를 제공할 수도 있다. 컨트롤러 210은 트리거 신호와 관계없이 컴퓨팅 시스템 200의 동작을 제어할 수 있다. 설명의 편의를 위하여 컨트롤러 210의 제어 신호 흐름은 일방향(→)으로 표시하였으나, 필요에 따라 제어 신호는 양방향(↔)으로 제공될 수 있다. 또한 컨트롤러 210은 내부에 보호 알람 신호(protection alarm signal)를 생성하기 위한 회로를 포함할 수 있다. 이와 관련해서 도 4 를 참조하여 후술한다. 시스템 부하 220은, 전술한 바와 같이 컴퓨팅 시스템 200을 구동할 때 발생하는 부하, 즉 구성요소를 의미한다. 컴퓨팅 시스템 200은 각종 구성요소(components)를 포함하고, 각각의 구성요소는 동작하기 위해서 전력의 공급 을 필요로 할 수 있다. 시스템 부하 220은 컴퓨팅 시스템 200이 동작하기 위해 각 구성요소에 공급되는 부하의총 합을 의미할 수 있다. 다양한 실시 예에서, 컴퓨팅 시스템 200에 포함되지만, 비활성화 또는 슬립 상태인 구 성요소는 시스템 부하 220에 포함되지 않을 수 있다. 예를 들어, 외부 그래픽 카드가 장착된 경우, 시스템에 포 함된 자체 GPU는 비활성화 상태이며, 따라서 전원 공급이 불필요하기 때문에 시스템 부하 220에 포함되지 않을 수 있다. 일부 실시 예에서, 디스플레이 260이 OFF 되는 경우, 디스플레이에는 전력이 공급되지 않고, 따라서 디스플레이 260은 시스템 부하 220에서 제외될 수 있다. 즉, 시스템 부하 220은 가변적일 수 있다. 본 명세서에 설명되는 내용에 있어서, 시스템 부하 220은 컴퓨팅 시스템 200의 배터리를 충전하기 위해 동작하 는 구성요소(예를 들어, 충전부 217 및 배터리 230)와 외부 장치 300으로 전력을 공급하기 위해 사용되는 구성 요소(예를 들어, 외부 포트 240, 외부 장치 300의 구성요소)를 포함하지 않을 수 있다. 또한 도 3에는 시스템 부하와 별개로 컨트롤러 210, 디스플레이 260, 입력 장치 270 등이 도시되었으나, 전술한 설명의 관점에서, 이 와 같은 구성요소들도 시스템 부하 220에 포함되는 것으로 이해될 수 있다. 특히, 시스템 부하 220에 공급되는 전력 또는 시스템 부하 220에 걸리는 전압을 판단함에 있어서, 별개로 도시된 구성요소들의 영향이 함께 고려될 수 있다. 배터리 230과 외부 포트 240에 대해서는 도 2에 전술한 바 있으므로 생략한다. 외부 포트 스위치 250은 외부 포트 240에 전원을 연결할지 여부를 결정하는 스위치 역할을 수행할 수 있다. 예 를 들어, 외부 포트 스위치 250 전단에 5V VR이 위치하는 경우, 외부 포트 스위치 250은 외부 포트 240을 통해 외부 장치 300에 5V의 전원을 연결할 것인지 여부를 결정할 수 있다. 외부 포트 스위치 250은 외부 장치 300이 연결되면 자동으로 스위치 ON 될 수 있다 즉, 컴퓨팅 시스템 200에 외부 장치 300이 연결되면, 컨트롤러 210은 외부 장치 300에 전원을 인가할 것을 결정하고, 외부 포트 스위치 250으로 외부 포트 스위치 인에이블(enable) 신호를 제공할 수 있다. 하이(high) 신호가 인가되면, 외부 포트 스위치 250은 스위치 ON 할 수 있다. 로우 (low) 신호가 인가되면, 외부 포트 스위치 250은 스위치를 OFF(즉, 전원 공급 중단)할 수 있다. 외부 포트 스위 치 250은 컴퓨팅 시스템 200에 탑재된 소프트웨어에 의해 제어될 수 있다. 디스플레이 260은 외부 장치 300이 연결되었을 때, 연결된 외부 장치 300과 관련된 정보(모델 명, 제조사, 지원 기능, 배터리 용량, 현재의 배터리 충전 방식 등)와 외부 장치 300의 배터리 충전 방식을 선택하기 위한 화면이 제공할 수 있다. 디스플레이 260은 터치 패널을 구비한 디스플레이 일 수 있고, 이 경우, 사용자의 터치 입력을 수신할 수 있다. 또한, 다양한 실시 예에서, 디스플레이 260은 입력 장치 270과 통합되어 구현될 수 있다. 입력 장치 270은 사용자 입력을 수신할 수 있다. 예를 들어, 입력 장치 270은 키보드 또는 마우스를 포함할 수 있다. 입력 장치 270은 디스플레이 260에 제공되는 사용자 선택 메뉴에 대한 사용자 입력을 수신할 수 있다. 입 력 장치 270에 의해 제공되는 전원 스위치(power on switch) 또는 기능 키(function key)에 의해 외부 장치 300의 충전 방식 선택 창 또는 선택 메뉴가 디스플레이 260에 제공될 수 있다. 입력 전류 모니터링부 211은 어댑터 100으로부터 제공되는 입력 전류를 모니터링 할 수 있다. 이 입력 전류는 컴퓨팅 시스템 200 및 외부 장치 300으로 공급되는 전류의 총 합에 해당할 수 있다. 만약 외부 장치 300에서 급 격하게 고속 충전 모드로 변경되거나, 시스템 부하 220이 급격하게 감소하는 경우, 입력 전류가 증가할 수 있고, 순간적으로 안전 기준 또는 어댑터 100이나 컴퓨팅 시스템 200에서 제공하는 기준 값 이상으로 증가할 수 있다. 입력 전류 모니터링부 211은 이와 같이 컴퓨팅 시스템 200에 제공되는 입력 전류를 모니터링 하여 모니터 링 결과를 트리거 회로부 215로 제공할 수 있다. 입력 전류 모니터링부 211은 입력 전류를 전압으로 변환하여 모니터링 결과를 트리거 회로부 215로 제공할 수 있다. 일부 실시 예에서, 입력 전류를 전압으로 변환하는 과정 은 트리거 회로부 215에서 수행될 수도 있다. 이와 관련하여 도 4를 참조하여 후술한다. 시스템 전압 모니터링부 213은 컴퓨팅 시스템 200을 구동하기 위해 시스템 부하 220에 걸리는 전압(Vsys)을 모니 터링 할 수 있다. 급변하는 시스템 부하 220에 의해 입력 전류(또는 입력 전류의 전압 변환)는 임계 값 근처에 서 지나친 반복 펄스(pulse)를 발생시킬 수 있고, 이에 대응하는 출력은 감지 시스템을 적용하는데 어려움으로 작용될 수 있다. 따라서, 시스템 전압(또는 어댑터 전압)을 감지하여 시스템 부하 변동에 의한 전압 변동이 기 준 전압(Vth) 이하로 발생하는 경우, 동일한 어댑터 제한 알람 신호가 발생되도록 할 수 있다. 트리거 회로부 215는 입력 전류 모니터링부 211 및 시스템 전압 모니터링부 213으로부터 제공된 신호에 기반하 여 트리거 신호를 생성하여 컨트롤러 210으로 제공할 수 있다. 컨트롤러 210은 이 트리거 신호를 기반으로 각종 제어 신호를 생성하여 충전부 217, 외부 포트 전류 제한 IC 219, 외부 포트 SW 250, 디스플레이 260, 입력 장치 270으로 제공할 수 있다충전부(charger) 217은 컨트롤러 210로부터 배터리 230에 충전을 하도록 하는 제어 신호를 수신하면 배터리 230 에 충전을 시작할 수 있다. 일부 실시 예에서, 충전부 217은 시스템 부하 220 및 외부 장치 300에 제공하고 남 는 전력이 있는 경우, 자동으로 배터리 230의 충전을 시작할 수 잇다. 외부 포트 전류 제한 IC 219는 외부 포트 240과 연결된 외부 장치 300 사이의 통신(signal)을 통해 외부 장치 300의 종류를 인식하고 충전 및 통신 여부 등 요구되는 충전 방식(예를 들어, 충전 허용 전류 레벨, 통신 여부 등)을 감지하고 설정할 수 있다. 외부 포트 전류 제한 IC 219는 컨트롤러 210으로부터 제공된 제어 신호에 기반 하여 외부 장치 300으로 제공되는 전류 또는 외부 장치 300의 통신을 제한하기 위한 신호를 외부 장치 300(또는 외부 장치 300의 컨트롤러 310)으로 제공할 수 있다. 이러한 관점에서, 외부 포트 전류 제한 IC 219는 외부 포 트 전류/통신 제한 IC 219로 이해될 수 있다. 예를 들어, 디스플레이 260에 제공된 충전 방식 선택 메뉴에서 사 용자가 고속 충전 모드(FAST mode)의 충전 방식을 선택한 경우, 외부 포트 전류 제한 IC 219는 컨트롤러 310으 로 외부 장치 300을 고속 충전에 적합한 상태로 동작하도록 지시하는 제어 신호를 제공할 수 있다. 예를 들어, 컨트롤러 310은 컴퓨팅 시스템 200과 외부 장치 300 사이의 데이터 통신(및 외부 장치 300과 다른 외부 장치 또 는 서버와 연결되는 통신)을 중단시키고, 외부 장치 300의 최소 기능만 활성화한 후 고속 충전이 시작되도록 할 수 있다. 전술한 동작 중 일부 동작(예를 들어, 데이터 통신 중단)은 컴퓨팅 시스템 200(또는 컨트롤러 210)에 의해서 수행될 수도 있다. 외부 장치 300은 외부 포트 240을 통해 컴퓨팅 시스템 200과 연결될 수 있다. 외부 장치 300의 컨트롤러 310은 컴퓨팅 시스템 200으로부터 제공된 제어 신호에 따라 충전을 위한 외부 장치 300의 설정을 조절할 수 있다. 예 를 들어, 고속 충전 모드로 충전하는 경우, 데이터 통신을 제한하거나, 외부 장치 300의 AP를 슬립(sleep) 상태 로 전환할 수 있다. 외부 장치 300이 저속 모드로 충전되는 경우, 컨트롤러는 공급 전력의 대부분을 외부 장치 300을 구동하기 위해 사용되도록 할 수 있다. 충전부 320는 각각의 경우에 공급되는 전력을 배터리 330으로 제 공하여, 배터리 330이 충전되도록 할 수 있다. 도 4는 다양한 실시 예에 따른 제어 회로의 구현 예시를 나타낸다. 도 4는 도 3에 도시된 입력 전류 모니터링부 211, 시스템 전압 모니터링부 213, 트리거 회로부 215, 및 컨트롤 러 210을 포함하는 제어 회로일 수 있다. 예를 들어, 회로 410은 입력 전류 모니터링부 211에, 회로 430은 시스 템 전압 모니터링부 213에, 회로 420 및 440은 트리거 회로부 215에 각각 대응될 수 있다. 회로 410은 입력 전 류를 전압으로 변환할 수 있다. 다시 도 4를 참조하면, 회로 410에서, 일단은 어댑터 100과 연결되고, 타단은 시스템 전압과 연결되는 위치에 감지 저항 Rsense가 위치할 수 있다. 회로 410은 감지 저항을 이용하여 회로 410은 어댑터로부터 입력되는 입력 전류를 감지하고, 이를 전압으로 변환하여 Vin_curr로 출력할 수 있다. 회로 420에서 출력 전압 Vin_curr이 임계 (threshold) 전압 Vth을 초과하는지 판단될 수 있다. 판단 결과가 OR 게이트(OR gate, 논리합 게이트) A로 제공 될 수 있다. 회로 430은 시스템 전압 Vsys가 기준 전압 이하인지 판단할 수 있다. 시스템 전압 Vsys가 기준 전압 이하인 경우, 컴퓨팅 시스템 200이 정상적으로 작동하지 않을 수 있기 때문에, 이에 대한 알림이 요구된다. 회로 430에서 판 단된 결과, 예를 들어 Low Vsys alarm signal이 OR 게이트 A로 제공될 수 있다. 즉, 다양한 실시 예에 따른 제어 회로는 입력 전류(어댑터 전류)와 입력 전압(시스템 전압)의 병렬 구성을 통해, 어댑터 용량이 초과되는지 여부 를 정확하게 확인하는 구조를 가질 수 있다. 회로 440(트리거 회로부 440)은 OR 게이트 A로 제공된 신호에 기초하여 트리거를 발생시킬 수 있다. 상기 트리 거는 전압 또는 전류 값이 어댑터 100의 제한 값에 도달하였다는 것을 나타내는 어댑터 제한 알람 신호(adaptor limit alarm signal)일 수 있다. 어댑터 제한 알람 신호는 OR 게이트 A로 알림 신호가 제공될 때마다 발생할 수도 있지만, 일부 실시 예에서는 딜레이를 가지고 제공될 수 있다. 예를 들어, 회로 440에 포함된 R, L, C 소자(회로 440에는 R 및 C 소자만 도 시됨)를 이용하여 지연 시간을 조절할 수 있다. 예를 들어, 지연 시간이 t1인 경우, 어댑터 제한 알람 신호가 발생하고 시간 t1이 경과하기 이전에 OR 게이트 A로 임계 전류 또는 기준 전압에 해당하는 신호가 제공되더라도, 트리거 회로부 440은 어댑터 제한 알람 신호를 발생시키지 않을 수 있다. 이와 같은 딜레이를 통해 짧은 시간 내에 상대적으로 많은 알림 신호가 발생하여, 외부 장치 300의 충전 방식이 계속해서 바뀌는 상황(예를 들어,일반 충전 모드에서 고속 충전 모드로 변경하자마자 다시 일반 충전 모드로 변경되거나, 혹은 그 반대의 상황의 반복)을 방지할 수 있다. 컨트롤러 210은 내부에 보호 알람 신호(protection alarm signal)를 생성하기 위한 회로 450을 포함할 수 있다. 회로 450은 예를 들어, 기준 시간(예를 들어, t2) 이내에 어댑터 제한 알람 신호가 미리 정해진 횟수 이상 발생 하면 보호 알람 신호를 생성할 수 있다. 이는 회로 내부에서는 순간적인 전압 또는 전류 이상이 발생할 수 있고 (예를 들어, 스위치 ON/OFF나 외부 장치 300의 연결 또는 연결 해제시 발생하는 유도 기전력, 유도 전류의 현상 등) 한번 또는 소수의 어댑터 제한 알람 신호에 의해 충전 방식을 변경하는 것이 적절하지 않을 수 있기 때문이 다. 따라서 어댑터 제한 알람 신호의 발생 주기 또는 발생 횟수가 컴퓨팅 시스템 200의 상황에 따라 미리 정의 된 조건을 만족하는 경우, 회로 450은 보호 알람 신호를 생성할 수 있고, 컨트롤러 210은 이 보호 알람 신호에 따라 충전 방식이 변경되도록 할 수 있다. 다양한 실시 예에서, 컨트롤러 210은 보호 알람 신호가 발생하면 충 전 방식을 현재의 단계보다 한 단계 하위 단계로 조정할 수 있다. 그러나 일부 실시 예에서 컨트롤러 210은 보 호 알람 신호에 따라 충전 방식을 임의의 하위 단계로 조정할 수 있다. 다양한 실시 예에 따른 제어 회로는 전압 누적 비교기를 포함할 수 있다. 전압 누적 비교기는 입력 전류(입력 전류의 변환 전압), 어댑터 제한 알람 신호, 또는 OR 게이트 A에서의 전압 레벨을 누적하여, 특정 전압 이상이 발생하는 경우 하이 또는 로우를 유지하여, 누적된 전압 레벨이 특정 레벨 이상으로 유지되는 경우, 해당 지점 에서 충전 방식이 변경되도록 할 수 있다. 또한 어댑터 입력과 함께 고 전력시 배터리 방전 모드가 지원되는 경우, 외부 장치 300의 배터리 330의 잔량 RSOC(Relative State of Charge) 변화량을 통해 충전 모드를 변경(예를 들어, 고속 충전 모드에서 저속 충전 모 드)를 변경할 수 있다. 예를 들어, 컨트롤러 210은 주기적으로, 또는 지속적으로 외부 장치 300의 배터리 330의 RSOC를 모니터링 할 수 있다. 컨트롤러 210은 모니터링 된 RSOC의 변화량에 기반하여 충전 방식이 변경되도록 할 수 있다. 일반적으로, 배터리가 완전히 방전되거나, 잔량이 얼마 남지 않는 경우에는 빠른 속도로 충전이 이 루어지지만, 배터리가 거의 완전 충전 상태에 가까워질수록 충전 속도는 감소할 수 있다. 따라서, 배터리 잔량 에 따라서 충전 속도를 변경하는 것이 효율적일 수 있다. 충전 모드가 변경될 때는 디스플레이 260에 알림이 제 공될 수 있다. 만약 고속 충전 모드로 재진입을 원하는 경우, 선택 메뉴가 제공될 수 있다. 일부 실시 예에서, 배터리가 충전 중인 경우, 컴퓨팅 시스템 200 또는 외부 장치 300의 디스플레이에는 항상, 또는 소정 입력에 의 해 충전 모드를 변경할 수 있는 메뉴가 디스플레이 될 수 있다. 일부 실시 예에서, RSOC 변화량이 증가하는 경 우, 자동으로 고속 충전 모드로 변경될 수도 있다. 도 5는 다양한 실시 예에 따른 각각의 회로에서 발생하는 알림 신호의 타이밍 관계를 나타낸다. 그래프 1은 모니터링 되는 입력 전류(전압으로 변환된 값)의 변화를 나타낸다. Vth는 입력 전류를 전압으로 변환 하였을 때, 임계 전압을 나타낼 수 있다. OR 게이트 A에서는 임계 전압이 발생할 때마다 하이(high) 신호가 발 생될 수 있다. OR 게이트는 입력 전류에 대한 모니터링 결과뿐만 아니라, 시스템 전압 Vsys에 대한 모니터링 결 과(예를 들어, 기준 전압보다 낮은 시스템 전압 Vsys가 검출되는 경우)에 대해서도 하이 신호를 출력할 수 있다 (그래프 2) 그래프 3을 참조하면, 트리거 회로부 215(또는 회로부 440)에서 발생하는 어댑터 제한 알람 신호는 일정 시간 t1 동안 발생할 수 있다. 일정 시간 t1 이내에 OR 게이트 A로부터 여러 번의 임계 전압 이상, 또는 기준 전압 이하의 전압 값이 발생하더라도, t1 동안 발생된 여러 번의 알람 신호는 한번의 어댑터 제한 알람 신호로 처리 될 수 있다. 그래프 4를 참조하면, 컨트롤러 210은 트리거 회로부 215에 의해 발생한 어댑터 제한 알람 신호를 일정 시간(예 를 들어, t2) 간격으로 감지할 수 있다. 컨트롤러 210은 일정 시간 t2 간격으로 어댑터 제한 알람 신호가 하이 로 유지되는 횟수를 감지하고, 미리 설정된 횟수 이상 하이 신호가 발생하면, 예를 들어 회로 450은 보호 알람 신호(high)를 발생시킬 수 있다. 그래프 5를 참조하면, 한 주기 동안 처음 어댑터 제한 알람 하이 신호를 감지한 순간부터 t2가 카운팅 될 수 있 다. 보호 알람이 발생하고, 일정 시간 t3가 경과하면 t2는 다시 초기화 될 수 있다. 그래프 6을 참조하면, 회로 450은 시간 t2 간격으로 미리 설정된 횟수(도시된 예시에서는 3회) 이상 어댑터 제 한 알람 신호가 감지되면 보호 알람 신호를 생성할 수 있다. 보호 알람 신호가 발생하면 충전 방식이 하위 단계 로 변경될 수 있다. 예를 들어, 충전 방식이 고속 충전 모드에서 일반 충전 모드, 또는 저속 충전 모드로 변경될 수 있다. 보호 알람 신호는 t3동안 지속될 수 있다. 다양한 실시 예에서, 변경된 충전 방식에도 불구하고 입력 전류가 허 용 값을 초과하거나, 시스템 전압이 여전히 낮게 검출될 수 있다. 이 경우, t3 동안 검출된 신호는 무시될 수 있다. 너무 잦은 충전 방식의 변경은 비효율적이거나 사용자에게 불편함을 제공할 수 있다. 시간 t3가 경과하면 t2가 리셋되면서 다시 컴퓨팅 시스템 200의 전체 모니터링 프로세스가 시작될 수 있다. 도 6은 다양한 실시 예에 따른 외부 장치의 충전 방식을 변경하는 프로세스를 나타낸다. 도 6을 참조하면, 동작 610에서 외부 장치 300의 충전 방식이 결정될 수 있다. 다양한 실시 예에서, 외부 장치 300이 컴퓨팅 시스템 200에 연결되면, 컴퓨팅 시스템 200은 미리 정의된 일반적인 충전 방식(예를 들어, 5V- 0.5A의 전원 공급)으로 외부 장치 300이 충전되도록 할 수 있다. 일부 실시 예에서, 컴퓨팅 시스템 200은 외부 장치 300의 특성 및 컴퓨팅 시스템 200의 현재 부하, 컴퓨팅 시스템 200의 자체 배터리 230의 배터리 잔량 중 적어도 하나에 기초하여 충전 방식을 결정할 수 있다. 일부 실시 예에서, 컴퓨팅 시스템 200은 외부 장치 300이 연결되거나, 사용자로부터 충전과 연관된 특정 입력이 발생한 경우, 충전 방식 결정을 위한 메뉴가 디스플레이 되도록 할 수 있다. 디스플레이 된 메뉴에 대한 사용자 입력에 기초하여 충전 방식이 결정될 수 있다. 동작 620에서 컴퓨팅 시스템 200은 결정된 충전 방식에 따라 외부 장치 300에 대한 충전을 시작할 수 있다. 충 전과 함께 컴퓨팅 시스템 200은 현재의 충전 방식, 또는 사용자가 변경할 수 있는 다른 충전 방식, 현재 공급되 고 있는 전압 또는 전류에 대한 정보 등을 제공할 수 있다. 동작 630에서 컴퓨팅 시스템 200은 컴퓨팅 시스템 200 내부의 전류 및 전압을 모니터링 할 수 있다. 예를 들어, 컴퓨팅 시스템 200은 어댑터 100으로부터 제공되는 입력 전류를 모니터링 할 수 있다. 입력 전류는 전압으로 변 환된 값으로 모니터링 될 수 있다. 또한 컴퓨팅 시스템 200은 컴퓨팅 시스템 200을 안정적으로 구동하기 위해 시스템 부하에 요구되는 충분한 전압이 인가되고 있는지 모니터링 할 수 있다. 동작 640에서, 모니터링 결과 입력 전류가 너무 높거나, 기준 값 이하의 시스템 전압이 검출되는 경우, 충전 방 식이 변경될 수 있다. 예를 들어, 충전 방식은 4단계에서 3단계로 한 단계 하향 조정될 수 있다. 충전 방식이 변경되면 다시 동작 620으로 진행하여 외부 장치 300을 계속해서 충전할 수 있다. 외부 장치 300에 대한 충전이 완료되면, 프로세스는 종료된다. 도 7은 다양한 실시 예에 따른 외부 장치의 충전 방식을 변경하는 예시적인 프로세스의 일부를 나타낸다. 도 7을 참조하면, 동작 710에서 충전 방식이 결정될 수 있다. 동작 710은 사용자에게 선택 가능한 충전 모드를 디스플레이하는 동작과, 사용자 입력에 기초하여 선택된 충전 모드를 충전 방식으로 결정하는 동작을 포함할 수 있다. 예를 들어, 사용자가 선택 가능한 충전 모드로 고속 충전 모드(FAST mode)와 일반 충전 모드(NORMAL mode)가 제공될 수 있다. 일 실시 예에서, 컴퓨팅 시스템 200에서 지원하는 충전 방식의 일부가 사용자에 의해 선택되도록 제공될 수 있다. 예를 들어, 저속 충전 모드(SLOW mode)는 컴퓨팅 시스템에 의해 지원되지만, 사용 자 선택 메뉴에는 제공되지 않을 수 있다. 동작 720에서 결정된 충전 방식이 고속 충전 모드인지 여부가 판단될 수 있다. 만약 결정된 충전 방식이 고속 충전 모드인 경우 동작 721로 진행하고, 일반 충전 모드인 경우 동작 722로 진행할 수 있다. 동작 721에서, 제한 신호의 발생 여부가 판단될 수 있다. 다양한 실시 예에서, 제한 신호는 전술한 입력 전류 모니터링부 211에 의해 감지된 전류(변환된 전압) 또는 시스템 전압 모니터링부 213에 의해 감지된 전압에 기반 하여 생성된 어댑터 전류 제한 알림 신호일 수 있다. 제한 신호가 발생하면 동작 723으로, 제한 신호가 감지되 지 않으면 동작 740으로 진행할 수 있다. 동작 723에서, 제한 신호, 예를 들어 어댑터 전류 제한 알림 신호의 발생 횟수를 판단할 수 있다. 발생 횟수는 제1 시간 간격(예를 들어, 시간 간격 t2)으로 제2 시간 기간 동안(예를 들어, 시간 기간 t3) 발생한 어댑터 전 류 제한 알림 신호의 횟수를 나타낼 수 있다. 만약에 발생 횟수가 미리 정의된 기준 회수 N(예를 들어, N=3)를 초과하는 경우, 동작 725로 진행할 수 있다. 그렇지 않은 경우, 동작 740으로 진행할 수 있다. 동작 725에서, 어댑터 전류 제한 알림 신호의 발생 횟수가 미리 정의된 기준 회수 N을 초과하는 경우, 보호 알 람 신호가 발생할 수 있다. 이 보호 알람 신호는 컨트롤러 210 내부에 위치한 보호 알람 신호 생성 회로 450에 의해 발생될 수 있다. 보호 알람 신호가 발생하면, 프로세스는 동작 727로 진행할 수 있다. 동작 727에서, 컴퓨팅 시스템 200은 외부 장치 300의 충전 방식을 변경할 수 있다. 현재 충전 방식인 고속 충전 모드에서 한 단계 하위 단계인 일반 충전 모드로 충전 방식이 변경될 수 있다. 충전 방식이 변경된 후, 프로세 스는 A로 계속 진행할 수 있다. A 이후의 프로세스는 도 8을 참조하여 후술한다. 동작 720에서 고속 충전 방식이 아닌 것으로 판단된 경우(즉, 일반 충전 방식인 경우) 동작 722에서 제한 신호 의 발생 여부가 모니터링 된다. 또한 동작 724에서 제한 신호의 발생 횟수가 판단된다. 동작 722와 동작 724는 각각 동작 721 및 723에 대응될 수 있으므로, 중복되는 설명은 생략한다. 동작 726에서, 어댑터 전류 제한 알림 신호의 발생 횟수가 미리 정의된 기준 회수 N을 초과하는 경우, 보호 알 람 신호가 발생할 수 있다. 보호 알람 신호가 발생하면, 프로세스는 동작 728로 진행할 수 있다. 동작 728에서, 컴퓨팅 시스템 200은 외부 장치 300의 충전 방식을 변경할 수 있다. 현재 충전 방식인 일반 충전 모드에서 가장 하위 단계인 저속 충전 모드로 충전 방식이 변경될 수 있다. 충전 방식이 변경되면 충전 모드 타 이머가 동작할 수 있다. 동작 730에서, 충전 방식이 변경된 시점부터 소정 시간 t가 경과하였는지 여부가 판단될 수 있다. 시간 t가 경 과하면, 동작 732으로 진행할 수 있다. 도 7의 예시에서, 동작 728에 의해 변경된 충전 방식은 가장 하위 단계 의 충전 방식이므로, 추가적인 보호 알람 신호의 발생을 탐지하기 위한 모니터링 동작은 수행되지 않을 수 있다. 동작 732에서 시간 t가 경과한 것으로 판단되면, 동작 710에서 결정된 충전 방식으로 충전 방식이 다시 변경될 수 있다(즉, 저속 충전 모드에서 일반 충전 모드로 변경). 사용자에 의해 결정된 충전 방식은 일반 충전 모드이 기 때문에, 컴퓨팅 시스템 200은 저속 충전 모드로 소정 시간 t(예를 들어, 30분) 동안 충전을 수행하고, 다시 사용자가 초기에 선택했던 일반 충전 모드로 충전 방식을 다시 변경할 수 있다. 충전 방식이 다시 상위 충전 방 식으로 변경되면, 컴퓨팅 시스템 200은 보호 알람 신호의 발생을 모니터링 하는 동작(예를 들어, 동작 722 내지 동작 726)을 다시 수행할 수 있다. 제한 신호가 발생하지 않거나, 기준 발생 횟수를 초과하지 않는 경우, 동작 740에서 현재 결정된 충전 방식이 유지될 수 있다. 도 8은 도 7에 도시된 프로세스의 후속 프로세스를 나타낸다. 도 8을 참조하면, 동작 727에서 고속 충전 모드가 일반 충전 모드로 변경된 후 동작 729로 진행된다(프로세스 A). 동작 729에서 제한 신호의 발생 여부가 모니터링 된다. 또한 동작 731에서 제한 신호의 발생 횟수가 판단된다. 동작 729와 동작 731은 각각 동작 721 및 723에 대응될 수 있으므로, 중복되는 설명은 생략한다. 동작 729에서 제한 신호가 발생하지 않거나 동작 731에서 제한 신호의 발생 횟수가 미리 정해진 횟수 N 이하인 경우, 동작 810으로 진행할 수 있다. 동작 810에서는, 일반 충전 모드로 변경된 후 시간 t가 경과되었는지 여부가 판단될 수 있다. 시간 t가 경과한 것으로 판단되면, 동작 710에서 결정된 충전 방식으로 충전 방식이 다시 변경될 수 있다(즉, 일반 충전 모드에 서 고속 충전 모드로 변경). 사용자에 의해 결정된 충전 방식은 고속 충전 모드이기 때문에, 컴퓨팅 시스템 200 은 일반 충전 모드로 소정 시간 t(예를 들어, 30분) 동안 충전을 수행하고, 다시 사용자가 초기에 선택했던 일 반 충전 모드로 충전 방식을 다시 변경할 수 있다. 동작 810에서, 예를 들어 일반 충전 모드로 충전을 수행하는 시간 t는, 동작 730에서 저속 충전 모드로 충전을 수행하는 시간 t와 동일하거나 다를 수 있다. 예를 들어, 일 반 충전모드로는 20분동안 충전을 수행하고 고속 충전 모드로 변경을 시도할 수 있다. 충전 방식에 따른 모드 타이머 t는 시스템에서 임의로 설정되거나, 사용자에 의해 정의될 수 있다. 동작 820에서 충전 방식이 다시 고속 충전 방식으로 변경되면, 프로세스는 B로 진행하여 보호 알람 신호의 발생 을 모니터링 하는 동작(예를 들어, 동작 721 내지 동작 725)이 다시 수행될 수 있다. 제한 신호가 발생하지 않 거나, 기준 발생 횟수를 초과하지 않는 경우, 동작 740에서 현재 결정된 충전 방식이 유지될 수 있다. 동작 731에서 제한 신호의 발생 횟수가 미리 정해진 횟수 N을 초과하는 경우, 동작 733으로 진행할 수 있다. 동작 733에서, 보호 알람 신호가 발생할 수 있다. 보호 알람 신호가 발생하면, 프로세스는 동작 735로 진행할 수 있다. 동작 735에서, 컴퓨팅 시스템 200은 외부 장치 300의 충전 방식을 변경할 수 있다. 현재 충전 방식인 일반 충전 모드에서 가장 하위 단계인 저속 충전 모드로 충전 방식이 변경될 수 있다. 충전 방식이 변경되면 충전 모드 타 이머가 동작할 수 있다.동작 737에서, 충전 방식이 변경된 시점부터 소정 시간 t가 경과하였는지 여부가 판단될 수 있다. 시간 t가 경 과하면, 동작 732으로 진행할 수 있다. 도 8의 동작 737은 도 7의 동작 730에 대응될 수 있다. 동작 739에서 시간 t가 경과한 것으로 판단되면, 동작 710에서 결정된 충전 방식으로 충전 방식이 다시 변경될 수 있다(즉, 저속 충전 모드에서 고속 충전 모드로 변경). 이 경우 사용자에 의해 결정된 충전 방식은 고속 충 전 모드이기 때문에, 컴퓨팅 시스템 200은 저속 충전 모드로 소정 시간 t(예를 들어, 30분) 동안 충전을 수행하 고, 다시 사용자가 초기에 선택했던 고속 충전 모드로 충전 방식을 다시 변경할 수 있다. 이 실시 예에서, 충전 방식은 중간 단계인 일반 충전 모드를 거치지 않고 바로 최하위 충전 방식에서 최상위 충전 방식으로 변경될 수 있다. 충전 방식이 변경되면, 프로세스는 B로 진행할 수 있다. 이후의 동작은 전술한 설명으로 대체한다. 도 9는 다양한 실시 예에 따른 사용자 입력에 기반한 충전 방식이 결정되는 프로세스를 나타낸다. 도 9를 참조하면, 동작 910에서 컴퓨팅 시스템 200이 특정 작업을 수행하거나, 혹은 대기 상태에 있을 수 있다. 예를 들어, 컴퓨팅 시스템 200은 절전 모드 상태에 있을 수도 있다. 동작 920에서 컴퓨팅 시스템 200은 외부 장치 300이 연결되었다는 것을 인식할 수 있다. 연결 인식에 대응하여 컴퓨팅 시스템 200은 외부 포트 스위치 250을 ON 상태로 변경할 수 있다. 또한 외부 포트 전류 제한 IC 219를 통해 외부 장치 300과 통신하여, 외부 장치 300에 관한 정보를 수신할 수 있다. 연결 인식은, 외부 장치 300이 물리적으로 연결되는 경우 및 이미 연결된 외부 장치의 전원이 ON 상태로 활성화되거나, 소프트웨어, 또는 회로 상에서 연결이 수립되는 경우에 발생할 수 있다. 예를 들어, 사용자는 입력 장치 270의 기능 키를 이용하여 물 리적으로 이미 연결되어 있던 외부 장치 300을 소프트웨어 방식으로 인식할 수 있다. 동작 930에서 외부 장치 300의 충전이 필요한지 여부를 판단할 수 있다. 동작 930에서 충전이 필요하다고 판단 되는 경우, 동작 940으로 진행할 수 있다. 외부 장치 300의 충전이 불필요한 경우 동작 910으로 진행하여 컴퓨 팅 시스템 200은 일반적인 기능 수행 또는 대기 상태로 진입할 수 있다. 동작 940에서 충전이 필요한 경우, 컴퓨팅 시스템 200은 충전 방식에 대한 문의를 제공할 수 있다. 예를 들어, 컴퓨팅 시스템 200은 컴퓨팅 시스템 200의 디스플레이 260에 사용자가 선택할 수 있는 충전 방식이 디스플레이 되도록 할 수 있다. 디스플레이 260에는 컴퓨팅 시스템 200이 지원하는 모든 충전 방식이 제공되거나, 복수 개 의 충전 방식 중 일부의 충전 방식만이 제공될 수 있다. 일부 실시 예에서, 충전 방식에 대한 문의는 외부 장치 300의 디스플레이에 제공될 수 있다. 이 경우, 컨트롤러 210은 컴퓨팅 시스템 200이 지원 가능한 충전 방식을 외부 장치 300의 컨트롤러 310으로 제공하고, 컨트롤러 310은 외부 장치 300에서 수용 가능한 충전 방식을 결정 하여 외부 장치 300의 디스플레이에 제공할 수 있다. 동작 950에서 충전 방식의 문의에 대한 사용자 입력이 수신된다. 충전 방식의 선택 메뉴가 외부 장치 300에서 제공되는 경우, 외부 장치 300은 충전 방식에 대한 입력을 수신하여, 컴퓨팅 시스템 200의 컨트롤러 210으로 제 공할 수 있다. 동작 960에서 컴퓨팅 시스템 200은 사용자 입력에 기반하여 충전 방식을 결정할 수 있다. 충전 방식이 결정되면, 컴퓨팅 시스템은 결정된 충전 방식에 따라 외부 장치 300을 충전하며, 충전 동안 컴퓨팅 시스템 200 의 전류 및 전압을 모니터링 하는 동작을 수행할 수 있다. 즉, 프로세스 C는 전술한 도 6의 동작 630, 도 7의 동작 721 내지 727 등에 대응될 수 있다. 도 10은 외부 장치의 충전 중 사용자 입력에 의해 충전 방식이 변경되는 프로세스를 나타낸다. 도 10을 참조하면, 동작 1010에서 외부 장치 300의 충전 방식이 결정된다. 동작 1020에서 외부 장치 300에 대한 충전이 수행된다. 외부 장치 300의 충전이 진행되는 동안, 외부 장치 300의 현재 충전 방식에 대한 정보, 예를 들어, 제공 전압, 제공 전류, 변경 가능한 다른 충전 방식 등에 대한 정보가 제공될 수 있다. 일부 실시 예에서, 외부 장치 300에서 지원 가능한 충전 전류에 대한 선택 메뉴 또는 그래프, 스크롤 등이 제공될 수 있다. 동작 1030에서 사용자는 충전 방식을 변경할 수 있다. 예를 들어, 사용자는 현재 충전 방식보다 빠른 충전 방식 을 선택하거나, 느린 충전 방식을 선택할 수 있다. 일부 실시 예에서, 사용자는 외부 장치 300에서 지원 가능한 충전 전류의 범위 내에서 임의의 충전 전류를 선택할 수 있다. 동작 1040에서, 컴퓨팅 시스템 200은 사용자 입력에 의하여 변경된 충전 방식에 따라 외부 장치 300을 충전할 수 있다. 컴퓨팅 시스템 200은 변경된 방식으로 충전하면서, 프로세스 D에서 컴퓨팅 시스템 200 내부의 전류 또 는 전압을 모니터링 할 수 있다. 프로세스 D는 전술한 도 6의 동작 630, 도 7의 동작 721 내지 727, 도 9의 프로세스 C 등에 대응될 수 있다. 도 11은 다양한 실시 예에 따른 외부 장치의 충전 방식을 제어하는 일반적인 프로세스의 일부를 나타낸다. 이하 의 설명과 관련하여, 전술한 내용과 중복되는 내용은 생략한다. 전술한 순서도 및 장치, 회로와 관련된 설명에 있어서 도 11 및 도 12에 적용 가능한 설명은 도 11 및 도 12에 적용될 수 있다. 도 11을 참조하면, 동작 1110에서 충전 방식이 결정될 수 있다. 동작 1120에서 제한 신호(예를 들어, 어댑터 제 한 알람 신호)의 발생 여부가 판단될 수 있다. 동작 1130에서 제한 신호의 발생 횟수가 미리 정의된 횟수 N을 초과하는지 여부가 판단될 수 있다. 동작 1120에서 제한 신호가 발생하지 않거나, 발생 횟수가 미리 정의된 횟수 N을 초과하지 않는 경우, 동작 1170으로 진행할 수 있다. 동작 1170에서 현재 충전 방식이 최상위 충전 방식(예를 들어, 고속 충전 모드)인지 여부가 판단될 수 있다. 동작 1170에서 현재 충전 방식이 최상위 충전 방식인 경우, 동작 1180으로 진행하고, 현재의 충전 방식이 최상위 충전 방식이 아닌 경우, 프로세스 G로 진행할 수 있다. 동작 1120에서 제한 신호가 발생하지 않거나, 발생 횟수가 미리 정의된 횟수 N을 초과하지 않는 경우, 현재의 컴퓨팅 시스템 200의 충전 상태는 매우 양호하다는 것을 의미할 수 있다. 즉, 컴퓨팅 시스템 200이 시스템 자원 을 적게 소모하거나, 컴퓨팅 시스템 200의 배터리 230이 완전 충전된 상태이거나, 외부 장치 300의 배터리 상황 이 좋은 경우일 수 있다. 이러한 경우, 컴퓨팅 시스템 200은 외부 장치 300으로 더 많은 충전 전류를 공급하는 것이 가능하다. 그러나 현재 충전 방식이 최상위 충전 방식, 즉 시스템 200 또는 외부 장치 300이 지원하는 가 장 많은 전류가 공급되고 있는 경우라면, 충전 방식은 그대로 유지될 수 있다. 만약, 현재 충전 방식이 최상위 충전 방식이 아닌 경우에, 충전 방식을 상위 방식으로 변경하기 위한 프로세스 G로 진행할 수 있다. 다시 동작 1130으로 돌아가서, 제한 신호의 발생 횟수가 미리 정의된 횟수 N을 초과하는 경우, 동작 1140에서 보호 알람 신호가 발생할 수 있다. 보호 알람 신호가 발생하면, 동작 1150에서 현재 충전 방식이 최하위 충전 방식(예를 들어, 저속 충전 모드)인지 판단될 수 있다. 현재 충전 방식이 최하위 충전 방식이 아닌 경우, 충전 방식을 한 단계 하향 조정하기 위한 프로세스 E로 진행할 수 있다. 만약 현재 충전 방식이 최하위 충전 방식인 경우, 최하위 충전 방식을 이용하는 경우에도 컴퓨팅 시스템 200 또는 어댑터 100에 제한 상황이 발생한다는 것 을 의미하므로, 동작 1160에서 외부 장치 300의 충전이 중단될 수 있다. 도 12는 도 11에 도시된 프로세스의 후속 프로세스를 나타낸다. 도 11의 동작 1170에서 현재 충전 방식이 최상위 방식이 아닌 경우, 프로세스 G로 진행할 수 있다. 도 12를 참 조하면, 동작 1230에서, 현재 충전 방식으로 충전을 시작한 후 소정 시간 t가 경과하였는지 판단될 수 있다. 만 약 소정 시간 t가 경과하였다면, 동작 1240으로 진행할 수 있다. 동작 1240에서 현재 충전 방식이 한 단계 상위 충전 방식으로 조정될 수 있다. 그러나 도 7 및 도 8의 예시에서 와 같이, 사용자에 의해 설정된 충전 방식이 있는 경우, 복수 개의 상위 충전 방식 중 어느 하나의 충전 방식으 로 충전 방식이 상향 조정될 수 있다. 도 11의 동작 1150에서, 현재 충전 방식이 최하위 충전 방식이 아닌 경우, 프로세스 E로 진행할 수 있다. 도 12 를 참조하면, 동작 1210에서 충전 방식이 하향 조정될 수 있다. 동작 1220에서 변경된 충전 방식이 최하위 충전 방식인지 여부가 판단될 수 있다. 만약에 하향 조정된 충전 방식이 최하위 충전 방식인 경우, 동작 1230에서 소 정 시간 t가 경과하였는지 판단되고, 충전 방식이 변경된 시점부터 소정 시간 t가 경과하였다면, 동작 1240에서 충전 방식이 상향 조정될 수 있다. 그러나 동작 1220에서 하향 조정된 충전 방식이 최하위 충전 방식이 아닌 경 우, 프로세스 F로 진행하여 컴퓨팅 시스템 200 내부의 전류 및 전압 모니터링 프로세스가 수행될 수 있다. 이는 도 7 및 도 8에서 설명된 실시 예에 일부 대응될 수 있다. 그러나 일부 실시 예에서, 동작 1220과 동작 1230 사이에서도 모니터링 동작이 수행될 수 있다. 즉, 도 11에서 전술한 바와 같이, 변경된 충전 방식이 최하위 충전 방식인 경우에도, 모니터링 동작을 수행하고, 최하위 충전 방식으로 외부 장치 300을 충전하는 중에도 보호 알람 신호가 발생하면, 충전을 중단할 수 있다. 다양한 실시 예에 따른 컴퓨팅 시스템의 충전 제어 방법은, 상기 컴퓨팅 시스템에 연결된 외부 장치에 대한 충 전 방식을 결정하는 동작; 상기 충전 방식에 따라 상기 외부 장치를 충전하는 동작; 상기 컴퓨팅 시스템 내부의 전류 및 전압을 모니터링 하는 동작; 및 상기 모니터링 결과에 기반하여 상기 충전 방식을 변경하는 동작을 포 함할 수 있다. 다양한 실시 예에 따른 충전 방식을 결정하는 동작은, 사용자에게 선택 가능한 복수 개의 충전 모드를 제시하는 (present) 동작; 상기 복수 개의 충전 모드 중 하나의 모드를 선택하는 사용자 입력을 수신하는 동작; 및 상기 선택된 모드를 상기 충전 방식으로 결정하는 동작을 포함할 수 있다. 또한 상기 충전 방식을 결정하는 동작은, 상기 컴퓨팅 시스템의 시스템 부하, 상기 컴퓨팅 시스템에 포함된 자체 배터리 충전 상황, 및 상기 외부 장치의 동작 상태 중 적어도 하나에 기반하여 충전 방식을 자동으로 결정할 수 있다. 또한 상기 충전 방식을 결정하는 동작은, 사용자에게 선택 가능한 충전 전류의 범위를 제시하는 동작; 상기 충전 전류의 범위에 해당하는 특정 전류 값에 대한 사용자 입력을 수신하는 동작; 및 상기 수신된 사용자 입력에 기반하여, 상기 특정 전류 값에 따라 충전 방식을 결정하는 동작을 포함할 수 있다. 다양한 실시 예에 따른 상기 모니터링 하는 동작은, 상기 컴퓨팅 시스템에 전기적으로 연결되고 상기 컴퓨팅 시 스템으로 전원을 공급하는 어댑터에 의한 입력 전류를 모니터링 하는 동작 또는 상기 컴퓨팅 시스템의 시스템 전압을 모니터링 하는 동작 중 적어도 하나의 동작을 포함할 수 있다. 또한 상기 모니터링 하는 동작은, 상기 컴퓨팅 시스템에 전기적으로 연결되고 상기 컴퓨팅 시스템으로 전원을 공급하는 어댑터에 의한 입력 전류를 모 니터링 하는 동작; 및 상기 컴퓨팅 시스템의 시스템 전압을 모니터링 하는 동작 중 적어도 하나의 동작을 포함 할 수 있다. 다양한 실시 예에 따른 상기 충전 방식을 변경하는 동작은, 상기 모니터링 결과, 상기 전류가 기준 전류 값을 초과하거나, 상기 전압이 기준 전압 미만인 경우가 미리 정의된 횟수 이상 발생하는 경우, 상기 충전 방식을 하 위 단계의 충전 방식으로 변경할 수 있다. 또한 상기 충전 방식을 변경하는 동작은, 상기 모니터링 결과, 상기 전류가 기준 전류 값을 초과하거나 상기 전압이 기준 전압 미만인 경우가 미리 정의된 시간 동안 발생하지 않는 경우, 상기 충전 방식을 상위 단계의 충전 방식으로 변경할 수 있다. 다양한 실시 예에 따른 상기 입력 전류를 모니터링 하는 동작은, 상기 입력 전류를 전압으로 변환하고, 상기 변 환된 전압이 임계 전압을 초과하는지 여부를 모니터링 할 수 있다. 다양한 실시 예에 따른 상기 시스템 전압을 모니터링 하는 동작은, 상기 시스템 전압이 기준 전압 이하에서 감 지되는지 여부를 모니터링 할 수 있다. 다양한 실시 예에 따른 컴퓨팅 시스템과 연결된 외부 장치의 충전 방식을 제어하는 방법은, 제1 충전 방식으로 상기 외부 장치를 충전하는 동작; 상기 컴퓨팅 시스템 내부의 전류 및 전압을 모니터링 하는 동작; 및 상기 모 니터링 결과에 기반하여 상기 제1 충전 방식을 제2 충전 방식으로 변경하는 동작을 포함할 수 있다. 다양한 실시 예에 따른 상기 전류 및 전압을 모니터링 하는 동작은, 미리 정의된 조건에 따라 어댑터 제한 알람 신호를 생성하는 동작; 및 상기 어댑터 알림 신호가 기준 횟수 이상 감지되는 경우, 보호 알람 신호를 생성하는 동작을 포함할 수 있다. 이 경우 상기 제2 충전 방식은 상기 제1 충전 방식보다 하위 충전 방식일 수 있다. 다양한 실시 예에 따른 상기 어댑터 제한 알람 신호는, 상기 컴퓨팅 시스템으로 제공되는 입력 전류가 임계 값 이상으로 감지되거나, 상기 컴퓨팅 시스템의 시스템 전압이 기준 값 이하로 감지되는 경우 발생할 수 있다. 또 한 상기 어댑터 제한 알림 신호는 제1 시간 동안 유지될 수 있다. 다양한 실시 예에 따른 상기 보호 알람 신호는 상기 어댑터 제한 알림 신호가 제2 시간 간격으로 상기 기준 횟 수 이상 감지되는 경우 생성될 수 있다. 또한 상기 보호 알람 신호는 제3 시간 동안 유지되고, 상기 제3 시간 동안 상기 제2 충전 방식은 변경되지 않을 수 있다. 다양한 실시 예에 따라, 상기 모니터링 결과가 상기 충전 방식의 하향 조정을 지시하는 경우, 상기 제2 충전 방 식은 상기 제1 충전 방식에 대하여 하위 충전 방식이고, 상기 모니터링 결과가 상기 충전 방식의 상향 조정을 지시하는 경우, 상기 제2 충전 방식은 상기 제1 충전 방식에 대하여 상위 충전 방식일 수 있다. 다양한 실시 예에 따라, 상기 모니터링 결과가 상기 충전 방식의 하향 조정을 지시하고, 상기 제1 충전 방식이 최하위 충전 방식인 경우, 상기 외부 장치의 충전을 중단할 수 있다. 또한 상기 모니터링 결과가 상기 충전 방 식의 상향 조정을 지시하고, 상기 제1 충전 방식이 최상위 충전 방식인 경우, 상기 제2 충전 방식은 상기 제1 충전 방식과 동일한 충전 방식일 수 있다. 도 13은 다양한 실시 예들에 따른 전자 장치의 블록도를 도시한다.11 도 13의 도면 부호는 출원시에 수정하도록 하겠습니다. 도 13을 참조하면, 상기 전자 장치 1300은 하나 이상의 어플리케이션 프로세서(AP: application processor) 1310, 통신 모듈 1320, SIM(subscriber identification module) 카드 1324, 메모리 1330, 센서 모듈 1340, 입 력 장치 1350, 디스플레이 1360, 인터페이스 1370, 오디오 모듈 1380, 카메라 모듈 1391, 전력 관리 모듈 1395, 배터리 1396, 인디케이터 1397 및 모터 1398을 포함할 수 있다. 상기 AP 1310은 운영체제 또는 응용 프로그램을 구동하여 상기 AP 1310에 연결된 다수의 하드웨어 또는 소프트 웨어 구성요소들을 제어할 수 있고, 멀티미디어 데이터를 포함한 각종 데이터 처리 및 연산을 수행할 수 있다. 상기 AP 1310은, 예를 들면, SoC(system on chip)로 구현될 수 있다. 한 실시 예에 따르면, 상기 AP 1310은 GPU(graphic processing unit, 미도시)를 더 포함할 수 있다. 상기 통신 모듈 1320은 상기 전자 장치 1300과 네트워크를 통해 연결된 다른 전자 장치들간의 통신에서 데이터 송수신을 수행할 수 있다. 한 실시 예에 따르면, 상기 통신 모듈 1320은 셀룰러 모듈 1321, Wifi 모듈 1323, BT 모듈 1325, GPS 모듈 1327, NFC 모듈 1328 및 RF(radio frequency) 모듈 1329를 포함할 수 있다. 상기 셀룰러 모듈 1321은 통신망(예: LTE, LTE-A, CDMA, WCDMA, UMTS, WiBro 또는 GSM 등)을 통해서 음성 통화, 영상 통화, 문자 서비스 또는 인터넷 서비스 등을 제공할 수 있다. 또한, 상기 셀룰러 모듈 1321은, 예를 들면, 가입자 식별 모듈(예: SIM 카드 1324)을 이용하여 통신 네트워크 내에서 전자 장치의 구별 및 인증을 수 행할 수 있다. 한 실시 예에 따르면, 전자 장치의 구별을 위해 가입자 식별 모듈 대신 전자 장치를 구동하는 운 영체제의 시리얼 번호, 또는 전자 장치의 메인보드에 탑재된 식별 정보 등이 이용될 수 있다. 한 실시 예에 따 르면, 상기 셀룰러 모듈 1321은 상기 AP 1310이 제공할 수 있는 기능 중 적어도 일부 기능을 수행할 수 있다. 예를 들면, 상기 셀룰러 모듈 1321은 멀티 미디어 제어 기능의 적어도 일부를 수행할 수 있다. 한 실시 예에 따르면, 상기 셀룰러 모듈 1321은 커뮤니케이션 프로세서(CP: communication processor)를 포함할 수 있다. 또한, 상기 셀룰러 모듈 1321은, 예를 들면, SoC로 구현될 수 있다. 도 13에서는 상기 셀룰러 모듈 1321(예: 커뮤니케이션 프로세서), 상기 메모리 1330, 또는 상기 전력관리 모듈 1395 등의 구성요소들이 상기 AP 1310와 별개의 구성요소로 도시되어 있으나, 한 실시 예에 따르면, 상기 AP 1310이 전술한 구성요소들의 적 어도 일부(예: 셀룰러 모듈 1321)를 포함하도록 구현될 수 있다. 한 실시 예에 따르면, 상기 AP 1310 또는 상기 셀룰러 모듈 1321(예: 커뮤니케이션 프로세서)은 각각에 연결된 비 휘발성 메모리 또는 다른 구성요소 중 적어도 하나로부터 수신한 명령 또는 데이터를 휘발성 메모리에 로드 (load)하여 처리할 수 있다. 또한, 상기 AP 1310 또는 상기 셀룰러 모듈 1321은 다른 구성요소 중 적어도 하나 로부터 수신하거나 다른 구성요소 중 적어도 하나에 의해 생성된 데이터를 비 휘발성 메모리에 저장(store)할 수 있다. 상기 Wifi 모듈 1323, 상기 BT 모듈 1325, 상기 GPS 모듈 1327 또는 상기 NFC 모듈 1328 각각은, 예를 들면, 해당하는 모듈을 통해서 송수신되는 데이터를 처리하기 위한 프로세서를 포함할 수 있다. 도 13에서는 셀룰러 모듈 1321, Wifi 모듈 1323, BT 모듈 1325, GPS 모듈 1327 또는 NFC 모듈 1328이 각각 별개의 블록으로 도시되 었으나, 한 실시 예에 따르면, 셀룰러 모듈 1321, Wifi 모듈 1323, BT 모듈 1325, GPS 모듈 1327 또는 NFC 모 듈 1328 중 적어도 일부(예: 두 개 이상)는 하나의 통합칩(integrated chip, IC) 또는 IC 패키지 내에 포함될 수 있다. 예를 들면, 셀룰러 모듈 1321, Wifi 모듈 1323, BT 모듈 1325, GPS 모듈 1327 또는 NFC 모듈 1328 각 각에 대응하는 프로세서들 중 적어도 일부(예: 셀룰러 모듈 1321에 대응하는 커뮤니케이션 프로세서 및 Wifi 모 듈 1323에 대응하는 Wifi 프로세서)는 하나의 SoC로 구현될 수 있다. 상기 RF 모듈 1329는 데이터의 송수신, 예를 들면, RF 신호의 송수신을 할 수 있다. 상기 RF 모듈 1329는, 도시 되지는 않았으나, 예를 들면, 트랜시버(transceiver), PAM(power amp module), 주파수 필터(frequency filter) 또는 LNA(low noise amplifier) 등을 포함할 수 있다. 또한, 상기 RF 모듈 1329는 무선 통신에서 자유 공간상 의 전자파를 송수신하기 위한 부품, 예를 들면, 도체 또는 도선 등을 더 포함할 수 있다. 도 13에서는 셀룰러 모듈 1321, Wifi 모듈 1323, BT 모듈 1325, GPS 모듈 1327 및 NFC 모듈 1328이 하나의 RF 모듈 1329을 서로 공 유하는 것으로 도시되어 있으나, 한 실시 예에 따르면, 셀룰러 모듈 1321, Wifi 모듈 1323, BT 모듈 1325, GPS 모듈 1327 또는 NFC 모듈 1328 중 적어도 하나는 별개의 RF 모듈을 통하여 RF 신호의 송수신을 수행할 수 있다. 상기 SIM 카드 1324는 가입자 식별 모듈을 포함하는 카드일 수 있으며, 전자 장치의 특정 위치에 형성된 슬롯에 삽입될 수 있다. 상기 SIM 카드 1324는 고유한 식별 정보(예: ICCID(integrated circuit card identifier)) 또 는 가입자 정보(예: IMSI(international mobile subscriber identity))를 포함할 수 있다. 상기 메모리 1330은 내장 메모리 1332 또는 외장 메모리 1334를 포함할 수 있다. 상기 내장 메모리 1332는, 예 를 들면, 휘발성 메모리(예를 들면, DRAM(dynamic RAM), SRAM(static RAM), SDRAM(synchronous dynamic RAM)등) 또는 비 휘발성 메모리(non-volatile Memory, 예를 들면, OTPROM(one time programmable ROM), PROM(programmable ROM), EPROM(erasable and programmable ROM), EEPROM(electrically erasable and programmable ROM), mask ROM, flash ROM, NAND flash memory, NOR flash memory 등) 중 적어도 하나를 포함할 수 있다. 한 실시 예에 따르면, 상기 내장 메모리 1332는 Solid State Drive(SSD)일 수 있다. 상기 외장 메모리 1334는 플래시 드라이브(flash drive), 예를 들면, CF(compact flash), SD(secure digital), Micro-SD(micro secure digital), Mini-SD(mini secure digital), xD(extreme digital) 또는 메모리 스틱(Memory Stick) 등을 더 포함 할 수 있다. 상기 외장 메모리 1334는 다양한 인터페이스를 통하여 상기 전자 장치 1300과 기능적으로 연결될 수 있다. 한 실시 예에 따르면, 상기 전자 장치 1300은 하드 드라이브와 같은 저장 장치(또는 저장 매체)를 더 포함할 수 있다. 상기 센서 모듈 1340은 물리 량을 계측하거나 전자 장치 1300의 작동 상태를 감지하여, 계측 또는 감지된 정보 를 전기 신호로 변환할 수 있다. 상기 센서 모듈 1340은, 예를 들면, 제스처 센서 1340A, 자이로 센서 1340B, 기압 센서 1340C, 마그네틱 센서 1340D, 가속도 센서 1340E, 그립 센서 1340F, 근접 센서 1340G, color 센서 1340H(예: RGB(red, green, blue) 센서), 생체 센서 1340I, 온/습도 센서 1340J, 조도 센서 1340K 또는 UV(ultra violet) 센서 1340M 중의 적어도 하나를 포함할 수 있다. 추가적으로 또는 대체적으로, 상기 센서 모 듈 1340은, 예를 들면, 후각 센서(E-nose sensor, 미도시), EMG 센서(electromyography sensor, 미도시), EEG 센서(electroencephalogram sensor, 미도시), ECG 센서(electrocardiogram sensor, 미도시), IR(infra red) 센 서(미도시), 홍채 센서(미도시) 또는 지문 센서(미도시) 등을 포함할 수 있다. 상기 센서 모듈 1340은 그 안에 속한 적어도 하나 이상의 센서들을 제어하기 위한 제어 회로를 더 포함할 수 있다. 상기 입력 장치 1350은 터치 패널(touch panel) 1352, (디지털) 펜 센서(pen sensor) 1354, 키(key) 1356 또는 초음파(ultrasonic) 입력 장치 1358를 포함할 수 있다. 상기 터치 패널 1352는, 예를 들면, 정전식, 감압식, 적 외선 방식 또는 초음파 방식 중 적어도 하나의 방식으로 터치 입력을 인식할 수 있다. 또한, 상기 터치 패널 1352는 제어 회로를 더 포함할 수도 있다. 정전식의 경우, 물리적 접촉 또는 근접 인식이 가능하다. 상기 터치 패널 1352는 택타일 레이어(tactile layer)를 더 포함할 수도 있다. 이 경우, 상기 터치 패널 1352는 사용자에 게 촉각 반응을 제공할 수 있다. 상기 (디지털) 펜 센서 1354는, 예를 들면, 사용자의 터치 입력을 받는 것과 동일 또는 유사한 방법 또는 별도 의 인식용 시트(sheet)를 이용하여 구현될 수 있다. 상기 키 1356는, 예를 들면, 물리적인 버튼, 광학식 키 또 는 키패드를 포함할 수 있다. 상기 초음파(ultrasonic) 입력 장치 1358는 초음파 신호를 발생하는 입력 도구를 통해, 전자 장치 1300에서 마이크(예: 마이크 1388)로 음파를 감지하여 데이터를 확인할 수 있는 장치로서, 무 선 인식이 가능하다. 한 실시 예에 따르면, 상기 전자 장치 1300은 상기 통신 모듈 1320을 이용하여 이와 연결 된 외부 장치(예: 컴퓨터 또는 서버)로부터 사용자 입력을 수신할 수도 있다. 상기 디스플레이 1360은 패널 1362, 홀로그램 장치 1364 또는 프로젝터 1366을 포함할 수 있다. 상기 패널 1362 는, 예를 들면, LCD(liquid-crystal display) 또는 AM-OLED(active-matrix organic light-emitting diode) 등 일 수 있다. 상기 패널 1362는, 예를 들면, 유연하게(flexible), 투명하게(transparent) 또는 착용할 수 있게 (wearable) 구현될 수 있다. 상기 패널 1362는 상기 터치 패널 1352과 하나의 모듈로 구성될 수도 있다. 상기 홀로그램 장치 1364는 빛의 간섭을 이용하여 입체 영상을 허공에 보여줄 수 있다. 상기 프로젝터 1366는 스크린 에 빛을 투사하여 영상을 표시할 수 있다. 상기 스크린은, 예를 들면, 상기 전자 장치 1300의 내부 또는 외부에 위치할 수 있다. 한 실시 예에 따르면, 상기 디스플레이 1360은 상기 패널 1362, 상기 홀로그램 장치 1364, 또 는 프로젝터 1366를 제어하기 위한 제어 회로를 더 포함할 수 있다. 상기 인터페이스 1370은, 예를 들면, HDMI(high-definition multimedia interface) 1372, USB(universal serial bus) 1374, 광 인터페이스(optical interface) 1376 또는 D-sub(D-subminiature) 1378를 포함할 수 있 다. 추가적으로 또는 대체적으로, 상기 인터페이스 1370은, 예를 들면, MHL(mobile high-definition link) 인 터페이스, SD(secure Digital) 카드/MMC(multi-media card) 인터페이스 또는 IrDA(infrared data association) 규격 인터페이스를 포함할 수 있다. 상기 오디오 모듈 1380은 소리(sound)와 전기신호를 쌍방향으로 변환시킬 수 있다. 상기 오디오 모듈 1380은, 예를 들면, 스피커 1382, 리시버 1384, 이어폰 1386 또는 마이크 1388 등을 통해 입력 또는 출력되는 소리 정보 를 처리할 수 있다. 상기 카메라 모듈 1391은 정지 영상 및 동영상을 촬영할 수 있는 장치로서, 한 실시 예에 따르면, 하나 이상의 이미지 센서(예: 전면 센서 또는 후면 센서), 렌즈(미도시), ISP(image signal processor, 미도시) 또는 플래 시 (flash, 미도시)(예: LED 또는 xenon lamp)를 포함할 수 있다. 상기 전력 관리 모듈 1395은 상기 전자 장치 1300의 전력을 관리할 수 있다. 도시하지는 않았으나, 상기 전력 관리 모듈 1395은, 예를 들면, PMIC(power management integrated circuit), 충전 IC(charger integrated circuit) 또는 배터리 또는 연료 게이지(battery or fuel gauge)를 포함할 수 있다. 상기 PMIC는, 예를 들면, 집적회로 또는 SoC 반도체 내에 탑재될 수 있다. 충전 방식은 유선과 무선으로 구분될 수 있다. 상기 충전 IC는 배터리를 충전시킬 수 있으며, 충전기로부터의 과전압 또는 과전류 유입을 방지할 수 있다. 한 실시 예에 따르면, 상기 충전 IC는 유선 충전 방식 또는 무선 충전 방식 중 적어도 하나를 위한 충전 IC를 포함할 수 있다. 무선 충전 방식으로는, 예를 들면, 자기공명 방식, 자기유도 방식 또는 전자기파 방식 등 이 있으며, 무선 충전을 위한 부가적인 회로, 예를 들면, 코일 루프, 공진 회로 또는 정류기 등의 회로가 추가 될 수 있다. 상기 배터리 게이지는, 예를 들면, 상기 배터리 1396의 잔량, 충전 중 전압, 전류 또는 온도를 측정할 수 있다. 상기 배터리 1396는 전기를 저장 또는 생성할 수 있고, 그 저장 또는 생성된 전기를 이용하여 상기 전자 장치 1300에 전원을 공급할 수 있다. 상기 배터리 1396는, 예를 들면, 충전식 전지(rechargeable battery) 또는 태 양 전지(solar battery)를 포함할 수 있다. 상기 인디케이터 1397는 상기 전자 장치 1300 혹은 그 일부(예: 상기 AP 1310)의 특정 상태, 예를 들면, 부팅 상태, 메시지 상태 또는 충전 상태 등을 표시할 수 있다. 상기 모터 1398는 전기적 신호를 기계적 진동으로 변 환할 수 있다. 도시되지는 않았으나, 상기 전자 장치 1300은 모바일 TV 지원을 위한 처리 장치(예: GPU)를 포함 할 수 있다. 상기 모바일 TV지원을 위한 처리 장치는, 예를 들면, DMB(digital multimedia broadcasting), DVB(digital video broadcasting) 또는 미디어 플로우(media flow) 등의 규격에 따른 미디어 데이터를 처리할 수 있다. 다양한 실시 예에 따른 외부 장치의 충전 방식을 제어하기 위한 컴퓨팅 시스템은, 상기 외부 장치와 연결을 제 공하는 외부 포트; 어댑터로부터 제공되는 입력 전류를 모니터링 하기 위한 입력 전류 모니터링부; 상기 컴퓨팅 시스템의 시스템 전압을 모니터링 하기 위한 시스템 전압 모니터링 부; 상기 입력 전류 모니터링부에 의해 모니 터링 된 상기 입력 전류와 상기 시스템 전압 모니터링부에 의해 모니터링된 상기 시스템 전압에 따라 어댑터 제 한 알람 신호를 발생시키는 트리거 회로부; 및 상기 트리거 회로부에 의해 발생되는 상기 어댑터 제한 알람 신 호를 감지하는 컨트롤러를 포함하고, 상기 컨트롤러는 상기 어댑터 제한 알람 신호에 기반하여 상기 외부 장치 를 충전하는 충전 방식을 변경할 수 있다. 또한 상기 컨트롤러는 상기 어댑터 제한 알람 신호가 미리 정해진 시간 간격으로 기준 횟수를 초과하여 감지되 는 경우 보호 알람 신호를 생성하고, 상기 보호 알람 신호에 따라 상기 충전 방식을 하위 충전 방식으로 변경할 수 있다. 또한 상기 컨트롤러는, 미리 정의된 시간 동안, 상기 어댑터 제한 알림 신호가 기준 횟수 이하로 발생하는 경우, 상기 충전 방식을 하위 충전 방식으로 변경할 수 있다. 또한 상기 컨트롤러는 상기 외부 장치의 배터리 잔량의 RSOC(Relative State of Charge) 변화량에 기반하여 충 전 방식을 변경할 수 있다. 또한 상기 컴퓨팅 시스템은, 디스플레이 장치 및 입력 장치를 더 포함하고, 상기 외부 장치가 상기 외부 포트에 연결되면, 선택 가능한 복수 개의 충전 방식을 상기 디스플레이 장치에 디스플레이 하고, 상기 입력 장치를 통 해 수신된 사용자 입력에 따라, 상기 복수 개의 충전 방식 중 하나의 충전 방식을 상기 외부 장치에 대한 충전 방식으로 결정할 수 있다. 또한 상기 디스플레이 장치와 상기 입력 장치는 하나의 터치 디스플레이 패널로 구현 될 수 있다. 또한 상기 컨트롤러는 상기 충전 방식이 고속 충전 방식으로 결정되는 경우, 상기 외부 장치로 변경된 충전 방 식에 대한 제어 신호를 전송하고, 상기 제어 신호는 상기 외부 장치에서 상기 고속 충전 방식에 따른 배터리 충 전을 위한 설정을 위해 이용될 수 있다 본 발명의 다양한 실시 예에 따른 전자 장치의 전술한 구성요소들 각각은 하나 또는 그 이상의 부품(componen t)으로 구성될 수 있으며, 해당 구성 요소의 명칭은 전자 장치의 종류에 따라서 달라질 수 있다. 본 발명의 다 양한 실시 예에 따른 전자 장치는 전술한 구성요소 중 적어도 하나를 포함하여 구성될 수 있으며, 일부 구성요 소가 생략되거나 또는 추가적인 다른 구성요소를 더 포함할 수 있다. 또한, 본 발명의 다양한 실시 예에 따른 전자 장치의 구성 요소들 중 일부가 결합되어 하나의 개체(entity)로 구성됨으로써, 결합되기 이전의 해당 구성 요소들의 기능을 동일하게 수행할 수 있다. 본 발명의 다양한 실시 예에 사용된 용어 \"모듈\"은, 예를 들어, 하드웨어, 소프트웨어 또는 펌웨어(firmware) 중 하나 또는 둘 이상의 조합을 포함하는 단위(unit)를 의미할 수 있다. \"모듈\"은 예를 들어, 유닛(unit), 로직 (logic), 논리 블록(logical block), 부품(component) 또는 회로(circuit) 등의 용어와 바꾸어 사용 (interchangeably use)될 수 있다. \"모듈\"은, 일체로 구성된 부품의 최소 단위 또는 그 일부가 될 수 있다. \"모 듈\"은 하나 또는 그 이상의 기능을 수행하는 최소 단위 또는 그 일부가 될 수도 있다. \"모듈\"은 기계적으로 또 는 전자적으로 구현될 수 있다. 예를 들면, 본 발명의 다양한 실시 예에 따른 \"모듈\"은, 알려졌거나 앞으로 개 발될, 어떤 동작들을 수행하는 ASIC(application-specific integrated circuit) 칩, FPGAs(field-programmable gate arrays) 또는 프로그램 가능 논리 장치(programmable-logic device) 중 적어도 하나를 포함할 수 있다. 그리고 본 명세서와 도면에 개시된 실시 예들은 본 발명의 다양한 실시 예의 내용을 쉽게 설명하고, 이해를 돕 기 위해 특정 예를 제시한 것일 뿐이며, 본 발명의 다양한 실시 예의 범위를 한정하고자 하는 것은 아니다. 따 라서 본 발명의 다양한 실시 예의 범위는 여기에 개시된 실시 예들 이외에도 본 발명의 다양한 실시 예의 기술 적 사상을 바탕으로 도출되는 모든 변경 또는 변형된 형태가 본 발명의 다양한 실시 예의 범위에 포함되는 것으 로 해석되어야 한다."}
{"patent_id": "10-2014-0018713", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 다양한 실시 예에 따른 어댑터와 외부 장치가 연결된 컴퓨팅 시스템을 나타낸다. 도 2는 다양한 실시 예에 따른 전력 공급의 개념도를 나타낸다. 도 3은 다양한 실시 예에 따른 충전 방식 제어를 제공하는 컴퓨팅 시스템 및 외부 장치의 개념도를 나타낸다. 도 4는 다양한 실시 예에 따른 제어 회로의 구현 예시를 나타낸다. 도 5는 다양한 실시 예에 따른 각각의 회로에서 발생하는 알림 신호의 타이밍 관계를 나타낸다. 도 6은 다양한 실시 예에 따른 외부 장치의 충전 방식을 변경하는 프로세스를 나타낸다.도 7은 다양한 실시 예에 따른 외부 장치의 충전 방식을 변경하는 예시적인 프로세스의 일부를 나타낸다. 도 8은 도 7에 도시된 프로세스의 후속 프로세스를 나타낸다. 도 9는 다양한 실시 예에 따른 사용자 입력에 기반한 충전 방식이 결정되는 프로세스를 나타낸다. 도 10은 외부 장치의 충전 중 사용자 입력에 의해 충전 방식이 변경되는 프로세스를 나타낸다. 도 11은 다양한 실시 예에 따른 외부 장치의 충전 방식을 제어하는 일반적인 프로세스의 일부를 나타낸다. 도 12는 도 11에 도시된 프로세스의 후속 프로세스를 나타낸다. 도 13은 다양한 실시 예들에 따른 전자 장치의 블록도를 도시한다."}
