{"patent_id": "10-2021-0171236", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0032821", "출원번호": "10-2021-0171236", "발명의 명칭": "웹 페이지 작성 기능을 제공하기 위한 전자 장치 및 그 동작 방법", "출원인": "주식회사 메이드인리얼", "발명자": "신범진"}}
{"patent_id": "10-2021-0171236", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "웹 페이지 작성 기능을 제공하는 서버의 동작 방법으로서,클라이언트 서버가 접속되는 경우, 상기 클라이언트 서버로 홈 페이지 구성을 위한 인터페이스를 제공하는단계;상기 인터페이스에 표시되는 메인 홈 페이지 작성을 위한 화면에 기반하여, 상기 클라이언트 서버로부터 복수의기능들을 제공하도록 구현되는 복수의 메뉴 화면들을 포함하는 메인 홈 페이지에 대한 제 1 정보를 수신하는 단계;상기 인터페이스에 표시되는 메인 홈 페이지 작성을 위한 화면에 기반하여, 상기 클라이언트 서버로부터 상기메인 홈 페이지에 삽입될 컨텐트에 대한 정보를 수신하는 단계; 및상기 제 1 정보 및 상기 컨텐트에 대응하는 제 1 코드를 생성하여 상기 클라이언트 서버로 제공하는 단계;를 포함하는,동작 방법."}
{"patent_id": "10-2021-0171236", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 클라이언트의 업종을 식별하고, 상기 업종에 대응하는 법에 대한 정보를 획득하는 단계; 및상기 메인 홈 페이지에 삽입될 컨텐트 중 상기 법과 연관된 일부를 식별하고, 상기 식별된 일부에 대한 정보를상기 클라이언트 서버로 제공하는 단계;를 더 포함하는,동작 방법."}
{"patent_id": "10-2021-0171236", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서,상기 획득된 법에 대한 정보가 의료법에 대한 정보이고, 상기 획득된 컨텐트가 의료 상품에 대한 컨텐트인경우, 상기 의료 상품에 비급여 비용이 적용되는지 여부를 판단하는 단계; 상기 의료 상품에 비급여 비용이 적용되는 경우, 상기 컨텐트에 상기 비급여 비용에 대한 정보를 상기 클라이언트 서버로 요청하는 단계; 및상기 클라이언트 서버로부터 획득되는 상기 비급여 비용에 대한 정보를 상기 컨텐트에 포함시키는 단계;를 더포함하는,동작 방법."}
{"patent_id": "10-2021-0171236", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서,상기 메인 홈 페이지는 상기 클라이언트 서버에 대응되는 클라이언트의 사업의 본점과 연관되고,상기 제 1 코드는 상기 메인 홈 페이지로 접속되는 외부 전자 장치에 대한 정보를 수집하기 위한 제 1 추적 코드를 더 포함하고,상기 제 1 코드를 제공한 이후, 상기 인터페이스에 표시되는 상기 메인 홈 페이지 작성을 위한 화면에기반하여, 상기 메인 홈 페이지에 대한 복수의 서브 홈 페이지들에 대한 제 2 정보를 수신하는 단계;를 더 포함하고, 상기 복수의 서브 홈 페이지들은 상기 클라이언트의 사업의 지점들과 연관되고, 공개특허 10-2023-0032821-3-상기 제 2 정보에 대응하는 제 2 코드를 생성하여 상기 클라이언트 서버로 제공하는 단계;를 더 포함하고, 상기제 2 정보는 특정 인트라넷에 대한 정보를 포함하고, 상기 복수의 서브 홈 페이지로 접속되는 외부 전자 장치에대한 정보를 수집하기 위한 제 2 추적 코드를 더 포함하고,생성된 상기 메인 홈 페이지 및 생성된 상기 복수의 서브 홈 페이지들을 상기 특정 인트라넷에 연관되도록 설정하는 단계;를 더 포함하고, 상기 특정 인트라넷을 통해서 상기 생성된 메인 홈페이지 및 상기 생성된 복수의 서브 홈페이지들이 서로 정보를 공유하고,상기 특정 인트라넷에 연관되도록 설정된 상기 메인 홈페이지 및 상기 복수의 서브 홈페이지들을 포털 서버에등록하는 단계;를 더 포함하는,동작 방법."}
{"patent_id": "10-2021-0171236", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 4에 있어서,상기 서버에 저장된 정보들 중에서 상기 홈 페이지 및 상기 복수의 서브 홈 페이지들에 접속되는 사용자들의 나이에 대한 정보, 상기 사용자들의 성별에 대한 정보, 시간에 대한 정보, 또는 기종에 대한 정보 중 적어도 하나를 입력 데이터로 하고, 상기 사용자들에 의해 구매된 상품들에 대한 정보를 아웃풋 데이터로 하여, 인공 지능모델을 생성하는 단계;를 더 포함하고, 상기 인공 지능 모델은 특정 나이에 대한 정보, 특정 성별에 대한 정보,특정 시간에 대한 정보, 또는 특정 기종에 대한 정보 중 적어도 하나를 입력 받은 것에 대한 응답으로, 상품들별 가중치를 출력하도록 구현되고,상기 클라이언트 서버로부터 패키지 상품 생성을 위한 요청을 위한 메시지를 수신하는 단계;를 더 포함하고, 상기 요청을 위한 메시지는 제 1 나이에 대한 정보, 제 1 성별에 대한 정보, 제 1 시간에 대한 정보, 또는 제 1기종에 대한 정보 중 적어도 하나를 포함하고,상기 제 1 나이에 대한 정보, 제 1 성별에 대한 정보, 제 1 시간에 대한 정보, 또는 제 1 기종에 대한 정보 중적어도 하나를 상기 인공 지능 모델에 입력한 것에 대한 응답으로, 출력되는 상기 상품들 별 제 1 가중치를 식별하는 단계; 및상기 제 1 가중치에 기반하여 상기 상품들 중 일부를 선택하고, 상기 선택된 상품들 중 일부를 패키지로 구성하여 제공하는 단계;를 더 포함하는,동작 방법."}
{"patent_id": "10-2021-0171236", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 5에 있어서,상기 제 1 추적 코드 및 상기 제 2 추적 코드에 기반하여, 상기 사용자들의 나이에 대한 정보, 상기 사용자들의성별에 대한 정보, 상기 시간에 대한 정보, 또는 상기 기종에 대한 정보가 상기 데이터베이스에 축적되고,상기 클라이언트 서버로부터 가격 상한선에 대한 정보를 수신하는 단계;를 더 포함하고,상기 선택된 상품들 중 일부는 상기 가격 상한선보다 낮은 상품들인,동작 방법."}
{"patent_id": "10-2021-0171236", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 6에 있어서,상기 클라이언트 서버로부터 상기 제공된 패키지 상품을 생성하기 위한 입력을 수신하는 단계;상기 제 1 나이에 대한 정보, 제 1 성별에 대한 정보, 제 1 시간에 대한 정보, 또는 제 1 기종에 대한 정보 중적어도 하나에 기반하여 제목 텍스트를 생성하고, 상기 선택된 상품들에 대한 이미지를 획득하고, 상기 생성된텍스트 및 상기 이미지를 포함하는 컨텐트를 생성하는 단계; 및상기 메인 홈 페이지 또는 상기 복수의 서브 홈 페이지들로 접속이 발생되는 경우, 상기 컨텐트를 팝업 화면 형태로 제공하는 단계;를 더 포함하는,공개특허 10-2023-0032821-4-동작 방법."}
{"patent_id": "10-2021-0171236", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "웹 페이지 작성 기능 제공 서버로서,통신 회로; 및적어도 하나의 프로세서;를 포함하고, 상기 적어도 하나의 프로세서는:클라이언트 서버가 접속되는 경우, 상기 클라이언트 서버로 홈 페이지 구성을 위한 인터페이스를 제공하고,상기 인터페이스에 표시되는 메인 홈 페이지 작성을 위한 화면에 기반하여, 상기 클라이언트 서버로부터 복수의기능들을 제공하도록 구현되는 복수의 메뉴 화면들을 포함하는 메인 홈 페이지에 대한 제 1 정보를 수신하고,상기 인터페이스에 표시되는 메인 홈 페이지 작성을 위한 화면에 기반하여, 상기 클라이언트 서버로부터 상기메인 홈 페이지에 삽입될 컨텐트에 대한 정보를 수신하고,상기 제 1 정보 및 상기 컨텐트에 대응하는 제 1 코드를 생성하여 상기 클라이언트 서버로 제공하는,웹 페이지 작성 기능 제공 서버."}
{"patent_id": "10-2021-0171236", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "웹 페이지 작성 기능 제공 서버에 의해 수행되는 웹 페이지 작성 기능 제공 방법을 실행시키기 위한 프로그램을기록한 컴퓨터 판독 가능한 기록 매체로서,상기 웹 페이지 작성 기능 제공 방법은,클라이언트 서버가 접속되는 경우, 상기 클라이언트 서버로 홈 페이지 구성을 위한 인터페이스를 제공하는단계;상기 인터페이스에 표시되는 메인 홈 페이지 작성을 위한 화면에 기반하여, 상기 클라이언트 서버로부터 복수의기능들을 제공하도록 구현되는 복수의 메뉴 화면들을 포함하는 메인 홈 페이지에 대한 제 1 정보를 수신하는 단계;상기 인터페이스에 표시되는 메인 홈 페이지 작성을 위한 화면에 기반하여, 상기 클라이언트 서버로부터 상기메인 홈 페이지에 삽입될 컨텐트에 대한 정보를 수신하는 단계; 및상기 제 1 정보 및 상기 컨텐트에 대응하는 제 1 코드를 생성하여 상기 클라이언트 서버로 제공하는 단계;를 포함하는,컴퓨터 판독 가능한 기록 매체."}
{"patent_id": "10-2021-0171236", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "웹 페이지 작성 기능 제공 서버를 통해 웹 페이지 작성 기능 제공 방법을 수행하기 위한 컴퓨터 판독 가능한 기록 매체에 저장된 프로그램으로서,상기 웹 페이지 작성 기능 제공 방법은,클라이언트 서버가 접속되는 경우, 상기 클라이언트 서버로 홈 페이지 구성을 위한 인터페이스를 제공하는단계;상기 인터페이스에 표시되는 메인 홈 페이지 작성을 위한 화면에 기반하여, 상기 클라이언트 서버로부터 복수의기능들을 제공하도록 구현되는 복수의 메뉴 화면들을 포함하는 메인 홈 페이지에 대한 제 1 정보를 수신하는 단계;상기 인터페이스에 표시되는 메인 홈 페이지 작성을 위한 화면에 기반하여, 상기 클라이언트 서버로부터 상기메인 홈 페이지에 삽입될 컨텐트에 대한 정보를 수신하는 단계; 및상기 제 1 정보 및 상기 컨텐트에 대응하는 제 1 코드를 생성하여 상기 클라이언트 서버로 제공하는 단계;를 포공개특허 10-2023-0032821-5-함하는,프로그램."}
{"patent_id": "10-2021-0171236", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "일 실시예에 따르면, 웹 페이지 작성 기능을 제공하는 서버의 동작 방법으로서, 클라이언트 서버가 접속되는 경 우, 상기 클라이언트 서버로 홈 페이지 구성을 위한 인터페이스를 제공하는 단계, 상기 인터페이스에 표시되는 메인 홈 페이지 작성을 위한 화면에 기반하여, 상기 클라이언트 서버로부터 복수의 기능들을 제공하도록 구현되 는 복수의 메뉴 화면들을 포함하는 메인 홈 페이지에 대한 제 1 정보를 수신하는 단계, 상기 인터페이스에 표시 되는 메인 홈 페이지 작성을 위한 화면에 기반하여, 상기 클라이언트 서버로부터 상기 메인 홈 페이지에 삽입될 컨텐트에 대한 정보를 수신하는 단계 및 상기 제 1 정보 및 상기 컨텐트에 대응하는 제 1 코드를 생성하여 상기 클라이언트 서버로 제공하는 단계를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2021-0171236", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 출원은 웹 페이지 작성 기능을 제공하기 위한 전자 장치 및 그 동작 방법에 관한 것이다."}
{"patent_id": "10-2021-0171236", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "웹 페이지(web page, 문화어: 웨브페지)는 월드 와이드 웹 상에 있는 개개의 문서를 가리킨다. 이 문서도 역시 엄연한 웹 페이지이며, 따라서 현재 이 문서를 읽고 있다면 '웹 페이지를 보고 있다'고도 할 수 있다. 최 근에는 모바일 전자 기기의 활용이 증대됨에 따라서, PC 뿐만 아니라 모바일에서도 접속 가능한 언어로 웹 페이 지가 작성되고 있는 중이다. 사업자들은 웹 페이지를 생성하여 물품 또는 서비스를 판매하기 위한 컨텐트들을 웹 페이지에 구성하고, 웹 페 이지로 접속하는 소비자들(customers)과 전자 상거래를 수행할 수 있다. 다만 사업자들이 웹 페이지를 자체적으로 구성하는 데에는 어려움이 있으며, 특히 본점과 지점들에 대응하는 웹 페이지들을 서로 연관된 형태로 관리하는 데에 어려움이 있어, 이를 용이하게 하기 위한 기술의 구현이 필요하 다."}
{"patent_id": "10-2021-0171236", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 출원의 일 실시예에 따르면, 일 과제는 사업자의 본점과 지점들에 대응하는 웹 페이지들을 편리하게 작성 가 능한 인터페이스를 제공하고, 미리 마련된 인트라넷 네트워크로 웹 페이지들을 연결함으로써, 웹 페이지의 생성 과 관리 용의성을 향상시키는 전자 장치 및 동작 방법을 제공하는 것에 있다. 본 출원의 일 실시예에 따르면, 다른 과제는 서버에 축적된 빅 데이터를 이용하여, 사업자가 판매 가능한 패키 지 상품들을 묶어 추천함으로써, 사업의 효율성을 높이는 전자 장치 및 동작 방법을 제공하는 것에 있다. 본 출원의 일 실시예에 따르면, 또 다른 과제는 인공 지능 모델을 기반으로 패키지 상품들 중 일부 상품을 대체 하여 추천함으로써, 패키지 상품의 구성의 효율성을 높이는 전자 장치 및 동작 방법을 제공하는 것에 있다. 본 출원이 해결하고자 하는 과제가 상술한 과제로 제한되는 것은 아니며, 언급되지 아니한 과제들은 본 명세서"}
{"patent_id": "10-2021-0171236", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "및 첨부된 도면으로부터 본 출원이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0171236", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시예에 따르면, 웹 페이지 작성 기능을 제공하는 서버의 동작 방법으로서, 클라이언트 서버가 접속되는 경 우, 상기 클라이언트 서버로 홈 페이지 구성을 위한 인터페이스를 제공하는 단계, 상기 인터페이스에 표시되는 메인 홈 페이지 작성을 위한 화면에 기반하여, 상기 클라이언트 서버로부터 복수의 기능들을 제공하도록 구현되 는 복수의 메뉴 화면들을 포함하는 메인 홈 페이지에 대한 제 1 정보를 수신하는 단계, 상기 인터페이스에 표시 되는 메인 홈 페이지 작성을 위한 화면에 기반하여, 상기 클라이언트 서버로부터 상기 메인 홈 페이지에 삽입될 컨텐트에 대한 정보를 수신하는 단계 및 상기 제 1 정보 및 상기 컨텐트에 대응하는 제 1 코드를 생성하여 상기 클라이언트 서버로 제공하는 단계를 포함할 수 있다. 일 실시예에 따르면, 웹 페이지 작성 기능 제공 서버로서, 통신 회로 및 적어도 하나의 프로세서를 포함하고, 상기 적어도 하나의 프로세서는: 클라이언트 서버가 접속되는 경우, 상기 클라이언트 서버로 홈 페이지 구성을 위한 인터페이스를 제공하고, 상기 인터페이스에 표시되는 메인 홈 페이지 작성을 위한 화면에 기반하여, 상기 클라이언트 서버로부터 복수의 기능들을 제공하도록 구현되는 복수의 메뉴 화면들을 포함하는 메인 홈 페이지에 대한 제 1 정보를 수신하고, 상기 인터페이스에 표시되는 메인 홈 페이지 작성을 위한 화면에 기반하여, 상기 클라이언트 서버로부터 상기 메인 홈 페이지에 삽입될 컨텐트에 대한 정보를 수신하고, 상기 제 1 정보 및 상기컨텐트에 대응하는 제 1 코드를 생성하여 상기 클라이언트 서버로 제공할 수 있다. 일 실시예에 따르면, 웹 페이지 작성 기능 제공 서버에 의해 수행되는 웹 페이지 작성 기능 제공 방법을 실행시 키기 위한 프로그램을 기록한 컴퓨터 판독 가능한 기록 매체로서, 상기 웹 페이지 작성 기능 제공 방법은 클라 이언트 서버가 접속되는 경우, 상기 클라이언트 서버로 홈 페이지 구성을 위한 인터페이스를 제공하는 단계, 상 기 인터페이스에 표시되는 메인 홈 페이지 작성을 위한 화면에 기반하여, 상기 클라이언트 서버로부터 복수의 기능들을 제공하도록 구현되는 복수의 메뉴 화면들을 포함하는 메인 홈 페이지에 대한 제 1 정보를 수신하는 단 계, 상기 인터페이스에 표시되는 메인 홈 페이지 작성을 위한 화면에 기반하여, 상기 클라이언트 서버로부터 상 기 메인 홈 페이지에 삽입될 컨텐트에 대한 정보를 수신하는 단계 및 상기 제 1 정보 및 상기 컨텐트에 대응하 는 제 1 코드를 생성하여 상기 클라이언트 서버로 제공하는 단계를 포함할 수 있다. 일 실시예에 따르면, 웹 페이지 작성 기능 제공 서버를 통해 웹 페이지 작성 기능 제공 방법을 수행하기 위한 컴퓨터 판독 가능한 기록 매체에 저장된 프로그램으로서, 상기 웹 페이지 작성 기능 제공 방법은 클라이언트 서 버가 접속되는 경우, 상기 클라이언트 서버로 홈 페이지 구성을 위한 인터페이스를 제공하는 단계, 상기 인터페 이스에 표시되는 메인 홈 페이지 작성을 위한 화면에 기반하여, 상기 클라이언트 서버로부터 복수의 기능들을 제공하도록 구현되는 복수의 메뉴 화면들을 포함하는 메인 홈 페이지에 대한 제 1 정보를 수신하는 단계, 상기 인터페이스에 표시되는 메인 홈 페이지 작성을 위한 화면에 기반하여, 상기 클라이언트 서버로부터 상기 메인 홈 페이지에 삽입될 컨텐트에 대한 정보를 수신하는 단계 및 상기 제 1 정보 및 상기 컨텐트에 대응하는 제 1 코드를 생성하여 상기 클라이언트 서버로 제공하는 단계를 포함할 수 있다."}
{"patent_id": "10-2021-0171236", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "과제의 해결 수단이 상술한 해결 수단들로 제한되는 것은 아니며, 언급되지 아니한 해결 수단들은 본 명세서 및"}
{"patent_id": "10-2021-0171236", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 3, "content": "첨부된 도면으로부터 본 출원이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0171236", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 출원의 일 실시예에 따르면, 사업자의 본점과 지점들에 대응하는 웹 페이지들을 편리하게 작성 가능한 인터 페이스를 제공하고, 미리 마련된 인트라넷 네트워크로 웹 페이지들을 연결함으로써, 웹 페이지의 생성과 관리 용의성을 향상시킬 수 있다. 본 출원의 일 실시예에 따르면, 전자 장치 및 동작 방법은 서버에 축적된 빅 데이터를 이용하여, 사업자가 판매 가능한 패키지 상품들을 묶어 추천함으로써, 사업의 효율성을 향상시킬 수 있다. 본 출원의 일 실시예에 따르면, 전자 장치 및 동작 방법은 인공 지능 모델을 기반으로 패키지 상품들 중 일부 상품을 대체하여 추천함으로써, 패키지 상품의 구성의 효율성을 향상시킬 수 있다. 효과가 상술한 효과로 제한되는 것은 아니며, 언급되지 아니한 효과들은 본 명세서 및 첨부된 도면으로부터 본"}
{"patent_id": "10-2021-0171236", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "출원이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확히 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0171236", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "일 실시예에 따르면, 웹 페이지 작성 기능을 제공하는 서버의 동작 방법으로서, 클라이언트 서버가 접속되는 경 우, 상기 클라이언트 서버로 홈 페이지 구성을 위한 인터페이스를 제공하는 단계, 상기 인터페이스에 표시되는 메인 홈 페이지 작성을 위한 화면에 기반하여, 상기 클라이언트 서버로부터 복수의 기능들을 제공하도록 구현되 는 복수의 메뉴 화면들을 포함하는 메인 홈 페이지에 대한 제 1 정보를 수신하는 단계, 상기 인터페이스에 표시 되는 메인 홈 페이지 작성을 위한 화면에 기반하여, 상기 클라이언트 서버로부터 상기 메인 홈 페이지에 삽입될 컨텐트에 대한 정보를 수신하는 단계 및 상기 제 1 정보 및 상기 컨텐트에 대응하는 제 1 코드를 생성하여 상기 클라이언트 서버로 제공하는 단계를 포함할 수 있다. 예를 들어, 상기 동작 방법은 상기 클라이언트의 업종을 식별하고, 상기 업종에 대응하는 법에 대한 정보를 획 득하는 단계 및 상기 메인 홈 페이지에 삽입될 컨텐트 중 상기 법과 연관된 일부를 식별하고, 상기 식별된 일부 에 대한 정보를 상기 클라이언트 서버로 제공하는 단계를 더 포함할 수 있다. 예를 들어, 상기 동작 방법은 상기 획득된 법에 대한 정보가 의료법에 대한 정보이고, 상기 획득된 컨텐트가 의 료 상품에 대한 컨텐트인 경우, 상기 의료 상품에 비급여 비용이 적용되는지 여부를 판단하는 단계, 상기 의료 상품에 비급여 비용이 적용되는 경우, 상기 컨텐트에 상기 비급여 비용에 대한 정보를 상기 클라이언트 서버로 요청하는 단계 및 상기 클라이언트 서버로부터 획득되는 상기 비급여 비용에 대한 정보를 상기 컨텐트에 포함시 키는 단계를 더 포함할 수 있다. 예를 들어, 상기 메인 홈 페이지는 상기 클라이언트 서버에 대응되는 클라이언트의 사업의 본점과 연관되고, 상 기 제 1 코드는 상기 메인 홈 페이지로 접속되는 외부 전자 장치에 대한 정보를 수집하기 위한 제 1 추적 코드 를 더 포함하고, 상기 동작 방법은 상기 제 1 코드를 제공한 이후, 상기 인터페이스에 표시되는 상기 메인 홈 페이지 작성을 위한 화면에 기반하여, 상기 메인 홈 페이지에 대한 복수의 서브 홈 페이지들에 대한 제 2 정보 를 수신하는 단계를 더 포함하고, 상기 복수의 서브 홈 페이지들은 상기 클라이언트의 사업의 지점들과 연관되 고, 상기 동작 방법은 상기 제 2 정보에 대응하는 제 2 코드를 생성하여 상기 클라이언트 서버로 제공하는 단계 를 더 포함하고, 상기 제 2 정보는 특정 인트라넷에 대한 정보를 포함하고, 상기 복수의 서브 홈 페이지로 접속 되는 외부 전자 장치에 대한 정보를 수집하기 위한 제 2 추적 코드를 더 포함하고, 상기 동작 방법은 생성된 상 기 메인 홈 페이지 및 생성된 상기 복수의 서브 홈 페이지들을 상기 특정 인트라넷에 연관되도록 설정하는 단계 를 더 포함하고, 상기 특정 인트라넷을 통해서 상기 생성된 메인 홈페이지 및 상기 생성된 복수의 서브 홈페이 지들이 서로 정보를 공유하고, 상기 동작 방법은 상기 특정 인트라넷에 연관되도록 설정된 상기 메인 홈페이지 및 상기 복수의 서브 홈페이지들을 포털 서버에 등록하는 단계를 더 포함할 수 있다. 예를 들어, 상기 동작 방법은 상기 서버에 저장된 정보들 중에서 상기 홈 페이지 및 상기 복수의 서브 홈 페이 지들에 접속되는 사용자들의 나이에 대한 정보, 상기 사용자들의 성별에 대한 정보, 시간에 대한 정보, 또는 기 종에 대한 정보 중 적어도 하나를 입력 데이터로 하고, 상기 사용자들에 의해 구매된 상품들에 대한 정보를 아웃풋 데이터로 하여, 인공 지능 모델을 생성하는 단계를 더 포함하고, 상기 인공 지능 모델은 특정 나이에 대한 정보, 특정 성별에 대한 정보, 특정 시간에 대한 정보, 또는 특정 기종에 대한 정보 중 적어도 하나를 입력 받 은 것에 대한 응답으로, 상품들 별 가중치를 출력하도록 구현되고, 상기 동작 방법은 상기 클라이언트 서버로부 터 패키지 상품 생성을 위한 요청을 위한 메시지를 수신하는 단계를 더 포함하고, 상기 요청을 위한 메시지는 제 1 나이에 대한 정보, 제 1 성별에 대한 정보, 제 1 시간에 대한 정보, 또는 제 1 기종에 대한 정보 중 적어 도 하나를 포함하고, 상기 동작 방법은 상기 제 1 나이에 대한 정보, 제 1 성별에 대한 정보, 제 1 시간에 대한 정보, 또는 제 1 기종에 대한 정보 중 적어도 하나를 상기 인공 지능 모델에 입력한 것에 대한 응답으로, 출력 되는 상기 상품들 별 제 1 가중치를 식별하는 단계 및 상기 제 1 가중치에 기반하여 상기 상품들 중 일부를 선 택하고, 상기 선택된 상품들 중 일부를 패키지로 구성하여 제공하는 단계를 더 포함할 수 있다. 예를 들어, 상기 제 1 추적 코드 및 상기 제 2 추적 코드에 기반하여, 상기 사용자들의 나이에 대한 정보, 상기 사용자들의 성별에 대한 정보, 상기 시간에 대한 정보, 또는 상기 기종에 대한 정보가 상기 데이터베이스에 축 적되고, 상기 동작 방법은 상기 클라이언트 서버로부터 가격 상한선에 대한 정보를 수신하는 단계를 더 포함하 고, 상기 선택된 상품들 중 일부는 상기 가격 상한선보다 낮은 상품들일 수 있다. 예를 들어, 상기 동작 방법은 상기 클라이언트 서버로부터 상기 제공된 패키지 상품을 생성하기 위한 입력을 수 신하는 단계, 상기 제 1 나이에 대한 정보, 제 1 성별에 대한 정보, 제 1 시간에 대한 정보, 또는 제 1 기종에 대한 정보 중 적어도 하나에 기반하여 제목 텍스트를 생성하고, 상기 선택된 상품들에 대한 이미지를 획득하고, 상기 생성된 텍스트 및 상기 이미지를 포함하는 컨텐트를 생성하는 단계 및 상기 메인 홈 페이지 또는 상기 복 수의 서브 홈 페이지들로 접속이 발생되는 경우, 상기 컨텐트를 팝업 화면 형태로 제공하는 단계를 더 포함할 수 있다. 일 실시예에 따르면, 웹 페이지 작성 기능 제공 서버로서, 통신 회로 및 적어도 하나의 프로세서를 포함하고, 상기 적어도 하나의 프로세서는: 클라이언트 서버가 접속되는 경우, 상기 클라이언트 서버로 홈 페이지 구성을 위한 인터페이스를 제공하고, 상기 인터페이스에 표시되는 메인 홈 페이지 작성을 위한 화면에 기반하여, 상기 클라이언트 서버로부터 복수의 기능들을 제공하도록 구현되는 복수의 메뉴 화면들을 포함하는 메인 홈 페이지에 대한 제 1 정보를 수신하고, 상기 인터페이스에 표시되는 메인 홈 페이지 작성을 위한 화면에 기반하여, 상기 클라이언트 서버로부터 상기 메인 홈 페이지에 삽입될 컨텐트에 대한 정보를 수신하고, 상기 제 1 정보 및 상기 컨텐트에 대응하는 제 1 코드를 생성하여 상기 클라이언트 서버로 제공할 수 있다. 일 실시예에 따르면, 웹 페이지 작성 기능 제공 서버에 의해 수행되는 웹 페이지 작성 기능 제공 방법을 실행시 키기 위한 프로그램을 기록한 컴퓨터 판독 가능한 기록 매체로서, 상기 웹 페이지 작성 기능 제공 방법은 클라 이언트 서버가 접속되는 경우, 상기 클라이언트 서버로 홈 페이지 구성을 위한 인터페이스를 제공하는 단계, 상 기 인터페이스에 표시되는 메인 홈 페이지 작성을 위한 화면에 기반하여, 상기 클라이언트 서버로부터 복수의 기능들을 제공하도록 구현되는 복수의 메뉴 화면들을 포함하는 메인 홈 페이지에 대한 제 1 정보를 수신하는 단 계, 상기 인터페이스에 표시되는 메인 홈 페이지 작성을 위한 화면에 기반하여, 상기 클라이언트 서버로부터 상 기 메인 홈 페이지에 삽입될 컨텐트에 대한 정보를 수신하는 단계 및 상기 제 1 정보 및 상기 컨텐트에 대응하 는 제 1 코드를 생성하여 상기 클라이언트 서버로 제공하는 단계를 포함할 수 있다. 일 실시예에 따르면, 웹 페이지 작성 기능 제공 서버를 통해 웹 페이지 작성 기능 제공 방법을 수행하기 위한 컴퓨터 판독 가능한 기록 매체에 저장된 프로그램으로서, 상기 웹 페이지 작성 기능 제공 방법은 클라이언트 서 버가 접속되는 경우, 상기 클라이언트 서버로 홈 페이지 구성을 위한 인터페이스를 제공하는 단계, 상기 인터페 이스에 표시되는 메인 홈 페이지 작성을 위한 화면에 기반하여, 상기 클라이언트 서버로부터 복수의 기능들을 제공하도록 구현되는 복수의 메뉴 화면들을 포함하는 메인 홈 페이지에 대한 제 1 정보를 수신하는 단계, 상기 인터페이스에 표시되는 메인 홈 페이지 작성을 위한 화면에 기반하여, 상기 클라이언트 서버로부터 상기 메인 홈 페이지에 삽입될 컨텐트에 대한 정보를 수신하는 단계 및 상기 제 1 정보 및 상기 컨텐트에 대응하는 제 1 코드를 생성하여 상기 클라이언트 서버로 제공하는 단계를 포함할 수 있다. 본 명세서에 기재된 실시예는 본 출원이 속하는 기술 분야에서 통상의 지식을 가진 자에게 다양한 실시예들에 따르면, 사상을 명확히 설명하기 위한 것이므로, 본 출원이 본 명세서에 기재된 실시예에 의해 한정되는 것은 아니며, 다양한 실시예들에 따르면, 범위는 다양한 실시예들에 따르면, 사상을 벗어나지 아니하는 수정예 또는 변형예를 포함하는 것으로 해석되어야 한다. 본 명세서에서 사용되는 용어는 본 출원에서의 기능을 고려하여 가능한 현재 널리 사용되고 있는 일반적인 용어 를 선택하였으나 이는 본 출원이 속하는 기술 분야에서 통상의 지식을 가진 자의 의도, 관례 또는 새로운 기술의 출현 등에 따라 달라질 수 있다. 다만, 이와 달리 특정한 용어를 임의의 의미로 정의하여 사용하는 경우에는 그 용어의 의미에 관하여 별도로 기재할 것이다. 따라서 본 명세서에서 사용되는 용어는 단순한 용어의 명칭이 아닌 그 용어가 가진 실질적인 의미와 본 명세서의 전반에 걸친 내용을 토대로 해석되어야 한다. 본 명세서에 첨부된 도면은 본 출원을 용이하게 설명하기 위한 것으로 도면에 도시된 형상은 다양한 실시예들에 따르면, 이해를 돕기 위하여 필요에 따라 과장되어 표시된 것일 수 있으므로 본 출원이 도면에 의해 한정되는 것은 아니다. 본 명세서에서 본 출원에 관련된 공지의 구성 또는 기능에 대한 구체적인 설명이 다양한 실시예들에 따르면, 요 지를 흐릴 수 있다고 판단되는 경우에 이에 관한 자세한 설명은 필요에 따라 생략하기로 한다. 본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\",\"A 또는 B 중 적어도 하나,\"\"A, B 또 는 C,\" \"A, B 및 C 중 적어도 하나,\"및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해 당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \" 제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적 으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로 등의 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부가 될 수 있다. 예를 들 면, 일실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형태로 구현될 수 있다. 본 문서의 다양한 실시예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어 (예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것 을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장매체는, 비일시적(non-transitory) 저장매체의 형태 로 제공될 수 있다. 여기서, '비일시적'은 저장매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전자기 파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장매체에 반영구적으로 저장되는 경우와 임시적으로 저장되는 경우를 구분하지 않는다. 일실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두개의 사용자 장치들(예: 스 마트폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있다. 다양한 실시예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통 합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수 의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따르면, 모듈, 프로그램 또는 다른 구성요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로,또는 휴리스틱하게 실행되거나, 상기 동작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다. 1. 스마트 웹 페이지 생성 시스템 이하에서는 본 출원의 일 실시예에 따른 스마트 웹 페이지 생성 시스템에 대해서 설명한다. 본 명세서에서 스마트 웹 페이지 생성 시스템은 사업을 영위하고자 하는 사업자들(clients)이 이용할 수 있는 플랫폼으로서, 웹-페이지를 구성하여 구성된 웹-페이지의 스크립(및/또는 소스 코드)를 제공하는 시스템으로 정 의될 수 있다. 상기 사업을 영위하고자 하는 사업자들은 병원, 화장품, 동물 병원, 보험 회사 등의 사업체를 운 영하는 사업자들 및/또는 소상공인을 포함할 수 있다. 스마트 웹 페이지 생성 시스템은 사업자들의 요청에 따라 서, 본점에 대응하는 메인 홈 페이지와 각 지점들에 대응하는 서브 홈 페이지를 구성하고, 특정 인트라넷을 통 해서 메인 홈 페이지와 서브 홈 페이지를 서로 연결하여 제공할 수 있다. 사업자들은 메인 홈 페이지와 서브 홈 페이지를 통해서, 사업자가 판매하고자 하는 물품 및 서비스를 등록하여 사업을 영위할 수 있다. 이때, 스마트 웹 페이지 생성 시스템은 홈 페이지의 구성뿐만 아니라, 홈 페이지를 사용하는 사용자들(customers)에 대한 정 보를 축적 및/또는 관리하고 해당 정보를 기반으로 사업자에게 패키지 상품과 같은 사업 촉진을 위한 솔루션을 제공하는 동작을 더 수행할 수 있다. 이하에서는 스마트 웹 페이지 생성 시스템에 대해서 더 구체적으로 설명한다. 2. 스마트 웹 페이지 생성 시스템의 구성 도 1은 본 출원의 일 실시예에 따른 스마트 웹 페이지 생성 시스템에 포함된 장치들의 일 예를 설명하기 위한 도면이다. 도 1을 참조하면, 스마트 웹 페이지 생성 시스템은 관리 서버, 클라이언트 서브, 포털 서버 및 사용자들이 이용하는 전자 장치를 포함할 수 있다. 다만, 도 1에 도시된 바에 제한되지 않고 스마트 웹 페 이지 생성 시스템은 도시된 장치들 보다 더 적은 장치들을 포함하거나, 더 많은 장치들을 포함하도록 구현될 수 도 있다. 본 출원의 일 실시예에 따르면, 관리 서버(management server)는 웹-페이지(예: 메인(main) 홈 페이지 및 서브(sub) 홈 페이지)를 생성하여 관리하고, 다양한 종류의 정보를 축적할 수 있다. 예를 들어, 관리 서버(11 0)는 웹-페이지(예: 메인(main) 홈 페이지 및 서브(sub) 홈 페이지)를 생성 및/또는 관리하기 위한 인터페이스 를 클라이언트 서버로 제공하고, 클라이언트 서버로부터 수신되는 입력에 따라서 웹-페이지를 생성하 고 관리할 수 있다. 관리 서버(management server)는 생성된 웹-페이지를 포털 서버에 등록할 수 있 다. 또 예를 들어, 관리 서버는 웹-페이지를 통해 접속되는 전자 장치에 대한 정보를 축적하고, 축적 된 정보를 기반을 분석을 수행하여 패키지 상품과 같은 사업 촉진을 위한 솔루션을 클라이언트 서버로 제 공하는 동작을 수행할 수 있다. 본 출원의 일 실시예에 따르면, 클라이언트 서버(client server)는 사업자들(clients)의 서버일 수 있다. 서버 장치로서 도시되었으나, 도시 및/또는 기재된 바에 제한되지 않고 클라이언트 서버는 사용자 (customer)의 전자 장치와 같은 종류의 장치로 구현될 수도 있다. 사업자들은 상기 클라이언트 서버 를 통해서 관리 서버에 접속하여, 홈 페이지를 구성 및/또는 관리하기 위한 인터페이스를 제공받을 수 있 으며 인터페이스를 통해 홈 페이지를 생성하기 위한 입력을 할 수 있다. 본 출원의 일 실시예에 따르면, 전자 장치는 사용자(customer)가 이용 가능한 다양한 종류의 전자 장치를 포함할 수 있다. 상기 전자 장치는 개인용 단말들(예: 스마트 폰 등), 고정된 위치에 구비되는 전자 장치들(예: PC 등), 이동 가능한 개인용 노트북을 포함할 수 있다. 예를 들어, 전자 장치는 후술되는 관리 어플리케이 션을 이용하여, 포털 서버에 등록된 홈 페이지들에 접속하고, 홈 페이지를 둘러보거나 및/또는 홈 페이지 에 등록된 상품 및/또는 서비스를 구매할 수 있다. 2.1. 스마트 웹 페이지 생성 시스템의 구성들의 일 예 이하에서는 스마트 웹 페이지 생성 시스템에 포함된 구성들의 동작을 수행하기 위한 구성들의 일 예에 대해서 설명한다. 한편, 스마트 웹 페이지 생성 시스템은 구현 목적에 따라서 시스템 타입(system type) 또는 온 디바 이스 타입(on-device type)으로 구현될 수 있으므로, 이에 대해서는 \"2.2 목차\"에서 후술한다. 2.1.1 관리 서버의 구성의 일 예 먼저, 관리 서버의 구성의 일 예에 대해서 설명한다. 도 2는 본 출원의 일 실시예에 따른 관리 서버의 구성의 일 예를 나타내는 블록도이다. 한편 도 2에 도시 된 바에 제한되지 않고, 관리 서버는 도시된 구성들 보다 더 적은 구성들 또는 더 많은 구성들을 포함할 수 있다. 도 2를 참조하면, 일 실시예에 따르면 관리 서버는 제 1 통신 회로, 정보 획득 모듈, 페이지 구 성 모듈, 및 추천 모듈을 포함하는 제 1 제어 회로, 및 제 1 데이터베이스을 포함할 수 있 다. 상기 제 1 통신 회로는 외부 장치(예: 클라이언트 서버, 포털 서버)와 통신할 수 있다. 예를 들 면, 제 1 통신 회로는 무선 통신 또는 유선 통신을 통해서 네트워크에 연결되어 외부 장치(예: 클라이언트 서버, 포털 서버)와 통신을 설정하여, 설정된 통신을 통해 정보 및/또는 데이터를 교환할 수 있다. 상기 무선 통신은, 예를 들면, LTE, LTE-A(LTE Advance), CDMA(code division multiple access), WCDMA(wideband CDMA), UMTS(universal mobile telecommunications system), WiBro(Wireless Broadband), 또 는 GSM(Global System for Mobile Communications) 등 중 적어도 하나를 사용하는 셀룰러 통신을 포함할 수 있 다. 한 실시예에 따르면, 무선 통신은, 예를 들면, WiFi(wireless fidelity), 블루투스, 블루투스 저전력 (BLE), 지그비(Zigbee), NFC(near field communication), 자력 시큐어 트랜스미션(Magnetic Secure Transmission), 라디오 프리퀀시(RF), 또는 보디 에어리어 네트워크(BAN) 중 적어도 하나를 포함할 수 있다. 한 실시예에 따르면, 무선 통신은 GNSS를 포함할 수 있다. GNSS는, 예를 들면, GPS(Global Positioning System), Glonass(Global Navigation Satellite System), Beidou Navigation Satellite System(이하 \"Beidou\") 또는 Galileo, the European global satellite-based navigation system일 수 있다. 이하, 본 문서에서는, \"GPS\"는 \"GNSS\"와 상호 호환적으로 사용될 수 있다. 유선 통신은, 예를 들면, USB(universal serial bus), HDMI(high definition multimedia interface), RS-232(recommended standard232), 전력선 통신, 또는 POTS(plain old telephone service) 등 중 적어도 하나를 포함할 수 있다. 네트워크는 텔레커뮤니케이션 네트워크, 예를 들면, 컴퓨터 네트워크(예: LAN 또는 WAN), 인터넷, 또는 텔레폰 네트워크 중 적어도 하나를 포함할 수 있다. 상기 제 1 제어 회로는 관리 서버의 전반적인 동작을 제어할 수 있다. 이를 위해 제 1 제어 회로 는 각종 정보의 연산 및 처리를 수행하고 관리 서버의 구성 요소들(예: 제 1 통신 회로)의 동작 을 제어할 수 있다. 제 1 제어 회로는 하드웨어, 소프트웨어, 또는 이들의 조합에 따라 컴퓨터나 이와 유 사한 장치로 구현될 수 있다. 하드웨어적으로 상기 제 1 제어 회로는 전기적인 신호를 처리하여 제어 기능 을 수행하는 전자 회로 형태(예: CPU 등)로 제공될 수 있으며, 소프트웨어적으로는 하드웨어적인 상기 제 1 제 어 회로를 구동시키는 프로그램 형태로 제공될 수 있다. 이하에서 설명되는 관리 서버의 제 1 제어 회로에 포함되는 모듈들(예: 정보 획득 모듈, 페이지 구성 모듈, 및 추천 모듈)은 상기 제 1 제어 회로가 모듈과 연관된 동작을 수행하도록 제어할 수 있다. 다시 말해, 상기 모듈들은 상기 모듈과 연관된 동작을 수행하도록 제어하기 위한 프로그램, 컴퓨터 판독 가능한 코드, 프로세스 내지는 인스트럭션 (instructions)들로 구현되며, 상기 모듈들이 상기 제 1 제어 회로에 의해 실행되는 경우, 상기 제 1 제어 회로가 상기 모듈과 연관된 동작을 수행하도록 제어할 수 있다. 한편, 이하의 설명에서 특별한 언급이 없 는 경우에는 관리 서버의 동작은 상기 제 1 제어 회로의 제어에 의해 수행되는 것으로 해석될 수 있 다. 상기 제 1 제어 회로는 정보 획득 모듈을 포함하며, 정보 획득 모듈은 다양한 종류의 전자 장치 로부터 정보를 획득할 수 있다. 예를 들어, 정보 획득 모듈은 관리 서버로 클라이언트 서버가 접속되는 경우, 클라이언트 서버로 웹 페이지 구성 및/또는 관리를 위한 인터페이스를 제공하고 인터페이 스를 통해서 클라이언트 서버로부터 웹 페이지의 구성 및/또는 관리를 위한 입력을 수신할 수 있다. 또 예 를 들어, 정보 획득 모듈은 포털 서버를 통해서 웹-페이지에 접속되는 전자 장치에 대한 정보 (예: 사용자(customer)의 개인 정보, 전자 장치의 종류, 구매 이력, 유입 경로, 페이지 체류 시간 등)를획득할 수 있다. 예를 들어, 정보 획득 모듈은 구성된 웹-페이지에 전자 장치에 대한 정보를 추적하 기 위한 코드를 생성하여 삽입하고, 삽입된 코드를 통해서 전자 장치에 대한 정보를 획득할 수 있다. 상기 제 1 제어 회로는 페이지 구성 모듈을 포함하며, 페이지 구성 모듈은 인터페이스를 통해서 클라이언트 서버로부터 수신된 입력에 따라서, 웹 페이지를 구성하고 관리할 수 있다. 예를 들어, 페이지 구성 모듈은 사업자의 본점에 대응하는 메인-홈 페이지를 생성하여 메인-홈 페이지에 대한 스크립트(또는, 소스 코드)를 생성할 수 있다. 또 예를 들어, 페이지 구성 모듈은 사업자의 입력에 따라서, 본점에 대한 지점을 설정하고 지점에 대응하는 서브-홈 페이지를 생성하여 메인-홈 페이지에 등록할 수 있다. 상기 메인-홈 페이지에 서브-홈 페이지를 등록하는 동작은 메인-홈 페이지에 등록된 서브-홈 페이지에 접속하기 위한 링크를 삽입하는 동작을 포함할 수 있다. 상기 제 1 제어 회로는 추천 모듈을 포함하며, 추천 모듈은 수집된 전자 장치에 대한 정보 (예: 사용자(customer)의 개인 정보, 전자 장치의 종류, 구매 이력, 유입 경로, 페이지 체류 시간 등)를 기반으로, 클라이언트 서버로 사업 촉진을 위한 솔루션을 제공할 수 있다. 상기 제 1 데이터베이스는 각종 정보(예: 수신된 문서에 대한 정보, 변환된 문서 파일, 및/또는 후술되는 인공 지능 모델)를 저장할 수 있다. 제 1 데이터베이스는 데이터를 임시적으로 또는 반영구적으로 저장할 수 있다. 예를 들어, 관리 서버의 제 1 데이터베이스에는 관리 서버를 구동하기 위한 운용 프로 그램(OS: Operating System), 웹 사이트를 호스팅하기 위한 데이터나 프로그램 내지는 어플리케이션(예를 들어, 웹 어플리케이션)에 관한 데이터 등이 저장될 수 있다. 상기 제 1 데이터베이스의 예로는 하드 디스크 (HDD: Hard Disk Drive), SSD(Solid State Drive), 플래쉬 메모리(flash memory), 롬(ROM: Read-Only Memory), 램(RAM: Random Access Memory) 등이 있을 수 있다. 이러한 데이터베이스는 내장 타입 또는 탈부착 가능한 타입으로 제공될 수 있다. 2.1.2 전자 장치의 구성의 일 예 이하에서는 전자 장치의 구성의 일 예에 대해서 설명한다. 도 3은 본 출원의 일 실시예에 따른 전자 장치의 구성의 일 예를 나타내는 블록도이다. 한편 도 3에 도시 된 바에 제한되지 않고, 전자 장치는 도시된 구성들 보다 더 적은 구성들 또는 더 많은 구성들을 포함할 수 있다. 먼저 이하에서는 전자 장치의 구성들에 대해서 설명한다. 도 3을 참조하면, 일 실시예에 따르면 전자 장치는 제 2 통신 회로, 제 2 통신 회로, 입력 장치 , 및 디스플레이를 포함할 수 있다. 상기 제 2 통신 회로는 외부 장치(예: 관리 서버)와 통신할 수 있다. 예를 들면, 제 2 통신 회로 는 무선 통신 또는 유선 통신을 통해서 네트워크에 연결되어 외부 장치(예: 관리 서버))와 통신을 설 정하여, 설정된 통신을 통해 정보 및/또는 데이터를 교환할 수 있다. 상기 제 2 통신 회로는 전술한 관리 서버의 제 1 통신 회로와 같이 구현될 수 있으므로 중복되는 설명은 생략한다. 상기 제 2 통신 회로는 전자 장치의 전반적인 동작을 제어할 수 있다. 이를 위해 제 2 통신 회로 는 각종 정보의 연산 및 처리를 수행하고 전자 장치의 구성 요소들(예: 제 2 통신 회로)의 동작 을 제어할 수 있다. 상기 제 2 통신 회로는 전술한 관리 서버의 제 1 제어 회로와 같이 구현될 수 있으므로 중복되는 설명은 생략한다. 상기 입력 장치는 사용자들로부터 정보를 입력 받을 수 있다(예: 인터페이스 상에서 사용자 입력(예: 핸드 라이팅, 드로잉, 다양한 종류의 터치, 텍스트 타이핑 등)을 수신). 상기 입력 장치는 사용자 입력을 받거 나 또는 사용자에게 정보를 출력하는 각종 인터페이스나 연결 포트 등일 수 있다. 상기 입력 장치는 입력 모듈과 출력 모듈로 구분될 수 있는데, 입력 모듈은 사용자로부터 사용자 입력을 수신한다. 사용자 입력은 키 입력, 터치 입력, 음성 입력을 비롯한 다양한 형태로 이루어질 수 있다. 이러한 사용자 입력을 받을 수 있는 입 력 모듈의 예로는 전통적인 형태의 키패드나 키보드, 마우스는 물론, 사용자의 터치를 감지하는 터치 센서, 음 성 신호를 입력받는 마이크, 영상 인식을 통해 제스처 등을 인식하는 카메라, 사용자 접근을 감지하는 조도 센 서나 적외선 센서 등으로 구성되는 근접 센서, 가속도 센서나 자이로 센서 등을 통해 사용자 동작을 인식하는 모션 센서 및 그 외의 다양한 형태의 사용자 입력을 감지하거나 입력받는 다양한 형태의 입력 수단을 모두 포함하는 포괄적인 개념이다. 여기서, 터치 센서는 디스플레이 패널에 부착되는 터치 패널이나 터치 필름을 통해 터 치를 감지하는 압전식 또는 정전식 터치 센서, 광학적인 방식에 의해 터치를 감지하는 광학식 터치 센서 등으로 구현될 수 있다. 이 경우, 상기 입력 장치는 후술할 디스플레이 내에 구현되어 사용자의 터치 입력을 수신할 수 있다. 다시 말해, 디스플레이는, 상기 입력 장치로서 터치 스크린을 포함할 수 있으며, 예 를 들면, 전자 펜 또는 사용자의 신체의 일부를 이용한 터치, 제스쳐, 근접, 또는 호버링 입력을 수신할 수 있 다. 이외에도 상기 입력 장치는 자체적으로 사용자 입력을 감지하는 장치 대신 사용자 입력을 입력받는 외 부의 입력 장치를 연결시키는 입력 인터페이스(USB 포트, PS/2 포트 등)의 형태로 구현될 수도 있다. 상기 디스플레이는 액정 디스플레이(LCD), 발광 다이오드(LED) 디스플레이, 유기 발광 다이오드(OLED) 디 스플레이, 또는 마이크로 전자기계 시스템 (MEMS) 디스플레이, 또는 전자종이(electronic paper) 디스플레이를 포함할 수 있다. 상기 디스플레이는, 관리 서버로부테 제공되는 인터페이스를 표시할 수 있다. 2.3. 스마트 웹 페이지 생성 시스템의 구현 예 스마트 웹 페이지 생성 시스템은 상술한 바와 같이 시스템 타입 또는 온 디바이스 타입으로 구현될 수 있다. 일 실시예에 따르면 상술한 바와 같이 관리 서버에서 클라이언트 서버로 소정의 정보를 수신하고, 제 공하는 동작을 수행하도록 구현 구현되는 경우, 스마트 웹 페이지 생성 시스템은 시스템 타입으로 정의될 수 있 다. 또 일 실시예에 따르면, 상술한 구성들이 하나의 물리적 장치에 구현되는 경우, 스마트 웹 페이지 생성 시스템 은 온 디바이스(On-device) 타입으로 정의될 수 있다. 예를 들어, 관리 서버의 구성들(예: 정보 획득 모듈 , 페이지 구성 모듈, 및 추천 모듈)이 클라이언트 서버에 모두 구현 가능하며, 이 경우 스 마트 웹 페이지 생성 시스템은 온 디바이스(On-device) 타입으로 정의될 수 있다. 이 경우, 관리 서버로부 터 클라이언트 서버로 웹-페이지 생성 및/또는 관리를 위한 인터페이스를 제공하도록 구현된 프로그램이 제공되고, 클라이언트 서버에서 상기 프로그램의 실행에 따라서 전술한 구성들(예: 정보 획득 모듈, 페이지 구성 모듈, 및 추천 모듈)에 대한 기능이 제공될 수 있다. 또 기재된 바에 국한되지 않고, 스마트 웹 페이지 생성 시스템은 바와 같이 시스템 타입과 온 디바이스 타입이 조합되는 하이브리드 타입으로 구현될 수 있다. 예를 들어, 관리 서버의 적어도 일부 구성은 관리 서버 에 유지되고, 나머지 구성은 클라이언트 서버에 구현되는 경우, 해당 스마트 웹 페이지 생성 시스템 은 하이브리드 타입으로 정의될 수 있다. 3. 스마트 웹 페이지 생성 시스템의 동작 이하에서는 스마트 웹 페이지 생성 시스템을 구성하는 장치들(예: 관리 서버, 클라이언트 서버, 전자 장치의 동작의 다양한 예들에 대해서 설명한다. 3.1. 제 1 실시예 <본점과 지점에 대응하는 웹-페이지들에 대한 스크립트를 생성하고, 웹-페이지들을 서로 연관 되도록 관리하는 실시예> 일 실시예에 따르면, 관리 서버는 접속된 클라이언트 서버로 웹-페이지를 구성하기 위한 인터페이스 를 제공할 수 있다. 관리 서버는 인터페이스를 통해 수신되는 클라이언트 서버의 입력에 따라서, 본 점에 대응하는 메인 홈 페이지 및 지점에 대응하는 적어도 하나의 서브 홈 페이지를 구성할 수 있다. 관리 서버 는 메인 홈 페이지 및 적어도 하나의 서브 홈 페이지를 특정 인트라넷을 통해서 연결시켜 관리하고, 이에 따라 메인 홈 페이지에 접속한 사용자의 전자 장치가 메인 홈 페이지를 통해서 적어도 하나의 서브 홈 페 이지로 접근하도록 할 수 있다. 도 4는 본 출원의 일 실시예에 따른 스마트 웹 페이지 생성 시스템의 동작의 일 예를 설명하기 위한 흐름도이다. 다양한 실시예들에 따르면 스마트 웹 페이지 생성 시스템의 동작은 도 4에 도시되는 동작의 순서에 국한되지 않고, 도시되는 순서와 다른 순서로 수행될 수 있다. 또한, 다양한 실시예들에 따르면, 도 4에 도시되 는 스마트 웹 페이지 생성 시스템의 동작 보다 더 많은 동작들이 수행되거나, 또는 더 적은 적어도 하나의 동작 이 수행될 수도 있다. 이하에서는 도 5 내지 6을 참조하여 도 4에 대해서 설명한다.도 5는 본 출원의 일 실시예에 따른 관리 서버 및 클라이언트 서버의 동작의 예를 설명하기 위한 도 면이다. 도 6은 본 출원의 일 실시예에 따른 관리 서버로부터 제공되는 홈 페이지를 구성하기 위한 인터페 이스의 예를 설명하기 위한 도면이다. 도 7은 본 출원의 일 실시예에 따른 포털 서버에 등록된 홈 페이지 의 링크의 예를 나타내는 도면이다. 일 실시예에 따르면, 관리 서버는 401 동작에서 클라이언트 서버가 관리 서버로 접속되는 경우, 웹 페이지 구성을 위한 인터페이스를 클라이언트 서버로 제공할 수 있다. 예를 들어, 관리 서버는 도 5의 501에 도시된 바와 같이 클라이언트 서버가 관리 서버로 접속되는 경우, 도 6에 도시된 바와 같 은 인터페이스를 제공할 수 있다. 예를 들어, 클라이언트 서버는 웹-어플리케이션(또는, 웹-프로그램)을 실행하여, 관리 서버가 운영하는 주소의 사이트로 접속할 수 있다. 관리 서버는 도 6의 601에 도시된 인터페이스의 로그인 화면을 포함하는 인터페이스(또는 웹 페이지)가 클라이언트 서버의 웹-어플리케이션 의 실행 화면 상에 표시되도록 인터페이스(또는 웹 페이지)를 클라이언트 서버로 제공하고, 인터페이스를 통해 클라이언트 서버로부터 인증을 위한 정보(예: 아이디 및 비밀번호)가 입력되는 경우 클라이언트 서버 를 인증할 수 있다. 관리 서버는 상기 인증이 완료되는 경우, 도 6의 602 내지 604에 도시된 바와 같 은 웹-페이지 구성 및 관리를 위한 화면들을 포함하는 인터페이스를 클라이언트 서버로 제공할 수 있다. 일 실시예에 따르면, 클라이언트 서버는 402 동작에서 인터페이스를 통해 복수의 기능들을 제공하도록 구 현된 메인 홈 페이지를 생성하기 위한 제 1 정보를 입력하고, 입력된 제 1 정보를 관리 서버로 전달할 수 있다. 예를 들어, 병원을 운영하는 클라이언트(client)는 클라이언트 서버에 표시되는 도 6의 602에 도시 된 바와 같이 인터페이스 상에, 본점에 대응하는 메인 홈 페이지에 기능들을 제공하기 위한 그래픽 오브젝트들 (graphic objects)들(621, 622, 623)을 구성할 수 있다. 상기 그래픽 오브젝트들은 상품(예: 시술)에 대한 정 보를 제공하도록 구현된 시술 안내 메뉴, 공지 사항을 업로드하고, 사용자들(customers)이 게시글을 업로 드하고, 실시간으로 1:1로 상담을 진행(예: 챗봇 기능을 제공)하기 위한 커뮤니티 메뉴, 및 예약을 셋팅하 기 위한 예약 메뉴들을 포함할 수 있다. 예를 들어, 관리 서버는 상기 인터페이스 상에 전술한 바와 같이 특정 기능을 수행하도록 설정된 각각의 메뉴들(621, 622, 623)을 미리 구현하여 등록해둘 수 있다. 관리 서버는 클라이언트 서버로부터 실시간으로 인터페이스를 통해, 상기 미리 구현된 메뉴들(621, 622, 623) 중에서 클라이언트(client)가 선택한 메뉴들에 대한 정보를 수신하고, 수신된 정보에 기반하여 선택된 메 뉴들을 메인 홈 페이지 상에 구현(또는, 메인 홈 페이지에 메뉴들이 포함되도록 구성)할 수 있다. 또, 관리 서 버는 메인 홈 페이지 상에 구현된 메뉴들과 연관된 시각적 속성(예: 크기, 위치, 배열 상태 등)을 편집하 기 위한 편집 기능들을 더 제공하고, 클라이언트 서버로부터 수신되는 편집 기능들을 이용하기 위한 입력 을 수신함에 따라서 메인 홈 페이지를 구성하는 메뉴들을 편집할 수 있다. 또, 관리 서버는 메뉴들 외에도 도 6의 602에 도시된 바와 같이 클라이언트 서버로부터 메인-홈 페이지에 삽입될 컨텐트(예: 이미지, 텍스트)에 대한 정보를 수신하고, 컨텐트(예: 이미지, 텍스트)를 메인 홈 페이지에 삽입할 수도 있다. 또 도시되지 않았으나, 관리 서버는 메뉴들 및 이미지 외에도 알림을 위한 팝업 화면을 제공하기 위한 기능들, 외부 API 연동 기능 등을 제공할 수 있다. 일 실시예에 따르면, 관리 서버는 홈 페이지에 컨텐트를 생성하는 경우, 클라이언트가 사업하는 업종(예: 병원 운영)과 연관된 법(예: 의료법)에 기반하여 컨텐트 작성이 가능하도록 편집 화면을 제공할 수 있다. 예를 들어, 관리 서버는 컨텐트로서 텍스트가 입력되는 경우, 텍스트로부터 법에 저촉되는 부분을 식별하고, 식 별된 부분이 삭제 또는 변경이 필요함을 알릴 수 있다. 이때, 관리 서버는 식별된 법에 저촉된 부분이 대 체될 수 있는 텍스트를 식별하는 경우, 해당 대체될 수 있는 텍스트로 저촉된 부분을 대체하여 제공할 수도 있 다. 또 예를 들어, 관리 서버는 의료 상품을 등록하는 경우, 등록되는 의료 상품이 비급여 비용이 적용되 는 의료 상품인지 여부를 판단하고, 판단 결과에 기반하여 비급여 비용이 적용되는 의료 상품인 경우 비급여 비 용을 자동으로 기입하여 컨텐트를 생성하거나 또는 기입하도록 알림을 제공할 수 있다. 또 예를 들어, 관리 서 버는 업종(예: 병원 운영)과 연관된 법(예: 의료법)과 연관된 검색을 수행하는 기능을 제공할 수 있다. 일 실시예에 따르면, 관리 서버는 404 동작에서 제 1 정보에 기반하여 메인 홈 페이지를 구성하기 위한 제 1 코드를 생성하고, 405 동작에서 생성된 제 1 코드를 클라이언트 서버로 전달할 수 있다. 예를 들어, 관 리 서버는 클라이언트 서버로부터 메인 홈 페이지 작성 완료를 나타내는 메시지를 수신하는 경우, 메 시지를 수신한 시점까지 구성된 메인 홈 페이지를 스크립트(또는, 소스 코드)로 변환할 수 있다. 상기 스크립트 는 PC, 모바일 및 모든 브라우저에 호환되는 웹 표준형 플랫폼의 언어로 작성되는 컴퓨터 코드일 수 있다. 이에 따라, 생성된 메인 홈 페이지는 전자 장치의 종류에 관계 없이 원활히 전자 장치로 제공될 수 있다. 이때, 관리 서버는 포털 서버를 통해서 웹-페이지에 접속되는 전자 장치에 대한 정보(예: 사용자(customer)의 개인 정보, 전자 장치의 종류, 구매 이력, 유입 경로, 페이지 체류 시간 등)를 추적하기 위한 코드를 생성하여 홈 페이지 코드에 삽입할 수 있다. 이에 따라, 전자 장치가 메인 홈 페이지에 접속 함에 따라서 정보들(예: 사용자(customer)의 개인 정보, 전자 장치의 종류, 구매 이력, 유입 경로, 페이지 체류 시간 등)이 수집될 수 있다. 관리 서버는 변환된 소스 코드(예: 제 1 코드)를 클라이언트 서버 로 전달하여, 클라이언트 서버가 해당 소스 코드를 기반으로 메인 홈 페이지를 개설하도록 할 수 있다. 또 는, 관리 서버가 대신 메인 홈 페이지를 개설할 수도 있다. 일 실시예에 따르면, 클라이언트 서버는 406 동작에서 인터페이스를 통해, 생성된 메인 홈 페이지의 서브 홈 페이지들을 생성하기 위한 제 2 정보를 입력하고, 407 동작에서 입력된 제 2 정보를 관리 서버로 전달 할 수 있다. 예를 들어, 관리 서버는 메인 홈 페이지에 대한 코드의 생성을 완료하는 경우, 계속해서 도 6 의 603 내지 604에 도시된 바와 같이 본점에 대한 지점들에 대응하는 서브 홈 페이지들을 생성하기 위한 화면을 포함하는 인터페이스를 클라이언트 서버로 제공할 수 있다. 예를 들어, 관리 서버는 도 6의 603에 도 시된 바와 같이 지점의 사용 여부, 지점들, 및 지점들의 그룹을 설정하기 위한 화면을 제공할 수 있다. 상기 지 점의 사용 여부가 \"사용\"으로 설정되는 경우, 지점 설정 메뉴에서 본점에 대응하여 생성될 지점들(예: 제 1 지 점 내지 제 3 지점)에 대한 정보가 기입될 수 있다. 관리 서버는 상기 설정되거나 기입되는 정보들을 인터 페이스를 통해 클라이언트 서버로부터 수신할 수 있다. 이후, 관리 서버는 관리 서버에서 관리 가능한 복수의 인트라넷 네트워크들에 대한 정보를 클라이언트 서버로 제공하고, 복수의 인트라넷 네트워 크들 중에서 클라이언트 서버가 선택한 인트라넷 네트워크에(예: 제 1 네트워크) 대한 정보를 수신할 수 있다. 결과적으로 관리 서버는 지점들(예: 제 1 내지 제 3 지점)에 대한 서브 홈 페이지들을 생성 할 수 있다. 관리 서버는 수신된 정보에 기반하여, 특정 인트라넷 네트워크 이후, 관리 서버는 도 6의 604 에 도시된 바와 같이 각 지점 별로 서브 홈 페이지의 화면을 구성하기 위한 화면을 포함하는 인터페이스를 제공 하고, 인터페이스를 통해서 클라이언트 서버를 통해서 지점 별로 등록될 정보들(예: 지도 정보, 영업 시간 등)을 수신하여 서브 홈 페이지 상에 포함시킬 수 있다. 일 실시예에 따르면, 관리 서버는 408 동작에서 서브 홈 페이지들을 구성하기 위한 제 2 코드를 생성할 수 있다. 예를 들어, 관리 서버는 클라이언트 서버로부터 서브 홈 페이지 작성 완료를 나타내는 메시지 를 수신하는 경우, 메시지를 수신한 시점까지 구성된 서브 홈 페이지를 스크립트(또는, 소스 코드)로 변환할 수 있다. 상기 스크립트는 동작 404에서 기술한 바와 같이 구현될 수 있으므로, 중복되는 설명은 생략한다. 일 실시예에 따르면, 관리 서버는 409 동작에서 생성된 서브 홈페이지들을 메인 홈 페이지를 특정 인트라 넷에 연관되도록 설정하고, 410 동작에서 생성된 홈페이지들(예: 메인 홈 페이지 및 서브 홈 페이지들)을 포털 서버에 등록할 수 있다. 관리 서버는 전술한 생성된 메인 홈 페이지와 서브 홈 페이지들을 특정 인트라넷 네트워크(예: 제 1 네트워크)로 통신 연결시켜 각 홈 페이지들 간 서로 정보가 공유되고 링크되도록 할 수 있다. 예를 들어, 사용자의 전자 장치가 메인 홈 페이지를 통해서 입력하는 정보들은 다른 서브 홈 페이지 들에 공유되고, 서브 홈 페이지들을 통해서 입력하는 정보들 또한 메인 홈 페이지로 공유 될 수 있다. 예를 들 어, 홈 페이지 각각을 통해 입력된 예약 정보가 서로 공유되어, 예약 정보들이 통합적으로 관리될 수 있다. 또 예를 들어, 메인 홈 페이지 상에서 각 지점들 별 서브 홈페이지로 접근하기 위한 링크가 제공되고, 사용자의 전 자 장치가 상기 링크를 통해서 각 지점들 별 서브 홈페이지로 접속할 수 있게 된다. 관리 서버는 도 7에 도시된 바와 같이, 생성된 메인 홈 페이지 및 서브 홈 페이지들 각각에 접속하기 위한 주소를 생성하여 포 털 서버에 등록할 수 있다. 상기 주소로 접속되는 경우, 전술한 코드들(예: 제 1 코드 및 제 2 코드)이 전 자 장치로 제공되고 이에 기반하여 생성된 홈 페이지들(예: 메인 홈 페이지, 서브 홈 페이지)이 전자 장치 에 표시될 수 있다. 일 실시예에 따르면, 관리 서버는 포털 서버에 홈 페이지들(예: 메인 홈 페이지, 서브 홈 페이지)을 등록하는 경우, 검색 시 최상단에서 검색 가능하도록 포털 서버의 상품을 자동으로 이용할 수도 있다. 일 실시예에 따르면, 관리 서버는 포털 서버에서 제공하는 다양한 종류의 기능들에 연동되도록 생성 된 홈 페이지들(예: 메인 홈 페이지, 서브 홈 페이지)을 포털 서버에 등록할 수 있다. 예를 들어, 포털 서 버가 예약 서비스, 지식 서비스 등을 제공하는 경우, 상기 홈 페이지들(예: 메인 홈 페이지, 서브 홈 페이 지)에 대한 예약 서비스, 및 지식 서비스가 포털 서버의 웹 사이트 상에서 전자 장치로 제공될 수 있 다. 일 실시예에 따르면, 관리 서버는 전술한 바와 같이 전자 장치의 홈 페이지 접속에 따라서 정보(예: 사용자(customer)의 개인 정보, 전자 장치의 종류, 구매 이력, 유입 경로, 페이지 체류 시간 등)가 수집되는 경우, 이를 통계적으로 분석하고 분석된 정보를 시각화 하여 클라이언트 서버로 제공할 수도 있다. 3.2 제 2 실시예 <축적되는 정보들에 기반하여, 패키지 상품을 추천하는 실시예> 전술한 스마트 웹 페이지 생성 시스템의 동작들은 제 2 실시예에 준용될 수 있으므로, 중복되는 설명은 생략한 다. 일 실시예에 따르면, 관리 서버는 전자 장치의 홈 페이지 이용에 따라서 축적되는 정보(예: 사용자 (customer)의 개인 정보, 전자 장치의 종류, 구매 이력, 유입 경로, 페이지 체류 시간 등)에 기반하여, 상 품을 추천하기 위한 인공 지능 모델을 학습할 수 있다. 관리 서버는 학습된 인공 지능 모델에 기반하여, 클라이언트 서버가 원하는 조건에 가장 부합하는 상품들로 구성된 패키지 상품을 생성하여 추천할 수 있다. 도 8은 본 출원의 일 실시예에 따른 스마트 웹 페이지 생성 시스템의 동작의 다른 예를 설명하기 위한 흐름도이 다. 다양한 실시예들에 따르면 스마트 웹 페이지 생성 시스템의 동작은 도 8에 도시되는 동작의 순서에 국한되 지 않고, 도시되는 순서와 다른 순서로 수행될 수 있다. 또한, 다양한 실시예들에 따르면, 도 8에 도시되는 스 마트 웹 페이지 생성 시스템의 동작 보다 더 많은 동작들이 수행되거나, 또는 더 적은 적어도 하나의 동작이 수 행될 수도 있다. 이하에서는 도 9 내지 도 12를 참조하여 도 9에 대해서 설명한다. 도 9는 본 출원의 일 실시예에 따른 관리 서버의 인공 지능 모델을 생성하기 위한 정보를 축적하는 동작의 일 예를 설명하기 위한 도면이다. 도 10은 본 출원의 일 실시예에 따른 관리 서버의 상품을 추천하 기 위한 인공 지능 모델을 생성하는 동작의 일 예를 설명하기 위한 도면이다. 도 11은 본 출원의 일 실시 예에 따른 관리 서버의 인공 지능 모델을 이용하여 패키지 상품을 추천하는 동작의 예를 설명하기 위한 도 면이다. 도 12는 본 출원의 일 실시예에 따른 클라이언트 서버에 의해 조건이 설정되는 동작의 예를 설명 하기 위한 도면이다. 일 실시예에 따르면, 관리 서버는 801 동작에서 홈 페이지들을 이용하는 사용자에 대한 정보를 획득할 수 있다. 예를 들어, 관리 서버는 전술한 바와 같이 전자 장치의 홈 페이지 접속에 따라서 정보(예: 사 용자(customer)의 개인 정보, 전자 장치의 종류, 구매 이력, 유입 경로, 시간 정보 등)를 수집하고 계속해 서 데이터베이스에 축적할 수 있다. 일 예로, 사용자는 전자 장치를 이용하여 도 9의 901 내지 903에 도시된 바와 같이, 포털 서버에서 홈 페이지를 검색하고 홈 페이지에 접속하여 상품들(예: A 보톡스, B 필 러)을 판매하기 위한 페이지를 이용할 수 있다. 이때, 전술한 정보를 추적하기 위한 소스 코드를 통해서, 정보 (예: 성별 및 나이와 같은 사용자(customer)의 개인 정보, 전자 장치의 종류, 특정 상품에 대한 구매 이력, 유입 경로, 시간 정보 등)가 수집될 수 있다. 이때, 관리 서버는 사용자(customer)의 개인 정보, 최 신 기종 또는 오래된 기종으로 분류되는 전자 장치의 종류, 특정 상품에 대한 구매 이력, 유입 경로, 상품 이 구매된 시간대(예: 시/일/월/년)를 나타내는 시간 정보를 서로 연관된 형태로 저장할 수 있다. 일 예로, 관 리 서버는 수집된 정보에 기반하여, 20대 여성이 A 상품을 구매한 것으로 서로 연관된 형태로 저장할 수 있다. 일 실시예에 따르면, 관리 서버는 802 동작에서 획득된 데이터들을 기반으로 인공 지능 모델을 학습할 수 있다. 일 실시예에서 먼저 관리 서버는 도 10의 1001에 도시된 바와 같이 패키지 상품을 추천하기 위한 인 공 지능 모델을 생성하기 위해, 데이터베이스에 축적된 정보(예: 사용자(customer)의 개인 정보, 전 자 장치의 종류, 구매 이력, 유입 경로, 시간 정보 등)를 추출할 수 있다. 일 실시예에서, 관리 서버(11 0)는 도 10의 1002에 도시된 바와 같이 상기 정보(예: 사용자(customer)의 개인 정보, 전자 장치의 종류, 구매 이력, 유입 경로, 시간 정보 등)를 학습이 가능한 형태로 가공할 수 있다. 예를 들어 관리 서버는 각 정보들을 전처리하고 행렬 연산이 가능한 행렬 값으로 환산하고, 환산된 행렬 값들이 연산 가능해지도록 정렬하 는 등의 동작(예: Allocation, Wrangling)을 수행할 수 있다. 상기 데이터를 전처리하는 동작은 주지의 기술이 므로 구체적인 설명은 생략한다. 일 실시예에서, 관리 서버는 가공된 정보들(예: 정보(예: 사용자(customer)의 개인 정보, 전자 장치 의 종류, 구매 이력, 유입 경로, 시간 정보 등))를 트레이닝 데이터(training data)로 하여 학습을 진행함으로 써, 인공 지능 모델을 생성할 수 있다. 예를 들어, 관리 서버는 정보(예: 사용자(customer)의 개인 정보, 전자 장치의 종류, 구매 이력, 유입 경로, 시간 정보 등) 중에서 나이 및 성별과 같은 사용자 (customer)의 개인 정보, 전자 장치의 종류, 또는 시간 정보와 같은 정보들(예: 조건 정보들) 중 적어도일부를 입력 데이터(input data)로 하고, 이에 따라 구매된 상품에 대한 정보(즉, 구매 이력에 대한 정보)를 출 력 데이터(output data)로 설정하여, 다양한 종류의 인공 지능 학습 알고리즘에 기반하여 학습(예: 파라미터(예: 가중치(weight)) 학습)을 수행할 수 있다. 상기 인공 지능 학습 알고리즘은 다양한 종류의 주지의 머신 러닝(machine learning) 및 딥 러닝(deep learning) 알고리즘을 포함할 수 있으므로, 구체적인 설 명은 생략한다. 이때, 상기 학습에 따라서, 생성된 인공 지능 모델은 사용자(customer)의 개인 정보, 전 자 장치의 종류, 및 시간 정보와 같은 정보들(예: 조건 정보들)을 입력 받은 것에 대한 응답으로, 현재 홈 페이지에서 판매되는 상품들(예: A 상품, B 상품, C 상품) 별 가중치에 대한 정보를 최종 출력하 도록 구현될 수 있다. 예를 들어, 관리 서버는 제 1 조건 정보가 입력되는 것에 대한 응답으로 상품 별로 가중치를 부여하고, 제 2 조건 정보가 입력되는 것에 대한 응답으로 상품 별로 가중치를 부여하는 동작을 계속 해서 수행하여 학습을 수행 수 있다. 결과적으로, 인공 지능 모델은 입력되는 사용자(customer)의 개인 정보, 전자 장치의 종류, 및 시간 정보와 같은 정보들(예: 조건 정보들)를 연산하기 위한 가중치 값들을 포함하는 레이어들을 포함하고, 상기 레이어들 각각에서 입력된 정보(예: 사용자(customer)의 개인 정보, 전자 장치의 종류, 및 시간 정보와 같은 정보들(예: 조건 정보들))에 대한 가중치를 곱하는 연산을 통해서 최종 적으로 상품 별로 가중치를 출력하도록 구현될 수 있다. 일 실시예에 따르면, 관리 서버는 803 동작에서 특정 패키지 상품 생성을 위한 요청을 수신하고, 804 동작 에서 수신된 요청에 포함된 조건 정보를 상기 인공 지능 모델에 입력하여, 출력되는 정보를 기반으로 특정 패키 지 상품을 생성하여 제공할 수 있다. 예를 들어, 관리 서버는 도 11의 1101에 도시된 바와 같이, 클라이언 트 서버로부터 특정 패키지 상품을 생성을 위한 요청을 수신할 수 있다. 상기 요청은 특정 패키지 상품이 만족해야 하는 조건에 대한 정보들을 포함할 수 있다. 예를 들어, 관리 서버는 클라이언트 서버로 도 12의 1201 내지 1202에 도시된 바와 같이 패키지 상품 추천을 위한 화면을 제공할 수 있다. 상기 패키지 상품 추천을 위한 화면은 특정 패키지 상품이 만족하기를 원하는 조건들에 대한 정보(예: 시간대, 성별 나이, 기종) 와 같은 정보를 입력 받기 위한 메뉴 화면(예: 조건 설정 메뉴 화면)과 추천되는 패키지 상품을 나타내는 메뉴 화면을 포함할 수 있다. 관리 서버는 상기 화면의 조건 설정 메뉴 화면 상에서 조건들에 대한 정보(예: 시간대(예: 5월에서 7월), 성별(예: 여성), 나이(예: 25에서 30), 기종(예: 최신인 A 기종))를 클라이언트 서버로부터 입력 받을 수 있다. 이에 따라, 관리 서버는 입력 받은 조건들에 대한 정보를 학습이 가능한 형태로 가공하고, 도 11의 1102에 도시된 바와 같이 가공된 조건들에 대한 정보를 인공 지 능 모델에 입력한 것에 대한 응답으로, 출력되는 상품들(예: A 상품, B 상품, C 상품) 별 가중치(예: 0.32, 0.28, 0.13)에 대한 정보를 획득할 수 있다. 관리 서버는 복수의 상품들 중 가중치가 높은 순서대로 기설정된 수(예: 2개) 만큼의 상품들을 선택하고, 선택된 상품들(예: A 상품 및 B 상품)을 포함하는 패키지 상 품을 생성할 수 있다. 관리 서버는 생성된 패키지 상품에 대한 정보를 추천되는 패키지 상품을 나타 내는 메뉴 화면에 표시하여 클라이언트가 확인하도록 할 수 있다. 만약 관리 서버는 클라이언트 서 버로부터 추천된 패키지 상품을 생성하기 위한 입력을 수신하는 경우, 도 12의 1203에 도시된 바와 같이 패키지 상품에 대한 정보를 기반으로 패키지 상품에 대한 정보를 제공하기 위한 컨텐트를 자동으로 생성하여 제 공할 수 있다. 예를 들어, 관리 서버는 조건들에 대한 정보(예: 시간대(예: 5월에서 7월), 성별(예: 여 성), 나이(예: 25에서 30), 기종(예: 최신인 A 기종))의 적어도 일부를 기반으로 컨텐트의 제목 텍스트(예: 여 름 미혼 여성 위한 패키지 상품 출시)를 생성 및 배치하여 컨텐트를 구성하고, 각 상품들(예: A 상품 및 B 상품)에 대한 이미지를 배치하여 컨텐트를 구성할 수 있다. 관리 서버는 생성된 컨텐트를 메인 홈 페이 지 또는 서브 홈 페이지 접속 시, 표시되도록 자동으로 설정할 수 있다. 특히 예를 들어, 관리 서버는 조 건들에 대한 정보(예: 시간대(예: 5월에서 7월), 성별(예: 여성), 나이(예: 25에서 30), 기종(예: 최신인 A 기 종))를 만족하는 접속이 발생되는 경우, 전자 장치로 생성된 컨텐트를 제공할 수 있다. 일 예로, 관리 서 버는 5월에서 7월 사이에 홈 페이지로 접속된 전자 장치로 상기 컨텐트를 팝업 화면 형태로 제공할 수 있다. 또 예를 들어 컨텐트를 팝업 화면 형태로 제공하는 동작의 적어도 일부로, 관리 서버는 조건들 (예: 시간대(예: 5월에서 7월), 성별(예: 여성), 나이(예: 25에서 30), 기종(예: 최신인 A 기종))을 만족하는 정도에 비례하여, 제공되는 팝업 화면을 시각적으로 더 강조(예: 하이라이트, 또는 컨텐트의 명도를 크게 함)할 수 있다. 일 실시예에 따르면, 상기 패키지 상품 생성 시 포함되는 상품들의 수는 가격 상한 선에 따라서 달라질 수 있다. 예를 들어, 관리 서버는 클라이언트 서버로부터 패키지 상품의 가격 상한선에 대한 정보를 더 수신할 수 있다. 이에 따라, 관리 서버는 선택되는 상품들의 가격의 총합이 가격 상한 선 보다 낮도록, 가 중치 순서 대로 패키지 상품에 포함될 상품들을 선택할 수 있다.3.3 제 3 실시예 <식별된 가중치에 기반하여, 패키지 상품 중 일부 상품을 대체하여 제공하는 실시예> 전술한 스마트 웹 페이지 생성 시스템의 동작들은 제 3 실시예에 준용될 수 있으므로, 중복되는 설명은 생략한 다. 일 실시예에 따르면, 관리 서버는 인공 지능 모델로부터 출력된 패키지 상품을 용이하게 편집하기 위해서, 일 상품이 제거되는 경우 가중치 및 가격에 기반하여 상품을 추천할 수 있다. 도 13은 본 출원의 일 실시예에 따른 스마트 웹 페이지 생성 시스템의 동작의 다른 예를 설명하기 위한 흐름도 이다. 다양한 실시예들에 따르면 스마트 웹 페이지 생성 시스템의 동작은 도 13에 도시되는 동작의 순서에 국한 되지 않고, 도시되는 순서와 다른 순서로 수행될 수 있다. 또한, 다양한 실시예들에 따르면, 도 13에 도시되는 스마트 웹 페이지 생성 시스템의 동작 보다 더 많은 동작들이 수행되거나, 또는 더 적은 적어도 하나의 동작이 수행될 수도 있다. 이하에서는 도 14 내지 도 15를 참조하여 도 13에 대해서 설명한다. 도 14는 본 출원의 일 실시예에 따른 관리 서버의 인공 지능 모델을 이용하여 출력된 상품의 가중치 를 기반으로, 패키지 상품의 일 상품을 대체하여 제공하는 동작의 일 예를 설명하기 위한 도면이다. 도 15는 본 출원의 일 실시예에 따른 관리 서버의 일 상품을 대체하여 패키지 상품을 제공하는 동작의 일 예를 설명하 기 위한 도면이다. 일 실시예에 따르면, 관리 서버는 1301 동작에서 추천된 패키지 상품에 포함된 서브 상품들 중 일 상품을 삭제하기 위한 요청을 수신할 수 있다. 예를 들어, 클라이언트 서버는 도 15의 1501에 도시된 바와 같이, 생성된 패키지 상품에 대한 정보를 추천되는 패키지 상품을 나타내는 메뉴 화면에서 상품들(예: A 상품 및 B 상품) 중에서 특정 상품(예: B 상품)을 제거하기 위한 입력(예: 드래그 입력)을 수신할 수 있다. 도시된 바에 제한되지 않고, 특정 상품을 패키지 상품으로부터 제거하기 위한 입력은 드래그 입력 이외에도 다양한 종류의 입력(예: 선택 박스 체크 및 삭제 버튼 클릭, 및/또는 단순 클릭 등)을 포함할 수 있다. 관리 서버는 도 14의 1401에 도시된 바와 같이, 상기 입력에 따라서 클라이언트 서버로부터 특 정 상품(예: B 상품)을 제거하기 위한 입력에 대한 정보를 수신할 수 있다. 일 실시예에 따르면, 관리 서버는 1302 동작에서 우선 순위 및 상품의 가격 정보에 기반하여, 삭제된 상품 대신에 다른 상품을 추천할 수 있다. 관리 서버는 도 14의 1402에 도시된 바와 같이, 인공 지능 모델 로부터 출력된 제품들(예: A 상품, B 상품, C 상품, 및 D 상품) 중에서 제거된 특정 상품(예: B 상품 )의 후순위의 가중치를 갖는 상품들(예: C 상품 및 D 상품) 별 가중치와 가격에 대한 정보를 식별할 수 있다. 관리 서버는 상품들(예: C 상품 및 D 상품) 별 가중치 가격을 곱하여, 곱한 결과 값이 가장 큰 상품 (예: D 상품)을 패키지 상품으로서 상품 가치가 큰 상품으로 식별할 수 있다. 이에 따라, 관리 서버는 추 천되는 패키지 상품을 나타내는 메뉴 화면에 제거된 B 상품 대신에 식별된 D 상품을 표시하여 추천할 수 있다."}
{"patent_id": "10-2021-0171236", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 출원의 일 실시예에 따른 스마트 웹 페이지 생성 시스템에 포함된 장치들의 일 예를 설명하기 위한 도면이다. 도 2는 본 출원의 일 실시예에 따른 관리 서버의 구성의 일 예를 나타내는 블록도이다. 도 3은 본 출원의 일 실시예에 따른 전자 장치의 구성의 일 예를 나타내는 블록도이다. 도 4는 본 출원의 일 실시예에 따른 스마트 웹 페이지 생성 시스템의 동작의 일 예를 설명하기 위한 흐름도이다. 도 5는 본 출원의 일 실시예에 따른 관리 서버 및 클라이언트 서버의 동작의 예를 설명하기 위한 도면이다. 도 6은 본 출원의 일 실시예에 따른 관리 서버로부터 제공되는 홈 페이지를 구성하기 위한 인터페이스의 예를 설명하기 위한 도면이다. 도 7은 본 출원의 일 실시예에 따른 포털 서버에 등록된 홈 페이지의 링크의 예를 나타내는 도면이다. 도 8은 본 출원의 일 실시예에 따른 스마트 웹 페이지 생성 시스템의 동작의 다른 예를 설명하기 위한 흐름도이 다.도 9는 본 출원의 일 실시예에 따른 관리 서버의 인공 지능 모델을 생성하기 위한 정보를 축적하는 동작의 일 예를 설명하기 위한 도면이다. 도 10은 본 출원의 일 실시예에 따른 관리 서버의 상품을 추천하기 위한 인공 지능 모델을 생성하는 동작의 일 예를 설명하기 위한 도면이다. 도 11은 본 출원의 일 실시예에 따른 관리 서버의 인공 지능 모델을 이용하여 패키지 상품을 추천하는 동작의 예를 설명하기 위한 도면이다. 도 12는 본 출원의 일 실시예에 따른 클라이언트 서버에 의해 조건이 설정되는 동작의 예를 설명하기 위한 도면 이다. 도 13은 본 출원의 일 실시예에 따른 스마트 웹 페이지 생성 시스템의 동작의 다른 예를 설명하기 위한 흐름도 이다. 도 14는 본 출원의 일 실시예에 따른 관리 서버의 인공 지능 모델을 이용하여 출력된 상품의 가중치를 기반으로, 패키지 상품의 일 상품을 대체하여 제공하는 동작의 일 예를 설명하기 위한 도면이다. 도 15는 본 출원의 일 실시예에 따른 관리 서버의 일 상품을 대체하여 패키지 상품을 제공하는 동작의 일 예를 설명하기 위한 도면이다."}
