{"patent_id": "10-2024-7027038", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0132506", "출원번호": "10-2024-7027038", "발명의 명칭": "온실 및 원예 시스템", "출원인": "시네테라 인터내셔널 아게", "발명자": "아리아스, 루벤"}}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "자동화된 원예 작물 성장 시스템으로서, 복수의 성장 트레이들이 전처리되고, 성장 베드로 채워지고 식재되는 성장 트레이 준비 스테이션과; 식재된 성장 트레이들을 상기 성장 트레이 준비 스테이션으로부터 원예 작물 성장 시설까지 이송하기 위한 성장트레이 변위 시스템; 을 포함하며, 상기 원예 작물 성장 시설은 제어된 환경 처리 시스템을 갖는 폐쇄 구조물, 하나 이상의 성장 트레이 입구/출구포트, 및 하나 이상의 원예 작물 성장 모듈을 포함하고; 상기 원예 작물 성장 모듈은: 복수의 평행하게 배치된 단-열(single-rowed) 성장 타워들로서, 상기 복수의 평행하게 배치된 단-열 성장 타워들 각각은 수직으로 지지된 성장 트레이들을 수용하고 상기 성장 트레이들을 그 내부의 트레이 위치들 사이에서이송하기 위해 상기 단-열 성장 타워를 따라 그리고 그 내부에서 상기 성장 트레이들을 수직으로 이동시키도록구성되는 것과; 각각의 성장 타워의 상단부로부터 성장 트레이들을 로딩 또는 언로딩하기 위한 상부 트레이 이송 시스템, 및 각각의 성장 타워의 하단부로부터 성장 트레이들을 로딩 또는 언로딩하기 위한 하부 트레이 이송 시스템 중 하나또는 둘 모두를 포함하는 성장 트레이 조작 시스템을 포함하며, 상기 성장 트레이 조작 시스템은: 식재된 성장 트레이들을 상기 성장 트레이 변위 시스템으로부터 상기 성장 트레이 입구/출구 포트를 통해 수용하고 이들을 상기 원예 작물 성장 모듈의 할당된 성장 타워들에 로딩하고; 할당된 성장 타워들 사이에서 상기 성장 트레이들을 상기 원예 작물 성장 모듈 내의 처리 스테이션으로 변위시키고; 그리고 상기 성장 트레이 입구/출구 포트를 통해 상기 원예 작물 성장 설비로부터 성장 트레이들을 변위시킴으로써 성장 트레이들을 언로딩하도록 구성되는, 자동화된 원예 작물 성장 시스템."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 상기 원예 작물 성장 모듈로부터의 성장 트레이들을 수용하도록 구성되는 완제품 스테이션을 더 포함하며, 여기서 성장물은 자동화된 핸즈프리 핸들링 스테이션에서 적절한 조건에서 배송/선적을 위해 준비된 상태에서 채집,포장 및 보관되는, 자동화된 원예 작물 성장 시스템."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제어된 환경 처리 시스템을 구비하고 하나 이상의 성장 트레이 입구/출구 포트를 갖는 폐쇄 구조체, 및 하나 이상의 원예 작물 성장 모듈을 포함하는 원예 작물 성장 설비로서, 각각의 원예 작물 성장 모듈은 복수의 평행으로 배치된 단-열 성장 타워들을 포함하고, 상기 복수의 단-열 타워들 각각은 수직으로 지지된 성장 트레이들의 어레이를 수용하고 상기 단-열 타워를 따라상기 성장 트레이들을 수직으로 이동시키도록 구성되고, 성장 트레이 조작 시스템은 상부 트레이 이송 시스템 및 하부 트레이 이송 시스템 중 하나 또는 둘 모두를 포함하고, 공개특허 10-2024-0132506-3-상기 성장 트레이 조작 시스템은, 식재된 성장 트레이들을 상기 성장 트레이 입구/출구 포트를 통해 수용하고이들을 상기 원예 작물 성장 모듈의 할당된 성장 타워에 로딩하고, 상기 원예 작물 성장 모듈 내의 처리 스테이션들을 통해 상기 성장 트레이들을 변위시키고, 상기 성장 트레이 입구/출구 포트를 통해 상기 원예 작물 성장설비로부터 상기 성장 트레이들을 변위시키도록 구성되는, 원예 작물 성장 설비."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "내지 50 중 어느 한 항에 있어서, 광 조명원이 상기 성장 타워 내의 각각의 성장 트레이와 연관되는, 원예 작물 성장 모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 4에 있어서, 복수의 성장 트레이들을 상기 성장 트레이 입구/출구 포트를 통해 상기 원예 작물 성장 모듈 내로 자율적으로도입하고, 상기 복수의 성장 트레이들을 상기 성장 타워들 내로 자동으로 로딩하고, 상기 성장 트레이들 중 하나 이상을 처리 경로를 따라 변위시켜 상기 성장 트레이들이 상기 처리 경로를 따라 연장되는 처리 스테이션들에서 처리를 받게 하고; 상기 성장 트레이들을 수확할 준비가 되었을 때, 상기 성장 트레이들이 상기 입구/출구포트를 통해 상기 원예 작물 성장 모듈로부터 자율적으로 이송되도록 구성되는, 원예 작물 성장 모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 5에 있어서, 상기 처리 스테이션들은 작물의 성장을 촉진 및 향상시키기 위해 상기 처리 경로를 따라 하나 이상의 처리를 적용하도록 구성되는, 원예 작물 성장 모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 4 내지 6 중 어느 한 항에 있어서, 상기 처리 스테이션들은 관개, 조명, 습도, 공기 온도, 비료/영양, 수소화, 성장 트레이 가열, 상이한 파장에서의 방사선, 유희음(playing sound), 수분, 살균 중 임의의 하나 이상을 포함하는, 원예 작물 성장 모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "에 있어서, 상기 AI 시스템의 센서는 이미징 센서, 온도 센서, 당 함량 분석기, 습도 센서, 화학적 상태 및/또는 특성 센서중 임의의 하나 이상을 포함하는, 원예 작물 성장 모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 4 내지 9 중 어느 한 항에 있어서, 상기 성장 트레이 조작 시스템은 상기 하부 트레이 이송 시스템으로부터 상기 성장 트레이들을 수용하고 이들을상기 상부 트레이 이송 시스템으로 이송하도록 구성되는 성장 트레이 리프트를 포함하는, 원예 작물 성장 모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 10에 있어서, 상기 하부 트레이 이송 시스템, 상기 성장 트레이 리프트, 및 상기 상부 트레이 이송 시스템 중 각각의 하나 이상은 상기 성장 트레이들을 상기 처리 스테이션들 중 하나 이상으로 이송하도록 추가로 구성될 수 있는, 원예작물 성장 모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 10 또는 11에 있어서, 하부 트레이 이송 시스템, 성장 트레이 리프트, 및 상부 트레이 이송 시스템 각각은 임의의 방향으로 성장 트레이들을 이송하기 위해 사용될 수 있는, 원예 작물 성장 모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 4 내지 12 중 어느 한 항에 있어서, 상기 성장 타워들은 수직으로 정렬된 상기 성장 트레이들을 유지하기 위한 성장 트레이 지지 시스템으로 각각구성되고, 최하부의 듀티(duty) 성장 트레이는 상기 지지 시스템의 하부에서 트레이 구속 메커니즘에 의해 구속되고, 각각의 연속적인 성장 트레이는 상기 성장 타워를 따라 이동하도록 쉽게 변위 가능한 다른 성장 트레이위에 지지되는, 원예 작물 성장 모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 4 내지 13 중 어느 한 항에 있어서, 상기 성장 트레이들을 조명하도록 구성되는 조명 시스템을 포함하는, 원예 작물 성장 모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "청구항 4 내지 14 중 어느 한 항에 있어서, 각각의 성장 타워는 슬라이딩 경로를 규정하는 트레이 지지 레일을 포함하고, 성장 타워 내의 트레이들은 중력으로 인해 이를 따라 슬라이딩식으로 변위가능한, 원예 작물 성장 모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "청구항 4 내지 15 중 어느 한 항에 있어서, 관개는 캐스케이드 구성으로 성장 트레이들에 적용되고, 관개는 성장 타워 내의 상부 성장 트레이들에적용되고, 관개 액체는 중력에 의해 서로 아래의 성장 트레이들로 유동하는, 원예 작물 성장 모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "청구항 4 내지 16 중 어느 한 항에 있어서, 상기 성장 트레이들은 그 상부에 배치된 관개 입구 포트 및 그 하부에 배치된 관개 출구 포트로 구성되어 상기공개특허 10-2024-0132506-5-포트들 사이에서 연장되는 관개 유로를 규정하는, 원예 작물 성장 모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "청구항 17에 있어서, 상기 성장 트레이들의 관개 출구 포트는, 상기 성장 트레이들을 서로의 상부에 적층할 때만, 이웃하는 하부의성장 트레이의 입구 포트에 구성되는 밸브 개방 부재에 의해 개방되도록 구성되는 상시 폐쇄 밸브를 포함하는,원예 작물 성장 모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "청구항 17 또는 18에 있어서, 상기 관개 입구 포트 및 상기 관개 출구 포트 중 하나 또는 둘 모두는 여과 배열로 구성되는, 원예 작물 성장모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "청구항 17 내지 19 중 어느 한 항에 있어서, 성장 타워 내의 최하부 성장 트레이는 상기 밸브 개방 메커니즘 위에 배치될 때 상기 최하부 성장 트레이의 관개 출구 포트의 밸브를 개방하도록 구성되는 밸브 개방 메커니즘에 의해 선택적으로 맞물리는, 원예 작물 성장모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "청구항 17 내지 20 중 어느 한 항에 있어서, 상기 성장 트레이들은 상기 관개 입구 포트로부터 수용된 관개 액체를 살수하도록 구성되는 천공된 트로프 요소를 포함하는, 원예 작물 성장 모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "청구항 17 내지 21 중 어느 한 항에 있어서, 내부로 도입된 성장 트레이들에 상기 관개 입구 포트를 통해 관개 액체를 공급하도록 구성되는 관개 스테이션을포함하는, 원예 작물 성장 모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "청구항 22에 있어서, 상기 관개 스테이션은 관개 출구 포트를 통해 상기 성장 트레이들에 축적된 잔류 관개 액체를 배출하도록 구성되는, 원예 작물 성장 모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "청구항 23에 있어서, 상기 관개 스테이션은 상기 잔류 액체를 배수하도록 구성되는 틸팅 메커니즘을 포함하는, 원예 작물 성장 모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "청구항 4 내지 24 중 어느 한 항에 있어서, 밸브가 여과 장치와 연관되고, 이에 의해 밸브에 도달하는 액체가 여과되는, 원예 작물 성장 모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "에 있어서, 관개 액체를 처리하고 상기 관개 액체를 재활용하도록 구성되는, 원예 작물 성장 모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_28", "content": "청구항 26 또는 27에 있어서, 배수 용기들이 서로 유동 연통하거나, 공통 배수 용기가 원예 작물 성장 모듈의 2개 이상의 성장 타워들을 위해구성되는, 원예 작물 성장 모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "청구항 4 내지 28 중 어느 한 항에 있어서, 상기 원예 작물 성장 모듈 내의 상기 성장 타워들 중 하나 이상으로부터 배수된 관개 액체는 외부 관개 액체 처리 스테이션에 직접 수집되는, 원예 작물 성장 모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_30", "content": "청구항 4 내지 28 중 어느 한 항에 있어서, 상기 원예 작물 성장 모듈 내의 상기 성장 타워들 중 하나 이상으로부터의 배수된 관개 액체는 상기 성장 타워내의 성장 트레이들을 따라 중력에 의해 유동하고, 타워 내의 모든 성장 트레이들을 통해 유동한 후에, 상기 관개 액체는 상기 성장 모듈 내부 또는 외부에서 관개 액체 처리 스테이션으로 유동하며, 상기 관개 액체는 상기관개 액체를 분석하고 처리한 후에 재순환되는, 원예 작물 성장 모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_31", "content": "청구항 4 내지 30 중 어느 한 항에 있어서, 상기 성장 타워들은 측부 바(bars)들 사이에 지지된 성장 트레이들의 수직 스택을 수용하도록 구성되고, 최하부성장 트레이는 트레이 구속 메커니즘에 의해 구속가능하고, 연속적인 성장 트레이들은 서로의 상부에 배치되어,상기 트레이 구속 메커니즘으로부터 상기 최하부 트레이를 분리하는 것은 상기 최하부 트레이를 상기 하부 트레이 이송 시스템 상으로 로딩하는 것을 용이하게 하고, 중력 하에서 상기 성장 타워 내에서 상기 성장 트레이들의 하향 시프팅을 추가로 수반하는, 원예 작물 성장 모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_32", "content": "청구항 4 내지 31 중 어느 한 항에 있어서, 상기 바닥 트레이 이송 시스템은 평행하게 배치되고 상기 성장 트레이들의 바닥 표면의 반대면을 지탱하도록 구성되는 한 쌍의 컨베이어 체인을 포함하는, 원예 작물 성장 모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_33", "content": "청구항 4 내지 32 중 어느 한 항에 있어서, 트레이 구속 메커니즘이 상기 성장 타워의 바닥 부분에 구성되고, 상기 트레이 구속 메커니즘은, 하나 이상의방해 요소가 돌출되어 최하부 성장 트레이를 상기 성장 타워에 고정하는 정상 트레이 구속 위치와, 하나 이상의방해 요소가 수축되어 상기 성장 타워로부터 최하부 성장 트레이를 해제하는 해제 위치 사이에서 조작가능한,원예 작물 성장 모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_34", "content": "청구항 33에 있어서, 상기 성장 타워의 트레이 구속 메커니즘은 동시 동작을 위해 구성되고, 이에 의해 상기 원예 작물 성장 모듈 내의 모든 트레이 구속 메커니즘은 각각의 트레이 정지 위치와 해제 위치 사이에서 동시에 시프트하거나, 또는 컨트롤러로부터 수신된 명령 신호에 따라 시프트하도록 구성되고, 임의의 하나 이상의 트레이 구속 메커니즘은 개공개특허 10-2024-0132506-7-별적으로 동작될 수 있는, 원예 작물 성장 모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_35", "content": "청구항 33 또는 34에 있어서, 상기 트레이 구속 메커니즘은, 상기 원예 작물 성장 모듈의 바닥부에 회전가능하게 고정되고 각각의 성장 타워에 인접하게 배치된 나사부를 갖도록 구성되는 작동 로드; 적어도 하나가 각각의 성장 타워와 관련된 복수의 나사형 라이더; 각각의 나사부 위에 맞물리고 상기 작동 로드를 따른 축방향 변위를 위해 구속된 각각의 라이더를포함하고; 각각의 라이더는 트레이 맞물림 부재를 포함하며; 이에 의해 한 방향으로 나사형 로드를 회전시키는것은 상기 트레이 구속 메커니즘을 트레이 구속 위치로 변위시키기 위한 라이더의 동시 축방향 변위를수반하고, 반대 방향으로 나사형 로드를 회전시키는 것은 상기 트레이 구속 메커니즘을 구속 해제 위치로 변위시키기 위한 라이더의 동시 축방향 변위를 수반하는, 원예 작물 성장 모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_36", "content": "청구항 35에 있어서, 상기 트레이 맞물림 부재는 상기 라이더로부터 돌출되고 상기 최하부 트레이의 개구 내에서 구속되도록 구성되는 핀인, 원예 작물 성장 모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_37", "content": "청구항 33 내지 36 중 어느 한 항에 있어서, 상기 트레이 구속 메커니즘은 한 쌍의 대향하는 핀을 포함하고, 이에 의해 트레이 구속 위치에서 상기 핀들이서로를 향해 변위되고, 해제 위치에서 상기 핀들이 서로로부터 멀리 변위되는, 원예 작물 성장 모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_38", "content": "청구항 33 또는 34에 있어서, 상기 하부 트레이 이송 시스템은 상기 성장 타워 아래로 연장되는 하나 이상의 레일, 및 상기 하나 이상의 레일을 따라 이동하고 상기 성장 타워들 중 선택된 하나로부터 성장 트레이를 이송 또는 수용하도록 구성되는 프레임 구조체를 포함하는, 원예 작물 성장 모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_39", "content": "청구항 38에 있어서, 상기 프레임 구조체는 상기 성장 타워의 상기 트레이 구속 메커니즘을 결합하고 상기 트레이 구속 위치와 상기해제 위치 사이에서 상기 트레이 구속 메커니즘을 제어가능하게 변경하도록 구성되는 조작기 유닛을 포함하는,원예 작물 성장 모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_40", "content": "청구항 38 또는 39에 있어서, 상기 프레임 구조체는 성장 트레이를 이송하여 상기 성장 타워로 이송하거나, 상기 성장 타워로부터 성장 트레이를 수용하도록 구성되는 리프트 조립체를 포함하는, 원예 작물 성장 모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_41", "content": "청구항 40에 있어서, 상기 성장 트레이를 상기 성장 타워로 전달할 때 상기 트레이 구속 메커니즘을 해제 위치로 변경하고, 그 후에전달된 성장 트레이를 상기 성장 타워의 최하부 트레이 위치에 고정하기 위해 상기 트레이 구속 메커니즘을 트레이 구속 위치로 다시 변경하도록 구성된, 원예 작물 성장 모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_42", "content": "청구항 40 또는 41에 있어서, 공개특허 10-2024-0132506-8-상기 성장 타워로부터 상기 성장 트레이를 수용할 때 트레이 구속 메커니즘을 해제 위치로 변경하고, 그 후에하향 병진된 성장 트레이를 상기 타워의 최하부 트레이 위치에 고정하기 위해 상기 트레이 구속 메커니즘을 트레이 구속 위치로 다시 변경하도록 구성된, 원예 작물 성장 모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_43", "content": "청구항 4 내지 42 중 어느 한 항에 있어서, 상기 성장 트레이들은 평평한 성장 부분 및 트레이의 대향 측면 단부에 배치된 2개의 평행한 직립 측면 프레임을 갖는, 금속 또는 플라스틱 재료로 제조된 솔리드 트레이이고, 성장 타워 내의 성장 트레이들은 상부 성장 트레이의 바닥 표면이 이웃하는 바닥 성장 트레이의 측면 프레임 위에 놓이도록 구성되는, 원예 작물 성장 모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_44", "content": "청구항 43에 있어서, 상부 성장 트레이에서 상시 폐쇄 밸브를 개방하기 위해, 이웃하는 바닥 성장 트레이의 직립 측면 프레임에 밸브개방 부재가 구성되는, 원예 작물 성장 모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_45", "content": "청구항 43 또는 44에 있어서, 성장 트레이들이 트레이의 바닥 또는 그 직립 프레임에서 성장 트레이 리프트에 의해 맞물리는, 원예 작물 성장모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_46", "content": "청구항 43 내지 45 중 어느 한 항에 있어서, 상기 성장 트레이들의 직립 측면 프레임은 맞물림 리세스를 갖도록 구성되고, 상기 상부 트레이 이송 시스템은하나 이상의 픽업 후크를 수용하고 상기 측면 레일을 따라 변위 가능하며 상기 맞물림 리세스를 선택적으로 구속하도록 구성되는 2개의 측면 레일을 갖도록 구성되는, 원예 작물 성장 모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_47", "content": "청구항 46에 있어서, 상기 상부 트레이 이송 시스템의 상기 2개의 측면 레일은 상기 원예 작물 성장 모듈 내의 상기 성장 타워 위에고정되고, 상기 하나 이상의 트레이와 맞물리는 것은 상기 측면 레일을 향해 상방으로 성장 트레이들을 변위시킬 때 발생하는, 원예 작물 성장 모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_48", "content": "청구항 4 내지 37 및 43 내지 47 중 어느 한 항에 있어서, 하부 트레이 이송 시스템으로부터 각각의 성장 타워 내로 그리고 각각의 성장 타워로부터 하부 듀티 성장 트레이들을 상승 및 하강시키도록 구성되는 성장 트레이 추진 유닛(propelling unit)을 더 포함하는, 원예 작물 성장 모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_49", "content": "청구항 10 내지 12 중 어느 한 항에 있어서, 상기 상부 트레이 이송 시스템은 또한 입구/출구 포트로 그리고 그로부터 성장 트레이들을 이송하기 위해 장착되는, 원예 작물 성장 모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_50", "content": "청구항 4 내지 49 중 어느 한 항에 있어서, 폐쇄된, 처리된 환경 위치 내에 수용되는 원예 작물 성장 모듈.공개특허 10-2024-0132506-9-청구항 51"}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_52", "content": "청구항 51에 있어서, 상기 광 조명원은 상기 성장 타워의 트레이 지지 레일 상에 및/또는 상기 성장 트레이들의 바닥면에 배치되는,원예 작물 성장 모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_53", "content": "청구항 4 내지 52 중 어느 한 항에 있어서, 각각의 성장 트레이는 판독 가능한 식별자로 구성되고, 이에 의해 각각의 성장 트레이와 연관된 트레이 데이터는 원예 작물 성장 모듈의 컨트롤러에 등록될 수 있는, 원예 작물 성장 모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_54", "content": "청구항 4 내지 53 중 어느 한 항에 있어서, 자율 성장 모듈로서 구성되고, 다른 성장 모듈과 독립적이며, 입구/출구 포트 및 규정된 제어된 환경을 포함하는 성장 사이클을 얻기 위해 필요한 모든 요소가 자가-공급되는, 원예 작물 성장 모듈."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_55", "content": "청구항 4 내지 54 중 어느 한 항에 따른 원예 작물 성장 모듈과 함께 사용되는 원예 작물 성장 방법으로서, i. 복수의 식재된 성장 트레이들을 입구/출구 포트를 통해 원예 작물 성장 모듈에 수용하고, 이들을 하부 트레이 이송 시스템에 의해 이송하는 단계; ii. 상기 하부 트레이 이송 시스템으로부터 성장 타워로 상기 성장 트레이들을 로딩하는 단계; iii. 상기 성장 트레이들이 원예 작물 성장 모듈 내에 배치된 복수의 처리 스테이션들 사이에서 순환되는 성장사이클을 시작하는 단계; iv. 각각의 성장 트레이와 관련된 데이터 및 상기 성장 트레이들에서 성장되는 작물의 숙성과 관련된 데이터를모니터링하고 획득하는 단계; v. 작물이 수확 상태에 있을 때까지 단계 iii 및 iv를 반복하는 단계; vi. 성장 트레이들을 성장 타워로부터 입구/출구 포트로 이송하여 성장 트레이들을 수집하는 단계; 를 포함하는, 방법."}
{"patent_id": "10-2024-7027038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_56", "content": "청구항 55에 있어서, 성장 사이클 전에, 성장 트레이들 및 원예 작물 성장 시설이 성장 트레이 준비 스테이션에서 전처리되어, 부근및 장비를 소독하는, 원예 작물 성장 방법."}
{"patent_id": "10-2024-7027038", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "복수의 성장 트레이들이 전처리되고, 성장 베드로 채워지고 심어지는 성장 트레이 준비 스테이션, 식재된 성장 트레이들을 성장 트레이 준비 스테이션으로부터 원예 작물 성장 시설로 이송하기 위한 성장 트레이 변위 시스템, 제어된 환경 처리 시스템 및 하나 이상의 트레이 입구/출구 포트를 갖는 폐쇄 구조물, 및 하나 이상의 원예 작물 성장 모듈을 포함하는 원예 작물 성장 시스템. 원예 작물 성장 모듈은, 수직으로 지지된 성장 트레이들의 어레 이를 각각 포함하는 복수의 평행하게 배치된 단-열 성장 타워와, 트레이 입구 포트를 통해 식재된 성장 트레이들 을 수용하고 이들을 할당된 성장 타워에 로딩하기 위한, 그리고 성장 타워들 사이에서 그리고 원예 작물 성장 모 듈 내의 처리 스테이션을 통해 성장 트레이들을 변위시키기 위한, 그리고 성장 트레이들을 성장 트레이 출구 포 트로 변위시키기 위한 성장 트레이 조작 시스템을 포함한다."}
{"patent_id": "10-2024-7027038", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시내용은 온실 및 이를 사용하는 원예 시스템에 관한 것이다. 보다 구체적으로, 본 개시내용은 자동화된 온실 및 에코-성장 시스템에 관한 것이다."}
{"patent_id": "10-2024-7027038", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "본 개시된 주제에 대한 배경과 관련된 것으로 간주되는 참조는 아래에 나열된다: - US 2018/0235156 - WO 2019/056057 - WO 2020/098890 본 명세서에서의 상기 참조들의 확인은 이들이 본 개시된 주제의 특허성과 임의의 방식으로 관련된다는 의미로 추론되지 않아야 한다. 배경 미국 특허공개 제2018/235156호는 작물이 성장되는 복수의 용기 및 하나 이상의 모듈형 랙의 수직으로 이격된 레벨 사이에서 용기를 자동으로 이동시키는 하나 이상의 엘리베이터 장치를 포함하는 고밀도 원예 성장 시스템 을 개시한다. 각각의 엘리베이터 장치는 수직으로 이격된 레벨들 사이에서 용기를 이송하는 캐리어 및 수직으 로 이격된 레벨들에서 캐리어로부터 하나 이상의 종방향 지지체 상으로 용기를 밀어내는 램을 포함한다. 제1 이송 장치는 용기를 작물 식재 영역으로부터 각각의 랙으로 적어도 수평으로 이동시키고, 제2 이송 장치는 용기 를 각각의 랙으로부터 작물 저장 영역으로 적어도 수평으로 이동시킨다. 하나 이상의 프로세서는 컨테이너의 이동, 농작물의 급수, 온도, 조명 및 시스템의 다른 파라미터를 제어한다. 복수의 고밀도 원예 성장 시스템은 작물의 성장과 관련된 데이터의 전송 및 수신을 위한 중앙 집중식 데이터 모니터링 및 수집 시스템과 통신한다. 국제 특허공개 WO 2019/056057호는 농작물의 성장 트레이를 위한 입구측 또는 경로 및 출구측 또는 경로를 갖는 기계화된 멀티-레벨 농업 구조물 주위에서 그리고 그를 통해 성장 트레이를 순차적으로 캐리지하기 위한 장치를 개시하며, 상기 캐리지 장치는: 시딩 스테이션으로부터 성장 배지를 포함하는 적어도 하나의 트레이를 이송하기 위해 농업 구조물의 입구측을 따라 배치된 내향 이송기; 상기 적어도 하나의 트레이를 농업 구조물의 선택된 레 벨로 상승시키고 상기 농업 구조물의 입구측 내로 상기 트레이를 삽입하기 위한 직립 엘리베이터; 농업 구조물 의 입구측 및/또는 출구측 외부로의 트레이의 이동을 조정하기 위한 자동 컨트롤러; 농업 구조물의 출구측으로 부터 성숙 농작물을 포함하는 상기 적어도 하나의 트레이를 수용 및 하강시키기 위한 직립 수용기; 상기 적어도 하나의 트레이를 수확 스테이션으로 이송하기 위해 농업 구조물의 출구측을 따라 배치된 외향 이송기; 각각의 상기 적어도 하나의 트레이로부터 성장 배지를 제거하기 위한 성장 배지 제거기; 및 빈 트레이를 비우고 세척하 기 위한 트레이 와셔를 포함한다. 또한, 다단-레벨 농장 구조물 주위 및 이를 통한 성장 트레이의 순차적 이송 을 위한 방법이 개시된다. 국제 특허공개 WO 2009/8890은 내부 공간을 한정하는 하우징을 포함하는 성장 하우스를 개시한다. 내부 공간에 는 하나 이상의 식물과 함께 하나 이상의 트레이 부재를 수용하도록 각각 구성된 여러 개의 수직으로 변위되는 저장 레벨을 포함하는 저장 구조물이 제공된다. 하우징은 개구를 포함하고 불투명하며, 태양광이 내부 공간으 로 유입되는 것을 방지하도록 구성된다. 성장 하우스는 하나 이상의 트레이 부재를 수평 및 수직으로 변위시켜 상기 하나 이상의 트레이 부재를 상기 하우징 외부의 제1 위치와 상기 하우징 내부의 저장 구조체 상의 제2 위 치 사이에서 이송하도록 구성된 이동 가능하게 배열된 이송 유닛을 포함하고, 여기서 복수의 광원은 상기 식물 을 향해 광을 방출하도록 배열된다. 본 개시내용은 대규모 완전 자동화 작물 성장 설비를 포함하는 자동화된 온실 및 원예 성장 시스템에 관한 것이다. 본 개시내용의 제1 양태에 따르면, 다음을 포함하는 원예 작물 성장 시스템이 있다: 복수의 성장 트레이들이 전처리되고, 성장 베드로 채워지고 식재되는 성장 트레이 준비 스테이션; 식재된 성장 트레이들을 성장 트레이 준비 스테이션으로부터 원예 작물 성장 시설로 이송하기 위한 성장 트레이 변위 시스템; 을 포함하고, 원예 작물 성장 시설은 제어된 환경 처리 시스템을 갖는 폐쇄 구조물, 하나 이상의 제어된 성장 트레이 입구/출 구 포트를 포함하고, 복수의 원예 작물 성장 모듈을 포함하고; 각각의 원예 작물 성장 모듈은, 수직으로 지지된 성장 트레이의 어레이를 각각 포함하는 복수의 평행하게 배치 된 단-열 성장 타워, 성장 트레이 입구 포트에서 식재된 성장 트레이들을 수용하고 이들을 성장 타워를 따라 할당된 트레이 위치로 로딩하기 위한, 그리고 할당된 트레이 위치 사이에서 그리고 원예 작물 성장 모듈 내의 처 리 스테이션을 통해 성장 트레이들을 변위시키기 위한, 그리고 성장 트레이들을 성장 트레이 출구 포트로 변위 시키기 위한 성장 트레이 조작 시스템을 포함한다. 용어 '식재된(planted)' 및 '식재한(planting)'은 종자를 파종하거나 어린 식물을 심는 과정을 총칭한다. 본 개시내용의 제2 양태에 따르면, 제어된 환경 처리 시스템을 갖는 폐쇄된 구조물, 및 하나 이상의 제어된 성 장 트레이 입구/출구 포트를 포함하고, 복수의 원예 작물 성장 모듈을 포함하는 원예 작물 성장 시설이 있고; 각각의 원예 작물 성장 모듈은, 수직으로 지지된 성장 트레이의 어레이를 각각 포함하는 복수의 평행하게 배치 된 단-열 성장 타워, 성장 트레이 입구 포트에서 식재된 성장 트레이들을 수용하고 이들을 성장 타워를 따라 할 당된 트레이 위치로 로딩하기 위한, 그리고 할당된 트레이 위치 사이에서 그리고 원예 작물 성장 모듈 내의 처 리 스테이션을 통해 성장 트레이들을 변위시키기 위한, 그리고 성장 트레이들을 성장 트레이 출구 포트로 변위 시키기 위한 성장 트레이 조작 시스템을 포함한다. 본 개시내용의 제3 양태에 따르면, 제어된 환경 처리 시스템 및 하나 이상의 (예를 들어, 제어된) 성장 트레이 입구/출구 포트를 갖는 폐쇄된 구조물을 포함하는 원예 작물 성장 시설에서 사용하기 위한 원예 작물 성장 모듈 이 있고; 각각의 원예 작물 성장 모듈은 복수의 평행하게 배치된 단-열 성장 타워를 포함하고, 복수의 단-열 타 워 각각은 수직으로 지지된 성장 트레이의 어레이를 수용하도록 구성되고, 성장 트레이 입구 포트에서 식재된 성장 트레이들을 수용하고 이들을 할당된 성장 타워에 로딩하고, 원예 작물 성장 모듈 내의 처리 스테이션을 통 해 성장 트레이들을 변위시키고, 성장 트레이들을 성장 트레이 출구 포트로 변위시키기 위한 성장 트레이 조작 시스템을 포함한다. 단-열 성장 타워는 성장 타워를 따라/내에서 성장 트레이들을 수직으로 이동시키도록 구성 될 수 있다. 성장 트레이 조작 시스템은 성장 타워 위로 연장되는 상부 트레이 이송 시스템 및 성장 타워 아래 로 연장되는 하부 트레이 이송 시스템 중 하나 또는 둘 모두를 포함할 수 있다. 또 다른 양태에 따르면, 복수의 성장 트레이들이 전처리되고, 성장 베드로 채워지고 식재되는 성장 트레이 준비 스테이션, 성장 트레이 준비 스테이션으로부터 원예 작물 성장 시설로 식재된 성장 트레이들을 이송하기 위한 성장 트레이 변위 시스템, 제어된 환경 처리 시스템을 갖는 폐쇄 구조물, 하나 이상의 성장 트레이 입구/출구 포트, 및 하나 이상의 원예 작물 성장 모듈을 포함하는 자동화 원예 작물 성장 시스템이 제공된다. 각각의 원 예 작물 성장 모듈은, 수직으로 지지된 성장 트레이들을 수용하고, 성장 트레이들을 그 내부의 트레이 위치 사 이에서 이송하기 위해 성장 트레이들을 단-열 성장 타워를 따라 그리고 그 내부에서 수직으로 이동시키도록 각 각 구성되는, 복수의 평행하게 배치된 단-열 성장 타워, 각각의 성장 타워의 상부 단부로부터 성장 트레이들을 로딩 또는 언로딩하기 위한 상부 트레이 이송 시스템, 및 각각의 성장 타워의 하부 단부로부터 성장 트레이들을 로딩 또는 언로딩하기 위한 하부 트레이 이송 시스템 중 하나 또는 둘 모두를 포함하는 성장 트레이 조작 시스 템을 포함한다. 성장 트레이 조작 시스템은 식재된 성장 트레이들을 성장 트레이 변위 시스템으로부터 성장 트레이 입구/출구 포트를 통해 수용하고 이들을 원예 작물 성장 모듈의 할당된 성장 타워에 로딩하고, 할당된 성장 타워 사이에서 성장 트레이들을 원예 작물 성장 모듈 내의 처리 스테이션으로 변위시키고, 성장 트레이들을 성장 트레이 입구/ 출구 포트를 통해 원예 작물 성장 설비로부터 변위시킴으로써 성장 트레이들을 언로딩하도록 구성될 수 있다. 본 개시내용에 따른 배열은 복수의 성장 트레이들이 성장 트레이 입구 포트를 통해 원예 작물 성장 모듈로 자율 적으로 도입되고 성장 타워 내로 자동으로 로딩되도록 하고, 작물의 성장 사이클은 성장 트레이들을 성장 타워 내의 필수 처리를 포함하는 처리 스테이션에 노출시키는 것 및 성장 트레이들을 처리 경로를 따라 변위시키는 것을 포함하며, 이에 의해 각각의 트레이는 처리 경로를 따라 연장되는 처리 스테이션에서 추가 처리에 노출되 고; 이에 의해 작물을 수확할 준비가 될 때 성장 트레이들은 출구 포트를 통해 원예 작물 성장 모듈로부터 자율 적으로 이송된다. 처리 스테이션은 성장 사이클을 따라 적용되고 작물의 성장을 촉진 및 향상시키도록, 즉 이상적인 성장 조건을 제공하여 신속한 성장, 건강하고 영양가 높은 작물을 얻도록 구성되는 임의의 하나 이상의 처리를 포함할 수 있 다. 이를 위해, 일부 실시예에서 원예 작물 성장 모듈은 인공 지능 시스템(AI)으로 추가로 구성된다. 처리 경 로를 따라 원예 작물 성장 모듈 내에 분포된 복수의 센서는 작물의 성장 사이클과 관련된 그리고 성장 트레이 및 처리 스테이션의 위치 및 상태와 관련된 파라미터 신호를 획득하기 위해 사용된다. 컨트롤러는, 처리 스테 이션들의 동작 및 성장 경로를 따른 성장 트레이들의 자동 변위를 제어하기 위해, 파라미터 신호들을 수신 및 프로세싱하고 그에 응답하여 동작 신호들을 생성하기 위해 사용된다.처리 스테이션들은 관개, 조명, 습도, 공기 온도, 비료/영양, 수소화, 성장 트레이 가열, 상이한 파장에서의 방 사선, 유희음, 수분, 살균 등 중 임의의 하나 이상을 포함할 수 있다. 이러한 처리의 파라미터는, 예를 들어 각 처리의 지속 시간, 강도(예를 들어, 온도, 광 파장 등)를 제어하여, 제어될 수 있다는 것이 이해된다. 처리 스테이션은 여러 처리를 적용하기 위해 사용될 수 있으며, 예를 들어, 관개를 통해 비료/영양이 발생할 수 있다. 가열은 공기 및 관개 액체 및 성장 트레이 등 중 하나 이상을 가열함으로써 적용될 수 있다. 예를 들어, AI 시스템의 센서는 (작물의 숙성도 및/또는 건강과 관련된 데이터, 예를 들어, 작물의 형상, 크기, 밀도, 색상 및 온도를 획득하고 결함 작물 및 해충을 식별하기 위한) 이미징 센서, 당 함량 분석기(예를 들어, 브릭스 미터/브릭스 굴절계), 온도 센서, 습도 센서, (예를 들어, 산도를 측정하고 상이한 화학 물질을 검출하 기 위한) 화학 센서 등 중 임의의 하나 이상을 포함할 수 있다. AI 시스템은 또한 연속적으로 수집된 매개변수 를 기반으로 작물이 수확 상태에 도달하고 원예 작물 성장 모듈에서 배출할 준비가 된 시기를 결정하는 데 적합 하다. 본 개시내용의 특정 실시예에 따르면, 원예 작물 성장 모듈은 성장 타워 아래로 연장되고, 각각 입구/출구 포트 로부터/로 성장 트레이들을 수용/전달하고, 성장 트레이들을 성장 타워 중 적어도 하나의 아래의, 일부 실시예 에서는 각각의 성장 타워 아래의 트레이 로딩/언로딩 스테이션으로 이송하고, 및/또는 예를 들어, 바닥 트레이 이송 시스템으로부터 성장 트레이들을 수용하고, 성장 타워 위로 연장되는 상부 트레이 이송 시스템으로 성장 트레이들을 이송하도록 구성된, 바닥 트레이 이송 시스템을 포함하는 성장 트레이 조작 시스템을 포함한다. 상 부 트레이 이송 시스템은 각각의 성장 타워 위의 트레이 언로딩 스테이션으로 성장 트레이들을 이송하도록 구성 될 수 있다. 하부 트레이 이송 시스템, 성장 트레이 리프트, 및 상부 트레이 이송 시스템 중 각각의 하나 이상은 성장 트레 이들을 성장 트레이 이송 경로를 따라 연장되는 하나 이상의 처리 스테이션으로 이송하도록 추가로 구성될 수 있다. 하부 트레이 이송 시스템, 성장 트레이 리프트, 및 상부 트레이 이송 시스템 각각은 어느 방향으로든 성 장 트레이들을 이송하기 위해 사용될 수 있다. 원예 작물 성장 시스템은 하나 이상의 원예 작물 성장 모듈로부터 성장 트레이들을 수용하도록 구성되는 완제품 스테이션을 추가로 포함할 수 있으며, 여기서 성장물은 자동화된 핸즈프리 핸들링 스테이션에서 적절한 조건에 서 채집되고, 패킹되고, 배송/선적될 준비가 된 상태로 저장된다. 본 개시내용의 제4 양태에 따르면, 본 개시내용에 따른 원예 작물 성장 모듈과 함께 사용되는 원예 작물 성장 방법이 있으며, 이는 하기 단계를 포함한다: i. 복수의 식재된 성장 트레이들을 입구 포트를 통해 원예 작물 성장 모듈에 수용하고 이들을 하부 트레이 이송 시스템에 로딩하는 단계; ii. 상기 하부 트레이 이송 시스템으로부터 상기 성장 타워로 상기 성장 트레이들을 로딩하는 단계; iii. 성장 트레이들이 원예 작물 성장 모듈 내에 배치된 복수의 처리 스테이션 사이에서 순환되는 성장 사이클 을 시작하는 단계; iv. 각 성장 트레이와 관련된 데이터 및 성장 트레이에서 성장되는 작물의 숙성 및/또는 건강에 관한 데이터를 모니터링하고 획득하는 단계; v. 작물이 수확 상태에 있을 때까지 단계 iii 및 iv를 반복하는 단계; vi. 성장 트레이들을 수집하기 위해 성장 타워로부터 출구 포트로 성장 트레이들을 이송하는 단계. 다음의 특징들, 설계들 및 구성들 중 임의의 하나 이상은 다음의 본 개시내용의 상이한 양상들 중 임의의 하나 이상에 개별적으로 또는 다양한 조합들로 적용될 수 있다: - 원예 작물 성장 시스템은 폐쇄된 처리된 환경 위치 내에서 수용될 수 있으며; 처리된 환경이라는 용어는 살충 제 또는 임의의 생물학적 물질, 습도 및 온도 제어 등이 없는 깨끗한 환경을 지칭한다; - 원예 작물 성장 시설은 폐쇄된 처리된 환경 위치 내에 수용될 수 있다; - 원예 작물 성장 모듈은 폐쇄된 처리된 환경 위치 내에 수용될 수 있다; - 성장 트레이 준비 스테이션은 폐쇄된 처리된 환경 위치 내에 수용될 수 있다; - 성장 사이클 전에, 성장 트레이 준비 스테이션, 성장 트레이 및 원예 작물 성장 시설은 부근 및 장비를 소독 하기 위해 사전 처리될 수 있다; - 원예 작물 성장 시설의 하나 이상의 성장 트레이 입구 포트 및 성장 트레이 출구 포트는 균일한 개구일 수 있 거나, 또는 입구 포트 및 출구 포트 각각에 대한 전용 개구일 수 있으며, 시설의 근처에서 제어된 환경을 유지 하기 위한 제어된 도어가 있다; - 원예 작물 성장 시설은 구획화될 수 있으며, 여기서 각각의 원예 작물 성장 모듈은 구획 내에 수용되고, 이들 각각은 제어된 환경이다; - 성장 타워들은 각각 수직으로 정렬된 트레이들을 유지하기 위한 성장 트레이 지지 시스템으로 구성되고, 최하 부의 듀티(duty) 성장 트레이들이 지지 시스템의 하부 부분에서 트레이 구속 메커니즘에 의해 구속되고, 각각의 연속적인 성장 트레이는 다른 성장 트레이 위에 지지되지만, 타워를 따라 이동하도록 용이하게 변위 가능하다; - 성장 트레이 조작 시스템은, 각각의 성장 타워의 상부 단부로부터 성장 타워 내로 성장 트레이들을 로딩(또는 그로부터 이들을 언로딩)하기 위한 상부 트레이 이송 시스템, 및 각각의 성장 타워의 하부 단부로부터 성장 타 워 내로 성장 트레이들을 로딩(또는 그로부터 이들을 언로딩)하기 위한 하부 트레이 이송 시스템 중 하나 또는 둘 모두를 각각 포함할 수 있다; - 성장 트레이 조작 시스템은 성장 트레이들을 성장 타워 내로 전개하고 처리 스테이션과 원예 작물 성장 모듈 의 성장 타워 사이에서 성장 트레이들을 이송하도록 구성된다; - 조명 시스템은 각각의 성장 트레이들을 조명하도록 구성될 수 있다; - 조명 시스템은 성장 타워의 트레이 지지 레일 상에, 및/또는 성장 트레이들의 바닥면에 배치될 수 있다; - 트레이 지지 레일은, 성장 타워 내의 트레이가 중력으로 인해 그곳을 따라 슬라이딩식으로 변위가능한 슬라이 딩 경로를 형성한다; - 관개는 캐스케이드 구성으로 성장 트레이에 적용될 수 있으며, 여기서 관개는 성장 타워에서 하나 이상의 상 부 성장 트레이에 적용되고, 관개 액체는 중력에 의해 서로 아래의 성장 트레이로 흐른다; - 관개는 최상부 성장 트레이에 점적 관개(drip irrigation)에 의해 적용될 수 있다; - 성장 트레이는 그 상부에 배치된 관개 입구 포트, 및 그 하부에 배치된 관개 출구 포트로 구성될 수 있고, 관 개 유로는 상기 포트들 사이에서 연장된다; - 성장 트레이의 관개 출구 포트에 통상 폐쇄된 밸브가 제공될 수 있으며, 상기 밸브는 성장 타워 내에서 서로 의 상부에 성장 트레이들을 적층할 때에만, 이웃하는 하부 성장 트레이의 입구 포트에 구성되는 밸브 개방 부재 에 의해 개방되도록 구성된다; - 관개 입구 포트 및 관개 출구 포트 중 하나 또는 둘 모두는 성장 베드 재료가 성장 트레이들 사이에서 표류하 는 것(drifting)을 방지하기 위한 여과 배열로 구성될 수 있다; - 밸브는 필터링 장치와 연관될 수 있으며, 이에 의해 밸브에 도달하는 액체가 필터링된다; - 성장 타워 내의 최하부 성장 트레이는 상기 밸브 개방 메커니즘 위에 배치될 때 상기 최하부 성장 트레이의 관개 출구 포트의 밸브를 개방하도록 구성되는 밸브 개방 메커니즘에 의해 선택적으로 맞물릴 수 있다; - 성장 타워 내의 최하부 성장 트레이는 배수 용기 위에 배치될 수 있고, 밸브 개방 메커니즘은 상기 배수 용기 위에 배치될 때 상기 최하부 성장 트레이의 관개 출구 포트의 밸브를 개방하도록 구성된다; - 배수 용기는 관개 액체를 처리(예를 들어, 필터링, 영양 성분 첨가, 물 경도 처리, 온도 조절 등)하고 관개 액체를 최상부 성장 트레이로 재순환하도록 구성될 수 있다; - 원예 작물 성장 모듈 내의 배수 용기는 서로 유동 연통할 수 있거나, 공통 배수 용기가 원예 작물 성장 모듈 의 2개 이상의 성장 타워들을 위해 구성될 수 있다; - 원예 작물 성장 모듈 내의 하나 이상의 성장 타워로부터 배출된 관개 액체는 외부 관개 액체 처리 스테이션으 로 직접 수집될 수 있다; - 원예 작물 성장 모듈 내의 하나 이상의 성장 타워로부터 배출된 관개 액체는 성장 타워 내의 성장 트레이들을 따라 중력에 의해 유동하고, 타워 내의 모든 성장 트레이들을 통해 유동한 후에 관개 액체는 성장 모듈 내부 또 는 외부의 관개 액체 처리 스테이션으로 유동하며, 여기서 관개 액체는 분석 및 처리, 즉 세척, 영양분 및 미네 랄 첨가, 경도 및 pH 처리 등의 후에 재순환된다; - 각각의 성장 트레이는 판독 가능한 식별자, 예를 들어, 바코드, QR 코드, 컬러 코드, RFID, 디지털 코드 등과 같은 트레이 ID 코드로 구성될 수 있으며, 이에 의해 각각의 성장 트레이와 연관된 트레이 데이터는 컨트롤러에 등록될 수 있다; - 트레이 데이터는 성장 트레이의 위치 및 상태에 관한 데이터, 및/또는 상기 성장 트레이 상에서 성장하는 작 물의 성장 주기에 관한 데이터를 포함할 수 있다; - 센서들로부터의 데이터 및 제어 신호들은 외부 제어 스테이션으로 (예를 들어, 무선으로 및/또는 직렬/병렬 데이터 버스를 통해) 송신될 수 있다; - 경보 신호는 시스템의 오작동의 검출시 및 작물의 성장 주기를 따른 이상 파라미터의 검출시에 생성될 수 있 다; - 성장 타워는 측부 바(bars)들 사이에 지지되는 성장 트레이의 수직 스택을 수용하도록 구성되고, 최하부 성장 트레이는 트레이 구속 메커니즘에 의해 구속가능하며, 연속적인 성장 트레이는 서로의 상부에 배치되고, 이에 의해 트레이 구속 메커니즘으로부터 최하부 트레이를 분리하는 것은 하부 트레이 이송 시스템 상으로의 최하부 트레이의 로딩을 용이하게 하고, 중력의 힘 하에서 성장 트레이 내의 성장 트레이의 하향 시프팅을 추가로 수반 한다; - 바닥 트레이 이송 시스템은, 평행하게 배치되고 성장 트레이의 바닥 표면의 반대측을 지지하도록 구성되는 한 쌍의 컨베이어 체인에 의해 구현될 수 있다; - 광 조명 장치는 성장 타워 내의 각각의 성장 트레이와 연관될 수 있다; - 광 조명 장치는 성장 타워의 측면 바들에 관절 연결될 수 있다; - 각 성장 트레이는 두 측면에서 조명될 수 있다; - 성장 타워의 바닥 부분에 트레이 구속 메커니즘이 구성되고, 상기 트레이 구속 메커니즘은 하나 이상의 방해 요소가 최하부 성장 트레이 아래의 공간으로 돌출하는 통상 트레이 구속 위치와, 하나 이상의 방해 요소가 상기 공간으로부터 후퇴되어 최하부 성장 트레이가 성장 타워로부터 변위되는 해제 위치 사이에서 조작가능하다; - 트레이 구속 메커니즘의 하나 이상의 방해 요소는 상이한 메커니즘, 예를 들어 솔레노이드, 캠-및-종동자, 유 압/공압 피스톤, 전기 모터 등에 의해 구동될 수 있다; - 원예 작물 성장 모듈 내의 성장 타워의 트레이 구속 메커니즘은 동시 동작을 위해 구성될 수 있고, 이에 의해 원예 작물 성장 모듈 내의 모든 트레이 구속 메커니즘은 각각의 트레이 구속 위치와 해제 위치 사이에서 동시에 시프트되거나, 트레이 구속 메커니즘은 컨트롤러로부터 수신된 명령 신호에 따라 시프트될 수 있으며, 여기서 임의의 하나 이상의 트레이 구속 메커니즘은 개별적으로 동작될 수 있다; - 특정 예에 따르면, 트레이 구속 메커니즘은, 원예 작물 성장 모듈의 바닥 부분에 회전가능하게 고정되고 각각 의 성장 타워에 인접하게 배치된 나사부를 갖도록 구성되는 작동 로드; 적어도 하나가 각각의 성장 타워와 연관 된 복수의 나사형 라이더를 포함하고; 각각의 라이더는 각각의 나사부 위에 맞물리고 작동 로드를 따른 축방향 변위를 위해 구속되고; 각각의 라이더는 트레이 맞물림 부재를 포함하며; 이에 의해 나사형 로드를 일 방향으로 회전시키는 것은 트레이 구속 위치로의 라이더의 동시 축방향 변위를 수반하고, 나사형 로드를 반대 방향으로 회전시키는 것은 해제 위치로의 라이더의 동시 축방향 변위를 수반한다; - 트레이 맞물림 부재는 라이더로부터 돌출되고 최하부 트레이의 하부 부분에서의 개구 내에서 구속되도록 구성 되는 핀일 수 있다; - 트레이 구속 메커니즘은 한 쌍의 대향 핀들을 포함할 수 있으며, 이에 의해 트레이 구속 위치에서 상기 핀들 은 서로를 향해 변위되고, 해제 위치에서 상기 핀들은 서로로부터 멀리 변위된다; - 성장 트레이는 평평한 성장 부분 및 트레이의 대향 측면 단부에 배치된 2개의 평행한 직립 측면 프레임을 갖 는 금속 또는 플라스틱 재료로 제조된 고체 트레이일 수 있으며, 여기서 성장 타워 내의 성장 트레이는 상부 성 장 트레이의 바닥 표면이 이웃하는 하부 성장 트레이의 측면 프레임 위에 놓이도록 구성된다;- (통상 폐쇄된 밸브를 상부 성장 트레이에서 개방하기 위한) 밸브 개방 부재가 이웃하는 하부 성장 트레이의 직립 측면 프레임에 구성된다; - 성장 트레이는 트레이의 바닥 또는 그 직립 프레임에서 성장 트레이 리프트에 의해 맞물릴 수 있다; - 성장 트레이의 직립 측면 프레임은 맞물림 리세스를 갖도록 구성될 수 있고, 상부 트레이 이송 시스템은 복수 의 픽업 후크를 각각 수용하고, 상기 측면 레일을 따라 변위 가능하며, 상기 맞물림 리세스와 선택적으로 구속 되도록 구성되는 2개의 측면 레일을 갖도록 구성될 수 있다; - 상부 트레이 이송 시스템의 2개의 측면 레일은 원예 작물 성장 모듈 내의 성장 타워 위에 고정될 수 있으며, 여기서 하나 이상의 트레이와 맞물리는 것은 성장 트레이들을 상기 측면 레일을 향해 위로 변위시킬 때 발생한 다; - 작물을 수확하는 것은 선택적일 수 있으며, 이에 의해 미리 규정된(예를 들어, 성숙기) 단계에 도달하는 작물 만이 수확된다; - 원예 작물 성장 모듈은 각각의 성장 타워 내로/로부터 하부 트레이 이송 시스템으로부터/로 하부 듀티 성장 트레이들을 상승 또는 하강시키도록 구성되는 성장 트레이 추진 유닛을 포함할 수 있다; - 각각의 성장 모듈은 다른 성장 모듈과 독립적으로 자율 성장 모듈로서 구성될 수 있고, 입구/출구 포트 및 한 정된 제어된 환경을 포함하는 성장 사이클을 얻기 위해 필요한 모든 요소가 자체 공급될 수 있다; - 상부 트레이 이송 시스템은 또한 성장 트레이들을 출구/입구 포트로 그리고 그로부터 이송하기 위해 장착될 수 있다; - 성장 트레이들은 관개 입구 포트로부터 수용된 관개 액체를 분사하도록 구성되는 천공된 트로프 요소를 포함 할 수 있다; - 원예 작물 성장 모듈은 관개 입구 포트를 통해 내부로 도입된 성장 트레이들에 관개 액체를 공급하도록 구성 되는 관개 스테이션을 포함할 수 있다; - 관개 스테이션은 관개 출구 포트를 통해 성장 트레이들에 축적된 잔류 관개 액체를 배출하도록 구성될 수 있 다; - 관개 스테이션은 잔류 액체를 배출하도록 구성되는 틸팅 메커니즘을 포함할 수 있다; - 바닥 트레이 이송 시스템은 성장 타워들 아래로 연장되는 하나 이상의 레일들, 및 하나 이상의 레일들을 따라 이동하고 성장 타워들 중 선택된 하나로부터 성장 트레이를 이송 또는 수용하도록 구성되는 프레임 구조체를 포 함할 수 있다; - 프레임 구조체는 성장 타워의 트레이 구속 메커니즘을 결합하고 트레이 구속 위치와 해제 위치 사이에서 그것 을 제어가능하게 변경하도록 구성되는 조작기 유닛을 포함할 수 있다; - 프레임 구조체는 성장 트레이들을 이송하여 성장 타워로 운반하거나 성장 타워로부터 성장 트레이를 수용하도 록 구성되는 리프트 조립체를 포함할 수 있다; - 원예 작물 성장 모듈은 성장 트레이들을 성장 타워로 전달할 때 트레이 구속 메커니즘을 해제 위치로 변경하 고, 그 후 전달된 성장 트레이를 성장 타워의 최하부 트레이 위치에 고정하기 위해 트레이 구속 메커니즘을 다 시 트레이 구속 위치로 변경하도록 구성될 수 있다; - 원예 작물 성장 모듈은 성장 타워로부터 성장 트레이를 수용할 때 트레이 구속 메커니즘을 해제 위치로 변경 하고, 그 후에 하향 병진된 성장 트레이들을 성장 타워의 최하부 트레이 위치에 고정하기 위해 트레이 구속 메 커니즘을 다시 트레이 구속 위치로 변경하도록 구성될 수 있다."}
{"patent_id": "10-2024-7027038", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "먼저, 10으로 표시된 본 발명의 예에 따른 원예 작물 성장 시스템을 개략적으로 도시하는 도면의 도 1a에 주목 한다. 원예 작물 성장 시스템은 일반적으로 12로 지정된 성장 트레이 준비 스테이션, 일반적으로 13으로 지정된 완제품 스테이션, 및 일반적으로 14로 지정된 원예 작물 성장 시설을 포함한다. 성장 트레이 취급 및 준비 스테이션은 성장 트레이를 세정 및 소독하고, 성장 배지(즉, 임의의 유형의 처리 된 성장 토양, 천연 또는 인공, 또는 이들의 혼합물)를 적용하고, 성장 재료의 적용, 즉, 식재 또는 파종을 위 해 구성된 폐쇄형의, 전형적으로 처리된 환경이다. 용어 '처리된 환경(treated environment)'은 살충제 또는 생물학적 물질, 습도 및 온도 제어 등이 실질적으로 없는 깨끗한 환경을 의미한다. 일단 준비되면, 복수의 성장 트레이가 성장 트레이 준비 스테이션으로부터 전개되고 원예 작물 성장 시 설을 향해 이송 시스템을 통해 이송된다. 이송 시스템은 폐쇄된 환경 시스템(즉, 처리된 환경을 통해 연장되는)일 수 있거나, 원예 작물 성장 시스템은 그 전체가 처리된 환경 내에 수용될 수 있다는 것이 이해된다. 원예 작물 성장 시설은 일반적으로 25i 내지 25v로 번호가 매겨진 25로 지정된 하나 이상(본 예에서는 5 개)의 원예 작물 성장 모듈을 포함하는 폐쇄된 구조이며, 이들 각각은 별개의 처리된 환경이다. 각 원예 작물 성장 모듈은 (예를 들어, 길로틴형) 도어가 끼워진 성장 트레이 입구/출구 포트를 포함하며, 이를 통해 성장 트레이의 입구/출구를 용이하게 하는 폐쇄 위치와 개방 위치 사이에서 변위가능하다. 다음 도면에서 원예 작물 성장 모듈의 벽은 명확성을 위해 제거되었다. 각각의 성장 모듈은 다른 성장 모듈과 독립적으로 자율 성장 모듈로서 구성될 수 있고, 아래에서 논의되는 바와 같이 입구/출구 포트 및 한정된 제어 환경을 포함하는 성장 사이클을 얻기 위해 필요한 모든 요소가 자체 공급 될 수 있다는 것이 이해된다. 각 원예 작물 성장 모듈은 일반적으로 30으로 지정된 복수의 단-열(single-rowed) 성장 타워로 구성되고, 각각은 수직으로 지지된 성장 트레이의 어레이를 수용하도록 구성된다. 원예 작물 성장 모듈은 또한 성장 트레이 입구 포트에서 식재된 성장 트레이를 수용하고 이들을 성장 타워에서 할당된 트레이 위치로 적재하기 위한, 그리고 할당된 트레이 위치 사이에서 그리고 원예 작물 성장 모듈 내의 처리 스테이션을 통해 성장 트레이를 변위시키기 위한, 그리고 성장 트레이를 성장 트레이 출구 포트로 변위시키기 위한 성장 트 레이 조작 시스템으로 구성되며, 이는 본 명세서에서 보다 상세히 설명될 것이다. 본 예에서, 각각의 원예 작 물 성장 모듈은 30i 내지 30x로 지정된 10개의 성장 타워를 포함한다. 성장 트레이 조작 시스템은 성장 타워 아래로 연장되고 입구/출구 포트로부터/로 성장 트레이를 수 용/전달하고, 성장 트레이를 각각의 성장 타워(30i 내지 30x) 아래의 일반적으로 40으로 지정된 트레이 로 딩/언로딩 스테이션(각각의 성장 타워와 동일한 인덱스 40i 내지 40x로 넘버링됨)으로 이송하도록 구성된 일반 적으로 35로 지정된 하부 트레이 이송 시스템으로 구성된다. 하부 트레이 이송 시스템은, 원예 작물 성장 모듈의 대향 단부에 위치되고, 하부 트레이 이송 시스템으로부터 성장 트레이를 수용하고, 이들을 원예 작물 성장 모듈을 따라 그리고 성장 타워(40i 내지 40x) 위로 연장되는, 일반적으로 48로 지정된 상부 트레이 이송 시스템으로 이송하도록 구성되는, 45로 지정된 성장 트레이 리프트로 성장 트레이를 이송하도 록 구성되고, 여기서, 아래에 설명되는 바와 같이, 상부 트레이 이송 시스템은 성장 트레이를, 일반적 으로 50으로 지정된, 각각의 성장 타워 위의 트레이 언로딩 스테이션(각각의 성장 타워와 동일한 인덱스 50i 내지 50x로 넘버링됨)으로 이송하도록 구성된다. 본 개시내용의 다른 예에 따르면, 상부 트레이 이송 시스 템은 또한 출구/입구 포트로 그리고 그로부터 성장 트레이를 이송하기 위해 끼워질 수 있으며, 상기 출구/ 입구 포트는 단일 포트 또는 보조 포트, 즉, 포트에 추가하여 구성될 수 있다. 또한, 도 11a 및 도 11b는 성장 배지(도면에 도시되지 않음)를 수용하도록 구성된 주변 측벽을 갖는 트레이 형 부분, 및 각각 성장 트레이의 각각의 단부 근처에 배치되고 스크린 커버에 의해 덮이는 2개의 통상 폐쇄식 밸브로 구성된, 트레이형 부분을 포함하는 성장 트레이를 예시하여, 토양 또는 성장 배지가 아래에서 논의되는 바와 같이 오작동하는 밸브 작동을 방지하도록 한다. 성장 트레이는, 그의 각각 의 단부에서, 중공의 관형 세그먼트를 조작하는 밸브가 그 최상부의 중심에 끼워지는 프레임 지지부, 및 프레임의 상부 바를 따라, 픽업 후크 맞물림 개구를 한정하는 개구를 갖는 맞물림 리세스로 추가로 구성된다. 맞물림 리세스는 제1 좁은 섹션(76i), 제2 좁은 섹션(76ii) 및 제1 좁은 섹션(76i)과 제 2 좁은 섹션(76ii) 사이를 연결하는 중간 넓은 섹션(76iii)을 갖는 것을 알 수 있다. 추가로 알 수 있는 바와 같이, 도 7b, 도 7c, 도 7d, 도 8b, 도 8c 및 도 11b에서 가장 잘 볼 수 있는 바와 같 이, 밸브는 하부 출구 개구로 연장되는 상부 입구 개구를 갖는 관형 하우징을 포함하며, 이때 밀봉 버섯-형 플런저는 코일형 스프링에 의해 정상 폐쇄 위치로 편향된다(도 7c). 따라서, 상기 배열 은 플런저가 상부 입구 개구 위에 밀봉식으로 지지될 때 밸브가 정상적으로 밀봉되지만, 이웃하는 하부 트레이의 밸브 조작 중공 관형 세그먼트가 하부 출구 개구 내로 관통할 때 개방 위치(예를 들어, 도 7b 및 도 8b 참조)로 변위되어, 상부 입구 개구로부터 분리된 플런저를 개방 위치로 변위시키고, 여 기서 액체는 아래에서 추가로 논의되는 바와 같이, 화살표 라인(도 7b 참조)을 따라 상부 트레이로부터 관 형 세그먼트 내로 그리고 이웃하는 하부 트레이로 아래로 유동할 수 있다. 이제, 트레이 조작 시스템의 요소들에 대한 추가의 관심이 지향된다. 먼저 하부 트레이 이송 시스템(예를 들어, 도 4a, 도 4c, 도 5b, 도 8b 및 도 8c 참조)을 참조하면, 각각이 무한 트레이 이송 벨트를 수용하는 이중 중공 프로파일의 형태인 한 쌍의 평행하게 연장되는 지지 레일이 있으며, 여기서 벨트의 상부 부분은 중공 프로파일 중 상부 프로파일에서 리세스를 통해 약간 돌출하고, 이송 벨트는 아이들 풀리 (도 4c 및 도 5c 참조) 및 전기 모터와 결합되는 풀리 로드 위에 고정된 구동 풀리 위에서 텐셔닝된다. 이 배열은 하부 트랜싯 성장 트레이(20b)의 하부 표면이 (중공 프로파일을 통해 돌출하는) 이송 벨트를 지지하도록 구성되고, 이에 의해 (모터를 어느 방향으로 회전시킬 때) 이송 벨트를 변위시키는 것은 입구/출구 포트에 인접한 입구/출구 스테이션과 성장 트레이 리프트에 인접한 성장 트 레이 리프트 위치 사이에서 연장되는 경로를 따른 위치들 사이에서 하부 트랜싯 성장 트레이(20b)의 대응하는 선형 변위를 수반한다. 이송 벨트의 외부 표면 및/또는 성장 트레이의 바닥 표면은 마찰 향상 장치로 구성될 수 있음을 이해해야 한다. 트레이 조작 시스템의 일부인 다음 서브-조립체는 바닥 트레이 이송 시스템의 원위 단부에 인접하게 배치되 고 그로부터 한 번에 트레이를 수용하고 상부 트레이 이송 시스템을 향해 트레이를 상승시키도록 구성된, 일반적으로 45로 지정된 성장 트레이 리프트이다. 도 5a, 도 5c 및 도 5d를 참조하면, 성장 트레이 리프트는 사다리형 강성 프레임 구조체에 의해 지지 되는 무단 벨트를 포함하고, 상기 무단 벨트는 프레임에 동축으로 결합된 한 쌍의 상부, 아이들 풀리와, 축 상에 동축으로 장착된 한 쌍의 하부, 구동 풀리 사이에서 인장되고, 축은 체인(13 8)을 통해 전기 모터에 결합된다(도 5c 참조). 복수의 쌍의 성장 트레이 지지 아암은 무단 벨트 에 견고하게 고정되고, 무단 벨트가 모터에 의해 회전됨에 따라, 프레임 주위에서 캐러셀- 유사 방식으로 변위가능하다. 성장 트레이 지지 아암은 한 쌍의 아암이 트레이 수집 위치에 배치될 때, 이들이 하부 트레이 이송 시스템의 원위 단부에서 하부 듀티 성장 트레이(20db)(도 5e 참조) 아래로 연장되 도록 구성되고, 이에 의해 듀티 성장 트레이(20db)는 성장 트레이 리프트에 의해 20dt(도 10b 참조)로 지정되고 상부 트레이 이송 시스템에 의해 수집될 준비가 된 상부 레벨로 상승될 수 있다. 이제 상부 트레이 이송 시스템을 참조하면, 도 10b에 도시된 바와 같이, 길이방향 레일에 의해 각각 지지되고 아이들 풀리(도 4a에 더 잘 도시된 바와 같이 성장 트레이 리프트 뒤에서 연장됨)와 구동 풀 리(도 4d에 도시된 바와 같이, 30x로 지정된 트레이 로딩/언로딩 스테이션되기 전에 연장) 사이에서 각각 인장되는 2개의 평행하게 연장되는 무한 벨트들을 포함하며, 상기 구동 풀리들은 전기 모터에 의한 회전을 위해 결합된 액슬 상에 동축으로 장착된다. 2개의 무단 벨트는 각각 복수의 동일하게 이격된 쌍의 픽업 후크와 함께 구성되며, 각각의 픽업 후크 는 반전된 버섯형 단면을 갖고, 즉, 버섯 줄기 유사 부분이 무단 벨트에 관절운동되도록 벨트로부터 반경 방향으로 연장되며, 이에 의해 구성은 픽업 후크가 무단 벨트의 바닥 경로로부터 거꾸로 현수되도록 이루 어진다. 도 9b 및 도 9c에서 가장 잘 볼 수 있는 바와 같이, 픽업 후크의 스템 부분의 두께는 그를 통과 시키기 위해 맞물림 리세스의 좁은 부분(76i, 76ii)의 폭보다 작고, 픽업 후크의 헤드-형 부분의 직경 은 그를 통과시키기 위해 맞물림 리세스의 넓은 부분(76iii)의 두께보다 크다. 그러나, 픽업 후크의 헤드형 부분의 직경은 후크 맞물림 개구의 폭보다 작으며(도 9b, 도 9c 참조), 이에 의해 픽업 후크를 그를 통해 맞물림 리세스 내로 도입하는 것을 가능하게 한다. 픽업 후크의 각 쌍 사이의 거리(D)는 넓은 섹션(76iii)의 길이보다 크지만, 프레임의 상부 바 위에 한 쌍의 픽업 후크의 그립을 고정하 기 위해 결합 리세스의 전체 길이보다 작다. 서로 이웃하는 한 쌍의 픽업후크 사이의 거리는 성장 타 워(30i 내지 30x) 사이의 거리와 유사하다. 원예 작물 성장 모듈은 성장 타워(30i 내지 30x) 내로 트레이를 로딩하도록 구성된 성장 트레이 로딩/언로 딩 장치를 더 포함한다. 따라서, 도 4b에 도시된 바와 같이, 각각의 성장 타워(30i 내지 30x)는 케이지형 지지 프레임을 포함하며, 성장 트레이는 거의 클리어런스를 갖지 않고 슬라이딩식으로 변위가능하다. 지지 프레임의 상단부는 개방되어 있고, 이에 따라 상단부 위에 배치된 성장 트레이는 후술하는 바와 같이 장애물, 통상적으로 아래에 배치된 다른 성장 트레이 위에 놓일 때까지 중력 하에서 자유롭게 하강한 다. 도 4d에 도시된 바와 같이, 지지 프레임은 처리 부재의 어레이와 끼워지며, 이는 특정 예에 따 르면, 이상적인 광 노출을 위해 각각의 성장 트레이의 양 측부에서 연장되는 발광기들, 전형적으로 LED 바 들의 어레이이다. 주목할 점은, 처리 부재는 또한 열 방출 유닛, 광학 센서, 온도/습도 센서 등을 포함할 수 있다. 도 12a 및 도 12b를 더 주목하면, 지지 프레임의 하단부는 개방되어 있지만, 원예 작물 성장 모듈 의 양 측면에 배치된 성장 트레이 잠금 메커니즘이 장착되어 있음을 알 수 있다. 전방 및 후방 잠금 메커 니즘이 작동 중에 동일하고 동기화될 수 있다는 것이 이해되지만, 명확성을 위해 전방 시스템만을 참조한다. 성장 트레이 잠금 메커니즘은 이 예에서 모든 성장 타워(30i 내지 30x)의 바닥 단부를 따라 연장되는 세장형 로 드를 포함한다. 로드는 전기 모터로부터 회전 운동을 수용하기 위해 결합되고, 각각의 성장 타 워와 관련하여 간격을 두고 배치된 역-나사부(202A 및 202B)로 구성되고, 나사형 라이더(204A 및 204B)는 각각의 나사부(202A 및 202B) 위에 장착된다. 라이더(204A 및 204B)들은 구속 플레이트(208A, 208B) 내의 개 구를 통해 연장 가능한 구속 핀(206A, 206B)으로 구성되며, 이에 의해 로드의 회전은 라이더(204A, 204B) 들이 서로를 향하거나 서로 멀어지는 축방향 변위를 수반한다. 라이더(204A 및 204B)들이 서로를 향해 변위될 때(도 12a 참조), 구속 핀(206A, 206B)들의 선단은 각각의 성장 트레이의 바닥에 구성된 개구 내로 돌 출되어, 이에 따라 최하부 성장 트레이(20i)를 구속하고 그것이 지지 프레임 내에서 변위되는 것을 방지하 며, 또한 상기 최하부 성장 트레이(20i)는 상기 성장 타워 내에서 그 위에 적층된 연속적인 성장 트레이들의 하 중을 지지한다. 그러나, 일단 로드가 반대 방향으로 회전하면, 라이더(204A 및 204B)는 서로로부터 축방 향으로 변위되고(도 12b 참조), 이에 의해 구속 핀(206A, 206B)의 선단은 성장 트레이(20i)에서 개구로부 터 분리되고, 이에 의해 상기 트레이는 이하에 논의되는 바와 같이 하부 듀티 성장 트레이(20db)에 의해 상향으 로 변위될 수 있거나, 하부 트레이 이송 시스템 상으로 변위될 수 있다. 성장 트레이 로딩/언로딩 장치는 바닥 트레이 이송 시스템으로부터 각각의 성장 타워로 바닥 듀티 성장 트레이(20db)를 상승시키거나, 또는 최하부 성장 트레이(20i)를 수용하고 입구/출구 포트를 향해 또는 성장 트레이 리프트를 향해 변위시키기 위해 이들을 바닥 트레이 이송 시스템 상에 배치시키도록 구성된 성 장 트레이 추진 유닛(경로를 따라 선택적인 처리 정지부를 가짐)으로 추가로 구성된다. 도 13a 및 도 13b에 가장 잘 도시된 성장 트레이 추진 유닛은 모든 성장 타워 아래에서 원예 작물 성장 모 듈 아래로 연장되는 한 쌍의 솔리드 바를 포함하며, 복수의 피스톤(또는 다른 기계적 등가 메커니즘)은 상기 바 아래에 구성되고 (도면에 도시된 바와 같은) 수축 위치와 연장 위치 사이에서 조작 가능 하다. 이 배열은 하부 트랜싯 성장 트레이(20b)의 하부 표면이 바의 상부 표면 위로 연장하도록 되 어, 피스톤을 연장 위치로 조작하는 것은 (성장 트레이 잠금 메커니즘이 개방 위치에 있는 경우) 각각의 성장 타워(30i 내지 30x) 내로 하부 트랜싯 성장 트레이(20b)의 수직 전개를 수반한다. 마찬가지로, 성장 타워 (30i 내지 30x)로부터 하부 트레이 이송 시스템 상으로 트레이를 배출하는 것은, 성장 트레이 잠금 메커니 즘을 개방/잠금해제하고, 최하부의 성장 트레이(20i)가 하방으로(중력 하에서) 변위되어 하부 트레이 이송 시스 템의 이송 벨트 위에 놓이게 함으로써 발생한다. 원예 작물 성장 모듈은 관개 및 배수 시스템으로 추가로 구성된다. 관개를 위해, 일부 실시예에서, 인접한 성장 트레이의 최상단 레벨(20xi)에서 원예 작물 성장 모듈의 양 측면을 따라 연장되는 관개 공급 라인 (도 9a에서 가장 잘 볼 수 있음)이 있으며, 각각 인접한 성장 트레이의 토양을 관개하도록 구성된 복수의 관개 스파우트가 있다. 관개 방식은 제어될 수 있는데, 즉, 플러드/드립/또는 스프레이 관개가 일어나는 지 또는 대안적으로 일어나는지 여부이다. 각각의 성장 타워(30i 내지 30x) 내의 성장 트레이(20i 내지 20x)의 관개는 레벨/층 사이의 액체 유동에 의해 발생하며, 각각의 바닥 성장 트레이는 도 7b 및 도 7c와 관련하여 예로서 논의된 바와 같이 캐스케이드 방식으 로 그 위의 성장 트레이에서 밸브를 통해 액체 유동을 개방하도록 활성화된다. 관개 시스템은 일부 실시예에서 복수의 배수 용기를 더 포함하고, 각각은 각각의 성장 타워 아래에 배 치되고, 성장 트레이(20i)의 최하부 레벨/층을 배수하기 위한 밸브 조작 장치(도 8a 내지 도 8c)로 구성된 다. 밸브 조작 장치는 성장 트레이(20i/20b)의 가장 낮은 층의 밸브와 정합되는 한 쌍의 중공 플런저 를 갖는 한 쌍의 액티베이터(유압/공압 피스톤, 솔레노이드 등) 위에 장착된 활성화 바를 포함 하며, 그 결과 액티베이터가 명령 신호에 의해 활성화되면 바를 밸브의 플런저와 맞물리도록 상향으로 추진시켜 밸브를 개방함으로써 중공 플런저를 통한 배수 용기(화살표 라인 253으로 개략적 으로 도시됨) 내로의 액체 유동을 용이하게 한다. 도시된 예에서, 각각의 성장 타워는 배수 용기와 연관되고, 배수 용기는 배수 출구를 포함하며, 배수 출구는 모든 관개 액체를 수집하고 이를 새로운 관개 사이클, 예를 들어, 여과, 수소화, 영양분 및 미네랄 의 농축, 온도 제어, 소독 등을 위해 처리하기 위해 관개 시스템 내로 재순환되는 곳으로부터 배수된다. 그러 나, 도 21a에 도시된 바와 같이, 성장 타워 당 별도의 배수 용기보다는, 하나 이상의 배수 용기가 임 의의 2개 이상의 성장 타워를 위해 제공되거나, 원예 작물 성장 모듈을 위한 단일 배수 용기가 모듈 또는 측면(도 21b에 도시된 바와 같음) 아래에 제공되는 배열이 있을 수 있다는 것이 이해된다. 일부 실시예에서, 원예 작물 성장 모듈 내의 하나 이상의 성장 타워로부터 배수된 관개 액체는 성장 타 워 내의 성장 트레이를 따라 중력에 의해 유동하고, 타워 내의 모든 성장 트레이를 통해 유동한 후에 관개 액체는 성장 모듈 내부 또는 외부에서 관개 액체 처리 스테이션으로 유동하며, 여기서 관개 액체는 분석 및 처리, 즉, 세척되고, 영양분 및 미네랄을 첨가하고, 물 경도 및 pH를 처리한 등 후에 재순환된다. 원예 작물 성장 모듈은 일부 실시예에서 여러 처리 스테이션으로 추가로 구성된다. 예를 들어, 도 5a 및 도 5b에 도시된 바와 같이, 모듈의 원위 단부에 배치된 처리 스테이션이 존재하며, 상기 처리 스테이션은 (도면에서와 같이) 상승 위치와 하강 위치 사이에서 변위하기 위해 한 쌍의 피스톤(또는 다른 등가 메커니 즘)에 의해 조작가능한 돔을 포함한다. 돔의 내부 공간(도시되지 않음)은 복수의 노즐(278z)(도 25e 에 도시됨)로 구성되고, 튜브는 상기 노즐(278z)에 연결된다. 일부 실시예에서, 듀티 처리된 성장 트레이(20t)가 처리 스테이션에 도달하도록, 예를 들어, 도 25a 내지 도 25c에 도시된 바와 같이 바닥 트레이 이송 시스템을 이용하여, 이어서 돔이 성장 트레이(20t)를 덮 도록 하강되고, 처리제가 예를 들어, 도 25d 내지 도 25f에 도시된 바와 같이 배관을 통해 노즐에 의해 성 장에 도포되도록, 배열이 이루어진다. 처리 완료 시, 피스톤은 돔을 상승시키고, 이에 의해 처리된 성장 트레이(20t)는 (하부 트레이 이송 시스템에 의해) 예를 들어, 도 25g 내지 도 25h 및 도 25a 내지 도 25b에 도시된 바와 같이, 성장 트레이 리프트로 이동하고, 처리 스테이션은 이제 다른 성장 트레이를 수용하고 처리할 준비가 된다. 처리 스테이션은 하나 이상의 상이한 처리, 예를 들어 수분, 소독, 가열/냉각/통기, 시술 등을 제공할 수 있는 것으로 이해된다. 그러나, 도 10b에 가장 잘 도시된 바와 같이, 일반적으로 284로 표시된 처리 스테이션은 일부 실시예에서 원예 작물 성장 모듈의 원위 상부 위치에 위치되고, 상기 처리 스테이션은 정적이고, 성장 트레이가 성장 트레이 리프트로부터 배출되고 상부 트레이 이송 시스템에 의해 수집될 때 성장 트레이를 처리하도록 구성된다. 처리 스테이션은 성장 트레이를 향하는 돔 형상을 가져서, 상부 트레이 이송 시스템의 상 부 위치에 도달할 때 처리가 적용되도록 한다. 처리 스테이션은 예를 들어 방사선 스테이션, 살균 스테이 션 등일 수 있고/있거나, 성장 트레이 상의 식물의 성장의 이미지를 획득하기 위한 이미징 유닛을 포함할 수 있 다. 원예 작물 성장 모듈은 컨트롤러(도 20의 77), 복수의 센서 및 액추에이터를 포함하는 제어 시스템으로 추 가로 구성된다. 컨트롤러는 모듈 내의 환경 및 성장 처리(즉, 온도, 습도, 조명, 관개, 수분, 영양 등)를 제어하고, 교시 성장 트레이의 성장 진행을 검출 및 결정하고 모니터링하며, 이후에 논의되는 바와 같이, 모듈 에 진입하는 시간으로부터 수확 준비가 된 성장과 함께 배출되는 시간까지 성장 트레이를 사이클링하도록 구성 된다. 작물 제어 스테이션은, 예를 들어, 성장 트레이 리프트로부터 배출되는 성장 트레이로서 상기 처리 스 테이션과 나란히 위치된 것으로 도시된다. 각각의 성장 트레이에 관한 데이터를 개별적으로 획득하기 위해, 각각의 성장 트레이는 일부 실시예에서 바코드, QR 코드, 컬러 코드, RFID, 디지털 코드 등과 같은 판독 가능한 식별자(예를 들어, 도 27b의 ID 코드 (20y))로 구성되고, 이에 의해 각각의 성장 트레이와 연관된 트레이 데이터는 컨트롤러에 등록될 수 있 다. 이제 완제품 스테이션(도 1a)으로 되돌아가면, 하나 이상의 원예 작물 성장 모듈로부터 완제품 스테이 션을 향해 성장 트레이를 이송하도록 구성된, 적어도 하나의 입구/출구 포트 각각으로부터 연장되는 완 제품 이송 시스템(실제로 이송 시스템의 연장부)이 있다. 완제품 스테이션에 수용된 성장 트레이 는 자동화된 핸즈프리 취급 스테이션에 진입하고, 여기서 성장(예를 들어, 딸기와 같은 과일)이 수확되고, 이어서 포장되고, 선택적으로 포장되고, 배송/선적을 위해 준비된 적절한 조건에서 저장된다. 본 발명에 따른 원예작물 성장모듈을 이용한 원예작물 성장방법으로서, 다음 단계들을 포함한다: i. 복수의 식재된 성장 트레이를 입구/출구 포트를 통해 원예 작물 성장 모듈 내로 수용하고, 이들 을 하부 트레이 이송 시스템 상에 적재하는 단계; ii. 바닥 트레이 이송 시스템으로부터 성장 타워로 성장 트레이를 적재하는 단계; iii. 성장 트레이가 원예 작물 성장 모듈 내에 배치된 복수의 처리 스테이션(270, 및/또는 284, 및/또 는 290) 사이에서 순환되는 성장 사이클을 시작하는 단계; iv. 각각의 성장 트레이와 연관되고 성장 트레이에서 성장되는 작물의 숙성과 관련된 데이터를 모니터링하 고 획득하는 단계; v. 작물이 수확 상태에 있을 때까지 단계 iii 및 iv를 반복하는 단계; vi. 성장 트레이를 수집하기 위해 성장 타워로부터 입구/출구 포트로 성장 트레이를 이송하는 단계; vii. 트레이를 예를 들어 자동화된 핸즈프리 수확, 패킹 및 전달 스테이션을 위해 완제품 이송 시스템 으로 이송하는 단계. 도면을 참조하여, 상기 단계 ii) 내지 vi)에 특히 주의하면서, 상기 기재된 바와 같은 원예 작물 성장 시스템 을 이용하는 원예 작물 성장 방법의 단계를 참조한다. 단계 (i)에서, 성장 트레이 취급 및 준비 스테이션에서의 준비 후에, 도 14의 단계 (a) 및 (b)에 도시된 바 와 같이, 복수의 성장 트레이가 이송 시스템 위에서 할당된 원예 작물 성장 모듈의 입구 포트 로 이송된다. 단계 (c)에서, 모듈의 부근으로 진입할 때, 단계 (d)에서 성장 트레이는 하부 트레이 이 송 시스템 위에 배치되고, 컨베이어 벨트가 성장 트레이에 의해 완전히 점유될 때까지 (성장 트레 이 리프트를 향하는 방향으로) 점진적으로 변위된다. 도시된 바와 같이, 일부 실시예에서, 성장 트레이 는 이송 시스템으로부터 하부 트레이 이송 시스템의 슬라이딩 프레임 구조체(35f) 상으로 이송되며, 이는 도 15a 내지 도 15d를 참조하여 상세히 후술된다.단계 (ii)에서, 듀티 성장 트레이(20db)가 각각의 성장 타워(30i 내지 30x) 아래에 배치되면, 성장 트레이 잠금 메커니즘은 활성화 모터에 의해 잠금 해제 위치로 시프트되고, 구속 핀(206A, 206B)의 후퇴를 수반하여 서 로로부터 잠금 해제 위치로 변위되며, 그 후 성장 트레이 추진 유닛은 피스톤에 의해 활성화되어 솔리드 바를 상향으로 수직으로 변위시키고, 듀티 성장 트레이(20db)의 상향 변위를 각각의 성장 타워(30i 내지 30x) 내로 수반한다. 일단 듀티 성장 트레이(20db)가 성장 타워 내에 위치되면, 성장 트레이 잠금 메커니즘은, 반대 의미에서, 다시 활성화되고, 이에 의해 구속 핀(206A, 206B)은 성장 트레이(20i)에서 개구 내에서 구 속 결합으로 변위된다. 이 단계는 성장 타워가 복수의 성장 트레이로 로딩될 때까지 반복된다. 그런 다음 성장 사이클이 시작되며(단계 (iii)), 여기서 각각의 성장 트레이는 '원예 주의(attention)'를 받으 며, 즉 각각의 트레이는 각각의 타워에서 또는 전용 처리 스테이션에서 개별적으로 또는 집합적으로 처리된다. 이러한 처리는 관개, 조명, 습도, 공기 온도, 비료/영양, 수소화, 성장 트레이 가열, 상이한 파장에서의 방사선, 플레잉 사운드, 수분, 살균 등 중 임의의 하나 이상을 포함할 수 있다. 도 21a 내지 도 21c를 참조하면, 관개는 일부 실시예에서 관개 공급 라인(들)을 통해 관개 액체를 하나 이 상의 노즐(220z)을 통해 각각의 성장 타워의 최상부 성장 트레이(20xi)에 적용함으로써 발생하며, 예를 들 어, 이 특정 예에서 각각의 최상부 성장 트레이는 2개의 노즐(220z)에 의해 관개되고, 여기서 관개 액체는 도 21a 및 도 21b에 도시된 바와 같이 중력에 의해 캐스케이드 구성에서 최상부 성장 트레이 아래의 성장 트레 이로 흐른다. 최하부 성장 트레이로부터의 관개 액체는 배수 용기로 배수되고, 이로부터 새로운 관개 사이클, 예를 들어 필터링, 수소화, 영양분 및 미네랄의 농축, 온도 제어, 소독 등을 향해 이를 처리하기 위해 수집 및 이송되며, 여기서 관개 시스템으로 다시 재순환된다. 성장 사이클은 원예 작물 성장 모듈로 성장 트레이를 순환시키고, 특히 상이한 처리 및 모니터링 스테이션 을 따라 성장 트레이를 이동시키는 것을 추가로 포함한다. 따라서, 컨트롤러에 의해 제어되는 바와 같 이 그리고 성장 파라미터에 따라, 소정 주기에서, 성장 트레이 시프팅 사이클이 발생한다. 이러한 목적을 위해, 각각의 타워 내의 최하부 성장 트레이는 하부 트레이 이송 시스템 상으로 변위된다(한 번에 트레 이는 성장 트레이 잠금 메커니즘의 제어된 작동으로 인해 하부 트레이 이송 시스템 상으로 변위될 수 있 다). 그리고 이어서, 한 번에 트레이가 전술한 바와 같이 처리 스테이션을 향해 변위될 수 있다. 일단 처리되면, 상기 듀티 처리된 성장 트레이(20t)는, 예를 들어, 트레이가 성장 트레이 지지 아암과 맞물리는 성장 트레이 리프트 상으로 이동하여, 이어서 상부 트레이 이송 시스템에 의해 수집되도록 상부 레벨로 상승된다. 성장 트레이 리프트의 상부 레벨에 도달하는 각각의 트레이는 그 후 본 명세서에 앞서 설명된 바와 같이 무 단 벨트의 픽업 후크에 의해 결합되고, 일단 각각의 성장 타워 위로 연장되면 성장 트레이는 상부 트 레이 이송 시스템으로부터 해제되어, 중력 하에서 성장 타워 내로 변위되어, 아래의 트레이 위에 놓일 수 있게 한다. 일단 성장 트레이가 다른 성장 트레이 위에 위치되면, 전술한 바와 같이, 밸브 및 여과 시스템 이 활성화되어, 케스케이드와 유사한 방식으로 관개 액체 유동을 용이하게 한다. 성장 공정은 완전히 자동화되고 지속적으로 모니터링 및 제어될 수 있으며(단계 (iv)), 여기서 각각의 성장 트 레이는 처방되고 모니터링된 양의 처리를 수용한다. 일단 컨트롤러가 트레이 상의 성장이 소위 준비/성숙 단계 에 도달했음을 식별하면, 특정 트레이는 출구 포트로 변위된다. 이것은 트레이를 식별함으로써(판독 가능 한 식별자/ID 코드(20y)에 의해) 발생하고, 일단 트레이가 하부 트레이 이송 시스템에 도달하면, 컨베이어 벨트는 반대 방향(언로딩 방향)으로 회전하여, 상기 성장 트레이를 출구 포트를 향해 변위시킨다. 컨트롤 유닛은 일부 실시예에서, 본 명세서에 개시된 바와 같이, 센서 유닛, 식별자 판독기, 및 다양한 계 획 처리 및/또는 모니터링 유닛을 이용하여, 전술한 방법 단계의 일부 또는 전부를 구현하도록 구성된다. 예를 들어, 일부 실시예에서, 하나 이상의 이미저/카메라가 각 원예 작물 성장 모듈에 설치되고, 다음 중 하나 이상을 제어하는데 사용된다: 질병 정량화 즉, 식물에서의 질병 수준; 식물 건강도 즉, 식물에서의 질병 수준 및 성장 조건; 식물 노화 즉, 영양 용액, LED 노출, 온도, 습도 등을 조정하기 위해 식물이 어떻게 노화하는지; 예를 들어, LED 조명 노출에 의해 성장 품질을 조정하기 위한 클로로필 수준; 광 흡수 수준을 나타내는 카로티 노이드 함량. N-함량, 성장 배지의 질소 수준. 수분 프로세스를 시작할 꽃 상태. 수분 파라미터를 다시 수분하거나 조정하도록 수분 조절. 수확을 시작하기 위해 성숙하는 작물. 도 15a는 하부 트레이 이송 시스템의 다른 가능한 실시예를 도시하며, 성장 트레이는 슬라이딩 프레임 구조체(35f)에 수용되어 레일(35r) 위로 이송된다. 도 15c에 더 잘 도시된 바와 같이, 슬라이딩 프레임 구조체 (35f)는 원예 작물 성장 모듈을 따라 레일(35r) 위로 슬라이딩 프레임 구조체(35f)를 이동(예를 들어, 랙- 피니언 컨베이어 전달)시키도록 구성된 기어 랙 레일(35c)에 결합된 액추에이터(예를 들어, 선형 액추에이터/모 터)(35f)를 포함한다. 이러한 방식으로, 입구/출구 포트로부터, 또는 성장 트레이 리프트로부터 수용 된 성장 트레이는 성장 타워 중 임의의 하나로 이동될 수 있고, 그 반대도 가능하다. 슬라이딩 프레임(35f)은 성장 트레이를 슬라이딩 프레임(35f)으로부터 성장 타워로, 그리고 그 반대로 전달하도록 구성된 리프팅 메커니즘을 포함한다. 리프팅 메커니즘은 성장 트레이가 위치되고 슬라이딩 프 레임(35f)의 수직 바(35b)(예를 들어, 선형 작동에 의해)를 따라 수직으로 이동되는 리프트-플랫폼(35a)을 포함 한다. 도 15b는 성장 타워 내의 리프트-플랫폼(35a)에 의한 성장 트레이의 수직 이동, 및 잠금 메커니 즘에 의해 성장 타워 내에서 최하부 성장 트레이를 고정/해제하는 것을 도시하며, 예를 들어, 각 성장 타워 내에 성장 트레이를 고정하기 위한 4개의 잠금 메커니즘이 여기에 예시된다. 예를 들어, 리프트-플랫폼(35a)은 그 위에 배치된 성장 트레이를 성장 타워의 지지 프레임을 향해 그리고 이를 따라 상향으로 들어올릴 수 있고, 이에 의해 성장 타워의 최하부 성장 트레이(20i), 및 그 위 에 적층된 임의의 다른 성장 트레이를 상향으로 밀어낸다. 리프팅 플랫폼(35a) 상에 배치된 성장 트레이 가 성장 타워 내의 최하부 트레이 위치에 도달한 후, 지지 프레임에 장착된 잠금(예를 들어, 스프 링) 메커니즘는 잠금 핀(29p)을 성장 트레이의 고정 개구 내로 가압함으로써 잠금 해제 상태로부 터 잠금 상태로 변화된다. 일단 성장 트레이가 잠금 메커니즘에 의해 성장 타워의 최하부 트레이 위치에 견고하게 잠금되면, 리프팅 플랫폼(35a)은 슬라이딩 프레임(35f)의 바닥 베이스/플로어로 다시 하방으로 이동된다. 도 15c 및 도 15d는 리프팅 메커니즘에 의한 성장 트레이 변위 및 슬라이딩 프레임(35f)으로부터 수직 상향 으로 연장되는 지지 요소(35s) 상에 장착된 잠금 조작기(29a)(예를 들어, 피스톤 메커니즘)를 이용하는 것을 도 시한다. 각각의 잠금 조작기(29a)는 성장 타워의 각각의 잠금 메커니즘과 맞물리고, 해제 상태와 잠금 상태 사이에서 잠금 핀(29p)을 변경하기 위해 그것을 (예를 들어, 기계적, 자기적, 전기적으로) 조작하도록 구 성된다. 도 16a 내지 도 16e는 도 15a 내지 도 15d의 하부 트레이 이송 시스템을 이용하는 작물 성장 모듈 개체 군 시퀀스를 도시한다. 도 16a에서 작물 성장 모듈의 성장 타워는 모두 비어 있고, 제1 성장 트레이 는 예를 들어, 그의 입구/출구 포트를 통해 작물 성장 모듈 내로 도입되고, 하부 트레이 이송 시스 템의 슬라이딩 프레임(35f) 상에 적재된다. 도 16b에서, 슬라이딩 프레임(35f)은 성장 트레이 중 선택 된 하나로 이동되고, 그의 잠금 조작기(29a)는 성장 타워의 각각의 잠금 메커니즘와 맞물리고, 각각의 잠금 핀(29p)을 해제 상태로 이동시키도록 작동된다. 도 16c에서, 리프트-플랫폼(35a)은 슬라이딩 프레임(35f)의 수직 바(35b)를 따라 수직으로 이동되어 성장 트레 이를 성장 타워의 최하부 트레이-위치로 병진 이동시키고, 그 결과, 잠금 조작기(29a)는 다시 작동되어 그 각각의 잠금 메커니즘가 잠금 핀(29p)을 그 잠금 상태로 이동시키게 함으로써, 성장 타워의 최하부 트레이-위치에서 성장 트레이를 고정한다. 도 16d에서 리프트 플랫폼(35a)은 슬라이딩 프레임(35f)의 베이 스까지 수직 하방으로 이동된다. 도 16e에서, 새로운 성장 프레임(20i)은 예를 들어 그 입구/출구 포트를 통해 슬라이딩 프레임(35f) 상으로 도입되고, 그 잠금 조작기(29a)가 각각의 잠금 핀(29p)을 그 해제 상태로 변경하기 위해 작동된 후에 리프트-플 랫폼(35a)에 의해 성장 타워 내로 수직 상방으로 상승된다. 새로운 성장 트레이(20i)가 성장 타워 내 에서 상향으로 이동됨에 따라, 최하부 성장 트레이, 및 그 위에 적층된 임의의 다른 성장 트레이를 성 장 타워를 따라 상향으로 가압한다. 새로운 성장 트레이(20i)가 성장 타워 내의 최하부 트레이-위치에 위 치될 때, 그의 잠금 조작기(29a)는 각각의 잠금 핀(29p)을 잠금 상태로 변경하기 위해 작동되며, 그 후 리프트 플랫폼(35a)은 슬라이딩 프레임의 베이스로 하향으로 다시 이동된다. 도 16a 내지 도 16e에 도시된 성장 트레이 개체군 시퀀스는 새로운 성장 트레이를 작물 성장 모듈의 선택된 성장 타워에 도입하기 위해, 성장 타워의 할당된 트레이 위치가 완전히/부분적으로 채워질 때까지 임의 의 횟수로 반복될 수 있다. 작물 성장 모듈이 완전히/부분적으로 성장 트레이로 채워진 후, 본 명세서에 개시된 바와 같이, 성장 사이클이 시작될 수 있다. 도 17a 내지 도 17d는 가능한 실시예에 따른 성장 트레이 언로딩 시퀀스를 예시한다. 도 17a에서, 슬라이 딩 프레임(35f)은 레일(35r) 위로 성장 타워 중 선택된 하나로 이동되고, 그의 잠금 조작기(29a)는 성장 타 워의 각각의 잠금 메커니즘와 결합된다. 도 17b에서, 리프트 플랫폼(35a)은 성장 타워 내의 최하 단 트레이 위치에서 성장 트레이(20i)에 도달할 때까지 수직 상향으로 이동되고, 그 결과, 그의 잠금 조작기 (29a)는 리프트 플랫폼(35a) 상으로 성장 트레이(20i)를 해제하기 위한 해제 상태로 각각의 잠금 핀(29p)을 변 경하도록 작동된다. 도 17c에서, 리프트 플랫폼(35a)은 슬라이딩 프레임(35f)의 베이스로 다시 하향으로 이동 되고, 이에 의해 그 위에 배치된 성장 트레이를 슬라이딩 프레임으로 병진시키고, 그 위에 적층된 모든 다른 성 장 트레이가 하나의 레벨로 하향으로 이동하게 한다. 이러한 방식으로, 성장 타워의 상부 레벨로부터의 성 장 트레이가 최하부 트레이 위치에 도달할 때, 잠금 조작기(29a)는 각각의 잠금 핀(29p)을 잠금 상태로 변 경하기 위해 다시 작동되며, 이에 의해 성장 트레이를 성장 타워의 최하부 트레이 위치에서 상부 레벨 로부터 하강하여 고정시킨다. 도 18a 내지 도 18c는 일부 가능한 실시예에 따른 상부 트레이 이송 시스템을 도시한다. 상부 트레이 이송 시스템은 원예 작물 성장 모듈 위를 따라 연장되는 세장형 레일(48r), 세장형 레일(48r)을 따라 또는 그 내부를 통과하는 (예를 들어, 타이밍) 무단 벨트(48e)를 회전시키기 위해 결합된 모터 전달 유닛(48m), 및 세장형 레일(48r)을 따라 트레이 캐리어 조립체(48f)를 병진시키기 위해 하나 이상의 지지 요소(48s)를 통해 무 단 벨트(48e)에 결합된 트레이 캐리어 조립체(48f)를 포함한다. 이러한 방식으로, 트레이 캐리어 조립체(48f) 는 성장 트레이를 성장 트레이 리프트로부터/로 수용/이송하기 위해 세장형 레일(48r)의 일 단부로 이 동될 수 있고, 그로부터 원예 작물 성장 모듈의 성장 타워 중 임의의 하나로 성장 트레이를 이송/ 수용한다. 일부 실시예에서, 하나 이상의 플랜트 처리 및/또는 모니터링 스테이션은 성장 타워의 적어도 일부 위에 위치되고, 상부 트레이 이송 시스템은 성장 트레이를 성장 트레이 리프트로부터, 또는 성장 타워 중 하나로부터 처리 및/또는 모니터링 스테이션으로 이송하여 이에 의해 하나 이상의 처리 및/또는 모 니터링을 적용하는 데 이용된다. 트레이 캐리어 조립체(48f)는 세장형 레일(48r)을 따라 트레이 캐리어 조립체(48f)를 이동시키기 위해 지지 요 소(48s)에 결합된 하나 이상의 캐리어 바(48b)(이 특정 예에서는 2개), 캐리어 바(48b)의 단부 부분으로부터 하 향으로 연장되는 2쌍의 선형 가이드(48g), 및 각 쌍의 선형 가이드(48g) 사이에 이동 가능한 트레이 슬라이더 메커니즘(48q)를 포함한다. 트레이 슬라이더 메커니즘(48q)은 성장 트레이를 파지하여 유지하고, 이에 의 해 파지된 성장 트레이를 한 쌍의 선형 가이드들(48g)을 따라 제어가능하게 슬라이딩시키도록 구성됨으로써, 성장 트레이를 성장 타워 또는 성장 트레이 리프트의 지지 아암들 중 선택된 하나로/로부터 하향으로 또는 상향으로 이동시키거나, 또는 성장 타워들 중 하나의 최상부 성장 트레이에 접근하여 이를 파지하고, 이를 상향으로 이동시키는데, 예를 들어, 성장 트레이 리프트에 의해 또는 성장 타워들 중 다른 하나로 이송시키기 위해, 또는 하나 이상의 처리 및/또는 모니터링 스테이션들에서 하나 이 상의 처리 및/또는 모니터링을 적용하기 위해 구성된다. 이 구성에서, 성장 트레이의 프레임은 하나 이상의 파지 구멍(70c), 예를 들어, 프레임의 상부 부 분에 형성되고, 트레이 슬라이더 메커니즘(48q)의 각각의 파지 아암(48x)을 수용하여 이를 파지 및 이동시키도 록 구성되는 2개의 파지 구멍(70c)을 포함한다. 도 18d 내지 도 18f는 상부 트레이 이송 시스템을 이용하 여 수행되는 성장 트레이 이송 시퀀스를 도시한다. 도 18d에서, 트레이 캐리어 조립체(48f)는 트레이를 성 장 타워들 중 선택된 하나로 이동시키기 위해 트레이 슬라이더 메커니즘(48q)에 의해 파지된 성장 타워 , 예를 들어 성장 타워들 중 다른 하나로부터 또는 성장 트레이 리프트로부터 가져온다(fetched). 도 18e에서, 성장 트레이는, 예를 들어 도 22b에 도시된 슬라이딩 핀(20k)을 이용하여, 슬라이딩 모션을 위 해 성장 트레이를 성장 타워의 지지 프레임의 안내 채널(도시되지 않음)과 맞물리도록, 예를 들어 트레이 슬라이더 메커니즘(48q)에 결합된 리프터-케이블(48y)에 의해 하향으로 이동된다. 이러한 방식으로, 성 장 트레이는 다른 성장 트레이와 접할 때까지 성장 타워의 지지 프레임을 따라 하향으로 슬라 이딩되며, 통상적으로 성장 타워의 최상부 트레이 위치에 슬라이딩된 성장 트레이를 위치시킨다. 성장 트 레이가 성장 타워 내에 배치된 후에, 파지 아암(48x)은 트레이 파지 상태로부터 그 트레이 해제 상태로 변경되며, 예를 들어, 파지 아암은 다른 것에 대해/다른 것을 향해 이동되어, 그 파지 팁/핑거가 성장 트레이 의 파지 구멍(70c)으로부터 해제될 수 있다. 파지 아암(48x)들을 그들의 트레이 해제 상태로 변경한 후, 트레이 슬라이더 메커니즘(48q)은 도 18e에 도시된 바와 같이, 예를 들어 리프터-케이블(48y)에 의해, 캐리어바(48b)에 인접한 그의 미전개 상태로 다시 상향으로 후퇴된다. 도 19a 내지 도 19k는 일부 실시예에 따라 상부 트레이 이송 시스템을 이용하는 성장 트레이 로딩 시퀀스를 도시한다. 도 19a는 임의의 성장 트레이를 그의 성장 타워 내로 도입하기 전의, 일부 가능한 실시양태 의 원예 작물 성장 모듈을 도시한다. 하부 트레이 이송 시스템의 슬라이딩 프레임(35f)은 예를 들어 트레이 입구/출구 포트를 통해 수용되는 성장 트레이가 로딩된 것으로 도시된다. 도 19b에서, 슬라이 딩 프레임(35f)은 성장 트레이 리프트를 향해 바닥 트레이 이송 시스템의 레일(35r) 위로 이동되고, 도 19c에서 성장 트레이는 바닥 트레이 이송 시스템의 슬라이딩 프레임(35f)으로부터 성장 트레이 리프트 의 성장 트레이 지지 암으로 이송된다. 도 19d에서, 성장 트레이 리프트는 상부 트레이 이송 시 스템을 향해 성장 트레이를 상향으로 이동시키고, 도 19e에서, 상부 트레이 이송 시스템의 트레이 캐리어 조립체(48f)는 성장 트레이 리프트를 향해 레일 상부(48r) 위로 이동되고, 도 19f에서, 성장 트레이 는 트레이 캐리어 조립체(48f)에 의해 결합된다. 도 19g에서, 트레이 슬라이더 메커니즘(48q)은 파지 구멍(70c)과 그 파지 아암(48x)의 파지 팁/핑거를 맞물리도 록 아래로 이동되고, 그 후, 이들을 예컨대 다른 것으로부터 멀리 이동시킴으로써, 이들의 파지 상태로 변경되 고, 이에 의해 성장 트레이 위에 파지를 제공한다. 도 16h에서, 트레이 캐리어 조립체(48f)는 파지된 성장 트레이와 함께 상부 레일(48r) 위로 성장 타워 중 선택된 하나로 이동된다. 도 19i에서, 파지된 성장 트레이는 트레이 슬라이더 메커니즘(48q)에 의해, 예를 들어 리프터-케이블(48y)에 의해 타워의 지지 프레 임의 안내 채널(도시되지 않음)을 따라, 이 예에서 타워의 최하부 트레이 위치인 성장 타워 내의 할당된 위치로 하향/하강된다. 성장 트레이는 잠금 메커니즘의 잠금 핀(29p)에 의해 지지 프레임(18 0)에 고정될 수 있고, 트레이 슬라이더 메커니즘(48q)의 파지 아암(48x)은 트레이 슬라이더 메커니즘(48q)을 상 향으로 그 비전개 상태로 다시 상승시키기 위해 그 트레이 파지 상태로부터 그 트레이 해제 상태로 변경될 수 있다. 도 19k는 도 19a 내지 도 19h에 도시된 단계를 수행한 후에 원예 작물 성장 모듈 내에 새로운 성장 트레이 의 배치를 도시한다. 도시된 바와 같이, 새로운 성장 트레이는 트레이 슬라이더 메커니즘(48q)에 의해 파지되고, 예를 들어 리프터-케이블(48y)에 의해 타워의 지지 프레임의 안내 채널(도시되지 않음)을 따라 성장 타워 내의 할당된 위치로 하향으로 하강/이동되며, 이 예에서는 타워의 최하부 트레이 위치 위의 트레이 위치이다. 성장 트레이는 잠금 메커니즘의 잠금 핀들(29p)에 의해 지지 프레임에 고정될 수 있고, 트레이 슬라이더 메커니즘(48q)의 파지 아암(48x)은 트레이 슬라이더 메커니즘(48q)을 상향으로 그 비 전개 상태로 다시 상승시키기 위해 그 트레이 파지 상태로부터 그 트레이 해제 상태로 변경될 수 있다. 도 19k 에 도시된 바와 같이, 도 19a 내지 도 19i에 도시된 단계들은 성장 타워의 적어도 하나 또는 전부를 적어도 부분적으로 채우기 위해 임의의 횟수로 반복될 수 있다. 도 20은 일부 가능한 실시예들에 따른 식물 성장 장치(20g)를 예시한다. 일부 실시예에서, 각각의 원예 작물 성장 모듈은 하부 트레이 이송 시스템, 성장 트레이 리프트, 상부 트레이 이송 시스템, 및 각 각의 성장 타워에 구현된 수직 성장 트레이 병진 메커니즘을 이용하여 구현된 트레이 성장 사이클(20u)을 형성하도록 구성된다. 예를 들어, 트레이 성장 사이클(20u)은 일부 실시예에서 수분 스테이션(20p)(예를 들어, 도 25a 내지 도 25h를 참조하여 본 명세서에 설명된 것), 및/또는 관개 스테이션(20i)(예를 들어, 도 22a 내지 도 22d를 참조하여 본 명세서에 설명된 것), 및/또는 살균 스테이션(20s)(예를 들어, 전술한 바와 같은 방사선 스테이션), 및/또는 작물 제어/모니터링 스테이션(20c)(예를 들어, 도 27a 및 도 27b를 참조하여 본 명세서에 설명된 것), 및/또는 조명 배열(20h)을 포함하며, 예를 들어, 여기서 하나 이상의 발광기는 임의의 적합한 순서로 배열될 수 있는, 전술한 바와 같은 성장 타워의 각각의 트레이 위치에 배열된다. 또한 도 20에 도시된 바와 같이, 일부 실시예에서, 각각의 성장 타워 내의 각각의 트레이-위치는 하나 이상 의 처리 부재를 포함한다. 이 특정 예에서, 각각의 트레이-위치는 도 24a 내지 도 24d를 참조하여 아래에 서 설명되는 바와 같이, (예를 들어, 발광 다이오드 - LED를 사용하여) 방출된 광으로 식물에 조사하고/하거나 각각의 성장 트레이 내의 식물을 환기시키는 데 사용되는 2개의 이러한 처리 부재를 포함한다. 가능한 실시예에서, 도 22a 내지 도 22d에 도시된 관개 장치는 관개 스테이션(20i)에서 한 번에 하나씩 성장 트 레이를 개별적으로 관개하는 데 사용된다. 이러한 목적을 위해, 일부 실시예에서, 성장 트레이는 예를 들어 지지 요소(20w)에 의해 성장 트레이의 프레임에 부착된 성장 트레이의 길이를 따라 연장되는 하나 이상의 천공된 액체 트로프(trough) 요소(20v)(예를 들어, 이 예에서 단일 트로프(20v)가 도시됨), 및 프 레임의 상부 측면에 형성된 액체 입구 포트(20n)로부터 천공된 액체 트로프 요소(20v)를 향해 하향으로 연장되는 하나 이상의 액체 튜브(20j)(예를 들어, 이 예에서 단일 튜브(20j)가 도시됨)를 포함한다. 액체 튜브 (20j)는 액체 입구 포트(20n)를 통해 관개 액체를 수용하고 관개 액체를 중력에 의해 천공된 액체 홈통 요소 (20v)로 스트리밍하도록 구성되며, 여기서 스트리밍된 관개 액체는 천공부(20z)를 통해 식물 상에 분사된다. 도 22c 내지 도 22h에 도시된 바와 같이, 관개 스테이션(20i)은 일부 실시예에서 바닥 트레이 이송 시스템 을 통해 선택된 하나 이상의 성장 타워로부터 성장 트레이를 수용하도록 구성된다. 슬라이딩 프레임 (35f)은 성장 타워로부터 성장 트레이를 회수하고, 그것을 트레이 리프트의 트레이 지지 아암(14 0)으로 전달하며, 여기에서 액체 공급 파이프(24p)는 성장 트레이의 액체 입구 포트(20n)에 유체 결합되고, 액체 배수 파이프(24b)는 인터페이싱 깔때기 요소(24f)를 통해 성장 트레이의 통상 폐쇄형 밸브에 유체 결합되어, 통상 폐쇄형 밸브를 개방 상태로 변화시킨다. 이러한 방식으로, 관개 액체가 액체 공급 파이프 (24p)에 의해 천공된 트로프(20v)로 공급되고 천공(20z)을 통해 식물 상에 살수되는 동안, 성장 트레이의 트레이형 부분 내부에 축적된 잔류 관개 액체는 액체 배수 파이프(24b)를 통해 배수 용기 내로 배수된 다. 소정량의 관개 액체를 성장 트레이에 공급한 후, 액체 공급 파이프(24p) 및 액체 배수 파이프(24b)는 제거/ 후퇴되고, 성장 트레이는 예를 들어, 성장 트레이를 성장 타워 중 선택된 하나 내로 하강시키기 위 해 트레이 리프트에 의해 상부 트레이 이송 시스템으로 이를 상승시킴으로써, 또는 이를 슬라이딩 프레 임(35f)으로 다시 전달하고 이를 성장 타워 중 선택된 하나 내로 상승시킴으로써, 성장 타워 중 하나 내의 할당된 위치로 다시 이동된다. 도 23a 내지 도 23c는 일부 실시예에서 성장 트레이의 트레이형 부분 내부에 축적된 잔류 관개 액체의 제거를 위해 사용 가능한 배수 장치를 도시한다. 배수 장치는 트레이형 부분 내부에 축적된 잔류 액체를 통상 폐쇄형 밸브를 향해 배수하기 위해서, 관개 액체 공급이 중단된 후에, 성장 트레이에 소정 의 경사각을 인가하도록 구성된 경사 요소(28a)를 포함한다. 선택적으로, 그러나 일부 실시예에서 바람직하게, 통상 개방형 밸브가 성장 트레이의 관개 출구 포트에 제공되거나, 또는 대안적으로, 관개 출구 포트는 어떠한 밸브도 없이 제공되어, 성장 트레이에 축적된 잔류 관개 액체가 연속적이고 중단되지 않은 방식으로 그로부터 배수된다. 도 24a 내지 도 24d는 원예 작물 성장 모듈의 성장 트레이 상으로 가스/공기를 스트리밍하기 위해 가능 한 실시예에서 사용되는 시스템 환기 장치(33a)를 도시한다. 이 실시예에서, 각각의 성장 타워의 트레이- 위치는 성장 트레이 내의 식물 상으로 가스/공기를 스트리밍하기 위한 복수의 가스/공기 출구(33t)를 갖는 하나 이상의 가스/공기 분배 파이프를 포함한다. 환기 장치(33a)는 일부 실시예에서 복수의 가스/공기 분 배 파이프가 성장 트레이를 향해 연장되는 하나 이상의 메인 가스/공기 덕트(33d)를 포함한다. 이러한 특정 예에서, 원예 작물 성장 모듈의 측면에 장착된 메인 가스/공기 덕트(33d)가 있고, 가스/공기 분배 파 이프는 성장 타워의 각 측면에서 메인 가스/공기 덕트(33d)로부터 교대로 분배된다. 메인 가스/공기 덕트(33d)는 가스/공기 입구(들)(33i)를 통해 가스/공기 덕트로 스트리밍되는 가스/공기를 수용하고, 가스/공기 의 스트리밍을 위해 가스/공기 덕트 전이 요소(33t)를 사용하도록 구성된다. 도 26은 가능한 실시예들의 환경 제어 장치(26a)를 도시하며, 이는 시스템 내의 온도를 제어하도록 구성된 하나 이상의 난방, 환기, 및 공조(HVAC) 유닛(k1), 및/또는 습도 유닛 eh 시스템을 제어하도록 구성된 하나 이상의 제습기 유닛(k2), 및/또는 시스템을 통해 신선한 공기를 순환시키기 위한 하나 이상의 송풍기 순환 팬(k3), 및/ 또는 인공 팬트 성장 조명을 제공하기 위한 하나 이상의 발광(예컨대, LED) 유닛(k4), 및/또는 관개 용액들을 혼합하고 선택적으로 또한 산도, 및/또는 전기 전도도, 및/또는 관개 용액들의 온도를 나타내는 센서 디바이스 들로부터 획득된 측정 데이터를 통합하도록 구성된 하나 이상의 관개 유닛(k5)을 포함한다. 컨트롤 유닛은 일부 실시예에서 다양한 센서로부터의 측정 데이터를 처리하고 이에 기초하여 k1 내지 k5 유닛 각각의 동작을 제어/조절하도록 구성된다. 도 27a 및 도 27b는 원예 작물 성장 모듈 내의 복수의 트레이 추적 구역을 이용하는 가능한 실시예의 작물 모니터링/제어 장치(27a)를 도시한다. 일부 실시형태에서, 성장 트레이 중 각각의 트레이는 고유한 판독 가능 식별자(예를 들어, Datamatrix 식별 코드)(20y)를 포함한다. 트레이 식별자(20y)는 원예 작물 성장 모듈 내의 각 식물과 관련하여, 센서로부터의 정보/측정 데이터를 기록하기 위해 시스템에 의해 사용된다. 일부 실시예에서, 원예 작물 성장 모듈은 살균/작물 제어를 받는 스트레이를 위한 정보(예를 들어, ID, 날짜, 시간, 살균 및 작물 제어)를 기록하기 위한 살균 스테이션(20s) 및/또는 작물 제어 스테이션(20c)에서 트 레이 식별 구역(c1)을 포함하고, 및/또는 각각의 성장 타워에/로부터 운송되는 각각의 성장 트레이에대한 정보(예를 들어, ID, 날짜, 시간, 타워 ID)를 기록하기 위한 각각의 성장 타워 위의/그에 인접한 상부 트레이 통로 구역(c2)에서, 및/또는 시스템에 로딩되고 그로부터 언로딩되는 성장 트레이의 식별을 위한 입구/ 출구 포트 근처/에서 트레이 입구 구역(ce)에서, 및/또는 수분 스테이션(20p) 및/또는 수분/관개 프로세스 를 겪는 성장 트레이에 대한 정보(예를 들어, ID, 날짜, 시간, 수분/관개)를 기록하기 위한 관개 스테이션 에 대한 입구에서/근처에서 c4를 포함한다. 컨트롤 유닛은 광 노출 시간 지속 기간; 영양분; 살균; 수분과 같은 특정 조건/특성과 관련하여 시스템에서 수송된 각각의 성장 트레이에 대한 다양한 트레이 식별 구역(c1,...c4)에 대한 트레이 식별 정보를 수집하 고 기록하도록 구성될 수 있으며, 선택적으로 농산물, 종자 유형 또는 모식물의 유형에 대한 입력과 함께 기록 된다. 수집된 데이터는 시스템에 대한 최적의 성장 조건을 결정하는 데 이용될 수 있는 표준 성장 프로파일을 생성하기 위해 처리 및 분석될 수 있다. 시스템에서 이송되는 각각의 성장 트레이의 이러한 트레이 식별/추적성 배열(27a)은 컨트롤 유닛에 의 해 각각의 성장 트레이에 대한 개별 성장 조건/프로파일, 예를 들어 성장 타워 위치, 시스템 내의 더 빠른/ 더 느린 이동 속도 등을 결정하기 위해 사용될 수 있다. 위에서 설명되고 관련 도면에 도시된 바와 같이, 본 개시내용은 자동화된 식물 성장 시설 및 관련 방법을 위한 온실 및 원예 시스템을 제공한다. 그러나, 본 발명의 특정 실시예들이 설명되었지만, 본 발명이 이에 제한되지 않음이 이해될 것이며, 이는 통상의 기술자에 의해, 특히 전술한 교시들에 비추어 수정들이 이루어질 수 있기 때문이다. 통상의 기술자에 의해 이해되는 바와 같이, 본 발명은 청구항들의 범위를 초과하지 않고, 위에서 설 명된 것들로부터 하나 초과의 기술을 사용하여 매우 다양한 방식들로 수행될 수 있다."}
{"patent_id": "10-2024-7027038", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 명세서에 개시된 주제를 더 잘 이해하고 실제로 어떻게 수행될 수 있는지를 예시하기 위해, 이제 실시예들이 첨부 도면들을 참조하여 단지 비제한적인 예로서 설명될 것이다. 도 1a는 본 발명의 일 실시예에 따른 원예 작물 성장 시스템의 개략도이다. 도 1b는 도 1a의 원예 작물 성장 시스템에서 보여지는 원예 작물 성장 설비를 도시한다.도 2a는 도 1a의 원예 작물 성장 설비를 도시하며, 그의 벽은 내부를 시각화하고 원예 작물 성장 모듈을 노출시 키기 위해 투명하게 만들어진다. 도 2b는 도 2a에 도시된 원예 작물 성장 모듈 부분의 확대도이다. 도 3a는 벽이 제거된 도 2b에 도시된 원예 작물 성장 모듈의 정면 우측 사시도이다. 도 3b는 도 3a에 도시된 원예 작물 성장 모듈의 정면, 좌측, 사시도이다. 도 4a는 단순화를 위해 일부 요소가 제거된 도 3a에 도시된 원예 작물 성장 모듈을 도시한다. 도 4b는 도 4a에서 4B로 표시된 부분의 확대도이다. 도 4c는 도 4b에서 4C로 표시된 부분의 확대도이다. 도 4d는 도 4b에서 4D로 표시된 부분의 확대도이다. 도 5a는 도 4a에서 5A로 표시된 부분의 확대도이다. 도 5b는 도 5a에서 5B로 표시된 부분의 확대도이다. 도 5c는 도 5b에 도시된 부분의 좌측 사시도이다. 도 5d는 도 5a에서 5D로 표시된 부분의 확대도이다. 도 5e는 도 5b에 도시된 부분의 저면 사시도이다. 도 6은 도 4d에서 6A로 표시된 부분을 확대한 도면이다. 도 7a는 도 4d의 라인 7A - 7A를 따른 수직 단면도이다. 도 7b는 도 7a에서 7B로 표시된 부분에 도시된 밸브 시스템의 확대도로서, 밸브는 개방 위치에 있다. 도 7c는 도 7b와 동일하며, 밸브가 폐쇄 위치에 있다. 도 7d는 도 4c의 라인 7D - 7D를 따른 수직 단면도이다. 도 8a는 도 4c의 라인 8A -8A를 따른 수직 단면도이다. 도 8b는 도 8a에서 8B로 표시된 부분의 확대도이다. 도 8c는 도 8a의 8C로 표시된 부분의 확대도이다. 도 9a는 도 3a의 9A에 표시된 부분의 확대도이다. 도 9b는 도 9a의 9B에 표시된 부분의 확대도이다. 도 9c는 도 9b의 라인 9C - 9C를 따른 수직 단면도이다. 도 10a는 도 3a와 동일하며, 성장 트레이가 적재된 성장 트레이 리프트를 갖는다. 도 10b는 도 10a의 10B로 표시된 부분의 확대도이다. 도 11a는 본 개시내용의 일 실시예에 따른 성장 트레이의 사시도이다. 도 11b는 도 11a의 라인 11B - 11B를 따른 수직 단면도이다. 도 12a는 도 4c에서 12A로 표시된 부분을 확대한 도면으로, 트레이 정지 위치에서의 성장 트레이 잠금 메커니즘 을 도시한다. 도 12b는 트레이 로딩 위치에서의 성장 트레이 잠금 메커니즘을 도시한다. 도 13a는 일례에 따른 성장 트레이 추진 유닛을 예시하는 하부 사시도이며, 여기서 몇몇 다른 서브조립체들이 명료화를 위해 숨겨져 있다. 도 13b는 도 13a의 13B로 표시된 부분의 확대된 수직 단면도이다. 도 14는 가능한 실시예들의 성장 트레이 로딩 스테이지들을 도시한다.도 15a 내지 도 15d는 하부 트레이 이송 시스템 및 그 리프팅 메커니즘의 가능한 구성을 도시한다. 도 16a 내지 도 16e는 가능한 실시예들에 따른 성장 트레이 로딩을 예시한다. 도 17a 내지 도 17c는 트레이 잠금 메커니즘을 이용하는 가능한 실시예들에 따른 성장 트레이 언로딩을 예시한 다. 도 18a 내지 도 18f는 상부 트레이 이송 시스템의 가능한 구성을 도시한다. 도 19a 내지 도 19k는 상부 트레이 이송 시스템을 이용하는 성장 트레이 로딩을 도시한다. 도 20은 가능한 실시예들의 식물 성장 배열 및 성장 사이클을 도시한다. 도 21a 내지 도 21c는 가능한 실시예들의 관개 배열들을 도시한다. 도 22a 내지 도 22h는 다른 가능한 실시예들의 관개 배열을 도시한다. 도 23a 내지 도 23c는 가능한 실시예들의 배수 배열을 도시한다. 도 24a 내지 도 24d는 가능한 실시예들의 시스템 환기 배열을 도시한다. 도 25a 내지 도 25h는 가능한 실시예들의 수분 시퀀스를 도시한다. 도 26은 가능한 실시예들의 환경 제어 배열을 도시한다. 도 27a 및 도 27b는 가능한 실시예들의 작물 모니터링 배열을 도시한다."}
