{"patent_id": "10-2017-0055768", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2018-0121273", "출원번호": "10-2017-0055768", "발명의 명칭": "객체에 대응하는 콘텐트를 출력하기 위한 방법 및 그 전자 장치", "출원인": "삼성전자주식회사", "발명자": "정유민"}}
{"patent_id": "10-2017-0055768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,통신 인터페이스;복수개의 콘텐트들을 저장하기 위한 메모리; 및상기 메모리와 전기적으로 연결된 적어도 하나의 프로세서를 포함하며,상기 메모리는, 실행될 때 상기 적어도 하나의 프로세서로 하여금,상기 통신 인터페이스를 통해, 외부 장치로부터 이미지를 수신하고, 상기 이미지 중 상기 객체에 대응하는 제 1 영역을 통해 상기 객체의 형상과 관련된 제 1 정보를 확인하고, 상기 이미지 중 제 2 영역을 통해 상기 객체의 부가 정보와 관련된 제 2 정보를 확인하고, 상기 제 1 정보 및 상기 제 2 정보에 적어도 기반하여, 상기 복수개의 콘텐트들 중 상기 제 1 정보에 대응하는적어도 하나의 콘텐트를 정렬하고, 상기 정렬된 제 1 정보에 대응하는 적어도 하나의 콘텐트를 상기 통신 인터페이스를 통해 상기 외부 장치로 전송하는 인스트럭션들을 저장하는 전자 장치."}
{"patent_id": "10-2017-0055768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,상기 메모리는, 복수의 저장 영역 포함하고, 상기 인스트럭션들은, 상기 적어도 하나의 프로세서로 하여금,상기 복수의 저장 영역 중 상기 객체의 형상 정보 또는 상표 정보 중 적어도 하나에 대응하는 적어도 하나의 저장 영역으로부터 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트를 획득하도록 하는 인스트럭션들을 포함하는전자 장치."}
{"patent_id": "10-2017-0055768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항에 있어서,상기 인스트럭션들은, 상기 적어도 하나의 프로세서로 하여금,상기 이미지에서 추출한 텍스트, 상기 이미지에서 추출한 상표에 대응하는 텍스트 또는 상기 객체의 형상에 대응하는 텍스트 중 적어도 하나에 기반하여 상기 제 2 정보를 검출하는 인스트럭션들을 포함하는 전자 장치."}
{"patent_id": "10-2017-0055768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3항에 있어서,상기 인스트럭션들은, 상기 적어도 하나의 프로세서로 하여금, 상기 이미지에서 추출한 단어의 크기, 단어의 표시 위치, 단어를 구성하는 문자의 개수, 단어를 포함되는 언어의 개수, 제거 단어 목록 또는 단어 사이의 거리 중 적어도 하나에 기반하여 상기 이미지에서 추출한 텍스트의공개특허 10-2018-0121273-3-적어도 일부를 상기 제 2 정보로 설정하는 인스트럭션들을 포함하는 전자 장치."}
{"patent_id": "10-2017-0055768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1항에 있어서,상기 인스트럭션들은, 상기 적어도 하나의 프로세서로 하여금,상기 적어도 하나의 콘텐트와 상기 제 1 정보의 유사도에 기반하여 상기 적어도 하나의 콘텐트의 우선순위를 설정하고,상기 적어도 하나의 콘텐트 중 상기 제 2 정보에 대응하는 콘텐트의 우선순위를 갱신하고,상기 갱신된 우선순위에 기반하여 상기 적어도 하나의 콘텐트를 정렬하는 인스트럭션들을 포함하는 전자 장치."}
{"patent_id": "10-2017-0055768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5항에 있어서,상기 인스트럭션들은, 상기 적어도 하나의 프로세서로 하여금,상기 제 1 정보에 대응하는 적어도 하나의 콘텐트 중 상기 제 2 정보에 대응하는 콘텐트가 존재하는지확인하고, 상기 제 2 정보에 대응하는 콘텐트가 존재하지 않는 경우, 다른 외부 장치로부터 상기 제 2 정보의 적어도 일부에 대응하는 적어도 하나의 다른 콘텐트를 획득하고, 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트와 상기 상기 제 2 정보의 적어도 일부에 대응하는 적어도 하나의 다른 콘텐트 중 중복되는 콘텐트를 검출하고, 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트 중 상기 중복되는 콘텐트의 우선순위를 갱신하고,상기 갱신된 우선순위에 기반하여 상기 적어도 하나의 콘텐트를 정렬하는 인스트럭션들을 포함하는 전자 장치."}
{"patent_id": "10-2017-0055768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "전자 장치의 동작 방법에 있어서,외부 장치로부터 이미지를 수신하는 동작; 상기 이미지 중 상기 객체에 대응하는 제 1 영역을 통해 상기 객체의 형상과 관련된 제 1 정보를 확인하는동작; 상기 이미지 중 제 2 영역을 통해 상기 객체의 부가 정보와 관련된 제 2 정보를 확인하는 동작; 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트를 획득하는 동작;상기 제 1 정보 및 상기 제 2 정보에 적어도 기반하여, 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트를 정렬하는 동작, 및상기 정렬된 제 1 정보에 대응하는 적어도 하나의 콘텐트를 상기 외부 장치로 전송하는 동작을 포함하는 방법."}
{"patent_id": "10-2017-0055768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7항에 있어서,상기 콘텐트를 획득하는 동작은, 복수의 저장 영역 중 상기 객체의 형상 정보 또는 상표 정보 중 적어도 하나에 대응하는 적어도 하나의 저장 영공개특허 10-2018-0121273-4-역으로부터 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트를 획득하는 동작을 포함하는 방법."}
{"patent_id": "10-2017-0055768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 7항에 있어서,상기 콘텐트를 정렬하는 동작은,상기 적어도 하나의 콘텐트와 상기 제 1 정보의 유사도에 기반하여 상기 적어도 하나의 콘텐트의 우선순위를 설정하는 동작; 상기 적어도 하나의 콘텐트 중 상기 제 2 정보에 대응하는 콘텐트의 우선순위를 갱신하는 동작; 및상기 갱신된 우선순위에 기반하여 상기 적어도 하나의 콘텐트를 정렬하는 동작을 포함하는 방법."}
{"patent_id": "10-2017-0055768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9항에 있어서,상기 콘텐트를 정렬하는 동작은,상기 제 1 정보에 대응하는 적어도 하나의 콘텐트 중 상기 제 2 정보에 대응하는 콘텐트가 존재하는지 확인하는동작; 상기 제 2 정보에 대응하는 콘텐트가 존재하지 않는 경우, 다른 외부 장치로부터 상기 제 2 정보의 적어도 일부에 대응하는 적어도 하나의 다른 콘텐트를 획득하는 동작; 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트와 상기 제 2 정보의 적어도 일부에 대응하는 적어도 하나의다른 콘텐트 중 중복되는 콘텐트를 검출하는 동작; 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트 중 상기 중복되는 콘텐트의 우선순위를 갱신하는 동작; 상기 갱신된 우선순위에 기반하여 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트를 정렬하는 동작을 포함하는 방법."}
{"patent_id": "10-2017-0055768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "전자 장치에 있어서,카메라;디스플레이;적어도 하나의 프로세서; 및상기 적어도 하나의 프로세서와 전기적으로 연결된 메모리를 포함하며, 상기 메모리는, 실행될 때 상기 적어도 하나의 프로세서로 하여금,상기 카메라를 통해 객체를 포함하는 이미지를 획득하고, 상기 이미지 중 상기 객체에 대응하는 제 1 영역을 통해 상기 객체의 형상과 관련된 제 1 정보를 확인하고, 상기 이미지 중 제 2 영역을 통해 상기 객체의 부가 정보와 관련된 제 2 정보를 확인하고, 상기 제 1 정보 및 상기 제 2 정보에 적어도 기반하여, 외부 장치로부터 획득한 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트를 상기 디스플레이를 통해 제공하는 인스트럭션들을 저장하는 전자 장치."}
{"patent_id": "10-2017-0055768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "공개특허 10-2018-0121273-5-제 11항에 있어서,상기 외부 장치는, 복수의 저장 영역 포함하고, 상기 인스트럭션들은, 상기 적어도 하나의 프로세서로 하여금,상기 복수의 저장 영역 중 상기 객체의 형상 정보 또는 상표 정보 중 적어도 하나에 대응하는 적어도 하나의 저장 영역으로부터 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트를 획득하도록 하는 인스트럭션들을 포함하는전자 장치."}
{"patent_id": "10-2017-0055768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 11항에 있어서,상기 인스트럭션들은, 상기 적어도 하나의 프로세서로 하여금,상기 외부 장치로부터 상기 제 1 정보에 대응하는 적어도 하나의 상품의 식별 정보를 획득하고,다른 외부 장치로부터 상기 적어도 하나의 상품의 식별 정보에 대응하는 상세 정보를 상기 적어도 하나의 콘텐트의 적어도 일부로 획득하도록 하는 인스트럭션들을 포함하는 전자 장치."}
{"patent_id": "10-2017-0055768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 11항에 있어서,상기 인스트럭션들은, 상기 적어도 하나의 프로세서로 하여금,상기 이미지에서 추출한 텍스트, 상기 이미지에서 추출한 상표에 대응하는 텍스트 또는 상기 객체의 형상에 대응하는 텍스트 중 적어도 하나에 기반하여 상기 제 2 정보를 검출하는 인스트럭션들을 포함하는 전자 장치."}
{"patent_id": "10-2017-0055768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 14항에 있어서,상기 인스트럭션들은, 상기 적어도 하나의 프로세서로 하여금, 상기 이미지에서 추출한 단어의 크기, 단어의 표시 위치, 단어를 구성하는 문자의 개수, 단어를 포함되는 언어의 개수, 제거 단어 목록 또는 단어 사이의 거리 중 적어도 하나에 기반하여 상기 이미지에서 추출한 텍스트의적어도 일부를 상기 제 2 정보로 설정하는 인스트럭션들을 포함하는 전자 장치."}
{"patent_id": "10-2017-0055768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 11항에 있어서,상기 인스트럭션들은, 상기 적어도 하나의 프로세서로 하여금,상기 적어도 하나의 콘텐트가 상기 제 1 정보 및 상기 제 2 정보와 연관된 정도에 기반하여, 상기 적어도 하나의 콘텐트를 상기 디스플레이를 통해 제공하는 인스트럭션들을 포함하는 전자 장치."}
{"patent_id": "10-2017-0055768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 11항에 있어서,상기 인스트럭션들은, 상기 적어도 하나의 프로세서로 하여금,상기 적어도 하나의 콘텐트와 상기 제 1 정보의 유사도에 기반하여 상기 적어도 하나의 콘텐트의 우선순위를 설공개특허 10-2018-0121273-6-정하고,상기 적어도 하나의 콘텐트 중 상기 제 2 정보에 대응하는 콘텐트의 우선순위를 갱신하고,상기 갱신된 우선순위에 기반하여 상기 적어도 하나의 콘텐트를 상기 디스플레이를 통해 표시하는 인스트럭션들을 포함하는 전자 장치."}
{"patent_id": "10-2017-0055768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 17항에 있어서,상기 인스트럭션들은, 상기 적어도 하나의 프로세서로 하여금,상기 제 1 정보에 대응하는 적어도 하나의 콘텐트 중 상기 제 2 정보에 대응하는 콘텐트가 존재하는지확인하고, 상기 제 2 정보에 대응하는 콘텐트가 존재하지 않는 경우, 다른 외부 장치로부터 상기 제 2 정보의 적어도 일부에 대응하는 적어도 하나의 다른 콘텐트를 획득하고, 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트와 상기 적어도 하나의 다른 콘텐트를 상기 디스플레이를 통해표시하는 인스트럭션들을 포함하는 전자 장치."}
{"patent_id": "10-2017-0055768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 18항에 있어서,상기 인스트럭션들은, 상기 적어도 하나의 프로세서로 하여금,상기 디스플레이의 제 1 영역을 통해 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트를 표시하고; 상기 디스플레이의 제 2 영역을 통해 상기 적어도 하나의 다른 콘텐트를 표시하는 인스트럭션들을 포함하는 전자 장치."}
{"patent_id": "10-2017-0055768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 8항에 있어서,상기 인스트럭션들은, 상기 적어도 하나의 프로세서로 하여금,상기 제 1 정보에 대응하는 적어도 하나의 콘텐트와 상기 적어도 하나의 다른 콘텐트 중 중복되는 콘텐트를 검출하고, 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트 중 상기 중복되는 콘텐트의 우선순위를 갱신하고,상기 갱신된 우선순위에 기반하여 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트를 상기 디스플레이를 통해표시하는 인스트럭션들을 포함하는 전자 장치."}
{"patent_id": "10-2017-0055768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "전자 장치의 동작 방법에 있어서,상기 전자 장치와 전기적으로 연결된 카메라를 통해 객체를 포함하는 이미지를 획득하는 동작; 상기 이미지 중 상기 객체에 대응하는 제 1 영역을 통해 상기 객체의 형상과 관련된 제 1 정보를 확인하는동작; 상기 이미지 중 제 2 영역을 통해 상기 객체의 부가 정보와 관련된 제 2 정보를 확인하는 동작; 공개특허 10-2018-0121273-7-외부 장치로부터 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트를 획득하는 동작; 및 상기 제 1 정보 및 상기 제 2 정보에 적어도 기반하여, 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트를 표시하는 동작을 포함하는 방법."}
{"patent_id": "10-2017-0055768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제 21항에 있어서,상기 외부 장치는, 복수의 저장 영역을 포함하고, 상기 콘텐트를 획득하는 동작은, 상기 복수의 저장 영역 중 상기 객체의 형상 정보 또는 상표 정보 중 적어도 하나에 대응하는 적어도 하나의 저장 영역으로부터 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트를 획득하는 동작을 포함하는 방법."}
{"patent_id": "10-2017-0055768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제 21항에 있어서,상기 콘텐트를 획득하는 동작은, 상기 외부 장치로부터 상기 제 1 정보에 대응하는 적어도 하나의 상품의 식별 정보를 획득하는 동작; 및다른 외부 장치로부터 상기 적어도 하나의 상품의 식별 정보에 대응하는 상세 정보를 상기 적어도 하나의 콘텐트의 적어도 일부로 획득하는 동작을 포함하는 방법."}
{"patent_id": "10-2017-0055768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제 21항에 있어서,상기 제 2 정보를 확인하는 동작은,상기 이미지에서 추출한 텍스트, 상기 이미지에서 추출한 상표에 대응하는 텍스트 또는 상기 객체의 형상에 대응하는 텍스트 중 적어도 하나에 기반하여 상기 제 2 정보를 검출하는 동작을 포함하는 방법."}
{"patent_id": "10-2017-0055768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제 21항에 있어서,상기 제 2 정보를 확인하는 동작은, 상기 이미지에서 추출한 단어의 크기, 단어의 표시 위치, 단어를 구성하는 문자의 개수, 단어를 포함되는 언어의 개수, 제거 단어 목록 또는 단어 사이의 거리 중 적어도 하나에 기반하여 상기 이미지에서 추출한 텍스트의적어도 일부를 상기 제 2 정보로 설정하는 동작을 포함하는 방법."}
{"patent_id": "10-2017-0055768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "제 21항에 있어서,상기 콘텐트를 표시하는 동작은,상기 적어도 하나의 콘텐트가 상기 제 1 정보 및 상기 제 2 정보와 연관된 정도에 기반하여, 상기 적어도 하나의 콘텐트를 상기 전자 장치와 전기적으로 연결된 디스플레이에 표시하는 동작을 포함하는 방법.공개특허 10-2018-0121273-8-청구항 27 제 21항에 있어서,상기 콘텐트를 표시하는 동작은,상기 적어도 하나의 콘텐트와 상기 제 1 정보의 유사도에 기반하여 상기 적어도 하나의 콘텐트의 우선순위를 설정하는 동작; 상기 적어도 하나의 콘텐트 중 상기 제 2 정보에 대응하는 콘텐트의 우선순위를 갱신하는 동작; 및상기 갱신된 우선순위에 기반하여 상기 적어도 하나의 콘텐트를 표시하는 동작을 포함하는 방법."}
{"patent_id": "10-2017-0055768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_28", "content": "제 27항에 있어서,상기 제 1 정보에 대응하는 적어도 하나의 콘텐트 중 상기 제 2 정보에 대응하는 콘텐트가 존재하는지 확인하는동작; 상기 제 2 정보에 대응하는 콘텐트가 존재하지 않는 경우, 다른 외부 장치로부터 상기 제 2 정보의 적어도 일부에 대응하는 적어도 하나의 다른 콘텐트를 획득하는 동작; 및 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트와 상기 적어도 하나의 다른 콘텐트를 표시하는 동작을 더 포함하는 방법."}
{"patent_id": "10-2017-0055768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "제 28항에 있어서,상기 콘텐트를 표시하는 동작은, 상기 전자 장치와 기능적으로 연결된 디스플레이의 제 1 영역을 통해, 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트를 표시하는 동작; 및상기 디스플레이의 제 2 영역을 통해, 상기 적어도 하나의 다른 콘텐트를 구분하여 표시하는 동작을 포함하는방법."}
{"patent_id": "10-2017-0055768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_30", "content": "제 28항에 있어서,상기 콘텐트를 표시하는 방법은, 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트와 상기 적어도 하나의 다른 콘텐트 중 중복되는 콘텐트를 검출하는 동작; 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트 중 상기 중복되는 콘텐트의 우선순위를 갱신하는 동작; 상기 갱신된 우선순위에 기반하여 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트를 표시하는 동작을 포함하는 방법."}
{"patent_id": "10-2017-0055768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_31", "content": "전자 장치에 있어서,통신 인터페이스;공개특허 10-2018-0121273-9-복수개의 콘텐트들을 저장하기 위한 메모리; 및상기 메모리와 전기적으로 연결된 적어도 하나의 프로세서를 포함하며,상기 메모리는, 실행될 때 상기 적어도 하나의 프로세서로 하여금,상기 통신 인터페이스를 통해, 외부 장치로부터 이미지를 수신하고, 상기 이미지 중 상기 객체에 대응하는 제 1 영역을 통해 상기 객체의 형상과 관련된 제 1 정보를 확인하고, 상기 이미지 중 제 2 영역을 통해 상기 객체의 부가 정보와 관련된 제 2 정보를 확인하고, 상기 제 1 정보 및 상기 제 2 정보에 적어도 기반하여, 상기 복수개의 콘텐트들 중 상기 제 1 정보에 대응하는적어도 하나의 콘텐트를 선택하고, 상기 선택된 제 1 정보에 대응하는 적어도 하나의 콘텐트를 상기 통신 인터페이스를 통해 상기 외부 장치로 전송하는 인스트럭션들을 저장하는 전자 장치."}
{"patent_id": "10-2017-0055768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_32", "content": "제 31항에 있어서,상기 인스트럭션들은, 상기 적어도 하나의 프로세서로 하여금,상기 제 1 정보 및 상기 제 2 정보에 적어도 기반하여, 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트를 정렬하고, 상기 정렬된 제 1 정보에 대응하는 적어도 하나의 콘텐트를 상기 통신 인터페이스를 통해 상기 외부 장치로 전송하는 인스트럭션들을 포함하는 전자 장치."}
{"patent_id": "10-2017-0055768", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 다양한 실시 예는 전자 장치에서 이미지에 포함된 객체에 대응하는 적어도 하나의 콘텐트를 출력하기 위한 장치 및 방법에 관한 것이다. 이때, 전자 장치는, 메라, 디스플레이, 적어도 하나의 프로세서, 및 상기 적 어도 하나의 프로세서와 전기적으로 연결된 메모리를 포함하며, 상기 메모리는, 실행될 때 상기 적어도 하나의 프로세서로 하여금, 상기 카메라를 통해 객체를 포함하는 이미지를 획득하고, 상기 이미지 중 상기 객체에 대응 하는 제 1 영역을 통해 상기 객체의 형상과 관련된 제 1 정보를 확인하고, 상기 이미지 중 제 2 영역을 통해 상 기 객체의 부가 정보와 관련된 제 2 정보를 확인하고, 상기 제 1 정보 및 상기 제 2 정보에 적어도 기반하여, 외 부 장치로부터 획득한 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트를 상기 디스플레이를 통해 제공하는 인 스트럭션들을 저장할 수 있다. 다른 실시 예들도 가능할 수 있다."}
{"patent_id": "10-2017-0055768", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시 예는 전자 장치에서 이미지에 포함된 객체에 대응하는 적어도 하나의 콘텐트를 출력하기 위한 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2017-0055768", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "정보통신 기술 및 반도체 기술의 발전으로 각종 전자 장치들이 다양한 기능을 제공하고 있다. 예를 들어, 다양 한 기능은 음성 통화 서비스, 메시지 서비스, 방송 서비스, 무선 인터넷 서비스, 카메라 서비스 및 음악 재생 서비스와 같은 멀티미디어 서비스를 포함할 수 있다. 전자 장치는 사용자의 편의성을 높이기 위해 검색 서비스를 제공할 수 있다. 검색 서비스는 전자 장치의 카메라 를 통해 획득한 바코드나 QR(quick response) 코드에 대응하는 상품 정보를 검색하는 서비스를 포함할 수 있다."}
{"patent_id": "10-2017-0055768", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "전자 장치는 바코드 또는 QR 코드와 같이 정보 검색을 위해 설정된 객체의 영상을 이용하여 검색 서비스를 제공 할 수 있다. 이에 따라, 검색 서비스를 제공할 수 있는 대상은 정보 검색을 위해 설정된 객체로 제한될 수 있다. 전자 장치가 객체의 영상과 관련된 검색 결과를 출력하므로, 전자 장치의 사용자는 객체와 관련하여 사용자가 원하는 정보를 얻지 못할 수 있다. 본 발명의 다양한 실시 예는 전자 장치에서 이미지에 포함된 적어도 하나의 객체에 대응하는 콘텐트를 표시하기 위한 장치 및 방법을 제공할 수 있다."}
{"patent_id": "10-2017-0055768", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 다양한 실시 예에 따르면, 전자 장치는 카메라, 디스플레이, 적어도 하나의 프로세서, 및 상기 적어 도 하나의 프로세서와 전기적으로 연결된 메모리를 포함하며, 상기 메모리는, 실행될 때 상기 적어도 하나의 프 로세서로 하여금, 상기 카메라를 통해 객체를 포함하는 이미지를 획득하고, 상기 이미지 중 상기 객체에 대응하 는 제 1 영역을 통해 상기 객체의 형상과 관련된 제 1 정보를 확인하고, 상기 이미지 중 제 2 영역을 통해 상기 객체의 부가 정보와 관련된 제 2 정보를 확인하고, 상기 제 1 정보 및 상기 제 2 정보에 적어도 기반하여, 외부 장치로부터 획득한 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트를 상기 디스플레이를 통해 제공하는 인스 트럭션들을 저장할 수 있다. 본 발명의 다양한 실시 예에 따르면, 전자 장치의 동작 방법은, 상기 전자 장치와 전기적으로 연결된 카메라를 통해 객체를 포함하는 이미지를 획득하는 동작과, 상기 이미지 중 상기 객체에 대응하는 제 1 영역을 통해 상기 객체의 형상과 관련된 제 1 정보를 확인하는 동작과, 상기 이미지 중 제 2 영역을 통해 상기 객체의 부가 정보 와 관련된 제 2 정보를 확인하는 동작과, 외부 장치로부터 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트를 획득하는 동작, 및 상기 제 1 정보 및 상기 제 2 정보에 적어도 기반하여, 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트를 표시하는 동작을 포함할 수 있다. 본 발명의 다양한 실시 예에 따르면, 전자 장치는, 통신 인터페이스, 복수개의 저장 영역을 포함하는 메모리, 및 상기 메모리와 전기적으로 연결된 적어도 하나의 프로세서를 포함하며, 상기 메모리는, 실행될 때 상기 적어 도 하나의 프로세서로 하여금, 상기 통신 인터페이스를 통해, 외부 장치로부터 이미지를 수신하고, 상기 이미지 중 상기 객체에 대응하는 제 1 영역을 통해 상기 객체의 형상과 관련된 제 1 정보를 확인하고, 상기 이미지 중 제 2 영역을 통해 상기 객체의 부가 정보와 관련된 제 2 정보를 확인하고, 상기 제 1 정보 및 상기 제 2 정보에 적어도 기반하여, 상기 복수 개의 콘텐트 중 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트를 정렬하고, 상 기 정렬된 제 1 정보에 대응하는 적어도 하나의 콘텐트를 상기 통신 인터페이스를 통해 상기 외부 장치로 전송 하는 인스트럭션들을 저장할 수 있다. 본 발명의 다양한 실시 예에 따르면, 전자 장치는, 통신 인터페이스, 복수개의 저장 영역을 포함하는 메모리, 및 상기 메모리와 전기적으로 연결된 적어도 하나의 프로세서를 포함하며, 상기 메모리는, 실행될 때 상기 적어 도 하나의 프로세서로 하여금, 상기 통신 인터페이스를 통해, 외부 장치로부터 이미지를 수신하고, 상기 이미지 중 상기 객체에 대응하는 제 1 영역을 통해 상기 객체의 형상과 관련된 제 1 정보를 확인하고, 상기 이미지 중 제 2 영역을 통해 상기 객체의 부가 정보와 관련된 제 2 정보를 확인하고, 상기 제 1 정보 및 상기 제 2 정보에 적어도 기반하여, 상기 복수의 콘텐트 중 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트를 선택하고, 상기 선택된 제 1 정보에 대응하는 적어도 하나의 콘텐트를 상기 통신 인터페이스를 통해 상기 외부 장치로 전송하는 인스트럭션들을 저장할 수 있다. 본 발명의 다양한 실시 예에 따르면, 전자 장치의 동작 방법은, 외부 장치로부터 이미지를 수신하는 동작과, 상 기 이미지 중 상기 객체에 대응하는 제 1 영역을 통해 상기 객체의 형상과 관련된 제 1 정보를 확인하는 동작과 상기 이미지 중 제 2 영역을 통해 상기 객체의 부가 정보와 관련된 제 2 정보를 확인하는 동작과 상기 제 1 정 보에 대응하는 적어도 하나의 콘텐트를 획득하는 동작과 상기 제 1 정보 및 상기 제 2 정보에 적어도 기반하여, 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트를 정렬하는 동작, 및 상기 정렬된 제 1 정보에 대응하는 적어 도 하나의 콘텐트를 상기 외부 장치로 전송하는 동작을 포함할 수 있다."}
{"patent_id": "10-2017-0055768", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "다양한 실시 예에 따른 전자 장치 및 그 동작 방법은, 이미지에서 검출한 적어도 하나의 객체에 대응하는 적어 도 하나의 콘텐트의 정보를 출력함으로써, 다양한 객체에 대한 검색서비스를 제공할 수 있다. 다양한 실시 예에 따른 전자 장치 및 그 동작 방법은, 이미지에 포함된 객체의 형상 또는 상표 정보 중 적어도 하나에 기반하여 객체에 대응하는 콘텐트의 검색 범위(예: 서버, 저장 영역 등)를 한정함으로써, 객체에 대응하 는 콘텐트의 검색 시간을 줄일 수 있다. 다양한 실시 예에 따른 전자 장치 및 그 동작 방법은, 이미지의 객체에 대응하는 적어도 하나의 콘텐트를 객체 의 형상 및 부가 정보(예: 텍스트 검출 정보)에 기반하여 정렬함으로써, 객체에 대한 검색서비스의 정확도를 향 상시킬 수 있다."}
{"patent_id": "10-2017-0055768", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 문서의 다양한 실시 예들이 첨부된 도면을 참조하여 기재된다. 실시 예 및 이에 사용된 용어들은 본 문서에 기재된 기술을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 해당 실시 예의 다양한 변경, 균등물, 및/또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유 사한 참조 부호가 사용될 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함 할 수 있다. 본 문서에서, \"A 또는 B\" 또는 \"A 및/또는 B 중 적어도 하나\" 등의 표현은 함께 나열된 항목들의 모든 가능한 조합을 포함할 수 있다. \"제 1,\" \"제 2,\" \"첫째,\" 또는 \"둘째,\" 등의 표현들은 해당 구성요소들을, 순서 또는 중요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구성요소들 을 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에 \"(기능적으로 또는 통신적으로) 연 결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 상술한 어떤 구성요소가 상술한 다른 구성요소에 직접적으로 연결되거나, 다른 구성요소(예: 제 3 구성요소)를 통하여 연결될 수 있다. 본 문서에서 사용된 표현 \"~하도록 구성된(또는 설정된)(configured to)\"은 상황에 따라, 예를 들면, 하드웨어 적 또는 소프트웨어적으로 \"~에 적합한\", \"~하는 능력을 가지는\", \"~하도록 설계된\", \"~하도록 변경된\", \"~하도 록 만들어진\", 또는 \"~를 할 수 있는\"과 상호 호환적으로(interchangeably) 사용될 수 있다. 어떤 상황에서는, \"~하도록 구성된 장치\"라는 표현은, 그 장치가 다른 장치 또는 부품들과 함께 \"~할 수 있는\" 것을 의미할 수 있 다. 예를 들면, 문구 \"A, B, 및 C를 수행하도록 구성된(또는 설정된) 프로세서\"는 해당 동작을 수행하기 위한 전용 프로세서(예: 임베디드 프로세서), 또는 메모리 장치에 저장된 하나 이상의 소프트웨어 프로그램들을 실행 함으로써, 해당 동작들을 수행할 수 있는 범용 프로세서(예: CPU 또는 AP(application processor))를 의미할 수 있다. 본 문서의 다양한 실시 예들에 따른 전자 장치는, 예를 들면, 스마트폰, 태블릿 PC, 이동 전화기, 영상 전화기, 전자책 리더기, 데스크탑 PC, 랩탑 PC, 넷북 컴퓨터, 워크스테이션, 서버, PDA, PMP(portable multimedia player), MP3 플레이어, 모바일 의료기기, 카메라, 또는 웨어러블 장치 중 적어도 하나를 포함할 수 있다. 다양 한 실시 예에 따르면, 웨어러블 장치는 액세서리형(예: 시계, 반지, 팔찌, 발찌, 목걸이, 안경, 콘택트렌즈, 또 는 머리 착용형 장치(head-mounted-device(HMD)), 직물 또는 의류 일체형(예: 전자 의복), 신체 부착형(예: 스 킨 패드 또는 문신), 또는 생체 이식형 회로 중 적어도 하나를 포함할 수 있다. 어떤 실시 예들에서, 전자 장치는, 예를 들면, 텔레비전, DVD(digital video disk) 플레이어, 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스, 홈 오토매이션 컨트롤 패널, 보안 컨트롤 패널, TV 박스(예: 삼성 HomeSyncTM, 애플TVTM, 또는 구글 TVTM), 게임 콘솔(예: XboxTM, PlayStationTM), 전자 사 전, 전자 키, 캠코더, 또는 전자 액자 중 적어도 하나를 포함할 수 있다. 다른 실시 예에서, 전자 장치는, 각종 의료기기(예: 각종 휴대용 의료측정기기(혈당 측정기, 심박 측정기, 혈압 측정기, 또는 체온 측정기 등), MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 또는 초음파기 등), 네비게이션 장치, 위성 항법 시스템(global navigation satellite system(GNSS)), EDR(event data recorder), FDR(flight data recorder), 자동차 인포테인먼트 장치, 선박용 전자 장비(예: 선박용 항법 장치, 자이로 콤파스 등), 항공 전자기기(avionics), 보안 기기, 차량용 헤 드 유닛(head unit), 산업용 또는 가정용 로봇, 드론(drone), 금융 기관의 ATM, 상점의 POS(point of sales), 또는 사물 인터넷 장치(예: 전구, 각종 센서, 스프링클러 장치, 화재경보기, 온도조절기, 가로등, 토스터, 운동 기구, 온수탱크, 히터, 보일러 등) 중 적어도 하나를 포함할 수 있다. 어떤 실시 예에 따르면, 전자 장치는 가구, 건물/구조물 또는 자동차의 일부, 전자 보드(electronic board), 전 자 사인 수신 장치(electronic signature receiving device), 프로젝터, 또는 각종 계측 기기(예: 수도, 전기, 가스, 또는 전파 계측 기기 등) 중 적어도 하나를 포함할 수 있다. 다양한 실시 예에서, 전자 장치는 플렉서블 하거나, 또는 전술한 다양한 장치들 중 둘 이상의 조합일 수 있다. 본 문서의 실시 예에 따른 전자 장치는 전술 한 기기들에 한정되지 않는다. 본 문서에서, 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공지능 전자 장치)를 지칭할 수 있다. 도 1a은 본 발명의 다양한 실시 예에서의 네트워크 환경 내의 전자 장치를 도시하고 있다. 도 1b는 본 발 명의 다양한 실시 예에서 객체의 검색 서비스를 제공하기 위한 전자 장치의 블록도를 도시하고 있다. 도 1c는 본 발명의 다양한 실시 예에서 객체에 대응하는 콘텐트를 저장하는 서버의 구성을 도시하고 있다. 도 1a를 참조하면, 전자 장치는 버스, 프로세서, 메모리, 입출력 인터페이스, 디스플 레이, 통신 인터페이스 및 카메라를 포함할 수 있다. 어떤 실시 예에서는, 전자 장치는, 구성요소들 중 적어도 하나를 생략하거나 다른 구성요소를 추가적으로 구비할 수 있다. 버스는, 예를 들면, 구성요소들(120 내지 180)을 서로 연결하고, 구성요소들 간의 신호(예: 제어 메시지 및/또는 데이터)를 전달하는 회로를 포함할 수 있다. 프로세서는, 중앙처리장치(CPU), 어플리케이션 프로세서(AP), 커뮤니케이션 프로세서 (communication processor(CP)) 또는 이미지 신호 프로세서(ISP) 중 하나 또는 그 이상을 포함할 수 있다. 프로세서는, 예 를 들면, 전자 장치의 적어도 하나의 다른 구성요소들의 제어 및/또는 통신에 관한 연산이나 데이터 처리 를 실행할 수 있다. 일 예로, 프로세서는 도 1b와 같이, 상표 검출 모듈, 객체 검출 모듈, 콘텐 트 검색 모듈, 부가 정보 검출 모듈 및 정렬 모듈를 이용하여 검색 서비스를 제공할 수 있다.한 실시 예에 따르면, 프로세서는 디스플레이에 표시된 이미지에서 적어도 하나의 객체를 검출할 수 있다. 예를 들어, 프로세서의 검출 모듈은 디스플레이에 표시된 이미지의 특징점을 추출할 수 있다. 객체 검출 모듈은 이미지의 특징점에 기반하여 이미지에 포함된 적어도 하나의 객체를 검출할 수 있 다. 일 예로, 객체 검출 모듈은 이미지에 포함된 객체의 형상 정보를 검출할 수 있다. 객체의 형상 정보는 객체의 특징점에 기반하여 검출된 객체의 외형 정보를 포함할 수 있다. 예컨대, 디스플레이에 표시된 이미 지는 카메라를 통해 획득한 프리뷰 이미지, 캡쳐 이미지, 메모리에 저장된 이미지 또는 외부 장치로 부터 수신한 이미지 중 적어도 하나를 포함할 수 있다. 한 실시 예에 따르면, 프로세서는 디스플레이에 표시된 이미지에서 상표 정보를 검출할 수 있다. 예 를 들어, 프로세서의 상표 검출 모듈은 객체 검출 모듈을 통해 검출한 이미지에 포함되는 각각 의 객체와 기준 상표와 비교할 수 있다. 상표 검출 모듈은 기준 상표와의 유사도가 기준 유사도를 초과하 는 객체를 상표로 판단할 수 있다. 일 예로, 상표 검출 모듈은 이미지에 포함되는 객체 중 기준 상표와 비 교하기 위한 적어도 하나의 후보 객체를 추출할 수 있다. 후보 객체는 이미지에서 추출한 객체의 위치, 크기, 형태 또는 색상 중 적어도 하나에 기반하여 추출될 수 있다. 예컨대, 상표 검출 모듈은 특정 객체의 내부 에 위치한 객체를 후보 객체로 추출할 수 있다. 예컨대, 특정 객체는 디스플레이에 표시된 이미지에 포함 되는 객체 중 사용자의 입력에 기반하여 선택된 객체를 포함할 수 있다. 한 실시 예에 따르면, 기준 상표는 메 모리 또는 외부 장치(예: 서버)에 저장될 수 있다. 한 실시 예에 따르면, 프로세서는 이미지에 포함된 객체의 형상 정보 또는 상표 정보 중 적어도 하나에 기 반하여 검색 서비스를 제공하는데 사용할 검색 영역을 결정할 수 있다. 예를 들어, 프로세서의 콘텐트 검 색 모듈은 검색 서비스를 제공하는데 사용 가능한 다수 개의 저장 영역 중 객체의 형상 정보에 대응하는 적어도 하나의 저장 영역을 검색 영역의 적어도 일부로 선택할 수 있다. 콘텐트 검색 모듈은 이미지에 포 함된 상표 정보에 기반하여 객체의 형상 정보에 대응하는 적어도 하나의 저장 영역에서 객체에 대응하는 콘텐트 의 검색 영역을 한정할 수 있다. 예를 들어, 프로세서의 콘텐트 검색 모듈은 검색 서비스를 제공하는 데 사용 가능한 다수 개의 저장 영역 중 이미지에 포함된 상표 정보에 대응하는 적어도 하나의 저장 영역을 검 색 영역의 적어도 일부로 선택할 수 있다. 콘텐트 검색 모듈은 객체의 형상 정보에 기반하여 이미지에 포 함된 상표 정보에 대응하는 적어도 하나의 저장 영역에서 객체에 대응하는 콘텐트의 검색 영역을 한정할 수 있 다. 예컨대, 다수 개의 저장 영역은 메모리 또는 외부 장치(예: 서버)에 포함될 수 있다. 한 실시 예에 따르면, 프로세서는 검색 서비스를 제공하기 위해 결정한 검색 영역을 통해, 이미지에 포함 된 객체의 형상 정보에 대응하는 적어도 하나의 콘텐트를 검색할 수 있다. 예를 들어, 프로세서의 콘텐트 검색 모듈은 검색 서비스를 제공하기 위한 사용할 검색 영역 내에서 객체 검출 모듈에서 검출한 객체 의 형상 정보에 대응하는 적어도 하나의 콘텐트를 검출할 수 있다. 예컨대, 객체의 형상 정보에 대응하는 콘텐 트는 검색 영역에 포함되는 콘텐트 중 객체의 형상 정보와의 유사도가 기준 유사도를 초과하는 이미지를 포함하 는 적어도 하나의 콘텐트를 포함할 수 있다. 한 실시 예에 따르면, 프로세서는 카메라를 통해 획득한 이미지에서 객체의 부가 정보를 확인할 수 있다. 예를 들어, 프로세서의 부가 정보 검출 모듈은 카메라를 통해 획득한 이미지에 대한 문자 판독(예: optical character reader(OCR))을 통해 이미지에 포함된 텍스트를 검출할 수 있다. 부가 정보 검출 모듈은 이미지에서 검출한 텍스트의 크기(또는 텍스트 영역의 크기), 키워드 설정 조건 또는 텍스트의 위 치 중 적어도 하나에 기반하여 부가 정보로 사용할 텍스트를 검출할 수 있다. 예컨대, 키워드 설정 조건은 제거 텍스트 목록, 텍스트의 언어 구성, 텍스트의 유효 길이 또는 추가 텍스트 목록 중 적어도 하나를 포함할 수 있 다. 제거 텍스트 목록은 범용적으로 사용되는 적어도 하나의 단어를 포함할 수 있다. 추가 텍스트 목록은 고유 상품명을 포함할 수 있다. 예를 들어, 부가 정보 검출 모듈은 이미지에서 검출한 상표에 대응하는 텍스트 를 부가 정보로 검출할 수 있다. 예를 들어, 부가 정보 검출 모듈은 동의어 사전에서 부가 정보에 포함되 는 텍스트와 관련된 다른 텍스트를 검출할 수 있다. 부가 정보 검출 모듈은 동의어 사전에서 검출한 다른 텍스트를 객체의 부가 정보에 추가할 수도 있다. 예컨대, 동의어 사전은 \"삼성:samsung\"과 같이, 서로 다른 언 어 또는 서로 다른 형태로 표현되지만 동일한 의미를 갖는 단어의 매핑 정보를 포함할 수 있다. 동의어 사전은 메모리 또는 외부 장치(예: 서버)에 저장될 수 있다. 한 실시 예에 따르면, 프로세서는 이미지에 포함된 객체의 형상 정보에 대응하는 적어도 하나의 콘텐트를 객체의 부가 정보에 기반하여 정렬할 수 있다. 예를 들어, 프로세서의 정렬 모듈은 콘텐트 검색 모듈 에서 획득한 객체의 형상 정보에 대응하는 적어도 하나의 콘텐트에서 객체의 부가 정보에 대응하는 콘텐트 가 존재하는지 확인할 수 있다. 정렬 모듈은 객체의 부가 정보에 대응하는 콘텐트의 우선순위를 객체의 부가 정보에 대응하지 않는 다른 콘텐트의 우선순위보다 상대적으로 높게 갱신할 수 있다. 프로세서는 객체 의 형상에 대응하는 적어도 하나의 콘텐트를 객체의 부가 정보에 의한 정렬 순서에 기반하여 표시하도록 디스플 레이를 제어할 수 있다. 메모리는, 휘발성 및/또는 비휘발성 메모리를 포함할 수 있다. 메모리는, 예를 들면, 전자 장치(10 1)의 적어도 하나의 다른 구성요소에 관계된 명령 또는 데이터를 저장할 수 있다. 한 실시 예에 따르면, 메모리 는 객체의 부가 정보를 결정하는데 사용되는 키워드 설정 조건을 저장할 수 있다. 한 실시 예에 따르면, 메모리는 소프트웨어 및/또는 프로그램을 저장할 수 있다. 예를 들어, 프로그 램은 커널, 미들웨어, 어플리케이션 프로그래밍 인터페이스(API) 또는 어플리케이션 프로 그램(또는 \"어플리케이션\") 등을 포함할 수 있다. 커널, 미들웨어, 또는 API의 적어도 일 부는, 운영 시스템(OS)으로 지칭될 수 있다. 커널은, 예를 들면, 다른 프로그램들(예: 미들웨어, API, 또는 어플리케이션 프로그램)에 구현된 동작 또는 기능을 실행하는 데 사용되는 시스템 리소스들(예: 버스, 프로세서, 또는 메모리 등)을 제어 또는 관리할 수 있다. 또한, 커널은 미들웨어, API, 또는 어플리케이션 프로 그램에서 전자 장치의 개별 구성요소에 접근함으로써, 시스템 리소스들을 제어 또는 관리할 수 있는 인터페이스를 제공할 수 있다. 미들웨어는, 예를 들면, API 또는 어플리케이션 프로그램이 커널과 통신하여 데이터를 주 고받을 수 있도록 중개 역할을 수행할 수 있다. 또한, 미들웨어는 어플리케이션 프로그램으로부터 수 신된 하나 이상의 작업 요청들을 우선순위에 따라 처리할 수 있다. 예를 들면, 미들웨어는 어플리케이션 프로그램 중 적어도 하나에 전자 장치의 시스템 리소스(예: 버스, 프로세서, 또는 메모리 등)를 사용할 수 있는 우선순위를 부여하고, 하나 이상의 작업 요청들을 처리할 수 있다. API는 어 플리케이션 프로그램이 커널 또는 미들웨어에서 제공되는 기능을 제어하기 위한 인터페이스로, 예를 들면, 파일 제어, 창 제어, 영상 처리, 또는 문자 제어 등을 위한 적어도 하나의 인터페이스 또는 함수(예: 명령어)를 포함할 수 있다. 입출력 인터페이스는 사용자 또는 다른 외부 기기로부터 입력된 명령 또는 데이터를 전자 장치의 다 른 구성요소(들)에 전달하거나, 또는 전자 장치의 다른 구성요소(들)로부터 수신된 명령 또는 데이터를 사 용자 또는 다른 외부 기기로 출력할 수 있다. 예를 들어, 입출력 인터페이스는 홈 버튼, 전원 버튼 및 볼 륨 제어 버튼 등과 같은 적어도 하나의 물리적인 버튼을 포함할 수 있다. 예를 들어, 입출력 인터페이스는 오디오 신호를 출력하기 위한 스피커 및 오디오 신호를 수집하기 위한 마이크를 포함할 수 있다. 디스플레이는 사용자에게 각종 콘텐츠(예: 텍스트, 이미지, 비디오, 아이콘, 및/또는 심볼 등)을 표시할 수 있다. 예를 들어, 디스플레이는 액정 디스플레이(LCD), 발광 다이오드(LED) 디스플레이, 유기 발광 다 이오드(OLED) 디스플레이, 또는 마이크로 전자기계 시스템 (MEMS) 디스플레이, 또는 전자종이(electronic paper) 디스플레이를 포함할 수 있다. 예를 들어, 디스플레이는, 터치 스크린을 포함할 수 있다. 예컨대, 디스플레이는 전자 펜 또는 사용자의 신체의 일부를 이용한 터치, 제스쳐, 근접, 또는 호버링 입력을 수신 할 수 있다. 통신 인터페이스는 전자 장치와 외부 장치(예: 제 1 외부 전자 장치, 제 2 외부 전자 장치 , 또는 서버) 간의 통신을 설정할 수 있다. 예를 들면, 통신 인터페이스는 무선 통신 또는 유선 통신을 통해서 네트워크에 연결되어 외부 장치(예: 제 2 외부 전자 장치 또는 서버)와 통신할 수 있다. 한 실시 예에 따르면, 무선 통신은 LTE, LTE-A(LTE Advance), CDMA(code division multiple access), WCDMA(wideband CDMA), UMTS(universal mobile telecommunications system), WiBro(Wireless Broadband), 또 는 GSM(Global System for Mobile Communications) 등 중 적어도 하나를 사용하는 셀룰러 통신을 포함할 수 있 다. 한 실시 예에 따르면, 무선 통신은 WiFi(wireless fidelity), LiFi(light fidelity), 블루투스, 블루 투스 저전력(BLE), 지그비(Zigbee), NFC(near field communication), 자력 시큐어 트랜스미션(Magnetic Secure Transmission), 라디오 프리퀀시(RF), 또는 보디 에어리어 네트워크(BAN) 중 적어도 하나를 포함할 수 있다. 한 실시 예에 따르면, 무선 통신은 GNSS를 포함할 수 있다. 예를 들어, GNSS는 GPS(Global Positioning System), Glonass(Global Navigation Satellite System), Beidou(Beidou Navigation Satellite System) 또는 Galileo(the European global satellite-based navigation system)일 수 있다. 이하, 본 문서에서는, \"GPS\"는\"GNSS\"와 상호 호환적으로 사용될 수 있다. 한 실시 예에 따르면, 유선 통신은 USB(universal serial bus), HDMI(high definition multimedia interface), RS-232(recommended standard-232), 전력선 통신, 또는 POTS(plain old telephone service) 등 중 적어도 하나를 포함할 수 있다. 네트워크는 텔레커뮤니케이션 네트워크, 예를 들면, 컴퓨터 네트워크(예: LAN 또는 WAN), 인터넷, 또는 텔레폰 네트워크 중 적어도 하나를 포 함할 수 있다. 제 1 및 제 2 외부 전자 장치(102, 104) 각각은 전자 장치와 동일한 또는 다른 종류의 장치일 수 있다. 다 양한 실시 예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 다른 하나 또는 복수의 전자 장치(예: 전자 장치(102,104), 또는 서버에서 실행될 수 있다. 한 실시예에 따르면, 전자 장치가 어 떤 기능이나 서비스를 자동으로 또는 요청에 의하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 그와 연관된 적어도 일부 기능을 다른 장치(예: 전자 장치 (102, 104), 또는 서버)에게 요청할 수 있다. 다른 전자 장치(예: 전자 장치(102, 104), 또는 서버(10 6))는 요청된 기능 또는 추가 기능을 실행하고, 그 결과를 전자 장치로 전달할 수 있다. 전자 장치는 수신된 결과를 그대로 또는 추가적으로 처리하여 요청된 기능이나 서비스를 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 한 실시 예에 따르면, 서버는 전자 장치의 검색 서비스를 위한 적어도 하나의 저장 영역을 포함할 수 있다. 예를 들어, 서버는 도 1c와 같이, 객체의 형태 또는 용도별로 구분된 상의, 하의, 전자 제품 또는 패키지 등과 같은 다수 개의 저장 영역을 포함할 수 있다. 예컨대, 저장 영역은 검색 서비 스를 제공하기 위한 적어도 하나의 기준 이미지 및 기준 이미지에 대응되는 상품 정보를 포함할 수 있다. 예컨 대, 기준 이미지는 콘텐트(예: 상품)를 나타내기 위한 적어도 하나의 대표 이미지를 포함할 수 있다. 카메라는 피사체에 대한 이미지 정보를 수집하여 정지 영상(사진) 및 동영상을 촬영할 수 있다. 예를 들어, 카메라는 프로세서의 제어에 따라 피사체를 촬영할 수 있다. 카메라는 촬영된 데이터(예: 이미지)를 디스플레이 및 프로세서에 전달할 수 있다. 예컨대, 카메라는 적어도 하나의 이미지 센서, 렌즈, 이미지 신호 프로세서(ISP), 또는 플래시(예: LED 또는 xenon lamp 등) 중 적어도 하나를 포함할 수 있다. 예컨대, 이미지 센서는 CCD(charged coupled device) 또는 CMOS(complementary metal-oxide semiconductor)로 구현될 수 있다. 한 실시 예에 따르면, 카메라는 다수 개의 카메라를 포함할 수 있다. 예를 들어, 카메라는 전자 장치의 전면 또는 후면에 배치되는 다수 개의 카메라를 포함할 수 있다. 예를 들어, 카메라는 전자 장치의 후면에 배치되는 다수 개의 카메라를 포함할 수 있다. 본 발명의 다양한 실시 예에 따르면, 이미지에 포함된 객체에 대한 검색 서비스를 제공하기 위한 서버는 도 1a 의 전자 장치의 적어도 일부의 구성 요소를 포함할 수 있다. 예를 들어, 서버는 도 1a에 도시된 버스 , 프로세서, 메모리 및 통신 인터페이스를 포함할 수 있다. 이하 설명에서 도 1a에 기술된 버스, 프로세서, 메모리 및 통신 인터페이스와 동일한 기능은 생략한다. 한 실시 예에 따르면, 서버의 프로세서는 외부 장치(예: 다른 전자 장치)로부터 수신한 이미지에서 적어도 하나의 객체를 검출할 수 있다. 예를 들어, 프로세서의 검출 모듈은 통신인터페이스를 통해 수 신한 이미지의 특징점을 추출하여 적어도 하나의 객체를 검출할 수 있다. 일 예로, 객체 검출 모듈은 이미 지에 포함된 객체의 형상 정보를 검출할 수 있다. 한 실시 예에 따르면, 서버의 프로세서는 외부 장치(예: 다른 전자 장치)로부터 수신한 이미지에서 상표 정보를 검출할 수 있다. 한 실시 예에 따르면, 서버의 프로세서는 외부 장치(예: 다른 전자 장치)로부터 수신한 이미지에서 객체의 부가 정보를 확인할 수 있다. 예를 들어, 프로세서의 부가 정보 검출 모듈은 통신 인터페이스를 통해 수신한 이미지에 대한 문자 판독(예: OCR)을 통해 이미지에 포함된 텍스트를 검출할 수 있다. 한 실시 예에 따르면, 서버의 프로세서는 이미지에 포함된 객체의 형상 정보 및 부가 정보에 기반하여 정 렬한 적어도 하나의 콘텐트를 외부 장치(예: 다른 전자 장치)로 전송하도록 통신 인터페이스를 제어할 수 있다. 예를 들어, 프로세서의 정렬 모듈은 콘텐트 검색 모듈에서 획득한 객체의 형상 정보에 대 응하는 적어도 하나의 콘텐트의 우선순위를 객체의 부가 정보에 기반하여 갱신할 수 있다. 프로세서는 객 체의 부가 정보에 기반하여 갱신한 우선순위를 포함하는 객체의 형상에 대응하는 적어도 하나의 콘텐트를 외부 장치로 전송하도록 통신 인터페이스를 제어할 수 있다. 한 실시 예에 따르면, 외부 장치는 외부 장치의 디스플레이에 표시된 이미지를 서버로 전송할 수 있다. 예컨대, 디스플레이에 표시된 이미지는 카메라를 통해 획득한 프리뷰 이미지, 캡쳐 이미지, 외부 장치의 메모리에 저장 된 이미지 또는 다른 외부 장치로부터 수신한 이미지 중 적어도 하나를 포함할 수 있다. 한 실시 예에 따르면, 외부 장치는 이미지에 대응하는 적어도 하나의 콘텐트를 통신 인터페이스를 통해 서버로 부터 수신할 수 있다. 외부 장치는 이미지에 대응하는 적어도 하나의 콘텐트를 서버로부터 수신한 우선순위 정 보에 기반하여 디스플레이의 적어도 일부 영역에 표시할 수 있다. 예컨대, 이미지에 대응하는 적어도 하나의 콘 텐트는 이미지에 포함되는 객체의 형상에 대응하는 적어도 하나의 콘텐트를 포함할 수 있다. 우선순위 정보는 서버에서 객체의 부가 정보에 기반하여 설정한 객체의 형상에 대응하는 적어도 하나의 콘텐트의 표시 순서를 포 함할 수 있다. 도 2는 다양한 실시 예에 따른 전자 장치의 블록도를 도시하고 있다. 전자 장치는, 예를 들면, 도 1a 에 도시된 전자 장치의 전체 또는 일부를 포함할 수 있다. 전자 장치는 하나 이상의 프로세서(예: AP), 통신 모듈, 가입자 식별 모듈, 메모리, 센서 모듈, 입력 장치, 디스플레 이, 인터페이스, 오디오 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 인디케 이터, 및 모터를 포함할 수 있다. 프로세서는, 예를 들면, 운영 체제 또는 응용 프로그램을 구동하여 프로세서에 연결된 다수의 하드웨 어 또는 소프트웨어 구성요소들을 제어할 수 있고, 각종 데이터 처리 및 연산을 수행할 수 있다. 프로세서(21 0)는, 예를 들면, SoC(system on chip) 로 구현될 수 있다. 한 실시 예에 따르면, 프로세서는 GPU(graphic processing unit) 및/또는 이미지 신호 프로세서(ISP)를 더 포함할 수 있다. 프로세서는 도 2에 도시된 구성요소들 중 적어도 일부(예: 셀룰러 모듈)를 포함할 수도 있다. 프로세서 는 다른 구 성요소들(예: 비휘발성 메모리) 중 적어도 하나로부터 수신된 명령 또는 데이터를 휘발성 메모리에 로드하여 처 리하고, 결과 데이터를 비휘발성 메모리에 저장할 수 있다. 한 실시 예에 따르면, 프로세서는 이미지에서 검출한 객체에 대응하는 적어도 하나의 콘텐트를 표시하도록 디스플레이를 제어할 수 있다. 예를 들어, 프로세서는 객체의 형상 정보에 대응하는 적어도 하나의 콘텐트를 이미지에서 검출한 객체의 부가 정보에 기반하여 정렬할 수 있다. 프로세서는 객체의 부가 정보 에 기반하여 정렬된 적어도 하나의 콘텐트를 표시하도록 디스플레이를 제어할 수 있다. 예컨대, 이미지는, 카메라를 통해 획득한 프리뷰 이미지, 캡쳐 이미지, 메모리에 저장된 이미지 또는 외부 장치로부터 수신한 이미지 중 적어도 하나를 포함할 수 있다. 통신 모듈은 도 1a의 통신 인터페이스와 동일 또는 유사한 구성을 가질 수 있다. 통신 모듈은, 예를 들면, 셀룰러 모듈, WiFi 모듈, 블루투스 모듈, GNSS 모듈, NFC 모듈 및 RF 모 듈을 포함할 수 있다. 셀룰러 모듈은, 예를 들면, 통신망을 통해서 음성 통화, 영상 통화, 문자 서비스, 또는 인터넷 서비스 등 을 제공할 수 있다. 한 실시 예에 따르면, 셀룰러 모듈은 가입자 식별 모듈(예: SIM 카드)을 이용하 여 통신 네트워크 내에서 전자 장치의 구별 및 인증을 수행할 수 있다. 한 실시 예에 따르면, 셀룰러 모듈 은 프로세서가 제공할 수 있는 기능 중 적어도 일부 기능을 수행할 수 있다. 한 실시 예에 따르면, 셀룰러 모듈은 커뮤니케이션 프로세서(CP)를 포함할 수 있다. 어떤 실시 예에 따르면, 셀룰러 모듈, WiFi 모듈, 블루투스 모듈, GNSS 모듈 또는 NFC 모 듈 중 적어도 일부(예: 두 개 이상)는 하나의 integrated chip(IC) 또는 IC 패키지 내에 포함될 수 있다. RF 모듈은, 예를 들면, 통신 신호(예: RF 신호)를 송수신할 수 있다. RF 모듈은, 예를 들면, 트랜시 버, PAM(power amp module), 주파수 필터, LNA(low noise amplifier), 또는 안테나 등을 포함할 수 있다. 다른 실시 예에 따르면, 셀룰러 모듈, WiFi 모듈, 블루투스 모듈, GNSS 모듈 또는 NFC 모듈 중 적어도 하나는 별개의 RF 모듈을 통하여 RF 신호를 송수신할 수 있다. 가입자 식별 모듈은, 예를 들면, 가입자 식별 모듈을 포함하는 카드 또는 임베디드 SIM을 포함할 수 있으며, 고유한 식별 정보(예: ICCID(integrated circuit card identifier)) 또는 가입자 정보(예: IMSI(international mobile subscriber identity))를 포함할 수 있다. 메모리(예: 도 1a의 메모리)는, 예를 들면, 내장 메모리 또는 외장 메모리를 포함할 수 있 다. 내장 메모리는, 예를 들면, 휘발성 메모리(예: DRAM, SRAM, 또는 SDRAM 등), 비휘발성 메모리(예: OTPROM(one time programmable ROM), PROM, EPROM, EEPROM, mask ROM, flash ROM, 플래시 메모리, 하드 드라이 브, 또는 솔리드 스테이트 드라이브 (SSD) 중 적어도 하나를 포함할 수 있다. 외장 메모리는 플래시 드라이브(flash drive), 예를 들면, CF(compact flash), SD(secure digital), Micro-SD, Mini-SD, xD(extreme digital), MMC(multi-media card) 또는 메모리 스틱 등을 포함할 수 있다. 외장 메모리는 다양한 인터페 이스를 통하여 전자 장치와 기능적으로 또는 물리적으로 연결될 수 있다. 센서 모듈은, 예를 들면, 물리량을 계측하거나 전자 장치의 작동 상태를 감지하여, 계측 또는 감지된 정보를 전기 신호로 변환할 수 있다. 센서 모듈은, 예를 들면, 제스처 센서(240A), 자이로 센서(240B), 기 압 센서(240C), 마그네틱 센서(240D), 가속도 센서(240E), 그립 센서(240F), 근접 센서(240G), 컬러(color) 센 서(240H)(예: RGB(red, green, blue) 센서), 생체 센서(240I), 온/습도 센서(240J), 조도 센서(240K), 또는 UV(ultra violet) 센서(240M) 중의 적어도 하나를 포함할 수 있다. 추가적으로 또는 대체적으로, 센서 모듈 은, 예를 들면, 후각(e-nose) 센서, 일렉트로마이오그라피(EMG) 센서, 일렉트로엔씨팔로그램(EEG) 센서, 일렉트로카디오그램(ECG) 센서, IR(infrared) 센서, 홍채 센서 및/또는 지문 센서를 포함할 수 있다. 센서 모듈 은 그 안에 속한 적어도 하나 이상의 센서들을 제어하기 위한 제어 회로를 더 포함할 수 있다. 어떤 실시 예에서는, 전자 장치는 프로세서의 일부로서 또는 별도로, 센서 모듈을 제어하도록 구성된 프로 세서를 더 포함하여, 프로세서가 슬립(sleep) 상태에 있는 동안, 센서 모듈을 제어할 수 있다. 입력 장치는, 예를 들면, 터치 패널, (디지털) 펜 센서, 키, 또는 초음파 입력 장치(25 8)를 포함할 수 있다. 터치 패널은, 예를 들면, 정전식, 감압식, 적외선 방식, 또는 초음파 방식 중 적어 도 하나의 방식을 사용할 수 있다. 또한, 터치 패널은 제어 회로를 더 포함할 수도 있다. 터치 패널 은 택타일 레이어(tactile layer)를 더 포함하여, 사용자에게 촉각 반응(터치 좌표)을 제공할 수 있다. (디지털) 펜 센서는, 예를 들면, 터치 패널의 일부이거나, 별도의 인식용 쉬트를 포함할 수 있다. 키(25 6)는, 예를 들면, 물리적인 버튼, 광학식 키, 또는 키패드를 포함할 수 있다. 초음파 입력 장치는 마이크 (예: 마이크)를 통해, 입력 도구에서 발생된 초음파를 감지하여, 감지한 초음파에 대응하는 데이터를 확인 할 수 있다. 디스플레이는 패널, 홀로그램 장치, 프로젝터, 및/또는 이들을 제어하기 위한 제어 회로를 포함할 수 있다. 패널은, 예를 들면, 유연하게, 투명하게, 또는 착용할 수 있게 구현될 수 있다. 패널 은 터치 패널과 하나 이상의 모듈로 구성될 수 있다. 한 실시 예에 따르면, 패널은 사용자의 터 치에 대한 압력 정보(예: 압력 좌표 및 압력 세기)를 측정할 수 있는 압력 센서(또는 포스 센서)를 포함할 수 있다. 압력 센서는 터치 패널과 일체형으로 구현되거나, 또는 터치 패널과는 별도의 하나 이상의 센 서로 구현될 수 있다. 홀로그램 장치는 빛의 간섭을 이용하여 입체 영상을 허공에 보여줄 수 있다. 프로젝 터는 스크린에 빛을 투사하여 영상을 표시할 수 있다. 스크린은, 예를 들면, 전자 장치의 내부 또는 외부에 위치할 수 있다. 인터페이스는, 예를 들면, HDMI, USB, 광 인터페이스(optical interface), 또는 D-sub(D-subminiature)를 포함할 수 있다. 인터페이스는, 예를 들면, 도 1a 에 도시된 통신 인터페이스에 포함될 수 있다. 추가적으로 또는 대체적으로, 인터페이스는, 예를 들 면, MHL(mobile high-definition link) 인터페이스, SD카드/MMC(multi-media card) 인터페이스, 또는 IrDA(infrared data association) 규격 인터페이스를 포함할 수 있다. 오디오 모듈은, 예를 들면, 소리와 전기 신호를 쌍방향으로 변환시킬 수 있다. 오디오 모듈의 적어도 일부 구성요소는, 예를 들면, 도 1a에 도시된 입출력 인터페이스에 포함될 수 있다. 오디오 모듈은, 예를 들면, 스피커, 리시버, 이어폰, 또는 마이크 등을 통해 입력 또는 출력되는 소리 정 보를 처리할 수 있다. 카메라 모듈(예: 도 1a의 카메라)은, 예를 들면, 정지 영상 및 동영상을 촬영 할 수 있는 장치로서, 한 실시 예에 따르면, 하나 이상의 이미지 센서(예: 전면 센서 또는 후면 센서), 렌즈, 이미지 신호 프로세서(ISP), 또는 플래시(예: LED 또는 xenon lamp 등)를 포함할 수 있다. 전력 관리 모듈(29 5)은, 예를 들면, 전자 장치의 전력을 관리할 수 있다. 한 실시 예에 따르면, 전력 관리 모듈은 PMIC(power management integrated circuit), 충전 IC, 또는 배터리 또는 연료 게이지를 포함할 수 있다. PMIC 는, 유선 및/또는 무선 충전 방식을 가질 수 있다. 무선 충전 방식은, 예를 들면, 자기공명 방식, 자기유도 방 식 또는 전자기파 방식 등을 포함하며, 무선 충전을 위한 부가적인 회로, 예를 들면, 코일 루프, 공진 회로, 또 는 정류기 등을 더 포함할 수 있다. 배터리 게이지는, 예를 들면, 배터리의 잔량, 충전 중 전압, 전류, 또 는 온도를 측정할 수 있다. 배터리는, 예를 들면, 충전식 전지 및/또는 태양 전지를 포함할 수 있다. 인디케이터는 전자 장치 또는 그 일부(예: 프로세서)의 특정 상태, 예를 들면, 부팅 상태, 메시 지 상태 또는 충전 상태 등을 표시할 수 있다. 모터는 전기적 신호를 기계적 진동으로 변환할 수 있고, 진 동, 또는 햅틱 효과 등을 발생시킬 수 있다. 전자 장치는, 예를 들면, DMB(digital multimediabroadcasting), DVB(digital video broadcasting), 또는 미디어플로(mediaFloTM) 등의 규격에 따른 미디어 데이 터를 처리할 수 있는 모바일 TV 지원 장치(예: GPU)를 포함할 수 있다. 본 문서에서 기술된 구성요소들 각각은 하나 또는 그 이상의 부품(component)으로 구성될 수 있으며, 해당 구성요소의 명칭은 전자 장치의 종류에 따라 서 달라질 수 있다. 다양한 실시 예에서, 전자 장치(예: 전자 장치)는 일부 구성요소가 생략되거나, 추가 적인 구성요소를 더 포함하거나, 또는, 구성요소들 중 일부가 결합되어 하나의 개체로 구성되되, 결합 이전의 해당 구성요소들의 기능을 동일하게 수행할 수 있다. 도 3은 다양한 실시 예에 따른 프로그램 모듈의 블록도를 도시하고 있다. 한 실시 예에 따르면, 프로그램 모듈 (예: 도 1a의 프로그램)은 전자 장치(예: 도 1a의 전자 장치)에 관련된 자원을 제어하는 운영 체제 및/또는 운영 체제 상에서 구동되는 다양한 어플리케이션(예: 도 1a의 어플리케이션 프로그램)을 포 함할 수 있다. 운영 체제는, 예를 들면, AndroidTM, iOSTM, WindowsTM, SymbianTM, TizenTM, 또는 BadaTM를 포함할 수 있다. 도 3을 참조하면, 프로그램 모듈은 커널(예: 도 1a의 커널), 미들웨어(예: 도 1a의 미들웨 어), (API(예: 도 1a의 API), 및/또는 어플리케이션(예: 도 1a의 어플리케이션 프로그램 )을 포함할 수 있다. 프로그램 모듈의 적어도 일부는 전자 장치상에 프리로드 되거나, 외부 전자 장 치(예: 도 1a의 전자 장치(102, 104), 서버 등)로부터 다운로드 가능하다. 커널은, 예를 들면, 시스템 리소스 매니저 및/또는 디바이스 드라이버를 포함할 수 있다. 시스 템 리소스 매니저는 시스템 리소스의 제어, 할당, 또는 회수를 수행할 수 있다. 한 실시 예에 따르면, 시 스템 리소스 매니저는 프로세스 관리부, 메모리 관리부, 또는 파일 시스템 관리부를 포함할 수 있다. 디바 이스 드라이버는, 예를 들면, 디스플레이 드라이버, 카메라 드라이버, 블루투스 드라이버, 공유 메모리 드 라이버, USB 드라이버, 키패드 드라이버, WiFi 드라이버, 오디오 드라이버, 터치 디바이스 드라이버, 압력 디바 이스 드라이버 또는 IPC(inter-process communication) 드라이버를 포함할 수 있다. 미들웨어는, 예를 들면, 어플리케이션이 공통적으로 필요로 하는 기능을 제공하거나, 어플리케이션 이 전자 장치 내부의 제한된 시스템 자원을 사용할 수 있도록 API를 통해 다양한 기능들을 어플리케 이션으로 제공할 수 있다. 한 실시 예에 따르면, 미들웨어는 런타임 라이브러리, 어플리케이션 매니저, 윈도우 매니저, 멀티미디어 매니저, 리소스 매니저, 파워 매니저, 데이터베 이스 매니저, 패키지 매니저, 커넥티비티 매니저, 노티피케이션 매니저, 로케이션 매니저 , 그래픽 매니저, 또는 시큐리티 매니저 중 적어도 하나를 포함할 수 있다. 런타임 라이브러리는, 예를 들면, 어플리케이션이 실행되는 동안에 프로그래밍 언어를 통해 새로운 기능을 추가하기 위해 컴파일러가 사용하는 라이브러리 모듈을 포함할 수 있다. 런타임 라이브러리는 입출 력 관리, 메모리 관리, 또는 산술 함수 처리를 수행할 수 있다. 어플리케이션 매니저는, 예를 들면, 어플 리케이션의 생명 주기를 관리할 수 있다. 윈도우 매니저는 화면에서 사용되는 GUI 자원을 관리할 수 있다. 멀티미디어 매니저는 미디어 파일들의 재생에 필요한 포맷을 파악하고, 해당 포맷에 맞는 코덱을 이 용하여 미디어 파일의 인코딩 또는 디코딩을 수행할 수 있다. 리소스 매니저는 어플리케이션의 소스 코드 또는 메모리의 공간을 관리할 수 있다. 파워 매니저는, 예를 들면, 배터리의 용량 또는 전원을 관리 하고, 전자 장치의 동작에 필요한 전력 정보를 제공할 수 있다. 한 실시 예에 따르면, 파워 매니저는 바이 오스(BIOS: basic input/output system)와 연동할 수 있다. 데이터베이스 매니저는, 예를 들면, 어플리케 이션에서 사용될 데이터베이스를 생성, 검색, 또는 변경할 수 있다. 패키지 매니저는 패키지 파일의 형태로 배포되는 어플리케이션의 설치 또는 갱신을 관리할 수 있다. 커넥티비티 매니저는, 예를 들면, 무선 연결을 관리할 수 있다. 노티피케이션 매니저는, 예를 들면, 도착 메시지, 약속, 근접성 알림 등의 이벤트를 사용자에게 제공할 수 있다. 로케이션 매니저는, 예를 들 면, 전자 장치의 위치 정보를 관리할 수 있다. 그래픽 매니저는, 예를 들면, 사용자에게 제공될 그래픽 효 과 또는 이와 관련된 사용자 인터페이스를 관리할 수 있다. 보안 매니저는, 예를 들면, 시스템 보안 또는 사용자 인증을 제공할 수 있다. 한 실시 예에 따르면, 미들 웨어는 전자 장치의 음성 또는 영상 통화 기능을 관리하기 위한 통화(telephony) 매니저 또는 전술된 구성 요소들의 기능들의 조합을 형성할 수 있는 하는 미들웨어 모듈을 포함할 수 있다. 한 실시 예에 따르면, 미들웨 어는 운영 체제의 종류별로 특화된 모듈을 제공할 수 있다. 미들웨어는 동적으로 기존의 구성요소를 일부 삭제하거나 새로운 구성요소들을 추가할 수 있다. API는, 예를 들면, API 프로그래밍 함수들의 집합으로, 운영 체제에 따라 다른 구성으로 제공될 수 있다. 예를 들면, 안드로이드 또는 iOS의 경우, 플랫폼 별로 하나의 API 셋을 제공할 수 있으며, 타이젠의 경우, 플랫폼 별로 두 개 이상의 API 셋을 제공할 수 있다. 어플리케이션은, 예를 들면, 홈, 다이얼러, SMS/MMS, IM(instant message), 브라우 저, 카메라, 알람, 컨택트, 음성 다이얼, 이메일, 달력, 미디어 플레이어 , 앨범, 와치, 헬스 케어(예: 운동량 또는 혈당 등을 측정), 또는 환경 정보(예: 기압, 습도, 또는 온도 정보) 제공 어플리케이션을 포함할 수 있다. 한 실시 예에 따르면, 어플리케이션은 전자 장치와 외부 전자 장치 사이의 정보 교환을 지원할 수 있는 정보 교환 어플리케이션을 포함할 수 있다. 정보 교환 어플 리케이션은, 예를 들면, 외부 전자 장치에 특정 정보를 전달하기 위한 노티피케이션 릴레이 어플리케이션, 또는 외부 전자 장치를 관리하기 위한 장치 관리 어플리케이션을 포함할 수 있다. 예를 들면, 알림 전달 어플리케이 션은 전자 장치의 다른 어플리케이션에서 발생된 알림 정보를 외부 전자 장치로 전달하거나, 또는 외부 전자 장 치로부터 알림 정보를 수신하여 사용자에게 제공할 수 있다. 장치 관리 어플리케이션은, 예를 들면, 전자 장치 와 통신하는 외부 전자 장치의 기능(예: 외부 전자 장치 자체(또는, 일부 구성 부품)의 턴-온/턴-오프 또는 디 스플레이의 밝기(또는, 해상도) 조절), 또는 외부 전자 장치에서 동작하는 어플리케이션을 설치, 삭제, 또는 갱 신할 수 있다. 한 실시 예에 따르면, 어플리케이션은 외부 전자 장치의 속성에 따라 지정된 어플리케이션 (예: 모바일 의료 기기의 건강 관리 어플리케이션)을 포함할 수 있다. 한 실시 예에 따르면, 어플리케이션(37 0)은 외부 전자 장치로부터 수신된 어플리케이션을 포함할 수 있다. 프로그램 모듈의 적어도 일부는 소프 트웨어, 펌웨어, 하드웨어(예: 프로세서), 또는 이들 중 적어도 둘 이상의 조합으로 구현(예: 실행)될 수 있으며, 하나 이상의 기능을 수행하기 위한 모듈, 프로그램, 루틴, 명령어 세트 또는 프로세스를 포함할 수 있 다. 본 발명이 다양한 실시 예에 따르면, 전자 장치는, 카메라, 디스플레이, 적어도 하나의 프로세서, 및 상기 적어 도 하나의 프로세서와 전기적으로 연결된 메모리를 포함하며, 상기 메모리는, 실행될 때 상기 적어도 하나의 프 로세서로 하여금, 상기 카메라를 통해 객체를 포함하는 이미지를 획득하고, 상기 이미지 중 상기 객체에 대응하 는 제 1 영역을 통해 상기 객체의 형상과 관련된 제 1 정보를 확인하고, 상기 이미지 중 제 2 영역을 통해 상기 객체의 부가 정보와 관련된 제 2 정보를 확인하고, 상기 제 1 정보 및 상기 제 2 정보에 적어도 기반하여, 외부 장치로부터 획득한 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트를 상기 디스플레이를 통해 제공하는 인스 트럭션들을 저장할 수 있다. 다양한 실시 예에 따르면, 상기 외부 장치는, 복수의 저장 영역 포함하고, 상기 인스트럭션들은, 상기 적어도 하나의 프로세서로 하여금, 상기 복수의 저장 영역 중 상기 객체의 형상 정보 또는 상표 정보 중 적어도 하나에 대응하는 적어도 하나의 저장 영역으로부터 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트를 획득하도록 하 는 인스트럭션들을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 인스트럭션들은, 상기 적어도 하나의 프로세서로 하여금, 상기 외부 장치로부터 상기 제 1 정보에 대응하는 적어도 하나의 상품의 식별 정보를 획득하고, 다른 외부 장치로부터 상기 적어도 하 나의 상품의 식별 정보에 대응하는 상세 정보를 상기 적어도 하나의 콘텐트의 적어도 일부로 획득하도록 하는 인스트럭션들을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 인스트럭션들은, 상기 적어도 하나의 프로세서로 하여금, 상기 이미지에서 추출 한 텍스트, 상기 이미지에서 추출한 상표에 대응하는 텍스트 또는 상기 객체의 형상에 대응하는 텍스트 중 적어 도 하나에 기반하여 상기 제 2 정보를 검출하는 인스트럭션들을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 인스트럭션들은, 상기 적어도 하나의 프로세서로 하여금, 상기 이미지에서 추출 한 단어의 크기, 단어의 표시 위치, 단어를 구성하는 문자의 개수, 단어를 포함되는 언어의 개수, 제거 단어 목 록 또는 단어 사이의 거리 중 적어도 하나에 기반하여 상기 이미지에서 추출한 텍스트의 적어도 일부를 상기 제 2 정보로 설정하는 인스트럭션들을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 인스트럭션들은, 상기 적어도 하나의 프로세서로 하여금, 상기 적어도 하나의 콘텐트가 상기 제 1 정보 및 상기 제 2 정보와 연관된 정도에 기반하여, 상기 적어도 하나의 콘텐트를 상기 디 스플레이를 통해 제공하는 인스트럭션들을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 인스트럭션들은, 상기 적어도 하나의 프로세서로 하여금, 상기 적어도 하나의 콘텐트와 상기 제 1 정보의 유사도에 기반하여 상기 적어도 하나의 콘텐트의 우선순위를 설정하고, 상기 적어도 하나의 콘텐트 중 상기 제 2 정보에 대응하는 콘텐트의 우선순위를 갱신하고, 상기 갱신된 우선순위에 기반하여상기 적어도 하나의 콘텐트를 상기 디스플레이를 통해 표시하는 인스트럭션들을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 인스트럭션들은, 상기 적어도 하나의 프로세서로 하여금, 상기 제 1 정보에 대 응하는 적어도 하나의 콘텐트 중 상기 제 2 정보에 대응하는 콘텐트가 존재하는지 확인하고, 상기 제 2 정보에 대응하는 콘텐트가 존재하지 않는 경우, 다른 외부 장치로부터 상기 제 2 정보의 적어도 일부에 대응하는 적어 도 하나의 다른 콘텐트를 획득하고, 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트와 상기 적어도 하나의 다 른 콘텐트를 상기 디스플레이를 통해 표시하는 인스트럭션들을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 인스트럭션들은, 상기 적어도 하나의 프로세서로 하여금, 상기 디스플레이의 제 1 영역을 통해 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트를 표시하고, 상기 디스플레이의 제 2 영역을 통해 상기 적어도 하나의 다른 콘텐트를 표시하는 인스트럭션들을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 인스트럭션들은, 상기 적어도 하나의 프로세서로 하여금, 상기 제 1 정보에 대 응하는 적어도 하나의 콘텐트와 상기 적어도 하나의 다른 콘텐트 중 중복되는 콘텐트를 검출하고, 상기 제 1 정 보에 대응하는 적어도 하나의 콘텐트 중 상기 중복되는 콘텐트의 우선순위를 갱신하고, 상기 갱신된 우선순위에 기반하여 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트를 상기 디스플레이를 통해 표시하는 인스트럭션들을 포함할 수 있다. 본 발명의 다양한 실시 예에 따르면, 전자 장치(예: 서버 장치)는, 통신 인터페이스, 복수 개의 저장 영역을 포 함하는 메모리, 및 상기 메모리와 전기적으로 연결된 적어도 하나의 프로세서를 포함하며, 상기 메모리는, 실행 될 때 상기 적어도 하나의 프로세서로 하여금, 상기 통신 인터페이스를 통해, 외부 장치로부터 이미지를 수신하 고, 상기 이미지 중 상기 객체에 대응하는 제 1 영역을 통해 상기 객체의 형상과 관련된 제 1 정보를 확인하고, 상기 이미지 중 제 2 영역을 통해 상기 객체의 부가 정보와 관련된 제 2 정보를 확인하고, 상기 제 1 정보 및 상기 제 2 정보에 적어도 기반하여, 상기 복수의 콘텐트 중 제 1 정보에 대응하는 적어도 하나의 콘텐트를 선택 하고, 상기 선택된 제 1 정보에 대응하는 적어도 하나의 콘텐트를 상기 통신 인터페이스를 통해 상기 외부 장치 로 전송하는 인스트럭션들을 저장할 수 있다. 다양한 실시 예에 따르면, 상기 인스트럭션들은, 상기 적어도 하나의 프로세서로 하여금, 상기 제 1 정보 및 상 기 제 2 정보에 적어도 기반하여, 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트를 정렬하고, 상기 정렬된 제 1 정보에 대응하는 적어도 하나의 콘텐트를 상기 통신 인터페이스를 통해 상기 외부 장치로 전송하는 인스트 럭션들을 포함할 수 있다. 본 발명의 다양한 실시 예에 따르면, 전자 장치(예: 서버 장치)는, 통신 인터페이스, 복수개의 콘텐트들을 저장 하기 위한 메모리, 및 상기 메모리와 전기적으로 연결된 적어도 하나의 프로세서를 포함하며, 상기 메모리는, 실행될 때 상기 적어도 하나의 프로세서로 하여금, 상기 통신 인터페이스를 통해, 외부 장치로부터 이미지를 수 신하고, 상기 이미지 중 상기 객체에 대응하는 제 1 영역을 통해 상기 객체의 형상과 관련된 제 1 정보를 확인 하고, 상기 이미지 중 제 2 영역을 통해 상기 객체의 부가 정보와 관련된 제 2 정보를 확인하고, 상기 제 1 정 보 및 상기 제 2 정보에 적어도 기반하여, 상기 복수개의 콘텐트들 중 상기 제 1 정보에 대응하는 적어도 하나 의 콘텐트를 정렬하고, 상기 정렬된 제 1 정보에 대응하는 적어도 하나의 콘텐트를 상기 통신 인터페이스를 통 해 상기 외부 장치로 전송하는 인스트럭션들을 저장할 수 있다. 다양한 실시 예에 따르면, 상기 메모리는, 복수의 저장 영역 포함하고, 상기 인스트럭션들은, 상기 적어도 하나 의 프로세서로 하여금, 상기 복수의 저장 영역 중 상기 객체의 형상 정보 또는 상표 정보 중 적어도 하나에 대 응하는 적어도 하나의 저장 영역으로부터 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트를 획득하도록 하는 인스트럭션들을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 인스트럭션들은, 상기 적어도 하나의 프로세서로 하여금, 상기 이미지에서 추출 한 텍스트, 상기 이미지에서 추출한 상표에 대응하는 텍스트 또는 상기 객체의 형상에 대응하는 텍스트 중 적어 도 하나에 기반하여 상기 제 2 정보를 검출하는 인스트럭션들을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 인스트럭션들은, 상기 적어도 하나의 프로세서로 하여금, 상기 이미지에서 추출 한 단어의 크기, 단어의 표시 위치, 단어를 구성하는 문자의 개수, 단어를 포함되는 언어의 개수, 제거 단어 목 록 또는 단어 사이의 거리 중 적어도 하나에 기반하여 상기 이미지에서 추출한 텍스트의 적어도 일부를 상기 제 2 정보로 설정하는 인스트럭션들을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 인스트럭션들은, 상기 적어도 하나의 프로세서로 하여금, 상기 적어도 하나의 콘텐트와 상기 제 1 정보의 유사도에 기반하여 상기 적어도 하나의 콘텐트의 우선순위를 설정하고, 상기 적어도하나의 콘텐트 중 상기 제 2 정보에 대응하는 콘텐트의 우선순위를 갱신하고, 상기 갱신된 우선순위에 기반하여 상기 적어도 하나의 콘텐트를 정렬하는 인스트럭션들을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 인스트럭션들은, 상기 적어도 하나의 프로세서로 하여금, 상기 제 1 정보에 대 응하는 적어도 하나의 콘텐트 중 상기 제 2 정보에 대응하는 콘텐트가 존재하는지 확인하고, 상기 제 2 정보에 대응하는 콘텐트가 존재하지 않는 경우, 다른 외부 장치로부터 상기 제 2 정보의 적어도 일부에 대응하는 적어 도 하나의 다른 콘텐트를 획득하고, 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트와 상기 상기 제 2 정보의 적어도 일부에 대응하는 적어도 하나의 다른 콘텐트 중 중복되는 콘텐트를 검출하고, 상기 제 1 정보에 대응하 는 적어도 하나의 콘텐트 중 상기 중복되는 콘텐트의 우선순위를 갱신하고, 상기 갱신된 우선순위에 기반하여 상기 적어도 하나의 콘텐트를 정렬하는 인스트럭션들을 포함할 수 있다. 도 4는 본 발명의 다양한 실시 예에 따른 전자 장치에서 객체에 대응하는 콘텐트를 표시하기 위한 흐름도를 도 시하고 있다. 도 5a 내지 도 5e는 본 발명의 다양한 실시 예에 따른 전자 장치에서 객체의 부가 정보를 확인하 기 위한 구성을 도시하고 있다. 이하 설명에서 전자 장치는 도 1a의 전자 장치 또는 전자 장치의 적 어도 일부(예: 프로세서)를 포함할 수 있다. 도 4를 참조하면, 전자 장치(예: 프로세서)는 동작 401에서, 검색 서비스를 제공하기 위한 이미지를 획득 할 수 있다. 예컨대, 이미지는 카메라를 통해 획득한 프리뷰 이미지, 캡쳐 이미지, 메모리에 저장된 이미지 또는 외부 장치로부터 수신한 이미지 중 적어도 하나를 포함할 수 있다. 전자 장치(예: 객체 검출 모듈)는 동작 403에서, 이미지의 적어도 일부인 제 1 영역에서 적어도 하나의 객 체의 형상 정보를 확인할 수 있다. 예를 들어, 프로세서(예: 객체 검출 모듈)는 카메라를 통해 획득한 이미지를 분석하여 특징점(feature point)을 추출할 수 있다. 프로세서는 이미지에서 추출한 특징 점에 기반하여 적어도 하나의 객체를 검출할 수 있다. 전자 장치(예: 부가 정보 검출 모듈)는 동작 405에서, 이미지의 적어도 일부인 제 2 영역에서 객체의 부가 정보를 확인할 수 있다. 예를 들어, 프로세서 (예: 부가 정보 검출 모듈)는 도 5a와 같이, 카메라 를 통해 획득한 이미지에 대한 문자 판독을 통해, 단어 1 내지 단어 8을 검출할 수 있다. 예컨대, 문자 판독 결과는 하기 표 1과 같은 형태로 이미지에서 검출한 텍스트 및 해당 텍스트의 위치 정보를 포함할 수 있다. 표 1 \"description\": \"단어 1\", \"boundingPoly\":{ \"vertices\":[ { \"x\": 61, \"y\": 132 }, { \"x\": 81, \"y\": 130 }, { \"x\": 83, \"y\": 150 }, { \"x\": 63, \"y\": 152 } ] } \"description\": \"단어 2\", \"boundingPoly\":{ \"vertices\":[ { \"x\": 85, \"y\": 172 }, { \"x\": 129, \"y\": 180 }, { \"x\": 123, \"y\": 218 }, { \"x\": 78, \"y\": 210 } ] }\"description\": \"단어 3\", \"boundingPoly\":{ \"vertices\":[ { \"x\": 141, \"y\": 199 }, { \"x\": 154 \"y\": 201 }, { \"x\": 150, \"y\": 221 }, { \"x\": 138. \"y\": 219 } ] }표 1에서, x 및 y는 문자 판독을 통해 추출한 텍스트의 사각 형태의 영역을 나타내기 위한 꼭지점의 좌표를 포 함할 수 있다. 예를 들어, 프로세서(예: 부가 정보 검출 모듈)는 이미지에서 검출한 단어들(502 내지 516) 중 적어 도 하나를 객체의 부가 정보로 인식할 수 있다. 일 예로, 프로세서는 텍스트의 크기(예: 세로길이)에 기반 하여 이미지에 추출한 단어들(502 내지 516)을 정렬할 수 있다. 프로세서는 도 5b와 같이, 단어들(502 내 지 516)의 정렬 순서에 기반하여 크기가 가장 큰 단어 1부터 순차적으로 기준 개수(예: 4개)의 단어들(502 내지 508)을 객체의 부가 정보로 선택할 수 있다. 일 예로, 프로세서는 도 5c와 같이, 이미지에서 검출한 단어들(502 내지 516) 중 제거 텍스트 목록에 포함되는 단어들(508, 510, 512, 516)을 제거할 수 있다. 제거되 지 않은 나머지 단어들(502, 504, 506 및 514)은 부가 정보에 포함되는 단어로 선택될 수 있다. 제거 텍스트 목 록은 \"미리\", \"축제\", \"대축제\", \"장만\", \"무료\", \"배송\", \"경품\", \"상품\", \"일시적\", \"품절\", \"만원\" 및 \"증 정\" 등과 같이 객체의 식별에 필요하지 않다고 판단되는 적어도 하나의 단어를 포함할 수 있다. 일 예로, 프로 세서는 도 5d와 같이. 텍스트의 위치에 기반하여 이미지에 추출한 단어들(502 내지 516)을 정렬할 수 있다. 프로세서는 단어들(502 내지 516)의 정렬 순서에 기반하여 이미지의 기준 지점에서 가장 가까운 단 어 2부터 순차적으로 기준 개수(예: 4개)의 단어들(502, 504, 506, 508)을 객체의 부가 정보로 선택할 수 있다. 예컨대, 기준 지점은 이미지의 중심, 하단, 상단, 좌측 또는 우측과 같이, 단어의 거리를 측정하는데 기 준이 되는 지점을 포함할 수 있다. 예컨대, 프로세서는 이미지의 중심을 기준으로 동일 거리에 다수 개의 단어(예: 단어 2 및 단어 5)가 존재하는 경우, 단어의 크기가 상대적으로 더 큰 단어(예: 단어 2)를 선택할 수 있다. 일 예로, 프로세서는 단어를 구성하는 언어의 개수가 기준 개수 (예: 2개) 이 상인 경우, 해당 단어를 부가 정보에서 제외시킬 단어로 판단할 수 있다. 일 예로, 프로세서는 단어를 구 성하는 문자의 길이가 기준 길이보다 짧은 경우, 해당 단어를 부가 정보에서 제외시킬 단어로 판단할 수 있다. 일 예로, 프로세서는 객체의 부가 정보로 선택한 단어들 사이의 거리를 확인할 수 있다. 프로세서는 도 5e와 같이, 두 단어(단어 11) 및 단어 12) 사이의 거리가 기준 거리 이내인 경우, 두 단어를 하나 의 단어로 합성할 수 있다. 프로세서는 합성된 단어의 우선순위를 상대적으로 높게 갱신할 수 있다. 예를 들어, 프로세서는 이미지에서 검출한 상표 또는 객체의 형상 정보에 대응하는 텍스트를 객체의 부가 정보로 인식할 수 있다. 예를 들어, 프로세서는 동의어 사전에 부가 정보에 포함되는 단어(예: 삼성)와 관 련된 다른 단어(예: samsung)가 존재하는지 확인할 수 있다. 프로세서는 동의서 사전에서 검출한 다른 단 어를 객체의 부가 정보에 추가할 수 있다. 한 실시 예에 따르면, 전자 장치는 동작 403 및 동작 405를 동시에 수행하거나 동작 순서를 변경할 수 있다. 전자 장치(예: 프로세서)는 동작 407에서, 객체의 형상 정보 및 부가 정보에 기반하여 객체의 형상에 대응 하는 적어도 하나의 콘텐트를 표시할 수 있다. 예를 들어, 프로세서는 객체의 형상 정보 또는 이미지에 포 함된 상표 정보 중 적어도 하나에 기반하여 검색 영역(예: 저장 영역)을 선택할 수 있다. 프로세서는 선택 한 검색 영역을 통해, 객체의 형상 정보에 대응하는 적어도 하나의 콘텐트를 검출할 수 있다. 프로세서는 객체의 형상 정보에 대응하는 적어도 하나의 콘텐트를 객체의 부가 정보에 기반하여 정렬할 수 있다. 프로세서 는 객체의 부가 정보에 기반하여 정렬된 순서에 대응하도록 객체의 형상 정보에 대응하는 적어도 하나의 콘텐트를 표시하도록 디스플레이를 제어할 수 있다. 예컨대, 검색 영역에서 검출한 객체의 형상 정보에 대 응하는 적어도 하나의 콘텐트는 하기 표 2와 같은, 상세 정보를 포함할 수 있다. 프로세서는 각 콘텐트의 상세 정보에서 객체의 부가 정보에 포함되는 단어가 포함되는지 확인할 수 있다. 프로세서는 객체의 부가 정보의 단어를 포함하는 콘텐트의 우선순위를 상대적으로 높게 설정할 수 있다. 프로세서는 객체의 형상 정보에 대응하는 적어도 하나의 콘텐트의 우선순위에 기반하여 적어도 하나의 콘텐트를 정렬할 수 있다.표 2 <<<mapid>>>77777777 <<<pname>>>삼성정품 스탠드형 급속 무선충전기(EP-NG930B) <<<price>>>47000 <<<coupo>>>0 <<<dlvcd>>>02 <<<deliv>>>2500 <<<pgurl>>>http://www.samsungmall.co.kr/connect/Gateway.tmall?method=Xsite&prdNo=1563333717&t id= <<<igurl>>>http://i. samsungmall.com/t/300/an/3/3/3/7/1/7/1563333717_B.jpg <<<cate1>>>휴대폰 <<<cate2>>>휴대폰 충전기 <<<cate3>>>무선충전기 <<<cate4>>> <<<caid1>>>1001429 <<<caid2>>>1002726 <<<caid3>>>1009568 <<<caid4>>> <<<model>>>정품 급속 무선충전 스탠드 EP-NG930B <<<brand>>>삼성전자 <<<maker>>>삼성 <<<event>>> <<<pcard>>>**은행12/워드12/비디12/우량2/하루12/K6/N6/삼성6/ <<<utime>>>2017/04/10 15:57:30 <<<cardn>>> <<<cardp>>> 본 발명의 다양한 실시 예에 따르면, 전자 장치는 외부 장치(예: 서버)를 통해 객체의 형상에 대응하는 적 어도 하나의 콘텐트를 검색할 수 있다. 예를 들어, 프로세서는 객체의 형상 정보 또는 이미지에 포함된 상 표 정보 중 적어도 하나에 기반하여 외부 장치를 선택할 수 있다. 프로세서는 객체의 형상 정보에 대응하 는 검색 요청 신호를 외부 장치로 전송하도록 통신 인터페이스를 제어할 수 있다. 프로세서는 검색 요청 신호에 대응하는 응답으로 객체의 형상 정보에 대응하는 적어도 하나의 콘텐트를 외부 장치로부터 수신할 수 있다. 예컨대, 외부 장치는 외부 장치에 포함되는 특정 저장 영역(데이터 베이스)를 포함할 수 있다. 한 실시 예에 따르면, 이미지에서 객체의 형상 정보를 검출하기 위한 영역과 부가 정보를 검출하기 위한 영역을 동일하거나 상이할 수 있다. 도 6은 본 발명의 다양한 실시 예에 따른 전자 장치에서 객체에 대응하는 콘텐트의 표시 순서를 설정하기 위한 흐름도를 도시하고 있다. 도 7a 내지 도 7b는 본 발명의 다양한 실시 예에 따른 전자 장치에서 객체에 대응하는 콘텐트를 표시하기 위한 화면 구성의 일 예를 도시하고 있다. 도 8a 내지 도 8b는 본 발명의 다양한 실시 예에 따른 전자 장치에서 객체에 대응하는 콘텐트를 표시하기 위한 화면 구성의 다른 예를 도시하고 있다. 이하 설명 은 도 4의 동작 407에서, 콘텐트를 표시하기 위한 동작에 대해 설명한다. 이하 설명에서 전자 장치는 도 1a의 전자 장치 또는 전자 장치의 적어도 일부(예: 프로세서)를 포함할 수 있다. 도 6을 참조하면, 전자 장치(예: 콘텐트 검색 모듈)는 동작 601에서, 이미지에서 객체의 형상 정보 및 부 가 정보를 검출한 경우(예: 도 4의 동작 403 및 동작 405), 객체의 형상 정보 또는 객체의 상표 정보 중 적어도 하나에 기반하여 검색 서비스에 사용할 검색 영역을 결정할 수 있다. 예를 들어, 프로세서(예: 객체 검출 모듈)는 도 7a와 같이, 디스플레이에 표시된 이미지에서 객체를 검출할 수 있다. 프로세서 (예: 콘텐트 검색 모듈)는 객체의 형상 정보 또는 객체에 포함된 상표(예: \"AAA\") 중 적어 도 하나에 기반하여 검색 서비스에 사용할 서버를 선택할 수 있다. 예를 들어, 프로세서 )(예: 객체 검출 모듈)는 도 8a와 같이, 카메라를 통해 획득한 이미지에서 객체를 검출할 수 있다. 프로세 서는 객체를 인식한 경우, 검색 메뉴(예: 쇼핑, 텍스트 및 이미지)를 표시하도록 디 스플레이를 제어할 수 있다. 프로세서(예: 콘텐트 검색 모듈)는 쇼핑 또는 이미지의검색 메뉴에 대응하는 선택 입력을 수신한 경우, 객체의 형상 정보 또는 객체에 포함된 상표(예: \"AAA\") 중 적어도 하나에 기반하여 검색 서비스에 사용할 서버를 선택할 수 있다. 예컨대, 텍스트의 검색 메뉴는 이미지에서 텍스트의 추출 및 번역 서비스를 제공하기 위한 메뉴를 포함할 수 있다. 전자 장치(예: 콘텐트 검색 모듈)는 동작 603에서, 검색 영역 정보에 기반하여 객체의 형상에 대응하는 적 어도 하나의 콘텐트를 검출할 수 있다. 예를 들어, 프로세서(예: 콘텐트 검색 모듈)는 객체의 형상 정보 또는 객체의 상표 정보 중 적어도 하나에 기반하여 선택한 외부 장치(서버)로 검색 요청 신호를 전송하도 록 통신 인터페이스를 제어할 수 있다. 프로세서(예: 콘텐트 검색 모듈)는 통신 인터페이스 를 통해, 검색 요청 신호의 응답으로 객체의 형상 정보에 대응하는 적어도 하나의 콘텐트를 수신할 수 있 다. 예컨대, 검색 요청 신호는 검색 대상인 객체의 형상 정보를 포함할 수 있다. 전자 장치(예: 정렬 모듈)는 동작 605에서, 객체의 부가 정보에 기반하여 객체의 형상에 대응하는 적어도 하나의 콘텐트의 표시 순서를 설정할 수 있다. 예를 들어, 객체의 형상에 대응하는 적어도 하나의 콘텐트는 객 체의 형상과의 유사도에 대응하는 우선순위를 포함할 수 있다. 프로세서(예: 정렬 모듈)는 각각의 콘 텐트의 상세 정보에 객체의 부가 정보에 대응되는 단어가 존재하는지 확인할 수 있다. 프로세서(예: 정렬 모듈)는 객체의 부가 정보에 대응하는 단어를 포함하는 콘텐트의 우선순위를 다른 콘텐트보다 상대적으로 높게 갱신할 수 있다. 프로세서(예: 정렬 모듈)는 적어도 하나의 콘텐트의 갱신된 우선순위에 대응하 도록 콘텐트의 표시 순서를 설정할 수 있다. 예컨대, 객체의 부가 정보는 이미지에서 검출한 텍스트, 상표에 대 응하는 텍스트 또는 객체의 형상 정보에 대응하는 텍스트 중 적어도 하나에 기반하여 설정될 수 있다. 전자 장치(예: 프로세서)는 동작 607에서, 콘텐트의 표시 순서에 기반하여 객체의 형상 정보에 대응하는 적어도 하나의 콘텐트를 디스플레이에 표시할 수 있다. 예를 들어, 프로세서는 도 7b와 같이, 이미지(70 0)에 포함된 객체의 형상 정보와 부가 정보에 대응하는 표시 순서에 기반하여 객체의 형상에 대응하 는 적어도 하나의 콘텐트(722 내지 728)를 표시하도록 디스플레이를 제어할 수 있다. 디스플레이는 객체와 구분되는 적어도 일부 영역에 객체의 형상에 대응하는 적어도 하나의 콘텐트(722 내지 728)를 표시할 수 있다. 예를 들어, 프로세서는 도 8b와 같이, 이미지에 포함된 객체의 형상 정 보와 부가 정보에 대응하는 표시 순서에 기반하여 디스플레이의 적어도 일부 영역에 객체의 형 상에 대응하는 적어도 하나의 콘텐트(822 내지 828)를 표시하도록 디스플레이를 제어할 수 있다. 도 9는 본 발명의 다양한 실시 예에 따른 전자 장치에서 객체의 형상 정보 및 상표 정보에 기반하여 검색 영역 을 설정하기 위한 흐름도의 일 예를 도시하고 있다. 이하 설명은 도 6의 동작 601 내지 동작 603에서 객체의 형 상에 대응하는 콘텐트의 검색 영역을 설정하기 위한 동작에 대해 설명한다. 이하 설명에서 전자 장치는 도 1a의 전자 장치 또는 전자 장치의 적어도 일부(예: 프로세서)를 포함할 수 있다. 도 9를 참조하면, 전자 장치(예: 콘텐트 검색 모듈)는 동작 901에서, 검색 서비스를 제공하기 위한 이미지 에서 객체의 형상 정보 및 부가 정보를 검출한 경우(예: 도 4의 동작 403 및 동작 405), 객체의 형상 정보에 대 응하는 저장 영역을 결정할 수 있다. 예를 들어, 전자 장치는 검색 서비스를 위한 다수 개의 저장 영역을 사용할 수 있다. 프로세서(예: 콘텐트 검색 모듈)는 다수 개의 저장 영역 중 객체의 형태(예: 상의, 하의) 또는 용도에 대응하는 적어도 하나의 저장 영역을 선택할 수 있다. 예컨대, 저장 영역은 외부 장치 또는 외부 장치에 포함되는 저장 공간(데이터 베이스)을 포함할 수 있다. 객체의 용도는 객체의 형상 정보에 기반하 여 결정되는 객체의 사용 분야를 포함할 수 있다. 전자 장치(예: 상표 검출 모듈)는 동작 903에서, 카메라를 통해 획득한 이미지에서 상표 정보가 검출되는 지 확인할 수 있다. 예를 들어, 프로세서(예: 상표 검출 모듈)는 이미지에서 검출한 적어도 하나의 객체 중 기준 상표에 대응하는 객체가 존재하는지 확인할 수 있다. 예컨대, 상표는 로고, 브랜드, 텍스트 또는 CI(corporate identity) 중 적어도 하나를 포함할 수 있다. 전자 장치는 카메라를 통해 획득한 이미지에서 상표 정보를 검출하지 못한 경우, 객체의 형상 정보에 대응하는 저장 영역을 검색 서비스를 제공하는데 사용할 저장 영역으로 판단할 수 있다. 전자 장치(예: 콘텐트 검색 모듈)는 동작 905에서, 카메라를 통해 획득한 이미지에서 상표 정보를 검출한 경우, 상표 정보에 기반하여 검색 서비스를 제공하는데 사용할 저장 영역을 갱신할 수 있다. 예를 들어, 프로세 서(예: 콘텐트 검색 모듈)는 객체의 형상 정보에 대응하는 적어도 하나의 저장 영역 중 상표 정보에 대응하는 저장 영역을 추가적으로 선택할 수 있다. 예를 들어, 프로세서(예: 콘텐트 검색 모듈)는 객 체의 형상 정보에 대응하는 적어도 하나의 저장 영역 내에서 상표 정보에 기반하여 검색 범위를 설정할 수있다. 전자 장치(예: 콘텐트 검색 모듈)는 동작 907에서, 검색 서비스를 제공하는데 사용할 저장 영역으로 검색 요청 신호를 전송할 수 있다. 예를 들어, 검색 요청 신호는 검색 대상인 객체의 형상 정보(예: 외관 형태)를 포 함할 수 있다. 전자 장치(예: 콘텐트 검색 모듈)는 동작 909에서, 검색 요청 신호에 대한 응답으로 객체의 형상 정보에 대응하는 적어도 하나의 콘텐트를 수신할 수 있다. 예를 들어, 프로세서(예: 콘텐트 검색 모듈)는 통 신 인터페이스를 통해, 검색 요청 신호의 응답 신호에서 객체의 형상 정보에 대응하는 상품의 식별 정보 (PID: product identification)를 확인할 수 있다. 프로세서(예: 콘텐트 검색 모듈)는 상품 서버로 부터 상품의 식별 정보에 대응하는 상세 정보를 획득할 수 있다. 예컨대, 객체의 형상 정보에 대응하는 상품의 식별 정보는 객체의 형상 정보와의 유사도가 기준 유사도를 초과하는 상품 이미지에 대응하는 식별 정보를 포함 할 수 있다. 도 10은 본 발명의 다양한 실시 예에 따른 전자 장치에서 객체의 형상 정보 및 상표 정보에 기반하여 검색 영역 을 설정하기 위한 흐름도의 다른 예를 도시하고 있다. 이하 설명은 도 6의 동작 601 내지 동작 603에서 객체의 형상에 대응하는 콘텐트의 검색 영역을 설정하기 위한 동작에 대해 설명한다. 이하 설명에서 전자 장치는 도 1a 의 전자 장치 또는 전자 장치의 적어도 일부(예: 프로세서)를 포함할 수 있다. 도 10을 참조하면, 전자 장치(예: 콘텐트 검색 모듈)는 동작 1001에서, 검색 서비스를 제공하기 위한 이미 지에서 객체의 형상 정보 및 부가 정보를 검출한 경우(예: 도 4의 동작 403 및 동작 405), 이미지에서 검출한 상표 정보에 대응하는 저장 영역을 결정할 수 있다. 예를 들어, 프로세서는 카메라를 통해 획득한 이 미지에서 \"삼성\"의 상표를 검출한 경우, 이미지에 포함된 객체가 전자 제품의 카테고리에 포함된다고 판단할 수 있다. 프로세서는 전자 제품의 카테고리에 대응하는 외부 장치 또는 외부 장치의 저장 영역을 선택할 수 있다. 전자 장치(예: 콘텐트 검색 모듈)는 동작 1003에서, 객체의 형상 정보에 기반하여 검색 서비스를 제공하는 데 사용할 저장 영역을 갱신할 수 있다. 예를 들어, 프로세서(예: 콘텐트 검색 모듈)는 객체의 형상 정보에 기반하여 전자 제품의 카테고리에 대응하는 저장 영역 내에서의 검색 범위를 한정할 수 있다. 전자 장치(예: 콘텐트 검색 모듈)는 동작 1005에서, 검색 서비스를 제공하는데 사용할 저장 영역으로 검색 요청 신호를 전송할 수 있다. 예를 들어, 검색 요청 신호는 검색 대상인 객체의 형상 정보(예: 외관 형태)를 포 함할 수 있다. 전자 장치(예: 콘텐트 검색 모듈)는 동작 1007에서, 검색 서비스를 제공하는데 사용할 저장 영역으로부터 객체의 형상 정보에 대응하는 적어도 하나의 콘텐트를 수신할 수 있다. 예를 들어, 프로세서(예: 콘텐트 검색 모듈)는 검색 서비스를 제공하는데 사용할 외부 장치로부터 객체의 형상 정보와의 유사도가 기준 유 사도를 초과하는 적어도 하나의 상품 이미지의 식별 정보 및 상세 정보를 수신할 수 있다. 도 11은 본 발명의 다양한 실시 예에 따른 전자 장치에서 객체의 부가 정보에 기반하여 객체에 대응하는 콘텐트 를 검색하기 위한 흐름도를 도시하고 있다. 이하 설명은 도 6의 동작 603에서 객체의 형상에 대응하는 콘텐트를 검출하기 위한 동작에 대해 설명한다. 이하 설명에서 전자 장치는 도 1a의 전자 장치 또는 전자 장치(10 1)의 적어도 일부(예: 프로세서)를 포함할 수 있다. 도 11을 참조하면, 전자 장치(예: 콘텐트 검색 모듈)는 동작 1101에서, 검색 서비스를 제공하는데 사용할 검색 영역을 결정한 경우(예: 도 6의 동작 601), 검색 영역으로 객체의 형상 정보를 전송할 수 있다. 예를 들어, 프로세서(예: 콘텐트 검색 모듈)는 디스플레이에 표시된 이미지에서 검출한 객체의 형상 정보 또는 상표 정보 중 적어도 하나에 기반하여 검색 서비스에 사용할 적어도 하나의 저장 영역을 선택할 수 있다. 프로세서(예: 콘텐트 검색 모듈)는 각각의 저장 영역으로 검색 요청 신호를 전송하도록 통신 인터페이스를 제어할 수 있다. 예컨대, 검색 요청 신호는 검색 대상인 객체의 외관 형태에 대한 정보를 포 함할 수 있다. 다른 실시 예에서, 검색 요청 신호는 검색 대상인 객체의 상표 정보를 포함할 수 있다. 전자 장치(예: 콘텐트 검색 모듈)는 동작 1103에서, 객체의 형상에 대응하는 콘텐트가 수신되는지 확인할 수 있다. 예를 들어, 프로세서(예: 콘텐트 검색 모듈)는 통신 인터페이스를 통해, 검색 요청 신 호에 대응하는 응답 신호가 수신되는지 확인할 수 있다. 응답 신호는 객체의 형상 정보에 대응하는 적어도 하나 의 상품 식별 정보를 포함할 수 있다. 일 예로, 프로세서(예: 콘텐트 검색 모듈)는 검색 요청 신호를 전송한 시점부터 기준 시간이 경과하도록 응답 신호를 수신하지 못한 경우, 검색 요청 신호를 다시 전송하도록통신 인터페이스를 제어할 수 있다. 프로세서(예: 콘텐트 검색 모듈)는 검색 요청 신호의 전송 횟수가 기준 횟수를 초과하는 경우, 객체의 형상 정보에 대응하는 콘텐트가 존재하지 않는 것으로 판단할 수 있 다. 한 실시 예에 따르면, 전자 장치(예: 정렬 모듈)는 객체의 형상에 대응하는 적어도 하나의 콘텐트를 수신 한 경우, 객체의 부가 정보에 기반하여 적어도 하나의 콘텐트의 표시 순서를 설정할 수 있다(예: 도 6의 동작 605). 전자 장치(예: 부가 정보 검출 모듈)는 동작 1105에서, 객체의 형상에 대응하는 콘텐트를 수신하지 못한 경우, 객체의 부가 정보가 존재하는지 확인할 수 있다. 예를 들어, 프로세서는 카메라를 통해 획득한 이미지에서 검출한 객체에 대응하는 키워드가 존재하는지 확인할 수 있다. 키워드는 이미지에서 검출한 텍스트, 상표에 대응하는 텍스트 또는 객체의 형상 정보에 대응하는 텍스트 중 적어도 하나에 기반하여 설정될 수 있다. 전자 장치(예: 콘텐트 검색 모듈)는 동작 1107에서, 객체의 부가 정보가 존재하는 경우, 객체의 부가 정보 에 대응하는 적어도 하나의 콘텐트를 검색할 수 있다. 예를 들어, 프로세서(예: 콘텐트 검색 모듈)는 객체의 부가 정보의 우선순위에 기반하여 대표 키워드를 선택할 수 있다. 프로세서(예: 콘텐트 검색 모듈 )는 대표 키워드에 대응하는 적어도 하나의 콘텐트를 검색할 수 있다. 예컨대, 부가 정보의 우선순위는 텍 스트의 크기, 위치 또는 단어 조합 형태 중 적어도 하나에 기반하여 설정될 수 있다. 전자 장치(예: 프로세서)는 동작 1109에서, 객체의 부가 정보에 대응하는 적어도 하나의 콘텐트를 디스플 레이에 표시할 수 있다. 예를 들어, 프로세서는 객체의 부가 정보에 대응하는 콘텐트와 객체의 형태 정보 에 대응하는 콘텐트가 구분되도록 콘텐트를 표시하는 영역 또는 그래픽 변수 중 적어도 하나를 다르게 설정할 수 있다. 그래픽 변수는 콘텐트의 색상, 배경 색상, 음영 또는 콘텐트의 크기 중 적어도 하나를 포함할 수 있다. 전자 장치(예: 프로세서)는 동작 1111에서, 객체의 부가 정보가 존재하지 않는 경우, 객체에 대응하는 콘 텐트의 검색이 제한됨을 알리는 검색 제한 정보를 출력할 수 있다. 예를 들어, 검색 제한 정보는 검색 영역 오 류 정보 또는 콘텐트 검색 오류 정보 중 적어도 하나를 포함할 수 있다. 예컨대, 검색 제한 정보는 그래픽, 소 리 또는 진동 중 적어도 하나의 형태로 출력될 수 있다. 도 12는 본 발명의 다양한 실시 예에 따른 전자 장치에서 객체의 부가 정보를 결정하기 위한 흐름도를 도시하고 있다. 이하 설명은 도 11의 동작 1107에서, 객체의 부가 정보에 대응하는 콘텐트를 검색하기 위한 동작에 대해 설명한다. 이하 설명에서 전자 장치는 도 1a의 전자 장치 또는 전자 장치의 적어도 일부(예: 프로세 서)를 포함할 수 있다. 도 12를 참조하면, 전자 장치(예: 부가 정보 검출 모듈)는 동작 1201에서, 카메라를 통해 획득한 이미지에 서 객체의 부가 정보를 검출한 경우(예: 도 11의 동작 1105), 객체의 부가 정보에 포함되는 키워드가 다수 개인 지 확인할 수 있다. 전자 장치(예: 부가 정보 검출 모듈)는 동작 1203에서, 이미지에서 객체에 대응하는 다수 개의 키워드를 검출한 경우, 객체에 대응하는 키워드의 우선순위를 확인할 수 있다. 예를 들어, 키워드의 우선순위는 키워드에 포함되는 단어의 크기, 단어의 위치, 상표에 대응하는 텍스트, 객체의 형상에 대응하는 텍스트 또는 단어 조합 형태 중 적어도 하나에 기반하여 설정될 수 있다. 예컨대, 단어 조합 형태는 하나의 키워드를 구성하는 단어의 조합 방식을 포함할 수 있다. 프로세서는 두 단어 사이의 거리에 기반하여 두 단어를 하나의 키워드로 합 성한 경우, 해당 키워드의 우선순위를 상대적으로 높게 설정할 수 있다. 예컨대, 단어의 위치는 객체의 형상에 대응하는 단어의 위치로 객체의 형상에 기반하여 단어의 위치에 대응하는 우선순위가 다르게 설정될 수 있다. 전자 장치(예: 부가 정보 검출 모듈)는 동작 1205에서, 객체에 대응하는 키워드의 우선순위에 기반하여 대 표 키워드를 검출할 수 있다. 예를 들어, 대표 키워드는 우선순위가 높은 순으로 기준 개수의 키워드를 포함할 수 있다. 전자 장치(예: 콘텐트 검색 모듈)는 동작 1207에서, 대표 키워드에 대응하는 적어도 하나의 콘텐트를 검색 할 수 있다. 예를 들어, 프로세서(예: 콘텐트 검색 모듈)는 대표 키워드를 포함하는 검색 요청 신호 를 상품 서버로 전송하도록 통신 인터페이스를 제어할 수 있다. 프로세서(예: 콘텐트 검색 모듈 )는 상품 서버로부터 대표 키워드에 대응하는 적어도 하나의 콘텐트를 수신할 수 있다. 대표 키워드에 대 응하는 콘텐트는 대표 키워드의 적어도 일부를 상세 정보에 포함하는 적어도 하나의 상품을 포함할 수 있다. 전자 장치(예: 콘텐트 검색 모듈)는 동작 1209에서, 이미지에서 객체에 대응하는 하나의 키워드를 검출한 경우, 해당 키워드에 대응하는 적어도 하나의 콘텐트를 검색할 수 있다. 예를 들어, 프로세서(예: 콘텐트 검색 모듈)는 이미지에서 검출한 키워드에 대응하는 검색 요청 신호를 상품 서버로 전송하도록 통신 인터 페이스를 제어할 수 있다. 프로세서는 상품 서버로부터 대표 키워드에 대응하는 적어도 하나의 상품 정보를 수신할 수 있다. 도 13은 본 발명의 다양한 실시 예에 따른 전자 장치에서 객체의 부가 정보에 기반하여 객체에 대응하는 콘텐트 를 정렬하기 위한 흐름도를 도시하고 있다. 도 14는 본 발명의 다양한 실시 예에 따른 전자 장치에서 객체의 부 가 정보에 기반하여 객체에 대응하는 콘텐트를 정렬하기 위한 구성을 도시하고 있다. 도 15a 내지 도 15b는 본 발명의 다양한 실시 예에 따른 전자 장치에서 객체에 대응하는 콘텐트의 정렬 순서를 도시하고 있다. 이하 설명 은 도 6의 동작 603 내지 동작 605에서 객체의 부가 정보에 기반하여 콘텐트를 정렬하기 위한 동작에 대해 설명 한다. 이하 설명에서 전자 장치는 도 1a의 전자 장치 또는 전자 장치의 적어도 일부(예: 프로세서 )를 포함할 수 있다. 도 13을 참조하면, 전자 장치(예: 콘텐트 검색 모듈)는 동작 1301에서, 검색 서비스에 이용할 검색 영역을 결정한 경우(예: 도 6의 동작 601), 검색 영역을 통해 객체의 형상 정보에 대응하는 적어도 하나의 콘텐트를 검 출할 수 있다. 예를 들어, 프로세서(예: 콘텐트 검색 모듈)는 객체의 형상 정보 또는 상표 정보 중 적어도 하나에 기반하여 검색 서비스에 사용할 서버(또는 서버의 저장 영역)를 결정할 수 있다. 프로세서 (예: 콘텐트 검색 모듈)는 검색 서비스에 사용할 서버를 통해, 객체의 형상 정보에 대응하는 적어도 하나 의 상품의 식별 정보를 획득할 수 있다. 프로세서(예: 콘텐트 검색 모듈)는 도 14와 같이, 상품 서버 로부터 각각의 상품 식별 정보에 대응하는 상세 정보를 획득할 수 있다. 전자 장치(예: 부가 정보 검출 모듈)는 동작 1303에서, 이미지에서 검출한 객체의 부가 정보가 존재하는지 확인할 수 있다. 예를 들어, 프로세서(예: 부가 정보 검출 모듈)는 검색 서비스를 제공하기 위한 이 미지에서 검출한 적어도 하나의 키워드가 존재하는지 확인할 수 있다. 전자 장치(예: 정렬 모듈)는 동작 1305에서, 이미지에서 검출한 객체의 부가 정보가 존재하지 않는 경우, 객체의 형상 정보와의 유사도에 기반하여 콘텐트의 표시 순서를 설정할 수 있다. 예를 들어, 객체의 형상 정보 에 대응하는 적어도 하나의 콘텐트는 객체의 형상 정보와 기준 이미지(예: 상품 이미지)의 유사도에 대응하는 우선순위를 포함할 수 있다. 프로세서(예: 정렬 모듈)는 도 15a와 같이, 객체의 형상 정보에 대응하 는 적어도 하나의 콘텐트의 우선순위에 기반하여 객체의 형상과의 유사도가 높은 순서로 적어도 하나의 콘텐트 의 표시 순서를 설정할 수 있다. 전자 장치(예: 정렬 모듈)는 동작 1307에서, 이미지에서 검출한 객체의 부가 정보가 존재하는 경우, 객체 의 형상 정보에 대응하는 적어도 하나의 콘텐트 중 객체의 부가 정보에 대응하는 콘텐트가 존재하는지 확인할 수 있다. 예를 들어, 프로세서(예: 정렬 모듈)는 도 14와 같이, 이미지에서 검출한 객체에 대응하는 적어도 하나의 키워드를 검출할 수 있다. 프로세서(예: 정렬 모듈)는 객체의 형상 정보에 대응 하는 적어도 하나의 상품 중 상세 정보에서 적어도 하나의 키워드를 포함하는 상품이 존재하는지 확인할 수 있다. 전자 장치(예: 정렬 모듈)는 동작 1309에서, 객체의 부가 정보에 대응하는 콘텐트가 존재하는 경우, 객체 의 부가 정보에 기반하여 콘텐트의 표시 순서를 갱신할 수 있다. 예를 들어, 프로세서(예: 정렬 모듈 )는 객체의 형상 정보에 대응하는 적어도 하나의 콘텐트의 우선순위를 객체의 부가 정보에 기반하여 갱신 할 수 있다. 예컨대, 프로세서(예: 정렬 모듈)는 객체에 대응하는 적어도 하나의 키워드를 포함하는 콘텐트의 우선순위를 상대적으로 높게 갱신할 수 있다. 프로세서(예: 정렬 모듈)는 도 15b와 같이, 객체의 부가 정보에 기반하여 갱신된 콘텐트의 우선순위에 대응하도록 적어도 하나의 콘텐트의 표시 순서(152 0)를 설정할 수 있다. 예를 들어, 프로세서(예: 정렬 모듈)는 객체의 부가 정보를 포함하는 다수 개 의 콘텐트가 존재하는 경우, 객체의 형상 정보와의 유사도에 기반하여 콘텐트의 표시 순서를 갱신할 수 있다. 일 예로, 프로세서(예: 정렬 모듈)는 도 14와 같이, PID 4 상품과 PDI 8 상품의 상세 정보(description)에서 객체에 대응하는 적어도 하나의 키워드를 검출할 수 있다. 프로세서(예: 정렬 모듈 )는 상품 이미지와 객체의 형성 정보의 유사도가 PID 4 상품이 PID 8 상품 보다 높은 경우, PID 4 상품의 표시 순서를 1순위로 설정하고, PID 8 상품의 표시 순서를 2순위로 갱 신할 수 있다. 전자 장치(예: 콘텐트 검색 모듈)는 동작 1311에서, 객체의 부가 정보에 대응하는 콘텐트가 존재하지 않는 경우, 객체의 부가 정보에 대응하는 적어도 하나의 콘텐트를 검색할 수 있다. 예를 들어, 프로세서(예: 콘 텐트 검색 모듈)는 도 12의 동작 1201 내지 동작 1209와 같이, 객체에 대응하는 적어도 하나의 키워드 중 대표 키워드를 선택할 수 있다. 프로세서(예: 콘텐트 검색 모듈)는 상품 서버를 통해 대표 키워드에 대응하는 적어도 하나의 콘텐트를 검출할 수 있다. 전자 장치(예: 정렬 모듈)는 동작 1313에서, 객체의 형상 정보에 대응하는 적어도 하나의 콘텐트와 객체의 부가 정보에 대응하는 적어도 하나의 콘텐트 중 중복되는 콘텐트가 존재하는지 확인할 수 있다. 예를 들어, 프 로세서(예: 정렬 모듈)는 객체의 형상 정보에 대응하는 적어도 하나의 상품과 객체의 부가 정보에 대 응하는 적어도 하나의 상품 중 동일한 식별 정보를 갖는 상품이 존재하는지 확인할 수 있다. 전자 장치(예: 정렬 모듈)는 동작 1315에서, 적어도 하나의 중복 콘텐트가 존재하는 경우, 중복 콘텐트의 표시의 우선되도록 콘텐트의 표시 순서를 갱신할 수 있다. 예를 들어, 프로세서(예: 정렬 모듈)는 중 복 콘텐트가 존재하는 경우, 객체의 부가 정보에 대응하는 콘텐트, 객체의 형태 정보에 대응하는 콘텐트 및 중 복 콘텐트가 구분되도록 콘텐트를 표시하는 영역 또는 그래픽 변수 중 적어도 하나를 다르게 설정할 수 있다. 예를 들어, 프로세서(예: 정렬 모듈)는 중복 콘텐트가 존재하는 경우, 객체의 형태 정보에 대응하는 적어도 하나의 콘텐트를 갱신된 표시 순서에 기반하여 표시하도록 디스플레이를 제어할 수 있다. 객체의 부가 정보에 대응하는 콘텐트는 중복 콘텐트를 제외한 적어도 하나의 나머지 콘텐트가 객체의 형태 정보에 대응 하는 콘텐트와 구분되도록 디스플레이의 적어도 일부 영역에 표시될 수 있다. 전자 장치(예: 프로세서)는 동작 1317에서, 중복 콘텐트가 존재하지 않는 경우, 객체의 부가 정보에 대응 하는 적어도 하나의 콘텐트와 객체의 형태 정보에 대응하는 적어도 하나의 콘텐트를 디스플레이에 표시할 수 있 다. 예를 들어, 프로세서는 객체의 부가 정보에 대응하는 콘텐트와 객체의 형태 정보에 대응하는 콘텐트를 디스플레이의 서로 다른 영역에 표시하도록 디스플레이를 제어할 수 있다. 본 발명의 다양한 실시 예에 따르면, 전자 장치의 동작 방법은, 상기 전자 장치와 전기적으로 연결된 카메라를 통해 객체를 포함하는 이미지를 획득하는 동작과 상기 이미지 중 상기 객체에 대응하는 제 1 영역을 통해 상기 객체의 형상과 관련된 제 1 정보를 확인하는 동작과 상기 이미지 중 제 2 영역을 통해 상기 객체의 부가 정보와 관련된 제 2 정보를 확인하는 동작과 외부 장치로부터 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트를 획득 하는 동작, 및 상기 제 1 정보 및 상기 제 2 정보에 적어도 기반하여, 상기 제 1 정보에 대응하는 적어도 하나 의 콘텐트를 표시하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 외부 장치는, 복수의 저장 영역을 포함하고, 상기 콘텐트를 획득하는 동작은, 상기 복수의 저장 영역 중 상기 객체의 형상 정보 또는 상표 정보 중 적어도 하나에 대응하는 적어도 하나의 저 장 영역으로부터 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트를 획득하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 콘텐트를 획득하는 동작은, 상기 외부 장치로부터 상기 제 1 정보에 대응하는 적어도 하나의 상품의 식별 정보를 획득하는 동작, 및 다른 외부 장치로부터 상기 적어도 하나의 상품의 식별 정보에 대응하는 상세 정보를 상기 적어도 하나의 콘텐트의 적어도 일부로 획득하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 제 2 정보를 확인하는 동작은, 상기 이미지에서 추출한 텍스트, 상기 이미지에 서 추출한 상표에 대응하는 텍스트 또는 상기 객체의 형상에 대응하는 텍스트 중 적어도 하나에 기반하여 상기 제 2 정보를 검출하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 제 2 정보를 확인하는 동작은, 상기 이미지에서 추출한 단어의 크기, 단어의 표 시 위치, 단어를 구성하는 문자의 개수, 단어를 포함되는 언어의 개수, 제거 단어 목록 또는 단어 사이의 거리 중 적어도 하나에 기반하여 상기 이미지에서 추출한 텍스트의 적어도 일부를 상기 제 2 정보로 설정하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 콘텐트를 표시하는 동작은, 상기 적어도 하나의 콘텐트가 상기 제 1 정보 및 상 기 제 2 정보와 연관된 정도에 기반하여, 상기 적어도 하나의 콘텐트를 상기 전자 장치와 전기적으로 연결된 디 스플레이에 표시하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 콘텐트를 표시하는 동작은, 상기 적어도 하나의 콘텐트와 상기 제 1 정보의 유 사도에 기반하여 상기 적어도 하나의 콘텐트의 우선순위를 설정하는 동작과 상기 적어도 하나의 콘텐트 중 상기 제 2 정보에 대응하는 콘텐트의 우선순위를 갱신하는 동작, 및 상기 갱신된 우선순위에 기반하여 상기 적어도 하나의 콘텐트를 표시하는 동작을 포함할 수 있다.다양한 실시 예에 따르면, 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트 중 상기 제 2 정보에 대응하는 콘 텐트가 존재하는지 확인하는 동작과 상기 제 2 정보에 대응하는 콘텐트가 존재하지 않는 경우, 다른 외부 장치 로부터 상기 제 2 정보의 적어도 일부에 대응하는 적어도 하나의 다른 콘텐트를 획득하는 동작, 및 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트와 상기 적어도 하나의 다른 콘텐트를 표시하는 동작을 더 포함할 수 있 다. 다양한 실시 예에 따르면, 상기 콘텐트를 표시하는 동작은, 상기 전자 장치와 기능적으로 연결된 디스플레이의 제 1 영역을 통해, 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트를 표시하는 동작, 및 상기 디스플레이의 제 2 영역을 통해, 상기 적어도 하나의 다른 콘텐트를 구분하여 표시하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 콘텐트를 표시하는 방법은, 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트와 상기 적어도 하나의 다른 콘텐트 중 중복되는 콘텐트를 검출하는 동작과 상기 제 1 정보에 대응하는 적어도 하 나의 콘텐트 중 상기 중복되는 콘텐트의 우선순위를 갱신하는 동작, 및 상기 갱신된 우선순위에 기반하여 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트를 표시하는 동작을 포함할 수 있다. 본 발명의 다양한 실시 예에 따르면, 전자 장치(예: 서버 장치)의 동작 방법은, 외부 장치로부터 이미지를 수신 하는 동작과, 상기 이미지 중 상기 객체에 대응하는 제 1 영역을 통해 상기 객체의 형상과 관련된 제 1 정보를 확인하는 동작과 상기 이미지 중 제 2 영역을 통해 상기 객체의 부가 정보와 관련된 제 2 정보를 확인하는 동작 과 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트를 획득하는 동작과 상기 제 1 정보 및 상기 제 2 정보에 적어도 기반하여, 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트를 정렬하는 동작, 및 상기 정렬된 제 1 정 보에 대응하는 적어도 하나의 콘텐트를 상기 외부 장치로 전송하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 콘텐트를 획득하는 동작은, 복수의 저장 영역 중 상기 객체의 형상 정보 또는 상표 정보 중 적어도 하나에 대응하는 적어도 하나의 저장 영역으로부터 상기 제 1 정보에 대응하는 적어도 하 나의 콘텐트를 획득하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 콘텐트를 정렬하는 동작은, 상기 적어도 하나의 콘텐트와 상기 제 1 정보의 유 사도에 기반하여 상기 적어도 하나의 콘텐트의 우선순위를 설정하는 동작과 상기 적어도 하나의 콘텐트 중 상기 제 2 정보에 대응하는 콘텐트의 우선순위를 갱신하는 동작, 및 상기 갱신된 우선순위에 기반하여 상기 적어도 하나의 콘텐트를 정렬하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 콘텐트를 정렬하는 동작은, 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트 중 상기 제 2 정보에 대응하는 콘텐트가 존재하는지 확인하는 동작과 상기 제 2 정보에 대응하는 콘텐트가 존재 하지 않는 경우, 다른 외부 장치로부터 상기 제 2 정보의 적어도 일부에 대응하는 적어도 하나의 다른 콘텐트를 획득하는 동작과 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트와 상기 제 2 정보의 적어도 일부에 대응하는 적어도 하나의 다른 콘텐트 중 중복되는 콘텐트를 검출하는 동작과 상기 제 1 정보에 대응하는 적어도 하나의 콘텐트 중 상기 중복되는 콘텐트의 우선순위를 갱신하는 동작과 상기 갱신된 우선순위에 기반하여 상기 제 1 정 보에 대응하는 적어도 하나의 콘텐트를 정렬하는 동작을 포함할 수 있다. 본 문서에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구성된 유닛을 포함하며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로 등의 용어와 상호 호환적으로 사용될 수 있다. \"모듈\"은, 일체로 구성된 부 품 또는 하나 또는 그 이상의 기능을 수행하는 최소 단위 또는 그 일부가 될 수 있다. \"모듈\"은 기계적으로 또 는 전자적으로 구현될 수 있으며, 예를 들면, 어떤 동작들을 수행하는, 알려졌거나 앞으로 개발될, ASIC(application-specific integrated circuit) 칩, FPGAs(field-programmable gate arrays), 또는 프로그램 가능 논리 장치를 포함할 수 있다. 다양한 실시 예에 따른 장치(예: 모듈들 또는 그 기능들) 또는 방법(예: 동작들)의 적어도 일부는 프로그램 모 듈의 형태로 컴퓨터로 판독 가능한 저장 매체(예: 메모리)에 저장된 명령어로 구현될 수 있다. 명령어가 프로세서(예: 프로세서)에 의해 실행될 경우, 프로세서가 명령어에 해당하는 기능을 수행할 수 있다. 컴퓨 터로 판독 가능한 기록 매체는, 하드디스크, 플로피디스크, 마그네틱 매체(예: 자기테이프), 광기록 매체(예: CD-ROM, DVD, 자기-광 매체 (예: 플롭티컬 디스크), 내장 메모리 등을 포함할 수 있다. 명령어는 컴파일러에 의 해 만들어지는 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 다양한 실시 예에 따른 모 듈 또는 프로그램 모듈은 전술한 구성요소들 중 적어도 하나 이상을 포함하거나, 일부가 생략되거나, 또는 다른 구성요소를 더 포함할 수 있다. 다양한 실시 예에 따른, 모듈, 프로그램 모듈 또는 다른 구성요소에 의해 수행되는 동작들은 순차적, 병렬적, 반복적 또는 휴리스틱하게 실행되거나, 적어도 일부 동작이 다른 순서로 실행되거나, 생략되거나, 또는 다른 동 작이 추가될 수 있다. 그리고 본 문서에 개시된 실시 예는 개시된, 기술 내용의 설명 및 이해를 위해 제시된 것이며, 본 발명의 다양 한 실시 예의 범위를 한정하는 것은 아니다. 따라서, 본 발명의 다양한 실시 예의 범위는, 본 발명의 다양한 실 시 예의 기술적 사상에 근거한 모든 변경 또는 다양한 다른 실시 예를 포함하는 것으로 해석되어야 한다."}
{"patent_id": "10-2017-0055768", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1a는 본 발명의 다양한 실시 예에서의 네트워크 환경 내의 전자 장치를 도시한다. 도 1b는 본 발명의 다양한 실시 예에서 객체의 검색 서비스를 제공하기 위한 전자 장치의 블록도를 도시한다. 도 1c는 본 발명의 다양한 실시 예에서 객체에 대응하는 콘텐트를 저장하는 서버의 구성을 도시한다. 도 2는 본 발명의 다양한 실시 예에 따른 전자 장치의 블록도를 도시한다. 도 3은 본 발명의 다양한 실시 예에 따른 프로그램 모듈의 블록도를 도시한다. 도 4는 본 발명의 다양한 실시 예에 따른 전자 장치에서 객체에 대응하는 콘텐트를 표시하기 위한 흐름도를 도 시한다. 도 5a 내지 도 5e는 본 발명의 다양한 실시 예에 따른 전자 장치에서 객체의 부가 정보를 확인하기 위한 구성을 도시한다. 도 6은 본 발명의 다양한 실시 예에 따른 전자 장치에서 객체에 대응하는 콘텐트의 표시 순서를 설정하기 위한 흐름도를 도시한다. 도 7a 내지 도 7b는 본 발명의 다양한 실시 예에 따른 전자 장치에서 객체에 대응하는 콘텐트를 표시하기 위한 화면 구성의 일 예를 도시한다. 도 8a 내지 도 8b는 본 발명의 다양한 실시 예에 따른 전자 장치에서 객체에 대응하는 콘텐트를 표시하기 위한 화면 구성의 다른 예를 도시한다. 도 9는 본 발명의 다양한 실시 예에 따른 전자 장치에서 객체의 형상 정보 및 상표 정보에 기반하여 검색 영역 을 설정하기 위한 흐름도의 일 예를 도시한다. 도 10은 본 발명의 다양한 실시 예에 따른 전자 장치에서 객체의 형상 정보 및 상표 정보에 기반하여 검색 영역 을 설정하기 위한 흐름도의 다른 예를 도시한다. 도 11은 본 발명의 다양한 실시 예에 따른 전자 장치에서 객체의 부가 정보에 기반하여 객체에 대응하는 콘텐트 를 검색하기 위한 흐름도를 도시한다. 도 12는 본 발명의 다양한 실시 예에 따른 전자 장치에서 객체의 부가 정보를 결정하기 위한 흐름도를 도시한다. 도 13은 본 발명의 다양한 실시 예에 따른 전자 장치에서 객체의 부가 정보에 기반하여 객체에 대응하는 콘텐트 를 정렬하기 위한 흐름도를 도시한다. 도 14는 본 발명의 다양한 실시 예에 따른 전자 장치에서 객체의 부가 정보에 기반하여 객체에 대응하는 콘텐트 를 정렬하기 위한 구성을 도시한다. 도 15a 내지 도 15b는 본 발명의 다양한 실시 예에 따른 전자 장치에서 객체에 대응하는 콘텐트의 정렬 순서를 도시한다."}
