{"patent_id": "10-2021-0165789", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0065110", "출원번호": "10-2021-0165789", "발명의 명칭": "반려동물 디바이스를 이용한 반려동물 관리 시스템", "출원인": "김수현", "발명자": "김수현"}}
{"patent_id": "10-2021-0165789", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "반려동물 디바이스를 이용한 반려동물 관리 시스템에 있어서,반려동물과 관련한 등록 정보가 저장되는 RFID부, 및 근거리 무선 통신망을 이용하여 상기 등록 정보가 포함된비콘 신호를 송신하는 통신부를 포함하는 반려동물 디바이스;상기 반려동물 디바이스의 상기 비콘 신호를 수신하고, 상기 비콘 신호에 기초한 상기 등록 정보와 반려동물 보호자의 고유 정보를 송신하는 보호자 단말기;상기 보호자 단말기로부터 상기 등록 정보와 상기 고유 정보를 수신하고, 상기 등록 정보 및 상기 고유 정보를매핑하여 저장하는 관리 서버; 및상기 반려동물 디바이스의 근처에 있는 경우, 상기 반려동물 디바이스의 상기 비콘 신호를 수신하는 적어도 하나의 타인 단말기를 포함하고,상기 관리 서버는 상기 보호자 단말기로부터 상기 반려동물 디바이스의 위치정보 공개여부 정보를 전달받으며,상기 타인 단말기에는 위치정보공개가 승인된 상기 반려동물 디바이스의 위치 정보만이 표시되며,상기 위치정보 공개여부 정보는 (1) 전체 공개, (2) 기설정된 등록된 타인 단말기에만 공개 및 (3) 비공개 중하나이며,상기 보호자 단말기는 상기 등록 정보를 기반으로 상기 반려동물의 속성 정보인 반려동물 기본 정보, 상기 반려동물 디바이스를 착용하고 있는 상기 반려동물의 메디컬 정보 및 상기 반려동물 보호자의 연락처 정보인 보호자정보 중 적어도 하나를 포함하는 반려동물 정보를 생성하여, 상기 관리 서버로 전송하는 것을 특징으로 하는 반려동물 관리 시스템."}
{"patent_id": "10-2021-0165789", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 반려동물 디바이스는,상기 반려동물 디바이스를 착용하고 있는 상기 반려동물의 움직임을 감지하여 행동 정보를 생성하는 센서부,를포함하고,상기 통신부는,상기 반려동물 디바이스의 비콘 위치 신호를 송신하는 제1 통신 모듈 및 상기 센서부에서 감지된 상기 행동 정보를 송신하는 제2 통신 모듈을 포함하고,상기 타인 단말기는,상기 반려동물 디바이스로부터 상기 비콘 위치 신호를 수신받고, 상기 비콘 위치 신호 및 상기 타인 단말기의위치 정보를 기반으로 상기 반려동물 디바이스의 위치 정보를 생성하고, 상기 비콘 신호에 포함된 상기 등록 정보에 기초하여 상기 반려동물 디바이스의 위치 정보를 상기 관리 서버로 송신하는 것을 특징으로 하는 반려동물관리 시스템."}
{"patent_id": "10-2021-0165789", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서,공개특허 10-2023-0065110-3-상기 관리 서버는,상기 타인 단말기로부터 상기 등록 정보에 기초한 상기 반려동물 디바이스의 위치 정보를 수신받고,상기 등록 정보를 기반으로 상기 반려동물 디바이스의 상기 위치정보 공개여부 정보를 결정하며,상기 위치정보 공개여부 정보가, (2) 기설정된 등록된 타인 단말기에만 공개일 경우, 상기 타인 단말기가 상기기설정된 등록된 타인 단말기인지를 판단하고,상기 반려동물 디바이스의 상기 위치정보 공개여부 정보가 (1) 전체 공개 또는 상기 타인 단말기가 상기 기설정된 등록된 타인 단말기일 경우, 상기 타인 단말기에 상기 반려동물 디바이스의 위치정보공개를 승인하고,상기 반려동물 디바이스의 상기 위치정보 공개여부 정보가 (3) 비공개 또는 상기 타인 단말기가 상기 기설정된등록된 타인 단말기가 아닐 경우, 상기 타인 단말기에 상기 반려동물 디바이스의 위치정보공개를 미승인하는 것을 특징으로 하는 반려동물 관리 시스템."}
{"patent_id": "10-2021-0165789", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3 항에 있어서,상기 보호자 단말기는,상기 관리 서버로부터 이벤트 행사와 관련한 시간 정보를 포함하는 이벤트 정보를 수신받고, 상기 이벤트 정보를 기반으로 상기 반려동물 디바이스를 착용하고 있는 반려동물의 참여를 수락하는 참여 정보를 입력받아 상기관리 서버에 상기 참여 정보를 송신하며, 상기 관리 서버는,상기 이벤트 정보 및 상기 참여 정보를 기반으로 상기 반려동물 디바이스의 상기 위치정보 공개여부 정보를 (1)전체 공개로 조정하는 것을 특징으로 하는 반려동물 관리 시스템."}
{"patent_id": "10-2021-0165789", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3 항에 있어서,상기 보호자 단말기는, 상기 고유 정보와 매핑된 상기 등록 정보를 기반으로 상기 반려동물 디바이스를 착용하고 있는 반려동물의 실종된 상황 및 상기 반려동물 디바이스가 실종된 실종 위치를 포함하는 정보인 실종 정보를 입력하고, 상기 실종정보 및 상기 반려동물 정보를 포함하는 모바일 전단지를 생성하여 상기 관리 서버로 송신하고,상기 관리 서버는, 상기 보호자 단말기로부터 상기 모바일 전단지를 수신받고, 상기 실종 정보를 기반으로 상기 실종 위치의 주변에 위치한 상기 타인 단말기로 상기 모바일 전단지를 송신하는 것을 특징으로 하는 반려동물 관리 시스템."}
{"patent_id": "10-2021-0165789", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5 항에 있어서,상기 관리 서버는,상기 모바일 전단지에 포함된 상기 반려동물 디바이스의 등록 정보를 실종 리스트에 등록하며, 상기 타인 단말기로부터 수신받은 상기 반려동물 디바이스의 등록 정보가 상기 실종 리스트 상의 등록 정보와 일치할 경우, 상기 타인 단말기에 상기 실종 리스트 상의 상기 등록 정보와 일치하는 상기 반려동물 디바이스의 위치정보공개를승인하고,상기 타인 단말기는,공개특허 10-2023-0065110-4-상기 관리 서버로부터 상기 실종 리스트 상의 상기 등록 정보와 일치하는 상기 반려동물 디바이스의 위치 정보를 표시하는 것을 특징으로 하는 반려동물 관리 시스템."}
{"patent_id": "10-2021-0165789", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6 항에 있어서,상기 관리 서버는,상기 타인 단말기로부터 수신받은 상기 반려동물 디바이스의 등록 정보가 상기 실종 리스트 상의 등록 정보와일치할 경우, 상기 타인 단말기로 반려동물 보호 요청 정보를 송신하고,상기 타인 단말기는,상기 반려동물 보호 요청 정보를 수신 받아, 상기 실종 리스트 상의 등록 정보에 해당하는 상기 반려동물 디바이스를 착용하고 있는 반려동물을 추적하기 위한 찾기 보조 정보를 출력하며,상기 찾기 보조 정보는, 상기 실종 리스트 상의 등록 정보에 해당하는 상기 반려동물 디바이스의 위치 정보를 추적하기 위하여 지리 정보 또는 증강 현실 상으로 출력되는 지리 보조 정보 및상기 반려동물 디바이스의 보호자의 음성 정보인 보호자음성 정보 중 적어도 하나를 포함하고, 상기 타인 단말기는,상기 반려동물 디바이스의 위치 정보가 상기 타인 단말기로부터 기설정된 거리 범위 내에 감지되는 경우, 상기보호자 음성 정보를 출력하는 것을 특징으로 하는 반려동물 관리 시스템."}
{"patent_id": "10-2021-0165789", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7 항에 있어서,상기 반려동물 디바이스는,광원을 발광하는 알람부,를 포함하고,상기 타인 단말기는,상기 반려동물 보호 요청 정보를 기반으로 상기 실종 리스트 상의 등록 정보에 해당하는 상기 반려동물 디바이스로 상기 반려동물 디바이스의 상기 알람부의 기 설정된 제어를 수행하는 실종 상태 신호를 전송하고,상기 반려동물 디바이스는, 상기 실종 상태 신호를 수신받아 상기 알람부의 상기 광원을 기 설정된 주기로 발광하도록 상기 기 설정된 제어를 수행하는 것을 특징으로 하는 반려동물 관리 시스템."}
{"patent_id": "10-2021-0165789", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8 항에 있어서,상기 반려동물 디바이스는,상기 반려동물 디바이스의 등록 정보를 기반으로 상기 반려동물 정보를 수신받기 위한 식별 정보를 포함하는 식별코드부,를 포함하고상기 타인 단말기는,상기 실종 리스트 상의 등록 정보에 해당하는 상기 반려동물 디바이스의 상기 식별 정보를 판독하고, 상기 반려동물 디바이스의 등록 정보를 기반으로 상기 반려동물이 보호되고 있음을 나타내는 보호 완료 정보를 생성하여상기 관리 서버로 상기 보호 완료 정보를 송신하고,공개특허 10-2023-0065110-5-상기 관리 서버는,상기 타인 단말기로부터 상기 보호 완료 정보가 수신될 경우, 상기 반려동물 디바이스의 상기 기 설정된 제어가종료되는 알람 오프 신호를 상기 타인 단말기를 통하여 상기 반려동물 디바이스에 송신하고, 상기 타인 단말기를 소지하고 있는 타인 연락처 정보 및 상기 반려동물 디바이스의 위치 정보를 포함하는 반려동물 보호 정보를상기 보호자 단말기로 송신하는 것을 특징으로 하는 반려동물 관리 시스템."}
{"patent_id": "10-2021-0165789", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9 항에 있어서,상기 알람부는,상기 광원을 발광하여, 상기 식별코드부의 식별 정보를 지면 또는 임의의 영역에 조사하고,상기 보호자 단말기는,상기 타인 연락처 정보를 기반으로 상기 반려동물 디바이스를 탐색 수행에 해당하는 보상을 상기 타인 단말기로제공하고,상기 관리 서버는, 상기 반려동물 디바이스 및 상기 보호자 단말기가 기 설정된 거리 내에 있을 경우, 상기 반려동물 디바이스로부터 수신된 상기 행동 정보 및 상기 보호자 단말기의 위치 정보를 기반으로 산책 시간, 산책 빈도 및 산책 거리중 적어도 하나를 포함하는 산책 정보를 생성하고,상기 반려동물 기본 정보, 상기 반려동물 메디컬 정보 및 상기 산책 정보를 기 학습된 학습 모델에 입력하여,상기 반려동물 디바이스를 착용하고 있는 반려동물의 건강 판단 정보를 생성하고,상기 식별코드부는, 상기 보호자 단말기와 상기 반려동물 디바이스의 초기 연동을 위한 기기 연동 정보를 포함하고,상기 보호자 단말기는,상기 반려동물 디바이스로부터 판독된 상기 식별코드부의 상기 기기 연동 정보를 기반으로 상기 반려동물 디바이스와의 페어링을 수행하는 것을 특징으로 하는 반려동물 관리 시스템."}
{"patent_id": "10-2021-0165789", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 기재의 반려동물 관리 시스템은, 반려동물 디바이스를 이용한 반려동물 관리 시스템에 있어서, 반려동물과 관 련한 등록 정보가 저장되는 RFID부, 및 근거리 무선 통신망을 이용하여 상기 등록 정보가 포함된 비콘 신호를 송 신하는 통신부를 포함하는 반려동물 디바이스; 상기 반려동물 디바이스의 상기 비콘 신호를 수신하고, 상기 비콘 (뒷면에 계속)"}
{"patent_id": "10-2021-0165789", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 보호자가 소지한 보호자 단말기를 이용하여 반려동물의 관리가 가능한 반려동물 관리 시스템에 관한 것이다."}
{"patent_id": "10-2021-0165789", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "반려동물의 보호 및 실종 방지를 위하여, 국내의 동물보호법에 의거하여 반려동물을 관리하는 보호자는 내외장 등록칩을 이용하여 반려동물을 의무적으로 등록하여야 한다. 다만, 반려동물에 착용 또는 삽입하는 내장칩의 경우, 체내 침습으로 인한 염증 및 종양 발생 위험이 있으며, 외장칩의 경우, 하네스형 및 펜던트형의 형태로 이용되나, 이는 분실이 쉬운 문제점이 있다. 또한, 내외장칩 모두 반려동물 등록칩 조회기가 없는 일반인들은 직접 조회가 불가능하여, 반려동물 실종 시, 직접 조회가 불가능하여 빠르게 주인을 찾아주기에 한계가 있다."}
{"patent_id": "10-2021-0165789", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "이에 본 발명은, 반려동물에 상시 착용이 가능하고, 기존 내외장칩 문제를 해결이 가능한 반려동물 디바이스 및 이를 이용한 반려동물 관리 시스템을 제공하고자 한다."}
{"patent_id": "10-2021-0165789", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시예에 일 측면에 따른 반려동물 관리 시스템은, 반려동물 디바이스를 이용한 반려동물 관리 시스 템에 있어서, 반려동물과 관련한 등록 정보가 저장되는 RFID부, 및 근거리 무선 통신망을 이용하여 상기 등록 정보가 포함된 비콘 신호를 송신하는 통신부를 포함하는 반려동물 디바이스; 상기 반려동물 디바이스의 상기 비 콘 신호를 수신하고, 상기 비콘 신호에 기초한 상기 등록 정보와 반려동물 보호자의 고유 정보를 송신하는 보호 자 단말기; 상기 보호자 단말기로부터 상기 등록 정보와 상기 고유 정보를 수신하고, 상기 등록 정보 및 상기 고유 정보를 매핑하여 저장하는 관리 서버; 및 상기 반려동물 디바이스의 근처에 있는 경우, 상기 반려동물 디 바이스의 상기 비콘 신호를 수신하는 적어도 하나의 타인 단말기를 포함하고, 상기 관리 서버는 상기 보호자 단 말기로부터 상기 반려동물 디바이스의 위치정보 공개여부 정보를 전달받으며, 상기 타인 단말기에는 위치정보공 개가 승인된 상기 반려동물 디바이스의 위치 정보만이 표시되며, 상기 위치정보 공개여부 정보는 전체 공개, 기설정된 등록된 타인 단말기에만 공개 및 비공개 중 하나이며, 상기 보호자 단말기는 상기 등록 정보를 기반으로 상기 반려동물의 속성 정보인 반려동물 기본 정보, 상기 반려동물 디바이스를 착용하고 있는 상기 반려동물의 메디컬 정보 및 상기 반려동물 보호자의 연락처 정보인 보호자 정보 중 적어도 하나를 포함하 는 반려동물 정보를 생성하여, 상기 관리 서버로 전송한다. 또한, 상기 반려동물 디바이스는, 상기 반려동물 디바이스를 착용하고 있는 상기 반려동물의 움직임을 감지하여 행동 정보를 생성하는 센서부,를 포함하고, 상기 통신부는, 상기 반려동물 디바이스의 비콘 위치 신호를 송신하 는 제1 통신 모듈 및 상기 센서부에서 감지된 상기 행동 정보를 송신하는 제2 통신 모듈을 포함하고, 상기 타인 단말기는, 상기 반려동물 디바이스로부터 상기 비콘 위치 신호를 수신받고, 상기 비콘 위치 신호 및 상기 타인 단말기의 위치 정보를 기반으로 상기 반려동물 디바이스의 위치 정보를 생성하고, 상기 비콘 신호에 포함된 상 기 등록 정보에 기초하여 상기 반려동물 디바이스의 위치 정보를 상기 관리 서버로 송신할 수 있다. 또한, 상기 관리 서버는, 상기 타인 단말기로부터 상기 등록 정보에 기초한 상기 반려동물 디바이스의 위치 정 보를 수신받고, 상기 등록 정보를 기반으로 상기 반려동물 디바이스의 상기 위치정보 공개여부 정보를 결정하며, 상기 위치정보 공개여부 정보가, 기설정된 등록된 타인 단말기에만 공개일 경우, 상기 타인 단말 기가 상기 기설정된 등록된 타인 단말기인지를 판단하고, 상기 반려동물 디바이스의 상기 위치정보 공개여부 정 보가 전체 공개 또는 상기 타인 단말기가 상기 기설정된 등록된 타인 단말기일 경우, 상기 타인 단말기에 상기 반려동물 디바이스의 위치정보공개를 승인하고, 상기 반려동물 디바이스의 상기 위치정보 공개여부 정보가 비공개 또는 상기 타인 단말기가 상기 기설정된 등록된 타인 단말기가 아닐 경우, 상기 타인 단말기에 상기 반려동물 디바이스의 위치정보공개를 미승인할 수 있다. 또한, 상기 보호자 단말기는, 상기 관리 서버로부터 이벤트 행사와 관련한 시간 정보를 포함하는 이벤트 정보를 수신받고, 상기 이벤트 정보를 기반으로 상기 반려동물 디바이스를 착용하고 있는 반려동물의 참여를 수락하는 참여 정보를 입력받아 상기 관리 서버에 상기 참여 정보를 송신하며, 상기 관리 서버는, 상기 이벤트 정보 및 상기 참여 정보를 기반으로 상기 반려동물 디바이스의 상기 위치정보 공개여부 정보를 전체 공개로 조정할 수 있다. 또한, 상기 보호자 단말기는, 상기 고유 정보와 매핑된 상기 등록 정보를 기반으로 상기 반려동물 디바이스를 착용하고 있는 반려동물의 실종된 상황 및 상기 반려동물 디바이스가 실종된 실종 위치를 포함하는 정보인 실종 정보를 입력하고, 상기 실종 정보 및 상기 반려동물 정보를 포함하는 모바일 전단지를 생성하여 상기 관리 서버 로 송신하고, 상기 관리 서버는, 상기 보호자 단말기로부터 상기 모바일 전단지를 수신받고, 상기 실종 정보를 기반으로 상기 실종 위치의 주변에 위치한 상기 타인 단말기로 상기 모바일 전단지를 송신할 수 있다. 또한, 상기 관리 서버는, 상기 모바일 전단지에 포함된 상기 반려동물 디바이스의 등록 정보를 실종 리스트에 등록하며, 상기 타인 단말기로부터 수신받은 상기 반려동물 디바이스의 등록 정보가 상기 실종 리스트 상의 등 록 정보와 일치할 경우, 상기 타인 단말기에 상기 실종 리스트 상의 상기 등록 정보와 일치하는 상기 반려동물 디바이스의 위치정보공개를 승인하고, 상기 타인 단말기는, 상기 관리 서버로부터 상기 실종 리스트 상의 상기 등록 정보와 일치하는 상기 반려동물 디바이스의 위치 정보를 표시할 수 있다.. 또한, 상기 관리 서버는, 상기 타인 단말기로부터 수신받은 상기 반려동물 디바이스의 등록 정보가 상기 실종 리스트 상의 등록 정보와 일치할 경우, 상기 타인 단말기로 반려동물 보호 요청 정보를 송신하고, 상기 타인 단 말기는, 상기 반려동물 보호 요청 정보를 수신 받아, 상기 실종 리스트 상의 등록 정보에 해당하는 상기 반려동물 디바이스를 착용하고 있는 반려동물을 추적하기 위한 찾기 보조 정보를 출력하며, 상기 찾기 보조 정보는, 상기 실종 리스트 상의 등록 정보에 해당하는 상기 반려동물 디바이스의 위치 정보를 추적하기 위하여 지리 정 보 또는 증강 현실 상으로 출력되는 지리 보조 정보 및상기 반려동물 디바이스의 보호자의 음성 정보인 보호자 음성 정보 중 적어도 하나를 포함하고, 상기 타인 단말기는, 상기 반려동물 디바이스의 위치 정보가 상기 타인 단말기로부터 기설정된 거리 범위 내에 감지되는 경우, 상기 보호자 음성 정보를 출력할 수 있다. 또한, 상기 반려동물 디바이스는, 광원을 발광하는 알람부를 포함하고, 상기 타인 단말기는, 상기 반려동물 보 호 요청 정보를 기반으로 상기 실종 리스트 상의 등록 정보에 해당하는 상기 반려동물 디바이스로 상기 반려동 물 디바이스의 상기 알람부의 기 설정된 제어를 수행하는 실종 상태 신호를 전송하고, 상기 반려동물 디바이스 는, 상기 실종 상태 신호를 수신받아 상기 알람부의 상기 광원을 기 설정된 주기로 발광하도록 상기 기 설정된 제어를 수행할 수 있다. 또한, 상기 반려동물 디바이스는, 상기 반려동물 디바이스의 등록 정보를 기반으로 상기 반려동물 정보를 수신 받기 위한 식별 정보를 포함하는 식별코드부,를 포함하고 상기 타인 단말기는, 상기 실종 리스트 상의 등록 정 보에 해당하는 상기 반려동물 디바이스의 상기 식별 정보를 판독하고, 상기 반려동물 디바이스의 등록 정보를 기반으로 상기 반려동물이 보호되고 있음을 나타내는 보호 완료 정보를 생성하여 상기 관리 서버로 상기 보호 완료 정보를 송신하고, 상기 관리 서버는, 상기 타인 단말기로부터 상기 보호 완료 정보가 수신될 경우, 상기 반려동물 디바이스의 상기 기 설정된 제어가 종료되는 알람 오프 신호를 상기 타인 단말기를 통하여 상기 반려 동물 디바이스에 송신하고, 상기 타인 단말기를 소지하고 있는 타인 연락처 정보 및 상기 반려동물 디바이스의 위치 정보를 포함하는 반려동물 보호 정보를 상기 보호자 단말기로 송신할 수 있다. 또한, 상기 알람부는, 상기 광원을 발광하여, 상기 식별코드부의 식별 정보를 지면 또는 임의의 영역에 조사하 고, 상기 보호자 단말기는, 상기 타인 연락처 정보를 기반으로 상기 반려동물 디바이스를 탐색 수행에 해당하는 보상을 상기 타인 단말기로 제공하고, 상기 관리 서버는, 상기 반려동물 디바이스 및 상기 보호자 단말기가 기 설정된 거리 내에 있을 경우, 상기 반려동물 디바이스로부터 수신된 상기 행동 정보 및 상기 보호자 단말기의 위치 정보를 기반으로 산책 시간, 산책 빈도 및 산책 거리 중 적어도 하나를 포함하는 산책 정보를 생성하고, 상기 반려동물 기본 정보, 상기 반려동물 메디컬 정보 및 상기 산책 정보를 기 학습된 학습 모델에 입력하여, 상기 반려동물 디바이스를 착용하고 있는 반려동물의 건강 판단 정보를 생성하고, 상기 식별코드부는, 상기 보 호자 단말기와 상기 반려동물 디바이스의 초기 연동을 위한 기기 연동 정보를 포함하고, 상기 보호자 단말기는, 상기 반려동물 디바이스로부터 판독된 상기 식별코드부의 상기 기기 연동 정보를 기반으로 상기 반려동물 디바 이스와의 페어링을 수행할 수 있다."}
{"patent_id": "10-2021-0165789", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "제안되는 실시예에 의하면, 보호자 단말기를 이용하여 등록칩이 포함된 반려동물 디바이스 간의 통신이 가능하 며, 등록칩과 연결된 반려동물 정보를 제공과 동시에 상기 반려동물의 효율적인 관리가 수행될 수 있다."}
{"patent_id": "10-2021-0165789", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나, 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서 로 다른 다양한 형태로 구현될 것이며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하며, 본 발명이 속하"}
{"patent_id": "10-2021-0165789", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명 은 청구항의 범주에 의해 정의될 뿐이다. 비록 제1, 제2 등이 다양한 구성요소들을 서술하기 위해서 사용되나, 이들 구성요소들은 이들 용어에 의해 제한 되지 않음은 물론이다. 이들 용어들은 단지 하나의 구성요소를 다른 구성요소와 구별하기 위하여 사용하는 것이다. 따라서 이하에서 언급되는 제1 구성요소는 본 발명의 기술적 사상 내에서 제2 구성요소일 수도 있음은 물론 이다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성 요소를 지칭한다. 본 발명의 여러 실시예들의 각각 특징들이 부분적으로 또는 전체적으로 서로 결합 또는 조합 가능하며, 당업자 가 충분히 이해할 수 있듯이 기술적으로 다양한 연동 및 구동이 가능하며, 각 실시예들이 서로에 대하여 독립적 으로 실시 가능할 수도 있고 연관 관계로 함께 실시 가능할 수도 있다. 한편, 본 발명의 명세서에서 구체적으로 언급되지 않은 본 발명의 기술적 특징에 의해 기대될 수 있는 잠정적인 효과는 본 명세서에 기재된 것과 같이 취급되며, 본 실시예는 당업계에서 평균적인 지식을 가진 자에게 본 발명 을 보다 완전하게 설명하기 위해 제공된 것인 바, 도면에 도시된 내용은 실제 발명의 구현모습에 비해 과장되어 표현될 수 있으며, 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 구성의 상세한 설명은 생략하거나 간 략하게 기재한다. 이하에서는 첨부되는 도면을 참조하여 본 발명의 실시예를 상세하게 설명한다. 도 1은 본 발명의 실시예에 따른 반려동물 관리 시스템을 보여주는 도면이다. 도 2는 도 1의 반려동물 관리 시스템의 반려동물 디바이스의 구성을 개략적으로 도시한 블록도이다. 도 1 및 도 2를 참조하면, 본 발명의 실시예에 따른 반려동물 관리 시스템은 반려동물 디바이스, 보호 자 단말기, 관리 서버 및 타인 단말기를 포함할 수 있다. 먼저, 반려동물 디바이스는 반려동물의 신체 일부에 부착되어, 반려동물 정보를 제공할 수 있다. 이때, 반려동물 디바이스는 RFID부, 통신부, 알람부, 센서부, 식별코드부, 탈 취부 및 밴드부를 포함한다. RFID부는 반려동물 디바이스를 소지하고 있는 반려동물과 관련한 등록 정보(IR)를 저장하는 마이크로 칩(Chip)일 수 있다. 이때, 등록 정보(IR)는 반려동물 등록번호를 포함하며, 또한 등록 정보(IR)는 반려동물 이름, 반려동물 견종, 반 려동물 성별, 반려동물 중성화 여부 및 주인 정보 중 적어도 하나를 추가적으로 포함할 수 있다. 예시적으로, RFID부는 국제표준형 ISO 11784, ISO 11785를 따르는 트랜스폰더일 수 있으나, 무선주파수를 이용하여 비접촉으로 반려동물을 식별할 수 있는 등록 정보(IR)를 저장 및 제공하는 별도의 인식 모듈일 수 있다. 통신부는 근거리 무선 통신망을 이용하여 등록 정보(IR)가 포함된 비콘 신호(S)를 송신할 수 있다. 예시적으로, 통신부는, Wi-Fi, 블루투스(Bluetooth), 저전력 블루투스, UWB(Ultra-Wideband) 중 근거리 무선 통신망을 이용하는 적어도 하나의 통신 모듈일 수 있다. 통신부에서 생성하는 비콘 신호(S)를 보호자 단말기 또는 타인 단말기에 제공함으로써, 반려동 물 디바이스는 보호자 단말기 또는 타인 단말기와의 거리 정보를 파악할 수 있으며, 보호자 단 말기 또는 타인 단말기의 사용자는 파악된 거리 정보를 기반으로 반려동물 디바이스를 착용하고있는 반려동물을 찾을 수 있다. 상세하게는, 통신부는 반려동물 디바이스의 비콘 위치 신호(SL)를 송신하기 위한 제1 통신 모듈 , 센서부에서 감지된 행동 정보를 송수신하기 위한 제2 통신 모듈를 포함할 수 있다. 이때, 비콘 위치 신호(SL)는 반려동물 디바이스의 위치를 추정하기 위한 신호 정보로써, 보호자 단말기 또는 타인 단말기에 제공하여 반려동물 디바이스의 위치를 개략적으로 파악할 수 있는 정보일 수 있다. 예시적으로, 제1 통신 모듈은 초광대역(Ultra-Wideband) 통신 모듈일 수 있으며, 근거리 무선 통신망을 기 반으로 반려동물 디바이스의 비콘 위치 신호(SL)를 단말기(200, 400)에 제공하여, 반려동물 디바이스(10 0)와 단말기(200, 400) 간의 거리, 즉, 반려동물 디바이스의 위치를 추정할 수 있다. 이에 한정하지 않고, 제1 통신 모듈은 TOF(Time of Flight), TOA(Time of Arrival), TDOA(Time Difference of Arrival) 등을 이용하여 거리 연산이 가능한 비콘 위치 신호(SL)의 송수신이 가능한 통신 모듈일 수 있다. 제2 통신 모듈는 반려동물 디바이스의 센서부에서 생성된 행동 정보를 보호자 단말기 또는 타인 단말기에 송신할 수 있다. 즉, 제2 통신 모듈은 반려동물 디바이스에서 측정되는 정보를 단말기(200, 400)로 송수신할 수 있는 통신 모듈일 수 있다. 예시적으로, 제2 통신 모듈는 Wi-Fi, 블루투스(Bluetooth), 저전력 블루투스 중 적어도 하나일 수 있다. 또한, 통신부는 사전에 페어링된 보호자 단말기로 반려동물 디바이스에 대한 행동 정보(IS)를 송신할 수 있다. 이때, 행동 정보(IS)는, 후술할 센서부로부터 전달받은 가속도, 관성 등 움직임을 파악할 수 있는 적어도 하나의 정보일 수 있다. 또한, 통신부는 보호자 단말기와의 연동을 위하여 RFID부에 포함된 등록 정보(IR)를 보호자 단 말기로 전송할 수 있다. 알람부는 반려동물 실종 시, 광원을 발광하여 타인에게 실종된 반려동물임을 알릴 수 있다. 이때, 알람부는 보호자 단말기로부터 기 설정된 거리로부터 이격되거나, 통신부로부터 반려동물 실종 신고 정보를 수신할 경우 광원을 발광할 수 있다. 알람부는 반려동물의 실종 신고 정보를 수신할 경우, 소정의 지면 또는 물체에 광원을 조사하여 실종된 반 려동물임을 나타냄과 동시에 실종된 반려동물을 발견한 타인으로부터 식별코드부의 인식을 유도할 수 있다. 예시적으로 알람부는 광원을 발광하는 임의의 발광 다이오드 소자일 수 있으나, 지면 또는 임의의 영역에 조사하는 빔프로젝터 또는 고보조명일 수 있다. 알람부는 지면 또는 물체에 빛을 조사하여 반려동물의 식별코드부를 인식하기 위한 그림 또는 문자 정보를 제공할 수 있다. 예시적으로, 알람부는 \"실종 중입니다. 카메라로 식별코드를 인식해주세요.\"등과 같이 그림 또는 문자 정 보로 출력될 수 있으며, 이에 한정하지 않고, 반려동물 디바이스를 착용하고 있는 반려동물 기본 정보 (IAA), 반려동물 메디컬 정보(IAM), 반려동물의 보호자 정보(IAC) 중 적어도 하나의 획득이 가능한 식별코드부 의 식별 정보를 출력할 수 있다. 센서부는 반려동물 디바이스를 착용한 반려동물의 움직임을 감지하여 행동 정보(IS)를 생성할 수 있 다. 센서부는 가속도 센서일 수 있으며, 이에 한정하지 않고, 반려동물의 활동량을 파악하기 위한 온도 센서, 관성 센서 중 적어도 하나를 포함하는 다양한 센서일 수 있다. 센서부가 반려동물 디바이스를 착용하고 있는 반려동물의 활동량을 나타내는 행동 정보(IS)를 생성하 고, 관리 서버에 반려동물 디바이스로부터 수신된 행동 정보(IS)를 누적하여 저장하고 행동 정보(IS) 를 기반으로 건강 판단 정보(IH)를 생성할 수 있다. 상세하게는, 인공지능, 딥러닝 및 기계학습으로 생성된 모델인 기 학습된 학습 모델을 기반으로 누적된 행동 정 보(IS)를 입력함으로써, 반려동물 디바이스를 착용하고 있는 반려동물의 건강 판단 정보(IH)를 생성할 수 있다. 예시적으로, 건강 판단 정보(IH)는 행동 정보(IS)를 기초로 유추할 수 있는 반려동물 건강 지수, 반려동물의 컨 디션 등 반려동물의 건강 상태를 파악이 가능한 다양한 정보일 수 있다. 또한, 반려동물 디바이스를 착용하고 있는 반려동물 실종 시, 타인 단말기가 행동 정보(IS)를 수신 받음으로써, 반려동물의 이동 방향 및 건강 상태를 유추할 수 있는 장점이 있다. 식별코드부는 보호자 단말기 또는 타인 단말기의 촬영 모듈로부터 판독되어 반려동물 디바이스 의 등록 정보(IR)를 기반으로 반려동물 정보(IA)를 수신 및 출력하기 위한 상기 식별 정보를 포함할 수 있다. 예시적으로, 상기 식별 정보는 반려동물 디바이스의 등록 정보(IR)에 기초한 URL 주소일 수 있으나, 이에 한정 하지 않고, 관리 서버로부터 반려동물 정보(IA)를 수신받기 위하여 등록 정보(IR)에 기초하는 어떠한 인터 넷 경로, 링크, 암호화 정보 중 적어도 하나일 수 있다. 상세하게는, 식별코드부는 QR 태그 또는 AR 태그의 형태일 수 있으며, 보호자 단말기 또는 타인 단말 기가 식별코드부를 판독하여 관리 서버로부터 반려동물 디바이스의 등록 정보(IR)를 기반으로 반려동물 정보(IA)를 조회할 수 있다. 반려동물 디바이스의 등록 정보(IR)와 연동된 반려동물의 보호자 정보 (IAC), 반려동물의 메디컬 정보(IAM), 반려동물 기본 정보(IAA) 등의 조회가 가능하여 보다 편리하고 빠르게 주인 을 찾는 것을 가능할 수 있다. 이때, 반려동물 기본 정보(IAA)는 반려동물 이름, 성별, 반려동물 견종 및 반려동물 중성화 여부 등 반려동물의 속성을 나타내는 적어도 하나의 정보를 포함할 수 있으며, 반려동물 메디컬 정보(IAM)는 반려동물의 알러지 내역, 접종정보, 질병이력, 먹는 사료 및 약 등 보호자가 미리 기입해 놓은 정보 혹은 외부로부터 수신된 동물 병원 차트 정보 중 적어도 하나를 포함할 수 있다. 또한, 보호자 단말기 또는 타인 단말기는 식별코드부를 식별하여, 보호자가 등록한 영상과 디지 털 반려동물 등록증이 AR(Augmented Reality) 또는 보호자 단말기 또는 타인 단말기의 출력부로 출력 될 수 있다. 식별코드부는, 보호자 단말기와 반려동물 디바이스의 초기 연동을 위한 기기 연동 정보를 포함 할 수 있다. 예시적으로, 기기 연동 정보는 반려동물 디바이스와 연동되기 위한 정보인 BSS ID(Basic Service Set Identifier), SSID(Service Set Identifier), MAC 주소 중 적어도 하나의 네트워크 식별 정보를 포함하고, 상 기 네트워크 식별 정보에 접속하기 위한 공개키, PIN 번호, 네트워크 키 등 보호자 단말기와 연동되는 네 트워크에 접근 가능한 키(Key) 정보를 포함할 수 있다. 탈취부는 후술할 밴드부에 부착되어, 반려동물의 주변으로 소독제를 분사될 수 있다. 탈취부는 가스 형태로 소독제를 분사하여, 반려동물 주위 공간 및 반려동물의 살균 및 바이러스 제거를 수 행할 수 있다. 이때, 상기 소독제는 농축 이산화염소일 수 있으며, 빛에 의해 쉽게 분해되는 이산화염소를 사용함으로써 악취 의 원인 분자를 파괴가 가능하고, 잔류성이 없어, 환경 친화적인 장점과 동시에 반려동물에게서 발생할 수 있는 특유의 냄새를 제거할 수 있다. 밴드부는 반려동물의 신체 일부에 착용되도록 구성되며, 예시적으로 반려동물의 목 주변을 감싸는 끈 형태 로 구성될 수 있다. 보호자 단말기는, 반려동물 디바이스와 연동되는 보호자가 소지한 전자 디바이스일 수 있다. 이때, 보호자 단말기는, 셀룰러 전화, PDA, 랩탑(laptop) 또는 다른 적절한 휴대용 컴퓨팅 디바이스일 수 있다. 보호자 단말기는 반려동물 디바이스로부터 판독된 식별코드부의 상기 기기 연동 정보를 기반으 로 반려동물 디바이스와의 페어링을 수행할 수 있다. 상세하게는, 보호자 단말기가 반려동물 디바이스의 식별코드부를 촬영하고 식별코드부로부 터 판독된 상기 네트워크 식별 정보 및 키정보를 포함하는 기기 연동 정보를 기반으로 반려동물 디바이스 의 통신부와 페어링을 수행할 수 있다. 보호자 단말기와 반려동물 디바이스간의 페어링(Pairing)이 수행되어, 보호자 단말기는 반려동 물 디바이스로부터 반려동물 디바이스의 등록 정보(IR)를 수신받을 수 있으며, 보호자 단말기는 상기 등록 정보(IR)를 기반으로 상기 반려동물의 속성 정보인 반려동물 기본 정보(IAA), 반려동물 디바이스를 착 용하고 있는 반려동물의 메디컬 정보(IAM) 및 반려동물 보호자의 연락처 정보인 보호자 정보(IAC) 중 적어도 하나 를 포함하는 반려동물 정보(IA)를 생성하여, 관리 서버로 전송할 수 있다. 반려동물 디바이스 및 보호자 단말기간의 초기 연동 시, 보호자 단말기는 반려동물 디바이스의 등록 정보(IR) 및 보호자 단말기를 사용하는 반려동물 보호자의 고유 정보(IU)를 관리 서버에 송신하 여, 관리 서버는 수신 받은 반려동물 디바이스의 등록 정보(IR)와 반려동물 보호자의 고유 정보(IU)를 매핑 하여 저장할 수 있다. 이때, 고유 정보(IU)는, 보호자 단말기의 시리얼 넘버, 보호자 단말기를 소지하는 사용자의 계정 또 는 사용자임을 나타내는 개인 고유의 정보일 수 있다. 예시적으로, 보호자 단말기가 전송한 반려동물 디바이스의 등록 정보(IR)에 포함된 등록 번호가 '123456 7'이고, 반려동물 보호자의 고유 정보(IU)에 포함되는 보호자의 주민번호 번호가 '901111-1234567'일 경우, 관 리 서버는 상기 등록 정보(IR) 및 고유 정보(IU)를 매핑한 정보인, \"1234567, 901111-1234567\"를 생성하여, 관리 서버의 데이터베이스에 등록 정보(IR) 및 고유 정보(IU)를 매핑한 정보를 저장할 수 있다. 반려동물 디바이스의 등록 정보(IR) 및 보호자 단말기로부터 입력된 반려동물 보호자의 고유 정보(IU)를 매 핑하여 저장함으로써, 반려동물 디바이스와 보호자 단말기 간의 연동 이후에 보호자가 아닌 타인이 사용하는 타인 단말기가 반려동물 디바이스와의 연동을 시도할 경우, 관리 서버가 기 저장된 등 록 정보(IR) 및 고유 정보(IU)를 매핑한 정보를 확인하여, 기 연동된 반려동물 디바이스와 타인 단말기간의 연동을 방지할 수 있다. 또한, 반려동물 보호자의 고유 정보(IU)를 입력하여 사용되는 보호자 단말기로부터 반려동물 디바이스 를 착용하고 있는 반려동물 정보(IA)의 관리가 가능한 장점이 있다. 보호자 단말기는 어플리케이션을 통해 관리 서버로부터 반려동물 보호자 정보(IAC), 반려동물 메디컬 정보(IAM), 반려동물 기본 정보(IAA) 중 적어도 하나를 포함하는 반려동물 정보(IA)가 보호자 단말기의 출력 부로 출력되어, 보호자는 관리 서버로부터 반려동물에 관한 정보를 제공받을 수 있다. 보호자 단말기는 반려동물 디바이스와의 연동을 위하여, 반려동물 디바이스의 비콘 신호(S)를 수신하고, 비콘 신호(S)에 포함된 등록 정보(IR)와 반려동물 보호자의 고유 정보(IU)를 관리 서버로 송신할 수 있다. 보호자 단말기는 보호자 단말기와 연동된 반려동물 디바이스가 실종될 경우, 고유 정보(IU)와 매핑된 등록 정보(IR)를 기반으로 반려동물 디바이스를 착용하고 있는 반려동물의 실종된 상황 및 반려동물 디바이스가 실종된 실종 위치를 포함하는 정보인 실종 정보를 입력하고, 상기 실종 정보 및 반려동물 정보(IA)를 포함하는 모바일 전단지(IL)를 생성하여 관리 서버에 전송할 수 있다. 그 다음, 관리 서버는, 보호자 단말기로부터 등록 정보(IR)와 상기 고유 정보(IU)를 수신하고, 등록 정보(IR) 및 고유 정보(IU)를 기반으로 보호자 단말기 및 반려동물 디바이스를 매핑하여 저장할 수 있 다. 이때, 관리 서버는 반려동물 디바이스의 등록 정보(IR) 및 보호자의 고유 정보(IU)를 매핑하여 저장 및 관 리하기 위한 제1 관리 서버 및 반려동물 디바이스의 등록 정보(IR)를 기반으로 반려동물 정보(IA) 및 위치 정보(IAP)를 관리하기 위한 제2 관리 서버를 포함할 수 있다. 다만, 제1 관리 서버 및 제2 관리 서버의 구성은 각각 독립되지 않고, 적어도 하나의 관리 서버(30 0)로 구성될 수 있다. 관리 서버는 보호자 단말기로부터 반려동물 디바이스의 위치정보 공개여부 정보(IAP)를 전달받을 수 있다. 이때, 관리 서버가 보호자 단말기로부터 반려동물 디바이스의 위치정보 공개여부 정보(IAP)를 저 장하여 각각의 타인 단말기로부터 수신되는 반려동물 디바이스의 등록 정보(IR)를 기반으로 타인 단말기 에서의 반려동물 디바이스의 위치 정보(PIA)의 공개 승인 여부를 판단할 수 있다. 상세하게는, 타인 단말기에는 위치정보공개가 승인된 반려동물 디바이스의 위치 정보(PIA)만이 표시되며, 위치정보 공개여부 정보(IAP)는 전체 공개, 기설정된 등록된 타인 단말기에만 공개 및 비공개 중 하 나일 수 있다. 이때, 기설정된 등록된 타인 단말기는, 반려동물 디바이스와 연동된 보호자 단말기 간의 위치 정보 제공 동의를 수락하여 등록된 타인 단말기이다. 상세하게는, 보호자 단말기와 연동된 제1 반려동물 디바이스 및 타인 단말기와 연동된 제2 반려 동물 디바이스가 기 설정된 범위 내에 존재할 경우, 보호자 단말기 및 타인 단말기에는 각각의 반려동물 디바이스(101, 102)의 위치 정보 제공 동의를 요청하는 친구맺기 정보를 각각의 단말기(200, 400)에게 제공할 수 있다. 이때, 보호자 단말기 및 타인 단말기가 상기 친구맺기 정보를 확인하여 위치 정보 제공 동의를 수락 할 경우, 보호자 단말기 및 타인 단말기에는 각각의 반려동물 디바이스(101, 102)를 착용하고 있는 반려동물의 위치 정보(IAP)가 공유될 수 있다. 관리 서버는 반려동물 디바이스와 연동된 보호자 단말기의 산책 경로 및 시간대를 포함하는 산 책 정보를 수신받고, 적어도 하나 이상의 상기 산책 정보를 기반으로 산책 경로와 산책하기 좋은 시간대를 추천 하는 산책 추천 정보를 생성하여, 보호자 단말기 및 타인 단말기로 상기 산책 추천 정보를 제공할 수 있다. 관리 서버는 반려동물 디바이스 및 보호자 단말기가 기 설정된 거리 내에 있을 경우, 반려동물 디바이스로부터 수신된 행동 정보(IS) 및 보호자 단말기의 위치 정보(PIP)를 기반으로 산책 시간, 산책 빈 도 및 산책 거리 중 적어도 하나를 포함하는 산책 정보를 생성하고, 반려동물 기본 정보(IAA), 상기 반려동물 메 디컬 정보(IAM) 및 상기 산책 정보를 기 학습된 학습 모델에 입력하여, 반려동물 디바이스를 착용하고 있는 반려동물의 건강 판단 정보(IH)를 생성할 수 있다. 이때, 상기 기 학습된 학습 모델은 인공지능, 딥러닝, 기계학습을 이용하여 생성된 학습 모델일 수 있으며, 건 강 판단 정보(IH)를 기반으로 견종별 적정 무게 및 반려동물의 필요한 운동량을 보호자 단말기로 제공할 수 있다. 보호자 단말기의 위치 정보(PIP)는 GNSS, GPS와 같은 위성 항법 시스템 또는 AP(Access Point)의 주소 정보를 이용한 위치 정보일 수 있다.관리 서버는, 보호자 단말기로부터 수신된 반려동물 디바이스의 등록 정보(IR)를 기반으로 생성된 상 기 반려동물의 속성 정보인 반려동물 기본 정보(IAA), 반려동물 디바이스를 착용하고 있는 상기 반려동물의 메디컬 정보 (IAM) 및 상기 반려동물 보호자의 연락처 정보인 보호자 정보(IAC) 중 적어도 하나를 포함하는 반려 동물 정보(IA)를 수신하여 저장할 수 있다. 관리 서버는, 반려동물의 메디컬 정보(IAM) 및 반려동물 기본 정보(IAA)를 기반으로 관계형 데이터 베이스 를 활용하여 생성된 반려동물 건강 데이터를 기반으로 훈련법, 식이, 행동장애, 육아팁 등 필요한 정보를 각 분 야의 전문가들이 직접 작성한 컨텐츠와 관련 제품을 매칭하여 제공할 수 있다. 관리 서버는 보호자 단말기로부터 모바일 전단지(IL)를 수신받고, 모바일 전단지(IL)에 포함된 등록정 보를 기반으로 실종된 반려동물 디바이스의 목록인 실종 리스트(IRL)를 생성할 수 있다. 관리 서버는 보호자 단말기의 모바일 전단지(IL)를 수신하여, 실시간 실종된 반려동물 디바이스의 위 치 정보(PIA)가 업데이트되도록 수정되는 모바일 전단지(IL)가 타인 단말기에 송신되고 지리 정보 또는 증 강 현실을 활용하여 반려동물 디바이스를 착용하고 있는 반려동물이 타인 단말기에 의해 최종 목격된 곳을 중심으로 구체적인 행동 반경을 좁힐 수 있다. 이때, 관리 서버는 모바일 전단지(IL)를 반려동물 디바이스가 상기 실종 정보에 포함된 실종 위치 주 변에 존재하는 타인 단말기로 제공될 수 있으나, 이에 한정되지 않고, 실종된 반려동물 디바이스를 탐색하고자 하는 타인 단말기 또는 실종된 반려동물 디바이스의 비콘 신호가 수신된 단말기의 주변 타인 단말기에 모바일 전단지(IL)가 제공될 수 있다. 타인 단말기는 반려동물 디바이스의 근처에 있는 경우, 반려동물 디바이스의 비콘 신호(S)를 수 신할 수 있다. 이때, 타인 단말기는 비콘 신호(S)를 수신하여 반려동물 디바이스를 착용하고 있는 반려동물을 탐색 할 수 있다. 타인 단말기는 셀룰러 전화, PDA, 랩탑(laptop) 또는 다른 적절한 휴대용 컴퓨팅 디바이스일 수 있다. 또한, 타인 단말기는 보호자 단말기와 연동된 제1 반려동물 디바이스와 다른 제2 반려동물 디바이스 와 연동되는 타인이 소지하는 전자 디바이스 일 수 있다. 상세하게는, 타인 단말기는 반려동물 디바이스로부터 상기 비콘 위치 신호(SL)를 수신받고, 비콘 위 치 신호(SL) 및 타인 단말기의 위치 정보(PIO)를 기반으로 반려동물 디바이스의 위치 정보(PIA)를 생성하고, 상 기 비콘 신호에 포함된 등록 정보(IR)에 기초하여 반려동물 디바이스의 위치 정보(PIA)를 관리 서버로 송신 할 수 있다. 타인 단말기의 위치 정보는 GNSS, GPS와 같은 위성 항법 시스템 또는 AP(Access Point)의 주소 정보를 이 용한 위치 정보일 수 있다. 관리 서버는, 수신 받은 반려동물 디바이스의 위치 정보(PIA)를 시간대별로 수집하여 저장할 수 있다. 보호자 단말기는 반려동물 찾기 요청에 따른 모바일 전단지(IL) 배포 시, 음성녹음 기능을 활용하여 보호 자의 음성 정보인 보호자 음성 정보(IV)를 포함하는 모바일 전단지(IL)를 생성할 수 있다. 이때, 보호자 단말기 는 보호자의 음성이 포함된 모바일 전단지(IL)를 관리 서버로 전달하고, 타인 단말기는 반려동 물 디바이스의 위치 주변에서 수신받은 모바일 전단지(IL)를 활용하여, 보호자 음성 정보(IV)를 출력할 수 있다. 타인 단말기가 관리 서버로부터 모바일 전단지(IL)를 수신받아, 타인 단말기로부터 보호자 음성 정보(IV)를 출력함으로써, 타인 단말기의 주변에 있는 반려동물이 보호자의 음성에 반응하여 보다 쉽게 반 려동물을 찾을 수 있다.도 3은 도 1의 반려동물 관리 시스템에 의한 반려동물 관리 방법을 도시한 순서도이다. 먼저, 반려동물 디바이스와 보호자 단말기의 연동을 위하여, 반려동물 디바이스는 보호자 단말 기로부터 반려동물 디바이스의 비콘 신호(S)를 수신 받는 반려동물 단말 정보 송신단계(S111)가 수행 된다. 이때, 반려동물 단말 정보 송신단계(S111)에서, 반려동물 디바이스는 통신부를 통하여 RFID부에 저장된 반려동물 등록 정보(IR)를 비콘 신호(S)에 포함하여 보호자 단말기로 송신할 수 있다. 그 다음, 보호자 단말기는 반려동물 디바이스로부터 수신받은 비콘 신호(S)에 기초하여 등록 정보(IR)와 반려동물 보호자의 고유 정보(IU)를 관리 서버로 송신하는 반려동물 등록 정보 송신단계(S112)가 수행된다. 그 다음, 관리 서버가 보호자 단말기로부터 등록 정보(IR)와 고유 정보(IU)를 수신하고, 등록 정보 (IR) 및 고유 정보(IU)를 매핑하여 저장하는 반려동물 등록단계(S113)가 수행된다. 이때, 반려동물 등록단계(S113)에서, 관리 서버가 반려동물 디바이스의 반려동물의 등록 정보(IR)와 반려동물 보호자의 고유 정보(IU)를 매핑하여 저장함으로써, 반려동물 디바이스를 소지하고 있는 반려동물 의 보호자를 특정할 수 있으며, 매핑된 등록 정보(IR) 및 고유 정보(IU)를 기반으로 반려동물의 관리가 가능하다. 그 다음, 반려동물 디바이스가 반려동물의 움직임을 감지한 정보인 행동 정보(IS)를 보호자 단말로 송신하고, 보호자 단말이 상기 행동 정보(IS)를 관리 서버로 송신하는 반려동물 행동 정보 송신단계 (S114, S115)가 수행된다. 이때, 반려동물 행동 정보 송신 단계(S114, S115)에서, 반려동물 디바이스의 행동 정보(IS)를 보호자 단말 기를 통해 관리 서버로 제공함으로써, 보호자 단말기가 오프라인 상에서도 반려동물 디바이스 의 행동 정보(IS)를 수신받아, 반려동물 디바이스를 소지하고 있는 반려동물의 움직임을 파악할 수 있다. 또한, 보호자 단말기가 관리 서버와 직접적으로 연결되지 못하는 반려동물 디바이스의 중간 통 신 매개체가 되어, 반려동물 디바이스로부터 전송되는 정보를 관리 서버가 관리할 수 있다. 그 다음, 관리 서버가 보호자 단말로부터 수신된 반려동물의 행동 정보(IS)를 저장하는 반려동물 행 동 정보 기록단계(S116)가 수행된다. 상세하게는, 반려동물 행동 정보 기록단계(S116)에서, 관리 서버가 반려동물의 등록 정보(IR)를 기반으로 반려동물의 행동 정보(IS)를 저장 및 축적하고, 관리 서버가 인공지능 학습 모델을 기반으로 축적된 행동 정보(IS)를 분석하여 보호자 단말기로 반려동물의 건강 정보를 제공할 수 있다. 그 다음, 반려동물 디바이스의 근거리 무선 통신망을 이용하여 근처의 타인 단말기로 비콘 신호(S)를 송신하고, 타인 단말기는 수신된 비콘 신호 및 타인 단말기의 위치 정보(PIO)를 기반으로 반려동물 디바이 스의 위치 정보(PIA)를 관리 서버로 송신하는 반려동물 위치 정보 송신 단계(S117, S118)가 수행된다. 상세하게는, 타인 단말기는 반려동물 디바이스로부터 비콘 위치 신호(SL)를 수신받고, 수신된 비콘 위치 신호(SL) 및 타인 단말기의 위치 정보(PIO)를 기반으로 반려동물 디바이스의 위치 정보(PIA)를 생성하고, 상기 비콘 신호에 포함된 등록 정보(IR)에 기초하여 반려동물 디바이스의 위치 정보(PIA)를 관리 서버로 송 신할 수 있다. 그 다음, 관리 서버가 보호자 단말기로부터 각각의 보호자 단말기와 연동된 반려동물 디바이스 의 위치정보 공개여부 정보(IAP)를 전달받아, 타인 단말기에는 위치정보공개가 승인된 반려동물 디바 이스의 위치 정보(PIA)만이 표시되도록 하는 반려동물 위치정보 브로드캐스팅 단계(S119)가 수행된다.그 다음, 보호자 단말기가 고유 정보(IU)와 매핑된 등록 정보(IR)를 기반으로 반려동물 디바이스를 착 용하고 있는 반려동물의 실종된 상황 및 반려동물 디바이스가 실종된 실종 위치를 포함하는 정보인 상기 실종 정보를 입력하고, 상기 실종 정보 및 반려동물 정보(IA)를 포함하는 모바일 전단지(IL)를 생성하여 상기 관 리 서버로 송신하는 반려동물 실종 정보 송신 단계(S120)가 수행된다. 그 다음, 관리 서버가 모바일 전단지(IL)에 포함된 반려동물 디바이스의 등록 정보(IR)를 실종 리스트(IR L)에 등록하는 반려동물 실종 정보 등록 단계(S121)가 수행된다. 그 다음, 관리 서버가 보호자 단말기로부터 모바일 전단지(IL)를 수신받고, 상기 실종 정보를 기반으 로 상기 실종 위치의 주변에 위치한 타인 단말기로 모바일 전단지(IL)를 송신하는 반려동물 실종 정보 브 로드캐스팅 단계(S122)가 수행된다. 예시적으로, 관리 서버는 상기 실종 정보에 포함된 실종 위치로부터 일정 반경 또는 동일한 행정 구역 상 에 위치한 타인 단말기로 모바일 전단지(IL)를 송신할 수 있다. 그 다음, 타인 단말기가 실종 리스트(IRL) 또는 모바일 전단지(IL)에 포함된 반려동물 디바이스의 등록 정보(I R)가 반려동물 디바이스로부터 수신되면, 실종 리스트(IRL) 또는 모바일 전단지(IL)에 포함된 반려동물 디바이스 의 위치 정보(PIA)를 관리 서버로 송신하는 반려동물 발견 정보 송신 단계(S123)가 수행된다. 반려동물 발견 정보 송신 단계(S122)에서, 타인 단말기는 사전에 수신받은 모바일 전단지(IL)의 등록 정보(IR)를 기반으로 반려동물 디바이스가 실종된 반려동물 디바이스임을 사전에 파악하여 관리 서버에 전달할 수 있 으나, 비콘 신호가 수신된 각각의 반려동물 디바이스의 위치정보 공개여부 정보(IAP)를 파악하기 위하여 반 려동물 위치 정보 수신 단계(S117)와 같이, 반려동물 디바이스의 등록 정보(IR) 또는 등록 정보(IR)에 기반한 반 려동물 디바이스의 위치 정보(PIA)를 관리 서버로 송신할 수 있다. 그 다음, 관리 서버가 타인 단말기로부터 수신받은 반려동물 디바이스의 등록 정보(IR)가 실종 리스 트(IRL) 상의 등록 정보(IR)와 일치할 경우, 타인 단말기로 반려동물 보호 요청 정보를 송신하는 반려동물 보호요청 송신 단계(S124)가 수행된다. 상세하게는, 반려동물 보호요청 송신 단계(S123)에서, 관리 서버는 타인 단말기로부터 수신받은 반려 동물 디바이스의 등록 정보(IR)가 상기 실종 리스트(IRL) 상의 등록 정보(IR)와 일치할 경우, 타인 단말기 에 실종 리스트(IRL) 상의 등록 정보(IR)와 일치하는 반려동물 디바이스의 위치정보공개를 승인하고, 타인 단말기는, 관리 서버로부터 실종 리스트(IRL) 상의 등록 정보(IR)와 일치하는 반려동물 디바이스의 위 치 정보(PIA)를 상기 지리 정보 또는 증강 현실 상에 표시할 수 있다. 그 다음, 타인 단말기가 상기 반려동물 보호 요청 정보를 기반으로 실종 리스트(IRL) 상의 등록 정보(IR)에 해당하는 반려동물 디바이스로 반려동물 디바이스의 알람부의 기 설정된 제어를 수행하는 실종 상태 신호를 전송하는 실종 상태 신호 전송 단계(S125)가 수행된다. 반려동물 디바이스가 상기 실종 상태 신호를 수신받아 알람부의 상기 광원을 기 설정된 주기로 발광 하도록 상기 기 설정된 제어를 수행하는 알람 동작 단계(S126)가 수행된다. 이때, 기 설정된 주기는 반려동물 디바이스를 착용하고 있는 반려동물의 확인이 쉽도록 보호자로부터 설정 된 임의의 주기일 수 있다. 그 다음, 타인 단말기가 상기 반려동물 보호 요청 정보를 수신 받아, 실종 리스트(IRL) 상의 등록 정보(I R)에 해당하는 반려동물 디바이스를 착용하고 있는 반려동물을 추적하기 위한 찾기 보조 정보(AI)를 출력 하는 반려동물 찾기 보조 단계(S127)가 수행된다. 이때, 찾기 보조 정보(AI)는, 실종 리스트(IRL) 상의 등록 정보(IR)에 해당하는 반려동물 디바이스의 위치 정보 (PIA)를 추적하기 위하여 상기 지리 정보 또는 증강 현실 상으로 출력되는 지리 보조 정보 및 반려동물 디바이스의 보호자의 음성 정보인 보호자 음성 정보(IV)를 적어도 하나를 포함할 수 있다. 이때, 타인 단말기는 반려동물 디바이스의 위치 정보(PIA)가 타인 단말기로부터 기설정된 거리 범위 내에 감지되는 경우, 보호자 음성 정보(IV)를 출력할 수 있다. 상세하게는, 상기 지리 보조 정보는 실종 대상인 반려동물 디바이스를 착용하고 있는 반려동물의 위치 정보(IA P)를 상기 지리 정보 상의 소정의 아이콘 또는 알람을 표시하는 정보일 수 있으며, 상기 지리 정보 상에 생성된 실종 대상인 반려동물 디바이스의 위치 정보(PIA)까지의 경로 정보일 수 있다. 보호자 음성 정보(IV)는, 실종된 반려동물을 탐색하기 위하여, 보호자 단말기로부터 송신된 모바일 전단지 (IL)에 포함된 보호자의 음성 정보일 수 있다. 이때, 보호자 음성 정보(IV)는 반려동물 디바이스의 통신부에서 송신되는 비콘 신호(S)를 기반으로 타인 단말기 및 반려동물 디바이스 간의 거리를 파악하고, 상기 거리가 기 설정된 거리 범위보다 짧을 경 우, 타인 단말기를 이용하여 보호자 음성 정보(IV)를 출력할 수 있다. 타인 단말기가 찾기 보조 정보(AI)를 출력함으로써, 타인 단말기의 주변에 있는 반려동물이 보호자의 음성에 반응하여 보다 쉽게 반려동물을 찾을 수 있으며, 반려동물 디바이스를 착용하고 있는 반려동물의 위치 정보(IAP)의 추적이 쉽게 수행될 수 있는 장점이 있다. 또한, 반려동물 디바이스가 타인 단말기의 주변 가까이에 존재하는 경우에 보호자 음성 정보(IV)가 활성화됨으로써, 보호자 음성 정보(IV) 사용의 오남용을 방지할 수 있다. 그 다음, 타인 단말기가, 실종 리스트(IRL) 상의 등록 정보(IR)에 해당하는 반려동물 디바이스의 상기 식별 정보를 판독하고, 반려동물 디바이스의 등록 정보(IR)를 기반으로 상기 반려동물이 보호되고 있음을 나타내는 보 호 완료 정보를 생성하여 관리 서버로 상기 보호 완료 정보를 송신하는 반려동물 보호완료 정보 송신 단계 (S128)가 수행된다. 그 다음, 관리 서버가 타인 단말기로부터 상기 보호 완료 정보가 수신될 경우, 반려동물 디바이스 의 상기 기 설정된 제어가 종료되는 알람 오프 신호를 타인 단말기를 통하여 반려동물 디바이스(10 0)에 송신하는 알람 오프 단계(S129)가 수행된다. 그 다음, 관리 서버가 타인 단말기를 소지하고 있는 타인 연락처 정보 및 반려동물 디바이스의 위치 정보(PIA)를 포함하는 반려동물 보호 정보를 보호자 단말기로 송신하는 반려동물 보호 정보 송신 단계 (S130)가 수행된다. 그 다음, 보호자 단말기가 상기 타인 연락처 정보를 기반으로 반려동물 디바이스를 탐색 수행에 해당 하는 보상을 타인 단말기로 제공하는 리워드 지급 단계(S131)가 수행된다. 이때, 상기 탐색 수행에 해당하는 보상은, 보호자 단말기가 일정한 금액을 입력한 금액에 대한 보상일 수 있으나, 타인 단말기가 반려동물 보호 요청 정보를 수신받은 시점부터 반려동물이 보호되고 있음을 나타내 는 보호 완료 정보가 생성되기까지의 시간 및 이동 거리 중 적어도 하나를 기반으로 보상 금액이 책정된 보상일 수 있다. 도 4는 도 1의 반려동물 디바이스에 저장되는 반려동물 등록 정보를 생성하는 방법을 보여주는 예시적인 도면이 다. 먼저, 보호자는 반려동물 디바이스의 반려동물 등록 정보(IR)를 생성하기 위하여 관리 서버로 보호자 의 본인 인증을 수행하는 본인 인증 수행단계(S210)가 수행된다. 본인 인증 수행 단계(S210)에서, 보호자는 보호자 단말기 또는 별도의 통신망과 연결된 전자 디바이스를 이용하여 반려동물 디바이스의 등록 정보(IR)를 생성하기 위한 본인 인증을 수행할 수 있다. 이때, 보호자는 본인 인증 여부를 확인받기 위하여, 주민등록번호, 전화번호 등 보호자 개인을 특정할 수 있는 개인 정보를 입력하고, 관리 서버는 보호자가 입력한 내용을 바탕으로 보호자의 본인 인증을 수행할 수 있다. 그 다음, 관리 서버가 반려동물 디바이스의 반려동물 등록 정보(IR)를 생성하기 위한 요청 정보를 보 호자에게 제공하고, 보호자가 상기 요청 정보를 기반으로 반려동물 디바이스를 착용하고 있는 반려동물 기 본 정보(IAA)를 입력하는 반려동물 정보 입력 단계(S220)를 수행할 수 있다. 이때, 반려동물 정보 입력 단계(S220)에서, 보호자는 보호자 단말기 또는 별도의 통신망과 연결된 전자 디 바이스를 이용하여 반려동물 기본 정보(IAA)는 반려동물 이름, 반려동물 성별, 반려동물 견종, 반려동물 중성화 여부 및 주인 정보 중 적어도 하나를 입력할 수 있다. 그 다음, 보호자가 반려동물 디바이스에 포함될 RFID부의 외형을 선택하는 외장칩 선택 단계(S230)가 수행된다. 이때, 관리 서버는 기 저장된 RFID부 모델의 샘플을 보호자에게 제공할 수 있으며, 보호자는 보호자 단말기 또는 별도의 통신망과 연결된 전자 디바이스를 이용하여 반려동물 디바이스에 포함되는 RFID 부의 외형을 선택할 수 있다. 그 다음, 보호자가 RFID부의 외형 및 반려동물의 등록 정보 입력을 완료하는 등록 정보 입력 완료 단계 (S240)가 수행된다. 등록 정보 입력 완료 단계(S240)가 완료되면, 관리 서버는 공공기관의 행정 절차에 의해 반려동물의 등록 번호가 부여되는 예상 시간을 보호자에게 제공할 수 있다. 이후, 보호자는 반려동물의 기본 정보를 기초로 생성 된 등록 정보(IR)를 RFID부에 저장하여, RFID부를 포함하는 반려동물 디바이스를 공공기관, 반려동물 디바 이스 제조자 또는 반려동물 디바이스 판매자로부터 제공받을 수 있다. 이때, RFID부에 저장되는 등록 정보(IR)는 반려동물의 고유 번호인 등록번호를 포함하며, 이외에 반려동물 이름, 반려동물 견종, 반려동물 성별, 반려동물 중성화 여부 및 주인 정보 중 적어도 하나를 추가적으로 포함할 수 있다. 도 5는 도 1의 보호자 단말기에서 보호자 설정 화면의 유저 인터페이스를 보여주는 예시적인 도면이다. 먼저, 도 5(a)를 참조하면, 보호자 단말기는 보호자의 고유 정보(IU)를 관리 서버에 송신하고, 관리 서버는 수신받은 고유 정보(IU)에 매핑되는 등록 정보(IR)에 해당하는 반려동물 정보(IA)를 보호자 단말기 에 제공할 수 있다. 이때, 보호자 단말기는 반려동물 디바이스를 착용한 반려동물의 반려동물 정보(IA)를 제1 표시 영역 에 출력할 수 있다. 제1 표시 영역에는 반려동물의 이름, 반려동물 사진 등과 같은 반려동물 속성정보인 반려동물 기본 정보 (IAA) 및 반려동물의 메디컬 정보(IAM) 중 적어도 하나를 포함하는 반려동물 정보(IA)가 출력될 수 있다. 보호자 단말기의 제1 표시 영역에 반려동물 정보(IA)를 출력함으로써, 보호자는 반려동물 디바이스 를 착용하고 있는 반려동물의 속성 정보인 반려동물 기본 정보(IAA)의 확인과 함께, 반려동물의 메디컬 정 보(IAM)를 기초로 반려동물의 건강 상태 및 접종 일정관리 등을 실시간으로 확인할 수 있다. 제2 표시 영역에는 사용자의 선택 동작에 의하여 반려동물 디바이스를 착용하고 있는 반려동물 정보 (IA)의 공유 여부를 설정하기 위한 공유 설정 옵션, 타인 단말기로부터 반려동물 정보(IA)를 수신받기 위한 알림 설정 옵션, 반려동물 실종 시 반려동물 정보(IA)를 공유하기 위한 모바일 전단지(IL)를 생성하기 위한 공유 정보 생성 버튼 중 적어도 하나가 출력될 수 있다. 이때, 상기 공유 설정 옵션은 반려정보 디바이스의 위치 정보를 공유하는 위치 정보 공유 또는 반려동물 실종 시, 타인 단말기에 보호자 음성 정보(IV)를 타인 단말기로의 공유 여부를 설정하는 옵션을 포함할 수 있다. 제2 표시 영역에 공유 설정 옵션, 알림 설정 옵션 및 공유 정보 생성 버튼 중 적어도 하나가 출력되어, 보 호자 단말기 및 타인 단말기간의 위치 공유 및 다양한 정보의 공유 설정이 가능할 수 있다. 도 5(b)를 참조하면, 보호자 단말기는 사용자 인터페이스를 통하여 보호자의 음성 정보인 보호자 음성 정 보(IV)를 생성할 수 있다. 보호자 단말기는 생성된 음성정보를 모바일 전단지에 포함하여, 타인 단말기로 모바일 전단지(IL)를 제공할 수 있다. 이때, 보호자 단말기로부터 생성된 보호자 음성 정보(IV)를 관리 서버에 송신하고, 관리 서버는 반려동물 보호자의 고유 정보(IU)와 매핑된 등록 정보(IR)를 기초로 보호자 음성 정보(IV)를 저장할 수 있다. 도 6은 도 1의 타인 단말기에서 반려동물 정보 및 모바일 전단지가 출력된 유저 인터페이스를 보여주는 예시적 인 도면이다. 먼저 도 6(a)를 참조하자면, 타인 단말기는 관리 서버로부터 반려동물 정보를 수신받아 출력할 수 있다. 상세하게는, 타인 단말기는 반려동물이 착용하고 있는 반려동물 디바이스의 식별코드부를 촬영 하고, 식별코드부로부터 판독된 상기 식별 정보를 기반으로 관리 서버로부터 반려동물 디바이스(10 0)를 착용하고 있는 반려동물의 반려동물 정보를 수신받을 수 있다. 반려동물 정보는 보호자 단말기에 의해 생성되는, 상기 반려동물의 속성 정보인 반려동물 기본 정보 (IAA), 반려동물 디바이스를 착용하고 있는 상기 반려동물의 메디컬 정보(IAM) 및 상기 반려동물 보호자의 연락처 정보인 보호자 정보(IAC) 중 적어도 하나를 표시할 수 있다. 타인 단말기가 수신된 반려동물 정보를 출력하여 타인 단말기를 사용하는 사용자는 반려동물 디 바이스를 착용하고 있는 반려동물의 반려동물 정보를 확인할 수 있으며, 반려동물 실종 시, 타인 단 말기를 사용하는 사용자로부터 반려동물 디바이스를 착용하고 있는 반려동물의 보호 및 반려동물의 보호자로 올바른 인계가 가능할 수 있다. 도 6(b)를 참조하면, 타인 단말기는 관리 서버로부터 모바일 전단지를 수신받아 출력할 수 있다. 이때, 모바일 전단지는 보호자 단말기로부터 반려동물 디바이스를 착용하고 있는 반려동물의 탐 색을 요청하는 정보로써, 모바일 전단지는 보호자의 고유 정보(IU)와 매핑된 반려동물 디바이스의 등록 정 보(IR)를 기초로 생성된다. 이때, 모바일 전단지는 반려동물 정보 및 반려동물 디바이스를 착용하고 있는 반려동물의 실종 된 상황을 나타내는 정보인 실종 정보를 포함할 수 있다. 예시적으로, 실종 정보는 \"2021년 11월 2일 강원도 원주시 문막 저수지 인근, 실종당시 빨간 하네스 착용/ 방울 달려있음\"과 같이, 반려동물을 실종한 시간, 반려동물이 실종된 장소, 실종된 상황에서의 반려동물의 착의 정보 중 적어도 하나를 포함할 수 있다. 도 7은 도 1의 타인 단말기에서 위치정보공개가 승인된 반려동물 디바이스의 위치 정보가 표시되는 유저 인터페 이스를 보여주는 예시적인 도면이다. 도 8은 도 1의 타인 단말기에서 위치정보공개가 승인된 반려동물 디바이스 및 실종된 상태의 반려동물 디바이스 의 위치 정보가 표시되는 유저 인터페이스를 보여주는 예시적인 도면이다. 먼저, 도 7을 참조하면, 지리 정보가 출력되는 타인 단말기의 화면 상에 타인 단말기의 위치에서 감 지되는 반려동물 디바이스(721, 722, 723)의 위치 정보가 표시될 수 있다. 상세하게는, 타인 단말기는 반려동물 디바이스(721, 722, 723)로부터 비콘 위치 신호(SL)를 수신받고, 비 콘 위치 신호(SL) 및 타인 단말기의 위치 정보를 기반으로 반려동물 디바이스(721, 722, 723)의 위치 정보 를 생성하고, 상기 비콘 신호에 포함된 등록 정보(IR)에 기초하여 반려동물 디바이스(721, 722, 723)의 위치 정 보를 관리 서버로 송신할 수 있다.이때, 관리 서버는 타인 단말기로부터 등록 정보(IR)에 기초한 반려동물 디바이스(721, 722, 723)의 위치 정보를 수신받고, 등록 정보(IR)를 기반으로 반려동물 디바이스(721, 722, 723)의 위치정보 공개여부 정보 (IAP)를 결정하며, 위치정보 공개여부 정보(IAP)가, 기설정된 등록된 타인 단말기에만 공개일 경우, 타인 단 말기가 상기 기설정된 등록된 타인 단말기인지를 판단하고, 반려동물 디바이스(721, 722, 723)의 상기 위 치정보 공개여부 정보(IAP)가 전체 공개 또는 타인 단말기가 상기 기설정된 등록된 타인 단말기일 경우, 타인 단말기에 반려동물 디바이스(721, 722, 723)의 위치정보공개를 승인하고, 상기 반려동물 디바 이스의 상기 위치정보 공개여부 정보(IAP)가 비공개 또는 타인 단말기가 상기 기설정된 등록된 타인 단 말기가 아닐 경우, 타인 단말기에 상기 반려동물 디바이스의 위치정보공개를 미승인할 수 있다. 본 실시예에서는 관리 서버가 등록 정보(IR)에 기초한 반려동물 위치 정보를 타인 단말기로부터 수신 받는 구성이나 이에 한정하지 않고, 관리 서버가 반려동물 디바이스(721, 722, 723)의 비콘 신호에 포함된 등록 정보(IR)만을 타인 단말기로부터 수신받아, 등록 정보(IR) 및 반려동물 디바이스(721, 722, 723)의 위치정보 공개여부 정보(IAP)를 기반으로 타인 단말기의 위치정보공개 승인여부를 판단하여, 타인 단말기 에 위치정보공개가 승인된 반려동물 디바이스(721, 722, 723)의 위치 정보만을 표시할 수 있다. 본 발명의 다른 실시예로, 보호자 단말기는 관리 서버로부터 이벤트 행사와 관련한 시간 정보를 포함 하는 이벤트 정보(IE)를 수신받고, 상기 이벤트 정보(IE)를 기반으로 보호자 단말기와 연동된 반려동물 디 바이스를 착용하고 있는 반려동물의 참여를 수락하는 참여 정보(IEA)를 입력받아 관리 서버에 상기 참여 정 보(IEA)를 송신하며, 관리 서버는, 이벤트 정보(IE) 및 참여 정보(IEA)를 기반으로 상기 반려동물 디바이스 의 위치정보 공개여부 정보(IAP)를 전체 공개로 조정할 수 있다. 이때, 이벤트 정보(IE)는 관리 서버에서 수신 받을 수 있으나, 별도의 이벤트 정보(IE)를 저장하는 서버 또 는 디바이스로부터 수신받은 정보일 수 있다. 이벤트 정보(IE)는 이벤트 행사명, 이벤트 행사의 시간 정보, 이벤트 행사의 위치 정보 등 이벤트 행사와 관련된 정보를 포함할 수 있다. 보호자 단말기는, 이벤트 정보(IE)를 기반으로 반려동물 디바이스를 착용하고 있는 반려동물의 참여를 수락 하는 참여 정보(IEA)를 입력 및 생성하여 관리 서버로 송신할 수 있다. 예시적으로, 이벤트 행사와 관련한 이벤트 정보(IE)가 \"2021 한국 반려동물 박람회, 10:00~12:00, 경기도 고양 시 일산서구 킨텍스로 217-60\"를 포함하는 정보를 수신받을 경우, 보호자 단말기를 이용하는 보호자는 이벤트 행사의 시간 정보(10:00~12:00)를 기반으로 해당 이벤트 행사에 참여하고자 하는 시간을 조정(11:00~12:00)하여 반려동물의 참여를 수락하여 참여 정보(IEA)를 생성하고, 참여 정보(IEA)를 관리 서버로 송신할 수 있다. 관리 서버는 참여 정보(IEA)를 기반으로 보호자 단말기가 \"2021 한국 반려동물 박람회, 11:00~12:00, 경기도 고양시 일산서구 킨텍스로 217-60\"에 해당하는 이벤트 참여됨을 파악하고, 참여 정보(IEA) 및 이벤트 행 사명, 이벤트 행사와 관련한 시간 정보 및 위치 정보 중 적어도 하나를 포함하는 이벤트 정보(IE)를 기반으로 상 기 반려동물 디바이스의 위치정보 공개여부 정보(IAP)를 전체 공개로 조정할 수 있다. 예시적으로, 보호자 단말기의 위치 정보가 \"경기도 고양시 일산서구 킨텍스로 217-60\"의 반경 내에 존재할 경우, 이벤트 행사에 참여하는 11:00~12:00 의 시간 동안 반려동물 디바이스의 위치 정보(PIA)를 공개할 수 있 으며, 이벤트 행사가 종료된 후, 반려동물 디바이스의 위치정보 공개여부 정보(IAP)는 위치정보 공개여부 정보 (IAP)가 조정되기 이전으로 되돌릴 수 있다. 보호자 단말기가 이벤트 행사의 참여 정보(IEA)를 기반으로 보호자 단말기와 연동되는 반려동물 디바 이스의 위치정보 공개여부 정보(IAP)를 조정함으로써, 반려동물 디바이스(721, 722, 723)를 이용하는 사용자의 위치 정보 파악이 가능하고, 직접적인 만남을 통해 반려동물 디바이스(721, 722, 723)의 사용자와의 정보 공유가 보다 원활해질 수 있는 효과가 있다. 도 8을 참조하면, 관리 서버는 타인 단말기로부터 수신받은 상기 반려동물 디바이스(821, 822, 823, 830)의 등록 정보(IR)가 실종 리스트(IRL) 상의 등록 정보(IR)와 일치할 경우, 타인 단말기에 실종 리스트 (IRL) 상의 등록 정보(IR)와 일치하는 반려동물 디바이스의 위치정보공개를 승인하고, 타인 단말기는, 관리 서버로부터 실종 리스트(IRL) 상의 등록 정보(IR)와 일치하는 반려동물 디바이스의 위치 정보를 타인 단말기의 화면의 지리 정보 상에 표시할 수 있다. 이때, 실종 리스트(IRL) 상의 등록 정보(IR)와 일치하는 반려동물 디바이스, 즉, 실종된 반려동물이 착용하 고 있는 실종된 반려동물 디바이스를 쉽게 추적하기 위하여 타인 단말기로 찾기 보조 정보(AI)가 제 공될 수 있다. 찾기 보조 정보(AI)는 실종된 반려동물 디바이스의 위치 정보를 지리 정보 상에 긴급 상황 또는 실종 상태임을 알리는 별도의 아이콘 또는 알람으로 표시할 수 있다. 본 발명의 다른 실시예에서는, 타인 단말기는 실종된 반려동물 디바이스의 위치 정보를 증강 현실 상 으로 표시할 수 있다. 타인 단말기는 출력되는 증강 현실 상에 타인 단말기의 위치 정보로부터 실종된 반려동물 디바이스 가 마지막으로 검출된 위치 정보까지의 경로 안내 정보 및 방향 정보를 함께 제공하여 타인 단말기를 소지하고 있는 사용자로 하여금 신속하게 쉽게 반려동물 디바이스의 추적을 수행할 수 있다. 이때, 타인 단말기는 관리서버로부터 실종된 반려동물 디바이스의 위치 정보 이력인 이동 경로 정보를 수신 받아, 상기 이동 경로 정보를 증강 현실 상에 표시할 수 있다. 예시적으로, 상기 이동 경로 정보는 실종된 반려동물 디바이스가 감지된 위치 정보에 해당하는 \"남원로 442번길, 세븐일레븐 원주구곡점 앞에서 포착\"과 같이 건물 또는 도로 정보 중 적어도 하나를 포함할 수 있다. 관리 서버가 건물 또는 도로 정보 중 적어도 하나를 제공함에 따라, 단순하게 포착되는 위치 정보만을 제 공하는 것이 아니라 보호자 단말기 또는 타인 단말기로 보조적인 정보를 제공할 수 있어, 실종된 반 려동물을 수색하는데 용이한 효과가 있다. 또한, 실종된 반려동물 디바이스의 위치 정보 및 시간정보를 포함하는 타임라인 정보를 증강현실(AR)에 반 영함으로써, 반려동물의 움직임에 추적이 용이해지는 장점이 있다. 이상에서 설명된 실시예들은 본 발명의 구성요소들과 특징들이 소정 형태로 결합된 것들이다. 각 구성요소 또는 특징은 별도의 명시적 언급이 없는 한 선택적인 것으로 고려되어야 한다. 각 구성요소 또는 특징은 다른 구성요 소나 특징과 결합되지 않은 형태로 실시될 수 있다. 또한, 일부 구성요소들 및/또는 특징들을 결합하여 본 발명 의 실시예를 구성하는 것도 가능하다. 본 발명의 실시예들에서 설명되는 동작들의 순서는 변경될 수 있다. 어느 실시예의 일부 구성이나 특징은 다른 실시예에 포함될 수 있고, 또는 다른 실시예의 대응하는 구성 또는 특징과 교체될 수 있다. 특허청구범위에서 명시적인 인용 관계가 있지 않은 청구항들을 결합하여 실시예를 구성하거나 출원 후의 보정에 의해 새로운 청구항으로 포함시킬 수 있음은 자명하다. 본 발명에 따른 실시예는 다양한 수단, 예를 들어, 하드웨어, 펌웨어(firmware), 소프트웨어 또는 그것들의 결 합 등에 의해 구현될 수 있다. 하드웨어에 의한 구현의 경우, 본 발명의 일 실시예는 하나 또는 그 이상의 ASICs(application specific integrated circuits), DSPs(digital signal processors), DSPDs(digital signal processing devices), PLDs(programmable logic devices), FPGAs(field programmable gate arrays), 프로세서, 콘트롤러, 마이크로 콘트롤러, 마이크로 프로세서 등에 의해 구현될 수 있다. 펌웨어나 소프트웨어에 의한 구현의 경우, 본 발명의 일 실시예는 이상에서 설명된 기능 또는 동작들을 수행하 는 모듈, 절차, 함수 등의 형태로 구현될 수 있다. 소프트웨어 코드는 메모리에 저장되어 프로세서에 의해 구동 될 수 있다. 상기 메모리는 상기 프로세서 내부 또는 외부에 위치하여, 이미 공지된 다양한 수단에 의해 상기 프로세서와 데이터를 주고 받을 수 있다. 본 발명은 본 발명의 필수적 특징을 벗어나지 않는 범위에서 다른 특정한 형태로 구체화될 수 있음은 당업자에 게 자명하다. 따라서, 상술한 상세한 설명은 모든 면에서 제한적으로 해석되어서는 아니 되고 예시적인 것으로 고려되어야 한다. 본 발명의 범위는 첨부된 청구항의 합리적 해석에 의해 결정되어야 하고, 본 발명의 등가적 범위 내에서의 모든 변경은 본 발명의 범위에 포함된다.부호의 설명 1 : 반려동물 관리 시스템 100 : 반려동물 디바이스 110 : RFID부 120 : 통신부 130 : 알림부 140 : 센서부 150 : 식별코드부 160 : 탈취부 170 : 밴드부 200 : 보호자 단말기 300 : 관리 서버 400 : 타인 단말기"}
{"patent_id": "10-2021-0165789", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 반려동물 관리 시스템을 보여주는 도면이다. 도 2는 도 1의 반려동물 관리 시스템의 반려동물 디바이스의 구성을 개략적으로 도시한 블록도이다. 도 3은 도 1의 반려동물 관리 시스템에 의한 반려동물 관리 방법을 도시한 순서도이다. 도 4는 도 1의 반려동물 디바이스에 저장되는 반려동물 등록 정보를 생성하는 방법을 보여주는 예시적인 도면이 다. 도 5는 도 1의 보호자 단말기에서 보호자 설정 화면의 유저 인터페이스를 보여주는 예시적인 도면이다. 도 6은 도 1의 타인 단말기에서 반려동물 정보 및 모바일 전단지가 출력된 유저 인터페이스를 보여주는 예시적 인 도면이다. 도 7은 도 1의 타인 단말기에서 위치정보공개가 승인된 반려동물 디바이스의 위치 정보가 표시되는 유저 인터페 이스를 보여주는 예시적인 도면이다. 도 8은 도 1의 타인 단말기에서 위치정보공개가 승인된 반려동물 디바이스 및 실종된 상태의 반려동물 디바이스의 위치 정보가 표시되는 유저 인터페이스를 보여주는 예시적인 도면이다."}
