{"patent_id": "10-2023-0063824", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0166244", "출원번호": "10-2023-0063824", "발명의 명칭": "인공 신경망 모델의 학습 도메인을 고려한 캘리브레이션 데이터셋 생성 및 이를 이용한 인공", "출원인": "주식회사 사피온코리아", "발명자": "이채운"}}
{"patent_id": "10-2023-0063824", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "컴퓨터 구현 방법으로서,인공 신경망 모델의 태스크와 연관된 태스크-특정 단어 풀(task-specific word pool)을 기반으로, 텍스트 프롬프트(text prompt)를 생성하는 과정; 및상기 텍스트 프롬프트를 사전 훈련된 이미지 생성모델에 입력하여, 상기 인공 신경망 모델의 최적화를 위한 캘리브레이션 데이터셋을 획득하는 과정을 포함하는, 방법."}
{"patent_id": "10-2023-0063824", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 캘리브레이션 데이터셋을 기반으로 상기 인공 신경망 모델에 대한 학습 후 양자화(PTQ; Post TrainingQuantization)를 수행하는 과정을 더 포함하는, 방법."}
{"patent_id": "10-2023-0063824", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 캘리브레이션 데이터셋을 기반으로 상기 인공 신경망 모델에 대한 가지치기(pruning)를 수행하는 과정을 포함하는, 방법."}
{"patent_id": "10-2023-0063824", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 텍스트 프롬프트는, 상기 태스크-특정 단어 풀에서 선택된 적어도 하나의 단어에 대해 사전에 정의된 규칙을 적용하여 생성되는, 방법."}
{"patent_id": "10-2023-0063824", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 인공 신경망 모델의 태스크는, 기정의된 클래스 집합을 기반으로 입력 이미지에 포함된 객체의 클래스를분류하는 분류 태스크이고,상기 태스크-특정 단어 풀은, 상기 기정의된 클래스 집합을 구성하는 복수개의 클래스들 각각의 라벨(label)을포함하는, 방법."}
{"patent_id": "10-2023-0063824", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 텍스트 프롬프트를 생성하는 과정은,상기 태스크-특정 단어 풀에서 하나 이상의 라벨을 무작위로 선택하는 과정; 및상기 선택된 하나 이상의 라벨을 이용하여, 상기 하나 이상의 라벨에 각각 대응하는 하나 이상의 객체를 포함하는 이미지를 서술하는 텍스트 프롬프트를 생성하는 과정을 포함하는, 방법. 공개특허 10-2024-0166244-3-청구항 7 제6항에 있어서,상기 텍스트 프롬프트는,상기 이미지의 유형을 나타내는 제1 단어 조합, 상기 태스크-특정 단어 풀에서 선택된 하나 이상의 라벨들, 및각 라벨을 수식하는 하나 이상의 제2 단어 조합을 포함하고,상기 제1 단어 조합 및 상기 하나 이상의 제2 단어 조합의 각각은, 하나 이상의 단어들을 포함하는, 방법."}
{"patent_id": "10-2023-0063824", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서,상기 텍스트 프롬프트는,상기 이미지의 유형을 나타내는 제1 단어 조합, 상기 태스크-특정 단어 풀에서 선택된 복수개의 라벨들, 및 상기 복수개의 라벨들을 동시에 수식하는 제2 단어 조합을 포함하고, 상기 제1 단어 조합 및 상기 제2 단어 조합은, 하나 이상의 단어들을 포함하는, 방법."}
{"patent_id": "10-2023-0063824", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 인공 신경망 모델의 태스크는, 기정의된 클래스 집합을 기반으로 입력 이미지를 복수개의 영역으로 분할하는 세그멘테이션 태스크이고,상기 태스크-특정 단어 풀은, 상기 기정의된 클래스 집합을 구성하는 복수개의 클래스들 각각의 라벨(label)을포함하는, 방법."}
{"patent_id": "10-2023-0063824", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 텍스트 프롬프트를 생성하는 과정은,상기 태스크-특정 단어 풀에서 하나의 라벨을 무작위로 선택하는 과정; 및상기 선택된 라벨을 이용하여, 동일한 클래스에 대응하는 복수개의 객체들의 동작 또는 상태를 서술하는 텍스트프롬프트를 생성하는 과정을 포함하는, 방법."}
{"patent_id": "10-2023-0063824", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항에 있어서,상기 텍스트 프롬프트는,상기 태스크-특정 단어 풀에서 선택된 라벨의 복수형 표현, 및 상기 선택된 라벨과 연관된 부대상황을 서술하는구 또는 절을 포함하는, 방법."}
{"patent_id": "10-2023-0063824", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1항에 있어서,상기 획득하는 과정은,상기 텍스트 프롬프트를 생성하는 과정을 복수번 수행하여 획득된 복수개의 텍스트 프롬프트들을 각각 상기 이미지 생성모델에 입력하고, 각 텍스트 프롬프트에 대응하여 상기 이미지 생성모델이 출력하는 합성 이미지를 수집하여 상기 캘리브레이션 데이터셋을 구성하는 과정을 포함하는, 방법.공개특허 10-2024-0166244-4-청구항 13 인공 신경망 모델의 최적화를 위한 장치로서,상기 인공 신경망 모델의 태스크와 연관된 태스크-특정 단어 풀을 기반으로, 텍스트 프롬프트를 생성하는 텍스트 생성모듈; 및상기 텍스트 프롬프트를 사전 훈련된 이미지 생성모델에 입력하여, 상기 인공 신경망 모델의 최적화를 위한 캘리브레이션 데이터셋을 획득하는 이미지 생성모듈을 포함하는, 장치."}
{"patent_id": "10-2023-0063824", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 캘리브레이션 데이터셋을 기반으로 상기 인공 신경망 모델에 대한 학습 후 양자화, 또는 가지치기를 수행하는 최적화 모듈을 더 포함하는, 장치."}
{"patent_id": "10-2023-0063824", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제13항에 있어서,상기 텍스트 프롬프트는, 상기 태스크-특정 단어 풀에서 선택된 적어도 하나의 단어에 대해 사전에 정의된 규칙을 적용하여 생성되는, 장치."}
{"patent_id": "10-2023-0063824", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제13항에 있어서,상기 인공 신경망 모델의 태스크는, 기정의된 클래스 집합을 기반으로 입력 이미지에 포함된 객체의 클래스를분류하는 분류 태스크이고,상기 태스크-특정 단어 풀은, 상기 기정의된 클래스 집합을 구성하는 복수개의 클래스들 각각의 라벨을 포함하는, 장치."}
{"patent_id": "10-2023-0063824", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서,상기 텍스트 생성모듈은,상기 태스크-특정 단어 풀에서 하나 이상의 라벨을 무작위로 선택하고, 상기 선택된 하나 이상의 라벨을 이용하여 상기 하나 이상의 라벨에 각각 대응하는 하나 이상의 객체를 포함하는 이미지를 서술하는 텍스트 프롬프트를생성하는, 장치."}
{"patent_id": "10-2023-0063824", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제13항에 있어서,상기 인공 신경망 모델의 태스크는, 기정의된 클래스 집합을 기반으로 입력 이미지를 복수개의 영역으로 분할하는 세그멘테이션 태스크이고,상기 태스크-특정 단어 풀은, 상기 기정의된 클래스 집합을 구성하는 복수개의 클래스들 각각의 라벨(label)을포함하는, 장치."}
{"patent_id": "10-2023-0063824", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에 있어서,상기 텍스트 생성모듈은,공개특허 10-2024-0166244-5-상기 태스크-특정 단어 풀에서 하나의 라벨을 무작위로 선택하고, 상기 선택된 라벨을 이용하여, 동일한 클래스에 대응하는 복수개의 객체들의 동작 또는 상태를 서술하는 텍스트 프롬프트를 생성하는, 장치."}
{"patent_id": "10-2023-0063824", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "명령어가 저장된, 컴퓨터로 읽을 수 있는 기록매체로서, 상기 명령어는 상기 컴퓨터에 의해 실행될 때 상기 컴퓨터로 하여금, 인공 신경망 모델의 태스크와 연관된 태스크-특정 단어 풀을 기반으로, 텍스트 프롬프트를 생성하는 과정; 및상기 텍스트 프롬프트를 사전 훈련된 이미지 생성모델에 입력하여, 상기 인공 신경망 모델의 최적화를 위한 캘리브레이션 데이터셋을 획득하는 과정을 실행하도록 하는, 컴퓨터로 읽을 수 있는 기록매체."}
{"patent_id": "10-2023-0063824", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "인공 신경망 모델의 학습 도메인을 고려한 캘리브레이션 데이터셋 생성 및 이를 이용한 인공 신경망 모델의 최적 화를 위한 방법 및 장치를 개시한다. 본 개시의 일 측면에 의하면, 컴퓨터 구현 방법으로서, 사전 훈련된 인공 신경망 모델의 태스크와 연관된 태스크 -특정 단어 풀을 기반으로, 텍스트 프롬프트를 생성하는 과정; 및 상기 텍스트 프롬프트를 사전 훈련된 이미지 생성모델에 입력하여, 상기 인공 신경망 모델의 최적화를 위한 캘리브레이션 데이터셋을 획득하는 과정을 포함하 는, 방법을 제공한다."}
{"patent_id": "10-2023-0063824", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 인공 신경망 모델의 학습 도메인을 고려하여 캘리브레이션 데이터셋을 생성하고, 이를 이용하여 해당 인공 신경망 모델을 최적화하는 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2023-0063824", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "이하에 기술되는 내용은 단순히 본 실시예와 관련되는 배경 정보만을 제공할 뿐 종래기술을 구성하는 것이 아니 다. 학습 및/또는 검증 데이터에 포함된 개인 정보에 대한 이슈가 심화됨에 따라, 모델을 배포하는 주체로부터 모델 의 경량화, 개인화, 또는 다양한 다른 목적에 필요한 데이터셋을 공유받는 것이 불가능해지고 있다. 데이터셋을 확보하기 위해서, 수작업을 통해 따로 데이터를 수집하거나, 웹 크롤링(web crawling) 등을 통해 자 동으로 데이터를 수집할 수도 있다. 하지만, 이러한 방식은 결국에는 사람이 하나하나의 샘플을 모두 검증해야 하는 등 여러 노력이 필요하고, 노력에 비해 대량의 데이터를 확보하기가 어렵다. 최근에는 이에 대한 해결방안으로, 데이터셋을 별도로 확보하지 않고, 자체적으로 생성한 데이터를 이용하는 제 로-샷 양자화(zero-shot quantization)에 대한 연구가 활발히 이루어지고 있다. 그러나 해당 기법을 통해 생성 되는 데이터는, 모델의 실제 학습에 사용된 데이터처럼 실세계 도메인(real-world domain)에 있는 데이터가 아 닌, 랜덤 노이즈(random noise)에 가까운 데이터이다. 때문에, 경량화 등을 진행하는 사용자 입장에서 해당 데 이터가 현재 타겟 모델에 적합하게 구성된 데이터인지에 대한 추가적인 검증이 어렵다는 문제가 있다."}
{"patent_id": "10-2023-0063824", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는, 최적화 대상이 되는 타겟 모델에 특화된 이미지 셋을 획득하는 방법 및 장치를 제공하는 데 일 목적 이 있다. 본 발명이 해결하고자 하는 과제들은 이상에서 언급한 과제들로 제한되지 않으며, 언급되지 않은 또 다른 과제 들은 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0063824", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 측면에 의하면, 컴퓨터 구현 방법으로서, 사전 훈련된 타겟 모델의 태스크와 연관된 태스크-특정 단어 풀(task-specific word pool)을 기반으로, 텍스트 프롬프트(text prompt)를 생성하는 과정; 및 상기 텍스 트 프롬프트를 사전 훈련된 이미지 생성모델(pre-trained image generator model)에 입력하여, 상기 타겟 모델 의 최적화를 위한 캘리브레이션 데이터셋을 획득하는 과정을 포함하는, 방법을 제공한다. 본 개시의 다른 측면에 의하면, 사전 훈련된 타겟 모델의 최적화를 위한 장치로서, 상기 타겟 모델의 태스크와 연관된 태스크-특정 단어 풀을 기반으로, 텍스트 프롬프트를 생성하는 텍스트 생성모듈; 및 상기 텍스트 프롬프 트를 사전 훈련된 이미지 생성모델에 입력하여, 상기 타겟 모델의 최적화를 위한 캘리브레이션 데이터셋을 획득하는 이미지 생성모듈을 포함하는, 장치를 제공한다. 본 개시의 또 다른 측면에 의하면, 명령어가 저장된, 컴퓨터로 읽을 수 있는 기록매체로서, 상기 명령어는 상기 컴퓨터에 의해 실행될 때 상기 컴퓨터로 하여금, 사전 훈련된 타겟 모델의 태스크와 연관된 태스크-특정 단어 풀을 기반으로, 텍스트 프롬프트를 생성하는 과정; 및 상기 텍스트 프롬프트를 사전 훈련된 이미지 생성모델에 입력하여, 상기 타겟 모델의 최적화를 위한 캘리브레이션 데이터셋을 획득하는 과정을 실행하도록 하는, 컴퓨터 로 읽을 수 있는 기록매체를 제공한다."}
{"patent_id": "10-2023-0063824", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 실시예에 의하면, 수억 개의 이미지-문장 쌍으로 사전 학습된 이미지 생성모델을 활용하여, 타겟 모 델의 태스크에 특화된 대량의 이미지들을 확보할 수 있다. 확보된 이미지들은 학습 후 양자화(PTQ; Post Training Quantization) 또는 가지치기(pruning)와 같은 모델 경량화에서의, 또는 기타 다양한 목적의 응용을 위한 캘리브레이션 셋(calibration set)으로 사용될 수 있다. 본 개시의 실시예에 의하면, 데이터 프라이버시 및 저작권 등 여러 법률적 문제로부터 자유로운 이미지들을 확 보할 수 있다. 확보된 이미지들은, 배포된 모델에 대한 개인에 맞춘 최적화 등에서도 유용하게 사용될 수 있다. 본 개시의 효과들은 이상에서 언급한 효과들로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재 로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0063824", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 개시의 일부 실시예들을 예시적인 도면을 이용해 상세하게 설명한다. 각 도면의 구성 요소들에 참조 부호를 부가함에 있어서, 동일한 구성 요소들에 대해서는 비록 다른 도면 상에 표시되더라도 가능한 한 동일한 부호를 가지도록 하고 있음에 유의해야 한다. 또한, 본 개시를 설명함에 있어, 관련된 공지 구성 또는 기능에 대한 구체적인 설명이 본 개시의 요지를 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명은 생략한다. 본 개시에 따른 실시예의 구성요소를 설명하는 데 있어서, 제1, 제2, i), ii), a), b) 등의 부호를 사용할 수 있다. 이러한 부호는 그 구성요소를 다른 구성 요소와 구별하기 위한 것일 뿐, 그 부호에 의해 해당 구성요소의 본질 또는 차례나 순서 등이 한정되지 않는다. 명세서에서 어떤 부분이 어떤 구성요소를 '포함' 또는 '구비'한 다고 할 때, 이는 명시적으로 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 첨부된 도면과 함께 이하에 개시될 상세한 설명은 본 개시의 예시적인 실시형태를 설명하고자 하는 것이며, 본 개시가 실시될 수 있는 유일한 실시형태를 나타내고자 하는 것이 아니다. 도 1은 본 개시의 일 실시예에 따라 캘리브레이션 데이터 셋을 생성하고 이용하기 위한 전자 장치의 구성을 개 략적으로 나타낸 블록구성도이다. 전자 장치는 타겟 모델을 위한 캘리브레이션 데이터셋(calibration dataset, 150)을 생성하고/거나, 생 성된 캘리브레이션 데이터셋을 기초로 타겟 모델을 최적화시킬 수 있다. 전자 장치는 최적화된 모델을 이용하여 추론을 수행하고/거나, 최적화된 모델을 배포할 수 있다. 여기서, 타겟 모델은, 특정한 비전 태스크를 수행하도록 학습이 완료된, 태스크-특정 비전 모델(task- specific vision model)일 수 있다. 예를 들어, 타겟 모델은, 입력 이미지에 대해 분류 태스크(classification task), 세그멘테이션 태스크(segmentation task), 및/또는 객체 검출 태스크(object detection task)를 수행하 도록 학습된 인공 신경망 모델일 수 있다. 전자 장치는 수억 개의 이미지 및 문장 쌍으로 사전 학습된 시각-언어 모델의 이미지 생성기(Pre-trained image generator of visual language model)을 활용하여, 캘리브레이션 데이터셋을 확보할 수 있다. 여기서, 시각-언어 모델은 일반적인 사람들이 공통적으로 인지할 수 있는 영역인 시각 인식 도메인(visual recognition domain)의 합성 이미지를 생성하도록 구성될 수 있다. 본 개시에서 '이미지 생성기'라는 용어는 '이미지 생성모 델'이라는 용어와 혼용되어 사용될 수 있다. 이를 위해, 본 개시의 일 실시예에 따른 전자 장치는 단어 풀 구성모듈, 텍스트 생성모듈, 이미 지 생성모듈 및 최적화 모듈을 전부 또는 일부 포함할 수 있다. 도 1에 도시된 모든 블록이 필수 구 성요소인 것은 아니며, 다른 실시예에서 전자 장치에 포함된 일부 블록이 추가, 변경 또는 삭제될 수 있다. 한편, 도 1에 도시된 구성요소들은 기능적으로 구분되는 요소들을 나타낸 것으로서, 적어도 하나의 구성요소가 실제 물리적 환경에서는 서로 통합되는 형태로 구현될 수도 있다. 단어 풀 구성모듈은 타겟 모델이 학습한 데이터셋 도메인에 대한 정보를 기초로 태스크-특정 단어 풀 (task-specific word pool, 110)을 구성할 수 있다. 타겟 모델이 특정한 클래스 집합에 대한 태스크를 수행하도록 학습된 경우, 태스크-특정 단어 풀은 해 당 클래스 집합을 구성하는 복수개의 클래스들 각각의 라벨(label)을 포함할 수 있다. 예를 들어, 타겟 모델 이 1,000개의 클래스를 분류하는 태스크를 수행하도록 학습이 되어 있는 경우, 각 클래스에 해당하는 1,000 개의 단어(예: '강아지', '고양이' 등)가 태스크-특정 단어 풀을 1차적으로 구성하는 요소가 될 수 있다. 이를 위해, 단어 풀 구성모듈은 타겟 모델을 배포하는 서버로부터 타겟 모델이 학습한 데이터셋 도메인에 대한 정보를 포함하는 메타데이터를 수집할 수 있으나, 이러한 예시에 한정되는 것은 아니다. 텍스트 생성모듈은 태스크-특정 단어 풀을 바탕으로, 이미지 생성모델에 입력할 하나 이상의 텍스트 프롬프트(text prompt)들을 생성할 수 있다. 텍스트 생성모듈은 태스크-특정 단어 풀에서 선택된 적어도 하나의 단어에 대해 사전에 정의된 규칙 을 적용하여 하나 이상의 텍스트 프롬프트들을 생성할 수 있다. 예를 들어, 텍스트 생성모듈은 시각-언어 모델의 프롬프트 엔지니어링(prompt engineering)에서 차용한 규칙 기반(rule-based) 방식으로 하나 이상의 텍 스트 프롬프트들을 생성할 수 있다. 텍스트 프롬프트 작성 규칙은, 타겟 모델의 태스크를 고려하여 사전에 정의될 수 있다. 표 1은 분류 태스크가 목적인 모델을 위한 텍스트 프롬프트 작성규칙의 예를 보여준다. 표 1 구분 텍스트 프롬프트 작성 규칙 A(n) [IMAGE_TYPE] of a(n) [CLASS_LABEL] A(n) [high-quality/high-resolution/super realistic/detailed] [IMAGE_TYPE] of a(n) [CLASS_LABEL] A(n) [IMAGE_TYPE] of a(n) [ADJECTIVE] [CLASS_LABEL] [ADVERB] A(n) [IMAGE_TYPE] of a(n) [CLASS_LABEL]; [CLASS_DESC] 표 1의 를 참조하면, 텍스트 프롬프트는, 이미지 유형을 나타내는 단어 조합 및 클래스 라벨([CLASS_LABE L])을 포함할 수 있다. 텍스트 생성모듈은 태스크-특정 단어 풀에서 무작위로 선택된 클래스 라벨 ([CLASS_LABEL])을 텍스트 프롬프트 내의 미리 정해진 위치에 삽입할 수 있다. 이미지 유형을 나타내는 단어 조 합은, 예컨대, \"a [IMAGE_TYPE] of\"과 같이 하나 이상의 단어로 구성될 수 있다. 여기서, 이미지 유형 ([IMAGE_TYPE])은, 이미지 유형 리스트에서 무작위로 선택될 수 있다. 이미지 타입 리스트는, 예컨대, 'photo', 'illustration', 'snapshot', 'picture', 'drawing' 및 'image' 중 하나 이상의 단어들을 포함할 수 있으나, 이에 한정되는 것은 아니다. 즉, 텍스트 생성모듈은 클래스 라벨에 대응하는 객체를 포함하는 이미지를 서술하는 형식의 텍스트 프롬프 트를 생성할 수 있다. 이는, CLIP의 프롬프트 엔지니어링을 분류모델의 캘리브레이션용 이미지 합성을 위한 텍스트 프롬프트 생성으로 확장한 것이다. CLIP과 같이 멀티모달 학습(multi-modal learning)으로 학습된 이미지 분류모델의 경우, 클래스 라벨만을 제시하는 경우보다 \"a photo of a [CLASS_LABEL]\"과 같이 이미지에 포함된 물체를 인식하고자 함을 명확히 제시하는 경우에 분류 성능이 향상된다. 또한, 분류용 이미지는 대부분 이미지 한 장에 하나의 객체가 있기 때문에, 표 1의 과 같은 형식의 텍스트 프롬프트를 이용하는 것이 분류용 이미 지 생성에 도움이 될 것으로 예상된다. 표 1의 내지 를 참조하면, 텍스트 생성모듈은 생성하려는 대상에 대한 부연 설명이 추가된 텍스트 프롬프트를 생성할 수도 있다. 먼저, 표 1의 를 참조하면, 텍스트 프롬프트는, 이미지 유형([IMAGE_TYPE])을 수식하는 하나 이상의 단어 조 합들을 더 포함할 수 있다. 이미지 유형을 수식하는 단어 조합은, 미리 정의된 이미지 수식어 리스트에서 무작 위로 선택될 수 있다. 이미지 수식어 리스트는, 예컨대, 'high-quality', 'high-resolution', 'super realistic' 및 'detailed' 중 하나 이상을 포함할 수 있으나, 이에 한정되는 것은 아니다. 표 1의 을 참조하면, 텍스트 프롬프트는, 클래스 라벨([CLASS_LABEL]) 또는 선행하는 문장의 적어도 일부분 을 수식하는 하나 이상의 단어 조합들([ADJECTIVE] 및/또는 [ADVERB])을 더 포함할 수 있다. 단어 조합은, 하나 이상의 단어들로 구성되는 수식어로, 예컨대, 형용사, 부사, 형용사구, 및/또는 부사구일 수 있으나 이에 한정 되는 것은 아니다. 텍스트 생성모듈은 하나 이상의 수식어들로 구성된 수식어 풀에서 텍스트 프롬프트에 추가할 단어 조합을 추출할 수 있다. 일 예로, 텍스트 생성모듈은 서로 비교(또는 대조)될 수 있는 수식어들(예: big - small, 또는 faded - outstanding 등)을 포함하는 수식어 풀에서, 하나 이상의 수식어를 추출하여 텍스트 프롬프트 내 의 미리 정해진 위치에 삽입할 수 있다. 다른 예로, 텍스트 생성모듈은 무작위의 단어로 구성된 수식어 풀 에서 추출된 수식어를 이용하여 텍스트 프롬프트를 1차적으로 생성한 후, 언어 교정기와 같은 툴을 통해 생성된 텍스트 프롬프트를 교정할 수도 있다. 표 1의 을 참조하면, 텍스트 프롬프트는, 클래스 라벨([CLASS_LABEL])에 대한 부가 설명([CLASS_DESC])을 더 포함할 수도 있다. 부가 설명([CLASS_DESC])은 클래스 라벨([CLASS_LABEL])을 간략하게 정의하는 주석(또는 예문)을 포함할 수 있다. 예를 들어, 클래스 라벨([CLASS_LABEL])이 'hen'인 경우, 'adult female kitchen'과 같은 부가 설명([CLASS_DESC])이 추가될 수 있다. 텍스트 생성모듈은 어휘 데이터베이스(lexical database, 가령, WordNet)에서 클래스 라벨([CLASS_LABEL])에 대한 부가 설명([CLASS_DESC])을 조회할 수 있으 나, 이러한 예시에 한정되는 것은 아니다. 표 2는 표 1의 (d)에 기술된 규칙에 따라 생성된 텍스트 프롬프트들의 예를 보여준다. 표 2 구분 텍스트 프롬프트 a\"a picture of a Vulpes macrotis; small grey fox of southwestern United States; may be a subspecies of Vulpes velox\" b\"a snapshot of a Siberian husky; breed of sled dog developed in northeastern Siberia; they resemble the larger Alaskan malamutes\" c\"a picture of an English springer spaniel; a breed having typically a black-and-white coat\" d \"an image of a gazelle; small swift graceful antelope of Africa and Asia having lustrous eyes\" 한편, 텍스트 프롬프트 내의 적어도 하나의 문장 성분을 꾸며주기 위한 단어 조합을 획득하는 방식은 전술한 예 시에 한정되지 않으며, 구현예에 따라 다양한 방식이 적용될 수 있다. 텍스트 생성모듈은 데이터 증강(data augmentation)을 위해, 표 3과 같이 변형된 텍스트 프롬프트 작성 규 칙을 이용할 수도 있다. 표 3 구분 텍스트 프롬프트 작성 규칙 A(n) [IMAGE_TYPE] of a(n) [CLASS_LABEL_1] and a(an) [CLASS_LABEL_2]A(n) [high-quality/high-resolution/super realistic/detailed] [IMAGE_TYPE] of a(n) [CLASS_LABEL_1] and a(an) [CLASS_LABEL_2] A(n) [IMAGE_TYPE] of a(n) [ADJECTIVE_1] [CLASS_LABEL_1] and a(an) [ADJECTIVE_2] [CLASS_LABEL_2] [ADVERB] 표 3의 을 참조하면, 텍스트 프롬프트는, 태스크-특정 단어 풀에서 선택된 복수개의 클래스 라벨들 ([[CLASS_LABEL_1]] 및 [CLASS_LABEL_2])를 포함할 수 있다. 즉, 텍스트 생성모듈은 서로 다른 클래스 라 벨에 대응하는 복수개의 객체를 포함하는 이미지를 서술하는 형식의 텍스트 프롬프트를 생성할 수 있다. 표 3의 및 을 참조하면, 텍스트 프롬프트는, 이미지 유형([IMAGE_TYPE])을 수식하는 하나 이상의 단어 조합들 및/또는 각 라벨을 수식하는 하나 이상의 단어 조합들([ADJECTIVE_1] 및 [ADJECTIVE_2])을 더 포함할 수 도 있다. 또한, 텍스트 프롬프트는, 복수개의 라벨들을 동시에 수식하는 하나 이상의 단어 조합들([ADVERB])을 더 포함할 수도 있다. 표 3에 기술된 규칙들은, 이미지에서 두 샘플을 혼합하는 믹스업(Mixup) 알고리즘을 자연어로 구현한 형태로, 이미지 분야의 데이터 증강 알고리즘을 규칙 기반 텍스트 프롬프트에 직접적으로 구현할 수 있음을 시사한다. 한편, 표 1 또는 표 3에서 예시한 규칙들 중 2 이상이 조합되어 사용될 수도 있다. 예를 들어, 텍스트 생성모듈 은 표 3의 및 의 규칙이 조합된, \"A(n) [high-quality/high-resolution] [photo/illustration/snapshot] of a(n) [ADJECTIVE_1] [CLASS_LABEL_1] and a(n) [ADJECTIVE_1] [CLASS_LABEL_2] [ADVERB]\"과 같은 형식의 규칙을 기반으로 텍스트 프롬프트를 생성할 수도 있다. 표 4는 상술 한 규칙에 따라 생성된 텍스트 프롬프트들의 예를 보여준다. 표 4 구분 텍스트 프롬프트 a\"a super realistic drawings of a large house finch and big a silky terrier in the forest\" b \"a high-quality drawings of a large peacock and a red wine in the water\" c\"a high-quality drawings of a big barbell and a large cheeseburger in the forest\" d \"a super realistic illustration of a schooner and a small black stork\" 한편, 타겟 모델의 태스크가 분류 태스크가 아닌 세그멘테이션 태스크인 경우, 텍스트 생성모듈은 이 미지를 서술하는 형식이 아닌, 일반적인 서술적 문장 형식의 텍스트 프롬프트를 생성할 수 있다. 예를 들어, 텍 스트 생성모듈은 동일한 클래스에 대응하는 복수개의 객체들의 동작 또는 상태를 서술하는 텍스트 프롬프 트를 생성할 수 있다. 여기서, 동일한 클래스는, 태스크-특정 단어 풀에서 무작위로 선택된 특정한 라벨에 대응하는 클래스 일 수 있다. 이러한 텍스트 프롬프트 작성 규칙은, 세그멘테이션 태스크를 목적으로 모델의 경우, 여러 객체를 포함하고 객 체 이외의 주변 환경도 다양하게 찍혀 있는 이미지들을 많이 포함하는 데이터 셋을 이용하여 주로 학습되는 점 을 고려한 것이다. 표 5는 세그멘테이션 태스크가 목적인 모델을 위한 텍스트 프롬프트 작성규칙의 예를 보여준다. 표 5 구분 텍스트 프롬프트 작성 규칙 [Quantifiers] [CLASS_LABEL] [Predicate] [Quantifiers] [CLASS_LABEL] [Predicate] [Supplemental phrase/clause] 텍스트 프롬프트는 클래스 라벨의 복수형 표현을 포함할 수 있다. 예를 들어, 텍스트 프롬프트는, 클래스 라벨 ([CLASS_LABEL])을 수식하는 수량사([Quantifiers], 가령 Many)를 더 포함할 수 있다. 클래스 라벨 ([CLASS_LABEL])이 가산 명사인 경우, 텍스트 생성모듈은 어휘 데이터베이스를 참조하여 해당 클래스 라벨 ([CLASS_LABEL])에 대한 복수형 명사를 획득하고, 획득된 복수형 명사를 텍스트 프롬프트 내의 클래스 라벨 ([CLASS_LABEL])의 위치에 삽입할 수 있으나, 이러한 예시에 한정되는 것은 아니다. 객체들의 동작 또는 상태를 서술하기 위해, 텍스트 프롬프트는 서술어([Predicate]) 및/또는 보조어구/절 ([Supplemental phrase/clause])을 더 포함할 수 있다. 여기서, 보조어구/절([Supplemental phrase/clause])은 객체들과 관련된 부대상황을 서술하기 위한 문장 성분으로, 예컨대, 부사구 혹은 부사절을 포함할 수 있다. 보 조어구/절([Supplemental phrase/clause])은 이미지 생성의 다양성을 높여주기 위해 텍스트 프롬프트에 추가될 수 있다. 표 6는 표 5의 (b)에 기술된 규칙에 따라 생성된 텍스트 프롬프트들의 예를 보여준다. 표 6 구분 텍스트 프롬프트 a \"Many cars are running on the highway\" b \"Many cars are on the highway\" 이상에서는, 텍스트 생성모듈이 사전에 정의된 규칙에 기반하여 텍스트 프롬프트(들)를 생성하는 예를 설 명하였으나, 본 개시가 이에 한정되는 것은 아니다. 다른 예에서, 텍스트 생성모듈은, 신경망 기반의 사전 훈련된 언어 모델(pre-trained language model)를 이용하여 텍스트 프롬프트(들)를 획득할 수도 있다. 예컨대, 텍스트 생성모듈은 태스크-특정 단어 풀에서 하나 이상의 단어를 무작위로 선택하고, 선택된 각 단어 (또는 2 이상의 단어의 조합)를 언어 모델에 입력하여 하나 이상의 텍스트 프롬프트들을 획득할 수 있다. 이미지 생성모듈은 생성된 텍스트 프롬프트를 사전 훈련된 이미지 생성모델에 입력하여, 타겟 모델의 최적화를 위한 캘리브레이션 데이터셋을 획득할 수 있다. 여기서, 이미지 생성모델로는 공지의 DALL-E mini, DALL-E mega, DALL-E V1, DALL-E V2, Imagen 등이 채용될 수 있으나, 이러한 예시에 한정되는 것은 아니 다. 이미지 생성모듈은 하나 이상의 텍스트 프롬프트를 이미지 생성모델에 입력하여, 각 텍스트 프롬프트에 대응하는 합성 이미지를 획득할 수 있다. 텍스트 프롬프트를 이미지 생성모델에 입력하는 것은, 이미지 생성모 델을 실행하는 서버로 텍스트 프롬프트를 전송하는 것을 포함할 수 있다. 이미지 생성모듈은 이미지 생성 모델이 출력하는 합성 이미지(들)를 수집하여 캘리브레이션 데이터셋을 구성할 수 있다. 도 6a 내지 도 8b는 본 개시의 일 실시예에 따른 텍스트 프롬프트 작성규칙을 기초로 생성된 합성 이미지의 예 를 보여주는 예시도이다. 구체적으로, 도 6a 내지 도 6d는 표 2에 예시된 텍스트 프롬프트들을 이미지 생성모델 에 입력하여 획득한 합성 이미지들을 보여주고, 도 7a 내지 도 7d는 표 4에 예시된 텍스트 프롬프트들을 이미지 생성모델에 입력하여 획득한 합성 이미지들을 보여주며, 도 8a 및 도 8b는 표 6에 예시된 텍스트 프롬프트들을 이미지 생성모델에 입력하여 획득한 합성 이미지들을 보여준다. 이미지 생성모델에 입력되는 문장(즉, 텍스트 프롬프트)의 완성도가 높을수록, 타겟 모델에 더욱 적합한 이미지가 생성될 수 있다. 최적화 모듈은 캘리브레이션 데이터셋을 이용하여 타겟 모델을 최적화할 수 있다. 일 예로, 최적 화 모듈은 타겟 모델에 대한 학습 후 양자화(PTQ; Post Training Quantization)를 수행하는 과정에서, 캘리브레이션 데이터셋을 기초로 양자화 파라미터를 조정할 수 있다. 또 다른 예로, 최적화 모 듈은 타겟 모델에 대한 가지치기(pruning)를 수행하는 과정에서, 캘리브레이션 데이터셋을 기초 로 제거할 연결 가중치를 결정할 수도 있다. 이를 위해, 캘리브레이션 데이터셋을 구성하는 각 합성 이미 지에, 해당 합성이미지를 생성하기 위해 태스크-특정 단어 풀에서 추출한 단어(예컨대, 클래스 라벨)가 레 이블링되어 있을 수 있다. 다른 예로, 경량화되기 전의 모델이 캘리브레이션 데이터셋을 구성하는 각 샘플 에 대해 출력하는 값이 소프트 레이블로 이용될 수도 있다. 한편, 이상에서는 모델에 대한 최적화의 일 예로, 학습이 완료된 모델에 대한 모델 경량화를 수행하는 것으로 설명하였으나, 본 개시가 이에 한정되는 것은 아니다. 즉, 캘리브레이션 데이터셋은 다양한 응용에 활용될 수도 있다. 일 예로, 캘리브레이션 데이터셋은 소극적인 방식의 양자화를 고려한 학습(QAT; Quantization Aware Training)에 적용될 수 있다. 다른 예로, 캘리브레이션 데이터셋은, 백도어 공격을 방어할 수 있는 모델(backdoor-attack defensive model)을 구현하는 과정에서 적대적 학습(adversarial leaning)이 추가로 필 요한 경우에 사용될 수도 있다. 이하에서는, 표 7 내지 표 9를 참조하여 본 개시의 다양한 실시예에 따라 생성된 캘리브레이션 데이터셋에 대한 실험결과를 설명하도록 한다. 본 실험예에서는, 합성 이미지들이 실제로 캘리브레이션 데이터셋으로 사용될 수 있는지에 대한 검증을 위해, 캘리브레이션 데이터셋별로 인공 신경망의 양자화 결과의 테스트 정확도(test accuracy)를 비교하였다. 여기서, 양자화를 위한 캘리브레이션 방법으로는 moving min/max를 사용하였다. 본 실험예에서 양자화 대상이 되는 인공 신경망으로는 ImageNet1K 데이터셋을 기반으로 분류 태스크를 수행하도 록 학습된 ResNet 계열의 신경망을 사용하였으며, 테스트 데이터셋(test dataset)으로는 ImageNetV0과 ImageNetV2의 두가지 타입을 사용하였다. 여기서, ImageNetV0는 ISLVRC2012에서 사용된 ImageNet1K의 검증 데 이터셋(validation dataset)을 가리키고, ImageNetV2는 웹 크롤링과 기타 검수 작업에 기반하여 구성된 테스트 데이터셋이다. 본 실험예에서는 다양한 텍스트 프롬프트 작성 규칙에 따라 작성된 텍스트 프롬프트를 이미지 생성모델에 입력 하여 합성 이미지들을 생성하였다. 이하, 각 작성규칙을 기반으로 생성된 합성 이미지들로 구성된 캘리브레이션 데이터 셋을 DALLE-V0.1 내지 DALLE-V0.5으로 지칭한다. 표 7는 각 캘리브레이션 데이터셋의 생성 시에 적용된 텍스트 프롬프트 작성 규칙을 보여준다. 표 7 캘리브레이션 데이터셋이미지 생성모델 텍스트 프롬프트 작성 규칙 DALLE-V0.0DALL-E mini an illustration of [CLASS_LABEL] DALLE-V0.1 a photo of [CLASS_LABEL] DALLE-V0.2 a [high-quality/super realistic] [illustration/drawing] of [CLASS_LABEL1] and [CLASS_LABEL2] DALLE-V0.3 a [super realistic/high-resolution/detailed] [picture/image/photo/snapshot] of [CLASS_LABEL]; [CLASS_DESC] DALLE-V0.4DALL-E mega a [high-resolution/super realistic/high quality] [photo/image/picture] of [CLASS_LABEL] [ADV] DALLE-V0.5 a [high-resolution/super realistic/high quality] [photo/image/picture] of [CLASS_LABEL] [ADV]; [CLASS_DESC] 표 7에 나타나듯이, 합성 이미지를 생성을 위한 이미지 생성모델로는 공지의 DALL-E mini 모델 및 DALL-E mega 모델을 이용하였다. 구체적으로, DALLE-V0.0 내지 DALLE-V0.3의 생성에는 DALL-E mini 모델을 이용하였으며, DALLE-V0.4 및 DALLE-V0.5의 생성에는 DALL-E mini 모델에 비해 약 2배 정도 더 많은 파라미터를 가지는 DALL- E mega 모델을 이용하였다. 표 8는 표 9는 여러 타입의 캘리브레이션 데이터셋을 사용하여 ResNet 계열의 인공 신경망을 양자화한 이후, ImageNetV0과 ImageNetV2의 두가지 테스트 데이터셋에 대한 정확도를 측정한 결과를 각각 보여준다. 정확도 측 정 지표로는 Top-1 Accuracy와 Top-5 Accuracy를 이용하였다. 표 8 및 표 9에서, 각 인공 신경망마다 정확도가 가장 높은 두가지 경우를 굵은 글꼴 및 밑줄로 강조하였다.표 8"}
{"patent_id": "10-2023-0063824", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "표 9"}
{"patent_id": "10-2023-0063824", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "표 8 및 표 9에서 'FP32'는 양자화 이전 ImageNet 훈련 데이터셋(training dataset)으로 학습한 결과이고, 'uniform random'은 캘리브레이션 데이터셋의 샘플의 각 픽셀이 균등 분포(x_{i}~U(-1,1))에서 샘플링된 경우를 나타낸다. 합성 이미지들로 구축된 데이터셋인 DALLE-V0.0 내지 DALLE-V0.5에 대한 결과를 사람이 직접 검수한 데이터셋인 ImageNet V0 및 ImageNet V2에 대한 결과와 대비해 보면, 정확도가 소폭 하락하는 경우, 비슷한 정확도를 보이 는 경우, 그리고 더 높은 정확도를 보이는 경우가 다양하게 분포하는 것을 확인할 수 있다. 이는 합성 이미지가 캘리브레이션 데이터셋으로서 사용될 수 있음을 시사한다. 나아가, 텍스트 프롬프트 작성 규칙이 더 복잡하거나 다양한 꾸밈 어구들이 사용된 DALLE-V0.3 내지 DALLE-V0.5 에서, 테스트 정확도가 전반적으로 더 상승한 것을 확인할 수 있다. 도 2는 본 개시의 일 실시예에 따른 전자장치의 동작을 나타낸 흐름도이다. 도 2에 도시된 방법은, 전술한 전자 장치의 하나 이상의 구성요소의 기능이 적어도 하나의 컴퓨팅 장치에 의해 실행됨으로써 구현될 수 있다. 따라서 이하의 설명은 컴퓨팅 장치가 수행하는 동작 측면으로도 이해될 수 있다. 전자 장치는 인공 신경망 모델의 태스크와 연관된 태스크-특정 단어 풀을 기반으로, 텍스트 프롬프트를 생 성할 수 있다(S200). 여기서, 태스크-특정 단어 풀은, 인공 신경망 모델이 학습한 데이터 셋 도메인을 기초로 구성될 수 있다. 예컨대, 인공 신경망 모델이 기정의된 클래스 집합에 대해 분류 태스크 또는 세그멘테이션 태 스크를 수행하도록 학습된 경우, 태스크-특정 단어 풀은 기정의된 클래스 집합을 구성하는 복수개의 클래스들 각각의 라벨(label)들을 포함할 수 있다. 여기서, 분류 태스크는 기정의된 클래스 집합을 기반으로 입력 이미지 에 포함된 객체의 클래스를 분류하는 태스크를 의미할 수 있다. 세그멘테이션 태스크는 기정의된 클래스 집합을 기반으로 입력 이미지를 복수개의 영역으로 분할하는 태스크를 의미할 수 있다. 일 실시예에서, 전자 장치는, 태스크-특정 단어 풀에서 선택된 적어도 하나의 단어를 신경망 기반의 사전 훈련된 언어 모델(pre-trained language model)에 입력하여 텍스트 프롬프트를 획득할 수 있다. 다른 실시예에서, 전자 장치는, 태스크-특정 단어 풀에서 선택된 적어도 하나의 단어에 대해 사전에 정의된 규칙을 적용하여 텍스트 프롬프트를 생성할 수 있다. 전자 장치는 인공 신경망 모델의 태스크에 따라 다른 텍스트 프롬프트 작성 규칙을 적용할 수 있다. 인공 신경망 모델의 태스크가 분류 태스크인 경우, 전자 장치는 태스크-특정 단어 풀에서 하나 이상의 라벨 을 무작위로 선택하고, 선택된 하나 이상의 라벨을 이용하여 하나 이상의 라벨에 각각 대응하는 하나 이상의 객 체를 포함하는 이미지를 서술하는 텍스트 프롬프트를 생성할 수 있다. 텍스트 프롬프트는, 예컨대, 이미지의 유 형을 나타내는 제1 단어 조합, 태스크-특정 단어 풀에서 선택된 하나 이상의 라벨들, 및 각 라벨을 수식하는 하 나 이상의 제2 단어 조합을 포함할 수 있다. 다른 예로, 텍스트 프롬프트는, 이미지의 유형을 나타내는 제1 단 어 조합, 태스크-특정 단어 풀에서 선택된 복수개의 라벨들, 및 상기 복수개의 라벨들을 동시에 수식하는 제2 단어 조합을 포함할 수도 있다. 여기서, 제1 단어 조합 및 제2 단어 조합(들)의 각각은, 하나 이상의 단어들을 포함할 수 있다. 인공 신경망 모델의 태스크가 세그멘테이션 태스크인 경우, 전자 장치는 태스크-특정 단어 풀에서 하나의 라벨을 무작위로 선택하고, 선택된 라벨을 이용하여 동일한 클래스에 대응하는 복수개의 객체들의 동작 또는 상 태를 서술하는 텍스트 프롬프트를 생성할 수 있다. 텍스트 프롬프트는, 예컨대, 태스크-특정 단어 풀에서 선택 된 라벨의 복수형 표현, 및 선택된 라벨과 연관된 부대상황을 서술하는 구 또는 절을 포함할 수 있다. 전자 장치는 텍스트 프롬프트를 사전 훈련된 이미지 생성모델에 입력하여, 인공 신경망 모델의 최적화를 위 한 캘리브레이션 데이터셋을 획득할 수 있다(S220). 예를 들어, 전자 장치는 과정 S200을 복수번 수행하여 획득된 복수개의 텍스트 프롬프트들을 각각 이미지 생성모델에 입력하고, 각 텍스트 프롬프트에 대응하여 이미 지 생성모델이 출력하는 합성 이미지를 수집하여 캘리브레이션 데이터셋을 구성할 수 있다. 과정 S220 이후에, 전자 장치는 획득된 캘리브레이션 데이터셋을 기반으로, 인공 신경망 모델에 대한 최적 화를 수행할 수도 있다. 인공 신경망 모델에 대한 최적화는, 인공 신경망 모델의 경량화를 포함할 수 있다. 일 예로, 전자 장치는 캘리브레이션 데이터셋을 기반으로, 학습 후 양자화(PTQ; Post Training Quantizatio n)를 수행할 수 있다. 다른 예로, 전자 장치는 캘리브레이션 데이터셋을 기반으로, 가지치기(pruning)를 수 행할 수도 있다. 전자 장치는 다양한 경량화 알고리즘에 따라 인공 신경망 모델을 경량화한 이후, 캘리브레 이션 데이터를 이용하여 경량화된 모델 또는 경량화를 위한 각종 파라미터들을 보정할 수 있다. 과정 S220 이후에, 전자 장치는 획득된 캘리브레이션 데이터셋을 다른 장치에게 전송할 수도 있다. 도 3은 본 개시의 일 실시예에 따른 전자 장치를 이용하는 시스템의 동작을 나타낸 흐름도이다. 제1 서버는 학습이 완료된 인공 신경망 모델을 배포할 수 있다(S300). 제1 서버는 인공 신경망 모델에 대한 학습을 수행하는 서버일 수 있다. 전자 장치는 인공 신경망 모델에 대한 정보를 기초로, 텍스트 프롬프트(들)를 생성할 수 있다(S320). 과정 S320은 예컨대, 도 2의 과정 S200과 동일하거나 상응할 수 있다. 전자 장치는 생성된 텍스트 프롬프트(들)를 제2 서버로 전송할 수 있다(S340). 제2 서버는 이미지 생성모델을 이용한 추론을 실행하는 서버일 수 있다. 전자 장치는 API를 통해 제2 서버에게 텍스트 프 롬프트(들)를 포함하는 이미지 생성요청을 전송할 수 있다. 전자 장치는 제2 서버로부터 텍스트 프롬프트(들)를 기초로 생성된 합성 이미지(들)을 획득할 수 있다 (S350). 전자 장치는 획득된 합성 이미지(들)를 이용하여 캘리브레이션 데이터셋을 구축할 수 있다(S360). 전자 장치는 캘리브레이션 데이터셋을 이용하여 인공 신경망 모델을 최적화할 수 있다(S380). 도 4는 본 개시의 다른 실시예에 따른 전자 장치를 이용하는 시스템의 동작을 나타낸 흐름도이다. 도 4를 설명 함에 있어, 과정 S400 및 과정 S420 내지 S460은, 도 3의 과정 S300 내지 S360과 동일하거나 상응할 수 있으므 로, 중복되는 내용은 자세한 설명을 생략한다. 제1 서버는 학습이 완료된 인공 신경망 모델을 배포할 수 있다(S400). 전자 장치는 제1 서버로부터 인공 신경망 모델이 학습한 데이터셋 도메인에 대한 정보(이하, 학습 도메 인 정보)를 획득할 수 있다(S410). 예를 들어, 인공 신경망 모델이 분류 태스크 및/또는 세그멘테이션 태스크를 수행하도록 학습된 경우, 학습 도메인 정보는, 인공 신경망 모델이 분류 또는 세그멘테이션 할 수 있는 복수개 의 클래스들 각각의 라벨(label) 명을 포함할 수 있다. 전자 장치는 획득한 학습 도메인 정보를 기초로, 텍스트 프롬프트(들)를 생성할 수 있다(S420). 전자 장치는 생성된 텍스트 프롬프트(들)를 제2 서버로 전송하고, 이에 대한 응답으로 제2 서버로 부터 텍스트 프롬프트(들)를 기초로 생성된 합성 이미지(들)을 획득할 수 있다(S430 및 S440). 전자 장치는 획득된 합성 이미지(들)를 이용하여 캘리브레이션 데이터셋을 구축할 수 있다(S460). 전자 장 치는 확보된 캘리브레이션 데이터셋을 단말에게 전송할 수 있다(S470). 단말은 캘리브레이션 데이터셋을 이용하여 인공 신경망 모델을 최적화할 수 있다(S480). 즉, 본 개시의 다 른 실시예에 따르면, 인공 신경망 모델을 최적화하는 주체가 전자 장치가 아닌 단말일 수도 있다. 도 5는 본 개시가 적용될 수 있는 예시적인 컴퓨팅 장치를 개략적으로 나타낸 블록구성도이다. 도 5를 참조하면, 컴퓨팅 장치는 메모리, 프로세서, 스토리지, 입출력 인터페이스 및 통신 인터페이스 중 일부 또는 전부를 포함할 수 있다. 컴퓨팅 장치는 전자 장치의 적어도 일부를 구조적 및/또는 기능적으로 포함할 수 있다. 컴퓨팅 장치는 데스크탑 컴퓨터, 서버 및/또는 지능형 카메라 등과 같은 고정형(stationary) 컴퓨팅 장치뿐만 아니라 스마트 폰 및/또는 랩탑 컴퓨터 등과 같은 휴대용 (mobile) 컴퓨팅 장치일 수도 있다. 메모리는 프로세서로 하여금 본 발명의 일 실시예에 따른 방법(들)을 수행하도록 하는 프로그램을 저 장할 수 있다. 예를 들면, 프로그램은 프로세서에 의해서 실행 가능한(executable) 복수의 명령어들을 포 함할 수 있고, 복수의 명령어들이 프로세서에 의해서 실행됨으로써 전술한 전자 장치의 동작 수행될 수 있다. 메모리는 단일 메모리 또는 복수의 메모리들일 수 있다. 전술한 전자 장치의 동작에 필요한 정보가 단 일 메모리에 저장되거나 복수의 메모리들에 나뉘어 저장될 수 있다. 메모리가 복수의 메모리들로 구성된 경우, 복수의 메모리들은 물리적으로 분리될 수 있다. 메모리는 휘발성 메모리 및 비휘발성 메모리 중 적 어도 하나를 포함할 수 있다. 휘발성 메모리는 SRAM(Static Random Access Memory) 또는 DRAM(Dynamic Random Access Memory) 등을 포함하고, 비휘발성 메모리는 플래시 메모리(flash memory) 등을 포함한다. 프로세서는 적어도 하나의 명령어들을 실행할 수 있는 적어도 하나의 코어를 포함할 수 있다. 프로세서 는 단일 프로세서 또는 복수의 프로세서들일 수 있다. 프로세서는 메모리에 저장된 명령어들을 실행할 수 있다. 예를 들어, 프로세서는 메모리에 저장된 명령어들을 실행함으로써, 타겟 모델의 태스크와 연관된 태 스크-특정 단어 풀을 기반으로, 텍스트 프롬프트를 생성하고, 텍스트 프롬프트를 사전 훈련된 이미지 생성모델 에 입력하여, 타겟 모델의 최적화를 위한 캘리브레이션 데이터셋을 획득할 수 있다. 스토리지는 컴퓨팅 장치에 공급되는 전력이 차단되더라도 저장된 데이터를 유지할 수 있다. 예를 들면, 스토리지는 비휘발성 메모리를 포함할 수도 있고, 자기 테이프, 광학 디스크, 자기 디스크와 같은저장 매체를 포함할 수도 있다. 스토리지는 프로세서에 의해서 처리될 데이터 및 프로세서에 의해서 처리된 데이터를 저장할 수 있다. 예컨대, 스토리지는 프로세서에 의해 생성된 텍스트 프롬프트(들) 및/또는 텍스트 프롬프트(들)를 기초로 생성된 합성 이미지(들)를 저장할 수 있다. 다른 예로, 스토리지는 타겟 모델의 파 라미터들 및/또는 타겟 모델의 학습 도메인에 대한 정보를 저장할 수도 있다. 또 다른 예로, 스토리지는 타겟 모델의 태스크와 연관된 합성 이미지들을 획득하는 프로그램 및/또는 합성 이미지들을 이용하여 타겟 모델 을 최적화하는 프로그램 등을 저장할 수 있다. 스토리지에 저장된 프로그램 또는 데이터는, 프로세서(52 0)에 의해서 실행되기 이전에 메모리로 로딩될 수 있다. 스토리지는 프로그램 언어로 작성된 파일을 저장할 수 있고, 파일로부터 컴파일러 등에 의해서 생성된 프로그램은 메모리로 로딩될 수 있다. 입출력 인터페이스는 외부의 장치와의 데이터 입출력을 위한 인터페이스를 제공한다. 외부의 장치는, 키보 드, 마우스 또는 터치 인터페이스 등과 같은 입력장치 및/또는 디스플레이 등과 같은 출력 장치를 포함할 수 있 다. 사용자는 입력장치를 통해 프로세서에 의한 프로그램의 실행을 트리거하고, 출력장치를 통해 프로세서 에 의해 처리된 결과를 확인할 수 있다. 통신 인터페이스는 외부 네트워크에 대해 액세스를 제공한다. 일 예로, 컴퓨팅 장치는 통신 인터페이 스를 통해 타겟 모델을 배포하는 서버와 통신할 수 있다. 다른 예로, 컴퓨팅 장치는 통신 인터페이스 를 통해 이미지 생성모델이 실행되는 서버와 통신할 수도 있다. 또 다른 예로, 컴퓨팅 장치는 통신 인 터페이스를 통해 캘리브레이션 셋을 단말에게 전송하거나, 최적화된 모델을 배포할 수도 있다. 한편, 이상에서는 텍스트 프롬프트가 영어로 생성되는 경우를 예로 들어 설명하였으나, 본 개시가 이에 한정되 는 것은 아니다. 즉, 텍스트 프롬프트는, 이미지 생성모델이 지원하는 다양한 언어로 생성될 수 있다. 본 발명에 따른 장치 또는 방법의 각 구성요소는 하드웨어 또는 소프트웨어로 구현되거나, 하드웨어 및 소프트 웨어의 결합으로 구현될 수 있다. 또한, 각 구성요소의 기능이 소프트웨어로 구현되고 마이크로프로세서가 각 구성요소에 대응하는 소프트웨어의 기능을 실행하도록 구현될 수도 있다. 본 명세서에 설명되는 시스템들 및 기법들의 다양한 구현예들은, 디지털 전자 회로, 집적회로, FPGA(field programmable gate array), ASIC(application specific integrated circuit), 컴퓨터 하드웨어, 펌웨어, 소프 트웨어, 및/또는 이들의 조합으로 실현될 수 있다. 이러한 다양한 구현예들은 프로그래밍가능 시스템 상에서 실 행 가능한 하나 이상의 컴퓨터 프로그램들로 구현되는 것을 포함할 수 있다. 프로그래밍가능 시스템은, 저장 시 스템, 적어도 하나의 입력 디바이스, 그리고 적어도 하나의 출력 디바이스로부터 데이터 및 명령들을 수신하고 이들에게 데이터 및 명령들을 전송하도록 결합되는 적어도 하나의 프로그래밍가능 프로세서(이것은 특수 목적 프로세서일 수 있거나 혹은 범용 프로세서일 수 있음)를 포함한다. 컴퓨터 프로그램들(이것은 또한 프로그램들, 소프트웨어, 소프트웨어 애플리케이션들 혹은 코드로서 알려져 있음)은 프로그래밍가능 프로세서에 대한 명령어 들을 포함하며 \"컴퓨터가 읽을 수 있는 기록매체\"에 저장된다. 컴퓨터가 읽을 수 있는 기록매체는, 컴퓨터 시스템에 의하여 읽혀질 수 있는 데이터가 저장되는 모든 종류의 기 록장치를 포함한다. 이러한 컴퓨터가 읽을 수 있는 기록매체는 ROM, CD-ROM, 자기 테이프, 플로피디스크, 메모 리 카드, 하드 디스크, 광자기 디스크, 스토리지 디바이스 등의 비휘발성(non-volatile) 또는 비일시적인(non- transitory) 매체일 수 있으며, 또한 데이터 전송 매체(data transmission medium)와 같은 일시적인 (transitory) 매체를 더 포함할 수도 있다. 또한, 컴퓨터가 읽을 수 있는 기록매체는 네트워크로 연결된 컴퓨터 시스템에 분산되어, 분산방식으로 컴퓨터가 읽을 수 있는 코드가 저장되고 실행될 수도 있다. 본 명세서의 흐름도/타이밍도에서는 각 과정들을 순차적으로 실행하는 것으로 기재하고 있으나, 이는 본 개시의 일 실시예의 기술 사상을 예시적으로 설명한 것에 불과한 것이다. 다시 말해, 본 개시의 일 실시예가 속하는 기 술 분야에서 통상의 지식을 가진 자라면 본 개시의 일 실시예의 본질적인 특성에서 벗어나지 않는 범위에서 흐 름도/타이밍도에 기재된 순서를 변경하여 실행하거나 각 과정들 중 하나 이상의 과정을 병렬적으로 실행하는 것으로 다양하게 수정 및 변형하여 적용 가능할 것이므로, 흐름도/타이밍도는 시계열적인 순서로 한정되는 것은 아니다. 이상의 설명은 본 실시예의 기술 사상을 예시적으로 설명한 것에 불과한 것으로서, 본 실시예가 속하는 기술 분 야에서 통상의 지식을 가진 자라면 본 실시예의 본질적인 특성에서 벗어나지 않는 범위에서 다양한 수정 및 변 형이 가능할 것이다. 따라서, 본 실시예들은 본 실시예의 기술 사상을 한정하기 위한 것이 아니라 설명하기 위 한 것이고, 이러한 실시예에 의하여 본 실시예의 기술 사상의 범위가 한정되는 것은 아니다. 본 실시예의 보호범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술 사상은 본 실시예의 권리범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2023-0063824", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시예에 따라 캘리브레이션 데이터 셋을 생성하고 이용하기 위한 전자 장치의 구성을 개 략적으로 나타낸 블록구성도이다. 도 2는 본 개시의 일 실시예에 따른 전자장치의 동작을 나타낸 흐름도이다. 도 3은 본 개시의 일 실시예에 따른 전자 장치를 이용하는 시스템의 동작을 나타낸 흐름도이다. 도 4는 본 개시의 다른 실시예에 따른 전자 장치를 이용하는 시스템의 동작을 나타낸 흐름도이다. 도 5는 본 개시가 적용될 수 있는 컴퓨팅 장치를 개략적으로 나타낸 구성도이다. 도 6a 내지 도 8b는 본 개시의 일 실시예에 따른 텍스트 프롬프트 작성규칙을 기초로 생성된 합성 이미지의 예 를 보여주는 예시도이다."}
