{"patent_id": "10-2021-0151282", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0061040", "출원번호": "10-2021-0151282", "발명의 명칭": "전력선 통신 기반의 웨어러블 시스템 네트워크 구조 및 지능형 웨어러블 통신 시스템 및 방법", "출원인": "한국전자기술연구원", "발명자": "원윤재"}}
{"patent_id": "10-2021-0151282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "하나 이상의 센서와 하나 이상의 구동기 및 제어기를 포함하며, 사용자가 착용하는 웨어러블 로봇과, 상기 웨어러블 로봇과 통신하는 제1 송신부 및 제2 송신부와 외부 서버를 포함하는 지능형 웨어러블 로봇 시스템의 데이터 송수신을 위한 웨어러블 시스템 에리어 네트워크 네트워크(WSAN) 구조에 있어서, 상기 웨어러블 로봇 내의 상기 센서, 구동기 및 제어기 간의 데이터 송수신을 위한 전력선 통신 기반의 웨어러블 로봇 에리어 네트워크(WRAN) 구조와,상기 웨어러블 로봇의 데이터를 무선으로 수신하여 인터넷 망으로 상기 외부 서버로 전송하는 제1 송신부에 탑재되는 게이트웨이 프로토콜 스택을 포함하는 지능형 웨어러블 시스템 에리어 네트워크 구조."}
{"patent_id": "10-2021-0151282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 WRAN 구조는, 상기 센서 및 구동기에 탑재되는 전력선 통신을 위한 프로토콜 스택과,상기 제어기에 탑재되는 전력선 통신을 위한 프로토콜 스택 및 무선 통신용 프로토콜 스택을 포함하는 것인 지능형 웨어러블 시스템 에리어 네트워크 구조."}
{"patent_id": "10-2021-0151282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 제1 송신부는, 상기 웨어러블 로봇과 통신하기 위한 무선용 프로토콜 스택과 상기 외부 서버와 통신하기 위한 인터넷용 프로토콜 스택을 포함하는 것인 지능형 웨어러블 시스템 에리어 네트워크 구조."}
{"patent_id": "10-2021-0151282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "하나 이상의 센서와 하나 이상의 구동기 및 제어기를 포함하며, 사용자가 착용하는 웨어러블 로봇과, 상기 센서가 감지한 감지 데이터를 송신하는 제1 송신부와, 상기 감지 데이터를 수신하여 저장하고 정련하여 사용자별 정련 데이터를 생성하는 로 데이터 서버와,상기 정련 데이터를 기초로 학습을 수행하는 AI 서버와,사용자별 정련 데이터를 분류 저장 관리하는 개인화 데이터 서버와, 사용자별 정련 데이터를 기초로 각 사용자별 동작 인식과 이에 따른 개선된 맞춤형 제어 동작 모델을 생성하는동작 인식 서버와, 맞춤형 제어 동작 모델을 상기 웨어러블 로봇으로 송신하는 제2 송신부를 포함하는 지능형 웨어러블 로봇 시스템."}
{"patent_id": "10-2021-0151282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 웨어러블 로봇은, 상기 하나 이상의 센서를 통해 사용자의 의도를 파악하여 상기 하나 이상의 구동기를 통해 사용자 동작을 지원하는 것인 지능형 웨어러블 로봇 시스템."}
{"patent_id": "10-2021-0151282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2022-0061040-3-제4항에 있어서, 상기 웨어러블 로봇은,상기 구동기, 센서 및 제어기 간에 전력선 통신 방식으로 데이터를 송수신 하되, 상기 제어기가 마스터 역할을하고 상기 구동기 및 센서가 슬레이브 역할을 하는 것인 지능형 웨어러블 로봇 시스템."}
{"patent_id": "10-2021-0151282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제4항에 있어서, 상기 구동기는,동작의 구현에 이용되는 공압식 구동기와 고정상태의 유지에 이용되는 전기식 구동기를 포함하는 것인 지능형 웨어러블 로봇 시스템."}
{"patent_id": "10-2021-0151282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제4항에 있어서, 상기 센서는,사용자의 움직임을 감지하는 모션 센서 및 사용자의 생체 신호를 감지하기 위한 센서 중 적어도 하나를 포함하는 것인 지능형 웨어러블 로봇 시스템."}
{"patent_id": "10-2021-0151282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "지능형 웨어러블 로봇 시스템의 운용 방법에 있어서,웨어러블 로봇이 센서를 이용하여 감지 데이터를 수집하는 단계와,상기 감지 데이터를 클라우드 서버로 전송하는 단계와,상기 클라우드 서버가 상기 감지 데이터를 기초로 학습을 수행하여 추론엔진을 생성하는 단계와,상기 생성된 추론 엔진을 상기 웨어러블 로봇으로 전송하는 단계와,상기 웨어러블 로봇은 수신된 상기 추론 엔진을 바탕으로 현재 감지되는 감지 데이터를 통해 사용자의 의도를추론하는 단계를 포함하는 지능형 웨어러블 로봇 시스템의 운용 방법."}
{"patent_id": "10-2021-0151282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 감지 데이터를 수집하는 단계 내지 상기 추론하는 단계는 사용자의 사용에 따라 지속적으로 반복되는 것인 지능형 웨어러블 로봇 시스템의 운용 방법."}
{"patent_id": "10-2021-0151282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "하나 이상의 센서와 하나 이상의 구동기 및 제어기를 포함하며, 사용자가 착용하는 웨어러블 로봇과, 상기 웨어러블 로봇이 감지한 감지 데이터를 송신하는 제1 송신부와, 상기 감지 데이터를 수신하여 학습을 수행하고 사용자별 동작 인식과 이에 따른 개선된 맞춤형 제어 동작 모델을 생성하는 동작 인식 서버를 포함하되,상기 웨어러블 로봇의 상기 하나 이상의 센서와 하나 이상의 구동기 및 제어기는 전도성 섬유 기반의 전력선통신 방식으로 상호 데이터를 송수신하는 것인 지능형 웨어러블 로봇 시스템."}
{"patent_id": "10-2021-0151282", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "하나 이상의 센서와 하나 이상의 구동기 및 제어기를 포함하며, 사용자가 착용하는 웨어러블 로봇과, 상기 센서 가 감지한 감지 데이터를 송신하는 제1 송신부와, 상기 감지 데이터를 수신하여 저장하고 정련하여 정련 데이터 를 생성하는 로 데이터 서버와, 상기 정련 데이터를 기초로 학습을 수행하는 AI 서버와, 사용자별 정련 데이터를 분류 저장 관리하는 개인화 데이터 서버와, 사용자별 정련 데이터를 기초로 각 사용자별 동작 인식과 이에 따른 개선된 맞춤형 제어 동작 모델을 생성하는 동작 인식 서버와, 맞춤형 제어 동작 모델을 상기 웨어러블 로봇으로 송신하는 제2 송신부를 포함하는 지능형 웨어러블 로봇 시스템 및 이 시스템 내의 데이터 송수신을 위한 네트워 크 구조가 제공된다."}
{"patent_id": "10-2021-0151282", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 웨어러블 로봇에 적합한 네트워크에 관한 것이며, 또한 그 네트워크 상 웨어러블 로봇의 통신 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2021-0151282", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "로봇에 대한 연구 개발과 상용화 노력이 지속되고 있으며, 특히 하나의 주된 흐름으로서 웨어러블 로봇에 대한 연구 및 상용화에 대한 관심과 연구개발이 점점 가속화되고 있다. 연구 개발의 대부분은 인체의 일부에 구동기와 센서, 처리기를 부착 또는 착용하는 방식으로 인체 상태를 모니 터링하고 움직임을 도와주어, 주로 재활, 노동보조, 군인/경찰/경비 인력 등의 대응력 향상을 염두에 두고 진행 되고 있다. 웨어러블 로봇은 딱딱한 틀이 있고 인체의 움직임을 감지하여 주도적으로 틀을 구동하는 스켈렉톤 타입과 인체 의 힘의 일부를 보조하는 소프트 타입이 있다. 그런데, 현재의 웨어러블 로봇 연구는 각 인체 활동의 감지와 운동 보조를 위한 구동기 작동, 움직임을 고려한 기계적 구조, 단일 웨어러블 디바이스의 센서/구동기 제어에 집중되고 있어서, 제작 단계부터 개인 맞춤형으로 제작되지 않는 한 개인화가 어렵고, 또한 사전에 정해진 동작 양태와 성능에 고정되어 동작할 수밖에 없다. 또한 센서와 구동기, 제어기 간의 통신은 종래의 통신선에 의하고 있어서 착용성이 떨어지고 거동에 불편함을 초래하는 문제점이 있다."}
{"patent_id": "10-2021-0151282", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 웨어러블 로봇이 전력선 통신 기반으로 별도의 통신선 없이 센서, 구동기, 제어기 간의 통신이 원활 하게 이루어지며, 외부의 서버와도 통신할 수 있는 웨어러블 로봇 애리어 네트워크를 제공함에 그 목적이 있다. 아울러, 웨어러블 로봇이 지능화되어 이를 착용한 개인별 맞춤 동작이 가능하도록 하고, 착용 시간이 길어질 수 록 맞춤 정도가 개선될 수 있는, 지능형 웨어러블 로봇 시스템 및 그 운영방법을 제시하려는 것을 목적한다."}
{"patent_id": "10-2021-0151282", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "전술한 과제를 이루기 위하여, 하나 이상의 센서와 하나 이상의 구동기 및 제어기를 포함하며, 사용자가 착용하 는 웨어러블 로봇과, 상기 센서가 감지한 감지 데이터를 송신하는 제1 송신부와, 상기 감지 데이터를 수신하여 저장하고 정련하여 정련 데이터를 생성하는 로 데이터 서버와, 상기 정련 데이터를 기초로 학습을 수행하는 AI 서버와, 사용자별 정련 데이터를 분류 저장 관리하는 개인화 데이터 서버와, 사용자별 정련 데이터를 기초로 각 사용자별 동작 인식과 이에 따른 개선된 맞춤형 제어 동작 모델을 생성하는 동작 인식 서버와, 맞춤형 제어 동 작 모델을 상기 웨어러블 로봇으로 송신하는 제2 송신부를 포함하는 지능형 웨어러블 로봇 시스템이 제공된다. 웨어러블 로봇은 상기 하나 이상의 센서를 통해 사용자의 의도를 파악하여 상기 하나 이상의 구동기를 통해 사 용자 동작을 지원한다. 아울러 웨어러블 로봇은, 상기 구동기, 센서 및 제어기 간에 전력선 통신 방식으로 데이터를 송수신 하되, 상기 제어기가 마스터 역할을 하고 상기 구동기 및 센서가 슬레이브 역할을 한다. 구동기는, 동작의 구현에 이용되는 공압식 구동기와 고정상태의 유지에 이용되는 전기식 구동기를 포함하며, 센 서는 사용자의 움직임을 감지하는 모션 센서 및 사용자의 생체 신호를 감지하기 위한 센서 중 적어도 하나를 포 함한다. 본 발명의 다른 면에 따라, 웨어러블 로봇이 센서를 이용하여 감지 데이터를 수집하는 단계와, 상기 감지 데이 터를 클라우드 서버로 전송하는 단계와, 상기 클라우드 서버가 상기 감지 데이터를 기초로 학습을 수행하여 추 론엔진을 생성하는 단계와, 상기 생성된 추론 엔진을 상기 웨어러블 로봇으로 전송하는 단계와, 상기 웨어러블 로봇은 수신된 상기 추론 엔진을 바탕으로 현재 감지되는 감지 데이터를 통해 사용자의 의도를 추론하는 단계를 포함하는 지능형 웨어러블 로봇 시스템의 운용 방법이 제공된다. 상기 감지 데이터를 수집하는 단계 내지 상기 추론하는 단계는 사용자의 사용에 따라 지속적으로 반복되어 더 많은 학습 데이터로 더 정확한 추론이 가능하도록 진화한다. 본 발명의 또 다른 면에 따라, 하나 이상의 센서와 하나 이상의 구동기 및 제어기를 포함하며, 사용자가 착용하 는 웨어러블 로봇과, 상기 웨어러블 로봇이 감지한 감지 데이터를 송신하는 제1 송신부와, 상기 감지 데이터를 수신하여 학습을 수행하고 사용자별 동작 인식과 이에 따른 개선된 맞춤형 제어 동작 모델을 생성하는 동작 인 식 서버를 포함하되, 상기 웨어러블 로봇의 상기 하나 이상의 센서와 하나 이상의 구동기 및 제어기는 전력선통 신 방식으로 상호 데이터를 송수신하는 것인 지능형 웨어러블 로봇 시스템이 제공된다."}
{"patent_id": "10-2021-0151282", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 웨어러블 로봇이 학습을 통하여 개인별 맞춤 동작이 가능해지고, 그 맞춤 정도가 시간이 흐 름에 따라 점점 개선될 수 있으며, 여러 사용자들의 사용 분석을 통한 지속적 성능 개선이 가능한, 지능형 웨어 러블 로봇 시스템을 제공할 수 있다."}
{"patent_id": "10-2021-0151282", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 목적 및 효과는 이상에서 언급한 것으로 제한되지 않으며, 본 발명의 목적 및 효과, 그리고 그것들을 달성하기 위한 기술적 구성들은 첨부 도면과 함께 상세하게 후술되어 있는 실시예들을 참조하면 명확해질 것이다. 이하, 첨부도면을 참조하여 본 발명의 구성에 대하여 상세히 설명한다. 본 발명을 설명함에 있어서 공지 기능 또는 구성에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명을 생략한다. 또한, 본 발명은 이하에서 개시되는 실시예들에 한정되 는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있다. 이하의 각 실시예들은 본 발명의 개시가 완전하도록"}
{"patent_id": "10-2021-0151282", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "하고, 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공 되는 것이며 본 발명의 범위를 제한하고자 하는 것이 아니다. 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함\" 또는 \"구비\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 또한, 명세 서에 기재된 \"...유닛\", \"...장치\", \"...디바이스\", \"...부\" 또는 \"...모듈\", \"...수단\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어나 소프트웨어 또는 하드웨어 및 소프트웨어 의 결합으로 구현될 수 있다. 즉, 본 명세서의 '~부', '~모듈', '~수단' 등의 용어는 본 발명의 기술적 사상에 대한 이해의 증진과 설명의 편 의를 위하여 구분한 것으로서, 이러한 기능이 구현될 H/W 구성의 형태를 한정하거나 제한하는 의미로 쓰인 것은 아니다. 한편, 본 발명의 각 실시예에 있어서, 각 구성요소들, 기능 블록들 또는 수단들은 하나 또는 그 이상의 하부 구 성요소로 구성될 수 있으며, 각 구성요소들이 수행하는 전기, 전자, 기계적 기능들은 전자회로, 집적회로, ASIC(Application Specific Integrated Circuit) 등 공지된 다양한 소자들 또는 기계적 요소들로 구현될 수 있 으며, 각각 별개로 구현되거나 2 이상이 하나로 통합되어 구현될 수도 있다. 도 1은 본 발명에 따른 지능형 웨어러블 로봇 시스템의 개관도이다. 도시된 바와 같이, 시스템은 사용자가 착용하는 웨어러블 로봇, 웨어러블 로봇의 감지 데이터를 송신하는 게이트웨이 역할을 하는 제1 송신부, 감지 데이터를 수신하여 저장하고 정련하는 로 데이터 서버 , 정련 데이터를 기초로 학습을 수행하는 AI 서버, 사용자별 정련 데이터를 분류 저장 관리하는 개인화 데이터 서버, 사용자별 정련 데이터를 기초로 각 사용자별 동작 인식과 이에 따른 개선된 맞춤형 제어 동작 모델을 생성하는 동작 인식 서버, 맞춤형 제어 동작 모델을 웨어러블 로봇으로 송신하는 제2 송 신부를 포함한다. 즉, 본 발명에 따른 지능형 웨어러블 로봇 시스템은 웨어러블 로봇의 센서 데이터 및 제어 데이터를 외부의 서 버(130, 140, 150, 160)으로 전송하고 외부의 서버로부터 제어 데이터를 수신할 수 있는 모델로서, 기본적 으로는 로컬 웨어러블 로봇이 클라이언트가 되는 클라이언트 - 클라우드 서버 모델을 취하며, 제1 송신부 또는 별도의 처리기가 에지 컴퓨터로 기능하는 에지 컴퓨팅 모델을 취할 수도 있다. 즉 제1 송신부는 단순히 웨어러블 로봇으로부터의 데이터를 게이트웨이를 거쳐 서버(130, 140, 150, 160)으로 전송하는 송신기의 역할을 할 수도 있지만, 웨어러블 로봇으로부터의 데이터를 스스로 판단하여 긴급하거나 정형화된 처리가 가능한 상황이면 자체 처리를 하여 웨어러블 로봇에 필요한 지시를 하고 그 후에 서버(130, 140, 150, 160)로 웨어러블 로봇으로부터의 데이터 및 자신의 분석 결과 및 조치사항을 송 신하도록 구성될 수 있다. 감지 데이터를 수신하여 저장하고 정련하는 로 데이터 서버 및/또는 정련 데이터를 기초로 학습을 수행하 는 AI 서버는 도 1과 같이 별도의 서버로 구현될 수도 있으나 다른 서버(150, 160)에 통합되어 구현될 수 도 있다. 개인화 데이터 서버는 웨어러블 로봇에서 전달되는 감지 데이터가 어떤 사용자에 대한 감지 데이터인 지를 식별하여 사용자별 정련 데이터를 분류 저장 관리한다. 이를 위하여 각 감지데이터에는 웨어러블 로봇 의 식별자가 포함되는 것이 좋으며 하나의 웨어러블 로봇을 여러 사용자가 이용할 수도 있으므로 사 용자 식별자가 포함되면 더 좋다. 동작 인식 서버는 사용자별 정련 데이터를 기초로 각 사용자별 동작 인식과 이에 따른 개선된 맞춤형 제어 동작 모델을 생성한다. 사람에 따라 신체 각 부위의 크기나 형태가 다르고 근력이 상이하므로, 웨어러블 로봇 에 설치된 센서로부터 전송된 동작 관련 감지데이터를 분석하여 동작을 인식하고, 이를 기초로 웨어러블 로봇이 어느 동작에 얼마만큼의 보조력을 주고, 어느 동작에 지지력을 주는 것이 좋을지를 사용자별로 파 악한 후, 적절한 제어 명령을 생성하거나 제어 파라미터를 생성하여 웨어러블 로봇으로 전송한다. 제어 명령을 수시한 웨어러블 로봇은 그에 따라 내부 구동기를 동작시키거나 제어기가 동작하고, 제어 파 라미터를 수신하면 웨어러블 로봇은 구동기 및/또는 센서의 설정값이나 동작 파라미터를 업데이트 한다. 전술한 실시예에서 서버(130, 140, 150, 160)는 설명의 편의와 이해의 증진의 목적으로 각 기능과 역할을 명확 히 나타내기 위하여 네개의 서버로 구분하여 설명하였으나, 서버(130, 140, 150, 160)는 하나의 물리 서버로 통 합되어 구현되거나 둘 또는 세개의 물리 서버로 구현될 수 있음은 물론이다. 본 발명은 웨어러블 로봇과 서버(130, 140, 150, 160), 제1 송신부, 제2 송신부 간의 통신을 웨어러블 시스템 애리어 네트워크(Wearable System Area Network; WSAN)을 제안한다. 이하, 도 2를 참조하여 웨어러블 로봇 내의 데이터 전송을 위한 웨어러블 로봇 애리어 네트워크(WRAN : Wearable Robot Area Network)를 설명하고, 도 3을 참조하여 WSAN 전체의 프로토콜 스택을 설명한다. 도 2에 도시된 바와 같이, 웨어러블 로봇은 하나 이상의 센서와 하나 이상의 구동기(Actuator) 및 구동기와 센서를 제어하는 제어하는 제어기를 포함하여, 사용자의 의도를 파악하여 사용자 동작을 지원 하는데, 센서, 구동기(actuator)12), 및 제어기간의 통신은 전력선 통신 기반으로 데이터를 전송하는 WRAN에 의하여 수행된다. 센서 및 구동기는 슬레이브 역할을 하고, 제어기가 마스터 역할을 한다. 구동기는 공압식과 전기식이 있으며 공압식은 동작의 구현에 많이 이용되며, 전기식은 고정상태의 유지에 많이 이용된다. 구동기의 종류에 따라 제어 신호가 다르므로 제어기은 이를 고려하여 제어신호를 생성 및 전달한다. 센서는 누르기, 늘이기 등을 기본으로 동작을 감지하는 모션 센서가 포함되며, 그 외에도 사용자의 생체 신호를 감지하기 위한 센서도 다수 포함될 수 있다. 센서의 외피는 실리콘 재질처럼 인체 피부에 영향을 미치지 않는 연질 재료를 이용하는 것 바람직하다. 또한 구동기와 센서가 결합되어 구현될 수 있다. 통상의 웨어러블 로봇에서 센서와 구동기는 복수개가 포함될 수 있으므로 이러한 멀티센서-멀티구동 기를 유기적으로 제어하는 제어로직이 제어기 에 구현될 필요가 있다. 또한, 구동기와 센서의 역할에 따라 고전력이 필요한 구동기 또는 센서(예컨대, 많은 힘을 내야하는 구동기, 움 직임 센서 등)나 저전력이 필요한 구동기 또는 센서(예컨대, 적은 힘을 내는 정밀 구동기, 인체 미세 전류 측정 센서 등)가 다양하게 혼재할 수 있다. 따라서 웨어러블 로봇의 통신 네트워크의 구성에는 각 제어 및 구동 신호의 전력 레벨에 따라 저전력용 통신 시 스템과 고전력용 통신 시스템을 구분하여 갖추는 것이 좋다. 한편, 웨어러블 로봇의 통신 네트워크는 의복형의 경우 전도성 섬유를 흐르는 센서, 구동기, 제어기에 대 한 구동 전류를 이용하는 전력선 통신 방식을 취할 수 있다. 도 3은 WSAN의 프로토콜 스택을 도시한 도면이다. WSAN 프로토콜 스택은 웨어러블 로봇 내의 네트워크(WRAN : Wearable Robot Area Network) 프로토콜 스택 과 게이트웨이 네트워크 프로토콜 스택, 서버 네트워크 프로토콜 스택을 포함한다. WRAN에 속하는 센서/구동기/제어기는 물리계층과 MAC계층, 응용계층을 포함한다. 의복형 웨어러블 로봇의 경우 센서 및 구동기는 전도성 섬유로 제작된 의복(wearable suit)의 전력선을 이용 하여 데이터를 송수신 하므로 전력선 통신을 위한 물리계층 및 MAC계층 프로토콜 스택을 탑재한다. 제어기(11 3)는 센서 및 구동기와는 전도성 섬유 의복 상에서 전력선 통신 방식으로 통신하고, 제1 송신부 (게이트웨이)와는 무선으로 통신하므로, 전력선 통신용 프로토콜 스택과 무선 통신용 프로토콜 스택을 모 두 가지며 전력선 통신과 무선 통신과의 전환 기능을 가진다. 게이트웨이 역할을 하는 제1 송신부는 웨어러블 로봇과는 무선으로, 서버(130, 140, 150, 160)와는 인터넷 기반의 유무선 통신 방식으로 데이터를 송수신하기 때문에 제1 송신부의 통신 프토토콜 스택 은 무선용 프로토콜 스택과 인터넷용 프로토콜 스택을 포함한다. 무선용 프로토콜 스택은 물리계층 및 MAC 계층 을 포함하고, 인터넷용 프로토콜 스택은 물리 계층, 데이터링크 계층, 네트워크 계층, 전송 계층을 포함한다. 서버(130, 140, 150, 160)는 인터넷 기반의 통신을 수행하므로 서버의 통신 프로토콜 스택은 물리 계층, 데이터링크 계층, 네트워크 계층, 전송 계층을 포함한다. 본 발명에 따른 프로토콜 스택의 일반적인 기능은 종래의 OSI 7 계층에 정의된 기능을 수행하며, 특유의 특성은 아래와 같다. 도 4는 전력선 통신 방식의 물리계층 프레임의 구조를 나타낸다. 프레임 중 3 byte의 프리앰블 중 가장 앞선 8 bit의 웨이크업 시퀀스(wake-up sequence) 필드는 휴면 상태에 있 는 센서 또는 구동기를 활성 상태로 만드는 인식자가 포함된다. 즉, 전력 절감을 위하여 센서와 디바이스는 평 상시에는 휴면 상태로 있다가 웨이크업 시퀀스 필드에 포함된 인식자가 자신의 식별자와 일치하면 활성 상태로 전환하여 동작한다. 한편 본 발명에 따른 전력선 통신 시스템은 통신하는 센서 또는 구동기별로 전력을 달리한다. 즉, 전력소모가 크고 작음에 따라 통신전력도 상응하게 크고 작은 전력을 이용한다. 예컨대, 인체 영역의 통신을 위한 인체영역네트워크(Body Area Network)는 초저전력(Ultra low power)으로 통신 하고, LED와 같은 저전력 디바이스와 센서와는 저전력(Low power)으로 통신하고, 액추에이터, 디스플레이같은 디바이스에 대해서는 중전력(Medium power)으로 통신하고, 웨어러블 로봇과 같이 강한 구동력이 필요하여 구동 전력이 큰 장치는 고전력(High power)으로 통신한다. 또한 감지 센서의 경우에는 센서 종류에 따라 전송 속도를 조절한다. 예컨데 체온을 감지하는 경우에는 저속으 로, 근전도를 감지하는 경우에는 고속으로 전송 및 코딩을 한다. 따라서 통신 프레임에는 전력 구별 필드 및/또는 전송 속도 구별 필드를 더 포함하는 것이 바람직하다. 본 발명의 바람직한 일 실시예에 따르는 전력선 통신 시스템의 주파수 대역은 100khz 내외 이며, 변조는 FSK, GFSK, SFSK 등을 이용할 수 있다. 코딩 방식은 BCH 코딩이 적용 가능하다.이하, 본 발명의 지능형 웨어러블 로봇 시스템의 운용 방법에 대해 살펴본다. 예를들어, 뇌졸증 환자의 재활에 이용될 경우 재활정도에 따라서, 보조해야할 움직임이 다르며 동일한 움직임을 의도했을 때의 감지되는 근전도 신호가 다르기 때문에 보다 효과적인 재활을 위해서는 학습을 위한 인공지능 시 스템이 필요하다. 재활 이외의 운동 보조에 이용되는 경우에도, 사람마다 움직임 특성이나 체형 등이 다 달라서 동일한 방식으로 웨어러블 로봇을 제어할 수 없고, 따라서 각 사용자별 개인화가 필요하며, 따라서 학습을 위한 인공지능 시스템 이 필요하다. 본 발명에서는 감지 데이터의 수집은 웨어러블 로봇의 센서가 수행하고, 감지 데이터를 정련하여 학습 데이터를 구축하고 추론 엔진을 생성하는 것은 클라우드 서버가 수행하고, 웨어러블 로봇은 생성된 추론 엔진을 바탕으로 현재 감지되는 감지 데이트를 통해 사용자의 의도를 더 정확하게 추론하고 또한 사용자의 움직임을 더 효율적으 로 보조하거나 사용자가 목적하는 움직임을 실행한다. 학습 모델은 지속적으로 수집되는 감지 데이터를 기초로 계속 개량해 나가면서 재활의 정도에 따른 적합한 움직 임을 제공하고, 사용자별로 시간이 흐를수록 더 적합하게 개인화되는 웨어러블 로봇이 되도록 피드백 루프를 구 성한다. 정리하면, 본 발명에 따른 지능형 웨어러블 로봇 시스템은 웨어러블 로봇(추론, 각 단위별 움직임 제어) - 에지 컴퓨터(반사신경에 대응, 학습 및 즉각적 반응에 대한 제어) - 서버 (뇌에 대응, 학습 및 점진적 변화에 대한 제어)의 구성을 가진다. 에지 컴퓨터의 역할은 전술한 바와 같이 제1 송신기 또는 별도의 프로세서가 수행하거나, 웨어러블 로봇의 제어기가 수행할 수 있다. 본 발명에 따른 지능형 웨어러블 로봇 시스템의 운용례를 설명한다. 사람이 근육을 움직이는 원리는 뇌에서 근육으로 미세 전기 신호를 보내여 근육이 수축 또는 이완하도록 하는 것인데, 정상인이라면 근육의 적정 개소에 전류 감지 센서(근전도 센서)를 부착하면 뇌가 어떤 동작을 의도하지 를 파악할 수 있다. 그런데, 전술한 바와 같이 뇌졸증 환자는 뇌에서 출력하는 신호가 왜곡되어 있으며 아울러 재활의 단계별로 그 신호가 다르기 때문에, 동일한 움직임(예컨대 오른팔 굽히기)을 의도하더라도 근육에서 감지되는 근전도 신호가 각 재활 단계별로 상이할 수 있다. 따라서 AR/VR 방식의 지시 또는 치료사의 지시(오른팔 올리세요)에 따라 환자가 일으키는 근전도 신호를 감지하 고 이에 대한 데이터를 수집하여 AI 서버가 학습하고, 이를 바탕으로 웨어러블 로봇이 각 재활단계를 판단하여, 재할단계별로 감지되는 근전도 신호로 사용자 의도를 추론하여 해당 움직임을 보조하도록 동작한다. 이러한 과정이 여러 환자별로 지속적으로 이루어지면, 환자별(사용자별) 맞춤형 동작과 동일 환자에 대한 단계 별 맞춤 동작이 가능해지며, 수집되는 데이터가 많아질수록 정확도가 향상될 수 있다. 이상 몇몇 실시예를 들어 본 발명의 구성에 대하여 상세히 설명하였다. 그러나, 이는 예시에 불과한 것으로 본 발명의 기술적 사상의 범주 내에 다양한 변형과 변경이 가능함은 물론이다. 따라서, 본 발명의 권리범위는 이하 의 특허청구범위의 기재에 의하여 정해져야 할 것이다.도면 도면1 도면2 도면3 도면4"}
{"patent_id": "10-2021-0151282", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 지능형 웨어러블 로봇 시스템의 개관도. 도 2는 본 발명에 따른 웨어러블 로봇의 전력선 통신 하드웨어 구성도. 도 3은 본 발명에 따른 웨어러블 로봇 시스템의 네트워크 계층도. 도 4는 본 발명에 따른 웨어러블 로봇의 전력선 통신 물리계층 프레임 구조도."}
