{"patent_id": "10-2019-0107979", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0026743", "출원번호": "10-2019-0107979", "발명의 명칭": "엘레베이터 제어 시스템", "출원인": "영남대학교 산학협력단", "발명자": "사공준"}}
{"patent_id": "10-2019-0107979", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "의료 기관에 설치된 엘레베이터를 제어하는 시스템에 있어서,각 층에 설치되고, 엘레베이터를 대기하는 환자 또는 의료 장비를 인식하는 복수 개의 제1 카메라;각 층에 설치되고, 엘레베이터를 호출하는 호출 신호를 생성하는 복수 개의 스위치;상기 스위치 및 제1 카메라에 입력된 영상 정보에 기초하여, 호출 신호가 생성된 층으로 엘레베이터를 이동시키는 제1 모드 및 제1 카메라에 의해 환자 또는 의료 장비가 인식된 층으로 엘레베이터를 이동시키는 제2 모드로엘레베이터의 이동을 제어하되, 제2 모드로 작동 중에는 제1 모드로 작동을 허용하지 않는 제어부를 포함하는,엘레베이터 제어 시스템."}
{"patent_id": "10-2019-0107979", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 상기 제어부는, 제1 모드 작동 중 제1 카메라에 의해 환자 또는 의료 장비가 인식되면, 이후스위치에 의해 생성되는 호출 신호는 허용하지 않고, 제2 모드로 엘리베이터의 이동을 제어하는, 엘리베이터 제어 시스템."}
{"patent_id": "10-2019-0107979", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서, 엘레베이터의 모드 작동 상태를 화면에 표시하는 디스플레이부를 추가로 포함하는, 엘레베이터 제어 시스템."}
{"patent_id": "10-2019-0107979", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서, 상기 제1 카메라는 환자용 태그 또는 환자 복장을 통해 환자를 인식하는, 엘레베이터시스템."}
{"patent_id": "10-2019-0107979", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서, 상기 의료 장비는 휠체어 또는 의료 침대인, 엘레베이터 제어 시스템."}
{"patent_id": "10-2019-0107979", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서, 엘레베이터 내부에 설치되고, 환자 및 의료 장비를 인식하는 제2 카메라를 추가로 포함하고,상기 제2 카메라에 입력된 영상 정보에 기초하여, 엘레베이터 탑승 여유 공간을 판단하는 판단부를 추가로 포함하는, 엘레베이터 제어 시스템."}
{"patent_id": "10-2019-0107979", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서, 판단부에서 엘레베이터 탑승 여유 공간이 없는 것으로 판단되면, 제어부는 제1 및 제2 모드로 작동을 허용하지 않는, 엘레베이터 제어 시스템."}
{"patent_id": "10-2019-0107979", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "의료 기관에 설치된 복수 개의 엘레베이터를 제어하는 시스템에 있어서, 각 층에 설치되고, 엘레베이터를 대기하는 환자 또는 의료 장비를 인식하는 복수 개의 제1 카메라;각 층에 설치되고, 엘레베이터를 호출하는 호출 신호를 생성하는 복수 개의 스위치;상기 스위치 및 제1 카메라에 입력된 영상 정보에 기초하여, 호출 신호가 생성된 층과 가까운 층에 대기하는 엘레베이터를 이동시키는 제1 모드 및 제1 카메라에 의해 환자 또는 의료 장비가 인식된 층과 가까운 층에 대기하는 엘레베이터를 이동시키는 제2 모드로 엘레베이터의 이동을 제어하되, 제2 모드는 작동 중에는 제1 모드로 작공개특허 10-2021-0026743-2-동을 허용하지 않는 제어부를 포함하는, 엘레베이터 제어 시스템."}
{"patent_id": "10-2019-0107979", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 출원은 의료 기관에 설치된 엘레베이터를 제어하는 시스템에 있어서, 각 층에 설치되고, 엘레베이터를 대기하 는 환자 또는 의료 장비를 인식하는 복수 개의 제1 카메라; 각 층에 설치되고, 엘레베이터를 호출하는 호출 신호 를 생성하는 복수 개의 스위치; 상기 스위치 및 제1 카메라에 입력된 정보에 기초하여, 호출 신호가 생성된 층으 로 엘레베이터를 이동시키는 제1 모드 및 제1 카메라에 의해 환자 또는 의료 장비가 인식된 층으로 엘레베이터를 이동시키는 제2 모드로 엘레베이터의 이동을 제어하되, 제2 모드로 작동 중에는 제1 모드로 작동을 허용하지 않 는 제어부를 포함하는, 엘레베이터 제어 시스템을 제공한다."}
{"patent_id": "10-2019-0107979", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 출원은 엘레베이터 제어 시스템에 관한 것으로서, 보다 상세하게는, 엘레베이터의 이동 경로에 대해 우선 순 위를 두어 엘레베이터의 사용 효율을 향상시키는 엘레베이터 제어 시스템에 관한 것이다."}
{"patent_id": "10-2019-0107979", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 의료기관에 설치되는 엘레베이터는 그 수가 부족하여 환자, 의료인, 보호자, 직원 등 구분 없이 이 용하므로, 중간층에 휠체어나 환자용 침대가 대기하는 경우, 위층이나 아래층에서 이미 탑승한 인원들로 인해 환자들의 탑승이 제한되는 경우가 빈번히 발생한다. 기존 일부 의료기관에서는 환자 전용 엘레베이터를 별도로 구분하고, 엘레베이터 전용 카드를 지참한 환자들만 이 이용하도록 하여 환자들의 불편을 최소화하고자 하고 있으나, 이 또한 환자들이 이용하지 않는 시간에는 엘 레베이터가 정지되어 있어서 사용 측면에서 비효율을 초래하는 단점이 있었다."}
{"patent_id": "10-2019-0107979", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 출원은 상술한 문제점을 해결하고자 안출된 것으로, 환자 또는 의료 장비가 있는 층으로 먼저 엘레베이터가 이동하도록 엘레베이터 이동 경로의 우선 순위를 두어 엘레베이터 사용 효율을 향상시키는 엘레베이터 제어 시 스템을 제공하는데 그 목적이 있다."}
{"patent_id": "10-2019-0107979", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 출원의 일 측면에 따르면, 의료 기관에 설치된 엘레베이터를 제어하는 시스템에 있어서, 각 층에 설치되고, 엘레베이터를 대기하는 환자 또는 의료 장비를 인식하는 복수 개의 제1 카메라; 각 층에 설치되고, 엘레베이터 를 호출하는 호출 신호를 생성하는 복수 개의 스위치; 상기 스위치 및 제1 카메라에 입력된 영상 정보에 기초하 여, 호출 신호가 생성된 층으로 엘레베이터를 이동시키는 제1 모드 및 제1 카메라에 의해 환자 또는 의료 장비 가 인식된 층으로 엘레베이터를 이동시키는 제2 모드로 엘레베이터의 이동을 제어하되, 제2 모드로 작동 중에는 제1 모드로 작동을 허용하지 않는 제어부를 포함하는, 엘레베이터 제어 시스템이 제공된다."}
{"patent_id": "10-2019-0107979", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 출원의 일 실시예와 관련된 엘레베이터 제어 시스템은, 환자 또는 의료 장비를 인식하는 카메라 및 호출 신 호를 생성하는 스위치에 기초하여 각각 엘레베이터를 이동시키는 2 가지 모드를 통해 엘레베이터의 이동을 제어 함으로써, 엘레베이터의 사용 효율을 향상시키는 효과가 있다."}
{"patent_id": "10-2019-0107979", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 출원은 의료 기관에 설치된 엘레베이터를 제어하는 시스템에 관한 것이다. 상기 의료 기관은 환자가 방문하 는 기관으로서, 의원, 보건소, 병원 등이 해당한다. 이하, 첨부한 도면을 참고로 하여 본 출원의 실시예에 대하여 본 출원이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 출원은 여러가지 상이한 형태로 구현될 수 있으며 여기서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명 과 관계 없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 도 1은 본 출원에 따른 예시적인 엘레베이터 제어 시스템의 구성도이다. 도 1을 참조하면, 엘레베이터 제어 시스템은 복수 개의 제1 카메라, 복수 개의 스위치 및 제어부 를 포함한다. 상기 복수 개의 제1 카메라는 각 층에 설치되고, 엘레베이터를 대기하는 환자 또는 의료 장비를 인식한다. 상기 제1 카메라는 사물 또는 사람을 인식하는 인공 지능 카메라로서, 엘레베이터의 전면에 설치되고, 엘 레베이터를 대기하는 공간을 실시간으로 촬영하여 영상 정보를 생성한다. 상기 제1 카메라는 사전에 미리 저장된 환자 또는 의료 장비의 영상 정보와 실시간으로 촬영한 엘레베이터의 영상 정보를 비교하여, 엘레베이터 를 대기하는 환자 또는 의료 장비를 인식할 수 있다. 상기 환자 또는 의료 장비의 영상 정보는 후술하는 데이터 베이스에 저장될 수 있다. 상기 제1 카메라는 엘레베이터를 대기하는 환자 또는 의료 장비가 인식되면, 해 당 층으로 엘레베이터를 이동하는 호출 신호를 생성할 수 있다. 상기 복수 개의 스위치는 각 층에 설치되고, 엘레베이터를 호출하는 호출 신호를 생성한다. 상기 스위치 는 엘레베이터를 대기하는 일반인이 손으로 터치하는 방식 등으로 작동될 수 있으나, 이에 제한되는 것은 아니고, 음성 인식 등으로도 작동할 수 있다. 예를 들어, 상기 스위치는 온/오프(OFF)로 작동하며, 온 상 태에서 해당 층으로 엘레베이터를 호출할 수 있다. 해당 층으로 엘레베이터가 호출되면, 스위치는 오프 상 태로 전환될 수 있다. 상기 제어부는 상기 스위치 및 제1 카메라에 입력된 영상 정보에 기초하여, 호출 신호가 생성된 층으로 엘레베이터를 이동시키는 제1 모드 및 제1 카메라에 의해 환자 또는 의료 장비가 인식된 층으 로 엘레베이터를 이동시키는 제2 모드로 엘레베이터의 이동을 제어하되, 제2 모드로 작동 중에는 제1 모드로 작동을 허용하지 않는다. 제어부는 상기와 같이, 제2 모드로 작동 중에는 제1 모드가 작동하지 않도록 함으로써, 엘레베 이터를 대기하는 환자 또는 의료 장비의 신속한 이동이 가능하도록 한다 또한, 상기 제어부는 제1 카메라에 의해 환자 또는 의료 장비가 인식되지 않으면, 제1 모드로 엘레베이터의 이동을 제어한다. 이에 따라, 엘레베이터는 환자 또는 의료 장비가 대기하지 않는 시간에도 정지 하지 않고 지속적으로 운영될 수 있다. 본 출원에 따른 엘레베이터 제어 시스템은 제어부를 통해 환자 또는 의료 장비가 있는 층으로 먼저 엘레베 이터가 이동하도록 제2 모드로 엘레베이터의 이동을 제어하고, 동시에 환자 또는 의료 장비가 대기하지 않 을 경우, 제1 모드로 엘레베이터의 이동을 제어함에 따라, 엘레베이터의 사용 효율을 향상시킬 수 있다. 일 구체예에서, 상기 제어부는 제1 모드 작동 중 제1 카메라에 의해 환자 또는 의료 장비가 인식되면, 이 후 스위치에 의해 생성되는 호출 신호는 허용하지 않고, 제2 모드로 엘리베이터의 이동을 제어할 수 있다. 상기 와 같이, 제1 모드에서 제2 모드로 전환되는 과정에서, 스위치에 의해 생성되는 호출 신호를 허용하지 않음에 따라, 환자 또는 의료 장비가 인식되는 층으로 이동하는 엘리베이터의 탑승 공간이 확보될 수 있다. 또한, 본 출원에 따른 제어 시스템은 엘레베이터의 모드 작동 상태를 화면에 표시하는 디스플레이부를 추가로 포함할 수 있다. 예를 들어, 제1 모드에서 제2 모드로 전환되는 과정에서, 스위치에 의해 호출 신호가 생성되면, 상기 디스플레이부는 스위치를 작동하고 대기 중인 일반인에게 현재 엘레베이터가 \"환자 또는 의료 장비가 인식된 층으로 이동 중\"이라고 설명을 화면에 표시할 수 있다. 하나의 예시에서, 상기 제1 카메라는 환자용 태그 또는 환자 복장을 통해 환자를 인식할 수 있다. 제1 카 메라는 미리 입력된 환자용 태그, 환자 복장 등의 영상 정보와 비교하여, 환자를 인식할 수 있다. 또 하나의 예시에서, 상기 의료 장비는 휠체어 또는 의료 침대일 수 있으나, 이에 제한되는 것은 아니고, 각종 의료 전문 장비 등도 포함될 수 있다. 본 출원에 따른 엘레베이터 제어 시스템은 엘레베이터 내부에 설치되고, 환자 및 의료 장비를 인식하는 제2 카 메라를 추가로 포함하고, 상기 제2 카메라에 입력된 영상 정보에 기초하여, 엘레베이터의 탑승 여유 공간을 판 단하는 판단부를 추가로 포함할 수 있다. 구체적으로, 상기 판단부에서 엘레베이터 탑승 여유 공간이 없는 것으로 판단되면, 제어부는 제1 및 제2 모드로 작동을 허용하지 않을 수 있다. 본 출원에 따른 엘레베이터 제어 시스템은 엘레베이터에 최대로 탑승할 수 있는 환자 수 또는 의료 장비 개수에 대한 정보를 데이터화하여 저장하는 데이터베이스를 포함할 수 있다. 상기 의료 장비 개수는 의료 장비의 종류, 크기 등을 고려하여 정해질 수 있다. 판단부는 상기 데이터베이스에 저장된 데이터에 기초하여, 제2 카메라에서입력된 영상 정보를 분석할 수 있다. 상기 데이터베이스는 환자 또는 의료 장비에 대한 데이터도 저장되고, 전 술한 제1 카메라는 상기 데이터와 촬영된 영상 정보를 비교하여 환자 또는 의료 장비를 인식하게 된다. 본 출원은 또한 의료 기관에 설치된 복수 개의 엘레베이터를 제어하는 엘레베이터 제어 시스템에 관한 것이다. 상기 시스템은 적어도 2개 이상의 엘레베이터가 설치된 의료 기관에 적용된다. 상기 제어 시스템은, 복수 개의 제1 카메라, 복수 개의 스위치 및 제어부를 포함한다. 상기 복수 개의 제1 카메 라 및 복수 개의 스위치에 대한 설명은 전술한 내용과 중복되므로 이하에서 생략하기로 한다. 상기 제어부는 상기 스위치 및 제1 카메라에 입력된 정보에 기초하여, 호출 신호가 생성된 층과 가까운 층에 대 기하는 엘레베이터를 이동시키는 제1 모드 및 제1 카메라에 의해 환자 또는 의료 장비가 인식된 층과 가까운 층 에 대기하는 엘레베이터를 이동시키는 제2 모드로 엘레베이터의 이동을 제어하되, 제2 모드는 작동 중에는 제1 모드로 작동을 허용하지 않는다. 복수 개의 엘레베이터가 설치된 의료 기관에 적용되는 시스템에서는, 상기와 같이, 복수 개의 엘레베이터 중 호 출 신호가 생성되거나, 환자 또는 의료 장비가 인식된 층과 가까운 층에 대기하는 엘레베이터를 선택적으로 이 동시킴으로써, 엘레베이터를 대기하는 시간이 단축되는 효과가 있다. 또한, 제1 모드 및 제2 모드와 관련된 자 세한 설명은 전술한 내용과 중복되므로, 생략하기로 한다. 이상과 같이, 본 출원은 비록 한정된 실시예와 도면에 의해 설명되었으나, 본 출원은 이것에 의해 한정되지 않 으며, 다양한 수정 및 변형이 가능할 수 있다."}
{"patent_id": "10-2019-0107979", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 출원에 따른 예시적인 엘레베이터 제어 시스템의 구성도이다."}
