{"patent_id": "10-2018-0028801", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0107490", "출원번호": "10-2018-0028801", "발명의 명칭": "이동 단말기 및 그 제어 방법", "출원인": "엘지전자 주식회사", "발명자": "최경락"}}
{"patent_id": "10-2018-0028801", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전면 및 후면을 구비하는 본체;상기 본체의 전면에 배치되는 적어도 하나의 센서;상기 본체의 전면에 배치되는 메인 디스플레이 영역과, 상기 메인 디스플레이 영역으로부터 연장되며 상기 적어도 하나의 센서를 사이에 두고 배치되는 제1 및 제2 서브 디스플레이 영역을 포함하는 디스플레이부; 및,상기 디스플레이부에 대한 터치 입력에 응답하여, 적어도 하나의 기능을 제어하는 제어부를 포함하고,상기 제어부는, 상기 터치 입력이, 상기 메인 디스플레이 영역, 상기 제1 서브 디스플레이 영역 및 상기 제2 서브 디스플레이영역 중 어느 영역에서 시작되었는지에 근거하여, 서로 다른 기능을 제어하는 것을 특징으로 하는 이동 단말기."}
{"patent_id": "10-2018-0028801", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 본체의 전면에는, 상기 제1 및 제2 서브 디스플레이 영역 사이에서 상기 메인 디스플레이 영역을 향하여리세스된 노치 영역이 형성되는 것을 특징으로 하는 이동 단말기."}
{"patent_id": "10-2018-0028801", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 제어부는,상기 메인 디스플레이 영역 중 상기 노치 영역과 인접한 영역에 위치한 적어도 일 영역에 대한 터치 입력을, 상기 제1 및 제2 서브 디스플레이 영역 중 어느 하나에 대한 터치 입력으로 처리하고,상기 적어도 일 영역을 제외한 나머지 영역에 대한 터치 입력을, 상기 메인 디스플레이 영역에 대한 터치 입력으로 처리하는 것을 특징으로 하는 이동 단말기."}
{"patent_id": "10-2018-0028801", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서, 상기 노치 영역에는 상기 적어도 하나의 센서가 배치되며,상기 적어도 하나의 센서는, 카메라, 조도 센서 및 근접 센서 중 적어도 하나를 포함하는 것을 특징으로 하는 이동 단말기."}
{"patent_id": "10-2018-0028801", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 제어부는,상기 메인 디스플레이 영역에 제1 애플리케이션의 실행화면이 출력된 상태에서, 상기 제1 애플리케이션과 다른제2 애플리케이션과 관련된 이벤트가 발생하는 경우,상기 메인 디스플레이 영역에는 상기 제1 애플리케이션의 실행화면이 계속하여 출력되고,상기 제1 및 제2 서브 디스플레이 영역 중 적어도 하나에는 상기 이벤트와 관련된 정보가 출력되도록 상기 디스플레이부를 제어하는 것을 특징으로 하는 이동 단말기."}
{"patent_id": "10-2018-0028801", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 제어부는,공개특허 10-2019-0107490-3-상기 이벤트가 발생되는 경우,상기 제1 서브 디스플레이 영역에는, 상기 이벤트와 관련된 제1 제어화면이 출력되고,상기 제2 서브 디스플레이 영역에는 상기 이벤트와 관련된 제2 제어화면이 출력되도록 상기 디스플레이를 제어하고,상기 터치 입력이 상기 제1 및 제2 서브 디스플레이 영역 중 어느 영역에서 시작되었는지에 따라, 상기 이벤트와 관련된 서로 다른 제어를 수행하는 것을 특징으로 하는 이동 단말기."}
{"patent_id": "10-2018-0028801", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 제2 애플리케이션은 콜 기능 관련 애플리케이션이고, 상기 제2 애플리케이션과 관련하여 발생된 이벤트가 콜 수신 이벤트인 경우, 상기 제어부는,상기 제1 서브 디스플레이 영역에, 상기 제1 제어화면으로서 콜 수신 허용 기능 화면을 출력하고,상기 제2 서브 디스플레이 영역에, 상기 제2 제어화면으로서 콜 수신 거절 기능 화면을 출력하는 것을 특징으로하는 이동 단말기."}
{"patent_id": "10-2018-0028801", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제5항에 있어서, 상기 제어부는,상기 이벤트와 관련된 정보가 상기 제1 서브 디스플레이 영역에 표시된 상태에서, 상기 제1 서브 디스플레이 영역으로부터 시작되는 드래그 터치 입력이 인가되는 경우,상기 이벤트와 관련된 정보를 포함하는 상기 제2 애플리케이션의 실행화면이 상기 메인 디스플레이 영역에 표시되도록 상기 디스플레이부를 제어하는 것을 특징으로 하는 이동 단말기."}
{"patent_id": "10-2018-0028801", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 메인 디스플레이 영역에 출력되고 있던 상기 제1 애플리케이션의 실행화면의 표시 영역은, 상기 제2 애플리케이션의 실행화면이 표시되는 것에 근거하여, 점차적으로 축소되는 것을 특징으로 하는 이동 단말기."}
{"patent_id": "10-2018-0028801", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에 있어서, 상기 제1 및 제2 서브 디스플레이 영역에는, 각각 상기 제2 애플리케이션에 관련된 서로 다른 기능이 대응되며, 상기 제어부는,상기 제1 및 제2 서브 디스플레이 영역 중, 상기 터치 드래그 입력의 시작점에 근거하여 서로 다른 기능의 실행화면을 상기 제2 애플리케이션의 실행화면으로 출력하는 것을 특징으로 하는 이동 단말기."}
{"patent_id": "10-2018-0028801", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제8항에 있어서, 상기 제어부는,상기 제1 서브 디스플레이 영역에 대응하는 상기 메인 디스플레이 영역의 일부에 상기 제2 애플리케이션의 실행화면이 표시된 상태에서, 상기 제2 서브 디스플레이 영역에서 시작되는 터치 드래그 입력이 인가되는 경우, 상기 제1 서브 디스플레이 영역에 대응하는 상기 제2 애플리케이션의 제1 실행화면과, 상기 제2 서브 디스플레이 영역에 대응하는 상기 제2 애플리케이션의 제2 실행화면이 상기 메인 디스플레이 영역에 함께 표시되도록 상기 디스플레이부를 제어하는 것을 특징으로 하는 이동 단말기.공개특허 10-2019-0107490-4-청구항 12 제11항에 있어서, 상기 제어부는, 상기 메인 디스플레이 영역을 상기 제1 서브 디스플레이 영역에 대응하는 영역 및 제2 서브 디스플레이 영역에대응하는 영역을 포함하는 복수의 영역으로 구분하고, 상기 메인 디스플레이 영역의 구분된 복수의 영역 중, 상기 제1 서브 디스플레이 영역에 대응하는 영역과 상기제2 서브 디스플레이 영역에 대응하는 영역에, 상기 제1 실행화면과 상기 제2 실행화면이 각각 표시되도록 상기디스플레이부를 제어하는 것을 특징으로 하는 이동 단말기."}
{"patent_id": "10-2018-0028801", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서, 상기 메인 디스플레이 영역의 구분된 복수의 영역들 중 상기 제1 서브 디스플레이 영역에 대응하는 영역과 상기제2 서브 디스플레이 영역에 대응하는 영역은, 상기 디스플레이부의 길이 방향에 따라, 상기 제1 서브 디스플레이 영역과 제2 서브 디스플레이 영역에 각각 대응하는 영역임을 특징으로 하는 이동 단말기."}
{"patent_id": "10-2018-0028801", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제2항에 있어서, 상기 제어부는, 상기 터치 입력이 상기 노치 영역에서 시작되는 경우, 상기 터치 입력이 상기 제1 및 제2 서브 디스플레이 영역에서 시작되는 경우에 제어되는 기능들과 다른 기능을제어하는 것을 특징으로 하는 이동 단말기."}
{"patent_id": "10-2018-0028801", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서, 상기 제어부는,상기 제1 및 제2 서브 디스플레이 영역과 상기 노치 영역 중 어느 하나에서 터치 입력이 시작되면, 상기 터치입력을 인가하는 터치 대상체의 개수에 따라 상기 터치 입력이 시작된 영역에 대응하는 서로 다른 기능들 중 어느 하나에 따른 실행화면이 표시되도록 상기 디스플레이부를 제어하는 것을 특징으로 하는 이동 단말기."}
{"patent_id": "10-2018-0028801", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제1항에 있어서, 상기 제어부는,상기 메인 디스플레이 영역에 포함된 복수의 객체 중, 사용자에 의해 선택된 적어도 하나가 표시되는 상기 메인디스플레이 영역의 일 지점으로부터 시작되는 터치 입력이 인가되면, 상기 제1 및 제2 서브 디스플레이 영역 중 어느 하나에서 상기 터치 입력이 종료되었는지에 근거하여, 상기 선택된 적어도 하나의 객체에 대응하는 정보가, 상기 제1 및 제2 서브 디스플레이 영역 중 어느 하나에 표시되도록 상기 디스플레이부를 제어하는 것을 특징으로 하는 이동 단말기."}
{"patent_id": "10-2018-0028801", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서, 상기 선택된 적어도 하나의 객체에 대응하는 정보는, 상기 선택된 객체에 대응하는 썸네일 이미지 또는 상기 선택된 객체의 일부이며, 상기 제어부는, 상기 선택된 적어도 하나의 객체에 대응하는 정보가, 상기 제1 및 제2 서브 디스플레이 영역 중 어느 하나에 대해 인가되는 터치 입력에 근거하여 상기 제1 및 제2 서브 디스플레이 영역 중, 어느 하나에 인접한 상기 메인디스플레이 영역의 적어도 일부에 표시되도록 상기 디스플레이부를 제어하는 것을 특징으로 하는 이동 단말기.공개특허 10-2019-0107490-5-청구항 18 제1항에 있어서, 상기 제어부는,상기 메인 디스플레이 영역에 포함된 문자열 중, 사용자에 의해 선택된 문자열이 표시되는 영역으로부터 터치입력이 시작되고 상기 제1 및 제2 서브 디스플레이 영역 중 어느 하나에서 상기 터치 입력이 종료되는 경우, 상기 터치 입력이 종료되는 영역에 인접한 상기 메인 디스플레이 영역의 적어도 일부에 상기 선택된 문자열이 표시되도록 상기 디스플레이부를 제어하고,상기 메인 디스플레이 영역의 일부에 상기 문자열이 표시된 상태에서, 상기 제1 및 제2 서브 디스플레이 영역중 어느 하나에 인가된 터치 입력에 따라, 상기 문자열과 관련된 서로 다른 기능을 제어하는 것을 특징으로 하는 이동 단말기."}
{"patent_id": "10-2018-0028801", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에 있어서,상기 문자열과 관련된 서로 다른 기능은, 상기 메인 디스플레이 영역의 일부에 표시된 문자열을 번역하는 기능 및 편집하는 기능이며, 상기 제어부는,상기 메인 디스플레이 영역에서 상기 문자열이 표시된 상태에서, 상기 제1 및 제2 서브 디스플레이 영역 중 어느 하나에 인가되는 터치 입력에 근거하여 상기 번역 기능의 실행 화면 및 상기 편집 기능의 실행 화면 중 어느하나가 상기 메인 디스플레이 영역의 적어도 일부에 표시되도록 상기 디스플레이부를 제어하는 것을 특징으로하는 이동 단말기."}
{"patent_id": "10-2018-0028801", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "이동 단말기의 제어 방법에 있어서, 디스플레이부 상에 인가되는 터치 입력을 감지하는 단계;상기 이동 단말기 본체 전면에 배치되는 메인 디스플레이 영역과, 상기 메인 디스플레이 영역으로부터 연장되며적어도 하나의 센서를 사이에 두고 배치되는 제1 및 제2 서브 디스플레이 영역들 중 어느 하나에서 상기 터치입력이 시작되었는지를 식별하는 단계; 및, 상기 터치 입력이 시작된 영역에 근거하여 서로 다른 기능을 제어하는 단계를 포함하는 것을 특징으로 하는 이동 단말기의 제어 방법."}
{"patent_id": "10-2018-0028801", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 디스플레이 영역 상단의 일부가 리세스된 형태를 가지는 디스플레이부를 포함하는 이동 단말기에 관한 것으로, 전면 및 후면을 구비하는 본체와, 상기 본체의 전면에 배치되는 적어도 하나의 센서와, 상기 본체의 전 면에 배치되는 메인 디스플레이 영역과, 상기 메인 디스플레이 영역으로부터 연장되며 상기 적어도 하나의 센서 를 사이에 두고 배치되는 제1 및 제2 서브 디스플레이 영역을 포함하는 디스플레이부 및, 상기 디스플레이부에 대한 터치 입력에 응답하여, 적어도 하나의 기능을 제어하는 제어부를 포함하고, 상기 제어부는, 상기 터치 입력 이, 상기 메인 디스플레이 영역, 상기 제1 서브 디스플레이 영역 및 상기 제2 서브 디스플레이 영역 중 어느 영 역에서 시작되었는지에 근거하여, 서로 다른 기능을 제어하는 것을 특징으로 한다."}
{"patent_id": "10-2018-0028801", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은, 디스플레이 영역 상단의 일부가 리세스된 형태를 가지는 디스플레이부를 포함하는 이동 단말기 및 그 이동 단말기의 제어 방법에 대한 것이다."}
{"patent_id": "10-2018-0028801", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "이동 단말기의 기능은 다양화 되고 있다. 예를 들면, 데이터와 음성통신, 카메라를 통한 사진촬영 및 비디오 촬 영, 음성녹음, 스피커 시스템을 통한 음악파일 재생 그리고 디스플레이부에 이미지나 비디오를 출력하는 기능이 있다. 일부 단말기는 전자게임 플레이 기능이 추가되거나, 멀티미디어 플레이어 기능을 수행한다. 특히 최근의 이동 단말기는 방송과 비디오나 텔레비전 프로그램과 같은 시각적 컨텐츠를 제공하는 멀티캐스트 신호를 수신할 수 있다. 이와 같은 단말기(terminal)는 기능이 다양화됨에 따라 예를 들어, 사진이나 동영상의 촬영, 음악이나 동영상 파일의 재생, 게임, 방송의 수신 등의 복합적인 기능들을 갖춘 멀티미디어 기기(Multimedia player) 형태로 구 현되고 있다. 이러한 단말기의 기능 지지 및 증대를 위해, 단말기의 구조적인 부분 및/또는 소프트웨어적인 부분을 개량하는 것이 고려될 수 있다. 한편 요즈음에는 이동 단말기의 크기 및 무게는 보다 줄이면서도 보다 대화면을 형성할 수 있도록 하기 위한 디 자인이 활발하게 연구되고 있는 실정이다. 그리고 이러한 연구의 일환으로 디스플레이부가 형성된 이동 단말기 전면부의 베젤 영역을 얇게한 베젤리스(bezel-less) 디자인이 등장하였고, 이러한 베젤리스 디자인에 의해, 디 스플레이부가 형성된 이동 단말기 전면부 90% 이상의 영역을 화상 정보의 표시가 가능한 디스플레이 영역으로 사용하는 풀 스크린(full-screen) 형태의 이동 단말기가 등장하고 있는 추세이다. 이러한 풀 스크린 형태의 이동 단말기는, 이동 단말기 전면부에서 적어도 하나의 센서 및 출력부가 형성되는 영 역 및 상기 베젤 영역을 제외한 전면부의 전체 영역이 디스플레이부로 형성된 이동 단말기일 수 있다. 한편 이 러한 풀 스크린 이동 단말기의 일환으로, 카메라 또는 스피커와 같은 적어도 하나의 센서를 디스플레이부 상단 의 기 설정된 영역 내에 배치하고, 상기 디스플레이부 상단에서 상기 이동 단말기 전면부의 좌우측 베젤 영역과 상기 적어도 하나의 센서가 배치되는 상기 기 설정된 영역 사이의 영역들까지 디스플레이 영역이 연장되는 디자 인, 이른바 노치(Notch) 디자인으로 형성된 디스플레이부를 구비하는 이동 단말기가 등장하고 있는 추세이다."}
{"patent_id": "10-2018-0028801", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기 노치 디자인 디스플레이를 구비하는 이동 단말기에서, 상기 디스플레이부 상단에 연장된 디스플 레이 영역을 활용할 수 있는 이동 단말기 및 그 제어 방법을 제공하는 것을 그 목적으로 한다."}
{"patent_id": "10-2018-0028801", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 또는 다른 목적을 달성하기 위해 본 발명의 일 측면에 따르면, 본 발명의 실시 예에 따른 이동 단말기는, 전면 및 후면을 구비하는 본체와, 상기 본체의 전면에 배치되는 적어도 하나의 센서와, 상기 본체의 전면에 배 치되는 메인 디스플레이 영역과, 상기 메인 디스플레이 영역으로부터 연장되며 상기 적어도 하나의 센서를 사이 에 두고 배치되는 제1 및 제2 서브 디스플레이 영역을 포함하는 디스플레이부 및, 상기 디스플레이부에 대한 터 치 입력에 응답하여, 적어도 하나의 기능을 제어하는 제어부를 포함하고, 상기 제어부는, 상기 터치 입력이, 상 기 메인 디스플레이 영역, 상기 제1 서브 디스플레이 영역 및 상기 제2 서브 디스플레이 영역 중 어느 영역에서 시작되었는지에 근거하여, 서로 다른 기능을 제어하는 것을 특징으로 한다. 일 실시 예에 있어서, 상기 본체의 전면에는, 상기 제1 및 제2 서브 디스플레이 영역 사이에서 상기 메인 디스 플레이 영역을 향하여 리세스된 노치 영역이 형성되는 것을 특징으로 한다. 일 실시 예에 있어서, 상기 제어부는, 상기 메인 디스플레이 영역 중 상기 노치 영역과 인접한 영역에 위치한 적어도 일 영역에 대한 터치 입력을, 상기 제1 및 제2 서브 디스플레이 영역 중 어느 하나에 대한 터치 입력으 로 처리하고, 상기 적어도 일 영역을 제외한 나머지 영역에 대한 터치 입력을, 상기 메인 디스플레이 영역에 대 한 터치 입력으로 처리하는 것을 특징으로 한다. 일 실시 예에 있어서, 상기 노치 영역에는 상기 적어도 하나의 센서가 배치되며, 상기 적어도 하나의 센서는, 카메라, 조도 센서 및 근접 센서 중 적어도 하나를 포함하는 것을 특징으로 한다. 일 실시 예에 있어서, 상기 제어부는, 상기 메인 디스플레이 영역에 제1 애플리케이션의 실행화면이 출력된 상 태에서, 상기 제1 애플리케이션과 다른 제2 애플리케이션과 관련된 이벤트가 발생하는 경우, 상기 메인 디스플 레이 영역에는 상기 제1 애플리케이션의 실행화면이 계속하여 출력되고, 상기 제1 및 제2 서브 디스플레이 영역 중 적어도 하나에는 상기 이벤트와 관련된 정보가 출력되도록 상기 디스플레이부를 제어하는 것을 특징으로 한 다. 일 실시 예에 있어서, 상기 제어부는, 상기 이벤트가 발생되는 경우, 상기 제1 서브 디스플레이 영역에는, 상기 이벤트와 관련된 제1 제어화면이 출력되고, 상기 제2 서브 디스플레이 영역에는 상기 이벤트와 관련된 제2 제어 화면이 출력되도록 상기 디스플레이를 제어하고, 상기 터치 입력이 상기 제1 및 제2 서브 디스플레이 영역 중 어느 영역에서 시작되었는지에 따라, 상기 이벤트와 관련된 서로 다른 제어를 수행하는 것을 특징으로 한다. 일 실시 예에 있어서, 상기 제2 애플리케이션은 콜 기능 관련 애플리케이션이고, 상기 제2 애플리케이션과 관련 하여 발생된 이벤트가 콜 수신 이벤트인 경우, 상기 제어부는, 상기 제1 서브 디스플레이 영역에, 상기 제1 제 어화면으로서 콜 수신 허용 기능 화면을 출력하고, 상기 제2 서브 디스플레이 영역에, 상기 제2 제어화면으로서콜 수신 거절 기능 화면을 출력하는 것을 특징으로 한다. 일 실시 예에 있어서, 상기 제어부는, 상기 이벤트와 관련된 정보가 상기 제1 서브 디스플레이 영역에 표시된 상태에서, 상기 제1 서브 디스플레이 영역으로부터 시작되는 드래그 터치 입력이 인가되는 경우, 상기 이벤트와 관련된 정보를 포함하는 상기 제2 애플리케이션의 실행화면이 상기 메인 디스플레이 영역에 표시되도록 상기 디 스플레이부를 제어하는 것을 특징으로 한다. 일 실시 예에 있어서, 상기 메인 디스플레이 영역에 출력되고 있던 상기 제1 애플리케이션의 실행화면의 표시 영역은, 상기 제2 애플리케이션의 실행화면이 표시되는 것에 근거하여, 점차적으로 축소되는 것을 특징으로 한 다. 일 실시 예에 있어서, 상기 제1 및 제2 서브 디스플레이 영역에는, 각각 상기 제2 애플리케이션에 관련된 서로 다른 기능이 대응되며, 상기 제어부는, 상기 제1 및 제2 서브 디스플레이 영역 중, 상기 터치 드래그 입력의 시 작점에 근거하여 서로 다른 기능의 실행 화면을 상기 제2 애플리케이션의 실행 화면으로 출력하는 것을 특징으 로 한다. 일 실시 예에 있어서, 상기 제어부는, 상기 제1 서브 디스플레이 영역에 대응하는 상기 메인 디스플레이 영역의 일부에 상기 제2 애플리케이션의 실행 화면이 표시된 상태에서, 상기 제2 서브 디스플레이 영역에서 시작되는 터치 드래그 입력이 인가되는 경우, 상기 제1 서브 디스플레이 영역에 대응하는 상기 제2 애플리케이션의 제1 실행화면과, 상기 제2 서브 디스플레이 영역에 대응하는 상기 제2 애플리케이션의 제2 실행화면이 상기 메인 디 스플레이 영역에 함께 표시되도록 상기 디스플레이부를 제어하는 것을 특징으로 한다. 일 실시 예에 있어서, 상기 제어부는, 상기 메인 디스플레이 영역을 상기 제1 서브 디스플레이 영역에 대응하는 영역 및 제2 서브 디스플레이 영역에 대응하는 영역을 포함하는 복수의 영역으로 구분하고, 상기 메인 디스플레 이 영역의 구분된 복수의 영역 중, 상기 제1 서브 디스플레이 영역에 대응하는 영역과 상기 제2 서브 디스플레 이 영역에 대응하는 영역에, 상기 제1 실행화면과 상기 제2 실행화면이 각각 표시되도록 상기 디스플레이부를 제어하는 것을 특징으로 한다. 일 실시 예에 있어서, 상기 메인 디스플레이 영역의 구분된 복수의 영역들 중 상기 제1 서브 디스플레이 영역에 대응하는 영역과 상기 제2 서브 디스플레이 영역에 대응하는 영역은, 상기 디스플레이부의 길이 방향을 따라, 상기 제1 서브 디스플레이 영역과 제2 서브 디스플레이 영역에 각각 대응하는 영역임을 특징으로 한다. 일 실시 예에 있어서, 상기 제어부는, 상기 터치 입력이 상기 노치 영역에서 시작되는 경우, 상기 터치 입력이 상기 제1 및 제2 서브 디스플레이 영역에서 시작되는 경우에 제어되는 기능들과 다른 기능을 제어하는 것을 특 징으로 한다. 일 실시 예에 있어서, 상기 제어부는, 상기 제1 및 제2 서브 디스플레이 영역과 상기 노치 영역 중 어느 하나에 서 터치 입력이 시작되면, 상기 터치 입력을 인가하는 터치 대상체의 개수에 따라 상기 터치 입력이 시작된 영 역에 대응하는 서로 다른 기능들 중 어느 하나에 따른 실행화면이 표시되도록 상기 디스플레이부를 제어하는 것 을 특징으로 한다. 일 실시 예에 있어서, 상기 제어부는, 상기 메인 디스플레이 영역에 포함된 복수의 객체 중 사용자에 의해 선택 된 적어도 하나가 표시되는 상기 메인 디스플레이 영역의 일 지점으로부터 시작되는 터치 입력이 인가되면, 상 기 제1 및 제2 서브 디스플레이 영역 중 어느 하나에서 상기 터치 입력이 종료되었는지에 근거하여, 상기 선택 된 적어도 하나의 객체에 대응하는 정보가, 상기 제1 및 제2 서브 디스플레이 영역 중 어느 하나에 표시되도록 상기 디스플레이부를 제어하는 것을 특징으로 한다. 일 실시 예에 있어서, 상기 선택된 적어도 하나의 객체에 대응하는 정보는, 상기 선택된 객체에 대응하는 썸네 일 이미지 또는 상기 선택된 객체의 일부이며, 상기 제어부는, 상기 선택된 적어도 하나의 객체에 대응하는 정 보를, 상기 제1 및 제2 서브 디스플레이 영역 중 어느 하나에 대해 인가되는 터치 입력에 근거하여 상기 제1 및 제2 서브 디스플레이 영역 중 어느 하나에 인접한 상기 메인 디스플레이 영역의 적어도 일부에 표시되도록 상기 디스플레이부를 제어하는 것을 특징으로 한다. 일 실시 예에 있어서, 상기 제어부는, 상기 메인 디스플레이 영역에 포함된 문자열 중, 사용자에 의해 선택된 문자열이 표시되는 영역으로부터 터치 입력이 시작되고 상기 제1 및 제2 서브 디스플레이 영역 중 어느 하나에 서 상기 터치 입력이 종료되는 경우, 상기 터치 입력이 종료되는 영역에 인접한 상기 메인 디스플레이 영역의 적어도 일부에 상기 선택된 문자열이 표시되도록 상기 디스플레이부를 제어하고, 상기 메인 디스플레이 영역의일부에 상기 문자열이 표시된 상태에서, 상기 제1 및 제2 서브 디스플레이 영역 중 어느 하나에 인가된 터치 입 력에 따라, 상기 문자열과 관련된 서로 다른 기능을 제어하는 것을 특징으로 한다. 일 실시 예에 있어서, 상기 문자열과 관련된 서로 다른 기능은, 상기 메인 디스플레이 영역의 일부에 표시된 문 자열을 번역하는 기능 및 편집하는 기능이며, 상기 제어부는, 상기 메인 디스플레이 영역에서 상기 문자열이 표 시된 상태에서, 상기 제1 및 제2 서브 디스플레이 영역 중 어느 하나에 인가되는 터치 입력에 근거하여 상기 번 역 기능의 실행 화면 및 상기 편집 기능의 실행 화면 중 어느 하나가 상기 메인 디스플레이 영역의 적어도 일부 에 표시되도록 상기 디스플레이부를 제어하는 것을 특징으로 한다. 상기 또는 다른 목적을 달성하기 위해 본 발명의 일 측면에 따르면, 본 발명의 실시 예에 따른 이동 단말기의 제어 방법은, 디스플레이부 상에 인가되는 터치 입력을 감지하는 단계와, 상기 이동 단말기 본체 전면에 배치되 는 메인 디스플레이 영역과, 상기 메인 디스플레이 영역으로부터 연장되며 적어도 하나의 센서를 사이에 두고 배치되는 제1 및 제2 서브 디스플레이 영역들 중 어느 하나에서 상기 터치 입력이 시작되었는지를 식별하는 단 계 및, 상기 터치 입력이 시작된 영역에 근거하여 서로 다른 기능을 제어하는 단계를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2018-0028801", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 이동 단말기 및 그 제어 방법의 효과에 대해 설명하면 다음과 같다. 본 발명의 실시 예들 중 적어도 하나에 의하면, 본 발명은 상기 디스플레이 상단으로 연장된 디스플레이 영역 중 적어도 하나에 인가되는 사용자의 입력에 근거하여 서로 다른 기능들이 실행될 수 있도록 함으로써, 사용자 가 보다 쉽고 빠르게 원하는 기능을 실행시킬 수 있다는 장점이 있다. 또한, 본 발명의 실시 예들 중 적어도 하나에 의하면, 본 발명은 현재 실행되고 있는 기능과 관련된 적어도 하 나의 화상 정보를 상기 디스플레이 상단으로 연장된 디스플레이 영역 중 적어도 하나에 표시함으로써, 사용자가 현재 실행되고 있는 기능과 관련된 정보를 보다 쉽게 확인할 수 있도록 한다는 장점이 있다. 또한, 본 발명의 실시 예들 중 적어도 하나에 의하면, 본 발명은 상기 디스플레이 상단으로 연장된 디스플레이 영역 중 적어도 하나에 인가되는 서로 다른 입력에 근거하여 현재 실행중인 기능에 대해 서로 다른 처리가 이루 어지도록 함으로써, 사용자가 메뉴 화면을 경유하지 않고서도 현재 실행되는 기능과 관련된 서로 다른 처리 결 과를 확인할 수 있도록 한다는 장점이 있다."}
{"patent_id": "10-2018-0028801", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 명세서에 개시된 실시 예를 상세히 설명하되, 동일하거나 유사한 구성요소에 는 동일, 유사한 도면 부호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 이하의 설명에서 사용되는 구성요소에 대한 접미사 \"모듈\" 및 \"부\"는 명세서 작성의 용이함만이 고려되어 부여되거나 혼용되는 것으로서, 그 자체로 서로 구별되는 의미 또는 역할을 갖는 것은 아니다. 또한, 본 명세서에 개시된 실시 예를 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 명세서에 개시된 실시 예의 요지를 흐릴 수 있다고 판단되 는 경우 그 상세한 설명을 생략한다. 또한, 첨부된 도면은 본 명세서에 개시된 실시 예를 쉽게 이해할 수 있도 록 하기 위한 것일 뿐, 첨부된 도면에 의해 본 명세서에 개시된 기술적 사상이 제한되지 않으며, 본 발명의 사 상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 본 명세서에서 설명되는 이동 단말기에는 휴대폰, 스마트 폰(smart phone), 노트북 컴퓨터(laptop computer), 디지털방송용 단말기, PDA(personal digital assistants), PMP(portable multimedia player), 네비게이션, 슬 레이트 PC(slate PC), 태블릿 PC(tablet PC), 울트라북(ultrabook), 웨어러블 디바이스(wearable device, 예를 들어, 워치형 단말기 (smartwatch), 글래스형 단말기 (smart glass), HMD(head mounted display)) 등이 포함될 수 있다. 그러나 본 명세서에 기재된 실시 예에 따른 구성은 이동 단말기에만 적용 가능한 경우를 제외하면, 디지털 TV,"}
{"patent_id": "10-2018-0028801", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "데스크탑 컴퓨터, 디지털 사이니지 등과 같은 고정 단말기에도 적용될 수도 있음을 본 기술분야의 당업자라면 쉽게 알 수 있을 것이다. 도 1a 내지 도 1c를 참조하면, 도 1a는 본 발명과 관련된 이동 단말기를 설명하기 위한 블록도이고, 도 1b 및 1c는 본 발명과 관련된 이동 단말기의 일 예를 서로 다른 방향에서 바라본 개념도이다. 상기 이동 단말기는 무선 통신부, 입력부, 감지부, 출력부, 인터페이스부, 메모 리, 제어부 및 전원 공급부 등을 포함할 수 있다. 도 1a에 도시된 구성요소들은 이동 단말기를 구현하는데 있어서 필수적인 것은 아니어서, 본 명세서 상에서 설명되는 이동 단말기는 위에서 열거된 구성요소 들 보다 많거나, 또는 적은 구성요소들을 가질 수 있다. 보다 구체적으로, 상기 구성요소들 중 무선 통신부는, 이동 단말기와 무선 통신 시스템 사이, 이동 단말기와 다른 이동 단말기 사이, 또는 이동 단말기와 외부서버 사이의 무선 통신을 가능하게 하는 하나 이상의 모듈을 포함할 수 있다. 또한, 상기 무선 통신부는, 이동 단말기를 하나 이상의 네 트워크에 연결하는 하나 이상의 모듈을 포함할 수 있다. 이러한 무선 통신부는, 방송 수신 모듈, 이동통신 모듈, 무선 인터넷 모듈, 근거리 통신 모듈, 위치정보 모듈 중 적어도 하나를 포함할 수 있다. 입력부는, 영상 신호 입력을 위한 카메라 또는 영상 입력부, 오디오 신호 입력을 위한 마이크로폰 (microphone, 122), 또는 오디오 입력부, 사용자로부터 정보를 입력받기 위한 사용자 입력부(123, 예를 들어, 터치키(touch key), 푸시키(mechanical key) 등)를 포함할 수 있다. 입력부에서 수집한 음성 데이터나 이 미지 데이터는 분석되어 사용자의 제어명령으로 처리될 수 있다.센싱부는 이동 단말기 내 정보, 이동 단말기를 둘러싼 주변 환경 정보 및 사용자 정보 중 적어도 하나를 센싱하기 위한 하나 이상의 센서를 포함할 수 있다. 예를 들어, 센싱부는 근접센서(141, proximity sensor), 조도 센서(142, illumination sensor), 터치 센서(touch sensor), 가속도 센서(acceleration sensor), 자기 센서(magnetic sensor), 중력 센서(G-sensor), 자이로스코프 센서(gyroscope sensor), 모션 센 서(motion sensor), RGB 센서, 적외선 센서(IR 센서: infrared sensor), 지문인식 센서(finger scan sensor), 초음파 센서(ultrasonic sensor), 광 센서(optical sensor, 예를 들어, 카메라(121 참조)), 마이크로폰 (microphone, 122 참조), 배터리 게이지(battery gauge), 환경 센서(예를 들어, 기압계, 습도계, 온도계, 방사 능 감지 센서, 열 감지 센서, 가스 감지 센서 등), 화학 센서(예를 들어, 전자 코, 헬스케어 센서, 생체 인식 센서 등) 중 적어도 하나를 포함할 수 있다. 한편, 본 명세서에 개시된 이동 단말기는, 이러한 센서들 중 적어 도 둘 이상의 센서에서 센싱되는 정보들을 조합하여 활용할 수 있다. 출력부는 시각, 청각 또는 촉각 등과 관련된 출력을 발생시키기 위한 것으로, 디스플레이부, 음향 출 력부, 햅팁 모듈, 광 출력부 중 적어도 하나를 포함할 수 있다. 디스플레이부는 터치 센서 와 상호 레이어 구조를 이루거나 일체형으로 형성됨으로써, 터치 스크린을 구현할 수 있다. 이러한 터치 스크린 은, 이동 단말기와 사용자 사이의 입력 인터페이스를 제공하는 사용자 입력부로써 기능함과 동시에, 이동 단말기와 사용자 사이의 출력 인터페이스를 제공할 수 있다. 인터페이스부는 이동 단말기에 연결되는 다양한 종류의 외부 기기와의 통로 역할을 수행한다. 이러한 인터페이스부는, 유/무선 헤드셋 포트(port), 외부 충전기 포트(port), 유/무선 데이터 포트(port), 메모 리 카드(memory card) 포트, 식별 모듈이 구비된 장치를 연결하는 포트(port), 오디오 I/O(Input/Output) 포트 (port), 비디오 I/O(Input/Output) 포트(port), 이어폰 포트(port) 중 적어도 하나를 포함할 수 있다. 이동 단 말기에서는, 상기 인터페이스부에 외부 기기가 연결되는 것에 대응하여, 연결된 외부 기기와 관련된 적절할 제어를 수행할 수 있다. 또한, 메모리는 이동 단말기의 다양한 기능을 지원하는 데이터를 저장한다. 메모리는 이동 단말 기에서 구동되는 다수의 응용 프로그램(application program 또는 애플리케이션(application)), 이동 단 말기의 동작을 위한 데이터들, 명령어들을 저장할 수 있다. 이러한 응용 프로그램 중 적어도 일부는, 무선 통신을 통해 외부 서버로부터 다운로드 될 수 있다. 또한 이러한 응용 프로그램 중 적어도 일부는, 이동 단말기 의 기본적인 기능(예를 들어, 전화 착신, 발신 기능, 메시지 수신, 발신 기능)을 위하여 출고 당시부터 이 동 단말기상에 존재할 수 있다. 한편, 응용 프로그램은, 메모리에 저장되고, 이동 단말기 상에 설치되어, 제어부에 의하여 상기 이동 단말기의 동작(또는 기능)을 수행하도록 구동될 수 있다. 제어부는 상기 응용 프로그램과 관련된 동작 외에도, 통상적으로 이동 단말기의 전반적인 동작을 제 어한다. 제어부는 위에서 살펴본 구성요소들을 통해 입력 또는 출력되는 신호, 데이터, 정보 등을 처리하 거나 메모리에 저장된 응용 프로그램을 구동함으로써, 사용자에게 적절한 정보 또는 기능을 제공 또는 처 리할 수 있다. 또한, 제어부는 메모리에 저장된 응용 프로그램을 구동하기 위하여, 도 1a와 함께 살펴본 구성요소들 중 적어도 일부를 제어할 수 있다. 나아가, 제어부는 상기 응용 프로그램의 구동을 위하여, 이동 단말기 에 포함된 구성요소들 중 적어도 둘 이상을 서로 조합하여 동작시킬 수 있다. 전원공급부는 제어부의 제어 하에서, 외부의 전원, 내부의 전원을 인가 받아 이동 단말기에 포 함된 각 구성요소들에 전원을 공급한다. 이러한 전원공급부는 배터리를 포함하며, 상기 배터리는 내장형 배터리 또는 교체가능한 형태의 배터리가 될 수 있다. 상기 각 구성요소들 중 적어도 일부는, 이하에서 설명되는 다양한 실시 예들에 따른 이동 단말기의 동작, 제어, 또는 제어방법을 구현하기 위하여 서로 협력하여 동작할 수 있다. 또한, 상기 이동 단말기의 동작, 제어, 또는 제어방법은 상기 메모리에 저장된 적어도 하나의 응용 프로그램의 구동에 의하여 이동 단말기 상에서 구현 될 수 있다. 이하에서는, 위에서 살펴본 이동 단말기를 통하여 구현되는 다양한 실시 예들을 살펴보기에 앞서, 위에서 열거된 구성요소들에 대하여 도 1a를 참조하여 보다 구체적으로 살펴본다. 먼저, 무선 통신부에 대하여 살펴보면, 무선 통신부의 방송 수신 모듈은 방송 채널을 통하여 외 부의 방송 관리 서버로부터 방송 신호 및/또는 방송 관련된 정보를 수신한다. 상기 방송 채널은 위성 채널, 지 상파 채널을 포함할 수 있다. 적어도 두 개의 방송 채널들에 대한 동시 방송 수신 또는 방송 채널 스위칭을 위해 둘 이상의 상기 방송 수신 모듈이 상기 이동단말기에 제공될 수 있다. 이동통신 모듈은, 이동통신을 위한 기술표준들 또는 통신방식(예를 들어, GSM(Global System for Mobile communication), CDMA(Code Division Multi Access), CDMA2000(Code Division Multi Access 2000), EV- DO(Enhanced Voice-Data Optimized or Enhanced Voice-Data Only), WCDMA(Wideband CDMA), HSDPA(High Speed Downlink Packet Access), HSUPA(High Speed Uplink Packet Access), LTE(Long Term Evolution), LTE-A(Long Term Evolution-Advanced) 등)에 따라 구축된 이동 통신망 상에서 기지국, 외부의 단말, 서버 중 적어도 하나와 무선 신호를 송수신한다. 상기 무선 신호는, 음성 호 신호, 화상 통화 호 신호 또는 문자/멀티미디어 메시지 송수신에 따른 다양한 형태 의 데이터를 포함할 수 있다. 무선 인터넷 모듈은 무선 인터넷 접속을 위한 모듈을 말하는 것으로, 이동 단말기에 내장되거나 외장 될 수 있다. 무선 인터넷 모듈은 무선 인터넷 기술들에 따른 통신망에서 무선 신호를 송수신하도록 이루어 진다. 무선 인터넷 기술로는, 예를 들어 WLAN(Wireless LAN), Wi-Fi(Wireless-Fidelity), Wi-Fi(Wireless Fidelity) Direct, DLNA(Digital Living Network Alliance), WiBro(Wireless Broadband), WiMAX(World Interoperability for Microwave Access), HSDPA(High Speed Downlink Packet Access), HSUPA(High Speed Uplink Packet Access), LTE(Long Term Evolution), LTE-A(Long Term Evolution-Advanced) 등이 있으며, 상기 무선 인터넷 모 듈은 상기에서 나열되지 않은 인터넷 기술까지 포함한 범위에서 적어도 하나의 무선 인터넷 기술에 따라 데이터를 송수신하게 된다. WiBro, HSDPA, HSUPA, GSM, CDMA, WCDMA, LTE, LTE-A 등에 의한 무선인터넷 접속은 이동통신망을 통해 이루어 진다는 관점에서 본다면, 상기 이동통신망을 통해 무선인터넷 접속을 수행하는 상기 무선 인터넷 모듈은 상기 이동통신 모듈의 일종으로 이해될 수도 있다. 근거리 통신 모듈은 근거리 통신(Short range communication)을 위한 것으로서, 블루투스(Bluetooth™), RFID(Radio Frequency Identification), 적외선 통신(Infrared Data Association; IrDA), UWB(Ultra Wideband), ZigBee, NFC(Near Field Communication), Wi-Fi(Wireless-Fidelity), Wi-Fi Direct, Wireless USB(Wireless Universal Serial Bus) 기술 중 적어도 하나를 이용하여, 근거리 통신을 지원할 수 있다. 이러한, 근거리 통신 모듈은, 근거리 무선 통신망(Wireless Area Networks)을 통해 이동 단말기와 무선 통신 시스템 사이, 이동 단말기와 다른 이동 단말기 사이, 또는 이동 단말기와 다른 이동 단말기(100, 또는 외부서버)가 위치한 네트워크 사이의 무선 통신을 지원할 수 있다. 상기 근거리 무선 통신망 은 근거리 무선 개인 통신망(Wireless Personal Area Networks)일 수 있다. 여기에서, 다른 이동 단말기는 본 발명에 따른 이동 단말기와 데이터를 상호 교환하는 것이 가능한 (또는 연동 가능한) 웨어러블 디바이스(wearable device, 예를 들어, 스마트워치(smartwatch), 스마트 글래스 (smart glass), HMD(head mounted display))가 될 수 있다. 근거리 통신 모듈은, 이동 단말기 주변 에, 상기 이동 단말기와 통신 가능한 웨어러블 디바이스를 감지(또는 인식)할 수 있다. 나아가, 제어부 는 상기 감지된 웨어러블 디바이스가 본 발명에 따른 이동 단말기와 통신하도록 인증된 디바이스인 경우, 이동 단말기에서 처리되는 데이터의 적어도 일부를, 상기 근거리 통신 모듈을 통해 웨어러블 디바이스로 전송할 수 있다. 따라서 웨어러블 디바이스의 사용자는, 이동 단말기에서 처리되는 데이터를, 웨어러블 디바이스를 통해 이용할 수 있다. 예를 들어, 이에 따르면 사용자는, 이동 단말기에 전화가 수신 된 경우, 웨어러블 디바이스를 통해 전화 통화를 수행하거나, 이동 단말기에 메시지가 수신된 경우, 웨어 러블 디바이스를 통해 상기 수신된 메시지를 확인하는 것이 가능하다. 위치정보 모듈은 이동 단말기의 위치(또는 현재 위치)를 획득하기 위한 모듈로서, 그의 대표적인 예로는 GPS(Global Positioning System) 모듈 또는 WiFi(Wireless Fidelity) 모듈이 있다. 예를 들어, 이동 단말기는 GPS모듈을 활용하면, GPS 위성에서 보내는 신호를 이용하여 이동 단말기의 위치를 획득할 수 있다. 다른 예로서, 이동 단말기는 Wi-Fi모듈을 활용하면, Wi-Fi모듈과 무선신호를 송신 또는 수신하는 무선 AP(Wireless Access Point)의 정보에 기반하여, 이동 단말기의 위치를 획득할 수 있다. 필요에 따라서, 위치정보모듈은 치환 또는 부가적으로 이동 단말기의 위치에 관한 데이터를 얻기 위해 무선 통신부의 다른 모듈 중 어느 기능을 수행할 수 있다. 위치정보모듈은 이동 단말기의 위치(또는 현재 위치)를 획득하기 위해 이용되는 모듈로, 이동 단말기의 위치를 직접적으로 계산하거나 획득하는 모듈로 한정되지는 않는다.다음으로, 입력부는 영상 정보(또는 신호), 오디오 정보(또는 신호), 데이터, 또는 사용자로부터 입력되는 정보의 입력을 위한 것으로서, 영상 정보의 입력을 위하여, 이동 단말기는 하나 또는 복수의 카메라 를 구비할 수 있다. 카메라는 화상 통화모드 또는 촬영 모드에서 이미지 센서에 의해 얻어지는 정지영상 또는 동영상 등의 화상 프레임을 처리한다. 처리된 화상 프레임은 디스플레이부에 표시되거나 메모리(17 0)에 저장될 수 있다. 한편, 이동 단말기에 구비되는 복수의 카메라는 매트릭스 구조를 이루도록 배 치될 수 있으며, 이와 같이 매트릭스 구조를 이루는 카메라를 통하여, 이동 단말기에는 다양한 각도 또는 초점을 갖는 복수의 영상정보가 입력될 수 있다. 또한, 복수의 카메라는 입체영상을 구현하기 위한 좌 영상 및 우 영상을 획득하도록, 스트레오 구조로 배치될 수 있다. 마이크로폰은 외부의 음향 신호를 전기적인 음성 데이터로 처리한다. 처리된 음성 데이터는 이동 단말기 에서 수행 중인 기능(또는 실행 중인 응용 프로그램)에 따라 다양하게 활용될 수 있다. 한편, 마이크로폰 에는 외부의 음향 신호를 입력 받는 과정에서 발생되는 잡음(noise)을 제거하기 위한 다양한 잡음 제거 알 고리즘이 구현될 수 있다. 사용자 입력부는 사용자로부터 정보를 입력받기 위한 것으로서, 사용자 입력부를 통해 정보가 입력되 면, 제어부는 입력된 정보에 대응되도록 이동 단말기의 동작을 제어할 수 있다. 이러한, 사용자 입력 부는 기계식 (mechanical) 입력수단(또는, 메커니컬 키, 예를 들어, 이동 단말기의 전·후면 또는 측 면에 위치하는 버튼, 돔 스위치 (dome switch), 조그 휠, 조그 스위치 등) 및 터치식 입력수단을 포함할 수 있 다. 일 예로서, 터치식 입력수단은, 소프트웨어적인 처리를 통해 터치스크린에 표시되는 가상 키(virtual key), 소프트 키(soft key) 또는 비주얼 키(visual key)로 이루어지거나, 상기 터치스크린 이외의 부분에 배치되는 터 치 키(touch key)로 이루어질 수 있다. 한편, 상기 가상키 또는 비주얼 키는, 다양한 형태를 가지면서 터치스크 린 상에 표시되는 것이 가능하며, 예를 들어, 그래픽(graphic), 텍스트(text), 아이콘(icon), 비디오(video) 또 는 이들의 조합으로 이루어질 수 있다. 한편, 센싱부는 이동 단말기 내 정보, 이동 단말기를 둘러싼 주변 환경 정보 및 사용자 정보 중 적어도 하 나를 센싱하고, 이에 대응하는 센싱 신호를 발생시킨다. 제어부는 이러한 센싱 신호에 기초하여, 이동 단 말기의 구동 또는 동작을 제어하거나, 이동 단말기에 설치된 응용 프로그램과 관련된 데이터 처리, 기능 또는 동작을 수행 할 수 있다. 센싱부에 포함될 수 있는 다양한 센서 중 대표적인 센서들의 대하여, 보다 구체적으로 살펴본다. 먼저, 근접 센서는 소정의 검출면에 접근하는 물체, 혹은 근방에 존재하는 물체의 유무를 전자계의 힘 또 는 적외선 등을 이용하여 기계적 접촉이 없이 검출하는 센서를 말한다. 이러한 근접 센서는 위에서 살펴본 터치 스크린에 의해 감싸지는 이동 단말기의 내부 영역 또는 상기 터치 스크린의 근처에 근접 센서가 배치 될 수 있다. 근접 센서의 예로는 투과형 광전 센서, 직접 반사형 광전 센서, 미러 반사형 광전 센서, 고주파 발진형 근 접 센서, 정전 용량형 근접 센서, 자기형 근접 센서, 적외선 근접 센서 등이 있다. 터치 스크린이 정전식인 경 우에, 근접 센서는 전도성을 갖는 물체의 근접에 따른 전계의 변화로 상기 물체의 근접을 검출하도록 구성 될 수 있다. 이 경우 터치 스크린(또는 터치 센서) 자체가 근접 센서로 분류될 수 있다. 한편, 설명의 편의를 위해, 터치 스크린 상에 물체가 접촉되지 않으면서 근접되어 상기 물체가 상기 터치 스크 린 상에 위치함이 인식되도록 하는 행위를 \"근접 터치(proximity touch)\"라고 명명하고, 상기 터치 스크린 상에 물체가 실제로 접촉되는 행위를 \"접촉 터치(contact touch)\"라고 명명한다. 상기 터치 스크린 상에서 물체가 근 접 터치 되는 위치라 함은, 상기 물체가 근접 터치될 때 상기 물체가 상기 터치 스크린에 대해 수직으로 대응되 는 위치를 의미한다. 상기 근접 센서는, 근접 터치와, 근접 터치 패턴(예를 들어, 근접 터치 거리, 근접 터치 방향, 근접 터치 속도, 근접 터치 시간, 근접 터치 위치, 근접 터치 이동 상태 등)을 감지할 수 있다. 한 편, 제어부는 위와 같이, 근접 센서를 통해 감지된 근접 터치 동작 및 근접 터치 패턴에 상응하는 데 이터(또는 정보)를 처리하며, 나아가, 처리된 데이터에 대응하는 시각적인 정보를 터치 스크린상에 출력시킬 수 있다. 나아가, 제어부는, 터치 스크린 상의 동일한 지점에 대한 터치가, 근접 터치인지 또는 접촉 터치인 지에 따라, 서로 다른 동작 또는 데이터(또는 정보)가 처리되도록 이동 단말기를 제어할 수 있다. 터치 센서는 저항막 방식, 정전용량 방식, 적외선 방식, 초음파 방식, 자기장 방식 등 여러가지 터치방식 중 적 어도 하나를 이용하여 터치 스크린(또는 디스플레이부)에 가해지는 터치(또는 터치입력)을 감지한다. 일 예로서, 터치 센서는, 터치 스크린의 특정 부위에 가해진 압력 또는 특정 부위에 발생하는 정전 용량 등의 변화를 전기적인 입력신호로 변환하도록 구성될 수 있다. 터치 센서는, 터치 스크린 상에 터치를 가하는 터치 대상체가 터치 센서 상에 터치 되는 위치, 면적, 터치 시의 압력, 터치 시의 정전 용량 등을 검출할 수 있도록 구성될 수 있다. 여기에서, 터치 대상체는 상기 터치 센서에 터치를 인가하는 물체로서, 예를 들어, 손가락, 터 치펜 또는 스타일러스 펜(Stylus pen), 포인터 등이 될 수 있다. 이와 같이, 터치 센서에 대한 터치 입력이 있는 경우, 그에 대응하는 신호(들)는 터치 제어기로 보내진다. 터치 제어기는 그 신호(들)를 처리한 다음 대응하는 데이터를 제어부로 전송한다. 이로써, 제어부는 디스 플레이부의 어느 영역이 터치 되었는지 여부 등을 알 수 있게 된다. 여기에서, 터치 제어기는, 제어부 와 별도의 구성요소일 수 있고, 제어부 자체일 수 있다. 한편, 제어부는, 터치 스크린(또는 터치 스크린 이외에 구비된 터치키)을 터치하는, 터치 대상체의 종류에 따라 서로 다른 제어를 수행하거나, 동일한 제어를 수행할 수 있다. 터치 대상체의 종류에 따라 서로 다른 제어 를 수행할지 또는 동일한 제어를 수행할 지는, 현재 이동 단말기의 동작상태 또는 실행 중인 응용 프로그 램에 따라 결정될 수 있다. 한편, 위에서 살펴본 터치 센서 및 근접 센서는 독립적으로 또는 조합되어, 터치 스크린에 대한 숏(또는 탭) 터 치(short touch), 롱 터치(long touch), 멀티 터치(multi touch), 드래그 터치(drag touch), 플리크 터치 (flick touch), 핀치-인 터치(pinch-in touch), 핀치-아웃 터치(pinch-out 터치), 스와이프(swype) 터치, 호버 링(hovering) 터치 등과 같은, 다양한 방식의 터치를 센싱할 수 있다. 초음파 센서는 초음파를 이용하여, 감지대상의 위치정보를 인식할 수 있다. 한편 제어부는 광 센서와 복수 의 초음파 센서로부터 감지되는 정보를 통해, 파동 발생원의 위치를 산출하는 것이 가능하다. 파동 발생원의 위 치는, 광이 초음파보다 매우 빠른 성질, 즉, 광이 광 센서에 도달하는 시간이 초음파가 초음파 센서에 도달하는 시간보다 매우 빠름을 이용하여, 산출될 수 있다. 보다 구체적으로 광을 기준 신호로 초음파가 도달하는 시간과 의 시간차를 이용하여 파동 발생원의 위치가 산출될 수 있다. 한편, 입력부의 구성으로 살펴본, 카메라는 카메라 센서(예를 들어, CCD, CMOS 등), 포토 센서(또는 이미지 센서) 및 레이저 센서 중 적어도 하나를 포함한다. 카메라와 레이저 센서는 서로 조합되어, 3차원 입체영상에 대한 감지대상의 터치를 감지할 수 있다. 포토 센서는 디스플레이 소자에 적층될 수 있는데, 이러한 포토 센서는 터치 스크린에 근접한 감지대상의 움직임을 스캐닝하도록 이루어진다. 보다 구체적으로, 포토 센서는 행/열에 Photo Diode와 TR(Transistor)를 실장하여 Photo Diode에 인가되는 빛의 양에 따라 변화되는 전기적 신호를 이용하여 포토 센서 위에 올려지는 내용물을 스캔한다. 즉, 포토 센서는 빛의 변화량에 따른 감지대상의 좌표 계산을 수행하며, 이를 통하여 감지대상의 위 치정보가 획득될 수 있다. 디스플레이부는 이동 단말기에서 처리되는 정보를 표시(출력)한다. 예를 들어, 디스플레이부는 이동 단말기에서 구동되는 응용 프로그램의 실행화면 정보, 또는 이러한 실행화면 정보에 따른 UI(User Interface), GUI(Graphic User Interface) 정보를 표시할 수 있다. 또한, 상기 디스플레이부는 입체영상을 표시하는 입체 디스플레이부로서 구성될 수 있다. 상기 입체 디스플레이부에는 스테레오스코픽 방식(안경 방식), 오토 스테레오스코픽 방식(무안경 방식), 프로젝 션 방식(홀로그래픽 방식) 등의 3차원 디스플레이 방식이 적용될 수 있다. 음향 출력부는 호 신호 수신, 통화모드 또는 녹음 모드, 음성인식 모드, 방송수신 모드 등에서 무선 통신 부로부터 수신되거나 메모리에 저장된 오디오 데이터를 출력할 수 있다. 음향 출력부는 이동 단 말기에서 수행되는 기능(예를 들어, 호신호 수신음, 메시지 수신음 등)과 관련된 음향 신호를 출력하기도 한다. 이러한 음향 출력부에는 리시버(receiver), 스피커(speaker), 버저(buzzer) 등이 포함될 수 있다. 햅틱 모듈(haptic module)은 사용자가 느낄 수 있는 다양한 촉각 효과를 발생시킨다. 햅틱 모듈이 발 생시키는 촉각 효과의 대표적인 예로는 진동이 될 수 있다. 햅틱 모듈에서 발생하는 진동의 세기와 패턴 등은 사용자의 선택 또는 제어부의 설정에 의해 제어될 수 있다. 예를 들어, 상기 햅틱 모듈은 서로 다른 진동을 합성하여 출력하거나 순차적으로 출력할 수도 있다. 햅틱 모듈은, 진동 외에도, 접촉 피부면에 대해 수직 운동하는 핀 배열, 분사구나 흡입구를 통한 공기의 분사력이나 흡입력, 피부 표면에 대한 스침, 전극(electrode)의 접촉, 정전기력 등의 자극에 의한 효과와, 흡열이나 발열 가능한 소자를 이용한 냉온감 재현에 의한 효과 등 다양한 촉각 효과를 발생시킬 수 있다. 햅틱 모듈은 직접적인 접촉을 통해 촉각 효과를 전달할 수 있을 뿐만 아니라, 사용자가 손가락이나 팔 등 의 근 감각을 통해 촉각 효과를 느낄 수 있도록 구현할 수도 있다. 햅틱 모듈은 이동 단말기의 구성 태양에 따라 2개 이상이 구비될 수 있다. 광출력부는 이동 단말기의 광원의 빛을 이용하여 이벤트 발생을 알리기 위한 신호를 출력한다. 이동 단말기에서 발생 되는 이벤트의 예로는 메시지 수신, 호 신호 수신, 부재중 전화, 알람, 일정 알림, 이메 일 수신, 애플리케이션을 통한 정보 수신 등이 될 수 있다. 광출력부가 출력하는 신호는 이동 단말기가 전면이나 후면으로 단색이나 복수색의 빛을 발광함에 따라 구 현된다. 상기 신호 출력은 이동 단말기가 사용자의 이벤트 확인을 감지함에 의하여 종료될 수 있다. 인터페이스부는 이동 단말기에 연결되는 모든 외부 기기와의 통로 역할을 한다. 인터페이스부는 외부 기기로부터 데이터를 전송받거나, 전원을 공급받아 이동 단말기 내부의 각 구성요소에 전달하거나, 이동 단말기 내부의 데이터가 외부 기기로 전송되도록 한다. 예를 들어, 유/무선 헤드셋 포트(port), 외부 충전기 포트(port), 유/무선 데이터 포트(port), 메모리 카드(memory card) 포트(port), 식별 모듈이 구비된 장치를 연결하는 포트(port), 오디오 I/O(Input/Output) 포트(port), 비디오 I/O(Input/Output) 포트(port), 이어폰 포트(port) 등이 인터페이스부에 포함될 수 있다. 한편, 식별 모듈은 이동 단말기의 사용 권한을 인증하기 위한 각종 정보를 저장한 칩으로서, 사용자 인증 모듈(user identify module; UIM), 가입자 인증 모듈(subscriber identity module; SIM), 범용 사용자 인증 모 듈(universal subscriber identity module; USIM) 등을 포함할 수 있다. 식별 모듈이 구비된 장치(이하 '식별 장치')는, 스마트 카드(smart card) 형식으로 제작될 수 있다. 따라서 식별 장치는 상기 인터페이스부를 통하여 단말기와 연결될 수 있다. 또한, 상기 인터페이스부는 이동 단말기가 외부 크래들(cradle)과 연결될 때 상기 크래들로부터의 전 원이 상기 이동 단말기에 공급되는 통로가 되거나, 사용자에 의해 상기 크래들에서 입력되는 각종 명령 신 호가 상기 이동 단말기로 전달되는 통로가 될 수 있다. 상기 크래들로부터 입력되는 각종 명령 신호 또는 상기 전원은 상기 이동 단말기가 상기 크래들에 정확히 장착되었음을 인지하기 위한 신호로 동작될 수 있 다. 메모리는 제어부의 동작을 위한 프로그램을 저장할 수 있고, 입/출력되는 데이터들(예를 들어, 폰북, 메시지, 정지영상, 동영상 등)을 임시 저장할 수도 있다. 상기 메모리는 상기 터치 스크린 상의 터치 입력 시 출력되는 다양한 패턴의 진동 및 음향에 관한 데이터를 저장할 수 있다. 메모리는 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), SSD 타입(Solid State Disk type), SDD 타입(Silicon Disk Drive type), 멀티미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 램(random access memory; RAM), SRAM(static random access memory), 롬(read-only memory; ROM), EEPROM(electrically erasable programmable read-only memory), PROM(programmable read-only memory), 자기 메모리, 자기 디스크 및 광디스 크 중 적어도 하나의 타입의 저장매체를 포함할 수 있다. 이동 단말기는 인터넷(internet)상에서 상기 메 모리의 저장 기능을 수행하는 웹 스토리지(web storage)와 관련되어 동작될 수도 있다. 한편, 앞서 살펴본 것과 같이, 제어부는 응용 프로그램과 관련된 동작과, 통상적으로 이동 단말기의 전반적인 동작을 제어한다. 예를 들어, 제어부는 상기 이동 단말기의 상태가 설정된 조건을 만족하면, 애 플리케이션들에 대한 사용자의 제어 명령의 입력을 제한하는 잠금 상태를 실행하거나, 해제할 수 있다. 또한, 제어부는 음성 통화, 데이터 통신, 화상 통화 등과 관련된 제어 및 처리를 수행하거나, 터치 스크린 상에서 행해지는 필기 입력 또는 그림 그리기 입력을 각각 문자 및 이미지로 인식할 수 있는 패턴 인식 처리를 행할 수 있다. 나아가 제어부는 이하에서 설명되는 다양한 실시 예들을 본 발명에 따른 이동 단말기 상에서 구현하기 위하여, 위에서 살펴본 구성요소들을 중 어느 하나 또는 복수를 조합하여 제어할 수 있다. 전원 공급부는 제어부의 제어에 의해 외부의 전원, 내부의 전원을 인가 받아 각 구성요소들의 동작에 필요한 전원을 공급한다. 전원공급부는 배터리를 포함하며, 배터리는 충전 가능하도록 이루어지는 내장형 배터리가 될 수 있으며, 충전 등을 위하여 단말기 바디에 착탈 가능하게 결합될 수 있다. 또한, 전원공급부는 연결포트를 구비할 수 있으며, 연결포트는 배터리의 충전을 위하여 전원을 공급하는 외부 충전기가 전기적으로 연결되는 인터페이스의 일 예로서 구성될 수 있다. 다른 예로서, 전원공급부는 상기 연결포트를 이용하지 않고 무선방식으로 배터리를 충전하도록 이루어질 수 있다. 이 경우에, 전원공급부는 외부의 무선 전력 전송장치로부터 자기 유도 현상에 기초한 유도 결합 (Inductive Coupling) 방식이나 전자기적 공진 현상에 기초한 공진 결합(Magnetic Resonance Coupling) 방식 중 하나 이상을 이용하여 전력을 전달받을 수 있다. 한편, 이하에서 다양한 실시 예는 예를 들어, 소프트웨어, 하드웨어 또는 이들의 조합된 것을 이용하여 컴퓨터 또는 이와 유사한 장치로 읽을 수 있는 기록매체 내에서 구현될 수 있다. 이하, 상기 도 1a에서 살펴본 본 발명의 일 실시 예에 따른 이동 단말기 또는 이동 단말기의 구성요소들이 배치 된 이동 단말기 또는 이동 단말기의 구조를 도 1b 및 1c를 참조하여 살펴보기로 한다. 도 1b 및 1c를 참조하면, 개시된 이동 단말기는 바 형태의 단말기 바디를 구비하고 있다. 다만, 본 발명은 여기에 한정되지 않고 와치 타입, 클립 타입, 글래스 타입 또는 2 이상의 바디들이 상대 이동 가능하게 결합되 는 폴더 타입, 플립 타입, 슬라이드 타입, 스윙 타입, 스위블 타입 등 다양한 구조에 적용될 수 있다. 이동 단 말기의 특정 유형에 관련될 것이나, 이동 단말기의 특정유형에 관한 설명은 다른 타입의 이동 단말기에 일반적 으로 적용될 수 있다. 여기에서, 단말기 바디는 이동 단말기를 적어도 하나의 집합체로 보아 이를 지칭하는 개념으로 이해될 수 있다. 이동 단말기는 외관을 이루는 케이스(예를 들면, 프레임, 하우징, 커버 등)를 포함한다. 도시된 바와 같이, 이동 단말기는 프론트 케이스와 리어 케이스를 포함할 수 있다. 프론트 케이스와 리 어 케이스의 결합에 의해 형성되는 내부공간에는 각종 전자부품들이 배치된다. 프론트 케이스와 리어 케이스 사이에는 적어도 하나의 미들 케이스가 추가로 배치될 수 있다. 단말기 바디의 전면에는 디스플레이부가 배치되어 정보를 출력할 수 있다. 도시된 바와 같이, 디스플레이 부의 윈도우(151a)는 프론트 케이스에 장착되어 프론트 케이스와 함께 단말기 바디의 전면을 형 성할 수 있다. 경우에 따라서, 리어 케이스에도 전자부품이 장착될 수 있다. 리어 케이스에 장착 가능한 전자부품은 착탈 가능한 배터리, 식별 모듈, 메모리 카드 등이 있다. 이 경우, 리어 케이스에는 장착된 전자부품을 덮 기 위한 후면커버가 착탈 가능하게 결합될 수 있다. 따라서, 후면 커버가 리어 케이스로부터 분 리되면, 리어 케이스에 장착된 전자부품은 외부로 노출된다. 도시된 바와 같이, 후면커버가 리어 케이스에 결합되면, 리어 케이스의 측면 일부가 노출될 수 있다. 경우에 따라서, 상기 결합시 리어 케이스는 후면커버에 의해 완전히 가려질 수도 있다. 한편, 후면커버에는 카메라(121b)나 음향 출력부(152b)를 외부로 노출시키기 위한 개구부가 구비될 수 있다. 이러한 케이스들(101, 102, 103)은 합성수지를 사출하여 형성되거나 금속, 예를 들어 스테인레스 스틸(STS), 알 루미늄(Al), 티타늄(Ti) 등으로 형성될 수도 있다. 이동 단말기는, 복수의 케이스가 각종 전자부품들을 수용하는 내부 공간을 마련하는 위의 예와 달리, 하나 의 케이스가 상기 내부 공간을 마련하도록 구성될 수도 있다. 이 경우, 합성수지 또는 금속이 측면에서 후면으 로 이어지는 유니 바디의 이동 단말기가 구현될 수 있다. 한편, 이동 단말기는 단말기 바디 내부로 물이 스며들지 않도록 하는 방수부(미도시)를 구비할 수 있다. 예를 들어, 방수부는 윈도우(151a)와 프론트 케이스 사이, 프론트 케이스와 리어 케이스 사이 또는 리어 케이스와 후면 커버 사이에 구비되어, 이들의 결합 시 내부 공간을 밀폐하는 방수부재를 포함할 수 있다. 이동 단말기에는 디스플레이부, 제1 및 제2 음향 출력부(152a, 152b), 근접 센서, 조도 센서 , 광 출력부, 제1 및 제2 카메라(121a, 121b), 제1 및 제2 조작유닛(123a, 123b), 마이크로폰, 인터페이스부 등이 구비될 수 있다. 이하에서는, 도 1b 및 도 1c에 도시된 바와 같이, 단말기 바디의 전면에 디스플레이부, 제1 음향 출력부 (152a), 근접 센서, 조도 센서, 광 출력부, 제1 카메라(121a) 및 제1 조작유닛(123a)이 배치되 고, 단말기 바디의 측면에 제2 조작유닛(123b), 마이크로폰 및 인터페이스부이 배치되며, 단말기 바디의 후면에 제2 음향 출력부(152b) 및 제2 카메라(121b)가 배치된 이동 단말기를 일 예로 들어 설명한다. 다만, 이들 구성은 이러한 배치에 한정되는 것은 아니다. 이들 구성은 필요에 따라 제외 또는 대체되거나, 다른 면에 배치될 수 있다. 예를 들어, 단말기 바디의 전면에는 제1 조작유닛(123a)이 구비되지 않을 수 있으며, 제2 음향 출력부(152b)는 단말기 바디의 후면이 아닌 단말기 바디의 측면에 구비될 수 있다. 디스플레이부는 이동 단말기에서 처리되는 정보를 표시(출력)한다. 예를 들어, 디스플레이부는 이동 단말기에서 구동되는 응용 프로그램의 실행화면 정보, 또는 이러한 실행화면 정보에 따른 UI(User Interface), GUI(Graphic User Interface) 정보를 표시할 수 있다. 디스플레이부는 액정 디스플레이(liquid crystal display, LCD), 박막 트랜지스터 액정 디스플레이(thin film transistor-liquid crystal display, TFT LCD), 유기 발광 다이오드(organic light-emitting diode, OLED), 플렉서블 디스플레이(flexible display), 3차원 디스플레이(3D display), 전자잉크 디스플레이(e-ink display) 중에서 적어도 하나를 포함할 수 있다. 또한, 디스플레이부는 이동 단말기의 구현 형태에 따라 2개 이상 존재할 수 있다. 이 경우, 이동 단 말기에는 복수의 디스플레이부들이 하나의 면에 이격되거나 일체로 배치될 수 있고, 또한 서로 다른 면에 각각 배치될 수도 있다. 디스플레이부는 터치 방식에 의하여 제어 명령을 입력 받을 수 있도록, 디스플레이부에 대한 터치를 감지하는 터치 센서를 포함할 수 있다. 이를 이용하여, 디스플레이부에 대하여 터치가 이루어지면, 터치센 서는 상기 터치를 감지하고, 제어부는 이에 근거하여 상기 터치에 대응하는 제어명령을 발생시키도록 이루 어질 수 있다. 터치 방식에 의하여 입력되는 내용은 문자 또는 숫자이거나, 각종 모드에서의 지시 또는 지정 가 능한 메뉴항목 등일 수 있다. 한편, 터치센서는, 터치패턴을 구비하는 필름 형태로 구성되어 윈도우(151a)와 윈도우(151a)의 배면 상의 디스 플레이(미도시) 사이에 배치되거나, 윈도우(151a)의 배면에 직접 패터닝되는 메탈 와이어가 될 수도 있다. 또는, 터치센서는 디스플레이와 일체로 형성될 수 있다. 예를 들어, 터치센서는, 디스플레이의 기판 상에 배치 되거나, 디스플레이의 내부에 구비될 수 있다. 이처럼, 디스플레이부는 터치 센서와 함께 터치 스크린을 형성할 수 있으며, 이 경우에 터치 스크린은 사 용자 입력부(123, 도 1a 참조)로 기능할 수 있다. 경우에 따라, 터치 스크린은 제1조작유닛(123a)의 적어도 일 부 기능을 대체할 수 있다. 제1 음향 출력부(152a)는 통화음을 사용자의 귀에 전달시키는 리시버(receiver)로 구현될 수 있으며, 제2 음향 출력부(152b)는 각종 알람음이나 멀티미디어의 재생음을 출력하는 라우드 스피커(loud speaker)의 형태로 구현 될 수 있다. 디스플레이부의 윈도우(151a)에는 제1 음향 출력부(152a)로부터 발생되는 사운드의 방출을 위한 음향홀이 형성될 수 있다. 다만, 본 발명은 이에 한정되는 것은 아니고, 상기 사운드는 구조물 간의 조립틈(예를 들어, 윈도우(151a)와 프론트 케이스 간의 틈)을 따라 방출되도록 구성될 수 있다. 이 경우, 외관상 음향 출력을 위하여 독립적으로 형성되는 홀이 보이지 않거나 숨겨져 이동 단말기의 외관이 보다 심플해질 수 있다. 광 출력부는 이벤트의 발생시 이를 알리기 위한 빛을 출력하도록 이루어진다. 상기 이벤트의 예로는 메시 지 수신, 호 신호 수신, 부재중 전화, 알람, 일정 알림, 이메일 수신, 애플리케이션을 통한 정보 수신 등을 들 수 있다. 제어부는 사용자의 이벤트 확인이 감지되면, 빛의 출력이 종료되도록 광 출력부를 제어할 수 있다. 제1 카메라(121a)는 촬영 모드 또는 화상통화 모드에서 이미지 센서에 의해 얻어지는 정지영상 또는 동영상의 화상 프레임을 처리한다. 처리된 화상 프레임은 디스플레이부에 표시될 수 있으며, 메모리에 저장될 수 있다. 제1 및 제2 조작유닛(123a, 123b)은 이동 단말기의 동작을 제어하기 위한 명령을 입력 받기 위해 조작되는 사용자 입력부의 일 예로서, 조작부(manipulating portion)로도 통칭될 수 있다. 제1 및 제2 조작유닛 (123a, 123b)은 터치, 푸시, 스크롤 등 사용자가 촉각적인 느낌을 받으면서 조작하게 되는 방식(tactile manner)이라면 어떤 방식이든 채용될 수 있다. 또한, 제1 및 제2 조작유닛(123a, 123b)은 근접 터치(proximity touch), 호버링(hovering) 터치 등을 통해서 사용자의 촉각적인 느낌이 없이 조작하게 되는 방식으로도 채용될수 있다. 본 도면에서는 제1 조작유닛(123a)이 터치키(touch key)인 것으로 예시하나, 본 발명이 이에 한정되는 것은 아 니다. 예를 들어, 제1 조작유닛(123a)은 푸시키(mechanical key)가 되거나, 터치키와 푸시키의 조합으로 구성될 수 있다. 제1 및 제2 조작유닛(123a, 123b)에 의하여 입력되는 내용은 다양하게 설정될 수 있다. 예를 들어, 제1 조작유 닛(123a)은 메뉴, 홈키, 취소, 검색 등의 명령을 입력 받고, 제2 조작유닛(123b)은 제1 또는 제2 음향 출력부 (152a, 152b)에서 출력되는 음향의 크기 조절, 디스플레이부의 터치 인식 모드로의 전환 등의 명령을 입력 받을 수 있다. 한편, 단말기 바디의 후면에는 사용자 입력부의 다른 일 예로서, 후면 입력부(미도시)가 구비될 수 있다. 이러한 후면 입력부는 이동 단말기의 동작을 제어하기 위한 명령을 입력 받기 위해 조작되는 것으로서, 입 력되는 내용은 다양하게 설정될 수 있다. 예를 들어, 전원의 온/오프, 시작, 종료, 스크롤 등과 같은 명령, 제1 및 제2 음향 출력부(152a, 152b)에서 출력되는 음향의 크기 조절, 디스플레이부의 터치 인식 모드로의 전 환 등과 같은 명령을 입력 받을 수 있다. 후면 입력부는 터치입력, 푸시입력 또는 이들의 조합에 의한 입력이 가능한 형태로 구현될 수 있다. 후면 입력부는 단말기 바디의 두께방향으로 전면의 디스플레이부와 중첩되게 배치될 수 있다. 일 예로, 사 용자가 단말기 바디를 한 손으로 쥐었을 때 검지를 이용하여 용이하게 조작 가능하도록, 후면 입력부는 단말기 바디의 후면 상단부에 배치될 수 있다. 다만, 본 발명은 반드시 이에 한정되는 것은 아니며, 후면 입력부의 위 치는 변경될 수 있다. 이처럼 단말기 바디의 후면에 후면 입력부가 구비되는 경우, 이를 이용한 새로운 형태의 유저 인터페이스가 구 현될 수 있다. 또한, 앞서 설명한 터치 스크린 또는 후면 입력부가 단말기 바디의 전면에 구비되는 제1 조작유 닛(123a)의 적어도 일부 기능을 대체하여, 단말기 바디의 전면에 제1 조작유닛(123a)이 미배치되는 경우, 디스 플레이부가 보다 대화면(大畵面)으로 구성될 수 있다. 한편, 이동 단말기에는 사용자의 지문을 인식하는 지문인식센서가 구비될 수 있으며, 제어부는 지문 인식센서를 통하여 감지되는 지문정보를 인증수단으로 이용할 수 있다. 상기 지문인식센서는 디스플레이부 또는 사용자 입력부에 내장될 수 있다. 마이크로폰은 사용자의 음성, 기타 소리 등을 입력 받도록 이루어진다. 마이크로폰은 복수의 개소에 구비되어 스테레오 음향을 입력 받도록 구성될 수 있다. 인터페이스부는 이동 단말기를 외부기기와 연결시킬 수 있는 통로가 된다. 예를 들어, 인터페이스부 는 다른 장치(예를 들어, 이어폰, 외장 스피커)와의 연결을 위한 접속단자, 근거리 통신을 위한 포트[예를 들어, 적외선 포트(IrDA Port), 블루투스 포트(Bluetooth Port), 무선 랜 포트(Wireless LAN Port) 등], 또는 이동 단말기에 전원을 공급하기 위한 전원공급단자 중 적어도 하나일 수 있다. 이러한 인터페이스부 는 SIM(Subscriber Identification Module) 또는UIM(User Identity Module), 정보 저장을 위한 메모리 카드 등 의 외장형 카드를 수용하는 소켓의 형태로 구현될 수도 있다. 단말기 바디의 후면에는 제2카메라(121b)가 배치될 수 있다. 이 경우, 제2카메라(121b)는 제1카메라(121a)와 실 질적으로 반대되는 촬영 방향을 가지게 된다. 제2카메라(121b)는 적어도 하나의 라인을 따라 배열되는 복수의 렌즈를 포함할 수 있다. 복수의 렌즈는 행렬 (matrix) 형식으로 배열될 수도 있다. 이러한 카메라는, '어레이(array) 카메라'로 명명될 수 있다. 제2카메라 (121b)가 어레이 카메라로 구성되는 경우, 복수의 렌즈를 이용하여 다양한 방식으로 영상을 촬영할 수 있으며, 보다 나은 품질의 영상을 획득할 수 있다. 플래시는 제2카메라(121b)에 인접하게 배치될 수 있다. 플래시는 제2카메라(121b)로 피사체를 촬영하 는 경우에 피사체를 향하여 빛을 비추게 된다. 단말기 바디에는 제2 음향 출력부(152b)가 추가로 배치될 수 있다. 제2 음향 출력부(152b)는 제1 음향 출력부 (152a)와 함께 스테레오 기능을 구현할 수 있으며, 통화시 스피커폰 모드의 구현을 위하여 사용될 수도 있다. 단말기 바디에는 무선 통신을 위한 적어도 하나의 안테나가 구비될 수 있다. 안테나는 단말기 바디에 내장되거 나, 케이스에 형성될 수 있다. 예를 들어, 방송 수신 모듈(111, 도 1a 참조)의 일부를 이루는 안테나는 단말기바디에서 인출 가능하게 구성될 수 있다. 또는, 안테나는 필름 타입으로 형성되어 후면 커버의 내측면에 부착될 수도 있고, 도전성 재질을 포함하는 케이스가 안테나로서 기능하도록 구성될 수도 있다. 단말기 바디에는 이동 단말기에 전원을 공급하기 위한 전원 공급부(190, 도 1a 참조)가 구비된다. 전원 공 급부는 단말기 바디에 내장되거나, 단말기 바디의 외부에서 착탈 가능하게 구성되는 배터리를 포함할 수 있다. 배터리는 인터페이스부에 연결되는 전원 케이블을 통하여 전원을 공급받도록 구성될 수 있다. 또한, 배터리는 무선충전기기를 통하여 무선충전 가능하도록 구성될 수도 있다. 상기 무선충전은 자기유도방식 또는 공진방식(자기공명방식)에 의하여 구현될 수 있다. 한편, 본 도면에서는 후면 커버가 배터리를 덮도록 리어 케이스에 결합되어 배터리의 이탈 을 제한하고, 배터리를 외부 충격과 이물질로부터 보호하도록 구성된 것을 예시하고 있다. 배터리가 단말기 바디에 착탈 가능하게 구성되는 경우, 후면 커버는 리어 케이스에 착탈 가능하게 결합될 수 있다. 이동 단말기에는 외관을 보호하거나, 이동 단말기의 기능을 보조 또는 확장시키는 액세서리가 추가될 수 있다. 이러한 액세서리의 일 예로, 이동 단말기의 적어도 일면을 덮거나 수용하는 커버 또는 파우치를 들 수 있다. 커버 또는 파우치는 디스플레이부와 연동되어 이동 단말기의 기능을 확장시키도록 구성 될 수 있다. 액세서리의 다른 일 예로, 터치 스크린에 대한 터치입력을 보조 또는 확장하기 위한 터치펜을 들 수 있다. 한편 본 발명의 실시 예에 따른 이동 단말기의 디스플레이부는 상술한 바와 같이 노치(Notch) 디자인 으로 형성될 수 있다. 노치 디자인은 이동 단말기의 전면부에서, 좌우측 베젤(bezel)이 형성되는 베젤 영 역과 적어도 하나의 센서 및 출력부가 형성되는 영역을 제외한 전 영역에 화상 정보의 표시가 가능하도록 디스 플레이부가 형성되는 방식을 의미할 수 있다. 여기서 상기 적어도 하나의 센서는 카메라(121a)(광 센서), 근접 센서, 조도 센서 등을 적어도 하나 포함할 수 있으며, 상기 출력부는 광 출력부, 음향 출력부(152a, 스피커) 등을 적어도 하나 포함할 수 있다. 따라서 상기 노치 디자인은, 이동 단말기의 전면부에서 적어도 하나의 센서 및 출력부가 형성되는 영역 및 상기 좌우측 베젤 영역을 제외한, 상기 이동 단말기 전면부의 전체 영역이 디스플레이부로 형성된 이동 단말기일 수 있다. 즉 상기 노치 디자인 방식의 디스플레이부는, 상기 디스플레이부 상단부에서, 상기 적어도 하나의 센서가 배치 되는 일 영역을 중심으로, 상기 이동 단말기 전면부에 형성된 좌우측 베젤 영역들 사이의 영역들까지 화상 정보 의 표시가 가능하도록 디스플레이 영역이 연장된 디스플레이부를 의미할 수 있다. 한편 제어부는 상기 연장된 디스플레이부 영역(이하 서브(sub) 영역이라고 칭하기로 한다)들을 서로 다른 영역으로 구분할 수 있다. 예를 들어 제어부는 상기 적어도 하나의 센서가 배치되는 일 영역을 기준으로 상기 서브 영역들을 구분할 수 있다. 따라서 상기 적어도 하나의 센서(및 출력부)가 배치되는 영역은, 상기 서 브 영역들을 구분하는 ‘기준 영역’, 또는 상기 서브 영역들의 중심을 의미하는 ‘중심 영역’일 수 있다. 한편, 상기 노치 방식의 디스플레이부는, 상기 적어도 하나의 센서(및 출력부)가 배치될 수 있도록, 상기 디스 플레이부 상단부에서 상기 기준 영역에 대응하는 일 영역이 상기 이동 단말기에서 현재 실행 중인 실행 화면이 표시되는 메인 영역을 향하여 리세스되도록 형성된 디스플레이부일 수 있다. 따라서 디스플레이부 상단에서, 상 기 적어도 하나의 센서가 배치될 수 있도록 메인 영역을 향하여 리세스된 일 영역은, ‘노치 영역’으로 명명될 수도 있다. 이하에서는, 설명의 편의상 상기 ‘기준 영역’, ‘중심 영역’ 또는 ‘노치 영역’으로 명명될 수 있는 상기 적어도 하나의 센서 및 출력부가 배치되는 영역을, ‘노치 영역’으로 칭하여 설명하기로 한다. 한편 제어부는 상기 노치 영역을 기준으로 상기 복수의 서브 영역을 구분할 수 있다. 일 예로 제어부(18 0)는 상기 노치 영역의 좌측 영역을 제1 영역으로 구분할 수 있다. 또한 상기 노치 영역의 우측 영역을 제2 영 역으로 구분할 수 있다. 또는 제어부는 상기 노치 영역을 별도의 영역으로 구분할 수도 있다. 이러한 경우 제어부는 디스플레이부 상단을 상기 제1 영역과 제2 영역, 그리고 노치 영역의 3개 영역으로 구분할 수 있 다. 한편 이처럼 구분된 각 영역들은 각각 서로 다른 조작 영역으로 사용될 수 있다. 이러한 경우 제어부는 상 기 구분된 영역들 중 적어도 하나에 대해 인가되는 터치 제스처를 감지하고, 터치 제스처의 시작점 또는 종료점중 어느 하나에 대응하는 기능을 수행할 수 있다. 또는 제어부는 상기 터치 제스처가 인가되는 서브 영역 또는 노치 영역에 대응하는 기능을 수행할 수 있다. 여기서 상기 구분된 영역들은 각각 서로 다른 기능에 대응 될 수 있다. 따라서 상기 터치 제스처의 시작점이나 종료점, 또는 상기 터치 제스처가 인가되는 영역에 근거하 여 제어부는 서로 다른 기능을 실행할 수 있다. 또는 현재 실행되는 기능에 대해 서로 다른 제어를 수행할 수 있다. 한편 제어부는 상기 터치 제스처가 인가되는 유형에 따라 각 영역에 인가되는 터치 제스처를 구분할 수 있 다. 이 경우 제어부는 동일한 영역에 인가되는 터치 제스처라고 할지라도, 식별된 터치 제스처의 유형에 따라 서로 다른 입력으로 판단할 수 있다. 여기서 상기 서로 다른 입력은, 상기 터치 제스처를 서로 다른 애플 리케이션에 대한 입력으로 처리하는 것을 의미할 수 있다. 또는 특정 기능에 대한 서로 다른 제어를 위한 입력 으로 처리하는 것을 의미할 수도 있다. 한편 제어부는 상기 디스플레이부를 상기 서브 영역들과 메인 영역으로 구분할 수 있다. 여기서 상기 메인 영역은, 상기 이동 단말기에서 현재 실행중인 기능과 관련된 실행 화면이 표시되는 영역일 수 있다. 한편, 상기 서브 영역은 인접한 상기 메인 영역의 일부 영역을 더 포함할 수 있다. 즉, 상기 메인 영역의 적어 도 일부는, 상기 서브 영역으로부터 연장되도록 표시될 수 있으며, 연장된 영역은 메인 영역의 다른 부분과 구 분될 수 있도록, 상기 서브 영역과 연결되어 표시될 수 있다. 그러면 제어부는 상기 연장된 영역을, 상기 서브 영역들(예 : 제1 영역 또는 제2 영역) 중 어느 하나에 연 결된 영역으로 표시할 수 있다. 또는 제어부는 상기 연장된 영역을 다시 복수 개의 영역으로 구분하고, 구 분된 상기 서브 영역 각각의 영역에 연결된 것으로 표시할 수도 있다. 한편 상기 연장된 영역은 연결된 서브 영역에 관련된 정보를 표시할 수 있다. 따라서 디스플레이부의 메인 영역은, 상기 이동 단말기에서 현재 실행중인 기능과 관련된 실행 화면과 상기 서브 영역에 관련된 정보가 동시에 또는 함께 표시될 수 있다. 일 예로 메인 영역은 상기 서브 영역으로부터 연장된 영역과 상기 실행 화면이 표시되는 영역으로 분할될 수 있 다. 이 경우 상기 연장 영역은 어느 하나의 서브 영역에 관련된 정보를, 메인 영역에서 상기 연장된 영역을 제 외한 나머지 영역에서는 상기 실행 화면이 표시될 수 있다. 또는 상기 연장된 영역은 상기 메인 영역의 일부에 중첩되는 영역일 수 있다. 이 경우 상기 어느 하나의 서브 영역에 관련된 정보는, 상기 실행 화면이 표시되는 영역에 중첩되어 표시될 수 있다. 한편 본 발명과 관련된 이동 단말기의 디스플레이부은 상단에 형성되는 적어도 하나의 센서(및 출력부)가 형성되는 형태에 따라 노치 영역 및 서브 영역들이 형상 및 배치 구조가 다양하게 변형될 수 있다. 도 1d는 이 처럼 본 발명과 관련된 이동 단말기에서 상기 서브 영역들 및 노치 영역의 다른 예를 설명하기 위한 개념도이다. 본 발명과 관련된 이동 단말기의 디스플레이부는 도 1d의 (a)에서 보이고 있는 바와 같이 상기 디스플레이 부 상단 중앙 영역이 리세스되도록 형성되며, 이 영역은 '노치 영역'으로 명명될 수 있다. 그리고 리세스 된 영역, 즉 노치 영역에는, 도 1d의 (a)에서 보이고 있는 바와 같이 근접 센서, 제1 카메라(121a), 및 제1 출력부(152a)가 순차적으로 배치될 수 있다. 여기서 노치 영역에 배치된 근접 센서, 제1 카메 라(121a) 및 제1 출력부(152a) 중 적어도 하나는 디스플레이부에 의해 적어도 일부가 가려질 수도 있음은 물론이다. 한편 도 1d의 (b)에서 보이고 있는 바와 같이, 단말기 바디의 전면에는 디스플레이부를 덮도록 형성되는 윈도우(151a)가 배치될 수 있다. 여기서, 상기 윈도우(151a)는 프론트 케이스에 장착되며 단말기 바디의 전면을 형성할 수 있으며, 상기 윈 도우(151a)는 강화 유리와 같은 투명한 재질로 형성될 수 있다. 이에 따라 도 1d의 (b)에서 보이고 있는 바와 같이, 상기 윈도우(151a)는 근접 센서, 제1 카메라(121a) 및 제1 출력부(152a) 중 적어도 하나를 덮도록 형성될 수 있다. 예를 들어, 제1 출력부(152a)의 적어도 일부는, 윈 도우(151a)에 의하여 커버될 수 있다. 또한, 도 1d의 (a)에 도시된 것과 같이, 단말기의 상단 영역에는 마이크(122a)가 추가적으로 배치될 수 있으며, 상기 마이크(122a)는 디스플레이부에 의하여 덮힐 수 있다.한편 도 1e는 도 1d에서 보인 이동 단말기에서, 상술한 서브 영역들을 통해 다양한 정보들이 표시되는 예를 보 이고 있는 것이다. 그리고 여기서 상기 서브 영역들에 표시되는 정보들은 다양한 인디케이터(또는 그래픽 객체) 일 수 있다. 도시와 같이, 본 발명에 따른 디스플레이부의 상단 영역은, 노치 영역을 기준으로 복수의 서브 영역 (201, 202, 203)으로 구분될 수 있다. 이러한 복수의 영역들에는 서로 다른 종류의 정보들이 표시될 수 있다. 일 예로서, 노치 영역을 기준으로 좌측 영역은 제1, 제2 서브 영역(201, 202)으로 구획될 수 있으며, 먼저 노치 영역을 기준으로 디스플레이부 상단 좌측에 형성된 제1 서브 영역의 경우, 현재 시각에 대 한 정보가 표시될 수 있다. 그리고, 제1 서브 영역과 노치 영역 사이에 배치된 제2 서브 영역에는, 이동 단말기에서 발생한 이벤트에 관련된 다양한 알림 정보가 표시될 수 있다. 이러한 이벤트 정보는, 이벤트 발생시 소정 시간동안 표 시된 후, 소정 시간이 경과하면, 다시 사라질 수 있다. 한편, 제2 서브 영역에 이벤트 정보가 표시되는 동안 터치가 감지되면, 제어부는, 상기 제2 서브 영역 에 표시된 이벤트 정보에 대응되는 애플리케이션의 실행화면을 디스플레이부 상에 출력할 수 있다. 한편, 상기 노치 영역을 기준으로 디스플레이부 상단 우측에는 제3 서브 영역이 형성될 수 있다. 제3 서브 영역에는 현재 이동 단말기의 다양한 상태정보 및 시스템 정보 중 적어도 하나와 관련된 알림 정보들이 표시될 수 있다. 예를 들어 도 1e에서 보이고 있는 바와 같이, 상기 제3 서브 영역에는 현 재 이동 단말기의 배터리 상태, 현재 이동 단말기의 무선 신호 수신 상태, Wifi와 같은 데이터 네트워크에 접속 된 상태 및 접속된 데이터 네트워크의 종류에 관련된 정보가 표시될 수 있다. 이하 도 2a 내지 도 2d를 참조하여 이처럼 서브 영역들이 형성되는 예 및, 상기 서브 영역들과 메인 영역의 구 동 상태를 보다 자세하게 살펴보기로 한다. 먼저 도 2a는 본 발명의 실시 예에 따라 노치 디자인에 따라 서브 영역을 포함하는 디스플레이부를 구비하 는 이동 단말기에서, 제어부가 디스플레이부를 복수의 영역으로 구분하는 예를 보이고 있는 것 이다. 일예로 상기 디스플레이부는 적어도 하나의 센서 및 출력부가 형성되는 노치 영역으로부터, 이동 단 말기 전면부에 형성된 좌우측 측면 베젤 영역들(292, 294) 사이의 영역들까지 디스플레이 영역이 연장될 수 있 다. 따라서 상기 노치 영역과 이동 단말기의 좌측면 베젤 사이의 영역, 즉 노치 영역의 좌 측 영역과, 상기 노치 영역과 이동 단말기의 우측면 베젤 사이의 영역, 즉 노치 영역(24 0)의 우측 영역에도 화상 정보가 표시될 수 있다. 이하 상기 좌측 영역을 제1 영역으로, 상기 우측 영역을 제2 영역으로 칭하기로 한다. 이에 따라 본 발명의 디스플레이부는 도 2a에서 보이고 있는 바와 같이, 상기 제1 영역, 제2 영역 , 그리고 메인 영역으로 구분될 수 있다. 여기서 상기 메인 영역은 상술한 바와 같이, 이동 단 말기에서 현재 실행 중인 기능과 관련된 화상 정보(예 : 실행화면)가 표시되는 영역일 수 있다. 그리고 상기 메 인 영역은 상술한 바와 같이 터치 센서와 상호 레이어 구조를 이루거나 일체형으로 형성되어 사용자의 터 치 입력 또는 터치 제스처를 감지할 수 있도록 형성된 영역일 수 있다. 한편 상기 제1 영역과 제2 영역은 디스플레이부의 메인 영역과 마찬가지로 터치 센서와 상 호 레이어 구조를 이루거나 일체형으로 형성되는 영역일 수 있다. 따라서 상기 제1 영역과 제2 영역 역시 인가되는 터치 입력 또는 사용자의 터치 제스처를 감지할 수 있도록 형성될 수 있다. 이와 같이, 본 발명에 따른 이동 단말기의 디스플레이부는, 복수의 디스플레이 영역(210, 220, 280)을 구 비할 수 있다. 여기에서, 제1 및 제2 영역(210, 220)은, 동일한 면적 및 동일한 형상 중 적어도 하나를 가질 수 있다. 또는 상기 제1 및 제2 영역(210, 220)은 서로 다른 면적 및 서로 다른 형상 중 적어도 하나를 가질 수 있 다. 따라서 제1 영역 또는 제2 영역은 다른 영역보다 더 넓은 면적을 가지거나, 또는 다른 영역과 다 른 형상을 가질 수도 있다. 한편, 상기 제1 및 제2 영역(210, 220) 및 메인 영역은 물리적으로 독립된 구조를 가질 수 있다. 이 경우, 이동 단말기는, 물리적으로 분리된 복수개의 디스플레이부(예를 들어, 3개의 디스플레이부)를 구비할 수 있다. 그리고 물리적으로 구분된 복수개의 디스플레이부를 구비하는 경우, 제어부는, 상기 복수개의 디스플레이부를 각각 제어할 수 있다. 이 경우, 각각의 디스플레이부에는 각각의 디스플레이부를 제어하기 위한 서브 제어부가 할당되어 존재할 수 있 다. 즉, 이동 단말기에서, 제1 영역은 제1 서브 제어부에 의해 제어되고, 제2 영역은, 제2 서브 제어 부에 의해 제어될 수 있다. 또한 메인 영역은 제3 서브 제어부에 의해 제어될 수 있다. 그리고 상기 제1, 제2, 및 제3 서브 제어부는, 제어부에 의하여 제어될 수 있다. 다른 예로, 상기 물리적으로 구분된 제1 및 제2, 및 메인 영역(210, 220, 280)은, 하나의 제어부, 예를 들어 제어부에 의하여 제어되는 것 또한 가능 하다. 한편, 제1, 제2, 및 메인 영역(210, 220, 280)은 단일 디스플레이부에 포함될 수도 있다. 즉, 단일 디스플 레이부는 복수의 디스플레이 영역(210, 220, 280)을 포함할 수 있다. 이 경우, 복수의 디스플레이 영역 (210, 220, 280) 간의 경계는, 소프트웨어적인 처리에 의하여 구분될 수 있다. 이 경우 제어부는, 복수의 디스플레이 영역(210, 220, 280)의 각 경계 영역에, 특정 이미지를 출력하여 상기 복수의 디스플레이 영역의 경 계를 사용자에게 인지시킬 수 있다. 한편, 이 경우 상기 복수의 디스플레이 영역(210, 220, 280) 각각은 소프트웨어적인 처리에 의하여 서로 독립 적으로 제어될 수 있다. 이상에서 살펴본 것과 같이, 본 발명에 따른 이동 단말기는, 물리적인 구분 또는 소프트웨어적인 구분을 통해, 복수의 디스플레이 영역을(또는 복수의 디스플레이부, 이하, '복수의 디스플레이 영역'으로 통칭함)을 구비할 수 있다. 한편, 본 발명에서는, 상기 복수의 디스플레이 영역이, 복수의 디스플레이부로 이루어졌는지, 또는 단일 디스플 레이부에 포함된 복수의 영역인지에 관계없이, 각 영역에 대한 독립적인 제어를 통해, 동일한 기능을 수행하거 나, 효과를 거둘 수 있다. 따라서 이하에서는, 복수의 디스플레이 영역이 복수의 디스플레이부로 이루어졌는지, 또는 단일 디스플레이부에 포함된 복수의 영역인지를 구분하지 않고 설명하기로 한다. 한편, 이러한 복수의 디스플레이부 영역은, 서로 독립적으로 제어될 수 있으며, 이하에서는 첨부된 도면과 함께, 복수의 디스플레이 영역이 제어되는 방법에 대하여 보다 구체적으로 살펴본다. 도 2b 내지 도 2d는 본 발명에 따른 이동 단말기에서 상기 복수의 디스플레이 영역의 구동 상태를 설명하기 위 한 개념도들이다. 본 발명에 따른 이동 단말기에서, 상기 복수의 디스플레이 영역은, 동일한 구동상태를 갖거나, 서로 다른 구동 상태를 가질 수 있다. 예를 들어 본 발명에 따른 이동 단말기의 복수의 디스플레이 영역 각각은, 활성화 상태 및 비활성화 상태 중 어느 하나의 상태로 구동될 수 있다. 여기서 활성화 상태란, 시각적인 정보의 표시 및 터치 센싱이 가능한 상태를 의미할 수 있다. 즉, 활성화 상태 란, 해당 디스플레이 영역이 '온(on)'되어 있는 상태를 의미한다. 나아가, 비활성화 상태란, 시각적인 정보의 표시가 제한된 상태를 의미할 수 있다. 즉, 이 경우, 해당 디스플레 이부를 조명하는 조명부는 오프된 상태이다. 한편, 본 발명에서, 비활성화 상태인 디스플레이 영역은, 터치 센 싱이 가능하도록 이루어질 수 있다. 즉, 본 발명에서, 비활성화 상태란, 시각적인 정보의 표시가 제한되고, 터 치 센싱이 가능한 상태를 의미할 수 있다. 즉, 제어부는, 비활성화 상태인 디스플레이 영역에서, 터치 센 싱이 가능하도록, 해당 디스플레이 영역을 제어할 수 있다. 한편, 본 발명에서는, 시각적인 정보의 표시가 제한되고, 터치 센싱이 가능한 비활성화 상태를, 도즈 모드(doze mode)로 명명할 수 있다. 따라서 비활성 상태에 있는 디스플레이 영역의 경우 ‘도즈 모드’에 있다고 표현할 수 있다. 이 경우 도즈 모드에 있는 디스플레이 영역은 기 설정된 특정 주기마다 활성화될 수 있다. 한편, 터치 센서는 비활성화 상태(또는 도즈 모드)와 활성화 상태에서 서로 다른 방식으로 디스플레이부에 인가되는 탭을 감지할 수 있다. 뿐만 아니라, 터치 센서의 작동과 관련된 설정들이 비활성화 상태(또는 도즈 모 드)와 활성화 상태에서 다르게 설정될 수 있다. 먼저 도 2b를 참조하여 살펴보면, 제1, 제2 및 메인 영역(210, 220, 280)은 모두 비활성화 상태일 수 있다. 이 때, 상기 제1, 제2 및 메인 영역(210, 220, 280) 중 적어도 하나의 영역은, 조명이 오프된 상태이더라도, 터치 센싱이 가능하도록 이루어질 수 있다. 예를 들어, 제1 및 제2 영역(210, 220) 중 어느 하나의 영역은 비활성화 상태에서도 터치 센싱이 가능하도록 이루어질 수 있다. 이 경우, 상기 제1 및 제2 영역(210, 220) 중 어느 하나에 대하여, 기 설정된 방식의 터치가 감지되면, 제어부는 상기 제1 및 제2 영역(210, 220) 중 적어도 하나 또는 상기 메인 영역에 상기 터치에 대응하는 화면 정보를 출력할 수 있다. 다른 예로서, 도 2c에 도시된 것과 같이, 제1 및 제2 영역(210, 220) 중 적어도 하나가 활성화 상태이고, 메인 영역이 비활성화 상태일 수 있다. 즉, 제1 및 제2 영역(210, 220)과 메인 영역은 서로 독립적으로 제 어되므로, 서로 다른 구동상태를 가질 수 있다. 따라서 제1 및 제2 영역(201, 220) 중 어느 하나 또는 메인 영 역의 구동 상태는, 다른 디스플레이 영역의 구동 상태에 영향을 미치지 않는다. 즉, 본 발명에서는, 복수 의 디스플레이 영역이 항상 동시에 활성화 상태이거나, 항상 동시에 비활성화 상태에 있지 않을 수 있다. 나아가, 본 발명에 따른 이동 단말기에서, 복수의 디스플레이 영역 중 어느 하나는, 항상 활성화 상태일 수 있 다. 즉, 이 경우, 항상 활성화 상태인 디스플레이 영역은, 올웨이즈 온(always on)되어 있다고 표현될 수 있다. 즉, 제1, 제2 및 메인 영역(210, 220, 280) 중 적어도 하나의 영역은 항상 활성화 상태를 유지할 수 있다. 이 경우, 이동 단말기의 잔여 배터리 양에 따라, 올웨이즈 온 대상 디스플레이 영역 또한 비활성화 상태로 구동될 수도 있다. 한편 본 발명에서는, 복수의 디스플레이 영역 중 어느 하나의 영역이 활성화 상태이고, 다른 하나의 영역이 비 활성화 상태인 경우, 비활성화 상태의 디스플레이 영역에 가해지는 터치를, 활성화 상태인 디스플레이 영역에 대한 제어명령으로 처리할 수 있다. 예를 들어, 활성화 상태인 제1 영역 또는 제2 영역에 표시된 화 면 정보는, 비활성화 상태인 메인 영역에 대한 터치에 의하여 스크롤링될 수 있다. 또 다른 예로서, 도 2d에 도시된 것과 같이, 제1, 제2 및 메인 영역(210, 220, 280)은, 모두 활성화 상태일 수 있다. 여기서 제1, 제2 및 메인 영역(210, 220, 280)은 동시에 또는 서로 다른 시점에 각각 비활성화 상태에서 활성화 상태로 전환될 수 있다. 한편 제어부는 제1, 제2 및 메인 영역(210, 220, 280)을 서로 독립적으로 제어할 수 있다. 이 경우, 제1, 제2 및 메인 영역(210, 220, 280)에는 각각 서로 다른 화면 정보가 출력될 수 있다. 즉, 복수의 디스플레이 영 역 중 어느 하나에 표시되는 정보는, 다른 하나에 표시되는 정보에 영향을 미치지 않을 수 있다. 예를 들어, i) 제1 영역에는 제1 애플리케이션과 관련된 정보가 표시되고, ii) 제2 영역에는 제2 애 플리케이션과 관련된 정보가 표시될 수 있다. 또한 iii) 메인 영역에는 제3 애플리케이션의 실행 화면이 표시될 수 있다. 이 경우, 상기 제1 영역에 표시된 정보를 제어하기 위한 제어명령(예를 들어, 터치 입 력)은, 제2 영역에 표시된 정보 또는 메인 영역에 표시되는 실행 화면에 영향을 미치지 않을 수 있다. 보다 구체적으로, 제1 영역에서, 표시된 정보를 스크롤링 하기 위한 터치가 가해지 경우, 제어부 는 상기 제1 영역에 표시된 정보에 대해서만 스크롤링을 수행하고, 제2 영역에 표시된 정보 또 는 메인 영역에 표시되는 실행 화면에 대해서는 스크롤링을 수행하지 않을 수 있다. 한편, 제1, 제2 및 메인 영역(210, 220, 280)에서 표시되는 화상 정보들은 다양할 수 있다. 나아가, 제1, 제2 및 메인 영역(210, 220, 280)이 모두 활성화 상태인 경우, 제1, 제2 및 메인 영역(210, 220, 280)은 동시에 또 는 서로 다른 시점에 비활성화 상태로 전환될 수 있다. 이상에서 살펴본 것과 같이, 본 발명에 따른 이동 단말기에서, 제1, 제2 및 메인 영역(201, 220, 280)은, 서로 다른 구동 상태 또는 동일한 구동 상태를 가질 수 있다. 또한 제1, 제2 및 메인 영역(201, 220, 280) 중 어느 영역을 활성화 상태로 구동시킬지 또는 비활성화 상태로 유지시킬지는 사용자의 선택에 근거하여 결정되거나, 제어부의 제어에 의해 결정될 수 있다. 한편 도 3a 내지 도 3c는 본 발명과 관련된 이동 단말기에서, 서브 영역들 및 노치 영역을 보다 자세히 설명하 기 위한 개념도들이다. 상술한 설명에 따르면, 본 발명과 관련된 이동 단말기의 디스플레이부는 제1 영역, 제2 영역 , 그리고 메인 영역으로 구분될 수 있다. 그리고 제어부는 제1 영역과 제2 영역, 그 리고 메인 영역에 인가되는 터치입력을 각각 구분하고, 구분된 터치 입력에 따라 서로 다른 기능을 실행하 거나, 또는 현재 실행중인 기능에 대해 서로 다른 제어를 할 수 있다. 한편, 상기 제1 영역과 제2 영역 사이에는 적어도 하나의 센서가 배치되며, 메인 영역을 향하여 디스플레이부 상단으로부터 리세스된 일 영역인 노치 영역이 형성될 수 있다. 그리고 제어부는 상기 노치 영역 주변의 일 영역을 상기 노치 영역에 대해 인가되는 터치 입력을 감지하기 위한 영역으로 할당할 수도 있다. 도 3a의 (a)는 이러한 경우의 예를 보이고 있는 것이다. 도 3a의 (a)를 참조하여 살펴보면, 상기 노치 영역에 인접한 디스플레이부의 일 영역(230c)이 상기 노치 영역에 대해 인가되는 터치 입력을 감지하기 위한 영역으로 설정될 수 있다. 이 경우 상기 일 영역(230c) 는 상기 노치 영역과 메인 영역 사이의 경계에 해당하는 경계 영역이 될 수 있다. 그리고 제어 부는 상기 노치 영역과 메인 영역 사이의 경계 영역에서 감지되는 터치 입력을, 상기 제1 및 제2 영역(210, 220)에 인가되는 터치 입력과 구분할 수 있다. 즉, 제어부는 상기 경계 영역을 통 해, 상기 노치 영역을 상기 제1 및 제2 영역(210, 220) 또는 메인 영역과 구분되는 별도의 조작 영역 으로 식별할 수 있다. 이에 따라 상기 경계 영역에 터치 입력이 인가되는 경우, 상기 제1 및 제2 영역 (210, 220) 또는 메인 영역에 터치 입력에 인가되는 경우에 실행되는 기능들과 다른 기능이 실행되도록 할 수 있다. 한편 상기 경계 영역은 노치 영역과 메인 영역 사이의 경계 뿐만 아니라 제1 영역과 메인 영역 사이의 경계 및 제2 영역과 메인 영역 사이의 경계에 해당하는 영역으로 확장될 수 있다. 즉, 도 3a의 (b)에서 보이고 있는 바와 같이, 제1 영역과 메인 영역 사이에는 제1 경계 영역(230a)이, 제 2 영역과 메인 영역 사이에는 제2 경계 영역(230b), 그리고 노치 영역과 메인 영역 사이에 형성되는 제3 경계 영역(230c)가 형성될 수 있다. 여기서 상기 제1 및 제2 경계 영역(230a, 230b)은 상기 제1 영역과 제2 영역의 상하 폭이 좁다는 점 을 보완하기 위한 것일 수 있다. 따라서 상기 제1 영역 또는 제2 영역에 대응하는 터치 입력 영역의 크기는 상기 각 경계 영역들(230a, 230b)의 폭 만큼 확장될 수 있다. 즉, 상기 제1 영역 및 제2 영역(22 0)은 각각의 경계 영역(230a, 230b)에 해당하는 영역만큼 확장되는 것일 수 있다. 따라서 사용자는 상기 제1 영 역 및 제2 영역의 상하 폭이 좁은 경우에도, 상기 경계 영역을 통해 상기 제1 영역 및 제2 영역 에 대해 터치 입력을 보다 쉽게 인가할 수 있다. 한편 상기 경계 영역들(230a, 230b, 230c)은 일정한 상하 폭을 가질 수 있으며, 사용자의 선택에 따라 상기 상하 폭이 변경될 수도 있음은 물론이다. 또한 상기 경계 영 역들(230a, 230b, 230c)은 도 3a의 (b)에서 보이고 있는 바와 같이 동일한 상하 폭을 가질 수 있으나, 서로 다 른 상하 폭을 가질 수도 있음은 물론이다. 한편 상기 제1 영역 또는 제2 영역 중 어느 하나에 터치 입력이 인가되는 경우, 제어부는 터치 입력이 인가된 서브 영역(제1 영역 또는 제2 영역) 또는 메인 영역의 일부에 상기 터치 입력이 인가된 서브 영역에 관련된 정보를 표시할 수 있다. 도 3b는 이러한 경우에, 상기 메인 영역 상에 상기 서 브 영역에 관련된 정보가 표시되는 영역의 예를 보이고 있는 것이다. 제어부는 어느 하나의 서브 영역에 기 설정된 터치 입력이 인가되는 경우, 상기 서브 영역에서 표시되는 정보와 관련된 정보를, 메인 영역의 적어도 일부에 표시할 수 있다. 즉, 도 3b의 (a) 및 (b)에서 보이고 있는 바와 같이, 메인 영역의 전체 영역을 제1 영역 또는 제2 영역에서 표시되는 정보와 관련된 정보들이 표시되도록 할 수 있다. 일 예로 상기 제1 영역 및 제2 영역에서 각각 서로 다른 이벤트의 발생 알림 정보가 표시되는 경우, 제어부는 어느 서브 영역이 선택되는지에 따라 어느 하나의 영역에서 표시되는 이벤트 알림 정보에 따른 애플리케이션의 실행 화면을 메인 영역에 에 표시할 수 있다. 즉, 제1 영역이 선택되는 경우, 도 3b의 (a)에서 보이고 있는 바와 같이 디스플레이부 상의 전체 영 역에, 상기 제1 영역에서 표시되는 이벤트 알림 정보에 대응하는 애플리케이션의 실행화면이 표시될 수 있 다. 이러한 경우 상기 메인 영역 전체가 상기 제1 영역에 관련된 정보가 표시되는 제1 표시 영역 일 수 있다. 반면 제2 영역이 선택되는 경우, 도 3b의 (b)에서 보이고 있는 바와 같이 디스플레이부 상의 전체 영역에, 상기 제2 영역에서 표시되는 이벤트 알림 정보에 대응하는 애플리케이션의 실행 화면이 표시될 수 있다. 이러한 경우 상기 메인 영역 전체가 상기 제2 영역에 관련된 정보가 표시되 는 제2 표시 영역일 수 있다. 한편 도 3b의 (a) 및 (b)에서 보이고 있는 바와 같은 제1 및 제2 표시 영역들(250, 260)은 사용자의 선택에 따 라 그 크기가 변경될 수도 있음은 물론이다. 예를 들어 제어부는 디스플레이부의 일 영역, 예를 들어 상기 디스플레이부와 상기 이동 단말기 전면부 하단에 형성된 베젤 영역 사이의 경계에 대응하는 영 역에 인가되는 터치 입력에 근거하여 상기 제1 및 제2 표시 영역들(250, 260)의 크기를 변경할 수 있다. 도 3b 의 (c) 및 (d)는 터치 입력에 근거하여 제1 및 제2 표시 영역들(250, 260)의 크기가 변경된 예를 보이고 있는 것이다. 한편 제어부는 서브 영역들(제1 영역 및 제2 영역) 중 어느 하나에 인가되는 터치 입력에 근거 하여, 상기 서브 영역들(제1 영역, 제2 영역)에 관련된 정보들을, 도 3b의 (c) 및 (d)에서 보이고 있 는 바와 같이, 상기 메인 영역의 일부에만 표시될 수도 있다. 이 경우 역시, 제어부는 사용자의 터치 입력(또는 터치 제스처)에 근거하여 상기 제1 및 제2 표시 영역들(250, 260)의 크기를 변경할 수도 있음은 물론 이다. 여기서 상기 제1 및 제2 표시 영역들(250, 260)의 크기를 변경시키기 위한 터치 입력은, 상기 제1 및 제2 표시 영역들(250, 260)의 경계, 보다 바람직하게는, 상기 메인 영역 중 상기 제1 및 제2 표시 영역들(250, 26 0)이 표시되는 영역의 하단 경계에 인가되는 터치 입력일 수 있다. 한편 제어부는 서브 영역들(210, 220) 중 적어도 하나에 터치 입력이 인가되면, 터치 입력이 인가된 서브 영역에 대응하는 메인 영역의 일부 영역에 상기 터치 입력이 인가된 서브 영역에 관련된 정보를 표시할 수 도 있다. 여기서 상기 서브 영역에 대응하는 메인 영역의 일부 영역은, 상기 서브 영역의 위치와 일 방향 으로 대응하는 영역일 수 있다. 보다 바람직하게 상기 서브 영역에 대응하는 메인 영역의 일부 영역은 상 기 서브 영역의 위치에 길이 방향으로 대응하는 영역일 수 있다. 도 3c의 (a) 내지 (c)는 이러한 경우의 예들을 보이고 있는 것이다. 먼저 도 3c의 (a)를 참조하여 살펴보면, 도 3c의 (a)는 터치 입력이 제1 영역에 인가되는 경우의 예를 보 이고 있다. 즉, 제1 영역에 사용자의 터치 입력이 인가되는 경우, 제어부는 도 3c의 (a)에서 보이고 있는 바와 같이, 메인 영역 중 상기 제1 영역의 위치에 길이 방향으로 대응하는 제1 표시 영역 을 생성할 수 있다. 그리고 상기 제1 표시 영역에 상기 제1 영역과 관련된 정보, 즉 제1 영역에 표시되는 알림 정보 에 대응하는 애플리케이션의 실행 화면 정보, 또는 상기 제1 영역에 대응하는 기능의 제어 메뉴 화면 등을 상기 제1 표시 영역에 표시할 수 있다. 예를 들어 상기 제1 영역에, 현재 이동 단말기에서 실행되는 기능의 제어 메뉴를 표시하는 기능이 대응하는 경우라면, 제어부는 상기 제1 영역의 위치에 대응하도 록 형성된 제1 표시 영역에 현재 이동 단말기에서 실행되는 기능의 제어 메뉴를 표시할 수 있다. 그러면, 제어부는 상기 메인 영역은 이동 단말기에서 현재 실행되는 기능에 따른 제어 메뉴와 상기 현재 실행되는 기능의 실행 화면을 함께 표시할 수 있다. 이 경우 제어부는 도 3c의 (a)에서 보이고 있는 바와 같이 메인 영역을 분할하여 일부(제1 표시 영역)는 상기 제어 메뉴를, 나머지 일부(제1 표시 영 역을 제외한 나머지 영역)에는 상기 실행 화면을 표시할 수 있다. 또는 제어부는 실행 화면이 표시되 고 있는 메인 영역 상에, 상기 제어 메뉴를 상기 제1 영역에 대응하는 위치에 중첩시켜 표시할 수도 있다. 한편 도 3c의 (b)는 터치 입력이 제2 영역에 인가되는 경우의 예를 보이고 있다. 즉, 제2 영역에 사 용자의 터치 입력이 인가되는 경우, 제어부는 도 3c의 (b)에서 보이고 있는 바와 같이, 메인 영역 중 상기 제2 영역의 위치에 길이 방향으로 대응하는 제2 표시 영역을 생성할 수 있다. 그러면 제어부는 상기 제2 영역과 관련된 정보, 즉 제2 영역에 표시되는 알림 정보에 대응하는 애플리케이션의 실행 화면 정보, 또는 상기 제2 영역에 대응하는 기능의 제어 메뉴 화면 등을 상기 제2 표 시 영역에 표시할 수 있다. 이 경우 제어부는 도 3c의 (b)에서 보이고 있는 바와 같이 메인 영역 을 분할하여 일부(제2 표시 영역)는 상기 제어 메뉴를, 나머지 일부(제2 표시 영역을 제외한 나 머지 영역)에는 상기 실행 화면을 표시할 수 있다. 또는 제어부는 실행 화면이 표시되고 있는 메인 영역 상에, 상기 제어 메뉴를 상기 제2 영역에 대응하는 위치에 중첩시켜 표시할 수도 있다. 한편 상기 제1 영역에 대응하는 제1 기능 및 제2 영역에 대응하는 제2 기능은 서로 다른 기능일 수 있다. 예를 들어 상기 제1 기능이 이동 단말기에서 현재 실행 중인 기능에 관련된 제어 메뉴를 표시하는 기능이 라면, 제2 기능은 이동 단말기의 현재 시스템 상태에 관련된 제어 메뉴를 표시하는 기능일 수 있다. 그러면 제어부는 제1 영역 및 제2 영역에 대해 각각 터치 입력이 인가되는 경우, 도 3c의 (c)에 서 보이고 있는 바와 같이, 현재 이동 단말기에서 실행 중인 기능에 관련된 제어 메뉴가 표시되는 제1 표시 영 역 및 이동 단말기의 현재 시스템 상태에 관련된 제어 메뉴가 표시되는 제2 표시 영역을, 제1 및 제2 영역(210, 220)에 각각 대응하는 메인 영역의 일부에 표시할 수 있다. 따라서 도 3c의 (c)에서 보이고 있 는 바와 같이, 메인 영역은 복수의 영역으로 분할되어 상기 제1 영역 및 제2 영역에 각각 대응 하는 정보들을 표시할 수 있으며, 이러한 경우 상기 제1 영역에 관련된 정보들 및 제2 영역에 관련된정보들은 함께 표시될 수 있다. 한편 본 발명은 상기 노치 영역을 상기 제1 영역 및 제2 영역과 구분되는 별도의 영역으로 식별 할 수도 있다. 이러한 경우 제어부는 메인 영역을 상기 제1 영역, 제2 영역 및 노치 영역 에 대응하는 영역들(410, 420, 430)로 구분할 수 있다. 도 4a의 (a) 및 (b)는 이러한 예들을 보이고 있는 것이다. 먼저 도 4a의 (a)를 참조하여 살펴보면, 상술한 바와 같이 메인 영역을 상기 제1 영역, 제2 영역 및 노치 영역에 대응하는 영역들(410, 420, 430)로 구분되는 경우, 제1 및 제2 영역(210, 220)에 관련된 정보를 각각 표시하는 제1 및 제2 표시 영역(250, 260)은, 각각 제1 영역에 대응하는 영역과 제2 영역에 대응하는 영역에 형성될 수 있다. 따라서 노치 영역에 대응하는 영역은 상기 제1 표시 영역 및 제2 표시 영역에 포함되지 않을 수 있다. 따라서 도 4a의 (a)에서 보이고 있는 바 와 같이, 상기 제1 표시 영역 및 제2 표시 영역이 모두 표시되는 경우에도, 상기 노치 영역에 대응하는 영역을 통해 상기 이동 단말기에서 현재 실행되고 있는 기능의 실행 화면 적어도 일부가 표시될 수 있다. 한편 상술한 설명에 따르면, 제어부는 상기 노치 영역과 메인 영역 사이에 형성되는 경계 영역 을 통해, 상기 노치 영역에 인가되는 터치 입력을 감지할 수 있음을 언급한 바 있다. 이러한 경우 제어부 는 상기 노치 영역을 별도의 조작 영역으로 식별할 수 있으며, 상기 노치 영역에 인가되는 터치 입력에 따른 기능을 실행할 수 있다. 이러한 경우 제어부는 상기 노치 영역 및 상기 노치 영역에 대 응하는 영역으로부터 인가되는 터치 입력을, 제1 영역 및 상기 제1 영역에 대응하는 영역 에 인가되는 터치 입력, 또는 제2 영역 및 상기 제2 영역에 대응하는 영역에 인가되는 터치 입 력과 구분하여, 각각 서로 다른 기능이 실행되도록 하거나 또는 서로 다른 제어가 이루어지도록 할 수 있다. 한편, 제어부는 상기 서브 영역들(210, 220) 및 노치 영역에 인가되는 터치 입력이 인가되는 경우 뿐 만 아니라, 상기 메인 영역 상의 구분된 각 영역들(410, 420, 430)에 인가되는 터치 입력에 근거하여 상기 서브 영역들(210, 220) 및 노치 영역 중 어느 하나에 터치 입력이 인가된 것으로 식별할 수도 있다. 도 4b 는 이러한 경우의 예를 보이고 있는 것이다. 이하의 설명에서 ‘첫 번째 도면’은 좌측 상단의 도면, ‘두 번째 도면’은 우측 상단의 도면, ‘세 번째 도면’은 우측 하단의 도면, 그리고 ‘네 번째 도면’은 좌측 하단의 도 면을 지칭할 수 있다. 도 4b를 참조하여 살펴보면, 우선 첫 번째 도면은, 디스플레이부가 각 서브 영역들(제1 영역, 제2 영 역)과 메인 영역으로 디스플레이부가 구분된 예를 보이고 있으며, 상기 메인 영역은 다시 상기 각 서브 영역들(210, 220)과 노치 영역에 각각 대응하는 영역들(410, 420, 430)로 구분되는 예를 보 이고 있다. 이러한 경우, 제어부는 복수 개로 구분된 메인 영역의 각 영역들(410, 420, 430)에 인가되는 터치 입 력들을 상기 서브 영역들(201, 220) 중 어느 하나 또는 노치 영역에 대한 터치 입력으로 식별할 수 있다. 예를 들어, 제어부는 도 4b의 두 번째 도면에서 보이고 있는 바와 같이. 제1 영역에 대응하는 영역 에 터치 입력이 인가되는 경우 이를 상기 제1 영역에 대한 터치 입력으로 식별할 수 있다. 따라서 상 기 제1 영역에서 표시되고 있는 정보를 메인 영역에 표시하거나, 또는 상기 제1 영역에서 표시 되는 알림 정보에 대응하는 애플리케이션 또는 기능을 실행하고 그 실행 화면을 상기 메인 영역에 표시할 수 있다. 이와 마찬가지로 도 4b의 네 번째 도면에서 보이고 있는 바와 같이, 제2 영역에 대응하는 영역에 터 치 입력이 인가되는 경우, 제어부는 제2 영역에 대응하는 정보나 애플리케이션 또는 기능을 실행하고 그 실행 화면을 메인 영역에 표시할 수 있다. 한편 제어부는 도 4b의 세 번째 도면에서 보이고 있는 바와 같이, 노치 영역에 대응하는 메인 영역의 일 영역에 터치 입력이 인가되는 경우 이를 상기 노치 영역에 대한 터치 입력이 인가된 것으로 식별 할 수 있다. 따라서 제어부는 상기 노치 영역에 터치 입력이 인가되는 경우에 대응하는 기능 또는 애 플리케이션을 실행하고 그 실행 화면을 메인 영역에 표시할 수 있다. 한편 서브 영역들(210, 220) 및 노치 영역에 대응하는 메인 영역의 영역들(400, 410, 420)에 터치 입력이 인가되는 경우, 제어부는 상기 터치 입력에 따라, 상기 각 서브 영역(210, 220) 또는 노치 영역 에 대응하는 기능에 관련된 기능들 중 어느 하나가 수행되도록 하거나, 또는 서로 다른 제어가 수행되도록할 수도 있다. 도 4c는 이러한 경우의 예를 보이고 있는 것이다. 도 4c를 참조하여 살펴보면, 먼저 도 4c는 서브 영역들(210, 220) 및 노치 영역에 각각 대응되는 영역들로 메인 영역이 구분된 상태에서, 수신된 메시지에 대한 알림 정보가 표시되는 예를 보이고 있다. 이러한 경 우 상기 알림 정보는 도 4c의 첫 번째 도면에서 보이고 있는 바와 같이, 서브 영역들(210, 220) 중 어느 하나, 예를 들어 제1 영역에 표시될 수 있다. 이러한 상태에서 제어부는, 도 4c의 두 번째 도면에서 보이고 있는 바와 같이, 상기 메인 영역의 구 분된 영역들 중, 상기 제1 영역에 대응하는 영역에 인가되는 터치 입력을 감지할 수 있다. 여기 서 상기 터치 입력은 기 설정된 터치 제스처에 따른 터치 입력일 수 있다. 일 예로 상기 기 설정된 터치 제스처 는, 터치 입력이 드래그된 거리가 기 설정된 거리 이상이 되도록 하는 터치 제스처일 수 있다. 한편 상기 제1 영역에 대응하는 메인 영역의 일 영역에 터치 입력이 인가되는 경우, 제어 부는 상기 터치 입력을 상기 제1 영역에서 표시되는 알림 정보에 대해 인가되는 것으로 식별할 수 있다. 따라서 제어부는 상기 제1 영역에서 표시되는 알림 정보에 대한 기능을 실행 할 수 있다. 한편 이 경우 제어부는 상기 제1 영역에서 표시되는 알림 정보에 대응하는 기능에 관련된 서로 다른 기능들 중 어느 하나를 사용자가 서택하도록 할 수도 있다. 즉, 제어부는 상기 터치 입력이 상술한 바와 같이 기 설정된 터치 제스처에 따른 터치 입력이면, 상기 제1 영역에서 표시되는 알림 정보에 대응하는 기능과 관련된 적어도 하나의 기능 아이콘, 또는 서로 다른 제어 방법에 대응되는 적어도 하나의 제어 아이콘을 메인 영역에 표시할 수 있다. 여기서 상기 적어 도 하나의 아이콘은 상기 터치 입력이 종료되는 디스플레이부 상의 일 지점 주변에 표시될 수 있다. 그리고 제어부는 상기 적어도 하나의 아이콘에 대한 사용자의 선택에 따라 특정 기능을 수행할 수 있 다. 또는 제어부는 현재 실행되는 기능에 대한 서로 다른 제어를 수행할 수도 있다. 한편 도 5는 본 발명과 관련된 이동 단말기에서, 서브 영역들을 통해 인가되는 입력을 특정 기능의 입력으로 인 식하는 소프트웨어 구조를 설명하기 위한 개념도이다. 도 5를 참조하여 살펴보면, 제스처 감지 서비스(Gesture Detection Service)는 가속도(Accel) 센서 및 자이로 (Gyro) 센서 및 터치 입력 이벤트를 감지하여 사용자가 이동 단말기를 터치하는 동작을 인식할 수 있다. 이 경우 상기 제스처 감지 서비스는 터치 센서로부터 인가되는 입력 뿐만 아니라 광 센서(예 : 카메라부) 또는 근접 센서로부터 감지되는 결과에 근거하여 상기 터치 동작을 인식할 수도 있다. 따라서 호버링(hovering)과 같 은 에어 제스처 방식으로 터치 대상체가 디스플레이부 상에 접촉하지 않는 제스처가 감지되는 경우에도 이 를 터치 이벤트로 식별할 수 있다. 한편 상기 제스처 감지 서비스가 터치 이벤트의 발생을 감지하면 윈도우 관리 서비스(Window Manager Service) 는 활성화 영역을 결정할 수 있다. 여기서 상기 활성화 영역은 상기 터치 이벤트에 따른 터치 입력이 애플리케 이션 또는 프로그램으로 인가될 수 있는 영역을 의미할 수 있다. 따라서 상기 디스플레이부의 서브 영역들 중 어느 하나 또는 어느 하나의 서브 영역에 연결되는 연장 영역이 활성화 영역으로 결정될 수 있다. 그러면 입 력 관리 서비스(Input manager Service)는 상기 감지된 터치 이벤트에 따른 터치 입력을 현재 활성화된 영역에 대한 입력으로, 상기 활성화된 영역에 대응하는 애플리케이션에 전달할 수 있다. 이하에서는 이와 같이 구성된 이동 단말기에서 구현될 수 있는 제어 방법과 관련된 실시 예들에 대해 첨부된 도 면을 참조하여 살펴보겠다. 본 발명은 본 발명의 정신 및 필수적 특징을 벗어나지 않는 범위에서 다른 특정한 형태로 구체화될 수 있음은 당업자에게 자명하다. 도 6은 본 본 발명과 관련된 이동 단말기에서, 서브 영역에 감지되는 터치 제스처에 근거하여 서로 다른 기능 및 그에 따른 화상 정보가 표시되는 동작 과정을 도시한 흐름도이다. 먼저 본 발명의 실시 예에 따른 이동 단말기의 제어부는 노치 디자인에 따른 디스플레이부 상에 인가되는 터치 입력을 감지할 수 있다(S600). 여기서 상기 터치 입력은 기 설정된 터치 제스처를 통해 인가될 수 있다. 한편 터치 입력이 인가되면, 제어부는 감지된 터치 입력, 즉 터치 제스처의 시작점을 식별할 수 있다 (S602). 예를 들어 상기 터치 제스처는 서브 영역들(210, 220) 중 어느 하나 또는 노치 영역에서 시작될 수 있다. 즉, 상기 터치 제스처는, 서브 영역들(210, 220) 중 어느 하나 또는 노치 영역에 인가되는 터치입력을 드래그하는 터치 제스처일 수 있다. 그리고 터치 입력의 시작점이 식별되면, 제어부는 상기 식별된 터치 입력의 시작점에 대응하는 기능을 제 어할 수 있다(S604). 예를 들어 제어부는 상기 터치 입력의 시작점에 대응하는 일 영역, 즉 서브 영역들 (210, 220) 중 어느 하나 또는 노치 영역에 대응하는 기능을 실행할 수 있다. 또는 제어부는 현재 이 동 단말기에서 실행되는 기능을 상기 시작점에 대응하는 영역에 따라 다르게 제어할 수도 있다. 한편 제어부는 복수의 터치 입력이 인가되는 경우, 상기 터치 입력을 인가하는 터치 제스처를, 유형에 따 라 서로 다르게 구분할 수도 있다. 그리고 구분된 터치 제스처와 상기 터치 제스처가 인가되는 영역에 근거하여 상기 이동 단말기를 서로 다르게 제어할 수도 있다. 이러한 경우 감지되는 터치 제스처의 유형이 다르면 동일한 영역에 인가되는 터치 입력이라고 할지라도 서로 기능이 수행될 수도 있다. 여기서 상기 터치 제스처는 유형에 따라 다양하게 구분될 수 있다. 일 예로 상기 S602 단계의 식별 결과, 시작 점이 서로 다른 터치 제스처가 인가되는 경우 상기 터치 제스처는 서로 다른 유형이 될 수 있다. 그리고 제어부 는 상기 시작점이 서로 다른 터치 제스처에 대해 서로 다른 제어를 수행할 수 있다. 먼저 상기 터치 제스처는 상기 디스플레이부의 일 지점에 인가되는 터치 입력이거나 상기 터치 입력을 일 방향으로 드래그하는 드래그 입력일 수 있다. 상기 터치 제스처가 드래그 입력인 경우, 상기 터치 입력이 드래 그된 궤적의 방향에 따라 상기 터치 제스처는 서로 다른 입력으로 구분될 수 있다. 예를 들어 제어부는 상기 궤적이 가로 방향으로 형성되는 경우와 세로 방향으로 형성되는 경우에, 각각 서 로 다른 터치 입력으로 구분할 수 있다. 또한 상기 터치 제스처가 드래그 입력인 경우, 상기 터치 입력이 드래 그된 궤적의 시작점 위치 및 종료점 위치 중 적어도 하나에 따라 터치 제스처를 서로 다른 입력으로 구분할 수 있다. 이러한 경우 동일한 궤적을 형성하는 드래그 입력이 인가되는 경우라도, 시작점 또는 종료점의 위치에 따 라 상기 터치 제스처에 따른 입력이 인가되는 애플리케이션(또는 프로그램)이 달라지거나, 서로 다른 제어가 수 행될 수 있다. 또는 서로 다른 기능이 실행될 수도 있다. 도 7a 내지 도 7e는 본 발명과 관련된 이동 단말기에서, 인가되는 터치 제스처를 설명하기 위한 개념도들이다. 상기 터치 제스처는 일 지점에 터치 입력을 인가하는지 여부 또는 터치 입력에 이어서 일 방향으로 연속된 드래 그를 인가하는지 여부에 따라 서로 다른 입력을 인가하는 터치 제스처로 구분될 수 있다. 또한 드래그 입력의 경우 상기 터치 입력이 드래그되는 궤적의 방향에 따라 서로 다른 입력으로 구분될 수 있다. 도 7a는 이러한 터치 제스처 유형들의 예를 보이고 있는 것이다. 이하의 설명에서는 설명의 편의상 터치 제스처 가 상기 디스플레이부의 서브 영역들(210, 220) 중 제1 영역에 인가되는 것만을 예로 들어 설명하기 로 한다. 그러나 설명된 바와 동일한 방식으로 다른 서브 영역(예 : 제2 영역) 또는 노치 영역에 인 가되는 터치 제스처 역시 다양한 터치 입력으로 구분될 수도 있음은 물론이다. 먼저 도 7a의 (a)는 제1 영역의 일 지점에 인가되는 터치 입력의 예를 보이고 있다. 예를 들어 제어부 는 터치 대상체가 제1 영역의 일 지점에 접촉하는 터치 제스처가 감지되는 경우, 상기 일 지점 에 대한 터치 입력이 인가된 것으로 인식할 수 있다. 이 경우 비록 접촉이 이루어지지 않았다고 하더라도, 터치 대상체가 상기 일 지점에서 기 설정된 시간 이 상 호버링(hovering)하는 경우, 제어부는 근접 센서 또는 광 센서(카메라)에 근거하여 이러한 터치 제스처 를 감지할 수 있으며, 상기 터치 제스처를 상기 일 지점에 대한 터치 입력으로 구분할 수도 있다. 따라서 실제 접촉이 이루어지지 않는 에어 제스처 방식으로 상기 터치 제스처에 따른 터치 입력이 감지될 수 있다. 이처럼 일 지점에 터치 입력을 인가하는 터치 제스처는, 특정 영역을 지정하기 위한 방식으로 이용될 수 있다. 즉, 상기 서브 영역들(제1 영역과 제2 영역), 또는 상기 서브 영역들과 노치 영역에 각각 서로 다른 알림(Notification) 정보가 표시되는 경우, 상기 터치 제스처에 따라 어느 하나가 선택되고 그 관련 정보 가 표시될 수 있다. 여기서 제어부는 메인 영역의 적어도 일부에 상기 선택된 영역에 대응하는 관련 정보가 표시될 수 있다(도 3b 내지 도 3c 참조). 한편 상기 터치 제스처에 따라 특정 영역이 지정되는 경우, 제어부는 상기 특정 영역에 대응하는 기능을 실행할 수 있다. 즉, 상기 터치 제스처에 근거하여 제어부는 상기 서브 영역들 또는 노치 영역 중 어 느 하나에 인가되는 터치 입력을 감지할 수 있으며, 터치 입력이 인가되는 영역에 대응하는 특정 기능을 실행할 수 있다. 여기서 상기 서브 영역들 및 노치 영역에 각각 대응하는 기능들은 사용자에 의해 지정될 수 있으며, 또는 사용 빈도가 높은 애플리케이션 또는 프로그램에 관련된 기능들이 자동으로 지정될 수도 있다. 또는 상기 일 지점에 터치 입력을 인가하는 터치 제스처에 근거하여, 제어부는 특정 정보를 표시하기 위한 영역을 결정할 수 있다. 예를 들어 제어부는 메인 영역에서 표시되는 정보들 중 사용자가 선택한 정 보를, 상기 서브 영역들(제1 영역, 제2 영역) 중 어느 하나에 표시할 수 있다. 이 경우 제어부 는 상기 터치 제스처가 인가되는 영역으로, 상기 사용자에 의해 선택된 정보들이 표시되는 영역을 결정할 수 있 다. 한편 터치 입력이 감지되는 경우, 제어부는 상기 터치 입력을 드래그하는 터치 제스처를 감지할 수 있다. 마찬가지로 상기 터치 입력을 드래그하는 터치 제스처 역시 상기 근접 센서 또는 광센서를 이용한 에어 제스처 방식으로 감지될 수도 있다. 그러면 제어부는 상기 터치 입력이 드래그된 궤적에 따라 상기 터치 제스처를 서로 다른 터치 입력으로 구 분할 수 있다. 예를 들어 도 7a의 (b)에서 보이고 있는 바와 같이 세로 방향으로 터치 입력이 드래그되는 터치 제스처와, 도 7a의 (c)에서 보이고 있는 바와 같이 가로 방향으로 터치 입력이 드래그되는 터치 제스처는, 각각 서로 다른 터치 입력으로 구분될 수 있다. 따라서 상기 가로 방향의 드래그 궤적을 형성하는 터치 제스처 및 세로 방향으로 드래그 궤적을 형성하는 터치 제스처는 각각 서로 다른 애플리케이션 또는 프로그램의 입력으로 인가되거나, 특정 기능 또는 애플리케이션에 대해 각각 서로 다른 처리를 수행하기 위한 입력으로 인가될 수 있다. 일 예로 도 7a의 (b)에서 보이고 있는 바와 같이 세로 방향의 드래그 궤적을 형성하는 터치 제스처의 경우, 터 치 입력이 인가된 영역, 즉 제1 영역이나 제2 영역 또는 노치 영역 중 어느 하나에 매칭된 특정 기능이 실행되도록 하는 터치 제스처일 수 있다. 예를 들어 상기 서브 영역들(제1 영역과 제2 영역), 또는 상기 서브 영역들과 노치 영역에는 각 각 서로 다른 기능들이 대응될 수 있다. 상기 각 영역들에 각각 대응되는 기능들은, 현재 이동 단말기의 동작 상태 또는 상기 이동 단말기에서 현재 실행되고 있는 기능에 따라 결정될 수 있음은 물론이다. 이러한 경우 상기 서브 영역들(210, 220) 중 어느 하나 또는 상기 노치 영역에 대해, 터치 입력을 인가하 고 인가된 터치 입력을 세로 방향으로 드래그하는 터치 제스처가 감지되는 경우, 제어부는 상기 터치 입력 이 인가된 영역에 대응하는 기능을 실행할 수 있다. 그리고 실행된 기능에 따른 실행 화면을 메인 영역의 적어도 일부에 표시할 수 있다. 한편 상기 서브 영역들(210, 220)과 노치 영역에 각각 매칭되는 서로 다른 기능들은, 현재 이동 단말기 에서 실행중인 애플리케이션 또는 프로그램에 대해 서로 다른 처리를 수행하는 기능들일 수 있다. 따라서 제어부는 상기 드래그 궤적을 형성하는 터치 제스처가 인가되는 영역에 따라, 상기 이동 단말기에서 현재 실행중인 애플리케이션 또는 프로그램에 대한 서로 다른 기능이 처리되도록 할 수도 있다. 또한 상기 드래 그 궤적이 형성되는 방향에 따라 서로 다른 방식으로 제어 또는 처리되도록 할 수도 있다. 예를 들어 이동 단말기에서 현재 실행중인 애플리케이션이 음원 데이터를 재생하는 재생 애플리케이션인 경우, 상기 서브 영역들은 각각 볼륨을 조절하는 기능과 곡을 선택하는 기능에 대응할 수 있다. 그러면 제어부 는 도 7a의 (c)에서 보이고 있는 바와 같이 가로 방향으로 터치 입력이 드래그되는 터치 제스처에 근거하 여 어느 하나의 기능을 선택함과 동시에, 선택된 기능이 상기 터치 입력이 드래그되는 방향에 따라 서로 다르게 처리되도록 할 수도 있다. 일 예로 터치 입력이 볼륨 조절 기능에 대응하는 영역에 인가되는 경우, 제어부는 상기 터치 입력이 좌우 방향 중 어느 방향으로 드래그되는지에 따라 볼륨을 증가시키거나 감소시킬 수 있다. 또는 상기 터치 입력이 곡 선택 기능에 대응하는 영역에 인가되는 경우, 제어부는 상기 터치 입력이 좌우 방향 중 어느 방향으로 드 래그되는지에 따라 이전 곡을 재생하거나 다음 곡을 재생할 수 있다. 한편 제어부는 터치 입력을 드래그하는 터치 제스처의 시작점 또는 종료점에 근거하여 터치 입력을 구분할 수도 있다. 예를 들어 도 7a의 (d)에서 보이고 있는 바와 같이, 메인 영역이 복수의 영역으로 구분되는 경 우 제1 영역에 인가된 터치 입력이, 상기 메인 영역의 구분된 영역들(702, 704, 706) 각각으로 드래 그되는 경우, 제어부는 이를 동일한 터치 제스처로 식별하거나 또는 각각 서로 다른 터치 입력으로 식별할 수도 있다. 여기서 상기 메인 영역의 구분된 영역들(702, 704, 706)은, 각각 제1 영역에 대응하는 영 역, 제2 영역에 대응하는 영역, 노치 영역에 대응하는 영역일 수 있다. 이러한 경우에, 도 6의 S604 단계에서 보이고 있는 바와 같이, 터치 입력의 시작점 위치에 따라 터치 입력에 대 응하는 영역을 식별하는 경우, 비록 종료점들(716a, 716b, 716c)에 대응하는 영역들이 서로 다른 영역들인 경우 에도, 터치 입력의 시작점이 동일한 이상 상기 제1 영역에 인가된 터치 입력을, 각 종료점들(716a, 716b, 716c)에 드래그하는 터치 제스처들은 모두 동일한 터치 입력으로 식별될 수 있다. 따라서 제어부는 각각의 터치 제스처가 인가되는 경우에, 상기 제1 영역에 대응하는 기능을 실행하거나, 또는 상기 제1 영 역에 대응하는 제어를 수행할 수 있다. 반면 터치 입력의 종료점 위치에 따라 터치 입력에 대응하는 영역을 식별하는 경우, 제어부는 도 7a의 (d)에서 보이고 있는 바와 같이 제1 영역에 인가된 터치 입력을, 제1 영역에 대응하는 영역 의 제1 종료점(716a), 제2 영역에 대응하는 영역의 제2 종료점(716b) 및, 노치 영역에 대응하는 영역의 제3 종료점(716c)으로 드래그하는 각 터치 제스처를, 각각 서로 다른 영역에 대해 인가되는 터치 입력으로 식별할 수 있다. 이 경우, 상기 제1 종료점(716a)으로 드래그되는 터치 제스처는 상기 제1 영역에 인가되는 터치 입력으로 식별될 수 있다. 그러나 상기 제2 종료점(716b)으로 드래그되는 터치 제스처 및 상기 제3 종료점(716c)으로 드 래그되는 터치 제스처들은 각각 상기 제2 영역 및 노치 영역에 인가되는 터치 입력으로 식별될 수 있 다. 그리고 제어부는 식별된 영역에 대응하는 기능을 실행하거나, 또는 식별된 영역에 대응하는 제어를 수 행할 수 있다. 한편 제어부는 감지되는 터치 대상체의 개수에 따라 터치 입력을 서로 다른 입력으로 구분할 수도 있다. 예를 들어 도 7b의 (a)와 (b)는 터치 대상체의 개수가 다른 터치 제스처의 예들을 보이고 있는 것이다. 먼저 도 7b의 (a)를 참조하여 살펴보면, 도 7b의 (a)는 하나의 터치 대상체에 의해 일 지점에 터치 입력이 인가된 상태에서 일 방향으로 상기 터치 입력이 드래그되는 터치 제스처의 예를 보이고 있다. 이와 달리 도 7b 의 (b)는 복수의 터치 대상체에 의해 복수의 지점(710a, 710b)에 터치 입력이 인가된 상태에서 일 방향으로 상 기 터치 입력이 드래그되는 터치 제스처의 예를 보이고 있다. 도 7b의 (a) 및 (b)에서 보이고 있는 바와 같이, 동일한 방향으로 궤적을 형성하는 드래그 입력이라고 할지라도, 제어부는 상기 터치 입력을 인가하는 터치 대상체의 개수에 따라 이를 서로 다른 터치 입력으로 식별할 수 있다. 그리고 상기 터치 제스처가 다른 터치 입력으로 식별되는 경우 제어부는 각각의 터치 제 스처에 근거하여 서로 다른 기능을 수행할 수 있다. 예를 들어, 이동 단말기는 SNS(Social Network Service) 이벤트가 발생하는 경우, 발생된 이벤트를 알리기 위한 알림 정보를 상기 서브 영역 중 적어도 하나에 표시할 수 있다. 일예로 상기 제1 영역 및 제2 영역 중 어느 하나에 상기 알림 정보가 표시되거나, 또는 상기 제1 영역 및 제2 영역이 서로 다른 SNS 이벤트 발생 알림 정보를 표시할 수도 있다. 이러한 경우 제어부는 상기 알림 정보가 표시되는 영역들 중 어느 하나에 대해, 복수의 터치 입력이 인가 되고 상기 복수의 터치 입력이 드래그되는 터치 제스처가 감지되면, 해당 영역의 알림 정보 표시를 종료할 수 있다. 반면 상기 어느 하나의 영역에 대해 하나의 터치 입력이 인가되고 상기 하나의 터치 입력이 드래그되는 터치 제스처가 감지되는 경우, 해당 영역의 알림 정보에 관련된 정보를 디스플레이부 상에 표시할 수 있다. 여기서 상기 알림 정보에 관련된 정보는, 발생된 SNS 이벤트, 즉 수신된 메시지의 내용 중 적어도 일부일 수 있 다. 이 경우 제어부는 상기 터치 입력이 인가된 서브 영역에 대응하는 메인 영역의 일 영역에 상기 알림 정보에 관련된 정보를 표시할 수 있다. 또는 제어부는 상기 하나의 터치 입력이 드래그되는 터치 제 스처에 대한 응답으로, 상기 알림 정보에 대응하는 SNS 기능을 실행하고, SNS 기능의 실행 화면을 디스플레이부 의 메인 영역의 적어도 일부에 표시할 수 있다. 한편 만약 상기 이동 단말기가 음원 재생 기능을 실행하고 있는 상태라면, 제어부는 상기 서브 영역 중 어느 하나에 대해 인가되는 터치 제스처의 유형에 따라 각각 서로 다른 처리가 이루어지도록 할 수도 있다. 예를 들어 제어부는 상기 감지된 터치 제스처의 유형에 따라 볼륨에 관련된 처리를 수행하거나 또는 곡 선 택에 관련된 처리를 수행할 수 있다. 즉, 제어부는 제1 영역 또는 제2 영역 중 어느 하나에, 하 나의 터치 입력이 인가(터치 대상체가 하나)되고 인가된 터치 입력을 드래그하는 터치 제스처가 감지되는 경우 볼륨을 증가시키거나 또는 감소시킬 수 있다. 그러나 복수의 터치 입력이 인가(터치 대상체가 복수)되고 인가된 터치 입력들을 드래그하는 터치 제스처가 감지되는 경우 상기 터치 입력이 인가되는 영역에 근거하여 현재 재생되는 곡 이전 곡이 재생되도록 하거나 또는 다음 곡이 재생되도록 할 수도 있다. 한편 인가된 터치 입력을 드래그하는 터치 제스처가 감지되는 경우, 제어부는 상기 드래그 궤적의 시작점 또는 종료점의 위치에 따라 각각 서로 다른 입력으로 상기 터치 제스처를 식별할 수도 있다. 도 7c 및 도 7d는 이러한 경우의 서로 다른 예들을 보이고 있는 것이다. 먼저 도 7c를 참조하여 살펴보면, 도 7c의 (a)는 서브 영역들 중 어느 하나, 예를 들어 제1 영역에서 터치 입력이 인가되어 드래그되는 터치 제스처의 예를 보이고 있다. 이러한 터치 제스처의 경우 상기 터치 제스처에 의해 형성되는 드래그 궤적의 시작점은 상기 제1 영역일 수 있다. 반면 도 7c의 (b)는 메인 영역의 일 지점에서 터치 입력이 인가되어 드래그되는 터치 제스처의 예를 보이 고 있다. 상기 터치 입력이 인가되는 메인 영역은 상기 제1 영역과 관련된 정보들이 표시되는 제1 표 시 영역일 수 있다(도 3c 참조). 한편 이처럼 터치 제스처에 의해 형성되는 드래그 궤적의 시작점이 서로 다른 경우, 제어부는 상기 터치 제스처를 서로 다른 입력으로 구분할 수 있다. 예를 들어 제어부는 도 7c의 (a)에서 보이고 있는 바와 같 이 제1 영역으로부터 드래그 궤적이 시작되는 터치 제스처가 감지되면, 이를 상기 제1 영역에 대응하 는 기능 또는 상기 제1 영역에서 표시되는 정보에 관련된 정보를 표시하기 위한 입력으로 판단할 수 있다. 따라서 제어부는 상기 제1 영역으로부터 시작된 터치 제스처에 대한 응답으로, 상기 메인 영역 중 적어도 일부에 상기 제1 영역에 관련된 정보를 표시하는 제1 표시 영역을 형성할 수 있다. 이 경 우 상기 제1 표시 영역은 상기 제1 영역에 길이 방향으로 대응하는 메인 영역의 일부에 형성될 수 있다. 한편 이처럼 제1 표시 영역이 형성된 상태에서, 제어부는 도 7c의 (b)에서 보이고 있는 바와 같이, 제1 표시 영역의 일 지점으로부터 드래그가 시작되는 터치 제스처를 감지할 수 있다. 이 경우 제어부 는 상기 제1 표시 영역과 관련된 기능을 실행할 수 있다. 예를 들어 제어부는, 상기 제1 표시 영역의 일 지점에서 드래그가 시작되는 터치 입력에 근거하여, 제1 표시 영역의 표시를 종료할 수도 있다. 한편, 도 7c에서 살펴본 바와 같이, 드래그 궤적의 시작점이 서로 다른 터치 제스처 뿐만 아니라, 드래그 궤적 의 종료점이 서로 다른 터치 제스처가 인가되는 경우, 제어부는 상기 터치 제스처들을 각각 서로 다른 입 력으로 식별할 수 있다. 도 7d는 이러한 경우의 예들을 보이고 있는 것이다. 먼저 도 7d의 (a)를 참조하여 살펴보면, 도 7d의 (a)는 제1 영역의 일 지점에 인가된 터치 입력이 메 인 영역의 일 지점까지 드래그되는 터치 제스처의 예를 보이고 있는 것이다. 반면 도 7d의 (b)는 메 인 영역의 일 지점에 인가된 터치 입력이 제1 영역의 일 지점까지 드래그되는 터치 제스처 의 예를 보이고 있는 것이다. 이러한 경우, 제어부는 비록 각 터치 제스처에 따라 형성되는 드래그 궤적들의 길이가 동일한 경우에도, 상기 터치 제스처들을 각각 서로 다른 입력으로 구분할 수 있다. 예를 들어 도 7d의 (a)에서 보이고 있는 바와 같이, 제1 영역에서 터치 입력 드래그가 시작되어 메인 영역 에서 종료되는 터치 제스처가 인가되는 경우, 제어부는 상기 터치 제스처를 상기 제1 영역에 대 응하는 기능 또는 제1 영역에서 표시되는 정보와 관련된 정보를 상기 메인 영역 상에 표시하기 위한 입력으로 판단할 수 있다. 이에 따라 상기 제1 영역에서 표시되는 알림 정보나 현재 이동 단말기에서 실행중인 기능 등과 관련된 다양한 정보들이, 디스플레이부의 메인 영역을 통해 표시될 수 있다. 반면 도 7d의 (b)에서 보이고 있는 바와 같이 드래그 궤적이 메인 영역에서 시작되어 제1 영역에서 종료되는 터치 제스처가 인가되는 경우, 제어부는 상기 터치 제스처를, 현재 메인 영역에서 표시되는 정보 중 선택된 정보를 상기 제1 영역을 통해 표시하기 위한 입력으로 판단할 수 있다. 예를 들어 메인 영역이 갤러리 등의 애플리케이션의 실행에 따라 다수의 이미지들을 표시하고 있는 상태라 면, 제어부는 상기 터치 제스처에 대한 응답으로, 상기 다수의 이미지들 중 사용자가 선택한 복수의 이미 지에 대한 정보를 상기 제1 영역에 표시할 수 있다. 여기서 상기 선택된 복수의 이미지는 아이콘 또는 썸 네일의 형태로 상기 제1 영역에 표시될 수 있다. 또는 상기 제어부는 메인 영역에 대해 인가되는 터치 제스처에 대한 응답으로, 메인 영역에서 표시되는 텍스트 중 일부가 선택될 수 있다. 또는 메인 영역에서 표시되는 웹 페이지 등에 포함된 이미지들 중 적어도 하나의 이미지가 상기 메인 영역에 대해 인가되는 터치 제스처에 대한 응답으로 선택될 수 있다. 이러한 상태에서, 제어부는 도 7d의 (b)에서 보이고 있는 바와 같이, 선택된 텍스트 또는 이미지가 표시되는 영역의 일 지점으로부터 상기 제1 영역의 일 지점으로 터치 입력을 드래그하는 터치 제스처 가 감지되면, 상기 선택된 텍스트 또는 이미지에 대한 정보를 상기 제1 영역에 표시할 수 있다. 즉, 제어 부는 상기 메인 영역에서 표시되는 정보 중 사용자가 선택한 일부에 대응하는 정보를 상기 제1 영역 에 표시하는 클립보드(Clip board) 기능을 제공할 수 있다. 여기서 상기 선택된 이미지에 대한 정보는, 상기 선택된 이미지에 대한 아이콘 또는 썸네일 이미지일 수 있다. 또한 상기 선택된 텍스트에 대한 정보는 상기 선택된 텍스트의 일부에 대응하는 문자열일 수 있다. 뿐만 아니라, 본 발명의 실시 예에 따른 이동 단말기의 제어부는 터치 입력이 인가되는 길이 또는 상 기 종료점의 위치에 따라 특정 애플리케이션 또는 프로그램과 관련된 서로 다른 기능이 선택적으로 실행되도록 할 수도 있다. 도 7e는 이러한 경우의 예를 보이고 있는 것이다. 예를 들어 제어부는 디스플레이부의 메인 영역을 복수의 영역으로 구분할 수 있다. 그리고 인가 되는 터치 제스처에 의해 형성되는 드래그 궤적의 종료점이 상기 복수의 영역 중 어느 영역인지 여부에 따라 서 로 다른 기능이 수행되도록 할 수 있다. 즉, 도 7e의 (a)에서 보이고 있는 바와 같이 제1 영역에 터치 입력이 인가되는 경우, 제어부는 도 7e의 (b) 내지 (d)에서 보이고 있는 바와 같이, 디스플레이부의 메인 영역을 복수의 영역(750, 752, 754)으로 구분할 수 있다. 여기서 상기 구분된 메인 영역의 각 영역들(750, 752, 754)은 각각 서로 다른 기능에 대응될 수 있다. 예 를 들어 상기 복수의 영역(750, 752, 754)은 카메라 애플리케이션 또는 카메라 프로그램에 관련된 서로 다른 기 능들에 대응될 수 있다. 일 예로 상기 제1 영역으로부터 가장 인접한 제1 구분 영역은 일반 사진 촬영을 위한 기능이 대응될 수 있다. 따라서 도 7e의 (b)와 같이 드래그 궤적의 종료점이 제1 영역 내의 일 지점인 경우, 제어부 는 상기 일반 사진 촬영을 위한 기능을 실행하고, 카메라의이미지 센서로부터 획득되는 이미지를 디스플레 이부 상에 표시할 수 있다. 이 경우 상기 표시되는 이미지는 프리뷰 이미지 상태로 표시될 수 있다. 또한 상기 제1 영역으로부터 가장 멀리 이격된 제3 구분 영역은 번역 기능에 대응될 수 있다. 따라서 도 7e의 (d)와 같이 드래그 궤적의 종료점이 제3 구분 영역 내의 일 지점인 경우, 제어부는 번 역 기능과 관련된 애플리케이션의 실행 화면을 표시하고, 카메라의 이미지 센서로부터 획득되는 문자열을 포함 하는 이미지를 디스플레이부 상에 표시할 수 있다. 한편 상기 제1 구분 영역과 상기 제3 구분 영역 사이의 제2 구분 영역은, 이미지 검색 기능에 대응될 수 있다. 따라서 도 7e의 (c)와 같이 드래그 궤적의 종료점이 제2 구분 영역 내의 일 지점인 경우, 제어부는 상기 이미지 검색과 관련된 애플리케이션의 실행 화면을 표시하고, 카메라의 이미지 센서 로부터 획득되는 이미지를 표시할 수 있다. 그리고 실행된 이미지 검색 애플리케이션에 따른 검색을 수행할 수 있다. 한편, 각 구분 영역에 대응하는 기능들은 사용자가 임의로 변경할 수 있음은 물론이다. 또는 상기 사용자의 사 용 빈도가 높은 순서에 따라 서브 영역으로부터 가까운 거리에 배치되도록, 상기 복수의 영역에 대응하는 각 기 능이 결정될 수 있다. 한편 제1 영역에 인가되는 터치 입력에 따라 디스플레이부의 메인 영역이 복수의 영역으로 구분 되는 경우, 제어부는 각 영역에 대응하는 기능들을 사용자가 직관적으로 알 수 있도록, 상기 복수의 구분 된 영역 각각에 대응하는 기능들의 정보를 각 영역에 표시할 수 있다. 한편 상술한 바와 같이 상기 서브 영역들 중 어느 하나 또는 노치 영역은 특정 기능에 대응될 수 있다. 그 리고 상기 서브 영역들 중 어느 하나 또는 노치 영역에 대응되는 기능들은 이동 단말기의 동작 상태 에 따라 서로 다르게 결정될 수 있다. 일 예로 이동 단말기가 대기 상태에 있는 경우(대기 화면 또는 홈 화면이 표시되는 상태)와 상기 이동 단 말기가 잠금 상태에 있는 경우, 상기 서브 영역들 중 어느 하나 또는 노치 영역에 대응되는 기능들은 서로 다를 수 있다. 예를 들어 이동 단말기가 대기 상태에 있는 경우, 상기 대응되는 기능들은 이동 단말기에서 실행 가 능한 특정 애플리케이션에 대한 기능들일 수 있다. 반면 이동 단말기가 잠금 상태에 있는 경우, 상기 대응 되는 기능들은 잠금 상태에 관련된 기능, 예를 들어 AOD(Always On Display)에 관련된 기능 및 잠금 상태의 해 제에 관련된 기능(예를 들어 잠금 화면의 표시 없이 잠금 패턴 또는 홍채 등의 잠금 해제 화면으로 바로 진입하 는 기능 등)일 수 있다. 이상의 설명에서는 본 발명의 실시 예에 따라 노치 디자인으로 형성된 디스플레이부를 가지는 이동 단말기(10 0)에서, 상기 노치 디자인에 따른 서브 영역들에 대해 인가되는 다양한 유형의 터치 제스처 및 상기 서브 영역 들과 상기 터치 제스처를 인식한 결과에 따라 수행될 수 있는 다양한 기능들을 설명하였다. 이하의 설명에서는 상기 제1 영역과 제2 영역, 그리고 노치 영역 중 적어도 하나에, 상기 도 7a 내지 도 7e에서 살펴본 터치 제스처 중 어느 하나가 인가되는 경우에 실행되는 기능들의 예들을 다수의 예시도 를 참조하여 살펴보기로 한다. 먼저 도 8은 본 발명과 관련된 이동 단말기에서, 통화 이벤트가 발생하는 경우에, 상기 제1 영역, 제 2 영역, 및 노치 영역을 이용하여 상기 통화 이벤트에 관련된 특정 기능을 바로 실행시키는 예를 보 이고 있는 것이다. 통화 이벤트가 발생하면, 디스플레이부의 일 영역, 예를 들어 메인 영역에서는 발생된 통화 이벤트에 관련된 정보를 표시할 수 있다. 즉, 도 8의 (a) 내지 (c)에서 보이고 있는 바와 같이, 호 착신 이벤트의 경우, 착신된 호의 전화번호 정보가 표시될 수 있다. 이러한 경우, 도 8의 (a)에서 보이고 있는 바와 같이, 제1 영역의 일 지점에 터치 입력이 인가되고, 상기 터치 입력을 드래그하는 제1 터치 제스처가 인가될 수 있다. 그러면 제어부는 상기 제1 영역에 대응하는 제1 기능을 실행시킬 수 있다. 여기서 상기 제1 기능은 현재 발생된 호 착신 이벤트에 따라 호를 연결 하는 기능(통화 기능)일 수 있다. 따라서 상기 제1 영역으로부터 시작되는 터치 입력이 인가되는 경우 제 어부는 통화 허용과 관련된 화면, 즉 콜 수신 허용 기능에 관련된 화면을 메인 영역의 적어도 일부에 표시할 수 있다. 한편 도 8의 (b)에서 보이고 있는 바와 같이, 통화 이벤트가 발생한 상태에서, 상기 제1 영역 대신에, 상 기 제2 영역의 일 지점에 터치 입력 및 상기 터치 입력을 드래그하는 제2 터치 제스처가 인가될 수도 있다. 그러면 제어부는 상기 제2 영역에 대응하는 제2 기능을 실행할 수 있다. 여기서 상기 제2 기능 은 상기 제1 기능과 다른 기능일 수 있다. 예를 들어 상기 제2 기능은 현재 발생된 호 착신 이벤트의 알람을 종 료시키거나, 또는 호 연결을 취소하는 기능(통화 종료 기능)일 수 있다. 따라서 상기 제2 터치 제스처가 인가되는 경우, 제어부는 호 착신을 거절할 수 있다(통화 종료). 따라서 상기 제2 영역으로부터 시작 되는 터치 입력이 인가되는 경우 제어부는 통화 거절과 관련된 화면, 즉 콜 수신 거절 기능에 관련된 화면 을 메인 영역의 적어도 일부에 표시할 수 있다. 또는 제어부는 단지 호 착신을 알리는 알림 정보의 표시를 종료할 수도 있다. 또는 도 8의 (c)에서 보이고 있는 바와 같이, 상기 통화 이벤트가 발생한 상태에서, 상기 노치 영역에 터 치 입력 및 상기 터치 입력을 드래그하는 제3 터치 제스처가 인가될 수도 있다. 이러한 경우 제어부 는 상기 노치 영역 주변에 형성된 터치 감지 영역에 형성된 터치 센서로부터 상기 노치 영역에 대해 인가되는 터치 입력을 감지할 수 있다. 그러면 제어부는 상기 노치 영역에 대응하는 제3 기능을 실행시킬 수 있다. 여기서 상기 제3 기능은 상기 제1 기능 또는 제2 기능과 다른 기능일 수 있다. 예를 들어 상기 제3 기능은 현재 발생된 호 착신의 상대 방에게 아이콘 또는 기 설정된 간단한 문구로 빠른 응답을 할 수 있도록 하는 퀵 리플라이(Quick replay) 기능 일 수 있다. 한편 상기 노치 영역에 인가되는 제3 터치 제스처는, 상기 제1 영역 또는 제2 영역에 인가 되는 터치 제스처와 다른 유형의 터치 제스처일 수 있다. 예를 들어 상기 제3 터치 제스처는, 도 8의 (c) 에서 보이고 있는 바와 같이, 복수의 터치 입력이 인가되고 상기 복수의 터치 입력을 동시에 드래그하는 터치 입력일 수 있다. 즉, 도 8의 (c)에서 보이고 있는 바와 같이 복수의 터치 입력이 동시에 드래그되는 터치 입력이 노치 영역(24 0)에 인가될 때, 제어부는 이를 노치 영역에 대해 인가되는 터치 입력으로 식별할 수 있다. 따라서상기 노치 영역 주변에서 제1 영역 또는 제2 영역에 터치 입력(제1 터치 입력 또는 제2 터 치 입력)이 인가되는 경우에, 인가된 터치 입력을 상기 노치 영역에 대해 인가되는 터치 입력과 구분 할 수도 있다. 한편, 상기 도 8의 (a) 및 (b)의 경우, 동일한 유형의 터치 제스처, 즉 어느 하나의 터치 입력을 드래그하는 터 치 제스처가 서로 다른 영역에 인가됨에 따라 서로 다른 기능이 수행되도록 하는 예를 살펴보았다. 그러나 본 발명의 실시 예에 따른 이동 단말기의 제어부는 같은 영역에 인가되는 터치 제스처인 경우 에도, 터치 제스처의 유형에 따라 이를 서로 다른 터치 입력으로 구분할 수 있다. 도 9는 본 발명과 관련된 이동 단말기에서, 디스플레이부의 구분된 서브 영역들에 인가되는 터치 제 스처의 유형에 따라 서로 다른 기능을 수행하는 예를 설명하기 위한 예시도이다. 이하 도 9의 설명에서는 이동 단말기가 음원 데이터를 재생하는 재생 기능을 수행하는 경우를 예로 들어 설명하기로 한다. 여기서 상기 음원 데이터의 재생과 관련된 애플리케이션의 실행 화면은 디스플레이부 상 에 표시되지 않는 상태(백그라운드(back ground))로 실행되는 것을 가정하여 설명하기로 한다. 한편 음원 데이터의 재생과 관련된 애플리케이션이 실행되는 경우, 상기 제1 영역 및 제2 영역에는 상기 애플리케이션의 서로 다른 기능이 대응될 수 있다. 예를 들어 도 9의 (a)에서 보이고 있는 바와 같이, 볼 륨을 증가시키는 볼륨 업(Volume up) 기능 또는 볼륨을 하향시키는 볼륨 다운(Volume down) 기능이 상기 제1 영 역 또는 제2 영역에 각각 대응될 수 있다. 또는 도 9의 (b)에서 보이고 있는 바와 같이 현재 재생되 는 음원 데이터 이전의 음원 데이터를 선곡하는 이전 곡 선곡(previous) 기능 또는 현재 재생되는 음원 데이터 이후의 음원 데이터를 선곡하는 다음 곡 선곡(next) 기능이 상기 제1 영역 또는 제2 영역에 각각 대 응될 수 있다. 이러한 경우, 제어부는 터치 제스처가 인가되는 영역에 따라 상기 서브 영역들(210, 220) 중 어느 하나가 선택된 것으로 식별할 수 있다. 그리고 상기 인가된 터치 제스처의 유형에 따라 상기 터치 제스처를, 각 서브 영역(210, 220)에 대응하는 서로 다른 기능 중 어느 하나에 대한 것으로 식별할 수 있다. 이 경우 제어부 는 터치 입력을 인가하는 터치 대상체의 개수에 따라, 상기 제1 영역과 제2 영역에 각각 대응하는 기 능들의 셋을 결정하고, 터치 제스처가 인가되는 영역에 따라 어느 하나의 기능을 제어할 수 있다. 예를 들어 제어부는 터치 입력을 인가하는 터치 대상체가 하나인 경우 제1 영역 및 제2 영역에 각각 볼륨 업 기능 및 볼륨 다운 기능을 매칭할 수 있다. 반면 터치 입력을 인가하는 터치 대상체가 복수인 경 우 제1 영역 및 제2 영역에 각각 이전 곡 선곡 기능 및 다음 곡 선곡 기능을 매칭할 수 있다. 그리고 상기 인가된 터치 입력이 드래그되는 터치 제스처가 인가되면, 상기 터치 입력 드래그의 시작점 또는 종료점에 근거하여 어느 하나의 영역에 대응하는 기능을 제어할 수 있다. 따라서 제1 영역에 인가된 하나의 터치 입력을 드래그하는 터치 제스처가 인가되는 경우, 제어부는 상기 제1 영역에 하나의 터치 입력이 인가되는 경우에 대응하는 기능을 제어할 수 있다. 따라서 도 9의 (a)에서 보이고 있는 바와 같이, 볼륨 업 기능을 통해 볼륨이 증가되도록 제어되도록 할 수 있다. 반면 제1 영역에 인가된 복수의 터치 입력을 드래그하는 터치 제스처가 인가되는 경우, 제어부는 상 기 제1 영역에 복수의 터치 입력이 인가되는 경우에 대응하는 기능을 제어할 수 있다. 따라서 도 9의 (b) 에서 보이고 있는 바와 같이, 이전 곡 선곡 기능을 통해, 현재 재생되고 있는 음원 데이터 이전에 재생되었던 음원 데이터가 다시 재생되도록 할 수 있다. 한편 상술한 설명에 따르면 본 발명의 실시 예에 따른 이동 단말기는 제1 영역 및 제2 영역과 같은 서브 영역은, 현재 실행되고 있는 기능과 관련된 다양한 화상 정보를 표시하는 영역으로 이용될 수도 있음 을 언급한 바 있다. 이 경우 상기 서브 영역들은 각각 서로 다른 정보를 출력할 수 있다. 또한 상기 서브 영역 은, 인접한 디스플레이부 메인 영역의 일 부분을 상기 서브 영역과 연결되는 연장 영역으로 더 포함 할 수 있음을 언급한 바 있다. 도 10은 본 발명과 관련된 이동 단말기에서, 상기 서브 영역 및 메인 영역의 일부에서, 현재 이동 단말기 에서 실행 중인 기능과 관련된 정보들을 표시하는 예를 도시한 예시도이다. 이하의 도 10의 설명에서는 상 기 이동 단말기에서 실행 중인 기능의 예로서, 인공지능 어시스턴트(AI(Artificial Intelligence) Assistant) 기능의 예를 들어 설명하기로 한다. 이 경우, 제어부는 상기 인공지능 어시스턴트 기능에 따라 출력되는 정보와 사용자로부터 입력되는 정보를 각각 서로 다른 서브 영역 및 메인 영역의 일부에 표시할 수 있다. 먼저 도 10의 첫 번째 도면을 참조하여 살펴보면, 도 10의 첫 번째 도면은, 상술한 예에 따라 인공지능 어시스 턴트 기능이 수행된 경우에 표시되는 화면의 예를 도시한 것이다. 제어부는 도 10의 첫 번째 도면에서 보이고 있는 바와 같이, 제1 영역을 통해 현재 수행되는 기능과 관련된 정보를 표시할 수 있다. 따라서 현재 실행중인 기능의 명칭(‘Assistant’)이 제1 영역에 표시될 수 있다. 이 경우, 도 10의 첫 번째 도면에서 보이고 있는 바와 같이, 메인 영역의 일부 영역(제1 표시 영역, 100 0)을 통해 현재 수행되는 기능과 관련된 다른 정보를 표시할 수 있다. 이 경우 상기 제1 표시 영역은 상 기 제1 영역과 연결되도록 표시될 수 있다. 따라서 제1 표시 영역에, 현재 실행중인 인공지능 어시 스턴트의 기능으로부터 출력되는 정보가 표시될 수 있다. 한편 표시된 정보에 대한 응답으로, 사용자는 질문 사항을 입력할 수 있다. 예를 들어 상기 질문 사항은 음성 입력 또는 키보드와 같은 IME(Input Method Editor) 수단을 통해 입력될 수 있다. 이 경우 사용자가 입력한 정 보는 제1 영역과 다른 서브 영역, 즉 제2 영역 및 상기 제2 영역과 연결되도록 형성되는 메인 영역의 일부 영역, 즉 제2 표시 영역에 표시될 수 있다. 즉, 출력되는 정보의 출처가 서로 다른 경 우, 상기 정보는 서로 다른 서브 영역에 표시될 수 있다. 한편 사용자의 질문 사항이 입력되면, 제어부는 현재 실행된 인공지능 어시스턴트 기능에 따른 검색 결과 에 근거하여, 현재 입력된 질문 사항에 대한 답변을 표시할 수 있다. 이 경우 현재 표시되는 정보의 출처는 상 기 인공지능 어시스턴트 기능이므로, 상기 정보는 제1 영역 및 제1 표시 영역 중 적어도 하나에 표 시될 수 있다. 도 10의 세 번째 도면은 이러한 예를 보이고 있는 것이다. 한편 제어부는 사용자의 선택에 따라 현재 표시되는 정보에 관련된 보다 상세한 정보를 제공할 수도 있다. 예를 들어 도 10의 세 번째 도면에서 보이고 있는 바와 같이, 답변 정보가 표시되는 제1 표시 영역에 대 해 사용자의 추가적인 선택(예 : 터치 입력)이 감지되면, 제어부는 상기 제1 표시 영역에서 표시되는 정보에 대한 보다 상세한 검색 결과를 추가 정보로서 더 표시할 수도 있다. 도 10의 네 번째 도면은 이처럼 사용자의 추가적인 선택에 따라, 상기 제1 표시 영역에 추가 정보가 더 표시되는 예를 보이고 있 는 것이다. 한편 도 10의 네 번째 도면에서 메인 영역의 일부에 상기 제1 표시 영역이 형성되는 것과는 달리, 상기 추가 정보는 디스플레이부 상의 메인 영역 전체에 표시될 수도 있다. 이처럼 현재 실행 중인 기 능과 관련된 정보가 메인 영역 전체에 표시되는 경우, 상기 제1 표시 영역은 더 이상 표시되지 않을 수 있다. 도 11은 본 발명과 관련된 이동 단말기에서, 현재 실행중인 기능과 관련하여 상기 서브 영역을 이용하여 메인 영역에 표시되는 텍스트 문자열을 다른 언어로 번역하는 기능이 수행되는 예를 도시한 예시도이다. 먼저 도 11의 첫 번째 도면을 참조하여 살펴보면, 도 11의 첫 번째 도면은 디스플레이부에 웹 페이지 가 표시되는 예를 보이고 있다. 이러한 경우 상기 서브 영역들(제1 영역, 제2 영역) 중 적어도 하나(예 : 제1 영역)는 현재 접속된 웹 페이지에 대한 정보를 표시할 수 있다. 그리고 나머지 서브 영역 (예 : 제2 영역)은 이동 단말기의 현재 상태, 즉 배터리 상태, 네트워크 상태 등에 대한 정보와 같은 스테이터스 정보들이 표시될 수 있다. 한편 이러한 상태에서, 제어부는 디스플레이부 상에 인가되는 터치 입력에 근거하여 상기 웹 페이지 상에 표시되는 일부의 문자열을 선택할 수 있다. 예를 들어 제어부는 도 11의 첫 번째 도면 에서 보이고 있는 바와 같이, 상기 웹 페이지 상에 인가된 터치 입력이 드래그되는 궤적을 따라 적어도 하나의 문자를 포함하는 문자열을 사용자로부터 선택받을 수 있다. 한편 제어부는 선택된 문자열이 표시되는 영역에서 터치 입력이 인가되는 경우, 인가된 터치 입력을 드래 그하는 터치 제스처를 감지할 수 있다. 그리고 상기 터치 입력이 드래그되는 지점, 즉 드래그의 종료점 위치에 근거하여 특정 기능을 수행할 수 있다. 그리고 여기서 상기 드래그의 종료점이 서로 다른 경우, 각각 서로 다른 기능이 실행될 수 있다. 예를 들어 상기 드래그의 종료점이 제1 영역 인 경우 제어부는 상기 인가된 터치 입력을 드래그하는 터치 제스처에 대한 응답으로 제1 기능을 실행할 수 있다. 여기서 상기 제1 기능은 선택된 문자열을 표시하는 기능일 수 있다. 따라서 제어부는 현재 선택된 문자열을 드래그의 종료점에 대응하는 영역, 즉 제1 영역에 표시할 수 있다. 또는 제어부는 도 11의 세 번째 도면에서 보이고 있는 바와 같이, 제1 영역에 연결되는 메인 영역의 일부, 즉 제1 표시 영역을 형성하고, 선택된 문자열을 상기 제1 표시 영역에 표시할 수 있다. 한편, 제어부는 선택된 문자열이 제1 표시 영역에 표시되는 상태에서, 상기 제1 영역 또 는 제2 영역 중 어느 한 영역에 인가되는 터치 입력을 감지할 수 있다. 그리고 감지된 터치 입력에 따라 상기 제1 표시 영역에 표시된 문자열에 관련된 서로 다른 기능을 수행할 수 있다. 예를 들어 상기 제1 영 역에 대응하는 기능은 선택된 문자열에 대한 번역 기능일 수 있다. 그리고 상기 제2 영역에 대 응하는 기능은 상기 선택된 문자열을 편집할 수 있는 편집 기능일 수 있다. 따라서 도 11의 세 번째 도면에서 보이고 있는 바와 같이, 제1 영역이 선택되는 경우, 제어부는 번역 기능을 실행할 수 있다. 이 경우, 상기 번역의 대상은 현재 제1 표시 영역에 표시되고 있는 문자열, 즉 사용자로부터 선택된 문자열일 수 있다. 따라서 도 11의 네 번째 도면에서 보이고 있는 바와 같이, 선택된 문자 열이 기 설정된 언어에 따라 번역된 문자열이 상기 제1 표시 영역에서 표시될 수 있다. 반면 제2 영역이 선택되는 경우, 제어부는 편집 기능을 실행할 수 있다. 이 경우, 상기 제어부 는 제2 영역과 인접한 메인 영역의 일부에 상기 선택된 문자열의 편집에 관련된 정보, 즉 편집창을 표시하는 제2 표시 영역을 형성할 수 있다. 그리고 제2 표시 영역을 통해 표시되는 편집창을 통해 상기 선택된 문자열에 대한 편집을 수행할 수 있다. 한편 상술한 도 11에서는 디스플레이부 상에 웹 페이지가 표시되고 상기 웹 페이지에 포함된 문자열 중 일 부가 사용자의 선택에 따라 번역되는 예를 살펴보았으나, 이는 본 발명을 설명하기 위한 예시일 뿐 본 발명이 이에 한정되는 것이 아님은 물론이다. 즉, 디스플레이부 상에 상기 웹 페이지가 표시되는 경우 뿐만 아니 라 전자책, 텍스트 데이터의 표시 등, 문자열을 표시하는 수많은 다양한 경우에도, 상기 도 11에서 도시하고 있 는 바와 유사한 방식으로 상기 제1 영역 또는 제2 영역을 활용한 번역 기능을 제공할 수 있음은 물론 이다. 한편 도 11에서 살펴본 바와 같이, 상기 서브 영역은 디스플레이부 상에 표시되는 정보 중 사용자가 선택 한 정보를 표시하는 영역이 될 수 있다. 또한 상기 도 11에서는 제1 영역 또는 상기 제1 영역과 연결 되는 메인 영역의 일부를 통해 상기 선택된 정보를 표시하는 예 만을 설명하였으나, 상기 제1 영역 뿐만 아니라 제2 영역을 이용하여 상기 선택된 정보가 표시되도록 할 수도 있음은 물론이다. 즉, 본 발명의 실시 예에 따른 이동 단말기는 상기 서브 영역의 구분된 개수만큼, 사용자가 선택한 정보를 임시 저장하고 저장된 정보를 표시하는 영역들이 형성될 수 있다. 이하 이처럼 사용자로부터 선택된 정보들을 임시 저장하는 기능을 클립 보드(Clip board) 기능이라고 칭하기로 한다. 한편 상기 클립 보드 기능이 수행되는 경우 사용자에 의해 선택된 정보들은 임시 저장될 수 있으며, 임시 저장 된 정보들은 상기 제1 영역이나 제2 영역에 표시될 수 있다. 또는 임시 저장된 정보들은 상기 제1 영 역과 인접한 메인 영역의 일부, 즉 제1 표시 영역이나 제2 영역과 인접한 제2 표시 영역을 통해 표시될 수 있다. 도 12는 본 발명과 관련된 이동 단말기에서, 현재 실행중인 기능과 관련하여 상기 서브 영역을 이용하여 상기 클립 보드 기능이 수행되는 예를 도시한 예시도이다. 먼저 도 12의 첫 번째 도면은 디스플레이부에 웹 페이지가 표시되는 예를 보이고 있다. 이러한 상태 에서, 제어부는 디스플레이부 상에 인가되는 터치 입력에 근거하여 상기 웹 페이지 상에 표시 되는 일부의 문자열을 선택할 수 있다. 예를 들어 제어부는 도 12의 첫 번째 도면에서 보이고 있는 바와 같이, 상기 웹 페이지 상에 인가된 터치 입력이 드래그되는 궤적을 따라 적어도 하나의 문자를 포함 하는 문자열을 선택할 수 있다. 그러면 제어부는 선택된 문자열이 표시되는 영역에 인가되는 터치 입력을 감지할 수 있다. 그리고 도 12의 두 번째 도면에서 보이고 있는 바와 같이 상기 터치 입력을 제1 영역 또는 제2 영역으로 드래그하는 터치 제스처를 감지할 수 있다. 그러면 제어부는 상기 선택된 문자열에 관련된 기능들 중, 상기 제1 영역 또는 제2 영역에 대응하는 어느 하나의 기능을 상기 터치 제스처에 근거하여 실행할 수 있다. 이 경 우 상기 제1 영역에 대응하는 기능을 상기 클립 보드 기능으로 가정하기로 한다. 한편 상기 터치 제스처에 근거하여 클립 보드 기능이 수행되는 경우 제어부는 현재 선택된 문자열을 임시 저장할 수 있다. 그리고 임시 저장된 문자열에 대한 정보를 상기 제1 영역에 표시할 수 있다. 또는 제어부 는 제1 영역에 인접한 메인 영역의 일부에 제1 표시 영역을 형성하고, 도 12의 세 번째 도면에서 보이고 있는 바와 같이 임시 저장된 문자열을 제1 표시 영역에 표시할 수 있다. 한편 상기 도 12의 세 번째 도면에서 보이고 있는 바와 같이, 상기 제1 영역 또는 제1 표시 영역에 는 상기 임시 저장된 문자열 뿐만 아니라 기 저장된 적어도 하나의 다른 정보가 더 표시될 수 있다. 일 예로 이미지 등이 임시 저장되는 경우, 제어부는 임시 저장된 이미지로부터 썸네일 이미지를 생 성하고 생성된 썸네일 이미지를 상기 제1 영역 또는 제1 표시 영역에 표시할 수 있다. 이처럼 임시 저장된 정보들은 사용자의 선택에 따라 디스플레이부 상에 다시 표시되거나 또는 입력될 수 있다. 예를 들어, 사용자가 디스플레이부 상의 일 영역에 대해 붙여넣기 또는 입력을 선택하고, 상기 제1 영역 또는 제1 표시 영역에 표시된 임시 저장된 정보들 중 어느 하나를 선택하는 경우, 선택된 정보 가 사용자가 지정한 영역에 입력 및 표시될 수 있다. 한편 상기 클립 보드 기능과 달리, 사용자의 선택에 따라 현재 디스플레이부 상에 표시되는 화면에 대응하 는 애플리케이션 또는 웹 문서의 정보가 임시 저장될 수 있음은 물론이다. 이처럼 선택된 화면에 대응하는 기능 의 정보들을 임시 저장하는 기능을 트레이(tray) 기능이라고 칭하기로 한다. 한편 제어부는 애플리케이션 또는 웹 문서 등이 표시되는 상태에서 디스플레이부 상에 인가되는 터치 제스처를 감지할 수 있다. 예를 들어 제어부는, 감지된 터치 제스처가 상술한 바와 같이 일 영역 또는 객 체가 선택된 상태에서 상기 선택된 객체가 표시되는 영역에서 터치 입력이 인가되고 인가된 터치 입력이 드래그 되는 터치 제스처인지, 또는 상기 일 영역 또는 객체가 선택되지 않은 상태에서 디스플레이부 상의 일 지 점에 터치 입력이 인가되고 터치 입력이 드래그되는 터치 제스처인지를 구분할 수 있다. 그리고 전자의 경우 상 기 터치 제스처를 상술한 클립 보드 기능을 실행하기 위한 터치 제스처로 판단할 수 있고, 후자의 경우 상기 터 치 제스처를 트레이 기능을 실행하기 위한 터치 제스처로 판단할 수 있다. 한편 판단된 터치 제스처가 트레이 기능을 위한 터치 제스처인 경우, 제어부는 디스플레이부 상에 표 시되는 화면에 대응하는 정보를 임시 저장하고 임시 저장된 정보를, 상기 터치 제스처의 드래그가 종료되는 영 역에 표시할 수 있다. 여기서 터치 제스처의 드래그가 종료되는 영역은 상기 제1 영역 또는 제2 영역(22 0)일 수 있다. 그리고 상기 임시 저장되는 정보는 현재 디스플레이부 상에 실행 화면이 표시되는 애플리케이션의 정보일 수 있으며, 또는 현재 표시되는 웹 페이지의 주소 정보 등일 수 있다. 그리고 상기 제1 영역 또는 제2 영 역에서 표시되는 정보는 상기 현재 디스플레이부 상에 표시되는 실행 화면 또는 현재 표시되는 웹 페 이지에 대응하는 썸네일 이미지일 수 있다. 따라서 사용자는 상기 트레이 기능에 따라 상기 현재 임시 저장된 정보에 대응하는 애플리케이션 등을 직관적으로 식별할 수 있다. 한편 트레이 기능의 경우, 사용자가 상기 제1 영역 또는 제2 영역에서 표시되는 정보들 중 어느 하나 를 선택하면, 선택된 정보에 대응하는 화면이 디스플레이부 상에 바로 표시될 수 있다. 예를 들어 제어부 는 선택된 정보에 대응하는 애플리케이션을 바로 실행하고 실행 화면을 표시할 수 있다. 또는 선택된 정보 에 대응하는 페이지의 문서를 바로 표시하거나 또는 선택된 정보에 대응하는 웹 페이지에 바로 접속하여 접속된 웹 페이지를 표시할 수도 있다. 여기서 상기 제1 영역 또는 제2 영역에서 표시되는 정보들 중 어느 하나의 선택은, 상기 제1 영역 또는 제2 영역에서 표시되는 썸네일 이미지들 중 어느 하나에 대해 기 설정된 터치 제스처를 인가하 거나(예 : 더블 터치), 어느 하나의 썸네일 이미지를 디스플레이부의 메인 영역으로 드래그함으로써 이루 어질 수도 있다. 한편 이러한 클립 보드 기능 또는 트레이 기능과 유사하게, 사용자가 선택한 객체들을 임시 저장하고 저장된 객 체들의 정보를 상기 서브 영역을 통해 표시할 수도 있음은 물론이다. 예를 들어 사용자가 앨범 또는 갤러리와 같이 복수의 이미지가 표시되는 상태에서 일부를 선택하는 경우 선택된 복수의 이미지들에 대한 정보가 상기 제 1 영역 또는 제2 영역에 표시될 수 있다. 여기서 상기 표시되는 정보들은 상기 선택된 복수의 이미지 각각에 대한 썸네일 이미지일 수 있다. 도 13은 본 발명과 관련된 이동 단말기에서, 감지된 터치 제스처에 따른 터치 입력 시작점 및 종료점에 근 거하여, 서로 다른 기능이 수행되는 예를 도시한 예시도이다. 이하 도 13은 이동 단말기가 잠금 화면 상태에서 기 설정된 정보들을 표시하는 AOD(Always On Display) 동 작 상태에서 노치 영역에 대해 터치 제스처가 인가되는 경우를 가정하여 설명하기로 한다. 본 발명의 실시 예에 따른 이동 단말기의 제어부는 AOD 동작 상태에서 상기 노치 영역에 인가되 는 터치 제스처를 감지할 수 있다. 여기서 상기 터치 제스처는 상기 도 7a 내지 도 7e에서 언급된 터치 제스처 의 유형들 중 어느 하나일 수 있다. 도 13의 첫 번째 도면은, 이동 단말기가 AOD 동작 상태에서, 상기 노 치 영역에 복수의 터치 대상체에 의한 터치 입력들이 인가되고, 상기 터치 입력들이 드래그되 는 터치 제스처가 인가되는 예를 보이고 있는 것이다. 한편 도 13의 첫 번째 도면에서 보이고 있는 바와 같이 노치 영역에 대한 기 설정된 터치 제스처가 인가되 는 경우, 제어부는 현재 이동 단말기의 동작 상태 및 상기 터치 제스처의 유형과 상기 터치 제스처가 인가되는 영역에 근거하여 특정 기능을 실행할 수 있다. 상기 특정 기능은 이미지 센서를 이용하여 센싱되는 화상 정보를 프리뷰 이미지의 형태로 디스플레이부 상 에 표시하는 프리뷰 이미지 표시 기능일 수 있다. 이러한 경우 제어부는 상기 복수의 터치 입력이 드래그되는 디스플레이부 상의 일 지점에 대응하는 영역만큼 프리뷰 이미지가 표시되는 영역을 설정할 수 있다. 즉 제어부는 AOD 동작 상태에서, 상기 복수의 터치 입력이 드래그되는 길이에 따라 상기 프리 뷰 이미지가 표시될 수 있는 영역의 크기가 조절되는 글랜스 뷰(glance view) 기능을 제공할 수 있다. 한편 상기 프리뷰 이미지 표시 기능이 실행되는 경우, 제어부는 상기 인가된 복수의 터치 입력이 동 시에 드래그되는 길이에 따라 상기 프리뷰 이미지 표시 기능과 관련된 다른 기능들 중 어느 하나가 바로 수행되 도록 할 수도 있다. 이러한 경우 제어부는 현재 이동 단말기의 동작 상태, 즉 AOD 동작 상태에서, 상 기 노치 영역에 인가된 복수의 대상체가 드래그됨에 따라 상기 관련된 기능들 중 어느 하나를 사용자가 선 택할 수 있도록 하는 인터페이스를 형성할 수 있다. 일 예로 제어부는 도 13의 두 번째 도면에서 보이고 있는 바와 같이, 디스플레이부를 복수의 영역 (1310, 1320, 1330, 1340)으로 구분할 수 있다. 그리고 상기 프리뷰 이미지 표시 기능과 관련된 기능들이 상기 복수의 영역(1310, 1320, 1330, 1340) 각각에 대응되도록 할 수 있다. 일 예로 상기 프리뷰 이미지에 관련된 기능들은 촬영 기능, 이미지 검색 기능, 바코드(bar code) 인식 기능, 및 번역 기능 등을 포함할 수 있다. 이 경우 상기 촬영 기능은 상기 카메라 기능에 따라 센싱되는 프리뷰 이미지를 처리하여 기 설정된 포맷의 화상 데이터로서 저장하는 기능을 의미할 수 있다. 또한 상기 이미지 검색 기능은 상기 프리뷰 이미지를 통해 특정 객체의 이미지를 저장하고 저장된 객체에 대한 웹 검색 결과를 제공하는 기능 일 수 있다. 그리고 상기 바코드 인식 기능은 상기 프리뷰 이미지가 바코드를 포함하는 경우 바코드를 인식하고 그에 따른 기능(웹 접속 등)을 수행하는 기능일 수 있다. 그리고 번역 기능은 프리뷰 이미지가 특정 언어의 문 자열을 포함하는 경우 해당 문자열을 다른 언어로 번역하여 표시하는 기능일 수 있다. 그리고 복수의 영역으로 디스플레이부가 구분 및 서로 다른 관련 기능들이 상기 복수의 영역(1310, 1320, 1330, 1340) 각각에 대응되는 경우, 제어부는 도 13의 두 번째 도면에서 보이고 있는 바와 같이, 상기 복 수의 영역(1310, 1320, 1330, 1340) 각각에 대응되는 기능들의 식별 정보들을 표시할 수 있다. 이처럼 복수의 구분된 영역 및 각 영역에 대응하는 식별 정보들이 표시된 상태에서, 제어부는 복수의 터치 입력의 드래그가 종료되는 지점에 따라 상기 관련 기능들 중 어느 하나가 선택된 것으로 판단할 수 있다. 따라서 도 13의 세 번째 도면에서 보이고 있는 바와 같이, 상기 복수의 터치 입력이, 촬영 기능에 대응하 는 일 영역 내의 일 지점까지 드래그되는 경우, 제어부는 상기 촬영 기능에 대응하는 애플리케이션 을 바로 실행할 수 있다. 따라서 도 13의 네 번째 도면에서 보이고 있는 바와 같이, 촬영 기능에 대응하는 애플리케이션의 실행 화면 이 AOD 동작 상태에서 바로 표시될 수 있다. 한편 카메라 기능 외에도 AOD 동작 상태에서 서브 영역들(제1 영역, 제2 영역) 또는 노치 영역 에 인가되는 터치 제스처의 유형에 따른 다양한 다른 기능이 수행될 수 있다. 이러한 기능들의 예로, 터치 제스처의 유형에 따라 AOD에 관련된 다양한 설정을 변경할 수도 있다. 즉, 드래그 가 입력되는 위치, 드래그를 인가하는 터치 대상체의 개수 또는 드래그의 길이 등에 따라 현재 AOD 테마를 다른 테마로 변경하거나, 조도, AOD 상태에서 표시되는 정보 등을 변경할 수도 있다. 또는 상기 터치 제스처가 인가되는 경우, 이동 단말기에서 감지되는 다양한 정보(예를 들어 날씨)에 근거하여 AOD의 배경 애니메이션 등 을 변경할 수도 있다. 또는 제어부는 AOD 동작 상태에서, 상기 서브 영역들 또는 노치 영역 중 어느 하나에 상기 터치 제스처가 인가되었는지 여부에 따라 최근에 실행된 애플리케이션의 목록을 표시하거나, 현재 발생된 이벤트 또는 현재 이 동 단말기에서 실행 중인 기능의 실행 화면 적어도 일부를 표시할 수 있다. 또는 AOD 상태에서 특정 기능이 바 로 실행되도록 할 수도 있다. 일 예로 제어부는 AOD 상태에서 상기 서브 영역들 또는 상기 노치 영역 중 어느 하나에 상기 터치 제스처가 인가되는 경우, 잠금 화면을 표시하지 않고 락 패턴을 인가할 수 있는 화면으 로 바로 진입할 수도 있다. 한편 본 발명의 실시 예에 따른 이동 단말기는, 특정 기능이 실행되는 상태에서 상기 서브 영역들 또는 노 치 영역을 별도의 조작 영역으로 사용할 수도 있다. 예를 들어 제어부는 상기 서브 영역들 또는 노치 영역 중 적어도 하나에 상기 터치 제스처가 인가되었는지 여부에 따라, 현재 실행중인 기능의 실행 화면이 상기 서브 영역들까지 표시되도록 하는 이머시브(imersive) 화면 표시 모드와, 디스플레이부 상단에 스테이터스 정보들이 표시되는 일반 화면 표시 모드 간의 전환이 이루어지도록 할 수 있다. 또는 상기 2줄로 스테이터스 정보들이 표 시되는 표시 모드 또는 스테이터스 정보들이 표시되지 않는 표시 모드 간의 전환이 이루어지도록 할 수도 있다. 또는 상기 서브 영역들 및 상기 노치 영역은 현재 실행되는 기능과 관련된 서로 다른 처리를 선택받기 위한 용 도로 사용될 수도 있다. 예를 들어 통화 기록을 표시하는 기능이 실행되는 경우, 상기 서브 영역들 및 상기 노 치 영역은 상기 통화 기록에 포함된 전화번호들에 대한 각각 서로 다른 처리 방법에 대응될 수 있다. 예를 들어 상기 어느 하나의 전화번호가 선택된 상태에서 상기 서브 영역들 중 어느 하나에 터치 제스처가 인가되는 경우, 제어부는 터치 제스처가 인가된 영역에 따라 선택된 전화번호를 전화번호부에 저장하거나, 또는 선택된 전 화번호에 대응하는 통화 기록을 삭제할 수 있다. 반면 상기 노치 영역에서 터치 제스처가 인가되는 경우 상기 선택된 전화번호에 따른 호를 발신할 수도 있다. 한편 상기 서브 영역들은 각각 서로 다른 기능에 대응할 수 있다. 예를 들어 상기 서브 영역들은, 현재 실행되 는 기능들에 대한 서로 다른 피드백 정보를 표시할 수 있다. 또는 서로 다른 제어 메뉴에 대응될 수도 있다. 이 러한 경우 어느 하나의 서브 영역에 대해 터치 제스처가 인가되면 제어부는 현재 실행중인 애플리케이션 또는 기능에 대한 제어 메뉴를 디스플레이부 상에 표시할 수 있다. 반면 다른 하나의 서브 영역에 대해 터 치 제스처가 인가되면 제어부는 이동 단말기 시스템에 대한 제어 메뉴를 디스플레이부 상에 표 시할 수 있다. 또는 어느 하나의 서브 영역이 이벤트 등의 발생을 알리는 알림 정보를 표시하는 영역으로 활용되는 경우, 상기 알림 정보에 대응하는 애플리케이션 또는 기능의 실행 화면이 상기 서브 영역의 선택에 따라 디스플레이부 상의 적어도 일부에 표시될 수 있다. 즉, 제어부는 현재 동작 상태에 따른 화면을 표시하는 상태에서 상기 서브 영역의 선택에 따라 상기 알림 정보에 대응하는 정보를 포함하는 화면을 표시할 수 있다. 그리고 상기 서 브 영역을 다시 선택하거나 또는 다른 서브 영역(알림 정보의 표시 종료에 대응하는 경우)을 선택하는 경우, 알 림 정보에 대응하는 정보를 포함하는 화면의 표시를 종료할 수 있다. 한편 상기 서브 영역들은 현재 실행중인 기능과 관련된 정보를 표시하기 위한 용도로 활용될 수 있다. 예를 들 어 제어부는 상기 서브 영역을 통해 현재 이동 단말기에서 실행중인 기능과 관련된 다른 기능들에 대 한 정보를 표시할 수 있다. 여기서 제어부는 사용자의 사용한 애플리케이션 들의 시간별 또는 지역별 히스 토리(history) 분석 결과에 따라 상기 서브 영역에 정보를 표시할 기능들을 결정할 수 있다. 즉, 사용자가 현재 위치한 지역 또는 현재 시각 등에 근거하여, 현재 실행되고 있는 기능에 따라 추천되는 다른 기능들의 정보가, 상기 서브 영역을 통해 표시될 수 있다. 또는 본 발명의 실시 예에 따른 이동 단말기는, 상기 서브 영역들 및 노치 영역을 활용하여 현재 실행 중 인 기능의 실행 화면을 보다 넓게 표시할 수도 있다. 예를 들어 상기 서브 영역들 또는 노치 영역을 현재 실행 중인 기능(예 : 카메라 기능)과 관련된 조작키 각각에 매칭하는 경우, 또는 상기 조작키 각각에 대응하는 아이 콘들을 상기 서브 영역들에 표시하는 경우, 상기 조작키가 표시되던 영역까지 상기 실행 화면의 표시 영역으로 확장시킬 수 있다. 따라서 실행 화면(예 : 프리뷰 이미지 표시 화면)이 보다 넓은 디스플레이 영역을 통해 표시 될 수 있다. 한편 여기서 제어부는 사용자의 선택에 따라 상기 실행 화면의 크기 또는 실행 화면이 표시되는 템플릿 (templet)을 변경할 수도 있음은 물론이다. 예를 들어 제어부는 프리뷰 이미지가 표시되는 상태에서, 상기프리뷰 이미지가 표시되는 경계 부분에 대응하는 터치 입력을 감지할 수 있다. 그리고 감지된 터치 입력을 드래 그하는 터치 제스처가 감지되는 경우, 터치 제스처에 따라 프리뷰 이미지의 화면 비율을 변경할 수도 있다. 이 러한 경우 상기 터치 제스처에 따라 16:9 화면으로 표시되는 프리뷰 이미지가 4:3 비율의 화면으로 변경되어 표 시될 수 있으며, 또는 그 반대로 변경될 수도 있다. 한편 상술한 설명에서는 터치 입력을 드래그하는 터치 제스처를 언급하였으나, 상기 터치 제스처는 터치 대상체 가 이동 단말기에 접촉되지 않는 에어 제스처(air gesture) 방식으로 수행될 수도 있음은 물론이다. 즉, 제어부는 디스플레이부로부터 이격된 상태에서 일정 시간 이상 호버링(hovering)하는 터치 대상체를 감지할 수 있으며, 이를 상기 터치 입력에 대응하는 터치 제스처로 판단할 수 있다. 그리고 상기 호버링된 터치 대상체가 이동하는 경우 상기 터치 대상체의 이동에 따라 상기 터치 입력이 드래그되는 것으로 판단할 수 있다. 한편 상기 터치 대상체의 호버링 또는 호버링된 터치 대상체의 이동은 카메라와 같은 광 센서 또는 적어도 하나 의 근접 센서에 의해 감지될 수 있다. 전술한 본 발명은, 프로그램이 기록된 매체에 컴퓨터가 읽을 수 있는 코드로서 구현하는 것이 가능하다. 컴퓨터 가 읽을 수 있는 매체는, 컴퓨터 시스템에 의하여 읽혀질 수 있는 데이터가 저장되는 모든 종류의 기록장치를 포함한다. 컴퓨터가 읽을 수 있는 매체의 예로는, HDD(Hard Disk Drive), SSD(Solid State Disk), SDD(Silicon Disk Drive), ROM, RAM, CD-ROM, 자기 테이프, 플로피 디스크, 광 데이터 저장 장치 등이 있으며, 또한 캐리어 웨이브(예를 들어, 인터넷을 통한 전송)의 형태로 구현되는 것도 포함한다. 또한, 상기 컴퓨터는 단말기의 제어 부를 포함할 수도 있다. 따라서, 상기의 상세한 설명은 모든 면에서 제한적으로 해석되어서는 아니되고 예 시적인 것으로 고려되어야 한다. 본 발명의 범위는 첨부된 청구항의 합리적 해석에 의해 결정되어야 하고, 본 발명의 등가적 범위 내에서의 모든 변경은 본 발명의 범위에 포함된다.도면 도면1a 도면1b 도면1c 도면1d 도면1e 도면2a 도면2b 도면2c 도면2d 도면3a 도면3b 도면3c 도면4a 도면4b 도면4c 도면5 도면6 도면7a 도면7b 도면7c 도면7d 도면7e 도면8 도면9 도면10 도면11 도면12 도면13"}
{"patent_id": "10-2018-0028801", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1a는 본 발명과 관련된 이동 단말기를 설명하기 위한 블록도이다. 도 1b 및 1c는 본 발명과 관련된 이동 단말기의 일 예를 서로 다른 방향에서 바라본 개념도이다. 도 1d 및 도 1e는 본 발명과 관련된 이동 단말기에서 서브 영역들 및 노치 영역이 형성된 예를 설명하기 위한 개념도들이다. 도 2a 내지 도 2d는 본 발명과 관련된 이동 단말기에서, 노치 디자인에 따라 디스플레이부 상단에 형성된 서브 영역들과 메인 영역의 구동 상태를 설명하기 위한 개념도들이다. 도 3a 내지 도 3c는 본 발명과 관련된 이동 단말기에서, 서브 영역들 및 노치 영역을 보다 자세히 설명하기 위 한 개념도들이다. 도 4a 내지 도 4c는 본 발명과 관련된 이동 단말기에서, 노치 영역 및 서브 영역들에 따라 복수의 영역으로 구 분되는 디스플레이부 영역들을 설명하기 위한 개념도들이다. 도 5는 본 발명과 관련된 이동 단말기에서, 서브 영역들을 통해 인가되는 입력을 특정 기능의 입력으로 인식하 는 소프트웨어 구조를 설명하기 위한 개념도이다. 도 6은 본 발명과 관련된 이동 단말기에서, 서브 영역에 감지되는 터치 제스처에 근거하여 서로 다른 기능 및 그에 따른 화상 정보가 표시되는 동작 과정을 도시한 흐름도이다. 도 7a 내지 도 7e는 본 발명과 관련된 이동 단말기에서, 인가되는 터치 제스처를 설명하기 위한 개념도들이다. 도 8은 본 발명과 관련된 이동 단말기에서, 서브 영역들 각각으로부터 감지되는 터치 제스처에 따라 서로 다른기능을 수행하는 예를 설명하기 위한 예시도이다. 도 9는 본 발명과 관련된 이동 단말기에서, 서브 영역들에 인가되는 터치 제스처의 유형에 따라 서로 다른 기능 을 수행하는 예를 설명하기 위한 예시도이다. 도 10은 본 발명과 관련된 이동 단말기에서, 현재 실행 중인 기능과 관련된 정보들을 서브 영역들을 통해 표시 하는 예를 도시한 예시도이다. 도 11은 본 발명과 관련된 이동 단말기에서, 서브 영역을 이용하여 관련된 다른 기능을 수행하는 예를 도시한 예시도이다. 도 12는 본 발명과 관련된 이동 단말기에서, 서브 영역을 이용하여 관련된 다른 기능을 수행하는 다른 예를 도 시한 예시도이다. 도 13은 본 발명과 관련된 이동 단말기에서, 노치 영역에서 감지된 터치 제스처에 따른 터치 입력 시작점 및 종 료점에 근거하여, 서로 다른 기능이 수행되는 예를 도시한 예시도이다."}
