{"patent_id": "10-2020-0073624", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0156000", "출원번호": "10-2020-0073624", "발명의 명칭": "공기 개선 시스템", "출원인": "엘지이노텍 주식회사", "발명자": "한상헌"}}
{"patent_id": "10-2020-0073624", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "복수의 사이트에 설치되고, 공기 상태 정보를 획득하는 복수의 센서 모듈; 및상기 복수의 센서 모듈과의 통신을 통해 상기 복수의 센서 모듈로부터 수신되는 공기 상태 정보에 기초하여 특정 사이트 또는 상기 특정 사이트의 국부 영역의 공기를 개선하는 공기 개선 기기를 포함하는 공기 개선 시스템."}
{"patent_id": "10-2020-0073624", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 공기 개선 기기는,상기 복수의 센서 모듈로부터 수신된 공기 상태 정보에 기초하여 상기 복수의 사이트 중에서 청정이 필요한 상기 특정 사이트 또는 상기 특정 사이트의 상기 국부 영역을 결정하는공기 개선 시스템."}
{"patent_id": "10-2020-0073624", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 공기 개선 기기는,상기 특정 사이트로 이동이 가능한 이동부를 포함하고,상기 이동부는 ToF 또는 Lidar를 포함하는공기 개선 시스템."}
{"patent_id": "10-2020-0073624", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 공기 개선 기기는 에어 컨디셔너, 난방기, 제습기, 가습기 또는 공기 청정기인공기 개선 시스템."}
{"patent_id": "10-2020-0073624", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 에어 컨디셔너는,상기 특정 사이트의 상기 국부 영역을 향해 냉방 공기를 송출하는 공기 개선 시스템."}
{"patent_id": "10-2020-0073624", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 복수의 센서 모듈은,상기 복수의 사이트 각각의 적어도 하나 이상의 위치에 설치되는 공기 개선 시스템.공개특허 10-2021-0156000-3-청구항 7 제1항에 있어서,상기 복수의 센서 모듈은,상기 복수의 사이트 각각에 구비된 적어도 하나 이상의 전자 기기에 설치되는 공기 개선 시스템."}
{"patent_id": "10-2020-0073624", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 전자 기기는,컴퓨터, 가전 기기, 조명 기기 및 폐쇄회로 텔레비전(CCTV)를 포함하는 공기 개선 시스템."}
{"patent_id": "10-2020-0073624", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 복수의 센서 모듈 각각은,상기 온도 정보를 감지하는 온도 센서;상기 오염도 정보를 감지하는 오염도 센서; 및상기 공기 개선 기기와 통신하는 통신부를 포함하는 공기 개선 시스템."}
{"patent_id": "10-2020-0073624", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 공기 개선 기기와 통신하여 청정 관련 정보를 제공하는 모바일 기기를 더 포함하는 공기 개선 시스템."}
{"patent_id": "10-2020-0073624", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서,상기 공기 상태 정보는 온도 정보 또는 오염도 정보를 포함하는 공기 개선 시스템."}
{"patent_id": "10-2020-0073624", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "공기 개선 시스템은, 복수의 사이트에 설치되고, 온도 정보 및 오염도 정보를 포함하는 공기 상태 정보를 획득하 는 복수의 센서 모듈과, 복수의 센서 모듈과의 통신을 통해 복수의 센서 모듈로부터 수신되는 공기 상태 정보에 기초하여 특정 사이트 또는 특정 사이트의 국부 영역을 청정시키는 공기 개선 기기를 포함한다."}
{"patent_id": "10-2020-0073624", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "실시예는 공기 개선 시스템에 관한 것이다."}
{"patent_id": "10-2020-0073624", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "현대 사회가 발전할수록 환경 오염이 심각해지고 있어, 이에 대한 경각심이 커지고 있다. 이에 따라, 오염을 청 정화하여 제거하는 기기가 연구 및 개발되고 있다. 최근에 로봇 청소기가 제품화되어, 시장에 출시되었다. 로봇 청소기는 인공지능 기능이 탑재되고 이동이 가능하 여, 이리저리 이동하면서 청소를 수행한다. 로봇 청소기는 무작위로 복수의 사이트 중 특정 사이트로 이동하여 필요시 청구하고 또 다른 사이트로 이동하는 식으로 동작한다. 따라서, 로봇 청소기는 우선 순위에 따라 복수의 사이트를 선별적으로 청소하지 못하여, 신속하고 쾌적한 청정 환경을 유지할 수 없는 문제점이 있다."}
{"patent_id": "10-2020-0073624", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "실시예는 전술한 문제 및 다른 문제를 해결하는 것을 목적으로 한다. 실시예의 다른 목적은 신속하고 쾌적한 청정 환경을 유지할 수 있는 공기 개선 시스템을 제공한다. 실시예의 또 다른 목적은 최적의 청정 성능을 구현할 수 있는 공기 개선 시스템을 제공한다."}
{"patent_id": "10-2020-0073624", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 또는 다른 목적을 달성하기 위해 실시예의 일 측면에 따르면, 공기 개선 시스템은, 복수의 사이트에 설치 되고, 공기 상태 정보를 획득하는 복수의 센서 모듈; 및 상기 복수의 센서 모듈과의 통신을 통해 상기 복수의 센서 모듈로부터 수신되는 공기 상태 정보에 기초하여 특정 사이트 또는 상기 특정 사이트의 국부 영역의 공기 를 개선하는 공기 개선 기기를 포함한다."}
{"patent_id": "10-2020-0073624", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "실시예에 따른 공기 개선 시스템의 효과에 대해 설명하면 다음과 같다. 실시예들 중 적어도 하나에 의하면, 공기 개선 기기가 모든 사이트를 방문하지 않고도 복수의 사이트에 설치된 복수의 센서 각각으로부터 수신된 공기 상태 정보에 기초하여 우선적으로 공기를 개선할 사이트를 파악하여 해 당 사이트의 공기를 개선할 수 있어, 건물 내 모든 사이트에서 균일한 청정도를 유지할 수 있다는 장점이 있다. 실시예들 중 적어도 하나에 의하면, 하나의 사이트에서도 우선 순위에 따라 국부적으로 공기를 개선함으로써, 신속하고 쾌적한 청정 환경을 유지할 수 있다는 장점이 있다. 실시예들 중 적어도 하나에 의하면, 각 사이트마다 공기 개선 기기를 구비할 필요가 없어 보다 경제적인 청정 구현이 가능하다는 장점이 있다. 실시예의 적용 가능성의 추가적인 범위는 이하의 상세한 설명으로부터 명백해질 것이다. 그러나 실시예의 사상 및 범위 내에서 다양한 변경 및 수정은 당업자에게 명확하게 이해될 수 있으므로, 상세한 설명 및 바람직한 실 시예와 같은 특정 실시예는 단지 예시로 주어진 것으로 이해되어야 한다."}
{"patent_id": "10-2020-0073624", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명의 바람직한 실시예를 상세히 설명한다. 다만, 본 발명의 기술 사상은 설 명되는 일부 실시 예에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있고, 본 발명의 기술 사상 범위 내에서라면, 실시 예들간 그 구성 요소들 중 하나 이상을 선택적으로 결합, 치환하여 사용할 수 있다. 또 한, 본 발명의 실시예에서 사용되는 용어(기술 및 과학적 용어를 포함)는, 명백하게 특별히 정의되어 기술되지"}
{"patent_id": "10-2020-0073624", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "않는 한, 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 일반적으로 이해될 수 있는 의미로 해석될 수 있으며, 사전에 정의된 용어와 같이 일반적으로 사용되는 용어들은 관련 기술의 문맥상의 의미를 고려하여 그 의미를 해석할 수 있을 것이다. 또한, 본 발명의 실시예에서 사용된 용어는 실시예들을 설명하기 위한 것이 며 본 발명을 제한하고자 하는 것은 아니다. 본 명세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수 형도 포함할 수 있고, “B 및(와) C 중 적어도 하나(또는 한 개 이상)”로 기재되는 경우 A, B, C로 조합할 수있는 모든 조합 중 하나 이상을 포함할 수 있다. 또한, 본 발명의 실시 예의 구성 요소를 설명하는 데 있어서, 제1, 제2, A, B, (a), (b) 등의 용어를 사용할 수 있다. 이러한 용어는 그 구성 요소를 다른 구성 요소와 구별 하기 위한 것일 뿐, 그 용어에 의해 해당 구성 요소의 본질이나 차례 또는 순서 등으로 한정되지 않는다. 그리 고, 어떤 구성 요소가 다른 구성요소에 '연결', '결합' 또는 '접속'된다고 기재된 경우, 그 구성 요소는 그 다 른 구성요소에 직접적으로 연결, 결합 또는 접속되는 경우 뿐만아니라, 그 구성 요소와 그 다른 구성요소 사이 에 있는 또 다른 구성 요소로 인해 '연결', '결합' 또는 '접속＇되는 경우도 포함할 수 있다. 또한, 각 구성 요 소의 \" 상(위) 또는 하(아래)\"에 형성 또는 배치되는 것으로 기재되는 경우, 상(위) 또는 하(아래)는 두개의 구 성 요소들이 서로 직접 접촉되는 경우 뿐만아니라 하나 이상의 또 다른 구성 요소가 두 개의 구성 요소들 사이 에 형성 또는 배치되는 경우도 포함한다. 또한 “상(위) 또는 하(아래)”으로 표현되는 경우 하나의 구성 요소 를 기준으로 위쪽 방향뿐만 아니라 아래쪽 방향의 의미도 포함할 수 있다. 도 1은 실시예에 따른 공기 개선 시스템을 도시한다. 도 1을 참조하면, 실시예에 따른 공기 개선 시스템은 복수의 센서 모듈(121 내지 135) 및 공기 개선 기기 를 포함할 수 있다. 실시예에 따른 공기 개선 시스템은 주택, 사무실, 공장, 창고 등과 같이 다양한 건축물에 구비될 수 있다. 이하에서는 설명의 편의를 위해, 주택, 특히 아파트로 한정하여 설명한다. 예컨대, 복수의 센서 모듈(121 내지 135)은 복수의 사이트(도 2의 301 내지 313)에 설치될 수 있다. 예컨대, 사이트(301 내지 313)는 물리적 수단, 예컨대 벽으로 분리된 공간이나 장소일 수 있다. 예컨대, 아파트 인 경우, 사이트(301 내지 313)는 거실, 주방, 침실, 발코니, 대피 공간, 창고 등일 수 있다. 예컨대, 사이트(301 내지 313)는 물리적으로는 분리되지 않았지만 온도나 오염도에 따라 분리된 공간이나 장소 일 수 있다. 예컨대, 아파트인 경우, 거실과 주방이 물리적으로 분리되지 않았지만, 거실과 주방 각각 별도의 사이트(301 내지 313)로 정의될 수 있다. 예컨대, 복수의 센서 모듈(121 내지 135) 각각은 해당 사이트(301 내지 313)의 공기 상태 정보를 획득할 수 있 다. 공기 상태 정보는 예컨대, 온도 정보, 오염도 정보 등을 포함할 수 있지만, 이에 대해서는 한정하지 않는다. 예컨대, 공기 상태 정보는 습도 정보를 더 포함할 수 있다. 이를 위해, 습도 센서(미도시)가 구비될 수 있다. 공기 개선 기기는 복수의 센서 모듈(121 내지 135)과 통신이 가능하다. 공기 개선 기기는 복수의 센 서 각각으로부터 공기 상태 정보를 수신할 수 있다. 공기 개선 기기는 복수의 센서 각각으로부터 수신된 공기 상태 정보에 기초하여 복수의 사이트(301 내지 313) 중에서 청정화나 공기의 개선이 필요한 특정 사이트 또는 특정 사이트의 국부 영역을 결정할 수 있다. 국 부 영역은 특정 영역의 복수의 영역 중 적어도 하나 이상의 영역일 수 있다. 예컨대, 온도가 설정 온도 이상 또는 이하인 특정 사이트 또는 특정 사이트의 국부 영역이 청정화나 공기의 개 선이 필요한 특정 사이트 또는 특정 사이트의 국부 영역으로 결정될 수 있다. 예컨대, 오염도가 가장 높은 특정 사이트 또는 특정 사이트의 국부 영역이 청정화나 공기의 개선이 필요한 특정 사이트 또는 특정 사이트의 국부 영역으로 결정될 수 있다. 공기 개선 기기는 특정 사이트나 특정 사이트의 국부 영역으로 이동하고, 특정 사이트나 특정 사이트의 국 부 영역에 대한 청정화나 공기 개선을 수행할 수 있다. 예컨대, 청정화나 공기 개선을 수행함이라 함은 특정 사 이트나 특정 사이트의 국부 영역에 존재하는 오염 물질을 제거하는 것을 말할 수 있다. 공기 개선 기기는 도 3에 도시한 바와 같이, 특정 사이트로 이동이 가능한 이동부를 포함할 수 있다. 예컨대, 이동부는 복수의 비전 카메라(미도시) 및 복수의 바퀴를 포함할 수 있다. 예컨대, 이동부 는 인공 지능 엔진(미도시)를 더 포함할 수 있다. 공기 개선 기기에서 특정 사이트로 이동하는 명령 을 수신하면, 이동부는 비전 카메라에서 획득한 영상 정보에 기초하여 특정 사이트로 이동하기 위한 최적 의 경로 정보를 획득하고, 상기 획득된 최적의 경로 정보에 기초하여 복수의 바퀴를 제어하여 공기 개선 기기를 특정 사이트로 이동시킬 수 있다. 이동부는 ToF 및/또는 Lidar를 포함할 수 있다. 예컨대, 이동부는 SLAM(Simultaneous Localization and Mapping) 기술이 적용되거나 3D 인식을 위한 ToF 또는 Lidar 모듈이 장착될 수도 있다. SLAM 기술은 외부의 도움 없이 오로지 복수의 센서만으로 주변에 대한 지 도를 작성하여 자율 주행을 하도록 하는 기술일 수 있다. 공기 개선 기기의 충전을 위한 도킹 스테이션이 구비될 수 있다. 공기 개선 기기는 자신의 배터리의 충전량을 체크하여, 배터리 충전이 부족한 경우, 자율 주행 기능을 이용하여 도킹 스테이션으로 이동되어 배터 리의 충전이 수행될 수 있다. 도킹 스테이션은 전원 플러그를 통해 항상 상용 전원을 공급받을 수 있다. 예컨대, 청정화나 공기 개선을 수행함이라 함은 특정 사이트나 특정 사이트의 국부 영역을 냉방시키거나 난방시 키는 것을 말할 수 있다. 따라서, 공기 개선 기기는 청정 기능을 수행하는 제품일 수 있다. 예컨대, 공기 개선 기기는 에어 컨디셔너, 난방기, 제습기, 가습기 및/또는 공기 청정기를 포함할 수 있지만, 이에 대해 서는 한정하지 않는다. 공기 개선 기기은 에어 컨디셔너, 난방기, 제습기, 가습기 및 공기 청정기 중 적어 도 2가지 이상을 포함할 수 있다. 공기 개선 기기은 에어 컨디셔너, 난방기, 제습기, 가습기 및 공기 청정 기 중 적어도 2가지 이상을 포함하여 이 중에서 2가지 이상이 개별적으로 또는 동시에 사용될 수 있다. 예컨대, 공기 청전기는 청정이 필요한 특정 사이트로 이동하여 특정 사이트의 오염 물질을 제거할 수 있다. 예 컨대, 에어 컨디셔너는 청정이 필요한 특정 사이트로 이동하여 특정 사이트의 국부 영역을 향해 냉방 공기를 송 출할 수 있다. 예컨대, 난방기는 청정이 필요한 특정 사이트로 이동하여 특정 사이트의 국부 영역을 향해 난방 공기를 송출할 수 있다. 도 2에 도시된 아파트에는 예컨대, 복수의 사이트(301 내지 313)로 구분될 수 있다. 예컨대, 제1 사이트은 거실이고, 제2 사이트는 주방일 수 있다. 제3 내지 제6 사이트(303 내지 306) 각각은 침실일 수 있다. 제7 사이트 및 제13 사이트 각각은 욕실일 수 있다. 제8 내지 제11 사이트(308 내지 311) 각각은 발코니 이고, 제12 사이트는 현관일 수 있다. 일 예로, 제1 내지 제13 사이트(301 내지 313) 각각에 적어도 하나 이상의 센서 모듈(121 내지 135)이 설치될 수 있다. 센서 모듈(121 내지 135)은 공기 상태 정보를 보다 편리하고 정확하게 감지할 수 있는 위치에 설치될 수 있다. 센서 모듈(121 내지 135)은 제1 내지 제13 사이트(301 내지 313) 각각의 적어도 하나 이상의 위치에 설치될 수 있다. 예컨대, 센서 모듈(121 내지 135)은 제1 내지 제13 사이트(301 내지 313) 각각의 내벽이나 천 장 등에 설치될 수 있다. 다른 예로, 제1 내지 제13 사이트(301 내지 313) 각각에 구비된 적어도 하나 이상의 전자 기기에 센서 모듈(121 내지 135)이 설치될 수 있다. 예컨대, 센서 모듈(121 내지 135)은 전자 기기의 제조사에 의해 내장될 수 있다. 예컨대, 센서 모듈(121 내지 135)은 별도 구매품으로서, 전자 기기의 외측에 장착될 수 있다. 이를 위해, 전자 기기의 제조사에 의해 센서 모듈(121 내지 135)이 장착될 장착부(미도시)가 구비될 수 있다. 센서 모듈(121 내 지 135)은 접착 테이프를 이용하여 전자 기기에 부착되거나 스크류 등과 같은 체결 수단을 이용하여 전자 기기 에 체결될 수 있다. 도 2에 도시한 바와 같이, 제1 센서 모듈이 거실에 설치된 텔레비전에 내장되고, 제2 센서 모듈(12 2)이 거실에 설치된 에어 컨디셔너에 내장될 수 있다. 제3 센서 모듈이 주방에 설치된 조명에 내장되고, 제4 센서 모듈이 주방에 설치된 냉장고에 내장될 수 있다. 제5 센서 모듈이 침실 1에 설치된 컴퓨터에 내장되고, 제6 센서 모듈이 침실1에 설치된 조명에 내장될 수 있다. 제7 센서 모듈이 침실2에 설치된 컴퓨터에 내장될 수 있다. 제8 센서 모듈이 침실3에 설치 된 에어 컨디셔너에 내장되고, 제9 센서 모듈이 침실3에 설치된 조명에 내장될 수 있다. 제10 센서 모듈이 침실4에 설치된 조명에 내장될 수 있다. 제11 및 제12 센서 모듈(131, 132) 각각이 욕실(307, 313)에 설치된 조명에 내장될 수 있다. 제13 센서 모듈이 발코니에 설치된 세탁기에 내장될 수 있다. 예컨대, 전자 기기는 컴퓨터, 가전 기기, 조명 기기, 폐쇄회로 텔레비전(CCTV) 등을 포함할 수 있지만, 이에 대 해서는 한정하지 않는다. 컴퓨터는 예컨대, 데스크탑 컴퓨터, 노트북, 태블릿 등을 포함할 수 있다. 가전 기기 는 예컨대, 텔레비전, 냉장고, 세탁기, 전자 레인지, 건조기 등을 포함할 수 있다. 예컨대, 조명 기기는 각 사 이트(301 내지 313)의 천장이나 내벽에 설치된 조명, 침대 주변에 위치된 무드 램프, 펜던트 라이트 등을 포함 할 수 있다. 공기 개선 기기와 센서 모듈(121 내지 135)은 근거리 무선 통신을 이용하여 통신을 수행할 수 있다. 근거 리 무선 통신 방식으로 예컨대, 와이파이(Wi-Fi), 불루투스(Bluetooth), 지그비(ZigBe), 지 웨이브(Z wave),Wisun, EnOcean 등이 있지만, 이에 대해서는 한정하지 않는다. 센서 모듈(121 내지 135)은 도 4에 도시한 바와 같이, 온도 센서, 오염도 센서 및 통신부를 포 함할 수 있다. 온도 센서는 센서 모듈(121 내지 135)이 위치된 사이트(301 내지 313)의 온도를 감지하여 온도 정보를 획 득할 수 있다. 오염도 센서는 센서 모듈(121 내지 135)이 위치된 사이트(301 내지 313)의 오염도를 감지하여 오염도 정보 를 획득할 수 있다. 통신부는 공기 개선 기기와 통신을 수행할 수 있다. 예컨대, 온도 센서에서 획득된 온도 정보나 오염도 센서에서 감지된 오염도 정보를 공기 개선 기기로 송신할 수 있다. 한편, 실시예에 따른 공기 개선 시스템은 모바일 기기를 더 포함할 수 있다. 모바일 기기는 이 동이 가능한 기기로서, 사용자가 소지할 수 있다. 사용자는 아파트의 세대주이거나 세대주와 관련된 가족일 수 있다. 실시예의 모바일 기기는 세대주뿐만 아니라 가족의 구성원 각각의 모바일 기기를 포함할 수 있 다. 모바일 기기는 공기 개선 기기와 통신하여 공기 개선 기기의 상태를 체크하여, 그 상태 정보를 디스플레이부에 표시할 수 있다. 예컨대, 모바일 기기는 공기 개선 기기의 상태를 보고하도록 공기 개선 기기에게 명령할 수 있다. 공기 개선 기기는 공기 개선 기기의 상태를 체크하여, 상기 체 크된 상태 정보를 취합하여 모바일 기기로 송신할 수 있다. 모바일 기기는 공기 개선 기기로부 터 수신된 상태 정보를 디스플레이부(미도시) 상에 표시할 수 있다. 예컨대, 상태 정보는 세대주가 소지한 모바 일 기기에만 송신될 수 있다. 예컨대, 상태 정보는 가족의 구성원 중 적어도 하나 이상의 구성원에게 송신 될 수 있다. 세대주나 구성원은 자신이 소지한 모바일 기기를 통해 공기 개선 기기의 상태를 확인하고, 필요한 조 치를 취할 수 있다. 예컨대, 상태 정보가 공기 개선 기기의 필터 교체에 관한 알림인 경우, 세대주나 구성 원은 공기 개선 기기의 필터를 새 필터로 교체할 수 있다. 예컨대, 상태 정보가 공기 개선 기기의 배 터리의 충전량이 부족한 경우인 경우, 세대주나 구성원은 해당 공기 개선 기기의 배터리가 충전되도록 조 치를 취할 수 있다. 도 5는 실시예에 따른 공기 개선 시스템에서의 공기 개선 동작을 설명하는 순서도이다. 도 2 및 도 5를 참조하면, 공기 개선 기기는 복수의 사이트(301 내지 313)에 설치된 복수의 센서 모듈(121 내지 135)로부터 공기 상태 정보를 수신할 수 있다(S410). 도 2에 도시한 바와 같이, 복수의 사이트(301 내지 313) 각각에 적어도 하나 이상의 센서 모듈(121 내지 135)이 설치될 수 있다. 또는 복수의 사이트(301 내지 313) 각각에 구비된 적어도 하나 이상의 전자 기기에 센서 모듈 (121 내지 135)이 설치될 수 있다. 복수의 센서 모듈(121 내지 135) 각각은 실시간으로 또는 주기적으로 공기 상태 정보를 획득하여 공기 개선 기 기로 송신할 수 있다. 공기 상태 정보는 예컨대, 온도 정보 또는 오염도 정보를 포함할 수 있지만, 이에 대해서는 한정하지 않는다. 공기 개선 기기는 기본적으로 거실에 위치될 수 있지만, 이에 대해서는 한정하지 않는다. 공기 개선 기기는 공기 상태 정보에 기초하여 특정 사이트 청정화나 공기 개선이 필요한지를 결정할 수 있 다(S420). 공기 개선 기기는 공기 상태 정보에 기초하여 특정 사이의 국부 영역의 청정화나 공기 개선이 필요한지를 결정할 수 있다(S430). 공기 개선 기기는 특정 사이트나 특정 사이트의 국부 영역으로 이동할 수 있다 (S440). 공기 개선 기기는 특정 사이트나 특정 사이트의 국부 영역에서 청정화나 공기 개선을 수행할 수 있다(S450). 이하, 특정 사이트의 청청을 수행하는 방법을 설명한다. 예컨대, 공기 개선 기기가 공기 청정기인 경우, 공기 개선 기기는 복수의 센서 모듈(121 내지 135) 각각으로부터 수신된 오염도 정보에 기초하여 특정 사이트 청정이 필요한지를 결정할 수 있다. 예컨대, 오염도 가 가장 높은 사이트가 청정이 필요한 특정 사이트로 결정될 수 있다. 예컨대, 공기 개선 기기가 에어 컨디셔너나 난방기인 경우, 공기 개선 기기는 복수의 센서 모듈(121 내지 135) 각각으로부터 수신된 온도 정보에 기초하여 청정이 필요한 특정 사이트를 결정할 수 있다. 예컨대, 온도가 제1 설정 온도 이상인 사이트가 냉방이 필요한 특정 사이트로 결정될 수 있다. 예컨대, 제1 설 정 온도는 30도일 수 있지만, 이에 대해서는 한정하지 않는다. 예컨대, 온도가 제1 설정 온도 이상인 사이트가 적어도 2개 이상인 경우, 가장 높은 온도가 획득된 사이트를 기준으로 우선 순위가 결정될 수 있다. 예컨대, 제 1 사이트가 38도의 온도가 획득되고, 제2 사이트가 36도의 온도가 획득된 경우, 우선 순위로서 제1 사이트와 제 2 사이트의 순서로 결정될 수 있다. 이러한 경우, 공기 개선 기기는 제1 사이트로 이동하여 제1 사이트를 우선적으로 냉방한 후, 제2 사이트로 이동하여 제2 사이트를 냉방시킬 수 있다. 예컨대, 온도가 제2 설정 온도 이하인 사이트가 난방이 필요한 특정 사이트로 결정될 수 있다. 예컨대, 제2 설 정 온도는 15도일 수 있지만, 이에 대해서는 한정하지 않는다. 예컨대, 온도가 제2 설정 온도 이하인 사이트가 적어도 2개 이상인 경우, 가장 낮은 온도가 획득된 사이트를 기준으로 우선 순위가 결정될 수 있다. 예컨대, 제 1 사이트가 11도의 온도가 획득되고, 제2 사이트가 14의 온도가 획득된 경우, 우선 순위로서 제1 사이트와 제2 사이트의 순서로 결정될 수 있다. 이러한 경우, 공기 개선 기기는 제1 사이트로 이동하여 제1 사이트를 우 선적으로 난방한 후, 제2 사이트로 이동하여 제2 사이트를 난방시킬 수 있다. 이하, 특정 사이트의 국부 영역의 청청을 수행하는 방법을 설명한다. 예컨대, 하나의 사이트의 사이즈가 큰 경우, 하나의 사이트의 적어도 2개 이상의 국부 영역에 센서 모듈(121, 122)이 설치되어, 보다 정밀하게 공기 상태가 파악될 수 있다. 예컨대, 100평의 아파트의 경우 거실 의 사이즈 또한 대형이므로, 공기 개선 기기로 거실의 모든 영역에서 공기 개선하기가 어렵다. 이러한 경우, 거실의 적어도 2개 이상의 국부 영역에 센서 모듈(121, 122)이 설치되어, 각 센서 모듈(121, 122)에 의해 각 국부 영역의 공기 상태 정보가 획득될 수 있다. 공기 개선 기기는 각 센서 모듈 각각(121, 122)으로로부터 수신된 공기 상태 정보에 기초하여 하나의 사이트의 적어도 2개 이상의 국부 영역 중에서 청정화나 공기 개선이 필요한 특정 국부 영이 결정될 수 있다. 예컨대, 공기 개선 기기가 에어 컨디셔너인 경우, 에어 컨디셔너는 거실의 2개 이상의 국부 영역 각각에 설치된 센서 모듈(121, 122)로부터 수신된 공기 상태 정보에 기초하여 거실의 특정 국부 영역을 냉방이 필요한 국부 영역으로 결정하고, 특정 국부 영역으로 이동하여 해당 국부 영역을 향해 냉방 공기를 송출하여, 해당 국 부 영역을 냉방시킬 수 있다. 또한, 에어 컨디셔너는 특정 국부 영역 다음에 높은 온도가 획득된 국부 영역으로 이동하여 해당 국부 영역을 냉방시킬 수도 있다. 따라서, 실시예는 공기 개선 기기가 모든 사이트(301 내지 313)를 방문하지 않고도 복수의 센서 각각으로 부터 수신된 공기 상태 정보에 기초하여 우선적으로 청정화나 공기 개선할 사이트를 파악하여, 해당 사이트를 청정화하거나 공기 개선할 수 있어, 건물 내 모든 사이트(301 내지 313)에서 균일한 청정도를 유지할 수 있다. 상기의 상세한 설명은 모든 면에서 제한적으로 해석되어서는 아니되고 예시적인 것으로 고려되어야 한다. 실시 예의 범위는 첨부된 청구항의 합리적 해석에 의해 결정되어야 하고, 실시예의 등가적 범위 내에서의 모든 변경 은 실시예의 범위에 포함된다."}
{"patent_id": "10-2020-0073624", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 실시예에 따른 공기 개선 시스템을 도시한다. 도 2는 실시예에 따른 공기 개선 시스템을 구비한 아파트를 예시한 도면이다. 도 3은 실시예에 따른 공기 개선 기기를 예시한 도면이다. 도 4는 실시예에 따른 센서 모듈을 도시한 블록도이다. 도 5는 실시예에 따른 공기 개선 시스템에서의 공기 개선 동작을 설명하는 순서도이다."}
