{"patent_id": "10-2021-7008497", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0046738", "출원번호": "10-2021-7008497", "발명의 명칭": "조임 발생 예측 시스템", "출원인": "도시바 미쓰비시덴키 산교시스템 가부시키가이샤", "발명자": "세키모토 마사야스"}}
{"patent_id": "10-2021-7008497", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "판상의 금속 재료를 고온으로 가열하고 복수의 압연 패스로 압연하는 열간 압연에 있어서, 압연재가 사행 혹은폭 방향으로 절곡됨으로써 상기 압연재의 선단 또는 미단에 발생하는 현상인 조임의 발생을 예측하는 시스템으로서,상기 시스템은, 1 또는 복수의 컴퓨터를 구비하고,상기 1 또는 복수의 컴퓨터는,조임의 발생을 예측하기 위한 적응 모델의 구축에 사용하는 적응 모델 구축용 데이터를 채취하고 보존하는 처리와,상기 적응 모델 구축용 데이터를 사용하여 상기 적응 모델을 구축하는 처리와,구축이 완료된 상기 적응 모델인 적응 완료 모델을 보존하는 처리와,조임의 발생의 예측에 사용하는 예측용 데이터를 채취하는 처리와,상기 예측용 데이터를 상기 적응 완료 모델에 입력함으로써 조임의 발생을 예측하는 처리를 실행하고,상기 적응 모델 구축용 데이터를 채취하고 보존하는 처리에서는, 상기 적응 모델 구축용 데이터로서, 조임 발생예측의 대상이 되는 대상 압연 패스에 있어서의 조임의 발생 유무 및 발생 지점을 나타내는 제 1 데이터와, 상기 제 1 데이터에 연결된 압연재가 상기 대상 압연 패스보다 압연 순서로 선행하는 선행 압연 패스에서 압연되었을 때의 동 선행 압연 패스에 관한 정보와 동 압연재에 관한 속성을 포함하는 제 2 데이터를 복수 세트 채취하고,상기 예측용 데이터를 채취하는 처리에서는, 상기 예측용 데이터로서, 예측 대상의 압연재가 상기 대상 압연 패스보다 압연 순서로 선행하는 선행 압연 패스에서 압연되었을 때의 동 선행 압연 패스에 관한 정보와 동 압연재에 관한 속성을 포함하는 데이터를 채취하고,상기 조임의 발생을 예측하는 처리에서는, 상기 예측 대상의 압연재가 상기 대상 압연 패스에 도달하는 것보다전에, 상기 대상 압연 패스에 있어서의 조임의 발생 유무 및 발생 지점의 전부 또는 일부를 예측하는 것을 특징으로 하는 조임 발생 예측 시스템."}
{"patent_id": "10-2021-7008497", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 시스템은, 표시 장치를 구비하고,상기 1 또는 복수의 컴퓨터는,조임의 발생의 예측 결과를 상기 표시 장치에 표시하는 처리를 실행하는 것을 특징으로 하는 조임 발생 예측 시스템."}
{"patent_id": "10-2021-7008497", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항 또는 제 2 항에 있어서,상기 1 또는 복수의 컴퓨터는,상기 대상 압연 패스에 있어서 조임이 발생한다고 예측된 경우, 상기 대상 압연 패스의 입측 사이드 가이드를조작하는 처리를 실행하는 것을 특징으로 하는 조임 발생 예측 시스템."}
{"patent_id": "10-2021-7008497", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "공개특허 10-2021-0046738-3-제 3 항에 있어서,상기 1 또는 복수의 컴퓨터는,상기 입측 사이드 가이드를 조작하는 처리에서는, 상기 예측 대상의 압연재의 선단과 미단의 어느 쪽의 단부에서 조임이 발생하는지 특정하고, 조임이 발생하는 쪽의 단부의 통과에 맞추어 상기 입측 사이드 가이드를 여는것을 특징으로 하는 조임 발생 예측 시스템."}
{"patent_id": "10-2021-7008497", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 3 항 또는 제 4 항에 있어서,상기 1 또는 복수의 컴퓨터는,상기 입측 사이드 가이드를 조작하는 처리에서는, 상기 대상 압연 패스의 운전실측과 전동기측의 어느 쪽의 측에서 조임이 발생하는지 특정하고, 조임이 발생하는 측의 입측 사이드 가이드를 여는 것을 특징으로 하는 조임발생 예측 시스템."}
{"patent_id": "10-2021-7008497", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 3 항 내지 제 5 항 중 어느 한 항에 있어서,상기 1 또는 복수의 컴퓨터는,상기 입측 사이드 가이드를 조작하는 처리에서는, 상기 대상 압연 패스의 운전실측과 전동기측의 어느 쪽의 측에서 조임이 발생하는지 특정할 수 없는 경우, 상기 운전실측과 상기 전동기측의 양측의 상기 입측 사이드 가이드를 여는 것을 특징으로 하는 조임 발생 예측 시스템."}
{"patent_id": "10-2021-7008497", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항 내지 제 6 항 중 어느 한 항에 있어서,상기 1 또는 복수의 컴퓨터는,상기 적응 모델을 구축하는 처리에서는, 인공 지능의 범주에 들어가는 기계 학습 또는 통계적 수법에 의해 상기적응 모델을 구축하고, 상기 적응 모델 구축용 데이터가 새롭게 일정 수 얻어질 때마다 상기 적응 모델을 갱신하는 것을 특징으로 하는 조임 발생 예측 시스템."}
{"patent_id": "10-2021-7008497", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1 항 내지 제 7 항 중 어느 한 항에 있어서,상기 1 또는 복수의 컴퓨터는,상기 적응 모델 구축용 데이터를 채취하고 보존하는 처리에서는, 상기 대상 압연 패스를 통과한 압연재의 화상데이터의 해석에 의해 상기 대상 압연 패스에 있어서의 조임의 발생 유무 및 발생 지점을 판정하는 것을 특징으로 하는 조임 발생 예측 시스템."}
{"patent_id": "10-2021-7008497", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1 항 내지 제 7 항 중 어느 한 항에 있어서,상기 1 또는 복수의 컴퓨터는,상기 적응 모델 구축용 데이터를 채취하고 보존하는 처리에서는, 상기 대상 압연 패스의 입측 사이드 가이드에가해지는 하중에 기초하여 상기 대상 압연 패스에 있어서의 조임의 발생 유무 및 발생 지점을 판정하는 것을 특징으로 하는 조임 발생 예측 시스템."}
{"patent_id": "10-2021-7008497", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 1 항 내지 제 7 항 중 어느 한 항에 있어서,상기 1 또는 복수의 컴퓨터는,공개특허 10-2021-0046738-4-상기 적응 모델 구축용 데이터를 채취하고 보존하는 처리에서는, 오퍼레이터가 HMI 를 통하여 입력한 상기 대상압연 패스에 있어서의 조임의 발생 유무 및 발생 지점을 접수하는 것을 특징으로 하는 조임 발생 예측 시스템."}
{"patent_id": "10-2021-7008497", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "조임 발생 예측 시스템은, 대상 압연 패스에 있어서의 조임의 발생 유무 및 발생 지점을 나타내는 제 1 데이터와, 압연재가 대상 압연 패스보다 압연 순서로 선행하는 선행 압연 패스에서 압연되었을 때의 선행 압연 패스에 관한 정보와 동 압연재에 관한 속성을 포함하는 제 2 데이터를 적응 모델 구축용 데이터로서 채취하고 보 (뒷면에 계속)"}
{"patent_id": "10-2021-7008497", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은, 판상의 금속 재료를 고온으로 가열하고 복수의 압연 패스로 압연하는 열간 압연에 있어서, 압연재에 조임이 발생하는 것을 사전에 예측하는 시스템에 관한 것이다."}
{"patent_id": "10-2021-7008497", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "압연기는, 철강 재료나, 알루미늄·구리 등의 비철 재료의 덩어리를 압연하여 얇게 함으로써, 그것들을 자동차 나 전기 제품으로 가공하기 쉽게 한다. 압연기에는, 판재를 압연하는 열간 박판 압연기, 후판 압연기, 냉간 압연기, 봉선재 (棒線材) 를 압연하는 압연기 등, 다양한 타입의 것이 있다. 그 중에서, 조임이 발생하기 쉬운 것은, 압연재를 1 개씩 배치적으로 고속으로 압연하는, 열간 박판 압연기이다. 도 12 는, 종래의 열간 박판 압연 프로세스에 있어서의 압연기의 구성의 일례를 나타내는 도면이다. 도 12 에 나타내는 압연기 는, 가열로 , 조압연기 , 바 히터 , 마무리 압연기 , 런 아웃 테이블 , 권취기 등의 각종 장치로 이루어진다. 가열로 에서 가열된 압연재 는, 조압연기 에 의해 압연된다. 조압연기 에서 압연된 압연재 는, 바 히터 를 거쳐, 마무리 압연 기 로 반송된다. 마무리 압연기 에서 압연된 압연재 는, 런 아웃 테이블 에서 냉각된 후, 권취기 에 의해 코일상으로 권취된다. 압연재 를 얇게 압연하여 만들어진 코일상의 박판이 최종적인 제품이다. 도 12 에 나타내는 조압연기 는, 상하 워크 롤을 각각 1 개씩 갖는 압연 스탠드 (R1) 와, 상하 워크 롤과 그것보다 직경이 큰 상하 백업 롤의 합계 4 개의 롤을 갖는 압연 스탠드 (R2) 를 갖는다. 도 12 에 나타내 는 마무리 압연기 는, 직렬로 나열된 7 대의 압연 스탠드 (F1 ∼ F7) 를 갖는다. 마무리 압연기 의 각 압연 스탠드 (F1 ∼ F7) 는, 도 12 에 나타내는 예에서는 상하 4 개의 롤로 구성되어 있지만, 워크 롤과 백업 롤 사이에 들어가는 중간 롤을 포함하는 상하 6 개의 롤로 구성되는 경우도 있다. 또한, 상하의 압연 롤을 구동하기 위한 대용량 전동기, 롤과 전동기를 연결하는 샤프트 등, 미세한 사양은 상이하지만, 장치의 구 성은 비슷한 경우가 많다. 조압연기 와 마무리 압연기 의 각 압연 스탠드의 입측에는, 도시하고 있지 않은 사이드 가이드가 설 치된다. 조압연기 에서는, 재료의 압연 전에 압연재를 멈추고, 사이드 가이드의 개도를 좁혀 압연재를 끼우고, 센터링하고 나서 압연하는 경우가 많다. 마무리 압연기 에서는, 고속으로 압연재가 압연 스탠 드에 진입하는 경우가 많기 때문에, 미리 압연재의 폭에 여유를 더한 폭으로 사이드 가이드의 개도를 설정해 두 는 경우가 많다. 압연재의 조임은, 압연재가 압연 스탠드 바로 아래에서 사행, 요컨대, 롤 폭 방향으로 이동하거나, 혹은 폭 방 향으로 절곡되거나 함으로써 압연재의 선단 또는 미단에 발생하는 현상이다. 조임에는, 압연재의 선단에 발 생하는 선단 조임과, 압연재의 미단에 발생하는 미단 조임이 있다. 선단 조임은, 압연재의 사행이나 압연재 의 선단의 구부러짐에 의해, 압연재가 압연 스탠드에 진입하기 전에 그 선단이 입측 사이드 가이드에 부딪치고, 선단을 절곡하면서 압연 스탠드에 진입함으로써 발생한다. 미단 조임은, 압연재의 미단이 압연 스탠드를 빠 져 나가기 전에 사행함으로써 미단이 입측 사이드 가이드에 충돌하거나, 미단이 2 장으로 접혀 안으로 들어가면 서 압연됨으로써, 그 접혀 안으로 들어간 부분에 하중이 집중하고, 그 부분이 잡아떼어지거나 함으로써 발생한 다. 조임이 발생하면 롤 표면에 흠집이 생기는 경우가 있다. 그 흠집이 다음의 압연재의 표면에 전사되는 것을 방지하기 위해, 일단 조업을 멈추고, 롤을 빼내어 점검하는 경우가 있다. 또, 찢어진 재료의 조각이 압연기 내에 남는 경우가 있다. 그 조각이 다음으로 압연하는 재료의 통판성을 저해하는 경우가 있기 때문에, 이 경우에도 점검이 필요하게 된다. 이들 작업은 생산성을 저하시키고, 나아가서는 롤 원단위를 저하시킨다. 또한, 조압연기 에서는 순방향, 역방향의 압연을 반복하는 이른바 리버스 압연이 5, 6 패스 실시되고, 마 무리 압연기 에서는 6, 7 대의 압연 스탠드 (F1 ∼ F7) 에서 일직선으로 압연된다. 압연 스탠드하를 압연재가 1 번 통과하는 것을 1 패스라고 부른다. 조압연기 에서는 1 대의 압연 스탠드에서 복수 패스의 압연이 실시되고, 마무리 압연기 에서는 1 대의 압연 스탠드에서 1 패스만의 압연이 실시된다. 이 하에서는, 조임의 발생 빈도가 특히 높은 마무리 압연기 에 있어서의 미단 조임에 관하여 설명한다. 여기서, 1 패스의 압연과 1 스탠드에서의 압연은 동일한 의미로 한다. 종래의 열간 박판 압연 프로세스에서는, 조임에 대해 일반적으로 이하와 같은 대책이 실시되고 있다. 대책 A : 조임이 발생하기 쉬운 압연재에 대해, 오퍼레이터가 사전에 대처한다. 대책 B : 조임이 발생하는 것에 반응하여, 오퍼레이터가 즉석에서 대응한다. 대책 C : 미단의 사행을 억제하는 자동 사행 제어를 적용한다. 조임이 발생하기 쉬운 압연재에는, 제품 두께가 얇은 것, 판크라운이 작은 것, 특정한 강종 등이 있다. 특 히 판두께가 얇고 압연 속도가 빨라지는 마무리 압연기의 후단에서, 조임이 발생하기 쉽다. 대책 A 에 의하 면, 그러한 압연재 및 상황에 대해, 오퍼레이터는 상류측의 압연재의 사행의 모습을 보면서 처치를 하게 된다. 그러나, 오퍼레이터는, 압하, 속도 등 여러 가지의 상황에 대응하지 않으면 안되고, 또 오퍼레이터마다 숙련 정도가 상이하므로, 반드시 적확하게 대응할 수 있다고는 할 수 없다. 대책 B 에서는, 오퍼레이터는 사행이 시작되면 그것을 교정하고자 한다. 그러나, 사행은 급격하게 진행되는 현상이기 때문에, 오퍼레이터가 적확 하게 대응할 수 있다고는 할 수 없다. 대책 C 는 사행을 억제하는 데에 유효하기는 하지만, 사행이 시작된 후에 제어하는 것으로, 사전에 사행의 발생 을 예측하는 것은 아니다. 또, 예를 들어 특허문헌 1 이나 특허문헌 2 에 개시되어 있는 바와 같이, 사행 제어는 이전부터 다루어지고 있다. 특허문헌 1, 2 에 개시되어 있는 종래 기술은, 그 구체적인 방법은 상이 하지만, 압연재의 사행량을 계산하고, 그것을 사용하여 제어함으로써 사행량을 억제하고, 조임을 방지하고자 하 는 것이다. 그러나, 사행 제어의 대상은 불안정한 시스템이며, 제어가 어렵고, 유효한 제어 수단이 없는 것 도 사실이다. 선행기술문헌 특허문헌 (특허문헌 0001) 일본 공개특허공보 2018-43255호 (특허문헌 0002) 일본 공개특허공보 평4-118108호"}
{"patent_id": "10-2021-7008497", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "오퍼레이터의 눈앞에서 압연하고 있는 압연재에 있어서, 조임이 발생하는지의 여부, 또, 조임이 어디에서 발생 하는지는, 오퍼레이터의 경험과 감에 의지하는 비율이 크고, 정확하게 그것들을 예측할 수는 없다. 조임의 원인인 판의 사행을 물리 모델로 구축하는 시도도 행해져 왔지만, 현실적으로는 충분한 정밀도를 갖는 모델의 구축은 아직 곤란하다. 또, 모델을 사용한 사행 제어도 충분한 성능을 얻고 있다고는 말하기 어렵다. 본 발명은 이와 같은 과제를 감안하여 이루어진 것으로, 조임 발생의 유무와 발생 지점을 예측할 수 있는 조임 발생 예측 시스템을 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2021-7008497", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 관련된 조임 발생 예측 시스템은, 판상의 금속 재료를 고온으로 가열하고 복수의 압연 패스로 압연하 는 열간 압연에 있어서, 압연재가 사행 혹은 폭 방향으로 절곡됨으로써 압연재의 선단 또는 미단에 발생하는 현 상인 조임의 발생을 예측하는 시스템으로서, 1 또는 복수의 컴퓨터를 구비한다. 1 또는 복수의 컴퓨터는, 조임의 발생을 예측하기 위한 적응 모델의 구축에 사용하는 적응 모델 구축용 데이터를 채취하고 보존하는 처리 와, 적응 모델 구축용 데이터를 사용하여 적응 모델을 구축하는 처리와, 구축이 완료된 적응 모델인 적응 완료 모델을 보존하는 처리와, 조임의 발생의 예측에 사용하는 예측용 데이터를 채취하는 처리와, 예측용 데이터를 적응 완료 모델에 입력함으로써 조임의 발생을 예측하는 처리를 실행하도록 프로그램되어 있다.상세하게는, 조임 발생 예측 시스템이 구비하는 1 또는 복수의 컴퓨터는, 적응 모델 구축용 데이터를 채취하고 보존하는 처리에서는, 적응 모델 구축용 데이터로서, 조임 발생 예측의 대상이 되는 대상 압연 패스에 있어서의 조임의 발생 유무 및 발생 지점을 나타내는 제 1 데이터와, 제 1 데이터에 연결된 압연재가 대상 압연 패스보다 압연 순서로 선행하는 선행 압연 패스에서 압연되었을 때의 동 선행 압연 패스에 관한 정보와 동 압연재에 관한 속성을 포함하는 제 2 데이터를 복수 세트 채취한다. 예측용 데이터를 채취하는 처리에서는, 예측용 데이터 로서, 예측 대상의 압연재가 상기 대상 압연 패스보다 압연 순서로 선행하는 선행 압연 패스에서 압연되었을 때 의 동 선행 압연 패스에 관한 정보와 동 압연재에 관한 속성을 포함하는 데이터를 채취한다. 조임의 발생을 예측하는 처리에서는, 예측 대상의 압연재가 대상 압연 패스에 도달하는 것보다 전에, 대상 압연 패스에 있어서 의 조임의 발생 유무 및 발생 지점의 전부 또는 일부를 예측한다. 조임 발생 예측 시스템이 구비하는 1 또는 복수의 컴퓨터는, 조임의 발생의 예측 결과를 표시 장치에 표시하는 처리를 실행하도록 프로그램되어도 된다. 조임 발생 예측 시스템이 구비하는 1 또는 복수의 컴퓨터는, 대상 압연 패스에 있어서 조임이 발생한다고 예측 된 경우, 대상 압연 패스의 입측 사이드 가이드를 조작하는 처리를 실행하도록 프로그램되어도 된다. 입측 사이드 가이드를 조작하는 처리에서는, 예측 대상의 압연재의 선단과 미단의 어느 쪽의 단부 (端部) 에서 조임 이 발생하는지 특정하고, 조임이 발생하는 쪽의 단부의 통과에 맞추어 입측 사이드 가이드를 열어도 된다. 또, 대상 압연 패스의 운전실측과 전동기측의 어느 쪽의 측에서 조임이 발생하는지 특정하고, 조임이 발생하는 측의 입측 사이드 가이드를 열어도 된다. 대상 압연 패스의 운전실측과 전동기측의 어느 쪽의 측에서 조임 이 발생하는지 특정할 수 없는 경우, 운전실측과 전동기측의 양측의 입측 사이드 가이드를 열어도 된다. 적응 모델을 구축하는 처리에서는, 인공 지능의 범주에 들어가는 기계 학습 또는 통계적 수법에 의해 적응 모델 을 구축하고, 적응 모델 구축용 데이터가 새롭게 일정 수 얻어질 때마다 적응 모델을 갱신해도 된다. 적응 모델 구축용 데이터를 채취하고 보존하는 처리에서는, 대상 압연 패스를 통과한 압연재의 화상 데이터의 해석에 의해 대상 압연 패스에 있어서의 조임의 발생 유무 및 발생 지점을 판정해도 된다. 또는, 대상 압연 패스의 입측 사이드 가이드에 가해지는 하중에 기초하여 상기 대상 압연 패스에 있어서의 조임의 발생 유무 및 발생 지점을 판정해도 된다. 또한, 오퍼레이터가 HMI 를 통하여 입력한 대상 압연 패스에 있어서의 조임의 발생 유무 및 발생 지점을 접수해도 된다."}
{"patent_id": "10-2021-7008497", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 관련된 조임 발생 예측 시스템에 의하면, 압연재의 조임 발생 예측의 유무의 정보를 포함하는 데이터 가 채취되고, 기계 학습이나 통계적 수법에 의해 적응 모델이 구성되고, 예측 대상의 압연 패스보다 상류측의 데이터를 적응 완료 모델에 입력함으로써, 다음으로 압연되는 재료에 있어서의 조임의 발생 유무 및 발생 지점 이 사전에 예측된다. 이로써, 압연재가 대상 압연 패스를 통과하기 전에 조임의 원인인 판의 사행을 방지하 거나, 작게 하거나 하는 등의 준비를 할 시간 여유를 가질 수 있으므로, 조임 발생의 저감과 그에 따른 안정 조 업의 실현, 나아가서는 롤 원단위의 향상으로 연결할 수 있다. 또 실기 데이터에 기초하여 예측을 실시하기 때문에, 실기의 상황의 변화에 추종할 수 있는 이점도 있다."}
{"patent_id": "10-2021-7008497", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "도면을 참조하여, 본 발명의 실시형태를 설명한다. 단, 이하에 나타내는 실시형태는, 본 발명의 기술적 사 상을 구체화하기 위한 장치나 방법을 예시하는 것으로서, 특별히 명시하는 경우를 제외하고, 구성 부품의 구조 나 배치, 처리의 순서 등을 하기의 것으로 한정할 의도는 없다. 본 발명은 이하에 나타내는 실시형태로 한 정되는 것은 아니고, 본 발명의 취지를 일탈하지 않는 범위에서 여러 가지 변형하여 실시할 수 있다. ＜제 1 실시형태＞ 1. 조임 발생 예측 시스템의 구성 도 1 은, 본 발명의 제 1 실시형태의 조임 발생 예측 시스템의 구성을 나타내는 블록도이다. 본 실시형태의 조임 발생 예측 시스템은 도 12 에 나타내는 구성을 갖는 열간 박판 압연 프로세스에 적용되고 있다. 조임 발생 예측 시스템은, 예측에 관련된 데이터의 채취 및 보존과 그 데이터를 사용한 연산을 실시하는 예측 장치 를 구비한다. 예측 장치 는, 단일의 컴퓨터로 구성되어도 되고, 네트워크에 접속된 복수의 컴퓨 터로 구성되어도 된다. 예측 장치 는, 적응 모델 구축 데이터 채취 보존부 , 적응 모델 구축부 , 예측용 데이터 채취부 , 예측부 , 및 결과 표시부 를 구비한다. 이들 요소 중, 적응 모델 구축 데이터 채취 보존부 , 적응 모델 구축부 , 예측용 데이터 채취부 , 및 예측부 는, 컴퓨터의 메모리로부터 판독된 프로 그램이 프로세서에서 실행됨으로써, 프로세서에 의해 소프트웨어적으로 실현된다. 메모리에는, 조임 발생 예측에 사용하는 각종 프로그램이나 각종 데이터가 기억되어 있다. 또한, 여기서 말하는 메모리에는, 주기 억 장치와 보조 기억 장치의 양방이 포함된다. 결과 표시부 는 컴퓨터에 결합된 표시 장치이다. 적응 모델 구축 데이터 채취 보존부 는, 후술하는 적응 모델을 구축하기 위한 적응 모델 구축용 데이터를 채취하여 보존한다. 적응 모델 구축용 데이터에는, 제 1 데이터와 제 2 데이터가 포함된다. 제 1 데이 터는, 조임의 발생을 예측하는 대상이 되는 압연 스탠드 (압연 패스) 에 있어서의 조임의 발생 유무 및 발생 지 점을 나타내는 데이터이다. 조임의 발생 지점은, 압연재의 흐름 방향 (길이 방향) 에 있어서 선단과 미단으 로 분류되고, 압연재의 폭 방향에 있어서 운전실측 (Work Side : 이하, WS 라고 표기한다) 과 전동기측 (Drive Side : 이하, DS 라고 표기한다) 으로 분류된다. 제 1 데이터에는, 대상 압연 스탠드에서 압연된 압연재의 식별 번호 (ID) 와, 판두께나 판폭 등의 제품 정보가 관련지어지고, 제 1 데이터와 함께 보존된다. 제 2 데이터는, 압연재가 대상 압연 스탠드보다 압연 순서로 선행하는 선행 압연 스탠드에서 압연되었을 때의 그 선행 압연 스탠드에 관한 정보와, 동 압연재에 관한 속성을 포함하는 프로세스 데이터이다. 선행 압연 스탠드에 관한 정보에는, 예를 들어 롤 갭, 롤 시프트량, 압연 하중, 게이지 미터 두께 등의 데이터 항목에 대 한 정보가 포함되고, 그것들은 센서에 의해 취득할 수 있다. 전부 n 스탠드의 압연 스탠드를 갖는 마무리 압연기에서는, 조임의 발생을 예측하는 대상 압연 패스 요컨대 대상 압연 스탠드는, 예를 들어 제 m 스탠드로부 터 최종 제 n 스탠드 (m ≤ n) 까지의 스탠드로 할 수 있다. 단, 예측 단계에 있어서 어느 압연 스탠드가 대상 압연 스탠드로 지정될지 불명확하기 때문에, 마무리 압연기의 전체 스탠드의 데이터를 채취하여 보존한다. 또, 압연재에 관한 속성이란, 선행 압연 스탠드에서 압연된 압연재의 속성이며, 그 압연재의 식별 번호, 강 종, 목표 판두께, 목표 판폭, 목표 판크라운, 목표 평탄도, 목표 온도 등을 말한다. 제 1 데이터와 제 2 데 이터는, 압연재의 식별 번호를 통하여 연결되어 있다. 적응 모델 구축 데이터 채취 보존부 는, 도시되지 않은 HMI (Human-Machine Interface) 에 결합되어 있다. 적응 모델 구축용 데이터의 제 1 데이터에는, 조임 발생의 유무 및 발생 지점이 포함되어 있다. 이것들 은 오퍼레이터가 HMI 를 통하여 입력할 수 있다. 조임의 발생 지점은, 일반적으로는 선단 또는 미단에 있어 서의 WS 또는 DS 이다. 그러나, WS 인지 DS 인지를 목측 (目測) 으로 판단하는 것은 오퍼레이터에게 있어서반드시 용이하지 않다. 이 때문에, 목측의 애매함을 흡수하기 위해서, WS 와 DS 에 더하여, 판폭 중앙 부근 (Center of width : 이하, CW 라고 표기한다) 이라는 발생 지점을 형성해도 된다. 또한, 발생 지점을 미세 하게 분류하여 특정하기 위해서는, 적응 모델에 입력하는 데이터가 매우 많이 필요하게 되고, 이 때 적응 모델 의 구축에 많은 시간이 걸린다. 이 때문에, 예를 들어 선단과 미단의 분류만을 실시하는 등, 발생 지점을 대략적으로 나누는 것을 허용하는 것으로 한다. 도 2 는, 오퍼레이터가 조임 발생의 유무 및 발생 지점을 입력하기 위한 HMI 의 일례를 나타내는 도면이다. 도면에 나타내는 WS 및 DS 는 버튼이고, 7 개의 압연 스탠드 (F1-F7) 의 각각에 대해, 또 선단측 (Head) 과 미 단측 (Tail) 의 각각에 대해 형성되어 있다. 예를 들어, 제 3 압연 스탠드 (F3) 에서 미단에 있어서의 WS 에서 조임이 발생한 것을 육안으로 본 경우, 오퍼레이터는, F3 열 Tail 행의 WS 버튼을 압하한다. 또, 도 2 에 나타내는 HMI 에 있어서, 목측의 애매함을 흡수하기 위한 CW 버튼을 추가해도 된다. 혹은, CW 버튼을 추 가하는 대신에, 조임은 있었지만 WS 와 DS 의 어느 쪽인지 불명확한 경우에는 WS 버튼과 DS 버튼의 양방을 누름 으로써, CW 버튼을 누르는 것과 동일한 판단이 실시되도록 해도 된다. 적응 모델 구축용의 제 1 데이터를 채취하는 방법으로는, 조임 발생의 유무와 발생 지점을 오퍼레이터가 입력하 는 것 이외에, 화상 데이터에 의해 판정하는 방법을 사용할 수 있다. 일반적으로 압연기에는 텔레비전 카메 라가 많이 설치되어 있다. 마무리 압연기의 압연 스탠드 사이에 설치된 텔레비전 카메라에 의해 압연 스탠 드를 통과한 압연재를 촬상하고, 얻어진 화상 데이터를 해석함으로써, 압연재의 선단 또는 미단에 조임이 발생 하고 있는지, 용이하게 판정할 수 있다. 조임이 발생하고 있으면 압연재가 잡아떼지고, 재료 내부의 고온의 부분이 줄무늬상으로 보인다. 압연재의 표면 온도는 내부보다 낮고 거무스름해져 있으므로, 찢어진 부분은 내부의 고온 부분이 오렌지색으로 확실히 보인다. 또, 화상 데이터에 의하면, 사이드 가이드에 충돌한 지점 이 WS 또는 DS 인지의 판정도 용이하다. 적응 모델 구축용의 제 1 데이터를 채취하는 그 밖의 방법으로서, 압연 스탠드의 사이드 가이드에 가해지는 하 중에 의해 판정하는 방법을 사용할 수도 있다. 사이드 가이드는 위치 제어 또는 힘 제어를 실시하는 것이 가능하고, 센서에 의해 사이드 가이드에 가해지는 힘을 검지할 수 있다. 조임은 압연재의 사행에 의해 발생 하는 경우가 많고, 사이드 가이드에 인가된 힘이 어느 임계값 이상이면 조임이 발생했다고 판정할 수 있다. 또, 사이드 가이드에 가해지는 힘은 좌우에서 독립적으로 검지할 수 있으므로, 조임이 WS 와 DS 중 어느 곳에 서 발생했는지도 판정할 수 있다. 다시 도 1 로 돌아와, 조임 발생 예측 시스템의 구성에 대한 설명을 계속한다. 적응 모델 구축 데이터 채취 보존부 에서 일정 수의 데이터가 채취되면, 적응 모델 구축 데이터 채취 보존부 는 채취하여 보존해 둔 데이터를 적응 모델 구축부 에 입력한다. 적응 모델 구축부 는, 입력된 데이터를 사용하여 적응 모 델 (2a) 을 구축한다. 적응 모델이란, 데이터가 입력되면 내부의 구성 요소 사이의 관계도가 변화되고 출력 이 변화되는 것을 말한다. 조임 발생의 예측에 적합한 적응 모델의 예로는, 기계 학습의 범주에 들어가는 뉴럴 네트워크 (Neural Network : 이하, NN 이라고 표기한다) 나 자기 조직화 맵 (Self Organizing Map : 이하, SOM 이라고 표기한다) 등, 또 통계적 수법을 사용하는 적응 관리도 (Adaptive Control Charts : 이하, ACC 라고 표기한다) 등을 들 수 있다. 기계 학습으로 분류되는 수법의 학습 방법에는, 교사 있는 학습과 교사 없는 학습의 2 종류가 있다. 일 반적으로 NN 은 교사 있는 학습, SOM 은 교사 없는 학습을 실시한다. 이것들은, 조임의 유무와 같은 2 개의 값으로 분류하는 문제에도 적용할 수 있다. NN, SOM, ACC 라는 방법은, 널리 일반적으로 알려져 있는 방법 이다. 그들 수법의 개요에 대해서는 추후 설명한다. 도 3 은, 적응 모델 구축부 에서 실시되는 처리를 개념적으로 나타내는 도면이다. 적응 모델 구축부 는, 적응 모델 구축용의 제 2 데이터 를 적응 모델 (도 1 에 나타내는 적응 모델 (2a)) 에 입 력한다. 이로써, 내부의 구성 요소 사이의 관계도가 변화되어 적응 모델 의 구축이 진행된다. 또, 적응 모델 구축부 는, 적응 모델 구축용의 제 1 데이터 를 교사 데이터 또는 검증용 데이터로서 적응 모델 에 입력한다. 제 1 데이터 가 교사 데이터로서 사용되는 경우, 제 2 데이터로부터 얻어진 적응 모델 의 출력과 제 1 데이터 의 차이는 백 프로퍼게이션으로서 적응 모델 에 돌 아간다. 다시 도 1 로 돌아와, 조임 발생 예측 시스템의 구성에 대한 설명을 계속한다. 적응 모델 구축부 는, 적응 모델 (2a) 의 구축이 완료되면, 구축이 완료된 적응 모델 (2a) 을 적응 완료 모델 (4a) 로서 적응 모델 (2a) 과는 따로 보존한다. 보존된 적응 완료 모델 (4a) 은 예측부 에 있어서 조임의 발생의 예측에 이용된다. 적응 완료 모델 (4a) 을 적응 모델 (2a) 과는 따로 보존하는 것은, 조임의 발생을 예측하고 있는 동안에 적응 완료 모델의 내부 상태가 변화되어서는 안되기 때문이다. 적응 완료 모델 (4a) 을 이용한 조임의 발생의 예측에는, 예측용 데이터 채취부 에서 채취된 예측용 데이터 가 사용된다. 예측용 데이터 채취부 는, 예측용 데이터로서, 적응 모델 구축용의 제 2 데이터와 동일한 종류의 데이터를 채취한다. 요컨대, 예측용 데이터 채취부 는, 예측 대상의 압연 스탠드를 제 m 스탠드 로부터 최종 제 n 스탠드로 순서대로 변경하면서, 예측 대상의 압연재가 예측 대상의 압연 스탠드보다 압연 순 서로 선행하는 선행 압연 스탠드에서 압연되었을 때의 그 선행 압연 스탠드에 관한 정보와, 예측 대상의 압연재 에 관한 속성을 포함하는 데이터를 채취한다. 예측용 데이터 채취부 는, 채취한 예측용 데이터를 적응 완료 모델 (4a) 에 입력한다. 도 4 는, 예측부 에서 실시되는 처리를 개념적으로 나타내는 도면이다. 예측부 는, 예측용 데이터 를 적응 완료 모델 (도 1 에 나타내는 적응 완료 모델 (4a)) 에 입력하고, 조임의 유무의 예측 결 과를 적응 완료 모델 (4a) 의 출력 으로서 얻는다. 또, 조임이 있는 경우에는, 그 발생 지점의 예측 결과도 적응 완료 모델 (4a) 의 출력 으로서 얻는다. 예측 결과로서 얻어지는 조임의 발생 지점은, 반드시 전부의 발생 지점이 아니어도 되고, 일부의 발생 지점이어도 된다. 또한, 적응 완료 모델 을 사용한 예측은, 예측 대상의 압연재가 대상 압연 스탠드에 도달하는 것보다 전에 예측 결과가 얻어지도록 실시 된다. 다시 도 1 로 돌아와, 조임 발생 예측 시스템의 구성에 대한 설명을 계속한다. 예측부 는, 적응 완료 모델 에서 얻어진 예측 결과를 결과 표시부 에 출력한다. 결과 표시부 는, 예측 결과를 오퍼 레이터에게 알기 쉽게 표시한다. 오퍼레이터는, 결과 표시부 에 표시되어 있는 예측 결과를 참조함으로 써, 조임의 발생을 억제하기 위한 개입 조작을 예측 대상의 압연 스탠드에 대해 실시할 수 있다. 2. 조임 발생 예측의 처리 플로 도 5 는, 본 실시형태의 조임 발생 예측 시스템에 의한 처리 플로를 상세하게 나타내는 플로 차트이다. 도 5 에 있어서, 좌우로 늘어선 2 개의 플로 차트 중 좌측의 플로 차트는 적응 모델의 구축 단계의 처리 플로를 나 타내고, 우측의 플로 차트는 예측 단계의 처리 플로를 나타낸다. 먼저, 좌측의 플로 차트를 따라 적응 모델의 구축 단계의 처리 플로에 대해 설명한다. 적응 모델의 구축 단 계에서는, 최초로 스텝 이 실행된다. 스텝 에서는, 적응 모델 구축용의 제 1 데이터 및 제 2 데이터가 채취되어 보존된다. 여기서, 제 2 데이터의 채취 방법에 대해 상세하게 설명한다. 예를 들어, 마무리 압연기의 제 6 스탠드 (F6) 에서의 조임 발생을 예측하기 위해서 데이터를 모은다고 하면, 스탠드 (F6) 보다 상류측의 스탠드 (F1, F2, F3) 의 각각에 대해, 미단 근처의 데이터가 채취된다. 채취되는 데이터의 데이터 항목은, 롤 갭, 롤 시 프트량, 압연 하중, 게이지 미터 두께 등이다. 단, 롤 갭에 대해서는 WS, DS, 및 중앙부의 데이터가 채취되 고, 압연 하중에 대해서는 WS 및 DS 의 데이터가 채취된다. 미단 근처의 데이터를 채취한다는 것은, 예측 처리를 실시하고, 오퍼레이터에게 알리기까지 충분한 시간을 취할 수 있는 시간, 예를 들어 압연재의 최미단으로부터 선단을 향하여 30 초 거슬러 올라가, 그곳으로부터 상류를 향하여 10 초간의 데이터를 채취하는 것을 의미한다. 바꿔 말하면, 미단에 가까운 40 초간의 데이터 중, 최 초의 10 초간의 데이터가 채취된다. 이 경우, 채취한 10 초간의 데이터를 사용하여 적응 모델이 구축된다. 30 초라는 시간은, 예측 처리와 오퍼레이터에 대한 통지·오퍼레이터의 조임 회피의 준비를 위한 시간의 합 과 거의 동등한 시간의 예시이다. 이와 같은 시간을 확보해 둠으로써, 예측 대상의 압연재가 예측 대상의 압연 스탠드에 도달하는 것보다 전에, 예측 대상의 압연 스탠드에 있어서의 조임의 발생 유무 및 발생 지점의 전부 또는 일부를 예측하고, 오퍼레이터에게 통지하고, 오퍼레이터에게 조임 회피의 준비를 재촉할 수 있다. 또한, 후술하는 기계 학습의 방법이나 통계적 수법에 따라서는, 채취한 제 2 데이터의 모든 항목이나, 채취한 모든 시간의 데이터를 사용하지 않는 경우에, 보다 양호한 정밀도가 얻어지는 경우가 있다. 이 때문에, 본 실시형태의 조임 발생 예측 시스템은, 제 2 데이터로서 채취한 데이터 중에서, 필요한 데이터를 적절히 선택적 으로 사용할 수 있는 구조로 구성되어 있다. 스텝 에서는, 제 1 소정수 이상의 데이터가 저장되었는지, 또는 제 2 소정수 이상의 데이터가 추가되었는 지를 판정한다. 여기서, 제 1 소정수는, 기계 학습이나 통계적 수법을 적용하는 데에 충분한 데이터의 절대 수이다. 기계 학습의 경우, 그 방법에 따라서도 상이한데, 일반적으로는 3,000 내지 10,000 개 이상의 데이터가 필요하다. 제 2 소정수는, 압연이 진행됨에 따라 데이터가 증가해 가므로, 새롭게 추가된 데이터에 의 해, 적응 모델을 갱신해 가기 위한 판단에 필요하다. 이것은 임의로 선택할 수 있고, 수를 적게 설정하면 빈번히 갱신되지만 계산 부하도 증가한다. 많이 설정하면 갱신 빈도는 적어지지만, 압연의 새로운 상황에 추종할 수 없게 될 우려가 있다. 스텝 의 조건이 만족될 때까지, 스텝 에서 적응 모델 구축용의 제 1 데이터 및 제 2 데이터의 채취 와 보존이 계속된다. 그리고, 스텝 의 조건이 만족되면, 플로는 스텝 으로 진행된다. 스텝 은, 적응 모델의 구축을 위한 주처리이다. NN, SOM, ACC 와 같은 방법으로 실현된 적응 모델은, 그 내부 상태가 입력 데이터에 의해 갱신되고, 보다 정확한 예측을 할 수 있게 된다. 스텝 에서는, 구축이 완료된 적응 모델이 적응 완료 모델로서 보존된다. 낡은 데이터를 사용하여 구 축된 기존의 적응 완료 모델이 존재하는 경우에는, 이번에 구축된 적응 모델에 의해 기존의 적응 완료 모델은 갱신되고, 갱신된 적응 완료 모델이 보존된다. 다음으로, 우측의 플로 차트를 따라 예측 단계의 처리 플로에 대해 설명한다. 예측 단계에서는, 최초로 스 텝 이 실행된다. 스텝 에서는, 조임 예측 대상 스탠드의 스탠드 번호 (k) 가 세트된다. 조 임은 마무리 압연기의 후단의 스탠드에서 일어나기 쉽기 때문에, 스탠드 번호 (k) 는, 4, 5, 6, 7 만으로 해도 된다. 스텝 에서는, 실행될 때마다 스탠드 번호 (k) 는 1 개씩 갱신되어 재세트된다. 스텝 에서는, 스텝 에서 설명한 적응 모델 구축용의 제 2 데이터와 동일한 채취 방법으로 예측용 데이터가 채취된다. 예측 데이터를 취득하는 선행 압연 스탠드는, 예측 처리에 걸리는 시간과, 표시 장치의 표시를 통하여 오퍼레이터에게 통지하는 데에 걸리는 시간과, 오퍼레이터가 조임 회피 조작의 준비를 실시하는 시간을 고려하여 결정할 필요가 있다. 이하의 표는, 예측 대상의 압연 스탠드 (표에는, 예측 대상 스탠드라 고 기재하고 있다) 와, 예측 데이터를 채취하는 선행 압연 스탠드 (표에는, 예측 데이터 채취 스탠드라고 기재 하고 있다) 의 대응 관계의 일례를 나타내고 있다. 표 1"}
{"patent_id": "10-2021-7008497", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "스텝 에서는, 스텝 에서 보존되어 있던 적응 완료 모델이 판독되고, 적응 완료 모델에 예측 데이터 가 입력된다. 적응 완료 모델로부터는, 각 예측 대상 스탠드에 대해, 조임 발생의 유무의 예측 결과와, 조 임이 발생하는 경우에는 그 발생 지점의 예측 결과가 출력된다. 스텝 에서는, 모든 예측 대상 스탠드에서 예측이 실시되었는지가 확인된다. 모든 예측 대상 스탠드에 서의 예측이 완료될 때까지, 스텝 에서 스텝 까지의 처리가 반복된다. 그리고, 모든 예측 대상 스탠드에서의 예측이 완료되면, 스텝 으로 진행되고, 예측 결과의 오퍼레이터에 대한 통지가 실시된다. 이 때, 운전실 내에 있는 오퍼레이터는 유리 너머 건너편에 있는 실제의 압연 상태를 보고 있거나, 운전실 내에 설치된 텔레비전 모니터를 보고 있거나의 어느 것인 경우가 많다. 이 때문에, 예측 결과의 통지도 그 2 개 지점의 보기 쉬운 곳에 표시하는 것이 바람직하다. 또한, 여기서는 모든 대상 스탠드를 예측한 후에 예측 결과의 오퍼레이터에 대한 통지가 실시되고 있지만, 조임이 발생한다고 예측될 때마다 오퍼레이터에 대한 통지가 실시되어도 된다. 요컨대, 제 m 스탠드로부터 예측을 시작했을 때, 제 m 스탠드에서 조임이 발생한 다고 예측되면, 즉 그 취지를 통지하고, 다음으로 제 m＋1 스탠드에 대해 예측을 실시하도록 해도 된다. 3. 조임 발생의 예측에 적합한 적응 모델 3-1. NN NN 은 가장 단순한 구성에서는, 입력층, 중간층, 출력층이라는 3 층 구조이고, 중간층을 늘려 갈 수도 있다. 중간층이 다수의 층으로 구성되는 경우에는, 심층 학습을 할 수도 있다. 각 층은 1 개 또는 복수의 뉴런 으로 구성되고, 각 층의 뉴런이 중량을 갖는 선으로 결합되어 있다. 1 개의 뉴런은 입력값의 레벨에 의해출력 상태가 바뀐다. 교사 있는 학습의 경우에는, NN 의 출력과 교사 신호를 비교하고, 역방향으로 결합선 의 중량을 갱신해 가는, 백 프로퍼게이션이라는 방법이 일반적으로 사용된다. 3-2. SOM SOM 은 교사 데이터가 불필요하고, 정상 데이터, 요컨대, 조임이 발생하지 않았을 때에 채취된 데이터만이 사용 된다. SOM 의 구분을 5 × 5, 10 × 10, 25 × 25 등으로 정의하면, 각 구분이 1 개의 뉴런이 된다. 각 뉴런에는 사용하는 변수의 수만큼의 평면이 준비된다. 도 6 은, SOM 의 구성예와 그것을 사용한 예측 방 법의 개요를 설명하는 도면이다. 도 6 에 나타내는 SOM 의 구성예에서는, SOM 은 10 × 10 의 뉴런으로 구 성되어 있다. 각 뉴런에는, 변수 개수분의 평면이 준비된다. 여기서는, 제 2 데이터가 갖는 롤 갭이나 압연 하중 등의 데 이터 항목의 수를 20 개로 한다. 각 뉴런에는 변수 20 개분의 평면, 상세하게는 변수의 값의 축과 시간의 축을 갖는 평면이 준비된다. 20 개의 변수의 각각은, 도 5 에 나타내는 처리 플로의 스텝 에서 설명 한 바와 같이, 압연재의 미단 근처에 상당하는 10 초간분의 데이터를 갖고 있다. 적응 모델의 구축 단계, 즉, 학습 단계에서는, 각 뉴런 내의 초기 평면에 있어서의 10 초간분의 곡선이 랜덤하 게 부여된다. 물론, 각 뉴런에서 중복시키지 않는 등의 제약은 부여된다. 또, 10 초간, 20 변수의 정상 데이터가 1 세트로서 보존된다. 데이터는 1 세트씩 꺼내지고, 그 1 세트의 데이터 전체로서 어느 뉴런의 곡 선에 가장 가까운지가 판정된다. 그리고, 가장 가깝다고 판정된 뉴런에 속하는 것이 된다. 모든 정상 데이터의 세트에 대해 동일한 처리가 실시되고, 마지막에 각 뉴런 내의 각 변수로 무게 중심이 되는 곡선이 결 정된다. 이것으로 적응 모델의 구축, 즉, 학습이 완료된다. 예측 단계, 즉, 정상 이상 (異常) 의 판정 단계에서는, 판정 대상 데이터인 예측용 데이터의 각 변수값과 100 개의 뉴런 내의 각 변수값의 무게 중심값이 비교된다. 그리고, 판정 대상 데이터가 전체로서 어느 뉴런에 가까운지가 계산되고, 가장 가깝다고 판정된 뉴런이 선택된다. 다음으로, 선택된 뉴런 내의 각 변수의 무게 중심의 곡선과, 판정 대상 데이터의 각 변수값의 거리가 계산되고, 그 거리가 그 밖의 것과는 크게 벗어나는 변 수가 있으면 (상기 예에서는, 도 6 에 있어서의 변수 1), 그것을 포함하는 데이터는 이상이라고 간주된다. 즉, 조임이 발생하고 있다고 판정된다. 이하의 표는, SOM 에 의해 정상 데이터를 사용하여 적응 모델을 구축하고, 적응 완료 모델을 사용하여 이상 데 이터의 검출을 실시한 경우의 학습 효과의 검증예가 나타나 있다. 이 검증예에서는, 동일 강종의 전체 7650 개의 데이터 중에 136 개의 미단 조임을 갖는 이상 데이터가 포함되어 있었지만, 그것들 이상 데이터를 100 ％ 검출할 수 있었다. 이 적응 완료 모델을 사용하면, 100 ％ 에 가까운 정밀도로 조임의 발생 유무를 예측할 수 있다. 표 2"}
{"patent_id": "10-2021-7008497", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "3-3. ACC ACC 는 기본적으로는 주지된 관리도 (Control Charts) 를 응용한 수법이다. 관리도는 상방 관리 한계 (Upper Control Limit : 이하, UCL 이라고 표기한다) 와, 하방 관리 한계 (Lower Control Limit : 이하, LCL 이라고 표기한다) 를 고정시키는데, ACC 는 데이터의 추이에 맞추어 그것들을 변경한다. 어느 시계열 데이 터가 있고, 그 기간이 10 초간 추이를 나타낸다고 하면, 예를 들어 0.1 초마다 조준을 비키어 놓고, 그곳으로부 터 1 초간을 1 구간으로 하여, 각각의 구간에 있어서의 표준 편차로부터 각각의 구간에 있어서의 UCL 및 LCL 을 결정해 간다. 이 때 데이터에 변형도가 있으면, 그에 따른 UCL 및 LCL 의 보정도 실시한다. 그 보정의 방법에 대해서는, 「Betul Kan, and Berna Yazici \"The Individuals Control Chart in Case of Non- Normality\", Journal of Modern Applied Statistical Methods, Vol.5, Issues 2, Article 28, Digital Commons @WayneState 」에 기재되어 있다.이하, 도 7 내지 도 9 를 사용하여 ACC 의 동작 개요에 대해, 미단 조임의 검지를 예로 들어 보다 구체적으로 설명한다. 적응 모델의 구축 단계에서는, SOM 과 동일하게, 선택한 변수 20 개의 미단 근처의 10 초간의 정 상 데이터가 적응 모델 구축용의 데이터로서 사용된다. 미단 근처의 10 초간이란, 미단에 가까운 30 초간을 제외하고, 그곳으로부터 선단에 가까운 10 초간을 의미한다. 바꿔 말하면, 미단에 가까운 40 초간 중 최초 의 10 초간을 의미한다. 도 7 에 나타내는 표와 같이 데이터가 얻어지고 있었다고 한다. 표의 열은 코일 번호이고, 행은 데이터 번 호이다. 코일의 개수는 P 개이다. 1 개의 코일의 데이터 중, J 는 10 초간의 데이터의 선두의 번호, J ＋I 는 10 초간의 데이터의 최후의 번호이다. 따라서, 10 초간의 데이터는 I 개의 데이터를 포함한다. 데이터는 0.1 초마다 기록되고 있다고 하고, 그 경우는 I = 10 ÷ 0.1 = 100 개가 된다. 표에 있어서 코일 번호 p 의 행에 복수의 프레임이 그려져 있지만, 각 프레임은 표준 편차를 계산하는 윈도우를 나타내고 있다. 표준 편차를 계산하는 윈도우를 1 초간의 구간으로 하여, 0.1 초마다 윈도우를 비키어 놓으 면서 데이터의 표준 편차가 계산된다. 이와 같은 계산이 P 개의 정상 코일의 20 개의 변수 모두에 대해 실 시된다. 그렇게 하면, 0-1 초간, 0.1-1.1 초간 등의 각 시간대에 있어서의 표준 편차가 P 개 생기고, 표준 편차의 분포가 생긴다. 예를 들어, 시간대 1 에 있어서의 표준 편차는, S[1,1], S[2,1], … S[P,1] 로서 얻 어진다. 동일 시간대 i 에 있어서의 표준 편차 S[1 ∼ P, i] 의 표준 편차 σ[i] 를 계산함으로써, UCL 을 σ[i] 의 ＋ 측의 예를 들어 3 배 혹은 4 배로 취하고, LCL 을 σ[i] 의 － 측의 예를 들어 3 배 혹은 4 배로 취할 수 있다. 이로써, 도 8 에 나타내는 바와 같은 UCL 및 LCL 이 얻어진다. 단, 도 8 은 변수 1 개분 의 UCL 및 LCL 이고, 각 변수에 대해 UCL 및 LCL 이 계산된다. ACC 에서는, 이와 같이 UCL 및 LCL 을 결정 하는 것이 적응 모델의 구축에 해당한다. 예측 단계에서는, 도 9 에 나타내는 바와 같이, 판정 대상의 데이터와 적응 모델의 구축 단계에서 결정된 UCL 및 LCL 이 비교된다. 그리고, UCL 또는 LCL 을 초과하는 데이터의 점수나, UCL 또는 LCL 로부터의 거리의 합을 평가값으로 하여, 판정 대상의 데이터가 UCL 이나 LCL 로부터 얼마나 떨어져 있는지가 평가되고, 정상인지 이상인지가 판정된다. NN 에서는, 조임 발생이 있는 이상 데이터와 조임 발생이 없는 정상 데이터의 양방을 입력하여 NN 에 의한 모델 의 구축이 실시된다. 이에 대하여, SOM 및 ACC 에서는, 조임 발생이 없는 정상 데이터만을 입력하여 모델이 구축되고, 그 모델로부터 크게 벗어나는 경우에 조임의 발생이 있다고 판단된다. 일반적으로, 조임이 발생 하는 압연재의 수는, 조임이 발생하지 않는 압연재의 수보다 훨씬 적다. 또 설비의 가동에 있어서도, 이상 인 상태의 시간보다 정상적으로 가동하고 있는 시간 쪽이 훨씬 길다. 그 때문에, 이상을 나타내는 데이터는 정상을 나타내는 데이터보다 매우 적은 것이 보통이다. 이와 같은 상황에서는, SOM 이나 ACC 에 의해 정상 상태의 데이터로 모델을 구축하고, 정상 상태 이외를 이상이라고 판정하는 구조 쪽이 유리한 경우가 많다. 3-4. 각 적응 모델의 특징 적응 모델이란, 데이터가 입력되면 내부의 구성 요소 사이의 관계도가 변화되고 출력이 변화되는 것이라고 정의 된다. 그 예가, NN, SOM 및 ACC 의 각 수법에 의해 구축되는 적응 모델이다. 보다 상세하게는, 조임 발 생의 예측에 적합한 적합 모델에는, 이하의 정의 A, 정의 B, 및 정의 C 로 정의되는 적합 모델이 포함된다. (A) 데이터가 입력되면 내부의 구성 요소 사이의 관계도가 변화되고 출력이 변화되는 것으로서, 복수의 입력 및 출력의 세트에 의해 학습한 후, 대상 입력을 평가하여 평가값을 출력하는 것 (B) 데이터가 입력되면 내부의 구성 요소 사이의 관계도가 변화되고 출력이 변화되는 것으로서, 복수의 입력의 세트에 의해 학습한 후, 대상 입력을 평가하여 평가값을 출력하는 것 (C) 데이터가 입력되면 내부의 구성 요소 사이의 관계도가 변화되고 출력이 변화되는 것으로서, 복수의 입력의 세트에 의해 통계적 지표를 결정한 후, 입력의 세트를 평가하여 평가값을 출력하는 것 NN 은 정의 A 로 정의되는 적응 모델의 일례이다. SOM 은 정의 B 로 정의되는 적응 모델의 일례이다. ACC 는 정의 C 로 정의되는 적응 모델의 일례이다. 이하의 표에는, NN, SOM 및 ACC 의 각각에 대해, 적응 모델의 정의와의 관계가 나타나 있다.표 3"}
{"patent_id": "10-2021-7008497", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "4. 조임 발생 예측의 처리 플로의 변형예 도 10 은, 본 실시형태의 조임 발생 예측 시스템에 의한 처리 플로의 변형예를 나타내는 플로 차트이다. 도 5 에 나타내는 처리 플로와 도 10 에 나타내는 처리 플로의 차이는, 적응 모델의 구축 단계의 처리 플로에 있다. 상세하게는, 도 5 에 나타내는 처리 플로에 있어서의 스텝 의 처리가, 도 10 에 나타내는 처리 플로에서는 스텝 (104a) 의 처리로 치환되고 있다. 스텝 (104a) 은, 적응 모델 구축 단계에서 적응 모델이 갱신되는데, 갱신된 결과에 의한 예상 정밀도가 확보되어 있는지 확인하기 위한 스텝이다. 새롭게 구축된 적응 모델의 정밀도가 충분하면, 적응 완료 모델이 갱신되어 보존되지만, 그렇지 않으면 보존되지 않는다. 구축한 적응 모델을 검증하기 위한 방법은, 상기 서술한 3 개의 수법에서 약간 상이하다. NN 에 있어서는, 학습용 데이터와 검증용 데이터가 나뉘어진다. 예를 들어 10,000 개의 데이터가 있었다고 하고, 이 중에서 검증용 데이터로서 무작위로 500 개 또는 1,000 개의 데이터가 선택되고, 나머지는 학습용 데이터가 된다. 학습용 데이터로 학습된 NN 에 의한 모델에 검증용 데이터가 입력되고, 조임의 발생 유무가 양호한 정밀도로 예 측되고 있는지가 검증된다. SOM 또는 ACC 에서는, 조임 발생이 없는 정상 데이터로 모델을 구축하기 때문에, 검증을 위해서는 이상 데이터만이 사용된다. SOM 또는 ACC 에 의해 구축된 모델에 이상 데이터가 입력되고, 조임 발생 있음으로 판정할 수 있으면, 고정밀도의 모델이라고 판단할 수 있다. ＜제 2 실시형태＞ 다음으로, 본 발명의 제 2 실시형태의 조임 발생 예측 시스템에 대해 설명한다. 본 실시형태에서는, 조임의 발생 유무를 예측한 후, 그 예측 결과를 오퍼레이터에게 통지할 뿐만 아니라, 입측 사이드 가이드의 제어에도 이용한다. 본 실시형태의 조임 발생 예측 시스템은, 예측 장치에 의해 예측 대상의 압연 스탠드에 있어서 조임이 발생한다고 예측된 경우, 예측 대상의 압연 스탠드의 입측 사이드 가이드를 조작하는 제어 장치를 구비 하고 있다. 제어 장치로서 기능하는 컴퓨터는, 예측 장치로서 기능하는 컴퓨터와는 다른 컴퓨터여도 된다. 또, 하나의 컴퓨터를, 소프트 페어에 의해 예측 장치로서 기능시킴과 함께, 제어 장치로서 기능시켜도 된다. 도 11 은, 조임 예측 결과를 이용한 입측 사이드 가이드 (31, 32) 의 제어의 예를 나타내는 도면이다. 여기 서는, 제 k 스탠드에서 미단 조임이 발생하고, 그 장소는 DS 라고 예측된 경우의 제어예에 대해 설명한다. 도 11 의 상단에 나타내는 상태에서는, 압연재 는 제 k-1 스탠드에서 압연되고 있다. 이 때는 아직 사행은 발생하고 있지 않다. 그리고 시간이 경과하여 하단에 나타내는 상태가 되고, 제 k-1 스탠드를 미단 이 빠져 나간 후에 압연재 가 사행한다고 상정한다. 미단 조임이 발생한다고 예측되는 하나의 예는 압연재 가 이와 같은 상태일 때이다. 이 때, 도시되지 않은 제어 장치는, 미단이 입측 사이드 가이드 에 닿아 찢어지는 것을 방지하기 위해, 미단의 통과에 맞추어 DS 의 입측 사이드 가이드 를 여는 조작을 실시한다. 또한, WS 와 DS 의 어느 쪽의 측에서 조임이 발생하는지 특정할 수 없을 때에는, 도시되지 않은 제어 장치는, 미단의 통과에 맞추어 WS 와 DS 의 양측의 입측 사이드 가이드 (31, 32) 를 여는 조작을 실시한다.도 11 에 나타내는 예에서는 미단 조임이 발생하는 케이스를 상정했지만, 선단 조임이 발생하는 케이스에서도 동일한 제어를 실시할 수 있다. 요컨대, 도시되지 않은 제어 장치는, 선단 조임이 발생한다고 예측된 경우 에는, 선단의 통과에 맞추어 입측 사이드 가이드를 여는 조작을 실시한다. 개방 조작을 실시하는 입측 사이 드 가이드는 조임이 발생하는 측의 그것이지만, 조임의 발생 지점이 WS 인지 DS 인지 특정할 수 없을 때에는, WS 와 DS 의 양측의 사이드 가이드를 여는 조작을 실시한다. 이상과 같은 제어가 예측 대상의 압연 스탠드의 입측 사이드 가이드에 대해 실시됨으로써, 오퍼레이터를 보조하 고, 안정적인 조업을 실현할 수 있다. ＜그 밖의 실시형태＞ 상기 서술한 실시형태에서는, 마무리 압연기를 대상으로 하여 설명했지만, 본 발명은 조압연기에도 적용 가능하 다. 조압연기에서는 순방향, 역방향의 압연을 반복하는 이른바 리버스 압연이 복수 회 실시된다. 본 발 명을 조압연기에 적용한 경우, 압연 패스란 각 회의 압연을 의미하고, 압연 순서로 선행하는 선행 압연 패스란 전회 이전에 실시된 압연을 의미한다. 또, 상기 서술한 실시형태에서는 미단 조임을 중심으로 설명했지만, 본 발명은 미단 조임뿐만 아니라 선단 조임 에도 적용 가능하다. 또, 적응 모델 구축의 수법으로서, NN, SOM, 및 ACC 를 예로 들어 설명했지만, 본 발명에 적용할 수 있는 적응 모델 구축의 수법은 이것들로 한정되는 것은 아니다. 예를 들어, 탐색 트리의 생각을 응용한 Random Forest (RF), RF 의 발전형인 Extra Trees, xgboost 등도 적용 가능하다."}
{"patent_id": "10-2021-7008497", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1 은, 본 발명의 제 1 실시형태의 조임 발생 예측 시스템의 구성을 나타내는 블록도이다. 도 2 는, 오퍼레이터가 조임 발생의 유무 및 발생 지점을 입력하기 위한 HMI 의 일례를 나타내는 도면이다. 도 3 은, 본 발명의 제 1 실시형태의 조임 발생 예측 시스템의 적응 모델 구축부에서 실시되는 처리를 개념적으 로 나타내는 도면이다. 도 4 는, 본 발명의 제 1 실시형태의 조임 발생 예측 시스템의 예측부에서 실시되는 처리를 개념적으로 나타내 는 도면이다. 도 5 는, 본 실시형태의 조임 발생 예측 시스템에 의한 처리 플로를 상세하게 나타내는 플로 차트이다. 도 6 은, SOM 의 구성예와 그것을 사용한 예측 방법의 개요를 설명하는 도면이다. 도 7 은, ACC 의 동작 개요에 대해 구체적으로 설명하는 도면이다.도 8 은, ACC 의 동작 개요에 대해 구체적으로 설명하는 도면이다. 도 9 는, ACC 의 동작 개요에 대해 구체적으로 설명하는 도면이다. 도 10 은, 본 실시형태의 조임 발생 예측 시스템에 의한 처리 플로의 변형예를 나타내는 플로 차트이다. 도 11 은, 본 발명의 제 2 실시형태의 조임 발생 예측 시스템에 관련된 조임 예측 결과를 이용한 입측 사이드 가이드의 제어의 예를 나타내는 도면이다. 도 12 는, 종래의 열간 박판 압연 프로세스에 있어서의 압연기의 구성의 일례를 나타내는 도면이다."}
