{"patent_id": "10-2021-0142648", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0007216", "출원번호": "10-2021-0142648", "발명의 명칭": "극솟값 우회를 통한 인공신경망 학습 실패 극복방법 및 이를 수행하기 위한 인공신경망 학습", "출원인": "고려대학교 산학협력단", "발명자": "이동헌"}}
{"patent_id": "10-2021-0142648", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인공신경망 학습 장치에서 수행되는 극솟값 우회를 통한 인공신경망 학습 실패 극복방법에 있어서, 경사하강법에 기초하여 주어진 인공신경망 모델의 학습을 수행하는 제1 학습단계; 상기 인공신경망 모델을 확장시키는 확장단계; 확장된 인공신경망 모델 상에서 학습을 수행하는 제2 학습단계; 상기 제2 학습단계에서 기설정된 조건을 만족하면 상기 확장된 인공신경망 모델이 상기 주어진 인공신경망 모델로 돌아오도록 상기 확장된 인공신경망 모델을 축소시키는 축소단계; 및돌아온 상기 주어진 인공신경망 모델의 학습을 추가수행하는 제3 학습단계를 포함하는, 극솟값 우회를 통한 인공신경망 학습 실패 극복방법."}
{"patent_id": "10-2021-0142648", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 확장단계는, 상기 제1 학습 단계에서 학습하고자 하는 파라미터가 극솟값(LM, Local Minima)에 도달된 것으로 판단되면 수행되는 단계인 것을 특징으로 하는, 극솟값 우회를 통한 인공신경망 학습 실패 극복방법."}
{"patent_id": "10-2021-0142648", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 확장단계에서는, 상기 주어진 인공신경망 모델의 특정 레이어에서 학습가능한 활성화(learnable activation)를 추가하여 추가 파라미터를 도입함으로써 상기 인공신경망 모델을 확장시키는 것을 특징으로 하는, 극솟값 우회를 통한 인공신경망 학습 실패 극복방법."}
{"patent_id": "10-2021-0142648", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 기설정된 조건은, 확장된 상기 특정 레이어의 가중치, 도입된 상기 추가 파라미터에 기초한 행렬 및 다음 레이어의 가중치의 곱이0인 경우인 것을 특징으로 하는, 극솟값 우회를 통한 인공신경망 학습 실패 극복방법."}
{"patent_id": "10-2021-0142648", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 확장단계 및 상기 축소단계는, 상기 제1 학습 단계 이후에 필요에 따라 반복수행되는 것을 특징으로 하는, 극솟값 우회를 통한 인공신경망 학공개특허 10-2023-0007216-2-습 실패 극복 방법."}
{"patent_id": "10-2021-0142648", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 제2 학습단계는, 경사하강법에 기초하여 상기 확장된 인공신경망 모델 상에서 학습을 진행하는 초반 학습단계; 및 상기 초반 학습단계 이후에 기설정된 제약조건이 있는 최소화에 기초하여 상기 확장된 인공신경망 모델 상에서학습을 수행하는 후반 학습단계를 포함하는 것을 특징으로 하는, 극솟값 우회를 통한 인공신경망 학습 실패 극복 방법."}
{"patent_id": "10-2021-0142648", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 상기 확장단계에서는, 상기 경사하강법에 기초한 최소화 과정에서 속도가 기설정된 임계범위 이내의 속도에 도달되면, 상기 파라미터가 극솟값에 도달된 것으로 판단하는 것을 특징으로 하는, 극솟값 우회를 통한 인공신경망 학습 실패 극복방법."}
{"patent_id": "10-2021-0142648", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "주어진 인공신경망 모델의 학습을 수행하는 중에 상기 인공신경망 모델을 확장시키는 확장부; 기설정된 조건을 만족하면 상기 확장된 인공신경망 모델이 상기 주어진 인공신경망 모델로 돌아오도록 상기 확장된 인공신경망 모델을 축소시키는 축소부; 및 상기 주어진 인공신경망 모델의 학습을 수행하고, 상기 확장된 인공신경망 모델 상에서 학습을 수행하며, 돌아온 상기 주어진 인공신경망 모델의 학습을 추가수행하는 학습부를 포함하는, 인공신경망 학습 장치."}
{"patent_id": "10-2021-0142648", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서, 상기 주어진 인공신경망 모델의 학습을 수행하는 중에 학습하고자 하는 파라미터가 극솟값에 도달되었는지를 판단하는 판단부를 더 포함하는 것을 특징으로 하는, 인공신경망 학습 장치."}
{"patent_id": "10-2021-0142648", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에 있어서, 상기 확장부는, 상기 주어진 인공신경망 모델의 특정 레이어에서 학습가능한 활성화(learnable activation)를 추가하여 추가 파라미터를 도입함으로서 상기 인공신경망 모델을 확장시키는 것을 특징으로 하는, 인공신경망 학습 장치."}
{"patent_id": "10-2021-0142648", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서, 공개특허 10-2023-0007216-3-상기 기설정된 조건은, 확장된 상기 특정 레이어의 가중치, 도입된 상기 추가 파라미터에 기초한 행렬 및 다음 레이어의 가중치의 곱이0인 경우인 것을 특징으로 하는, 인공신경망 학습 장치."}
{"patent_id": "10-2021-0142648", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제8항에 있어서, 상기 학습부는, 경사하강법에 기초하여 상기 확장된 인공신경망 모델 상에서 학습을 진행하는 초반 학습과 상기 초반 학습 이후에 기설정된 제약조건이 있는 최소화에 기초하여 상기 확장된 인공신경망 모델 상에서 학습을 수행하는 후반 학습을 수행하는 것을 특징으로 하는, 인공신경망 학습 장치."}
{"patent_id": "10-2021-0142648", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "인공신경망 학습 장치에서 수행되는 극솟값 우회를 통한 인공신경망 학습 실패 극복방법은, 경사하강법에 기초하 여 주어진 인공신경망 모델의 학습을 수행하는 제1 학습 단계; 상기 주어진 인공신경망 모델을 확장시키는 확장 단계; 확장된 인공신경망 모델 상에서 학습을 수행하는 제2 학습단계; 상기 제2 학습단계에서 기설정된 조건을 만족하면 상기 확장된 인공신경망 모델이 상기 주어진 인공신경망 모델로 돌아오도록 상기 확장된 인공신경망 모 델을 축소시키는 축소단계; 및 돌아온 상기 주어진 인공신경망 모델의 학습을 추가수행하는 제3 학습단계를 포함 한다."}
{"patent_id": "10-2021-0142648", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 극솟값 우회를 통한 인공신경망 학습 실패 극복방법 및 이를 수행하기 위한 인공신경망 학습 장치에 관한 것으로, 보다 상세하게는 인공신경망의 학습 실패 시 학습을 재개하기 위한 극솟값 우회를 통한 인공신경 망 학습 실패 극복방법 및 이를 수행하기 위한 인공신경망 장치에 관한 것이다."}
{"patent_id": "10-2021-0142648", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공신경망 모델의 훈련에는 일반적으로 옵티마이저(optimizwers), LM elimination, random walk, random restart 방법 등이 있다. 옵티마이저(optimizwers)는 인공신경망의 훈련을 위한 방법으로 종래에는 경사하강법(gradient descent)을 기본 으로 하여 SGD(Stochastic gradient descent), warmup, momentum, adaptive learning rate 등의 방법이 제안되 어 개량되었으며, 실제 많은 인공신경망 모델의 훈련에 사용되고 있다. 이러한 훈련방법 중 momentum 방법은 계산된 경사(gradient)로부터 경사하강법(gradient descent)을 적용할 때, 이전 단계에서 사용했던 경사와 새로운 경사의 선형 조합(linear combination)에 해당하는 방향으로 파라미 터 업데이트(parameter update)를 수행함으로써 극솟값(LM, local minima)에 갇히는 상황이 발생하더라도 얕은 극솟값이라면 빠져나갈 확률을 제공할 수는 있다. 이는 훈련 중인 현재의 위치에서 경사가 0이더라도 이전의 경 사가 크면 관성으로 인해 극솟값을 빠져나갈 수 있기 때문이다. 하지만 이러한 방법은 단순히 운에 의지하여 이 뤄지는 극솟값 탈출에 불과할 뿐, 탈출 이후 손실함수의 값이 오히려 증가할 위험이 크다는 문제가 있다. 한편, SGD(Stochastic gradient descent)에 따른 방법은 경사 최소화를 시도하는 손실함수 자체를 데이터의 일 부만으로 정의하여 전체 손실 함수의 경사에 노이즈를 주는 방법으로써, 극솟값에 빠질 확률을 크게 줄여주지만 여전히 일정수준 이상의 손실함수를 최소화하지 못하는 현상이 발생한다는 문제가 있다. Warmup에 따른 방법은 학습 초반부에 나쁜 극솟값에 빠지는 원인이 큰 학습률(learning rate)에 있다고 보고, 초기에 아주 작은 학습률로 시작하여 점점 그 크기를 키워 가는 방법으로, 학습률을 조절하여 sharp LM에 빠지 는 상황을 예방할 수 있다. 하지만 경사하강법을 이용한 인공신경망 훈련은 결국 언젠가는 극솟값에 빠지게 되며 학습 초기에 이런 일이 일 어날 경우 훈련 과정이 멈추게 되고, 이를 개량한 이상의 SGD(Stochastic gradient descent), warmup, momentum에 따른 개량된 방법에 의해 어느 정도의 극솟값 회피를 할 수는 있지만 안 좋은 극솟값에 빠지는 상황 을 완전히 피할 수는 없다는 문제가 있다. 한편, LM elimination 방법은 학습하고자 하는 신경망 모델의 외부에 통제하기 위한 리니어 모델(혹은 한 개의 뉴런)을 추가하는 방법으로 손실함수의 성질을 바꾸는 방법으로 개량된 함수의 local optima를 찾을 수 있다면 기존 모델의 최적의 해(global minima)를 찾을 수 있다는 주장이 제시되었으나, 실제 거대한 크기의 인공신경망을 훈련시키는 방법으로 사용하기에는 제약이 있다는 문제가 있다. 그리고 random walk 방법은 학습하고자 하는 파라미터가 극솟값에 빠진 것으로 판단되면 임의의 방향으로 이동 하는 방법이지만 오히려 더 나쁜 극솟값으로 들어갈 가능성이 크고 스텝 사이즈(step size)가 너무 작으면 훈련 의 효과가 적고 스텝사이즈가 크면 효과적이지 못한 것과 같이 스텝 사이즈에 영향을 크게 받는다는 문제가 있 다. 한편 random restart 방법은 극솟값에 빠지는 현상으로 인해 손실함수의 최소화 과정이 멈추게 되는데 이는 처 음 출발하는 파라미터의 초기값에 의존하므로 좋지 않은 극솟값에 빠질 경우 처음으로 돌아가서 다른 초기값을 사용하여 훈련을 다시 시도하는 방법이다. 이 경우 각 층에서 경사의 분포를 어느 정도 맞춰주어 학습 속도를 빠르게 하고자 하는 initialization 기법이 제안된 바 있지만, 학습이 멈추게 되는 극솟값을 예측할 수 없고, 학습을 다시 시작하는 것이 나은 결과를 줄 것인지에 대해 보장할 수 있는 것이 없어 random restart를 반복적 으로 시도해야 할 수도 있다. 즉 이상의 방법은 단순히 극솟값에 빠지는 상황을 예방하는 것에 불과할 뿐으로, 인공신경망의 훈련 도중 극솟 값에 빠져 경사가 0으로 주어진 상황에서도 작동하여 극솟값에 빠지는 상황을 예방하는 것이 아닌 직접적으로 극솟값을 회피할 수 있는 방법이 필요하다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국특허출원 제1999-0051256호"}
{"patent_id": "10-2021-0142648", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제를 해결하기 위해 안출된 것으로, 본 발명의 목적은 인공신경망의 학습 도중 극솟값 에 빠져 경사가 0으로 주어진 상황에서도 학습을 멈추지 않고 작동하여 극솟값에 빠지는 상황을 예방하는 것이 아니라 직접적으로 회피할 수 있는 극솟값 우회를 통한 인공신경망 학습 실패 극복방법 및 이를 수행하기 위한 인공신경망 장치를 제공하는 것이다. 그리고 본 발명의 다른 목적은 인공신경망의 학습 도중 극솟값에 빠져 훈련이 멈춘 이후 이를 빼낸 뒤 추가적인 학습을 시도해 더 좋은 파라미터를 찾을 수 있는 극솟값 우회를 통한 인공신경망 학습 실패 극복방법 및 이를 수행하기 위한 인공신경망 장치를 제공하는 것이다."}
{"patent_id": "10-2021-0142648", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위한 본 발명의 일 실시예에 따른 인공신경망 학습 장치에서 수행되는 극솟값 우회를 통 한 인공신경망 학습 실패 극복방법은, 경사하강법에 기초하여 주어진 인공신경망 모델의 학습을 수행하는 제1 학습단계; 상기 인공신경망 모델을 확장시키는 확장단계; 확장된 인공신경망 모델 상에서 학습을 수행하는 제2 학습단계; 상기 제2 학습단계에서 기설정된 조건을 만족하면 상기 확장된 인공신경망 모델이 상기 주어진 인공 신경망 모델로 돌아오도록 상기 확장된 인공신경망 모델을 축소시키는 축소단계; 및 돌아온 상기 주어진 인공신 경망 모델의 학습을 추가수행하는 제3 학습단계를 포함한다. 그리고 상기 확장단계는, 상기 제1 학습 단계에서 학습하고자 하는 파라미터가 극솟값(LM, Local Minima)에 도 달된 것으로 판단되면 수행되는 단계일 수 있다. 여기서 상기 확장단계에서는, 상기 주어진 인공신경망 모델의 특정 레이어에서 학습가능한 활성화(learnable activation)를 추가하여 추가 파라미터를 도입함으로써 상기 인공신경망 모델을 확장시킬 수 있다. 그리고 상기 기설정된 조건은, 확장된 상기 특정 레이어의 가중치, 도입된 상기 추가 파라미터에 기초한 행렬 및 다음 레이어의 가중치의 곱이 0인 경우일 수 있다. 한편, 상기 확장단계 및 상기 축소단계는, 상기 제1 학습 단계 이후에 필요에 따라 반복수행될 수 있다. 그리고 상기 제2 학습단계는, 경사하강법에 기초하여 상기 확장된 인공신경망 모델 상에서 학습을 진행하는 초 반 학습단계; 및 상기 초반 학습단계 이후에 기설정된 제약조건이 있는 최소화에 기초하여 상기 확장된 인공신 경망 모델 상에서 학습을 수행하는 후반 학습단계를 포함할 수 있다. 또한, 상기 확장단계에서는, 상기 경사하강법에 기초한 최소화 과정에서 속도가 기설정된 임계범위 이내의 속도 에 도달되면, 상기 파라미터가 극솟값에 도달된 것으로 판단할 수 있다. 한편 상기 목적을 달성하기 위한 본 발명의 일 실시예에 따른 인공신경망 학습 장치는, 주어진 인공신경망 모델 의 학습을 수행하는 중에 상기 인공신경망 모델을 확장시키는 확장부; 기설정된 조건을 만족하면 상기 확장된 인공신경망 모델이 상기 주어진 인공신경망 모델로 돌아오도록 상기 확장된 인공신경망 모델을 축소시키는 축소 부; 및 상기 주어진 인공신경망 모델의 학습을 수행하고, 상기 확장된 인공신경망 모델 상에서 학습을 수행하며, 돌아온 상기 주어진 인공신경망 모델의 학습을 추가수행하는 학습부를 포함한다. 그리고, 상기 주어진 인공신경망 모델의 학습을 수행하는 중에 학습하고자 하는 파라미터가 극솟값에 도달되었 는지를 판단하는 판단부를 더 포함할 수 있다. 여기서, 상기 확장부는, 상기 주어진 인공신경망 모델의 특정 레이어에서 학습가능한 활성화(learnable activation)를 추가하여 추가 파라미터를 도입함으로서 상기 인공신경망 모델을 확장시킬 수 있다. 그리고 상기 기설정된 조건은, 확장된 상기 특정 레이어의 가중치, 도입된 상기 추가 파라미터에 기초한 행렬 및 다음 레이어의 가중치의 곱이 0인 경우일 수 있다. 또한, 상기 학습부는, 경사하강법에 기초하여 상기 확장된 인공신경망 모델 상에서 학습을 진행하는 초반 학습 과 상기 초반 학습 이후에 기설정된 제약조건이 있는 최소화에 기초하여 상기 확장된 인공신경망 모델 상에서 학습을 수행하는 후반 학습을 수행할 수 있다."}
{"patent_id": "10-2021-0142648", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상술한 본 발명의 일측면에 따르면, 극솟값 우회를 통한 인공신경망 학습 실패 극복방법 및 이를 수행하기 위한 인공신경망 장치를 제공함으로써, 인공신경망의 학습 도중 극솟값에 빠져 경사가 0으로 주어진 상황에서도 학습 을 멈추지 않고 작동하여 극솟값에 빠지는 상황을 예방하는 것이 아니라 직접적으로 회피할 수 있다. 특히 본 실시예에 따른 극솟값 우회를 통한 인공신경망 학습 실패 극복방법 및 이를 수행하기 위한 인공신경망 장치를 제공함으로써, 기존의 극솟값에 빠져 훈련이 멈춘 이후 이를 빼낸 뒤 추가적인 학습을 시도해 더 좋은 파라미터를 찾을 수 있다."}
{"patent_id": "10-2021-0142648", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "후술하는 본 발명에 대한 상세한 설명은, 본 발명이 실시될 수 있는 특정 실시예를 예시로서 도시하는 첨부 도 면을 참조한다. 이들 실시예는 당업자가 본 발명을 실시할 수 있기에 충분하도록 상세히 설명된다. 본 발명의 다양한 실시예는 서로 다르지만 상호 배타적일 필요는 없음이 이해되어야 한다. 예를 들어, 여기에 기재되어 있 는 특정 형상, 구조 및 특성은 일 실시예와 관련하여 본 발명의 정신 및 범위를 벗어나지 않으면서 다른 실시예 로 구현될 수 있다. 또한, 각각의 개시된 실시예 내의 개별 구성요소의 위치 또는 배치는 본 발명의 정신 및 범 위를 벗어나지 않으면서 변경될 수 있음이 이해되어야 한다. 따라서, 후술하는 상세한 설명은 한정적인 의미로 서 취하려는 것이 아니며, 본 발명의 범위는, 적절하게 설명된다면, 그 청구항들이 주장하는 것과 균등한 모든 범위와 더불어 첨부된 청구항에 의해서만 한정된다. 도면에서 유사한 참조부호는 여러 측면에 걸쳐서 동일하거 나 유사한 기능을 지칭한다.인공신경망은 생물학적 뉴런의 동작원리와 뉴런 간의 연결 관계를 모델링한 것으로 노드(node) 또는 처리 요소 (processing element)라고 하는 다수의 뉴런들이 레이어(layer) 구조의 형태로 연결된 정보처리 시스템이다. 인공신경망은 기계 학습에서 사용되는 모델로써, 기계학습과 인지과학에서 생물학의 신경망(동물의 중추신경계 중 특히 뇌)에서 영감을 얻은 통계학적 학습 알고리즘이다. 구체적으로 인공신경망은 시냅스(synapse)의 결합으로 네트워크를 형성한 인공 뉴런(노드)이 학습을 통해 시냅 스의 결합 세기를 변화시켜, 문제 해결 능력을 가지는 모델 전반을 의미할 수 있으며, 인공신경망은 뉴럴 네트 워크(Neural Network)와 혼용되어 사용될 수 있다. 인공신경망은 복수의 레이어(layer)를 포함할 수 있고, 레이어들 각각은 복수의 뉴런(neuron)을 포함할 수 있으 며, 뉴런과 뉴런을 연결하는 시냅스를 포함할 수 있다. 그리고, 인공신경망은 일반적으로 다음의 세가지 인자, 즉 다른 레이어의 뉴런들 사이의 연결 패턴 연 결의 가중치를 갱신하는 학습 과정 이전 레이어로부터 수신되는 입력에 대한 가중 합으로부터 출력값을 생 성하는 활성화 함수에 의해 정의될 수 있다. 또한 인공신경망은 입력층과 출력층으로 구성되는 단층 신경망과 입력층, 하나 이상의 은닉층 및 출력층으로 구 성되는 다층 신경망으로 구분될 수 있다. 입력층은 외부의 자료들을 받아들이는 층으로서, 입력층의 뉴런 수는 입력되는 변수의 수와 동일하며, 은닉층은 입력층과 출력층 사이에 위치하여 입력층으로부터 신호를 받아 특징을 추출하여 출력층으로 전달한다. 한편 출 력층은 은닉층으로부터 신호를 받고, 수신한 신호에 기반한 출력 값을 출력한다. 뉴런간의 입력신호는 각각의 연결강도(가중치)와 곱해진 후 합산되며 이 합이 뉴런의 임계치보다 크면 뉴런이 활성화되어 활성화 함수를 통 하여 획득한 출력값을 출력한다. 이 때 입력층과 출력층 사이에 복수의 은닉층을 포함하는 심층 신경망은 기계 학습 기술의 한 종류인 딥 러닝을 구현하는 대표적인 인공신경망일 수 있다. 그리고 인공신경망 훈련 데이터(training data)를 이용하여 학습(training)될 수 있다. 여기서 학습이란, 입력 데이터를 분류(classification) 또는 회귀분석(regression) 또는 군집화(clustering)하는 등의 목적을 달성하 기 위하여, 학습 데이터를 이용하여 인공 신경망의 파라미터(parameter)를 결정하는 과정을 의미할 수 있다. 인 공신경망의 파라미터의 대표적인 예시로써, 시냅스에 부여되는 가중치(weight)나 뉴런에 적용되는 편향(bias)을 들 수 있다. 훈련 데이터에 의하여 학습된 인공신경망은, 입력 데이터를 입력 데이터가 가지는 패턴에 따라 분류하거나 군집 화 할 수 있다. 한편 손실함수는 인공신경망의 학습 과정에서 최적의 파라미터를 결정하기 위한 지표(기준)로 이용될 수 있다. 인공신경망에서 학습은 손실함수를 줄이기 위하여 파라미터들을 조작하는 과정을 의미하며, 학습의 목적은 손실 함수를 최소화하는 파라미터를 결정하는 것으로 볼 수 있다. 따라서 머신 러닝 또는 딥 러닝에서는 손실함수를 최소화하기 위하여 학습 최적화 알고리즘을 이용할 수 있으며, 학습 최적화 알고리즘에는 경사하강법, 확률적 경사하강법, 모멘텀, NAG, Adagrad, AdaDelta, RMSProp, Adam, Nadam 등이 있다. 경사하강법은 현재 상태에서 손실함수의 기울기를 고려하여 손실함수값을 줄이는 방향으로 파라미터를 조정하는 기법으로 파라미터를 조정하는 방향은 스텝 방향, 조정하는 크기는 스텝 사이즈라고 칭할 수 있으며, 스텝 사이 즈는 학습률을 의미할 수 있다. 또한 경사하강법은 손실함수를 각 파라미터들로 편미분하여 기울기를 획득하고, 파라미터들을 획득한 기울기 방 향으로 학습률만큼 변경하여 갱신할 수 있다. 본 발명은 경사하강법 알고리즘을 이용하여 인공신경망의 학습을 진행함에 있어 학습 도중 또는 학습 후 추가적 인 개선을 위한 알고리즘을 제공하여, 학습하고자 하는 파라미터가 극솟값(LM, Local minima)에 빠져 경사가 0 으로 주어져 학습이 중단된 이후에 이를 빼낸 뒤 추가적인 학습을 시도해 더 좋은 파라미터를 찾기 위해 마련될 수 있다. 이하에서는 첨부된 도면을 참고하여 본 발명을 상세히 설명하기로 한다. 도 1은 본 발명의 일 실시예에 따른 인공신경망 학습 장치의 구성을 나태는 블록도이다. 인공신경망 학습 장치는 훈련 데이터를 이용하여 기계 학습을 수행할 수 있는 장치로서, 인공신경망으로 구성된 모델을 이용하여 학습하는 장치를 포함할 수 있다. 즉, 인공신경망 학습 장치는 데이터 마이닝, 데이터 분석, 지능형 의사 결정 및 기계 학습 알고리즘을 위 해 이용될 정보를 수신, 분류, 저장 및 출력하도록 구성될 수 있다. 여기서 기계 학습 알고리즘은 딥 러닝 알고 리즘을 포함할 수 있다. 그리고 인공신경망 학습 장치는 적어도 하나의 외부 장치(미도시) 또는 단말기(미도시)와 통신할 수 있고, 외부 장치를 대신하거나 외부 장치를 도와 데이터를 분석 또는 학습하여 결과를 도출할 수 있다. 여기서 다른 장치를 도운다는 의미는 분산 처리를 통한 연산력의 분배를 의미할 수 있다. 인공신경망 학습 장치는 인공신경망을 학습하기 위한 다양한 장치로서, 통상적으로 서버를 의미할 수 있고, 인공신경망 장치 또는 인공신경망 학습 서버 등으로 지칭될 수 있을 것이다. 특히 인공신경망 학습 장치는 단일한 서버 뿐만 아니라 복수의 서버 세트, 클라우드 서버 또는 이들의 조 합 등으로 구현될 수 있다. 인공신경망 학습 장치는 복수로 구성되어 인공신경망 학습 장치 세트를 구성할 수 있고, 인공신경망 학습 장치 세트에 포함된 적어도 하나 이상의 인공신경망 학습 장치는 분산 처리를 통하여 데이터를 분석 또는 학습하여 결과를 도출할 수 있다. 인공신경망 학습 장치는 주기적으로 혹은 요청에 의하여 외부 장치(미도시)에 기계 학습 또는 딥러닝에 의 하여 학습한 모델을 전송할 수도 있다. 이를 위해 도 1에 도시된 바와 같이 인공신경망 학습 장치는 통신부, 획득부, 저장부 및 제어부를 포함하여 마련될 수 있다. 통신부는 유무선 통신이나 인터페이스를 통하여 다른 장치와 데이터를 송수신하기 위해 마련될 수 있다. 획득부는 모델 학습을 위한 훈련 데이터 또는 학습된 모델을 이용하여 출력을 획득하기 위한 입력 데이터 등을 획득하기 위해 마련될 수 있다. 이러한 획득부는 가공되지 않은 입력 데이터를 획득할 수도 있으며, 이 경우 제어부는 획득한 데이터 를 전처리하여 모델 학습에 입력이 가능한 훈련 데이터 또는 전처리된 입력 데이터를 생성할 수 있다. 이 때 획득부에서 수행하는 입력 데이터에 대한 전처리는 입력 데이터로부터 입력 특징점을 추출하는 것을 의미할 수도 있으며, 이러한 획득부는 통신부를 통해 데이터를 수신함으로써 획득할 수도 있다. 저장부는 제어부 또는 인공신경망 학습 장치에서 학습된 모델을 저장할 수 있다. 그리고 필요에 따라 학습된 모델을 학습 시점 또는 학습 진척도 등에 따라 복수의 버전으로 구분하여 저장할 수 있다. 이 때 저장부는 획득부에서 획득한 입력 데이터, 모델 학습을 위하여 이용되는 학습 데이터 또는 훈 련 데이터, 학습 히스토리 등을 저장할 수 있고, 저장된 입력 데이터는 모델 학습에 적합하게 가공된 데이터 뿐 만 아니라 가공되지 않은 입력 데이터 그 자체일 수도 있다. 그리고 저장부는 제어부를 통해 학습 중인 인공신경망 모델 또는 학습된 인공신경망 모델을 저장하며, 학습을 통해 모델이 업데이트되면 업데이트된 모델을 저장할 수 있다. 한편 제어부는 훈련 데이터 또는 트레이닝 셋을 이용하여 인공신경망을 훈련 또는 학습시키기 위해 마련될 수 있다. 이러한 제어부는 획득부 또는 저장부를 통해 획득한 입력 데이터를 전처리한 데이터를 이용하여 인공신경망을 학습할 수 있는데, 이러한 제어부는 다양한 학습 기법을 이용하여 인공신경망을 반 복적으로 학습시킴으로써 인공신경망의 최적화된 파라미터들을 결정할 수 있다. 본 실시예에서는 훈련 데이터를 이용하여 학습됨으로써 파라미터가 결정된 인공신경망을 학습 모델 또는 학습된 모델이라 칭할 수 있다. 이 때 학습 모델은 인공신경망 학습 장치에 탑재된 상태에서 결과 값을 추론할 수 도 있으며, 통신부를 통해 단말기 또는 외부 장치와 같은 다른 장치에 전송되어 탑재될 수도 있다. 본 실시예에서의 제어부는 경사하강법 알고리즘에 기초하여 인공신경망 모델의 학습을 수행하고, 학습하고 자 하는 파라미터가 극솟값(LM)에 도달되면 능동적으로 극솟값으로부터 빠져나오도록 하여 학습 실패를 극복하기 위해 마련될 수 있다. 이를 위해 제어부는 학습부, 판단부, 확장부, 축소부를 포 함할 수 있다. 학습부는 주어진 인공신경망 모델 또는 확장된 인공신경망 모델에서 정해진 학습 알고리즘에 의해 인공신 경망 모델의 학습을 수행할 수 있다. 판단부는 학습하고자 하는 파라미터가 극솟값에 도달되었는지를 판단하거나 확장된 인공신경망 모델을 축 소하는 조건이 충족되었는지에 대한 여부를 판단할 수 있다. 여기서 판단부는 극솟값에 도달되었는지를 판단하는 기준으로 최소화 과정에서 속도가 느려지는 것을 감지 하여 사전에 설정된 임계범위 이내의 속도에 도달되면 극솟값에 도달된 것으로 판단할 수 있다. 또한 판단부 는 확장된 인공신경망 모델을 최초에 주어진 인공신경망 모델로 다시 돌아가기 위한 사전에 설정된 조건을 만족하였는지를 판단할 수도 있다. 확장부는 주어진 인공신경망 모델에서 학습을 수행하는 중에 판단부 에 의해 극솟값에 도달된 것으로 판단되면, 인공신경망 모델의 특정 레이어에서 학습가능한 활성화를 추가 하여 추가 파라미터를 도입하여 주어진 인공신경망 모델을 확장시킬 수 있다. 이 때 확장부가 추가 파라미터를 도입함에 있어 노드의 수 만큼 추가 파라미터를 도입할 수 있는 것은 물 론, 확장하고자 하는 파라미터의 수는 사용자에 의해 사전에 임의로 설정되어 자유자재로 설정될 수 있음은 물 론이다. 한편 축소부는 학습부가 확장된 인공신경망 모델의 학습을 수행하는 중에 판단부에 의해 기설정 된 조건을 만족한 것으로 판단되면, 확장된 인공신경망 모델이 다시 최초로 주어진 인공신경망 모델로 돌아올 수 있도록 하기 위해 확장된 인공신경망 모델을 축소시킬 수 있다. 그리고 이상에서는 판단부가 극솟값에 도달되었는지를 판단하고 이에 기초하여 확장부에서 인공신경 망 모델을 확장하는 것으로 기재하였으나, 이에 한정되는 것은 아니다. 구체적으로 확장부가 인공신경망을 확장하기 위한 조건으로 극솟값에 도달되는 기준이 아닌 판단부의 판단과는 별개로 사용자에 의해 계획된 시점에서 인공신경망 학습 모델을 확장시킬 수도 있다. 이하에서는 제어부를 구성하는 구체적인 구성요소들에서 수행되는 인공신경망 학습 실패 시 극솟값을 우회 하여 학습을 재개하는 과정에 대해 보다 구체적으로 설명하기로 하며, 수행주체보다는 시계열의 흐름을 기준으 로 설명하기로 한다. 인공신경망 모델의 학습을 수행하는 과정에서 극솟값(LM)에 빠지는 것은 손실함수의 경사가 0에 가깝게 주어지 기 때문인데, 확장된 인공신경망 모델과 파라미터 공간에서도 경사가 0일 이유는 일반적으로 없기 때문에 경사 하강법에 기반한 알고리즘으로 손실함수의 최소화가 가능해질 수 있다. 이러한 극솟값 우회의 알고리즘 개념은 하기의 파이프라인으로 나타낼 수 있다."}
{"patent_id": "10-2021-0142648", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이상의 파이프라인에 대해 간략하게 설명하면, 상술한 바와 같이 주어진 인공신경망 모델에서 학습을 수행하고 극솟값(LM)에 빠지거나 최소화 과정에서 속도가 느려지면 인공신경망 모델을 확장시킬 수 있다. 이후 확장된 인 공신경망 모델에서 학습을 다시 진행하고, 기설정된 조건이 만족된 것으로 판단되면 확장된 인공신경망 모델을 축소시켜 처음에 주어진 인공신경망 모델로 돌아온 후 주어진 인공신경망 모델에서 추가적으로 학습을 수행하는 과정이다. 여기서 과 는 학습 알고리즘 ( 을 학습하는데 사용되는 학습 알고리즘)과 에 의해 발견된 극 솟값으로 과 은 동일한 학습 알고리즘일 수 있다. 즉 종래의 방법을 통해 기존의 모델에서 이뤄지 는 훈련 과정이며, 본 실시예에서는 및 에 의해 손실함수의 경사가 0이 되면 그 이후에 인공신경 망을 모델을 확장시켜 극솟값을 우회시켜 학습을 재개하도록 하는 것이다. 본 발명에서는 주어진 인공신경망 모델인 을 복수의 레이어 로 구성된 다중 레이어 퍼셉트론(MLP, Muliti- Layer Perceptron) 모델로 정의할 수 있다. 그리고 주어진 인공신경망 모델 의 파라미터 공간(space)은 으로 표시하고 이는 하기의 수학식 1과 같이 정의될 수 있다. 수학식 1"}
{"patent_id": "10-2021-0142648", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "그리고 를 함수의 클래스(class)라고 하면, 은 하기의 수학식 2에서와 같이 인공신경망 모델을 파라미터 공 간 에서 함수공간으로 대응되는 함수 로 나타낼 수 있게되고, 그 치역 과 정의역 을 확장하 는 방법으로 극솟값 탈출을 시도할 수 있다. 이 때 확장한 인공신경망 모델과 치역 및 정의역은 로 표기할 수 있고, 의 원소인 파라미터를 각각 와 로 표기할 수 있다. 수학식 2"}
{"patent_id": "10-2021-0142648", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "이상의 수학식 2를 참조하면 일 수 있고, 는 번째 레이어의 가중치 (Weight)일 수 있다. 또한 모든 활성화(activations)가 연속적(미분 가능)일 경우 는 연속적(미분 가능) 함수 의 클래스로 선택될 수 있다. 그리고 본 발명에서는 을 의 이미지로 정의, 즉 ( )일 수 있다. 그리고 이 때 손실함수는 로 표시되고, 로 정의될 수 있다. 본 실시예에서의 극솟값 우회는 확장된 인공신경망 모델의 치역인 가 를 만족하고 가 이면 주어진 인공신경망 모델 함수 을 확장된 인공신경망 모델 에 포함하고 는 에서 극솟값일 필요가 없기 때문에 극솟값에서 벗어날 기회를 얻을 수 있게 된다. 이상의 파이프라인에서 는 확장된 인공신경망 모델에 파라미터를 대응시키는 함수를 의미하며, 상술한 바와 같이 을 만족해야 한다. 그리고 본 발명의 인공신경망 모델의 확장에서 입력 차원(input dimension)은 이고, 각 레이어의 노드 수는 이며, 각 레이어의 활성화 함수(activation functions)는 로 정의할 수 있다. 따라서 판단부에서 극솟값에 도달된 것으로 판단하면, 확장부는 특정 레이어에서 활성함수 대신 학 습가능한 활성화(learnable activation)인 를 각 j번째 노드에 사용하여 인공신경망 모델을 확장시 킬 수 있다. 이 때 파라미터 공간인 는 해당 레이어의 노드 개수(도입되는 의 개수)만큼 확장이 이루어지게 된다. 따라서 로 정의될 수 있으며, 여기서 는 노드의 개수를 의미할 수 있고, 는 추가되는 파라미터로 정의될 수 있다. 추가로 이러한 학습가능한 활성화(learnable activation)는 미분가능한 함수 , 다항함수 에 대해 로 확장이 가능하다. 이러한 학습가능한 활성화는 인공신경망 모델의 확장을 용이하게 할 수 있다. 그리고 이상의 파이프라인에서 의 각 가 모두 0일 경우, 학습가능한 활성화들이 모두 활성함수 와 같게 되므로, 확장하기 이전 모델인 과 같게 되며, 로 정의하면 을 만 족할 수 있게 된다. 추가로 로 확장했을 경우 역시 각 를 의 해로 초기화하는 방법으로 를 정의할 수 있다. 이후 학습부는 학습 알고리즘 에 기초하여 확장된 인공신경망 상에서 학습을 진행하게 되며, 여기서 는 제약조건이 있는 최소화 과정으로 이 때 사용하는 실현가능한 셋(feasible set)으로 가 필요 한데, 일반적으로 인공신경망 모델의 파라미터 공간에서 이 실현가능한 셋의 정의 방정식(defining equation)을 찾아내기는 매우 어렵다. 하지만 본 실시예에서는 이러한 가 정의될 수 있는 의 정의역 ( 에 포함될) 및 해당 정의역을 정의하는 방정식들을 제시할 수 있으며, 본 실시예에서는 상술한 과정을 통해 이를 가능하게 하는 확장된 인공신경망 모델 를 만들 수 있다. 그리고 에 기초한 확장된 인공신경망 모델의 학습에 대한 구체적인 내용은 후술하기로 한다. 이후 판단부는 학습부에서 에 기초하여 확장된 인공신경망 상에서 학습을 진행하는 과정에서 기설정된 조건, 즉 원래의 인공신경망 모델로 돌아오기 위한 조건을 만족하는 것으로 판단되면, 축소부에 서 확장된 인공신경망 모델을 축소하는 과정을 수행하도록 할 수 있다. 여기서 원래의 인공신경망 모델로 돌아오기 위한 조건은 다음과 같을 수 있다. 활성함수를 확장한 번째 레이어의 가중치(Weight)는 , 도입된 추가파라미터의 대각선행렬(diagonal matrix) 인 를 , 다음 레이어의 가중치를 라고 했을 때 을 만족하면 이때의 파라미터 는 안에 위치할 수 있게 된다. 또는 또는 일 경우 자연히 이 유도되므로 세 조건 역시 돌아오는 조건으로 사 용될 수 있다. 다만 실현가능한 셋(feasible set)을 최대한 크게 찾기 위해서 을 사용하는 것이 더 바람직할 수 있다. 그리고 상술한 학습가능한 활성화(learnable activation)인 를 사용한 확장의 경우 각 가 레이어의 입력값에 대한 다항식 맵(polynomial map)이 모두 상수함수가 되도록 하는 조건이 대 수적 조건(특정 다항식들이 모두 0이 되게 하는 조건)으로 주어지면 이는 모두 계산이 가능할 수 있다. 이렇게 판단부는 이상의 기설정된 조건이 만족되면 축소부에서 확장된 인공신경망 모델을 축소하는 과정을 수행하도록 할 수 있다. 축소과정인 는 의 결과로 가 주어졌을 때 를 만족하는 를 찾는 함수일 수 있으며, 이를 통해 확장된 인공신경망 모델이 원래의 인공신 경망 모델로 돌아올 수 있다. 상술한 조건을 만족하면, 즉 을 돌아오는 조건으로 사용하는 경우 는 확장을 시도한 레이어의 vias인 와 다음 레이어의 bias인 에 대해 , 로 정의될 수 있다. 학습가능한 활성화(learnable activation)인 를 사용한 확장의 경우 를 대수적 조건 하에 서 구해진 상수함수의 값들로 이루어진 벡터라고 할 때 를 사용해 똑같이 정의가 가능할 수 있다. 축소부는 이상의 과정을 통해 확장된 인공신경망 모델을 축소해 주어진 인공신경망 모델로 돌아오도록 할 수 있다. 그러면 이후에는 학습부에서 상술한 바와 같이 학습 알고리즘인 에 의해 추가학습을 수행할 수 있다. 특히 이상의 구성을 통해 본 실시예에 따른 제어부는 에 의해 극솟값(LM)에 빠지면 상술한 과정을 다시 반복하여 인공신경망 모델을 확장하여 확장된 인공신경망 모델에서 학습을 진행한 후 확장된 인공신경망 모델을 축소하여 다시 원래의 인공신경망 모델로 돌아와 다시 학습을 재개하는 과정을 반복하여 수행함으로써 인공신경망 학습의 실패를 극복할 수 있는 것은 물론 재시작으로 인해 발생하는 추가적인 훈련 비용을 절감할 수 있게 된다. 특히 극솟값을 우회하여 추가적인 학습을 반복적으로 수행할 수 있게 됨에 따라 데이터 추가 업싱 기존 모델의 성능 향상을 시도할 수 있다는 장점이 있고, 종래의 기술과 병렬적으로 사용이 가능하고 추가되는 파라미터의 개수를 자유자재로 정할 수 있어 사용환경에 맞게 변형이 가능하다는 효과를 제공할 수 있다. 이하에서는 후술하기로 한 학습부에서 를 수행하는 과정에 대해 자세히 설명하기로 한다. 확장된 인공신경망 모델 상에서의 학습을 위한 알고리즘은 학습의 출발점인 직후의 위치에서 인 점 때문에 시작과 동시에 KKT 조건을 만족시키게 되므로 기존의 제약 최적화 알고리즘들을 직접 적용하 기 어렵다. 이에 본 실시예에 따른 제어부는 를 두 개의 단계로 나누어 실시할 수 있다. 이 경우의 파이프라인은 하기의 파이프라인과 같다."}
{"patent_id": "10-2021-0142648", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "구체적으로 초반에는 제약(constraint)없이 평범한 경사하강법으로 확장된 인공신경망 모델 상에서 손실함수를 감소시켜 학습을 진행하는 초반 학습단계인 를 수행하고, 이후에는 기설정된 제약조건이 있는 최소화에 기 초하여 확장된 인공신경망 모델 상에서 학습을 수행하는 후반 학습 단계인 를 수행할 수 있다. 구체적으로 최소화(minimize)하고자 하는 함수 대신 증가하는 에 대해 를 최소화하여 를 수행할 수 있다. 이를 알고리즘으로 표현하면 아래와 같을 수 있다."}
{"patent_id": "10-2021-0142648", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "여기서 은 경사하강법 또는 이로부터 파생된 최적화를 사용한 최소화의 한 단계를 의미할 수 있다. 그리고 본 실시예에 따른 학습부는 증가하는 값을 사용하여 이상의 알고리즘을 따라 제약조건이 있 는 최소화(constrainted minimization)를 수행하게 되며, 이때의 제약조건(constraint)은 일 수 있으며, 여기서 z는 i-1번째 레이어를 의미하고, T는 transpose로 column vector를 만들기 위한 것이다. 그리고 학습부는 이상의 알고리즘을 통해 알 수 있듯이 가 보다 작아지면 해당 알고리즘의 수 행은 중단될 수 있다. 이는 상술한 돌아오는 조건에서 제약조건이 있는 정의 방정식을 찾았기 때문에 다른 방법으로 확장되었을 때 각 정의 방정식의 값들을 줄이는 방법으로 제약적인 최적화의 구현이 가능해질 수 있다. 따라서 본 실시예에 따른 인공신경망 학습 장치는 학습하고자 하는 파라미터가 극솟값에 빠져 경사가 0으 로 주어진 상황에서도 학습을 진행하여 극솟값에 빠지는 상황을 예방하는 것이 아닌, 능동적으로 극솟값(LM) 탈 출이 가능하므로 조기에 학습이 중단되는 것을 방지하는 것은 물론, 추가적인 학습을 시도해 더 좋은 파라미터 를 찾을 수 있는 효과를 제공할 수 있다. 특히 본 실시예에 따른 인공신경망 학습 장치는 종래의 기술과 병렬적으로 사용가능하고, 임의의 학습 모 델, 임의의 손실함수(regularization term 포함 가능), 임의의 데이터에 사용이 가능할 수 있다. 또한 계산 비 용도 기존의 방법만으로 접근하는 것과 차이가 나지 않으며 사용하는 임의의 파라미터의 개수를 자유자재로 정 할 수 있어 사용환경에 맞게 변형이 가능하다는 장점이 있다. 도 2는 본 발명의 인공신경망 학습 장치에서 수행된 학습 결과를 설명하기 위한 도면으로, 상술한 인공신 경망 학습 장치에서 수행하는 극솟값 우회를 위한 파이프라인이 작동하는 방식에 대한 직관적인 플롯으로 본 실시예에 따라 인공신경망 모델이 확장된 상태에서의 모습을 도시한 도면이다. 도 2에서 남색으로 표시된 곡선은 최초로 주어진 인공신경망 학습 모델의 1차원에서의 손실함수를 나타낸 것이다. 도시된 바와 같이 학습부가 하늘색 화살표로 도시된 바와 같이 학습 알고리즘인 에 기초하여 경 사하강법으로 인공신경망 학습 모델의 학습을 수행하다가 극솟값에 도달되어 갇히면, 더 이상 손실함수의 값을 줄일 수 없어 종래에는 학습이 조기에 중단될 수 밖에 없다. 하지만 도 1에서 상술한 바와 같이 본 실시예에 따른 인공신경망 학습 장치는 에 의해 극솟값에 갇 히면 도시된 바와 같이 되면, 파라미터 공간의 확장을 통해 더 큰 차원으로 문제를 변형하여 주어진 인공신경망 학습 모델을 확장시킬 수 있게 되고, 이를 통해 경사하강법 최적화에서 사용할 수 있는 빨간색 경로를 따라 극 솟값을 탈출할 수 있게 된다. 여기서 빨간색 경로는 본 실시예에 따른 초반 학습인 에 의해 학습하는 경로 로 도시된 바와 같이 nonzero gradient를 통해 더 나은 LM으로 이동할 수 있다. 그리고 도면 상에서 초록생과 분홍색으로 분기되는 것은 상술한 를 두 가지 방법으로 구현한 경우로, 서 로 다른 방법으로 에 도달한 뒤 추가 학습인 에 기초하여 더 나은 LM에 도달하는 과정이다. 구체적으로 분홍색 경로는 학습부가 초반 학습인 에 의해 학습한 이후 본 실시예에 따른 에 포 함되는 후반 학습 에 의해 학습하는 경로이다. 이후 도시된 바와 같이 본 실시예에 따른 인공신경망 학습 장치는 후반 학습 를 수행한 이후 확장된 인공신경망 모델을 축소하는 에 의해 처음에 주어진 인공신경망 학습 모델로 돌아온 이후 추가적으로 에 기초하여 학습을 수행함으로써 더 나은 LM에 도달할 수 있다. 도면에서 projection으로 표시된 초록색 화살표는 본 발명의 일 실시예와는 달리, 후반 학습 에 의해 학습 하는 과정을 수행하지 않고 초반 학습인 에 기초해 학습한 후 곧바로 확장된 인공신경망 모델을 축소하는 에 의해 처음에 주어진 인공신경망 학습 모델로 돌아온 이후 추가적으로 에 기초하여 학습을 수행하 는 경로이다. 도시된 바와 같이 본 실시예에 따른 인공신경망 학습 장치는 기존 모델의 손실함수가 경사하강법으로 최소 화되어 극솟값(LM)에 도달한 경우 더 이상 손실함수의 값을 줄일 수 없다는 한계를 극복하여 더 나은 LM에 도달 되도록 함으로써 기존 모델의 성능 향상을 시도할 수 있게 된다. 한편, 도 3은, 본 발명의 일 실시예에 따른 극솟값 우회를 통한 인공신경망 학습 실패 극복 방법을 설명하기 위 한 흐름도이다. 본 실시예에 따른 극솟값 우회를 통한 인공신경망 학습 실패 극복 방법은 상술한 인공신경망 학습 장치에 의해 수행될 수 있으며, 인공신경망 학습 장치는 극솟값 우회를 통한 인공신경망 학습 실패 극복방법을 수행하기 위한 소프트웨어(어플리케이션)가(이) 설치되어 실행될 수 있다. 이러한 본 실시예에 따른 극솟값 우회를 통한 인공신경망 학습 실패 극복방법은 제1 학습단계(S100), 확장단계 , 제2 학습단계(S300), 축소단계 및 제3 학습단계(S500)를 포함할 수 있다. 제1 학습단계(S100)는 학습부가 경사하강법에 기초하여 주어진 인공신경망 모델의 학습을 수행하는 단계일 수 있다. 여기서 주어진 인공신경망 모델은 네트워크를 통해 외부 장치, 외부 서버 등으로부터 수신한 데이터이거나 입력 수단을 통해 사용자에 의해 직접 입력된 데이터일 수도 있다. 그리고 판단부에 의해 제1 학습단계에서 학습하고자 하는 파라미터가 극솟값에 도달된 것으로 판단되면, 확장부는 주어진 인공신경망 모델을 확장시키는 확장단계를 수행할 수 있다. 이러한 확장단계에서는 주어진 인공신경망 모델의 특정 레이어에서 학습가능한 활성화(learnable activation)를 추가하여 추가 파라미터를 도입함으로서 상기 인공신경망 모델을 확장시킬 수 있다. 확장단계에서는 상술한 바와 같이, 추가되는 파라미터의 수는 노드 수에 기초하여 노드 수만큼 추가될 수 도 있는 것은 물론, 확장하고자 하는 파라미터의 수는 사용자에 의해 사전에 임의로 설정되어 자유자재로 설정 될 수도 있다. 또한 확장단계에서 판단부가 학습하고자 하는 파라미터가 극솟값에 도달된 것으로 판단하는 기준으로, 제1 학습단계(S100)에서 수행되는 경사하강법에 기초한 손실함수 최소화 과정에서 속도가 느려지는 것을 감지한다. 해당 속도가 기설정된 임계범위 이내의 속도에 도달되면 파라미터가 극솟값에 도달된 것으로 판 단하고 이렇게 되면 능동적으로 극솟값을 탈출할 수 있게 된다. 이러한 기설정된 임계범위는 사용자에 의해 사 전에 설정 또는 변경될 수 있다. 여기서 극솟값의 도달 여부를 판단하는 기준은 상술한 기준에 한정되는 것은 아니며, 다양한 기준이 적용될 수 있을 것이다. 특히 확장단계를 수행하기 위한 조건으로 극솟값에 도달되는 기준이 아닌 사용자에 의해 계획된 시점에서 인공신경망 학습 모델을 확장시켜 최적화의 속도를 증가시키도록 할 수도 있다. 한편 확장단계를 통해 인 공신경망 모델이 확장되고 나면 학습부는 확장된 인공신경망 모델 상에서 학습을 수행하는 제2 학습단계 (S300)를 수행할 수 있다. 이 때 제2 학습단계(S300)는 경사하강법에 기초하여 상기 확장된 인공신경망 모델 상에서 학습을 진행하는 초반 학습단계 및 상기 초반 학습단계 이후에 기설정된 제약조건이 있는 최소화에 기초하여 상기 확장된 인공신경망 모델 상에서 학습을 수행하는 후반 학습단계를 포함할 수 있다. 초반 학습단계에서는 학습부가 별도의 제약조건없이 일반적인 경사하강법에 기초하여 손실함수를 최소화시 키는 과정을 통해 학습을 수행할 수 있다. 반면 후반 학습단계에서는 학습부가 상술한 최소화하고자 하는 손실함수 대신 별도의 제약조건에 기초한 최소화 과정을 수행하여 학습을 수행하게 되는 것이다. 제2 학습단계(S300)가 초반 및 후반의 학습단계로 구분되는 이유는 상술한 바와 같이 인공신경망 모델의 확장 직후의 위치에서 도입된 추가 파라미터의 대각선행렬이 0이기 때문에 시작과 동시에 KKT 조건을 만족시키게 되 므로 기존의 contrained optimization 알고리즘들을 직접 적용하기에는 어려움이 있다. 이를 해결하기 위해 본 발명에서의 제2 학습단계(S300)는 초반 및 후반 학습단계를 포함할 수 있다. 이후 판단부에 의해 제2 학습단계(S300)에서 기설정된 조건을 만족한것으로 판단되면, 축소부는 확장 된 인공신경망 모델이 처음에 주어진 인공신경망 모델로 돌아오도록 확장된 인공신경망 모델을 축소시키는 축소 단계를 수행할 수 있다. 여기서 처음에 주어진 인공신경망 모델로 돌아오기 위한 기설정된 조건은, 확장된 상기 특정 레이어의 가중치, 도입된 상기 추가 파라미터에 기초한 행렬 및 다음 레이어의 가중치의 곱이 0인 경우일 수 있다. 그러면 학습부 는 축소단계를 통해 돌아온 처음에 주어진 인공신경망 모델의 학습을 추가수행하는 제3 학습단계 (S500)를 수행할 수 있다. 본 실시예에서는 추가 파라미터에 기초한 행렬로 추가 파라미터의 대각선행렬(diagonal matrix)을 사용하였으나, 이에 한정되는 것은 아니며, 대각선행렬을 사용하지 않고, 필요에 따라 인공신경망 모델을 확장 할 때 entry-wise activation을 사용하는 것이 아닌 layer level에서 non-diagonal D를 사용하도록 할 수도 있 다. 한편, 도 4는 내지 도 7은 본 발명의 일 실시예에 따른 극솟값 우회를 통한 인공신경망 학습 실패 극복 방법의 효과를 설명하기 위한 도면이다. 먼저 도 4 내지 도 6에 도시된 그래프는, 3-layer와 151 파라미터 신경망을 사용하여 eggholder 함수로 생성된 100개 점에 대한 regression 결과로 실험 시 활성화(activation)로는 두 번째 레이어만 Relu를 사용하였고 나머 지는 Linear activation을 적용하였다. 모든 최소화 과정에서 기본 경사하강법을 사용하였으며 학습률(learning rate)은 제1 학습, 제2 학습 및 제3 학습인 에서 각각 3e-08, 3e-08, 1e-08을 사용하였 으며, 후반 학습단계인 에서 증가하는 값을 adgamma1은 선형성장으로 0.3t를 사용한 경우이고 adgamma2는 기하급수적인 성장으로 = 을 사용한 결과이다. 한편 도 7은 CIFAR10 데이터셋+Convnet 모델에서의 실험결과로, 여기서의 Convnet는 https://www.tensorflow.org/addons/tutorials/layers_weightnormalization에서 등장하는 reg_model을 의미하 며 총 62,006개의 파라미터로 구성된다. 해당 실험에서는 뒤쪽에서 두 번째와 세 번째에 학습가능한 활성화 (learnable activation)를 사용한 확장을 적용하였으며 도합 약 0.3%의 임의의 파라미터(temporary paramete r)를 사용하였다. 그리고 최적화(optimizer)는 Adam optimizer를 사용하였으며, learning rate는 에서 0.004,0.001,0.004를 각각 사용하였으며, 두 개의 레이어를 사용한 덕에 adgamma method에서 두 개의 gamma가 등장하게 되는데, 둘 다를 사용하여 점점 늘어나도록 설정하였다. 도 7은 이러한 실험조건에 기초하여 14번 반 복된 실험의 평균과 오차를 나타낸 그래프이고, 연두색의 projction은 본 발명에서와 달리 상술한 바와 같이 에서 초반 학습단계인 를 수행한 직후 인공신경망 모델을 축소하여 학습을 진행한 결과이고 노란색의 adgamma에 해당하는 결과가 본 실시예에 따른 극솟값 우회를 통한 인공신경망 학습 실패 극복방법에 해당하는 그래프이다. 본 발명에 따른 구성요소들은 물리적인 구분이 아니라 기능적인 구분에 의해서 정의되는 구성요소들로서 각각이 수행하는 기능들에 의해서 정의될 수 있다. 각각의 구성요소들은 하드웨어 또는 각각의 기능을 수행하는 프로그 램 코드 및 프로세싱 유닛으로 구현될 수 있을 것이며, 두 개 이상의 구성요소의 기능이 하나의 구성요소에 포 함되어 구현될 수도 있을 것이다. 따라서 이하의 실시예에서 구성요소에 부여되는 명칭은 각각의 구성요소를 물 리적으로 구분하기 위한 것이 아니라 각각의 구성요소가 수행되는 대표적인 기능을 암시하기 위해서 부여된 것 이며, 구성요소의 명칭에 의해서 본 발명의 기술적 사상이 한정되지 않는 것임에 유의하여야 한다. 이와 같은 본 발명의 극솟값 우회를 통한 인공신경망 학습 실패 극복방법은 다양한 컴퓨터 구성요소를 통하여 수행될 수 있는 프로그램 명령어의 형태로 구현되어 컴퓨터 판독 가능한 기록 매체에 기록될 수 있다. 상기 컴 퓨터 판독 가능한 기록 매체는 프로그램 명령어, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함 할 수 있다. 상기 컴퓨터 판독 가능한 기록 매체에 기록되는 프로그램 명령어는 본 발명을 위하여 특별히 설계되고 구성된 것들이거니와 컴퓨터 소프트웨어 분야의 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가능한 기록 매체의 예에는, 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체, CD- ROM, DVD 와 같은 광기록 매체, 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical media), 및 ROM, RAM, 플래시 메모리 등과 같은 프로그램 명령어를 저장하고 수행하도록 특별히 구성된 하드웨 어 장치가 포함된다. 프로그램 명령어의 예에는, 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사 용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드도 포함된다. 상기 하드웨어 장치는 본 발명에 따른 처 리를 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지이다."}
{"patent_id": "10-2021-0142648", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "이상에서는 본 발명의 다양한 실시예에 대하여 도시하고 설명하였지만, 본 발명은 상술한 특정의 실시예에 한정 되지 아니하며, 청구범위에서 청구하는 본 발명의 요지를 벗어남이 없이 당해 발명이 속하는 기술분야에서 통상 의 지식을 가진 자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 발명의 기술적 사 상이나 전망으로부터 개별적으로 이해되어져서는 안될 것이다."}
{"patent_id": "10-2021-0142648", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 인공신경망 학습 장치의 구성을 나태는 블록도, 도 2는 본 발명의 일 실시예에 따른 인공신경망 학습 장치에서 수행된 학습 결과를 설명하기 위한 도면, 도 3은, 본 발명의 일 실시예에 따른 극솟값 우회를 통한 인공신경망 학습 실패 극복 방법을 설명하기 위한 흐 름도, 그리고 도 4는 내지 도 7은 본 발명의 일 실시예에 따른 극솟값 우회를 통한 인공신경망 학습 실패 극복 방법의 효과를 설명하기 위한 도면이다."}
