{"patent_id": "10-2023-7023942", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0118182", "출원번호": "10-2023-7023942", "발명의 명칭": "지능형 메타 표면 조작 방법, 장치, 시스템, 지능형메타 표면 및 저장 매체", "출원인": "지티이 코포레이션", "발명자": "양 준"}}
{"patent_id": "10-2023-7023942", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "채널 정보 및 빔 조작조작 정보를 결정하는 단계;상기 채널 정보 및 상기 빔 조작 정보에 따라, 기설정된 목표 함수 중의 최적화될 조작 파라미터를 결정하는 단계;상기 최적화될 조작 파라미터에 따라, 지능형 메타 표면 상의 각 전자기 유닛의 목표 조작 상태를 결정하는 단계; 및상기 각 전자기 유닛의 현재 상태를 상기 목표 조작 상태로 조정하는 단계; 를 포함하는 지능형 메타 표면 조작방법."}
{"patent_id": "10-2023-7023942", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 채널 정보 및 빔 조작 정보를 결정하는 단계는,제1 통신 노드 또는 제2 통신 노드에 의해 송신되는 상기 채널 정보 및 상기 빔 조작 정보를 수신하는 단계;수신된 프로토콜 메시지에 따라 상기 채널 정보 및 제2 통신 노드의 위치를 산출하고, 상기 제2 통신 노드의 위치에 따라 상기 빔 조작 정보를 결정하는 단계; 중 하나를 포함하는 지능형 메타 표면 조작 방법."}
{"patent_id": "10-2023-7023942", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 채널 정보는 적어도 제1 통신 노드와 상기 지능형 메타 표면 사이의 채널 행렬, 상기 지능형 메타 표면과제2 통신 노드 사이의 채널 행렬을 포함하는 지능형 메타 표면 조작 방법."}
{"patent_id": "10-2023-7023942", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 빔 조작 정보는 적어도 빔 커버리지 영역의 정보를 포함하고; 상기 빔 커버리지 영역은 무선 전자기 신호가 강화되어야 하는 영역이며; 상기 빔 커버리지 영역의 개수는 적어도 하나이고; 상기 빔 커버리지 영역은 공간 내의 하나의 점 또는 하나의 기하학적 영역인 것을 특징으로 하는 지능형 메타 표면 조작 방법."}
{"patent_id": "10-2023-7023942", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4 항에 있어서,상기 빔 조작 정보는 빔 억제 영역의 정보를 더 포함하고; 상기 빔 억제 영역은 무선 전자기 신호가 약화(weakened)되어야 하는 영역이며; 상기 빔 억제 영역은 공간 내의 하나의 점 또는 하나의 기하학적 영역인 것을특징으로 하는 지능형 메타 표면 조작 방법."}
{"patent_id": "10-2023-7023942", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서,상기 빔 조작 정보는 모든 제1 유형 통신 노드의 위치 및 모든 제2 유형 통신 노드의 위치에 의해 결정되고; 상기 제1 유형 통신 노드는 상기 지능형 메타 표면이 서비스해야 하는 제2 통신 노드이며; 상기 제2 유형 통신 노드는 상기 지능형 메타 표면이 간섭을 회피해야 하는 제2 통신 노드이고; 상기 제1 유형 통신 노드의 위치는 빔커버리지 영역을 구성하며, 상기 제2 유형 통신 노드의 위치는 빔 억제 영역을 구성하는 것을 특징으로 하는 지능형 메타 표면 조작 방법.공개특허 10-2023-0118182-3-청구항 7 제 6 항에 있어서,상기 제1 유형 통신 노드의 개수와 상기 제2 유형 통신 노드의 개수, 및 상기 제1 유형 통신 노드의 위치와 상기 제2 유형 통신 노드의 위치의 결정 방식은 사전 구성, 실시간 측정 중 하나를 포함하는 지능형 메타 표면 조작 방법."}
{"patent_id": "10-2023-7023942", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1 항에 있어서,상기 기설정된 목표 함수는 제1 유형 통신 노드가 수신한 신호 강도, 제2 유형 통신 노드가 수신한 신호 강도,제1 유형 통신 노드가 수신한 평균 신호 강도 및 제2 유형 통신 노드가 수신한 평균 신호 강도에 의해 결정되는것을 특징으로 하는 지능형 메타 표면 조작 방법."}
{"patent_id": "10-2023-7023942", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1 항에 있어서,유전 알고리즘 또는 경사 하강 알고리즘을 사용하여 상기 기설정된 목표 함수 중의 최적화될 조작 파라미터를결정하는 것을 특징으로 하는 지능형 메타 표면 조작 방법."}
{"patent_id": "10-2023-7023942", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 1 항 내지 제 9 항 중 어느 한 항에 있어서,상기 지능형 메타 표면은 전자기 유닛 어레이로 구성되며; 상기 전자기 유닛 어레이는 동일하거나 상이한 유형의 전자기 유닛으로 구성되며; 상기 전자기 유닛 어레이는 평면 어레이, 곡면 어레이 중 하나를 포함하는 지능형 메타 표면 조작 방법."}
{"patent_id": "10-2023-7023942", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 1 항 내지 제 9 항 중 어느 한 항에 있어서,상기 전자기 유닛은 금속, 매체 재료 및 액정 재료 중의 일 종으로 구성되며; 상기 전자기 유닛의 크기는 서브파장 매그니튜드이고; 상기 전자기 유닛은 상기 전자기 유닛의 표면에 충돌하는 전자파에 대해 조작을 수행하도록 구성되며;상기 전자기 유닛에 조작 가능한 전자기 속성은 전자파 진폭, 위상 및 분극 방향 중의 하나를 포함하고;상기 전자기 유닛은 저항, 커패시턴스, 다이오드, 가변 용량 다이오드 및 트라이오드 등 조절 가능한 전자 소자중 하나를 포함하는 지능형 메타 표면 조작 방법."}
{"patent_id": "10-2023-7023942", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "채널 정보 및 빔 조작 정보를 결정하도록 구성된 제1 결정 모듈;상기 채널 정보 및 상기 빔 조작 정보에 따라, 기설정된 목표 함수 중의 최적화될 조작 파라미터를 결정하도록구성된 제2 결정 모듈;상기 최적화될 조작 파라미터에 따라, 지능형 메타 표면 상의 각 전자기 유닛의 목표 조작 상태를 결정하도록구성된 제3 결정 모듈; 및상기 각 전자기 유닛의 현재 상태를 상기 목표 조작 상태로 조정하도록 구성된 조정기; 를 포함하는 지능형 메타 표면 조작 장치."}
{"patent_id": "10-2023-7023942", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "통신 모듈, 메모리, 및 적어도 하나의 프로세서를 포함하고;상기 통신 모듈은 제1 통신 노드 및 제2 통신 노드와 통신 인터랙션을 수행하도록 구성되며;공개특허 10-2023-0118182-4-상기 메모리는 적어도 하나의 프로그램을 저장하도록 구성되고;상기 적어도 하나의 프로그램이 상기 적어도 하나의 프로세서에 의해 실행되면, 상기 적어도 하나의 프로세서가제 1 항 내지 제 11 항 중 어느 한 항에 따른 지능형 메타 표면 조작 방법을 구현하도록 하는 것을 특징으로 하는 지능형 메타 표면."}
{"patent_id": "10-2023-7023942", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "적어도 하나의 제1 통신 노드, 적어도 하나의 제2 통신 노드 및 적어도 하나의 지능형 메타 표면을 포함하고;상기 제1 통신 노드는 유선 또는 무선 방식으로 상기 지능형 메타 표면과 시그널링 연동을 수행하며; 상기 제2통신 노드는 무선 방식으로 상기 지능형 메타 표면과 시그널링 연동을 수행하고; 하나의 제1 통신 노드, 하나의지능형 메타 표면 및 적어도 하나의 제2 통신 노드로 하나의 빔 최적화 조작 그룹을 구성하며, 상기 하나의 빔최적화 조작 그룹은 제 1 항 내지 제 11 항 중 어느 한 항에 따른 지능형 메타 표면 조작 방법에 따라 무선 전자파에 대해 최적화 조작을 수행하도록 구성되는 것을 특징으로 하는 지능형 메타 표면 조작 시스템."}
{"patent_id": "10-2023-7023942", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "컴퓨터 프로그램이 저장되어 있는 저장 매체에 있어서,상기 컴퓨터 프로그램이 프로세서에 의해 실행될 경우, 제 1 항 내지 제 11 항 중 어느 한 항에 따른 지능형 메타 표면 조작 방법을 구현하는 것을 특징으로 하는 저장 매체."}
{"patent_id": "10-2023-7023942", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 지능형 메타 표면 조작 방법, 장치, 시스템, 지능형 메타 표면 및 저장 매체를 제공한다. 해당 지능형 메타 표면 조작 방법은 채널 정보 및 빔 조작 정보를 결정하는 단계(S100); 채널 정보 및 빔 조작 정보에 따라, 기설정된 목표 함수 중의 최적화될 조작 파라미터를 결정하는 단계(S110); 최적화될 조작 파라미터에 따라, 지능 형 메타 표면 상의 각 전자기 유닛의 목표 조작 상태를 결정하는 단계(S120); 및 각 전자기 유닛의 현재 상태를 목표 조작 상태로 조정하는 단계(S130); 를 포함한다. 해당 조작 방법은 다중 사용자 시나리오에서의 신호 강화 및 간섭 억제를 구현하였다."}
{"patent_id": "10-2023-7023942", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 출원은 통신 분야에 관한 것으로, 예를 들어, 지능형 메타 표면 조작 방법, 장치, 시스템, 지능형 메타 표면 및 저장 매체에 관한 것이다."}
{"patent_id": "10-2023-7023942", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "5세대 이동통신 기술(5th-Generation, 5G) 네트워크의 상용화는 다른 산업과 응용의 발전을 촉진시켰으며, 이는 초대역폭, 초저지연, 초밀집 접속, 초고신뢰성 등을 포함하는 통신 네트워크에 대해 더 높은 요구를 제시하였다. 따라서, 송신단과 수신단 사이의 무선 전자기 환경을 스마트하게 개조하는 방법이 특히 중요해졌다. 여기서, 송신단과 수신단 사이의 무선 자기 환경을 개조할 때, 지능형 메타 표면은 핵심적인 역할 을 한다. 지능형 메타 표면 빔 조작의 연구는 주로 단일 사용자 시나리오에 집중되어 있으나, 실제 응용 시나리 오에서는 하나의 지능형 메타 표면이 복수의 단말 사용자에게 동시에 서비스를 제공해야 한다. 따라서, 다중 사 용자 시나리오에서의 신호 강화 및 간섭 억제를 구현하는 것은 시급히 해결해야 할 문제이다."}
{"patent_id": "10-2023-7023942", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 출원의 실시예는 다중 사용자 시나리오에서의 신호 강화 및 간섭 억제를 구현하는 지능형 메타 표면 조작 방 법, 장치, 시스템, 지능형 메타 표면 및 저장 매체를 제공한다."}
{"patent_id": "10-2023-7023942", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 출원의 실시예는 지능형 메타 표면 조작 방법을 제공하며, 상기 방법은, 채널 정보 및 빔 조작 정보를 결정하는 단계; 채널 정보 및 빔 조작 정보에 따라, 기설정된 목표 함수 중의 최 적화될 조작 파라미터를 결정하는 단계; 상기 최적화될 조작 파라미터에 따라, 지능형 메타 표면 상의 각 전자 기 유닛의 목표 조작 상태를 결정하는 단계; 및 상기 전자기 유닛의 현재 상태를 목표 조작 상태로 조정하는 단 계; 를 포함한다. 본 출원의 실시예는 지능형 메타 표면 조작 장치를 제공하며, 상기 장치는, 채널 정보 및 빔 조작 정보를 결정하도록 구성된 제1 결정 모듈; 채널 정보 및 빔 조작 정보에 따라, 기설정된 목표 함수 중의 최적화될 조작 파라미터를 결정하도록 구성된 제2 결정 모듈; 상기 최적화될 조작 파라미터에따라, 지능형 메타 표면 상의 각 전자기 유닛의 목표 조작 상태를 결정하도록 구성된 제3 결정 모듈; 및 상기 전자기 유닛의 현재 상태를 목표 조작 상태로 조정하도록 구성된 조정기; 를 포함한다. 본 출원의 실시예는 지능형 메타 표면을 제공하며, 상기 지능형 메타 표면은 통신 모듈, 메모리, 및 하나 또는 복수의 프로세서를 포함하고; 상기 통신 모듈은 제1 통신 노드 및 제2 통신 노드와 통신 인터랙션을 수행하도록 구성되며; 상기 메모리는 하나 또는 복수의 프로그램을 저장하도록 구성되며; 상기 하나 또는 복수의 프로그램 이 상기 하나 또는 복수의 프로세서에 의해 실행되면, 상기 하나 또는 복수의 프로세서가 상기 임의의 실시예에 따른 지능형 메타 표면 조작 방법을 구현하도록 한다. 본 출원의 실시예는 지능형 메타 표면 조작 시스템을 제공하며, 상기 시스템은 적어도 하나의 제1 통신 노드, 적어도 하나의 제2 통신 노드 및 적어도 하나의 지능형 메타 표면을 포함하고; 상기 제1 통신 노드는 유선 또는 무선 방식으로 지능형 메타 표면과 시그널링 연동을 수행하며; 상기 제2 통신 노드는 무선 방식으로 지능형 메 타 표면과 시그널링 연동을 수행하고; 하나의 상기 제1 통신 노드, 하나의 상기 지능형 메타 표면 및 적어도 하 나의 상기 제2 통신 노드로 하나의 빔 최적화 조작 그룹을 구성하며, 하나의 빔 최적화 조작 그룹은 상기 임의 의 실시예에 따른 지능형 메타 표면 조작 방법에 따라 무선 전자파에 대해 최적화 조작을 수행하도록 구성된다. 본 출원의 실시예는 저장 매체를 제공하며, 상기 저장 매체에는 컴퓨터 프로그램이 저장되어 있고, 상기 컴퓨터 프로그램이 프로세서에 의해 실행되면, 상기 임의의 실시예에 따른 지능형 메타 표면 조작 방법을 구현한다."}
{"patent_id": "10-2023-7023942", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부 도면에 결부하여 본 출원의 실시예를 설명한다. 이하, 실시예 및 도면에 결부하여 본 출원을 설명하 며, 제시된 예시는 본 출원을 해석하는 데만 사용된다. 지능형 메타 표면(intelligent metasurface)은 다수의 수동적인 전자기 유닛으로 구성된 2차원 평면 어레이로, 이러한 전자기 유닛은 일정한 규칙에 따라 배열되며 그 두께는 무시할 수 있다. 이러한 특수 설계된 전자기 유 닛은 자연계 중의 재료에 없는 물리적 특성을 나타내기 때문에, 이러한 인공 전자기 유닛으로 구성된 2차원 어 레이는 메타 표면(meta-surface)이라고도 한다. 각 전자기 유닛은 특정 모양의 금속 또는 매체 물질로 구성되며, 전자 소자와 연결되며, 전자 소자는 패널 상의 스마트 컨트롤러에 의해 제어되며, 전자기 유닛의 전 자기 속성(예: 평균 투자율, 평균 유전율)의 독립적인 조정을 구현할 수 있다. 전자기 유닛의 전자기 속성에 대 한 조작(manipulate)을 통해, 전자기 유닛의 표면에 입사된 전자기 신호를 상이한 진폭, 위상, 분극 방향 등으 로 반사 또는 투과하여, 기지국과 사용자 단말 사이에서 가상 다이렉트 경로를 구축할 수 있으며, 이로써 공간 전자기 환경을 지능적으로 조작하는 목적을 달성한다. 도 1은 본 출원의 실시예에서 제공하는 지능형 메타 표면 의 구조 개략도이며, 도 1에 도시된 바와 같이, 지능형 메타 표면은 스마트 컨트롤러에 의해 각 전자기 유닛에 동시에 독립적인 제어 명령을 송신하여, 전자기 유닛의 표면에 입사된 전자파가 반사 또는 투과될 때, 진폭, 위 상 또는 분극 방향이 상응하게 변화하도록 하고, 모든 전자기 유닛에 의해 반사 또는 투과된 전자파가 공간에서 중첩되어 빔포밍 효과를 생성하며, 결국 특정 단말기에 의해 수신된다. 무선 통신 시스템에 지능형 메타 표면을 도입함으로써, 공간 자원의 확장 및 효율적인 활용을 구현할 수 있으며, 무선 통신 시스템의 채널 용량의 향상, 통신의 신뢰성 및 적용 범위의 향상, 송신 전력 소비의 감소, 및 비용 절감 등에 도움이 된다. 실제 응용 시나리오에서, 하나의 지능형 메타 표면은 복수의 단말 사용자를 동시에 서비스해야 하므로, 기지국 에 의해 송신된 신호는 지능형 메타 표면에 의해 조작된 후, 복수의 사용자 방향에서 신호의 강화를 동시에 구 현해야 하는바, 즉, 기지국에 의해 송신된 신호는 지능형 메타 표면에 도달한 후, 복수의 강한 빔으로 나뉘고 이는 각각 상이한 사용자를 향한다. 한편, 지능형 메타 표면에 의해 조작된 후 생성된 복수의 빔은 강한 부엽 (side lobe)을 가질 수 있으며, 이러한 부엽은 인접한 셀의 사용자 신호를 간섭할 수 있으므로, 이때 이런 방향 에 대한 부엽을 억제하여 간섭을 줄여야 한다. 도 2는 본 출원의 실시예에서 제공하는 지능형 메타 표면이 보조 하는 무선 통신 시스템의 개략도이다. 도 2에 도시된 바와 같이, 셀 가장자리에 위치한 지능형 메타 표면은 빔 커버리지(Beam coverage) 및 빔 억제를 실시하여, 본 셀(셀 1)의 사용자 1, 사용자 2 및 사용자 3을 서비스하면 서, 인접한 셀(셀 2)의 사용자 4 및 사용자 5에 대한 간섭을 최대한 방지하여야 한다. 지능형 메타 표면 빔 조 작의 연구는 주로 단일 사용자 시나리오에 집중되어 있어, 다중 사용자 경우의 신호 강화 및 간섭 억제를 고려 하는 경우가 적다. 이를 감안하여, 본 출원의 실시예는 다중 사용자 시나리오에서의 신호 강화 및 신호 간섭 억제를 구현하는 지능 형 메타 표면 조작 방법를 제안한다. 일 실시예에서, 도 3은 본 출원의 실시예에서 제공하는 지능형 메타 표면 조작 방법의 흐름도이다. 본 실시예는 지능형 메타 표면 또는 제1 통신 노드에 의해 수행될 수 있다. 여기서, 제1 통신 노드는 네트워크 측(예를 들어, 무선 기지국)을 의미하고; 제2 통신 노드는 단말 측(예를 들어, 사용자 장치, 무선 단말기)을 의미한다. 일 실시예에서, 지능형 메타 표면으로 본 실시예를 수행하는 방안을 예로 하여, 지능형 메타 표면 조작 과정을 설명한다. 도 3에 도시된 바와 같이, 본 실시예는 단계(S100) 내지 단계(S130)를 포함한다. 단계(S100), 채널 정보 및 빔 조작 정보를 결정한다. 일 실시예에서, 채널 정보 및 빔 조작 정보를 결정하는 단계는, 제1 통신 노드 또는 제2 통신 노드에 의해 송신되는 채널 정보 및 빔 조작 정보를 수신하는 단계; 수신된 프로 토콜 메시지에 따라 채널 정보 및 제2 통신 노드의 위치를 산출하고, 제2 통신 노드의 위치에 따라 빔 조작 정 보를 결정하는 단계; 중 하나를 포함한다. 일 실시예에서, 지능형 메타 표면이 제1 통신 노드 또는 제2 통신 노드에 의해 송신되는 채널 정보 및 빔 조작 정보를 수신한 경우, 지능형 메타 표면과 제1 통신 노드 또는 제2 통신 노드 사이에 통신 접속을 확립하고, 제1 통신 노드 또는 제2 통신 노드를 통해 프로토콜 메시지에 따라 채널 정보 및 제2 통신 노드의 위치를 산출하며, 제2 통신 노드의 위치에 따라 빔 조작 정보를 결정한 후, 채널 정보 및 빔 조작 정보를 지능형 메타 표면으로 송신한다. 일 실시예에서, 지능형 메타 표면은 채널 정보 및 빔 조작 정보를 능동적으로 측정 및 결정할 수 있 으며, 즉 지능형 메타 표면에 능동 측정 유닛을 마련하여, 표준 프로토콜 메시지를 송신, 수신 및 처리할 수 있 으며, 지능형 메타 표면은 수신된 프로토콜 메시지에 따라 능동적으로 채널 정보 및 제2 통신 노드의 위치를 측 정하고, 측정된 제2 통신 노드의 위치에 따라 빔 조작 정보를 결정한다. 여기서, 수신된 프로토콜 메시지에 따 라 채널 정보 및 제2 통신 노드의 위치를 산출하는 방식은 관련 기술을 참조할 수 있으며, 여기서 중복 설명하 지 않는다. 단계(S110), 채널 정보 및 빔 조작 정보에 따라, 기설정된 목표 함수 중의 최적화될 조작 파라미터를 결정한다. 실시예에서, 채널 정보는 무선 기지국과 지능형 메타 표면 사이, 지능형 메타 표면과 무선 단말기 사이의 채널 상태를 나타내기 위한 것이며, 예를 들어, 채널 정보는 무선 신호가 채널을 통해 전파된 후의 게인, 위상 변화, 간섭 수준 등을 포함할 수 있고; 빔 조작 정보는 빔 지향 방향을 의미하며, 빔 조작 정보는 적어도 빔 커버리지 영역의 정보를 포함하고; 빔 억제 영역의 정보를 포함할 수도 있다. 일 실시예에서, 빔 커버리지 영역 및 빔 억 제 영역은 실시간 검출에 의해 얻어지거나 미리 구성된 제1 유형 통신 노드의 위치 및 제2 유형 통신 노드의 위 치에 의해 구성될 수 있다. 일 실시예에서, 지능형 메타 표면이 독립적으로 작동하고, 내부에 측정 유닛을 구성 하지 않은 경우, 즉 지능형 메타 표면과 제1 통신 노드 간에 통신 접속되지 않고, 지능형 메타 표면 내부에 측 정 유닛을 포함하지 않은 경우, 제1 유형 통신 노드의 위치와 제2 유형 통신 노드의 위치는 미리 구성할 수 있 고, 지능형 메타 표면의 메모리에 저장되어, 지능형 메타 표면이 미리 저장된 제1 유형 통신 노드의 위치 및 제 2 유형 통신 노드의 위치에 따라 빔 커버리지 영역 및 빔 억제 영역, 즉 지능형 메타 표면의 빔 지향 방향을 결 정하도록 한다. 일 실시예에서, 지능형 메타 표면 내에 측정 유닛을 구성하거나, 지능형 메타 표면과 제1 통신 노드의 통신 접속을 확립한 경우, 지능형 메타 표면 또는 제1 통신 노드 내의 측정 유닛을 통해 채널 정보 및 빔 조작 정보를 측정하여 얻을 수 있다.일 실시예에서, 기설정된 목표 함수는 제1 유형 통신 노드가 수신한 신호 강도, 제2 유형 통신 노드가 수신한 신호 강도, 제1 유형 통신 노드가 수신한 평균 신호 강도 및 제2 유형 통신 노드가 수신한 평균 신호 강도에 의 해 결정된다. 여기서, 제1 유형 통신 노드는 지능형 메타 표면이 서비스해야 하는 제2 통신 노드를 의미하고; 제2 유형 통신 노드는 지능형 메타 표면이 간섭을 회피해야 하는 제2 통신 노드이다. 여기서, 제2 통신 노드는 사용자 장치(사용자라고도 함)를 의미한다. 도 2에 도시된 바와 같이, 지능형 메타 표면이 서비스해야 하는 제2 통신 노드는 사용자 1, 사용자 2 및 사용자 3을 포함하며; 간섭을 회피해야 하는 제2 통신 노드는 사용자 4 및 사용자 5를 포함한다. 사용자 1, 사용자 2 및 사용자 3은 제1 유형 통신 노드이고; 사용자 4 및 사용자 5는 제2 유형 통신 노드라고 이해할 수 있다. 실시예에서, 최적화될 조작 파라미터는 기설정된 목표 함수가 최소값으로 되는 경우에 대응되는 파라미터를 의 미한다. 예시적으로, 최적화될 조작 파라미터는 진폭, 위상을 포함할 수 있다. 실시예에서, 제1 유형 통신 노드 가 수신한 신호 강도, 제2 유형 통신 노드가 수신한 신호 강도, 제1 유형 통신 노드가 수신한 평균 신호 강도 및 제2 유형 통신 노드가 수신한 평균 신호 강도를 이용하여 기설정된 목표 함수를 구축한 후, 기설정된 목표 함수가 최소값을 취할 때까지 채널 정보 및 빔 조작 정보를 조정하여, 대응되는 최적화될 조작 파라미터를 결정 할 수 있다. 단계(S120), 최적화될 조작 파라미터에 따라, 지능형 메타 표면 상의 각 전자기 유닛의 목표 조작 상태를 결정 한다. 단계(S130), 전자기 유닛의 현재 상태를 목표 조작 상태로 조정한다. 실시예에서, 목표 조작 상태는 전자기 유닛이 도달하려는 상태를 의미한다. 실시예에서, 최적화될 조작 파라미 터에 따라 각 전자기 유닛이 도달하려는 목표 조작 상태를 결정한 후, 전자기 유닛 중의 전자 소자를 조작하여, 전자기 유닛의 현재 상태를 목표 조작 상태로 조정한다. 실시예에서, 제1 통신 노드에 의해 송신되는 무선 전자기 신호가 지능형 메타 표면에 도달한 후, 지능형 메타 표면은 최적화될 조작 파라미터에 따라 각 전자기 유닛 중 전자 소자의 상태를 조정하여, 전자기 유닛이 목표 조작 상태에 도달하도록 함으로써, 더욱 많은 신호 에너지가 지능형 메타 표면이 서비스해야 하는 제2 통신 노 드에 집중되도록 하여, 신호 대 잡음비 및 커버리지 범위의 향상을 구현하다. 즉 서비스해야 하는 제2 통신 노 드의 수신 신호를 강화하고, 회피해야 하는 제2 통신 노드의 간섭 신호를 억제하였다. 일 실시예에서, 지능형 메타 표면 조작 방법이 제1 통신 노드에 의해 수행되는 경우, 제1 통신 노드는 수신된 프로토콜 메시지에 따라 채널 정보 및 제2 통신 노드의 위치를 산출하고, 제2 통신 노드의 위치에 따라 빔 조작 정보를 결정한다. 그 후, 채널 정보 및 빔 조작 정보에 따라 기설정된 목표 함수 중의 최적화될 조작 파라미터 를 산출하고, 최적화될 조작 파라미터에 따라 지능형 메타 표면 상의 각 전자기 유닛의 목표 조작 상태를 결정 한다. 이어서, 목표 조작 상태에 대응되는 조작 명령을 생성하여 지능형 메타 표면에 송신함으로써, 지능형 메 타 표면이 조작 명령에 따라 전자기 유닛의 현재 상태를 목표 조작 상태로 조정하도록 한다. 일 실시예에서, 채널 정보는 적어도 제1 통신 노드와 지능형 메타 표면 사이의 채널 행렬, 지능형 메타 표면과 제2 통신 노드 사이의 채널 행렬을 포함한다. 일 실시예에서, 빔 조작 정보는 적어도 빔 커버리지 영역의 정보를 포함하고; 빔 커버리지 영역은 무선 전자기 신호가 강화되어야 하는 영역이며; 빔 커버리지 영역의 개수는 적어도 하나이고; 빔 커버리지 영역은 공간 내의 하나의 점 또는 하나의 기하학적 영역이다. 일 실시예에서, 빔 조작 정보는 빔 억제 영역의 정보를 더 포함하고; 빔 커버리지 영역은 무선 전자기 신호가 강화되어야 하는 영역이며; 빔 억제 영역은 무선 전자기 신호가 약화(weakened)되어야 하는 영역이고; 빔 억제 영역은 공간 내의 하나의 점 또는 하나의 기하학적 영역이다. 실시예에서, 빔 커버리지 영역은 지능형 메타 표면이 서비스해야 하는 제2 통신 노드가 위치한 영역을 의미하고; 빔 억제 영역은 지능형 메타 표면이 간섭을 회피해야 하는 제2 통신 노드가 위치한 영역을 의미한다. 여기서, 빔 커버리지 영역의 개수는 적어도 하나이고; 빔 커버리지 영역 및 빔 억제 영역은 모두 공간 내의 하 나의 점 또는 하나의 기하학적 영역이다. 빔 커버리지 영역은 하나 또는 복수 개 일 수 있는 반면, 빔 억제 영 역은 없거나 하나 또는 복수 개일 수 있는 것으로 이해할 수 있다. 지능형 메타 표면이 간섭을 회피해야 하는 제2 통신 노드가 존재하지 않는 경우, 빔 조작 정보는 빔 커버리지 영역의 정보만 포함할 수 있다고 이해할 수 있다.일 실시예에서, 빔 조작 정보는 모든 제1 유형 통신 노드의 위치 및 모든 제2 유형 통신 노드의 위치에 의해 결 정되고; 제1 유형 통신 노드는 지능형 메타 표면이 서비스해야 하는 제2 통신 노드이며; 제2 유형 통신 노드는 지능형 메타 표면이 간섭을 회피해야 하는 제2 통신 노드이고; 제1 유형 통신 노드의 위치는 빔 커버리지 영역 을 구성하며, 상기 제2 유형 통신 노드의 위치는 빔 억제 영역을 구성한다. 일 실시예에서, 제1 유형 통신 노드의 개수와 제2 유형 통신 노드의 개수, 및 제1 유형 통신 노드의 위치와 제2 유형 통신 노드의 위치를 결정하는 방식은 사전 구성, 실시간 측정 중의 하나를 포함한다. 일 실시예에서, 지능 형 메타 표면이 독립적으로 작동하고, 내부에 측정 유닛을 구성하지 않은 경우, 즉 지능형 메타 표면과 제1 통 신 노드 간에 통신 접속되지 않고, 지능형 메타 표면 내부에 측정 유닛을 포함하지 않은 경우, 제1 유형 통신 노드의 위치와 개수, 및 제2 유형 통신 노드의 위치와 개수는 사전 구성될 수 있다. 일 실시예에서, 지능형 메 타 표면 내에 측정 유닛을 구성하거나, 지능형 메타 표면과 제1 통신 노드가 통신 접속을 확립한 경우, 지능형 메타 표면 또는 제1 통신 노드 내의 측정 유닛을 통해 제1 유형 통신 노드의 위치와 개수, 및 제2 유형 통신 노 드의 위치와 개수를 측정하여 얻을 수 있다. 일 실시예에서, 유전 알고리즘(Genetic Algorithm) 또는 경사 하강 알고리즘(Gradient Descent)을 사용하여 기 설정된 목표 함수 중의 최적화될 조작 파라미터를 결정한다. 일 실시예에서, 지능형 메타 표면은 전자기 유닛 어레이로 구성되고; 전자기 유닛 어레이는 동일하거나 상이한 유형의 전자기 유닛으로 구성되며; 전자기 유닛 어레이는 평면 어레이, 곡면 어레이 중 하나를 포함한다. 일 실시예에서, 전자기 유닛은 금속, 매체 재료 및 액정 재료로 구성되며, 크기는 서브 파장 매그니튜드(sub- wavelength magnitude)이고, 상기 전자기 유닛의 표면에 입사된 전자파를 조작하며; 전자기 유닛에 조작 가능한 전자기 속성은 전자파 진폭, 위상 및 분극 방향 중의 하나를 포함하고; 전자기 유닛은 저항, 커패시턴스, 다이 오드, 가변 용량 다이오드 및 트라이오드 등 조절 가능한 전자 소자 중 하나를 포함한다. 일 실시예에서, 제1 통신 노드가 기지국이고, 제2 통신 노드가 사용자 장치(단말 장치라고도 함)인 경우를 예로 들어, 지능형 메타 표면의 구조 및 실시형태에 대해 설명한다. 실시예에서, 지능형 메타 표면은 무선 전자파 빔 의 조작에 사용될 수 있다. 여기서, 지능형 메타 표면은 인공 전자기 유닛으로 구성된 반사 또는 투과 어레이로 구성될 수 있고, 스마트 컨트롤러에 의해 각 전자기 유닛을 제어하며, 전자기 유닛은 제어 명령에 따라 표면에 충돌하는(impinging to) 전자파에 대해 특정 전자기 응답을 발생시켜, 입사 전자파를 조작함으로써, 지능형 표 면에 의해 반사 또는 투과된 후의 전자파가 진폭, 위상, 분극 방향 등 변화가 발생하도록 한다. 따라서, 무선 기지국에 의해 송신된 무선 전자기 신호는 지능형 메타 표면에 도달한 후 조작되어, 더욱 많은 신호 에너지가 지능형 메타 표면이 서비스하는 단말 장치에 집중됨으로써, 신호 대 잡음비 및 커버리지 범위의 향상을 구현한 다. 실시예에서, 지능형 메타 표면의 특징은 전자기 조작 능력을 구비한 전자기 유닛으로 구성된 어레이인 특징; 채 널 정보 및 빔 조작 정보를 수신하거나 측정할 수 있는 특징; 채널 정보 및 빔 조작 정보에 따라 전자기 유닛의 조작 상태를 조정하는 특징; 을 포함한다. 일 실시예에서, 지능형 메타 표면이 전자기 조작 능력을 구비한 전자기 유닛으로 구성된 어레이로 구성되는 경 우에 대해 설명한다. 전자기 유닛은 금속, 매체 재료 또는 액정 재료로 구성되며, 이의 두께는 무시할 수 있다. 각 전자기 유닛의 크기는 서브 파장 매그니튜드이므로, 전자파 진폭, 위상, 분극 방향 등 전자기 속성의 조작을 포함하는 입사 전자파를 조작하는 독특한 능력을 구비한다. 전자기 유닛은 저항, 커패시턴스, 다이오드, 가변 용량 다이오드, 트라이오드 등과 같은 조절 가능한 전자 소자을 더 포함하고, 전자 소자의 상태를 제어함으로써, 전자기 유닛은 입사 전자파의 조작 특성을 동적으로 조정할 수 있다. 전자기 유닛이 조작 가능한 전자 소자를 포함하지 않은 경우, 고정된 전자기 조작 특성을 구비한다. 지능형 메타 표면은 동일하거나 상이한 유형의 전자기 유닛으로 구성될 수 있으며, 상이한 유형의 전자기 유닛 은 상이한 물리적 구조를 구비하거나 상이한 전자 소자로 연결되므로, 상이한 전자기 응답 특성을 구비한다. 이 러한 동일하거나 상이한 유형의 전자기 유닛은 일정한 규칙에 따라 배열되어 함께 전자기 유닛 어레이를 형성하 고, 공간 전자기 조작 능력을 구비한 하나의 지능형 메타 표면을 구성한다. 상기 전자기 유닛 어레이는 사각형 어레이, 환형 어레이 등과 같은 평면 어레이일 수 있으며, 구면 어레이, 포물면 어레이, 이중 곡면 어레이 등과 같은 곡면 어레이일 수도 있다. 지능형 메타 표면은 필요에 따라 실외 또는 실내에 배치될 수 있다. 실외 시나 리오에서, 지능형 메타 표면은 건물 외부 입면 또는 고정하기 편리한 기타 위치에 설치될 수 있다. 실내 시나리 오에서, 지능형 메타 표면은 천장, 벽 또는 고정하기 편리한 기타 위치에 설치될 수 있다.일 실시예에서, 지능형 메타 표면이 채널 정보 및 빔 조작 정보를 수신하거나 측정할 수 있는 경우에 대해 설명 한다. 실시예에서, 지능형 메타 표면은 유선 또는 무선 방식을 통해 기지국과 통신할 수 있다. 하나의 경우, 지 능형 메타 표면은 기지국 또는 단말 장치에 의해 송신되는 채널 정보 및 빔 조작 정보를 수동적으로 수신할 수 있고, 다른 하나의 경우, 지능형 메타 표면은 채널 정보 및 빔 조작 정보를 능동적으로 측정할 수 있다. 지능형 메타 표면이 채널 정보 및 빔 조작 정보를 능동적으로 측정하는 경우, 지능형 메타 표면에는 표준 프로토콜 메 시지를 송신, 수신 및 처리할 수 있는 능동 측정 유닛을 구비함으로써, 채널 정보 및 단말 위치 정보를 산출하 고, 단말 위치 정보에 따라 빔 조작 정보를 결정한다. 실시예에서, 지능형 메타 표면은 기지국과 통신하지 않고 독립적으로 작동할 수도 있다. 일 실시예에서, 지능형 메타 표면이 채널 정보 및 빔 조작 정보를 획득한 후, 채널 정보 및 빔 조작 정보에 따 라 전자기 유닛의 현재 조작 상태를 조정한다. 실시예에서, 지능형 메타 표면은 채널 정보 및 빔 조작 정보를 능동적 또는 수동적으로 획득할 수 있다. 실시예에서, 빔 조작 정보는 빔 커버리지 영역 정보 및 빔 억제 영역 정보를 포함한다. 여기서, 빔 커버리지 영역은 무선 전자기 신호가 강화되어야 하는 영역을 의미하고, 일반적으 로 해당 영역의 사용 가능한 신호 커버리지 및 신호 품질의 향상을 구현하기 위한 것이며, 1개 또는 복수의 빔 커버리지 영역이 있을 수 있다. 빔 억제 영역은 무선 전자기 신호가 약화되어야 하는 영역을 의미하고, 일반적 으로 해당 영역의 단말 장치에 대한 간섭 신호의 영향을 저하시키기 위한 것이며, 0개, 1개 또는 복수 개의 빔 억제 영역이 있을 수 있다. 빔 조작 정보에 따라, 지능형 메타 표면은 자신이 반사 또는 투과한 전자파를 빔 커 버리지 영역에 최대한 많이 집중시키고, 빔 억제 영역에 최대한 적게 집중시켜야 한다. 지능형 메타 표면이 수신한 채널 정보 및 빔 조작 정보에 따라, 본 출원의 실시예에서의 전자기 패널 상태 조작 방법을 사용하여, 지능형 메타 표면 상의 각 전자기 유닛의 조작 상태를 결정한다. 여기서, 전자기 유닛의 조작 상태는 지능형 메타 표면 제어 회로의 출력 레벨과 일일이 대응된다. 결정된 조작 상태에 따라 지능형 메타 표 면 제어 회로의 출력 레벨을 조정하여, 전자기 유닛 상의 전자 소자의 상태를 변화시킴으로써, 전자기 유닛 조 작 상태의 조정을 구현하고, 최종적으로 전자기 빔 조작 목표를 구현한다. 지능형 메타 표면이 독립적으로 작동 하는 경우, 설치 및 배치하기 전에, 기타 방식으로 획득한 채널 정보 및 빔 조작 정보를 지능형 메타 표면시스 템의 메모리에 기입해야 하고, 지능형 메타 표면은 기입된 정보에 따라 조작 상태 최적화를 완료한다. 설치 및 배치가 완료된 후, 지능형 메타 표면시스템 메모리 중의 채널 정보 및 빔 조작 정보를 다시 업데이트함으로써, 지능형 메타 표면을 트리거하여 조작의 최적화를 다시 실시하도록 할 수도 있다. 일 실시예에서, 도 4는 본 출원의 실시예에서 제공하는 또 다른 지능형 메타 표면 조작 방법의 흐름도이다. 본 실시예의 방법은 단일 전자기 파라미터(진폭, 위상 중 하나) 조작의 프리 코딩 최적화에 사용된다. 지능형 메타 표면 전자기 상태의 조작을 최적화하는 것은 빔 커버리지 영역 및 빔 억제 영역이 주어진 조건에서, 지능형 메 타 표면 상의 각 전자기 유닛에 필요한 조작 상태를 결정하여, 지능형 메타 표면에 의해 투과 또는 반사된 전자 파가 빔 커버리지 영역에 최대한 많이 집중되고, 빔 억제 영역에 최대한 적게 집중되도록 하는 것을 의미한다. 예를 들어, 위상 조작 능력을 구비한 지능형 메타 표면에서, 지능형 메타 표면 상의 각 전자기 유닛이 입사 전 자파에 대해 얼마나 많은 위상을 변경해야, 빔 커버리지 영역 및 빔 억제 영역이라는 두 가지 제약 조건을 충족 할지 결정해야 하며; 진폭 조작 능력을 구비한 지능형 메타 표면의 경우, 패널 상의 각 전자기 유닛이 입사 전 자파에 대해 얼마나 많은 진폭을 변경해야, 제약 조건을 충족할지 결정해야 한다. 도 4에 도시된 바와 같이, 본 실시예는 단계(S210) 내지 단계(S230)를 포함한다. 단계(S210), 지능형 메타 표면은 채널 정보 및 빔 조작 정보를 능동적 또는 수동적으로 획득한다. 하나의 경우, 지능형 메타 표면에는 기지국 및 단말 장치와 연결을 설정할 수 있는 능동 측정 유닛이 마련되고, 표준 프로토콜 메시지를 송신, 수신 및 처리하여, 필요한 채널 정보 및 빔 조작 정보를 얻는다. 여기서, 채널 정보는 적어도 기지국과 지능형 메타 표면 사이의 채널 행렬(H1로 표기) 및 지능형 메타 표면과 단말 장치 사이 의 채널 행렬(H2로 표기)을 포함한다. 기지국이 N개의 송신 안테나를 구비하고, 지능형 메타 표면이 M개의 전자 기 유닛을 구비하며, 지능형 메타 표면이 K1개의 단말 장치를 서비스하면서, K2개의 단말 장치에 대한 간섭을 회 피해야 한다고 가정하면, H1는 하나의 M*N 차원의 복소 행렬(complex matrix)이고, H2는 (K1+K2)*M 차원의 복소 행렬이다. 하나의 채널 행렬 H의 (m, n)번째 요소는 로 나타낼 수 있으며, 여기서 요소의 절대값 |hmn|은 신호가 대응되는 채널을 통과한 후의 게인을 나타내고, 편각θmn은 신호가 대응되는 채널을 통과한 후의 위상 변화를 나타낸다. 빔 조작 정보는 서비스해야 하는 K1개의 단말 장치의 위치 및 K2개의 간섭을 회피해야 하는 단말 장치의 위치에 의해 결정되며, 이러한 단말의 위치에 의하여 빔 커버리지 영역 및 빔 억제 영역을 산출 한다. 빔 커버리지 영역 및 빔 억제 영역은 현재 지능형 메타 표면 서비스 영역 내의 단말 장치 위치에 의해 결 정되지 않고 필요에 따라 인위적으로 지정할 수도 있다. 다른 하나의 경우, 지능형 메타 표면은 기지국 또는 단말 장치로부터 채널 정보 및 빔 조작 정보를 수동적으로 획득하며, 여기서, 지능형 메타 표면과 기지국의 연결은 유선 또는 무선 전송을 사용할 수 있고, 단말 장치와의 연결은 무선 전송을 사용할 수 있다. 또한, 지능형 메타 표면이 독립적으로 작동하는 경우, 채널 정보 및 빔 조작 정보를 지능형 메타 표면의 시스템 메모리에 미리 기입해야 하며, 지능형 메타 표면은 기입된 정보에 따라 다음 단계의 최적화를 완료한다. 설치 및 배치가 완료된 후, 지능형 메타 표면의 시스템 메모리 내의 채널 정보 및 빔 조작 정보를 다시 업데이트하고, 다음 단계의 조작을 트리거할 수 있다. 단계(S220), 채널 정보 및 빔 조작 정보에 따라, 조작의 최적화 계산을 실시하여, 조작할 최적화 파라미터를 얻 는다. 단계(S210)에서 획득한 채널 정보에 따라, 다음과 같은 기설정된 목표 함수를 구성할 수 있다."}
{"patent_id": "10-2023-7023942", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기서, 식에서, PRx,i 및 PIx,j는 각각 신호 커버가 필요한 i번째의 단말 장치 및 간섭을 회피해야 하는 j번째 의 단말 장치가 수신한 신호 강도를 나타내고, 즉 각각 상기 실시예 중의 제1 유형 통신 노드가 수신한 신호 강 도 및 제2 유형 통신 노드가 수신한 신호 강도를 나타내며; 및 는 각각 K1개의 신호 커버가 필요한 단말 장치 및 K2개의 간섭을 회피해야 하는 단말 장치가 수신한 평균 신호 강도를 나타내고, 즉 각각 상기 실시예 중 의 제1 유형 통신 노드가 수신한 평균 신호 강도 및 제2 유형 통신 노드가 수신한 평균 신호 강도를 나타낸다. 여기서,"}
{"patent_id": "10-2023-7023942", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "여기서, w1, w2, w3, w4는 각각 식 중 각 항의 가중치를 나타내고, x는 지능형 메타 표면 상의 최적화할 조작 파 라미터(예를 들어, 진폭 또는 위상)를 나타낸다. 여기서, x는 상기 실시예 중의 조작할 최적화 파라미터이다. 단계(S210)에서 획득한 채널 정보에 따라, 각 단말 장치의 수신 신호를 다음과 같이 얻을 수 있다. y＝H2XH1s 여기서, y는 (K1+K2)*1 차원 벡터이고, 해당 요소의 절대값은 신호 강도이며, 즉 y의 절대값에 따라 신호 커버가 필요한 각 단말 장치의 신호 강도 PRx,i 및 각 간섭을 회피해야 하는 단말 장치의 신호 강도 PIx,j를 얻을 수 있고, 송신된 신호 s는 N*1 차원 벡터이며, X＝diag(x)는 M*M 차원의 대각선 행렬이다. 조작된 파라미터가 위상 이면, 이고, 지능형 메타 표면 상의 i번째 전자기 유닛이 입사 전자파에 대한 위상 변화량은 θi임을 나 타내고, 조작된 파라미터가 진폭이면, 이며, 지능형 메타 표면 상의 i번째 전자기 유닛이 입사 전자파 의 진폭에 대한 변화량은 Ai이면서 각 전자기 유닛이 입사 전자파에 대해 동일한 위상 변화량을 구비함을 나타낸 다. 식 및 식을 식에 대입하면 완전한 기설정된 목표 함수를 얻는다. 지능형 메타 표면에 의해 조작된 전자파가 빔 커버리지 영역에 최대한 많이 집중되고, 빔 억제 영역에 최대한 적게 집중되도록 하기 위해, 한 그 룹의 x를 찾아 기설정된 목표 함수f(x)가 최소값을 취하도록 해야 한다. 실시예에서, 해당 최적화 문제를 해결하는 두 가지 방법, 즉 유전 알고리즘 및 경사 하강 알고리즘을 제공한다. 유전 알고리즘을 사용하여 x를 구하는 방법 유전 알고리즘은 자연 진화 과정을 시뮬레이션하여 최적해를 탐색하는 방법으로, 해를 구하는 과정을 생물학적 진화 중의 염색체의 교차 및 변이 등과 유사한 과정으로 변환함으로써, 일반적으로 비선형 최적화 문제의 최적 화 결과를 빠르게 획득할 수 있다. 해당 알고리즘은 우선 집단 수, 각 개체의 초기값, 수렴 조건, 최대 반복 횟 수 등을 설정한 후, 유전적 변이 반복을 통해 목표 함수 f(x)의 최적해를 검색하며, 1차 반복 결과가 수렴 조건 을 충족하면, 해당 반복 결과를 최종 결과로 출력한다. 도 5는 본 출원의 실시예에서 제공하는 최적화될 조작 파라미터를 구하는 흐름도이다. 도 5(a)에 도시된 바와 같이, 먼저, 집단 수 K를 설정하고, 각 집단은 초기값 xi＝x0을 설정하며, 수렴 역치 ε 및 최대 반복 횟수 N을 설정한 후; 각 집단에 대해 f(xi)를 계산한 후; f(xi) 가 ε보다 작은지 여부를 판단하고; f(xi)＜ε이면, xi를 출력하며; f(xi)ε이면, K개의 집단에서 일정한 비율 의 고품질 개체를 선택하여 유전적 변이를 수행함으로써, K개의 새로운 집단을 얻는다. 그 후, 현재 반복 횟수 n이 N보다 큰지 여부를 판단하며, n＞N이면, xi를 출력하고; nN이면, xi를 출력할 때까지, 각 집단에 대해 f(xi)를 계산하는 단계로 되돌아간다. 경사 하강 알고리즘을 사용하여 해를 구하는 방법 실시예에서, 경사 하강 알고리즘은 또 다른 반복 기반 비선형 최적화 알고리즘이며, 해당 알고리즘은 기설정된 목표 함수f(x)를 이용하여 변수 x에 대한 부분 도함수(partial derivative)를 검색 방향으로 하여, 구해야 할 변수를 반복적으로 업데이트함으로써, 기설정된 목표 함수가 점차 최소값이 되도록 한다. 해당 알고리즘은 먼저 구해야 할 변수의 초기값, 수렴 조건, 최대 반복 횟수 등을 설정해야 하며, 그 후, 기설정된 목표 함수의 독립 변수에 대한 부분 도함수를 검색 방향으로 하여, 최적해를 반복적으로 검색하고, 1차 반복 결과가 수렴 조건을 충족하면, 해당 반복 결과를 최종 출력으로 하며, 상세한 계산 과정은 도 5(b)와 같다. 도 5(b)에 나타낸 바와 같이, 먼저 초기값 x＝x0, 수렴 역치 ε 및 최대 반복 횟수 N을 설정한 후; f(x)를 계산하여, f(x)가 ε보다 작 은지 여부를 판단하고, f(x)＜ε이면, x를 출력하며; f(x)ε이면, 변수 를 업데이트한 후, 현재 반복 횟수 n이 N보다 큰 지 여부를 판단하고, n＞N이면, x를 출력하며; n N 이면, x를 출력할 때까 지, f(x)를 계산하는 단계로 되돌아 간다. 해당 최적화 문제를 해결하려면, 일정한 계산 자원이 필요하기 때문에, 지능형 메타 표면 자체의 계산 자원이 제한되거나 지능형 메타 표면의 비용을 절감하기 위해, 해당 최적화 문제의 해결을 기지국에 전달할 수 있고, 기지국이 계산을 완료한 후, 계산 결과를 지능형 메타 표면에 전송하며, 그 다음 지능형 메타 표면은 다음 단계 의 조작을 실시한다. 지능형 메타 표면이 독립적으로 작동하며, 기지국과 연결되지 않으면, 먼저 다른 사용 가 능한 서버에서 해당 최적화 문제의 해결을 완성할 수 있으며, 그 다음, 계산 결과를 지능형 메타 표면의 시스템 메모리에 기입한 후, 지능형 메타 표면을 다음 단계의 조작을 수행하도록 트리거한다. 단계(S230), 조작할 최적화 파라미터에 따라 전자기 유닛의 현재 조작 상태를 조정한다. 단계(S220)에서 계산하여 얻은 결과에 따라, 지능형 메타 표면 상의 각 전자기 유닛의 목표 조작 상태를 결정하 며, 결정된 목표 조작 상태에 따라 지능형 메타 표면 제어 회로의 출력 레벨을 조정하고, 전자기 유닛 상의 전 자 소자의 상태를 조정함으로써, 지능형 메타 표면의 전체적인 조작 상태의 조정을 구현하여, 결국 빔 조작 목 표를 달성한다. 일 실시예에서, 도 6은 본 출원의 실시예에서 제공하는 지능형 메타 표면 조작 장치의 구조 블록도이다. 도 6에 도시된 바와 같이, 본 실시예는 제1 결정 모듈, 제2 결정 모듈, 제3 결정 모듈 및 조정기 를 포함한다. 여기서, 제1 결정 모듈은 채널 정보 및 빔 조작 정보를 결정하도록 구성되고; 제2 결정 모듈은 채널 정보 및 빔 조작 정보에 따라, 기설정된 목표 함수 중의 최적화될 조작 파라미터를 결정하도록 구성되며; 제3 결정 모듈은 최적화될 조작 파라미터에 따라 지능형 메타 표면 상의 각 전자기 유닛의 목표 조작 상태를 결정하도록 구성되고; 조정기는 전자기 유닛의 현재 상태를 목표 조작 상태로 조정하도록 구성된다. 일 실시예에서, 제1 결정 모듈은, 수신된 프로토콜 메시지에 따라 채널 정보 및 제2 통신 노드의 위치를 계산하고, 제2 통신 노드의 위치에 따라 빔 조작 정보를 결정하도록 구성된 제1 결정 유닛; 및 제1 통신 노드 또는 제2 통신 노드에 의해 송신된 채널 정보 및 빔 조작 정보를 수신하도록 구성된 수신 유닛; 중 하나를 포함한다. 일 실시예에서, 채널 정보는 적어도 제1 통신 노드와 지능형 메타 표면 사이의 채널 행렬, 지능형 메타 표면과 제2 통신 노드 사이의 채널 행렬을 포함한다. 일 실시예에서, 빔 조작 정보는 적어도 빔 커버리지 영역의 정보를 포함하고; 빔 커버리지 영역은 무선 전자기 신호가 강화되어야 하는 영역이며; 빔 커버리지 영역의 개수는 적어도 하나이고; 빔 커버리지 영역은 공간 내의 하나의 점 또는 하나의 기하학적 영역이다. 일 실시예에서, 빔 조작 정보는 빔 억제 영역의 정보를 더 포함하고; 빔 억제 영역은 무선 전자기 신호가 약화 되어야 하는 영역이며; 빔 억제 영역은 공간 내의 하나의 점 또는 하나의 기하학적 영역이다. 일 실시예에서, 빔 조작 정보는 모든 제1 유형 통신 노드의 위치 및 모든 제2 유형 통신 노드의 위치에 의해 결 정되고; 제1 유형 통신 노드는 지능형 메타 표면이 서비스해야 하는 제2 통신 노드이며; 제2 유형 통신 노드는 지능형 메타 표면이 간섭을 회피해야 하는 제2 통신 노드이고; 제1 유형 통신 노드의 위치는 빔 커버리지 영역 을 구성하며, 제2 유형 통신 노드의 위치는 빔 억제 영역을 구성한다. 일 실시예에서, 제1 유형 통신 노드의 개수와 제2 유형 통신 노드의 개수, 및 제1 유형 통신 노드의 위치와 제2 유형 통신 노드의 위치를 결정하는 방식은 사전 구성, 실시간 측정 중 하나를 포함한다. 일 실시예에서, 기설정된 목표 함수는 제1 유형 통신 노드가 수신한 신호 강도, 제2 유형 통신 노드가 수신한 신호 강도, 제1 유형 통신 노드가 수신한 평균 신호 강도 및 제2 유형 통신 노드가 수신한 평균 신호 강도에 의 해 결정된다. 일 실시예에서, 유전 알고리즘 또는 경사 하강 알고리즘을 사용하여 기설정된 목표 함수 중의 최적화될 조작 파 라미터를 결정한다. 일 실시예에서, 지능형 메타 표면은 전자기 유닛 어레이로 구성되고; 전자기 유닛 어레이는 동일하거나 상이한 유형의 전자기 유닛으로 구성되며; 전자기 유닛 어레이는 평면 어레이, 곡면 어레이 중의 하나를 포함한다. 일 실시예에서, 전자기 유닛은 금속, 매체 재료 및 액정 재료 중의 일 종으로 구성되며, 크기는 서브 파장 매그 니튜드이고, 상기 전자기 유닛의 표면에 입사된 전자파를 조작하며; 전자기 유닛에 조작 가능한 전자기 속성은 전자파 진폭, 위상, 분극 방향 중의 하나를 포함하고; 전자기 유닛은 저항, 커패시턴스, 다이오드, 가변 용량 다이오드, 트라이오드 등 조절 가능한 전자 소자 중 하나를 포함한다. 본 실시예에서 제공하는 지능형 메타 표면 조작 장치는 도 3에 도시된 실시예의 지능형 메타 표면 조작 방법을 구현하도록 구성되고, 본 실시예에서 제공하는 지능형 메타 표면 조작 장치의 구현 원리와 기술 효과는 비슷하 므로, 여기서 더 이상 설명하지 않는다. 도 7은 본 출원의 실시예에서 제공하는 지능형 메타 표면의 구조 개략도이다. 도 7에 도시된 바와 같이, 본 출 원에서 제공하는 지능형 메타 표면은 프로세서, 메모리 및 통신 모듈을 포함한다. 해당 지능형 메타 표면 중 프로세서의 개수는 1개 또는 복수 개이고, 도 7에서 1개의 프로세서를 예로 한다. 해당 지능형 메타 표면 중 메모리의 개수는 1개 또는 복수 개이며, 도 7에서 1개의 메모리를 예로 한다. 해당 지능형 메타 표면의 프로세서, 메모리 및 통신 모듈은 버스 또는 기타 방식으로 연결될 수 있으며, 도 7에서 버스로 연결되는 경우를 예로 한다. 지능형 메타 표면의 메모리는 컴퓨터 판독 가능 저 장 매체로서, 본 출원의 임의의 실시예에 따른 지능형 메타 표면에 대응되는 프로그램 명령/모듈(예를 들어, 지 능형 메타 표면 조작 장치 중의 제1 결정 모듈, 제2 결정 모듈, 제3 결정 모듈 및 조정기(33 0))과 같은 소프트 웨어 프로그램, 컴퓨터 실행 가능 프로그램 및 모듈을 저장하도록 구성된다. 메모리는 프로그램 저장 구역 및 데이터 저장 구역을 포함할 수 있으며, 여기서, 프로그램 저장 구역은 오퍼레이팅 시스 템, 적어도 하나의 기능에 필요한 어플리케이션 프로그램을 저장할 수 있고; 데이터 저장 구역은 지능형 메타 표면의 사용에 의해 생성되는 데이터 등을 저장할 수 있다. 또한, 메모리는 고속 랜뎀 액세스 메모리를 포 함할 뿐만 아니라, 적어도 하나의 자기 저장 디바이스, 플래시 메모리 도는 다른 비-휘발성 고체-상태 메모리와 같은 비-휘발성 메모리를 더 포함할 수 있다. 일부 실시예에서, 메모리는 프로세서에 대해 원격으로 배치된 메모리를 추가로 포함할 수 있다. 이러한 원격 메모리는 네트워크를 통해 지능형 메타 표면에 연결될 수 있다. 상기 네트워크의 예는 인터넷, 회사 인트라넷, 근거리 통신망, 이동 통신 네트워크, 및 이들의 조합을 포 함하나, 이에 한정되는 것은 아니다.통신 모듈은 제1 통신 노드 및 제2 통신 노드와 통신 인터랙션을 수행하도록 구성된다. 상기에서 제공하는 지능형 메타 표면은 상기 임의의 실시예에서 제공하는 지능형 메타 표면 조작 방법을 수행하 도로구 구성되며, 상응하는 기능 및 효과를 구비한다. 일 실시예에서, 도 8은 본 출원의 실시예에서 제공하는 지능형 메타 표면 조작 시스템의 구조 블록도이다. 본 실시예 중의 지능형 메타 표면 조작 시스템은 적어도 하나의 제1 통신 노드, 적어도 하나의 제2 통신 노드 및 적어도 하나의 지능형 메타 표면을 포함하되; 상기 제1 통신 노드는 유선 또는 무선 방식을 사용하여 지능형 메타 표면과 시그널링 연동을 수행하며; 상기 제2 통신 노드는 무선 방식을 사용하 여 지능형 메타 표면과 시그널링 연동을 수행하고; 하나의 상기 제1 통신 노드, 하나의 상기 지능형 메타 표면 및 적어도 하나의 상기 제2 통신 노드로 하나의 빔 최적화 조작 그룹을 구성하며, 하나의 빔 최적화 조작 그룹은 상기 임의의 실시예에 따른 지능형 메타 표면 조작 방법에 따라 무선 전자파에 대해 최 적화 조작을 수행한다. 도 8에 도시된 바와 같이, 지능형 메타 표면 조작 시스템이 하나의 제1 통신 노드, 하나의 제2 통신 노드 및 하나의 지능형 메타 표면을 포함하고, 제1 통신 노드, 하나의 제2 통 신 노드 및 하나의 지능형 메타 표면 사이에 무선 방식을 사용하여 통신하는 경우를 예로 하여, 지능 형 메타 표면 조작 시스템의 구조에 대해 설명한다. 실시예에서, 제1 통신 노드는 무선 방식으로 지능형 메타 표면과 시그널링 연동을 수행하고, 제2 통신 노드는 무선 방식으로 지능형 메타 표면과 시 그널링 연동을 수행한다. 본 출원의 실시예는 컴퓨터 실행 가능 명령을 포함하는 저장 매체를 더 제공하며, 컴퓨터 실행 가능 명령은 컴 퓨터 프로세서에 의해 실행되면 지능형 메타 표면 조작 방법을 수행한다. 해당 방법은 채널 정보 및 빔 조작 정 보를 결정하는 단계; 채널 정보 및 빔 조작 정보에 따라, 기설정된 목표 함수 중의 최적화될 조작 파라미터를 결정하는 단계; 최적화될 조작 파라미터에 따라 지능형 메타 표면 상의 각 전자기 유닛의 목표 조작 상태를 결 정하는 단계; 및 전자기 유닛의 현재 상태를 목표 조작 상태로 조정하는 단계; 를 포함한다. 본 분야의 통상의 기술자는 사용자 단말이라는 용어는 임의의 적합한 유형의 무선 사용자 장치, 예를 들어, 모 바일 폰, 휴대용 데이터 처리 장치, 휴대용 웹 브라우저 또는 차량탑재 모바일 스테이션을 포함하는 것을 이해 할 수 있다. 일반적으로, 본 출원의 복수의 실시예는 하드웨어 또는 전용 회로, 소프트웨어, 논리 또는 이들의 임의의 조합 을 통해 구현될 수 있다. 예를 들어, 일부 형태에서는 하드웨어에서 구현될 수 있고, 기타 형태에서는 컨트롤러, 마이크로프로세서 또는 기타 컴퓨팅 장치에 의해 실행되는 펌웨어 또는 소프트웨어에서 구현될 수 있 으며, 본 출원은 이에 한정되지 않는다. 본 출원의 실시예는 모바일 장치의 데이터 프로세서가 컴퓨터 프로그램 명령을 실행함으로써 구현되고, 예를 들 어, 프로세서 엔티티 또는 하드웨어 또는 소프트웨어와 하드웨어의 조합을 통해 구현될 수 있다. 컴퓨터 프로그 램 명령은 어셈블리 명령, 명령 세트 아키텍처(Instruction Set Architecture, ISA) 명령, 기계 명령, 기계 관 련 명령, 마이크로 코드, 펌웨어 명령, 상태 설정 데이터, 또는 하나 이상의 프로그래밍 언어의 임의의 조합으 로 작성된 소스 코드 또는 타켓 코드일 수 있다. 본 출원의 도면에서의 임의의 논리 흐름의 블록도는 프로그램 단계를 표시할 수 있거나, 서로 연결된 논리 회로, 모듈 및 기능을 표시할 수 있거나, 프로그램 단계와 논리 회로, 모듈 및 기능의 조합을 표시할 수 있다. 컴퓨터 프로그램은 메모리에 저장될 수 있다. 메모리는 로컬 기술 환경에 적합한 임의의 유형일 수 있고, 임의 의 적합한 데이터 저장 기술에 의해 구현될 수 있으며, 예를 들어, 판독 전용 메모리(ROM), 랜덤 액세스 메모리 (RAM), 광학 메모리 장치 및 시스템(디지털 비디오 디스크(Digital Video Disc, DVD) 또는 콤팩트 디스크 (Compact Disk, CD)) 등이지만 이에 한정되지 않는다. 컴퓨터 판독 가능 매체는 비일시적 저장 매체를 포함할 수 있다. 데이터 프로세서는 로컬 기술 환경에 적합한 임의의 유형일 수 있고, 예를 들어, 범용 컴퓨터, 전용 컴퓨터, 마이크로 프로세서, 디지털 신호 프로세서(Digital Signal Processing, DSP), 응용 주문형 집적 회로 (Application Specific Integrated Circuit, ASIC), 필드 프로그래머블 게이트 어레이(Field-Programmable Gate Array, FPGA) 및 멀티 코어 프로세서 아키텍처에 기반한 프로세서이지만 이에 한정되지 않는다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8"}
{"patent_id": "10-2023-7023942", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 출원의 실시예에서 제공하는 지능형 메타 표면의 구조 개략도이다. 도 2는 본 출원의 실시예에서 제공하는 지능형 메타 표면이 보조하는 무선 통신 시스템의 개략도이다. 도 3은 본 출원의 실시예에서 제공하는 지능형 메타 표면 조작 방법의 흐름도이다. 도 4는 본 출원의 실시예에서 제공하는 또 다른 지능형 메타 표면 조작 방법의 흐름도이다. 도 5는 본 출원의 실시예에서 제공하는 최적화될 조작 파라미터를 구하는 흐름도이다. 도 6은 본 출원의 실시예에서 제공하는 지능형 메타 표면 조작 장치의 구조 블록도이다. 도 7은 본 출원의 실시예에서 제공하는 지능형 메타 표면의 구조 개략도이다. 도 8은 본 출원의 실시예에서 제공하는 지능형 메타 표면 조작 시스템의 구조 블록도이다."}
