{"patent_id": "10-2023-0030093", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0117447", "출원번호": "10-2023-0030093", "발명의 명칭": "모델의 연산과 관련된 오퍼레이터의 양자화를 위한 전자 장치 및 방법", "출원인": "삼성전자주식회사", "발명자": "이은택"}}
{"patent_id": "10-2023-0030093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "에서,상기 적어도 하나의 프로세서(120;200;511)는, 상기 제1 가중치 세트의 해시 값과 함께, 상기 제2 가중치 세트를 상기 메모리(130;501)에 저장하도록 추가적으로 구성되는,전자 장치."}
{"patent_id": "10-2023-0030093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에서,상기 제2 데이터 타입의 가중치 세트를 획득하기 위하여, 상기 적어도 하나의 프로세서(120;200;511)는,제1 구간의 부동 소수점 수를 표현하기 위한 상기 제1 데이터 타입의 상기 제1 가중치 세트로부터, 상기 양자화를 통해, 상기 제1 구간의 길이 보다 작은 길이를 가지는 제2 구간의 수를 표현하기 위한 상기 제2 데이터 타입의 상기 제2 가중치 세트를 획득하도록, 구성되는,전자 장치."}
{"patent_id": "10-2023-0030093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에서,상기 가속기는,상기 제1 데이터 타입 또는 상기 제2 데이터 타입 중에서, 상기 제2 데이터 타입에 기반하는 연산을 수행하도록구성되는,전자 장치."}
{"patent_id": "10-2023-0030093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에서,상기 적어도 하나의 프로세서(120;200;511)는,공개특허 10-2024-0117447-3-상기 모델(503;611)과 관련된 기능을 실행하기 위한 요청에 응답하여, 상기 제1 가중치 세트 또는 상기 제2 가중치 세트 중에서, 상기 제2 가중치 세트를 상기 가속기에 입력함으로써, 상기 제1 오퍼레이터(613)의 연산을수행하도록 추가적으로 구성되는,전자 장치."}
{"patent_id": "10-2023-0030093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에서,상기 적어도 하나의 프로세서(120;200;511)는, 상기 제2 가중치 세트를 획득하는 것에 기반하여, 상기 프로파일 정보로부터 상기 적어도 하나의 오퍼레이터에 대한 연산을 수행함으로써 획득된 제1 출력 데이터(615)의 세트를 식별하고;상기 제2 가중치 세트에 기반하여 상기 적어도 하나의 오퍼레이터에 대한 연산을 수행함으로써, 상기 입력 데이터(502;601)의 세트로부터 제2 출력 데이터(625)의 세트를 획득하고;상기 제1 출력 데이터(615) 및 대응하는 상기 제2 출력 데이터(625) 사이의 차이 값(difference)의 세트에 기반하여, 상기 모델(503;611)에 포함된 제1 오퍼레이터(613)에 포함된 상기 제1 가중치 세트를, 상기 제2 가중치세트로 교체하도록 구성되는,전자 장치."}
{"patent_id": "10-2023-0030093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 5에서,통신 회로를 추가적으로 포함하고,상기 적어도 하나의 프로세서(120;200;511)는, 상기 제1 출력 데이터(615) 및 대응하는 상기 제2 출력 데이터(625) 사이의 상기 차이 값의 세트 중 적어도 하나의 차이 값이 기준 값 이상임을 식별함에 기반하여, 상기 프로파일 정보로부터 획득된 상기 서브 출력 데이터의 세트를 상기 통신 회로를 통해 서버에게 전송하고,상기 서브 출력 데이터에 기반하여, 상기 제1 가중치 세트에 대한 양자화가 수행된 상기 제2 데이터 타입의 제3가중치 세트를 상기 통신 회로를 통해 서버로부터 수신하고,상기 수신된 상기 제3 가중치 세트를 상기 메모리(130;501)에 저장하도록 추가적으로 구성되는,전자 장치."}
{"patent_id": "10-2023-0030093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 1에서,상기 제2 데이터 타입의 상기 제2 가중치 세트를 획득하기 위하여, 상기 적어도 하나의 프로세서(120;200;511)는, 상기 서브 출력 데이터의 세트의 분포에 기반하여, 상기 제1 가중치 세트에 대한 양자화를 수행함으로써 상기제2 가중치 세트를 획득하도록 구성되는,전자 장치. 공개특허 10-2024-0117447-4-청구항 8"}
{"patent_id": "10-2023-0030093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 8에서,상기 적어도 하나의 프로세서(120;200;511)는, 상기 제1 가중치 세트의 해시 값에 대응하는 제2 가중치 세트에 기반하여 제1 오퍼레이터(613)들에 대한 연산을수행하도록 추가적으로 구성되는,전자 장치."}
{"patent_id": "10-2023-0030093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 1에서,상기 제1 오퍼레이터(613)의 상기 서브 출력 데이터의 세트는 상기 적어도 하나의 오퍼레이터 중 하나인, 상기제1 오퍼레이터(613)에 연결된 제2 오퍼레이터의 입력 데이터(502;601)의 세트인,전자 장치."}
{"patent_id": "10-2023-0030093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 1에서, 상기 메모리(130;501)에서, 상기 제1 가중치 세트를 획득하기 위하여, 상기 적어도 하나의 프로세서(120;200;511)는, 상기 가속기에 의해 지원되는 상기 제2 데이터 타입을 식별하고;상기 제2 데이터 타입과 상이한 상기 제1 오퍼레이터(613)에 포함된 제1 가중치 세트의 제1 데이터 타입을 식별했는지 여부, 양자화에 기반하여 상기 제1 가중치 세트로부터 획득된 상기 제2 데이터 타입의 가중치 세트가 상기 메모리에 저장되었는지 여부, 또는 상기 제2 데이터 타입의 상기 가중치 세트 내에 가중치가 포함되어 있는지 여부에 기반하여, 상기 제1 데이터 타입의 상기 제1 가중치 세트에 대한 양자화를 수행할지 여부를 결정하도록 구성된, 전자 장치."}
{"patent_id": "10-2023-0030093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "전자 장치(electronic device)(101)에 의해 수행되는 방법에 있어서,메모리(130;501)에서, 모델(503;611)에 포함된 적어도 하나의 오퍼레이터 중 하나인 제1 오퍼레이터(613)에 포함된 제1 데이터 타입의 제1 가중치 세트를 획득하는 동작과;상기 메모리(130;501)에 저장된, 상기 모델(503;611)의 실행에 의해 생성된 프로파일 정보로부터, 상기 제1 오퍼레이터(613)의 연산(computation)을 위해 이용된 입력 데이터(502;601)의 세트에 대응하는 서브 출력 데이터공개특허 10-2024-0117447-5-의 세트를 획득하는 동작과;상기 서브 출력 데이터의 세트에 기반하여, 상기 제1 가중치 세트에 대한 양자화를 수행함으로써 적어도 하나의가속기에 의해 지원되는 제2 데이터 타입의 제2 가중치 세트를 획득하는 동작과;상기 제2 가중치 세트를 획득하는 것에 기반하여, 상기 메모리(130;501)에 상기 제2 가중치 세트를 저장하는 동작을 포함하는, 방법."}
{"patent_id": "10-2023-0030093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 12에서,상기 제2 데이터 타입의 가중치 세트를 획득하는 동작은, 제1 구간의 부동 소수점 수를 표현하기 위한 상기 제1 데이터 타입의 상기 제1 가중치 세트로부터, 상기 양자화를 통해, 상기 제1 구간의 길이 보다 작은 길이를 가지는 제2 구간의 수를 표현하기 위한 상기 제2 데이터 타입의 상기 제2 가중치 세트를 획득하는 동작을 포함하는,방법."}
{"patent_id": "10-2023-0030093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 12에서,상기 가속기는,상기 제1 데이터 타입 또는 상기 제2 데이터 타입 중에서, 상기 제2 데이터 타입에 기반하는 연산을 수행하도록구성되는,방법."}
{"patent_id": "10-2023-0030093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "청구항 12에서,상기 모델(503;611)과 관련된 기능을 실행하기 위한 요청에 응답하여, 상기 제1 가중치 세트 또는 상기 제2 가중치 세트 중에서, 상기 제2 가중치 세트를 상기 가속기에 입력함으로써, 상기 제1 오퍼레이터(613)의 연산을수행하는 동작을 추가적으로 포함하는,방법."}
{"patent_id": "10-2023-0030093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "청구항 12에서,상기 제2 가중치 세트를 획득하는 것에 기반하여, 상기 프로파일 정보로부터 상기 적어도 하나의 오퍼레이터에대한 연산을 수행함으로써 획득된 제1 출력 데이터(615)의 세트를 식별하는 동작과,상기 제2 가중치 세트에 기반하여 상기 적어도 하나의 오퍼레이터에 대한 연산을 수행함으로써, 상기 입력 데이터(502;601)의 세트로부터 제2 출력 데이터(625)의 세트를 획득하는 동작과, 상기 제1 출력 데이터(615) 및 대응하는 상기 제2 출력 데이터(625) 사이의 차이 값(difference)의 세트에 기반하여, 상기 모델(503;611)에 포함된 제1 오퍼레이터(613)에 포함된 상기 제1 가중치 세트를, 상기 제2 가중치세트로 교체하는 동작을 포함하는,공개특허 10-2024-0117447-6-방법."}
{"patent_id": "10-2023-0030093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "청구항 16에서,상기 제1 출력 데이터(615) 및 대응하는 상기 제2 출력 데이터(625) 사이의 상기 차이 값의 세트 중 적어도 하나의 차이 값이 기준 값 이상임을 식별함에 기반하여, 상기 프로파일 정보로부터 획득된 상기 서브 출력 데이터의 세트를 통신 회로를 통해 서버에게 전송하는동작과;상기 서브 출력 데이터에 기반하여, 상기 제1 가중치 세트에 대한 양자화가 수행된 상기 제2 데이터 타입의 제3가중치 세트를 상기 통신 회로를 통해 서버로부터 수신하는 동작과;상기 수신된 상기 제3 가중치 세트를 상기 메모리(130;501)에 저장하는 동작을 추가적으로 포함하는,방법."}
{"patent_id": "10-2023-0030093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "청구항 12에서,상기 제2 데이터 타입의 상기 제2 가중치 세트를 획득하는 동작은상기 서브 출력 데이터의 세트의 분포에 기반하여, 상기 제1 가중치 세트에 대한 양자화를 수행함으로써 상기제2 가중치 세트를 획득하는 동작을 포함하는,방법."}
{"patent_id": "10-2023-0030093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "청구항 12에서,상기 제1 가중치 세트의 해시 값과 함께, 상기 제2 가중치 세트를 상기 메모리(130;501)에 저장하는 동작을 추가적으로 포함하는,방법."}
{"patent_id": "10-2023-0030093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "청구항 19에서,상기 제1 가중치 세트의 해시 값에 대응하는 제2 가중치 세트에 기반하여 제1 오퍼레이터(613)들에 대한 연산을수행하는 동작을 추가적으로 포함하는,방법."}
{"patent_id": "10-2023-0030093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "청구항 12에서,상기 제1 오퍼레이터(613)의 상기 서브 출력 데이터의 세트는 상기 적어도 하나의 오퍼레이터 중 하나인, 상기제1 오퍼레이터(613)에 연결된 제2 오퍼레이터의 입력 데이터(502;601)의 세트인,공개특허 10-2024-0117447-7-방법."}
{"patent_id": "10-2023-0030093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "청구항 12에서,상기 메모리(130;501)에서, 상기 제1 가중치 세트를 획득하는 동작은,상기 가속기에 의해 지원되는 상기 제2 데이터 타입을 식별하는 동작을 포함하고,상기 제2 데이터 타입과 상이한 상기 제1 오퍼레이터(613)에 포함된 제1 가중치 세트의 제1 데이터 타입이 식별되는지 여부, 양자화에 기반하여 상기 제1 가중치 세트로부터 획득된 상기 제2 데이터 타입의 가중치 세트가 상기 메모리에 저장되었는지 여부, 또는 상기 제2 데이터 타입의 상기 가중치 세트 내에 가중치가 포함되어 있는지 여부에 기반하여, 상기 제1 데이터 타입의 상기 제1 가중치 세트에 대한 양자화를 수행할지 여부를 결정하는동작을 포함하는,방법."}
{"patent_id": "10-2023-0030093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "하나 이상의 프로그램들을 저장하는 컴퓨터 판독가능 저장 매체(computer readable storage medium)에 있어서,상기 하나 이상의 프로그램들은, 전자 장치의 프로세서에 의해 실행될 시에, 메모리(130;501)에서, 모델(503;611)에 포함된 적어도 하나의 오퍼레이터 중 하나인 제1 오퍼레이터(613)에 포함된 제1 데이터 타입의 제1 가중치 세트를 획득하고;상기 메모리(130;501)에 저장된, 상기 모델(503;611)의 실행에 의해 생성된 프로파일 정보로부터, 상기 제1 오퍼레이터(613)의 연산(computation)을 위해 이용된 입력 데이터(502;601)의 세트에 대응하는 서브 출력 데이터의 세트를 획득하고;상기 서브 출력 데이터의 세트에 기반하여, 상기 제1 가중치 세트에 대한 양자화를 수행함으로써 적어도 하나의가속기에 의해 지원되는 제2 데이터 타입의 제2 가중치 세트를 획득하고;상기 제2 가중치 세트를 획득하는 것에 기반하여, 상기 메모리(130;501)에 상기 제2 가중치 세트를 저장하도록,상기 전자 장치를 야기하는 인스트럭션들을 포함하는,컴퓨터 판독 가능 저장 매체."}
{"patent_id": "10-2023-0030093", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "일 실시예에 따르면, 전자 장치(electronic device)는 메모리, 및 적어도 하나의 프로세서를 포함할 수 있다. 상 기 적어도 하나의 프로세서는, 상기 메모리에서, 모델에 포함된 적어도 하나의 오퍼레이터 중 하나인 제1 오퍼레 이터에 포함된 제1 데이터 타입의 제1 가중치 세트를 획득할 수 있다. 상기 적어도 하나의 프로세서는, 상기 메 (뒷면에 계속)"}
{"patent_id": "10-2023-0030093", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "아래의 설명들은 모델의 연산과 관련된 오퍼레이터의 양자화를 위한 전자 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2023-0030093", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 인공 지능 기술(artificial intelligence; AI)을 접목한 어플리케이션들이 개발되고 있다. 어플리케이션은 요구되는 정밀도(precision)에 따라 다양한 데이터 타입의 가중치를 이용할 수 있다. 높은 정밀도(precision)에 대응하는 데이터 타입의 가중치를 이용한 어플리케이션을 낮은 정밀도에 대응하는 데이터 타입을 지원하는 가속 기에서 연산하도록 하는 방식이 연구되고 있다. 상술한 정보는 본 개시에 대한 이해를 돕기 위한 목적으로 하는 배경 기술(related art)로 제공될 수 있다. 상 술한 내용 중 어느 것도 본 개시와 관련된 종래 기술(prior art)로서 적용될 수 있는지에 대하여 어떠한 주장이"}
{"patent_id": "10-2023-0030093", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "나 결정이 제기되지 않는다.발명의 내용"}
{"patent_id": "10-2023-0030093", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시예에 따르면, 전자 장치(electronic device)는 메모리, 및 적어도 하나의 프로세서를 포함할 수 있다. 상기 적어도 하나의 프로세서는, 상기 메모리에서, 모델에 포함된 적어도 하나의 오퍼레이터 중 하나인 제1 오 퍼레이터에 포함된 제1 데이터 타입의 제1 가중치 세트를 획득할 수 있다. 상기 적어도 하나의 프로세서는, 상 기 메모리에 저장된, 상기 모델의 실행에 의해 생성된 프로파일 정보로부터, 상기 제1 오퍼레이터의 연산 (computation)을 위해 이용된 입력 데이터의 세트에 대응하는 서브 출력 데이터의 세트를 획득할 수 있다. 상기 적어도 하나의 프로세서는, 상기 서브 출력 데이터의 세트에 기반하여, 상기 제1 가중치 세트에 대한 양자화를 수행함으로써 적어도 하나의 가속기에 의해 지원되는 제2 데이터 타입의 제2 가중치 세트를 획득할 수 있다. 상 기 적어도 하나의 프로세서는, 상기 제2 가중치 세트를 획득하는 것에 기반하여, 상기 메모리에 상기 제2 가중 치 세트를 저장할 수 있다. 일 실시예에 따르면, 전자 장치(electronic device)에 의해 수행되는 방법은 메모리에서, 모델에 포함된 적어도 하나의 오퍼레이터 중 하나인 제1 오퍼레이터에 포함된 제1 데이터 타입의 제1 가중치 세트를 획득하는 동작을 포함할 수 있다. 상기 방법은 상기 메모리에 저장된, 상기 모델의 실행에 의해 생성된 프로파일 정보로부터, 상 기 제1 오퍼레이터의 연산(computation)을 위해 이용된 입력 데이터의 세트에 대응하는 서브 출력 데이터의 세 트를 획득하는 동작을 포함할 수 있다. 상기 방법은 상기 서브 출력 데이터의 세트에 기반하여, 상기 제1 가중 치 세트에 대한 양자화를 수행함으로써 적어도 하나의 가속기에 의해 지원되는 제2 데이터 타입의 제2 가중치 세트를 획득하는 동작을 포함할 수 있다. 상기 방법은 상기 제2 가중치 세트를 획득하는 것에 기반하여, 상기 메모리에 상기 제2 가중치 세트를 저장하는 동작을 포함할 수 있다. 일 실시예에 따르면, 하나 이상의 프로그램들을 저장하는 컴퓨터 판독가능 저장 매체(computer readable storage medium)에 있어서, 상기 하나 이상의 프로그램들은, 전자 장치의 프로세서에 의해 실행될 시에, 메모리 에서, 모델에 포함된 적어도 하나의 오퍼레이터 중 하나인 제1 오퍼레이터에 포함된 제1 데이터 타입의 제1 가 중치 세트를 획득하도록 상기 전자 장치를 야기하는 인스트럭션들을 포함할 수 있다. 상기 적어도 하나 이상의 프로그램들은 상기 메모리에 저장된, 상기 모델의 실행에 의해 생성된 프로파일 정보로부터, 상기 제1 오퍼레이 터의 연산(computation)을 위해 이용된 입력 데이터의 세트에 대응하는 서브 출력 데이터의 세트를 획득하도록 상기 전자 장치를 야기하는 인스트럭션들을 포함할 수 있다. 상기 적어도 하나 이상의 프로그램들은 상기 서브 출력 데이터의 세트에 기반하여, 상기 제1 가중치 세트에 대한 양자화를 수행함으로써 적어도 하나의 가속기에 의해 지원되는 제2 데이터 타입의 제2 가중치 세트를 획득하도록 상기 전자 장치를 야기하는 인스트럭션들을 포 함할 수 있다. 상기 적어도 하나 이상의 프로그램들은 상기 제2 가중치 세트를 획득하는 것에 기반하여, 상기 메모리에 상기 제2 가중치 세트를 저장하도록 상기 전자 장치를 야기하는 인스트럭션들을 포함할 수 있다. 일 실시예에 따르면, 하나 이상의 프로그램들을 저장하는 컴퓨터 판독가능 저장 매체(computer readable storage medium)에 있어서, 상기 하나 이상의 프로그램들은, 전자 장치의 프로세서에 의해 실행될 시에, 상기 메모리(130;501)에서, 모델(503;611)에 포함된 적어도 하나의 오퍼레이터 중 하나인 제1 오퍼레이터에 포 함된 제1 데이터 타입의 제1 가중치 세트를 획득하도록 상기 전자 장치를 야기하는 인스트럭션들을 포함할 수 있다. 상기 하나 이상의 프로그램들은, 상기 메모리(130;501)에 저장된, 상기 모델(503;611)의 실행에 의해 생 성된 프로파일 정보로부터, 상기 제1 오퍼레이터의 연산(computation)을 위해 이용된 입력 데이터 (502;601)의 세트에 대응하는 서브 출력 데이터의 세트를 획득하도록 상기 전자 장치를 야기하는 인스트럭션들 을 포함할 수 있다. 상기 하나 이상의 프로그램들은, 상기 서브 출력 데이터의 세트에 기반하여, 상기 제1 가중 치 세트에 대한 양자화를 수행함으로써 적어도 하나의 가속기에 의해 지원되는 제2 데이터 타입의 제2 가중치 세트를 획득하도록 상기 전자 장치를 야기하는 인스트럭션들을 포함할 수 있다. 상기 하나 이상의 프로그램들은, 상기 제2 가중치 세트를 획득하는 것에 기반하여, 상기 메모리(130;501)에 상기 제2 가중치 세트 를 저장하도록, 상기 전자 장치를 야기하는 인스트럭션들을 포함할 수 있다."}
{"patent_id": "10-2023-0030093", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시에서 사용되는 용어들은 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 다른 실시예의 범위를 한 정하려는 의도가 아닐 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 용어들은 본 개시에 기재된 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가질 수 있다. 본 개시에 사용된 용어 들 중 일반적인 사전에 정의된 용어들은, 관련 기술의 문맥상 가지는 의미와 동일 또는 유사한 의미로 해석될 수 있으며, 본 개시에서 명백하게 정의되지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 경우에 따라서, 본 개시에서 정의된 용어일지라도 본 개시의 실시예들을 배제하도록 해석될 수 없다. 이하에서 설명되는 본 개시의 다양한 실시예들에서는 하드웨어적인 접근 방법을 예시로서 설명한다. 하지만, 본 개시의 다양한 실시예들에서는 하드웨어와 소프트웨어를 모두 사용하는 기술을 포함하고 있으므로, 본 개시의 다양한 실시예들이 소프트웨어 기반의 접근 방법을 제외하는 것은 아니다. 이하 설명에서 사용되는 신호를 지칭하는 용어(예: 신호, 정보, 메시지, 시그널링), 연산 상태를 위한 용어(예: 단계(step), 동작(operation), 절차(procedure)), 데이터를 지칭하는 용어(예: 패킷, 사용자 스트림, 정보 (information), 비트(bit), 심볼(symbol), 코드워드(codeword)), 인공 지능(artificial intelligence; AI)을 지칭하는 용어(예: 뉴럴 네트워크(neural network), 인공 신경망(artificial neural network), 뉴럴 네트워크 모델(neural network model), 모델(model)), 가중치(weight)(예: 웨이트)를 지칭하는 용어, 프로파일 정보를 지칭하는 용어, 오퍼레이터(operator)를 지칭하는 용어(예: 레이어(layer)), 네트워크 객체(network entity)들 을 지칭하는 용어, 장치의 구성 요소를 지칭하는 용어 등은 설명의 편의를 위해 예시된 것이다. 따라서, 본 개 시가 후술되는 용어들에 한정되는 것은 아니며, 동등한 기술적 의미를 가지는 다른 용어가 사용될 수 있다. 또한, 이하 사용되는 '...부', '...기', '...물', '...체' 등의 용어는 적어도 하나의 형상 구조를 의미하거나 또는 기능을 처리하는 단위를 의미할 수 있다. 또한, 본 개시에서, 특정 조건의 만족(satisfied), 충족(fulfilled) 여부를 판단하기 위해, 초과 또는 미만의 표현이 사용될 수 있으나, 이는 일 예를 표현하기 위한 기재일 뿐 이상 또는 이하의 기재를 배제하는 것이 아니 다. '이상'으로 기재된 조건은 '초과', '이하'로 기재된 조건은 '미만', '이상 및 미만'으로 기재된 조건은 '초 과 및 이하'로 대체될 수 있다. 또한, 이하, 'A' 내지 'B'는 A부터(A 포함) B까지의(B 포함) 요소들 중 적어도 하나를 의미한다. 이하, 'C' 및/또는 'D'는 'C' 또는 'D' 중 적어도 하나, 예를 들어, {'C', 'D', 'C'와 'D'} 를 포함하는 것을 의미한다. 도 1은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네트워크 환경에서 전자 장치는 제1 네트워크(예: 근거리 무선 통신 네트워크)를 통하여 전자 장치와 통신하거나, 또는 제2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장치 또는 서버 중 적어도 하나 와 통신할 수 있다. 일 실시예에 따르면, 전자 장치 는 서버를 통하여 전자 장치와 통신할 수 있다. 일 실시예에 따르면, 전자 장치는 프로세 서, 메모리, 입력 모듈, 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스, 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터 리, 통신 모듈, 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서 는, 전자 장치에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어떤 실시예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈 , 또는 안테나 모듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들어, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일 실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세 서는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메모리에 저장할 수 있다. 일 실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또 는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로 세서를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능 에 특화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있다. 보조 프로세서는, 예를 들어, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일 실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일 실시예에 따르면, 보조 프로세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능 모델이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi- supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않 는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있 다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들어, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들어, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 어, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일 실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들어, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일 실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일 실시 예에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일 실시예에 따르면, 센서 모듈은, 예를 들어, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일 실시예에 따르면, 인터페이스는, 예 를 들어, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터 페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일 실시예에 따르면, 연결 단자는, 예를 들어, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일 실시예에 따르면, 햅틱 모듈은, 예를 들어, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일 실시예에 따르면, 카메라 모듈은 하나 이 상의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일 실시예에 따르면, 전력 관리 모 듈은, 예를 들어, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일 실시예에 따르면, 배터 리는, 예를 들어, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일 실시예에 따르면, 통 신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제1 네트워크(예: 블 루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워크) 또는 제2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통 신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제1 네트워크 또는 제2 네트워크와 같은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일 실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이 상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링 크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일 실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일 실시예에 따르면, 안테나 모듈은 복수의 안테나 들(예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제1 네트워크 또는 제2 네트워크와 같은 통신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들어, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모 듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품 (예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일 실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제1 면(예: 아래 면)에 또는 그에 인접하여 배치 되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일 실시예에 따르면, 명령 또는 데이터는 제2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일 실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들어, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요 청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들어, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴 퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일 실시예에 따르면, 외부의 전자 장치 또는 서버는 제2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 본 문서에 개시된 다양한 실시예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들어, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되지 않는다. 본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제1\", \"제2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위 해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없 이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으 로(예: 유선으로), 무선으로, 또는 제3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 다양한 실시예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함 할 수 있으며, 예를 들어, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부 가 될 수 있다. 예를 들어, 일 실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형 태로 구현될 수 있다. 본 문서의 다양한 실시예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어 (예: 프로그램)로서 구현될 수 있다. 예를 들어, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것 을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형 태로 제공될 수 있다. 여기서, '비일시적'은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전자 기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경우 와 임시적으로 저장되는 경우를 구분하지 않는다. 일 실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory(CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어 TM)를 통해 또는 두 개의 사용자 장치들(예: 스마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨 터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같 은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상 의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따르면, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동 작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다. 도 2는 일 실시예에 따른 전자 장치에 포함된 하나 이상의 프로세서들을 설명하기 위한 블록도이다. 도 2 의 전자 장치는 도 1의 전자 장치에 대응할 수 있다.도 2를 참조하면, 일 실시예에 따른 전자 장치는 CPU, NPU, GPU 또는 메모리 중 적 어도 하나를 포함할 수 있다. 상기 CPU, 상기 NPU, 상기 GPU 및 상기 메모리는 통신 버스 (a communication bus)와 같은 전자 소자(electronical component)에 의해 서로 전기적으로 및/또는 작동 적으로 연결될 수 있다(electronically and/or operably coupled with each other). 상기 전자 장치에 포 함된 하드웨어 컴포넌트의 타입 및/또는 개수는 도 2에 도시된 바에 제한되지 않으며, 예를 들어, 상기 전자 장 치는 도 1의 디스플레이 모듈, 통신 모듈을 더 포함할 수 있다. 일 실시예에 따른 상기 전자 장치의 상기 CPU는 하나 이상의 인스트럭션에 기반하여 데이터를 처리하 기 위한 하드웨어 컴포넌트를 포함할 수 있다. 데이터를 처리하기 위한 하드웨어 컴포넌트는, 예를 들어, ALU(Arithmetic and Logic Unit), FPU(Floating Point Unit) 및/또는 FPGA(Field Programmable Gate Array)를 포함할 수 있다. 상기 FPU는 부동 소수점 연산을 효율적으로 처리하기 위한 모듈일 수 있다. 상기 ALU는 정수 연산을 효율적으로 처리하기 위한 모듈일 수 있다. 상기 CPU는 듀얼 코어(dual core), 쿼드 코어(quad core) 또는 헥사 코어(hexa core)와 같은 멀티-코어 프로세서의 구조를 가질 수 있다. 도 2의 상기 CPU는 도 1의 프로세서 및/또는 메인 프로세서의 일 예에 대응할 수 있다. 일 실시예에 따른 상기 전자 장치의 상기 GPU는 컴퓨터 그래픽과 관련된 인스트럭션의 실행에 필요한 복수의 동작을 수행하는 파이프라인을 하나 이상 포함할 수 있다. 예를 들어, 상기 GPU의 파이프라인은, 3 차원 이미지를 생성하고, 생성된 3차원 이미지로부터 2차원 래스터 이미지를 생성하기 위한 그래픽스 파이프라 인(graphics pipeline) 또는 렌더링 파이프라인(rendering pipeline)을 포함할 수 있다. 그래픽스 파이프라인 은, 상기 메모리에 저장된 파일에 포함되고, 셰이딩 언어(shading language)로 작성된 코드에 기반하여 제 어될 수 있다. 예를 들어, 셰이딩 언어로 작성된 코드가, 상기 CPU에 의해 상기 GPU에서 실행 가능한 인스트럭션으로 컴파일될 수 있다. 일 실시예에 따른 상기 전자 장치의 상기 NPU는 뉴럴 네트워크에 기반하는 하나 이상의 기능들을 지 원하기 위한 하드웨어 컴포넌트를 포함할 수 있다. 상기 뉴럴 네트워크는, 많은 수의 인공 뉴런(또는 노드)들을 이용하여 생물학적인 시스템의 계산 능력을 모방하는 소프트웨어나 하드웨어로 구현된 인식 모델이다. 본 개시 (present disclosure)에서, 뉴럴 네트워크는 모델로 지칭될(referred) 수 있다. 예를 들어, 일 실시예에 따른 상기 전자 장치는 뉴럴 네트워크에 기반하여, 인간의 인지 작용이나 학습 과정과 유사한 기능들을 실행할 수 있다. 일 실시예에서, 상기 NPU에 의해 지원되는, 상기 뉴럴 네트워크에 기반하는 하나 이상의 기능들 은, 뉴럴 네트워크를 트레이닝하는 기능, 트레이닝된 뉴럴 네트워크를 이용하여 영상 인식, 음성 인식 및/또는 필기 인식을 수행하는 기능, 뉴럴 네트워크에 기반하는, 상기 전자 장치의 사용자에게 개인화된 기능, API(Application Programming Interface)를 이용하여 어플리케이션에 기반하는 뉴럴 네트워크를 제어하는 기능 을 포함할 수 있다. 도 2의 상기 CPU, 상기 NPU 및 상기 GPU 각각은 상기 전자 장치에서 상이한 집적 회로들 (Integrated Circuits)로써 포함되거나, 또는 SoC(System on Chip)에 기반하는 단일 집적 회로(single IC)에 포함될 수 있다. 예를 들어, 상기 CPU, 상기 NPU, 상기 GPU 또는 이들의 조합이 상기 전자 장치 에 포함된 단일 집적 회로 내에 포함될 수 있다. SoC에 기반하여 포함되는 처리 유닛(processing unit)의 타입은 상기 예시에 제한되지 않으며, 예를 들어, 도 2에 도시되지 않은 다른 하드웨어 컴포넌트(예: 커뮤니케 이션 프로세서)가 상기 CPU, 상기 NPU 및 상기 GPU와 함께 단일 집적 회로 내에 포함될 수 있다. 일 실시예에 따른 상기 전자 장치의 상기 메모리는 상기 CPU, 상기 NPU 및/또는 상기 GPU에 입력 및/또는 출력되는 데이터 및/또는 인스트럭션을 저장하기 위한 하드웨어 컴포넌트를 포함할 수 있다. 상기 메모리는, 예를 들어, RAM(Random-Access Memory)와 같은 휘발성 메모리(Volatile Memory) 및/또는 ROM(Read-Only Memory)와 같은 비휘발성 메모리(Non-Volatile Memory)를 포함할 수 있다. 상기 휘발성 메모리는, 예를 들어, DRAM(Dynamic RAM), SRAM(Static RAM), Cache RAM, PSRAM (Pseudo SRAM) 중 적어도 하나를 포함할 수 있다. 상기 비휘발성 메모리는, 예를 들어, PROM(Programmable ROM), EPROM (Erasable PROM), EEPROM (Electrically Erasable PROM), 플래시 메모리, 하 드디스크, 컴팩트 디스크, eMMC(Embedded Multi Media Card) 중 적어도 하나를 포함할 수 있다. 도 2의 상기 메모리, 상기 휘발성 메모리 및 상기 비휘발성 메모리는, 도 1의 메모리, 휘발성 메모리 및 비휘발성 메모리 각각에 대응할 수 있다. 일 실시예에 따른 상기 전자 장치의 상기 메모리 내에, 뉴럴 네트워크의 연산을 위한 파라미터들의 집합이 저장될 수 있다. 상기 뉴럴 네트워크를 나타내는 파라미터들은, 예를 들어, 뉴럴 네트워크에 포함된 복 수의 노드들 및/또는 상기 복수의 노드들 사이의 연결에 할당되는(assigned) 가중치를 나타낼 수 있다. 일 실시 예에 따른 상기 전자 장치의 상기 메모리 내에 저장된 파라미터들의 집합에 의해 나타나는 뉴럴 네트 워크의 구조는 도 3을 참고하여 후술된다. 뉴럴 네트워크의 연산을 위한 요청에 기반하여, CPU, GPU, 또는 NPU 중 적어도 하나는, 상기 파라미터들의 집합에 기반하는 연산을 수행할 수 있다. 도 2를 참조하면, 상기 NPU는 뉴럴 엔진, 버퍼 및/또는 컨트롤러를 포함할 수 있다. 비록 도시되지 않았지 만, 상기 뉴럴 엔진, 상기 버퍼 및 상기 컨트롤러는 통신 버스와 같은 전자 소자에 의해 서로 전기적으로 및/또 는 작동적으로 연결될 수 있다. 일 실시예에 따르면, 상기 뉴럴 엔진 및/또는 컨트롤러는 소프트웨어적으로 구 현될 수 있다. 일 실시예에 따르면, 상기 뉴럴 엔진 및/또는 컨트롤러는 하드웨어적으로 구현될 수 있다. 일 실시예에 따른 상기 NPU는 네트워크와 관련된 기능을 실행하기 위해 요구되는 연산을 수행할 수 있다. 일 실시예에 따른 상기 NPU는, 연산을 수행하기 위하여 연산에 이용되는 하나 이상의 수치 값들(numeric values), 또는 출력된 하나 이상의 수치 값들을 적어도 일시적으로(at least temporarily) 저장할 수 있다. 일 실시예에 따른 상기 NPU의 상기 컨트롤러는, 상기 NPU에 포함된 상기 뉴럴 엔진에 기반하는 연산 을 제어할 수 있다. 일 실시예에 따르면, 상기 컨트롤러는 소프트웨어 모듈일 수 있다. 일 실시예에 따르면, 상 기 컨트롤러는 하드웨어 모듈일 수 있다. 일 실시예에 따른 상기 전자 장치는 복수의 데이터 타입들(data types)에 기반하여, 하나 이상의 비트들로 부터 특정 수치 값을 식별할 수 있다. 데이터 타입은, 전자 장치에 의한 하나 이상의 비트들의 해석을 위 해 사전에 정의된(predetermined) 카테고리일 수 있다. 예를 들어, 전자 장치는 하나 이상의 비트들의 집 합을, 상기 집합에 대응하는 데이터 타입에 기반하여 해석하여, 상기 집합에 의해 나타내어지는 데이터를 식별 할 수 있다. 예를 들어, 전자 장치가 메모리 내에 특정 수치 값을 나타내는 하나 이상의 비트들을 저 장하는 경우, 상기 메모리 내에서, 상기 특정 수치 값에 대응하는 비트들의 수가 데이터 타입에 따라 차별 화될 수 있다(may be differentiated). 일 실시예에 따른 상기 NPU는 복수의 데이터 타입들(data types) 각각에 대한 이진 산술 연산을 지원할 수 있다. 상기 NPU가 복수의 데이터 타입들의 이진 산술 연산을 지원함에 따라, 상기 버퍼가 보다 효율적으로 관리될 수 있다. 이하에서, 복수의 데이터 타입들은 상이한 정밀도들(precisions)을 가질 수 있다. 상술한 바와 같이, 일 실시예에 따른 상기 NPU는 지정된 데이터 타입에 기반하는 산술 연산의 수행을 지원 할 수 있다. 예를 들어, 상기 메모리에 저장된 뉴럴 네트워크에 포함된 데이터 타입과 상기 NPU에서 지원하는 데이터 타입이 다를 경우, 상기 NPU는 상기 다른 데이터 타입의 연산을 지원하지 않을 수 있다. 일 실시예에 따른, 전자 장치는, 상기 NPU, GPU(graphic processing unit), TPU(tensor processing unit), 및/또는 DSP(digital signal processor)와 같은 뉴럴 네트워크의 연산이 가능한 모듈에 의해 지원되는 정밀도(precision)(또는 데이터 타입)가 뉴럴 네트워크의 연산을 위해 제공된 파라미터들(예: 가중치 및/또는 바이어스(bias))의 정밀도(또는 데이터 타입)와 다른 경우, 양자화(quantization)와 같은 형 변환 알고리즘을 이용하여, 상기 파라미터들의 정밀도를 변경할 수 있다. 예를 들어, 상기 전자 장치는, 상기 CPU에 상기 파라미터들을 입력하여, 상기 뉴럴 네트워크와 관련된 연산을 수행하고, 상기 연산을 수행한 결과를 이용 하여, 상기 파라미터들의 정밀도를 변경할 수 있다. 양자화(quantization)란, 실수형 변수를 정수형 변수로 변환하는 동작을 의미할 수 있다. 예를 들면, 상기 CPU는 16 비트들에 기반하여 부동 소수점 수를 나타내는 데이터 타입의 변수를 8 비트들에 기반하여 정수 를 나타내는 데이터 타입의 변수로 변환할 수 있다. 예를 들면, 상기 CPU는 8 비트들에 기반하여 부동 소 수점 수를 나타내는 데이터 타입의 변수를 4 비트들에 기반하여 정수를 나타내는 데이터 타입의 변수로 변환할 수 있다. 상기 양자화를 통해 뉴럴 네트워크 모델의 연산량을 감소시키고, 상기 뉴럴 네트워크 모델의 사이즈를 줄일 수 있다. 상기 양자화를 수행하는 방식은 symmetric 방식과 asymmetric 방식으로 나눠질 수 있다. 상기 symmetric 방식을 통해 양자화 될 시, 상기 모델에 포함된 가중치 및/또는 바이어스의 값은 비례적으로 변환될 수 있다. 상기 asymmetric 방식을 통해 양자화 될 시, 상기 모델에 포함된 가중치 및/또는 바이어스의 값은 비례적이지 않게 변경될 수 있다. 예를 들어, asymmetric 방식에 기반하여, 부동 소수점 수를 표현하기 위한 제1 데이터 타입의 파라미터(예, 가중치 및/또는 바이어스)를, 정수를 표현하기 위한 제2 데이터 타입으로 양자화 하는 경우, 상기 제2 데이터 타입의 제1 정수에 매칭되는 상기 제1 데이터 타입의 제1 구간의 길이 및 상기 제2 데이터 타입의제2 정수에 매칭되는 상기 제1 데이터 타입의 제2 구간의 길이는 서로 다를 수 있다. 양자화를 수행하는 방식은 프로세서에서 지원되는 양자화 방식에 따라 정해질 수 있다. 상기 프로세서에서 asymmetric 방식으로 양자화가 가능할 시, 양자화는 asymmetric 방식으로 수행될 수 있다. 상기 프로세서는 양자화기를 통해 양자화를 수행할 수 있다. 상기 양자화기는, 모델의 연산을 위해 제공되는 어플리케이션 및/또는 API(application programming interface)(예: 런타임 라이브러리)를 포함할 수 있다. 실시예가 이에 제한되는 것은 아니며, 상기 양자화기는, 가속기 및/또는 상기 가속기를 제어하기 위한 어플리케이션(또는 명령어)의 조합을 포함할 수 있다. 일 실시예 에 따르면, 상기 양자화기는, 가중치 세트 및 바이어스를 양자화 하기 위한 소프트웨어 어플리케이션을 포함할 수 있다. 상기 가속기는 모델을 실행하기 위한 오퍼레이터에 대한 연산을 지원할 수 있다. 일 실시예에 따르면, 상기 모델은 머신 러닝 모델을 포함할 수 있다. 일 실시예에 따르면, 상기 가속기는 상기 프로세서 내의 하드웨 어 부품(예: 프로세서, 프로세서에 포함되는 부품, 프로세서와 별개의 부품) 및/또는 소프트웨어일 수 있다. 상 기 가속기의 종류에 대하여 도 2에 대하여 기재된 내용의 하단에 기재된 내용이 참조될 수 있다. 본 발명은 뉴 럴 네트워크 모델을 구성하는 개별적인 오퍼레이터 단위로 양자화를 수행할 수 있다. 개별적인 오퍼레이터에 대 한 양자화 동작은 도 4에서 기술된다. 양자화 된 오퍼레이터는 양자화 전 오퍼레이터의 해시 값과 함께 저장될 수 있다. 상기 전자 장치는, 양자화 된 뉴럴 네트워크 모델에 대한 연산을 수행 시, 양자화 전 오퍼레이터에 대 한 연산을 양자화 된 가중치 및 바이어스에 기반하여 수행할 수 있다. 상기 양자화 된 가중치 및 바이어스는 저 장된 해시 값에 기반하여 식별될 수 있다. 상기 전자 장치는, 양자화가 완료된 후, 양자화된 뉴럴 네트워크 모 델에 대해서 신뢰도 평가를 수행하고, 상기 신뢰도 평가를 통과한 뉴럴 네트워크 모델로 양자화 전 모델을 대체 할 수 있다. 상기 신뢰도 평가에 대한 동작은 도 6에서 기술된다. 상기 뉴럴 네트워크 모델이 신뢰도 평가를 통 과하지 못할 시, 양자화 전 뉴럴 네트워크 모델은 서버에서 다시 양자화될 수 있다. 상기 서버는 여러 전자 장 치(예: 단말기)로부터 서브 출력 데이터를 송신하고, 송신된 데이터를 통해 양자화 전 뉴럴 네트워크 모델에 대 한 양자화를 수행할 수 있다. 상기 서버를 통한 양자화에 대한 동작은 도 8에서 기술된다. 이하에서, 본 개시의 실시예들을 설명하기에 앞서, 실시예들에 따른 전자 장치의 동작들을 설명하기 위해 필요 한 용어들이 정의된다. 일 실시예에 따르면, 양자화기란, 제1 데이터 타입의 제1 가중치 및 바이어스를 양자화 하여 제2 데이터 타입의 제2 가중치 및 바이어스를 생성하는 소프트웨어 어플리케이션일 수 있다. 상기 프로세서는 양자화기를 통 해 양자화를 수행할 수 있다. 상기 양자화기는, 모델의 연산을 위해 제공되는 어플리케이션 및/또는 API(application programming interface)(예: 런타임 라이브러리)를 포함할 수 있다. 실시예가 이에 제한되는 것은 아니며, 상기 양자화기는, 가속기 및/또는 상기 가속기를 제어하기 위한 어플리케이션(또는 명령어)의 조 합을 포함할 수 있다 일 실시예에 따르면, 가속기란, 오퍼레이터에 대한 연산을 지원하기 위한 하드웨어 부품 또는 소프트웨어 어플 리케이션일 수 있다. 상기 가속기는 모델을 실행하기 위한 오퍼레이터에 대한 연산을 지원할 수 있다. 일 실시 예에 따르면, 상기 모델은 머신 러닝 모델을 포함할 수 있다. 일 실시예에 따르면, 상기 가속기는 상기 프로세 서 내의 하드웨어 부품을 포함할 수 있다. 예를 들면, 상기 가속기는 CPU(central processing unit)내의 CME(cortex matrix engine)를 포함할 수 있다. 예를 들면, 상기 가속기는 GPU(graphic processing unit) 내의 TPU(tensor processing unit)를 포함할 수 있다. 일 실시예에 따르면, 상기 가속기는 상기 프로세서에 의 해 실행되는 소프트웨어를 포함할 수 있다. 예를 들면, 상기 가속기는 상기 CPU, NPU(neural processing unit), 또는 GPU 중 적어도 하나에 의해 실행되는 소프트웨어 어플리케이션일 수 있다. 일 실시예에 따르면, 상 기 가속기는 상기 모델을 실행할 수 있는 프로세서일 수 있다. 예를 들면, 상기 가속기는 CPU를 포함할 수 있다. 예를 들면, 상기 가속기는 NPU를 포함할 수 있다. 예를 들면, 상기 가속기는 GPU를 포함할 수 있다. 예를 들면, 상기 가속기는 TPU를 포함할 수 있다. 이하 도 3에서, 일 실시예에 따른 뉴럴 네트워크의 일 예가 설명된 다. 도 3은 일 실시예에 따른 전자 장치에서 실행되는 뉴럴 네트워크를 설명하기 위한 예시적인 도면이다. 도 3의 전자 장치는 도 1 및/또는 도 2의 전자 장치의 일 예에 대응할 수 있다. 도 3의 뉴럴 네트워크는, 예를 들어, 일 실시예에 따른 전자 장치에 의하여 메모리(예: 도 1 및/또는 도 2의 메모리 ) 내에 저장된 파라미터들의 집합으로부터 획득될 수 있다. 도 3을 참조하면, 뉴럴 네트워크는 복수의 레이어들을 포함할 수 있다. 예를 들어, 뉴럴 네트워크는 입력 레이어, 하나 이상의 히든 레이어들 및 출력 레이어를 포함할 수 있다. 상기 입력 레이어는 상기 뉴럴 네트워크의 입력 데이터를 나타내는 벡터 및/또는 매트릭스에 대응할 수 있다. 예를 들 어, 상기 입력 데이터를 나타내는 벡터는, 상기 입력 레이어에 포함된 노드들의 개수에 대응하는 원소들 (elements)을 가질 수 있다. 예를 들어, 상기 입력 데이터를 나타내는 매트릭스에 포함된 원소들은, 상기 입력 레이어에 포함된 노드들 각각에 대응할 수 있다. 상기 입력 데이터에 의해 발생된, 상기 입력 레이어 내 노드들 각각에서 발생된 신호들은, 상기 입력 레이어에서 상기 히든 레이어들에게 송신될 수 있다. 상기 출력 레이어는, 상기 히든 레이어들로부터 수신된 하나 이상의 신호들에 기반하여, 상기 뉴럴 네트워크의 출력 데이터를 생성할 수 있다. 상기 출력 데이터는, 예를 들어, 상기 출력 레이어 에 포함된 노드들의 개수에 대응하는 원소들을 가지는 벡터 및/또는 매트릭스에 대응할 수 있다. 일 실시예에서, 상기 뉴럴 네트워크에 포함된 복수의 레이어들 중 특정 레이어에 포함된 제1 노드들은, 상 기 복수의 레이어들의 시퀀스 내에서 상기 특정 레이어의 이전 레이어의 제2 노드들 중 적어도 하나의 가중합 (weighted sum)에 대응할 수 있다. 일 실시예에 따른 상기 전자 장치는 상기 메모리 내에 저장된 파라미터 들의 집합으로부터, 상기 제2 노드들 중 적어도 하나에 적용될 가중치를 식별할 수 있다. 상기 뉴럴 네트워크 를 트레이닝 하는 것은, 상기 가중합과 관련된 하나 이상의 가중치들을 변경 및/또는 결정하는 동작을 포 함할 수 있다. 도 3을 참조하면, 하나 이상의 히든 레이어들이 상기 입력 레이어 및 상기 출력 레이어 사이에 위치할 수 있고, 상기 입력 레이어를 통해 전달된 입력 데이터를 예측하기 쉬운 값으로 변환할 수 있다. 상기 입력 레이어, 상기 하나 이상의 히든 레이어들 및 상기 출력 레이어는 복수의 노드들을 포 함할 수 있다. 하나 이상의 히든 레이어들은 CNN(convolutional neural network)에서의 콘볼루션 필터 (convolution filter) 또는 완전 연결 레이어(fully connected layer)이거나, 특별한 기능이나 특징을 기준으 로 묶인 다양한 종류의 필터 또는 레이어일 수 있다. 일 실시예에서, 상기 하나 이상의 히든 레이어들은 출력 값이 현재 시간의 히든 레이어에 다시 입력되는 리커런트 뉴럴 네트워크(recurrent neural network, RNN) 에 기반하는 레이어일 수 있다. 일 실시예에 따른 상기 뉴럴 네트워크는 다수의(numerous) 히든 레이어들 을 포함하여, 딥 뉴럴 네트워크(deep neural network)를 형성할 수 있다. 딥 뉴럴 네트워크를 학습시키는 것을 딥 러닝(deep learning)이라 한다. 상기 뉴럴 네트워크의 노드 중에서, 히든 레이어들에 포함된 노드를 가리켜 히든 노드라 한다. 상기 입력 레이어 및 상기 하나 이상의 히든 레이어들에 포함된 노드들은 연결 가중치를 가지는 연결 선을 통해 서로 연결될 수 있고, 상기 히든 레이어 및 상기 출력 레이어에 포함된 노드들도 연결 가중치를 가지는 연결선을 통해 서로 연결될 수 있다. 상기 뉴럴 네트워크를 튜닝 및/또는 트레이닝하는 것은, 상기 뉴럴 네트워크에 포함된 레이어들(예: 입력 레이어, 하나 이상의 히든 레이어들 및 출력 레이어 ) 각각에 포함된 노드들 사이의 연결 가중치를 변경하는 것을 의미할 수 있다. 상기 뉴럴 네트워크의 튜닝은, 예를 들어, 지도 학습(supervised learning) 및/또는 비지도 학습(unsupervised learning)에 기반하여 수행될 수 있다. 일 실시예에 따른 전자 장치는, 비지도 학습에서 강화 학습(reinforcement learning)에 기반하여 상기 뉴럴 네 트워크를 튜닝할 수 있다. 예를 들어, 전자 장치는, 상기 뉴럴 네트워크가 에이전트를 제어하기 위해 이용하는 정책 정보를, 에이전트 및 환경 사이의 상호 작용(interaction)에 기반하여 변경할 수 있다. 일 실시 예에 따른 전자 장치는, 상기 상호 작용에 의한 상기 에이전트의 목표 및/또는 보상을 극대화하기 위하여, 상기 뉴럴 네트워크에 의한 상기 정책 정보의 변경을 야기할 수 있다. 예를 들어, 상기 뉴럴 네트워크를 획득하는 상태에서, 일 실시예에 따른 전자 장치는 메모리에 저장된 상 기 입력 레이어, 상기 하나 이상의 히든 레이어들 및/또는 상기 출력 레이어 사이를 연결하는 연결선에 대응하는 가중치를 식별할 수 있다. 식별된 가중치에 기반하여 상기 뉴럴 네트워크로부터 출력 데이터를 획득하기 위하여, 상기 전자 장치는, 상기 뉴럴 네트워크의 복수의 레이어들(예: 상기 입력 레이 어, 상기 하나 이상의 히든 레이어들 및 상기 출력 레이어)을 따라 순차적으로, 상기 연결선에 기반하는 가중합을 획득할 수 있다. 획득된 가중합은, 도 2의 NPU 및/또는 메모리 내에 저장될 수 있 다. 예를 들어, 전자 장치는 복수의 레이어들을 따라 순차적으로 가중합을 획득함에 따라, 메모리 내에 저장된 가중합을 반복적으로 갱신할 수 있다. 상기 뉴럴 네트워크의 복수의 레이어들 각각은 독립적인 데이터 타입 및/또는 정밀도를 가질 수 있다. 예 를 들어, 상기 복수의 레이어들 중 제1 레이어 및 제2 레이어 사이의 연결선들이 부동 소수점 수(floating point number)를 나타내기 위한 제1 데이터 타입에 기반하는 가중치들을 가지는 경우, 상기 전자 장치는 상기제1 레이어의 노드들에 대응하는 수치 값들 및 상기 가중치들로부터, 상기 제1 데이터 타입에 기반하는 가중합 들을 획득할 수 있다. 상기 예시에서, 복수의 레이어들 중 제2 레이어 및 제3 레이어 사이의 연결선들이 정수 (integer number)를 나타내기 위한 제2 데이터 타입에 기반하는 가중치들을 가지는 경우, 전자 장치는 획득된 가중합들 및 상기 제2 데이터 타입에 기반하는 가중치들로부터, 상기 제2 데이터 타입에 기반하는 가중합들을 획득할 수 있다. 복수의 레이어들이 상이한 데이터 타입들을 가지는 경우, 일 실시예에 따른 상기 전자 장치는, 예를 들어, 도 2 의 NPU를 이용하여, 상이한 데이터 타입들에 기반하여 상기 복수의 레이어들 각각에 대응하는 가중합들을 획득할 수 있다. 상기 전자 장치가 상이한 데이터 타입들에 기반하여 획득된 가중합들에 기반하여 메모리에 액 세스함에 따라, 상기 메모리의 대역폭이 보다 효율적으로 이용될 수 있다. 메모리의 대역폭이 보다 효율적으로 이용됨에 따라, 일 실시예에 따른 상기 전자 장치는 상기 복수의 레이어들에 기반하는 상기 뉴럴 네트워크(30 0)로부터, 출력 데이터를 보다 신속하게 획득할 수 있다. 일 실시예에 따른 전자 장치는 상이한 정밀도들을 가지는 복수의 뉴럴 네트워크들 각각을 나타내는 파라미터들 의 집합들을 저장할 수 있다. 예를 들어, 이미지 및/또는 비디오를 업스케일링(upscaling)하기 위한 초해상도 (super resolution)와 관련된 뉴럴 네트워크는, 32 비트들에 기반하여 부동 소수점 수를 나타내기 위한 데이터 타입의 정밀도를 요구할 수 있다. 예를 들어, 이미지 및/또는 비디오를 업스케일링(upscaling)하기 위한 초해상 도(super resolution)와 관련된 뉴럴 네트워크는, 16 비트들에 기반하여 부동 소수점 수를 나타내기 위한 데이 터 타입(예: IEEE 754에 의하여 정의된 반-정밀도 부동 소수점 포맷(half-precision floating point format)) 의 정밀도를 요구할 수 있다. 예를 들어, 이미지 및/또는 비디오에 포함된 피사체를 인식하기 위한 뉴럴 네트워 크는, 8 비트들 및/또는 4 비트들에 기반하여 정수를 나타내기 위한 데이터 타입의 정밀도를 요구할 수 있다. 예를 들어, 필기 인식을 수행하기 위한 뉴럴 네트워크는, 제1 비트 및/또는 제2 비트들에 기반하여 정수를 나타 내기 위한 데이터 타입의 정밀도를 요구할 수 있다. 일 실시예에 따른 전자 장치는 복수의 뉴럴 네트워크들 각 각에 대응하는 상이한 정밀도들에 기반하여, 가중합을 획득하기 위한 연산을 수행할 수 있다. 이하 도 4에서, 뉴럴 네트워크 내의 레이어의 가중치를 변경하는 양자화 동작이 기술된다. 도 4는 일 실시예에 따른 가중치에 대한 양자화를 설명하기 위한 예시적인 도면이다. 이하, 뉴럴 네트워크 모델 에 포함된 레이어(예: 도 3의 입력 레이어, 히든 레이어들, 및/또는 출력 레이어)는 적어도 하 나의 오퍼레이터에 대응할 수 있다. 도 4를 참조하면, 모델은 제1 데이터 타입의 제1 가중치 세트를 갖는 제1 오퍼레이터를 포함할 수 있 다. 모델은 모델이 양자화 됨으로써 생성될 수 있다. 예를 들어, 모델의 양자화는, 모델로 부터 획득될 수 있다. 상기 제1' 오퍼레이터는 상기 제1 오퍼레이터가 양자화 됨으로써 생성될 수 있 다. 상기 입력 데이터에 기반하여 모델(401, 403)에 포함된 연산에 의해 출력 데이터가 생성될 수 있다. 모델 은 제2 데이터 타입의 제2 가중치 세트를 갖는 제1' 오퍼레이터를 포함할 수 있다. 일 실시예에서, 오퍼레이터는, 뉴럴 네트워크 및/또는 모델에 의해 수행되는 연산의 단위일 수 있다. 예를 들어, 모델은, 상이 한 파라미터들(예: 가중치들 및/또는 바이어스들)에 의해 구분되는 오퍼레이터들의 순차적인 연결에 의해 형성 될 수 있다. 일 실시예에 따르면, 상기 모델은 적어도 하나의 오퍼레이터를 포함할 수 있다. 상기 제1 오퍼레이터(40 5)는 상기 모델에 포함된 적어도 하나의 오퍼레이터 중 하나일 수 있다. 상기 제1 오퍼레이터는 제1 데이터 타입의 제1 가중치 세트와 바이어스를 포함할 수 있다. 예를 들어, 상기 제1 데이터 타입은 부동 소수점 수(floating point number)를 나타낼 수 있다. 일 예로 상기 제1 데이터 타입은 32 비트들을 이용하여 부동 소 수점 수를 나타낼 수 있다. 일 예로 상기 제1 데이터 타입은 16 비트들을 이용하여 부동 소수점 수를 나타낼 수 있다. 예를 들어, 상기 제2 데이터 타입은 정수를 나타낼 수 있다. 일 예로 상기 제2 데이터 타입은 8 비트들을 이용하여 정수를 나타낼 수 있다. 일 예로 상기 제2 데이터 타입은 4 비트들을 이용하여 정수를 나타낼 수 있다. 단, 본 개시의 실시예는 이에 한정되지 않는다. 전자 장치(예: 도 1의 전자 장치)가 상기 제1 데이 터 타입 보다 상기 제2 데이터 타입의 정밀도(precision), 및/또는 범위(range)가 낮고, 상기 제1 데이터 타입 또는 상기 제2 데이터 타입 중에서, 상기 제2 데이터 타입에 기반하는 모델의 연산을 할 수 있는 경우, 후술되 는 양자화 기능을 실행할 수 있다. 상기 모델에서, 적어도 하나의 프로세서(예: 도 1의 프로세서)는, 입력 데이터로부터 제1 오퍼레이터의 연산을 통해 제1 서브 출력 데이터를 획득할 수 있다. 상기 제1 서브 출력 데이터는 상기 제1 오퍼레이터에 연결된 제2 오퍼레이터에 입력 데이터로 입력될 수 있다. 상기 적어도 하나의프로세서는 상기 제1 서브 출력 데이터로부터 제2 오퍼레이터의 연산을 통해 제2 서브 출력 데이터를 획득 할 수 있다. 상기 제2 서브 출력 데이터는 상기 제2 오퍼레이터에 연결된 제3 오퍼레이터에 입력 데이터로 입력 될 수 있다. 상기 적어도 하나의 프로세서는, 서브 출력 데이터에 대한 출력 오퍼레이터의 연산을 통해, 상기 모델의 출력 데이터를 획득할 수 있다. 상기 출력 오퍼레이터는 상기 뉴럴 네트워크 모델의 출력 데이터를 생성할 수 있다. 일 실시예에 따르면, 상기 제1 오퍼레이터에 포함된 제1 가중치 세트의 상기 제1 데이터 타입이 상기 가속 기에 의해 지원되는 상기 제2 데이터 타입과 상이할 시, 상기 적어도 하나의 프로세서는 상기 제1 데이터 타입의 제1 가중치 세트를 제2 데이터 타입의 제2 가중치 세트로 변경할 수 있다. 예를 들어, 상기 적어도 하나 의 프로세서는 16 비트들을 이용하여 나타낸 부동 소수점 수인 제1 가중치 세트를 8 비트들을 이용하여 나 타낸 정수인 제2 가중치 세트로 변경할 수 있다. 예를 들어, 상기 적어도 하나의 프로세서는 32 비트들을 이용하여 나타낸 부동 소수점 수인 제1 가중치 세트를 4 비트들을 이용하여 나타낸 정수인 제2 가중치 세트로 변경할 수 있다. 가속기란, 오퍼레이터에 대한 연산을 지원하기 위한 하드웨어 부품 또는 소프트웨어 어플리케 이션일 수 있다. 상기 가속기는 모델을 실행하기 위한 오퍼레이터에 대한 연산을 지원할 수 있다. 일 실시예에 따르면, 상기 모델은 머신 러닝 모델을 포함할 수 있다. 상기 가속기의 종류에 대하여 도 2에 대하여 기재된 내 용의 하단에 기재된 내용이 참조될 수 있다. 상기 가속기는, 뉴럴 네트워크와 관련된 연산을 처리할 수 있다. 예를 들어, 상기 가속기는, 특정 데이터 타입의 부동 소수점 수 및/또는 정수를 요구하는 행렬 연산을 수행할 수 있다. 상기 행렬 연산은, 상이한 행렬들의 곱셈 연산을 포함할 수 있다. 상기 행렬 연산을 수행하기 위하여, 가속기는, 특정 데이터 타입의 부동 소수점 수 및/또는 정수의 곱셈 연산을 위한 복수의 FPU들 및/또는 복수의 ALU(arithmetic logic unit)들을 포함할 수 있다. 일 실시예에 따르면, 오퍼레이터에 따라 가중치 세트의 데이터 타입이 다를 수 있다. 그러므로, 개별 오퍼레이 터의 데이터 타입에 기반하여 개별 오퍼레이터의 양자화 여부가 결정될 수 있다. 일 실시예에 따르면, 상기 적어도 하나의 프로세서는, 개별적인 오퍼레이터의 연산에 기반하여 입력 데이 터의 세트로부터 서브 출력 데이터의 세트를 획득할 수 있다. 상기 적어도 하나의 프로세서는, 적어도 하 나의 오퍼레이터에 대한 연산을 수행함으로써 입력 데이터의 세트로부터 출력 데이터의 세트를 획득할 수 있다. 상기 적어도 하나의 프로세서는, 상기 입력 데이터의 세트, 상기 서브 출력 데이터의 세트, 및 출력 데이 터의 세트를 프로파일 정보로 저장할 수 있다. 일 실시예에 따르면, 상기 제2 데이터 타입의 상기 제2 가중치 세트를 획득하기 위하여, 상기 적어도 하나의 프 로세서는, 상기 서브 출력 데이터의 세트의 분포에 기반하여, 상기 제1 가중치 세트에 대한 양자화를 수행 함으로써 상기 제2 가중치 세트를 획득할 수 있다. 예를 들어, 상기 적어도 하나의 프로세서는, 실 사용 데이터인 입력 데이터의 세트에 대하여 상기 제1 오 퍼레이터에 대한 연산을 수행함으로써 서브 출력 데이터의 세트를 획득할 수 있다. 상기 제1 오퍼레이터 의 제1 가중치에 대한 양자화는 상기 서브 출력 데이터의 구간에 기반하여 생성될 수 있다. 일 예로, 부동 소수점 수를 표현하기 위한 제1 데이터 타입이 표현할 수 있는 숫자 구간은 제1 구간일 수 있다. 정수를 표현하 기 위한 제2 데이터 타입이 표현할 수 있는 숫자 구간은 제2 구간일 수 있다. 일 예로, 상기 제1 구간은 음의 무한대에서 양의 무한대까지 일 수 있다. 일 예로, 상기 제2 구간은 8 비트들로 표현하는 데이터 타입의 경우, -128에서 127까지일 수 있다. 일 예로, 상기 제2 구간은 16 비트로 표현하는 데이터 타입의 경우, -32768에서 32767까지일 수 있다. 일 예로, 상기 서브 출력 데이터의 세트가 -120에서 110 사이의 값을 가질 경우, 상기 제 1 오퍼레이터의 제1 가중치 세트는 부동 소수점 수를 표현하기 위한 데이터 타입 대신 8 비트들의 정수로 표현되는 데이터 타입으로 기재되는 것이, 연산 속도 및 가속기 사용에 있어 유리할 수 있다. 그러므로, 상기 적어도 하나의 프로세서는, 상기 서브 출력 데이터의 구간에 기반하여, 상기 제1 가중치 세트의 데이터 타 입을 변경할 수 있다. 상기 적어도 하나의 프로세서는, 양자화를 통해 상기 제1 구간의 수를 표현하기 위 한 제1 데이터 타입의 상기 제1 가중치 세트로부터 상기 제1 구간의 길이보다 작은 길이를 갖는 제2 구간의 수 를 표현하기 위한 제2 데이터 타입의 제2 가중치 세트를 획득할 수 있다. 상기 적어도 하나의 프로세서는, 양자화된 제2 가중치 세트를 메모리에 저장할 수 있다. 상기 적어도 하나의 프로세서는, 뉴럴 네트워크 모 델이 실행될 시, 상기 제2 가중치 세트에 기반하여 상기 제1 오퍼레이터에 대한 연산을 수행함으로써, 출 력 데이터를 획득할 수 있다. 일 실시예에 따르면, 상기 양자화는 오퍼레이터 별로 수행될 수 있다. 제1 오퍼레이터의 가중치 세트의 데이터 타입이 가속기가 지원하는 데이터 타입과 달라, 제1 오퍼레이터에 대해 양자화가 진행되더라도, 제2 오퍼레이터의 가중치 세트의 데이터 타입이 가속기가 지원하는 데이터 타입과 같다면 제2 오퍼레이터에 대해 양자화가 진 행되지 않을 수 있다. 일 실시예에 따르면, 상기 적어도 하나의 프로세서는, 상기 제1 가중치 세트의 해시 값과 함께, 상기 제2 가중치 세트를 상기 메모리에 저장할 수 있다. 상기 적어도 하나의 프로세서는, 상기 모델이 양자화 된 후, 상기 모델이 실행될 시, 상기 제1 가중치 세트의 해시 값에 기반하여 제2 가중치 세트를 식별할 수 있다. 상기 적어도 하나의 프로세서는, 상기 제1 가중치 세트의 해시 값에 대응하는 제2 가중치 세트에 기 반하여, 상기 제1 오퍼레이터에 대한 연산을 수행할 수 있다. 일 실시예에 따르면, 가속기란, 오퍼레이터에 대한 연산을 지원하기 위한 하드웨어 부품 또는 소프트웨어 어플 리케이션일 수 있다. 상기 가속기는 모델을 실행하기 위한 오퍼레이터에 대한 연산을 지원할 수 있다. 일 실시 예에 따르면, 상기 모델은 머신 러닝 모델을 포함할 수 있다. 상기 가속기의 종류에 대하여 도 2에 대하여 기재 된 내용의 하단에 기재된 내용이 참조될 수 있다. 상기 가속기는, 뉴럴 네트워크와 관련된 연산을 처리할 수 있다. 예를 들어, 상기 가속기는, 특정 데이터 타입 의 부동 소수점 수 및/또는 정수를 요구하는 행렬 연산을 수행할 수 있다. 상기 행렬 연산은, 상이한 행렬들의 곱셈 연산을 포함할 수 있다. 상기 행렬 연산을 수행하기 위하여, 가속기는, 특정 데이터 타입의 부동 소수점 수 및/또는 정수의 곱셈 연산을 위한 복수의 FPU들 및/또는 복수의 ALU(arithmetic logic unit)들을 포함할 수 있다. 상기 FPU는 부동 소수점 연산을 효율적으로 처리하기 위한 모듈일 수 있다. 상기 ALU는 정수 연산을 효율 적으로 처리하기 위한 모듈일 수 있다. 상기 가속기는 모델에 따라 높은 정밀도를 갖는 데이터의 연산은 지원하 지 않을 수 있다. 예를 들어, 상기 가속기는 부동 소수점 수를 표현하기 위한 제1 데이터 타입이 아닌 정수를 표현하기 위한 제2 데이터 타입에 기반하는 연산을 수행할 수 있다. 예를 들어, 상기 가속기는 64 비트들을 통 해 정수를 표현하기 위한 제1 데이터 타입이 아닌 8 비트들을 통해 정수를 표현하기 위한 제2 데이터 타입에 기 반하는 연산을 수행할 수 있다. 상기 가속기는 범용성을 위해 주로 낮은 정밀도를 갖는 연산을 수행할 수 있다. 그러므로, 상기 적어도 하나의 프로세서는 제1 데이터 타입의 제1 가중치 세트를 제2 데이터 타입의 제2 가중치 세트로 변경함으로써 가속기 활용도를 높일 수 있다. 일 실시예에 따르면, 상기 모델은 적어도 하나의 오퍼레이터를 포함할 수 있다. 상기 제1' 오퍼레이터 는 상기 모델에 포함된 적어도 하나의 오퍼레이터 중 하나일 수 있다. 상기 제1' 오퍼레이터는 제2 데이터 타입에 기반한 제2 가중치 세트와 바이어스를 포함할 수 있다. 예를 들어, 상기 제2 데이터 타입은 부동 소수점 수(floating point number)를 나타낼 수 있다. 일 예로 상기 제2 데이터 타입은 16 비트들을 이용 하여 부동 소수점 수를 나타낼 수 있다. 예를 들어, 상기 제2 데이터 타입은 정수를 나타낼 수 있다. 일 예로 상기 제2 데이터 타입은 8 비트들을 이용하여 정수를 나타낼 수 있다. 일 예로 상기 제2 데이터 타입은 4 비트 들을 이용하여 정수를 나타낼 수 있다. 일 예로 상기 제2 데이터 타입은 2 비트들을 이용하여 정수를 나타낼 수 있다. 도 5는 일 실시예에 따른 전자 장치에 포함된 메모리의 동작을 설명하기 위한 블록도이다. 도 5를 참조하면, 전자 장치(예: 도 1의 전자 장치)는 메모리, 제1 프로세서, 및 제2 프로세서 를 포함할 수 있다. 상기 메모리는 프로파일 정보를 저장할 수 있다. 상기 프로파일 정보 는 입력 데이터, 모델에 대한 데이터, 및 출력 데이터를 포함할 수 있다. 상기 모델은 제K 오퍼레이터를 포함한 적어도 하나의 오퍼레이터를 포함할 수 있다. 상기 제K 오퍼레이터는 제1 가중 치 세트와 바이어스를 포함할 수 있다. 상기 제K 오퍼레이터는 양자화기를 통해 양자화 될 수 있다. 상기 제K 오퍼레이터는 양자화 과정을 거쳐 제K' 오퍼레이터로 변경될 수 있다. 제1 프로세서는 양자화기를 포함할 수 있다. 상기 제1 프로세서 및/또는 상기 제2 프로세서는 FPU(floating point unit) 및/또는 가속기를 포함할 수 있다. 가속기란, 오퍼레이터에 대한 연산을 지원하기 위한 하드웨어 부품 또는 소프트웨어 어플리케이션일 수 있다. 상기 가속기는 모델을 실행하기 위한 오퍼레이터에 대한 연산을 지원할 수 있다. 일 실시예에 따르면, 상기 모델은 머신 러닝 모델을 포함할 수 있다. 상기 가속기의 종류에 대 하여 도 2에 대하여 기재된 내용의 하단에 기재된 내용이 참조될 수 있다. 상기 메모리, 제1 프로세서 , 및 제2 프로세서는, 통신 버스(a communication bus)와 같은 전자 부품(electronical component)에 의해 서로 전기적으로 및/또는 작동적으로 연결될 수 있다(electronically and/or operably coupled with each other). 이하에서, 하드웨어들이 작동적으로 결합된 것은, 하드웨어들 중 제1 하드웨어에 의 해 제2 하드웨어가 제어되도록, 하드웨어들 사이의 직접적인 연결, 또는 간접적인 연결이 유선으로, 또는 무선으로 수립된 것을 의미할 수 있다. 일 실시예에 따르면, 상기 프로세서(예: 제1 프로세서 및/또는 제2 프 로세서)는 상기 FPU를 통해 상기 FPU가 지원하는 데이터 타입을 갖는 오퍼레이터들에 대한 연산을 수행할 수 있다. 단, 본 개시의 실시예는 이에 한정되지 않을 수 있다. 일 실시예에 따르면, 상기 프로세서는 상기 가 속기를 통해 상기 가속기가 지원하는 데이터 타입을 갖는 오퍼레이터들에 대한 연산을 수행할 수 있다. 단, 본 개시의 실시예는 이에 한정되지 않을 수 있다. 일 실시예에 따르면, 상기 양자화기는, 가중치 세트 및 바이어스 를 양자화 하기 위한 소프트웨어 어플리케이션일 수 있다. 상기 제1 프로세서는 상기 양자화기를 통 해 제1 데이터 타입의 제1 가중치 및 바이어스를 제2 데이터 타입의 제2 가중치 및 바이어스로 양자화 할 수 있 다. 일 실시예에 따르면 상기 제1 프로세서는 CPU(central processing unit)일 수 있다. 상기 제1 프로세서 는 상기 양자화기를 통해 제k 오퍼레이터의 제1 가중치 및 바이어스를 양자화 하여 제k' 오퍼레 이터를 생성할 수 있다. 상기 FPU는 양자화 되기 전의 높은 정밀도(high precision)를 요구하는 제1 데이 터 타입의 제1 가중치에 대하여 연산을 수행할 수 있다. 상기 FPU는 부동 소수점 연산을 효율적으로 처리하기 위한 모듈일 수 있다. 상기 양자화기는, 모델의 연산을 위해 제공되는 어플리케이션 및/또는 API(application programming interface)(예: 런타임 라이브러리)를 포함할 수 있다. 실시예가 이에 제한되는 것은 아니며, 상기 양자화기는, 가속기 및/또는 상기 가속기를 제어하기 위한 어플리케이션의 조합을 포함 할 수 있다. 일 실시예에 따르면, 상기 양자화기는, 상기 가속기에 의해 연산되는 가중치 세트 및 바이어 스를 양자화 하기 위한 소프트웨어 어플리케이션일 수 있다. 상기 프로세서는 상기 양자화기를 통해 제1 데이터 타입의 제1 가중치 및 바이어스를 제2 데이터 타입의 제2 가중치 및 바이어스로 양자화 할 수 있다. 상 기 가속기는 모델을 실행하기 위한 오퍼레이터에 대한 연산을 지원할 수 있다. 일 실시예에 따르면, 상기 제1 프로세서는 오퍼레이터에 대한 연산(computation)을 위한 상기 가속기에 의 해 지원되는 상기 제2 데이터 타입을 식별할 수 있다. 상기 제2 데이터 타입은 낮은 정밀도(low precision)에 대응할 수 있다. 예를 들어, 상기 가속기는 8 비트들의 정수로 표현되는 데이터 타입과 16 비트들의 정수로 표 현되는 데이터 타입만을 지원할 수 있다. 상기 제1 프로세서는 상기 제2 데이터 타입과 상이한 상기 제1 오퍼레이터에 포함된 제1 가중치 세트의 제1 데이터 타입을 식별할 수 있다. 예를 들어, 상기 제1 데이터 타입 은 32 비트들의 부동 소수점 수로 표현되는 데이터 타입일 수 있다. 상기 제1 프로세서는 상기 제2 데이터 타입과 상이한 상기 제1 데이터 타입을 식별함에 기반하여, 상기 모델에 포함된 적어도 하나의 오퍼레이터 중 하나인 상기 제k 오퍼레이터에 포함된 상기 제1 데이터 타입의 상기 제1 가중치 세트를 획득할 수 있다. 예를 들어, 상기 모델의 제k 오퍼레이터가 32 비트들의 부동 소수점 수로 표현되는 제1 데이터 타입의 제1 가중치를 갖고, 상기 가속기들은 8 비트들의 정수로 표현되는 제2 데이터 타입을 지원할 수 있다. 상기 제1 프로세서는 상기 제1 데이터 타입과 상기 제2 데이터 타입이 상이함을 식별함에 기반하여, 상기 제k 오퍼레이터의 제1 가중치 세트를 획득할 수 있다. 일 실시예에 따르면, 상기 제1 프로세서는 상기 획득한 제1 가중치 세트를 양자화 할 수 있다. 일 실시예 에 따르면, 상기 제2 데이터 타입의 상기 제2 가중치 세트를 획득하기 위하여, 상기 제1 프로세서는, 상기 서브 출력 데이터의 세트의 분포에 기반하여, 상기 제1 가중치 세트에 대한 양자화를 수행함으로써 상기 제2 가 중치 세트를 획득할 수 있다. 예를 들어, 상기 서브 출력 데이터의 세트가 -120에서 110 사이의 값을 가질 경우, 상기 제k 오퍼레이터의 제1 가중치 세트는 부동 소수점 수를 표현하기 위한 데이터 타입 대신 가속기에 의해 지원되는 8 비트들의 정수로 표현되는 데이터 타입으로 기재되는 것이, 연산 속도 및 전자 장치에 포함되 는 가속기 사용에 있어 유리할 수 있다. 그러므로, 상기 제1 프로세서는, 상기 서브 출력 데이터의 구간에 기반하여, 상기 제1 가중치 세트의 데이터 타입을 변경할 수 있다. 상기 제1 프로세서는, 양자화를 통해 상기 제1 구간의 수를 표현하기 위한 제1 데이터 타입의 상기 제1 가중치 세트로부터 상기 제1 구간의 길이보다 작은 길이를 갖는 제2 구간의 수를 표현하기 위한 제2 데이터 타입의 제2 가중치 세트를 획득할 수 있다. 상기 제1 프로세서는, 양자화된 제2 가중치 세트를 메모리에 저장할 수 있다. 상기 제1 프로세서는, 뉴럴 네트워크 모델을 수행할 시, 상기 제2 가중치 세트에 기반하여 상기 제k 오퍼레이터에 대한 연 산을 수행함으로써, 출력 데이터를 획득할 수 있다. 일 실시예에 따르면, 상기 양자화를 통해 획득된 제k' 오퍼레이터의 제2 가중치 세트의 제2 데이터 타입은 상기 가속기에 의해 연산 가능할 수 있다. 상기 가속기가 상기 제2 데이터 타입을 지원하기 때문이다. 상기 제1 프로세서는 상기 제2 가중치 세트에 대한 오퍼레이터의 연산을 상기 가속기들 중 적어도 하나에서 진행할 수 있다. 상기 제1 프로세서는 뉴럴 네트워크 모델이 2개 이상 실행될 시에, 각 모델에 포함된 오퍼레이터 들의 연산이 수행될 가속기를 지정할 수 있다. 그러므로, 양자화 되지 않은 모델의 연산 속도 및 효율에 비해양자화 된 모델의 연산 속도 및 효율이 높을 수 있다. 사용자에 의해 모델에 입력된 입력 데이터 및 출력 데이 터가 양자화 된 모델의 정확도 평가에 이용되므로, 상기 전자 장치는 양자화에 기반하여 상기 사용자에게 개인화 된(personalized) 모델을 획득할 수 있다. 도 5에서 상술된 동작에 의해 양자화된 오퍼레이터를 획득한 이후, 상기 전자 장치는, 상기 양자화된 오퍼레이 터를 포함하는 모델에 대한 신뢰도를 측정할 수 있다. 상기 신뢰도를 측정한 결과에 기반하여, 전자 장치는, 상 기 모델에 포함된 기존 오퍼레이터를, 상기 양자화된 오퍼레이터로 대체할지 여부를 결정할 수 있다. 이하 도 6 에서, 신뢰도 측정 동작이 설명된다. 도 6은 일 실시예에 따른 전자 장치에서 실행되는 모델의 신뢰도 평가를 설명하기 위한 블록도이다. 도 6을 참조하면, 모델은 뉴럴 네트워크를 포함할 수 있다. 상기 모델은 제1 오퍼레이터를 포함 한 적어도 하나의 오퍼레이터를 포함할 수 있다. 상기 모델은 모델이 양자화 됨으로써 생성될 수 있 다. 예를 들어, 모델의 양자화는, 도 5에서 설명된 동작에 의해 모델로부터 획득될 수 있다. 상기 제 1' 오퍼레이터는 상기 제1 오퍼레이터가 양자화 됨으로써 생성될 수 있다. 상기 입력 데이터에 기반하여 모델에 포함된 연산에 의해 제1 출력 데이터가 생성될 수 있다. 상기 입력 데이터에 기반하여 상기 모델에 포함된 연산에 의해 제2 출력 데이터가 생성될 수 있다. 일 실시예에 따르면, 적어도 하나의 프로세서(예: 도 1의 프로세서)는, 상기 제1 출력 데이터와 상기 제2 출력 데이터의 차이에 기반하여 양자화 된 모델의 신뢰도를 평가할 수 있다. 상기 모델은 상기 모델을 양자화 함으로써 생성된 것이므로, 상기 모델로 상기 모델을 대체하기 위하여, 상 기 모델의 신뢰도가 평가될 수 있다. 상기 적어도 하나의 프로세서는, 상기 모델의 제1 출력 데 이터와 상기 모델의 제2 출력 데이터를 비교하여 신뢰도를 평가할 수 있다. 동일한 입력 데이터 에 대한 출력 데이터의 차이가 기준 값 미만일 시, 상기 모델이 상기 모델을 대체하더라도 문제가 발 생할 가능성이 낮기 때문일 수 있다. 상기 적어도 하나의 프로세서는, 상기 모델의 실행에 의해 생성 된 프로파일 정보로부터, 상기 적어도 하나의 오퍼레이터에 대한 연산을 수행함으로써 획득된 제1 출력 데이터 의 세트를 식별할 수 있다. 상기 모델은 양자화 및/또는 신뢰도 평가에 필요한 횟수 이상으로 실행되 었기 때문에, 상기 프로파일 정보에는 지정된 개수 이상의 입력 데이터, 지정된 개수 이상의 서브 출력 데이터, 지정된 개수 이상의 출력 데이터가 포함될 수 있다. 그러므로 상기 프로파일 정보에는 모델에 대한 입력 데이터의 세트, 서브 출력 데이터의 세트, 및 출력 데이터의 세트가 포함될 수 있다. 일 실시예에 따르면, 상기 적어도 하나의 프로세서는, 상기 제2 가중치 세트를 획득하는 것에 기반하여, 상기 모델에 대한 신뢰도 평가를 수행할 수 있다. 예를 들어, 상기 적어도 하나의 프로세서는, 상기 모델의 생성이 완료되는 것을 식별함에 기반하여, 상기 모델에 대한 신뢰도 평가를 수행할 수 있다. 일 실시예에 따르면, 상기 적어도 하나의 프로세서는, 상기 프로파일 정보로부터 상기 적어도 하나의 오퍼 레이터에 대한 연산을 수행함으로써 획득된 상기 제1 출력 데이터의 세트를 식별할 수 있다. 상기 적어도 하나의 프로세서는, 상기 제2 가중치 세트에 기반하여 상기 적어도 하나의 오퍼레이터에 대한 연산을 수행 함으로써, 상기 입력 데이터의 세트로부터 제2 출력 데이터의 세트를 획득할 수 있다. 예를 들어, 상 기 적어도 하나의 프로세서는, 상기 모델에서, 상기 입력 데이터에 대한 연산을 통해 제2 출력 데이터의 세트를 획득할 수 있다. 상기 적어도 하나의 프로세서는, 상기 제1 출력 데이터 및 대 응하는 상기 제2 출력 데이터 사이의 차이 값(difference)의 세트에 기반하여, 상기 모델의 제1 오퍼 레이터에 포함된 상기 제1 가중치 세트를, 상기 제2 가중치 세트로 교체할 수 있다. 상기 제1 출력 데이터 와 상기 제2 출력 데이터의 차이 값의 세트들이 모두 기준 값 미만일 시, 상기 모델이 상기 모 델을 대체하더라도 문제 발생 가능성이 낮기 때문이다. 예를 들어, 상기 차이 값의 세트들이 약 0.5% 약 0.7%, 약 0.5%, 약 0.2%, 약 0.9%이고, 상기 기준 값이 약 1%인 경우, 상기 모델은 상기 모델을 대 체할 수 있다. 다만, 상기 제1 출력 데이터와 상기 제2 출력 데이터의 차이 값의 세트 중 적어도 하 나의 차이 값이 기준 값 이상일 시, 상기 모델은 상기 모델을 대체할 수 없다. 예를 들어, 상기 차이 값의 세트들이 약 0.5% 약 0.7%, 약 0.5%, 약 3.5%, 약 0.9%이고, 상기 기준 값이 약 1%인 경우 상기 모델 은 상기 모델을 대체할 수 없다. 상기 제1 출력 데이터와 상기 제2 출력 데이터의 차이 값 의 세트 중 적어도 하나의 차이 값이 기준 값 이상일시, 상기 적어도 하나의 프로세서는, 양자화를 다시 수행하거나, 서버를 통해 양자화를 수행할 수 있다. 일 실시예에 따르면, 상기 제1 출력 데이터와 상기 제2 출력 데이터의 차이 값의 세트 중 적어도 하 나의 차이 값이 기준 값 이상일 시, 상기 적어도 하나의 프로세서는, 양자화를 다시 수행할 수 있다. 양자 화에는 시간 및 자원이 소요되므로, 상기 모델의 양자화가 수행되는 시간대가 조정될 수 있다. 예를 들어, 상기 적어도 하나의 프로세서는, 사용량이 적은 시간대에 상기 모델의 양자화를 수행할 수 있다. 일 예로, 심야 시간대에 상기 모델의 양자화가 수행될 수 있다. 일 예로, 시간대에 따른 휴대폰 사용량에 기 반하여, 휴대폰 사용량이 적은 시간대에 양자화가 수행될 수 있다. 학생의 경우 상기 휴대폰 사용량이 적은 시 간대는 수업 시간대일 수 있다. 직장인의 경우 상기 휴대폰 사용량이 적은 시간대는 업무 시간대일 수 있다. 예 를 들어, 상기 적어도 하나의 프로세서는, 사용자에게 양자화가 수행될 시간대를 선택하도록 가이드하기 위한 알림을 디스플레이를 통해 표시할 수 있다. 상기 적어도 하나의 프로세서는, 사용자가 지정한 시간대 에 양자화를 수행할 수 있다. 일 실시예에 따르면, 상기 제1 출력 데이터와 상기 제2 출력 데이터의 차이 값의 세트 중 적어도 하 나의 차이 값이 기준 값 이상일시, 상기 적어도 하나의 프로세서는, 서버를 통해 양자화를 수행할 수 있다. 상기 서버에서 수행되는 양자화는 이하 도 8에서 기재된다. 도 6에서, 상기 모델을 구성하는 모든 오퍼레이터들이 양자화 된 것처럼 도시되었으나, 본 개시의 실시예 는 이에 한정되지 않는다. 일 실시예에 따르면, 상기 제2 오퍼레이터는 가속기가 지원하는 제2 데이터 타입의 가중치 세트들이 포함되어 있어, 양자화가 수행되지 않을 수 있다. 양자화가 수행되지 않은 제2 오퍼레이터는 상기 모델과 상기 모델에서 동일한 가중치 세트 및 바이어스를 가질 수 있다. 또한, 도 6에서, 상기 모델이 메모리에 상기 모델과 별개로 저장되는 것처럼 도시되었으나, 본 개시 의 실시예는 이에 한정되지 않는다. 일 실시예에 따르면, 상기 적어도 하나의 프로세서는, 상기 모델 자체를 저장하는 것이 아니라, 양자화 된 오퍼레이터의 제2 가중치 세트 및 바이어스를 메모리에 저장할 수 있 다. 상기 적어도 하나의 프로세서는, 상기 양자화 된 제2 가중치 세트를 상기 제1 가중치 세트의 해시 값 과 함께 상기 메모리에 저장할 수 있다. 상기 적어도 하나의 프로세서는, 상기 모델이 이용될 시, 상 기 제1 가중치 세트의 해시 값에 기반하여 제2 가중치 세트를 식별할 수 있다. 상기 적어도 하나의 프로세서 는, 상기 제1 가중치 세트의 해시 값에 대응하는 제2 가중치 세트에 기반하여, 상기 제1 오퍼레이터 에 대한 연산을 수행할 수 있다. 도 7은 일 실시예에 따른 양자화 된 제2 가중치 세트들을 저장하기 위한 전자 장치의 동작의 흐름을 도시한다. 도 7을 참조하면, 동작에서, 일 실시예에 따르면, 적어도 하나의 프로세서(예: 도 1의 프로세서)는 제1 가중치 세트를 획득할 수 있다. 뉴럴 네트워크를 포함한 모델은 제1 오퍼레이터(예: 도 6의 제1 오퍼레이터 )를 포함할 수 있다. 상기 제1 가중치 세트는 상기 제1 오퍼레이터에 포함된 가중치들일 수 있다. 동작에서, 일 실시예에 따르면, 상기 적어도 하나의 프로세서는 제1 오퍼레이터의 제1 데이터 타입과 상이한 가속기의 제2 데이터 타입을 식별하거나, 양자화 정보의 부재, 및/또는 양자화 모델의 부재를 식 별하는지 여부를 식별할 수 있다. 상기 제1 오퍼레이터의 상기 제1 데이터 타입과 상이한 상기 가속기의 상기 제2 데이터 타입을 식별하는 경우, 상기 적어도 하나의 프로세서는 동작를 수행할 수 있다. 양 자화 정보가 식별되지 않을 경우, 상기 적어도 하나의 프로세서는 동작을 수행할 수 있다. 양자화 모 델의 부재를 식별하는 경우, 상기 적어도 하나의 프로세서는 동작를 수행할 수 있다. 상기 적어도 하 나의 프로세서가 상기 제1 오퍼레이터의 상기 제1 데이터 타입과 동일한 상기 가속기의 상기 제2 데 이터 타입을 식별하거나, 양자화 정보가 식별되고, 양자화 모델이 식별되는 경우 상기 적어도 하나의 프로세서 는 동작을 수행할 수 있다. 상기 제1 오퍼레이터의 상기 제1 데이터 타입과 동일한 상기 가속기 의 상기 제2 데이터 타입을 식별하는 경우, 상기 적어도 하나의 프로세서는 동작을 수행할 수 있다. 양자화 정보가 식별되는 경우, 상기 적어도 하나의 프로세서는 동작을 수행할 수 있다. 양자화 모델 이 식별되는 경우, 상기 적어도 하나의 프로세서는 동작을 수행할 수 있다. 일 실시예에 따르면, 상 기 적어도 하나의 프로세서는 제1 오퍼레이터(예: 도 6의 제1 오퍼레이터)의 제1 데이터 타입과 상이 한 가속기의 제2 데이터 타입을 식별할 수 있다. 예를 들어, 상기 제1 데이터 타입은, 32 비트들의 부동 소수점 수를 표현할 수 있다. 상기 가속기는 8 비트들의 정수로 표현되는 데이터 타입과 16 비트들의 정수로 표현되는 제2 데이터 타입만을 지원할 수 있다. 예를 들어, 상기 제1 데이터 타입은 16 비트들을 이용하여 나타낸 부동 소수점 수를 표현할 수 있다. 상기 제2 데이터 타입은 8 비트들을 이용하여 나타낸 정수를 표현할 수 있다. 다 만, 본 개시의 실시예들이 이에 제한되는 것은 아니다. 일 실시예에 따르면, 상기 전자 장치는, 상기 제1 데이터 타입보다 제2 데이터 타입의 정밀도, 및/또는 범위가 낮고, 상기 전자 장치가 상기 제2 데이터 타입에 기반하는 모델의 연산을 할 수 있는 경우, 양자화 기능을 수행할 수 있다. 일 실시예에 따르면, 상기 적어도 하나의 프로세서는 양자화 정보 및/또는 양자화 모델의 부재를 식별할 수 있다. 일 실시예에 따르면, 상기 적어도 하나의 프로세서는 양자화 모델의 부재를 식별할 수 있다. 예 를 들어, 상기 양자화 모델은 양자화된 모델일 수 있다. 일 예로, 상기 양자화된 모델은 상기 제1 오퍼레이터의 해시 값에 대응하는 제1' 오퍼레이터일 수 있다. 상기 제1 오퍼레이터의 상기 해시 값에 대응하는 다른 오퍼레 이터가 없을 경우, 상기 적어도 하나의 프로세서는 양자화된 모델의 부재를 식별할 수 있다. 일 실시예에 따르면, 상기 적어도 하나의 프로세서는 양자화 정보의 부재를 식별할 수 있다. 예를 들어, 상기 양자화 정보는 상기 양자화된 모델에 포함된 값일 수 있다. 일 예로, 상기 양자화 정보는 상기 제1' 오퍼레이터 내의 제2 가중치 세트 및/또는 바이어스일 수 있다. 상기 제1' 오퍼레이터 내의 상기 제2 가중치 세트 및/또는 바이 어스가 없을 경우, 상기 적어도 하나의 프로세서는 양자화된 정보의 부재를 식별할 수 있다. 동작에서, 일 실시예에 따르면, 상기 적어도 하나의 프로세서는, 양자화 된 제2 가중치 세트에 대하 여 제1 오퍼레이터 연산을 수행할 수 있다. 상기 양자화 된 제2 가중치 세트는 상기 제1 가중치 세트의 해시 값 과 함께 상기 메모리에 저장될 수 있다. 상기 적어도 하나의 프로세서는, 상기 뉴럴 네트워크 모델이 이용 될 시, 상기 제1 가중치 세트의 해시 값에 기반하여 제2 가중치 세트를 식별할 수 있다. 상기 적어도 하나의 프 로세서는, 상기 제1 가중치 세트의 해시 값에 대응하는 제2 가중치 세트에 기반하여, 상기 제1 오퍼레이터 에 대한 연산을 수행할 수 있다. 동작에서, 일 실시예에 따르면, 상기 적어도 하나의 프로세서는, 양자화기를 통해 제1 가중치 세트에 의해 제1 오퍼레이터 연산을 수행할 수 있다. 양자화를 위해 서브 출력 데이터가 필요하기 때문이다. 상기 제1 가중치 세트에 의한 제1 오퍼레이터 연산은 양자화 된 제2 가중치 세트에 의한 제1 오퍼레이터 연산에 비해 시 간이 많이 걸릴 수 있다. 동작에서 일 실시예에 따르면, 상기 적어도 하나의 프로세서는, 상기 양자화기를 통해 프로파일 정보 를 수집 및 저장할 수 있다. 상기 프로파일 정보는 뉴럴 네트워크 모델에 대한 입력 데이터의 세트, 서브 출력 데이터의 세트, 및 출력 데이터의 세트가 포함될 수 있다. 상기 입력 데이터의 세트는 상기 뉴럴 네트워크 모델 의 실행에 의해 획득될 수 있다. 동작에서, 일 실시예에 따르면, 상기 적어도 하나의 프로세서는, 상기 양자화기를 통해 제2 가중치 세트들을 생성 및 저장할 수 있다. 일 실시예에 따르면, 상기 적어도 하나의 프로세서는, 상기 서브 출력 데이터의 세트의 분포에 기반하여, 상기 제1 가중치 세트에 대한 양자화를 수행함으로써 상기 제2 가중치 세트 를 획득할 수 있다. 예를 들어, 상기 적어도 하나의 프로세서는, 실 사용 데이터인 입력 데이터의 세트에 대하여 상기 제1 오퍼레이터에 대한 연산을 수행함으로써 서브 출력 데이터의 세트를 획득할 수 있다. 상기 제1 오퍼레이터의 제1 가중치에 대한 양자화는 상기 서브 출력 데이터의 구간에 기반하여 생성될 수 있다. 일 예로, 부동 소수점 수를 표현하기 위한 제1 데이터 타입이 표현할 수 있는 숫자 구간은 제1 구간일 수 있다. 정수를 표현하기 위한 제2 데이터 타입이 표현할 수 있는 숫자 구간은 제2 구간일 수 있다. 상기 제1 구간은 음의 무한 대에서 양의 무한대까지 일 수 있다. 상기 제2 구간은 8 비트들로 표현하는 데이터 타입의 경우, -128에서 127 까지일 수 있다. 상기 제2 구간은 16 비트로 표현하는 데이터 타입의 경우, -32768에서 32767까지일 수 있다. 상기 서브 출력 데이터의 세트가 -120에서 110 사이의 값을 가질 경우, 상기 제1 오퍼레이터의 제1 가중치 세트 는 부동 소수점 수를 표현하기 위한 데이터 타입 대신 8 비트들의 정수로 표현되는 데이터 타입으로 기재되는 것이, 연산 속도 및 가속기 사용에 있어 유리할 수 있다. 그러므로, 상기 적어도 하나의 프로세서는, 상기 서브 출력 데이터의 구간에 기반하여, 상기 제1 가중치 세트의 데이터 타입을 변경할 수 있다. 상기 적어도 하 나의 프로세서는, 양자화된 제2 가중치 세트를 메모리에 저장할 수 있다. 상기 적어도 하나의 프로세서 는, 뉴럴 네트워크 모델이 실행될 시, 상기 제2 가중치 세트에 기반하여 상기 제1 오퍼레이터에 대한 연산 을 수행함으로써, 출력 데이터를 획득할 수 있다. 도 8은 일 실시예에 따른 서버를 이용하여 양자화를 실행하는 동작의 흐름을 도시한다. 뉴럴 네트워크 모델이 포함된 어플리케이션의 실행에 기반하여, 전자 장치(예: 도 1의 전자 장치)는 이하의 동작을 수행할 수 있 다. 도 8을 참조하면, 동작에서, 일 실시예에 따르면, 상기 전자 장치의 적어도 하나의 프로세서(예: 도 1의 프로세서)는 양자화기를 통해 제1 가중치 세트에 의해 제1 오퍼레이터 연산할 수 있다. 상기 동작은 상기 도 7의 동작과 유사하게 수행될 수 있다. 상기 적어도 하나의 프로세서는 제1 오퍼레이 터의 제1 데이터 타입과 상이한 가속기의 제2 데이터 타입을 식별하거나, 양자화 정보의 부재 및/또는 양자화 모델의 부재를 식별하는 경우 동작을 수행할 수 있다. 상기 적어도 하나의 프로세서는 제1 오퍼레이 터의 제1 데이터 타입과 동일한 가속기의 제2 데이터 타입을 식별하고, 양자화 정보 및 양자화 모델을 식별하는 경우, 양자화 된 제2 가중치 세트에 대하여 상기 제1 오퍼레이터에 대한 연산을 수행할 수 있다. 양자화를 위해 서브 출력 데이터가 필요할 수 있다. 동작에서, 상기 적어도 하나의 프로세서는, 상기 양자화기를 통해 프로파일 정보를 수집 및 저장할 수 있다. 상기 프로파일 정보는 입력 데이터의 세트, 서브 출력 데이터의 세트, 및 출력 데이터의 세트를 포함 할 수 있다. 일 실시예에 따르면, 상기 적어도 하나의 프로세서는, 상기 서브 출력 데이터의 세트의 분포 에 기반하여, 상기 제1 가중치 세트에 대한 양자화를 수행함으로써 상기 제2 가중치 세트를 획득할 수 있다. 동작에서, 일 실시예에 따르면, 상기 적어도 하나의 프로세서는, 기준 범위 외의 모델의 신뢰도를 식 별할 수 있다. 동작을 수행하기 위하여, 상기 적어도 하나의 프로세서는 양자화 된 모델의 신뢰도를 평가할 수 있다. 상기 양자화된 모델의 신뢰도는 제1 출력 데이터와 제2 출력 데이터의 차이 값의 세트 중 적어 도 하나의 차이 값이 기준 값 이상인지 여부에 기반하여 식별될 수 있다. 제1 출력 데이터는 제1 가중치 세트에 기반하여 적어도 하나의 오퍼레이터에 대한 연산을 수행함으로써 획득될 수 있다. 상기 제2 출력 데이터는 제2 가중치 세트에 기반하여 적어도 하나의 오퍼레이터에 대한 연산을 수행함으로써 획득될 수 있다. 일 실시예에 따르면, 상기 제1 출력 데이터와 상기 제2 출력 데이터의 차이 값의 세트 중 적어도 하나의 차이 값이 기준 값 이상일시, 상기 적어도 하나의 프로세서는, 서버(예: 도 1의 서버)를 통해 양자화를 수행할 수 있다. 동작 및 동작에서, 일 실시예에 따르면, 상기 적어도 하나의 프로세서는 서브 출력 데이터 정보 를 송신할 수 있다. 상기 적어도 하나의 프로세서는 상기 서버에게 상기 서브 출력 데이터를 송신할 수 있다. 상기 적어도 하나의 프로세서는, 상기 제1 출력 데이터 및 대응하는 상기 제2 출력 데이터 사이 의 상기 차이 값의 세트 중 적어도 하나의 차이 값이 기준 값 이상임을 식별함에 기반하여, 상기 프로파일 정보 로부터 획득된 상기 서브 출력 데이터의 세트를 상기 통신 회로를 통해 상기 서버에게 송신할 수 있다. 상 기 서브 출력 데이터 정보는 상기 제1 가중치 세트가 포함된 상기 제1 오퍼레이터 연산을 통해 생성될 수 있다. 동작에서, 일 실시예에 따르면, 상기 서버는 서브 출력 데이터 정보를 수신할 수 있다. 상기 서브 출 력 데이터 정보는 복수의 전자 장치들로부터 수신될 수 있다. 상기 적어도 하나의 프로세서는, 동일한 모 델인 복수의 전자 장치들로부터 송신한 서브 출력 데이터 정보를 통해 양자화를 수행할 수 있다. 실사용 데이터 인 입력 데이터가 상기 서버로 송신되지 않기 때문에 입력 데이터가 상기 서버로 송신되는 경우에 비 해, 프라이버시 보호 측면에서 유리할 수 있다. 예를 들어, 사용자에 의해 모델에 입력된 입력 데이터 및 출력 데이터가 양자화 된 모델의 정확도 평가에 이용되므로, 상기 전자 장치는 양자화에 기반하여 상기 사용자 에게 개인화 된(personalized) 모델을 획득할 수 있다. 동작에서, 일 실시예에 따르면, 상기 서버는 서브 출력 데이터 정보를 집계할 수 있다. 지정된 분량 의 서브 출력 데이터 정보가 집계될 시, 상기 적어도 하나의 프로세서는, 서브 출력 데이터 정보 수신을 중지할 수 있다. 동작에서, 일 실시예에 따르면, 상기 서버는 제3 가중치 세트들을 생성할 수 있다. 일 실시예에 따르 면, 상기 서버는, 상기 서브 출력 데이터의 세트의 분포에 기반하여, 상기 제1 가중치 세트에 대한 양자화 를 수행함으로써 상기 제3 가중치 세트를 획득할 수 있다. 예를 들어, 상기 제1 오퍼레이터의 제1 가중치에 대 한 양자화는 상기 서브 출력 데이터의 구간에 기반하여 생성될 수 있다. 상기 서버는, 양자화를 통해 상기 제1 구간의 수를 표현하기 위한 제1 데이터 타입의 상기 제1 가중치 세트로부터 상기 제1 구간의 길이보다 작은 길이를 갖는 제3 구간의 수를 표현하기 위한 제2 데이터 타입의 제3 가중치 세트를 획득할 수 있다. 양자화에 대한 내용은 도 7의 동작에서 기재된 내용이 참조될 수 있다. 동작 및 동작에서, 일 실시예에 따르면, 상기 서버는 제3 가중치 세트들을 송신할 수 있다. 상 기 서버는 상기 서브 출력 데이터에 기반하여, 상기 제1 가중치 세트에 대한 양자화가 수행된 상기 제2 데 이터 타입의 제3 가중치 세트들을 상기 통신 회로를 통해 상기 전자 장치로 송신할 수 있다. 상기 서버 는 어플리케이션의 실행에 따라 양자화를 요청한 복수의 전자 장치들에게 상기 제3 가중치 세트들을 송신 할 수 있다. 동작에서, 일 실시예에 따르면, 상기 적어도 하나의 프로세서는 수신된 제3 가중치 세트들을 저장할 수 있다. 상기 적어도 하나의 프로세서는, 상기 수신된 상기 제3 가중치 세트를 상기 메모리에 저장할 수 있다. 상기 적어도 하나의 프로세서는, 뉴럴 네트워크에서, 상기 제3 가중치 세트에 기반하여 상기 제1 오 퍼레이터에 대한 연산을 수행함으로써, 출력 데이터를 획득할 수 있다. 도 9는 일 실시예에 따른 양자화를 통해 제2 가중치 세트를 획득하기 위한 전자 장치의 동작의 흐름을 도시한다. 도 9를 참조하면, 동작에서, 일 실시예에 따르면, 상기 적어도 하나의 프로세서는, 제1 가중치 세트 를 획득할 수 있다. 일 실시예에 따르면, 상기 적어도 하나의 프로세서는, 도 9의 동작을, 제1 가중 치 세트의 데이터 타입이 가속기에 의해 지원되는 데이터 타입과 상이한지 여부, 양자화 정보의 부재 여부, 및/ 또는 양자화 모델의 부재 여부에 기반하여, 수행할 수 있다. 일 실시예에 따르면, 상기 적어도 하나의 프로세서 는 상기 오퍼레이터(예: 도 4의 제1 오퍼레이터)의 제1 데이터 타입과 상이한 가속기의 제2 데이터 타입을 식별할 수 있다. 상기 적어도 하나의 프로세서는, 양자화 정보의 부재, 및/또는 양자화 모델의 부 재를 식별할 수 있다. 상기 제1 가중치 세트의 데이터 타입과 상이한 상기 가속기에 의해 지원되는 데이터 타입 을 식별하거나, 상기 양자화 정보가 없거나, 및/또는 상기 양자화 모델이 없을 시, 상기 적어도 하나의 프로세 서는 상기 제1 가중치 세트를 양자화 하기 위해 제1 가중치 세트를 획득할 수 있다. 상기 제1 데이터 타입 에서 요구되는 정밀도(precision)는 상기 제2 데이터 타입에서 요구되는 정밀도보다 높을 수 있다. 예를 들어, 상기 제1 데이터 타입은 16 비트들을 이용하여 부동 소수점 수를 나타낼 수 있다. 상기 제2 데이터 타입은 8 비 트들을 이용하여 정수를 나타낼 수 있다. 일 실시예에 따르면, 개별적인 오퍼레이터에 따라 가중치 세트의 데이 터 타입이 다를 수 있다. 그러므로, 개별 오퍼레이터의 데이터 타입에 기반하여 개별 오퍼레이터의 양자화 여부 가 결정될 수 있다. 동작에서, 일 실시예에 따르면, 상기 적어도 하나의 프로세서는, 프로파일 정보로부터 서브 출력 데 이터의 세트를 획득할 수 있다. 상기 서브 출력 데이터의 세트에 기반하여 양자화가 수행되기 때문이다. 상기 프로파일 정보는 상기 입력 데이터의 세트, 상기 서브 출력 데이터의 세트, 및 출력 데이터의 세트를 포함할 수 있다. 일 실시예에 따르면, 상기 적어도 하나의 프로세서는, 제1 오퍼레이터의 연산에 기반하여 입력 데이 터의 세트로부터 서브 출력 데이터의 세트를 획득할 수 있다. 상기 적어도 하나의 프로세서는, 적어도 하 나의 오퍼레이터에 대한 연산을 수행함으로써 입력 데이터의 세트로부터 출력 데이터의 세트를 획득할 수 있다. 동작에서, 일 실시예에 따르면, 상기 적어도 하나의 프로세서는, 서브 출력 데이터의 세트에 기반하 여 제2 가중치 세트를 획득할 수 있다. 일 실시예에 따르면, 상기 제2 데이터 타입의 상기 제2 가중치 세트를 획득하기 위하여, 상기 적어도 하나의 프로세서는, 상기 서브 출력 데이터의 세트의 분포에 기반하여, 상 기 제1 가중치 세트에 대한 양자화를 수행함으로써 상기 제2 가중치 세트를 획득할 수 있다. 상기 제1 오퍼레이 터의 제1 가중치에 대한 양자화는 상기 서브 출력 데이터의 구간에 기반하여 생성될 수 있다. 일 예로, 부동 소 수점 수를 표현하기 위한 제1 데이터 타입이 표현할 수 있는 숫자 구간은 제1 구간일 수 있다. 정수를 표현하기 위한 제2 데이터 타입이 표현할 수 있는 숫자 구간은 제2 구간일 수 있다. 상기 적어도 하나의 프로세서는, 양자화를 통해 상기 제1 구간의 수를 표현하기 위한 제1 데이터 타입의 상기 제1 가중치 세트 로부터 상기 제1 구간의 길이보다 작은 길이를 갖는 제2 구간의 수를 표현하기 위한 제2 데이터 타입의 제2 가 중치 세트를 획득할 수 있다. 동작에서, 일 실시예에 따르면, 상기 적어도 하나의 프로세서는, 제2 가중치 세트 획득에 기반하여 제2 가중치 세트를 저장할 수 있다. 상기 적어도 하나의 프로세서는, 뉴럴 네트워크 모델 수행 시 양자화 된 제2 가중치 세트에 기반하여 연산할 수 있다. 상기 적어도 하나의 프로세서는, 뉴럴 네트워크 모델을 실행할 시, 상기 제2 가중치 세트에 기반하여 상기 제1 오퍼레이터에 대한 연산을 수행함으로써, 출력 데이터를 획득할 수 있다. 일 실시예에 따르면, 상기 적어도 하나의 프로세서는, 상기 제2 가중치 세트를 상기 제1 가중치 세트의 해시 값과 함께, 상기 메모리에 저장할 수 있다. 상기 적어도 하나의 프로세서는, 뉴럴 네 트워크 모델이 이용될 시, 상기 제1 가중치 세트의 해시 값에 기반하여 제2 가중치 세트를 식별할 수 있다. 상 기 적어도 하나의 프로세서는, 상기 제1 가중치 세트의 해시 값에 대응하는 제2 가중치 세트에 기반하여, 상기 제1 오퍼레이터에 대한 연산을 수행할 수 있다. 도 10은 일 실시예에 따른 신뢰도 평가에 기반하여 제2 가중치 세트를 저장하기 위한 전자 장치의 동작의 흐름 을 도시한다. 도 10의 동작의 흐름은 도 9의 동작을 구체화할 수 있다. 도 10을 참조하면, 동작에서, 일 실시예에 따르면, 상기 적어도 하나의 프로세서는, 프로파일 정보 로부터 제1 출력 데이터의 세트를 획득할 수 있다. 일 실시예에 따르면, 상기 적어도 하나의 프로세서는, 상기 제2 가중치 세트를 획득하는 것에 기반하여, 양자화 된 뉴럴 네트워크 모델에 대한 신뢰도 평가를 수행할 수 있다. 예를 들어, 상기 양자화 된 뉴럴 네트워크 모델의 생성이 완료되는 것을 식별함에 기반하여, 상기 양 자화 된 뉴럴 네트워크 모델에 대한 신뢰도 평가를 수행할 수 있다. 일 실시예에 따르면, 상기 적어도 하나의 프로세서는, 상기 프로파일 정보로부터 상기 적어도 하나의 오퍼레이터에 대한 연산을 수행함으로써 획득 된 제1 출력 데이터의 세트를 식별할 수 있다. 동작에서, 일 실시예에 따르면, 상기 적어도 하나의 프로세서는, 제2 가중치 세트에 기반하여 제2 출력 데이터 세트를 획득할 수 있다. 상기 적어도 하나의 프로세서는, 상기 제2 가중치 세트에 기반하여 상기 적어도 하나의 오퍼레이터에 대한 연산을 수행함으로써, 상기 입력 데이터의 세트로부터 제2 출력 데이터 의 세트를 획득할 수 있다. 예를 들어, 상기 적어도 하나의 프로세서는, 상기 양자화 된 뉴럴 네트워크 모 델에서, 상기 입력 데이터에 대한 연산을 통해 제2 출력 데이터의 세트를 획득할 수 있다. 동작에서, 일 실시예에 따르면, 상기 적어도 하나의 프로세서는, 제1 출력 데이터와 제2 출력 데이 터 사이의 차이 값들에 기반하여 제1 가중치 세트를 제2 가중치 세트로 교체할 수 있다. 상기 적어도 하나의 프 로세서는, 상기 제1 출력 데이터 및 대응하는 상기 제2 출력 데이터 사이의 차이 값(difference)의 세트에 기반하여, 뉴럴 네트워크 모델에 포함된 제1 오퍼레이터에 포함된 상기 제1 가중치 세트를, 상기 제2 가중치 세 트로 교체할 수 있다. 상기 제1 출력 데이터와 상기 제2 출력 데이터의 차이 값의 세트들이 모두 기준 값 미만 일 시, 상기 양자화 된 뉴럴 네트워크 모델이 상기 양자화 전 뉴럴 네트워크 모델을 대체하더라도 문제 발생 가 능성이 낮을 수 있다. 예를 들어, 상기 차이 값의 세트들이 약 0.5% 약 0.7%, 약 0.5%, 약 0.2%, 약 0.9%이고, 상기 기준 값이 약 1%인 경우, 상기 양자화 된 뉴럴 네트워크 모델은 상기 양자화 전 뉴럴 네트워크 모델을 대 체할 수 있다. 다만, 상기 제1 출력 데이터와 상기 제2 출력 데이터의 차이 값의 세트 중 적어도 하나의 차이 값이 기준 값 이상일 시, 상기 양자화 된 뉴럴 네트워크 모델은 상기 양자화 전 뉴럴 네트워크 모델을 대체할 수 없다. 예를 들어, 상기 차이 값의 세트들이 약 0.5% 약 0.7%, 약 0.5%, 약 3.5%, 약 0.9%이고, 상기 기준 값이 약 1%인 경우 상기 양자화 된 뉴럴 네트워크 모델은 상기 양자화 전 뉴럴 네트워크 모델을 대체할 수 없다. 상기 제1 출력 데이터와 상기 제2 출력 데이터의 차이 값의 세트 중 적어도 하나의 차이 값이 기준 값 이 상일시, 상기 적어도 하나의 프로세서는, 양자화를 다시 수행하거나, 서버를 통해 양자화를 수행할 수 있 다. 도 11은 일 실시예에 따른, 신뢰도에 따라 양자화 방식을 식별하기 위한 전자 장치의 동작의 흐름을 도시한다. 도 11을 참조하면, 동작에서, 일 실시예에 따르면, 상기 적어도 하나의 프로세서는, 제1 가중치 세 트를 획득할 수 있다. 일 실시예에 따르면, 상기 적어도 하나의 프로세서는, 도 11의 동작을, 제1 가중치 세트의 데이터 타입이 가속기에 의해 지원되는 데이터 타입과 상이한지 여부, 양자화 정보의 부재 여부, 및/또는 양자화 모델의 부재 여부에 기반하여, 수행할 수 있다. 일 실시예에 따르면, 상기 적어도 하나의 프로 세서는 상기 오퍼레이터의 제1 데이터 타입과 상이한 가속기의 제2 데이터 타입을 식별할 수 있다. 상기 적어도 하나의 프로세서는, 양자화 정보의 부재 및/또는 양자화 모델의 부재를 식별할 수 있다. 상기 적어 도 하나의 프로세서가 상기 제1 가중치 세트의 데이터 타입과 상이한 상기 가속기에 의해 지원되는 데이터 타입을 식별하거나, 상기 양자화 정보가 없거나, 및/또는 상기 양자화 모델이 없을 시, 상기 적어도 하나의 프 로세서는 상기 제1 가중치 세트를 양자화 하기 위해 프로파일 정보로부터 제1 가중치 세트를 획득할 수 있 다. 동작에서, 일 실시예에 따르면, 상기 적어도 하나의 프로세서는, 프로파일 정보로부터 서브 출력 데 이터의 세트를 획득할 수 있다. 상기 서브 출력 데이터의 세트에 기반하여 양자화가 수행되기 때문이다. 일 실 시예에 따르면, 상기 적어도 하나의 프로세서는, 제1 오퍼레이터의 연산에 기반하여 입력 데이터의 세트로 부터 서브 출력 데이터의 세트를 획득할 수 있다. 동작은 도 9의 동작과 유사하게 수행될 수 있다. 이하, 중복된 설명은 생략한다. 동작에서, 일 실시예에 따르면, 상기 적어도 하나의 프로세서는, 서브 출력 데이터의 세트에 기반하 여 제2 가중치 세트를 획득할 수 있다. 일 실시예에 따르면, 상기 제2 데이터 타입의 상기 제2 가중치 세트를획득하기 위하여, 상기 적어도 하나의 프로세서는, 상기 서브 출력 데이터의 세트의 분포에 기반하여, 상 기 제1 가중치 세트에 대한 양자화를 수행함으로써 상기 제2 가중치 세트를 획득할 수 있다. 상기 제1 오퍼레이 터의 제1 가중치에 대한 양자화는 상기 서브 출력 데이터의 구간에 기반하여 수행될 수 있다. 동작은 도 9의 동작과 유사하게 수행될 수 있다. 이하, 중복된 설명은 생략한다. 동작에서, 일 실시예에 따르면, 상기 적어도 하나의 프로세서는, 신뢰도가 기준 범위 이내인지 여부 를 식별할 수 있다. 상기 신뢰도가 기준 범위 이내일 시, 상기 적어도 하나의 프로세서는, 동작을 수행할 수 있다. 상기 신뢰도가 기준 범위 외일 시, 상기 적어도 하나의 프로세서는, 동작을 수행할 수 있다. 일 실시예에 따르면, 상기 적어도 하나의 프로세서는, 양자화 전 뉴럴 네트워크 모델의 실행(또 는 시뮬레이션)에 의해 생성된 프로파일 정보로부터, 상기 적어도 하나의 오퍼레이터에 대한 연산을 수행함으로 써 획득된 제1 출력 데이터의 세트를 식별할 수 있다. 일 실시예에 따르면, 상기 적어도 하나의 프로세서 는, 상기 제2 가중치 세트를 획득하는 것에 기반하여, 상기 양자화 된 뉴럴 네트워크 모델에 대한 신뢰도 평가 를 수행할 수 있다. 예를 들어, 상기 적어도 하나의 프로세서는, 상기 양자화 전 뉴럴 네트워크 모델에 대 한 양자화가 완료되는 것을 식별함에 기반하여, 신뢰도 평가를 수행할 수 있다. 상기 적어도 하나의 프로세서 는, 상기 제2 가중치 세트에 기반하여 상기 적어도 하나의 오퍼레이터에 대한 연산을 수행함으로써, 상기 입력 데이터의 세트로부터 제2 출력 데이터의 세트를 획득할 수 있다. 상기 적어도 하나의 프로세서는, 상 기 제1 출력 데이터 및 대응하는 상기 제2 출력 데이터 사이의 차이 값(difference)의 세트에 기반하여, 양자화 된 뉴럴 네트워크에 대한 지정 기준 이상의 신뢰도를 획득할 수 있다. 상기 제1 출력 데이터와 상기 제2 출력 데이터의 차이 값의 세트들이 모두 기준 값 미만일 시, 문제 발생 가능성이 낮기 때문이다. 상기 적어도 하나의 프로세서는, 상기 제1 출력 데이터와 상기 제2 출력 데이터의 차이 값의 세트 중 적어도 하나의 차이 값이 기준 값 이상일 시, 양자화 된 뉴럴 네트워크에 대한 지정 기준 이상의 신뢰도를 획득할 수 없다. 동작에서, 일 실시예에 따르면, 상기 적어도 하나의 프로세서는, 제2 가중치 세트를 저장할 수 있다. 상기 적어도 하나의 프로세서는, 상기 제1 출력 데이터 및 대응하는 상기 제2 출력 데이터 사이의 차이 값(difference)의 세트들이 모두 기준 값 미만일 시, 상기 제1 가중치 세트를, 상기 제2 가중치 세트로 교 체할 수 있다. 상기 제2 가중치 세트에 기반하여 오퍼레이터에 대한 연산을 수행하는 것이 시간적 자원 측면에 서 유리하기 때문이다. 동작에서, 일 실시예에 따르면, 상기 적어도 하나의 프로세서는, 서버에게 서브 출력 데이터의 세트 를 송신할 수 있다. 상기 제1 출력 데이터와 상기 제2 출력 데이터의 차이 값의 세트 중 적어도 하나의 차이 값 이 기준 값 이상일 시, 상기 제1 가중치 세트는 상기 제2 가중치 세트를 대체할 수 없다. 상기 적어도 하나의 프로세서는, 양자화를 다시 수행하거나, 서버를 통해 양자화를 수행할 수 있다. 동작에서, 일 실시예에 따르면, 상기 적어도 하나의 프로세서는, 서버로부터 양자화 된 제3 가중치 세트를 수신할 수 있다. 상기 서버는 상기 서브 출력 데이터에 기반하여, 상기 제1 가중치 세트에 대한 양자화 가 수행된 상기 제3 가중치 세트들을 상기 통신 회로를 통해 상기 전자 장치로 송신할 수 있다. 상기 서버 는 어플리케이션의 실행에 따라 양자화를 요청한 복수의 전자 장치들에게 상기 제3 가중치 세트들을 송신할 수 있다. 상기 적어도 하나의 프로세서는, 상기 수신된 상기 제3 가중치 세트를 상기 메모리에 저장할 수 있 다. 상기 적어도 하나의 프로세서는, 뉴럴 네트워크 모델이 실행될 시, 상기 제3 가중치 세트에 기반하여 상기 제1 오퍼레이터에 대한 연산을 수행함으로써, 출력 데이터를 획득할 수 있다. 제2 데이터 타입의 상기 제3 가중치 세트에 기반하여, 제1 오퍼레이터에 대한 연산을 실행 시, NPU와 같은 머신 러닝에 대한 연산에 최적화 된 가속기에 기반하여, 연산이 실행될 수 있기 때문에. 연산 속도가 향상되고, 소모 전류도 감소할 수 있다. 이하 본 개시는 서브 출력 데이터의 범위에 기반하여 오퍼레이터에 포함된 가중치 세트를 양자화 하는 전자 장 치 및 방법에 대한 것이다. 상기 전자 장치는 서브 출력 데이터의 범위에 기반하여 개별 오퍼레이터 별로 양자 화를 수행함으로써 연산 속도를 향상시키고 소모전류를 감소시킬 수 있다. 모델의 양자화 완료 시, 신뢰도 평가 를 수행하여, 기준 값 미만의 신뢰도를 갖는 모델에 대해서 서버에서 양자화를 수행함으로써, 여러 전자 장치의 양자화 수행을 위한 자원을 줄일 수 있다. 본 개시에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효과들은 아래의 기재로부터 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다. 상술한 바와 같이, 전자 장치(electronic device)는 메모리(130;501), 및 적어도 하나의 프로세서 (120;200;511)를 포함할 수 있다. 상기 적어도 하나의 프로세서(120;200;511)는, 상기 메모리(130;501)에서, 모델(503;611)에 포함된 적어도 하나의 오퍼레이터 중 하나인 제1 오퍼레이터에 포함된 제1 데이터 타입의 제1 가중치 세트를 획득할 수 있다. 상기 적어도 하나의 프로세서(120;200;511)는 상기 메모리(130;501)에 저장 된, 상기 모델(503;611)의 실행에 의해 생성된 프로파일 정보로부터, 상기 제1 오퍼레이터의 연산 (computation)을 위해 이용된 입력 데이터(502;601)의 세트에 대응하는 서브 출력 데이터의 세트를 획득할 수 있다. 상기 적어도 하나의 프로세서(120;200;511)는 상기 서브 출력 데이터의 세트에 기반하여, 상기 제1 가중 치 세트에 대한 양자화를 수행함으로써 적어도 하나의 가속기에 의해 지원되는 제2 데이터 타입의 제2 가중치 세트를 획득할 수 있다. 상기 적어도 하나의 프로세서(120;200;511)는 상기 제2 가중치 세트를 획득하는 것에 기반하여, 상기 메모리(130;501)에 상기 제2 가중치 세트를 저장할 수 있다. 일 실시예에 따르면, 상기 제2 데이터 타입의 가중치 세트를 획득하기 위하여, 상기 적어도 하나의 프로세서 (120;200;511)는, 제1 구간의 부동 소수점 수를 표현하기 위한 상기 제1 데이터 타입의 상기 제1 가중치 세트로 부터, 상기 양자화를 통해, 상기 제1 구간의 길이 보다 작은 길이를 가지는 제2 구간의 수를 표현하기 위한 상 기 제2 데이터 타입의 상기 제2 가중치 세트를 획득할 수 있다. 일 실시예에 따르면, 상기 가속기는, 상기 제1 데이터 타입 또는 상기 제2 데이터 타입 중에서, 상기 제2 데이 터 타입에 기반하는 연산을 수행하기 위한 회로를 포함할 수 있다. 일 실시예에 따르면, 상기 가속기는, 상기 제1 데이터 타입 또는 상기 제2 데이터 타입 중에서, 상기 제2 데이 터 타입에 기반하는 연산을 수행하도록 구성될 수 있다. 일 실시예에 따르면, 상기 적어도 하나의 프로세서(120;200;511)는 상기 모델(503;611)과 관련된 기능을 실행하 기 위한 요청에 응답하여, 상기 제1 가중치 세트 또는 상기 제2 가중치 세트 중에서, 상기 제2 가중치 세트를 상기 가속기에 입력함으로써, 상기 제1 오퍼레이터의 연산을 추가적으로 수행할 수 있다. 일 실시예에 따르면, 상기 적어도 하나의 프로세서(120;200;511)는, 상기 제2 가중치 세트를 획득하는 것에 기 반하여, 상기 프로파일 정보로부터 상기 적어도 하나의 오퍼레이터에 대한 연산을 수행함으로써 획득된 제1 출 력 데이터의 세트를 식별할 수 있다. 상기 적어도 하나의 프로세서(120;200;511)는, 상기 제2 가중치 세트 에 기반하여 상기 적어도 하나의 오퍼레이터에 대한 연산을 수행함으로써, 상기 입력 데이터(502;601)의 세트로 부터 제2 출력 데이터의 세트를 획득할 수 있다. 상기 적어도 하나의 프로세서(120;200;511)는, 상기 제1 출력 데이터 및 대응하는 상기 제2 출력 데이터 사이의 차이 값(difference)의 세트에 기반하여, 상 기 모델(503;611)에 포함된 제1 오퍼레이터에 포함된 상기 제1 가중치 세트를, 상기 제2 가중치 세트로 교 체할 수 있다. 일 실시예에 따르면, 상기 전자 장치는 통신 회로를 추가적으로 포함할 수 있다. 상기 적어도 하나의 프로세서 (120;200;511)는, 상기 제1 출력 데이터 및 대응하는 상기 제2 출력 데이터 사이의 상기 차이 값의 세트 중 적어도 하나의 차이 값이 기준 값 이상임을 식별함에 기반하여, 상기 프로파일 정보로부터 획득된 상기 서브 출력 데이터의 세트를 통신 회로를 통해 서버에게 추가적으로 전송할 수 있다. 상기 적어도 하나의 프로세 서(120;200;511)는, 상기 서브 출력 데이터에 기반하여, 상기 제1 가중치 세트에 대한 양자화가 수행된 상기 제 2 데이터 타입의 제3 가중치 세트를 상기 통신 회로를 통해 서버로부터 추가적으로 수신할 수 있다. 상기 적어 도 하나의 프로세서(120;200;511)는, 상기 수신된 상기 제3 가중치 세트를 상기 메모리(130;501)에 추가적으로 저장할 수 있다. 일 실시예에 따르면, 상기 제2 데이터 타입의 상기 제2 가중치 세트를 획득하기 위하여, 상기 적어도 하나의 프 로세서(120;200;511)는, 상기 서브 출력 데이터의 세트의 분포에 기반하여, 상기 제1 가중치 세트에 대한 양자 화를 수행함으로써 상기 제2 가중치 세트를 획득할 수 있다. 일 실시예에 따르면, 상기 적어도 하나의 프로세서(120;200;511)는, 상기 제1 가중치 세트의 해시 값과 함께, 상기 제2 가중치 세트를 상기 메모리(130;501)에 추가적으로 저장할 수 있다. 일 실시예에 따르면, 상기 적어도 하나의 프로세서(120;200;511)는, 상기 제1 가중치 세트의 해시 값에 대응하 는 제2 가중치 세트에 기반하여 제1 오퍼레이터들에 대한 연산을 추가적으로 수행할 수 있다. 일 실시예에 따르면, 상기 제1 오퍼레이터의 상기 서브 출력 데이터의 세트는 상기 적어도 하나의 오퍼레 이터 중 하나인, 상기 제1 오퍼레이터에 연결된 제2 오퍼레이터의 입력 데이터(502;601)의 세트일 수 있다. 일 실시예에 따르면, 상기 메모리(130;501)에서, 상기 제1 가중치 세트를 획득하기 위하여, 상기 적어도 하나의 프로세서(120;200;511)는 오퍼레이터에 대한 연산(computation)을 위한 상기 가속기에 의해 지원되는 상기 제2 데이터 타입을 식별할 수 있다. 상기 메모리(130;501)에서, 상기 제1 가중치 세트를 획득하기 위하여, 상기 적 어도 하나의 프로세서(120;200;511)는, 상기 제2 데이터 타입과 상이한 상기 제1 오퍼레이터에 포함된 제1 가중치 세트의 제1 데이터 타입을 식별할 수 있다. 상기 메모리(130;501)에서, 상기 제1 가중치 세트를 획득하 기 위하여, 상기 적어도 하나의 프로세서(120;200;511)는, 상기 제2 데이터 타입과 상이한 상기 제1 데이터 타 입을 식별함에 기반하여, 상기 메모리(130;501)에서, 모델(503;611)에 포함된 적어도 하나의 오퍼레이터 중 하 나인 상기 제1 오퍼레이터에 포함된 상기 제1 데이터 타입의 상기 제1 가중치 세트를 획득할 수 있다. 일 실시예에 따르면, 상기 메모리(130;501)에서, 상기 제1 가중치 세트를 획득하기 위하여, 상기 적어도 하나의 프로세서(120;200;511)는 오퍼레이터에 대한 연산(computation)을 위한 상기 가속기에 의해 지원되는 상기 제2 데이터 타입을 식별할 수 있다. 상기 메모리(130;501)에서, 상기 제1 가중치 세트를 획득하기 위하여, 상기 적 어도 하나의 프로세서(120;200;511)는, 상기 제2 데이터 타입과 상이한 상기 제1 오퍼레이터에 포함된 제1 가중치 세트의 제1 데이터 타입을 식별하거나, 상기 제1 가중치 세트의 해시 값에 대응하는 제2 가중치 세트의 데이터 타입을 상기 제1 데이터 타입으로 식별하거나 상기 제1 가중치 세트의 상기 해시 값에 대응하는 가중치 세트가 상기 제1 가중치 세트뿐임을 식별함에 기반하여, 상기 메모리(130;501)에서, 모델(503;611)에 포함된 적 어도 하나의 오퍼레이터 중 하나인 상기 제1 오퍼레이터에 포함된 상기 제1 데이터 타입의 상기 제1 가중 치 세트를 획득할 수 있다. 일 실시예에 따르면, 상기 메모리(130;501)에서, 상기 제1 가중치 세트를 획득하기 위하여, 상기 적어도 하나의 프로세서(120;200;511)는, 상기 가속기에 의해 지원되는 상기 제2 데이터 타입을 식별할 수 있다. 상기 메모리 (130;501)에서, 상기 제1 가중치 세트를 획득하기 위하여, 상기 적어도 하나의 프로세서(120;200;511)는, 상기 제2 데이터 타입과 상이한 상기 제1 오퍼레이터에 포함된 제1 가중치 세트의 제1 데이터 타입을 식별하고 양자화에 기반하여 상기 제1 가중치 세트로부터 획득된 상기 제2 데이터 타입의 가중치 세트가 상기 메모리에 저장되었는지 여부 또는 상기 가중치 세트 내에 가중치가 포함되어 있는지 여부에 기반하여, 상기 제1 데이터 타입의 상기 제1 가중치 세트에 대한 양자화를 수행할지 여부를 결정할 수 있다. 상술한 바와 같이, 일 실시예에 따르면, 전자 장치(electronic device)에 의해 수행되는 방법은 메모리 (130;501)에서, 모델(503;611)에 포함된 적어도 하나의 오퍼레이터 중 하나인 제1 오퍼레이터에 포함된 제 1 데이터 타입의 제1 가중치 세트를 획득하는 동작을 포함할 수 있다. 상기 방법은 상기 메모리(130;501)에 저 장된, 상기 모델(503;611)의 실행에 의해 생성된 프로파일 정보로부터, 상기 제1 오퍼레이터의 연산 (computation)을 위해 이용된 입력 데이터(502;601)의 세트에 대응하는 서브 출력 데이터의 세트를 획득하는 동 작을 포함할 수 있다. 상기 방법은 상기 서브 출력 데이터의 세트에 기반하여, 상기 제1 가중치 세트에 대한 양 자화를 수행함으로써 적어도 하나의 가속기에 의해 지원되는 제2 데이터 타입의 제2 가중치 세트를 획득하는 동 작을 포함할 수 있다. 상기 방법은 상기 제2 가중치 세트를 획득하는 것에 기반하여, 상기 메모리(130;501)에 상기 제2 가중치 세트를 저장하는 동작을 포함할 수 있다. 일 실시예에 따르면, 상기 제2 데이터 타입의 가중치 세트를 획득하는 동작은, 제1 구간의 부동 소수점 수를 표 현하기 위한 상기 제1 데이터 타입의 상기 제1 가중치 세트로부터, 상기 양자화를 통해, 상기 제1 구간의 길이 보다 작은 길이를 가지는 제2 구간의 수를 표현하기 위한 상기 제2 데이터 타입의 상기 제2 가중치 세트를 획득 하는 동작을 포함할 수 있다. 일 실시예에 따르면, 상기 가속기는, 상기 제1 데이터 타입 또는 상기 제2 데이터 타입 중에서, 상기 제2 데이 터 타입에 기반하는 연산을 수행하도록 구성될 수 있다. 일 실시예에 따르면, 상기 방법은 상기 모델(503;611)과 관련된 기능을 실행하기 위한 요청에 응답하여, 상기 제1 가중치 세트 또는 상기 제2 가중치 세트 중에서, 상기 제2 가중치 세트를 상기 가속기에 입력함으로써, 상 기 제1 오퍼레이터의 연산을 수행하는 동작을 추가적으로 포함할 수 있다. 일 실시예에 따르면, 상기 방법은 상기 제2 가중치 세트를 획득하는 것에 기반하여, 상기 프로파일 정보로부터 상기 적어도 하나의 오퍼레이터에 대한 연산을 수행함으로써 획득된 제1 출력 데이터의 세트를 식별하는동작을 포함할 수 있다. 상기 방법은 상기 제2 가중치 세트에 기반하여 상기 적어도 하나의 오퍼레이터에 대한 연산을 수행함으로써, 상기 입력 데이터(502;601)의 세트로부터 제2 출력 데이터의 세트를 획득하는 동작 을 포함할 수 있다. 상기 방법은 상기 제1 출력 데이터 및 대응하는 상기 제2 출력 데이터 사이의 차 이 값(difference)의 세트에 기반하여, 상기 모델(503;611)에 포함된 제1 오퍼레이터에 포함된 상기 제1 가중치 세트를, 상기 제2 가중치 세트로 교체하는 동작을 포함할 수 있다. 일 실시예에 따르면, 상기 방법은 상기 제1 출력 데이터 및 대응하는 상기 제2 출력 데이터 사이의 상기 차이 값의 세트 중 적어도 하나의 차이 값이 기준 값 이상임을 식별함에 기반하여, 상기 프로파일 정보로 부터 획득된 상기 서브 출력 데이터의 세트를 통신 회로를 통해 서버에게 전송하는 동작을 추가적으로 포함할 수 있다. 상기 방법은 상기 서브 출력 데이터에 기반하여, 상기 제1 가중치 세트에 대한 양자화가 수행된 상기 제2 데이터 타입의 제3 가중치 세트를 상기 통신 회로를 통해 서버로부터 수신하는 동작을 추가적으로 포함할 수 있다. 상기 방법은 상기 수신된 상기 제3 가중치 세트를 상기 메모리(130;501)에 저장하는 동작을 추가적으 로 포함할 수 있다. 일 실시예에 따르면, 상기 제2 데이터 타입의 상기 제2 가중치 세트를 획득하는 동작은 상기 서브 출력 데이터 의 세트의 분포에 기반하여, 상기 제1 가중치 세트에 대한 양자화를 수행함으로써 상기 제2 가중치 세트를 획득 하는 동작을 포함할 수 있다. 일 실시예에 따르면, 상기 제1 가중치 세트의 해시 값과 함께, 상기 제2 가중치 세트를 상기 메모리(130;501)에 저장하는 동작을 추가적으로 포함할 수 있다. 일 실시예에 따르면, 상기 방법은 상기 제1 가중치 세트의 해시 값에 대응하는 제2 가중치 세트에 기반하여 제1 오퍼레이터들에 대한 연산을 수행하는 동작을 추가적으로 포함할 수 있다. 일 실시예에 따르면, 상기 제1 오퍼레이터의 상기 서브 출력 데이터의 세트는 상기 적어도 하나의 오퍼레 이터 중 하나인, 상기 제1 오퍼레이터에 연결된 제2 오퍼레이터의 입력 데이터(502;601)의 세트일 수 있다. 일 실시예에 따르면, 상기 메모리(130;501)에서, 상기 제1 가중치 세트를 획득하는 동작은, 오퍼레이터에 대한 연산(computation)을 위한 상기 가속기에 의해 지원되는 상기 제2 데이터 타입을 식별하는 동작을 포함할 수 있 다. 상기 메모리(130;501)에서, 상기 제1 가중치 세트를 획득하는 동작은, 상기 제2 데이터 타입과 상이한 상기 제1 오퍼레이터에 포함된 제1 가중치 세트의 제1 데이터 타입을 식별하는 동작을 포함할 수 있다. 상기 메 모리(130;501)에서, 상기 제1 가중치 세트를 획득하는 동작은, 상기 제2 데이터 타입과 상이한 상기 제1 데이터 타입을 식별함에 기반하여, 상기 메모리(130;501)에서, 모델(503;611)에 포함된 적어도 하나의 오퍼레이터 중 하나인 상기 제1 오퍼레이터에 포함된 상기 제1 데이터 타입의 상기 제1 가중치 세트를 획득하는 동작을 포함할 수 있다. 일 실시예에 따르면, 상기 메모리(130;501)에서, 상기 제1 가중치 세트를 획득하는 동작은, 오퍼레이터에 대한 연산(computation)을 위한 상기 가속기에 의해 지원되는 상기 제2 데이터 타입을 식별하는 동작을 포함할 수 있 다. 상기 메모리(130;501)에서, 상기 제1 가중치 세트를 획득하는 동작은, 상기 제2 데이터 타입과 상이한 상기 제1 오퍼레이터에 포함된 제1 가중치 세트의 제1 데이터 타입을 식별하는 동작, 상기 제1 가중치 세트의 해시 값에 대응하는 상기 제2 가중치 세트의 데이터 타입을 상기 제1 데이터 타입으로 식별하는 동작, 또는 상 기 제1 가중치 세트의 상기 해시 값에 대응하는 가중치 세트가 상기 제1 가중치 세트뿐임을 식별하는 동작에 기 반하여, 상기 메모리(130;501)에서, 모델(503;611)에 포함된 적어도 하나의 오퍼레이터 중 하나인 상기 제1 오 퍼레이터에 포함된 상기 제1 데이터 타입의 상기 제1 가중치 세트를 획득하는 동작을 포함할 수 있다. 일 실시예에 따르면, 상기 메모리(130;501)에서, 상기 제1 가중치 세트를 획득하는 동작은, 상기 가속기에 의해 지원되는 상기 제2 데이터 타입을 식별하는 동작을 포함할 수 있다. 상기 메모리(130;501)에서, 상기 제1 가중 치 세트를 획득하는 동작은, 상기 제2 데이터 타입과 상이한 상기 제1 오퍼레이터에 포함된 제1 가중치 세 트의 제1 데이터 타입을 식별하는 동작을 포함할 수 있다. 상기 메모리(130;501)에서, 상기 제1 가중치 세트를 획득하는 동작은, 양자화에 기반하여 상기 제1 가중치 세트로부터 획득된 상기 제2 데이터 타입의 가중치 세트 가 상기 메모리에 저장되었는지 여부 또는 상기 가중치 세트 내에 가중치가 포함되어 있는지 여부에 기반하여, 상기 제1 데이터 타입의 상기 제1 가중치 세트에 대한 양자화를 수행할지 여부를 결정하는 동작을 포함할 수 있 다. 상술한 바와 같이. 일 실시예에 따르면, 하나 이상의 프로그램들을 저장하는 컴퓨터 판독가능 저장 매체 (computer readable storage medium)에 있어서, 상기 하나 이상의 프로그램들은, 전자 장치의 프로세서에 의해 실행될 시에, 상기 메모리(130;501)에서, 모델(503;611)에 포함된 적어도 하나의 오퍼레이터 중 하나인 제1 오 퍼레이터에 포함된 제1 데이터 타입의 제1 가중치 세트를 획득하도록 상기 전자 장치를 야기하는 인스트럭 션들을 포함할 수 있다. 상기 하나 이상의 프로그램들은, 상기 메모리(130;501)에 저장된, 상기 모델(503;611) 의 실행에 의해 생성된 프로파일 정보로부터, 상기 제1 오퍼레이터의 연산(computation)을 위해 이용된 입 력 데이터(502;601)의 세트에 대응하는 서브 출력 데이터의 세트를 획득하도록 상기 전자 장치를 야기하는 인스 트럭션들을 포함할 수 있다. 상기 하나 이상의 프로그램들은, 상기 서브 출력 데이터의 세트에 기반하여, 상기 제1 가중치 세트에 대한 양자화를 수행함으로써 적어도 하나의 가속기에 의해 지원되는 제2 데이터 타입의 제2 가중치 세트를 획득하도록 상기 전자 장치를 야기하는 인스트럭션들을 포함할 수 있다. 상기 하나 이상의 프로 그램들은, 상기 제2 가중치 세트를 획득하는 것에 기반하여, 상기 메모리(130;501)에 상기 제2 가중치 세트를 저장하도록, 상기 전자 장치를 야기하는 인스트럭션들을 포함할 수 있다. 일 실시예에 따르면, 하나 이상의 프로그램들을 저장하는 컴퓨터 판독가능 저장 매체(computer readable storage medium)에 있어서, 상기 하나 이상의 프로그램들은, 전자 장치의 프로세서에 의해 실행될 시에, 상기 제2 데이터 타입의 가중치 세트를 획득하기 위하여, 상기 적어도 하나의 프로세서(120;200;511)는, 제1 구간의 부동 소수점 수를 표현하기 위한 상기 제1 데이터 타입의 상기 제1 가중치 세트로부터, 상기 양자화를 통해, 상 기 제1 구간의 길이 보다 작은 길이를 가지는 제2 구간의 수를 표현하기 위한 상기 제2 데이터 타입의 상기 제2 가중치 세트를 획득하도록 상기 전자 장치를 야기하는 인스트럭션들을 포함할 수 있다. 일 실시예에 따르면, 하나 이상의 프로그램들을 저장하는 컴퓨터 판독가능 저장 매체(computer readable storage medium)에 있어서, 상기 하나 이상의 프로그램들은, 전자 장치의 프로세서에 의해 실행될 시에, 상기 가속기는, 상기 제1 데이터 타입 또는 상기 제2 데이터 타입 중에서, 상기 제2 데이터 타입에 기반하는 연산을 수행하도록, 상기 전자 장치를 야기하는 인스트럭션들을 포함할 수 있다. 일 실시예에 따르면, 하나 이상의 프로그램들을 저장하는 컴퓨터 판독가능 저장 매체(computer readable storage medium)에 있어서, 상기 하나 이상의 프로그램들은, 전자 장치의 프로세서에 의해 실행될 시에, 상기 모델(503;611)과 관련된 기능을 실행하기 위한 요청에 응답하여, 상기 제1 가중치 세트 또는 상기 제2 가중치 세트 중에서, 상기 제2 가중치 세트를 상기 가속기에 입력함으로써, 상기 제1 오퍼레이터의 연산을 수행하 도록, 상기 전자 장치를 야기하는 인스트럭션들을 포함할 수 있다. 일 실시예에 따르면, 하나 이상의 프로그램들을 저장하는 컴퓨터 판독가능 저장 매체(computer readable storage medium)에 있어서, 상기 하나 이상의 프로그램들은, 전자 장치의 프로세서에 의해 실행될 시에, 상기 제2 가중치 세트를 획득하는 것에 기반하여, 상기 프로파일 정보로부터 상기 적어도 하나의 오퍼레이터에 대한 연산을 수행함으로써 획득된 제1 출력 데이터의 세트를 식별하고, 상기 제2 가중치 세트에 기반하여 상기 적어도 하나의 오퍼레이터에 대한 연산을 수행함으로써, 상기 입력 데이터(502;601)의 세트로부터 제2 출력 데 이터의 세트를 획득하고, 상기 제1 출력 데이터 및 대응하는 상기 제2 출력 데이터 사이의 차이 값(difference)의 세트에 기반하여, 상기 모델(503;611)에 포함된 제1 오퍼레이터에 포함된 상기 제1 가중 치 세트를, 상기 제2 가중치 세트로 교체하도록, 상기 전자 장치를 야기하는 인스트럭션들을 포함할 수 있다. 일 실시예에 따르면, 하나 이상의 프로그램들을 저장하는 컴퓨터 판독가능 저장 매체(computer readable storage medium)에 있어서, 상기 하나 이상의 프로그램들은, 전자 장치의 프로세서에 의해 실행될 시에, 상기 제1 출력 데이터 및 대응하는 상기 제2 출력 데이터 사이의 상기 차이 값의 세트 중 적어도 하나의 차이 값이 기준 값 이상임을 식별함에 기반하여, 상기 프로파일 정보로부터 획득된 상기 서브 출력 데이터의 세 트를 상기 통신 회로를 통해 서버에게 전송하고, 상기 서브 출력 데이터에 기반하여, 상기 제1 가중치 세트에 대한 양자화가 수행된 상기 제2 데이터 타입의 제3 가중치 세트를 상기 통신 회로를 통해 서버로부터 수신하고, 상기 수신된 상기 제3 가중치 세트를 상기 메모리(130;501)에 저장하도록, 상기 전자 장치를 야기하는 인스트럭 션들을 포함할 수 있다. 일 실시예에 따르면, 하나 이상의 프로그램들을 저장하는 컴퓨터 판독가능 저장 매체(computer readable storage medium)에 있어서, 상기 하나 이상의 프로그램들은, 전자 장치의 프로세서에 의해 실행될 시에, 상기 제2 데이터 타입의 상기 제2 가중치 세트를 획득하기 위하여, 상기 서브 출력 데이터의 세트의 분포에 기반하여, 상기 제1 가중치 세트에 대한 양자화를 수행함으로써 상기 제2 가중치 세트를 획득하도록, 상기 전자 장치를 야기하는 인스트럭션들을 포함할 수 있다. 일 실시예에 따르면, 하나 이상의 프로그램들을 저장하는 컴퓨터 판독가능 저장 매체(computer readable storage medium)에 있어서, 상기 하나 이상의 프로그램들은, 전자 장치의 프로세서에 의해 실행될 시에, 상기 제1 가중치 세트의 해시 값과 함께, 상기 제2 가중치 세트를 상기 메모리(130;501)에 저장하도록, 상기 전자 장 치를 야기하는 인스트럭션들을 포함할 수 있다. 일 실시예에 따르면, 하나 이상의 프로그램들을 저장하는 컴퓨터 판독가능 저장 매체(computer readable storage medium)에 있어서, 상기 하나 이상의 프로그램들은, 전자 장치의 프로세서에 의해 실행될 시에, 상기 제1 가중치 세트의 해시 값에 대응하는 제2 가중치 세트에 기반하여 제1 오퍼레이터들에 대한 연산을 수행 하도록 상기 전자 장치를 야기하는 인스트럭션들을 포함할 수 있다. 일 실시예에 따르면, 하나 이상의 프로그램들을 저장하는 컴퓨터 판독가능 저장 매체(computer readable storage medium)에 있어서, 상기 제1 오퍼레이터의 상기 서브 출력 데이터의 세트는 상기 적어도 하나의 오퍼레이터 중 하나인, 상기 제1 오퍼레이터에 연결된 제2 오퍼레이터의 입력 데이터(502;601)의 세트일 수 있다. 일 실시예에 따르면, 하나 이상의 프로그램들을 저장하는 컴퓨터 판독가능 저장 매체(computer readable storage medium)에 있어서, 상기 하나 이상의 프로그램들은, 전자 장치의 프로세서에 의해 실행될 시에, 상기 메모리(130;501)에서, 상기 제1 가중치 세트를 획득하기 위하여, 상기 가속기에 의해 지원되는 상기 제2 데이터 타입을 식별하고, 상기 제2 데이터 타입과 상이한 상기 제1 오퍼레이터에 포함된 제1 가중치 세트의 제1 데이터 타입을 식별했는지 여부, 양자화에 기반하여 상기 제1 가중치 세트로부터 획득된 상기 제2 데이터 타입 의 가중치 세트가 상기 메모리에 저장되었는지 여부, 또는 상기 제2 데이터 타입의 상기 가중치 세트 내에 가중 치가 포함되어 있는지 여부에 기반하여, 상기 제1 데이터 타입의 상기 제1 가중치 세트에 대한 양자화를 수행할 지 여부를 결정 하도록 상기 전자 장치를 야기하는 인스트럭션들을 포함할 수 있다. 본 개시의 청구항 또는 명세서에 기재된 실시예들에 따른 방법들은 하드웨어, 소프트웨어, 또는 하드웨어와 소 프트웨어의 조합의 형태로 구현될(implemented) 수 있다. 소프트웨어로 구현하는 경우, 하나 이상의 프로그램(소프트웨어 모듈)을 저장하는 컴퓨터 판독 가능 저장 매체 가 제공될 수 있다. 컴퓨터 판독 가능 저장 매체에 저장되는 하나 이상의 프로그램들은, 전자 장치(device) 내 의 하나 이상의 프로세서에 의해 실행 가능하도록 구성된다(configured for execution). 하나 이상의 프로그램 은, 전자 장치로 하여금 본 개시의 청구항 또는 명세서에 기재된 실시예들에 따른 방법들을 실행하게 하는 명령 어(instructions)를 포함한다. 상기 하나 이상의 프로그램들은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory(CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어 TM)를 통해 또는 두 개의 사용자 장치들(예: 스마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨 터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같 은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 이러한 프로그램(소프트웨어 모듈, 소프트웨어)은 랜덤 액세스 메모리 (random access memory), 플래시(flash) 메모리를 포함하는 불휘발성(non-volatile) 메모리, 롬(read only memory, ROM), 전기적 삭제가능 프로그램가 능 롬(electrically erasable programmable read only memory, EEPROM), 자기 디스크 저장 장치(magnetic disc storage device), 컴팩트 디스크 롬(compact disc-ROM, CD-ROM), 디지털 다목적 디스크(digital versatile discs, DVDs) 또는 다른 형태의 광학 저장 장치, 마그네틱 카세트(magnetic cassette)에 저장될 수 있다. 또는, 이들의 일부 또는 전부의 조합으로 구성된 메모리에 저장될 수 있다. 또한, 각각의 구성 메모리는 다수 개 포함될 수도 있다. 또한, 프로그램은 인터넷(Internet), 인트라넷(Intranet), LAN(local area network), WAN(wide area network), 또는 SAN(storage area network)과 같은 통신 네트워크, 또는 이들의 조합으로 구성된 통신 네트워크를 통하여 접근(access)할 수 있는 부착 가능한(attachable) 저장 장치(storage device)에 저장될 수 있다. 이러한 저장 장치는 외부 포트를 통하여 본 개시의 실시예를 수행하는 장치에 접속할 수 있다. 또한, 통신 네트워크상의 별 도의 저장장치가 본 개시의 실시예를 수행하는 장치에 접속할 수도 있다. 상술한 본 개시의 구체적인 실시예들에서, 개시에 포함되는 구성 요소는 제시된 구체적인 실시예에 따라 단수 또는 복수로 표현되었다. 그러나, 단수 또는 복수의 표현은 설명의 편의를 위해 제시한 상황에 적합하게 선택된것으로서, 본 개시가 단수 또는 복수의 구성 요소에 제한되는 것은 아니며, 복수로 표현된 구성 요소라 하더라 도 단수로 구성되거나, 단수로 표현된 구성 요소라 하더라도 복수로 구성될 수 있다. 실시예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요 소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 실시예들에 따르면, 모듈, 프로그램 또는 다른 구성요 소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동작 들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다. 한편 본 개시의 상세한 설명에서는 구체적인 실시예에 관해 설명하였으나, 본 개시의 범위에서 벗어나지 않는 한도 내에서 여러 가지 변형이 가능할 수 있다."}
{"patent_id": "10-2023-0030093", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 2는 일 실시예에 따른 전자 장치에 포함된 하나 이상의 프로세서들을 설명하기 위한 블록도이다. 도 3은 일 실시예에 따른 전자 장치에서 실행되는 뉴럴 네트워크를 설명하기 위한 예시적인 도면이다. 도 4는 일 실시예에 따른 가중치에 대한 양자화를 설명하기 위한 예시적인 도면이다. 도 5는 일 실시예에 따른 전자 장치에 포함된 메모리의 동작을 설명하기 위한 블록도이다. 도 6은 일 실시예에 따른 전자 장치에서 실행되는 모델의 신뢰도 평가를 설명하기 위한 블록도이다. 도 7은 일 실시예에 따른 양자화 된 제2 가중치 세트들을 저장하기 위한 전자 장치의 동작의 흐름을 도시한다. 도 8은 일 실시예에 따른 서버를 이용하여 양자화를 실행하는 동작의 흐름을 도시한다. 도 9는 일 실시예에 따른 양자화를 통해 제2 가중치 세트를 획득하기 위한 전자 장치의 동작의 흐름을 도시한다. 도 10은 일 실시예에 따른 신뢰도 평가에 기반하여 제2 가중치 세트를 저장하기 위한 전자 장치의 동작의 흐름 을 도시한다. 도 11은 일 실시예에 따른, 신뢰도에 따라 양자화 방식을 식별하기 위한 전자 장치의 동작의 흐름을 도시한다."}
