{"patent_id": "10-2023-7022911", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0113628", "출원번호": "10-2023-7022911", "발명의 명칭": "오프셋 본딩을 갖는 아이웨어 디스플레이", "출원인": "스냅 인코포레이티드", "발명자": "나가라즈, 베나마나할리, 케이."}}
{"patent_id": "10-2023-7022911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "아이웨어로서,프레임;상기 프레임에 커플링되는 템플; 및상기 프레임에 의해 지지되는 디스플레이를 포함하며, 상기 디스플레이는 이미지를 생성하도록 구성된 제1 층,및 상기 제1 층의 양측들 상에 포지셔닝된 제2 층 및 제3 층을 포함하며, 상기 제2 층 및 상기 제3 층은 상기제1 층의 외부 에지로부터 안쪽으로 오프셋 거리에 포지셔닝된 개개의 접착제에 의해 상기 제1 층에 각각 부착되는, 아이웨어."}
{"patent_id": "10-2023-7022911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서, 상기 제1 층의 외부 에지에서 상기 제 2층과 상기 제1 층 사이에 그리고 상기 제3 층과 상기 제1 층 사이에 포지셔닝된 접착제가 없는, 아이웨어."}
{"patent_id": "10-2023-7022911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서, 상기 제1 층은 광 도파관인, 아이웨어."}
{"patent_id": "10-2023-7022911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2 항에 있어서, 상기 제2 층 및 상기 제3 층은 각각 기판들인, 아이웨어."}
{"patent_id": "10-2023-7022911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4 항에 있어서, 상기 기판들 각각은 광학적으로 투명한 유리 기판을 포함하는, 아이웨어."}
{"patent_id": "10-2023-7022911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4 항에 있어서, 상기 기판과 상기 제1 층 사이에서 에어 갭(air gap)을 더 포함하는, 아이웨어."}
{"patent_id": "10-2023-7022911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1 항에 있어서, 상기 접착제의 오프셋 거리는 상기 제1 층의 두께의 적어도 2배인, 아이웨어."}
{"patent_id": "10-2023-7022911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1 항에 있어서, 상기 디스플레이는 상기 제2 층의 외부 에지로부터 안쪽으로 포지셔닝된 접착제에 의해 상기 프레임에부착되는, 아이웨어."}
{"patent_id": "10-2023-7022911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "공개특허 10-2023-0113628-3-프레임 및 상기 프레임에 커플링된 템플을 갖는 아이웨어와 함께 사용하도록 구성된 디스플레이로서,이미지를 생성하도록 구성된 제1 층; 및상기 제1 층의 양측들 상에 포지셔닝된 제2 층 및 제3 층을 포함하며, 상기 제2 층 및 상기 제3 층은 상기 제1층의 외부 에지로부터 안쪽으로 오프셋 거리에 포지셔닝된 개개의 접착제에 의해 상기 제1 층에 각각 부착되는,디스플레이."}
{"patent_id": "10-2023-7022911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9 항에 있어서, 상기 제1 층의 외부 에지에서 상기 제 2층과 상기 제1 층 사이에 그리고 상기 제3 층과 상기 제1 층 사이에 포지셔닝된 접착제가 없는, 디스플레이."}
{"patent_id": "10-2023-7022911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10 항에 있어서, 상기 제1 층은 광 도파관인, 디스플레이."}
{"patent_id": "10-2023-7022911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10 항에 있어서, 상기 제2 층 및 상기 제3 층은 각각 기판들인, 디스플레이."}
{"patent_id": "10-2023-7022911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12 항에 있어서, 상기 기판들 각각은 광학적으로 투명한 유리 기판을 포함하는, 디스플레이."}
{"patent_id": "10-2023-7022911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12 항에 있어서, 상기 기판과 상기 제1 층 사이에서 에어 갭을 더 포함하는, 디스플레이."}
{"patent_id": "10-2023-7022911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제9 항에 있어서, 상기 접착제의 오프셋 거리는 상기 제1 층의 두께의 적어도 2배인, 디스플레이."}
{"patent_id": "10-2023-7022911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제9 항에 있어서, 상기 디스플레이는 상기 제2 층의 외부 에지로부터 안쪽으로 포지셔닝된 접착제에 의해 아이웨어 프레임에 부착되는, 디스플레이."}
{"patent_id": "10-2023-7022911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "프레임, 상기 프레임에 커플링된 템플, 및 디스플레이를 갖는 아이웨어를 생성하는 방법으로서, 상기 디스플레이는 이미지를 생성하도록 구성된 제1 층, 및 상기 제1 층의 양측들 상에 포지셔닝된 제2 층 및제3 층을 포함하며, 상기 방법은,상기 제1 층과 상기 제2 층 사이에 제1 접착제를 배치하는 단계 ― 상기 제1 접착제는 상기 제1 층의 외부 에지로부터 안쪽으로 오프셋 거리에 포지셔닝됨 ―;상기 제1 층을 상기 제2 층에 커플링하는 단계;공개특허 10-2023-0113628-4-상기 제1 층과 상기 제3 층 사이에 제2 접착제를 배치하는 단계 ― 상기 제2 접착제는 상기 제1 층의 외부 에지로부터 안쪽으로 오프셋 거리에 포지셔닝됨 ―; 상기 제1 층을 상기 제3 층에 커플링하는 단계; 및상기 디스플레이를 상기 아이웨어 프레임에 커플링하는 단계를 포함하는, 방법."}
{"patent_id": "10-2023-7022911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17 항에 있어서, 상기 제1 층의 외부 에지에서 상기 제 2층과 상기 제1 층 사이에 그리고 상기 제3 층과 상기 제1 층 사이에 포지셔닝된 접착제가 없는, 방법."}
{"patent_id": "10-2023-7022911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18 항에 있어서, 상기 제1 층은 광 도파관인, 방법."}
{"patent_id": "10-2023-7022911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19 항에 있어서, 상기 제2 층 및 상기 제3 층은 각각 기판들인, 방법."}
{"patent_id": "10-2023-7022911", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "층들의 외부 에지로부터 안쪽으로 오프셋 거리에서 층들을 함께 본딩하는 접착제를 갖는 다층 디스플레이를 포함 하는 아이웨어가 제공된다. 디스플레이는 일례에서 광 도파관과 같은 이미지 디스플레이 층, 및 이미지 디스플 레이 층을 둘러싸고 유리와 같은 광학적으로 투명한 기판들을 포함할 수 있는 한 쌍의 층들을 갖는다. 개개의 접착제는 이미지 디스플레이 층과 한 쌍의 층들의 각각의 층 사이에서 디스플레이 층의 외부 에지로부터 안쪽으 로 오프셋 거리에 포지셔닝되어 디스플레이의 응력을 감소시킨다. 접착제들 각각은 외부 에지들에서 한 쌍의 층 들과 이미지 디스플레이 층 사이에 접착제가 없도록 연속 비드일 수 있다. 일례에서, 오프셋 거리는 이미지 디 스플레이 층의 응력을 감소시키기 위해 이미지 디스플레이 층의 두께의 적어도 2배일 수 있다."}
{"patent_id": "10-2023-7022911", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 출원은 2020년 12월 8일에 출원된 미국 출원 일련번호 제17/115, 244호에 대해 우선권을 주장하며, 이 출원의 내용들은 인용에 의해 본원에 완전히 통합된다. 본 청구대상은 아이웨어 디바이스, 예컨대 스마트 안경 및 시-스루 디스플레이들에 관한 것이다."}
{"patent_id": "10-2023-7022911", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "현재 이용 가능한 스마트 안경, 헤드웨어 및 헤드기어와 같은 휴대용 아이웨어 디바이스들은 전자 장치 들, 이를테면 카메라들 및 디스플레이들을 포함한다."}
{"patent_id": "10-2023-7022911", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아이웨어는 층들의 외부 에지로부터 안쪽으로 오프셋 거리에서 층들을 함께 본딩하는 접착제를 갖는 다 층 디스플레이를 포함한다. 디스플레이는 일례에서 광 도파관과 같은 이미지 디스플레이 층, 및 이미지 디스플 레이 층을 둘러싸고 유리와 같은 광학적으로 투명한 기판들을 포함할 수 있는 한 쌍의 층들을 갖는다. 개개의 접착제는 이미지 디스플레이 층과 한 쌍의 층들의 각각의 층 사이에서 이미지 디스플레이 층의 외부 에지로부터 안쪽으로 오프셋 거리에 포지셔닝되어 디스플레이의 응력을 감소시킨다. 접착제들 각각은 외주 에지들에서 한 쌍의 층들과 이미지 디스플레이 층 사이에 접착제가 없도록 연속 비드일 수 있다. 접착제의 오프셋 거리로 인 해, 단순히 지지된 로케이션들(자유 단부들)에서, 굽힘 모멘트가 없으므로 굽힘 응력이 없으며, 그 결과 굽힘 동안 도파관 에지 응력을 없게 한다. 일례에서, 오프셋 거리는 이미지 디스플레이 층의 응력을 감소시키기 위 해 이미지 디스플레이 층의 두께의 적어도 2배일 수 있다. 예들의 부가적인 목적들, 장점들 및 신규한 특징들은 후속하는 상세한 설명에서 부분적으로 기재될 것 이며, 부분적으로는, 다음의 상세한 설명 및 첨부된 도면들의 검토 시에 당업자들에게 자명하게 될 것이거나 또 는 예들의 생성 또는 실시에 의해 습득될 수 있다. 본 발명의 청구대상의 목적들 및 장점들은 특히 첨부된 청 구항들에서 적시된 방법론들, 기구들 및 조합들에 의해 실현 및 달성될 수 있다. 하기의 상세한 설명에서, 관련 교시들의 철저한 이해를 제공하기 위해 다수의 특정 세부사항들이 예들 로서 기술된다. 그러나, 이러한 세부사항들 없이도 본 교시들이 실시될 수 있다는 것이 당업자에게 자명할 것 이다. 다른 예들에서, 본 교시들의 양상들을 불필요하게 모호하게 하는 것을 회피하기 위해, 널리 알려진 방법 들, 절차들, 컴포넌트들, 및 회로부는 세부사항 없이 비교적 하이-레벨로 설명되었다. 본원에서 사용되는 “커플링된(coupled)”이라는 용어는 하나의 시스템 엘리먼트에 의해 생성 또는 공 급된 신호들 또는 광이 다른 커플링된 엘리먼트에 부여되게 하는 임의의 논리적, 광학적, 물리적 또는 전기적 연결, 링크 등을 지칭한다. 달리 설명되지 않는 한, 커플링된 엘리먼트들 또는 디바이스들은 반드시 서로 직접 연결될 필요는 없으며, 광 또는 신호들을 수정, 조작 또는 반송할 수 있는 중간 컴포넌트들, 엘리먼트들 또는 통신 매체들에 의해 분리될 수 있다. 도면들 중 임의의 도면에 도시된 바와 같이 아이웨어 디바이스, 연관된 컴포넌트들, 및 눈 스캐너 및 카메라를 통합한 임의의 완전한 디바이스들의 배향들은 예시 및 논의의 목적을 위해 예로서만 제공된다. 특정 가변 광학 프로세싱 애플리케이션에 위한 동작에서, 아이웨어 디바이스는 아이웨어 디바이스의 특정 애플리케이 션에 적합한 임의의 다른 방향, 예컨대 위로, 아래로, 옆으로 또는 임의의 다른 배향으로 배향될 수 있다. 또 한, 본원에 사용되는 범위까지, 앞, 뒤, 내향, 외향, 쪽으로, 좌측, 우측, 측방향, 종방향, 위로, 아래로, 상부, 하부, 최상부, 최하부 및 측면과 같은 임의의 방향성 용어는 단지 예시로서 사용되며, 달리 본원에 설명 된 바와 같이 구성된 임의의 광학 또는 광학 컴포넌트의 방향 또는 배향으로 제한되지 않는다. 이제, 첨부된 도면들에서 예시되고 아래에서 논의되는 예들을 상세히 참조한다. 도 1a는 이미지 디스플레이(180D)(도 2a)를 갖는 우측 광학 조립체(180B)를 포함하는 아이웨어 디바이 스의 예시적인 하드웨어 구성의 측면도이다. 아이웨어 디바이스는 스테레오 카메라를 형성하는 다수 의 가시광 카메라들(114A-B)(도 7)을 포함할 수 있고, 이들 중 우측 가시광 카메라(114B)는 우측 템플(110B) 상 에 로케이팅된다. 좌측 및 우측 가시광 카메라들(114A-B)은 가시광 범위 파장에 민감한 이미지 센서를 갖는다. 가시광 카메라들(114A-B)의 각각은 상이한 전방을 향하는 커버리지 각도를 가지며, 예컨대 가시광 카메라(114B)는 도시 된 커버리지 각도(111B)를 갖는다. 커버리지 각도는 가시광 카메라(114A-B)의 이미지 센서가 전자기 방사선을 픽업하여 이미지들을 생성하는 각도 범위이다. 이러한 가시광 카메라(114A-B)의 예들은 640p(예컨대, 총 0.3 메가픽셀들의 경우 640 x 480 픽셀들), 720p, 또는 1080p와 같은 고해상도 CMOS(complementary metal-oxide- semiconductor) 이미지 센서 및 VGA(video graphic array) 카메라를 포함한다. 가시광 카메라들(114A-B)로부 터의 이미지 센서 데이터는 지오로케이션 데이터와 함께 캡처되고, 이미지 프로세서에 의해 디지털화되고, 메모 리에 저장된다. 입체 비전을 제공하기 위해, 가시광 카메라들(114A-B)은 장면의 이미지가 캡처되는 타임스탬프와 함께 디지털 프로세싱을 위해 이미지 프로세서(도 9의 엘리먼트)에 커플링될 수 있다. 이미지 프로세서는 가시광 카메라들(114A-B)로부터 신호들을 수신하고 가시광 카메라들(114A-B)로부터의 그러한 신호들을 메모리 (도 9의 엘리먼트)에 저장하기에 적합한 포맷으로 프로세싱하는 회로부를 포함한다. 타임스탬프는 가시광 카메라들(114A-B)의 동작을 제어하는 이미지 프로세서 또는 다른 프로세서에 의해 추가될 수 있다. 가시 광 카메라들(114A-B)은 스테레오 카메라가 인간의 쌍안 비전을 시뮬레이팅할 수 있게 한다. 스테레오 카메라들 은 동일한 타임스탬프를 각각 갖는, 가시광 카메라들(114A-B)로부터의 2개의 캡처된 이미지들(도 7의 엘리먼트 들(758A-B))에 기반하여 3차원 이미지들(도 7의 엘리먼트)을 재현하는 능력을 제공한다. 이러한 3차원 이 미지들은 몰입적이고 실감나는 경험, 예컨대, 가상 현실 또는 비디오 게이밍을 허용한다. 입체 비전의 경 우에, 이미지들(758A-B)의 쌍은 주어진 순간에 생성되는데, 좌측 및 우측 가시광 카메라들(114A-B) 각각에 대해 하나의 이미지가 생성된다. 좌측 및 우측 가시광 카메라들(114A-B)의 전방을 향하는 커버리지 각도(111A-B)로 부터의 생성된 이미지들(758A-B)의 쌍이 (예컨대, 이미지 프로세서에 의해) 함께 스티칭될 때, 깊이 인식 은 광학 조립체(180A-B)에 의해 제공된다. 예에서, 사용자 인터페이스 시야 조절 시스템은 아이웨어 디바이스를 포함한다. 아이웨어 디바이 스는 프레임, 프레임의 우측 측방향 측면(170B)으로부터 연장되는 우측 템플(110B), 및 그래픽 사용자 인터페이스를 사용자에게 제시하기 위한 광학 조립체(180B)를 포함하는 시-스루 이미지 디스플레이 (180D)(도 2a-b)를 포함한다. 아이웨어 디바이스는 장면의 제1 이미지를 캡처하기 위해 프레임 또는 좌측 템플(110A)에 연결된 좌측 가시광 카메라(114A)를 포함한다. 아이웨어 디바이스는 제1 이미지와 부 분적으로 중첩하는 장면의 제2 이미지를 (예컨대, 좌측 가시광 카메라(114A)와 동시에) 캡처하기 위해 우측 템 플(110B) 또는 프레임에 연결된 우측 가시광 카메라(114B)를 더 포함한다. 도 1a-b에 도시되어 있지 않지 만, 사용자 인터페이스 시야 조절 시스템은 아이웨어 디바이스에 커플링되고 가시광 카메라들(114A-B)에 연결된 프로세서, 프로세서에 의해 액세스 가능한 메모리, 및 메모리, 예컨대 아이웨어 디 바이스 그 자체 또는 사용자 인터페이스 시야 조절 시스템의 다른 부분의 프로그래밍을 더 포함한다. 도 1a에는 도시되어 있지 않지만, 아이웨어 디바이스는 또한 머리 움직임 추적기(도 1b의 엘리먼 트) 또는 눈 움직임 추적기(도 2b의 엘리먼트)를 포함한다. 이하에서 더 상세히 제시되는 바와같이, 아이웨어 디바이스는 디스플레이된 이미지들의 시퀀스를 제시하기 위한 광학 조립체(180A-B)의 시-스루 이 미지 디스플레이들(180C-D), 및 디스플레이된 이미지들의 시퀀스를 제시하기 위해 광학 조립체(180A-B)의 이미지 디스플레이들(180C-D)을 제어하기 위해 광학 조립체(180A-B)의 시-스루 이미지 디스플레이들(180C-D)에커플링된 이미지 디스플레이 드라이버(도 9의 엘리먼트)를 더 포함한다. 아이웨어 디바이스는 이미 지 디스플레이 드라이버 및 메모리에 액세스하는 프로세서 및 메모리(934를 더 포함한다. 아이 웨어 디바이스는 메모리의 프로그래밍(도 9의 엘리먼트)을 더 포함한다. 프로세서에 의한 프로 그래밍의 실행은, 시-스루 이미지 디스플레이들(180C-D)을 통해, 디스플레이된 이미지들의 시퀀스의 초기 디스 플레이된 이미지를 제시하기 위한 기능들을 포함하는 기능들을 수행하도록 아이웨어 디바이스를 구성하며, 초기 디스플레이된 이미지는 초기 머리 방향 또는 초기 눈 응시 방향(도 5의 엘리먼트)에 대응하는 초기 시야를 갖는다. 프로세서에 의한 프로그래밍의 실행은 (i) 머리 움직임 추적기(도 1b의 엘리먼트)를 통해, 사람의 머리의 머리 움직임을 추적함으로써 또는 (ii) 눈 움직임 추적기(도 2b, 도 5의 엘리먼트)를 통해, 아이웨어 디바이스의 사용자의 눈의 눈 움직임을 추적함으로써 아이웨어 디바이스의 사용자의 움직임을 검 출하도록 아이웨어 디바이스를 추가로 구성한다. 프로세서에 의한 프로그래밍의 실행은 사용자의 검 출된 움직임에 기반하여 초기 디스플레이된 이미지의 초기 시야에 대한 시야 조절을 결정하도록 아이웨어 디바 이스를 추가로 구성한다. 시야 조절은 연속적인 머리 방향 또는 연속적인 눈 방향에 대응하는 연속적인 시야를 포함한다. 프로세서에 의한 프로그래밍의 실행은 시야 조절에 기반하여 디스플레이된 이미지들의 시퀀스의 연속적인 디스플레이된 이미지를 생성하도록 아이웨어 디바이스를 추가로 구성한다. 프로세서 에 의한 프로그래밍의 실행은 광학 조립체(180A-B)의 시-스루 이미지 디스플레이들(180C-D)을 통해 연속적 으로 디스플레이된 이미지들을 제시하도록 아이웨어 디바이스를 추가로 구성한다. 도 1b는 우측 가시광 카메라(114B), 머리 움직임 추적기 및 회로 보드를 도시하는 도 1a의 아이웨 어 디바이스의 템플의 상부 단면도이다. 좌측 가시광 카메라(114A)의 구성 및 배치는 연결부들 및 커플링 이 좌측 측방향 측면(170A)에 있다는 점을 제외하면 우측 가시광 카메라(114B)와 실질적으로 유사하다. 도시된 바와 같이, 아이웨어 디바이스는 우측 가시광 카메라(114B) 및 가요성 PCB(printed circuit board) 일 수 있는 회로 보드를 포함한다. 우측 힌지(126B)는 아이웨어 디바이스의 우측 템플(125B)에 우측 템플 (110B)을 연결한다. 일부 예들에서, 우측 가시광 카메라(114B)의 컴포넌트들, 가요성 PCB(140B), 또는 다른 전 기 커넥터들 또는 콘택들이 우측 템플(125B) 또는 우측 힌지(126B) 상에 로케이팅될 수 있다. 도시된 바와 같이, 아이웨어 디바이스는 예컨대 관성 측정 유닛(IMU)을 포함하는 머리 움직임 추 적기를 갖는다. 관성 측정 유닛은, 가속도계들 및 자이로스코프들, 때로는 또한 자력계들의 조합을 사용 하여 바디의 특정 힘, 각도 레이트, 및 때로는 바디 주위의 자기장을 측정 및 보고하는 전자 디바이스이다. 관 성 측정 유닛은 하나 이상의 가속도계들을 사용하여 선형 가속도를 그리고 하나 이상의 자이로스코프들을 사용 하여 회전 레이트를 검출함으로써 작동한다. 관성 측정 유닛들의 통상적인 구성들은 3개의 축들, 즉, 좌우 움 직임에 대한 수평 축(X), 상하 움직임에 대한 수직 축(Y), 및 위-아래 움직임에 대한 깊이 또는 거리 축(Z) 각 각에 대한 축마다 하나의 가속도계, 자이로 및 자력계를 포함한다. 가속도계는 중력 벡터를 검출한다. 자력계 는 배향 참조를 생성하는 나침반과 같이 자기장의 회전(예컨대, 남쪽, 북쪽 등을 향함)을 정의한다. 3개의 가 속도계들은 지면, 아이웨어 디바이스, 또는 아이웨어 디바이스를 착용한 사용자에 대해 정의될 수 있 는 앞서 정의된 수평, 수직 및 깊이 축을 따라 가속도를 검출한다. 아이웨어 디바이스는 머리 움직임 추적기를 통해 사용자 머리의 머리 움직임을 추적함으로써 아이웨어 디바이스의 사용자의 움직임을 검출한다. 머리 움직임은 이미지 디스플레이 상에 초기 디스플레 이된 이미지를 제시하는 동안 초기 머리 방향으로부터 수평축, 수직축 또는 이들의 조합에서 머리 방향의 변화 를 포함한다. 일례에서, 머리 움직임 추적기를 통해 사용자의 머리의 머리 움직임을 추적하는 것은, 관성 측정 유닛을 통해, 수평축(예컨대, X-축), 수직축(예컨대, Y-축) 또는 이들의 조합(예컨대, 가로 또는 대 각선 움직임)에서 초기 머리 방향을 측정하는 것을 포함한다. 머리 움직임 추적기를 통해 사용자 머리의 머리 움직임을 추적하는 것은 초기 디스플레이된 이미지의 제시 동안 관성 측정 유닛을 통해 수평축, 수직 축 또는 이들의 조합에서 연속적인 머리 방향을 측정하는 것을 더 포함한다. 머리 움직임 추적기를 통해 사용자의 머리의 머리 움직임을 추적하는 것은 초기 머리 방향 및 연 속적인 머리 방향 둘 모두에 기반하여 머리 방향의 변화를 결정하는 것을 더 포함한다. 아이웨어 디바이스 의 사용자의 움직임을 검출하는 것은 머리 움직임 추적기를 통해 사용자의 머리의 머리 움직임을 추 적하는 것에 응답하여, 머리 방향의 변동이 수평축에서, 수직축에서 또는 이들의 조합에서 편차 각도 임계치를 초과함을 결정하는 것을 더 포함한다. 편차 각도 임계치는 약 3° 내지 10°이다. 본원에서 사용되는 바와 같 이, 각도를 언급할 때 \"약\"이라는 용어는 명시된 양으로부터 ±10%를 의미한다. 수평축을 따른 변동은 예컨대 3차원 객체의 가시성을 숨기거나, 숨김을 해제하거나 그렇지 않으면 조절 함으로써 시야 안으로 그리고 밖으로 3차원 객체들, 이를테면 캐릭터들, 피트모지(Bitmoji)들, 애플리케이션 아 이콘들 등을 슬라이드한다. 예컨대 사용자가 위쪽을 바라볼 때 수직축을 따른 변동은 일례에서 날씨 정보, 하 루 중 시간, 날짜, 캘린더 약속들 등을 디스플레이한다. 다른 예로, 사용자가 세로축에서 아래쪽을 바라볼 때, 아이웨어 디바이스는 파워-다운될 수 있다. 우측 템플(110B)은 템플 바디 및 템플 캡을 포함하며, 템플 캡은 도 1b의 단면에서 생략된다. 우 측 템플(110B) 내부에는 우측 가시광 카메라(114B)에 대한 제어기 회로들, 마이크로폰(들), 스피커 (들), (예컨대, Bluetooth™를 통한 무선 근거리 네트워크 통신을 위한) 저전력 무선 회로부, (예컨대, WiFi를 통한 무선 로컬 영역 네트워크 통신을 위한) 고속 무선 회로부를 포함하는 다양한 상호연결 회로 보드들, 예컨대, PCB들 또는 가요성 PCB들이 배치된다. 우측 가시광 카메라(114B)는 가요성 PCB에 커플링되거나 가요성 PCB 상에 배치되고, 우측 템 플(110B)에 형성된 개구(들)를 통해 조준되는 가시광 카메라 커버 렌즈에 의해 커버된다. 일부 예들에서, 우측 템플(110B)에 연결된 프레임은 가시광 카메라 커버 렌즈를 위한 개구(들)를 포함한다. 프레임은 사 용자의 눈으로부터 바깥 쪽을 향하도록 구성된 전방을 향하는 측면을 포함한다. 가시광 카메라 커버 렌즈를 위 한 개구는 전방을 향하는 측면 상에 그리고 이를 통해 형성된다. 이 예에서, 우측 가시광 카메라(114B)는 아이 웨어 디바이스의 사용자의 우측 눈의 시선 또는 시각을 갖는 외향 커버리지 각도(111B)를 갖는다. 가시광 카메라 커버 렌즈는 또한 우측 템플(110B)의 외향 표면에 접착될 수 있고, 여기서 커버리지의 외향 각도를 갖지 만 상이한 외부 방향을 향하는 개구가 형성된다. 커플링은 또한 개재 컴포넌트들을 통해 간접적일 수 있다. 좌측(제1) 가시광 카메라(114A)는 좌측 광학 조립체(180A)의 좌측 시-스루 이미지 디스플레이(180C)에 연결되어 제1 연속 디스플레이된 이미지의 제1 배경 장면을 생성한다. 우측(제2) 가시광 카메라(114B)는 우측 광학 조립체(180B)의 우측 시-스루 이미지 디스플레이(180D)에 연결되어 제2 연속 디스플레이된 이미지의 제2 배경 장면을 생성한다. 제1 배경 장면 및 제2 배경 장면은 연속 디스플레이된 이미지의 3차원 관찰가능 영역을 제시하기 위해 부분적으로 중첩한다. 가요성 PCB(140B)는 우측 템플(110B) 내부에 배치되고, 우측 템플(110B)에 하우징된 하나 이상의 다른 컴포넌트들에 커플링된다. 우측 템플(110B)의 회로 보드들 상에 형성된 것으로 도시되었지만, 우측 가시광 카 메라(114B)는 좌측 템플(110A), 템플들(125A-B) 또는 프레임의 회로 보드들 상에 형성될 수 있다. 도 2a는 아이웨어 디바이스의 착용자/사용자의 눈 포지션 및 응시 방향을 결정하기 위해 시스템에 서 사용하기 위한 프레임 상의 눈 스캐너를 포함하는 아이웨어 디바이스의 예시적인 하드웨어 구성의 배면도이다. 도 2a에 도시된 바와 같이, 아이웨어 디바이스는 사용자가 착용하도록 구성된 형태를 가지며, 이는 도 2a의 예에서 안경이다. 아이웨어 디바이스는 다른 형태들을 취할 수 있고, 다른 타입들 의 프레임워크들, 예컨대 헤드기어, 헤드셋 또는 헬멧을 포함할 수 있다. 안경 예에서, 아이웨어 디바이스는 사용자의 코에 적응된 브리지를 통해 우측 림(107B)에 연 결된 좌측 림(107A)을 포함하는 프레임을 포함한다. 좌측 및 우측 림들(107A-B)은 투명한 렌즈와 같은 개 개의 광학 엘리먼트(180A-B) 및 도 4b에 도시된 바와같이 이들 사이에 개재된 시-스루 디스플레이들(180C-D)을 홀딩하는 개개의 애퍼처들(175A-B)을 포함한다. 본원에 사용된 바와 같이, 렌즈라는 용어는 광이 수렴/발산하 게 하는 또는 수렴/발산이 거의 또는 전혀 없게 하는 만곡된 및 평탄한 표면들을 갖는 유리 또는 플라스틱의 투 명한 또는 반투명한 피스들을 커버하는 것으로 의미된다. 2개의 광학 엘리먼트들(180A-B)을 갖는 것으로 도시되었지만, 아이웨어 디바이스는 아이웨어 디바 이스의 애플리케이션 또는 의도된 사용자에 따라 단일 광학 엘리먼트와 같은 다른 어레인지먼트들을 포함 할 수 있다. 추가로 도시된 바와 같이, 아이웨어 디바이스는 프레임의 좌측 측방향 측면(170A)에 인 접한 좌측 템플(110A) 및 프레임의 우측 측방향 측면(170B)에 인접한 우측 템플(110B)을 포함한다. 템플 들(110A-B)은 (예시된 바와 같이) 개개의 측면들(170A-B) 상에서 프레임에 통합되거나, 또는 개개의 측면 들(170A-B) 상에서 프레임에 부착된 별개의 컴포넌트들로서 구현될 수 있다. 대안적으로, 템플들(110A- B)은 프레임에 부착된 템플들(미도시)에 통합될 수 있다. 도 2a의 예에서, 눈 스캐너는 적외선 방출기 및 적외선 카메라를 포함한다. 가시 광 카메라들은 전형적으로 적외선 광 검출을 차단하는 청색 광 필터를 포함하고, 일례에서, 적외선 카메라는 청색 필터가 제거된 가시광 카메라, 예컨대, 저-해상도 VGA(video graphic array) 카메라(예컨대, 총 0.3 메가픽셀들의 경우 640 x 480 픽셀들)이다. 적외선 방출기 및 적외선 카메라는 프레임 상에 코-로 케이팅되는데, 예컨대, 둘 모두는 좌측 림(107A)의 상부 부분에 연결되는 것으로 도시된다. 프레임 또는 좌측 및 우측 템플들(110A-B) 중 하나 이상은 적외선 방출기 및 적외선 카메라를 포함하는 회로 보드 (미도시)를 포함한다. 적외선 방출기 및 적외선 카메라는 예컨대, 납땜에 의해 회로 보드에 연결될 수 있다. 적외선 방출기 및 적외선 카메라가 둘 모두가 우측 림(107B) 상에 있거나 프레임 상의 상이한 로케이션들에 있는 배열들, 예컨대 적외선 방출기가 좌측 림(107A) 상에 있고 적외선 카메라 가 우측 림(107B) 상에 있는 배열들을 포함하여 적외선 방출기 및 적외선 카메라의 다른 배열들이 구 현될 수 있다. 다른 예에서, 적외선 방출기는 프레임 상에 있고 적외선 카메라는 템플들(110A- B) 중 하나 상에 있거나 또는 그 반대의 경우도 마찬가지이다. 적외선 방출기는 본질적으로 프레임, 좌측 템플(110A) 또는 우측 템플(110B) 상의 어디에나 연결되어 일정 패턴의 적외선 광을 방출할 수 있다. 유 사하게, 적외선 카메라는 본질적으로 프레임, 좌측 템플(110A) 또는 우측 템플(110B) 상의 어디에서 나 연결되어, 적외선 광의 방출 패턴의 적어도 하나의 반사 변형을 캡처할 수 있다. 적외선 방출기 및 적외선 카메라는 개개의 눈 포지션 및 응시 방향을 식별하기 위해 눈의 부 분적 또는 전체 시야를 갖는 사용자의 눈을 향하여 안쪽을 향하도록 배열된다. 예컨대, 적외선 방출기 및 적외선 카메라는 눈의 바로 전방에, 프레임의 상부 부분에 또는 프레임의 양 단부의 템플들 (110A-B)에 포지셔닝된다. 도 2b는 다른 아이웨어 디바이스의 예시적인 하드웨어 구성의 배면도이다. 이러한 예시적인 구성 에서, 아이웨어 디바이스는 우측 템플(210B)에서 눈 스캐너를 포함하는 것으로 묘사된다. 도시된 바 와 같이, 적외선 방출기 및 적외선 카메라는 우측 템플(210B) 상에 코-로케이팅된다. 눈 스캐너 또는 눈 스캐너의 하나 이상의 컴포넌트들은 좌측 템플(210A) 상에 그리고 아이웨어 디바이스 의 다른 로케이션들, 예컨대 프레임 상에 로케이팅될 수 있다는 것이 이해되어야 한다. 적외선 방출기 및 적외선 카메라는 도 2a의 적외선 방출기 및 적외선 카메라와 같으나, 눈 스캐너는 도 2a에 서 이전에 설명된 것과 상이한 광 파장들에 민감하도록 변경될 수 있다. 도 2a와 유사하게, 아이웨어 디바이스는 브리지를 통해 우측 림(107B)에 연결되는 좌측 림 (107A)을 포함하는 프레임을 포함하며; 좌측 및 우측 림들(107A-B)은 시-스루 디스플레이(180C-D)를 포함 하는 개개의 광학 엘리먼트들(180A-B)을 홀딩하는 개개의 애퍼처들을 포함한다. 도 2c 및 도 2d는 2개의 상이한 타입들의 시-스루 이미지 디스플레이들(180C-D)을 포함하는 아이웨어 디바이스의 예시적인 하드웨어 구성들의 배면도들이다. 일례에서, 이들 광학 조립체(180A-B)의 시-스루 이미지 디스플레이들(180C-D)은 통합 이미지 디스플레이를 포함한다. 도 2c에 도시된 바와 같이, 광학 조립체 들(180A-B)은 LCD(liquid crystal display), OLED(organic light-emitting diode) 디스플레이, 도파관 디스플 레이 또는 임의의 다른 그러한 디스플레이와 같은 임의의 적합한 타입의 적합한 디스플레이 매트릭스(180C-D)를 포함한다. 광학 조립체(180A-B)는 또한 렌즈들, 광학 코팅들, 프리즘들, 미러들, 도파관들, 광학 스트립들, 및 다른 광학 컴포넌트들을 임의의 조합으로 포함할 수 있는 광학 층 또는 층들을 포함한다. 광학 층들 (176A-N)은, 적합한 크기 및 구성을 갖고 디스플레이 매트릭스로부터 광을 수신하기 위한 제1 표면 및 사용자의 눈에 광을 방출하기 위한 제2 표면을 포함하는 프리즘을 포함할 수 있다. 광학 층들(176A-N)의 프리즘은 좌측 및 우측 림들(107A-B)에 형성된 개개의 애퍼처들(175A-B)의 전부 또는 적어도 일부분에 걸쳐 연장되어, 사용자 의 눈이 대응하는 좌측 및 우측 림들(107A-B)을 보고 있을 때 사용자가 프리즘의 제2 표면을 보도록 허용한다. 광학 층들(176A-N)의 프리즘의 제1 표면은 프레임으로부터 위를 향하고, 디스플레이 매트릭스는 디스플레 이 매트릭스에 의해 방출된 광자들 및 광이 제1 표면에 충돌하도록 프리즘 위에 놓인다. 프리즘은 광이 프리즘 내에서 굴절되고 광학 층들(176A-N)의 프리즘의 제2 표면에 의해 사용자의 눈을 향해 지향되도록 하는 크기를 갖고 형상화된다. 이와 관련하여, 광학 층들(176A-N)의 프리즘의 제2 표면은 눈의 중심을 향해 광을 지향하도 록 볼록할 수 있다. 프리즘은 선택적으로 시-스루 이미지 디스플레이들(180C-D)에 의해 투사된 이미지를 확대 하도록 하는 크기를 갖고 형상화될 수 있고, 광은 프리즘을 통해 이동하여 제2 표면으로부터 보이는 이미지는 시-스루 이미지 디스플레이들(180C-D)로부터 방출된 이미지보다 하나 이상의 차원들에서 더 크다. 다른 예에서, 광학 조립체(180A-B)의 시-스루 이미지 디스플레이들(180C-D)은 도 2d에 도시된 바와같은 투사 이미지 디스플레이를 포함한다. 광학 조립체(180A-B)는 스캐닝 미러 또는 검류계를 사용하는 3색 레이저 프로젝터인 레이저 프로젝터를 포함한다. 동작 동안, 레이저 프로젝터와 같은 광원은 아이웨어 디바이스의 템플들(125A-B) 중 하나에 또는 그 위에 배치된다. 광학 조립체(180A-B)는 광학 조립체(180A-B)의 렌즈의 폭을 가로질러 또는 렌즈의 전면과 후면 사이의 렌즈의 깊이를 가로질러 이격된 하나 이상의 광학 스트 립들(155A-N)을 포함한다. 레이저 프로젝터에 의해 투사된 광자들이 광학 조립체(180A-B)의 렌즈를 가로질러 이동함에 따라, 광자들은 광학 스트립들(155A-N)과 만난다. 특정 광자가 특정 광학 스트립을 만날 때, 그 광자는 사용자의 눈 을 향해 재지향되거나 다음 광학 스트립으로 전달된다. 레이저 프로젝터의 변조 및 광학 스트립들의 변조 의 조합은 특정 광자들 또는 광 빔들을 제어할 수 있다. 일례에서, 프로세서는 기계적, 음향적 또는 전자기 신 호들을 개시함으로써 광학 스트립들(155A-N)을 제어한다. 2개의 광학 조립체들(180A-B)을 갖는 것으로 도시되 었지만, 아이웨어 디바이스는 단일의 또는 3개의 광학 조립체들과 같은 다른 배열들을 포함할 수 있거나, 또는 광학 조립체(180A-B)는 아이웨어 디바이스의 의도된 사용자 또는 애플리케이션에 따라 배열된 상이한 배열을 가질 수 있다. 도 2c-d에 추가로 도시된 바와 같이, 아이웨어 디바이스는 프레임의 좌측 측방향 측면(170 A)에 인접한 좌측 템플(110A) 및 프레임의 우측 측방향 측면(170B)에 인접한 우측 템플(110B)을 포함한다. 템플들(110A-B)은 (예시된 바와 같이) 개개의 측방향 측면들(170A-B) 상에서 프레임에 통합되거나, 또는 개개의 측면들(170A-B) 상에서 프레임에 부착된 별개의 컴포넌트들로서 구현될 수 있다. 대안적으로, 템 플들(110A-B)은 프레임에 부착된 템플들(125A-B)에 통합될 수 있다. 일례에서, 시-스루 이미지 디스플레이들은 제1 시-스루 이미지 디스플레이(180C) 및 제2 시-스루 이미 지 디스플레이(180D)를 포함한다. 아이웨어 디바이스는 개개의 제1 및 제2 광학 조립체(180A-B)를 홀딩하 는 제1 및 제2 애퍼처들(175A-B)을 포함한다. 제1 광학 조립체(180A)는 제1 시-스루 이미지 디스플레이(180C) (예컨대, 도 2c의 디스플레이 매트릭스 또는 광학 스트립들(155A-N') 및 프로젝터(150A))를 포함한다. 제2 광 학 조립체(180B)는 제2 시-스루 이미지 디스플레이(180D)(예컨대, 도 2c의 디스플레이 매트릭스 또는 광학 스트 립들(155A-N\") 및 프로젝터(150B))를 포함한다. 연속적으로 디스플레이되는 이미지의 연속적인 시야는 수평, 수직 또는 대각선 방향으로 측정된 약 15° 내지 30°, 보다 구체적으로는 24°의 시야각을 포함한다. 연속적 인 시야를 갖는 연속적으로 디스플레이되는 이미지는 제1 및 제2 이미지 디스플레이들 상에 제시된 2개의 디스 플레이된 이미지들을 함께 스티칭함으로써 볼 수 있는 결합된 3차원 관찰 가능 영역을 나타낸다. 본원에서 사용되는 바와 같이, \"시야각\"은 광학 조립체(180A-B)의 좌측 및 우측 이미지 디스플레이들 (180C-D) 각각 상에 제시된 디스플레이된 이미지들과 연관된 시야각 범위를 설명한다. “커버리지 각도”는 가 시광 카메라들(114A-B) 또는 적외선 카메라의 렌즈가 이미징할 수 있는 각도 범위를 설명한다. 전형적으 로, 렌즈에 의해 생성된 이미지 서클은 가능한 경우에 약간의 비네팅(즉, 이미지 중앙에 비해 주변으로 갈수록 이미지의 밝기 또는 채도 감소)을 포함하여 필름 또는 센서를 완전히 커버할 수 있을 만큼 충분히 크다. 렌즈 의 커버리지 각도가 센서를 충족시키지 않는 경우, 이미지 서클은 가시적일 것이고, 통상적으로 에지쪽에서 강 한 비네팅을 가지며, 뷰의 유효 각도는 커버리지 각도로 제한될 것이다. \"시야\"는 아이웨어 디바이스의 사용자가 광학 조립체(180A-B)의 좌측 및 우측 이미지 디스플레이들(180C-D) 상에 제시된 디스플레이된 이미지 들을 통해 자신의 눈을 통해 볼 수 있는 관찰 가능한 영역의 필드를 설명하는 것으로 의도된다. 광학 조립체 (180A-B)의 이미지 디스플레이(180C)는 15° 내지 30°, 예컨대, 24°의 커버리지 각도를 갖는 시야를 가질 수 있으며, 480 x 480 픽셀들의 해상도를 가질 수 있다. 도 3은 도 2a의 아이웨어 디바이스의 후면 사시도를 도시한다. 아이웨어 디바이스는 적외선 방출 기, 적외선 카메라, 프레임 전면, 프레임 후면 및 회로 보드를 포함한다. 아이웨어 디바이스의 프레임의 좌측 림의 상부 부분이 프레임 전면 및 프레임 후면을 포함한다는 것을 도 3에서 알 수 있다. 적외선 방출기를 위한 개구는 프레임 후면 상에 형성된다. 프레임의 좌측 림의 상부 중앙 부분의 원형 단면에 도시된 바와 같이, 가요성 PCB인 회로 보드 는 프레임 전면 및 프레임 후면 사이에 개재된다. 또한 좌측 힌지(126A)를 통해 좌측 템플(325A)에 좌측 템플(110A)을 부착하는 것이 더 상세히 도시된다. 일부 예들에서, 적외선 방출기, 가요성 PCB, 또는 다른 전기 커넥터들 또는 콘택들을 포함하는 눈 움직임 추적기의 컴포넌트들은 좌측 템플(325A) 또는 좌측 힌지(126A) 상에 로케이팅될 수 있다. 도 4a는 도 3의 아이웨어 디바이스의 원형 단면에 대응하는 프레임 및 적외선 방출기를 통한 단면도이다. 아이웨어 디바이스의 다수의 층들이 도 4a의 단면에 예시되고, 도시된 바와 같이, 프레임은 프레임 전면 및 프레임 후면을 포함한다. 가요성 PCB는 프레임 전면 상에 배치되고 프레임 후면에 연결된다. 적외선 방출기는 가요성 PCB 상에 배치되고 적외선 방출기 커버 렌즈 에 의해 커버된다. 예컨대, 적외선 방출기는 가요성 PCB의 후면으로 리플로우된다. 리플로우 는, 가요성 PCB가 2개의 컴포넌트들을 연결하기 위해 솔더 페이스트를 용융시키는 제어된 열을 겪게 함으 로써 가요성 PCB의 후면 상에 형성된 접촉 패드(들)에 적외선 방출기를 부착한다. 일례에서, 리플로 우는 가요성 PCB 상에 적외선 방출기를 표면 장착하고 2개의 컴포넌트들을 전기적으로 연결하기 위 해 사용된다. 그러나, 예컨대, 상호연결부들을 통해 적외선 방출기로부터 가요성 PCB에 리드들을 연 결하기 위해 스루-홀들이 사용될 수 있음을 이해해야 한다. 프레임 전면은 적외선 방출기 커버 렌즈를 위한 적외선 방출기 개구를 포함한다. 적외 선 방출기 개구는 사용자의 눈을 향해 안쪽을 향하도록 구성되는 프레임 후면의 후향 측 상에 형성된 다. 이 예에서, 가요성 PCB는 가요성 PCB 접착제를 통해 프레임 전면에 연결될 수 있다. 적외 선 방출기 커버 렌즈는 적외선 방출기 커버 렌즈 접착제를 통해 프레임 후면에 연결될 수 있다. 커플링은 또한 개재 컴포넌트들을 통해 간접적일 수 있다. 일례에서 도파관들을 포함하는 디스플레이들(180C 및 180D)은 아이웨어의 중요한 컴포넌트들이며, 이들은 기계적으로 상대적으로 약하다. 도파관의 하나의 예시적인 재료는 유리이다. 절단 공정은 도파관의 에 지들을 따라 강도를 감소(대략 약 70% 감소)시킬 수 있다. 도 4b 및 도 4c에 예시된 바와같이, 디스플레이들(180C 및 180D)의 도파관들은 다수의 층들을 갖는 도 파관 스택으로서 형성될 수 있다. 도 4b는 도 2a의 라인 4를 따라 취해진 하향 단면도이며, 도 4c는 도 4b의 도파관 스택의 확대도를 예시한다. 도파관 스택의 층들을 본딩하는 한 가지 방법은 도파관 스 택의 층들의 에지들에서 넓은 접착제를 사용하는 것이며, 이는 프레임의 굽힘 동안 및 자유 낙 하 동안, 이를테면 바닥으로 떨어져 충격을 받을 때 도파관 스택 에지에서 응력들을 생성한다. 도파관 스택 은 전형적으로 모바일 폰들/태블릿들의 유리 커버들에서 볼 수 있는 바와 같이 화학적으로 강화되지 않은 2개의 유리 기판들(468 및 470)을 포함할 수 있다. 더욱이, 절단 프로세스는 기본 재료 강도에 비해 도파관 에 지 강도를 크게 (전형적으로 약 1/3) 감소시킨다. 이는 비교적 \"불량한\" 낙하 테스트 성능을 초래하는데, 여기 서 유리 기판 도파관들은 매우 낮은 낙하 높이들에서 파손되어 제품 신뢰성 요건들을 충족시키기 어렵게 한다. 도파관 스택은 도파관 스택을 형성하는 3개의 층들을 가질 수 있으며, 3개의 층들은 이미지 디스 플레이 층을 둘러싸서 샌드위칭하는 유리 기판들(468 및 470)을 포함하며 이들 사이에 도파관이 삽입되어 있다. 층들은 2mm 폭과 0.05mm 내지 0.15mm 두께의 접착제를 사용하여 자신들의 에지들에서 본딩된다. 그 다음, 도파관 스택은 2mm 폭과 0.25mm 두께의 접착제를 사용하여 자신의 에지에서 프레임에 본딩 된다. 도파관 스택의 에지에서 끝나는 넓은 접착제는 구조 분석에서 도파관 스택을 고정 경계 구조 로 만들고, 여기서 도파관 스택의 응력들은 도 4d의 476에 도시된 바와 같이 일반적으로 높다. 도 4e, 도 4f 및 도 4g를 참조하면, 본 개시내용은 본딩된 도파관 스택 및 도파관 에지에서의 응 력을 피하거나 최소화하는 방법을 제공한다. 접착제의 폭(W)은 도 4c의 예의 접착제에 비해 감소되며, 접 착제 두께(T)는 증가하며, 접착제의 로케이션은 도파관 에지 내부에서 양호하게 끝나는 거리(OFF)로 도파관 에지로부터 안쪽으로 오프셋되어, 도 4d에서 478에 도시된 바와 같은 구조 분석에서 도파관 스택 을 단순한 지지 구조로 만든다. 접착제의 오프셋 거리(OFF)로 인해, 단순히 지지된 로케이션들(자유 단부들)에서, 굽힘 모멘트가 없으므로 굽힘 응력이 없으며, 그 결과 굽힘 동안 도파관 에지 응력이 없게 된다. 도시된 바와 같이, 이러한 예에서 도파관 스택을 포함하는 도파관 디스플레이 조립체(180D)는 도 파관, 및 도파관에 접착식으로 고정되고 도파관을 샌드위칭하는 유리 기판들(192 및 194)을 포 함하는 이미지 디스플레이 층을 포함한다. 광학적으로 투명한 유리 기판들(192 및 194)의 각각은 개개의 접착 제에 의해 도파관으로부터 이격되며, 이에 따라 도파관과 유리 기판들(192 및 194) 각각 사이에 에어 갭(air gap)들(196 및 198)을 생성하여 필요한 광학 스택-업을 달성하고, 신뢰성 목적들을 위해 도파관 상에 포함될 수 있는 광학 나노-구조 격자들을 캡슐화한다. 도 4f에 도시된 바와같이, 접착제 오프셋 거리(OFF)는 도파관 스택의 에지들에서의 응력을 감소시 키거나 최소화하기 위해 도파관의 두께의 적어도 2배이어서, 도 4d의 478로 예시된 바와 같은 단순 지지 구조를 형성한다. 도 4g에 도시된 바와 같이, 접착제는 도파관 스택의 에지로부터 거리(OFF)로 안쪽 으로 오프셋된 폭(W)을 갖는다. 예컨대, 도파관의 두께가 3mm인 경우, 접착제 폭(W)은 1mm일 수 있고, 접 착제 두께는 0.5mm일 수 있으며, 접착 오프셋(OFF)은 6mm일 수 있다. 도 4h는 프레임에 고정된 도파관 스택을 예시하며, 여기서 도파관 스택과 프레임 사이의 접착제는 도파관 스택의 에지로부터 오프셋 거리(OFF)에 있다. 도 4i는 도파관 스택의 에지들에서의 응력을 예시하고, 도 4c의 예에 대해 132Mpa의 최대 응력을 예시한다. 도 4j는 도 4c의 예와 비교하여 약 45%의 응력 감소인, 73Mpa의 감소 응력을 예시하는 도파관 스택 의 에지들에서의 응력을 예시한다. 예에서, 프로세서는, 눈 추적기를 활용하여, 도 5에 도시된 바와 같이 착용자의 눈의 눈 응시 방향을 결정하고 그리고 도 6에 도시된 바와 같이 아이박스 내의 착용자의 눈의 눈 포지션 을 결정한다. 눈 추적기는 눈으로부터의 적외선 광의 반사 변형들의 캡처된 이미지에 대해 적 외선 광 조명(예컨대, 근적외선, 단파장 적외선, 중파장 적외선, 장파장 적외선 또는 원적외선)을 사용하여 눈 의 동공의 응시 방향을 결정하고 또한 시-스루 디스플레이(180D)에 대한 눈 포지션을 결정 하는 스캐너이다. 도 7은 카메라들로 가시광을 캡처하는 예를 도시한다. 가시광은 좌측 가시광 카메라 시야(111A)를 갖 는 좌측 가시광 카메라(114A)에 의해 좌측 원시 이미지(758A)로서 캡처된다. 가시광은 우측 가시광 카메라 시 야(111B)를 갖는 우측 가시광 카메라(114B)에 의해 우측 원시 이미지(758B)로서 캡처된다. 좌측 원시 이미지 (758A) 및 우측 원시 이미지(758B)의 프로세싱에 기반하여, 이미지로서 이후에 지칭되는 3차원 장면의 3차원 깊 이 맵이 프로세서에 의해 생성된다. 도 8은 도파관 스택을 생성하고 또한 도파관 스택을 아이웨어의 프레임에 부착하 는 방법을 예시하는 흐름도이다. 블록에서, 접착제의 제1 연속 비드는 이를테면 디스펜싱 머신에 의해 도파관의 에지로 부터 오프셋 거리(OFF)로 도파관에 적용된다. 접착제는 도 4g에 대해 설명되고 도시된 바와 같이 폭 (W) 및 두께(T)를 갖는다. 블록에서, 유리 기판은 유리 기판이 도파관에 단단히 부착되도록 배치 도구에 의 해 도파관에 부착되며, 이에 따라 유리 기판은 도 4f에 도시된 바와같이 에어 갭에 의해 도파관 으로부터 이격된다. 에어 갭은 필요한 광학 스택-업을 달성하고, 신뢰성 목적들을 위해 도파관 상에 포함될 수 있는 광학 나노-구조 격자들을 캡슐화한다. 블록에서, 접착제의 제2 연속 비드는 접착제의 제1 비드를 갖는 도파관의 양측들 상에서 디스펜싱 머신에 의해 도파관의 에지로부터 오프셋 거리(OFF)에서 도파관에 적용된다. 이러 한 접착제는 또한 도 4g와 관련하여 설명되고 도시된 바와 같이 폭(W) 및 두께(T)를 가지며, 이에 따라 접 착제의 제1 및 제2 비드들은 서로 수직으로 정렬된다. 블록에서, 유리 기판은 유리 기판이 도파관에 부착되도록 배치 머신 의해 도파관 에 부착되며, 이에 따라 유리 기판은 도 4f에 도시된 바와같이 에어 갭에 의해 도파관으로 부터 이격된다. 에어 갭은 필요한 광학 스택-업을 달성하고, 신뢰성 목적들을 위해 도파관 상에 포 함될 수 있는 광학 나노-구조 격자들을 캡슐화한다. 이는 도파관 스택의 조립을 완료한다. 블록에서, 도파관 스택은 접착제의 비드에 의해 프레임에 부착된다. 도 4f에 도 시된 바와 같이, 유리 기판은 프레임의 내부 에지에 인접하게 포지셔닝된다. 도 9는 아이웨어(100 및 100)에 배치된 예시적인 전자 컴포넌트들을 포함하는 고-레벨 기능 블록도를 도시한다. 예시된 전자 컴포넌트들은 프로세서, 메모리 및 시-스루 이미지 디스플레이(180C 및 180D)를 포함한다. 메모리는 아이웨어(100/100)의 기능을 구현하기 위해 프로세서가 실행하는 명령들을 포함하 며, 이 명령들은 프로세서가 이미지를 제어하는 명령들을 포함한다. 프로세서는 배터리(미도시)로부터 전력을 수신하고 메모리에 저장되거나 또는 온-칩으로 프로세서와 통합된 명령 들을 실행하여, 아이웨어(100/100)의 기능을 수행하고 무선 연결들을 통한 외부 디바이스들과 통신을 수행한다. 사용자 인터페이스 조절 시스템은 눈 움직임 추적기(예컨대, 도 2b에서 적외선 방출기 및 적외선 카메라로서 도시됨)를 갖는 아이웨어 디바이스인 웨어러블 디바이스를 포함한다. 사용자 인터페이스 조절 시스템은 또한 다양한 네트워크들을 통해 연결된 모바일 디바이스 및 서버 시스템 을 포함한다. 모바일 디바이스는 스마트폰, 태블릿, 랩톱 컴퓨터, 액세스 포인트, 또는 저전력 무선 연결 및 고속 무선 연결 둘 모두를 사용하여 아이웨어 디바이스와 연결할 수 있는 임의의 다른 그러한 디바이스일 수 있다. 모바일 디바이스는 서버 시스템 및 네트워크에 연결된다. 네트워 크는 유선 및 무선 연결들의 임의의 조합을 포함할 수 있다. 아이웨어 디바이스는 적어도 2개의 가시광 카메라들(114A-B)(하나는 좌측 측방향 측면(170A)과 연 관되고 하나는 우측 측방향 측면(170B)과 연관됨)을 포함할 수 있다. 아이웨어 디바이스는 광학 조립체 (180A-B)의 2개의 시-스루 이미지 디스플레이들(180C-D)(하나는 좌측 측방향 측면(170A)과 연관되고 하나는 우 측 측방향 측면(170B)과 연관됨)를 더 포함한다. 아이웨어 디바이스는 또한 이미지 디스플레이 드라이버 , 이미지 프로세서, 저전력 회로부 및 고속 회로부를 포함한다. 아이웨어 디바이스 에 대해 도 9에 도시된 컴포넌트들은 템플들에서, 하나 이상의 회로 보드들, 예컨대, PCB 또는 가요성 PCB 상에 로케이팅된다. 대안적으로 또는 추가적으로, 도시된 컴포넌트들은 아이웨어 디바이스의 템플들, 프레임들, 힌지들 또는 브리지에 로케이팅될 수 있다. 좌측 및 우측 가시광 카메라들(114A-B)은 디지털 카메라 엘리먼트들, 예컨대, CMOS(complementary metal-oxide-semiconductor) 이미지 센서, 전하 결합 디바이스, 렌즈, 또는 미지의 객체들을 갖는 장면들의 이미지들을 포함하는 데이터를 캡처하기 위해 사용될 수 있는 임의 의 다른 개개의 가시적 또는 광 캡처 엘리먼트들을 포함할 수 있다. 눈 움직임 추적 프로그래밍은 사용자 인터페이스 시야 조절 명령들을 구현하며, 이 명령들은 아이 웨어 디바이스가 눈 움직임 추적기를 통해 아이웨어 디바이스의 사용자의 눈의 눈 움직임을 추 적하게 하는 명령을 포함한다. 다른 구현된 명령들(기능들)은 아이웨어 디바이스가 연속적인 눈 방향에 대응하는 사용자의 검출된 눈 움직임에 기반하여 초기 디스플레이된 이미지의 초기 시야에 대한 시야 조절을 결 정하게 한다. 추가 구현 명령들은 시야 조절에 기반하여 일련의 디스플레이된 이미지들의 연속 디스플레이된 이미지를 생성한다. 연속적인 디스플레이된 이미지는 사용자 인터페이스를 통해 사용자에게 가시적인 출력으로 서 생성된다. 이러한 가시적 출력은 광학 조립체(180A-B)의 시-스루 이미지 디스플레이들(180C-D) 상에서 나타 나며, 이는 이미지 디스플레이 드라이버에 의해 구동되어, 초기 시야를 갖는 초기 디스플레이된 이미지 및 연속적인 시야를 갖는 연속적인 디스플레이된 이미지를 포함하는 일련의 디스플레이된 이미지들을 제시한다. 도 9에 도시된 바와 같이, 고속 회로부는 고속 프로세서, 메모리 및 고속 무선 회로부 를 포함한다. 예에서, 이미지 디스플레이 드라이버는 도 8a에 도시된 디스플레이의 미러들 을 포함하여, 광학 조립체(180A-B)의 좌측 및 우측 이미지 디스플레이들(180C-D)을 구동하기 위해 고속 회 로부에 커플링되고 고속 프로세서에 의해 동작된다. 이미지 디스플레이 드라이버는 가상 이미 지를 생성하기 위해 시-스루 디스플레이의 각각의 미러를 선택적으로 제어한다. 고속 프로세서(93 2)는 아이웨어 디바이스에 필요한 임의의 일반적인 컴퓨팅 시스템의 동작 및 고속 통신들을 관리할 수 있 는 임의의 프로세서일 수 있다. 고속 프로세서는 고속 무선 회로부를 사용하여 WLAN(wireless local area network)으로의 고속 무선 연결부 상에서 고속 데이터 전송들을 관리하는 데 필요한 프로세싱 자원들 을 포함한다. 특정 예들에서, 고속 프로세서는 오퍼레이팅 시스템, 이를테면 LINUX 오퍼레이팅 시스템, 또는 아이웨어 디바이스의 다른 그러한 오퍼레이팅 시스템을 실행하고, 오퍼레이팅 시스템은 실행을 위해 메모리에 저장된다. 임의의 다른 책임들에 추가로, 아이웨어 디바이스를 위한 소프트웨어 아키텍처 를 실행하는 고속 프로세서는 고속 무선 회로부로 데이터 전송들을 관리하는데 사용된다. 특정 예들 에서, 고속 무선 회로부는 본원에서 또한 Wi-Fi로 지칭되는 IEEE(Institute of Electrical and Electronic Engineers) 802.11 통신 표준들을 구현하도록 구성된다. 다른 예들에서, 다른 고속 통신 표준들은 고속 무선 회로부에 의해 구현될 수 있다. 아이웨어 디바이스의 저전력 무선 회로부 및 고속 무선 회로부는 단거리 트랜시버들 (Bluetooth™) 및 무선 와이드, 로컬 또는 광역 네트워크 트랜시버들(예컨대, 셀룰러 또는 WiFi)을 포함할 수 있다. 저전력 무선 연결 및 고속 무선 연결을 통해 통신하는 트랜시버들을 포함하는 모바일 디바이 스는 네트워크의 다른 엘리먼트들과 마찬가지로 아이웨어 디바이스의 아키텍처의 세부사항들을 사용하여 구현될 수 있다. 메모리는 특히, 좌측 및 우측 가시광 카메라들(114A-B) 및 이미지 프로세서에 의해 생성된 색 맵들, 카메라 데이터뿐만 아니라 광학 조립체(180A-B)의 시-스루 이미지 디스플레이들(180C-D) 상에서 이미 지 디스플레이 드라이버에 의해 디스플레이하기 위해 생성된 이미지들을 포함하는 다양한 데이터 및 애플리케이션들을 저장할 수 있는 임의의 저장 디바이스를 포함한다. 메모리는 고속 회로부와 통합된 것으로 도시되어 있지만, 다른 예들에서, 메모리는 아이웨어 디바이스의 독립적인 스탠드얼론 엘리먼트 일 수 있다. 이러한 특정 예들에서, 전기 라우팅 라인들은 고속 프로세서를 포함하는 칩을 통해 이미지 프로세서 또는 저전력 프로세서로부터 메모리로의 연결을 제공할 수 있다. 다른 예들에서, 고 속 프로세서는 메모리를 수반하는 판독 또는 기록 동작이 필요할 때마다 저전력 프로세서가 고 속 프로세서를 부팅하도록 메모리의 어드레싱을 관리할 수 있다. 서버 시스템은 예컨대 프로세서, 메모리, 및 네트워크를 통해 모바일 디바이스 및 아이 웨어 디바이스와 통신하기 위한 네트워크 통신 인터페이스를 포함하는 서비스 또는 네트워크 컴퓨팅 시스 템의 일부로서 하나 이상의 컴퓨팅 디바이스들일 수 있다. 아이웨어 디바이스는 호스트 컴퓨터와 연결된 다. 예컨대, 아이웨어 디바이스는 고속 무선 연결부를 통해 모바일 디바이스와 페어링되거나 네트워크를 통해 서버 시스템에 연결된다. 아이웨어 디바이스의 출력 컴포넌트들은 도 2c-d에 설명된 바와 같은 광학 조립체(180A-B)의 좌측 및 우측 이미지 디스플레이들(180C-D)(예컨대, LCD(liquid crystal display), PDP(plasma display panel), LED(light emitting diode) 디스플레이, 프로젝터 또는 도파관과 같은 디스플레이)과 같은 시각적 컴포넌트들을 포함한다. 광학 조립체(180A-B)의 이미지 디스플레이들(180C-D)은 이미지 디스플레이 드라이버에 의해 구 동된다. 아이웨어 디바이스의 출력 컴포넌트들은 음향 컴포넌트들(예컨대, 스피커들), 햅틱 컴포넌트들 (예컨대, 진동 모터), 다른 신호 생성기들 등을 더 포함한다. 아이웨어 디바이스, 모바일 디바이스 및 서버 시스템의 입력 컴포넌트들은 영숫자 입력 컴포넌트들(예컨대, 키보드, 영숫자 입력을 수신하도록 구성된 터치 스크린, 포토-광학 키보드 또는 다른 영숫자 입력 컴포넌트들), 포인트-기반 입력 컴포넌트들(예컨 대, 마우스, 터치패드, 트랙볼, 조이스틱, 모션 센서 또는 다른 포인팅 기구들), 촉각 입력 컴포넌트들(예컨대, 물리적 버튼, 터치들 또는 터치 제스처들의 로케이션 및 힘을 제공하는 터치 스크린, 또는 다른 촉각 입력 컴포 넌트들), 오디오 입력 컴포넌트들(예컨대, 마이크로폰) 등을 포함할 수 있다. 아이웨어 디바이스는 선택적으로 추가적인 주변 디바이스 엘리먼트들을 포함할 수 있다. 이 러한 주변 디바이스 엘리먼트들은 아이웨어 디바이스와 통합된 생체 센서들, 추가적인 센서들 또는 디스플 레이 엘리먼트들을 포함할 수 있다. 예컨대, 주변 디바이스 엘리먼트들은 출력 컴포넌트들, 모션 컴포넌 트들, 포지션 컴포넌트들, 또는 본원에 설명된 임의의 다른 이러한 엘리먼트들을 포함하는 임의의 I/O 컴포넌트 들을 포함할 수 있다. 아이웨어 디바이스는 다른 형태들을 취할 수 있고, 다른 타입들의 프레임워크들, 예컨대 헤드기어, 헤드셋 또는 헬멧을 포함할 수 있다. 예컨대, 사용자 인터페이스 시야 조절 생체 컴포넌트들은 표현들(예컨대, 손 표현들, 얼굴 표현들, 음성 표현들, 신체 제스처들 또는 눈 추적)을 검출하는 것, 생체신호들(예컨대, 혈압, 심박수, 체온, 땀 또는 뇌파)을 측정하는 것, 개인을 식별하는 것(예컨대, 음성 식별, 망막 식별, 얼굴 식별, 지문 식별 또는 뇌전도 기반 식별) 등을 위한 컴포넌트들을 포함한다. 모션 컴포넌트들은 가속 센서 컴포넌트들(예컨대, 가속 도계), 중력 센서 컴포넌트들, 회전 센서 컴포넌트들(예컨대, 자이로스코프) 등을 포함한다. 포지션 컴포넌트 들은 로케이션 좌표들을 생성하는 로케이션 센서 컴포넌트들(예컨대, GPS(Global Positioning System) 수신기 컴포넌트), 포지셔닝 시스템 좌표들을 생성하는 WiFi 또는 Bluetooth™ 트랜시버들, 고도 센서 컴포넌트들(예컨 대, 고도가 유도될 수 있는 공기 압력을 검출하는 고도계들 또는 기압계들), 배향 센서 컴포넌트들(예컨대, 자 력계들) 등을 포함한다. 이러한 포지셔닝 시스템 좌표들은 또한 저전력 무선 회로부 또는 고속 무선 회로 부를 통해 모바일 디바이스로부터 무선 연결들(925 및 937)을 통해 수신될 수 있다. 일부 예들에 따르면, \"애플리케이션\" 또는 \"애플리케이션\"은 프로그램들에 정의된 기능들을 실행하는 프로그램(들)이다. 객체-지향 프로그래밍 언어들(예컨대, Objective-C, Java 또는 C++) 또는 절차적 프로그래 밍 언어들(예컨대, C 또는 어셈블리 언어)과 같이, 다양한 방식들로 구성된 애플리케이션들 중 하나 이상을 생 성하기 위한 다양한 프로그래밍 언어들이 이용될 수 있다. 특정 예에서, 제3자 애플리케이션(예컨대, 특정 플 랫폼의 벤더 이외의 엔티티에 의해 ANDROID™ 또는 IOS™ SDK(software development kit)를 사용하여 개발된 애플리케이션)은 모바일 오퍼레이팅 시스템, 예컨대 IOS™, ANDROID™, WINDOWS® Phone 또는 다른 모바일 오퍼 레이팅 시스템들 상에서 실행되는 모바일 소프트웨어를 포함할 수 있다. 이러한 예에서, 제3자 애플리케이션은 본원에 설명된 기능을 용이하게 하기 위해 오퍼레이팅 시스템에 의해 제공된 API 콜들을 인보크할 수 있다. 도 10을 참조하면, 프로세서는 이미지 프로세서 및 이미지 디스플레이 드라이버를 사용 하여 이미지 디스플레이들 상에서 사용자에게 이미지들을 제시한다. 프로세서는 환경 내의 아이웨어 디바이스의 로케이션에 응답하여 이미지 디스플레이들을 통해 시각적 이미지들을 개발하고 제시한 다. 일례에서, 시각적 이미지들은 GUI(graphical user interface) 및 가상 우주선의 특징들을 조작하기 위한 손의 이미지를 포함한다. GUI는 아이웨어 디바이스의 디스플레이, 모바일 디바이스의 디스플레이 또는 서버 시스 템과 같은 원격 컴퓨터용 디스플레이 상에 제시될 수 있다. 일례에서, 사용자는 선택기들을 조작하고, 아 이웨어 디바이스의 사용자 입력 디바이스를 사용하여, 모바일 디바이스의 사용자 입력 층을 사용하여 또는 다른 디바이스의 사용자 입력을 사용하여 버튼들을 작동시킬 수 있다. 다른 예에서, 사용자는 선택기들을 조작하고, 아이웨어 디바이스의 카메라들에 의해 캡처된 손 제스처들을 통해 버튼들을 작동시킬 수 있다. 이러한 예에 따르면, 아이웨어 디바이스의 프로세서 는 카메라(114A, 114B)로 비디오 데이터의 프레임들을 캡처하도록 구성된다. 이미지들의 객체들은 액션과 연관된 미리 정의된 손 제스처들(예컨대, 가르키는 검지 손가락)을 식별하기 위해 손 제스처 라이브러리와 비교된다. 손 제스처가 식별될 때, 손의 포지션은 선택기들에 대해 결정되며, 버튼들을 작동시킨다. 손 제스 처의 수정(예컨대, 집게 손가락의 끝이 버튼 근처에 있을 때 태핑 모션 또는 집게 손가락의 끝이 선택기 근처에 있을 때 스와이핑 동작)은 버튼들/선택기의 작동을 초래한다. 검출된 손 모양이 미리 정의된 제스처와 매칭되는지 여부를 결정하는 프로세스는, 일부 구현들에서, 손 제스처 라이브러리(도 9)에 저장된 손 제스처들의 집합과 비디오 데이터의 하나 이상의 캡처된 프레임들의 손 모양에 대한 픽셀-레벨 데이터를 비교하는 것을 수반한다. 검출된 손 모양 데이터는 손목에 대한 3차원 좌 표들, 최대 15개의 지절간 관절들, 최대 5개의 손가락 끝들 및 캡처된 프레임에서 발견되는 다른 골격 또는 연 조직 랜드마크들을 포함할 수 있다. 이들 데이터는 최상의 매치가 발견될 때까지 손 제스처 라이브러리에 저장된 손 제스처 데이터와 비교된다. 일부 예들에서, 프로세스는 검출된 손 모양 손가락 끝 좌표들과 라이브 러리에 저장된 각각의 손 제스처에 대한 한 세트의 손가락 끝 좌표들 간의 측지 거리들의 합을 계산하는 것을 포함한다. 구성 가능한 임계 정확도 값 내에 있는 합은 매치를 나타낸다. 다른 예시적인 구현에서, 검출된 손 모양이 미리 정의된 제스처와 매칭되는지 여부를 결정하는 프로세 스는 손 제스처들을 포함하는 이미지들의 집합과 비디오 데이터의 하나 이상의 캡처된 프레임들의 손 모양에 대 한 픽셀-레벨 데이터를 비교하도록 머신-러닝 알고리즘을 사용하는 것을 수반한다. 머신 러닝은 경험을 통해 점차적으로 개선하는 알고리즘을 지칭한다. 많은 수의 상이한 입력 데이터세 트들을 프로세싱함으로써, 머신-러닝 알고리즘은 특정 데이터세트들에 대한 개선된 일반화들을 개발하고, 이후 이러한 일반화들을 사용하여 새로운 데이터세트를 프로세싱할 때 정확한 출력 또는 솔루션을 생성할 수 있다. 대체로, 머신-러닝 알고리즘은 새로운 경험들에 응답하여 조절하거나 또는 변경하여 알고리즘을 점차적으로 개 선할 하나 이상의 파라미터들; 러닝과 유사한 프로세스를 포함한다. 컴퓨터 비전의 맥락에서, 수학적 모델들은 인간 시각 시스템에 의해 달성되는 작업들을 에뮬레이트하려 고 시도하며, 여기서 컴퓨터들을 사용하는 목표는 이미지로부터 정보를 추출하고 이미지의 콘텐츠들을 정확하게 이해하는 것이다. 인공지능, 자율주행 등을 포함하여 다양한 분야들에서 컴퓨터 비전 알고리즘들이 개발되어, 디지털 이미지들과 비디오에서 데이터를 추출하고 분석하였다. 딥 러닝은 인공 신경망들에 기반하거나 또는 인공 신경망들 이후에 모델링되는 일종의 머신-러닝 방법 들을 지칭한다. 인공 신경망은 외부 입력들에 응답하여 자신들의 동적 상태에 의해 정보를 프로세싱하는 다수 의 단순하고 고도로 상호 연결된 프로세싱 엘리먼트들(노드들)로 구성된 컴퓨팅 시스템이다. 대규모 인공 신경 망은 수백 또는 수천 개의 노드들을 가질 수 있다. CNN(convolutional neural network)은 디지털 사진들 및 비디오를 포함하여 시각적 이미지들을 분석하 기 위해 자주 적용되는 일종의 신경망이다. CNN에서 노드들 간의 연결 패턴은 전형적으로 인간 시각 피질의 조 직을 본떠서 만들어지며, 이는 시야 내의 중첩 구역들에 반응하도록 배열된 개별 뉴런들을 포함한다. 본원에서 설명된 결정 프로세스에 사용하기에 적합한 신경망은 VGG16, VGG19, ResNet50, Inception V3, Xception, 또는 다른 CNN-호환가능 아키텍처들 중 하나에 기반한다. 머신-러닝 예에서, 프로세서는 손 특징 모델로서 지칭되는 머신-트레이닝된 알고리즘을 사용하여 검출된 손 모양이 미리 정의된 제스처와 실질적으로 매칭되는지 여부를 결정한다. 프로세서는 머신 러닝 을 통해 훈련된 손 특징 모델에 액세스하도록 구성되고, 손 특징 모델을 적용하여 비디오 데이터의 하나 이상의 프레임들에서 손 모양의 특징들을 식별하여 로케이팅한다. 하나의 예시적인 구현에서, 훈련된 손 특징 모델은 검출된 손 모양을 포함하는 비디오 데이터의 프레임 을 수신하고, 분석을 위해 프레임의 이미지를 계층들로 추상화한다. 각각의 계층의 데이터는 양호한 매치가 식 별될 때까지 훈련된 손 특징 모델에 기반하여 계층별로 손 제스처 라이브러리에 저장된 손 제스처 데이터 와 비교된다. 일례에서, 계층별 이미지 분석은 컨볼루션 신경망을 사용하여 실행된다. 제1 컨볼루션 계층에서, CNN 은 학습된 특징들(예컨대, 손 랜드마크들, 관절 좌표들의 세트들 등)을 식별한다. 제2 컨볼루션 계층에서, 이 미지는 복수의 이미지들로 변환되며, 여기서 학습된 특징들은 개개의 서브-이미지에서 각각 강조된다. 풀링 계 층에서, 이미지들 및 서브-이미지들의 크기들 및 해상도는 가능한 관심 특징(예컨대, 가능한 손바닥 모양, 가능 한 손가락 관절)을 포함하는 각각의 이미지의 부분들을 격리하기 위해 감소된다. 비-출력 계층들로부터의 이미 지들의 값들 및 비교들은 프레임에서 이미지를 분류하는 데 사용된다. 본원에서 사용되는 분류는 검출된 손 모 양에 따라 이미지를 분류하기 위해 훈련된 모델을 사용하는 프로세스를 지칭한다. 예컨대, 이미지는 검출된 손 모양이 라이브러리로부터의 포인터 제스처와 매칭되는 경우에 \"포인터 제스처 존재\"로서 분류될 수 있다. 일부 예시적인 구현들에서, 프로세서는, 가리키는 제스처를 검출하는 것에 응답하여, 표시기 를 디스플레이(180A-B) 상에 제시한다(도 10 참조). 표시기는 미리 정의된 제스처가 검출되었음을 착용자에게 알린다. 일례에서, 표시기는 도 10에 도시된 가리키는 손가락과 같은 객체이다. 표시기 는 포인터 제스처가 검출되었음을 착용자에게 알리거나 경고하기 위한 하나 이상의 가시적, 청각적, 촉각 적 및 다른 엘리먼트들을 포함할 수 있다. 사용자는 아이웨어 디바이스의 시야 내에서 검출된 손 제스처 를 이동함으로써 표시기를 이동할 수 있다. 본원에서 사용된 용어들 및 표현들은, 특정 의미들이 본원에 달리 제시된 경우를 제외하고는 그들 대응 하는 개개의 탐구 및 연구 영역들과 관련하여 그러한 용어들 및 표현들에 부여된 바와 같은 일반적인 의미를 갖는다는 것이 이해될 것이다. 관계형 용어들, 이를테면 제1, 제2 등은 단지 하나의 엔티티 또는 동작을 다른 것으로부터 구별하기 위해 사용될 수 있고, 이러한 엔티티들 또는 동작들 간의 임의의 실제 이러한 관계 또는 순서를 반드시 요구하거나 암시하지는 않는다. 용어들 \"포함하다\", \"포함하는\", \"구비하다\" , “구비하는\" , 또는 이의 임의의 다른 변형은 비-배타적인 포함을 커버하는 것으로 의도되어, 엘리먼트들 또는 단계들의 리스 트를 포함하거나 구비하는 프로세스, 방법, 물품 또는 장치는 그러한 엘리먼트들 또는 단계들만을 구비하는 것 이 아니라, 명시적으로 나열되지 않거나 또는 이러한 프로세스, 방법, 물품 또는 장치에 고유한 다른 엘리먼트 들 또는 단계들을 구비할 수 있다. 단수형 엘리먼트는, 추가적인 제약들 없이, 엘리먼트를 포함하는 프로세스, 방법, 물품 또는 장치에서 추가적인 동일한 엘리먼트들의 존재를 배제하지 않는다. 달리 언급되지 않는 한, 하기 청구항들을 포함하여 본 명세서에 기재된 임의의 그리고 모든 측정치들, 값들, 등급들, 포지션들, 크기들, 사이즈들 및 다른 규격들은 정확한 것이 아니라 근사치이다. 이러한 수량들 은, 이들이 관련되는 기능들 및 이들과 관련된 분야에서 통상적인 것과 일치하는 합리적인 범위를 갖도록 의도 된다. 예컨대, 달리 명시적으로 언급되지 않는 한, 파라미터 값 등은 언급된 양으로부터 ± 10 %만큼 많이 달 라질 수 있다. 더욱이, 전술한 상세한 설명에서, 다양한 특징들은 본 개시내용을 간소화할 목적으로 다양한 예들에서 함께 그룹화된다. 본 개시내용의 방법은 청구되는 예들이 각각의 청구항에 명시적으로 언급된 것보다 많은 특 징들을 요구하려는 의도를 반영하는 것으로 해석되어서는 안된다. 오히려, 하기의 청구항들이 반영하는 바와 같이, 보호될 청구대상은 임의의 단일의 개시된 예의 모든 특징들보다 적다. 따라서, 하기의 청구항들은 상세 한 설명에 통합되며, 각각의 청구항은 별개로 청구된 청구대상으로서 독자적으로 기재된다. 전술한 것은 최상의 모드 및 다른 예들인 것으로 고려되는 것을 설명하지만, 본원에서 다양한 수정들이 이루어질 수 있고 본원에 개시된 청구대상은 다양한 형태들 및 예들로 구현될 수 있으며 이들은 다수의 애플리 케이션들에 적용될 수 있고 그 일부만이 본원에서 설명되었음이 이해된다. 이하의 청구항들은 본 개념들의 진 정한 범위 내에 있는 임의의 그리고 모든 수정들 및 변경들을 청구하도록 의도된다. 도면 도면1a 도면1b 도면2a 도면2b 도면2c 도면2d 도면3 도면4a 도면4b 도면4c 도면4d 도면4e 도면4f 도면4g 도면4h 도면4i 도면4j 도면5 도면6 도면7 도면8 도면9 도면10"}
{"patent_id": "10-2023-7022911", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도면들은 제한들이 아니라 오직 예시로서 하나 이상의 구현들을 도시한다. 도면들에서, 유사한 참조 부호들은 동일하거나 유사한 엘리먼트들을 지칭한다. 도 1a는 이미지 디스플레이를 갖는 우측 광학 조립체를 도시하는 아이웨어 디바이스의 예시적인 하드웨 어 구성의 측면도이며, 시야 조절들은 사용자에 의해 검출된 머리 또는 눈 움직임에 기반하여 이미지 디스플레 이 상에 제시되는 사용자 인터페이스에 적용된다. 도 1b는 가시광 카메라, 아이웨어 디바이스의 사용자의 머리 움직임을 추적하기 위한 머리 움직임 추적 기, 및 회로 기판을 도시한 도 1a의 아이웨어 디바이스의 템플의 평면 단면도이다. 도 2a는 아이웨어 디바이스의 사용자를 식별하기 위해 시스템에서 사용하기 위한 프레임 상의 눈 스캐 너를 포함하는 아이웨어 디바이스의 예시적인 하드웨어 구성의 배면도이다. 도 2b는 아이웨어 디바이스의 사용자를 식별하기 위해 시스템에서 사용하기 위한 템플 상의 눈 스캐너 를 포함하는 다른 아이웨어 디바이스의 예시적인 하드웨어 구성의 배면도이다. 도 2c 및 도 2d는 2개의 상이한 타입들의 이미지 디스플레이들을 포함하는 아이웨어 디바이스의 예시적 인 하드웨어 구성들의 후면도들이다. 도 3은 적외선 방출기, 적외선 카메라, 프레임 전면, 프레임 후면 및 회로 보드를 도시하는 도 2a의 아 이웨어 디바이스의 후면 측사시도를 도시한다. 도 4a는 도 3의 아이웨어 디바이스의 프레임 및 적외선 방출기를 통해 취해진 단면도이다. 도 4b 및 도 4c는 디스플레이의의 도파관들이 다수의 층들을 갖는 도파관 스택으로서 형성될 수 있음을 예시한다. 도 4d는 도 4c의 도파관 스택 및 도 4e의 도파관 스택의 구조 분석을 예시한다. 도 4e, 도 4f 및 도 4g는 접착제를 디스플레이의 외부 에지로부터 안쪽으로 포지셔닝함으로써 도파관 에지에서의 응력을 최소화하는 본딩된 도파관 스택을 예시한다. 도 4h는 프레임에 고정된 도파관 스택을 예시하며, 여기서 도파관 스택과 프레임 사이의 접착제는 도파 관 스택의 에지로부터 오프셋 거리(OFF)에 있다. 도 4i는 도 4c에 도시된 도파관 스택의 에지들에서의 응력을 예시한다. 도 4j는 도 4e의 도파관 스택의 에지들에서의 응력을 예시하며, 도 4c의 예와 비교하여 감소된 응력을 예시한다. 도 5는 눈 응시 방향을 검출하는 것을 예시한다. 도 6은 눈 포지션을 검출하는 것을 예시한다. 도 7은 우측 원시 이미지로서 우측 가시광 카메라에 의해 캡처된 가시광 및 좌측 원시 이미지로서 좌측 가시광 카메라에 의해 캡처된 가시광의 예를 도시한다. 도 8은 도 4e의 도파관 스택을 생성하는 방법을 예시한다. 도 9는 다양한 네트워크들을 통해 연결된 서버 시스템, 모바일 디바이스 및 아이웨어 디바이스의 전자 컴포넌트들의 블록도를 예시한다. 도 10은 시각적 사용자 입력을 갖는 예시적인 웨어러블 디바이스(예컨대, 아이웨어 디바이스)를 예시한 다."}
