{"patent_id": "10-2023-0046192", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0053508", "출원번호": "10-2023-0046192", "발명의 명칭": "스마트 미러를 이용하여 홈 트레이닝 그룹을 성장시키는 방법", "출원인": "(주)에이치엠솔루션", "발명자": "이상진"}}
{"patent_id": "10-2023-0046192", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자의 운동 영상을 촬영하는 카메라와 미러 디스플레이를 포함하고, 근거리 무선통신에 의해 다수의 홈 트레이닝 기구 및 사용자 단말장치와 접속되는 스마트 미러장치, 그리고 상기 사용자 단말장치와 통신망을 경유하여접속되는 홈 트레이닝 관리서버에서 이루어지는 단위 홈 트레이닝 그룹을 성장시키는 방법에 있어서, 상기 스마트 미러장치를 통해 사용자의 체형정보와 사용자의 포즈정보를 이용하여 사용자를 인증하는 사용자 인증단계와; 상기 인증된 사용자들의 홈 트레이닝 종목별 운동 레벨을 평가하여 1~5 등급의 운동 등급으로 분류하고, 이를저장하는 등급 분류 단계와; 1명의 트레이너(Tr)에 대해 1명의 5등급 사용자, 1명의 4등급 사용자, 1명의 3등급 사용자, 1명의 2등급 사용자및 1명의 1등급 사용자를 순차적으로 연결하여 등급 체인으로 이루어지는 단위 홈 트레이닝 그룹을 형성하는 단위 홈 트레이닝 그룹 형성단계와; 상기 인증된 모든 사용자들을 대상으로 홈 트레이닝 종목별 운동 레벨을 재평가하여 1~5 등급의 운동 등급으로재분류하는 운동 등급을 갱신하는 등급 갱신 단계와; 사용자들의 운동 등급이 갱신됨에 따라, 상기 단위 홈 트레이닝 그룹내에 운동 등급의 갱신을 통해서 등급이 승급됨에 따라 등급 체인상에 비어 있는 등급이 존재하는지 여부를 판단하는 제 1 판단단계와; 상기 제 1 판단단계에서, 비어 있는 등급이 1등급인지 여부를 판단하는 제 2 판단단계와; 상기 제 2 판단단계에서, 비어 있는 등급이 1등급이 아닌 경우, 해당하는 등급의 사용자를 추가 모집하여 상기비어 있는 등급을 충원하는 등급 충원 단계와; 상기 제 2 판단단계에서, 비어 있는 등급이 1등급인 경우 아래의 수학식에 따라 비어 있는 1등급 사용자를 m명만큼 모집하여 상기 비어 있는 1등급을 충원하는 1등급 충원 단계와; (여기서, N은 단위 홈 트레이닝 그룹의 등급 산술합이고, n과 m은 자연수이다.) 상기 단위 홈 트레이닝 그룹 형성단계 내지 상기 1등급 충원 단계를 수차례 반복하는 것에 의해 상기 단위 홈트레이닝 그룹을 성장시키는 것을 특징으로 하는 단위 홈 트레이닝 그룹을 성장시키는 방법."}
{"patent_id": "10-2023-0046192", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 상기 등급 분류 단계는, 상기 인증된 사용자들의 복수의 트레이닝 종목에 대해 정해진 규칙에 따라 트레이닝을 실시한 운동 데이터를 상기 스마트 미러장치를 통해 수신하고, 이 운동 데이터에 기반하여 상기 인증된 사용자들의 운동 레벨을 1~5 등급의 운동 등급으로 분류하는 것을 특징으로 하는 단위 홈 트레이닝 그룹을 성장시키는 방법."}
{"patent_id": "10-2023-0046192", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항 또는 제 2 항에 있어서, 상기 단위 홈 트레이닝 그룹 형성단계는, 다시 다수의 트레이너(Trainer)를 모집하고, 이 트레이너(Trainer)들에 대한 정보를 이용하여 트레이너 데이터베이스를 구축하는 단계와; 상기 트레이너들에 대해 상기 단위 홈 트레이딩 그룹의 형성을 요청하는 단계와; 상기 트레이너(Tr)가 잠재적인 다수의 5등급 사용자에게 참여를 요청하고, 요청에 응답한 다수의 5등급 사용자공개특허 10-2024-0053508-3-중 1명을 선택하여 상기 트레이너(Tr)와 1명의 5등급 트레이니(Te5)를 연결하는 것에 의해 1차 체인(Tr-Te5)을구성하는 단계와; 상기 트레이너(Tr)가 잠재적인 다수의 4등급 사용자에게 참여를 요청하고, 요청에 응답한 다수의 4등급 사용자중 1명을 선택하여 상기 1차 체인(Tr-Te5)에 1명의 4등급 트레이니(Te4)를 연결하는 것에 의해 2차 체인(Tr-Te5-Te4)을 구성하는 단계와; 상기 트레이너(Tr)가 잠재적인 다수의 3등급 사용자에게 참여를 요청하고, 요청에 응답한 다수의 3등급 사용자중 1명을 선택하여 상기 2차 체인(Tr-Te5-Te4)에 1명의 3등급 트레이니(Te3)를 연결하는 것에 의해 3차 체인(Tr-Te5-Te4-Te3)을 구성하는 단계와; 상기 트레이너(Tr)가 잠재적인 다수의 2등급 사용자에게 참여를 요청하고, 요청에 응답한 다수의 2등급 사용자중 1명을 선택하여 상기 3차 체인(Tr-Te5-Te4-Te3)에 1명의 2등급 트레이니(Te2)를 연결하는 것에 의해 4차 체인(Tr-Te5-Te4-Te3-Te2)을 구성하는 단계; 및 상기 트레이너(Tr)가 잠재적인 다수의 1등급 사용자에게 참여를 요청하고, 요청에 응답한 다수의 1등급 사용자중 1명을 선택하여 상기 4차 체인(Tr-Te5-Te4-Te3-Te2)에 1명의 1등급 트레이니(Te1)를 연결하는 것에 의해 5차체인(Tr-Te5-Te4-Te3-Te2-Te1)을 구성하는 단계;를 포함하는 것을 특징으로 하는 단위 홈 트레이닝 그룹을 성장시키는 방법."}
{"patent_id": "10-2023-0046192", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서, 상기 트레이너(Tr)가 상기 5등급 트레이니(Te5)를 트레이닝하고, 상기 5등급 트레이니(Te5)가 상기 4등급 트레이니(Te4)를 트레이닝하고, 상기 4등급 트레이니(Te4)가 상기 3등급 트레이니(Te3)를 트레이닝하고, 상기 3등급트레이니(Te3)가 상기 2등급 트레이니(Te2)를 트레이닝하며, 상기 2등급 트레이니(Te2)가 상기 1등급 트레이니(Te1)를 트레이닝하는 단계별 홈 트레이닝 단계를 더 포함하는 것을 특징으로 하는 단위 홈 트레이닝 그룹을 성장시키는 방법."}
{"patent_id": "10-2023-0046192", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4 항에 있어서, 상기 등급 갱신 단계는, 다시 미리 정해진 정기 등급 갱신 주기에 도달하게 되면, 상기 인증된 모든 사용자들에게 정기 등급 심사의 참여를요청하는 단계와; 상기 인증된 모든 사용자들이 테스트를 위해 정해진 복수의 트레이닝 종목을 대상으로 정해진 규칙에 따라 홈트레이닝을 실시하고, 그 실시 결과에 대한 운동 데이터를 상기 스마트 미러장치로부터 수신하는 단계; 및 상기 운동 데이터에 기반하여 상기 인증된 모든 사용자의 운동 레벨을 5등급, 4등급, 3등급, 2등급, 1등급과같이 5가지 운등 등급으로 분류하고, 이를 사용자별로 저장하는 것에 의해 운동 등급을 갱신하는 단계;를 포함하는 것을 특징으로 하는 단위 홈 트레이닝 그룹을 성장시키는 방법."}
{"patent_id": "10-2023-0046192", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서, 상기 제 1 판단단계에서, 상기 단위 홈 트레이딩 그룹의 특정한 트레이니의 운동 등급이 하강하여 해당하는 등급이 비게되면, 상기 등급 충원 단계를 실행하지 않는 것을 특징으로 하는 단위 홈 트레이닝 그룹을 성장시키는방법."}
{"patent_id": "10-2023-0046192", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 스마트 미러장치와 사용자 단말장치를 이용하여 사용자를 등록/인증하고, 등록된 사용자들을 운동 레 벨에 따라 순차적으로 연결하여 단위 홈 트레이닝 그룹을 형성하고, 이 단위 홈 트레이닝 그룹을 성장시키는 것 에 의해 온라인상의 헬스 클럽이나 피트니스 센터화시키는 것을 특징으로 한다."}
{"patent_id": "10-2023-0046192", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 출원은 2022년 10월 14일에 출원된 한국 특허출원 제 10-2022-0132293 호에 기초한 우선권을 주장하며, 해당 출원의 명세서 및 도면에 개시된 모든 내용은 본 출원에 원용된다. 본 발명은 스마트 미러 장치를 이용한 홈 트레이닝 기술에 관한 것으로서, 특히, 등급 체인으로 이루어진 단위 홈 트레이닝 그룹을 형성하고, 이 단위 홈 트레이닝 그룹을 성장시키는 방법에 관한 것이다."}
{"patent_id": "10-2023-0046192", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "스마트 미러란 거울이면서도 동시에 디스플레이의 기능을 갖는 거울을 말한다. 이 스마트 미러를 구현하기 위해 서는 반투명 거울(Half Mirror)과 디스플레이를 결합한다. 반투명 거울은 일반적인 반사만 존재하는 거울과는 달리 반사율과 투과율을 어느 정도 조절한 거울이다. 여기에 디스플레이를 부착하여 일반적으로 거울이지만, 디 스플레이의 내용도 표시할 수 있도록 한다. 이러한 스마트 미러는 다양한 정보를 보기 쉽게 출력하는 것을 목적으로 하는 인터페이스이다. 따라서, 데이터 수집은 별개의 데이터 서버를 통하여 수행된다. 스마트 미러는 거울을 인터페이스로 사용하기 때문에 지문이 묻 게 되는 손 터치와 같은 입력 수단은 좋은 선택이 아니다. 따라서, 입력수단에는 애플리케이션(스마트폰)과 음 성입력을 활용한다. 스마트폰을 통하여 거울의 설정, 그리고 필요한 기능들을 취향대로 골라서 출력할 수 있다. 특허문헌 1(대한민국 공개특허공보 제 2021-0076539 호)은 미러 디스플레이, 카메라, 마이크, 스피커 및 마이크 를 통해 수신된 사용자 음성 명령에 따라 트레이닝 모드로 동작하고, 카메라를 통해 사용자를 촬영한 이미지를 획득하고, 획득된 사용자 이미지를 디스플레이하도록 미러 디스플레이를 제어하고, 획득된 사용자 이미지에 기 초하여 사용자의 운동 자세를 분석하고, 분석된 운동 자세에 기초하여 사용자의 운동 자세를 교정하기 위한 가 이드 정보를 출력하도록 스피커 및 미러 디스플레이 중 적어도 하나를 제어하는 프로세서를 포함하는 스마트 미 러 장치를 개시한다. 최근 건강과 몸에 대한 관심이 높아짐에 따라, 현대인에게 운동이란 단순히 육체적 건강 증진 개념을 넘어서 자 신의 경쟁력 강화와 미(美)를 증진시키는 개념으로 여겨지는 추세이다. 특히 근력운동에 대한 수요가 가장 크며 현대인들의 많은 관심을 받고 있다. 이에 따라 피트니스 센터에서 퍼스널 트레이너(Personal Trainer)를 이용하 여 운동하는 사람들이 과거에 비하여 크게 증가하였다. 그러나 대다수의 사람들은 고가의 비용이나 시간적 제약 때문에 혼자서 운동을 하고 있는 실정이다. 이러한 실정에 따라, 집에서 근력운동을 수행하는 홈 트레이닝에 대 한 인기가 높아지고 있다. 피트니스 센터를 방문하지 않더라도 인터넷을 통하여 운동도구(또는 운동기구)를 구 입하여 운동을 수행할 수 있고, 스마트폰으로 다운받을 수 있는 트레이닝 애플리케이션(Application)이나 인터 넷으로부터 운동방법에 대한 정보도 쉽게 획득할 수 있다는 점 역시 그 배경이 될 것이다. 홈 트레이닝은 누구든지 시간과 공간의 제약 없이 운동을 할 수 있다는 장점이 있지만, 운동을 하는 동안 자세 를 교정받는 등의 피드백은 받을 수 없다는 한계가 존재한다. 근육운동의 경우, 정확한 자세로 적절한 근육을 자극하는 것이 특히 중요한데, 그 이유는 잘못된 자세로 운동을 지속하는 경우 운동효과 저하는 물론 운동 상해 라는 심각한 손해까지 발생할 수 있기 때문이다. 하지만, 숙련되지 않은 개인이 정확한 동작으로 적절한 근육을 자극하며 운동하기란 현실적으로 매우 어려운 일이다. 또한, 신체기능 향상을 위해서 근육 전체를 골고루 단련 시킬 필요가 있는데, 개인은 신체가 균형있게 발달했는지에 대해 스스로 판단하기가 어렵다. 따라서 어느 한 부 위에 치우쳐 운동하기가 쉽고 이에 따라 신체의 균형이 깨지는 문제점이 있다. 또한, 전문트레이너가 아닌 개인 이 스스로 수행할 수 있는 운동방법의 가짓수는 매우 제한적이다. 다시 말해, 다양한 운동방법을 검색하고 실제 로 이를 수행하는 것은 바쁜 일상에서 시간을 내어 운동을 하는 대다수의 사람에게 매우 어려운 일이다. 이로 인해, 기존에 수행해오던 운동방법 몇 가지만을 반복하게 되고 운동에 쉽게 질리게 되는 문제점이 있다. 일반적인 홈 트레이닝(home training)의 경우, 대부분 스마트폰 동영상을 통해 다양한 종류의 헬스기구 사용법 과 운동방법을 단편적으로 습득하게 되는데, 사용자(운동자)가 스스로 자신에게 적합한 운동방법을 선택하거나, 작은 스마트폰 화면을 통해 자신이 적절하게 운동을 수행하고 있는지 확인하기 어렵다는 한계를 가지고 있다. 이러한 문제점을 해결하기 위하여, 사용자가 자신의 모습을 실시간 확인하면서 정확한 운동자세를 유지하기 위 하여, 거울(미러, mirror)에 카메라 기능과 디스플레이 기능을 결합하여 운동하는 자신의 모습을 실시간 확인할 뿐만 아니라, 운동하는 자신의 모습을 저장하고, 사용자의 신체 자세와 운동을 그래픽적으로 렌더링하여 시각화 해주는 스마트 미러를 이용한 홈 트레이닝 서비스가 주목받고 있다. 대한민국 공개특허공보 제 2022-0055704 호, 대한민국 등록특허공보 제 10-2000763 호 및 대한민국 공개특허공 보 제 2022-0120731 호 등은 카메라를 이용하여 사용자의 운동영상을 촬영하고, 이렇게 촬영된 사용자의 운동영 상을 표준 운동자세에 대응되도록 출력하여 개인 맞춤형 운동 코칭 정보를 제공하는 홈 트레이닝 방법들을 제안 한다. 더 나아가 최근에는 다양한 운동 머신과 스마트 미러 장치를 근거리 통신으로 연결하여 상기 복수의 운동 머신 들의 운동량 정보를 센싱하고, 이를 분석하여 사용자 맞춤형 운동정보를 추천하는 스마트 코칭 방법에 대한 기술들이 대한민국 등록특허공보 제 10-2066001 호, 대한민국 등록특허공보 제 10-2411138 호 및 대한민국 등록특 허공보 제 10-2116968 호 등을 통해 제안되었다. 또한, 특허문헌 2(대한민국 등록특허공보 제 10-2360284 호)는 사용자 단말장치를 통해 서버에 수집된 아바타 정보, 운동정보, 의심질환 정보, 건강정보 중 어느 하나 이상과, 서버에서 수집된 다수의 다른 사용자 단말장치 에서 제공되는 아바타 정보, 운동정보, 의심질환 정보, 건강정보 중 어느 하나 이상의 정보를 유사도에 따라 그 룹화하여 해당 사용자 랭킹을 포함하는 공유정보를 상기 사용자 단말장치 및 상기 다수의 다른 사용자 단말장치 와 공유하는 스마트 미러를 기반으로 하는 지능형 헬스케어 시스템을 개시한다. 또한, 특허문헌 3(대한민국 공개특허공보 제 2021-0128539 호)은 복수의 스마트 미러와; 상기 적어도 하나의 스 마트 미러와 통신 가능하도록 마련되는 서버를 포함하고, 사용자가 상기 복수의 스마트 미러 가운데 적어도 하 나의 스마트 미러에서 수행한 운동의 운동 관련 정보가 상기 서버에 저장되고, 상기 복수의 스마트 미러 가운데 나머지 스마트 미러가 상기 서버에 저장되어 있는 상기 운동 관련 정보를 공유할 수 있는 운동 정보 관리 시스 템을 개시한다. 특허문헌 4(대한민국 등록특허공보 제 10-2370703 호)는 실제 사용자가 운동을 했는지 여부를 기초로 운동 수행 레벨을 평가하고 사용자들간의 순위를 산정하여 운동 경쟁 심리를 더욱 자극하고, 상위 순위에 랭크된 사용자에 게는 일정한 보상/경품을 제공하는 운동 경연 이벤트도 개최함으로써 사용자의 운동에 대한 욕구/동기를 더욱 자극하며, 사용자가 속한 그룹별로 리스트업하여 관리하는 사용자 운동 관리시스템을 개시한다. 특히, 특허문헌 4는 사용자를 일정한 기준에 따라 그룹핑하여, 각 그룹별로 운동 내역을 기록 및 관리한다. 그리고, 각 그룹별 운동 내역을 기초로 그룹별 운동 평균 시간, 그룹내에서 가장 오래한 운동 시간, 그룹내에서 가장 목표치에 가 까운 사용자, 그룹내에서 가장 높은 운동 수행 레벨의 사용자 등에 대한 정보를 획득하고, 이를 각 그룹에 속한 사용자들에게 공유할 수 있도록 한다. 또한, 각 사용자별 운동 수행 레벨을 다른 사용자의 운동 수행 레벨과 비 교하여 사용자별 운동 수행 순위를 산정하고, 운동 수행 순위 정보에서 높은 순위에 기설정된 기간동안 랭크된 사용자에 대해서는 일정한 보상을 제공하는 이벤트를 개최함으로써 사용자들의 운동에 대한 열정 및 동기를 더 욱 자극한다. 선행기술문헌 특허문헌 (특허문헌 0001) KR 2021-0076539 A (특허문헌 0002) KR 10-2360284 B1 (특허문헌 0003) KR 2021-0128539 A (특허문헌 0004) KR 10-2370703 B1"}
{"patent_id": "10-2023-0046192", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "오프라인상의 피트니스 센터나 헬스클럽을 정기적으로 방문하지 않고, 스마트 미러 장치를 이용하여 집이나 회 사에서 개인적으로 홈 트레이딩을 실행하거나 온라인을 통해 원격지의 트레이너로부터 1:1 맞춤 개인 PT(Personal training)를 받을 수 있는 다양한 기술들이 이미 개발되어 있다. 다만, 이러한 개인 홈 트레이딩의 경우 AI(인공지능)나 원격지의 전문 헬스 트레이너로부터 맞춤 PT를 통해 자 신의 운동 자세나 포즈, 모션 등에 피드백을 통한 지도를 받을 수 있지만, 꾸준하고, 규칙적으로 지속적인 트레 이닝을 실행하는데에는 사용자 개인의 강한 의지와 노력 및 인내가 필요하다. 따라서, 스마트 미러를 통한 온라인 홈 트레이닝에서도 오프라인 헬스 클럽과 같은 분위기와 환경을 조성할 필 요가 있다. 본 발명자들은 한 명의 트레이너(Trainer)를 다수의 트레이니(Trainee)와 연결하되, 다수의 트레이니(Trainee) 의 운동 레벨을 서로 달리하는 단위 등급 체인 그룹을 형성하고, 이 단위 등급 체인 그룹을 마치 온라인상의 헬스 클럽과 같이 성장시킬 수 있음을 알게 되었다. 따라서, 본 발명은 스마트 미러장치를 통해 한 명의 트레이너(Trainer)와 서로 다른 운동 레벨을 갖는 다수의 트레이니(Trainee)를 연결시킨 등급 체인 그룹을 형성하고, 이를 성장시키는 방안을 제시하는 것을 주요한 기술 적 과제로 한다."}
{"patent_id": "10-2023-0046192", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 본 발명의 제 1 양태에 따른 단위 홈 트레이닝 그룹을 성장시키는 방법은, 사용자의 운동 영상을 촬영하는 카메라와 미러 디스플레이를 포함하고, 근거리 무선통신에 의해 다수의 홈 트레 이닝 기구 및 사용자 단말장치와 접속되는 스마트 미러장치, 그리고 상기 사용자 단말장치와 통신망을 경유하여 접속되는 홈 트레이닝 관리서버에서, 상기 스마트 미러장치를 통해 사용자의 체형정보와 사용자의 포즈정보를 이용하여 사용자를 인증하는 사용자 인증단계와; 상기 인증된 사용자들의 홈 트레이닝 종목별 운동 레벨을 평가 하여 1~5 등급의 운동 등급으로 분류하고, 이를 저장하는 등급 분류 단계와; 1명의 트레이너(Tr)에 대해 1명의 5등급 사용자, 1명의 4등급 사용자, 1명의 3등급 사용자, 1명의 2등급 사용자 및 1명의 1등급 사용자를 순차적 으로 연결하여 등급 체인으로 이루어지는 단위 홈 트레이닝 그룹을 형성하는 단위 홈 트레이닝 그룹 형성단계와; 상기 인증된 모든 사용자들을 대상으로 홈 트레이닝 종목별 운동 레벨을 재평가하여 1~5 등급의 운 동 등급으로 재분류하는 운동 등급을 갱신하는 등급 갱신 단계와; 사용자들의 운동 등급이 새롭게 갱신됨에 따 라, 상기 단위 홈 트레이닝 그룹내에 운동 등급의 갱신을 통해서 등급이 승급됨에 따라 등급 체인상에 비어 있 는 등급이 존재하는지 여부를 판단하는 제 1 판단단계와; 상기 제 1 판단단계에서, 비어 있는 등급이 1등급인지 여부를 판단하는 제 2 판단단계와; 상기 제 2 판단단계에서, 비어 있는 등급이 1등급이 아닌 경우, 해당하는 등 급의 사용자를 추가 모집하여 상기 비어 있는 등급을 충원하는 등급 충원 단계와; 상기 제 2 판단단계에서, 비 어 있는 등급이 1등급인 경우 아래의 수학식에 따라 비어 있는 1등급 사용자를 m명 만큼 모집하여 상기 비어 있 는 1등급을 충원하는 1등급 충원 단계와;"}
{"patent_id": "10-2023-0046192", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "(여기서, N은 단위 홈 트레이닝 그룹의 등급 산술합이고, n과 m은 자연수이다.) 상기 단위 홈 트레이닝 그룹 형성단계 내지 상기 1등급 충원 단계를 수차례 반복하는 것에 의해 상기 단위 홈 트레이닝 그룹을 성장시키는 것을 특징으로 한다. 본 발명에 따른 다른 제 2 양태에 따른 단위 홈 트레이닝 그룹을 성장시키는 방법은, 상기 제 1 양태에 있어서, 상기 등급 분류 단계는, 상기 인증된 사용자들의 복수의 트레이닝 종목에 대해 정해진 규칙에 따라 트레이닝을 실시한 운동 데이터를 상기 스마트 미러장치를 통해 수신하고, 이 운동 데이터에 기반하여 상기 인증된 사용자 들의 운동 레벨을 1~5 등급의 운동 등급으로 분류하는 것을 특징으로 한다. 본 발명에 따른 다른 제 3 양태에 따른 단위 홈 트레이닝 그룹을 성장시키는 방법은, 상기 제 1 양태 또는 제 2 양태에 있어서, 상기 단위 홈 트레이닝 그룹 형성단계는, 다시 다수의 트레이너(Trainer)를 모집하고, 이 트레 이너(Trainer)들에 대한 정보를 이용하여 트레이너 데이터베이스를 구축하는 단계와; 상기 트레이너들에 대해 상기 단위 홈 트레이딩 그룹의 형성을 요청하는 단계와; 상기 트레이너(Tr)가 잠재적인 다수의 5등급 사용자에 게 참여를 요청하고, 요청에 응답한 다수의 5등급 사용자중 1명을 선택하여 상기 트레이너(Tr)와 1명의 5등급 트레이니(Te5)를 연결하는 것에 의해 1차 체인(Tr-Te5)을 구성하는 단계와; 상기 트레이너(Tr)가 잠재적인 다수 의 4등급 사용자에게 참여를 요청하고, 요청에 응답한 다수의 4등급 사용자중 1명을 선택하여 상기 1차 체인 (Tr-Te5)에 1명의 4등급 트레이니(Te4)를 연결하는 것에 의해 2차 체인(Tr-Te5-Te4)을 구성하는 단계와; 상기 트레이너(Tr)가 잠재적인 다수의 3등급 사용자에게 참여를 요청하고, 요청에 응답한 다수의 3등급 사용자중 1명 을 선택하여 상기 2차 체인(Tr-Te5-Te4)에 1명의 3등급 트레이니(Te3)를 연결하는 것에 의해 3차 체인(Tr-Te5- Te4-Te3)을 구성하는 단계와; 상기 트레이너(Tr)가 잠재적인 다수의 2등급 사용자에게 참여를 요청하고, 요청에 응답한 다수의 2등급 사용자중 1명을 선택하여 상기 3차 체인(Tr-Te5-Te4-Te3)에 1명의 2등급 트레이니(Te2)를 연결하는 것에 의해 4차 체인(Tr-Te5-Te4-Te3-Te2)을 구성하는 단계; 및 상기 트레이너(Tr)가 잠재적인 다수의 1등급 사용자에게 참여를 요청하고, 요청에 응답한 다수의 1등급 사용자중 1명을 선택하여 상기 4차 체인(Tr- Te5-Te4-Te3-Te2)에 1명의 1등급 트레이니(Te1)를 연결하는 것에 의해 5차 체인(Tr-Te5-Te4-Te3-Te2-Te1)을 구 성하는 단계;를 포함하는 것을 특징으로 한다. 본 발명에 따른 다른 제 4 양태에 따른 단위 홈 트레이닝 그룹을 성장시키는 방법은, 상기 제 3 양태에 있어서, 상기 트레이너(Tr)가 상기 5등급 트레이니(Te5)를 트레이닝하고, 상기 5등급 트레이니(Te5)가 상기 4등급 트레 이니(Te4)를 트레이닝하고, 상기 4등급 트레이니(Te4)가 상기 3등급 트레이니(Te3)를 트레이닝하고, 상기 3등급 트레이니(Te3)가 상기 2등급 트레이니(Te2)를 트레이닝하며, 상기 2등급 트레이니(Te2)가 상기 1등급 트레이니 (Te1)를 트레이닝하는 단계별 홈 트레이닝 단계를 더 포함하는 것을 특징으로 한다. 본 발명에 따른 다른 제 5 양태에 따른 단위 홈 트레이닝 그룹을 성장시키는 방법은, 상기 제 4 양태에 있어서, 상기 등급 갱신 단계는, 다시 미리 정해진 정기 등급 갱신 주기에 도달하게 되면, 상기 인증된 모든 사용자들에 게 정기 등급 심사의 참여를 요청하는 단계와; 상기 인증된 모든 사용자들이 테스트를 위해 정해진 복수의 트레 이닝 종목을 대상으로 정해진 규칙에 따라 홈 트레이닝을 실시하고, 그 실시 결과에 대한 운동 데이터를 상기 스마트 미러장치로부터 수신하는 단계; 및 상기 운동 데이터에 기반하여 상기 인증된 모든 사용자의 운동 레벨 을 5등급, 4등급, 3등급, 2등급, 1등급과 같이 5가지 운등 등급으로 분류하고, 이를 사용자별로 저장하는 것에 의해 운동 등급을 갱신하는 단계;를 포함하는 것을 특징으로 한다. 본 발명에 따른 다른 제 6 양태에 따른 단위 홈 트레이닝 그룹을 성장시키는 방법은, 상기 제 5 양태에 있어서, 상기 제 1 판단단계에서, 상기 단위 홈 트레이딩 그룹의 특정한 트레이니의 운동 등급이 하강하여 해당하는 등 급이 비게되면, 상기 등급 충원 단계를 실행하지 않는 것을 특징으로 한다."}
{"patent_id": "10-2023-0046192", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 스마트 미러장치를 이용하여 온라인상에 헬스 클럽을 형성함으로써 홈 트레이닝의 흥미와 참 여도를 높일 수 있다. 본 발명은 온라인상에 운동 등급별로 체인화된 단위 홈 트레이닝 그룹을 형성하고, 이 단위 홈 트레이닝 그룹간 에 성장을 위한 경쟁을 도입함으로써 온라인 홈 트레이닝을 보다 대중화하고 활성화하는데 기여한다. 또한, 본 발명은 온라인 홈 트레이딩의 장점을 살려서 오프라인상의 헬스 클럽이나 피트니스 센터에서 시도할 수 없는 운동 등급별 체인화와 더불어 단계별 트레이닝을 통해 온라인상에 가상의 헬스 클럽이나 피트니스 센터 를 수립하는데 기여한다."}
{"patent_id": "10-2023-0046192", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 실시 예를 첨부된 도면들을 참조하여 더욱 상세하게 설명한다. 본 발명의 실시 예는 여러 가지 형태로 변형할 수 있으며, 본 발명의 범위가 아래의 실시예들로 한정되는 것으로 해석되어서는 안 된다. 본 실 시예는 당업계에서 평균적인 지식을 가진 자에게 본 발명을 더욱 완전하게 설명하기 위해 제공되는 것이다. 또 한, 본 발명의 도면과 명세서에서 특정한 용어들이 사용되었으나, 이는 단지 본 발명을 설명하기 위한 목적에서 사용된 것이지 의미 한정이나 특허청구범위에 기재된 본 발명의 범위를 제한하기 위하여 사용된 것은 아니다. 그러므로 본 기술 분야의 통상의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 타 실시예가 가능하다는 점을 이해할 것이다. 따라서 본 발명의 진정한 기술적 보호범위는 첨부된 특허청구범위의 기술적 사상에 의해 정해져야 할 것이다. 이하 첨부된 도면을 참조하여 본 발명의 바람직한 실시예를 상세하게 설명하도록 한다. 첨부된 도면은 축척에 의하여 도시되지 않았으며, 각 도면의 동일한 참조 번호는 동일한 구성 요소를 지칭한다. 시스템 구성 이하의 상세한 설명은, 본 발명에 의한 스마트 미러 장치를 기반으로 하는 홈 트레이닝 시스템에 관한 것으로, 설명의 편의를 위해, 대표적인 구성으로 통신망, 스마트 미러 장치, 홈 트레이닝 관리 서버 및 사용자 단말장치를 포함하는 구성을 일 예로 들어 설명하지만, 이러한 구성이 모두 필수 구성을 의미하는 것은 아니다. 도 1은 본 발명의 바람직한 일 실시예에 따른 스마트 미러 장치를 이용한 그룹 홈 트레이닝 시스템의 구성도이 다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 그룹 홈 트레이닝 시스템은 통신망을 경유하여 스마트 미러 장치와, 홈 트레이닝 관리 서버 및 사용자 단말장치가 접속되고, 스마트 미러장치는 근거 리 무선통신에 의해 다수의 홈 트레이닝 기구(홈 트레이닝 기구 #1~#n) 및 사용자 단말장치와 접속된 다. 도 1에는 상기 스마트 미러 장치와 사용자 단말장치가 하나의 단일한 구성으로 도시되어 있지만, 이 는 도면상의 한계로 인한 것으로 본 발명에서 상기 스마트 미러 장치와 사용자 단말장치는 다수의 그 룹을 형성할 수 있을 정도로 많은 수의 스마트 미러 장치와 사용자 단말장치들이 홈 트레이닝 관리 서버와 통신망을 통해 접속된 것으로 보아야 한다. 먼저, 본 발명의 일 실시예에 따른 상기 통신망은, 스마트 미러 장치, 홈 트레이닝 관리 서버, 사용자 단말장치 간의 데이터 전송 및 정보 교환을 위한 일련의 데이터 송수신 동작을 수행할 수 있는 네 트워크 망으로, 유선 및/또는 무선과 같은 그 통신 양태를 가리지 않고 구성될 수 있다. 보다 구체적으로, 이러 한 통신망은 근거리 통신망(LAN: Local Area Network), 도시권 통신망(MAN:Metropolitan Area Network), 광역 통신망(WAN: Wide Area Network), 종합정보통신망(ISDN: Integrated Services Digital Network), 무선랜 (wireless LAN), 이동통신망(mobile communication network), 와이파이(Wireless Fidelity), 블루투스 (Bluetooth) 또는 지그비(ZigBee) 등 중에서 어느 하나이거나, 이들의 조합으로 연계되어 구성될 수 있는 다양 한 형태의 유/무선 통신망일 수 있으나, 이는 하나의 예를 들어 설명한 것으로, 본 발명이 이에 한정되는 것은 아니며, 공지된 통신기술을 제한없이 채택하여 사용할 수 있다. 바람직하게는, 월드와이드웹(WWW: World Wide Web) 서비스를 이용할 수 있는 인터넷 망일 수 있다. 상기 사용자 단말장치는 컴퓨터 장치로 구현되는 고정형 단말이거나 이동형 단말일 수 있다. 사용자 단말 장치의 예를 들면, 스마트폰(smart phone), 휴대폰, 네비게이션, 컴퓨터, 노트북, 디지털방송용 단말, PDA(Personal Digital Assistants), PMP(Portable Multimedia Player), 태블릿 PC, 콘솔 게임기, 기타 핸드헬 드 장치 등이 있다. 일례로 사용자 단말장치는 무선 또는 유선 통신 방식을 이용하여 통신망을 통해 다른 사용자 단말장치들 및/또는 홈 트레이닝 관리 서버와 통신하거나 지그비나 블루투스 또는 와이파이와 같은 근거리 무선 통신을 통해서 상기 스마트 미러 장치나 상기 홈 트레이닝 기구와 통신할 수 있다. 본 발명의 시스템에서 상기 사용자 단말장치는 전용 어플리케이션(예를 들어, 홈 트레이닝 앱)을 통해 스 마트 미러 장치나 홈 트레이닝 기구를 제어하거나 홈 트레이닝 관리 서버와 데이터를 주고 받을 수 있는 휴대형 정보통신단말인 스마트폰(smart phone)인 것이 바람직하다. 상기 스마트 미러 장치는 거울(Mirror)과 디스플레이(Display)의 결합으로 생성된 컴퓨팅 장치이다. 스마 트 미러 장치는 평소에 거울로 사용될 수 있으며, 사용자의 접근과 같은 이벤트 발생시 관련 정보를 표시 하는 디스플레이로 활용될 수 있다. 스마트 미러 장치는 디스플레이 동작을 제어하기 위한 내부 시스템을 포함하여 구현될 수 있고, 필요에 따라 인터페이스를 통해 사용자와 상호작용을 수행할 수 있다. 또한, 스마트 미러 장치는 사용자 단말장치나 홈 트레이닝 기구와 근거리 무선통신에 의해 연결되고, 홈 트레 이닝 관리 서버와는 통신망을 통해 연결된다. 도 2를 참조하면, 본 발명에 따른 스마트 미러 장치는 미러 디스플레이, 카메라, 스피커, 마이크, 프로세서, 통신부, 메모리, 입출력 인터페이스, 사용자 인터페이스 및 무게 센서 등을 포함할 수 있다. 사용자는 스마트 미러 장치의 미러 디스플레이를 통해 자신의 모습을 직접 관찰하면서 여러가지 홈 트레이닝을 수행할 수 있다. 이때, 사용자가 수행할 수 있는 홈 트레이닝의 종류는 도구에 따라서 크게 세가지 로 분류할 수 있다. 먼저, 스트레칭, 풀업, 행잉 레그레이즈, 푸쉬업, 딥스, 친업과 같은 맨몸 운동(Bare-body exercise)과, 덤벨, 바벨, 케트벨, 푸쉬업바, 벤치 프레스, 딥스, 중량밴드, 싯업보드, 줄넘기 등과 같은 운동 도구(Exercise tool)와, 헬스 자전거, 워킹 머신(트레드 밀) 등과 같은 운동 기구(Fitness equipment)이다. 상기 운동 도구(Exercise tool)와 운동 기구(Fitness equipment)에는 블루투스나 지그비와 같은 근거리 무선통 신모듈이 설치되어서 상기 스마트 미러 장치나 상기 사용자 단말장치로 근거리 통신을 이용하여 데이 터를 전송할 수 있다. 즉, 상기 운동 도구(Exercise tool)와 운동 기구(Fitness equipment)는 사용자의 운동량 (예를 들어, 시간당 줄넘기 횟수, 바벨 중량과 시간당 바벨 진동횟수, 워킹 조건과 워킹 작동상태 등)을 체킹하 고, 이렇게 체킹된 운동량 데이터를 상기 스마트 미러 장치나 상기 사용자 단말장치로 전송할 수 있 다. 이에 따라, 상기 스마트 미러 장치나 상기 사용자 단말장치는 상기 운동 도구(Exercise tool)나 운동 기구(Fitness equipment)로부터 사용자의 운동량 정보를 수신할 수 있다. 상기 홈 트레이닝 기구(홈 트레이닝 기구 #1~#n)는 상기 운동 도구(Exercise tool)나 운동 기구(Fitness equipment)를 의미하는 것으로서 사용자의 홈 트레이닝을 돕기 위한 다양한 도구 및 기기장치를 포함한다. 상기 홈 트레이닝 관리서버는 통신망을 통해 다수의 상기 사용자 단말장치와 상기 스마트 미러 장치와 접속된 상태에서 다수의 사용자를 등록/인증하고, 등록된 사용자들을 대상으로 운동레벨에 따라 체 인화된 홈 트레이닝 단위 그룹을 형성하고, 이렇게 형성된 홈 트레이닝 단위 그룹을 성장시키는 서버 사이드 컴 퓨터 시스템이다. 상기 홈 트레이닝 관리서버는 유선 또는 무선 통신 환경을 통해 적어도 하나 이상의 다른 장치와 데이터 송수신이 가능한 객체를 의미하며, 본 발명에서 상기 서버는 중계 서버, 중개 서버 및/또는 클라이언트 서 버를 더 포함할 수 있다. 또한, 상기 서버의 일예로 클라우드(Cloud) 서버, IMS(IP Multimedia Subsystem) 서버, 텔레포니 어플리케이션(Telephony Application) 서버, IM(Instant Messaging) 서버, MGCF(Media Gateway Control Function)서버, MSG(Messaging Gateway) 서버, CSCF(Call Session Control Function) 서버를 포함할 수 있으며, 상기 서버는 PC(Personal Computer), 노트북 컴퓨터, 태블릿 PC(Tablet Personal Computer) 등 데이터를 송수신할 수 있는 객체를 지칭하는 장치로 구현될 수 있다. 상기 홈 트레이닝 관리서버는 상기 사용자 단말장치 및 상기 스마트 미러장치와 통신망을 통해 통신하여 명령, 코드, 파일, 컨텐츠, 서비스 등을 제공하는 컴퓨터 장치 또는 복수의 컴퓨터 장치들로 구 현될 수 있다. 이를 위해, 홈 트레이닝 관리서버는 메모리, 하나 이상의 프로세서, 하나 이상의 프리젠테 이션 컴포넌트, 입/출력 포트, I/O 컴포넌트 및 예시적인 전원을 직접 또는 간접적으로 연결하는 버스를 포함한 다. 스마트 미러장치 본 발명에 따른 스마트 미러장치는 근거리 무선통신을 통해 사용자 단말장치와 교신하면서 사용자 단 말장치로부터 사용자의 명령을 수신하고, 사용자 단말장치로 다양한 정보를 전송한다. 또한, 스마트 미러장치는 근거리 무선통신을 통해 다양한 홈 트레이닝기구와 교신하면서 홈 트레이닝기구로부 터 운동 데이터를 수신한다. 도 2는 본 발명의 바람직한 일 실시예의 스마트 미러장치의 하드웨어 구성도이다. 먼저, 도 2를 참조하여 본 발명의 바람직한 일 실시예의 스마트 미러장치의 하드웨어 구성을 설명한다. 도 2를 참조하면, 본 실시예에 따른 스마트 미러 장치는 미러 디스플레이, 카메라, 스피커 , 마이크, 프로세서, 통신부, 메모리, 입출력 인터페이스, 사용자 인터페이스 및 무게 센서 등을 포함할 수 있다. 상기 미러 디스플레이는 자발광 소자를 포함하는 디스플레이 또는, 비자발광 소자 및 백라이트를 포함하는 디스플레이로 구현될 수 있다. 예를 들어, LCD(Liquid Crystal Display), OLED(Organic Light Emitting Diodes), LED(Light Emitting Diodes), 마이크로 LED(micro LED), Mini LED, PDP(Plasma Display Panel), QD(Quantum dot) 디스플레이, QLED(Quantum dot light-emitting diodes) 디스플레이 등과 같은 다양한 형태의 디스플레이로 구현될 수 있다. 이러한 디스플레이 내에는 a-si TFT, LTPS(low temperature poly silicon) TFT,OTFT(organic TFT) 등과 같은 형태로 구현될 수 있는 구동 회로, 백라이트 유닛 등도 함께 포함될 수 있다. 일 구현 예에 따라 미러 디스플레이는 상술한 디스플레이에 미러 필름이 추가되어 구현된다. 따라서, 미러 디 스플레이는 평상시에는 거울로서 기능하다가 이벤트 발생시 디스플레이로서 기능하게 된다. 상기 카메라는 촬영 기능을 수행할 수 있다. 카메라를 통해 객체가 촬영되면, 객체는 반도체 광학소 자(CCD; Charge Coupled Device)를 통해 전기적인 영상신호로 변환되고, 이와 같이 변환된 영상신호는 아날로그 신호처리부(미도시)에서 증폭 및 디지털신호로 변환된다. 이와 같이 변환된 디지털 신호는 디지털 신호처리부 (미도시)에서 디지털 신호 처리될 수 있다. 일 예에 따라 카메라는 미러 디스플레이 내측에 설치될 수 있으나, 반드시 이에 한정되는 것은 아니며, 스마트 미러 장치의 외부 프레임 등에 설치되는 것도 가능 하다. 구체적으로, 상기 카메라는 사용자의 운동 영상을 촬영한다. 구체적으로, 카메라는 사용자의 신체정 보, 운동상태 정보, 운동위치 정보를 획득할 수 있는 영상을 촬영한다. 여기서, 신체정보는 사용자의 신체 사이 즈 및 형상에 대한 정보를 말한다. 예를 들어, 신체정보는 키, 다리 길이, 팔 길이, 어깨 너비, 가슴 반경, 허 리 반경, 엉덩이 반경, 팔 반경 및 다리 반경, 관절의 위치 등을 포함할 수 있다. 또한, 신체정보는 사용자의 체형, 피부색, 머리 스타일 등의 정보를 더 포함할 수 있다. 한편, 사용자의 운동상태 정보는 사용자가 수행하 고 있는 운동자세에 따른 관절의 위치 및 관절의 각도 등과 관련된 정보를 말한다. 운동위치 정보는 사용자와 카메라 사이의 위치 관계 및 각도 관계와 관련된 정보를 말한다. 일 구현예에서, 상기 카메라는 사용자의 보다 정확한 정보가 담긴 영상을 획득하기 위해, 깊이 카메라 (depth camera)를 구비할 수 있다. 깊이 카메라는 사물의 깊이를 측정하는 카메라로, TOF(time-of-flight), 스 테레오 비전(stereovision), 구조화 광 패턴(structured light pattern) 방식 등을 통해 깊이 값을 포함하는 깊이 이미지 등 깊이 정보가 있는 영상을 캡쳐하도록 구성될 수 있다. 예컨대, TOF 방식은 적외선과 같은 빛이 피사체에 도달했다가 반사되어 돌아오는 시간을 측정하는 방식으로 심도를 계산하고 3D를 구현한다. 스테레오 비전 방식은 두 개의 카메라를 통해 입력 받은 영상에서 해당 피사체의 시차를 추출하는 방식으로 심도를 계산 하고 3D를 구현한다. 구조화 광 패턴방식은 패턴을 가진 빛을 피사체에 비춘 뒤, 피사체 표면에 맺힌 패턴의 변 화를 분석하는 방식으로 심도를 계산하고 3D를 구현한다. 이에 따라, 카메라는 깊이 카메라에 적용가능한 키넥트(KINECT), 라이다(Light Detection And Ranging, LiDAR), LADAR(Laser Detection And Ranging), ToF(Time of Flight), 레이저 스캐너, 레이저 레이더 등이 더 구비될 수 있다. 또한, 상기 카메라는 사용 자의 전체적인 모습을 다각도에서 촬영하기 위해 사용자의 정면 또는 측면, 상부 등에 적어도 하나 이상의 카메 라가 설치되는 방식으로 구현될 수도 있다. 상기 스피커는 각종 오디오 데이터 뿐만 아니라 각종 알림음이나 음성 메시지 등을 출력하는 구성요소일 수 있다. 스피커는 프로세서에서 처리된 디지털 음향 신호를 아날로그 음향 신호로 변환하고 증폭하 여 출력할 수 있다. 예를 들어, 스피커는 적어도 하나의 채널을 출력할 수 있는, 적어도 하나의 스피커 유 닛, D/A 컨버터, 오디오 앰프(audio amplifier) 등을 포함할 수 있다. 상기 마이크는 각종 음성이나 기타 소리를 입력받아 오디오 데이터로 변환하기 위한 구성이다. 예를 들어, 본 발명의 다양한 실시예에 따른 UI 화면 상에서 입력되는 사용자 명령, 홈 트레이닝 모드 진입 명령 등 다양한 사용자 명령이 음성 명령 형태로 입력될 수도 있다. 상기 프로세서는 메모리와 연결되어 스마트 미러 장치의 전반적인 동작을 제어한다. 프로세서 는 하나 또는 복수의 프로세서로 구성될 수 있다. 일 실시 예에 따라 프로세서는 디지털 영상 신호를 처리하는 디지털 시그널 프로세서(digital signal processor(DSP), 마이크로 프로세서(microprocessor), GPU(Graphics Processing Unit), AI(Artificial Intelligence) 프로세서, NPU (Neural Processing Unit), TCON(Time controller)으로 구현될 수 있다. 다만, 이에 한정되는 것은 아니며, 중앙처리장치(central processing unit(CPU)), MCU(Micro Controller Unit), MPU(micro processing unit), 컨트롤러(controller), 어플리케이션 프로세서(application processor(AP)), 또는 커뮤니케이션 프로세서(communication processor(CP)), ARM 프로세서 중 하나 또는 그 이상을 포함하거나, 해당 용어로 정의될 수 있다. 프로세서 는 UI 화면을 디스플레이하도록 미러 디스플레이를 제어할 수 있다. 여기서, UI 화면은 이미지, 동영 상, 텍스트, 음악 등과 같은 다양한 컨텐츠 재생 화면, 다양한 컨텐츠를 포함하는 어플리케이션 실행 화면, 웹 브라우저 화면, GUI(Graphic User Interface) 화면 등을 포함할 수 있다. 여기서, UI 화면은 사용자와 인터페이 스를 위한 구성으로, 사용자의 입력을 수신하기 위한 입력 인터페이스 및 사용자 입력에 따른 정보(예를 들어 제어 정보)를 표시하는 출력 인터페이스를 포함할 수 있다. 프로세서는 마이크를 통해 수신된 사용자음성 명령을 분석하여 사용자의 명령을 실행하도록 동작할 수 있다. 일 실시 예에 따라 프로세서는 카메라 를 통해 사용자를 촬영한 이미지를 획득하고, 획득된 사용자 이미지를 디스플레이하도록 미러 디스플레이 를 제어할 수 있다. 예를 들어 프로세서는 사용자를 촬영한 이미지를 그대로 디스플레이하거나, 사용 자를 촬영한 이미지를 분석하여 획득된 이미지를 디스플레이할 수 있다. 여기서, 분석은 사용자의 체형 분석, 체지방율 분석, 모션 분석, 동작 분석 등을 포함할 수 있다. 또한, 프로세서는 획득된 사용자 이미지에 기 초하여 사용자의 운동 자세를 분석하고, 분석된 운동 자세에 기초하여 사용자의 운동 자세를 교정하기 위한 가 이드 정보를 출력하도록 스피커 및 미러 디스플레이중 적어도 하나를 제어할 수 있다. 예를 들어 사용자가 스쿼트 자세를 취하는 경우 해당 자세를 교정하기 위한 음성 가이드를 출력하도록 스피커 를 제어하거나, 해당 자세를 교정하기 위한 텍스트 가이드, 이미지 가이드 등을 출력하도록 미러 디스플레 이를 제어할 수 있다. 일 실시예에 따라, 프로세서는 사용자의 운동을 통해 획득된 운동 데이터를 홈 트레이닝 관리서버로 전송하도록 통신부를 제어할 수 있다. 이 경우, 홈 트레이닝 관리서버는 사용자 계정에 대응되는 데이터베이스에 사용자의 운동 데이터를 저장하고 관리할 수 있다. 또한, 프로세서 는 홈 트레이닝관리서버로부터 수신된 다른 사용자들의 운동 데이터를 출력하도록 미러 디스플레이 및 스피커 중 적어도 하나를 제어할 수 있다. 일 실시예에 따라 스마트 미러장치는 미러 디스플레이 하단에 구비된 무게 센서를 더 포함하거 나, 무게 센서와 통신을 수행할 수 있다. 예를 들어, 스마트 미러장치는 무게 센서와 블루투스, 와이파이 등의 통신 방식에 따라 통신을 수행할 수 있다. 프로세서는 기설정된 이벤트에 따라 사용자의 몸 무게를 측정하도록 무게 센서를 제어하며, 무게 센서를 통해 측정된 사용자의 몸무게 정보를 메모리 에 저장할 수 있다. 상기 통신부는 홈 트레이닝 관리서버와 통신을 수행한다. 통신부는 와이 파이(Wi-Fi) 지그비 (zigbee), 3G(3rd Generation), 3GPP(3rd Generation Partnership Project), LTE(Long Term Evolution), LTE- A(LTE Advanced), 4G(4th Generation), 5G(5th Generation)등과 같은 다양한 무선 통신 규격에 따라 홈 트레이 닝 관리서버와 통신을 수행하는 것이 바람직하다. 또한, 상기 통신부는 사용자 단말장치 및/또 는 홈 트레이닝기구와 근거리 무선통신을 수행하기 위한 근거리 무선통신모듈을 더 포함할 수 있다. 이러 한 근거리 무선통신 프로토콜로는 블루투스, 지그비, 와이파이, 무선랜 등이 포함된다. 상기 메모리는 본 발명에 따른 다양한 실시예를 위해 필요한 데이터를 저장할 수 있다. 메모리는 휘 발성 메모리(예: DRAM(dynamic RAM), SRAM(static RAM), 또는 SDRAM(synchronous dynamic RAM) 등), 비휘발성 메모리(non-volatile Memory)(예: OTPROM(one time programmable ROM), PROM(programmable ROM), EPROM(erasable and programmable ROM), EEPROM(electrically erasable and programmable ROM), mask ROM, flash ROM, 플래시 메모리(예: NAND flash 또는 NOR flash 등), 하드 드라이브, 또는 솔리드 스테이트 드라이 브(solid state drive(SSD)) 중 적어도 하나로 구현될 수 있다. 일 실시예에 따라 메모리는 스마트 미러장 치를 구동/제어하기 위한 다양한 데이터, 프로그램 또는 어플리케이션을 저장할 수 있다. 메모리는 스마트 미러장치의 제어를 위한 제어 프로그램, 제조사에서 최초 제공되거나 외부에서부터 다운로드 받은 어플리케이션, 데이터베이스들 또는 관련 데이터들을 저장할 수 있다. 또한, 메모리는 스마트 미러장치 를 구동하기 위한 다양한 소프트웨어 모듈들을 저장한다. 상기 사용자 인터페이스는 버튼, 터치 패드, 마우스 및 키보드와 같은 장치로 구현되거나, 상술한 디스플 레이 기능 및 조작 입력 기능도 함께 수행 가능한 터치 스크린, 리모콘 송수신부 등으로 구현될 수 있다. 리모 콘 송수신부는 적외선 통신, 블루투스 통신 또는 와이파이 통신 중 적어도 하나의 통신 방식을 통해 외부 원격 제어장치(예를 들어, 전용 리모콘이나 사용자 단말장치)로부터 리모콘 신호를 수신하거나, 리모콘 신호를 송신 할 수 있다. 상기 입출력 인터페이스는 HDMI(High-Definition Multimedia Interface), MHL(Mobile High-Definition Link), USB(Universal Serial Bus), DP(Display Port), 썬더볼트(Thunderbolt), VGA(Video Graphics Array)포 트, RGB 포트, D-SUB(D-subminiature), DVI(Digital Visual Interface) 중 어느 하나의 인터페이스일 수 있다. 입출력 인터페이스는 오디오 및 비디오 신호 중 적어도 하나를 입출력 할 수 있다. 홈 트레이닝 관리서버 도 3은 본 발명의 바람직한 일 실시예에 따른 홈 트레이닝 관리서버의 하드웨어 구성도이다. 도 3을 참조하면, 본 발명의 홈 트레이닝 관리서버는 메모리와, 여기에 연결되어 고속 동작을 수행하 는 적어도 하나 이상의 CPU(Central Processing Unit; 360), 입력 장치 및 출력 장치를 포함할 수 있다. 여기에서, 상기 입력 장치는 마우스나 터치 스크린과 같이 사용자의 조작이나 터치를 인식할 수 있는 장치 일 수 있지만, 마이크로폰과 같은 물리적 변환기(Physical transducer) 등도 포함될 수 있다. 상기 출력 장치 는 발광다이오드(LED; Light Emitting Diode)나 액정표시장치(LCD; Liquid Crystal Display), 전자 잉크 (e-ink)와 같이 문자나 이미지를 표시할 수 있는 디스플레이를 의미하지만, 스피커와 같은 변환기(transducer) 도 포함될 수 있다. 상기 CPU는 홈 트레이닝 관리서버에 내장되어 전체적인 동작을 처리하는 기능을 수행하는 프로세서이 다. CPU에는 계산을 수행하기 위한 ALU(Arithmetic Logic Unit: 362)와, 데이터 및 명령어의 일시적인 저 장을 위한 레지스터 및 홈 트레이닝관리서버의 동작을 제어하기 위한 컨트롤러로 이루어질 수 있다. 상기 메모리는 일반적으로 RAM(Random Access Memory)과 ROM(Read Only Memory) 같은 저장 매체 형태인 고속의 메인 메모리와, 플래시 메모리 등의 보조 메모리 및 전기, 자기, 광학이나 그 밖의 저장 매체 를 이용하여 데이터를 저장하는 장치를 포함할 수 있다. 또한, 메인 메모리는 출력 장치를 통하여 이 미지를 디스플레이 하는 비디오 디스플레이 메모리를 포함할 수 있다. 본 발명의 기술 분야에서 통상의 지식을 가진 당업자에게는 상기 메모리가 여러 가지 저장 성능을 구비하는 제품으로서, 여러 가지 형태를 가질 수 있다는 것이 자명할 것이다. 또한, 본 발명의 기술 분야에 있어서, 홈 트레이닝 관리서버는 OS(Operating System) 및 적어도 하나의 응 용 프로그램을 포함할 수 있다. OS는 홈 트레이닝 관리서버의 동작 및 리소스의 지정을 제어하는 소프트웨 어 집합이다. 응용 프로그램은 OS를 통하여 이용 가능한 컴퓨터 리소스를 사용함으로써, 사용자가 요청한 업무 를 수행하기 위한 소프트웨어 집합이다. 상기 OS 및 응용 프로그램은 메모리에 상주될 것이다. 컴퓨터 프 로그래밍의 기술 분야에서 통상의 지식을 가진 당업자의 경험에 따라, 다른 표현으로 기술되지 않으면, 본 발명 은 게임 제공 서버에 의해 수행되는 동작 및 동작에 대한 표현 기호에 따라 기술될 것이다. 이러한 동작은 컴퓨터 기반으로 이루어지며, OS 또는 적당한 응용 프로그램에 의하여 수행될 것이다. 또한, 이러한 동작 및 기 능은 전기 신호의 변환 또는 차단을 유발하는 데이터 비트 등의 전기 신호에 대한 CPU의 처리와, 홈 트레 이닝 관리서버의 동작을 변경할 뿐만 아니라 메모리내에 저장된 데이터 비트 신호에 대한 관리를 포 함한다. 데이터 비트 신호가 관리되는 메모리 영역은 데이터 비트에 해당하는 전기, 자기 또는 광학 특성을 갖 는 물리 영역이다. 도 3에 도시된 다이어그램은 단지 본 발명의 하나 이상의 실시예에 관련하여 사용될 수 있는 예시적인 컴퓨팅 장치의 도시일 뿐이다. \"워크스테이션\", \"서버\", \"랩탑\" 등과 같은 카테고리들은 모두 도 3의 범주 내에서 고려 되며 \"컴퓨팅 장치\"로 참조되기 때문에, 이들 사이에 구분을 짓지 않는다. 컴퓨팅 장치는 통상적으로 각종 컴퓨터 판독가능 매체를 포함한다. 컴퓨팅 판독가능 매체는 컴퓨팅 장치가 액세 스할 수 있는 사용가능한 임의의 매체일 수 있으며, 컴퓨터 판독가능 인스트럭션, 데이터 구조, 프로그램 모듈 또는 그 밖의 데이터 등의 정보를 저장하기 위한 임의의 방법 또는 기술로 구현되는 휘발성 및 비휘발성 매체, 이동식 및 비이동식 매체를 포함한다. 컴퓨터 판독가능 매체는 RAM, ROM, EEPROM, 플래시 메모리 또는 기타 메 모리 기술, CD-ROM, DVD(digital versatile disk) 또는 기타 광 디스크 저장 장치, 자기 카세트, 자기 테이프, 자기 디스크 저장 장치 또는 기타 자기 저장 장치, 또는 원하는 정보를 저장하는데 사용되고 컴퓨팅 장치가 액 세스 가능한 임의의 기타 매체를 포함할 수 있지만, 이에 제한되는 것은 아니다. 상기의 임의의 조합 또한 컴퓨 터 판독가능 매체의 범주 내에 포함된다. 온라인 홈 트레이닝 그룹의 헬스 클럽화 도 4 내지 도 6은 본 발명에 따른 상기 시스템에 기반하여 단위 홈 트레이닝 그룹을 형성하고, 이를 성장시 켜 온라인상의 헬스 클럽화시키는 방법을 설명하는 플로우차트이다. 즉, 본 발명은 스마트 미러장치와 사 용자 단말장치를 이용하여 사용자를 등록/인증하고, 등록된 사용자들을 운동 레벨에 따라 차례로 순차적으 로 연결하는 것에 의해 운동등급에 따라 연속적으로 체인화된 단위 홈 트레이닝 그룹을 형성하고, 이 단위 홈 트레이닝 그룹을 성장시켜서 온라인상의 헬스 클럽이나 피트니스 센터화시킨다. 상기 \"단위 홈 트레이닝 그룹\"은 한 명의 트레이너(Trainer)와 여러명의 트레이니(Trainee)가 운동 레벨에 따라 순차적으로 연결되어 하나의 체인(Chain)을 형성하고 있는 최소 단위를 의미한다. 즉, 상기 단위 홈 트레이닝그룹은 한 명의 트레이너 밑에 운동 레벨에 따라 여러명의 트레이니가 운동 등급에 따라 내림차순으로 연결되는 하나의 체인을 형성하게 된다. 예를 들어, 사용자의 운동 레벨을 1등급-2등급-3등급-4등급-5등급과 같이 총 5등 급을 나누게 되면, 하나의 단위 홈 트레이닝 그룹은 \"트레이너-5등급 트레이니-4등급 트레이니-3등급 트레이니- 2등급 트레이니-1등급 트레이니\"가 체인처럼 연결되어 형성된다. 이로 인해, 복수의 단위 홈 트레이닝 그룹을 형성하게 되면, 단위 그룹을 형성하는 멤버들은 상이하지만, 그 형태는 동일하게 된다. 1. 사용자 등록 및 인증(S100) 본 발명에 따른 상기 단위 홈 트레이닝 그룹에 참여하고자 하는 사용자는 먼저 사용자 단말장치나 스마트 미러장치를 통해 사용자 등록 절차를 수행한다. 즉, 사용자는 사용자 단말장치를 이용하여 홈 트레이 닝 관리서버에 접속하고, \"홈 트레이닝 앱\"(APP)을 다운로드 받아 설치한다. 그리고, 홈 트레이닝앱을 통 해 사용자의 인적사항(성명, 주민번호, 나이, 성별, 전화번호, 이메일, 주소 등)과 신체정보(키, 몸무게 등) 및 인증정보(아이디, 패스워드)를 등록한다. 그리고, 사용자는 스마트 미러장치를 통해 체형정보와 포즈정보 를 등록할 수 있다. 여기서, 체형정보는 사용자의 골격 구조를 의미하는 것으로서 \"i) 한 쪽 팔의 어깨 지점과 팔꿈치 지점 사이의 길이, ii) 한 쪽 팔의 어깨 지점과 팔꿈치 지점 사이의 길이 및 한 쪽 발의 무릎 지점과 발 목 지점의 길이(2개의 관절 길이), iii) 한 쪽 팔의 어깨 지점과 무릎치 지점 사이의 길이에 대한 팔꿈치 지점 과 손목 사이의 길이 비율, iv) 한 쪽 팔의 어깨 지점과 팔꿈치 지점 사이의 길이에 대한 한 쪽 발의 무릎 지점 과 발목 지점의 길이의 비율, v) 사람이 서 있는 자세에서 한쪽 발의 엉덩이 지점과 무릎 지점을 잇는 직선과 무릎 지점과 발목 지점을 잇는 직선의 각도 등\"을 포함한다. 또한, 상기 포즈정보는 사용자를 특징짓는 특정한 모션이나 동작이나 포즈를 의미하는 것이다. 이러한 체형정보와 포즈정보는 대한민국 등록특허공보 제 10-1639161 호와 같이 스마트 미러장치를 통해 1 차 인증(기본 골격 구조에 기반한 사용자 인증)과 2차 인증(사용자 동작에 기반한 사용자 인증)을 통해 사용자 를 인증하기 위해 사용된다. 따라서, 사용자는 사용자 단말장치의 홈 트레이닝 앱을 이용하여 사용자 인증(아이디와 패스워드 입력)을 수행하거나 스마트 미러장치를 통해 1차 인증(기본 골격 구조에 기반한 사용자 인증)과 2차 인증(사용자 동작에 기반한 사용자 인증)을 거치는 것에 의해 사용자 인증을 수행할 수 있다. 특히, 사용자는 스마트 미러장 치의 거울을 통해 기본자세(1차 인증)를 취하거나 등록된 특징적인 포즈(또는 모션이나 동작)(2차 인증)를 취하는 것만으로 간편하게 사용자 인증을 수행할 수 있다. 2. 사용자 운동 레벨의 분류(S200) 사용자 등록을 마친 사용자들은 사용자들의 운동 레벨(또는 운동 등급)을 결정하기 위한 운동 레벨 테스트 과정 을 거쳐야 한다. 즉, 사용자들은 단위 홈 트레이닝 그룹에 참여하기 위해 필요한 사용자의 운동 등급을 결정하 기 위하여 복수의 트레이닝 종목(예를 들어, 푸쉬업, 워킹, 자전거 타기 등)을 대상으로 하는 종목별 테스트 과 정에 참가한다. 즉, 홈 트레이닝 관리서버에 상기 트레이닝 종목(예를 들어, 푸쉬업, 워킹, 자전거 타기 등)에 대해 정해진 규칙에 따라 정해진 시간동안 트레이닝을 실시하고, 실시 결과에 대한 운동 데이터를 스마트 미러장치나 사용자 단말장치를 통해 홈 트레이닝 관리서버에 업로드하여 저장한다. 홈 트레이닝 관리서버는 데이터베이스에 저장된 사용자들의 상기 트레이닝 종목에 대한 운동 데이터들을 불러들여 사용자의 종합적인 홈 트레이닝 능력을 평가하고, 이 평가에 기반하여 사용자의 운동 레벨을 5등급, 4 등급, 3등급, 2등급, 1등급과 같이 5가지 레벨로 분류하고, 이를 사용자별로 저장하는 것에 의해 사용자의 운동 등급을 분류한다. 여기서, 운동 등급은 등급이 높을 수록 운동 레벨이 높다. 즉, 5등급 사용자의 운동 레벨이 가장 높고, 1등급 사용자의 운동 레벨이 가장 낮다. 4. 단위 홈 트레이닝 그룹 형성(S300) 홈 트레이닝 관리서버는 사용자들을 훈련하고 지도하기 위한 다수의 트레이너(Trainer)를 모집하고, 이 트 레이너(Trainer)들에 대한 정보를 이용하여 트레이너 데이터베이스를 구축한다. 그리고, 각 트레이너들로 하여금 아래와 같은 구조의 단위 홈 트레이닝 그룹의 형성을 요청한다. 여기서, 단위 홈 트레이닝 그룹은 한 명의 트레이너(Tr)와 한 명의 5등급 트레이니(Te5), 한 명의 4등급 트레이니(Te4), 한 명의 3등급 트레이니(Te3), 한 명의 2등급 트레이니(Te2), 한 명의 1등급 트레이니(Te1)를 순차적으로 연결해서 이루어지는 등급 체인 그룹(Tr-Te5-Te4-Te3-Te2-Te1)이다. 즉, 상기 단위 홈 트레이닝 그룹은 한 명의 트레이너에게 지도를 받는 다수의 트레이니들을 포함하는 홈 트레이 닝 그룹으로서, 상기 다수의 트레이니들은 운동 레벨이 5등급 내지 1등급에 해당하는 사용자를 각 등급별로 한 명씩 선택하여 최고 등급(5등급)에서 최하 등급(1등급)으로 체인 처럼 연결한 등급 체인 그룹(Tr-Te5-Te4-Te3- Te2-Te1)이다. 따라서, 상기 단위 홈 트레이닝 그룹에는 각 등급별로 단 한명의 사용자만이 존재한다. 이렇게 서로 다른 운동 레벨을 갖는 사용자들을 그 등급에 따라 한 명의 트레이너 밑에 연속적으로 연결하여 체 인을 형성하는 본 발명의 단위 홈 트레이닝 그룹은 트레이너가 최고 등급인 5등급 트레이니를 지도하고, 5등급 트레이니가 4등급 트레이니를 지도하고, 4등급 트레이니가 3등급 트레이니를 지도하고, 3등급 트레이니가 2등급 트레이니를 지도하며, 2등급 트레이니가 1등급 트레이니를 지도하는 체계를 이룰 수 있다. 그리고, 이러한 단위 홈 트레이닝 그룹을 성장, 확대시키는 것에 의해 한 명의 트레이너에 대해 여러 운동 등급을 갖는 다수의 사용 자를 피라미드식으로 묶는 온라인상의 홈 트레이닝 체인그룹으로 성장시킬 수 있고, 이는 마치 온라인상의 가상 헬스 클럽이나 피트니스 센터와 같은 기능과 역할을 가지게 된다. 이하, 도 5를 참조하여 상술한 단위 홈 트레이닝 그룹을 형성하는 과정을 상세히 설명한다. 상기 단위 홈 트레이닝 그룹을 형성하고자 하는 트레이너(Trainer)는 자신의 프로필과 비젼을 온라인상에 공지 한다. 이때, 상기 트레이너(Trainer)의 공지를 확인한 운동레벨 5등급의 사용자는 마음에 드는 프로필과 비젼을 갖는 트레이너와의 연결을 요청한다. 적어도 하나 이상의 5등급 사용자의 연결 요청을 수신한 상기 트레이너는 상기 5등급 사용자의 프로필을 확인한 후 마음에 드는 5등급 사용자를 선택하는 것에 의해 1명의 트레이너(Tr) 와 1명의 5등급 트레이니(Te5)를 연결하는 1차 체인(Tr-Te5)을 구성한다(S310). 이렇게 형성된 상기 1차 체인(Tr-Te5)이 4등급 사용자의 연결을 위해 온라인상에 공지된다. 상기 1차 체인(Tr- Te5)의 공지를 확인한 다수의 4등급 사용자는 마음에 드는 프로필과 비젼을 갖는 1차 체인(Tr-Te5)과의 연결을 요청한다. 적어도 하나 이상의 4등급 사용자의 연결 요청을 수신한 상기 1차 체인(Tr-Te5)의 트레이너는 상기 4 등급 사용자의 프로필을 확인한 후 마음에 드는 4등급 사용자를 선택하는 것에 의해 1명의 트레이너(Tr)와 1명 의 5등급 트레이니(Te5), 1명의 4등급 트레이니(Te4)를 순차적으로 연결하는 2차 체인(Tr-Te5-Te4)을 구성한다 (S320). 이렇게 형성된 상기 2차 체인(Tr-Te5-Te4)이 3등급 사용자의 연결을 위해 온라인상에 공지된다. 상기 2차 체인 (Tr-Te5-Te4)의 공지를 확인한 다수의 3등급 사용자는 마음에 드는 프로필과 비젼을 갖는 2차 체인(Tr-Te5- Te4)과의 연결을 요청한다. 적어도 하나 이상의 3등급 사용자의 연결 요청을 수신한 상기 2차 체인(Tr-Te5- Te4)의 트레이너(Tr)는 상기 3등급 사용자의 프로필을 확인한 후 마음에 드는 3등급 사용자를 선택하는 것에 의 해 1명의 트레이너(Tr)와 1명의 5등급 트레이니(Te5), 1명의 4등급 트레이니(Te4), 1명의 3등급 트레이니(Te3) 를 순차적으로 연결하는 3차 체인(Tr-Te5-Te4-Te3)을 구성한다(S330). 이렇게 형성된 상기 3차 체인(Tr-Te5-Te4-Te3)이 2등급 사용자의 연결을 위해 온라인상에 공지된다. 상기 3차 체인(Tr-Te5-Te4-Te3)의 공지를 확인한 다수의 2등급 사용자는 마음에 드는 프로필과 비젼을 갖는 3차 체인(Tr- Te5-Te4-Te3)과의 연결을 요청한다. 적어도 하나 이상의 2등급 사용자의 연결 요청을 수신한 상기 3차 체인(Tr- Te5-Te4-Te3)의 트레이너(Tr)는 상기 2등급 사용자의 프로필을 확인한 후 마음에 드는 2등급 사용자를 선택하는 것에 의해 1명의 트레이너(Tr)와 1명의 5등급 트레이니(Te5), 1명의 4등급 트레이니(Te4), 1명의 3등급 트레이 니(Te3), 1명의 2등급 트레이니(Te2)를 순차적으로 연결하는 4차 체인(Tr-Te5-Te4-Te3-Te2)을 구성한다(S340). 이렇게 형성된 상기 4차 체인(Tr-Te5-Te4-Te3-Te2)이 1등급 사용자의 연결을 위해 온라인상에 공지된다. 상기 4 차 체인(Tr-Te5-Te4-Te3-Te2)의 공지를 확인한 다수의 1등급 사용자는 마음에 드는 프로필과 비젼을 갖는 4차 체인(Tr-Te5-Te4-Te3-Te2)과의 연결을 요청한다. 적어도 하나 이상의 1등급 사용자의 연결 요청을 수신한 상기 4차 체인(Tr-Te5-Te4-Te3-Te2)의 트레이너(Tr)는 상기 1등급 사용자의 프로필을 확인한 후 마음에 드는 1등급 사용자를 선택하는 것에 의해 1명의 트레이너(Tr)와 1명의 5등급 트레이니(Te5), 1명의 4등급 트레이니(Te4), 1 명의 3등급 트레이니(Te3), 1명의 2등급 트레이니(Te2) 및 1명의 1등급 트레이니(Te1)를 순차적으로 연결하는 5 차 체인(Tr-Te5-Te4-Te3-Te2-Te1)을 구성한다(S350). 온라인상에 자신만의 헬스 클럽을 구성하고자 하는 다수의 트레이너들이 상술한 과정을 통해서 각각의 5차 체인 (Tr-Te5-Te4-Te3-Te2-Te1)을 형성함으로써 다수의 트레이너별 단위 홈 트레이닝 그룹이 형성된다(S360). 4. 단위 홈 트레이닝 그룹의 성장(S500) 상기 다수의 단위 홈 트레이닝 그룹들은 도 6과 같은 단위 홈 트레이닝 그룹 의 성장 과정을 수차례 반복하는 것에 의해 한 명의 트레이너(Trainer) 밑에 서로 다른 등급을 가지는 여러명의 사용자들이 피라미드식으로 연결되는 온라인상의 헬스 클럽이나 피트니스 센터를 구성할 수 있게 된다. 이렇게 확대된 단위 홈 트레이닝 그룹(이하, \"홈 트레이닝 체인그룹\"으로 약칭)은 트레이너에게 하나의 헬스 클 럽을 운영하는 것과 같은 온라인상의 경제적 수익 모델을 제공하고, 사용자들에게는 저렴한 비용으로 헬스 클럽 에 가입하여 전문적인 홈 트레이닝을 받을 수 있는 기회를 제공하게 된다. 따라서, 본 발명의 방법은 스마트 미 러장치를 이용하는 온라인 홈 트레이닝에 새로운 경제적 수익 모델을 제안함으로써 온라인 홈 트레이닝의 저변 을 확대하는데 기여한다. 이하, 도 6을 참조하여 상기 단위 홈 트레이닝 그룹을 온라인상의 헬스 클럽과 같이 확대, 성장시키는 과정을 상세히 설명한다. 상기 단위 홈 트레이닝 그룹(Tr-Te5-Te4-Te3-Te2-Te1)을 구성한 트레이너(Tr)가 5등급 사용자를 트레이닝하고, 5등급 사용자가 4등급 사용자를 트레이닝하고, 4등급 사용자가 3등급 사용자를 트레이닝하고, 3등급 사용자가 2 등급 사용자를 트레이닝하며, 2등급 사용자가 1등급 사용자를 트레이닝하는 것과 같이 효율적인 그룹내 훈련을 통해 단위 홈 트레이닝 그룹(Tr-Te5-Te4-Te3-Te2-Te1)의 구성원들을 단계별로 홈 트레이닝시킨다(S410). 물론, 상기 트레이너(Tr)는 그룹 구성원 전체를 대상으로 하는 단체 훈련이나 1등급 내지 5등급 사용자 각각에 대한 개별 훈련 지도 등을 병행할 수도 있다. 이러한 단위 홈 트레이닝 그룹별 트레이닝을 진행하는 상태에서 미리 정해진 정기 등급 갱신 주기에 도달하게 되면(S420), 홈 트레이닝 관리서버는 모든 사용자들에게 정기 등급 심사의 참여를 요청한다. 이에 따라, 사용자들은 운동 레벨에 대한 정기 등급 심사에 참여한다. 즉, 사용자들은 자신의 운동 등급을 갱신하기 위하여 복수의 트레이닝 종목(예를 들어, 푸쉬업, 워킹, 자전거 타기 등)을 대상으로 하는 종목별 테스트 과정에 참가 한다. 즉, 홈 트레이닝 관리서버에 상기 트레이닝 종목(예를 들어, 푸쉬업, 워킹, 자전거 타기 등)에 대해 정해진 규칙에 따라 정해진 시간동안 트레이닝을 실시하고, 그 실시 결과에 대한 운동 데이터를 홈 트레이닝 관 리서버에 업로드하여 저장한다. 그리고, 홈 트레이닝 관리서버는 데이터베이스에 저장된 사용자들의 상기 트레이닝 종목에 대한 운동 데이 터들을 불러들여 사용자의 종합적인 홈 트레이닝 능력을 평가하고, 이 평가에 기반하여 사용자의 운동 레벨을 5 등급, 4등급, 3등급, 2등급, 1등급과 같이 5가지 레벨로 분류하고, 이를 사용자별로 저장하는 것에 의해 사용자 의 운동 등급을 새롭게 갱신한다(S430). 사용자들의 운동 등급이 새롭게 갱신됨에 따라, 홈 트레이닝 관리서버는 단위 홈 트레이닝 그룹내에 운동 등급의 갱신을 통해서 등급이 승급됨에 따라 등급 체인상에 비어 있는 등급이 존재하는지 여부를 확인한다 (S510). 이때, 단위 홈 트레이닝 그룹내에 비어 있는 등급이 존재하는 경우, 이 비어 있는 등급이 1등급인지 여 부를 확인한다(S520). 만약, 비어 있는 등급이 1등급이 아닌 경우, 홈 트레이닝 관리서버는 비어 있는 등급에 다른 사용자를 채 우기 위해서 해당 단위 홈 트레이닝 그룹의 비어 있는 등급(예를 들어, 3등급)에 새로운 사용자를 모집하는 공 지를 한다. 이러한 모집 공지를 확인한 다수의 다른 3등급 사용자는 상기 단위 홈 트레이닝 그룹에 참여를 요청 한다. 이러한 참여 요청을 확인한 상기 단위 홈 트레이닝 그룹의 트레이너(Tr)는 상기 적어도 하나 이상의 참여 요청중 마음에 드는 3등급 사용자를 선택한다. 이에 따라, 상기 단위 홈 트레이닝 그룹은 새로운 3등급 사용자 를 충원하게 된다(S530). 한편, 상기 S520에서 비어 있는 등급이 1등급인 경우, 홈 트레이닝 관리서버는 아래의 [수학식 1]에 따라 모집할 1등급 사용자의 숫자 m을 계산한다. 수학식 1"}
{"patent_id": "10-2023-0046192", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기서, N은 현재 단위 홈 트레이닝 그룹의 등급 합이고, n과 m은 자연수이다. 만약, 특정 단위 홈 트레이닝 그룹이 5등급 사용자 5명, 4등급 사용자 3명, 3등급 사용자 7명, 2등급 사용자 12 명인 상태에서 1등급이 비어 있는 상태라면, N=82이고, N/15=5.46이므로 n은 5이고, m은 6이 된다. 그러므로,상기 [수학식 1]에 따라 새로 모집할 1등급 사용자의 숫자는 m=6명이 된다. 상기 [수학식 1]에 따라 비어 있는 1등급을 채울 새로운 사용자의 수(m)를 계산한 홈 트레이닝 관리서버는 비어 있는 1등급에 다른 사용자를 채우기 위해서 새로운 1등급 사용자 m명을 모집하는 공지를 한다. 이러한 모 집 공지를 확인한 다수의 다른 1등급 사용자는 상기 단위 홈 트레이닝 그룹에 참여를 요청한다. 이러한 참여 요 청을 확인한 상기 단위 홈 트레이닝 그룹의 트레이너(Tr)는 상기 적어도 하나 이상의 참여 요청중 마음에 드는 1등급 사용자 m명을 선택한다. 이에 따라, 상기 단위 홈 트레이닝 그룹은 새로운 1등급 사용자 m명을 충원하게 된다(S540). 한편, 상기 S510에서 사용자의 운동 등급 갱신을 통해서 사용자의 운동 등급이 하강하여 등급 체인의 특정 등급 (예를 들어, 4등급이 3등급으로 강등되어 4등급이 비게 되는 경우)이 비게 되는 경우에는 상기 S510 내지 S540 의 등급 모집과 충원 과정은 이루어지지 않는다. 상술한 S410 내지 S540의 과정을 수차례 반복하는 것에 의해 상기 단위 홈 트레이닝 그룹은 한 명의 트레이너에 대해 서로 다른 운동 등급을 갖는 다수의 사용자가 피라미드식으로 연결되는 홈 트레이닝 체인그룹으로 성장하 게 된다. 따라서, 이렇게 확대 성장한 홈 트레이닝 체인그룹은 온라인상에서 마치 헬스 클럽이나 피트니스 클럽 과 같은 기능과 역할을 할 수 있게 된다. 또한, 단위 홈 트레이닝 그룹중 트레이너의 불성실이나 상기 단계별 트레이닝의 부족 등으로 운동 등급이 승급 되는 트레이니가 없거나 오히려 운동 등급이 하락하는 트레이니가 발생하게 되면, 해당 단위 홈 트레이닝 그룹 은 상기 S410 내지 S540의 과정을 통해 새로운 사용자의 모집과 충원이 이루어지지 않게 되어 단위 홈 트레이닝 그룹의 성장이 멈추게 된다. 따라서, 성실하고, 능력있는 트레이너의 지도를 받는 단위 홈 트레이닝 그룹과 그렇지 않은 단위 홈 트레이닝 그룹간에 시간이 지남감에 따라 그룹의 규모가 현격히 차이가 나게 된다. 또한, 상위 등급의 사용자가 하위 등 급의 사용자를 지도하는 단계별 트레이닝이 활성화된 단위 홈 트레이닝 그룹과 그렇지 않은 단위 홈 트레이닝 그룹간에도 시간이 지남감에 따라 그룹의 규모가 현격히 차이가 나게 된다. 이와 같이, 본 발명은 온라인상에 운동 등급별로 체인화된 단위 홈 트레이닝 그룹을 형성하고, 이 단위 홈 트레 이닝 그룹간에 성장을 위한 경쟁을 도입함으로써 온라인 홈 트레이닝을 보다 대중화하고 활성화하는데 기여한다. 또한, 본 발명은 온라인 홈 트레이딩의 장점을 살려서 오프라인상의 헬스 클럽이나 피트니스 센터에 서 시도할 수 없는 운동 등급별 체인화와 더불어 단계별 트레이닝을 통해 온라인상에 가상의 헬스 클럽이나 피 트니스 센터를 수립하는데 기여한다. 이상에서 본 발명은 비록 한정된 실시예와 도면에 의해 설명되었으나, 본 발명은 이것에 의해 한정되지 않으며"}
{"patent_id": "10-2023-0046192", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에 의해 본 발명의 기술사상과 아래에 기재될 특허청구범 위의 균등범위 내에서 다양한 수정 및 변형이 가능함은 물론이다."}
{"patent_id": "10-2023-0046192", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 명세서에 첨부되는 다음의 도면들은 본 발명의 바람직한 실시예를 예시하는 것이며, 후술되는 발명의 상세한 설명과 함께 본 발명의 기술사상을 더욱 이해시키는 역할을 하는 것이므로, 본 발명은 그러한 도면에 기재된 사 항에만 한정되어 해석되어서는 아니된다. 도 1은 본 발명의 바람직한 일 실시예에 따른 스마트 미러 장치를 이용한 그룹 홈 트레이닝 시스템의 구성도이 다. 도 2는 본 발명의 바람직한 일 실시예의 스마트 미러장치의 하드웨어 구성도이다. 도 3은 본 발명의 바람직한 실시예에 따른 홈 트레이닝 관리서버의 하드웨어 구성도이다. 도 4는 본 발명에 따른 홈 트레이닝 그룹을 성장시키는 방법에 대한 전체 플로우차트이다. 도 5는 본 발명에 따른 단위 홈 트레이닝 그룹을 형성하는 과정을 설명하는 플로우차트이다. 도 6은 본 발명에 따른 단위 홈 트레이닝 그룹을 성장시키는 과정을 설명하는 플로우차트이다."}
