{"patent_id": "10-2011-7005463", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2011-0050666", "출원번호": "10-2011-7005463", "출원인": "콸콤 인코포레이티드", "발명자": "호, 사이 이유, 던칸"}}
{"patent_id": "10-2011-7005463", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "무선 링크 제어 피어들(radio link control peer)로부터 폴링 요청들(polling request)을 프로세싱하기 위한방법으로서,데이터 패킷들의 세트를 수신하는 단계;상기 데이터 패킷들의 적어도 하나의 특성을 결정하는 단계; 및스테이터스 리포트(status report)를 생성할지를 결정하기 위하여 상기 특성들을 기준 값과 비교하는 단계를 포함하는,폴링 요청들을 프로세싱하기 위한 방법."}
{"patent_id": "10-2011-7005463", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 상기 데이터 패킷들은 프로토콜 데이터 유닛들을 포함하는,폴링 요청들을 프로세싱하기 위한 방법."}
{"patent_id": "10-2011-7005463", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 특성은 상기 데이터 패킷과 연관된 시퀀스 번호, 또는 폴(poll) 필드의 값 중 적어도 하나를 포함하는,폴링 요청들을 프로세싱하기 위한 방법."}
{"patent_id": "10-2011-7005463", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서, 상기 기준 값은 상기 스테이터스 리포트의 확인응답/부정 확인응답 필드에서 운반될 수 있는 상기 수신된 데이터 패킷들의 세트의 가장 높은 시퀀스 번호를 저장하는 최대 스테이터스 전송 상태 변수의 값인,폴링 요청들을 프로세싱하기 위한 방법."}
{"patent_id": "10-2011-7005463", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4 항에 있어서,상기 폴링 요청들을 프로세싱하기 위한 방법은, 상기 데이터 패킷과 연관된 상기 시퀀스 번호가 상기 최대 스테이터스 전송 상태 변수보다 작거나 같은 것 중 적어도 하나이면 스테이터스 리포트를 생성하는 단계를 더 포함하고, 상기 데이터 패킷은 상기 폴 필드에서 1의 값을 포함하는,폴링 요청들을 프로세싱하기 위한 방법."}
{"patent_id": "10-2011-7005463", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 4 항에 있어서,상기 폴링 요청들을 프로세싱하기 위한 방법은, 상기 데이터 패킷과 연관된 상기 시퀀스 번호가 상기 최대 스테이터스 전송 상태 변수보다 작거나 같은 것 중 적어도 하나일 때까지 상기 스테이터스 리포트의 생성을 지연시키는 단계를 더 포함하고, 상기 데이터 패킷은 상기 폴 필드 내에서 1의 값을 포함하는,폴링 요청들을 프로세싱하기 위한 방법."}
{"patent_id": "10-2011-7005463", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2011-0050666-2-무선 링크 제어 피어들로부터 폴링 요청들을 프로세싱하도록 구성된 적어도 하나의 프로세서를 가진 무선 통신장치로서,적어도 하나의 프로토콜 데이터 유닛을 수신하기 위한 제 1 모듈;상기 프로토콜 데이터 유닛과 연관된 시퀀스 번호를 결정하기 위한 제 2 모듈;상기 프로토콜 데이터 유닛 내에 포함된 폴링 요청을 검출하기 위한 제 3 모듈;상기 포함된 폴링 요청을 가진 프로토콜 데이터 유닛의 시퀀스 번호를 최대 스테이터스 전송 상태 변수의 값에비교하기 위한 제 4 모듈; 및상기 포함된 폴링 요청을 가진 프로토콜 데이터 유닛의 시퀀스 번호가 상기 최대 스테이터스 전송 상태 변수의값과 같거나 작은 것 중 적어도 하나이면 스테이터스 리포트를 생성하기 위한 제 5 모듈을 포함하는,무선 통신 장치."}
{"patent_id": "10-2011-7005463", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서,상기 무선 통신 장치는 미리 결정된 시간 양이 경과될 때 스테이터스 리포트를 생성하기 위한 제 6 모듈을 더포함하고, 상기 포함된 폴링 요청을 가진 프로토콜 데이터의 시퀀스 번호는 상기 최대 스테이터스 전송 상태 변수의 값과 같거나 작은 것 중 적어도 하나가 아닌,무선 통신 장치."}
{"patent_id": "10-2011-7005463", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서,상기 미리 결정된 시간 양은 적어도 부분적으로는 측정된 전송 시간을 기초로 하는,무선 통신 장치."}
{"patent_id": "10-2011-7005463", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "컴퓨터 프로그램 물건으로서,컴퓨터-판독 가능 매체를 포함하고, 상기 컴퓨터-판독 가능 매체는:컴퓨터가 하나 이상의 프로토콜 데이터 유닛들을 얻게 하기 위한 코드들의 제 1 세트;상기 컴퓨터가 각각의 프로토콜 데이터 유닛들에 대한 시퀀스 번호의 위치를 결정하게 하기 위한 코드들의 제 2 세트;상기 컴퓨터가 상기 프로토콜 데이터 유닛들 내 폴링 비트의 값을 검출하게 하기 위한 코드들의 제 3세트;상기 컴퓨터가 상기 프로토콜 데이터 유닛의 시퀀스 번호를 최대 스테이터스 전송 상태 변수의 값에 비교하게 하기 위한 코드들의 제 4 세트 ― 상기 프로토콜 데이터 유닛 내의 폴링 비트의 값은 1임 ―; 및상기 프로토콜 시퀀스 번호가 상기 최대 스테이터스 전송 상태 변수의 상기 값과 같거나 작은 것 중 적어도 하나이면 상기 컴퓨터가 스테이터스 리포트를 생성하게 하기 위한 코드들의 제 5 세트 ― 상기 프로토콜 데이터유닛 내의 폴링 비트의 값은 1임 ―를 포함하는,컴퓨터 프로그램 물건."}
{"patent_id": "10-2011-7005463", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 10 항에 있어서, 공개특허 10-2011-0050666-3-상기 컴퓨터 프로그램 물건은 미리 결정된 시간 양이 경과될 때 상기 컴퓨터가 스테이터스 리포트를 생성하게하도록 하기 위한 코드들의 부가적인 세트를 더 포함하고, 상기 프로토콜 데이터 유닛의 시퀀스 번호는 상기 최대 스테이터스 전송 상태 변수의 값과 같거나 작은 것 중 적어도 하나가 아니고, 상기 프로토콜 데이터 유닛 내폴링 비트의 값은 1인,컴퓨터 프로그램 물건."}
{"patent_id": "10-2011-7005463", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 10 항에 있어서, 상기 미리 결정된 시간 양은 적어도 부분적으로 상기 프로토콜 데이터 유닛들에 대한 측정된 전송 시간을 기초로 하는,컴퓨터 프로그램 물건."}
{"patent_id": "10-2011-7005463", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "장치로서,하나 이상의 데이터 패킷들을 획득하기 위한 수단;상기 데이터 패킷들을 프로세싱하기 위한 수단 ― 상기 프로세싱은 각각의 데이터 패킷에 대한 시퀀스 번호를결정하는 것, 또는 폴이 각각의 패킷 내에 포함되는지를 식별하는 것을 포함함 ―;최대 스테이터스 전송 상태 변수에 대한 값을 결정하기 위한 수단 ― 상기 최대 스테이터스 전송 상태 변수는스테이터스 리포트의 확인응답/부정 확인응답 필드 내에서 운반될 수 있는 수신된 데이터 패킷들의 세트의 가장높은 시퀀스 번호를 저장함 ―; 및상기 최대 스테이터스 전송 상태 변수의 값에 관련하여 상기 폴을 포함하는 상기 데이터 패킷의 시퀀스 번호를평가하기 위한 수단을 포함하는,장치."}
{"patent_id": "10-2011-7005463", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13 항에 있어서,상기 장치는 상기 폴을 포함하는 상기 데이터 패킷의 시퀀스 번호가 상기 최대 스테이터스 전송 상태 변수의 값보다 작은 경우 스테이터스 리포트를 생성하기 위한 수단을 더 포함하는,장치."}
{"patent_id": "10-2011-7005463", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 14 항에 있어서,상기 장치는 상기 폴을 포함하는 상기 데이터 패킷의 시퀀스 번호가 상기 최대 스테이터스 전송 상태 변수의 값에 동일한 경우 상기 스테이터스 리포트를 생성하기 위한 수단을 더 포함하는,장치."}
{"patent_id": "10-2011-7005463", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 13 항에 있어서,상기 장치는 상기 폴을 포함하는 데이터 패킷의 시퀀스 번호가 상기 최대 스테이터스 전송 상태 변수의 값보다작지 않은 경우 상기 스테이터스 리포트의 생성을 지연하기 위한 수단을 더 포함하는,장치."}
{"patent_id": "10-2011-7005463", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "공개특허 10-2011-0050666-4-제 16 항에 있어서, 상기 지연은 적어도 부분적으로는 측정된 전송 시간을 기초로 하는,장치."}
{"patent_id": "10-2011-7005463", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 17 항에 있어서,상기 장치는 최대 수의 지연들이 구현된 경우, 또는 최대 지연 시간이 경과된 경우 중 적어도 하나의 경우에 상기 스테이터스 리포트를 생성하기 위한 수단을 더 포함하는,장치."}
{"patent_id": "10-2011-7005463", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "장치로서,하나 이상의 패킷들을 획득하는 데이터 수신 컴포넌트;시퀀스 번호, 및 각각의 수신된 패킷에 대한 폴링 요청의 존재를 결정하는 패킷 검사 컴포넌트; 및적어도 부분적으로 기준 값에 대한 상기 패킷의 시퀀스 번호의 비교를 기초로 스테이터스 리포트를 생성하는 스테이터스 리포트 컴포넌트 ― 폴링 요청은 상기 패킷 내에 존재함 ―를 포함하는,장치."}
{"patent_id": "10-2011-7005463", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 19 항에 있어서, 상기 기준 값은 최대 스테이터스 전송 상태 변수의 값인,장치."}
{"patent_id": "10-2011-7005463", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제 20 항에 있어서, 상기 스테이터스 리포트 컴포넌트는 상기 최대 스테이터스 전송 상태 변수의 값이 상기 패킷의 시퀀스 번호보다크거나 같은 것 중 적어도 하나인 경우 상기 스테이터스 리포트를 생성하고, 폴링 요청은 상기 패킷 내에 존재하는,장치."}
{"patent_id": "10-2011-7005463", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제 20 항에 있어서,상기 장치는 상기 최대 스테이터스 전송 상태 변수의 값이 상기 폴링 요청을 포함하는 패킷의 시퀀스 번호보다크거나 같은 것 중 적어도 하나이거나, 최대 대기 시간이 경과되었거나, 최대수의 대기 상태들이 구현된 것 중적어도 하나일 때까지 상기 스테이터스 리포트를 생성하기 전에 상기 스테이터스 리포트 컴포넌트를 대기시키는지연 컴포넌트를 더 포함하는,장치."}
{"patent_id": "10-2011-7005463", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제 19 항에 있어서,상기 패킷들은 프로토콜 데이터 유닛들을 포함하는,공개특허 10-2011-0050666-5-장치."}
{"patent_id": "10-2011-7005463", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제 19 항에 있어서,상기 장치는 상기 장치의 하나 이상의 피쳐(feature)들을 자동화하는 것을 촉진하는 인공 지능 컴포넌트를 더포함하는,장치."}
{"patent_id": "10-2011-7005463", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "무선 통신 장치로서,적어도 하나의 수신된 데이터 패킷을 저장하는 메모리; 및상기 데이터 패킷의 적어도 하나의 특성을 결정하고 스테이터스 리포트를 생성할지를 결정하기 위하여 상기 특성들을 기준 값과 비교하도록 구성된 프로세서를 포함하는무선 통신 장치."}
{"patent_id": "10-2011-7005463", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "제 25 항에 있어서,상기 데이터 패킷들은 프로토콜 데이터 유닛들인,무선 통신 장치."}
{"patent_id": "10-2011-7005463", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "제 25 항에 있어서, 상기 데이터 패킷들은 하이브리드 자동 반복 요청 계층을 통하여 수신되는,무선 통신 장치."}
{"patent_id": "10-2011-7005463", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_28", "content": "제 25 항에 있어서,상기 특성은 상기 데이터 패킷과 연관된 시퀀스 번호, 또는 상기 데이터 패킷 내의 폴 필드의 값 중 적어도 하나를 포함하는,무선 통신 장치."}
{"patent_id": "10-2011-7005463", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "제 28 항에 있어서,상기 기준 값은 상기 스테이터스 리포트의 확인응답/부정 확인응답 필드에서 운반될 수 있는 수신된 데이터 패킷들의 세트의 가장 높은 시퀀스 번호를 저장하는 최대 스테이터스 전송 상태 변수의 값인,무선 통신 장치."}
{"patent_id": "10-2011-7005463", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_30", "content": "제 29 항에 있어서,상기 무선 통신 장치는 상기 데이터 패킷과 연관된 시퀀스 번호가 상기 최대 스테이터스 전송 상태 변수보다 작거나 같은 것 중 적어도 하나이면 상기 스테이터스 리포트를 생성하는 것을 더 포함하고, 상기 데이터 패킷은상기 폴 필드 내에서 1의 값을 포함하는,공개특허 10-2011-0050666-6-무선 통신 장치."}
{"patent_id": "10-2011-7005463", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_31", "content": "제 29 항에 있어서,상기 무선 통신 장치는 상기 데이터 패킷과 연관된 시퀀스 번호가 상기 최대 스테이터스 전송 상태 변수보다 작거나 같은 것 중 적어도 하나일 때까지 상기 스테이터스 리포트의 생성을 지연하는 것을 더 포함하고, 상기 데이터 패킷은 상기 폴 필드 내에서 1의 값을 포함하는,무선 통신 장치.명 세 서기 술 분 야본 특허 출원은 2008년 8월 8일에 출원되고, 본 출원인에게 양도되고 여기에 참조로써 명확히 통합된 발명의 명 [0001]칭이 \"PROCESSING A POLLING REQUEST FROM AN RLC PEER\"인 가 출원 번호 61/087,606에 대한 우선권을주장한다.본 양상들은 무선 통신에 관한 것이고, 보다 구체적으로 무선 링크 제어 피어(radio link control peer)로부터 [0002]폴링 요청(polling request)을 프로세싱하기 위한 기술들에 관한 것이다.배 경 기 술무선 통신 시스템들은 음성, 데이터, 및 등등 같은 다양한 타입들의 통신 콘텐츠를 제공하기 위하여 널리 전개 [0003]되었다. 이들 시스템들은 이용 가능한 시스템 자원들(예를 들어, 대역폭 및 전송 전력)을 공유함으로써 다중사용자들과의 통신을 지원할 수 있는 다중-접속 시스템들일 수 있다. 그런 다중-접속 시스템들의 예들은 코드분할 다중 접속(CDMA) 시스템들, 시분할 다중 접속(TDMA) 시스템들, 주파수 분할 다중 접속(FDMA) 시스템들,3GPP 롱텀 에볼루션(Long Term Evolution)(LTE) 시스템들, 및 직교 주파수 분할 다중 접속(OFDMA) 시스템들을포함한다.일반적으로, 무선 다중-접속 통신 시스템은 다중 무선 단말들에 대한 통신을 동시에 지원할 수 있다. 각각의 [0004]단말은 순방향 링크 및 역방향 링크 상에서의 전송들을 통하여 하나 이상의 기지국들과 통신한다. 순방향 링크(또는 다운링크)는 기지국들로부터 단말들로의 통신 링크를 지칭하고, 역방향 링크(또는 업링크)는 단말들로부터 기지국들로의 통신 링크를 지칭한다. 이런 통신 링크는 단일-입력-단일-출력, 다중-입력-단일-출력 또는 다중-입력-다중-출력(MIMO) 시스템을 통하여 설정될 수 있다.MIMO 시스템은 데이터 전송을 위해 다중(NT) 전송 안테나들 및 다중(NR) 수신 안테나들을 이용한다. NT 전송 [0005]안테나 및 NR 수신 안테나에 의해 형성된 MIMO 채널은 공간 채널들 (NS) 독립적 채널들의 세트로 분해될 수 있고, 여기서 NS 독립 채널들의 각각은 차원(dimension)에 대응한다. MIMO 시스템은 다중 전송 안테나 및 수신안테나에 의해 생성된 부가적인 차원성(dimensionality)들이 사용되면 개선된 성능(예를 들어, 보다 높은 처리량 및/또는 보다 큰 신뢰성)을 제공할 수 있다.MIMO 시스템은 시분할 듀플렉스(TDD) 및 주파수 분할 듀플렉스(FDD) 시스템들을 지원한다. TDD 시스템에서, 순 [0006]방향 및 역방향 링크 전송들은 동일한 주파수 구역에서 이루어지므로, 상호성(reciprocity) 원리는 역방향 링크채널로부터 순방향 링크 채널의 측정을 허용한다. 이것은 다중 안테나들이 액세스 포인트에서 이용 가능할 때액세스 포인트가 순방향 링크 상에서 전송 빔형성 이득을 추출하게 한다.발명의 내용다음은 그런 양상들의 기본적인 이해를 제공하기 위하여 하나 이상의 양상들의 간략화된 요약을 제공한다. 이 [0007]요약은 모든 생각되는 양상들의 넓은 개관이 아니고, 모든 양상들의 핵심 또는 중요 엘리먼트들을 식별하지도임의의 또는 모든 양상들의 범위를 기술하지도 않도록 의도된다. 그 유일한 목적은 추후에 제공되는 보다 상세한 설명에 대한 서론으로서 간략화된 형태로 하나 이상의 양상들의 몇몇 개념들을 제공하는 것이다.하나 이상의 양상들 및 대응하는 개시에 따라, 다양한 양상들은 무선 링크 제어 피어들로부터 폴링 요청들을 프 [0008]로세싱하는 것과 관련하여 기술된다. 관련된 양상들에 따라, 무선 링크 제어 피어들로부터의 폴링 요청들을 프공개특허 10-2011-0050666-7-로세싱하기 위한 방법은 제공된다. 상기 방법은 데이터 패킷들의 세트를 수신하는 단계, 상기 데이터 패킷들의적어도 하나의 특성을 결정하는 단계, 및 상태 리포트를 생성할지를 결정하기 위하여 상기 특성들을 기준 값과비교하는 단계를 포함한다.다른 양상은 무선 링크 제어 피어들로부터 폴링 요청들을 프로세싱하도록 구성된 적어도 하나의 프로세서를 가 [0009]진 무선 통신 장치에 관한 것이다. 무선 통신 장치는 적어도 하나의 프로토콜 데이터 유닛을 수신하기 위한 제1 모듈, 프로토콜 데이터 유닛과 연관된 시퀀스 번호를 결정하기 위한 제 2 모듈, 프로토콜 데이터 유닛에 포함된 폴링 요청을 검출하기 위한 제 3 모듈, 포함된 폴링 요청을 가진 프로토콜 데이터 유닛의 시퀀스 번호를 최대 스테이터스(status) 전송 상태 변수의 값에 비교하기 위한 제 4 모듈, 및 포함된 폴링 요청을 가진 프로토콜데이터의 시퀀스 번호가 최대 스테이터스 전송 상태 변수의 값과 같거나 작은 것 중 적어도 하나이면 스테이터스 리포트를 생성하기 위한 제 5 모듈을 포함한다.아직 다른 양상은 컴퓨터 프로그램 물건에 관한 것이다. 컴퓨터 프로그램 물건은 컴퓨터가 하나 이상의 프로토 [0010]콜 데이터 유닛들을 얻게 하기 위한 코드들의 제 1 세트, 컴퓨터가 각각의 프로토콜 데이터 유닛들에 대한 시퀀스 번호의 위치를 결정(locate) 하게 하기 위한 코드들의 제 2 세트, 컴퓨터가 프로토콜 데이터 유닛들에서 폴링 비트의 값을 검출하게 하기 위한 코드들의 제 3 세트, 프로토콜 데이터 유닛의 시퀀스 번호를 최대 스테이터스 전송 상태 변수의 값에 비교하게 하기 위한 코드들의 제 4 세트 ― 상기 프로토콜 데이터 유닛에서 폴링 비트의 값은 1임 ―, 및 프로토콜의 시퀀스 번호가 최대 스테이터스 전송 상태 변수의 값보다 같거나 작은 것 중적어도 하나이면 컴퓨터가 스테이터스 리포트를 생성하게 하기 위한 코드들의 제 5 세트 ― 상기 프로토콜 데이터 유닛 내 폴링 비트의 값은 1임 ― 를 포함한다.아직 다른 양상은 장치에 관한 것이다. 장치는 하나 이상의 데이터 패킷들을 획득하기 위한 수단, 데이터 패킷 [0011]들을 프로세싱하기 위한 수단 ― 상기 프로세싱은 각각의 데이터 패킷에 대한 시퀀스 번호를 결정하거나, 폴이각각의 패킷 내에 포함되는지를 식별하는 것 중 적어도 하나를 포함함 ―, 최대 스테이터스 전송 상태 변수에대한 값을 결정하기 위한 수단 ― 상기 최대 스테이터스 전송 상태 변수는 스테이터스 리포트의 확인응답/부정확인응답 필드(field) 내에서 운반될 수 있는 수신된 데이터 패킷들의 세트의 가장 높은 시퀀스 번호를 저장함―, 및 최대 스테이터스 전송 상태 변수의 값에 관련한 폴을 포함하는 데이터 패킷의 시퀀스 번호를 평가하기위한 수단을 포함한다.게다가 부가적인 양상은 장치에 관한 것이다. 장치는 하나 이상의 패킷들을 얻는 데이터 수신 컴포넌트, 시퀀 [0012]스 번호 및 각각의 수신된 패킷에 대한 폴링 요청의 존재를 결정하는 패킷 검사 컴포넌트, 및 적어도 부분적으로 기준 값에 대해 패킷의 시퀀스 번호의 비교를 기초로 스테이터스 리포트를 생성하는 스테이터스 리포트 컴포넌트 ― 상기 폴링 요청은 패킷 내에 존재함 ― 를 포함한다.아직 다른 양상은 무선 통신 장치에 관한 것이다. 무선 통신 장치는 무선 통신 장치는 적어도 하나의 수신된 [0013]데이터 패킷을 저장하는 메모리, 및 데이터 패킷들의 적어도 하나의 특성을 결정하고, 스테이터스 리포트를 생성할지를 결정하기 위하여 상기 특성들을 기준 값과 비교하도록 구성된 프로세서를 포함한다.상기 및 관련된 목적들을 달성하기 위해, 하나 이상의 양상들은 이후 충분히 기술되고 특히 청구항들에 지적되 [0014]는 특징들을 포함한다. 다음 설명 및 첨부된 도면들은 하나 이상의 양상들의 특정 도시된 특징들을 상세히 나타낸다. 이들 특징들은 다양한 양상들의 원리들이 이용될 수 있는 다양한 방식들 중 소수를 가리키고, 이 설명은 모든 그런 양상들 및 그들의 등가물들을 포함하도록 의도된다.도면의 간단한 설명도 1은 예시적인 다중 접속 무선 통신 시스템을 도시한다. [0015]도 2는 통신 시스템의 일반적인 블록도를 도시한다.도 3은 예시적인 무선 통신 시스템을 도시한다.도 4는 본 명세서의 양상에 따라 무선 링크 제어 피어로부터의 폴링 요청들을 프로세싱하기 위한 시스템의 예시적인 블록도를 도시한다.도 5는 본 명세서의 양상에 따라 프로토콜 데이터 유닛들이 순서 없이 수신되는 무선 링크 제어 피어로부터의폴링 요청들을 프로세싱하기 위한 시스템의 예시적인 블록도를 도시한다.도 6은 본 명세서에 따라 생성된 스테이터스 리포트가 수신기로부터 전송기로 전송되는 무선 링크 제어 피어로공개특허 10-2011-0050666-8-부터의 폴링 요청들을 프로세싱하기 위한 시스템의 예시적인 블록도를 도시한다.도 7은 본 명세서의 양상에 따라 도시된 무선 링크 제어 피어로부터의 폴링 요청들을 프로세싱하기 위한 예시적인 시스템이다.도 8은 본 명세서의 양상에 따라 무선 링크 제어 피어들로부터의 폴링 요청들의 예시적인 방법론이다.도 9는 본 명세서에 따른 하나 이상의 피쳐(feature)들을 자동화하는 것을 촉진하는 인공 지능 컴포넌트를 이용하는 시스템을 도시한다.도 10은 본 개선 사항의 양상에 따라 무선 통신 시스템에서 무선 링크 제어 피어들로부터의 폴링 요청들을 프로세싱하는 것을 촉진하는 시스템의 예시적인 블록도이다.발명을 실시하기 위한 구체적인 내용다양한 양상들은 도면들을 참조하여 지금 기술된다. 다음 상세한 설명에서, 설명을 위해, 다수의 특정 상세한 [0016]것들은 하나 이상의 양상들의 완전한 이해를 제공하기 위하여 나타난다. 그러나, 그런 양상(들)이 이들 특정상세한 것들 없이 실시될 수 있다는 것은 명백할 수 있다.이 출원에 사용된 바와 같이, 용어들 \"컴포넌트\", \"모듈\", \"시스템\" 및 등등은 하드웨어, 펌웨어, 하드웨어 및 [0017]소프트웨어의 조합, 소프트웨어, 또는 실행 소프트웨어 같은 컴퓨터-관련 엔티티를 포함하지만, 그것으로 제한되지 않도록 의도된다. 예를 들어, 컴포넌트는 프로세서상에서 동작하는 프로세스, 프로세서, 객체, 실행가능, 실행 스레드, 프로그램, 및/또는 컴퓨터일 수 있지만, 이것으로 제한되지 않는다. 도시에 의해, 컴퓨팅디바이스에서 동작하는 애플리케이션 및 컴퓨팅 디바이스 둘 다는 컴포넌트일 수 있다. 하나 이상의 컴포넌트들은 프로세스 및/또는 실행 스레드 내에 상주할 수 있고 컴포넌트는 하나의 컴퓨터상에 배치될 수 있고/있거나둘 이상의 컴퓨터들 사이에 분산될 수 있다. 게다가, 이들 컴포넌트들은 저장된 다양한 데이터 구조들을 가진다양한 컴퓨터 판독 가능 매체로부터 실행할 수 있다. 컴포넌트들은 로컬 시스템, 분산 시스템의 다른 컴포넌트, 및/또는 신호에 의해 인터넷 같은 네트워크를 거쳐 다른 시스템들과 상호작용하는 하나의 컴포넌트로부터의 데이터 같은 하나 이상의 데이터 패킷들을 가진 신호에 따라 로컬 및/또는 원격 프로세스들에 의해 통신할수 있다.게다가, 다양한 양상들은 유선 단말 또는 무선 단말일 수 있는 단말과 관련하여 여기에 기술된다. 단말은 또한 [0018]시스템, 디바이스, 가입자 유닛, 가입자 국, 이동국, 모바일, 모바일 디바이스, 원격 국, 원격 단말, 액세스 단말, 사용자 단말, 단말, 통신 디바이스, 사용자 에이전트, 사용자 디바이스, 또는 사용자 장비(UE)라 지칭될 수있다. 무선 단말은 셀룰러 전화, 위성 폰, 무선 전화, 세션 개시 프로토콜(SIP) 폰, 무선 로컬 루프(WLL) 국,개인휴대정보단말(PDA), 무선 접속 능력을 가진 핸드헬드 디바이스, 컴퓨팅 디바이스, 또는 무선 모뎀에 접속된다른 프로세싱 디바이스들일 수 있다. 게다가, 다양한 양상들은 기지국과 관련하여 여기에 기술된다. 기지국은 무선 단말(들)과 통신하기 위해 사용될 수 있고 또한 액세스 포인트, 노드 B, 또는 몇몇 다른 용어로 지칭될수 있다.게다가, 용어 \"또는\"은 배타적 \"또는\"이기 보다 포괄적 \"또는\"을 의미하는 것으로 의도된다. 즉, 다르게 지정 [0019]되지 않거나, 문맥으로부터 명확하면, 어구 \"X는 A 또는 B를 이용한다\"는 임의의 자연적인 포괄적인 순열들을의미하는 것으로 의도된다. 즉, 어구 \"X는 A 또는 B를 이용한다\"는 임의의 다음 예들에 의해 만족된다: X는 A를 이용한다; X는 B를 이용한다; 또는 X는 A 및 B 둘 다를 이용한다. 게다가, 이 출원 및 첨부된 청구항들에서사용된 바와 같은 관사들은 일반적으로 단수 형태로 지시되도록 다르게 지정되지 않거나 문맥으로부터 명백하면\"하나 이상\"을 의미하는 것으로 이해되어야 한다.여기에 기재된 기술들은 CDMA, TDMA, FDMA, OFDMA, SC-FDMA 및 다른 시스템들 같은 다양한 무선 통신 시스템들 [0020]을 위해 사용될 수 있다. 용어들 \"시스템\" 및 \"네트워크\"는 종종 상호 교환하여 사용된다. CDMA 시스템은UTRA(Universal Terrestrial Radio Access), cdma2000, 등등 같은 무선 기술을 구현할 수 있다. UTRA는 광대역-CDMA(W-CDMA) 및 CDMA의 다른 변형들을 포함한다. 게다가, cdma2000은 IS-2000, IS-95 및 IS-856 표준들을커버한다. TDMA 시스템은 GSM(Global System for Mobile Communications) 같은 무선 기술을 구현할 수 있다.OFDMA 시스템은 이벌빙된 UTRA(E-UTRA), UMB(Ultra Mobile Broadband), IEEE 802.11(Wi-Fi), IEEE802.16(WiMAX), IEEE 802.16(WiMAX), IEEE 802.20, Flash-OFDM□, 등등을 구현할 수 있다. UTRA 및 E-UTRA는UMTS(Universal Mobile Telecommunication System)의 일부이다. 3GPP 롱 텀 에볼루션(LTE)는 다운링크 상에서OFDMA를 이용하고 업링크 상에서 SC-FDMA를 이용하는 E-UTRA를 사용하는 UMTS의 릴리스이다. UTRA, E-UTRA,공개특허 10-2011-0050666-9-UMTS, LTE 및 GSM은 \"3세대 파트너쉽 프로젝트\"(3GPP)이라 지칭되는 조직으로부터 문헌들에 기재된다. 부가적으로, cdma2000 및 UMB는 \"3세대 파트너쉽 프로젝트 2\"(3GPP2)라 지칭되는 조직으로부터의 문헌들에 기재된다.추가로, 그런 무선 통신 시스템들은 부가적으로 종종 언페어 언라이센싱 스펙트럼들, 802.xx 무선 LAN,BLUETOOTH 및 임의의 다른 단거리 또는 장거리 무선 통신 기술들을 사용하는 피어-투-피어(peer-to-peer)(예를들어, 모바일-대-모바일) 애드 혹(ad hoc) 네트워크 시스템들을 포함할 수 있다.다양한 양상들 또는 특징들은 다수의 디바이스들, 컴포넌트들, 모듈들, 및 등등을 포함할 수 있는 시스템들의 [0021]측면에서 제공될 것이다. 다양한 시스템들이 부가적인 디바이스들, 컴포넌트들, 모듈들, 등등을 포함할 수 있고/있거나 도면들과 관련하여 논의된 모든 디바이스들, 컴포넌트들, 모듈들, 등등을 포함할 수 없다는 것이 이해 및 인식될 것이다. 이들 접근법들의 조합은 또한 사용될 수 있다.도 1을 지금 참조하여, 무선 통신 시스템(100)은 여기에 제공된 다양한 실시예들에 따라 도시된다. 시스템 [0022](100)은 다중 안테나 그룹들을 포함할 수 있는 기지국(102)을 포함한다. 예를 들어, 하나의 안테나 그룹은 안테나들(104 및 106)을 포함할 수 있고, 다른 그룹은 안테나들(108 및 110)을 포함할 수 있고, 그리고 부가적인그룹은 안테나들(112 및 114)을 포함할 수 있다. 각각의 안테나 그룹에 대해 두 개의 안테나들이 도시된다; 그러나, 많거나 적은 안테나들은 각각의 그룹에 사용될 수 있다. 기지국(102)은 부가적으로 전송기 체인(chain)및 수신기 체인을 포함할 수 있고, 그 각각은 차례로 당업자에 의해 인식될 바와 같이 신호 전송 및 수신(예를들어, 프로세서들, 변조기들, 멀티플렉서들, 복조기들, 디멀티플렉서들, 안테나들, 등등)과 연관된 다수의 컴포넌트들을 포함할 수 있다.기지국(102)은 모바일 디바이스(116) 및 모바일 디바이스(122) 같은 하나 이상의 모바일 디바이스들과 통신할 [0023]수 있다; 그러나, 기지국(102)이 모바일 디바이스들(116 및 122)과 유사한 실질적으로 임의의 수의 모바일 디바이스들과 통신할 수 있다는 것이 인식될 것이다. 모바일 디바이스들(116 및 122)은 예를 들어, 셀룰러 폰들,스마트 폰들, 랩탑들, 핸드헬드 통신 디바이스들, 핸드헬드 컴퓨팅 디바이스들, 위성 무선들, 글로벌 위치 결정시스템들, PDA들, 및/또는 무선 통신 시스템(100)을 통해 통신하기 위한 임의의 다른 적당한 디바이스일 수 있다. 도시된 바와 같이, 모바일 디바이스(116)는 안테나들(112 및 114)과 통신하고, 여기서 안테나들(112 및114)은 순방향 링크(118)를 통해 모바일 디바이스(116)에 정보를 전송하고 역방향 링크(120)를 통하여 모바일디바이스(116)로부터 정보를 수신한다. 게다가, 모바일 디바이스(122)는 안테나들(104 및 106)과 통신하고, 여기서 안테나들(104 및 106)은 순방향 링크(124)를 통하여 모바일 디바이스(122)로 정보를 전송하고 역방향 링크(126)를 통하여 모바일 디바이스(122)로부터 정보를 수신한다. 주파수 분할 듀플렉스(FDD) 시스템에서, 순방향링크(118)는 역방향 링크(120)에 의해 사용된 상이한 주파수 대역을 사용할 수 있고, 순방향 링크(124)는 예를들어 역방향 링크(126)에 의해 사용된 것과 상이한 주파수 대역을 사용할 수 있다. 게다가, 시분할 듀플렉스(TDD) 시스템에서, 순방향 링크(118) 및 역방향 링크(120)는 공통 주파수 대역 및 순방향 링크(124)를 사용할수 있고 역방향 링크(126)는 공통 주파수 대역을 사용할 수 있다.그들이 통신하도록 설계된 안테나들 및/또는 영역의 각각의 그룹은 기지국(102)의 섹터라 지칭될 수 있다. 예 [0024]를 들어, 안테나 그룹들은 기지국(102)에 의해 커버되는 영역들의 섹터 내의 모바일 디바이스들과 통신하도록설계될 수 있다. 순방향 링크들(118 및 124)을 통한 통신에서, 기지국(102)의 전송 안테나들은 모바일 디바이스들(116 및 122)에 대한 순방향 링크들(118 및 124)의 신호-대-잡음 비를 개선하기 위하여 빔-형성(beam-forming)을 사용할 수 있다. 이것은 예를 들어 원하는 방향들로 신호들을 조종하기 위한 프리코더를 사용함으로써 제공될 수 있다. 또한, 기지국(102)이 연관된 커버리지를 통하여 임의로 산란되는 모바일 디바이스들(116및 122)에 전송하기 위해 빔-형성을 사용하지만, 이웃 셀들 내의 모바일 디바이스들은 단일 안테나를 통하여 모든 모바일 디바이스들로 전송하는 기지국과 비교되는 바와 같은 간섭에 덜 영향을 받을 수 있다. 게다가, 모바일 디바이스들(116 및 122)은 일 예에서 피어-투-피어 또는 애드 혹 기술을 사용하여 서로 직접 통신할 수있다.예에 따라, 시스템(100)은 다중-입력 다중-출력(MIMO) 통신 시스템일 수 있다. 게다가, 시스템(100)은 FDD, [0025]TDD, 및 등등 같은 통신 채널들(예를 들어, 순방향 링크, 역방향 링크, 등등)을 분할하기 위한 임의의 타입의듀플렉싱 기술을 실질적으로 사용할 수 있다. 게다가, 시스템(100)은 다중-베어러 시스템(multiple-bearersystem)일 수 있다. 베어러는 정의된 용량, 지연, 비트 에러율, 등등의 정보 경로일 수 있다. 모바일 디바이스들(116 및 122)은 하나 이상의 무선 베어러들을 각각 서빙할 수 있다. 모바일 디바이스들(116 및 122)은 하나 이상의 무선 베어러들을 가로질러 업링크 자원들을 관리 및/공유하기 위하여 업링크 레이트 제어 메카니즘들을 사용할 수 있다. 일 예에서, 모바일 디바이스들(116 및 122)은 무선 베어러들을 서빙하고 업링크 레이트 제공개특허 10-2011-0050666-10-한들을 서빙하기 위하여 토큰 버킷(token bucket) 메카니즘들을 사용할 수 있다.도시에 따라, 각각의 베어러는 연관된 우선순위 비트 레이트(associated prioritized bit rate)(PBR), 최대 비 [0026]트 레이트(maximum bit rate)(MBR) 및 보장된 비트 레이트(guaranteed bit rate)(GBR)를 가질 수 있다. 모바일 디바이스들(116 및 122)은 적어도 부분적으로 연관된 비트 레이트 값들을 기초로 무선 베어러들을 서빙할 수있다. 비트 레이트 값들은 또한 각각의 베어러에 대하여 PBR 및 MBR을 생각하는 큐 크기들을 계산하기 위하여사용될 수 있다. 큐(queue) 크기들은 모바일 디바이스들(116 및 122)에 의해 기지국(102)에 전송된 업링크 자원 요청들에 포함될 수 있다. 기지국(102)은 각각의 업링크 요청들을 기초로 하고 큐 크기들을 포함하는 모바일 디바이스(116 및 122)에 대한 업링크 자원들을 스케쥴링할 수 있다.도 2는 MIMO 시스템(200)에서 전송기 시스템(210)(또한 액세스 포인트로서 공지됨) 및 수신기 시스템(250)(또한 [0027]액세스 단말로서 공지됨)의 블록도이다. 전송기 시스템(210)에서, 다수의 데이터 스트림들에 대한 트래픽 데이터는 데이터 소스(212)로부터 전송기(TX) 데이터 프로세서(214)로 제공된다.일 실시예에서, 각각의 데이터 스트림은 각각의 전송 안테나를 통하여 전송된다. TX 데이터 프로세서(214)는 [0028]코딩된 데이터를 제공하기 위하여 데이터 스트림에 대해 선택된 특정 코딩 방식을 기초로 각각의 데이터 스트림에 대한 트래픽 데이터를 포맷화, 코딩, 및 인터리빙한다.각각의 데이터 스트림에 대한 코딩된 데이터는 OFDM 기술들을 사용하여 파일롯 데이터와 멀티플렉싱될 수 있다. [0029]파일롯 데이터는 실질적으로 공지된 방식으로 프로세싱되는 공지된 데이터 패턴이고 채널 응답을 평가하기 위하여 수신기 시스템에서 사용될 수 있다. 각각의 데이터 스트림에 대한 멀티플렉싱된 파일롯 및 코딩된 데이터는변조 심볼들을 제공하기 위하여 데이터 스트림에 대해 선택된 특정 병조 방식(예를 들어, BPSK, QSPK, M-PSK,또는 M-QAM)을 기초로 변조된다(즉, 심볼 맵핑됨). 각각의 데이터 스트림에 대한 데이터 레이트, 코딩, 및 변조는 프로세서(230)에 의해 수행된 명령들에 의해 결정될 수 있다.모든 데이터 스트림들에 대한 변조 심볼들은 변조 심볼들(예를 들어, OFDM)을 추가로 프로세싱할 수 있는 TX [0030]MIMO 프로세서(220)에 제공된다. TX MIMO 프로세서(220)는 NT 변조 심볼 스트림들을 NT 전송기들(TMTR)(222a내지 222t)에 제공한다. 특정 실시예들에서, TX MIMO 프로세서(220)는 빔-형성 웨이트들을 데이터 스트림들의심볼들 및 심볼이 전송되는 안테나에 적용한다.각각의 전송기(222)는 하나 이상의 아날로그 신호들을 제공하기 위하여 각각의 심볼을 수신 및 프로세싱하고, [0031]추가로 MIMO 채널을 통한 전송에 적합한 변조된 신호를 제공하기 위하여 아날로그 신호들을 컨디셔닝(예를들어, 증폭, 필터링, 및 업컨버팅)한다. 전송기들(222a 내지 222t)로부터 NT 개의 변조된 신호들은 각각 NT 개의 안테나들(224a 내지 224t)로부터 전송된다.수신기 시스템(250)에서, 전송된 변조된 신호들은 NR 개의 안테나들(252a 내지 252r)에 의해 수신되고 각각의 [0032]안테나(252)로부터 수신된 신호는 각각의 수신기(RCVR)(254a 내지 254r)에 제공된다. 각각의 수신기(254)는 각각의 수신된 신호를 컨디셔닝(예를 들어, 필터링, 증폭, 및 다운컨버팅)하고, 샘플들을 제공하기 위하여 컨디셔닝된 신호를 디지털화하고, 그리고 대응하는 \"수신된\" 심볼 스트림을 제공하기 위하여 샘플들을 추가로 프로세싱한다.RX 데이터 프로세서(260)는 NT 개의 \"검출된\" 심볼 스트림들을 제공하기 위하여 특정 수신기 프로세싱 기술을 [0033]기초로 NR 개의 수신기들(254)로부터 NR 개의 수신된 심볼 스트림들을 수신 및 프로세싱한다. RX 데이터 프로세서(260)는 데이터 스트림에 대한 트래픽 데이터를 복원하기 위하여 각각의 검출된 심볼 스트림을 복조, 디인터리빙, 및 디코딩한다. RX 데이터 프로세서(260)에 의한 프로세싱은 전송기 시스템(210)에서 TX MIMO 프로세서(220) 및 TX 데이터 프로세서(214)에 의해 수행된 것과 상보적이다. 프로세서(270)는 어느 프리-코딩 매트릭스를 사용할지(하기에 논의됨)를 주기적으로 결정한다. 프로세서(270) [0034]는 매트릭스 인덱스 부분 및 랭크 값 부분을 포함하는 역방향 링브 메시지를 공식화(formulate)한다.역방향 링크 메시지는 통신 링크 및/또는 수신된 데이터 스트림에 관한 다양한 타입들의 정보를 포함할 수 [0035]있다. 역방향 링크 메시지는 또한 데이터 소스(236)로부터 다수의 데이터 스트림들에 대한 트래픽 데이터를 수신하는 TX 데이터 프로세서(238)에 의해 프로세싱되고, 변조기(280)에 의해 변조되고, 전송기들(254a 내지254r)에 의해 컨디셔닝되고, 전송기 시스템(210)으로 다시 전송된다.전송기 시스템(210)에서, 수신기 시스템(250)으로부터 변조된 신호들은 수신기 시스템(250)에 의해 전송된 역방 [0036]공개특허 10-2011-0050666-11-향 링크 메시지를 추출하기 위하여 안테나(224)에 의해 수신되고, 수신기들(222)에 의해 컨디셔닝되고, 복조기(240)에 의해 복조되고, 그리고 RX 데이터 프로세서(242)에 의해 프로세싱된다. 프로세서(230)는 빔-형성 웨이트들을 결정하기 위하여 어느 프리-코딩 매트릭스를 사용할지를 결정한 다음 추출된 메시지를 프로세싱한다.도 3은 다수의 사용자들을 지원하도록 구성된 예시적인 무선 통신 시스템(300)을 도시하고, 여기서 다양한 개시 [0037]된 실시예들 및 양상들은 구현될 수 있다. 도 3에 도시된 바와 같이, 예를 들어, 시스템(300)은 예를 들어 매크로 셀들(302a-302g) 같은 다중 셀들(302)에 통신을 제공하고, 각각의 셀은 대응하는 액세스 포인트(AP)(304)(AP들 304a-304g 같은)에 의해 서비스된다. 각각의 셀은 하나 이상의 섹터들(예를 들어, 하나 이상의주파수들을 서빙하기 위하여)로 추가로 분할될 수 있다. AT들(306a-306k)을 포함하고, 또한 사용자 장비(UE)또는 이동국들로서 상호 교환하여 사용되는 공지된 다양한 액세스 단말들(AT)(306)은 시스템 전역에 걸쳐 분산된다. 각각의 AT(306)는 예를 들어 AT가 액티브인지 그리고 소프트 핸드오프인지에 따라, 주어진 순간에 순방향 링크(FL) 및/또는 역방향 링크(RL) 상에서 하나 이상의 AP들(304)과 통신할 수 있다. 무선 통신 시스템(300)은 큰 지리적 구역에 걸쳐 서비스를 제공할 수 있고, 예를 들어, 매크로 셀들(302a-302g)은 이웃의 몇몇블록들을 커버할 수 있다.무선 통신 시스템(300)은 확인응답된(acknowledged) 모드(AM), 비확인응답된(unacknowledged) 모드(UM), 및 투 [0038]명(transparent) 모드(TM)에서 상부 계층들에 데이터 전달 서비스들과 함게 RLC 접속 설정 및 해제를 지원하는무선 링크 제어(RLC) 프로토콜 층(RLC 계층)을 포함할 수 있다. 통상적으로, 전송기(예를 들어, AP 304)가 패킷들의 세트를 수신기(예를 들어, AT 306, RLC 피어)에 전송할 때, 전송기는 패킷들이 하이브리드 자동 반복 요청(HARQ) 계층(도시되지 않음)을 통하여 전송되기 때문에, 수신기가 상기 세트 내 패킷들을 실제로 수신하였는지를 알지 못한다. 통상적으로, HARQ 계층은 완전히 신뢰성 있는 전달을 제공하지 못한다, 예를 들어 세트 내의 패킷들은 순서 없이 전달될 수 있거나 전혀 전달될 수 없다. 수신기가 세트 내 패킷들을 수신하였는지 여부를 결정하기 위하여, 전송기는 수신기에게 스테이터스 리포트를 폴링할 것이다. 예를 들어, 폴(poll)은 세트내 하나 이상의 패킷들 내에 포함된 비트, 플래그(flag) 및 등등을 통하여 구현될 수 있다. 그러나, 플래그를포함하는 패킷이 세트 내 다른 패킷들 이전에 수신되었다면, 수신기가 패킷들의 각각을 획득하기 이전에 전송기에 스테이터스 리포트를 전송할 수 있다는 것이 인식될 수 있다. 스테이터스 리포트를 기초로 전송기는 자원들의 비효율적인 사용일 수 있는(이하에 보다 상세히 논의된) 손실 패킷들을 재전송할 수 있다.도 4에서, RLC 피어로부터 폴링 요청들을 프로세싱하기 위한 예시적 시스템의 블록도는 본 명세서의 양상에 따 [0039]라 제공된다. 도시된 바와 같이, 그런 시스템(400)은 하이브리드 자동 반복 요청(HARQ) 계층(406)을 통하여RLC 수신기(404)와 통신하는 RLC 전송기(402)를 포함할 수 있다. RLC 전송기(402)는 프로세서(408) 및 메모리(410)를 포함할 수 있고, RLC 수신기(404)는 도시된 바와 같이 프로세서(412) 및 메모리(414)를 더 포함할 수있다. 도 4에 도시된 시퀀스에 대해, 3 개의 프로토콜 데이터 유닛들(PDU)(PDU1 416, PDU2 418, 및 PDU3 420)은 RLC 전송기(402)로부터 RLC 수신기(404)로 라우팅하는 도중 HARQ 계층(406)에서 도시된다. 도시된 바와같이, 각각의 PDU들(416, 418 및 420)은 순차적 순서로 전송되었고, PDU3(420)는 폴(422)을 포함한다.통상적으로, 도시된 바와 같이 폴링 프로토콜을 사용하여, 폴들(예를 들어, 폴 422)은 HARQ 계층(406)을 통하여 [0040]RLC PDU(예를 들어, PDU3 420)와 인밴드로 전송된다. 예를 들어, LTE 네트워크에서, RLC 수신기(404)는 RLCPDU의 폴링 필드(P 필드)를 일(1)의 값으로 설정함으로써 폴링된다. 통상적으로, RLC 수신기(404)는 폴(422)에응답하여 스테이터스 리포트를 생성한다; 그러나, PDU들(416, 418, 및 420)은 종종 순서 없이 전달된다. 결과적으로, 수신기가 폴(422)을 수신할 때, HARQ 계층(406)에서 수송중 하나 이상의 PDU들이 여전히 있을 수 있다.게다가, 만약 수신기(404)가 스테이터스 리포트를 즉각적으로 생성하면, 이동중인(in-transit) PDU들은 손실로서 처리될 수 있고, 상기 손실은 불필요한 재전송들일 수 있다.도 5로 잠시 돌아가서, PDU들이 순서 없이 수신되는 RLC 피어로부터의 폴링 요청을 프로세싱하기 위한 시스템의 [0041]예시적인 블록도는 본 개선의 양상에 따라 도시된다. 즉, 수신기(404)는 적절하게(예를 들어, 성공적으로) 수신된 PDU3(420)를 가지는 것으로 도시되는 반면, PDU1(416)은 적절하게 수신되지 않았고(예를 들어, 성공적이지않게), PDU2(418)는 이동중이다. 따라서, 만약 스테이터스 리포트가 즉각적으로 생성되면, 스테이터스 리포트는 PDU2(418)이 이동중임에도 불구하고, PDU1(416) 및 PDU2(418) 둘 다가 손실되는 것을 가리킨다.도 6에서, 생성된 스테이터스 리포트(602)가 RLC 수신기(404)로부터 RLC 전송기(402)로 전송되는 RLC 피어로부 [0042]터의 폴링 요청들을 프로세싱하기 위한 시스템의 예시적인 블록도는 도시된다. 이전에 논의된 바와 같이, 스테이터스 리포트(602)는 RLC 수신기(404)로부터 HARQ 계층(406)을 통하여 RLC 전송기(402)로 전송된다. 만약 스테이터스 리포트(602)가 PDU들(예를 들어, PDU1, PDU2, 및 PDU3)의 전송이 완료되기 전에 생성되면, RLC 전송기공개특허 10-2011-0050666-12-는 하나 이상의 PDU들을 불필요하게 재전송할 수 있다. 하기에 보다 상세히 논의된 바와 같이, 현재 개선의 하나의 양상은 RLC 전송기(402)로부터 RLC 수신기(404)로 PDU들의 전송이 완료될 때까지 스테이터스 리포트(602)의 지연 생성을 포함한다.현재 개선의 실시예에서, RLC 수신기(404)는 폴을 수신한 후, 그리고 최대 스테이터스 전송 상태 변수, 또는 [0043]VR(MS)이 폴(422)(예를 들어, PDU3)을 포함하는 PDU의 시퀀스 번호와 동일하거나 초과할 때 스테이터스 리포트(602)를 생성 및 전송한다. VR(MS)은 스테이터스 리포트(602)의 ACK/NACK 필드들에서 운반될 수 있는 PDU들의가장 높은 시퀀스 번호를 저장한다. 상기가 나타내지만 몇몇 예들만들을 나타내고, 당업자가 등가의 예들을 쉽게 식별할 수 있을 것이라는 것이 인식될 것이다. 예를 들어, 실시예는 3 개의 PDU들을 사용하여 도시되지만,개선은 그렇게 제한되지 않고, 실질적으로 임의의 수 및/또는 임의의 타입의 데이터 패킷들을 포함할 수 있다.지금 도 7로 가서, 본 개선의 양상에 따른 무선 링크 제어 피어로부터의 폴링 요청들을 프로세싱하기 위한 예시 [0044]적인 시스템이 도시된다. 시스템(700)은 무선 링크 제어(RLC) 수신기(404), 및 하이브리드 자동 반복 요청(HARQ) 계층(406)을 포함한다. RLC 전송기(도시되지 않음)는 이전에 논의된 바와 같이 HARQ 계층(406)을 통하여 프로토콜 데이터 유닛들(PDU)의 세트를 RLC 수신기(404)(이하 \"수신기\")로 전송할 수 있다. 수신기(404)는HARQ 계층(406)으로부터 하나 이상의 PDU들을 얻거나, 획득하거나, 그렇지 않으면 수신할 수 있는 데이터 수신컴포넌트(702)를 포함한다. 상기 언급된 바와 같이, HARQ 계층(406)은 그들이 전송되었던 순서와 상이한 순서로 PDU들을 수신기(404)로 전달할 수 있다. 예를 들어, HARQ 계층(406)은 순차적인 순서로 3 개의 PDU들(예를들어, PDU1, PDU2, 및 PDU3)의 세트를 수신할 수 있다. 그러나, HARQ 계층(406)은 순차적인 순서와 다른 순서로, 예를 들어 PDU3, PDU1 및 그 다음 PDU2 순으로 3 개의 PDU들의 세트를 전달할 수 있다.수신기(404)는 데이터 수신 컴포넌트(702)에 의해 수신된 PDU들을 분석할 수 있는 패킷 검사 컴포넌트(704)를 [0045]포함한다. 예를 들어, 패킷 검사 컴포넌트(704)는 각각 수신된 PDU의 시퀀스 번호(SN)를 결정할 수 있다. 게다가, 패킷 검사 컴포넌트(704)는 전송기로부터의 폴이 하나 이상의 PDU들에 포함되는지를 결정할 수 있다. 이전에 논의된 바와 같이, 통상적으로 전송기가 패킷들의 세트를 수신기(404)로 전송할 때, 전송기는 HARQ 계층(406)을 통하여 전송된 패킷들을 성공적으로 수신하였는지의 지식을 가지지 않을 것이다. 그러므로, 수신기(404)가 세트 내의 패킷들을 수신하였는지를 결정하기 위하여, 전송기는 수신기(404)에게 스테이터스 리포트를폴링할 것이다. 폴은 예를 들어, 수신기(404)에 전송된 하나 이상의 패킷들에 포함된 비트, 플래그, 및 등등으로서 구현될 수 있다. 추가 예로서, LTE 릴리스 10 표준(Rel-10)에서, 수신기(404)의 폴링은 일(1)의 값을 가지도록 PDU의 폴링 필드(P 필드)를 설정함으로써 달성된다. 검사된 PDU들은 메모리(414)에 유지되거나, 홀딩되거나, 그렇지 않으면 저장된다.수신기(404)는 폴에 응답하여 스테이터스 리포트를 생성할 수 있는 스테이터스 리포트 컴포넌트(706)를 포함하 [0046]고, 스테이터스 리포트는 수신기(404)에 의해 성공적으로 수신된 PDU들을 식별한다. 그러나, 이전에 논의된 바와 같이, 폴을 포함하는 PDU가 세트 내의 다른 패킷들 이전에 수신되었다면, 스테이터스 리포트는 스테이터스리포트 생성 시간에서 이동중인 하나 이상의 PDU들을 손실로서 잘못 식별할 수 있다. 상기 시나리오를 기초로,전송기는 스테이터스 리포트를 기초로 패킷들을 성공적으로 재전송할 수 없다.미성숙(premature) 스테이터스 리포트들을 방지하기 위하여, 수신기(404)는 또한 VR(MS)라 지칭되는 최대 스테 [0047]이터스 전송 상태 변수 컴포넌트를 유지하는 전송 상태 컴포넌트(708)를 더 포함한다. 전송 상태 컴포넌트는VR(MS)의 값(들)을 스테이터스 리포트의 ACK/NACK 필드들에서 수행될 수 있는 PDU들의 가장 높은 시퀀스 번호로설정할 수 있다. 다른 말로, VM(RS)보다 낮은 시퀀스 번호 및/또는 VR(MS)보다 낮거나 같은 시퀀스 번호를 가진 모든 PDU들은 손실되고 HARQ 계층(406)에서 이동중이 아니다. 예를 들어, 3 개의 PDU들(예를 들어, PDU1,PDU2, 및 PDU3)의 세트가 수신기에 전송되었고, VR(MS)이 3의 값을 가지면, PDU1 및 PDU2는 손실되고 이동중이아니다.게다가, 전송 상태 컴포넌트(708)는 수신기(404)에 의해 얻어진 PDU들의 시퀀스 번호들 내 갭들을 결정할 수 있 [0048]다. 예를 들어, PDU1 및 PDU3가 수신기(404)에 의해 성공적으로 수신되었다면, 갭(예를 들어, PDU2)은 검출될것이다. 하나 이상의 갭들의 존재는 SN과 연관된 PDU들이 여전히 이동중일 수 있다는 것을 가리킬 수 있다.그러므로, 전송 상태 컴포넌트(706)는 대기 사이클(예를 들어, 대기 주기, 지연, 등등)을 개시하기 위하여 지연컴포넌트(710)를 시그널링할 수 있다. 지연 컴포넌트(710)는 HARQ 계층(406) 또는 전송기로부터 수신기(404)로PDU의 전송을 위해 예상된 시간을 기초로 대기 사이클을 결정할 수 있다. 예를 들어, 만약 HARQ 계층(406)으로부터 수신기(404)로 PDU의 예상된 전송 시간이 50ns이면, 지연 컴포넌트(710)는 50ns의 대기 사이클을 개시할수 있다. 대기 사이클이 완료될 때, 지연 컴포넌트(710)는 전송 상태 컴포넌트(708)를 통지할 수 있다.공개특허 10-2011-0050666-13-지연 컴포넌트(710)가 대기 사이클을 완료할 때, 도착되지 않은 임의의 PDU들은 이동중이지 않다(예를 들어, 손 [0049]실됨)는 것이 가정된다. 그러므로, 스테이터스 리포트 컴포넌트(706)는 전송 상태 컴포넌트(708)에 유지된VR(MS)의 현재 값을 기초로 스테이터스 리포트를 생성하도록 명령을 받을 수 있다. 부가적으로, 또는 대안적으로, 지연 컴포넌트(710)는 부가적인 대기 사이클들을 구현할 수 있다. 게다가, 지연 컴포넌트는 VR(MS)의 값이폴을 포함하는 패킷의 시퀀스 번호보다 크거나 같을 때까지 대기할 수 있다. 이 기술이 여전히 이동중인 PDU들의 수신 이전에 생성된 스테이터스 리포트를 수신기가 전송기에 전송할 가능성을 방지하거나 감소시킬 수 있다는 것이 인식될 것이다.상기 기술된 예시적인 시스템들의 측면에서, 개시된 청구 대상에 따라 구현될 수 있는 방법론들은 도 8의 흐름 [0050]도를 참조하여 보다 잘 이해될 것이다. 설명의 단순화를 위해, 방법론들이 일련의 블록들로서 도시 및 기술되었지만, 몇몇 블록들이 여기에 도시 및 기술된 바와 상이한 블록들을 상이한 순서들로 및/또는 동시에 발생할수 있기 때문에, 청구된 청구 대상이 블록들의 순서에 의해 제한되지 않은 것이 이해 및 인식될 것이다. 게다가, 모든 도시된 블록들이 이후에 기술된 방법론들을 구현하기 위하여 요구될 수 없다.도 8을 참조하여, 무선 링크 제어 피어들로부터 폴링 요청들을 프로세싱하는 예시적인 방법론은 본 개선의 양상 [0051]에 따라 도시된다. 802에서, 프로토콜 데이터 유닛(PDU)은 얻어질 수 있거나, 획득될 수 있거나, 그렇지 않으면 수신된다. 이전에 논의된 바와 같이, 무선 링크 제어(RLC) 전송기는 하이브리드 자동 반복 요청(HARQ) 계층을 통하여 RLC 수신기로 프로토콜 데이터 유닛들(PDU)의 세트를 전송할 수 있다. 804에서, 수신된 PDU는 프로세싱될 수 있고, 예를 들어 상기 프로세싱은 PDU와 연관된 시퀀스 번호를 결정하고, 폴링 요청이 PDU에 포함되는지를 결정하고, 그리고 기타 등등을 포함한다. 시퀀스 번호는 특히 PDU들의 세트 중 PDU를 식별하는 유일한식별자이고, 폴링 요청은 하나 이상의 전송된 PDU들의 전송 스테이터스에 관한 RLC 전송기로부터의 스테이터스리포트에 대한 요청이다. 상기 논의된 바와 같이, RLC 전송기는 통상적으로 PDU들이 RLC 수신기에 의해 성공적으로/실패하여 수신되는지의 지식을 가지지 않을 것이고, 전송된 패킷들의 스테이터스를 발견하기 위하여 수신기를 폴링할 것이다.806에서, VR(MS)라 지칭되는 최대 스테이터스 전송 상태 변수 컴포넌트는 적어도 부분적으로 수신된 PDU를 기초 [0052]로 결정될 수 있다. VR(MS)은 스테이터스 리포트의 ACK/NACK 필드들에서 운반될 수 있는 PDU들의 가장 높은 시퀀스 번호(SN)를 저장한다. 예를 들어, 3 개의 PDU들의 세트가 수신기에 전송되었고, PDU1이 손실되었다면,PDU2는 여전히 HARQ 계층에서 이동중이고, PDU3는 수신기에 의해 성공적으로 얻어지고, 그 다음 VR(MS)은 PDU3의 시퀀스 번호를 기초로 할 것이다.808에서, 결정은 PDU가 폴링 요청을 포함하는지에 대해 이루어진다. 예를 들어, 폴링 요청은 수신기에 전송된 [0053]하나 이상의 패킷들에 포함된 비트, 플래그, 및 등등일 수 있다. 추가 예로서, LTE 릴리스 10 표준(Rel-10)에서, 수신기의 폴링은 일(1)의 값을 가지도록 PDU의 폴링 필드(P 필드)를 설정함으로써 달성된다. 812에서, 폴링 요청이 PDU에 포함되지 않으면, 결정은 폴링 요청이 이전에 수신된 PDU에 포함되었는지에 대해 이루어진다.폴링 요청이 이전에 수신되지 않았다면, 방법은 802로 되돌아간다. 폴링 요청이 이전에 수신된 PDU에 포함되었다면, 방법은 814로 진행한다(이하에 보다 상세히 논의됨).814에서, 폴링 요청이 PDU(또는 이전 PDU)에 포함되면, 결정은 폴링 요청을 포함하는 PDU의 SN(예를 들어, PS [0054]N)이 VR(MS)보다 작은지에 대해 이루어진다. PSN이 VR(MS)보다 작지 않으면, 816에서 결정은 지연들의 미리 결정된 최대 수가 구현되었는지 및/또는 지연 시간의 미리 결정된 최대 양(예를 들어, 최대)이 경과되었는지에 대해 이루어진다. 만약 최대가 만족되지 않으면, 818에서 지연(예를 들어, 대기 상태, 대기 사이클, 등등)은 814로 되돌아가기 전에 구현된다; 그러나, 만약 미리 결정된 최대가 만족되었다면 방법은 820으로 진행한다(하기에논의됨). 예를 들어, 지연은 부가적인 PDU들의 전달을 허용하도록 적어도 부분적으로 HARQ 계층으로부터 수신기로 예상된 전달 시간을 기초로 할 수 있다. 814에서, PSN이 VR(MS)보다 작으면 스테이터스 리포트는 820에서생성된다. 스테이터스 리포트는 성공적으로 수신되었던 PDU들 및/또는 성공적으로 수신되지 않은 PDU들을 전송기에게 가리킬 것이다. 스테이터스 리포트를 기초로, 전송기는 성공적으로 수신되지 않은 것을 재전송할 수 있다.도 9는 본 개선에 따른 하나 이상의 특징들을 자동화하는 것을 돕는 인공 지능(AI) 컴포넌트(902)를 이용하는 [0055]시스템(900)을 도시한다. 본 개선(예를 들어, 추론과 관련하여)은 다양한 양상들을 수행하기 위한 다양한 AI-기반 방식들을 이용할 수 있다. 예를 들어, 스테이터스 리포트를 전송하기 전에 지연에 대한 기간을 결정하기위한 프로세스는 자동 분류기 시스템 및 프로세스를 통하여 촉진될 수 있다.여기에 사용된 바와 같이, 용어 \"추론\"은 일반적으로 이벤트들 및/또는 데이터를 통하여 캡쳐될 바와 같은 관찰 [0056]공개특허 10-2011-0050666-14-들의 세트로부터 시스템, 환경, 및/또는 사용자의 상태들에 관한 추론 또는 추리하는 프로세스를 일반적으로 지칭한다. 추론은 특정 환경 또는 동작을 식별하기 위하여 사용될 수 있거나, 예를 들어 상태들에 걸쳐 가능성분포를 생성할 수 있다. 추론은 확률적(probabilistic)일 수 있다 ― 즉, 데이터 및 이벤트들의 고려를 기초로관심 상태들에 걸친 가능성 분포의 계산. 추론은 또한 이벤트들 및/또는 데이터의 세트로부터 보다 높은-레벨이벤트들을 구성하기 위하여 사용된 기술들을 지칭할 수 있다. 그런 추론은 이벤트들이 밀접한 시간 근접도에서 상관되든 아니든, 그리고 이벤트들 및 데이터가 하나의 이벤트 및 데이터 소스들로부터 발생하든 몇몇의 이벤트 및 데이터 소스들로부터 발생하든 관찰된 이벤트들 및/또는 저장된 이벤트 데이터의 세트로부터 새로운 이벤트들 또는 동작들의 구성을 유발한다. 게다가, 추론은 규칙들의 논리적 모델들을 기초로 하여, 컴포넌트들또는 데이터 사이의 관계는 데이터의 분석 및 분석으로부터 결론들 도출에 의해 결정된다. 예를 들어, 하나의사용자가 네트워크를 통하여 다른 사용자들의 서브세트와 상호작용하는 것을 관찰함으로써, 사용자들의 이런 서브세트가 결코 또는 거의 상호작용되지 않는 다수의 다른 사용자들과 반대로 하나의 사용자에 대하여 관심 있는원하는 소셜 네트워크에 속한다는 것이 결정되거나 추론될 수 있다. 상이한 독립 패턴들을 제공하는 예를 들어 네이브 베이어즈( ), 베이지안 네트워크들, 결정 트리 [0057]들, 신경망들, 퍼지 논리 모델들 및 기연성 분류 모델들을 포함하는 직접적인 그리고 간접적인 모델 분류 접근법들은 이용될 수 있다. 여기에 사용된 바와 같은 분류는 또한 우선순위 모델들을 개발하기 위하여 사용된 통계적 회귀(regression)의 포함이다.본 개선으로부터 쉽게 이해될 바와 같이, 본 개선은 명시적으로 훈련될 뿐 아니라(예를 들어, 일반적인 훈련 데 [0058]이터를 통하여) 암시적으로 훈련되는(예를 들어, 사용자 행동을 관찰, 외부 정보를 수신을 통하여) 분류기들을이용할 수 있다. 따라서, 분류기(들)는 미리 결정된 기준에 따라, 이전에 추론된 스키마(schema)를 언제 업데이트하거나 정련(refine)할지, 프로세싱되는 데이터의 종류(예를 들어, 금융 대 비금융, 개인적 대 비개인적 데이터)를 기초로 추론 알고리즘에 대한 기준을 강화할지, 및 하루 중 어느 시간에(예를 들어, 시스템 성능이 덜영향을 받을 밤에) 보다 강화된 기준 제어를 구현할지를 결정하는 것을 포함하는 ― 이것으로 제한되지 않음 ―다수의 기능들을 자동으로 학습하고 수행하기 위하여 사용될 수 있다.도 10을 참조하여, 무선 통신 시스템에서 무선 링크 제어 피어들로부터 프로세싱 폴링 요청들을 촉진하는 시스 [0059]템(1000)의 예시적인 블록도가 도시된다. 예를 들어, 시스템(1000)은 모바일 디바이스 내에 적어도 부분적으로상주할 수 있고, 등등이 이루어질 수 있다. 시스템(1000)이 프로세서, 소프트웨어, 또는 이들의 조합(예를 들어, 펌웨어)에 의해 구현되는 기능들을 나타내는 기능 블록들일 수 있는 기능 블록들을 포함하는 것으로 표현되는 것이 인식될 것이다. 시스템(100)은 협력하여 동작할 수 있는 모듈들의 논리적 그룹화부(1002)를 포함한다.예를 들어, 논리적 그룹화부(1002)는 무선 통신 네트워크를 통하여 하나 이상의 프로토콜 데이터 유닛들(PDU)을수신하기 위한 모듈을 포함할 수 있다. 게다가, 논리적 그룹화부(1002)는 시퀀스 번호들을 결정하는 것 및 폴링 요청(1006)의 위치를 결정하는 것을 포함하는 프로토콜 데이터 유닛들을 분석하기 위한 모듈을 포함할 수 있다. 게다가, 논리적 그룹화부(1002)는 폴링 요청을 포함하는 PDU의 시퀀스 번호를 VR(MS)에 비교하기 위한 모듈을 포함할 수 있다. 부가적으로, 시스템(1000)은 적어도 부분적으로 VR(MS)(1010)를 기초로 폴링 요청에 응답하여 스테이터스 리포트를 생성하기 위한 모듈을 포함할 수 있다. 게다가, 시스템(1000)은 모듈들(1004,1006, 1008 및 1010)과 연관된 기능들을 실행하기 위한 명령들을 유지하는 메모리(1012)를 포함할 수 있다. 메모리(1012) 외부에 있는 것으로 도시되지만, 하나 이상의 모듈들(1004, 1006, 1008 및 1010)이 메모리(1012)내에 존재할 수 있다는 것이 이해될 것이다.여기에 개시된 실시예들과 관련하여 기술된 다양한 도시된 논리들, 논리 블록들, 모듈들, 및 회로들은 범용 프 [0060]로세서, 디지털 신호 프로세서(DSP), 주문형 반도체(ASIC), 필드 프로그램 가능 게이트 어레이(FPGA) 또는 다른프로그램 가능 논리 디바이스, 이산 게이트 또는 트랜지스터 논리부, 이산 하드웨어 컴포넌트들, 또는 여기에기술된 기능들을 수행하도록 설계된 임의의 조합으로 구현되거나 수행될 수 있다. 범용 프로세서는 마이크로프로세서일 수 있지만, 대안으로, 프로세서는 임의의 통상적인 프로세서, 제어기, 마이크로제어기, 또는 상태 머신일 수 있다. 프로세서는 또한 컴퓨팅 디바이스들의 조합, 예를 들어 DSP 및 마이크로프로세서의 조합, 다수의 마이크로프로세서들, DSP 코어와 협력하는 하나 이상의 마이크로프로세서들, 또는 임의의 다른 그런 구성으로서 구현될 수 있다. 부가적으로, 적어도 하나의 프로세서는 상기된 하나 이상의 단계들 및/또는 동작들을 수행하기 위하여 동작하는 하나 이상의 모듈들을 포함할 수 있다.게다가, 여기에 개시된 양상들과 관련하여 기술된 방법 또는 알고리즘의 단계들 및/또는 동작들은 하드웨어, 프 [0061]로세서에 의해 실행되는 소프트웨어 모듈, 또는 두 개의 조합으로 직접적으로 구현될 수 있다. 소프트웨어 모공개특허 10-2011-0050666-15-듈은 RAM 메모리, 플래시 메모리, ROM 메모리, EPROM 메모리, EEPROM 메모리, 레지스터들, 하드 디스크, 제거가능 디스크, CD-ROM 또는 종래에 공지된 저장 매체의 임의의 다른 형태에 상주할 수 있다. 예시적인 저장 매체는 프로세서에 결합될 수 있어서, 프로세서는 저장 매체로부터 정보를 판독하고, 저장 매체에 정보를 기록할수 있다. 대안으로, 저장 매체는 프로세서에 일체형일 수 있다. 게다가, 몇몇 양상들에서, 프로세서 및 저장매체는 ASIC에 상주할 수 있다. 부가적으로, ASIC는 사용자 단말에 상주할 수 있다. 대안으로, 프로세서 및저장 매체는 사용자 단말 내 이산 컴포넌트들로서 상주할 수 있다. 부가적으로, 몇몇 양상들에서, 방법 또는알고리즘의 단계들 및/또는 동작들은 하나 또는 임의의 조합으로서 상주할 수 있거나 컴퓨터 프로그램 물건에통합될 수 있는 머신 판독 가능 매체 및/또는 컴퓨터 판독 가능 매체 상에 또는 코드들 및/또는 명령들의 세트로서 상주할 수 있다. 하나 이상의 양상들에서, 기술된 기능들은 하드웨어, 소프트웨어, 펌웨어, 또는 이들의 임의의 결합으로 구현될 [0062]수 있다. 소프트웨어로 구현되면, 기능들은 컴퓨터-판독 가능 매체 상의 하나 이상의 명령들 또는 코드로서 저장되거나 전송될 수 있다. 컴퓨터-판독 가능 매체는 하나의 장소에서 다른 장소로 컴퓨터 프로그램의 전달을촉진하는 임의의 매체를 포함하는 컴퓨터 저장 매체 및 통신 매체 둘 다를 포함한다. 저장 매체는 컴퓨터에 의해 액세스될 수 있는 임의의 이용 가능한 매체일 수 있다. 예를 들어, 그리고 제한 없이, 그런 컴퓨터-판독 가능 매체는 RAM, ROM, EEPROM, CD0ROM 또는 다른 광학 디스크 저장소, 자기 디스크 저장소 또는 다른 자기 저장디바이스들, 또는 명령들 또는 데이터 구조들 형태의 원하는 프로그램 코드를 운반하거나 저장하기 위하여 사용될 수 있고 컴퓨터에 의해 액세스될 수 있는 임의의 다른 매체를 포함할 수 있다. 또한, 임의의 접속부는 컴퓨터-판독 가능 매체라 지칭될 수 있다. 예를 들어, 소프트웨어가 동축 케이블, 광섬 케이블, 트위스티드 페어(twisted pair), 디지털 가입자 라인(DSL), 적외선, 무선, 및 마이크로파 같은 무선 기술들을 사용하여 웹사이트, 서버, 또는 다른 원격 소스로부터 전송되면, 동축 케이블, 광섬유 케이블, 트위스팅 페어, DSL, 또는 적외선, 무선, 및 마이크로파 같은 무선 기술들은 매체의 정의 내에 포함된다. 여기에 사용된 바와 같은 Disk 및disc는 컴팩트 디스크(CD), 레이저 디스크, 광학 디스크, 디지털 다기능 디스크(DVD), 플로핑 디스크 및 블루-레이 디스크를 포함하고, 여기서 disk들이 일반적으로 데이터를 자기적으로 재생하는 반면, disc들은 일반적으로 레이저들을 사용하여 광학적으로 데이터를 재생한다. 상기의 조합들은 또한 컴퓨터-판독 가능 매체의 범위내에 포함될 수 있다.상기 개시물이 도시된 양상들 및/또는 실시예들을 개시하지만, 다양한 변화들 및 변형들이 첨부된 청구항들에 [0063]의해 정의된 바와 같이 기술된 양상들 및/또는 실시예들의 범위에서 벗어나지 않고 여기에서 이루어질 수 있다는 것이 주의되어야 한다. 게다가, 비록 기술된 양상들 및/또는 실시예들의 엘리먼트들이 단수로 기술되거나청구될 수 있지만, 단수로의 제한이 명시적으로 언급되지 않으면 복수가 고려된다. 부가적으로, 임의의 양상및/또는 실시예의 모두 또는 일부는 반대로 언급되지 않으면 임의의 다른 양상 및/또는 실시예 전부 또는 일부와 함께 사용될 수 있다.공개특허 10-2011-0050666-16-도면도면1도면2공개특허 10-2011-0050666-17-도면3공개특허 10-2011-0050666-18-도면4공개특허 10-2011-0050666-19-도면5공개특허 10-2011-0050666-20-도면6공개특허 10-2011-0050666-21-도면7공개특허 10-2011-0050666-22-도면8공개특허 10-2011-0050666-23-도면9공개특허 10-2011-0050666-24-도면10공개특허 10-2011-0050666-25-"}
{"patent_id": "10-2011-7005463", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "이 개선 기술은 프로토콜 데이터 유닛들의 전송을 위한 시스템들 및 방법들에 관한 것이고, 구체적으로 무선 링 크 제어 피어로부터 폴링 요청(polling request)들을 프로세싱하는 것에 관한 것이다. 무선 링크 제어 전송기는 데이터 패킷들의 세트 상태에 관한 리포트를 얻기 위하여 수신기를 폴링할 수 있고, 상기 폴링들은 데이터 패킷 과 인-밴드(in-band)로 송신될 수 있다. 수신기는 수신된 데이터 패킷들의 하나 이상의 특성들을 기초로 상태 리포트를 송신하기 전에 대기하도록 결정할 수 있다."}
{"patent_id": "10-2011-7005463", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 특허 출원은 2008년 8월 8일에 출원되고, 본 출원인에게 양도되고 여기에 참조로써 명확히 통합된 발명의 명 칭이 \"PROCESSING A POLLING REQUEST FROM AN RLC PEER\"인 가 출원 번호 61/087,606에 대한 우선권을 주장한다. 본 양상들은 무선 통신에 관한 것이고, 보다 구체적으로 무선 링크 제어 피어(radio link control peer)로부터 폴링 요청(polling request)을 프로세싱하기 위한 기술들에 관한 것이다."}
{"patent_id": "10-2011-7005463", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "무선 통신 시스템들은 음성, 데이터, 및 등등 같은 다양한 타입들의 통신 콘텐츠를 제공하기 위하여 널리 전개 되었다. 이들 시스템들은 이용 가능한 시스템 자원들(예를 들어, 대역폭 및 전송 전력)을 공유함으로써 다중 사용자들과의 통신을 지원할 수 있는 다중-접속 시스템들일 수 있다. 그런 다중-접속 시스템들의 예들은 코드 분할 다중 접속(CDMA) 시스템들, 시분할 다중 접속(TDMA) 시스템들, 주파수 분할 다중 접속(FDMA) 시스템들, 3GPP 롱텀 에볼루션(Long Term Evolution)(LTE) 시스템들, 및 직교 주파수 분할 다중 접속(OFDMA) 시스템들을 포함한다. 일반적으로, 무선 다중-접속 통신 시스템은 다중 무선 단말들에 대한 통신을 동시에 지원할 수 있다. 각각의 단말은 순방향 링크 및 역방향 링크 상에서의 전송들을 통하여 하나 이상의 기지국들과 통신한다. 순방향 링크 (또는 다운링크)는 기지국들로부터 단말들로의 통신 링크를 지칭하고, 역방향 링크(또는 업링크)는 단말들로부 터 기지국들로의 통신 링크를 지칭한다. 이런 통신 링크는 단일-입력-단일-출력, 다중-입력-단일-출력 또는 다 중-입력-다중-출력(MIMO) 시스템을 통하여 설정될 수 있다. MIMO 시스템은 데이터 전송을 위해 다중(NT) 전송 안테나들 및 다중(NR) 수신 안테나들을 이용한다. NT 전송 안테나 및 NR 수신 안테나에 의해 형성된 MIMO 채널은 공간 채널들 (NS) 독립적 채널들의 세트로 분해될 수 있 고, 여기서 NS 독립 채널들의 각각은 차원(dimension)에 대응한다. MIMO 시스템은 다중 전송 안테나 및 수신 안테나에 의해 생성된 부가적인 차원성(dimensionality)들이 사용되면 개선된 성능(예를 들어, 보다 높은 처리 량 및/또는 보다 큰 신뢰성)을 제공할 수 있다. MIMO 시스템은 시분할 듀플렉스(TDD) 및 주파수 분할 듀플렉스(FDD) 시스템들을 지원한다. TDD 시스템에서, 순 방향 및 역방향 링크 전송들은 동일한 주파수 구역에서 이루어지므로, 상호성(reciprocity) 원리는 역방향 링크 채널로부터 순방향 링크 채널의 측정을 허용한다. 이것은 다중 안테나들이 액세스 포인트에서 이용 가능할 때 액세스 포인트가 순방향 링크 상에서 전송 빔형성 이득을 추출하게 한다."}
{"patent_id": "10-2011-7005463", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "다음은 그런 양상들의 기본적인 이해를 제공하기 위하여 하나 이상의 양상들의 간략화된 요약을 제공한다. 이"}
{"patent_id": "10-2011-7005463", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 3, "content": "요약은 모든 생각되는 양상들의 넓은 개관이 아니고, 모든 양상들의 핵심 또는 중요 엘리먼트들을 식별하지도 임의의 또는 모든 양상들의 범위를 기술하지도 않도록 의도된다. 그 유일한 목적은 추후에 제공되는 보다 상세 한 설명에 대한 서론으로서 간략화된 형태로 하나 이상의 양상들의 몇몇 개념들을 제공하는 것이다. 하나 이상의 양상들 및 대응하는 개시에 따라, 다양한 양상들은 무선 링크 제어 피어들로부터 폴링 요청들을 프 로세싱하는 것과 관련하여 기술된다. 관련된 양상들에 따라, 무선 링크 제어 피어들로부터의 폴링 요청들을 프로세싱하기 위한 방법은 제공된다. 상기 방법은 데이터 패킷들의 세트를 수신하는 단계, 상기 데이터 패킷들의 적어도 하나의 특성을 결정하는 단계, 및 상태 리포트를 생성할지를 결정하기 위하여 상기 특성들을 기준 값과 비교하는 단계를 포함한다. 다른 양상은 무선 링크 제어 피어들로부터 폴링 요청들을 프로세싱하도록 구성된 적어도 하나의 프로세서를 가 진 무선 통신 장치에 관한 것이다. 무선 통신 장치는 적어도 하나의 프로토콜 데이터 유닛을 수신하기 위한 제 1 모듈, 프로토콜 데이터 유닛과 연관된 시퀀스 번호를 결정하기 위한 제 2 모듈, 프로토콜 데이터 유닛에 포함 된 폴링 요청을 검출하기 위한 제 3 모듈, 포함된 폴링 요청을 가진 프로토콜 데이터 유닛의 시퀀스 번호를 최 대 스테이터스(status) 전송 상태 변수의 값에 비교하기 위한 제 4 모듈, 및 포함된 폴링 요청을 가진 프로토콜 데이터의 시퀀스 번호가 최대 스테이터스 전송 상태 변수의 값과 같거나 작은 것 중 적어도 하나이면 스테이터 스 리포트를 생성하기 위한 제 5 모듈을 포함한다. 아직 다른 양상은 컴퓨터 프로그램 물건에 관한 것이다. 컴퓨터 프로그램 물건은 컴퓨터가 하나 이상의 프로토 콜 데이터 유닛들을 얻게 하기 위한 코드들의 제 1 세트, 컴퓨터가 각각의 프로토콜 데이터 유닛들에 대한 시퀀 스 번호의 위치를 결정(locate) 하게 하기 위한 코드들의 제 2 세트, 컴퓨터가 프로토콜 데이터 유닛들에서 폴 링 비트의 값을 검출하게 하기 위한 코드들의 제 3 세트, 프로토콜 데이터 유닛의 시퀀스 번호를 최대 스테이터 스 전송 상태 변수의 값에 비교하게 하기 위한 코드들의 제 4 세트 ― 상기 프로토콜 데이터 유닛에서 폴링 비 트의 값은 1임 ―, 및 프로토콜의 시퀀스 번호가 최대 스테이터스 전송 상태 변수의 값보다 같거나 작은 것 중 적어도 하나이면 컴퓨터가 스테이터스 리포트를 생성하게 하기 위한 코드들의 제 5 세트 ― 상기 프로토콜 데이 터 유닛 내 폴링 비트의 값은 1임 ― 를 포함한다. 아직 다른 양상은 장치에 관한 것이다. 장치는 하나 이상의 데이터 패킷들을 획득하기 위한 수단, 데이터 패킷 들을 프로세싱하기 위한 수단 ― 상기 프로세싱은 각각의 데이터 패킷에 대한 시퀀스 번호를 결정하거나, 폴이 각각의 패킷 내에 포함되는지를 식별하는 것 중 적어도 하나를 포함함 ―, 최대 스테이터스 전송 상태 변수에 대한 값을 결정하기 위한 수단 ― 상기 최대 스테이터스 전송 상태 변수는 스테이터스 리포트의 확인응답/부정 확인응답 필드(field) 내에서 운반될 수 있는 수신된 데이터 패킷들의 세트의 가장 높은 시퀀스 번호를 저장함 ―, 및 최대 스테이터스 전송 상태 변수의 값에 관련한 폴을 포함하는 데이터 패킷의 시퀀스 번호를 평가하기 위한 수단을 포함한다. 게다가 부가적인 양상은 장치에 관한 것이다. 장치는 하나 이상의 패킷들을 얻는 데이터 수신 컴포넌트, 시퀀 스 번호 및 각각의 수신된 패킷에 대한 폴링 요청의 존재를 결정하는 패킷 검사 컴포넌트, 및 적어도 부분적으 로 기준 값에 대해 패킷의 시퀀스 번호의 비교를 기초로 스테이터스 리포트를 생성하는 스테이터스 리포트 컴포 넌트 ― 상기 폴링 요청은 패킷 내에 존재함 ― 를 포함한다. 아직 다른 양상은 무선 통신 장치에 관한 것이다. 무선 통신 장치는 무선 통신 장치는 적어도 하나의 수신된 데이터 패킷을 저장하는 메모리, 및 데이터 패킷들의 적어도 하나의 특성을 결정하고, 스테이터스 리포트를 생 성할지를 결정하기 위하여 상기 특성들을 기준 값과 비교하도록 구성된 프로세서를 포함한다. 상기 및 관련된 목적들을 달성하기 위해, 하나 이상의 양상들은 이후 충분히 기술되고 특히 청구항들에 지적되 는 특징들을 포함한다. 다음 설명 및 첨부된 도면들은 하나 이상의 양상들의 특정 도시된 특징들을 상세히 나 타낸다. 이들 특징들은 다양한 양상들의 원리들이 이용될 수 있는 다양한 방식들 중 소수를 가리키고, 이 설명 은 모든 그런 양상들 및 그들의 등가물들을 포함하도록 의도된다."}
{"patent_id": "10-2011-7005463", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "다양한 양상들은 도면들을 참조하여 지금 기술된다. 다음 상세한 설명에서, 설명을 위해, 다수의 특정 상세한 것들은 하나 이상의 양상들의 완전한 이해를 제공하기 위하여 나타난다. 그러나, 그런 양상(들)이 이들 특정 상세한 것들 없이 실시될 수 있다는 것은 명백할 수 있다. 이 출원에 사용된 바와 같이, 용어들 \"컴포넌트\", \"모듈\", \"시스템\" 및 등등은 하드웨어, 펌웨어, 하드웨어 및 소프트웨어의 조합, 소프트웨어, 또는 실행 소프트웨어 같은 컴퓨터-관련 엔티티를 포함하지만, 그것으로 제한 되지 않도록 의도된다. 예를 들어, 컴포넌트는 프로세서상에서 동작하는 프로세스, 프로세서, 객체, 실행 가능, 실행 스레드, 프로그램, 및/또는 컴퓨터일 수 있지만, 이것으로 제한되지 않는다. 도시에 의해, 컴퓨팅 디바이스에서 동작하는 애플리케이션 및 컴퓨팅 디바이스 둘 다는 컴포넌트일 수 있다. 하나 이상의 컴포넌트 들은 프로세스 및/또는 실행 스레드 내에 상주할 수 있고 컴포넌트는 하나의 컴퓨터상에 배치될 수 있고/있거나 둘 이상의 컴퓨터들 사이에 분산될 수 있다. 게다가, 이들 컴포넌트들은 저장된 다양한 데이터 구조들을 가진 다양한 컴퓨터 판독 가능 매체로부터 실행할 수 있다. 컴포넌트들은 로컬 시스템, 분산 시스템의 다른 컴포넌 트, 및/또는 신호에 의해 인터넷 같은 네트워크를 거쳐 다른 시스템들과 상호작용하는 하나의 컴포넌트로부터 의 데이터 같은 하나 이상의 데이터 패킷들을 가진 신호에 따라 로컬 및/또는 원격 프로세스들에 의해 통신할 수 있다. 게다가, 다양한 양상들은 유선 단말 또는 무선 단말일 수 있는 단말과 관련하여 여기에 기술된다. 단말은 또한 시스템, 디바이스, 가입자 유닛, 가입자 국, 이동국, 모바일, 모바일 디바이스, 원격 국, 원격 단말, 액세스 단 말, 사용자 단말, 단말, 통신 디바이스, 사용자 에이전트, 사용자 디바이스, 또는 사용자 장비(UE)라 지칭될 수 있다. 무선 단말은 셀룰러 전화, 위성 폰, 무선 전화, 세션 개시 프로토콜(SIP) 폰, 무선 로컬 루프(WLL) 국, 개인휴대정보단말(PDA), 무선 접속 능력을 가진 핸드헬드 디바이스, 컴퓨팅 디바이스, 또는 무선 모뎀에 접속된 다른 프로세싱 디바이스들일 수 있다. 게다가, 다양한 양상들은 기지국과 관련하여 여기에 기술된다. 기지국 은 무선 단말(들)과 통신하기 위해 사용될 수 있고 또한 액세스 포인트, 노드 B, 또는 몇몇 다른 용어로 지칭될 수 있다. 게다가, 용어 \"또는\"은 배타적 \"또는\"이기 보다 포괄적 \"또는\"을 의미하는 것으로 의도된다. 즉, 다르게 지정 되지 않거나, 문맥으로부터 명확하면, 어구 \"X는 A 또는 B를 이용한다\"는 임의의 자연적인 포괄적인 순열들을 의미하는 것으로 의도된다. 즉, 어구 \"X는 A 또는 B를 이용한다\"는 임의의 다음 예들에 의해 만족된다: X는 A 를 이용한다; X는 B를 이용한다; 또는 X는 A 및 B 둘 다를 이용한다. 게다가, 이 출원 및 첨부된 청구항들에서 사용된 바와 같은 관사들은 일반적으로 단수 형태로 지시되도록 다르게 지정되지 않거나 문맥으로부터 명백하면 \"하나 이상\"을 의미하는 것으로 이해되어야 한다. 여기에 기재된 기술들은 CDMA, TDMA, FDMA, OFDMA, SC-FDMA 및 다른 시스템들 같은 다양한 무선 통신 시스템들 을 위해 사용될 수 있다. 용어들 \"시스템\" 및 \"네트워크\"는 종종 상호 교환하여 사용된다. CDMA 시스템은 UTRA(Universal Terrestrial Radio Access), cdma2000, 등등 같은 무선 기술을 구현할 수 있다. UTRA는 광대 역-CDMA(W-CDMA) 및 CDMA의 다른 변형들을 포함한다. 게다가, cdma2000은 IS-2000, IS-95 및 IS-856 표준들을 커버한다. TDMA 시스템은 GSM(Global System for Mobile Communications) 같은 무선 기술을 구현할 수 있다. OFDMA 시스템은 이벌빙된 UTRA(E-UTRA), UMB(Ultra Mobile Broadband), IEEE 802.11(Wi-Fi), IEEE 802.16(WiMAX), IEEE 802.16(WiMAX), IEEE 802.20, Flash-OFDM□, 등등을 구현할 수 있다. UTRA 및 E-UTRA는 UMTS(Universal Mobile Telecommunication System)의 일부이다. 3GPP 롱 텀 에볼루션(LTE)는 다운링크 상에서 OFDMA를 이용하고 업링크 상에서 SC-FDMA를 이용하는 E-UTRA를 사용하는 UMTS의 릴리스이다. UTRA, E-UTRA,UMTS, LTE 및 GSM은 \"3세대 파트너쉽 프로젝트\"(3GPP)이라 지칭되는 조직으로부터 문헌들에 기재된다. 부가적 으로, cdma2000 및 UMB는 \"3세대 파트너쉽 프로젝트 2\"(3GPP2)라 지칭되는 조직으로부터의 문헌들에 기재된다. 추가로, 그런 무선 통신 시스템들은 부가적으로 종종 언페어 언라이센싱 스펙트럼들, 802.xx 무선 LAN, BLUETOOTH 및 임의의 다른 단거리 또는 장거리 무선 통신 기술들을 사용하는 피어-투-피어(peer-to-peer)(예를 들어, 모바일-대-모바일) 애드 혹(ad hoc) 네트워크 시스템들을 포함할 수 있다. 다양한 양상들 또는 특징들은 다수의 디바이스들, 컴포넌트들, 모듈들, 및 등등을 포함할 수 있는 시스템들의 측면에서 제공될 것이다. 다양한 시스템들이 부가적인 디바이스들, 컴포넌트들, 모듈들, 등등을 포함할 수 있 고/있거나 도면들과 관련하여 논의된 모든 디바이스들, 컴포넌트들, 모듈들, 등등을 포함할 수 없다는 것이 이 해 및 인식될 것이다. 이들 접근법들의 조합은 또한 사용될 수 있다. 도 1을 지금 참조하여, 무선 통신 시스템은 여기에 제공된 다양한 실시예들에 따라 도시된다. 시스템 은 다중 안테나 그룹들을 포함할 수 있는 기지국을 포함한다. 예를 들어, 하나의 안테나 그룹은 안 테나들(104 및 106)을 포함할 수 있고, 다른 그룹은 안테나들(108 및 110)을 포함할 수 있고, 그리고 부가적인 그룹은 안테나들(112 및 114)을 포함할 수 있다. 각각의 안테나 그룹에 대해 두 개의 안테나들이 도시된다; 그 러나, 많거나 적은 안테나들은 각각의 그룹에 사용될 수 있다. 기지국은 부가적으로 전송기 체인(chain) 및 수신기 체인을 포함할 수 있고, 그 각각은 차례로 당업자에 의해 인식될 바와 같이 신호 전송 및 수신(예를 들어, 프로세서들, 변조기들, 멀티플렉서들, 복조기들, 디멀티플렉서들, 안테나들, 등등)과 연관된 다수의 컴포 넌트들을 포함할 수 있다. 기지국은 모바일 디바이스 및 모바일 디바이스 같은 하나 이상의 모바일 디바이스들과 통신할 수 있다; 그러나, 기지국이 모바일 디바이스들(116 및 122)과 유사한 실질적으로 임의의 수의 모바일 디바 이스들과 통신할 수 있다는 것이 인식될 것이다. 모바일 디바이스들(116 및 122)은 예를 들어, 셀룰러 폰들, 스마트 폰들, 랩탑들, 핸드헬드 통신 디바이스들, 핸드헬드 컴퓨팅 디바이스들, 위성 무선들, 글로벌 위치 결정 시스템들, PDA들, 및/또는 무선 통신 시스템을 통해 통신하기 위한 임의의 다른 적당한 디바이스일 수 있 다. 도시된 바와 같이, 모바일 디바이스는 안테나들(112 및 114)과 통신하고, 여기서 안테나들(112 및 114)은 순방향 링크를 통해 모바일 디바이스에 정보를 전송하고 역방향 링크를 통하여 모바일 디바이스로부터 정보를 수신한다. 게다가, 모바일 디바이스는 안테나들(104 및 106)과 통신하고, 여 기서 안테나들(104 및 106)은 순방향 링크를 통하여 모바일 디바이스로 정보를 전송하고 역방향 링크 를 통하여 모바일 디바이스로부터 정보를 수신한다. 주파수 분할 듀플렉스(FDD) 시스템에서, 순방향 링크는 역방향 링크에 의해 사용된 상이한 주파수 대역을 사용할 수 있고, 순방향 링크는 예를 들어 역방향 링크에 의해 사용된 것과 상이한 주파수 대역을 사용할 수 있다. 게다가, 시분할 듀플렉스 (TDD) 시스템에서, 순방향 링크 및 역방향 링크는 공통 주파수 대역 및 순방향 링크를 사용할 수 있고 역방향 링크는 공통 주파수 대역을 사용할 수 있다. 그들이 통신하도록 설계된 안테나들 및/또는 영역의 각각의 그룹은 기지국의 섹터라 지칭될 수 있다. 예 를 들어, 안테나 그룹들은 기지국에 의해 커버되는 영역들의 섹터 내의 모바일 디바이스들과 통신하도록 설계될 수 있다. 순방향 링크들(118 및 124)을 통한 통신에서, 기지국의 전송 안테나들은 모바일 디바이 스들(116 및 122)에 대한 순방향 링크들(118 및 124)의 신호-대-잡음 비를 개선하기 위하여 빔-형성(beam- forming)을 사용할 수 있다. 이것은 예를 들어 원하는 방향들로 신호들을 조종하기 위한 프리코더를 사용함으 로써 제공될 수 있다. 또한, 기지국이 연관된 커버리지를 통하여 임의로 산란되는 모바일 디바이스들(116 및 122)에 전송하기 위해 빔-형성을 사용하지만, 이웃 셀들 내의 모바일 디바이스들은 단일 안테나를 통하여 모 든 모바일 디바이스들로 전송하는 기지국과 비교되는 바와 같은 간섭에 덜 영향을 받을 수 있다. 게다가, 모바 일 디바이스들(116 및 122)은 일 예에서 피어-투-피어 또는 애드 혹 기술을 사용하여 서로 직접 통신할 수 있다. 예에 따라, 시스템은 다중-입력 다중-출력(MIMO) 통신 시스템일 수 있다. 게다가, 시스템은 FDD, TDD, 및 등등 같은 통신 채널들(예를 들어, 순방향 링크, 역방향 링크, 등등)을 분할하기 위한 임의의 타입의 듀플렉싱 기술을 실질적으로 사용할 수 있다. 게다가, 시스템은 다중-베어러 시스템(multiple-bearer system)일 수 있다. 베어러는 정의된 용량, 지연, 비트 에러율, 등등의 정보 경로일 수 있다. 모바일 디바이 스들(116 및 122)은 하나 이상의 무선 베어러들을 각각 서빙할 수 있다. 모바일 디바이스들(116 및 122)은 하 나 이상의 무선 베어러들을 가로질러 업링크 자원들을 관리 및/공유하기 위하여 업링크 레이트 제어 메카니즘들 을 사용할 수 있다. 일 예에서, 모바일 디바이스들(116 및 122)은 무선 베어러들을 서빙하고 업링크 레이트 제한들을 서빙하기 위하여 토큰 버킷(token bucket) 메카니즘들을 사용할 수 있다. 도시에 따라, 각각의 베어러는 연관된 우선순위 비트 레이트(associated prioritized bit rate)(PBR), 최대 비 트 레이트(maximum bit rate)(MBR) 및 보장된 비트 레이트(guaranteed bit rate)(GBR)를 가질 수 있다. 모바 일 디바이스들(116 및 122)은 적어도 부분적으로 연관된 비트 레이트 값들을 기초로 무선 베어러들을 서빙할 수 있다. 비트 레이트 값들은 또한 각각의 베어러에 대하여 PBR 및 MBR을 생각하는 큐 크기들을 계산하기 위하여 사용될 수 있다. 큐(queue) 크기들은 모바일 디바이스들(116 및 122)에 의해 기지국에 전송된 업링크 자 원 요청들에 포함될 수 있다. 기지국은 각각의 업링크 요청들을 기초로 하고 큐 크기들을 포함하는 모바 일 디바이스(116 및 122)에 대한 업링크 자원들을 스케쥴링할 수 있다. 도 2는 MIMO 시스템에서 전송기 시스템(또한 액세스 포인트로서 공지됨) 및 수신기 시스템(또한 액세스 단말로서 공지됨)의 블록도이다. 전송기 시스템에서, 다수의 데이터 스트림들에 대한 트래픽 데이 터는 데이터 소스로부터 전송기(TX) 데이터 프로세서로 제공된다. 일 실시예에서, 각각의 데이터 스트림은 각각의 전송 안테나를 통하여 전송된다. TX 데이터 프로세서는 코딩된 데이터를 제공하기 위하여 데이터 스트림에 대해 선택된 특정 코딩 방식을 기초로 각각의 데이터 스트림 에 대한 트래픽 데이터를 포맷화, 코딩, 및 인터리빙한다. 각각의 데이터 스트림에 대한 코딩된 데이터는 OFDM 기술들을 사용하여 파일롯 데이터와 멀티플렉싱될 수 있다. 파일롯 데이터는 실질적으로 공지된 방식으로 프로세싱되는 공지된 데이터 패턴이고 채널 응답을 평가하기 위하 여 수신기 시스템에서 사용될 수 있다. 각각의 데이터 스트림에 대한 멀티플렉싱된 파일롯 및 코딩된 데이터는 변조 심볼들을 제공하기 위하여 데이터 스트림에 대해 선택된 특정 병조 방식(예를 들어, BPSK, QSPK, M-PSK, 또는 M-QAM)을 기초로 변조된다(즉, 심볼 맵핑됨). 각각의 데이터 스트림에 대한 데이터 레이트, 코딩, 및 변 조는 프로세서에 의해 수행된 명령들에 의해 결정될 수 있다. 모든 데이터 스트림들에 대한 변조 심볼들은 변조 심볼들(예를 들어, OFDM)을 추가로 프로세싱할 수 있는 TX MIMO 프로세서에 제공된다. TX MIMO 프로세서는 NT 변조 심볼 스트림들을 NT 전송기들(TMTR)(222a 내지 222t)에 제공한다. 특정 실시예들에서, TX MIMO 프로세서는 빔-형성 웨이트들을 데이터 스트림들의 심볼들 및 심볼이 전송되는 안테나에 적용한다. 각각의 전송기는 하나 이상의 아날로그 신호들을 제공하기 위하여 각각의 심볼을 수신 및 프로세싱하고, 추가로 MIMO 채널을 통한 전송에 적합한 변조된 신호를 제공하기 위하여 아날로그 신호들을 컨디셔닝(예를 들어, 증폭, 필터링, 및 업컨버팅)한다. 전송기들(222a 내지 222t)로부터 NT 개의 변조된 신호들은 각각 NT 개 의 안테나들(224a 내지 224t)로부터 전송된다. 수신기 시스템에서, 전송된 변조된 신호들은 NR 개의 안테나들(252a 내지 252r)에 의해 수신되고 각각의 안테나로부터 수신된 신호는 각각의 수신기(RCVR)(254a 내지 254r)에 제공된다. 각각의 수신기는 각 각의 수신된 신호를 컨디셔닝(예를 들어, 필터링, 증폭, 및 다운컨버팅)하고, 샘플들을 제공하기 위하여 컨디셔 닝된 신호를 디지털화하고, 그리고 대응하는 \"수신된\" 심볼 스트림을 제공하기 위하여 샘플들을 추가로 프로세 싱한다. RX 데이터 프로세서는 NT 개의 \"검출된\" 심볼 스트림들을 제공하기 위하여 특정 수신기 프로세싱 기술을 기초로 NR 개의 수신기들로부터 NR 개의 수신된 심볼 스트림들을 수신 및 프로세싱한다. RX 데이터 프로세 서는 데이터 스트림에 대한 트래픽 데이터를 복원하기 위하여 각각의 검출된 심볼 스트림을 복조, 디인터 리빙, 및 디코딩한다. RX 데이터 프로세서에 의한 프로세싱은 전송기 시스템에서 TX MIMO 프로세서 및 TX 데이터 프로세서에 의해 수행된 것과 상보적이다. 프로세서는 어느 프리-코딩 매트릭스를 사용할지(하기에 논의됨)를 주기적으로 결정한다. 프로세서 는 매트릭스 인덱스 부분 및 랭크 값 부분을 포함하는 역방향 링브 메시지를 공식화(formulate)한다. 역방향 링크 메시지는 통신 링크 및/또는 수신된 데이터 스트림에 관한 다양한 타입들의 정보를 포함할 수 있다. 역방향 링크 메시지는 또한 데이터 소스로부터 다수의 데이터 스트림들에 대한 트래픽 데이터를 수 신하는 TX 데이터 프로세서에 의해 프로세싱되고, 변조기에 의해 변조되고, 전송기들(254a 내지 254r)에 의해 컨디셔닝되고, 전송기 시스템으로 다시 전송된다. 전송기 시스템에서, 수신기 시스템으로부터 변조된 신호들은 수신기 시스템에 의해 전송된 역방 향 링크 메시지를 추출하기 위하여 안테나에 의해 수신되고, 수신기들에 의해 컨디셔닝되고, 복조기 에 의해 복조되고, 그리고 RX 데이터 프로세서에 의해 프로세싱된다. 프로세서는 빔-형성 웨이 트들을 결정하기 위하여 어느 프리-코딩 매트릭스를 사용할지를 결정한 다음 추출된 메시지를 프로세싱한다. 도 3은 다수의 사용자들을 지원하도록 구성된 예시적인 무선 통신 시스템을 도시하고, 여기서 다양한 개시 된 실시예들 및 양상들은 구현될 수 있다. 도 3에 도시된 바와 같이, 예를 들어, 시스템은 예를 들어 매 크로 셀들(302a-302g) 같은 다중 셀들에 통신을 제공하고, 각각의 셀은 대응하는 액세스 포인트 (AP)(AP들 304a-304g 같은)에 의해 서비스된다. 각각의 셀은 하나 이상의 섹터들(예를 들어, 하나 이상의 주파수들을 서빙하기 위하여)로 추가로 분할될 수 있다. AT들(306a-306k)을 포함하고, 또한 사용자 장비(UE) 또는 이동국들로서 상호 교환하여 사용되는 공지된 다양한 액세스 단말들(AT)은 시스템 전역에 걸쳐 분산 된다. 각각의 AT는 예를 들어 AT가 액티브인지 그리고 소프트 핸드오프인지에 따라, 주어진 순간에 순방 향 링크(FL) 및/또는 역방향 링크(RL) 상에서 하나 이상의 AP들과 통신할 수 있다. 무선 통신 시스템 은 큰 지리적 구역에 걸쳐 서비스를 제공할 수 있고, 예를 들어, 매크로 셀들(302a-302g)은 이웃의 몇몇 블록들을 커버할 수 있다. 무선 통신 시스템은 확인응답된(acknowledged) 모드(AM), 비확인응답된(unacknowledged) 모드(UM), 및 투 명(transparent) 모드(TM)에서 상부 계층들에 데이터 전달 서비스들과 함게 RLC 접속 설정 및 해제를 지원하는 무선 링크 제어(RLC) 프로토콜 층(RLC 계층)을 포함할 수 있다. 통상적으로, 전송기(예를 들어, AP 304)가 패 킷들의 세트를 수신기(예를 들어, AT 306, RLC 피어)에 전송할 때, 전송기는 패킷들이 하이브리드 자동 반복 요 청(HARQ) 계층(도시되지 않음)을 통하여 전송되기 때문에, 수신기가 상기 세트 내 패킷들을 실제로 수신하였는 지를 알지 못한다. 통상적으로, HARQ 계층은 완전히 신뢰성 있는 전달을 제공하지 못한다, 예를 들어 세트 내 의 패킷들은 순서 없이 전달될 수 있거나 전혀 전달될 수 없다. 수신기가 세트 내 패킷들을 수신하였는지 여부 를 결정하기 위하여, 전송기는 수신기에게 스테이터스 리포트를 폴링할 것이다. 예를 들어, 폴(poll)은 세트 내 하나 이상의 패킷들 내에 포함된 비트, 플래그(flag) 및 등등을 통하여 구현될 수 있다. 그러나, 플래그를 포함하는 패킷이 세트 내 다른 패킷들 이전에 수신되었다면, 수신기가 패킷들의 각각을 획득하기 이전에 전송기 에 스테이터스 리포트를 전송할 수 있다는 것이 인식될 수 있다. 스테이터스 리포트를 기초로 전송기는 자원들 의 비효율적인 사용일 수 있는(이하에 보다 상세히 논의된) 손실 패킷들을 재전송할 수 있다. 도 4에서, RLC 피어로부터 폴링 요청들을 프로세싱하기 위한 예시적 시스템의 블록도는 본 명세서의 양상에 따 라 제공된다. 도시된 바와 같이, 그런 시스템은 하이브리드 자동 반복 요청(HARQ) 계층을 통하여 RLC 수신기와 통신하는 RLC 전송기를 포함할 수 있다. RLC 전송기는 프로세서 및 메모리 를 포함할 수 있고, RLC 수신기는 도시된 바와 같이 프로세서 및 메모리를 더 포함할 수 있다. 도 4에 도시된 시퀀스에 대해, 3 개의 프로토콜 데이터 유닛들(PDU)(PDU1 416, PDU2 418, 및 PDU3 42 0)은 RLC 전송기로부터 RLC 수신기로 라우팅하는 도중 HARQ 계층에서 도시된다. 도시된 바와 같이, 각각의 PDU들(416, 418 및 420)은 순차적 순서로 전송되었고, PDU3는 폴을 포함한다. 통상적으로, 도시된 바와 같이 폴링 프로토콜을 사용하여, 폴들(예를 들어, 폴 422)은 HARQ 계층을 통하여 RLC PDU(예를 들어, PDU3 420)와 인밴드로 전송된다. 예를 들어, LTE 네트워크에서, RLC 수신기는 RLC PDU의 폴링 필드(P 필드)를 일의 값으로 설정함으로써 폴링된다. 통상적으로, RLC 수신기는 폴에 응답하여 스테이터스 리포트를 생성한다; 그러나, PDU들(416, 418, 및 420)은 종종 순서 없이 전달된다. 결과 적으로, 수신기가 폴을 수신할 때, HARQ 계층에서 수송중 하나 이상의 PDU들이 여전히 있을 수 있다. 게다가, 만약 수신기가 스테이터스 리포트를 즉각적으로 생성하면, 이동중인(in-transit) PDU들은 손실로 서 처리될 수 있고, 상기 손실은 불필요한 재전송들일 수 있다. 도 5로 잠시 돌아가서, PDU들이 순서 없이 수신되는 RLC 피어로부터의 폴링 요청을 프로세싱하기 위한 시스템의 예시적인 블록도는 본 개선의 양상에 따라 도시된다. 즉, 수신기는 적절하게(예를 들어, 성공적으로) 수 신된 PDU3를 가지는 것으로 도시되는 반면, PDU1은 적절하게 수신되지 않았고(예를 들어, 성공적이지 않게), PDU2는 이동중이다. 따라서, 만약 스테이터스 리포트가 즉각적으로 생성되면, 스테이터스 리포트 는 PDU2이 이동중임에도 불구하고, PDU1 및 PDU2 둘 다가 손실되는 것을 가리킨다. 도 6에서, 생성된 스테이터스 리포트가 RLC 수신기로부터 RLC 전송기로 전송되는 RLC 피어로부 터의 폴링 요청들을 프로세싱하기 위한 시스템의 예시적인 블록도는 도시된다. 이전에 논의된 바와 같이, 스테 이터스 리포트는 RLC 수신기로부터 HARQ 계층을 통하여 RLC 전송기로 전송된다. 만약 스 테이터스 리포트가 PDU들(예를 들어, PDU1, PDU2, 및 PDU3)의 전송이 완료되기 전에 생성되면, RLC 전송기는 하나 이상의 PDU들을 불필요하게 재전송할 수 있다. 하기에 보다 상세히 논의된 바와 같이, 현재 개선의 하 나의 양상은 RLC 전송기로부터 RLC 수신기로 PDU들의 전송이 완료될 때까지 스테이터스 리포트 의 지연 생성을 포함한다. 현재 개선의 실시예에서, RLC 수신기는 폴을 수신한 후, 그리고 최대 스테이터스 전송 상태 변수, 또는 VR(MS)이 폴(예를 들어, PDU3)을 포함하는 PDU의 시퀀스 번호와 동일하거나 초과할 때 스테이터스 리포트 를 생성 및 전송한다. VR(MS)은 스테이터스 리포트의 ACK/NACK 필드들에서 운반될 수 있는 PDU들의 가장 높은 시퀀스 번호를 저장한다. 상기가 나타내지만 몇몇 예들만들을 나타내고, 당업자가 등가의 예들을 쉽 게 식별할 수 있을 것이라는 것이 인식될 것이다. 예를 들어, 실시예는 3 개의 PDU들을 사용하여 도시되지만, 개선은 그렇게 제한되지 않고, 실질적으로 임의의 수 및/또는 임의의 타입의 데이터 패킷들을 포함할 수 있다. 지금 도 7로 가서, 본 개선의 양상에 따른 무선 링크 제어 피어로부터의 폴링 요청들을 프로세싱하기 위한 예시 적인 시스템이 도시된다. 시스템은 무선 링크 제어(RLC) 수신기, 및 하이브리드 자동 반복 요청 (HARQ) 계층을 포함한다. RLC 전송기(도시되지 않음)는 이전에 논의된 바와 같이 HARQ 계층을 통하 여 프로토콜 데이터 유닛들(PDU)의 세트를 RLC 수신기(이하 \"수신기\")로 전송할 수 있다. 수신기는 HARQ 계층으로부터 하나 이상의 PDU들을 얻거나, 획득하거나, 그렇지 않으면 수신할 수 있는 데이터 수신 컴포넌트를 포함한다. 상기 언급된 바와 같이, HARQ 계층은 그들이 전송되었던 순서와 상이한 순서 로 PDU들을 수신기로 전달할 수 있다. 예를 들어, HARQ 계층은 순차적인 순서로 3 개의 PDU들(예를 들어, PDU1, PDU2, 및 PDU3)의 세트를 수신할 수 있다. 그러나, HARQ 계층은 순차적인 순서와 다른 순서 로, 예를 들어 PDU3, PDU1 및 그 다음 PDU2 순으로 3 개의 PDU들의 세트를 전달할 수 있다. 수신기는 데이터 수신 컴포넌트에 의해 수신된 PDU들을 분석할 수 있는 패킷 검사 컴포넌트를 포함한다. 예를 들어, 패킷 검사 컴포넌트는 각각 수신된 PDU의 시퀀스 번호(SN)를 결정할 수 있다. 게 다가, 패킷 검사 컴포넌트는 전송기로부터의 폴이 하나 이상의 PDU들에 포함되는지를 결정할 수 있다. 이 전에 논의된 바와 같이, 통상적으로 전송기가 패킷들의 세트를 수신기로 전송할 때, 전송기는 HARQ 계층 을 통하여 전송된 패킷들을 성공적으로 수신하였는지의 지식을 가지지 않을 것이다. 그러므로, 수신기 가 세트 내의 패킷들을 수신하였는지를 결정하기 위하여, 전송기는 수신기에게 스테이터스 리포트를 폴링할 것이다. 폴은 예를 들어, 수신기에 전송된 하나 이상의 패킷들에 포함된 비트, 플래그, 및 등등으 로서 구현될 수 있다. 추가 예로서, LTE 릴리스 10 표준(Rel-10)에서, 수신기의 폴링은 일의 값을 가 지도록 PDU의 폴링 필드(P 필드)를 설정함으로써 달성된다. 검사된 PDU들은 메모리에 유지되거나, 홀딩되 거나, 그렇지 않으면 저장된다. 수신기는 폴에 응답하여 스테이터스 리포트를 생성할 수 있는 스테이터스 리포트 컴포넌트를 포함하 고, 스테이터스 리포트는 수신기에 의해 성공적으로 수신된 PDU들을 식별한다. 그러나, 이전에 논의된 바 와 같이, 폴을 포함하는 PDU가 세트 내의 다른 패킷들 이전에 수신되었다면, 스테이터스 리포트는 스테이터스 리포트 생성 시간에서 이동중인 하나 이상의 PDU들을 손실로서 잘못 식별할 수 있다. 상기 시나리오를 기초로, 전송기는 스테이터스 리포트를 기초로 패킷들을 성공적으로 재전송할 수 없다. 미성숙(premature) 스테이터스 리포트들을 방지하기 위하여, 수신기는 또한 VR(MS)라 지칭되는 최대 스테 이터스 전송 상태 변수 컴포넌트를 유지하는 전송 상태 컴포넌트를 더 포함한다. 전송 상태 컴포넌트는 VR(MS)의 값(들)을 스테이터스 리포트의 ACK/NACK 필드들에서 수행될 수 있는 PDU들의 가장 높은 시퀀스 번호로 설정할 수 있다. 다른 말로, VM(RS)보다 낮은 시퀀스 번호 및/또는 VR(MS)보다 낮거나 같은 시퀀스 번호를 가 진 모든 PDU들은 손실되고 HARQ 계층에서 이동중이 아니다. 예를 들어, 3 개의 PDU들(예를 들어, PDU1, PDU2, 및 PDU3)의 세트가 수신기에 전송되었고, VR(MS)이 3의 값을 가지면, PDU1 및 PDU2는 손실되고 이동중이 아니다. 게다가, 전송 상태 컴포넌트는 수신기에 의해 얻어진 PDU들의 시퀀스 번호들 내 갭들을 결정할 수 있 다. 예를 들어, PDU1 및 PDU3가 수신기에 의해 성공적으로 수신되었다면, 갭(예를 들어, PDU2)은 검출될 것이다. 하나 이상의 갭들의 존재는 SN과 연관된 PDU들이 여전히 이동중일 수 있다는 것을 가리킬 수 있다. 그러므로, 전송 상태 컴포넌트는 대기 사이클(예를 들어, 대기 주기, 지연, 등등)을 개시하기 위하여 지연 컴포넌트를 시그널링할 수 있다. 지연 컴포넌트는 HARQ 계층 또는 전송기로부터 수신기로 PDU의 전송을 위해 예상된 시간을 기초로 대기 사이클을 결정할 수 있다. 예를 들어, 만약 HARQ 계층으로 부터 수신기로 PDU의 예상된 전송 시간이 50ns이면, 지연 컴포넌트는 50ns의 대기 사이클을 개시할 수 있다. 대기 사이클이 완료될 때, 지연 컴포넌트는 전송 상태 컴포넌트를 통지할 수 있다.지연 컴포넌트가 대기 사이클을 완료할 때, 도착되지 않은 임의의 PDU들은 이동중이지 않다(예를 들어, 손 실됨)는 것이 가정된다. 그러므로, 스테이터스 리포트 컴포넌트는 전송 상태 컴포넌트에 유지된 VR(MS)의 현재 값을 기초로 스테이터스 리포트를 생성하도록 명령을 받을 수 있다. 부가적으로, 또는 대안적으 로, 지연 컴포넌트는 부가적인 대기 사이클들을 구현할 수 있다. 게다가, 지연 컴포넌트는 VR(MS)의 값이 폴을 포함하는 패킷의 시퀀스 번호보다 크거나 같을 때까지 대기할 수 있다. 이 기술이 여전히 이동중인 PDU들 의 수신 이전에 생성된 스테이터스 리포트를 수신기가 전송기에 전송할 가능성을 방지하거나 감소시킬 수 있다 는 것이 인식될 것이다. 상기 기술된 예시적인 시스템들의 측면에서, 개시된 청구 대상에 따라 구현될 수 있는 방법론들은 도 8의 흐름 도를 참조하여 보다 잘 이해될 것이다. 설명의 단순화를 위해, 방법론들이 일련의 블록들로서 도시 및 기술되 었지만, 몇몇 블록들이 여기에 도시 및 기술된 바와 상이한 블록들을 상이한 순서들로 및/또는 동시에 발생할 수 있기 때문에, 청구된 청구 대상이 블록들의 순서에 의해 제한되지 않은 것이 이해 및 인식될 것이다. 게다 가, 모든 도시된 블록들이 이후에 기술된 방법론들을 구현하기 위하여 요구될 수 없다. 도 8을 참조하여, 무선 링크 제어 피어들로부터 폴링 요청들을 프로세싱하는 예시적인 방법론은 본 개선의 양상 에 따라 도시된다. 802에서, 프로토콜 데이터 유닛(PDU)은 얻어질 수 있거나, 획득될 수 있거나, 그렇지 않으 면 수신된다. 이전에 논의된 바와 같이, 무선 링크 제어(RLC) 전송기는 하이브리드 자동 반복 요청(HARQ) 계층 을 통하여 RLC 수신기로 프로토콜 데이터 유닛들(PDU)의 세트를 전송할 수 있다. 804에서, 수신된 PDU는 프로 세싱될 수 있고, 예를 들어 상기 프로세싱은 PDU와 연관된 시퀀스 번호를 결정하고, 폴링 요청이 PDU에 포함되 는지를 결정하고, 그리고 기타 등등을 포함한다. 시퀀스 번호는 특히 PDU들의 세트 중 PDU를 식별하는 유일한 식별자이고, 폴링 요청은 하나 이상의 전송된 PDU들의 전송 스테이터스에 관한 RLC 전송기로부터의 스테이터스 리포트에 대한 요청이다. 상기 논의된 바와 같이, RLC 전송기는 통상적으로 PDU들이 RLC 수신기에 의해 성공적 으로/실패하여 수신되는지의 지식을 가지지 않을 것이고, 전송된 패킷들의 스테이터스를 발견하기 위하여 수신 기를 폴링할 것이다. 806에서, VR(MS)라 지칭되는 최대 스테이터스 전송 상태 변수 컴포넌트는 적어도 부분적으로 수신된 PDU를 기초 로 결정될 수 있다. VR(MS)은 스테이터스 리포트의 ACK/NACK 필드들에서 운반될 수 있는 PDU들의 가장 높은 시 퀀스 번호(SN)를 저장한다. 예를 들어, 3 개의 PDU들의 세트가 수신기에 전송되었고, PDU1이 손실되었다면, PDU2는 여전히 HARQ 계층에서 이동중이고, PDU3는 수신기에 의해 성공적으로 얻어지고, 그 다음 VR(MS)은 PDU3 의 시퀀스 번호를 기초로 할 것이다. 808에서, 결정은 PDU가 폴링 요청을 포함하는지에 대해 이루어진다. 예를 들어, 폴링 요청은 수신기에 전송된 하나 이상의 패킷들에 포함된 비트, 플래그, 및 등등일 수 있다. 추가 예로서, LTE 릴리스 10 표준(Rel-10)에 서, 수신기의 폴링은 일의 값을 가지도록 PDU의 폴링 필드(P 필드)를 설정함으로써 달성된다. 812에서, 폴 링 요청이 PDU에 포함되지 않으면, 결정은 폴링 요청이 이전에 수신된 PDU에 포함되었는지에 대해 이루어진다. 폴링 요청이 이전에 수신되지 않았다면, 방법은 802로 되돌아간다. 폴링 요청이 이전에 수신된 PDU에 포함되었 다면, 방법은 814로 진행한다(이하에 보다 상세히 논의됨). 814에서, 폴링 요청이 PDU(또는 이전 PDU)에 포함되면, 결정은 폴링 요청을 포함하는 PDU의 SN(예를 들어, PS N)이 VR(MS)보다 작은지에 대해 이루어진다. PSN이 VR(MS)보다 작지 않으면, 816에서 결정은 지연들의 미리 결 정된 최대 수가 구현되었는지 및/또는 지연 시간의 미리 결정된 최대 양(예를 들어, 최대)이 경과되었는지에 대 해 이루어진다. 만약 최대가 만족되지 않으면, 818에서 지연(예를 들어, 대기 상태, 대기 사이클, 등등)은 814 로 되돌아가기 전에 구현된다; 그러나, 만약 미리 결정된 최대가 만족되었다면 방법은 820으로 진행한다(하기에 논의됨). 예를 들어, 지연은 부가적인 PDU들의 전달을 허용하도록 적어도 부분적으로 HARQ 계층으로부터 수신 기로 예상된 전달 시간을 기초로 할 수 있다. 814에서, PSN이 VR(MS)보다 작으면 스테이터스 리포트는 820에서 생성된다. 스테이터스 리포트는 성공적으로 수신되었던 PDU들 및/또는 성공적으로 수신되지 않은 PDU들을 전송 기에게 가리킬 것이다. 스테이터스 리포트를 기초로, 전송기는 성공적으로 수신되지 않은 것을 재전송할 수 있 다. 도 9는 본 개선에 따른 하나 이상의 특징들을 자동화하는 것을 돕는 인공 지능(AI) 컴포넌트를 이용하는 시스템을 도시한다. 본 개선(예를 들어, 추론과 관련하여)은 다양한 양상들을 수행하기 위한 다양한 AI- 기반 방식들을 이용할 수 있다. 예를 들어, 스테이터스 리포트를 전송하기 전에 지연에 대한 기간을 결정하기 위한 프로세스는 자동 분류기 시스템 및 프로세스를 통하여 촉진될 수 있다. 여기에 사용된 바와 같이, 용어 \"추론\"은 일반적으로 이벤트들 및/또는 데이터를 통하여 캡쳐될 바와 같은 관찰 들의 세트로부터 시스템, 환경, 및/또는 사용자의 상태들에 관한 추론 또는 추리하는 프로세스를 일반적으로 지 칭한다. 추론은 특정 환경 또는 동작을 식별하기 위하여 사용될 수 있거나, 예를 들어 상태들에 걸쳐 가능성 분포를 생성할 수 있다. 추론은 확률적(probabilistic)일 수 있다 ― 즉, 데이터 및 이벤트들의 고려를 기초로 관심 상태들에 걸친 가능성 분포의 계산. 추론은 또한 이벤트들 및/또는 데이터의 세트로부터 보다 높은-레벨 이벤트들을 구성하기 위하여 사용된 기술들을 지칭할 수 있다. 그런 추론은 이벤트들이 밀접한 시간 근접도에 서 상관되든 아니든, 그리고 이벤트들 및 데이터가 하나의 이벤트 및 데이터 소스들로부터 발생하든 몇몇의 이 벤트 및 데이터 소스들로부터 발생하든 관찰된 이벤트들 및/또는 저장된 이벤트 데이터의 세트로부터 새로운 이 벤트들 또는 동작들의 구성을 유발한다. 게다가, 추론은 규칙들의 논리적 모델들을 기초로 하여, 컴포넌트들 또는 데이터 사이의 관계는 데이터의 분석 및 분석으로부터 결론들 도출에 의해 결정된다. 예를 들어, 하나의 사용자가 네트워크를 통하여 다른 사용자들의 서브세트와 상호작용하는 것을 관찰함으로써, 사용자들의 이런 서 브세트가 결코 또는 거의 상호작용되지 않는 다수의 다른 사용자들과 반대로 하나의 사용자에 대하여 관심 있는 원하는 소셜 네트워크에 속한다는 것이 결정되거나 추론될 수 있다. 상이한 독립 패턴들을 제공하는 예를 들어 네이브 베이어즈( ), 베이지안 네트워크들, 결정 트리 들, 신경망들, 퍼지 논리 모델들 및 기연성 분류 모델들을 포함하는 직접적인 그리고 간접적인 모델 분류 접근 법들은 이용될 수 있다. 여기에 사용된 바와 같은 분류는 또한 우선순위 모델들을 개발하기 위하여 사용된 통 계적 회귀(regression)의 포함이다. 본 개선으로부터 쉽게 이해될 바와 같이, 본 개선은 명시적으로 훈련될 뿐 아니라(예를 들어, 일반적인 훈련 데 이터를 통하여) 암시적으로 훈련되는(예를 들어, 사용자 행동을 관찰, 외부 정보를 수신을 통하여) 분류기들을 이용할 수 있다. 따라서, 분류기(들)는 미리 결정된 기준에 따라, 이전에 추론된 스키마(schema)를 언제 업데 이트하거나 정련(refine)할지, 프로세싱되는 데이터의 종류(예를 들어, 금융 대 비금융, 개인적 대 비개인적 데 이터)를 기초로 추론 알고리즘에 대한 기준을 강화할지, 및 하루 중 어느 시간에(예를 들어, 시스템 성능이 덜 영향을 받을 밤에) 보다 강화된 기준 제어를 구현할지를 결정하는 것을 포함하는 ― 이것으로 제한되지 않음 ― 다수의 기능들을 자동으로 학습하고 수행하기 위하여 사용될 수 있다. 도 10을 참조하여, 무선 통신 시스템에서 무선 링크 제어 피어들로부터 프로세싱 폴링 요청들을 촉진하는 시스 템의 예시적인 블록도가 도시된다. 예를 들어, 시스템은 모바일 디바이스 내에 적어도 부분적으로 상주할 수 있고, 등등이 이루어질 수 있다. 시스템이 프로세서, 소프트웨어, 또는 이들의 조합(예를 들 어, 펌웨어)에 의해 구현되는 기능들을 나타내는 기능 블록들일 수 있는 기능 블록들을 포함하는 것으로 표현되 는 것이 인식될 것이다. 시스템은 협력하여 동작할 수 있는 모듈들의 논리적 그룹화부를 포함한다. 예를 들어, 논리적 그룹화부는 무선 통신 네트워크를 통하여 하나 이상의 프로토콜 데이터 유닛들(PDU)을 수신하기 위한 모듈을 포함할 수 있다. 게다가, 논리적 그룹화부는 시퀀스 번호들을 결정하는 것 및 폴 링 요청의 위치를 결정하는 것을 포함하는 프로토콜 데이터 유닛들을 분석하기 위한 모듈을 포함할 수 있 다. 게다가, 논리적 그룹화부는 폴링 요청을 포함하는 PDU의 시퀀스 번호를 VR(MS)에 비교하기 위한 모 듈을 포함할 수 있다. 부가적으로, 시스템은 적어도 부분적으로 VR(MS)를 기초로 폴링 요청에 응 답하여 스테이터스 리포트를 생성하기 위한 모듈을 포함할 수 있다. 게다가, 시스템은 모듈들(1004, 1006, 1008 및 1010)과 연관된 기능들을 실행하기 위한 명령들을 유지하는 메모리를 포함할 수 있다. 메 모리 외부에 있는 것으로 도시되지만, 하나 이상의 모듈들(1004, 1006, 1008 및 1010)이 메모리 내에 존재할 수 있다는 것이 이해될 것이다. 여기에 개시된 실시예들과 관련하여 기술된 다양한 도시된 논리들, 논리 블록들, 모듈들, 및 회로들은 범용 프 로세서, 디지털 신호 프로세서(DSP), 주문형 반도체(ASIC), 필드 프로그램 가능 게이트 어레이(FPGA) 또는 다른 프로그램 가능 논리 디바이스, 이산 게이트 또는 트랜지스터 논리부, 이산 하드웨어 컴포넌트들, 또는 여기에 기술된 기능들을 수행하도록 설계된 임의의 조합으로 구현되거나 수행될 수 있다. 범용 프로세서는 마이크로프 로세서일 수 있지만, 대안으로, 프로세서는 임의의 통상적인 프로세서, 제어기, 마이크로제어기, 또는 상태 머 신일 수 있다. 프로세서는 또한 컴퓨팅 디바이스들의 조합, 예를 들어 DSP 및 마이크로프로세서의 조합, 다수 의 마이크로프로세서들, DSP 코어와 협력하는 하나 이상의 마이크로프로세서들, 또는 임의의 다른 그런 구성으 로서 구현될 수 있다. 부가적으로, 적어도 하나의 프로세서는 상기된 하나 이상의 단계들 및/또는 동작들을 수 행하기 위하여 동작하는 하나 이상의 모듈들을 포함할 수 있다. 게다가, 여기에 개시된 양상들과 관련하여 기술된 방법 또는 알고리즘의 단계들 및/또는 동작들은 하드웨어, 프 로세서에 의해 실행되는 소프트웨어 모듈, 또는 두 개의 조합으로 직접적으로 구현될 수 있다. 소프트웨어 모듈은 RAM 메모리, 플래시 메모리, ROM 메모리, EPROM 메모리, EEPROM 메모리, 레지스터들, 하드 디스크, 제거 가능 디스크, CD-ROM 또는 종래에 공지된 저장 매체의 임의의 다른 형태에 상주할 수 있다. 예시적인 저장 매 체는 프로세서에 결합될 수 있어서, 프로세서는 저장 매체로부터 정보를 판독하고, 저장 매체에 정보를 기록할 수 있다. 대안으로, 저장 매체는 프로세서에 일체형일 수 있다. 게다가, 몇몇 양상들에서, 프로세서 및 저장 매체는 ASIC에 상주할 수 있다. 부가적으로, ASIC는 사용자 단말에 상주할 수 있다. 대안으로, 프로세서 및 저장 매체는 사용자 단말 내 이산 컴포넌트들로서 상주할 수 있다. 부가적으로, 몇몇 양상들에서, 방법 또는 알고리즘의 단계들 및/또는 동작들은 하나 또는 임의의 조합으로서 상주할 수 있거나 컴퓨터 프로그램 물건에 통합될 수 있는 머신 판독 가능 매체 및/또는 컴퓨터 판독 가능 매체 상에 또는 코드들 및/또는 명령들의 세트 로서 상주할 수 있다. 하나 이상의 양상들에서, 기술된 기능들은 하드웨어, 소프트웨어, 펌웨어, 또는 이들의 임의의 결합으로 구현될 수 있다. 소프트웨어로 구현되면, 기능들은 컴퓨터-판독 가능 매체 상의 하나 이상의 명령들 또는 코드로서 저 장되거나 전송될 수 있다. 컴퓨터-판독 가능 매체는 하나의 장소에서 다른 장소로 컴퓨터 프로그램의 전달을 촉진하는 임의의 매체를 포함하는 컴퓨터 저장 매체 및 통신 매체 둘 다를 포함한다. 저장 매체는 컴퓨터에 의 해 액세스될 수 있는 임의의 이용 가능한 매체일 수 있다. 예를 들어, 그리고 제한 없이, 그런 컴퓨터-판독 가 능 매체는 RAM, ROM, EEPROM, CD0ROM 또는 다른 광학 디스크 저장소, 자기 디스크 저장소 또는 다른 자기 저장 디바이스들, 또는 명령들 또는 데이터 구조들 형태의 원하는 프로그램 코드를 운반하거나 저장하기 위하여 사용 될 수 있고 컴퓨터에 의해 액세스될 수 있는 임의의 다른 매체를 포함할 수 있다. 또한, 임의의 접속부는 컴퓨 터-판독 가능 매체라 지칭될 수 있다. 예를 들어, 소프트웨어가 동축 케이블, 광섬 케이블, 트위스티드 페어 (twisted pair), 디지털 가입자 라인(DSL), 적외선, 무선, 및 마이크로파 같은 무선 기술들을 사용하여 웹사이 트, 서버, 또는 다른 원격 소스로부터 전송되면, 동축 케이블, 광섬유 케이블, 트위스팅 페어, DSL, 또는 적외 선, 무선, 및 마이크로파 같은 무선 기술들은 매체의 정의 내에 포함된다. 여기에 사용된 바와 같은 Disk 및 disc는 컴팩트 디스크(CD), 레이저 디스크, 광학 디스크, 디지털 다기능 디스크(DVD), 플로핑 디스크 및 블루- 레이 디스크를 포함하고, 여기서 disk들이 일반적으로 데이터를 자기적으로 재생하는 반면, disc들은 일반적으 로 레이저들을 사용하여 광학적으로 데이터를 재생한다. 상기의 조합들은 또한 컴퓨터-판독 가능 매체의 범위 내에 포함될 수 있다. 상기 개시물이 도시된 양상들 및/또는 실시예들을 개시하지만, 다양한 변화들 및 변형들이 첨부된 청구항들에 의해 정의된 바와 같이 기술된 양상들 및/또는 실시예들의 범위에서 벗어나지 않고 여기에서 이루어질 수 있다 는 것이 주의되어야 한다. 게다가, 비록 기술된 양상들 및/또는 실시예들의 엘리먼트들이 단수로 기술되거나 청구될 수 있지만, 단수로의 제한이 명시적으로 언급되지 않으면 복수가 고려된다. 부가적으로, 임의의 양상 및/또는 실시예의 모두 또는 일부는 반대로 언급되지 않으면 임의의 다른 양상 및/또는 실시예 전부 또는 일부 와 함께 사용될 수 있다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10"}
{"patent_id": "10-2011-7005463", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 예시적인 다중 접속 무선 통신 시스템을 도시한다. 도 2는 통신 시스템의 일반적인 블록도를 도시한다. 도 3은 예시적인 무선 통신 시스템을 도시한다. 도 4는 본 명세서의 양상에 따라 무선 링크 제어 피어로부터의 폴링 요청들을 프로세싱하기 위한 시스템의 예시 적인 블록도를 도시한다. 도 5는 본 명세서의 양상에 따라 프로토콜 데이터 유닛들이 순서 없이 수신되는 무선 링크 제어 피어로부터의 폴링 요청들을 프로세싱하기 위한 시스템의 예시적인 블록도를 도시한다. 도 6은 본 명세서에 따라 생성된 스테이터스 리포트가 수신기로부터 전송기로 전송되는 무선 링크 제어 피어로부터의 폴링 요청들을 프로세싱하기 위한 시스템의 예시적인 블록도를 도시한다. 도 7은 본 명세서의 양상에 따라 도시된 무선 링크 제어 피어로부터의 폴링 요청들을 프로세싱하기 위한 예시적 인 시스템이다. 도 8은 본 명세서의 양상에 따라 무선 링크 제어 피어들로부터의 폴링 요청들의 예시적인 방법론이다. 도 9는 본 명세서에 따른 하나 이상의 피쳐(feature)들을 자동화하는 것을 촉진하는 인공 지능 컴포넌트를 이용 하는 시스템을 도시한다. 도 10은 본 개선 사항의 양상에 따라 무선 통신 시스템에서 무선 링크 제어 피어들로부터의 폴링 요청들을 프로 세싱하는 것을 촉진하는 시스템의 예시적인 블록도이다."}
