{"patent_id": "10-2021-7002393", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0013296", "출원번호": "10-2021-7002393", "발명의 명칭": "테이블 게임의 관리 시스템, 유기용 대용 화폐, 검사 장치, 유기용 대용 화폐의 관리 시스템", "출원인": "엔제루 프레잉구 카도 가부시키가이샤", "발명자": "시게타 야스시"}}
{"patent_id": "10-2021-7002393", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "테이블 게임의 관리 시스템으로서,개별적으로 식별 가능한 ID 가 부착된 유기용 대용 화폐와,상기 유기용 대용 화폐를 사용하여 게임을 실시하기 위한 유기 테이블과,상기 유기 테이블에 있어서 딜러가 사용하는 유기용 대용 화폐를 유지하는 칩 트레이와,상기 ID 를 사용하여 상기 칩 트레이에 유지되어 있는 유기용 대용 화폐의 종류와 매수를 특정하는 칩 판정 장치와,유기 테이블에 있어서 각 게임의 승패 결과를 판정하여 표시하는 승패 판정 장치와,상기 유기 테이블 상에 둔 유기용 대용 화폐를 촬영하여 화상을 생성하는 카메라와,상기 화상에 대한 딥 러닝 또는 인공 지능에 의한 화상 분석에 의해, 각 플레이어가 배팅하는 칩의 위치, 종류및 매수를 파악하는 지능형 제어 장치를 구비하고, 상기 지능형 제어 장치는, 상기 칩 판정 장치를 통하여, 상기 칩 트레이의 칩 총액을 파악 가능하고, 또한 상기 유기용 대용 화폐의 측면의 색 모양을 인식하여, 당해 색모양을 구성하는 색에 기초하여 상기 유기용 대용 화폐의 종류를 특정 가능하고, 특정된 상기 유기 테이블 상의상기 유기용 대용 화폐의 종류와, 상기 승패 판정 장치로부터 얻은 게임의 승패 결과를 이용하여, 상기 칩 트레이의 칩의 증감액이 바른지를 판정하는, 테이블 게임의 관리 시스템."}
{"patent_id": "10-2021-7002393", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 유기 테이블의 특정 장소에서는 상기 칩 판정 장치를 사용하여 상기 유기용 대용 화폐의 종류를 검지하고,상기 유기 테이블의 상기 특정 장소 이외의 장소에서는 상기 지능형 제어 장치를 사용하여 상기 유기용 대용 화폐의 종류를 검지하는 구성을 구비한, 테이블 게임의 관리 시스템."}
{"patent_id": "10-2021-7002393", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 측면의 색 모양은, 상기 유기용 대용 화폐의 두께 방향으로 적층된 착색층과 백색층 또는 연한색층으로 이루어지는 줄무늬 모양인, 테이블 게임의 관리 시스템."}
{"patent_id": "10-2021-7002393", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 지능형 제어 장치는, 각 게임 참가인이 둔 유기용 대용 화폐의 상기 착색층 또는 상기 백색층 또는 연한색층의 수를 계측하여 유기용 대용 화폐의 매수를 판정하는 기능을 구비한, 테이블 게임의 관리 시스템."}
{"patent_id": "10-2021-7002393", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 검지 시스템은, 화상 분석 장치에 의한 화상 분석 결과를 이용하여 유기 테이블에서 실시되는 부정 행 위를 검지하는 제어 장치를 구비하고, 또한 본 검지 시스템에 사용하는 유기용 대용 화폐는, 복수의 색이 상이한 플라스틱의 층이 적층되고, 적어도 중간에 착색층 을 구비하고, 이 중간의 착색층 의 양측에 백색층 혹은 연한색층 (도시하지 않지만 착색층 보다 색이 연한 층이면 된다) 을 적층한 다층 구조로 되어 있다. 이와 같이 착색층 을 구비하고, 이 중간의 착색층 의 양측에 백색층 혹은 연한색층 (도시하지 않지만 착색층 보다 색이 연한 층이면 된다) 을 적층한 다층 구조를 갖는다."}
{"patent_id": "10-2021-7002393", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "관련 출원의 상호 참조 본 출원에서는, 2015년 8월 3일에 일본에 출원된 특허출원번호 2015-163213, 2015년 10월 1일에 일본에 출원된 특허출원번호 2015-206735, 2015년 11월 19일에 일본에 출원된 특허출원번호 2015-240631, 및 2016년 2월 1일 에 일본에 출원된 특허출원번호 2016-30443 의 이익을 주장하고, 당해 출원의 내용은 인용함으로써 여기에 도입 되어 있는 것으로 한다.본 발명은 유기장 (遊技場) 에 있어서의 테이블 게임의 관리 시스템에 관한 것으로, 특히, 부정 행위를 검지하 는 기술에 관한 것이다."}
{"patent_id": "10-2021-7002393", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "카지노 등의 유기장에서는, 다양한 부정 행위를 방지하는 시도가 실시되고 있다. 유기장은 부정 행위를 감 시하기 위한 감시 카메라를 구비하고, 감시 카메라로부터 얻은 화상으로부터 게임의 부정이나, 승패 결과와 상 이한 칩의 회수 (回收) 나 상환에 의한 부정을 판정하는 등 하여 부정 방지를 하고 있다. 한편, 배팅된 칩의 매수나 총액을 파악하기 위해서 각 칩에 IC 태그를 붙여 칩의 액수를 파악하는 것이 제안되 어 있다. 국제 출원 PCT/JP2015/000171 에 기재된 카드 게임 모니터링 시스템에서는, 유기 테이블 상에 놓여진 칩이 승패 결과대로 회수 혹은 상환되었는지 여부를, 칩의 움직임을 화상 해석함으로써 판정하고, 부정 행위의 모니터링이 실시된다."}
{"patent_id": "10-2021-7002393", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은, 유기장에서의 게임에 있어서의 부정 행위, 또는 칩의 배팅이나 정산을 할 때의 미스나 부정 행위를 검지하는 신규한 관리 시스템을 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2021-7002393", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 관리 시스템은, 테이블 게임의 관리 시스템으로서, 유기 테이블에 있어서 각 게임의 승패 결과를 판 정하여 표시하는 카드 배포 장치와, 상기 유기 테이블 상에 둔 유기용 대용 화폐의 종류와 매수를 카메라를 사 용하여 측정하는 측정 장치와, 각 게임에 있어서 상기 측정 장치의 측정 결과를 이용하여, 게임 참가인이 상기 유기 테이블 상에 둔 유기용 대용 화폐의 위치와 종류와 매수를 특정하여 기억하는 관리 제어 장치를 갖고, 상 기 유기용 대용 화폐는, 복수의 색이 상이한 플라스틱의 층이 적층되고, 적어도 중간에 착색층을 구비하고, 상 기 중간의 착색층의 양측에 백색층 혹은 연한색층을 적층한 다층 구조로 함으로써 측면에 적층 방향의 줄무늬를 형성하고, 상기 착색층에 의해 유기용 대용 화폐의 종류가 특정 가능한 구성을 갖고, 상기 관리 제어 장치는, 상기 카드 배포 장치로부터 얻은 승패 결과 및 게임 참가인이 둔 유기용 대용 화폐의 위치와 종류와 매수의 측 정 결과를 이용하여, 각 게임에 있어서의 참가인의 승자 및 패자를 판정함과 함께 상기 유기 테이블에 있어서의 카지노측의 수지 계산을 각 게임마다 실시하는 계산 기능을 구비한 구성을 갖는다."}
{"patent_id": "10-2021-7002393", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "(제 1 실시형태) 카지노 등의 유기장에서는, 칩이 높게 쌓여 유기 테이블에 놓여지는데, 유기 테이블 아래에 형성한 IC 태그의 판독 장치에서는, 총액을 정확하게 판독할 수 없다는 문제가 있고, 판독 장치의 감도를 높게 하면, 상이한 위치 (위치에 의해 승패가 좌우된다) 에 놓여진 칩이, 합산되어 버려 각 위치마다의 칩의 총액을 파악할 수 없다는 과제가 존재한다. 또, 카메라로부터의 촬상에서는, 카메라의 시각에 의해 사각 (死角) 이 생기거나, 중첩에 의해 그림자가 생겨 칩의 총액을 파악할 수 없다는 과제가 있다. 또, 바카라 게임에 있어서 자주 실시되는데, 플레이어에 의한 카드의 스퀴즈 (뒤집어진 카드를 구부려 카드의 랭크 등을 즐기면서 조금씩 보는 행위) 등에 의해 카드가 구부러져 버려, 카메라로부터의 화상 분석에서는 카드 의 랭크와 슈트를 판정할 수 없다는 과제가 존재한다. 또, 유기 테이블에 있어서의 부정이 더욱 고도화되어, 그 유기 테이블에서 단순하게 이긴 액수가 많다든가 하는 검출로는 발견할 수 없는 고도의 배팅 방법에 의한 부정 등은, 카메라나 이긴 액의 추적으로는 발견할 수 없다 는 새로운 과제도 파악되고 있다. 또, 딜러와 플레이어의 공모에 의한 부정 행위도 종래 기술에서는 방지가 충분하지 않다. 상기 여러 가지 과제를 해결하기 위해서, 본 실시형태의 복수의 유기 테이블을 갖는 유기장에 있어서의 부정 행 위의 검지 시스템은, 복수의 유기 테이블을 갖는 유기장에 있어서의 부정 행위의 검지 시스템으로서, 상기 유기 테이블에서 실시되는 게임의 진행 상태를 딜러 및 플레이어를 포함하여 카메라를 통하여 영상으로서 기록하는 게임 기록 장치와, 상기 기록된 게임의 진행 상태의 영상을 화상 분석하는 화상 분석 장치와, 상기 유기 테이블 에 있어서 각 게임의 승패 결과를 판정하여 표시하는 카드 배포 장치와, 상기 화상 분석 장치에 의한 화상 분석 결과와 상기 카드 배포 장치가 판정하는 승패 결과를 이용하여, 상기 유기 테이블에서 실시되는 부정 행위를 검 지하는 지능형 제어 장치를 구비한다. 또한, 검지 시스템으로서, 카드 배포 장치는, 배포되는 카드의 랭크를 판독 가능한 구조로서, 지능형 제어 장치 는, 유기 테이블에 있어서 배포된 각 카드의 영상으로부터 상기 화상 분석 장치가 얻는 랭크의 정보와, 상기 카 드 배포 장치가 판독한 카드의 랭크의 정보를 대조하여 일치 불일치를 판정 가능한 구조이다. 또한, 검지 시스템으로서, 화상 분석 장치 혹은 지능형 제어 장치는, 유기 테이블에 있어서 배포되고 플레이어 에 의해 접어 구부러지거나 혹은 오염된 카드로부터 카드의 랭크의 정보를 얻는 것이 가능한 인공 지능 활용형 혹은 딥 러닝 구조이다. 또한, 검지 시스템으로서, 지능형 제어 장치는, 상기 화상 분석 장치를 통하여 각 플레이어가 배팅하는 칩의 위 치, 종류 및 매수를 파악하고, 각 플레이어가 배팅한 진 칩의 회수 및 이긴 칩에 대한 지불이 게임의 승패 결과 에 따라서 적정하게 실시되었는지 여부를, 상기 화상 분석 장치를 통하여 게임의 진행 상태의 영상을 분석함으 로써 판정한다. 또한, 검지 시스템으로서, 화상 분석 장치 혹은 지능형 제어 장치는, 유기 테이블 상에 놓여진 복수의 칩이 상 기 카메라의 사각에 의해 일부 혹은 1 매 전체가 숨겨진 상태로 되어 있어도, 배팅된 칩의 종류, 매수와 위치의 정보를 얻는 것이 가능한 인공 지능 활용형 혹은 딥 러닝 구조이다. 또한, 검지 시스템으로서, 지능형 제어 장치는, 유기 테이블의 딜러의 칩 트레이에 있어서의 파악되어 있는 칩 의 액수가, 게임이 종료하여 청산 후에, 각 플레이어가 배팅한 진 칩의 회수 및 이긴 칩에 대한 지불액에 따라 증감했는지 여부를, 게임의 승패 결과에 따라서 비교 계산 가능한 인공 지능 활용형 혹은 딥 러닝 구조이다. 또한, 검지 시스템으로서, 지능형 제어 장치는, 유기 테이블의 각 플레이 위치에 있어서 배팅한 칩의 위치와 액 수를 파악하고, 각 게임의 승패 결과로부터 얻어지는 각 플레이어의 승패 이력과 얻은 칩의 액수를, 과거의 게 임의 통계 데이터와 비교하여 특이한 상황으로서 추출 가능한 인공 지능 활용형 혹은 딥 러닝 구조이다. 또한, 검지 시스템으로서, 지능형 제어 장치는, 어느 유기 테이블의 플레이 위치에 있어서, 졌을 때의 배팅 칩 의 액수가, 이겼을 때의 배팅 칩의 액수보다 소액인 상태가 과거의 게임의 통계 데이터와 비교하여 특이한 상황으로서 추출 가능한 인공 지능 활용형 혹은 딥 러닝 구조이다. 또한, 검지 시스템으로서, 지능형 제어 장치는, 상기 화상 분석 장치를 통하여 상기 특이한 상황으로서 추출되 거나, 혹은 소정액 이상의 승리를 거둔 플레이 위치에 있어서의 개별 플레이어의 특정이 가능한 구조이다. 또한, 검지 시스템으로서, 지능형 제어 장치는, 상기 특정된 플레이어가, 자리를 떠 다른 유기 테이블에 앉았을 때, 당해 다른 유기 테이블에 당해 특정 플레이어의 존재를 알리는 경고 기능을 갖는다. 상기 여러 가지 과제를 해결하기 위해서, 본 실시형태의 복수의 유기 테이블을 갖는 유기장에 있어서의 부정 행 위의 검지 시스템은, 상기 유기 테이블에서 실시되는 게임의 진행 상태를 딜러 및 플레이어를 포함하여 카메라 를 통하여 영상으로서 기록하는 게임 기록 장치와, 상기 유기 테이블에 있어서 각 게임의 승패 결과를 판정하여 표시하는 카드 배포 장치와, 상기 기록된 게임의 진행 상태의 영상을 화상 분석하는 화상 분석 장치와, 상기 화 상 분석 장치에 의한 화상 분석 결과를 이용하여, 상기 유기 테이블에 있어서 지폐와 칩을 검지 가능한 지능형 제어 장치를 구비하고, 상기 화상 분석 장치 혹은 지능형 제어 장치는, 상기 카드 배포 장치 혹은 상기 딜러로 부터 얻어지는 정보에 기초하여, 카드의 딜링 중 이외의 상황에 있어서, 상기 유기 테이블에 있어서 지폐와 칩 의 교환이 실시되고 있는 것을 검지 가능하고, 또한 상기 지폐가 블랙 라이트에 의해 검증된 진정한 지폐의 총 액을 인지하고, 또한 교환 대상으로서 유기 테이블 상에 나온 복수의 칩이 상기 카메라의 사각에 의해 일부 혹 은 1 매 전체가 숨겨진 상태로 되어 있어도 칩의 총액을 인지 가능하고, 상기 유기 테이블 상에 플레이어로부터 나온 지폐의 총액과, 딜러로부터 나온 칩의 총액을 비교하고, 양자의 액수가 일치하는지 여부를 판정 가능한 인 공 지능 활용형 혹은 딥 러닝 구조이다. 또한, 검지 시스템으로서, 지능형 제어 장치는, 유기 테이블의 딜러의 칩 트레이에 있어서의 파악되어 있는 칩 의 액수가, 지폐와 칩의 교환이 실시되어 청산한 후에, 교환한 지폐에 대응한 칩의 지불액에 따라 증감했는지 여부를, 비교 계산 가능한 인공 지능 활용형 혹은 딥 러닝 구조이다. 또한, 검지 시스템으로서, 지능형 제어 장치는, 지폐와 칩의 교환이 실시되어 청산한 후에, 당해 딜러의 입력에 의한 지폐의 입금액과, 상기 화상 분석 장치에 의한 화상 분석 결과에 의한 지폐의 총액의 일치 불일치를 비교 계산 가능한 인공 지능 활용형 혹은 딥 러닝 구조이다. 또, 나아가서는, 지능형 제어 장치는, 당해 딜러가 담당하는 유기 테이블에 있어서의 당해 딜러의 입력에 의한 지폐의 총 토탈 입금액과, 상기 화상 분석 장치에 의한 화상 분석 결과에 의한 지폐의 총 토탈액의 일치 불일치를 비교 계산 가능한 인공 지능 활용형 혹은 딥 러 닝 구조이다. 본 실시형태의 시스템에 의하면, 바카라 게임 등에 있어서 자주 실시되는 플레이어에 의한 카드의 스퀴즈에 의 해 카드가 구부러져 버려도, 화상 분석으로 카드의 랭크와 슈트를 판정할 수 있고, 사각이나 중첩된 칩도 총액 을 위치와 함께 파악할 수 있다. 또 지폐와 칩의 교환시의 부정도 검지할 수 있다. 이하, 도면을 사용하여, 실시형태의 복수의 유기 테이블을 갖는 유기장에 있어서의 부정 행위의 검지 시스템의 전체의 개요를 이하에 설명한다. 도 1 은 동 시스템의 전체의 개요를 나타내는 도면으로서, 복수의 유기 테 이블 을 갖는 유기장에 있어서의 부정 행위의 검지 시스템은, 유기 테이블 에서 실시되는 게임의 진행 상태를 플레이어 및 딜러 를 포함하여 복수의 카메라 를 통하여 영상으로서 기록하는 게임 기록 장 치 , 및 기록된 게임의 진행 상태의 영상을 화상 분석하는 화상 분석 장치 , 또한 유기 테이블 에 있어서 각 게임의 승패 결과를 판정하여 표시하는 카드 배포 장치 를 구비한다. 카드 배포 장치 는, 이미 당업자에서 사용되고 있는, 이른바 전자 슈이며, 미리 게임의 룰이 프로그램되어 있고, 배포되는 카드 (C) 의 정보를 판독하여, 게임의 승패를 판정할 수 있는 구조로 되어 있다. 예를 들어 바카라 게임에서는, 뱅커의 승, 플레이어의 승, 타이 (무승부) 가, 기본적으로 2-3 매의 카드의 랭크에 의해 결정되고, 판정 결과 (승패 결과) 는 표시 램프 에서 표시된다. 본 검지 시스템은, 또한 화상 분석 장치 에 의한 화상 분석 결과에 의한 실제 카드의 랭크와, 카드 배포 장치 가 판정하는 승패 결과를 비교하고, 유기 테이블 에서 실시되는 부정 행위 (배포된 카드의 랭크 합계와 승패 결과의 불일치 등) 를 검지하는 지능형 제어 장치 를 구비한다. 카드 배포 장치 는, 딜러 에 의해 수동으로 배포되는 카드 (C) 의 랭크 (A, 2, 3-Q, K) 와 슈트 (하트, 스페이드 등) 를 판독 가능한 구조로서, 지능형 제어 장치 는, 유기 테이블 에 있어서 배포된 각 카드의 영상 (카메라 를 사용하여) 으로부터 화상 분석 장치 (인공 지능을 사용한다) 가 얻는 랭크와 슈트의 정보와, 카드 배포 장치 가 판독한 카드와 슈트의 정보를 대조하여 일치 불일치를 판정 가능한 구조로 되어 있다. 본 검지 시스템에 있어서의 화상 분석 장치 및 지능형 제어 장치 는, 일체 혹은 복수의 구성으로 이루어지는컴퓨터 및 프로그램, 메모리를 복합적으로 구비한 구조로 되어 있다. 화상 분석 장치 및 지능형 제어 장치 는, 유기 테이블 에 있어서 배포되고 플레이어 에 의해 접어 구부러지거나 혹은 오염된 카드 (C) 라도, 카드의 랭크의 정보를 얻는 것이 가능한 인공 지능 활용형 혹은 딥 러닝 구조를 갖는다. 오염된 카드 (C) 는 도 3 에 나타내는 바와 같이, 클로버과 스페이드의 판별이 곤 란한 상황이 출현한다. 이러한 경우에도, 인공 지능 활용형의 컴퓨터 혹은 제어 시스템, 딥 러닝 (구조) 기 술을 이용한 화상의 분석, 판정에 의해, 슈트의 판별이 가능해진다. 또, 바카라 게임 등에 있어서 자주 실 시되는 플레이어에 의한 카드의 스퀴즈에 의해 카드가 구부러져 버려도, 다수의 화상의 변형예의 자기 학습 등 을 이용하여, 인공 지능 활용형의 컴퓨터 혹은 제어 시스템, 딥 러닝 (구조) 기술에 의해, 변형 전의 카드가 갖 고 있던 슈트나 랭크를 인식 가능하게 된다. 인공 지능 활용형의 컴퓨터 혹은 제어 시스템, 딥 러닝 (구조) 기술은 당업자에서 이미 알려져 있어 이용 가능하기 때문에, 상세한 설명을 생략한다. 인공 지능 활용형 혹은 딥 러닝 구조를 갖는 지능형 제어 장치 는, 카메라 , 화상 분석 장치 를 통하여 각 플레이어 가 배팅하는 칩 의 위치 (플레이어나, 뱅커나, 페어에 배팅한 위치), 종류 (칩 은 색마다 상이한 액수의 값이 할당되어 있다) 및 매수를 파악하는 것이 가능하다. 칩 은, 수 직 방향으로 정렬하여 겹쳐 쌓이는 경우보다, 도 2a 에 나타내는 바와 같이 어긋나게 중첩된다. 이 경우, 도 2a 에 나타내는 화살표 (X) 방향으로 카메라가 위치하는 경우 (혹은 상대적으로 칩 의 방향이 사각이 되 는 경우), 도 2b 와 같이 칩이 보이지 않는 (사각에 들어가는) 것이 상정된다. 인공 지능 활용형의 컴퓨터 혹은 제어 시스템, 딥 러닝 (구조) 기술에 있어서는, 자기 학습 기능 등을 이용하여, 칩 의 사각에 의한 숨 겨짐 등 (1 매의 칩의 일부가 숨겨지는 경우, 혹은 칩 전체가 숨겨지는 경우를 인식하여, 정확하게 매수 등이 파악된다. 이와 같이, 칩 의 위치 (플레이어나, 뱅커나, 페어에 배팅한 위치), 종류 (칩은 색마다 상이한 액수의 값이 할당되어 있다) 및 매수를 파악하는 것이 가능하기 때문에, 각 게임에 있어서 카드 배포 장 치 가 판정하는 게임의 승패 결과에 따라서, 각 플레이어 가 배팅한 진 칩의 회수 (화살표 (L) 로 나타 낸다) 및 이긴 플레이어 (6W) 에 대한 이긴 칩에 대한 지불 (9W) 이 게임의 승패 결과에 따라서 적정하게 실시 되었는지 여부를, 지능형 제어 장치 는, 화상 분석 장치 를 통하여 게임의 진행 상태의 영상을 분석 함으로써 판정한다. 지능형 제어 장치 는, 유기 테이블 의 딜러 의 칩 트레이 에 있어서의 칩 의 총액이 화 상 분석 장치 를 사용하여 분석 파악 가능하고, 게임이 종료하여 청산한 후에, 각 플레이어 가 배팅한 진 칩 의 회수 및 이긴 플레이어 (6W) 에 대한 이긴 칩에 대한 지불 (9W) 의 액수에 따라, 칩 트레이 내의 칩 의 총액이 증감했는지 여부를, 게임의 승패 결과에 따라서 비교 계산 가능하다. 칩 트레이 에 있어서의 칩 의 총액은, RFID 등의 수단으로 항상 파악되고 있어도, 그 증감액이 바른지, 여부는, 지능형 제어 장치 가, 화상 분석 장치 를 통하여 게임의 진행 상태의 영상을 분석함으로써 판정한다. 이들도 인공 지능 활용형 혹은 딥 러닝 구조가 활용된다. 지능형 제어 장치 는, 유기 테이블 의 각 플레이 위치 에 있어서 배팅한 칩의 위치 (플레이어나, 뱅커나, 페어에 배팅한 위치) 와 액수 (종류와 매수) 를 파악하고, 각 게임의 승패 결과에 의해 얻어지는 각 플 레이어 의 승패 이력과 얻은 칩의 액수 (이긴 액수) 를, 과거의 다수 (빅 데이터) 의 게임의 통계 데이터와 비교하여 특이한 상황 (카지노에 의해 설정된다) 으로서 추출 가능한 인공 지능 활용형 혹은 딥 러닝 구조이다. 전형적으로는 어느 액수 (100 만 달러) 이상의 승리액의 발생이나, 어느 유기 테이블 의 플레이 위치 에 있어서, 졌을 때의 배팅한 칩의 액수가 적고, 이겼을 때의 배팅한 칩의 액수가 많은 상태가 수 게임 계 속되고, 그것이 과거의 게임의 통계 데이터 (빅 데이터 등) 와 비교하여 특이한 상황으로서 이것을 추출 가능한 인공 지능 활용형 혹은 딥 러닝 구조의 지능형 제어 장치 를 구비하는 것이다. 또한, 본 검지 시스템의 지능형 제어 장치 는 (화상 분석 장치 와 일체가 되어) 특이한 상황으로서 추출되거나, 혹은 소정액 이상의 승리를 거둔 플레이 위치 에 있어서의 개별 플레이어 의 특정이 가능 한 구조이다. 이와 같은 플레이어 의 특정은, 화상 분석 장치 에 있어서, 얼굴의 화상을 특징점 추출 등에 의해 얻고, 아이덴티티 번호 (ID 등) 를 부여하여 특정해 둔다. 그리고 지능형 제어 장치 는, 특정된 플레이어 가, 자리를 떠 다른 유기 테이블에 앉았을 때, 당해 다른 유기 테이블에 당해 특정 플 레이어의 존재를 알리는 경고 기능을 갖는다. 구체적으로는, 각 유기 테이블 을 관리하는 피트 매니저 나 각 테이블 책임자 (딜러여도 된다) 에게 알리고, 추가적인 특이 현상의 방지를 도모한다. 본 실시형태에 있어서의 유기 테이블을 갖는 유기장에 있어서의 부정 행위의 검지 시스템은, 또한 유기 테이블 에 있어서 자주 실시되는 지폐와 칩의 교환시의 검사를 실시하는 기능을 구비한다. 카지노 등의 유기장에서는, 게임 전에 플레이어 는, 소정의 칩 교환소에서, 지폐 (현금 등) 와 유기용 칩을 교환한다. 그 러나, 플레이어 가 칩을 다 써 버리면, 유기 테이블 로부터 자리를 뜨지 않고, 유기 테이블 (바카라 테 이블 등) 상에서, 현금 (지폐) 으로부터 칩 의 교환을 하여 게임을 계속할 수 있다. 그러나, 여기에 딜 러 와 플레이어의 사이에서 부정이 행해질 기회가 생긴다. 유기 테이블 (바카라 테이블 등) 상에서, 현 금 (지폐) 으로부터 칩 의 교환은, 게임이 진행되고 있지 않을 때에 실시될 필요가 있다. 카드 배포 장 치 는, 게임의 승패를 결정하기 위해서, 카드의 딜링 개시와, 딜링 종료 (승패의 결정 시기) 를 검출하는 것이 가능하다. 이 때문에, 카드 배포 장치 중에 있어서, 카드의 배포 (딜링) 이외의 상황을 검출하고, 지능형 제어 장치 는, 카드의 딜링 중 이외의 상황에 있어서, 유기 테이블 에 있어서 지폐와 칩의 교 환이 실시되고 있는 것을 검지한다 (도 4 에 나타낸다). 카드의 딜링 중 (또는 그 이외의 상황) 은, 카드 배포 장치 혹은 딜러 의 동작으로부터 얻어지는 정보에 기초하여 검출할 수 있다. 지능형 제어 장치 는, 지폐 (K) 의 표면의 화상 분석을 실시하여 지폐의 매수와 액수를 인식 가능하다. 또한, 유기 테이블 에서는, 칩 과의 교환용 지폐 (K) 가 진정한 것인지 여부가, 블랙 라이트를 조사 함으로써 지폐의 진정 마크 (G) 를 검출하여 실시된다. 도 4 에 나타내는 바와 같이, 지능형 제어 장치 는, 이 진정 마크 (G) 도 화상 분석하여 검증하고, 진정한 지폐의 총액을 인지하고, 또한 교환 대상으로서 유기 테이블 상에 나온 복수의 칩이 카메라 의 사각에 의해 숨겨진 상태로 되어 있어도 칩의 총액을 인지 가능하고, 유기 테이블 상에 플레이어로부터 나온 지폐 (K) 의 총액과, 딜러 로부터 나온 칩 의 총 액을 비교하여, 양자의 액수가 일치하는지 여부를 판정 가능한 인공 지능 활용형 혹은 딥 러닝 구조로 되어 있 다. 지능형 제어 장치 는, 유기 테이블 의 딜러 의 칩 트레이 에 있어서의 칩 의 총액이, 지 폐와 칩의 교환이 실시되어 청산한 후에, 교환한 지폐에 대응한 칩의 지불액에 따라 증감했는지 여부를, 비교 계산 가능한 인공 지능 활용형 혹은 딥 러닝 구조이다. 딜러 의 칩 트레이 에 있어서의 칩 의 총액은, 칩 의 RFID 등에 의해 미리 항상 파악되어 있는 경우도 생각할 수 있다. 지능형 제어 장치 는 이미 알고 있는 칩 의 액수에 대하여, 지폐와 칩의 교환이 실시되어 청산 후의 칩의 증감이, 화상 분석 결과의 칩의 교환액과 일치하는지를 검증한다. 또한, 지능형 제어 장치 는, 지폐와 칩의 교환이 실시되어 청산한 후에, 딜러 에 의한 지폐의 입금액 (통상적으로는 키 입력 등에 의한) 과, 화상 분석 장치 에 의한 화상 분석 결과의 지폐의 계산 금액의 일치 불일치를 비교 계산 가능한 인공 지능 활용형 혹은 딥 러닝 구조이다. 또, 나아가서는, 지능형 제어 장치 는, 당해 딜러가 담당하는 유기 테이블 에 있어서의 당해 딜러의 입력에 의한 지폐의 총입금액과, 상기 화상 분석 장치 에 의한 화상 분석 결과에 의한 지폐의 총액의 일치 불일치를 비교 계산 가능한 인공 지능 활용형 혹은 딥 러닝 구조이다. (제 2 실시형태) 제 2 실시형태에 관련된 시스템은, 유기장에서의 게임에 있어서의 칩의 배팅이나 정산을 할 때의 미스나 부정 행위를 검지하는 시스템에 관한 것이다. 카지노 등의 유기장에 있어서 실시되는 많은 테이블 게임 중에는 바카라나 블랙 잭이 있다. 이들 게임은 52 매의 플레잉 카드로 이루어지는 표준적인 덱을 사용하고, 미리 셔플되어 있는 복수의 덱 (6 내지 9 혹은 10 덱) 을 구비하는 카드 배포 장치로부터 게임 테이블 상에 플레잉 카드가 배포되고, 배포된 카드의 수 (랭크) 나 게 임 룰에 기초하여, 승패가 결정된다. 카드 배포 장치로부터의 카드의 배포나 손님 (게임 참가인) 에 대한 배팅금의 정산은, 게임 테이블을 담당하고 있는 딜러 등이 실시한다. 카지노 등의 유기장에서는, 이 손님 (게임 참가인) 에 대한 배팅금의 정산에 있 어서의 미스나 부정 행위를 방지하는 시도가 실시되고 있다. 국제 공개 WO2015/107902에 기재된 카드 게임 모니터링 시스템에서는, 감시 카메라를 사용하여 칩의 움직임을 판독하고, 승자에게 배팅금이 지불되고 있는지 여부 체크한다. 바카라나 블랙 잭에 있어서의, 손님에 의한 배팅이나 딜러에 의한 손님 (게임 참가인) 에 대한 배팅금의 정산에 대해서, 이것들이 실시되고 있는 타이밍이나, 칩이 누구에 의해 놓여지고, 또는 취해졌는지를 검지할 수 없고, 그 때문에 이것들이 바른지 여부 파악할 수 없다는 과제가 존재한다. 상기 여러 가지 과제를 해결하기 위해서, 본 실시형태의 유기 테이블을 갖는 유기장에 있어서의 부정 검지 시스 템은, 게임의 부정 검지 시스템으로서, 유기 테이블에서 실시되는 게임의 진행 상황을 카메라를 사용하여 모니터링하는 게임 모니터링 장치와, 상기 카메라로부터 얻은 영상을 화상 분석하는 화상 분석 장치와, 상기 유기 테이블에 있어서 각 게임의 승패 결과를 판정하여 표시하는 카드 배포 장치와, 각 게임에 있어서 상기 화상 분 석 장치의 분석 결과를 이용하여, 게임 참가인이 상기 유기 테이블 상에 둔 칩의 위치를 특정하고, 또한 상기 승패 결과를 이용하여, 각 게임의 참가인 중 승자 및 패자를 판정하는 제어 장치를 구비하고, 상기 제어 장치는, 또한, 1) 각 게임에 있어서, 카드의 인출이 개시되고 나서 혹은 딜러의 게임 개시 조작으로부터 카드 배포 장치에 의해 게임의 승패 결과가 표시되기 전의 사이에, 칩의 움직임이 없는지 여부, 2) 각 게임의 종료 후, 딜러가 게임 참가인 중 패자가 배팅한 칩을 회수하고 있는 사이에, 딜러 이외의 사람에 의한 칩의 움직임이 없는지 여부, 3) 각 게임의 종료 후, 딜러가 게임 참가인 중 패자가 배팅한 칩을 회수하고 있는 사이에, 상기 패자가 칩을 추가하고 있지 않는지 여부, 4) 각 게임의 종료 후, 딜러가 게임 참가인 중 승자가 배팅한 칩의 위 치에, 지불을 실시했는지 여부, 5) 각 게임의 종료 후, 게임 참가인 중 승자가, 배팅한 칩 및 지불된 칩을 취했 는지 여부, 중 적어도 하나를 판정하는 기능을 구비한다. 또한, 상기 제어 장치는, 상기 화상 분석 장치의 분석 결과를 이용하여, 딜러 및 게임 참가인의 손의 움직임, 칩의 움직임, 또는 상기 손의 움직임과 칩의 움직임을 검지함으로써, 상기 1) 내지 5) 중 적어도 하나를 판정하 도록 구성되어 있어도 된다. 또한, 상기 제어 장치는, 딜러에 의해 승자에게 지불된 칩의 액수가, 게임 참가인 중 승자가 배팅한 액수에 기 초하여 바른지 여부를 판정하도록 구성되어 있어도 된다. 또한, 상기 게임의 부정 검지 시스템은, 상기 판정 결과를 받아서 경고 또는 표시를 실시하는 모니터 또는 램프 를 더 구비하고 있어도 된다. 본 실시형태의 시스템에 의하면, 바카라나 블랙 잭에 있어서의, 손님에 의한 배팅이나 딜러에 의한 손님 (게임 참가인) 에 대한 배팅금의 정산에 대해서, 이것들이 실시되는 타이밍이나, 칩이 누구에 의해 놓여지고, 또는 취 해졌는지를 검지할 수 있고, 이들 미스나 부정 행위를 검지하여 경고 또는 표시하고, 재발 방지로 연결할 수 있 다. 실시형태의 상세한 설명에 들어가기 전에, 카지노 등의 유기장에 있어서 실시되는 바카라 게임의 흐름에 대해서 설명한다. 도 5 에 나타내는 바와 같이, 게임 테이블 에 있어서, 딜러 와 마주 보도록 손님 (게임 참가인) 이 의자 에 착석한다. 그리고 손님 (게임 참가인) 은, 바카라 게임의 승패 결과로서, 플레이어 (PLAYER) 와 뱅커 (BANKER) 중 어느 쪽이 승리할지, 또는 비기게 (TIE) 될지를, 눈앞의 배팅 에어리어 에 칩 을 배치함으로써 배팅한다 (이하, 이것을 「배팅」 라고 한다). 그리고 딜러 는, 손님 (게임 참 가인) 에 의한 배팅을 종료시키기 위해서 타이밍을 계산하여 \"No More Bet (배팅 접수 종료)\" 라고 콜 하고, 손을 횡 방향으로 움직이는 등을 실시한다 (도 5 에 나타내는 상태). 바카라 게임에서는, \"No More Bet (배팅 접수 종료)\" 라고 콜 되고, 카드의 인출이 개시되고 나서 혹은 딜러 가 게임 개시의 조작을 하고 나서, 카드 배포 장치 에 의해 게임의 승패 결과가 표시되기 전의 사이는, 손님 (게임 참가인) 은 칩을 움직이거나, 추가 칩을 배팅하거나, 한 번 배팅한 칩을 되찾을 수는 없다. 그 후, 카드 배포 장치 로부터 플레잉 카드 를 1 매씩 이면이 위를 향한 상태로 게임 테이블 에 인 출한다. 우선은 4 매 인출하고, 도 6 의 동그라미 친 1 ∼ 4 에 나타내는 바와 같이, 1 매째의 카드는 플레 이어 (PLAYER), 2 매째의 카드는 뱅커 (BANKER), 3 매째의 카드는 플레이어 (PLAYER), 4 매째의 카드는 뱅커 (BANKER) 의 패가 되고, 게임 테이블 상의 딜러 로부터 본 바로 앞의 에어리어 (플레이어 에어리 어 (10P) 와 뱅커 에어리어 (10B)) 에 배분하여 배치된다. 그리고 1 내지 4 매째의 카드 의 랭크 (수) 와, 바카라 게임의 상세한 룰에 있어서의 조건에 기초하여, 딜러 에 의해 5 매째의 카드 , 또한 6 매째 의 카드 가 인출되고, 이들은 플레이어 (PLAYER) 또는 뱅커 (BANKER) 의 패가 된다. 그리고, 1 내지 4 매째의 (경우에 따라서 5 매째, 6 매째도 합한) 카드 의 랭크 (수) 와, 바카라 게임의 상세한 룰에 기초하 여, 게임의 승패가 판정된다. 여기서, 상기 카드 배포 장치 에는, 미리 게임의 룰이 프로그램 되어 있 고, 배포되는 카드 의 정보 (랭크 (수) 나 슈트) 를 판독하여, 게임의 승패를 판정할 수 있는 구조로 되어 있다. 카드 배포 장치 에 의해 판정된 승패 판정 결과 (승패 결과) 는, 상기한 바와 같이 딜러 등에 의 해 판정된 승패 결과와 일치하고 있는지 여부가 판정된다. 이하에, 도면을 참조하여 제 2 실시형태의 유기장에서의 게임에 있어서의 부정 행위의 검지 시스템의 전체의 개 요를 설명한다. 도 5 는 동 시스템의 전체의 개요를 나타내는 도면으로서, 유기장에서의 게임에 있어서의부정 행위의 검지 시스템은, 게임 테이블 에서 실시되는 게임의 진행 상태를 손님 (게임 참가인) 및 딜 러 를 포함하여 카메라 를 통하여 영상으로서 기록하는 게임 모니터링 장치 , 및 기록된 게임의 진 행 상태의 영상을 화상 분석하는 화상 분석 장치 , 또한 유기 테이블 에 있어서 각 게임의 승패 결과를 판정하여 표시하는 기능을 갖는 카드 배포 장치 를 구비한다. 카드 배포 장치 는, 이미 당업자에서 사용되고 있는, 이른바 전자 슈이며, 미리 게임의 룰이 프로그램 되어 있고, 카드 가 딜러 에 의해 각 게임의 시작에 배포되는 타이밍을 검지함과 함께, 배포되는 각 카드 의 정보 (랭크 (수) 나 슈트) 를 판독 하여, 게임의 승패를 판정할 수 있는 구조로 되어 있다. 예를 들어 바카라 게임에서는, 뱅커의 승, 플레이 어의 승, 타이 (무승부) 가, 기본적으로 각각 2-3 매의 카드의 랭크에 의해 결정되고, 판정 결과 (승패 결과) 는 표시 램프 에서 표시된다. 본 검지 시스템의 제어 장치 는, 매 게임에 있어서 화상 분석 장치 의 분석 결과를 이용하여, 손님 (게임 참가인) 이 게임 테이블 상의 플레이어측 혹은 뱅커측 어느 쪽의 배팅 에어리어 에 칩 을 배팅했는지를 특정하는 칩 검지 기능을 구비하고 있다. 칩 의 위치와 총액 (플레이어측 혹은 뱅커측 어느 쪽의 배팅 에어리어 에 칩 이 배팅되었는지) 은, 칩 이 어긋나게 중첩되거나, 카메라 의 위치로부터는 사각이 되는 경우 등, 통상에서는 판독되지 않는 것이 상정된다. 제어 장치 는, 기존의 인공 지능 활용형의 컴퓨터 혹은 제어 시스템, 딥 러닝 (구조) 기술에 의한, 자기 학습 기능 등을 이용하여, 칩 의 사각에 의한 숨겨짐 등 (1 매의 칩의 일부가 숨겨지는 경우, 혹은 칩 전체가 숨겨지는 경우) 을 인식하 여, 정확하게 위치와 매수 등을 파악 가능하도록 구성되어 있다. 또한, 칩 의 배팅 에어리어 에 있 어서의 위치 및 종류를 검지하는 구조는 이것에 한정되지 않고, 예를 들어 칩에 매립된 ID 를 판독하여 검 지하도록 구성되어 있어도 된다. 제어 장치 는, 이상으로 설명한 바와 같이 카메라 , 화상 분석 장치 를 통하여 각 플레이어 가 배팅하는 칩 의 위치 (플레이어나, 뱅커나, 페어에 배팅한 위치), 종류 (칩 은 색마다 상이한 액수의 값이 할당되어 있다) 및 매수를 파악하는 것이 가능하고, 플레이어에 배팅한 것은 어느 손님 인지 (플레이어에 배팅한 손님 이 복수 있는 경우에는, 제일 고액을 배팅한 것은 어느 손님 인지), 뱅커에 배팅한 것은 어느 손님 인지 (뱅커에 배팅한 손님 이 복수 있는 경우에는, 제일 고액을 배팅한 것은 어 느 손님 인지) 를, 검지할 수 있다. 본 검지 시스템에 있어서의 화상 분석 장치 및 제어 장치 는, 일체 혹은 복수의 구성으로 이루어지는 컴퓨터 및 프로그램, 메모리를 복합적으로 구비한 구조로 되어 있다. 제어 장치 는, 게임 테이블 에 있어서 배포된 각 카드 의 영상 (카메라 를 사용하여) 으로부 터 화상 분석 장치 가 얻는 랭크와 슈트의 정보와, 카드 배포 장치 가 판독한 링크와 슈트의 정보를 대조하여 일치 불일치를 판정 가능한 구조로 되어 있다. 각 게임에 있어서 카드 배포 장치 가 판정하는 게임의 승패 결과에 따라서, 손님 (게임 참가인) 이 배팅한 진 칩 의 회수 및 이긴 손님 (게임 참가인) 에 대한 이긴 칩에 대한 지불이 게임의 승패 결과에 따라서 적정하게 실시되었는지 여부를, 제어 장치 는, 화상 분석 장치 를 통하여 게임의 진행 상태의 영상을 분석함으로써 판정한다. 제어 장치 는, 본 실시형태의 특징적인 기능으로서, 바카라 게임의 룰에 따라서, 이하의 1) 내지 5) 에 나 타내는 기능을 갖고 룰에 반하는 부정이 실시되고 있지 않는지 여부를 판정한다. 즉, 1) 각 게임에 있어서, 카드 배포 장치 로부터 얻어지는 카드의 인출이 개시되는 신호로부터, 혹은 딜러 가 개시 버튼 (4s) 을 누르는 것에 의한 게임 개시 조작으로부터, 카드 배포 장치 에 의해 게임의 승패 결 과가 표시되기 전의 사이에, 칩 의 움직임이 없는지 여부를, 카메라 를 사용하여 화상 분석 장치 가 얻는 정보에 의해 감시한다 (도 6 에 나타낸다). 2) 각 게임의 종료 후, 딜러 가 게임 참가인 중 패자가 배팅한 칩 을 회수하고 있는 사이 (도 7 에 나타낸다) 에, 패자 (6L) 가 칩 을 부정하게 취하고 있지 않는지 여부를, 카메라 를 사용하여 화상 분 석 장치 가 얻는 정보에 의해 감시한다. 3) 각 게임의 종료 후, 딜러 가 게임 참가인 중 패자가 배팅한 칩 을 회수하고 있는 사이에, 딜러 이외의 사람 (승자 혹은 패자) 이 이긴 칩 (9W) 을 추가하거나, 배팅하지 않은 이긴 측에 새로이 칩 을 두 지 않았는지 여부를, 카메라 를 사용하여 화상 분석 장치 가 얻는 정보에 의해 감시한다. 4) 각 게임의 종료 후, 딜러 가 게임 참가인 중 승자 (6W) 가 배팅한 칩 의 위치에, 바르게 지불의 칩 (9W) 을 두었는지 여부 (도 8 에 나타낸다) 를, 카메라 를 사용하여 화상 분석 장치 가 얻는 정보에 의해 감시한다. 5) 각 게임의 종료 후 (딜러 가 카드 배포 장치 를 조작하여 승패 결과를 표시 램프 에 표시시킨 다), 게임 참가인 중 승자 (6W) 가, 배팅한 칩 및 지불된 칩 (9W) 을 취했는지 여부 (도 9 에 나타낸다) 를, 카메라 를 사용하여 화상 분석 장치 가 얻는 정보에 의해 감시한다. 제어 장치 는, 카메라 를 사용하여 화상 분석 장치 가 얻는 정보의 분석을 이하와 같이 실시한다. 즉, 화상 분석 장치 의 분석 결과를 이용하여, 딜러 및 게임 참가인 의 손의 움직 임, 칩의 움직임, 또는 상기 손의 움직임과 칩의 움직임을 검지함으로써, 상기 1) 내지 5) 의 감시를 하지만, 그 기본이 되는 분석에 있어서는, 칩 이 누구에게 취해졌는지를 아는 것이 적어도 필요해진다. 이하에 그 분석 방법에 대해서, 이하, 도 10 내지 도 12 를 사용하여 설명한다. 게임 참가인 (6L) 이 배팅한 칩 을 딜러 가 취한 것의 분석 (도 10). 게임에서 진 게임 참가인 (6L) 이 배팅한 칩 은, 딜러 가 회수한다. 이것이 확실히 회수되었는지 여부를, 카메라 를 사용하여 화상 분석 장치 가 얻는 정보를 분석하여 감시한다. 우선, 배팅된 칩 이 존재하는 상태 (도 10a) 로부터 존재하지 않는 상태 (도 10c) 의 변화를 화상 분석에 의해 검출한다. 그리고 칩 이 존재하는 상태로부터 존재하지 않는 상태의 사이의 화상 (도 10b) 을 분석한다. 칩 이 존재하는 상태로부터 존재하지 않는 상태의 사이의 화상 (도 10b) 에 있어서, 손 (5h) 이 어느 쪽에서 뻗고 있는지 (도 10b 의 상방에서인지 그 이외인지) 를 분석하고, 상방에서 뻗고 있는 (혹은 상방에서 손이 출현하고, 또 상방으로 퇴출하는 손의 움직임) 경우에는 그 손 (5h) 을 딜러 의 것으로 판정하고, 그 이외 의 방향에서 손이 뻗었을 때는 부정으로 판정한다고 하는 룰을 기초로 하여 부정을 검출한다. 게임에서 진 게임 참가인 (6L) 이 배팅한 칩 을 딜러 가 회수하고 있는 사이에, 다른 사람이 진 칩 을 부정하게 취하지 않는지 여부를 감시한다 (도 10 및 도 11). 칩 이 존재하는 상태로부터 존재하지 않는 상태의 사이의 화상에 있어서, 도 11 에 나타내는 바와 같이, 게임 참가인 중 패자 (6L) 등이 취한 것 의 분석은, 손 (6h) 이 도 11 의 하방에서 (본래는 상방에서) 뻗거나 혹은 이동하는 것을 화상 분석에 의해 검 출하여, 이것을 딜러 이외의 손 (6h) 등이 칩 을 취하는 것이라고 판정하고, 이것을 부정이 있었다고 판정한다. 이긴 칩 에 대하여 딜러 가 바르게 칩 (9W) 을 지불하고 (두고), 그것을 게임 참가인 중 승자 (6W) 가 취한 것의 분석. 먼저 도 12a 에 나타내는 이긴 칩에 대하여, 도 12b 에 나타내는 바와 같이 게임의 룰에 따라서 칩 (9W) 이 상 환된다. 도 12a 에 나타내는 도면의 상태로부터 도 12b 에 나타내는 상태의 변화를 검출하고, 동시에 손이 딜러 의 손 (5h) 인지 여부를 화상 분석에 의해 검출한다. 이 후, 도 12c 에 나타내는 바와 같이 이번 에는 동일한 배팅 에어리어에 게임 참가인 중 승자 (6W) 의 손 (6h) 이 뻗어서 (이동해서), 그 후 칩 이 모두 없어지는지 여부 (도 12d 의 상태) 를 화상 분석 결과로부터, 게임의 룰에 따라서 제어 장치 가 검사하여 부정이 없었는지 여부를 판정한다. 또한, 제어 장치 는, 딜러 에 의해 승자에게 지불된 칩의 액수가, 게임 참가인 중 승자 (6W) 가 배 팅한 액수에 기초하여 바른지 여부를 판정하도록 구성되어 있다. 이하에 구체예를 나타낸다. 칩 의 위치와 총액 (플레이어측 혹은 뱅커측 어느 쪽의 배팅 에어리어 에 칩 이 배팅되었는지) 은, 칩 이 어긋나게 중첩되거나, 카메라 의 위치로부터는 사각이 되는 경우 등, 통상에서는 판독되지 않는 것이 상정 된다. 제어 장치 는, 기존의 인공 지능 활용형의 컴퓨터 혹은 제어 시스템, 딥 러닝 (구조) 기술에 의 한, 자기 학습 기능 등을 이용하여, 칩 의 사각에 의한 숨겨짐 등 (1 매의 칩의 일부가 숨겨지는 경우, 혹 은 칩 전체가 숨겨지는 경우) 을 인식하여, 정확하게 위치와 매수 등을 파악 가능하도록 구성되어 있다. 또 한, 칩 의 배팅 에어리어 에 있어서의 위치 및 종류를 검지하는 구조는 이것에 한정되지 않고, 예 를 들어 칩에 매립된 ID 를 판독하여 검지하도록 구성되어 있어도 된다. 제어 장치 는, 이상으로 설명한 바와 같이 카메라 , 화상 분석 장치 를 통하여 각 플레이어 가 배팅하는 칩 의 위치 (플레이어나, 뱅커나, 페어에 배팅한 위치), 종류 (칩 은 색마다 상이한 액수의 값이 할당되어 있다) 및 매수를 파악하는 것이 가능하고, 플레이어에 배팅한 것은 어느 손님 인지 (플레이어에 배팅한 손님 이 복수 있는 경우에는, 제일 고액을 배팅한 것은 어느 손님 인지), 뱅커에 배팅한 것은 어느 손님 인지 (뱅커에 배팅한 손님 이 복수 있는 경우에는, 제일 고액을 배팅한 것은 어 느 손님 인지) 를, 검지할 수 있다.또한, 본 게임의 부정 검지 시스템의 제어 장치 는, 바카라 게임의 룰에 따라서, 이상과 같은 수법으로, 카메라 를 사용하여 화상 분석 장치 가 얻는 정보를 분석하여 감시한다. 전술한 1) 내지 5) 에 나 타내는 감시를 실시하고, 룰에 반하는 부정이 실시되고 있지 않는지 여부를 판정한다. 부정 검지시에는, 카 드 배포 장치 혹은 게임 테이블 의 양방에 각각 형성한 이상 표시 램프 를 점등시키고, 카지노 관 리 부문 등에 부정의 검지를 무선·유선으로 출력 한다. 판정 결과를 받아서 경고 또는 표시를 실시하 는 모니터 또는 램프를 또한 다른 장소에 구비하고 있어도 된다. 이상과 같이 부정한 행위는, 제어 장치 에 의해 검지되고, 검지된 시점 또는 적절한 타이밍에, 카드 배포 장치 의 표시 램프 나 이상 표시 램프 나 이상 표시 램프 에 표시 신호를 내지만, 경고를 실시하는 것 외에, 부정 또는 오류가 검지된 시점 이후에 카드 배포 장치 가 갖는 카드의 배포를 저지하는 기능을 작동시켜, 카드 의 배포를 저지해도 된다. 이하에, 본 실시형태의 테이블 게임 시스템에 사용하는, 카드 배포 장치 의 일 실시형태에 대해서, 도 13 내지 도 17 을 사용하여 설명한다. 카드 배포 장치 는 복수 매의 셔플 플레잉 카드 (1s) 를 수용하는 카드 수용부 와, 딜러 등에 의해 카드 수용부 로부터 셔플 플레잉 카드 를 수동으로 1 매 씩 게임 테이블 을 향하여 인출될 때에, 셔플 플레잉 카드 를 안내하는 카드 가이드부 와, 카드 가이드부 로부터 안내된 카드 를 꺼내기 위한 개구부 와, 셔플 플레잉 카드 가 인출될 때 에, 셔플 플레잉 카드 가 인출된 것을 검지하는 카드 검지부 (카드 검지 센서 (22 및 23)) 와, 셔플 플레잉 카드 의 적어도 수 (랭크) 를 나타내는 정보를 판독하는 카드 판독부 와, 카드 판독부 에 의해 순차 판독되는 셔플 플레잉 카드 의 수 (랭크) 에 기초하여, 카드 게임의 승패를 판정하는 제어부 와, 제어부 에 의해 판정된 승패 결과를 표시하는 결과 표시 램프 와, 개구부 에 형성되어 상 기 카드 수납부 로부터의 카드 의 출입을 제한하는 배포 제한 장치 와, 제어 장치 와 동등 한 기능을 갖는 관리 제어부 를 포함하고, 이들은 일체화되어 있고, 제어 장치 에 의해 게임에 있어 서의 딜러의 미스나 부정 행위가 검지된 경우, 검지된 시점 이후의 또는 소정의 타이밍에, 카드 배포 장치 로부터 카드가 더 인출되는 것을 저지하는 기능을 갖고 있다. 다음으로, 카드 수납부 로부터의 카드 의 출입을 제한하는 배포 제한 장치 에 대해서 도 15, 도 16 을 사용하여 설명한다. 배포 제한 장치 는, 카드 수납부 의 전방의 개구 에서 1 매씩 꺼내지는 카드 를 게임 테이블 상에 안내하는 카드 가이드부 의 카드 가이드 에 형성되어 있다. 배포 제한 장치 는, 카드 가 카드 가이드부 와 카드 가이드 의 가이드 커버의 사이의 슬롯 을 통과할 때에 로크 부재 가 카드 를 가압하여 슬롯 내의 카드 의 출입을 저지하는 구조를 구비하고 있다. 로크 부재 는, 전자 솔레노이드나 압전 소자 등의 구동부 에 의 해, 카드 를 가압하는 위치 (제한 위치) 와, 카드 의 통과를 가능하게 하는 통과 가능 위치의 2 개의 상태를 취할 수 있도록 화살표 (m) 로 나타내는 바와 같이 이동한다. 구동부 는, 제어 장치 와 유선 또는 무선으로 직접 또는 간접적으로 접속된 제어부 에 의해 제어되고, 로크 부재 를 카드 를 가압하는 위치와, 카드 의 통과를 가능하게 하는 통과 가능 위치의 2 개의 상태로 이동시킨다. 제어 부 에는 바카라 게임의 룰이 미리 프로그램되어 기억되어 있다. 다음으로, 배포 제한 장치 의 변형예에 대해서, 도 16b 에 의해 설명한다. 변형예에 있어서의, 배포 제한 장치 는, 카드 가 카드 가이드부 와 카드 가이드 (가이드 커버) 의 사이의 슬롯 을 통과할 때에 로크 부재 가 슬롯 내에 돌출되어 카드 의 이동을 저지하는 구조를 구비하 고 있다. 로크 부재 는, 전자 솔레노이드나 압전 소자 등의 구동부 에 의해, 카드 의 이동을 저지하는 위치 (제한 위치) 와, 카드 의 통과를 가능하게 하는 통과 가능 위치의 2 개의 상태를 취할 수 있 도록 화살표 (m) 로 나타내는 바와 같이 이동한다. 구동부 는, 제어 장치 와 접속된 제어부 에 의해 제어되고, 로크 부재 를 카드 의 이동을 저지하는 위치와, 카드 의 통과를 가능하 게 하는 통과 가능 위치의 2 개의 상태로 이동시킨다. 다음으로, 카드 수용부 로부터 카드 가 수동으로 인출될 때에 카드 의 숫자 (수, 랭크) 를 나타 내는 코드 를 카드 로부터 판독하는 코드 판독부 의 상세한 내용에 대해서 설명한다. 도 15 는, 카드 배포 장치 의 주요부 평면도이다. 도면에 있어서, 코드 판독부 는 카드 수납부 의 전방의 개구 에서 1 매씩 수동으로 꺼내지는 카드 를 게임 테이블 상에 안내하는 카드 가이드 부 에 형성되어 있다. 카드 가이드부 는, 경사면이며, 양측의 가장자리부에는, 센서 커버를 겸 한 카드 가이드 가 장착되어 있다. 또, 2 개의 카드 가이드 의 각각은, 나사 등 (도시하지 않 음) 으로 장착 착탈 가능하게 되어 있다. 카드 가이드 를 떼어내면, 코드 판독부 의 센서군 이 노출된다. 센서군 은, 4 개의 센서로 이루어지고, 2 개의 자외선 반응 센서 (UV 센서) (20, 21) 와, 대상물 검출 센서 (22, 23) 로 구성된다. 대상물 검출 센서 (22, 23) 는, 카드 의 유무를 검지하는 광 파이버식의 센서이며 카드 의 움직임을 검 출할 수 있다. 대상물 검출 센서 는, 카드 가이드부 의, 카드 의 흐름 방향을 따른 상류측 에 위치하고, 다른 일방의 대상물 검출 센서 는 하류측에 위치하고 있다. 도면에 나타내는 바와 같이, 양 대상물 검출 센서 (22, 23) 는, UV 센서 (20, 21) 를 사이에 두고 상류측과 하류측에 형성되어 있다. UV 센서 (20, 21) 는, 자외선을 발하는 LED (자외 LED) 와 검지기를 구비하고 있다. 카드 에는, 자외선이 닿으면 발색하는 자외선 발광 잉크로, 코드 의 마크 (M) 가 인쇄되어 있고, 자외선 (블랙 라이트) 이 카드 에 조사되고, 카드 의 코드 의 마크 (M) 의 반사광이 검지기로 검지된다. UV 센서 (20, 21) 는, 케이블을 통하여 코드 판독부 와 제어부 에 접속되어 있다. 코드 판독부 에서는, UV 센서 (20, 21) 의 검지기의 출력 신호로부터, 마크 (M) 의 조합이 판정되고 각 코드 에 대응하는 수 (랭크) 가 판정된다. 코드 판독부 는, 대상물 검출 센서 (22, 23) 의 검출 신호에 기초하여, UV 센서 (20, 21) 의 판독의 개시 와 종료가 제어부 에 의해 제어된다. 또, 제어부 는, 카드 가 정상적으로 카드 가이드부 를 통과했는지 여부도, 대상물 검출 센서 (22, 23) 의 검출 신호에 기초하여 판정한다. 도 14 에 나 타내는 바와 같이, 카드의 랭크 (수) 및 슈트 (하트나 스페이드 등) 를 나타내는 사각형의 마크 (M) 가 카드 의 가장자리에 2 열, 4 행으로 배열되어 있다. UV 센서 (20, 21) 는, 마크 (M) 를 검지하면, 온 신호를 출력한다. 코드 판독부 에서는, 2 개의 UV 센서 (20, 21) 로부터 입력되는 양 신호의 상대 관계를 판 정한다. 이에 따라, 코드 판독부 는, 2 개의 UV 센서 (20, 21) 로 검지된 2 개의 마크 (M) 의 상대 적인 상이 등에 의해 코드를 특정하고, 대응하는 카드 의 수 (랭크) 와 종류 (슈트) 를 특정한다. 코드 와 2 개의 UV 센서 (20, 21) 의 온 신호의 출력의 관계를 도 17 에 나타낸다. UV 센서 (20, 21) 의 온 신호의 출력의 상대 변화의 비교 결과에 기초하여, 마크 (M) 의 소정의 조합을 특정할 수 있다. 결과 적으로, 상하 2 열의 마크 (M) 의 조합으로서 4 종, 이것을 4 열 인쇄하면, 4 종의 4 승으로 256 종의 코드가 구성 가능해진다. 트럼프 카드의 52 종의 카드를 256 종의 코드 중 어느 것인가에 각각 할당하여, 이것을 대조표로서 메모리 혹은 프로그램으로 기억해 두고, 코드 판독부 는, 각 코드 를 특정함으로써, 미 리 정한 대조표 (도시하지 않음) 로부터 카드 의 수 (랭크) 와 종류 (슈트) 가 특정되는 구성으로 하고 있 다. 또, 256 종의 코드는, 52 종의 카드에 자유로운 조합으로 대응시켜서 대조표에 의해 기억할 수 있으므 로, 조합을 복잡하게 할 수 있고, 시간이나 장소에 의해 256 종의 코드와 52 종의 카드의 조합을 바꿀 수 있다. 코드는, 자외광을 받음으로써 가시화되는 도료로 인쇄되고, 카드의 종류 표기나 인덱스 와 중첩되지 않는 위치에 인쇄되어 있는 것이 바람직하다. 이상, 본 발명의 각종 실시형태를 설명했지만, 상기 서술한 실시형태는, 본 발명의 범위 내에서 당업자에 의해 변형 가능한 것은 물론이며, 적용되는 게임에서의 필요에 따라, 본 실시형태의 장치가 적당하게 변형되어도 된 다. (제 3 실시형태) 제 3 실시형태의 관리 시스템은, 유기장에 있어서의 테이블 게임의 관리 시스템에 관한 것이다. 카지노 등의 유기장에서는, 다양한 딜러의 유기용 대용 화폐 (칩) 의 취급 미스를 방지하는 시도가 실시되고 있 다. 유기장은 딜러의 칩 취급 미스를 감시하기 위한 감시 카메라를 구비하고, 감시 카메라로부터 얻은 화상 으로부터 승패 결과와 상이한 유기용 대용 화폐의 회수나 상환에 의한 미스나 부정을 판정하는 등 하여 방지를 하고 있다. 한편, 배팅된 유기용 대용 화폐의 매수나 총액을 파악하기 위해서 각 유기용 대용 화폐에 IC 태그를 붙여 유기 용 대용 화폐의 액수를 파악하는 것이 제안되어 있다. 국제 출원 PCT/JP2015/000171 에 기재된 카드 게임 모니터링 시스템에서는, 유기 테이블 상에 놓여진 유기용 대 용 화폐가 승패 결과대로 회수 혹은 상환되었는지 여부를, 유기용 대용 화폐의 움직임을 화상 해석함으로써 판 정하고, 딜러의 칩 취급 미스의 모니터링이 실시된다. 카지노 등의 유기장에서는, 유기용 대용 화폐가 높게 쌓여 유기 테이블에 놓여지지만, 유기 테이블 아래에 형성 한 IC 태그의 판독 장치에서는, 총액을 정확하게 판독할 수 없다는 문제가 있고, 판독 장치의 감도를 높게 하면, 상이한 위치 (위치에 의해 승패가 좌우된다) 에 놓여진 유기용 대용 화폐가, 합산되어 버려 각 위치마다의 유기용 대용 화폐의 총액을 파악할 수 없다는 과제가 존재한다. 또 종래, 도 19 에 나타내는 바와 같이 유기용 대용 화폐 (칩) (T) 의 무늬는, 복잡한 것으로 되어 있어, 다수의 칩이 쌓여 있으면, 카메라에 의해 정 확하게 쌓여진 매수를 파악할 수 없다는 과제가 있다. 또, 유기 테이블에 있어서의 부정이 더욱 고도화되어, 그 유기 테이블에서 단순히 이긴 액수가 많다든가 하는 검출로는 발견할 수 없는 고도의 배팅 방법에 의한 부정 등은, 카메라로는 발견할 수 없다는 새로운 과제도 파 악되어 있다. 또, 딜러는 유기 테이블 상에 놓여진 유기용 대용 화폐가 승패 결과대로 회수 혹은 상환될 필요가 있다. 이 것을, 칩을 화상 해석함으로써 판정하고자 해도, 유기용 대용 화폐 (칩) 의 무늬가 복잡하기 때문에, 배팅된 칩 에 대응한 칩을 상환시에 딜러가 정확하게 상환했는지 여부는, 현존의 실용적인 화상 해석 기술로는 판정할 수 없으며, 미스의 방지가 충분하지 않다는 과제가 존재하였다. 상기 여러 가지 과제를 해결하기 위해서, 본 실시형태의 테이블 게임의 관리 시스템은, 유기 테이블에 있어서 각 게임의 승패 결과를 판정하여 표시하는 카드 배포 장치와, 상기 유기 테이블 상에 둔 유기용 대용 화폐의 종 류와 매수를 카메라를 사용하여 측정하는 측정 장치와, 각 게임에 있어서 상기 측정 장치의 측정 결과를 이용하 여, 게임 참가인이 상기 유기 테이블 상에 둔 유기용 대용 화폐의 위치와 종류와 매수를 특정하여 기억하는 관 리 제어 장치를 갖고, 상기 유기용 대용 화폐는, 복수의 색이 상이한 플라스틱의 층이 적층되고, 적어도 중간에 착색층을 구비하고, 상기 중간의 착색층의 양측에 백색층 혹은 연한색층을 적층한 다층 구조로 함으로써 측면에 적층 방향의 줄무늬를 형성하고, 상기 착색층에 의해 유기용 대용 화폐의 종류가 특정 가능한 구성을 갖고, 상 기 관리 제어 장치는, 상기 카드 배포 장치로부터 얻은 승패 결과 및 게임 참가인이 둔 유기용 대용 화폐의 위 치와 종류와 매수의 측정 결과를 이용하여, 각 게임에 있어서의 참가인의 승자 및 패자를 판정함과 함께 상기 유기 테이블에 있어서의 카지노측의 수지 계산을 각 게임마다 실시하는 계산 기능을 구비한다. 또한, 관리 시스템으로서, 관리 제어 장치는, 각 게임 참가인이 둔 유기용 대용 화폐의 착색층 또는 백색층 혹 은 연한색층의 수를 계측하여 유기용 대용 화폐의 매수를 판정하는 기능을 구비한 구조이다. 상기 여러 가지 과제를 해결하기 위해서, 본 실시형태의 유기용 대용 화폐는, 복수의 색이 상이한 플라스틱의 층이 적층되고, 적어도 중간에 착색층을 구비하고, 상기 착색층을 사이에 끼워 양측에 백색층 혹은 연한색층을 적층하여, 측면에 적층 방향의 줄무늬를 형성하고, 상기 착색층에 의해 유기용 대용 화폐의 종류가 특정 가능한 구성을 갖는다. 또한, 유기용 대용 화폐는, 백색층 혹은 연한색층의 표면에는 유기용 대용 화폐의 종류를 나타내는 인쇄가 실시 되고, 최외층에 투명층이 형성되고, 각 층간이 열 압착되어 적어도 5 층 구조를 이룬다. 또한, 유기용 대용 화폐는, 백색층 혹은 연한색층의 표면에 UV 잉크 또는 카본 블랙 잉크에 의한 마크가 형성되 어 있는 것, 혹은 최외층의 투명층에는 엠보스 가공이 실시되고, 혹은, 최외층의 투명층의 단 (端) 에는 R 가공 이 실시되고, 혹은 착색층이 복수의 층에 의해 형성되어 있고, 나아가서는 착색층에는 RFID 가 내장되어 있는 것이어도 된다. 상기 여러 가지 과제를 해결하기 위해서, 본 실시형태의 유기용 대용 화폐를 검사하는 검사 장치는, 유기용 대 용 화폐가 반경 방향으로 통과 가능한 입구와 출구를 갖는 통로와, 상기 통로를 통과하는 유기용 대용 화폐의 측면을 촬영하여 측면의 적층 방향의 줄무늬의 색을 판정하는 칩 종류의 판정 장치와, 통과하는 유기용 대용 화 폐의 표면에 형성한 UV 잉크 또는 카본 블랙 잉크에 의한 마크를 판독하는 마크 판독 장치와, 상기 통로에 대하 여 수직 방향으로부터 유기용 대용 화폐의 표면에 형성한 종류를 나타내는 인쇄를 판독하는 인쇄 검사 장치와, 장치 전체의 제어 장치를 구비하고, 상기 제어 장치는, 상기 칩 종류의 판정 장치가 판정한 칩 종류와, 상기 인 쇄 검사 장치로부터 얻은 종류를 나타내는 인쇄의 내용이 일치하는지 여부를 검사하는 구성이다. 본 실시형태의 시스템에 의하면, 유기용 대용 화폐 (칩) 가 다수 쌓아 올려져 있어도 화상 분석으로 칩의 매수 를 판정할 수 있어, 비교적 중첩된 유기용 대용 화폐도 총액을 위치와 색으로 파악할 수 있다. 이하, 도면을 참조하여, 본 발명의 실시형태의 유기 테이블을 갖는 유기장에 있어서의 테이블 게임의 관리 시스 템을 설명한다. 도 18 은 동 시스템의 전체의 개요를 나타내는 도면으로서, 복수의 유기 테이블 을 갖 는 유기장에 있어서의 테이블 게임의 관리 시스템은, 유기 테이블 에서 실시되는 게임의 진행 상태를 게임 참가인 및 딜러 를 포함하여 복수의 카메라 를 통하여 영상으로서 기록함과 함께 기록된 게임의 진 행 상태의 영상을 화상 분석하는 화상 분석 장치 를 구비한 측정 장치 , 또한 유기 테이블 에 있 어서 각 게임의 승패 결과를 판정하여 표시하는 카드 배포 장치 를 구비한다. 카드 배포 장치 는,이미 당업자에서 사용되어 알려져 있는, 이른바 전자 슈이며, 미리 게임의 룰이 프로그램 되어 있어, 배포되는 카드 (C) 의 정보 (랭크와 슈트) 를 판독하여, 게임의 승패를 판정할 수 있는 구조로 되어 있다. 예를 들어 바카라 게임에서는, 뱅커의 승, 플레이어의 승, 타이 (무승부) 가, 기본적으로 각 2-3 매의 카드의 랭크에 의해 결정되며, 판정 결과 (승패 결과) 는 표시 램프 에서 표시된다. 관리 제어 장치 는, 카드 배포 장치 로부터 얻은 카드 (C) 의 정보 (랭크와 슈트) 를 판독하여 각 게 임의 승패 결과를 판정함과 함께, 게임 참가인 이 둔 유기용 대용 화폐 (칩 ) 의 위치와 종류와 매수의 측정 결과를 이용하여, 각 게임에 있어서의 참가인 중의 승자 (6W) 및 패자 (6L) 를 판정한다. 또, 유기 테이블 에 있어서의 카지노측의 수지 계산 (패자 (6L) 가 배팅한 유기용 대용 화폐 (칩 ) 의 총액으로부터 참가인 중의 승자 (6W) 에게 상환한 유기용 대용 화폐 (칩 ) 의 총액을 공 제한 액수) 을 각 게임마다 실시하는 계산 기능을 더 구비한다. 본 검지 시스템에 있어서의 화상 분석 장치 , 측정 장치 및 관리 제어 장치 는, 일체 혹은 복수 의 구성으로 이루어지는 컴퓨터 및 프로그램, 메모리를 복합적으로 구비한 구조로 되어 있다. 다음으로, 본 검지 시스템에 사용하는 유기용 대용 화폐 (칩) 의 상세한 내용을 설명한다. 도 20 은, 본 검 지 시스템에 사용하는 유기용 대용 화폐 (칩 ) 의 정면 단면도이며, 복수의 색이 상이한 플라스틱의 층이 적층되고, 적어도 중간에 착색층 을 구비하고, 이 중간의 착색층 의 양측에 백색층 혹 은 연한색층 (도시하지 않지만 착색층 보다 색이 연한 층이면 된다) 을 적층한 다층 구조로 되어 있다. 이와 같이 착색층 을 구비하고, 이 중간의 착색층 의 양측에 백색층 혹은 연한색층 (도시 하지 않지만 착색층 보다 색이 연한 층이면 된다) 을 적층한 다층 구조로 함으로써 도 20 에 나타내는 바 와 같이 측면에 적층 방향의 줄무늬를 형성하고, 착색층 의 색을 바꿈 (적색, 녹색, 황색이나 청색 등) 으로써 유기용 대용 화폐 의 종류 (10 포인트, 20 포인트, 100 포인트, 1000 포인트 등) 를 특정할 수 있 도록 하고 있다. 또한, 도 22b 에 나타내는 바와 같이, 유기용 대용 화폐 는, 백색층 의 표면 (상면과 하면) 에는 유기용 대용 화폐 의 종류를 나타내는 인쇄 (100 포인트 등) 가 실시되어 있다. 도 20 에 나타 내는 바와 같이, 최외층에 투명층 이 형성되고, 각 층간이 열 압착되어 적어도 5 층 구조를 이루고 있다. 이들 유기용 대용 화폐 는, 가늘고 긴 장척상 (長尺狀) 의 플라스틱 재료를 사용하고, 장척의 상태로 각 층 (착색층 , 백색층 , 투명층 ) 의 사이가 열 압착되어 밀착된 상태 (5 층 구조 등) 를 형 성하며, 그 후에 프레스 등에 의해 원형 혹은 장방형 등으로 타발하여 형성된다. 프레스에 의해 타발할 때 에 타발을 위한 금형의 다이와 펀치의 치수를 설계하여 최외층의 투명층 의 단에 R 가공 (둥근 모서리) 이 실시된다. 또한, 유기용 대용 화폐 에는, 백색층 의 표면에 UV 잉크 또는 카본 블랙 잉크에 의한 마크 (M) 가 형성되어 있다 (도 21 참조). 이 마크 (M) 는 유기용 대용 화폐 의 진위를 나타내는 것이며, 자외선 (혹은 적외선) 을 쪼이면 마크가 눈에 보이게 되어, 그 형태나 수의 조합으로 진정한 것을 나타낸다. 인쇄 나 마크 (M) 를 덮도록 최외층에는 투명층 이 열 압착 혹은 코팅 (도포) 되어 있지만, 이 투명층 에는 엠보스 가공이 실시되어, 유기용 대용 화폐 가 서로 밀착되는 것을 막고 있다. 인쇄 (100 포인트 등) 가 실시된 최외층의 투명층 의 단은 R 가공 (R) 이 실시되고, 유기용 대용 화폐 의 타발 공정에 있어서, 백색층 의 표면이 변형하여 측면에 나타나는 것을 방지하고 있다. 또, 유기용 대용 화폐 는 예리한 단이 남아 손이나 다른 칩 을 손상하는 것을 막고 있다. 착색층 은, 도 20 에 나타내는 바와 같이, 착색된 복수의 층 (도 20 에서는 3 층) 에 의해 형성되어도 된 다. 착색된 복수의 층 (도 20 에서는 3 층) 은 서로 열 압착되어 있으므로, 도 20 과 같이 3 층 구조가 육 안으로 보는 것이 가능한 상태가 아니며, 도 20 은 설명상 3 층을 나타내고 있다. 나아가서는 착색층 의 3 층 중 한가운데 층에는 일부 도려내진 부분 (B) 이 형성되고, 그 안에는 RFID 가 내장되어 있다. 도 24 는, 유기용 대용 화폐의 종류가 상이한 것을 쌓아 올린 상태의 사시 설명 사진도이다. 관리 제어 장 치 는, 유기 테이블 상에 게임의 참가인 이 둔 유기용 대용 화폐 를 카메라 로 촬상하 고, 놓여진 에어리어 별로 (뱅커에 배팅했는지, 플레이어에 배팅했는지, 혹은 페어 (PAIR) 에 배팅했는지, 타이 (TIE) 에 배팅했는지) 를 화상 분석 장치 를 구비한 측정 장치 에 의해 측정함과 함께, 각 에어 리어에 있어서 적층된 유기용 대용 화폐 (칩 ) 의 착색층 (혹은 연한색층) 또는 백색층 의 수와 색을 측정 장치 (화상 분석 장치 에 의해 얻어진 정보를 사용함) 가 분석 계측하여 유기용대용 화폐 의 종류와 매수를 판정한다. 관리 제어 장치 는, 인공 지능 활용형 혹은 딥 러닝 구조를 갖는 제어 장치여도 된다. 관리 제어 장치 는, 카메라 , 화상 분석 장치 를 통하여 각 참가인 이 배팅하는 유기용 대용 화폐 의 위치 (플레이어나, 뱅커나, 페어에 배팅한 위치), 종류 (유기용 대용 화폐 는 색마다 상이한 액수의 값이 할당되어 있다) 및 매수를 파악하는 것이 가능하다. 인공 지능 활용형의 컴퓨터 혹은 제어 시스템, 딥 러닝 (구조) 기술에 있어서는, 자기 학습 기능 등을 이용하여, 유기용 대용 화폐 의 위치 (플레이어 나, 뱅커나, 페어에 배팅한 위치), 종류 (유기용 대용 화폐는 색마다 상이한 액수의 값이 할당되어 있다) 및 매 수를 파악하는 것이 가능하기 때문에, 각 게임에 있어서 카드 배포 장치 가 판정하는 게임의 승패 결과에 따라서, 각 게임의 진 참가인 (6L) 이 배팅한 유기용 대용 화폐 의 회수 (화살표 (L) 로 나타낸다) 및 이 긴 게임 참가인 (6W) 에 대한 이긴 유기용 대용 화폐 에 대한 상환 (지불 (9W)) 이 게임의 승패 결과에 따라서 적정하게 실시되었는지 여부를, 관리 제어 장치 는, 화상 분석 장치 를 통하여 게임의 진행 상태의 영상을 분석함으로써 판정한다. 이와 같은 경우, 도 21 에 나타내는 바와 같이 (도 19 에 나타내는 종래 칩에 비해) 적층한 다층 구조가 되어 있고, 측면에 적층 방향의 줄무늬가 선명하게 형성되어 있으므로, 화상 분석 장치 를 포함하는 측정 장치 는 용이하게 칩의 종류 및 매수의 측정을 정확하게 실시하는 것이 가능해진다. 또한, 인공 지능 활용 형의 컴퓨터 혹은 제어 시스템, 딥 러닝 (구조) 기술을 이용하면, 화상의 분석, 판정이 보다 정확하게 가능해진 다. 인공 지능 활용형의 컴퓨터 혹은 제어 시스템, 딥 러닝 (구조) 기술은 당업자에서 이미 알려져 있어 이 용 가능하기 때문에, 상세한 설명을 생략한다. 관리 제어 장치 는, 유기 테이블 의 딜러 의 유기용 대용 화폐 트레이 에 있어서의 유기용 대용 화폐 의 총액이 화상 분석 장치 를 사용하여 분석 파악 가능하고, 게임이 종료하여 청산한 후 에, 각 게임 참가인 이 배팅한 진 유기용 대용 화폐 의 회수 및 이긴 게임 참가인 (6W) 에 대한 이긴 유기용 대용 화폐에 대한 지불 (9W) 의 액수에 따라, 유기용 대용 화폐 트레이 내의 유기용 대용 화폐 총액이 증감했는지 여부를, 게임의 승패 결과에 따라서 비교 계산 가능하다. 유기용 대용 화폐 트레 이 에 있어서의 유기용 대용 화폐 의 총액은, RFID 등의 수단으로 항상 파악되고 있어도, 그 증감액 이 바른지 여부는, 관리 제어 장치 가, 화상 분석 장치 를 통하여 게임의 진행 상태의 영상을 분석함 으로써 판정한다. 이들도 인공 지능 활용형 혹은 딥 러닝 구조가 활용되어도 된다. 관리 제어 장치 는, 유기 테이블 의 각 플레이 위치 에 있어서 배팅한 유기용 대용 화폐의 위치 (플레이어나, 뱅커나, 페어에 배팅한 위치) 와 액수 (종류와 매수) 를 파악하고, 각 게임의 승패 결과에 의해 얻어지는 각 게임 참가인 의 승패 이력과 얻은 유기용 대용 화폐의 액수 (이긴 액수) 를, 과거의 다수 (빅 데이터) 의 게임의 통계 데이터와 비교하여 특이한 상황 (카지노에 의해 설정된다) 으로서 추출 가능한 인공 지 능 활용형 혹은 딥 러닝 구조여도 된다. 전형적으로는 어느 액수 (100 만 달러) 이상의 승리액의 발생이나, 어느 유기 테이블 의 플레이 위치 에 있어서, 졌을 때의 배팅 유기용 대용 화폐의 액수가 적고, 이겼을 때의 배팅한 유기용 대용 화폐의 액수가 많은 상태가 수 게임 계속되고, 그것이 과거의 게임의 통계 데이터 (빅 데이터 등) 와 비교하여 특이한 상황으로서 이것을 추출 가능한 인공 지능 활용형 혹은 딥 러닝 구조의 관리 제 어 장치 를 구비하는 것이다. 관리 제어 장치 는, 유기 테이블 의 딜러 의 유기용 대용 화폐 트레이 에 있어서의 유기용 대용 화폐 의 총액이, 각 게임 후에 각 참가인 이 배팅한 유기용 대용 화폐 와의 청산이 실시 되어 청산한 후에, 청산에 대응한 유기용 대용 화폐의 증감이 바른지 여부를, 비교 계산 가능한 구조로 되어 있 다. 도 18 에 나타내는 딜러 의 유기용 대용 화폐 의 유지용 칩 트레이 에 있어서는, 가로 방향으로 적층된 유기용 대용 화폐 (칩 ) 의 착색층 또는 백색층 의 수와 색을 측정 장치 (화상 분석 장치 에 의해 얻어진 정보를 사용함) 가 분석 계측함으로써, 유기용 대용 화폐 의 종류와 매수가 판정 가능하다. 유지용 칩 트레이 의 유기용 대용 화폐 의 총액은, 이와 같이 하 여 항상 (혹은 소정의 시간 간격으로) 파악되고 있다. 관리 제어 장치 는, 각 게임의 청산액 (유기 테 이블 에 있어서의 카지노측의 수지 계산 (패자 (6L) 가 배팅한 유기용 대용 화폐 (칩 ) 의 총액으 로부터 참가인 중의 승자 (6W) 에게 상환한 유기용 대용 화폐 (칩 ) 의 총액을 공제한 액수)) 을 각 게임마다 실시하는 계산 기능을 구비 <단락 0018 참조> 하므로, 칩 트레이 의 유기용 대용 화폐 의 총액은 항상 (혹은 소정의 시간 간격으로) 검증된다. 즉, 유기용 대용 화폐의 증감이, 화상 분석 장치 에 의한 화상 분석 결과와 딜러 에 의한 각 게임의 청산액과 일치하는지 여부가 검증된다.다음으로, 도 23 을 참조하여, 본원 발명의 실시형태인 유기용 대용 화폐 를 검사하는 검사 장치 에 대해 설명한다. 검사 장치 에는, 유기용 대용 화폐 가 반경 방향 (화살표 (Y) 방향) 으로 통과 가능한 입구 와 출구 를 갖는 통로 를 구비하고 있다. 통로 는 경사져 있고, 유기용 대용 화폐 는 화살표 (Y) 방향으로 통과한다. 통로 에는, 유기용 대용 화폐 의 측면을 촬영하여 측면의 적층 방향의 줄무늬의 색을 판정하는 칩 종류의 판정 장치 와, 통과하는 유기용 대용 화폐 의 표면에 형성한 UV 잉크 또는 카본 블랙 잉크에 의한 마크 (M) 를 판독하는 마크 판독 장치 와, 통로 에 대하여 수직 방향으로부터 유기용 대용 화폐의 표면에 형성한 종류를 나타내는 인쇄 를 판독하는 인쇄 검사 장치 와, 장치 전체의 제어 장치 를 구비하고, 제어 장치 는, 칩 종류의 판정 장치 가 판정한 칩 종류와, 인쇄 검사 장치 로부터 얻은 종류를 나타내는 인쇄의 내용이 일치하는지 여부를 검사하는 구성이다. 이 검사 장치 에 의해, 제조된 유기용 대용 화폐 의 인쇄 가, 유기용 대용 화폐 의 줄 무늬의 색에 의한 칩 종류와 일치하여 바르게 인쇄되고 있는지 여부가 검사 가능해진다. (제 4 실시형태) 본 실시형태의 시스템은, 카지노나 다른 유기용 대용 화폐를 사용하는 게임 시설에 있어서, 유기용 대용 화폐의 가짜가 유기장에서 사용되는 것을 방지하는 유기용 대용 화폐의 관리 시스템에 관한 것이다. 카지노나 게임 시설에 있어서 실시되는 많은 라이브 테이블 게임 중에는 바카라나 블랙 잭이 있다. 이들 게 임은 52 매의 플레잉 카드로 이루어지는 표준적인 덱을 사용하고, 미리 셔플되어 있는 복수의 덱 (6 내지 9 혹 은 10 덱) 을 구비하는 슈터로부터 게임 테이블 상에 플레잉 카드가 배포되고 게임이 실시된다. 카지노나 게임 시설에 있어서는, 이러한 게임에 사용하기 위해서 유기용 대용 화폐가 사용된다. 유기용 대용 화폐의 가짜의 사용은 카지노에서 일어나서는 안 된다. 카지노에 있어서의 유기용 대용 화폐의 가짜의 사용을 방지하기 위해서, 카지노에서는 유기용 대용 화폐에 RFID 를 부착하여 가짜의 사용을 방지하는 기술이 존재하고 있다. RFID 가 부착된 유기용 대용 화폐는 공지이며, 국제 출원공개 제WO2008/120749호에 개시되어 있다. 본 실시형태는, 카지노나 게임 시설에 있어서 사용되는 유기용 대용 화폐의 가짜의 사용을 방지하는 관리 시스 템 혹은 유기용 대용 화폐를 제공하는 것이며, 카지노나 게임 시설에 있어서의 유기용 대용 화폐의 가짜의 사용 이나 부정한 교환을 방지할 수 있는 것이다. 최근, 유기용 대용 화폐의 가짜의 제조 기술이 진화하여, 진위 판정 마크나 RFID 를 거의 완벽하게 카피할 수 있기까지 기술이 진보하였다. 이 결과, 가짜의 유기용 대용 화폐에 진정한 진위 판정 마크나 RFID 와 동일한 것이 부착되어, 가짜와 진짜의 유기용 대용 화폐의 구별을 할 수 없어, 진위 판정이 거의 불가능하게 되어 있다는 과제가 존재한다. 상기의 종래의 문제를 해결하기 위해서, 본 실시형태의 유기용 대용 화폐의 관리 시스템은, 개별적으로 식별 가 능한 유니크한 ID 가 부착된 유기용 대용 화폐와, 상기 유기용 대용 화폐에 부착된 유니크한 ID 를 판독하는 ID 판독 장치와, 유기장의 캐셔에 있어서, 상기 유기용 대용 화폐를 유지하는 보관고와, 유기 테이블에 있어서, 상 기 유기용 대용 화폐를 유지하는 유기 테이블 칩 트레이와, 상기 유기 테이블 칩 트레이 및 상기 보관고에 유지 되어 있는 상기 유기용 대용 화폐의 종류와 매수를, 상기 ID 판독 장치를 사용하여 각각 특정하는 칩 판정 장치 와, 유기장에 있어서, 상기 유기용 대용 화폐에 부착된 상기 ID 를 데이터베이스 상에서 관리하는 관리 제어 장 치를 갖고, 상기 관리 제어 장치는, 사용을 상정하는 유기용 대용 화폐의 상기 ID 를 상기 데이터베이스에 미리 등록해 두고, 상기 데이터베이스를 이용하여, 적어도, 상기 유기 테이블 칩 트레이 및 상기 보관고 상에 존재하 는 유기용 대용 화폐의 상기 ID 를 그 소재 정보와 함께 상기 데이터베이스 상에서 관리하고, 상기 유기 테이블 칩 트레이 및 상기 보관고에 있어서의 유기용 대용 화폐를 소정의 타이밍으로 특정함과 함께 상기 데이터베이스 를 검색하여, 이하의 사상 (事象) 을 데이터베이스의 검색에 의해 판정하고, 1) 데이터베이스에 존재하지 않았 던 ID 가 새롭게 존재하는 것, 2) 2 개 이상의 동일한 ID 가 존재하는 것, 상기 1) 혹은 2) 의 상황이 있으면 에러 시그널을 생성하는 기능을 구비한 것이다. 또한 게다가, 관리 제어 장치는 또한, 적어도 상기 유기 테이블 칩 트레이 및 상기 보관고에 있어서 상기 유기 용 대용 화폐의 존재에 변화가 있을 때에, 변화가 있었던 시각 혹은 장소를 상기 ID 와 관련지어 상기 데이터베 이스 상에 기록하고, 상기 데이터베이스를 검색하여, 2 개 이상의 동일한 ID 가 존재하는 상황이 있으면, 당해 ID 와, 당해 ID 에 관련지어 상기 데이터베이스 상에 기록되어 있는 시각 혹은 장소의 정보를 상기 데이터베이 스로부터 추출하여 보존하고, 먼저 검출된 당해 ID 가 부착된 상기 유기용 대용 화폐가 상기 유기 테이블 칩 트레이 혹은 상기 보관고에 출입한 시각, 혹은, 상기 유기용 대용 화폐가 유지되어 있던 상기 유기 테이블 칩 트 레이 혹은 상기 보관고의 장소를 특정 가능한 기능을 구비한 것이다. 또한 상기 유기용 대용 화폐의 관리 시스템에 있어서는, 상기 유기 테이블의 배트 에어리어 상에 배팅되어 있는 상기 유기용 대용 화폐의 종류와 매수를 상기 ID 판독 장치를 사용하여 특정하는 배트 에어리어의 칩 판정 장치 를 구비하고, 상기 유기 테이블의 배트 에어리어 상에 존재하는 유기용 대용 화폐의 상기 ID 에 대해서도, 이하 의 사상을 데이터베이스의 검색에 의해 판정하여, 1) 데이터베이스에 존재하지 않았던 ID 가 새롭게 존재하는 것, 2) 2 개 이상의 동일한 ID 가 존재하는 것, 상기 1) 혹은 2) 의 상황이 있으면 에러 시그널을 생성하는 기 능을 구비한 것이어도 된다. 나아가서는, 유니크한 ID 는, 상기 유기용 대용 화폐의 측면 중 적어도 3 개지점에 부착되어 있다. 유니크 한 ID 가 가시광으로 보이는 잉크에 의해 잉크젯 인쇄로 부착되어 있다. 특히, 상기 유니크한 ID 가 복수 행 복수 열의 마크의 유무로 부착되어 있는 구성이 유리하다. 나아가서는, 유기용 대용 화폐의 상하면에는 투명 코팅층 또는 니스가 형성되어 있다. 상기의 종래의 문제를 해결하기 위해서, 본 실시형태의 유기용 대용 화폐는, 복수의 색이 상이한 플라스틱의 층 이 적층되고, 적어도 한 층에 착색층을 구비하고, 상기 착색층으로부터 외측으로 백색층 혹은 연한색층을 적층 한 다층 구조로 함으로써 측면에 적층 방향의 줄무늬를 형성하고, 상기 착색층에 의해 유기용 대용 화폐의 종류 가 특정 가능한 구성을 갖는다. 또, 측면 백색층 혹은 연한색층의 측면 중 적어도 3 개 지점에 유니크한 ID 가 부착되고, ID 판독 장치로 ID 를 판독함으로써, 유기용 대용 화폐의 종류와 제조 정보를 특정 가능하고, ID 를 데이터베이스 상에서 관리 가능한 구성을 갖는다. 그리고, 상기 유니크한 ID 가 가시광으로 보이는 잉크 에 의해 잉크젯 인쇄로 부착되어 있어도 된다. 상기 유니크한 ID 가 가시광으로 보이지 않는 잉크에 의해 잉크젯 인쇄로 부착되어 있어도 된다. 상기의 종래의 문제를 해결하기 위해서, 본 실시형태의 유기용 대용 화폐는, 개별적으로 식별 가능한 유니크한 ID 가 부착되고, 상기 유기용 대용 화폐에 부착된 유니크한 ID 는, ID 판독 장치에 의해 판독되고, 상기 ID 판 독 장치는, 유기장의 캐셔가 유지하는 보관고와, 유기 테이블의 유기 테이블 칩 트레이에 유지된 상기 유기용 대용 화폐를 판독하는 것이 가능하고, 또한, 상기 유기 테이블 칩 트레이 및 상기 보관고에 유지되어 있는 상기 유기용 대용 화폐의 종류와 매수가, 상기 ID 판독 장치를 통하여 칩 판정 장치에 의해 특정되고, 상기 유기 테 이블 칩 트레이 및 상기 보관고 상에 존재하는 유기용 대용 화폐의 상기 ID 가 그 소재 정보와 함께 데이터베이 스 상에서 관리되고, 적어도, 1) 데이터베이스에 존재하지 않았던 ID 가 새롭게 존재하는 것, 2) 2 개 이상의 동일한 ID 가 존재하는 것이 검사되어, 상기 1) 혹은 2) 의 상황의 발생을 판정 가능한 상기 ID 를 구비한 것이다. 이하, 도면을 참조하여, 본 발명의 실시형태의 유기 테이블을 갖는 유기장에 있어서의 유기용 대용 화폐의 관리 시스템을 설명한다. 도 25 는 동 시스템의 전체의 개요를 나타내는 도면으로서, 복수의 유기 테이블 (도 25 에서는, 1 대만 나타낸다) 을 갖는 유기장에 있어서의 유기용 대용 화폐의 관리 시스템은, 유기 테이블 에서 실시되는 게임의 진행 상태를 게임 참가인 및 딜러 를 포함하여, 복수의 카메라 를 통하 여 촬상하고 기억하여 관리한다. 특히, 본 유기용 대용 화폐의 관리 시스템은, 유기 테이블 에 있어서 게임에 사용되는 유기용 대용 화폐 의 종류와 매수를, 카메라 로 얻어지는 화상 정보를 분석하여 특정 한다. 유기용 대용 화폐 에는, 유니크한 ID 가 부착되어 있고, 유기용 대용 화폐 의 종류와 매수는, 상기 ID 를 판정하고 판독함으로써 얻어진다. 카메라 로부터 얻은 화상 정보를 분석하여 상기 ID 를 특정하는 것이, 카메라 에 접속된 관리 제어 장치 의 내부에 있는 ID 판독 장치 이다. 특히 관리 제어 장치 는, 카메라 를 통하여 촬상한 화상 데이터를 분석하고 상기 ID 의 판독 결과로부터, 가로로 늘어서거나, 혹은 겹쳐 쌓인 상태의 유기용 대용 화폐 의 종류와 매수를 특정하는 칩 판정 장치 를 내부에 갖는다. 유기용 대용 화폐 는, 유기장의 캐셔 에 있어서, 게임 참가인 이 지불하는 현금 으로 교환되 는, 캐셔 에 있어서는, 유기용 대용 화폐 는 이것을 유지하는 보관고 에서 보관되어 있다. 유기장의 캐셔 에 있어서는, 또 게임 참가인 이 지참하는 유기용 대용 화폐 를, 현금 으로 환불한다. 유기 테이블 에 있어서는, 유기용 대용 화폐 가 유기 테이블 칩 트레이 에 의해 유 지되어 있고, 딜러 는, 각 게임에 있어서 진 게임 참가인 이 배팅한 유기용 대용 화폐 를 테이블 상으로부터 회수하여, 유기 테이블 칩 트레이 로 되돌린 후, 각 게임에 이긴 게임 참가인 에 대하 여 유기용 대용 화폐 를 상환한다. 이와 같은 게임 참가인 과 유기장의 캐셔 , 혹은 딜러 와의 교환은 모두 카메라 로 촬상되어 기록된다. 보관고 나 유기 테이블 칩 트레이 에 있어 서는, 게임 참가인 과의 유기용 대용 화폐 의 교환이 있을 때마다 보관고 나 유기 테이블 칩 트레 이 에서 보관되어 있는 유기용 대용 화폐 가 증감한다. 유기 테이블 칩 트레이 및 보관고 에 유지되어 있는 유기용 대용 화폐 의 종류와 매수는, 카메라 를 통하여 ID 판독 장치 와 칩 판정 장치 에 의해 소정의 타이밍으로, 혹은 상시 감시되고 있다. 관리 제어 장치 는, 유기장 에서 사용이 상정되는 모든 유기용 대용 화폐 의 ID 를 데이터베이스 상에 미리 유지하고 있다 (유기장에서는, 사용이 상정되는 모든 유기용 대용 화폐 의 ID 를 등록해 둔다). 이와 같이 하여, 유기용 대용 화폐 에 부착된 ID 를 데이터베이스 상에서 관리하는 관리 제어 장치 는, 데이터베이스 를 이용하여, 유기장에 있어서, 적어도, 유기 테이블 칩 트레이 및 보관고 상에 존재하는 유기용 대용 화폐 의 모든 ID 를 그 소재 정보 (보관고 나 유기 테이블 칩 트레이 , 혹은 백야드 (도시하지 않음) 로부터의 이동 중, 혹은 게임 참가인 이 유지하고 있는 등.) 와 함께 데이터베이스 상에서 관리한다. 관리 제어 장치 는, 유기 테이블 칩 트레이 및 보관고 에 있어서의 모든 유기용 대용 화폐 를 소정의 타이밍 혹은 상시, ID 에 의해 특정함과 함께, 데이터베이스 를 검색하여, 이하의 사상을 데이터베이스 의 검색에 의해 판정한다. 1) 데이터베이스 에 존재하지 않았던 (또는 존재하지 않는) ID 가 새롭게 존재하는 것이 판정된다, 2) 2 개 이상의 동일한 ID 가 존재하는 것이 판정된다. 상기 1) 혹은 2) 의 상황이 있으면, 이상을 나타내는 에러 시그널을 생성하여, 유기장의 관리 부문이나 시큐리 티 부문 에 알리는 기능을 구비하고 있다. 관리 제어 장치 는, 유기 테이블 칩 트레이 및 보관고 에 있어서의 모든 유기용 대용 화폐 를 소정의 타이밍 혹은 상시, ID 에 의해 특정하고, 데이터베이스 에 기억하고 있으므로, 1) 데이터베이스 에 존재하지 않았던 (또는 존재하지 않는) ID 가 새롭게 존재하는 것을 판정할 수 있고, 2) 2 개 이상의 동일한 ID 가 존재하는 것도 판정할 수 있다. 관리 제어 장치 는 또한, 적어도 유기 테이블 칩 트레이 및 보관고 에 있어서 유기용 대용 화폐 의 존재에 변화가 있을 때에, 변화가 있었던 시각 혹은 장소 (보관고 나 유기 테이블 칩 트레이 등) 를 ID 와 관련지어 데이터베이스 상에 기록하고, 데이터베이스 를 검색한 결과, 2 개 이상 의 동일한 ID 가 존재하는 상황이 있으면, 당해 ID 와, 당해 ID 에 관련지어 데이터베이스 상에 기록되어 있는 시각 혹은 장소의 정보를 데이터베이스 로부터 추출하여 보존하고, 먼저 검출된 (이미 먼저 사용되거나, 혹은 환금된) 당해 ID 가 부착된 유기용 대용 화폐 가 유기 테이블 칩 트레 이 혹은 보관고 에 출입한 시각, 혹은, 유기용 대용 화폐 가 유지되어 있던 유기 테이블 칩 트레 이 혹은 보관고 의 장소가 데이터베이스 에 의해 특정 가능해진다. 시각과 장소를 특정할 수 있으면, 카메라 의 기록 영상으로부터, 부정한 유기용 대용 화폐 의 사용의 의심이 있는 인물 등의 특정이 가능해진다. 본 유기용 대용 화폐의 관리 시스템에 있어서, 관리 제어 장치 는 유기 테이블 의 배트 에어리어 상에 배팅되어 있는 유기용 대용 화폐 의 종류와 매수를 ID 판독 장치 를 사용하여 특정할 수 있다. 배트 에어리어 의 유기용 대용 화폐 는, 배트 에어리어 를 특히 촬상하는 카메라 (2b) 를 구 비하고, 유기 테이블 의 배트 에어리어 상에 존재하는 유기용 대용 화폐 의 ID 에 대해서도, 이하의 사상을 데이터베이스 의 검색에 의해 판정한다. 1) 데이터베이스 에 존재하지 않았던 ID 가 배트 에어리어 에 새롭게 존재하는 것, 2) 2 개 이상의 동일한 ID 가 존재하는 것. 상기 1) 혹은 2) 의 상황이 있으면 에러 시그널을 생성하는 기능을 구비한다. 본 시스템에 있어서의 관리 제어 장치 , 내부에 있는 ID 판독 장치 , 유기용 대용 화폐 의 종류와 매수를 특정하는 칩 판정 장치 는, 일체 혹은 복수의 구성으로 이루어지는 컴퓨터 및 프로그램, 메모리를 복합적으로 구비한 구조로 되어 있다. 다음으로, 본 시스템에 사용하는 유기용 대용 화폐 (이른바 칩) 의 상세한 내용을 설명한다. 도 26 은, 본 시스템에 사용하는 유기용 대용 화폐 (칩) 의 정면도이며, 유기용 대용 화폐 는 복수의 색이 상이한 플라스틱의 층이 적층되고, 열 압착 등의 수단으로 일체가 된 후, 원형이나 사변형으로 타발되어 형성된다. 적어도 중간에 착색층 을 구비하고, 이 중간의 착색층 의 양측 (도 26 에서는 상하) 에 백색층 혹은 연한색층 (도시하지 않지만 착색층 보다 색이 연한 층이면 된다) 을 적층한 다층 구조로 되어 있다. 이와 같이 착색층 을 구비하고, 이 중간의 착색층 의 양측에 백색층 혹은 연한색 층 (도시하지 않지만 착색층 보다 색이 연한 층이면 된다) 을 적층한 다층 구조로 함으로써 도 27 에 나 타내는 바와 같이 측면에서 보면 (적층 방향의) 줄무늬를 형성하고, 착색층 의 색을 바꿈 (적색, 녹색, 황색이나 청색 등) 으로써 유기용 대용 화폐 의 종류 (10 포인트, 20 포인트, 100 포인트, 1000 포인트 등) 를 특정할 수 있도록 하고 있다. 또한, 도 26 에 나타내는 바와 같이, 유기용 대용 화폐 에는, 백색층 의 측면에 유기용 대용 화폐 의 종류를 나타내는 ID 가 실시되어 있다. 최외층에는 투명층 이 형성되고, 각 층간이 열 압착되어 적어도 5 층 구조를 이루고 있다. 이들 유기용 대용 화폐 는, 가늘고 긴 장척상의 플라스틱 재료를 사용하고, 장척의 상태로 각 층 (적어도 착색층 , 백색층 ) 의 사이가 열 압착되어 밀착된 상 태 (5 층 구조 등) 를 형성하고, 그 후에 프레스 등에 의해 원형 혹은 장방형 등으로 타발하여 형성된다. 프레스에 의해 타발할 때에 타발을 위한 금형의 다이와 펀치의 치수를 설계하여 최외층의 투명층 의 단에 R 가공 (둥근 모서리) 이 실시된다. 투명층 은 니스의 도장층이어도 된다. 유니크한 ID 는, 유기용 대용 화폐 의 측면 중 적어도 3 개 지점에 부착되어 있다. 유니크한 ID 가 가시광으 로 보이는 잉크에 의해 잉크젯 인쇄로 부착되어 있다. 특히 본 실시형태에서는, 유니크한 ID 가 복수 행 복수 열의 마크 (C) 의 유무로 구성되어 부착되어 있다. 복수 행 복수 열의 마크 (C) 는, 도 26 에서 나타내는 바와 같이, 상하의 마크 (C) 가 페어가 되어 코드를 구성하고, 도 26 에서는 10 자릿수의 코드로 하고 있다. 상하의 마크 (C) 가 페어가 되어 코드 (4 종) 를 구성하는 구성을 도 28 에 나타낸다. 마크 (C) 의 옆의 Y 자는, 마크의 상측과 하측을 식별하기 위 한 식별 마크이다. 마크 (C) 로 구성되는 코드는, 마크 (C) 의 소정의 조합을 특정할 수 있도록 구성하고 있다. 결과적으로는, 도 28 에 나타내는 실시예에서, 상하 2 열의 마크 (C) 의 조합으로서 4 종, 이것을 10 열 인쇄하면, 4 종의 10 승의 코드가 구성 가능해진다. 10 자릿수의 코드는, 4 종 있으므로 4 의 10 승의 종류의 코드가 얻어지므로, 유기용 대용 화폐 의 유니크한 ID 를 충분히 부여할 수 있다. 본 유기용 대용 화폐 는, 복수의 색이 상이한 플라스틱의 층이 적층되고, 적어도 한 층에 착색층 을 구비하고, 착색층 으로부터 외측으로 백색층 혹은 연한색층을 적층한 다층 구조로 함으로써 측면에 적층 방향의 줄무늬를 형성하고, 착색층 에 의해 유기용 대용 화폐 의 종류가 특정 가능한 구성을 갖 는다. 백색층 혹은 연한색층의 측면 중 적어도 3 개 지점 (바람직하게는 6 개 지점) 에서, 본 실시예 에서는 6 개가 회전 방향으로 60 도의 소정의 간격을 두고 형성되어 있다. 본 유기용 대용 화폐 는, 개 별적으로 식별 가능한 (1 개마다 상이한) 유니크한 ID 가 부착되고, 측방으로부터 반드시 ID 가 보 이도록 회전 방향으로 60 도의 소정의 간격을 두고 형성되어 있다. 유기용 대용 화폐 에 부착된 유니크 한 ID 는, 전술한 ID 판독 장치 에 의해 판독된다. 이 ID 판독 장치 로 ID 를 판독 함으로써, 유기용 대용 화폐 의 종류와 제조 정보 등을 특정 가능하고, ID 를 데이터베이스 상 에서 관리 가능한 구성으로 되어 있다. 본 실시형태에서는, 유니크한 ID 가 가시광으로 보이는 잉크에 의해 잉크젯 인쇄로 부착되어 있다. 가시광으로 보이지 않는 잉크 (UV 잉크나 카본 블랙 잉크나 적외 반응 잉크) 에 의해 잉크젯 인쇄로 부착되어 유니크한 ID 가 부착되어 있어도 된다. 유기용 대용 화폐 에 부착된 유니크한 ID 는, 전술한 ID 판독 장치 에 의해 판독되고, ID 판독 장치 는, 유기장의 캐셔가 유지하는 보관고 와, 유기 테이블의 유기 테이블 칩 트레이 에 유지 된 유기용 대용 화폐 를 판독하는 것이 가능하며, 실제로는 도 27a 에 나타내는 바와 같이 수평 (가로) 으 로 적층되어 있어도, ID 가 판독 가능하게 되어 있다. 또한, 유기용 대용 화폐 에는, 백색층 의 표면 (X) 에 UV 잉크 또는 카본 블랙 잉크에 의한 마크 (M) 가 형성되어 있다. 이 마크 (M) 는 유기용 대용 화폐 의 진위를 나타내는 것이며, 자외선 (혹은 적외선) 을 쪼이면 마크 (M) 가 눈에 보이게 되어, 그 형태나 수의 조합으로 진정한 것을 나타낸다. 표면의 유기장 특정용 인쇄 (100 포인트 등) 나 마크 (M) 를 덮도록 최외층에는 투명층 이 열 압착 혹은 코팅 (도포) 되어 있지만, 이 투명층 에는 엠보스 가공이나 니스 가공이 실시되어, 유기용 대용 화폐 가 서로 밀착되는 것을 막거나, 미끄러짐을 좋게 하고 있다. 인쇄 (100 포인트 등) 가 실시된 최외층의 투명층 의 단은 R 가공 (R) 이 실시되어, 유기용 대용 화폐 의 타발 공정에 있어서, 백색층 의 표면이 변형되어 측면에 나타나는 것을 방지하고 있다. 또, 유기용 대용 화폐 의 예리한 단이 남아 손이나 다른 칩 을 손상하는 것을 막고 있다. 착색층 은, 착색된 1 층 혹은 복수의 층에 의해 형성되어도 된다. 나아가서는 착색층 의 층 중의 층에 중량을 늘리기 위한 금속이나 세라믹이 내장되어도 된다. 또, 착색층 의 일부에 도려내진 부분, 또는 착색층 과 백색층 의 사이에 공간이 형성되어, 그 안에는 RFID 가 내장되어 있어도 된다. 이 경우, 유기용 대용 화폐 의 ID 는, 마크 (C) 에 의한 코드에 의한 ID 와 RFID 에 의한 것 과 병용된다. 이와 같이 하여 구성되는 유기용 대용 화폐 에 있어서는, 유기 테이블 칩 트레이 및 보관고 에 유지되어 있는 유기용 대용 화폐 의 종류와 매수는, 카메라 , ID 판독 장치 를 통하여 칩 판정 장 치 에 의해 특정되고, 유기 테이블 칩 트레이 및 보관고 상에 존재하는 유기용 대용 화폐 의 ID 가 그 소재 정보와 함께 데이터베이스 상에서 관리된다. 이에 따라, 적어도, 1) 데이터베이스 에 존재하지 않았던 ID 가 새롭게 존재하는 것, 2) 2 개 이상의 동일한 ID 가 존재하는 것이 검사된다. 상기 1) 혹은 2) 의 상황의 발생을, 모든 ID 를 검색, 판정함으로써 실현 가능하게 되어 있다. 관리 제어 장치 는, 인공 지능 활용형 혹은 딥 러닝 구조를 갖는 제어 장치여도 된다. 관리 제어 장치 는, 인공 지능 활용형의 컴퓨터 혹은 제어 시스템, 딥 러닝 (구조) 기술, 자기 학습 기능 등을 이용하여, 유기용 대용 화폐 의 위치 (플레이어나, 뱅커나, 페어에 배팅한 위치), 종류 (유기용 대용 화폐는 색 마다 상이한 액수의 값이 할당되어 있다) 및 매수를 파악하는 것이 가능하다. 이하에 유기용 대용 화폐 의 변형예에 대해 설명한다. 변형예에서는, 유기용 대용 화폐 의 측면에 는, ID 로서 숫자가 7 자릿수 인쇄되어 있다. 도 29 에 나타내는 실시예에서, 중심에 백색층 이 형성되고, 그 상하에 착색층 이 형성되어 있다. 중심의 백색층 에 마크로서의 숫자가 인쇄 되어 ID 를 구성하고 있다. 숫자의 조합으로서 10 종, 이것을 자릿수 인쇄하면, 10 종의 7 승의 코드 가 구성 가능해지므로 유기용 대용 화폐 의 유니크한 ID 를 충분히 부여할 수 있다. 카메라 와 그 화상 분석에서는, 숫자의 판정 판독이 곤란한 경우도 있어, 앞에 나타내는 실시예의 마크 (C) 의 조합이, 화상 분석상은 유리한 것으로 생각된다."}
{"patent_id": "10-2021-7002393", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1 은, 본 발명의 실시형태의 복수의 유기 테이블을 갖는 유기장에 있어서의 부정 행위의 검지 시스템의 전체 의 개요를 나타내는 도면이다. 도 2a 는, 본 발명의 실시형태에 있어서 파악되는 칩의 상이한 중첩 상태의 예를 나타내는 칩의 사시도이다. 도 2b 는, 본 발명의 실시형태에 있어서 파악되는 칩의 상이한 중첩 상태의 예를 나타내는 칩의 사시도이다. 도 3 은, 본 발명의 실시형태에 있어서 파악되는 카드의 오염을 설명하는 마크의 확대도이다. 도 4 는, 본 발명의 실시형태에 있어서 파악되는 지폐와 칩의 교환 상태의 영상을 간략화한 설명도이다. 도 5 는, 본 발명의 실시형태의 바카라 게임의 부정 검지 시스템의 전체 개요를 나타내는 평면도이다. 도 6 은, 본 발명의 실시형태의 부정 검지 시스템에 있어서의 바카라 게임의 진행 상태의 개요를 나타내는 평면 도이다. 도 7 은 바카라 게임에 있어서의 딜러에 의한 카지노측이 이긴 칩의 회수의 모습을 나타내는 설명도이다. 도 8 은, 본 발명의 실시형태의 바카라 게임에 있어서의 딜러에 의한 이긴 손님 (게임 참가인) 에 대한 지불의 모습을 나타내는 설명도이다. 도 9 는, 본 발명의 실시형태의 바카라 게임에 있어서의 이긴 손님 (게임 참가인) 에 의한 칩 및 지불의 수취의모습을 나타내는 설명도이다. 도 10a 는, 본 발명의 실시형태의 부정 검지 시스템에 있어서의 딜러에 의한 카지노측이 이긴 칩의 회수의 화상 분석의 대상이 되는 화상의 설명도이다. 도 10b 는, 본 발명의 실시형태의 부정 검지 시스템에 있어서의 딜러에 의한 카지노측이 이긴 칩의 회수의 화상 분석의 대상이 되는 화상의 설명도이다. 도 10c 는, 본 발명의 실시형태의 부정 검지 시스템에 있어서의 딜러에 의한 카지노측이 이긴 칩의 회수의 화상 분석의 대상이 되는 화상의 설명도이다. 도 11 은, 동일 부정 검지 시스템에 있어서의 칩의 부정 회수의 화상 분석의 대상이 되는 화상의 설명도이다. 도 12a 는, 동일 부정 검지 시스템에 있어서의 게임 참가인측이 이긴 칩의 회수의 화상 분석의 대상이 되는 화 상의 설명도이다. 도 12b 는, 동일 부정 검지 시스템에 있어서의 게임 참가인측이 이긴 칩의 회수의 화상 분석의 대상이 되는 화 상의 설명도이다. 도 12c 는, 동일 부정 검지 시스템에 있어서의 게임 참가인측이 이긴 칩의 회수의 화상 분석의 대상이 되는 화 상의 설명도이다. 도 12d 는, 동일 부정 검지 시스템에 있어서의 게임 참가인측이 이긴 칩의 회수의 화상 분석의 대상이 되는 화 상의 설명도이다. 도 13 은, 본 발명의 실시형태에 있어서의 카드 배포 장치의 측단면도이다. 도 14 는, 본 발명의 실시형태의 카드의 예를 나타내는 도면이다. 도 15 는, 본 발명의 실시형태의 카드 배포 장치의 카드 가이드부를 일부 파단한 상태의 주요부 평면도이다. 도 16a 는, 본 발명의 실시형태의 카드 배포 장치의 카드 수납부로부터의 카드의 출입을 제한하는 배포 제한 장 치를 나타내는 주요부 측단면도이다. 도 16b 는, 본 발명의 실시형태의 카드 배포 장치의 카드 수납부로부터의 카드의 출입을 제한하는 배포 제한 장 치의 변형예를 나타내는 주요부 측단면도이다. 도 17 은, 본 발명의 실시형태의 카드 배포 장치에 있어서의 센서류의 출력 파형과 마크의 관계를 나타내는 도 면이다. 도 18 은, 본 발명의 실시형태에 있어서의 유기장의 테이블 게임의 관리 시스템의 전체의 개요를 나타내는 평면 도이다. 도 19 는, 종래의 유기용 대용 화폐의 사시도이다. 도 20 은, 본 발명의 실시형태에 있어서의 유기용 대용 화폐의 정면 단면도이다. 도 21 은, 본 발명의 실시형태에 있어서 파악되는 유기용 대용 화폐를 쌓아 올린 상태의 사시도이다. 도 22a 는, 본 발명의 실시형태에 있어서의 유기용 대용 화폐의 측면도이다. 도 22b 는, 본 발명의 실시형태에 있어서의 유기용 대용 화폐의 평면도이다. 도 23 은, 본 발명의 실시형태에 있어서의 유기용 대용 화폐의 검사 장치의 측단면도이다. 도 24 는, 본 발명의 실시형태에 있어서의 유기용 대용 화폐의 종류가 상이한 것을 쌓아 올린 상태의 사시 설명 사진도이다. 도 25 는, 본 발명의 실시형태의 유기용 대용 화폐의 관리 시스템의 전체의 개요를 나타내는 도면이다. 도 26 은, 본 발명의 실시형태의 유기용 대용 화폐의 측면도이다. 도 27a 는, 본 발명의 실시형태의 하나의 유기용 대용 화폐가, 카지노 테이블의 칩 트레이에 유지된 상태를 나 타내는, 칩 트레이의 주요부 평면도이다. 도 27b 는, 유기용 대용 화폐가 겹쳐 쌓인 상태의 사시도이다.도 28 은, 본 발명의 실시형태의 유기용 대용 화폐에 부착되는 ID (복수 열의 코드로 나타낸다) 의 설명도이다. 도 29 는, 본 발명의 다른 실시형태의 유기용 대용 화폐에 부착되는 ID 의 측면도이다."}
