{"patent_id": "10-2014-0158551", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2016-0057668", "출원번호": "10-2014-0158551", "발명의 명칭": "지능형 무인 이/적재 시스템 및 이를 이용한 이/적재 방법", "출원인": "씨제이대한통운", "발명자": "김승모"}}
{"patent_id": "10-2014-0158551", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "자율이동 제어부로 이동제어명령을 전달하고, 아암 제어부로 아암제어명령을 전달하는 이/적재 제어부가 구비된화물 이/적재부를 포함하고,상기 화물 이/적재부는정형화물을 로드 및 언로드하는 적재부가 구비된 정형화물 이/적재부와;비정형화물을 로드 및 언로드하는 비정형화물 이/적재부가 포함됨을 특징으로 하는 지능형 무인 이/적재시스템."}
{"patent_id": "10-2014-0158551", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 정형화물 이/적재부와 비정형화물 이/적재부는 조인트에 의하여 착탈 가능하게 구비됨을 특징으로 하는 지능형 무인 이/적재 시스템."}
{"patent_id": "10-2014-0158551", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 정형화물 이/적재부는정형 이/적재 프레임과;상기 정형 이/적재 프레임의 전방으로 리프트레일에 결합된 이/적재 가이더와;상기 이/적재 가이더의 하부에 구비된 화물감지부와;상기 정형 이/적재 프레임의 하부에 구비된 주변감지부와;상기 정형 이/적재 프레임에 구비된 아암 구동부와;상기 이/적재 가이더와 리프트레일 고정편에 구비된 로드셀과;상기 리프트레일의 배면 상부와 하부에 각각 구비된 근접센서와;상기 정형 이/적재 프레임의 후방에 구비된 적재부와;상기 정형 이/적재 프레임의 후방에 구비된 전원부; 및자율이동제어부가 포함됨을 특징으로 하는 지능형 무인 이/적재 시스템."}
{"patent_id": "10-2014-0158551", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 비정형화물 이/적재부는비정형 이/적재 프레임과;상기 비정형 이/적재 프레임에 결합된 이/적재 아암 가이더와;공개특허 10-2016-0057668-2-상기 이/적재 아암 가이더에 구비된 화물감지부와;상기 비정형 이/적재 프레임에 구비된 주변감지부와;상기 비정형 이/적재 프레임에 구비된 아암 구동부와;상기 아암 가이더에 구비된 로드셀과;상기 비정형 이/적재 프레임에 구비된 전원부; 및자율이동제어부가 포함됨을 특징으로 하는 지능형 무인 이/적재 시스템."}
{"patent_id": "10-2014-0158551", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 이/적재 제어부는 화물 이/적재부의 이동을 제어하는 자율이동 제어부와;아암제어명령을 전달받아 아암 높이 또는 각도를 제어하는 아암 제어부와;화물의 정보를 이/적재 제어부로 전달하는 화물감지부와; 주변의 정보를 이/적재 제어부로 전달하는 주변감지부를 포함하는 것을 특징으로 하는 지능형 무인 이/적재 시스템."}
{"patent_id": "10-2014-0158551", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 자율이동 제어부는 이/적재 제어부로부터 화물정보와 주변정보를 전달받고, 반사되는 거리 또는 각도를 계산하여 이동영역의 지도를 생성하는 환경지도 작성부와;생성된 환경지도를 기반으로 레이저 스캔을 통해 반사되는 시간에 따른 거리를 산출하고, 천장패턴에 변화를 감지하여 환경지도 내 현재 위치정보를 얻는 위치인식부와;화물 이/적재부의 이동위치를 현재 위치를 기점으로 하고, 환경지도 내 지정된 위치까지 이동경로를 생성하는경로계획부와;화물 이/적재부가 생성된 이동경로를 따라 이동하는 과정에서 동적 또는 정적 장애물이 나타나면 장애물 감지부의 정보를 바탕으로 거리정보를 획득하고, 장애물로부터 이격되는 장애물 회피부가 포함됨을 특징으로 하는 지능형 무인 이/적재 시스템."}
{"patent_id": "10-2014-0158551", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 환경지도 작성부는 생성된 지도에 대상 영역의 천장 이미지를 오버랩하여 오차율을 낮춤이 포함됨을 특징으로 하는 지능형 무인 이/적재 시스템."}
{"patent_id": "10-2014-0158551", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서,상기 위치인식부는공개특허 10-2016-0057668-3-환경지도 내 현재 위치정보에 비컨으로부터 수신되는 신호 세기의 차이 정보를 이용하여 위치정보가 보정됨이포함됨을 특징으로 하는 지능형 무인 이/적재 시스템."}
{"patent_id": "10-2014-0158551", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제6항에 있어서,상기 환경지도 내 지정된 위치까지 생성되는 이동경로는딕스트라 알고리즘으로 생성됨이 포함되는 것을 특징으로 하는 지능형 무인 이/적재 시스템."}
{"patent_id": "10-2014-0158551", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 화물 이/적재부는무선통신 수신부를 더 구비하여 작업자가 가지고 있는 무선통신 송신부에서 추종신호가 발생되면 무선통신 수신부가 추종신호의 세기 또는 감지시간을 측정하여 거리를 추정하고, 자율이동 제어부가 제어되어 작업자를 감응하여 추종됨을 특징으로 하는 지능형 무인 이/적재 시스템."}
{"patent_id": "10-2014-0158551", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "센터서버로부터 화물 위치와 이/적재 순서에 따라 가용 가능한 화물 이/적재부의 이동을 이/적제 제어부로 지시하는 단계와;상기 이/적재 제어부가 화물 이/적재부의 이동위치를 판단하고, 화물정보와 주변정보를 전달받아 화물 이/적재부의 이동 거리, 아암 높이 또는 각도를 계산하고, 자율이동제어부로 이동제어명령을 전달하여 화물 이/적재부가 이동하는 단계와;상기 화물정보를 전달받고, 화물정보를 기반으로 아암제어부로 아암제어명령을 전달하여 아암 높이 또는 각도가제어되어 화물을 로드 및 언로드하는 단계와;상기 이/적재 제어부가 자율이동 제어부 및 아암제어부를 반복 제어하여 화물의 로드 및 언로드를 완료하는 단계를 포함하는 것을 특징으로 하는 지능형 무인 이/적재 방법."}
{"patent_id": "10-2014-0158551", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 자율이동제어부는 이/적재 제어부로부터 화물정보와 주변정보를 전달받고, 반사되는 거리 또는 각도를 계산하여 이동영역의 지도를 생성하는 환경지도 작성단계와;생성된 환경지도를 기반으로 반사되는 시간에 따른 거리를 산출하고, 천장패턴에 변화를 감지하여 환경지도 내현재 위치정보를 얻는 위치 인식단계와;화물 이/적재부의 이동위치가 현재 위치를 기점으로 하고, 환경지도 내 지정된 위치까지 이동경로를 생성하는경로계획단계; 및화물 이/적재부가 생성된 이동경로를 따라 이동하는 과정에서 동적 또는 정적 장애물이 나타나면 장애물 감지부의 정보를 바탕으로 거리정보를 획득하고, 장애물로부터 이격되는 장애물 회피단계가 포함됨을 특징으로 하는지능형 무인 이/적재 방법.공개특허 10-2016-0057668-4-청구항 13 제12항에 있어서,상기 환경지도 작성은 생성된 지도에 대상 영역의 천장 이미지를 오버랩하여 오차율을 낮춤이 포함됨을 특징으로 하는 지능형 무인 이/적재 방법."}
{"patent_id": "10-2014-0158551", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서,상기 화물이 정형화물일 경우,센터서버로부터 정형화물 위치와 수량 또는 이/적재 순서에 따라 가용 가능한 정형화물 이/적재부의 이동을 이/적재 제어부로 지시하는 단계와;지시받은 이/적재 제어부는 환경지도 작성단계, 위치 인식단계, 경로계획단계, 장애물 회피단계를 통해 얻어진정보를 기반으로 정형화물이 있는 곳으로 이동하는 단계와;이/적재 가이더에 구비된 화물감지부에 의하여 화물위치와 영상이 포함된 정보가 이/적재 제어부로 전달되고,정형 이/적재 프레임에 구비된 주변감지부에 의하여 감지된 주변영상이 이/적재 제어부로 전달되는 위치정보와주변정보를 바탕으로 아암제어명령을 아암제어부로 전달하여 아암 구동부가 구동되는 단계와;아암이 결합된 이/적재 가이더가 리프트레일을 따라 리프트되는 단계를 통해 정형화물의 이/적재가 이루어지는것이 포함됨을 특징으로 하는 지능형 무인 이/적재 방법."}
{"patent_id": "10-2014-0158551", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,가용 가능한 정형화물 이/적재부의 이동은센터서버로부터 쉬는 정형화물 이/적재부를 호출하는 단계와;쉬는 정형화물 이/적재부가 자기의 상태를 알리는 단계와;센터서버는 적재장소에 가까운 정형화물 이/적재부의 이동을 지시하는 단계가 포함됨을 특징으로 하는 지능형무인 이/적재 방법."}
{"patent_id": "10-2014-0158551", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제14항에 있어서,정형화물이 있는 곳으로 이동한 후 감지센서에 의하여 감지된 정형화물 유무가 이/적제 제어부에 의하여 센터서버로 전송되는 단계가 포함됨을 특징으로 하는 지능형 무인 이/적재 방법."}
{"patent_id": "10-2014-0158551", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제11항에 있어서,상기 화물이 비정형화물일 경우, 센터서버로부터 비정형화물 위치와 수량 또는 이/적재 순서에 따라 가용 가능한 비정형화물 이/적재부의 이동을각각 이/적재 제어부로 지시하는 단계와;지시받은 이/적재 제어부는 환경지도 작성단계, 위치 인식단계, 경로계획단계, 장애물 회피단계를 통해 얻어진정보를 기반으로 비정형 화물이 있는 곳으로 각각 이동하는 단계와;공개특허 10-2016-0057668-5-비정형 이/적재 프레임에 구비된 화물감지부에 의하여 화물위치와 영상이 포함된 정보가 이/적재 제어부로 전달되고, 비정형 이/적재 프레임에 구비된 주변감지부의 주변영상이 이/적재 제어부로 전달되는 위치정보와 주변정보를 바탕으로 아암제어명령을 아암제어부로 전달하고, 아암 구동부에 의하여 아암이 구동되는 단계를 통해 비정형 화물의 이/적재가 이루어지는 것이 포함됨을 특징으로 하는 지능형 무인 이/적재 방법."}
{"patent_id": "10-2014-0158551", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서,가용 가능한 비형화물 이/적재부의 이동은센터서버로부터 쉬는 비정형화물 이/적재부를 호출하는 단계와;쉬는 비정형화물 이/적재부가 자기의 상태를 알리는 단계와;센터서버는 적재장소에 가까운 비정형화물 이/적재부의 이동을 지시하는 단계가 포함됨을 특징으로 하는 지능형무인 이/적재 방법."}
{"patent_id": "10-2014-0158551", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제17항에 있어서,비정형화물이 있는 곳으로 이동한 후 감지센서에 의하여 감지된 비정형화물 유무가 이/적제 제어부에 의하여 센터서버로 전송되는 단계가 포함되고,비정형화물이 있을 경우, 센터서버는 정형화물 이/적재부를 비정형화물 이/적재부가 있는 곳으로 이동을 지시하여 비정형화물이 적재 및 이송됨이 더 포함됨을 특징으로 하는 지능형 무인 이/적재 방법."}
{"patent_id": "10-2014-0158551", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제17항에 있어서,비정형화물이 있는 곳으로 이동된 비정형화물 이/적재부에 센터서버로부터 다수개의 정형화물 이/적재부가 이동되어 비정형화물 이/적재가 이루어지는 것이 포함됨을 특징으로 하는 지능형 무인 이/적재 방법."}
{"patent_id": "10-2014-0158551", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제17항에 있어서,비정형화물이 있는 곳으로 이동된 다수개의 비정형화물 이/적재부에 센터서버로부터 다수개의 정형화물 이/적재부가 이동되어 비정형화물 이/적재가 이루어지는 것이 포함됨을 특징으로 하는 지능형 무인 이/적재 방법."}
{"patent_id": "10-2014-0158551", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 지능형 무인 이/적재 시스템 및 이를 이용한 이/적재 방법에 관한 것이다. 이를 위하여, 본 발명은 자율이동 제어부로 이동제어명령을 전달하고, 아암 제어부로 아암제어명령을 전달하는 이/적재 제어부가 구비된 화물 이/적재부를 포함하고, 상기 화물 이/적재부는 정형화물을 로드 및 언로드하는 적 재부가 구비된 정형화물 이/적재부와; 비정형화물을 로드 및 언로드하는 비정형화물 이/적재부가 포함됨을 특징 으로 한다. 따라서, 본 발명은 물류센터에서 정형화된 화물과 비정형화된 화물을 구분하여 이/적재가 가능하도록 하여 작업 율을 높이는 가운데 유연성과 확장성을 더 얻을 수 있다."}
{"patent_id": "10-2014-0158551", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 지능형 무인 이/적재 시스템 및 이를 이용한 이/적재 방법에 관한 것으로서, 특히 물류센터에서 정형 화물 또는 비정형 화물 구분없이 피킹, 이송, 적재 및 상차 등 의 작업이 이루어질 수 있도록 한 것이다."}
{"patent_id": "10-2014-0158551", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 부피가 크고 중량이 무거운 화물을 지게차나 크레인으로 들어올려 차량에 적재 또는 하역을 하거나, 운반 및 보관시에 화물을 받쳐주기 위해서 팔레트가 널리 사용되고 있다.팔레트의 이동에는 지게차가 주로 사용되고 있는데, 최근 물류의 양이 증가함에 따라 지게차 운전자들의 작업량 이 증가하여 운잔자의 피로, 조작 실수 등에 의한 충돌, 낙하 등의 사고 위험이 높아지고 있다 이러한 문제를 해결하기 위하여 무인 이송장치가 제안되어 물류현장의 인력절감, 생산성 향상, 근로환경 개선을 통해 제품이나 서비스의 가격 경쟁력을 높이는 역할을 하게 된다. 이때, 팔레트의 위치와 자세를 정확히 알고 있다는 것을 전제로 무인 이송장치가 팔레트의 앞으로 이동하여 제자리 회전한 후, 적재물을 적재하였다. 그러나 팔레트가 정확한 위치에서 정확한 자세로 놓여있다는 전제가 필요하므로 팔레트의 위치나 자세가 조금이 라도 달라지면 무인 이송장치는 이에 대한 적재가 불가능하다는 문제점이 있었다. 이러한 문제를 해결하고자 포크 캐리지 상단에 2차원 감지 범위를 가지는 레이저 스캐너를 설치하여 팔레트 홀 을 스캔하는 방식이 제안되었으나, 팔레트 홀을 찾기 위해서 포크캐리지가 상하로 반복적으로 이동해야 하기 때 문에 감지 시간이 길고, 시스템을 구축하는 비용이 높은 문제가 있다. 한편, 등록특허공보 10-1397342호(2014.05.13)호의 무인지게차의 팔레트 자율하역 장치 및 방법이 제안되었으나, 정형화된 화물만 하역이 가능할 뿐 비정형화된 화물을 하역이 불가능한 문제점이 있었다. 또한, 이로 인해 물류센터에서 정형 화물 또는 비정형 화물이 있을 경우 작업율이 낮아지고, 작업 시간이 더 소 요되는 등 유연성과 확장성이 낮아지는 또 다른 문제점이 있었다."}
{"patent_id": "10-2014-0158551", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 정형화된 화물과 비정형화된 화물이 혼재되어 있는 물류센터에서 센터서버의 지시에 따라 화물 이/적 재부가 자율이동부에 의하여 지시하는 장소로 이동한 후 정형화된 화물과 비정형화된 화물을 구분하여 이/적재 가 가능하도록 함으로써, 화물의 이/적재 작업이 용이하게 이루어져 작업율을 높일 수 있도록 하고, 이를 통해 작업에 소요되는 시간을 줄일 수 있도록 하고, 아울러 작업의 유연성과 확장성을 얻을 수 있도록 한 것이다."}
{"patent_id": "10-2014-0158551", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명은 자율이동 제어부로 이동제어명령을 전달하고, 아암 제어부로 아암제어명령을 전달하는 이/적재 제어 부가 구비된 화물 이/적재부를 포함하고, 상기 화물 이/적재부는 정형화물을 로드 및 언로드하는 적재부가 구비 된 정형화물 이/적재부와; 비정형화물을 로드 및 언로드하는 비정형화물 이/적재부가 포함됨을 특징으로 한다. 또한, 상기 정형화물 이/적재부와 비정형화물 이/적재부는 조인트에 의하여 착탈 가능하게 구비됨을 특징으로 한다. 또한, 상기 정형화물 이/적재부는 정형 이/적재 프레임과; 상기 정형 이/적재 프레임의 전방으로 리프트레일에 결합된 이/적재 가이더와; 상기 이/적재 가이더의 하부에 구비된 화물감지부와; 상기 정형 이/적재 프레임의 하 부에 구비된 주변감지부와; 상기 정형 이/적재 프레임에 구비된 아암 구동부와; 상기 이/적재 가이더와 리프트 레일 고정편에 구비된 로드셀과; 상기 리프트레일의 배면 상부와 하부에 각각 구비된 근접센서와; 상기 정형 이 /적재 프레임의 후방에 구비된 적재부와; 상기 정형 이/적재 프레임의 후방에 구비된 전원부; 및 자율이동제어 부가 포함됨을 특징으로 한다. 또한, 상기 비정형화물 이/적재부는 비정형 이/적재 프레임과; 상기 비정형 이/적재 프레임에 결합된 이/적재 아암 가이더와; 상기 이/적재 아암 가이더에 구비된 화물감지부와; 상기 비정형 이/적재 프레임에 구비된 주변 감지부와; 상기 비정형 이/적재 프레임에 구비된 아암 구동부와; 상기 아암 가이더에 구비된 로드셀과; 상기 비 정형 이/적재 프레임에 구비된 전원부; 및 자율이동제어부가 포함됨을 특징으로 한다. 또한, 상기 이/적재 제어부는 화물 이/적재부의 이동을 제어하는 자율이동 제어부와; 아암제어명령을 전달받아 아암 높이 또는 각도를 제어하는 아암 제어부와; 화물의 정보를 이/적재 제어부로 전달하는 화물감지부와; 주 변의 정보를 이/적재 제어부로 전달하는 주변감지부를 포함하는 것을 특징으로 한다. 또한, 상기 자율이동 제어부는 이/적재 제어부로부터 화물정보와 주변정보를 전달받고, 반사되는 거리 또는 각 도를 계산하여 이동영역의 지도를 생성하는 환경지도 작성부와; 생성된 환경지도를 기반으로 레이저 스캔을 통 해 반사되는 시간에 따른 거리를 산출하고, 천장패턴에 변화를 감지하여 환경지도 내 현재 위치정보를 얻는 위 치인식부와; 화물 이/적재부의 이동위치를 현재 위치를 기점으로 하고, 환경지도 내 지정된 위치까지 이동경로 를 생성하는 경로계획부와; 화물 이/적재부가 생성된 이동경로를 따라 이동하는 과정에서 동적 또는 정적 장애 물이 나타나면 장애물 감지부의 정보를 바탕으로 거리정보를 획득하고, 애물로부터 이격되는 장애물 회피부가 포함됨을 특징으로 한다. 또한, 상기 환경지도 작성부는 생성된 지도에 대상 영역의 천장 이미지를 오버랩하여 오차율을 낮춤이 포함됨을 특징으로 한다. 또한, 상기 위치인식부는 환경지도 내 현재 위치정보에 비컨으로부터 수신되는 신호 세기의 차이 정보를 이용하 여 위치정보가 보정됨이 포함됨을 특징으로 한다. 또한, 상기 환경지도 내 지정된 위치까지 생성되는 이동경로는 딕스트라 알고리즘으로 생성됨이 포함되는 것을 특징으로 한다. 또한, 상기 화물 이/적재부는 무선통신 수신부를 더 구비하여 작업자가 가지고 있는 무선통신 송신부에서 추종 신호가 발생되면 무선통신 수신부가 추종신호의 세기 또는 감지시간을 측정하여 거리를 추정하고, 자율이동 제 어부가 제어되어 작업자를 감응하여 추종됨을 특징으로 한다. 한편, 본 발명은 센터서버로부터 화물 위치와 이/적재 순서에 따라 가용 가능한 화물 이/적재부의 이동을 이/적 제 제어부로 지시하는 단계와; 상기 이/적재 제어부가 화물 이/적재부의 이동위치를 판단하고, 화물정보와 주변 정보를 전달받아 화물 이/적재부의 이동 거리, 아암 높이 또는 각도를 계산하고, 자율이동제어부로 이동제어명 령을 전달하여 화물 이/적재부가 이동하는 단계와; 상기 화물정보를 전달받고, 화물정보를 기반으로 아암제어부 로 아암제어명령을 전달하여 아암 높이 또는 각도가 제어되어 화물을 로드 또는 언로드하는 단계와; 상기 이/적 재 제어부가 자율이동 제어부 및 아암제어부를 반복 제어하여 화물의 로드 또는 언로드를 완료하는 단계를 포함 하는 것을 특징으로 한다. 또한, 상기 자율이동제어부는 이/적재 제어부로부터 화물정보와 주변정보를 전달받고, 반사되는 거리 또는 각도 를 계산하여 이동영역의 지도를 생성하는 환경지도 작성단계와; 생성된 환경지도를 기반으로 반사되는 시간에 따른 거리를 산출하고, 천장패턴에 변화를 감지하여 환경지도 내 현재 위치정보를 얻는 위치 인식단계와; 화물 이/적재부의 이동위치가 현재 위치를 기점으로 하고, 환경지도 내 지정된 위치까지 이동경로를 생성하는 경로계 획단계; 및 화물 이/적재부가 생성된 이동경로를 따라 이동하는 과정에서 동적 또는 정적 장애물이 나타나면 장 애물 감지부의 정보를 바탕으로 거리정보를 획득하고, 장애물로부터 이격되는 장애물 회피단계가 포함됨을 특징 으로 한다. 또한, 상기 환경지도 작성은 생성된 지도에 대상 영역의 천장 이미지를 오버랩하여 오차율을 낮춤이 포함됨을 특징으로 한다. 또한, 상기 화물이 정형화물일 경우, 센터서버로부터 정형화물 위치와 수량 또는 이/적재 순서에 따라 가용 가 능한 정형화물 이/적재부의 이동을 이/적재 제어부로 지시하는 단계와; 지시받은 이/적재 제어부는 환경지도 작 성단계, 위치 인식단계, 경로계획단계, 장애물 회피단계를 통해 얻어진 정보를 기반으로 정형화물이 있는 곳으 로 이동하는 단계와; 이/적재 가이더에 구비된 화물감지부에 의하여 화물위치와 영상이 포함된 정보가 이/적재 제어부로 전달되고, 정형 이/적재 프레임에 구비된 주변감지부에 의하여 감지된 주변영상이 이/적재 제어부로 전달되는 위치정보와 주변정보를 바탕으로 아암제어명령을 아암제어부로 전달하여 아암 구동부가 구동되는 단계 와; 아암이 결합된 이/적재 가이더가 리프트레일을 따라 상,하로 리프트되는 단계를 통해 정형화물의 이/적재가 이루어지는 것이 포함됨을 특징으로 한다. 또한, 가용 가능한 정형화물 이/적재부의 이동은 센터서버로부터 쉬는 정형화물 이/적재부를 호출하는 단계와; 쉬는 정형화물 이/적재부가 자기의 상태를 알리는 단계와; 센터서버는 적재장소에 가까운 정형화물 이/적재부의 이동을 지시하는 단계가 포함됨을 특징으로 한다. 또한, 정형화물이 있는 곳으로 이동한 후 감지센서에 의하여 감지된 정형화물 유무가 이/적제 제어부에 의하여 센터서버로 전송되는 단계가 포함됨을 특징으로 한다. 또한, 상기 화물이 비정형화물일 경우, 센터서버로부터 비정형화물 위치와 수량 또는 이/적재 순서에 따라 가 용 가능한 비정형화물 이/적재부의 이동을 각각 이/적재 제어부로 지시하는 단계와; 지시받은 이/적재 제어부는환경지도 작성단계, 위치 인식단계, 경로계획단계, 장애물 회피단계를 통해 얻어진 정보를 기반으로 비정형 화 물이 있는 곳으로 각각 이동하는 단계와; 비정형 이/적재 프레임에 구비된 화물감지부에 의하여 화물위치와 영 상이 포함된 정보가 이/적재 제어부로 전달되고, 비정형 이/적재 프레임에 구비된 주변감지부의 주변영상이 이/ 적재 제어부로 전달되는 위치정보와 주변정보를 바탕으로 아암제어명령을 아암제어부로 전달하고, 아암 구동부 에 의하여 아암이 구동되는 단계를 통해 비정형 화물의 이/적재가 이루어지는 것이 포함됨을 특징으로 한다. 또한, 가용 가능한 비형화물 이/적재부의 이동은 센터서버로부터 쉬는 비정형화물 이/적재부를 호출하는 단계와; 쉬는 비정형화물 이/적재부가 자기의 상태를 알리는 단계와; 센터서버는 적재장소에 가까운 비정형화물 이/적재부의 이동을 지시하는 단계가 포함됨을 특징으로 한다. 또한, 비정형화물이 있는 곳으로 이동한 후 감지센서에 의하여 감지된 비정형화물 유무가 이/적제 제어부에 의 하여 센터서버로 전송되는 단계가 포함되고, 비정형화물이 있을 경우, 센터서버는 정형화물 이/적재부를 비정형 화물 이/적재부가 있는 곳으로 이동을 지시하여 비정형화물이 적재 및 이송됨이 더 포함됨을 특징으로 한다. 또한, 비정형화물이 있는 곳으로 이동된 비정형화물 이/적재부에 센터서버로부터 다수개의 정형화물 이/적재부 가 이동되어 비정형화물 이/적재가 이루어지는 것이 포함됨을 특징으로 한다. 또한, 비정형화물이 있는 곳으로 이동된 다수개의 비정형화물 이/적재부에 센터서버로부터 다수개의 정형화물 이/적재부가 이동되어 비정형화물 이/적재가 이루어지는 것이 포함됨을 특징으로 한다."}
{"patent_id": "10-2014-0158551", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 물류센터에서 센터서버의 지시에 따라 화물 이/적재부가 지시하는 장소로 이동한 후 정형화된 화물과 비정형화된 화물을 구분하여 이/적재가 가능하도록 한 효과를 얻을 수 있다. 또한, 이를 통해 피킹, 이송, 적재 및 상차 등 의 용이하게 이루어질 수 있는 효과를 더 얻을 수 있다. 또한, 이를 통해 정형화된 화물과 비정형화된 화물이 혼재되어 있는 물류센터에서 작업율을 더 높일 수 있는 효 과를 얻을 수 있다. 그리고 이를 통해 작업에 소요되는 전체적인 시간을 줄이는 가운데 작업의 유연성과 확장성을 더 얻을 수 있다."}
{"patent_id": "10-2014-0158551", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 실시예를 첨부 도면을 참조하여 설명하면 다음과 같다. 도1은 본 발명에 따른 지능형 무인 이/적재 시스템을 도시한 구성도이고, 도2는 본 발명에 따른 지능형 무인 이 /적재 시스템에 있어 화물 이/적재부가 정형화물 이/적재부 및 비정형화물 이/적재부로 구비된 상태를 도시한 예시도이고, 도3은 본 발명에 따른 지능형 무인 이/적재 시스템에 있어 화물 이/적재부인 정형화물 이/적재부와 비정형화물 이/적재부가 결합된 상태를 도시한 사시도이다. 본 발명에 따른 지능형 무인 이/적재 시스템은 정형화된 화물과 비정형화된 화물이 혼재되어 있는 물류센터에서 화물 이/적재 순서에 따라 센터서버의 지시에 따라 화물 이/적재부가 지시하는 장소로 이동한 후 화 물의 이/적재가 가능하도록 한 것으로 도1에 도시된 바와 같이, 센터서버와 화물 이/적재부가 포함되 도록 구성되어 있다. 상기 센터서버는 물류센터(C)내의 화물 위치와 수량이 저장되어 있고, 요구되는 즉, 화물의 이/적재 순서 에 따라 화물 이/적재부와 통신하여 가용 여부를 판단하고, 가용 가능한 화물 이/적재부를 이/적재 위치로 이동을 지시한다. 이러한 상기 센터서버는 화물의 종류와 위치 및 수량에 대한 업데이트가 실시간 으로 이루어져 물류센터(C)내의 화물 이/적재 작업이 원활하게 이루어질 수 있다. 상기 화물 이/적재부는 센터서버의 지시에 따라 화물의 있는 곳으로 이동하여 화물의 이/적재 작업이 이루어지는 것으로 이/적재 제어부, 자율이동 제어부, 아암 제어부, 화물감지부 및 주변감 지부가 포함되도록 구성되어 있다. 상기 화물 이/적재부는 물류센터(C)에 보관된 정형화물 즉, 파렛트에 얹혀진 상태로 보관되는 화물을 로드 또는 언로드하고, 정형화물 즉, 파렛트가 필요 없이 박스형태를 갖도록 구비된 화물 또는 비정형화물을 적재하 는 적재부(217a)가 구비된 정형화물 이/적재부(200a)와, 물류센터(C)에 보관된 비정형화물을 로드 도는 언로드 하는 비정형화물 이/적재부(200b)를 포함한다. 상기 화물 이/적재부는 물류센터(C)의 내부에서 적재부(217a)가 구비된 정형화물 이/적재부(200a)와 비정 형화물 이/적재부(200b)가 후술하는 조인트에 의하여 결합된 상태 또는 분리된 상태로 화물 이/적재 작업 이 이루어진다. 이때, 도2에 도시된 바와 같이, 정형화물 이/적재부(200a)와 비정형화물 이/적재부(200b)가 결 합된 상태에서는 센터서버에서 요구되는 화물의 이/적재 작업 순서에 따라 정형화물 이/적재부(200a)와 비 정형화물 이/적재부(200b)는 각각 별도의 작업이 이루어진다. 즉, 정형화물 이/적재부(200a)를 이용하여 정형화 물인 파렛트에 얹혀진 화물을 로드 또는 언로드가 이루어질 때 비정형화물 이/적재부(200b)는 작업을 멈춘 상태 가 유지된다. 도4는 본 발명에 따른 지능형 무인 이/적재 시스템에 있어 화물 이/적재부인 정형화물 이/적재부와 비정형화물 이/적재부가 분리된 상태를 도시한 사시도이다이고, 도6은 본 발명에 따른 지능형 무인 이/적재 시스템에 있어 화물 이/적재부인 정형화물 이/적재부와 비정형화물 이/적재부가 결합된 상태를 도시한 예시도이다. 도시된 바와 같이, 정형화물 이/적재부(200a)는 정형 이/적재 프레임(210a)의 전방에 리프트레일(211a)이 구비 되며, 상기 리프트레일(211a)을 따라 상하로 리프트되는 포크형 아암(212a)을 갖는 이/적재 가이더(213a)가 결 합되어 있고, 상기 이/적재 가이더(213a)의 하부에 화물위치파악과 영상이 포함된 정보를 이/적재 제어부 로 전달하는 화물감지부가 구비되며, 상기 정형 이/적재 프레임(210a)의 하부에 주변영상을 이/적재 제어 부로 전달하는 주변감지부가 구비된다. 이때, 상기 화물감지부는 비전센서를 이용하여 정형화물 의 홀 위치를 파악하고, 홀위치와 영상이 포함된 정보가 전달되도록 하는 것이 바람직하며, 상기 주변감지부 는 적외선센서 또는 레이저 스캐너를 통해 주변정보가 수집되도록 하는 것으로 상기 정형 이/적재 프레임 (210a)의 사방에 장착되도록 하는 것이 바람직하다. 상기 이/적재 제어부로부터 전달된 아암제어명령에 따라 아암제어부에 의하여 이/적재가이더(213a)의 구동을 제어하는 아암 구동부(214a)가 상기 리프트레일(211a) 사이의 정형 이/적재 프레임(210a)에 구비되며, 정형화물의 무게를 감지하여 이/적재 제어부로 전달하는 로드셀(215a)이 상기 이/적재 가이더(213a)와 리 프트레일 고정편(211a-1)에 구비된다. 이때, 상기 아암 구동부(214a)는 에어 실린더 또는 랙엔 피니언 등이 사용될 수 있다. 상기 이/적재 가이더(213a)의 상하부 위치를 감지하여 아암제어부로 전달하는 근접센서(216a)가 상기 리프 트레일(211a)의 배면 상부와 하부에 각각 구비되며, 안전펜스(217a-1)를 가지며, 화물의 적재량을 감지하는 무 게센서(217a-2)가 구비되어 적재된 화물의 무게 정보를 이/적재 제어부로 전달하는 적재부(217a)가 상기 정형 이/적재 프레임(210a)의 후방 상단부에 구비된다. 상기 정형 이/적재 프레임의 후방에 전원공급부(218a)가 구비되며, 이/적재 제어부의 이동제어명령을 전달받아 정형화물 이/적재부(200a)의 이동을 제어하는 자율이동제어부가 상기 정형 이/적재 프레임 의 하부에 구비된다. 이때, 전원공급부(218a)는 전원량이 이/적재 제어부로 전달되며, 전원량이 부족할 경 우, 이/적재 제어부의 지시에 따라 물류센터(C)내의 충전장소로 이동시켜 충전이 이루어질 수 있게 된다. 상기 비정형화물 이/적재부(200b)는 다관절(211b)의 하단이 회동 가능하게 구비되며, 다관절(211b)의 상단에 흡 착형 아암(212b)이 결합된 이/적재 아암 가이더(213b)가 비정형 이/적재 프레임(210b)의 상부에 구비되며, 화물 위치파악과 영상이 포함된 정보를 이/적재 제어부로 전달하는 화물감지부가 상기 이/적재 아암 가이 더(213b)에 구비된다. 상기 화물감지부는 비전센서를 이용하여 정형화물의 홀위치를 파악하고, 홀위치와 영상이 포함된 정보가 전달되도록 하는 것이 바람직하다. 주변연상을 이/적재 제어부로 전달하는 주변감지부가 상기 비정형 이/적재 프레임(210b)에 구비되며, 상기 이/적재 제어부로부터 전달된 아암제어명령에 따라 아암제어부에 의하여 이/적재 아암가이더 (213b)의 구동이 제어되는 아암 구동부(214b)가 상기 비정형 이/적재 프레임(210b)에 구비된다. 상기 주변감지부는 적외선센서 또는 레이저 스캐너를 통해 주변정보가 수집되도록 하는 것으로 상기 비정 형 이/적재 프레임(210b)의 사방에 장착되도록 하는 것이 바람직하다. 비정형화물 무게를 감지하여 이/적재 제어부로 전달하는 로드셀(215b)이 상기 아암(212b)에 구비되며, 상 기 비정형 이/적재 프레임(210b)의 후방에 전원공급부(216b)가 구비되고, 상기 이/적재 제어부의 이동제어 명령을 전달받아 정형화물 이/적재부(200b)의 이동을 제어하는 자율이동제어부가 상기 비정형 이/적재 프 레임(210b)의 하부에 구비된다. 상기 전원공급부(216b)는 충전량이 이/적재 제어부로 전달되며, 충전량이 부족할 경우, 이/적재 제어부 의 지시에 따라 물류센터(C)내의 충전장소로 이동시켜 충전이 이루어질 수 있게 된다. 한편, 상기 센터서버에서 요구되는 화물의 이/적재 작업이 박스형태의 화물일 경우, 비정형화물 이/적재부 (200b)의 작업이 이루어지며, 정형화물 이/적재부(200a)는 작업을 멈춘 상태에서 적재부(217a)에 화물을 적재하 게 된다. 이 과정에서 적재부(217a)에 적재되는 화물은 무게센서(217a-1)에 의하여 감지된 무게정보가 이/적재 부(200b)로 전달되어 과적 여부를 판단하게 되고, 안전휀스(217a-1)에 의하여 이동과정에서 적재부(217a)에 적 재된 화물이 바닥으로 떨어지는 것을 방지한다. 상기 화물 이/적재부의 정형화물 이/적재부(200a)와 비정형화물 이/적재부(200b)가 조인트에 의하여 결합된 상태에서는 센터서버에서 요구되는 화물의 이/적재 작업에 따라 정형화물 이/적재부(200a)와 비정 형화물 이/적재부(200b)의 이동순위가 바뀌게 된다. 즉, 파렛트형 화물일 경우, 정형화물 이/적재부(200a)가 구 동되어 비정형화물 이/적재부(200b)를 끌고 가는 형태로 이동되고, 박스형 화물일 경우, 비정형화물 이/적재부 (200b)가 정형화물 이/적재부(200a)를 끌고 가는 형태로 이동되어 각각의 정형화물 이/적재부(200a)와 비정형화 물 이/적재부(200b)에 구비된 전원공급부(218a)(216b)의 전원 소비를 줄일 수 있게 된다. 상기 화물 이/적재부의 정형화물 이/적재부(200a)와 비정형화물 이/적재부(200b)가 조인트에 의하여 분리된 상태에서는 센터서버에서 요구되는 화물의 이/적재 작업에 따라 정형화물 이/적재부(200a)와 비정 형화물 이/적재부(200b)가 각각 이동한다. 도5는 본 발명에 따른 지능형 무인 이/적재 시스템에 있어 화물 이/적재부인 정형화물 이/적재부와 비정형화물 이/적재부의 조인트부를 도시한 사시도이다. 도시된 바와 같이, 상기 조인트는 정형화물 이/적재부(200a)의 정형 이/적재 프레임(210a) 후방에 구비된 것으로 조인홈을 갖는 요부형 조인부와, 비정형화물 이/적재부(200b)의 비정형 이/적재 프레임(210b) 후방에 구비된 것으로 조인축을 갖는 철부형 조인부를 포함한다.상기 요부형 조인부는 조인홈을 수직으로 관통하는 아우터 조인핀홀이 구비되며, 상기 철부형 조인트부의 조인축에 축방향에 대하여 직각방향을 갖는 인너 조인핀홀이 구비된다. 상기 조인축이 조인홈에 삽입된 상태에서 아우터 조인핀홀과 인너 조인핀홀에 조인핀(43 0)이 삽입되는 것으로 정형화물 이/적재부(200a)와 정형 이/적재 프레임(210a)의 결합되고, 상기 조인핀을 뺄 경우, 요부형 조인부와 철부형 조인부의 구속력이 해지됨으로써, 정형화물 이/적재부(200a)와 정 형 이/적재 프레임(210a)의 분리된다. 상기 이/적재 제어부는 센터서버의 지시에 따라 화물 이/적재부의 이동위치를 판단하고, 화물감 지부와 주변감지부로부터 화물정보와 주변정보를 전달받아 화물 이/적재부의 이동 거리, 아암 높이 또는 각도를 계산한 후 이동제어명령을 자율이동 제어부로 전달하고, 이어 아암제어명령을 아암 제어 부로 전달한다. 도7은 본 발명에 따른 지능형 무인 이/적재 시스템에 있어 자율이동 제어부를 도시한 블록 구성도이다. 도시된 바와 같이, 상기 자율이동 제어부는 이/적재 제어부로부터 이동제어명령을 전달받아 화물 이/ 적재부의 이동이 주변과 간섭없이 신속하게 이루어질 수 있도록 한 것으로 환경지도 작성부, 위치인 식부, 경로계획부 및 장애물 회피부를 포함한다. 상기 환경지도 작성부는 이/적재 제어부로부터 화물정보와 주변정보를 전달받고, 레이저 센서(221- 1)를 이용하여 반사되는 거리 및 각도를 계산하여 이동영역의 지도를 생성하고, 상기 위치인식부는 환경지 도 작성부에서 생성된 환경지도를 기반으로 레이저 스캔(222-1)을 통해 반사되는 시간에 따른 거리를 산출 하고, 카메라(222-2)를 이용하여 천장패턴에 변화를 감지하여 환경지도 내 현재 위치정보를 얻는다. 이때, 상기 환경지도 작성부는 생성된 지도에 대상 영역의 천장 이미지를 오버랩하여 오차율을 낮출 수 있고, 상기 위 치인식부는 환경지도 내 현재 위치정보에 비컨으로부터 수신되는 신호 세기의 차이 정보를 이용하여 위치 정보가 보정되도록 한다. 상기 경로계획부는 화물 이/적재부의 이동위치를 현재 위치를 기점으로 하고, 환경지도 내 지정된 위 치까지 이동경로를 생성하고, 상기 장애물 회피부는 화물 이/적재부가 생성된 이동경로를 따라 이동 하는 과정에서 동적 또는 정적 장애물이 나타나면 장애물 감지부(224-1)의 정보를 바탕으로 거리정보를 획득하 고, 인공전위계를 활용하여 장애물로부터 이격된다. 이때, 환경지도 내 지정된 위치까지 생성되는 이동경로는 딕스트라 알고리즘으로 생성되도록 하여 최적의 이동경로를 채택할 수 있게 된다. 상기 아암 제어부는 이/적재 제어부로부터 아암제어명령을 전달받아 아암 높이 및 각도를 제어하고, 상기 화물감지부는 화물의 위치 파악과 영상이 포함된 정보를 이/적재 제어부로 전달하고, 상기 주변 감지부는 주변 상황 파악과 영상이 포함된 정보가 이/적재 제어부로 전달될 수 있게 화물 이/적재부 에 구비된다. 한편, 상기 화물 이/적재부는 무선통신 수신부가 각각 구비되어 작업자가 가지고 있는 무선통신 송신 부(260')에서 추종신호가 발생되면 무선통신 수신부가 추종신호의 세기 또는 감지시간을 측정하여 거리를 추정하고, 이/적재 제어부를 경유하여 자율이동 제어부가 이동제어되어 작업자를 감응하여 추종한다. 이때, 상기 화물 이/적재부는 정형화물 이/적재부(200a)와 비정형화물 이/적재부(200b)가 조인트에 의하여 결합되거나 분리된 상태에서 각각 감응하여 추종하도록 하는 것이 바람직하다. 본 발명에 따른 지능형 무인 이/적재 시스템을 이용한 화물 이/적재 방법은 다음과 같다. 도8은 본 발명에 따른 지능형 무인 이/적재 시스템을 이용한 화물 이/적재를 도시한 순서도이다. 도시된 바와 같이, 화물 이/적재부의 정형화물 이/적재부(200a)와 비정형화물 이/적재부(200b)가 조인트 에 의하여 결합된 상태에서는 먼저, 센터서버에서 이/적제 제어부로 이동을 지시하는 단계 (S100)로 센터서버로부터 화물 위치와 수량 및 이/적재 순서에 따라 가용 가능한 화물 이/적재부의 이동을 지시한다. 이때, 센터서버는 가용 여부가 통신을 통하여 이루어진다. 즉, 센터서버에서 통신 을 이용하여 화물 이/적재 작업을 멈추고 있는 화물 이/적재부를 호출신호가 송신되면 각각의 화물 이/적 재의 이/적재 제어부가 호출신호를 수신하여 가용 여부를 센터서버로 송신하여 후속되는 작업이 이루어진다. 다음, 가용이 가능한 이/적재 재어부가 화물 이/적재부의 이동위치를 판단하고, 화물감지부와 주변감지부로부터 화물정보와 주변정보를 전달받아 화물 이/적재부의 이동 거리 또는 아암 높이를 계 산하고, 자율이동제어부로 이동제어명령을 전달하여 화물 이/적재부가 이동한다(S200). 이때, 자율이동 제어부는 이/적재 제어부로부터 화물정보와 주변정보를 전달받고, 레이저 센서(221- 1)를 이용하여 반사되는 거리 또는 각도를 계산하여 이동영역의 지도를 생성하는 환경지도 작성단계(S210)를 통 해 환경지도를 생성하고, 생성된 환경지도를 기반으로 레이저 스캔(222-1)을 통해 반사되는 시간에 따른 거리를 산출하고, 카메라(222-2)를 이용하여 천장패턴에 변화를 감지하여 환경지도 내 현재 위치정보를 얻는다(위치 인 식단계(S220)). 이어, 경로계획단계(S230)로 화물 이/적재부의 이동위치가 현재 위치를 기점으로 하고, 환경지도 내 지정 된 위치까지 이동경로를 생성한 후 화물 이/적재부가 생성된 이동경로를 따라 이동하는 과정에서 동적 또 는 정적 장애물이 나타나면 장애물 감지부(224-1)의 정보를 바탕으로 거리정보를 획득하고, 인공전위계를 활용 하여 장애물로부터 이격되는 장애물 회피단계(S240)를 통해 안정되며 신속한 주행을 통한 이동이 이루어진다. 다음, 화물을 로드 또는 언로드하는 단계(S300)로 화물감지부와 주변감지부로부터 화물정보를 전달받 고, 화물정보를 기반으로 아암제어부로 아암제어명령을 전달하여 아암 높이가 제어되어 화물을 로드 또는 언로드된다. 다음, 이/적재 제어부가 자율이동 제어부 및 아암제어부를 제어하여 화물의 로드 또는 언로드를 완료하는 단계(S400)로 마무리된다. 도9는 본 발명에 따른 지능형 무인 이/적재 시스템을 이용한 화물 이/적재에 있어 정형화물 이/적재를 도시한 순서도이다. 도시된 바와 같이, 화물 이/적재부의 정형화물 이/적재부(200a)와 비정형화물 이/적재부(200b)가 조인트 에 의하여 분리된 상태에서 화물의 이/적재 작업이 이루어지도록 하는 것으로 센터서버에서 이/적제 제어부로 이동을 지시하는 단계(S110)는 조인트에 의하여 정형화물 이/적재부(200a)와 비정형화물 이 /적재부(200b)가 결합되었을 경우와 동일한다. 먼저, 아암제어부에 의하여 로드 또는 언로드 되는 화물이 정형화물일 경우에는 센터서버로부터 정형 화물 위치와 수량 또는 이/적재 순서에 따라 가용 가능한 정형화물 이/적재부(200a)의 이동을 이/적재 제어부 로 지시한다. 이때, 센터서버로부터 쉬는 정형화물 이/적재부(200a)를 호출하는 단계(S111)와 쉬는 정형화물 이/적재부(200a)가 자기의 상태를 알리는 단계(S112)를 통해 가용 가능한 정형화물 이/적재부(200a)가 파악된 후 센터서버는 적재장소에 가까운 정형화물 이/적재부(200a)의 이동을 지시하는 단계(S113)로 이루 어진다. 이동과정에서 이/적재 제어부는 환경지도 작성단계(S210), 위치 인식단계(S220), 경로 계획단계 (S230), 장애물 회피단계(S240)를 통해 얻어진 정보를 기반으로 정형화물이 있는 곳으로 이동한다. 이후, 정형화물 이/적재부(200a)는 정형화물이 있는 곳으로 이동한 후 감지센서에 의하여 감지된 정형화물 유무가 이/적제 제어부에 의하여 센터서버로 전송되는 단계(S121)를 경유한 후 아암제어명령을 아암 제어부로 전달하여 아암 구동부(214a)가 구동(S130) 된다. 이때, 이/적재 가이더(213a)에 구비된 화물감지 부에 의하여 화물위치와 영상이 포함된 정보가 이/적재 제어부로 전달되고, 정형 이/적재 프레임 (210a)에 구비된 주변감지부가 감지된 주변영상이 이/적재 제어부로 전달되는 위치정보와 주변정보를 바탕으로 아암 구동부(214a)가 구동된다. 그리고 아암(212a)이 결합된 이/적재 가이더(213a)가 리프트레일(211a)을 따라 상,하로 리프트되는 가운데 정 형화물의 이/적재 작업이 이루어진다(S140). 도10은 본 발명에 따른 지능형 무인 이/적재 시스템을 이용한 화물 이/적재에 있어 비정형화물 이/적재를 도시 한 순서도이다. 도시된 바와 같이, 화물 이/적재부의 정형화물 이/적재부(200a)와 비정형화물 이/적재부(200b)가 조인트 에 의하여 분리된 상태에서 화물의 이/적재 작업이 이루어지도록 하는 것으로 센터서버에서 이/적제제어부로 이동을 지시하는 단계(S110')는 조인트에 의하여 정형화물 이/적재부(200a)와 비정형화물 이/적재부(200b)가 결합되었을 경우와 동일한다. 먼저, 이/적재 제어부로 지시하는 단계(S110')로 센터서버로부터 비정형화물 위치와 수량 또는 이/적 재 순서에 따라 가용 가능한 비정형화물 이/적재부(200b)의 이동을 각각 지시하고, 지시받은 이/적재 제어부 는 상기와 같은 환경지도 작성단계(S210), 위치 인식단계(S220), 경로계획단계(S230), 장애물 회피단계 (S240)를 통해 얻어진 정보를 기반으로 비정형 화물이 있는 곳으로 각각 이동한다(S120'). 이때, 가용 가능한 비형화물 이/적재부(200b)의 이동은 센터서버로부터 쉬는 비정형화물 이/적재부(200b)를 호출하는 단계 (S111')와 쉬는 비정형화물 이/적재부(200b)가 자기의 상태를 알리는 단계(S112') 및 센터서버는 적재장소 에 가까운 비정형화물 이/적재부(200b)의 이동을 지시하는 단계(S113')를 통해 이루어진다. 다음, 비정형 이/적재 프레임(210b)에 구비된 화물감지부에 의하여 화물위치와 영상이 포함된 정보가 이/ 적재 제어부를 통해 센터서버로 전송(S121')된 후 비정형 이/적재 프레임(210b)에 구비된 주변감지부 의 주변영상이 이/적재 제어부로 전달되는 위치정보와 주변정보를 바탕으로 아암제어명령을 아암제어 부로 전달하고, 아암 구동부(214b)에 의하여 아암(212b)이 구동되는 단계(S130')를 통해 비정형 화물의 이 /적재가 이루어진다. 이때, 비정형화물이 있는 곳으로 이동한 후 감지센서에 의하여 감지된 비정형화물 유 무가 이/적제 제어부에 의하여 센터서버로 전송(S121')되고, 비정형화물이 있을 경우, 센터서버(10 0)는 정형화물 이/적재부(200a)를 비정형화물 이/적재부(200b)가 있는 곳으로 이동을 지시한다. 다음, 아암 구동부(214b)에 의하여 이/적재 아암 가이더(231b)의 아암(212b)이 비정형 화물을 흡착하여 로드하 고, 이어 대기중인 정형 이/적재 프레임(210a)의 적재부(217a)에 언로드되는 작업이 이루어진다. 본 발명에서는 비정형 화물 또는 정형 화물에 각각 정형화물 이/적재부(200a) 또는 비정형화물 이/적재부(200 b)가 이동되어 이/적재 작업이 이루어지도록 하였으나, 이러한 형태 이외에 비정형화물이 있는 곳으로 이동된 비정형화물 이/적재부에 센터서버로부터 다수개의 정형화물 이/적재부(200a)가 이동되어 비정형화물 이/적 재가 이루어지도록 하는 것이 바람직하다. 또한, 비정형화물이 있는 곳으로 이동된 다수개의 비정형화물 이/적재부(200b)에 센터서버로부터 다수개의 정형화물 이/적재부(200a)가 이동되어 비정형화물의 이/적재가 이루어지도록 하는 것이 바람직하다."}
{"patent_id": "10-2014-0158551", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도1은 본 발명에 따른 지능형 무인 이/적재 시스템을 도시한 구성도. 도2는 본 발명에 따른 지능형 무인 이/적재 시스템에 있어 화물 이/적재부가 정형화물 이/적재부 및 비정형화물 이/적재부로 구비된 상태를 도시한 예시도. 도3은 본 발명에 따른 지능형 무인 이/적재 시스템에 있어 화물 이/적재부인 정형화물 이/적재부와 비정형화물 이/적재부가 결합된 상태를 도시한 사시도. 도4는 본 발명에 따른 지능형 무인 이/적재 시스템에 있어 화물 이/적재부인 정형화물 이/적재부와 비정형화물 이/적재부가 분리된 상태를 도시한 사시도. 도5는 본 발명에 따른 지능형 무인 이/적재 시스템에 있어 화물 이/적재부인 정형화물 이/적재부와 비정형화물 이/적재부의 조인트부를 도시한 사시도. 도6은 본 발명에 따른 지능형 무인 이/적재 시스템에 있어 화물 이/적재부인 정형화물 이/적재부와 비정형화물 이/적재부가 결합된 상태를 도시한 예시도. 도7은 본 발명에 따른 지능형 무인 이/적재 시스템에 있어 자율이동 제어부를 도시한 블록 구성도. 도8은 본 발명에 따른 지능형 무인 이/적재 시스템을 이용한 화물 이/적재를 도시한 순서도. 도9는 본 발명에 따른 지능형 무인 이/적재 시스템을 이용한 화물 이/적재에 있어 정형화물 이/적재를 도시한 순서도. 도10은 본 발명에 따른 지능형 무인 이/적재 시스템을 이용한 화물 이/적재에 있어 비정형화물 이/적재를 도시한 순서도."}
