{"patent_id": "10-2022-0030872", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0133644", "출원번호": "10-2022-0030872", "발명의 명칭": "소비자 전문 리뷰 빅데이터 학습에 기반한 상품 구매 서비스 제공 시스템", "출원인": "주식회사 퀸즈코퍼레이션", "발명자": "정하용"}}
{"patent_id": "10-2022-0030872", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "상품 구매 서비스 제공 시스템으로서,상품 구매 서비스 제공 장치; 및상기 상품 구매 서비스 제공 장치와 연동되어 상기 상품 구매 서비스 제공 장치의 동작 제어를 위한 제어 신호를 사용자로부터 입력받아 제공하는 사용자 단말을 포함하되,상기 상품 구매 서비스 제공 장치는,웹 사이트들로부터 수집된 상품에 대한 리뷰들을 통합적으로 관리하는 리뷰 정보 제공부;사용자가 구매를 희망하는 구매 희망 상품에 대한 상품 검색어를 사용자 단말로부터 입력받는 검색어 입력부;및상기 사용자 단말로부터 상기 상품 검색어에 대한 리뷰 정보 제공 요청이 이루어진 경우, 상기 상품 검색어에대응하는 리뷰 정보가 상기 사용자 단말의 화면에 표시되도록 제어하는 제어부를 포함하고,상기 리뷰 정보는, 상기 리뷰 정보 제공부에 의해 관리되는 리뷰 정보들 중 적어도 일부의 정보로서, 복수의 판매 채널들 중 어느 하나의 판매 채널로부터 제공되는 정보이고,상기 제어부는, 상기 화면의 일영역에 표시된 구매 추이 제공 메뉴에 대한 사용자 입력이 이루어진 경우, 상기리뷰 정보와 관련하여 기 설정된 기간별 구매 건수에 대한 그래프 정보를 제공하는 것인, 상품 구매 서비스 제공 시스템."}
{"patent_id": "10-2022-0030872", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제어부는,상기 사용자 단말로부터 상기 구매 희망 상품에 대한 상품 유형 정보가 더 입력된 경우 상품 유형 정보별로 구매 추이 관련 리뷰 정보를 제공하는 것인, 상품 구매 서비스 제공 시스템."}
{"patent_id": "10-2022-0030872", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 제어부는,상기 사용자가 상기 어느 하나의 판매 채널에 접속한 것으로 감지된 경우, 구매 희망 상품의 상세정보를 포함한구매 희망 상품 관련 상품 판매 페이지가 상기 화면에 표시되도록 제어하되,상기 화면의 일영역에 상기 상세정보 내 키워드 검색을 위한 키워드 검색 아이콘을 표시하는 것인, 상품 구매서비스 제공 시스템."}
{"patent_id": "10-2022-0030872", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 제어부는,상기 화면의 일영역에 표시된 실감 정보 제공 메뉴에 대한 사용자 입력이 이루어진 경우, 상기 구매 희망 상품에 대응하는 상품 실감 정보가 사용자에게 제공되도록 전방표시장치의 동작을 제어하는 것인, 상품 구매 서비스제공 시스템.공개특허 10-2023-0133644-3-청구항 5 제1항에 있어서,상기 상품 구매 서비스 제공 장치는,사용자의 신체 특성 정보를 고려하여 생성된 아바타에 상기 구매 희망 상품을 착용시킴으로써 상기 구매 희망상품에 대한 착용 시뮬레이션을 수행하는 시뮬레이션부,를 더 포함하는 상품 구매 서비스 제공 시스템."}
{"patent_id": "10-2022-0030872", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "상품 구매 서비스 제공 시스템에 관한 것이며, 상품 구매 서비스 제공 시스템은 상품 구매 서비스 제공 장치 및 사용자 단말을 포함할 수 있다. 상기 상품 구매 서비스 제공 장치는, 웹 사이트들로부터 수집된 상품에 대한 리 뷰들을 통합적으로 관리하는 리뷰 정보 제공부; 사용자가 구매를 희망하는 구매 희망 상품에 대한 상품 검색어를 (뒷면에 계속)"}
{"patent_id": "10-2022-0030872", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본원은 상품 구매 서비스 제공 시스템에 관한 것이다."}
{"patent_id": "10-2022-0030872", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "온라인 쇼핑을 통한 상품 구매는 오프라인 쇼핑을 통한 상품 구매에 비해 상품 구매에 소요되는 시간을 절약하 고 공간적인 제약을 극복할 수 있다. 이러한 온라인 쇼핑의 이점과 함께 스마트 폰이 대중화됨에 따라, 온라인 쇼핑을 통해 원하는 상품을 구매하려는 수요가 급격하게 늘어나고 있다. 온라인으로 쇼핑하려는 구매자들은 다른 사용자들의 온라인 상 구매 후기 또는 사용 후기와 같은 리뷰(review) 들을 통해 자신이 구입하길 원하는 상품에 대한 정보를 습득하는 것이 일반적이다. 따라서, 상품에 대한 리뷰들 은 온라인 쇼핑이 실제 구매로 이어지는 데 큰 영향을 미친다고 할 수 있다. 이러한 이유에서, 상품 판매자들도 직접 홍보 또는 인플루언서를 활용한 리뷰 등과 같이, 온라인 상의 다양한 경로를 통해 자신들이 판매하는 상품에 대해 홍보하고 있다. 상품에 대한 리뷰들을 접할 수 있는 채널들은 포털 사이트, e-커머스 판매 사이트, SNS 등과 같이 다양하며, 상 품에 대한 리뷰들은 이 다양한 채널들에 산재되어 있다. 따라서, 구매자들이 상품에 대한 정보를 온라인 상에서 습득하기 위해서는 직접 다양한 웹 사이트에 일일이 접속하고, 해당 웹 사이트에서 구매하고자 하는 상품의 명 칭을 검색하여 해당 상품에 대한 리뷰를 접해야 하므로, 많은 시간이 소요된다고 할 수 있다. 상품 판매자들도 다양한 채널들 각각에 상품을 마케팅해야 하므로, 많은 비용이 소요된다고 할 수 있다. 따라서, 상품에 대한 리 뷰들을 통합적으로 관리하고 제공하는 단일화된 경로 또는 채널이 요구된다. 뿐만 아니라, 다양한 채널들에 산재되어 있는 리뷰들은 그 정확성이 담보되어 있다고 보기 어려우며, 구매에 유 용한 정보가 포함되어 있다고 보기도 어렵다고 할 수 있다. 이는 인플루언서 마케팅이나 리뷰들은 실제 상품을 구매하여 사용한 사람들이 작성할 수도 있으나, 상품 판매자나 상품 판매자로부터 의뢰받은 마케팅 업체 또는 인플루언서들이 리뷰들을 작성할 수 있기 때문이라고 할 수 있다. 이에 따라, 상품에 대한 리뷰들의 정확성 및 구매에 유용한 정보가 포함되어 있는지 여부를 판단할 수 있는 방법도 요구된다. 또한, 종래에 각 채널을 통해 제공되는 리뷰들은 대부분 다수의 사람들이 올린 리뷰들을 단순히 최신순, 랭킹순 등을 기준으로 하여 목록 형태로 제공할 뿐이어서, 구매자가 구매하고자 하는 상품에 대한 트렌드(유행, 추세, 경향), 선호도 등을 직관적으로 파악하는 데에 어려움이 있다. 또한, 일반적으로 구매자들은 온라인으로 상품을 구매하고자 할 때 상품을 판매하는 웹 사이트 상에서 제공되는 리뷰 정보나 상품 상세설명 정보를 보고 원하는 상품의 구매 여부를 결정하게 되는데, 이때, 상품 상세설명 정 보에는 판매되는 상품과 관련하여 각종 정보(일예로, 상품의 사진 이미지, 상품의 사이즈 정보나 소재 정보, 전 성분 정보, 판매자 정보, 주의사항 정보, 배송안내 정보, 교환/반품 절차 관련 안내 정보, 유의사항 정보, 공지 사항 정보, 인체적용실험 테스트 관련 정보, 상품의 효능/효과 분석 관련 연구 정보 등)가 포함되어 있기 마련 이다. 그런데, 이러한 상품 상세설명 정보 내 각종 정보는 그 양이 방대하고 대부분 검색이 불가능한 이미지 형태로 제공됨에 따라, 구매자가 해당 상품 상세설명 정보 내에서 원하는 정보(일예로, 치수 정보, 성분 정보, 교환 방 법 등)를 찾기 위해서는 여러 번의 스크롤링(scrolling)을 통해 각종 정보들을 일일이 읽어가면서 원하는 정보 가 표시된 위치를 직접 찾아야 했고, 이에 따라 원하는 정보를 찾는 데에 오랜 시간이 소요되는 문제가 있었다.본원의 배경이 되는 기술은 한국공개특허공보 제10-2012-0013014호에 개시되어 있다."}
{"patent_id": "10-2022-0030872", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본원은 전술한 종래 기술의 문제점을 해결하기 위한 것으로서, 상품에 대한 리뷰들을 통합적으로 관리하고 제공 할 수 있는 상품 구매 서비스 제공 시스템, 장치 및 방법을 제공하려는 것을 목적으로 한다. 본원은 전술한 종래 기술의 문제점을 해결하기 위한 것으로서, 리뷰들의 정확성과 구매에 유용 한 정보의 포함 여부에 대한 판단이 가능하도록 하는 상품 구매 서비스 제공 시스템, 장치 및 방법을 제공하려는 것을 목적으로 한다. 본원은 전술한 종래 기술의 문제점을 해결하기 위한 것으로서, 구매자가 구매하고자 하는 상품에 대한 트렌드 (유행, 추세, 경향), 선호도 등을 직관적으로 파악할 수 있도록 하는 상품 구매 서비스 제공 시스템, 장치 및 방법을 제공하려는 것을 목적으로 한다. 본원은 전술한 종래 기술의 문제점을 해결하기 위한 것으로서, 웹 사이트 상에서 제공되는 상품 상세설명 정보 내 각종 정보들 중에서 사용자(구매자)가 찾고자 하는 정보를 보다 쉽고 빠르게 찾을 수 있도록 하는 상품 구매 서비스 제공 시스템, 장치 및 방법을 제공하려는 것을 목적으로 한다. 다만, 본원의 실시예가 이루고자 하는 기술적 과제는 상기된 바와 같은 기술적 과제들로 한정되지 않으며, 또 다른 기술적 과제들이 존재할 수 있다."}
{"patent_id": "10-2022-0030872", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본원의 일 실시예에 따른 상품 구매 서비스 제공 시스 템은 상품 구매 서비스 제공 장치; 및 상기 상품 구매 서비스 제공 장치와 연동되어 상기 상품 구매 서비스 제 공 장치의 동작 제어를 위한 제어 신호를 사용자로부터 입력받아 제공하는 사용자 단말을 포함할 수 있다. 여기서, 상품 구매 서비스 제공 장치는, 웹 사이트들로부터 수집된 상품에 대한 리뷰들을 통합적으로 관리하는 리뷰 정보 제공부; 사용자가 구매를 희망하는 구매 희망 상품에 대한 상품 검색어를 사용자 단말로부터 입력받 는 검색어 입력부; 및 상기 사용자 단말로부터 상기 상품 검색어에 대한 리뷰 정보 제공 요청이 이루어진 경우, 상기 상품 검색어에 대응하는 리뷰 정보가 상기 사용자 단말의 화면에 표시되도록 제어하는 제어부를 포함할 수 있다. 또한, 상기 리뷰 정보는, 상기 리뷰 정보 제공부에 의해 관리되는 리뷰 정보들 중 적어도 일부의 정보로서, 복 수의 판매 채널들 중 어느 하나의 판매 채널로부터 제공되는 정보이고, 상기 제어부는, 상기 화면의 일영역에 표시된 구매 추이 제공 메뉴에 대한 사용자 입력이 이루어진 경우, 상기 리뷰 정보와 관련하여 기 설정된 기간 별 구매 건수에 대한 그래프 정보를 제공할 수 있다. 또한, 상기 제어부는, 상기 사용자 단말로부터 상기 구매 희망 상품에 대한 상품 유형 정보가 더 입력된 경우 상기 상품 유형 정보별로 구매 추이 관련 리뷰 정보를 제공할 수 있다. 또한, 상기 제어부는, 상기 사용자가 상기 어느 하나의 판매 채널에 접속한 것으로 감지된 경우, 구매 희망 상 품의 상세정보를 포함한 구매 희망 상품 관련 상품 판매 페이지가 상기 화면에 표시되도록 제어하되, 상기 화면 의 일영역에 상기 상세정보 내 키워드 검색을 위한 키워드 검색 아이콘을 표시할 수 있다. 또한, 상기 제어부는, 상기 키워드 검색 아이콘 내 키워드 입력부에 대한 사용자의 클릭 입력이 이루어진 경우, 상기 상세정보 내 설명 데이터의 글자 인식이 가능하도록 상기 상세정보에 대응하는 페이지에 대하여 글자 인식 처리를 수행하고, 상기 키워드 입력부를 통해 키워드가 입력된 경우, 글자 인식 처리된 설명 데이터 중 상기 입 력된 키워드와 매칭되는 데이터를 매칭 키워드 데이터로서 검색하여 상기 화면 상에 노출되도록 제어할 수 있다. 또한, 상기 제어부는, 상기 키워드가 입력된 경우 상기 글자 인식 처리된 설명 데이터 내 상기 입력된 키워드의 유의어가 존재하는지 검색하고, 검색 결과 상기 유의어가 존재하는 경우 상기 키워드 검색 아이콘의 유의어 표 시부 내에 검색된 유의어의 리스트를 표시하고, 상기 표시된 유의어의 리스트 중 사용자에 의해 선택된 유의어 를 고려하여 상기 매칭 키워드 데이터에 대한 재검색을 수행할 수 있다.또한, 상기 제어부는, 상기 화면의 일영역에 표시된 실감 정보 제공 메뉴에 대한 사용자 입력이 이루어진 경우, 상기 구매 희망 상품에 대응하는 상품 실감 정보가 사용자에게 제공되도록 전방표시장치의 동작을 제어할 수 있 다. 또한, 본원의 일 실시예에 따른 상품 구매 서비스 제공 장치는, 사용자의 신체 특성 정보를 고려하여 생성된 아 바타에 상기 구매 희망 상품을 착용시킴으로써 상기 구매 희망 상품에 대한 착용 시뮬레이션을 수행하는 시뮬레 이션부를 더 포함할 수 있다. 한편, 본원의 일 실시예에 따른 상품 구매 서비스 제공 방법은, 리뷰 정보 제공부에서, 웹 사이트들로부터 수집 된 상품에 대한 리뷰들을 통합적으로 관리하는 단계; 검색어 입력부에서, 사용자가 구매를 희망하는 구매 희망 상품에 대한 상품 검색어를 사용자 단말로부터 입력받는 단계; 및 제어부에서, 상기 사용자 단말로부터 상기 상 품 검색어에 대한 리뷰 정보 제공 요청이 이루어진 경우, 상기 상품 검색어에 대응하는 리뷰 정보가 상기 사용 자 단말의 화면에 표시되도록 제어하는 단계를 포함할 수 있다. 상술한 과제 해결 수단은 단지 예시적인 것으로서, 본원을 제한하려는 의도로 해석되지 않아야 한다. 상술한 예 시적인 실시예 외에도, 도면 및 발명의 상세한 설명에 추가적인 실시예가 존재할 수 있다."}
{"patent_id": "10-2022-0030872", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본원의 과제 해결 수단에 의하면, 리뷰 정보 제공부를 통해 복수의 채널들(복수의 웹 사이트들)에 산재 되어 있는 상품에 대한 리뷰들을 통합적으로 관리하고 제공할 수 있는바, 리뷰의 검색 및 제공에 대한 시간 효 율성과 비용 효율성을 향상시킬 수 있다. 전술한 본원의 과제 해결 수단에 의하면, 리뷰 정보 제공부를 통해 구매에 유용한 정보를 포함하고 있는 리뷰를 선별하여 제공할 수 있는바(즉, 구매에 유용한 정보의 포함 여부를 판단할 수 있는바), 리뷰들의 정확성을 담보 할 수 있고 사용자 편의성을 향상시킬 수 있다. 전술한 본원의 과제 해결 수단에 의하면, 기 설정된 기간별 구매 건수에 대한 그래프 정보를 제공함으로써, 사 용자가 구매 희망 상품에 대한 트렌드(유행, 추세, 경향), 타 사용자들의 선호도 등을 보다 직관적으로 파악 가 능하도록 하고, 이를 통해 해당 상품에 대한 구매 결정에 도움 줄 수 있다. 전술한 본원의 과제 해결 수단에 의하면, 키워드 검색 아이콘을 제공함으로써, 웹 사이트 상에서 제공되는 상품 상세설명 정보 내 각종 정보들 중에서 사용자(구매자)가 찾고자 하는 정보를 보다 쉽고 빠르게 찾을 수 있도록 제공할 수 있다. 다만, 본원에서 얻을 수 있는 효과는 상기된 바와 같은 효과들로 한정되지 않으며, 또 다른 효과들이 존재할 수 있다."}
{"patent_id": "10-2022-0030872", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본원이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본원의 실시예를 상세히 설명한다. 그러나 본원은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본원을 명확하게 설명하기 위해서 설명과 관계없는 부분 은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 본원 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\" 또는 \"간접적으로 연결\"되어 있는 경우 도 포함한다. 본원 명세서 전체에서, 어떤 부재가 다른 부재 \"상에\", \"상부에\", \"상단에\", \"하에\", \"하부에\", \"하단에\" 위치 하고 있다고 할 때, 이는 어떤 부재가 다른 부재에 접해 있는 경우뿐 아니라 두 부재 사이에 또 다른 부재가 존 재하는 경우도 포함한다. 본원 명세서 전체에서, 어떤 부분이 어떤 구성 요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성 요소를 제외하는 것이 아니라 다른 구성 요소를 더 포함할 수 있는 것을 의미한다. 도 1은 본원의 일 실시예에 따른 상품 구매 서비스 제공 시스템의 개략적인 구성을 나타낸 도면이다. 이하에서는 본원의 일 실시예에 따른 상품 구매 서비스 제공 시스템을 설명의 편의상 본 시스템라 하기로 한다. 도 1을 참조하면, 본 시스템은 상품 구매 서비스 제공 장치, 사용자 단말 및 전방표시장치를 포 함할 수 있다. 상품 구매 서비스 제공 장치는 본원의 일 실시예에 따른 상품 구매 서비스 제공 장치로서, 이하에서는 설명의 편의상 본 장치라 하기로 한다. 본 시스템 내 각 구성들(즉, 본 장치, 사용자 단말, 전방표시장치) 간에는 서로 네트워크를 통해 연동 되어 데이터를 송수신할 수 있다. 네트워크는 일예로 3GPP(3rd Generation Partnership Project) 네트워크, LTE(Long Term Evolution) 네트워 크, WIMAX(World Interoperability for Microwave Access) 네트워크, 인터넷(Internet), LAN(Local Area Network), Wireless LAN(Wireless Local Area Network), WAN(Wide Area Network), PAN(Personal Area Network), 블루투스(Bluetooth) 네트워크, NFC(Near Field Communication) 네트워크, 위성 방송 네트워크, 아 날로그 방송 네트워크, DMB(Digital Multimedia Broadcasting) 네트워크 등을 포함할 수 있으나, 이에 한정된 것은 아니고, 다양한 유/무선 통신 네트워크를 포함할 수 있다. 사용자 단말은 사용자가 소지한 단말을 의미할 수 있다. 사용자 단말은 일예로 PCS(Personal Communication System), GSM(Global System for Mobile communication), PDC(Personal Digital Cellular),PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(WCode Division Multiple Access), Wibro(Wireless Broadband Internet) 단말, 스마트폰(Smartphone), 스마트패드(SmartPad), 태블릿 PC, 노트북, 웨어러블 디바이스, 데스크탑 PC 등과 같은 모든 종류의 유무선 통신 장치를 포함할 수 있으며, 이 에 한정되는 것은 아니다. 전방표시장치(Head Up Display, HUD)는 일예로 사용자가 소지한 장치일 수 있다. 전방표시장치는 일예로 사용자 단말 내에 마련될 수 있으나 이에만 한정되는 것은 아니고, 다른 일예로 사용자 단말과는 별도로 마련될 수 있다. 전방표시장치는 빔(beam) 조사를 통해 전방표시장치의 전방에(혹은 전방의 공중에, 전방 의 상공에) 후술하여 설명하는 상품 실감 정보를 제공할 수 있다. 이에 대한 설명은 후술하여 보다 자세히 설명 하기로 한다. 본 장치는 온라인 상의 상품의 구매를 희망하는 사용자(혹은 사용자가 소지한 사용자 단말)가 보다 효율적으 로 상품을 구매할 수 있도록 하는 서비스를 제공할 수 있다. 본 장치는 일예로 사용자 단말에 포함된 장치의 형태로 마련될 수 있다. 이러한 경우, 본 장치는 사용 자 단말에 설치되는 프로그램 또는 애플리케이션(어플, 앱)의 형태로 구현 가능한 장치일 수 있다. 달리 말 해, 본 장치를 통해 제공되는 상품 구매 서비스 제공 방법은 일예로 프로그램 또는 애플리케이션의 형태로 구현되어 단말을 통해 사용자에게 제공될 수 있다. 다만, 이에 한정되는 것은 아니고, 다른 일예로 본 장치 는 사용자 단말과 데이터 송수신이 가능한 서버의 형태로 마련될 수 있다. 서버의 형태로 마련된 본 장치 는, 본 장치에 의해 제공되는 애플리케이션에 접속한 사용자들의 단말의 화면 표시를 제어할 수 있다. 본 원에서는 본 장치가 일예로 서버의 형태로 마련되는 것을 예로 들어 설명하기로 한다. 또한, 본원에서 본 장치에 의해 제공되는 애플리케이션(어플, 앱)은 이하 설명의 편의상 본 앱이라 하기로 한다. 이에 따르면, 본 장치는 본 앱을 설치한 사용자들의 단말의 동작(일예로 화면 표시 동작 등)을 제어할 수 있다. 본 장치에 대한 보다 구체적인 설명은 다음과 같다. 본 장치는 리뷰 정보 제공부, 검색어 입력부, 제어부 및 시뮬레이션부를 포함할 수 있 다. 리뷰 정보 제공부는 웹 사이트들로부터 수집된 상품에 대한 리뷰들을 통합적으로 관리하고 제공할 수 있다. 즉, 리뷰 정보 제공부는 복수의 채널들(복수의 웹 사이트들)에 산재되어 있는 상품에 대한 리뷰들을 통합적으로 관리하고 제공할 수 있다. 리뷰 정보 제공부에 대한 설명은 이하 도 2 내지 도 4, 도 5a, 도 5b, 도 6a 및 도 6b를 참조하여 보다 쉽게 이해될 수 있다. 도 2는 본원의 일 실시예에 따른 상품 구매 서비스 제공 장치 내 리뷰 정보 제공부를 설명하기 위한 도 면이다. 도 3은 본원의 일 실시예에 따른 상품 구매 서비스 제공 장치 내 리뷰 정보 제공부에 의해 리 뷰 정보를 제공하는 방법을 설명하기 위한 도면이다. 도 1 내지 도 3을 참조하면, 웹 사이트들에는 다양한 상품들에 대한 다양한 정보들이 존재할 수 있다. 상품들에 대한 정보에는 해당 상품의 (분류) 카테고리 및 해당 상품의 명칭 (상품명)이 포함될 수 있다. 웹 사이트들에는 다양한 상품들에 대한 다양한 리뷰들이 존재할 수 있다. 웹 사이트의 운영자 또는 제3자(상품의 구매자 또는 판매자)가 상품들에 대한 정보와 리뷰들을 등록할 수 있다 면, 그 지칭되는 명칭에 구애받지 않고 본 명세서에서 언급하는 웹 사이트에 해당할 수 있다. 예를 들어, 포털 사이트, YouTube와 같은 동영상 공유 사이트, 인스타그램과 같은 SNS 사이트, 블로그 등이 웹 사이트에 해당할 수 있다. 웹 사이트에는 다양한 형태의 상품들에 대한 정보와 리뷰들이 존재할 수 있다. 예를 들어, 동영상, 사진, 텍스 트 등이 상품들에 대한 정보와 리뷰들의 한 형태로서 웹 사이트에 등록되고 저장될 수 있다. 또한, 동영상, 사 진, 텍스트 중에서 하나 이상이 결합된 형태로 상품들에 대한 정보와 리뷰들이 웹 사이트에 등록되고 저장될 수 있다. 판매 채널은 구매자들이 상품에 대한 정보와 리뷰에 기반하여 상품 구매를 수행하고자 하는 웹 사이트에 해당할 수 있다. 예를 들어, 쿠팡, 11번가, 옥션 등과 같은 온라인 커머스 업체들의 웹 사이트가 본 명세서에서 언급되 는 판매 채널에 해당할 수 있다. 리뷰 정보 제공부는 다양한 웹 사이트들에 산재되어 있는 다양한 상품들에 대한 정보와 다양한 리뷰들을 유/무선 통신을 통하여 웹 사이트들로부터 수집하고, 이를 통합적으로 관리할 수 있다. 여기서, 다양한 상품들 에 대한 정보와 다양한 리뷰들은 '상품 정보'일 수 있다. 또한, 리뷰 정보 제공부는 통합적으로 관리되는 리뷰들 중에서 판매 채널로부터 요청된 상품에 대한 리뷰 를 유/무선 통신을 통하여 해당 판매 채널에 제공할 수 있다. 여기서, 판매 채널에 제공되는 리뷰는 '리뷰 정보'일 수 있다. 리뷰 정보 제공부는 프로세서, 메모리 및 통신부를 포함할 수 있다. 또한, 리뷰 정보 제공 부는 일예로 도 5b에 도시된 특징 분석 딥 러닝 (알고리즘) 모델을 더 포함하여 구성되거나, 도 6b에 도시된 리뷰 평가 딥 러닝 (알고리즘) 모델을 더 포함하여 구성될 수 있다. 통신부는 웹 사이트들 및 판매 채널들과의 유무선 통신을 수행할 수 있다. 예를 들어, 하나 이상의 상품 정보들이 통신부를 통해 웹 사이트들로부터 리뷰 정보 제공부으로 전송될 수 있다. 또한, 판매 채널 들로부터 요청된 상품(대상 상품)에 대한 리뷰 정보들이 통신부를 통해 리뷰 정보 제공부으로부터 판 매 채널들로 전송될 수 있다. 메모리에는 상품에 대한 리뷰들을 제공하기 위한 하나 이상의 프로그램들(하나 이상의 명령어들)이 저장될 수 있다. 또한, 메모리에는 웹 사이트들로부터 수집된 상품 정보들과 이 상품정보들을 이용하여 생성된 리 뷰 컨텐츠들이 저장될 수 있다. 리뷰 컨텐츠는 특정 상품과 이 특정 상품에 대한 하나 이상의 리뷰 정보들이 매 칭되어 생성될 수 있다. 프로세서는 메모리에 저장된 프로그램을 실행시켜 아래와 같은 동작들을 수행할 수 있다. 먼저, 프로세서는 하나 이상의 상품 정보들을 웹 사이트들로부터 수집할 수 있다(S310). 수집되는 상품 정 보에는 하나 이상의 상품들에 대한 정보와 해당 상품들 각각에 대한 하나 이상의 리뷰 정보들이 포함될 수 있다. 또한, 상품들에 대한 정보에는 해당 상품에 대한 분류 카테고리와 명칭(상품명)이 포함될 수 있다. 상품 정보들이 수집되면, 프로세서는 상품들 각각에 대응되는 하나 이상의 리뷰 정보들을 선별할 수 있다 (S320). 특정 상품에 대응되는 것으로 선별된 리뷰 정보들은 해당 상품에 대한 리뷰 또는 해당 상품에 대해 작 성된 리뷰를 의미할 수 있다. 따라서, S320 과정은 많은 수의 리뷰들을 상품의 동일성을 기준으로 하여 정렬 또 는 분배하는 것으로 이해될 수 있다. 리뷰 정보들이 선별되면, 프로세서는 상품들 및 선별된 리뷰 정보들을 서로 매칭시켜, 상품들에 대한 하나 이상의 리뷰 컨텐츠들을 생성할 수 있다(S330). 하나의 상품에 대한 리뷰 정보들이 다양한 웹 사이트들에 산재되어 있을 수 있으며, 하나의 웹 사이트에서도 하 나의 상품에 대해 복수 개의 리뷰 정보들이 존재할 수 있다. 따라서, 프로세서는 다양한 웹 사이트들로부 터 수집된 A 상품에 대한 리뷰 정보들과 하나의 웹 사이트에서 수집된 A 상품에 대한 복수 개의 리뷰 정보들을 A 상품에 매칭시킴으로써, 매우 많은 수의 리뷰 정보들을 상품을 기준으로 하여 정렬시킬 수 있다. 프로세서는 생성된 리뷰 컨텐츠들이 메모리에 저장되도록 제어할 수 있다. 또한, 프로세서는 판 매 채널들로부터 요청된 대상 상품에 대한 하나 이상의 리뷰 정보들을 상품을 기준으로 하여 선별하고, 선별된 리뷰 정보들을 판매 채널들로 제공할 수 있다(S340). 실시형태에 따라, 프로세서는 일예로 선별된 리뷰 정보들을 설치형 API(application programming interface) 형태로 변환하고, 이를 판매 채널들로 제공할 수 있다. 이와 같이, 본 장치는 리뷰 정보 제공부를 통해 다양한 웹 사이트들에 산재되어 있는 많은 수의 리뷰들 을 통합적으로 관리하고, 요청에 대응되는 리뷰들을 제공할 수 있다. 이러한 본 장치는 리뷰 정보 제공부 를 통해 리뷰의 검색 및 제공에 대한 시간 효율성과 비용 효율성을 향상시킬 수 있다. 도 4는 본원의 일 실시예에 따른 상품 구매 서비스 제공 장치 내 리뷰 정보 제공부에 의해 상품 정보를 수집하는 방법의 일 예를 설명하기 위한 도면이다. 도 4를 참조하면, 앞서 설명된 바와 같이, 프로세서는 다양한 웹 사이트들에 산재되어 있는 많은 수의 상 품 정보들을 웹 사이트들로부터 수집할 수 있다. 상품 정보들을 수집하는 방법은 리뷰 정보 제공부의 관리자 또 는 관리자로부터 상품 정보 수집을 요청받은 제3자 등이 직접 웹 사이트들에 접속하여 상품 정보들을 수집하는 방법과, 프로세서의 명령에 따라 자동화된 프로세싱을 통해 상품 정보들을 수집하는 방법이 모두 가능할 수 있다. 자동화된 프로세싱을 통해 상품 정보들을 수집하는 방법은 웹 크롤링(web crawling) 또는 웹 스크래핑(web scarping)이라 할 수 있다. 웹 크롤링 또는 웹 스크래핑이란 소프트웨어 기술을 이용하여 웹 사이트로부터 원하 는 정보를 추출 또는 수집하는 기술을 의미한다. 자동화된 프로세싱을 통해 상품 정보들을 수집하는 방법은 관리자 등에 의한 수집 방법에 비해 정확성, 시간 효 율성 및 비용 효율성 측면에서 더욱 향상된 방법이라 할 수 있다. 따라서, 리뷰 정보 제공부는 자동화된 프로세 싱을 통해 상품 정보들을 수집하는 방법을 이용하도록 구성될 수 있다. 먼저, 프로세서는 웹 사이트들에 접속하여(access), 해당 웹 사이트들에서 상품 이름(상품명, product name)을 검색할 수 있다(S410, S420). 상품명은 판매 채널들로부터 획득되거나 또는, 판매 채널들이 통합적으로 연결되는 포털 사이트의 쇼핑 관련 웹 페이지로부터 획득될 수 있다. 예를 들어, 네이버 쇼핑 웹 페이지로부터 상품명들이 수집될 수 있다. 프로세서는 상품명 검색 결과에 해당하는 웹 페이지로부터 상품들에 대한 리뷰 URL(uniform resource locator)들을 수집할 수 있다(S430). URL은 네트워크 상에서 자원(resource)이 어디에 위치하는지를 알려주기 위한 주소 규약으로서, 리뷰 URL은 네트워크 상에서 리뷰가 위치하는 주소를 알려주는 규약에 해당한다. 프로세서는 수집된 리뷰 URL들을 이용하여 웹 사이트들에 접속하고(S440), 웹 사이트들 내에서 상품들에 대한 리뷰들을 검색함으로써(S450), 리뷰 정보들을 수집할 수 있다(S460). 상술한 리뷰 정보의 수집 방법은 일예로 리뷰 정보 제공부 내부에 별도로 구성된 크롤러(crawler, 미도 시)에서 동작할 수도 있다. 크롤러는 리뷰 정보를 수집하는 기능(웹 크롤링 기능)을 수행하는 구성으로서, 모든 웹 사이트들에 대해 하나만 존재하거나, 각 웹 사이트들마다 별도의 크롤러가 존재할 수도 있다. 웹 사이트들 각각에 대하여 웹 크롤링 기능을 수행하는 복수 개의 크롤러들이 이용되는 경우는 '멀티 프로세스 크롤러'로 지칭될 수 있다. 복수 개의 크롤러들 각각에 대해 담당하는 웹 사이트들이 부여된 경우(멀티 프로세 스 크롤러)에는, 어느 하나의 크롤러에 문제가 발생하더라도 다른 크롤러에 영향이 미치지 않으므로, 리뷰 정보 를 수집하는 기능의 안정성이 증대될 수 있다. 도 5a는 본원의 일 실시예에 따른 상품 구매 서비스 제공 장치 내 리뷰 정보 제공부에 의해 리뷰 컨텐 츠를 생성하는 방법을 설명하기 위한 도면이다. 도 5b는 본원의 일 실시예에 따른 상품 구매 서비스 제공 장치 내 리뷰 정보 제공부가 리뷰 특징을 추출하기 위해 이용하는 딥 러닝 모델의 예를 나타낸 도면이다. 도 5a 및 도 5b를 참조하면, 상술한 바와 같이 프로세서는 수집된 리뷰 정보들 중에서 상품들 각각에 대응 되는 하나 이상의 리뷰 정보들을 선별할 수 있다. 특정 상품에 대응되는 리뷰 정보들을 자동적으로 선별하기 위해서는 어느 리뷰가 어느 상품에 대해 작성된 것인 지 여부를 파악하는 과정이 요구될 수 있다. 리뷰 정보 제공부는 리뷰 정보의 내용 또는 특징을 분석함으 로써, 어느 리뷰가 어느 상품에 대해 작성된 것인지 여부를 파악하도록 구성될 수 있다. 이를 위해, 구체적으로 프로세서는 먼저 리뷰 텍스트의 특징(feature)을 분석하도록 학습된 딥 러닝 모델 (특징 분석 딥 러닝 모델)을 활용하여, 리뷰 정보들 각각으로부터 리뷰 특징들을 추출할 수 있다(S510). 리뷰 텍스트는 리뷰 정보에 포함된 텍스트를 의미하고, 리뷰 특징은 특징 분석 딥 러닝 모델을 통해 추출 된 리뷰의 특징을 의미할 수 있다. 리뷰 텍스트의 특징은 리뷰 텍스트를 구성하는 형태소들일 수 있다. 형태소 는 일정한 의미(뜻)를 가지는 가장 작은 말의 단위로서, 명사, 대명사, 수사, 조사, 동사, 형용사, 관형사, 부 사 등이 형태소에 해당할 수 있다. 도 5b에 나타낸 바와 같이, 특징 분석 딥 러닝 모델은 리뷰 텍스트를 입력으로 하여, 해당 리뷰 텍스트로 부터 리뷰 텍스트의 특징(리뷰 특징)을 추출 및 출력할 수 있다. 특징 분석 딥 러닝 모델은 미리 수집된 리뷰 텍스트를 트레이닝 데이터 세트로 하여 학습될 수 있다. 프로세서는 리뷰 텍스트를 구성하는 형태소들이 리뷰 텍스트의 특징에 해당하는 경우에는 1) 리뷰 텍스트 를 구성하는 형태소들 각각의 빈도(품사들의 빈도)를 리뷰 특징으로 추출하거나, 2) 리뷰 텍스트를 구성하는 형 태소들 중에서 특정 품사(예를 들어, 명사)의 형태소들의 빈도를 리뷰 특징으로 추출하거나, 또는 3) 명사인 품 사를 가지는 형태소들 중에서 상품명에 대응되는 형태소들의 빈도를 리뷰 특징으로 추출할 수 있다. '빈도'는 1)의 경우에는 '형태소들'의 발생 횟수 또는 포함 횟수를 의미하고, 2)의 경우에 '형태소들의 품사'의 발생 횟수 또는 포함 횟수를 의미하며, 3)의 경우에 '상품명에 대응되는 형태소들'의 발생 횟수 또는 포함 횟수 를 의미할 수 있다. '빈도'는 횟수에 비례하는 점수로 수치화될 수 있다. 리뷰 특징들이 추출되면, 프로세서는 상품들 각각에 대응되는 하나 이상의 리뷰 정보들을 선별할 수 있다 (S520). 대응되는 리뷰 정보들의 선별에는 상품들의 카테고리 및 상품명과, 리뷰 특징들 사이의 비교 결과가 이용될 수 있다. 어느 리뷰의 리뷰 특징이 어느 상품의 카테고리 및 명칭에 대응되는 경우에는 해당 리뷰가 해당 상품에 대해 작성된 것일 수 있다. 따라서, 이 경우에는 해당 리뷰 정보가 해당 상품에 대응되는 것으로 선별될 수 있 다. 그러나, 어느 리뷰의 리뷰 특징이 어느 상품의 카테고리 및 명칭에 대응되지 않는 경우에는 해당 리뷰가 해 당 상품에 대해 작성되지 않은 것일 수 있으므로, 이 경우에는 해당 리뷰 정보가 해당 상품에 대응되지 것으로 선별되지 않을 수 있다. 상품들 각각에 대응되는 하나 이상의 리뷰 정보들이 선별되면, 프로세서는 선별된 리뷰 정보들을 대응되는 상품에 매칭 또는 태깅시켜 리뷰 컨텐츠를 생성할 수 있다(S530). 만약, 동일한 상품에 대해 이미 매칭된 리뷰 정보들이 존재하는 경우에는 이미 매칭된 리뷰 정보들과 선별된 리 뷰 정보들 간을 비교하는 과정이 수행될 수 있다. 예를 들어, 선별된 리뷰 정보들 모두가 이미 매칭된 리뷰 정 보에 포함되는 경우에는 선별된 리뷰 정보들을 상품에 매칭시키는 과정이 수행되지 않을 수 있다. 이와 달리, 선별된 리뷰 정보들 중에서 일부 또는 전부가 이미 매칭된 리뷰 정보에 포함되지 않는 경우에는 포함되지 않는 리뷰 정보들만이 상품에 추가적으로 매칭될 수 있다. 도 6a는 본원의 일 실시예에 따른 상품 구매 서비스 제공 장치 내 리뷰 정보 제공부에 의해 리뷰 정보 를 제공하는 방법의 예를 설명하기 위한 도면이다. 도 6b는 본원의 일 실시예에 따른 상품 구매 서비스 제공 장 치 내 리뷰 정보 제공부가 리뷰를 선별하기 위해 이용하는 딥 러닝 모델의 예를 나타낸 도면이다. 도 6a 및 도 6b를 참조하면, 상술한 바와 같이, 리뷰 컨텐츠들 중에서 판매 채널들로부터 제공 요청된 대상 상 품에 대한 리뷰 정보들이 판매 채널들로 제공될 수 있다. 다만, 리뷰 정보들은 해당 상품을 실제로 구매하지 않은 제3자에 의해 작성될 수 있으며, 구매에 유용한 정보가 리뷰 정보에 포함되어 있지 않을 수도 있으므로, 모든 리뷰 컨텐츠(모든 리뷰 정보)가 정확하거나 구매에 유용 하다고 담보할 수는 없다. 이러한 문제를 해결하기 위하여, 리뷰 정보 제공부는 리뷰 정보를 평가하고, 대상 상품에 대한 리뷰 정보들 중 에서 상대적으로 높은 평가를 받은 리뷰 정보가 먼저 제공되도록 구성될 수 있다. 이를 위해, 먼저 프로세서는 리뷰 정보를 평가하도록 학습된 딥 러닝 모델(리뷰 평가 딥 러닝 모델) 을 활용하여, 리뷰 컨텐츠들에 포함된 리뷰 정보들 각각을 평가할 수 있다(S610). 리뷰 정보의 평가 방식은 해당 리뷰 정보를 미리 설정된 평가 등급들 중에서 어느 하나로 구분 또는 지정하는 방식일 수 있다. 미리 설정된 평가 등급들은 '유용' - '보통' - '나쁨' - '광고'의 순서대로 점차 낮아지는 평 가 등급일 수 있다. 미리 설정된 평가 등급들에는 리뷰 작성자가 이전에 작성한 리뷰들에 대한 분석, 리뷰 정보 가 최근에 작성되었는지 여부(리뷰 정보의 작성일), 리뷰 정보에 대한 추천수, 리뷰 작성자가 운영하는 SNS의 팔로워 수, 이웃 수 중에서 하나 이상이 포함될 수 있다. 즉, 미리 설정된 평가 등급들은 평가 기준 파라미터들 을 고려하여 설정될 수 있다. 도 6b에 도시된 바와 같이, 리뷰 평가 딥 러닝 모델은 평가 기준 파라미터들을 입력으로 하여 해당 리뷰 정보의 평가 등급을 추출 및 출력할 수 있다. 리뷰 평가 딥 러닝 모델은 미리 수집된 평가 기준 파라미터 들을 트레이닝 데이터 세트로 하여 학습될 수 있다. 판매 채널들로부터 대상 상품에 대한 리뷰 정보가 요청되면(S620), 프로세서는 대상 상품을 선별하고 (S630), 대상 상품에 대한 리뷰 정보들 중에서 상대적으로 높은 등급으로 구분된 하나 이상의 리뷰 정보들을 선 별할 수 있다(S640). 또한, 프로세서는 선별된 리뷰 정보들을 판매 채널들로 제공할 수 있다(S650). 상술한 도 3, 도 4, 도 5a 및 도 6a을 참조한 설명에서는 각 과정들을 순차적으로 실행하는 것으로 기재하고 있 으나, 이는 본 발명의 일 실시예의 기술 사상을 예시적으로 설명한 것에 불과한 것이다. 다시 말해, 본 발명의 일 실시예가 속하는 기술 분야에서 통상의 지식을 가진 자라면 본 발명의 일 실시예의 본질적인 특성에서 벗어 나지 않는 범위에서 도 3, 도 4, 도 5a 및 도 6a에 기재된 순서를 변경하여 실행하거나 각 과정들 중 하나 이상의 과정을 병렬적으로 실행하는 것으로 다양하게 수정 및 변형하여 적용 가능할 것이므로, 도 3, 도 4, 도 5a 및 도 6a는 시계열적인 순서로 한정되는 것은 아니다. 본 장치는 리뷰 정보 제공부를 통해 온라인 상에서 판매되고 있는 상품에 대한 리뷰(리뷰 정보)를 제공 할 수 있다. 특히, 본 장치는 리뷰 정보 제공부를 통해 복수의 웹 사이트들에 산재해 있는 방대한 양의 리뷰들을 통합적으로 수집 및 관리하고, 이들을 정확히 분석함으로써, 소비자(사용자)들의 요구에 부합하는 양 질의 리뷰를 제공할 수 있다. 상술한 바에 따르면, 리뷰 정보 제공부는 웹 사이트들로부터 수집된 상품에 대한 리뷰들을 통합적으로 관 리할 수 있다. 즉, 리뷰 정보 제공부는 온라인 상에 판매되는(혹은 웹 사이트들 상에 존재하는) 특정 상품 (대상 상품)과 관련하여, 특정 상품에 대한 리뷰(리뷰 정보)로서 통합 관리된 리뷰 정보(통합 리뷰 정보)를 제 공할 수 있다. 리뷰 정보 제공부는 특정 상품에 대한 통합 리뷰 정보를 해당 특정 상품을 온라인 상에서 판매하는 판매 채널들 각각에게 제공할 수 있다. 이에 따르면, 종래에는 동일 상품에 대하여 각 판매 채널마다 서로 다른 리뷰를 제공(일예로, 제1 판매 채널에 서는 a 상품과 관련해 3개의 리뷰를 제공하고, 제2 판매 채널에서는 a 상품과 관련해 300개의 리뷰를 제공)하였 다. 즉, 종래에는 동일 상품에 대한 리뷰들이 다양한 형태로 온라인 상에 산재(분산)되어 있었다. 이에 반해, 본 장치는 리뷰 정보 제공부가 동일 상품을 판매하는 다수의 판매 채널(일예로 a 상품을 판매하는 복수 의 판매 채널) 각각으로 동일 상품에 대한 통합 관리된 리뷰들(즉, a 상품의 통합 리뷰 정보)를 제공할 수 있 다. 이에 따르면, 일예로 사용자는 동일 상품을 판매하는 다수의 판매 채널 중 어느 판매 채널을 접속하더라도 모두 동일한 리뷰 정보(즉, 리뷰 정보 제공부에 의해 제공되는 통합 리뷰 정보)를 제공받을 수 있다. 한편, 검색어 입력부는 사용자가 구매를 희망하는 구매 희망 상품에 대한 상품 검색어(즉, 구매 희망 상품 검색어)를 사용자 단말로부터 입력받을 수 있다. 구매 희망 상품은 온라인 상에 판매되는 다양한 유형(종류)의 상품 중 어느 하나일 수 있다. 상품의 유형에는 일예로 의류(반팔, 긴팔, 아우터 등과 같은 상의, 반바지, 긴바지 등과 같은 하의), 모자, 화장품, 가방, 휴지 등이 포함될 수 있으나, 이에만 한정되는 것은 아니고, 온라인 상에 판매되는 각종 상품(물품, 물건) 등이 고려 될 수 있다. 상품 검색어로는 상품의 유형 정보, 상품명, 상품의 코드명(시리얼번호) 등을 입력받을 수 있으나, 이에만 한정되는 것은 아니다. 제어부는 사용자 단말로부터 상품 검색어에 대한 리뷰 정보 제공 요청이 이루어진 경우, 리뷰 정보 제 공 요청에 응답하여 상품 검색어에 대응하는 리뷰 정보가 사용자 단말의 화면에 표시되도록 제어할 수 있다. 이때, 리뷰 정보는 리뷰 정보 제공부에 의해 통합 관리되는 리뷰 정보들(즉, 통합 리뷰 정보들) 중 적어도 일부의 정보로서, 복수의 판매 채널들 중 어느 하나의 판매 채널로부터 제공되는 정보를 의미할 수 있다. 즉, 사용자 단말의 화면에 표시되는 상품 검색어에 대응하는 리뷰 정보는, 리뷰 정보 제공부에 의해 통 합 관리되는 복수 유형의 상품들에 대한 통합 리뷰 정보들 중 사용자가 입력한 상품 검색어에 대한 통합 리뷰 정보를 의미할 수 있다. 다시 말해, 사용자 단말의 화면에 표시되는 상품 검색어에 대응하는 리뷰 정보는 리 뷰 정보 제공부에 의해 통합 관리된 상품 검색어에 대한 통합 리뷰 정보를 의미할 수 있다. 이에 따르면, 본원에서 사용자 단말의 화면에 표시되는 리뷰 정보는 통합 리뷰 정보라 지칭될 수 있다. 상술한 리뷰 정보 제공부에 의하면, 일예로 온라인 상에서 제1 상품을 판매하는 복수의 판매 채널들 각각 은 리뷰 정보 제공부에 의해 통합 관리된 제1 상품의 리뷰 정보(즉, 제1 상품의 통합 리뷰 정보)를 리뷰 정보 제공부로부터 제공받을 수 있다. 이에 따라, 제1 상품을 판매하는 복수의 판매 채널들 각각은 모두 자신의 판매 채널에 접속한 사용자들에 대하여 제1 상품의 통합 리뷰 정보를 제공할 수 있다. 또한, 상품 검색어에 대응하는 리뷰 정보(통합 리뷰 정보)가 사용자 단말의 화면에 표시된 이후, 제어부 는 사용자 단말의 화면의 일영역에 표시된 구매 추이 제공 메뉴에 대한 사용자 입력이 이루어진 경우, 리뷰 정보와 관련하여 기 설정된 기간별 구매 건수에 대한 그래프 정보를 사용자 단말의 화면에 제공할 수 있다. 여기서, 기 설정된 기간별이라 함은 일예로 날짜별, 월별, 연도별 등을 의미할 수 있으나, 이는 본원의 이해를 돕기 위한 하나의 예시일 뿐, 이에만 한정되는 것은 아니다. 또한, 그래프 정보를 제공함에 있어서 기 설정된 기간의 유형(즉, 날짜, 월, 연도)에 대한 설정은 일예로 사용 자의 선택 입력에 의해 설정될 수 있으나, 이에만 한정되는 것은 아니고, 다른 일예로 본 장치를 관리하는사용자(관리자)에 의해 설정될 수 있다. 즉, 구매 추이 제공 메뉴에 대한 사용자 입력이 이루어지면, 제어부는 일예로 상품 검색어에 대한 통합 리 뷰 정보를 토대로, 통합 리뷰 정보를 날짜별(혹은 월별, 연도별) 구매 건수에 관한 그래프 형태로 생성해 사용 자 단말의 화면에 표시할 수 있다. 이때, 제어부는 사용자 단말로부터 구매 희망 상품에 대한 상품 유형 정보가 더 입력된 경우, 상품 유 형 정보별로 구매 추이 관련 리뷰 정보를 제공할 수 있다. 여기서, 상품 유형 정보는 구매 희망 상품의 색상 정 보 및/또는 사이즈 정보를 포함할 수 있다. 이에 따르면, 제어부는 상품 검색어에 대응하는 통합 리뷰 정보 중 특히 사용자가 입력한 구매 희망 상품 의 색상 정보와 사이즈 정보와 관련된 통합 리뷰 정보만을 사용자에게 제공할 수 있으며, 이때 이러한 정보(즉, 사용자가 입력한 구매 희망 상품의 색상 정보와 사이즈 정보와 관련된 통합 리뷰 정보)를 기 설정된 기간별 구 매 건수에 대한 그래프 정보로 제공할 수 있다. 또한, 제어부는 구매 희망 상품에 대한 상품 유형 정보가 입력된 경우, 상품 유형 정보별 구매 추이 관련 리뷰 정보(즉, 상품 유형 정보마다의 기 설정된 기간별 구매 건수에 대한 그래프 정보)를 제공하는 것 뿐만 아 니라, 사용자가 입력한 상품 유형 정보에 대응하는 리뷰 정보들(상품 유형 정보에 대응하는 통합 리뷰 정보들) 을 사용자에게 제공할 수 있다. 일예로, 사용자가 구매 희망 상품(일예로 쉬즈미스 코트)에 관한 상품 유형 정보로서 '55사이즈, 블랙'을 입력 했다고 하자. 이러한 경우, 제어부는 일예로 구매 희망 상품(일예로 쉬즈미스 코트)과 관련된 통합 리뷰 정보들 중 특히 55사이즈의 블랙 코트와 관련된 통합 리뷰 정보들만 추출하여 사용자에게 일예로 목록 형태로 제공할 수 있다. 또한, 제어부는 구매 추이 관련 리뷰 정보로서 일예로, 55사이즈의 블랙 코트와 관련된 통합 리뷰 정보들을 기반으로 생성된 기 설정된 기간별(일예로 날짜별) 구매 건수에 대한 그래프 정보를 사용자 에게 제공할 수 있다. 이에 따르면, 본 장치는 상품 유형 정보가 고려된 구매 추이 관련 정보(그래프 정보)를 사용자에게 제공함으 로써, 사용자가 특정 상품(구매 희망 상품)을 실제로 구매하기에 앞서, 자신이 구매하고자 하는 상품에 대한 트 렌드(유행, 추세, 경향), 선호도 등을 직관적으로 파악할 수 있도록 할 수 있다. 즉, 자신이 구매하고자 하는 상품이, 일예로 최근 타 사용자들에게 구매가 많이 이루어져 최근 유행하고 있는 상품인지 혹은 작년까지는 타 사용자들이 많이 구매해 유행이었으나 올해는 구매율이 적어 유행이 한물 간 상품인지를 그래프 정보를 토대로 보다 직관적으로 빠르게 파악할 수 있도록 제공할 수 있다. 또한, 본 장치는 상품 검색어에 대응하는 통합 리뷰 정보를 제공할 뿐만 아니라, 상품 검색어에 대응하는 통 합 리뷰 정보들 중 특히나 상품 검색어와 관련해 사용자가 입력한 특정 상품 유형 정보에 대응하는 통합 리뷰 정보만을 추출해 사용자에게 제공할 수 있는바, 사용자가 방대한 양의 리뷰 정보들 중 자신이 원하는 색상과 사 이즈의 상품에 관한 리뷰만을 모아서 한번에 볼 수 있도록 할 수 있고, 이를 통해 해당 상품에 대한 구매의 결 정에 도움줄 수 있다. 도 7은 종래 온라인 상에서 제공되는 리뷰의 형태를 설명하기 위한 도면이다. 도 7을 참조하면, 사용자가 일예로 상품 검색어로서 온라인 상에서 쉬즈미스 브랜드의 코트(상품명)를 검색하였 다고 하자. 그리고 온라인 상에서 판매되는 해당 코트의 경우, 색상은 3가지(블랙, 다크그레이, 아이보리, 핑크)가 존재하고, 사이즈도 3가지(55, 66, 77)가 존재한다고 하자. 이때, 종래에는 해당 상품에 대한 복수의 리뷰들을 제공할 때, 단순히 최신순, 랭킹순 등을 기준으로 하여 목록 형태로 제공하고 있음을 확인할 수 있다. 즉, 해당 코트의 색상과 사이즈가 다양하게 존재함에도 불구하고, 이 들의 구분 없이 종래에는 사용자들이 올린 복수의 리뷰들을 단순히 리뷰를 올린 순으로(최신순 등으로) 하여 목 록 형태로 제공하고 있을 뿐이다. 이에 따르면, 종래에는 일예로 사용자가 쉬즈미스 브랜드의 코트 중 특히나 55사이즈의 블랙 코트를 구매하길 희망하고 있고, 55 사이즈의 블랙 코트를 구매한 사용자들의 리뷰만을 찾아서 보고자 할 경우, 사용자가 목록 형태로 제공되는 리뷰들을 일일이 확인해 가면서 목록들 중 55사이즈의 블랙 코트에 관한 리뷰만을 직접 골라 찾아서 확인해야 하는 불편함이 있었다. 그렇기 때문에, 리뷰수가 300건, 1000건 등과 같이 그 양이 방대할수록, 사용자는 자신이 원하는 항목(상품의 색상과 사이즈)에 관한 리뷰만을 찾아보는 것이 더 어렵고 시 간이 오래 걸리는 문제가 있었다.이에 반해, 본 장치는 상품 검색어에 해당하는 상품에 대한 모든 리뷰가 아닌, 상품 검색어에 해당하는 상품 중 특히나 사용자가 입력한 상품 유형 정보(일예로 55사이즈, 블랙)에 해당하는 리뷰만을 사용자에게 일예로 목 록 형태로 제공할 수 있는바, 사용자가 자신이 원하는 색상과 사이즈의 상품에 관한 리뷰만을 보다 쉽게 모아서 한번에 볼 수 있도록 제공할 수 있다. 또한, 도 7에 도시된 예에 따르면, 종래에는 특정 상품에 대한 리뷰들이 단순히 날짜 표시(리뷰 작성이 이루어 진 날짜 표시)가 이루어진 목록 형태로만 제공되고 있어, 해당 특정 상품이 최근(일예로 최근 6개월 사이)에 타 사용자들에게서 많이 구매가 이루어지고 있는지, 혹은 타 사용자들에게서 최근 구매가 잘 이루어지고 있지 않은 지 등을 직관적으로 확인하기 어려운 문제가 있었다. 이에 반해, 본 장치는 구매 추이 관련 리뷰 정보(즉, 상품 검색어와 관련된 기 설정된 기간별 구매 건수에 대한 그래프 정보, 상품 유형 정보별 기 설정된 기간별 구매 건수에 대한 그래프 정보)를 제공함으로써, 사용자 가 특정 상품을 구매하기에 앞서, 해당 상품을 다른 사람들이 최근에 많이 구매했는지 혹은 다른 사람들이 요즘 잘 구매하지 않는지 등의 상품 구매 트렌드(추세), 해당 상품의 선호도(선호율)를 보다 직관적으로 인지할 수 있도록 하여, 구매의 결정에 보다 도움되도록 할 수 있다. 이하에서는 도 8 내지 도 11을 참조하여 본 장치에서 고려되는 키워드 검색 아이콘에 대해 보다 상세히 설명 하기로 한다. 도 8은 종래에 판매 채널에서 제공되는 상품 판매 페이지의 예를 나타낸 도면이다. 도 9는 종래에 판매 채널에 서 제공되는 상품 판매 페이지 내 상세정보(특정 상품의 상세정보)의 예를 나타낸 도면이다. 도 10은 본원의 일 실시예에 따른 상품 구매 서비스 제공 장치의 제어부에 의해 제공되는 키워드 검색 아이콘이 상세정 보가 표시된 상품 판매 페이지 상에 표시된 화면의 예를 나타낸 도면이다. 도 11은 본원의 일 실시예에 따른 상 품 구매 서비스 제공 장치의 제어부가 제공하는 키워드 검색 아이콘의 예를 나타낸 도면이다. 도 8 내지 도 11을 참조하면, 제어부는 사용자가 복수의 판매 채널 중 어느 하나의 판매 채널에 접속한 것으로 감지된 경우, 구매 희망 상품의 상세정보를 포함한 구매 희망 상품 관련 상품 판매 페이지가 사용자 단말 의 화면에 표시되도록 제어할 수 있다. 이때, 화면에 표시되는 구매 희망 상품의 상세정보(즉, 상품 판매 페 이지 내 상세정보)는 이하 설명의 편의상 상세정보라 하기로 한다. 여기서, 상품 판매 페이지는 사용자가 접속한 어느 하나의 판매 채널에서 제공하는 페이지로서, 상품 검색어에 해당하는 상품(구매 희망 상품)을 판매하는 페이지를 의미할 수 있다. 일예로 도 8에는 사용자가 구매 희망 상 품에 대한 상품 검색어로서 '쉬즈미스 코트'를 입력하고, 해당 상품을 판매하는 판매 채널로서 일예로 옥션에 접속하였을 때의 화면 예가 도시되어 있다. 즉, 사용자가 어느 한 판매 채널로서 일예로 옥션에 접속한 것으로 감지된 경우, 제어부는 사용자 단말의 화면에 일예로 '쉬즈미스 코트(구매 희망 상품)'과 관련된 상품 판매 페이지로서 도 8과 같은 화면을 표시할 수 있다. 이때, 제어부는 상품 판매 페이지의 표시시, 사용자 단말의 화면의 일영역에 상세정보(구매 희망 상품 의 상세정보) 내 키워드 검색을 위한 키워드 검색 아이콘을 상품 판매 페이지 상에 오버랩하여 사용자 단말 의 화면에 표시할 수 있다. 일예로 도 10에는 키워드 검색 아이콘이 상품 판매 페이지(특히, 상품 판매 페이지 중 상세정보) 상에 오버랩되어 표시되어 있는 경우의 예가 도시되어 있다. 사용자는 키워드 검색 아이콘을 통해 상품 판매 페이지에 포함된 모든 정보에 대한 키워드 검색을 수행할 수 있 다. 즉, 키워드 검색 아이콘은 상품 판매 페이지에 포함된 정보들을 대상으로 하여 키워드 검색을 수행할 수 있 다. 이러한 상품 판매 페이지에는 구매 희망 상품과 관련하여 상세정보(구매 희망 상품의 상세정보), 구매후기 정보, 상품문의 정보, 교환/반품 관련 정보 등 다양한 정보가 포함될 수 있다. 이에 따르면, 키워드 검색 아이 콘은 구매 희망 상품의 상세정보 내 키워드 검색 등을 포함하여, 상품 판매 페이지 내 각종 정보에 대한 키워드 검색을 수행할 수 있다. 또한, 제어부는 키워드 검색 아이콘 내 키워드 입력부(4a)에 대한 사용자의 클릭 입력이 이루어진 경우, 상세정보 내 설명 데이터의 글자 인식이 가능하도록 상세정보에 대응하는 페이지에 대하여 글자 인식 처 리를 수행할 수 있다. 여기서, 글자 인식 처리는 일예로 OCR(optical character reader, 광학 문자 인식) 처리일 수 있다. 다만, 이 에만 한정되는 것은 아니고, 본원에서 고려되는 글자 인식 처리로는 다양한 이미지, 동영상 등을 대상으로 해당 이미지, 동영상에 포함되어 있는 글자의 인식(식별)이 가능한 처리 방식이라면 무엇이든 적용 가능하다. 즉, 글자 인식 처리 기술로는 종래에 이미 존재하거나 향후 개발되는 다양한 글자 인식(식별) 기술이 적용될 수 있다. 여기서, 상세정보 내 설명 데이터는 상세정보에 포함되어 있는 모든 정보를 의미하는 것으로서, 설명 데이터에 는 구매 희망 상품의 설명 글자 데이터, 이러한 설명 글자 데이터가 포함된 상품 이미지 데이터 등이 포함될 수 있다. 구체적인 예로, 상세정보에는 판매되고 있는 특정 상품과 관련하여 각종 정보(일예로, 상품의 사진 이미지, 상 품을 모델이 착용한 착용샷 사진 이미지, 상품의 사이즈 정보나 소재 정보, 전성분 정보, 판매자 정보, 주의사 항 정보, 배송안내 정보, 교환/반품 절차 관련 안내 정보, 유의사항 정보, 공지사항 정보, 인체적용실험 테스트 관련 정보, 상품의 효능/효과 분석 관련 연구 정보 등)가 포함되어 있기 마련이다. 본 장치에서는 이러한 상 세정보 내에 포함되어 있는 각종 정보를 설명 데이터라 지칭한다. 일예로 도 9에는 도 8에 도시된 '쉬즈미스 코트' 상품과 관련하여 제공되는 상세설명(상세정보, 특히 상세정보 내 설명 데이터)의 예가 도시되어 있다. 즉, 사용자가 일예로 도 8과 같은 상품 판매 페이지 내에 존재하는 상 세설명(구매 희망 상품의 상세정보) 항목을 클릭한 경우, 제어부는 상세설명 항목에 대한 클릭 입력에 응 답하여 사용자 단말의 화면에 '쉬즈미스 코트' 상품의 상세정보로서 도 9에 도시된 정보들이 표시되도록 할 수 있다. 이때, 사용자 단말의 화면의 크기가 한정적임에 따라, 도 9에 도시된 해당 상품에 대한 상세정보들은 일예로 사용자의 스크롤링 동작에 따라 (a) - (b) - (c) -(d)의 순서로 사용자 단말의 화면 상에 순차적으로 노출 (표출)될 수 있다. 도 9에 도시된 일예에 따르면, 일예로 '쉬즈미스 코트' 상품에 관한 상세정보에는 판매자 공지사항 정보(a), 코 트 상품의 색상별 상품 이미지 정보(b), 코트 상품의 소재 등과 관련된 정보와 사이즈 관련 정보 등(c), 교환/ 반품 절차 관련 정보와 유의사항 정보 등(d)이 포함되어 있음을 확인할 수 있다. 이처럼, 일반적으로 온라인 상 (웹 사이트 상)에서는 특정 상품의 상세정보(상세 설명 정보)와 관련하여 각종 정보들을 제공한다. 그런데, 일반적으로 온라인 상에서 제공되는 특정 상품에 관한 상세정보(상품 상세정보) 내 각종 정보들은 그 양이 방대하고 대부분 도 9에 도시된 것과 같이 검색이 불가능한 이미지 형태로 제공되고 있다. 이러한 이유로, 종래에는 사용자(구매자)가 해당 상세정보 내에서 원하는 정보(일예로, 치수 정보, 성분 정보, 교환 방법 등)를 찾기 위해서는 여러 번의 스크롤링(scrolling)을 통해 각종 정보들을 일일이 읽어가면서 원하는 정보가 표시된 위치를 직접 찾아야 했고, 이에 따라 원하는 정보를 찾는 데에 오랜 시간이 소요되는 문제가 있었다. 이러한 문제를 해소하고자, 본 장치의 제어부는 키워드 검색 아이콘 내 키워드 입력부(4a)에 대한 사용자의 클릭 입력이 이루어진 경우, 상세정보에 포함되어 있는 설명 데이터(즉, 상술한 각종 정보) 내에서의 키워드 검색이 가능하도록, 상세정보에 대응하는 페이지에 대하여 글자 인식 처리를 수행할 수 있다. 이러한 글 자 인식 처리의 수행에 의하면, 일예로 도 9의 상품 이미지에 포함되어 있는 글자들(일예로, 블랙(BK), 카멜 (KA))도 인식(식별)될 수 있다. 이후, 제어부는 키워드 입력부(4a)를 통해 키워드가 입력된 경우, 글자 인식 처리된 설명 데이터 중 입력 된 키워드와 매칭되는 데이터를 매칭 키워드 데이터로서 검색하여 사용자 단말의 화면 상에 노출되도록 제어 할 수 있다. 상술한 설명에서는 제어부가 글자 인식 처리된 설명 데이터를 대상으로 매칭 키워드 데이터의 검색을 수행 하는 것으로 예시하였으나, 이는 본원의 이해를 돕기 위한 하나의 예시일 뿐, 이에만 한정되는 것은 아니다. 다 른 예로, 제어부는 글자 인식 처리된 설명 데이터(즉, 글자 인식 처리된 상세정보 내 각종 정보들)를 포함 하여 상품 판매 페이지에 포함된 모든 데이터를 대상으로 매칭 키워드 데이터의 검색을 수행할 수도 있다. 일예로, 사용자가 상세정보에 포함된 각종 정보들 중에서 '블랙'과 관련된 설명(정보)만 찾아서 보고자 하는 경 우, 사용자는 도 11의 (a)에 도시된 키워드 검색 아이콘 내 키워드 입력부(4a)에 키워드로서 '블랙'을 입력 한 후 키워드 입력부(4a) 내 입력 버튼을 클릭할 수 있다. 이러한 경우, 제어부는 글자 인식 처리된 설명 데이터 중 사용자가 입력한 키워드인 '블랙'과 매칭되는 데이터(단어, 키워드)(일예로, 블랙)를 매칭 키워드 데 이터로서 검색하여 화면 상에 노출되도록 할 수 있다. 이를 통해 사용자는 상세정보 내에서 자신이 원하는 키워 드에 해당하는 설명(정보)만을 보다 빠르게 찾아 인식(습득)할 수 있다. 제어부는 글자 인식 처리된 설명 데이터 내에 블랙과 매칭되는 매칭 키워드 데이터(일예로, 블랙)가 복수 개 존재하는 경우, 복수개의 매칭 키워드 데이터들을 상측에서 하측 방향으로 스캔(이동)해 가며 순차적으로 하나씩 화면에 노출되도록 제어할 수 있다. 이에 따르면, 본 장치는 일반적으로 온라인 상에서의 상세정보가 이미지 형태로 주어지는 상황 속에서도, 해 당 상세정보를 글자 인식이 가능한 상태로 마련(즉, 글자 인식 처리를 수행)하여 키워드 검색이 가능하도록 할 수 있는바, 이를 통해 사용자로 하여금 상세정보에 포함된 각종 정보들(이미지 내 글자 정보 포함) 중 사용자가 원하는 키워드에 해당하는 정보만을 보다 신속히 찾아 정보를 습득할 수 있도록 제공할 수 있다. 또한, 제어부는 키워드 입력부(4a)를 통해 키워드가 입력된 경우, 글자 인식 처리된 설명 데이터 내 입력 된 키워드의 유의어가 존재하는지 검색하고, 검색 결과 유의어가 존재하는 경우, 키워드 검색 아이콘의 유의 어 표시부(4b) 내에 검색된 유의어의 리스트를 표시할 수 있다. 또한, 제어부는 유의어 표시부(4b) 내에 표시된 유의어의 리스트 중 사용자에 의해 선택된 유의어를 고려하여 매칭 키워드 데이터에 대한 재검색을 수행 할 수 있다. 제어부는, 유의어 표시부(4b)에 표시된 유의어의 리스트 중 적어도 하나의 유의어에 대한 사용자의 선택 입력이 이루어진 경우, 글자 인식 처리된 설명 데이터 중 키워드 입력부(4a)에 입력된 키워드 및 사용자가 선택 한 적어도 하나의 유의어와 매칭되는 데이터를 매칭 키워드 데이터로서 함께 동시에 검색(재검색)하여 사용자 단말의 화면 상에 노출되도록 제어할 수 있다. 제어부는 글자 인식 처리된 설명 데이터 내에서의 유의어 검색시, 입력된 키워드와 그 뜻은 동일하나 표기 (기재) 방식이 상이한 키워드(단어) 및 입력된 키워드와 그 뜻은 상이하나 입력된 키워드와 동일한 표기 방식을 포함하는 키워드(단어)를 유의어로서 검색할 수 있다. 예시적으로, 전자의 예를 살펴보면, 입력된 키워드가 일 예로 색상을 나타내는 '블랙'인 경우, 그 유의어로는 black(블랙의 영어), bk(블랙의 영어 약칭) 등이 포함될 수 있다. 후자의 예를 살펴보면, 입력된 키워드가 '블랙'인 경우, 그 유의어로는 블랙이라는 글자가 포함된 키 워드(단어)로서 일예로 블랙박스, 블랙컨슈머, 블랙망고 등이 포함될 수 있다. 유의어 표시부(4b)에 대한 설명 은 도 11의 (b)를 참조해 보다 쉽게 이해될 수 있다. 도 11의 (b)를 참조하면, 일예로 사용자가 키워드 입력부(4a)에 키워드로서 검은 색상을 의미하는 '블랙'을 입 력했다고 하자. 그리고, 글자 인식된 설명 데이터 내에 '블랙'의 유의어가 존재하는지 검색한 결과, '블랙'의 유의어로서 'black'와 '블랙박스'가 검색된 경우, 제어부는 검색된 유의어들을 유의어 표시부(4b) 내에 표 시되도록 할 수 있다. 이후, 사용자가 일예로 유의어 표시부(4b)에 표시된 유의어의 목록들(즉, black과 블랙박스) 중 'black'을 선택 하고 키워드 입력부(4a) 내 입력 버튼을 클릭하였다고 하자. 다른 일예로, 사용자가 유의어 목록들 중 '블랙박 스'를 선택하여 삭제되도록 한 다음 키워드 입력부(4a) 내 입력 버튼을 클릭하였다고 하자. 이러한 경우, 제어부는 글자 인식 처리된 설명 데이터 중에서 2개의 키워드(즉, '블랙'과 'black') 각각과 매칭되는 데이터(단어)를 동시 검색(동시에 재검색)하면서 매칭 키워드 데이터를 식별(검색)해 낼 수 있으며, 식별(검색)된 매칭 키워드 데이터를 화면 상에 노출되도록 제어할 수 있다. 이때, 제어부는 매칭 키워드 데이터의 식별(검색)시 유의어의 목록들 중 사용자의 선택에서 제외된 제외 유의어(일예로, 블랙박스)는 검색이 되지 않도록 할 수 있다. 일예로, 글자 인식 처리된 설명 데이터 내에 '블랙'이라는 키워드(단어)가 2개 있고, 'black'이라는 키워드가 3 개 있으며, '블랙박스'라는 키워드가 1개 있다고 하자, 이때, 해당 키워드들이 글자 인식 처리된 설명 데이터 내에서 상측에서 하측 방향으로 보았을 일예로 '블랙, black, black, 블랙, 블랙박스, black'의 순서로 적혀 있 다고 하자. 이때, 제어부는 입력된 키워드가 '블랙'이고 사용자가 선택한 유의어가 'black'인 경우, 글자 인식 처리된 설명 데이터 내에서 '블랙' 및 'black'과 매칭되는 단어를 매칭 키워드 데이터로서 순차적으로 화면에 노출되도 록 할 수 있다. 구체적인 예로, 제어부는 사용자가 'black'을 유의어로 선택한 경우, 이후 사용자가 키워 드 입력부(4a) 내 입력 버튼을 누를 때 마다, 매칭 키워드 데이터로서 '블랙' → 'black' → 'black' → '블랙' → 'black'이라는 키워드가 순차적으로 하나씩 화면 상에 노출되도록 할 수 있다. 이때, 본 장치에 의하면, 사용자가 유의어로서 '블랙박스'를 선택하지 않음에 따라, 매칭 키워드 데이터로서 '블랙박스'라는 키워드가 화 면에 노출되지 않음을 확인할 수 있다. 즉, 일반적으로 검색 용어로 '블랙'이라는 단어(키워드)가 입력되면, 해당 단어와 매칭되는 단어를 검색할 때 (즉, '블랙'이라는 단어 검색시) '블랙박스'라는 단어에도 '블랙'이라는 표기가 있음에 따라, 단순히 '블랙'이 라는 단어 외에도 '블랙박스'라는 단어가 함께 검색되는 것이 일반적이다. 이에 따르면, 종래에는 사용자가 검은 색상을 의미하는 '블랙'에 관한 내용을 검색하고자 하는 경우, 단순히 사용자가 입력한 키워드(단어)와 똑같 이 일치하는 데이터만을 검색해 보여줌에 따라, 블랙박스 등과 같이 자신이 원하지 않는 정보(불필요한 정보)에 대해서도 검색이 이루어져 사용자에게 제공되는 문제가 있었다. 이에 반해, 본 장치는 사용자가 상세정보(특히, 글자 인식 처리된 설명 데이터) 내에서 어떠한 특정 키워드 (일예로, 검은 색상을 의미하는 '블랙')를 검색하고자 할 때, 사용자가 입력한 키워드(일예로 블랙)와 똑같이 일치하는 데이터(즉, 블랙)만을 제공하는 것이 아니라, 사용자가 입력한 키워드(즉, 블랙) 뿐만 아니라 사용자 에 의해 선택된 유의어(일예로, black)와 매칭되는 데이터를 함께 검색하여 검색 결과를 제공(즉, 검색된 매칭 키워드 데이터를 화면에 표시)하되, 이때 사용자에 의해 선택되지 않은 유의어(일예로, 블랙박스)는 검색에서 제외되도록 하여 검색 결과를 제공할 수 있다. 이를 통해, 본 장치는 사용자가 상세정보 내에서 자신이 원하 는 키워드에 관한 정보를 보다 빠르고 신속하게 찾아 확인해볼 수 있도록 도울 수 있다. 일예로, 유의어 표시부(4b)에 표시되는 유의어의 리스트에 'black, 블랙박스, bk'가 포함되어 있고, 사용자가 유의어의 리스트 중 'black'과 'bk'를 선택한 후 키워드 입력부(4a) 내 입력 버튼을 클릭하였다고 하자. 이러한 경우, 제어부는 글자 인식 처리된 설명 데이터 내에서 'black', 'bk', '블랙'과 매칭되는 각각의 데이터를 한번에 순차적으로 동시에 검색해가며(이때, 선택되지 않은 유의어인 '블랙박스'와 매칭되는 데이터는 검색되지 않음) 매칭 키워드 데이터의 식별(검색)을 수행할 수 있고, 식별(검색)된 매칭 키워드 데이터를 화면 상에 노 출시킬 수 있다. 도 12는 본원의 일 실시예에 따른 상품 구매 서비스 제공 장치에 의해 사용자에게 상품 실감 정보가 제공되 는 경우의 예를 나타낸 도면이다. 도 12를 참조하면, 제어부는 상품 검색어에 대응하는 리뷰 정보가 사용자 단말의 화면에 표시된 이후, 화면의 일영역에 표시된 실감 정보 제공 메뉴에 대한 사용자 입력이 이루어진 경우, 구매 희망 상품의 상품 속 성 정보가 고려된 구매 희망 상품에 대응하는 상품 실감 정보가 사용자에게 제공되도록 전방표시장치의 동작 을 제어할 수 있다. 본 장치는 네트워크를 통해 전방표시장치와 연동(연결)될 수 있다. 전방표시장치(Head Up Display, HUD)는 빔(beam) 조사를 통해 전방표시장치의 전방에(혹은 전방의 공중에, 전방의 상공에) 상품 실감 정 보를 제공할 수 있다. 여기서, 상품 실감 정보라 함은, 구매 희망 상품의 상품 속성 정보(일예로, 치수, 소재, 신축성, 및 비침 정도 등)를 고려하여 구매 희망 상품을 3차원 입체 영상으로 구현한 데이터(즉, 3차원 입체 영상 데이터)를 의미할 수 있다. 즉, 상품 실감 정보는 사용자가 구매하길 희망하는 구매 희망 상품의 실물(실제) 크기와 상응하는 크 기로 구현되는 구매 희망 상품의 3차원 입체 영상 데이터를 의미할 수 있다. 다시 말하자면, 상품 실감 정보는, 전방표시장치에 의하여 상공에 조사되는 빔을 통해 보여지는 구매 희망 상품에 대응하는 3차원 상품 데이터 (3차원 형상의 구매 희망 상품)을 의미할 수 있다. 예시적으로, 구매 희망 상품의 상품 속성 정보로서 해당 구매 희망 상품(일예로 의류)의 총기장, 가슴단면, 어 깨넓이, 및 소매길이에 관한 정보가 크롤링을 통해 획득되어 있다고 하자. 이때, 해당 구매 희망 상품에 대한 상품 실감 정보의 제공을 위한 사용자 입력이 이루어지면(즉, 실감 정보 제공 메뉴에 대한 사용자 입력이 이루 어지면), 제어부는 일예로 도 12에 도시된 것과 같이 전방표시장치의 전방에 구매 희망 상품에 대응하 는 상품 실감 정보가 제공되도록 전방표시장치의 동작을 제어할 수 있다. 이때, 제공되는 상품 실감 정보는 구매 희망 상품의 총기장, 가슴단면, 어깨넓이, 및 소매길이에 관한 정보를 기반으로 해당 치수에 맞추어 구매 희망 상품을 3차원 입체 영상으로 영상화한 데이터일 수 있다. 전방표시장치는 빔(beam) 조사를 통해 전방표시장치의 전방에(혹은 전방의 공중에, 전방의 상공에) 상품 실감 정보를 제공할 수 있다. 전방표시장치는 제어부의 제어에 의해, 상품 실감 정보를 전방표시장치 의 전방에 제공할 수 있다. 전방표시장치는 빔(beam)을 통해 전방표시장치의 전방에 초점이 맺히도록 할 수 있으며, 이로부터 해당 초점에 대응하는 위치에 상품 실감 정보에 대응하는 영상(이미지)이 표시되도록 할 수 있다. 다시 말해, 실감 정보 제공 메뉴(실감 정보 제공 버튼)에 대한 사용자 입력이 이루어지면, 전방표시장치는 제어부의 제어에 응답하여 전방표시장치의 전방에 빔을 통해 상을 뿌림으로써 상품 실감 정보를 전방표 시장치 전방의 상공 상에 제공할 수 있다. 일반적으로 상품을 판매/거래하고 있는 온라인 쇼핑몰 상(웹 사이트 상)에서는, 판매하는 상품의 크기를 나타내 는 정보(일예로, 총기장, 가슴단면, 어깨넓이, 및 소매길이 등)의 표시를 단순히 수치 값(몇 cm, 몇 mm 등)으로 만 표시하고 있다. 그렇게 때문에, 사용자는 온라인 쇼핑몰 상에서 판매되는 해당 상품(제품)을 실제로 받아보 았을 때 그 크기가 어느정도 되는지를 쉽게 가늠(판단)하는 데에 어려움이 있다. 즉, 종래에는 온라인 쇼핑몰 상에 표시된 수치 값을 토대로만 사용자가 구매하고자 하는 상품의 크기를 가늠할 수 있었기 때문에, 실제로 실물 상품을 받아보았을 때(즉, 자신이 구매한 상품의 실물을 보았을 때) 자신(사용 자 자신)이 예상했던 상품의 크기보다 실제 해당 상품의 크기가 더 크거나 혹은 더 작은 경우가 빈번히 존재하 였으며, 이러한 경우 사용자가 다시 다른 치수의 상품으로 교환하거나 환불해야 하는 불편함이 있었다. 이에, 본 장치는 구매 희망 상품의 실제 크기와 상응하는 크기를 갖는 3차원 입체 영상인 상품 실감 정보를 전방표시장치를 통해 사용자에게 제공할 수 있다. 이러한 본 장치는 사용자가 구매를 희망하는 상품(구매 희망 상품)을 구매/결제하기에 앞서 상품 실감 정보를 제공받음으로써, 구매를 희망하는 상품의 실물 크기(실제 크기)를 직관적으로 인지하여 체감해볼 수 있도록 제공할 수 있다. 특히나, 제어부는 전방표시장치를 통해 제공되는 상품 실감 정보가 사용자의 신체 상에 투영되도록 전 방표시장치의 이동을 제어할 수 있다. 이를 위해, 도면에 도시하지는 않았으나, 본 시스템은 일예로 본 장치와 네트워크를 통해 연결되는 이미지 센서(미도시)와 이동 제어 부재(미도시)를 포함할 수 있다. 여기서, 이미지 센서(미도시)는 상품 실감 정보의 투영 대상이 되는 사용자의 신체 영상을 획득하는 센서를 의 미할 수 있다. 이미지 센서(미도시)는 카메라, 영상 촬영 센서 등으로 달리 표현될 수 있다. 이미지 센서(미도 시)는 일예로 사용자 단말에 마련된 이미지 센서, 전방표시장치에 마련된 이미지 센서 및 본 장치에 자체 마련된 이미지 센서 중 적어도 하나일 수 있으며, 이에 한정되는 것은 아니다. 이동 제어 부재(미도시)는 전방표시장치와 결합되고, 좌/우/상/하/전/후에 대한 전방표시장치의 이동 동 작을 제어할 수 있다. 이동 제어 부재(미도시)는 전방표시장치의 이동 및 각도의 동작을 제어할 수 있다. 즉, 이동 제어 부재(미도시)는 상품 실감 정보를 제공하는 전방표시장치의 위치뿐만 아니라 각도를 제어할 수 있다. 일예로, 제어부는 이미지 센서(미도시)를 통해 획득된 사용자(상품 실감 정보의 투영 대상이 되는 사용 자)의 신체 영상에 대한 이미지 분석을 통해 사용자의 부분 부위(예를 들어, 머리, 목, 팔, 손목, 상체, 하체, 발목, 발 등의 부위)를 식별할 수 있다. 또한, 제어부는 상품 실감 정보에 대응하는 구매 희망 상품의 분 류 유형(예를 들어, 상의인지, 하의인지, 팔찌 등의 액세서리인지, 모자인지 등)을 식별할 수 있다. 이후, 제어부는 식별된 구매 희망 상품의 분류 유형과 식별된 사용자의 부분 부위를 기반으로 하여, 구매 희망 상품에 대응하는 상품 실감 정보가 그에 대응하는 사용자의 신체 부분 부위 상에 투영되도록 이동 제어 부 재(미도시)의 동작을 제어함으로써 전방표시장치를 이동시킬 수 있다. 예시적으로, 구매 희망 상품의 분류 유형이 상의인 경우, 제어부는 구매 희망 상품에 대응하는 상품 실감 정보가 이미지 분석을 통해 식별된 사용자의 부분 부위 중 식별된 구매 희망 상품의 분류 유형에 대응하는 신체 부분 부위인 상체(즉, 상의에 대응하는 신체부위인 상체) 상에 투영되도록, 이동 제어 부재(미도시)의 동작 제 어를 통해 전방표시장치를 이동시키는 제어를 수행할 수 있다. 즉, 제어부는 사용자의 신체 부위 중 상 체 상에 구매 희망 상품(상의)에 해당하는 상품 실감 정보가 오버랩하여 투영되도록 전방표시장치를 이동시 킬 수 있으며, 이러한 전방표시장치의 이동을 위해 이동 제어 부재(미도시)의 동작을 제어할 수 있다. 이러한 본 장치는 상품 실감 정보를 제공함으로써, 사용자로 하여금 구매 희망 상품에 대한 구매의 실패 확 률(일예로, 치수가 작거나 하여 이로 인해 반품/교환/환불을 수행해야 하는 불편함 등)을 효과적으로 죽일 수 있다. 본 장치는 온라인 쇼핑몰 상에서 판매되는 상품들 중 사용자가 구매를 희망하는 구매 희망 상품에 대하여, 그 실제 크기와 상응하는 크기를 갖는 3차원 입체 영상을 전방표시장치를 통해 제공(즉, 상품 실감 정보를 제공)함으로써, 사용자가 구매 희망 상품의 크기(실제 크기)를 보다 현실감 있게 체감하고 가늠해볼 수 있도록 할 수 있다. 이하에서는 시뮬레이션부에 대하여 보다 상세히 설명하기로 한다. 시뮬레이션부는 사용자의 신체 특성 정보가 입력된 경우 입력된 신체 특성 정보가 고려된 아바타를 생성하 고, 온라인 상에서 판매/거래되는 복수의 상품 중 착용 시뮬레이션 적용을 희망하는 구매 희망 상품에 대한 사 용자 선택이 이루어지면, 선택된 구매 희망 상품의 착용이 이루어진 상품 착용 아바타의 영상을 생성하여 화면 에 표시할 수 있다. 이에 대한 보다 구체적인 설명은 다음과 같다.사용자 단말은 일예로 사용자로부터 사용자의 신체 특성 정보를 입력받을 수 있으며, 입력받은 신체 특성 정 보를 시뮬레이션부의 입력부로 제공할 수 있다. 이에 따라, 입력부는 사용자의 신체 특성 정보를 사용자 단말을 통해 사용자로부터 입력받을 수 있다. 이 외에도, 사용자 단말은 시뮬레이션부를 포 함한 본 장치 내 각 부의 동작을 제어(원격으로 제어)할 수 있다. 시뮬레이션부는 입력부, 아바타 생성부, 시뮬레이션 제어부, 식별부 및 평가부를 포 함할 수 있다. 입력부는 사용자로부터 사용자의 신체 특성과 관련된 정보인 신체 특성 정보를 입력받을 수 있다. 입력부 는 신체 특성 정보를 사용자 단말을 통해 입력받을 수 있고, 혹은 본 장치에 자체 구비된 화면을 통 해 입력받을 수 있다. 여기서, 신체 특성 정보는 일예로 사용자의 체형, 얼굴형 및 피부톤 중 적어도 하나를 포함할 수 있다. 이때, 사용자의 체형에 관한 정보라 함은 사용자의 몸의 모양(형태, 형상)에 관한 정보를 의미할 수 있다. 다만, 이에 만 한정되는 것은 아니고, 사용자의 체형에 관한 정보에는 사용자의 키, 몸무게, 발사이즈, 허리 사이즈, 가슴 사이즈 등 사용자의 신체 사이즈에 관한 각종 정보가 포함될 수 있다. 신체 특성 정보는 사용자와 닮은 3차원 아바타(3차원 모델)을 생성하는데 있어서 필요한 모든 정보를 의미할 수 있다. 일예로, 입력부는 사용자의 신체 특성 정보를 사용자 단말을 통해 사용자로부터 타이핑을 통해 직접 입 력받을 수 있다. 다른 일예로, 입력부는 사용자의 신체 특성 정보를 사용자 단말로부터 획득된 사용자 촬영 이미지로부터 추출함으로써 입력받을 수 있다. 구체적인 예로, 사용자는 신체 특성 정보를 입력하기 위해, 사용자 단말의 카메라를 이용해 본인의 신체 특성 정보에 대한 추출이 가능하도록 본인 자신을 촬영할 수 있다. 이때, 본인의 신체 특성 정보에 대한 추출이 가능하도록 촬영한다라 함은, 사용자의 체형(몸의 형태), 얼굴형, 피부톤이 나타 나도록 사용자의 전신 부위(혹은 사용자의 신체부위 중 적어도 일부의 신체부위)를 정면, 측면 등에서 촬영하는 것을 의미할 수 있으며, 이에 한정되는 것은 아니다. 사용자 단말을 통해 사용자 본인 자신을 촬영한 이미지인 사용자 촬영 이미지의 획득이 이루어진 경우, 입력 부는 획득된 사용자 촬영 이미지에 대한 이미지 분석을 수행하여 사용자 촬영 이미지로부터 신체 특성 정보 를 추출할 수 있다. 입력부는 사용자 촬영 이미지로부터 추출된 신체 특성 정보를 사용자의 신체 특성 정보 로서 입력받을 수 있다. 여기서, 이미지 분석시에는 기 알려져 있거나 향후 개발되는 다양한 이미지 분석 알고 리즘이 적용될 수 있다. 아바타 생성부는 입력부에서 입력받은 신체 특성 정보가 고려된 아바타를 생성할 수 있다. 아바타 생성부에 의해 생성되는 아바타는, 신체 특성 정보로서 입력받은 사용자의 체형, 얼굴형 및 피부톤 중 적어도 하나를 고려하여 생성된 3차원 아바타일 수 있다. 아바타 생성부에 의해 생성되는 아바타는 바람 직하게 입력부에서 입력받은 신체 특성 정보를 모두 반영하여 생성된 3차원 아바타임이 바람직할 수 있다. 아바타 생성부는 신체 특성 정보를 기반으로 하여, 사용자와 상당히 유사한(흡사한) 형상의 아바타를 3차원 으로 모델링하여 생성할 수 있다. 아바타 생성부는 사용자 자신을 닮은 체형의 아바타를 생성할 수 있다. 시뮬레이션 제어부는 온라인 상(웹 사이트들)에서 판매(거래)되는 복수의 상품 중 착용 시뮬레이션 적용을 희망하는 구매 희망 상품(혹은 착용 희망 상품)에 대한 사용자 선택이 이루어진 경우, 사용자에 의해 선택된 구 매 희망 상품의 착용이 이루어진 상품 착용 아바타의 영상을 생성하여 화면에 표시할 수 있다. 여기서, 상품 착 용 아바타라 함은, 아바타 생성부에 의해 생성된 아바타 상에 사용자에 의해 선택된 구매 희망 상품의 착용 이 이루어진 모습(구매 희망 상품이 입혀진 모습)의 아바타를 의미할 수 있다. 시뮬레이션 제어부는 생성된 상품 착용 아바타의 영상을 일예로 본 장치 자체에 구비된 화면 상에 표시 할 수 있으며, 다른 일예로 사용자 단말의 화면 상에 표시할 수 있다. 시뮬레이션 제어부가 생성된 아바타 상에 착용시키는 구매 희망 상품(즉, 아바타에 적용 가능한 구매 희망 상품)으로는 일예로 의류(상의, 하의), 신발, 모자, 액세서리(팔찌, 목걸이 등) 등이 포함될 수 있으며, 다만 이에만 한정되는 것은 아니고, 사용자의 신체의 적어도 일부에 착용 가능한 상품(제품, 아이템)이라면 무엇이든 적용될 수 있다. 즉, 본원에서 고려되는 상품이라 함은 일예로 온라인 쇼핑몰 상에서 판매, 거래되는 각종 상품을 의미할 수 있 다. 상품에는 일예로 의류, 패션 잡화, 화장품 등이 포함될 수 있다. 의류에는 상의, 하의, 원피스, 속옷 등 다 양한 의상들이 포함될 수 있으며, 패션 잡화에는 액세서리(악세사리), 구두, 신발, 핸드백, 지갑, 벨트, 모자 등이 포함될 수 있다. 이러한 예는 본원의 이해를 돕기 위한 하나의 예시일 뿐, 이에만 한정되는 것은 아니고, 상품에는 패션, 스타일링, 외모 꾸밈 등과 관련된 각종 물품, 물건 등이 포함(고려)될 수 있다. 사용자는 일예로 온라인 쇼핑몰 상에서 판매(거래)되는 복수의 상품 중 특정 상품을 구매하기에 앞서, 해당 특 정 상품이 자신에게 잘 어울리는지, 자신이 입었을 때의 핏이 어떻게 보여지는지, 품, 기장 등이 어떠한지, 해 당 특정 상품을 착용했을 때 조여지는 부분(타이트한 부분)이 없는지 등을 확인(시뮬레이션)하기 위해, 확인(시 뮬레이션)을 희망하는 해당 특정 상품을 구매 희망 상품으로서 선택할 수 있다. 즉, 사용자는 온라인 쇼핑몰 상에 판매되는 상품 중 아바타 생성부에서 생성된 아바타에 대하여 착용 시뮬 레이션을 수행하길 희망하는 상품을 구매 희망 상품으로서 선택할 수 있다. 일예로, 온라인 쇼핑몰 상에 복수의 상품으로서 제1 상품(일예로 상의-반팔), 제2 상품(일예로 하의-반바지), 제3 상품(일예로 하의-치마) 등이 판매되고 있다고 하자. 그리고 사용자가 제1 상품에 관심이 있어 제1 상품을 자신이 실제 착용했을 때의 모습을 시뮬레이션하고 싶은 경우, 제1 상품이 아바타 생성부에 의해 생성된 아 바타에 입혀진 모습의 영상을 보기 위해, 사용자는 제1 상품을 구매 희망 상품으로서 선택할 수 있다. 이러한 경우, 시뮬레이션 제어부는 복수의 상품 중 제1 상품에 대한 사용자 선택(사용자의 선택 입력)에 응 답하여, 구매 희망 상품인 제1 상품과 기 생성된 아바타를 서로 합성시킬 수 있으며, 이를 통해 제1 상품의 착 용이 이루어진 상품 착용 아바타의 영상을 생성할 수 있다. 이때, 상품 착용 아바타는 아바타 생성부에 의 해 생성된 아바타 상에 제1 상품이 입혀진 모습의 아바타를 의미하는 것으로서, 제1 상품의 착용이 이루어진 아 바타를 의미할 수 있다. 시뮬레이션 제어부는 생성된 상품 착용 아바타의 영상을 화면에 표시할 수 있다. 사용자는 화면에 표시되는 상품 착용 아바타를 통하여 제1 상품이 실제로 자신이 입었을 때 어떠한 모습으로 보여지는지에 대한 모습을 가 상으로 확인해 볼 수 있다. 이후, 시뮬레이션 제어부는 상품 착용 아바타의 자세를 변경시키는 시뮬레이션을 수행할 수 있다. 이때, 상 품 착용 아바타의 자세는 일예로 사용자의 실시간 자세 변경 조작 제어에 의해 변경될 수 있으며, 다른 일예로 기 설정된 복수 유형의 변경 자세로 자동으로 변경될 수 있다. 이때, 본원에서 상품 착용 아바타의 자세를 변경시킨다 함은, 정적인 상태로의 자세 변경을 의미할 수 있겠으나, 이에 한정되는 것은 아니고, 동적인 상태로의 자세 변경까지 모두 포함하는 넓은 개념으로 이해됨이 바람직할 수 있다. 예시적으로, 상품 착용 아바타의 기본 자세는 정자세일 수 있으며, 변경된 자세로는 다양한 높이별 의자에 앉은 자세, 맨 바닥에 쭈그린 자세, 걷는 자세, 뛰는 자세 등이 포함될 수 있으며, 뿐만 아니라 걷는 동작, 뛰는 동 작, 앉았다 일어서는 것을 반복하는 동작 등이 포함될 수 있다. 시뮬레이션 제어부는 사용자에 의해 선택된 구매 희망 상품의 상품 속성 정보를 고려하여, 상품 착용 아바 타의 자세를 변경시킴에 따른 상태 변화가 이루어지는 변화된 구매 희망 상품이 반영된 자세 변경 아바타의 영 상을 실시간으로 생성하여 화면에 표시할 수 있다. 즉, 시뮬레이션 제어부는 상품 착용 아바타의 자세 변경 에 응답하여, 변화되는 구매 희망 상품의 상태의 변화(일예로, 옷이 늘어나거나, 조이거나, 팽팽해지거나 하는 등의 변화)가 반영된 자세가 변경된 아바타(자세 변경 아바타)의 영상을 실시간으로 화면에 표시할 수 있다. 여기서, 구매 희망 상품의 상품 속성 정보에는 치수, 소재, 신축성, 및 비침 정도 중 적어도 하나에 관한 정보 가 포함될 수 있다. 예시적으로 구매 희망 상품이 반팔 상의인 경우, 치수 정보에는 단순히 S, M, L 와 같은 사 이즈 정보만 포함되는 것이 아니라, 총기장, 가슴단면, 어깨넓이, 소매길이 등의 정보가 포함될 수 있으며, 이 에 한정되는 것은 아니다. 구매 희망 상품의 상품 속성 정보는, 일예로 구매 희망 상품이 판매되는 온라인 쇼핑몰의 홈페이지 상에 개시된 정보의 크롤링(수집)을 통해 획득될 수 있다. 이에 따르면, 시뮬레이션 제어부는 복수의 상품 중 구매 희망 상품에 대한 사용자 선택이 이루어진 경우, 사용자에 의해 선택된 구매 희망 상품에 대한 상품 속성 정보를 크롤링을 통해 획득하고, 이후 획득된 상품 속 성 정보를 고려하여 상품 착용 아바타의 자세를 변경시킴에 따라 상태 변화가 이루어지는 구매 희망 상품이 적 용된 자세 변경 아바타의 영상을 실시간으로 화면에 표시할 수 있다. 즉, 상품 착용 아바타의 자세 변경에 따라실시간으로 화면에 표시되는 자세 변경 아바타는, 자세 변경으로 인한 변화된 구매 희망 상품의 상태(형상, 형 태 등)가 적용된(반영된) 자세가 변경된 아바타를 의미할 수 있다. 식별부는 화면에 표시되는 자세 변경 아바타 상에서, 변화된(상태 변화가 이루어진) 구매 희망 상품에 의하 여 기 설정된 조임 강도값 이상의 조임 강도값이 나타나는 조임 부위의 영역을 식별할 수 있다. 여기서, 조임 강도값이라 함은 조여지는 수준(정도)을 나타내는 값으로서, 타이트함(tightness) 정도값 등으로 달리 지칭될 수 있다. 시뮬레이션 제어부는 식별부에 의해 식별된 조임 부위의 영역을 자세 변경 아바타의 영상 상에 표시할 수 있다. 본원의 일예에서는 시뮬레이션 제어부가 자세 변경 아바타 상에서 식별된 조임 부위의 영역을 자세 변경 아 바타 상에 표시하는 것으로 예시하였으나, 이에만 한정되는 것은 아니다. 식별부는 상품 착용 아바타 상에 서 조임 부위의 영역을 식별할 수 있으며, 이에 따라 시뮬레이션 제어부는 상품 착용 아바타 상에서 식별된 조임 부위의 영역을 상품 착용 아바타 상에 표시할 수 있다. 시뮬레이션 제어부는 기 설정된 조임 강도값 이상의 조임 강도의 수준(정도)에 따라 자세 변경 아바타의 영 상 상에 표시되는 조임 부위의 영역에 대한 표시 형태를 달리할 수 있다. 이때, 시뮬레이션 제어부는 식별 부에 의해 자세 변경 아바타 상에서 식별된 조임 부위의 영역들 중 조임 강도의 수준이 높게 나타나는 조임 부위의 영역일수록, 그보다 상대적으로 조임 강도의 수준이 낮게 나타나는 조임 부위의 영역과 대비하여 보다 인식 또는 식별이 용이한 형태로 표시되도록 제어할 수 있다. 달리 말해, 시뮬레이션 제어부는 식별부에 의해 식별된 조임 부위가 제1 조임 부위 및 제2 조임 부위를 포함하되, 제1 조임 부위의 조임 강도값이 제2 조임 부위의 조임 강도값 보다 큰 경우, 자세 변경 아바타의 영 상(혹은 상품 착용 아바타 상에서) 제1 조임 부위의 영역이 제2 조임 부위의 영역 대비 보다 인식 또는 식별이 용이한 형태로 표시되도록 제어할 수 있다. 여기서, 조임 부위의 영역을 인식 또는 식별이 용이한 형태로 표시한다는 것은, 해당 조임 부위의 영역의 표시 가 시각적으로 강조된 형태, 크기가 확장된 형태, 청각적인 효과를 수반하는 형태 및 동적인 애니메이션 형태 중 적어도 하나로 표시하는 것을 의미할 수 있다. 이는 도 13을 참조하여 보다 쉽게 이해될 수 있다. 도 13은 본원의 일 실시예에 따른 상품 구매 서비스 제공 장치 내 식별부에 의해 식별된 조임 부위의 영 역이 화면 상에 표시되는 예를 설명하기 위한 도면이다. 도 13에는 일예로 식별부가 상품 착용 아바타 상에서 조임 부위의 영역을 식별함에 따라, 시뮬레이션 제 어부가 식별부에 의해 식별된 조임 부위의 영역을 상품 착용 아바타의 영상 상에 표시한 경우의 예 를 나타낸다. 다만, 이에만 한정되는 것은 아니고, 앞서 말한 바와 같이, 시뮬레이션 제어부는 식별부 에 의해 식별된 자세 변경 아바타 상에서의 조임 부위의 영역을 자세 변경 아바타 상에 표시할 수 있다. 후술하는 설명에서 조임 부위의 영역 식별 및 표시에 대해 설명함에 있어서, 상품 착용 아바타에 대하여 설 명되는 내용은 이하 생략된 내용이라 하더라도 자세 변경 아바타에 대한 설명에도 동일하게 적용될 수 있다. 도 13을 참조하면, 시뮬레이션 제어부는 사용자의 선택이 이루어진 구매 희망 상품의 착용이 이루어진 상품 착용 아바타의 영상을 화면에 표시할 수 있다. 이때, 상품 착용 아바타는 사용자의 신체 특성을 고려하여 생성된 3차원 아바타 상에 사용자가 선택한 구매 희망 상품의 착용이 이루어진 모습을 의미할 수 있다. 사용자가 선택한 구매 희망 상품(혹은 착용 희망 상품)이 일예로 복수개로서, 상의-나시인 제1 구매 희망 상품 , 하의-반바지인 제2 구매 희망 상품 및 양말인 제3 구매 희망 상품이 포함된다고 하자. 이러한 경 우, 시뮬레이션 제어부는 제1 구매 희망 상품 내지 제3 구매 희망 상품의 착용이 이루어진 아바타 (아바타 생성부에서 생성된 아바타)를 상품 착용 아바타로 하여 화면 상에 영상으로 표시할 수 있다. 이때, 식별부는 상품 착용 아바타 상에서, 착용된 구매 희망 상품(11, 12, 13)에 의하여 기 설정된 조임 강도값 이상의 조임 강도값이 나타나는 조임 부위의 영역을 식별할 수 있다. 이때, 식별부에 의하여, 기 설 정된 조임 강도값 이상의 조임 강도값이 나타나는 조임 부위의 영역으로서 제1 조임 부위와 제2 조임 부위 를 포함한 두 부위가 식별되었다고 하자. 이때, 제1 조임 부위의 조임 강도값이 제2 조임 부위의 조임 강도값보다 높게 나타난 경우, 시뮬레이션 제어부는 화면에 표시되는 상품 착용 아바타의 영상 상에서 제1 조임 부위의 영역이 제2 조임 부위의 영역 대비 보다 인식 또는 식별이 용이한 형태로 표시되도록 할 수 있다. 일예로, 시뮬레이션 제어부는 제1 조임 부위의 영역을 빨간색으로 표시하고, 제2 조임 부위의 영역 을 노란색으로 표시할 수 있다. 시뮬레이션 제어부는 일예로 조임 강도값이 가장 큰 값을 기준으로 점차 낮 아질수록 빨, 주, 노, 초 파, 남, 보와 같은 색상순으로 표시되도록 할 수 있다. 즉, 가장 높은 조임 강도값으 로 나타나는 영역은 빨간색, 가장 낮은 조임 강도값으로 나타나는 영역은 보라색으로 표시할 수 있다. 다른 일예로, 시뮬레이션 제어부는 제1 조임 부위의 영역의 표시 크기를 제2 조임 부위의 영역의 표시 크기보다 더 크게 하여 표시할 수 있다. 또 다른 일예로, 시뮬레이션 제어부는 제1 조임 부위의 영역을 볼딕으로 표시하고 제2 조임 부위의 영역을 볼딕 없이 표시할 수 있다. 또 다른 일예로, 시뮬레이션 제어부는 제1 조임 부위의 영역을 점멸 형태로 표시하는 반면, 제2 조임 부위의 영역을 정적인 형태로 표시할 수 있다. 이처럼, 시뮬레이션 제어부는 제1 조임 부위의 영역 을 점멸 형태로 표시(즉, 깜빡깜빡하게 표시)함으로써, 사용자로 하여금 제1 조임 부위의 영역이 제2 조임 부위의 영역 대비 상대적으로 더 많이 조이는 부위임을 직관적으로 인지할 수 있도록 제공할 수 있다. 즉, 시뮬레이션부는 자세 변경 아바타 혹은 상품 착용 아바타 상(혹은 해당 아바타의 영상 상)에서 조 임 부위의 영역을 표시함에 있어서, 상대적으로 조임 강도값이 더 높게 나타나는 영역이 그보다 조임 강도값이 낮게 나타나는 영역 대비 인식 또는 식별이 용이한 형태로 표시함으로써, 사용자가 해당 구매 희망 상품을 구매 하여 실제로 착용하였을 때 조임이 예상되는 부위(위치)를 미리 직관적으로 인지(확인)할 수 있도록 제공할 수 있다. 이러한 시뮬레이션부는 사용자가 해당 구매 희망 상품(착용 희망 상품)을 실제 구매하기에 앞서, 해당 구 매 희망 상품을 구매할지 여부에 대한 결정, 해당 구매 희망 상품 대비 다른 사이즈로 바꾸어 구매할지에 대한 결정, 혹은 해당 구매 희망 상품과는 다른 이종의 상품으로 구매할지에 대한 결정이 보다 신속하고 용이하게 이 루어지도록 하고, 상품(구매 희망 상품)에 대한 구매의 실패 확률이 낮아지도록 할 수 있다. 또한, 시뮬레이션 제어부는 식별부에 의해 식별된 조임 부위의 영역의 개수가 기 설정된 개수 이상인 것으로 판단되는 경우, 기 설정된 개수 이상으로 조임 부위의 영역이 나타나는 구매 희망 상품보다 한 단계 큰 치수를 갖는 동종 상품의 정보를 추천 상품으로서의 추천을 위해 화면의 일영역에 표시할 수 있다. 여기서, 기 설정된 개수는 일예로 3개일 수 있으나, 이에만 한정되는 것은 아니고, 그 개수는 다양하게 변경 설 정(적용)될 수 있다. 본원에서는 동종 상품의 정보의 추천이 이루어지는 화면이 일영역을 설명의 편의상 화면의 제1 영역이라 할 수 있다. 화면의 제1 영역에는 기 설정된 개수 이상의 조임 부위의 영역이 나타난 구매 희망 상품을 기준으로, 그 와 동종인 동종 상품의 정보(크기가 더 크거나 크기가 더 작은 동종의 상품의 정보 포함)가 표시될 수 있으며, 이에만 한정되는 것은 아니고 그와 이종인 상품의 정보가 표시될 수도 있다. 즉, 화면의 제1 영역은 동종 상품 의 정보를 포함하여 각종 상품 중 사용자에게 추천을 위한 추천 상품이 표시되는 영역을 의미할 수 있다. 달리 말하자면, 본원의 일예에서는 화면의 제1 영역에 추천 상품으로서 구매 희망 상품보다 한 단계 큰 치수를 갖는 동종 상품의 정보가 표시되는 것으로 예시하였으나, 이에만 한정되는 것은 아니고, 제1 영역에는 조임 부 위의 영역의 개수가 기 설정된 개수 이상으로 나타난 구매 희망 상품과 관련하여, 그와 종류는 같으나 사이즈가 더 큰 동종의 구매 희망 상품(이는 색상, 모양, 무늬 등이 모두 같고 크기만 다른 동종 구매 희망 상품을 의미 함), 그와 종류는 같으나 사이즈가 더 작은 동종의 구매 희망 상품, 그와 종류가 다른 이종의 구매 희망 상품 (이는 색상, 모양 및 무늬 중 적어도 하나가 다르거나 종류 자체가 다른 구매 희망 상품을 의미함) 등이 모두 같고 크기만 다른 동종 구매 희망 상품을 의미함) 등이 추천 상품으로서 표시될 수 있다. 일예로 자세 변경 아바타(혹은 상품 착용 아바타)가 복수의 구매 희망 상품을 착용하고 있고, 식별부가 복 수의 구매 희망 상품 중 어느 하나의 구매 희망 상품에서 조임 부위의 영역이 기 설정된 개수 이상으로 나타났 음을 식별하였다고 하자. 이러한 경우, 시뮬레이션 제어부는 기 설정된 개수 이상의 조임 부위의 영역이 나 타난 해당 구매 희망 상품(즉, 어느 하나의 구매 희망 상품)이 사용자에게 작은 것으로 판단(즉, 사용자가 해당 구매 희망 상품을 실제 구매하여 착용하였을 때 작을 수 있을 것이라 판단)하여, 해당 구매 희망 상품보다 한 단계(혹은 두단계 이상) 큰 치수(사이즈)를 갖는 동종의 상품의 정보를 추천 상품으로서 사용자에게 추천하고자 이를 화면의 일영역(제1 영역)에 표시할 수 있다. 이때, 시뮬레이션 제어부는, 구매 희망 상품에 대하여 기 설정된 개수 이상의 조임 부위의 영역이 식별된 경우(일예로, 5개의 조임 부위의 영역이 식별된 경우), 식별된 조임 부위의 영역의 개수, 식별된 조임 부위의 영역 각각에 대한 조임 강도값, 및 식별된 조임 부위의 영역의 위치 중 적어도 하나를 고려하여 구매 희망 상품 대비 몇 단계로 치수 차이가 나는 상품을 추천할 것인지를 결정할 수 있다. 즉, 시뮬레이션 제어부는 시뮬 레이션 결과(일예로, 조임 부위에 관한 정보)를 기반으로 추천 상품의 제공 여부를 결정할 수 있다. 예시적으로, 구매 희망 상품이 M 사이즈이고, 구매 희망 상품에서 식별된 조임 부위의 영역의 개수가 8개 이상 인 경우, 시뮬레이션 제어부는 구매 희망 상품 대비 2단계 큰 치수(XL 사이즈)를 갖는 동종의 상품의 정보 를 제1 영역에 표시할 수 있다. 구매 희망 상품이 M 사이즈이고, 구매 희망 상품에서 식별된 조임 부위의 영역 의 개수가 3개 이상 8개 미만인 경우, 시뮬레이션 제어부는 구매 희망 상품 대비 한단계(1단계) 큰 치수(즉, S 사이즈)를 갖는 동종의 상품의 정보를 제1 영역에 표시할 수 있다. 화면의 제1 영역에 표시되는 동종 상품의 정보는 동종 상품의 이미지일 수 있으며, 이에 한정되는 것은 아니고 동종 상품의 상품 속성 정보 중 적어도 하나가 포함될 수 있다. 상술한 본원의 일예에서는, 식별부가 기 설정된 조임 강도값(이는 기 설정된 조임 강도 상한값이라 달리 지 칭될 수 있음) 이상의 조임 강도값이 나타나는 조임 부위의 영역을 식별함에 따라, 그 결과에 따라 시뮬레이션 제어부가 보다 큰 치수의 동종 상품을 추천하는 경우에 대하여 예시하였으나, 이에만 한정되는 것은 아니다. 다른 일예로, 식별부는 기 설정된 조임 강도 하한값 미만에 해당하는 조임 강도값이 나타나는 조임 부위의 영역을 식별하고, 그 결과에 따라 시뮬레이션 제어부는 해당 구매 희망 상품이 사용자에게 너무 큰 것으로 판단하여 구매 희망 상품보다 한 단계(혹은 두단계 이상) 작은 치수의 동종 상품을 추천 상품으로서 화 면의 제1 영역에 표시할 수 있다. 시뮬레이션 제어부는, 화면의 제1 영역에 추천 상품으로서 일예로 구매 희망 상품보다 한 단계 큰 치수를 갖는 동종 상품의 정보(일예로 이미지)가 표시된 이후, 표시된 동종 상품의 정보에 대하여 사용자 입력이 이루 어진 경우, 사용자 입력에 응답하여 동종 상품의 착용이 이루어진 상품 적용 아바타의 영상을 생성해(재생성해) 화면에 표시할 수 있다. 즉, 시뮬레이션 제어부는 화면의 제1 영역에 추천 상품에 대한 사용자 입력이 이루어진 경우, 그에 응답하 여 실시간으로 사용자 입력이 이루어진 추천 상품이 착용된 상품 적용 아바타의 영상을 재생성하여 화면에 표시 할 수 있다. 이러한 시뮬레이션부는 상품 착용 아바타를 통하여 사용자가 선택한 상품(사용자가 선택한 구매 희망 상품, 사용자가 선택한 추천 상품)의 착용이 이루어진 아바타의 모습을 실시간으로 보여주되, 이때 상품이 착용 된 사용자 체형을 모델링한 아바타 상에서 착용된 상품에 의해 너무 조여지거나 너무 느슨한 부분의 위치를 화 면에 표시함으로써, 사용자의 신체 특성을 고려하여 생성된 아바타로 하여금 특정 상품을 실제 착용하였을 때 예상되는 모습을 현실감있게 제공받을 수 있다. 또한, 시뮬레이션부는 상품 착용 아바타의 자세를 변경시켜가며 자세 변경시마다 나타나는 조임 부위의 영 역을 실시간으로 표시해 줄 수 있어, 단순히 구매 희망 상품을 정자세로 입었을 때 뿐만 아니라 동적으로 움직 여 자세를 변경시켰을 때에도 조임이 예상되는 부분 등을 사용자가 직관적으로 인지할 수 있도록 할 수 있어, 해당 구매 희망 상품을 살지에 대한 결정이 보다 결단력 있게 이루어지도록 도울 수 있고 온라인 쇼핑몰에서의 상품의 구매 실패 확률을 효과적으로 줄일 수 있다. 평가부는, 시뮬레이션 제어부에 의해 화면에 표시된 상품 착용 아바타의 영상(혹은 자세 변경 아바타의 영상) 내 상품 착용 아바타에 대하여 스타일링 평가를 수행할 수 있다. 시뮬레이션 제어부는 평가부에 의한 스타일링 평가의 결과에 따라 화면의 일영역에 추천 상품의 정보를 표시할지 여부를 결정할 수 있다. 이때, 스타일링 평가 결과를 기반으로 추천 상품의 정보 표시가 이루어지는 화면의 일영역은 후술하는 설명에서 설명의 편의상 제2 영역이라 지칭될 수 있다. 평가부는 스타일링 평가의 수행시 복수의 평가 항목에 대한 평가 점수를 산출하되, 산출된 평가 점수에 기 반하여 복수의 평가 항목 중 평가 점수가 기 설정된 평가 점수를 충족하지 못하는 평가 항목을 점수 미달 평가 항목으로서 식별할 수 있다. 특히, 평가부는 후술하여 설명하는 사용자 아바타 영상에 대한 스타일링 평가 점수를 산출할 수 있으며, 이는 사용자 아바타 영상과 관련하여 복수의 평가 항목에 대한 평가 점수(토탈 평가 점수)를 의미할 수 있다. 이후, 시뮬레이션 제어부는 점수 미달 평가 항목에 대한 식별에 응답하여, 상품 착용 아바타에 착용된 구매 희망 상품 중 점수 미달 평가 항목과 관련된 구매 희망 상품에 대한 다른 상품으로의 대체를 위해 추천 상품의 정보를 화면의 일영역(제2 영역)에 표시할 수 있다. 여기서, 복수의 평가 항목은, 상품 착용 아바타에 착용된 구매 희망 상품들 간의 어울림 정도에 관한 제1 평가 항목 및 상품 착용 아바타의 피부톤과 상품 착용 아바타에 착용된 구매 희망 상품 간의 어울림 정도에 관한 제2 평가 항목을 포함할 수 있다. 다만, 이에만 한정되는 것은 아니고, 복수의 평가 항목에는 디자인(예시적으로, 상품의 무늬나 패턴 등), 색상(컬러) 조합 등과 관련하여, 아바타와 해당 아바타에 착용된 상품 간의 어울림 정 도, 상품들 간의 어울림 정도를 평가하는 항목이라면 무엇이든 적용 가능하다. 예시적으로, 제1 평가 항목에 의하면, 상품 착용 아바타에 구매 희망 상품으로서 구두와 상의가 착용되어 있는 경우 구두와 상의가 서로 어울리는지가 평가(서로 어울리는 정도가 평가)될 수 있다. 또한, 제1 평가 항목에 의 하면, 일예로 상품 착용 아바타에 상의-면티와 하의-치마가 착용되어 있는 경우 상의와 하의가 서로 어울리는지 가 평가될 수 있다. 또한, 제2 평가 항목에 의하면, 일예로 아바타의 피부 톤(일예로 얼굴 피부 색상)과 구매 희망 상품인 상의의 색상이 서로 어울리는지가 평가될 수 있다. 또한, 제2 평가 항목에 의하면, 아바타의 피부 톤이나 얼굴형과 구 매 희망 상품의 무늬 패턴(예를 들어, 줄무늬 패턴, 체크 패턴인 경우 등)과 서로 어울리는지가 평가될 수 있다. 평가부는 상품 착용 아바타에 대한 스타일링 평가시 상품 착용 아바타에 대한 평가 점수(즉, 복수의 평가 항목에 대한 평가 점수)를 산출할 수 있는데, 이때 상품 착용 아바타에 대한 평가 점수는 복수의 타 사용자에 의하여 평가된 타인 평가 점수를 고려하여 산출될 수 있다. 일예로, 사용자는 자신이 구매하길 희망하는 상품인 구매 희망 상품이 착용된 아바타(상품 착용 아바타, 자세 변경 아바타)에 대한 전반적인 스타일링(즉, 구매하고자 하는 의류가 사용자에게 어울리는지에 대한 전반적인 스타일링)을 타 사용자들에게 평가받기 위해(즉, 타 사용자에 의한 스타일링 평가를 받기 위해), 일예로 시뮬레 이션 제어부에 의해 생성되어 화면에 표시된 아바타(상품 착용 아바타, 자세 변경 아바타)의 영상에 대한 평가 요청 신호를 시뮬레이션부에 입력할 수 있다. 후술하는 설명에서는 시뮬레이션 제어부에 의해 생 성되어 화면에 표시된 아바타(상품 착용 아바타, 자세 변경 아바타)의 영상을 설명의 편의상 사용자에 대응하는 아바타의 영상으로서, 사용자 아바타 영상이라 지칭하기로 한다. 이때, 평가 요청 신호는 화면의 일영역에 마련된 평가 요청 버튼에 대한 사용자 입력이 이루어지는 경우, 평가 요청 버튼에 대한 사용자 입력에 응답하여 시뮬레이션 제어부에 의해 생성된 아바타의 영상(즉, 사용자 아 바타 영상)을 소셜 네트워크 서비스(Social Network Services/Sites, SNS) 상에 업로드하는 신호를 의미할 수 있다. 평가 요청 신호에 의하여, 사용자 아바타 영상이 SNS 상에 업로드되면, 해당 영상의 업로드가 이루어진 SNS의 이용자들(즉, 타 사용자들)은 사용자 아바타 영상에 대하여 복수의 평가 항목과 관련된 스타일링 평가를 수행할 수 있다. SNS의 이용자들(즉, 타 사용자들)은 사용자 아바타 영상에 대하여 복수의 평가 항목과 관련하여 평가 점수를 제공할 수(매길 수) 있으며, 이처럼 타 사용자에 의하여 평가된 점수는 타인 평가 점수라 지칭될 수 있 다. 평가부는 사용자 아바타 영상에 대하여 타 사용자들에 의해 평가된 적어도 하나의 점수(즉, 적어도 하나의 타인 평가 점수)를 고려하여 사용자 아바타 영상과 관련한 스타일링 평가 점수(즉, 사용자 아바타 영상과 관련 하여 복수의 평가 항목에 관한 토탈 평가 점수)를 산출할 수 있다. 이때, 사용자 아바타 영상과 관련된 스타일 링 평가 점수는, 일예로 사용자 아바타 영상에 대하여 평가된 타인 평가 점수들의 평균값으로 산출될 수 있으나, 이에만 한정되는 것은 아니다. 평가부는 사용자 아바타 영상과 관련한 스타일링 평가 점수에서 복수의 평가 항목 중 평가 점수가 기 설정 된 평가 점수를 충족하지 못하는 평가 항목을 점수 미달 평가 항목으로서 식별할 수 있다. 여기서, 일예로 점수 미달 평가 항목이 제2 평가 항목으로 식별되었다고 하자. 이러한 경우, 시뮬레이션 제어부는 사용자 아바타 영상 내 상품 착용 아바타의 피부톤과 해당 상품 착용 아 바타가 착용하고 있는 구매 희망 상품이 서로 어울리지 않는 것으로 판단(즉, 사용자가 구매하길 희망하는 구매 희망 상품이 사용자의 피부톤과 어울리지 않는 것으로 판단)하여, 점수 미달 평가 항목과 관련된 구매 희망 상 품에 대한 다른 상품으로의 대체를 위해 화면의 제2 영역에 추천 상품의 정보를 표시할 수 있다. 이때, 화면의 제2 영역에 표시되는 추천 상품은, 점수 미달 평가 항목과 관련된 구매 희망 상품을 대체하기 위한 대체 추천상품이라 달리 지칭될 수 있다. 또한, 평가부는 사용자 아바타 영상과 관련한 스타일링 평가 점수(즉, 사용자 아바타 영상과 관련하여 복수 의 평가 항목에 관한 토탈 평가 점수)를 산출함에 있어서, 타인 평가 점수를 이용하는 것 이외에도, 다른 일예 로 학습된 딥러닝 모델을 이용하여 스타일링 평가 점수를 산출할 수 있다. 딥러닝 모델은, 일예로 복수의 사용자의 신체 특성 정보(얼굴형, 피부톤, 사이즈 등)를 입력으로 하고 복수의 사용자의 신체 특성 정보 각각과 매칭되는 상품을 출력값으로 하여 학습하는 학습된 신경망 모델을 의미할 수 있다. 이러한, 딥러닝 모델은 인공지능(AI) 알고리즘 모델, 기계학습(머신러닝) 모델, 신경망 모델(인공 신경망 모 델), 뉴로 퍼지 모델 등을 의미할 수 있다. 또한, 딥러닝 모델로는 예시적으로 컨볼루션 신경망(Convolution Neural Network, CNN, 합성곱 신경망), 순환신경망(RNN, Recurrent Neural Network), 딥 신경망(Deep Neural Network) 등 종래에 이미 공지되었거나 향후 개발되는 다양한 신경망 모델이 적용될 수 있다. 시뮬레이션 제어부는 제2 영역에 표시되는 추천 상품의 정보(대체 추천 상품의 정보)로서, 대체 추천 상품 의 이미지, 대체 추천 상품의 리스트 등을 제공(표시)할 수 있다. 이때, 화면의 제2 영역에 표시되는 추천 상품(대체 추천 상품)에 포함된 리스트에는 점수 미달 평가 항목과 관 련된 구매 희망 상품과 색상만 다른 동종의 상품 및 점수 미달 평가 항목과 관련된 구매 희망 상품과 유사한 성 능(모양, 소재, 신축성, 비침 정도 등)을 가진 다른 이종의 상품이 포함될 수 있다. 이때, 다른 이종의 상품으 로는 점수 미달 평가 항목과 관련된 구매 희망 상품과 대비하여 후기(평가)가 더 좋거나, 가격이 더 낮거나, 품 질이 더 좋은 상품이 포함될 수 있다. 이에 따르면, 시뮬레이션부는 사용자가 구매 희망하는 상품(구매 희망 상품) 중 평가부에 의하여 사용 자에게 어울리지 않는 것으로 평가되는 상품(즉, 점수 미달 평가 항목과 관련된 구매 희망 상품)을 대체할 대체 추천 상품(대체 추천 상품)의 정보(일예로, 리스트)를 제공함에 있어서, 점수 미달 평가 항목과 관련된 구매 희 망 상품과 색상만 다른 동종의 상품뿐만 아니라 그와는 종류가 다르나 성능이 좋은 가성비 좋은 상품을 함께 대 체 추천 상품의 리스트에 포함시켜 제공(추천)할 수 있다. 이러한 시뮬레이션부는 사용자로 하여금, 점수 미달 평가 항목과 관련된 구매 희망 상품의 대체(교체)시, 합리적으로 상품 비교/선택이 가능하도록 하며, 보다 용이하고 효율적으로 대체/관리가 이루어지도록 지원할 수 있다. 또한, 시뮬레이션 제어부는 상품 착용 아바타의 영상에 포함된 구매 희망 상품의 구매를 위한 구매 버튼을 화면의 일영역에 표시할 수 있다. 이때, 후술하는 설명에서 구매 버튼이 이루어지는 화면의 일영역은 화면의 제 3 영역이라 달리 지칭될 수 있다. 시뮬레이션 제어부는 화면의 제3 영역에 표시된 구매 버튼에 대한 사용자 입력이 이루어진 경우, 화면에 표 시된 상품 착용 아바타 상에 착용된 구매 희망 상품의 구매를 위한 구매 요청 신호를 전송할 수 있다. 여기서, 구매 요청 신호는, 구매 희망 상품을 판매하는 온라인 쇼핑몰과 연계되어 구매 희망 상품의 자동 결제 가 가능(혹은 자동 결제로 인한 자동 배송이 가능)하도록 제공하는 신호이거나 및/또는 구매 희망 상품에 대한 주문 장려를 위해 본 장치와 연계된 사용자 단말의 화면에 메시지 알림을 제공하는 신호일 수 있다. 이러한 시뮬레이션부는 구매 버튼에 대한 사용자 입력에 응답하여 구매 요청 신호를 전송함으로써, 사용자 가 구매 희망하는 상품에 대한 착용 시뮬레이션을 본 이후 구매를 원하는 상품들을 동시에 일괄적으로 구매할 수 있도록 제공할 수 있어, 상품에 대한 사용자의 구매 편의성을 향상시킬 수 있다. 본 장치는 시뮬레이션부의 제공을 통해, 실제 피팅할 수 없는 온라인 쇼핑몰의 한계를 보완하여 상품에 대한 코디, 옷 구매 등에 도움을 줄 수 있는 기술을 제공할 수 있다. 본 장치는 옷, 액세서리, 메이크업 요 소 등이 포함된 다양한 종류의 상품을 아바타 생성부에 의해 생성된 아바타 상에 코디 가능하도록 제공할 수 있다. 본 장치는 사용자(구매자)가 온라인 쇼핑몰에서 판매되는 상품을 구매하기 전에, 해당 상품이 착용된 모습 (미리 착용 모습)을 시뮬레이션해 상품의 착용 핏을 보다 직관적으로 확인 가능하도록 제공할 수 있다. 본 장치 는 사용자(구매자, 소비자)가 구매를 희망하는 상품에 대한 구매를 행함에 있어서, 사용자가 보다 원활하게 구매할 수 있도록 도울 수 있다. 본 장치는 시뮬레이션부에 의한 착용 시뮬레이션(상품 착용 시뮬레이션)을 통하여, 아바타를 통해 보이 는 상품의 착용 핏(아바타 착용 핏)과 실제 사용자가 해당 상품을 구매하여 착용했을 때의 착용 핏(실제 착용 핏, 실제 코디한 모습)이 상당히 비슷하게 보이도록 제공할 수 있는바, 이를 통해 온라인 쇼핑몰 상에서의 상품 의 구매 실패 확률을 효과적으로 줄일 수 있다. 또한, 본 장치는 시뮬레이션부로 하여금, 온라인 쇼핑몰 상에서 본 상품(상품)을 구매하여 실제 받아보 았을 때 쇼핑몰 상에서 본 상품의 느낌/크기 등이 실제 상품을 본 느낌/크기 등과 다름에 따라 상품 구매의 만 족도가 높지 않고 교환/환불 등이 빈번히 일어나던 문제를 해소할 수 있다. 본 장치에서, 시뮬레이션부는 사용자의 신체 특성 정보를 고려하여 생성된 아바타에 구매 희망 상품을 착용시킴으로써 구매 희망 상품에 대한 착용 시뮬레이션을 수행할 수 있다. 이러한 본 장치는 시뮬레이션부를 통한 착용 시뮬레이션의 수행을 통하여, 사용자가 온라인 상에서 구 매하길 희망하는 구매 희망 상품에 대한 착용 핏(즉, 구매 희망 상품을 실제로 입었을 때 예측되는 착용 핏)을 미리 확인할 수 있도록 제공할 수 있으며, 또한 다른 의류 상품과의 핏 비교를 수행할 수 있도록 제공할 수 있 다. 이를 통해, 본 장치는 온라인 쇼핑몰 상에서 판매/거래되는 상품을 구매함에 있어서 구매 실패의 확률을 최소화하며 사용자가 원하는 핏을 가진 의류 상품을 효과적으로 구매할 수 있도록 도울 수 있다. 이하에서는 상기에 자세히 설명된 내용을 기반으로, 본원의 동작 흐름을 간단히 살펴보기로 한다. 도 14는 본원의 일 실시예에 따른 상품 구매 서비스 제공 방법에 대한 동작 흐름도이다. 도 14에 도시된 상품 구매 서비스 제공 방법은 앞서 설명된 본 장치에 의하여 수행될 수 있다. 따라서, 이하 생략된 내용이라고 하더라도 본 장치에 대하여 설명된 내용은 상품 구매 서비스 제공 방법에 대한 설명에도 동일하게 적용될 수 있다. 도 14를 참조하면, 단계S11에서 리뷰 정보 제공부는, 웹 사이트들로부터 수집된 상품에 대한 리뷰들을 통합적으 로 관리하고 제공할 수 있다. 다음으로, 단계S12에서 검색어 입력부는 사용자가 구매를 희망하는 구매 희망 상품에 대한 상품 검색어(구매 희 망 상품 검색어)를 사용자 단말로부터 입력받을 수 있다. 다음으로, 단계S13에서 제어부는 사용자 단말로부터 상품 검색어에 대한 리뷰 정보 제공 요청이 이루어진 경우, 요청에 응답하여 상품 검색어에 대응하는 리뷰 정보가 사용자 단말의 화면에 표시되도록 제어할 수 있다. 여기서, 리뷰 정보는, 리뷰 정보 제공부에 의해 관리되는 리뷰 정보들(통합 리뷰 정보들) 중 적어도 일부의 정 보로서, 복수의 판매 채널들 중 어느 하나의 판매 채널로부터 제공되는 정보일 수 있다. 또한, 단계S13에서 제어부는, 리뷰 정보의 표시 이후 화면의 일영역에 표시된 구매 추이 제공 메뉴에 대한 사용 자 입력이 이루어진 경우, 리뷰 정보와 관련하여 기 설정된 기간별 구매 건수에 대한 그래프 정보를 제공할 수 있다. 또한, 단계S13에서 제어부는, 사용자 단말로부터 구매 희망 상품에 대한 상품 유형 정보가 더 입력된 경우 상품 유형 정보별로 구매 추이 관련 리뷰 정보를 제공할 수 있다. 또한, 단계S13에서 제어부는, 리뷰 정보의 표시 이후 화면의 일영역에 표시된 실감 정보 제공 메뉴에 대한 사용 자 입력이 이루어진 경우, 구매 희망 상품에 대응하는 상품 실감 정보가 사용자에게 제공되도록 전방표시장치의 동작을 제어할 수 있다. 또한, 단계S13에서 제어부는, 사용자가 복수의 판매 채널 중 어느 하나의 판매 채널에 접속한 것으로 감지된 경 우, 구매 희망 상품의 상세정보를 포함한 구매 희망 상품 관련 상품 판매 페이지가 화면에 표시되도록 제어할 수 있다. 이때, 제어부는 화면의 일영역에 상세정보 내 키워드 검색을 위한 키워드 검색 아이콘을 표시할 수 있 다. 또한, 단계S13에서 제어부는, 키워드 검색 아이콘 내 키워드 입력부에 대한 사용자의 클릭 입력이 이루어진 경 우, 상세정보 내 설명 데이터의 글자 인식이 가능하도록 상세정보에 대응하는 페이지에 대하여 글자 인식 처리 를 수행할 수 있다. 또한, 제어부는 키워드 입력부를 통해 키워드가 입력된 경우, 글자 인식 처리된 설명 데이 터 중 입력된 키워드와 매칭되는 데이터를 매칭 키워드 데이터로서 검색하여 화면 상에 노출되도록 제어할 수 있다. 또한, 단계S13에서 제어부는, 키워드가 입력된 경우 글자 인식 처리된 설명 데이터 내 입력된 키워드의 유의어 가 존재하는지 검색하고, 검색 결과 유의어가 존재하는 경우, 키워드 검색 아이콘의 유의어 표시부 내에 검색된 유의어의 리스트를 표시할 수 있다 또한, 단계S13에서 제어부는, 유의어 표시부에 표시된 유의어의 리스트 중 적어도 하나의 유의어에 대한 사용자 의 선택 입력이 이루어진 경우, 글자 인식 처리된 설명 데이터 중 입력된 키워드 및 사용자가 선택한 상기 적어 도 하나의 유의어와 매칭되는 데이터를 매칭 키워드 데이터로서 함께 검색하여 화면 상에 노출되도록 제어할 수 있다. 상술한 설명에서, 단계 S11 내지 S13은 본원의 구현예에 따라서, 추가적인 단계들로 더 분할되거나, 더 적은 단 계들로 조합될 수 있다. 또한, 일부 단계는 필요에 따라 생략될 수도 있고, 단계 간의 순서가 변경될 수도 있다. 본원의 일 실시 예에 따른 상품 구매 서비스 제공 방법 및 상술한 도 3, 도 4, 도 5a 및 도 6a을 참조하여 설명 한 방법들은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판독 가능 매 체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 본 발명을 위하여 특별히 설계되고 구성 된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가능 기록 매 체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같 은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아 니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 상기된 하드웨어 장치는 본 발명의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역 도 마찬가지이다. 또한, 전술한 상품 구매 서비스 제공 방법 및 상술한 도 3, 도 4, 도 5a 및 도 6a을 참조하여 설명한 방법들은 기록 매체에 저장되는 컴퓨터에 의해 실행되는 컴퓨터 프로그램 또는 애플리케이션의 형태로도 구현될 수 있다."}
{"patent_id": "10-2022-0030872", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "전술한 본원의 설명은 예시를 위한 것이며, 본원이 속하는 기술분야의 통상의 지식을 가진 자는 본원의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본원의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본원의 범위에 포함되는 것으로 해 석되어야 한다."}
{"patent_id": "10-2022-0030872", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본원의 일 실시예에 따른 상품 구매 서비스 제공 시스템의 개략적인 구성을 나타낸 도면이다. 도 2는 본원의 일 실시예에 따른 상품 구매 서비스 제공 장치 내 리뷰 정보 제공부를 설명하기 위한 도면이다. 도 3은 본원의 일 실시예에 따른 상품 구매 서비스 제공 장치 내 리뷰 정보 제공부에 의해 리뷰 정보를 제공하 는 방법을 설명하기 위한 도면이다. 도 4는 본원의 일 실시예에 따른 상품 구매 서비스 제공 장치 내 리뷰 정보 제공부에 의해 상품 정보를 수집하 는 방법의 일 예를 설명하기 위한 도면이다. 도 5a는 본원의 일 실시예에 따른 상품 구매 서비스 제공 장치 내 리뷰 정보 제공부에 의해 리뷰 컨텐츠를 생성 하는 방법을 설명하기 위한 도면이다. 도 5b는 본원의 일 실시예에 따른 상품 구매 서비스 제공 장치 내 리뷰 정보 제공부가 리뷰 특징을 추출하기 위 해 이용하는 딥 러닝 모델의 예를 나타낸 도면이다. 도 6a는 본원의 일 실시예에 따른 상품 구매 서비스 제공 장치 내 리뷰 정보 제공부에 의해 리뷰 정보를 제공하 는 방법의 예를 설명하기 위한 도면이다. 도 6b는 본원의 일 실시예에 따른 상품 구매 서비스 제공 장치 내 리뷰 정보 제공부가 리뷰를 선별하기 위해 이용하는 딥 러닝 모델의 예를 나타낸 도면이다. 도 7은 종래 온라인 상에서 제공되는 리뷰의 형태를 설명하기 위한 도면이다. 도 8은 종래에 판매 채널에서 제공되는 상품 판매 페이지의 예를 나타낸 도면이다. 도 9는 종래에 판매 채널에서 제공되는 상품 판매 페이지 내 상세정보의 예를 나타낸 도면이다. 도 10은 본원의 일 실시예에 따른 상품 구매 서비스 제공 장치의 제어부에 의해 제공되는 키워드 검색 아이콘이 상세정보가 표시된 상품 판매 페이지 상에 표시된 화면의 예를 나타낸 도면이다. 도 11은 본원의 일 실시예에 따른 상품 구매 서비스 제공 장치의 제어부가 제공하는 키워드 검색 아이콘의 예를 나타낸 도면이다. 도 12는 본원의 일 실시예에 따른 상품 구매 서비스 제공 장치에 의해 사용자에게 상품 실감 정보가 제공되는 경우의 예를 나타낸 도면이다. 도 13은 본원의 일 실시예에 따른 상품 구매 서비스 제공 장치 내 식별부에 의해 식별된 조임 부위의 영역이 화 면 상에 표시되는 예를 설명하기 위한 도면이다. 도 14는 본원의 일 실시예에 따른 상품 구매 서비스 제공 방법에 대한 동작 흐름도이다."}
