{"patent_id": "10-2019-0178247", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0085323", "출원번호": "10-2019-0178247", "발명의 명칭": "재난 현장에서 요구조자에게 대피 경로를 안내하는 방법 및 시스템", "출원인": "동아대학교 산학협력단", "발명자": "김종식"}}
{"patent_id": "10-2019-0178247", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "재난 현장에서 요구조자에게 대피 경로를 안내하는 방법으로서,하나 이상의 측위 디바이스와 요구조자가 소지한 스마트 디바이스 사이에 송수신되는 신호의 세기를 검출하고,검출된 신호의 세기에 기반하여 요구조자의 위치를 측정하는 단계;하나 이상의 재난 감지 센서로부터 수신된 센서 정보에 기반하여 재난 발생 여부 및 재난 발생 지점을 감지하는단계;재난이 감지될 경우 구조가 필요한 미대피 요구조자의 인원수 및 위치를 포함하는 요구조자 현황을 결정하여 재난 관리 센터로 전송하는 단계; 및구조가 필요한 요구조자마다 상기 재난 발생 지점을 회피하는 대피 경로를 결정하고, 결정된 대피 경로를 요구조자의 스마트 디바이스에 제공하는 단계를 포함하는, 대피 경로 안내 방법."}
{"patent_id": "10-2019-0178247", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 측위 디바이스는, 상기 스마트 디바이스의 MAC ID를 수신하고, 상기 스마트 디바이스로부터 수신된 블루투스 또는 무선 통신 신호의 세기를 측정하며, 측정된 세기에 기반하여 삼각 측량법을 활용하여 상기 요구조자의위치를 층과 방 단위로 구별하는, 대피 경로 안내 방법."}
{"patent_id": "10-2019-0178247", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 대피 경로를 제공하는 단계는,다익스트라 스타 알고리즘(Dijkstra's star algorithm)을 활용하여 상기 대피 경로를 결정하는 것을 포함하는,대피 경로 안내 방법."}
{"patent_id": "10-2019-0178247", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 대피 경로를 제공하는 단계는,결정된 대피 경로를 적외선으로 표시하는 것을 포함하는, 대피 경로 안내 방법."}
{"patent_id": "10-2019-0178247", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 재난은 화재이고,상기 재난 감지 센서는, 카메라, 연기 감지 센서, 불꽃 감지 센서, 및 온도 감지 센서, 충격 감지 센서, 접촉감지 센서, 음성 감지 센서, 인체 감지 센서, 조도 감지 센서, 및 가스 감지 센서 중 적어도 하나를 포함하는,대피 경로 안내 방법."}
{"patent_id": "10-2019-0178247", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 재난 발생 여부 및 재난 발생 지점을 감지하는 단계는,상기 재난 감시 센서의 성능, 적용된 재난 감지 알고리즘, 현재 시각 및 날씨에 따라 결정되는 상기 센서 신호공개특허 10-2021-0085323-3-에 상이한 가중치를 적용하여 화재를 감지하는, 대피 경로 안내 방법."}
{"patent_id": "10-2019-0178247", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 대피 경로를 제공하는 단계는,GCM(Google Cloud Message) 서버, 3G 메시징 서버, 및 4G 메시징 서버 중 적어도 하나를 사용하여 상기 대피경로를 상기 스마트 디바이스로 송신하는, 대피 경로 안내 방법."}
{"patent_id": "10-2019-0178247", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "재난 현장에서 요구조자에게 대피 경로를 안내하는 시스템으로서,요구조자가 소지한 스마트 디바이스 사이에 송수신되는 신호의 세기를 검출하는 하나 이상의 측위 디바이스;요구조자 주위 환경에 재난이 발생하였는지를 감지하기 위한 센서 정보를 수집하는 하나 이상의 재난 감지센서; 및상기 신호의 세기에 기반하여 상기 요구조자의 위치를 측정하고, 상기 센서 정보에 기반하여 재난 발생 여부 및재난 발생 지점을 감지하며, 재난이 감지될 경우 구조가 필요한 미대피 요구조자의 인원수 및 위치를 포함하는요구조자 현황을 결정하여 재난 관리 센터로 전송하고, 구조가 필요한 요구조자마다 상기 재난 발생 지점을 회피하는 대피 경로를 결정하고, 결정된 대피 경로를 요구조자의 스마트 디바이스에 제공하도록 구성되는 중앙 제어부를 포함하는, 대피 경로 안내 시스템."}
{"patent_id": "10-2019-0178247", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 측위 디바이스는 상기 스마트 디바이스의 MAC ID를 수신하고,상기 중앙 제어부는,수신된 MAC ID를 기반으로 상기 요구조자를 식별하고, 상기 스마트 디바이스로부터 수신된 블루투스 또는 무선통신 신호의 세기를 측정하며, 측정된 세기에 기반하여 삼각 측량법을 활용하여 상기 요구조자의 위치를 층과방 단위로 구별하도록 구성되는, 대피 경로 안내 시스템."}
{"patent_id": "10-2019-0178247", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 중앙 제어부는,다익스트라 스타 알고리즘(Dijkstra's star algorithm)을 활용하여 상기 대피 경로를 결정하도록 구성되는, 대피 경로 안내 시스템."}
{"patent_id": "10-2019-0178247", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서, 상기 중앙 제어부는,결정된 대피 경로를 적외선으로 표시하도록 구성되는, 대피 경로 안내 시스템."}
{"patent_id": "10-2019-0178247", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제8항에 있어서,상기 재난은 화재이고,상기 재난 감지 센서는, 카메라, 연기 감지 센서, 불꽃 감지 센서, 및 온도 감지 센서, 충격 감지 센서, 접촉감지 센서, 음성 감지 센서, 인체 감지 센서, 조도 감지 센서, 및 가스 감지 센서 중 적어도 하나를 포함하는,대피 경로 안내 시스템.공개특허 10-2021-0085323-4-청구항 13 제12항에 있어서, 상기 중앙 제어부는, 상기 재난 감시 센서의 성능, 적용된 재난 감지 알고리즘, 현재 시각 및 날씨에 따라 상기센서 신호에 상이한 가중치를 적용하여 화재를 감지하도록 구성되는, 대피 경로 안내 시스템."}
{"patent_id": "10-2019-0178247", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제8항에 있어서,상기 중앙 제어부는,GCM(Google Cloud Message) 서버, 3G 메시징 서버, 및 4G 메시징 서버 중 적어도 하나를 사용하여 상기 대피경로를 상기 스마트 디바이스로 송신하도록 구성되는, 대피 경로 안내 시스템."}
{"patent_id": "10-2019-0178247", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "재난 현장에서 요구조자에게 대피 경로를 안내하는 방법 및 시스템이 개시된다. 대피 경로 안내 방법은, 하나 이상의 측위 디바이스와 요구조자가 소지한 스마트 디바이스 사이에 송수신되는 신호의 세기를 검출하고, 검출된 신호의 세기에 기반하여 요구조자의 위치를 측정하는 단계; 하나 이상의 재난 감지 센서로부터 수신된 센서 정보 (뒷면에 계속)"}
{"patent_id": "10-2019-0178247", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 재난 현장에서 요구조자의 인명을 보호하기 위한 기술에 관한 것이고, 특히 재난 발생 여부 및 발생 지점을 파악하고 재난 발생시 요구조자의 인원수 및 위치를 제공하는 것은 물론, 요구조자에게 최적의 대피 경 로를 제공함으로써 요구조자의 인명을 보호하기 위한 방법 및 시스템에 관한 것이다."}
{"patent_id": "10-2019-0178247", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "화재는 한번 발생하면 피해를 입히는 범위나 피해의 정도가 매우 크며, 이러한 피해에는 재산적 피해는 물론이 고 인명 피해도 포함된다. 또한, 지난 2005년에 발생한 낙산사 화재로 인해 우리나라 보물 제479호였던 조선 초기 동종이 소실된 것과 같이, 화재로 인하여 발생된 손실은 복구하거나 보상하기가 불가능한 경우도 많다. 구체적으로 살펴보면, 최근 5년간 우리나라에서 발생한 화재 건수는 약 22만 건이며, 이로 인한 사망자와 부상 자 수는 약 10,000여명이 넘고, 1조 5천억원 정도의 재산상 손실을 가져왔다. 그러므로 화재로 인한 인명과 재 산 피해를 줄이기 위하여 조기에 화재를 감지하는 기술의 개발이 매우 중요하다. 화재로 인한 이와 같은 피해를 줄이기 위한 소방 산업의 규모는 점점 커지고 있으며, 특히 국내 소방 산업은 전 체 시장 규모가 2018년 기준 약 16조원에 달하고 있다. 특히, 2013년부터 연평균성장률은 4.5%, 평균 영업이익 률은 7% 수준으로 전 산업 평균과 비교할 때 높은 규모로 성장하고 있으나, 중소 기업의 매출 비중이 전체 시장 의 53.1%에 이르는 등 전체적으로는 영세사업자들의 비중이 과반을 차지하고 있다. 그러나, 앞으로는 우리 나라의 재난망 구축은 물론, 유럽의 ETSI(European Telecommunication Standards Institute : 유럽통신표준기구)에서도 차세대 PPDR(Public Protection and Disaster Relief: 공공안전 및 재난 구조) 시스템 표준에 적극적으로 나서고 있어, 향후 LTE 기반 PPDR 표준이 완료되면 각국에서 광대역 PPDR 서비 스가 시작될 것으로 예상된다. 그런데, 종래의 화재 감지 시스템은 화재 감지 센서(연기 감지, 불꽃 감지, 온도 감지 센서)를 사용하여 화재를 감지하거나, 화재 감시 카메라를 이용하여 촬영된 영상을 분석하여 화재를 감시한다. 이 중 연기 감시 방식으로 는 흔히 센서를 이용한 광전식 스포트형, 광전식 분리형, 이온화식과 공기흡입형 등이 사용되어 왔다. 그런데, 이와 같은 화재 감지 센서를 이용하여 화재를 감지할 경우, 주변 환경에 따라서 화재 오감지의 가능성이 크다. 예를 들어, 연기 감지 센서는 폐쇄적인 공간에만 적용될 수 있다. 즉, 센서를 이용하여 연기를 감지하기 위해서 는 열이나 연기가 직접 센서 내로 유입되거나 흡입되어야 한다. 따라서, 연기가 외부 공간으로 확산되거나 외 부 환경에 노출되는 경우에는, 비나 바람에 의해 연기의 농도가 약해지기 때문에 연기를 정확히 감지하는 것이 힘들며, 경우에 따라서는 감지 자체가 불가능해 질 수도 있다. 즉, 화재 감지 센서를 사용할 경우에는 주변 환 경에 따라 오감지의 가능성이 크며, 넓은 지역을 커버하기 위해서는 비용적인 문제가 존재한다. 대한민국 특허 공개 번호 1020160061614 호(발명의 명칭 \"화재 감지 시스템\", 공개일 2016.06.01)는 연기를 감 지하기 위한 영상 정보를 획득하는 제 1 정보 획득부; 불꽃을 감지하기 위한 정보를 획득하는 제 2 정보 획득부; 및 상기 제 1 정보 획득부 또는 상기 제 2 정보 획득부의 동작을 제어하고, 상기 제 1 정보 획득부 또 는 상기 제 2 정보 획득부로부터 획득된 정보를 처리하는 프로세서부;를 포함하되, 상기 제 1 정보 획득부는 초 광각 카메라를 포함하고, 상기 제 2 정보 획득부는 적외선 영역의 영상을 획득하는 적외선 카메라 또는 적외선센서를 포함하는 화재 감지 시스템을 개시한다. 이러한 화재 감지 시스템에 따르면, 초광각 카메라를 이용하여 연기를 감지할 뿐만 아니라 해당 화재 영역의 영상 획득이 가능하여 넓은 공간에 대해 하나의 카메라를 이용하 여 대응할 수 있다. 그런데, 종래의 화재 감지 시스템에서는 장비들의 통신이 유선으로 이루어지며, 화재 발생 시 화재 발생 위치 및 탈출 경로를 능동적으로 안내하지 못한다. 따라서, 화재 발생 시 위치 정보가 없기 때문에 화재 진압 및 대 피가 곤란하고, 통신 방식이 유선 방식이기 때문에 초기 설치비용이 많이 들고 고장 유무를 자동으로 확인 할 수 없다. 더 나아가, 화재 발생 시 탈출하는 것이 전적으로 요구조자 개인의 경험과, 상황 판단에 의존하는 방식이라 대 형 화재 발생 시 인명피해 크게 발생하고 있고, 화재 진압 소방대원이 출동 시 화재 현장 내부에 잔류 인원의 인원수와 위치를 파악하지 못하기 때문에 효율적인 인명 구조가 곤란하다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 특허 공개 번호 1020160061614 호(발명의 명칭 \"화재 감지 시스템\", 공개일 2016.06.01)"}
{"patent_id": "10-2019-0178247", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 화재 발생 시 화재 발생 위치 및 탈출 경로를 요구조자에게 능동적으로 안내할 수 있는 대피 경로 안내 방법을 제공하는 것이다. 본 발명의 다른 목적은, 화재 현장 내부에 잔류 요구조자의 인원수와 위치를 재난 관리 센터에 자동으로 제공할 수 있는 대피 경로 안내 시스템을 제공하는 것이다."}
{"patent_id": "10-2019-0178247", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 목적들을 달성하기 위한 본 발명의 일면은, 재난 현장에서 요구조자에게 대피 경로를 안내하는 방 법에 관한 것이다. 본 발명에 의한 대피 경로 안내 방법은, 하나 이상의 측위 디바이스와 요구조자가 소지한 스마트 디바이스 사이에 송수신되는 신호의 세기를 검출하고, 검출된 신호의 세기에 기반하여 요구조자의 위치 를 측정하는 단계; 하나 이상의 재난 감지 센서로부터 수신된 센서 정보에 기반하여 재난 발생 여부 및 재난 발 생 지점을 감지하는 단계; 재난이 감지될 경우 구조가 필요한 미대피 요구조자의 인원수 및 위치를 포함하는 요 구조자 현황을 결정하여 재난 관리 센터로 전송하는 단계; 및 구조가 필요한 요구조자마다 상기 재난 발생 지점 을 회피하는 대피 경로를 결정하고, 결정된 대피 경로를 요구조자의 스마트 디바이스에 제공하는 단계를 포함한 다. 상기 측위 디바이스는 상기 스마트 디바이스의 MAC ID를 수신하고, 상기 스마트 디바이스로부터 수신된 블 루투스 또는 무선 통신 신호의 세기를 측정하며, 측정된 세기에 기반하여 삼각 측량법을 활용하여 상기 요구조 자의 위치를 층과 방 단위로 구별한다. 상기 대피 경로를 제공하는 단계는 다익스트라 스타 알고리즘 (Dijkstra's star algorithm)을 활용하여 상기 대피 경로를 결정한다. 상기 대피 경로를 제공하는 단계는 결정 된 대피 경로를 적외선으로 표시하는 것을 포함한다. 특히, 상기 재난은 화재이고, 상기 재난 감지 센서는, 카 메라, 연기 감지 센서, 불꽃 감지 센서, 및 온도 감지 센서, 충격 감지 센서, 접촉 감지 센서, 음성 감지 센서, 인체 감지 센서, 조도 감지 센서, 및 가스 감지 센서 중 적어도 하나를 포함한다. 또한, 재난 발생 여부 및 재 난 발생 지점을 감지하는 단계는, 상기 재난 감시 센서의 성능, 적용된 재난 감지 알고리즘, 현재 시각 및 날씨 에 따라 결정되는 상기 센서 신호에 상이한 가중치를 적용하여 화재를 감지한다. 상기 대피 경로를 제공하는 단계는, GCM(Google Cloud Message) 서버, 3G 메시징 서버, 및 4G 메시징 서버 중 적어도 하나를 사용하여 상 기 대피 경로를 상기 스마트 디바이스로 송신하는 것을 포함한다. 상기와 같은 목적들을 달성하기 위한 본 발명의 다른 면은, 재난 현장에서 요구조자에게 대피 경로를 안내하는 시스템에 관한 것이다. 본 발명에 의한 대피 경로 안내 시스템은 요구조자가 소지한 스마트 디바이스 사이에 송수신되는 MAC ID 와 신호의 세기를 검출하는 하나 이상의 측위 디바이스; 요구조자 주위 환경에 재난이 발생 하였는지를 감지하기 위한 센서 정보를 수집하는 하나 이상의 재난 감지 센서; 및 상기 신호의 세기에 기반하여상기 요구조자의 위치를 측정하고, 상기 센서 정보에 기반하여 재난 발생 여부 및 재난 발생 지점을 감지하며, 재난이 감지될 경우 구조가 필요한 미대피 요구조자의 인원수 및 위치를 포함하는 요구조자 현황을 결정하여 재 난 관리 센터로 전송하고, 구조가 필요한 요구조자마다 상기 재난 발생 지점을 회피하는 대피 경로를 결정하고, 결정된 대피 경로를 요구조자의 스마트 디바이스에 제공하도록 구성되는 중앙 제어부를 포함한다. 상기 측위 디바이스는 상기 스마트 디바이스의 MAC ID를 수신하고, 상기 중앙 제어부는, 수신된 MAC ID를 기반으로 상기 요구조자를 식별하고, 상기 스마트 디바이스로부터 수신된 블루투스 또는 무선 통신 신호의 세기를 측정하며, 측정된 세기에 기반하여 삼각 측량법을 활용하여 상기 요구조자의 위치를 층과 방 단위로 구별하도록 구성된다. 또한, 상기 중앙 제어부는 다익스트라 스타 알고리즘(Dijkstra's star algorithm)을 활용하여 상기 대피 경로를 결정하고, 결정된 대피 경로를 적외선으로 표시하도록 구성된다."}
{"patent_id": "10-2019-0178247", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하여, 화재현장 잔류 인원의 위치 측위를 통하여 골든타임 내에 사람들의 안전한 대피가 가능하도 록 인공지능이 분석하고 최단거리인 대피 경로를 자동으로 결정하여 요구조자에게 제공할 수 있다. 또한, 본 발명에 의하여, 재난 현장에 남아 있는 요구조자의 인원수와 위치를 구조자가 알 수 있게 됨으로써, 요구조자를 신속하게 구조할 수 있고, 구조 효율을 극대화할 수 있다."}
{"patent_id": "10-2019-0178247", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명과 본 발명의 동작상의 이점 및 본 발명의 실시에 의하여 달성되는 목적을 충분히 이해하기 위해서는 본 발명의 바람직한 실시예를 예시하는 첨부 도면 및 첨부 도면에 기재된 내용을 참조하여야만 한다. 이하, 첨부한 도면을 참조하여 본 발명의 바람직한 실시예를 설명함으로서, 본 발명을 상세히 설명한다. 그러 나, 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며, 설명하는 실시예에 한정되는 것이 아니다. 그리고, 본 발명을 명확하게 설명하기 위하여 설명과 관계없는 부분은 생략되며, 도면의 동일한 참조부호는 동일한 부재 임을 나타낸다. 도 1은 본 발명의 일면에 의한 대피 경로 안내 시스템을 개략적으로 나타내는 블록도이다. 도 1을 참조하면, 대피 경로 안내 시스템은 측위 디바이스(110, 112, 114), 재난 감지 센서(120, 122, 124), 중앙 제어부, 및 재난 관리 센터를 포함하고, 중앙 제어부는 요구조자 위치 측정부, 재난 감지부, 요구조자 현황 결정부, 대피 경로 결정부, 및 대피 경로 제공부를 포함한다. 그리고, 측위 디바이스(110, 112, 114)의 동작을 설명하기 위하여 도 2를 함께 참조한다. 도 2는 본 발명에 의 한 대피 경로 안내 시스템에서 요구조자의 이동에 따른 위치를 파악하는 과정을 예시하는 도면이다. 측위 디바이스(BC1, BC2, BC3)는 요구조자가 소지한 스마트 디바이스 사이에 송수신되는 MAC ID 및 신호의 세기 를 검출한다. 시점 t1에서, 요구조자는 입구를 통해 제 1 장소(L1)에 진입한다. 그러면, 요구조자가 소지한 스마트 디바이스 는 3 개의 측위 디바이스(BC1, BC2, BC3)로부터 무선 신호를 수신한다. 수신된 무선 신호의 세기(RSSI)로부터 각 측위 디바이스(BC1, BC2, BC3)로부터의 거리를 연산하고, 각 측위 디바이스(BC1, BC2, BC3)들의 위치와 그로 부터의 거리를 삼변측량(trilateration) 또는 삼각측량(triangulation) 기법에 적용하면 요구조자의 위치를 알 수 있다. 세 개 이상의 측위 디바이스(BC1, BC2, BC3)로부터의 거리를 바탕으로, 특히 실내에서 스마트 디바이 스의 위치를 측정하는 기술은 이미 공지되어 있으므로, 명세서의 간략화를 위하여 반복적인 설명이 생략된다. 요구조자가 계속 이동하면, t2 시점에서 요구조자는 제 2 장소(L2)에 진입하게 된다. 그러면, 요구조자의 스마 트 디바이스에 가장 가까운 측위 디바이스는 이제 제 2 측위 디바이스(BC2)가 된다. 요구조자가 계속이동하면, t3 시점에서 요구조자는 제 3 장소(L3)에 진입한다. 그러면, 요구조자의 스마트 디바이스에 가장 가 까운 측위 디바이스는 이제 제 3 측위 디바이스(BC3)가 된다. 이와 같이, 요구조자 위치 측정부는 측위 디바이스(110, 112, 114)로부터 수신된 신호의 세기로부터 요구 조자의 위치를 파악할 수 있다. 도 2에는 요구조자가 단방향으로 이동하는 것이 설명되었으나, 본 발명은 이에 한정되는 것이 아니다. 또한, 본 발명의 측위 디바이스(110, 112, 114)는 건물의 여러 층에 걸쳐 다르게 설치될 수도 있다. 측위 디바이스 (110, 112, 114)가 여러 층에 설치되어 있는 경우, 요구조자가 위치한 층의 상하 층에 설치된 측위 디바이스도 요구조자가 소지한 스마트 디바이스로부터 무선 신호를 수신할 수 있다. 하지만, 층 사이의 콘크리트 등 무선 신호가 잘 전파될 수 없는 매질이 존재하기 때문에, 스마트 디바이스가 위치된 층의 측위 디바이스가 가장 강한 무선 신호를 수신하게 될 것이다. 그러면, 여러 층에 설치된 측위 디바이스에 의해 수신된 무선 신호의 평균을 구하고, 가장 큰 값의 평균에 해당하는 층에 요구조자가 위치되어 있다고 우선 결정한다. 그리고, 결정된 층 내의 측위 디바이스들 사이에서 삼변측량 또는 삼각측량 기법을 적용하면 해당 층 내의 요구조자의 위치를 정확 하게 측정할 수 있다. 요구조자 위치 측정부는 요구조자가 소지한 스마트 디바이스의 MAC ID를 사용하여 요구조자를 식별할 수 있다. 이와 같이, 요구조자가 개인별로 식별되기 때문에, 요구조자의 인원수를 정확하게 알 수 있게 된다. 재난 감지 센서(120, 122, 124)는 요구조자 주위 환경에 재난이 발생하였는지를 감지하기 위한 센서 정보를 수 집하여 중앙 제어부로 전송한다. 그러면, 중앙 제어부의 재난 감지부가 수신된 센서 정보에 기 반하여 재난 발생 여부와 재난 발생 위치를 판단한다. 본 명세서에서 재난은 건물 내의 화재, 범죄자의 침입, 가스 누출, 터널과 같이 폐쇄된 공간 내의 고립 등 인명을 위협하는 모든 상황을 가리킬 수 있다. 재난 감지 센서(120, 122, 124)에 대해서는 본 명세서의 해당 부분에서 상세히 후술된다. 그러므로, 명세서의 간략화를 위하여 반복적인 설명이 생략된다. 재난 감지부가 재난이 발생하였다고 감지하면, 요구조자 현황 결정부는 구조가 필요한 미대피 요구조 자의 인원수 및 위치를 포함하는 요구조자 현황을 결정하여 재난 관리 센터로 전송한다. 본 명세서에서 요구조자 현황이란 요구조자의 인원수, 요구조자의 위치는 물론, 요구조자의 건강 상태, 여러 요구조자들이 함 께 그룹화되어 있는지 여부, 및 요구조자가 소지한 응급 대응 물품 및 식량 등을 포함할 수 있다. 요구조자 현 황 결정부가 요구조자 현황을 재난 관리 센터에 제공하기 때문에, 재난 관리 센터는 구조에 필 요한 구조대원의 수, 구조 방법, 요구조자의 위치까지의 진입 경로 등을 효과적으로 결정할 수 있고, 구조시까 지 요구조자에게 제공할 응급 대처 정보를 제공하여 인명 피해를 최소화할 수 있다. 또한, 대피 경로 결정부는 각 요구조자에게 최적인 대피 경로를 결정할 수 있다. 이를 위하여, 대피 경로 결정부는 다익스트라 스타 알고리즘(Dijkstra's star algorithm)을 활용하여 요구조자별 대피 경로를 결정 할 수 있다. 다익스트라 스타 알고리즘은 그래프에서 노드 사이의 최단 경로를 찾는 알고리즘으로서, 에츠허르 다익스타라가 고안한 알고리즘에 추가로 여러 경로 중 최단 경로를 최소 시간에 알려주는 최적 경로 탐색 알고리즘이다. 특히, 다익스트라 스타 알고리즘은 음의 가중치가 없는 그래프에서 한 노드에서 다른 모든 노드까지의 최단거리 를 구하는데 적합하다. 다익스트라 스타 알고리즘은 가능한 적은 비용으로 가장 빠르게 해답에 도달하는 경로 를 찾아내는 대부분의 문제에 응용될 수 있으며, 예를 들어 루빅스 큐브를 푸는 프로그램에도 적용될 수 있다. 또한, 내비게이션에서 지도상의 각 도시들을 노드로, 도로들을 간선으로 갖는 그래프로 간주한다면, 두 도시를 잇는 가장 빠른 길을 찾는 문제를 다익스트라 스타 알고리즘으로 해결할 수 있다. 이해의 편의를 위하여 본 명세서에서는 대피 경로 결정부가 다익스트라 스타 알고리즘을 활용하는 것으로 설명되지만, 이는 본 발명을 한정하는 것이 아니다. 예를 들어, 가능한 모든 노드쌍들에 대한 최단거리를 구하 는 플로이드-워셜 알고리즘이나 다익스트라 스타 알고리즘을 확장시킨 A* 알고리즘과 같이 종래에 공지된 모든 알고리즘이 적용될 수 있다. 대피 경로가 결정되면 대피 경로 제공부는 결정된 대피 경로를 적외선과 같은 광원을 사용하여 표시한다. 적외선 광원은 화재시와 같이 시야 확보가 어려운 상황에서도 요구조자의 대피를 도울 수 있다. 물론, 대피 경 로 제공부는 음성 정보나 음향 정보를 활용하여 요구조자에게 대피 경로를 제공할 수도 있다. 또한, 대피 경로 제공부는 GCM(Google Cloud Message) 서버, 3G 메시징 서버, 및 4G 메시징 서버 중 적어도 하나를 사용하여 대피 경로를 요구조자의 스마트 디바이스로 송신할 수도 있다.이와 같이, 본 발명의 대피 경로 안내 시스템에 의하면, 화재현장 잔류 인원의 위치 측위를 통하여 최단거 리인 대피 경로를 인공지능이 분석하고 자동으로 결정하여 요구조자에게 제공할 수 있다. 또한, 대피 경로 안 내 시스템에 의하면 재난 현장에 남아 있는 요구조자의 인원수와 위치를 구조자가 알 수 있게 됨으로써, 요구조자를 신속하게 구조할 수 있고, 구조 효율이 극대화된다. 도 3은 본 발명에 의한 대피 경로 안내 방법 및 시스템의 동작 과정을 개략적으로 설명하는 개념도이다. 도 3을 참조하면, 본 발명에 의한 대피 경로 안내 방법 및 시스템은 화재와 같은 재난이 발생할 경우 화재 감시 기에 개인 단말기(휴대전화)의 Wi-Fi와 BLE 신호의 MAC ID를 수집하는 장치를 추가하여 화재현장 요구조자 위치 측위 및 최단 대피 경로를 안내한다. 도 1의 측위 디바이스(110, 112, 114)의 재난 감지 센서(120, 122, 12 4)는 하나의 장비로 통합될 수 있고, 이러한 장비는 중앙 제어부와 무선으로 통신할 수 있다. 도 3을 참조하면, 본 발명은 화재를 인지하는 화재센서 기기, 휴대전화의 Wi-Fi와 BLE 신호의 MAC ID를 수집하 는 요구조차 위치수집 기기, 이를 서버로 송수신하는 (유)무선송수신기, 그리고 요구조자 최단 탈출 경로를 안 내하는 탈출 경로 표시 기기로 구성이 되어있고, 그리고 요구조자 최단 탈출 경로를 안내하는 시스템은 스마트 디바이스에서 실행되는 앱으로 구현 가능하다. 이를 위하여 다음과 같은 기술들이 구현되어야 한다. - 화재 현장에서 화재를 감지하고 화재 시 잔류 인원을 감지하는 측위 디바이스 기술 도 1의 재난 감지 센서(120, 122, 124)와 같은 화재 감지 디바이스는 화재를 감지하고, 측위 디바이스 및 스마 트 폰 앱(App)은 스마트 폰과 연동하여 화재 현장의 잔류 인원을 파악할 수 있다. 측위 디바이스는 스마트 폰 등 디바이스의 Wi-Fi 신호와 블루투스 신호를 스캐닝(Scanning)하여, 이를 이용하여 디바이스의 신호에 대한 데 이터를 수집하고, 수집된 데이터를 이용하여 잔류 인원의 위치를 파악한다. - 화재, 재난시 골든타임 확보를 위한 화재 현장 내의 요구조자에게 탈출 경로를 안내하는 기술 재난 감지 센서(120, 122, 124)는 화재 현장에서 화재 여부를 신속하게 감지하고, 화재 발생시 이러한 사항을 요구조자에게 바로 통지하여 골든 타임을 확보한다. 또한, 대피 경로 결정부, 및 대피 경로 제공부는 요구조자에게 최적의 대피 경로를 결정하고 안내할 수 있다. 전술된 바와 같이, 요구조자 현황 결정부는 요구조자의 인원수와 위치 등을 포함하는 요구조자 현황을 재난 관리 센터에 송신할 수 있다. 대피 경로 제공부는 재난 감지 센서(120, 122, 124)에 통합되어, 적외선으로 대피 경로를 표시할 수 있는 일체형 IoT 화재 단말기로서 구현될 수도 있다. 도 3에 간략히 정리된 대피 경로 안내 방법 및 시스템은 인구 밀도가 높고 실내에 매장이 많은 국내 환경에 적 합하며, 좁은 공간 안에 여러 개의 공간이 밀집되어 있거나 실내에 공간이 많은 도시 환경에 적합한 기술이다. 특히, 측위 디바이스(110, 112, 114)는 RF 간섭과 데이터의 충돌을 방지하기 위해 LBT(Listen Before Trans- mission) 방식을 적용하여 데이터를 분산 처리하는 것이 바람직하다. 또한, 측위 디바이스(110, 112, 114)는 요구조자 위치 데이터를 요구조자가 소지한 스마트 디바이스의 Mac ID와 함께 실시간으로 재난 관리 센터 에 전송할 수 있다. - 요구조자별 최적 대피 경로 결정 기술 본 발명에 따르면, 화재 현장인 건물 내에 있는 최단 거리 대피 경로가 인공 지능에 의해 분석될 수 있다. 이 경우, 대피 경로를 결정하는 데에는 화재 현장에 설치된 비상구 및 출입문 등의 정보는 물론, 화재 위치도 함께 고려될 수 있다. 그러면, 요구조자 모두에게 실시간으로 가장 빠른 대피 경로를 안내할 수 있게 되어, 골든타 임을 확보하는 데에 유리하다. 도 4는 본 발명의 다른 면에 의한 대피 경로 안내 방법을 개략적으로 나타내는 흐름도이다. 도 4를 참조하면, 우선 하나 이상의 측위 디바이스와 요구조자가 소지한 스마트 디바이스 사이에 송수신되는 신 호의 세기를 검출하고, 검출된 신호의 세기에 기반하여 요구조자의 위치를 측정한다(S410). 요구조자의 위치를 측정하기 위하여 수신된 무선 신호의 세기(RSSI)에 기반하여 삼변측량법을 적용할 수 있음은 전술된 바와 같다. 도 4에서와 같이, 본 발명에서는 재난 발생 여부와 무관하게 모든 사람을 잠재적인 요구조자로 간주하고 요구조 자의 위치를 사전에 파악함으로써 불시에 발생할 수 있는 재난에 대비한다. 그 이유는, 재난 상황은 전혀 예상 하지 못한 중에 언제든지 발생할 수 있으며, 재난이 발생되면 골든 타임 내에 요구조자들을 구출하는 것이 무엇 보다 중요하기 때문이다. 재난 발생 이후에 요구조자의 위치를 측정한다면, 재난 발생으로 인해 측위 디바이스 가 손상되었거나, 중앙 제어부와의 통신이 원활하게 이루어지지 않을 수가 있다. 하지만, 본 발명에서는 재난 발생 전에 요구조자의 위치를 모두 파악하고 있기 때문에, 재난이 발생하자마자 요구조자별로 최적 경로를 결정 하여 제공할 수 있다. 재난이 발생하면(S420), 하나 이상의 재난 감지 센서로부터 수신된 센서 정보에 기반하여 재난 발생 지점을 감 지한다(S430). 이러한 과정은 재난 발생 직후에 요구조자의 위치를 파악할 필요가 없이 즉시 수행되는 것이 바 람직하다. 재난 감지 센서는, 카메라, 연기 감지 센서, 불꽃 감지 센서, 및 온도 감지 센서, 음성 감지 센서, 인체 감지 센서, 조도 감지 센서, 및 가스 감지 센서 등일 수 있다. 연기 감지, 불꽃 감지, 및 온도 감지 센서는 화재 감 지를 감지하기 위해서 사용될 수 있다. 연기 감시 방식으로는 센서를 이용한 광전식 스포트형, 광전식 분리형, 이온화식과 공기흡입형 등이 사용될 수 있다. 또한, 카메라로 촬영한 영상을 바탕으로 화재 등 재난 상황을 감 지할 수도 있다. 영상 화재 감지 기술은 화재 감지 센서들을 사용하는 경우에 발생되는 문제점들을 극복할 수 있으며, 기존에 설치되어 있는 CCTV 장치를 이용해 큰 비용 없이 화재 감지에 적용할 수 있다는 장점을 가진다. 하지만, 촬영 영상의 화질은 물론이고, 촬영 시간, 배경 영상의 명도 등 카메라를 이용한 화재 감지 방법의 정 확도를 떨어뜨리는 많은 요인들이 존재한다. 도 1에서 설명한 장소, 예컨대 지하 주차장과, 격벽으로 구분된 건물 내부 및 복도와, 건물 내의 출입문 및 창 문을 포함한 건물 내부 공간에 배치된 적어도 하나의 임의의 감지 센서를 통해 화재 발생, 가스 누출 및 침입자 확인과 관련한 동작을 감지하고, 이 결과로서 각각 고유의 감지 신호를 발생시킬 수 있다. 예를 들어, 음성 감지 센서는 지하 주차장, 상기 건물 내부 및 상기 복도에 배치되어, 건물 내부 공간에 있는 사람의 음성을 인식하고, 음성 감시 신호를 발생시킬 수 있다. 발생된 음성 감시 신호는 침입자의 음성을 분석 하여 침입자의 침입 여부를 판단하기 위한 용도로 사용될 수 있다. 예를 들어, 인체 감지 센서)는 출입문과 창문에 배치되어, 출입문과 창문을 통해 침입한 침입자를 감지하여 침 입자 감지 신호를 발생시킬 수 있는데, 이러한 경우 인체 감지 센서는 창문을 통해 침입한 침입자를 적외선을 통해 감지하는 적외선 센서일 수 있다. 또한, 인체 감지 센서는 창문을 통해 침입한 침입자의 체중을 감지하는 체중 감지 센서일 수 있다. 통상 침입 자가 창문을 통해 집입하고자 하면 반드시 창문을 집거나 밝고 건물 내부로 들어오기 때문에 이를 감지하는데 체중 감지 센서는 매우 유용하다. 이러한 경우, 인체 감지 센서는 가스관 또는 옥상의 로프를 타고 내려와 임 의의 창문을 통해 침입하는 침입자를 적외선 센서 또는 체중 감지 센서를 통해 효과적으로 침입자를 식별하여 침입자 감지 신호를 발생시킬 수 있게 된다. 발생된 침입자 감지 신호는 침입자의 침입 여부를 판단하기 위한 용도로 사용될 수 있다. 예를 들어, 조도 감지 센서는 지하 주차장, 건물 내부 및 복도에 배치되어, 건물 내부 공간에 존재하는 빛의 양 을 감지하여 조도 감지 신호를 발생시킬 수 있다. 발생된 조도 감지 신호는 정전 여부를 판단하는 용도로 사용 될 수 있다. 또한, 온도 감지 센서는, 예를 들어 지하 주차장, 건물 내부 및 복도에 배치되어, 건물 내부 공간 에 존재하는 온도를 감지하여 온도 감지 신호를 발생시킬 수 있다. 발생된 온도 감지 신호는 화재 발생 여부를 판단하는 용도로 사용될 수 있다. 예를 들어, 가스 감지 센서는 지하 주차장, 건물 내부 및 복도에 배치되어, 건물 내부 공간에서 발생된 가스 누 출을 감지하여 가스 감지 신호를 발생시킬 수 있고, 발생된 가스 감지 신호는 가스 누출 여부를 판단하는 용도 로 사용될 수 있다. 또한, 충격 감지 센서는 출입문에서 발생된 충격 정도를 감지하여 충격 감지 신호를 발생 시킬 수 있다. 통상 출입문에는 비밀번호를 입력하거나 열쇠를 이용하여 정상적인 진입을 시도하는 경우는 출 입문에 큰 충격이 가해지지 않는다. 그러나, 출입문을 강제로 부숴 비정상적으로 출입문을 여는 경우는 큰 충 격이 가해지게 된다. 그리고, 접촉 감지 센서는, 예를 들어 출입문이 열리는 순간을 감지하여 시간을 카운팅한 시간 감지 신호 를 발생시킬 수 있고, 발생된 시간 감지 신호는 침입자의 침입 여부를 판단하기 위한 용도로 사용될 수 있다. 재난 발생 여부를 더 정확하게 판단하기 위하여, 센서 신호 및 CCTV로부터의 영상 정보에는 상이한 가중치가 적 용될 수 있다. 예를 들어, 날씨, 시간, 주변 밝기, 배경 영상 등에 따라 화재를 잘 감지하는 센서나 화재 감지알고리즘이 존재할 수 있다. 그러므로, 현재 시스템의 동작 상황을 고려하여 화재를 가장 잘 검출할 것으로 기 대되는 것에 더 높은 가중치를 부여함으로써 화재 검출 정확도를 향상시킬 수 있다. 즉, 센서 별로 화재 검출 의 정확도가 차이가 난다는 것을 알 수 있으며, 특히 각각의 센서가 양호하게 동작하는 화재 범위가 따로 존재 한다고 볼 수도 있다. 따라서, 이러한 점을 고려하여, 각각의 센서의 출력에는 상이한 가중치가 부여되는 것이 바람직하다. 예를 들어, 야간의 경우 카메라보다 화재 감지 센서에 더 높은 가중치를 부여할 수 있고, 대낮의 밝은 환경보다 밤의 어두운 환경일 경우에 불꽃 감지 센서에 더 높은 가중치를 부여할 수 있다. 재난 발생 지점이 감지되면, 구조가 필요한 미대피 요구조자의 인원수 및 위치를 포함하는 요구조자 현황을 결 정하여 재난 관리 센터로 전송한다(S440). 요구조자 현황을 재난 관리 센터로 전송하기 때문에, 재난 관리 센 터에서는 체계적인 구조 계획을 세울 수 있고, 재난 현장에서 요구조자의 정확한 인원과 위치를 몰라서 구조 인 력이 낭비되는 것을 방지할 수 있다. 따라서, 구조 효율성이 극대화된다. 요구조자 현황을 전송한 후에, 중앙 제어부는 구조가 필요한 요구조자마다 재난 발생 지점을 회피하는 대피 경 로를 결정한다(S450). 대피 경로를 결정하기 위하여 다익스트라 스타 알고리즘과 같은 다양한 알고리즘이 적용 될 수 있음은 전술된 바와 같다. 대피 경로가 결정되면, 결정된 대피 경로를 요구조자의 스마트 디바이스로 제공한다(S460). 또한, 대피 경로는 적외선 광원과 같은 시각적 장치나 스피커와 같은 음향 장치와 같은 모든 가용 장치를 동원하여 요구조자에게 제공될 수도 있다. 화재 정보를 사용자 단말로 송신하기 위해서 GCM(Google Cloud Message) 서버, 3G 메시징 서버, 및 4G 메시징 서버 등이 사용될 수 있다. 특히, GCM 서버는 안드로이드 운영체제를 사용하는 단말로 메 시지를 PUSH 하는 서비스를 무료로 제공한다. GCM 서비스를 사용하기 위해서는, code.google.com/apis/console 에 접속하여 새로운 서버 키를 생성하여야 하며, 안드로이드 SDK 매니저를 구동 하여 프로젝트를 생성하고, 매니페스트에 권한, 리시버, 서비스 등을 등록해야 한다. 이 때, 사용자의 단말로 PUSH 되는 정보는 최초 화재 감지 시각, 상기 화재 감시 센서의 상태, 감지된 화재의 위치 등을 포함할 수 있다. 이상 본 발명의 실시 예에 따른 도면을 참조하여 설명하였지만, 본 발명이 속한 분야에서 통상의 지식을 가진 자라면 상기 내용을 바탕으로 본 발명의 범주 내에서 다양한 응용 및 변형을 행하는 것이 가능할 것이다. 본 발명은 도면에 도시된 실시예를 참고로 설명되었으나 이는 예시적인 것에 불과하며, 본 기술 분야의 통상의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 타 실시예가 가능하다는 점을 이해할 것이다. 예를 들면, 요구조자의 위치를 파악하기 위하여 세기(RSSI) 외에 무선 신호의 이동 시간(TOF; time of flight)가 활용될 수 도 있다. 또한, 본 발명에 따르는 방법은 컴퓨터로 읽을 수 있는 기록 매체에 컴퓨터가 읽을 수 있는 코드로서 구현하는 것이 가능하다. 컴퓨터가 읽을 수 있는 기록 매체는 컴퓨터 시스템에 의하여 읽혀질 수 있는 데이터가 저장되 는 모든 종류의 기록 장치를 포함할 수 있다. 컴퓨터가 읽을 수 있는 기록 매체의 예로는 ROM, RAM, CD-ROM, 자기 테이프, 플로피 디스크, 광 데이터 저장 장치 등이 있으며, 또한 캐리어 웨이브(예를 들어 인터넷을 통한 전송)의 형태로 구현되는 것도 포함한다. 또한 컴퓨터가 읽을 수 있는 기록 매체는 네트워크로 연결된 분산 컴 퓨터 시스템에 의하여 분산 방식으로 실행될 수 있는 컴퓨터가 읽을 수 있는 코드를 저장할 수 있다. 본 명세서에서 사용되는 용어에서 단수의 표현은 문맥상 명백하게 다르게 해석되지 않는 한 복수의 표현을 포함 하는 것으로 이해되어야 하고, \"포함한다\" 등의 용어는 설시된 특징, 수, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것이 존재함을 의미하는 것이지, 하나 또는 그 이상의 다른 특징들이나 개수, 단계 동작 구성요 소, 부분품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 배제하지 않는 것으로 이해되어야 한다. 그리 고, 명세서에 기재된 \"...부\", \"...기\", \"모듈\", \"블록\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어나 소프트웨어 또는 하드웨어 및 소프트웨어의 결합으로 구현될 수 있다. 따라서, 본 실시예 및 본 명세서에 첨부된 도면은 본 발명에 포함되는 기술적 사상의 일부를 명확하게 나타내고 있는 것에 불과하며, 본 발명의 명세서 및 도면에 포함된 기술적 사상의 범위 내에서 당업자가 용이하게 유추할 수 있는 변형 예와 구체적인 실시예는 모두 본 발명의 권리범위에 포함되는 것이 자명하다고 할 것이다. 산업상 이용가능성 본 발명은 재난 현장에서 인명을 구조하기 위한 인명 구조 분야에 적용될 수 있다. 부호의 설명 110, 112, 114 : 측위 디바이스 120, 122, 124 : 재난 감지 센서 130 : 요구조자 위치 측정부 140 : 재난 감지부 150 : 요구조자 현황 결정부 155 : 중앙 제어부 160 : 대피 경로 결정부 170 : 대피 경로 제공부 180 : 네트워크 190 : 재난 관리 센터"}
{"patent_id": "10-2019-0178247", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일면에 의한 대피 경로 안내 시스템을 개략적으로 나타내는 블록도이다. 도 2는 본 발명에 의한 대피 경로 안내 시스템에서 요구조자의 이동에 따른 위치를 파악하는 과정을 예시하는 도면이다. 도 3은 본 발명에 의한 대피 경로 안내 방법 및 시스템의 동작 과정을 개략적으로 설명하는 개념도이다. 도 4는 본 발명의 다른 면에 의한 대피 경로 안내 방법을 개략적으로 나타내는 흐름도이다."}
