{"patent_id": "10-2018-0139086", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0057816", "출원번호": "10-2018-0139086", "발명의 명칭": "딥 러닝을 이용한 사진 편집가격 및 편집자 선정 시스템 및 방법", "출원인": "주식회사제이엘텍코퍼레이션", "발명자": "김동수"}}
{"patent_id": "10-2018-0139086", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "고객(사진편집 수요자)이 소지하고 있는 기기로서, 편집을 원하는 원본 사진과 고객의 요구사항을 제공하는 고객 단말기;상기 고객 단말기와 온라인 네트워크로 연결되며, 고객 정보 및 사진 편집자 정보를 관리하고, 고객 단말기로부터 제공된 원본 사진과 고객의 요구사항을 사진 편집자 측에 전달하며, 사진 편집자 측으로부터의 사진 샘플,수정 사진, 편집자 희망가격 정보를 상기 고객 단말기로 전달하는 서비스 제공업체 서버; 및상기 서비스 제공업체 서버와 온라인 네트워크로 연결되며, 서비스 제공업체 서버를 통해 원본 사진과 고객의요구사항을 전달받아 그를 바탕으로 사진 샘플, 수정 사진, 편집자 희망가격 정보를 서비스 제공업체 서버로 전송하는 사진 편집자 서버를 포함하는 딥 러닝을 이용한 사진 편집가격 및 편집자 선정 시스템."}
{"patent_id": "10-2018-0139086", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 서비스 제공업체 서버는, 고객 정보 및 사진 편집자 정보를 관리하고, 고객(사진편집 수요자)과 사진 편집자를 연결해 주는 관리 서버와; 사진 및 사진 편집과 관련된 다양한 정보를 저장하고 있는 빅 데이터베이스와, 빅 데이터베이스에 저장되어 있는 빅 데이터를 이용하여 스스로 학습하여 결과물을 산출하는 딥 러닝(deep learning) 기능을 구비하는 빅 데이터/딥 러닝 서버를 포함하여 구성된 딥 러닝을 이용한 사진 편집가격 및 편집자 선정 시스템."}
{"patent_id": "10-2018-0139086", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 빅 데이터/딥 러닝 서버에는 원본 사진의 수정 작업을 위한 인공 지능(Artificial Intelligence; AI)이 탑재되어 있는 딥 러닝을 이용한 사진 편집가격 및 편집자 선정 시스템."}
{"patent_id": "10-2018-0139086", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 관리 서버와 빅 데이터/딥 러닝 서버는 하나의 구성요소로 일체로 구성된 딥 러닝을 이용한 사진 편집가격및 편집자 선정 시스템."}
{"patent_id": "10-2018-0139086", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2항에 있어서,상기 빅 데이터베이스에는 고객이 편집을 희망하여 제공한 원본 사진, 사진 편집과 관련한 고객의 요구사항, 편집자가 편집한 최종 수정사진, 고객정보, 고객 만족도, 고객 가격 적정성평가, 편집자 희망가격, 편집자 고객평가, 편집자 정보, 샘플 사진에 대한 데이터가 저장되어 있는 딥 러닝을 이용한 사진 편집가격 및 편집자 선정시스템.공개특허 10-2020-0057816-3-청구항 6 제2항에 있어서,상기 딥 러닝 기능은 상기 고객 단말기로부터 고객 정보, 원본 사진, 고객의 요구사항을 제공받고, 상기 빅 데이터베이스에 저장되어 있는 각종 데이터를 이용하여 딥 러닝을 수행하여 샘플 사진, 상세 요구사항 요청, 편집자 선정정보, 예상가격의 결과물을 산출하는 딥 러닝을 이용한 사진 편집가격 및 편집자 선정 시스템."}
{"patent_id": "10-2018-0139086", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "고객 단말기, 관리 서버와 빅 데이터/딥 러닝 서버를 구비하는 서비스 제공업체 서버, 사진 편집자 서버를 포함하는 딥 러닝을 이용한 사진 편집가격 및 편집자 선정 시스템을 기반으로 한 사진 편집가격 및 편집자 선정 방법으로서,a) 상기 고객 단말기에 의해 편집 대상의 원본 사진과 사진 편집과 관련된 요구 사항을 상기 서비스 제공업체서버로 전송하는 단계;b) 상기 서비스 제공업체 서버에 의해 상기 원본 사진과 요구사항을 상기 사진 편집자 서버로 제공하고, 원본사진 및 요구사항과 관련된 복수의 수정된 샘플 사진을 상기 고객 단말기로 보내어 선택하도록 하는 단계;c) 상기 서비스 제공업체 서버에 의해 상기 고객 단말기로부터 선택된 샘플사진 및 딥 러닝으로 학습한 정보를바탕으로, 고객의 요구 사항이 반영되도록 상기 원본 사진을 수정하는 단계; d) 상기 서비스 제공업체 서버에 의해 상기 수정된 사진을 상기 고객 단말기로 보내어 고객의 만족도를 확인하는 단계; e) 상기 고객 단말기로부터 수신한 고객 만족도, 고객의 원본 사진, 요구사항 및 샘플 사진을 바탕으로 상기 서비스 제공업체 서버에 의해 상기 고객 단말기로 상세 요구사항을 요청하는 단계; f) 상기 서비스 제공업체 서버에 의해 고객 만족도, 고객의 원본 사진 및 요구사항, 샘플 사진, 상세 요구사항을 바탕으로 예상 편집가격과 복수의 사진 편집자 정보를 상기 고객 단말기로 제공하는 단계;g) 상기 고객 단말기에 의해 편집자를 선정 및 구매를 결정하여 상기 서비스 제공업체 서버로 통보하고, 서비스제공업체 서버가 해당 사진 편집자 서버로 구매결정 사항을 전달하는 단계;h) 상기 사진 편집자 서버에 의해 원본 사진에 대해 수정 작업을 하고, 수정된 사진을 서비스 제공업체 서버를거쳐 상기 고객 단말기로 전송 및 희망가격을 제안하는 단계; 및i) 상기 고객 단말기에 의해 상기 사진 편집자 서버로부터 제안한 희망가격을 참고하여 예상 편집가격 범위 내에서 결제하는 단계를 포함하는 딥 러닝을 이용한 사진 편집가격 및 편집자 선정 방법."}
{"patent_id": "10-2018-0139086", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 단계 i) 이전에 상기 고객 단말기에 의해 수정 사진에 대해 재수정을 상기 서비스 제공업체 서버를 거쳐상기 사진 편집자 서버로 요청하고, 상기 사진 편집자 서버에 의해 재수정된 사진을 상기 서비스 제공업체 서버를 거쳐 상기 고객 단말기로 전송하는 단계를 더 포함하는 딥 러닝을 이용한 사진 편집가격 및 편집자 선정 방법."}
{"patent_id": "10-2018-0139086", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서,상기 단계 i) 이후에 상기 고객 단말기에 의한 고객 만족도 정보와, 상기 사진 편집자 서버에 의한 고객 평가정보를 상기 서비스 제공업체 서버에 의해 각각 수집하는 단계를 더 포함하는 딥 러닝을 이용한 사진 편집가격공개특허 10-2020-0057816-4-및 편집자 선정 방법."}
{"patent_id": "10-2018-0139086", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제7항에 있어서,상기 단계 i)에서 상기 고객 단말기에 의해 상기 사진 편집자 서버로부터 제안한 희망가격을 참고하여 예상 편집가격 범위 내에서 결제함에 있어서, 사진 편집자 서버로부터 제안한 희망가격보다 높게 또는 낮게 결제하는딥 러닝을 이용한 사진 편집가격 및 편집자 선정 방법."}
{"patent_id": "10-2018-0139086", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 딥 러닝을 이용한 사진 편집가격 및 편집자 선정 시스템 및 방법에 관한 것이다. 본 발명에 따른 딥 러닝을 이용한 사진 편집가격 및 편집자 선정 방법은, 고객 단말기에 의해 편집 대상의 원본 사진과 사진 편집과 관련된 요구 사항이 제공되면, 서비스 제공업체 서버에 의해 원본 사진 및 요구사항과 관련 (뒷면에 계속)"}
{"patent_id": "10-2018-0139086", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 사진 편집가격 및 편집자 선정 시스템 및 방법에 관한 것으로서, 더 상세하게는 딥 러닝(deep learning)을 통해 고객에게 예상 편집가격 및 적정한 편집자들을 제시하여 선택하게 함으로써, 고객은 저렴한 가격으로 자신의 사진을 편집할 수 있고, 편집자는 고객의 정확한 요구사항을 통해 정확한 편집을 수행할 수 있 는 딥 러닝을 이용한 사진 편집가격 및 편집자 선정방법에 관한 것이다."}
{"patent_id": "10-2018-0139086", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "오늘날, 스마트폰 내장 카메라 기능의 발전으로 고품질의 사진을 누구나 찍을 수 있게 되었다. 이에 따라 사진 편집 수요는 계속해서 증가하고 있다. 스마트폰에서 간단하게 사진을 편집할 수 있는 프로그램이 많이 제시되고 있으나, 고객이자신이 원하는 수준의 편집을 하기 위해서는 여전히 포토샵 전문가의 도움이 필요하다. 포토샵 전문가에게 편집을 의뢰하기 위해서는 의뢰자는 자신이 원하는 수준의 비용을 먼저 알아야 한다. 편집자도 편집 을 하기 전에 의뢰자의 요구사항을 듣고 그것에 맞는 가격을 제시해야 한다. 그러나 편집 비용을 편집전에 계산 하기 위해서는 고객과의 상당한 상담 시간이 필요하고, 상담 비용이 편집 비용보다 더 큰 경우가 많다. 특히, 편집 비용이 예상했던 것보다 높을 경우 고객이 상담 후 거래 진행을 하지 않는 경우가 있다. 그리고 어떤 고객 의 경우는 자신의 요청사항을 정확히 설명하지 못해 사진편집 후에 추가적인 수정사항이 발생하여 이에 대한 비 용문제가 발생할 수 있다. 또한 사진편집자의 기술수준으로 인해 고객에게 만족을 주지 못할 경우, 이에 대한 분쟁이 발생할 수 있다. 이로 인해 사진편집 수요가 많아도 사진편집 전문가와 거래가 온라인 상에서 원활하게 이루어지지 못하고 있다. 한편, 한국 공개특허공보 제10-2002-0067024호(특허문헌 1)에는 \"디지털 편집을 기반으로 하는 온라인 포토 서 비스 방법 및 시스템\"이 개시되어 있는 바, 이에 따른 디지털 편집을 기반으로 하는 온라인 포토 서비스 방법은, 인터넷을 통하여 다수의 편집 예시 샘플 이미지와 배경 이미지를 사용자에게 제공하는 단계; 사용자로 부터 희망하는 하나의 예시 샘플 이미지 정보와 배경 이미지 선택 정보를 접수하는 단계; 피사체를 촬영하는 디 지털 카메라와, 크로마키 기법으로 피사체를 구별하여 편집할 수 있는 배경 스크린 및 전문 조명 장비를 구비하 여 사진 촬영하고 촬영 영상을 인터넷을 통하여 전송하는 단계; 및 예시 샘플 이미지 정보를 사용하여 사용자가 선택한 예시 샘플 영상을 편집하는데 사용한 액션 편집값을 추출하고, 추출된 액션 편집값을 사용하여 촬영 영 상과 배경 이미지를 크로마키 합성하는 단계;를 포함하는 것을 특징으로 한다. 이와 같은 특허문헌 1의 경우, 온라인을 통한 디지털 편집을 기초로 사용자에게 미리 예시된 편집 형태를 고르 게 하고, 그 편집의 형태를 디자이너에게 정확하게 전달하여, 디자이너는 미리 정해진 편집 액션 값을 이용함으 로써 저렴한 가격과 신속한 서비스가 가능할 수는 있다. 그러나 이것은 사용자가 얻고자 하는 어떤 사진 형태를 위해 미리 인터넷을 통하여 다수의 편집 예시 샘플 이미지와 배경 이미지를 사용자에게 제공하고, 사용자가 그 중에 하나를 선택하면 그것을 바탕으로 피사체(사용자일 수도 있음)를 촬영하고, 촬영 영상과 배경 이미지를 크 로마키 합성하는 것으로서, 이 종래 온라인 포토 서비스 방법으로는 사용자가 스마트폰으로 촬영한 사진을 사용 자의 요구사항을 만족할 수 있도록 편집하기 어려운 단점이 있다. 선행기술문헌 특허문헌(특허문헌 0001) 한국 공개특허공보 제10-2002-0067024호(2002.08.21. 공개)"}
{"patent_id": "10-2018-0139086", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 종래 기술의 문제점을 개선하기 위하여 창출된 것으로서, 고객의 원본 사진과 요구사항 에 대해서 딥 러닝을 통해 샘플 사진을 제시하고, 고객이 선택한 샘플 사진을 통해 고객의 요구수준을 이해하고 상세 요구사항을 요청한 후, 고객에게 예상 편집가격 및 적정한 편집자들을 제시하여 선택하게 함으로써, 고객 은 저렴한 가격으로 자신의 사진을 편집할 수 있고, 편집자는 고객의 정확한 요구사항을 통해 정확한 편집을 수 행할 수 있는 딥 러닝을 이용한 사진 편집가격 및 편집자 선정 시스템 및 방법을 제공함에 그 목적이 있다. 본 발명의 다른 목적은 사진의 편집 후에는 고객의 만족도, 고객과 편집자 간의 상호 가격정보 및 평가정보를 수집하여 빅 데이터화 함으로써, 빅 데이터를 바탕으로 딥 러닝을 통해 향후 편집 적정가격과 적정 편집자 선정 을 정확하게 할 수 있도록 하는 딥 러닝을 이용한 사진 편집가격 및 편집자 선정 시스템 및 방법을 제공함에 있 다."}
{"patent_id": "10-2018-0139086", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기의 목적을 달성하기 위하여 본 발명에 따른 딥 러닝을 이용한 사진 편집가격 및 편집자 선정 시스템은, 고객(사진편집 수요자)이 소지하고 있는 기기로서, 편집을 원하는 원본 사진과 고객의 요구사항을 제공하는 고 객 단말기; 상기 고객 단말기와 온라인 네트워크로 연결되며, 고객 정보 및 사진 편집자 정보를 관리하고, 고객 단말기로부 터 제공된 원본 사진과 고객의 요구사항을 사진 편집자 측에 전달하며, 사진 편집자 측으로부터의 사진 샘플, 수정 사진, 편집자 희망가격 정보를 상기 고객 단말기로 전달하는 서비스 제공업체 서버; 및 상기 서비스 제공업체 서버와 온라인 네트워크로 연결되며, 서비스 제공업체 서버를 통해 원본 사진과 고객의 요구사항을 전달받아 그를 바탕으로 사진 샘플, 수정 사진, 편집자 희망가격 정보를 서비스 제공업체 서버로 전 송하는 사진 편집자 서버를 포함하는 점에 그 특징이 있다. 여기서, 상기 서비스 제공업체 서버는 고객 정보 및 사진 편집자 정보를 관리하고, 고객(사진편집 수요자)과 사 진 편집자를 연결해 주는 관리 서버와; 사진 및 사진 편집과 관련된 다양한 정보를 저장하고 있는 빅 데이터베 이스와, 빅 데이터베이스에 저장되어 있는 빅 데이터를 이용하여 스스로 학습하여 결과물을 산출하는 딥 러닝 (deep learning) 기능을 구비하는 빅 데이터/딥 러닝 서버를 포함하여 구성될 수 있다. 이때, 상기 빅 데이터/딥 러닝 서버에는 원본 사진의 수정 작업을 위한 인공 지능(Artificial Intelligence; AI)이 탑재될 수 있다. 또한, 상기 관리 서버와 빅 데이터/딥 러닝 서버는 하나의 구성요소로 일체로 구성될 수도 있다. 또한, 상기 빅 데이터베이스에는 고객이 편집을 희망하여 제공한 원본 사진, 사진 편집과 관련한 고객의 요구사 항, 편집자가 편집한 최종 수정사진, 고객정보, 고객 만족도, 고객 가격 적정성평가, 편집자 희망가격, 편집자 고객평가, 편집자 정보, 샘플 사진 등에 대한 데이터가 저장될 수 있다. 또한, 상기 딥 러닝 기능은 상기 고객 단말기로부터 고객 정보, 원본 사진, 고객의 요구사항을 제공받고, 상기 빅 데이터베이스에 저장되어 있는 각종 데이터를 이용하여 딥 러닝을 수행하여 샘플 사진, 상세 요구사항 요청, 편집자 선정정보, 예상가격의 결과물을 산출할 수 있다. 또한, 상기의 목적을 달성하기 위하여 본 발명에 따른 딥 러닝을 이용한 사진 편집가격 및 편집자 선정 방법은, 고객 단말기, 관리 서버와 빅 데이터/딥 러닝 서버를 구비하는 서비스 제공업체 서버, 사진 편집자 서버를 포함 하는 딥 러닝을 이용한 사진 편집가격 및 편집자 선정 시스템을 기반으로 한 사진 편집가격 및 편집자 선정 방 법으로서, a) 상기 고객 단말기에 의해 편집 대상의 원본 사진과 사진 편집과 관련된 요구 사항을 상기 서비스 제공업체 서버로 전송하는 단계; b) 상기 서비스 제공업체 서버에 의해 상기 원본 사진과 요구사항을 상기 사진 편집자 서버로 제공하고, 원본 사진 및 요구사항과 관련된 복수의 수정된 샘플 사진을 상기 고객 단말기로 보내어 선택하도록 하는 단계; c) 상기 서비스 제공업체 서버에 의해 상기 고객 단말기로부터 선택된 샘플사진 및 딥 러닝으로 학습한 정보를 바탕으로, 고객의 요구 사항이 반영되도록 상기 원본 사진을 수정하는 단계; d) 상기 서비스 제공업체 서버에 의해 상기 수정된 사진을 상기 고객 단말기로 보내어 고객의 만족도를 확인하 는 단계; e) 상기 고객 단말기로부터 수신한 고객 만족도, 고객의 원본 사진, 요구사항 및 샘플 사진을 바탕으로 상기 서 비스 제공업체 서버에 의해 상기 고객 단말기로 상세 요구사항을 요청하는 단계; f) 상기 서비스 제공업체 서버에 의해 고객 만족도, 고객의 원본 사진 및 요구사항, 샘플 사진, 상세 요구사항 을 바탕으로 예상 편집가격과 복수의 사진 편집자 정보를 상기 고객 단말기로 제공하는 단계; g) 상기 고객 단말기에 의해 편집자를 선정 및 구매를 결정하여 상기 서비스 제공업체 서버로 통보하고, 서비스 제공업체 서버가 해당 사진 편집자 서버로 구매결정 사항을 전달하는 단계; h) 상기 사진 편집자 서버에 의해 원본 사진에 대해 수정 작업을 하고, 수정된 사진을 서비스 제공업체 서버를 거쳐 상기 고객 단말기로 전송 및 희망가격을 제안하는 단계; 및 i) 상기 고객 단말기에 의해 상기 사진 편집자 서버로부터 제안한 희망가격을 참고하여 예상 편집가격 범위 내 에서 결제하는 단계를 포함하는 점에 그 특징이 있다. 여기서, 상기 단계 i) 이전에 상기 고객 단말기에 의해 수정 사진에 대해 재수정을 상기 서비스 제공업체 서버 를 거쳐 상기 사진 편집자 서버로 요청하고, 상기 사진 편집자 서버에 의해 재수정된 사진을 상기 서비스 제공 업체 서버를 거쳐 상기 고객 단말기로 전송하는 단계를 더 포함할 수 있다. 또한, 상기 단계 i) 이후에 상기 고객 단말기에 의한 고객 만족도 정보와, 상기 사진 편집자 서버에 의한 고객 평가 정보를 상기 서비스 제공업체 서버에 의해 각각 수집하는 단계를 더 포함할 수 있다. 또한, 상기 단계 i)에서 상기 고객 단말기에 의해 상기 사진 편집자 서버로부터 제안한 희망가격을 참고하여 예 상 편집가격 범위 내에서 결제함에 있어서, 사진 편집자 서버로부터 제안한 희망가격보다 높게 또는 낮게 결제 할 수 있다."}
{"patent_id": "10-2018-0139086", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이와 같은 본 발명에 의하면, 고객의 원본 사진과 요구사항에 대해서 딥 러닝을 통해 샘플 사진을 제시하고, 고 객이 선택한 샘플 사진을 통해 고객의 요구수준을 이해하고 상세 요구사항을 요청한 후, 고객에게 예상 편집가 격 및 적정한 편집자들을 제시하여 선택하게 함으로써, 고객은 저렴한 가격으로 자신의 사진을 만족스럽게 편집 할 수 있고, 편집자는 고객의 정확한 요구사항을 통해 자신에게 맞는 편집을 함에 따라 효율성을 높여 저렴한 가격으로도 서비스를 제공할 수 있는 장점이 있다."}
{"patent_id": "10-2018-0139086", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서 및 청구범위에 사용된 용어나 단어는 통상적이거나 사전적인 의미로 한정되어 해석되지 말아야 하며, 발명자는 그 자신의 발명을 가장 최선의 방법으로 설명하기 위해 용어의 개념을 적절하게 정의할 수 있다는 원 칙에 입각하여 본 발명의 기술적 사상에 부합하는 의미와 개념으로 해석되어야 한다. 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다 른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있다는 것을 의미한다. 또한, 명세서에 기 재된 \"…부\", \"…기\", \"모듈\", \"장치\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어나 소프트웨어 또는 하드웨어 및 소프트웨어의 결합으로 구현될 수 있다. 이하 첨부된 도면을 참조하여 본 발명의 실시예를 상세히 설명한다. 도 1은 본 발명의 실시예에 따른 딥 러닝을 이용한 사진 편집가격 및 편집자 선정 시스템의 구성을 개략적으로 나타낸 도면이다. 도 1을 참조하면, 본 발명에 따른 딥 러닝을 이용한 사진 편집가격 및 편집자 선정 시스템은 고객 단말기 , 서비스 제공업체 서버 및 사진 편집자 서버를 포함하여 구성된다. 고객 단말기는 고객(사진편집 수요자)이 소지하고 있는 기기로서, 편집을 원하는 원본 사진과 고객의 요구 사항을 제공한다. 이와 같은 고객 단말기는 스마트폰, 태블릿 PC, 노트북 PC, 데스크 탑 컴퓨터 등을 포함 할 수 있다. 서비스 제공업체 서버는 상기 고객 단말기와 온라인 네트워크로 연결되며, 고객 정보 및 사진 편집자 정보를 관리하고, 고객 단말기로부터 제공된 원본 사진과 고객의 요구사항을 사진 편집자 측, 즉 사진 편 집자 서버에 전달하며, 사진 편집자 측(사진 편집자 서버)으로부터의 사진 샘플, 수정 사진, 편집자 희망가격 정보를 고객 단말기로 전달한다. 여기서, 이와 같은 서비스 제공업체 서버는 고객 정보 및 사진 편집자 정보를 관리하고, 고객(사진편집 수요자)과 사진 편집자를 연결해 주는 관리 서버와; 사진 및 사진 편집과 관련된 다양한 정보를 저장하고 있는 빅 데이터베이스(122a)와, 빅 데이터베이스(122a)에 저장되어 있는 빅 데이터를 이용하여 스스로 학습하여 결과물을 산출하는 딥 러닝(deep learning) 기능(122b)을 구비하는 빅 데이터/딥 러닝 서버를 포함하여 구성될 수 있다. 이때, 상기 빅 데이터/딥 러닝 서버에는 원본 사진의 수정 작업을 위한 인공 지능(Artificial Intelligence; AI)이 탑재될 수 있다. 또한, 상기 관리 서버와 빅 데이터/딥 러닝 서버는 하나의 구성요소로 일체로 구성될 수도 있다. 즉, 본 실시예의 도면에는 관리 서버와 빅 데이터/딥 러닝 서버가 분리되어 두 개의 구성요소로 구성되어 있는 것을 도시하고 있으나, 경우에 따라서는 관리 서버가 가지는 기능을 빅 데이터/딥 러닝 서버의 기능과 통합함으로써, 하나의 구성요소로 일체로 구성될 수도 있다. 또한, 상기 빅 데이터베이스(122a)에는 도 2에 도시된 바와 같이, 고객이 편집을 희망하여 제공한 원본 사진, 사진 편집과 관련한 고객의 요구사항, 편집자가 편집한 최종 수정사진, 고객정보, 고객 만족도, 고객 가격 적정 성평가, 편집자 희망가격, 편집자 고객평가, 편집자 정보, 샘플 사진 등에 대한 데이터가 저장될 수 있다. 또한, 상기 딥 러닝 기능(122b)은 상기 고객 단말기 로부터 고객 정보, 원본 사진, 고객의 요구사항을 제 공받고, 상기 빅 데이터베이스(122a)에 저장되어 있는 각종 데이터(혹은 정보)를 이용하여 딥 러닝을 수행하여 샘플 사진, 상세 요구사항 요청, 편집자 선정정보, 예상가격의 결과물을 산출할 수 있다. 사진 편집자 서버는 상기 서비스 제공업체 서버와 온라인 네트워크로 연결되며, 서비스 제공업체 서 버를 통해 원본 사진과 고객의 요구사항을 전달받아 그를 바탕으로 사진 샘플, 수정 사진, 편집자 희망가 격 정보 등을 서비스 제공업체 서버로 전송한다. 이와 같은 사진 편집자 서버로는 일반적인 데스크 탑 컴퓨터가 사용될 수 있다. 그러면, 이하에서는 이상과 같은 구성을 가지는 본 발명에 따른 딥 러닝을 이용한 사진 편집가격 및 편집자 선 정 시스템을 바탕으로 딥 러닝을 이용한 사진 편집가격 및 편집자 선정 방법에 대해 설명해 보기로 한다. 도 3은 본 발명의 실시예에 따른 딥 러닝을 이용한 사진 편집가격 및 편집자 선정 방법의 실행 과정을 나타낸 도면이고, 도 4는 본 발명에 따른 딥 러닝을 이용한 사진 편집가격 및 편집자 선정 시스템의 고객 단말기, 빅 데이터/딥 러닝 서버 및 사진 편집자 서버 간의 동작 시퀀스를 나타낸 도면이다. 도 3 및 도 4를 참조하면, 본 발명에 따른 딥 러닝을 이용한 사진 편집가격 및 편집자 선정 방법은, 전술한 바 와 같은 고객 단말기, 관리 서버와 빅 데이터/딥 러닝 서버를 구비하는 서비스 제공업체 서버 , 사진 편집자 서버를 포함하는 딥 러닝을 이용한 사진 편집가격 및 편집자 선정 시스템을 기반 으로 한 사진 편집가격 및 편집자 선정 방법으로서, 먼저 상기 고객 단말기에 의해 편집 대상의 원본 사진 과 사진 편집과 관련된 요구 사항을 상기 서비스 제공업체 서버로 전송한다(단계 S301). 그러면, 서비스 제공업체 서버(즉, 빅 데이터/딥 러닝 서버)는 원본 사진과 요구사항을 사진 편집자 서버 로 제공하고, 원본 사진 및 요구사항과 관련된 복수의 수정된 샘플 사진을 고객 단말기로 보내어 선 택하도록 한다(단계 S302). 여기서, 이상과 같이 원본 사진 및 요구사항과 관련된 복수의 수정된 샘플 사진을 고객 단말기로 보내는 이유는 고객이 생각하는 수준의 샘플 사진을 선택할 수 있도록 하기 위한 것이다. 또한, 서비스 제공업체 서버(빅 데이터/딥 러닝 서버)는 상기 고객 단말기로부터 선택된 샘플사진 및 딥 러닝으로 학습한 정보를 바탕으로, 고객의 요구 사항이 반영되도록 상기 원본 사진을 수정한다(단계 S303). 이때, 원본 사진의 수정은 빅 데이터/딥 러닝 서버에 탑재되어 있는 인공 지능(Artificial Intelligence; AI)에 의해 이루어진다. 그런 후, 서비스 제공업체 서버(빅 데이터/딥 러닝 서버)에 의해 상기 수정된 사진을 고객 단말기로 보내어 고객의 만족도를 확인한다(단계 S304). 그런 다음, 고객 단말기로부터 수신한 고객 만족도, 고객의 원본 사진, 고객의 요구사항 및 샘플 사진을 바탕으로 상기 서비스 제공업체 서버(빅 데이터/딥 러닝 서버)는 고객 단말기로 상세 요구사항을 요 청한다(단계 S305). 이에 따라, 고객 단말기는 서비스 제공업체 서버(빅 데이터/딥 러닝 서버 )로 상 세 요구사항을 제공하게 된다. 이후, 서비스 제공업체 서버(빅 데이터/딥 러닝 서버)에 의해 고객 만족도, 고객의 원본 사진 및 요구사항, 샘플 사진, 상세 요구사항을 바탕으로 예상 편집가격과 복수의 사진 편집자 정보를 고객 단말기(11 0)로 제공한다(단계 S306). 여기서, 이와 같이 빅 데이터와 딥 러닝을 통해 고객의 정확한 요구사항과 편집자 선택을 빅 데이터/딥 러닝 서버가 함으로써, 고객과 편집자의 상담 없이 고객으로부터 정확한 요구사항을 받을 수 있게 된다. 이렇게 하여 예상 편집가격과 복수의 사진 편집자 정보가 고객 단말기로 제공되면, 고객 단말기는 편 집자를 선정 및 구매를 결정하여 서비스 제공업체 서버(빅 데이터/딥 러닝 서버)로 통보하고, 서비스 제공 업체 서버(빅 데이터/딥 러닝 서버)는 해당 사진 편집자 서버로 구매결정 사항을 전달한다(단계 S307). 이에 따라, 해당 사진 편집자 서버는 원본 사진에 대해 수정 작업을 하고, 수정된 사진을 서비스 제공업체 서버(빅 데이터/딥 러닝 서버)를 거쳐 고객 단말기로 전송하는 한편 희망가격을 제안한다(단계 S308). 그러면, 고객 단말기는 상기 사진 편집자 서버로부터 제안한 희망가격을 참고하여 예상 편집가격 범 위 내에서 결제한다(단계 S309). 이상과 같은 일련의 과정에 있어서, 상기 단계 S309 이전에 상기 고객 단말기에 의해 수정 사진에 대해 재 수정을 상기 서비스 제공업체 서버(빅 데이터/딥 러닝 서버)를 거쳐 상기 사진 편집자 서버로 요청하 고, 사진 편집자 서버에 의해 재수정된 사진을 상기 서비스 제공업체 서버(빅 데이터/딥 러닝 서버) 를 거쳐 상기 고객 단말기로 전송하는 단계를 더 포함할 수 있다. 또한, 상기 단계 S309 이후에 상기 고객 단말기에 의한 고객 만족도 정보와, 상기 사진 편집자 서버 에 의한 고객 평가 정보를 상기 서비스 제공업체 서버(빅 데이터/딥 러닝 서버)에 의해 각각 수집하는 단 계를 더 포함할 수 있다. 여기서, 이상과 같이 수집된 고객 단말기에 의한 고객 만족도 정보와, 사진 편집 자 서버에 의한 고객 평가 정보는 고객과 편집자의 정성적 평가를 위한 빅 데이터로 사용된다. 또한, 상기 단계 S309에서 상기 고객 단말기에 의해 상기 사진 편집자 서버로부터 제안한 희망가격을 참고하여 예상 편집가격 범위 내에서 결제함에 있어서, 사진 편집자 서버로부터 제안한 희망가격보다 높게 또는 낮게 임의로 결제할 수 있다. 여기서, 편집자와 고객 간의 가격에 대한 서로 다른 관점은 빅 데이터와 딥 러닝을 통해 고객의 성향, 고객의 요구 수준, 만족도 등을 정량적으로 파악하고, 동시에 편집자의 성향도 파악 하는데 사용된다.이상의 설명과 같이, 본 발명에 따른 딥 러닝을 이용한 사진 편집가격 및 편집자 선정 시스템 및 방법은 고객의 원본 사진과 요구사항에 대해서 딥 러닝을 통해 샘플 사진을 제시하고, 고객이 선택한 샘플 사진을 통해 고객의 요구수준을 이해하고 상세 요구사항을 요청한 후, 고객에게 예상 편집가격 및 적정한 편집자들을 제시하여 선택 하게 함으로써, 고객은 저렴한 가격으로 자신의 사진을 만족스럽게 편집할 수 있고, 편집자는 고객의 정확한 요 구사항을 통해 자신에게 맞는 편집을 함에 따라 효율성을 높여 저렴한 가격으로도 서비스를 제공할 수 있는 장 점이 있다. 또한, 본 발명에 따른 딥 러닝을 이용한 사진 편집가격 및 편집자 선정 시스템 및 방법은 사진의 편집 후에 고 객의 만족도, 고객과 편집자 간의 상호 가격정보 및 평가정보를 수집하여 빅 데이터화 함으로써, 빅 데이터를 바탕으로 딥 러닝을 통해 향후 편집 적정가격과 적정 편집자 선정을 정확하게 할 수 있는 장점이 있다. 이상, 바람직한 실시예를 통하여 본 발명에 관하여 상세히 설명하였으나, 본 발명은 이에 한정되는 것은"}
{"patent_id": "10-2018-0139086", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "아니며, 본 발명의 기술적 사상을 벗어나지 않는 범위 내에서 다양하게 변경, 응용될 수 있음은 당해 기술분야 의 통상의 기술자에게 자명하다. 따라서, 본 발명의 진정한 보호 범위는 다음의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술적 사상은 본 발명의 권리 범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2018-0139086", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 딥 러닝을 이용한 사진 편집가격 및 편집자 선정 시스템의 구성을 개략적으로 나타낸 도 면이다. 도 2는 본 발명에 따른 딥 러닝을 이용한 사진 편집가격 및 편집자 선정 시스템의 빅 데이터베이스 및 딥 러닝 기능을 나타낸 도면이다. 도 3은 본 발명에 따른 딥 러닝을 이용한 사진 편집가격 및 편집자 선정 방법의 실행 과정을 나타낸 도면이다. 도 4는 본 발명에 따른 딥 러닝을 이용한 사진 편집가격 및 편집자 선정 시스템의 고객 단말기, 빅 데이터/딥 러닝 서버 및 사진 편집자 서버 간의 동작 시퀀스를 나타낸 도면이다."}
