{"patent_id": "10-2023-0090627", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0011762", "출원번호": "10-2023-0090627", "발명의 명칭": "전자 장치 및 이의 제어 방법", "출원인": "삼성전자주식회사", "발명자": "박경재"}}
{"patent_id": "10-2023-0090627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,복수의 게임 타입 각각에 대응되는 화질 정보 및 음향 정보가 저장된 메모리; 및적어도 하나의 게임을 선택하는 사용자 명령에 기초하여 상기 선택된 적어도 하나의 게임 각각에 대응되는 메타데이터(Metadata)를 식별하고,상기 식별된 메타데이터에 기초하여 상기 복수의 게임 타입 각각에 대응되는 사용자의 선호도 정보를 식별하고,상기 식별된 사용자의 선호도 정보 및 상기 메모리에 저장된 정보에 기초하여 상기 사용자에 대응되는 화질 정보 및 음향 정보를 식별하고,상기 식별된 화질 정보 및 상기 식별된 음향 정보에 기초하여 컨텐츠를 제공하는 하나 이상의 프로세서;를 포함하는, 전자 장치."}
{"patent_id": "10-2023-0090627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 하나 이상의 프로세서는,상기 선택된 적어도 하나의 게임 각각에 대응되는 메타데이터가 식별되지 않으면, 상기 선택된 적어도 하나의게임 각각에 대한 메인 포스터(Main Poster)에 대응되는 이미지를 식별하고,상기 식별된 이미지에 기초하여 상기 복수의 게임 타입 각각에 대응되는 사용자의 선호도 정보를 식별하는, 전자 장치."}
{"patent_id": "10-2023-0090627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 메모리는,입력 이미지에 대응되는 게임 타입 정보를 출력하도록 학습된 신경망 모델을 포함하며,상기 하나 이상의 프로세서는,상기 식별된 이미지를 상기 학습된 신경망 모델에 입력하여 상기 선택된 적어도 하나의 게임 각각에 대응되는게임 타입 정보를 식별하고,상기 식별된 게임 타입 정보에 기초하여 상기 복수의 게임 타입 각각에 대응되는 사용자의 선호도 정보를 식별하는, 전자 장치."}
{"patent_id": "10-2023-0090627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 하나 이상의 프로세서는, 상기 복수의 게임 타입 각각에 대응되는 상기 사용자의 선호도 정보가 식별되면, 상기 식별된 사용자의 선호도정보에 기초하여 상기 복수의 게임 타입 각각에 대응되는 가중치를 식별하고,상기 식별된 복수의 게임 타입 각각에 대응되는 가중치 및 상기 메모리에 저장된 정보에 기초하여 상기 사용자에 대응되는 화질 정보 및 음향 정보를 식별하는, 전자 장치."}
{"patent_id": "10-2023-0090627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2025-0011762-3-제1항에 있어서,상기 하나 이상의 프로세서는,출력되는 게임 컨텐츠에 대응되는 게임 이미지를 식별하고,상기 식별된 게임 이미지에 기초하여 상기 사용자의 선호도 정보를 업데이트하고,상기 업데이트된 사용자의 선호도 정보에 기초하여 상기 사용자에 대응되는 화질 정보 및 음향 정보를 업데이트하고, 상기 업데이트된 화질 정보 및 음향 정보에 기초하여 컨텐츠를 제공하는, 전자 장치."}
{"patent_id": "10-2023-0090627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 메모리는,입력 이미지에 대응되는 게임 타입 정보를 출력하도록 학습된 신경망 모델을 포함하며,상기 하나 이상의 프로세서는,상기 게임 이미지를 상기 학습된 신경망 모델에 입력하여 상기 게임 컨텐츠에 대응되는 게임 타입 정보를 식별하고,상기 식별된 게임 타입 정보에 기초하여 상기 복수의 게임 타입 각각에 대응되는 사용자의 선호도 정보를 업데이트하는, 전자 장치."}
{"patent_id": "10-2023-0090627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,스피커; 및디스플레이;를 더 포함하며,상기 하나 이상의 프로세서는, 상기 식별된 음향 정보에 기초하여 음향 컨텐츠를 출력하도록 상기 스피커를 제어하고 상기 식별된 화질 정보에기초하여 영상 컨텐츠를 출력하도록 상기 디스플레이를 제어하는, 전자 장치."}
{"patent_id": "10-2023-0090627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 복수의 게임 타입은,RPG(Role-playing game) 타입, 레이싱(Racing) 타입, 스포츠(Sports) 타입, RTS(Real-Time Strategy) 타입,FPS(First Person Shooter) 타입, 파이트(Fight) 타입 중 적어도 하나를 포함하며, 상기 하나 이상의 프로세서는,상기 선택된 적어도 하나의 게임 각각에 대응되는 적어도 하나의 게임 타입에 대한 정보가 포함된 메타데이터를식별하고,상기 식별된 메타데이터에 기초하여 상기 복수의 게임 타입 각각에 대응되는 통계 데이터를 식별하고,상기 식별된 통계 데이터에 기초하여 상기 사용자의 선호도 정보를 식별하는, 전자 장치."}
{"patent_id": "10-2023-0090627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 하나 이상의 프로세서는,상기 사용자의 선호 화질 정보 및 상기 사용자의 선호 음향 정보가 식별되면, 상기 식별된 선호 화질 정보, 상공개특허 10-2025-0011762-4-기 수신된 선호 음향 정보 및 상기 식별된 메타데이터에 기초하여 상기 사용자에 대응되는 화질 정보 및 음향정보를 식별하는, 전자 장치."}
{"patent_id": "10-2023-0090627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "전자 장치의 제어 방법에 있어서,적어도 하나의 게임을 선택하는 사용자 명령에 기초하여 상기 선택된 적어도 하나의 게임 각각에 대응되는 메타데이터(Metadata)를 식별하는 단계;상기 식별된 메타데이터에 기초하여 복수의 게임 타입 각각에 대응되는 사용자의 선호도 정보를 식별하는 단계;상기 식별된 사용자의 선호도 정보 및 메모리에 저장된 상기 복수의 게임 타입 각각에 대응되는 화질 정보 및음향 정보에 기초하여 상기 사용자에 대응되는 화질 정보 및 음향 정보를 식별하는 단계; 및상기 식별된 화질 정보 및 상기 식별된 음향 정보에 기초하여 컨텐츠를 제공하는 단계;를 포함하는, 제어 방법."}
{"patent_id": "10-2023-0090627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 선택된 적어도 하나의 게임 각각에 대응되는 메타데이터가 식별되지 않으면, 상기 선택된 적어도 하나의게임 각각에 대한 메인 포스터(Main Poster)에 대응되는 이미지를 식별하는 단계;를 더 포함하며,상기 사용자의 선호도 정보를 식별하는 단계는,상기 식별된 이미지에 기초하여 상기 복수의 게임 타입 각각에 대응되는 사용자의 선호도 정보를 식별하는, 제어 방법."}
{"patent_id": "10-2023-0090627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항에 있어서,상기 메모리는,입력 이미지에 대응되는 게임 타입 정보를 출력하도록 학습된 신경망 모델을 포함하고,상기 제어 방법은,상기 식별된 이미지를 상기 학습된 신경망 모델에 입력하여 상기 선택된 적어도 하나의 게임 각각에 대응되는게임 타입 정보를 식별하는 단계;를 더 포함하며,상기 사용자의 선호도 정보를 식별하는 단계는, 상기 식별된 게임 타입 정보에 기초하여 상기 복수의 게임 타입 각각에 대응되는 사용자의 선호도 정보를 식별하는, 제어 방법."}
{"patent_id": "10-2023-0090627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제10항에 있어서,상기 화질 정보 및 음향 정보를 식별하는 단계는,상기 복수의 게임 타입 각각에 대응되는 상기 사용자의 선호도 정보가 식별되면, 상기 식별된 사용자의 선호도정보에 기초하여 상기 복수의 게임 타입 각각에 대응되는 가중치를 식별하는 단계; 및상기 식별된 복수의 게임 타입 각각에 대응되는 가중치 및 상기 메모리에 저장된 정보에 기초하여 상기 사용자에 대응되는 화질 정보 및 음향 정보를 식별하는 단계;를 포함하는, 제어 방법."}
{"patent_id": "10-2023-0090627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제10항에 있어서,출력되는 게임 컨텐츠에 대응되는 게임 이미지를 식별하는 단계;공개특허 10-2025-0011762-5-상기 식별된 게임 이미지에 기초하여 상기 사용자의 선호도 정보를 업데이트하는 단계;상기 업데이트된 사용자의 선호도 정보에 기초하여 상기 사용자에 대응되는 화질 정보 및 음향 정보를 업데이트하는 단계; 및상기 업데이트된 화질 정보 및 음향 정보에 기초하여 컨텐츠를 제공하는 단계;를 더 포함하는, 제어 방법."}
{"patent_id": "10-2023-0090627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 메모리는,입력 이미지에 대응되는 게임 타입 정보를 출력하도록 학습된 신경망 모델을 포함하고,상기 제어 방법은,상기 게임 이미지를 상기 학습된 신경망 모델에 입력하여 상기 게임 컨텐츠에 대응되는 게임 타입 정보를 식별하는 단계;를 더 포함하며,상기 사용자의 선호도 정보를 업데이트하는 단계는,상기 식별된 게임 타입 정보에 기초하여 상기 복수의 게임 타입 각각에 대응되는 사용자의 선호도 정보를 업데이트하는, 제어 방법."}
{"patent_id": "10-2023-0090627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제1항에 있어서,상기 컨텐츠를 제공하는 단계는, 상기 식별된 음향 정보에 기초하여 음향 컨텐츠를 출력하도록 스피커를 제어하고 상기 식별된 화질 정보에 기초하여 영상 컨텐츠를 출력하도록 디스플레이를 제어하는, 제어 방법."}
{"patent_id": "10-2023-0090627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제10항에 있어서,상기 복수의 게임 타입은,RPG(Role-playing game) 타입, 레이싱(Racing) 타입, 스포츠(Sports) 타입, RTS(Real-Time Strategy) 타입,FPS(First Person Shooter) 타입, 파이트(Fight) 타입 중 적어도 하나를 포함하며, 상기 제어 방법은,상기 선택된 적어도 하나의 게임 각각에 대응되는 적어도 하나의 게임 타입에 대한 정보가 포함된 메타데이터를식별하는 단계;상기 식별된 메타데이터에 기초하여 상기 복수의 게임 타입 각각에 대응되는 통계 데이터를 식별하는 단계; 및상기 식별된 통계 데이터에 기초하여 상기 사용자의 선호도 정보를 식별하는 단계;를 포함하는, 제어 방법."}
{"patent_id": "10-2023-0090627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제10항에 있어서,상기 화질 정보 및 음향 정보를 식별하는 단계는,상기 사용자의 선호 화질 정보 및 상기 사용자의 선호 음향 정보가 식별되면, 상기 식별된 선호 화질 정보, 상기 수신된 선호 음향 정보 및 상기 식별된 메타데이터에 기초하여 상기 사용자에 대응되는 화질 정보 및 음향정보를 식별하는, 제어 방법."}
{"patent_id": "10-2023-0090627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "전자 장치의 프로세서에 의해 실행되는 경우 상기 전자 장치가 동작을 수행하도록 하는 컴퓨터 명령을 저장하는공개특허 10-2025-0011762-6-비일시적 컴퓨터 판독 가능 기록 매체에 있어서, 상기 동작은, 적어도 하나의 게임을 선택하는 사용자 명령에 기초하여 상기 선택된 적어도 하나의 게임 각각에 대응되는 메타데이터(Metadata)를 식별하는 단계;상기 식별된 메타데이터에 기초하여 복수의 게임 타입 각각에 대응되는 사용자의 선호도 정보를 식별하는 단계;상기 식별된 사용자의 선호도 정보 및 메모리에 저장된 상기 복수의 게임 타입 각각에 대응되는 화질 정보 및음향 정보에 기초하여 상기 사용자에 대응되는 화질 정보 및 음향 정보를 식별하는 단계; 및상기 식별된 화질 정보 및 상기 식별된 음향 정보에 기초하여 컨텐츠를 제공하는 단계;를 포함하는, 컴퓨터 판독 가능 기록 매체."}
{"patent_id": "10-2023-0090627", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "전자 장치가 개시된다. 전자 장치는, 복수의 게임 타입 각각에 대응되는 화질 정보 및 음향 정보가 저장된 메모 리 및 적어도 하나의 게임을 선택하는 사용자 명령에 기초하여 선택된 적어도 하나의 게임 각각에 대응되는 메타 데이터(Metadata)를 식별하고, 식별된 메타데이터에 기초하여 복수의 게임 타입 각각에 대응되는 사용자의 선호 도 정보를 식별하고, 식별된 사용자의 선호도 정보 및 메모리에 저장된 정보에 기초하여 사용자에 대응되는 화질 정보 및 음향 정보를 식별하고, 식별된 화질 정보 및 식별된 음향 정보에 기초하여 컨텐츠를 제공하는 하나 이상 의 프로세서를 포함한다."}
{"patent_id": "10-2023-0090627", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 전자 장치 및 이의 제어 방법에 관한 것으로, 더욱 상세하게는 복수의 게임 타입 별 사용자의 선호도 를 이용하여 사용자에게 맞춤화된(Customized) 화질 및 음향을 제공하는 전자 장치 및 이의 제어 방법에 관한 것이다."}
{"patent_id": "10-2023-0090627", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전자 기술의 발달에 힘입어 다양한 유형의 전자 기기가 개발 및 보급되고 있다. 사용자의 댁 내에서 사용되는 전자 장치는 디스플레이 등을 통해 사용자에게 게임 컨텐츠를 제공할 수 있다. 한편, 전자 장치를 통해 출력되는 게임 컨텐츠의 화질 옵션(예를 들어, 밝기(Brightness), 대비(Contrast) 등) 의 값 및 음향 옵션(예를 들어, 음량(Volume 등)의 값은 게임의 타입 또는 사용자 별로 상이할 수 있으며, 이에 따라 게임의 타입 또는 사용자의 게임 별 선호도에 기초하여 화질 및 음향을 설정하는 것이 중요하다."}
{"patent_id": "10-2023-0090627", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시 예에 따른 전자 장치는, 복수의 게임 타입 각각에 대응되는 화질 정보 및 음향 정보가 저장 된 메모리 및 적어도 하나의 게임을 선택하는 사용자 명령에 기초하여 상기 선택된 적어도 하나의 게임 각각에 대응되는 메타데이터(Metadata)를 식별하는 하나 이상의 프로세서를 포함할 수 있다. 상기 하나 이상의 프로세서는, 상기 식별된 메타데이터에 기초하여 상기 복수의 게임 타입 각각에 대응되는 사 용자의 선호도 정보를 식별할 수 있다. 상기 하나 이상의 프로세서는, 상기 식별된 사용자의 선호도 정보 및 상기 메모리에 저장된 정보에 기초하여 상 기 사용자에 대응되는 화질 정보 및 음향 정보를 식별할 수 있다. 상기 하나 이상의 프로세서는, 상기 식별된 화질 정보 및 상기 식별된 음향 정보에 기초하여 컨텐츠를 제공할 수 있다. 본 개시의 일 실시 예에 따른 전자 장치의 제어 방법은, 적어도 하나의 게임을 선택하는 사용자 명령에 기초하 여 상기 선택된 적어도 하나의 게임 각각에 대응되는 메타데이터(Metadata)를 식별하는 단계를 포함할 수 있다. 상기 제어 방법은, 상기 식별된 메타데이터에 기초하여 복수의 게임 타입 각각에 대응되는 사용자의 선호도 정 보를 식별하는 단계를 포함할 수 있다. 상기 식별된 사용자의 선호도 정보 및 메모리에 저장된 상기 복수의 게임 타입 각각에 대응되는 화질 정보 및 음향 정보에 기초하여 상기 사용자에 대응되는 화질 정보 및 음향 정보를 식별하는 단계를 포함할 수 있다. 상기 식별된 화질 정보 및 상기 식별된 음향 정보에 기초하여 컨텐츠를 제공하는 단계를 포함할 수 있다. 본 개시의 일 실시 예에 따른 전자 장치의 프로세서에 의해 실행되는 경우 상기 전자 장치가 동작을 수행하도록 하는 컴퓨터 명령을 저장하는 비일시적 컴퓨터 판독 가능 기록 매체에 있어서, 상기 동작은, 적어도 하나의 게임을 선택하는 사용자 명령에 기초하여 상기 선택된 적어도 하나의 게임 각각에 대응되는 메타데이터(Metadat a)를 식별하는 단계를 포함할 수 있다. 상기 동작은, 상기 식별된 메타데이터에 기초하여 복수의 게임 타입 각각에 대응되는 사용자의 선호도 정보를 식별하는 단계를 포함할 수 있다. 상기 동작은, 상기 식별된 사용자의 선호도 정보 및 메모리에 저장된 상기 복수의 게임 타입 각각에 대응되는 화질 정보 및 음향 정보에 기초하여 상기 사용자에 대응되는 화질 정보 및 음향 정보를 식별하는 단계를 포함할 수 있다. 상기 동작은, 상기 식별된 화질 정보 및 상기 식별된 음향 정보에 기초하여 컨텐츠를 제공하는 단계를 포함할 수 있다."}
{"patent_id": "10-2023-0090627", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 첨부 도면을 참조하여 본 개시를 상세히 설명한다. 본 명세서에서 사용되는 용어에 대해 간략히 설명하고, 본 개시에 대해 구체적으로 설명하기로 한다. 본 개시의 실시 예에서 사용되는 용어는 본 개시에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달 라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 개시의 설명 부 분에서 상세히 그 의미를 기재할 것이다. 따라서 본 개시에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가지는 의미와 본 개시의 전반에 걸친 내용을 토대로 정의되어야 한다. 본 명세서에서, \"가진다,\" \"가질 수 있다,\" \"포함한다,\" 또는 \"포함할 수 있다\" 등의 표현은 해당 특징(예: 수 치, 기능, 동작, 또는 부품 등의 구성요소)의 존재를 가리키며, 추가적인 특징의 존재를 배제하지 않는다. A 또는/및 B 중 적어도 하나라는 표현은 \"A\" 또는 \"B\" 또는 \"A 및 B\" 중 어느 하나를 나타내는 것으로 이해되어 야 한다. 본 명세서에서 사용된 \"제1,\" \"제2,\" \"첫째,\" 또는 \"둘째,\"등의 표현들은 다양한 구성요소들을, 순서 및/또는 중요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구성요소들 을 한정하지 않는다. 어떤 구성요소(예: 제1 구성요소)가 다른 구성요소(예: 제2 구성요소)에 \"(기능적으로 또는 통신적으로) 연결되 어((operatively or communicatively) coupled with/to)\" 있다거나 \"접속되어(connected to)\" 있다고 언급된 때에는, 어떤 구성요소가 다른 구성요소에 직접적으로 연결되거나, 다른 구성요소(예: 제3 구성요소)를 통하여 연결될 수 있다고 이해되어야 할 것이다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함하다\" 또 는 \"구성되다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것 이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 개시에서 \"모듈\" 혹은 \"부\"는 적어도 하나의 기능이나 동작을 수행하며, 하드웨어 또는 소프트웨어로 구현되 거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 또한, 복수의 \"모듈\" 혹은 복수의 \"부\"는 특정한 하드 웨어로 구현될 필요가 있는 \"모듈\" 혹은 \"부\"를 제외하고는 적어도 하나의 모듈로 일체화되어 적어도 하나의 프 로세서(미도시)로 구현될 수 있다. 도 1은 일 실시 예에 따른 전자 장치의 제어 방법을 개략적으로 설명하기 위한 도면이다. 도 1에 따르면, 일 실시 예에 따라 전자 장치는 복수의 게임 타입(1 내지 4) 각각에 대응되는 사용자의 선호도 정보를 식별할 수 있다. 일 예에 따라, 복수의 게임 타입(1 내지 4)은 RPG(Role-playing game) 타입, FPS(First Person Shooter) 타입, 스포츠(Sports) 타입 및 RTS(Real-Time Strategy) 타입을 포함하 는 상이한 타입일 수 있으나, 이에 한정되는 것은 아니다. 전자 장치는 사용자가 선호하는 게임에 대한 정보를 이용하여 복수의 게임 타입(1 내지 4)에 대응되는 사용자의 선호도 정보를 식별할 수 있다. 일 예에 따라, 전자 장치는 사용자의 선호 게임을 선택하는 사용자 명령에 기초하여 복수의 게임 타입 각각에 대응되는 사용자의 선 호도 정보를 식별할 수 있다. 일 실시 예에 따라, 전자 장치는 복수의 게임 타입(1 내지 4)에 대응되는 사용자의 선호도 정보에 기초하여 사 용자에 대응되는 화질 정보 및 음향 정보를 식별할 수 있다. 일 예에 따라, 전자 장치는 복수의 게임 타입 각각 에 대응되는 사용자의 선호도 값에 기초하여 복수의 게임 타입 각각에 대응되는 가중치 값을 식별하고, 식별된 가중치 값을 이용하여 사용자에 대응되는 화질 정보 및 음향 정보를 식별할 수 있다. 또는, 일 예에 따라 전자 장치는 실시간으로 출력되는 게임 컨텐츠(또는, 사용자가 현재 플레잉중인 게임 컨텐츠)에 기초하여 사용자에 대응되는 화질 정보 및 음향 정보를 식별할 수 있다. 전자 장치는 식별된 화질 정보 및 음향 정보에 기초하여 사용자에게 컨텐츠를 제공할 수 있다. 이하에서는, 사용자가 선호하는 게임 타입에 대한 정보 및 출력되는 게임 컨텐츠에 대한 정보를 이용하여, 사용 자에게 맞춤화된(Customized) 화질 및 음향이 반영된 컨텐츠를 제공하는 다양한 실시 예에 대하여 설명하도록 한다. 도 2는 일 실시 예에 따른 전자 장치의 구성을 나타내는 블록도이다. 도2에 따르면, 전자 장치는 메모리 및 하나 이상의 프로세서를 포함할 수 있다. 전자 장치는 일 실시 예에 따라 스마트 TV, 태블릿, 모니터, 스마트 폰, 데스크톱 컴퓨터, 랩톱 컴퓨터 등 과 같이 디스플레이를 구비한 다양한 장치로 구현될 수 있다. 본 개시의 일 실시 예에 따른 전자 장치는 상술한 기기에 한정되지 않으며, 전자 장치는 상술한 기기들의 둘 이상의 기능을 갖춘 전자 장치로 구현될 수 있다. 한편, 전자 장치는 다양한 방식으로 외부 장치(미도시)와 통신 연결할 수 있다. 일 실시 예에 따라, 외부 장치(미도시)와의 통신을 위한 통신 모듈이 동일하게 구현될 수 있다. 예를 들어, 전자 장치는 외부 장치 (미도시)와는 블루투스 모듈을 이용하여 통신할 수 있다. 메모리는 다양한 실시 예를 위해 필요한 데이터를 저장할 수 있다. 메모리는 데이터 저장 용도에 따 라 전자 장치에 임베디드된 메모리 형태로 구현되거나, 전자 장치에 탈부착이 가능한 메모리 형태로 구현될 수도 있다. 예를 들어, 전자 장치의 구동을 위 한 데이터의 경우 전자 장치에 임베디드된 메 모리에 저장되고, 전자 장치의 확장 기능을 위한 데이터의 경우 전자 장치에 탈부착이 가능한 메모리 에 저장될 수 있다. 한편, 전자 장치에 임베디드된 메모리의 경우 휘발성 메모리(예: DRAM(dynamic RAM), SRAM(static RAM), 또는 SDRAM(synchronous dynamic RAM) 등), 비휘발성 메모리(non-volatile Memory)(예: OTPROM(one timeprogrammable ROM), PROM(programmable ROM), EPROM(erasable and programmable ROM), EEPROM(electrically erasable and programmable ROM), mask ROM, flash ROM, 플래시 메모리(예: NAND flash 또는 NOR flash 등), 하드 드라이브, 또는 솔리드 스테이트 드라이브(solid state drive(SSD)) 중 적어도 하나로 구현될 수 있다. 또 한, 전자 장치에 탈부착이 가능한 메모리의 경우 메모리 카드(예를 들어, CF(compact flash), SD(secure digital), Micro-SD(micro secure digital), Mini-SD(mini secure digital), xD(extreme digital), MMC(multi-media card) 등), USB 포트에 연결가능한 외부 메모리(예를 들어, USB 메모리) 등과 같은 형태로 구 현될 수 있다. 일 실시 예에 따라, 메모리에는 복수의 게임 타입 각각에 대응되는 화질 정보 및 음향 정보를 포함할 수 있다. 화질 정보는 복수의 게임 타입 중 어느 하나가 제공되는 화질에 대한 정보를 의미하며, 화질 정보는 예를 들어, 백라이트 출력, 명암(Contrast), 밝기(Brightness), 선명도(Sharpness), 색상(color) 및 색조(tint)에 대한 정보 중 적어도 하나를 포함할 수 있다. 음향 정보는 복수의 게임 타입 중 어느 하나가 제공되는 음향에 대한 정보를 포함하며, 음향 정보는 예를 들어 음향 출력 타입, 음량 값 및 음향을 출력하는 기기 중 적어도 하 나에 대한 정보를 포함할 수 있다. 하나 이상의 프로세서(이하, 프로세서)는 메모리와 전기적으로 연결되어 전자 장치의 전반적인 동작을 제어한다. 프로세서는 하나 또는 복수의 프로세서로 구성될 수 있다. 구체적으로, 프로세서는 메모리에 저장된 적어도 하나의 인스트럭션을 실행함으로써, 본 개시의 다양한 실시 예에 따른 전자 장치 의 동작을 수행할 수 있다. 일 실시 예에 따라 프로세서는 디지털 영상 신호를 처리하는 디지털 시그널 프로세서(digital signal processor(DSP), 마이크로 프로세서(microprocessor), GPU(Graphics Processing Unit), AI(Artificial Intelligence) 프로세서, NPU (Neural Processing Unit), TCON(Time controller)으로 구현될 수 있다. 다만, 이에 한정되는 것은 아니며, 중앙처리장치(central processing unit(CPU)), MCU(Micro Controller Unit), MPU(micro processing unit), 컨트롤러(controller), 어플리케이션 프로세서(application processor(AP)), 또 는 커뮤니케이션 프로세서(communication processor(CP)), ARM 프로세서 중 하나 또는 그 이상을 포함하거나, 해당 용어로 정의될 수 있다. 또한, 프로세서는 프로세싱 알고리즘이 내장된 SoC(System on Chip), LSI(large scale integration)로 구현될 수도 있고, ASIC(application specific integrated circuit), FPGA(Field Programmable gate array) 형태로 구현될 수도 있다. 일 실시 예에 따라, 프로세서는 게임에 대응되는 메타데이터(Metadata)를 식별할 수 있다. 게임에 대응되 는 메타데이터는 게임의 메인 타이틀(Main Title), 서브 타이틀(Sub Title) 및 게임의 타입 정보 중 적어도 하 나를 포함할 수 있다. 일 예에 따라 게임의 타입 정보는 RPG(Role-playing game) 타입, 레이싱(Racing) 타입, 스포츠(Sports) 타입, RTS(Real-Time Strategy) 타입, FPS(First Person Shooter) 타입, 파이트(Fight) 타입 중 적어도 하나를 포함할 수 있으나, 이에 한정되는 것은 아니다. 일 예에 따라 게임에 대응되는 게임의 타입은 복수 개일 수 있다. 일 예에 따라, 프로세서는 적어도 하나의 게임을 선택하는 사용자 명령에 기초하여 선택된 적어도 하나의 게임 각각에 대응되는 메타데이터를 식별할 수 있다. 예를 들어, 프로세서는 통신 인터페이스를 통해 복수 의 게임 각각에 대응되는 메타데이터가 저장된 외부 서버로부터 게임에 대응되는 메타데이터를 수신할 수 있다. 프로세서는 통신 인터페이스를 통해 사용자 단말로부터 적어도 하나의 게임을 선택하는 사용자 명령을 수 신할 수 있다. 또는, 프로세서는 사용자 인터페이스를 통해 적어도 하나의 게임을 선택하는 사용자 입력을 수신할 수도 있다. 프로세서는 적어도 하나의 게임을 선택하기 위한 사용자 입력이 수신되면, 수신된 사용 자 입력에 기초하여 외부 서버로 선택된 게임에 대응되는 메타데이터를 요청하기 위한 신호를 전송할 수 있으며, 프로세서는 외부 서버로부터 선택된 게임에 대응되는 메타데이터를 수신할 수 있다. 일 실시 예에 따라, 프로세서는 사용자의 선호도 정보를 식별할 수 있다. 사용자의 선호도 정보는 복수의 게임 타입 각각에 대응되는 사용자의 선호도 크기를 의미한다. 일 예에 따라, 프로세서는 식별된 메타데이 터에 기초하여 복수의 게임 타입 각각에 대응되는 사용자의 선호도 정보를 식별할 수 있다. 예를 들어, 프로세 서는 사용자가 선택한 게임의 타입 별 개수에 기초하여 사용자의 선호도 정보를 식별할 수 있다. 이에 대 하여는 도 5를 통해 자세히 설명하도록 한다. 일 실시 예에 따라, 프로세서는 사용자에 대응되는 화질 정보 및 음향 정보를 식별할 수 있다. 사용자에 대응되는 화질 정보는 예를 들어, 백라이트(backlight) 출력, 명암(Contrast), 밝기(Brightness), 선명도 (Sharpness), 색상(color) 및 색조(tint)에 대한 정보 중 적어도 하나를 포함할 수 있다. 사용자에 대응되는 음향 정보는 예를 들어 음향 출력 타입, 음량 값 및 음향을 출력하는 기기 중 적어도 하나에 대한 정보를 포함할 수 있다. 일 예에 따라 프로세서는 식별된 사용자의 선호도 정보 및 메모리에 저장된 정보에 기초하 여 사용자에 대응되는 화질 정보 및 음향 정보를 식별할 수 있다. 예를 들어, 프로세서는 복수의 게임 타 입 각각에 대응되는 사용자의 선호도 값 및 메모리에 저장된 복수의 게임 타입 각각에 대응되는 화질 정보 및 음향 정보를 이용하여 사용자에 대응되는 화질 정보 및 음향 정보를 식별할 수 있다. 이에 대하여는 도 8을 통해 자세히 설명하도록 한다. 일 실시 예에 따라 프로세서는 컨텐츠를 제공할 수 있다. 여기서, 컨텐츠는 게임 컨텐츠일 수 있으나, 이 에 한정되지 않으며 컨텐츠는 영상을 포함하는 상이한 타입의 컨텐츠 중 어느 하나일 수 있음은 물론이다. 일 예에 따라, 프로세서는 식별된 화질 정보 및 식별된 음향 정보에 기초하여 컨텐츠를 제공할 수 있다. 일 실시 예에 따라, 전자 장치는 스피커 및 디스플레이를 포함할 수 있다. 일 예에 따라, 프로세서는 식별된 음향 정보에 기초하여 음향 컨텐츠를 출력하도록 스피커를 제어하고 식별된 화질 정보에 기초하여 영상 컨텐츠를 출력하도록 디스플레이를 제어할 수 있다. 다만, 이에 한정되는 것은 아니며 프로세서는 식별된 음향 정보에 대응되는 출력 신호를 통신 인터페이스를 통해 외부 장치로 전송할 수 있다. 이 경우, 외부 장치에 서 식별된 음향 정보에 대응되는 음향 컨텐츠가 제공될 수도 있다. 또한, 프로세서는 식별된 화질 정보에 대응되는 출력 신호를 통신 인터페이스를 통해 외부 장치로 전송할 수 있다. 이 경우, 외부 장치에서 식별된 화 질 정보에 대응되는 화질 컨텐츠가 제공될 수도 있다. 도 3은 일 실시 예에 따른 전자 장치의 제어 방법을 설명하기 위한 흐름도이다. 도 3에 따르면, 일 실시 예에 따라, 제어 방법은 적어도 하나의 게임을 선택하는 사용자 명령에 기초하여 선택 된 적어도 하나의 게임 각각에 대응되는 메타데이터(Metadata)를 식별할 수 있다(S310). 일 예에 따라, 프로세 서는 사용자 인터페이스를 통해 적어도 하나의 게임을 선택하기 위한 사용자 입력이 수신되면, 수신된 사 용자 입력에 기초하여 복수의 게임 중 사용자가 선택한 적어도 하나의 게임을 식별할 수 있다. 프로세서는 사용자가 선택한 적어도 하나의 게임이 식별되면, 복수의 게임 각각에 대응되는 메타데이터가 저장된 외부 서버 로부터 사용자가 선택한 적어도 하나의 게임에 대응되는 메타데이터를 수신할 수 있다. 다만, 이에 한정되는 것은 아니며, 일 예에 따라 메모리에는 복수의 게임 각각에 대응되는 메타데이터가 저장되어 있을 수 있으며, 프로세서는 메모리에 저장된 정보에 기초하여 사용자가 선택한 적어도 하 나의 게임에 대응되는 메타데이터를 식별할 수 있다. 이어서, 일 실시 예에 따라 제어 방법은, 식별된 메타데이터에 기초하여 복수의 게임 타입 각각에 대응되는 사 용자의 선호도 정보를 식별할 수 있다(S320). 일 예에 따라, 프로세서는 사용자가 선택한 적어도 하나의 게임에 대응되는 메타데이터가 식별되면, 식별된 메타데이터에 포함된 게임 각각에 대응되는 타입 정보에 기초 하여 사용자의 선호도 정보를 식별할 수 있다. 예를 들어, 프로세서는 적어도 하나의 식별된 메타데이터에 포함된 게임의 타입 정보를 합산하여, 각각의 타입에 대응되는 사용자의 선호도 정보를 식별할 수 있다. 이어서, 일 실시 예에 따라 제어 방법은, 식별된 사용자의 선호도 정보 및 메모리에 저장된 복수의 게임 타입 각각에 대응되는 화질 정보 및 음향 정보에 기초하여 사용자에 대응되는 화질 정보 및 음향 정보를 식별할 수 있다(S330). 일 예에 따라, 프로세서는 식별된 복수의 게임 타입 각각에 대응되는 사용자의 선호도 정 보 및 복수의 게임 타입 각각에 대응되는 화질 정보 및 음향 정보를 이용하여 사용자에 대응되는 화질 정보 및 음향 정보를 식별할 수 있다. 예를 들어, 프로세서는 사용자의 선호도 정보에 기초하여 복수의 게임 타입 각각에 대응되는 가중치를 식별하고, 식별된 가중치를 복수의 게임 타입 각각에 대응되는 화질 정보 및 음향 정 보와 곱하여 사용자에 대응되는 화질 정보 및 음향 정보를 식별할 수 있다. 이어서, 일 실시 예에 따라 제어 방법은, 식별된 화질 정보 및 식별된 음향 정보에 기초하여 컨텐츠를 제공할 수 있다(S340). 일 예에 따라, 프로세서는 사용자에 대응되는 화질 정보 및 음향 정보가 식별되면, 식별된 화질 정보 및 식별된 음향 정보에 기초하여 컨텐츠를 제공할 수 있다. 예를 들어, 사용자가 게임 컨텐츠를 플레 잉하기 위한 사용자 입력이 수신되는 경우, 프로세서는 식별된 화질 정보 및 식별된 음향 정보에 기초하여 디스플레이 및 스피커를 각각 제어할 수 있다. 상술한 예에 따르면, 전자 장치는 사용자가 선택한 선호 게임에 대한 정보를 이용하여 사용자에게 맞춤화 된(Customized) 화질 및 음향을 제공할 수 있다. 이에 따라, 사용자가 별도의 화질 조정 및 음향 조정을 수행하 지 않는 경우에도 사용자의 특성에 맞는 화질 및 음향이 제공될 수 있어, 사용자의 편의성 및 효율성이 증대될 수 있다.도 4는 일 실시 예에 따른 적어도 하나의 게임을 선택하는 사용자 명령을 수신하는 방법을 설명하기 위한 도면 이다. 도 4에 따르면, 일 실시 예에 따라 프로세서는 사용자 명령을 수신하기 위한 UI(User Interface)를 제공할 수 있다. 일 예에 따라, 프로세서는 복수의 게임 각각에 대응되는 메인 포스터(Main Poster)에 대한 이미지가 포함 된 UI를 식별할 수 있다. 예를 들어, 전자 장치가 디스플레이를 구비한 경우, 프로세서는 식별된 UI를 디스플레이를 통해 표시할 수 있다. 다만, 이에 한정되는 것은 아니며, 프로세서는 통신 인터페이스를 통해 식별된 UI에 대한 정보를 사용자 단말로 전송할 수 있으며, 사용자 단말에서 UI가 표시될 수도 있 다. 일 실시 예에 따라, 프로세서는 식별된 UI가 사용자에게 제공되면, 적어도 하나의 게임을 선택하는 사용자 명령을 수신할 수 있으며, 프로세서는 수신된 사용자 명령에 기초하여 복수의 게임 중 사용자가 선택한 적어도 하나의 게임을 식별할 수 있다. 일 예에 따라, 복수의 게임 중 어느 일부(41 내지 44)를 선택하기 위한 사용자 명령이 수신되면, 프로세서는 수신된 사용자 명령에 기초하여 사용자가 선택한 게임을 식별할 수 있다. 일 예에 따라, 프로세서는 사용자 인터페이스를 통해 사용자 명령을 수신할 수 있으나, 이에 한정되는 것은 아니며 일 예에 따라 UI가 사용자 단말에서 제공된 경우, 프로세서는 사용자 단말로부터 통신 인터페이스를 통해 수신 된 정보에 기초하여 사용자가 선택한 게임을 식별할 수도 있음은 물론이다. 도 5는 일 실시 예에 따른 사용자의 선호도 정보를 설명하기 위한 도면이다. 일 실시 예에 따라 프로세서는 사용자가 선택한 적어도 하나의 게임 각각에 대응되는 메타데이터에 기초하 여 사용자의 선호도 정보를 식별할 수 있다. 사용자의 선호도 정보는 복수의 게임 타입 각각에 대응되는 사용자 의 선호도 정보를 포함한다. 일 예에 따라, 복수의 게임 타입은 RPG(Role-playing game) 타입, 레이싱(Racing) 타입, 스포츠(Sports) 타입, RTS(Real-Time Strategy) 타입, FPS(First Person Shooter) 타입, 파이트 (Fight) 타입 중 적어도 하나를 포함할 수 있으나, 이에 한정되는 것은 아니다. 일 예에 따라 복수의 게임 타입 은 어드벤쳐(Adventure) 타입, 시뮬레이션(Simulation) 타입, 퍼즐(Puzzle) 타입 및 음악(Music) 타입 중 적어 도 하나를 더 포함할 수 있다. 도 5에 따르면, 일 실시 예에 따라, 프로세서는 사용자가 선택한 적어도 하나의 게임 각각에 대응되는 메 타데이터가 식별되면, 식별된 메타데이터에 포함된 게임의 타입 정보를 이용하여 사용자의 선호도 정보를 식별할 수 있다. 일 예에 따라, 사용자가 제1 게임, 제2 게임 및 제3 게임을 선택한 경우, 프로세서는 제1 게임, 제2 게임 및 제3 게임 각각에 대응되는 타입 정보에 기초하여 사용자의 선호도 정보를 식별할 수 있다. 일 예에 따라 복수의 타입 각각에 대응되는 선호도 값은 기본 값(예를 들어, 선호도 값이 2)이 존재할 수 있으며, 프로세서 는 사용자가 선택한 게임에 대응되는 타입 정보에 기초하여 복수의 타입 각각에 대응되는 선호도 값을 업 데이트할 수 있다. 예를 들어, 복수의 타입 각각에 대응되는 선호도 값의 기본 값이 2이고, 제1 게임의 타입이 레이싱 타입 및 스 포츠 타입이고, 제2 게임의 타입이 FPS 타입, 파이트 타입 및 RTS 타입이고, 제3 게임의 타입이 파이트 타입 및 RTS 타입인 경우를 상정한다. 일 예에 따라 프로세서는 사용자가 선택한 게임에 대응되는 타입 정보에 기 초하여 사용자가 선택한 게임에 대응되는 FPS 타입의 개수가 1, 레이싱 타입의 개수가 1, 파이트 타입의 개수가 2, RTS 타입의 개수가 2이고 스포츠 타입의 개수가 1인 것으로 식별할 수 있다. 프로세서는 이에 기초하여 RPG 타입의 선호도 값이 2, 레이싱 타입의 선호도 값이 3, FPS 타입의 선호도 값이 3, 파이트 타입의 선호도 값 이 4, RTS 타입의 선호도 값이 4 및 스포츠 타입의 선호도 값이 3인 것으로 식별할 수 있다. 한편, 일 실시 예 따라 프로세서는 통계 데이터에 기초하여 선호도 정보를 식별할 수 있다. 통계 데이터는 복수 의 게임 타입 각각에 대응되는 선호도에 대한 통계 데이터를 의미한다. 일 예에 따라, 프로세서는 선택된 적어도 하나의 게임 각각에 대응되는 적어도 하나의 게임 타입에 대한 정보가 포함된 메타데이터를 식별할 수 있다. 일 예에 따라 프로세서는 식별된 메타데이터에 기초하여 복 수의 게임 타입 각각에 대응되는 통계 데이터를 식별할 수 있다. 예를 들어, 메모리에는 기 설정된 통계 알고리즘이 저장되어 있을 수 있다. 프로세서는 메모리 에 저장된 통계 알고리즘을 이용하여, 식별된 적어도 하나의 메타데이터에 포함된 게임 타입 정보를 이용하여 통계 데이터를 식별할 수 있다. 이 경우, 통계 데이터는 복수의 게임 타입 각각에 대응되는 선호도에 대응되는통계 데이터가 포함될 수 있다. 프로세서는 식별된 통계 데이터에 기초하여 사용자의 선호도 정보를 식별 할 수 있다. 도 6은 일 실시 예에 따른 사용자의 선호도 정보를 식별하는 방법을 설명하기 위한 도면이다. 도 6에 따르면, 일 실시 예에 따라 제어 방법은 선택된 적어도 하나의 게임 각각에 대응되는 메타데이터가 식별 되는지 여부를 판단할 수 있다(S610). 일 실시 예에 따라, 프로세서는 적어도 하나의 게임을 선택하는 사 용자 명령이 수신되면, 수신된 사용자 명령에 기초하여 선택된 적어도 하나의 게임을 식별할 수 있다. 프로세서 는 선택된 적어도 하나의 게임에 대응되는 메타데이터에 대한 정보를 요청하는 신호를 외부 서버로 전송할 수 있다. 프로세서는 외부 서버로부터 메타데이터가 수신되는지 여부에 기초하여 메타데이터가 식별되는지 여부를 판단할 수 있다. 이어서, 일 실시 예에 따라 제어 방법은 선택된 적어도 하나의 게임 각각에 대응되는 메타데이터가 식별되지 않 으면(S610: N), 선택된 적어도 하나의 게임 각각에 대한 메인 포스터(Main Poster)에 대응되는 이미지를 식별할 수 있다(S620). 일 예에 따라 메모리에는 복수의 게임 각각에 대한 메인 포스터에 대응되는 이미지가 저장 되어 있을 수 있다. 프로세서는 외부 서버로부터 메타데이터가 수신되지 않으면, 메모리에 저장된 정 보에 기초하여 사용자에 의해 선택된 적어도 하나의 게임 각각에 대한 메인 포스터에 대응되는 이미지를 식별할 수 있다. 이어서, 일 실시 예에 따라 제어 방법은 식별된 이미지에 기초하여 복수의 게임 타입 각각에 대응되는 사용자의 선호도 정보를 식별할 수 있다(S630). 일 예에 따라, 외부 서버는 복수의 게임 각각에 대한 이미지 별로 맵핑된 게임 타입 정보가 저장되어 있을 수 있으며, 프로세서는 외부 서버로부터 선택된 적어도 하나의 게임 각각 에 대한 게임 타입 정보를 수신하고, 수신된 정보에 기초하여 사용자의 선호도 정보를 식별할 수 있다. 예를 들 어, 프로세서는 통신 인터페이스를 통해 선택된 적어도 하나의 게임에 대한 이미지를 외부 서버로 전송하 고, 외부 서버로부터 선택된 적어도 하나의 게임에 대한 게임 타입 정보를 수신할 수 있다. 프로세서는 수 신된 게임 타입 정보에 기초하여 사용자의 선호도 정보를 식별할 수 있다. 또는, 일 예에 따라 메모리에는 복수의 게임 각각에 대한 이미지 별로 맵핑된 게임 타입 정보가 저장되어 있을 수 있다. 프로세서는 적어도 하나의 게임 각각에 대한 메인 포스터에 대응되는 이미지가 식별되면, 메모리에 저장된 정보에 기초하여 초하여 선택된 적어도 하나의 게임에 대한 타입 정보를 식별할 수도 있 다. 상술한 예에 따르면, 전자 장치는 게임에 대한 메타데이터가 식별되지 않는 경우에도, 게임에 대응되는 메 인 포스터를 이용하여 게임의 타입 정보를 식별하고, 이에 기초하여 사용자의 선호도 정보를 식별할 수 있다. 또는, 일 예에 따라 프로세서는 학습된 신경망 모델을 이용하여 복수의 게임 타입 각각에 대응되는 사용자 의 선호도 정보를 식별할 수도 있다. 이에 대하여는 하기의 도 7을 통해 자세히 설명하도록 한다. 도 7은 일 실시 예에 따른 학습된 신경망 모델을 이용하여 사용자의 선호도 정보를 식별하는 방법을 설명하기 위한 도면이다. 본 개시의 일 실시 예로, 전자 장치에 포함된 SoC(System on Chip)에 복수의 프로세서가 포함된 경우, 전 자 장치는 복수의 프로세서 중 그래픽 전용 프로세서 또는 인공지능 전용 프로세서를 이용하여 인공 지능 과 관련된 연산(예를 들어, 신경망 모델의 학습(learning)이나 추론(inference)에 관련된 연산)을 수행하며, 복 수의 프로세서 중 범용 프로세서를 이용하여 전자 장치의 일반적인 연산을 수행할 수 있다. 예를 들 어, 전자 장치는 복수의 프로세서 중 컨볼루션 연산에 특화된 GPU, VPU, NPU, TPU 중 적어도 하나를 이용 하여 인공 지능과 관련된 연산을 수행하며, 복수의 프로세서 중 CPU, AP 중 적어도 하나를 이용하여 전자 장치 의 일반적인 연산을 수행할 수 있다. 신경망 모델은, 복수의 신경망 레이어들로 구성될 수 있다. 각 레이어는 복수의 가중치(weight values)을 갖고 있으며, 이전(previous) 레이어의 연산 결과와 복수의 가중치의 연산을 통해 레이어의 연산을 수행한다. 신경망 의 예로는, CNN (Convolutional Neural Network), DNN (Deep Neural Network), RNN (Recurrent Neural Network), RBM (Restricted Boltzmann Machine), DBN (Deep Belief Network), BRDNN(Bidirectional Recurrent Deep Neural Network) 및 심층 Q-네트워크 (Deep Q-Networks)이 있으며, 본 개시에서의 신경망은 명시한 경우 를 제외하고 전술한 예에 한정되지 않는다. 학습 알고리즘은, 다수의 학습 데이터들을 이용하여 소정의 대상 기기(예컨대, 로봇)을 훈련시켜 소정의 대상 기기 스스로 결정을 내리거나 예측을 할 수 있도록 하는 방법이다. 학습 알고리즘의 예로는, 지도형 학습 (supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi-supervised learning) 또 는 강화 학습(reinforcement learning)이 있으며, 본 개시에서의 학습 알고리즘은 명시한 경우를 제외하고 전술 한 예에 한정되지 않는다. 일 실시 예에 따라, 메모리는 입력 이미지에 대응되는 게임 타입 정보를 출력하도록 학습된 신경망 모델을 포함할 수 있다. 일 예에 따라, 학습된 신경망 모델은 RNN(Recurrent Neural Network)으로 구현되어 입력 이미 지에 대한 분류(Classification) 기능을 수행하는 신경망 모델일 수 있다. 학습된 신경망 모델은 게임에 대한 이미지(예를 들어, 게임의 메인 포스터 또는 플레잉 중인 게임 화면 이미지)와 함께 게임의 타입 정보를 이용하 여 학습되는 지도형 학습 알고리즘을 통해 학습될 수 있다. 다만, 이에 한정되는 것은 아니며, 학습된 신경망 모델은 상이한 타입의 신경망으로 구현될 수도 있음은 물론이다. 일 실시 예에 따라, 학습된 신경망 모델은 이미지가 입력되면 이미지에 대응되는 게임 타입 정보를 출력할 수 있다. 도 7에 따르면, 일 실시 예에 따라 제어 방법은 식별된 이미지를 학습된 신경망 모델에 입력하여 선택된 적어도 하나의 게임 각각에 대응되는 게임 타입 정보를 식별할 수 있다(S710). 일 예에 따라, 프로세서는 먼저 선 택된 적어도 하나의 게임 각각에 대한 메인 포스터(Main Poster)에 대응되는 이미지를 식별할 수 있다. 프로세 서는 선택된 적어도 하나의 게임 각각에 대한 이미지가 식별되면, 식별된 이미지를 학습된 신경망 모델에 입력하여 식별된 이미지 각각에 대응되는 게임 타입 정보를 식별할 수 있다. 프로세서는 식별된 이미지 각 각에 대응되는 게임 타입 정보를 선택된 적어도 하나의 게임 각각에 대한 게임 타입 정보로 식별할 수 있다. 이어서, 일 실시 예에 따라 제어 방법은 식별된 게임 타입 정보에 기초하여 복수의 게임 타입 각각에 대응되는 사용자의 선호도 정보를 식별할 수 있다(S720). 일 예에 따라, 프로세서는 선택된 적어도 하나의 게임 각 각에 대한 게임 타입 정보가 식별되면, 식별된 적어도 하나의 게임 타입 정보를 합산하여 사용자의 선호도 정보 를 식별할 수 있다. 상술한 예에 따르면, 전자 장치는 학습된 신경망 모델을 이용하여 사용자가 선택한 게임에 대응되는 게임 타입 정보를 식별할 수 있으며, 식별된 게임 타입 정보를 이용하여 사용자의 선호도 정보를 식별할 수 있게 된 다. 이에 따라, 전자 장치는 게임에 대응되는 메타데이터가 식별되지 않는 경우에도 사용자의 선호도 정보 를 식별할 수 있게 된다. 도 8은 일 실시 예에 따른 화질 정보 및 음향 정보를 식별하는 방법을 설명하기 위한 도면이다. 도 8에 따르면, 일 실시 예에 따라 제어 방법은 복수의 게임 타입 각각에 대응되는 사용자의 선호도 정보가 식 별되는지 여부를 판단할 수 있다(S810). 일 예에 따라, 프로세서는 선택된 적어도 하나의 게임 각각에 대 응되는 메타데이터를 이용하여 사용자의 선호도 정보를 식별할 수 있다. 또는, 일 예에 따라 프로세서는 학습된 신경망 모델을 이용하여 사용자의 선호도 정보를 식별할 수도 있다. 이어서, 일 실시 예에 따라 제어 방법은 식별된 사용자의 선호도 정보에 기초하여 복수의 게임 타입 각각에 대 응되는 가중치를 식별할 수 있다(S820). 일 예에 따라, 도 5에 도시된 바와 같이 RPG 타입의 선호도 값이 2, 레이싱 타입의 선호도 값이 3, FPS 타입의 선호도 값이 3, 파이트 타입의 선호도 값이 4, RTS 타입의 선호도 값이 4 및 스포츠 타입의 선호도 값이 3인 경 우를 상정한다. 프로세서는 사용자의 선호도 정보에 기초하여 RPG 타입의 가중치를 2/19(=2/(2+3+3+4+4+ 3)로 식별하고, 레이싱 타입의 가중치를 3/19(=3/(2+3+3+4+4+3))로 식별하고, FPS 타입의 가중치를 3/19(=3/(2+3+3+4+4+3)) 로 식별하고, 파이트 타입의 가중치를 4/19(=4/(2+3+3+4+4+3)) 로 식별하고, RTS 타입 의 가중치를 4/19(=4/(2+3+3+4+4+3)) 로 식별하고, 스포츠 타입의 가중치를 3/19(=3/(2+3+3+4+4+3))로 식별할 수 있다. 즉, 프로세서는 복수의 게임 타입 각각에 대응되는 선호도 크기에 기초하여 복수의 게임 타입 각 각에 대응되는 가중치를 식별할 수 있다. 다만, 이에 한정되는 것은 아니며 일 예에 따라 프로세서는 상술 한 바와 상이한 연산을 통해 복수의 게임 타입 각각에 대응되는 가중치를 식별할 수도 있음은 물론이다. 이어서, 일 실시 예에 따라 제어 방법은 식별된 복수의 게임 타입 각각에 대응되는 가중치 및 메모리에 저 장된 정보에 기초하여 사용자에 대응되는 화질 정보 및 음향 정보를 식별할 수 있다. 일 예에 따라, 메모리 에는 복수의 게임 타입 각각에 대응되는 화질 정보 및 음향 정보가 저장되어 있을 수 있다. 일 예에 따라 화질 정보는 백라이트 출력, 명암(Contrast), 밝기(Brightness), 선명도(Sharpness), 색상(color) 및 색조(tint)에 대한 정보 중 적어도 하나를 포함할 수 있다. 일 예에 따라 프로세서는 복수의 게임 타입 각각에 대응되는 가중치가 식별되면, 복수의 게임 타입 각각에 대응되는 가중치와 화질 정보 및 음향 정보를 연산하여 사용자에 대응되는 화질 정보 및 음향 정보를 식별할 수 있다. 예를 들어, 프로세서는 제1 게임 타입에 대응되는 제1 가중치와 제1 게임 타입에 대응되는 화질 정 보를 곱하여 제1 화질 정보를 식별할 수 있고, 제2 게임 타입에 대응되는 제2 가중치와 제2 게임 타입에 대응되 는 화질 정보를 곱하여 제2 화질 정보를 식별할 수 있다. 프로세서는 식별된 제1 화질 정보 및 제2 화질 정보를 합산하여 사용자에 대응되는 화질 정보로 식별할 수 있다. 예를 들어, 프로세서는 각각의 게임 타입에 대응되는 화질 정보를 연산할 수 있다. 프로세서는 RPG(Role-playing game) 타입에 대응되는 연산된 화질 정보, 레이싱(Racing) 타입에 대응되는 연산된 화질 정보, 스포츠(Sports) 타입에 대응되는 연산된 화질 정보, RTS(Real-Time Strategy) 타입에 대응되는 연산된 화 질 정보, FPS(First Person Shooter) 타입에 대응되는 연산된 화질 정보 및 파이트(Fight) 타입에 대응되는 연산된 화질 정보를 식별하고, 식별된 각각의 연산된 화질 정보를 합산하여 사용자에 대응되는 화질 정보를 식 별할 수 있다. 일 예에 따라, 프로세서는 각각의 게임 타입에 대응되는 연산된 명암(Contrast) 정보가 식 별되면, 이를 합산하여 사용자에 대응되는 명암 정보로 식별할 수 있다. 화질 정보와 마찬가지로, 일 예에 따라 프로세서는 식별된 가중치 및 메모리에 저장된 정보에 기초하 여 복수의 게임 타입 각각에 대응되는 음향 정보를 연산할 수 있다. 프로세서는 연산된 음향 정보를 사용 자에 대응되는 음향 정보로 식별할 수 있다. 도 9는 일 실시 예에 따른 화질 정보 및 음향 정보를 업데이트하는 방법을 설명하기 위한 도면이다. 도 9에 따르면, 일 실시 예에 따라 제어 방법은 출력되는 게임 컨텐츠에 대응되는 게임 이미지를 식별할 수 있 다(S910). 일 예에 따라, 프로세서는 현재 출력되는 게임 컨텐츠에 대응되는 게임 이미지를 실시간으로 식별할 수 있다. 이어서, 일 실시 예에 따라 제어 방법은 식별된 게임 이미지에 기초하여 사용자의 선호도 정보를 업데이트할 수 있다(S920). 일 예에 따라, 프로세서는 식별된 게임 이미지를 통신 인터페이스를 통해 외부 서버로 전송하고, 외부 서버로부 터 식별된 게임 이미지에 대응되는 게임 타입 정보를 수신할 수 있다. 프로세서는 수신된 게임 타입 정보를 이 용하여 복수의 게임 타입에 대한 사용자의 선호도 정보를 업데이트할 수 있다. 또는, 일 예에 따라 프로세서는 입력 이미지에 대응되는 게임 타입 정보를 출력하도록 학습된 신경망 모델을 이 용하여 사용자의 선호도 정보를 업데이트할 수도 있다. 이에 대하여는 도 10을 통해 자세히 설명하도록 한다. 이어서, 일 실시 예에 따라 제어 방법은 업데이트된 사용자의 선호도 정보에 기초하여 사용자에 대응되는 화질 정보 및 음향 정보를 업데이트할 수 있다(S930). 일 예에 따라, 프로세서는 사용자의 선호도 정보가 업데이트되 면, 업데이트된 복수의 게임 타입 각각에 대응되는 선호도 값에 기초하여 복수의 게임 타입 각각에 대응되는 가 중치를 업데이트할 수 있다. 프로세서는 업데이트된 복수의 게임 타입 각각에 대응되는 가중치에 기초하여 사용 자에 대응되는 화질 정보 및 음향 정보를 업데이트할 수 있다. 이어서, 일 실시 예에 따라 제어 방법은 업데이트된 화질 정보 및 음향 정보에 기초하여 컨텐츠를 제공할 수 있 다(S940). 상술한 예에 따르면, 전자 장치는 사용자가 플레잉하는 게임의 이미지를 이용하여 사용자의 선호도를 업데 이트할 수 있게 된다. 이에 따라, 사용자가 별도로 선호 게임을 선택하지 않아도 사용자의 선호도를 업데이트할 수 있게 되며 사용자의 편의성이 증대되고 사용자의 선호도를 더욱 정확히 판단할 수 있게 된다. 도 10은 일 실시 예에 따른 사용자의 선호도 정보를 업데이트하는 방법을 설명하기 위한 도면이다. 도 10에 따르면, 일 실시 예에 따라 제어 방법은 게임 이미지를 학습된 신경망 모델에 입력하여 게임 컨텐츠에 대응되는 게임 타입 정보를 식별할 수 있다(S1010). 일 예에 따라, 메모리에는 입력 이미지에 대응되는 게 임 타입 정보를 출력하도록 학습된 신경망 모델이 저장되어 있을 수 있다. 사용자가 게임을 플레잉중인 경우, 프로세서는 출력되는 게임 컨텐츠에 대응되는 게임 이미지를 식별할 수 있다. 프로세서는 식별된 게 임 이미지를 신경망 모델에 입력하여, 출력되는 게임 컨텐츠에 대응되는 게임 타입 정보를 식별할 수 있다. 예를 들어, 프로세서는 현재 출력중인 실시간 게임 이미지를 학습된 신경망 모델에 입력하여 게임 컨텐츠 에 대응되는 게임 타입 정보를 식별할 수 있다. 사용자가 게임을 플레잉하는 시간이 길어질수록 입력되는 게임 이미지의 프레임 수 또한 증가하게 되며, 이에 따라 보다 정확도 높은 게임 타입 정보가 출력될 수 있게 된다. 다만, 이에 한정되는 것은 아니며 프로세서는 현재 출력중인 게임 이미지 중 어느 일부의 이미지를 학습된 신경망 모델에 입력할 수도 있음은 물론이다. 이어서, 일 실시 예에 따라 제어 방법은 식별된 게임 타입 정보에 기초하여 복수의 게임 타입 각각에 대응되는 사용자의 선호도 정보를 업데이트할 수 있다(S1020). 일 예에 따라, 프로세서는 게임 타입 정보가 식별되 면, 식별된 게임 타입 정보에 기초하여 복수의 게임 타입 각각에 대응되는 사용자의 선호도 정보를 업데이트할 수 있다. 프로세서는 업데이트된 사용자의 선호도 정보를 이용하여 사용자에 대응되는 화질 정보 및 음향 정보를 업데이트하고, 업데이트된 화질 정보 및 음향 정보를 이용하여 컨텐츠를 제공할 수 있다. 도 11은 일 실시 예에 따른 사용자의 선호 화질 정보 및 선호 음향 정보를 이용하여 사용자의 선호도 정보를 식 별하는 방법을 설명하기 위한 도면이다. 도 11에 따르면, 일 실시 예에 따라 제어 방법은 사용자의 선호 화질 정보 및 사용자의 선호 음향 정보가 식별 되는지 여부를 판단할 수 있다(S1110). 일 예에 따라, 프로세서는 사용자로부터 선호 화질 정보 및 선호 음향 정보를 수신할 수 있다. 선호 화질 정보는 사용자가 원하는(또는, 선호하는) 화질에 대한 정보를 의미하며, 선호 음향 정보는 사용자가 원하는(또는, 선호하는) 음향에 대한 정보를 의미한다. 일 예에 따라, 프 로세서는 사용자 인터페이스를 통해 사용자로부터 선호 화질 정보 및 선호 음향 정보를 수신할 수 있다. 또는, 일 예에 따라 프로세서는 통신 인터페이스를 통해 외부 장치(예를 들어, 사용자 단말)로부터 선호 화질 정보 및 선호 음향 정보를 수신할 수 있다. 이어서, 일 실시 예에 따라 제어 방법은 사용자의 선호 화질 정보 및 사용자의 선호 음향 정보가 식별되면 (S1110: Y), 식별된 선호 화질 정보, 수신된 선호 음향 정보 및 식별된 메타데이터에 기초하여 사용자에 대응되 는 화질 정보 및 음향 정보를 식별할 수 있다(S1120). 일 예에 따라, 프로세서는 먼저 식별된 메타데이터 에 기초하여 복수의 게임 타입 각각에 대응되는 사용자의 선호도 정보를 식별할 수 있다. 프로세서는 식별 된 사용자 선호도 정보에 기초하여 사용자에 대응되는 제1 화질 정보 및 제1 음향 정보를 식별할 수 있다. 프로 세서는 사용자의 선호 화질 정보 및 선호 음향 정보가 식별되면, 식별된 사용자의 선호 화질 정보 및 식별 된 제1 화질 정보를 기 설정된 가중치로 곱하여 사용자에 대응되는 제2 화질 정보를 식별하고, 식별된 사용자의 선호 음향 정보 및 식별된 제1 음향 정보를 기 설정된 가중치로 곱하여 사용자에 대응되는 제2 음향 정보를 식 별할 수 있다. 예를 들어, 프로세서는 식별된 제1 화질 정보 및 사용자의 선호 화질 정보를 2:8의 가중치로 연산하여 제2 화질 정보를 식별할 수 있고, 식별된 제1 음향 정보 및 사용자의 선호 음향 정보를 2:8의 가중치로 연산하여 제 2 음향 정보를 식별할 수 있다. 프로세서는 식별된 제2 화질 정보 및 제2 음향 정보에 기초하여 컨텐츠를 제공할 수 있다. 다만, 이에 한정되는 것은 아니며 상술한 가중치 값과 상이한 가중치에 기초하여 제2 화질 정 보 및 제2 음향 정보가 식별될 수 있음은 물론이다. 도 12 는 일 실시 예에 따른 전자 장치의 세부 구성을 나타내는 블록도이다. 도 12에 따르면, 전자 장치(100')는 메모리, 하나 이상의 프로세서, 통신 인터페이스, 디스플레 이, 마이크, 스피커, 적어도 하나의 센서 및 사용자 인터페이스를 포함할 수 있다. 도 12에 도시된 구성 중 도 2에 도시된 구성과 중복된 구성에 대해서는 자세한 설명을 생략하도록 한다. 통신 인터페이스는 다양한 타입의 데이터를 입력 및 출력할 수 있다. 예를 들어 통신 인터페이스는 AP 기반의 Wi-Fi(와이파이, Wireless LAN 네트워크), 블루투스(Bluetooth), 지그비(Zigbee), 유/무선 LAN(Local Area Network), WAN(Wide Area Network), 이더넷(Ethernet), IEEE 1394, HDMI(High-Definition Multimedia Interface), USB(Universal Serial Bus), MHL(Mobile High-Definition Link), AES/EBU(Audio Engineering Society/ European Broadcasting Union), 옵티컬(Optical), 코액셜(Coaxial) 등과 같은 통신 방식 을 통해 외부 장치(미도시)(예를 들어, 소스 장치), 외부 저장 매체(예를 들어, USB 메모리), 외부 서버(예를 들어 웹 하드)와 다양한 타입의 데이터를 송수신할 수 있다. 일 예에 따라, 통신 인터페이스는 BLE(Bluetooth Low Energy) 모듈을 포함할 수 있다. BLE는 약 10m 의 도달 반경을 가진 2.4GHz 주파수 대역에서 저전력 저용량 데이터의 송수신이 가능한 블루투스 기술을 의미한다. 다만, 이에 한정되지 않으며 통신 인터페이스는 Wi-Fi 통신 모듈을 포함할 수도 있다. 즉, 통신 인터페이 스는 BLE(Bluetooth Low Energy) 모듈 또는 Wi-Fi 통신 모듈 중 적어도 하나를 포함할 수 있다.디스플레이는 자발광 소자를 포함하는 디스플레이 또는, 비자발광 소자 및 백라이트를 포함하는 디스플레 이로 구현될 수 있다. 예를 들어, LCD(Liquid Crystal Display), OLED(Organic Light Emitting Diodes) 디스플 레이, LED(Light Emitting Diodes), 마이크로 LED(micro LED), Mini LED, PDP(Plasma Display Panel), QD(Quantum dot) 디스플레이, QLED(Quantum dot light-emitting diodes) 등과 같은 다양한 형태의 디스플레이 로 구현될 수 있다. 디스플레이 내에는 a-si TFT, LTPS(low temperature poly silicon) TFT, OTFT(organic TFT) 등과 같은 형태로 구현될 수 있는 구동 회로, 백라이트 유닛 등도 함께 포함될 수 있다. 한 편, 디스플레이는 터치 센서와 결합된 터치 스크린, 플렉시블 디스플레이(flexible display), 롤러블 디스 플레이(rollable display), 3차원 디스플레이(3D display), 복수의 디스플레이 모듈이 물리적으로 연결된 디스 플레이 등으로 구현될 수 있다. 프로세서는 상술한 다양한 실시 예에 따라 획득된 출력 영상을 출력하도록 디스플레이를 제어할 수 있다. 여기서, 출력 영상은, 4K 또는 8K 이상의 고해상도 영상일 수 있다. 한편, 다른 실시 예에 따라, 전자 장치(100')는 디스플레이를 포함하지 않을 수 있다. 전자 장치(100')는 외부 디스플레이 장치와 연결될 수 있으며, 전자 장치(100')에 저장된 이미지 또는 컨텐츠를 외부 디스플레이 장치에 전송할 수 있다. 구체적으로, 전자 장치(100')는 외부 디스플레이 장치에서 이미지 또는 컨텐츠가 표시 되도록 제어하기 위한 제어 신호와 함께 이미지 또는 컨텐츠를 외부 디스플레이 장치에 전송할 수 있다. 여기서, 외부 디스플레이 장치는 전자 장치(100')와 통신 인터페이스 또는 입출력 인터페이스(미도시)를 통해 연결될 수 있다. 예를 들어, 전자 장치(100')는 STB(Set Top Box)와 같이 디스플레이를 포함하지 않을 수 있다. 또한, 전자 장치(100')는 텍스트 정보 등의 간단한 정보만을 표시할 수 있는 소형 디스플레이만을 포함할 수 있다. 여기서, 전자 장치(100')는 이미지 또는 컨텐츠를 통신 인터페이스를 통해 유선 또는 무선으로 외부 디스플레이 장치에 전송하거나 입출력 인터페이스(미도시)를 통해 외부 디스플레이 장치에 전송할 수 있다. 마이크는 소리를 획득하여 전기 신호로 변환하는 모듈을 의미할 수 있으며, 콘덴서 마이크, 리본 마이크, 무빙코일 마이크, 압전소자 마이크, 카본 마이크, MEMS(Micro Electro Mechanical System) 마이크일 수 있다. 또한, 무지향성, 양지향성, 단일지향성, 서브 카디오이드(Sub Cardioid), 슈퍼 카디오이드(Super Cardioid), 하 이퍼 카디오이드(Hyper Cardioid)의 방식으로 구현될 수 있다. 스피커는, 고음역대 소리 재생을 위한 트위터, 중음역대 소리 재생을 위한 미드레인지, 저음역대 소리 재 생을 위한 우퍼, 극저음역대 소리 재생을 위한 서브우퍼, 공진을 제어하기 위한 인클로저, 스피커에 입력되는 전기 신호 주파수를 대역 별로 나누는 크로스오버 네트워크 등으로 이루어질 수 있다. 스피커는, 음향 신호를 전자 장치(100')의 외부로 출력할 수 있다. 스피커는 멀티미디어 재생, 녹음 재생, 각종 알림음, 음성 메시지 등을 출력할 수 있다. 전자 장치(100')는 스피커와 같은 오디오 출력 장 치를 포함할 수 있으나, 오디오 출력 단자와 같은 출력 장치를 포함할 수 있다. 특히, 스피커는 획득한 정 보, 획득한 정보에 기초하여 가공·생산한 정보, 사용자 음성에 대한 응답 결과 또는 동작 결과 등을 음성 형태 로 제공할 수 있다. 적어도 하나의 센서(170, 이하 센서)는 다양한 타입의 복수의 센서를 포함할 수 있다. 센서는 물리량을 계 측하거나 전자 장치(100')의 작동 상태를 감지하여, 계측 또는 감지된 정보를 전기 신호로 변환할 수 있다. 센 서는 카메라를 포함할 수 있으며, 카메라는 오브젝트에 의해 반사되어 수신되는 가시광 기타 광학 신호를 이미지 센서로 포커싱하는 렌즈 및 가시광 기타 광학 신호를 감지할 수 있는 이미지 센서를 포함할 수 있다. 여 기서, 이미지 센서는 복수의 픽셀로 구분되는 2D의 픽셀 어레이를 포함할 수 있다. 또는, 적어도 하나의 센서 는 온도 센서 또는 적외선 센서를 포함할 수도 있다. 사용자 인터페이스는 전자 장치(100')가 사용자와 인터렉션(Interaction)을 수행하기 위한 구성이다. 예를 들어 사용자 인터페이스는 터치 센서, 모션 센서, 버튼, 조그(Jog) 다이얼, 스위치, 마이크 또는 스피커 중 적어도 하나를 포함할 수 있으나 이에 한정되는 것은 아니다. 상술한 예에 따르면, 전자 장치는 사용자가 선택한 선호 게임에 대한 정보를 이용하여 사용자에게 맞춤화 된(Customized) 화질 및 음향을 제공할 수 있다. 이에 따라, 사용자가 별도의 화질 조정 및 음향 조정을 수행하 지 않는 경우에도 사용자의 특성에 맞는 화질 및 음향이 제공될 수 있어, 사용자의 편의성 및 효율성이 증대될 수 있다. 한편, 상술한 본 개시의 다양한 실시 예들에 따른 방법들은, 기존 전자 장치에 설치 가능한 어플리케이션 형태 로 구현될 수 있다. 또는 상술한 본 개시의 다양한 실시 예들에 따른 방법들은 딥 러닝 기반의 학습된 신경망(또는 심층 학습된 신경망) 즉, 학습 네트워크 모델을 이용하여 수행될 수 있다. 또한, 상술한 본 개시의 다양 한 실시 예들에 따른 방법들은, 기존 전자 장치에 대한 소프트웨어 업그레이드, 또는 하드웨어 업그레이드 만으 로도 구현될 수 있다. 또한, 상술한 본 개시의 다양한 실시 예들은 전자 장치에 구비된 임베디드 서버, 또는 전 자 장치의 외부 서버를 통해 수행되는 것도 가능하다. 한편, 본 개시의 일시 예에 따르면, 이상에서 설명된 다양한 실시 예들은 기기(machine)(예: 컴퓨터)로 읽을 수 있는 저장 매체(machine-readable storage media)에 저장된 명령어를 포함하는 소프트웨어로 구현될 수 있다. 기기는, 저장 매체로부터 저장된 명령어를 호출하고, 호출된 명령어에 따라 동작이 가능한 장치로서, 개시된 실 시 예들에 따른 디스플레이 장치(예: 디스플레이 장치(A))를 포함할 수 있다. 명령이 프로세서에 의해 실행될 경우, 프로세서가 직접, 또는 프로세서의 제어 하에 다른 구성요소들을 이용하여 명령에 해당하는 기능을 수행 할 수 있다. 명령은 컴파일러 또는 인터프리터에 의해 제공 또는 실행되는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장매체의 형태로 제공될 수 있다. 여기서, '비일시적'은 저 장 매체가 신호(signal)를 포함하지 않으며 실재(tangible)한다는 것을 의미할 뿐 데이터가 저장매체에 반영구 적 또는 임시적으로 저장됨을 구분하지 않는다. 또한, 일 실시 예에 따르면, 이상에서 설명된 다양한 실시 예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래 될 수 있다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD- ROM))의 형태로, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 온라인으로 배포될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 저장 매체에 적어도 일시 저장되거나, 임시적으로 제공될 수 있다. 또한, 상술한 다양한 실시 예들에 따른 구성 요소(예: 모듈 또는 프로그램) 각각은 단수 또는 복수의 개체로 구 성될 수 있으며, 전술한 해당 서브 구성 요소들 중 일부 서브 구성 요소가 생략되거나, 또는 다른 서브 구성 요 소가 다양한 실시 예에 더 포함될 수 있다. 대체적으로 또는 추가적으로, 일부 구성 요소들(예: 모듈 또는 프로 그램)은 하나의 개체로 통합되어, 통합되기 이전의 각각의 해당 구성 요소에 의해 수행되는 기능을 동일 또는 유사하게 수행할 수 있다. 다양한 실시 예들에 따른, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동 작들은 순차적, 병렬적, 반복적 또는 휴리스틱하게 실행되거나, 적어도 일부 동작이 다른 순서로 실행되거나, 생략되거나, 또는 다른 동작이 추가될 수 있다. 이상에서는 본 개시의 바람직한 실시 예에 대하여 도시하고 설명하였지만, 본 개시는 상술한 특정의 실시 예에"}
{"patent_id": "10-2023-0090627", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "한정되지 아니하며, 청구범위에서 청구하는 본 개시의 요지를 벗어남이 없이 당해 개시에 속하는 기술분야에서 통상의 지식을 가진 자에 의해 다양한 변형 실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 개시의 기술 적 사상이나 전망으로부터 개별적으로 이해되어서는 안될 것이다."}
{"patent_id": "10-2023-0090627", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시 예에 따른 전자 장치의 제어 방법을 개략적으로 설명하기 위한 도면이다. 도 2는 일 실시 예에 따른 전자 장치의 구성을 나타내는 블록도이다. 도 3은 일 실시 예에 따른 전자 장치의 제어 방법을 설명하기 위한 흐름도이다. 도 4는 일 실시 예에 따른 적어도 하나의 게임을 선택하는 사용자 명령을 수신하는 방법을 설명하기 위한 도면 이다. 도 5는 일 실시 예에 따른 사용자의 선호도 정보를 설명하기 위한 도면이다. 도 6은 일 실시 예에 따른 사용자의 선호도 정보를 식별하는 방법을 설명하기 위한 도면이다. 도 7은 일 실시 예에 따른 학습된 신경망 모델을 이용하여 사용자의 선호도 정보를 식별하는 방법을 설명하기 위한 도면이다. 도 8은 일 실시 예에 따른 화질 정보 및 음향 정보를 식별하는 방법을 설명하기 위한 도면이다. 도 9는 일 실시 예에 따른 화질 정보 및 음향 정보를 업데이트하는 방법을 설명하기 위한 도면이다. 도 10은 일 실시 예에 따른 사용자의 선호도 정보를 업데이트하는 방법을 설명하기 위한 도면이다. 도 11은 일 실시 예에 따른 사용자의 선호 화질 정보 및 선호 음향 정보를 이용하여 사용자의 선호도 정보를 식 별하는 방법을 설명하기 위한 도면이다. 도 12는 일 실시 예에 따른 전자 장치의 세부 구성을 나타내는 블록도이다."}
