{"patent_id": "10-2020-0161229", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0081243", "출원번호": "10-2020-0161229", "발명의 명칭": "탄성초음파영상에 대한 변형률 계산 및 변형량의 자동 측정을 위한 방법 및 시스템", "출원인": "쥐이 프리시즌 헬스케어 엘엘씨", "발명자": "헬멋 브랜들"}}
{"patent_id": "10-2020-0161229", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "방법으로서,적어도 하나의 프로세서에 의해, 환자의 탄성영상 검사(elastography examination) 동안 획득된 이미징 데이터를 프로세싱하는 단계 - 상기 이미징 데이터는 특정 의료 이미징 기법에 대응함 -;상기 적어도 하나의 프로세서에 의해, 상기 이미징 데이터의 프로세싱에 기초하여, 대응하는 하나 이상의 의료이미지들을 생성하는 단계;상기 하나 이상의 의료 이미지들 내의 관심 영역(region-of-interest, ROI)에 대응하는 변형량 값(strainvalue)들을 계산하는 단계;상기 계산된 변형량 값들을 프로세싱하는 단계 - 상기 프로세싱하는 단계는,상기 탄성영상 검사에 기초하여, 상기 계산된 변형량 값들에 대응하는 복수의 범위들을 결정하는 단계;상기 복수의 범위들 각각에 대응하는 상기 관심 영역(ROI)의 부분들을 식별하는 단계; 및상기 계산된 변형량 값들, 상기 복수의 범위들, 및 상기 관심 영역(ROI)의 부분들 중 하나 이상에 기초하여 상기 탄성영상 검사의 결과를 평가하는 단계를 포함함 -; 및상기 계산된 변형량 값들의 프로세싱에 기초하여, 변형량 관련 피드백을 제공하는 단계를 포함하는, 방법."}
{"patent_id": "10-2020-0161229", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 하나 이상의 인공 지능 기반 알고리즘들을 사용하여 상기 적어도 하나의 프로세서를 통해 상기계산된 변형량 값들을 자동으로 프로세싱하는 단계를 추가로 포함하는, 방법."}
{"patent_id": "10-2020-0161229", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 탄성영상 검사의 타입에 기초하여 상기 계산된 변형량 값들을 프로세싱하는 단계를 추가로 포함하는, 방법."}
{"patent_id": "10-2020-0161229", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 탄성영상 검사의 타입은 자궁경부 탄성영상, 전립선 탄성영상, 유방 탄성영상, 및 갑상선탄성영상 중 하나를 포함하는, 방법."}
{"patent_id": "10-2020-0161229", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 하나 이상의 사전설정된 컷오프 값(pre-set cut off value)들에 기초하여 상기 복수의 범위들을 결정하는 단계를 포함하는, 방법."}
{"patent_id": "10-2020-0161229", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 탄성영상 검사의 타입에 기초하여 상기 하나 이상의 사전설정된 컷오프 값들을 결정하는단계를 포함하는, 방법."}
{"patent_id": "10-2020-0161229", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 상기 복수의 범위들은 적어도 낮은 범위, 높은 범위, 및 평균 범위를 포함하고, 상기 변형량관련 피드백을 제공하는 단계는 상기 하나 이상의 의료 이미지들 중 적어도 하나의 디스플레이된 의료 이미지에서의 적어도 상기 높은 범위 및 상기 낮은 범위에 대한 변형량 값들을 디스플레이하는 단계를 포함하는, 방법."}
{"patent_id": "10-2020-0161229", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "공개특허 10-2021-0081243-3-제1항에 있어서, 상기 복수의 범위들은 적어도 낮은 범위, 높은 범위, 및 평균 범위를 포함하고, 상기 탄성영상검사의 결과를 평가하는 단계는 상기 높은 범위와 상기 낮은 범위 사이의 비율을 계산하는 단계를 포함하는, 방법."}
{"patent_id": "10-2020-0161229", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서, 상기 탄성영상 검사는 자궁경부 탄성영상을 포함하고, 상기 탄성영상 검사의 결과는 상기 환자의 자궁경부의 연화(softening)를 포함하는, 방법."}
{"patent_id": "10-2020-0161229", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 변형량 관련 피드백을 제공하는 단계는, 상기 자궁경부의 연화가 발생했거나 발생하고 있다는 결정에 기초하여, 조기 분만(preterm delivery)에 대한 위험을 나타내는 피드백을 제공하는 단계를 포함하는, 방법."}
{"patent_id": "10-2020-0161229", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "시스템으로서,환자의 탄성영상 검사 동안 이미징 신호들을 획득하도록 구성된 스캐닝 디바이스 - 상기 이미징 데이터는 특정의료 이미징 기법에 대응함 -;이미지들을 디스플레이하도록 구성된 디스플레이 디바이스; 및적어도 하나의 프로세서를 포함하고, 상기 적어도 하나의 프로세서는,상기 스캐너 디바이스를 통해 획득된 상기 이미징 데이터를 프로세싱하도록;상기 이미징 데이터의 프로세싱에 기초하여, 대응하는 하나 이상의 의료 이미지들을 생성하도록;상기 디스플레이 디바이스를 통해, 상기 하나 이상의 의료 이미지들을 디스플레이하도록;하나 이상의 인공 지능 기반 알고리즘들을 사용하여, 자동으로,상기 하나 이상의 의료 이미지들 중 적어도 하나의 의료 이미지 내의 관심 영역(ROI)에 대응하는 변형량 값들을계산하도록;상기 계산된 변형량 값들을 프로세싱하도록 - 상기 프로세싱하는 것은,상기 탄성영상 검사에 기초하여, 상기 계산된 변형량 값들에 대응하는 복수의 범위들을 결정하는 것;상기 복수의 범위들 각각에 대응하는 상기 관심 영역(ROI)의 부분들을 식별하는 것; 및상기 계산된 변형량 값들, 상기 복수의 범위들, 및 상기 관심 영역(ROI)의 부분들 중 하나 이상에 기초하여 상기 탄성영상 검사의 결과를 평가하는 것을 포함함 -; 그리고상기 계산된 변형량 값들의 프로세싱에 기초하여, 변형량 관련 피드백을 제공하도록 구성되는, 시스템."}
{"patent_id": "10-2020-0161229", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 상기 적어도 하나의 프로세서는 상기 탄성영상 검사의 타입에 기초하여 상기 계산된 변형량값들을 프로세싱하도록 구성되는, 시스템."}
{"patent_id": "10-2020-0161229", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서, 상기 적어도 하나의 프로세서는 하나 이상의 사전설정된 컷오프 값들에 기초하여 상기 복수의범위들을 결정하도록 구성되는, 시스템."}
{"patent_id": "10-2020-0161229", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서, 상기 변형량 관련 피드백을 제공하는 것은, 상기 탄성영상 검사의 결과에 관한 피드백을 제공하는 것을 포함하고, 상기 적어도 하나의 프로세서는, 상기 변형량 관련 피드백을 제공할 때, 상기 디스플레이디바이스를 통해 상기 하나 이상의 의료 이미지들 중 적어도 하나의 디스플레이된 의료 이미지에서의 탄성영상공개특허 10-2021-0081243-4-검사의 결과의 표시자를 디스플레이하도록 구성되는, 시스템."}
{"patent_id": "10-2020-0161229", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11항에 있어서, 상기 탄성영상 검사는 자궁경부 탄성영상을 포함하고, 상기 탄성영상 검사의 결과는 상기 환자의 자궁경부의 연화를 포함하고, 상기 적어도 하나의 프로세서는, 상기 변형량 관련 피드백을 제공할 때, 상기 자궁경부의 연화가 발생했거나 발생하고 있다는 결정에 기초하여 조기 분만에 대한 위험의 표시자를 제공하도록 구성되는, 시스템."}
{"patent_id": "10-2020-0161229", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "탄성초음파영상에 대한 변형률 계산 및 변형량들의 자동 측정을 위한 방법들 및 시스템들이 제공된다."}
{"patent_id": "10-2020-0161229", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 태양들은 의료 이미징에 관한 것이다. 더 구체적으로, 소정 실시예들은, 특히 인공 지능(artificial intelligence, AI) 알고리즘들을 이용하는, 탄성초음파영상에 대한 변형률(strain-ratio) 계산 및 변형량 (strain)들의 자동 측정을 위한 방법들 및 시스템들에 관한 것이다."}
{"patent_id": "10-2020-0161229", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "다양한 의료 이미징 기법들이, 예컨대 인체 내의 장기들 및 연조직들을 이미징하는 데 이용될 수 있다. 의료 이미징 기법들의 예들은 초음파 이미징, 컴퓨터 단층촬영(computed tomography, CT) 스캔, 자기 공명 이미징 (magnetic resonance imaging, MRI) 등을 포함한다. 의료 이미징 동안에 이미지들이 생성되는 방식은 특정 기 법에 의존한다. 예를 들어, 초음파 이미징은 실시간 비-침습성 고주파 음파들을 사용하여, 전형적으로 인체 내부의 장기들, 조 직들, 객체들(예컨대, 태아)의 초음파 이미지들을 생성한다. 의료 이미징 동안 발생 또는 생성된 이미지들은 2 차원(2D), 3차원(3D), 및/또는 4차원(4D) 이미지들(본질적으로 실시간/연속 3D 이미지들)일 수 있다. 의료 이 미징 동안, (예컨대, 3D/4D 이미징 동안 볼류메트릭(volumetric) 이미징 데이터세트들을 포함하는) 이미징 데이 터세트들이 획득되고, 대응하는 이미지들을 (예컨대, 디스플레이를 통해) 실시간으로 생성 및 렌더링하는 데 사 용된다. 일부 경우들에서, 의료 이미징 시스템들은 특정 타입들의 검사를 이행하는 데 사용될 수 있다. 한 가지 그러한 타입은 탄성영상(elastography) 기반 검사이다. 그러한 검사와 함께 의료 이미징 시스템들의 사용은, 특히 검 사의 결과를 평가하는 것과 관련하여, 소정의 문제들을 제기한다. 종래의 그리고 전통적인 접근법들의 추가 제 한들 및 단점들은, 도면을 참조하여 본 출원의 나머지 부분에서 설명되는 바와 같이, 그러한 시스템들과 본 발 명의 일부 태양들의 비교를 통해 당업자에게 자명해질 것이다. 청구범위에서 더 완전하게 설명되는 바와 같이, 실질적으로 도면들 중 적어도 하나와 관련하여 도시되고/되거나 기술된 바와 같이, 탄성초음파영상에 대한 변형률 계산 및 변형량들의 자동 측정을 위한 시스템 및 방법들이 제 공된다. 본 발명의 이들 및 다른 이점들, 태양들 및 신규한 특징들뿐만 아니라, 그의 하나 이상의 예시된 예시적인 실시 예들의 상세 사항들이 하기의 설명 및 도면으로부터 더욱 완전히 이해될 것이다."}
{"patent_id": "10-2020-0161229", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명에 따른 소정 구현예들은 탄성초음파영상에 대한 변형률 계산 및 변형량들의 자동 측정에 관한 것일 수 있다. 특히, 다양한 실시예들은, 예컨대 변형률 계산들에 기초하여, 변형량 관련 결정들 및 변형량 값들의 자 동 측정의 사용에 의해 탄성영상 기반 의료 검사들을 향상시키는 기술적 효과를 갖는다. 본 발명의 태양들은, 그러한 결과들을 결정하는 것에 관한 변형량 관련 데이터의 더 정확한 평가를 허용함으로써, 탄성영상 기반 의 료 검사들의 결과들의 신뢰도 및 정확도를 증가시키는 것을 허용하는 기술적 효과를 갖는다."}
{"patent_id": "10-2020-0161229", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "전술한 발명의 내용뿐 아니라 소정 실시예들의 하기의 상세한 설명은 첨부 도면과 함께 읽을 때 더욱 잘 이해될 것이다. 도면들이 다양한 실시예들의 기능 블록들의 다이어그램들을 예시하는 한, 기능 블록들은 반드시 하드 웨어 회로부 사이의 분할을 나타내는 것은 아니다. 따라서, 예를 들어, 기능 블록들(예컨대, 프로세서들 또는 메모리들) 중 하나 이상은 단일의 하드웨어(예컨대, 범용 신호 프로세서 또는 랜덤 액세스 메모리의 블록, 하드 디스크 등) 또는 다수의 하드웨어로 구현될 수 있다. 유사하게, 프로그램은 독립형 프로그램일 수 있고, 운영 체제 내에 서브루틴으로서 통합될 수 있으며, 설치된 소프트웨어 패키지 내의 기능들일 수 있고, 기타 등등일 수 있다. 다양한 실시예들이 도면에 도시된 배열들 및 수단(instrumentality)으로 제한되지 않는 것을 이해해 야 한다. 또한, 실시예들이 조합될 수 있다는 것, 또는 다른 실시예들이 활용될 수 있다는 것 그리고 다양한 실시예들의 범주로부터 벗어남이 없이 구조적, 논리적 및 전기적 변화들이 이루어질 수 있다는 것을 이해해야 한다. 따라서, 하기의 상세한 설명은 제한적인 의미로 간주되어서는 안 되며, 본 발명의 범주는 첨부된 청구범 위 및 그 등가물들에 의해 한정된다. 본 명세서에서 사용되는 바와 같이, 단수형으로 인용되고 단어 \"a\" 또는 \"an\"으로 선행되는 요소 또는 단계는, 복수의 상기 요소들 또는 단계들의 배제가 명시적으로 언급되지 않는 한, 복수의 상기 요소들 또는 단계들을 배 제하지 않는 것으로 이해해야 한다. 더욱이, \"예시적인 실시예\", \"다양한 실시예들\", \"소정 실시예들\", \"대표 적인 실시예\" 등에 대한 언급들은, 인용된 특징부들을 또한 포함하는 추가 실시예들의 존재를 배제하는 것으로 해석되도록 의도되지 않는다. 더욱이, 명시적으로 반대로 언급되지 않는 한, 특정 속성을 갖는 요소 또는 복수 의 요소들을 \"포함하는(comprising, including)\", 또는 \"갖는\" 실시예들은, 그 속성을 갖지 않는 추가의 요소들 을 포함할 수 있다. 또한, 본 명세서에 사용되는 바와 같이, 용어 \"이미지\"는 가시성 이미지들 및 가시성 이미지를 표현하는 데이터 둘 모두를 광범위하게 지칭한다. 그러나, 많은 실시예들은 적어도 하나의 가시성 이미지를 생성한다(또는 그를 생성하도록 구성됨). 추가로, 본 명세서에서 사용되는 바와 같이, 어구 \"이미지\"는 초음파 모드, 예컨대 B-모 드(2D 모드), M-모드, 3차원(3D) 모드, CF-모드, PW 도플러, CW 도플러, MGD, 및/또는 B-모드의 서브모드들 및 /또는 CF, 예컨대 SWEI(Shear Wave Elasticity Imaging), TVI, Angio, B-플로우(B-flow), BMI, BMI_Angio, 및 일부 경우들에서, MM, CM, TVD를 지칭하는 데 사용되며, 여기서 \"이미지\" 및/또는 \"평면\"은 단일의 빔 또는 다 수의 빔들을 포함한다. 추가로, 본 명세서에서 사용되는 바와 같이, 어구 \"픽셀\"은, 또한, 데이터가 \"복셀\"로 표현되는 실시예들을 포 함한다. 따라서, 용어들 \"픽셀\" 및 \"복셀\" 둘 모두는 본 명세서 전체에 걸쳐 상호교환가능하게 사용될 수 있다. 또한, 본 명세서에서 사용되는 바와 같이, 용어 \"프로세서\" 또는 \"프로세싱 유닛\"은, 단일 또는 멀티-코어: CPU, APU(Accelerated Processing Unit), 그래픽 보드, DSP, FPGA, ASIC 또는 이들의 조합과 같은, 다양한 실 시예들에 필요한 요구된 계산을 수행할 수 있는 임의의 타입의 프로세싱 유닛을 지칭한다. 이미지들을 생성하거나 형성하는 본 명세서에 기술된 다양한 실시예들은, 일부 실시예들에서는 빔형성 (beamforming)을 포함하고 다른 실시예들에서는 빔형성을 포함하지 않는 이미지들을 형성하기 위한 프로세싱을 포함할 수 있다는 것에 유의해야 한다. 예를 들어, 이미지는, 예컨대 복조 데이터의 행렬을 계수들의 행렬과 곱하여 그 산물이 이미지가 되도록 빔형성 없이 형성될 수 있으며, 프로세스는 어떠한 \"빔들\"도 형성하지 않는 다. 추가로, 이미지들의 형성은 하나 초과의 송신 이벤트(예컨대, 합성 애퍼처(synthetic aperture) 기법들)로 부터 유래할 수 있는 채널 조합들을 사용하여 수행될 수 있다.다양한 실시예들에서, 소프트웨어, 펌웨어, 하드웨어, 또는 이들의 조합으로, 예를 들어, 수신 빔형성과 같은 초음파 빔형성을 포함하여, 이미지들을 형성하기 위한 초음파 프로세싱이 수행된다. 다양한 실시예들에 따라 형성된 소프트웨어 빔형성기(beamformer) 아키텍처를 갖는 초음파 시스템의 일 구현예가 도 1 및 도 2에 도시되 어 있다. 도 1은 탄성초음파영상에 대한 변형률 계산 및 변형량들의 자동 측정을 지원하기 위해 구성될 수 있는 예시적인 의료 이미징 배열을 도시하는 블록도이다. 도 1에는, 하나 이상의 의료 이미징 시스템들 및 하나 이상의 컴퓨팅 시스템들을 포함하는 예시적인 셋업이 도시되어 있다. 의료 이미징 시스템은 의료 이미징을 지원하기 위한 - 즉, 의료 이미징 검사 동안 이미지들을 생성하고/하 거나 렌더링하는 데 사용되는 데이터를 획득하는 것을 가능하게 하기 위한 - 적합한 하드웨어, 소프트웨어, 또 는 이들의 조합을 포함한다. 이는 특정 방식으로의 특정 타입의 데이터의 캡처링을 수반할 수 있는데, 이는, 이어서, 이미지들에 대한 데이터를 생성하는 데 사용될 수 있다. 예를 들어, 의료 이미징 시스템은 초음 파 이미지들을 생성하고/하거나 렌더링하기 위해 구성된 초음파 시스템일 수 있다. 의료 이미징 시스템에 대응할 수 있는 초음파 시스템의 예시적인 구현예가 도 2와 관련하여 더욱 상세히 기술된다. 도 1에 도시된 바 와 같이, 의료 이미징 시스템은, 휴대용이고 이동가능할 수 있는 스캐너 디바이스, 및 디스플레이/제 어 유닛을 포함할 수 있다. 스캐너 디바이스는, 예컨대 환자의 신체(또는 그의 일부) 위에서 이동됨으로써, 특정 타입의 이미징 신호 들(및/또는 그에 대응하는 데이터)을 생성하고/하거나 캡처하기 위해 구성될 수 있고, 그러한 기능들을 수행하 고/하거나 지원하기 위한 적합한 회로부를 포함할 수 있다. 스캐너 디바이스는 초음파 프로브, MRI 스캐 너, CT 스캐너, 또는 임의의 적합한 이미징 디바이스일 수 있다. 예를 들어, 의료 이미징 시스템이 초음 파 시스템인 경우, 스캐너 디바이스는 초음파 신호들을 방출하여 에코 초음파 이미지들을 캡처할 수 있다. 디스플레이/제어 유닛은 (예컨대, 스크린을 통해) 이미지들을 디스플레이하기 위해 구성될 수 있다. 일부 경우들에서, 디스플레이/제어 유닛은 디스플레이된 이미지들을 적어도 부분적으로 생성하기 위해 추 가로 구성될 수 있다. 또한, 디스플레이/제어 유닛은 또한 사용자 입력/출력을 지원할 수 있다. 예를 들 어, 디스플레이/제어 유닛은 이미지들 외에도 (예컨대, 스크린을 통해) 사용자 피드백(예컨대, 시스 템에 관한 정보, 그의 기능들, 이들의 설정들 등)을 제공할 수 있다. 디스플레이/제어 유닛은, 또한, 예 컨대 의료 이미징의 제어를 허용하기 위해, (예컨대, 사용자 제어부들을 통해) 사용자 입력을 지원할 수 있다. 사용자 입력은 이미지들의 디스플레이를 제어하는 것, 설정들을 선택하는 것, 사용자 선호도들을 지정하 는 것, 피드백을 요청하는 것 등에 관한 것일 수 있다. 일부 구현예에서, 의료 이미징 시스템은, 또한, 하나 이상의 컴퓨팅 시스템들과 같은 추가적인 전용 컴퓨팅 리소스들을 포함할 수 있다. 이와 관련하여, 각각의 컴퓨팅 시스템은 프로세싱, 저장, 및/또는 통 신 데이터를 위한 적합한 회로부, 인터페이스들, 로직, 및/또는 코드를 포함할 수 있다. 컴퓨팅 시스템은, 특히 의료 이미징과 함께 사용하기 위해 구성된 전용 장비일 수 있거나, 또는 컴퓨팅 시스템 에 대해 이하에서 기술되는 동작들을 수행하도록 셋업되고/되거나 구성된 범용 컴퓨팅 시스템(예컨대, 개 인용 컴퓨터, 서버 등)일 수 있다. 컴퓨팅 시스템은, 후술되는 바와 같이, 의료 이미징 시스템들의 동작들을 지원하도록 구성될 수 있다. 이와 관련하여, 다양한 기능들 및/또는 동작들이 이미징 시스템들로부터 오프로드될 수 있다. 이는 (이미징 시스템들에서 프로세싱 리소스들을 증가시킬 필요성을 제거함으로써) 비용 을 감소시키기 위해, 프로세싱의 소정 태양들을 간소화하고/하거나 집중시키도록 행해질 수 있다. 컴퓨팅 시스템들은 상이한 방식들로 사용하기 위해 셋업되고/되거나 배열될 수 있다. 예를 들어, 일부 구 현예들에서, 단일 컴퓨팅 시스템이 사용될 수 있고; 다른 구현예들에서, 다수의 컴퓨팅 시스템들은 (예컨대, 분배 프로세싱 구성에 기초하여) 함께 작동하도록, 또는 개별적으로 작동하도록 구성되며, 이때, 각각 의 컴퓨팅 시스템은 특정 태양들 및/또는 기능들을 처리하도록 그리고/또는 특정 의료 이미징 시스템들 에 대해서만 데이터를 프로세싱하도록 구성된다. 일부 구현예들에서, 컴퓨팅 시스템들은 국부적일 수 있고(예컨대, 예를 들어 동일한 설비 및/또는 동일한 로컬 네트워크 내에서, 하나 이상의 의료 이미징 시스템들과 공동-위치됨); 다른 구현예들에서, 컴퓨팅 시 스템들은 원격일 수 있고, 따라서, (예컨대, 인터넷 또는 다른 이용가능한 원격 액세스 기법들을 통해) 원 격 접속들을 통해서만 액세스될 수 있다. 특정 구현예에서, 컴퓨팅 시스템들은 클라우드 기반 방식으로 구성될 수 있고, 다른 클라우드 기반 시스템들이 액세스되고 사용되는 실질적으로 유사한 방식으로 액세스되고/되거나 사용될 수 있다. 일단 데이터가 컴퓨팅 시스템에서 생성되고/되거나 구성되면, 데이터는 의료 이미징 시스템들 내로 복사되고/되거나 로딩될 수 있다. 이는 상이한 방식들로 행해질 수 있다. 예를 들어, 데이터는 의료 이미징 시스템들과 컴퓨팅 시스템 사이의 직접 접속들 또는 링크들을 통해 로딩될 수 있다. 이와 관련하여, 셋업 내의 상이한 요소들 사이의 통신은 이용가능한 유선 및/또는 무선 접속들을 사용하여, 그리고/또는 임의의 적합한 통신(및/또는 네트워킹) 표준들 또는 프로토콜들에 따라 행해질 수 있다. 대안으로 또는 추가로, 데이터는 의료 이미징 시스템들 내로 간접적으로 로딩될 수 있다. 예를 들어, 데이터는 적합한 기계 판독가능 매체들(예컨대, 플래시 카드 등)에 저장될 수 있거나 - 이들은, 이어서, (현장에서, 예컨대 시스 템들의 사용자들(예컨대, 이미징 임상의들) 또는 관계자들에 의해) 데이터를 의료 이미징 시스템들 내로 로딩하는 데 사용됨 -, 또는 데이터는 로컬 통신 가능 전자 디바이스들(예컨대, 랩톱들 등)로 다운로딩될 수 있 다 - 이들은, 이어서, 직접 접속들(예컨대, USB 커넥터 등)을 통해, 의료 이미징 시스템들로 데이터를 업 로드하기 위해 (예컨대, 시스템들의 사용자들 또는 관계자들에 의해) 현장에서 사용됨 -. 동작 시에, 의료 이미징 시스템은 의료 검사들 동안 이미지들을 생성 및 제시(예컨대, 렌더링 또는 디스플 레이)하는 데, 그리고/또는 그들과 함께 사용자 입력/출력을 지원하는 데 사용될 수 있다. 이미지들은 2D, 3D, 및/또는 4D 이미지들일 수 있다. 이미지들의 생성 및/또는 제시를 용이하게 하기 위해 의료 이미징 시스템 에서 수행되는 특정 동작들 또는 기능들은 시스템의 타입- 즉, 이미지들에 대응하는 데이터가 획득되고/되 거나 생성되는 방식 - 에 의존한다. 예를 들어, 초음파 이미징에서, 데이터는, 도 2에 대해 더욱 상세히 기술 되는 바와 같이, 방출된 초음파 신호 및 에코 초음파 신호에 기초한다. 본 발명에 따르면, 의료 이미징 시스템들(예컨대, 의료 이미징 시스템)은 탄성초음파영상에 대한 변형률 계산 및 변형량들의 자동 측정을 지원하기 위해 구성될 수 있다. 이와 관련하여, 의료 이미징(예컨대, 초음파 이미징)은 탄성영상 관련 응용들(초음파 이미징의 맥락에서 탄성초음파영상으로 지칭됨)에서 사용될 수 있고, 여기서 (예컨대, 특정 장기 또는 신체 부위의) 연조직의 강성도 및 탄성 속성들이 평가되고/되거나 결정(예컨대, 맵핑)될 수 있다. 이와 관련하여, 연조직의 연성 및 그의 변화들(예컨대, 조직의 연화 (softening) 또는 경화(hardening))이 의학적 영향들을 미칠 수 있는 경우들에 탄성영상이 사용될 수 있다. 예를 들어, 임산부에게서 자궁경부(cervix)의 연화를 체크하는 데 탄성영상이 사용될 수 있다. 이와 관련하여, 임신 동안 자궁경부의 연화는 조기 분만에 대한 심각한 위험을 제기한다. 자궁경부의 조기 연화는, 전형적으로, 자궁경관(cervical canal)의 중심으로부터 발생하며, 그 곳으로부터, 전체 자궁경부가 영향받을 때 까지 확장되는 것이다. 따라서, 자궁경부의 탄성영상(예컨대, 탄성초음파영상)은 그것이 경질이고 명백한 (patent)지의 여부, 또는 연화가 시작되었거나 이미 발생한 경우를 보여줄 수 있다. 예를 들어, 탄성초음파영상은 질내 검사(endo-vaginal examination)의 형태로 수행될 수 있으며, 여기서 변형량 탄성영상을 적용하는 것은 자궁경부의 상태를 실증할 수 있다. 변형량 탄성영상에서, 임상의들은, 전형적으로, 변형량 및/또는 변형률들의 평가에 기초하여, 조직의 연성(및, 따라서, 자궁경부의 연화가 발생했거나 발생하고 있는지의 여부)의 결정을 행할 수 있다. 이와 관련하여, 변형량은 그에 가해지는 압력 또는 응력에 응답하여 특정 조직(또는 그의 영역)에 의해 나타나는 변형(deformation)의 척도이며, 이와 같이, 조직의 연성의 표시로 서 사용될 수 있고; 변형률 계산은, 이상적으로는 동일한 양의 응력에 노출될 때, 2개의 상이한 영역들(예컨대 상이한 조직들 및/또는 동일한 조직의 상이한 부분들에 대응함)에 대해 나타내지거나 측정된 변형량들의 비율을 측정한다. 예를 들어, 변형량 탄성영상 동안, 외부 압축이 조직에 가해지고, 압축 전과 압축 후의 초음파 이미 지들이 취해져서 비교되며, 이때, 최소로 변형된 이미지(들)의 영역들은 가장 강성(즉, 가장 경성)인 영역들인 반면, 최대로 변형된 영역들은 최소 강성(가장 연성)이 된다. 전형적으로 변형량 탄성영상 동안 임상의들에게 디스플레이될 수 있는 것은 검사된 조직들에서의 상대적 왜곡들(즉, 변형량들)의 이미지이다. 따라서, 종래의 솔루션들에서, 조직의 연성에 대한 임상의의 결정은, 전형적으로, 변형량 및/또는 변형률들을 평가하기 위한, 검사(의료 이미징) 동안의 디스플레이된 이미지들의 시각적 검사에 기초한다. 임상의들이 자궁경부의 연화가 발생했거나 발생하고 있다고 결정(또는 의심)할 때, 환자는 전형적으로 추가 검 사에 대해 문의를 받는다. 그러나, 상기에서 언급된 바와 같이, 자궁경부의 연화가 제기하는 위험들 때문에, 임상의들은 몹시 신중한 경향이 있어서, 따라서, 대부분의 검출된 변형들(deformations)(예컨대, 변형량들 및/ 또는 변형률)을 자궁경부의 연화를 시사하는 것으로서 식별하며, 이는 과잉 진단(over-diagnosis)으로 이어질 수 있다. 따라서, 자궁경부의 탄성영상의 신뢰성 및 정밀도를 증가시키는 것이 바람직하다. 따라서, 본 발명의 다양한 구현예들에서, 의료 이미징 시스템들은 초음파탄성영상에 대한 변형률 계산 및 변형 량들의 자동 측정을 지원하도록, 변형량 탄성영상의 신뢰성을 증가시키는 것을 허용하도록, 그리고 따라서, (예 컨대, 자궁경부의 연화로서 그러한 가능한 이슈들 또는 문제들의) 과잉 진단을 감소시키도록 구성될 수 있다. 또한, 많은 구현예들에서, 이는, 특히, 인공 지능(AI) 알고리즘들의 사용에 의해, 그러한 자동 측정들 및/또는 계산들을 수행하고/하거나 최적화하기 위해, 그리고/또는 관련 기능들(예컨대, 검사, 평가들 등의 셋업 및 이행)을 추가로 향상시키기 위해 행해질 수 있다. 특히 자궁경부 검사들과 함께, 탄성초음파영상에 대한 변형 률 계산 및 변형량들의 자동 측정의 사용은 하기에 더욱 상세하게 기재되어 있다. 자궁경부 검사의 신뢰성을 향상시키는 것에 더하여, 변형률 계산 및 변형량들의 자동 측정이 또한 다른 임신 관 련 응용들에 이용될 수 있다. 예를 들어, 분만이 시작되지 않고 약물에 의해 유도되는 경우들에 있어서, 탄성 초음파영상에서의 변형률 계산들 및 변형량들의 자동 측정들은, 자궁경부가 약물에 응답하였는지(또는 그렇지 않은지)를 체크하는 데 사용될 수 있다. 또한, 다양한 예시적인 구현예들이 자궁경부 검사들과 함께 변형량 탄 성영상의 사용에 대해 기술되지만, 본 발명은 그러한 응용예들로만 제한되는 것이 아니며, (특히, 탄성초음파영 상에서의 변형률 계산들 및 변형량들의 자동 측정들의 사용에 대해, 그리고, 구체적으로, AI 알고리즘들에 의해) 본 명세서에서 기술되는 솔루션들은 변형량 탄성영상이 사용되는 다른 응용예들, 예를 들어, 유방 검사들 (예컨대, 병변들에 대한 진단 이미징), 작은 부분 검사들(예컨대, 갑상선 및 고환 병변들의 이미징), 전립선 검 사들(예컨대, 병변들에 대한 초음파 이미징) 등에서 유사하게 사용될 수 있다. 도 2는 탄성초음파영상에 대한 변형률 계산 및 변형량들의 자동 측정을 지원하기 위해 구성될 수 있는 예시적인 초음파 시스템을 도시하는 블록도이다. 도 2에는 초음파 시스템이 도시되어 있다. 초음파 시스템은 초음파 이미징을 제공하기 위해 구성될 수 있고, 이와 같이, 초음파 이미징 관련 기능들 을 수행하고/하거나 지원하기 위한 적합한 회로부, 인터페이스들, 로직, 및/또는 코드를 포함할 수 있다. 초음 파 시스템은 도 1의 의료 이미징 시스템에 대응할 수 있다. 초음파 시스템은, 예를 들어, 송신기, 초음파 프로브, 송신 빔형성기, 수신기, 수신 빔형성기, RF 프로세서, RF/IQ 버퍼, 사용자 입력 모듈, 신호 프로세서, 이미지 버 퍼, 디스플레이 시스템, 아카이브, 및 트레이닝 엔진을 포함한다. 송신기는 초음파 프로브를 구동시키도록 동작가능할 수 있는 적합한 회로부, 인터페이스들, 로직, 및 /또는 코드를 포함할 수 있다. 초음파 프로브는 압전 요소들의 2차원(2D) 어레이를 포함할 수 있다. 초 음파 프로브는 송신 트랜스듀서 요소들의 그룹 및 수신 트랜스듀서 요소들의 그룹을 포함할 수 있으며, 이들은 통상적으로 동일한 요소들을 구성할 수 있다. 소정 실시예에서, 초음파 프로브는 심장, 혈관, 또는 임의의 적합한 해부학적 구조물과 같은 해부학적 구조의 적어도 상당한 부분을 커버하는 초음파 이 미지 데이터를 획득하도록 동작가능할 수 있다. 송신 빔형성기는, 송신 서브애퍼처(sub-aperture) 빔형성기를 통해, 초음파 송신 신호들을 관심 영역 (예컨대, 인간, 동물, 지하 공동, 물리적 구조물 등) 내로 방출하도록 송신 트랜스듀서 요소들의 그룹을 구동하는 송신기를 제어하도록 동작가능할 수 있는 적합한 회로부, 인터페이스들, 로직 및/또는 코드를 포 함할 수 있다. 송신된 초음파 신호들은 혈구들 또는 조직과 같은 관심 객체 내의 구조물들로부터 후방산란되어, 에코들을 생성할 수 있다. 에코들은 수신 트랜스듀서 요소들에 의해 수신된다. 초음파 프로브 내의 수신 트랜스듀서 요소들의 그룹은 수신된 에코들을 아날로그 신호들로 변환하도 록 동작가능할 수 있고, 이는 수신 서브애퍼처 빔형성기에 의해 서브애퍼처 빔형성을 겪고, 이어서 수신기 로 통신된다. 수신기는, 수신 서브애퍼처 빔형성기로부터 신호들을 수신하도록 동작가능할 수 있는 적합한 회로부, 인터페이스들, 로직, 및/또는 코드를 포함할 수 있다. 아날로그 신호들은 복수의 A/D 변 환기들 중 하나 이상에 통신될 수 있다. 복수의 A/D 변환기들은, 수신기로부터의 아날로그 신호들을 대응하는 디지털 신호들로 변환하도록 동 작가능할 수 있는 적합한 회로부, 인터페이스들, 로직, 및/또는 코드를 포함할 수 있다. 복수의 A/D 변환기들 은 수신기와 RF 프로세서 사이에 배치된다. 그럼에도 불구하고, 본 발명은 이와 관련하여 제한 되지 않는다. 따라서, 일부 실시예들에서, 복수의 A/D 변환기들은 수신기 내에 통합될 수 있다. RF 프로세서는, 복수의 A/D 변환기들에 의해 출력되는 디지털 신호들을 복조하도록 동작가능할 수 있 는 적합한 회로부, 인터페이스들, 로직, 및/또는 코드를 포함할 수 있다. 일 실시예에 따르면, RF 프로세서 는 대응하는 에코 신호들을 나타내는 I/Q 데이터 쌍들을 형성하기 위해 디지털 신호들을 복조하도록 동작 가능한 복합 복조기(도시되지 않음)를 포함할 수 있다. RF 또는 I/Q 신호 데이터는, 이어서, RF/IQ 버퍼로 통신될 수 있다. RF/IQ 버퍼는, RF 프로세서에 의해 생성되는 RF 또는 I/Q 신호 데이터의 임시 저장을 제공하도록 동작가능할 수 있는 적합한 회로부, 인터페이스들, 로직, 및/또는 코드를 포함할 수 있다. 수신 빔형성기는, 예를 들어, RF/IQ 버퍼를 통해 RF 프로세서로부터 수신되는 지연된 채널 신호 들을 합산하기 위해 그리고 빔 합산 신호를 출력하기 위해 디지털 빔형성 프로세싱을 수행하도록 동작가능할 수 있는 적합한 회로부, 인터페이스들, 로직, 및/또는 코드를 포함할 수 있다. 생성된 프로세싱된 정보는, 수신 빔형성기로부터 출력되고 신호 프로세서로 통신되는 빔 합산 신호일 수 있다. 일부 실시예들에 따르 면, 수신기, 복수의 A/D 변환기들, RF 프로세서, 및 빔형성기는 디지털일 수 있는 단일 빔 형성기 내에 통합될 수 있다. 다양한 실시예들에서, 초음파 시스템은 복수의 수신 빔형성기들을 포 함한다. 사용자 입력 디바이스는, 환자 데이터, 스캔 파라미터들, 설정들, 선택 프로토콜들 및/또는 템플릿들을 입 력하고, 인공 지능 세그먼트화 프로세서와 상호작용하여 추적 타깃들을 선택하고, 등을 하도록 활용될 수 있다. 예시적인 실시예에서, 사용자 입력 디바이스는 초음파 시스템 내의 하나 이상의 컴포넌트들 및/또는 모듈들의 동작을 구성하고/하거나 관리하고/하거나 제어하도록 동작가능할 수 있다. 이와 관련하여, 사용자 입 력 디바이스는 송신기, 초음파 프로브, 송신 빔형성기, 수신기, 수신 빔형성기, RF 프로세서, RF/IQ 버퍼, 사용자 입력 디바이스, 신호 프로세서, 이미지 버퍼, 디 스플레이 시스템, 및/또는 아카이브의 동작을 구성하고/하거나 관리하고/하거나 제어하도록 동작가능 할 수 있다. 예를 들어, 사용자 입력 디바이스는 버튼(들), 회전식 인코더(들), 터치 스크린, 모션 추적, 음성 인식, 마우스 디바이스, 키보드, 카메라 및/또는 사용자 지시(들)를 수신할 수 있는 임의의 다른 디바이스를 포함할 수 있다. 소정 실시예들에서, 사용자 입력 디바이스들 중 하나 이상은, 예를 들어, 디스플레이 시스템 또는 초음파 프로브와 같은 다른 컴포넌트들 내에 통합될 수 있다. 일례로서, 사용자 입력 디바이 스는 터치스크린 디스플레이를 포함할 수 있다. 다른 예로서, 사용자 입력 디바이스는 프로브 의 제스처 모션 인식을 제공하기 위해, 예컨대 환자의 신체에 대한 하나 이상의 프로브 압박들, 사전정의된 프 로브 움직임 또는 기울기 동작 등을 식별하기 위해 프로브에 부착되고/되거나 그와 통합되는 가속도계, 자 이로스코프, 및/또는 자력계를 포함할 수 있다. 추가로 그리고/또는 대안으로, 사용자 입력 디바이스는 획득된 이미지 데이터를 분석함으로써 프로브 제스처들을 식별하기 위한 이미지 분석 프로세싱을 포함할 수 있 다. 신호 프로세서는, 디스플레이 시스템 상에서의 제시를 위한 초음파 이미지들을 생성하기 위해 초음파 스캔 데이터(즉, 합산 IQ 신호)를 프로세싱하도록 동작가능할 수 있는 적합한 회로부, 인터페이스들, 로직, 및/ 또는 코드를 포함할 수 있다. 신호 프로세서는 획득된 초음파 스캔 데이터에 대해 복수의 선택가능한 초 음파 양식들에 따라 하나 이상의 프로세싱 동작들을 수행하도록 동작가능하다. 예시적인 실시예에서, 신호 프 로세서는, 그 중에서도, 디스플레이 프로세싱 및/또는 제어 프로세싱을 수행하도록 동작가능할 수 있다. 획득된 초음파 스캔 데이터는 에코 신호들이 수신됨에 따라 스캐닝 세션 동안 실시간으로 프로세싱될 수 있다. 추가로 또는 대안으로, 초음파 스캔 데이터는 스캐닝 세션 동안 RF/IQ 버퍼에 일시적으로 저장될 수 있고, 라이브 또는 오프라인 동작에서 실시간 이내로 프로세싱될 수 있다. 다양한 실시예들에서, 프로세싱된 이미지 데이터는 디스플레이 시스템에서 제시될 수 있고/있거나 아카이브에 저장될 수 있다. 아카이브(27 0)는 로컬 아카이브, PACS(Picture Archiving and Communication System), 또는 이미지들 및 관련 정보를 저장 하기 위한 임의의 적합한 디바이스일 수 있다. 신호 프로세서는 하나 이상의 중앙 프로세싱 유닛들, 마이크로프로세서들, 마이크로제어기들, 및/또는 기 타 등등일 수 있다. 신호 프로세서는, 예를 들어, 집적 컴포넌트일 수 있거나 또는 다양한 위치들에 걸쳐 서 분포될 수 있다. 신호 프로세서는, 그 중에서도, 사용자 입력 디바이스 및/또는 아카이브로 부터 입력 정보를 수신하기 위해, 디스플레이 시스템에 의해 디스플레이가능한 출력을 생성하기 위해, 그 리고 사용자 입력 디바이스로부터의 입력 정보에 응답하여 출력을 조작하기 위해 구성될 수 있다. 신호 프로세서는, 예를 들어, 다양한 실시예들에 따라 본 명세서에서 논의되는 방법(들) 및/또는 명령어들의 세 트(들) 중 임의의 것을 실행할 수 있다. 초음파 시스템은 당해 이미징 상황에 적합한 프레임 레이트로 초음파 스캔 데이터를 연속적으로 획득하도 록 동작가능할 수 있다. 전형적인 프레임 레이트들은 20 내지 220의 범위에 있지만, 더 낮거나 더 높을 수 있 다. 획득된 초음파 스캔 데이터는, 프레임 레이트와 동일하거나 더 느리거나 더 빠를 수 있는 디스플레이 레이트로 디스플레이 시스템 상에 디스플레이될 수 있다. 이미지 버퍼는 즉시 디스플레이되도록 스케줄 링되지 않은 획득된 초음파 스캔 데이터의 프로세싱된 프레임들을 저장하기 위해 포함된다. 바람직하게는, 이 미지 버퍼는 초음파 스캔 데이터의 적어도 수 분의 가치가 있는 프레임들을 저장하기 위한 충분한 용량을 갖는다. 초음파 스캔 데이터의 프레임들은 그의 순서 또는 획득 시간에 따라 그의 검색을 용이하게 하는 방식 으로 저장된다. 이미지 버퍼는 임의의 공지된 데이터 저장 매체로서 구현될 수 있다. 예시적인 실시예에서, 신호 프로세서는, 하기에서 더 상세히 기술되는 바와 같이, 변형량 평가 모듈 을 포함할 수 있으며, 이는 초음파탄성영상에 대한 변형률 계산 및 변형량들의 자동 측정을 지원하여 또는 그들 에 관한 다양한 기능들 또는 동작들을 수행하고/하거나 지원하도록 구성될 수 있는 적합한 회로부, 인터페이스 들, 로직, 및/또는 코드를 포함한다. 일부 구현예들에서, 신호 프로세서(및/또는 그의 컴포넌트들, 예컨대, 변형량 평가 모듈)는 이미징 관련 기능들 또는 동작들을 향상시키고/시키거나 최적화하기 위한 인공 지능 및/또는 기계 학습 기법들을 구현 하고/하거나 사용하도록 구성될 수 있다. 예를 들어, 신호 프로세서(및/또는 그의 컴포넌트들, 예컨대 변 형량 평가 모듈)는, 예컨대 심층 신경망(deep neural network)들(예컨대, 콘볼루션 신경망(convolutional neural network))을 사용하여 딥 러닝(deep learning) 기법들 및/또는 알고리즘들을 구현하고/하거나 사용하도 록 구성될 수 있고/있거나, 인공 지능 이미지 분석 기법들 또는 기계 학습 프로세싱 기능의 임의의 적합한 형태 를 활용할 수 있으며, 이는 획득된 초음파 이미지들을 분석하도록, 예컨대 특정 기준을 충족시키고/시키거나 특 정 특성들을 갖는 구조들(또는 그들의 조직들)을 식별, 세그먼트화, 라벨링, 및 추적하도록 구성될 수 있다. 예시적인 구현예에서, 신호 프로세서(및/또는 그의 컴포넌트들, 예컨대 변형량 평가 모듈)는 심층 신 경망으로서 제공될 수 있으며, 이는, 예를 들어, 입력 층, 출력 층, 및 입력 층과 출력 층 사이의 하나 이상의 은닉 층들로 구성될 수 있다. 층들 각각은 뉴런들로 지칭될 수 있는 복수의 프로세싱 노드들로 구성될 수 있다. 예를 들어, 입력 층은 해부학적 구조의 스캔 평면으로부터의 각각의 픽셀 또는 픽셀들의 그룹에 대한 뉴 런을 가질 수 있다. 출력 층은 복수의 사전정의된 구조들 또는 복수의 타입들의 구조들(또는 그 안의 조직 (들))에 대응하는 뉴런을 가질 수 있다. 각각의 층의 각각의 뉴런은 프로세싱 기능을 수행할 수 있고, 추가 프 로세싱을 위해, 프로세싱된 초음파 이미지 정보를 하류 층의 복수의 뉴런들 중 하나로 전달할 수 있다. 일례로 서, 제1 층의 뉴런들은 초음파 이미지 데이터에서의 구조의 에지들을 인식하는 것을 학습할 수 있다. 제2 층의 뉴런들은 제1 층으로부터의 검출된 에지들에 기초하여 형상들을 인식하는 것을 학습할 수 있다. 제3 층의 뉴런 들은 초음파 이미지 데이터 내의 랜드마크들에 대해 인식된 형상들의 위치들을 학습할 수 있다. 제4 층의 뉴런 들은 특정 구조들 등에 존재하는 특정 조직 타입들의 특성들을 학습할 수 있다. 따라서, 심층 신경망(예컨대, 콘볼루션 신경망)에 의해 수행되는 프로세싱은 높은 정도의 확률로 초음파 이미지 데이터에서 생물학적 및/또는 인공 구조들을 식별하는 것을 허용할 수 있다. 일부 구현예들에서, 신호 프로세서(및/또는 그의 컴포넌트들, 예컨대, 변형량 평가 모듈)는 사용자 입력 디바이스를 통한 사용자 명령어에 기초하여 그에 의해 수행되는 기능들 중 적어도 일부를 수행하거나 달리 제어하도록 구성될 수 있다. 일례로서, 사용자는, 하기에서 더 상세히 기술되는 바와 같이, 특정 명령어 를 발행하기 위해, 예컨대 변형률 계산 및 변형량들의 자동 측정의 다양한 태양들을 제어하고/하거나 그에 관한 다양한 파라미터들 또는 설정들을 제공하거나 달리 특정하기 위해 음성 명령, 프로브 제스처, 버튼 누름 등을 제공할 수 있다. 트레이닝 엔진은 신호 프로세서(및/또는 그의 컴포넌트들, 예컨대 변형량 평가 모듈)의 심층 신 경망(들)의 뉴런들을 트레이닝하도록 동작가능할 수 있는 적합한 회로부, 인터페이스들, 로직, 및/또는 코드를 포함할 수 있다. 예를 들어, 신호 프로세서는 초음파 스캔 평면 내에 제공된 특정 구조물들 및/또는 조직 들(또는 이들의 타입들)을 식별하도록 트레이닝될 수 있고, 이때 트레이닝 엔진은 다양한 구조들의 분류된 초음파 이미지들의 데이터베이스(들)를 사용하는 것과 같은, 필수 기능들 중 일부를 수행하도록 그의 심층 신경 망(들)을 트레이닝한다. 일례로서, 트레이닝 엔진은, 특정 구조(들)의 특성들, 예컨대 구조 에지들의 외관, 에지들에 기초한 구조 형상들의 외관, 초음파 이미지 데이터 내의 랜드마크들에 대한 형상들의 위치들 등에 대해, 그리고/또는 특정 조직들의 특성들(예컨대, 그의 연성)에 대해, 특정 구조들의 초음파 이미지들을 활용하여 신호 프로세서 (및/또는 그의 컴포넌트들, 예컨대 변형량 평가 모듈)를 트레이닝하도록 구성될 수 있다. 다양한 실시예 들에서, 트레이닝 이미지들의 데이터베이스들은 아카이브 또는 임의의 적합한 데이터 저장 매체에 저장될 수 있다. 소정 실시예들에서, 트레이닝 엔진 및/또는 트레이닝 이미지 데이터베이스들은 유선 또는 무선접속을 통해 초음파 시스템에 대한 통신가능하게 커플링된 외부 시스템(들)일 수 있다. 동작 시, 초음파 시스템은 2차원(2D), 3차원(3D), 및/또는 4차원(4D) 이미지들을 포함하는 초음파 이미지 들을 생성하는 데 사용될 수 있다. 이와 관련하여, 초음파 시스템은 해당 이미징 상황에 적합할 수 있는 특정 프레임 레이트로 초음파 스캔 데이터를 연속적으로 획득하도록 동작가능할 수 있다. 예를 들어, 프레임 레이트들은 20 내지 70의 범위에 있을 수 있지만, 더 낮거나 더 높을 수 있다. 획득된 초음파 스캔 데이터는, 프레임 레이트와 동일하거나 더 느리거나 더 빠를 수 있는 디스플레이 레이트로 디스플레이 시스템 상에 디스플레이될 수 있다. 즉시 디스플레이되도록 스케줄링되지 않은 획득된 초음파 스캔 데이터의 프로세싱된 프 레임들을 저장하기 위한 이미지 버퍼가 포함된다. 바람직하게는, 이미지 버퍼는 초음파 스캔 데이터 의 적어도 수 초의 가치가 있는 프레임들을 저장하기 위한 충분한 용량을 갖는다. 초음파 스캔 데이터의 프레 임들은 그의 순서 또는 획득 시간에 따라 그의 검색을 용이하게 하는 방식으로 저장된다. 이미지 버퍼는 임의의 공지된 데이터 저장 매체로서 구현될 수 있다. 일부 경우들에서, 초음파 시스템은 그레이스케일 및 컬러 기반 동작들을 지원하도록 구성될 수 있다. 예 를 들어, 신호 프로세서는 그레이스케일 B-모드 프로세싱 및/또는 컬러 프로세싱을 수행하도록 동작가능할 수 있다. 그레이스케일 B-모드 프로세싱은 B-모드 RF 신호 데이터 또는 IQ 데이터 쌍들을 처리하는 것을 포함 할 수 있다. 예를 들어, 그레이스케일 B-모드 프로세싱은 (I2+Q2)1/2의 양을 계산함으로써 빔 합산 수신 신호의 포락선(envelope)을 형성하는 것을 가능하게 할 수 있다. 포락선은 디스플레이 데이터를 형성하기 위한 대수 압축(logarithmic compression)과 같은 추가의 B-모드 프로세싱을 겪을 수 있다. 디스플레이 데이터는 비디오 디스플레이를 위해 X-Y 포맷으로 변환될 수 있다. 스캔 변환된 프레임들은 디스플레이를 위해 그레이스케일로 맵핑될 수 있다. B-모드 프레임들은 이미지 버퍼 및/또는 디스플레이 시스템에 제공된다. 컬러 프 로세싱은 컬러 기반 RF 신호 데이터 또는 IQ 데이터 쌍들을 프로세싱하여, 이미지 버퍼 및/또는 디스플레 이 시스템에 제공되는 B-모드 프레임들 상에 오버레이하는 프레임들을 형성하는 것을 포함할 수 있다. 그 레이스케일 및/또는 컬러 프로세싱은 사용자 입력 - 예컨대, 예를 들어 특정 영역의 그레이스케일 및/또는 컬러 의 향상을 위한, 사용자 입력 디바이스로부터의 선택 - 에 기초하여 적응적으로 조정될 수 있다. 일부 경우들에서, 초음파 이미징은 볼류메트릭 초음파 이미지들의 생성 및/또는 디스플레이를 포함할 수 있다 - 즉, 여기서, 객체들(예컨대, 장기들, 조직들 등)이 3차원(3D)으로 디스플레이됨. 이와 관련하여, 3D(및 유사하 게 4D) 이미징에 의해, 이미징된 대상들에 대응하는 복셀들을 포함하는, 볼류메트릭 초음파 데이터세트들이 획 득될 수 있다. 이는, 예컨대 단순히 음파들을 하나의 방향(예컨대, 직선 하향)으로 송신하기보다는, 상이한 각 도들로 음파들을 송신함으로써 행해질 수 있고, 이어서, 그들의 반사들을 다시 캡처할 수 있다. 이어서, (상이 한 각도들에서의 송신들의) 복귀하는 에코들이 캡처되고, (예컨대, 신호 프로세서를 통해) 프로세싱되어, 대응하는 볼류메트릭 데이터세트들을 생성하며, 이는 다음에, 예컨대 디스플레이를 통해, 볼륨(예컨대, 3D) 이미지들을 생성하고/하거나 디스플레이하는 데 사용될 수 있다. 이는, 원하는 3D 인지(perception)를 제 공하기 위해 특정 취급 기법들의 이용을 수반할 수 있다. 예를 들어, 볼륨 렌더링 기법들은 볼류메트릭(예컨대, 3D) 데이터세트들의 투영들(예컨대, 2D 투영들)을 디스플 레이하는 데 사용될 수 있다. 이와 관련하여, 3D 데이터세트의 2D 투영을 렌더링하는 것은 디스플레이되고 있 는 대상에 대해 공간 내의 인지각(perception angle)을 설정 또는 정의하는 것, 및 이어서 데이터세트 내의 모 든 복셀에 대한 필요한 정보(예컨대, 불투명도 및 컬러)를 정의하거나 계산하는 것을 포함할 수 있다. 이는, 예를 들어 모든 복셀에 대해 RGBA(적색, 녹색, 청색 및 알파) 값을 정의하기 위한 적합한 전달 함수들을 사용하 여 행해질 수 있다. 다양한 구현예들에서, 초음파 시스템은 탄성초음파영상에 대한 변형률 계산 및 변형량들의 자동 측정을 지 원하도록 구성될 수 있다. 이와 관련하여, 상기에 언급된 바와 같이, 탄성영상(예컨대, 탄성초음파영상)은 자 궁경부의 연화, 즉 심각한 건강 위험들(예컨대, 조기 분만)을 제기하는 상태에 대해 임산부를 검사하는 데 사용 될 수 있다. 예를 들어, 자궁경부의 변형량 탄성영상(예컨대, 질내 검사의 형태로 적용됨)은 자궁경부가 경질 이고 명백한지의 여부, 또는 연화가 시작되거나 이미 발생한 경우를 보여줄 수 있다. 그러나, 자궁경부의 연화 가 제기하는 심각한 위험들 때문에, 그러한 검사들을 실시하는 임상의들은 과잉 진단하는 경향이 있을 수 있다. 이것은, 전형적으로는 디스플레이된 이미지들의 시각적 검사에 기초하여 임상의들에 의해 검사가 수행되는 것이 된다는 사실에 의해 추가로 악화되는데, 이는 자궁경부의 연화가 잘못 의심되고 환자가 추가 검사를 위해 불필 요하게 문의를 받는 경우들을 상당수 초래할 수 있다. 상기에서 언급된 바와 같이, 변형량 탄성영상은, 또한, (예컨대, 유도 분만, 유방 검사(병변들에 대한 진단), 소정의 소형 장기들 또는 신체 구조들의 검사(갑상선 및고환 변병들의 이미징), 전립선 검사(병변들에 대한 초음파 이미징) 등을 위한 약물에 대한 반응을 검증하는) 다른 응용들에서 사용될 수 있다. 자궁경부의 변형량 탄성영상에 대하여 언급된 것들과 유사한 이슈들이 또한 이들 다른 응용들에서 실질적으로 유사한 방식- 즉, 디스플레이된 이미지들의 시각적 검사에 기초한, 임상의들 에 의한 과잉 진단 - 으로 발생할 수 있다. 이러한 진단 관련 문제들 중 일부를 해결하고자 시도하기 위해 몇몇 솔루션들이 제안되었다. 예를 들어, 임상 연구들은 전술된 탄성영상 응용들 중 다수에 대해 행해졌으며, 이들 연구들 중 다수에서는, 변형률에 대한 컷오 프 값(cut-off value)들이 - 즉, 어느 변형률들이 이슈들을 나타낼 수 있는지를 정의하기 위해 - 제안된다. 그 럼에도 불구하고, 그러한 솔루션들은 오진 또는 과잉 진단이 발생할 수 있는 경우들에 있어서 주된 기여 인자들 - 즉, 종래의 솔루션들의 사용자 의존성 - 을 해결하지 않는다. 본 발명에 따른 솔루션들은, 검사의 작업 흐름을 단순화하고, 사용자 의존성을 감소시키고, 검사 동안 이미지들 의 스크리닝을 신속 처리함으로써, 이들 이슈들을 해결한다. 이는 특히 인공 지능(AI) 기법들을 사용하여 변형 량을 측정하고/하거나 변형률들을 계산하기 위한 자동 또는 반자동 접근법을 통합함으로써 변형량 탄성영상의 신뢰성 및 정확도를 향상시킬 수 있다. 이들 솔루션들은 상기에 언급된 변형량 탄성영상 응용들 중 임의의 것 에 적용될 수 있다. 다양한 구현예들에서, 의료 이미징 시스템들(예컨대, 시스템 초음파 시스템)은 이미징 동작들 동안 변형량 및/또는 변형률 계산들을 자동으로 측정하도록 구성될 수 있다. 이와 관련하여, 이미징된 영역에서의 변형량 특성들의 변동들을 반영하는 이미지들을 단순히 디스플레이하는 것이 아니라, 의료 이미징 시스템들은 (예컨대, 특정 부분들에서의) 변형량을 측정하도록, 그리고 사용자(예컨대, 임상의)에게 변형량 관련 피드백을 제공하여, 검사 결과들에 대해 불명료성 또는 불확실성을 감소시키도록 구성될 수 있다. 예를 들어, 일부 구현예들에서, 의료 이미징 시스템들(예컨대, 시스템 초음파 시스템)은 사용자가 특정 영역을 (예컨대, 단일 관심 영역 (ROI) 박스를 그 영역 위에 배치시킴으로써) 특정하게 하도록, 그리고 그 특정 영역의 자동 변형량 관련 측정 (및/또는 그에 기초한 평가)을 제공하도록 구성될 수 있다. 그러한 접근법은 검사된 조직(또는 관련 구조/장기)의 상태에 관한 임상적 결정에 이르는 빠르고 간단한 방법을 제공하며, 따라서, 취해질 다음 액션들 에 관한 더 양호한 결정들을 행한다. 자궁경부 연화 관련 용례들에 있어서, 예를 들어, 사용자는 자궁경관 영역 위에 단일 ROI 박스를 배치하기만 하 면 되며, 이어서, 시스템은 자궁경관 영역의 자동 연성 평가를 수행할 수 있다 - 예컨대, 변형량의 측정을 자동 으로 수행하고/하거나, 측정된 변형량들에 기초하여 가장 경질의 영역뿐만 아니라 가장 연질의 영역을 자동으로 결정하고/하거나, 비율 측정들을 자동으로 수행함 -. 일부 경우들에서, 사전정의된 데이터가 그러한 자동 기능 들 동안 사용될 수 있다. 예를 들어, 변형량 측정 및/또는 변형률 계산은 (예컨대, 임상 연구들 등으로부터 획 득된) 사전프로그래밍된 컷오프 값들에 기초하여 수행될 수 있다. 일부 경우들에서, 이들 값들은 조작자들이 (필요한 경우) 이들 값들 중 임의의 것을 조정하게 하도록 구성가능할 수 있다. 일부 구현예에서, 시스템은 사용자가 스캔의 다양한 태양들 또는 특성들을 제어할 수 있도록 구성될 수 있다. 예를 들어, ROI 박스에 대해, ROI 박스의 배치(즉, 그를 어디에 배치할 것인지)를 제어하는 것에 더하여, 사용 자는 (예컨대, 스크린/디스플레이 상에서, 특정 방향으로 박스를 확장시키거나 축소시키도록 그의 에지들을 이 동시킴으로써, ROI 박스의 크기에 대한 최소 및/또는 최대 한도들을 설정함으로써, 등등으로) ROI 박스의 크기 를 제어하거나 조정할 수 있다. 그러한 구현예들에서, 사용자가 ROI 박스의 크기를 설정하거나 조정하지 않는 경우, 시스템은 사전정의된 디폴트 크기를 사용하도록 구성될 수 있다. 측정들/계산들 및 그에 기초한 평가들은 시스템 내의 적합한 프로세싱 리소스들을 통해 이미징 관련 프로세싱의 일부로서 수행될 수 있다. 예를 들어, 초음파 시스템에서, 신호 프로세서(및/또는 그의 컴포넌트들, 예컨대 변형량 평가 모듈)는 수신된 에코들, 및 그에 기초한 신호들 및/또는 데이터를 프로세싱하는 과정 에 변형률 계산 및 변형량들의 자동 측정을 수행하도록 구성될 수 있다. 이와 관련하여, 다양한 구현예들에서, (예컨대, 전술된 바와 같이, 딥 러닝 네트워크들을 사용하는) 인공 지능(AI) 기술들 및/또는 알고리즘들은 변형 률 계산 및 변형량들의 자동 측정, 및 그에 기초한 평가들을 수행하고 연속으로 향상시키는 데 사용될 수 있다. 예시적인 사용 시나리오들이 도 3 및 도 4와 관련하여 기술된다. 예시적인 사용 시나리오에서, 변형량 탄성영상 동안, 검사된 신체 부위 또는 영역(예컨대, 자궁경부 및 주변 영 역) 내의 조직은 초음파 프로브를 사용하여 (예컨대, 자궁경부의 변형량 탄성영상의 경우에 질내 검사를 위한 특수 프로브 또는 프로브 부착을 사용하여) 수동으로 압축/압축해제될 수 있다. 압축/압축해제는 프로브 아래 의 조직에 변형량을 생성한다. 시스템은, 예컨대 압축된 조직 대 압축되지 않은 조직의 신호들의 스펙클 상관(speckle correlation)에 기초한 계산에 기초하여 자동으로 측정될 수 있다. 이와 관련하여, 측정된 변형량 값 들은 사전정의된 범위 - 예컨대, 0 내지 2% - 에 기초하여 할당될 수 있으며, 이때 0%는 변형량이 없음(즉, 탄 성 없음 및 조직 변형 없음, 따라서, 조직이 매우 경질임을 나타냄)을 나타내고, 2%는 매우 연질의 조직(예컨대, 조직이 매우 탄성이 있고 변형하기에 용이함)을 나타낸다. 측정된 변형량 값들은 다른 변형량 관련 결정 및/또는 그에 기초한 평가들을 행하기 위한 시스템에 의해 사용될 수 있다. 예를 들어, 시스템은 측정된 변형량 값들에 기초하여 평균 변형량 값 및/또는 변형률을 자동으로 계 산할 수 있다. 일부 경우들에서, 측정된 변형량 값들은 이미지들의 디스플레이를 조정하거나 달리 제어하는 데 사용될 수 있다. 예를 들어, 상이한 컬러들(및 그의 색조들)은 연조직 및/또는 경조직 영역들을 나타내는 데 사용될 수 있다 - 예컨대, 비제한적인 구현예에서, (더 연질인) 더 높은 변형량 값들을 갖는 조직 영역들은 (증 가하는 컬러 포화도를 갖는) 적색으로 착색될 수 있고, (더 경질인) 더 낮은 변형량 값들을 갖는 조직 영역들은 (증가하는 컬러 포화도를 갖는) 청색으로 착색된다. 시스템은, 또한, 측정된 변형량 값들, 및/또는 그에 기초 한 결정들 및/또는 평가들에 관한 피드백을 제공하도록 구성될 수 있다. 예를 들어, 변형량 관련 피드백은 시 각적일 수 있고, 디스플레이된 이미지들과 함께(예컨대, 그에 통합됨) 디스플레이될 수 있다. 일부 경우들에서, 피드백은 검사의 결과를 나타내거나 제안하도록 구성될 수 있다. 예를 들어, 시각적 피드백 이 제공되는 방식(예컨대, 그의 컬러)은 변형량 관련 측정들 또는 계산들에 기초하여 임의의 이슈들이 검출되거 나 의심되는 경우를 나타내도록 조정될 수 있다. 자궁경부 변형량 탄성영상과 관련하여 이들 특징들을 예시하 는 예시적인 용례들이 도 3 및 도 4와 관련하여 도시되고 기술된다. 상기에 언급된 바와 같이, 다양한 구현예들에서, 본 발명에 따른 변형량 탄성영상 관련 동작들 동안 수행되는 다양한 액션들 또는 기능들이 인공 지능(AI)을 사용하여 행해질 수 있다. 시스템 내의 인공 지능(AI) 관련 리 소스들을 사용하여 프로세싱되고/되거나 수행될 수 있는 예시적인 액션들은 하기를 포함할 수 있다: (예컨대, 선택된 측정 ROI 박스 내에서) 모든 변형량 값들의 분석; 평균 변형량 값들 및 그들의 위치의 식별; 상위 백분 위수 변형량 최대치들 및 그들의 위치의 식별; 하위 백분위수 변형량 최소치들 및 그들의 위치의 식별; 평균 영 역들의 배제; 경질 대 연질의 변형률의 계산; 경질, 연질, 및 비율 값들의 디스플레이; 등등. 도 3은 탄성초음파영상에 대한 변형률 계산 및 변형량들의 자동 측정을 지원하기 위해 구성된 예시적인 의료 이 미징 시스템에서 생성되는 예시적인 이미지를 도시한다. 도 3에는, 의료 이미징 시스템(예컨대, 도 2의 초음파 시스템)에서 생성된 이미지(예컨대, 초음파 이미지)의 스크린샷이 도시되어 있다. 초음파 이미지는 도 2의 초음파 시스템과 같은, 본 발명에 따라 구현된 시스템에서 생성되고 디스플 레이되는 자궁경부 및 주변 영역의 초음파 이미지들 중 하나에 대응할 수 있다. 특히, 초음파 이미지는 (그의 연화를 체크하기 위해) 자궁경부의 변형량 초음파 탄성영상을 이행하는 과정에 초음파 이미지의 예 시적인 사용 시나리오 동안 제공될 수 있는 예시적인 실시간 시각적 피드백을 예시한다. 이와 관련하여, 전술된 바와 같이, 변형량 탄성영상 동안, 검사되고 있는 영역은 초음파 프로브를 사용하여 수 동으로 압축/압축해제될 수 있다. 자궁경부의 변형량 탄성영상의 경우에, 이는 그러한 검사를 위해 구성된 초 음파 프로브를 사용하여 질내 검사로서 수행된다. 압축/압축해제는 프로브 아래에 있는, 자궁경부 및 주변 영 역의 조직들의 변형량을 생성한다. 변형량 값들은 (예컨대, 도 2에 대해 전술된 바와 같이, 스펙클 기반 계산 에 기초하여) 시스템에 의해 자동으로 측정될 수 있고, 평균 변형량 값은 또한 시스템에 의해 계산될 수 있다. 시스템은, 또한, 변형량 측정들에 기초하여 검사의 결과를 자동으로 평가할 수 있다. 예를 들어, 평가는 경조 직 대 연조직의 변형률의 결정에 기초할 수 있다. 이와 관련하여, 계산된 변형률을 평가하는 것은 사전정의된 기준들 및/또는 파라미터들 - 예컨대, 조직의 연성(또는 경성)이 특정 한도들을 언제 충족시키는지를 결정하여 연조직(또는 경조직)으로 간주되도록 하기 위해, 예컨대 측정된 변형량에 기초한 최대(또는 최소) 임계치들 - 에 기초할 수 있다. 평가는 이미지들 내의 특정 영역으로 제한될 수 있는데, 이는 사용자(임상의)에 의해 특정 될 수 있다. 예를 들어, 도 3에 도시된 바와 같이, 사용자는 (예컨대, 적합한 사용자 제어부들을 사용하여) 사 용자 선택 ROI 박스의 사용에 의해 스크린 상의 평가될 영역을 선택할 수 있다. 자궁경부의 변형량 탄성 영상과 관련하여, 임상의는 자궁경관 및 주변 조직에 대응하는 그리고/또는 그들을 포함하는 영역을 선택할 수 있다. 이어서, 시스템은 변형량 측정들 및/또는 그에 기초한 평가에 관련된 피드백을 제공할 수 있다. 이는, 예컨대, 디스플레이된 이미지들 내에 변형량 관련 피드백을 통합시킴으로써, 시각적으로 행해질 수 있다. 예를 들어, 초음파 이미지들(또는 이들에 대응하는 데이터)에 기초하여 변형량 값들을 측정한 후, 시스템은 평균 변형량 값들에 대응하는 또는 이들을 갖는 영역들(예컨대, 녹색)의 위치를 식별할 수 있고, 상위 백분위수 변형량 최대치 (예컨대, 연조직)에 대응하는 영역들(예컨대 적색)의 위치를 식별할 수 있고, 하위 백분위수 변형량 최소치(예 컨대, 경조직)에 대응하는 영역들(예컨대, 청색)의 위치를 식별할 수 있다. 이어서, 시스템은 변형률 계산들을 수행할 수 있다. 이와 관련하여, 시스템은 평균 영역들(녹색)을 배제할 수 있고, 경질(청색) 대 연질(적색)의 변형률을 계산할 수 있고, 이어서, 식별된 경조직, 연조직, 및 계산된 비율 값들에 관한 피드백(예컨대, 디스플 레이)을 제공할 수 있다. 이와 관련하여, 일부 구현예에서, 피드백이 (예컨대, 시각적으로) 제공되는 방식은, 예컨대 사전결정된 기준에 기초하여, 평가의 결과를 나타내도록 구성될 수 있다. 예를 들어, 사전정의된 컷오 프 값들에 기초하여, 각각의 특정 응용에 대해, 비율에 관한 피드백이 제공되는 방식(비율을 디스플레이하는 데 컬러가 사용됨)이 적응적으로 조정될 수 있다. 예를 들어, 도 3에 도시된 바와 같이, (더 연질인) 더 높은 변형량 값들을 갖는 조직은 (증가하는 컬러 포화도 를 갖는) 적색으로 착색되고; 반면에, (더 경질인) 더 낮은 변형량 값들을 갖는 조직은 (증가하는 컬러 포화도 를 갖는) 청색으로 착색된다. 사용자 선택 ROI 박스 내의 연조직 대 경조직의 비율이 계산되고 디스플레 이된다. 이와 관련하여, 계산된 비율이 디스플레이되는 방식은 자궁경부 변형량 평가에 대한 사전정의된 컷오 프 값들에 기초하여, 평가의 결과를 나타내도록 구성될 수 있다. 예를 들어, 비율을 디스플레이하는 데 사용되 는 컬러는, 적용가능한 컷오프 값(들)에 기초하여, 비율이, 자궁경부의 연화가 발생했거나 발생하고 있는 경우 를 시사하는지의 여부를 나타내도록 구성될 수 있다 - 예컨대, 비율이 사전정의된 허용가능한 한도들 내에 있을 때 녹색이고, 비율이 그렇지 않은 경우에는 적색임 -. 도 3에 도시된 예시적인 용례에서, 예를 들어, 비율은 1이고(이는 ROI 박스 내의 연조직 및 경조직의 각각 이 약 0.17%로 동일하기 때문임), 이는 허용가능한 한도들 내에 있을 수 있다. 따라서, 단어 \"비율\" 및 계산된 비율 값(\"1\")은 녹색으로 디스플레이된다. 도 4는 탄성초음파영상에 대한 변형률 계산 및 변형량들의 자동 측정을 지원하기 위해 구성된 예시적인 의료 이 미징 시스템에서 생성되는 예시적인 이미지를 도시한다. 도 4에는, 의료 이미징 시스템(예컨대, 도 2의 초음파 시스템)에서 생성된 이미지(예컨대, 초음파 이미지)의 스크린샷이 도시되어 있다. 이미지는 도 3과 관련하여 기술된 바와 같은 이미지와 동일한 방식으로 생성될 수 있다- 즉, 본 발명 에 따라 구현되는 시스템(예컨대, 도 2의 초음파 시스템)을 사용하여 자궁경부의 변형량 탄성영상의 과정 에, 시스템은, 특히 자궁경부의 연화에 대해, 자동 변형량 관련 측정들 및 계산들, 및 이들에 기초한 평가들을 행하도록 구성됨 -. 그러나, 도 4에 도시된 예시적인 용례에서, 비율(경조직 대 연조직)은 0.46%가 되도록 계 산되는데, 이는 사용자 선택 ROI 박스(예컨대, 자궁경관 및 주변 영역을 포함함) 내의 연조직이, 자동 변 형량 측정 및 적용가능한 연성 기준에 기초하여 시스템 내에서 결정된 바와 같이, ROI 박스 내에 봉입된 영역의 0.39%를 구성하는 반면, ROI 박스 내의 경조직이, 자동 변형량 측정 및 적용가능한 경성 기준에 기 초하여 시스템에서 결정된 바와 같이, 0.18%를 구성하기 때문이다. 0.46%의 비율이 허용가능한 한도들을 초과할 수 있기 때문에, 피드백은 도 3에 예시된 예시적인 사용 시나리오 에서와는 상이하게 제공될 수 있다. 따라서, 도 4에 도시된 바와 같이, 단어 \"비율\" 및 계산된 비율 값 (\"0.46%\")은 녹색으로 디스플레이된다. 도 5는 탄성초음파영상에 대한 변형률 계산 및 변형량들의 자동 측정에 의해 초음파 이미징을 위해 수행될 수 있는 예시적인 단계들의 흐름도를 도시한다. 도 5에는, 변형률 계산 및 변형량들의 자동 측정과 함께 탄성영상을 수행하기 위한 적합한 의료 이미징 시스템 (예컨대, 도 2의 초음파 시스템)에서 수행될 수 있는 복수의 예시적인 단계들(블록들(502 내지 514)로 표 현됨)을 포함하는 흐름도가 도시되어 있다. 시작 단계에서, 시스템은 셋업될 수 있고, 동작들이 개시될 수 있다. 단계에서, 이미징 신호들이 탄성영상 검사(예컨대, 자궁경부 탄성영상) 동안 획득될 수 있다. 예를 들어, 초음파 이미징 시스템에서, 이것은 초음파 신호들을 송신하는 것, 및 신호들의 대응하는 에코들을 수신하는 것 을 포함할 수 있다. 단계에서, 이미징 신호들(예컨대, 초음파 신호들의 수신된 에코들)은 대응하는 의료 이미지들(예컨대, 초 음파 이미지들)을 생성하는 데 사용하기 위한 대응하는 데이터세트들을 생성하도록 프로세싱될 수 있다. 단계에서, 선택된 관심 영역(ROI) 박스 내의 변형량 값들이 결정될 수 있다. 이와 관련하여, ROI 박스는, 예컨대 시스템의 디스플레이 유닛과의 상호작용을 통해, 사용자-선택될 수 있다. 변형량 값들은, 전술된 바와 같이, 예를 들어, 압축된 조직 대 압축되지 않은 조직의 신호들의 스펙클 상관관계에 기초한 계산들에 기초하여 결정될 수 있다. 단계에서, 변형량 값들은, 예컨대 적용가능한 기준들에 기초하여, 시스템에서 구현되는 AI-알고리즘들을 사용하여 프로세싱될 수 있다. 예를 들어, 변형량 값들을 프로세싱하는 단계는 (예컨대, 사전설정된 컷오프 값 들에 기초하여) 낮은 값, 평균값 및 높은 값, 및 ROI 박스 내의 대응하는 부분들을 결정하는 단계를 포함할 수 있다. 이는, 예를 들어 연질이거나, 경질이거나, 또는 그 사이에 있는 것으로 평가될 수 있는 조직을 식별할 수 있다. 단계에서, 탄성영상 검사(예컨대, 자궁경부의 연화)의 결과가 변형량 값들 및 관련 프로세싱에 기초하여 평가될 수 있다. 예를 들어, 자궁경부 검사와 관련하여, 자궁경부의 연화는 ROI 박스 내의 경조직 대 연조직의 비율에 기초하여 평가될 수 있다. 단계에서, 변형량 값들, 관련 계산들, 및/또는 검사의 결과에 관한 실시간 피드백이 사용자에게 제공될 수 있다. 예를 들어, 이는 탄성영상 검사의 결과의 변형량 값들(또는 관련 정보) 및 표시자(들)를 디스플레이하는 단계를 포함할 수 있다. 본 발명에 따른, 변형률 계산 및 변형량들의 자동 측정과 함께 탄성영상 기반 검사를 위한 예시적인 방법은, 적 어도 하나의 프로세서에 의해, 환자의 탄성영상 검사 동안 획득된 이미징 데이터를 프로세싱하는 단계 - 이때 이미징 데이터는 특정 의료 이미징 기법에 대응함 -; 적어도 하나의 프로세서에 의해, 이미징 데이터의 프로세 싱에 기초하여, 대응하는 하나 이상의 의료 이미지들을 생성하는 단계; 하나 이상의 의료 이미지들 내의 관심 영역(ROI)에 대응하는 변형량 값들을 계산하고, 계산된 변형량 값들을 프로세싱하는 단계 - 이때, 프로세싱하는 단계는, 탄성영상 검사에 기초하여, 계산된 변형량 값들에 대응하는 복수의 범위들을 결정하는 단계, 복수의 범 위들 각각에 대응하는 관심 영역(ROI)의 부분들을 식별하는 단계, 및 계산된 변형량 값들, 복수의 범위들, 및 관심 영역(ROI)의 부분들 중 하나 이상에 기초하여 탄성영상 검사의 결과를 평가하는 단계를 포함함 -; 및 계산 된 변형량 값들의 프로세싱에 기초하여, 변형량 관련 피드백을 제공하는 단계를 포함한다. 예시적인 구현예에서, 본 방법은, 하나 이상의 인공 지능 기반 알고리즘들을 사용하여 적어도 하나의 프로세서 를 통해 계산된 변형량 값들을 자동으로 프로세싱하는 단계를 추가로 포함한다. 예시적인 구현예에서, 본 방법은, 탄성영상 검사의 타입에 기초하여 계산된 변형량 값들을 프로세싱하는 단계를 추가로 포함한다. 탄성영상 검사의 타입은 자궁경부 탄성영상, 전립선 탄성영상, 유방 탄성영상, 및 갑상선 탄 성영상 중 하나를 포함할 수 있다. 예시적인 구현예에서, 본 방법은, 하나 이상의 사전설정된 컷오프 값들에 기초하여 복수의 범위들을 결정하는 단계를 추가로 포함한다. 예시적인 구현예에서, 본 방법은, 탄성영상 검사의 타입에 기초하여 하나 이상의 사전설정된 컷오프 값들을 결 정하는 단계를 추가로 포함한다. 예시적인 구현예에서, 복수의 범위들은 적어도 낮은 범위, 높은 범위, 및 평균 범위를 포함하고, 변형량 관련 피드백을 제공하는 단계는 하나 이상의 의료 이미지들 중 적어도 하나의 디스플레이된 의료 이미지에서의 적어 도 높은 범위 및 낮은 범위에 대한 변형량 값들을 디스플레이하는 단계를 포함한다. 예시적인 구현예에서, 탄성영상 검사의 결과를 평가하는 단계는 높은 범위와 낮은 범위 사이의 비율을 계산하는 단계를 포함한다. 예시적인 구현예에서, 변형량 관련 피드백을 제공하는 단계는 탄성영상 검사의 결과에 관한 피드백을 제공하는 단계를 포함한다. 예시적인 구현예에서, 탄성영상 검사의 결과에 관한 피드백을 제공하는 단계는 하나 이상의 의료 이미지들 중 적어도 하나의 디스플레이된 의료 이미지에서 탄성영상 검사의 결과의 표시자를 디스플레이하는 단계를 포함한 다. 예시적인 구현예에서, 탄성영상 검사가 자궁경부 탄성영상을 포함하는 경우, 탄성영상 검사의 결과는 환자의 자 궁경부의 연화를 포함한다. 예시적인 구현예에서, 변형량 관련 피드백을 제공하는 단계는 자궁경부의 연화가 발생했거나 발생하고 있다는 결정에 기초하여 조기 분만에 대한 위험을 나타내는 피드백을 제공하는 단계를 포함한다. 예시적인 구현예에서, 의료 이미징 기법은 초음파 이미징을 포함하고, 의료 이미지들은 수신된 에코 초음파 신 호들에 기초하여 생성되는 초음파 이미지들을 포함한다. 본 발명에 따른, 변형률 계산 및 변형량들의 자동 측정과 함께 탄성영상 기반 검사를 위한 예시적인 시스템은, 환자의 탄성영상 검사 동안 이미징 신호들을 획득하도록 구성된 스캐닝 디바이스 - 이때 이미징 데이터는 특정 의료 이미징 기법에 대응함 -; 이미지들을 디스플레이하도록 구성된 디스플레이 디바이스; 및 적어도 하나의 프로세서를 포함하고, 적어도 하나의 프로세서는, 스캐너 디바이스를 통해 획득된 이미징 데이터 를 프로세싱하도록; 이미징 데이터의 프로세싱에 기초하여, 대응하는 하나 이상의 의료 이미지들을 생성하도록; 디스플레이 디바이스를 통해, 하나 이상의 의료 이미지들을 디스플레이하도록; 하나 이상의 인공 지능 기반 알 고리즘들을 사용하여, 자동으로, 하나 이상의 의료 이미지들 중 적어도 하나의 의료 이미지 내의 관심 영역 (ROI)에 대응하는 변형량 값들을 계산하도록; 그리고 계산된 변형량 값들을 프로세싱하도록 - 프로세싱하는 것 은, 탄성영상 검사에 기초하여, 계산된 변형량 값들에 대응하는 복수의 범위들을 결정하는 것; 복수의 범위들 각각에 대응하는 관심 영역(ROI)의 부분들을 식별하는 것; 및 계산된 변형량 값들, 복수의 범위들, 및 관심 영 역(ROI)의 부분들 중 하나 이상에 기초하여 탄성영상 검사의 결과를 평가하는 것을 포함함 -; 그리고 계산된 변 형량 값들의 프로세싱에 기초하여, 변형량 관련 피드백을 제공하도록 구성된다. 예시적인 구현예에서, 적어도 하나의 프로세서는 탄성영상 검사의 타입에 기초하여 계산된 변형량 값들을 프로 세싱하도록 추가로 구성된다. 예시적인 구현예에서, 적어도 하나의 프로세서는 하나 이상의 사전설정된 컷오프 값들에 기초하여 복수의 범위 들을 결정하도록 추가로 구성된다. 예시적인 구현예에서, 적어도 하나의 프로세서는, 탄성영상 검사의 타입에 기초하여 하나 이상의 사전설정된 컷 오프 값들을 결정하도록 추가로 구성된다. 예시적인 구현예에서, 복수의 범위들은 적어도 낮은 범위, 높은 범위, 및 평균 범위를 포함하고, 적어도 하나의 프로세서는, 변형량 관련 피드백을 제공할 때, 디스플레이 디바이스를 통해, 하나 이상의 의료 이미지들 중 적 어도 하나의 디스플레이된 의료 이미지에서의 적어도 높은 범위 및 낮은 범위에 대한 변형량 값들을 디스플레이 하도록 추가로 구성된다. 예시적인 구현에서, 적어도 하나의 프로세서는, 탄성영상 검사의 결과를 평가할 때, 높은 범위와 낮은 범위 사 이의 비율을 계산하도록 추가로 구성된다. 예시적인 구현예에서, 변형량 관련 피드백을 제공하는 것은, 탄성영상 검사의 결과에 관한 피드백을 제공하는 것을 포함하고, 적어도 하나의 프로세서는, 변형량 관련 피드백을 제공할 때, 디스플레이 디바이스를 통해 하나 이상의 의료 이미지들 중 적어도 하나의 디스플레이된 의료 이미지에서의 탄성영상 검사의 결과의 표시자를 디 스플레이하도록 추가로 구성된다. 예시적인 구현예에서, 탄성영상 검사는 자궁경부 탄성영상을 포함하고, 탄성영상 검사의 결과는 환자의 자궁경 부의 연화를 포함하고, 적어도 하나의 프로세서는, 변형량 관련 피드백을 제공할 때, 자궁경부의 연화가 발생했 거나 발생하고 있다는 결정에 기초하여, 조기 분만에 대한 위험의 표시자를 제공하도록 추가로 구성된다. 본 명세서에서 활용되는 바와 같이, 용어들 \"회로들\" 및 \"회로부\"는, 하드웨어를 구성할 수 있고/있거나 하드웨 어에 의해 실행될 수 있고/있거나 달리 하드웨어와 연관될 수 있는 물리적 전자 컴포넌트들(예컨대, 하드웨어) 및 임의의 소프트웨어 및/또는 펌웨어(\"코드\")를 지칭한다. 본 명세서에서 사용되는 바와 같이, 예를 들어, 특 정 프로세서 및 메모리는, 제1 하나 이상의 코드 라인들을 실행시킬 때 제1 \"회로\"를 포함할 수 있고, 제2 하나 이상의 코드 라인들을 실행시킬 때 제2 \"회로\"를 포함할 수 있다. 본 명세서에서 활용되는 바와 같이, \"및/또 는\"은 \"및/또는\"에 의해 결합되는, 리스트 내의 아이템들 중 임의의 하나 이상을 의미한다. 일례로서, \"x 및/ 또는 y\"는 3-요소 세트{(x), (y), (x, y)}의 임의의 요소를 의미한다. 다시 말하면, \"x 및/또는 y\"는 \"x 및 y 중 하나 또는 둘 모두\"를 의미한다. 다른 예로서, \"x, y, 및/또는 z\"는 7-요소 세트{(x), (y), (z), (x, y), (x, z), (y, z), (x, y, z)}의 임의의 요소를 의미한다. 다시 말하면, \"x, y 및/또는 z\"는 \"x, y 및 z 중 하 나 이상\"을 의미한다. 본 명세서에서 활용되는 바와 같이, 용어들 \"블록\" 및 \"모듈\"은 하나 이상의 회로들에 의해 수행될 수 있는 기능들을 지칭한다. 본 명세서에서 활용되는 바와 같이, 용어 \"예시적인\"은 비제한적인 예, 사례, 또는 예시로서의 역할을 함을 의미한다. 본 명세서에서 활용되는 바와 같이, 용어들 \"예를 들어\" 및\"예컨대\"는 하나 이상의 비제한적인 예들, 사례들, 또는 예시들의 리스트들을 제시한다. 본 명세서에서 활용되 는 바와 같이, 회로부는, (예컨대, 일부 사용자-구성가능 설정, 공장 트리밍(factory trim) 등에 의해) 기능의 수행이 디스에이블되거나 인에이블되지 않는지의 여부와는 무관하게, 회로부가 기능을 수행하기 위해 필수 하드 웨어(그리고, 어떤 것이든 필요한 경우에, 코드)를 포함할 때마다, 기능을 수행하도록 \"동작가능\"하다. 본 발명의 다른 실시예들은 기계 및/또는 컴퓨터에 의해 실행가능하여, 이에 의해, 기계 및/또는 컴퓨터로 하여 금, 본 명세서에서 기술되는 바와 같은 프로세스들을 수행하게 하는 적어도 하나의 코드 섹션을 갖는 기계 코드 및/또는 컴퓨터 프로그램이 저장된 비일시적 컴퓨터 판독가능 매체 및/또는 저장 매체, 및/또는 비일시적 기계 판독가능 매체 및/또는 저장 매체를 제공할 수 있다. 따라서, 본 발명은 하드웨어, 소프트웨어, 또는 하드웨어와 소프트웨어의 조합으로 실현될 수 있다. 본 발명은 적어도 하나의 컴퓨팅 시스템에서 중앙집중 방식으로, 또는 몇몇 상호접속된 컴퓨팅 시스템들에 걸쳐서 상이한 요소들이 확산되는 분산 방식으로 실현될 수 있다. 본 명세서에서 기술된 방법들을 수행하도록 구성된 임의의 종류의 컴퓨팅 시스템 또는 다른 장치가 적합하다. 하드웨어와 소프트웨어의 전형적인 조합은, 로딩되고 실행 될 때 컴퓨팅 시스템이 본 명세서에 기술된 방법들을 수행하도록 컴퓨팅 시스템을 제어하는 프로그램 또는 다른 코드를 갖는 범용 컴퓨팅 시스템일 수 있다. 다른 전형적인 구현예는 주문형 집적 회로 또는 칩을 포함할 수 있다. 본 발명에 따른 다양한 실시예들이 또한 컴퓨터 프로그램 제품에 내장될 수 있는데, 이러한 컴퓨터 프로그램 제 품은 본 명세서에서 기술된 방법들의 구현을 가능하게 하는 모든 특징부들을 포함하고, 컴퓨터 시스템 내에 로 딩될 때, 이러한 방법들을 수행할 수 있다. 본 맥락에서의 컴퓨터 프로그램은, 정보 프로세싱 능력을 갖는 시 스템이 하기 중 어느 하나 또는 둘 모두 즉시 또는 그 후에 특정 기능을 수행하게 하도록 의도된 명령어들의 세 트의, 임의의 언어, 코드 또는 표기의, 임의의 표현을 의미한다: a) 다른 언어, 코드 또는 표기로의 변환; b) 상이한 자료 형태의 복원(reproduction). 본 발명이 소정 실시예들을 참조하여 기술되었지만, 본 발명의 범주로부터 벗어남이 없이 다양한 변화들이 이루 어질 수 있고 등가물들이 대체될 수 있음이 당업자에 의해 이해될 것이다. 추가로, 본 발명의 범주로부터 벗어 남이 없이 특정 상황 또는 재료를 본 발명의 교시 내용에 적응시키도록 많은 수정들이 이루어질 수 있다. 따라 서, 본 발명은 개시된 특정 실시예로 제한되는 것이 아니라, 본 발명이 첨부된 청구범위의 범주 내에 속하는 모 든 실시예들을 포함할 것임이 의도된다."}
{"patent_id": "10-2020-0161229", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 탄성초음파영상에 대한 변형률 계산 및 변형량들의 자동 측정을 지원하기 위해 구성될 수 있는 예시적인 의료 이미징 배열을 도시하는 블록도이다. 도 2는 탄성초음파영상에 대한 변형률 계산 및 변형량들의 자동 측정을 지원하기 위해 구성될 수 있는 예시적인 초음파 시스템을 도시하는 블록도이다. 도 3은 탄성초음파영상에 대한 변형률 계산 및 변형량들의 자동 측정을 지원하기 위해 구성된 예시적인 의료 이 미징 시스템에서 생성되는 예시적인 이미지를 도시한다. 도 4는 탄성초음파영상에 대한 변형률 계산 및 변형량들의 자동 측정을 지원하기 위해 구성된 예시적인 의료 이미징 시스템에서 생성되는 예시적인 이미지를 도시한다. 도 5는 탄성초음파영상에 대한 변형률 계산 및 변형량들의 자동 측정에 의해 초음파 이미징을 위해 수행될 수 있는 예시적인 단계들의 흐름도를 도시한다."}
