{"patent_id": "10-2020-7020581", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0097786", "출원번호": "10-2020-7020581", "발명의 명칭": "우주 공간 디지털 물류 시스템", "출원인": "무그 인코포레이티드", "발명자": "스몰 조지"}}
{"patent_id": "10-2020-7020581", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "적층 제조된 제품들(additive manufactured products)을 외계 통신(extraterrestrial communication)을 이용하여 검증 및 인증하는 방법으로서, 고객으로부터, 제품에 대한 적어도 하나의 고객 요구(customer requirement)을 수신하는 단계; 상기 적어도 하나의 고객 요구로부터, 상기 제품에 대한 적어도 하나의 제조 요구(manufacturing requirement)를 개발하는 단계; 상기 제조 요구로부터, 제품 형상 파일(product geometry file) 및 적어도 하나의 프린터 파라미터를 생성하는단계; 제 1 컴퓨팅 디바이스에 의해, 복수의 노드 서버들을 갖는 서버 네트워크 상에 저장된 분산 거래 레지스터(distributed transaction register)에, 상기 제품 형상 파일을 반영하는 제 1 거래를 기록(recording)하는 단계, 상기 제 1 거래는 상기 제 1 거래와 관련된 제 1 출력을 가지며, 상기 제 1 출력은 블록체인 어드레스를 포함하고; 상기 제 1 컴퓨팅 디바이스로부터 제 2 컴퓨팅 디바이스로, 상기 제 1 거래와 관련된 상기 분산 거래 레지스터로부터의 상기 제 1 출력, 상기 제품 형상 파일 및 상기 적어도 하나의 프린터 파라미터를 전송하는 단계, 상기제 1 출력을 전송하는 단계는 상기 서버 네트워크에 통신가능하게 연결된 지상 송수신기 및 상기 지상 송수신기에 통신가능하게 연결된 외계 송수신기 사이에서 송신하는 것을 포함하고, 상기 제 2 컴퓨팅 디바이스는 적어도상기 지상 송수신기 및 상기 외계 송수신기에 의해서, 상기 분산 거래 레지스터를 저장하는 상기 복수의 노드서버를 갖는 상기 서버 네트워크와 통신하도록 구성되며; 상기 적어도 하나의 프린터 파라미터를 만족하고 상기 제품 형상 파일을 이용하여 상기 제품을, 상기 제 2 컴퓨팅 디바이스에 연결된 3D 적층 프린터로 프린팅하는 단계; 상기 제 2 컴퓨팅 디바이스에 의해, 상기 제 1 거래의 상기 제 1 출력을 반영하는 고유 제품 코드를 생성하는단계; 상기 제 2 컴퓨팅 디바이스에 의해, 상기 제품의 프린팅 및 상기 제 1 출력을 반영하는 제 2 거래를, 상기 분산거래 레지스터에 기록하는 단계, 상기 제 2 거래는 상기 제 2 거래와 관련된 제 2 출력을 가지며, 상기 제 2 출력은 블록체인 어드레스를 포함하며;매커니즘에 의해, 상기 제 1 출력을 반영하는 상기 고유 제품 코드를 상기 제품 내에 임베딩하거나 또는 상기제품에 부착하는 단계를 포함하며, 상기 제품이 인증되도록, 상기 제품 형상의 파일 및 상기 제품의 프린팅이 상기 고유 제품 코드와 상기 제 2 거래의 상기 제 2 출력을 이용하여 검증되는 것을 특징으로 하는 적층 제조된 제품들을 검증 및 인증하는 방법."}
{"patent_id": "10-2020-7020581", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 제품에 대한 적어도 하나의 고객 요구는, 품질 파라미터들, 재료 조성 요구들, 제품 정의들, 제조 요구들및 IP 아티팩트로 구성된 그룹으로부터 선택되며, 상기 제품에 대한 적어도 하나의 제조 요구는, 제품 크기, 제품 중량, 제품 강도, 제품 형상, 컴퓨터 보조 설계(CAD) 파일, 및 IP 아티팩트로 구성된 그룹으로부터 선택되는 것을 특징으로 하는 적층 제조된 제품들을 검증및 인증하는 방법."}
{"patent_id": "10-2020-7020581", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "공개특허 10-2020-0097786-3-제1항에 있어서, 상기 외계 송수신기는 우주 식민지, 우주 정거장, 우주선, 행성, 달 또는 소행성(asteroid)에 위치하는 것을 특징으로 하는 적층 제조된 제품들을 검증 및 인증하는 방법."}
{"patent_id": "10-2020-7020581", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 지상 송수신기 및 상기 외계 송수신기는 딥 스페이스 네트워크(DSN: deep space network)를 통해 통신가능하게 연결되는 것을 특징으로 하는 적층 제조된 제품들을 검증 및 인증하는 방법."}
{"patent_id": "10-2020-7020581", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 분산 거래 레지스터는 블록체인을 포함하고, 상기 제 1 거래를 기록하는 단계는 상기 블록체인의 제 1 블록에 상기 제 1 거래를 기록하는 단계를 포함하고, 상기 제 2 거래를 기록하는 단계는 상기 블록체인의 제 2 블록에 상기 제 2 거래를 기록하는 단계를 포함하는 것을 특징으로 하는 적층 제조된 제품들을 검증 및 인증하는방법."}
{"patent_id": "10-2020-7020581", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 제 1 거래는 제 1 거래 데이터(datum)를 더 포함하고, 상기 제 2 거래는 제 2 거래 데이터를 더 포함하는것을 특징으로 하는 적층 제조된 제품들을 검증 및 인증하는 방법."}
{"patent_id": "10-2020-7020581", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 제 1 거래 데이터는 상기 제품 형상 파일을 반영하는 암호화 해시 다이제스트(cryptographic hash digest)를 포함하고, 상기 제 2 거래 데이터는 상기 제품의 프린팅을 반영하는 암호화 해시 다이제스트를 포함하는것을 특징으로 하는 적층 제조된 제품들을 검증 및 인증하는 방법."}
{"patent_id": "10-2020-7020581", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 제 1 출력을 반영하는 상기 고유 제품 코드를 임베딩하는 것은, 상기 고유 제품 코드를 상기 제품에 프린팅하거나 또는 상기 고유 제품 코드로 상기 제품을 에칭하는 것을 특징으로 하는 적층 제조된 제품들을 검증 및인증하는 방법."}
{"patent_id": "10-2020-7020581", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서, 상기 제조 요구로부터, 적어도 하나의 3D 적층 프린터 재료 파라미터 및 적어도 하나의 3D 적층 프린터 교정 파라미터를 생성하는 단계; 및 상기 3D 적층 프린터 교정 파라미터를 충족하는 3D 적층 프린터로, 상기 적어도 하나의 3D 적층 프린터 재료 파라미터를 이용하여 상기 제품을 프린팅하는 단계를 더 포함하며, 상기 제 1 거래는 상기 적어도 하나의 3D 적층 프린터 재료 파라미터 및 상기 적어도 하나의 3D 적층 프린터 교정 파라미터를 반영하고, 그리고 상기 제품이 인증되도록, 상기 적어도 하나의 3D 적층 프린터 재료 파라미터 및 상기 적어도 하나의 3D 적층 프린터 교정 파라미터는 상기 고유 제품 코드로 검증되는 것을 특징으로 하는 적층 제조된 제품들을 검증 및 인증하는 방법."}
{"patent_id": "10-2020-7020581", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "공개특허 10-2020-0097786-4-제9항에 있어서, 상기 적어도 하나의 3D 적층 프린터 교정 파라미터는 속도, 파워, 스캔 속도(scan rate), 및 공급 속도(feedrate)를 포함하는 그룹으로부터 선택되고, 상기 적어도 하나의 3D 적층 프린터 재료 파라미터는 알루미늄, 티타늄, 스테인레스 스틸, 코발트 크롬, 인코넬(inconel), 마레이징 강철(maraging steel), 하스탈로이-X(hastalloy-X), 및 구리를 포함하는 그룹으로부터 선택되는 것을 특징으로 하는 적층 제조된 제품들을 검증 및 인증하는 방법."}
{"patent_id": "10-2020-7020581", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항에 있어서, 상기 분산 거래 레지스터는 블록체인을 포함하고, 상기 제 1 거래를 기록하는 단계는 상기 제 1 거래를 상기 블록체인의 제 1 블록에 기록하는 단계를 포함하는 것을 특징으로 하는 적층 제조된 제품들을 검증 및 인증하는방법."}
{"patent_id": "10-2020-7020581", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 상기 제 1 거래를 기록하는 단계는, 상기 제품 형상 파일, 상기 적어도 하나의 3D 적층 프린터 교정 파라미터, 및 상기 적어도 하나의 3D 적층 프린터 재료 파라미터를 반영하는 엔트리를 상기 제 1 블록에 기록하는 단계를 포함하는 것을 특징으로 하는 적층제조된 제품들을 검증 및 인증하는 방법."}
{"patent_id": "10-2020-7020581", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제1항에 있어서, 제 3 컴퓨팅 디바이스에 의해, 상기 분산 거래 레지스터에, 상기 제품에 대한 적어도 하나의 고객 요구를 반영하는 제 3 거래를 기록하는 단계; 상기 분산 거래 레지스터로부터 상기 제 3 거래와 관련된 제 3 출력을 획득하는 단계; 제 4 컴퓨팅 디바이스에 의해, 상기 분산 거래 레지스터에, 상기 제품에 대한 적어도 하나의 제조 요구를 반영하는 제 4 거래를 기록하는 단계; 및상기 분산 거래 레지스터로부터 상기 제 4 거래와 관련된 제 4 출력을 획득하는 단계를 더 포함하고, 상기 제 4 출력은 상기 제 3 출력을 반영하고, 상기 제 1 출력은 상기 제 4 출력을 반영하며, 상기 제품이 인증되도록, 상기 적어도 하나의 고객 요구 및 상기 적어도 하나의 제조 요구가 상기 고유 제품 코드로 검증되는 것을 특징으로 하는 적층 제조된 제품들을 검증 및 인증하는 방법."}
{"patent_id": "10-2020-7020581", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서, 제 5 컴퓨팅 디바이스에 의해, 상기 분산 거래 레지스터에, 상기 제 1 출력을 반영하는 상기 고유 제품 코드의상기 임베딩을 반영하는 제 5 거래를 기록하는 단계;상기 분산 거래 레지스터로부터 상기 제 5 거래와 관련된 제 5 출력 및 상기 제 2 출력을 획득하는 단계; 상기 제품을 검사하는 단계;제 6 컴퓨팅 디바이스에 의해, 상기에 분산 거래 레지스터에, 상기 제품의 검사를 반영하는 제 6 거래를 기록하는 단계를 더 포함하고, 상기 고유 제품 코드를 임베딩하는 것과 상기 제품을 검사하는 것은 상기 분산 거래 레지스터를 이용하여 검증되는 것을 특징으로 하는 적층 제조된 제품들을 검증 및 인증하는 방법. 공개특허 10-2020-0097786-5-청구항 15 제14항에 있어서, 상기 분산 거래 레지스터로부터 상기 제 6 거래와 관련된 제 6 출력 및 상기 제 5 출력을 획득하는 단계; 상기 제품을 최종 사용자에게 전달하는 단계; 제 7 컴퓨팅 디바이스에 의해, 상기에 분산 거래 레지스터에, 상기 제품의 최종 사용자에게로의 전달을 반영하는 제 7 거래를 기록하는 단계를 더 포함하고, 상기 제품의 최종 사용자에게로의 전달은 상기 분산 거래 레지스터를 이용하여 검증되는 것을 특징으로 하는 적층 제조된 제품들을 검증 및 인증하는 방법."}
{"patent_id": "10-2020-7020581", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서, 상기 분산 거래 레지스터로부터 상기 제 7 거래와 관련된 제 7 출력 및 상기 제 6 출력을 획득하는 단계; 최종 사용을 위해 상기 제품을 설치하는 단계; 제 8 컴퓨팅 디바이스에 의해, 상기에 분산 거래 레지스터에, 상기 최종 사용을 위한 상기 제품의 설치를 반영하는 제 8 거래를 기록하는 단계를 더 포함하고, 상기 최종 사용을 위한 상기 제품의 설치는, 상기 분산 거래 레지스터를 이용하여 검증되는 것을 특징으로 하는적층 제조된 제품들을 검증 및 인증하는 방법."}
{"patent_id": "10-2020-7020581", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서, 상기 분산 거래 레지스터는 블록체인을 포함하고;상기 제 1 거래를 기록하는 단계는, 상기 제 1 거래를 상기 블록체인의 제 1 블록에 기록하는 단계를 포함하고;상기 제 2 거래를 기록하는 단계는, 상기 제 2 거래를 상기 블록체인의 제 2 블록에 기록하는 단계를 포함하고;상기 제 3 거래를 기록하는 단계는, 상기 제 3 거래를 상기 블록체인의 제 3 블록에 기록하는 단계를 포함하고;상기 제 4 거래를 기록하는 단계는, 상기 제 4 거래를 상기 블록체인의 제 4 블록에 기록하는 단계를 포함하고;상기 제 5 거래를 기록하는 단계는, 상기 제 5 거래를 상기 블록체인의 제 5 블록에 기록하는 단계를 포함하고;상기 제 6 거래를 기록하는 단계는, 상기 제 6 거래를 상기 블록체인의 제 6 블록에 기록하는 단계를 포함하고;상기 제 7 거래를 기록하는 단계는, 상기 제 7 거래를 상기 블록체인의 제 7 블록에 기록하는 단계를 포함하고;상기 제 8 거래를 기록하는 단계는, 상기 제 8 거래를 상기 블록체인의 제 8 블록에 기록하는 단계를 포함하는것을 특징으로 하는 적층 제조된 제품들을 검증 및 인증하는 방법."}
{"patent_id": "10-2020-7020581", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제1항에 있어서, 상기 분산 거래 레지스터로부터, 상기 제 1 거래 및 상기 제 2 거래를 반영하는 거래 기록을 생성하는 단계를더 포함하는 것을 특징으로 하는 적층 제조된 제품들을 검증 및 인증하는 방법."}
{"patent_id": "10-2020-7020581", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제16항에 있어서, 제 9 컴퓨팅 디바이스에 의해, 상기 제품에 임베딩되거나 또는 상기 제품에 부착된 상기 고유 제품 코드를 스캐닝하는 단계;상기 제 9 컴퓨팅 디바이스에 의해, 상기 고유 제품 코드가 상기 분산 거래 레지스터의 상기 제 2 출력과 관련공개특허 10-2020-0097786-6-되어 있는지를 검증하는 단계; 및상기 제 9 컴퓨팅 디바이스에 의해, 적어도 하나의 거래 데이터를 획득하는 단계; 및 상기 검증 및 상기 적어도 하나의 거래 데이터에 기초하여, 상기 제품이 진품인지를 결정하는 단계를 더 포함하는 것을 특징으로 하는 적층 제조된 제품들을 검증 및 인증하는 방법."}
{"patent_id": "10-2020-7020581", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제1항에 있어서, 상기 3D 적층 프린터의 폐쇄 루프 제어를 위해 인공 지능 모듈을 트레이닝하는 단계를 더 포함하며, 상기 인공지능 모듈을 트레이닝하는 단계는, 복수의 부품들에 대응하는 적층 제조 빌드 파라미터 설정 파일들을 상기 인공 지능 모듈에 입력하는 단계; 3D 적층 프린터에 의해서 프로세스 과정 동안 수집된 순차적 시간 기반 파라미터 데이터를 상기 인공 지능 모듈에 입력하는 단계; 프로세스 과정 동안 캡처된 빌드 레이어 이미지들을 평가하는 컨볼루션 뉴럴 네트워크에 의해 생성된 빌드 레이어 이미지 분류 데이터를 상기 인공 지능 모듈에 입력하는 단계; 포스트-프로세스에서 캡처된 부품의 이미지들을 평가하는 적어도 하나의 다른 컨볼루션 뉴럴 네트워크에 의해생성된 포스트-프로세스 이미지 분류 데이터를 상기 인공 지능 모듈에 입력하는 단계; 및 상기 적층 제조 빌드 파라미터 설정 파일들, 상기 순차적 시간 기반 파라미터 데이터, 상기 빌드 레이어 이미지분류 데이터, 및 상기 포스트-프로세스 이미지 분류 데이터를 상기 인공 지능 모듈에 의해서 평가하는 단계를 포함하는 것을 특징으로 하는 적층 제조된 제품들을 검증 및 인증하는 방법."}
{"patent_id": "10-2020-7020581", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제20항에 있어서,적층 제조 머신에 의해서 프로세스 과정 동안 수집된 멜트 풀(melt pool) 데이터를 상기 인공 지능 모듈에 입력하는 단계; 및 상기 인공 지능 모듈에 의해 상기 멜트 풀 데이터를 평가하는 단계를 더 포함하는 것을 특징으로 하는 적층 제조된 제품들을 검증 및 인증하는 방법."}
{"patent_id": "10-2020-7020581", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "적층 제조된 제품들을 외계 통신을 이용하여 검증 및 인증하는 시스템으로서, 분산 거래 레지스터를 저장하는 다수의 노드 서버들을 갖는 서버 네트워크;상기 분산 거래 레지스터를 저장하는 다수의 노드 서버들을 갖는 서버 네트워크와 통신하는 제 1 컴퓨팅 디바이스, 상기 제 1 컴퓨팅 디바이스는 또한 제품에 대한 적어도 하나의 제조 요구로부터 생성된 제품 형상 파일을반영하는 제 1 거래를 상기 분산 거래 레지스터에 기록하며, 상기 제 1 거래는 상기 제 1 거래와 관련된 제 1출력을 가지며, 상기 제 1 출력은 블록체인 어드레스를 포함하고; 데이터를 송수신하도록 상기 서버 네트워크에 통신가능하게 연결된 지상 송수신기; 데이터를 송수신하도록 상기 지상 송수신기에 통신가능하게 연결된 외계 송수신기; 적어도 상기 지상 송수신기 및 상기 외계 송수신기에 의해서, 상기 분산 거래 레지스터를 저장하는 다수의 노드서버들을 갖는 서버 네트워크와 통신하는 제 2 컴퓨팅 디바이스; 상기 제 2 컴퓨팅 디바이스와 통신하고 상기 제품을 프린트하는 3D 적층 프린터, 상기 3D 적층 프린터는 또한상기 제품 형상 파일을 이용하여 상기 제품을 프린트하며; 그리고 상기 제 2 컴퓨팅 디바이스와 통신하도록 구성된 매커니즘을 포함하고, 상기 매커니즘에 의해 상기 제 1 출력을 반영하는 고유 제품 코드가 상기 제품 내에 임베딩되거나 또는 상기 제공개특허 10-2020-0097786-7-품에 부착되고, 상기 제 1 컴퓨팅 디바이스, 상기 제 2 컴퓨팅 디바이스, 또는 제 3 컴퓨팅 디바이스 중 하나는 상기 제 1 거래의 제 1 출력을 반영하는 상기 고유 제품 코드를 생성하고, 상기 제 2 컴퓨팅 디바이스는 또한 상기 제품의 프린팅 및 상기 제 1 출력을 반영하는 제 2 거래를 상기 분산거래 레지스터에 기록하고, 상기 제 2 거래는 상기 제 2 거래와 관련된 제 2 출력을 가지고, 상기 제 2 출력은블록체인 어드레스를 포함하며, 상기 제품이 인증되도록, 상기 제품 형상의 파일이 상기 고유 제품 코드와 상기 제 2 거래의 상기 제 2 출력을이용하여 검증되는 것을 특징으로 하는 적층 제조된 제품들을 검증 및 인증하는 시스템."}
{"patent_id": "10-2020-7020581", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제22항에 있어서, 상기 3D 적층 프린터는, 상기 고유 제품 코드를 상기 제품에 임베딩하거나 또는 부착하는 상기 매커니즘을 포함하는 것을 특징으로 하는 적층 제조된 제품들을 검증 및 인증하는 시스템."}
{"patent_id": "10-2020-7020581", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제22항에 있어서, 상기 3D 적층 프린터는 적층 제조 빌드 프로세세스에 따라 부품을 레이어별로(layer-to-layer) 형성하도록 구성되고, 상기 3D 적층 프린터는, 파우더 베드(powder bed) 및 에너지 소스, 상기 에너지 소스로부터의 에너지 빔은 상기 파우더 베드 내의 파우더 레이어에 대해 스캔되어 상기 부품의 각각의 레이어를 융해에 의해(by fusion) 형성하고; 상기 3D 적층 프린터에서 부품을 형성하기 위한 빌드 파라미터들의 초기 세트를 저장하는 빌드 파라미터 설정파일, 상기 빌드 파라미터들의 초기 세트는 상기 부품의 형상 모델에 적어도 일부 기초하며; 프로세스 과정 동안 상기 빌드 파라미터들의 초기 세트를 조정하기 위한 폐쇄 루프 제어 구조, 상기 폐쇄 루프제어 구조는 트레이닝된 인공 지능 모듈을 갖는 저속 제어 루프를 포함하고; 그리고 프로세스 과정 동안 부품 레이어들의 레이어 이미지들을 획득하는 빌드 레이어 이미지 센서를 포함하며, 상기 빌드 파라미터들의 초기 세트, 상기 빌드 프로세스에 대응하는 조정된 빌드 파라미터들의 시간 기반 시퀀스, 및 상기 레이어 이미지들은 상기 트레이닝된 인공 지능 모듈에 대한 입력으로서 전송되는 것을 특징으로 하는 적층 제조된 제품들을 검증 및 인증하는 시스템."}
{"patent_id": "10-2020-7020581", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제24항에 있어서, 상기 3D 적층 프린터는 또한, 상태 머신을 갖는 고속 제어 루프; 및 프로세스 과정 동안 상기 에너지 소스에 의해서 형성된 멜트 풀을 나타내는 실시간 멜트 풀 데이터를 획득하도록 구성된 멜트 풀 모니터링 시스템을 더 포함하고, 상기 멜트 풀 데이터는 상기 트레이닝된 인공 지능 모듈에 대한 입력으로서 그리고 상기 상태 머신에 대한 입력으로서 전송되는 것을 특징으로 하는 적층 제조된 제품들을 검증 및 인증하는 시스템."}
{"patent_id": "10-2020-7020581", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "적층 제조된 제품들을 외계 통신을 이용하여 검증 및 인증하는 방법으로서, 제품 형상 파일을 생성하는 단계, 복 수의 노드 서버를 갖는 서버 네트워크 상에 저장된 분산 거래 레지스터에 제품 형상 파일을 반영하는 제 1 거래 를 기록하는 단계, 상기 제 1 거래는 상기 제 1 거래과 관련된 제 1 출력을 가지며 블록체인 어드레스를 포함하 며, 서버 네트워크에 통신가능하게 연결된 지상 송수신기와 상기 지상 송수신기에 통신가능하게 연결된 외계 송 수신기 사이에서 제 1 출력을 전송하는 단계, 제품 형상 파일을 이용하여 3D 적층 프린터로 제품을 프린트하는 단계를 포함한다."}
{"patent_id": "10-2020-7020581", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 우주 공간에서의 제조에 관한 것으로, 보다 상세하게는 제품 수명주기를 통해 제조된 부품을 추적하 고 일련의 인증 거래들을 디지털 분산 원장(ledger)에 기록하는 시스템에 관한 것이다."}
{"patent_id": "10-2020-7020581", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "\"상품의 블록체인 검증을 위한 시스템 및 방법(System and Method for Block-Chain Verification of Goods)\"이 라는 제목의 미국 특허출원(공개번호 US 2016/0098723)은 컴퓨팅 디바이스에 의해서 코드 스캐너를 사용하여 제 품에 부착된 코드로부터 어드레스를 스캐닝하는 단계, 컴퓨팅 디바이스에 의해서 상기 어드레스가 거래 (transaction)(이하, \"거래\" 혹은 \"거래\" 이라 함) 레지스터에 기록된 암호-화폐 거래와 관련된다는 것을 검증 하는 단계, 컴퓨팅 디바이스에 의해서 적어도 하나의 현재 거래 데이터를 획득하는 단계, 및 상기 검증 및 적어 도 하나의 현재 거래 데이터에 기초하여, 제품이 정품임을 결정하는 단계를 포함하는 방법에 관한 발명이다. 또한, \"상품의 블록체인 검증을 위한 시스템 및 방법(System and Method for Block-Chain Verification of Goods)\"이라는 제목의 미국 특허출원(공개번호 US 2016/0098730)은 제 1 컴퓨팅 디바이스에 의해 제 1 어드레스 를 획득하는 단계, 제 1 컴퓨팅 디바이스에 의해, 제 1 어드레스를 제 1 제품에 부착된 제 1 코드로 내보내는 단계, 제 1 컴퓨팅 디바이스에 의해, 제 1 어드레스로 제 1 암호-화폐 거래를 제출하는 단계, 거래 레지스터에 서, 제 2 컴퓨팅 디바이스에 의해, 코드 스캐너로부터, 제 1 제품에 부착된 제 1 코드로부터 스캔된 제 1 어드 레스를 수신하는 단계, 상기 제 1 어드레스를 사용하여, 상기 제 2 컴퓨팅 디바이스에 의해, 상기 거래 레지스 터에서 상기 제 1 암호-화폐 거래를 검증하는 단계, 및 검증에 기초하여, 제 2 컴퓨팅 디바이스에 의해, 제 1 제품이 진품인지 식별하는 단계를 포함하는 방법에 관한 발명이다. 우주 공간(outer space)은 인류에게 알려진 가장 혹독한 환경 중 하나이다. 우주 공간에서는 건강에 해를 끼치 고 사망에 이르는 위험이 높기 때문에 실패가 용납되지 않는다. 구성되는 제조 부품은 오리지널 부품 또는 \"올 바른\" 대응 부품과 실질적으로 동일해야만 한다. 우주 공간에서는 \"두 번째 기회\"가 존재하지 않는다. 이러한 열악한 환경에서 성공률을 높이기 위해서는, 부품의 3D 제조를 위한 데이터, 프로세스 및 성능 무결성을 제조 프로세스가 보장해야만 한다. 우주 공간에서는, 우주선, 우주 정거장 또는 우주 식민지와 같은 우주-기반 엔티 티(space-based entity)에서 수리 및 교체를 위한 부품들을 구축 및/또는 프린팅함으로써 물류 프로세스가 단축 될 수 있다. 이러한 우주 우주 기반 고객은 제품 카탈로그로부터 디지털 공급 아이템을 구매할 수 있으며(예컨 대, 디지털 데이터로서) 그리고 우주 공간에서 적층 프린팅(additive printing)함으로써 디지털 공급 아이템을 물리적인 제조 부품들로 변환할 수 있다."}
{"patent_id": "10-2020-7020581", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 공급 체인 소스의 무결성, 디지털 데이터 전달 및 수신의 무결성, 및 프린트된 제조 아이템의 공급 체 인의 수신측에서의 무결성을 포함하여, 프린트된 제조 아이템의 품질을 보장할 수 있는 시스템에 대한 필요성이 존재한다."}
{"patent_id": "10-2020-7020581", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "개시된 실시예의 대응하는 부분들, 일부들 또는 일면에 대한 괄호를 참조하여, 단지 예시를 목적으로하고 비제 한적으로, 본 개시의 예시적인 실시예는 적층 제조 제품을 검증 및 인증하는 방법을 제공하며, 상기 방법은, 제 품에 대한 적어도 하나의 고객 요구를 고객으로부터 수신하는 단계; 하나 이상의 고객 요구으로부터, 제품에 대한 하나 이상의 제조 요구을 개발하는 단계; 제조 요구로부터, 제품 형상 파일 및 적어 도 하나의 프린터 파라미터(119, 120, 121, 122, 128, 130)를 생성하는 단계(218, 228, 236, 254); 제 1 컴퓨 팅 디바이스(27a)에 의해, 상기 제품 형상 파일을 반영하는 제 1 거래(90c)를 분산 거래 레지스터에 기록하 는 단계(225, 243, 260); 프린터 파라미터를 충족시키는 3D 적층 프린터로 상기 제품 형상 파일을 사용하여 상기 제품을 프린팅하는 단계; 상기 분산 거래 레지스터로부터 상기 제 1 거래과 관련된 제 1 출력 (84c)을 획득하는 단계; 상기 제 1 출력을 반영하는 고유 코드를 생성하는 단계; 제품 내에 상기 고 유 코드를 임베딩하는 단계; 제품의 프린팅 및 상기 제 1 출력을 반영하는 제 2 거래(90i)을 제 2 컴퓨팅 디바이스(27b)에 의해 분산 거래 레지스터에 기록하는 단계(271, 281); 상기 분산 거래 레지스터로부터 상기 제 2 거래과 관련된 제 2 출력(84i)을 획득하는 단계를 포함하며; 이에 의해서 상기 제품 형상 파일 및 상기 제품 의 프린팅이 상기 고유 코드 및 제 2 출력으로 검증될 수 있으며, 따라서 상기 제품이 인증될 수 있다. 제품에 대한 적어도 하나의 고객 요구는 품질 파라미터들, 재료 조성 요구들, 제품 정의들, 제조 요구들 및 IP 아티팩트로 구성된 그룹으로부터 선택될 수 있다. 제품에 대한 적어도 하나의 제조 요구는 제품 크기, 제품 중량, 제품 강도, 제품 형상, 컴퓨터 보조 설계(CAD) 파일, 재료 요구, 및 IP 아티팩트 로 구성된 그룹으로부터 선택될 수 있다. 제품 형상 파일은 적층 제조 파일 또는 스테레오리소그래피 파일 을 포함할 수 있다. 분산 거래 레지스터는 블록체인을 포함할 수 있고, 제 1 거래를 기록하는 단계는 제 1 거래를 블록체인의 제 1 블록에 기록하는 단계를 포함할 수 있다. 제 1 거래는 거래 데이터 및 제 1 출력을 포 함할 수 있다. 제 1 출력은 블록체인 어드레스를 포함할 수 있고 거래 데이터는 제품 형상 파일을 반영하는 암 호화 해시 다이제스트를 포함할 수 있다. 제 2 거래를 기록하는 단계는 제 2 거래를 블록체인의 제 2 블록에 기 록하는 단계를 포함할 수 있다. 제 2 거래는 거래 데이터 및 제 2 출력을 포함할 수 있다. 제 2 출력은 블록체 인 어드레스를 포함할 수 있고 거래 데이터는 상기 제품의 프린팅을 반영하는 암호화 해시 다이제스트를 포함할 수 있다. 상기 제 1 출력을 반영하는 고유 코드를 상기 제품에 임베딩하는 단계는, 상기 고유 코드를 상기 제품 에 프린팅하거나 상기 고유 코드를 상기 제품에 부착하는 단계를 포함할 수 있다. 본 방법은 다음의 단계들을 포함할 수 있는바, 제조 요구로부터 하나 이상의 프린터 파라미터, 하나 이상의 3D 적층 프린터 재료 파라미터 및 하나 이상의 3D 적층 프린터 교정 파라미터를 생성하는 단계; 상기 제 1 거래가 상기 하나 이상의 3D 적층 프린터 재료 파라미터 및 상기 하나 이상의 3D 적층 프린터 교정 파라미터 를 반영하도록 상기 분산 거래 레지스터에 상기 제 1 거래를 기록하는 단계; 3D 적층 프린터 교정 파라미 터를 충족시키는 3D 적층 프린터로, 상기 제품 형상 파일 및 상기 하나 이상의 3D 적층 프린터 재료 파라미터를 이용하여, 제품을 프린트하는 단계를 포함하고, 이에 의해, 제품이 인증될 수 있도록 하나 이상의 3D 적층 프린 터 재료 파라미터 및 하나 이상의 3D 적층 프린터 교정 파라미터가 상기 고유 코드로 검증될 수 있다. 상기 하 나 이상의 3D 적층 프린터 교정 파라미터는 속도, 전력, 스캔 속도 및 공급 속도로 이루어진 그룹으로부터 선택 될 수 있다. 상기 하나 이상의 3D 적층 프린터 재료 파라미터는 알루미늄, 티타늄, 스테인레스 스틸, 코발트 크 롬, 인코넬, 마레이징 강철, 하스탈로이-X(hastalloy -X) 및 구리로 구성된 그룹으로부터 선택될 수 있다. 분산 거래 레지스터는 블록체인을 포함할 수 있고, 제 1 거래를 기록하는 단계는 제 1 거래를 블록체인의 제 1 블록 에 기록하는 단계를 포함할 수 있다. 제 1 거래를 기록하는 단계는 제품 형상 파일, 3D 적층 프린터 교정 파라 미터 및 3D 적층 프린터 재료 파라미터를 반영하는 엔트리를 제 1 블록에 기록하는 단계를 포함할 수 있다. 본 방법은, 제 3 컴퓨팅 디바이스에 의해, 분산 거래 레지스터에, 제품에 대한 적어도 하나의 고객 요구를 반영 하는 제 3 거래(90a)을 기록하는 단계; 상기 분산 거래 레지스터로부터 상기 제 3 거래과 관련된 제 3 출 력을 획득하는 단계; 제 4 컴퓨팅 디바이스에 의해, 제품에 대한 적어도 하나의 제조 요구를 반영하는 제 4 거 래(90b)을 분산 거래 레지스터에 기록하는 단계; 상기 분산 거래 레지스터로부터 상기 제 4 거래과 관련된 제 4 출력을 획득하는 단계를 포함하고; 상기 제 4 출력은 상기 제 3 출력을 반영하고 상기 제 1 출력은 상기 제 4 출력을 반영하며; 제품이 인증될 수 있도록, 상기 제품에 대한 하나 이상의 고객 요구 및 상기 제품에 대한 하 나 이상의 제조 요구는 고유 코드로 검증될 수 있다. 제품에 대한 적어도 하나의 고객 요구은 품질 파라미터들, 재료 조성 요구들, 제품 정의들, 제조 요구들 및 IP 아티팩트로 구성된 그룹으로부터 선택될 수 있다. 제품에 대한 적어도 하나의 제조 요구는 제품 크기, 제품 중량, 제품 강도, 제품 형상, 컴퓨터 보조 설계 파일, 재료 요구 및 IP 아티팩트로 구성된 그룹으로부터 선택될 수 있다. 분산 거래 레지스터는 블록체인을 포함할 수 있고, 제 3 거래를 기록하는 단계는 블록체인의 제 3 블록에 제 3 거래를 기록하는 단계를 포함할 수 있고, 제 4 거래를 기록하는 단계는 블록체인의 제 4 블록에 제 4 거래를 기록하는 단계를 포함할 수 있다. 본 방법은, 제 5 컴퓨팅 디바이스에 의해, 분산 거래 레지스터에, 제 2 출력을 반영하는 고유 코드를 제품에 임베딩 또는 부착하는 것을 반영하는 제 5 거래(90j)를 기록하는 단계; 상기 제 5 거래와 관련된 제 5 출력 및 상기 제 2 출력을 상기 분산 거래 레지스터로부터 획득하는 단계; 제품을 검사하는 단계; 제 6 컴퓨팅 디바이스에 의해, 상기 제품의 검사를 반영하는 제 6 거래(90k)을 상기 분산 거래 레지스터에 기록하는 단계를 포함하 고; 이에 의해서 고유 코드를 제품에 임베딩 또는 부착하는 것 및 제품의 검사는 분산 거래 레지스터로 검증될 수 있다. 분산 거래 레지스터는 블록체인을 포함할 수 있고, 제 5 거래를 기록하는 단계는 제 5 거래를 블록체 인의 제 5 블록에 기록하는 단계를 포함할 수 있고, 제 6 거래를 기록하는 단계는 제 6 거래를 블록체인의 제 6 블록에 기록하는 단계를 포함할 수 있다. 본 방법은 제 6 거래와 관련된 제 6 출력 및 제 5 출력을 분산 거래 레지스터로부터 획득하는 단계; 최종 사용자에게 제품을 전달하는 단계; 제 7 컴퓨팅 디바이스에 의해, 최종 사 용자에게 제품이 전달됨을 반영하는 제 7 거래(90L)를 분산 거래 레지스터에 기록하는 단계를 포함할 수 있으며; 이에 의해서 최종 사용자에게 제품이 전달되는 것은 분산 거래 레지스터로 검증될 수 있다. 본 방법은 제 7 거래와 관련된 제 7 출력 및 제 6 출력을 분산 거래 레지스터로부터 획득하는 단계; 최종 사용을 위해 제 품을 설치하는 단계; 제 8 컴퓨팅 디바이스에 의해, 최종 사용을 위한 제품의 설치를 반영하는 제 8 거래를 분 산 거래 레지스터에 기록하는 단계를 포함할 수 있으며; 이로써 최종 사용을 위한 제품의 설치는 분산 거래 레 지스터로 검증될 수 있다. 분산 거래 레지스터는 블록체인을 포함할 수 있고, 제 7 거래를 기록하는 단계는 제7 거래를 블록체인의 제 7 블록에 기록하는 단계를 포함할 수 있고, 제 8 거래를 기록하는 단계는 제 8 거래를 블록체인의 제 8 블록에 기록하는 단계를 포함할 수 있다. 본 방법은 분산 거래 레지스터로부터의 제 1 거래 및 제 2 거래를 반영하는 거래 기록을 생성하는 단계를 포함 할 수 있다. 본 방법은, 컴퓨팅 디바이스에 의해 제품에 내장되거나 부착된 고유 코드를 스캐닝하는 단계; 컴퓨 팅 디바이스에 의해, 코드가 분산 거래 레지스터의 제 2 출력과 관련되어 있는지 검증하는 단계; 컴퓨팅 디 바이스에 의해, 적어도 하나의 현재 거래 데이터를 획득하는 단계; 및 상기 검증 및 상기 적어도 하나의 현 재 거래 데이터에 기초하여, 제품이 진품인지를 결정하는 단계를 포함한다. 본 발명의 다른 예시적인 실시예는 데이터베이스 시스템을 제공하며, 상기 데이터베이스 시스템은, 제품에 대한 하나 이상의 고객 요구; 상기 하나 이상의 고객 요구으로부터 개발된 제품에 대한 하나 이상의 제조 요구; 제조 요구로부터 생성된 제품 형상 파일; 상기 제품 형상 파일을 반영하는 제 1 거래를 갖는 분산 거래 레지스터; 분 산 거래 레지스터는 프린터 파라미터를 만족시키는 적층 프린터로 상기 제품을 프린트함을 반영하는 제 2 거래 를 가지며; 제품이 인증될 수 있도록, 제품 형상 파일 및 제품의 프린팅은 고유 코드로 검증될 수 있다. 본 발명의 다른 예시적인 실시예는 컴퓨터 시스템을 제공하는바, 상기 컴퓨터 시스템은, 분산 거래 원장을 저장하는 복수의 노드 서버를 갖는 서버 네트워크와 통신하도록 구성된 제 1 컴퓨팅 디바이스; 분산 거 래 원장을 저장하는 복수의 노드 서버를 갖는 서버 네트워크와 통신하도록 구성된 제 2 컴퓨팅 디바이스; 제품 을 프린트하기 위한 3D 적층 프린터; 코드를 제품에 임베딩 또는 부착하기 위한 매커니즘을 포함하고; 상기 제 1 컴퓨팅 디바이스는 상기 제품에 대한 적어도 하나의 제조 요구로부터 생성된 제품 형상 파일을 반영하는 제 1 거래를 상기 분산 거래 레지스터에 기록하도록 구성되고; 3D 적층 프린터는 제품 형상 파일을 사용하여 제 품을 프린트하도록 구성되고; 상기 제 1, 제 2 또는 제 3 컴퓨팅 디바이스 중 하나는 제 1 거래를 반영하는 고 유 제품 코드를 생성하도록 구성되고; 상기 매커니즘은 제 1 거래를 반영하는 고유 제품 코드를 상기 제품에 내 장하거나 부착하도록 구성되고; 상기 제 2 컴퓨팅 디바이스는 상기 제품의 프린팅을 반영하는 제 2 거래를 상기 분산 거래 레지스터에 기록하도록 구성되고; 제품이 인증될 수 있도록, 고유 코드 및 제 2 거래으로부터의 출력 으로 제품 형상 파일이 검증될 수 있다. 3D 적층 프린터는 고유 제품 코드를 제품에 임베딩 또는 부착하기 위한 매커니즘을 포함할 수 있다. 본 발명의 다른 예시적인 실시예는 검증 방법을 제공하며, 상기 검증 방법은, (a) 복수의 엔티티(35, 36)로부터 복수의 제품을 수신하는 단계, 상기 복수의 제품들 각각은 제품 정보를 저장하는 관련된 분산 거래 레지스터를 가지며; (b) 분산 거래 레지스터로부터 제품 정보를 결정하는 단계; 및 (c) 제품 정보를 집계하는 단계를 포함 한다. 제품 정보는 제품 요구, 제품 프로세스 또는 재료, 제품 커스터디(custody), 제품 보수 (remuneration), 지적 재산권 중 적어도 하나를 포함할 수 있다. 분산 거래 레지스터는 개인 디지털 원장 및 공개(public) 디지털 원장 중 하나일 수 있다. 상기 방법은 집계된 제품 정보 및 최종 제품을 제 3 자 로 전송하는 단계를 더 포함할 수 있고, 최종 제품은 복수의 제품의 조합일 수 있다. 상기 방법은 복수의 제품을 수신하기 전에, 제품 정보를 저장하는 분산 거래 레지스터에 대한 액세스를 수신하는 단계를 더 포함할 수 있다. 본 발명의 다른 예시적인 실시예는 검증을 위한 장치를 제공하며, 상기 장치는, 적어도 하나의 프로세서 및 컴 퓨터 프로그램 명령을 저장하는 적어도 하나의 메모리를 포함하고, 컴퓨터 프로그램 명령을 갖는 상기 적어도 하나의 메모리는 적어도 하나의 프로세서가 상기 장치로 하여금 적어도 다음을 수행하게 할 수 있는바, 복수의 엔티티로부터 복수의 제품을 수신하는 것에 응답하여, 분산 거래 레지스터로부터 제품 정보를 결정하게 하고, 복수의 제품들 각각은 제품 정보를 저장하는 관련된 분산 거래 레지스터를 가지며; 그리고 제품 정보를 집계하 게 한다. 제품 정보는 제품 요구, 제품 프로세스 또는 재료, 제품 커스터디, 제품 보수, 지적 재산권 중 적어도 하나를 포함할 수 있다. 또한, 컴퓨터 프로그램 명령을 갖는 상기 적어도 하나의 메모리는 적어도 하나의 프로 세서가 상기 장치로 하여금 적어도 다음을 수행하게 할 수 있는바, 상기 장치는 복수의 제품을 수신하기 전에, 제품 정보를 저장하는 분산 거래 레지스터에 액세스할 수 있다. 분산 거래 레지스터는 개인 디지털 원장 및 공 개 디지털 원장 중 하나일 수 있다. 본 발명의 다른 예시적인 실시예는 컴퓨터 프로그램 명령을 유형적으로 포함하는 비일시적 컴퓨터 판독가능 매 체를 제공하며, 상기 컴퓨터 프로그램 명령은 프로세서에 의해 실행될 때 프로세서로 하여금 적어도 다음을 수 행하게 하는바, 복수의 엔티티로부터 복수의 제품을 수신하는 것에 응답하여, 분산 거래 레지스터로부터 제품 정보를 결정하게 하고, 복수의 제품들 각각은 제품 정보를 저장하는 관련된 분산 거래 레지스터를 가지며; 그리 고 제품 정보를 집계하게 한다. 제품 정보는 제품 요구, 제품 프로세스 또는 재료, 제품 커스터디, 제품 보수,지적 재산권 중 적어도 하나를 포함할 수 있다. 또한, 상기 프로세서는 적어도 다음을 수행할 수 있는바, 복수 의 제품을 수신하기 전에, 제품 정보를 저장하는 분산 거래 레지스터에 액세스할 수 있다. 분산 거래 레지스터 는 개인 디지털 원장 및 공개 디지털 원장 중 하나일 수 있다. 본 발명의 다른 예시적인 실시예는 제조된 제품의 출처, 검증 및 인증을 위한 방법을 제공하며, 상기 방법은, 고객으로부터 제품에 대한 적어도 하나의 고객 요구를 수신하는 단계, 적어도 하나의 IP 아티팩트를 개발하는 단계, 적어도 하나의 제조 요구을 도출하는 단계, 제품에 대한 제품 형상 파일을 생성하는 단계, 제 1 컴퓨팅 디바이스에 의해 IP 아티팩트 및 제조 요구를 포함하는 제품 형상 파일의 인증을 반영하는 제 1 거래를 분산 거 래 레지스터에 기록하는 단계, 상기 제 1 거래를 반영하는 제 1 출력을 획득하는 단계, 상기 제품을 3D 프린터 로 프린트하는 단계, 제 2 컴퓨팅 디바이스에 의해 상기 제품의 프린팅 및 제 1 출력을 반영하는 제 2 거래를 상기 분산 거래 레지스터에 기록하는 단계, 제 2 거래를 반영하는 제 2 출력을 획득하는 단계, 제 2 출력을 반 영하는 고유 코드를 제품 내에 임베딩하는 단계를 포함하고, 상기 제품 형상 파일 및 제품의 프린팅이 고유 코 드로 검증될 수 있으며, 따라서 상기 제품은 정품으로 인증될 수 있다. 본 발명의 다른 예시적인 실시예는 추적하는 방법을 제공하며, 상기 방법은, (a) 정보를 부품과 관련시키는 단 계, 상기 정보는 특허, 발명, 상표, 저작권, 저작물, 또는 아이템에 구현된 노하우 중 적어도 하나를 포함하고; 그리고 (b) 상기 부품의 관련 정보를 데이터베이스에 기록하는 단계를 포함하고, 상기 기록하는 단계는 데이터 베이스 내의 관련 정보를 암호화하고 부품에 고유 식별자를 할당하는 단계를 더 포함할 수 있다. 데이터베이스 는 공개 원장 또는 개인 원장일 수 있다. 데이터베이스는 PLM일 수 있다. 상기 방법은 부품의 기록된 관련 정보 를 암호화하는 단계를 더 포함할 수 있다. 본 발명의 또 다른 예시적인 실시예는 데이터베이스 시스템을 제공한다. 데이터베이스 시스템은 제품에 대한 하 나 이상의 고객 요구, 하나 이상의 IP 아티팩트, 하나 이상의 고객 요구로부터 개발된 제품에 대한 하나 이상의 제조 요구 및 제조 요구와 하나의 IP 아티팩트로부터 생성된 제품 형상 파일을 포함한다. 또한, 데이터베이스 시스템은 제품 형상 파일을 반영하는 제 1 거래를 갖는 분산 거래 레지스터를 포함하고, 상기 분산 거래 레지스 터는 적어도 하나의 프린터 파라미터를 만족하는 적층 프린터로 제품을 프린팅한 것을 반영하는 제 2 거래를 가 지며, 제품 형상 파일 및 제품의 프린팅은 고유 코드로 검증될 수 있으며, 따라서 상기 제품은 정품으로 인증될 수 있다. 본 발명의 다른 예시적인 실시예는 방법을 제공하며 상기 방법은, 정보를 부품과 관련시키는 단계, 상기 정보는 특허, 발명, 상표, 저작권, 저작물 또는 아이템에 구현된 노하우 중 적어도 하나를 포함하고, 그리고 데이터베 이스 내에 상기 부품의 관련 정보를 기록하는 단계를 포함하고, 상기 기록하는 단계는 상기 데이터베이스 내의 관련 정보를 암호화하고 상기 부품에 고유 식별자를 할당하는 단계를 더 포함한다. 본 발명의 목적은, 검증 및 출처 검증을 위한 방법, 장치, 컴퓨터 판독가능 매체, 데이터베이스 시스템, 및 컴 퓨팅 시스템을 제공하는 것이다. 본 발명의 또 다른 예시적인 실시예는 외계 통신을 이용하여 적층 제조 제품을 검증 및 인증하는 방법을 제공한다. 상기 방법은 고객으로부터, 제품에 대한 적어도 하나의 고객 요구를 수신하는 단계; 적어 도 하나의 고객 요구로부터, 제품에 대한 적어도 하나의 제조 요구를 개발하는 단계; 제조 요구으로부터, 제품 형상 파일 및 적어도 하나의 프린터 파라미터를 생성하는 단계; 제 1 컴퓨팅 디바이스(27a)에 의해, 복수의 노드 서버를 갖는 서버 네트워크 상에 저장된 분산 거래 레지스터에, 제품 형상 파일 을 반영하는 제 1 거래(90c)를 기록하는 단계, 상기 제 1 거래(90c)은 상기 제 1 거래(90c)과 관련된 제 1 출력(84c)을 가지며, 제 1 출력(84c)은 블록체인 어드레스를 포함하고; 상기 제 1 컴퓨팅 디바이스(27a)로부터 제 2 컴퓨팅 디바이스로, 상기 제 1 거래(90c)과 관련된 분산 거래 레지스터로부터의 제 1 출력(84c), 제품 형상 파일, 및 적어도 하나의 프린터 파라미터를 전송하는 단계, 상기 제 1 출력(84c)을 전송하 는 단계는 서버 네트워크에 통신가능하게 연결된 지상 송수신기 및 상기 지상 송수신기에 통신가 능하게 연결된 외계 송수신기 사이에서 송신하는 것을 포함하고, 상기 제 2 컴퓨팅 디바이스는 적어 도 상기 지상 송수신기 및 상기 외계 송수신기에 의해서, 상기 분산 거래 레지스터를 저장하는 복수의 노드 서버를 갖는 서버 네트워크와 통신하도록 구성되며; 상기 적어도 하나의 프린터 파라미터 를 만족하고 상기 제품 형상 파일을 이용하여 제품을 3D 적층 프린터로 프린트하는 단계; 제 2 컴퓨터 디바이스에 의해, 제 1 거래(90c)의 제 1 출력(84c)을 반영하는 고유 제품 코드를 생성하는 단계; 상기 제 2 컴퓨팅 디바이스에 의해, 상기 제품의 프린팅 및 상기 제 1 출력(84c)을 반영하는 제 2 거래(90i)을 상기 분산 거래 레지스터에 기록하는 단계, 상기 제 2 거래(90i)은 상기 제 2 거래(90i)과 관련된 제 2 출력을 가지며, 상기 제 2 출력은 블록체인 어드레스를 포함하고; 그리고 매커니즘에 의해, 제 1 출력(84c)을 반영하는 고유 제품 코드를 제품 내에 임베딩 또는 제품에 부착하는 단계를 포함하고, 제품 형상 파일 및 제품의 프린팅이 고유 제품 코드와 제 2 거래(90i)으로부터의 제 2 출력을 이용하여 검 증되어, 상기 제품이 인증된다. 본 발명의 또 다른 실시예가 개시되는바, 제품에 대한 적어도 하나의 고객 요구는 품질 파라미터, 재료 조 성 요구, 제품 정의, 제조 요구 및 IP 아티팩트로 구성된 그룹으로부터 선택되고; 제품에 대한 하나 이상의 제 조 요구는 제품 크기, 제품 중량, 제품 강도, 제품 형상, CAD(Computer Aided Design) 파일 및 IP 아티팩트 로 구성된 그룹으로부터 선택되고; 제품 형상 파일은 적층 제조 파일 또는 스테레오리소그래피 파일 을 포함한다; 분산 거래 레지스터는 블록체인을 포함하고, 제 1 거래를 기록하는 단계는 제 1 거래를 블록체인의 제 1 블록에 기록하는 단계를 포함하고; 제 2 거래(90i)을 기록하는 단계는 블록체인의 제 2 블록에 제 2 거래(90i)을 기록하는 단계를 포함한다; 상기 제 1 거래는 제 1 거래 데이터를 더 포함하고 상기 제 2 거 래(90i)는 제 2 거래 데이터를 더 포함하고; 제 1 거래 데이터는 제품 형상 파일을 반영하는 암호화 해시 다이제스트를 포함하고, 제 2 거래 데이터는 제품의 프린트를 반영하는 암호화 해시 다이제스트를 포함하고; 제 1 출력(84c)을 반영하는 고유 제품 코드를 임베딩하는 단계는 고유 제품 코드로 제품을 프린트하거나 고유 제품 코드로 제품을 에칭하는 단계를 포함하고; 상기 방법은 다음을 더 포함하고, 제조 요구로부터, 하나 이상 의 3D 적층 프린터 재료 파라미터 및 하나 이상의 3D 적층 프린터 교정 파라미터를 생성하는 단계; 및 3D 적층 프린터 교정 파라미터를 충족하는 3D 적층 프린터로 하나 이상의 3D 적층 프린터 재료 파 라미터를 사용하여 제품을 프린트하는 단계를 포함하고, 제 1 거래(90c)는 하나 이상의 3D 적층 프 린터 재료 파라미터 및 하나 이상의 3D 적층 프린터 교정 파라미터를 반영하고; 상기 적어도 하나의 3D 적층 프린터 재료 파라미터 및 상기 적어도 하나의 3D 적층 프린터 교정 파라미터는 제품이 인증되도록 고유한 제품 코드로 검증되고; 하나 이상의 3D 적층 프린터 교정 파라미터는 속도, 전력, 스캔 속도 및 공급 속도로 구성된 그룹으로부터 선택되고; 하나 이상의 3D 적층 프린터 재료 파라미터는 알루미 늄, 티타늄, 스테인레스 스틸, 코발트 크롬, 인코넬 , 마레이징 강철, 하스탈로이-X 및 구리로 이루어진 그룹으 로부터 선택되고; 분산 거래 레지스터는 블록체인을 포함하고, 제 1 거래를 기록하는 단계는 제 1 거래를 블록체인의 제 1 블록에 기록하는 단계를 포함하고; 제 1 거래(90c)을 기록하는 단계는 제품 형상 파일, 적어도 하나의 3D 적층 프린터 교정 파라미터 및 적어도 하나의 3D 적층 프린터 재료 파라미터를 반 영하는 엔트리를 제 1 블록에 기록하는 단계를 포함하고; 제 3 컴퓨팅 디바이스에 의해, 제품에 대한 적어 도 하나의 고객 요구를 반영하는 제 3 거래(90a)을 분산 거래 레지스터에 기록하는 단계; 상기 제 3 거래 (90a)과 관련된 제 3 출력을 상기 분산 거래 레지스터로부터 획득하는 단계; 제 4 컴퓨팅 디바이스에 의해, 분산 거래 레지스터에, 제품에 대한 적어도 하나의 제조 요구를 반영하는 제 4 거래(90b)를 기록하는 단계; 상기 제 4 거래(90b)과 관련된 제 4 출력을 상기 분산 거래 레지스터로부터 획득하는 단계; 상기 제 4 출력은 상기 제 3 출력을 반영하고 상기 제 1 출력은 상기 제 4 출력을 반영하고; 상기 제품에 대한 적어도 하나의 고객 요구 및 상기 제품에 대한 적어도 하나의 제조 요구는 상기 제품이 인증되도록 고유 제 품 코드로 검증되고; 제 5 컴퓨팅 디바이스에 의해, 제 1 출력을 반영하는 고유 제품 코드를 임베딩하는 것을 반영하는 제 5 거래(90j)을 분산 거래 레지스터에 기록하는 단계; 상기 제 5 거래(90j)와 관련된 제 5 출력 및 상기 제 2 출력을 상기 분산 거래 레지스터로부터 획득하는 단계; 제품을 검사하는 단계; 제 6 컴퓨팅 디바 이스에 의해, 제품의 검사를 반영하는 제 6 거래(90k)을 분산 거래 레지스터에 기록하는 단계; 상기 고유 제품 코드를 임베딩하고 상기 제품을 검사하는 것은는 상기 분산 거래 레지스터에 의해 검증되고; 상 기 제 6 거래(90k)와 관련된 제 6 출력 및 상기 제 5 출력을 상기 분산 거래 레지스터로부터 획득하는 단계; 최 종 사용자에게 제품을 전달하는 단계; 제 7 컴퓨팅 디바이스에 의해, 최종 사용자에게 제품의 전달을 반영 하는 제 7 거래을 분산 거래 레지스터에 기록하는 단계; 상기 최종 사용자에게로의 상기 제품의 전달 은 상기 분산 거래 레지스터로 검증되고; 상기 제 7 거래와 관련된 제 7 출력 및 상기 제 6 출력을 상 기 분산 거래 레지스터로부터 획득하는 단계; 최종 사용을 위해 제품을 설치하는 단계; 제 8 컴퓨팅 디바이 스에 의해, 최종 사용을 위한 제품의 설치를 반영하는 제 8 거래를 분산 거래 레지스터에 기록하는 단계; 최종 사용을 위한 제품의 설치는 분산 거래 레지스터에 의해 검증되고; 분산 거래 레지스터는 블록체인 을 포함하고; 상기 제 1 거래(90c)을 기록하는 단계는 상기 제 1 거래(90c)을 블록체인의 제 1 블록에 기록하는 단계; 제 2 거래(90i)을 기록하는 단계는 블록체인의 제 2 블록에 제 2 거래(90i)을 기록하는 단계; 상기 제 3 거래를 기록하는 단계는 상기 제 3 거래(90a)을 블록체인의 제 3 블록에 기록하는 단계; 상기 제 4 거래(90b)을 기록하는 단계는 상기 제 4 거래(90b)을 블록체인의 제 4 블록에 기록하는 단계; 상기 제 5 거래(90j)을 기록하 는 단계는 상기 제 5 거래(90j)을 블록체인의 제 5 블록에 기록하는 단계; 제 6 거래(90k)을 기록하는 단계는블록체인의 제 6 블록에 제 6 거래(90k)을 기록하는 단계; 제 7 거래을 기록하는 단계는 제 7 거래을 블록체인의 제 7 블록에 기록하는 단계; 상기 제 8 거래를 기록하는 단계는 상기 제 8 거래를 블록체인의 제 8 블록에 기록하는 단계; 상기 분산 거래 레지스터로부터 상기 제 1 거래(90c) 및 상기 제 2 거래(90i)을 반 영하는 거래 기록을 생성하는 단계; 제 9 컴퓨팅 디바이스에 의해, 제품 내에 임베딩되거나 제품에 부착된 고유 제품 코드를 스캐닝하는 단계; 제 9 컴퓨팅 디바이스에 의해, 고유 제품 코드가 분산 거래 레지스터의 제 2 출력과 관련되어 있는지 검증하는 단계; 및 상기 제 9 컴퓨팅 디바이스에 의해 적어도 하나의 거래 데이터 를 획득하는 단계; 및 상기 검증 및 적어도 하나의 거래 데이터에 기초하여, 제품이 진품인지를 결정하는 단계; 부품을 제조하기 위해 적층 제조 프로세스를 수행하도록 동작가능한 적층 제조 머신의 폐쇄 루 프 제어를 위해 인공 지능 모듈을 트레이닝시키는 단계, 상기 인공 지능 모듈의 트레이닝은 다음을 포함하며: 복수의 부품들에 대응하는 적층 제조 빌드 파라미터 설정 파일들을 상기 인공 지능 모듈에 입력하는 단계; 적층 제조 머신에 의해서 프로세스 과정 동안 수집된 순차적 시간 기반 파라미터 데이터를 상기 인공 지능 모듈에 입 력하는 단계; 프로세스 과정 동안 캡처된 빌드 레이어 이미지들을 평가하는 컨볼루션 뉴럴 네트워크에 의 해 생성된 빌드 레이어 이미지 분류 데이터를 상기 인공 지능 모듈에 입력하는 단계; 포스트-프로세스에서 캡처 된 부품의 이미지들을 평가하는 적어도 하나의 다른 컨볼루션 뉴럴 네트워크에 의해 생성된 포스트-프로세 스 이미지 분류 데이터를 상기 인공 지능 모듈에 입력하는 단계; 및 상기 적층 제조 빌드 파라미터 설정 파일들 , 상기 순차적 시간 기반 파라미터 데이터, 상기 빌드 레이어 이미지 분류 데이터, 및 상기 포 스트-프로세스 이미지 분류 데이터를 상기 인공 지능 모듈에 의해서 평가하는 단계; 적층 제조 머신에 의 해서 프로세스 과정 동안 수집된 멜트 풀(melt pool) 데이터를 상기 인공 지능 모듈에 입력하는 단계; 및 상기 인공 지능 모듈에 의해 상기 멜트 풀 데이터를 평가하는 단계를 포함한다. 본 개시의 다른 예시적인 실시예는 외계 통신을 이용하여 적층 제조된 제품을 검증 및 인증하기 위한 시스 템을 제공한다. 시스템은 분산 거래 레지스터를 저장하는 복수의 노드 서버를 갖는 서버 네트워크; 분산 거래 레지스터를 저장하는 복수의 노드 서버를 갖는 서버 네트워크와 통신하도록 구성된 제 1 컴퓨팅 디바이스(27a), 제 1 컴퓨팅 디바이스(27a)는 제품에 대한 적어도 하나의 제조 요구로부터 생성된 제품 형상 파일을 반영하는 제 1 거래(90c)를 분산 거래 레지스터에 기록하도록 구성되고, 상기 제 1 거래(90c)은 상기 제 1 거래(90c)과 관련되고 블록체인 어드레스를 포함하는 제 1 출력(84c)을 가지며; 서버 네 트워크에 통신가능하게 연결되어 데이터를 송수신하는 지상 송수신기; 지상 송수신기와 통신가능 하게 연결되어 데이터를 송수신하는 외계 송수신기; 적어도 지상 송수신기 및 외계 송수신기에 의해 분산 거래 레지스터를 저장하는 복수의 노드 서버를 갖는 서버 네트워크와 통신하도록 구성된 제 2 컴퓨팅 디바이스; 제 2 컴퓨팅 디바이스와 통신하고 제품을 프린트하도록 구성된 3D 적층 프린터, 3D 적층 프린터는 제품 형상 파일을 사용하여 제품을 프린트하도록 추가로 구성되 고; 및 상기 제 2 컴퓨팅 디바이스와 통신하고 상기 제 1 출력(84c)을 상기 제품에 반영하는 고유한 제품 코드를 내장 또는 부착하도록 구성되는 매커니즘을 포함하고, 상기 제 1, 제 2 또는 제 3 컴퓨팅 디바이스 중 하나는 제 1 거래(90c)의 제 1 출력(84c)을 반영하는 고유 제품 코드를 생성하도록 구성되고, 제 2 컴퓨팅 디바이스는 분산 거래 레지스터에 상기 제품의 프린팅을 반영하는 제 2 거래(90i) 및 제 1 출력(84c) 을 기록하고, 제 2 거래(90i)은 제 2 거래(90i)과 관련된 제 2 출력을 가지며, 제 2 출력은 블록체인 어드레스 를 포함하고, 그리고 제품이 인증되도록 제품 형상 파일이 고유 제품 코드 및 제 2 거래(90i)로부터 의 제 2 출력으로 검증된다. 본 발명의 다른 예시적인 실시예가 개시되며, 여기서 3D 적층 프린터는 고유 제품 코드를 제품에 임 베딩 또는 부착하기 위한 매커니즘을 포함하고; 적층 제조 빌드 프로세스에 따라 층별로 부품을 제조하기 위한 적층 제조 시스템, 상기 적층 제조 시스템은: 파우더 베드 및 에너지 소스를 포함하는 적층 제조 머신, 에너지 소스로부터의 에너지 빔이 파우더 베드 내의 파우더 층에 대해 스캐 닝되어 융합에 의해 부품의 각 층을 형성하고; 적층 제조 머신에서 부품을 구축하기 위한 빌드 파라미터들 의 초기 세트를 저장하는 빌드 파라미터 설정 파일, 빌드 파라미터들의 초기 세트는 상기 부품의 기하학적 모델에 적어도 부분적으로 기초하고; 프로세스 과정 동안 상기 빌드 파라미터들의 초기 세트를 조정하기 위한 폐쇄 루프 제어 구조, 상기 폐쇄 루프 제어 구조는 트레이닝된 인공 지능 모듈을 갖는 저속 제어 루프를 포함하고; 그리고 프로세스 과정 동안 부품 레이어들의 레이어 이미지들을 획득하는 빌드 레이어 이미지 센서를 포함하며, 상기 빌드 파라미터들의 초기 세트, 상기 빌드 프로세스에 대응하는 조정된 빌드 파라미터들의 시간 기반 시퀀스, 및 상기 레이어 이미지들은 상기 트레이닝된 인공 지능 모듈에 대한 입력으로서 전송되고; 상태 머신을 갖는 고속 제어 루프; 및 프로세스 과정 동안 에너지 소스에 의해 형성된 멜트 풀을 나 타내는 실시간 멜트 풀 데이터를 획득하도록 구성된 멜트 풀 모니터링 시스템; 상기 멜트 풀 데이터는 트레이닝된 인공 지능 모듈에 대한 입력으로서 그리고 상태 머신에 대한 입력으로서 전송되고; 트레이 닝된 인공 지능 모듈은 프로세스 중 획득된 레이어 이미지를 평가하도록 구성된 제 1 컨볼루션 뉴럴 네트워크 로부터의 평가 데이터를 이용하여 트레이닝되고, 및 포스트-프로세스에서 획득된 최종 부품의 이미지를 평 가하도록 구성된 적어도 하나의 제 2 컨볼루션 뉴럴 네트워크; 적어도 하나의 제 2 컨볼루션 뉴럴 네트워 크는 단면화된 부품들의 2 차원 이미지를 평가하도록 구성된 컨볼루션 뉴럴 네트워크를 포함하고; 적 어도 하나의 제 2 컨볼루션 뉴럴 네트워크는 부품의 3 차원 이미지를 평가하도록 구성된 컨볼루션 뉴 럴 네트워크를 포함하고; 트레이닝된 인공 지능 모듈은 리커런트 인공 뉴럴 네트워크를 갖는 딥 러닝 모듈이다. 이어서, 본 발명의 실시예들이 설명되지만, 개시된 실시예들만으로 본 발명이 한정되지 않으며, 본 발명의 기본 원리를 벗어남이 없이도 본 발명의 다양한 변형예들이 가능함을 이해해야 한다. 따라서, 본 발명의 범위는 첨부 된 청구 범위에 의해서만 결정되어야 한다."}
{"patent_id": "10-2020-7020581", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "먼저, 다음을 유의해야 하는바, 동일한 도면 부호들은 여러 도면들에 걸쳐 동일한 구조적 요소들, 부분들 또는 표면들을 일관되게 식별하도록 의도된 것으로 이해되어야하며, 이러한 요소들, 부분들 또는 표면들은 발명의 상 세한 설명이 중요 부분인 전체 명세서에 의해서 추가로 서술되거나 설명될 수 있다. 달리 지시되지 않는한, 도 면은 명세서와 함께 읽히도록 의도되었으며, 본 발명의 전체 명세서의 일부로 간주되어야 한다. 본 발명의 예시적인 실시예는 제조된 부품들을 안전하게 추적하는 방법을 실행하기 위한 완전한 기능의 컴퓨터"}
{"patent_id": "10-2020-7020581", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "시스템과 관련하여 주로 설명된다. 그러나, 해당 기술분야의 당업자는 본 발명이 임의의 적합한 데이터 프로세 싱 시스템과 함께 사용하기 위해 신호 보유 매체 상에 배치된 컴퓨터 프로그램 제품으로 구현될 수 있음을 인식 할 것이다. 이러한 신호 보유 매체는 자기 매체, 광학 매체, 솔리드 스테이트 매체 또는 다른 적절한 매체를 포 함하는 머신 판독가능한 정보를 위한 전송 매체 또는 기록가능한 매체일 수 있다. 기록가능한 매체의 예는 하드 드라이브 또는 디스켓의 자기 디스크, 광학 드라이브용 콤팩트 디스크, 자기 테이프, 솔리드 스테이트 메모리 디바이스 및 당업자에게 발생할 수 있는 다른 것들을 포함한다. 전송 매체의 일례들은, 음성 통신을 위한 전화 네트워크 및 디지털 데이터 통신 네트워크를 포함하는바, 가령 인터넷 프로토콜 및 월드 와이드 웹으로 통신하"}
{"patent_id": "10-2020-7020581", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "는 EthernetsTM 및 네트워크를 포함한다. 해당 기술분야의 당업자라면, 적절한 프로그래밍 수단을 갖는 임의의 컴퓨터 시스템이 프로그램 제품에 구현된 본 방법의 단계들을 실행할 수 있다는 것을 즉시 인식할 것이다. 당업 자라면, 본 명세서에서 설명된 예시적인 실시예 중 일부는 컴퓨터 하드웨어 상에 설치되고 실행되는 소프트웨어 를 지향하지만, 펌웨어 또는 하드웨어로 구현된 대안적인 실시예 역시도 본 발명의 범위 내에 있음을 즉시 인식 할 것이다. 도 1 내지 도 43의 흐름도 및 블록도는 본 개시의 다양한 실시예에 따른 시스템 및 방법의 가능한 구현예의 아 키텍처, 기능 및 동작을 도시한다. 이와 관련하여, 흐름도 또는 블록도의 각 블록은 지정된 논리 기능(들)을 구 현하기 위한 하나 이상의 실행가능한 명령을 포함하는 모듈, 세그먼트 또는 코드의 일부를 나타낼 수 있다. 다 음을 유의해야 하는바, 일부 대안적인 구현들에서, 블록에서 언급된 기능들은 도면들에서 언급된 순서를 벗어나 서 실행될 수 있음에 유의해야한다. 예를 들어, 연속으로 도시된 2 개의 블록은 실제로는 실질적으로 동시에 실 행될 수 있거나, 또는 관련된 기능에 따라 블록이 때때로 역순으로 실행될 수 있다. 또한, 다음을 유의해야 하 는바, 블록도 및/또는 흐름도의 각각의 블록 및 블록도 및/또는 흐름도의 블록들의 조합은, 특정 기능 또는 동 작을 수행하는 특수 목적의 하드웨어 기반 시스템에 의해 구현될 수 있으며, 또는 특수 목적 하드웨어 및 컴퓨 터 명령의 조합에 의해 구현될 수 있다. 일반적으로, 디지털 시스템은 소프트웨어를 실행하는 하나 이상의 프로세서, 및 소프트웨어에 의해 제어될 수 있는 다양한 하드웨어 디바이스를 포함한다. 예를 들어, 디지털 시스템은 데스크탑, 랩탑, 넷탑, 서버, 워크 스 테이션 등과 같은 컴퓨터 시스템; 휴대폰, 개인 휴대 정보 단말기, 스마트 폰 등과 같은 모바일 디바이스; 및 기타 특수 목적 디바이스를 포함한다. 하드웨어 디바이스는 일반적으로 저장 기능(예컨대, 디스크 드라이브, 플 래시 메모리, 광 드라이브 등), 통신 기능(예컨대, 네트워킹, 무선 작동 등) 및 기타 입력/출력 기능(터치 스크 린, 키보드, 마우스, 디스플레이, 오디오 등)을 제공한다. 여러 유닛들, 회로들, 또는 다른 구성 요소들은 작업/작업들을 수행하도록 \"구성된(configured to)\" 것으로 서 술될 수 있다. 이러한 맥락에서, \"구성된(configured to)\" 은 동작시에 작업 혹은 작업들을 수행하는 \"회로를 갖음\"을 일반적으로 의미하는 구조에 대한 넓은 표현이다. 따라서, 디바이스/회로/구성 요소는 상기 디바이스/ 회로/구성 요소가 현재 온(on)이 아닌 경우에도 작업/작업을 수행하도록 구성될 수 있다. 일반적으로, \"구성 된\"에 대응하는 구조를 형성하는 회로는 동작을 구현하기 위한 하드웨어 회로를 포함할 수 있다. 유사하게, 다 양한 유닛/회로/구성 요소는 설명의 편의를 위해 작업 혹은 작업들을 수행하는 것으로 서술될 수 있다. 이러한 서술은 \"구성된(configured to)\" 이라는 어구를 포함하는 것으로 해석되어야 한다.하나 이상의 작업들을 수행하 도록 구성된 유닛/회로/구성 요소에 대한 기재는 이러한 유닛/회로/구성 요소의 해석에 있어서, 미국 연방 법전 제35편 112조 제6항(35 U.S.C. §112, paragraph six)의 규정을 위배하는 것으로 명백히 의도되지 않는다. 컴퓨팅 디바이스 이제 도 1 내지 도 35에 도시된 분산 컴퓨터 네트워크를 참조하면, 여기에 논의된 시스템 실시예들의 컴퓨팅 디 바이스들(27, 27a 및 27b)을 포함하는 컴퓨팅 디바이스들은, 랜덤 액세스 메모리(RAM)와 같은 메인 메모리를 포 함하고, 보조 메모리를 또한 포함할 수 있다. 보조 메모리는 예를 들어, 하드 디스크 드라이브, 착탈식 스토리 지 유닛, 혹은 기타 유사한 수단에 연결된 착탈식 저장 드라이브 또는 인터페이스를 포함할 수 있다. 관련 기술 분야의 통상의 기술자에 의해 이해될 수 있는 바와 같이, 착탈식 저장 유닛은 컴퓨터 소프트웨어 및/또는 데이 터가 저장된 컴퓨터 사용가능 저장 매체를 포함한다. 보조 메모리를 생성하는 추가 수단의 예로는 프로그램 카트리지 및 카트리지 인터페이스(예컨대, 비디오 게임 디바이스에서 발견됨), 착탈식 메모리 칩(예: EPROM, 또는 PROM) 및 관련 소켓, 그리고 기타 착탈식 저장 유닛 및 인터페이스를 포함할 수 있는바, 이들은 착탈식 저장 유 닛으로부터 컴퓨터 시스템으로 소프트웨어 및 데이터를 전송할 수 있다. 일부 실시예에서, 컴퓨팅 디바이스의 메모리에 데이터를 \"유지\"한다는 것은, 문제의 알고리즘에 의해 요구되는 바와 같이 검색하기에 편리한 형태로 그 데이터를 메모리에 저장하고, 필요에 따라 데이터를 검색, 업데이트 또는 삭제하는 것을 의미한다. 본 발명의 컴퓨팅 디바이스는 또한 통신 인터페이스를 포함할 수 있다. 통신인터페이스는 소프트웨어 및 데이터 가 컴퓨팅 디바이스와 외부 디바이스 사이에서 전송될 수 있게 한다. 통신 인터페이스는 모뎀, 네트워크 인터페 이스(이더넷 카드와 같은), 통신 포트, PCMCIA 슬롯 및 카드, 또는 컴퓨팅 디바이스를 외부 디바이스에 연결하 기 위한 다른 수단을 포함할 수 있다. 통신인터페이스를 통해 전송된 소프트웨어 및 데이터는 신호의 형태일 수 있으며, 이는 전자, 전자기, 광학 또는 통신 인터페이스에 의해 수신될 수 있는 다른 신호일 수 있다. 이들 신 호는 유선 또는 케이블, 광섬유, 전화선, 셀룰러 전화 링크 및 무선 주파수 링크 또는 다른 통신 채널을 통해 통신 인터페이스에 제공될 수 있다. 다른 디바이스가 통신 인터페이스를 통해 컴퓨팅 디바이스에 연결될 수 있 다. 일부 실시예들에서, 디바이스 또는 구성요소는 컴퓨팅 디바이스에 \"결합\" 되는바, 제품 또는 수단 및 디바 이스가 하나의 머신으로서 함께 작동될 수 있을 정도로 그 디바이스와 관련이 있는 경우, 디바이스 또는 구성 요소는 컴퓨팅 디바이스에 \"결합\" 된다. 특히, 전자 장비는 컴퓨팅 디바이스에 결합될 수 있는바, 전자 장비가 컴퓨팅 디바이스에 통합된 경우(예를 들어, 스마트 폰의 내장 카메라), 장비와 디바이스 사이에서 신호를 전파 할 수 있는 와이어에 의해 장비가 디바이스에 부착된 경우(예를 들어, 컴퓨터 포트 중 하나에 플러그인된 유선 수단을 통해 개인용 컴퓨터에 연결된 마우스), 신호를 전파하는 와이어 기능을 대체하는 무선 기술(예를 들어, 휴대폰의 무선 BLUETOOTH 헤드셋)에 의해서 디바이스에 테더링되는 경우, 혹은 다수의 머신들 사이에서의 유무 선 연결들로 구성된 일부 네트워크에서 공유 멥버쉽에 의해 컴퓨팅 디바이스와 관련되는 경우(예를 들어, 사용 자와 프린터가 인터넷에 연결할 수 있는 한, 사무실에 속한 컴퓨터들을 위해 문서를 출력하는 사무실 내의 프린 터), 전자 장비는 컴퓨팅 디바이스에 결합될 수 있다. 컴퓨팅 디바이스는 제 2 컴퓨팅 디바이스(미도시)에 결합 될 수 있는바, 예를 들어, 서버는 아래에서 더 상세히 설명되는 바와 같이 클라이언트 디바이스에 결합될 수 있 다. 본 명세서에서 논의된 시스템 실시예에서의 통신 인터페이스는 컴퓨팅 디바이스와 데이터 입력 디바이스, 디바 이스의 디스플레이 및 네트워크 연결(유선 또는 무선)과의 결합을 용이하게 한다. 일부 실시예에서, \"데이터 입 력 디바이스\"는 그 디바이스에 데이터를 입력하는데 사용될 수 있는 컴퓨팅 디바이스에 연결된 임의의 장비이다. 이러한 정의는 키보드, 컴퓨터 마우스, 터치 스크린, 디지털 카메라, 디지털 비디오 카메라, 무선 안 테나, GPS(Global Positioning System) 디바이스, 오디오 입력 및 출력 디바이스, 자이로스코픽 방향 센서, 근 접 센서, 컴퍼스, 스캐너, 지문 또는 망막 스캐너와 같은 특수 판독 디바이스 및 전자기 방사, 전자기장, 중력, 전자기력, 온도, 진동 또는 압력을 감지할 수 있는 임의의 하드웨어 디바이스를 포함하지만 이에 국한되지 않는 다. 컴퓨팅 디바이스의 \"수동 데이터 입력 디바이스\"는 사용자가 수동 조작을 사용하여 컴퓨팅 디바이스에 데이 터를 입력할 수 있게하는 컴퓨팅 디바이스에 연결된 모든 데이터 입력 디바이스의 세트이다. 수동 입력 디바이 스는 키보드, 키패드, 터치 스크린, 트랙 패드, 컴퓨터 마우스, 버튼 및 기타 유사한 구성 요소를 포함하지만, 이에 한정되지 않는다. 컴퓨팅 디바이스는 또한 내비게이션 설비를 가질 수 있다. 컴퓨팅 디바이스의 \"내비게이 션 설비\"는 디바이스가 지구 표면 상의 디바이스의 위치 및 고도를 정확하게 계산할 수 있게 하는 컴퓨팅 디바 이스에 연결된 임의의 설비일 수 있다. 네비게이션 설비는 글로벌 포지셔닝 시스템 또는 유사한 위성 네트워크 와 통신할 뿐만 아니라, 예를 들어, 셀 타워들과 통신함으로써 그들의 위치를 확인하기 위해 휴대폰 또는 기타 디바이스가 이용하는 임의의 다른 시스템과 통신하도록 구성된 수신기를 포함한다. 컴퓨팅 디바이스에 결합된 코드 스캐너는 물체에 부착된 \"코드\"로부터 정보를 추출할 수 있는 디바이스이다. 일 실시예에서, 코드는 그것 이 부착된 물체에 관한 데이터를 포함하고, 이는 스캐너에 의해 자동으로 추출될 수 있는바, 예를 들어, 코드는 레이저 스캐너를 사용하여 데이터가 추출될 수 있는 바코드일 수 있다. 코드는 디지털 스캐너 또는 카메라에 의 해 데이터가 추출될 수 있는 QR(Quick-read) 코드를 포함할 수 있다. 코드는 무선 주파수 식별자(RFID) 태그를 포함할 수 있으며, 코드는 능동 RFID 태그를 포함할 수 있다. 코드는 수동 RFID 태그를 포함할 수 있다. 컴퓨팅 디바이스는 또한 코드 익스포터에 연결될 수 있으며, 일 실시예에서, 코드 익스포터는 코드에 데이터를 입력할 수 있는 디바이스이다. 예를 들어, 코드가 종이에 프린트된 2 차원 이미지, 또는 3 차원 프린트된 물체 또는 다 른 물체인 경우, 코드 익스포터는 프린터일 수 있다. 코드가 기입-불가능한 RFID 태그인 경우, 코드 익스포터는 기입-불가능한 RFID 태그를 생성할 수 있는 디바이스일 수 있다. 코드가 기입-가능한 RFID 태그인 경우, 코드 익스포터는 RFID 라이터일 수 있으며, 코드 익스포터는 또한 일부 실시예에서 코드 스캐너일 수 있다. 일부 실시예에서, 컴퓨팅 디바이스의 \"디스플레이\"는 상기 컴퓨팅 디바이스가 영상을 표시할 수 있는 수단에 의 해 상기 컴퓨팅 디바이스에 연결된 디바이스이다. 디스플레이에는 모니터, 스크린, 텔레비전 디바이스 및 프로 젝터가 포함되며 이에 국한되지 않는다. 컴퓨터 프로그램(컴퓨터 제어 로직이라고도 함)은 메인 메모리 및/또는 보조 메모리에 저장된다. 컴퓨터 프로그 램은 또한 통신인터페이스를 통해 수신될 수 있다. 이러한 컴퓨터 프로그램은 실행될 때, 프로세서 디바이스가 후술하는 시스템 실시예를 구현할 수 있게 한다. 따라서, 이러한 컴퓨터 프로그램은 시스템의 콘트롤러를 나타 낸다. 실시예가 소프트웨어를 사용하여 구현되는 경우, 소프트웨어는 컴퓨터 프로그램 제품에 저장될 수 있고, 이동식 저장 드라이브 또는 인터페이스, 하드 디스크 드라이브 또는 통신 인터페이스를 사용하여 컴퓨팅 디바이 스에 로딩될 수 있다. 컴퓨팅 디바이스는 또한 디바이스에 액세스가능한 데이터베이스에 데이터를 저장할 수 있다. 데이터베이스는 구 조화된 데이터 모음이다. 본원에 사용된 바와 같이, 데이터베이스는 \"NoSQL\" 데이터 스토어를 포함할 수 있으며, 이는 빠른 검색을 위해 키들의 공지된 세트(예: 어레이 인덱스)를 사용하는 어레이들과 같은 몇 가지 키-값 구조에 데이터를 저장한다. 다른 가능성은 관계형 데이터베이스이며, 이는 유용한 데이터 카테고리들을 나타내는 필드들에 저장된 데이터를 분할할 수 있다. 결과적으로 저장된 데이터 레코드는 데이터베이스 내에서 알려진 데이텀 카테고리 내에서 검색하여 해당 레코드에 저장된 데이터의 알려진 부분을 사용하여 신속하게 검 색될 수 있으며, 구조화된 질의 언어(Structured Query Language)와 같은 언어들을 이용하여 보다 복잡한 질의 들에 의해서 액세스될 수 있는바, 검색되는 데이터 간의 파라미터들 및 관련성들으로 전달된 제한 값들에 기초 하여 데이터를 검색할 수 있다. 이미지 매칭 질의들과 같은 보다 특수한 질의들을 사용하여 일부 데이터베이스 를 검색할 수도 있다. 데이터베이스는 임의의 디지털 메모리에 생성될 수 있다. 관련 기술 분야의 통상의 기술자는 또한 임의의 컴퓨팅 디바이스가 프로세서, 통신 인프라스트럭처, 적어도 메 인 메모리 및 일반적으로는 통신 인터페이스의 기능을 수행하기 위한 설비를 반드시 포함해야하지만, 모든 디바 이스가 이들 설비들을 별도로 하우징할 필요는 없다는 점을 능히 이해할 것이다. 예를 들어, 위에서 정의된 일 부 형태의 컴퓨팅 디바이스에서, 프로세싱 및 메모리는 신경망 또는 그리드에서와 같이 동일한 하드웨어 디바이 스를 통해 분배될 수 있으며, 따라서 통신 인프라스트럭처는 특정 하드웨어 디바이스의 구성의 속성이 될 수도 있다. 많은 디바이스들이 전술한 바와 같이 물리적인 작업 분할을 수행하지만, 당업자는 물리적 구성 요소들이 병합되는 경우에도 적용가능한 작업의 개념적 분리를 이해할 것이다. 시스템은 다양한 방식으로 전개될 수 있는바, 독립형 컴퓨팅 디바이스, 서버 네트워크와 같은 네트워크에서 함께 작동하는 일련의 컴퓨팅 디바이스들, 또는 웹 어플리케이션을 포함하여 다양한 방식으로 전개될 수 있다. 당업자는 인터넷과 같은 네트워크를 통해 기능하도록 설계된 특정 종류의 컴퓨터 프로그램 시스템으로 웹 어플 리케이션을 인식할 것이다. 웹 어플리케이션 플랫폼은 전형적으로 적어도 하나의 클라이언트 디바이스를 포함하 는데, 이는 전술한 바와 같은 컴퓨팅 디바이스이다. 클라이언트 디바이스는 소정 형태의 네트워크 연결을 통해 인터넷과 같은 네트워크에 연결된다. 네트워크는 컴퓨팅 디바이스를 서로 연결하는 임의의 구성일 수 있으며, 전화, 케이블 및 광섬유 네트워크를 포함하는 국지적 및 국제적 유선 네트워크, 셀룰러 통신 및 데이터 네트워 크를 포함하는 전자기 방사 신호를 이용하여 정보를 교환하는 무선 네트워크 및 이들 유무선 네트워크의 임의의 조합을 포함하지만, 이에 한정되는 것은 아니다. 또한, 네트워크에 연결되는 것은, 노드 서버와 같은 적어 도 하나의 서버이며, 이는 전술한 바와 같은 컴퓨팅 디바이스이거나 또는 서로 통신하고 로컬 또는 네트워크 연 결에 의해 함께 작동하는 컴퓨팅 디바이스들의 세트이다. 물론, 관련 기술 분야의 통상의 기술자는 웹 어플리케 이션이 다수의 서버 및 광범위하고 지속적으로 변화하는 클라이언트 디바이스의 집단에서 실행될 수 있고, 전형 적으로는 그렇게한다는 것을 인식할 것이다. 클라이언트 디바이스와 서버의 컴퓨터 프로그램은 웹 어플리케이션 에 필요한 기능을 수행하도록 두 디바이스를 구성한다. 웹 어플리케이션은 그것의 웹 어플리케이션 프로그램에 의해 이들 작업들을 수행하도록 구성된 서버에 의해서 프로세싱 작업의 대부분을 수행하도록 설계될 수 있거나 또는 대안적으로 클라이언트 디바이스에 의해 수행되도록 설계될 수 있다. 일부 웹 어플리케이션은 클라이언트 디바이스가 서버에서 전송한 콘텐츠만 디스플레이하도록 설계될 수 있으며, 서버가 모든 프로세싱, 비즈니스 로 직 및 데이터 저장 작업을 수행한다. 이러한 \"씬 클라이언트(thin client)\" 웹 어플리케이션은 때때로 \"클라우 드\"어플리케이션이라고 지칭되는바, 이는 본질적으로 모든 계산 작업들은 클라이언트에게 (종종 다이어그램으로 클라우드로 표시되는) 단일 불투명 엔티티로만 보이는 일련의 서버들 및 데이터 센터들에 의해 수행되기 때문이 다. 본 명세서에 정의된 바와 같이, 많은 컴퓨팅 디바이스는 웹 브라우저로 알려진 특수화된 프로그램을 구비하며, 이는 임의의 추가적인 프로그래밍없이, 서버에 의해 출력된 데이터를 적어도 수신 및 디스플레이하기 목적으로 이들 컴퓨팅 디바이스들이 클라이언트 디바이스로서 작동할 수 있게 한다. 또한, 웹 브라우저는 클라이언트 디바이스에서 수행하는 만큼 많은 웹 어플리케이션을 구동하는 플랫폼으로서 역할을 할 수 있으며, 그리고 클라이 언트 디바이스에서 실행되도록 계산된 웹 어플리케이션의 일부를 웹 브라우저에서 완전히 작동하도록 작성하는 것이 일반적이다. 이러한 브라우저-실행 프로그램은 본 명세서에서 \"클라이언트측 프로그램\"으로 지칭되며, 서 버가 브라우저로 전송하는 다른 컨텐츠와 함께 서버로부터 브라우저로 종종 로딩된다. 하지만, 웹 브라우저에서 는 실행되지 않지만 여전히 컴퓨팅 디바이스로 하여금 웹 어플리케이션 클라이언트로서 동작하게 하는 프로그램 을 작성하는 것도 또한 가능하다. 따라서, 일반적으로, 웹 어플리케이션은 클라이언트 디바이스(또는 디바이스 들) 및 서버 둘다의 일부 컴퓨터 프로그램 구성을 요구한다. 컴퓨팅 디바이스의 시스템 상의 웹 어플리케이션 컴포넌트를 포함하는 컴퓨터 프로그램은 프로그래머가 해당 디바이스에 할당하기로 선택한 전체 웹 어플리케이"}
{"patent_id": "10-2020-7020581", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "션의 기능들 중 일부를 수행하도록 그 디바이스의 프로세서를 구성한다. 해당 기술분야의 당업자라면 다음을 능 히 이해할 것인바, 하나의 디바이스에 할당된 프로그래밍 작업은 견고성, 유연성 또는 성능을 위해 다른 디바이 스에 할당된 프로그래밍 작업들과 중첩될 수 있다. 또한, 본 명세서에 사용된 웹 어플리케이션의 가장 잘 알려 진 일례는 월드 와이드 웹에 의해 대중화된 일종의 하이퍼 텍스트 마크업 언어 프로토콜을 사용하고 있지만, 당 업자는 본 명세서에 정의된 웹 어플리케이션을 또한 지원하는 파일 전송 프로토콜과 같은 다른 네트워크 통신 프로토콜도 알고 있을 것이다. 암호화 방법(Encryption Method) 이제 도 3에 도시된 방법 단계를 참조하면, 본 컴퓨팅 디바이스는 컴퓨팅 디바이스 또는 그 데이터를 보호하기 위해 하나 이상의 보안 수단을 이용할 수 있다. 예를 들어, 컴퓨팅 디바이스는 암호화 시스템을 사용하여 데이 터를 보호할 수 있다. 일 실시예에서, 암호화 시스템은 데이터를 제 1 형태로부터 제 2 형태로 변환하는 시스템 이며, 여기서 제 1 형태는 \"평문(plaintext)\"으로서 그것의 의도된 포맷으로 볼 때 이해될 수 있는 것이며며, 제 2 형태는 \"암호문(cyphertext)\"으로서 동일한 방식으로 보았을 때 이해될 수 없는 것이다. 암호문 (cyphertext)은 먼저 평문으로 다시 변환하지 않는 한 임의의 포맷에서 이해될 수 없다. 일 실시예에서, 평문을 암호문으로 변환하는 프로세스를 \"암호화\"라고 지칭한다. 암호화 프로세스는 평문을 변경하기 위해 \"암호화 키\"라고 하는 데이터를 사용하는 것을 수반할 수 있다. 암호화 시스템은 또한 암호문을 다시 평문으로 변환할 수 있는데, 이는 \"암호 해독(decryption)\"으로 알려진 프로세스이다. 암호 해독 프로세스는 암호문을 원래의 평 문 헝태로 되돌리기 위하여 \"암호 해독 키\"라고 하는 데이터를 사용하는 것을 수반한다. \"대칭\"인 암호화 시스 템의 실시예에서, 암호 해독 키는 본질적으로 암호화 키와 동일하다. 어느 하나의 키를 소유하면 추가적인 비밀 지식 없이도 다른 하나의 키를 신속하게 추론할 수 있다. 대칭적인 암호화 시스템의 암호화 키 및 암호 해독 키 는 비밀로 유지될 수 있으며 그리고 암호화 시스템의 사용자가 암호문을 해독할 수 있기를 원하는 개인이나 단 체와 공유될 수 있다. 대칭적인 암호화 시스템의 일례는 고급 암호화 표준(Advanced Encryption Standard: AES)이며, 이는 평문을 매트릭스들로 배열한 다음, 암호화 키를 사용하여 반복 순열 및 산술 연산을 통해 상기 매트릭스를 수정한다. \"비대칭\"인 암호화 시스템의 실시예에서, 대응하는 암호 해독 키 또는 암호 키를 소유한 경우에도, 추가적인 비 밀 지식없이는 암호화 키 또는 암호 해독 키를 쉽게 추론할 수 없다. 일반적인 일례는 \"공개 키 암호화 시스 템\"으로서, 공개 키 암호화 시스템에서는 암호화 키를 소지한 경우에도 암호 해독 키를 실제로 용이하게 추론하 는 것이 불가능하므로, 암호화 키가 안전하게 대중에게 이용될 수 있다. 공개 키 암호화 시스템의 일례는 RSA 이다. RSA에서 암호화 키는 매우 큰 소수들의 곱들인 숫자들을 사용하는 반면에, 암호 해독 키는 이들 매우 큰 소수들을 사용한다. 따라서, 암호화 키로부터 암호 해독 키를 추론하는 것은, 2 개의 매우 큰 소수들의 곱인 숫 자의 소인수들을 계산하는 실질적으로 실현불가능한 계산량을 요구한다. 또 다른 일례는 타원 곡선 암호화 (elliptic curve cryptography)로서, 여기서는 다음과 같은 사실에 의존하는바, 유한 필드 위의 타원 곡선 상에 두 개의 점 P와 Q가 주어지고, A + B = R 인 합상에 대한 추가 정의, 여기서 \"0\"은 타원 곡선을 포함하는 투영 평면에서 무한대의 점이며, 올바르게 선택된 타원 곡선, 유한 필드 및 P 및 Q에서 P 자체를 k 번 더함으로써 Q 가 되는 숫자 k를 찾아내는 것은 계산적으로 현실적이지 않다라는 점에 기초한다. 하나 이상의 클라이언트 디바이스들 및 하나 이상의 서버들은 클라이언트로부터 서버로 또는 그 반대로 데이터 가 전송될 수 있는 임의의 프로토콜을 사용하여 통신할 수 있다. 비제한적인 일례로서, 클라이언트 및 서버는 인터넷 프로토콜 슈트(internet protocol suite)를 이용하여 데이터를 교환할 수 있고, 이는 전송 제어 프로토 콜(TCP) 및 인터넷 프로토콜(IP)을 포함하며, 종종 TCP/IP로 지칭된다. 일부 실시예에서, 클라이언트 및 서버는 전술한 바와 같은 암호화 시스템을 사용하여 데이터를 교환하기 전에 데이터를 암호화한다. 일실시예에서, 클라 이언트 및 서버는 공개 키 암호화를 사용하여 데이터를 교환하는바, 예를 들어, 클라이언트와 서버는 각각 공개 키와 개인 키를 생성하고 공개 키를 교환하며 서로의 공개 키를 사용하여 데이터를 암호화하는 반면에, 서로의개인 키를 사용하여 데이터를 해독할 수 있다. 일부 실시예에서, 디지털 인증서를 사용하여 클라이언트가 서버를 인증하거나 서버가 클라이언트를 인증한다. 일실시예에서, 디지털 인증서는 정보를 전달하고 전달된 정보를 공개 키 암호화 시스템에서 공개 키의 발급자인 \"인증 기관\"에 링크하는 파일이다. 일부 실시예에서, 인증서는 수신자가 작업을 수행할 수 있도록인증 기관의 권한을 전달하는 데이터를 포함한다. 권한은 주어진 데이터에 액세스하기 위한 권한일 수 있다. 권한은 주어진 프로세스에 액세스하기 위한 권한일 수 있다. 일부 실시예들에서, 인증서는 인증 기관을 식별할 수 있다. 링크(linking)는 디지털 서명의 형성에 의해 수행될 수 있다.일 실시예에서, 디지털 서명은 공개 키 암호화 시 스템의 개인 키를 사용하는 파일의 암호화된 수학적 표현이다. 서명이 검증될 수 있는바, 대응하는 공개 키를 사용하여 암호화된 수학적 표현을 해독하고, 해독된 표현을 암호화되지 않은 취지된 매치와 비교함으로써 검증 될 수 있으며, 만일 서명 프로토콜이 제대로 설계되고 올바르게 구현된다면, 이는 디지털 서명을 생성하는 능력 은 개인 암호 해독 키를 소유하는 것과 동등함을 의미한다. 마찬가지로 파일의 수학적 표현이 잘 설계되고 올바 르게 구현된 경우 파일을 변경하면 디지털 서명과 매칭되지 않을 것이다. 수학적 표현은 해싱 알고리즘과 같은 변경에 민감하고, 안정적으로 재현가능한 알고리즘을 사용하여 생성될 수 있다. 서명이 비교될 수 있는 수학적 표현은 검증 목적으로 서명에 포함될 수도 있으며, 다른 실시예들에서, 수학적 표현을 생성하는데 사용된 알고 리즘은 공개적으로 이용가능하며, 이는 임의의 파일에 대응하는 수학적 표현의 용이한 재생을 허용한다. 일부 실시예들에서, 개인 키의 소유자가 특정 엔티티임을 검증하기 위해 인증 기관으로 알려진 제3자가 이용될 수 있 다. 따라서, 인증 기관이 신뢰할만 하고 그리고 개인 키가 도난당하지 않은 경우, 디지털 서명을 생성할 수 있 는 엔티티의 능력은 엔티티의 신원을 보장할 수 있으며 그리고 검증가능한 방식으로 파일을 엔티티에 링크시킬 수 있다. 디지털 서명은 발급하는 인증 기관의 권한에 의해 개인 키를 소유한 엔티티를 인증하는 문서인 디지털 인증서에 통합될 수 있으며, 해당 개인 키로 생성된 디지털 서명과 인증서 나머지 부분의 수학적 표현으로 서명 된다. 다른 실시예들에서, 디지털 서명은 디지털 서명을 의도적으로 서명한 엔티티에 의해 생성된 것으로 알려 진 서명과 디지털 서명을 비교함으로써 검증되고, 예를 들어, 알려진 서명을 해독하는 공개 키가 디지털 서명도 해독하는 경우, 상기 디지털 서명은 검증된 것으로 간주될 수 있다. 디지털 서명은 또한 디지털 서명이 형성된 이후로 파일이 변경되지 않았음을 검증하는데 사용될 수 있다. 서버와 클라이언트는 공개 키 암호화, 개인 키 암호화 및 디지털 인증서를 결합한 보안을 사용하여 통신할 수 있다. 예를 들어, 클라이언트는 서버가 제공한 디지털 인증서를 사용하여 서버를 인증할 수 있다. 서버는 클라 이언트가 제공한 디지털 인증서를 사용하여 클라이언트를 인증할 수 있다. 성공적인 인증 후, 디지털 인증서를 수신한 디바이스는 디지털 인증서를 제공한 디바이스의 개인 키에 해당하는 공개 키를 소유한다. 인증을 수행한 디바이스는 공개 키를 사용하여 인증서를 발급한 디바이스에게 비밀(secret)을 전달할 수 있다. 비밀은 클라이 언트와 서버 사이의 개인 키 암호화 통신을 설정하기 위한 기초로 사용될 수 있다. 예를 들어, 비밀은 개인 키 암호화 시스템을 위한 개인 키일 수 있다. 비밀은 개인 키가 도출될 수 있는 데이터일 수 있다. 다음으로, 클라 이언트와 서버는 통신중인 교환이 종료될 때까지 개인 키 암호화 시스템을 사용하여 정보를 교환할 수 있다. 일 부 실시예들에서, 이러한 핸드셰이크 및 보안 통신 프로토콜은 SSL(Secure Sockets Layer) 프로토콜을 사용하여 구현된다. 다른 실시예들에서, 프로토콜은 TLS(Transport Layer Security) 프로토콜을 사용하여 구현된다. 서버 와 클라이언트는 HTTPS(Hyper-Text Transfer Protocol Secure)를 사용하여 통신할 수 있다. 도 3에 도시된 실시예에서, 서명 및 암호화된 개인 거래 데이터는. 해시를 생성하고, 제 1 사용자의 개 인 키로 서명하고 그리고 제 1 사용자의 공개 키 및 해시 함수를 첨부함으로써 제 1 사용자 A로부터 제 2 사용자 B로 전송된다. 개인 거래 데이터는 대칭 키로 암호화되고 대칭 키는 제 2 사용자의 공개 키로 암호화된다. 그 후 서명되고 암호화된 개인 거래 데이터는 제 2 사용자 B에게 전송된다. 블록체인(Blockchain) 일 실시예에서, 블록체인은 하나 이상의 새로운 거래를 블록으로 알려진 데이터 아이템에 기록하는 거래 레지스 터 또는 원장(ledge)이다. 상기 블록들은, 시간 순서대로 블록들을 배치하고 그리고 각각의 블록(b)을 시간 순 서로 이전 블록(a)에 링크하는 방식으로 생성될 수 있으며, 따라서 임의의 컴퓨팅 디바이스는 역 시간 순서로 블록들을 가로질러서 블록체인에 나열된 모든 거래들을 검증할 수 있다. 일례로서, 각각의 새로운 블록(b)은 이 전 블록(a)을 서술하는 암호화 해시를 포함할 필요가 있을 수 있다. 일부 실시예에서, 블록체인은 \"제네시스 블 록\"으로 알려진 단일 제 1 블록을 포함한다. 새로운 블록(b)의 생성은 계산 비용이 많이들 수 있다. 예를 들어, 새로운 블록(b)의 생성은 블록체인을 형성 하는 모든 참여자들에 의해 수용되는 프로토콜에 의해서 설계될 수 있으며, 생성하기 위해 특정 시간 기간 동안컴퓨팅 디바이스들의 강력한 세트가 필요하다. 하나의 블록(a)이 소정 세트의 컴퓨팅 디바이스들이 상기 블록 (a)을 생성하는데 더 적은 시간이 걸리는 경우, 더 많은 단계들이 요구되도록 프로토콜은 다음 블록(b)를 생성 하는 알고리즘을 조정할 수 있다. 하나의 블록(a)이 소정 세트의 컴퓨팅 디바이스들이 상기 블록(a)을 생성하는 데 더 많은 시간이 걸리는 경우, 더 적은 단계들이 요구되도록 프로토콜은 다음 블록(b)를 생성하는 알고리즘을 조정할 수 있다. 일례로서, 프로토콜은 새로운 블록(b)이 그 내용을 서술하는 암호 해시를 포함할 것을 요구할 수 있다. 암호 해시는 수학적 조건을 만족시킬 것이 요구될 수 있으며, 이는 블록(b)가 논스(nonce)라 지칭되는 숫자를 포함함으로써 달성되며, 그 값은 수학적 조건을 만족하는 해시의 발견이라는 사실 이후에 결정된다. 상 기 일례를 계속하면, 프로토콜은, 블록을 설명하고 수학 조건을 만족하는 해시의 발견이 이전 해싱 시도의 결과 에 따라 더 많거나 적은 단계를 요구하도록 수학 조건을 조정할 수 있다. 예를 들어, 수학적 조건은 해시에 소 정 개수의 리딩 제로(leading zeros)가 포함되어 있고 더 많은 수의 리딩 제로를 포함하는 해시를 찾기 위해 더 많은 단계가 필요한 해싱 알고리즘 및 더 적은 수의 리딩 제로를 포함하는 해시를 찾기 위해 더 적은 단계가 필 요한 해싱 알고리즘일 수 있다. 일부 실시예에서, 프로토콜에 따른 새로운 블록(b)의 생성은 \"채굴(mining)\" 이 라 지칭된다. 일부 실시예에서, 프로토콜은 또한 새로운 블록을 채굴하도록 인센티브를 생성할 수 있다. 인센티브는 재정적일 수 있다. 예를 들어, 새로운 블록(b)를 성공적으로 채굴하는 경우, 상기 블록(b)를 채굴한 개인 또는 엔티티는 기결정된 액수의 화폐, 가령, 피아트 화폐 또는 암호 화폐를 받을 수 있다. 다른 실시예에서, 인센티브는 특정 제품 또는 서비스로 상환될 수 있다. 인센티브는 예를 들어 특정 업체의 상품권일 수도 있다. 일부 실시예들에 서, 인센티브는 참가자들이 블록의 생성을 위해 서로 경쟁함으로써 인센티브를 위해 경합하게 할 정도로 충분히 매력적이다. 블록체인에서 생성된 각 블록(b)은 블록(b)을 성공적으로 채굴한 결과로서 가상 화폐와 같은 인센 티브를 수신한 하나 이상의 어드레스를 서술하는 레코드 또는 거래를 포함할 수 있다. 2 개의 엔티티가 동시에 새로운 블록들을 생성하는 경우, 블록체인은 포크(fork)를 개발할 수 있다. 프로토콜은 일정 시간이 지난 후 어느 브랜치가 더 긴지를 평가함으로써, 포크에서 2 개의 대안적인 브랜치들 중 어느 것이 블록체인의 유효한 새로운 부분인지를 결정할 수 있다. \"길이\"는 분기 내의 블록들의 개수에 따라 측정될 수 있 다. 길이는 브랜치를 생성하는 총 계산 비용에 따라 측정될 수 있다. 프로토콜은 유효한 브랜치에 포함된 거래 만을 유효한 거래로서 취급할 수 있다. 이러한 프로토콜에 따라 브랜치가 유효하지 않은 것으로 발견되면, 해당 브랜치에 등록된 거래는 유효한 브랜치의 신규 블록에서 재작성될 수 있다. 이러한 프로토콜은 \"이중 지출 (double spending)\" 거래를 거부할 수 있다. 결과적으로 일부 실시예들에서, 사기(fraudulent) 거래의 생성은 나머지 참가자들에 의해 생성되는 브랜치보다 사기 거래를 시도하는 엔티티에 의해서 더 긴 블록체인 브랜치의 생성을 요구하고, 사기 거래를 생성하는 엔티티가 사기 거래를 포함하는 브랜치를 만들려는 인센티브가 있는 유 일한 경우라면, 해당 브랜치를 만들기 위한 계산 비용이 현실적으로는 실현불가능하므로, 블록체인의 모든 거래 의 유효성을 보장할 수 있다. 일부 실시예에서, 블록(a-b)을 생성하는 알고리즘이 잘 설계된 해싱 알고리즘을 사용하는 암호화 해시를 포함하는 경우, 이전에 생성된 블록에 사기 거래를 단순히 삽입함으로써 해시들을 생성 하는데 필요한 계산 작업을 회피하려는 시도들은, \"애벌랜치 효과(avalanche effect)\"에 의해서 저지될 수 있으 며, 애벌랜치 효과에 의하면 블록체인 내의 임의의 데이터를 조금만 변경해도 블록 체인의 출력이 크게 변경되 며, 이는 시도한 사기성 블록의 해시를 검증하려는 임의의 사람이 변경들을 쉽게 감지할 수 있음을 의미한다. 다른 실시예에서, 거래 레지스터(a)는 대안(alternative) 체인이다. 일실시예에서, 대안 체인은 블록체인에 통 합되는 하나 이상의 블록으로서, 대안 체인의 데이터를 나타내는 적어도 하나의 해시를 채굴된 블록체인의 적어 도 하나의 블록에 포함시킴으로써 블록체인에 통합되는 하나 이상의 블록이다. 새로운 블록을 생성하는데 수반 되는 수학적 퍼즐이 신규 해시의 생성인 경우, 블록 내의 추가 해시는 난이도에 영향을 미치지 않을 수 있으며, 따라서 채굴자는 대안 체인을 통합하는 계산상의 단점을 갖지 않는다. 대안 체인은 하나 이상의 머클 트리 (Merkle tree)를 사용하여 통합될 수 있다. 머클 트리는 대안 체인의 각각의 데이텀의 해시를 리프 노트(leaf notes)로서 포함하는 구조일 수 있으며, 각 내부 노드는 모든 하위 노드의 해시를 포함한다. 따라서, 애벌랜치 원리에 의해, 머클 트리의 루트는 머클 트리 내에 해시된 모든 데이터를 재귀적으로 나타내는 해시일 수 있으며 (따라서 대체 체인의 데이터 세트), 따라서 블록 체인의 블록에 루트를 통합하면 머클 트리가 나타내는 대안 체 인의 데이터를 통합할 수 있다. 채굴자는 채굴자가 채굴한 블록에 대안 체인을 통합하는 것에 대한 요금을 청구 할 수 있다. 일실시예에서, 대안 체인에 제출된 거래의 검증은 먼저, 거래를 대안 체인에 위치시키고, 그것의 디지털 서명을 검증하고, 그 위치와 블록체인 블록 사이의 각각의 해시를 검증하고(예를 들어, 거래에 해당하는 리프에서 루트까지 머클 트리 내의 각각의 해시를 검증함으로써), 대안 체인을 포함하는 블록의 해시를 검증하 고, 그리고 위에서 설명한대로 블록체인의 블록을 검증하는 것을 포함한다. 일실시예에서, 가상 거래들은 암호 화폐의 형태인 화폐를 추적한다. 일 실시예에서, 암호 화폐는 비트코인, 피 어코인(Peercoin), 네임코인 및 라이트코인과 같은 같은 디지털 화폐이다. 암호 화폐는 비-중앙집중형 (decentralized)일 수 있으며 특정 엔티티가 이를 제어하지 않는다. 암호 화폐의 무결성은 교환 및 새로운 화폐 생산을 위해 확립된 프로토콜을 참가자들이 준수함으로써 유지될 수 있으며, 이는 암호 화폐를 구현하는 소프트 웨어에 의해 시행강제될 수 있다. 암호 화폐는 그 프로토콜이 특정 엔티티에 의해 시행되거나 호스팅되는 중앙 집중형이 될 수도 있다. 국가 은행과 같은 중앙 통제 기관 대신에, 화폐 가치를 관리하기 위하여, 특정 암호 화 폐의 유닛들의 개수가 제한될 수 있다. 암호 화폐의 유닛들이 시장에 진입하는 속도는 상호-합의된 프로세스(가 령, 수학적 퍼즐이 풀릴 때 새로운 화폐 유닛이 생성되는 것)에 의해 관리될 수 있다. 퍼즐의 난이도는 새로운 유닛이 시장에 진입하는 속도를 제어하기 위해 조절될 수 있다. 수학적 퍼즐은 계산이 어려운 블록체인에서 블 록을 생성하는데 사용되는 알고리즘과 동일할 수 있다. 블록 생성에 대한 인센티브는 채굴자에게 새로운 암호 화폐를 부여하는 것을 포함할 수 있다. 암호 화폐의 수량은 전술한 바와 같이 암호 화폐 거래를 사용하여 교환 될 수 있다. 일부 실시예에서, 암호 화폐의 소유자는 자신의 화폐를 암호 화폐 지갑에 보관하며, 상기 지갑은 암호 화폐를 저장하는 임의의 시설로 정의된다. 암호 화폐의 저장은 소유자가 수신한 암호 화폐와 관련된 공개 및 개인 키의 저장일 수 있다. 일부 실시예들에서, 사용자는 가상 지갑에 암호 화폐를 저장하며, 이는 \"암호 화폐 뱅크\"에 대 응한다. 가상 지갑은 인터넷을 통해 위치한 거래소 및 회사이다. 가상 지갑은 지불로서 피아트(fiat)를 수락하 고 그리고 사용자의 가상 계좌에 보관하도록 사용자에게 암호 화폐 또는 기타 선택된 암호 화폐를 제공할 수 있 다. 다른 실시예들에서, 사용자는 로컬 지갑에 암호 화폐를 보관할 수 있는바, 로컬 지갑은 사용자가 원하는 방 식으로 물리적으로 이동 및 저장할 수 있는 저장 디바이스(즉, 하드 드라이브, 메모리 디바이스)이다. 로컬 지 갑을 가진 사용자가 자신의 암호 화폐를 사용하려면 지갑 소프트웨어가 설치된 컴퓨터 디바이스에 다시 연결해 야만하며 이후 사용자는 암호 화폐를 이동할 수 있다. 다른 실시예들에서, 사용자는 암호 화폐와 관련된 하나 이상의 주소를 물리적 형태로 저장하는 물리적 지갑에 암호 화폐를 보관하고, 뿐만 아니라 사용자가 자신의 로 컬 지갑 저장 디바이스 또는 가상 지갑으로부터 자신의 암호 화폐를 프린트하는 종이 지갑과 같이, 아래에 설명 된 바와 같은 지출을 허용하는 대응하는 개인 키를 보관한다. 종이 지갑은 하나 이상의 QR 코드들이 있는 종이 조각일 수 있으며, 스캔되면 로컬 지갑 또는 가상 지갑에 넣어지거나 또는 QR 코드를 POS 시스템으로 바로 스캔 하여 사용할 수 있다. 물리적 지갑은 상술한 바와 같이 코드 스캐너에 의해 판독가능한 임의의 코드로 암호 화 폐와 관련된 개인 및 공개 키를 보관할 수 있다. 지갑은 \"콜드 스토리지(cold storage)\" 또는 \"핫 스토리지\"를 가질 수 있다. 비트코인 지갑에 대한 해킹 및 절 도가 만연해진 다음에 회사들은 \"콜드 스토리지\"를 만들었다. \"콜드 스토리지\"는 인터넷에 연결되지 않은 위치, 종종 가상 지갑이 보관된 곳에 위치하고 있지도 않은 곳에 암호 화폐를 저장하는 것이다. 가상 지갑은 그 내용물이 가상 지갑을 통해 해커에 노출될 수 있으므로 \"핫 스토리지\" 또는 \"핫 지갑\"이라 지칭된다. 이들 \"핫 지갑\"은 사용되는 동전들로 가득하다. 핫 지갑 및 콜드 지갑에 대한 참조는 이제 지갑 회사의 주류이다. 핫 지 갑과 콜드 지갑의 비율은 보통 10% 또는 20%의 핫 지갑과 80 % ~ 90 %의 콜드 지갑이다. 내부적으로 지갑들 사 이에서 가상으로 또는 물리적으로 전송하여 보안을 확신한다. 결국, 모든 종류의 암호 화폐 지갑은 블록체인으 로 확인된 개인 키 및 공개 키를 저장하지만 자금이나 명목 화폐(fiat currency)와 동일하다. 일부 실시예에서, 거래와 관련된 개인 키는 개인 레지스터에서 유지된다. 개인 레지스터는 제 1 컴퓨팅 디바이 스가 개인 키를 신속하게 검색할 수 있게하는 데이터 저장소 또는 데이터 구조를 포함할 수 있다. 개인 레지스 터(b)는 전술한 바와 같은 데이터베이스를 포함할 수 있다. 개인 레지스터는 공개 키를 또한 포함할 수 있다. 개인 레지스터는 공개 키를 그들의 대응하는 개인 키에 링크할 수 있다. 개인 레지스터는 인증서를 포함하거나 또는 개인 레지스터에서 개인 및 공개 키를 발행한 하나 이상의 인증 기관으로부터 인증서를 생성하는데 필요한 정보를 포함할 수 있다. 개인 레지스터는 인증서 또는 인증서를 생성하기 위한 정보를 해당 개인 키 또는 공개 키에 링크할 수 있다. 당업자는 하나의 데이터를 관련 데이터에 링크시키는 다양한 방법들을 알고있을 것이다. 예를 들어 개인 키, 해당 공개 키 및 발급 인증 기관을 식별하는 정보는 개인 레지스터에 포함된 데이터베이스 의 데이터베이스 로우(row)에 있는 3 개의 셀일 수 있으며, 따라서 3 개 중 임의의 것을 지정하는 쿼리 또는 3 개 중 임의의 것을 포함하는 데이터 세트를 사용하여 상기 로우를 검색하면 다른 2개가 생성될 것이다. 개인 레 지스터는 추가 데이터를 포함할 수 있다. 예를 들어, 개인 레지스터는 각각의 개인 키 또는 공개 키를 포함하는 거래들을 서술하는 기록들, 거래와 관련된 엔티티들을 식별하는 정보, 또는 거래가 전달된 어드레스를 식별하는 정보를 포함할 수 있다. 본 개시의 일 실시예에서, 블록체인은 하나 이상의 사이드 블록체인을 수반하거나 이를 통해 구축될 수 있다. 이러한 사이드 블록체인들은 각각 블록체인 내의 소정의 블록 또는 엔트리로부터 유래 또는 발원할 수 있으며 그리고 오리지널 블록체인이 다양한 엔드 포인트들을 포함하도록 바깥쪽으로 확장될 수 있다. 예를 들어, 블록 체인은 5 개의 블록체인들을 포함할 수 있는바, 여기서 은 소정의 부품/제품의 원료에 대한 항목(entry)이고, 는 소정의 부품/제품의 프로세싱에 대한 항목이며, 은 소정의 부품/제품의 프로세싱 엔 티티이며, 는 소정의 부품/제품과 관련된 특허이며,는 프로세싱 엔티티에 지불된 비용이다. 원료 공급자 를 식별하는 새로운 블록체인이 블록체인 1에 추가될 수 있으며, 또는 소정의 부품/제품에서 프로세싱을 수행하 는 기계류의 인증을 나타내는 새로운 블록체인이 블록체인 3에 추가될 수 있다. 따라서, 실시예들은 단순히 제 5 블록체인의 말단에 블록체인을 추가하는 것이 아니라, 이들 5 개의 블록체인 중 임의의 하나로부터 새로운 블 록체인이 추가될 수 있어 특정 블록체인과 관련된 정보를 제공할 수 있다. 다른 일례에서, 소정의 부품/제품은 다수의 블록들을 갖는 메인 블록체인에 의해서 표현될 수 있으며, 여기서 블록체인의 각각의 블록은 소정의 부품/제품 조각과 관련된다. 각각의 조각은 다른 공급자들로부터 공급되었을 수 있으며, 각각의 조각은 다른 원재료들, 다른 제조 공정들, 그 안에 구현된 다른 지적 재산권들 및 서로 다른 가격들 등과 같은 그 자체의 관련된 제품 정보를 가질 수 있다. 이와 관련하여, 메인 블록체인의 각각의 블록은 소정 부품/제품의 조각과 관련될 수 있고 그리고 사이드 블록체인은 그 특정 조각 제품 정보를 나타내는 메인 블록체인으로부터 바깥쪽으로 연장될 수 있다. 도 2에 도시된 실시예에서, 제 1 사용자 A로부터 제 2 사용자 B 로의 블록체인 거래는 먼저 해시를 생성함 으로써 원장에 기록된다. 그런 다음, 제 1 사용자 A는 제 1 사용자의 개인 키로 상기 해시에 서명한다. 제 1 사용자의 공개 키 및 제 2 사용자 B의 어드레스가 첨부된다. 제 2 사용자 B의 공개 키 및 어드레스가 획득되고, 그리고 거래는 원장에 기록된다. 추적성을 구비한 가상 분산 원장 시스템의 개요 이제 도 1 내지 도 34로 넘어가서, 특히 도 1 내지 도 5B를 참조하면, 본 발명은 적어도 요구 정의로부터 최종 고객 혹은 사용자로 최종 부품이 전달되는 것까지 프로세싱 단계들을 통해 부품이 이동함에 따라, 적층 제 조된 부품들(additively manufactured parts)(때때로 3D 프린팅으로 알려짐)의 개별 프로세스 단계들의 만족스러운 완성을 투명하고 안전하게 확보하기 위한 시스템을 포함한다. 새로 프린트된 적층 제조된 부품 에 대한 기록(record)의 주요 프로세스 단계들은, 가상 재고(virtual inventory) 또는 원장 거래(ledger transaction)로 간주될 수 있으며, 여기서 블록 데이터는 가상 재고로부터 얻어지고, 소정의 프로세스 단계에서 신규 상태로 변환되며, 그리고 신규 상태에서 소정의 프로세스 단계의 성공적인 완료 이후에 재고로 반환되는바 이는 원장에 기록된다. 비록, 본 발명은 적층 제조된 부품의 일례에 촛점을 맞추고 있지만, 실질적으로 동 일하거나 유사한 프로세스 단계들은 전통적인(혹은 감산형: subtractive) 제조 부품에도 적용될 수 있다. 각각의 가상 재고 거래는 퍼블릭, 프라이빗, 세미-프라이빗 블록체인 원장에 기록되는바, 성공적인 프로세스 완 료, 상태 변화, 및 각각의 재고 포인트에서의 신뢰성을 입증하도록 투명하고, 안전하고, 그리고 추적가능한 방 식으로 기록된다. 반복 프린트 적층 제조된 부품을 위한 주요 프로세스 단계들 및 기록 상태들이 아래에 설명된 다. 이 경우, 적층 제조된 부품에 공급된 오리지널 추적가능한 소스 데이터는 블록체인 원장에 기록된 거래 과 함께 반복 부품(repeat parts)을 생성하기 위해 연속적으로 재사용될 수 있다. 따라서, 소스 요구들에 대한 출처(provenance), 신뢰성(authenticity) 및 추적성은 연속 생산에서 유지된다. 본 발명은 전-디지털(all-digital) 워크 플로우를 지원하기 위해 블록체인 기술을 적용하며, 따라서 완전히 추 적가능하고 오리지널 고객 및 제조업자 요구들에 대해 검증될 수 있는 최종 서비스가능 상품 또는 교체 부품을 생성하기 위한 인증된 프로세스들에 후속하여, 최종 사용자는 라이센싱된 부품을 자신의 검증 된 프린터에서 프린트할 수 있다. 고유한 식별 거래 식별자(예를 들어, 프로세스 해시를 나타내는 QR 코드를 사용하는 것)는 프린트된 부품 상에 또는 그 내에 인코딩될 수 있으며, 또는 프로세스 단계들 동안 필요에 따라 다른 방식으로 마킹될 수 있다. 이러한 것은 제조 공정에서 달성되거나 또는 예를 들어 성공적인 최종 검사 이후 레이저 마킹을 통해 달성될 수 있다. 본 발명의 바람직한 실시예는 적층 제조에서 소스 요구들(source requirements)에 대해서 부품이 추적될 수 있 게 한다. 이러한 것은 추적성 체인을 모듈들로 분리함으로써 달성되는바, 공급망 내의 상기 모듈들의 위치는 전 -디지털 워크플로우 내에서 최종 사용자의 요구에 맞게 필요에 따라 재사용될 수 있으며 전세계적으로 전송될 수 있다. 개시된 가상 분산 재고 관리 또는 원장 시스템은 첨부된 도면에 블록으로 표시되는 문제의 대상 부품들의 상이한 상태들로 이어지는 복수의 주요 프로세스 단계들을 이용한다. 모든 주요 프로세스 단계들은, 한 단계에 서 다음 단계로 프로세스의 작업 출력을 형성하도록 프로세스에 의해 변환되는 상태들 및 프로세스에 대한 입력 들과 함께, 수행할 작업을 나타낸다. 프로세스 단계 완료 및 다음 단계로의 전송은 가상 변환으로 정의된다. 개시된 가상 원장 시스템의 프로세스/상태 관리 시스템은, 블록체인 또는 투명 분산 서버 네트워크 상 의 다른 공개 원장 시스템과 같은 디지털 거래 원장에 영구적으로 시퀀싱되고 기록되는 일련의 거래들 을 통해 추적가능한 기록을 유지한다. 위조할 수 없는 방식으로 거래들을 암호화하고 기록하는데 사용되는 공개 -개인 패스키(passkey)를 통해 거래의 보안성과 신뢰성이 활성화되고 강화된다. 거래들은 하나 이상의 입력들 및 하나 이상의 출력들 뿐만 아니라 프로세스 소유자의 서명을 포함할 수 있으며, 이들 각각은 인증 및 인가된 것으로 독립적으로 증명 및 추적될 수 있다. 프로세스 단계 완료 및 다음 프로세스 단계로의 소유권 이전 및 상태 변경은 디지털 거래 원장 거래 기록(digital transaction ledger transaction record)에 의해 정의되고 기록된다. 예를 들어, 거래들은 투명한 분산 블록체인 서버 네트워크에 위치한 블 록체인 내에서 기록되고 타임 스탬프되어, 3D-프린트된 부품에 대한 영구적이고 불변의 추적가능한 거래 기록을 형성할 수 있다. 최종 사용자에게 전달되는 최종적으로 제조된 부품은 바람직하게는 최종 고유 거래 ID를 부품 상에 및/또는 내에 인코딩한다. 이러한 거래 ID는 이러한 부품의 제조 이력의 준수와 더불어 최종 사용자에게 부품의 신뢰성을 알려주도록 용이하게 검사될 수 있는 형태를 갖는다. 제조 방법에 따라, 숨겨진(hidden) ID를 부여하여, 신뢰성을 더욱 보장하고 위조품을 탐지할 수도 있다. 이러한 거래 ID에 대한 지 식과 투명한 블록체인 원장에 대한 질의는, 부품 거래들의 완전한 출처 및 역방향 추적을 가능하게하므로 출처, 신뢰성, 요구 준수 및 최종 사용에 대한 적합성을 보장한다. 프로세스 상태 도 4-17을 참조하면, 적층 제조 부품에 대한 가상 분산 재고 관리 시스템의 개시된 실시예에 의해 추적되는 주요 프로세스 상태(50-60)는 적어도 다음과 같은 별개의 상태들을 포함하며, 이들 각각은 그 자신의 대응하는 입력들 및 출력들을 가질 수 있으며(도 8, 9, 13, 14, 15, 18, 19, 22, 23, 26 및 27에 도시된 바와 같이), 이 들 각각은 디지털 원장에 기록된 그 자신의 관련 거래를 가질 수 있는바, 고객 요구, 설계 구현 요구, 제조 전처리(manufacturing pre-processing), 파우더 조달 및 비축, 머신 교정 파라미터 생성, 파 우더 검사 공정, 머신 프리-프로세싱 변환, 3D 프린팅, 부품 후처리, 부품 후검사 및 부품 최종 사용자 전달을 포함할 수 있다. 고객 요구 상태(Customer Requirements State) 도 6 및 도 8에 도시된 바와 같이, 고객 요구 프로세스 상태는 고객 주문 및 일련의 고객 요구를 수신하는 것으로 시작한다. 고객 요구는 부품 제조업자에 요구되는 사양 및 품질 관리에 대한 포괄적인 목 록일 수 있다. 가상 분산 재고 관리 시스템의 제 1 사용자는 고객 주문 및 고객 요구를 취하여 새로운 주문 프로세스를 시작한다. 사용자는 내부 고객 요구 문서를 생성하고, 거래 원장에 디 지털 서명을 하고 그리고 디지털 원장에 제 1 거래(90a)를 기록하여, 고객 요구 문서가 생성되었 음을 증명한다. 제 1 거래를 기록하면, 프로세스 상태는 사실상 후속 상태로 변환되고, 이는 설계 구현 요 구 프로세스 상태이다. 도 6을 추가로 참조하면, 거래를 기록하는 것은 예를 들어, 고객 요구가 충족되었는지 검증하고, 고객 요 구를 사용하여 프로세스 해시를 생성하고, 디지털 거래 원장 엔트리를 생성하고, 고객 요구 상태 거 래를 서명하는 개인의 개인 키로 그러한 해시에 서명하고, 이러한 거래 정보를 지정된 어드레스에서 디지털 원장에 기록하는 것을 포함한다. 디지털 원장에 기록된 특정한 거래 정보는 후속 프로세스 상태를 참조하여 아래에서 더 설명되는 바와 같이 상술한 프로세스 해시(84a)만을 단독으로 포함하거나, 또는 부품 일련 번호 및 부품 모델 번호와 같이 고객 요구로부터 도출된 소정 정보를 또한 혹은 대안적으로 포함할 수 있 다. 개인 거래 데이터는 암호화될 수 있으며 그리고 다음 사용자로 포워딩될 수 있다. 대안적으로, 상기 거래는 암호 화폐 거래를 통해 기록될 수 있는바, 제 1 프로세스 상태와 관련된 제 1 사용자 는 제 2 프로세스 상태와 관련된 제 2 사용자에게 공칭 금액의 암호 화폐를 전송한다(고유한 거래 식별자와 함 께). 예를 들어, 고객 요구 상태와 관련되고 고객 요구 문서의 생성을 담당하는 제 1 사용자는, 설계 구현 요구 상태와 관련된 제 2 사용자에게 공칭 금액의 비트코인을 전송함으로써(앞서 언급한 고객 요구 해시를 비트코인 거래의 OP_RETURN 옵코드(opcode)에 첨부하면서), 이러한 프로세스가 완료됨을 확인할 수 있다. 설계 구현 요구 상태(Design Implementation Requirements State) 도 7 및 도 9를 참조하면, 앞서 언급된 거래 데이터가 디지털 원장에 기록되는 것을 통해 고객 요구 프로세스 상태가 인증되면, 가상 변환은 설계 구현 요구 상태로 진입한다. 이 상태에서 입력들로 수용 되는 것은, 고객 요구 문서 단계의 이전 상태의 출력일 뿐만 아니라, 제조자에 특정될 수 있는 임의 의 보충적으로 도출된 요구(supplemental derived requirements)이다. 예를 들어, 제조업자는, 고객에"}
{"patent_id": "10-2020-7020581", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "의해 요구되고 그리고 고객 요구 문서에 요약된 것들을 훨씬 넘어서는(above and beyond) 제품 사양들 및 품질 콘트롤들의 자신만의 세트들을 가질 수 있다. 추가적인 입력들은 검증 프로세스 단계로부터의 고객 요구 검증 및 고객 IP 아티팩트, 설계 기관 지적 재산 아티팩트 및 제 3 자 IP 아티팩트와 같은 임의의 지적 재산권 또는 아티팩트를 포함할 수 있다. 임의의 고객 요구 검증 및 IP 권리들(105, 106 및 107)와 함께, 고객 요구 및 임의의 보충 요구 로부터, 적어도 다음의 정보들이 바람직하게는 설계 구현 요구 상태에서 생성되거나 도출되는바, 예를 들어 PTC Pro/Engineer의 PRT 파일과 같은 설계 부품 및 어셈블리 프로세스를 생성하는 CAD 프로그램의 파 일 포맷의 형태인 부품의 형상 정의(geometry definition) 및 솔리드 모델(solid model); 부품의 크기, 무게, 강도 또는 형상과 같은 제품 제조 정보; 가령, 알루미늄(AlSil0Mg), 티타늄(Ti6A14V), 코발트 크롬, 인코넬(Inconel) 625 & 718, 마레이징 강철(maraging steel), 스테인레스 스틸(15-SPH, 17-4PH, 316L), 하스탈 로이-X(hastalloy-X), 구리 C18150 및 알루미늄 A17000, 및 적층 제조 재료의 혼합을 위한 이들의 혼합 비율 등 을 포함하지만 이에 국한되는 것은 아닌 재료 성분과 같은 재료 요구들; 해상도 및 공차허용 (tolerances) 등과 같은 품질 요구; 적층 프린터 머신 제조사 및/또는 모델 등과 같은 제조 프로세스 요구 ; 부품 모델 번호 114; 및 부품일련 번호 113 등이 도출된다. 고객 요구 프로세스 상태와 유사하게, 설계 구현 요구 프로세스 상태의인증은 바람직하게는 블록체인과 같은 디지털 원장에 거래(90b)를 기록함으로써 달성된다. 예를 들어, 거래의 기록은 다음을 포함할 수 있는바, 설계 구현 요구가 충족되었는지 검증하는 것, 설계 구현 요구 및 고객 요구을 입력으로서 사용하여 프로세 스 해시(84b)를 생성하는 것, 디지털 거래 원장 엔트리를 생성하는 것, 설계 구현 요구 상태 거래를 서명하는 개인의 프라이빗 키로 해시에 서명하는 것, 이러한 거래 정보를 지정된 어드레스에서 디지털 원장 에 기록하는 것 등을 포함한다. 개인 거래 데이터는 암호화되어 다음 사용자에게 포워딩될 수 있다. 전체 제품 라이프 사이클을 통해 특정 부품의 추적을 용이하게하기 위해, 설계 구현 요구 상태 거래(90b)는 또 한 과거의 고객 요구 상태 거래(90a)를 반영하는 것이 바람직하다. 이는 여러 가지 다른 방법으로 달성될 수 있 다. 예를 들어, 고유한 부품 일련 번호 및 부품 모델 번호가 고객 요구 상태 거래에서 생성 및 기록된 경우, 설계 구현 요구 상태 거래(90b)를 기록할 때, 동일한 부품 일련 번호 및 부품 모델 번호가 사 용될 수 있다. 대안적으로, 설계 구현 요구 상태 거래(90b)는, 과거의 거래가 디지털 원장에 기록된 어드레 스에 대한 참조를 포함시킴으로써, 이전 거래(90a)를 참조할 수 있다. 고객 요구 상태 거래의 기록을 표시 하기 위해 암호 화폐 거래가 사용된 경우, 설계 구현 요구 프로세스 상태의 인증자는 고객 요구 프로세스 상태 인증자에 의해 수신된 동일한 공칭 금액의 암호 화폐를 단순히 이전하고, 새로 생성된 설계 구현 요구 프로세스 해시(84b)를 거래에 첨부하고, 그리고 제조 전처리(이하, '전처리' 또는 '프리-프로세싱' 이라함) 요구 상태와 관련된 다음 사용자에게 암호 화폐를 전송할 것이다. 제조 전처리 제조 요구 상태(Manufacturing Pre-processing Requirements State) 도 10 및 도 13을 참조하면, 제조 전처리 요구 상태는 3D 형상 정의를 갖는 솔리드 모델 PRT 파일과 같은 적어도 하나의 인증된 CAD(Computer Aided Design) 형상 파일을 수신하는 것, 뿐만 아니라 부품의 크기, 무게, 강도 또는 형상과 같은 제품 제조 정보를 수신하는 것으로 시작한다. 이러한 정보는 스테레오리소그 래피 파일(STL), 적층 제조 파일(AMF) 또는 다른 유사한 파일 형식과 같은 3D 프린터에 의해 판독될 수 있 는 파일 또는 파일 세트를 출력으로서 생성하는데 사용될 것이다. 추가 입력은 검증 프로세스 단계 로부터의 고객 요구 검증을 포함할 수 있다. 제조 전처리 요구 프로세스 상태의 인증은 바람직하게는 디지털 원장에 거래(90c)를 기록하는 것으로 달성된다. 예를 들어, 거래의 기록은 제조 전처리 요구를 도출하는 것, 적층 제조 파일을 생성하는 것, 제조 전처리 요구가 충족되었는지를 검증하는 것, 제조 전처리 요구, 설계 구현 요구 및 고 객 요구의 임의의 원하는 조합을 입력으로서 사용하여 프로세스 해시(84c)를 생성하는 것, 디지털 거 래 원장 엔트리를 생성하는 것, 제조 전처리 요구 프로세스 상태 거래를 서명하는 개인의 프라이빗 키(8 2)로 해시에 서명하는 것, 이러한 거래 정보(90c)를 지정된 어드레스에서 디지털 원장에 기록하는 것 등을 포함한다. 개인 거래 데이터는 암호화되어 다음 사용자에게 전달될 수 있다. 고객 요구과 관련하여 서술된 프로세스와 유사하게, 디지털 원장에 기록된 특정 거래 정보는 상술된 프로세 스 해시(84c)만을 포함하거나, 또는 부품 일련 번호 및 부품 모델 번호와 같이 고객 요구, 설계 구현 요구, 또는 제조 전처리 요구 중 임의의 것으로부터 도출된 소정 정보를 또한 포함하거나 혹은 대안적으로 포함 할 수 있다. 대안적으로, 상태 변환은 전술한 바와 같이 암호 화폐 거래를 통해 일어날 수 있다. 파우더 조달 및 비축 프로세스 상태(Powder Procurement and Stocking Process State) 도 11 및 도 14를 참조하면, 제조 전처리 요구가 완료된 것으로 인증된 이후, 시스템은 파우더 조달 및 비축 프 로세스 상태로 변환된다. 이전 프로세스 상태로부터 생성된 재료 조성 파라미터가 수신되고, 이러 한 파라미터는 바람직하게는 3D 프린터로 보내질 새로운 파우더 요구을 생성하는데 사용된다. 파우더 조달 및 비축 프로세스 상태의 인증은 바람직하게는 디지털 원장에 거래(90d)를 기록하는 것으로 달 성된다. 예를 들어, 거래의 기록은 새로운 파우더 요구가 충족되었는지를 검증하는 것, 파우더 조달 및 비 축 요구, 제조 전처리 요구, 설계 구현 요구 및 고객 요구의 임의의 원하는 조합을 입력으로서 사용하여 프로세 스 해시(84d)를 생성하는 것, 디지털 거래 원장 엔트리를 생성하는 것, 파우더 조달 및 비축 프로세 스 상태 거래를 서명하는 개인의 프라이빗 키로 상기 해시에 서명하는 것, 이러한 거래 정보를 지정된 어드 레스에서 디지털 원장에 기록하는 것 등을 포함한다. 임의의 또는 모든 프로세스 상태들과 관련하여 당업자 가 쉽게 이해할 수 있는 바와 같이, 거래 로그는 프로세스 해시만을 포함하거나 또는 프로세스 전체에 걸쳐 도출된 특정 정보 중 임의의 것에 대한 참조를 포함할 수 있다. 머신 교정 파라미터 생성 상태(Machine Calibration Parameter Generation State) 이제 도 12 및 도 15를 참조하면, 파우더 조달 및 비축 프로세스 상태의인증과 함께 또는 인증 후에, 개시 된 방법은 실질적으로 적층 제조 머신 교정 파라미터 생성 상태로 변환된다. 재료 요구 및 제조 전처 리 요구를 수신함으로써, 사용자는 예를 들어, 재료의 특정 조성, 녹는점, 파우더 크기, 파우더 순도, 벌 크 밀도 또는 레이놀즈의 다일레이턴시(Reynolds' dilatancy) 등과 같은 특정한 머신 교정 세팅; 제조에 사용되는 필요한 머신 일련 번호; 및 제조업체 상업용 및 정부 기관(CAGE) 코드를 생성할 수 있다. 머신 교정 파라미터 생성 상태의 인증은 바람직하게는 디지털 원장에 거래(90e)를 기록하는 것으로 달 성된다. 예를 들어, 거래의 기록은 머신 교정 파라미터가 충족되었는지를 검증하는 것, 도출된 머신 교정 파라미터 생성 요구, 파우더 조달 및 비축 요구, 제조 전처리 요구, 설계 구현 요구 및 고객 요구의 임의의 원 하는 조합을 입력으로서 사용하여 프로세스 해시(84e)를 생성하는 것, 디지털 거래 원장 엔트리를 생성하 는 것, 해당 상태 거래를 서명하는 개인의 프라이빗 키로 상기 해시에 서명하는 것, 이러한 거래 정보를 지정된 어드레스에서 디지털 원장에 기록하는 것 등을 포함한다. 개인 거래 데이터는 암호화되어 다음 사용자에게 전달될 수 있다. 파우더 검사 프로세스 상태 이제 도 16 및 도 18을 참조하면, 파우더 조달 및 비축 프로세스가 인증된 이후, 시스템은 파우더 검사 프로세 스 상태로 변환된다. 프로세싱 상태로부터의 새로운 파우더 요구는 이전의 적층 제조 머신 교정 에서 남은 공지된 사용된 파우더과 결합되는바, 이는 그 머신 파우더가 검사되었는지를 인증하기 위 한 것이다. 이와 관련하여, 제조업자는 다수의 부품을 생성하는 동안 사용되는 정확한 양의 파우더를 추적할 수 있으며, 이는 프린트된 부품의 수량을 추적하는데 유용할 수 있다. 이전 상태에서와 같이, 파우더 검사 프로세 스 상태의 인증은 바람직하게는 전술한 것과 유사한 방식으로 디지털 원장에 거래(90f)를 기록하는 것 을 통해 달성된다. 예를 들어, 거래의 기록은 파우더 검사가 완료되었음을 검증하는 것, 도출된 머신 교정 파라미터 생성 요 구, 파우더 조달 및 비축 요구, 제조 전처리 요구, 설계 구현 요구 및 고객 요구의 임의의 원하는 조합을 입력 으로서 사용하여 프로세스 해시(84f)를 생성하는 것, 디지털 거래 원장 엔트리를 생성하는 것, 파우 더 검사 상태 거래에 서명하는 개인의 프라이빗 키로 그러한 해시에 서명하는 것, 이러한 거래 정보를 지정된 어드레스에서 디지털 원장에 기록하는 것 등을 포함할 수 있다. 개인 거래 데이터는 암호화되어 다음 사용자에게 전달될 수 있다. 제품 식별자 생성 도 29와 관련하여 도시된 바와 같이, 공정의 이러한 스테이지에서, 부품을 프린트하는 적층 제조업자에게 필요 한 모든 제조 요구들이 도출되고 인증되었다. 하지만, 이러한 프로세스 상태가 프린팅 스테이지로 변환되기 전 에, 도출된 부품 사양들이 고유 부품 ID 번호를 생성하는데 이용되는 것이 바람직하며, 이는 후술되는 바와 같 이 인증 목적으로 이용될 수 있다. 예를 들어, 부품 일련 번호, 부품 모델 번호, 도출된 제조 프로세 스 요구, 적층 제조에 사용되는 머신 일련 번호, 임의의 이전 프로세스 상태들로부터의 프로세스 해 시(84a-f), 부품 재료 조성 요구, 제조업자 CAGE 코드를 입력으로 사용하여 프로세스 해시를 생 성함으로써, ID 생성 컴퓨터 인터페이스를 통해 고유 부품 ID 번호가 생성될 수 있다. 결과적인 고유 ID로 부터, 최종 적층 제조 부품에 대한 후속 에칭을 위해 2D 또는 3D 바코드 또는 글리프(glyph)가 생성되거나 혹은 부품에 직접 프린트될 수 있다. 또한, 고유 부품 ID 번호 및 상기 부품에 특정한 상기 언급된 세부사항들 중 임의의 것을 포함하는 진품 인증서(certificate of authenticity)가 현재 스테이지에서 생성될 수 있다. 또한, 고유 제품 식별자에 대한 인증은 바람직하게는 전술한 것과 유사한 방식으로 디지털 원장에 거 래를 기록함으로써 달성된다. 머신 전처리 변환 상태(Machine Pre-Processing Transformation State) 도 17 및 도 19를 참조하면, 이전의 모든 상태들이 완료된 것으로 인증되면, 프로세스는 적층 제조업자에게로 진행될 준비가 되며 머신 전처리 변환 상태로부터 시작한다. 본 스테이지에서 입력으로서 받아들여지는 것 은, STL 파일, AMF 파일, 또는 제조 전처리 요구 상태에서 이전에 생성된 다른 등가의 파일; 제품 제 조 정보; 재료 요구/조성 정보; 특정 적층 제조 머신 모델과 같은 제조 프로세스 요구들; 및 고 유한 2D 또는 3D 바코드 또는 부품 글리프이다. 바람직하게는, 이러한 모든 것들은 적층 제조 머신 툴 경 로 파일을 생성하는데 이용되며, 적층 제조 머신 툴 경로 파일은 3D 프린터의 속도, 파워, 스캔 레이트, 스캔 패턴, 및 피드 레이트(feed rate) 같은 것들을 서술할 것이다. 이전의 상태들에서와 같이, 머신 전처리 변환 프로세스 상태의 인증은 바람직하게는 전술한 것과 유사한 방식으로 디지털 원장에 거래 (90h)를 기록함으로써 달성된다. 예를 들어, 거래의 기록은 머신 전처리 변환 요구가 충족됐는지에 대한 검증, 프로세스 해시(84h)의 생성 , 디지털 거래 원장 엔트리의 생성, 머신 전처리 변환 상태 거래를 서명한 개인의 프라이빗 키로 이러한 해시에 서명하는 것, 및 거래 정보를 지정된 어드레스에서 디지털 원장에 기록하는 것을 포함 할 수 있다. 개인 거래 데이터는 암호화되어 다음 사용자에게 전달될 수 있다. 3D 프린트 부품 상태 도 20 및 도 22를 참조하면, 이제 적층 제조 프로세스 상태에서 모든 부품 설계 요구가 인증되었으며, 대표 적인 부품은 이제 3D 프린터 상에서 프린트될 준비가 된다. 바람직하게는, 적층 제조업자는, 도출된 머신 툴 경로 파일, 검사된 파우더 인증, 적층 제조 머신 교정 세팅, 부품 모델 번호, 부 품 일련 번호, 제조업체 CAGE 코드, 제조에 사용되는 머신 일련 번호, 제조 프로세스 요구 및 고유한 2D 또는 3D 바코드 혹은 부품 글리프를 수신할 것이다. 조각 부품(piece part)이 프린트되 면, 3D 프린트 부품 상태는 사용된 파우더 리포트의 생성 및 조각 부품 검증 쿠폰의 생성 을 추가로 요청한다. 이전 상태들에서와 같이, 3D 프린트 부품 프로세스 상태의 인증은 바람직하게는 전술 한 것과 유사한 방식으로 디지털 원장에 거래(90i)를 기록함으로써 달성된다. 예를 들어, 거래의 기록은 적층 제조 요구가 충족됐는지에 대한 검증, 프로세스 해시(84i)의 생성, 디지털 거래 원장 엔트리의 생성, 해당 상태 거래를 서명한 개인의 프라이빗 키로 이러한 해시에 서명 하는 것, 및 거래 정보를 지정된 어드레스에서 디지털 원장에 기록하는 것을 포함할 수 있다. 개인 거 래 데이터는 암호화되어 다음 사용자에게 전달될 수 있다. 부품 포스트 프로세싱 상태(Part Post Processing State) 이제 도 21 및 도 23을 참조하면, 부품 포스트 프로세싱 상태는 이전에 도출된 제품 제조 정보 이외에 도 적층 제조 조각 부품의 수신하는 것으로 시작하고, 포스트 프로세싱된 완성된 부품을 인증하기 위 해 부품 포스트 프로세싱 요구를 도출한다. 이러한 스테이지에서, 고유한 2D 또는 3D 바코드 또는 글리프 가 에칭되거나 부품에 부착될 수 있는바, 이는 후속 인증 목적을 위한 것이다. 부품 포스트 프로세싱 프로 세스 상태의 인증은 바람직하게는 전술한 것과 유사한 방식으로 디지털 원장에 거래(90j)를 기록함으 로써 달성된다. 예를 들어, 거래의 기록은 포스트 프로세싱 변환 요구가 충족됐는지에 대한 검증, 프로세스 해시(84j)의 생성, 디지털 거래 원장 엔트리의 생성, 포스트 프로세싱 변환 상태 거래를 서명한 개인의 프라이빗키로 이러한 해시에 서명하는 것, 및 거래 정보를 지정된 어드레스에서 디지털 원장에 기록하는 것을 포함할 수 있다. 개인 거래 데이터는 암호화되어 다음 사용자에게 전달될 수 있다. 부품 검사 상태 이제 도 24 및 도 26을 참조하면, 조각 부품이 프린트되고 프로세싱된 이후에, 조각 부품이 검사되 어야만 한다. 따라서, 시스템은 부품 검사 상태로 변환된다. 포스트 프로세싱된 조각 부품이 수신되는 바, 솔리드 모델 형상 파일, 도출된 제품 제조 정보, 부품 품질 요구 및 검증 쿠폰과 함께 수신된다. 이들 모두는 바람직하게는 검사 기록을 생성하고 그리고 준수 인증서(certificate of compliance)를 생성하기 위해 사용된다. 따라서, 상기 프로세스는, 포스트 프로세싱된, 완성된, 및 검사된 적층 제조 부품을 생성한다. 이전 상태들에서와 같이, 부품 검사 프로세스 상태의 인증은 바람직하 게는 전술한 것과 유사한 방식으로 디지털 원장에 거래(90k)를 기록함으로써 달성된다. 예를 들어, 거래의 기록은 포스트 프로세싱된, 완성된 및 검증된 부품에 대한 검증, 프로세스 해시(84k)의 생성, 디지털 거래 원장 엔트리의 생성, 부품 검사 상태 거래를 서명한 개인의 프라이빗 키로 이 러한 해시에 서명하는 것, 및 거래 정보를 지정된 어드레스에서 디지털 원장에 기록하는 것을 포함할 수 있다. 개인 거래 데이터는 암호화되어 다음 사용자에게 전달될 수 있다. 부품 최종 사용자 전달 상태(Part End User Delivery State) 도 25 및 도 27을 참조하면, 이제 포스트 프로세싱된, 완성된 및 검사된 부품이 최종 사용자에게 전달 될 준비가 되는바, 검사 기록, 준수 인증서(certificate of compliance) 및 진품 인증서와 함 께 전달될 준비가 된다. 검사 기록 및/또는 준수 인증서는 추가적인 검사 및/또는 포스트 프로세싱된, 완성된, 및 검사된 부품의 설치를 반영하도록 본 스테이지에서 업데이트될 수 있다. 추가적으로, 본 스테이지에서 인보 이스가 자동으로 생성될 수 있다. 이전 상태에서와 같이, 부품 최종 사용자 전달 프로세스 상태 의 인증은 바람직하게는 전술한 것과 유사한 방식으로 디지털 원장에서 거래(90L)를 기록함으로써 달 성된다. 예를 들어, 거래의 기록은 부품 최종 사용자 전달 프로세스에 대한 검증, 프로세스 해시(84L)의 생성 , 디지털 거래 원장 엔트리의 생성, 부품 최종 사용자 전달 변환 상태 거래를 서명한 개인의 프라이 빗 키로 이러한 해시에 서명하는 것, 및 거래 정보를 지정된 어드레스에서 디지털 원장에 기록하 는 것을 포함할 수 있다. 개인 거래 데이터는 암호화되어, 인가된 수리 및 오버홀 엔티티 등과 같은 다음 사용자에게 전달될 수 있다. 부품 인증 방법(Part Authentication Method) 도 5a, 5b, 29 및 30에 도시된 바와 같이, 개시된 시스템은 순정 적층 제조 부품을 용이하게 인증할 수 있게 하 며, 위조 사본의 생성을 어렵게 한다. 예를 들어, 제조업자의 개인 키, 부품 재료 조성, 부품 일련 번 호, 부품 모델 번호, 프로세스 해시, 제조업자 CAGE 코드, 부품을 생성하는데 사용되는 머 신 모델 번호 및 부품을 생성하는데 사용되는 머신 일련 번호 등과 같은 다수의 고유한 부품 입력들 을 수용하는 혼합 알고리즘에 단방향 암호화 해시 함수를 적용함으로써, 고유한 부품 식별자가 생성될 수 있다. 이러한 고유 식별자는 기본적으로 또는 바코드, QR 코드 또는 기타 유사한 마킹 수단을 통해 3D 프린 트된 부품에 직접 이식될 수 있다. 결과적으로, 최종 사용자가 부품을 정품으로서 확인하려고 하는 경우, 다수의 보안 조치들이 취해지므로 위조 복사를 달성하기가 극도로 어려워진다. 예를 들어, 제조자 개인 키의 사용은 위조 해시 함수 출력의 생 성을 방지한다. 비밀 혼합 알고리즘(confidential mixing algorithm)을 이용하면, 사용된 해시를 생성하기 위해 (잠재적으로) 공개적으로 이용가능한 해시 함수가 사용되는 것을 방지한다. 프로세스 해시를 입력으 로서 포함하는 것은 프로세스 단계를 확보하고 그리고 프로세서 또는 제조업체에 독점적일 수 있다. 또한, 입력 으로서 재료 조성의 부가는, 재료 조성의 X- 선 측정과 같은 명백하지 않은 것에 대해 체크될 수 있다. 해시 함수들(85 및 85a)에 대한 결과적인 분석 및 비교는 3 가지 잠재적 결과들을 산출할 수 있는바, 부품 은 진품으로 인증될 수도 있고, 진품으로 간주되거나, 또는 모조품으로 간주될 수 있다. 예를 들어, 인증자가 재료 조성을 제외하고 필요한 모든 입력을 제공받는 경우, 인증자는 최종적으로 필요한 입력을 획득하기 위해 부품의 재료 구성에 대한 x-선 측정을 수행할 수 있다. 주어진 입력들을 이용하여 생성된 결과 해시와 측정 된 재료 조성을 비교함으로써, 부품의 해시와 정확히 일치하는 결과 해시(85a)는, 상기 부품이 진품임을 나타낸다. 마찬가지로, 측정된 재료 조성과 매우 유사하지만(정확하게 일치하지는 않는) 재료 조성 입력들의 세트를 이용하여 일치하는 해시가 생성될 수 있는 경우, 상기 부분은 진품으로 여겨질 수 있다(be deemed to likely be genuine). 그러나, 제공되고 측정된 정보로 생성된 해시(85a)가 부품의 식별자와 일치하지 않으면(제 공된 입력이 정확하다고 가정할 때), 상기 부품은 가짜 또는 위조품으로 간주될 수 있다. 부품 서비스, 정비, 수리 및 오버홀(Part Servicing, Maintenance, Repair and Overhaul) 비록, 본 발명의 실시예들은 제조 또는 생산되는 부품을 참조하거나 설명하고 있지만, 상기 시스템은 부품 의 서비스, 정비(maintenance), 보존(upkeep), 수리 및/또는 오버홀을 보장하는데 계속해서 이용될 수 있으며 그리고 부품 서비스에 사용되는 재료 및 매뉴얼이 정품이며 인증되었는지 확인하는데에도 지속적으로 사용될 수 있음을 이해해야 한다. 소정의 부품 또는 제품의 제품 정보는 원래의 제조 정보와 함께 부품 또는 제품의 지속 적인 정비 및 보존에 관한 정보 및/또는 정비 매뉴얼 혹은 다른 애프터 마겟 요구들과 같은 교체 부품들 및 제품들에 관한 정보를 포함할 수 있다. 예를 들어, 서비스 및 정비 요구 프로세스는 부품 정비 매뉴얼을 수신하는 것으로 시작할 수 있다. 부품 정비 매뉴얼은 공인 수리 시설에 필요한 서비스, 수리 및 품질 관리에 대한 포괄적인 사용 설명서일 수 있다. 수리 시설은 매뉴얼을 보유하고 거래 원장에 디지털 서명을 하고, 진짜 유지 보수 매뉴얼이 수신되어 사용되고 있음을 증명하는 거래를 디지털 원장에 기록한다. 이러한 거래를 기록하면 프로세스 상태는 사실상 후속 서 비스 및 수리 상태로 변환된다. 예를 들어, 거래의 기록은 정비 매뉴얼 요구가 수신되었음을 검증하는 것, 정비 요구를 이용한 프로세스 해시의 생성, 디지털 거래 원장 엔트리의 생성, 정비 요구 상태 거래를 서명한 개인의 프라이빗 키로 이러한 해시에 서 명하는 것, 및 거래 정보를 지정된 어드레스에서 디지털 원장에 기록하는 것을 포함할 수 있다. 디지털 원장에 기록된 특정 거래 정보는 전술한 프로세스 해시만을 포함할 수 있거나, 또는 정비 매뉴얼 번호와 같은 정비 요 구로부터 도출된 특정 정보를 포함하거나 대안적으로 포함할 수 있다. 개인 거래 데이터는 암호화되어 다음 사 용자에게 전달될 수 있다. 부품은 이제 서비스될 준비가 된다. 수리 시설은 바람직하게는 정비 매뉴얼 및 작업 지시를 받는다. 이전 상태 에서와 같이, 부품에 대한 서비스의 인증은 바람직하게는 전술한 것과 유사한 방식으로 디지털 원장에 거래 를 기록함으로써 달성된다. 수행된 서비스들 및 임의의 추가적인 검사 또는 교체 부품을 반영하기 위해, 이러한 스테이지에서 서비스 기록 및/또는 수리 규정 준수의 인증이 생성되거나 업데이트될 수 있다. 또한, 이러한 스 테이지에서 인보이스가 자동으로 생성될 수 있다. 앞선 상태들에서와 같이, 수리된 부품에 대한 인증은 바람직 하게는 전술한 것과 유사한 방식으로 디지털 원장에 거래를 기록함으로써 달성된다. 글로벌 공급망에 적용(Application to a Global Supply Chain) 본 개시의 대안적인 실시예에서, 안전하고 추적가능한 제조 부품 시스템의 사용자는 부가 가치 공급망(value added supply chain)의 일부로서 부가 가치 서비스(value added services)를 제공하기 위해 제조 부품 프로세 서에 인증을 제공할 수 있다. 이러한 인증은 시스템의 출처 콘트롤의 일부로서 최종 제조 부품에 대해 설계 기 관에 의해 부여될 수 있다. 개별적인 시스템 소스 기관들은 고객의 상위 레벨 어셈블리를 포함하는 복수의 제조된 부품들 중 각각의 제조된 부품의 출처 및 추적성에 대한 액세스를 상위 레벨의 고객에게 부여할 수 있으며, 따라서 고객은 각 개별 아이 템에 대하여 출처 및 추적성을 집계할 수 있다. 이러한 집계는 최고 레벨 생산 아이템 및 고객까지 재귀적일 수 있다. 이러한 기능은 부품 번호를 찾아내고 고객의 공급망 질문에 대한 자세한 답변을 제공하기 위한 기존의 용 지 추적 방법과 관련된 제조업자의 비용 및 시간과, 다양한 컴퓨터 소프트웨어 시스템에 대한 기존의 필요성을 회피할 수 있다. 예를 들어, 비행기 기체에 대한 비행 제어 시스템의 제공자는 비행 제어 액츄에이터에서 하나 이상의 제조된 부 품을 가질 수 있고 제 3 자에 의해 공급되는 온보드 펌프 어셈블리에서 하나 이상의 제조된 부품을 더 가질 수 있다. 공급망 프로세스의 모든 단계에서 개별 부품을 추적하고, 위에서 설명한 방식으로 증명서가 인증되고 블 록체인 또는 유사한 원장에 기록됨으로써, 비행 제어 시스템의 제공자는, 모든 관련 부품 인증서들을 원장 상의 하나의 추가적인 아이템으로서 집계할 수 있다(임의의 원하는 레벨의 입도(granularity)를 이용하여). 예를 들 어, 안전하고 추적가능한 제조 부품에 대한 본 발명에 따른 방법의 사용자는 비행 제어 시스템의 모든 서브 어 셈블리들 및 구성 요소들을 비행 제어 레벨로 모을 수 있다. 이제 도 31을 참조하면, 도 31은 최종 아이템 고객, 공급업자 및 하위-계층 공급업자를 갖는 예시 적인 공급망을 예시한다. 도 31에 도시된 바와 같이, 소정 부품/제품의 제품 정보는 체크마크에 의해 표시된 바 와 같이 하위 계층 공급자 레벨에서 검증될 수 있으며, 따라서 공급자에 공급되고 다른 하위 계층 공급 자의 다른 부품/제품과 결합되어 최종 아이템 고객에게 공급되는 소정 부품/제품은 각 당사자에 의해 검증 될 수 있다. 소정 부품/제품에 대한 제품 정보의 일례들은, 부품/제품 요구, 실제 프로세스 또는 원재 료, 커스터디(custody), 보수(remuneration), 지적 재산 아티팩트(예를 들어, 특허, 상표, 저작권, 영업 비밀, 노하우, 기타.), 부품/제품과 관련된 특정 블록 및/또는 메타데이터의 정보 유형을 나타내는 해시를 포함할 수 있다. 소정 부품/제품의 제품 정보는 공급망 내의 각각의 공급자, 하위 계층 공급자 또는 최 종 아이템 고객에 의해 블록체인 또는 원장(분산 거래 레지스터라고도 함) 내에 유지되거나 입력될 수 있으 며, 따라서 상기 정보는 나중에 검증되거나 체크될 수 있다. 비록 본 발명의 실시예들은 제조 또는 생산되는 부 품/제품을 참조하거나 설명하지만, 이들 실시예들은 이미 제조 또는 생산된 부품/제품들 및 수리, 정비, 유지, 서비스 또는 오버홀을 필요로 하는 부품/제품에도 적용가능하다는 것이 이해되어야 한다. 실시예들에 따르면, 소정의 부품/제품의 제품 정보는 부품/제품 또는 교체 부품/제품의 진행중인 정비 및 유지와 함께 원래의 제조 정보를 포함할 수 있다. 부품을 제조하는데 사용된 프로세스들, 부품을 형성하는데 사용된 원재료, 부품에 대한 요구(예를 들어, 부품/제품이 특정 듀티 사이클하에서 어떻게 수행되어야 하는가에 대한 고객 요구), 및 부품을 상업 화하기 위해 필요한 지적 재산권은 블록체인 또는 전술한 바와 같은 유사한 공공 또는 개인 원장 내에 기록될 수 있다. 이와 관련하여, 제품 정보의 각각의 요소는 공급망 내의 공급자(35, 36) 및/또는 최종 아이템 고객 에 의해 검증을 위해 이용가능하다. 실시예에 따르면, 블록체인 또는 원장에 기록된 정보는 다양한 목적을 위해 이용될 수 있다. 예를 들어, 블록체인 또는 원장 정보는 특정 사양에 따라 부품/제품이 제조 및 생산되었 는지를 검증하는데 이용될 수 있다. 이것은, 부품/제품이 공급자 또는 최종 아이템 고객의 특정 요구를 충족시 킬 수 있는지를 공급자 또는 최종 아이템 고객이 점검할 수 있게 할 것이다. 예를 들어, 요구되는 듀티 사이클을 소정의 부품/제품이 적절한 마진으로 수행할 수 있도록, 상기 소정의 부품/제품은 특정 공정을 사 용하여 또는 특정 원재료로부터 제작될 필요가 있을 수 있다. 공급자 또는 최종 아이템 고객은 블 록체인 또는 원장의 입력들을 통해, 이러한 원재료 또는 공정이 생산에서 사용되었는지를 확인할 수 있다. 또한, 실시예에 따르면 공급자는 하위 계층 공급자들의 출처를 집계할 수 있으며, 최종 아이템 고객 에게 출처 및 관련 문서에 대한 액세스 권한을 부여할 수 있을 것이다. 일부 실시예에서, 최종 아이템 고객 은 모든 공급자들 및 하위 계층 공급자들의 출처를 집계할 수 있을 것이다. 따라서, 공급망 내의 각각의 엔티티는 다운스트림에서 발생한 블록체인 혹은 원장에 기록된 정보를 집계할 수 있을 것이며, 또한 동 일한 정보에 대한 액세스 권한을 업스트림의 엔티티들에게 부여할 수 있을 것이다. 부품/제품 요구들의 실시예들은 고객 요구들 및 아직 제조 또는 생산되지 않은 특정 아이템에 대해 부품/ 제품을 설계한 설계 기관 또는 엔티티의 요구들을 포함한다. 설계 기관 요구는 프로세스 요구, 재료 요 구, 문서 요구, 부품/제품 성능 요구, 지적 재산권 요구 및 소싱 요구(예를 들어, 재료 또는 서비스를 누 구로부터 획득해야 하는가)을 포함할 수 있다. 실제 공정 또는 재료들에 대한 실시예들은, 소정의 부품/제품의 형성 또는 생산에 사용된 공정들 또는 재료들을 포함한다. 예시적인 실제 프로세스들 또는 재료들은 제조 프로 세스, 제조에 사용된 재료, 부품/제품을 생산하는데 사용된 실제 문서, 부품/제품 실제 성능, 및 소정의 부품/ 제품 내에서 사용되거나 구현된 지적 재산권, 소정 부품/제품을 가공 또는 서비스한 엔티티, 및 소정 부품/제품 의 포스트 프로세싱을 포함한다. 커스터디(custody)의 실시예들은 소정 부품/제품의 물리적 측면뿐만 아니라 디지털 파일(예를 들어, 매뉴얼, 3D 프린트 파일, 구매 주문 등)에 대한 전자적 액세스 모두를 유지하거나 액세스한 엔티티들의 목록 또는 소정 부 품/제품과 관련된 문서를 포함한다. 커스터디의 실시예는 소정 부품/제품의 전부 또는 일부에 대한 화주들 (shippers), 수신인들, 제조업자들, 및 공급자들을 포함한다. 보수(remuneration) 또는 가격(price)은 또한 블록체인 또는 원장의 입력들을 통해 각각의 공급자, 하 위 계층 공급자 및 최종 아이템 고객 사이에서 추적 및 검증될 수 있다. 소정의 프로세스들, 요구들 또 는 지적 재산들과 관련된 보수 또는 가격도 추적될 수 있다. 도 32를 참조하면, 소정 부품/제품과 관련된 제품 정보에 대한 가격 및 출처가 모두 추적될 수 있는 예시적인 도면이 도시되어 있다. 소정 부품/제품을 생산 하는데 사용되는 프로세스, 재료, 지적 재산권 또는 고객 요구에 대한 보수 또는 가격은 블록체인 또는 원 장에 입력될 수 있으며, 이는 나중에 공급망 내의 공급자 또는 최종 아이템 고객에 의해 검증될 수 있 다. 보수 또는 가격 정보는 엔티티들 사이에서의 가격 및 협상된 이익을 투명한 공개 방식으로 집계하는데 사용 될 수 있으며, 이에 의해 공급망 내의 엔티티들이 소정 부품/제품에 대한 가격을 사전-협상할 수 있게 하며, 따라서 이들 거래들이 발생하는 속도 및 편의성을 향상시킨다. 또한, 특정 지적 재산권에 대한 보상이 추적될 수 있으므로, 이러한 지적 재산권의 소유자, 라이센서 또는 라이센스들은 이들 사용들에 대해 적절히 보상될 수 있다. 도 33을 참조하면, 지적 재산권의 소유자(33a-33n), 지적 재산권 자체( 107), 지적 재산권과 관련된 가격이 블록체인 또는 원장 내에서 추적되고 검증되는 블록도가 도시되어 있다. 지적 재산권 및 그것의 소유자는 공급 자, 하위 계층 공급자 및/또는 최종 아이템 고객에게 부품/제품과 관련된 지적 재산권의 출처를 검증할 수 있는 능력(블록체인 또는 원장을 통해)을 제공할 뿐만 아니라, 하나의 부품/제품에서 발견되는 다른 소유자들의 지적 재산권 요소들을 집계할 수 있는 능력도 제공한다. 실시예들은 또한, 각각의 부품/제품이 블록체인 또는 원장 항목 내에서 그것과 관련된 지적 재산권을 제공할 것이기 때문에, 지적 재산권의 소유자들이 기여한 지적 재산권을 적절히 보상받을 수 있게한다. 본 개시의 실시예는 임의 개수의 공급자 및 하위 계층 공급자 레벨들에 적용 가능하다는 것을 이해해야 한다. 예를 들어, 소정 부품/제품은 1, 2, 3개 이상의 공급자 및/또는 하위 계층 공급자를 가질 수 있다. 본 발명의 실시예에 따르면 공급자, 하위 계층 공급자 및/또는 최종 아이템 고객은, 직접 공급자(direct supplier)에 의해 서 최종 사용자에게 제공되는지 또는 하위 계층 공급자로부터 직접 공급자를 통해 제공되는지 여부에 관계없이, 각각의 부품 또는 요소의 출처를 추적하고 검증할 수 있을 것이다. 이것은, 특정 부품이나 요소의 출처를 포함할 수 있을 뿐만 아니라 부품이나 요소와 관련된 문서나 정보도 포함할 수 있다. 예를 들어, 부품을 생산하 는데 사용되는 프로세스, 부품을 형성하는데 사용되는 원자재, 상기 부품이 충족해야만하는 요구들 및 부품 혹 은 요소에 내재된 임의의 지적 재산권(예컨대, 특허, 상표 비밀, 발명, 노하우 등)은 상기 정보에 대한 이들의 액세스에 따라, 공급자 및/또는 최종 아이템 고객에 의해서 추적 및 검증될 수 있다. 도 1을 참조하면, 제조된 부품에 대한 추적가능성을 구비한 본 발명의 가상 분산 재고 관리 시스템의 실시예의 개략도가 도시되어 있다. 도 1에서, 소정 부품/제품에 대한 워크플로우는 진행중인 작업(work in progress: WIP)(24a)을 생성할 수 있는 제 1 제조업체 변환(the first manufacturer transformation)(23a)으로부터, 진행 중인 작업(WIP)(24b)을 생성할 수 있는 제 2 제조업체 변환(23b)으로, 그리고 최종 n(번호) 제조업자 변환(23 n)까지 추적된다. 전술한 실시예에서, 변환(23n)은 3D 프린터에 의한 부품의 3D 프린팅을 포함한다. 상술된 실시예에서, 프린트된 부품을 초래하는 변환들 다음으로 제품의 인코딩 및 최종 검사가 후속되 며, 그 다음으로 제품의 최종 배달이 후속된다. 다음을 유의해야 하는바, 각각의 변환 이후에, 블록체 인 또는 원장으로의 엔트리가 생성되어 각 변환들로부터의 정보(예를 들어, 요구들, 커스토디, 프로세스, 지적 재산권 등)를 기록한다. 이러한 정보는 공급자들 중 어느 하나(액세스가 허용된 경우) 및 최종 아이템 고객(2 9)에 대한 검증을 위해 이용가능하다. 따라서, 실시예들은 제조 변환에 따른 요구된 프로세싱이 인증 및 증명된 참가자들과 함께 사전정의된 프로세스 흐름의 일부로서 후속되게 한다. 실제로, 본 개시의 일 실시예에 따르면, 공급자, 하위 계층 공급자 또는 최종 아이템 고객은, 소정 부품/제품에 대한 제품 정보를 검증하기를 원할 수 있다. 예를 들어, 공급자, 하위 계층 공급자 또는 최종 아이템 고객은 소정 부품/제품이 올바른 프로세스, 올바른 원재료 또는 올바른 지적 재산권 을 이용하여 제작되었는지를 검증하기를 원할 수 있다. 공급자, 하위 계층 공급자 또는 최종 아이 템 고객은 부품/제품을 수령한 후 또는 부품/제품을 수령하기 전에, 관련된 분산 거래 레지스터(예를 들어, 블록체인 또는 원장)의 엔트리들로부터 상기 소정 부품/제품의 제품 정보를 결정할 수 있을 것이다. 공급자 , 하위 계층 공급자 또는 최종 아이템 고객은 그들의 개별 요구들을 충족하도록 제품 정보를 집계 할 수 있을 것인바, 예를 들어 그들이 부품/제품의 가격을 정확하게 책정했는지, 그들이 지적 재산권을 올바르 게 사용했는지 또는 그들이 올바른 엔티티들에게 제대로 보상했는지를 판별할 수 있다. 추가적인 특징은 개시된 시스템의 사용자가, 상기 비행 제어 시스템 예에서 집계된 특정 제조 부품들에 대한 집 계 권리(aggregation rights)를 기체 제조업자에게 부여하는 능력을 포함한다. 기체 제조업자는 기체의 모든 제조된 부품들에 대해 집계된 추적성 권리를 기체 운영자(airframe operator)에게 부여할 수 있다. 개시된 방법의 인프라스트럭처는 또한 제조된 부품들에 대한 사전 협상된 가격들이 거래를 가속화할 수 있도록 비용 및 협상된 이익을 투명한 방식으로 집계하는데 사용될 수 있다. 앞서 상세히 설명한 바와 같이, 거래들은 분산 원장에 로그되고(logged) 그리고 소거될 수 있다. 또한, 서로 다른 소유자들로부터의 지적 재산권 요소들 은 하나의 원장 엔트리 내에 집계될 수 있으므로, 각각의 지적 재산권들이 함께 추적될 수 있으며 그리고 개별 소유자들은 합의된 조건에 따라 보상될 수 있다. 비즈니스 관리 소프트웨어와의 통합 제품 제조업체는 종종 제품 계획, 제조, 배송, 마케팅, 판매, 재고 관리, 선적, 결제 등과 같은 공급망 추적과 관련된 데이터를 수집, 저장, 관리 및 해석하기 위해 ERP 소프트웨어(Enterprise Resource Planning)와 같은 비즈니스 관리 소프트웨어를 사용한다. ERP 소프트웨어는 히트 맵 생성과 같은 기능을 제공할 수 있다. 예를 들 어, 제조자의 ERP 소프트웨어는 복수의 원재료 공급자들을 추적하도록 구성될 수 있고, 그리고 히트 맵을 생성 할 수 있는바, 히트 맵은 어떤 공급자들이 마감일을 초과하는지(이런 공급자들은 스크린 상에 녹색으로 표시될 수 있음), 어떤 공급자들이 일반적으로 마감일을 지키는지(이런 공급자들은 노란색으로 표시될 수 있음), 어떤 공급자들이 마감일을 지키지 않는지(이런 공급자들은 빨간색으로 표시될 수 있음)를 나타낼 수 있다. 비록, 이러한 기능은 제조업자가 공급망 동향을 높은 수준으로부터 관찰할 수 있게하는 역할을 하지만, 그럼에 도 불구하고 제조업자가 더 미세한 수준의 데이터에 액세스함이 없이, 공급자에 관한 실시간 비즈니스 결정을 내리는 것은 매우 어렵다. 예를 들어, ERP 시스템은 종종 다른 운영 프로세스와 인터페이스되지 않는다. 결과 적으로, 운송 및 재고 관리와 같이, 여러 공급망들에 다수 계층들의 비 부가가치 프로세스가 포함된다. 안전하 고 추적가능한 제조 부품에 대한 본 발명의 방법은 본 명세서에 설명된 바와 같이 분산 원장을 사용을 통해 공 급망을 분리(disassociating)함으로써 이러한 비효율성을 감소시킨다. 안전하고 추적가능한 제조 부품에 대한 본 발명의 방법은 또한, 어플리케이션 프로그램 인터페이스(API: application program interface)를 추가로 제공하는바, API는 전술한 분산 원장 외에 기존 ERP 소프트웨어로부 터 데이터에 액세스할 수 있고, 공급자 성능에 대한 통합된 실시간 스냅 샷을 제공할 수 있다. 따라서, 사용자 는 이제 개별 제조 부품에 이르기까지 세부적인 수준으로 공급자 데이터에 액세스할 수 있다. 또 다른 실시예에서, 제품 수명 관리(PLM: product lifecycle management) 시스템 또는 다른 적용 가능한 컴퓨 터 시스템 내에서 지적 재산권(IP: intellectual property)을 추적하는 시스템이 제공되는바, 따라서 사용자 또 는 회사는 제조, 제작, 제공, 혹은 구매된 부품들, 조립체들, 제품들, 재료들, 프로세스들, 피처들, 및/또는 서 비스들과 관련되거나 이에 내재된 IP를 관리할 수 있다. 실시예들에 따르면, 소정 부품 또는 제품은 이와 관련 된 하나 이상의 개별 객체 또는 제품 정보를 가질 수 있다. 이러한 객체 또는 제품 정보에는 제품 내에 구현된 IP가 포함된다. 실시예들에 따르면, 소정 부품 또는 제품과 관련된 IP 객체들(105-107)은 시스템, 원장, 블록체 인, 분산 거래 레지스터 혹은 데이터베이스 내에 저장되거나 분류될 수 있고, 따라서 소정 부품 또는 제품과 관 련된 IP는 후속 사용을 위해 유지될 수 있다. 실시예들은 또한 시스템의 사용자, 회사 또는 고객이 레이아웃-디자인, 상표, 라이센스, 영업 비밀, 산업 재산, 특허, 저작권, 독점 정보, 민감한 정보 및 노하우를 포함하지만 이에 한정되지 않는 IP를 관리 및 재사용할 수 있게 한다. 실시예들 따르면, 또한 필요한 경우 적절한 보안 및 마킹이 부품/제품에 적용될 수 있도록 PLM 또는 유사한 시스템이 IP 컨텐츠에 대해 검색될 수 있다. 본 발명의 실시예들은 연구 개발, 제 3 자 라이센스, 및 실 패 분석을 포함하여 소정 부품 또는 제품 내에 내재되거나 이로부터 도출된 IP를 캡처, 분류, 추적, 보존 및 보 호하는 개선된 능력을 제공한다. IP의 다른 실시예는 또한 소정 부품/제품과 관련될 수 있는 기계, 전기, 펌웨 어, 소프트웨어, 프로세스, 및 재료를 포함한다. 소정 부품/제품과 관련될 수 있는 다른 요소들 중 일부는 또한 부품/제품 내에 구현된 IP 소스의 유산 또는 이력, IP가 사용되는 위치 및 IP가 사용되는 대상을 포함한다. 또 한, 실시예에 따르면 소정 부품/제품의 IP 객체들은 암호화로 인코딩되거나 해싱될 수 있다. 또 다른 실시예에 서, 소정 부품/제품의 IP 객체는 다른 제품들에서의 사용을 위해 개인 또는 공공 시장(예를 들어, 디지털 시 장)에서 이용가능할 수 있다. 암호화 방법의 실시예는 공개 키 또는 개인 키를 포함하거나 블록체인과 같은 분 산 원장을 포함할 수 있다. 도 34는 생산 사이클을 통해 소정 부품 또는 제품과 관련된 IP 객체들(IP 1-IP n)을 나타내는 예시도이다. 도 34에 도시된 바와 같이, 파트 1, 파트 2, 파트 3 및 파트 4와 같이 제조 혹은 제작 공정의 일부로서 다수의 파 트들 혹은 스테이지들을 통과한 제품은, 각 스테이지에서 다수의 IP 객체들을 가질 수 있다. 실제로, 이러한 것 은, 최종 아이템이 수많은 소스들로부터의 다양한 부품들을 포함하거나 또는 최종 사용자를 위해 파이널라이징 되거나 준비가 되기 전에 다수의 제조 프로세스들을 거쳐야만 하는 경우에 종종 발생한다. 이러한 시나리오 및 다른 유사한 시나리오에서, 최종 아이템에 내재된 모든 IP를 추적하는 것은 종종 어렵다. 본 발명의 실시예에서 공급자 또는 제조업자는 부품/제품에 구현된 IP가 추적되고 검증될 수 있도록, 생산 수명주기 동안 또는 그 유 효 수명 동안 부품 또는 제품에 구현된 IP를 데이터베이스 또는 원장에 기록할 수 있다. 다시 말해서, 소정 부 품/제품과 관련되거나 이에 내재된 IP의 이력 또는 유산은 추적될 수 있으며 소정 부품의 공급망 내의 공급자들 또는 최종 사용자에 의해 이용될 수 있다. 실시예에 따르면 소정 부분/제품 내에 구현된 IP는 블록체인 또는 원장 내에 기록될 수 있지만, 실시예는 IP가 임의의 수의 사용자에 의해 액세스될 수 있는 전자 데이터베이스 내에서 관리되거나 유지될 수 있음을 제공한다. 전자 데이터베이스의 일례들은 단일 사용자 또는 단일 회사에 의해 사용되는 폐쇄 또는 개인 데이터 베이스를 포함한다. 다른 실시예에서, 전자 데이터베이스는 복수의 사용자 및/또는 회사에 의해 액세스될 수 있 다. 또 다른 실시예에서, 전자 데이터베이스는 공개 시장(public marketplace)가 될 수 있는바, 여기서 IP의 소 유자, 생성자 및 발명가는 부품/제품에 내재된 IP 사용자와 함께, 특정 IP가 어디에서 사용되는지, IP가 얼마나 자주 사용되는지, 이러한 IP를 사용할 권리에 대해 누구에게 보상해야하는지에 관한 정보에 액세스할 수 있다. 일실시예에서, 최종 아이템은 다른 엔지니어링, 품질 또는 고객 사양 또는 요구과 함께 하나 이상의 IP 객체들 을 포함할 수 있다. 따라서 최종 아이템에 구현된 IP 객체들은 그것의 사용 및 수명주기 동안 최종 아이템을 따 르는 다른 최종 아이템 사양에 포함되도록 작동할 수 있다. 최종 아이템은 포함된 모든 IP 객체들을 기반으로 특정 IP 객체에 대한 제한 및 지정을 가질 수 있다. IP 객체들은 집계, 추적, 재사용 및 판매가 가능하다. 우주 기반 상업 및 물류에의 적용(Application to Space-Based Commerce and Logistics) 우주 탐사 및 식민지화는 우주 공간을 통한 데이터 전송을 용이하게하기 위해 디지털 물류 테일(digital logistics tail)을 요구할 수 있다. 미래에 제조 아이템들은 디지털 빌드 파일로 구매 및 판매될 것이며, 디지 털 빌드 파일은 고객이 활용하여 실제 제조 아이템으로 변환될 수 있다. 튼튼한 물류 패키지들을 우주선에 실어 서 지구로부터 먼 행성 또는 우주 정거장으로 운송하는 것은 비효율적이므로, 우주 비행 및 우주 식민지에서는 3D 또는 4D 프린터(3D 프린트 부품 및 자체 조립을 포함한 4D)를 사용하여 디지털 아이템 또는 페이로드를 물리 적 제조 아이템으로 변환하는 툴 기계류(tool machinery)를 활용할 수 있다. 도 35 및 도 36을 참조하면, 물류 시나리오의 5 가지 일례들이 도시되고 다음을 포함한다: 1. 지구를 공전하는 우주 식민지 또는 우주 정거장 또는 지구-달 라그랑주 포인트(Earth-Moon Lagrangian point)를 포함하는 우주 내의 소정의 다른 준-안정 위치; 2. 지구를 공전하는 우주 공장; 3. 공전형 또는 고정형 우주 식민지와 지구 사이를 이동하는 우주선; 4. 달 또는 다른 행성의 우주 식민지 또는 우주 공장; 5. 우주 공간에서의 대형, 초대형 및 초대형 구조물을 포함한 구조물의 직접 프린트(예를 들어, 소행성 채광); 더 작은 부품들은 프린트된 이후에 로봇을 이용하여 자가-조립 또는 자동화된 조립에 의해 조립될 수 있다 (예를 들면, Legos® 등). 우주 기반 엔티티들(예를 들어, 우주 식민지, 우주 공장, 우주 왕복선, 우주선, 우주 정거장, 및 의도된 목적에 적합하고 당업자에게 이해되는 임의의 다른 엔티티)이 지구와 통신하기 위해(예를 들어, 시스템 15), 우주 기반 엔티티로/로부터 디지털 데이터의 전송을 용이하게 하기 위해 통신 시스템이 활용될 수 있다. 예를 들어, 상기 시스템은 딥 스페이스 네트워크(DSN: deep space network)를 이용하여 우주 기반 엔티티와 통신할 수 있으 며, DSN은 전 세계의 3 개 위치에서 안테나 컴플렉스(예를 들어, 지상 송수신 기지들)로 구성될 수 있으며, 이 는 우주 기반 엔티티를 위한 통신 시스템의 지상 세그먼트를 형성한다. 지구 상에서 대략 120도 떨어진 이들 시 설들은 우주 기반 엔티티들을 지속적으로 커버하고 추적한다. 각각의 컴플렉스는 70 미터 안테나 하나와 여러 개의 34 미터 안테나들을 포함한다. 이들 안테나들은 각각의 우주 기반 엔티티들의 통신 요건을 충족시키기 위 해 개별적으로 또는 조합되어(안테나 어레잉) 사용될 수 있다. 딥 스페이스 통신 시스템은 라디오, 안테나, 송 신기, 신호 검출기, 변조 기술, 채널 코딩 이론, 데이터 압축, 시뮬레이션, 광학 기기, 광학 시스템 설계, 광학 검출기, 레이저, 정밀 포인팅 시스템 및 의도된 목적 및 당업자에 의해 이해되는 기타 적합한 통신을 포함할 수 있다. 상기 시스템은 우주 기반 엔티티들과 직접 통신할 수도 있으며 또는 우주 기반 엔티티들과 통신하기 위하여 중계기들(relays)을 활용할 수도 있다(예컨대, 통신 위성들, 외계 송수신기들(extraterrestrial transceivers) 및 신호를 중계할 수 있는 안테나 어레이들을 구비한 다른 우주-기반 엔티티들). 통신 위성들은 1) 정지 궤도(GEO)를 갖는 정지 위성, 2) 중간 지구 궤도(MEO) 및 3) 저 지구 궤도(LEO)를 포함하는 적어도 하 나의 유형의 궤도를 가질 수 있다. 통신 위성들의 궤도 유형의 일례들은 지구에만 국한되지 않는다. 본 발명은 행성, 소행성, 및 의도된 목적에 적합하고 당업자에게 이해되는 임의의 다른 질량 덩어리들을 포함하여, 우주 공간에서 다른 행성을 선회할 수 있는 통신 위성들을 모두 고려한다. 도 37을 참조하면, 3D 프린터로 제품들을 제조하기 위한 디지털 데이터 및 정보가 우주 기반 엔 티티에 공급 및 재공급될 수 있도록, 시스템이 이용될 수 있다. 각각의 시나리오는 디지털 물류 공급 카탈 로그 또는 디지털 공급 아이템 파일을 우주 기반 엔티티 또는 우주 기반 고객에게 제공할 수 있다. 디지털 공급 아이템 파일은 제작 또는 프린트될 해당 부품에 대한 디지털 스레드를 포함할 수 있다. 디지 털 물류 공급 카탈로그로부터의 디지털 공급 아이템 파일은 해당 부품을 제조하기 위해 우주 기반 고객 에 의해 구매될 수 있다. 물류 공급 카탈로그로부터의 디지털 공급 아이템 파일은 블록체인 스마트 계약 또는 의도된 목적에 적합하고 당업자에게 이해되는 임의의 다른 지불 방법에 의해서 구매될 수 있다. 디지털 공급 아이템 파일의 무결성을 보장하기 위해, 디지털 공급 아이템 파일은 시스템과 관련 하여 전술한 바와 같은 블록체인 또는 디지털 원장을 이용함으로써 우주 기반 엔티티로 전송되는 디지털 트윈 데이터를 포함할 수 있다. 블록체인은 하나 이상의 사이드 블록체인을 수반하거나 이를 통해 구축될 수 있다. 이러한 사이드 블록체인은 각각 블록체인 내의 소정의 블록이나 엔트리로부터 기원되거나 나올 수 있으며 오리 지널 블록체인에 다양한 엔드 포인트가 포함되도록 바깥쪽으로 확장될 수 있다. 예를 들어, 블록체인은 5 개의 블록체인을 포함할 수 있는바, 여기서 은 소정의 부품/제품의 원료에 대한 엔트리(entry)이고, 는 소정의 부품/제품의 프로세싱에 대한 엔트리이며, 은 소정의 부품/제품의 프로세싱 엔티티이며, 는 소정의 부품/ 제품과 관련된 특허이며,는 프로세싱 엔티티에 지불된 비용이다. 원료 공급자를 식별하는 새로운 블록체인이 블록체인 1에 추가될 수 있으며, 또는 소정의 부품/제품에서 프로세싱을 수행하는 기계류의 인증을 나타내는 새 로운 블록체인이 블록체인 3에 추가될 수 있다. 따라서, 실시예들은 단순히 제 5 블록체인의 말단에 블록체인을 추가하는 것이 아니라, 이들 5 개의 블록체인 중 임의의 하나로부터 새로운 블록체인이 추가될 수 있어 특정 블 록체인과 관련된 정보를 제공할 수 있다. 다른 일례에서, 소정의 부품/제품은 다수의 블록들을 갖는 메인 블록체인에 의해서 표현될 수 있으며, 여기서 블록체인의 각각의 블록은 디지털 물류 공급 카탈로그로부터의 소정의 부품/제품 조각과 관련된다. 각각의 조각 은 다른 공급자들로부터 공급되었을 수 있으며, 각각의 조각은 다른 원재료들, 다른 제조 공정들, 그 안에 구현 된 다른 지적 재산권들 및 서로 다른 가격들 등과 같은 그 자체의 관련된 제품 정보를 가질 수 있다. 이와 관련 하여, 메인 블록체인의 각각의 블록은 소정 부품/제품의 조각과 관련될 수 있고 그리고 사이드 블록체인은 그 특정 조각 제품 정보를 나타내는 메인 블록체인으로부터 바깥쪽으로 연장될 수 있다. 도 2와 유사하게, 제 1 사용자 A로부터 제 2 사용자 B 로의 블록체인 거래는 먼저 해시를 생성함으로써 원 장에 기록된다. 제 1 사용자 A는 지구 상에 위치할 수 있고 제 2 사용자 B는 도 36 및 도 37에 도시된 바와 같이 우주 기반 엔티티/고객일 수 있다. 그런 다음, 제 1 사용자 A는 제 1 사용자의 개인 키로 상기 해시에 서명한다. 제 1 사용자의 공개 키 및 제 2 사용자 B의 어드레스가 첨부된다. 제 2 사용자 B의 공개 키 및 어드레스가 획득되고, 그리고 거래는 원장에 기록된다. 일단 우주 기반 고객이 디지털 공급 아이템 파일을 수신하면, 상기 디지털 공급 아이템 파일의 무결성이 프로세싱될 수 있다. 예를 들어, 디지털 공급 아이템 파일과 관련된 워크 플로우 및 생산 프로세 스는 전술한 블록체인 기술을 이용하여 생산 프로세스를 통해 전송 및 검증될 수 있다. 우주 기반 고객은 디지털 공급 아이템 파일에서 수신된 데이터를 제조 목적으로 3D 프린터에 제 공할 수 있다. 디지털 공급 아이템 파일의 성능 무결성을 보장하기 위해, 컨볼루션 신경망(CNN) 어플리케 이션을 활용함으로써 시뮬레이션된 빌드 파일이 비교를 위해 디지털 공급 아이템 파일과 함께 제공될 수 있는바, 이는 도 38 내지 도 43을 참조하여 후술될 것이다. 3D 프린터는 디지털 공급 아이템 파일에 제공된 데이터로부터 제조 아이템을 프린트할 수 있다. 제품들의 제작을 위한 디지털 데이터 및 정보를 제공하기 위한 공급 시스템은 품질 관리 및 프로세스 무결 성의 복수의 사례들(instances)을 포함할 수 있는바, 1) 디지털 공급 아이템 파일의 데이터 품질 및 생산 프로세스를 보장하기 위해 블록체인을 이용하는 것, 2) 디지털 공급 아이템 파일의 생산 프로세스 품질을 보장하기 위해 블록체인을 이용하는 것, 및 3) 제조 제품을 프린트하는 동안 각각의 레이어(layer)를 검증함으 로써 성능 무결성을 보장하기 위해 컨볼루션 신경망 평가를 이용하는 것을 포함할 수 있다. 이것은 제조 부품이 디지털 공급 아이템 파일로부터의 오리지널 제품과 일치하는지를 보장하기 위한 적어도 3 개의 검증 스테 이지들을 허용한다. 컨볼루션 신경망 평가를 구비한 어플리케이션(Application with Convolutional Neural Network Evaluation) 부품들의 적층 제조 및 포스트-프로세싱은 컨볼루션 신경망(CNN) 평가를 포함할 수 있으며, 컨볼루션 신경망(CNN) 평가의 실시예들은 도 38 내지 도 43에 도시된다. 따라서, 프린터나 프린터와 같은 적층제조 머신에서 부품 또는 부품과 같은 부품을 층층별로(layer-by-layer) 제작하기 위한 적층 제조 시 스템은 적층 제조 빌드(build) 프로세스를 따를 수 있으며, 적층 제조 빌드 프로세스는 프로세스 과정(in- process: 이하, '프로세스 과정' 혹은 '인-프로세스'라 함) 빌드 파라미터들의 초기 세트를 조정하기 위한 폐쇄 -루프 제어 구조(closed-loop control structure)를 포함한다. 본 명세서에서 이용되는 바와 같이, \"프로세스 과정(in-process)\" 이라는 용어는, 적층 제조 머신에서 부품이 제조되는 프로세스 동안의 시간 기간을 지칭한다. \"프로세스 과정(in-process)\" 이라는 용어는 \"포스트-프로세스(post-process)\" 라는 용어과 구별되며, \"포스트-프로세스(post-process)\" 라는 용어는 본 명세서에서 적층 제조 머신에서 부품의 제조된 이 후의 시간 기간을 지칭한다. 전술한 바와 같이, 폐쇄 루프 제어 구조는 트레이닝된 인공 지능 모듈을 갖는 저속 제어 루프(slow control loop)를 포함하고, 그리고 상태 머신을 갖는 고속 제어 루프(fast control loop)를 추가로 포함할 수 있다. 본 명세서에서 사용된 \"저속 제어 루프\"는 전체적으로 초 단위의 제어기 이득 업데이트 주기를 갖는 제어 루프를 의미하고, \"고속 제어 루프\"는 마이크로초 단위의 제어기 이득 업데이트 주기를 갖는 제어 루프를 의미한다. 트 레이닝된 인공 지능 모듈은 리커런트 인공 신경망(recurrent artificial neural network)을 갖는 딥 러닝 모듈 일 수 있다. 전술한 바와 같이, 상기 시스템은 프로세스 과정(in-process)에서 에너지 소스에 의해 형성된 멜트 풀(melt pool)을 나타내는 실시간 멜트 풀 데이터를 획득하는 멜트 풀 모니터링 시스템 및 프로세스 과정의 부 품 레이어들의 레이어 이미지들을 획득하는 빌드 레이어 이미지 센서를 포함한다. 빌드 파라미터들의 초기 세트, 빌드 프로세스에 대응하는 조정된 빌드 파라미터들의 시간 기반의 시퀀스, 레이어 이미지들 및 멜트 풀 데이터는 저속 제어 루프의 트레이닝된 인공 지능 모듈에 대한 입력으로서 전송된다. 멜프 풀 데이터는 고속 제 어 루프의 상태 머신에 대한 입력으로서 전송될 수 있다. 트레이닝된인공 지능 모듈은, 프로세스 과정에서 획득된 레이어 이미지들을 평가하도록 구성된 제 1 CNN 및 포 스트-프로세스에서 획득된 완성된 부품들의 이미지들을 평가하도록 구성된 적어도 하나의 제 2 CNN으로부터의 평가 데이터를 사용하여 트레이닝될 수 있다. 예를 들어, CNN은 포스트-프로세스에서 획득된 섹션화된 완성된 부품의 2 차원 이미지들을 평가하도록 구성될 수 있고, 다른 CNN은 완성된 부품에 대한 컴퓨터 단층 촬영(CT) 스캐닝에 의해 포스트 프로세스에서 획득된 부품의 3 차원 이미지를 평가하도록 구성될 수 있다. 이제 도 38을 참조하면, 적층 제조 머신을 위한 딥 러닝 프로세스 제어기의 동작이 도시된다. 시스템 은 프로세스 과정(in-process)의 빌드 파라미터들의 초기 세트를 조정하기 위한 폐쇄 루프 제어 구조(910, 920)를 포함한다. 딥 러닝 프로세스 제어기는 트레이닝된 딥 러닝 리커런트 인공 지능(AI) 모듈에 의 해 구현될 수 있는 바와 같이, 고급 비선형 확률 제어(advanced non-linear stochastic control) 및 컴플렉스 적응형 모델 기반 제어(complex adaptive model-based control)의 하이브리드일 수 있다. 따라서, 딥 러닝 AI 시스템으로부터 트레이닝된 딥 러닝 리커런트 AI는 개선된 저속 프로세스 피드백 제어를 위해, 부품 또는 부품과 같은 적층 제조 부품의 제조 동안 빌드 레이어 이미지들의 저속 층층별 평가 (slow layer-to-layer evaluation)의 외부 루프를 폐쇄하기 위해 이용된다. 또한, 트레이닝된 딥 러닝 리커런트 AI는 고속 프로세스 과정 멜트 풀(fast in-proces melt pool) 모니터링 센서 데이터에 기초하여 개 별적인 상태-변동 고속 제어(separate state-variable fast control )에 영향을 미치게 하기 위하여 상태 머신의 구성을 업데이트하도록 출력을 이용할 수 있다. 도 38로부터 알 수 있는 바와 같이, 트레이닝된 딥 러닝 AI 모듈로부터의 저속 루프 피드백 및 상태 머신으로부터의 고속 루프 피드백은 블록 610에서, 조절된 적층 제조 빌드 파라미터들을 계산하는데 이용될 수 있는바, 이는 부품 품질을 개선하는 방식 으로 적층 제조 머신을 동작시키기 위한 것이다. 저속 프로세스 피드백 제어 및 상태-변동 고속 제어 의 피드백 루프들 둘다는, 적층 제조 빌드 프로세스에 대한 최적의 제어를 위해 적층 제조 생산(예컨대, 용접(welding)) 프로세스 동안 각각의 피드백 루프에 서로 다른 제어 권한을 제공하도록 개별 이득들을 갖 는 적층 제조 머신 빌드 파라미터들을 수정하는 역할을 한다. 따라서, 본 실시예에서, 폐쇄 루프 제어 구 조는 트레이닝된 딥 러닝 리커런트 AI 모듈 형태인 트레이닝된 AI 모듈을 갖는 저속 제어 루프 및 상 태 머신을 갖는 고속 제어 루프를 포함한다. 저속 제어 루프에서, 빌드 파라미터 설정 모듈에 의해 생성된 초기 적층 제조 빌드 파라미터들 은 트레이닝된 딥 러닝 리커런트 AI 모듈에 입력될 수 있다. 트레이닝된 AI 모듈로의 다른 입력들은, 시간에 대한 적층 제조 프로세스 변수들 및 파라미터들을 나타내는 순차적(sequential) 시간-기반 데이터 (예를 들어, 아르곤 플로우, 온도, 사운드/진동 변환기 레벨, 전압, 전류 등), 빌드 레이어 이미지 센서 에 의해서 프로세스 과정에서 획득된 빌드 레이어 이미지들 및 멜트 풀 모니터링 시스템에 의해서 프로세스 과정에서 획득된 멜트 풀 데이터를 포함할 수 있다. 데이터와 관련하여, 적층 제조 머신(31 또는 530)은 순차적 시간 기반 파라미터 데이터베이스에 저 장될 수 있는 순차적 시간 기반 저속 프로세스 데이터를 포함할 수 있다. 적층 제조 머신(31 또는 530)에 의해 생성된 순차적 시간 기반 저속 프로세스 데이터(예를 들어, 아르곤 플로우, 온도, 사운드/진동 변환 기 레벨, 전압, 전류 등)는 각각의 빌드 레이어가 제조되는 동안 수집될 수 있다. 멜트 풀 데이터는 딥 러 닝 리커런트 AI 모듈로의 입력 전에 사전 조정기(preconditioner)에 의해 사전 조정될 수 있다. 예를 들어, 사전 조정기는 각각의 빌드 레이어 혹은 빌드 레이어들의 세트에 대하여 멜트 풀 데이터를 축 적 및 평균하도록 프로그래밍될 수 있다. 사전 조정은 더 짧거나 더 긴 프레임 레이트를 갖도록 조정될 수 있다. 고속 제어 루프에서, 멜트 풀 데이터는 트레이닝된 딥 러닝 AI 모듈로부터의 출력과 함께 상태 머신에 입력될 수 있다. 트레이닝된 딥 러닝 AI 모듈로부터의 상태 머신 출력은 고속 제어 루프(92 0)의 일부로서 사용될 수 있으며, 이는 프로세스 제어 이득 업데이트 상에서 별도의 상태-변수 내부 제어 루프 로 구성될 수 있다. 예를 들어, 후술되는 바와 같이, 장단기 메모리(LSTM: long short-term memory)로부터의 상 태 머신 출력은 상태 머신에 입력될 수 있으며 그리고 멜트 풀 제어의 고속 루프 폐쇄를 용이하게하는데 사용될 수 있다. 도 41에 도시된 기본 실시예에서, 폐쇄 루프 제어 구조는 빌드 레이어 이미지 센서에 의해서 프로세 스 과정에서 획득된 부품의 레이어 이미지들을 평가하도록 트레이닝 및 구성된 CNN 형태의 트레 이닝된 인공 지능(AI) 모듈을 포함한다. CNN에 의해 제공된 평가 결과(각각의 캡처된 레이어 이미지 가 레이어의 예상된 또는 원하는 외관에 대응하는 정도를 나타낼 수 있음)는, 블록에서 이용되어 적층 제 조 머신의 조정된 빌드 파라미터들을 계산하는바, 따라서 빌드 프로세스가 블록에서 계속됨에 따라 후속 레이어들의 빌드에 영향을 미칠 수 있다. 평가 결과는 각 빌드 레이어 이미지의 유형을 소정 분류(예 를 들어, 매우 양호함, 양호함, 적당함, 나쁨, 기타 등등)로 할당한 형태일 수 있다. 저속 프로세스 피드백 제어는 컨볼루션 뉴럴 네트워크(CNN: convolutional neural network) 평가를 이용하여 빌드 레이어 이미지들과 적층 제조 머신 빌드 파라미터들 사이의 제어 루프를 폐쇄할 수 있 다. 부품 또는 부품과 같은 적층 제조 부품의 각 층이 제조됨에 따라, 시간 기간의 시작시에, 중간에, 종료시에 이미징이(imaging)이 수행되거나 또는 레이어를 제작하는 시간 동안 비디오에 의해 연속적으 로 촬영될 수도 있다. 적층 제조 부품 제작이 진행됨에 따라, 빌드 레이어 이미지들은 적층 제조 부품 제 작 프로세스의 전 과정 동안 수집될 수 있다. CNN 평가는 정상적이지 않거나(off-nominal) 또는 바람직하 지 않은 빌드 레이어 이미지 내의 피처들을 인식하도록 미리 트레이닝될 수 있다. 이러한 정상적이지 않은 또는 바람직하지 않은 조건을 정정하기 위해, CNN 평가는 적층 제조 생산 공정을 제어하는 적층 제조 머신 빌드 파라미터를 조정하기 위해 저속 프로세스 피드백을 활용한다. 적층 제조 머신 빌드 파라미터 는 빔 파워(beam power), 스캔 속도, 스캔 간격, 빔 포커스 및 빔 듀티 사이클을 포함하지만 이에 한정되 지 않는 적층 제조 공정 동안 파우더 레이어에 적용되는 특정 에너지 밀도에 영향을 미칠 수 있다. 이와 관련하여, 저속 프로세스 피드백 제어는 적층 제조 머신 빌드 파라미터들의 제어기 이득들이 레 이어 빌드들 사이에서, 수초 내에 업데이트될 수 있게 한다. 비디오 이미징이 사용되는 경우, 트레이닝된 CNN 평가는 밀리 초 단위로 또는 레이어를 제조하는데 요구되는 시간보다 짧은 시간 내에 제어기 이득을 업데 이트할 수 있다. 저속 프로세스 피드백 제어는 적층 제조 머신 빌드 파라미터와 빌드 레이어 이미지 사이의 이전에 모델링된 관계 및 불확실성에 의존할 수도 있다. 이러한 것은, 가령, 다변수 비선형 모델 예측 제어(multivariable non-linear Model Predictive Control: MPC) 및 재귀형 베이시안-기반의 제어 체계들 (recursive Bayesian-based control schemes) 등의 APC(Advanced Process Control) 방법을 활용함으로써 제어 기 이득에 영향을 미칠 수 있다. 도 35 내지 도 44의 데이터베이스들 및 프로세스들로부터의 데이터, 예를 들어(이에 한정되지는 않지만), CNN 평가, 각 빌드 레이어의 이미지, 빌드 레이어 이미지 데이터베이스, 완성된 부품의 2D 이 미지, 2D CNN 평가, 완료된 부품의 3D CAT 스캔 이미지, 3D CNN 평가, AM 빌드 파라미터 구성 파일, AM 파라미터, 멜트 풀 모니터링 데이터 및/또는 멜트 풀 데이터베이스는 상기 시스 템과 관련하여 전술한 바와 같은 블록체인 또는 디지털 원장에 의해 활용되거나 및/또는 포함될 수 있다. 따라서, 전술한 상태들에서와 같이, 프로세스의 일부로서 수집된 이미지들 및 데이터를 포함하여(하지만 이에 제한되지 않는), CNN 평가는 전술한 것과 유사한 방식으로 디지털 원장에서 거래로서 기록될 수 있다. 따라 서, 출처, 신뢰성(authenticity) 및 추적가능성(traceability)은 연속 생산에서 유지되며, 후속 상태에서 이용될 수 있다. 도 39를 참조하면, 저속 프로세스 피드백 제어를 위한 CNN은 포스트-프로세스 출력 데이터를 더 포함하는 증강 시스템일 수 있다. 예를 들어, 딥 러닝 리커런트 AI를 트레이닝시키고 업데이트하기 위한 입력으로서 사용 될 수 있는 여러 상이한 데이터 스트림들이 데이터베이스들로 수집될 수 있다. 적층 제조 머신의 저속 빌 드 프로세스 피드백 제어 동안 생성된 각각의 빌드 레이어의 이미지들은 데이터베이스로 수집될 수 있다. 증강 시스템은 또한 고속 프로세스-과정 멜트-풀 모니터링 센서 데이터를 포함할 수 있는바, 이는 대형의 이진 데이터베이스로 수집될 수 있다. 증강 시스템은 또한, 적층 제조 2D 포스트 프로세스를 포함할 수 있다. 적층 제조 2D 포스트 프로세 스는 부품-품질 분류를 위한 포스트-프로세스 2D CNN 평가의 분류 출력(예컨대, 과소 융용 (undermelt), 딱 알맞음(just-right), 과도 융용(overmelt))을 포함할 수 있다. 적층 제조 프로세스의 전개 동 안, 적절한 깊이에서의 분류 출력의 이미지는 프로세스 과정중 획득된 적층 제조 레이어의 관련 이미 지와 직접적으로 관련이 있을 수 있으며, 이는 인-프로세스(in-process) 빌드 레이어 이미지와 포스트-프 로세스 CNN 분류 출력 사이의 상관 관계를 제공할 수 있다. 증강 시스템은 또한, 적층 제조 3D 포스트-프로세스를 포함할 수 있다. 적층 제조 3D 포스트-프로세 스는 부품 품질에 대한 컴퓨터-보조 단층 촬영(computer-aided tomography: CAT) 스캔의 포스트-프 로세스 3D CNN 평가의 기공 및/또는 보이드들의 분류 출력을 포함할 수 있다. 특정 깊이에서의, 포스트-프 로세스 3D CNN 평가는 관련된 인-프로세스 빌드 레이어 이미지에 직접 상관될 수 있으며, 이는 프로 세스 전개 및 생산 둘다 동안에 발생할 수 있다. 따라서, 딥 러닝 AI 모듈을 트레이닝시키기 위한 교사 데이터(teacher data)는 도 39에 의해 표현된 데이 터 증강 모드에서 부품을 빌드하도록 적층 제조 머신를 동작시킴으로써 수집될 수 있다. 이해되는 바와 같 이, 특히, 인-프로세스 빌드 레이어 이미지들을 평가하는 역할을 하는 기본 CNN은, 블록 및 블 록으로 각각 표시되는 바와 같이, 포스트-프로세스에서 획득되는 완성된 부품들의 이미지들을 평가하도록 구성된 하나 이상의 추가 CNN들(722, 732)에 의해서 증강될 수 있다. 실제 이미지들은 또한 빌드 레이어 이미지 데이터베이스에서 수집될 수 있다. 블록에서, 적층 제조 머신에 의해 생성된 부품들은, 예를 들어, 부품을 절단하고 공지된 레이어 깊이에서 노출된 절단면을 폴리싱한 다음, 이미징 카메라를 사용하여 노출된 표면의 2차원(2D) 이미지를 캡처함으로써 포스트-프로세스 섹션화된다. 그 후, 포스트-프로세스에서 캡처된 2D 이미지들은 CNN에 의해 서 평가 및 분류될 수 있다. 예를 들어, 가능한 분류는 과소 융용(under-melt), 딱 알맞음(just-right), 과도 융용(over-melt)을 포함할 수 있다. 소정 레이어 깊이에서의 포스트-프로세스 2D 이미지는 프로세스 과정 에서 획득된 레이어의 관련 이미지와 직접 관련될 수 있다. 블록에서, 적층 제조 머신에 의해 제작된 부품은 전체 부품의 3 차원(3D) 이미지를 캡처하 도록 예를 들어, 컴퓨터 보조 단층 촬영(CAT) 장비를 사용하여 포스트-프로세스에서 스캐닝될 수 있다. 포스트- 프로세스에서 캡처된 3D 이미지는 CNN에 의해 평가 및 분류될 수 있다. 예를 들어, 분류는 완성 된 부품의 다공도(degree of porosity) 및/또는 완성된 부품에 공극들이 존재하는 정도를 나타낼 수 있다. 전술한 바와 같이, 인-프로세스 빌드 레이어 이미지들은 빌드 레이어 이미지 데이터베이스에서 수집 될 수 있다. 다른 인-프로세스 데이터 역시도, 딥 러닝 AI 모듈을 트레이닝하는데 이용되도록 수집될 수 있다. 예를 들어, 멜트 풀 모니터링 시스템에 의해서 프로세스 과정 동안 획득된 고속 프로세스 멜트 풀 데이터는 이진 데이터베이스에 저장될 수 있으며, 그리고 레이어가 제조되는 동안 적층 제조 머신 에 의해 생성된 순차적 시간 기반 데이터는 순차적인 시간 기반 파라미터 데이터베이스에 저장 될 수 있다. 도 40을 참조하면, 딥 러닝 AI 시스템을 트레이닝하기 위한 구성이 도시되어 있으며, 이는 딥 러닝 리커런 트 AI를 트레이닝 및/또는 업데이트하기 위한 입력으로서 수집될 수 있는, 증강 시스템으로부터 의 데이터를 이용할 수 있다. 예를 들어, 빌드 레이어 이미지 데이터베이스의 CNN 평가의 출력은 딥 러닝 리커런트 AI의 트레 이닝에 대한 교사 입력(teacher input)으로서 작용할 수 있다. 적층 제조 2D 포스트-프로세스의 2D CNN 평가의 출력은 부품-품질 분류를 위해 이용될 수 있고 그리고 딥 러닝 리커런트 AI의 트레이닝 에 대한 또 다른 교사 입력으로서 작용할 수 있다. 적층 제조 3D 포스트-프로세스의 3D CNN 평가의 출력(CAT 스캔을 포함할 수 있음)은, 부분 품질 평가를 위해 이용될 수 있고 그리고 딥 러닝 리커런트 AI의 트레이닝에 대한 또 다른 교사 입력으로서 작용할 수 있다. 고속 프로세스 멜트 풀 모니터링 센서 데이터베이스는 딥 러닝 리커런트 AI의 트레이닝에 대한 입력으로서 이용되기 전에 각각의 빌드 레이어 또는 빌드 레이어 섹션에 걸쳐 사전 조정될 수 있다(예를 들어, 누적, 평균, 분산, 공분산 등). 사전 조정(preconditioning)은 제어 루프 업데이트 주기와 동기화하 기 위해 필요에 따라 더 짧거나 더 긴 프레임 레이트를 위해 조정될 수 있다. 순차적인 시간-기반 파라미터 데 이터베이스는 또한 트레이닝, 재트레이닝 및/또는 업데이트 목적을 위해 딥 러닝 리커런트 AI의 트레 이닝에 대한 입력으로서 이용될 수 있다. 추가적인 적층 제조 부품 설계 파라미터 정보(예를 들어, 형상, 위치 등)를 제공하기 위해, 부품 설계 데이터베이스로부터의 적층 제조 빌드 파라미터 구성 파일(예 를 들어, Magics)이 또한 딥 러닝 리커런트 AI의 트레이닝에 대한 입력으로서 이용될 수도있다. 딥 러닝 리커런트 AI의 트레이닝에 대한 데이터베이스 입력은 딥 러닝 리커런트 AI의 트레이닝 을 효과적으로 수행하기 위해 올바르게 동기화될 수 있다. 딥 러닝 리커런트 AI의 트레이닝에 대한 데이터베이스 입력의 이용가능성은 딥 러닝 리커런트 AI의 트레이닝의 효과에 영향을 줄 수 있 다. 또한, 딥 러닝 AI 시스템은 트레이닝 동안 구성될 수 있는 딥 러닝 리커런트 AI로부터의 상 태 머신 출력을 포함할 수 있으며, 이는 멜트 풀 제어 프로세스의 고속 루프 폐쇄를 용이하게 하는데 사용 될 수 있다. 따라서, 도 40에 도시된 바와 같이, 도 39와 관련하여 설명된 바와 같이 수집된 데이터는, 딥 러닝 AI 모듈 을 트레이닝시키기 위한 입력으로서 사용될 수 있다. 빌드 레이어 이미지를 특징짓는 CNN의 출 력은 트레이닝 동작 모드에서 딥 러닝 AI 모듈에 제공되는 하나의 교사 입력으로서 작용할 수 있다. 유사 하게, 포스트 프로세스이미지(722 및 732)를 각각 특징짓는 CNN 및 CNN으로부터의 출력은 트레이닝 동작 모드 동안 딥 러닝 AI 모듈에 제공되는 추가적인 교사 입력들로서 작용할 수 있다. 고속 프로세스 멜 트 풀 데이터는 사전 조정기(preconditioner)에 의해 사전조정될 수 있으며 그리고 트레이닝 동작 모 드 동안 딥 러닝 AI 모듈에 입력된다. 순차적 시간 기반 파라미터 데이터베이스에 저장된 순차적 시 간 기반 데이터는 또한 트레이닝 동작 모드 동안 딥 러닝 AI 모듈에 대한 입력으로서 제공될 수 있다. 초기 적층 제조 빌드 파라미터는 트레이닝 동작 모드 동안 딥 러닝 AI 모듈에 대한 추가 입력 으로서 제공될 수 있다. 딥 러닝 AI 모듈에 대한 다양한 입력들은 트레이닝을 수행하기 위해 정확하게 동기화되어야하고, 그리고 트레이닝을 효과적으로 수행하기 위해 충분한 데이터가 이용가능해야 한다. 딥 러닝 AI 모듈의 LSTM 구성 요소로부터의 출력은 적층 제조 시스템이 정규 생산 모드에서 작동될 때 멜트 풀 제어의 고속 루프 폐쇄를 용이 하게 하기위해 트레이닝 동작 모드 동안 상태 머신에 제공될 수 있다. 상태 머신에 대한 입력은 레코 드를 제공하며, 상기 레코드는 상태 머신 제어 체제 상태(도 44)에 대한 입력이 제어 시뮬레이션에 대해 평가될 수 있게하여, 고속 제어 루프 상에서의 트레이닝된 RNN으로부터의 영향을 평가하는 것을 도울 수 있 다. 전술한 바와 같이 인-프로세스(in-process) 및 포스트-프로세스 정보를 사용하여 AI 모듈을 트레이닝함으 로써, 양호한 제조 실무와 관련된 여러 관점들에서 적층 제조 부품 및 대응하는 적층 제조 프로세스가 양호한지 아닌지를 신뢰성있게 결정할 수 있을 것이다. 부품 빌드에 대한 전체 데이터 세트는 생산 기록을 위해 캡처될 것이다. 먼저, 부품 제조에 사용되는 적층 제조 구성 데이터 파일의 무결성(즉, \"데이터 무결성\")이 입증되고 (demonstrated) 그리고 인증될 수 있다. 둘째, 부품을 빌드하는데 사용되는 적층 제조 프로세스의 무결성(즉, \"프로세스 무결성\")이 입증되고 인증될 수 있다. 셋째, 공정 성능이 고밀도이고, 다공성이 없으며(또는, 최소 다공성), 그리고 우수한 내부 입자 구조(good internal grain structure)(즉, \"성능 무결성\")를 갖는 양호한 부품들을 생산하는지가 입증되고 인증될 수 있다. 유사하게, 적층 제조 부품에 대해 언급된 프로세스 인증은 의 료 기기가 사양에 맞게 올바르게 작동하고 있는지에 대한 검증 및 유효성 근거를 제공하기 위한 설계 품질(DQ: Design Quality), 설치 품질(IQ: Installation Quality), 동작 품질(OQ:Operational Quality) 및 성능 품질 (PQ:Performance Quality) 메트릭과 유사할 수 있다. IQ, OQ 및 PQ는 각각 데이터, 프로세스 및 제조 무결성과 유사하다. 이 경우, 올바른 적층 제조 빌드 파일의 설치는 IQ 이다. 프로세스 무결성(OQ)이 정확한 실시간 검증 및 제조 무결성(PQ)의 거의 실시간 검증은 머신 러닝 AI의 인-프로세스 및 포스트-프로세스 컴포넌트들로부터 도출될 것이다. 어떤 양호도 레벨을 우리가 실제로 갖고 있는지를 결정하고(인-프로세스 측정과 포스트-프로세 스 측정 사이의 비선형 관련성의 학습된 리커런트 메모리를 통해), 그리고 프로세스에 대한 자동 교정을 실시간 으로 수행하도록 양호도에 대한 측정이 머신 러닝 AI 모듈에 의해 사용될 것이며, 따라서 양호도(비선형상관 관계를 통해 간접적으로 추정되는)가 최대화될 것이다. DQ는 설계/빌드 파일과 관련된 적층 제조 설계 규 칙 검사와 동일하며, 이는 금속들 혹은 기타 물리적-기반의 설계 프로토콜에 대한 ICME(Integrated Computational Materials Engineering)를 통합할 수 있다. 트레이닝된 딥 러닝 AI 모듈은 .신경망들의 위원회(committee of neural networks)를 구성하도록 하나 이 상의 CNN들과 결합된 리커런트 신경망(RNN) 컴포넌트를 가질 수 있다. RNN 구성 요소는 예를 들어 \"배니싱 또는 폭발 그래디언트 문제(vanishing or exploding gradient problem)\"와 같은 문제점을 극복하기 위해 LSTM으로 구현될 수 있으며, 또는 또는 게이티드 리커런트 유닛(GRU: Gated Recurrent Unit)으로 구현될 수도 있는바, 이 는 고속 인-프로세스 업데이트 데이터와 저속 프로세스 출력 데이터 사이의 복잡하고, 잡음이 있으며(noisy) 및 비선형인 관계를 학습시키기 위하여 프로세스 상태들 및 장기(long-term) 메모리 능력들을 부가한 리커런트 네 트워크들의 대형 스택의 사용을 허용할 것이다. 딥 러닝 리커런트 AI를 트레이닝하기 위해 이러한 모든 데 이터를 사용하는 것은, 부품 제조 동안 부품의 프린팅 품질을 제어하는데 필요할 수도 있는 적절한 적층 제조 머신 빌드 파라미터들을 예측하는데 도움을 줄 수 있다. 트레이닝된 딥 러닝 AI 모듈은 부품 품질의 저속 계층별(layer-to-layer) 평가를 폐쇄하는데 사용될 수 있는바, 이는 개선된 저속 프로세스 피드백 제어를 위한 것이다. AI 모듈은 AI 인텔리전스 소프트웨어를 실행하는 컴퓨터 또는 컴퓨터 네트워크로 구성될 수 있다. 예를 들어, 소프트웨어는 예를 들어, 인공 지능 네트워크(ANN) AI를 구현하는 TensorFlow, Theano 또는 CNTK를 사용하여 파이썬 소프트웨어 파운데이션(Python Software Foundation)에서 지원하는 Python™ 프로그래 밍 언어로 프로그래밍될 수 있다. 도 42를 참조하면, 적층 제조 머신 러닝 프로세스(인-프로세스 및 포스트-프로세스) 검증 레코드는 제조 의 일부가 의도된 목적에 적합하고 그리고 제조된 부품의 요구들 하에서 수용가능한지를 결정하기 위한 키 (key) 컴포넌트들을 포함할 수 있다. 적층 제조 머신 러닝 프로세스는, 제품 무결성 인증 및 설계 품질 인증 둘다를 포함할 수 있다. 제품 무결성은 데이터 무결성, 프로세스 무결성 및 제조 무결성을 포함할 수 있다. 데 이터 무결성은 부품들을 제조하는데 사용되는 데이터 파일이 제조 프로세스를 위한 정확한 데이터 파일이 라는 인증 및/또는 입증(demonstration)을 포함할 수 있다. 프로세스 무결성은 부품을 제조하는데 사용된 공정이 부품의 제작을 위한 올바른 공정이었다라는 것에 대한 인증 및/또는 입증을 포함할 수 있다. 제조 무결 성은 프로세스 출력이 제조 부품과 관련된 피처들(예를 들어, 고밀도, 다공성 없음, 양호한 내부 입자 구 조 등)로 제조 부품을 생성한다는 인증 및/또는 입증을 포함할 수 있다. 이들 인증들은 적층 제조 요구사항들이 프로세스 해시(266, 84i)의 생성을 위해 그리고 또한 부품 포스트 검사의 일부로서 충족되었다는 검증에 포 함될 수 있다. 설계 품질은 설치 품질, 동작 품질 및 성능 품질을 포함할 수 있다. 설계 품질(120 0)은 설계 구현 요구사항들의 일부로서 포함될 수 있다. 예를 들어, 설치 품질, 동작 품질, 및 성능 품질은 고객 요구과 같은 사양에 따라 디바이스가 올바르게 기능하고 있다는 확인 및 검증 증 거를 제공하기 위한 메트릭을 포함할 수 있고, 그리고 준수 인증서(certificate of compliance) 및 검사 레코드의 일부로서 포함될 수 있다. 설치 품질, 동작의 품질, 및 성능 품질는 각각 데이터, 프로세스, 및 제조 처리 및 제조 무 결성들(integrities)을 포함할 수 있다. 예를 들어, 올바른 적층 제조 빌드 파일의 설치는 설치 품질(121 0)일 수 있다. 공정 무결성에 대한 실시간 검증이 올바를 수 있으며 제조 무결성에 대한 거의 실시 간 검증은 머신 러닝 AI(예를 들어, 트레이닝된 딥 러닝 리커런트 AI 850)의 인-프로세스 및 포스트-프로세스 컴포넌트들로부터 도출될 수 있으며 제품 제조 정보에 포함될 수 있다. 머신 러닝 AI는 현재 충족될 수 있는 정확도 레벨을 결정할 수 있다(예컨대, 인-프로세스 측정과 포스트-프로세 스 측정 사이의 비선형 관계의 학습된 리커런트 메모리를 통해). 다음으로, 머신 러닝 AI는 실시간으로 프로세 스에 대한 자동 보정을 진행하여, 제조 정확도가 최대화될 수 있다(예를 들어, 비선형 상관을 통해 간접적으로"}
{"patent_id": "10-2020-7020581", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "추정됨). 머신 러닝 요약 메트릭(summary metrics)은 부품 검사 프로세스 해시(84k)에서 인코딩될 수 있다. 설계 품질은 적층 제조 설계 규칙 체크(DRC) 설계/빌드 파일들을 포함할 수 있으며, 이는 금속 또는 다른 물리적-기반의 설계 프로토콜들에 대한 통합 전산 재료 공학(ICME: integrated computational materials engineering)을 통합할 수 있다. 설계 품질 프로세스로부터의 출력은 또한 시스템에서의 추가 조정에서 사용될 머신 러닝 AI에 대한 입력일 수 있다. 적층 제조 머신, 또는 대안적으로 머신이 도 43에 더 상세히 도시되어있다. 적층 제조 머신은 파 우더 저장소 , 부품이 빌딩되는 파우더 베드 및 파우더 저장소로부터 파우더 베드 로 새로운 파우더 레이어를 이송하기 위한 파우더 스크랩퍼를 포함하는 레이저 파우더 베드 머신 유형의 형태일 수 있다. 파우더 저장소의 높이는 파우더 전달 액추에이터에 의해 조정되고, 파우더 베드 의 높이는 제작 액추에이터에 의해 조정된다. 적층 제조 머신은 또한, 레이저 형태의 에너지 소스, 그리고 부품을 형성하도록 제어된 방식으로 파우더 베드 내의 각각의 새로운 파우더 레 이어에 걸쳐 에너지 소스로부터 빔을 방향 전환 및 스캐닝하기 위한 스캐너 시스템을 포함한 다. 이해되는 바와 같이, 빔은 파우더 베드의 파우더 레이어와 상호작용하며 그리고 트레일링 멜트 풀(trailing melt pool)을 형성하는바, 이는 파트와 고형화 및 융해되어 부품을 형성한다. 전술한 유형의 적층 제조 머신들은 영국에 위치한 Renishaw PLC로부터 이용가능하다. 적층 제조 머신는 인-프로세스 멜트 풀을 나타내는 실시간 멜트 풀 데이터를 획득하도록 구성된 하 나 이상의 멜트 풀 센서를 갖는 멜트 풀 모니터링 시스템을 구비할 수 있다. 적층 제조 머신 는 또한 인-프로세스 부품 레이어들의 레이어 이미지들을 획득하는 빌드 레이어 이미지 센서를 구비할 수 있다. 부가적으로, 공간 주파수 변조 이미징(SPIFI: Spatial Frequency Modulated Imaging)이 이용되어, 상기 빔을 통해 멜트 풀의 상태에 관한 정보를 직접 수집할 수 있다. 적층 제조 머신의 다양한 구성 요소들은 빌드 프로세스를 제어하도록 구성된 마이크로 프로세서 기반 제어기에 연결된다. 적층 제조 시스템은 적층 제조 머신에서 부품을 빌딩하기 위한 초기 빌드 파라미터 세트를 생성하도 록 프로그래밍된 빌드 파라미터 구성 모듈을 포함할 수 있다. 초기 빌드 파라미터 세트는 적층 제조 머신 의 프로세싱 및 제어 전자회로들에 의해서 액세스될 수 있는 메모리에 빌드 파라미터 구성 파일로서 저장될 수 있다. 초기 빌드 파라미터 세트는, 빌드 파라미터 구성 모듈에 입력된 부품의 기하학적 모 델에 적어도 부분적으로 기초할 수 있다. 비제한적인 일례로서, 기하학적 모델은 가령, 디지털 공급 파일 또는 출력 파일 등과 같이 부품을 서술하는 하나 이상의 디지털 CAD/CAM 파일로서 제공될 수 있으며, 그리고 빌드 파라미터 구성 모듈은 컴퓨터 모듈일 수 있는바, 상기 컴퓨터 모듈은 CAD/CAM 모델 정보를 판 독하고 그리고 레이저 제어 세팅들, 스캐너 모션 제어 커맨드들, 층 두께 세팅들, 및 부품을 제작하도록 적층 제조 머신을 동작시키기 위한 다른 제어 파라미터들을 생성하도록 프로그래밍될 수 있다. 빌드 파라 미터 구성 모듈은 적층 제조 머신의 일부일 수 있거나, 적층 제조 머신와 분리되어 이와 통신할 수 있다. CAD/CAM 파일로부터 적층 제조 빌드 파라미터를 생성하기 위한 상용 소프트웨어의 일례는 벨기에에 위 치한 Materialise N.V. 에서 제공되는 MATERIALISE®Magics™ 데이터 준비 소프트웨어이다. 도 44에는, Mealy FSM에 의해 표현된 바와 같이 3 개의 상이한 상태들을 갖는 상태 머신의 간단한 일례가 도시되며, 여기서 각 상태로부터의 출력들은 현재 상태 및 FSM으로의 입력에 의존한다. 3 개의 상태들은, 제어 체계가 유지되는 경우 \"보류(Hold)\" 상태, 제어 체계가 빔에 의해 파우더 베드로 입력되는 특정 에 너지 밀도(ED)를 낮추는 것을 선호하는 경우 \"낮은 에너지 밀도(Lower Energy Density: Lower ED)\" 상태, 그리 고 제어 체계가 빔에 의해 파우더 베드로 입력되는 특정 에너지 밀도(ED)를 높이는 것을 선호하는 경우 \"높은 에너지 밀도(Higher Energy Density: Highe ED)\" 상태이다. 또한, 본 일례에서, FSM에 대한 입력은 멜트 풀의 상태(condition)를 예측하는 트레이닝된 RNN으로부터의 출력이다. 이러한 예측은 도 39의 증강 데이터에 의해 RNN에 부여된 도 40의 트레이닝에 기초한다. 도 44 예의 각 상태는 상이하거나 변경된 제어 체계를 나타낸다. 이러한 제어 체계들은 단순한 이득-제어 피드"}
{"patent_id": "10-2020-7020581", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "백 루프 또는 복잡한 확률론적 최적 컨트롤러로 구현될 수 있다. 해당 기술분야의 당업자라면 다음을 능히 이해 할 것인바, 이것은 고속 루프 제어를 위해 상태 머신이 RNN으로부터의 출력과 어떻게 인터페이 스될 수 있는지에 대한 간단한 일례일 뿐이며, 그리고 다양한 제어 체계 상태들을 포함하여 다른 많은 보다 복 잡한 구성들도 또한 가능할 뿐만 아니라 제어 체계 상태들이 기저의 컨트롤러들의 많은 가능한 구현예들을 변경 하는 방식도 능히 이해할 것이다. 또한, 다음을 유의해야 하는바, 명확성을 위해 별도의 실시예들과 관련하여 서술된 본 발명의 소정의 특징들은, 조합되어 단일 실시예에서 제공될 수도 있다. 이와 반대로, 간결함을 위해 단일 실시예와 관련하여 설명된 본 발명의 다양한 특징들은 개별적으로 또는 임의의 적절한 하위 조합으로 제공될 수도 있다. 본 발명은 많은 변경들 및 수정들이 이루어질 수 있음을 고려한다. 따라서, 현재 바람직한 형태의 시스템이 도 시 및 설명되었고, 여러 수정예들 및 대안예들이 논의되었지만, 당업자는 아래의 청구 범위에 의해 정의되고 구 별되는 바와 같이 다양한 추가 변경들 및 수정들이 본 발명의 범위를 벗어남이 없이도, 이루어질 수 있음을 쉽게 이해할 것이다."}
{"patent_id": "10-2020-7020581", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 제조된 부품에 대한 각각의 거래에서 추적가능성 및 인증을 구비한, 개시된 가상 분산 재고 관리 시스템 및 원장(ledge)의 실시예를 도시하는 개략도이다. 도 2는 디지털 원장에 거래를 기록하기 위한 실시예의 방법 단계를 개시하는 흐름도이다. 도 3은 제 1 사용자로부터 제 2 사용자에게 암호화된 거래 데이터를 전송하기 위한 실시예의 방법 단계를 개시 하는 흐름도이다. 도 4는 개시된 가상 분산 원장 시스템의 주요 프로세스 상태를 개시하는 흐름도이다. 도 5a 및 5b는 개시된 가상 분산 원장 시스템의 실시예의 주요 프로세스 상태, 및 각 상태에 대한 입력 및 출력 을 개시하는 개략도이다. 도 6은 고객 요구 프로세스 상태의 실시예의 방법 단계를 개시하는 흐름도이다. 도 7은 설계 구현 요구 프로세스 상태의 실시예의 방법 단계를 개시하는 흐름도이다. 도 8은 도 6에 도시된 고객 요구 프로세스 상태의 실시예의 프로세스 입력 및 출력을 개시하는 데이터베이스이 다. 도 9는 도 7에 도시된 설계 구현 요구 프로세스 상태의 실시예의 프로세스 입력 및 출력을 개시하는 데이터베이 스이다. 도 10은 제조 전처리(프리-프로세싱) 요구 프로세스 상태의 실시예의 방법 단계를 개시하는 흐름도이다. 도 11은 파우더 조달 및 비축 프로세스 상태의 실시예의 방법 단계를 개시하는 흐름도이다. 도 12는 머신 교정 파라미터 생성 처리 상태의 실시예의 방법 단계를 개시하는 흐름도이다. 도 13은 도 10에 도시된 제조 전처리 요구 프로세스 상태에 대한 실시예의 프로세스 입력 및 출력을 개시하는 데이터베이스이다. 도 14는 도 11에 도시된 파우더 조달 및 비축 공정 상태의 실시예의 프로세스 입력 및 출력을 개시하는 데이터 베이스이다. 도 15는 도 12에 도시된 머신 교정 파라미터 생성 프로세스 상태의 실시예의 프로세스 입력 및 출력을 개시하는 데이터베이스이다. 도 16은 파우더 검사 프로세스 상태의 실시예의 방법 단계를 개시하는 흐름도이다. 도 17은 머신 전처리 변환 프로세스 상태의 실시예의 방법 단계를 개시하는 흐름도이다. 도 18은 도 16에 도시된 파우더 검사 프로세스 상태의 실시예의 프로세스 입력 및 출력을 개시하는 데이터베이 스이다. 도 19는 도 17에 도시된 머신 전처리 변환 프로세스 상태의 실시예의 프로세스 입력 및 출력을 개시하는 데이터 베이스이다.도 20은 적층 제조 프로세스 상태의 실시예의 방법 단계를 개시하는 흐름도이다. 도 21은 부품 후처리 프로세스 상태의 실시예의 방법 단계를 개시하는 흐름도이다. 도 22는 도 20에 도시된 적층 제조 프로세스 상태의 프로세스 입력 및 출력을 개시하는 데이터베이스이다. 도 23은 도 21에 도시된 부품 후처리 프로세스 상태의 실시예의 프로세스 입력 및 출력을 개시하는 데이터베이 스이다. 도 24는 바람직한 부품 검사 프로세스 상태의 실시예의 방법 단계를 개시하는 흐름도이다. 도 25는 바람직한 부품 최종 사용자 전달 요구 프로세스 상태의 실시예의 방법 단계를 개시하는 흐름도이다. 도 26은 도 24에 도시된 부품 검사 프로세스 상태의 실시예의 프로세스 입력 및 출력을 개시하는 데이터베이스 이다. 도 27은 도 25에 도시된 부품 최종 사용자 전달 요구 프로세스 상태의 실시예의 프로세스 입력 및 출력을 개시 하는 데이터베이스이다. 도 28은 개시된 가상 분산 원장 시스템에 대한 거래 기록의 실시예를 도시한 개략도이다. 도 29는 개시된 가상 분산 원장 시스템에 대한 고유 부품 식별자 생성의 실시예를 도시한 개략도이다. 도 30은 개시된 가상 분산 원장 시스템에 대한 부품 인증 방법의 실시예를 도시한 개략도이다. 도 31은 본 개시의 예시적인 실시예를 실시하기에 적합한 공급자 인증의 실시예를 도시한 예시도이다. 도 32는 본 개시의 예시적인 실시예를 실시하기에 적합한 서플라이 체인 내의 가격 투명성의 실시예를 도시한 예시도이다. 도 33은 본 개시의 예시적인 실시예를 실시하기에 적합한 지적 재산권 추적의 실시예를 도시한 예시도이다. 도 34는 본 개시의 예시적인 실시예를 실시하기에 적합한 제품의 제조에서 구현되는 지적 재산권을 예시하는 예 시도이다. 도 35는 우주 공간에서 적층식으로 제조된 부품에 대한 추적가능성 및 인증을 구비한 가상 분산 재고 관리 시스 템의 실시예의 개략도이다. 도 36은 우주 공간에서 적층식으로 제조된 부품에 대한 추적가능성 및 인증을 구비한 가상 분산 재고 관리 시스 템의 실시예를 도시한다. 도 37은 도 35에 도시된 우주 공간에서의 가상 분산 재고 관리 시스템을 이용하여 제품을 제조하기 위한 디지털 데이터 및 정보를 공급하기 위한 실시예의 개략도이다. 도 38은 도 35에 도시된 우주 공간에서 제조된 부품에 대한 추적가능성 및 인증을 구비한 분산 재고 관리 시스 템에 사용하기 위한 딥-러닝 인공 지능 적층 제조 시스템의 실시예의 개략적인 블록도이다. 도 39는 적층 제조 2D 후처리 및 적층 제조 3D 후처리와 함께 데이터 보강으로 증강 데이터 수집 아키텍처 및 슬로우 프로세스 피드백 제어를 개시하는 블록도로서, 여기서 적층 제조 머신에 의해 공정중에 수집된 데이터에 따라 완성된 부품의 후처리 이미지 데이터가 수집된다. 도 40은 딥 러닝 인공 지능 적층 제조 시스템을 위한 트레이닝 구성의 실시예를 개시하는 흐름도이다. 도 41은 피드백을 제공하기 위해 컨볼루션 신경망에 의해 층이 평가되는 기본 폐루프 적층 제조 제어 시스템의 흐름도이다. 도 42는 프로세스 및 설계 품질 검증을 위한 적층 제조 머신학습 프로세스의 실시예의 흐름도이다. 도 43은 도 38에 도시된 적층 제조 머신의 개략도이다. 도 44는 리커런트 뉴럴 네트워크(RNN)이 유한 상태 머신(FSM)에 어떻게 인터페이스할 수 있는지를 나타내는 단 순화된 일례의 상태도이다."}
