{"patent_id": "10-2021-0042889", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0136779", "출원번호": "10-2021-0042889", "발명의 명칭": "일정 간 공백 시간에 기초하여 서비스를 제공하는 서비스 시스템", "출원인": "서울시립대학교 산학협력단", "발명자": "강현도"}}
{"patent_id": "10-2021-0042889", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자 단말에 있어서,디스플레이; 및지도 어플리케이션을 실행하여 지도 영역 및 일정 영역을 포함하는 UI 화면을 상기 디스플레이에 표시하고, 제1사용자 명령에 따라 캘린더 서버로부터 수신된 사용자의 일정 정보를 상기 일정 영역에 표시하고, 상기 사용자의 일정 정보에 대응되는 장소를 상기 지도 영역에 표시하고, 제2 사용자 명령에 따라 상기 일정 영역에 포함된일정 목록을 관리 서버로 전송하는 프로세서를 포함하되,상기 프로세서는,상기 일정 목록에 기초하여 동일 날짜의 제1 일정 정보 및 상기 제1 일정 정보에 후행하는 제2 일정 정보에 대해 획득된 최단 경로 정보를 상기 관리 서버로부터 수신하면, 상기 최단 경로 정보에 포함된 출발 시각, 도착시각, 소요 시각 및 이동 경로를 상기 UI 화면 상에 표시하고, 상기 제1 일정 정보 및 상기 제2 일정 정보 간공백 시간 및 상기 공백 시간에 대응되는 체류 지역의 장소 정보에 기초하여 상기 공백 시간 동안 체류할 추천장소 정보를 상기 UI 화면 상에 표시하는, 사용자 단말."}
{"patent_id": "10-2021-0042889", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 프로세서는,상기 공백 시간에 대응되는 체류 지역 내의 장소 중 광고 계약된 장소에 우선 순위를 부여하여 상기 추천 장소정보를 제공하는, 사용자 단말."}
{"patent_id": "10-2021-0042889", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 프로세서는, 상기 공백 시간에 대응되는 체류 지역 내의 장소 중 사용자의 프로필 정보 및 선호도 정보에 부합되는 장소에우선 순위를 부여하여 상기 추천 장소 정보를 제공하는, 사용자 단말."}
{"patent_id": "10-2021-0042889", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 프로세서는, 상기 공백 시간의 길이, 상기 공백 시간의 시간대 및 상기 체류 지역의 장소 타입 정보에 기초하여 상기 공백시간 동안 체류할 후보 장소를 선택하고, 상기 선택된 후보 장소 중 상기 공백 시간에 대응되는 체류 지역 내의장소 중 사용자의 프로필 정보 및 선호도 정보에 부합되는 장소에 우선 순위를 부여하여 상기 추천 장소 정보를제공하는, 사용자 단말."}
{"patent_id": "10-2021-0042889", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 프로세서는, 학습된 인공 지능 모델에 사용자의 프로필 정보 및 선호도 정보, 상기 공백 시간의 길이, 상기 공백 시간의 시간대 및 장소 타입 정보를 입력하고, 공개특허 10-2022-0136779-3-상기 인공 지능 모델로부터 출력되는 장소 정보 및 확률 정보에 기초하여 상기 추천 장소 정보를 제공하는, 사용자 단말."}
{"patent_id": "10-2021-0042889", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 프로세서는, 상기 최단 경로 정보에 기초하여 상기 공백 시간이 음수로 산출되는 경우 상기 제2 일정 정보를 변경하기 위한상대방 연락처 및 장소 연락처 중 적어도 하나를 가이드하는 UI를 제공하는, 사용자 단말."}
{"patent_id": "10-2021-0042889", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 상기 프로세서는, 상기 일정 영역 상에서 여유 경로에 해당하는 경로가 선택되면, 최적 시간대를 추천받을지 여부를 문의하는 UI창을 표시하고, 제3 사용자 명령에 따라 상기 여유 경로 및 상기 여유 경로에 포함된 후행 일정에 대한 정보를 관리 서버로 전송하는, 사용자 단말."}
{"patent_id": "10-2021-0042889", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "관리 서버에 있어서,통신 인터페이스; 및상기 통신 인터페이스에 의해 사용자 단말로부터 수신된 일정 목록에 기초하여 동일 날짜의 제1 일정 정보 및상기 제1 일정 정보에 후행하는 제2 일정 정보를 획득하고, 상기 제1 일정 정보에 대응되는 제1 장소 정보, 상기 제2 일정 정보에 대응되는 제2 장소 정보, 상기 제1 일정 정보의 종료 시각 및 교통 정보에 기초하여 최단경로 정보를 획득하여 상기 통신 인터페이스에 의해 상기 사용자 단말로 전송하는 프로세서; 를 포함하는, 관리서버."}
{"patent_id": "10-2021-0042889", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 프로세서는, 상기 사용자 단말로부터 수신된 상기 제1 일정 정보에 대응되는 제1 장소 정보, 상기 제2 일정 정보에 대응되는제2 장소 정보, 상기 제1 일정 정보의 종료 시각 및 교통 정보, 및 상기 사용자에 의해 선택된 교통 수단 정보에 기초하여 최단 경로 정보를 획득하여 상기 사용자 단말로 전송하며, 상기 교통 수단 정보는, 대중 교통 및 자기 차량 중 적어도 하나를 포함하는, 관리 서버."}
{"patent_id": "10-2021-0042889", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에 있어서, 상기 프로세서는, 상기 사용자 단말로부터 여유 경로에 대한 정보가 수신되면, 최근 임계 시간 구간 동안의 교통 정보에 기초하여선행 일정의 종료 시각을 출발 시각으로 하는 복수의 제1 경로 및 후행 일정의 시작 시각을 도착 시간으로 하는복수의 제2 경로를 획득하고, 상기 복수의 제1 경로의 평균 소요 시간 및 상기 복수의 제2 경로의 평균 소요 시간을 비교하여 상기 최단 경로정보를 획득하여 상기 사용자 단말로 전송하되,여유 경로 내에 포함된 출발 장소 및 도착 장소를 포함하는 최소 크기의 직사각형 영역을 가로 및 세로로 각각공개특허 10-2022-0136779-4-기설정된 배수 만큼 확대한 내부 영에 대응되는 최근 임계 시간 구간 동안의 교통 정보에 기초하여 상기 복수의제1 경로 및 상기 복수의 제2 경로를 획득하는, 관리 서버."}
{"patent_id": "10-2021-0042889", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "일정 간 공백시간에 기초하여 서비스를 제공하는 서비스 시스템이 제공된다. 상기 서비스 시스템에 포함되는 이 동 단말은, 디스플레이; 및 지도 어플리케이션을 실행하여 지도 영역 및 일정 영역을 포함하는 UI 화면을 상기 디스플레이에 표시하고, 제1 사용자 명령에 따라 캘린더 서버로부터 수신된 사용자의 일정 정보를 상기 일정 영 (뒷면에 계속)"}
{"patent_id": "10-2021-0042889", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 서비스 시스템에 관한 것으로, 더욱 상세하게는 최단 이동 경로를 제공하는 서비스 시스템에 관한 것 이다."}
{"patent_id": "10-2021-0042889", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "종래에 캘린더 어플리케이션 및 지도 어플리케이션을 결합하여 서비스를 제공해주는 방법이 있었다. 하지만, 단 순히 캘린더 어플리케이션으로부터 획득된 사용자의 일정 간 이동 경로를 지도 어플리케이션을 통해 제공해 주 는데 그쳤다는 문제점이 있었다."}
{"patent_id": "10-2021-0042889", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 상술한 필요성에 따른 것으로, 본 개시의 목적은 선행 일정 및 후행 일정 간 공백 시간을 고려한 이 동 경로 및 체류할 장소를 추천하는 서비스 시스템을 제공함에 있다."}
{"patent_id": "10-2021-0042889", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이상과 같은 목적을 달성하기 위한 본 개시의 일 실시 예에 따른 사용자 단말은, 디스플레이; 및 지도 어플리케 이션을 실행하여 지도 영역 및 일정 영역을 포함하는 UI 화면을 상기 디스플레이에 표시하고, 제1 사용자 명령 에 따라 캘린더 서버로부터 수신된 사용자의 일정 정보를 상기 일정 영역에 표시하고, 상기 사용자의 일정 정보 에 대응되는 장소를 상기 지도 영역에 표시하고, 제2 사용자 명령에 따라 상기 일정 영역에 포함된 일정 목록을 관리 서버로 전송하는 프로세서를 포함하되, 상기 프로세서는, 상기 일정 목록에 기초하여 동일 날짜의 제1 일 정 정보 및 상기 제1 일정 정보에 후행하는 제2 일정 정보에 대해 획득된 최단 경로 정보를 상기 관리 서버로부 터 수신하면, 상기 최단 경로 정보에 포함된 출발 시각, 도착 시각, 소요 시각 및 이동 경로를 상기 UI 화면 상 에 표시하고, 상기 제1 일정 정보 및 상기 제2 일정 정보 간 공백 시간 및 상기 공백 시간에 대응되는 체류 지 역의 장소 정보에 기초하여 상기 공백 시간 동안 체류할 추천 장소 정보를 상기 UI 화면 상에 표시할 수 있다. 상기 사용자 단말에 있어서, 상기 프로세서는, 상기 공백 시간에 대응되는 체류 지역 내의 장소 중 광고 계약된 장소에 우선 순위를 부여하여 상기 추천 장소 정보를 제공할 수 있다. 상기 사용자 단말에 있어서, 상기 프로세서는, 상기 공백 시간에 대응되는 체류 지역 내의 장소 중 사용자의 프 로필 정보 및 선호도 정보에 부합되는 장소에 우선 순위를 부여하여 상기 추천 장소 정보를 제공할 수 있다. 상기 사용자 단말에 있어서, 상기 프로세서는, 상기 공백 시간의 길이, 상기 공백 시간의 시간대 및 상기 체류 지역의 장소 타입 정보에 기초하여 상기 공백 시간 동안 체류할 후보 장소를 선택하고, 상기 선택된 후보 장소 중 상기 공백 시간에 대응되는 체류 지역 내의 장소 중 사용자의 프로필 정보 및 선호도 정보에 부합되는 장소 에 우선 순위를 부여하여 상기 추천 장소 정보를 제공할 수 있다. 상기 사용자 단말에 있어서, 상기 프로세서는, 학습된 인공 지능 모델에 사용자의 프로필 정보 및 선호도 정보, 상기 공백 시간의 길이, 상기 공백 시간의 시간대 및 장소 타입 정보를 입력하고, 상기 인공 지능 모델로부터 출력되는 장소 정보 및 확률 정보에 기초하여 상기 추천 장소 정보를 제공할 수 있다. 상기 사용자 단말에 있어서, 상기 프로세서는, 상기 최단 경로 정보에 기초하여 상기 공백 시간이 음수로 산출 되는 경우 상기 제2 일정 정보를 변경하기 위한 상대방 연락처 및 장소 연락처 중 적어도 하나를 가이드하는 UI 를 제공할 수 있다. 상기 사용자 단말에 있어서, 상기 프로세서는, 상기 일정 영역 상에서 여유 경로에 해당하는 경로가 선택되면, 최적 시간대를 추천받을지 여부를 문의하는 UI 창을 표시하고, 제3 사용자 명령에 따라 상기 여유 경로 및 상기 여유 경로에 포함된 후행 일정에 대한 정보를 관리 서버로 전송할 수 있다.본 개시의 다른 실시 예에 따른 관리 서버는, 통신 인터페이스; 및 상기 통신 인터페이스에 의해 사용자 단말로 부터 수신된 일정 목록에 기초하여 동일 날짜의 제1 일정 정보 및 상기 제1 일정 정보에 후행하는 제2 일정 정 보를 획득하고, 상기 제1 일정 정보에 대응되는 제1 장소 정보, 상기 제2 일정 정보에 대응되는 제2 장소 정보, 상기 제1 일정 정보의 종료 시각 및 교통 정보에 기초하여 최단 경로 정보를 획득하여 상기 통신 인터페이스에 의해 상기 사용자 단말로 전송하는 프로세서; 를 포함할 수 있다. 상기 관리 서버에 있어서, 상기 프로세서는, 상기 사용자 단말로부터 수신된 상기 제1 일정 정보에 대응되는 제 1 장소 정보, 상기 제2 일정 정보에 대응되는 제2 장소 정보, 상기 제1 일정 정보의 종료 시각 및 교통 정보, 및 상기 사용자에 의해 선택된 교통 수단 정보에 기초하여 최단 경로 정보를 획득하여 상기 사용자 단말로 전송 하며, 상기 교통 수단 정보는, 대중 교통 및 자기 차량 중 적어도 하나를 포함할 수 있다. 상기 관리 서버에 있어서, 상기 프로세서는, 상기 사용자 단말로부터 여유 경로에 대한 정보가 수신되면, 최근 임계 시간 구간 동안의 교통 정보에 기초하여 선행 일정의 종료 시각을 출발 시각으로 하는 복수의 제1 경로 및 후행 일정의 시작 시각을 도착 시간으로 하는 복수의 제2 경로를 획득하고, 상기 복수의 제1 경로의 평균 소요 시간 및 상기 복수의 제2 경로의 평균 소요 시간을 비교하여 상기 최단 경로 정보를 획득하여 상기 사용자 단말 로 전송하되, 여유 경로 내에 포함된 출발 장소 및 도착 장소를 포함하는 최소 크기의 직사각형 영역을 가로 및 세로로 각각 기설정된 배수 만큼 확대한 내부 영에 대응되는 최근 임계 시간 구간 동안의 교통 정보에 기초하여 상기 복수의 제1 경로 및 상기 복수의 제2 경로를 획득할 수 있다."}
{"patent_id": "10-2021-0042889", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상술한 다양한 실시 예에 따르면, 클라이언트와 미팅이 잦은 직장인의 경우 불규칙한 일정 간 이동계획의 효율 성을 높여주며, 타지 출장이 잦은 직장인의 경우 생소한 출장 지역에서 장소 정보를 찾는 일에 도움을 줄 수 있 다. 또한, 기존의 지도와 캘린더 결합 기술에서 나아가 일정 간 이동 계획 및 공백 시간 활용의 효율성을 높여 주는 기능이 추가되어 지도와 캘린더의 활용성이 높아질 수 있다."}
{"patent_id": "10-2021-0042889", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 첨부 도면을 참조하여 본 개시를 상세히 설명한다. 본 명세서에서 사용되는 용어에 대해 간략히 설명하고, 본 개시에 대해 구체적으로 설명하기로 한다. 본 개시의 실시 예에서 사용되는 용어는 본 개시에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달 라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 개시의 설명 부분에서 상세히 그 의미를 기재할 것이다. 따라서 본 개시에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가지는 의미와 본 개시의 전반에 걸친 내용을 토대로 정의되어야 한다. 본 명세서에서 사용된 \"제1,\" \"제2,\" \"첫째,\" 또는 \"둘째,\"등의 표현들은 다양한 구성요소들을, 순서 및/또는 중요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구성요소들 을 한정하지 않는다. 본 개시에서 \"모듈\" 혹은 \"부\"는 적어도 하나의 기능이나 동작을 수행하며, 하드웨어 또는 소프트웨어로 구현되 거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 또한, 복수의 \"모듈\" 혹은 복수의 \"부\"는 특정한 하드 웨어로 구현될 필요가 있는 \"모듈\" 혹은 \"부\"를 제외하고는 적어도 하나의 모듈로 일체화되어 적어도 하나의 프 로세서(미도시)로 구현될 수 있다 이하 첨부된 도면들을 참조하여 본 개시의 일 실시 예를 보다 상세하게 설명한다. 도 1은 본 개시의 일 실시 예에 따른 서비스 시스템을 나타내는 도면이다. 도 1에 따르면, 서비스 시스템은 사용자 단말, 관리 서버, 캘린더 서버 및 리마인더 서버를 포함할 수 있다. 사용자 단말은 어플리케이션을 제공하는 서버(미도시)로부터 어플리케이션을 다운로드받아 설치할 수 있다. 여기서, 어플리케이션은 지도 어플리케이션, 캘린더 어플리케이션, 리마인더 어플리케이션 등을 포함할 수 있다. 일 예에 따라, 사용자는 사용자 단말에서 어플리케이션을 실행하고 사용자 계정을 생성하여, 생성된 사용 자 계정을 통해 다양한 서버에 로그인 할 수 있으며, 사용자 단말은 로그인된 사용자 계정을 기반으로 다 양한 서버와 통신을 수행할 수 있다. 여기서, 서버는 관리 서버, 캘린더 서버, 및 리마인더 서버 등을 포함할 수 있다. 일 예에 따라 사용자 단말은 와이파이(Wi-Fi) 네트워크, 또는, LTE, 5G 등과 같은 다양한 통신망을 통 해 관리 서버, 캘린더 서버 및 리마인더 서버에 접속할 수 있다. 일 실시 예에 따라 사용자 단말은 지도 어플리케이션을 실행하여 지도 영역 및 일정 영역을 포함하는 UI 화면을 표시하고, 제1 사용자 명령에 따라 캘린더 서버로부터 수신된 사용자의 일정 정보를 일정 영역에 일 정 표로 표시하고, 사용자의 일정 정보에 대응되는 장소를 지도 영역에 표시하고, 제2 사용자 명령에 따라 일정 영역에 포함된 일정 목록을 관리 서버로 전송할 수 있다. 관리 서버는 사용자 단말에 설치된 어플리케이션과 관련된 다양한 정보를 데이터베이스에 저장하고 관리할 수 있다. 이 경우, 관리 서버는 사용자 계정 별로 정보를 저장하고 관리할 수 있다. 서버는 클라우드 컴퓨팅 기술을 이용하는 클라우드 서버로 구현될 수 있으나, 이에 한정되는 것은 아니다. 일 실시 예에 따라 관리 서버는 사용자 단말로부터 수신된 일정 목록에 기초하여 동일 날짜의 제1 일 정 정보 및 제1 일정 정보에 후행하는 제2 일정 정보를 획득하고, 제1 일정 정보에 대응되는 제1 장소 정보, 제 2 일정 정보에 대응되는 제2 장소 정보, 제1 일정 정보의 종료 시각 및 교통 정보에 기초하여 최단 경로 정보를 획득하여 사용자 단말로 전송할 수 있다. 캘린더 서버는 사용자의 일정 정보를 저장하고 관리할 수 있다. 일 예에 따라 캘린더 서버는 사용자 단 말에 설치된 캘린더 어플리케이션과 관련된 다양한 정보를 데이터베이스에 저장하고 관리할 수 있다. 리마인더 서버는 사용자의 리마인더 정보를 저장하고 관리할 수 있다. 일 예에 따라 리마인더 서버는 사용자 단말에 설치된 리마인더 어플리케이션과 관련된 다양한 정보를 데이터베이스에 저장하고 관리할 수 있다. 한편, 사용자 단말은 관리 서버로부터 최단 경로 정보가 수신되면, 최단 경로 정보에 포함된 출발 시 각, 도착 시각, 소요 시각 및 이동 경로를 UI 화면 상에 표시할 수 있다. 또한, 사용자 단말은 제1 일정 정보 및 상기 제2 일정 정보 간 공백 시간 및 공백 시간에 대응되는 체류 지역의 장소 정보에 기초하여 공백 시 간 동안 체류할 추천 장소 정보를 UI 화면 상에 표시할 수 있다. 이하에서는, 본 개시의 다양한 실시 예에 따라 상술한 시스템의 동작에 따라 사용자 단말에 설치된 어플리 케이션을 통해 제공되는 다양한 동작에 대해 좀더 자세히 설명하도록 한다. 도 2는 본 개시의 일 실시 예에 따른 사용자 단말의 구성을 나타내는 블럭도이다. 도 2에 따른 사용자 단말은 메모리, 통신 인터페이스, 디스플레이, 사용자 인터페이스 및 프로세서를 포함한다. 사용자 단말은 사용자가 소지한 단말로서, 예컨대, 스마트폰, 노트북, 태블릿 PC, 스마트 TV, 휴대폰, PDA(personal digital assistant), 랩톱, 미디어 플레이어, 전자책 단말기, 디지털방송용 단말기, 네비게이션, MP3 플레이어, 디지털 카메라, 가전기기 및 기타 모바일 또는 비모바일 컴퓨팅 장치일 수 있으나, 이에 제한되 지 않는다. 또한, 사용자 단말은 통신 기능 및 데이터 프로세싱 기능을 구비한 시계, 안경, 헤어 밴드 및 반지 등의 웨어러블 단말기일 수 있다. 사용자 단말은 상술한 내용에 제한되지 아니한다. 메모리는 본 개시의 다양한 실시 예를 위해 필요한 데이터를 저장할 수 있다. 메모리는 휘발성 메모 리(예: DRAM(dynamic RAM), SRAM(static RAM), 또는 SDRAM(synchronous dynamic RAM) 등), 비휘발성 메모리 (non-volatile Memory)(예: OTPROM(one time programmable ROM), PROM(programmable ROM), EPROM(erasable and programmable ROM), EEPROM(electrically erasable and programmable ROM), mask ROM, flash ROM, 플래시 메모리(예: NAND flash 또는 NOR flash 등), 하드 드라이브, 또는 솔리드 스테이트 드라이브(solid state drive(SSD)) 중 적어도 하나로 구현될 수 있다. 일 실시 예에 따라 메모리는 사용자 단말을 구동/제어하기 위한 다양한 데이터, 프로그램 또는 어플 리케이션을 저장할 수 있다. 메모리는 사용자 단말의 제어를 위한 제어 프로그램, 제조사에서 최초 제공되거나 외부에서부터 다운로드 받은 어플리케이션, 데이터베이스들 또는 관련 데이터들을 저장할 수 있다. 통신 인터페이스는 다양한 서버와 통신을 수행한다. 통신 인터페이스는 와이 파이(Wi-Fi), 지그비 (zigbee), 3G(3rd Generation), 3GPP(3rd Generation Partnership Project), LTE(Long Term Evolution), LTE- A(LTE Advanced), 4G(4th Generation), 5G(5th Generation)등과 같은 다양한 무선 통신 규격에 따라 관리 서버 , 캘린더 서버 및 리마인더 서버와 통신을 수행할 수 있다. 디스플레이는 자발광 소자를 포함하는 디스플레이 또는, 비자발광 소자 및 백라이트를 포함하는 디스플레 이로 구현될 수 있다. 예를 들어, LCD(Liquid Crystal Display), OLED(Organic Light Emitting Diodes) 디스플 레이, LED(Light Emitting Diodes), 마이크로 LED(micro LED), Mini LED, PDP(Plasma Display Panel), QD(Quantum dot) 디스플레이, QLED(Quantum dot light-emitting diodes) 등과 같은 다양한 형태의 디스플레이 로 구현될 수 있다. 디스플레이 내에는 a-si TFT, LTPS(low temperature poly silicon) TFT, OTFT(organic TFT) 등과 같은 형태로 구현될 수 있는 구동 회로, 백라이트 유닛 등도 함께 포함될 수 있다. 사용자 인터페이스는 버튼, 터치 패드, 마우스 및 키보드와 같은 장치로 구현되거나, 상술한 디스플레이 기능 및 조작 입력 기능도 함께 수행 가능한 터치 스크린으로도 구현될 수 있다. 프로세서는 사용자 단말의 전반적인 동작을 제어한다. 프로세서는 하나 또는 복수의 프로세서로 구성될 수 있다. 일 실시 예에 따라 프로세서는 디지털 영상 신호를 처리하는 디지털 시그널 프로세서(digital signal processor(DSP), 마이크로 프로세서(microprocessor), GPU(Graphics Processing Unit), AI(Artificial Intelligence) 프로세서, NPU(Neural Processing Unit), TCON(Time controller)으로 구현될 수 있다. 다만, 이 에 한정되는 것은 아니며, 중앙처리장치(central processing unit(CPU)), MCU(Micro Controller Unit), MPU(micro processing unit), 컨트롤러(controller), 어플리케이션 프로세서(application processor(AP)), 또 는 커뮤니케이션 프로세서(communication processor(CP)), ARM 프로세서 중 하나 또는 그 이상을 포함하거나, 해당 용어로 정의될 수 있다. 프로세서는 UI 화면을 표시하도록 디스플레이를 제어할 수 있다. 여기서, UI 화면은 이미지, 동영상, 텍스트, 음악 등과 같은 다양한 컨텐츠 재생 화면, 다양한 컨텐츠를 포함하는 어플리케이션 실행 화면, 웹 브라 우저 화면, GUI(Graphic User Interface) 화면 등을 포함할 수 있다. 일 실시 예에 따라 프로세서는 외부 기기와 관련된 UI 화면을 제공할 수 있다. 이 경우, 해당 UI 화면은 OS 상에서 사용자가 직접 사용하게 되는 소프트웨어인 어플리케이션(Application)을 통해 제공될 수 있다. 이 경우, 어플리케이션은 디스플레이 화면 상에서 아이콘 인터페이스 형태로 제공될 수 있다. 일 예에 따라 어플리케이션을 통해 제공되는 UI 화면은 제품과 관련된 다양한 정보를 제공할 수 있다. 여기서, UI 화면은 사 용자와 인터페이스를 위한 구성으로, 사용자의 입력을 수신하기 위한 입력 인터페이스 및 사용자 입력에 따른정보(예를 들어 제어 정보)를 표시하는 출력 인터페이스를 포함할 수 있다. 프로세서는 메모리에 저장된 어플리케이션을 실행함으로써 특정 동작을 제어할 수 있다. 여기서, 어 플리케이션은 지도 어플리케이션, 캘린더 어플리케이션, 리마인더 어플리케이션 등을 포함할 수 있다. 프로세서는 지도 어플리케이션을 실행하여 지도 영역 및 일정 영역을 포함하는 UI 화면을 디스플레이 상에 표시할 수 있다. 일 예에 따라 프로세서는 지도 어플리케이션이 실행된 상태에서 일정 작성 버튼이 터치 입력되면, 지도 영역이 상단에 일정 영역이 하단에 포함되는 UI 화면을 디스플레이 상에 표시할 수 있다. 프로세서는 사용자가 일정 영역을 터치하면 새 일정의 작성 여부를 묻는 UI 창을 표시하고, 작성할 스케줄 의 시작 날짜와 종료 날짜를 선택하는 버튼을 디스플레이 상에 표시할 수 있다. 또한, 프로세서는 사 용자가 직접 작성할지 또는 연동된 캘린더의 일정을 가져올지 선택하는 버튼도 디스플레이 상에 표시할 수 있다. 제1 사용자 명령에 따라 연동된 캘린더의 일정을 가져오는 방법이 선택되면, 캘린더 서버로부터 수신된 사 용자의 일정 정보를 일정 영역에 표시할 수 있다. 예를 들어, 연동된 캘린더의 일정을 가져오는 방법이 선택되 면, 사전 연동되어 있는 캘린더 어플리케이션에 저장된 일정 DB에서 사용자가 설정한 날짜의 일정 중에서 시작 시각과 종료 시각이 설정되어 있는 일정 목록이 지도 어플리케이션으로 전송되어 표시될 수 있다. 이 경우, 목 록의 각 항목마다 선택할 수 있어 사용자가 일정 영역에 작성하고 싶은 일정 항목만 선택할 수 있다. 일 예에 따라, 일정 목록은 날짜별 분류 후 시작 시각을 기준으로 오름차순 정렬될 수 있다. 이 경우, 각 일정마다 설정 되어 있는 시작시각과 종료시각에 맞게 일정 표에 사각형의 영역으로 표시될 수 있다. 또한, 프로세서는 사용자의 일정 정보에 대응되는 장소를 지도 영역에 표시할 수 있다. 예를 들어, 지도 어플리케이션은 관리 서버의 지도 DB에 접근하여 위치 검색 모듈을 이용하여 각 일정에 사전 입력되어 있 는 장소 정보를 검색할 수 있다. 이어서, 지도 어플리케이션은 검색 결과로 나온 장소 좌표를 참조하여 지도 어 플리케이션의 지도 영역에 대응되는 장소를 점과 같은 식별 부호로 표시할 수 있다. 이 경우, 지도 어플리케이 션은 사용자가 부정확하다고 판단하는 장소 위치, 사전 입력되어 있지 않아 누락된 장소에 대해서는 수정할 수 있다. 또한, 지도 어플리케이션은 사용자가 새로운 장소를 검색하면 관리 서버의 지도 DB에서 새로운 장소 정보 목록이 지도 어플리케이션 화면에 표시되며 사용자가 그 중 하나를 선택할 수 있다. 또한, 프로세서는 제2 사용자 명령에 따라 일정 영역에 포함된 일정 목록을 관리 서버로 전송할 수 있다. 일 예에 따라 사용자가 일정 경로 안내 버튼을 터치하면 일정 영역에 포함된 일정 목록이 사용자 단말 에서 관리 서버로 전송될 수 있다. 관리 서버는 사용자 단말로부터 수신된 일정 목록에 기초하여 동일 날짜의 제1 일정 정보 및 제1 일정 정 보에 후행하는 제2 일정 정보를 획득하고, 제1 일정 정보에 대응되는 제1 장소 정보, 제2 일정 정보에 대응되는 제2 장소 정보, 제1 일정 정보의 종료 시각 및 교통 정보에 기초하여 최단 경로 정보를 획득하여 사용자 단말 로 전송할 수 있다. 일 예에 따라, 관리 서버는 동일 날짜에서 후행 일정이 존재하는 특정 일정만 추출하여 특정 일정의 종료 시각을 출발시각으로 하는 최단 경로 안내 프로그램을 실행할 수 있다. 또한, 관리 서버는 최적 시간 대를 고려하여 최단 경로 정보를 획득할 수 있다. 일 실시 예에 따르면, 사 용자 단말은 일정 영역 상에서 여유 경로에 해당하는 경로가 선택되면, 최적 시간대를 추천받을지 여부를 문의하는 UI 창을 표시하고, 제3 사용자 명령에 따라 여유 경로에 대한 정보를 관리 서버로 전송할 수 있 다. 이 경우, 관리 서버는 사용자 단말로부터 여유 경로에 대한 정보가 수신되면, 최근 임계 시간 구 간(예를 들어 최근 4주) 동안의 교통 정보에 기초하여 선행 일정의 종료 시각을 출발 시각으로 하는 복수의 제1 경로(예를 들어 각 주의 교통 정보로 산출된 경로) 및 후행 일정의 시작 시각을 도착 시간으로 하는 복수의 제2 경로로(예를 들어 각 주의 교통 정보로 산출된 경로)를 획득할 수 있다. 이어서, 관리 서버는 복수의 제1 경로의 평균 소요 시간 및 복수의 제2 경로의 평균 소요 시간을 비교하여 최단 경로 정보를 획득할 수 있다. 이 경우, 관리 서버는 여유 경로 내에 포함된 경로 선을 포함하는 최소 크기의 직사각형 영역을 가로 및 세로로 각각 기설정된 배수(예를 들어 1.5배) 만큼 확대한 내부 영역에 대응되는 최근 임계 시간 구간 동안의 교통 정보에 기초하여 복수의 제1 경로 및 복수의 제2 경로를 획득할 수 있다. 이어서, 관리 서버는 최단 경로 안내가 완료되면 각 경로마다 출발 시각, 도착 시각, 소요 시간, 이동 경 로가 포함되는 경로 DB를 생성할 수 있다. 이 경로 DB는 관리 서버에서 사용자 단말로 전송될 수 있 다. 이 경우 지도 어플리케이션은 경로 DB의 정보를 사용하여 각 경로의 출발 시각, 종료 시각 및 소요 시각을 일정 영역에 표시할 수 있다. 또한, 지도 어플리케이션은 각 경로의 이동 경로를 지도 영역에 표시할 수 있다. 경우에 따라 관리 서버는 사용자에 의해 선택된 교통 수단 정보에 기초하여 최단 경로 정보를 획득할 수 있으며, 교통 수단 정보는, 대중 교통 및 자기 차량 중 적어도 하나를 포함할 수 있다. 한편, 후행 일정의 시작 시각에서 특정 경로의 도착 시각을 뺀 값을 특정 경로의 공백 시간으로 정의될 수 있다. 공백 시간이 음수인 경로는 시간 부족 경로라고 정의되며 일정 영역 상에서 해당 경로 영역에 ‘시간 부 족’라벨로 표시될 수 있다. 공백 시간이 30분 이상인 경로는 여유 경로라고 정의되며 해당 경로 영역에 ‘여유 ’라벨이 표시될 수 있다. 또한, 공백 시간이 양수인 경로는 공백 시간이 일정 영역 상에서 사각형 영역으로 표 시될 수 있다. 또한, 프로세서는 공백 시간이 음수로 산출되는 경우 후행 일정 정보를 변경하기 위한 상대방 연락처 및 장소 연락처 중 적어도 하나를 가이드하는 UI를 제공할 수 있다. 한편, 프로세서는 제1 일정 정보 및 제2 일정 정보 간 공백 시간 및 공백 시간에 대응되는 체류 지역의 장 소 정보에 기초하여 공백 시간 동안 체류할 추천 장소를 제공할 수 있다. 일 예에 따라, 프로세서는 공백 시간에 대응되는 체류 지역 내의 장소 중 광고 계약된 장소에 우선 순위를 부여하여 추천 장소를 제공할 수 있다. 다른 예에 따라, 프로세서는 공백 시간에 대응되는 체류 지역 내의 장소 중 사용자의 프로필 정보 및 선호 도 정보에 부합되는 장소에 우선 순위를 부여하여 추천 장소를 제공할 수 있다. 또한, 프로세서는 공백 시간의 길이, 공백 시간의 시간대 및 체류 지역의 장소 타입 정보에 기초하여 공백 시간 동안 체류할 후보 장소를 선택하고, 선택된 후보 장소 중 공백 시간에 대응되는 체류 지역 내의 장소 중 사용자의 프로필 정보 및 선호도 정보에 부합되는 장소에 우선 순위를 부여하여 추천 장소를 제공할 수 있다. 또한, 프로세서는 학습된 인공 지능 모델에 사용자의 프로필 정보 및 선호도 정보, 공백 시간의 길이, 공 백 시간의 시간대 및 장소 타입 정보를 입력하고, 인공 지능 모델로부터 출력되는 장소 정보 및 확률 정보에 기 초하여 추천 장소를 제공할 수도 있다. 이에 따라 메모리는 복수의 레이어를 포함하는 인공 지능 모델에 관한 정보를 저장할 수 있다. 여기서, 인공 지능 모델에 관한 정보를 저장한다는 것은 인공 지능 모델의 동작과 관련된 다양한 정보, 예를 들어 신경망 모델에 포함된 복수의 레이어에 대한 정보, 복수의 레이어 각각에서 사 용되는 파라미터(예를 들어, 필터 계수, 바이어스 등)에 대한 정보 등을 저장한다는 것을 의미할 수 있다. 다만, 인공 지능 모델은 관리 서버에 저장되고, 인공 지능 모델과 관련된 동작은 관리 서버에서 수행 되는 것도 가능하다. 다른 실시 예에 따라 관리 서버는 리마인더 어플리케이션을 관리하는 리마인더 서버로부터 수신된 할 일 리스트 정보에 기초하여 대응되는 리마인더 장소 정보를 획득하고, 획득된 리마인더 장소 정보를 사용자 단 말로 전송할 수 있다. 이 경우, 사용자 단말은 관리 서버로부터 수신된 리마인더 장소 정보에 우선 순위를 부여하여 추천 장소를 제공할 수 있다. 그 밖에 사용자 단말은 위치를 센싱하는 위치 센서(미도시), 카메라(미도시), 마이크(미도시)를 더 포함할 수 있다. 위치 센서(미도시)는 GPS(Global Positioning System) 수신기로 구현될 수 있으나, 사용자 단말(10 0)의 위치 정보를 획득할 수 있다면 한정되지 않고 적용 가능하다. 마이크(미도시)는 사용자 음성이나 기타 소 리를 입력받아 오디오 데이터로 변환하기 위한 구성이다. 예를 들어, 본 개시의 다양한 실시 예에 따른 UI 화면 상에서 입력되는 사용자 명령이 음성 명령 형태로 입력될 수도 있다. 도 3은 본 개시의 일 실시 예에 따른 관리 서버의 구성을 나타내는 블럭도이다. 도 3에 따르면, 관리 서버는 데이터베이스, 프로세서, 장소 추천 모듈, 위치 검색 모듈 , 경로 안내 모듈 및 통신 인터페이스를 포함한다. 데이터베이스, 프로세서 및 통신 인터페이스의 구현 형태는 도 2에 도시된 메모리, 통신 인터페이스 및 프로세서의 구현 형태와 동일/유사하므로 구현 형태에 대한 자세한 설명은 생략하도록 한다. 장소 추천 모듈, 위치 검색 모듈 및 경로 안내 모듈은 적어도 하나의 소프트웨어 또는 적어도 하나의 하드웨어 또는, 이들의 조합 중 적어도 하나로 구현 가능하다. 장소 추천 모듈, 위치 검색 모 듈 및 경로 안내 모듈은 프로세서의 일 부분으로 구현될 수도 있음은 물론이다. 데이터베이스는 지도 DB, 경로 DB, 교통정보 DB, 광고 DB를 포함할 수 있다. 지도 DB는 지도와 관련된 다양한 데이터를 저장하는 데이터베이스이다. 특히, 다양한 장소의 위치 정보를 좌표 정보 형태로 저장할 수 있다. 경로 DB는 최단 경로 안내 프로그램에 의해 획득된 경로와 관련된 다양한 데이터를 저장하는 데이터베이스 이다. 예를 들어, 각 경로의 출발 시각, 도착 시각, 소요 시각, 이동 경로 등의 데이터를 저장할 수 있다. 교통정보 DB는 과거의 교통 관련 데이터를 저장하는 데이터베이스이다. 교통정보 DB는 최근의 교통 데이터에 기초하여 주기적으로 업데이트될 수 있다. 광고 DB는 광고와 관련된 다양한 데이터를 저장하는 데이터베이스이다. 예를 들어, 광고 계약된 장소, 매 장 등의 식별 정보, 위치 정보, 광고 계약 기간, 광고 레벨 등의 다양한 정보를 저장할 수 있다. 관리 서버는 통신 인터페이스를 통해 사용자 단말, 캘린더 서버, 리마인더 서버 등과 통신하여 본 개시에 따른 서비스를 제공하도록 구현될 수 있다. 도 4는 본 개시의 일 실시 예에 따른 캘린더와 연동되어 일정 표를 작성하는 과정을 설명하기 위한 시퀀스도이 다. 도 4에 따르면, 사용자 단말은 지도 어플리케이션의 실행 화면에 포함된 일정 영역에서 시작 날짜 및 종료 날짜가 설정되면(S410), 설정된 시작 날짜 및 종료 날짜를 캘린더 서버로 송신할 수 있다(S415). 예를 들어, 지도 어플리케이션의 실행 화면에서 일정 작성 버튼이 터치 입력되면, 도 9a에 도시된 바와 같이 상 단의 지도 영역 및 하단의 일정 영역을 포함하는 화면이 표시되고, 사용자가 일정 표의 빈 영역을 터 치하면 새 일정을 작성하는지 여부를 묻는 창이 화면에 표시되며. 작성할 스케줄의 시작 날짜 및 종료 날짜를 선택하는 버튼이 표시될 수 있다. 캘린더 서버는 시작 날짜 및 종료 날짜가 수신되면(S420), 해당 날짜의 일정 목록을 사용자 단말로 전송할 수 있다(S425). 예를 들어, 캘린더 서버는 일정 DB에서 사용자가 설정한 날짜의 일정 중에서 시작 시각 및 종료 시각이 설정되어 있는 일정 목록을 사용자 단말로 전송할 수 있다. 사용자 단말은 캘린더 서버로부터 일정 목록이 수신되면(S430), 일정 목록을 일정 영역에 표시하고, 해당 일정 목록에 포함된 각 일정의 장소 정보를 관리 서버로 송신할 수 있다(S435). 예를 들어, 도 9b에 도시된 바와 같이 일정 목록은 날짜별 분류 후 시작 시각을 기준으로 오름차순 정렬될 수 있다. 또는 사용자 단 말은 일정 목록 중 일부 일정 만을 선택할 수도 있고 이 경우 선택된 일정 만이 일정 표에 작성되고, 해당 일정의 장소 정보를 관리 서버로 송신할 수도 있다. 관리 서버는 각 일정의 장소 정보가 수신되면(S440), 지도 DB에 기초하여 각 장소 정보의 위치 좌표를 검 색할 수 있다(S445). 예를 들어, 지도 어플리케이션이 지도 DB에 접근하여 각 장소 정보의 위치 좌표를 검색할 수 있다. 관리 서버는 검색된 각 장소의 위치 좌표를 사용자 단말, 예를 들어, 지도 어플리케이션으로 송신할 수 있다(S450). 사용자 단말은 각 장소의 위치 좌표가 수신되면(S455), 각 일정을 일정 영역에 표시하고(S460), 각 일정의 장소 위치를 지도 영역에 표시할 수 있다(S465). 예를 들어, 각 일정의 장소 위치는 점으로 표시될 수 있다. 도 5는 본 개시의 일 실시 예에 따른 일정 간 이동 경로를 안내하는 과정을 설명하기 위한 시퀀스도이다. 도 5에 따르면, 사용자 단말은 일정 표에 포함된 일정 목록 정보를 관리 서버로 송신할 수 있다 (S510). 관리 서버는 일정 목록이 수신되면(S515), 각 일정 별 최단 경로 정보를 획득하고(S520), 획득된 각 일정 별 최단 경로 정보를 사용자 단말로 송신할 수 있다(S525). 사용자 단말은 각 일정 별 최단 경로 정보가 수신되면(S530), 각 경로 정보를 일정 영역에 표시하고 (S535), 각 경로를 선 형태로 지도 영역에 표시할 수 있다(S540).도 6은 본 개시의 일 실시 예에 따른 일정 간 이동 경로의 최적 시간대를 추천하는 과정을 설명하기 위한 시퀀 스도이다. 일 예에 따라 도 9d에 도시된 바와 같이 일정 간 이동 경로에 대해 최적 시간대 추천을 받을 것인지 문의하는 UI 창이 제공될 수 있다. 해당 UI 창에서 'OK 버튼'이 선택되면, 도 6에 도시된 바와 같이 사용자 단말은 이동 경로 및 일정 정보를 관리 서버로 송신한다(S610). 관리 서버는 이동 경로 및 일정 정보가 수신되면(S615), 이동 경로에 대해 일정 정보와 동일 요일의 최근 임계 시간 구간, 예를 들어 최근 4 주간 교통 정보를 검색한다(S620). 이 경우, 관리 서버는 출발 장소와 도착 장소를 포괄하는 최소 크기의 직사각형 영역을 가로, 세로 각각 1.5배씩 확대한 영역 내부의 교통 정보만 추출하고, 선행 일정의 종료 시각과 후행 일정의 시작 시각 사이의 교통정보만 추출할 수 있다. 이에 따라 교통 정보 검색 소요 비용을 절약할 수 있다. 관리 서버는 선행 일정의 종료 시각이 출발 시각인 경로 A를 획득하고(S625), 후행 일정의 시작 시각이 출 발 시각인 경로 B를 획득한다(S630). 이 경우 관리 서버는 최근 4 주에 대응되는 각 주에 대해 경로 A 및 경로 B를 획득하여 총 8개의 경로를 획득할 수 있다. 이 경우, 관리 서버는 경로 안내 모듈에서 교통 정보 DB에서 검색한 특정 교통정보 및 지도 DB의 도로망 데이터를 사용하여 네트워크 분석 최단 경로 탐색 기법을 통해 8개의 최단 경로를 획득할 수 있다. 이어서, 관리 서버는 총 8개의 경로 각각에 대해 평균 소요 시간을 계산하고(S635), 평균 소요 시간이 상 대적으로 짧은 경로 정보를 사용자 단말로 송신할 수 있다(S640). 이에 따라 일정 간 이동 경로의 최적 시 간대를 추천할 수 있게 된다. 사용자 단말은 평균 소요 시간이 짧은 경로 정보가 수신되면(S645), 해당 정보에 기초하여 일정 영역의 일 정 표를 갱신할 수 있다(S650). 도 7은 본 개시의 일 실시 예에 따른 일정 간 공백 시간에 방문 가능한 장소를 추천하는 과정을 설명하기 위한 시퀀스도이다. 도 7에 따르면, 사용자 단말은 공백 시간의 체류 지역 정보를 관리 서버로 송신한다(S710). 여기서, 공백 시간이 선행 일정 직후인 경우 공백 시간의 체류 지역은 선행 일정의 장소와 동일하게 설정되고, 공백 시 간이 후행 일정 직전인 경우 공백 시간의 체류 지역은 후행일정의 장소와 동일하게 설정될 수 있다. 일 예에 따 라 도 6에서 결정된 이동을 위한 최적 시간대에 따라 공백 시간이 결정될 수 있다. 예를 들어, 도 9c에 도시된 바와 같이 사용자 단말에서는 일정 영역에 체류 지역 정보가 표시될 수 있다. 관리 서버는 사용자 단말로부터 공백 시간의 체류 지역 정보가 수신되면(S715), 체류 지역을 기준으 로 임계 거리 이내 장소를 검색할 수 있다(S720). 이 경우 관리 서버는 특정 분류에 해당하는 장소 목록 만을 추출할 수 있다(S725). 일 예에 따라 관리 서버는 장소 추천 모듈을 통해 지도 DB에서 체류 지역 반경 500m 이내의 범 위와 교차하는 장소 목록을 추출할 수 있다. 이어서, 장소 목록 내에서 특정 분류에 해당하는 장소만 추출한다. 예를 들어, 특정 분류는 기본추천장소(카페, 극장, 공원, 미술관, 박물관, 공공시설 등), 식사추천장소(음식 점), 업무추천장소(은행, 관공서), 쇼핑추천장소(마트, 백화점, 상점가 등)을 포함할 수 있다. 또한, 관리 서버는 광고 DB에서 체류 지역 인근에서 광고 계약된 정보가 있는 장소를 검색하여 추출 된 장소 목록 중 검색된 장소에 우선 순위를 부여할 수 있다(S730). 이어서, 관리 서버는 우선 순위가 부여된 장소 목록을 사용자 단말로 송신할 수 있다(S735). 사용자 단말은 관리 서버로부터 장소 목록이 수신되면(S740), 지도 영역에 체류 지역을 중심으로 하 는 반경 원을 표시하고, 추천 장소들의 위치에 핀으로 표시하고, 일정 영역의 일정 표 대신 장소 목록 영역을 표시할 수 있다(S745). 예를 들어, 도 9e에 도시된 바와 같이 지도 영역에서 체류 지역을 중심으로 하는 반경 500m 원 모양을 표시하고, 반경 500m 이내에서 추천된 장소들의 위치는 핀으로 표시할 수 있다. 또한, 반 경 500m 이내에서 추천된 장소들의 위치가 핀으로 표시될 때 기본추천장소가 가장 먼저 표시되며 우선순위가 부 여된 광고 장소들은 상호명 라벨이 핀과 함께 지도 영역에 표시될 수 있다. 또한 광고 장소들은 하단의 장 소 목록 영역의 최상단에 표시되며 광고라는 작은 글자가 함께 표시될 수 있다. 또한, 일정 영역의 일정 표 대신 장소 목록 영역이 표시될 수 있다. 도 8은 본 개시의 다른 실시 예에 따른 일정 간 공백 시간에 방문 가능한 장소를 추천하는 과정을 설명하기 위 한 시퀀스도이다. 도 8에 따르면, 리마인더 서버는 관리 서버의 요청에 따라 할 일 목록을 송신할 수 있다(S810) 관리 서버는 리마인더 서버로부터 할 일 목록이 수신되면(S815), 할 일 목록에서 장소 단어를 추출한 다(S820). 예를 들어, 관리 서버는 할 일 목록에서 장소의 특성을 가지는 단어를 추출하는데 이 때 카페, 도서관, 서점, 은행 등 장소를 가리키는 수 많은 단어들을 목록화한 데이터를 참조할 수 있다. 추출된 장소 단 어를 이용해 장소를 검색하는 과정은 장소 추천 모듈에 의해 실행될 수 있다. 이어서, 관리 서버는 S820 단계에서 추출된 장소 단어를 이용하여 지도 DB에서 체류 지역 반경 임계 거리 내 장소를 검색하여 장소 목록을 추출할 수 있다(S825). 이 경우, 관리 서버는 장소 목록 내에서 체 류 지역과 가까운 장소일수록 우선 순위를 부여하여 사용자 단말로 전송할 수 있다. 사용자 단말은 관리 서버로부터 장소 목록이 수신되면(S835), 지도 영역에 체류 지역을 중심으로 하 는 반경 원을 표시하고, 추천 장소들의 위치에 핀으로 표시하고, 일정 영역의 일정 표 대신 장소 목록 영역을 표시할 수 있다. 상술한 다양한 실시 예에 따르면, 클라이언트와 미팅이 잦은 직장인의 경우 불규칙한 일정 간 이동계획의 효율 성을 높여주며, 타지 출장이 잦은 직장인의 경우 생소한 출장 지역에서 장소 정보를 찾는 일에 도움을 줄 수 있 다. 또한, 기존의 지도와 캘린더 결합 기술에서 나아가 일정 간 이동 계획 및 공백 시간 활용의 효율성을 높여주는 기능이 추가되어 지도와 캘린더의 활용성이 높아질 수 있다. 또한, 스케줄 간 이동 시 최적 시간대에 이동하도록 제안하여 시민들의 이동 시간대가 분산되는 효과를 통해 교 통 혼잡과 대중 교통 차내 혼잡 해소에 기여할 수 있다. 또한, 공백 시간을 효율적으로 활용할 수 있게 도와, 보다 다양한 지역에서 체류할 수 있는 가능성과 소비의 규 모 및 영역을 확대하여 상권 활성화에 기여할 수 있다. 또한, 공백 시간의 체류 지역에서의 장소 추천 시 점포의 정보를 상위 노출해주는 방식을 통해 새로운 광고 수 익원을 창출할 수 있다. 또한, 기존의 지도 어플리케이션에 추가 탑재하여 캘린더와 지도가 융합된 성격의 어플리케이션을 IT기업에서 운영할 수 있다. 또한, 개인 뿐 아니라 기업을 대상으로 확대하여 기업의 근무자 스케줄 관리 및 출장 관리를 지원하여 업무의 효율성을 높이고 인건비를 절약할 수 있다. 상술한 본 개시의 다양한 실시 예들에 따른 방법들은, 기존 사용자 단말 및 서버에 대한 소프트웨어 업그레이드, 또는 하드웨어 업그레이드 만으로도 구현될 수 있다. 또한, 상술한 본 개시의 다양한 실시 예들은 사용자 단말에 구비된 임베디드 서버, 또는 사용자 단말 중 적어도 하나의 외부 서버를 통해 수행되는 것도 가능하다. 한편, 본 개시의 일 실시 예에 따르면, 이상에서 설명된 다양한 실시 예들은 기기(machine)(예: 컴퓨터)로 읽을 수 있는 저장 매체(machine-readable storage media)에 저장된 명령어를 포함하는 소프트웨어로 구현될 수 있다. 기기는, 저장 매체로부터 저장된 명령어를 호출하고, 호출된 명령어에 따라 동작이 가능한 장치로서, 개 시된 실시 예들에 따른 사용자 단말을 포함할 수 있다. 명령이 프로세서에 의해 실행될 경우, 프로세서가 직접, 또는 프로세서의 제어 하에 다른 구성요소들을 이용하여 명령에 해당하는 기능을 수행할 수 있다. 명령은 컴파 일러 또는 인터프리터에 의해 생성 또는 실행되는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장매체는, 비 일시적(non-transitory) 저장매체의 형태로 제공될 수 있다. 여기서,‘비일시적 저장매체'는 실재(tangible)하 는 장치이고, 신호(signal)(예: 전자기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경우와 임시적으로 저장되는 경우를 구분하지 않는다. 예로, '비일시적 저장매체'는 데이터가 임시적으로 저장되는 버퍼를 포함할 수 있다. 또한, 상술한 다양한 실시 예들에 따른 구성 요소(예: 모듈 또는 프로그램) 각각은 단수 또는 복수의 개체로 구 성될 수 있으며, 전술한 해당 서브 구성 요소들 중 일부 서브 구성 요소가 생략되거나, 또는 다른 서브 구성 요 소가 다양한 실시 예에 더 포함될 수 있다. 대체적으로 또는 추가적으로, 일부 구성 요소들(예: 모듈 또는 프로 그램)은 하나의 개체로 통합되어, 통합되기 이전의 각각의 해당 구성 요소에 의해 수행되는 기능을 동일 또는 유사하게 수행할 수 있다. 다양한 실시 예들에 따른, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동 작들은 순차적, 병렬적, 반복적 또는 휴리스틱하게 실행되거나, 적어도 일부 동작이 다른 순서로 실행되거나, 생략되거나, 또는 다른 동작이 추가될 수 있다. 이상에서는 본 개시의 바람직한 실시 예에 대하여 도시하고 설명하였지만, 본 개시는 상술한 특정의 실시 예에"}
{"patent_id": "10-2021-0042889", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "한정되지 아니하며, 청구범위에서 청구하는 본 개시의 요지를 벗어남이 없이 당해 개시에 속하는 기술분야에서 통상의 지식을 가진 자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 개시의 기술 적 사상이나 전망으로부터 개별적으로 이해되어져서는 안될 것이다."}
{"patent_id": "10-2021-0042889", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시 예에 따른 서비스 시스템을 나타내는 도면이다. 도 2는 본 개시의 일 실시 예에 따른 사용자 단말의 구성을 나타내는 블럭도이다. 도 3은 본 개시의 일 실시 예에 따른 관리 서버의 구성을 나타내는 블럭도이다. 도 4는 본 개시의 일 실시 예에 따른 캘린더와 연동되어 일정 표를 작성하는 과정을 설명하기 위한 시퀀스도이 다. 도 5는 본 개시의 일 실시 예에 따른 일정 간 이동 경로를 안내하는 과정을 설명하기 위한 시퀀스도이다. 도 6은 본 개시의 일 실시 예에 따른 일정 간 이동 경로의 최적 시간대를 추천하는 과정을 설명하기 위한 시퀀 스도이다. 도 7은 본 개시의 일 실시 예에 따른 일정 간 공백 시간에 방문 가능한 장소를 추천하는 과정을 설명하기 위한 시퀀스도이다. 도 8은 본 개시의 일 실시 예에 따른 일정 간 공백 시간에 방문 가능한 장소를 추천하는 과정을 설명하기 위한 시퀀스도이다. 도 9a 내지 도 9e는 본 개시의 일 실시 예에 따라 사용자 단말에서 제공되는 UI 화면을 설명하기 위한 도면들이 다"}
