{"patent_id": "10-2010-7003027", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2010-0041827", "출원번호": "10-2010-7003027", "출원인": "콸콤 인코포레이티드", "발명자": "나랑, 모힛"}}
{"patent_id": "10-2010-7003027", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "무선 통신 시스템들에서 사용되는 방법으로서,제1 네트워크와 통신하는 단계;탐색 레이트로 제2 네트워크를 탐색하는 단계; 및적어도 하나의 기준에 적어도 부분적으로 기초하여 상기 탐색 레이트를 제어하는 단계를 포함하는, 무선 통신 시스템들에서 사용되는 방법."}
{"patent_id": "10-2010-7003027", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제1 네트워크는 2G 네트워크이고, 상기 제2 네트워크는 3G 네트워크인, 무선 통신 시스템들에서 사용되는방법."}
{"patent_id": "10-2010-7003027", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 탐색 레이트를 제어하는 단계는 백-오프(back-off) 방식을 구현하는 단계를 더 포함하는, 무선 통신 시스템들에서 사용되는 방법."}
{"patent_id": "10-2010-7003027", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 백-오프 방식들은 지수적 백-오프 방식, 또는 선형적 백-오프 방식 중 적어도 하나를 포함하는, 무선 통신시스템들에서 사용되는 방법."}
{"patent_id": "10-2010-7003027", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 기준은 임계치를 넘어서는 연속적인 실패한 탐색들의 수, 액세스 단말의 이동성, 임계치를 넘어서는 신호강도의 변동, 시간 주기를 통한 재선택들의 수, 시간 주기를 통해 검출된 새로운 이웃들의 수, 임계치를 초과하는 수신기 자동 이득 제어(Rx AGC)의 변화, 또는 임계치를 초과하는 이웃 셀들의 Rx AGC의 변화 중 적어도 하나를 포함하는, 무선 통신 시스템들에서 사용되는 방법."}
{"patent_id": "10-2010-7003027", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 제2 네트워크는 다수의 주파수들상에서 송신되며,상기 방법은 상기 제2 네트워크에 대한 각각의 주파수들을 탐색하는 단계, 및 각각의 주파수에 대한 상기 탐색레이트를 제어하는 단계를 더 포함하는, 무선 통신 시스템들에서 사용되는 방법."}
{"patent_id": "10-2010-7003027", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 제2 네트워크의 탐색, 상기 탐색 레이트의 제어, 또는 상기 기준의 결정 중 적어도 하나를 인공 지능을 통해 자동화하는 단계를 더 포함하는, 무선 통신 시스템들에서 사용되는 방법."}
{"patent_id": "10-2010-7003027", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "공개특허 10-2010-0041827-2-무선 통신 장치로서,탐색 레이트 및 적어도 하나의 주파수에서 상기 적어도 하나의 주파수상에서 송신된 셀의 네트워크를 탐색하는것, 및 적어도 하나의 기준에 적어도 부분적으로 기초한 상기 탐색 레이트를 제어하는 것과 관련된 명령들을 포함하는 메모리; 및상기 메모리에 포함된 명령들을 실행하도록 구성되는, 상기 메모리에 연결되는 프로세서를 포함하는, 무선 통신 장치."}
{"patent_id": "10-2010-7003027", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "무선 통신 장치로서,탐색 레이트로 셀의 네트워크를 탐색하기 위한 수단; 및적어도 하나의 기준에 적어도 부분적으로 기초하여 상기 탐색 레이트를 제어하기 위한 수단을 포함하는, 무선 통신 장치."}
{"patent_id": "10-2010-7003027", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 탐색 레이트의 제어는 적어도 하나의 백-오프(back-off) 방식의 구현을 포함하는, 무선 통신 장치."}
{"patent_id": "10-2010-7003027", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 백-오프 방식들은 지수적 백-오프 방식, 또는 선형적 백-오프 방식 중 적어도 하나를 포함하는, 무선 통신장치."}
{"patent_id": "10-2010-7003027", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제9항에 있어서,상기 기준은 미리 결정된 임계치를 넘어서는 연속적인 실패한 탐색들의 수, 액세스 단말의 이동성, 미리 결정된임계치를 넘어서는 신호 강도의 변동, 미리 결정된 시간 주기를 통한 재선택들의 수, 미리 결정된 시간 주기를통해 검출된 새로운 이웃들의 수, 미리 결정된 임계치를 초과하는 수신기 자동 이득 제어(Rx AGC)의 변화, 또는미리 결정된 임계치를 초과하는 이웃 셀들의 Rx AGC의 변화 중 적어도 하나를 포함하는, 무선 통신 장치."}
{"patent_id": "10-2010-7003027", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제9항에 있어서,네트워크가 송신되는 각각의 주파수에 대한 탐색 레이트를 제어하기 위한 수단을 더 포함하며,상기 네트워크는 다수의 주파수들을 통해 송신되는, 무선 통신 장치."}
{"patent_id": "10-2010-7003027", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제9항에 있어서,상기 제2 네트워크의 탐색, 상기 탐색 레이트의 제어, 또는 상기 기준의 결정 중 적어도 하나를 자동화하기 위한 수단을 더 포함하는, 무선 통신 장치."}
{"patent_id": "10-2010-7003027", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "컴퓨터-판독가능 매체를 포함하는 컴퓨터 프로그램 물건으로서,상기 컴퓨터-판독가능 매체는,제1 네트워크와 통신하기 위한 코드;공개특허 10-2010-0041827-3-탐색 레이트로 제2 네트워크를 탐색하기 위한 코드; 및적어도 하나의 기준에 적어도 부분적으로 기초하여 상기 탐색 레이트를 제어하기 위한 코드를 포함하는, 컴퓨터 프로그램 물건."}
{"patent_id": "10-2010-7003027", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 제1 네트워크는 2G 네트워크이고, 상기 제2 네트워크는 3G 네트워크인, 컴퓨터 프로그램 물건."}
{"patent_id": "10-2010-7003027", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제15항에 있어서,상기 탐색 레이트를 제어하기 위한 코드는 백-오프 방식을 구현하기 위한 코드를 더 포함하며,상기 백-오프 방식은 상기 액세스 단말에 의한 전력 소모를 감소시키기 위하여 상기 탐색 레이트를 감소시키는,컴퓨터 프로그램 물건."}
{"patent_id": "10-2010-7003027", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서,상기 백-오프 방식들은 지수적 백-오프 방식, 비-지수적 백-오프 방식, 선형적 백-오프 방식, 또는 비-선형적백-오프 방식 중 적어도 하나를 포함하는, 컴퓨터 프로그램 물건."}
{"patent_id": "10-2010-7003027", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제15항에 있어서,상기 기준은 미리 결정된 임계치를 넘어서는 연속적인 실패한 탐색들의 수, 액세스 단말의 이동성, 미리 결정된임계치를 넘어서는 신호 강도의 변동, 미리 결정된 시간 주기를 통한 재선택들의 수, 미리 결정된 시간 주기를통해 검출된 새로운 이웃들의 수, 미리 결정된 임계치를 초과하는 수신기 자동 이득 제어(Rx AGC)의 변화, 또는미리 결정된 임계치를 초과하는 이웃 셀들의 Rx AGC의 변화 중 적어도 하나를 포함하는, 컴퓨터 프로그램 물건."}
{"patent_id": "10-2010-7003027", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제15항에 있어서,상기 제2 네트워크가 송신되는 각각의 주파수에 대한 탐색 레이트를 제어하기 위한 코드를 더 포함하는, 컴퓨터프로그램 물건."}
{"patent_id": "10-2010-7003027", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제15항에 있어서,인공 지능을 사용하여 제2 네트워크의 탐색, 상기 탐색 레이트의 제어, 또는 상기 기준의 결정 중 적어도 하나를 자동화하기 위한 코드를 더 포함하는, 컴퓨터 프로그램 물건."}
{"patent_id": "10-2010-7003027", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "프로세서를 포함하는 무선 통신 장치로서,상기 프로세서는,제1 네트워크와 통신하고;미리 결정된 레이트로 제2 네트워크를 탐색하며; 그리고적어도 하나의 기준에 적어도 부분적으로 기초하여 상기 탐색 레이터를 제어하도록구성되는, 무선 통신 장치.공개특허 10-2010-0041827-4-청구항 23 무선 통신 장치로서,적어도 제1 네트워크와의 통신을 용이하게 하는 접속 컴포넌트 ― 상기 접속 컴포넌트는 상기 제1 네트워크와의접속의 적어도 하나의 기준을 결정하는 기준 컴포넌트를 포함함 ― ; 및적어도 하나의 제2 네트워크를 탐색하는 탐색 컴포넌트를 포함하고,상기 탐색 컴포넌트는 상기 탐색 컴포넌트가 상기 제2 네트워크를 탐색하는 레이트를 정의하는 탐색 레이트 컴포넌트를 포함하고, 상기 탐색 컴포넌트는 상기 탐색 레이트 컴포넌트에서 정의된 상기 탐색 레이트를 조정하는제어 컴포넌트를 더 포함하는, 무선 통신 장치."}
{"patent_id": "10-2010-7003027", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제23항에 있어서,상기 제1 네트워크는 2G 네트워크이고, 상기 제2 네트워크는 3G 네트워크인, 무선 통신 장치."}
{"patent_id": "10-2010-7003027", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제23항에 있어서,상기 제어 컴포넌트는 상기 탐색 레이트의 조정에 사용하기 위한 적어도 하나의 백-오프 방식을 상기 제어 컴포넌트에 제공할 수 있는 백-오프 컴포넌트를 포함하는, 무선 통신 장치."}
{"patent_id": "10-2010-7003027", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "제25항에 있어서,상기 백-오프 방식들은 선형적 백-오프 방식, 또는 지수적 백-오프 방식 중 적어도 하나를 포함하는, 무선 통신장치."}
{"patent_id": "10-2010-7003027", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "제23항에 있어서,상기 제어 컴포넌트는 상기 탐색 컴포넌트에 포함되는 카운터 컴포넌트에 의하여 결정되는 연속적 실패 탐색들의 수에 적어도 부분적으로 기초하여 상기 탐색 레이트를 조정하는, 무선 통신 장치."}
{"patent_id": "10-2010-7003027", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_28", "content": "제23항에 있어서,상기 기준은 미리 결정된 임계치를 넘어서는 연속적인 실패한 탐색들의 수, 액세스 단말의 이동성, 미리 결정된임계치를 넘어서는 신호 강도의 변동, 미리 결정된 시간 주기를 통한 재선택들의 수, 미리 결정된 시간 주기를통해 검출된 새로운 이웃들의 수, 미리 결정된 임계치를 초과하는 수신기 자동 이득 제어(Rx AGC)의 변화, 또는미리 결정된 임계치를 초과하는 이웃 셀들의 Rx AGC의 변화 중 적어도 하나를 포함하는, 무선 통신 장치."}
{"patent_id": "10-2010-7003027", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "제23항에 있어서,상기 제어 컴포넌트는 상기 장치에 포함되는 전력원의 수명을 향상시키기 위하여 상기 탐색 레이트를 조정하는,무선 통신 장치.명 세 서기 술 분 야본 발명은 2007년 7월 10일자로 출원되고 본 발명의 양수인에게 양도된 \"The method and apparatus for [0001]reducing the number of attempts made by UE to decode WCDMA NCELL\"라는 제목의 가출원 번호 제60/948,935호공개특허 10-2010-0041827-5-에 대한 우선권을 주장하며, 그 모든 내용은 본 명세서에 참조로서 통합된다.본 발명의 양상들은 무선 통신 디바이스들과 관련되며, 특히, 탐색 제어를 통한 액세스 단말 배터리 구명을 향 [0002]상시키기 위한 장치 및 방법들과 관련된다.배 경 기 술UMTS 커버리지(이하에서는 \"WCDMA 커버리지\", \"3G 커버리지\", 또는 간단히 \"3G\"로서 지칭됨)는 유비쿼터스가 아 [0003]니며, 때때로 WCDMA 커버리지를 벗어나는 사용자들에게 커버리지를 제공하는 \"대비책(fall back)\" 기술로서GSM/GPRS/에지(Edge) 커버리지(이하에서는 \"2G 커버리지\" 또는 간단히 \"2G\"로서 지칭됨)를 갖는 커버리지의 아일랜드(island)들로서 유지될 것이다.일단 모바일, 액세스 단말 또는 다른 유사한 용어로서 또한 지칭될 수 있는 사용자 장비(UE)가 2G 셀들에 임시 [0004]로 위치하는(camp) 경우에, UE는 WCDMA 셀들의 탐색을 시작할 필요가 있는지 또는 아닌지 여부를 결정하기 위하여 UE는 2G 셀들에 대한 시스템 정보를 판독한다.2G 셀들이 WCDMA NCELL 리스트를 포함한다면, 그 후 UE는 NCELL 리스트에 명시된 1차 동기화 코드들(PCS: [0005]primary synchronization codes) 전부가 식별될 때까지 매 30초마다 WCDMA를 검색하도록 요구된다.UE가 정의된 WCDMA NCELL 리스트를 갖지만 WCDMA가 GSM 셀의 전체 영역을 커버하지 않는 셀에 임시로 위치한다 [0006]면, 그러한 영역의 UE는 매 30초마다 WCDMA 셀들을 탐색할 것이고, 이에 의하여 자신의 배터리 수명을 현저히감소시킬 것이다. 따라서, GSM/GPRS(2G)에 임시로 위치하면서, WCDMA 커버리지(3G 커버리지)의 에지상에 UE들에 대한 UE 배터리 수명의 향상들을 초래할 수 있는 메커니즘들 및 기술들을 갖는 것이 바람직할 것이다.발명의 내용다음은 그러한 실시예들의 기본적인 이해를 제공하기 위하여 하나 이상의 실시예들의 간략화된 요약을 [0007]나타낸다. 이러한 요약은 고려되는 모든 실시예들의 광범위한 개요가 아니며, 임의의 또는 모든 실시예들의 범위를 제한하거나 모든 실시예들의 주요 또는 결정적 엘리먼트들을 확인하도록 의도되지 않는다. 이것의 목적은단지 추후에 개시될 더 상세한 설명에 대한 서문으로서 간략화된 형태로 하나 이상의 실시예들의 몇몇 개념들을나타내는 것이다.본 명세서는 탐색 레이트 제어를 통한 네트워크 커버리지의 에지에 임시로 위치하는 액세스 단말 배터리 수명에 [0008]대한 향상들을 제공한다. 몇몇 양상들에서, 제1 네트워크와 통신하고, 탐색 레이트로 제2 네트워크를탐색하고, 적어도 하나의 기준에 적어도 부분적으로 기초하여 탐색 레이트를 제어하기 위한 방법이 개시된다.다른 양상들에서 액세스 단말들의 배터리 수명 향상을 용이하게 하는 장치가 개시된다. 장치는 탐색 레이트 및 [0009]상기 적어도 하나의 주파수에서 상기 적어도 하나의 주파수상에서 송신된 셀의 네트워크의 탐색 및 적어도 하나의 기준에 적어도 부분적으로 기초한 상기 탐색 레이트의 제어와 관련된 명령들을 포함하는 메모리, 및 메모리에 포함된 명령들을 실행하도록 구성되는, 상기 메모리에 연결되는 프로세서를 포함할 수 있다.하나 이상의 다른 양상들에서, 탐색 레이트 제어를 통한 액세스 단말들의 배터리 수명 향상을 용이하게 하는 장 [0010]치가 개시된다. 장치는 탐색 레이트로 셀의 네트워크를 탐색하기 위한 수단, 및 적어도 하나의 기준에 적어도부분적으로 기초하여 탐색 레이트를 제어하기 위한 수단을 포함한다.또 다른 양상들에 따라, 탐색 레이트 제어를 통해 액세스 단말들의 배터리 수명 향상을 용이하게 하도록 구성되 [0011]는 컴퓨터 실행가능 명령들을 포함하는 컴퓨터-판독가능 매체가 제공된다. 컴퓨터 실행가능 명령들은 제1 네트워크와 통신하기 위한 코드, 탐색 레이트로 제2 네트워크를 탐색하기 위한 코드, 및 적어도 하나의 기준에 적어도 부분적으로 기초하여 상기 탐색 레이트를 제어하기 위한 코드를 포함한다.다른 양상들에서, 탐색 레이트 제어를 통해 배터리 수명 향상을 용이하게 하는 장치가 개시된다. 장치는 적어 [0012]도 제1 네트워크와의 통신을 용이하게 하는 접속 컴포넌트 ― 상기 접속 컴포넌트는 상기 제1 네트워크와의 접속의 적어도 하나의 기준을 결정하는 기준 컴포넌트를 포함함 ― , 및 적어도 하나의 제2 네트워크를 탐색하는탐색 컴포넌트를 포함하며, 상기 탐색 컴포넌트는 상기 탐색 컴포넌트가 상기 제2 네트워크를 탐색하는 레이트를 정의하는 탐색 레이트 컴포넌트를 포함하고, 상기 탐색 컴포넌트는 상기 탐색 레이트 컴포넌트에서 정의된상기 탐색 레이트를 조정하는 제어 컴포넌트를 더 포함한다.전술한 내용 및 관련된 목적들의 달성을 위해, 하나 이상의 실시예들은 이하에서 완전히 개시되고 특히 청구항 [0013]공개특허 10-2010-0041827-6-들에서 지적된 특징들을 포함한다. 하기의 설명 및 첨부된 도면들은 하나 이상의 실시예들의 특정 예시적인 양상들을 상세히 설명한다. 그러나, 이러한 양상들은 다양한 실시예들의 원리들이 이용될 수 있는 다양한 방식들중 몇몇 만을 나타내며, 개시된 실시예들은 모든 그러한 양상들 및 그들의 동등물들을 포함하도록 의도된다.도면의 간단한 설명도 1은 예시적인 다중 액세스 무선 통신 시스템을 도시한다. [0014]도 2는 통신 시스템의 일반적인 블록도를 도시한다.도 3은 예시적인 무선 통신 시스템을 도시한다.도 4는 탐색 레이트 제어를 구현하기 위한 예시적인 무선 통신 장치를 도시하는 일반적인 컴포넌트 블록도이다.도 5는 탐색 레이트 제어를 구현하는 일반화된 방법을 도시하는 흐름도이다.도 6은 대안적인 실시예에 따른 하나 이상의 특징들의 자동화를 용이하게 하는 인공 지능 컴포넌트를 이용하는접근법을 도시한다.도 7은 본 명세서에 개시된 하나 이상의 실시예들을 실행하도록 작동되는 예시적인 디바이스를 도시한다.발명을 실시하기 위한 구체적인 내용이제, 도면들을 참고로 하여 본 발명이 설명되며, 동일한 참조 번호들은 명세서 전반을 통해 동일한 엘리먼트들 [0015]을 지칭하는데 사용된다. 하기의 설명에서, 설명을 목적으로 다수의 특정 세부 사항들이 청구된 본 발명의 전반적 이해를 제공하기 위하여 진술된다. 그러나, 청구된 내용은 이러한 특정 세부 사항들 없이도 실행될 수 있음이 명백할 수 있다. 다른 실시예들에서, 공지된 구조들 및 디바이스들은 청구된 내용의 설명의 용이하게 하기 위하여 블록도로 도시된다.본 출원에서 사용될 때, \"컴포넌트\", \"모듈\", \"시스템\" 등의 용어는 컴퓨터 관련 엔티티, 하드웨어, 펌웨어, 하 [0016]드웨어와 소프트웨어의 조합, 소프트웨어 또는 실행중인 소프트웨어를 언급하기 위한 것이다. 예를 들어, 이에한정되는 것은 아니지만 컴포넌트는 프로세서상에서 실행하는 프로세스, 프로세서, 객체, 실행 파일, 실행 스레드, 프로그램 및/또는 컴퓨터일 수도 있다. 실례로서, 컴퓨팅 디바이스상에서 구동되는 애플리케이션 및 컴퓨팅 디바이스 모두가 컴포넌트일 수 있다. 하나 이상의 컴포넌트가 프로세스 및/또는 실행 스레드 내에 상주할수 있으며, 컴포넌트는 하나의 컴퓨터에 집중될 수도 있고/있거나 2개 이상의 컴퓨터들 사이에 분산될 수도 있다. 또한, 이들 컴포넌트들은 다양한 데이터 구조를 저장한 다양한 컴퓨터 판독 가능 매체로부터 실행될 수 있다. 컴포넌트들은 하나 이상의 데이터 패킷들(예를 들어, 로컬 시스템, 분산 시스템의 및/또는 다른 컴포넌트와 및/또는 신호에 의해 다른 시스템들과 인터넷과 같은 네트워크를 통해 상호 작용하는 하나의 컴포넌트로부터의 데이터)을 갖는 신호에 따르는 등 로컬 및/또는 원격 프로세스들에 의해 통신할 수 있다.추가로, 다양한 실시예들이 액세스 단말과 관련하여 설명된다. 액세스 단말은 시스템, 가입자 유닛, 가입자국, [0017]이동국, 모바일(mobile), 원격국, 원격 단말, 모바일 디바이스, 사용자 단말, 단말, 무선 통신 디바이스, 사용자 에이전트, 사용자 디바이스, 또는 사용자 장비(UE)로 또한 지칭될 수 있다. 액세스 단말은 셀룰러폰, 무선전화, 세션 개시 프로토콜(SIP) 전화, 무선 로컬 루프(WLL) 스테이션, 개인용 디지털 단말(PDA), 무선 접속 능력을 구비한 핸드헬드(handheld) 디바이스, 컴퓨팅 디바이스, 또는 무선 모뎀에 연결되는 다른 프로세싱 디바이스일 수 있다. 또한, 다양한 실시예들이 기지국과 함께 본 명세서에 개시된다. 기지국은 액세스 단말(들)과통신하기 위하여 이용될 수 있으며, 또한 액세스 포인트, 노드 B, e노드B, 또는 몇몇 다른 용어로서 지칭될 수있다.또한, 본 명세서에 개시되는 다양한 양상들 또는 피쳐들은 표준 프로그래밍 및/또는 엔지니어링 기술들을 사용 [0018]하는 방법, 장치, 또는 제조 물품으로서 구현될 수 있다. 본 명세서에서 사용되는 바와 같은 \"제조 물품\"이라는 용어는 임의의 컴퓨터 판독가능 장치로부터 액세스 가능한 컴퓨터 프로그램, 캐리어, 또는 매체(media)를 포함하는 것으로 의도된다. 예를 들어, 컴퓨터-판독가능한 매체는 자기 저장 디바이스들(예를 들면, 하드디스크, 플로피 디스크, 자기 스트립들, 등), 광학 디스크(예를 들면, 컴팩트 디스크(CD), DVD, 등), 스마트 카드, 및 플래쉬 메모리 디바이스들(예를 들면, EPROM, 카드, 스틱, 키 드라이브, 등)를 포함하지만, 이들로 제한되는 것은 아니다. 또한, 본 명세서에 제시되는 다양한 저장 매체는 정보를 저장하기 위한 하나 이상의 디바이스들 및/또는 다른 기계-판독가능한 매체를 포함한다. \"기계-판독가능한 매체\"라는 용어는 명령(들) 및/또는데이터를 저장, 보유, 및/또는 전달할 수 있는 무선 채널 및 다양한 다른 매체를 포함하지만, 이들로 제한되는공개특허 10-2010-0041827-7-것은 아니다.또한, 실시예들이 일반적으로 통신 시스템과 관련하여 설명되었으나, 본 기술분야의 당업자들은 실시예들이 고 [0019]정점(fixed-point) 및 부동 소수점(floating-point) 데이터 표현들 모두를 포함하는, 유한-정밀도 연산(finite-precision arithmetic)을 이용하는 임의의 설계에 적용될 수 있다는 것을 인지할 수 있을 것이다. 본명세서에 개시된 시스템들 및/또는 방법들은 임의의 적절한 타입의 설계와 함께 이용될 수 있고, 그러한 모든타입의 설계(들)는 본 명세서에 첨부된 청구항들의 범위를 벗어나지 않도록 의도된다는 것을 인지해야 한다.이제 도 1을 참조하여, 본 발명에 제시된 다양한 실시예들에 따른 무선 통신 시스템(100)이 개시된다. 시스템 [0020](100)은 다수의 안테나 그룹들을 포함할 수 있는 기지국(102)을 포함한다. 예를 들어, 하나의 안테나 그룹은안테나들(104 및 106)을 포함할 수 있고, 다른 그룹은 안테나들(108 및 110)을 포함할 수 있으며, 추가 그룹은안테나들(112 및 114)을 포함할 수 있다. 2개의 안테나들이 각각의 안테나 그룹에 대하여 도시되나, 각각의 그룹에 대하여 더 많거나 더 적은 안테나들이 이용될 수 있다. 기지국(102)은 본 기술분야의 당업자들에게 인지되는 바와 같이, 송신기 체인 및 수신기 체인을 더 포함할 수 있고, 그들 각각은 신호 송신 및 수신과 연관되는다수의 컴포넌트들(예를 들어, 프로세서들, 변조기들, 멀티플렉서들, 복조기들, 디멀티플렉서들, 안테나들 등)을 포함할 수 있다.기지국(102)은 모바일 디바이스(116) 및 모바일 디바이스(122)와 같은 하나 이상의 모바일 디바이스들과 통신할 [0021]수 있다; 그러나, 기지국(102)은 모바일 디바이스들(116 및 122)과 유사한 실질적으로 임의의 개수의 모바일 디바이스들과 통신할 수 있다는 것을 인지해야 한다. 모바일 디바이스(116 및 122)은 예를 들어, 셀룰러폰들, 스마트폰들, 랩탑들, 핸드헬드 통신 디바이스들, 핸드헬드 컴퓨팅 디바이스들, 위성 라디오들, 글로벌 포지셔닝시스템(global positioning system)들, PDA들, 및/또는 무선 통신 시스템(100)을 통한 통신을 위한 임의의 다른 적절한 디바이스일 수 있다. 도시된 바와 같이, 모바일 디바이스(116)는 안테나들(112 및 114)과 통신하며,안테나들(112 및 114)은 순방향 링크(118)를 통해 모바일 디바이스(116)로 정보를 송신하고, 역방향 링크(120)를 통해 모바일 디바이스(116)로부터 정보를 수신한다. 또한, 모바일 디바이스(122)는 안테나들(104 및 106)과통신하고, 안테나들(104 및 106)은 순방향 링크(124)를 통해 모바일 디바이스(122)로 정보를 송신하며, 역방향링크(126)를 통해 모바일 디바이스(122)로부터 정보를 수신한다. 주파수 분할 듀플렉서(FDD) 시스템에서, 순방향 링크(118)는 역방향 링크(120)에 의하여 사용되는 상이한 주파수 대역을 이용할 수 있고, 순방향 링크(124)는 예를 들어, 역방향 링크(126)에 의하여 이용되는 상이한 주파수 대역을 이용할 수 있다. 추가로, 시분할 듀플렉서(TDD) 시스템에서, 순방향 링크(118) 및 역방향 링크(120)는 공통 주파수 대역을 이용할 수 있으며, 순방향 링크(124) 및 역방향 링크(126)는 공통 주파수 대역을 이용할 수 있다.그들이 통신하도록 지정되는 영역 및/또는 안테나들의 각각의 그룹은 기지국(102)의 섹터로서 지칭될 수 있다. [0022]예를 들어, 안테나 그룹들은 기지국(102)에 의하여 커버되는 영역들의 섹터의 모바일 디바이스들과 통신하도록설계될 수 있다. 순방향 링크들(118 및 124)을 통한 통신에서, 기지국(102)의 송신 안테나는 모바일 디바이스들(116 및 122)에 대한 순방향 링크들(118 및 124)의 신호-대-잡음비를 향상시키기 위해 빔형성을 이용할 수 있다. 이것은 예를 들어, 원하는 방향으로 신호들을 조정하기 위하여 프리코더(precoder)를 사용함으로써 제공될수 있다. 또한, 기지국(102)이 연관된 커버리지를 통해 랜덤하게 분산된 모바일 디바이스들(116 및 122)로 송신하기 위해 빔형성을 이용하는 반면, 이웃 셀들의 모바일 디바이스들은 모든 자신의 모바일 디바이스들로 단일안테나를 통해 송신하는 기지국과 비교하여 더 적은 간섭을 겪을 수 있다. 또한, 모바일 디바이스들(116 및122)은 일 실시예에서 피어-투-피어 또는 애드 혹(ad hoc) 기술을 사용하여 서로와 직접적으로 통신할 수 있다.일 실시예에 따라, 시스템(100)은 다중-입력 다중-출력(MIMO) 통신 시스템일 수 있다. 추가로, 시스템(100)은 [0023]통신 채널들(예를 들어, 순방향 링크 채널들 또는 역방향 링크 채널들)을 분할하기 위하여 임의의 타입의 듀플렉싱 기술을 이용할 수 있다. 또한, 시스템(100)은 다중-베어러(multiple-bearer) 시스템일 수 있다. 베어러는 정의된 용량, 지연, 비트 에러 레이트 등의 정보 경로일 수 있다. 모바일 디바이스들(116 및 122)은 하나이상의 무선 베어러들을 각각 서빙(serve)할 수 있다. 모바일 디바이스들(116 및 122)은 하나 이상의 무선 베어러들에 걸쳐 업링크 리소스들을 관리 및/또는 공유하기 위하여 업링크 레이트 제어 메커니즘들을 이용할 수있다. 일 실시예에서, 모바일 디바이스들(116 및 122)은 업링크 레이트 제한들을 집행하기 위하여 또한 무선베어러들을 서빙하기 위하여 토큰 버킷(token bucket) 메커니즘들을 이용할 수 있다.예시로서, 각각의 베어러는 연관된 우선순위 비트 레이트(prioritized bit rate, PBR), 최대비트 레이트 [0024](maximum bit rate, MBR) 및 보증 비트 레이트(guaranteed bit rate, GBR)를 가질 수 있다. 모바일 디바이스들(116 및 122)은 연관된 비트 레이트 값들에 적어도 부분적으로 기초하여 무선 베어러들을 서빙할 수 있다.공개특허 10-2010-0041827-8-비트 레이트 값들은 각각의 베어러에 대한 PBR 및 MBR을 해명하는 큐(queue) 크기들을 계산하기 위하여 또한 이용될 수 있다. 큐 크기들은 기지국(102)으로 모바일 디바이스들(116 및 122)에 의하여 송신된 업링크 리소스요청들에 포함될 수 있다. 기지국(102)은 개별적인 업링크 요청들 및 포함된 큐 크기들에 기초하여 모바일 디바이스(116 및 122)에 대한 업링크 리소스들을 스케줄링할 수 있다.도 2는 MIMO 시스템(200)의 송신기 시스템(210)(또한 액세스 포인트로서 공지되는) 및 수신기 시스템(250)(또한 [0025]액세스 단말로서 공지되는)의 블록도이다. 송신기 시스템(210)에서, 다수의 데이터 스트림들에 대한 트래픽 데이터가 데이터 소스(212)로부터 송신기(TX) 데이터 프로세서(214)로 제공된다.일 실시예에서, 각각의 데이터 스트림은 개별적인 송신 안테나를 통해 송신된다. TX 데이터 프로세서(214)는 [0026]코딩된 데이터를 제공하기 위하여 상기 데이터 스트림에 대하여 선택된 특정 코딩 방식에 기초하여 각각의 데이터 스트림에 대한 트래픽 데이터를 포맷팅, 코딩 및 인터리빙한다.각각의 데이터 스트림에 대한 코딩된 데이터는 OFDM 기술들을 사용하여 파일럿 데이터와 멀티플렉싱될 수 있다. [0027]파일럿 데이터를 통상적으로 공지된 방식으로 프로세싱되는 공지된 데이터 패턴이며, 채널 응답을 추정하기 위하여 수신기 시스템에서 사용될 수 있다. 각각의 데이터 스트림에 대한 멀티플렉싱된 파일럿 및 코딩된 데이터는 그 후 변조 심볼들을 제공하기 위하여 상기 데이터 스트림에 대하여 선택된 특정 변조 방식(예를 들어,BPSK, QSPK, M-PSK, 또는 M-QAM)에 기초하여 변조(예를 들어, 심볼 맵핑)된다. 각각의 데이터 스트림에 대한데이터 레이트, 코딩 및 변조는 프로세서(230)에 의하여 수행되는 명령들에 대하여 결정될 수 있다.모든 데이터 스트림들에 대한 변조 심볼들은 그 후 TX MIMO 프로세서(220)에 제공되며, TX MIMO 프로세서(220) [0028]는 변조 심볼들(예를 들어, OFDM에 대한)을 추가로 프로세싱할 수 있다. TX MIMO 프로세서(220)는 그 후 NT개트랜시버들(TMTR)(222a 내지 222t)로 NT개 변조 심볼 스트림들을 제공한다. 특정 실시예들에서, TX MIMO 프로세서(220)는 데이터 스트림들의 심볼들로 그리고 심볼이 송신되고 있는 안테나로 빔형성 가중치(beamformingweight)들을 인가한다.각각의 트랜시버(222)는 하나 이상의 아날로그 신호들을 제공하기 위하여 개별 심볼 스트림을 수신하여 프로세 [0029]싱하고, MIMO 채널을 통한 송신에 적합한 변조된 신호를 제공하기 위하여 아날로그 신호들을 추가로 조정(예를들어, 증폭, 필터링 및 업컨버팅)한다. 트랜시버들(TMTR)(222a 내지 222t)로부터의 NT개의 변조된 신호들은 그후 각각 NT개 안테나들(224a 내지 224t)로부터 송신된다.수신기 시스템(250)에서, 송신된 변조 신호들은 NR개 안테나들(252a 내지 252r)에 의하여 수신되고, 각각의 안 [0030]테나(252)로부터 수신된 신호는 개별적인 트랜시버(RCVR)(254a 내지 254r)로 제공된다. 각각의 트랜시버(254)는 개별적인 수신된 신호를 조정(예를 들어, 필터링, 증폭, 및 다운컨버팅)하고, 샘플들을 제공하기 위하여 조정된 신호를 디지털화하며, 대응하는 \"수신된\" 심볼 스트림을 제공하기 위하여 샘플들을 추가로 프로세싱한다.RX 데이터 프로세서(260)는 그 후 NT개의 \"검출된\" 심볼 스트림들을 제공하기 위하여 특정 트랜시버 프로세싱 [0031]기술에 기초하여 NR개의 트랜시버들(254)로부터 NR개의 수신된 심볼 스트림들을 수신하여 프로세싱한다. RX 데이터 프로세서(260)는 그 후 데이터 스트림에 대한 트래픽 데이터를 복구하기 위하여 각각의 검출된 심볼 스트림을 복조, 디인터리빙, 및 디코딩한다. RX 데이터 프로세서(260)에 의한 프로세싱은 송신기 시스템(210)에서TX MIMO 프로세서(220) 및 TX 데이터 프로세서(214)에 의하여 수행된 것과 상보적이다.프로세서(270)는 어느 프리코딩 매트릭스를 이용할지 여부를 주기적으로 결정한다. 프로세서(270)는 매트릭스 [0032]인덱스 부분 및 랭크 값 부분을 포함하는 역방향 링크 메시지를 공식화(formulate)한다.역방향 링크 메시지는 수신된 데이터 스트림 및/또는 다양한 타입의 통신 링크에 관한 정보를 포함할 수 있다. [0033]역방향 링크 메시지는 그 후 데이터 소스(236)로부터 다수의 데이터 스트림들에 대한 트래픽 데이터를 또한 수신하는 TX 데이터 프로세서(238)에 의하여 프로세싱되고, 변조기(280)에 의하여 변조되고, 트랜시버들(254a 내지 254r)에 의하여 조정되며, 송신기 시스템(210)으로 다시 송신된다.송신기 시스템(210)에서, 수신기 시스템(250)으로부터 변조된 신호들이 안테나들(224)에 의하여 수신되고, 트랜 [0034]시버들(222)에 의하여 조정되고, 복조기(240)에 의하여 복조되고, 수신기 시스템(250)에 의하여 송신된 역방향링크 메시지를 추출하기 위하여 RX 데이터 프로세서(242)에 의하여 프로세싱된다. 프로세서(230)는 그 후 빔형성 가중치들을 결정하는데 어느 프리코딩 매트릭스를 사용할 것인지를 결정하기 위해 추출된 메시지를 프로세싱공개특허 10-2010-0041827-9-한다.도 3은 다수의 사용자들을 지원하도록 구성되는 예시적인 무선 통신 시스템(300)을 도시하며, 여기서 다양한 개 [0035]시된 실시예들 및 양상들이 구현될 수 있다. 도 3에 도시된 바와 같이, 실시예로서, 시스템(300)은 예를 들어,매크로(macro) 셀들(302a-302g)과 같은 다수의 셀들(302)에 대한 통신을 제공하며, 각각의 셀은 대응하는 액세스 포인트(AP)(304)(AP들(304a-304g)과 같은)에 의하여 서비스된다. 각각의 셀은 추가로 하나 이상의 섹터들로(예를 들어, 하나 이상의 주파수들을 서빙하기 위하여) 분할될 수 있다. AT들(306a-306k)을 포함하며, 또한 사용자 장비(UE)로서 상호교환가능하게 공지되는 다양한 액세스 단말(AT)들(306)은 시스템 전체에 분산된다. 각각의 AT(306)는 예를 들어, AT가 액티브한지 또는 AT가 소프트 핸드오프(soft handoff) 상태에 있는지 여부에따라, 주어진 순간에 순방향 링크(FL) 및/또는 역방향 링크(RL)상에서 하나 이상의 AP들(304)과 통신할 수있다. 무선 통신 시스템(300)은 큰 지리적 영역을 통해 서비스를 제공할 수 있는데, 예를 들어, 매크로 셀들(302a-302g)은 이웃의 몇몇 블록들을 커버할 수 있다.셀들(302)은 GSM/GPRS/에지 네트워크(이하에서는 \"2G 네트워크\"로서 지칭됨), 및/또는 UMTS 네트워크(이하에서 [0036]는 \"WCDMA 커버리지\", \"3G 네트워크\", 또는 간단히 \"3G\"로서 지칭됨)와 같은 다수의 네트워크들을 통해 커버리지를 제공할 수 있다. 시스템(300)은 셀들의 제1 네트워크를 가질 수 있고, 여기서 제1 네트워크는 가장 용이하게 이용가능한 네트워크이며, 또는 시스템(300)은 가장 큰 커버리지 영역을 갖는 \"대비책(fall back)\" 기술로고려될 수 있다. 또한, 시스템(300)은 셀들(302)의 서브세트에서 이용가능하고, 제1 네트워크로서 용이하게 이용가능하지 않은 제2 네트워크를 가질 수 있다. 예를 들어, 제2 네트워크는 각각의 셀(302)에서 이용가능하지않을 수 있고/있거나 제2 네트워크가 이용가능한 셀들(302)의 전체 영역을 커버하지 않을 수 있다. 제2 네트워크를 떠나는 사용자들에게는 제1 네트워크에 의하여 커버리지가 제공된다. 예를 들어, 시스템(300)은 2G 네트워크 및 3G 네트워크를 포함할 수 있고, 여기서 2G 네트워크는 전체 시스템(300)을 커버하며, 3G 네트워크는 시스템(300) 전체 중 일부 위치들에서 이용가능하다.시스템간 핸드오버(handover) 시나리오 동안에, AT들(306)은 제1 네트워크로부터 제2 네트워크로 핸드오버하거 [0037]나, 또는 제2 네트워크로부터 제1 네트워크로 핸드오버한다. 시스템간 핸드오버 시나리오는 AT들(306)이 제1네트워크에 연결될 때 시작된다; AT들은 AT(306)가 현재 위치되는 셀(302)에 대한 시스템 정보를 판독하며, AT들(306)이 제2 네트워크 탐색을 시작해야하는지 여부를 결정한다. 셀(302)이 제2 네트워크(예를 들어, WCDMANCELL 리스트)에 대한 이웃 셀들 리스트(이하에서는 \"NCELL 리스트\"로서 지칭됨)를 포함한다면, AT들(306)은 제2 네트워크가 성공적으로 식별될 때까지 미리 결정된 레이트로(예를 들어, 매 30초마다) 제2 네트워크를 탐색한다. 예를 들어, AT들(306)이 제1 2G 네트워크에 연결되고, 제2 네트워크는 3G 네트워크라면, AT들(306)은WCDMA NCELL 리스트에 명시된 모든 1차 동기화 코드들(PSC)이 식별될 때까지 매 30초마다 3G 네트워크를 탐색할것이다. 결과적으로, 계속적인 탐색이 AT(306c)에 대한 휴면(sleep) 사이클을 감소시키기 때문에, AT(306c)는제2 네트워크의 커버리지 영역의 외부에 있다면 불필요한 배터리 전력을 소모할 것이다.본 발명의 일 양상에 따라, AT들(306)은 시스템간 핸드오버 시나리오 동안에 제2 네트워크를 탐색하는 레이트 [0038](이하에서는 \"탐색 레이트\"로서 지칭됨)를 제어할 수 있다. 예를 들어, AT들(306)은 하나 이상의 백-오프(back-off) 방식들을 도입함으로써 탐색 레이트를 제어할 수 있다. 백-오프 방식들은 지수적 백-오프 방식들,비-지수적 백-오프 방식들, 선형적 백-오프 방식들, 비-선형적 백-오프 방식들 등을 포함할 수 있으나, 이에 제한되지는 않는다. 탐색 레이트의 제어는 연속적 탐색 실패들, AT들(306)의 운동, 및/또는 신호 강도(아래에 논의되는)와 같은 다수의 기준들 중 임의의 것에 기초하여 도입될 수 있다. 예를 들어, AT(306d)는 시스템간 핸드오버 시나리오를 시작할 수 있고, 여기서 AT(306d)는 X 초당 한번의 레이트로 제2 네트워크를 탐색한다. 제2네트워크에 대한 미리 결정된 개수의 연속적 탐색들이 실패하고, AT(306d)가 이동하지 않는다면, AT(306d)는 지수적 백-오프 방식을 도입할 수 있다. 지수적 백-오프 방식은 AT(306d)가 다음 Z개 시도들에 대해 XY초마다 제2 네트워크를 탐색하도록, 탐색 레이트를 조정할 수 있으며, Y는 미리 결정된 지수적 백-오프 인자이고, Z는 미리 결정된 탐색 간격이다. 다시 말해, AT(306d)는 다음 시도들의 세트에 대한 지수적으로 더 느린 증분으로 탐색할 것이다.이제 도 4를 참조하여, 액세스 단말상의 탐색 레이트 제어를 구현하기 위한 예시적인 장치가 도시된다. 도면 [0039](400)은 연결 컴포넌트(404), 탐색 컴포넌트(406), 및 전력원(408)을 갖는 액세스 단말(402)을 포함한다. 이전에 논의된 바와 같이, 액세스 단말(402)은 무선 통신 프레임웍(framework)(410)(예를 들어, 다수의 액세스 무선통신 시스템)을 통한 통신을 제공한다. 무선 통신 프레임웍(410)은 제1 네트워크(414) 및 제2 네트워크(416)를갖는 무선 액세스 포인트(412)를 포함한다. 액세스 단말(402)은 액세스 포인트(410)상에서 전달된 네트워크들공개특허 10-2010-0041827-10-(414 또는 416)에 연결함으로써 통신 프레임웍(410)과 통신할 수 있다. 설명의 간략화를 위해, 통신 프레임웍(410)은 단일 액세스 포인트(410)를 갖는 것으로 도시되며, 액세스 포인트(410)는 단 2개의 네트워크들(414 및416)만을 갖는 것으로 도시된다. 그러나, 통신 프레임웍(410)은 다수의 액세스 포인트들을 포함할 수 있고, 액세스 포인트(410)는 다수의 네트워크들을 포함할 수 있다는 것을 인지할 수 있을 것이다.연결 컴포넌트(404)는 통신 프레임웍(410)과의 통신을 용이하게 한다. 연결 컴포넌트(404)는 통신 프레임웍에 [0040]관한 액세스 단말(402)의 이동성 및/또는 연결과 관련되는 하나 이상의 기준을 결정하는 기준 컴포넌트(418)를포함한다. 예를 들어, 기준 컴포넌트(418)는 액세스 단말(402)의 운동, 액세스 단말(402)이 현재 연결된 네트워크의 신호 강도 등을 결정할 수 있다. 구현에 따라, 액세스 단말(402)의 운동은 신호 강도의 변동(variance)을 추적함으로써 결정될 수 있다. 현저한 변화는 미리 결정된 임계치를 초과하는 변화이고, 통상적으로 이러한 임계치는 시스템 설계자, 관리자 등에 의하여 결정될 수 있다. 부가적으로 또는 대안적으로, 기준 컴포넌트(418)는 다수의 기준들에 기초하여 이동하는 액세스 단말을 결정할 수 있으며, 상기 다수의 기준들은 미리 결정된 시간 기간에 걸쳐 액세스 단말(402)에 의하여 이루어진 재선택들의 개수, 미리 결정된 시간 기간에 걸쳐 액세스 단말(402)에 의하여 검출된 새로운 이웃들의 개수, 서빙 셀의 미리 결정된 임계치를 초과하는 수신기 자동이득 제어(Rx AGC)의 변화들, 및/또는 미리 결정된 임계치를 초과하는 이웃 셀들의 Rx AGC의 변화들을포함하나, 이에 제한되는 것은 아니다. 예를 들어, 시스템 설계자는 액세스 단말(402)이 2 이상의 재선택들을유발하거나, 또는 시간 X의 기간에 걸쳐 2 이상의 새로운 이웃들을 검출한다면, 액세스 단말이 이동하고 있음을결정할 수 있다. 유사하게, 시스템 설계자는 임계치 Z를 초과하는 이웃 셀들의 Rx AGC 또는 Rx AGC의 변화가액세스 단말이 이동하고 있음을 나타내는 것을 결정할 수 있다.액세스 단말(402)이 셀(예를 들어, 2G 네트워크)의 제1 네트워크(414)에 임시로 위치할 때, 탐색 컴포넌트(40 [0041]6)는 액세스 단말(402)이 제2 네트워크(예를 들어, 3G 네트워크)의 탐색을 시작할 필요가 있는지 여부를 결정하기 위하여 시스템 정보를 판독한다. 시스템간 핸드오버 시나리오는 탐색 컴포넌트(406)가 액세스 단말(402)이제2 네트워크(416)의 탐색을 시작해야 하는 것으로 결정할 때 개시된다. 탐색 컴포넌트(406)는 탐색 컴포넌트(406)가 제2 네트워크(416)를 탐색하는 레이트를 결정하는 탐색 레이트 컴포넌트(420)를 포함한다. 예를 들어,셀이 제2 네트워크에 대한 NCELL 리스트를 포함한다면, 탐색 컴포넌트(404)는 탐색 레이트 컴포넌트(420)에 정의된 레이트로(예를 들어, X 또는 매 30초마다) 제2 네트워크(416)를 탐색한다. 또한, 탐색 컴포넌트(406)는기준 컴포넌트(418)에 의하여 결정된 하나 이상의 기준에 적어도 부분적으로 기초하여 탐색 레이트 컴포넌트(420)에서 정의된 레이트를 조정할 수 있는 제어 컴포넌트(422)를 포함한다. 이전에 논의된 바와 같이, 각각의셀은 하나 이상의 섹터들로 분할될 수 있고, 하나 이상의 주파수들상에서 네트워크들을 송신할 수 있다. 결과적으로, NCELL 리스트는 다수의 주파수들을 포함할 수 있고, 액세스 단말(402)은 리스트에 포함된 각각의 주파수에 대한 탐색 레이트 제어를 구현할 수 있다는 것을 이해할 수 있을 것이다.탐색 레이트 제어의 도입을 결정하기 위한 기준은 탐색 레이트 제어가 구현될 시스템의 고유한 능력들 뿐 아니 [0042]라 시스템 관리자의 선호도에 크게 기초한다. 예를 들어, 몇몇 시스템들에서, 신호 강도와 같은 특정 기준은다른 기준보다 신뢰성 있거나 귀중한 것일 수 있다. 또한, 시스템 관리자들은 상이한 기준의 사용을 요구하는다양한 결과들의 달성을 요구할 수 있다. 다수의 무선 시스템 변경들에 따라, 액세스 단말(402)에 대한 탐색레이트 제어의 구현은 다양한 목적들의 균형을 맞추는 것을 요구할 수 있다. 예를 들어, 제1 및 제2 네트워크를 포함하는 시스템에서, 백-오프 방식은 전력원(408)을 보존하기 위하여 시스템간 핸드오버 시나리오 동안에구현될 수 있고, 이는 가능한 한 자주 가장 바람직한 네트워크상의 액세스 단말(404)을 작동시키기 위한 요구(예를 들어, 가장 효율적인, 가장 빠른, 최상 커버리지, 등)와 균형이 맞춰진다.제어 컴포넌트(422)는 탐색 레이트 컴포넌트(420)에 정의된 레이트를 조정하는데 제어 컴포넌트(422)에 의한 사 [0043]용을 위해 하나 이상의 백-오프 방식들을 제공하는 백-오프 컴포넌트(424)를 포함한다. 백-오프 컴포넌트(424)는 기준 컴포넌트(416)에 의하여 결정된 하나 이상의 기준 및/또는 카운터 컴포넌트(426)에서 유지되는 연속적인 개수의 실패한 탐색들에 기초하여 백-오프 방식들을 구현할 수 있다. 예를 들어, 백-오프 컴포넌트(424)는 카운터 컴포넌트(426)가 미리 결정된 개수의 실패한 연속적 탐색들(예를 들어, 5)을 초과할 때, 백-오프 방식을 구현할 수 있으며, 기준 컴포넌트(418)는 액세스 단말(402)이 이동하지 않음을 결정한다. 기준들이 액세스 단말(402)이 제2 네트워크(416)의 에지상에 있음을 표시하기 때문에, 전술한 실시예에서 사용되는 기준은 선택될 수 있다. 또한, 전력원(408)으로부터 액세스 단말(402)에 의하여 소모되는 전력은 탐색 컴포넌트(406)에의하여 실행되는 탐색들의 주파수 및/또는 개수에 비례한다. 결과적으로, 탐색 컴포넌트(406)에 의하여 실행되는 탐색들의 주파수 및/또는 탐색들의 전체 개수를 감소시키는 것은 전력원(408)으로부터 소모된 전력을 감소시킨다.공개특허 10-2010-0041827-11-위에 개시된 예시적인 시스템들의 관점에서, 개시된 내용에 따라 구현될 수 있는 방법들은 도 5의 흐름도를 참 [0044]조로 하여 더 잘 인지될 것이다. 설명의 간략화를 목적으로, 방법들은 일련의 블록도들로서 도시되고설명되나, 몇몇 블록들은 본 명세서에 개시되고 설명된 것과 상이한 순서들로 및/또는 동시에 발생할 수 있기때문에, 청구된 내용은 블록들의 순서로 제한되지 않음을 이해하고 인지할 수 있을 것이다. 또한, 이하에 개시된 방법들을 구현하기 위하여 필요한 모든 블록들이 도시된 필요는 없을 것이다.도 5는 탐색 레이트 제어를 통해 액세스 단말 배터리 수명 증가를 용이하게 하는 일반화된 방법(500)을 도시한 [0045]다. 502에서 액세스 단말은 셀의 제1 네트워크와 통신한다. 504에서, 액세스 단말이 이미 시스템간 핸드오버시나리오(이전에 논의된 바와 같은)를 시작한 것으로 가정하면; 액세스 단말은 X초마다 제2 네트워크(예를들어, 3G)를 탐색하고, 여기서, X는 탐색 레이트이다.506에서, 액세스 단말은 탐색 레이트 제어(SRC)에 대한 하나 이상의 기준이 충족되는지 여부를 결정한다. 예를 [0046]들어, 액세스 단말 이동성은 기준들 중 하나일 수 있으며, 액세스 단말이 이동하지 않는다면(예를 들어,이동성), 탐색 레이트 제어를 위한 기준이 충족된다. 이전에 논의된 바에 따라, 액세스 단말은 다수의 기준들에 기초하여 자신의 이동성을 결정할 수 있고, 다수의 기준들은 신호 강도가 현저히 변화하는지 여부, 미리 결정된 시간 기간에 걸친 재선택들의 개수, 미리 결정된 시간 기간에 걸쳐 검출된 새로운 이웃들의 개수, 특정 임계치를 초과하는 Rx AGC의 변화, 특정 임계치를 초과하는 이웃 셀들의 Rx AGC의 변화 등을 포함하나, 이에 제한되지는 않는다.508에서, 기준이 충족된다면(예를 들어, 액세스 단말이 이전 탐색 간격 동안에 이동하지 않았음)(504에서 YES), [0047]그 후 탐색 카운터는 증분된다(예를 들어, 1만큼). 510에서, 탐색 카운터는 미리 결정된 임계치 값과비교된다. 탐색 카운터가 미리 결정된 임계치 값을 초과하지 않는다면(510에서 NO), 그 후 액세스 포인트는 X초에서 다시 탐색할 것이다. 탐색 카운터 Y가 미리 결정된 임계치 값을 초과한다면(510에서 YES), 그 후 액세스 단말은 512에서 탐색 레이트 제어를 수행하거나 구현한다. 탐색 레이트 제어는 백-오프 방식 이용에 의한탐색 레이트의 조정을 포함할 수 있다. 일 실시예에서, 방식들 사이의 시간은 길어질 수 있다. 이러한경우에, 미리 결정된 시간 기간 동안에 수행된 탐색들의 개수에 의하여 정의되는 바와 같이, 레이트는감소된다. 각각의 탐색이 액세스 단말의 배터리 수명을 소모하기 때문에, 탐색들의 개수가 감소함에 따라, 배터리 수명은 절약된다. 예를 들어, 액세스 단말은 선형적 백-오프 방식을 구현할 수 있고, 액세스 단말은 다음Z개 시도들에 대하여 X*Y마다 제2 네트워크를 탐색할 것이다. 부가적으로 또는 대안적으로, NCELL 리스트는 다수의 주파수들을 포함할 수 있고, 액세스 단말은 리스트에 포함된 각각의 주파수에 대하여 탐색 레이트 제어(예를 들어, 백-오프 방식)를 구현할 수 있다.부가적으로 또는 대안적으로, 도 5에 도시된 탐색 레이트 제어의 방법은 가상으로 임의의 시스템간 핸드오버 시 [0048]나리오에 적용될 수 있고, 본 명세서에 논의된 예시적인 무선 통신 시스템들로 제한되지 않음을 인식할 수 있을것이다. 예를 들어, 탐색 레이트 제어의 전술한 방법은 무선 로컬 영역 네트워크(WLAN)에서 작동하는 액세스단말들에 적용될 수 있고, 여기서 WLAN은 이용가능한 둘 이상의 네트워크들을 갖는다.도 6은 본 발명의 방법들 및 장치들에 따른 하나 이상의 특징들의 자동화를 용이하게 하는 인공 지능(AI) 컴포 [0049]넌트(602)를 이용하는 방식(600)을 도시한다. 탐색 제어 레이트 방법들 및 장치들(예를 들어, 추론과 관련된)은 그것의 다양한 양상들을 실행하기 위한 다양한 AI-기반 방식들을 구현할 수 있다. 예를 들어, 백-오프 방식의 트리거(trigger) 구현을 위해 사용될 수 있는 기준을 결정하기 위한 프로세스가 자동 분류기 시스템 및 프로세스를 통해 용이해질 수 있다.분류기는 입력이 클래스(class)에 속한다는 컨피던스(confidence)로 입력 속성 벡터(attribute vector)(x = [0050](xl, x2, x3, x4, xn))를 맵핑하는 함수인데, 즉, f(x) = confidence(class)이다. 그러한 분류는 사용자가 자동적으로 수행되길 원하는 작동을 예측하거나 추론하기 위하여 확률 및/또는 통계-기반 분석(예를 들어, 분석유틸리티들 및 비용들로 팩토링(factoring))을 이용할 수 있다. 예를 들어, 구현에 따라, 컨피던스는 기준들의세트에 할당될 수 있고, 탐색 레이트 제어를 구현하기 위한 트리거들로서 사용되어야 하는 기준들에 대한 추론이 이루어질 수 있다.지지 벡터 머신(SVM)은 이용될 수 있는 분류기의 일 실시예이다. SVM은 가능한 입력들의 공간에서 초곡면 [0051](hypersurface)을 발견함으로써 작동하고, 초곡면은 비-트리거링 이벤트들로부터 트리거링 기준들을 분류하도록시도한다. 직관적으로, 이것은 근처에 있으나 트레이닝 데이터와 동일하지 않은 데이터를 테스팅하기 위한 분류를 정확하게 한다. 다른 지시된 그리고 지시되지 않은 모델 분류 방식들은 예를 들어, 나이브 베이스공개특허 10-2010-0041827-12-( ), 베이시안(Bayesian) 네트워크들, 결정 트리(decision tree)들, 중성 네트워크들, 퍼지 로직모델(fuzzy logic model)들을 포함하며, 독립(independence)의 상이한 패턴들을 제공하는 확률적 분류 모델들이이용될 수 있다. 본 명세서에서 사용되는 분류는 또한 우선순위 모델들을 전개시키는데 이용되는 통계적 회귀(statistical regression)를 포함한다.본 명세서로부터 용이하게 이해될 수 있는 바와 같이, 본 발명은 (예를 들어, 사용자 행동 관찰, 외적인 정보 [0052]수신을 통해) 명시적으로 트레이닝될 뿐 아니라, (예를 들어, 포괄적 트레이닝 데이터를 통해) 암시적으로 트레이닝되는 분류기들을 이용할 수 있다. 예를 들어, SVM들은 분류기 구성기 및 특징 선택 모듈 내에 학습 또는트레이닝 위상을 통해 구성된다. 따라서, 분류기(들)는 다수의 기능들을 자동적으로 학습하고 수행하는데 사용될 수 있으며, 다수의 기능들은 미리 결정된 기준에 따라 이전에 추론된 개요를 언제 갱신하거나 개선할지, 프로세싱되고 있는 데이터의 종류(예를 들어, 1차 대 2차, 정적 대 동적, ..)에 기초한 추론 알고리즘에 대한 기준을 언제 더 엄격하게 할지, 그리고 하루 중 어떤 시간에 더 엄격한 기준 제어들을 구현할지(예를 들어, 저녁에 시스템 성능이 덜 영향을 받을 때) 등을 결정하는 것을 포함하나, 이에 제한되는 것은 아니다.이제 도 7을 참조하여, 휴대용 핸드-헬드 단말 디바이스(700)의 개략적인 블록도가 도시되며, 여기서 프로세서 [0053](702)는 디바이스(700)의 일반적인 동작을 제어하기 위한 것이다. 프로세서(702)는 본 명세서에 개시된 다양한기능들을 수행하기 위하여 디바이스(700) 내에 다양한 컴포넌트들을 제어하고 작동시키도록 프로그래밍된다.프로세서(702)는 다수의 적절한 프로세서들 중 임의의 것일 수 있다. 프로세서(702)가 본 발명과 관련된 기능들을 수행하도록 프로그래밍될 수 있는 방식은 본 명세서에 제공된 설명에 기초하여 본 기술분야의 당업자들에게 명백할 것이다.프로세서(702)에 연결되는 메모리(704)는 프로세서(702)에 의하여 실행되는 프로그램 코드를 저장하도록 기능하 [0054]고, 사용자 자격(credential) 및 수신 트랜잭션 정보 등과 같은 정보를 저장하기 위한 저장 수단으로서 기능한다. 메모리(704)는 적어도 디스플레이되는 정보의 완전한 세트를 저장하도록 적절히 구성되는 비휘발성 메모리일 수 있다. 따라서, 메모리(704)는 텍스트, 이미지들, 오디오, 및 비디오 컨텐츠를 포함하는 기가바이트의 데이터를 저장할 수 있는 예컨대 마이크로 드라이브와 같은 대용량 저장 메모리 및/또는 프로세서(702)에 의한 고속 액세스를 위한 RAM 또는 플래시 메모리를 포함할 수 있다. 일 양상에 따라, 메모리(704)는 정보의 다수의세트들을 저장할 수 있는 충분한 저장 용량을 갖고, 프로세서(702)는 디스플레이 정보의 다양한 세트들 사이에서 교대하거나 순환하기 위한 프로그램을 포함할 수 있다.디스플레이(706)는 디스플레이 드라이버 시스템(708)을 통해 프로세서(702)에 연결된다. 디스플레이(706)는 컬 [0055]러 액정 디스플레이(LCD), 플라즈마 디스플레이, 또는 이와 유사한 종류의 다른 것들일 수 있다. 본 실시예에서, 디스플레이(706)는 그레이 스케일(gray scale)의 16 레벨들을 갖는 1/4 VGA 디스플레이이다. 디스플레이(706)는 데이터, 그래픽들, 또는 다른 정보 컨텐츠를 나타내도록 기능한다. 예를 들어, 디스플레이(706)는 고객 정보의 세트를 디스플레이할 수 있고, 이는 작동자에게 디스플레이되며, 시스템 백본(backbone)(미도시)을통해 송신될 수 있다. 대안적으로, 디스플레이(706)는 디바이스(700)의 실행을 제어하는 다양한 기능들을 디스플레이할 수 있다. 디스플레이(706)는 알파벳 및 그래픽 문자들 모두를 디스플레이할 수 있다.프로세서(702) 및 온보드(onboard) 전력 시스템(710)(예를 들어, 배터리 팩)에 의하여 핸드-헬드 디바이스(70 [0056]0)를 형성하는 다른 컴포넌트들에 전력이 제공된다. 전력 시스템(710)이 고장나거나 디바이스(700)로부터 분리되는 경우에, 보조 전력원(712)이 프로세서(702)에 전력을 공급하고 온보드 전력 시스템(710)을 충전하기 위하여 이용될 수 있다. 디바이스(700)의 프로세서(702)는 예측된 정전의 검출시 유도된 전류를 감소시키기 위하여휴면 모드를 유도한다.단말(700)은 원격 컴퓨터와 프로세스(702)를 인터페이싱시키는데 이용되는 데이터 통신 포트(716)를 포함하는 [0057]통신 서브시스템(714)을 포함한다. 포트(716)는 유니버설 시리얼 버스(USB) 및 IEEE 1394 직렬 통신 능력들 중적어도 하나를 포함할 수 있다. 예를 들어, 적외선 데이터 포트를 이용하는 적외선 통신과 같은 다른 기술들이또한 포함될 수 있다.디바이스(700)는 프로세서(702)와의 가동 통신에 무선 주파수(RF) 트랜시버 섹션(718)을 더 포함할 수 있다. [0058]RF 섹션(718)은 RF 수신기(720)를 포함하며, RF 수신기는 안테나(722)를 통해 원격 디바이스로부터 RF 신호들을수신하고 내부에 변조된 디지털 정보를 획득하기 위하여 신호를 변조한다. RF 섹션(718)은 또한 예를 들어, 사용자 입력 디바이스(726)(예를 들어, 키패드)를 통한 수동 사용자 입력에 응답하여, 또는 트랜잭션의 완료나 다른 미리 결정되고 프로그래밍된 기준에 자동으로 응답하여, 원격 디바이스로 정보를 송신하기 위한 RF 송신기공개특허 10-2010-0041827-13-(724)를 더 포함한다. 트랜시버 섹션(718)은 물건 또는 아이템 RF 태그(tag)들과 함께 사용하는, 예컨대 수동적 또는 능동적 트랜스폰더(transponder) 시스템과의 통신을 용이하게 한다. 프로세서(702)는 트랜시버(718)를통해 원격 트랜스폰더 시스템에 시그널링(또는 펄싱(pulse))하고, 태그 메모리의 컨텐츠를 판독하기 위하여 리턴 신호를 검출한다. 일 구현에서, RF 섹션(718)은 디바이스(700)를 사용한 전화 통신을 추가로 용이하게한다. 그것의 진척에서, (스피커 또는 유사한 오디오 출력 디바이스로부터의) 오디오 출력 신호들 및 마이크로폰(또는 유사한 오디오 입력 디바이스)로부터의 오디오 입력을 프로세싱하기 위하여 프로세서(702)에 의하여 제어되는 오디오 I/O 섹션(728)이 제공된다.다른 구현에서, 디바이스(700)가 간단히 음성 레코더로서 사용될 때, 프로세서(702)가 컴퓨터 워드 프로세서와 [0059]같은 로컬 편집 및 리뷰, 및/또는 원격 시스템으로의 추후의 다운로드를 위한 텍스트 컨텐츠로의 음성 신호들의고속 변환을 용이하게 할 수 있도록, 디바이스(700)는 음성 인식 능력들을 제공할 수 있다. 유사하게, 변환된음성 신호들은 키패드(726)를 통한 수동 입력의 사용 대신에 디바이스(700)를 제어하는데 사용될 수 있다.프린터(730), 서명 패드(732), 및 자기 스트립 판독기(734)와 같은 온보드 주변 장치들이 또한 디바이스(700)의 [0060]하우징 내에 제공되거나, 하나 이상의 외부 포트 인터페이스들(716)을 통해 외부적으로 수용될 수 있다.디바이스(700)는 사용자가 디스플레이(706)에 의한 프리젠테이션 및 디바이스(700)에 의한 저장을 위한 이미지 [0061]들 및/또는 짧은 영화들을 레코딩할 수 있도록, 이미지 캡쳐 시스템(736)을 더 포함할 수 있다. 부가적으로,스캐닝 데이터형태들에 대한 데이터형태 판독 시스템(738)이 포함된다. 이러한 이미지화 시스템들(736 및 738)은 두 개 기능들 모두를 수행할 수 있는 단일 시스템일 수 있다는 것이 인지될 수 있을 것이다.도면도면1공개특허 10-2010-0041827-14-도면2도면3공개특허 10-2010-0041827-15-도면4공개특허 10-2010-0041827-16-도면5공개특허 10-2010-0041827-17-도면6공개특허 10-2010-0041827-18-도면7공개특허 10-2010-0041827-19-"}
{"patent_id": "10-2010-7003027", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "개시된 방법 및 장치는 탐색 레이트 제어를 통해 액세스 단말 배터리 수명을 향상시키기 위한 기술들 및 메커니 즘들에 대한 것이다. 액세스 단말들이 셀의 대안적 네트워크들을 탐색하는 레이트의 제어, 특히 불필요한 시도 들의 감소는 액세스 단말의 배터리 수명을 상당히 증가시킨다."}
{"patent_id": "10-2010-7003027", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 2007년 7월 10일자로 출원되고 본 발명의 양수인에게 양도된 \"The method and apparatus for reducing the number of attempts made by UE to decode WCDMA NCELL\"라는 제목의 가출원 번호 제60/948,935호에 대한 우선권을 주장하며, 그 모든 내용은 본 명세서에 참조로서 통합된다. 본 발명의 양상들은 무선 통신 디바이스들과 관련되며, 특히, 탐색 제어를 통한 액세스 단말 배터리 구명을 향 상시키기 위한 장치 및 방법들과 관련된다."}
{"patent_id": "10-2010-7003027", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "UMTS 커버리지(이하에서는 \"WCDMA 커버리지\", \"3G 커버리지\", 또는 간단히 \"3G\"로서 지칭됨)는 유비쿼터스가 아 니며, 때때로 WCDMA 커버리지를 벗어나는 사용자들에게 커버리지를 제공하는 \"대비책(fall back)\" 기술로서 GSM/GPRS/에지(Edge) 커버리지(이하에서는 \"2G 커버리지\" 또는 간단히 \"2G\"로서 지칭됨)를 갖는 커버리지의 아 일랜드(island)들로서 유지될 것이다. 일단 모바일, 액세스 단말 또는 다른 유사한 용어로서 또한 지칭될 수 있는 사용자 장비(UE)가 2G 셀들에 임시 로 위치하는(camp) 경우에, UE는 WCDMA 셀들의 탐색을 시작할 필요가 있는지 또는 아닌지 여부를 결정하기 위하 여 UE는 2G 셀들에 대한 시스템 정보를 판독한다. 2G 셀들이 WCDMA NCELL 리스트를 포함한다면, 그 후 UE는 NCELL 리스트에 명시된 1차 동기화 코드들(PCS: primary synchronization codes) 전부가 식별될 때까지 매 30초마다 WCDMA를 검색하도록 요구된다. UE가 정의된 WCDMA NCELL 리스트를 갖지만 WCDMA가 GSM 셀의 전체 영역을 커버하지 않는 셀에 임시로 위치한다 면, 그러한 영역의 UE는 매 30초마다 WCDMA 셀들을 탐색할 것이고, 이에 의하여 자신의 배터리 수명을 현저히 감소시킬 것이다. 따라서, GSM/GPRS(2G)에 임시로 위치하면서, WCDMA 커버리지(3G 커버리지)의 에지상에 UE들 에 대한 UE 배터리 수명의 향상들을 초래할 수 있는 메커니즘들 및 기술들을 갖는 것이 바람직할 것이다."}
{"patent_id": "10-2010-7003027", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "다음은 그러한 실시예들의 기본적인 이해를 제공하기 위하여 하나 이상의 실시예들의 간략화된 요약을"}
{"patent_id": "10-2010-7003027", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 3, "content": "나타낸다. 이러한 요약은 고려되는 모든 실시예들의 광범위한 개요가 아니며, 임의의 또는 모든 실시예들의 범 위를 제한하거나 모든 실시예들의 주요 또는 결정적 엘리먼트들을 확인하도록 의도되지 않는다. 이것의 목적은 단지 추후에 개시될 더 상세한 설명에 대한 서문으로서 간략화된 형태로 하나 이상의 실시예들의 몇몇 개념들을 나타내는 것이다. 본 명세서는 탐색 레이트 제어를 통한 네트워크 커버리지의 에지에 임시로 위치하는 액세스 단말 배터리 수명에 대한 향상들을 제공한다. 몇몇 양상들에서, 제1 네트워크와 통신하고, 탐색 레이트로 제2 네트워크를 탐색하고, 적어도 하나의 기준에 적어도 부분적으로 기초하여 탐색 레이트를 제어하기 위한 방법이 개시된다. 다른 양상들에서 액세스 단말들의 배터리 수명 향상을 용이하게 하는 장치가 개시된다. 장치는 탐색 레이트 및 상기 적어도 하나의 주파수에서 상기 적어도 하나의 주파수상에서 송신된 셀의 네트워크의 탐색 및 적어도 하나 의 기준에 적어도 부분적으로 기초한 상기 탐색 레이트의 제어와 관련된 명령들을 포함하는 메모리, 및 메모리 에 포함된 명령들을 실행하도록 구성되는, 상기 메모리에 연결되는 프로세서를 포함할 수 있다. 하나 이상의 다른 양상들에서, 탐색 레이트 제어를 통한 액세스 단말들의 배터리 수명 향상을 용이하게 하는 장 치가 개시된다. 장치는 탐색 레이트로 셀의 네트워크를 탐색하기 위한 수단, 및 적어도 하나의 기준에 적어도 부분적으로 기초하여 탐색 레이트를 제어하기 위한 수단을 포함한다. 또 다른 양상들에 따라, 탐색 레이트 제어를 통해 액세스 단말들의 배터리 수명 향상을 용이하게 하도록 구성되 는 컴퓨터 실행가능 명령들을 포함하는 컴퓨터-판독가능 매체가 제공된다. 컴퓨터 실행가능 명령들은 제1 네트 워크와 통신하기 위한 코드, 탐색 레이트로 제2 네트워크를 탐색하기 위한 코드, 및 적어도 하나의 기준에 적어 도 부분적으로 기초하여 상기 탐색 레이트를 제어하기 위한 코드를 포함한다. 다른 양상들에서, 탐색 레이트 제어를 통해 배터리 수명 향상을 용이하게 하는 장치가 개시된다. 장치는 적어 도 제1 네트워크와의 통신을 용이하게 하는 접속 컴포넌트 ― 상기 접속 컴포넌트는 상기 제1 네트워크와의 접 속의 적어도 하나의 기준을 결정하는 기준 컴포넌트를 포함함 ― , 및 적어도 하나의 제2 네트워크를 탐색하는 탐색 컴포넌트를 포함하며, 상기 탐색 컴포넌트는 상기 탐색 컴포넌트가 상기 제2 네트워크를 탐색하는 레이트 를 정의하는 탐색 레이트 컴포넌트를 포함하고, 상기 탐색 컴포넌트는 상기 탐색 레이트 컴포넌트에서 정의된 상기 탐색 레이트를 조정하는 제어 컴포넌트를 더 포함한다. 전술한 내용 및 관련된 목적들의 달성을 위해, 하나 이상의 실시예들은 이하에서 완전히 개시되고 특히 청구항 들에서 지적된 특징들을 포함한다. 하기의 설명 및 첨부된 도면들은 하나 이상의 실시예들의 특정 예시적인 양 상들을 상세히 설명한다. 그러나, 이러한 양상들은 다양한 실시예들의 원리들이 이용될 수 있는 다양한 방식들 중 몇몇 만을 나타내며, 개시된 실시예들은 모든 그러한 양상들 및 그들의 동등물들을 포함하도록 의도된다."}
{"patent_id": "10-2010-7003027", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이제, 도면들을 참고로 하여 본 발명이 설명되며, 동일한 참조 번호들은 명세서 전반을 통해 동일한 엘리먼트들 을 지칭하는데 사용된다. 하기의 설명에서, 설명을 목적으로 다수의 특정 세부 사항들이 청구된 본 발명의 전 반적 이해를 제공하기 위하여 진술된다. 그러나, 청구된 내용은 이러한 특정 세부 사항들 없이도 실행될 수 있 음이 명백할 수 있다. 다른 실시예들에서, 공지된 구조들 및 디바이스들은 청구된 내용의 설명의 용이하게 하 기 위하여 블록도로 도시된다. 본 출원에서 사용될 때, \"컴포넌트\", \"모듈\", \"시스템\" 등의 용어는 컴퓨터 관련 엔티티, 하드웨어, 펌웨어, 하 드웨어와 소프트웨어의 조합, 소프트웨어 또는 실행중인 소프트웨어를 언급하기 위한 것이다. 예를 들어, 이에 한정되는 것은 아니지만 컴포넌트는 프로세서상에서 실행하는 프로세스, 프로세서, 객체, 실행 파일, 실행 스레 드, 프로그램 및/또는 컴퓨터일 수도 있다. 실례로서, 컴퓨팅 디바이스상에서 구동되는 애플리케이션 및 컴퓨 팅 디바이스 모두가 컴포넌트일 수 있다. 하나 이상의 컴포넌트가 프로세스 및/또는 실행 스레드 내에 상주할 수 있으며, 컴포넌트는 하나의 컴퓨터에 집중될 수도 있고/있거나 2개 이상의 컴퓨터들 사이에 분산될 수도 있 다. 또한, 이들 컴포넌트들은 다양한 데이터 구조를 저장한 다양한 컴퓨터 판독 가능 매체로부터 실행될 수 있 다. 컴포넌트들은 하나 이상의 데이터 패킷들(예를 들어, 로컬 시스템, 분산 시스템의 및/또는 다른 컴포넌트 와 및/또는 신호에 의해 다른 시스템들과 인터넷과 같은 네트워크를 통해 상호 작용하는 하나의 컴포넌트로부터 의 데이터)을 갖는 신호에 따르는 등 로컬 및/또는 원격 프로세스들에 의해 통신할 수 있다. 추가로, 다양한 실시예들이 액세스 단말과 관련하여 설명된다. 액세스 단말은 시스템, 가입자 유닛, 가입자국, 이동국, 모바일(mobile), 원격국, 원격 단말, 모바일 디바이스, 사용자 단말, 단말, 무선 통신 디바이스, 사용 자 에이전트, 사용자 디바이스, 또는 사용자 장비(UE)로 또한 지칭될 수 있다. 액세스 단말은 셀룰러폰, 무선 전화, 세션 개시 프로토콜(SIP) 전화, 무선 로컬 루프(WLL) 스테이션, 개인용 디지털 단말(PDA), 무선 접속 능 력을 구비한 핸드헬드(handheld) 디바이스, 컴퓨팅 디바이스, 또는 무선 모뎀에 연결되는 다른 프로세싱 디바이 스일 수 있다. 또한, 다양한 실시예들이 기지국과 함께 본 명세서에 개시된다. 기지국은 액세스 단말(들)과 통신하기 위하여 이용될 수 있으며, 또한 액세스 포인트, 노드 B, e노드B, 또는 몇몇 다른 용어로서 지칭될 수 있다. 또한, 본 명세서에 개시되는 다양한 양상들 또는 피쳐들은 표준 프로그래밍 및/또는 엔지니어링 기술들을 사용 하는 방법, 장치, 또는 제조 물품으로서 구현될 수 있다. 본 명세서에서 사용되는 바와 같은 \"제조 물품\"이라 는 용어는 임의의 컴퓨터 판독가능 장치로부터 액세스 가능한 컴퓨터 프로그램, 캐리어, 또는 매체(media)를 포 함하는 것으로 의도된다. 예를 들어, 컴퓨터-판독가능한 매체는 자기 저장 디바이스들(예를 들면, 하드 디스크, 플로피 디스크, 자기 스트립들, 등), 광학 디스크(예를 들면, 컴팩트 디스크(CD), DVD, 등), 스마트 카 드, 및 플래쉬 메모리 디바이스들(예를 들면, EPROM, 카드, 스틱, 키 드라이브, 등)를 포함하지만, 이들로 제한 되는 것은 아니다. 또한, 본 명세서에 제시되는 다양한 저장 매체는 정보를 저장하기 위한 하나 이상의 디바이 스들 및/또는 다른 기계-판독가능한 매체를 포함한다. \"기계-판독가능한 매체\"라는 용어는 명령(들) 및/또는 데이터를 저장, 보유, 및/또는 전달할 수 있는 무선 채널 및 다양한 다른 매체를 포함하지만, 이들로 제한되는것은 아니다."}
{"patent_id": "10-2010-7003027", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "또한, 실시예들이 일반적으로 통신 시스템과 관련하여 설명되었으나, 본 기술분야의 당업자들은 실시예들이 고 정점(fixed-point) 및 부동 소수점(floating-point) 데이터 표현들 모두를 포함하는, 유한-정밀도 연산 (finite-precision arithmetic)을 이용하는 임의의 설계에 적용될 수 있다는 것을 인지할 수 있을 것이다. 본 명세서에 개시된 시스템들 및/또는 방법들은 임의의 적절한 타입의 설계와 함께 이용될 수 있고, 그러한 모든 타입의 설계(들)는 본 명세서에 첨부된 청구항들의 범위를 벗어나지 않도록 의도된다는 것을 인지해야 한다. 이제 도 1을 참조하여, 본 발명에 제시된 다양한 실시예들에 따른 무선 통신 시스템이 개시된다. 시스템 은 다수의 안테나 그룹들을 포함할 수 있는 기지국을 포함한다. 예를 들어, 하나의 안테나 그룹은 안테나들(104 및 106)을 포함할 수 있고, 다른 그룹은 안테나들(108 및 110)을 포함할 수 있으며, 추가 그룹은 안테나들(112 및 114)을 포함할 수 있다. 2개의 안테나들이 각각의 안테나 그룹에 대하여 도시되나, 각각의 그"}
{"patent_id": "10-2010-7003027", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "룹에 대하여 더 많거나 더 적은 안테나들이 이용될 수 있다. 기지국은 본 기술분야의 당업자들에게 인지 되는 바와 같이, 송신기 체인 및 수신기 체인을 더 포함할 수 있고, 그들 각각은 신호 송신 및 수신과 연관되는 다수의 컴포넌트들(예를 들어, 프로세서들, 변조기들, 멀티플렉서들, 복조기들, 디멀티플렉서들, 안테나들 등) 을 포함할 수 있다. 기지국은 모바일 디바이스 및 모바일 디바이스와 같은 하나 이상의 모바일 디바이스들과 통신할 수 있다; 그러나, 기지국은 모바일 디바이스들(116 및 122)과 유사한 실질적으로 임의의 개수의 모바일 디 바이스들과 통신할 수 있다는 것을 인지해야 한다. 모바일 디바이스(116 및 122)은 예를 들어, 셀룰러폰들, 스 마트폰들, 랩탑들, 핸드헬드 통신 디바이스들, 핸드헬드 컴퓨팅 디바이스들, 위성 라디오들, 글로벌 포지셔닝 시스템(global positioning system)들, PDA들, 및/또는 무선 통신 시스템을 통한 통신을 위한 임의의 다 른 적절한 디바이스일 수 있다. 도시된 바와 같이, 모바일 디바이스는 안테나들(112 및 114)과 통신하며, 안테나들(112 및 114)은 순방향 링크를 통해 모바일 디바이스로 정보를 송신하고, 역방향 링크 를 통해 모바일 디바이스로부터 정보를 수신한다. 또한, 모바일 디바이스는 안테나들(104 및 106)과 통신하고, 안테나들(104 및 106)은 순방향 링크를 통해 모바일 디바이스로 정보를 송신하며, 역방향 링크를 통해 모바일 디바이스로부터 정보를 수신한다. 주파수 분할 듀플렉서(FDD) 시스템에서, 순방 향 링크는 역방향 링크에 의하여 사용되는 상이한 주파수 대역을 이용할 수 있고, 순방향 링크 는 예를 들어, 역방향 링크에 의하여 이용되는 상이한 주파수 대역을 이용할 수 있다. 추가로, 시분할 듀 플렉서(TDD) 시스템에서, 순방향 링크 및 역방향 링크는 공통 주파수 대역을 이용할 수 있으며, 순방 향 링크 및 역방향 링크는 공통 주파수 대역을 이용할 수 있다. 그들이 통신하도록 지정되는 영역 및/또는 안테나들의 각각의 그룹은 기지국의 섹터로서 지칭될 수 있다. 예를 들어, 안테나 그룹들은 기지국에 의하여 커버되는 영역들의 섹터의 모바일 디바이스들과 통신하도록 설계될 수 있다. 순방향 링크들(118 및 124)을 통한 통신에서, 기지국의 송신 안테나는 모바일 디바이스 들(116 및 122)에 대한 순방향 링크들(118 및 124)의 신호-대-잡음비를 향상시키기 위해 빔형성을 이용할 수 있 다. 이것은 예를 들어, 원하는 방향으로 신호들을 조정하기 위하여 프리코더(precoder)를 사용함으로써 제공될 수 있다. 또한, 기지국이 연관된 커버리지를 통해 랜덤하게 분산된 모바일 디바이스들(116 및 122)로 송 신하기 위해 빔형성을 이용하는 반면, 이웃 셀들의 모바일 디바이스들은 모든 자신의 모바일 디바이스들로 단일 안테나를 통해 송신하는 기지국과 비교하여 더 적은 간섭을 겪을 수 있다. 또한, 모바일 디바이스들(116 및 122)은 일 실시예에서 피어-투-피어 또는 애드 혹(ad hoc) 기술을 사용하여 서로와 직접적으로 통신할 수 있다. 일 실시예에 따라, 시스템은 다중-입력 다중-출력(MIMO) 통신 시스템일 수 있다. 추가로, 시스템은 통신 채널들(예를 들어, 순방향 링크 채널들 또는 역방향 링크 채널들)을 분할하기 위하여 임의의 타입의 듀플 렉싱 기술을 이용할 수 있다. 또한, 시스템은 다중-베어러(multiple-bearer) 시스템일 수 있다. 베어러 는 정의된 용량, 지연, 비트 에러 레이트 등의 정보 경로일 수 있다. 모바일 디바이스들(116 및 122)은 하나 이상의 무선 베어러들을 각각 서빙(serve)할 수 있다. 모바일 디바이스들(116 및 122)은 하나 이상의 무선 베 어러들에 걸쳐 업링크 리소스들을 관리 및/또는 공유하기 위하여 업링크 레이트 제어 메커니즘들을 이용할 수 있다. 일 실시예에서, 모바일 디바이스들(116 및 122)은 업링크 레이트 제한들을 집행하기 위하여 또한 무선 베어러들을 서빙하기 위하여 토큰 버킷(token bucket) 메커니즘들을 이용할 수 있다. 예시로서, 각각의 베어러는 연관된 우선순위 비트 레이트(prioritized bit rate, PBR), 최대비트 레이트 (maximum bit rate, MBR) 및 보증 비트 레이트(guaranteed bit rate, GBR)를 가질 수 있다. 모바일 디바이스 들(116 및 122)은 연관된 비트 레이트 값들에 적어도 부분적으로 기초하여 무선 베어러들을 서빙할 수 있다.비트 레이트 값들은 각각의 베어러에 대한 PBR 및 MBR을 해명하는 큐(queue) 크기들을 계산하기 위하여 또한 이 용될 수 있다. 큐 크기들은 기지국으로 모바일 디바이스들(116 및 122)에 의하여 송신된 업링크 리소스 요청들에 포함될 수 있다. 기지국은 개별적인 업링크 요청들 및 포함된 큐 크기들에 기초하여 모바일 디 바이스(116 및 122)에 대한 업링크 리소스들을 스케줄링할 수 있다. 도 2는 MIMO 시스템의 송신기 시스템(또한 액세스 포인트로서 공지되는) 및 수신기 시스템(또한 액세스 단말로서 공지되는)의 블록도이다. 송신기 시스템에서, 다수의 데이터 스트림들에 대한 트래픽 데 이터가 데이터 소스로부터 송신기(TX) 데이터 프로세서로 제공된다. 일 실시예에서, 각각의 데이터 스트림은 개별적인 송신 안테나를 통해 송신된다. TX 데이터 프로세서는 코딩된 데이터를 제공하기 위하여 상기 데이터 스트림에 대하여 선택된 특정 코딩 방식에 기초하여 각각의 데이 터 스트림에 대한 트래픽 데이터를 포맷팅, 코딩 및 인터리빙한다. 각각의 데이터 스트림에 대한 코딩된 데이터는 OFDM 기술들을 사용하여 파일럿 데이터와 멀티플렉싱될 수 있다. 파일럿 데이터를 통상적으로 공지된 방식으로 프로세싱되는 공지된 데이터 패턴이며, 채널 응답을 추정하기 위 하여 수신기 시스템에서 사용될 수 있다. 각각의 데이터 스트림에 대한 멀티플렉싱된 파일럿 및 코딩된 데이터 는 그 후 변조 심볼들을 제공하기 위하여 상기 데이터 스트림에 대하여 선택된 특정 변조 방식(예를 들어, BPSK, QSPK, M-PSK, 또는 M-QAM)에 기초하여 변조(예를 들어, 심볼 맵핑)된다. 각각의 데이터 스트림에 대한 데이터 레이트, 코딩 및 변조는 프로세서에 의하여 수행되는 명령들에 대하여 결정될 수 있다. 모든 데이터 스트림들에 대한 변조 심볼들은 그 후 TX MIMO 프로세서에 제공되며, TX MIMO 프로세서 는 변조 심볼들(예를 들어, OFDM에 대한)을 추가로 프로세싱할 수 있다. TX MIMO 프로세서는 그 후 NT개 트랜시버들(TMTR)(222a 내지 222t)로 NT개 변조 심볼 스트림들을 제공한다. 특정 실시예들에서, TX MIMO 프로 세서는 데이터 스트림들의 심볼들로 그리고 심볼이 송신되고 있는 안테나로 빔형성 가중치(beamforming weight)들을 인가한다. 각각의 트랜시버는 하나 이상의 아날로그 신호들을 제공하기 위하여 개별 심볼 스트림을 수신하여 프로세 싱하고, MIMO 채널을 통한 송신에 적합한 변조된 신호를 제공하기 위하여 아날로그 신호들을 추가로 조정(예를 들어, 증폭, 필터링 및 업컨버팅)한다. 트랜시버들(TMTR)(222a 내지 222t)로부터의 NT개의 변조된 신호들은 그 후 각각 NT개 안테나들(224a 내지 224t)로부터 송신된다. 수신기 시스템에서, 송신된 변조 신호들은 NR개 안테나들(252a 내지 252r)에 의하여 수신되고, 각각의 안 테나로부터 수신된 신호는 개별적인 트랜시버(RCVR)(254a 내지 254r)로 제공된다. 각각의 트랜시버 는 개별적인 수신된 신호를 조정(예를 들어, 필터링, 증폭, 및 다운컨버팅)하고, 샘플들을 제공하기 위하여 조 정된 신호를 디지털화하며, 대응하는 \"수신된\" 심볼 스트림을 제공하기 위하여 샘플들을 추가로 프로세싱한다. RX 데이터 프로세서는 그 후 NT개의 \"검출된\" 심볼 스트림들을 제공하기 위하여 특정 트랜시버 프로세싱 기술에 기초하여 NR개의 트랜시버들로부터 NR개의 수신된 심볼 스트림들을 수신하여 프로세싱한다. RX 데 이터 프로세서는 그 후 데이터 스트림에 대한 트래픽 데이터를 복구하기 위하여 각각의 검출된 심볼 스트 림을 복조, 디인터리빙, 및 디코딩한다. RX 데이터 프로세서에 의한 프로세싱은 송신기 시스템에서 TX MIMO 프로세서 및 TX 데이터 프로세서에 의하여 수행된 것과 상보적이다. 프로세서는 어느 프리코딩 매트릭스를 이용할지 여부를 주기적으로 결정한다. 프로세서는 매트릭스 인덱스 부분 및 랭크 값 부분을 포함하는 역방향 링크 메시지를 공식화(formulate)한다. 역방향 링크 메시지는 수신된 데이터 스트림 및/또는 다양한 타입의 통신 링크에 관한 정보를 포함할 수 있다. 역방향 링크 메시지는 그 후 데이터 소스로부터 다수의 데이터 스트림들에 대한 트래픽 데이터를 또한 수 신하는 TX 데이터 프로세서에 의하여 프로세싱되고, 변조기에 의하여 변조되고, 트랜시버들(254a 내 지 254r)에 의하여 조정되며, 송신기 시스템으로 다시 송신된다. 송신기 시스템에서, 수신기 시스템으로부터 변조된 신호들이 안테나들에 의하여 수신되고, 트랜 시버들에 의하여 조정되고, 복조기에 의하여 복조되고, 수신기 시스템에 의하여 송신된 역방향 링크 메시지를 추출하기 위하여 RX 데이터 프로세서에 의하여 프로세싱된다. 프로세서는 그 후 빔형 성 가중치들을 결정하는데 어느 프리코딩 매트릭스를 사용할 것인지를 결정하기 위해 추출된 메시지를 프로세싱한다. 도 3은 다수의 사용자들을 지원하도록 구성되는 예시적인 무선 통신 시스템을 도시하며, 여기서 다양한 개 시된 실시예들 및 양상들이 구현될 수 있다. 도 3에 도시된 바와 같이, 실시예로서, 시스템은 예를 들어, 매크로(macro) 셀들(302a-302g)과 같은 다수의 셀들에 대한 통신을 제공하며, 각각의 셀은 대응하는 액세 스 포인트(AP)(AP들(304a-304g)과 같은)에 의하여 서비스된다. 각각의 셀은 추가로 하나 이상의 섹터들로 (예를 들어, 하나 이상의 주파수들을 서빙하기 위하여) 분할될 수 있다. AT들(306a-306k)을 포함하며, 또한 사 용자 장비(UE)로서 상호교환가능하게 공지되는 다양한 액세스 단말(AT)들은 시스템 전체에 분산된다. 각 각의 AT는 예를 들어, AT가 액티브한지 또는 AT가 소프트 핸드오프(soft handoff) 상태에 있는지 여부에 따라, 주어진 순간에 순방향 링크(FL) 및/또는 역방향 링크(RL)상에서 하나 이상의 AP들과 통신할 수 있다. 무선 통신 시스템은 큰 지리적 영역을 통해 서비스를 제공할 수 있는데, 예를 들어, 매크로 셀들 (302a-302g)은 이웃의 몇몇 블록들을 커버할 수 있다. 셀들은 GSM/GPRS/에지 네트워크(이하에서는 \"2G 네트워크\"로서 지칭됨), 및/또는 UMTS 네트워크(이하에서 는 \"WCDMA 커버리지\", \"3G 네트워크\", 또는 간단히 \"3G\"로서 지칭됨)와 같은 다수의 네트워크들을 통해 커버리 지를 제공할 수 있다. 시스템은 셀들의 제1 네트워크를 가질 수 있고, 여기서 제1 네트워크는 가장 용이 하게 이용가능한 네트워크이며, 또는 시스템은 가장 큰 커버리지 영역을 갖는 \"대비책(fall back)\" 기술로 고려될 수 있다. 또한, 시스템은 셀들의 서브세트에서 이용가능하고, 제1 네트워크로서 용이하게 이 용가능하지 않은 제2 네트워크를 가질 수 있다. 예를 들어, 제2 네트워크는 각각의 셀에서 이용가능하지 않을 수 있고/있거나 제2 네트워크가 이용가능한 셀들의 전체 영역을 커버하지 않을 수 있다. 제2 네트워 크를 떠나는 사용자들에게는 제1 네트워크에 의하여 커버리지가 제공된다. 예를 들어, 시스템은 2G 네트 워크 및 3G 네트워크를 포함할 수 있고, 여기서 2G 네트워크는 전체 시스템을 커버하며, 3G 네트워크는 시 스템 전체 중 일부 위치들에서 이용가능하다. 시스템간 핸드오버(handover) 시나리오 동안에, AT들은 제1 네트워크로부터 제2 네트워크로 핸드오버하거 나, 또는 제2 네트워크로부터 제1 네트워크로 핸드오버한다. 시스템간 핸드오버 시나리오는 AT들이 제1 네트워크에 연결될 때 시작된다; AT들은 AT가 현재 위치되는 셀에 대한 시스템 정보를 판독하며, AT 들이 제2 네트워크 탐색을 시작해야하는지 여부를 결정한다. 셀이 제2 네트워크(예를 들어, WCDMA NCELL 리스트)에 대한 이웃 셀들 리스트(이하에서는 \"NCELL 리스트\"로서 지칭됨)를 포함한다면, AT들은 제 2 네트워크가 성공적으로 식별될 때까지 미리 결정된 레이트로(예를 들어, 매 30초마다) 제2 네트워크를 탐색한 다. 예를 들어, AT들이 제1 2G 네트워크에 연결되고, 제2 네트워크는 3G 네트워크라면, AT들은 WCDMA NCELL 리스트에 명시된 모든 1차 동기화 코드들(PSC)이 식별될 때까지 매 30초마다 3G 네트워크를 탐색할 것이다. 결과적으로, 계속적인 탐색이 AT(306c)에 대한 휴면(sleep) 사이클을 감소시키기 때문에, AT(306c)는 제2 네트워크의 커버리지 영역의 외부에 있다면 불필요한 배터리 전력을 소모할 것이다. 본 발명의 일 양상에 따라, AT들은 시스템간 핸드오버 시나리오 동안에 제2 네트워크를 탐색하는 레이트 (이하에서는 \"탐색 레이트\"로서 지칭됨)를 제어할 수 있다. 예를 들어, AT들은 하나 이상의 백-오프 (back-off) 방식들을 도입함으로써 탐색 레이트를 제어할 수 있다. 백-오프 방식들은 지수적 백-오프 방식들, 비-지수적 백-오프 방식들, 선형적 백-오프 방식들, 비-선형적 백-오프 방식들 등을 포함할 수 있으나, 이에 제 한되지는 않는다. 탐색 레이트의 제어는 연속적 탐색 실패들, AT들의 운동, 및/또는 신호 강도(아래에 논 의되는)와 같은 다수의 기준들 중 임의의 것에 기초하여 도입될 수 있다. 예를 들어, AT(306d)는 시스템간 핸 드오버 시나리오를 시작할 수 있고, 여기서 AT(306d)는 X 초당 한번의 레이트로 제2 네트워크를 탐색한다. 제2 네트워크에 대한 미리 결정된 개수의 연속적 탐색들이 실패하고, AT(306d)가 이동하지 않는다면, AT(306d)는 지 수적 백-오프 방식을 도입할 수 있다. 지수적 백-오프 방식은 AT(306d)가 다음 Z개 시도들에 대해 XY초마다 제 2 네트워크를 탐색하도록, 탐색 레이트를 조정할 수 있으며, Y는 미리 결정된 지수적 백-오프 인자이고, Z는 미 리 결정된 탐색 간격이다. 다시 말해, AT(306d)는 다음 시도들의 세트에 대한 지수적으로 더 느린 증분으로 탐 색할 것이다. 이제 도 4를 참조하여, 액세스 단말상의 탐색 레이트 제어를 구현하기 위한 예시적인 장치가 도시된다. 도면 은 연결 컴포넌트, 탐색 컴포넌트, 및 전력원을 갖는 액세스 단말을 포함한다. 이전 에 논의된 바와 같이, 액세스 단말은 무선 통신 프레임웍(framework)(예를 들어, 다수의 액세스 무선 통신 시스템)을 통한 통신을 제공한다. 무선 통신 프레임웍은 제1 네트워크 및 제2 네트워크를 갖는 무선 액세스 포인트를 포함한다. 액세스 단말은 액세스 포인트상에서 전달된 네트워크들(414 또는 416)에 연결함으로써 통신 프레임웍과 통신할 수 있다. 설명의 간략화를 위해, 통신 프레임웍 은 단일 액세스 포인트를 갖는 것으로 도시되며, 액세스 포인트는 단 2개의 네트워크들(414 및 416)만을 갖는 것으로 도시된다. 그러나, 통신 프레임웍은 다수의 액세스 포인트들을 포함할 수 있고, 액 세스 포인트는 다수의 네트워크들을 포함할 수 있다는 것을 인지할 수 있을 것이다. 연결 컴포넌트는 통신 프레임웍과의 통신을 용이하게 한다. 연결 컴포넌트는 통신 프레임웍에 관한 액세스 단말의 이동성 및/또는 연결과 관련되는 하나 이상의 기준을 결정하는 기준 컴포넌트를 포함한다. 예를 들어, 기준 컴포넌트는 액세스 단말의 운동, 액세스 단말이 현재 연결된 네트 워크의 신호 강도 등을 결정할 수 있다. 구현에 따라, 액세스 단말의 운동은 신호 강도의 변동(varianc e)을 추적함으로써 결정될 수 있다. 현저한 변화는 미리 결정된 임계치를 초과하는 변화이고, 통상적으로 이러 한 임계치는 시스템 설계자, 관리자 등에 의하여 결정될 수 있다. 부가적으로 또는 대안적으로, 기준 컴포넌트 는 다수의 기준들에 기초하여 이동하는 액세스 단말을 결정할 수 있으며, 상기 다수의 기준들은 미리 결정 된 시간 기간에 걸쳐 액세스 단말에 의하여 이루어진 재선택들의 개수, 미리 결정된 시간 기간에 걸쳐 액 세스 단말에 의하여 검출된 새로운 이웃들의 개수, 서빙 셀의 미리 결정된 임계치를 초과하는 수신기 자동 이득 제어(Rx AGC)의 변화들, 및/또는 미리 결정된 임계치를 초과하는 이웃 셀들의 Rx AGC의 변화들을 포함하나, 이에 제한되는 것은 아니다. 예를 들어, 시스템 설계자는 액세스 단말이 2 이상의 재선택들을 유발하거나, 또는 시간 X의 기간에 걸쳐 2 이상의 새로운 이웃들을 검출한다면, 액세스 단말이 이동하고 있음을 결정할 수 있다. 유사하게, 시스템 설계자는 임계치 Z를 초과하는 이웃 셀들의 Rx AGC 또는 Rx AGC의 변화가 액세스 단말이 이동하고 있음을 나타내는 것을 결정할 수 있다. 액세스 단말이 셀(예를 들어, 2G 네트워크)의 제1 네트워크에 임시로 위치할 때, 탐색 컴포넌트(40 6)는 액세스 단말이 제2 네트워크(예를 들어, 3G 네트워크)의 탐색을 시작할 필요가 있는지 여부를 결정하 기 위하여 시스템 정보를 판독한다. 시스템간 핸드오버 시나리오는 탐색 컴포넌트가 액세스 단말이 제2 네트워크의 탐색을 시작해야 하는 것으로 결정할 때 개시된다. 탐색 컴포넌트는 탐색 컴포넌트 가 제2 네트워크를 탐색하는 레이트를 결정하는 탐색 레이트 컴포넌트를 포함한다. 예를 들어, 셀이 제2 네트워크에 대한 NCELL 리스트를 포함한다면, 탐색 컴포넌트는 탐색 레이트 컴포넌트에 정 의된 레이트로(예를 들어, X 또는 매 30초마다) 제2 네트워크를 탐색한다. 또한, 탐색 컴포넌트는 기준 컴포넌트에 의하여 결정된 하나 이상의 기준에 적어도 부분적으로 기초하여 탐색 레이트 컴포넌트 에서 정의된 레이트를 조정할 수 있는 제어 컴포넌트를 포함한다. 이전에 논의된 바와 같이, 각각의 셀은 하나 이상의 섹터들로 분할될 수 있고, 하나 이상의 주파수들상에서 네트워크들을 송신할 수 있다. 결과 적으로, NCELL 리스트는 다수의 주파수들을 포함할 수 있고, 액세스 단말은 리스트에 포함된 각각의 주파 수에 대한 탐색 레이트 제어를 구현할 수 있다는 것을 이해할 수 있을 것이다. 탐색 레이트 제어의 도입을 결정하기 위한 기준은 탐색 레이트 제어가 구현될 시스템의 고유한 능력들 뿐 아니 라 시스템 관리자의 선호도에 크게 기초한다. 예를 들어, 몇몇 시스템들에서, 신호 강도와 같은 특정 기준은 다른 기준보다 신뢰성 있거나 귀중한 것일 수 있다. 또한, 시스템 관리자들은 상이한 기준의 사용을 요구하는 다양한 결과들의 달성을 요구할 수 있다. 다수의 무선 시스템 변경들에 따라, 액세스 단말에 대한 탐색 레이트 제어의 구현은 다양한 목적들의 균형을 맞추는 것을 요구할 수 있다. 예를 들어, 제1 및 제2 네트워크 를 포함하는 시스템에서, 백-오프 방식은 전력원을 보존하기 위하여 시스템간 핸드오버 시나리오 동안에 구현될 수 있고, 이는 가능한 한 자주 가장 바람직한 네트워크상의 액세스 단말을 작동시키기 위한 요구 (예를 들어, 가장 효율적인, 가장 빠른, 최상 커버리지, 등)와 균형이 맞춰진다. 제어 컴포넌트는 탐색 레이트 컴포넌트에 정의된 레이트를 조정하는데 제어 컴포넌트에 의한 사 용을 위해 하나 이상의 백-오프 방식들을 제공하는 백-오프 컴포넌트를 포함한다. 백-오프 컴포넌트(42 4)는 기준 컴포넌트에 의하여 결정된 하나 이상의 기준 및/또는 카운터 컴포넌트에서 유지되는 연속 적인 개수의 실패한 탐색들에 기초하여 백-오프 방식들을 구현할 수 있다. 예를 들어, 백-오프 컴포넌트 는 카운터 컴포넌트가 미리 결정된 개수의 실패한 연속적 탐색들(예를 들어, 5)을 초과할 때, 백-오프 방 식을 구현할 수 있으며, 기준 컴포넌트는 액세스 단말이 이동하지 않음을 결정한다. 기준들이 액세 스 단말이 제2 네트워크의 에지상에 있음을 표시하기 때문에, 전술한 실시예에서 사용되는 기준은 선 택될 수 있다. 또한, 전력원으로부터 액세스 단말에 의하여 소모되는 전력은 탐색 컴포넌트에 의하여 실행되는 탐색들의 주파수 및/또는 개수에 비례한다. 결과적으로, 탐색 컴포넌트에 의하여 실행되 는 탐색들의 주파수 및/또는 탐색들의 전체 개수를 감소시키는 것은 전력원으로부터 소모된 전력을 감소시 킨다.위에 개시된 예시적인 시스템들의 관점에서, 개시된 내용에 따라 구현될 수 있는 방법들은 도 5의 흐름도를 참 조로 하여 더 잘 인지될 것이다. 설명의 간략화를 목적으로, 방법들은 일련의 블록도들로서 도시되고 설명되나, 몇몇 블록들은 본 명세서에 개시되고 설명된 것과 상이한 순서들로 및/또는 동시에 발생할 수 있기 때문에, 청구된 내용은 블록들의 순서로 제한되지 않음을 이해하고 인지할 수 있을 것이다. 또한, 이하에 개시 된 방법들을 구현하기 위하여 필요한 모든 블록들이 도시된 필요는 없을 것이다. 도 5는 탐색 레이트 제어를 통해 액세스 단말 배터리 수명 증가를 용이하게 하는 일반화된 방법을 도시한 다. 502에서 액세스 단말은 셀의 제1 네트워크와 통신한다. 504에서, 액세스 단말이 이미 시스템간 핸드오버 시나리오(이전에 논의된 바와 같은)를 시작한 것으로 가정하면; 액세스 단말은 X초마다 제2 네트워크(예를 들어, 3G)를 탐색하고, 여기서, X는 탐색 레이트이다. 506에서, 액세스 단말은 탐색 레이트 제어(SRC)에 대한 하나 이상의 기준이 충족되는지 여부를 결정한다. 예를 들어, 액세스 단말 이동성은 기준들 중 하나일 수 있으며, 액세스 단말이 이동하지 않는다면(예를 들어, 이동성), 탐색 레이트 제어를 위한 기준이 충족된다. 이전에 논의된 바에 따라, 액세스 단말은 다수의 기준들 에 기초하여 자신의 이동성을 결정할 수 있고, 다수의 기준들은 신호 강도가 현저히 변화하는지 여부, 미리 결 정된 시간 기간에 걸친 재선택들의 개수, 미리 결정된 시간 기간에 걸쳐 검출된 새로운 이웃들의 개수, 특정 임 계치를 초과하는 Rx AGC의 변화, 특정 임계치를 초과하는 이웃 셀들의 Rx AGC의 변화 등을 포함하나, 이에 제한 되지는 않는다. 508에서, 기준이 충족된다면(예를 들어, 액세스 단말이 이전 탐색 간격 동안에 이동하지 않았음)(504에서 YES), 그 후 탐색 카운터는 증분된다(예를 들어, 1만큼). 510에서, 탐색 카운터는 미리 결정된 임계치 값과 비교된다. 탐색 카운터가 미리 결정된 임계치 값을 초과하지 않는다면(510에서 NO), 그 후 액세스 포인트는 X 초에서 다시 탐색할 것이다. 탐색 카운터 Y가 미리 결정된 임계치 값을 초과한다면(510에서 YES), 그 후 액세 스 단말은 512에서 탐색 레이트 제어를 수행하거나 구현한다. 탐색 레이트 제어는 백-오프 방식 이용에 의한 탐색 레이트의 조정을 포함할 수 있다. 일 실시예에서, 방식들 사이의 시간은 길어질 수 있다. 이러한 경우에, 미리 결정된 시간 기간 동안에 수행된 탐색들의 개수에 의하여 정의되는 바와 같이, 레이트는 감소된다. 각각의 탐색이 액세스 단말의 배터리 수명을 소모하기 때문에, 탐색들의 개수가 감소함에 따라, 배 터리 수명은 절약된다. 예를 들어, 액세스 단말은 선형적 백-오프 방식을 구현할 수 있고, 액세스 단말은 다음 Z개 시도들에 대하여 X*Y마다 제2 네트워크를 탐색할 것이다. 부가적으로 또는 대안적으로, NCELL 리스트는 다 수의 주파수들을 포함할 수 있고, 액세스 단말은 리스트에 포함된 각각의 주파수에 대하여 탐색 레이트 제어(예 를 들어, 백-오프 방식)를 구현할 수 있다. 부가적으로 또는 대안적으로, 도 5에 도시된 탐색 레이트 제어의 방법은 가상으로 임의의 시스템간 핸드오버 시 나리오에 적용될 수 있고, 본 명세서에 논의된 예시적인 무선 통신 시스템들로 제한되지 않음을 인식할 수 있을 것이다. 예를 들어, 탐색 레이트 제어의 전술한 방법은 무선 로컬 영역 네트워크(WLAN)에서 작동하는 액세스 단말들에 적용될 수 있고, 여기서 WLAN은 이용가능한 둘 이상의 네트워크들을 갖는다. 도 6은 본 발명의 방법들 및 장치들에 따른 하나 이상의 특징들의 자동화를 용이하게 하는 인공 지능(AI) 컴포 넌트를 이용하는 방식을 도시한다. 탐색 제어 레이트 방법들 및 장치들(예를 들어, 추론과 관련된) 은 그것의 다양한 양상들을 실행하기 위한 다양한 AI-기반 방식들을 구현할 수 있다. 예를 들어, 백-오프 방식 의 트리거(trigger) 구현을 위해 사용될 수 있는 기준을 결정하기 위한 프로세스가 자동 분류기 시스템 및 프로 세스를 통해 용이해질 수 있다. 분류기는 입력이 클래스(class)에 속한다는 컨피던스(confidence)로 입력 속성 벡터(attribute vector)(x = (xl, x2, x3, x4, xn))를 맵핑하는 함수인데, 즉, f(x) = confidence(class)이다. 그러한 분류는 사용자가 자 동적으로 수행되길 원하는 작동을 예측하거나 추론하기 위하여 확률 및/또는 통계-기반 분석(예를 들어, 분석 유틸리티들 및 비용들로 팩토링(factoring))을 이용할 수 있다. 예를 들어, 구현에 따라, 컨피던스는 기준들의 세트에 할당될 수 있고, 탐색 레이트 제어를 구현하기 위한 트리거들로서 사용되어야 하는 기준들에 대한 추론 이 이루어질 수 있다. 지지 벡터 머신(SVM)은 이용될 수 있는 분류기의 일 실시예이다. SVM은 가능한 입력들의 공간에서 초곡면 (hypersurface)을 발견함으로써 작동하고, 초곡면은 비-트리거링 이벤트들로부터 트리거링 기준들을 분류하도록 시도한다. 직관적으로, 이것은 근처에 있으나 트레이닝 데이터와 동일하지 않은 데이터를 테스팅하기 위한 분 류를 정확하게 한다. 다른 지시된 그리고 지시되지 않은 모델 분류 방식들은 예를 들어, 나이브 베이스( ), 베이시안(Bayesian) 네트워크들, 결정 트리(decision tree)들, 중성 네트워크들, 퍼지 로직 모델(fuzzy logic model)들을 포함하며, 독립(independence)의 상이한 패턴들을 제공하는 확률적 분류 모델들이 이용될 수 있다. 본 명세서에서 사용되는 분류는 또한 우선순위 모델들을 전개시키는데 이용되는 통계적 회귀 (statistical regression)를 포함한다. 본 명세서로부터 용이하게 이해될 수 있는 바와 같이, 본 발명은 (예를 들어, 사용자 행동 관찰, 외적인 정보 수신을 통해) 명시적으로 트레이닝될 뿐 아니라, (예를 들어, 포괄적 트레이닝 데이터를 통해) 암시적으로 트레 이닝되는 분류기들을 이용할 수 있다. 예를 들어, SVM들은 분류기 구성기 및 특징 선택 모듈 내에 학습 또는 트레이닝 위상을 통해 구성된다. 따라서, 분류기(들)는 다수의 기능들을 자동적으로 학습하고 수행하는데 사용 될 수 있으며, 다수의 기능들은 미리 결정된 기준에 따라 이전에 추론된 개요를 언제 갱신하거나 개선할지, 프 로세싱되고 있는 데이터의 종류(예를 들어, 1차 대 2차, 정적 대 동적, ..)에 기초한 추론 알고리즘에 대한 기 준을 언제 더 엄격하게 할지, 그리고 하루 중 어떤 시간에 더 엄격한 기준 제어들을 구현할지(예를 들어, 저녁 에 시스템 성능이 덜 영향을 받을 때) 등을 결정하는 것을 포함하나, 이에 제한되는 것은 아니다. 이제 도 7을 참조하여, 휴대용 핸드-헬드 단말 디바이스의 개략적인 블록도가 도시되며, 여기서 프로세서 는 디바이스의 일반적인 동작을 제어하기 위한 것이다. 프로세서는 본 명세서에 개시된 다양한 기능들을 수행하기 위하여 디바이스 내에 다양한 컴포넌트들을 제어하고 작동시키도록 프로그래밍된다. 프로세서는 다수의 적절한 프로세서들 중 임의의 것일 수 있다. 프로세서가 본 발명과 관련된 기능"}
{"patent_id": "10-2010-7003027", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "들을 수행하도록 프로그래밍될 수 있는 방식은 본 명세서에 제공된 설명에 기초하여 본 기술분야의 당업자들에 게 명백할 것이다. 프로세서에 연결되는 메모리는 프로세서에 의하여 실행되는 프로그램 코드를 저장하도록 기능하 고, 사용자 자격(credential) 및 수신 트랜잭션 정보 등과 같은 정보를 저장하기 위한 저장 수단으로서 기능한 다. 메모리는 적어도 디스플레이되는 정보의 완전한 세트를 저장하도록 적절히 구성되는 비휘발성 메모리 일 수 있다. 따라서, 메모리는 텍스트, 이미지들, 오디오, 및 비디오 컨텐츠를 포함하는 기가바이트의 데 이터를 저장할 수 있는 예컨대 마이크로 드라이브와 같은 대용량 저장 메모리 및/또는 프로세서에 의한 고 속 액세스를 위한 RAM 또는 플래시 메모리를 포함할 수 있다. 일 양상에 따라, 메모리는 정보의 다수의 세트들을 저장할 수 있는 충분한 저장 용량을 갖고, 프로세서는 디스플레이 정보의 다양한 세트들 사이에 서 교대하거나 순환하기 위한 프로그램을 포함할 수 있다. 디스플레이는 디스플레이 드라이버 시스템을 통해 프로세서에 연결된다. 디스플레이는 컬 러 액정 디스플레이(LCD), 플라즈마 디스플레이, 또는 이와 유사한 종류의 다른 것들일 수 있다. 본 실시예에 서, 디스플레이는 그레이 스케일(gray scale)의 16 레벨들을 갖는 1/4 VGA 디스플레이이다. 디스플레이 는 데이터, 그래픽들, 또는 다른 정보 컨텐츠를 나타내도록 기능한다. 예를 들어, 디스플레이는 고 객 정보의 세트를 디스플레이할 수 있고, 이는 작동자에게 디스플레이되며, 시스템 백본(backbone)(미도시)을 통해 송신될 수 있다. 대안적으로, 디스플레이는 디바이스의 실행을 제어하는 다양한 기능들을 디스 플레이할 수 있다. 디스플레이는 알파벳 및 그래픽 문자들 모두를 디스플레이할 수 있다. 프로세서 및 온보드(onboard) 전력 시스템(예를 들어, 배터리 팩)에 의하여 핸드-헬드 디바이스(70 0)를 형성하는 다른 컴포넌트들에 전력이 제공된다. 전력 시스템이 고장나거나 디바이스로부터 분리 되는 경우에, 보조 전력원이 프로세서에 전력을 공급하고 온보드 전력 시스템을 충전하기 위하 여 이용될 수 있다. 디바이스의 프로세서는 예측된 정전의 검출시 유도된 전류를 감소시키기 위하여 휴면 모드를 유도한다. 단말은 원격 컴퓨터와 프로세스를 인터페이싱시키는데 이용되는 데이터 통신 포트를 포함하는 통신 서브시스템을 포함한다. 포트는 유니버설 시리얼 버스(USB) 및 IEEE 1394 직렬 통신 능력들 중 적어도 하나를 포함할 수 있다. 예를 들어, 적외선 데이터 포트를 이용하는 적외선 통신과 같은 다른 기술들이 또한 포함될 수 있다. 디바이스는 프로세서와의 가동 통신에 무선 주파수(RF) 트랜시버 섹션을 더 포함할 수 있다. RF 섹션은 RF 수신기를 포함하며, RF 수신기는 안테나를 통해 원격 디바이스로부터 RF 신호들을 수신하고 내부에 변조된 디지털 정보를 획득하기 위하여 신호를 변조한다. RF 섹션은 또한 예를 들어, 사 용자 입력 디바이스(예를 들어, 키패드)를 통한 수동 사용자 입력에 응답하여, 또는 트랜잭션의 완료나 다 른 미리 결정되고 프로그래밍된 기준에 자동으로 응답하여, 원격 디바이스로 정보를 송신하기 위한 RF 송신기를 더 포함한다. 트랜시버 섹션은 물건 또는 아이템 RF 태그(tag)들과 함께 사용하는, 예컨대 수동 적 또는 능동적 트랜스폰더(transponder) 시스템과의 통신을 용이하게 한다. 프로세서는 트랜시버를 통해 원격 트랜스폰더 시스템에 시그널링(또는 펄싱(pulse))하고, 태그 메모리의 컨텐츠를 판독하기 위하여 리 턴 신호를 검출한다. 일 구현에서, RF 섹션은 디바이스를 사용한 전화 통신을 추가로 용이하게 한다. 그것의 진척에서, (스피커 또는 유사한 오디오 출력 디바이스로부터의) 오디오 출력 신호들 및 마이크로 폰(또는 유사한 오디오 입력 디바이스)로부터의 오디오 입력을 프로세싱하기 위하여 프로세서에 의하여 제 어되는 오디오 I/O 섹션이 제공된다. 다른 구현에서, 디바이스가 간단히 음성 레코더로서 사용될 때, 프로세서가 컴퓨터 워드 프로세서와 같은 로컬 편집 및 리뷰, 및/또는 원격 시스템으로의 추후의 다운로드를 위한 텍스트 컨텐츠로의 음성 신호들의 고속 변환을 용이하게 할 수 있도록, 디바이스는 음성 인식 능력들을 제공할 수 있다. 유사하게, 변환된 음성 신호들은 키패드를 통한 수동 입력의 사용 대신에 디바이스를 제어하는데 사용될 수 있다. 프린터, 서명 패드, 및 자기 스트립 판독기와 같은 온보드 주변 장치들이 또한 디바이스의 하우징 내에 제공되거나, 하나 이상의 외부 포트 인터페이스들을 통해 외부적으로 수용될 수 있다. 디바이스는 사용자가 디스플레이에 의한 프리젠테이션 및 디바이스에 의한 저장을 위한 이미지 들 및/또는 짧은 영화들을 레코딩할 수 있도록, 이미지 캡쳐 시스템을 더 포함할 수 있다. 부가적으로, 스캐닝 데이터형태들에 대한 데이터형태 판독 시스템이 포함된다. 이러한 이미지화 시스템들(736 및 73 8)은 두 개 기능들 모두를 수행할 수 있는 단일 시스템일 수 있다는 것이 인지될 수 있을 것이다."}
{"patent_id": "10-2010-7003027", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 예시적인 다중 액세스 무선 통신 시스템을 도시한다. 도 2는 통신 시스템의 일반적인 블록도를 도시한다. 도 3은 예시적인 무선 통신 시스템을 도시한다. 도 4는 탐색 레이트 제어를 구현하기 위한 예시적인 무선 통신 장치를 도시하는 일반적인 컴포넌트 블록도이다. 도 5는 탐색 레이트 제어를 구현하는 일반화된 방법을 도시하는 흐름도이다. 도 6은 대안적인 실시예에 따른 하나 이상의 특징들의 자동화를 용이하게 하는 인공 지능 컴포넌트를 이용하는 접근법을 도시한다. 도 7은 본 명세서에 개시된 하나 이상의 실시예들을 실행하도록 작동되는 예시적인 디바이스를 도시한다."}
