{"patent_id": "10-2023-0045383", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0144482", "출원번호": "10-2023-0045383", "발명의 명칭": "감성 기반 반려 동물 관리 서비스 제공 시스템 및 방법", "출원인": "(주)티아이스퀘어", "발명자": "이길수"}}
{"patent_id": "10-2023-0045383", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "감성 기반 반려 동물 관리 서비스 제공 시스템으로서,사용자 단말기와 반려 동물이 거주하는 댁내에 설치된 스마트 단말 사이에서 영상 대화 서비스를 제공하는 영상대화 서비스 수행부;스마트 단말로부터 전송되는 반려 동물의 움직임 또는 소리를 포함하는 영상 신호 또는 음성 신호에 상응하는알림 메시지를 사용자 단말기로 제공하는 반려 동물 행동 알림 서비스 수행부; 및반려 동물의 움직임이나 소리에 기초하여 감정 기반 콘텐츠를 사용자 단말기로 제공하는 반려 동물 감정 표현서비스 수행부를 포함하는 감성 기반 반려 동물 관리 서비스 제공 시스템."}
{"patent_id": "10-2023-0045383", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 영상 대화 서비스 수행부는, 영상 대화 서비스를 제공하는 도중 반려 동물의 움직임이나 소리를 분석하여이에 상응하는 감정 기반 콘텐츠를 사용자 단말기로 제공하는 것을 특징으로 하는 감성 기반 반려 동물 관리 서비스 제공 시스템."}
{"patent_id": "10-2023-0045383", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,상기 반려 동물 행동 알림 서비스 수행부는, 상기 스마트 단말에서 반려 동물의 움직임 또는 소리가 감지된 경우, 감지 시점으로부터 일정 시간 동안 영상 신호 또는 소리 신호를 녹화/녹음된 영상 신호 또는 소리 신호를수신하는 것을 특징으로 하는 감성 기반 반려 동물 관리 서비스 제공 시스템."}
{"patent_id": "10-2023-0045383", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서,상기 반려 동물 행동 알림 서비스 수행부는, 인공 지능 기반 분석 모델에 의해, 상기 스마트 단말로부터 수신된영상 신호 및 소리 신호를 분석하여 사용자 단말기로 전송할 알림 메시지를 결정하고, 결정된 알림 메시지를 사용자 단말기로 전송하는 것을 특징으로 하는 감성 기반 반려 동물 관리 서비스 제공 시스템."}
{"patent_id": "10-2023-0045383", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "에 있어서,상기 감정 기반 콘텐츠는 반려 동물의 상태나 감성에 상응하는 텍스트, 이미지 및 동영상 콘텐츠 중 적어도 어느 하나인 것을 특징으로 하는 감성 기반 반려 동물 관리 서비스 제공 시스템."}
{"patent_id": "10-2023-0045383", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 6에 있어서,상기 반려 동물 감정 표현 서비스 수행부는 감정 기반 콘텐츠를 반려 동물의 얼굴 주변에 감정 기반 콘텐츠를표시할 수 있도록, 감정 기반 콘텐츠가 표시될 위치에 상응하는 위치 정보를 감정 기반 콘텐츠와 함께 사용자단말기로 전송하고,상기 사용자 단말기는 상기 위치 정보에 상응하는 위치에 상기 감정 기반 콘텐츠를 표시하는 것을 특징으로 하는 감성 기반 반려 동물 관리 서비스 제공 시스템."}
{"patent_id": "10-2023-0045383", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 1 내지 청구항 7에 의한 감성 기반 반려 동물 관리 서비스 제공 시스템에 의해 제공되는 감성 기반 반려동물 관리 서비스 제공 방법으로서,스마트 단말로부터 반려 동물의 움직임 또는 소리를 포함하는 영상 신호 또는 음성 신호를 수신하는 제1 단계;및상기 스마트 단말로부터 수신되는 영상 신호 또는 소리 신호를 분석하여 사용자 단말기로 전송할 알림 메시지를결정한 후, 결정된 알림 메시지를 사용자 단말기로 전송하는 제2 단계를 포함하고,상기 사용자 단말기는 상기 수신되는 알림 메시지를 출력하는 것을 특징으로 하는 감성 기반 반려 동물 관리 서비스 제공 방법."}
{"patent_id": "10-2023-0045383", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 1 내지 청구항 7에 의한 감성 기반 반려 동물 관리 서비스 제공 시스템에 의해 제공되는 감성 기반 반려동물 관리 서비스 제공 방법으로서,사용자 단말기로부터의 영상 모니터링 요청 신호에 기초하여 스마트 단말과 사용자 단말 사이에서 영상 모니터링 서비스를 제공하는 제1 단계;스마트 단말로부터 반려 동물의 움직임 또는 소리 정보를 수신하는 제2 단계; 및반려 동물의 움직임 또는 소리 정보를 분석하여 사용자 단말기로 전송할 감정 기반 콘텐츠를 결정하고, 결정된감정 기반 콘텐츠를 사용자 단말기로 전송하는 제3 단계를 포함하고,상기 사용자 단말기는 수신된 감정 기반 콘텐츠를 반려 동물의 영상과 함께 디스플레이부에 표시하는 것을 특징으로 하는 감성 기반 반려 동물 관리 서비스 제공 방법."}
{"patent_id": "10-2023-0045383", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "공개특허 10-2023-0144482-4-청구항 1 내지 청구항 7에 의한 감성 기반 반려 동물 관리 서비스 제공 시스템에 의해 제공되는 감성 기반 반려동물 관리 서비스 제공 방법으로서,사용자 단말기와 스마트 단말 사이에서 영상 대화 서비스를 제공하는 제1 단계;사용자 단말기로부터의 음성 신호를 텍스트 메시지로 변환하는 제2 단계;상기 변환된 텍스트 메시지를 사용자 단말기로 전송하여 사용자 단말기의 영상 대화 화면에 상기 텍스트 메시지가 표시되도록 하는 제3 단계; 및상기 스마트 단말로부터 수신되는 영상 및 음성 신호로부터 반려 동물의 움직임이나 소리가 감지된 경우, 반려동물의 움직임 또는 소리를 분석하여 감정 기반 콘텐츠를 결정하고, 결정된 감정 기반 콘텐츠를 사용자 단말기로 전송하는 제4 단계를 포함하고,상기 사용자 단말기는 상기 수신된 감정 기반 콘텐츠를 반려 동물의 영상과 함께 표시하는 것을 특징으로 하는감성 기반 반려 동물 관리 서비스 제공 방법."}
{"patent_id": "10-2023-0045383", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 사용자 단말기와 반려 동물이 거주하는 댁내에 설치된 스마트 단말 사이에서 영상 대화 서비스를 제공 하는 영상 대화 서비스 수행부; 스마트 단말로부터 전송되는 반려 동물의 움직임 또는 소리를 포함하는 영상 신 호 또는 음성 신호에 상응하는 알림 메시지를 사용자 단말기로 제공하는 반려 동물 행동 알림 서비스 수행부; 및 반려 동물의 움직임이나 소리에 기초하여 감정 기반 콘텐츠를 사용자 단말기로 제공하는 반려 동물 감정 표현 서 비스 수행부를 포함하는 감성 기반 반려 동물 관리 서비스 제공 시스템 및 이를 통해 제공되는 방법을 제공한다."}
{"patent_id": "10-2023-0045383", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 감성 기반 반려 동물 관리 서비스 제공 시스템 및 방법에 관한 것으로서, 보다 상세하게는 반려 동물 의 움직임이나 소리에 상응하는 알림 메시지 또는 감정 기반 콘텐츠를 사용자 단말기로 제공할 수 있는 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2023-0045383", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근, 반려 동물과 생활하는 가구 수가 크게 증가하고 있다. 아울러 반려 동물의 건강 및 돌봄을 위한 다양한 서비스가 제공되고 있다. 특히, 반려 동물을 사람처럼 여기는 '휴머나이제이션(인간화)’현상과 함께 반려 동물 을 가족으로 여기는 추세도 증가하고 있는 실정이다. 한편, 최근 2021 한국 반려동물 보고서에 의하면, 집을 비울 때 반려 동물을 위해 취하는 조치로는 'TV나 조명 켜놓기', '자동 먹이공급장치 설치하기'가 각각 35.9%, 34.1%로 가장 많은 것으로 조사되고 있으며, '냉/난방기 가동하기'(26.6%), 'CCTV 설치하기'(21.1%), '사물인터넷(IoT) 기반 가전제품 이용하기'(13.8%)도 높은 응답률 을 보인 바 있다. 또한, 2021년 새로 추가된 항목인 '반려 동물 위탁시설 이용하기'(11.4%)도 10%를 상회하는 비중을 기록하고 있다. 이와 같이, 반려 동물이 집에 혼자 있는 경우 반려 동물에 대한 적절한 돌봄 서비스가 제공될 필요가 있으나, 기존의 반려 동물 관리 기기들은 사람이 반려 동물을 단순히 체크하기 위한 것에 초점이 맞춰져 있으며, 반려 동물의 휴머나이제이션(인간화), 펫팸족, 딩펫족 흐름에 맞추어 반려 동물의 행동특성에 맞춘 특화 기기/서비스 가 부족하다는 문제가 있다."}
{"patent_id": "10-2023-0045383", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기한 바와 같은 문제점을 해결하기 위한 것으로서, 일방적으로 사람이 반려 동물을 모니터링하는 것에서 벗어나 반려 동물의 행동 특성에 맞추어 알림 서비스를 제공하고, 실시간으로 반려 동물과 영상 대화가 가능한 감성 기반 반려 동물 관리 서비스 제공 시스템 및 방법을 제공하는 것을 목적으로 한다. 또한, 본 발명은 반려 동물의 움직임이나 소리를 감지하고, 그에 상응하는 알림 메시지를 전송하거나 그에 상응 하는 말풍선, 이모티콘 등과 같은 다양한 콘텐츠를 영상 대화 서비스와 함께 제공하는 것을 또 다른 목적으로 한다.또한, 본 발명은 보호자가 부재 중인 경우에도 반려 동물을 위탁 시설에 맡기지 않고 원격으로 함께 있는 것처 럼 느낄 수 있도록 사용자의 관심을 이끌어 낼 수 있는 시스템 및 방법을 제공하는 것을 또 다른 목적으로 한다."}
{"patent_id": "10-2023-0045383", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 바와 같은 과제를 해결하기 위하여 본 발명은, 감성 기반 반려 동물 관리 서비스 제공 시스템으로서, 사 용자 단말기와 반려 동물이 거주하는 댁내에 설치된 스마트 단말 사이에서 영상 대화 서비스를 제공하는 영상 대화 서비스 수행부; 스마트 단말로부터 전송되는 반려 동물의 움직임 또는 소리를 포함하는 영상 신호 또는 음 성 신호에 상응하는 알림 메시지를 사용자 단말기로 제공하는 반려 동물 행동 알림 서비스 수행부; 및 반려 동 물의 움직임이나 소리에 기초하여 감정 기반 콘텐츠를 사용자 단말기로 제공하는 반려 동물 감정 표현 서비스 수행부를 포함하는 감성 기반 반려 동물 관리 서비스 제공 시스템을 제공한다. 여기에서, 상기 영상 대화 서비스 수행부는, 영상 대화 서비스를 제공하는 도중 반려 동물의 움직임이나 소리를 분석하여 이에 상응하는 감정 기반 콘텐츠를 사용자 단말기로 제공할 수 있다. 또한, 상기 반려 동물 행동 알림 서비스 수행부는, 상기 스마트 단말에서 반려 동물의 움직임 또는 소리가 감지 된 경우, 감지 시점으로부터 일정 시간 동안 영상 신호 또는 소리 신호를 녹화/녹음된 영상 신호 또는 소리 신 호를 수신할 수 있다. 또한, 상기 반려 동물 행동 알림 서비스 수행부는, 인공 지능 기반 분석 모델에 의해, 상기 스마트 단말로부터 수신된 영상 신호 및 소리 신호를 분석하여 사용자 단말기로 전송할 알림 메시지를 결정하고, 결정된 알림 메시 지를 사용자 단말기로 전송할 수 있다. 또한, 상기 반려 동물 감정 표현 서비스 수행부는, 반려 동물의 영상을 사용자 단말기의 디스플레이부를 통해 표시하도록 하면서, 인공 지능 기반 분석 모델에 의해 반려 동물의 움직임이나 소리를 분석하여 해당 움직임 또 는 소리에 상응하는 감정 기반 콘텐츠를 사용자 단말기로 전송함으로써, 사용자 단말기에 표시되고 있는 반려 동물 영상과 함께 감정 기반 콘텐츠가 표시되도록 할 수 있다. 또한, 상기 감정 기반 콘텐츠는 반려 동물의 상태나 감성에 상응하는 텍스트, 이미지 및 동영상 콘텐츠 중 적어 도 어느 하나일 수 있다. 또한, 상기 반려 동물 감정 표현 서비스 수행부는 감정 기반 콘텐츠를 반려 동물의 얼굴 주변에 감정 기반 콘텐 츠를 표시할 수 있도록, 감정 기반 콘텐츠가 표시될 위치에 상응하는 위치 정보를 감정 기반 콘텐츠와 함께 사 용자 단말기로 전송하고, 상기 사용자 단말기는 상기 위치 정보에 상응하는 위치에 상기 감정 기반 콘텐츠를 표 시할 수 있다. 본 발명의 다른 측면에 의하면, 상기한 바와 같은 감성 기반 반려 동물 관리 서비스 제공 시스템에 의해 제공되 는 감성 기반 반려 동물 관리 서비스 제공 방법으로서, 스마트 단말로부터 반려 동물의 움직임 또는 소리를 포 함하는 영상 신호 또는 음성 신호를 수신하는 제1 단계; 및 상기 스마트 단말로부터 수신되는 영상 신호 또는 소리 신호를 분석하여 사용자 단말기로 전송할 알림 메시지를 결정한 후, 결정된 알림 메시지를 사용자 단말기 로 전송하는 제2 단계를 포함하고, 상기 사용자 단말기는 상기 수신되는 알림 메시지를 출력하는 것을 특징으로 하는 감성 기반 반려 동물 관리 서비스 제공 방법을 제공한다. 본 발명의 또 다른 측면에 의하면, 상기한 바와 같은 감성 기반 반려 동물 관리 서비스 제공 시스템에 의해 제 공되는 감성 기반 반려 동물 관리 서비스 제공 방법으로서, 사용자 단말기로부터의 영상 모니터링 요청 신호에 기초하여 스마트 단말과 사용자 단말 사이에서 영상 모니터링 서비스를 제공하는 제1 단계; 스마트 단말로부터 반려 동물의 움직임 또는 소리 정보를 수신하는 제2 단계; 및 반려 동물의 움직임 또는 소리 정보를 분석하여 사용자 단말기로 전송할 감정 기반 콘텐츠를 결정하고, 결정된 감정 기반 콘텐츠를 사용자 단말기로 전송하는 제3 단계를 포함하고, 상기 사용자 단말기는 수신된 감정 기반 콘텐츠를 반려 동물의 영상과 함께 디스플레이부 에 표시하는 것을 특징으로 하는 방법을 제공한다. 또한, 본 발명의 또 다른 측면에 의하면, 상기한 바와 같은 감성 기반 반려 동물 관리 서비스 제공 시스템에 의 해 제공되는 감성 기반 반려 동물 관리 서비스 제공 방법으로서, 사용자 단말기와 스마트 단말 사이에서 영상 대화 서비스를 제공하는 제1 단계; 사용자 단말기로부터의 음성 신호를 텍스트 메시지로 변환하는 제2 단계; 상기 변환된 텍스트 메시지를 사용자 단말기로 전송하여 사용자 단말기의 영상 대화 화면에 상기 텍스트 메시지가 표시되도록 하는 제3 단계; 및 상기 스마트 단말로부터 수신되는 영상 및 음성 신호로부터 반려 동물의 움직임 이나 소리가 감지된 경우, 반려 동물의 움직임 또는 소리를 분석하여 감정 기반 콘텐츠를 결정하고, 결정된 감 정 기반 콘텐츠를 사용자 단말기로 전송하는 제4 단계를 포함하고, 상기 사용자 단말기는 상기 수신된 감정 기 반 콘텐츠를 반려 동물의 영상과 함께 표시하는 것을 특징으로 하는 방법을 제공한다."}
{"patent_id": "10-2023-0045383", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하면, 일방적으로 사람이 반려 동물을 모니터링하는 것에서 벗어나 반려 동물의 행동 특성에 맞추 어 알림 서비스를 제공하고, 실시간으로 반려 동물과 영상 대화가 가능한 감성 기반 반려 동물 관리 서비스 제 공 시스템 및 방법을 제공할 수 있다. 또한, 본 발명은 반려 동물의 움직임이나 소리를 감지하고, 그에 상응하는 알림 메시지를 전송하거나 그에 상응 하는 말풍선, 이모티콘 등과 같은 다양한 콘텐츠를 영상 대화 서비스와 함께 제공할 수 있다. 또한, 본 발명에 의하면, 실시간 모니터링시에 반려 동물의 소리 또는 움직임을 분석하여 사람(가족)이 보거나 들을 수 있는 형태로 출력해주고, 실시간 영상대화서비스 수행시에도 사람(가족)이 자신이 키우는 반려 동물에 게 말을 할 경우에는 이에 상응하는 반려 동물의 움직임이나 소리 등과 같은 응답을 음성, 텍스트 또는 이모티 콘 등의 다양한 형태로 사용자 단말기의 뷰어 화면에 출력할 수 있다. 또한, 사람(가족)이 말을 하지 않을 경우에도 반려 동물의 소리나 움직임에 대한 분석을 통하여 사용자 단말기 의 뷰어 화면에 반려 동물의 의사 표현을 출력하면, 사용자가 이를 보고 반려 동물에게 응답을 할 수 있도록 함 으로써 실제 사람(가족)과 자신의 반려 동물간에 실시간 대화가 이루어지도록 다양한 실시간성 서비스를 제공할 수 있다. 또한, 본 발명은 사용자 단말기의 어플리케이션을 통하여 실시간 모니터링시 실제 반려동물의 움직임 또는 소리 등을 인식하고 이에 기초하여 반려 동물의 감성을 사용자 단말기의 뷰어 화면에 다양한 형태(예컨대, 음성, 텍 스트t 또는 이모티콘 등)으로 표현해서, 사용자가 이를 확인하고, 반려 동물의 상태(상황 또는 감정)을 확인할 수 있으며, 실시간 영상 대화의 경우에는 사람과 반려 동물간에 실시간 영상을 통하여 사람이 말하면 반려 동물 이 이에 응답하고, 반려 동물이 소리 또는 움직임으로 표현하면 이를 실시간으로 사용자(가족, 보호자)의 뷰어 어플리케이션에 다양한 형태(음성, Text 또는 이모티콘 등)으로 표현되어 실제 가족간에 대화하는 형태의 서비 스를 제공하기 위함이다. 즉, 보호자가 부재 중인 경우에도 반려 동물을 위탁 시설에 맡기지 않고 원격으로 함 께 있는 것처럼 느낄 수 있도록 실시간 모니터링(CCTV 영상 -> 사용자 단말기의 뷰어에서 실시간 수신하는 단방 향서비스) 및 실시간 영상 대화(반려 동물과 사람(보호자)간의 영상대화 모드로서 양방향 서비스)시에 반려 동 물의 감정 및 의사표현을 다양한 형태(음성, 텍스트 또는 이모티콘 등)으로 제공하는 시스템 및 방법을 제공할 수 있다."}
{"patent_id": "10-2023-0045383", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부 도면을 참조하여 본 발명에 의한 실시예를 상세하게 설명하기로 한다. 도 1은 본 발명에 의한 감성 기반 반려 동물 관리 서비스 제공 시스템과 다른 구성들과의 전체적인 연결 관계를 나타낸 도면이다. 도 1을 참조하면, 감성 기반 반려 동물 관리 서비스 제공 시스템(100, 이하, 간단히 \"시스템\"이라 한다)은 네트워크를 통해 사용자 단말기 및 스마트 단말과 연결되며, 이들과 연동하여 후술하는 바와 같은 감 성 기반 반려 동물 관리 서비스를 제공한다. 여기에서, 사용자 단말기는 스마트폰, 컴퓨터, 스마트 패드 등과 같은 종래 알려져 있는 장치를 말하며, 본 발명에 의한 감성 기반 반려 동물 관리 서비스를 수행하기 위한 어플리케이션(application)이 설치되어 있다. 스마트 단말 또한 스마트폰, 컴퓨터, 스마트 패드 등과 같은 종래 알려져 있는 장치일 수 있으나, 가정 내 에 특정한 위치에 설치되는 스마트 패드 형태의 디바이스인 것이 바람직하다. 스마트 단말은 반려 동물이 거주하는 댁내에 설치되며, CCTV 등과 같은 촬영 수단과 마이크 등과 같은 음 성 획득 수단을 포함한다. 또한, 스마트 단말은 영상을 표시할 수 있는 디스플레이부와 음성을 출력할 수 있는 스피커와 같은 음성 출력 수단을 포함한다. 스마트 단말은 촬영 수단에 의해 획득되는 반려 동물의 영상 신호와 음성 획득 수단에 의해 획득되는 반려 동물의 음성 신호를 시스템으로 전송한다. 또한, 스마트 단말은 시스템으로부터 전송되는 사용자의 음성 신호 또는 영상 신호를 디스플레이부 또는 음성 출력 수단을 통해 출력할 수 있다. 또한, 스마트 단말은 시스템으로부터 전송되는 텍스트 데이터 및 기타 콘텐츠를 디스플레이부에 표시 할 수도 있다. 또한, 스마트 단말은 후술하는 바와 같이 반려 동물의 움직임이나 소리를 감지할 수 있는 인공 지능 기반 모델을 포함할 수 있다. 또한, 스마트 단말은 이러한 기능을 수행할 수 있는 어플리케이션이 설치되어 있다. 도 2는 본 발명에 의한 시스템의 구성을 나타낸 도면이다. 도 2를 참조하면, 시스템은, 영상 대화 서비스 수행부, 반려 동물 행동 알림 서비스 수행부 및 반 려 동물 감정 표현 서비스 수행부를 포함한다. 영상 대화 서비스 수행부는, 사용자 단말기와 반려 동물이 거주하는 댁내에 설치된 스마트 단말 사이에서 영상 대화 서비스를 제공하는 수단이다. 여기에서, 영상 대화 서비스란 스마트 단말과 사용자 단말기 사이에서 양방향으로 영상 신호 및 음성 신호가 전송되어, 스마트 단말과 사용자 단말기 양자 모두에서 영상 및 음성 신호를 표시하도록 하는 서비스를 의미한다. 영상 대화 서비스 수행부는, 사용자 단말기와 스마트 단말 사이에서 영상 대화 서비스를 위한 호 를 형성하고, 이를 통해 사용자 단말기로부터 전송되는 영상 신호 및 음성 신호를 스마트 단말로 전 송하는 한편 스마트 단말로부터 전송되는 영상 신호 및 음성 신호를 사용자 단말기로 전송한다. 또한, 영상 대화 서비스 수행부는, 영상 대화 서비스를 제공하는 도중 반려 동물의 움직임이나 소리를 분석 하여 이에 상응하는 감정 기반 콘텐츠를 사용자 단말기로 제공하는 기능도 수행할 수 있다.한편, 반려 동물 행동 알림 서비스 수행부는 스마트 단말로부터 전송되는 반려 동물의 움직임 또는 소 리를 포함하는 영상 신호 또는 음성 신호에 상응하는 알림 메시지를 사용자 단말기로 제공하는 수단이다. 스마트 단말에서는 반려 동물의 움직임 또는 소리가 감지된 경우, 감지 시점으로부터 일정 시간 동안 영상 신호 또는 소리 신호를 녹화/녹음한 후, 녹화/녹음된 영상 신호 또는 소리 신호를 시스템으로 전송한다. 반려 동물의 소리를 감지하는 경우, 스마트 단말에서는 미리 설정된 소리의 민감도에 따라 감지하도록 설 정되어 있을 수 있다. 기본적으로는 큰 소리를 감지하도록 설정되어 있는 것이 바람직하다. 이를 위하여, 인공 지능에 기반한 소리 감지 모델에 의해 반려 동물의 소리를 감지하는 것이 바람직하다. 또한, 스마트 단말에서 움직임을 감지하는 경우 인공 지능에 기반하여 미리 학습되어 있는 물체 인식 모델 에 의해 반려 동물의 움직임을 감지하는 것이 바람직하다. 반려 동물 행동 알림 서비스 수행부는 스마트 단말로부터 영상 신호 또는 소리 신호가 수신된 경우, 영상 신호 및 소리 신호를 분석하여 사용자 단말기로 전송할 알림 메시지를 결정한 후, 결정된 알림 메시 지를 사용자 단말기로 전송한다. 여기에서, 알림 메시지는 텍스트 메시지 또는 음성 메시지일 수 있다. 반려 동물 행동 알림 서비스 수행부는 인공 지능(AI) 기반 분석 모델에 의해 수신되는 영상 신호 및 소리 신호에 상응하는 알림 메시지를 결정할 수 있다. 이러한 경우, 반려 동물 행동 알림 서비스 수행부는 사전에 반려 동물의 영상 및 소리 신호에 의해 학습되 어 있으며, 반려 동물의 특정한 동작이나 소리에 가장 적합한 알림 메시지를 자동으로 추출하게 된다. 도 3은 반려 동물 행동 알림 서비스 수행부에 의해 생성되는 알림 메시지의 일예를 나타낸 도면이다. 도 3은 스마트 단말로부터 소리 신호가 전달된 경우로서, 시스템의 반려 동물 행동 알림 서비스 수행 부는 수신되는 소리 신호를 인공 지능(AI) 기반 분석 모델에 입력하여 우측에 도시된 바와 같은 알림 메시 지 중 하나를 결정할 수 있다. 결정된 알림 메시지는 사용자 단말기로 전송되는데, 알림 메시지는 텍스트 메시지 또는 음성 메시지로 전 달될 수 있다. 도 4는 반려 동물 행동 알림 서비스 수행부에 의해 생성되는 알림 메시지의 다른 예를 나타낸 도면이다. 도 4는 스마트 단말로부터 영상 신호가 전달된 경우로서, 시스템의 반려 동물 행동 알림 서비스 수행 부는 수신되는 영상 신호를 인공 지능(AI) 기반 분석 모델에 입력하여 우측에 도시된 바와 같은 알림 메시 지 중 하나를 결정할 수 있다. 이 경우에도, 결정된 알림 메시지는 사용자 단말기로 전송되는데, 알림 메시지는 텍스트 메시지 또는 음성 메시지로 전달될 수 있다. 한편, 반려 동물 행동 알림 서비스 수행부는 스마트 단말로부터 영상 신호 또는 소리 신호가 수신된 경우, 이를 분석하기 이전에 사용자 단말기로 반려 동물로부터 소리 신호 또는 영상 신호가 감지되었음을 알리는 메시지를 먼저 전송할 수도 있다. 다시 도 2를 참조하여, 반려 동물 감정 표현 서비스 수행부에 대해 설명한다. 반려 동물 감정 표현 서비스 수행부는, 반려 동물의 움직임이나 소리에 기초하여 감정 기반 콘텐츠를 사용 자 단말기로 제공하는 기능을 수행한다. 반려 동물 감정 표현 서비스 수행부는, 반려 동물의 영상을 사용자 단말기의 디스플레이부를 통해 표 시하도록 하면서 반려 동물의 움직임이나 소리를 분석하여 해당 움직임 또는 소리에 상응하는 감정 기반 콘텐츠 를 사용자 단말기로 전송함으로써, 사용자 단말기에 표시되고 있는 반려 동물 영상과 함께 감정 기반 콘텐츠가 표시되도록 한다. 여기에서, 감정 기반 콘텐츠는 반려 동물의 상태나 감성에 상응하는 콘텐츠로서, 예컨대 텍스트, 이미지 및 동 영상 콘텐츠 중 적어도 어느 하나일 수 있다. 도 5는 반려 동물 감정 표현 서비스 수행부에 의해 사용자 단말기에 표시되는 감정 기반 콘텐츠의 일 예를 나타낸 것이다. 도시된 바와 같이, 반려 동물의 영상을 사용자 단말기의 디스플레이부를 통해 표시하면서, 반려 동물의 움 직임 또는 소리에 상응하는 콘텐츠를 텍스트 형태로 반려 동물의 영상과 함께 표시함을 알 수 있다. 한편, 반려 동물 감정 표현 서비스 수행부 또한 인공 지능(AI) 기반 분석 모델에 의해 영상 신호 및 소리 신호에 상응하는 감정 기반 콘텐츠를 결정할 수 있다. 이러한 경우, 반려 동물 감정 표현 서비스 수행부는 사전에 반려 동물의 영상 및 소리 신호에 의해 학습되 어 있으며, 반려 동물의 특정한 동작이나 소리에 가장 적합한 반려 동물의 상태나 감성을 결정하고 이에 상응하 는 감정 기반 콘텐츠를 자동으로 추출하게 된다. 도 5에 도시된 바와 같이, 반려 동물 감정 표현 서비스 수행부는 감정 기반 콘텐츠를 반려 동물의 얼굴 주 변에 감정 기반 콘텐츠(텍스트 콘텐츠)를 말풍선 형태로 표시하도록 함으로써 마치 반려 동물이 실제로 생각하 는 감정이나 상태를 나타내는 것처럼 보이게 하는 것이 바람직하다. 이와 같이 감정 기반 콘텐츠를 말풍선 형태로 표시하는 경우, 반려 동물 감정 표현 서비스 수행부는 반려 동물의 얼굴을 기준으로 해당 감정 기반 콘텐츠가 표시될 위치를 결정하고, 해당 위치에 상응하는 위치 정보를 감정 기반 콘텐츠와 함께 사용자 단말기로 전송할 수 있다. 사용자 단말기는 수신되는 위치 정보에 상응하는 디스플레이부의 위치에 감정 기반 콘텐츠를 표시한다. 도 6은 상기한 바와 같은 기능을 제공하기 위한 시스템의 다른 구성 요소의 일예를 나타낸 것이다. 도 6을 참조하면, 시스템은 SCS(Subscriptions & Configuration Server), AS(Application Server), MS(Media Server), RS(Recording Server), STTS(Speech To Text Server), TTSS(Text To Speech Server), DBS(Database Server), OMS(Operation & Management Server), PNS(Push & Notification Server) 등을 포함할 수 있다. 여기에서, SMS/MMS, FCM/APNS, IMS 등과 같은 외부 네트워크와 연결될 수도 있음은 물론이다. 다음으로, 도 7 이하를 참조하여 본 발명에 의한 시스템에 의해 제공되는 감성 기반 반려 동물 관리 서비 스 제공 방법을 구체적으로 설명한다. 도 7은 본 발명에 의한 시스템에 의해 제공되는 감성 기반 반려 동물 관리 서비스 제공 방법의 일실시예를 나타낸 흐름도로서, 반려 동물의 움직임 또는 소리가 감지된 경우 그에 상응하는 알림 메시지를 출력하는 경우 에 대한 것이다. 도 7을 참조하면, 우선 스마트 단말에서 반려 동물의 움직임이나 소리를 감지한다(S100). 스마트 단말은 전술한 바와 같이 인공 지능 기반 움직임 감지 모델 또는 소리 감지 모델을 포함할 수 있으 며, 움직임이나 소리가 감지된 경우 미리 설정된 시간 동안 영상을 녹화하거나 소리를 녹음한다(S110). 그리고, 스마트 단말은 녹화 또는 녹음된 영상 신호 또는 음성 신호를 시스템으로 전송한다(S120). 시스템의 반려 동물 행동 알림 서비스 수행부는, 전술한 바와 같이, 예컨대 인공 지능 기반 물체 인식 모델 또는 소리 감지 모델에 의해 반려 동물의 움직임 또는 소리를 감지하고, 움직임 또는 소리가 감지된 경우 미리 설정된 시간 동안 영상 또는 소리를 녹화 또는 녹음할 수 있다. 시스템은, 스마트 단말로부터 영상 신호 또는 소리 신호가 수신된 경우, 반려 동물의 움직임 또는 소 리가 발생하였음을 알리는 메시지를 사용자 단말기로 전송할 수 있다(S130). 또한, 시스템의 반려 동물 행동 알림 서비스 수행부는 스마트 단말로부터 수신되는 영상 신호 또 는 소리 신호를 분석하여 사용자 단말기로 전송할 알림 메시지를 결정한 후, 결정된 알림 메시지를 사용자 단말기로 전송한다(S140~S160). 전술한 바와 같이, 반려 동물 행동 알림 서비스 수행부는 인공 지능(AI) 기반 분석 모델에 의해 수신되는 영상 신호 및 소리 신호에 상응하는 알림 메시지를 결정할 수 있다. 다음으로, 사용자 단말기는 시스템으로부터 수신되는 알림 메시지를 출력한다(S170). 여기에서, 알림 메시지는 텍스트 메시지 또는 음성 메시지일 수 있으며, 텍스트 형태 또는 음성 신호 형태로 해 당 알림 메시지를 출력한다. 도 8은 본 발명에 의한 시스템에 의해 제공되는 감성 기반 반려 동물 관리 서비스 제공 방법의 다른 실시 예를 나타낸 흐름도로서, 반려 동물의 움직임 또는 소리에 상응하는 감정 기반 콘텐츠를 제공하는 경우에 대한 것이다. 도 8을 참조하면, 우선 사용자 단말기가 시스템으로 스마트 단말과의 영상 모니터링을 요청하고, 시스템은 스마트 단말로 영상 모니터링 요청 신호를 전송하여, 스마트 단말과 사용자 단말 사이에서 영상 모니터링 서비스가 제공된다(S200~S220). 여기에서, 영상 모니터링이란 스마트 단말로부터 반려 동물의 영상 신호(소리 신호 포함)를 사용자 단말기 로 전송함으로써, 사용자 단말기에서 반려 동물의 영상 신호를 재생함으로써 사용자가 반려 동물을 관찰할 수 있도록 하는 것을 의미한다. 이러한 상태에서, 스마트 단말에서 반려 동물의 움직임이나 소리가 감지된 경우, 스마트 단말은 움직 임 또는 소리 정보를 시스템으로 전송한다(S230, S240). 여기에서, 움직임 또는 소리 정보는 반려 동물의 움직임이나 소리가 발생하였음을 알리는 정보일 수 있다. 또한, 스마트 단말은 앞서 설명한 바와 같이, 움직임이나 소리가 감지된 경우 영상 신호 또는 소리 신호를 녹화/녹음하여 이를 움직임 또는 소리 정보로서 시스템으로 전송할 수도 있다. 시스템의 반려 동물 감정 표현 서비스 수행부는 전술한 바와 같이, 반려 동물의 움직임 또는 소리 정 보를 분석하여 사용자 단말기로 전송할 감정 기반 콘텐츠를 결정한 후, 결정된 감정 기반 콘텐츠를 사용자 단말기로 전송한다(S250~S270). 또한, 사용자 단말기는 수신된 감정 기반 콘텐츠를 반려 동물의 영상과 함께 디스플레이부에 표시한다 (S280). 여기에서, 전술한 바와 같이, 반려 동물 감정 표현 서비스 수행부는 인공 지능(AI) 기반 분석 모델에 의해 반려 동물의 움직임이나 소리에 상응하는 감정 기반 콘텐츠를 결정할 수 있다. 감정 기반 콘텐츠는 반려 동물의 상태나 감성에 상응하는 콘텐츠로서, 예컨대 텍스트, 이미지 및 동영상 중 적 어도 어느 하나를 포함할 수 있다. 이 경우, 전술한 바와 같이, 시스템은 감정 기반 콘텐츠가 표시될 위치를 나타내는 위치 정보를 감정 기반 콘텐츠와 함께 사용자 단말기로 전송할 수 있음은 물론이다. 도 9는 본 발명에 의한 시스템에 의해 제공되는 감성 기반 반려 동물 관리 서비스 제공 방법의 또 다른 실 시예를 나타낸 흐름도로서, 스마트 단말과 사용자 단말기 사이에서 영상 대화를 수행하면서 반려 동 물의 움직임 또는 소리에 상응하는 감정 기반 콘텐츠를 제공하는 경우에 대한 것이다. 도 9를 참조하면, 우선 사용자 단말기가 시스템으로 스마트 단말과의 영상 대화를 요청하고, 시 스템은 스마트 단말로 영상 대화 요청 신호를 전송하여, 스마트 단말과 사용자 단말 사이 에서 영상 대화 서비스를 제공한다(S300~S320). 여기에서, 영상 대화 서비스란 스마트 단말과 사용자 단말기 사이에서 양방향으로 영상 신호 및 음성 신호가 전송되어, 스마트 단말과 사용자 단말기 양자 모두에서 영상 및 음성 신호를 표시하도록 하는 서비스를 의미한다. 이러한 상태에서, 사용자 단말기의 사용자가 반려 동물에게 말을 하는 경우, 해당 음성 신호가 시스템 으로 전송되고, 시스템은 수신된 음성 신호를 텍스트 메시지로 변환한다(S330,S340). 음성 신호의 텍스트 메시지로의 변환은 STT(Speech to Text) 서버에서 이루어질 수 있다. 시스템은 변환된 텍스트 메시지를 사용자 단말기로 전송하고, 사용자 단말기는 수신된 텍스트 메시지를 영상 대화 화면에 표시한다(S360). 한편, 시스템은 영상 대화 서비스를 수행하면서 스마트 단말로부터 수신되는 영상 및 음성 신호로부 터 반려 동물의 움직임이나 소리를 감지하고, 움직임이나 소리가 감지된 경우, 반려 동물의 움직임 또는 소리를 분석하여 사용자 단말기로 전송할 감정 기반 콘텐츠를 결정한 후, 결정된 감정 기반 콘텐츠를 사용자 단말기로 전송한다(S370~S390). 또한, 사용자 단말기는 수신된 감정 기반 콘텐츠를 반려 동물의 영상과 함께 표시한다(S400). 여기에서, 전술한 바와 같이, 시스템은 인공 지능(AI) 기반 분석 모델에 의해 반려 동물의 움직임이나 소 리를 분석하고 그에 상응하는 감정 기반 콘텐츠를 결정할 수 있다. 감정 기반 콘텐츠는 앞서 설명한 바와 같이, 반려 동물의 상태나 감성에 상응하는 콘텐츠로서, 예컨대 텍스트, 이미지 및 동영상 콘텐츠 중 적어도 어느 하나일 수 있다. 도 10은 도 9에서 설명한 영상 대화 수행시 감정 기반 콘텐츠를 표시하는 화면의 일예를 나타낸 것이다. 도 10의 좌측은 스마트 단말의 화면과 반려 동물을 나타낸 것이고, 우측은 사용자 단말기의 화면과 사용자의 화면을 함께 나타낸 것이다. 전술한 바 및 도시된 바와 같이, 사용자가 사용자 단말기를 통해 반려 동물의 이름을 부르면, 해당 이름의 음성 신호에 상응하는 텍스트 메시지가 사용자 단말기 화면에 표시된다. 이에 반려 동물이 반응을 하게 되면, 해당 반응 즉 반려 동물의 움직임이나 소리를 분석하고 그에 상응하는 감 정 기반 콘텐츠(앗!엄마다)를 결정하고, 결정된 감정 기반 콘텐츠를 사용자 단말기로 전송하며, 전송된 감 정 기반 콘텐츠는 텍스트 형태로 사용자 단말기의 화면에 표시된다. 이후, 마찬가지 방식으로 영상 대화 서비스를 수행하면서 사용자의 음성에 상응하는 텍스트 메시지가 화면에 연 속적으로 표시되고, 이에 반응하는 반려 동물의 움직임이나 소리에 상응하는 감정 기반 콘텐츠가 텍스트 형태로 사용자 단말기의 화면에 표시됨을 알 수 있다. 이와 같이, 영상 대화 서비스를 수행하면서, 반려 동물의 영상에 감정 기반 콘텐츠를 반려 동물의 얼굴 주변에 말풍선 형태로 표시함으로써 마치 반려 동물이 실제로 생각하는 감정이나 상태를 말하는 것처럼 보이게 할 수 있으므로, 반려 동물과의 공감대를 높이고 대화하는 듯한 느낌을 줄 수 있어서 실감나는 영상 대화 서비스를 제 공할 수 있다. 한편, 도 9 및 도 10에서는 사용자가 사용자 단말기를 통해 먼저 영상 대화 서비스를 요청하는 경우를 예 시적으로 설명하였으나, 스마트 단말에서 반려 동물의 움직임 또는 소리가 발생한 경우 스마트 단말 로부터 영상 대화 서비스 요청 신호가 시스템으로 전달되고, 시스템을 통해 사용자 단말기와 스 마트 단말 사이에 영상 대화 서비스가 이루어지도록 할 수도 있음은 물론이다. 또한, 도 9 및 도 10에서는 사용자가 먼저 말을 하는 경우를 예시적으로 나타내었으나, 반려 동물의 움직임이나 소리가 먼저 발생할 수도 있으며, 이 경우에는 반려 동물의 움직임이나 소리를 시스템에서 먼저 분석하여 감정 기반 콘텐츠를 결정하여 사용자 단말기로 제공할 수도 있음은 물론이다. 도 11은 본 발명에 의한 시스템에서 제공되는 전체적인 기능을 설명하기 위한 도면이다. 도 11에 나타낸 바와 같이, 원격지의 사용자 단말기를 뷰어(viewer)로서, 댁내에 있는 반려 동물을 CCTV를 통해 관찰할 수 있으며, 모니터링 서비스 및 영상 대화 서비스를 수행할 수 있음을 알 수 있다. 또한, 반려 동물과 1:N 실시간 영상 대화를 수행할 수 있으며, 가족과 1:N의 실시간 영상 대화를 수행할 수도 있다. 또한, 전술한 바와 같이 영상 대화 및 모니터링 서비스를 수행하면서, 반려 동물의 움직임 또는 소리에 상응하 는 알림 메시지나 감정 기반 콘텐츠를 사용자 단말기에 표시할 수 있도록 한다. 도 12는 1:N 실시간 영상 대화 서비스를 설명하기 위한 도면이다. 실시간 영상 대화의 경우 1개의 스마트 단말에 대해 예컨대 최대 4명의 가족(보호자)과 동시 영상 대화를 수행할 수 있다. 이 경우, 반려 동물에게 보여주고 싶은 사람의 영상을 선택(Tab)하여 송출할 수 있다. 또한, 영상 변경 시 반려 동물이 놀라지 않도록 페이드(Fade) 효과를 제공하며, 실시간 CCTV 원격 제어 및 녹화 기능 도 제공한다. 또한, 영상 대화 전 또는 대화 중 가족 스마트폰의 가로/세로 모드를 제공한다. 이상에서 본 발명의 바람직한 실시예를 참조하여 본 발명을 설명하였으나 본 발명은 이에 한정되는 것이 아님은 물론이며 다양한 수정/변형 실시가 가능함을 유의해야 한다.부호의 설명 100...감성 기반 반려 동물 관리 서비스 제공 시스템 200...사용자 단말기 300...외부 네트워크 10...영상 대화 서비스 수행부 20...반려 동물 행동 알림 서비스 수행부 30...반려 동물 감정 표현 서비스 수행부"}
{"patent_id": "10-2023-0045383", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 의한 감성 기반 반려 동물 관리 서비스 제공 시스템과 다른 구성들과의 전체적인 연결 관계를 나타낸 도면이다. 도 2는 본 발명에 의한 시스템의 구성을 나타낸 도면이다. 도 3은 반려 동물 행동 알림 서비스 수행부에 의해 생성되는 알림 메시지의 일예를 나타낸 도면이다. 도 4는 반려 동물 행동 알림 서비스 수행부에 의해 생성되는 알림 메시지의 다른 예를 나타낸 도면이다. 도 5는 반려 동물 감정 표현 서비스 수행부에 의해 사용자 단말기에 표시되는 감정 기반 콘텐츠의 일 예를 나타낸 것이다. 도 6은 상기한 바와 같은 기능을 제공하기 위한 시스템의 다른 구성 요소의 일예를 나타낸 것이다. 도 7은 본 발명에 의한 시스템에 의해 제공되는 감성 기반 반려 동물 관리 서비스 제공 방법의 일실시예를 나타낸 흐름도이다.도 8은 본 발명에 의한 시스템에 의해 제공되는 감성 기반 반려 동물 관리 서비스 제공 방법의 다른 실시 예를 나타낸 흐름도이다. 도 9는 본 발명에 의한 시스템에 의해 제공되는 감성 기반 반려 동물 관리 서비스 제공 방법의 또 다른 실 시예를 나타낸 흐름도이다. 도 10은 도 9에서 설명한 영상 대화 수행시 감정 기반 콘텐츠를 표시하는 화면의 일예를 나타낸 것이다."}
