{"patent_id": "10-2018-0170469", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0084458", "출원번호": "10-2018-0170469", "발명의 명칭": "가전기기 및 이의 음성 인식 방법", "출원인": "삼성전자주식회사", "발명자": "이록행"}}
{"patent_id": "10-2018-0170469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "가전기기에 있어서,타 가전기기와 통신을 수행하는 통신 장치;사용자의 음성을 입력받는 마이크; 및상기 마이크로부터 획득된 제1 음성 데이터에 대한 신호 처리를 수행하고, 상기 신호 처리된 제1 음성 데이터를이용하여 음성 인식을 수행하는 프로세서;를 포함하고,상기 프로세서는,상기 타 가전기기로부터 제2 음성 데이터를 수신하면, 상기 수신된 제2 음성 데이터를 이용하여 노이즈 데이터를 생성하고, 상기 생성된 노이즈 데이터를 이용하여 상기 제1 음성 데이터에 대한 상기 신호 처리를 수행하는가전기기."}
{"patent_id": "10-2018-0170469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 프로세서는,상기 타 가전기기에 음성 데이터의 전송을 요청하도록 상기 통신 장치를 제어하고, 상기 마이크로부터 상기 요청에 대응하여 상기 제1 음성 데이터를 획득하고, 상기 타 가전기기로부터 상기 요청에 대응하여 획득된 상기제2 음성 데이터를 수신하는 가전기기."}
{"patent_id": "10-2018-0170469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 타 가전기기는,상기 타 가전기기의 하우징 내부에 배치되어, 상기 타 가전기기의 기설정된 기능을 수행하기 위한 모터를 포함하고,상기 제2 음성 데이터는,상기 타 가전기기의 하우징 내부에 배치된 마이크로부터 획득된 음성 데이터이고,상기 노이즈 데이터는,상기 타 가전기기의 모터에 대한 모터 소음 데이터이고,상기 프로세서는,상기 모터 소음 데이터를 이용하여 상기 제1 음성 데이터에 대해서 상기 모터 소음을 제거하는 신호 처리를 수행하는 가전기기."}
{"patent_id": "10-2018-0170469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 프로세서는,상기 타 가전기기의 모터 구동 여부를 확인하도록 상기 통신 장치를 제어하고, 상기 타 가전기기의 모터가 구동하는 경우 상기 신호 처리된 제1 음성 데이터를 이용하여 상기 음성 인식을 수행하고, 상기 타 가전기기의 모터가 구동하지 않는 경우 상기 제1 음성 데이터를 이용하여 상기 음성 인식을 수행하는 가전기기.공개특허 10-2020-0084458-3-청구항 5 제1항에 있어서,상기 프로세서는,FIR(Finite Impulse Filter) 및 IIR(Infinite Impulse Filter) 중 적어도 하나를 이용하여 상기 노이즈 데이터를 생성하는 가전기기."}
{"patent_id": "10-2018-0170469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 프로세서는,상기 제2 음성 데이터를 주파수 영역으로 변환하고, 상기 변환된 제2 음성 데이터와 기설정된 주파수 대역별 전달함수를 이용하여 상기 노이즈 데이터를 생성하는 가전기기."}
{"patent_id": "10-2018-0170469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 프로세서는,상기 제1 음성 데이터, 상기 신호 처리된 제1 음성 데이터 및 상기 제2 음성 데이터 중 적어도 하나를 이용하여상기 노이즈 데이터를 생성하는 방식을 업데이트하는 가전기기."}
{"patent_id": "10-2018-0170469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 프로세서는,상기 제1 음성 데이터 및 상기 신호 처리된 제1 음성 데이터 중 적어도 하나와 상기 제2 음성 데이터 간의 상관관계를 이용하여 상기 노이즈 데이터를 생성하는 방식을 업데이트하는 가전기기."}
{"patent_id": "10-2018-0170469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 프로세서는,상기 통신 장치를 통해 외부 장치로부터 상기 노이즈 데이터를 생성하기 위한 필터 정보를 수신하면, 상기 수신한 필터 정보를 이용하여 상기 노이즈 데이터를 생성하고,상기 수신한 필터 정보는,상기 외부 장치에 포함된 인공 지능 모델을 이용하여 획득되는 가전기기."}
{"patent_id": "10-2018-0170469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "가전기기의 음성 인식 방법에 있어서,마이크로부터 제1 음성 데이터를 획득하는 단계;상기 획득된 제1 음성 데이터에 대한 신호 처리를 수행하는 단계; 및상기 신호 처리된 제1 음성 데이터를 이용하여 음성 인식을 수행하는 단계;를 포함하고,상기 신호 처리를 수행하는 단계는,타 가전기기로부터 제2 음성 데이터를 수신하는 단계;상기 수신한 제2 음성 데이터를 이용하여 노이즈 데이터를 생성하는 단계; 및상기 생성된 노이즈 데이터를 이용하여 상기 제1 음성 데이터에 대한 신호 처리를 수행하는 단계;를 포함하는공개특허 10-2020-0084458-4-음성 인식 방법."}
{"patent_id": "10-2018-0170469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 타 가전기기에 음성 데이터의 전송을 요청하는 단계;를 더 포함하고,상기 제1 음성 데이터를 획득하는 단계는,상기 요청에 대응하여 상기 제1 음성 데이터를 획득하고,상기 제2 음성 데이터를 수신하는 단계는,상기 타 가전기기로부터 상기 요청에 대응하여 획득된 상기 제2 음성 데이터를 수신하는 음성 인식 방법."}
{"patent_id": "10-2018-0170469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항에 있어서,상기 타 가전기기는,상기 타 가전기기의 하우징 내부에 배치되어, 상기 타 가전기기의 기설정된 기능을 수행하기 위한 모터를 포함하고,상기 제2 음성 데이터는,상기 타 가전기기의 하우징 내부에 배치된 마이크로부터 획득된 음성 데이터이고,상기 노이즈 데이터는,상기 타 가전기기의 모터에 대한 모터 소음 데이터이고,상기 신호 처리를 수행하는 단계는,상기 모터 소음 데이터를 이용하여 상기 제1 음성 데이터에 대해서 상기 모터 소음을 제거하는 신호 처리를 수행하는 가전기기."}
{"patent_id": "10-2018-0170469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 프로세서는,상기 타 가전기기의 모터 구동 여부를 확인하고, 상기 타 가전기기의 모터가 구동하지 않는 경우 상기 제1 음성데이터를 이용하여 상기 음성 인식을 수행하는 단계;를 더 포함하는 음성 인식 방법."}
{"patent_id": "10-2018-0170469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제10항에 있어서,상기 노이즈 데이터를 생성하는 단계는,FIR(Finite Impulse Filter) 및 IIR(Infinite Impulse Filter) 중 적어도 하나를 이용하여 상기 노이즈 데이터를 생성하는 음성 인식 방법."}
{"patent_id": "10-2018-0170469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제10항에 있어서,상기 노이즈 데이터를 생성하는 단계는,상기 제2 음성 데이터를 주파수 영역으로 변환하고, 상기 변환된 제2 음성 데이터와 기설정된 주파수 대역별 전달함수를 이용하여 상기 노이즈 데이터를 생성하는 음성 인식 방법."}
{"patent_id": "10-2018-0170469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "공개특허 10-2020-0084458-5-제10항에 있어서,상기 제1 음성 데이터, 상기 신호 처리된 제1 음성 데이터 및 상기 제2 음성 데이터 중 적어도 하나를 이용하여상기 노이즈 데이터를 생성하는 방식을 업데이트하는 단계;를 더 포함하는 음성 인식 방법."}
{"patent_id": "10-2018-0170469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서,상기 업데이트하는 단계는,상기 제1 음성 데이터 및 상기 신호 처리된 제1 음성 데이터 중 적어도 하나와 상기 제2 음성 데이터 간의 상관관계를 이용하여 상기 노이즈 데이터를 생성하는 방식을 업데이트하는 음성 인식 방법."}
{"patent_id": "10-2018-0170469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제10항에 있어서,외부 장치로부터 상기 노이즈 데이터를 생성하기 위한 필터 정보를 수신하는 단계;를 더 포함하고,상기 노이즈 데이터를 생성하는 단계는,상기 수신한 필터 정보를 이용하여 상기 노이즈 데이터를 생성하고,상기 수신한 필터 정보는,상기 외부 장치에 포함된 인공 지능 모델을 이용하여 획득되는 음성 인식 방법."}
{"patent_id": "10-2018-0170469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "음성 인식 방법을 수행하기 위한 프로그램이 저장된 기록 매체에 있어서,상기 음성 인식 방법은,제1 가전기기 및 제2 가전기기에 음성 데이터를 요청하는 단계;상기 제1 가전기기 및 상기 제2 가전기기로부터 상기 요청에 대응하여 각각 획득한 제1 음성 데이터 및 제2 음성 데이터를 수신하는 단계;상기 수신한 제2 음성 데이터를 이용하여 노이즈 데이터를 생성하는 단계;상기 생성된 노이즈 데이터를 이용하여 상기 제1 음성 데이터에 대한 신호 처리를 수행하는 단계; 및상기 신호 처리된 제1 음성 데이터를 상기 제1 가전기기에 전송하는 단계;를 포함하는 기록 매체."}
{"patent_id": "10-2018-0170469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서,상기 제1 음성 데이터, 상기 신호 처리된 제1 음성 데이터 및 상기 제2 음성 데이터 중 적어도 하나를 이용하여상기 노이즈 데이터를 생성하는 방식을 업데이트하는 단계;를 더 포함하는 기록 매체."}
{"patent_id": "10-2018-0170469", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "가전기기가 개시된다. 개시된 가전기기는, 타 가전기기와 통신을 수행하는 통신 장치, 사용자의 음성을 입력받는 마이크 및 마이크로부터 획득된 제1 음성 데이터에 대한 신호 처리를 수행하고, 신호 처리된 제1 음성 데이터를 이용하여 음성 인식을 수행하는 프로세서를 포함하고, 프로세서는, 타 가전기기로부터 제2 음성 데이터를 수신하 면, 수신된 제2 음성 데이터를 이용하여 노이즈 데이터를 생성하고, 생성된 노이즈 데이터를 이용하여 제1 음성 데이터에 대한 신호 처리를 수행한다."}
{"patent_id": "10-2018-0170469", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 가전기기 및 이의 음성 인식 방법에 관한 것으로, 보다 상세하게는 타 가전기기에서 발생하는 소음에 대한 정보를 이용하여 소음을 추정하고, 추정한 소음을 저감하여 음성 인식률을 높이는 가전기기 및 이의 음성 인식 방법에 관한 것이다."}
{"patent_id": "10-2018-0170469", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "가전기기는 사용자의 제어 명령에 따라 다양한 기능을 수행할 수 있다. 최근의 가전기기는 키패드, 리모컨 등의 입력 장치를 통하여 제어 명령을 입력받는 것뿐만 아니라, 사용자 음성을 통하여 제어 명령을 입력받는 음성 인식 기능이 채용되고 있다. 특히, 사용자가 특정 시작 명령어(예를 들어, 빅스비)를 발화하면, 특정 시작 명령어에 반응하여 음성 인식 기 능을 활성화하는 방법이 적용된 가전기기가 확대되고 있다. 최근에는 한 가정 내에 복수의 가전기기를 구비하고 사용하는 것이 일반적이다. 이때 한 가전기기에서 큰 소음 이 발생하는 경우, 그 소음으로 인해 다른 가전기기에서의 음성 인식 기능이 원활하게 작동하지 않는 경우가 발 생하는 문제점이 있다."}
{"patent_id": "10-2018-0170469", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시의 목적은 타 가전기기에서 발생하는 소음에 대한 정보를 이용하여 소음을 추정하고, 추정한 소음을 저 감하여 음성 인식률을 높이는 가전기기 및 이의 음성 인식 방법을 제공하는 데 있다."}
{"patent_id": "10-2018-0170469", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시 예에 따른 가전기기는, 타 가전기기와 통신을 수행하는 통신 장치, 사용자의 음성을 입력받 는 마이크 및 상기 마이크로부터 획득된 제1 음성 데이터에 대한 신호 처리를 수행하고, 상기 신호 처리된 제1 음성 데이터를 이용하여 음성 인식을 수행하는 프로세서를 포함하고, 상기 프로세서는, 상기 타 가전기기로부터 제2 음성 데이터를 수신하면, 상기 수신된 제2 음성 데이터를 이용하여 노이즈 데이터를 생성하고, 상기 생성된 노이즈 데이터를 이용하여 상기 제1 음성 데이터에 대한 상기 신호 처리를 수행하는 할 수 있다. 한편, 본 개시의 일 실시 예에 따른 가전기기의 음성 인식 방법은, 마이크로부터 제1 음성 데이터를 획득하는 단계, 상기 획득된 제1 음성 데이터에 대한 신호 처리를 수행하는 단계 및 상기 신호 처리된 제1 음성 데이터를 이용하여 음성 인식을 수행하는 단계를 포함하고, 상기 신호 처리를 수행하는 단계는, 타 가전기기로부터 제2 음성 데이터를 수신하는 단계, 상기 수신한 제2 음성 데이터를 이용하여 노이즈 데이터를 생성하는 단계 및 상 기 생성된 노이즈 데이터를 이용하여 상기 제1 음성 데이터에 대한 신호 처리를 수행하는 단계를 포함할 수 있 다. 한편, 본 개시의 일 실시 예에 따른 음성 인식 방법을 수행하기 위한 프로그램이 저장된 기록 매체는, 상기 음 성 인식 방법은, 제1 가전기기 및 제2 가전기기에 음성 데이터를 요청하는 단계, 상기 제1 가전기기 및 상기 제 2 가전기기로부터 상기 요청에 대응하여 각각 획득한 제1 음성 데이터 및 제2 음성 데이터를 수신하는 단계, 상 기 수신한 제2 음성 데이터를 이용하여 노이즈 데이터를 생성하는 단계, 상기 생성된 노이즈 데이터를 이용하여 상기 제1 음성 데이터에 대한 신호 처리를 수행하는 단계 및 상기 신호 처리된 제1 음성 데이터를 상기 제1 가 전기기에 전송하는 단계를 포함할 수 있다."}
{"patent_id": "10-2018-0170469", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에서 사용되는 용어에 대해 간략히 설명하고, 본 개시에 대해 구체적으로 설명하기로 한다. 개시의 실시 예에서 사용되는 용어는 본 개시에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용 어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라 질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 개시의 설명 부분 에서 상세히 그 의미를 기재할 것이다. 따라서 본 개시에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용 어가 가지는 의미와 본 개시의 전반에 걸친 내용을 토대로 정의되어야 한다. 본 개시의 실시 예들은 다양한 변환을 가할 수 있고 여러 가지 실시 예를 가질 수 있는바, 특정 실시 예들을 도 면에 예시하고 상세한 설명에 상세하게 설명하고자 한다. 그러나 이는 특정한 실시 형태에 대해 범위를 한정하 려는 것이 아니며, 개시된 사상 및 기술 범위에 포함되는 모든 변환, 균등물 내지 대체물을 포함하는 것으로 이 해되어야 한다. 실시 예들을 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 제1, 제2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 구성요소들은 용어들에 의해 한정되 어서는 안 된다. 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함하다\" 또 는 \"구성되다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것 이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 이하에서는 첨부한 도면을 참고하여 본 개시의 실시 예에 대하여 본 개시가 속하는 기술 분야에서 통상의 지식 을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 개시는 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시 예에 한정되지 않는다. 그리고 도면에서 본 개시를 명확하게 설명하기 위해 서 설명과 관계없는 부분은 생략하였다. 이하에서는 도면을 참조하여 본 개시에 대해 더욱 상세히 설명하기로 한다. 도 1은 본 개시의 일 실시 예에 따른 음성 인식 시스템을 도시한 도면이다. 도 1을 참조하면, 음성 인식 시스템은 제1 가전기기, 제2 가전기기 및 서버로 구성된다. 제1 가전기기 및 제2 가전기기는 가정에서 사용하는 전기 기계 기구로, 로봇 청소기, 진공 청소기, 전기 레인지, 가스 레인지, 전파 오븐기, 레인지 후드, 세탁기, 건조기, 냉장고, 식기 세척기, 에어컨 등일 수 있다. 제1 가전기기 및 제2 가전기기는 음성 인식 기능을 수행하고, 음성 인식 결과에 따른 기능을 수행할 수 있다. 여기서, 음성 인식이란 입력된 음성의 음향학적 신호를 단어나 문장으로 변환시키는 기술을 의미한다. 그리고 제1 가전기기 및 제2 가전기기는 사용자 발화 음성을 감지하고, 감지한 음성에 대한 음성 인 식을 수행할 수 있다. 구체적으로, 제1 가전기기 및 제2 가전기기는 음성 인식 기능을 활성화하는 트 리거 음성 명령인 시작 명령어(Wake Up Word, WUW)를 감지하면, 음성 인식 기능을 활성화하고, 이후에 입력된 음성에 대한 음성 데이터를 이용하여 음성 인식을 수행할 수 있다. 이하에서는 설명의 용이를 위해 제1 가전기기가 음성 인식 기능을 수행하는 것으로 가정한다. 이때 제2 가 전기기는 큰 소음을 발생시키는 가전기기일 수 있다. 구체적으로, 제2 가전기기는 내부에 포함된 모 터, 팬 등으로 인해 큰 소음을 발생시킬 수 있다. 그리고 제2 가전기기에서 발생한 큰 소음으로 인해, 제1 가전기기의 음성 인식 기능이 원활하게 동작 하지 않을 수 있다. 따라서, 제1 가전기기는 제2 가전기기에서 발생하는 큰 소음에 대한 정보를 이용 하여 소음을 추정하고, 추정된 소음을 저감하여 음성 인식률을 높일 수 있다. 이를 위해, 먼저 제1 가전기기는 제2 가전기기에 녹음 요청 신호를 전송할 수 있다. 그리고 제1 가전 기기는 제2 가전기기로부터 녹음 요청 신호에 대응하여 획득된 제2 음성 데이터를 수신할 수 있다. 여기서 제2 음성 데이터는 제2 가전기기에서 발생하는 소음에 대한 음성 데이터이다. 그리고 제1 가전기기는 녹음 요청 신호에 대응하여 제1 음성 데이터를 획득할 수 있다. 이에 따라 제1 가전기기는 동일한 시점에서 감지된 음성에 대한 제1 음성 데이터 및 제2 음성 데이터를 획 득할 수 있다. 그리고 제1 가전기기는 제2 음성 데이터를 이용하여 노이즈 데이터를 생성할 수 있다. 여기서 노이즈 데이 터란, 잡음원의 순수한 소음에 대응되는 소리 데이터를 의미한다. 구체적으로, 제1 가전기기는 제2 음성 데이터를 잡음 경로 추정 필터에 적용하여 노이즈 데이터를 생성할 수 있다. 한편, 노이즈 데이터를 생성하는 구체적인 동작에 대한 설명은 도 6 내지 도 10과 관련하여 후술한다. 그리고 제1 가전기기는 생성한 노이즈 데이터를 이용하여 제1 음성 데이터를 신호 처리할 수 있다. 구체적 으로, 제1 가전기기는 생성한 노이즈 데이터를 이용하여 제1 음성 데이터에 포함된 소음을 제거할 수 있다. 그리고 제1 가전기기는 신호 처리된 제1 음성 데이터를 이용하여 음성 인식을 수행할 수 있다. 제2 가전기기는 제1 가전기기와 유선 또는 무선 통신을 통해 연결될 수 있다. 그리고 제2 가전기기 는 제1 가전기기로부터 녹음 요청 신호를 수신할 수 있다. 그리고 제2 가전기기는 수신한 녹음 요청 신호에 대응하여 제2 음성 데이터를 획득할 수 있다. 그리고 획 득한 제2 음성 데이터를 제1 가전기기로 전송할 수 있다. 한편, 제1 가전기기의 녹음 요청 신호 전송 동작 및 제1 음성 데이터에 대한 신호 처리 동작은 서버 가 수행하는 방식으로도 구현할 수 있다. 구체적으로, 서버는 제1 가전기기 및 제2 가전기기와 유선 또는 무선 통신을 통해 연결될 수 있 다. 그리고 서버는 제1 가전기기 및 제2 가전기기에 녹음 요청 신호를 전송할 수 있다. 그리고 서버는 제1 가전기기로부터 녹음 요청 신호에 대응하여 획득된 제1 음성 데이터를 수신할 수 있다. 그리고 서버는 제2 가전기기로부터 녹음 요청 신호에 대응하여 획득된 제2 음성 데이터를 수신 할 수 있다. 그리고 서버는 제2 음성 데이터를 이용하여 노이즈 데이터를 생성할 수 있다. 구체적으로, 서버는 제 2 음성 데이터를 잡음 경로 추정 필터에 적용하여 노이즈 데이터를 생성할 수 있다. 그리고 서버는 생성한 노이즈 데이터를 이용하여 제1 음성 데이터를 신호 처리할 수 있다. 그리고 서버 는 신호 처리한 제1 음성 데이터를 제1 가전기기에 전송할 수 있다. 한편, 도 1을 도시하고 설명함에 있어서, 제1 가전기기가 하나의 제2 가전기기에 연결되는 형태를 도 시하고 설명하였지만, 구현시에는 제1 가전기기가 복수의 가전기기에 연결되고, 복수의 가전기기에서 발생 하는 소음에 대한 정보를 이용하여 신호 처리를 수행하는 형태로도 구현될 수 있다. 또한, 도 1을 도시하고 설명함에 있어서, 서버가 두 개의 가전기기에 연결되는 형태를 도시하고 설명하였 지만, 구현시에는 서버가 세 개 이상의 가전기기에 연결되는 형태로 구현될 수 있다. 또한, 도 1을 도시하고 설명함에 있어서, 음성 인식 시스템에 서버가 포함되는 것으로 도시하고 설 명하였지만, 구현시에는 서버 없이 제1 가전기기 및 제2 가전기기만으로 구현될 수 있다. 도 2는 본 개시의 일 실시 예에 따른 제1 가전기기의 간단한 구성을 설명하기 위한 블록도이다. 도 2를 참조하면, 제1 가전기기는 마이크, 통신 장치 및 프로세서로 구성될 수 있다. 마이크는 소리를 소리 신호로 바꾸는 장치로, 사용자의 발화 음성 및 주변의 소리 등을 음성 데이터로 출 력할 수 있다. 그리고 마이크는 출력한 음성 데이터를 프로세서로 전달할 수 있다. 마이크는 하우징의 표면에 배치될 수 있다. 구체적으로, 마이크는 사용자의 발화 음성을 수집하기 위 하여, 하우징의 표면에 배치되어 제1 가전기기 주변의 소리에 대응되는 제1 음성 데이터를 생성할 수 있다. 한편, 마이크의 배치 위치는 상술한 예에 한하지 않는다.또한, 본 개시에서는 제1 가전기기가 하나의 마이크를 포함하는 것으로 도시하고 설명하였으나, 구현시에 는 제1 가전기기가 두 개 이상의 마이크를 포함할 수 있다. 통신 장치는 외부 장치(미도시)와 연결되며, 외부 장치로부터 각종 데이터를 수신할 수 있다. 구체적으로 통신 장치는 근거리 통신망(LAN: Local Area Network) 및 인터넷망을 통해 외부 장치에 접속되는 형태뿐만 아니라, USB(Universal Serial Bus) 포트 또는 무선 통신(예를 들어, WiFi 802.11a/b/g/n, NFC, Bluetooth) 포 트를 통하여 접속되는 형태도 가능하다. 여기서 외부 장치는 PC, 노트북, 스마트폰, 서버 등일 수 있다. 그리고 통신 장치는 음성 인식 시스템 내의 제2 가전기기 또는 서버와 연결될 수 있다. 예를 들어, 블루투스 통신을 통해 음성 인식 시스템 내의 제2 가전기기와 통신을 수행할 수 있으며, 와이파이 통신을 통해 음성 인식 시스템 내의 서버와 통신을 수행할 수 있다. 한편, 제1 가전기기 가 제2 가전기기 또는 서버와 통신을 수행하는 방법은 상술한 예에 한하지 않는다. 프로세서는 제1 가전기기를 제어한다. 구체적으로, 프로세서는 사용자의 제어 명령에 따라 제1 가전기기의 각 구성을 제어할 수 있다. 예를 들어, 제1 가전기기가 냉장고인 경우, 프로세서는 냉각 명령을 수신하면 음식물을 수용하는 냉각실에 냉각된 공기를 제공하도록 압축기(미도시)의 동작을 제어할 수 있다 그리고 프로세서는 마이크를 통해 획득한 제1 음성 데이터를 이용하여 음성 인식을 수행할 수 있다. 한편, 제1 음성 데이터에는 사용자의 음성뿐만 아니라 잡음이 포함될 수 있으며, 포함된 잡음에 의해 음성 인식 률이 떨어질 수 있다. 따라서 프로세서는 제1 음성 데이터에 대한 전처리(Pre-Processing)를 수행할 수 있다. 여기서 전처리란, 음성 인식 이전에 수행되는 일련의 신호 처리로, 음성 데이터에 포함된 잡음을 제거할 수 있다. 그리고 프로세 서는 전처리를 수행한 제1 음성 데이터를 이용하여 음성 인식을 수행할 수 있다. 한편, 제1 음성 데이터에 포함된 잡음은 제1 가전기기와 인근에 배치되어 큰 소음을 발생시키는 제2 가전 기기에 기인할 수 있다. 따라서, 프로세서는 제2 가전기기로부터 제2 가전기기에서 발생하 는 소음에 대한 정보를 획득하고, 획득한 소음에 대한 정보를 이용하여 제1 음성 데이터에 대한 전처리를 수행 할 수 있다. 이하에서는 제2 가전기기에서 발생하는 소음에 대한 정보를 이용하여 제1 음성 데이터에 대한 전처리를 수 행하는 동작에 대해 구체적으로 설명한다. 먼저, 프로세서는 연결 가능한 타 가전기기를 감지하도록 통신 장치를 제어할 수 있다. 구체적으로, 프로세서는 근거리 무선 통신을 통해 연결 가능한 제2 가전기기 또는 제1 가전기기가 접속한 액 세스 포인트(AP)에 접속한 제2 가전기기를 감지하도록 통신 장치를 제어할 수 있다. 여기서, 제1 가전기기와 근거리 무선 통신이 가능하거나 제1 가전기기가 접속한 액세스 포인트(AP)에 접속하고 있는 제2 가전기기는, 제1 가전기기와 인근에 배치되어 있음을 예상할 수 있다. 따라서 제2 가전기기에서 발생한 소음은 제1 가전기기의 음성 인식 기능에 영향을 줄 수 있음을 추론할 수 있다. 그리고 프로세서는 제2 가전기기에 음성 데이터의 전송을 요청하도록 통신 장치를 제어할 수 있 다. 구체적으로, 프로세서는 제2 가전기기에서 발생하는 소음에 대한 음성 데이터인 제2 음성 데이터 의 생성 및 전송을 요청하는 녹음 요청 신호를 제2 가전기기에 전송하도록 통신 장치를 제어할 수 있 다. 여기서 녹음 요청 신호는 기설정된 시간에 대한 정보를 포함할 수 있다. 그리고 제2 가전기기는 수신한 녹 음 요청 신호에 기초하여 기설정된 시간에 마이크를 이용하여 소음을 감지하고 제2 음성 데이터를 생성할 수 있 다. 예를 들어, 녹음 요청 신호에 포함된 기설정된 시간에 대한 정보가 오후 3시 00분 30초인 경우, 제2 가전기 기는 오후 3시 00분 30초에 마이크를 이용하여 소음을 감지하여 제2 음성 데이터를 생성할 수 있다. 한편, 기설정된 시간에 대한 정보는 상술한 예와 같이 절대적인 시간 정보를 포함하는 방식으로 구현될 수 있으 며, “녹음 요청 신호를 수신한 시점으로부터 x초 후”와 같이 상대적인 시간 정보를 포함하는 방식으로 구현될 수 있다. 그리고 녹음 요청 신호는 제2 음성 데이터의 기설정된 시간 길이에 대한 정보를 포함할 수 있다. 그리고 제2 가 전기기는 수신한 녹음 요청 신호에 기초하여 기설정된 시간 길이를 갖는 제2 음성 데이터를 생성할 수 있다. 예를 들어, 녹음 요청 신호에 포함된 기설정된 시간 길이에 대한 정보가 3초인 경우, 제2 가전기기는 3초의 길이를 갖는 제2 음성 데이터를 생성할 수 있다. 한편, 녹음 요청 신호에 포함될 수 있는 정보는 상술한 예에 한하지 않는다. 그리고 프로세서는 제2 가전기기에 전송한 요청에 대응하여 생성된 제2 음성 데이터를 제2 가전기기 로부터 수신할 수 있다. 구체적으로, 프로세서는 제2 가전기기로부터 녹음 요청 신호에 포함된 기설정된 시간 정보 및 기설정된 시간 길이 정보에 기초하여 생성된 제2 음성 데이터를 제2 가전기기로부 터 수신할 수 있다. 예를 들어, 녹음 요청 신호에 포함된 기설정된 시간 정보는 오후 3시 00분 30초, 기설정된 시간 길이 정보는 2 초인 경우, 프로세서는 오후 3시 00분 30초부터 오후 3시 00분 32초 동안 제2 가전기기의 마이크를 통해 감지된 음성에 대한 제2 음성 데이터를 수신할 수 있다. 그리고 프로세서는 제2 가전기기에 전송한 요청에 대응하여 제1 음성 데이터를 획득할 수 있다. 구체 적으로, 프로세서는 제2 가전기기에 전송한 녹음 요청 신호에 포함된 기설정된 시간 정보 및 기설정 된 시간 길이 정보에 기초하여 제1 음성 데이터를 획득할 수 있다. 예를 들어, 녹음 요청 신호에 포함된 기설정된 시간 정보는 오후 3시 00분 30초, 기설정된 시간 길이 정보는 2 초인 경우, 프로세서는 오후 3시 00분 30초부터 오후 3시 00분 32초 동안 마이크를 통해 감지된 음성 에 대한 제1 음성 데이터를 획득할 수 있다. 여기서 획득된 제1 음성 데이터 및 제2 음성 데이터는 녹음 요청 신호에 대응하여 생성된바, 동일한 시간에서 제1 가전기기 및 제2 가전기기가 각각 감지한 음성 데이터에 해당된다. 그리고 제2 음성 데이터는, 제2 가전기기에서 직접 감지한 소음에 대한 음성 데이터인바, 제1 음성 데이터에 포함된 소음보다 더 큰 크기의 소음을 포함할 수 있다. 따라서 제2 음성 데이터를 이용하면 제1 음성 데이터만을 이용하는 경우에 비해 제1 음성 데이터에 포함된 소음 을 보다 정확히 추출할 수 있다. 그리고 프로세서는 제2 음성 데이터를 이용하여 제2 가전기기 내 잡음원의 순수한 소음에 대응되는 소리 데이터인 노이즈 데이터를 생성할 수 있다. 그리고 프로세서는 노이즈 데이터를 생성하기 위해 잡음 경로 추정 필터를 이용할 수 있다. 여기서 잡음 경로 추정 필터란, 제2 음성 데이터에 포함된 잡음원 소음 외의 나머지 성분을 필터링하는 필터를 의미한다. 이 때, 잡음 경로 추정 필터는 필터링 알고리즘으로 지칭될 수 있다. 예를 들어, 제2 음성 데이터가 잡음 경로 추정 필터에 입력되면, 제2 음성 데이터에 포함된 사용자 발화 성분이 필터링 되어, 노이즈 데이터가 출력될 수 있다. 한편, 잡음 경로 추정 필터를 이용하여 노이즈 데이터를 생성하 는 구체적인 동작은 도 6 내지 도 10과 관련하여 후술한다. 그리고 프로세서는 기저장된 잡음 경로 추정 필터를 이용하거나 외부 장치로부터 잡음 경로 추정 필터를 수신하고, 수신한 잡음 경로 추정 필터를 이용하여 노이즈 데이터를 생성할 수 있다. 한편, 외부로부터 잡음 경 로 추정 필터를 수신하여 노이즈 데이터를 생성하는 구체적인 동작은 도 11 내지 도 13과 관련하여 후술한다. 그리고 프로세서는 노이즈 데이터를 이용하여 제1 음성 데이터에 대한 전처리를 수행할 수 있다. 구체적으 로, 프로세서는 잡음 경로 추정 필터를 통해 생성한 노이즈 데이터를 이용하여, 제1 음성 데이터에서 잡음 원의 소음에 대응되는 성분을 제거함으로써, 제1 음성 데이터에 대한 전처리를 수행할 수 있다. 이와 같은 프로세서의 동작들은 기설정된 주기에 따라 반복적으로 수행될 수 있다. 구체적으로, 프로세서 는 기설정된 주기에 따라, 제2 가전기기에 음성 데이터를 요청하고, 제2 가전기기로부터 요청에 대응하여 획득된 제2 음성 데이터를 수신하고, 요청에 대응하여 제1 음성 데이터를 획득하고, 수신한 제2 음성 데이터를 이용하여 노이즈 데이터를 생성하고, 생성한 노이즈 데이터를 이용하여 제1 음성 데이터에 대한 전처 리를 수신하는 일련의 동작을 수행할 수 있다. 한편, 프로세서는 현재 제2 가전기기에서 소음의 발생 여부에 따라 제1 음성 데이터에 대한 전처리 방식을 변경할 수 있다. 예를 들어, 제2 가전기기에서 발생하는 소리가 제2 가전기기에 포함된 모터에 의해 발생하는 경우를 가정한다. 이 경우, 프로세서는 제2 가전기기의 모터의 구동 여부에 따라 제1 음성 데이터에 대한 전 처리 방식을 변경할 수 있다. 구체적으로, 프로세서는 제2 가전기기에 모터의 구동 여부를 확인하도록 통신 장치를 제어할 수 있다. 만약 제2 가전기기의 모터가 구동하는 경우, 제2 가전기기에서 발생하는 소음이 크므로, 상술 한 방식에 따라 제2 음성 데이터를 이용하여 제1 음성 데이터에 대한 전처리를 수행할 수 있다. 반면, 제2 가전기기의 모터가 구동하지 않는 경우, 제2 가전기기에서 자체적으로 발생하는 소음이 없 으므로, 제2 음성 데이터를 이용하지 않고 제1 음성 데이터를 이용하여 바로 음성 인식을 수행하거나, 종래의 방식에 따라 제1 음성 데이터에 대한 전처리를 수행할 수 있다. 한편, 프로세서는 제2 가전기기의 잡음원이 모터가 아닌 팬 등에 해당하는 경우에도 동일하게 잡음원 의 구동 여부에 따라 제1 음성 데이터에 대한 전처리 방식을 변경할 수 있다. 그리고 프로세서는 전처리된 제1 음성 데이터를 이용하여 음성 인식을 수행할 수 있다. 한편, 도 2를 도시하고 설명함에 있어서, 제2 가전기기에 녹음 요청 신호를 전송하고, 제2 가전기기 로부터 제2 음성 데이터를 수신하여 제1 음성 데이터에 대한 전처리를 수행하는 동작은 제1 가전기기가 수행하 는 것으로 도시하고 설명하였으나, 구현시에는 제1 가전기기가 아닌 서버가 상술한 동작을 수행하고, 제1 가전기기는 단지 전처리된 제1 음성 데이터를 서버로부터 수신하여 음성 인식을 수행하는 방식으 로도 구현할 수 있다. 이에 대한 구체적인 동작은 도 5와 관련하여 후술한다. 또한, 이상에서는 제1 가전기기를 구성하는 간단한 구성에 대해서만 도시하고 설명하였지만, 구현시에는 다양한 구성이 추가로 구비될 수 있다. 이에 대해서는 도 3을 참조하여 이하에서 설명한다. 도 3은 본 개시의 일 실시 예에 따른 제1 가전기기의 구체적인 구성을 도시한 블록도이다. 도 3을 참조하면, 본 개시의 일 실시 예에 따른 제1 가전기기는 마이크, 통신 장치, 프로세서 , 입력 장치, 메모리 및 디스플레이로 구성될 수 있다. 마이크 및 통신 장치는 도 2의 구성과 동일한 기능을 수행하는바 중복 설명은 생략한다. 그리고 프로 세서에 대해서도 도 2와 관련하여 설명하였는바, 도 2에서 설명한 내용은 중복 기재하지 않고, 도 3에 추 가된 구성과 관련된 내용만 이하에서 설명한다. 입력 장치는 제1 가전기기에서 지원하는 각종 기능을 사용자가 설정 또는 선택할 수 있는 다수의 기 능키를 구비할 수 있다. 이를 통하여 사용자는 제1 가전기기에 대한 각종 제어 명령을 입력할 수 있다. 예 를 들어, 제1 가전기기가 세탁기인 경우, 사용자는 입력 장치를 통해 세탁기의 탈수 명령을 입력할 수 있다 메모리는 프로세서의 처리 또는 제어를 위한 프로그램 등 제1 가전기기 전반의 동작을 위한 다 양한 데이터를 저장한다. 구체적으로, 메모리는 제1 가전기기에서 구동되는 다수의 응용 프로그램, 제1 가전기기의 동작을 위한 데이터 및 명령어들을 저장할 수 있다. 그리고 메모리는 프로세서에 의해 액세스 되며, 프로세서에 의한 데이터 독취/기록/수정/삭제/ 갱신 등이 수행될 수 있다. 이러한 메모리는 제1 가전기기 내의 저장매체뿐만 아니라, 외부 저장 매 체, USB 메모리를 포함한 Removable Disk, 네트워크를 통한 웹서버(Web server) 등으로 구현될 수 있다. 그리고 메모리는 노이즈 데이터를 생성하는데 필요한 잡음 경로 추정 필터를 저장할 수 있다. 디스플레이는 제1 가전기기에서 제공되는 각종 정보를 표시할 수 있다. 구체적으로, 디스플레이(16 0)는 제1 가전기기의 동작 상태를 표시하거나, 사용자가 선택한 기능 및 옵션 선택을 위한 사용자 인터페 이스 창을 표시할 수 있다. 예를 들어, 제1 가전기기가 세탁기인 경우, 디스플레이는 세탁기가 탈수 동작을 수행하고 있음을 표 시하거나, 사용자가 탈수 기능을 몇 분 동안 동작할 것인지 선택할 수 있도록 인터페이스 창을 표시할 수 있다. 또는 디스플레이는 음성 인식 기능의 수행 결과를 표시하거나, 사용자가 음성 인식 기능에 대한 설정을 변 경할 수 있도록 인터페이스 창을 표시할 수 있다. 종래에는 전처리를 위해, 복수의 마이크를 통해 음성과 잡음이 포함된 복수의 음성 신호를 획득하고, 음성 및 잡음 각각이 입사되는 방향 및 주파수 스펙트럼이 다른 특징을 이용하여 음성과 잡음을 분리함으로써 잡음을 제거하는 빔포밍 기술을 이용하였다. 그러나 실제 환경에서 잡음의 크기가 음성의 크기에 비해 더욱 큰 경우에는 기대하는 방향성 차이나 스펙트럼 차이를 확인하기 어려워, 종래의 방식으로는 음성과 잡음의 구분이 어렵다는 문제점이 있었다. 예를 들어, 인근 에 배치된 타 가전기기로부터 큰 소음이 발생하는 경우, 종래기술만으로는 음성 인식을 위한 충분한 잡음 제거 가 어려웠다. 반면, 상술한 바와 같이 본 실시 예에 따른 제1 가전기기는 큰 소음을 발생시키는 타 가전기기로부터 해당 소음 에 대한 제2 음성 데이터를 획득하고, 획득한 제2 음성 데이터를 이용하여 전처리를 수행하는바, 외부에서 발생 한 소음의 크기가 크더라도 음성 데이터에 포함된 소음을 정확히 제거할 수 있는 효과를 갖는다. 도 4는 본 개시의 일 실시 예에 따른 제2 가전기기의 간단한 구성을 설명하기 위한 블록도이다. 도 4를 참조하면, 본 개시의 일 실시 예에 따른 제2 가전기기는 마이크, 통신 장치, 프로세서 , 모터, 가속도계, 입력 장치, 메모리로 구성될 수 있다. 마이크는 소리를 소리 신호로 바꾸는 장치로, 사용자의 발화 음성 및 주변의 소리 등을 음성 데이터로 출 력할 수 있다. 그리고 마이크는 출력한 음성 데이터를 프로세서로 전달할 수 있다. 마이크는 하우징의 표면에 배치될 수 있다. 구체적으로, 마이크는 사용자의 발화 음성을 수집하기 위 하여, 하우징의 표면에 배치되어 제2 가전기기 주변의 소리에 대응되는 제2 음성 데이터를 생성할 수 있다. 또는, 마이크는 하우징의 내부에 배치될 수 있다. 구체적으로, 마이크는 제2 가전기기 자체에서 발생하는 노이즈 소리를 수집하기 위하여, 하우징 내부(구체적으로, 모터 등 노이즈를 발생하는 잡음원(Noise Source) 주변)에 배치되어 제2 가전기기가 생성하는 소리에 대응되는 제2 음성 데이터를 생성할 수 있다. 한편, 마이크의 배치 위치는 상술한 예에 한하지 않는다. 또한, 본 개시에서는 제2 가전기기가 하나 의 마이크를 포함하는 것으로 도시하고 설명하였으나, 구현시에는 제2 가전기기가 두 개 이상의 마이크를 포함할 수 있다. 통신 장치는 외부 장치(미도시)와 연결되며, 외부 장치로부터 각종 데이터를 수신할 수 있다. 구체적으로 통신 장치는 근거리 통신망(LAN: Local Area Network) 및 인터넷망을 통해 외부 장치에 접속되는 형태뿐만 아니라, USB(Universal Serial Bus) 포트 또는 무선 통신(예를 들어, WiFi 802.11a/b/g/n, NFC, Bluetooth) 포 트를 통하여 접속되는 형태도 가능하다. 여기서 외부 장치는 PC, 노트북, 스마트폰, 서버 등일 수 있다. 그리고 통신 장치는 음성 인식 시스템 내의 제1 가전기기 또는 서버와 연결될 수 있다. 예를 들어, 블루투스 통신을 통해 음성 인식 시스템 내의 제1 가전기기와 통신을 수행할 수 있으며, 와이파이 통신을 통해 음성 인식 시스템 내의 서버와 통신을 수행할 수 있다. 한편, 제2 가전기기 가 제1 가전기기 또는 서버와 통신을 수행하는 방법은 상술한 예에 한하지 않는다. 모터는 제2 가전기기 내에 배치되어 제2 가전기기의 기능 수행과 관련된 구성을 구동시킨다. 예 를 들어, 제2 가전기기가 세탁기인 경우, 모터는 세탁물의 탈수를 위해 세탁물을 수용하는 드럼을 고 속으로 회전시킬 수 있다. 이때 모터가 드럼을 기동시키는 과정에서 진동과 소음이 유발될 수 있다. 또 다른 예로, 제2 가전기기가 냉장고인 경우, 모터는 냉매를 생성하는 냉매 압축기를 기동시킬 수 있다. 이때 모터가 냉매 압축기를 기동시키는 과정에서 진동과 소음이 유발될 수 있다. 이와 같이 모터는 제2 가전기기가 자체적으로 큰 소음을 발생시키는 경우에서의 잡음원에 해당될 수 있다. 따라서 마이크는 모터의 인근에 배치되어 모터에서 발생하는 소리를 감지하고, 그에 대응 되는 제2 음성 데이터를 생성할 수 있다. 프로세서는 제2 가전기기를 제어한다. 구체적으로, 프로세서는 사용자의 제어 명령에 따라 제2 가전기기의 각 구성을 제어할 수 있다. 예를 들어, 제2 가전기기가 세탁기인 경우, 프로세서는 탈수 명령을 수신하면 세탁물을 수용하는 드럼에 회전력을 제공하도록 모터의 동작을 제어할 수 있다 그리고 프로세서는 제2 음성 데이터에 대한 전송 요청을 수신할 수 있다. 구체적으로, 프로세서는 제 2 가전기기에 연결된 제1 가전기기 또는 서버로부터 제2 가전기기에서 발생하는 소음에 대 한 음성 데이터인 제2 음성 데이터의 생성 및 전송을 요청하는 녹음 요청 신호를 수신할 수 있다.그리고 프로세서는 수신한 요청에 대응하여 제2 음성 데이터를 획득할 수 있다. 구체적으로, 프로세서 는 수신한 녹음 요청 신호에 기초하여 마이크를 이용하여 소음을 감지하고 제2 음성 데이터를 획득할 수 있다. 보다 구체적으로, 프로세서는 수신한 녹음 요청 신호에 포함된 기설정된 시간에 대한 정보 및 기 설정된 시간 길이 정보에 기초하여 제2 음성 데이터를 획득할 수 있다. 그리고 프로세서는 획득한 제2 음성 데이터를 전송하도록 통신 장치를 제어할 수 있다. 구체적으로, 프로세서는 획득한 제2 음성 데이터를 제2 가전기기에 연결된 제1 가전기기 또는 서버에 전송할 수 있다. 이와 같이 제1 가전기기 또는 서버에 전송된 제2 음성 데이터는 제2 가전기기에서 발생한 소음 에 대한 음성 데이터이므로, 제1 가전기기에서 획득한 제1 음성 데이터에 포함된 소음을 제거하기 위한 전 처리를 수행하는데 사용될 수 있다. 예를 들어, 제2 가전기기의 잡음원이 모터인 경우, 제1 가전기기 또는 서버는 제2 음성 데 이터를 이용하여 제2 가전기기의 모터에 대한 순수한 모터 소음 데이터인 노이즈 데이터를 생성하고, 생성 한 모터 소음 데이터를 이용하여 제1 음성 데이터에서 모터 소음을 제거하는 전처리를 수행할 수 있다. 한편, 프로세서는 상술한 바와 같이 녹음 요청 신호를 수신할 때마다 제2 음성 데이터를 획득하고, 획득한 제2 음성 데이터를 전송하는 방식 외에도, 녹음 요청 신호를 수신하면, 기설정된 주기마다 제2 음성 데이터를 획득하고, 획득한 제2 음성 데이터를 전송하는 방식으로도 구현될 수 있다. 한편, 프로세서는 제2 가전기기에서 발생한 소음을 감지하여 생성한 제2 음성 데이터 외에도 소음에 대한 다른 종류의 참조 데이터를 제1 가전기기 또는 서버에 전송할 수 있다. 여기서 참조 데이터는 잡음원의 정보를 포함하는 데이터면 족하다. 그리고 잡음원의 정보란, 잡음원에서 발생하 는 진동의 크기 및 위상, 잡음원에서 발생하는 소음의 크기 및 위상, 주요 주파수 정보 등을 포함할 수 있다. 예를 들어, 프로세서는 가속도계를 통해 참조 데이터를 획득하거나 입력 장치를 통해 입력된 제 어 명령을 통해 참조 데이터를 획득하여 노이즈 데이터를 생성할 수 있다. 이에 대한 구체적인 동작은 이하에서 설명한다. 가속도계는 물체의 가속도를 측정하는 장치이다. 그리고 가속도계는 모터의 인근에 배치되어 모 터의 가속도를 측정하고, 측정된 가속도에 대한 정보를 생성할 수 있다. 그리고 프로세서는 획득한 가속도 정보로부터 모터의 동작 주파수를 추출하고, 추출한 동작 주파수를 이용하여 참조 데이터를 생성할 수 있다. 예를 들어, 가속도계로부터 획득한 가속도 정보로부터 모터의 동작 주파수로 50Hz를 추출한 경우, 프 로세서는 50Hz를 이용하여 특정 크기 및 위상을 갖는 삼각함수로 표현되는 참조 데이터를 생성할 수 있다. 입력 장치는 제2 가전기기에서 지원하는 각종 기능을 사용자가 설정 또는 선택할 수 있는 다수의 기 능키를 구비할 수 있다. 이를 통하여 사용자는 제2 가전기기에 대한 각종 제어 명령을 입력할 수 있다. 한편, 입력 장치를 통해 입력되는 제어 명령은 모터의 구동과 관련될 수 있다. 이 경우, 입력 장치 를 통해 입력되는 제어 명령에 대응되는 모터의 동작 주파수를 확인할 수 있다. 예를 들어, 제2 가전기기가 세탁기이고, 탈수 명령이 입력된 경우, 모터는 탈수 기능을 수행하기 위 해 세탁기의 드럼을 회전시킬 수 있다. 이 경우, 탈수 명령에 대응되는 모터의 동작 주파수는 50Hz인 것을 확인할 수 있다. 그리고 프로세서는 제어 명령에 대응되는 모터의 동작 주파수를 이용하여 참조 데이터를 생성할 수 있다. 한편, 입력 장치에 입력된 제어 명령뿐만 아니라 프로세서가 상황 판단에 따라 자체적으로 생성한 제 어 명령에 대해서도 동일하게 적용될 수 있다. 이와 같이, 프로세서는 마이크를 통해 획득한 제2 음성 데이터, 가속도계의 가속도 정보 또는 제어 명령으로부터 확인한 구동 주파수를 이용해 생성한 참조 데이터 중 적어도 하나를 제1 가전기기 또는 서버에 전송할 수 있다. 그리고 제1 가전기기 또는 서버는 수신한 참조 데이터를 이용하여 제2 가전기기 내 잡음원의 순수한 소음에 대응되는 소리 데이터인 노이즈 데이터를 생성할 수 있다.한편, 프로세서는 상술한 제2 음성 데이터 및 참조 데이터를 제1 가전기기 또는 서버에 전송하 지 않고, 제2 음성 데이터 및 참조 데이터를 이용하여 노이즈 데이터를 생성한 후, 생성한 노이즈 데이터를 제1 가전기기 또는 서버에 전송할 수도 있다. 이를 위해 제2 가전기기에는 잡음 경로 추정 필터가 기저장될 수 있다. 이 경우 제1 가전기기 또는 서버는 노이즈 데이터를 수신하고, 수신한 노이즈 데이터를 이용하여 제1 음성 데이터에 포함된 소음을 제거하는 전처리를 수행할 수 있다. 메모리는 프로세서의 처리 또는 제어를 위한 프로그램 등 제2 가전기기 전반의 동작을 위한 다 양한 데이터를 저장한다. 구체적으로, 메모리는 제2 가전기기에서 구동되는 다수의 응용 프로그램, 제2 가전기기의 동작을 위한 데이터 및 명령어들을 저장할 수 있다. 예를 들어, 메모리는 입력 장치를 통해 입력된 제어 명령에 대응되는 모터의 구동 주파수 정보 를 저장할 수 있다. 그리고 프로세서는 입력된 제어 명령에 대응되는 구동 주파수를 확인하고, 확인된 구 동 주파수를 이용하여 참조 데이터를 생성할 수 있다. 한편, 도 4에서는 잡음원이 모터인 것으로 도시하고 설명했으나, 구현시에는 잡음원이 모터가 아닌 팬(미도시) 또는 기타 구성 등에 해당할 수 있다. 또한, 도 4를 도시하고 설명함에 있어서, 하나의 모터를 구비하는 것으로 도시하고 설명하였으나, 구현시에는 복수의 모터를 구비할 수 있으며, 복수의 모터 각각에 대한 참조 데이터를 이용하여 소음을 추정할 수 있다. 또한, 도 4를 도시하고 설명함에 있어서, 제2 가전기기가 마이크 및 가속도계를 모두 구비하는 것으로 도시하고 설명하였으나, 구현시에는 가속도계만을 구비할 수 있으며, 가속도계를 통해 참조 데이터를 획득할 수 있다. 또 는, 마이크만을 구비할 수 있으며, 마이크를 통해 획득한 제2 음성 데이터를 획득할 수 있다. 또는, 제2 마이크 및 가속도계를 모두 구비하지 않을 수 있으며, 입력 장치를 통해 참조 데이터를 획득할 수 있다. 또한, 도 4를 도시하고 설명함에 있어서, 모터의 동작 주파수를 이용하여 참조 데이터를 생성하는 동작을 프로 세서가 수행하는 것으로 도시하고 설명하였으나, 구현시에는 동작 주파수 정보를 입력받아 정현파 신호를 생성 하는 정현파 신호 생성기(미도시)를 구비할 수 있다. 이 경우, 정현파 신호 생성기에서 생성된 신호가 참조 데 이터로써 이용될 수 있다. 또한, 도 4를 도시하고 설명함에 있어서, 제2 가전기기가 제1 가전기기와 상이한 구성을 갖는 가전기 기인 것으로 도시하고 설명하였지만, 구현시에는 제2 가전기기는 제1 가전기기와 동일한 구성을 갖는 가전기기일 수 있다. 이와 같이 제2 가전기기는 내부 잡음원의 소음에 대한 참조 데이터를 생성하고, 생성한 참조 데이터를 제1 가전 기기 또는 서버에 제공함으로써, 제1 가전기기 또는 서버가 참조 데이터를 이용하여 사용자 발화가 포함된 음성 데이터에 포함된 소음을 제거하는 전처리를 수행하도록 할 수 있다. 도 5는 본 개시의 일 실시 예에 따른 서버의 간단한 구성을 설명하기 위한 블록도이다. 도 5를 참조하면, 서버는 통신 장치, 메모리 및 프로세서로 구성될 수 있다. 서버는 클라이언트에게 네트워크를 통해 정보나 서비스를 제공하는 컴퓨터(server computer) 또는 프로그 램(server program)을 의미한다. 통신 장치는 외부 장치(미도시)와 연결되며, 외부 장치로부터 각종 데이터를 수신할 수 있다. 구체적으로 통신 장치는 근거리 통신망(LAN: Local Area Network) 및 인터넷망을 통해 외부 장치에 접속되는 형태뿐만 아니라, USB(Universal Serial Bus) 포트 또는 무선 통신(예를 들어, WiFi 802.11a/b/g/n, NFC, Bluetooth) 포 트를 통하여 접속되는 형태도 가능하다. 여기서 외부 장치는 PC, 노트북, 스마트폰, 서버 등일 수 있다. 그리고 통신 장치는 음성 인식 시스템 내의 제1 가전기기 또는 제2 가전기기와 연결될 수 있다. 예를 들어, 와이파이 통신을 통해 음성 인식 시스템 내의 제1 가전기기 또는 제2 가전기기 와 통신을 수행할 수 있다. 한편, 서버가 제1 가전기기 또는 제2 가전기기와 통신을 수행 하는 방법은 상술한 예에 한하지 않는다. 메모리는 프로세서의 처리 또는 제어를 위한 프로그램 등 서버 전반의 동작을 위한 다양한 데이 터를 저장한다. 구체적으로, 메모리는 서버에서 구동되는 다수의 응용 프로그램, 서버의 동작을위한 데이터 및 명령어들을 저장할 수 있다. 그리고 메모리는 프로세서에 의해 액세스 되며, 프로세서에 의한 데이터 독취/기록/수정/삭제/ 갱신 등이 수행될 수 있다. 이러한 메모리는 서버 내의 저장매체뿐만 아니라, 외부 저장 매체, USB 메모리를 포함한 Removable Disk, 네트워크를 통한 웹서버(Web server) 등으로 구현될 수 있다. 그리고 메모리는 복수의 가전기기의 기기정보를 저장할 수 있다. 구체적으로, 메모리는 서버에 연결된 복수의 가전기기 또는 연결된 이력이 있는 복수의 가전기기의 기기정보를 저장할 수 있다. 여기서 가전 기기의 기기정보는 시리얼 넘버 또는 UUID(Universally Unique IDentifier) 정보를 포함할 수 있으며, 포함되 는 정보는 상술한 예에 한하지 않는다. 그리고 메모리는 노이즈 데이터를 생성하는데 필요한 잡음 경로 추정 필터를 저장할 수 있다. 또는, 메모 리는 잡음 경로 추정 필터를 생성하는 인공 지능 모델을 저장할 수 있다. 한편, 인공 지능 모델을 이용하 여 잡음 경로 추정 필터를 생성하는 구체적인 동작은 도 11과 관련하여 후술한다. 프로세서는 서버를 제어한다. 구체적으로, 프로세서는 사용자의 제어 명령에 따라 서버의 각 구성을 제어할 수 있다. 그리고 프로세서는 제1 가전기기를 대신하여 제1 가전기기가 획득한 음성 데이터에 대한 전처리 를 수행할 수 있다. 구체적으로, 프로세서는 제1 가전기기로부터 제1 가전기기 주변의 소리에 대응되는 제1 음성 데이터를 수신할 수 있다. 그리고 수신한 제1 음성 데이터에 대한 전처리를 수행할 수 있다. 한편, 프로세서는 제1 가전기기의 인근에 제2 가전기기가 배치되어 큰 소음을 발생하는 경우, 제2 가전기기에서 발생하는 소음에 대한 정보를 이용하여 수신한 제1 음성 데이터에 대한 전처리를 수행할 수 있다. 이하에서는 제2 가전기기에서 발생하는 소음에 대한 정보를 이용하여 제1 음성 데이터에 대한 전처리를 수 행하는 구체적인 동작을 설명한다. 먼저, 프로세서는 제1 가전기기로부터 제1 가전기기에 연결된 제2 가전기기에 대한 정보를 수신할 수 있다. 구체적으로, 프로세서는 제1 가전기기로부터 제1 가전기기와 근거리 무선 통신 을 통해 연결 가능한 제2 가전기기 또는 제1 가전기기가 접속한 액세스 포인트(AP)에 접속한 제2 가 전기기에 대한 정보를 수신할 수 있다. 그리고 프로세서는 제2 가전기기에 연결될 수 있다. 구체적으로, 프로세서는 제1 가전기기(10 0)로부터 수신한 제2 가전기기의 정보를 이용하여 제2 가전기기와 연결할 수 있다. 그리고 프로세서는 제1 가전기기 및 제2 가전기기에 음성 데이터를 요청하도록 통신 장치 를 제어할 수 있다. 구체적으로, 프로세서는 제1 가전기기 및 제2 가전기기에 음성 데이터의 생 성 및 전송을 요청하는 녹음 요청 신호를 전송하도록 통신 장치를 제어할 수 있다. 그리고 녹음 요청 신호는 기설정된 시간에 대한 정보 및 기설정된 시간 길이에 대한 정보를 포함할 수 있다. 한 편, 녹음 요청 신호에 포함되는 정보는 상술한 예에 한하지 않는다. 그리고 프로세서는 요청에 대응하여 생성된 음성 데이터를 수신할 수 있다. 구체적으로, 프로세서는 제1 가전기기로부터 녹음 요청 신호에 대응하여 획득된 제1 음성 데이터를 수신할 수 있다. 그리고 프로세 서는 제2 가전기기로부터 녹음 요청 신호에 대응하여 획득된 제2 음성 데이터를 수신할 수 있다. 그리고 프로세서는 수신한 제2 음성 데이터를 이용하여 제2 가전기기 내 잡음원의 순수한 소음에 대 응되는 소리 데이터인 노이즈 데이터를 생성할 수 있다. 한편, 프로세서는 제2 가전기기에서 발생한 소음을 감지하여 생성한 제2 음성 데이터 외에도 소음에 대한 다른 종류의 참조 데이터를 수신할 수 있다. 예를 들어, 프로세서는 제2 가전기기의 가속도계를 통해 획득된 참조 데이터나 제2 가전기기에 입력된 제어 명령을 통해 획득된 참조 데이터를 수신할 수 있다. 여기서 참조 데이터는 잡음원에서 발생하는 진 동의 크기 및 위상, 잡음원에서 발생하는 소음의 크기 및 위상, 주요 주파수 정보 등을 포함하는 잡음원 정보를 기초로 생성될 수 있다. 그리고 프로세서는 수신한 참조 데이터를 이용하여 제2 가전기기 내 잡음원의 순수한 소음에 대응되 는 소리 데이터인 노이즈 데이터를 생성할 수 있다. 그리고 프로세서는 노이즈 데이터를 생성하기 위해 잡음 경로 추정 필터를 이용할 수 있다. 한편, 잡음 경 로 추정 필터를 이용하여 노이즈 데이터를 생성하는 구체적인 동작은 도 6 내지 도 10과 관련하여 후술한다. 한편, 프로세서는 제2 가전기기로부터 제2 음성 데이터 또는 참조 데이터를 수신하지 않고 제2 가전 기기가 생성한 노이즈 데이터 자체를 수신하는 방식으로도 구현될 수 있다. 그리고 프로세서는 노이즈 데이터를 이용하여 제1 음성 데이터에 대한 전처리를 수행할 수 있다. 구체적으 로, 프로세서는 잡음 경로 추정 필터를 통해 생성한 노이즈 데이터를 이용하여, 제1 음성 데이터에서 잡음 원의 소음에 대응되는 성분을 제거함으로써, 제1 음성 데이터에 대한 전처리를 수행할 수 있다. 그리고 프로세서는 전처리된 제1 음성 데이터를 제1 가전기기에 전송할 수 있다. 그리고 제1 가전기 기는 서버로부터 수신한 전처리된 제1 음성 데이터를 이용하여 음성 인식을 수행할 수 있다. 이와 같이 서버는 음성 인식 기능을 수행하고자 하는 제1 가전기기로부터 제1 음성 데이터를 수신하고, 큰 소음을 발생시키는 제2 가전기기로부터 해당 소음에 대한 제2 음성 데이터 또는 참조 데이터를 획득하고, 획득 한 제2 음성 데이터 또는 참조 데이터를 이용하여 제1 음성 데이터에 대한 전처리를 수행하는바, 소음의 크기가 크더라도 음성 데이터에 포함된 소음을 정확히 제거할 수 있는 효과를 갖는다. 도 6 및 도 7은 제1 실시 예에 따른 잡음 제거 방법을 설명하기 위한 도면이다. 도 6은 제1 실시 예에 따른 잡음 제거 방법을 설명하기 위한 간단한 블록도이다. 도 6을 참조하면, 참조 데이터(r), 음성 데이터(d) 및 잡음 추정 알고리즘을 이용하여 노이즈 데이터(y)를 생성 하고, 생성된 노이즈 데이터(y)를 이용하여 음성 데이터(d)의 잡음을 제거하는 것을 확인할 수 있다. 여기서 참조 데이터(r)는 제2 가전기기의 마이크를 통해 획득한 제2 음성 데이터, 제2 가전기기(20 0)의 가속도계의 가속도 정보 또는 제어 명령으로부터 확인한 구동 주파수를 이용해 생성한 참조 데이터 중 적어도 하나에 해당할 수 있다. 그리고 음성 데이터(d)는 제1 가전기기의 마이크에서 획득한 제1 음성 데이터에 대응될 수 있다. 제1 가전기기의 프로세서 또는 서버의 프로세서는 잡음 추정 알고리즘 및 참조 데이터(r) 를 이용하여 노이즈 데이터(y)를 생성할 수 있다. 구체적으로, 프로세서(130, 330)는 잡음 추정 알고리즘에 포 함된 잡음 경로 추정 필터 정보를 이용하여 참조 데이터(r)로부터 잡음원 소음에 대응되는 소리 데이터인 노이 즈 데이터(y)를 추출할 수 있다. 그리고 잡음 경로 추정 필터는 시간영역 상에서의 FIR(Finite Impulse Response) 필터 또는 IIR(Infinite Impulse Response) 필터로 구현될 수 있다. 또는, 잡음 경로 추정 필터는 주파수 영역 상에서 주파수 대역별로 기설정된 전달함수의 형태로도 구현될 수 있다. 그리고 잡음 경로 추정 필터는 상술한 예와 같이 선형적 구조를 가질 수 있으나, 이에 한정되지 않으며, 비선형 적 구조를 가질 수 있다. 이러한 잡음 경로 추정 필터는 하나로 고정되어 사용될 수 있으며, 복수의 잡음 경로 필터 정보가 기저장된 경 우에는 상황에 따라 복수의 잡음 경로 추정 필터 중 하나가 선택되어 노이즈 데이터(y)를 생성하는데 사용될 수 있다. 그리고 프로세서(130, 330)는 생성한 노이즈 데이터(y)를 이용하여 음성 데이터(d)에 포함된 잡음원의 소음에 대응되는 성분을 제거함으로써 음성 데이터(d)에 대한 전처리를 수행할 수 있다. 그리고 서버의 프로세서는 전처리를 수행하여 잡음이 제거된 음성 데이터(e)를 제1 가전기기에 전송할 수 있다. 그리고 제1 가전기기의 프로세서는 전처리를 수행하여 잡음이 제거된 음성 데이터 (e)를 이용하여 음성 인식을 수행할 수 있다. 한편, 프로세서(130, 330)는 잡음원의 소음이 변경되거나 주변 환경이 변경되더라도 정확한 노이즈 데이터(y)를 생성할 수 있도록 음성 데이터(d)를 이용하여 노이즈 데이터(y)의 생성 방식을 업데이트 할 수 있다. 구체적으로, 프로세서(130, 330)는 전처리를 수행한 이후, 잡음이 포함된 음성 데이터(d)를 이용하여 잡음 경로 필터를 업데이트할 수 있으며, 이에 대한 구체적인 설명은 도 7과 관련하여 이하에서 설명한다.도 7은 제1 실시 예에 따른 주파수 영역에서의 잡음 제거 방법을 설명하기 위한 블록도이다. 도 7을 참조하면, 주파수 영역 상에서의 잡음 경로 필터(H)를 이용하고, 잡음이 포함된 음성 데이터(d)를 이용 하여 업데이트를 수행하는 잡음 추정 알고리즘을 확인할 수 있다. 프로세서(130, 330)는 FFT(Fast Fourier Transform)를 이용하여 참조 데이터(r)를 주파수 영역으로 변환할 수 있다. 그리고 프로세서(130, 330)는 변환된 참조 데이터(R)를 잡음 경로 추정 필터(H)에 적용하여 주파수 영역 으로 변환된 노이즈 데이터(Y, Y=R·H)를 획득할 수 있다. 그리고 프로세서(130, 330)는 IFFT(Inverse Fast Fourier Transform)를 이용하여 노이즈 데이터(Y)를 시간 영역으로 변환할 수 있다. 그리고 프로세서(130, 33 0)는 변환된 노이즈 데이터(y)를 음성 데이터(d)의 잡음을 제거하는데 이용할 수 있다. 한편, 프로세서(130, 330)는 전처리를 수행한 이후, 잡음이 혼합된 음성 데이터(d)를 이용하여 잡음 경로 추정 필터(H)를 업데이트할 수 있다. 구체적으로, 프로세서(130, 330)는 잡음이 포함된 음성 데이터(d)가 FFT를 거쳐 주파수 영역으로 변환된 음성 데이터(D)와 변환된 참조 데이터(R)의 상관관계를 이용하여 잡음 경로 추정 필터 (H)를 업데이트할 수 있다. 예를 들어, k-1번째 잡음 경로 추정 필터를 H(k-1), 이후 k번째 잡음이 포함된 음성 데이터를 d(k), k번째 참조 데 이터를 r(k), k번째 주파수 영역으로 변환된 음성 데이터를 D(k), k번째 주파수 영역으로 변환된 참조 데이터를 R(k)로 가정할 수 있다. 이 경우, k번째 변환된 참조 데이터 R(k)의 Auto Correlation 값인 GRR(k) 및 k번째 참조 데이터 R(k)와 음성 데이터 D(k)의 Cross Correlation 값인 GDR(k)의 역행렬을 곱하여 새로운 잡음 경로 추정 필터 (H(k), H(k)= GRR(k)·GDR(k)(-1))를 생성할 수 있다. 여기서, GRR(k) 은 GRR(k) = (1-λ) · GRR(k-1) +λ· R(k)· R(k)H (R(k)H은 참조 데이터(R(k))의 Hermitian 행렬), GDR(k) = (1-λ)·GDR(k-1) +λ·D(k)·R(k)H이다. 그리고 λ값은 시스템에 따라 정해지는 상수를 사용하거나, 알고리즘의 안정성을 위해 가변하여 사용할 수 있다. 예를 들어, 가변하여 사용하는 경우, k번째의 λ값은 λ(k) = α·(ef(k)/(1+ef(k))일 수 있다. 그리고 f(k) = β·sqrt(V(k) - M(k)2) / |M(k)|, M(k) = (1-γ)·M(k-1)+ γ ·D(k), V(k) = (1-γ)·V(k-1)+γ·D(k)· (α, β 및 γ는 상수)으로 구현될 수 있다. 그리고 프로세서(130, 330)는 k+1번째 참조 데이터(r(k+1) 및 음성 데이터(d(k+1))를 획득하면 업데이트된 새로운 잡음 경로 추정 필터(H(k))를 이용하여 다음 참조 데이터로부터 노이즈 데이터(y(k+1))를 생성하고, 생성한 노이즈 데이터(y(k+1))를 이용하여 음성 데이터(d(k+1))로부터 노이즈를 제거할 수 있다. 한편, 잡음 경로 추정 필터(H)를 업데이트하는 방법은 상술한 예에 한하지 않는다. 예를 들어, 상술한 예에서는 잡음이 포함된 음성 데이터 및 참조 데이터를 획득할 때마다 업데이트를 수행하였으나, 기설정된 개수의 잡음이 포함된 음성 데이터 및 참조 데이터를 획득하면 업데이트를 수행하는 방식으로도 구현할 수 있다. 이 경우, 기 설정된 개수의 잡음이 포함된 음성 데이터 및 참조 데이터를 함께 이용하여 업데이트를 수행할 수 있다. 또한, 도 6 및 도 7을 도시하고 설명함에 있어서, 프로세서(130, 330)가 잡음이 포함된 음성 데이터(d)에 대한 전처리를 수행한 이후 잡음 경로 추정 필터를 업데이트하는 것으로 도시하고 설명했으나, 구현시에는 잡음 경로 추정 필터를 먼저 업데이트한 후 잡음이 포함된 음성 데이터(d)에 대한 전처리를 수행하는 방식으로 구현할 수 도 있다. 도 8 내지 도 10은 제2 실시 예에 따른 잡음 제거 방법을 설명하기 위한 도면이다. 도 8은 제2 실시 예에 따른 잡음 제거 방법을 설명하기 위한 간단한 블록도이다. 도 8을 참조하면, 참조 데이터(r), 잡음이 제거된 음성 데이터(e) 및 잡음 추정 알고리즘을 이용하여 노이즈 데 이터(y)를 생성하고, 생성된 노이즈 데이터(y)를 이용하여 음성 데이터(d)의 잡음을 제거하는 것을 확인할 수 있다. 여기서 참조 데이터(r)는 제2 가전기기의 마이크를 통해 획득한 제2 음성 데이터, 제2 가전기기(20 0)의 가속도계의 가속도 정보 또는 제어 명령으로부터 확인한 구동 주파수를 이용해 생성한 참조 데이터 중 적어도 하나에 해당할 수 있다. 그리고 음성 데이터(d)는 제1 가전기기의 마이크에서 획득한 제1 음성 데이터에 대응될 수 있다. 프로세서(130, 330)는 잡음 추정 알고리즘에 포함된 잡음 경로 추정 필터 정보를 이용하여 참조 데이터(r)로부 터 잡음원 소음에 대응되는 소리 데이터인 노이즈 데이터(y)를 추출할 수 있다. 여기서 잡음 추정 필터의 구성 은 앞선 도 7의 구성과 동일한 바, 중복 설명은 생략한다. 그리고 프로세서(130, 330)는 생성한 노이즈 데이터(y)를 이용하여 음성 데이터(d)에 포함된 잡음원의 소음에 대응되는 성분을 제거함으로써 음성 데이터(d)에 대한 전처리를 수행할 수 있다. 그리고 서버의 프로세서는 전처리를 수행하여 잡음이 제거된 음성 데이터(e)를 제1 가전기기에 전송할 수 있다. 그리고 제1 가전기기의 프로세서는 전처리를 수행하여 잡음이 제거된 음성 데이터 (e)를 이용하여 음성 인식을 수행할 수 있다. 도 8의 제2 실시 예와 도 6의 제1 실시 예의 차이점은 잡음 경로 추정 필터를 업데이트하는 방법에 있다. 구체 적으로, 제2 실시 예에서, 프로세서(130, 330)는 잡음이 포함된 음성 데이터가 아닌, 잡음이 제거된 음성 데이 터를 이용하여 노이즈 데이터의 생성 방식을 업데이트 할 수 있다. 이에 대한 구체적인 설명은 도 9 및 도 10과 관련하여 이하에서 설명한다. 도 9는 제2 실시 예에 따른 시간 영역에서의 잡음 제거 방법을 설명하기 위한 블록도이다. 도 9를 참조하면, 시간 영역 상에서 FIR 필터인 잡음 경로 필터를 이용하고, 잡음이 제거된 음성 데이터를 이용 하여 업데이트를 수행하는 잡음 추정 알고리즘을 확인할 수 있다. 프로세서(130, 330)는 참조 데이터(r)를 시간 영역 상의 잡음 경로 추정 필터(h)에 적용하여 노이즈 데이터(y, y=h*r)를 획득할 수 있다. 그리고 프로세서(130, 330)는 노이즈 데이터(y)를 이용하여 음성 데이터(d)의 잡음을 제거함으로써 잡음이 제거된 음성 데이터(e)를 획득할 수 있다. 한편, 프로세서(130, 330)는 잡음이 제거된 음성 데이터(e)를 이용하여 잡음 경로 추정 필터(h)를 업데이트할 수 있다. 구체적으로, 프로세서(130, 330)는 전처리를 수행한 이후, 잡음이 제거된 음성 데이터(e)와 참조 데이 터(r)의 상관관계를 이용하여 잡음 경로 추정 필터(h)를 업데이트할 수 있다. 예를 들어, k-1번째 잡음 경로 추정 필터를 h(k-1), k번째 잡음이 제거된 음성 데이터를 e(k), k번째 참조 데이터 를 r(k)로 가정할 수 있다. 이 경우, k번째 참조 데이터 r(k)를 잡음 경로 추정 필터 h(k-1)의 길이만큼의 버퍼 r (k)로 저장하고, 버퍼 r(k)와 k번째 잡음이 제거된 음성 데이터 e(k)를 이용하여 새로운 잡음 경로 추정 필터(h(k), h(k)=h(k-1)+μ·e(k)·r(k))를 생성할 수 있다. 여기서 μ는 시스템에 따라 정해지는 상수를 사용하거나, 알고리즘의 안정성을 위해 가변하여 사용할 수 있다. 예를 들어, 가변하여 사용하는 경우, k 번째 μ는 μ(k) = α / P(k)일 수 있다. 그리고, P(k) = (1- γ)· P(k-1)+γ· ·r(k))(α 및 γ은 상수)로 구현될 수 있다. 그리고 프로세서(130, 330)는 다음 참조 데이터(r’) 및 음성 데이터(d’)를 획득하면 업데이트된 새로운 잡음 경로 추정 필터(h’)를 이용하여 다음 참조 데이터로부터 노이즈 데이터(y’)를 생성하고, 노이즈 데이터(y’) 를 이용하여 음성 데이터(d’)의 잡음을 제거함으로써 잡음이 제거된 음성 데이터(e’)를 획득할 수 있다. 한편, 시간 영역 상의 잡음 경로 추정 필터(h)를 업데이트하는 방법은 상술한 예에 한하지 않는다. 예를 들어, 상술한 예에서는 잡음이 제거된 음성 데이터 및 참조 데이터를 획득할 때마다 업데이트를 수행하였으나, 기설정 된 개수의 잡음이 제거된 음성 데이터 및 참조 데이터를 획득하면 업데이트를 수행하는 방식으로도 구현할 수 있다. 이 경우, 기설정된 개수의 잡음이 포함된 음성 데이터 및 참조 데이터를 함께 이용하여 업데이트를 수행 할 수 있다. 한편, 잡음 경로 추정 필터(h)가 시간 영역 상의 FIR 필터가 아닌 주파수 영역 상의 주파수 대역별로 기설정된 전달함수의 형태로 구현된 필터이고, 잡음이 제거된 음성 신호(e)를 이용하여 잡음 경로 추정 필터(h)를 업데이 트 하는 것도 가능하다. 이에 대한 구체적인 설명은 도 10과 관련하여 후술한다.도 10은 제2 실시 예에 따른 주파수 영역에서의 잡음 제거 방법을 설명하기 위한 블록도이다. 도 10을 참조하면, 주파수 영역 상에서의 잡음 경로 필터를 이용하고, 잡음이 제거된 음성 데이터를 이용하여 업데이트를 수행하는 잡음 추정 알고리즘을 확인할 수 있다 프로세서(130, 330)는 FFT를 이용하여 참조 데이터(r)를 주파수 영역으로 변환할 수 있다. 그리고 프로세서 (130, 330)는 변환된 참조 데이터(R)를 잡음 경로 추정 필터(H)에 적용하여 주파수 영역으로 변환된 노이즈 데 이터(Y, Y=R·H)를 획득할 수 있다. 그리고 프로세서(130, 330)는 IFFT를 이용하여 노이즈 데이터(Y)를 시간 영 역으로 변환할 수 있다. 그리고 프로세서는 변환된 노이즈 데이터(y)를 음성 데이터(d)의 잡음을 제거하는 데 이용할 수 있다. 한편, 프로세서(130, 330)는 잡음이 제거된 음성 데이터(e)를 이용하여 주파수 영역 상의 잡음 경로 추정 필터 (H)를 업데이트할 수 있다. 구체적으로, 프로세서(130, 330)는 잡음이 제거된 음성 데이터(e)가 FFT를 거쳐 주 파수 영역으로 변환된 음성 데이터(E)와 변환된 참조 데이터(R)의 상관관계를 이용하여 잡음 경로 추정 필터 (H)를 업데이트할 수 있다. 예를 들어, k-1번째 잡음 경로 추정 필터를 H(k-1), 이후 k번째 변환된 잡음이 제거된 음성 데이터를 E(k), k번째 주파수 영역으로 변환된 참조 데이터를 R(k)라고 가정할 수 있다. 이 경우, k-1번째 잡음 경로 추정 필터 H(k-1)에 k번째 주파수 영역으로 변환된 참조 데이터 R(k)의 Hermitian 행렬과 k번째 잡음이 제거된 음성 데이터 E(k)를 곱 한 성분을 더함으로써 새로운 잡음 경로 추정 필터(H(k), H(k) = H(k-1)+μ·R(k)H·E(k))를 생성할 수 있다. 여기서 μ는 시스템에 따라 정해지는 상수를 사용하거나, 알고리즘의 안정성을 위해 가변하여 사용할 수 있다. 예를 들어, 가변하여 사용하는 경우, k번째의 μ는 μ(k) = α·(ef(k)/(1+ef(k))일 수 있다. 그리고 f(k) = β· sqrt(V(k) - |M(k)|2) / |M(k)|, M(k) = (1-γ)·M(k-1)+ γ ·D(k), V(k) = (1-γ)·V(k-1)+γ·D(k)· (α, β 및 γ는 상수)으로 구현될 수 있다. 그리고 프로세서(130, 330)는 다음 참조 데이터(r(k+1)) 및 음성 데이터(d(k+1))를 획득하면 업데이트된 새로운 잡 음 경로 추정 필터(H(k))를 이용하여 다음 참조 데이터로부터 노이즈 데이터(y(k+1))를 생성하고, 생성한 노이즈 데이터(y(k+1))를 이용하여 음성 데이터(d(k+1))로부터 노이즈를 제거할 수 있다. 한편, 잡음 경로 추정 필터(H)를 업데이트하는 방법은 상술한 예에 한하지 않는다. 예를 들어, 상술한 예에서는 잡음이 제거된 음성 데이터 및 참조 데이터를 획득할 때마다 업데이트를 수행하였으나, 기설정된 개수의 잡음이 제거된 음성 데이터 및 참조 데이터를 획득하면 업데이트를 수행하는 방식으로도 구현할 수 있다. 이 경우, 기 설정된 개수의 잡음이 포함된 음성 데이터 및 참조 데이터를 함께 이용하여 업데이트를 수행할 수 있다. 또한, 도 8 내지 도 10을 도시하고 설명함에 있어서, 프로세서(130, 330)가 잡음이 포함된 음성 데이터(d)에 대 한 전처리를 수행한 이후 잡음 경로 추정 필터를 업데이트하는 것으로 도시하고 설명했으나, 구현시에는 잡음 경로 추정 필터를 먼저 업데이트한 후 잡음이 포함된 음성 데이터(d)에 대한 전처리를 수행하는 방식으로 구현 할 수도 있다. 도 11 내지 도 13은 제3 실시 예에 따른 잡음 제거 방법을 설명하기 위한 도면이다. 잡음 경로 추정 필터에 대한 정보는 상술한 바와 같이 제1 가전기기 또는 서버에 기저장되어 노이즈 데이터를 생성하는데 사용될 수 있다. 그러나 제1 가전기기의 제조 단계에서 잡음 경로 필터가 기저장되지 않고, 제1 가전기기가 가정에 설치된 후 인공 지능 모델을 통해 생성되는 방식으로 구현될 수 있다. 또는, 서버가 인공 지능 모델을 통해 연결된 가전기기에 적합한 잡음 경로 추정 필터를 생성하는 방식으로도 구 현할 수 있다. 그리고 제1 가전기기 또는 서버는 생성된 잡음 경로 추정 필터를 이용하여 잡음 제거를 수행할 수 있 다. 이하에서는 설명의 용이를 위해 제1 가전기기가 인공 지능 모델을 포함하는 외부 장치로부터 잡음 경 로 추정 필터를 획득하는 경우를 가정하여 설명한다.도 11은 제1 가전기기가 잡음 경로 추정 필터를 획득하는 방법을 설명하기 위한 시퀀스도이다. 도 11을 참조하면, 먼저 제1 가전기기는 사용자 발화가 없는 시점에서의 음성 데이터 및 참조 데이터를 획 득할 수 있다(S1110). 구체적으로, 잡음 경로 추정 필터를 생성하기 위해서는 사용자 발화 음성이 없고 잡음원 의 소음만이 감지된 음성 데이터 및 참조 데이터를 필요로 한다. 따라서, 제1 가전기기는 음성 인식을 수 행한 결과, 사용자 발화가 없는 것으로 판단된 음성 데이터를 확인하면, 해당 음성 데이터와 동일한 시점에 획 득된 참조 데이터를 확인할 수 있다. 그리고 제1 가전기기는 획득한 음성 데이터 및 참조 데이터를 외부 장치로 전송할 수 있다(S1120). 구체적으로 제1 가전기기는 획득한 음성 데이터 및 참조 데이터를 시간 영역 상의 신호로 전송하거나 주파 수 영역으로 변환하여 외부 장치로 전송할 수 있다. 한편, 제1 가전기기가 사용자 발화가 없는 시점에서의 음성 데이터만 갖고 있는 경우, 외부 장치 또 는 제1 가전기기는 해당 시점에서의 참조 데이터를 제2 가전기기에 요청하여 획득할 수 있다. 그리고 제2 가전기기의 잡음원의 소음은, 제2 가전기기의 동작 모드나 주변 환경의 변화에 따라 상이 해질 수 있다. 따라서 각각의 경우에 적용하기 위한 잡음 경로 추정 필터를 생성할 필요가 있다. 이를 위해 제1 가전기기는 외부 장치로 정보를 전송할 시, 제2 가전기기의 동작 모드에 대한 정보나 주변 환경 에 대한 정보를 함께 전송할 수 있다. 예를 들어, 제2 가전기기가 세탁기인 경우, 동작 모드에 따라 세탁기에 포함된 모터의 회전속도가 상이할 수 있다. 따라서 동작 모드에 따라 잡음원(모터)의 소음의 크기나 특성이 상이해질 수 있다. 그러므로 제2 가전기기의 각각의 동작 모드에 대한 정보와 각각의 동작 모드로 동작 시 획득한 음성 데이 터 및 참조 데이터를 함께 전송하여, 외부 장치가 각각의 동작 모드에 적용할 수 있는 잡음 경로 추정 필 터를 생성하도록 할 수 있다. 그리고 외부 장치는 수신한 음성 데이터 및 참조 데이터를 이용하여 잡음 경로 추정 필터를 계산할 수 있 다(S1130). 구체적으로, 외부 장치는 음성 데이터 및 참조 데이터를 입력 받아, 그에 대응되는 잡음 경로 추정 필터를 출력하는 인공 지능 모델을 이용하여 잡음 경로 추정 필터를 획득할 수 있다. 여기서 인공 지능 모 델은 선형 회귀(Linear Regression) 모델일 수 있다. 그리고 외부 장치는 계산한 잡음 경로 추정 필터의 정보를 제1 가전기기로 전송할 수 있다(S1140). 한편, 제2 가전기기가 제2 음성 데이터를 획득하고, 획득한 제2 음성 데이터를 이용하여 노이즈 데이터를 생성하는 방식으로 구현된 경우에는, 제2 가전기기로 잡음 경로 추정 필터를 전송할 수 있다. 그리고 제1 가전기기는 수신한 잡음 경로 추정 필터의 정보를 저장할 수 있다(S1150). 그리고 제1 가전기기는 이후 획득한 참조 데이터와 잡음 경로 추정 필터 정보를 이용하여 노이즈 데이터를 생성하고, 생성한 노이즈 데이터를 이용하여 사용자 발화 음성이 포함된 음성 데이터의 잡음을 제거할 수 있다. 그리고 잡음이 제거된 음성 데이터를 이용하여 음성 인식 기능을 수행할 수 있다. 한편, 도 11을 도시하고 설명함에 있어서, 외부 장치는 음성 인식 시스템 외의 장치인 것으로 도시하고 설명하 였지만, 구현시에는 외부 장치는 음성 인식 시스템 내의 서버로 구현할 수 있다. 또한, 도 11을 도시하고 설명함에 있어서, 외부 장치로 음성 데이터 및 참조 데이터를 전송하고, 외부 장치로부 터 인공 지능 모델에 의해 생성된 잡음 경로 추정 필터를 수신하는 것으로 도시하고 설명하였으나, 구현시에는 제1 가전기기가 기저장된 인공 지능 모델을 이용하여 잡음 경로 추정 필터를 생성하는 방식으로 구현할 수 있다. 또는, 프로세서와 구별되는 가전기기 내 별도의 장치가 기저장된 인공 지능 모델을 이용하여 잡음 경로 추정 필 터를 생성하고, 프로세서가 생성된 잡음 경로 추정 필터를 이용하는 방식으로도 구현할 수 있다. 한편 잡음 경 로 추정 필터를 생성하는 방법은 상술한 예에 한하지 않는다. 이하에서는 인공 지능 모델을 이용하여 생성된 잡음 경로 필터를 이용하여 잡음을 제거하는 구체적인 동작을 설 명한다. 도 12는 제3 실시 예에 따른 시간 영역에서의 잡음 제거 방법을 설명하기 위한 블록도이다. 도 12를 참조하면, 시간 영역 상에서의 잡음 경로 필터(h)를 이용한 잡음 제거 방법을 확인할 수 있다. 제1 가전기기의 프로세서는 외부 장치로부터 수신한 잡음 경로 추정 필터(h)를 이용하여 잡음 제거를 수행할 수 있다. 또는, 서버가 인공 지능 모델을 이용하여 잡음 경로 추정 필터를 생성한 경우, 서 버의 프로세서는 생성한 잡음 경로 추정 필터(h)를 이용하여 잡음 제거를 수행할 수 있다. 구체적으로, 프로세서(130, 330)는 참조 데이터(r)를 잡음 경로 추정 필터(h)에 적용하여 노이즈 데이터(y, y=h*r)를 획득할 수 있다. 그리고 프로세서(130, 330)는 노이즈 데이터(y)를 이용하여 음성 데이터(d)의 잡음을 제거함으로써 잡음이 제거된 음성 데이터(e)를 획득할 수 있다. 도 13은 제3 실시 예에 따른 주파수 영역에서의 잡음 제거 방법을 설명하기 위한 블록도이다. 도 13을 참조하면, 주파수 영역 상에서의 잡음 경로 필터(H)를 이용한 잡음 제거 방법을 확인할 수 있다. 프로세서(130, 330)는 FFT를 이용하여 참조 데이터(r)를 주파수 영역으로 변환할 수 있다. 그리고 프로세서 (130, 330)는 변환된 참조 데이터(R)를 잡음 경로 추정 필터(H)에 적용하여 주파수 영역으로 변환된 노이즈 데 이터(Y, Y=R·H)를 획득할 수 있다. 그리고 프로세서(130, 330)는 노이즈 데이터(Y)를 이용하여 FFT를 통해 변환된 음성 데이터(D)의 잡음을 제거할 수 있다. 그리고 프로세서(130, 330)는 IFFT를 이용하여 잡음이 제거된 음성 데이터(E)를 시간 영역으로 변환함 으로써 잡음이 제거된 음성 데이터(e)를 획득할 수 있다. 한편, 도 12 및 도 13을 도시하고 설명함에 있어서, 잡음 경로 추정 필터에 대한 업데이트를 수행하지 않는 것으로 도시하고 설명하였지만, 구현시에는 앞서 상술한 업데이트 방법에 따라 잡음 경로 추정 필터에 대한 업데 이트를 수행하는 방식으로도 구현할 수 있다. 도 14 내지 도 16은 서버의 개입 없이 수행되는 음성 인식 방법을 설명하기 위한 시퀀스도이다. 도 14는 본 개시의 제1 실시 예에 따른 서버의 개입 없이 수행되는 음성 인식 방법을 설명하기 위한 시퀀스도이 다. 도 14를 참조하면, 먼저 제1 가전기기는 제2 가전기기에 녹음 요청 신호를 전송할 수 있다(S1410). 이때 녹음 요청 신호는 기설정된 시간에 대한 정보 및 기설정된 시간 길이에 대한 정보를 포함할 수 있다. 그리고 제1 가전기기는 녹음 요청 신호에 대응하여 제1 음성 데이터를 획득할 수 있다(S1420). 구체적으로, 제1 가전기기는 녹음 요청 신호에 포함된 기설정된 시간 정보 및 기설정된 시간 길이 정보에 기초하여 제1 음성 데이터를 획득할 수 있다. 그리고 제2 가전기기는 녹음 요청 신호에 대응하여 제2 음성 데이터를 획득할 수 있다(S1425). 구체적으로, 제2 가전기기는 녹음 요청 신호에 포함된 기설정된 시간 정보 및 기설정된 시간 길이 정보에 기초하여 제2 음성 데이터를 획득할 수 있다. 그리고 제2 가전기기는 획득한 제2 음성 데이터를 제1 가전기기에 전송할 수 있다(S1430). 그리고 제1 가전기기는 수신한 제2 음성 데이터를 이용하여 노이즈 데이터를 생성할 수 있다(S1440). 구체 적으로, 제1 가전기기는 수신한 제2 음성 데이터를 잡음 경로 추정 필터에 적용하여 제2 가전기기 내 잡음원의 순수한 소음에 대응되는 소리 데이터인 노이즈 데이터를 생성할 수 있다. 그리고 제1 가전기기는 노이즈 데이터를 이용하여 제1 음성 데이터에 대한 전처리를 수행할 수 있다 (S1450). 그리고 제1 가전기기는 잡음 경로 추정 필터를 업데이트할 수 있다(S1460). 구체적으로, 제1 가전기기 는 제2 음성 데이터와 제1 음성 데이터를 이용하여 잡음 경로 추정 필터를 업데이트하거나, 제2 음성 데이 터와 전처리된 제1 음성 데이터를 이용하여 잡음 경로 추정 필터를 업데이트할 수 있다. 한편, 잡음 경로 추정 필터를 업데이트하는 방법은 앞서 설명한바, 중복 설명은 생략한다. 그리고 제1 가전기기는 전처리된 제1 음성 데이터를 이용하여 음성 인식을 수행할 수 있다(S1470). 도 15는 본 개시의 제2 실시 예에 따른 서버의 개입 없이 수행되는 음성 인식 방법을 설명하기 위한 시퀀스도이 다. 도 15를 참조하면, 먼저 제1 가전기기는 제2 가전기기에 녹음 요청 신호를 전송할 수 있다(S1510). 그리고 제1 가전기기는 녹음 요청 신호에 대응하여 제1 음성 데이터를 획득할 수 있다(S1520). 그리고 제2 가전기기는 녹음 요청 신호에 대응하여 제2 음성 데이터를 획득할 수 있다(S1525). 그리고 제2 가전기기는 획득한 제2 음성 데이터를 제1 가전기기에 전송할 수 있다(S1530). 그리고 제1 가전기기는 제1 음성 데이터에 대한 전처리를 수행하기에 앞서, 잡음 경로 추정 필터를 업데이 트할 수 있다(S1540). 예를 들어, 도 7에서와 같이, 잡음 경로 추정 필터가 참조 데이터의 Auto Correlation 값인 GRR와 참조 데이터 와 음성 데이터의 Cross Correlation 값인 GDR에 의해 결정되는 경우(H(k)= GRR(k)·GDR(k)(-1)), GRR 및 GDR을 업데이트 함으로써, 잡음 경로 추정 필터를 업데이트할 수 있다. 또 다른 예로, 도 9에서와 같이, 잡음 경로 추정 필터가 참조 데이터의 버퍼 r과 잡음이 제거된 음성 데이터에 의해 결정되는 경우(h(k)=h(k-1)+μ(k)·e(k)·r(k), e(k)=h(k-1)*d(k), μ(k)= α / P(k), P(k) = (1- γ)·P(k-1)+γ · ·r(k)), 참조 데이터의 버퍼 r과 P(k)를 업데이트함으로써, 잡음 경로 추정 필터를 업데이트할 수 있다. 또 다른 예로, 도 10에서와 같이, 잡음 경로 추정 필터가 참조 데이터의 Hermitian 행렬과 잡음이 제거된 음성 데이터에 의해 결정되는 경우, (H(k) = H(k-1)+μ·R(k)H·E(k), E(k) =D(k)-R(k) ·H(k-1)) 참조 데이터의 Hermitian 행 렬을 업데이트함으로써, 잡음 경로 추정 필터를 업데이트할 수 있다. 그리고 제1 가전기기는 수신한 제2 음성 데이터를 이용하여 노이즈 데이터를 생성할 수 있다(S1550). 구체 적으로, 제1 가전기기는 수신한 제2 음성 데이터를 업데이트한 잡음 경로 추정 필터에 적용하여 제2 가전 기기 내 잡음원의 순수한 소음에 대응되는 소리 데이터인 노이즈 데이터를 생성할 수 있다. 그리고 제1 가전기기는 노이즈 데이터를 이용하여 제1 음성 데이터에 대한 전처리를 수행할 수 있다 (S1560). 그리고 제1 가전기기는 전처리된 제1 음성 데이터를 이용하여 음성 인식을 수행할 수 있다(S1570). 도 16은 본 개시의 제3 실시 예에 따른 서버의 개입 없이 수행되는 음성 인식 방법을 설명하기 위한 시퀀스도이 다. 도 16을 참조하면, 먼저 제1 가전기기는 제2 가전기기에 녹음 요청 신호를 전송할 수 있다(S1610). 그리고 제1 가전기기는 녹음 요청 신호에 대응하여 제1 음성 데이터를 획득할 수 있다(S1620). 구체적으로, 제1 가전기기는 녹음 요청 신호에 포함된 기설정된 시간 정보 및 기설정된 시간 길이 정보에 기초하여 제1 음성 데이터를 획득할 수 있다. 그리고 제2 가전기기는 녹음 요청 신호에 대응하여 제2 음성 데이터를 획득할 수 있다(S1625). 그리고 제2 가전기기는 제2 음성 데이터를 이용하여 노이즈 데이터를 생성할 수 있다(S1630). 구체적으로, 제2 가전기기는 제2 음성 데이터를 잡음 경로 추정 필터에 적용하여 제2 가전기기 내 잡음원의 순수 한 소음에 대응되는 소리 데이터인 노이즈 데이터를 생성할 수 있다. 여기서 잡음 경로 추정 필터는 제2 가전기 기에 기저장되었거나, 외부 장치 또는 서버의 인공 지능 모델에 의해 생성되어 제2 가전기기 로 전송된 필터일 수 있다. 그리고 제2 가전기기는 생성한 노이즈 데이터를 제1 가전기기에 전송할 수 있다(S1640). 그리고 제1 가전기기는 수신한 노이즈 데이터를 이용하여 제1 음성 데이터에 대한 전처리를 수행할 수 있 다(S1650). 그리고 제1 가전기기는 전처리된 제1 음성 데이터를 이용하여 음성 인식을 수행할 수 있다(S1660). 이와 같이 제1 가전기기는 다양한 방식으로 서버의 개입 없이 타 가전기기에서 발생하는 소음에 대한 정보 를 이용하여 소음을 추정하고, 추정한 소음을 저감할 수 있다.도 17 및 도 18은 서버의 개입에 따라 수행되는 음성 인식 방법을 설명하기 위한 시퀀스도이다. 도 17은 본 개시의 제1 실시 예에 따른 서버의 개입에 따라 수행되는 음성 인식 방법을 설명하기 위한 시퀀스도 이다. 도 17을 참조하면, 먼저 서버는 제1 가전기기에 녹음 요청 신호를 전송할 수 있다(S1710). 그리고 서 버는 제2 가전기기에 녹음 요청 신호를 전송할 수 있다(S1715). 이때 녹음 요청 신호는 기설정된 시 간에 대한 정보 및 기설정된 시간 길이에 대한 정보를 포함할 수 있다. 그리고 제1 가전기기는 녹음 요청 신호에 대응하여 제1 음성 데이터를 획득할 수 있다(S1720). 구체적으로, 제1 가전기기는 녹음 요청 신호에 포함된 기설정된 시간 정보 및 기설정된 시간 길이 정보에 기초하여 제1 음성 데이터를 획득할 수 있다. 그리고 제2 가전기기는 녹음 요청 신호에 대응하여 제2 음성 데이터를 획득할 수 있다(S1725). 구체적으로, 제2 가전기기는 녹음 요청 신호에 포함된 기설정된 시간 정보 및 기설정된 시간 길이 정보에 기초하여 제2 음성 데이터를 획득할 수 있다. 그리고 제1 가전기기는 획득한 제1 음성 데이터를 서버에 전송할 수 있다(S1730). 그리고 제2 가전기 기는 획득한 제2 음성 데이터를 서버에 전송할 수 있다(S1735). 그리고 서버는 수신한 제2 음성 데이터를 이용하여 노이즈 데이터를 생성할 수 있다(S1740). 구체적으로, 서버는 수신한 제2 음성 데이터를 잡음 경로 추정 필터에 적용하여 제2 가전기기 내 잡음원의 순수한 소음에 대응되는 소리 데이터인 노이즈 데이터를 생성할 수 있다. 그리고 서버는 노이즈 데이터를 이용하여 제1 음성 데이터에 대한 전처리를 수행할 수 있다(S1750). 그리 고 서버는 전처리한 제1 음성 데이터를 제1 가전기기에 전송할 수 있다(S1760). 그리고 서버는 잡음 경로 추정 필터를 업데이트할 수 있다(S1770). 구체적으로, 서버는 제2 음성 데 이터와 제1 음성 데이터를 이용하여 잡음 경로 추정 필터를 업데이트하거나, 제2 음성 데이터와 전처리된 제1 음성 데이터를 이용하여 잡음 경로 추정 필터를 업데이트할 수 있다. 한편, 잡음 경로 추정 필터를 업데이트하 는 방법은 앞서 설명한바, 중복 설명은 생략한다. 그리고 제1 가전기기는 전처리된 제1 음성 데이터를 이용하여 음성 인식을 수행할 수 있다(S1780). 도 18은 본 개시의 제2 실시 예에 따른 서버의 개입에 따라 수행되는 음성 인식 방법을 설명하기 위한 시퀀스도 이다. 도 18을 참조하면, 먼저 서버는 제1 가전기기에 녹음 요청 신호를 전송할 수 있다(S1810). 그리고 서 버는 제2 가전기기에 녹음 요청 신호를 전송할 수 있다(S1815). 그리고 제1 가전기기는 녹음 요청 신호에 대응하여 제1 음성 데이터를 획득할 수 있다(S1820). 그리고 제2 가전기기는 녹음 요청 신호에 대응하여 제2 음성 데이터를 획득할 수 있다(S1825). 그리고 제1 가전기기는 획득한 제1 음성 데이터를 서버에 전송할 수 있다(S1830). 그리고 제2 가전기 기는 획득한 제2 음성 데이터를 서버에 전송할 수 있다(S1835). 그리고 서버는 제1 음성 데이터에 대한 전처리를 수행하기에 앞서, 잡음 경로 추정 필터를 업데이트할 수 있다(S1840). 전처리를 수행하기에 앞서 잡음 경로 추정 필터를 업데이트하는 동작에 대한 설명은 도 15와 관련 하여 앞서 설명한바, 중복 설명은 생략한다. 그리고 서버는 수신한 제2 음성 데이터를 이용하여 노이즈 데이터를 생성할 수 있다(S1850). 구체적으로, 서버는 수신한 제2 음성 데이터를 업데이트한 잡음 경로 추정 필터에 적용하여 제2 가전기기 내 잡음 원의 순수한 소음에 대응되는 소리 데이터인 노이즈 데이터를 생성할 수 있다. 그리고 서버는 노이즈 데이터를 이용하여 제1 음성 데이터에 대한 전처리를 수행할 수 있다(S1860). 그리 고 서버는 전처리한 제1 음성 데이터를 제1 가전기기에 전송할 수 있다(S1870). 그리고 제1 가전기기는 전처리된 제1 음성 데이터를 이용하여 음성 인식을 수행할 수 있다(S1880). 이와 같이 서버는 다양한 방식으로 제2 가전기기에서 발생하는 소음에 대한 정보를 이용하여 소음을 추정하고, 제1 가전기기의 음성 데이터에서 추정한 소음을 저감할 수 있다.한편, 도 17 및 도 18을 도시하고 설명함에 있어서, 서버가 두 개의 가전기기에 연결된 것으로 도시하고 설명하였지만, 구현시에는 세 개 이상의 가전기기에 연결되어, 두 개 이상의 가전기기에서 발생하는 소음에 대 한 정보를 이용하여 소음을 추정하는 방식으로 구현될 수 있다. 도 19는 본 개시의 일 실시 예에 따른 제1 가전기기의 음성 인식 방법을 설명하기 위한 흐름도이다. 도 19를 참조하면, 먼저 제1 가전기기의 마이크를 통해 제1 음성 데이터를 획득한다(S1910). 그리고 제1 가전기기와 연결 가능한 타 가전기기를 감지할 수 있다. 구체적으로, 제1 가전기기와 근거리 무선 통신을 통해 연결 가능한 제2 가전기기 또는 제1 가전기기가 접속한 액세스 포인트(AP)에 접속한 제2 가전기기 를 감지할 수 있다. 그리고 제2 가전기기에 음성 데이터의 전송을 요청할 수 있다. 구체적으로, 제2 가전기기에서 발생하는 소음에 대한 음성 데이터인 제2 음성 데이터의 생성 및 전송을 요청하는 녹음 요청 신호를 제2 가전기기에 전송할 수 있다. 여기서 녹음 요청 신호는 기설정된 시간에 대한 정보 또는 기설정된 시간 길이에 대한 정보를 포함할 수 있다. 한편, 녹음 요청 신호에 포함될 수 있는 정보는 상술한 예에 한하지 않는다. 그리고 제2 가전기기로부터 제2 음성 데이터를 수신한다(S1920). 구체적으로, 녹음 요청 신호에 포함된 기설정 된 시간 정보 및 기설정된 시간 길이 정보에 기초하여 생성된 제2 음성 데이터를 제2 가전기기로부터 수신할 수 있다. 그리고 제2 가전기기에 전송한 요청에 대응하여 제1 음성 데이터를 획득할 수 있다. 구체적으로, 제2 가전기기 에 전송한 녹음 요청 신호에 포함된 기설정된 시간 정보 및 기설정된 시간 길이 정보에 기초하여 제1 가전기기 의 마이크를 통해 제1 음성 데이터를 획득할 수 있다. 그리고 수신한 제2 음성 데이터를 이용하여 노이즈 데이터를 생성한다(S1930). 여기서 노이즈 데이터란, 잡음원 의 소음에 대응되는 소리 데이터를 의미한다. 이러한 노이즈 데이터는 제2 음성 데이터로부터 잡음원의 소음에 대응되는 성분만을 추출하거나, 잡음원의 소음 에 대응되는 성분 외 나머지 성분을 필터링함으로써 획득될 수 있다. 그리고 노이즈 데이터는 시간영역 상의 FIR(Finite Impulse Response) 필터 또는 IIR(Infinite Impulse Response) 필터 중 적어도 하나를 이용하여 제2 음성 데이터에 포함된 잡음원에 대응되는 성분 외 나머지 성분 을 필터링 함으로써 생성될 수 있다. 또는, 노이즈 데이터는 주파수 영역 상에서 주파수 대역별로 기설정된 전달함수를 이용하여 제2 음성 데이터로 부터 잡음원의 소음에 대응되는 성분을 추출할 수 있다. 그리고 상술한 필터 또는 전달함수에 대한 정보는 제조 단계에서 가전기기에 기저장되어 노이즈 데이터를 생성 하는데 사용될 수 있으나, 이에 한정되지 않는다. 예를 들어, 외부 장치와 통신이 가능한 경우, 외부 장치와의 통신을 통해 필터 또는 전달함수에 대한 정보를 수 신하고, 수신한 필터 또는 전달함수에 대한 정보를 이용하여 노이즈 데이터를 생성할 수 있다. 이때, 외부 장치로부터 수신한 필터 또는 전달함수에 대한 정보는 외부 장치에 포함된 인공 지능 모델을 이용하 여 획득되는 정보일 수 있다. 그리고 생성된 노이즈 데이터를 이용하여 제1 음성 데이터에 대한 신호 처리를 수행한다(S1940). 구체적으로, 노이즈 데이터를 이용하여 제1 음성 데이터에 포함된 잡음원의 소음에 대응되는 성분을 제거하는 신호 처리를 수행할 수 있다. 한편, 제2 가전기기의 잡음원은, 제2 가전기기의 하우징 내부에 배치되어 제2 가전기기의 기설정된 기능을 수행 하기 위한 모터일 수 있다. 이 경우, 제2 음성 데이터는 제2 가전기기의 마이크로부터 획득된 음성 데이터일 수 있다. 그리고 노이즈 데이터는 제2 가전기기의 모터에 대한 모터 소음 데이터이고, 제1 음성 데이터에서 모터 소음을 제거함으로써 제1 음성 데이터에 대한 전처리가 수행될 수 있다. 그리고 제2 가전기기에서 소음의 발생 여부에 따라 제1 음성 데이터에 대한 신호 처리 방식을 변경할 수 있다. 예를 들어, 제2 가전기기에서 발생하는 소리가 제2 가전기기에 포함된 모터에 의해 발생하는 경우를 가정한다. 이 경우, 제2 가전기기의 모터의 구동 여부에 따라 제1 음성 데이터에 대한 전처리 방식을 변경할 수 있다. 구체적으로, 제2 가전기기에 모터의 구동 여부를 확인할 수 있다. 만약 제2 가전기기의 모터가 구동하는 경우, 제2 가전기기에서 발생하는 소음이 크므로, 상술한 방식에 따라 제2 음성 데이터를 이용하여 제1 음성 데이터에 대한 전처리를 수행할 수 있다. 반면, 제2 가전기기의 모터가 구동하지 않는 경우, 제2 가전기기에서 자체적으로 발생하는 소음이 없으므로, 제 2 음성 데이터를 이용하지 않고 제1 음성 데이터를 이용하여 바로 음성 인식을 수행하거나, 종래의 방식에 따라 제1 음성 데이터에 대한 전처리를 수행할 수 있다. 한편, 제2 가전기기의 잡음원이 모터가 아닌 팬 등에 해당하는 경우에도 동일하게 잡음원의 구동 여부에 따라 제1 음성 데이터에 대한 전처리 방식을 변경할 수 있다. 그리고 신호 처리된 제1 음성 데이터를 이용하여 음성 인식을 수행한다(S1950). 그리고 잡음원의 소음이 변경되거나 주변 환경이 변경되더라도 정확한 노이즈 데이터를 생성할 수 있도록 잡음 이 포함된 제1 음성 데이터, 신호 처리된 제1 음성 데이터 및 제2 음성 데이터 중 적어도 하나를 이용하여 노이 즈 데이터의 생성 방식을 업데이트 할 수 있다. 구체적으로, 제1 음성 데이터 및 신호 처리된 제1 음성 데이터 중 적어도 하나와 제2 음성 데이터 간의 상관 관 계를 이용하여 노이즈 데이터를 생성하는 방식을 업데이트 할 수 있다. 한편, 노이즈 데이터의 생성 방식을 업데이트하는 동작은 상술한 바와 같이 제1 음성 데이터에 대한 신호 처리 를 수행한 이후에 수행하는 방식으로 구현할 수 있으나, 제1 음성 데이터에 대한 신호 처리를 수행하기에 앞서 노이즈 데이터의 생성 방식을 먼저 업데이트하는 방식으로도 구현할 수 있다. 따라서, 본 개시의 가전기기의 음성 인식 방법은 큰 소음을 발생시키는 타 가전기기로부터 해당 소음에 대한 음 성 데이터를 획득하고, 획득한 소음에 대한 음성 데이터를 이용하여 전처리를 수행하는바, 외부에서 발생한 소 음의 크기가 크더라도 마이크를 통해 획득한 음성 데이터에 포함된 소음을 정확히 제거할 수 있는 효과를 갖는 다. 도 19와 같은 음성 인식 방법은, 도 2 또는 도 3의 구성을 가지는 가전기기 상에서도 실행될 수 있으며, 그 밖의 구성을 가지는 가전기기 상에서도 실행될 수 있다. 또한, 상술한 바와 같은 음성 인식 방법은, 상술한 바와 같은 음성 인식 방법을 실행하기 위한 적어도 하나의 실행 프로그램으로 구현될 수 있으며, 이러한 실행 프로그램은 비일시적인 판독 가능 매체에 저장될 수 있다. 비 일시적 판독 가능 매체란 레지스터, 캐쉬, 메모리 등과 같이 짧은 순간 동안 데이터를 저장하는 매체가 아니 라 반영구적으로 데이터를 저장하며, 기기에 의해 판독(reading)이 가능한 매체를 의미한다. 구체적으로는, 상 술한 다양한 애플리케이션 또는 프로그램들은 CD, DVD, 하드 디스크, 블루레이 디스크, USB, 메모리카드, ROM 등과 같은 비일시적 판독 가능 매체에 저장되어 제공될 수 있다. 도 20은 본 개시의 일 실시 예에 따른 제2 가전기기의 음성 인식 방법을 설명하기 위한 흐름도이다. 도 20을 참조하면, 먼저 음성 데이터 요청 신호를 수신할 수 있다(S2010). 구체적으로, 제2 가전기기에 연결된 제1 가전기기 또는 서버로부터 제2 가전기기에서 발생하는 소음에 대한 음성 데이터인 제2 음성 데이터의 생성 및 전송을 요청하는 녹음 요청 신호를 수신할 수 있다. 그리고 제2 가전기기의 마이크를 통해 제2 음성 데이터를 획득할 수 있다(S2020). 구체적으로, 수신한 녹음 요 청 신호에 기초하여 제2 가전기기의 마이크를 이용하여 소음을 감지하고 제2 음성 데이터를 획득할 수 있다. 보 다 구체적으로, 수신한 녹음 요청 신호에 포함된 기설정된 시간에 대한 정보 및 기설정된 시간 길이 정보에 기 초하여 제2 음성 데이터를 획득할 수 있다. 그리고 획득한 제2 음성 데이터를 전송할 수 있다(S2030). 구체적으로, 획득한 제2 음성 데이터를 제2 가전기기 에 연결된 제1 가전기기 또는 서버에 전송할 수 있다. 한편, 제2 음성 데이터를 제2 가전기기와 연결된 제1 가전기기 또는 서버에 전송하지 않고, 제2 음성 데이터를 이용하여 노이즈 데이터를 생성한 후, 생성한 노이즈 데이터를 제1 가전기기 또는 서버에 전송할 수도 있다. 따라서, 본 개시의 가전기기의 음성 인식 방법은 내부 잡음원의 소음에 대한 참조 데이터를 생성하고, 생성한 참조 데이터를 음성 인식 기능을 수행하고자 하는 가전기기 또는 서버에 제공함으로써, 가전기기 또는 서버가 참조 데이터를 이용하여 사용자 발화가 포함된 음성 데이터에 포함된 소음을 정확히 제거하도록 하는 효과를 갖는다. 도 20과 같은 음성 인식 방법은, 도 4의 구성을 가지는 가전기기 상에서도 실행될 수 있으며, 그 밖의 구 성을 가지는 가전기기 상에서도 실행될 수 있다. 또한, 상술한 바와 같은 음성 인식 방법은, 상술한 바와 같은 음성 인식 방법을 실행하기 위한 적어도 하나의 실행 프로그램으로 구현될 수 있으며, 이러한 실행 프로그램은 비일시적인 판독 가능 매체에 저장될 수 있다. 도 21은 본 개시의 일 실시 예에 따른 서버의 음성 인식 방법을 설명하기 위한 흐름도이다. 도 21을 참조하면, 먼저 제1 가전기기 및 제2 가전기기에 음성 데이터를 요청할 수 있다(S2110). 구체적으로, 제1 가전기기 및 제2 가전기기에 음성 데이터의 생성 및 전송을 요청하는 녹음 요청 신호를 전송할 수 있다. 그리고 녹음 요청 신호는 기설정된 시간에 대한 정보 및 기설정된 시간 길이에 대한 정보를 포함할 수 있다. 한 편, 녹음 요청 신호에 포함되는 정보는 상술한 예에 한하지 않는다. 그리고 제1 음성 데이터 및 제2 음성 데이터를 수신할 수 있다(S2120). 구체적으로, 제1 가전기기로부터 녹음 요청 신호에 대응하여 획득된 제1 음성 데이터를 수신할 수 있다. 그리고 제2 가전기기로부터 녹음 요청 신호에 대응하여 획득된 제2 음성 데이터를 수신할 수 있다. 그리고 제2 음성 데이터를 이용하여 노이즈 데이터를 생성할 수 있다(S2130). 여기서 노이즈 데이터는 제2 가전 기기 내 잡음원의 순수한 소음에 대응되는 소리 데이터를 의미한다. 한편, 노이즈 데이터의 생성 방법은 앞서 설명한바, 중복 설명은 생략한다. 그리고 노이즈 데이터를 이용하여 제1 음성 데이터에 대한 신호 처리를 수행할 수 있다(S2140). 구체적으로, 노 이즈 데이터를 이용하여 제1 음성 데이터에 포함된 잡음원의 소음에 대응되는 성분을 제거하는 신호 처리를 수 행할 수 있다. 그리고 신호 처리된 제1 음성 데이터를 제1 가전기기에 전송할 수 있다(S2150). 따라서, 본 개시의 서버의 음성 인식 방법은 음성 인식 기능을 수행하고자 하는 제1 가전기기로부터 제1 음성 데이터를 수신하고, 큰 소음을 발생시키는 제2 가전기기로부터 해당 소음에 대한 제2 음성 데이터 또는 참조 데 이터를 획득하고, 획득한 제2 음성 데이터 또는 참조 데이터를 이용하여 제1 음성 데이터에 대한 전처리를 수행 하는바, 소음의 크기가 크더라도 음성 데이터에 포함된 소음을 정확히 제거할 수 있는 효과를 갖는다. 도 21과 같은 음성 인식 방법은, 도 5의 구성을 가지는 서버 상에서도 실행될 수 있으며, 그 밖의 구성을 가지는 서버 상에서도 실행될 수 있다. 또한, 상술한 바와 같은 음성 인식 방법은, 상술한 바와 같은 음성 인식 방법을 실행하기 위한 적어도 하나의 실행 프로그램으로 구현될 수 있으며, 이러한 실행 프로그램은 비일시적인 판독 가능 매체에 저장될 수 있다. 이상에서는 본 개시의 바람직한 실시 예에 대해서 도시하고, 설명하였으나, 본 개시는 상술한 특정의 실시 예에"}
{"patent_id": "10-2018-0170469", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "한정되지 아니하며, 청구범위에서 청구하는 본 개시의 요지를 벗어남이 없이 당해 개시가 속하는 기술분야에서 통상의 지식을 가진 자라면 누구든지 다양한 변형 실시가 가능한 것은 물론이고, 그와 같은 변경은 청구범위 기 재의 범위 내에 있게 된다."}
{"patent_id": "10-2018-0170469", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시 예에 따른 음성 인식 시스템을 도시한 도면, 도 2는 본 개시의 일 실시 예에 따른 제1 가전기기의 간단한 구성을 설명하기 위한 블록도, 도 3은 본 개시의 일 실시 예에 따른 제1 가전기기의 구체적인 구성을 도시한 블록도, 도 4는 본 개시의 일 실시 예에 따른 제2 가전기기의 간단한 구성을 설명하기 위한 블록도, 도 5는 본 개시의 일 실시 예에 따른 서버의 간단한 구성을 설명하기 위한 블록도, 도 6 및 도 7은 제1 실시 예에 따른 잡음 제거 방법을 설명하기 위한 도면, 도 8 내지 도 10은 제2 실시 예에 따른 잡음 제거 방법을 설명하기 위한 도면, 도 11 내지 도 13은 제3 실시 예에 따른 잡음 제거 방법을 설명하기 위한 도면, 도 14 내지 도 16은 제1 실시 예에 따른 음성 인식 방법을 설명하기 위한 시퀀스도, 도 17 및 도 18은 제2 실시 예에 따른 음성 인식 방법을 설명하기 위한 시퀀스도, 도 19는 본 개시의 일 실시 예에 따른 제1 가전기기의 음성 인식 방법을 설명하기 위한 흐름도,도 20은 본 개시의 일 실시 예에 따른 제2 가전기기의 음성 인식 방법을 설명하기 위한 흐름도, 그리고, 도 21은 본 개시의 일 실시 예에 따른 서버의 음성 인식 방법을 설명하기 위한 흐름도이다."}
