{"patent_id": "10-2023-0091282", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0010975", "출원번호": "10-2023-0091282", "발명의 명칭": "비즈니스 중개 서비스 제공 시스템 및 방법", "출원인": "김민재", "발명자": "김민재"}}
{"patent_id": "10-2023-0091282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "비즈니스 중개 서비스 제공 시스템에 있어서,텍스트, 그래픽, 영상, 이미지를 포함하는 생산품 시안 정보를 업로드하는 생산자 단말;시안 정보 검토 후, 구입 또는 계약하려는 시안 정보를 선택하고 선택한 시안 정보에 대한 가격과 조건 정보를전송하는 기업 단말;상기 생산자 단말로부터 시안정보를 수집하여 기업 단말로 제공하고, 기업 단말로부터 기업에서 제안하는 가격및 조건 정보를 수집하여 생산자 단말로 제공하는 서버; 를 포함하고,상기 서버; 는생산자 단말에서 계약을 희망하는 기업 단말을 선택하는 경우, 상기 기업 단말로 생산자 정보를 전송하는 것을특징으로 하는 비즈니스 중개 서비스 제공 시스템."}
{"patent_id": "10-2023-0091282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 서버; 는생산자 정보, 생산품 시안정보, 생산자의 희망 계약정보, 기업정보, 기업체의 비즈니스 조건정보 및 딥러닝 모델의 학습정보를 수집하는 수집부;DNN(Deep Neural Network), CNN(Convolutional Neural Network) RNN(Recurrent Neural Network) 및BRDNN(Bidirectional Recurrent Deep Neural Network) 중 적어도 하나를 포함하는 딥러닝 뉴럴 네트워크를 상기 학습정보로 학습시켜 비즈니스 매칭 모델을 구현하는 딥러닝부;시안정보에 대한 생산자의 희망 계약 정보와 기업체에서 제안한 비즈니스 조건 정보를 비교하여, 비교 결과에따라 매칭 우선 순위 업체 리스트를 생성하는 업체 순위 생성부;기업체에서 제안한 비즈니스 조건 정보와, 기업에서 희망하는 시안정보를 기반으로 수집된 시안정보를 추출하는추천부; 를 포함하는 것을 특징으로 하는 비즈니스 중개 서비스 제공 시스템."}
{"patent_id": "10-2023-0091282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 서버; 는우선 순위 업체 리스트를 생산자 단말로 제공하고, 생산자 단말에서 계약 업체를 선택하는 경우, 선택된 계약업체로 생산자 정보를 제공하는 제1매칭부; 를 더 포함하는 것을 특징으로 하는 비즈니스 중개 서비스 제공 시스템."}
{"patent_id": "10-2023-0091282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서, 상기 서버; 는비즈니스 계약 정보를 노출한 기업체로 지원한 시안정보를 수집하여 기업 단말로 제공하고, 기업 단말에서 비즈니스 계약을 희망하는 시안정보를 선택하면, 선택된 시안정보를 업로드한 생산자 단말로 계약 수락 메시지를 전송하는 제2매칭부; 를 더 포함하는 것을 특징으로 하는 비즈니스 중개 서비스 제공 시스템. 공개특허 10-2025-0010975-3-청구항 5 제2항에 있어서, 상기 서버; 는생산자와 기업체 간 비즈니스 계약이 성사된 경우, 비즈니스 계약 조건, 기간을 포함하는 계약정보를 기재한 계약서를 생성하고 공증하는 생성부; 를 더 포함하는 것을 특징으로 하는 비즈니스 중개 서비스 제공 시스템"}
{"patent_id": "10-2023-0091282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제2항에 있어서, 상기 서버; 는기업 단말에서 희망하는 시안의 종류와 조건을 기재한 시안 모집 공고를 게시하는 경우, 공고 게시물 열람권을구매한 생산자 단말로, 상기 공고 게시물을 전송하는 제공부; 를 더 포함하는 것을 특징으로 하는 비즈니스 중개 서비스 제공 시스템."}
{"patent_id": "10-2023-0091282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "비즈니스 중개 서비스 제공 방법에 있어서,(A) 생산자 단말에서 텍스트, 그래픽, 영상, 이미지를 포함하는 생산품 시안 정보를 업로드하는 단계;(B) 기업 단말에서 시안 정보 검토 후, 구입 또는 계약하려는 시안 정보를 선택하고 선택한 시안 정보에 대한가격과 조건 정보를 전송하는 단계;(C) 서버에서 상기 생산자 단말로부터 시안정보를 수집하여 기업 단말로 제공하고, 기업 단말로부터 기업에서제안하는 가격 및 조건 정보를 수집하여 생산자 단말로 제공하는 단계; 및(D) 서버에서 생산자 단말에서 계약을 희망하는 기업 단말을 선택하는 경우, 상기 기업 단말로 생산자 정보를전송하는 단계; 를 포함하는 비즈니스 중개 서비스 제공 방법."}
{"patent_id": "10-2023-0091282", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "실시예에 따른 비즈니스 중개 서비스 제공 시스템 및 방법은 생산자 단말로부터 다양한 생산품 시안을 수집하고 이를 기업체 관계자에게 제공하여, 기업체가 충분한 데이터베이스를 통해 비즈니스 협력을 희망하는 생산자를 선 택할 수 있도록 한다. 또한, 실시예를 통해 생산자는 여러 기업체에서 제시하는 가격과 조건을 직접 비교하고 선 택함으로써, 비즈니스 계약이 보다 합리적으로 이루어 질 수 있도록 한다. 실시예를 통해, 기업 및 개인 고객이 제공하는 수수료로 영업이익을 창출하고, 시안정보의 보안성을 향상시킬 수 있다."}
{"patent_id": "10-2023-0091282", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 비즈니스 중개 서비스 제공 시스템 및 방법에 관한 것으로 구체적으로, 기업과 기업, 기업과 개 인 간 합리적인 비즈니스 매칭 서비스를 제공하는 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2023-0091282", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "본 명세서에서 달리 표시되지 않는 한, 이 섹션에 설명되는 내용들은 이 출원의 청구항들에 대한 종래 기술이 아니며, 이 섹션에 포함된다고 하여 종래 기술이라고 인정되는 것은 아니다. 비즈니스 중개 시스템은 중개인을 통해 두 개 이상의 비즈니스 주체 사이의 거래를 중개하는 시스템이다. 비즈 니스 중개 시스템은 일반적으로 기업 간 거래, 제품 판매, 서비스 제공 및 기타 유사한 거래를 중개한다. 또한, 비즈니스 중개 시스템은 구매자와 판매자를 연결하여 거래를 수행한다. 이를 위해 중개인은 구매자와 판매자 사 이에서 협상을 조율하고 거래 과정에서 발생하는 문제를 해결한다. 비즈니스 중개 시스템은 인터넷을 통해 운영 될 수 있고, 회원 가입과 인증, 거래 검색 및 매칭, 결제 처리 및 트러블슈팅과 같은 기능을 제공한다. 하지만, 종래의 비즈니스 중개 시스템은 거래의 중개 역할을 수행하므로 중개인은 거래에서 수수료를 받는데, 중개 수수료는 상대적으로 높은 경우가 많아 기업과 소비자 모두에게 부담이 될 수 있다. 또한, 비즈니스 거래 는 일반적으로 판매자나 구매자 측이 상대방에 대한 정보를 더 많이 가지고 있는 경우가 많으므로 정보 비대칭 성으로 인해, 거래에서 불공정한 결과를 초래할 수 있다. 아울러, 중개인 역시 이러한 정보 비대칭성으로 인해 거래를 조율하는 것이 어려울 수 있다. 또한, 종래의 비즈니스 중개 시스템에서는 중개인이 거래의 중간에서 개 입하기 때문에, 거래의 불완전성 문제가 발생할 수 있다. 예를 들어, 중개인이 거래 조율 중 중단되거나, 중개 인이 거래를 조작하는 경우 등이 발생할 수 있다. 또한, 비즈니스 거래는 비즈니스 비밀과 같은 중요한 정보를다루기 때문에, 거래의 보안 문제가 매우 중요하다. 하지만, 종래의 중개 시스템은 사용자 인증과 데이터 보안 등의 보안 이슈에 취약한 문제가 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 1. 한국 특허공개 제10-2016-0127976호 (2016.11.07) (특허문헌 0002) 2. 한국 특허공개 제10-2022-0138951호 (2022.10.14)"}
{"patent_id": "10-2023-0091282", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "실시예에 따른 비즈니스 중개 서비스 제공 시스템 및 방법은 생산자 단말에서 이미지, 텍스트, 영상, 제품정보 를 포함하는 생산품 시안 정보를 업로드 하면, 기업 단말에서 생산품 시안 정보를 검토하고 희망 견적을 업로드 한다. 실시예에서 생산자 단말은 기업 단말에서 업로드한 희망견적과 조건을 검토하고, 계약하고자 하는 기업을 선택하면, 서버는 선택한 기업 단말로 생산자 정보 및 계약 요청 메시지를 전송하여 기업과 생산자의 비즈니스 관계를 중개한다."}
{"patent_id": "10-2023-0091282", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "실시예에 따른 비즈니스 중개 서비스 제공 시스템은 텍스트, 그래픽, 영상, 이미지를 포함하는 생산품 시안 정 보를 업로드하는 생산자 단말; 시안 정보 검토 후, 구입 또는 계약하려는 시안 정보를 선택하고 선택한 시안 정 보에 대한 가격과 조건 정보를 전송하는 기업 단말; 생산자 단말로부터 시안정보를 수집하여 기업 단말로 제공 하고, 기업 단말로부터 기업에서 제안하는 가격 및 조건 정보를 수집하여 생산자 단말로 제공하는 서버; 를 포 함하고, 서버; 는 생산자 단말에서 계약을 희망하는 기업 단말을 선택하는 경우, 상기 기업 단말로 생산자 정보 를 전송한다. 실시예에서 서버; 는 생산자 정보, 생산품 시안정보, 생산자의 희망 계약정보, 기업정보, 기업체의 비즈니스 조 건정보 및 딥러닝 모델의 학습정보를 수집하는 수집부; DNN(Deep Neural Network), CNN(Convolutional Neural Network) RNN(Recurrent Neural Network) 및 BRDNN(Bidirectional Recurrent Deep Neural Network) 중 적어도 하나를 포함하는 딥러닝 뉴럴 네트워크를 상기 학습정보로 학습시켜 비즈니스 매칭 모델을 구현하는 딥러닝부; 시안정보에 대한 생산자의 희망 계약 정보와 기업체에서 제안한 비즈니스 조건 정보를 비교하여, 비교 결과에 따라 매칭 우선 순위 업체 리스트를 생성하는 업체 순위 생성부; 기업체에서 제안한 비즈니스 조건 정보와, 기 업에서 희망하는 시안정보를 기반으로 수집된 시안정보를 추출하는 추천부; 를 포함한다."}
{"patent_id": "10-2023-0091282", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상에서와 같은 비즈니스 중개 서비스 제공 시스템 및 방법은 생산자 단말로부터 다양한 생산품 시안을 수집하 고 이를 기업체 관계자에게 제공하여, 기업체가 충분한 데이터베이스를 통해 비즈니스 협력을 희망하는 생산자 를 선택할 수 있도록 한다. 또한, 실시예를 통해 생산자는 여러 기업체에서 제시하는 가격과 조건을 직접 비교하고 선택함으로써, 비즈니스 계약이 보다 합리적으로 이루어 질 수 있도록 한다. 실시예를 통해, 기업 및 개인 고객이 제공하는 수수료로 영업이익을 창출하고, 시안정보의 보안성을 향상시킬 수 있다."}
{"patent_id": "10-2023-0091282", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과는 상기한 효과로 한정되는 것은 아니며, 본 발명의 상세한 설명 또는 특허청구범위에 기재된 발 명의 구성으로부터 추론 가능한 모든 효과를 포함하는 것으로 이해되어야 한다."}
{"patent_id": "10-2023-0091282", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시 예들에 한정되는 것이 아니라 서 로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시 예들은 본 발명의 개시가 완전하도록 하고, 본 발명이"}
{"patent_id": "10-2023-0091282", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "속하는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 명세서 전체에 걸쳐 동일 도면부호는 동일 구성 요소를 지칭한다. 본 발명의 실시 예들을 설명함에 있어서 공지 기능 또는 구성에 대한 구체적인 설명이 본 발명의 요지를 불필요 하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명을 생략할 것이다. 그리고 후술되는 용어들은 본 발명의 실시 예에서의 기능을 고려하여 정의된 용어들로서 이는 사용자, 운용자의 의도 또는 관례 등에 따라 달라질 수 있다. 그러므로 그 정의는 본 명세서 전반에 걸친 내용을 토대로 내려져야 할 것이다. 도 1은 실시예에 따른 비즈니스 중개 서비스 제공 시스템 구성을 나타낸 도면이다. 도 1을 참조하면, 실시예에 따른 비즈니스 중개 서비스 제공 시스템은 생산자 단말, 기업 단말 및 서 버를 포함하여 구성될 수 있다. 생산자 단말은 생산품 시안 정보를 서버에 업로드 한다. 실시예에서 생산품 시안 정보는 생산자에 의해 생 산된 생산품의 디지털 정보로서, 텍스트, 그래픽, 영상, 이미지 등을 포함할 수 있고 이에 한정하지 않는다. 기 업 단말은 서버에 수집된 시안 정보 검토 후, 구입 또는 계약하려는 시안 정보를 선택하고 선택한 시 안 정보에 대한 가격, 조건 정보를 서버로 전송한다. 서버는 생산자 단말로부터 시안정보를 수집하여 기업 단말로 제공하고, 기업 단말로부터 비즈니스 계약을 위해 기업에서 제안하는 가격 및 조건 정보를 수집하여 생산자 단말로 제공한다. 실시예 에서 서버는 생산자 단말에서 계약을 희망하는 기업 단말을 선택하는 경우, 기업 단말로 생산자 정보 및 생산자 단말 정보를 전송한다. 실시예에서 서버는 프로그램을 생성하거나 수행하는 컴퓨터 장치를 포함할 수 있고, 컴퓨터 장치는 스마트 단말, 태블릿 등 핸드 핼드 기반의 무선통신 장치를 포함할 수 있다. 또한, 실시예에서 단말은 스마트폰, 스마 트 패드, 컴퓨터, 노트북 등 무선통신 기반의 전자장치를 포함할 수 있다. 실시예에 따른 비즈니스 중개 서비스 제공 시스템 및 방법은 생산자 단말에서 이미지, 텍스트, 영상, 제품정보 를 포함하는 생산품 시안 정보를 업로드 하면, 기업 단말에서 생산품 시안 정보를 검토하고 희망 견적을 업로드 한다. 실시예에서 생산자 단말은 기업 단말에서 업로드한 희망견적과 조건을 검토하고, 계약하고자 하는 기업을 선택하면, 서버는 선택한 기업 단말로 생산자 정보 및 계약 요청 메시지를 전송하여 기업과 생산자의 비즈니스 관계를 중개한다. 도 2는 실시예에 따른 서버의 데이터 처리 구성을 나타낸 도면이다. 도 2를 참조하면, 실시예에 따른 서버는 수집부, 전처리부, 딥러닝부, 업체 순위 생성부 , 추천부, 제1매칭부, 제2매칭부, 생성부, 제공부 및 피드백부를 포함하 여 구성될 수 있다. 본 명세서에서 사용되는 '부' 라는 용어는 용어가 사용된 문맥에 따라서, 소프트웨어, 하드 웨어 또는 그 조합을 포함할 수 있는 것으로 해석되어야 한다. 예를 들어, 소프트웨어는 기계어, 펌웨어 (firmware), 임베디드코드(embedded code), 및 애플리케이션 소프트웨어일 수 있다. 또 다른 예로, 하드웨어는 회로, 프로세서, 컴퓨터, 집적 회로, 집적 회로 코어, 센서, 멤스(MEMS; Micro-Electro-Mechanical System),수동 디바이스, 또는 그 조합일 수 있다. 수집부는 생산자 정보, 생산품 시안정보, 생산자의 희망 계약정보, 기업정보, 기업체의 비즈니스 조건정보 및 딥러닝 모델의 학습정보를 수집한다. 실시예에서 생산자 정보는 제품을 생산하는 생산자의 개인정보, 연락처, 프로필 정보 등을 포함할 수 있다. 생산품 시안 정보는 생산자에 의해 생산된 생산품의 디지털 정보로 서, 텍스트, 영상, 그래픽, 이미지 등을 포함할 수 있다. 생산자의 희망 계약 정보는 생산품의 판매 가격, 이용 금액 및 계약 기간 등 생산자가 생산품을 제공하거나 위임하는 비즈니스 계약 시 희망하는 계약 조건 정보이다. 기업정보는 기업 담당자 연락처, 업체명, 계약하길 희망하는 생산자 정보 및 생산품 종류, 비즈니스 계약 조건 등을 포함할 수 있다. 실시예에서 딥러닝 모델의 학습 정보는 비즈니스 매칭 모델의 학습에 필요한 정보이다. 실시예에서 학습 정보는 입력 데이터와 출력 데이터 쌍의 형태로 구성될 수 있다. 예컨대, 비지니스 매칭 모델 은 기업과 생산자 간의 유사성을 평가하기 위해 기업의 프로필, 생산품 또는 서비스 등에 대한 입력정보와 입력 정보를 모델에 입력하여 획득한 출력정보를 포함할 수 있다. 또한 학습정보는 레이블을 포함할 수 있다. 레이블 은 두 기업 간의 매칭 점수에 대한 실제 값을 나타내며, 모델 학습 시 사용되는 손실 함수를 계산하는 데 사용 된다. 또한, 학습정보는 모델 구조, 하이퍼파라미터 및 최적화 알고리즘 등을 포함할 수 있다. 전처리부는 수집된 인공지능 학습데이터 중 편향성이나 차별성을 가진 데이터를 제거하기 위해, 수집된 학 습데이터를 전처리한다. 실시예에서 전처리부는 수집된 데이터를 전처리하여 인공지능 모델 학습에 적합한 형태로 가공한다. 예컨대, 전처리부는 노이즈 제거, 이상치 제거, 결측치 처리 등의 과정을 수행할 수 있 다. 또한, 전처리부는 데이터 전처리를 통해 데이터를 정규화하거나, 이상치를 제거하거나, 데이터의 배율 조정 등을 수행하여 모델이 불필요한 패턴을 학습하는 것을 방지할 수 있다. 또한, 전처리부는 서버에 수 집된 시안정보의 불법적인 캡쳐 및 복사를 방지하고, 시안정보를 업로드한 생산자 정보에 익명성 정보를 부가하 여 생산자 정보 유출을 방지할 수 있도록 한다. 딥러닝부는 딥러닝 뉴럴 네트워크를 학습정보로 학습시켜 비즈니스 매칭 모델을 구현한다. 실시예에서 비 즈니스 매칭 모델은 생산자의 조건을 만족시키는 최적 기업과 기업에서 찾는 최적 생산자를 매칭시키는 딥러닝 모델이다. 또한, 실시예에 따른 비즈니스 매칭 모델은 비지니스 매칭 모델은 내부 데이터를 사용하여 기업과 생 산자간 매칭을 찾는 모델로서, 기업이 가지고 있는 내부 데이터(예컨대, 고객, 매출, 제품 정보 등)를 분석하여 유사성을 평가한다. 또한, 비즈니스 매칭 모델은 외부 데이터를 사용하여 기업과 생산자 간 매칭을 찾을 수 있 다. 이 경우, 비즈니스 디렉토리, 뉴스, 소셜 미디어 등과 같은 외부 소스에서 데이터를 수집하여 분석한다. 비 지니스 매칭 모델은 기업이 파트너십을 맺거나 공급업체를 선택할 때, 비지니스 매칭 모델을 사용하여 최적의 선택을 도출할 수 있도록 한다. 실시예에서 딥러닝 뉴럴 네트워크는 DNN(Deep Neural Network), CNN(Convolutional Neural Network) RNN(Recurrent Neural Network) 및 BRDNN(Bidirectional Recurrent Deep Neural Network) 중 적어도 하나를 포함할 수 있고, 이에 한정하지 않는다. 업체 순위 생성부는 시안정보에 대한 생산자의 희망 계약 정보와 기업체에서 제안한 비즈니스 조건 정보를 비교하여, 비교 결과에 따라 매칭 우선 순위 업체 리스트를 생성한다. 예컨대, 업체 순위 생성부는 생산자 의 희망 계약 정보와 비즈니스 조건 정보에 포함된 가격, 계약기간, 계약 가격, 위임 권리 등의 항목 각각을 비 교하고, 항목 각각의 유사도에 따라 매칭 우선 순위 업체 리스트를 생성할 수 있다. 실시예에서 업체 순위 생성 부는 항목 각각의 유사도를 모두 합한 전체 유사도 순위에 기반하여 매칭 우선 순위 업체 리스트를 생성할 수 있다. 또한, 업체 순위 생성부는 각 항목에 생산자가 설정한 가중치를 반영하고, 가중치가 반영된 항목 별 유사도를 모두 합한 전체 유사도를 산출하고, 산출된 가중치 기반 전체 유사도에 따라 매칭 우선 순위 업체 리스트를 생성할 수 있다. 추천부는 기업체에서 제안한 비즈니스 조건 정보와, 기업에서 희망하는 시안정보를 기반으로 수집된 시안 정보를 추출한다. 실시예에서 추천부는 업체에서 요구하는 생산품을 취급하는 생산자를 추출하고, 추출된 생산자 중 기업에서 제안하는 비즈니스 조건 정보와 일정 수준 이상 유사한 생산자를 선별할 수 있다. 이후 선 별된 생산자의 시안 정보를 업체 단말로 제공한다. 실시예에서 추천부는 생산자의 프로필 정보, 계약 히스 토리 정보에 따라 우수한 생산자를 파악하여 업체 단말로 추천할 수 있다. 제1매칭부는 우선 순위 업체 리스트를 생산자 단말로 제공하고, 생산자 단말에서 계약 업체를 선택하는 경 우, 선택된 계약 업체로 생산자 정보를 제공한다. 즉, 실시예에서 제1매칭부는 생산자가 주체가 되어 기업 을 선택하도록 하고, 생산자가 선택한 기업과 비즈니스 매칭을 수행한다. 실시예에서 생산자 정보는 연락처, 이 름, 이메일 주소 등을 포함할 수 있다. 또한, 제1매칭부는 우선순위 업체 중 최고의 비즈니스 조건 동일하게 제시한 업체가 복수개인 경우, 우선 순위 업체 리스트에 포함된 기업에 조건 변경 기회를 제공하고, 변경된 조건 정보를 생산자 단말에 제공할 수 있다. 제2매칭부는 비즈니스 계약 정보를 노출한 기업체로 지원한 시안정보를 수집하여 기업 단말로 제공하고, 기업 단말에서 비즈니스 계약을 희망하는 시안정보를 선택하면, 선택된 시안정보를 업로드한 생산자 단말로 계 약 수락 메시지를 전송한다. 즉, 실시예에서 제2매칭부는 기업이 주체가 되어 생산자를 선택하도록 하고, 기업에서 선택한 생산자와 비즈니스 매칭을 수행한다. 제2매칭부는 해당 기업으로 지원한 시안 정보가 일 정 수를 초과하는 경우, 시안의 품질평가 결과에 따라 일정 수의 시안을 필터링 하고, 필터링 후 남아있는 시안 을 기업 단말로 제공할 수 있다. 생성부는 생산자와 기업체 간 비즈니스 계약이 성사된 경우, 비즈니스 계약 조건, 기간을 포함하는 계약정 보를 기재한 계약서를 생성하고 공증한다. 실시예에서 생성부는 계약서 생성 후 기업과 생산자 간 전자 서 명 및 인증 과정을 통해, 계약서를 전자 문서 형태로 저장하고, 저장된 계약서를 법률 대리인 단말로 전송한다. 법률 대리인 단말은 수신한 계약서를 공증한 후 기업 단말과 생산자 단말로 전송한다. 실시예에서 생성부 비즈니스 계약 만료 시점을 인식하여, 계약 만료 시점에서 일정 시간 전에 계약 만료 알림을 생산자 단말 및 기업 단말로 전송할 수 있다. 제공부는 기업 단말에서 희망하는 시안의 종류와 조건을 기재한 시안 모집 공고를 게시하는 경우, 공고 게 시물 열람권을 구매한 생산자 단말로, 공고 게시물을 전송하여 생산자가 게시물을 확인할 수 있도록 한다. 실시 예에서 또한, 제공부는 시안 모집 공고에 포함된 텍스트 분석을 통해, 해당 공고와 연관이 있는 시안정보 를 추출하고, 추출된 시안정보를 생성한 생산자 단말로 게시글을 전송할 수 있다. 실시예에서는 제공부는 해당 공고와 추출된 시안 정보와의 연관도를 산출하고, 산출한 연관도와 게시글 열람권을 함께 생산자 단말로 전송할 수 있다. 피드백부는 딥러닝 모델의 평가 결과에 따라 딥러닝 모델을 업데이트 한다. 예컨대, 피드백부는 인공 신경망 모델의 공정성이 낮거나 차별성을 보이는 경우, 개선 작업을 수행한다. 실시예에서 피드백부는 특 정 집단의 데이터가 일정수준 이상 부족한 경우 특정 집단을 대표하는 데이터를 추가로 수집하고, 데이터 전처 리 과정을 수행한다. 실시예에서 피드백부는 데이터 정규화, 이상치 제거, 데이터의 배율 조정을 포함하는 데이터 전처리 과정을 수행하여 모델이 불필요한 패턴을 학습하는 것을 방지한다. 또한, 실시예에서 피드백부 는 모델 학습 알고리즘에 특정 조건을 추가하여 차별성을 방지하거나, 공정성을 보장할 수 있다. 실시예에서 피드백부는 공정성 보장을 위해, 혼돈행렬(Confusion Matrix) 분석을 통해, 모델의 예측 결과 를 실제 결과와 비교하여 모델의 성능을 평가한다. 혼돈 행렬(confusion matrix)은 지도 학습에서 모델의 분류 성능을 평가하는 행렬이다. 혼돈 행렬은 모델이 예측한 결과와 실제 결과를 비교하여 분류 결과를 표시한다. 실 시예에서 피드백부는 혼돈행렬 분석을 통해, 각각의 클래스에 대한 정확도와 오분류율을 계산하여 모델의 성능을 평가할 수 있다. 또한, 실시예에서 피드백부는 학습데이터에 대한 시각화 분석을 통해 데이터의 분포를 확인할 수 있도록 한다. 예를 들어, 이미지 데이터의 경우 각 클래스에 대한 이미지 샘플을 시각화 하여 데이터의 다양성과 공정 성을 평가할 수 있다. 또한, 피드백부은 인공신경망 모델의 편향(Bias) 검증을 수행한다. 실시예에서 피드백부는 학습정보 에 대한 편향(Bias) 검증을 통해, 모델이 특정 클래스나 속성에 대해 편향되어 있는지 여부를 확인한다. 이를 위해 피드백부는 각 클래스에 대한 샘플의 수를 비교하거나, 각 클래스에 대한 분류 성능을 평가한다. 또한, 피드백부는 공정성(Fairness) 검증 및 평가 지표 계산을 통해, 학습데이터의 공정성과 다양항을 검 증하고 인공신경망 모델을 개선할 수 있도록 한다. 실시예에서 공정성 검증은 학습정보에 대해 인공신경망 모델 이 성별, 인종, 연령 등의 특정속성에 대해 차별성을 보이는지 여부를 확인하는 것이다. 실시예에서 피드백부 는 각 속성에 대한 샘플의 수를 비교하거나, 각 속성에 대한 분류 성능을 평가하여, 특정 속성에 대한 차 별성 여부를 확인할 수 있다. 또한, 피드백부는 인공신경망 모델의 성능을 평가하기 위한 다양한 지표를 계산한다. 예를 들어, 정확도, 정밀도, 재현율, F1-score 등의 지표를 계산하여 모델의 성능을 평가할 수 있다. 이때, 각 클래스에 대한 지표 를 계산하여 모델의 공정성과 다양성을 평가할 수 있다. 또한, 피드백부는 인공신경망 모델이 실제 환경에서 사용되면서 발생하는 문제점에 대한 피드백을 수집하 고, 수집된 피드백을 인공신경망 모델에 반영하여 인공신경망 모델을 지속적으로 개선한다. 이하에서는 비즈니스 중개 서비스 제공 방법에 대해서 차례로 설명한다. 실시예에 따른 비즈니스 중개 서비스 제공 방법의 작용(기능)은 위조품 탐지 시스템의 기능과 본질적으로 같은 것이므로 도 1 및 도 2와 중복되는 설 명은 생략하도록 한다. 도 3은 실시예에 따른 비즈니스 중개 서비스 제공 시스템의 신호 흐름을 나타낸 도면이다. 도 3을 참조하면, S100 단계에서는 생산자 단말에서 텍스트, 그래픽, 영상, 이미지를 포함하는 생산품 시안 정 보를 업로드한다. S200 단계에서는 기업 단말에서 시안 정보 검토 후, 구입 또는 계약하려는 시안 정보를 선택 하고 선택한 시안 정보에 대한 가격과 조건 정보를 전송한다. S300 단계에서는 서버에서 생산자 단말로부터 시 안정보를 수집하여 기업 단말로 제공하고, 기업 단말로부터 기업에서 제안하는 가격 및 조건 정보를 수집하여 생산자 단말로 제공한다. S400 단계에서는 서버에서 생산자 단말에서 계약을 희망하는 기업 단말을 선택하는 경 우, 상기 기업 단말로 생산자 정보를 전송한다. 도 4는 실시예에 따른 서버의 데이터 처리 과정을 나타낸 도면이다. 도 4를 참조하면, S100 단계에서는 수집부에서 생산자 정보, 생산품 시안정보, 생산자의 희망 계약정보, 기업정 보, 기업체의 비즈니스 조건정보 및 딥러닝 모델의 학습정보를 수집한다. S200 단계에서는 딥러닝부에서 DNN(Deep Neural Network), CNN(Convolutional Neural Network) RNN(Recurrent Neural Network) 및 BRDNN(Bidirectional Recurrent Deep Neural Network) 중 적어도 하나를 포함하는 딥러닝 뉴럴 네트워크를 상 기 학습정보로 학습시켜 비즈니스 매칭 모델을 구현한다. S300 단계에서는 업체 순위 생성부에서 시안정보에 대 한 생산자의 희망 계약 정보와 기업체에서 제안한 비즈니스 조건 정보를 비교하여, 비교 결과에 따라 매칭 우선 순위 업체 리스트를 생성한다. S400 단계에서는 추천부에서 기업체에서 제안한 비즈니스 조건 정보와, 기업에서 희망하는 시안정보를 기반으로 수집된 시안정보를 추출한다. 이상에서와 같은 비즈니스 중개 서비스 제공 시스템 및 방법은 생산자 단말로부터 다양한 생산품 시안을 수집하 고 이를 기업체 관계자에게 제공하여, 기업체가 충분한 데이터베이스를 통해 비즈니스 협력을 희망하는 생산자 를 선택할 수 있도록 한다. 또한, 실시예를 통해 생산자는 여러 기업체에서 제시하는 가격과 조건을 직접 비교하고 선택함으로써, 비즈니스 계약이 보다 합리적으로 이루어 질 수 있도록 한다. 실시예를 통해, 기업 및 개인 고객이 제공하는 수수료로 영업이익을 창출하고, 시안정보의 보안성을 향상시킬 수 있다. 개시된 내용은 예시에 불과하며, 특허청구범위에서 청구하는 청구의 요지를 벗어나지 않고 당해 기술 분야에서 통상의 지식을 가진 자에 의하여 다양하게 변경 실시될 수 있으므로, 개시된 내용의 보호범위는 상술 한 특정의 실시예에 한정되지 않는다."}
{"patent_id": "10-2023-0091282", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 실시예에 따른 비즈니스 중개 서비스 제공 시스템 구성을 나타낸 도면 도 2는 실시예에 따른 서버의 데이터 처리 구성을 나타낸 도면 도 3은 실시예에 따른 비즈니스 중개 서비스 제공 시스템의 신호 흐름을 나타낸 도면 도 4는 실시예에 따른 서버의 데이터 처리 과정을 나타낸 도면"}
