{"patent_id": "10-2020-0080959", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0003309", "출원번호": "10-2020-0080959", "발명의 명칭": "객체의 근접 여부를 감지하는 방법 및 이를 지원하는 전자 장치", "출원인": "삼성전자주식회사", "발명자": "양동일"}}
{"patent_id": "10-2020-0080959", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,무선 통신 회로;상기 무선 통신 회로와 전기적으로 연결되고, 제1 지점에서 상기 무선 통신 회로로부터 급전되는 안테나;상기 안테나에 인가되는 최대 전압(peak voltage)을 감지하는 전압 감지부; 및상기 전압 감지부 및 상기 무선 통신 회로와 전기적으로 연결되는 프로세서;를 포함하고,상기 프로세서는,상기 전압 감지부에서 감지된 최대 전압에 기초하여, 상기 전자 장치에 대한 객체의 근접 여부를 판단하고,상기 객체가 근접하였다는 판단에 기초하여, 상기 무선 통신 회로를 통하여 상기 안테나에 인가되는 전력의 크기를 제어하도록 구성되는, 전자 장치."}
{"patent_id": "10-2020-0080959", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 프로세서는,상기 객체가 근접하였다는 판단에 기초하여, 상기 무선 통신 회로를 통하여 상기 안테나에 인가되는 전력의 크기를 줄이도록 구성되는, 전자 장치."}
{"patent_id": "10-2020-0080959", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,상기 프로세서와 전기적으로 연결되고, 상기 안테나에 인가되는 전력의 크기에 대응되는 지정된 최대 전압의 범위가 저장된 메모리;를 더 포함하는, 전자 장치."}
{"patent_id": "10-2020-0080959", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 3에 있어서,상기 프로세서는,상기 전압 감지부에서 감지된 최대 전압과 상기 메모리에 저장된 지정된 최대 전압의 범위를 비교하여, 상기 전자 장치를 기준으로 객체의 근접 여부를 판단하도록 구성되는, 전자 장치."}
{"patent_id": "10-2020-0080959", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서,상기 안테나는,상기 제1 지점과 다른 제2 지점에서 그라운드(ground)와 전기적으로 연결되는, 전자 장치."}
{"patent_id": "10-2020-0080959", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 3에 있어서,상기 안테나 및 상기 무선 통신 회로와 전기적으로 연결되는 커플러(coupler);를 더 포함하고,상기 커플러는, 공개특허 10-2022-0003309-3-상기 커플러에 인가된 전력 값을 상기 무선 통신 회로로 피드백(feedback)하도록 구성되는, 전자 장치."}
{"patent_id": "10-2020-0080959", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 6에 있어서,상기 무선 통신 회로는, 상기 커플러의 전력을 감지하기 위한 전력 감지 회로(power detection circuit)을 포함하는, 전자 장치."}
{"patent_id": "10-2020-0080959", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 7에 있어서,상기 메모리에는,상기 안테나에 인가되는 전력의 크기에 대응되는 지정된 커플러에 인가되는 전력 값이 저장되는, 전자 장치."}
{"patent_id": "10-2020-0080959", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 8에 있어서,상기 프로세서는,상기 무선 통신 회로로부터 상기 전력 감지 회로를 통해 감지된 상기 커플러의 전력 값을 수신하고,상기 수신된 상기 커플러의 전력 값과 상기 메모리에 저장된 지정된 커플러 전력 값을 비교하여, 상기 안테나에인가되는 전력의 크기가 조절되었는지 여부를 판단하도록 구성되는, 전자 장치."}
{"patent_id": "10-2020-0080959", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "전자 장치에 있어서,무선 통신 회로;상기 무선 통신 회로와 전기적으로 연결되고, 제1 지점에서 상기 무선 통신 회로로부터 급전되는 안테나;상기 안테나와 전기적으로 연결되고, 상기 안테나의 전기적 길이를 조절하도록 구성되는 스위치 회로;상기 스위치 회로에 인가되는 최대 전압(peak voltage)을 감지하는 전압 감지부; 및상기 전압 감지부 및 상기 무선 통신 회로와 전기적으로 연결되는 프로세서;를 포함하고,상기 프로세서는,상기 전압 감지부에서 감지된 최대 전압에 기초하여, 상기 전자 장치에 대한 객체의 근접 여부를 판단하고,상기 객체가 근접하였다는 판단에 기초하여, 상기 무선 통신 회로를 통하여 상기 안테나에 인가되는 전력의 크기를 제어하도록 구성되는, 전자 장치."}
{"patent_id": "10-2020-0080959", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 10에 있어서,상기 스위치 회로는, 복수의 FET(field effect transistor) 스위치가 직렬 연결된 회로인, 전자 장치."}
{"patent_id": "10-2020-0080959", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 10에 있어서,상기 전압 감지부는, 상기 복수의 FET 스위치 중 적어도 하나의 FET 스위치와 전기적으로 연결되고,상기 적어도 하나의 FET 스위치에 인가되는 전압에 기초하여, 상기 스위치 회로에 인가되는 최대 전압을 감지하공개특허 10-2022-0003309-4-도록 구성되는, 전자 장치."}
{"patent_id": "10-2020-0080959", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 10에 있어서,상기 전압 감지부는,상기 복수의 FET 스위치 중 적어도 두 개의 FET 스위치와 전기적으로 연결되고,상기 적어도 두 개의 FET 스위치에 인가되는 전압에 기초하여, 상기 스위치 회로에 인가되는 최대 전압 및 상기스위치 회로에 인가되는 전압의 위상 변화를 감지하도록 구성되고,상기 프로세서는, 상기 전압 감지부를 통하여 감지된 상기 스위치 회로에 인가되는 최대 전압 및 상기 스위치 회로에 인가되는전압의 위상 변화에 기초하여, 상기 전자 장치에 대한 객체의 근접 여부를 감지하도록 구성되는, 전자 장치."}
{"patent_id": "10-2020-0080959", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 10에 있어서,상기 프로세서와 전기적으로 연결되고, 상기 안테나에 인가되는 전력의 크기에 대응되는 지정된 스위치 회로의최대 전압의 범위가 저장된 메모리;를 더 포함하고,상기 프로세서는,상기 전압 감지부에서 감지된 최대 전압과 상기 메모리에 저장된 지정된 스위치 회로의 최대 전압의 범위를 비교하여, 상기 전자 장치에 대한 객체의 근접 여부를 판단하도록 구성되는, 전자 장치."}
{"patent_id": "10-2020-0080959", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "객체의 근접 여부를 감지하는 방법에 있어서,전압 감지부를 통해 안테나에 인가되는 최대 전압(peak voltage)을 감지하는 동작;상기 감지된 최대 전압에 기초하여, 전자 장치에 대한 객체의 근접 여부를 판단하는 동작; 및상기 객체가 근접하였다는 판단에 기초하여, 상기 안테나와 전기적으로 연결된 무선 통신 회로를 통하여 상기안테나에 인가되는 전력의 크기를 조절하는 동작;을 포함하는, 방법."}
{"patent_id": "10-2020-0080959", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "청구항 15에 있어서,상기 안테나에 인가되는 전력의 크기를 조절하는 동작은, 상기 객체가 근접하였다는 판단에 기초하여, 상기 안테나에 인가되는 전력의 크기를 줄이는 동작;을 포함하는,방법."}
{"patent_id": "10-2020-0080959", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "청구항 15에 있어서,상기 객체의 근접 여부를 판단하는 동작은,상기 전압 감지부를 통해 감지된 최대 전압과 메모리에 저장된 상기 안테나에 인가되는 전력의 크기에 대응되는지정된 최대 전압의 범위를 비교하는 동작;을 포함하는, 방법."}
{"patent_id": "10-2020-0080959", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "청구항 17에 있어서,상기 객체의 근접 여부를 판단하는 동작은,상기 전압 감지부를 통해 감지된 최대 전압이 지정된 최대 전압의 범위에서 벗어나는 것으로 판단되면, 상기 객공개특허 10-2022-0003309-5-체가 근접한 것으로 판단하는, 방법."}
{"patent_id": "10-2020-0080959", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "청구항 15에 있어서,상기 무선 통신 회로 및 상기 안테나와 전기적으로 연결되는 커플러(coupler)에 인가되는 전력에 기초하여, 상기 안테나에 인가되는 전력의 크기가 조절되었는지 여부를 확인하는 동작;을 더 포함하는, 방법."}
{"patent_id": "10-2020-0080959", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "청구항 19에 있어서,상기 전력의 크기가 조절되었는지 여부를 확인하는 동작은,상기 커플러의 전력 값과 메모리에 저장된 상기 안테나에 인가되는 전력의 크기에 대응되는 지정된 커플러 전력값을 비교하는 동작;을 포함하는, 방법."}
{"patent_id": "10-2020-0080959", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 객체의 근접 여부를 감지하는 방법 및 이를 지원하는 전자 장치에 관한 것으로, 본 개시의 일 실시예 에 따른 전자 장치는, 무선 통신 회로, 상기 무선 통신 회로와 전기적으로 연결되고, 제1 지점에서 상기 무선 통 신 회로로부터 급전되는 안테나, 상기 안테나에 인가되는 최대 전압(peak voltage)을 감지하는 전압 감지부 및 상기 전압 감지부 및 무선 통신 회로와 전기적으로 연결되는 프로세서를 포함하고, 상기 프로세서는, 상기 전압 감지부에서 감지된 최대 전압에 기초하여, 상기 전자 장치에 대한 객체의 근접 여부를 판단하고, 상기 객체가 근 접하였다는 판단에 기초하여, 상기 무선 통신 회로를 통하여 상기 안테나에 인가되는 전력의 크기를 제어하도록 구성될 수 있다."}
{"patent_id": "10-2020-0080959", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시의 다양한 실시예들은 객체의 근접 여부를 감지하는 방법 및 이를 지원하는 전자 장치에 관한 것이다."}
{"patent_id": "10-2020-0080959", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전자파 흡수율(SAR: specific absorption rate)은 전자 장치로부터 발생하는 전자파가 인체에 흡수되는 단위 질 량당 에너지의 양을 의미한다. 전자 장치를 사용하는 동안 측정된 전자파 흡수율의 측정치가 클수록 사용자의 인체에 나쁜 영향을 줄 수 있다. 각 국에서는 사용자의 인체에 대한 전자파 흡수율이 기준치를 넘지 못하도록 규제하고 있으며, 전자 장치 제조 사들은 전자파 흡수율 규격(이하, \"SAR 규격\")을 충족시키기 위하여 전자 장치에서 송신되는 무선 신호의 최대 전력을 조절하고 있다."}
{"patent_id": "10-2020-0080959", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "전자 장치는, 그립 센서(grip sensor)를 이용하여 전자 장치에 대한 외부 객체(예: 사용자의 인체)의 근접 또는 접촉 여부를 감지하고, 외부 객체가 근접 또는 접촉한 것으로 판단되면 송출될 무선 신호의 최대 전력을 지정된 값 이하로 낮춤으로써, SAR 규격을 충족시킬 수 있다. 다만, 전자 장치는, 그립 센서 및 그립 센서와 전기적으로 연결되는 회로가 배치될 수 있는 공간이 확보되어야 하며, 전자 장치 내부에 다른 전자 부품들이 배치될 수 있는 공간이 줄어들 수 있고, 회로의 구성이 복잡해질 수 있다. 또한, 그립 센서는 안테나 방사체로 동작하는 전자 장치의 메탈 프레임(metal frame)의 적어도 일 영역과 전기 적으로 연결되도록 배치될 경우, 메탈 프레임과 전기적으로 연결되는 그립 센서에 의해 메탈 프레임의 방사 성 능이 저하될 수 있었다. 본 개시의 다양한 실시예들은, 그립 센서 없이 외부 객체의 근접 또는 접촉 여부를 감지할 수 있는 방법 및 이 를 지원하는 전자 장치를 제공하고자 한다."}
{"patent_id": "10-2020-0080959", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시예에 따른 전자 장치는, 무선 통신 회로, 상기 무선 통신 회로와 전기적으로 연결되고, 제1 지점에서 상기 무선 통신 회로로부터 급전되는 안테나, 상기 안테나에 인가되는 최대 전압(peak voltage)을 감 지하는 전압 감지부 및 상기 전압 감지부 및 무선 통신 회로와 전기적으로 연결되는 프로세서를 포함하고, 상기 프로세서는, 상기 전압 감지부에서 감지된 최대 전압에 기초하여, 상기 전자 장치에 대한 객체의 근접 여부를 판단하고, 상기 객체가 근접하였다는 판단에 기초하여, 상기 무선 통신 회로를 통하여 상기 안테나에 인가되는전력의 크기를 제어하도록 구성될 수 있다. 본 개시의 다른 실시예에 따른 전자 장치는, 무선 통신 회로, 상기 무선 통신 회로와 전기적으로 연결되고, 제1 지점에서 상기 무선 통신 회로로부터 급전되는 안테나, 상기 안테나와 전기적으로 연결되고, 상기 안테나의 전 기적 길이를 조절하도록 구성되는 스위치 회로, 상기 스위치 회로에 인가되는 최대 전압(peak voltage)을 감지 하는 전압 감지부 및 상기 전압 감지부 및 무선 통신 회로와 전기적으로 연결되는 프로세서를 포함하고, 상기 프로세서는, 상기 전압 감지부에서 감지된 최대 전압에 기초하여, 상기 전자 장치에 대한 객체의 근접 여부를 판단하고, 상기 객체가 근접하였다는 판단에 기초하여, 상기 무선 통신 회로를 통하여 상기 안테나에 인가되는 전력의 크기를 제어하도록 구성될 수 있다. 본 개시의 일 실시예에 따른 방법은, 전압 감지부를 통해 안테나에 인가되는 최대 전압(peak voltage)을 감지하 는 동작, 상기 감지된 최대 전압에 기초하여, 전자 장치에 대한 객체의 근접 여부를 판단하는 동작 및 상기 객 체가 근접하였다는 판단에 기초하여, 상기 안테나와 전기적으로 연결된 무선 통신 회로를 통하여 상기 안테나에 인가되는 전력의 크기를 조절하는 동작을 포함할 수 있다."}
{"patent_id": "10-2020-0080959", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 다양한 실시예에 따른 전자 장치는, 그립 센서(grip sensor) 없이 전자 장치에 대한 외부 객체(예: 사용자의 인체)의 근접 여부를 감지할 수 있다. 본 개시의 다양한 실시예에 따른 전자 장치는, 전자 부품들이 배치될 수 있는 실장 공간을 확보하고, 회로의 복 잡성을 감소시킬 수 있다. 본 개시의 다양한 실시예에 따른 전자 장치는, 그립 센서에 의해 발생되는 안테나 성능 저하를 감소시킬 수 있 다."}
{"patent_id": "10-2020-0080959", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 1, "content": "도 1은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블럭도이다. 도 1을 참조하면, 네트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워 크)를 통하여 전자 장치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하 여 전자 장치 또는 서버와 통신할 수 있다. 일 실시예에 따르면, 전자 장치는 서버를 통하 여 전자 장치와 통신할 수 있다. 일 실시예에 따르면, 전자 장치는 프로세서, 메모리, 입 력 모듈, 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스 , 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈 , 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장치 에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어떤 실시예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모 듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일 실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세 서는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메모리에 저장할 수 있다. 일 실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또 는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로 세서를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능 에 특화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일 실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일 실시예에 따르면, 보조 프로세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi- supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않 는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있 다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일 실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일 실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일 실시 예에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일 실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일 실시예에 따르면, 인터페이스는, 예 를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터 페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일 실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일 실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일 실시예에 따르면, 카메라 모듈은 하나 이 상의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일 실시예에 따르면, 전력 관리 모 듈은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일 실시예에 따르면, 배터 리는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일 실시예에 따르면, 통 신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워 크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입 자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같 은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일 실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이 상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링 크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일 실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일 실시예에 따르면, 안테나 모듈은 복수의 안테나 들(예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통 신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통 신 모듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품(예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일 실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗면 또는 측면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일 실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일 실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 서버) 중 하나 이상의 외부의 전자 장치들에서 실행 될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부 터의 요청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신 에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일 부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신 경망을 이용한 지능형 서버일 수 있다. 일 실시예에 따르면, 외부의 전자 장치 또는 서버는 제 2 네 트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 본 문서에 개시된 다양한 실시예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되 지 않는다. 본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위 해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적 으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 다양한 실시예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함 할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부 가 될 수 있다. 예를 들면, 일 실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형 태로 구현될 수 있다. 본 문서의 다양한 실시예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어 (예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것 을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형 태로 제공될 수 있다. 여기서, ‘비일시적’은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전 자기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경 우와 임시적으로 저장되는 경우를 구분하지 않는다. 일 실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory(CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어™)를 통해 또는 두 개의 사용자 장치들(예: 스마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨 터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같 은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상 의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따르면, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동 작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다.도 2a는, 일 실시예에 따른 전자 장치의 전면을 나타내는 사시도이고, 도 2b는, 도 2a의 전자 장치를 후면에서 바라본 사시도이다. 도 2a 및 2b를 참조하면, 일 실시예에 따른 전자 장치(예: 도 1의 전자 장치)는, 제1 면(또는 \"전 면\")(210A), 제2 면(또는 \"후면\")(210B), 및 제1 면(210A)과 제2 면(210B) 사이의 공간을 둘러싸는 측면(또는 \"측벽\")(210C)을 포함하는 하우징을 포함할 수 있다. 다른 실시예(미도시)에서는, 하우징은, 도 2a 및 도 2b의 제1 면(210A), 제2 면(210B) 및 측면(210C)들 중 일부를 형성하는 구조를 지칭할 수도 있다. 일 실시예에 따르면, 제1 면(210A)은 적어도 일부분이 실질적으로 투명한 전면 플레이트(또는 \"커버 윈도 우(cover window)\")(예: 다양한 코팅 레이어들을 포함하는 글라스 플레이트, 또는 폴리머 플레이트)에 의하여 형성될 수 있다. 실시예에 따라, 전면 플레이트는, 적어도 일측 단부(side edge portion)에서 제1 면 (210A)으로부터 후면 플레이트 쪽으로 휘어져 심리스하게(seamless) 연장된 곡면 부분을 포함할 수 있다. 일 실시예에 따르면, 제2 면(210B)은 실질적으로 불투명한 후면 플레이트에 의하여 형성될 수 있다. 후면 플레이트는, 예를 들어, 코팅 또는 착색된 유리, 세라믹, 폴리머, 금속(예: 알루미늄, 스테인레스 스틸 (STS), 또는 마그네슘), 또는 상기 물질들 중 적어도 둘의 조합에 의하여 형성될 수 있다. 실시예에 따라, 후면 플레이트는, 적어도 일측 단부에서 제2 면(210B)으로부터 전면 플레이트 쪽으로 휘어져 심리스하게 연장된 곡면 부분을 포함할 수 있다. 일 실시예에 따르면, 측면(210C)은, 전면 플레이트 및 후면 플레이트와 결합하며, 금속 및/또는 폴리 머를 포함하는 측면 부재(또는 \"브라켓\")에 의하여 형성될 수 있다. 어떤 실시예에서는, 후면 플레이트 및 측면 부재는 일체로 형성되고 동일한 물질(예: 알루미늄과 같은 금속 물질)을 포함할 수 있다. 일 예시에서, 측면 부재는 도전성 부분 및/또는 적어도 하나의 비도전성 부분(2182, 2183)을 포함할 수 있다. 예를 들어, 도전성 부분의 일단(예: -x 방향의 일단)에는 제1 비도전성 부분이 배치되고, 도전성 부분의 다른 일단(예: +x 방향의 일단)에는 제2 비도전성 부분이 배치되어 도전성 부분 을 절연시킬 수 있다. 다른 예시에서, 도전성 부분은 무선 통신 회로(예: 도 1의 무선 통신 모듈 )로부터 급전(feeding)되어, 지정된 주파수 대역의 RF 신호를 송신 및/또는 수신하는 안테나 방사체로 동 작할 수 있다. 일 실시예에 따르면, 전자 장치는, 디스플레이, 오디오 모듈, 센서 모듈(미도시), 카메라 모듈 (205, 212, 213, 214, 215, 206), 키 입력 장치 또는 커넥터 홀 중 적어도 하나를 포함할 수 있다. 어떤 실시예에서는, 전자 장치는, 구성요소들 중 적어도 하나(예: 키 입력 장치)를 생략하거나 다른 구성요소를 추가적으로 포함할 수 있다. 어떤 실시예에서, 전자 장치는 발광 소자를 더 포함할 수 있으며, 발광 소자는 전면 플레이트가 제공 하는 영역 내에서 디스플레이와 인접한 위치에 배치될 수 있다. 발광 소자는, 예를 들어, 전자 장치 의 상태 정보를 광 형태로 제공할 수 있다. 다른 실시예에서는, 발광 소자는, 예를 들어, 카메라 모듈의 동작과 연동되는 광원을 제공할 수 있다. 발광 소자는, 예를 들어, LED, IR LED 및/또는 제논 램프를 포함할 수 있다. 일 실시예에 따르면, 디스플레이는 전면 플레이트의 상당 부분을 통하여 전자 장치의 외부로 보 여 질 수 있다. 어떤 실시예에서는, 디스플레이의 가장자리를 전면 플레이트의 인접한 외곽 형상(예: 곡면)과 대체로 동일하게 형성할 수 있다. 다른 실시예(미도시)에서는, 디스플레이가 노출되는 면적을 확 장하기 위하여, 디스플레이의 외곽과 전면 플레이트의 외곽간의 간격이 대체로 동일하게 형성될 수 있다. 다른 실시예(미도시)에서는, 전자 장치는 디스플레이의 화면 표시 영역의 일부에 리세스 또는 개구부(opening)를 형성하고, 리세스 또는 상기 개구부(opening)와 정렬되는 다른 전자 부품, 예를 들어, 카메 라 모듈, 도시되지 않은 근접 센서 또는 조도 센서를 포함할 수 있다. 다른 실시예(미도시)에서는, 디스플레이의 화면 표시 영역의 배면에, 카메라 모듈(212, 213, 214, 215), 지문 센서(미도시), 및 플래시 중 적어도 하나를 포함할 수 있다. 또 다른 실시예(미도시)에서는, 디스플 레이는, 터치 감지 회로, 터치의 세기(압력)를 측정할 수 있는 압력 센서, 및/또는 자기장 방식의 스타일 러스 펜을 검출하는 디지타이저와 결합되거나 인접하여 배치될 수 있다. 일 실시예에 따르면, 오디오 모듈은 마이크 홀 및/또는 스피커 홀을 포함할 수 있다. 마이크 홀은 외부의 소리를 획득하기 위한 마이크가 내부에 배치될 수 있고, 어떤 실시예에서는 소리의 방향을 감지할 수 있도록 복 수개의 마이크가 배치될 수 있다. 어떤 실시예에서는 스피커 홀과 마이크 홀이 하나의 홀로 구현되거나, 스피커홀 없이 스피커가 포함될 수 있다(예: 피에조 스피커). 스피커 홀은, 외부 스피커 홀 및/또는 통화용 리시버 홀 을 포함할 수 있다. 일 실시예에 따르면, 전자 장치는 도시되지 않은 센서 모듈을 포함함으로써, 내부의 작동 상태, 또는 외부 의 환경 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 예를 들어, 센서 모듈은, 하우징의 제1 면(210A)에 배치된 근접 센서, 디스플레이에 통합된 또는 인접하게 배치된 지문 센서 및/또는 하우징 의 제2 면(210B)에 배치된 생체 센서(예: HRM 센서)를 더 포함할 수 있다. 전자 장치는, 도시되지 않 은 센서 모듈, 예를 들어, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 컬 러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서 중 적어도 하나를 더 포함할 수 있다. 일 실시예에 따르면, 카메라 모듈(205, 212, 213, 214, 215, 206)은 전자 장치의 제1 면(210A)에 배치된 제1 카메라 장치, 및 제2 면(210B)에 배치된 제2 카메라 장치(212, 213, 214, 215) 및/또는 플래시 를 포함할 수 있다. 일 예시에서, 상술한 카메라 장치들(205, 212, 213, 214, 215)은 하나 또는 복수의 렌즈들, 이미지 센서, 및/또는 이미지 시그널 프로세서를 포함할 수 있다. 다른 예시에서, 플래시는 발광 다이오드 또는 제논 램프(xenon lamp)를 포함할 수 있다. 어떤 실시예에서는, 2개 이상의 렌즈들(적외선 카메라, 광각 및 망원 렌즈) 및 이미지 센서들이 전자 장치의 한 면에 배치될 수 있다. 일 실시예에 따르면, 키 입력 장치는 하우징의 측면(210C)에 배치될 수 있다. 다른 실시예에서는, 전 자 장치는 상기 언급된 키 입력 장치 중 일부 또는 전부를 포함하지 않을 수 있고 포함되지 않은 키 입력 장치는 디스플레이 상에 소프트 키와 같은 다른 형태로 구현될 수 있다. 어떤 실시예에서, 키 입력 장치는 하우징의 제2 면(210B)에 배치된 지문 센서의 적어도 일부를 포함할 수 있다. 일 실시예에 따르면, 커넥터 홀은 외부 전자 장치와 전력 및/또는 데이터를 송수신하기 위한 커넥터, 및/ 또는 외부 전자 장치와 오디오 신호를 송수신하기 위한 커넥터를 수용할 수 있다. 예를 들어, 커넥터 홀은 USB 커넥터 또는 이어폰 잭을 포함할 수 있다. 일 실시예에서는, USB 커넥터와 이어폰 잭은 하나의 홀(예: 도 2a, 도 2b의 208)로 구현될 수도 있으며, 다른 실시예(미도시)에 따르면, 전자 장치는 별도의 커넥터 홀 없이 외부 전자 장치(예: 도 1의 전자 장치(102, 104))와 전력 및/또는 데이터를 송수신하거나, 오디오 신호를 송수신할 수도 있다. 도 3은, 일 실시예에 따라, 전자 장치의 안테나 방사체로 동작하는 측면 부재의 일부 영역을 나타내는 도면이다. 도 3을 참조하면, 일 실시예에 따른 전자 장치(예: 도 2a, 도 2b의 전자 장치)는, 측면 부재(예: 도 2a의 측면 부재), 인쇄 회로 기판 및/또는 무선 통신 회로(예: 도 1의 무선 통신 모듈)를 포함할 수 있다. 일 실시예에 따른 전자 장치의 구성 요소들 중 적어도 하나는 도 1의 전자 장치 또는 도 2a, 도 2b의 전자 장치의 구성 요소들 중 적어도 하나와 동일 또는 유사할 수 있 으며, 이하 중복되는 설명은 생략하도록 한다. 일 실시예에 따르면, 측면 부재는 전자 장치의 측면(예: 도 2a의 측면(210C))의 적어도 일부를 형성 할 수 있다. 일 예시에서, 측면 부재는 도전성 부분(예: 도 2a의 도전성 부분) 및/또는 적어도 하나의 비도전성 부분(312, 313)(예: 도 2a의 적어도 하나의 비도전성 부분(2182, 2183))을 포함할 수 있다. 예 를 들어, 적어도 하나의 비도전성 부분(312, 313)은 도전성 부분의 일단(예: -x 방향의 일단)에 배치되는 제1 비도전성 부분 및/또는 도전성 부분의 다른 일단(예: +x 방향의 일단)에 배치되는 제2 비도전성 부분을 포함할 수 있다. 다른 예로, 제1 비도전성 부분 및/또는 제2 비도전성 부분은 도전성 부 분을 절연시킬 수 있다. 다른 예로, 제1 비도전성 부분과 접촉하고, 제1 비도전성 부분의 -x축 방향의 측면 부재의 부분, 또는 제2 비도전성 부분과 접촉하고, 제2 비도전성 부분의 +x축 방향 의 측면 부재의 부분은 도전성 부재를 포함할 수 있다. 일 실시예에 따르면, 측면 부재의 도전성 부분은 무선 통신 회로 및/또는 인쇄 회로 기판 의 그라운드(ground)와 전기적으로 연결될 수 있다. 예를 들어, 도전성 부분은 제1 지점(P1)에서 무선 통 신 회로와 전기적으로 연결되고, 제1 지점(P1)으로부터 이격된 제2 지점(P2)에서 인쇄 회로 기판의 그 라운드와 전기적으로 연결될 수 있다. 또 다른 예로, 도전성 부분을 포함하는 안테나의 종류에 따라, 도전 성 부분은 그라운드와 전기적으로 연결이 안될 수도 있다. 예를 들어, 모노폴 안테나, 또는 패치 안테나일 경우에는 도전성 부분은 그라운드와 전기적으로 연결 안될 수 있다.일 실시예에서, 도전성 부분은 인쇄 회로 기판 방향으로 돌출되어 형성되는 적어도 하나의 돌출부 (3111, 3112)를 포함할 수 있다. 예를 들어, 도전성 부분은 제1 돌출부 및/또는 제1 돌출부 와 이격되어 배치되는 제2 돌출부를 포함할 수 있다. 다른 예로, 제1 지점(P1)은 제1 돌출부의 적 어도 일 영역과 대응되는 지점을 의미하고, 제2 지점(P2)은 제2 돌출부의 적어도 일 영역과 대응되는 지 점을 의미할 수 있으나, 이에 한정되는 것은 아니다. 일 실시예에서, 도전성 부분은 제1 지점(P1)을 통해 무선 통신 회로로부터 전력을 공급받을 수 있으 며, 그 결과 도전성 부분은 지정된 주파수 대역의 RF 신호를 송신 및/또는 수신하는 안테나 방사체로 동작 할 수 있다. 일 예시에서, 도전성 부분의 제1 지점(P1)에 전력이 공급됨에 따라, 도전성 부분에는 전 력에 대응되는 최대 전압(VRF)(peak voltage)이 인가될 수 있다. 도 3에 도시된 바와 같이, 도전성 부분에 인가되는 최대 전압(VRF)의 크기는 제1 지점(P1)으로부터 멀어질수록 커질 수 있으며, 이는 하기 수학식 1 내지 수학식 5를 통해 확인할 수 있다. 수학식 1"}
{"patent_id": "10-2020-0080959", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "수학식 2"}
{"patent_id": "10-2020-0080959", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "수학식 3"}
{"patent_id": "10-2020-0080959", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "수학식 4"}
{"patent_id": "10-2020-0080959", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "수학식 5"}
{"patent_id": "10-2020-0080959", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "상술한 수학식 1 내지 수학식 5의 W는 안테나(예: 도전성 부분)에 공급되는 전력을 의미하고, Z는 안테나 의 임피던스(impedance) 값을 의미하며, VRMS는 안테나에 인가되는 전압의 실효치를 의미하고, VSWR는 안테나의 전압 정재파비(voltage standing wave ration)를 의미하며, 는 안테나의 반사 계수를 의미할 수 있다.일 예시에서, 도전성 부분은 제1 지점(P1)에서 멀어질수록 높은 임피던스 값을 가질 수 있다. 수학식 4 및 /또는 수학식 5를 참고하면, 임피던스 값이 커질수록 인가되는 최대 전압(VRF)의 크기가 커지므로, 도전성 부분 에 인가되는 최대 전압(VRF)의 크기는 제1 지점(P1)으로부터 멀어질수록 커진다는 것을 확인할 수 있다. 일 실시예에 따르면, 전자 장치는 안테나 방사체로 동작하는 도전성 부분에 인가되는 최대 전압(VR F)을 감지하고, 감지된 최대 전압(VRF)에 기초하여 전자 장치에 대한 외부 객체(예: 사용자의 인체)의 근접 여부를 감지할 수 있다. 전자 장치의 최대 전압(VRF)을 감지하고, 외부 객체의 근접 여부를 감지하는 동작 에 대한 설명은 후술하도록 한다. 도 4는, 일 실시예에 따른 전자 장치의 구성을 설명하기 위한 도면이고, 도 5는, 일 실시예에 따른 전자 장지의 전압 감지부를 나타내는 도면이다. 도 4 및 도 5를 참조하면, 일 실시예에 따른 전자 장치(예: 도 2a, 도 2b의 전자 장치 또는 도 3의 전자 장치)는, 무선 통신 회로(예: 도 3의 무선 통신 회로), 전력 증폭기(power amplifier), 필터(filter), 커플러, 안테나, 전압 감지부, 아날로그디지털 변환기 (ADC: analog-digital converter), 프로세서(예: 도 1의 프로세서) 및/또는 메모리(예: 도 1의 메모리)를 포함할 수 있다. 일 실시예에 따르면, 무선 통신 회로는 안테나와 전기적으로 연결되어, 전자 장치와 외부 전자 장치(예: 도 1의 전자 장치(102, 104)) 사이의 무선 통신을 지원할 수 있다. 예를 들어, 무선 통신 회로는 안테나에 전력이 설정된 신호를 급전(feeding)함으로써, 외부 전자 장치로 RF(radio frequency) 신호를 송 신할 수 있다. 다른 예로, 무선 통신 회로는 안테나를 통해 외부 전자 장치로부터 RF 신호를 수신할 수 있다. 일 실시예에 따르면, 무선 통신 회로와 안테나 사이에는 무선 통신 회로와 안테나를 전기 적으로 연결하는 전기적 경로(L)가 형성될 수 있다. 상술한 전기적 경로(L) 상에는, 예를 들어, 전력 증폭기 , 필터 및/또는 커플러가 배치될 수 있다. 다른 실시예(미도시)에 따른 전자 장치에서는, 전력 증폭기, 필터 또는 커플러 중 적어도 하나(예: 커플러)가 생략되거나, 다른 구성이 추가될 수도 있다. 일 예시에서, 전력 증폭기는 무선 통신 회로로부터 출력되어 안테나에 인가되는 신호(이하, “ 출력 신호”)를 무선 통신 회로로부터 수신하여 증폭시킬 수 있으며, 전력 증폭기에 의해 증폭된 출 력 신호는 안테나로 전송될 수 있다. 다른 예시에서, 필터는 안테나와 전력 증폭기 사이에 위치하여, 전력 증폭기를 통해 증폭된 출력 신호의 노이즈(noise)를 제거 또는 필터링(filtering)할 수 있 다. 일 예시에서, 커플러는 안테나 및/또는 무선 통신 회로와 전기적으로 연결될 수 있으며, 무선 통신 회로에서 안테나에 공급 또는 인가되는 전력의 일부를 유기하여 무선 통신 회로로 피드백 (feedback)할 수 있다. 다른 예시에서, 커플러는 안테나에 인가되는 전력의 적어도 일부를 유기하고, 유기된 전력 신호를 무선 통신 회로로 피드백(feedback)할 수 있다. 무선 통신 회로는, 예를 들어, 커플러로부터 안테나에 인가되는 전력의 적어도 일부가 유기된 전력 신호를 수신하고, 수신된 전력 신호에 기초하여 안테나에 공급 또는 인가되는 전력의 크기를 조절할 수 있다. 일 실시예에 따르면, 무선 통신 회로는 커플러와 전기적으로 연결되는 전력 감지 회로(power detection circuit)(미도시)를 더 포함할 수 있다. 일 예시에서, 무선 통신 회로는 전력 감지 회로를 통해 커플러에 인가되는 전력을 감지할 수 있다. 다른 예시에서, 무선 통신 회로는 감지된 커플러에 인가되는 전력의 전력 데이터를 프로세서로 전송할 수 있으며, 프로세서는 무선 통신 회로로부 터 수신한 전력 데이터에 기초하여, 안테나에 인가되는 전력의 크기를 조절할 수 있다. 일 실시예에 따르면, 안테나는 외부 전자 장치로 RF 신호를 송신하거나, 외부 전자 장치로부터 RF 신호를 수신할 수 있다. 일 예시에서, 안테나는 전자 장치의 측면의 적어도 일부를 형성하는 측면 부재(예: 도 3의 측면 부재)의 도전성 부분(예: 도 3의 도전성 부분)을 포함할 수 있으나, 이에 한정되는 것은 아니다. 도전성 부분의 적어도 일부는 안테나의 방사체로 동작할 수 있다. 다른 예로, 안테나는 PIFA 안테나(planar inverted-F antenna), 패치 안테나(patch antenna), LDS 안테나(laser direct structuringantenna) 또는 슬롯 안테나(slot antenna)를 포함할 수 있으나, 이에 한정되는 것은 아니다. 일 실시예에 따르면, 전압 감지부는 안테나에 인가되는 최대 전압(VRF)(예: 도 3의 VRF)를 감지할 수 있다. 일 예시에서, 무선 통신 회로와 안테나 사이의 전기적 경로(L)를 통해 안테나에 공급되는 출력 신호가 안테나로 전송됨에 따라, 안테나에는 전압이 인가될 수 있다. 다른 예시에서, 전압 감지 부는 안테나와 전기적으로 연결되어, 안테나에 인가되는 최대 전압(VRF)을 감지할 수 있다. 또 다른 예시에서, 전압 감지부는 프로세서와 전기적으로 연결될 수 있으며, 전압 감지부는 안테나 에 인가되는 최대 전압(VRF)을 감지하고, 감지된 최대 전압(VRF) 데이터를 프로세서로 전송할 수 있다. 예를 들어, 프로세서는 어플리케이션 프로세서 또는 통신 프로세서를 포함할 수 있다. 일 예시에서, 아날로그디지털 변환기는 전압 감지부로부터 수신한 안테나에 인가되는 최대 전압 (VRF)을 디지털 신호로 변환할 수 있으며, 변환된 디지털 신호는 프로세서로 전송될 수 있다. 도 5를 참조하면, 전압 감지부는, 일 예시에서, 연산 증폭기(OP-AMP, operational amplifier)를 포 함하는 회로일 수 있다. 예를 들어, 연산 증폭기와 안테나 사이에는 연산 증폭기와 안테나(45 0)를 전기적으로 연결하는 제1 경로(A1)가 형성될 수 있다. 다른 예로, 연산 증폭기와 아날로그디지털 변 환기 사이에는 연산 증폭기와 아날로그디지털 변환기를 전기적으로 연결하는 제2 경로(A2)가 형 성될 수 있다. 일 예시에서, 연산 증폭기에는 구동 전압(Vcc)(또는 “정격 전압”)이 인가될 수 있으며, 연 산 증폭기의 구동에 의해 제1 경로(A1)를 통해 연산 증폭기로 입력되는 안테나에 인가되는 최대 전압(VRF)은 제2 경로(A2)를 통해 아날로그디지털 변환기로 전송될 수 있다. 다른 예시에서, 연산 증폭기는 제1 경로(A1)를 통해 입력되는 안테나에 인가되는 최대 전압(VRF)과 지 정된 전압 값(variable reference voltage)를 비교하고, 안테나에 인가되는 최대 전압(VRF)이 지정된 전압 값보다 큰 경우에는 아날로그디지털 변환기에 안테나에 인가되는 최대 전압(VRF) 값이 아닌 구동 전압 (또는 “정격 전압”)과 대응되는 전압을 전송할 수 있다. 예를 들어, 지정된 전압 값보다 큰 최대 전압(VRF)이 아날로그디지털 변환기로 전달되는 경우, 회로의 또는 아날로그디지털 변환기의 손상이 발생할 수 있 다. 일 실시예에 따른 연산 증폭기는, 안테나에 인가되는 최대 전압(VRF)이 지정된 전압 값보다 큰 경 우에는 아날로그디지털 변환기에 구동 전압(또는 “정격 전압”)과 대응되는 전압을 전송함으로써, 회로 및/또는 아날로그디지털 변환기의 손상을 방지할 수 있다. 도면 상에는 전압 감지부가 연산 증폭기 를 포함하는 회로인 실시예에 대해서만 기재되어 있으나, 전압 감지부의 구성이 도시된 실시예에 한 정되는 것은 아니다. 일 실시예에 따르면, 프로세서는 무선 통신 회로와 전기적으로 연결될 수 있다. 일 예시에서, 프로세 서는 무선 통신 회로를 통해, 전자 장치의 무선 통신을 제어할 수 있다. 예를 들어, 프로세서 는 무선 통신 회로를 통해 안테나에 공급되는 전력의 크기를 조절할 수 있다. 일 실시예에 따르면, 프로세서는 전압 감지부와 전기적으로 연결될 수 있다. 예를 들어, 프로세서 는 아날로그디지털 변환기를 통해 전압 감지부와 전기적으로 연결될 수 있으며, 아날로그디지털 변환기로부터 디지털 신호로 변환된 안테나에 인가되는 최대 전압(VRF) 데이터를 수신할 수 있다. 일 실시예에서, 프로세서는 안테나에 인가되는 최대 전압(VRF)에 기초하여, 전자 장치에 대한 외 부 객체의 근접 여부를 판단할 수 있다. 외부 객체는, 예를 들어, 사용자의 인체를 포함할 수 있으나, 이에 한 정되는 것은 아니다. 일 예시에서, 프로세서는 메모리와 전기적으로 연결될 수 있으며, 메모리에는 안테나에 인 가되는 전력의 크기에 대응되는 안테나의 지정된 최대 전압(VRF)의 범위에 대한 데이터가 저장될 수 있다. 예를 들어, 메모리에는 안테나에 인가되는 전력의 크기에 대응되는 안테나의 지정된 최대 전압 (VRF)의 범위에 대한 데이터가 룩업 테이블(look-up table)로 저장될 수 있으나, 이에 한정되는 것은 아니다. 일 실시예에 따르면, 프로세서는 전압 감지부 및/또는 아날로그디지털 변환기로부터 수신한 안 테나에 인가되는 최대 전압(VRF)과 메모리에 저장된 안테나에 인가되는 전력의 크기에 대응되는지정된 최대 전압(VRF)의 범위를 비교하여, 외부 객체의 근접 여부를 판단할 수 있다. 외부 객체가 근접한다는 것은 외부 객체가 전자 장치와 인접한 위치에 배치되는 경우 및/또는 외부 객체가 전자 장치와 접촉 한 경우를 포함할 수 있으며, 해당 표현은 이하에서도 실질적으로 동일한 의미로 사용될 수 있다. 일 예시에서, 프로세서는 안테나에 인가되는 최대 전압(VRF)과 지정된 최대 전압(VRF)의 범위를 비교 하고, 안테나에 인가되는 최대 전압(VRF)이 지정된 최대 전압(VRF)의 범위를 벗어난 것으로 판단되는 경우, 외부 객체가 전자 장치에 근접한 것으로 판단할 수 있다. 예를 들어, 전자 장치에 외부 객체가 근접 하지 않는 경우에는 안테나에 인가되는 최대 전압(VRF)이 지정된 최대 전압(VRF)의 범위 내에 포함될 수 있 다. 다른 예로, 전자 장치에 외부 객체가 근접하는 경우, 외부 객체에 의해 안테나의 임피던스가 변 경될 수 있으며, 안테나의 임피던스가 변경되면 안테나에 인가되는 최대 전압(VRF)이 지정된 최대 전 압(VRF)의 범위에서 벗어나게 될 수 있다. 일 실시예에 따르면, 전자 장치는 외부 객체의 근접 여부에 대응 하여 안테나에 인가되는 최대 전압(VRF)이 변경되는 것에 기초하여 외부 객체의 근접 여부를 판단할 수 있 으므로, 그립 센서(grip sensor)를 포함하지 않고도 외부 객체의 근접 여부를 감지할 수 있다. 일 실시예에서, 프로세서는 전자 장치에 대해 외부 객체가 근접하였다는 판단에 기초하여, 안테나 에 공급되는 전력의 크기를 조절할 수 있다. 예를 들어, 프로세서는 외부 객체가 전자 장치에 근접한 것으로 판단되는 경우, 안테나에 공급 또는 인가되는 전력의 크기를 줄일 수 있다. 일 실시예에 따 르면, 전자 장치는, 프로세서의 상술한 동작을 통해, 전자파 흡수율 규격(또는 \"SAR(specific absorption rate) 규격\")을 충족시킬 수 있다. 일 실시예에서, 프로세서는 커플러에 인가되는 전력에 기초하여, 안테나에 공급되는 전력이 조 절되었는지 여부를 확인할 수 있다. 일 예시에서, 무선 통신 회로는 전력 감지 회로를 통해 커플러에 인가되는 전력을 감지할 수 있으며, 감지된 커플러에 인가되는 전력의 전력 데이터는 프로세서로 전 송될 수 있다. 예를 들어, 커플러에 인가되는 전력의 일부는 무선 통신 회로로 전송될 수 있다. 다른 예시에서, 프로세서는 무선 통신 회로로부터 수신한 커플러에 인가되는 전력의 전력 데이터와 안테나에 인가되는 전력에 대응되는 지정된 커플러 전력 값을 비교하여, 안테나에 공급 또는 인 가되는 전력이 조절되었는지 여부를 확인할 수 있다. 예를 들어, 메모리에는 안테나에 인가되는 전력 에 대응되는 지정된 커플러 전력 값이 저장될 수 있으며, 프로세서는 메모리에 저장된 지정된 커플러 전력 값과 무선 통신 회로로부터 수신한 커플러에 인가되는 전력의 전력 데이터를 비교 할 수 있다. 일 예시에서, 프로세서는 커플러에 인가되는 전력의 전력 데이터와 메모리에 저장된 안테나 에 인가되는 전력에 대응되는 지정된 커플러 전력 값과 대응되는지 판단함으로써, 안테나에 공 급되는 전력의 크기가 지정한 전력의 크기로 조절되었는지 여부를 확인할 수 있다. 다른 예시에서, 프로세서 는 커플러에 인가되는 전력의 전력 데이터가 지정된 커플러 전력 값과 대응되지 않는 것으로 판 단되면, 안테나에 공급되는 전력의 크기를 다시 조절할 수 있다. 도 6은, 일 실시예에 따라, 객체의 근접 여부를 감지하고, 안테나에 인가되는 전력을 조절하는 동작을 설명하기 위한 흐름도다. 이하에서, 도 6의 객체의 근접 여부를 감지하고, 안테나에 인가되는 전력을 조절하는 동작을 설 명함에 있어, 앞선 도 4에 도시된 구성을 참고하도록 한다. 도 6을 참조하면, 동작 601에서, 일 실시예에 따른 전자 장치(예: 도 4의 전자 장치)는, 안테나 (예: 도 4의 안테나)와 전기적으로 연결된 전압 감지부(예: 도 4의 전압 감지부)를 이용하 여, 안테나에 인가되는 최대 전압(VRF)을 감지할 수 있다. 일 예시에서, 전압 감지부를 통해 획득된 안테나에 인가되는 최대 전압(VRF) 데이터는, 전압 감지부와 전기적으로 연결된 프로세서(예: 도 4의 프로세서)로 전송될 수 있다. 동작 602에서, 일 실시예에 따른 전자 장치의 프로세서는, 동작 601에서 감지된 안테나에 인가 되는 최대 전압(VRF)에 기초하여, 전자 장치에 대한 외부 객체(예: 사용자의 인체)의 근접 여부를 판단할 수 있다. 예를 들어, 외부 객체가 전자 장치가 근접하는 경우, 안테나의 임피던스 값이 변경될 수 있 다. 다른 예로, 안테나의 임피던스 값이 변경됨에 따라, 안테나에 공급 또는 인가되는 전력 대비 안 테나에 인가되는 최대 전압(VRF) 또한 변경될 수 있다. 일 실시예에서, 프로세서는 안테나에 인가되는 최대 전압(VRF)과 메모리(예: 도 4의 메모리)에 저장된 안테나에 인가되는 전력에 대응되 는 지정된 최대 전압(VRF)의 범위와 비교함으로써, 전자 장치에 대한 외부 객체의 근접 여부를 감지할 수 있다. 예를 들어, 프로세서는, 안테나에 인가되는 최대 전압(VRF)이 안테나에 인가되는 전력에 대응되는 지정된 최대 전압(VRF)의 범위에 속하는 경우, 외부 객체가 근접하지 않은 것으로 판단할 수 있다. 다 른 예로, 프로세서는, 안테나에 인가되는 최대 전압(VRF)이 안테나에 인가되는 전력에 대응되는 지정된 최대 전압(VRF)의 범위에서 벗어나는 경우, 전자 장치에 대해 외부 객체가 근접한 것으로 판단할 수 있다. 프로세서는, 예를 들어, 안테나에 인가되는 최대 전압(VRF)이 지정된 최대 전압(VRF)의 범위의 최대값보다 크거나, 이 지정된 최대 전압(VRF)의 범위의 최소값보다 작은 경우, 외부 객체가 근접한 것으로 판단 할 수 있다. 동작 603에서, 일 실시예에 따른 전자 장치의 프로세서는, 동작 602에서의 외부 객체의 근접 여부에 대한 판단에 기초하여, 안테나에 인가되는 전력을 조절할 수 있다. 일 예시에서, 프로세서는, 동작 602에서 외부 객체가 근접한 것으로 판단되는 경우, 안테나에 인가되는 전력의 크기를 줄일 수 있다. 다른 예시에서, 프로세서는, 동작 602에서 외부 객체가 근접하지 않은 것으로 판단되는 경우, 안테나에 인 가되는 전력의 크기를 유지할 수 있다. 일 실시예에 따르면, 전자 장치는 동작 601 내지 동작 603을 통해 전자 장치에 대해 외부 객체가 근접하였을 때, 안테나에 인가되는 전력을 줄일 수 있다. 이에 따라, 전자 장치는, 전자파 흡수율 규격(또는 \"SAR(specific absorption rate) 규격\")을 충족시킬 수 있다. 도 7은, 일 실시예에 따라, 객체의 근접 여부를 감지하고, 안테나에 인가되는 전력을 조절하는 동작을 설명하기 위한 흐름도이다. 이하에서, 도 7의 객체의 근접 여부를 감지하고, 안테나에 인가되는 전력을 조절하는 동작을 설명함에 있어, 앞선 도 4에 도시된 구성을 참고하도록 한다. 도 7을 참조하면, 동작 701에서, 일 실시예에 따른 전자 장치는, 전압 감지부(예: 도 4의 전압 감지 부)를 이용하여, 안테나(예: 도 4의 안테나)에 인가되는 최대 전압(VRF)을 감지할 수 있다. 일 예시에서, 무선 통신 회로(예: 도 4의 무선 통신 회로)를 통해 안테나에 전력이 공급 또는 인가 됨에 따라, 안테나에 교류 전압(AC 전압)이 인가될 수 있다. 다른 예시에서, 전압 감지부는 안테나 와 전기적으로 연결되어, 안테나에 인가되는 최대 전압(VRF)을 감지할 수 있다. 동작 702에서, 일 실시예에 따른 전자 장치의 프로세서(예: 도 4의 프로세서)는, 동작 701에서 감지된 안테나에 인가되는 최대 전압(VRF)을 안테나에 인가되는 전력에 대응되는 지정된 최대 전압 (VRF)의 범위와 비교할 수 있다. 일 예시에서, 프로세서는 전압 감지부로부터 안테나에 인가되는 최대 전압(VRF) 데이터를 수신할 수 있다. 다른 예시에서, 프로세서는 수신된 안테나에 인가되는 최대 전압(VRF) 데이터와 메모리(예: 도 4의 메모리)에 저장된 안테나에 인가되는 전력에 대응되는 최 대 전압(VRF)의 범위를 비교하고, 안테나에 인가되는 최대 전압(VRF)이 지정된 최대 전압(VRF)의 범위를 벗 어나는지 여부를 판단할 수 있다. 표 1 전력 (dBm)평균 VRF (Voltage)VRF min. (Voltage)VRF max. (Voltage)VRF의 범위 (Voltage)커플러 전력 (dBm) 34 31.7 28.44 34.96 28.44 ~ 34.96 4 32 25.18 22.59 27.77 22.59 ~ 27.77 2 30 20 17.945 22.055 17.945 ~ 22.055 0 28 15.89 14.255 17.525 14.255 ~ 17.525 -2 26 12.62 11.32 13.92 11.32 ~ 13.92 -4 24 10.02 8.99 11.05 8.99 ~ 11.05 -6 22 7.96 7.14 8.78 7.14 ~ 8.78 -8 20 6.32 5.67 6.97 5.67 ~ 6.97 -10 18 5.02 4.505 5.535 4.505 ~ 5.535 -12 16 3.99 1.995 5.985 1.995 ~ 5.985 -14표 1은, 메모리에 저장된 안테나에 인가되는 전력의 크기에 대응되는 지정된 최대 전압(VRF)의 범위 및/또는 커플러에 인가되는 전력의 크기의 예시를 나타낸다. 표 1을 참조하면, 프로세서는, 예를 들어, 안테나에 인가되는 전력이 34 dBm인 경우, 전압 감지부 로부터 수신한 안테나에 인가되는 최대 전압(VRF) 값이 약 28.44 V 내지 약 34.96 V의 범위에서 벗어 나는지 여부를 판단할 수 있다. 동작 703에서, 일 실시예에 따른 프로세서는, 동작 702에서 안테나에 인가되는 최대 전압(VRF)이 지정 된 최대 전압(VRF)의 범위를 벗어난 것으로 판단되는 경우, 외부 객체(예: 사용자의 인체)가 전자 장치에 근접한 것으로 판단할 수 있다. 일 예시에서, 전자 장치에 외부 객체가 근접하는 경우, 외부 객체에 의해 안테나의 임피던스가 변경될 수 있으며, 안테나의 임피던스가 변화되면 안테나에 인가되는 최대 전압(VRF)이 지정된 최대 전압(VRF)의 범위에서 벗어나게 될 수 있다. 예를 들어, 안테나에 인가되는 전력 이 34 dBm인 상태에서 외부 객체가 전자 장치에 접근하는 경우, 안테나의 임피던스가 변경되어, 안테 나에 인가되는 최대 전압(VRF)은 약 34.96 V보다 커지거나, 약 28.44 V보다 작아질 수 있다. 이에 따라, 프로세서는, 동작 702에서 안테나에 인가되는 최대 전압(VRF)이 지정된 최대 전압(VRF)의 범위를 벗어 난 것으로 판단되는 경우, 외부 객체가 전자 장치에 근접한 것으로 판단할 수 있다. 동작 704에서, 일 실시예에 따른 프로세서는, 동작 703에서의 외부 객체가 전자 장치에 근접하였다는 판단에 기초하여, 안테나에 공급 또는 인가되는 전력의 크기를 조절할 수 있다. 일 예시에서, 프로세서 는, 외부 객체가 전자 장치에 근접하였다는 판단에 기초하여, 안테나에 공급 또는 인가되는 전 력의 크기를 줄일 수 있다. 다른 예시에서, 프로세서는, 외부 객체의 근접에 대응하여 안테나에 공급 되는 전력의 크기를 줄임으로써, 전자 장치에서 생성되는 전자파를 줄일 수 있다. 동작 705에서, 일 실시예에 따른 프로세서는, 동작 702에서 안테나에 인가되는 최대 전압(VRF)이 지 정된 최대 전압(VRF)의 범위에서 벗어나지 않는 것으로 판단되는 경우, 외부 객체가 전자 장치에 근접하지 않은 것으로 판단할 수 있다. 일 예시에서, 외부 객체가 전자 장치에 근접하지 않는 경우, 안테나의 임피던스 값은 실질적으로 변하지 않으므로, 안테나에 인가되는 최대 전압(VRF)은 지정된 최대 전압(VRF) 범위에서 벗어나지 않을 수 있다. 다른 예시에서, 프로세서는, 외부 객체가 전자 장치에 근접하지 않 은 것으로 판단되는 경우, 안테나에 인가되는 전력의 크기를 유지할 수 있다. 일 실시 예에 따르면, 동작 705 수행 후 동작 706으로 진행 될 수 있다. 또 다른 예로, 동작 705 수행 후 도 7에 표시된 것과 다르게, 동작 706을 수행하지 않고 종료할 수도 있다. 동작 706에서, 일 실시예에 따른 프로세서는, 무선 통신 회로의 전력 감지 회로(power detection circuit)을 이용하여, 무선 통신 회로와 전기적으로 연결된 커플러(예: 도 4의 커플러)에 인가 되는 전력을 감지하고, 감지된 커플러에 인가되는 전력의 전력 데이터를 지정된 커플러 전력 값과 비교할 수 있다. 일 실시예에서, 메모리에는 안테나에 공급 또는 인가되는 전력에 대응되는 지정된 커플러 전력 값이 저장될 수 있으며, 프로세서는 커플러에 인가되는 전력의 전력 데이터와 메모리에 저장된 지정 된 커플러 전력 값을 비교할 수 있다. 일 예시에서, 프로세서는 커플러에 인가되는 전력의 전력 데이 터가 지정된 커플러 전력 값에 대응되는지 여부를 판단함으로써, 상술한 동작 704에서 안테나에 공급되는 전력의 크기를 조절하는 동작이 올바르게 수행되었는지 여부를 판단할 수 있다. 앞선 표 1을 참조하면, 프로세서는, 예를 들어, 704 동작에서 안테나에 공급되는 전력을 34 dBm에서 32 dBm으로 조절한 경우, 커플러에 인가되는 전력이 지정된 커플러 전력 값인 약 2 dBm에 대응되는지 여부 를 판단할 수 있다. 일 예시에서, 프로세서는 커플러에 인가되는 전력의 전력 데이터가 지정된 커플 러 전력 값에 대응되는 것으로 판단되는 경우, 동작 704에서의 전력 제어 동작이 올바르게 수행된 것으로 판단 할 수 있다. 다른 예시에서, 프로세서는 커플러에 인가되는 전력의 전력 데이터가 지정된 커플러 전 력 값과 대응되지 않는 경우, 동작 704에서의 전력 제어 동작이 올바르게 수행되지 않은 것으로 판단하고, 704 동작을 다시 수행할 수 있다. 도 8은, 다른 실시예에 따라, 전자 장치의 안테나 방사체로 동작하는 측면 부재의 일부 영역을 나타내는 도면이 다.도 8을 참조하면, 일 실시예에 따른 전자 장치(예: 도 2a, 도 2b의 전자 장치)는, 측면 부재(예: 도 2a의 측면 부재), 인쇄 회로 기판, 무선 통신 회로(예: 도 1의 무선 통신 모 듈) 및/또는 스위치 회로를 포함할 수 있다. 일 실시예에 따른 전자 장치는, 도 3의 전자 장치 (예: 도 3의 전자 장치에서 스위치 회로가 추가된 장치일 수 있다. 일 실시예에 따르면, 측면 부재는 전자 장치의 측면(예: 도 2a의 측면(210C))의 적어도 일부를 형성 할 수 있다. 일 예시에서, 측면 부재는 도전성 부분(예: 도 2a의 도전성 부분) 및/또는 적어도 하나의 비도전성 부분(812, 813)(예: 도 2a의 적어도 하나의 비도전성 부분(2182, 2183))을 포함할 수 있다. 예 를 들어, 적어도 하나의 비도전성 부분(812, 813)은 도전성 부분의 일단(예: -x 방향의 일단)에 배치되는 제1 비도전성 부분 및/또는 도전성 부분의 다른 일단(예: +x 방향의 일단)에 배치되는 제2 비도전성 부분을 포함할 수 있다. 다른 예로, 제1 비도전성 부분 및/또는 제2 비도전성 부분은 도전성 부 분을 절연시킬 수 있다. 다른 예로, 제1 비도전성 부분과 접촉하고, 제1 비도전성 부분의 -x축 방향의 측면 부재 부분, 또는 제2 비도전성 부분과 접촉하고, 제2 비도전성 부분의 +x축 방향의 측면 부재의 부분은 도전성 부재를 포함할 수 있다. 일 실시예에 따르면, 측면 부재의 도전성 부분은 무선 통신 회로 및/또는 인쇄 회로 기판 의 그라운드(ground)와 전기적으로 연결될 수 있다. 예를 들어, 도전성 부분은 제1 지점(P1)에서 무선 통 신 회로와 전기적으로 연결되고, 제1 지점(P1)으로부터 이격된 제2 지점(P2)에서 인쇄 회로 기판의 그 라운드와 전기적으로 연결될 수 있다. 일 예시에서, 도전성 부분은 상술한 전기적 연결 관계를 통해 지정 된 주파수 대역의 RF 신호를 송신 및/또는 수신하는 안테나 방사체(예: IFA 안테나(inverted F antenna))로 동 작할 수 있다. 또 다른 예로, 도전성 부분을 포함하는 안테나의 종류에 따라, 도전성 부분은 그라운 드와 전기적으로 연결 안될 수도 있다. 예를 들어, 모노폴 안테나, 또는 패치 안테나일 경우에는 도전성 부분 은 그라운드와 전기적으로 연결 안될 수 있다. 일 실시예에서, 측면 부재의 도전성 부분은 스위치 회로와 전기적으로 연결될 수 있다. 예를 들 어, 도전성 부분은 제1 지점(P1) 및/또는 제2 지점(P2)과 이격된 제3 지점(P3)에서 스위치 회로와 전 기적으로 연결될 수 있다. 일 예시에서, 스위치 회로는 도전성 부분과 전기적으로 연결되어, 도전성 부분의 전기적 길이를 선택적으로 변경할 수 있다. 예를 들어, 스위치 회로는 도전성 부분을 집 중 정수 소자(lumped elements)(예: 커패시터, 인덕터, 저항)와 전기적으로 연결하여, 도전성 부분의 전기 적 길이를 늘이거나 줄일 수 있다. 다른 예로, 스위치 회로는 도전성 부분을 인쇄 회로 기판의 그라운드와 전기적으로 연결하거나, 회로적으로 오픈(open)되도록 할 수도 있다. 스위치 회로에 의해 도전 성 부분의 전기적 길이가 변경됨에 따라, 도전성 부분의 공진 주파수가 변경될 수 있다. 도면 상에 도시되지 않았으나, 스위치 회로는 무선 통신 회로 또는 프로세서(미도시)(예: 도 1의 프로세서 ) 중 적어도 하나와 전기적으로 연결될 수 있으며, 무선 통신 회로 또는 프로세서 중 적어도 하나는 스위치 회로의 동작을 제어할 수 있다. 일 실시예에서, 도전성 부분은 인쇄 회로 기판 방향으로 돌출되어 형성되는 적어도 하나의 돌출부 (8111, 8112, 8113)를 포함할 수 있다. 예를 들어, 도전성 부분은 제1 돌출부, 제1 돌출부와 이격되어 배치되는 제2 돌출부 및/또는 제1 돌출부, 제2 돌출부와 이격되어 배치되는 제3 돌 출부를 포함할 수 있다. 다른 예로, 제1 지점(P1)은 제1 돌출부의 적어도 일 영역과 대응되는 지점 을 의미하고, 제2 지점(P2)은 제2 돌출부의 적어도 일 영역과 대응되는 지점을 의미할 수 있다. 또 다른 예로, 제3 지점(P3)은 제3 돌출부의 적어도 일 영역과 대응되는 지점을 의미할 수 있으나, 제1 지점(P1), 제2 지점(P2) 및/또는 제3 지점(P3)의 위치가 상술한 실시예에 한정되는 것은 아니다. 일 실시예에서, 도전성 부분의 제1 지점(P1)을 통해 무선 통신 회로에서 도전성 부분으로 전압 이 공급 또는 인가됨에 따라, 도전성 부분과 전기적으로 연결된 스위치 회로에는 최대 전압(VRF)이 인 가될 수 있다. 일 실시예에 따르면, 전자 장치는 안테나 방사체로 동작하는 도전성 부분과 전기적으로 연결된 스위 치 회로에 인가되는 최대 전압(VRF)을 감지하고, 감지된 최대 전압(VRF)에 기초하여 전자 장치에 대한 외부 객체(예: 사용자의 인체)의 근접 여부를 감지할 수 있다. 전자 장치의 최대 전압(VRF)을 감지하고, 외부 객체의 근접 여부를 감지하는 동작에 대한 설명은 후술하도록 한다. 도 9는, 다른 실시예에 따른 전자 장치의 구성을 설명하기 위한 도면이고, 도 10은, 다른 실시예에 따른 전자 장치의 스위치 회로를 나타내는 도면이며, 도 11은, 안테나에 인가되는 전압의 위상 변화에 따른 최대 전압(VRF) 값의 변화를 나타내는 그래프이다. 도 9, 도 10 및 도 11을 참조하면, 일 실시예에 따른 전자 장치(예: 도 2a, 도 2b의 전자 장치 또는 도 8의 전자 장치)는, 무선 통신 회로(예: 도 8의 무선 통신 회로), 전력 증폭기(power amplifier), 필터(filter), 커플러, 안테나, 스위치 회로(예: 도 8의 스위치 회로 ), 전압 감지부, 아날로그디지털 변환기(ADC: analog-digital converter), 프로세서(예: 도 1의 프로세서) 및/또는 메모리(예: 도 1의 메모리)를 포함할 수 있다. 일 실시예에 따르면, 무선 통신 회로는 안테나와 전기적으로 연결되어, 전자 장치와 외부 전자 장치(예: 도 1의 전자 장치(102, 104)) 사이의 무선 통신을 지원할 수 있다. 예를 들어, 무선 통신 회로는 안테나에 전력이 설정된 신호를 급전(feeding)함으로써, 외부 전자 장치로 RF(radio frequency) 신호를 송 신할 수 있다. 다른 예로, 무선 통신 회로는 안테나를 통해 외부 전자 장치로부터 RF 신호를 수신할 수 있다. 일 실시예에 따르면, 무선 통신 회로와 안테나 사이에는 무선 통신 회로와 안테나를 전기 적으로 연결하는 전기적 경로(L)가 형성될 수 있다. 상술한 전기적 경로(L) 상에는, 예를 들어, 전력 증폭기 , 필터 및/또는 커플러가 배치될 수 있다. 다른 실시예(미도시)에 따른 전자 장치에서는, 전력 증폭기, 필터 또는 커플러 중 적어도 하나(예: 커플러)가 생략되거나, 다른 구성이 추가될 수도 있다. 일 예시에서, 전력 증폭기는 무선 통신 회로로부터 출력되는 안테나에 인가되는 전력이 설정된 신호(이하, “출력 신호”)를 증폭시킬 수 있으며, 전력 증폭기에 의해 증폭된 출력 신호는 안테나로 전송될 수 있다. 다른 예시에서, 필터는 안테나와 전력 증폭기 사이에 위치하여, 전력 증폭기 를 통해 증폭된 출력 신호의 노이즈(noise)를 제거 또는 필터링(filtering)할 수 있다. 일 예시에서, 커플러는 안테나 및/또는 무선 통신 회로와 전기적으로 연결될 수 있으며, 무선 통신 회로에서 안테나에 공급 또는 인가되는 전력의 일부를 유기하여 무선 통신 회로로 피드백 할 수 있다. 다른 예시에서, 커플러는 안테나에 인가되는 전력의 적어도 일부를 유기하고, 유기된 전 력 신호를 무선 통신 회로로 피드백(feedback)할 수 있다. 무선 통신 회로는, 예를 들어, 커플러 로부터 안테나에 인가되는 전력의 적어도 일부가 유기된 전력 신호를 수신하고, 수신된 전력 신호에 기초하여 안테나에 공급 또는 인가되는 전력의 크기를 조절할 수 있다. 일 실시예에 따르면, 무선 통신 회로는 커플러와 전기적으로 연결되는 전력 감지 회로(power detection circuit)(미도시)를 더 포함할 수 있다. 일 예시에서, 무선 통신 회로는 전력 감지 회로를 통해 커플러에 인가되는 전력을 감지할 수 있다. 다른 예시에서, 무선 통신 회로는 감지된 커플러에 인가되는 전력의 전력 데이터를 프로세서로 전송할 수 있으며, 프로세서는 무선 통신 회로로 부터 수신한 전력 데이터에 기초하여, 안테나에 인가되는 전력의 크기를 조절할 수 있다. 일 실시예에 따르면, 안테나는 외부 전자 장치로 RF 신호를 송신하거나, 외부 전자 장치로부터 RF 신호를 수신할 수 있다. 일 예시에서, 안테나는 전자 장치의 측면의 적어도 일부를 형성하는 측면 부재(예: 도 3의 측면 부재)의 도전성 부분(예: 도 3의 도전성 부분)을 포함할 수 있으나, 이에 한정되는 것은 아니다. 도전성 부분의 적어도 일부는 안테나의 방사체로 동작할 수 있다. 다른 예로, 안테나는 PIFA 안테나(planar inverted-F antenna), 패치 안테나(patch antenna), LDS 안테나(laser direct structuring antenna) 또는 슬롯 안테나(slot antenna)를 포함할 수 있으나, 이에 한정되는 것은 아니다. 일 실시예에 따르면, 스위치 회로는 안테나와 전기적으로 연결될 수 있으며, 스위치 회로의 전 기적 연결 상태가 변경됨에 따라 안테나의 전기적 길이가 변경될 수 있다. 예를 들어, 스위치 회로와 안테나 사이에는 스위치 회로와 안테나를 전기적으로 연결하는 제1 경로(B1)가 형성될 수 있다. 일 예시에서, 스위치 회로는 안테나를 집중 정수 소자(lumped elements)(예: 커패시터, 인덕터, 또는 저항)에 선택적으로 연결하거나, 안테나를 그라운드(예: 도 8의 인쇄 회로 기판의 그라운드)와 선택 적으로 연결할 수 있다. 다른 예시에서, 스위치 회로는 프로세서와 전기적으로 연결될 수 있으며,프로세서는 스위치 회로의 전기적 연결 상태를 제어할 수 있다. 예를 들어, 스위치 회로와 프 로세서 사이에는 스위치 회로와 프로세서를 전기적으로 연결하는 제2 경로(B2)가 형성될 수 있다. 다른 실시예(미도시)에 따르면, 스위치 회로는 무선 통신 회로와 전기적으로 연결될 수 있으며, 무선 통신 회로가 스위치 회로의 전기적 연결 상태를 제어할 수도 있다. 일 실시예에서, 스위치 회로는 무선 통신 회로와 안테나 사이의 전기적 경로(L)와 병렬 연결되 는 스위치 회로일 수 있으나, 이에 한정되는 것은 아니다. 다른 실시예(미도시)에 따르면, 스위치 회로는 전기적 경로(L) 상에 직렬 연결되는 스위치 회로일 수도 있다. 도 10을 참조하면, 일 실시예에서, 스위치 회로는, 복수의 FET(field effect transistor) 스위치가 스태 킹(stacking)된 회로일 수 있다. 예를 들어, 스위치 회로는 복수의 FET 스위치가 직렬 연결된 회로일 수 있다. 도 11에서 RSD 및/또는 RG는 복수의 FET 스위치에 전압을 인가하기 위한 저항을 의미할 수 있다. 일 실시예에서, 무선 통신 회로에서 안테나로 전력이 공급 또는 인가됨에 따라, 안테나와 전기 적으로 연결된 스위치 회로에는 최대 전압(VRF)(peak voltage)이 인가될 수 있다. 일 예시에서, 스위치 회 로가 복수의 FET 스위치가 직렬 연결된 회로인 경우, 스위치 회로에 인가되는 전압은 각각의 FET 스 위치에 분배될 수 있다. 예를 들어, 스위치 회로가 n개의 FET 스위치가 직렬 연결된 회로인 경우, 각각의 FET 스위치에는 스위치 회로 전체에 인가되는 전압의 1/n 만큼의 전압이 인가될 수 있다. 일 실시예에 따르면, 전압 감지부는 스위치 회로와 전기적으로 연결되어, 스위치 회로에 인가되 는 최대 전압(VRF)(예: 도 8의 최대 전압(VRF))을 감지할 수 있다. 일 예시에서, 전압 감지부는 도 4의 전 압 감지부 및/또는 도 5의 전압 감지부와 동일 또는 유사할 수 있으며, 이하 중복되는 설명은 생략하 도록 한다. 도 10을 참조하면, 일 실시예에서, 전압 감지부는 스위치 회로에 포함된 복수의 FET 스위치 중 적어 도 하나의 FET 스위치와 전기적으로 연결될 수 있다. 일 예시에서, 전압 감지부는 복수의 FET 스위치 중 적어도 하나의 FET 스위치에 인가되는 최대 전압(예: VRF/n)을 감지하고, 감지된 FET 스위치에 인가되는 최대 전 압에 기초하여 스위치 회로 전체에 인가되는 최대 전압(VRF)을 감지할 수 있다. 예를 들어, 전압 감지부 는 제1 지점(D1)에서 제1 FET 스위치와 전기적으로 연결되어, 제1 FET 스위치에 인가되는 최대 전압(VRF/ n)을 감지하고, 감지된 제1 FET 스위치의 최대 전압(VRF/n)에 기초하여, 스위치 회로 전체에 인가되는 최대 전압(VRF)을 감지할 수 있다. 다른 실시예에서, 전압 감지부는 스위치 회로에 포함된 복수의 FET 스위치 중 적어도 두 개의 FET 스 위치와 전기적으로 연결될 수 있다. 일 예시에서, 전압 감지부는 복수의 FET 스위치 중 적어도 두 개의 FET 스위치와 전기적으로 연결되어, 스위치 회로에 인가되는 최대 전압(VRF) 및/또는 스위치 회로에 인가되는 전압의 위상 변화를 감지할 수 있다. 예를 들어, 전압 감지부는 제1 지점(D1)에서 제1 FET 스위 치와 전기적으로 연결되고, 제2 지점(D2)에서 제2 FET 스위치와 전기적으로 연결될 수 있다. 다른 예로, 전압 감지부는 제1 FET 스위치 및/또는 제2 FET 스위치에 인가되는 최대 전압(VRF/n)에 기초하여 스위치 회로 전체에 인가되는 최대 전압(VRF)을 감지할 수 있다. 또 다른 예로, 전압 감지부는 제1 FET 스위치와 제2 FET 스위치에 인가되는 전압의 위상 차이에 기초하여, 스위치 회로에 인가되는 전압의 위상 변화를 감 지할 수 있다. 다른 예시에서, 전압 감지부를 통해 감지된 스위치 회로에 인가되는 최대 전압(VRF) 및 /또는 스위치 회로에 인가되는 전압의 위상 변화 데이터는 전압 감지부와 전기적으로 연결된 프로세 서로 전송될 수 있다. 일 실시예에 따르면, 전압 감지부에서 감지된 스위치 회로의 최대 전압(VRF) 및/또는 스위치 회로 에 인가되는 전압의 위상 변화 데이터는 아날로그디지털 변환기를 통해 디지털 신호로 변환될 수 있 다. 일 예시에서, 아날로그디지털 변환기에 의해 변환된 디지털 신호는 프로세서로 전송될 수 있으 며, 프로세서는 디지털 신호에 기초하여 스위치 회로에 인가되는 최대 전압(VRF) 및/또는 스위치 회 로에 인가되는 전압의 위상 변화 데이터를 획득할 수 있다. 일 실시예에 따르면, 프로세서는 무선 통신 회로와 전기적으로 연결될 수 있다. 일 예시에서, 프로 세서는 무선 통신 회로를 통해, 전자 장치의 무선 통신을 제어할 수 있다. 예를 들어, 프로세 서는 무선 통신 회로를 통해 안테나에 공급되는 전력의 크기를 조절할 수 있다. 일 실시예에 따르면, 프로세서는 전압 감지부와 전기적으로 연결되어, 전압 감지부에서 감지된 스위치 회로에 인가되는 최대 전압(VRF) 및/또는 스위치 회로에 인가되는 전압의 위상 변화에 대한 데 이터를 수신할 수 있다. 일 실시예에서, 프로세서는 스위치 회로에 인가되는 최대 전압(VRF) 및/또는 스위치 회로에 인 가되는 전압의 위상 변화에 기초하여, 전자 장치에 대한 외부 객체의 근접 여부를 판단할 수 있다. 외부 객체는, 예를 들어, 사용자의 인체를 포함할 수 있으나, 이에 한정되는 것은 아니다. 도 11은 안테나의 전압 정재파비(VSWR: voltage standing wave ratio)가 3:1이고, 안테나에 공급 또 는 인가되는 전력이 일정한 조건에서, 스위치 회로에 인가되는 전압의 위상(phase) 변화에 따른 스위치 회 로의 인가되는 최대 전압(VRF)의 변화를 나타낸다. 도 11을 참조하면, 스위치 회로에 인가되는 최대 전압(VRF)은, 무선 통신 회로에서 안테나에 공 급 또는 인가되는 전력 뿐만 아니라, 스위치 회로에 인가되는 전압의 위상 변화에 의해서도 가변될 수 있 음을 확인할 수 있다. 이에 따라, 프로세서는, 스위치 회로에 인가되는 최대 전압(VRF) 및 스위치 회 로에 인가되는 전압의 위상 변화에 기초하여, 전자 장치에 대한 외부 객체의 근접 여부를 판단할 수 있다. 일 실시예에서, 프로세서는 메모리와 전기적으로 연결될 수 있으며, 메모리에는 안테나(95 0)에 인가되는 전력의 크기 및/또는 스위치 회로에 인가되는 전압의 위상(phase)에 대응되는 스위치 회로 의 지정된 최대 전압(VRF)의 범위에 대한 데이터가 저장될 수 있다. 예를 들어, 메모리에는 안테나 에 인가되는 전력의 크기 및/또는 스위치 회로에 인가되는 전압의 위상(phase)에 대응되는 스위치 회 로의 지정된 최대 전압(VRF)의 범위에 대한 데이터가 룩업 테이블(look-up table)로 저장될 수 있으나, 이 에 한정되는 것은 아니다. 일 실시예에 따르면, 프로세서는 전압 감지부 및/또는 아날로그디지털 변환기로부터 수신한 스 위치 회로에 인가되는 최대 전압(VRF)과 메모리에 저장된 스위치 회로의 지정된 최대 전압 (VRF)의 범위를 비교하여, 외부 객체의 근접 여부를 감지할 수 있다. 외부 객체가 근접한다는 것은 외부 객체가 전자 장치와 인접한 위치에 배치되는 경우 및/또는 외부 객체가 전자 장치와 접촉한 경우를 포함할 수 있으며, 해당 표현은 이하에서도 동일한 의미로 사용될 수 있다. 일 예시에서, 프로세서는 스위치 회로에 인가되는 최대 전압(VRF)과 지정된 최대 전압(VRF)의 범위를 비교하고, 스위치 회로에 인가되는 최대 전압(VRF)이 지정된 최대 전압(VRF)의 범위를 벗어난 것으로 판단 되는 경우, 외부 객체가 전자 장치에 근접한 것으로 판단할 수 있다. 예를 들어, 전자 장치에 외부 객체가 근접하지 않는 경우에는 스위치 회로에 인가되는 최대 전압(VRF)이 지정된 최대 전압(VRF)의 범위 내에 포함될 수 있다. 다른 예로, 전자 장치에 외부 객체가 근접하는 경우, 외부 객체에 의해 안테나(95 0)의 임피던스가 변경될 수 있다. 안테나의 임피던스가 변경됨에 따라, 스위치 회로에 인가되는 최대 전압(VRF)은 지정된 최대 전압(VRF)의 범위에서 벗어나게 될 수 있다. 일 실시예에 따르면, 전자 장치는 외 부 객체의 근접 여부에 대응하여 스위치 회로에 인가되는 최대 전압(VRF)이 변경되는 것에 기초하여 외부 객체의 근접 여부를 판단할 수 있으므로, 그립 센서(grip sensor)를 포함하지 않고도 외부 객체의 근접 여부를 감지할 수 있다. 일 실시예에서, 프로세서는 전자 장치에 대해 외부 객체가 근접하였다는 판단에 기초하여, 안테나 에 공급되는 전력의 크기를 조절할 수 있다. 예를 들어, 프로세서는 외부 객체가 전자 장치에 근접한 것으로 판단되는 경우, 안테나에 공급 또는 인가되는 전력의 크기를 줄일 수 있다. 일 실시예에 따 르면, 전자 장치는, 프로세서의 상술한 동작을 통해, 전자파 흡수율 규격(또는 \"SAR(specific absorption rate) 규격\")을 충족시킬 수 있다. 일 실시예에서, 프로세서는 전자 장치에 대해 외부 객체가 근접하였다는 판단에 기초하여, 스위치 회로를 제어할 수 있다. 예를 들어, 외부 객체가 근접한 경우, 프로세서는 안테나의 동작 주파수의 인피던스 매칭을 하기 위해 집중 정수 소자(lumped elements)(예: 커패시터, 인덕터, 또는 저항)에 선택적 으로 연결하거나, 그라운드(예: 도 8의 인쇄 회로 기판의 그라운드)와 선택적으로 연결하도록 스위치 회로 를 제어할 수 있다. 일 실시예에서, 프로세서는 커플러에 인가되는 전력에 기초하여, 안테나에 공급되는 전력이 조 절되었는지 여부를 확인할 수 있다. 일 예시에서, 무선 통신 회로는 전력 감지 회로를 통해 커플러에 인가되는 전력을 감지할 수 있으며, 감지된 커플러에 인가되는 전력의 전력 데이터는 프로세서로 전 송될 수 있다. 다른 예시에서, 프로세서는 무선 통신 회로로부터 수신한 커플러에 인가되는 전 력의 전력 데이터와 안테나에 공급 또는 인가되는 전력에 대응되는 지정된 커플러 전력 값을 비교하 여, 안테나에 공급 또는 인가되는 전력이 조절되었는지 여부를 확인할 수 있다. 예를 들어, 메모리 에는 안테나에 인가되는 전력에 대응되는 지정된 커플러 전력 값이 저장될 수 있으며, 프로세서 는 메모리에 저장된 지정된 커플러 전력 값과 무선 통신 회로로부터 수신한 커플러(94 0)에 인가되는 전력을 비교할 수 있다. 일 예시에서, 프로세서는 커플러에 인가되는 전력의 전력 데이터와 메모리에 저장된 안테나 에 인가되는 전력에 대응되는 지정된 커플러 전력 값과 대응되는지 판단함으로써, 안테나에 공 급되는 전력의 크기가 지정된 전력의 크기로 조절되었는지 여부를 확인할 수 있다. 다른 예시에서, 프로세서 는 커플러에 인가되는 전력의 전력 데이터가 지정된 커플러 전력 값과 대응되지 않는 것으로 판단되면, 안테나에 공급되는 전력의 크기를 다시 조절할 수 있다. 예를 들어, 전력 데이터는 전력의 크기 를 포함할 수 있다. 도 12는, 다른 실시예에 따라, 객체의 근접 여부를 감지하고, 안테나에 인가되는 전력을 조절하는 동작을 설명 하기 위한 흐름도다. 이하에서, 도 12의 객체의 근접 여부를 감지하고, 안테나에 인가되는 전력을 조절하는 동 작을 설명함에 있어, 앞선 도 9에 도시된 구성을 참고하도록 한다. 도 12를 참조하면, 동작 1201에서, 일 실시예에 따른 전자 장치(예: 도 9의 전자 장치)는, 전압 감지 부(예: 도 9의 전압 감지부)를 이용하여, 스위치 회로(예: 도 9의 스위치 회로)에 인가되 는 최대 전압(VRF)(peak voltage) 및/또는 스위치 회로에 인가되는 전압의 위상 변화를 감지할 수 있다. 일 예시에서, 스위치 회로는 안테나(예: 도 9의 안테나)와 전기적으로 연결될 수 있다. 다른 예 시에서, 무선 통신 회로(예: 도 9의 무선 통신 회로)를 통해 안테나에 전력이 공급 또는 인가될 수 있으며, 안테나에 전력이 공급됨에 따라 스위치 회로에도 전압이 인가될 수 있다. 일 실시예에서, 전압 감지부는 스위치 회로와 전기적으로 연결되어, 스위치 회로에 인가되는 최대 전압(VRF) 및/ 또는 스위치 회로에 인가되는 전압의 위상 변화를 감지할 수 있다. 일 예시에서, 전압 감지부를 통해 획득된 스위치 회로에 인가되는 최대 전압(VRF) 및/또는 스위치 회로에 인가되는 전압의 위상 변화 데 이터는, 전압 감지부와 전기적으로 연결된 프로세서(예: 도 9의 프로세서)로 전송될 수 있다. 동작 1202에서, 일 실시예에 따른 전자 장치의 프로세서는, 동작 1201에서 감지된 스위치 회로(96 0)에 인가되는 최대 전압(VRF) 및/또는 스위치 회로에 인가되는 전압의 위상 변화 데이터에 기초하여, 전자 장치에 대한 외부 객체(예: 사용자의 인체)의 근접 여부를 판단할 수 있다. 예를 들어, 외부 객체가 전자 장치가 근접하는 경우, 안테나의 임피던스 값이 변경될 수 있다. 다른 예로, 안테나의 임피던스 값이 변경됨에 따라, 안테나와 전기적으로 연결된 스위치 회로에 인가되는 최대 전압(VRF) 또한 변경 될 수 있다. 일 실시예에서, 프로세서는 스위치 회로에 인가되는 최대 전압(VRF)과 메모리(예: 도 9의 메 모리)에 저장된 안테나에 인가되는 전력의 크기 및/또는 스위치 회로에 인가되는 전압의 위상 (phase)에 대응되는 지정된 최대 전압(VRF)의 범위와 비교함으로써, 전자 장치에 대한 외부 객체의 근접 여 부를 감지할 수 있다. 예를 들어, 프로세서는, 스위치 회로에 인가되는 최대 전압(VRF)이 지정된 최 대 전압(VRF)의 범위에 속하는 경우, 외부 객체가 근접하지 않은 것으로 판단할 수 있다. 다른 예로, 프로세서 는, 스위치 회로에 인가되는 최대 전압(VRF)이 지정된 최대 전압(VRF)의 범위에서 벗어나는 경우, 전 자 장치에 대해 외부 객체가 근접한 것으로 판단할 수 있다. 프로세서는, 예를 들어, 스위치 회로 에 인가되는 최대 전압(VRF)이 지정된 최대 전압(VRF)의 범위의 최대값보다 크거나, 이 지정된 최대 전압(VRF)의 범위의 최소값보다 작은 경우, 외부 객체가 근접한 것으로 판단할 수 있다. 동작 1203에서, 일 실시예에 따른 전자 장치의 프로세서는, 동작 1202에서의 외부 객체의 근접 여부 에 대한 판단에 기초하여, 안테나에 인가되는 전력을 조절할 수 있다. 일 예시에서, 프로세서는, 동 작 1202에서 외부 객체가 근접한 것으로 판단되는 경우, 안테나에 인가되는 전력의 크기를 줄일 수 있다. 다른 예시에서, 프로세서는, 동작 1202에서 외부 객체가 근접하지 않은 것으로 판단되는 경우, 안테나 에 인가되는 전력의 크기를 유지할 수 있다. 일 실시예에 따르면, 전자 장치는 동작 1201 내지 동작 1203을 통해 전자 장치에 대해 외부 객체가 근접하였을 때, 안테나에 인가되는 전력을 줄일 수 있다. 이에 따라, 전자 장치는, 전자파 흡수율 규격(또는 \"SAR(specific absorption rate) 규격\")을 충족시킬 수 있다. 도 13은, 다른 실시예에 따라, 객체의 근접 여부를 감지하고, 안테나에 인가되는 전력을 조절하는 동작을 설명 하기 위한 흐름도이다. 이하에서, 도 13의 객체의 근접 여부를 감지하고, 안테나에 인가되는 전력을 조절하는 동작을 설명함에 있어, 앞선 도 9에 도시된 구성을 참고하도록 한다. 도 13을 참조하면, 동작 1301에서, 일 실시예에 따른 전자 장치는, 전압 감지부(예: 도 9의 전압 감 지부)를 이용하여, 스위치 회로(예: 도 9의 스위치 회로)에 인가되는 최대 전압(VRF) 및/또는 스위치 회로에 인가되는 전압의 위상 변화를 감지할 수 있다. 일 예시에서, 스위치 회로는 안테나 (예: 도 9의 안테나)와 전기적으로 연결될 수 있다. 다른 예시에서, 무선 통신 회로(예: 도 9의 무선 통신 회로)를 통해 안테나에 전력이 공급 또는 인가될 수 있으며, 안테나에 전력이 공급됨 에 따라 스위치 회로에도 전압이 인가될 수 있다. 일 실시예에서, 전압 감지부는 스위치 회로와 전기적으로 연결되어, 스위치 회로에 인가되는 최대 전압(VRF) 및/또는 스위치 회로에 인가되는 전압 의 위상 변화를 감지할 수 있다. 동작 1301은, 도 12의 동작 1201과 실질적으로 동일 또는 유사하므로, 이하 중 복되는 설명은 생략하도록 한다. 동작 1302에서, 일 실시예에 따른 전자 장치의 프로세서(예: 도 9의 프로세서)는, 동작 1301 에서 감지된 스위치 회로에 인가되는 최대 전압(VRF)을 안테나에 인가되는 전력의 크기 및/또는 스위 치 회로에 인가되는 전압의 위상(phase)에 대응되는 스위치 회로의 지정된 최대 전압(VRF)의 범위와 비교할 수 있다. 일 실시예에서, 프로세서는 메모리(예: 도 9의 메모리)와 전기적으로 연결될 수 있으며, 메 모리에는 안테나에 인가되는 전력의 크기 및/또는 스위치 회로에 인가되는 전압의 위상(phas e)에 대응되는 스위치 회로의 지정된 최대 전압(VRF)의 범위에 대한 데이터가 저장될 수 있다. 일 예시에서, 프로세서는 전압 감지부를 통해 감지된 스위치 회로에 인가되는 최대 전압(VRF)과 메 모리에 저장된 스위치 회로의 지정된 최대 전압(VRF) 범위를 비교하고, 스위치 회로에 인가되는 최대 전압(VRF)이 지정된 최대 전압(VRF)의 범위를 벗어나는지 여부를 판단할 수 있다. 동작 1302는, 도 12의 동 작 1202와 실질적으로 동일 또는 유사할 수 있으며, 이하 중복되는 설명은 생략하도록 한다. 동작 1303에서, 일 실시예에 따른 프로세서는, 동작 1302에서 스위치 회로에 인가되는 최대 전압 (VRF)이 지정된 최대 전압(VRF)의 범위를 벗어난 것으로 판단되는 경우, 외부 객체(예: 사용자의 인체)가 전자 장치에 근접한 것으로 판단할 수 있다. 일 예시에서, 전자 장치에 외부 객체가 근접하는 경우, 외부 객체에 의해 안테나의 임피던스가 변경될 수 있다. 다른 예시에서, 안테나의 임피던스가 변경되면 안 테나에 인가되는 전압이 변경될 수 있으며, 안테나와 전기적으로 연결된 스위치 회로에 인가되 는 전압 또한 변경될 수 있다. 이에 따라, 전자 장치에 외부 객체가 근접하는 경우, 스위치 회로에 인가되는 최대 전압(VRF)이 지정된 최대 전압(VRF)의 범위에서 벗어나게 될 수 있다. 이에 따라, 프로세서(100 0)는, 동작 1302에서 스위치 회로에 인가되는 최대 전압(VRF)이 지정된 최대 전압(VRF)의 범위를 벗어난 것으로 판단되는 경우, 외부 객체가 전자 장치에 근접한 것으로 판단할 수 있다. 동작 1304에서, 일 실시예에 따른 프로세서는, 동작 1303에서의 외부 객체가 전자 장치에 근접하였 다는 판단에 기초하여, 안테나에 공급 또는 인가되는 전력의 크기를 조절할 수 있다. 일 예시에서, 프로세 서는, 외부 객체가 전자 장치에 근접하였다는 판단에 기초하여, 안테나에 공급 또는 인가되는 전력의 크기를 줄일 수 있다. 다른 예시에서, 프로세서는, 외부 객체의 근접에 대응하여 안테나에공급되는 전력의 크기를 줄임으로써, 전자 장치에서 생성되는 전자파를 줄일 수 있다. 동작 1305에서, 일 실시예에 따른 프로세서는, 동작 1302에서 스위치 회로에 인가되는 최대 전압 (VRF)이 지정된 최대 전압(VRF)의 범위에서 벗어나지 않는 것으로 판단되는 경우, 외부 객체가 전자 장치에 근접하지 않은 것으로 판단할 수 있다. 일 예시에서, 외부 객체가 전자 장치에 근접하지 않는 경우, 안테 나의 임피던스 값은 실질적으로 변하지 않으므로, 안테나와 전기적으로 연결된 스위치 회로에 인가되는 최대 전압(VRF)이 지정된 최대 전압(VRF) 범위에서 벗어나지 않을 수 있다. 다른 예시에서, 프로세서 는, 외부 객체가 전자 장치에 근접하지 않은 것으로 판단되는 경우, 안테나에 인가되는 전력의 크기를 유지할 수 있다. 일 실시 예에 따르면, 동작 1305 수행 후 동작 1306으로 진행 될 수 있다. 또 다른 예 로, 동작 1305 수행 후 도 13에 표시된 것과 다르게, 동작 1306을 수행하지 않고 종료할 수도 있다. 동작 1306에서, 일 실시예에 따른 프로세서는, 무선 통신 회로의 전력 감지 회로(power detection circuit)을 이용하여, 무선 통신 회로와 전기적으로 연결된 커플러(예: 도 9의 커플러)에 인가 되는 전력을 감지하고, 감지된 커플러에 인가되는 전력의 전력 데이터를 지정된 커플러 전력 값과 비교할 수 있다. 일 실시예에서, 메모리에는 안테나에 공급 또는 인가되는 전력에 대응되는 지정된 커플러 전력 값이 저장될 수 있으며, 프로세서는 커플러에 인가되는 전력의 전력 데이터와 메모리에 저장된 지 정된 커플러 전력 값을 비교할 수 있다. 일 예시에서, 프로세서는 커플러에 인가되는 전력의 전력 데이터가 지정된 커플러 전력 값에 대응되는지 여부를 판단함으로써, 상술한 동작 1304에서 안테나에 공급 되는 전력의 크기를 조절하는 동작이 올바르게 수행되었는지 여부를 판단할 수 있다. 예를 들어, 프로세서 는 동작 1304에서 안테나에 공급되는 전력을 제1 전력 값에서 제2 전력 값으로 조절한 경우, 커플러 에 인가되는 전력의 전력 데이터가 제2 전력 값에 대응되는 커플러 전력 값과 일치하는지 여부를 판단할 수 있다. 일 예시에서, 프로세서는 커플러에 인가되는 전력의 전력 데이터가 지정된 커플러 전력 값 에 대응되는 것으로 판단되는 경우, 동작 1304에서의 전력 제어 동작이 올바르게 수행된 것으로 판단할 수 있다. 다른 예시에서, 프로세서는 커플러에 인가되는 전력의 전력 데이터가 지정된 커플러 전력 값 과 대응되지 않는 경우, 동작 1304에서의 전력 제어 동작이 올바르게 수행되지 않은 것으로 판단하고, 1304 동 작을 다시 수행할 수 있다. 일 실시예에 따르면, 전자 장치는 상술한 1301 동작 내지 1306 동작을 통하여, 그립 센서를 구비하지 않고 도 전자 장치에 대한 외부 객체의 근접 여부를 감지할 수 있다. 일 예시에서, 전자 장치는, 그립 센 서를 구비하지 않음으로써, 전자 장치 내부에 전자 부품들이 배치될 수 있는 공간을 확보할 수 있다. 다른 예시에서, 그립 센서는 전자 장치의 안테나(예: 도 9의 안테나)와 전기적으로 연결되어 안테나를 일 종의 전극으로 활용할 수 있으며, 그립 센서의 동작 과정에서 안테나의 방사 성능 저하가 발생될 수 있다. 일 실시예에 따르면, 전자 장치는 그립 센서를 구비하지 않음으로써, 그립 센서에 의한 안테나 성능 저하를 줄일 수 있으며, 결과적으로 안테나 방사 성능을 향상시킬 수 있다. 일 실시예에 따른 전자 장치는, 무선 통신 회로, 상기 무선 통신 회로와 전기적으로 연결되고, 제1 지점에서 상 기 무선 통신 회로로부터 급전되는 안테나, 상기 안테나에 인가되는 최대 전압(peak voltage)을 감지하는 전압 감지부 및 상기 전압 감지부 및 무선 통신 회로와 전기적으로 연결되는 프로세서를 포함하고, 상기 프로세서는, 상기 전압 감지부에서 감지된 최대 전압에 기초하여, 상기 전자 장치에 대한 객체의 근접 여부를 판단하고, 상 기 객체가 근접하였다는 판단에 기초하여, 상기 무선 통신 회로를 통하여 상기 안테나에 인가되는 전력의 크기 를 제어하도록 구성될 수 있다. 상술한 본 개시의 구체적인 실시 예들에서, 개시에 포함되는 구성 요소는 제시된 구체적인 실시 예에 따라 단수 또는 복수로 표현되었다. 그러나, 단수 또는 복수의 표현은 설명의 편의를 위해 제시한 상황에 적합하게 선택된 것으로서, 본 개시가 단수 또는 복수의 구성 요소에 제한되는 것은 아니며, 복수로 표현된 구성 요소라 하더라 도 단수로 구성되거나, 단수로 표현된 구성 요소라 하더라도 복수로 구성될 수 있다. 한편, 본 개시의 상세한 설명에서는 구체적인 실시 예에 관해 설명하였으나, 본 개시의 범위에서 벗어나지 않는 한도 내에서 여러 가지 변형이 가능함은 물론이다. 그러므로 본 개시의 범위는 설명된 실시 예에 국한되어 정해 져서는 아니 되며 후술하는 특허청구의 범위 뿐만 아니라 이 특허청구의 범위와 균등한 것들에 의해 정해져야 한다. 도면 도면1 도면2a 도면2b 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13"}
{"patent_id": "10-2020-0080959", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은, 다양한 실시예들에 따른 네트워크 환경 내의 전자 장치의 블럭도이다. 도 2a는, 일 실시예에 따른 전자 장치의 전면을 나타내는 사시도이다. 도 2b는, 도 2a의 전자 장치를 후면에서 바라본 사시도이다. 도 3은, 일 실시예에 따라, 전자 장치의 안테나 방사체로 동작하는 측면 부재의 일부 영역을 나타내는 도면이다. 도 4는, 일 실시예에 따른 전자 장치의 구성을 설명하기 위한 도면이다. 도 5는, 일 실시예에 따른 전자 장지의 전압 감지부를 나타내는 도면이다. 도 6은, 일 실시예에 따라, 객체의 근접 여부를 감지하고, 안테나에 인가되는 전력을 조절하는 동작을 설명하기 위한 흐름도다. 도 7은, 일 실시예에 따라, 객체의 근접 여부를 감지하고, 안테나에 인가되는 전력을 조절하는 동작을 설명하기 위한 흐름도이다. 도 8은, 다른 실시예에 따라, 전자 장치의 안테나 방사체로 동작하는 측면 부재의 일부 영역을 나타내는 도면이 다. 도 9는, 다른 실시예에 따른 전자 장치의 구성을 설명하기 위한 도면이다. 도 10은, 다른 실시예에 따른 전자 장치의 스위치 회로를 나타내는 도면이다. 도 11은, 안테나에 인가되는 전압의 위상 변화에 따른 최대 전압(VRF) 값의 변화를 나타내는 그래프이다. 도 12는, 다른 실시예에 따라, 객체의 근접 여부를 감지하고, 안테나에 인가되는 전력을 조절하는 동작을 설명 하기 위한 흐름도다. 도 13은, 다른 실시예에 따라, 객체의 근접 여부를 감지하고, 안테나에 인가되는 전력을 조절하는 동작을 설명 하기 위한 흐름도이다."}
