{"patent_id": "10-2020-0150283", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0064114", "출원번호": "10-2020-0150283", "발명의 명칭": "다중전이 능동학습 기반 설비 이상 진단 시스템 및 그 방법", "출원인": "한국전자통신연구원", "발명자": "고석갑"}}
{"patent_id": "10-2020-0150283", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "수집 데이터를 검토하여 이상 여부를 확인하는 이상 진단 모듈; 상기 이상 진단 모듈을 이용하여 복수 개의 능동 학습 모델을 생성하는 다중 전이 모듈; 및상기 능동 학습 모델을 이용하여 추출된 레이블 요청 대상 데이터를 제시하여 레이블링 작업을 수행하고, 새로운 레이블 데이터를 이용하여 상기 이상 진단 모듈을 추가 학습시키는 레이블링 모듈을 포함하는 다중전이 능동학습 기반 설비 이상 진단 시스템."}
{"patent_id": "10-2020-0150283", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 다중전이 능동학습 기반 설비 이상 진단 시스템 및 그 방법에 관한 것이다. 본 발명에 따른 다중전이 능동학습 기반 설비 이상 진단 시스템은 수집 데이터를 검토하여 이상 여부를 확인하는 이상 진단 모듈과, 이상 진단 모듈을 이용하여 복수 개의 능동 학습 모델을 생성하는 다중 전이 모듈 및 능동 학 습 모델을 이용하여 추출된 레이블 요청 대상 데이터를 제시하여 레이블링 작업을 수행하고, 새로운 레이블 데이 터를 이용하여 이상 진단 모듈을 추가 학습시키는 레이블링 모듈을 포함한다."}
{"patent_id": "10-2020-0150283", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 다중전이 능동학습 기반 설비 이상 진단 시스템 및 그 방법에 관한 것이다."}
{"patent_id": "10-2020-0150283", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "종래 기술에 따른 설비 이상 진단 기술은 기계학습 기술을 이용하여 제조 및 운용 설비의 이상을 진단함에 있어 서, 레이블(Label)된 많은 데이터의 학습을 통해 예측 성능을 확보한다. 데이터 레이블 작업은 전문가에 의해 수행되며 많은 시간과 비용이 소모되는 문제점이 있고, 이를 해결하기 위 하여 제안된 능동 학습(active learning) 기술 역시 예측 문제 종류 및 적용 도메인에 따라 성능 차이가 발생되 는 문제점이 있다."}
{"patent_id": "10-2020-0150283", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술한 문제점을 해결하기 위해 제안된 것으로, 기계학습 인공지능 기술을 활용하여 제조 및 운용 설 비의 이상을 진단하되, 레이블링 요청 대상이 되는 데이터를 효과적으로 선택하고, 추가 레이블 데이터를 이용 하여 예측 모델에 대한 효과적인 재학습을 수행하는 것이 가능한 다중전이 능동학습 기반 설비 이상 진단 시스 템 및 방법을 제공하는데 그 목적이 있다."}
{"patent_id": "10-2020-0150283", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 따른 다중전이 능동학습 기반 설비 이상 진단 시스템은 수집 데이터를 검토하여 이상 여부를 확인하 는 이상 진단 모듈과, 이상 진단 모듈을 이용하여 복수 개의 능동 학습 모델을 생성하는 다중 전이 모듈 및 능 동 학습 모델을 이용하여 추출된 레이블 요청 대상 데이터를 제시하여 레이블링 작업을 수행하고, 새로운 레이 블 데이터를 이용하여 이상 진단 모듈을 추가 학습시키는 레이블링 모듈을 포함한다."}
{"patent_id": "10-2020-0150283", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면 기계학습, 다중전이모듈, 능동학습기법을 적용하여 설비의 이상 진단의 신뢰성을 높이는 효과 가 있다. 본 발명에 따르면 이상 진단 모델의 예측 정확도를 추정하는 모델을 복수 개 사용하는 다중전이 능동학습을 이 용하여, 전문가의 레이블링 작업을 줄이면서도 이상진단 정확도를 향상시키고, 되감기 재학습을 통해 추가적인 데이터가 있을 때 예측 모델의 재학습에 소요되는 시간을 줄이며 예측 성능을 향상시키는 효과가 있다."}
{"patent_id": "10-2020-0150283", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과는 이상에서 언급한 것들에 한정되지 않으며, 언급되지 아니한 다른 효과들은 아래의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2020-0150283", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 전술한 목적 및 그 이외의 목적과 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있"}
{"patent_id": "10-2020-0150283", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "으며, 단지 이하의 실시예들은 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 발명의 목적, 구성 및 효과를 용이하게 알려주기 위해 제공되는 것일 뿐으로서, 본 발명의 권리범위는 청구항의 기재에 의해 정의 된다. 한편, 본 명세서에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함한 다(comprises)\" 및/또는 \"포함하는(comprising)\"은 언급된 구성소자, 단계, 동작 및/또는 소자가 하나 이상의 다른 구성소자, 단계, 동작 및/또는 소자의 존재 또는 추가됨을 배제하지 않는다. 이하에서는, 당업자의 이해를 돕기 위하여 본 발명이 제안된 배경에 대하여 먼저 서술하고, 본 발명의 실시예에 대하여 서술하기로 한다. 종래 기술에 따르면, 인공지능 기술 중 하나인 기계학습 기술을 이용하여, 제조 및 운용 설비의 이상을 진단하 는 것이 가능하다. 기계학습 모델을 이용하여 생산 및 제조, 운용 과정의 다양한 문제를 발견함에 있어서, 제조 및 운용 설비의 제 어 신호 및 센서 측정 데이터에 추가로, 이 상황이 정상 상황인지, 이상 상황인지, 이상 상황이라면 어떤 이상 인지를 나타내는 '레이블(Label)'이 필요하다. 기계학습 모델은 정확한 예측 성능을 확보하기 위해, 많은 레이블된 데이터 학습이 전제되어야 하는데, 데이터 레이블 작업은 전문가에 의해 수행되는 바, 많은 시간과 비용이 소모되는 문제점이 있다. 능동학습(active learning)은 레이블 되지 않은 데이터 중, 레이블이 요구되는 데이터만 잘 골라서 전문가에게 질의하는 방식으로 기계학습을 수행한다. 최근 여러 가지 능동학습 방법이 연구되고 있으며, 불확실성(uncertainty), 표현성(representative), 클러스터 대표성 등을 고려한 능동학습 방법들과 예측모델을 변형하여 데이터 선택에 활용하는 능동전이학습이 제안된 바 있으나, 예측 문제 종류 및 적용 도메인에 따라 성능 차이가 발생되는 문제점이 있다. 본 발명은 전술한 문제점을 해결하기 위해 제안된 것으로, 제조 및 운용 설비 이상진단 문제에 적합한 능동전이 학습 기반 설비 이상진단 시스템 및 방법을 제안한다. 도 1은 본 발명의 실시예에 따른 다중전이 능동학습 기반 설비 이상 진단 시스템을 도시한다. 수집 모듈은 생산설비(10, 공작기계, 제조설비, 운용설비 등을 포함)로부터 제어 기록과 센서 측정 데이터 를 수집한다. 수집 모듈은 데이터 저장 모듈로 수집한 데이터를 전달하여 저장시키고, 동시에 이상 진단 모듈(12 0)로 수집 데이터 및 메타 데이터를 전달한다. 이상 진단 모듈은 데이터를 검토하여 이상 여부를 확인하고, 이상이 탐지되면 이상 경보 모듈에 이상 탐지 결과를 전달하여, 이상 경보 모듈이 관리자 또는 운영자에게 경보 또는 정보를 전달하도록 한다. 시각화 모듈은 관리자 또는 운영자에게 이상진단 결과 및 수집데이터를 이해하기 쉽게 보여준다. 이상 진단 모듈은 기계학습 모델로 구현할 수 있으며, 기계학습 모델은 이상 진단 및 예측 동작을 수행하 기 위해, 레이블된 데이터를 이용하여 예측 모델(이상 진단 모델)을 학습시킨다. 전술한 바와 같이, 기계학습 모델 학습에 사용되는 레이블된 데이터를 구축하기 위해서는 전문가가 필요하며, 전문가는 레이블링 작업(레이블되지 않은 데이터를 살펴보고 분석하여, 이상 유무를 판별하고, 이상이 있다면 어떤 종류의 이상인지를 표시)을 수행하여 레이블된 데이터를 생성한다. 이러한 레이블링 작업은 많은 시간과 노력과 비용이 요구되므로, 가능하면 작업량을 줄이는 것이 중요하다. 기존 데이터로 학습된 기계학습 모델(이상 진단 모듈)을 가져와서 모델 일부를 변형하여 사용하는 것을 전이 (transfer)라고 한다. 레이블되지 않은 데이터를 탐색하여, 전문가에게 레이블링 작업을 요청할 데이터를 선별하면, 전문가는 선별된 데이터만 분석하고 레이블링 작업을 수행하여 레이블된 데이터를 만든다. 다중전이 모듈은 필요에 따라 또는 주기적으로 수행되어, 알고리즘을 이용하여 능동 학습 모듈을 생 성한다. 이 때, 다중 전이 모듈은 이상 진단 모듈을 이용하거나 이를 복사 및 변환하여 여러 가지 능동 학습 모델을 생성한다. 이러한 능동 학습 모델에는 불확실성 기반 능동학습 모델, 표현성 기반 능동학습 모델, 클러스터 대표성 기반 능동학습 모델, 예측정확도 기반 능동학습 모델, 이상진단 모델에 노이즈를 추가하는 능동학습 모델, 또는 규칙 기반 능동학습 모델 등이 포함된다. 규칙 기반 능동 학습 모델은 전문가 또는 개발자에 의한 규칙 기반 필터링을 통해 레이블되지 않은 데이터에서 불필요한 데이터를 제외하거나 선별한다. 능동 학습 모델은 레이블되지 않은 데이터에서 레이블이 필요한 데이터들을 선택한다. 적절한 개수의 데이터가 추출되면, 레이블링 모듈로 전송되어, 전문가에게 레이블링 작업 목록을 제시하고, 데이터 분석 및 레이블링 작업을 요청한다. 레이블링 모듈은 복수 개의 능동 학습 모듈로부터 받은 전문가 질의 목록을 취합한다. 레이블링 모듈은 능동 학습 모듈의 특성을 고려하여 전문가 질의 목록을 취사 선택한다. 예컨대, 레이블링 모듈은 특정 능동 학습 모듈로부터 제공받은 전문가 질의 목록이 기설정 개수 이상인 경 우, 이를 다른 능동 학습 모듈로부터 제공 받은 질의 목록의 개수 수준으로 줄인다. 전술한 바와 같이, 전문가는 레이블링 모듈을 통해 질의 목록과 저장된 데이터를 분석 및 확인하여 레이블 링 작업을 수행한다. 전문가의 레이블링 작업이 완료되면, 레이블링 모듈은 새로운 레이블 데이터를 이용하여 이상 진단 모듈 을 추가 학습시킨다. 전술한 추가 학습 과정이 반복됨에 따라, 이상 진단 모듈의 성능이 향상된다. 본 발명의 실시예에 따르면, 다중전이 능동학습 기반 설비 이상 진단 시스템의 각 모듈은 마이크로서비스 Pod로 구현되는 것이 가능하다. 도 2는 본 발명의 실시예에 따른 다중 전이 모듈을 이용한 예측 정확도 추정 과정을 도시한다. 본 발명의 실시예에 따른 다중 전이 학습 과정 중, 예측 정확도 기반 능동 학습 모델 생성 과정을 설명한다. 기계학습 기반 이상 진단 모델은 여러 개의 인공 뉴런(가중치)으로 구성된 여러 계층(입력층, 다수 은닉층, 출 력층)으로 구성된다. 입력층에는 제어기록 및 센서데이터와 같은 수집 데이터가 입력되는데, 이상 진단 모델에 따라 한 순간의 데이 터가 아닌, 시간 구간 사이의 데이터가 입력될 수 있다. 출력층으로는 레이블이 출력되며, 예컨대, 정의된 이상 상황 종류가 10가지가 있다면, 정상 상황과 판단불가 상 황까지 포함하면 총 12가지의 종류가 되므로, 출력층의 출력값 개수는 12개가 된다. 학습 과정에서는 출력층으로 레이블이 입력되어 역전파(back-propagation) 과정을 통해 각 층의 뉴런들(가중 치)이 갱신되어 학습된다. 다중 전이 모듈은 전술한 과정을 통해 학습된 모델을 복사(전이)하며, 출력층을 변경하여 이상 진단 모델의 예 측 정확도를 예측할 수 있는 예측 정확도 추정 모델로 구성을 변경한다. 예측 정확도는 기설정된 범위(예: 0에서 100사이)의 값을 가지도록 설정되며, 예측 정확도 추정 모델의 입력층 은 이미 학습되어 있지만 출력층 근처는 학습되어 있지 않다. 예측 정확도 추정 모델 학습용 데이터로는 레이블된 데이터가 이용되며, 기존의 이상 진단 모델이 예측 진단을 한 결과가 이용된다. 예를 들어, 기존의 이상 진단 모델이 정확하게 레이블을 예측한 경우, 예측 정확도를 100으로 설정하고, 이상 진단 모델이 비정상 데이터를 정상이라고 잘못 예측한 경우, 예측정확도를 0으로 설정하며, 이상 진단 모델이 비정상 데이터에 대해 비정상이라고 예측했지만 이상 상황의 종류를 맞추지 못한 경우, 예측 정확도를 중간값 (예: 66)으로 설정한다. 다른 예로서, 이상 진단 모델의 출력의 각 클래스별 점수(score)를 고려하여 예측 정확도를 설정하는 것이 가능 하다. 예를 들어, 특정 데이터에 대한 이상 진단 모델의 출력(점수, score)이 정상 0.7, 비정상(상황1) 0.2, 비정상 (상황2) 0.1 이 나왔는데, 실제로는 정상이 었다면 예측 정확도를 0.7로 설정하는 것이 가능하다. 또한, 특정 데이터에 대한 이상 진단 모델의 출력이 정상 0.7, 비정상(상황1) 0.2, 비정상(상황2) 0.1 이 나왔 는데, 실제로는 비정상(상황2)였다면 예측 정확도를 0.1로 설정하는 것이 가능하다. 또 다른 예로서, 이상 진단 모델의 출력의 엔트로피를 예측 정확도로 이용하는 것이 가능하다. 본 발명의 실시예에 따르면, 이상 진단 모델 자체에서 예측 정확도를 같이 예측하는 것이 가능하다. 예컨대, 이상 진단 모델에 대해 임의의 인공 뉴런들을 비활성화시키는 drop-out기법을 적용하여 여러 번 예측을 수행하여, 예측 정확도를 구하는 것이 가능하다. 예측 정확도 추정 모델 학습용 데이터는, 이상 진단 모델을 학습시킬 때 사용한 데이터에 추가로 학습에 사용되 지 않은 평가용 레이블 데이터가 포함 되거나 사용될 수 있으며, 이를 통해 오버 피팅 문제를 피할 수 있다. 본 발명의 실시예에 따르면, 예측 정확도 추정 모델 학습용 데이터를 이용하여 예측 정확도 추정 모델을 학습시 킬 때, 이상 진단 모델로부터 복사한 계층, 즉 입력층에 가까운 계층들에서는 학습이 되지 않도록 하여, 이상 진단 모델이 가진 특징 추출 기능을 유지시키는 것이 가능하다. 도 3은 본 발명의 실시예에 따른 레이블링 작업 요청 대상이 되는 데이터를 추리는 과정을 도시한다. 전술한 과정을 통해, 다중 전이 모듈에 의해 생성된 능동 학습 모델 중 하나인 예측 정확도 추정 모델이 준비되 면, 레이블되지 않은 데이터 중 레이블링 작업 요청 대상이 되는 데이터를 추려야 한다. 본 발명의 실시예에 따르면, 레이블되지 않은 모든 데이터를 예측 정확도 추정 모델에 입력하여, 예측 정확도가 가장 낮은 데이터를 뽑는다. 예측 정확도가 가장 낮은 데이터는 전문가 질의 목록에 포함되고, 레이블 되지 않은 데이터의 집합에서는 제거 된다. 예측 정확도가 가장 낮은 데이터는 예측 정확도 추정 모델 학습용 데이터로 추가된다. 이 때, 예측 정확도는 100 또는 기설정 수치 이상의 값으로 설정되는데, 이는 추후 레이블되고 이상 진단 모델 학습용 데이터로 사용될 것을 고려하여, 높은 예측 정확도가 될 것으로 가정함에 따른 것이다. 추가된 예측 정확도 추정 모델 학습용 데이터를 이용하여 예측 정확도 추정 모델을 학습시키며, 이는 충분한 전 문가 질의 목록이 생성될 때까지 반복된다."}
{"patent_id": "10-2020-0150283", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 3, "content": "도 4는 본 발명의 실시예에 따른 다중전이 능동학습 기반 설비 이상 진단 방법을 도시한다. S401 단계는 이상 진단 모델로부터 예측 정확도 추정 모델을 생성한다. S402 단계는 레이블된 데이터를 이상 진단 모델에 입력하여 데이터 별로 예측 정확도를 구하고, 이를 이용하여 예측 정확도 추정 모델 학습용 데이터를 구축한다. S403 단계는 예측 정확도 추정 모델 학습용 데이터를 이용하여 예측 정확도 추정 모델을 학습한다. S404 단계는 예측 정확도 추정 모델에 레이블되지 않은 데이터를 입력하여, 예측 정확도가 가장 낮은 데이터를 찾는다. S405 단계는 예측 정확도가 가장 낮은 데이터의 예측 정확도가 기설정된 수치 이상인지 여부를 확인하고, 예측 정확도가 기설정된 수치 이상인 경우, 반복 과정을 중단한다. 이 때, 기설정된 수치는 이상 진단 모델 학습용 데이터에 대한 예측 정확도를 기준으로 설정되는 것이 가능하다. S406 단계는 예측 정확도가 가장 낮은 데이터의 예측 정확도가 기설정된 수치 미만인 경우, 예측 정확도가 가장 낮은 데이터를 레이블되지 않은 데이터의 집합에서 제거하고, 이를 전문가 질의 목록에 포함시키고, 예측 정확 도를 100 또는 기설정 수치 이상의 값으로 설정하여, 예측 정확도 추정 모델 학습용 데이터에 추가하고, 예측 정확도 추정 모델 재학습을 수행한다. S407 단계는 전문가 질의 목록의 개수가 기설정 수치 이상인 경우, 또는 더 이상 레이블되지 않은 데이터가 존 재하지 않는 경우, 과정을 중단한다. 이 때, 기설정 수치는 이상 진단 모델 학습 시간과 전문가가 한번에 처리할 수 있는 최대 레이블링 작업 개수를 고려하여 설정된다. 도 5는 본 발명의 실시예에 따른 되감기 재학습 과정을 도시한다. 전술한 바와 같이, 예측 정확도 추정 모델 및 이상 진단 모델은 데이터 추가에 따라 다시 학습이 수행되어야 하 는데, 기계학습 모델을 학습하는 과정은 많은 시간과 에너지가 요구된다. 그런데, 새로 추가된 데이터만 이용해서 기존의 기계학습 모델을 추가 학습시키는 경우, 기계학습 모델의 성능 이 저하되며, 이는 기계학습 모델이 새로운 데이터에만 지나치게 치중하여 학습됨에 따라, 기존 데이터에 대한 예측 성능이 저하되기 때문이다. 또한, 새로 추가된 데이터와 기존 데이터를 이용하여 기존 모델을 추가 학습시키는 경우에는, 기존 데이터 대비 새로 추가된 데이터의 비중이 적기 때문에, 모델이 새로운 데이터에 대해 제대로 학습되지 못하는 문제점이 있 다. 새로 추가된 데이터와 기존 데이터를 합치고, 기존 모델을 초기화하여 처음부터 다시 학습시키면 높은 성능을 확보할 수 있으나, 재학습 과정에 많은 시간이 소요되는 문제점이 있다. 본 발명의 실시예에 따르면, 도 5에 도시한 바와 같이, 기존 학습 과정을 기준으로, 중간의 덜 학습된 모델부터 추가로 학습을 수행하며, 이를 되감기 재학습 방법이라 한다. 충분히 학습된 모델에 추가학습을 하게 되면 학습이 잘 안되지만, 충분히 학습되지 않은 상태의 모델에 추가 학 습을 하게 되면 학습이 잘 진행되는 효과가 있다. 예측 모델을 학습시킬 때 여러 번 반복을 하여 학습을 시키는데. 이러한 반복 횟수를 epoch이라고 한다. Epoch 증가에 따라 기계학습 모델의 예측 성능은 증가한다. 본 발명의 실시예에 따르면, 반복 학습을 수행하면서 중간과정의 기계학습 모델의 가중치를 백업해 두고, 기계 학습 모델의 예측 기능은 충분한 epoch을 수행함에 따라 완전히 학습된 모델을 이용한다. 추가학습이 필요한 경우, 기계학습 모델의 가중치에 따라 덜 학습된 모델을 이용하여 추가 학습을 진행한다. 도 5를 참조하면, epoch 60까지 학습을 수행하였을 때의 중간 모델을 이용하였고, 추가 학습이 완료됨에 따라 새로운 예측모델로 활용한다. 전술한 과정을 통해, 재학습 시간을 줄이면서 높은 성능을 확보하는 것이 가능한 효과가 있다. 한편, 본 발명의 실시예에 따른 다중전이 능동학습 기반 설비 이상 진단 방법은 컴퓨터 시스템에서 구현되거나, 또는 기록매체에 기록될 수 있다. 컴퓨터 시스템은 적어도 하나 이상의 프로세서와, 메모리와, 사용자 입력 장 치와, 데이터 통신 버스와, 사용자 출력 장치와, 저장소를 포함할 수 있다. 전술한 각각의 구성 요소는 데이터 통신 버스를 통해 데이터 통신을 한다. 컴퓨터 시스템은 네트워크에 커플링된 네트워크 인터페이스를 더 포함할 수 있다. 프로세서는 중앙처리 장치 (central processing unit (CPU))이거나, 혹은 메모리 및/또는 저장소에 저장된 명령어를 처리하는 반도체 장치 일 수 있다. 메모리 및 저장소는 다양한 형태의 휘발성 혹은 비휘발성 저장매체를 포함할 수 있다. 예컨대, 메모리는 ROM 및 RAM을 포함할 수 있다. 따라서, 본 발명의 실시예에 따른 다중전이 능동학습 기반 설비 이상 진단 방법은 컴퓨터에서 실행 가능한 방법 으로 구현될 수 있다. 본 발명의 실시예에 따른 다중전이 능동학습 기반 설비 이상 진단 방법이 컴퓨터 장치에 서 수행될 때, 컴퓨터로 판독 가능한 명령어들이 본 발명에 따른 다중전이 능동학습 기반 설비 이상 진단 방법 을 수행할 수 있다. 한편, 상술한 본 발명에 따른 다중전이 능동학습 기반 설비 이상 진단 방법은 컴퓨터로 읽을 수 있는 기록매체 에 컴퓨터가 읽을 수 있는 코드로서 구현되는 것이 가능하다. 컴퓨터가 읽을 수 있는 기록 매체로는 컴퓨터 시 스템에 의하여 해독될 수 있는 데이터가 저장된 모든 종류의 기록 매체를 포함한다. 예를 들어, ROM(Read Only Memory), RAM(Random Access Memory), 자기 테이프, 자기 디스크, 플래시 메모리, 광 데이터 저장장치 등이 있 을 수 있다. 또한, 컴퓨터로 판독 가능한 기록매체는 컴퓨터 통신망으로 연결된 컴퓨터 시스템에 분산되어, 분 산방식으로 읽을 수 있는 코드로서 저장되고 실행될 수 있다.도면 도면1 도면2 도면3 도면4 도면5"}
{"patent_id": "10-2020-0150283", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 다중전이 능동학습 기반 설비 이상 진단 시스템을 도시한다. 도 2는 본 발명의 실시예에 따른 다중 전이 모듈을 이용한 예측 정확도 추정 과정을 도시한다. 도 3은 본 발명의 실시예에 따른 레이블링 작업 요청 대상이 되는 데이터를 추리는 과정을 도시한다. 도 4는 본 발명의 실시예에 따른 다중전이 능동학습 기반 설비 이상 진단 방법을 도시한다. 도 5는 본 발명의 실시예에 따른 되감기 재학습 과정을 도시한다."}
