{"patent_id": "10-2023-0053930", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0152591", "출원번호": "10-2023-0053930", "발명의 명칭": "에너지 가상 트윈을 통한 에너지 공급망 관리 및 최적화의 시스템 및 방법", "출원인": "티엠알더블유 파운데이션 아이피 에스에이알엘", "발명자": "예를리 체바트"}}
{"patent_id": "10-2023-0053930", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "멀티벡터 에너지 공급망 관리 및 최적화 시스템으로서,적어도 하나의 매크로-그리드(macro-grid)에 연결된 복수의 상호 연결된 마이크로-그리드(micro-grid)들을 포함하고 에너지 네트워크를 통해 하나 이상의 컴퓨팅 디바이스에 통신적으로(communicatively) 결합된 에너지 시스템을 포함하고,상기 하나 이상의 컴퓨팅 디바이스는 적어도 하나의 프로세서 및 컴퓨터 코드를 저장하는 메모리를 포함하고,상기 컴퓨터 코드는, 상기 적어도 하나의 프로세서에 의한 실행에 응답하여 상기 하나 이상의 컴퓨팅 디바이스로 하여금,실세계에 따라 매핑되고 해당 실세계 요소의 적어도 하나의 가상 복제본(virtual replica)을 포함하는 복수의가상 객체들을 포함하는 지속적인(persistent) 가상 세계 시스템 - 상기 가상 복제본 중 일부는 상기 에너지 시스템으로부터의 해당 에너지 관련 디바이스들의 에너지 복제본들을 포함함 -; 및상기 지속적인 가상 세계 시스템에 통신적으로 결합되는 분산형(decentralized) 에너지 관리 시스템을 구현하게 하고,상기 분산형 에너지 관리 시스템은,상기 지속적인 가상 세계 시스템에서의 시뮬레이션을 통해 상기 에너지 시스템으로부터 수신된 데이터에 기초하여 에너지 흐름을 디지털 방식으로 통합 및 제어하도록 구성된 에너지 제어 시스템; 및상기 지속적인 가상 세계 시스템을 사용하여 에너지 관련 디바이스들 간의 에너지 집계(aggregation) 및 교환을가능하게 하는 에너지 시장 플랫폼을 포함하는 것인, 멀티벡터 에너지 공급망 관리 및 최적화 시스템."}
{"patent_id": "10-2023-0053930", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 에너지 제어 시스템은 적어도,에너지 공급의 품질과 신뢰성을 유지하고 상기 에너지 네트워크에서의 에너지 흐름을 제어하기 위한 제어 전략을 정의하도록 구성된 운영 버스(operation verse);복수의 시나리오에서의 에너지 수요 및 생성(generation)을 예측하도록 구성된 예측 버스(prediction verse);및증강(augmented) 및 처방적(prescriptive) 분석을 수행하도록 구성된 분석 버스(analytics verse)를 포함하는 해당 버스들에서, 하나 이상의 동시발생적 목표 지향 시뮬레이션(concurrent goal-orientedsimulation)을 수행하도록 구성되는 것인, 멀티벡터 에너지 공급망 관리 및 최적화 시스템."}
{"patent_id": "10-2023-0053930", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서,상기 지속적인 가상 세계 시스템은 해당 버스들에서의 상기 동시발생적 목표 지향 시뮬레이션을 통해 에너지 관리 및 거래 프로세스들을 자동화하도록 구성된 인공 지능 에이전트(artificial intelligence agent)들의 심리스통합(seamless integration)을 가능하게 하는 것인, 멀티벡터 에너지 공급망 관리 및 최적화 시스템."}
{"patent_id": "10-2023-0053930", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "공개특허 10-2023-0152591-3-제2 항에 있어서,상기 하나 이상의 동시발생적 목표 지향 시뮬레이션을 통해 상기 에너지 제어 시스템에 의해 구현되는 에너지제어 전략은 최저 에너지 비용, 최저 탄소 배출량 및 에너지 공급 안보의 인자로서 에너지 생성 및 분배를 최적화하는 것 중 적어도 하나에 기초하는 것인, 멀티벡터 에너지 공급망 관리 및 최적화 시스템."}
{"patent_id": "10-2023-0053930", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2 항에 있어서,상기 버스들은 상기 에너지 시스템의 전체적이고 최적화된 관리를 제공하는 통일된 뷰(unified view)로 통합되는 것인, 멀티벡터 에너지 공급망 관리 및 최적화 시스템."}
{"patent_id": "10-2023-0053930", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제2 항에 있어서,각각의 버스는 추가 목표 지향 시뮬레이션들을 용이하게 하는 상이한 객체 특정 스트림(object-specificstream)들로 세분되는(sub-divided) 것인, 멀티벡터 에너지 공급망 관리 및 최적화 시스템."}
{"patent_id": "10-2023-0053930", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제2 항에 있어서,상기 운영 버스는 하나 이상의 에너지 시장 오퍼레이터의 계량(metering), 청구(billing), 및 입찰(bidding) 서비스에 통신적으로 결합되는 것인, 멀티벡터 에너지 공급망 관리 및 최적화 시스템."}
{"patent_id": "10-2023-0053930", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1 항에 있어서,하나 이상의 에너지 시장 오퍼레이터가 상기 에너지 제어 시스템으로부터의 에너지 데이터 교환에 기초하여 에너지 흐름을 집계 및 거래하기 위해 상기 에너지 시장 플랫폼의 개별 인스턴스(instance)들을 이용하는 것인,멀티벡터 에너지 공급망 관리 및 최적화 시스템."}
{"patent_id": "10-2023-0053930", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8 항에 있어서,상기 하나 이상의 에너지 시장 오퍼레이터는 네트워크 보강 및 부하 관리를 통해 분배(distribution) 및 전송(transmission) 에너지 네트워크들을 운영 한계 내에 유지하기 위해 상기 에너지 제어 시스템의 인스턴스들을통해 하나 이상의 에너지 분배 시스템 오퍼레이터와 통신하는 것인, 멀티벡터 에너지 공급망 관리 및 최적화 시스템."}
{"patent_id": "10-2023-0053930", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9 항에 있어서,상기 하나 이상의 에너지 시장 오퍼레이터는 에너지 수요가 공급되는 에너지보다 클 때 상기 하나 이상의 에너지 분배 시스템 오퍼레이터에게 부족분 에너지를 요청하거나, 상기 하나 이상의 에너지 시장 오퍼레이터는 공급되는 에너지가 요구되는 에너지보다 클 때 잉여분 에너지를 외부 소비자들과 거래하기 위해 상기 잉여분 에너지를 상기 에너지 시장 플랫폼의 피어-투-피어(peer-to-peer) 병렬 경매 시스템에 요청하는 것인, 멀티벡터 에너지 공급망 관리 및 최적화 시스템."}
{"patent_id": "10-2023-0053930", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1 항에 있어서,상기 에너지 시스템의 상기 에너지 관련 디바이스들은 에너지 생성 디바이스, 에너지 저장 디바이스, 에너지 제어 디바이스, 에너지 소비 디바이스 및 에너지 분배 디바이스 중 하나 이상을 포함하고, 상기 에너지 관련 디바이스들 중 적어도 일부는 멀티벡터 분산 에너지 자원(distributed energy resource, DER)들 내에 포함되는공개특허 10-2023-0152591-4-것인, 멀티벡터 에너지 공급망 관리 및 최적화 시스템."}
{"patent_id": "10-2023-0053930", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11 항에 있어서,상기 DER들은 풍력 터빈(wind turbine)들, 지열 발전소(geothermal plant)들, 수력 발전소(hydroelectricplant)들, 바이오매스 발전소(biomass plant)들 및 전기 자동차(electric vehicle, EV)들 중 하나 이상을 포함하는 것인, 멀티벡터 에너지 공급망 관리 및 최적화 시스템."}
{"patent_id": "10-2023-0053930", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12 항에 있어서,상기 분산형 에너지 관리 시스템은 EV 가상 복제본들의 상태들을, 대응하는 EV들이 대응하는 마이크로-그리드에연결된 충전소에 연결 또는 연결 해제되어 있는지에 기초하여 업데이트하는 것을 가능하게 하고, EV를 상기 대응하는 마이크로-그리드에 연결하는 것은 상기 EV가 물리적으로 에너지를 거래할 수 있도록 하는 한편 모빌리티(mobility) 네트워크로부터 상기 EV의 사용 불가능한 상태를 활성화하고, 상기 EV를 상기 대응하는 마이크로-그리드로부터 연결 해제하는 것은 상기 EV가 물리적으로 에너지를 거래할 수 없게 하는 한편 상기 모빌리티 네트워크에서 상기 EV의 사용 가능한 상태를 활성화하는 것인, 멀티벡터 에너지 공급망 관리 및 최적화 시스템."}
{"patent_id": "10-2023-0053930", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제1 항에 있어서,상기 분산형 에너지 관리 시스템의 상이한 인스턴스들은 연결 및 정보 교환을 관리하기 위해 스마트 계약(smartcontracts)을 사용하여 서비스, 상태 및 데이터를 공유하는 것인, 멀티벡터 에너지 공급망 관리 및 최적화 시스템."}
{"patent_id": "10-2023-0053930", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제1 항에 있어서,상기 에너지 시장 플랫폼을 통해 상기 지속적인 가상 세계 시스템을 사용하여 발생하는 상호 작용들은 에너지소비 패턴을 최적화하도록 사용자들을 장려하기 위해 게임화되는(gamified) 것인, 멀티벡터 에너지 공급망 관리및 최적화 시스템."}
{"patent_id": "10-2023-0053930", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제1 항에 있어서,상기 에너지 시장 플랫폼은 또한 데이터, 서비스 및 시뮬레이션의 교환 및 집계를 가능하게 하는 것인, 멀티벡터 에너지 공급망 관리 및 최적화 시스템."}
{"patent_id": "10-2023-0053930", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제1 항에 있어서,상기 분산형 에너지 관리 시스템은 새로운 콘텐트(content), 애플리케이션 및 서비스를 상기 분산형 에너지 관리 시스템에 추가할 수 있도록 하는 에너지 애플리케이션 스토어(energy application store)를 포함하거나 이에연결되는 것인, 멀티벡터 에너지 공급망 관리 및 최적화 시스템."}
{"patent_id": "10-2023-0053930", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "적어도 하나의 매크로-그리드에 연결된 복수의 상호 연결된 마이크로-그리드들을 포함하는 에너지 시스템에 에너지 네트워크를 통해 통신적으로 결합된 하나 이상의 컴퓨팅 디바이스에 의해 수행되는 에너지 공급망 관리 및최적화 방법으로서,실세계에 따라 매핑되고 해당 실세계 요소의 적어도 하나의 가상 복제본을 포함하는 복수의 가상 객체들을 포함하는 지속적인 가상 세계 시스템을 제공하는 단계 - 상기 가상 복제본 중 일부는 상기 에너지 시스템으로부터의해당 에너지 관련 디바이스들의 에너지 복제본들을 포함함 -;공개특허 10-2023-0152591-5-상기 지속적인 가상 세계 시스템에 통신적으로 결합되고 적어도 에너지 제어 시스템 및 에너지 시장 플랫폼을포함하는 분산형 에너지 관리 시스템을 제공하는 단계;상기 지속적인 가상 세계 시스템에 의해, 상기 에너지 시스템으로부터 에너지 데이터를 수신하는 단계;상기 지속적인 가상 세계 시스템에 의해, 상기 에너지 데이터를 사용하여 상기 지속적인 가상 세계 시스템의 상기 가상 복제본들을 업데이트하는 단계;상기 에너지 제어 시스템에 의해, 상기 지속적인 가상 세계 시스템으로부터 업데이트된 에너지 데이터를 수신하고 상기 에너지 시장 플랫폼으로부터 에너지 트랜잭션(transaction) 데이터를 수신하는 단계;상기 에너지 시스템으로부터 수신된 데이터에 기초하여 에너지 흐름을 디지털 방식으로 통합하고 제어하기위해, 상기 지속적인 가상 세계 시스템에서의 시뮬레이션을 통해 상기 에너지 제어 시스템과 상기 에너지 시장플랫폼 간의 기능(function)들을 조정하는(coordinating) 단계; 및상기 에너지 시장 플랫폼에 의하여 에너지 관련 디바이스들을 통한 에너지 행위자들 간의 에너지 흐름을 집계하고 교환하는 단계를 포함하는, 에너지 공급망 관리 및 최적화 방법."}
{"patent_id": "10-2023-0053930", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18 항에 있어서,상기 에너지 제어 시스템에 의해, 상기 지속적인 가상 세계 시스템으로부터 상기 업데이트된 에너지 데이터를수신하는 단계는 상기 에너지 제어 시스템이 적어도 운영 버스, 예측 버스 및 분석 버스를 포함하는 해당 버스들에서 하나 이상의 목표 지향 시뮬레이션을 동시에 수행하도록 트리거하고,상기 운영 버스는,에너지 공급의 품질과 신뢰성을 유지하기 위한 제어 전략을 정의하는 단계; 및상기 제어 전략에 기초하여 상기 에너지 네트워크에서의 에너지의 흐름을 제어하는 단계를 수행하도록 구성되고;상기 예측 버스는,복수의 시나리오에서의 에너지 수요 및 생성을 예측하는 단계를 수행하도록 구성되고;상기 분석 버스는,수신된 에너지 데이터에 대한 증강 및 처방적 분석을 수행하는 단계를 수행하도록 구성되는 것인, 에너지 공급망 관리 및 최적화 방법."}
{"patent_id": "10-2023-0053930", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19 항에 있어서,상기 지속적인 가상 세계 시스템은 해당 버스들에서의 동시발생적 목표 지향 시뮬레이션들을 통해, 에너지 관리및 거래 프로세스들을 자동화하도록 구성된 인공 지능 에이전트들의 심리스 통합을 가능하게 하는 것인, 에너지공급망 관리 및 최적화 방법."}
{"patent_id": "10-2023-0053930", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제19 항에 있어서,상기 하나 이상의 목표 지향 시뮬레이션을 통해 상기 에너지 제어 시스템에 의해 구현되는 에너지 제어 전략은최저 에너지 비용, 최저 탄소 배출량 및 공급 안보의 인자로서 에너지 생성 및 분배를 최적화하는 것 중 적어도하나에 기초하는 것인, 에너지 공급망 관리 및 최적화 방법."}
{"patent_id": "10-2023-0053930", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제19 항에 있어서,공개특허 10-2023-0152591-6-상기 버스들은 상기 에너지 시스템의 전체적이고 최적화된 관리를 제공하는 통일된 뷰로 통합되는 것인, 에너지공급망 관리 및 최적화 방법."}
{"patent_id": "10-2023-0053930", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제18 항에 있어서,상기 에너지 시스템의 상기 에너지 관련 디바이스들은 에너지 생성 디바이스, 에너지 저장 디바이스, 에너지 제어 디바이스, 에너지 소비 디바이스 및 에너지 분배 디바이스 중 하나 이상을 포함하고, 상기 에너지 관련 디바이스들 중 적어도 일부는 분산 에너지 자원(DER)들 내에 포함되는 것인, 에너지 공급망 관리 및 최적화 방법."}
{"patent_id": "10-2023-0053930", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제23 항에 있어서,상기 DER들은 풍력 터빈들, 지열 발전소들, 수력 발전소들, 바이오매스 발전소들 및 전기 자동차(EV)들 중 하나이상을 포함하는 것인, 에너지 공급망 관리 및 최적화 방법."}
{"patent_id": "10-2023-0053930", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제23 항에 있어서,충전소를 통해 전기 자동차(EV)가 대응하는 마이크로-그리드에 연결되었음을 나타내는 신호를 수신하는 것에 응답하여, 상기 EV가 물리적으로 에너지를 거래할 수 있도록 하는 한편 모빌리티 네트워크로부터 상기 EV의 사용불가능한 상태를 활성화하는 단계; 및상기 충전소를 통해 상기 EV가 상기 대응하는 마이크로-그리드로부터 연결 해제되었음을 나타내는 신호를 수신하는 것에 응답하여, 상기 EV가 물리적으로 에너지를 거래할 수 없게 하는 한편 상기 모빌리티 네트워크에서의상기 EV의 사용 가능한 상태를 활성화하는 단계를 더 포함하는, 에너지 공급망 관리 및 최적화 방법."}
{"patent_id": "10-2023-0053930", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "제18 항에 있어서,복수의 에너지 시장 오퍼레이터들이 상기 에너지 제어 시스템으로부터의 에너지 데이터 교환에 기초하여 에너지흐름을 집계 및 거래하기 위해 상기 에너지 시장 플랫폼의 개별 인스턴스들을 이용하는 것인, 에너지 공급망 관리 및 최적화 방법."}
{"patent_id": "10-2023-0053930", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "제26 항에 있어서,상기 복수의 에너지 시장 오퍼레이터들이 하나 이상의 분배 시스템 오퍼레이터에게 상기 에너지 제어 시스템의인스턴스들을 통해, 분배 및 전송 에너지 네트워크 유지보수 요청을 전송하는 단계; 및상기 하나 이상의 분배 시스템 오퍼레이터가 상기 에너지 제어 시스템의 상기 인스턴스를 통해, 상기 분배 및전송 에너지 네트워크들을 운영 한계 내에 유지하기 위해 네트워크 보강 및 부하 관리를 구현하는 단계를 더 포함하는, 에너지 공급망 관리 및 최적화 방법."}
{"patent_id": "10-2023-0053930", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_28", "content": "제19 항에 있어서,상기 분산형 에너지 관리 시스템에 의해 에너지 데이터를 수신하는 단계;상기 지속적인 가상 세계 시스템을 매개로 하여 상기 버스들을 통해 에너지 요구사항 예측을 행하는 단계;최적의 수익을 계산하는 단계;탄소 발자국(carbon footprint)을 계산하는 단계;공개특허 10-2023-0152591-7-시스템의 동적 사용 요금(dynamic use of system charge) 및 관련 비용을 계산하는 단계;에너지 균형, 최적 수익, 탄소 발자국 및 시스템의 동적 사용 요금 및 관련 비용을 포함하는 데이터를 조정된디스패치 기능(coordinated dispatch function)에 전송하는 단계;상기 조정된 디스패치 기능에 의해, 에너지 공급 및 수요를 평가하고, 탄소 자격증명(credential), 가격 및 디스패치 가능성(dispatchability)에 기초하여 공급자들을 분류하고, 예측되는 원하는 에너지를 조정하는 단계;상기 조정된 디스패치 기능에 의해, 부족분 또는 잉여분 에너지가 있는지 확인하는 단계;부족분 또는 잉여분 에너지가 없다고 결정하는 것에 응답하여, 상기 조정된 예측되는 에너지를 에너지 거래 커맨드(energy trading command)에 전송하는 단계;부족분 또는 잉여분 에너지가 있다고 결정하는 것에 응답하여, 부족분/잉여분 요청을 피어-투-피어 병렬 경매프로세스로 전송하는 단계;원하는 에너지 교환을 수행하는 단계; 및해당 공급자들에게 에너지 흐름 비용 정산을 수행하는 단계를 더 포함하는, 에너지 공급망 관리 및 최적화 방법."}
{"patent_id": "10-2023-0053930", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "제18 항에 있어서,상기 에너지 시장 플랫폼에 의해 데이터, 서비스 및 시뮬레이션을 교환하고 집계하는 단계를 더 포함하는, 에너지 공급망 관리 및 최적화 방법."}
{"patent_id": "10-2023-0053930", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_30", "content": "제18 항에 있어서,새로운 콘텐트, 애플리케이션 및 서비스를 상기 분산형 에너지 관리 시스템에 추가할 수 있도록 하는 에너지 애플리케이션 스토어를 제공하는 단계를 더 포함하는, 에너지 공급망 관리 및 최적화 방법."}
{"patent_id": "10-2023-0053930", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "에너지 공급망 관리 및 최적화 시스템은 적어도 하나의 매크로 그리드에 연결된 복수의 상호 연결된 마이크로 그 리드를 포함하는 에너지 시스템을 포함한다. 에너지 시스템은, 적어도 하나의 프로세서 및 적어도 하나의 프로세 서에 의해 실행될 때 실세계에 따라 맵핑되고 대응하는 실세계 엘리먼트의 적어도 하나의 가상 복제본을 포함하 (뒷면에 계속)"}
{"patent_id": "10-2023-0053930", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "기술 발전은 전기의 글로벌 수요 증가를 초래했고 미래 추세도 증가할 것이다. 전기 부족, 전력 품질 문제, 롤 링 정전(rolling blackouts), 전기 가격 및 수요 급증과 같은 전통적인 그리드(grid) 에너지 시스템과 관련된 문제는 부하에 비교적 가까이 위치된 소규모 발전원(power generation source)들인 분산 에너지 자원 (distributed energy resource, DER)의 개념에 영감을 주었다. DER들은 전통적인 전력 그리드에 대한 대안을 제공하며 재생 가능 에너지원들(예를 들어, 풍력, 태양열, 수력, 바이오매스(biomass), 지열 에너지 등)을 포함 하는 다양한 타입의 에너지에 의해 전력이 공급될 수 있다. 그러나 DER의 개발에도 불구하고 현재 정적인 전기 관리 시스템(static electricity management system)들은 시설에서 발생하는 전기 시스템들의 많은 일상적 변 화에 적응하도록 설계되지 않아, 비효율적인 에너지 이용과 그에 따른 부정적인 결과를 초래한다. 에너지 인터넷(Energy Internet, EI)은 상호 연결성, 개방성 및 유연성을 개선할 것으로 기대되는 새로운 에너 지 생태계를 정의하는 최근 생겨난 개념이다. EI는 가치(value)를 핵심 운영 파라미터(operational parameter) 로 사용하여 전체 전기 인프라스트럭처(infrastructure)에 걸쳐 에너지 공급과 수요의 동적 균형을 가능하게 하 는 경제 및 제어 메커니즘의 시스템으로 정의된다. EI는 스마트 그리드(smart grid)들의 사용을 통해 실시간으 로 협력하는 멀티벡터(multi-vector) DER들을 갖는 분산형(decentralized) 시스템 오브 시스템즈(system of systems, SoS)를 기반으로 한다. 따라서 추세는 프로슈머(prosumer)들이 마이크로-그리드(micro-grid)들로 알려 진 로컬 피어-투-피어(Peer-to-Peer, P2P) 네트워크들에서 에너지를 교환할 뿐만 아니라 지역, 국가 또는 심지 어 국가 간 레벨의 다른 마이크로-그리드들과 에너지를 교환하여, 도매와 소매 시장들 간의 기존 장벽을 제거하고 있다. EI와 관련된 과제는 전통적인 그리드의 기술적 아키텍처를 중앙 집중식, 커맨드 및 제어 지향 아키텍처에서 탈 중앙화 및 분산된 P2P 아키텍처로 발전시키는 것을 포함한다. 또 다른 과제는 프로슈머들 간의 관계에서 복잡성 을 관리하는 것이고, 이는 전통적인 전기 그리드의 현재 운영 모델을 크게 변경하고 프로슈머들 및 전기 자동차 (electric vehicle, EV)들의 채택에 의한 청정 에너지원의 채택, 저장 시스템의 점진적 배치 및 청정 에너지 생 성 시스템의 잠재적인 대규모 배치로 인해 이미 변화하고 있다. 마지막으로, EI는 또한 경제 모델 과제들을 포 함하는데, 이는 DER들의 도입이 소매상과 고객들 간의 관계를 완전히 변화시켜 고객들이 에너지의 수동적 소비 자에서 에너지를 생산, 소비, 저장 및 거래하는 프로슈머들로 진화할 수 있기 때문이다. 따라서 트랜잭션 (transaction)들의 수가 폭발적으로 증가할 수 있음과 동시에 그 빈도는 증가할 것이어서, 다양한 타입의 에너 지의 완전히 분산형인 실시간 거래로 이행할 수 있다. 에너지 규제자(energy regulator)들은 모든 거래에서 에 너지 트릴레마(trilemma)(즉, 에너지 공급 안보(energy security of supply), 저탄소 배출 및 저에너지 비용을 동시에 충족시키는 것의 어려움)의 균형을 요구할 것이기 때문에 도매 및 소매 시장은 통합되어야 할 것이다. 따라서 탄소 배출량 및 에너지 생성 및 분배 비용을 최소화하면서, 사용자의 에너지 서비스 요구사항을 만족시 키기 위해 가상으로 DER들을 집계(aggregate)할 수 있는 새로운 시스템들 및 방법들이 필요하다. 이 개요는 개념들의 선택을 단순화된 형태로 소개하기 위해 제공되는 것이며, 개념들은 하기의 상세한 설명에서 더 설명된다. 이 개요는 청구된 주제의 주요 특징들을 식별하기 위한 것이 아니며 청구된 주제의 범위를 결정하 는데 도움을 주기 위한 것도 아니다. 일부 실시예에서, 본 개시의 멀티벡터 에너지 공급망 관리 및 최적화 시스템은 적어도 하나의 매크로-그리드 (macro-grid)에 연결된 복수의 상호 연결된 마이크로-그리드들을 포함하는 에너지 시스템을 포함한다. 에너지 시스템은 에너지 네트워크를 통해 하나 이상의 컴퓨팅 디바이스들에 통신적으로(communicatively) 결합된다. 하 나 이상의 컴퓨팅 디바이스들은 적어도 하나의 프로세서 및 컴퓨터 코드를 저장하는 메모리를 포함하고, 상기 컴퓨터 코드는 적어도 하나의 프로세서에 의한 실행에 응답하여 하나 이상의 컴퓨팅 디바이스로 하여금 지속적 인 가상 세계 시스템 및 분산형 에너지 관리 시스템을 구현하게 한다. 지속적인 가상 세계 시스템은 실세계에 따라 매핑되고 해당 실세계 요소의 적어도 하나의 가상 복제본(virtual replica)을 포함하는 복수의 가상 객체 들을 포함한다. 가상 복제본 중 일부는 에너지 시스템으로부터의 해당 에너지 관련 디바이스들의 에너지 복제본 들을 포함한다. 분산형 에너지 관리 시스템은 적어도 지속적인 가상 세계 시스템에서의 시뮬레이션을 통해 에너 지 시스템으로부터 수신된 데이터에 기초하여 에너지 흐름을 디지털 방식으로 통합 및 제어하도록 구성된 에너 지 제어 시스템; 및 지속적인 가상 세계 시스템을 사용하여 에너지 관련 디바이스들 간의 에너지 집계 (aggregation) 및 교환을 가능하게 하는 에너지 시장 플랫폼을 포함한다. 일부 실시예에서, 에너지 제어 시스템은 해당 버스(verse)들에서 하나 이상의 동시발생적 목표 지향 시뮬레이션 (concurrent goal-oriented simulation)을 수행한다. 버스들은 적어도 에너지 공급의 품질과 신뢰성을 유지하 고 에너지 네트워크에서의 에너지 흐름을 제어하기 위한 제어 전략을 정의하도록 구성된 운영 버스(operation verse); 복수의 시나리오에서의 에너지 수요 및 생성(generation)을 예측하도록 구성된 예측 버스(prediction verse); 및 증강(augmented) 및 처방적(prescriptive) 분석을 수행하도록 구성된 분석 버스(analytics verse) 를 포함한다. 추가 실시예에서, 각각의 버스는 추가 목표 지향 시뮬레이션들을 용이하게 하는 상이한 객체 특정 스트림(object-specific stream)들로 세분된다. 추가 실시예에서, 지속적인 가상 세계 시스템은 해당 버스들에서의 동시발생적 목표 지향 시뮬레이션을 통해 에 너지 관리 및 거래 프로세스들을 자동화하도록 구성된 인공 지능 에이전트(artificial intelligence agent)들의 심리스 통합(seamless integration)을 가능하게 한다. 추가 실시예에서, 동시발생적 목표 지향 시뮬레이션을 통해 에너지 제어 시스템에 의해 구현되는 에너지 제어 전략은 최저 에너지 비용, 최저 탄소 배출량 및 에너지 공급 안보의 인자로서 에너지 생성 및 분배를 최적화하 는 것 중 적어도 하나에 기초한다. 일부 실시예에서, 다양한 버스들은 에너지 시스템의 전체적이고 최적화된 관리를 제공하는 통일된 뷰(unified view)로 통합된다. 또한 추가 실시예에서, 복수의 에너지 시장 오퍼레이터들은 에너지 제어 시스템으로부터의 에너지 데이터 교환 에 기초하여 에너지 흐름을 집계 및 거래하기 위해 에너지 시장 플랫폼의 개별 인스턴스(instance)들을 이용한 다. 또한 추가 실시예에서, 복수의 에너지 시장 오퍼레이터들은 네트워크 보강 및 부하 관리를 통해 분배 (distribution) 및 전송(transmission) 에너지 네트워크들을 운영 한계 내에 유지하기 위해 상기 에너지 제어 시스템의 인스턴스들을 통해 하나 이상의 에너지 분배 시스템 오퍼레이터들과 통신한다. 또한 추가 실시예에서, 하나 이상의 에너지 시장 오퍼레이터들은 에너지 수요가 공급되는 에너지보다 클 때 하나 이상의 에너지 분배 시스템 오퍼레이터들에게 부족분 에너지를 요청하거나, 하나 이상의 에너지 시장 오퍼레이터들은 공급되는 에너 지가 요구되는 에너지보다 클 때 잉여분 에너지를 외부 소비자들과 거래하기 위해 잉여분 에너지를 에너지 시장 플랫폼의 피어-투-피어 병렬 경매 시스템에 요청한다. 일부 실시예에서, 운영 버스는 하나 이상의 에너지 시장 오퍼레이터들의 계량(metering), 청구(billing) 및 입찰(bidding) 서비스에 연결된다. 일부 실시예에서, 에너지 시스템의 에너지 관련 디바이스들은 에너지 생성 디바이스, 에너지 저장 디바이스, 에 너지 제어 디바이스, 에너지 소비 디바이스 및 에너지 분배 디바이스 중 하나 이상을 포함한다. 에너지 관련 디 바이스들 중 적어도 일부는 멀티벡터 분산 에너지 자원(DER)들 내에 포함된다. 일부 실시예에서, DER들은 풍력 터빈(wind turbine)들, 지열 발전소(geothermal plant)들, 수력 발전소(hydroelectric plant)들, 바이오매스 발전소(biomass plant)들 및 전기 자동차(EV)들과 같은 하나 이상의 에너지 생성 디바이스들, 및/또는 다른 상 응하는 에너지 관련 디바이스들(예를 들어, 에너지 저장 디바이스들, 에너지 제어 디바이스들, 에너지 소비 디 바이스들 및 에너지 분배 디바이스들)을 포함할 수 있다. 일부 실시예에서, 분산형 에너지 관리 시스템은 EV 가상 복제본들의 상태들을, 대응하는 EV들이 대응하는 마이 크로-그리드에 연결된 충전소에 연결 또는 연결 해제되어 있는지에 기초하여 업데이트하는 것을 가능하게 한다. 또한 이들 실시예에서, EV를 대응하는 마이크로-그리드에 연결하는 것은 모빌리티(mobility) 네트워크로부터 상 기 EV의 사용 불가능한 상태를 활성화하고, EV를 대응하는 마이크로-그리드로부터 연결 해제하는 것은 모빌리티 네트워크에서 EV의 사용 가능한 상태를 활성화한다. 일부 실시예에서, 분산형 에너지 관리 시스템의 상이한 인 스턴스들은 연결 및 정보 교환을 관리하기 위해 스마트 계약(smart contracts)을 사용하여 서비스, 상태 및 데 이터를 공유한다. 일부 실시예에서, 지속적인 가상 세계 시스템을 통해 에너지 시장 플랫폼에 의하여 발생하는 상호 작용들은 에 너지 소비 패턴을 최적화하도록 사용자들을 장려하기 위해 게임화된다(gamified). 일부 실시예에서, 에너지 시장 플랫폼은 서비스로서의 에너지(Energy-as-a-Service, EaaS) 경제를 지원하여, 에 너지 관련 데이터, 서비스, 시뮬레이션 거래를 위한 공개 시장을 제공하며, 여기서 모든 프로슈머는 전체 에너 지 시장에 참여하고 가치를 부가할 수 있다. 일부 실시예에서, 분산형 에너지 관리 시스템은 새로운 콘텐트(content), 애플리케이션 및 서비스를 분산형 에 너지 관리 시스템에 추가할 수 있도록 하는 에너지 애플리케이션 스토어(energy application store)를 포함하거 나 이에 연결된다. 일부 실시예에서, 에너지 공급망 관리 및 최적화 방법은 에너지 시스템에 에너지 네트워크를 통해 연결된 하나 이상의 컴퓨팅 디바이스들에 의해 수행된다. 에너지 시스템은 적어도 하나의 매크로-그리드에 연결된 복수의 상 호 연결된 마이크로-그리드들을 포함한다. 방법은 실세계에 따라 매핑되고 해당 실세계 요소의 적어도 하나의 가상 복제본을 포함하는 복수의 가상 객체들 을 포함하는 지속적인 가상 세계 시스템을 제공함으로써 시작되고, 상기 가상 복제본 중 일부는 에너지 시스템 으로부터의 해당 에너지 관련 디바이스들의 에너지 복제본들을 포함한다. 방법은 지속적인 가상 세계 시스템에 통신적으로 결합되고 적어도 에너지 제어 시스템 및 에너지 시장 플랫폼을 포함하는 분산형 에너지 관리 시스템 을 제공함으로써 진행된다. 방법은 지속적인 가상 세계 시스템에 의해, 에너지 시스템으로부터의 에너지 데이터 및 에너지 시장 플랫폼으로부터의 에너지 트랜잭션 데이터를 수신한다. 방법은 에너지 시스템으로부터 수신된 데이터 및 에너지 시장 플랫폼으로부터의 트랜잭션 데이터에 기초하여 에너지 제어 시스템에 의해 에너지 흐름 을 평가, 제어 및 최적화하고, 이들은 그 다음에 에너지 시스템으로부터 수신된 데이터에 기초하여 에너지 흐름 을 디지털 방식으로 통합하고 제어하기 위해, 지속적인 가상 세계 시스템에서의 시뮬레이션을 통해, 에너지 제 어 시스템과 에너지 시장 플랫폼 간의 기능(function)들을 조정(coordinating)하기 위해 사용된다. 방법은 상기 에너지 시장 플랫폼에 의하여 에너지 관련 디바이스들을 통한 에너지 행위자들 간의 에너지를 집계하고 교환한 다. 일부 실시예에서, 에너지 제어 시스템에 의해, 지속적인 가상 세계 시스템으로부터 업데이트된 에너지 데이터를 수신한 후에, 방법은 에너지 제어 시스템이 적어도 운영 버스, 예측 버스 및 분석 버스를 포함하는 해당 버스들 에서 하나 이상의 목표 지향 시뮬레이션을 동시에 수행하도록 트리거한다. 다양한 실시예에서, 운영 버스는 에너지 공급의 품질과 신뢰성을 유지하기 위한 제어 전략을 정의하는 단계; 및 제어 전략에 기초하여 에너지 네트워크에서의 에너지의 흐름을 제어하는 단계를 수행하도록 구성된다. 예측 버 스는 복수의 시나리오에서의 에너지 수요 및 생성을 예측하는 단계를 수행하도록 구성된다. 분석 버스는 수신된 에너지 데이터에 대한 증강 및 처방적 분석을 수행하는 단계를 수행하도록 구성된다. 또한 추가 실시예에서, 방법은 추가 목표 지향 시뮬레이션들을 용이하게 하는 상이한 객체 특정 스트림들로 버 스들 중 하나 이상을 세분하는 단계를 더 포함한다. 일부 실시예에서, 복수의 에너지 시장 오퍼레이터들은 에너 지 제어 시스템으로부터의 에너지 교환 데이터에 기초하여 에너지 흐름을 집계 및 거래하기 위해 에너지 시장 플랫폼의 개별 인스턴스들을 이용한다. 또한 추가 실시예에서, 방법은 복수의 에너지 시장 오퍼레이터들이 하나 이상의 분배 시스템 오퍼레이터들에게 에너지 제어 시스템의 인스턴스들을 통해, 분배 및 전송 에너지 네트워크 유지보수 요청을 전송하는 단계를 더 포함한다. 방법은 그런 다음 하나 이상의 분배 시스템 오퍼레이터들이 에 너지 제어 시스템의 상기 인스턴스를 통해, 분배 및 전송 에너지 네트워크들을 운영 한계 내에 유지하기 위해 네트워크 보강 및 부하 관리를 구현하는 단계로 진행된다. 일부 실시예에서, 방법은 EV를 충전소를 통해 대응하 는 마이크로-그리드에 연결하는 단계를 더 포함한다. 방법은 EV가 물리적으로 에너지를 거래할 수 있도록 하는 한편 모빌리티 네트워크로부터 상기 EV의 사용 불가능한 상태를 활성화하는 단계로 계속된다. 방법은 충전소를 통해 EV가 대응하는 마이크로-그리드로부터 연결 해제되는 단계로 계속될 수 있다. 마지막으로, 방법은 EV가 물 리적으로 에너지를 거래할 수 없게 하는 한편 모빌리티 네트워크에서의 EV의 사용 가능한 상태를 활성화하는 단 계로 종료될 수 있다. 일부 실시예에서 에너지 흐름 평가, 제어 및 최적화 방법은 분산형 에너지 관리 시스템에 의해 해당 마이크로 그리드들에 연결된 DER들로부터 에너지 데이터를 수신하는 단계를 더 포함한다. 분산형 에너지 관리 시스템은 에너지 요구사항을 예측을 행하고 예측 데이터를 사용하여 최적의 수익을 계산하는 단계로 진행된다. 방법은 DER들 또는 분산형 에너지 관리 시스템이 탄소 발자국(carbon footprint)을 계산하는 단계로 계속된다. 분산형 에너지 관리 시스템은 또한 시스템의 동적 사용 요금 및 관련 비용을 계산한다. 방법은 에너지 균형, 최적 수익, 탄소 발자국 및 시스템의 동적 사용 요금 및 관련 비용을 포함하는 데이터를 조정된 디스패치 기능 (coordinated dispatch function)에 전송하는 단계로 진행되고, 조정된 디스패치 기능은 에너지 공급 및 수요를 평가하고, 탄소 자격증명(credential), 가격 및 디스패치 가능성(dispatchability)에 기초하여 공급자들을 분류 하고, 예측되는 원하는 에너지를 조정한다. 방법은 조정된 디스패치 기능에 의해, 부족분 또는 잉여분 에너지가 있는지 확인하는 단계로 계속된다. 부족분 또는 잉여분 에너지가 없으면, 상기 조정된 디스패치는 조정된 예측 되는 에너지를 에너지 거래 커맨드(energy trading command)에 전송한다. 그러나 부족분 또는 잉여분 에너지가 있으면, 상기 조정된 디스패치는 부족분/잉여분 요청을 피어-투-피어 병렬 경매 프로세스로 전송한다. 방법은 에너지 교환 기능(energy exchange function)에 의해 원하는 에너지 교환을 수행하는 단계로 계속된다. 마지막 으로, 방법은 해당 공급자들에게 에너지 흐름 비용 정산을 수행하는 단계로 종료된다. 위의 개요는 본 개시의 모든 양태들의 완전한 목록을 포함하지 않는다. 본 개시는 하기의 상세한 설명에 개시되"}
{"patent_id": "10-2023-0053930", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "고 특히 본 출원과 함께 출원된 청구 범위에서 적시된 것들 뿐만 아니라 위에 요약된 다양한 양태의 모든 적합 한 조합으로부터 실시될 수 있는 모든 시스템들 및 방법들을 포함하는 것으로 고려된다. 그러한 조합은 위의 개 요에서 구체적으로 기재되지 않은 이점들을 갖는다. 본 개시의 다른 특징들 및 이점들은 첨부된 도면 및 하기에 뒤따르는 상세한 설명으로부터 명백해질 것이다."}
{"patent_id": "10-2023-0053930", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "다음의 설명에서, 다양한 실시예를 예로서 보여주는 도면을 참조한다. 또한, 여러 예들을 참조하여 다양한 실시 예가 설명될 것이다. 실시예는 청구된 주제의 범위를 벗어나지 않고 설계 및 구조의 변경을 포함할 수 있음을 이해해야 한다. 본 개시는 에너지 공급망을 관리하고 최적화하기 위한 시스템 및 방법을 설명한다. 본 개시의 기술은 실세계의 모든 또는 거의 모든 요소가 디지털 방식으로 복제되어 있는, 복수의 가상 복제본들을 포함하는 지속적인 가상 세계 시스템으로의 에너지 네트워크들의 완전한 디지털화(full digitization)에 기초한다. 이 시뮬레이션된 디 지털 현실 또는 지속적인 가상 세계 시스템은, 미시적(예를 들어, 개별 부하, 건물 또는 주거 영역) 및 거시적 (예를 들어, 지구(district), 마을 또는 도시) 레벨에서의 수요와 공급의 포괄적인 실시간 모니터링에 기초하여 에너지의 최적화를 가능하게 하는 에너지 제어 시스템을 통해 에너지 관련 정보를 캡처하고 제어 전략을 적용하 는 분산형 에너지 관리 시스템에 연결된다. 에너지 제어 시스템은 복수의 부하들에 대한 에너지의 멀티벡터 공 급 및 제어를 가능하게 하는 것을 특징으로 하며, 상기 에너지 제어 시스템은 분산 에너지 자원(DER)들에 포함 된 \"차일드(child)\" 로컬 컨트롤러들을 통합하고 상호 운용하도록 구성된다. 분산형 에너지 관리 시스템은 또한 에너지 제어 시스템과 함께 동작하는 에너지 시장 플랫폼을 통해 에너지 시장의 상이한 행위자(actor)들 간에 에너지 거래를 가능하게 한다. 에너지 시장 플랫폼은 서비스로서의 에너지(EaaS) 경제를 지원하여, 에너지 관련 데이터, 서비스 및 시뮬레이션 거래를 위한 공개 시장을 제공하며, 여기서 모든 프로슈머가 참여할 수 있고 전 체 에너지 시장에 가치를 부가할 수 있다. 실세계 객체들 중 일부는 지속적인 가상 세계 시스템에 저장되고, 업 데이트되고, 실행되는 대응하는 에너지 복제본을 포함하는 에너지 관련 디바이스들(예를 들어, 에너지를 생성, 저장, 제어, 분배 또는 소비하는 디바이스들)이다. 따라서, 에너지 공급망을 가상화하고, 미시적 및 거시적 레 벨에서 에너지 관련 작업들 및 상호작용들을 디지털 방식으로 기록, 컴퓨팅 및 시뮬레이션함으로써, 본 개시의 시스템들 및 방법들은 지속적인 가상 세계 시스템의 형태로 에너지 네트워크들의 통일된 가상 추상화를 통해 로 컬에서 초국가적 레벨로, 에너지 시장에서의 복수의 행위자들 간의 심리스 상호 운용성(seamless interoperability)을 가능하게 한다. 도 1은 일 실시예에 따른 에너지 공급망 관리 및 최적화 시스템의 개략적인 표현을 도시한다. 본 개시의 에너지 공급망 관리 및 최적화 시스템은 적어도 하나의 매크로-그리드에 연결된 복수의 상 호 연결된 마이크로-그리드들(예를 들어, 마이크로-그리드들(1-N))을 포함하는 에너지 시스템을 포함 한다. 에너지 시스템은 네트워크를 통해 하나 이상의 클라우드 서버들에 연결된다. 하나 이상의 클라우드 서버들은 적어도 하나의 프로세서, 및 적어도 하나의 프로세서에 의해 실행될 때, 실 세계에 따라 매핑되고 해당 실세계 요소의 적어도 하나의 가상 복제본을 포함하는 복수의 가상 객체들을 포함하는 지속적인 가상 세계 시스템을 구현하는 컴퓨터 코드를 저장하는 메모리를 포함한다. 그러한 지속적인 가상 세계 시스템은 2021년 12월 14일 발행된 \"Merged Reality System and Method\"이라는 발명 명칭의 미국특허 No. 11,202,036에 설명되어 있으며, 이 특허의 전체 개시 내용은 본 명세서에 참조로 포함된다. 그러한 특허 출원에 설명된 바와 같이, 실세계에서의 요소들의 공간적, 물리적 및 논리적 관계가 대 응하는 가상 복제본들에 복제된다. 가상 복제본들은 자체 컴퓨팅 능력 및 자율적 행동을 제공하는 논 리, 가상 데이터 및 모델을 포함할 수 있다. 데이터는 가상 복제본들의 속성이며 모델은 포함된 논리를 통해 정 의되고 통제되는 대응하는 실세계 요소의 임의의 측면에 대한 그래픽, 수학적 및 논리적 표현이다. 일부 실시예에서, 가상 복제본들 중 일부는 에너지 시스템으로부터의 대응하는 에너지 관련 디바이스 들의 에너지 복제본들을 포함한다. 메모리는 에너지 시스템으로부터 수신된 데이터에 기초하여에너지 흐름을 디지털 방식으로 제어하도록 구성된 에너지 제어 시스템, 및 에너지 관련 디바이스들 간의 에너지 집계 및 에너지 및 서비스 교환을 가능하게 하는 에너지 시장 플랫폼을 적어도 포함하는, 지속적인 가상 세계 시스템에 연결된 분산형 에너지 관리 시스템을 또한 저장한다. 본 개시의 일부 실시예에서, 시스템은 퍼블릭(public) 또는 프라이빗(private) 클라우드들, 포그 서버(fog server)들, 및 기업 시스템들, 모바일 플랫폼들 및 사용자 디바이스들과 같은 에지 디바이스들 및 시스템들을 이용하는 분산 컴퓨팅 능력을 디스플레이할 수 있는 클라우드 투 에지 인프라(cloud to edge infrastructure)에 서 구현될 수 있고, 이들 모두는 네트워크를 통해 연결될 수 있다. 클라우드 투 에지 컴퓨팅 네트워크를 사용하 면, 컴퓨팅 성능에 대한 액세스, 컴퓨터 인프라스트럭처(예를 들어, 소위 서비스로서의 인프라스트럭처 또는 IaaS(infrastructure as a service)를 통해), 애플리케이션들 및 비즈니스 프로세스들이 클라이언트 디바이스들 을 통해 사용자들에게 온디맨드(on demand)로 서비스로서 제공될 수 있다. 이러한 방식으로, 물리적 서버들 및 네트워킹 장비를 포함하는 분산 컴퓨팅 자원들이 서비스 사용자들의 위치, 그들의 상황, 그들의 요청된 서비스 품질 또는 그들의 컴퓨터 조작(computational) 수요와 같은 인자들에 따라 동적으로 할당될 수 있는 공유 스토 리지 및 컴퓨팅을 가능하게 한다. 본 개시에서 용어 \"지속적인(persistent)\"은 계속적으로 실행되는 프로세스 또는 네트워크 연결 없이 계속 존재할 수 있는 시스템의 상태를 특징화하기 위해 사용된다. 예를 들어, 용어 \" 지속적인\"은 가상 세계 시스템 및 그 안에 포함된 모든 가상 복제본들, 순수한 가상 객체들 및 애플리케이션들 이 가상 복제본들, 순수한 가상 객체들 및 애플리케이션들을 생성하는 데 사용된 프로세스들이 중단된 이후에도, 그리고 사용자들이 가상 세계 시스템에 연결되어 있는 것과 관계없이 계속해서 존재하는, 가상 세계 시스템을 특징화하기 위해 사용될 수 있다. 따라서 가상 세계 시스템은 서버에서 비휘발성 스토리지 위치에 저 장된다. 이러한 방식으로, 가상 복제본들, 순수한 가상 객체들 및 애플리케이션들은 사용자들이 서버에 연결되 어 있지 않더라도 특정 목표를 달성하도록 구성될 때 서로 상호 작용하고 협력할 수 있다. 일부 실시예에서, 에너지 시스템의 에너지 관련 디바이스들은 복수의 에너지 생성 디바이스들, 에너 지 저장 디바이스들, 에너지 제어 디바이스들, 에너지 소비 디바이스들 및 에너지 분배 디바이 스들 중 하나 이상을 포함한다. 에너지 관련 디바이스들 각각은 대응하는 에너지 복제본에 그것의 정 보가 저장되는 논리적 자원으로서 지속적인 가상 세계 시스템에 의해 해석된다. 추가 실시예에서, 에너지 관련 디바이스들 중 적어도 일부는 네트워크의 부분일 수 있는 물리적 인터페이스 게이트웨이를 통해 지속 적인 가상 세계 시스템에 연결될 수 있다. 본 개시의 일부 양태에서, 에너지 관련 디바이스들 중 적어도 일부는 하나 이상의 마이크로-그리드들에 연 결되는 DER들 내에 포함된다. DER들은 에너지를 생성, 저장 및 생성된 에너지를 분배하기 위한 장비 및 기술을 갖춘 소규모의 분산형 연결된 에너지 자원들로서, 일반적으로 그것들이 서비스 제공하는 부하 근처에 위치된다. 예를 들어, DER들은 대응하는 에너지 저장 디바이스들, 에너지 제어 디바이스들, 에너지 소비 디바이 스들 및 에너지 분배 디바이스들과 함께 풍력 터빈들, 지열 발전소들, 수력 발전소들, 바이오매스 발 전소들 및 전기 자동차(EV)들과 같은 하나 이상의 에너지 생성 디바이스들을 포함할 수 있다. 에너지 저장 디바이스들은 일부 실시예에서 재생 에너지 생성을 지원하고, 전력 품질 서비스, 피크 부하 평준화(peak load levelling) 또는 무정전 전원 공급장치(uninterruptible power supply)를 제공하기 위해 사 용될 수 있다. 펌핑된 하이드로-스토리지(pumped hydro-storage), 압축 공기 에너지 스토리지(compressed air energy storage, CAES), 액체 공기 에너지 스토리지(liquid air energy storage, LASS), 플라이휠(flywheel) 기술 및 배터리들과 같은 다양한 타입의 에너지 저장 디바이스들이 사용될 수 있다. 배터리들은 예를 들어, 리튬-이온 배터리(lithium-ion battery)들, 납축 배터리(lead acid battery)들, 나트륨 황 배터리 (sodium sulphur battery)들, 니켈 카드뮴 배터리(nickel cadmium battery)들, 바나듐 레독스 흐름 배터리 (vanadium redox flow battery)들, 아연 브롬 흐름 배터리(zinc bromine flow battery)들, 폴리설파이드 브롬 흐름 배터리(polysulphide bromine flow battery)들 및 주택용 배터리 시스템(residential battery system)들 일 수 있다. 로컬 에너지 제어 디바이스들은 DER들 및 대응하는 에너지 관련 디바이스들 각각을 분산형 방식으로 관리 한다. 다양한 실시예에서, 로컬 에너지 제어 디바이스들은 특정 DER 또는 복수의 DER들에 대해 구성된다. 로컬 에너지 제어 디바이스들은 상기 특정 하나 이상의 DER들에 대한 감시 제어 및 데이터 획득 (Supervisory Control and Data Acquisition, SCADA) 기능을 구현할 수 있다. 일부 실시예에서, 에너지 제어 디바이스들은 다른 DER들로부터 에너지를 받거나 다른 DER들에 에너지를 제공하기 위해 동일한 또는 다른 영역들에 있는 다른 DER들의 인접한 에너지 제어 디바이스들과 통신하도록 구성된다. 다른 실시예에서, 로 컬 제어 디바이스들로부터의 에너지 제어 동작이 에너지 제어 시스템에 의해 정의된 파라미터들에 기초한 특정 에너지 제어 전략을 따르도록, 로컬 에너지 제어 디바이스들은 에너지 제어 시스템으로부 터 제어 신호를 수신한다. 에너지 제어 시스템으로부터의 제어 신호는 네트워크를 통해 보안 액세스 게이트웨이를 통해 기존 통신 네트워크를 사용하여 개개의 로컬 에너지 제어 디바이스들로 전송된다. 제어 신호는 수요 측 응답 및 빠른 주파수 응답(fast frequency response)과 같은 기능성을 제공한다. 예를 들어, 상 기 제어 동작들을 지배하는 제어 전략은 최저 에너지 비용, 최저 탄소 배출량 및 공급 안보의 인자로서 에너지 생성 및 분배를 최적화하는 것에 기반할 수 있다. 따라서, 본 개시의 제어 전략은 에너지 제어 시스템을 통한 중앙 집중식 제어와 복수의 로컬 에너지 제어 디바이스들을 통한 분산형 제어의 조합을 가능하게 한 다. 분산형 모델은 네트워크의 관리 가능한 부분들에서 자산(assets)에 대한 더 큰 제어를 제공하며 중앙 집중식 제어 시스템보다 더 높은 리던던시(redundancy)를 제공한다. 데이터 프로세싱 또한 중앙 집중식 제어 시 스템에 비해 데이터 프로세싱 전력 감소라는 부가적인 이점과 함께 로컬 영역 에너지 제어 디바이스들로 더 관리하기 쉬워진다. 일부 실시예에서, 에너지 제어는 DER들 내에서의 에너지 관련 디바이스들 각각의 모니터링을 활용하며, 이는 에 너지 제어 시스템 및 로컬 에너지 제어 디바이스들에 모니터링 신호를 전송하는 복수의 스마트 미터 (smart meter)들을 통해 수행될 수 있다. 스마트 미터들은 전기 에너지 소비를 기록하고 모니터링 및 청구를 위 해 그 정보를 전기 공급자에게 전달하는 전자 디바이스들이다. 스마트 미터들은 유선 또는 무선 네트워크 를 통해 스마트 미터와, 중앙 시스템 또는 제공자 사이에 양방향 통신을 가능하게 한다. 모니터링은 각각의 개 별 에너지 시장 행위자뿐만 아니라 로컬 지리적 레벨에서도 사용될 수 있다. 본 개시의 실시예에서, 지속적인 가상 세계 시스템은 하나 이상의 에너지 네트워크 행위자들의 제약조건 및 실시간 상태들을 식별시키는 에 너지 네트워크의 시각적 표현을 제공함으로써, 로컬 영역 컨트롤러들이 에너지 네트워크 관리를 보조할 수 있는 인공 지능(AI) 알고리즘과 함께 정보에 입각한 결정을 행하는 것을 가능하게 할 수 있다. 이는 에너지 제어 시 스템이 로컬 에너지 제어 디바이스들 간의 에너지 전달을 가능하게 할 수 있을 뿐만 아니라, 에너지 제어 시스템에 로컬 에너지 제어 디바이스들을 제어하는 능력을 제공할 수 있다. 에너지 제어 디바이스들은 에너지 제어 시스템이 대응하는 마이크로-그리드에 포함된 에너지 소 비 디바이스들 각각에 걸쳐 에너지를 분배하는 방법을 관리하는 데 사용될 수 있는 입력을 에너지 제어 시 스템에 제공한다. 에너지 제어 디바이스들은 조명 컨트롤러들, 난방, 환기 및 에어 컨디셔닝 (heating, ventilation, and air conditioning, HVAC) 컨트롤러들(예를 들어, 서모스탯(thermostat)들) 등과 같은 기존 디바이스들을 포함할 수 있다. 에너지 제어 디바이스들은 건물들 전체에 걸쳐 해당 워크스테이 션들 또는 위치들에 위치될 수 있다. 예를 들어, 로컬 조명 또는 HVAC 제어를 제공하기 위해 터치스크린 패널들 이 각각의 사무실이나 방에 제공될 수 있다. 에너지 소비 디바이스들은 에너지 제어 디바이스들로부 터 커맨드(commands)를 수신하고 이에 따라 에너지를 소비하는 디바이스들이다. 에너지 소비 디바이스들의 예는 조명 시스템들, HVAC 시스템들, 컴퓨팅 디바이스들, 가정용 전자기기들, 보일러들, 전기 자동차(EV)들 등 이다. 에너지 분배 디바이스들은 에너지 네트워크 내의 복수의 에너지 소비 디바이스들에 걸쳐 에너 지를 분배하는 데 사용되는 디바이스들일 수 있으며, 예를 들어 에너지 라우터(energy router)들, 에너지 허브 (energy hub)들, 무선 에너지 전송 디바이스들, 직류 네트워크(direct current network)들, 플러그 앤 플레이 디바이스(plug and play device)들 및 기술들 등을 포함할 수 있다. 일부 실시예에서, 에너지 공급망 관리 및 최적화 시스템은 3G, 4G 또는 5G 네트워크와 같은 네트워크(11 0)를 통해; 무선 로컬 영역 네트워킹(Wi-Fi)을 통해, 또는 유선 통신 시스템들을 통해 연결될 수 있다. 다른 실 시예에서, GPS, BDS, Glonass, QZSS, Galileo 및 IRNSS와 같은 다수의 위성 기반 내비게이션 시스템들을 집합 적으로 지칭하는 글로벌 네비게이션 위성 시스템(Global Navigation Satellite System, GNSS)들이 대응하는 가 상 복제본들의 정확한 포지션을 제공하기 위해 디바이스들의 포지셔닝(positioning)을 가능하게 하는 데 사용될 수 있다. 일부 실시예에서, 각각의 에너지 복제본 및 연관된 에너지 관련 디바이스는 해당 특정 에너지 관련 디바이 스와 관련된 모든 연결 및 상호 작용과 함께, 연관된 에너지 관련 디바이스를 인식하고 인증하는 데 사용될 수 있는 고유 디지털 ID 코드를 포함할 수 있다. 일부 예에서, 고유 ID 코드는 에너지 관련 디바이스의 일련 번호 들, 제품 코드들, 라이센스 정보, 소유자 정보, 물리적 속성(예를 들어, 형상, 크기, 색상 등), 동작 파라미터 들, 제어 파라미터들 등과 같은 정보와 연관될 수 있다. 일부 실시예에서, 지속적인 가상 세계 시스템은 실세계 객체들의 포지션(position), 방향(orientation), 스케일(scale) 및 치수(dimension)와 같은 실세계 좌표들, 물리적 특성, 및 실제 객체들 각각의 3D 구조를 가상 복제본들의 형태로 포함한다. 지속적인 가상 세계 시스템은 실세계의 가상 버전(virtual version)을지칭하며, 실세계의 모든 또는 대부분의 객체들은 대응하는 가상 복제본들로 표현된다. 추가 실시예에서, 지속적인 가상 세계 시스템은 순수 가상 객체들 및 애플리케이션들을 더 포함한다. 본 개시의 가상 복제본들은 실세계 요소, 또는 실제 트윈(real twin)의 가상 버전, 또는 가상 트윈 (virtual twin)을 지칭하고, 이는 CAD(computer assisted drawing) 또는 CAE(computer-assisted engineering) 방법들을 통해 매핑되거나 모델링될 수 있고, 실제 객체들의 컴퓨터 모델들(예를 들어, 건물 정보 모델 (building information model)들 - BIM들) 또는 다른 적합한 방법들에 의해 입력될 수 있으며, 실세계 대응물 의 외관뿐만 아니라 행동도 미러링할 수 있다. 실세계 객체들은 가상 복제본들을 강화(enriching)하고 그 들의 개개의 실제 대응물과 동기화하기 위한 멀티소스(multi-source) 지각 데이터(sensory data)를 가상 복제본 들에 제공할 수 있는 센서들(예를 들어, 사물 인터넷(IoT) 센서들, 스마트 미터들 등)을 추가적으로 포함 할 수 있어, 가상 복제본들의 실시간 또는 거의 실시간 업데이트를 가능하게 한다. 멀티소스 지각 데이터 는 무엇보다도, 3D 이미지 데이터, 3D 기하학적 구조들, 3D 엔티티(entity)들, 3D 지각 데이터, 3D 동적 객체들, 비디오 데이터, 오디오 데이터, 우선순위 데이터, 화학 조성, 폐기물 생성 데이터, 텍스트(textual) 데 이터, 시간 데이터, 포지션 데이터, 방향 데이터, 속도 데이터, 온도 데이터, 습도 데이터, 오염 데이터, 조명 데이터 , 볼륨 데이터, 흐름 데이터, 색채 데이터, 전력 소비 데이터, 대역폭 데이터 및 질량(mass) 데이터 중 하나 이상을 포함하는, 각각의 실세계 요소의 캡처 가능한 데이터를 포함한다. 특히, 에너지 관련 디바이스들의 경우, 대응하는 가상 복제본들의 멀티소스 지각 데이터는 에너지 복제본들에 공유되는 에너지 데이터 를 포함한다. 본 개시에서 용어 \"강화\"는 멀터소스 지각 데이터에 기초하여 가상 복제본에 추가 특성을 제공하는 행위를 기술 하기 위해 사용된다. 예를 들어, 가상 복제본들을 강화하는 것은 지각 메커니즘들로부터 캡처된 실세계 데이터 를 제공하는 것을 지칭할 수 있다. 일부 실시예에서, 복수의 연결된 가상 복제본들은 직접적인 물리적 통신 또는 간접적인 가상 복제본 기반 연결을 통해 피어-투-피어(P2P) 연결 설정을 가능하게 하는 가상 복제본 네트워크를 형성한다. 이러한 관계는 지속적인 가상 세계 시스템에서 새로운 상호 작용을 생성할 수 있는 이벤트들을 트리거할 수 있다. 예를 들어, 에너지 제어 시스템이 하나 이상의 마이크로-그리드들이 주어진 순간에 대해 불충분한 에너지 생성을 갖는다고 결정하는 것과 같은 이벤트는, 대응하는 에너지 복제본에 대한 상태 업데이트로 변환될 수 있다. 상기 업데이트는 에너지 제어 시스템이 에너지 시장 플랫폼을 통해 다른 마이크로-그리드들 에 의해 제공될 수 있는 부족분 에너지를 계산하기 위해 이 정보를 사용하도록 할 수 있다. 부족분 에너지 를 얻기 위해 에너지 시장 플랫폼을 통해 프로슈머들 간에 협상 프로세스가 발생할 수 있다. 일부 실시예 에서, 상기 계산 및 거래는 지속적인 가상 세계 시스템에 심리스하게 통합된 인공 지능(AI) 에이전트에 의해 수 행될 수 있다. 따라서, 가상 복제본 네트워크들은 에너지 관리 및 거래 프로세스에 사용될 수 있는 머신 대 머 신, 인간 대 머신, 머신 대 인간 및 인간 대 인간 상호 작용을 가능하게 한다. 일부 실시예에서, 가상 복제본들은 3D 모델, 동적 모델, 기하학적 모델 및 머신 러닝 모델 중 하나 이상을 포함하는 적합한 모델들을 포함한다. 모델 및 데이터는 가상 복제본들 각각의 발달(development)을 가능하게 하 는 지속적인 가상 세계 시스템에 연결된 복수의 외부 플랫폼 또는 엔진 서비스를 통해 입력될 수 있다. 복 수의 외부 플랫폼들은 예를 들어, 사물 인터넷(IoT) 플랫폼, 머신 러닝(Machine Learning, ML) 플랫폼, 빅데이 터 플랫폼 또는 시뮬레이션 플랫폼을 포함할 수 있다. 외부 플랫폼들은 가상 복제본들의 모델들 및 데이터 를 제공하고 조작하기 위해 애플리케이션 프로그래밍 인터페이스(application programming interface, API)들 및 소프트웨어 개발 키트(software development kit, SDK)들을 통해 지속적인 가상 세계 시스템에 연결될 수 있다. 지속적인 가상 세계 시스템에 포함된 엔진 서비스들은 무엇보다도 인공 지능, 시뮬레이션, 3D 및 햅틱 피처(haptic feature)들 등을 포함할 수 있다. 지속적인 가상 세계 시스템은 또한 실세계 요소들로부터 그리고 또한 그것들의 가상 복제본들로부터 공간 데이터를 수신하고 관리하도록 구성된 공간 데이터 스트리밍 플랫폼에 연결될 수 있다. 시스템은 가상 현실, 증강 현실, 병합 현실 인터페이스와 같은 디지털 현실 인터페이스들을 더 포함하여 병합된 현실 또는 가상 현실과 상호 작용하여, 에너지 관리 및 최적화를 위해 가상 복제본들 및 대응하는 에너지 복제본들과의 사용자 상호 작용을 가능하게 한다. 도 2는 일 실시예에 따른 피어-투-피어 에너지 거래에 사용하기 위한 에너지 거래 분배 네트워크의 개략적 인 표현을 도시한다. 도 2의 일부 요소들은 도 1과 유사하거나 동일한 요소들을 참조할 수 있으므로 동일한 참 조 번호를 사용할 수 있다. 도 2의 에너지 거래 분배 네트워크는 에너지 제어 시스템(예를 들어, 도 1의 에너지 제어 시스템)과 정합된(coordinated) 에너지 시장 플랫폼(예를 들어, 도 1의 에너지 시장 플랫폼)을 통해 P2P 에너지 거래 를 가능하게 할 수 있는 3-레이어 아키텍처를 포함한다. 3 개의 레이어는 적어도 하나의 전력 네트워크, 에너지 복제본 네트워크 및 비즈니스 네트워크를 포함한다. 도 2에서 실선 수직 화살표들은 레이어들 간의 데이터 흐름을 나타내고, 한편 점선 화살표들은 동일한 레이어들 내에서의 데이터 흐름을 나타낸다. 전력 네트워크는 매크로-그리드에 연결되는 복수의 마이크로-그리드들을 포함한다. 전력 네트워 크는 도 1의 에너지 시스템과 같은 에너지 시스템의 부분이고, 따라서 복수의 에너지 관련 디바이스 들을 포함한다. 마이크로-그리드들은 상이한 지리적 위치들에 놓여지고 여기서 DER들이 분산된 연결 포인 트들에 연결된다. 마이크로-그리드들은 또한 에너지 정보를, 전기 에너지의 소비를 동적으로 기록하 고 에너지 복제본 네트워크에 그 정보를 전달하는 스마트 미터들에 제공한다. 각각의 마이크로-그리 드의 내부 토폴로지(topology)는 다양할 수 있고 개별적으로 또는 서로 함께 동작할 수 있다. 예를 들어, 각각의 마이크로-그리드는 그것의 해당 전력 수요를, DER들을 디스패치함(dispatching)으로써 뿐만 아니라 인접한 마이크로-그리드들 또는 매크로-그리드로부터 전력을 수입함으로써, 또는 이들의 조합으로부 터 공급할 수 있다. 에너지 복제본 네트워크는 복수의 마이크로-그리드들 및/또는 매크로-그리드들 내의 상이한 에 너지 관련 디바이스들의 에너지 복제본들을 포함한다. 에너지 복제본 네트워크들의 상이한 요소들 각 각 또는 대부분은 점선 화살표로 나타낸 바와 같이 연결되어 있다. 에너지 복제본 네트워크는 도 1의 분산 형 에너지 관리 시스템에 연결된 지속적인 가상 세계 시스템 내에 포함될 수 있다. 대체로, 에너지 복제본 네트워크의 에너지 복제본들은 전력 네트워크들 내의 복수의 스마트 미터들로부터 에너지 소비 데이터를 획득하고 그에 따라 해당 에너지 복제본들 각각을 업데이트한다. 에너지 복제본 네 트워크는 에너지 흐름을 관리하고 최적화하기 위해 하나 이상의 클라우드 서버들의 분산형 에너지 관 리 시스템을 통해 프로세싱될 수 있는 데이터를 전송하는 통신 디바이스들, 애플리케이션들, 프로토콜들 및 정보 흐름을 포함할 수 있다. 비즈니스 네트워크는 마이크로-그리드 오퍼레이터(micro-grid operator, MGO)들, 에너지 분배 네트워 크 오퍼레이터(energy distribution network operator, EDNO)들 또는 에너지 시장 플랫폼(예를 들어, 도 1의 에너지 시장 플랫폼)에 의하여 해당 에너지 복제본들을 통해 그들 간에서 협력하는 다른 타입의 오퍼레이터들과 같은 복수의 오퍼레이터들을 포함하여, 에너지, 서비스 및 정보의 다방향(multidirectional) 교 환을 가능하게 한다. 비즈니스 네트워크들의 다양한 요소들 각각은 점선 화살표로 나타낸 바와 같이 상호 연결된다. 도 2의 예시적인 실시예에서, 매크로-그리드는 EDNO에 의해 대응하는 에너지 복제본(12 0')을 통해 표현되고 관리되며, 한편 다른 마이크로-그리드들 각각은 그것들의 대응하는 에너지 복제본들 을 통해 대응하는 MGO들에 의해 관리된다. 일부 실시예에서, 비즈니스 네트워크는 다른 오퍼레 이터들과의 에너지 거래 전략을 결정하는 다양한 종류의 비즈니스 모델을 개발하기 위해 블록체인(blockchain) 또는 분산된 원장(ledger)을 통해 상이한 행위자들 각각을 연결한다. 도 3은 일 실시예에 따라 복수의 에너지 시장 플랫폼(energy market platform, EMP)들 및 복수의 에너지 분배 네트워크들 및 대응하는 오퍼레이터들을 이용하는 에너지 거래 분배 네트워크의 다른 실시예의 개략적인 표현을 도시한다. 도 3의 일부 요소들은 도 1 내지 도 2와 유사하거나 동일한 요소들을 참조할 수 있으므로 동 일한 참조 번호를 사용할 수 있다. 본 개시의 에너지 시스템들의 복수의 마이크로-그리드들(예를 들어, 도 1의 에너지 시스템의 마이크로-그 리드들)에 연결된 다수의 DER들로 생성 및 에너지 수요의 혼합을 효율적으로 조정하기 위해, 에너지 거래 분배 네트워크는 대응하는 에너지 분배 시스템 오퍼레이터(energy distribution system operator, EDSO) 및 에너지 시장 플랫폼(EMP)에 연결될 수 있는 EDNO들을 포함한다. 각각의 EDNO, EDSO 및 EMP는 하나 이상의 특정 지리적 영역에 할당될 수 있다. 각각의 EDNO는 또한 원할 때 (예를 들어, 에너지 피크 순간에) 더 큰 에너지 자원 풀(pool)을 제공함으로써 에너지 서비스의 효율성, 안전성, 신뢰성 및 탄력성을 향상시키기 위해 다른 영역 특정 EDNO들에 연결될 수 있다. EDNO들은 하나 이상의 미리 정의된 지리적 영역들 내에서 DER들을 집계하고 대응하는 마이크로-그리드들을 관리하고 대응하는 EMP들에 의하여 발생하는 트랜잭션들을 통해 해당 소비자들 또는 프로슈머들에게 관련 에너지를 제공하는 것을 담당하는 시장 오퍼레이터들로 간주된다. EDNO들은 네트워크 보강(reinforcement) 및 부하(load) 관리를 통해 운영 한계(operational limit)들(예를 들어, 주파수, 전압, 가스 압력 등) 내에서 분배 및 전송 에너지 네트워크들을 유지할 수 있는 시스템 규제자들인 EDSO들과 통신한다. EDSO들은또한 EMP들을 통해 에너지의 피어-투-피어 경매가 발생한 후 EDNO들이 원하는 부족분 에너지를 제공 하고 잉여분 에너지를 받도록 구성될 수 있고, 이는 도 5와 관련하여 더 설명될 것이다. EDSO들은 도 1의 클라우드 서버와 같은 클라우드 서버에 저장될 수 있고 EMP들에서 수행되는 모든 에너지 트랜잭션들 을 추적할 수 있는, 에너지 분배 네트워크 데이터베이스(energy distribution network database, EDND)를 통해 상호 연결될 수 있다. 일부 실시예에서, 각각의 EDNO는 다른 EDNO들로부터 에너지 수입 또는 수출 동작이 발생하지 않는 시 간 동안 고립 모드(islanded mode)에서 작동할 수 있다. 예를 들어, EDNO1은 EDNO2 내지 EDNO4 중 임의의 것으 로부터 에너지 수입 또는 수출이 발생하지 않는 순간에 할당된 부하들을 공급할 수 있고, 이 경우 EDNO1은 고립 모드로 구성될 수 있다. 그렇지 않고, 다른 EDNO들로부터 에너지 수입 또는 수출이 발생할 때, EDNO들 은 그리드-연결 모드에서 작동할 수 있다. 도 4a 내지 도 4b는 일 실시예에 따른, 본 개시의 에너지 공급망 관리 및 최적화 시스템의 추가 개략적인 표현 을 도시한다. 보다 구체적으로, 일 실시예에 따라 도 4a는 분산형 에너지 관리 시스템, 지속적인 가상 세 계 시스템 및 에너지 시스템 사이의 관계를 보여주는 에너지 공급망 관리 및 최적화 시스템(400a)의 개략적인 표현을 묘사하고, 한편 도 4b는 공급망 관리 및 최적화 시스템 내에 포함된 상이한 시스템들 각각의 추가 세부사항을 보여준다. 도 4a 내지 도 4b의 일부 요소들은 도 1 내지 도 3과 유사하거나 동일한 요소들을 참조할 수 있으므로 동일한 참조 번호들을 사용할 수 있다. 도 4a에서, 에너지 공급망 관리 및 최적화 시스템(400a)은 복수의 센서들 및 스마트 미터들을 통해 에너지 네트 워크의 실시간 상태들을 포함하는 에너지 데이터를 지속적인 가상 세계 시스템으로 전송하는 에너지 시스 템을 포함한다. 지속적인 가상 세계 시스템은 에너지 데이터를 사용하여 복수의 가상 복제본들을 포 함하는 지속적인 가상 세계 시스템의 가상 복제본 네트워크들을 업데이트한다. 에너지 제어 시스템 은 에너지 시장 플랫폼으로부터 에너지 트랜잭션 데이터와 함께 지속적인 가상 세계 시스템으로 부터 업데이트된 에너지 데이터를 수신하고, 그런 다음 에너지 흐름을 그에 따라 평가, 제어 및 최적화하도록 진행한다. 그런 다음 최적화된 에너지 흐름 정보는 대응하는 에너지 관련 디바이스들을 통해 에너지 행위자들 간에 에너지 데이터를 집계하고 교환하기 위해 에너지 제어 시스템에 의해 에너지 시장 플랫폼으로 전송된다. 에너지 시장 플랫폼은 서비스로서의 에너지(EaaS) 경제를 지원하여, 에너지 관련 데이터, 서비 스, 인공 지능 및 시뮬레이션 거래를 위한 공개 시장을 제공하며, 여기서 모든 프로슈머는 분산, 모바일, 지능 형 및 참여 방식으로 전체 에너지 시장에 참여하고 가치를 부가할 수 있다. 도 4b는 도 4a의 에너지 공급망 관리 및 최적화 시스템(400a)의 시스템들을 더 상세히 예시하는 에너지 공급망 관리 및 최적화 시스템을 도시한다. 도 4b의 하단에서 시작하여, 에너지 시스템은 에너지 데이터를 지속적인 가상 세계 시스템으로부터의 가상 복제본 네트워크들의 대응하는 가상 복제본들로 전송하는 복수의 에너지 관련 디바이스들 을 포함하는 복수의 DER들에 각각 연결되는 복수의 마이크로-그리드들을 포함한다. 도 4b의 예에서, 마이 크로-그리드 #1 및 #2는 각각 대응하는 가상 복제본 네트워크 1 및 2에 에너지 데이터를 공유하는 한편, 마이크 로-그리드 #1 및 #2의 일부 요소들은 대응하는 가상 복제본 네트워크 1 및 2와 함께 서로 공유된다(상기 공유 요소들을 포함하는 마이크로-그리드(104') 및 가상 복제본 네트워크(402')로 나타낸 바와 같음). 예를 들어, 마 이크로-그리드 #1에 의해 커버되고 현재 가상 복제본 네트워크 1에 포함된 영역으로부터 이동하는 EV가 가상 복 제본 네트워크 2에 포함된 마이크로-그리드 #2에 의해 커버되는 영역으로 이동할 수 있고, 여기서 특정 시점(예 를 들어, 하나의 물리적 영역에서 다른 물리적 영역으로 이동할 때)에서 EV는 두 마이크로-그리드들 및 가상 복 제본 네트워크들 모두에 의해 공유될 수 있다. 지속적인 가상 세계 시스템으로부터 업데이트된 에너지 데 이터는 에너지 제어 시스템과 공유된다. 에너지 제어 시스템은 에너지 시장 플랫폼으로부터 트 랜잭션 데이터와 함께 상기 업데이트된 에너지 데이터를 수신하고 그에 따라 에너지 평가, 제어 및 최적화 전략 을 구현한다. 일부 실시예에서, 에너지 제어 시스템에 의해 구현되는 에너지 제어 전략은 적어도 부분적으로 본 명세서 에서 \"에너지 트릴레마\"라고 지칭되는 것을 해결하는 것에 기반하며, 이는 탄소 배출 및 비용의 최소량을 가지 면서 에너지 공급 안보를 충족시키는 것의 어려움을 나타낸다. 따라서, 이들 실시예에서, 에너지 제어 시스템 에 의해 구현되는 에너지 제어 전략은 최저 에너지 비용, 최저 탄소 배출량 및 에너지 공급 안보의 인자 (factor)로서 에너지 생성 및 분배를 최적화하는 것 중 적어도 하나에 기초한다. 일부 실시예에서, 에너지 제어 시스템은 대응하는 버스(verse)들에서 하나 이상의 동시발생적 목표 지향 시뮬레이션들을 수행하며, 각각의 버스는 대응하는 가상 복제본들에 연결된 그들 자신의 서비스들을 실행 할 수 있는 가상 세계 시스템의 개별 인스턴스들에 대응한다. 각각의 버스는 개별 마이크로-그리드 운영 시스템(operating system, OS)으로서 구현될 수 있다. 에너지 제어 시스템의 상이한 버스들은 데이터의 예 측, 모니터링 및 제어, 및 데이터의 분석과 함께 지속적인 가상 세계 시스템을 통한 에너지 시스템으 로부터의 데이터 획득과 같은 하나 이상의 감시 제어 및 데이터 획득(SCADA) 태스크들을 수행한다. 에너지 제어 시스템의 버스들 각각은 에너지 시장 플랫폼으로부터의 트랜잭션 데이터와 함께 지속적인 가상 세계 시스템으로부터의 업데이트된 에너지 데이터를 데이터 세트들로서 활용하여 목표 지향 시뮬레이션들을 수 행한다. 일부 실시예에서, 버스들은 적어도 예측 버스, 운영 버스 및 분석 버스를 포함한다. 각 각의 버스는 다른 버스들로의 에너지 데이터 교환을 가능하게 하여, 해당 버스 시뮬레이션 동안 추가 데이 터 세트들로 사용될 수 있는 피드백을 제공한다. 예측 버스는 복수의 시뮬레이션들을 수행함으로써 복수의 시나리오들에서 에너지 수요 및 원하는 생성을 예측하도록 구성된다. 예측 버스에 의한 예측 시뮬 레이션들은 예를 들어, 부하 예측, 구속(constrained) 예측 및 생성 예측을 포함할 수 있다. 다른 예에서, 예측 버스에 의한 예측 시뮬레이션들은 무엇보다도 일기 예보, 부하 불확실성, 고객 준수 예측, 예측을 무시할 고객 확률, 시간대 영향(time of day effects), 요일 영향(day of week effects)을 포함하거나 고려할 수 있다. 운영 버스는 에너지 공급의 품질 및 신뢰성을 유지하기 위한 제어 전략을 정의 및 구현하고, 에너지 네트 워크에서의 에너지 흐름을 제어한다. 이를 달성하기 위해, 운영 버스는 외부 플랫폼들로부터의 복수의 마 이크로-서비스들에 연결될 수 있거나, 해당 태스크들을 가능하게 하기 위해 로컬 또는 분산 운영 버스 서 비스들에 액세스할 수 있다. 운영 버스는 가상 발전소(virtual power plant, VPP) 오케스트레이션 (orchestration); 부하 관리; 스케줄링 및 디스패치(dispatch); 및 생성 최적화와 같은 태스크들을 구현할 수 있다. 운영 버스에 의해 구현될 수 있는 다른 태스크들은 마이크로-그리드 모드 제어(예를 들어, 그리드- 연결 모드 또는 고립 모드); 규정을 준수하기 위한 전압 및 주파수 제어; 광기전력(photovoltaic, PV) 스무딩 (smoothing); 피크 부하 시프팅(peak load shifting); 에너지 공급 및 수요에 기초한 부하 공유 및 DER 조정 (coordination); 매크로-그리드와 마이크로 그리드 재동기화; 마이크로-그리드들과 매크로-그리드 간의 전력 흐 름 제어; 에너지 네트워크 운영 모니터링; 결함 관리; 스케줄링; 네트워크 계획; 운영 계획 및 최적화; 및 다른 다양한 운영 태스크들을 포함한다. 운영 버스는 에너지 시스템의 전체 성능을 최적화하기 위해 예측 버스 또는 분석 버스와 같은 다른 버스들로부터의 데이터를 사용할 수 있다. 예를 들어, 에너지 트릴 레마를 최적화할 수 있는 단기 및 장기에 대한 최상의 생성, 저장 및 거래 전략을 처방하기 위해, 분석 버스 로부터의 실제 및 이력 데이터가 예측 버스로부터의 고속 시뮬레이션 데이터와 운영 버스에서 융합될 수 있다. 분석 버스는 시뮬레이션들 및 AI 에이전트들의 사용을 통해 증강되고 처방적인 분석을 수행한다. 증강된 분석(augmented analytics)은 머신 러닝의 사용을 통해 데이터 관리 성능을 향상시키기 위해 통계적 및 언어적 기술을 사용하는 것을 지칭한다. 처방적 분석(prescriptive analytics)은 에너지 분석 태스크 동안 사용될 수 있는 최적화, 시뮬레이션, 게임 이론 및 결정-분석 방법들을 통해 주어진 상황에 대한 최상의 경로 또는 솔루션을 찾는 데 전용되는 수학적 기법들을 지칭한다. 추가 실시예에서, 각각의 버스는 추가 목표 지향 시뮬레이션들을 용이하게 하는 상이한 객체 특정 레이어 (object-specific layer)들로 세분된다. 예를 들어, 전기 및 가스 네트워크들은 상이한 레이어들로서 계산될 수 있으며 별도의 버스들 각각에서 별도의 목표 지향 시뮬레이션을 가질 수 있다. 일부 실시예에서, 센서들에 의해 수집된 원시 데이터(raw data)를 클라우드 기반 시뮬레이션들과 결합할 때 각 각의 가상 복제본의 개선된 상태 추정이 얻어질 수 있다. 예를 들어, 클라우드 서버들에서 실행되는 머신 러닝 프로세스들 - 여기서 AI 러닝 프로세스들은 멀티레벨 시뮬레이션들로 보강됨 - 을 사용하여, 가상 복제본들 에서의 모델들을 조정하고 그것들의 실제 대응물들의 운영을 최적화하기 위해 실제(예를 들어, 지각 (sensory)) 데이터 및 복수의 버스들로부터의 시뮬레이션된 데이터가 비교될 수 있다. 또 다른 예에서, 지역 난 방 시스템(district heating system, DHS)에서는 공급 또는 소비자 노드들에서 압력, 온도 및 질량 흐름(mass flow)의 몇 개 원격 측정 값들만이 사용 가능하다. 시스템의 전체적인 상태를 제공하지 않을 수 있는 이러한 값들은 하나 이상의 버스들에서 실행되는 시뮬레이션들을 통해 정확도가 증강되고 향상될 수 있다. 일부 실시예에서, 지속적인 가상 세계 시스템은 해당 버스들에서 동시발생적 목표 지향 시뮬레이션들을 통 해 에너지 관리 및 거래 프로세스들을 자동화하도록 구성된 AI 에이전트들의 심리스 통합을 가능하게 한다. 따 라서, 이들 실시예에서, 버스들에 의해 수행되는 다양한 시뮬레이션 태스크들은 머신 러닝 알고리즘을 통해 지속적인 가상 세계 시스템에 통합된 AI 에이전트들에 의해 자동으로 실행될 수 있다. AI 에이전트들의 통합을 통한 에너지 관리 자동화의 예시적인 적용은 공급 안보의 개선으로 될 수 있는데, 비상 계획(contingency plan)들이 에너지 제어 시스템의 상이한 버스들에 의해 수행되는 바와 같은, 적응형 시 뮬레이션 모델들 및 실제 네트워크 조건들에 기초한 가정 시나리오(what-if scenario)들을 사용하여 AI 에이전 트들에 의해 자동으로 평가될 수 있기 때문이다. 간헐적인 재생 에너지의 불확실성으로 인한 다양한 상황들이 시스템의 약점과 병목 지역(bottleneck)들을 식별하기 위해 자동으로 평가될 수 있다. 따라서 AI 에이전트들은 네트워크에서의 공급 안보를 개선하기 위한 최상의 방책, 예를 들어, 정전 방지, 최적의 스케줄링 및 디스패치 달성을 제안할 수 있다. 다른 예에서, 자산 관리자들은 장비 고장으로 이어지는 자산의 성능 저하 또는 과부하를 예측하기 위해 다양한 버스들로부터의 수집 데이터 및 시뮬레이션들을 사용할 수 있으며, 이에 의해 과도한 물리적 수리 비용을 최소 화하면서 자산의 가동 시간 및 수명을 향상시킬 수 있다. 또 다른 예에서, 실제 및 이력 데이터는 가까운 미래 및 먼 미래의 피크 수요를 예측하기 위해 고속 시뮬레이션 들과 융합될 수 있어, 단기 및 장기에 대해 최상의 생성, 저장 및 거래 전략을 처방할 수 있다. 예를 들어, 다 음 경기에 대해 근처 경기장에서의 전기 소비량 피크를 정확하게 예측하기 위해 시뮬레이션이 사용될 수 있으며, 수천 명의 참석자가 그들의 EV를 그곳에 주차할 수 있고, 그들 모두 게임 동안 그들의 배터리를 동시에 충전하기를 원할 수 있기 때문이다. 또 다른 예에서, 에너지 그리드의 현재 및 미래 조건에 대한 증가된 인식은 에너지 제어 시스템의 다양한 버스들을 통해 프로슈머들의 AI 에이전트들에 의해, 그들의 생성 패턴을 최적화하고 미래 피크에 대응하기 위한 추가적인 스토리지 용량을 모색하기 위해 에너지 시장 플랫폼을 통해 근처 에지 노드들과 적극적으로 (proactively) 협상하는 데 사용될 수 있다. 예를 들어, 스마트 홈을 관리하는 AI 에이전트는 근처 경기장에서 중요한 경기가 있기 때문에 근처에 피크 전력 수요가 있음을 알고 있을 수 있으며, 이는 AI 에이전트가 그것의 태양광 패널에서 더 많은 에너지를 미리 생산하여, 스마트 홈 자체 배터리에 그 에너지를 저장하고 또한 경기장 경기 당일 에너지를 판매하기 위해 그 블록에 있는 다른 집들의 스토리지 용량을 렌트하는 것을 계획하게 할 수 있다. 일부 실시예에서, 다양한 버스들은 에너지 시스템의 전체적이고 최적화된 관리를 제공하는 통일된 뷰로 통 합된다. 따라서, 에너지 제어 시스템을 디스플레이하는 사용자 인터페이스(UI)는 원하는 버스들만의 필터 링 및 보기를 가능하게 할 수 있지만, 에너지 제어 시스템은 또한 모든 버스들 및 그에 의해 수행된 다양 한 시뮬레이션으로부터 발생된 데이터를 포함하는 뷰(view)의 활성화 및 통합을 가능하게 한다. 일 실시예에서, 하나 이상의 마이크로-그리드들로부터의 적어도 하나의 버스는 네트워크 보강 및 부하 관리를 통해 분배 및 전송 에너지 네트워크들을 운영 한계 내에서 유지하기 위해 하나 이상의 EDSO 운영 시스템 (OS)에 연결된다. 또 다른 실시예에서, 에너지 시장 오퍼레이터 #1 및 에너지 시장 오퍼레이터 #2와 같은 복수의 에너지 시장 오 퍼레이터들은 에너지 제어 시스템으로부터의 서비스들을 활용하여 에너지 데이터 교환에 기초하 여 에너지 흐름을 집계 및 거래하고, 에너지 제어 시스템의 복수의 버스들에 대한 서비스를 공유하기 위해 에너지 제어 시스템의 개별 버스들에 연결된다. 각각의 에너지 시장 오퍼레이터는 에너지 시장 플랫 폼의 개별의, 맞춤형 인스턴스이며, 복수의 에너지 시장 행위자들이 에너지를 거래하는 것을 가능하게 한 다. 예를 들어, 도 4b의 예시에서, 운영 버스는 에너지 시장 오퍼레이터 #1로부터의 계량 서비스 및 청구 서비스에 연결된다. 일부 실시예에서, 에너지 시장 오퍼레이터들, EDSO OS 및 에너지 제어 시스템의 복수의 버스들은 정보의 교환 및 연결을 관리하기 위해 분산형 에너지 관리 시스템에 연결 되거나 그 부분으로 구성된 분산된 원장 시스템을 통해 스마트 계약을 사용하여 상태 및 데이터를 공 유한다. 에너지 시장 오퍼레이터들을 활용하는 특정 에너지 시장 행위자들의 예는 규제 에이전트들 및 거래 에이전트들뿐만 아니라, EDNO들, 에너지 전송 사업자(energy transmission owner, ETO)들, EDSO들이다. 추가 실시예에서, 복수의 에너지 시장 오퍼레이터들은 에너지 수요가 공급된 에너지보다 높을 때 하나 이 상의 EDSO OS에 부족분 에너지를 요청한다. 다른 실시예에서, 복수의 에너지 시장 오퍼레이터들은 공 급된 에너지가 요구된 에너지보다 높을 때 여분의 에너지 생성을 외부 소비자들과 거래하기 위해 에너지 시장 플랫폼으로부터의 입찰 서비스를 활용하는 피어-투-피어 병렬 경매 시스템에 잉여분 에너지를 요청한다. 추가 실시예에서, 지속적인 가상 세계 시스템을 통한 에너지 시장 플랫폼에 의한 프로슈머들 간의 상 호 작용은 에너지 시스템의 최적화의 결과로 이어질 수 있는 에너지 소비 패턴을 최적화하도록 사용자들을 장려 하기 위해 게임화될 수 있다. 여기에서 \"게임화\"는 게임이 아닌 상황에서 게임 설계 요소들 및 게임 원리들을 적용하는 것을 지칭하며, 소비 패턴을 최적화할 목표로 대화형 애플리케이션들과의 게임과 같은 상호 작용을 포 함할 수 있다. 예를 들어, 탄소 배출 또는 총 에너지 소비를 줄이는 가정, 건물 또는 공장에서의 지속 가능한 소비 패턴은 에너지 청구서를 줄이는 데 도움이 되는 최적화 서비스로 교환될 수 있는 디지털 토큰(digital tokens)으로 보상받을 수 있다. 디지털 토큰은 에너지 시스템의 최적화를 위해 프로슈머들에게 관심 있는 혜택 을 제공하는 디지털 또는 암호 화폐, 할인 또는 쿠폰 형태로 보여질 수 있다. 도 5는 일 실시예에 따라, 에너지 관리 시스템(예를 들어, 도 1의 에너지 관리 시스템)과 협력하여 에너지 시장 플랫폼(예를 들어, 도 1의 에너지 시장 플랫폼)을 통해 에너지 거래를 가능하게 하는 에너지 공급망 관리 및 최적화 시스템 애플리케이션의 예를 도시한다. 도 5의 애플리케이션은 에너지 시장 플랫폼을 에너지 제어 시스템의 기능들로 조정하고, 이는 도 5에서 단순화를 위해 통일된 플랫폼에서의 복수의 조정된 태 스크(coordinated task)들을 포함하는 일련의 단계들로서 도시되어 있다. 애플리케이션에 의해 수행되는 태스크들은 하나 이상의 특정 지리적 영역들을 커버하는 해당 마이크로-그리드들에 연결된 DER들, 에너지 제어 시스템 및 에너지 시장 플랫폼을 포함하는 분산형 에너지 관리 시스템, 및 분산형 에너지 관리 시스 템에 연결된 EDSO들로부터의 작업들을 포함한다. 도 5의 일부 요소들은 도 1 내지 도 4b와 유사하거 나 동일한 요소들을 참조할 수 있으므로 동일한 참조 번호들을 사용할 수 있다. 애플리케이션은 스케줄링 및 입찰 프로세스 레이어로 시작하며, 이는 에너지 교환 시간 이전 동 안 구현될 수 있다. 대체로, 스케줄링 및 입찰 프로세스 동안, 분산형 에너지 관리 시스템은 미리 결정된 하나 이상의 지리적 영역들에 공급하기 위해 해당 DER들로부터 제공된 데이터에 기초하여 내부 에너지 조 정 디스패치(internal energy coordinating dispatch)를 구현한 다음, 다음 시간 슬롯에 대해 채택할 작업 모 드(예를 들어, 그리드-연결 모드 또는 고립 모드)를 결정할 수 있다. 스케줄링 및 입찰 프로세스는 분산형 에너 지 관리 시스템에 의해 에너지 제어 시스템(예를 들어, 도 1 및 도 4a 내지 도 4b의 에너지 제어 시스템 )으로부터 에너지 데이터(예를 들어, 특정 DER들에 대한 에너지 이용 가능성 및/또는 수요)를 수신함 으로써 시작된다. 일부 실시예에서, 에너지 데이터는 마이크로-그리드들에 연결된 DER들에서 구현되는 SCADA 시스템으로부터 얻어진다. 추가 실시예에서, 에너지 데이터는 후속 작업들을 위해 분산형 에너지 관 리 시스템에 의해 사용되기 전에 먼저 지속적인 가상 세계 시스템에서의 대응하는 에너지 가상 복제본들을 업데이트하는 데 사용된다. 에너지 데이터는 도 4b의 에너지 제어 시스템으로부터의 예측 버스 와 같은 버스들을 통해 에너지 예측을 행하기 위해 분산형 에너지 관리 시스템에 의해 사용된다. 에너지 예측 데이터는 해당 에너지 트랜잭션의 균형을 맞추기 위해 얼마나 많은 에너지가 생산 및 소비되어야 하 는지를 고려하는, 에너지 균형을 수행하는 데 사용된다. 그런 다음 에너지 균형 데이터는 분산형 에너지 관리 시스템에 의해 트랜잭션으로부터 얻어질 수 있는 최적의 수익 데이터를 계산하는 데 사용되며, 이는 해당 DER들에 대한 산출 이익을 최대화하는 것을 포함할 수 있다. 에너지 균형 데이터 및 최적 수익 데이터는 그런 다음 조정된 디스패치 기능(coordinated dispatch function)으로 전송된다. 스케줄링 및 입찰 프로세스 동안, DER들은 또한 탄소 발자국 데이터를 조정된 디스패치 기능으 로 보낼 수 있다. 탄소 발자국 데이터는 에너지 연료 생산의 초기 스테이지로부터, 수송 및 소비, 방출의 마지막 스테이지까지 DER SCADA에 의해 계산될 수 있고, 직접 DER SCADA에 의해 또는 다양한 버스들을 통해 분 산형 에너지 관리 시스템에 의해, 탄소 방출 비용을 계산하는 데 사용될 수 있다. 조정된 디스패치 기능 은 또한 시스템의 동적 사용 요금(dynamic use of system charge, DUoSC) 데이터를 수신하며, 이는 조정된 디스패치 기능에 부가될 수 있는 DUoSC 비용을 계산하는 데 사용될 수 있다. 조정된 디스패치 기능은 상이한 시장 행위자들(예를 들어, 소비자들, 공급자들 또는 프로슈머들)로부터의 에너지 공급 및 수요를 그들의 용량(capacity) 및 요구사항에 기초하여 평가한다. 조정된 디스패치 기능은 공급자들을 저탄소 자격증명, 가격 및 디스패치 가능성에 기초하여 분류하고, 예측되는 원하는 에너지를 조정하 고 조정된 예측되는 에너지를 추가 배치(deployment)를 위해 에너지 거래 커맨드로 보낸다. 그러나 에너지 네트워크의 커버된 영역 내에서 에너지 부족분 또는 잉여분이 있으면, 조정된 디스패치 기능은 피어-투-피 어(P2P) 병렬 경매 프로세스에 별도의 부족분/잉여분 요청 신호를 전송한다. 복수의 DER들에 의해 커버되는 특정 하나 이상의 지리적 영역들의 수요를 충족시키기에 충분한 에너지 공 급이 있을 때, 그리고 조정된 디스패치 기능에 의한 조정 프로세스가 완료된 후, DER들은 최종 에너 지 디스패칭 보증 확인(energy dispatching assurance confirmation)을 제공할 수 있다. DER들로부 터의 상기 확인으로, 에너지 거래 커맨드는 다시 DER들로 에너지 트랜잭션 커맨드를 전송한다. DER들은 DER 소유자들이 에너지 트랜잭션 데이터를 시각화하는 것을 가능하게 하는 사용자 인터페이스(U I)들을 통해 실행을 위한 커맨드를 수신한다. P2P 병렬 경매 프로세스는 조정된 디스패치 기능에 의해 개별적으로 전송된 입찰 신청(application) 들을 고려하고 분석하며, 여기서 신청들은 입찰 \"라운드(round)들\"에 배치된다. 각각의 라운드에서, 신청자들 (예를 들어, 구매자들 및/또는 판매자들)은 에너지 공급 및 수요에 따라 그들의 입찰/판매 가격을 업데이트한다. 신청들 중 하나가 특정 거래에서 낙찰되면, 신청자들은 입찰 수량 및/또는 입찰 프로세스를 계속 할 의향을 업데이트한다. 일부 실시예에서, 입찰의 결과는 에너지를 전달하기에 가장 적절한 DER들의 선택 을 포함할 수 있다. 추가 실시예에서, 특정 지리적 영역으로부터의 입찰자가 입찰에서 낙찰되면, P2P 병렬 경매 프로세스는 에너지 교환 서비스를 통한 에너지 교환을 트리거하기 위해 에너지 거래 커맨드에 신호를 보낸다. 에너지 교환 서비스는 EDSO를 통해 에너지 시장 플랫폼들과 임의의 외부 공급자들 사이에서 에너지를 거래한다. 또 다른 실시예에서, 외부 에너지 제공자가 부족분 에너지 요구사항을 충족하는 데 필요한 추가 에너 지를 제공하기 위해 에너지 시장에 에너지를 제공하고 있을 때, P2P 병렬 경매 프로세스는 EDNO 네트워크 스케줄링 데이터와 같은 해당 EDSO로부터 외부 에너지 제공자로부터의 추가 정보를 사용할 수 있다. 입찰이 성공한 후, P2P 병렬 경매 프로세스는 해당 EDNO에 의해 연결 가격(conjunction price) 및 시스템 사용 요금 계산으로부터 해당 EDSO들 데이터를 요청할 수 있고, 네트워크 안전 검사를 또한 요 청할 수 있다. 네트워크 안전 검사가 성공하면, EDSO는 에너지 거래 커맨드를 에너지 교환 서비 스에 보낼 수 있다. 그렇지 않고, 네트워크 안전 검사가 성공적이지 않으면, EDSO는 현재 외부 에너지 제공자 공급 요청을 거부하고 다른 외부 에너지 공급자에게 에너지를 요청하기 위해 그러한 피드백을 P2P 병렬 경매 프로세스로 보낼 수 있다. 연결 가격 및 시스템 사용 요금 계산 동안, EDSO는 시스템 사용 요금을 고려하여 다른 시장 플랫폼들 로부터 에너지를 받기 위해 현재 에너지 시장 플랫폼에 의해 지불되어야 할 추가적인 비용을 계산한다. 예를 들 어, 그리고 도 3을 참조하면, 현재 에너지 시장 플랫폼은 EMP 1일 수 있으며, 이는 EMP 2 내지 EMP 4 중 임의의 것으로부터 에너지를 받는 것일 수 있다. 따라서, 연결 가격 계산은 EMP 2 내지 EMP 4 중 임의의 것으로부터 에 너지를 받기 위한 EMP 1에 대한 대가를 고려할 수 있다. EDSO는 다음 입찰 라운드에 대한 영향뿐만 아니라 전체 연결 가격에 대한 각각의 트랜잭션의 임팩트 범위를 또한 고려할 수 있다. 에너지 교환 서비스는 신호를 EDSO들의 규제 조정자(regulation coordinator) 및 분산형 에너 지 관리 시스템의 계량 서비스로 전송한다. 에너지 교환 시간 동안, 애플리케이션의 교환 레이어에서, 에너지 시스템 규제자들(예를 들어, EDSO들, 전송 시스템 오퍼레이터(transmission system operator, TSO)들 등을 통한 정책 제공자들)은 규제 조정자를 통해 하나 이상의 특정 지리적 영역에 대한 표준 및 규제가 충족되는지 검사하고 보장한다. 정책 제공자들, EDNO들 또는 TSO들이 의무 위반을 발견하면 그 들은 패널티 서비스(penalty service)에 신호를 전송할 수 있다. 또한 에너지 교환 시간 동안, UI로부터 실행 서비스로 신호가 전송되고, 실행 서비스는 원 격 측정 데이터(예를 들어, 메가와트(megawatts) 또는 메가 VAR)를 계량 서비스로 전송한다. 계량 서비스 는 스마트 미터들의 사용을 통해 실행 및 에너지 교환 서비스들(552, 532)로부터 신호들을 수신하고 각각 의 특정 당사자에 대한 측정값을 청구서 결제 서비스(bill clearing service)로 전송한다. 애플리케이션의 마지막 부분은 에너지 교환 시간 후에 구현되고 분산형 에너지 관리 시스템의 에너지 시장 플랫폼의 재정적 측면을 다루는 정산 레이어(settlement layer)를 포함한다. 정산 레이어 에서는, 에너지 제공 또는 사전 계획된 에너지 소비에 대한 그들의 약속을 놓쳤을 수 있는 DER들 및 다른 에너지 제공자들에게 EDSO들에 의해 페널티가 할당될 수 있다. 또한, 페널티 서비스는 다른 시 장 오퍼레이터들이 규제자들 및 기타 외부 제공자들과의 계약을 위반하는 경우 그들에게 페널티를 부과한다. 페 널티 서비스는 페널티 청구서 결제를 위해 청구서 결제 서비스에 연결된다. 또한 정산 레이어에 서, 계량 서비스로부터 측정값을 수신하고 규정 및 표준을 위반한 참가자들에 대해 연관된 페널티를 차감 한 후, 수수료가 에너지 공급자들을 거쳐 청구서 결제 서비스를 통해 최종 고객들로부터 수금된 다. 청구서 결제 서비스는 DER들의 수익 서비스에 해당 DER들과 연관된 임의의 수익 및 이익에 대해 알리고, 에너지 요금(tariffs)에 대한 업데이트를 얻기 위해 하나 이상의 에너지 공급자들(56 0)과 통신한다. 최종 고객들은 에너지 소비 시간(예를 들어, 피크 및 비-피크(off-peak) 요금), 그들이 소비하는 에너지 타입, 시장 균형에 대한 그들의 기여도, 및 기타 그들이 제공할 수 있는 보조적인 서비스에 기초하여 상이한 요 금 및 청구율(charging rates)을 받을 수 있다. 요금은 에너지 시장 플랫폼 내에서 정의될 수 있으며 에너지 규제자들에 의해 통제될 수 있다. 도 6은 일 실시예에 따라 에너지 및 모빌리티 시스템의 개략적인 표현을 도시하며, 이에 의해 분산형 에너 지 관리 시스템은 모빌리티 네트워크에 연결된다. 도 6의 일부 요소들은 도 1 내지 도 5와 유사하거나 동일한 요소들을 참조할 수 있으므로 동일한 참조 번호들을 사용할 수 있다. 도 6에서, 에너지 및 모빌리티 시스템은, 복수의 센서들 및 스마트 미터들을 통해 에너지 네트워크의 실시 간 상태를 포함하는 에너지 데이터를 지속적인 가상 세계 시스템으로 전송하는 에너지 시스템을 포함 한다. 복수의 EV들을 포함하는 모빌리티 네트워크는 또한 에너지 시스템에 연결되고 에너지 데 이터를 에너지 시스템으로 전송하고 모빌리티 데이터를 지속적인 가상 세계 시스템으로 전송한다. 모 빌리티 네트워크는 이용 가능성, 사용자 및 EV로부터의 거리, EV의 경로 및 사용자의 원하는 목 적지 또는 경로와 같은 인자들에 따라 EV들을 공유하기 위해 복수의 사용자들에 의해 사용될 수 있는, 협력 플 랫폼(collaborative platform)에 집계된 EV들의 네트워크이다. 지속적인 가상 세계 시스템은 모빌리티 네트워크로부터의 에너지 및 모빌리티 데이터를 활용하여 에 너지 데이터 및 위치를 포함하는(그러나 이에 제한되지 않음) EV 가상 복제본의 상태를 업데이트한다. 일 실시예에서, EV를 마이크로-그리드의 부분인 충전소와 같은 충전소에 연결하는 것은 지속적인 가상 세계 시스템의 대응하는 EV 가상 복제본에서의 에너지 거래 이용 가능성 상태를 업데이트한다. 동시에, EV를 충전소에 연결하는 것은 연결된 EV의 상태가 모빌리티 네트워크로부터 이용 불가능한 것으 로 디스플레이되도록 모빌리티 네트워크에 신호를 보낼 수 있는데, 이는 EV가 승객 수송과 같은 모빌 리티 서비스에 대해 이용가능하지 않기 때문이다. 그러나 EV가 마이크로-그리드의 해당 충전소에서 연결 해제되는 경우, EV는 모빌리티 네트워크에서 이용 가능한 상태로 다시 업데이트되어, EV가 모빌 리티 서비스를 사용하고자 할 수 있는 사용자들에 대해 이용 가능한 것으로 디스플레이될 수 있다. 따라서, 이 들 실시예에서, EV들은 모빌리티 네트워크 및 지속적인 가상 세계 시스템을 통한 에너지 시스템 둘 모두에서 언제든지 볼 수 있지만, EV들이 충전소에 연결되어 있는지 또는 연결 해제되어 있는지 에 따라, EV들의 상태가 그에 따라 업데이트될 수 있다. 일부 실시예에서, 에너지 시장 플랫폼을 통한 에너지 협상, 에너지 제어 시스템을 통한 에너지 모니 터링, 또는 복수의 버스들(예를 들어, 도 4b의 예측 버스, 운영 버스 또는 분석 버스) 중 임의 의 것에서 수행될 수 있는 시뮬레이션들과 같은 태스크들은 (예를 들어, EV들이 충전소에 연결되어 있는지 여부와 독립적으로) 모든 순간에 가능할 수 있다. 예를 들어, EV가 한 영역에서 다른 영역으로 승객을 운 송하는 경우, 에너지 제어 시스템은 그러한 여행에 필요한 에너지를 계산하고 시뮬레이션할 수 있으며, 후 속적으로 충전소를 통해 필요한 에너지를 받기 위해 에너지 시장 플랫폼에서 협상 프로세스를 벌써 시작할 수 있다. 일부 실시예에서, 상기 계산 및 협상은 지속적인 가상 세계 시스템에 통합된 AI 에이전트들에 의 해 자동으로 수행될 수 있다. 도 7은 일 실시예에 따라 네트워크를 통해 에너지 시스템에 연결된 분산형 에너지 관리 시스템 애플 리케이션 사용자 인터페이스의 개략적인 표현을 도시한다. 도 7의 일부 요소들은 도 1 내지 도 6의 요소들 과 유사하거나 동일한 요소들을 참조할 수 있으므로 동일한 참조 번호들을 사용할 수 있다. 또한, 예시된 복수 의 버스들과 관련하여 도 4b의 요소들에 대한 참조도 이루어질 것이다. 분산형 에너지 관리 시스템 애플리케이션 사용자 인터페이스는 분산형 에너지 관리 시스템을 통해 제공되 는 다양한 서비스들에 접근하기 위해 MGO 또는 임의의 타입의 프로슈머와 같은 사용자에게 디스플레이될 수 있 는 사용자 인터페이스를 지칭하며, 에너지 자산들 및 네트워크들을 클라우드 기반 서비스들 및 애플리케이션들 과 연결할 수 있는 모듈식 및 개방형 플랫폼에 대한 액세스를 제공한다. 그러한 서비스들은 예를 들어, (예를 들어, 운영 버스로부터의) VPP 오케스트레이션, 부하 관리, 네트워크 계획, 스케줄링 및 디스패치, 생성 최적화; (예를 들어, 예측 버스로부터의) 구속 예측, 부하 예측 및 생성 예측; (예를 들어, 분석 버스로부터의) 분석; EDNO 호스팅 용량(hosting capacity) 및 상 호 연결 관리, 및 지속적인 가상 세계 시스템 및 에너지 시장 플랫폼에 대한 액세스를 가능하게하는 개별 모듈들을 포함할 수 있다. 또한, 분산형 에너지 관리 시스템 애플리케이션 사용자 인터페이스는 에너지 애플리케이션 스토어를 포함하거나 이에 연결될 수 있으며, 에너지 애플리케이션 스토어는 사 용자가 분산형 에너지 관리 시스템에 새로운 콘텐트, 애플리케이션들 및 서비스들을 부가할 수 있는 개방형 P2P 플랫폼 또는 애플리케이션 라이브러리이다. 따라서 분산형 에너지 관리 시스템 애플리케이션은 고급 인공 지능 및 시뮬레이션 능력을 활용하여 에너지 흐름 을 최적화하도록 구성될 수 있다. 일부 예시적인 애플리케이션에서, 자산 소유자들, 네트워크 오퍼레이터들 및 규제자들은 분산형 에너지 관리 시스템 애플리케이션을 활용하여 장기적인 전략 시나리오 및 잠재적 투자 를 설계하고 평가하여 그들의 경제 효율성을 높일 수 있다. 분산형 에너지 관리 시스템 애플리케이션은 또 한, 에지에서 에너지 관련 디바이스들 각각에 의해 수집된 원시 데이터를 에너지 제어 시스템으로부터의 클라우드 기반 시뮬레이션들과 결합할 때 에너지 시스템의 효율적인 상태 추정을 가능하게 할 수 있다. 도 8a 내지 도 8c는 일 실시예에 따른, 본 개시의 에너지 시장 플랫폼의 네트워크 영향을 도시한다. 도 8a 내지 도 8c에서, MGO들로 표현된 전 세계의 다양한 그리드들 및 오퍼레이터들은 에너지 네트워크들 및 트 랜잭션들의 글로벌 최적화를 위해 에너지뿐만 아니라 데이터, 서비스들 및 시뮬레이션들도 공유한다. 더 많은 MGO들이 네트워크에 합류할수록, 전체 네트워크 영향이 증가하고 따라서 서비스들 및 총 에너지의 증 가로 인해 MGO들에 제공될 수 있는 가치가 이용 가능하여, 새로운 사용자가 합류하기에 더 매력적인 시스 템이 되게 한다. 네트워크 가치(network value)는 다음과 같이 계산될 수 있다: 네트워크 가치 = \"완전히 연결된 네트워크에서의 링크들의 수\" x \"링크당 가치\". 링크들의 수는 다음과 같이 계산될 수 있다: 링크들의 수 = n(n-1)/2, 여기서 n = MGO들의 수 도 8a 내지 도 8c의 예에서, 링크당 가치는, 예를 들어 킬로와트-시(kWh) 단위로 각각의 MGO들에 의 해 제공되는 이용 가능한 에너지의 전체 양이고, 네트워크 가치는 네트워크에 의해 제공되는 에너지의 전체 양 이며, 이는 kWh 단위로 계산될 수 있다. 예들을 설명하기 위해 링크당 가치로 평균(average) 3000 kWh가 사용될 것이다. 도 8a에서, 3 개의 MGO들, MGO #1 내지 #3은 에너지, 데이터, 서비스들 및 시뮬레이션들을 공유하고 있다. 링크들의 수 (3x2)/2 = 3를 사용하면, 네트워크 가치는 3 x 3000 kWh 또는 9000 kWh이다. 도 8b에서, 4 개의 MGO들, MGO #1 내지 #4는 에너지, 데이터, 서비스들 및 시뮬레이션들을 공유하고 있다. 링크들의 수 (4x3)/2 = 6를 사용하면, 네트워크 가치는 6 x 3000 kWh 또는 18000 kWh이다. 도 8c에서, 6 개의 MGO들, MGO #1 내지 #6은 에너지, 데이터, 서비스들 및 시뮬레이션들을 공유하고 있다. 링크들의 수 (6x5)/2 = 15를 사용하면, 네트워크 가치는 15 x 3000 kWh 또는 45000 kWh이다. 도 9는 일 실시예에 따른 에너지 공급망 관리 및 최적화 방법의 블록도를 도시한다. 방법은 도 1 내지 도 8을 참조하여 각각 예시된 시스템들(100-800)과 같은 시스템에 의해 수행된다. 일부 실시예에서, 방법은 적어도 하나의 매크로-그리드에 연결된 복수의 상호 연결된 마이크로-그리드들을 포함 하는 에너지 시스템에 네트워크를 통해 연결된 하나 이상의 클라우드 서버들(예를 들어, 도 1의 클라우드 서버 들)에 의해 구현된다. 하나 이상의 클라우드 서버들은 적어도 하나의 프로세서 및 적어도 하나의 프로세서 에 의해 실행될 때 도 9에 도시된 복수의 단계들을 수행하는 컴퓨터 코드를 저장하는 메모리를 포함한다. 방법은 단계에서 실세계에 따라 매핑되고 대응하는 실세계 요소의 적어도 하나의 가상 복제본을 포함 하는 복수의 가상 객체들을 포함하는 지속적인 가상 세계 시스템을 제공함으로써 시작한다. 가상 복제본들 중 일부는 에너지 시스템으로부터의 대응하는 에너지 관련 디바이스들의 에너지 복제본들을 포함한다. 단계에 서, 방법은 지속적인 가상 세계 시스템에 연결되고 적어도 에너지 제어 시스템 및 에너지 시장 플랫폼을 포함하는 분산형 에너지 관리 시스템을 제공함으로써 계속된다. 단계에서, 방법은 지속적인 가상 세계 시스템에 의해, 에너지 시스템으로부터 지속적인 가상 세계 시 스템의 가상 복제본들을 업데이트하는 데 사용되는 에너지 데이터를 수신한다. 단계에서, 에너지 제어 시 스템은 에너지 시장 플랫폼으로부터 에너지 트랜잭션 데이터와 함께 지속적인 가상 세계 시스템으로부터 업데이 트된 에너지 데이터를 수신하고, 이들은 그 다음에 단계에서 에너지 시스템으로부터 수신된 데이터에 기초하여 에너지 흐름을 디지털 방식으로 통합하고 제어하기 위해, 지속적인 가상 세계 시스템에서 현실의 가상화를 통해, 에너지 제어 시스템과 에너지 시장 플랫폼 간의 기능들을 조정하기 위해 사용된다. 단계에서, 방법 은 에너지 시장 플랫폼에 의하여 에너지 관련 디바이스들을 통한 에너지 행위자들 간의 에너지를 집계 및 교환함으로써 종료된다. 도 10은 도 9의 단계에서 수행되는 에너지 흐름 평가, 제어 및 최적화 동안 수행될 수 있는 추가 단계들을 제공하는 방법을 묘사한다. 방법은 단계에서 분산형 에너지 관리 시스템에 의해 에너지 제어 시스템(예를 들어, 도 1 및 도 4a 내지 도 4b의 에너지 제어 시스템)으로부터 에너지 데이터를 수신함으로써 시작할 수 있다. 일부 실시예에 서, 에너지 데이터는 마이크로-그리드들에 연결된 DER들에서 구현되는 SCADA 시스템으로부터 얻어진다. 일부 실 시예에서, 에너지 데이터는 먼저 지속적인 가상 세계 시스템에서 대응하는 에너지 가상 복제본들을 업데이트하 는 데 사용된다. 방법은 단계에서 도 4b의 에너지 제어 시스템으로부터의 예측 버스와 같은 버스들을 통해 에너지 요구사항 예측을 행함으로써 계속될 수 있고, 이는 단계에서 에너지 균형을 수행하기 위해 사용될 수 있다. 단계에서, 에너지 균형 데이터는 분산형 에너지 관리 시스템에 의해 최적 의 수익을 계산하는 데 사용된다. 단계에서, 탄소 발자국 계산이 수행될 수 있으며, 이것은 DER SCADA 또 는 분산형 에너지 관리 시스템에 의해 계산될 수 있다. 단계에서, DUoSC 및 관련 비용의 계산이 수행될 수 있다. 에너지 균형, 최적의 수익, 탄소 발자국 및 DUoSC를 포함하는 데이터는 단계에서 볼 수 있는 것 처럼 조정된 디스패치 기능으로 전송될 수 있다. 단계에서, 방법은 에너지 공급 및 수요를 평가하고, 탄소 자격증명, 가격 및 디스패치 가능성에 기 초하여 공급자들을 분류하고, 예측되는 원하는 에너지를 조정함으로써 계속된다. 단계에서, 방법은 임의의 부족분 또는 잉여분 에너지가 있는지를 확인함으로써 진행한다. 부족분 또는 잉여분 에너지가 없으면, 방법은 단계에서 보여지는 바와 같이 조정된 예측 에너지를 에너지 거래 커맨드로 전송한다. 부족 분 또는 잉여분 에너지가 있으면, 방법은 단계에서 보여지는 바와 같이 P2P 병렬 경매 프로세스에 부족분/잉여분 요청을 전송한다. 방법은 단계에서 에너지 교환을 수행함으로써 진행하고, 단계에서 보여지는 바와 같이 해당 공급자들에게 에너지 흐름 비용의 정산을 수행함으로써 종료한다. 특정 실시예가 설명되고 첨부된 도면에서 도시되었지만, 그러한 실시예는 단지 예시일 뿐이고 광범위한 개시에 대해 제한하지 않으며, 이 분야의 통상의 기술자들에게는 다양한 다른 수정들이 발생할 수 있으므로 본 개시는 도시되고 설명된 특정 구성 및 배열로 제한되지 않는다는 것을 이해해야한다. 따라서, 설명은 제한적인 것이 아 니라 예시적인 것으로 간주되어야 한다. 배타적 재산 또는 특권이 청구되는 본 발명의 실시예가 다음과 같이 정의된다: 도면 도면1 도면2 도면3 도면4a 도면4b 도면5 도면6 도면7 도면8a 도면8b 도면8c 도면9 도면10"}
{"patent_id": "10-2023-0053930", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 개시의 특정 특징들, 양태들 및 이점들은 다음의 설명 및 첨부 도면들과 관련하여 더 잘 이해될 것이다. 도 1은 일 실시예에 따른 에너지 공급망 관리 및 최적화 시스템의 개략적인 표현을 도시한다. 도 2는 일 실시예에 따른 피어-투-피어 에너지 거래에 사용하기 위한 에너지 거래 분배 네트워크(distribution network)의 개략적인 표현을 도시한다. 도 3은 일 실시예에 따른 본 개시의 적어도 하나의 에너지 시장 플랫폼 및 복수의 에너지 분배 네트워크들 및 오퍼레이터들을 이용하는 에너지 거래 분배 네트워크의 개략적인 표현을 도시한다. 도 4a 내지 도 4b는 일 실시예에 따른 분산형 에너지 관리 시스템의 개략적인 표현을 도시한다.도 5는 일 실시예에 따른 본 개시의 에너지 공급망 관리 및 최적화 시스템의 예시적인 적용을 도시한다. 도 6은 일 실시예에 따른 모빌리티 네트워크에 연결된 분산형 에너지 관리 시스템의 개략적인 표현을 도시한다. 도 7은 일 실시예에 따른 분산형 에너지 관리 시스템 애플리케이션 사용자 인터페이스의 개략적인 표현을 도시 한다. 도 8a 내지 도 8c는 일 실시예에 따른 본 개시의 에너지 시장 플랫폼의 네트워크 영향(network effect)을 도시 한다. 도 9는 일 실시예에 따른 에너지 공급망 관리 및 최적화 방법의 블록도를 도시한다. 도 10은 에너지 흐름 평가, 제어 및 최적화 동안 수행될 수 있는 추가 단계들을 제공하는 블록도를 도시한다."}
