{"patent_id": "10-2019-7035469", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0013671", "출원번호": "10-2019-7035469", "발명의 명칭": "가상 씬의 가상 엔티티 디스크립션 프레임에 기초하여 상이한 밴티지 포인트들로부터 가상 씬", "출원인": "베리존 페이턴트 앤드 라이센싱 인크.", "발명자": "제르바시오 윌리엄 패트릭"}}
{"patent_id": "10-2019-7035469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "방법에 있어서,가상 씬 캡처 시스템에 의해, 가상 씬의 가상 3차원(3D) 공간 내에 포함된 복수의 가상 엔티티들을 나타내는 데이터를 유지하는 단계로서, 복수의 가상 엔티티들은 가상 3D 공간으로 가상 오브젝트 및 복수의 가상 밴티지 포인트들을 포함하고, 복수의 가상 밴티지 포인트들은 제 1 가상 밴티지 포인트 및 제 1 가상 밴티지 포인트와 상이한 제 2 가상 밴티지 포인트를 포함하는, 데이터를 유지하는 단계;가상 씬 캡처 시스템에 의해, 복수의 가상 엔티티들을 나타내는 유지 데이터에 기초하여, 시간 시퀀스에서의 특정한 포인트에서 복수의 가상 엔티티들에서의 적어도 하나의 가상 엔티티의 상태를 나타내는 가상 엔티티 디스크립션 프레임을 생성하는 단계; 및가상 씬 캡처 시스템에 의해, 가상 엔티티 디스크립션 프레임을 복수의 서버-측 3D 렌더링 엔진들로 제공하는단계로서, 복수의 서버-측 3D 렌더링 엔진들은,제 1 가상 밴티지 포인트와 연관되며, 가상 엔티티 디스크립션 프레임에 기초하여, 시간 시퀀스에서의 특정한포인트에서 제 1 가상 밴티지 포인트로부터 가시적인 가상 오브젝트의 표면들의 컬러 및 깊이 데이터를 나타내는 제 1 표면 데이터 프레임을 렌더링하도록 구성된 제 1 3D 렌더링 엔진, 및제 2 가상 밴티지 포인트와 연관되며, 가상 엔티티 디스크립션 프레임에 기초하여, 시간 시퀀스에서의 특정한포인트에서 제 2 가상 밴티지 포인트로부터 가시적인 가상 오브젝트의 표면들의 컬러 및 깊이 데이터를 나타내는 제 2 표면 데이터 프레임을 렌더링하도록 구성된 제 2 3D 렌더링 엔진을 포함한, 가상 엔티티 디스크립션 프레임을 제공하는 단계를 포함하는, 방법."}
{"patent_id": "10-2019-7035469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,가상 씬 캡처 시스템에 의해, 가상 씬 제어 시스템으로부터, 복수의 가상 엔티티들을 나타내는 유지 데이터를수정하기 위한 명령을 수신하는 단계; 및가상 씬 캡처 시스템에 의해, 명령의 수신에 응답하여, 명령에 따라 복수의 가상 엔티티들을 나타내는 유지 데이터를 수정하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2019-7035469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,명령에 따라 복수의 가상 엔티티들을 나타내는 유지 데이터를 수정하는 단계는: 가상 씬의 가상 3D 공간 내에 포함된 복수의 가상 엔티티들에 부가적인 가상 오브젝트를 부가하는 단계;부가적인 가상 오브젝트로 가상 씬의 가상 3D 공간 내에 포함된 복수의 가상 엔티티들 내에 포함된 가상 오브젝트를 대체하는 단계;가상 씬의 가상 3D 공간 내에 포함된 복수의 가상 엔티티들로부터 가상 오브젝트를 제거하는 단계; 및가상 씬의 가상 3D 공간 내에 포함된 복수의 가상 엔티티들에 포함된 가상 오브젝트의 적어도 하나의 속성을 수정하는 단계 중 적어도 하나를 포함하는, 방법."}
{"patent_id": "10-2019-7035469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 2 항에 있어서,명령에 따라 복수의 가상 엔티티들을 나타내는 유지 데이터를 수정하는 단계는:공개특허 10-2020-0013671-3-가상 씬의 가상 3D 공간 내에 포함된 복수의 가상 엔티티들에 부가적인 가상 밴티지 포인트를 부가하는 단계;가상 씬의 가상 3D 공간 내에 포함된 복수의 가상 엔티티들 내에 포함된 복수의 가상 밴티지 포인트들 중 적어도 하나를 수정하는 단계; 및가상 씬의 가상 3D 공간 내에 포함된 복수의 가상 엔티티들로부터 복수의 가상 밴티지 포인트들 중 적어도 하나를 제거하는 단계 중 적어도 하나를 포함하는, 방법."}
{"patent_id": "10-2019-7035469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,복수의 가상 엔티티들을 나타내는 데이터를 유지하는 단계는 가상 씬의 가상 3D 공간 내에 포함된 가상 오브젝트에, 물리-기반 오브젝트 거동 및 인공 지능-기반(AI-기반) 오브젝트 거동 중 적어도 하나를 적용하는 단계를포함하는, 방법."}
{"patent_id": "10-2019-7035469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서,시간 시퀀스에서의 특정한 포인트에서 복수의 가상 엔티티들에서의 적어도 하나의 가상 엔티티를 나타내는 가상엔티티 디스크립션 프레임은, 시간 시퀀스에서의 특정한 포인트에서, 복수의 가상 엔티티들에서의 가상 엔티티들 모두의 상태를 나타내는 키 디스크립션 프레임이고;키 디스크립션 프레임은 시간 시퀀스에서의 다른 키 디스크립션 프레임들에 대하여 시간 시퀀스에서의 키 디스크립션 프레임의 위치를 나타내는 시퀀스 번호와 연관되는, 방법."}
{"patent_id": "10-2019-7035469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서,시간 시퀀스에서의 특정한 포인트에서 복수의 가상 엔티티들에서의 적어도 하나의 가상 엔티티의 상태를 나타내는 가상 엔티티 디스크립션 프레임은, 시간 시퀀스에서의 이전 포인트에서, 복수의 가상 엔티티들에서의 가상엔티티들 모두의 상태를 나타내는 이전 키 디스크립션 프레임이 생성된 이래 변해온 복수의 가상 엔티티들에서의 단지 이들 가상 엔티티들의 상태만을, 시간 시퀀스에서의 특정한 포인트에서, 나타낸 업데이트 디스크립션프레임이고;업데이트 디스크립션 프레임은 이전 키 디스크립션 프레임에 대하여 및 시간 시퀀스에서의 다른 업데이트 디스크립션 프레임들에 대하여 시간 시퀀스에서의 업데이트 디스크립션 프레임의 위치를 나타내는 시퀀스 번호와 연관되는, 방법."}
{"patent_id": "10-2019-7035469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1 항에 있어서,복수의 가상 엔티티들을 나타내는 유지 데이터는 가상 씬 캡처 시스템과 연관된 자산 저장 시스템에 저장된 가상 오브젝트를 나타내는 컬러 및 깊이 데이터로의 링크를 포함하고;생성되고 복수의 서버-측 3D 렌더링 엔진들로 제공된 가상 엔티티 디스크립션 프레임은 자산 저장 시스템에 저장된 가상 오브젝트를 나타내는 컬러 및 깊이 데이터로의 링크를 포함하고;제 1 및 제 2 3D 렌더링 엔진들은 동작들을 수행함으로써, 각각 제 1 및 제 2 표면 데이터 프레임들을 렌더링하도록 구성되는 것으로서, 동작들은:가상 씬 캡처 시스템으로부터 가상 엔티티 디스크립션 프레임을 수신하는 것, 및가상 엔티티 디스크립션 프레임 내에 포함된 링크를 사용하여 자산 저장 시스템으로부터, 자산 저장 시스템에저장된 가상 오브젝트를 나타내는 컬러 및 깊이 데이터를 액세스하는 것을 포함하는, 방법."}
{"patent_id": "10-2019-7035469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1 항에 있어서,공개특허 10-2020-0013671-4-제 1 표면 데이터 프레임은 시간 시퀀스 동안 제 1 가상 밴티지 포인트로부터 가시적인 가상 오브젝트의 표면들의 컬러 및 깊이 데이터를 나타내는 표면 데이터 프레임들의 제 1 시퀀스 내에 포함되고;제 2 표면 데이터 프레임은 시간 시퀀스 동안 제 2 가상 밴티지 포인트로부터 가시적인 가상 오브젝트의 표면들의 컬러 및 깊이 데이터를 나타내는 표면 데이터 프레임들의 제 2 시퀀스 내에 포함되고;방법은:복수의 서버-측 3D 렌더링 엔진들에 통신 가능하게 결합된 비디오 데이터 패키징 시스템에 의해 및 표면 데이터프레임들의 제 1 및 제 2 시퀀스들에 기초하여, 복수의 가상 밴티지 포인트들에서의 가상 밴티지 포인트들의 각각에 대한 컬러 비디오 데이터 스트림 및 깊이 비디오 데이터 스트림을 포함하는 수송 스트림을 생성하는 단계,및비디오 데이터 패키징 시스템에 의해, 사용자와 연관된 클라이언트-측 미디어 플레이 디바이스로 스트리밍을 위한 수송 스트림을 제공하는 단계로서, 클라이언트-측 미디어 플레이어 디바이스는, 수송 스트림 내에 포함된 가상 밴티지 포인트들의 각각에 대한 컬러 비디오 데이터 스트림 및 깊이 비디오 데이터 스트림에 기초하여, 사용자에 의해 선택되고 가상 3D 공간 내에서의 임의적 가상 위치에 대응하는 동적으로 선택 가능한 가상 밴티지 포인트로부터 사용자에 의해 경험될 가상 씬의 가상 3D 공간의 3D 표현을 생성하도록 구성되는, 수송 스트림을 제공하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2019-7035469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 1 항에 있어서,적어도 하나의 비-일시적 컴퓨터-판독 가능한 매체상에 컴퓨터-실행 가능한 지시들로서 구체화된, 방법."}
{"patent_id": "10-2019-7035469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "가상 씬 캡처 시스템에 있어서, 가상 오브젝트를 나타내는 컬러 및 깊이 데이터를 저장한 자산 저장 시스템;각각이 자산 저장 시스템에 통신 가능하게 결합된 제 1 3D 렌더링 엔진 및 제 2 3D 렌더링 엔진들을 포함한 복수의 서버-측 3차원(3D) 렌더링 엔진들; 및자산 저장 시스템 및 제 1 및 제 2 3D 렌더링 엔진들에 통신 가능하게 결합된 가상 엔티티 상태 추적 시스템으로서, 가상 엔티티 상태 추적 시스템은:가상 씬의 가상 3D 공간 내에 포함된 가상 오브젝트 및 가상 3D 공간으로의 복수의 가상 밴티지 포인트들을 나타내는 데이터를 유지하는 것으로서, 복수의 가상 밴티지 포인트들은 제 1 가상 밴티지 포인트 및 제 1 가상 밴티지 포인트와 상이한 제 2 가상 밴티지 포인트를 포함하고, 유지 데이터는 자산 저장 시스템에 저장된 가상 오브젝트를 나타내는 컬러 및 깊이 데이터로의 링크를 포함한 가상 오브젝트를 나타내는 것인, 데이터를유지하고,복수의 가상 엔티티들을 나타내는 유지 데이터에 기초하여, 시간 시퀀스에서의 특정한 포인트에서 복수의 가상엔티티들에서의 적어도 하나의 가상 엔티티의 상태를 나타내는 가상 엔티티 디스크립션 프레임을 생성하고,가상 엔티티 디스크립션 프레임을 제 1 및 제 2 3D 렌더링 엔진들을 포함한 복수의 서버-측 3D 렌더링 엔진들로제공하도록 구성된, 가상 엔티티 상태 추적 시스템을 포함하고,제 1 3D 렌더링 엔진은 제 1 가상 밴티지 포인트와 연관되며 가상 엔티티 디스크립션 프레임 및 링크에 의해 자산 저장 시스템으로부터 액세스된 가상 오브젝트를 나타내는 컬러 및 깊이 데이터에 기초하여, 시간 시퀀스에서의 특정한 포인트에서 제 1 가상 밴티지 포인트로부터 가시적인 가상 오브젝트의 표면들의 컬러 및 깊이 데이터를 나타내는 제 1 표면 데이터 프레임을 렌더링하도록 구성되고;제 2 3D 렌더링 엔진은 제 2 가상 밴티지 포인트와 연관되며, 가상 엔티티 디스크립션 프레임 및 링크에 의해자산 저장 시스템으로부터 액세스된 가상 오브젝트를 나타내는 컬러 및 깊이 데이터에 기초하여, 시간 시퀀스에서의 특정한 포인트에서 제 2 가상 밴티지 포인트로부터 가시적인 가상 오브젝트의 표면들의 컬러 및 깊이 데이터를 나타내는 제 2 표면 데이터 프레임을 렌더링하도록 구성되는, 가상 씬 캡처 시스템.공개특허 10-2020-0013671-5-청구항 12 가상 씬 캡처 시스템에 있어서,적어도 하나의 물리적 컴퓨팅 디바이스로서,가상 씬의 가상 3차원(3D) 공간 내에 포함된 복수의 가상 엔티티들을 나타내는 데이터를 유지하는 것으로서, 복수의 가상 엔티티들은 가상 오브젝트 및 가상 3D 공간으로의 복수의 가상 밴티지 포인트들을 포함하고, 복수의가상 밴티지 포인트들은 제 1 가상 밴티지 포인트 및 제 1 가상 밴티지 포인트와 상이한 제 2 가상 밴티지 포인트를 포함하는, 데이터를 유지하고;복수의 가상 엔티티들을 나타내는 유지 데이터에 기초하여, 시간 시퀀스에서의 특정한 포인트에서 복수의 가상엔티티들에서의 적어도 하나의 가상 엔티티의 상태를 나타내는 가상 엔티티 디스크립션 프레임을 생성하고;가상 엔티티 디스크립션 프레임을 복수의 서버-측 3D 렌더링 엔진들로 제공하는 것으로서, 복수의 서버-측 3D렌더링 엔진들은: 제 1 가상 밴티지 포인트와 연관되며, 가상 엔티티 디스크립션 프레임에 기초하여, 시간 시퀀스에서의 특정한포인트에서 제 1 가상 밴티지 포인트로부터 가시적인 가상 오브젝트의 표면들의 컬러 및 깊이 데이터를 나타내는 제 1 표면 데이터 프레임을 렌더링하도록 구성된 제 1 3D 렌더링 엔진, 및 제 2 가상 밴티지 포인트와 연관되며, 가상 엔티티 디스크립션 프레임에 기초하여, 시간 시퀀스에서의 특정한포인트에서 제 2 가상 밴티지 포인트로부터 가시적인 가상 오브젝트의 표면들의 컬러 및 깊이 데이터를 나타내는 제 2 표면 데이터 프레임을 렌더링하도록 구성된 제 2 3D 렌더링 엔진을 포함한, 가상 엔티티 디스크립션 프레임을 제공하는, 적어도 하나의 물리적 컴퓨팅 디바이스를 포함하는, 가상 씬 캡처 시스템."}
{"patent_id": "10-2019-7035469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 12 항에 있어서,적어도 하나의 물리적 컴퓨팅 디바이스는 또한:가상 씬 제어 시스템으로부터, 복수의 가상 엔티티들을 나타내는 유지 데이터를 수정하기 위한 명령을수신하고;명령의 수신에 응답하여, 명령에 따라 복수의 가상 엔티티들을 나타내는 유지 데이터를 수정하는, 가상 씬 캡처시스템."}
{"patent_id": "10-2019-7035469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13 항에 있어서,명령에 따라 복수의 가상 엔티티들을 나타내는 유지 데이터의 수정은:가상 씬의 가상 3D 공간 내에 포함된 복수의 가상 엔티티들에 부가적인 가상 오브젝트를 부가하는 것;부가적인 가상 오브젝트로 가상 씬의 가상 3D 공간 내에 포함된 복수의 가상 엔티티들 내에 포함된 가상 오브젝트를 대체하는 것;가상 씬의 가상 3D 공간 내에 포함된 복수의 가상 엔티티들로부터 가상 오브젝트를 제거하는 것; 및가상 씬의 가상 3D 공간 내에 포함된 복수의 가상 엔티티들에 포함된 가상 오브젝트의 적어도 하나의 속성을 수정하는 것 중 적어도 하나에 의해 수행되는, 가상 씬 캡처 시스템."}
{"patent_id": "10-2019-7035469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 13 항에 있어서,명령에 따른 복수의 가상 엔티티들을 나타내는 유지 데이터의 수정은:가상 씬의 가상 3D 공간 내에 포함된 복수의 가상 엔티티들에 부가적인 가상 밴티지 포인트를 부가하는 것;가상 씬의 가상 3D 공간 내에 포함된 복수의 가상 엔티티들 내에 포함된 복수의 가상 밴티지 포인트들 중 적어공개특허 10-2020-0013671-6-도 하나를 수정하는 것; 및가상 씬의 가상 3D 공간 내에 포함된 복수의 가상 엔티티들로부터 복수의 가상 밴티지 포인트들 중 적어도 하나를 제거하는 것 중 적어도 하나에 의해 수행되는, 가상 씬 캡처 시스템."}
{"patent_id": "10-2019-7035469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 12 항에 있어서,적어도 하나의 물리적 컴퓨팅 디바이스는, 가상 씬의 가상 3D 공간 내에 포함된 가상 오브젝트로, 물리-기반 오브젝트 거동 및 인공 지능-기반(AI-기반) 오브젝트 거동 중 적어도 하나를 적용함으로써 복수의 가상 엔티티들을 나타내는 데이터를 유지하는, 가상 씬 캡처 시스템."}
{"patent_id": "10-2019-7035469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 12 항에 있어서,시간 시퀀스에서의 특정한 포인트에서 복수의 가상 엔티티들에서의 적어도 하나의 가상 엔티티의 상태를 나타내는 가상 엔티티 디스크립션 프레임은, 시간 시퀀스에서의 특정한 포인트에서, 복수의 가상 엔티티들에서의 가상엔티티들 모두의 상태를 나타내는 키 디스크립션 프레임이고;키 디스크립션 프레임은 시간 시퀀스에서의 다른 키 디스크립션 프레임들에 대하여 시간 시퀀스에서의 키 디스크립션 프레임의 위치를 나타내는 시퀀스 번호와 연관되는, 가상 씬 캡처 시스템."}
{"patent_id": "10-2019-7035469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 12 항에 있어서,시간 시퀀스에서의 특정한 포인트에서 복수의 가상 엔티티들에서의 적어도 하나의 가상 엔티티의 상태를 나타내는 가상 엔티티 디스크립션 프레임은 시간 시퀀스에서의 이전 포인트에서, 복수의 가상 엔티티들에서의 가상 엔티티들 모두의 상태를 나타내는, 이전 키 디스크립션 프레임이 생성된 이래 변해온 복수의 가상 엔티티들에서의단지 이들 가상 엔티티들의 상태만을, 시간 시퀀스에서의 특정한 포인트에서 나타낸 업데이트 디스크립션 프레임이고;업데이트 디스크립션 프레임은 이전 키 디스크립션 프레임에 대하여 및 시간 시퀀스에서의 다른 업데이트 디스크립션 프레임들에 대하여 시간 시퀀스에서의 업데이트 디스크립션 프레임의 위치를 나타내는 시퀀스 번호와 연관되는, 가상 씬 캡처 시스템."}
{"patent_id": "10-2019-7035469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 12 항에 있어서,복수의 가상 엔티티들을 나타내는 유지 데이터는 가상 씬 캡처 시스템과 연관된 자산 저장 시스템에 저장된 가상 오브젝트를 나타내는 컬러 및 깊이 데이터로의 링크를 포함하고;생성되고 복수의 서버-측 3D 렌더링 엔진들로 제공된 가상 엔티티 디스크립션 프레임은 자산 저장 시스템에 저장된 가상 오브젝트를 나타내는 컬러 및 깊이 데이터로의 링크를 포함하고;제 1 및 제 2 3D 렌더링 엔진들은 동작들을 수행함으로써, 각각 제 1 및 제 2 표면 데이터 프레임들을 렌더링하도록 구성되고, 동작들은:가상 씬 캡처 시스템으로부터 가상 엔티티 디스크립션 프레임을 수신하는 것, 및자산 저장 시스템으로부터, 가상 엔티티 디스크립션 프레임 내에 포함된 링크를 사용하여, 자산 저장 시스템에저장된 가상 오브젝트를 나타내는 컬러 및 깊이 데이터에 액세스하는 것을 포함하는, 가상 씬 캡처 시스템."}
{"patent_id": "10-2019-7035469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 12 항에 있어서,제 1 표면 데이터 프레임은 시간 시퀀스 동안 제 1 가상 밴티지 포인트로부터 가시적인 가상 오브젝트의 표면들의 컬러 및 깊이 데이터를 나타내는 표면 데이터 프레임들의 제 1 시퀀스 내에 포함되고;공개특허 10-2020-0013671-7-제 2 표면 데이터 프레임은 시간 시퀀스 동안 제 2 가상 밴티지 포인트로부터 가시적인 가상 오브젝트의 표면들의 컬러 및 깊이 데이터를 나타내는 표면 데이터 프레임들의 제 2 시퀀스 내에 포함되고;복수의 서버 측 3D 렌더링 엔진들은 비디오 데이터 패키징 시스템에 통신 가능하게 결합되고, 비디오 데이터 패키징 시스템은:표면 데이터 프레임들의 제 1 및 제 2 시퀀스들에 기초하여, 복수의 가상 밴티지 포인트들에서의 가상 밴티지포인트들의 각각에 대한 컬러 비디오 데이터 스트림 및 깊이 비디오 데이터 스트림을 포함하는 수송 스트림을생성하고,사용자와 연관된 클라이언트-측 미디어 플레이 디바이스로 스트리밍을 위한 수송 스트림을 제공하는 것으로서,클라이언트-측 미디어 플레이어 디바이스는, 수송 스트림 내에 포함된 가상 밴티지 포인트들의 각각에 대한 컬러 비디오 데이터 스트림 및 깊이 비디오 데이터 스트림에 기초하여, 사용자에 의해 선택되고 가상 3D 공간 내에서의 임의적 가상 위치에 대응하는 동적으로 선택 가능한 가상 밴티지 포인트로부터 사용자에 의해 경험될 가상 씬의 가상 3D 공간의 3D 표현을 생성하도록 구성되는, 수송 스트림을 제공하는, 가상 씬 캡처 시스템."}
{"patent_id": "10-2019-7035469", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "대표적인 가상 씬 캡처 시스템(\"시스템\")은 가상 씬의 가상 3D 공간 내에 포함된 복수의 가상 엔티티들을 나타내 는 데이터를 유지한다. 복수의 가상 엔티티들은 가상 3D 공간으로 가상 오브젝트 및 복수의 가상 밴티지 포인트 들을 포함한다. 유지 데이터에 기초하여, 시스템은 시간 시퀀스에서의 특정한 포인트에서 가상 엔티티들 중 적어 도 하나의 상태를 나타내는 가상 엔티티 디스크립션 프레임을 생성한다. 시스템은 그 후 복수의 가상 밴티지 포 인트들에서의 상이한 밴티지 포인트들에 대응하며 가상 엔티티 디스크립션 프레임에 기초하여, 시간 시퀀스에서 의 특정한 포인트에서 상이한 가상 밴티지 포인트들로부터 가시적인 가상 오브젝트의 표면들의 컬러 및 깊이 데 이터를 나타내는 표면 데이터 프레임들을 렌더링하도록 구성된 복수의 서버-측 3D 렌더링 엔진들로 가상 엔티티 디스크립션 프레임을 제공한다."}
{"patent_id": "10-2019-7035469", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "관련 출원들 본 출원은 2017년 5월 31일에 출원된, 가상 씬의 가상 엔티티 디스크립션 프레임에 기초하여 상이한 밴티지 포 인트들로부터 가상 씬의 프레임들을 렌더링하기 위한 방법들 및 시스템들이라는 제목의, 미국 특허 출원 번호 제15/610,572호에 대한 우선권을 주장하며, 이것은 여기에서 전체적으로 참조로서 통합된다. 본 개시는 가상 씬의 가상 엔티티 디스크립션 프레임에 기초하여 상이한 밴티지 포인트들로부터 가상 씬의 프레 임들을 렌더링하기 위한 방법들 및 시스템들에 관한 것이다."}
{"patent_id": "10-2019-7035469", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "사용자들은 다양한 목적들로 및 다양한 유형들의 애플리케이션들과 관련되어 가상 3차원(\"3D\") 공간들(예컨대, 가상, 실-세계, 또는 혼합 현실 씬들에 기초하여)을 경험할 수 있다. 예를 들어, 사용자들은 엔터테인먼트 목적 들, 교육 목적들, 장거리 통신 목적들, 간접 경험/여행 목적들을 위해, 또는 다양한 다른 목적들 및/또는 애플 리케이션들과 관련되어 가상 3D 공간들을 경험할 수 있다. 가상 현실은 사용자들이 가상 3D 공간들을 경험하는 애플리케이션의 일 예이다. 가상 현실 미디어 콘텐트는 동 시에 몰입형 가상 현실 세계에 존재하고 있는 다양한 것들 중 임의의 것으로 그들의 관심을 향하게 함으로써 사 용자들이 경험할 수 있는 상호 작용적 가상 현실 세계들로 사용자들(즉, 가상 현실 미디어 콘텐트의 뷰어들)을 몰입시키기 위해 사용될 수 있다. 예를 들어, 가상 현실 미디어 콘텐트의 프레젠테이션 동안 언제든, 가상 현실 미디어 콘텐트를 경험한 사용자는 임의의 방향으로 몰입형 가상 현실 세계를 돌아보며, 그 또는 그녀가 실제로 몰입형 가상 현실 세계 내에서 특정한 시점 또는 밴티지 포인트(vantage point)로부터 몰입형 가상 현실 세계에 존재하며 그것을 경험하고 있는 감각을 사용자에게 제공한다."}
{"patent_id": "10-2019-7035469", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "몇몇 예들에서, 사용자들은 가상 3D 공간 내에서 임의의 가상 밴티지 포인트로부터 가상 3D 공간(예컨대, 몰입 형 가상 현실 세계)을 경험할 수 있는 융통성을 요구할 수 있다. 다시 말해서, 사용자는 사용자가 동적으로 고 를 수 있는 가상 3D 공간 내에서의 어디든 임의의 가상 밴티지 포인트들로부터 가상 3D 공간을 경험하기 위해 (예컨대, 가상 3D 공간 내에 제공된 오브젝트들을 보기 위해) 마음대로 가상 3D 공간 내에서의 상이한 위치들로 여기저기 움직이고 싶어할 수 있다. 상이한 위치들로의 이러한 움직임의 자유를 사용자에게 제공하기 위해, 종 래의 미디어 플레이어 디바이스들은 통상적으로 사용자가 가상 3D 공간을 경험하기 전에 가상 3D 공간을 나타내 는 데이터(예컨대, 3D 공간 내에서의 오브젝트들의 3D 모델들 등)를 수신하여 왔다. 예를 들어, 종래의 미디어 플레이어 디바이스는 미디어 플레이어 디바이스의 하드 드라이브와 같은 로컬 저장 설비 상에서 가상 3D 공간과 연관된 데이터(예컨대, 3D 모델들, 텍스처들 등)를 다운로드하고 저장할 수 있거나, 또는 미디어 플레이어 디바이스로 액세스 가능한 로컬 물리 매체(예컨대, 물리 디스크)로부터 가상 3D 공간과 연관된 데이터에 액세스할 수 있다. 불운하게도, 그러나, 더 많은 셋업은 이러한 가상 3D 공간을 경험하기 전에 사용자에 의해 요구될 수 있으며(예컨대, 가상 3D 공간을 나타내는 데이터 콘텐트를 다운로드하고, 설치하고, 메모리로 로딩하는 등과 연 관된 셋업), 사용자 경험 이전에 미디어 플레이어 디바이스에 의해 수신될 많은 데이터에 대한 요건으로 인해 이러한 예들에서 가상 3D 공간이 콘텐트에 대한 라이브 또는 실시간 업데이트들을 반영하는 것은 어려울 수 있 다. 게다가, 가상 3D 공간을 나타내는 데이터 모두가 실시간으로 미디어 플레이어 디바이스로 송신되었을지라도, 가 상 3D 공간 내에 포함된 오브젝트들의 개개의 3D 모델들을 나타내는 데이터는 가상 3D 공간이 가상 3D 공간 내 에서의 임의의 가상 밴티지 포인트로부터 렌더링되도록 허용할 수 있지만, 품질을 희생하지 않고는 더 큰 가상 3D 공간들 또는 보다 많은 오브젝트들을 포함한 가상 3D 공간들을 제공하기 위해 확장 가능하지 않을 수 있다. 예를 들어, 미디어 플레이어 디바이스로 송신되는 데이터가 가상 3D 공간 내에 포함된 각각의 오브젝트에 대해 개별적으로 렌더링 가능한 3D 모델들을 나타낸다면, 예를 들어 5개의 오브젝트들을 가진 가상 3D 공간을 나타내 기 위해 요구된 데이터의 양과 비교하여, 상당한 양의 부가적인 데이터(예컨대, 데이터의 대략 두 배만큼 많 은)가 예를 들어, 10개의 오브젝트들을 가진 가상 3D 공간을 나타내기 위해 요구될 수 있다. 따라서, 5개의 오 브젝트들의 모델들을 포함한 가상 3D 공간을 나타내는 데이터가 실시간으로 미디어 플레이어 디바이스로 송신될 수 있을지라도, 이러한 유형의 송신은 가상 3D 공간 내에서 10개의 오브젝트들 또는 100개의 오브젝트들 또는 그 이상을 유사하게 나타내기 위해 스케일링할 수 없을 것이다."}
{"patent_id": "10-2019-7035469", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "대표적인 가상 씬 캡처 시스템(\"시스템\")은 가상 씬의 가상 3D 공간 내에 포함된 복수의 가상 엔티티들을 나타 내는 데이터를 유지한다. 복수의 가상 엔티티들은 가상 3D 공간으로 가상 오브젝트 및 복수의 가상 밴티지 포인 트들을 포함한다. 유지 데이터에 기초하여, 시스템은 시간 시퀀스에서의 특정한 포인트에서 가상 엔티티들 중 적어도 하나의 상태를 나타내는 가상 엔티티 디스크립션 프레임을 생성한다. 시스템은 그 후 복수의 가상 밴티 지 포인트들에서의 상이한 밴티지 포인트들에 대응하며 가상 엔티티 디스크립션 프레임에 기초하여, 시간 시퀀 스에서의 특정한 포인트에서 상이한 가상 밴티지 포인트들로부터 가시적인 가상 오브젝트의 표면들의 컬러 및 깊이 데이터를 나타내는 표면 데이터 프레임들을 렌더링하도록 구성된 복수의 서버-측 3D 렌더링 엔진들로 가상 엔티티 디스크립션 프레임을 제공한다."}
{"patent_id": "10-2019-7035469", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 시스템들 및 방법들은 가상 3D 공간들을 나타내는 데이터 및 그 안에 포함된 가상 엔티티들이 미디어 플레이어 디바이스의 사용자에 의한 가상 3D 공간의 경험 이전에 미디어 플레이어 디바이스 상에 사전 로딩되거 나 또는 저장될 필요가 없도록 사용자들, 그 전체가, 제공자 시스템으로부터 스트리밍되는 가상 씬의 가상 3D 공간들을 경험하는 것을 가능하게 할 수 있다."}
{"patent_id": "10-2019-7035469", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "가상 씬의 가상 엔티티 디스크립션 프레임에 기초하여 상이한 밴티지 포인트들로부터 가상 씬의 프레임들을 렌 더링하기 위한 방법들 및 시스템들이 여기에서 설명된다. 예를 들어, 가상 씬 캡처 시스템은 가상 씬의 가상 3 차원(\"3D\") 공간 내에 포함된 복수의 가상 엔티티들을 나타내는 데이터를 유지할 수 있다. 복수의 가상 엔티티 들은 가상 3D 공간으로 복수의 가상 밴티지 포인트들(예컨대, 가상 3D 공간 내에 포함된 하나 이상의 가상 오브 젝트들을 보는 가상 위치들, 각도들, 시점들 등)과 함께 하나 이상의 가상 오브젝트들을 포함할 수 있다. 특히, 복수의 가상 밴티지 포인트들은 적어도 제 1 가상 밴티지 포인트 및 제 1 가상 밴티지 포인트와 상이한 제 2 가 상 밴티지 포인트를 포함할 수 있다. 복수의 가상 엔티티들을 나타내는 유지 데이터에 기초하여, 가상 씬 캡처 시스템은 시간 시퀀스에서의 특정한 포인트에서 복수의 가상 엔티티들에서 적어도 하나의 가상 엔티티의 상태를 나타내는 가상 엔티티 디스크립션 프레임을 생성할 수 있다. 예를 들어, 가상 엔티티 디스크립션 프레임은 복수의 가상 엔티티들에 포함된 가상 엔티티들 모두(즉, 가상 오브젝트들 및 가상 밴티지 포인트들)에 대한 각각의 상태 정보를 나타내는 키 디스크 립션 프레임일 수 있거나, 또는 이전 키 디스크립션 프레임이 생성된 이래로 변한 복수의 가상 엔티티들에서 단 지 이들 가상 엔티티들만의 상태 정보를 나타내는 업데이트 디스크립션 프레임일 수 있다. 가상 엔티티 디스크립션 프레임을 생성할 때, 가상 씬 캡처 시스템은 가상 엔티티 디스크립션 프레임에 기초하 여 3D 렌더링 엔진들이 상이한 밴티지 포인트들로부터 가상 씬의 프레임들을 렌더링하는 것을 가능하게 하기 위 해 콘텐트 제공자 시스템과 연관된 복수의 서브-측 3D 렌더링 엔진들로 가상 엔티티 디스크립션 프레임을 제공 할 수 있다. 예를 들면, 가상 씬 캡처 시스템은 제 1 가상 밴티지 포인트와 연관되며 가상 엔티티 디스크립션 프레임에 기초하여, 시간 시퀀스에서의 특정한 포인트에서 제 1 가상 밴티지 포인트로부터 가시적인 가상 오브 젝트의 표면들의 컬러 및 깊이 데이터를 나타내는 제 1 표면 데이터 프레임을 렌더링하도록 구성되는 제 1 3D 렌더링 엔진으로 가상 엔티티 디스크립션 프레임을 제공할 수 있다. 유사하게, 가상 씬 캡처 시스템은 제 2 가 상 밴티지 포인트와 연관되며, 또한 가상 엔티티 디스크립션 프레임에 기초하여, 시간 시퀀스에서의 특정한 포 인트에서 제 2 가상 밴티지 포인트로부터 가시적인 가상 오브젝트의 표면들의 컬러 및 깊이 데이터를 나타내는 제 2 표면 데이터 프레임을 렌더링하도록 구성되는 제 2 3D 렌더링 엔진으로 가상 엔티티 디스크립션 프레임을 제공할 수 있다. 여기에서 설명된 가상 씬의 가상 엔티티 디스크립션 프레임에 기초하여 상이한 밴티지 포인트들로부터 가상 씬 의 프레임들을 렌더링하기 위한 시스템들 및 방법들은 다양한 이점들 및 이익들을 제공할 수 있다. 예를 들어,여기에서 설명된 시스템들 및 방법들은 사용자들이 가상 씬의 가상 3D 공간들을 경험하는 것을 가능하게 할 수 있다. 여기에서 사용된 바와 같이, 가상 씬의 \"가상 3D 공간\"은 사용자가 실세계를 경험할 수 있는 것과 유사한 방식으로 사용자에 의해 경험될 수 있는 환경 또는 세계(예컨대, 몰입형 가상 현실 세계)의 렌더링(예컨대, 전 체적으로 가상화된 렌더링)을 나타낼 수 있다. 예를 들어, 가상 씬을 경험하는 사용자가 3D 공간 내에서 돌아다 니고 가상 공간 내에 포함된 오브젝트들을 보고 및/또는 그 외 그것과 상호 작용할 수 있을 것이다. 몇몇 예들 에서, 가상 3D 공간은 전체적으로 가상화되며(예컨대, 컴퓨터 생성되며) 실-세계 씬이 렌더링될 수 있는 것과 유사한 방식으로 렌더링될 수 있다. 다른 예들에서, 가상 3D 공간은, 적어도 부분적으로, 실-세계 씬으로부터 캡처된 하나 이상의 실-세계 오브젝트들에 기초할 수 있다. 어쨌든, 여기에서 설명된 시스템들 및 방법들은 가상 3D 공간들을 나타내는 데이터 및 그 안에 포함된 가상 엔 티티들이 미디어 플레이어 디바이스의 사용자에 의한 가상 3D 공간의 경험 이전에 미디어 플레이어 디바이스 상 에 사전 로딩되거나 또는 저장될 필요가 없도록 사용자들, 그 전체가, 제공자 시스템으로부터 스트리밍되는 가 상 씬의 가상 3D 공간들을 경험하는 것을 가능하게 할 수 있다. 예를 들어, 가상 씬을 제공하기 위해 미디어 플 레이어 디바이스에 대해 요구된 데이터 모두는 가상 씬 콘텐트를 나타내는 데이터가 사용자로의 가상 씬의 프레 젠테이션 이전에 다운로드되고, 저장되거나, 또는 그 외 액세스될 필요가 없도록(예컨대, 로컬 물리 디스크에 의해) 미디어 플레이어 디바이스로 스트리밍될 수 있다(예컨대, 특정한 구현들에서 실시간으로). 게다가, 여기에서 설명된 가상 씬의 가상 엔티티 디스크립션 프레임에 기초하여 상이한 밴티지 포인트들로부터 가상 씬의 프레임들을 렌더링하기 위한 시스템들 및 방법들은 가상 현실 미디어 콘텐트가 가상 3D 공간 내에서 임의의 가상 위치들 및 동적으로 선택된 가상 밴티지 포인트들로부터 렌더링될 수 있도록 하는 방식으로 가상 씬을 나타내는 가상 현실 미디어 콘텐트를 미디어 플레이어 디바이스들로 제공하는 것을 가능하게 할 수 있다. 구체적으로, 이하에서 보다 상세하게 설명될 바와 같이, 상이한 밴티지 포인트들(예컨대, 가상 밴티지 포인트들)로부터 가상 씬의 프레임들을 렌더링함으로써, 가상 씬 캡처 시스템은 미디어 플레이어 디바이스로 하 여금, 데이터 파이프라인에 포함되며 예를 들어, 비교적 고정된 밴티지 포인트들(예컨대, 가상 밴티지 포인트들)과 연관된 복수의 2-차원(\"2D\") 비디오 스트림들에 기초하여 임의의 및 동적으로 선택 가능한 가상 밴 티지 포인트들로부터 가상 3D 공간을, 3차원들에서 렌더링하도록 허용하기 위해 구성된 프레임들을 데이터 파이 프라인에 포함할 수 있다. 그 결과, 미디어 플레이어 디바이스는 사용자로 하여금, 가상 3D 공간과 연관된 가변 적이고 잠재적으로 제한되지 않은 수의 3D 모델들을 나타내는 3D 모델 데이터에 기초하기보다는, 가상 3D 공간 을 나타내는 데이터를 운반하는 2D 비디오 스트림들에 기초하여 가상 3D 공간 내에서 자유롭게 돌아다니는 것처 럼 가상 3D 공간을 경험하도록 허용할 수 있다. 예를 들어, 가상 3D 공간 내에 포함된 모든 가상 오브젝트의 3D 모델들을 나타내는 데이터를 제공하기보다는, 데이터 파이프라인은 가상 밴티지 포인트들로부터 가상 3D 공간 내에서의 가상 오브젝트들 모두를 나타내는 2D 비디오 데이터(예컨대, 컬러 데이터 및 깊이 데이터)를 제공할 수 있다. 이와 같이, 제한되지 않은 수의 오브젝트들은 미디어 플레이어 디바이스가 예를 들어, 단지 하나 또는 두 개의 오브젝트들을 가진 가상 씬을 렌더링하기 위해 요구되기보다는 부가적인 데이터를 수신하거나 또는 부 가적인 렌더링 작업을 수행할 필요 없이 가상 씬의 렌더링에서 나타내어질 수 있다. 부가적으로, 미디어 플레이어 디바이스들에 이미 저장된 사전 로딩된 콘텐트에 의존하지 않고 가상 씬을 나타내 는 데이터 모두를 유지하고 이를 미디어 플레이어 디바이스들에 제공함으로써, 여기에서 설명된 시스템 및 방법 들은 가상 3D 공간들이, 미디어 플레이어 디바이스 상에 저장된 사전 로딩된 데이터를 수정할 필요 없이 제공자 에 의해 생성되거나 또는 수정되도록 허용할 수 있다(예컨대, 실시간으로). 그 결과, 가상 씬을 생성할 책임이 있는 콘텐트 생성자들 또는 가상 씬을 경험하는 하나 이상의 사용자들은 가상 씬의 양상들을 수정하기 위해(예 컨대, 가상 오브젝트들을 수정하고, 대체하거나, 또는 제거하기 위해) 가상 씬 캡처 시스템으로 명령들을 제공 할 수 있으며, 이들 수정들은 가상 씬이 실시간 또는 거의 실시간으로 수정되도록 사용자들에게 스트리밍되는 데이터에 즉시 반영될 수 있다. 유사하게, 계산적으로 비쌀 수 있는(예컨대, 특정한 미디어 플레이어 디바이스들에 대해 엄두를 못낼 만큼 비싼) 다양한 동작들이, 가상 현실 미디어 제공자에 의해 동작될 수 있으며, 예를 들어, 사용자들과 연관된 미 디어 플레이어 디바이스들보다 훨씬 더 강력한 컴퓨팅 리소스들(예컨대, 대형 서버들 등)과 연관될 수 있는, 가 상 씬 캡처 시스템과 연관된 강력한 컴퓨팅 리소스들에 의해 수행될 수 있다. 예를 들어, 가상 씬 캡처 시스템 은 가상 씬 내에서의 오브젝트들에 대하여 계산적으로 비싼 물리 동작들, 오브젝트들에 대한 인공 지능 동작들 등을 수행할 수 있다. 이들 동작들은 제공자 레벨에서 수행되기 때문에, 사용자들에 의해 동작된 미디어 플레이 어 디바이스들은 특히 강력한 컴퓨팅 리소스들과 연관될 필요가 없을 수 있으며, 이것은 사용자 디바이스 리소 스들을 보존하고, 사용자들에게 편리함(예컨대, 휴대성, 냉각 등에 대하여)을 제공하며, 다양한 유형들의 미디어 플레이어 디바이스들(예컨대, 다양한 형태 인자들, 다양한 가격 포인트들 등을 가진)이 사용자들에게 가상 씬의 경험을 제공할 수 있게 한다. 여기에서 설명된 특정한 예들은 임의의 적절한 수들의 물품들을 가질 수 있는 복수들로부터 몇 개의 특정 물품 들을 참조할 수 있지만, 몇 개의 특정 물품들에 따라 설명된 동일한 원리들은, 복수들에서의 하나 이상의 다른 물품들, 각각의 개별적인 복수의 물품들에서 물품들의 최대 모두까지 적용할 수 있다는 것이 이해될 것이다. 예 를 들어, 설명의 편리함 및 명료함으로 인해, 몇 개의 물품들은 \"제 1\", \"제 2\" 등과 같은 서수 형용사들에 의 해 지정될 수 있다(예컨대, 제 1 및 제 2 가상 밴티지 포인트들, 제 1 및 제 2 3D 렌더링 엔진들, 제 1 및 제 2 표면 데이터 프레임들 등). 그러나, 일반적으로 도면들에서 예시될 바와 같이, 여기에서 설명된 원리들은, 예를 들어, 제 1 및 제 2 물품들과 대조적으로, 복수의 물품들에 포함된 물품들 중 다수 또는 모두에 적용할 수 있다. 따라서, 이하에서 설명될 바와 같이, 특정한 구현들은 각각이 많은 가상 밴티지 포인트들 중 하나로부터 의 뷰 등과 연관되는 많은 표면 데이터 프레임들을 렌더링하는 많은(즉, 둘 이상의) 3D 렌더링 엔진들을 포함할 수 있다. 다양한 실시예들이 이제 도면들을 참조하여 보다 상세하게 설명될 것이다. 개시된 방법들 및 시스템들은 상기 언급된 이익들 및/또는 여기에서 분명해질 다양한 부가적인 및/또는 대안적인 이익들 중 하나 이상을 제공할 수 있다. 도 1은 가상 씬의 가상 엔티티 디스크립션 프레임에 기초하여 상이한 밴티지 포인트들로부터 가상 씬의 프레임 들을 렌더링하기 위한 대표적인 가상 씬 캡처 시스템(\"시스템\")을 예시한다. 도시된 바와 같이, 시스 템은, 제한 없이, 서로 선택적으로 및 통신 가능하게 결합된 가상 엔티티 상태 추적 설비, 가상 엔티 티 디스크립션 프레임 설비, 및 저장 설비를 포함할 수 있다. 설비들(102 내지 106)은 도 1에서 별개 의 설비들인 것으로 도시되지만, 설비들(102 내지 106)은 단일 설비로와 같은, 보다 적은 설비들로 조합되거나, 또는 특정한 구현을 제공할 수 있는 바와 같이 더 많은 설비들로 나뉠 수 있다는 것이 인식될 것이다. 몇몇 예 들에서, 설비들(102 내지 106)의 각각은 특정한 구현을 제공할 수 있는 바와 같이 다수의 디바이스들 및/또는 다수의 위치들 사이에서 분포될 수 있다. 설비들(102 내지 106)의 각각은 이제 보다 상세하게 설명될 것이다. 가상 엔티티 상태 추적 설비는 가상 씬의 가상 엔티티 디스크립션 프레임에 기초하여 상이한 밴티지 포인 트들로부터 가상 씬의 프레임들을 렌더링하는 것과 연관된 다양한 동작들을 수행하는 하나 이상의 물리적 컴퓨 팅 디바이스들(예컨대, 프로세서들, 메모리들, 통신 인터페이스들, 프로세서들에 의한 실행을 위해 메모리에 저 장된 지시들 등과 같은 하드웨어 및/또는 소프트웨어 구성요소들)을 포함할 수 있다. 예를 들어, 하나 이상의 물리적 컴퓨팅 디바이스들을 사용하면, 가상 엔티티 상태 추적 설비는 가상 씬의 가상 3D 공간 내에 포함 된 복수의 가상 엔티티들을 나타내는 데이터를 유지할 수 있다. 가상 엔티티 상태 추적 설비는 임의의 적 절한 방식으로 데이터를 유지할 수 있다. 예를 들어, 가상 엔티티 상태 추적 설비는 가상 씬의 복수의 가 상 엔티티들을 나타내는 데이터를 수신하고, 추적하고, 생성하고, 분석하고, 조직하며, 및/또는 그 외 프로세싱 할 수 있다. 이하에서 보다 상세하게 설명될 바와 같이, 가상 엔티티 상태 추적 설비는 또한 유지 데이터 를 수정하기 위해(예컨대, 가상 엔티티들을 부가하거나, 제거하거나, 대체하거나, 이동하거나, 회전하거나, 확 대하거나, 또는 그 외 수정함으로써와 같이 가상 엔티티들 중 하나 이상을 수정하기 위해) 명령들을 수신할 수 있으며 유지되고 있는 데이터를 수정함으로써 명령들을 구현할 수 있다. 가상 엔티티 상태 추적 설비는 또 한 저장 설비에 각각의 가상 엔티티를 나타내는 데이터를 저장하기 위해 저장 설비와 상호 연동함으 로써 데이터를 유지할 수 있다. 여기에서 사용된 바와 같이, \"가상 엔티티\"는 가상 씬 및/또는 가상 3D 공간과 연관될 수 있는 임의의 가상 아 이템을 나타낼 수 있다. 예를 들어, 가상 엔티티 상태 추적 설비가 데이터를 유지하는 가상 엔티티들 중에 서, 가상 씬의 가상 3D 공간은 하나 이상의 가상 오브젝트들, 가상 3D 공간으로의 복수의 가상 밴티지 포인트들 (예컨대, 다양한 상이한 관점들로부터 가상 3D 공간을 캡처하기 위해 가상 3D 공간에 대하여 특정한 방식들로 배치되고 각진 가상 캡처 디바이스들)과 같은 가상 엔티티들, 및/또는 특정한 구현을 제공할 수 있는 바와 같은 임의의 다른 가상 엔티티들을 포함할 수 있다. 특히, 이하에서 설명되고 예시될 바와 같이, 하나의 대표적인 가 상 3D 공간은 제 1 가상 밴티지 포인트 및 상기 제 1 가상 밴티지 포인트와 상이한 제 2 가상 밴티지 포인트를 포함한 복수의 가상 밴티지 포인트들에 의해 둘러싸인 가상 오브젝트를 포함할 수 있다. 가상 엔티티 디스크립션 프레임 설비는 제 1 및 제 2 가상 밴티지 포인트들을 포함한 복수의 밴티지 포인 트들로부터 가상 씬의 프레임들을 렌더링하기 위해 사용될 가상 엔티티 디스크립션 프레임들을 생성하고 및/또 는 제공하는 것과 연관된 다양한 동작들을 수행하는 하나 이상의 물리적 컴퓨팅 구성요소들(예컨대, 가상 엔티티 상태 추적 설비의 것들로부터 분리되거나 또는 가상 엔티티 상태 추적 설비와 공유된 하드웨어 및 /또는 소프트웨어 구성요소들)을 포함할 수 있다. 예를 들어, 하나 이상의 물리적 컴퓨팅 디바이스들을 사용하 면, 가상 엔티티 디스크립션 프레임 설비는 시간 시퀀스에서의 특정한 포인트(예컨대, 실시간으로 특정한 순간, 실시간에 관련되지 않은 가상 타임라인 상에서의 순간을 나타내는 특정한 포인트 등)에서 복수의 가상 엔 티티들에서 적어도 하나의 가상 엔티티(예컨대, 및 몇몇 예들에서, 가상 엔티티들 모두)의 상태를 나타내는 가 상 엔티티 디스크립션 프레임을 생성할 수 있다(예컨대, 가상 엔티티 상태 추적 설비에 의해 유지된 복수 의 가상 엔티티들을 나타내는 데이터에 기초하여). 여기에서 사용된 바와 같이, \"가상 엔티티 디스크립션 프레임\"은 가상 씬의 가상 3D 공간에 포함된 하나 이상의 가상 엔티티들의 상태를 기술하는 데이터세트(예컨대, 자바 스크립트 오브젝트 표기(Java Script Object Notation; \"JSON\") 등과 같은 언어로 표현된 오브젝트 디스크립션 데이터를 포함한)를 나타낼 수 있다. 예를 들 어, 가상 엔티티 디스크립션 프레임은 시간 시퀀스에서의 특정한 포인트에서 가상 3D 공간에 포함된 여러 개의 가상 엔티티들의 각각을 기술하는 데이터를 포함할 수 있다. 예를 들면, 가상 엔티티 디스크립션 프레임은 각각 의 가상 엔티티가 가상 3D 공간과 연관된 전역적 좌표 시스템에 대하여 배치되는 위치, 각각의 가상 엔티티가 배치되는 각도들 및 배향들, 각각의 가상 엔티티의 상대적 크기들, 각각의 가상 엔티티에 대한 하나 이상의 움 직임 벡터들, 각각의 가상 엔티티의 다양한 표면들의 컬러들 및/또는 텍스처들, 및/또는 특정한 구현에서 제공 할 수 있는 바와 같이 시간 시퀀스에서의 특정한 포인트에서 특정한 가상 엔티티들을 설명하기 위해 사용될 수 있는 임의의 다른 상태 데이터를 나타내는 상태 데이터를 포함할 수 있다. 대표적인 가상 엔티티 디스크립션 프 레임들은 이하에서 보다 상세하게 설명될 것이다. 일단 가상 엔티티 디스크립션 프레임 설비가 가상 엔티티 디스크립션 프레임을 생성하였다면, 가상 엔티티 디스크립션 프레임 설비는 콘텐트 제공자 시스템과 연관된 복수의 서버-측 3D 렌더링 엔진들로 가상 엔티 티 디스크립션 프레임을 제공할 수 있다. 여기에서 사용된 바와 같이, \"서버-측\"은 콘텐트 제공자 시스템이 콘 텐트(예컨대, 가상 현실 미디어 콘텐트)를 최종 사용자에 의해 사용된 클라이언트 디바이스로 제공하는 트랜잭 션과 같은 서버-클라이언트 트랜잭션의 서버 측(예컨대, 제공자 측)을 나타낼 수 있다. 예를 들어, 이하에서 보 다 상세하게 설명될 바와 같이, 가상 현실 미디어 콘텐트 제공자 시스템은 사용자와 연관된 미디어 플레이어 디 바이스로 가상 현실 미디어 콘텐트를 제공할 수 있다. 이와 같이, 서버-측 시스템들 및 구성요소들은 데이터(예 컨대, 가상 현실 미디어 콘텐트)를 미디어 플레이어 디바이스로 제공하기 위해(예컨대, 네트워크에 의해) 콘텐 트 제공자 시스템과 연관되는(예컨대, 콘텐트 제공자 시스템 내에 포함되고, 그것에 의해 구현되고, 그것과 상 호 연동하는 등) 이들 시스템들 및 구성요소들을 나타낼 수 있다. 반대로, \"클라이언트-측\" 디바이스들은 네트 워크의 다른 측 상에서 사용자에 의해 사용된 클라이언트 디바이스(예컨대, 미디어 플레이어 디바이스)와 연관 될 수 있으며, 콘텐트 제공자 시스템(예컨대, 네트워크의 사용자 측 상에서 사용자에 의해 동작된 미디어 플레 이어 디바이스 및/또는 다른 컴퓨터 구성요소들)으로부터의 데이터를 수신하는 것으로 클라이언트 디바이스를 가능하게 하는 디바이스를 포함할 수 있다. 따라서, 3D 렌더링 엔진들은 시스템의 하드웨어 및/또는 소프트웨어 리소스들로과 통합되거나 또는 그로부 터 분리되며 그것에 통신 가능하게 결합될 수 있는 하드웨어 및/또는 소프트웨어 리소스들에 의해 네트워크(즉, 시스템 및/또는 콘텐트 제공자 시스템의 다른 요소들과 연관된)의 서버 측 상에서 구현될 수 있다. 3D 렌 더링 엔진들은, 가상 엔티티 디스크립션 프레임에 기초하여, 특정한 가상 밴티지 포인트들과 연관된 각각의 표 면 데이터 프레임들을 렌더링하도록 구성될 수 있다. 예를 들어, 가상 엔티티 디스크립션 프레임 설비는 가상 엔티티 디스크립션 프레임을, 제 1 가상 밴티지 포인트와 연관되며 시간 시퀀스에서의 특정한 포인트에서 제 1 가상 밴티지 포인트로부터 가시적인 가상 오브젝트의 표면들의 컬러 및 깊이 데이터를 나타내는 제 1 표면 데이터 프레임을 렌더링하도록 구성된(예컨대, 가상 엔티티 디스크립션 프레임에 기초하여) 제 1 3D 렌더링 엔 진으로 제공할 수 있다. 부가적으로, 가상 엔티티 디스크립션 프레임 설비는 동일한 가상 엔티티 디스크립 션 프레임을, 제 2 가상 밴티지 포인트와 연관되며 시간 시퀀스에서의 특정한 포인트에서 제 2 가상 밴티지 포 인트로부터 가시적인 가상 오브젝트의 표면들의 컬러 및 깊이 데이터를 나타내는 제 2 표면 데이터 프레임을 렌 더링하도록 구성된(예컨대, 또한 가상 엔티티 디스크립션 프레임에 기초하여) 제 2 3D 렌더링 엔진으로 제공할 수 있다. 여기에서 사용된 바와 같이, \"표면 데이터 프레임\"은 특정한 밴티지 포인트로부터의 가상 씬 내에서 및 가상 씬 과 연관된 시간 시퀀스에서의 특정한 포인트에서 가시적인 오브젝트들(예컨대, 가상 오브젝트들)의 표면들과 연 관된 다양한 유형들의 데이터를 나타내는 데이터세트를 나타낼 수 있다. 예를 들어, 표면 데이터 프레임은 가상 씬에 대하여 특정한 밴티지 포인트로부터 보여지는 바와 같이 오브젝트들을 나타내는 컬러 데이터(즉, 이미지데이터)뿐만 아니라 깊이 데이터를 포함할 수 있다. 이와 같이, 복수의 관련된 표면 데이터 프레임들은 가상 씬 이 특정한 밴티지 포인트로부터 보여지거나 또는 경험될 바와 같이 가상 씬의 비디오-형 표현(컬러뿐만 아니라 또한 깊이 데이터를 나타내는)을 생성하기 위해 함께 시퀀싱될 수 있다. 특정한 예들에서, 표면 데이터 프레임 은 또한 오디오 데이터, 메타데이터(예컨대, 표면 데이터 프레임에 표현된 특정 오브젝트들에 대한 정보 및/또 는 가상 씬과 연관된 밴티지 포인트들에 대한 정보를 포함한 메타데이터), 및/또는 특정한 구현을 제공할 수 있 는 바와 같이 다른 유형들의 데이터와 같은 다른 유형들의 데이터와 연관될 수 있다. 상이한 밴티지 포인트들과 연관된 표면 데이터 프레임들, 뿐만 아니라 관련된 표면 데이터 프레임들의 시퀀스들의 예들이 이하에서 설명되 고 예시될 것이다. 여기에서 사용된 바와 같이, \"컬러 데이터\"는 서브젝트(예컨대, 가상 씬의 가상 3D 공간 내에 포함된 가상 오브 젝트)가 어떻게 시간 시퀀스에서의 특정한 포인트에서 또는 특정한 밴티지 포인트의 관점으로부터 특정한 시간 기간에 걸쳐 나타날 수 있는지를 나타내는, 컬러 또는 그레이스케일(즉, \"흑백\")로 표현되는지에 관계없이, 임 의의 이미지 데이터, 비디오 데이터 등을 광범위하게 포함할 수 있다. 컬러 데이터는 임의의 특정한 포맷, 파일"}
{"patent_id": "10-2019-7035469", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "유형, 프레임 레이트, 분해능, 품질 레벨, 또는 이 기술분야에서 이미지 데이터 및/또는 비디오 데이터를 정의 하는 다양한 정의들 및/또는 표준들과 연관될 수 있는 다른 특성에 제한되지 않는다. 유사하게, 여기에서 사용 된 바와 같이, \"깊이 데이터\"는 공간에서 서브젝트의 위치를 나타내는 임의의 데이터를 포함할 수 있다. 예를 들어, 가상 오브젝트를 나타내는 깊이 데이터는 가상 오브젝트의 표면들 상에서 상이한 포인트들에 대한 전역적 좌표 시스템(예컨대, 가상 씬의 가상 3D 공간과 연관된 전역적 좌표 시스템)에 대한 좌표들을 포함할 수 있다. 저장 설비는 특정한 구현에서 설비들(102 또는 104)에 의해 수신되고, 생성되고, 관리되고, 추적되고, 유 지되고, 사용되며, 및/또는 송신되는 임의의 적절한 데이터를 유지할 수 있다. 예를 들어, 도시된 바와 같이, 저장 설비는 가상 오브젝트 데이터를 포함할 수 있으며, 이것은 가상 씬의 가상 3D 공간 내에 포함된 하나 이상의 가상 오브젝트들과 연관된 데이터(예컨대, 상태 데이터), 뿐만 아니라 가상 3D 공간으로 하나 이상 의 가상 밴티지 포인트들과 연관된 데이터(예컨대, 상태 데이터)를 포함할 수 있는 가상 밴티지 포인트 데이터 를 포함할 수 있다. 부가적으로, 저장 설비는 가상 씬의 가상 3D 공간 내에 포함된 다른 유형의 엔티 티들, 여기에서 설명된 동작들을 수행하기 위한 지시들(예컨대, 프로그래밍 지시들), 및/또는 설비들(102 및 104)이 여기에서 설명된 동작들을 수행하는 것을 가능하게 할 수 있는 바와 같은 임의의 다른 데이터와 연관된 데이터를 포함할 수 있다. 예를 들어, 저장 설비는 표면 데이터 프레임들, 가상 엔티티 디스크립션 프레임 들 등과 연관된 데이터(예컨대, 오브젝트 디스크립션 데이터, 컬러 데이터, 깊이 데이터, 오디오 데이터, 메타 데이터 등)를 추가로 포함할 수 있다. 저장 설비는 또한 특정한 구현을 제공할 수 있는 바와 같이 부가적 인 또는 대안적인 데이터를 유지할 수 있다. 특정한 예들에서, 시스템은 상이한 밴티지 포인트들로부터 가상 씬의 표면 데이터 프레임들을 렌더링하기 위해 및 사용자가 가상 씬을 경험하도록 허용하기 위해 사용자에게 제공될 표면 데이터 프레임들(예컨대, 가상 현실 미디어 콘텐트의 부분으로서)을 제공하기 위해 콘텐트 제공자 시스템(예컨대, 가상 현실 미디어 콘텐트 제 공자 시스템) 내에서 다양한 구성들로 함께 포함된 다양한 다른 서버-측 시스템들(예컨대, 가상 씬 제어 시스템 들, 자산 저장 시스템들, 비디오 데이터 패키징 시스템들, 3D 렌더링 엔진들 등)과 연관될 수 있다. 몇몇 구현들에서, 이들 다른 서버-측 시스템들 중 하나 이상이 시스템과 통합되거나(예컨대, 그것 내에 포 함되거나) 또는 그 외 시스템과 밀접하게 연관될(예컨대, 동일한 또는 관련된 가상 현실 미디어 제공자 엔 티티들 등에 의해 동작된 시스템에 통신 가능하게 결합된) 수 있다는 것이 이해될 것이다. 예를 들어, 특 정한 구현에서, 시스템은 하나 이상의 가상 오브젝트들을 나타내는 컬러 및 깊이 데이터를 저장한 자산 저 장 시스템, 자산 저장 시스템에 통신 가능하게 결합된 복수의 3D 렌더링 엔진들, 및 자산 저장 시스템에 및/또 는 3D 렌더링 엔진들에 통신 가능하게 결합된 가상 엔티티 상태 추적 시스템을 포함할 수 있다. 엔티티 상태 추 적 시스템은 설비들(102 내지 106)에 관하여 상기 설명된 동작들 중 하나 이상을 수행하도록 구성될 수 있다. 다른 구현들에서, 시스템은 이들 다른 서버-측 시스템과 통합되지 않은 별개의 독립형 시스템으로서 구현 될 수 있지만, 오히려 다른 서버-측 시스템들에 통신 가능하게 결합되고 및/또는 그 외 특정한 구현을 제공할 수 있는 바와 같이 다른 서버-측 시스템들과 상호 연동하도록 구성된다. 예시로서, 도 2는 시스템이 가상 씬의 가상 엔티티 디스크립션 프레임에 기초하여 상이한 밴티지 포인트들 로부터 가상 씬의 프레임들을 렌더링하는 것을 가능하게 하는 대표적인 구성을 도시한다. 도 2에 도시된 바와 같이, 시스템의 구현은 복수의 가상 씬 제어 시스템들(예컨대, 가상 씬 제어 시스템들(202-1 내 지 202-M))에 뿐만 아니라 복수의 서버-측 3D 렌더링 엔진들(예컨대, 3D 렌더링 엔진들(204-1 내지 204- N))에 통신 가능하게 결합될 수 있다. 예를 들어, 시스템은 하나 이상의 네트워크들(예컨대, 여기에서 설명된 네트워크들 또는 네트워크 기술들 중 임의의 것을 포함한)에 의해 또는 특정한 구현을 제공할 수 있는 바 와 같이 다른 모드들의 통신에 의해 가상 씬 제어 시스템들에 및/또는 3D 렌더링 엔진들에 통신 가능 하게 결합될 수 있다. 구성에서 도시된 바와 같이, 설비들(102 내지 106)에 관하여 상기 설명된 동작들을 수행하는 가상 엔티티 상태 추적 시스템은 시스템에 의해 구현될 수 있다. 상기 언급된 바와 같이, 다른 구현들에서, 시스템은 이들 동작들을 수행하도록 구성된 엔티티 추적 시스템 및 구성에서 예시된 다 른 시스템들 및 디바이스들 중 하나 이상을 구체화할 수 있다. 시스템은 3D 렌더링 엔진들과의 통신 연결을 통해, 가상 엔티티 디스크립션 프레임을 포함한 하 나 이상의 가상 엔티티 디스크립션 프레임들을 제공할 수 있다. 가상 엔티티 디스크립션 프레임뿐만 아니 라 3D 렌더링 엔진들과 통신 가능하게 결합되는 자산 저장 시스템으로부터 요청되고 수신된 데이터에 기초하여, 3D 렌더링 엔진들은 각각 각각의 표면 데이터 프레임들(예컨대, 표면 데이터 프레임들 (210-1 내지 210-N))을 렌더링할 수 있으며 표면 데이터 프레임들을 비디오 데이터 패키징 시스템으 로 제공할 수 있다. 시스템은 도 1에 대하여 위에서 상세하게 설명되었다. 구성에서 예시된 다른 시 스템들 및 아이템들의 각각이 이제 보다 상세하게 설명될 것이다. 가상 씬 제어 시스템들은 가상 씬의 가상 3D 공간에 포함된 하나 이상의 가상 엔티티들(예컨대, 데이터가 시스템에 의해 유지되는 가상 엔티티들)에 대한 변화들을 요청하고 및/또는 그 외 구현하도록 구성된 임의 의 컴퓨팅 시스템들을 나타낼 수 있다. 예를 들어, 하나 이상의 가상 씬 제어 시스템들(예컨대, 가상 씬 제어 시스템(202-1))은 가상 씬의 가상 3D 공간 내에 포함된 가상 엔티티들을 나타내는 데이터를 원래 생성할 책임이 있는 콘텐트 생성기와 연관될 수 있다(예컨대, 그에 의해 유지되고, 그에 의해 동작되는 등). 부가적으 로, 특정한 구현들에서, 하나 이상의 다른 가상 씬 제어 시스템들(예컨대, 가상 씬 제어 시스템(202-2))은 가상 씬의 가상 3D 공간을 경험하고 있는 최종 사용자와 연관될 수 있다. 예를 들어, 가상 씬 제어 시스템(202- 2)은 미디어 플레이어 디바이스의 사용자가 가상 씬의 가상 3D 공간 내에서 가상 엔티티들을 경험하고 그것과 상호 작용하도록 허용하기 위해 가상 엔티티들을 현재 렌더링하는 미디어 플레이어 디바이스에 의해 구현될 수 있다. 시스템은 가상 3D 공간 내에 포함된 가상 엔티티들 모두를 나타내는 데이터의 하나의 통합된 세트를 유지 할 수 있기 때문에(예컨대, 각각의 가상 씬 제어 시스템에 대한 가상 엔티티들을 나타내는 데이터의 별개 의 세트들과 대조적으로), 가상 씬 제어 시스템들의 각각이 가상 엔티티들에 대한 수정들을 함에 따라, 이 들 수정들은 데이터의 통합된 세트에 반영될 수 있다. 따라서, 다수의 사용자들(즉, 상이한 가상 씬 제어 시스 템들과 연관된 상이한 사용자들)은 모두 동일한 가상 씬의 동일한 가상 3D 공간에 대한 수정들을 가져올 수 있다. 그 결과, 가상 씬 제어 시스템들 모두에 의해 이루어진 수정들은 시스템에 의해 출력된 가 상 엔티티 디스크립션 프레임들(예컨대, 가상 엔티티 디스크립션 프레임)에 반영될 수 있으며, 결과적으로 3D 렌더링 엔진들에 의해 렌더링된 표면 데이터 프레임들(예컨대, 표면 데이터 프레임들)의 각각에 반영될 수 있다. 가상 씬 제어 시스템들이 어떻게 가상 3D 공간에서 가상 엔티티들을 수정할 수 있는지를 예시하기 위해, 도 3은 복수의 가상 엔티티들을 포함한 대표적인 가상 씬을 도시하며, 도 4는 가상 씬에 대해 이루어 질 수 있는 대표적인 수정들을 예시한다. 구체적으로, 먼저 도 3을 참조하면, 가상 씬은 가상 오브젝트 를 포함하는 가상 3D 공간과 연관되며 복수의 가상 밴티지 포인트들(예컨대, 가상 밴티지 포인 트들(306-1 내지 306-8))에 의해 둘러싸인다. 가상 씬은 특정한 구현을 제공할 수 있는 바와 같이 임의의 유형의 씬(예컨대, 실세계 씬, 컴퓨터-생성 씬, 이벤트 등)을 나타낼 수 있다. 원으로 예시된 바와 같이, 가상 씬과 연관된 가상 3D 공간은 스테 이지, 경기장 등과 같은 구체적으로 기술된 영역일 수 있다. 반대로, 다른 예들에서, 가상 3D 공간은 잘 정의되거나 또는 기술되지 않을 수 있다. 예를 들어, 가상 3D 공간은 임의의 실내 또는 옥외 위치(예컨대, 실세계에 기초한 또는 가상의 또는 컴퓨터-생성된 세계에 기초한), 이벤트, 풍경, 구조 등을 나타낼 수 있다. 가상 오브젝트는 살아있는지 또는 무생물인지에 관계없이, 가상 3D 공간과 연관되고(예컨대, 그것 내 에 또는 그 주변에 위치되고) 가상 밴티지 포인트들 중 적어도 하나로부터 검출 가능한(예컨대, 볼 수 있 는 등) 임의의 가상 오브젝트를 나타낼 수 있다. 예를 들어, 가상 오브젝트는 실-세계 오브젝트(예컨대, 3D 모델이 생성된 오브젝트), 가상의 또는 컴퓨터-생성된 오브젝트 등에 기초할 수 있다. 가상 오브젝트가 명료함을 위해 비교적 간단한 기하학적 형태로 그려지지만, 가상 오브젝트는 다양한 복잡도들을 가진 다양 한 유형들의 오브젝트들을 나타낼 수 있다는 것이 이해될 것이다. 기하학적 형태보다는, 예를 들면, 가상 오브젝트는 사람 또는 또 다른 살아있는 것, 투명하지 않은 고체, 액체, 또는 기체, 벽, 천장, 또는 바닥과 같 은 덜 분리된 오브젝트, 또는 여기에서 설명되거나 또는 특정한 구현을 제공할 수 있는 바와 같은 임의의 다른 유형의 오브젝트와 같은, 임의의 살아있는 또는 무생물 오브젝트 또는 표면을 나타낼 수 있다. 도시된 바와 같 이, 가상 오브젝트는, 이하에서 예시될 바와 같이, 가상 오브젝트가 각각의 상이한 가상 밴티지 포인 트로부터 보여질 때 상이하게 보일 수 있도록 다양한 표면들을 포함할 수 있다. 가상 오브젝트와 함께, 가상 씬은 또한 가상 3D 공간으로 가상 밴티지 포인트들을 포함한 다. 여기에서 사용된 바와 같이, 가상 3D 공간\"으로\"의 가상 밴티지 포인트는 임의의 적절한 방식으로 가상 3D 공간에 대하여 위치되고, 각지고, 배향되는 가상 밴티지 포인트를 나타낼 수 있다. 예를 들어, 가상 3D 공간으 로의 가상 밴티지 포인트는 가상 3D 공간 내에 포함되고, 가상 3D 공간으로 보는 관점을 가진 가상 3D 공간의 밖에 있고, 다른 가상 밴티지 포인트들과 함께 가상 3D 공간을 둘러싸며, 및/또는 그 외 가상 3D 공간의 적어도 몇몇 부분의 뷰를 제공하기 위해 임의의 적절한 방식으로 가상 3D 공간과 연관되는 가상 밴티지 포인트일 수 있 다. 도시된 바와 같이, 각각의 가상 밴티지 포인트는 가상 3D 공간에 대하여 특정한 위치에 배치된 라벨 링된 원을 갖고 및 가상 밴티지 포인트와 연관된 시야를 예시하기 위해 그것에서 나온 점선들을 갖는 도 3 에서 표현될 수 있다. 가상 밴티지 포인트들과 연관된 위치들은 가상 3D 공간에 대하여 고정될 수 있 지만, 이하에서 설명될 바와 같이, 고정된 위치들이 가상 씬 제어 시스템들 중 하나에 의해 수정되는 것이 가능할 수 있다. 부가적으로, 몇몇 예들에서, 가상 3D 공간 및 가상 밴티지 포인트들 양쪽 모두가 함 께 가상 씬을 통해 이동할 수 있다고(예컨대, 우주선, 열기구 등처럼 타는 것과 관련된 가상 3D 공간과 같 은) 이해될 것이다. 도시된 바와 같이, 가상 밴티지 포인트들이 배치되는 고정된 위치들은, 몇몇 예들에서 가상 3D 공간과 연관된 적어도 2차원들을 따라(예컨대, 땅과 같은 평면을 따라) 가상 3D 공간을 둘러 쌀 수 있다. 다른 예들에서, 위치들은 또한 3차원들을 따라 가상 3D 공간을 둘러쌀 수 있다(예컨대, 또한 302 위 및 아래에 위치들을 포함함으로써). 가상 밴티지 포인트들이 단지 2차원들을 따라 가상 3D 공간을 둘러싸는 예들에서도, 복수의 가상 밴티지 포인트들은 관련되지만 약간 상이한 관점들로부 터 가상 오브젝트를 보기 위해 도 3에 도시된 가상 3D 공간을 둘러싸는 위치들에 대하여 상이한 높이 들로 \"적층\"될 수 있다. 도 3에 예시된 가상 밴티지 포인트들의 각각은 가상 3D 공간이 임의의 가상 밴티지 포인트들로부터 나중에 렌더링될 수 있게 하기 위해 다양한 각도들로부터 가상 3D 공간을 캡처하도록 가상 3D 공간을 향해 안쪽으로 치우치지만, 특정한 예들에서, 가상 밴티지 포인트들 중 하나 이상은 가상 3D 공간 등 을 둘러싼 가상 오브젝트들을 보기 위해 바깥쪽으로(즉, 가상 3D 공간으로부터 멀리) 치우칠 수 있다는 것 이 이해될 것이다. 예를 들면, 360-도 가상 밴티지 포인트는 부가적인 관점들로부터 가상 3D 공간 내에 포 함된 가상 오브젝트들을 나타내는 데이터 및/또는 가상 3D 공간의 바깥쪽에 있는 가상 오브젝트들을 나타 내는 데이터를 제공하기 위해 가상 3D 공간의 중간에 배치될 수 있다(명시적으로 도시되지 않음). 상기 언급된 바와 같이, 도 4는 가상 씬에 대해 이루어질 수 있는 대표적인 수정들을 예시한다. 구체적으 로, 몇몇 예들에서, 시스템은 복수의 엔티티들을 나타내는 유지 데이터(즉, 가상 오브젝트, 가상 밴 티지 포인트들, 및/또는 가상 3D 공간에 포함된 임의의 다른 가상 엔티티들을 나타내는 데이터)를 수 정하기 위한 명령을 수신할 수 있으며, 명령의 수신에 응답하여, 명령에 따라 복수의 가상 엔티티들을 나타내는 유지 데이터를 수정할 수 있다. 예를 들어, 명령은 JSON 코드 또는 이루어질 수정을 기술하는 또 다른 적절한 오브젝트 디스크립션 코드를 사용하여 가상 씬 제어 시스템들 중 임의의 것에 의해 전송될 수 있다(예컨대, 웹 소켓 또는 또 다른 적절한 유형의 통신에 의해). 가상 씬 내에 포함된 가상 엔티티들은 임의의 적절한 방식으로 수정될 수 있으며, 이것은 수정되는 가상 엔티티의 유형에 의해 부분적으로 결정될 수 있다. 예를 들어, 수정되는 가상 엔티티가 가상 오브젝트이면, 명 령에 따른 복수의 가상 엔티티들을 나타내는 유지 데이터의 수정은 복수의 가상 엔티티들에 부가적인 가상 오브 젝트를 부가하는 것을 포함할 수 있다. 부가적으로 또는 대안적으로, 수정은 부가적인 가상 오브젝트로 복수의 가상 엔티티들 내에 포함된 가상 오브젝트를 대체하는 것, 복수의 가상 엔티티들로부터 가상 오브젝트를 제거하 는 것, 복수의 가상 엔티티들에 포함된 가상 오브젝트의 적어도 하나의 속성을 수정하는 것, 및/또는 그 외 다 른 가상 엔티티들에 대하여 및/또는 가상 씬의 가상 3D 공간에 대하여 가상 오브젝트를 수정하는 것을 포함할 수 있다. 예시를 위해, 도 4는 가상 오브젝트와 함께 가상 3D 공간에 부가되는 부가적인 가상 오브젝트를 도시한다. 다른 예들에서, 가상 오브젝트는 대신에 가상 오브젝트를 대체할 수 있다(즉, 가상 오브젝 트가 가상 3D 공간에 부가되는 동안 가상 오브젝트가 가상 3D 공간으로부터 제거되도록)는 것이 이해될 것이다. 도 4에 추가로 도시되는 바와 같이, 가상 오브젝트의 특정한 속성들(예컨대, 가상 오 브젝트의 위치 및 배향)이 수정될 수 있다. 다른 예들에서, 가상 오브젝트의 크기, 컬러, 텍스처, 자 세, 및/또는 임의의 다른 속성들과 같은 다른 속성들이 유사하게 수정될 수 있다. 수정되는 가상 엔티티가 가상 밴티지 포인트(예컨대, 가상 밴티지 포인트들 중 하나)이면, 명령에 따른 복 수의 가상 엔티티들을 나타내는 유지 데이터의 수정은 복수의 가상 엔티티들에 부가적인 가상 밴티지 포인트를 부가하는 것을 포함할 수 있다. 부가적으로 또는 대안적으로, 수정은 복수의 가상 엔티티들 내에 포함된 복수의 가상 밴티지 포인트들 중 적어도 하나를 수정하는 것, 복수의 가상 엔티티들로부터 복수의 가상 밴티지 포인트 들 중 적어도 하나를 제거하는 것 등을 포함할 수 있다. 예를 들어, 가상 밴티지 포인트들 중 하나(예컨대, 가상 밴티지 포인트(306-1))와 연관된 시야가 가상 3D 공간의 상이한 각도에 대한 관점을 얻 기 위해 변경되거나 또는 동조될 수 있다. 다른 예들에서, 가상 밴티지 포인트들은 안쪽으로 또는 바깥쪽 으로 이동되고(예컨대, 가상 3D 공간 내에서 특정한 가상 오브젝트에 대하여 줌 인 또는 줌 아웃 효과를 생성하기 위해), 복수의 가상 밴티지 포인트들로부터 제거되거나, 또는 그 외 수정될 수 있다. 또 다른 예 로서, 부가적인 가상 밴티지 포인트는 가상 오브젝트들(304 및 402)에 대한 또 다른 관점(예컨대, 가상 밴티지 포인트들(306-1 내지 306-8) 중 하나에 의해 잘 커버되지 않는 관점)을 얻기 위해 복수의 가상 밴티지 포인트들 에 부가될 수 있다. 상기 설명된 바와 같이, 몇몇 예들에서, 가상 오브젝트와 같은 가상 오브젝트는 가상 오브젝트를 수정하기 위해 가상 씬 제어 시스템들 중 하나로부터의 직접 명령에 기초하여 수정될 수 있다(예컨대, 가상 3D 공간 에 대하여 이동되고 및/또는 회전될 수 있다). 그러나, 다른 예들에서, 가상 오브젝트는 가상 3D 공간 내에 포함된 다른 가상 엔티티들과의 상호작용들에 기초하여 자동으로 수정될 수 있다(즉, 동일하거나 또 는 상이한 방식들로 그러나 가상 씬 제어 시스템으로부터의 명시적 명령에 기초하지 않고 수정될 수 있 다). 보다 구체적으로, 예를 들면, 복수의 가상 엔티티들을 나타내는 데이터의 시스템에 의한 유지는 물리 -기반 오브젝트 거동 및 인공 지능-기반(AI-기반) 오브젝트 거동 중 적어도 하나를 적용하는 것을 포함할 수 있 다(예컨대, 가상 씬의 가상 3D 공간 내에 포함된 가상 오브젝트들로). 예를 들어, 물리-기반 오브젝트 거동은 도 4에 예시된다. 가상 3D 공간에 가상 오브젝트를 부가 하기 위한 수정이 이루어질 때(예컨대, 시스템에 의해), 시스템은 가상 오브젝트들(304 및 402) 각각 이 동일한 가상 공간에 존재할 수 없는 고체 가상 오브젝트들을 나타낸다고 결정할 수 있다. 따라서, 물리-기반 오브젝트 거동에 의해 예시된 바와 같이, 가상 오브젝트의 위치 및 배향 속성들은 가상 오브젝트 가 부분적으로 가상 오브젝트들을 변위시키도록(즉, 가상 오브젝트를 비켜 \"범핑하는\") 물리 규 칙들에 따라 수정될 수 있다. 다른 물리-기반 오브젝트 거동들은 오브젝트들이 어떻게 서로 및 물리적 힘 및 원 리들(예컨대, 중력, 운동량, 마찰, 부력, 광 반사 등)과 상호작용하는지를 정의하는 물리(예컨대, 실-세계 물리 또는 단지 가상 세계에서 이용하는 가상 물리)의 다른 규칙들을 흉내낼 수 있다. 이들 물리-기반 오브젝트 거동 들은 또한 시스템에 의해 가상 3D 공간 내에 포함된 가상 오브젝트들을 나타내는 유지 데이터에 적용 될 수 있다. 게다가, AI-기반 오브젝트 거동들은 또한 가상 오브젝트들이 어떻게 서로 및 가상 오브젝트들이 위 치되는 환경과 상호작용하는지를 정의하도록 도울 수 있다. 예를 들어, AI-기반 오브젝트 거동들은 가상 3D 공 간 내에서 걸어갈 곳, 말할 상대 및 말할 것, 위험에서 벗어날 때 등과 같은, \"선택들\"을 하기 위해 인공 지능을 사용할 수 있는 사람들 및/또는 동물들과 같은 살아있는 것들을 나타내는 가상 오브젝트들(예컨대, 아바 타들)을 가지고 특히 적용 가능할 수 있다. 도 2로 돌아가면, 시스템은 시간 시퀀스(예컨대, 실시간 시퀀스, 가상 세계에서의 시간과 연관된 가상 타 임라인 등)에서의 특정한 포인트들에서 복수의 가상 엔티티들에서의 가상 엔티티들의 상태들을 나타내는 가상 엔티티 디스크립션 프레임들을 생성한다. 예를 들어, 도시된 바와 같이, 시스템은 특정한 가상 엔티티 디 스크립션 프레임(즉, 가상 엔티티 디스크립션 프레임)을 생성할 수 있으며, 가상 엔티티 디스크립션 프레 임을 3D 렌더링 엔진들의 각각으로 제공할 수 있다. 3D 렌더링 엔진들은 서버-측 3D 렌더링 엔 진들일 수 있다(예컨대, 네트워크에 걸쳐 있고 및/또는 그 외 사용자들에 의해 사용된 미디어 플레이어와 같은 클라이언트-측 디바이스들로부터 분리된 3D 렌더링 엔진들). 몇몇 예들에서, 3D 렌더링 엔진들은 별개의 디바이스들(예컨대, 별개의 서버들, 서버 내에서의 별개의 프로세서들 등)에 의해 또는 별개의 소프트웨어 프로 세스들(예컨대, 별개의 명령 스레드들 등)에 의해 구현될 수 있지만, 다른 예들에서, 3D 렌더링 엔진들은 특정한 구현을 제공할 수 있는 바와 같이 공통 하드웨어 및/또는 소프트웨어 디바이스들 또는 프로세스들로 함께 통합될 수 있다. 몇몇 구현들에서, 3D 렌더링 엔진들은 시스템과 같은 가상 씬 캡처 시스템과 함께 공 동으로 동작되거나 또는 심지어 그것으로 완전히 통합될 수 있지만, 다른 구현들에서 3D 렌더링 엔진들은 개별 적으로 동작될 수 있다(예컨대, 클라우드-기반 프로세싱 서비스들을 제공하는 상이한 엔티티 등에 의해). 3D 렌더링 엔진들로 제공된 특정한 가상 엔티티 디스크립션 프레임들은 시간 시퀀스에서의 특정한 포인트 에서 가상 씬(즉, 가상 씬)과 연관된 가상 엔티티들 모두를 나타내는 상태 데이터를 포함하는 키 디스크립 션 프레임들일 수 있지만, 다른 가상 엔티티 디스크립션 프레임들은 시간 시퀀스에서의 이전 포인트에서 가상 엔티티들 모두의 상태를 나타내는 이전 키 디스크립션 프레임이 생성된 이래 수정되어 온 가상 씬과 연관된 단 지 이들 가상 엔티티들의 변화의 상태(예컨대, 시간 시퀀스에서의 특정한 포인트에서)만을 나타내는 업데이트 디스크립션 프레임들일 수 있다. 예를 들면, 도 4에 예시된 수정들을 참조하면, 키 디스크립션 프레임은 가상 오브젝트들(304 및 402)과 연관된 상태 데이터, 뿐만 아니라 가상 밴티지 포인트들과 연관된 상태 데이터 를 포함할 수 있다. 반대로, 업데이트 디스크립션 프레임은, 예를 들면, 가상 오브젝트들(304 및 402)이 이전 키 디스크립션 프레임이 생성된 이래 수정되었기 때문에 단지 가상 오브젝트들(304 및 402)과 연관된 상태 데이 터 또는 단지 가상 오브젝트들(304 및 402)로의 변화들과 연관된 상태 데이터만을 포함할 수 있다. 가상 밴티지 포인트들의 상태를 나타내는 데이터는 가상 밴티지 포인트들이 이전 키 디스크립션 프레임 이래 정적 으로 배치되고 변경되지 않은 채로 있기 때문에 이러한 대표적인 업데이트 디스크립션 프레임에서 표현되지 않 을 수 있다. 도 5는 시스템에 의해 생성될 수 있는 복수의 대표적인 가상 엔티티 디스크립션 프레임들(예컨대, 가 상 엔티티 디스크립션 프레임들(500-1 내지 500-12))을 도시한다. 하나의 가상 엔티티 디스크립션 프레임 으로부터 또 다른 것까지 가리키는 화살표들에 의해 표시된 바와 같이, 가상 엔티티 디스크립션 프레임들 은 가상 엔티티 디스크립션 프레임(500-1)으로 시작하여 가상 엔티티 디스크립션 프레임(500-12)으로 진행하는 시간 시퀀스로 순서화될 수 있으며, 그 후 시간 시퀀스는 도 5에서 명시적으로 도시되지 않는 부가적인 가상 엔 티티 디스크립션 프레임들로 진행할 수 있다. 각각의 가상 엔티티 디스크립션 프레임의 최하부를 따 라, 가상 엔티티 디스크립션 프레임(예컨대, 키 디스크립션 프레임 또는 업데이트 디스크립션 프레임)의 유형이 표시된다. 구체적으로, 가상 엔티티 디스크립션 프레임들(500-1, 500-5, 및 500-09)은 키 디스크립션 프레임들 인 것으로 표시되지만, 가상 엔티티 디스크립션 프레임들(500-2 내지 500-4, 500-6 내지 500-8, 및 500-10 내지 500-12)은 업데이트 디스크립션 프레임들인 것으로 표시된다. 따라서, 이 예에서, 각각의 키 디스크립션 프레임은 여러(예컨대, 3개) 업데이트 디스크립션 프레임들만큼 시간 시퀀스에서 앞서며, 이것은 결과적으로 또 다른 키 디스크립션 프레임만큼 시간 시퀀스에서 앞선다. 그러나, 도 5에 도시된 키 디스크립션 프레임들 및 업데이트 디스크립션 프레임들의 배열은 단지 대표적이며, 키 및 업데이 트 디스크립션 프레임들의 배열은 특정한 구현을 제공할 수 있는 바와 같이 임의의 방식으로 구현될 수 있다는 것이 이해될 것이다. 예를 들어, 특히 동적이지 않은(즉, 가상 엔티티들에 대한 다수의 수정들에 의해 영향을 받지 않는) 가상 씬은 비교적 많은 수들의 업데이트 디스크립션 프레임들에 앞서 비교적 적은 키 디스크립션 프 레임들에 의해 표현될 수 있다. 반대로, 보다 동적인 가상 씬은 보다 많은 비율의 키 디스크립션 프레임들(최대 배타적으로 키 디스크립션 프레임들을 포함한) 및 보다 작은 비율의 업데이트 디스크립션 프레임들(업데이트 디 스크립션 프레임들이 없는 것을 포함하여 그 아래로)에 의해 표현될 수 있다. 도 5에 추가로 도시되는 바와 같이, 각각의 가상 엔티티 디스크립션 프레임은 가상 엔티티 디스크립션 코 드(예컨대, JSON 코드, XML 코드, 또는 시스템에 의해 유지된 가상 엔티티들과 연관된 상태 데이터를 기술 하는데 적합한 또 다른 유형의 코드)를 포함하거나 또는 그것에 의해 구현될 수 있으며 다른 가상 엔티티 디스 크립션 프레임들에 대하여 시간 시퀀스에서 각각의 가상 엔티티 디스크립션 프레임의 위치를 나타내 는 시퀀스 번호(예컨대, 식별 번호 또는 \"ID\")와 연관될 수 있다. 예를 들어, 도시된 바와 같이, 가상 엔티티 디스크립션 프레임(500-1)은 가상 엔티티 디스크립션 프레임(500-1)이 키 디스크립션 프레임임을 나타내기 위해 및 다른 키 디스크립션 프레임들에 대하여 프레임의 상대적 위치를 나타내기 위해(예컨대, \"1.0\"은 \"2.0\" 전에 온다) 전체 수(즉, \"1.0\")인 시퀀스 번호를 가질 수 있다. 가상 엔티티 디스크립션 프레임들(500-2 내지 500- 4)은 그 후 각각 1로 시작하며(즉, 이들 프레임들이 키 디스크립션 프레임(1.0)으로의 업데이트들임을 나타내기 위해) 다른 업데이트 디스크립션 프레임들에 대하여 시간 시퀀스에서의 업데이트 디스크립션 프레임들의 상대적 위치들을 나타내기 위해(예컨대, \"1.1\"은 \"1.2\" 전에 온다) 서브-식별자들(즉, \".1\", \".2\" 및 \".3\")을 포함하는 시퀀스 번호들과 연관될 수 있다. 이러한 가상 엔티티 디스크립션 프레임 넘버링 기법은 단지 대표적이며 임의 의 적절한 프레임 넘버링 기법은 특정한 구현을 제공할 수 있는 바와 같이 이용될 수 있다. 도 2로 돌아가면, 가상 엔티티 디스크립션 프레임이 키 디스크립션 프레임(예컨대, 가상 엔티티 디스크립 션 프레임들(500-1, 500-5, 또는 500-9)과 같은) 또는 업데이트 디스크립션 프레임(예컨대, 도 5에서의 다른 가 상 엔티티 디스크립션 프레임들과 같은)인지에 관계없이, 가상 엔티티 디스크립션 프레임을 포함한 가상 엔티티 디스크립션 프레임들의 시퀀스는 각각의 3D 렌더링 엔진이 연관되는 각각의 밴티지 포인트들 로부터 가상 씬의 가상 3D 공간을 렌더링하기 위해 3D 렌더링 엔진들에 의해 요구된 정보 모두 를 제공할 수 있다. 이와 같이, 3D 렌더링 엔진들이 순서대로 가상 엔티티 디스크립션 프레임들을 수신하 거나 또는 프로세싱하는 것은 필요하지 않을 수 있다. 오히려, 3D 렌더링 엔진들은 특정한 3D 렌더링 엔진 에 대해 편리하거나 또는 효율적일 수 있는 바와 같이 임의의 순서로 각각의 표면 데이터 프레임들 (예컨대, 각각이 시퀀스에서 단일 가상 엔티티 디스크립션 프레임으로부터 생성될 수 있는)을 렌더링할 수 있으 며, 표면 데이터 프레임들은 나중에 재순서화되고 동기화될 수 있다(예컨대, 비디오 데이터 패키징 시스템 에 의해). 몇몇 예들에서, 가상 엔티티 디스크립션 프레임은 자산 저장 시스템에 저장되는 상세한 정보(예컨대, 가상 오브젝트 기하학적 구조들, 텍스처들 등을 나타내는 이진 데이터)로의 링크들과 함께 가상 엔티티들을 나 타내는 상태 정보를 포함할 수 있으며 가상 엔티티 디스크립션 프레임에서의 링크들에 기초하여, 요구된 대로 3D 렌더링 엔진들의 각각에 의해 자산 저장 시스템으로부터 액세스될 수 있다. 자산 저장 시스 템은 시스템 및/또는 3D 렌더링 엔진들로부터의 별개의 디바이스(예컨대, 별개의 서버, 별개의 프로세서 및 서버 내에서의 저장 설비 등)에 의해, 별개의 소프트웨어 프로세스들(예컨대, 별개의 지시 스레드 들 등)에 의해 구현될 수 있거나, 또는 특정한 구현을 제공할 수 있는 바와 같이 시스템 및/또는 3D 렌더 링 엔진들과 함께 공통 하드웨어 및/또는 소프트웨어 디바이스들 또는 프로세스들로 통합될 수 있다. 몇몇 구현들에서, 자산 저장 시스템은 시스템과 같은 가상 씬 캡처 시스템 및/또는 또한 3D 렌더링 엔진들 을 포함하는 시스템과 공동으로 동작되거나 또는 그것으로 완전히 통합될 수 있지만, 다른 구현들에서, 자 산 저장 시스템은 개별적으로(예컨대, 클라우드-기반 프로세싱 서비스들을 제공하는 상이한 엔티티 등에 의해) 동작될 수 있다. 어쨌든, 가상 엔티티 디스크립션 프레임 내에 포함된 데이터 및 가상 엔티티 디스크립션 프레임 내에 서 제공된 링크들을 사용하여 자산 저장 시스템으로부터 액세스된 데이터 사이에서, 3D 렌더링 엔진들 은 3D 렌더링 엔진들에 의해 국소적으로 유지된 정보에 의존할 필요 없이 각각의 가상 밴티지 포인트 들로부터의 가상 3D 공간을 나타내는 표면 데이터 프레임들을 렌더링하기 위해 필요한 모든 정보로의 액세스를 수신할 수 있다. 각각의 3D 렌더링 엔진은 시스템에 의해 유지된 복수의 가상 엔티티들에서 표현된 가상 밴티지 포인 트들 중 하나와 연관될 수 있다. 예를 들어, 3D 렌더링 엔진들(204-1 내지 204-8)(그것의 단지 3D 렌더링 엔진 들(204-1 및 204-2)만이 도 2에서 명시적으로 도시된다)은 각각 가상 밴티지 포인트들(306-1 내지 306-8)(도 3 에 예시됨)과 연관될 수 있다. 이와 같이, 각각의 3D 렌더링 엔진은 특정한 3D 렌더링 엔진이 연관되 는 가상 밴티지 포인트의 관점(즉, 위치, 각도, 시야 등)으로부터 보여지는 바와 같이 각각의 표면 데이터 프레임을 렌더링할 수 있다. 게다가, 상기 설명된 바와 같이, 각각의 표면 데이터 프레임은 각각의 가상 밴티지 포인트로부터 가상 오브젝트들의 외형을 나타내는 컬러 데이터(즉, 이미지 데이터)를 포함할 수 있 을 뿐만 아니라, 또한 깊이 데이터를 포함할 수 있다. 예시를 위해, 도 2는 3D 렌더링 엔진(204-1)에 의해 렌더링된 표면 데이터 프레임일 수 있는, 표면 데이터 프레 임(210-1)을 나타내는 이미지들을 도시하며, 상기 3D 렌더링 엔진은 가상 밴티지 포인트(306-1)(도 3 참조)와 연관된다. 도시된 바와 같이, 표면 데이터 프레임(210-1)은 가상 밴티지 포인트(306-1)로부터 가시적인 가상 3D 공간의 뷰(가상 오브젝트의 표면들로부터의 컬러 데이터를 포함한)를 나타낼 수 있는, 컬러 데이터 를 포함할 수 있다. 컬러 데이터가 도 2에서 이미지로서 예시되지만, 컬러 데이터는 임의의 적 절한 형태로 캡처되고, 인코딩되고, 포맷되고, 송신되며, 표현될 수 있다는 것이 이해될 것이다. 예를 들어, 컬 러 데이터는 표준 비디오 인코딩 프로토콜, 표준 이미지 포맷 등에 따라 포맷팅되는 디지털 데이터일 수 있다. 컬러 데이터는 가상 밴티지 포인트(306-1)로부터 보여지는 바와 같이 가상 3D 공간 내에 포함된 가상 오브젝트의 컬러 이미지(예컨대, 컬러 사진과 유사한)를 나타낼 수 있다. 부가적으로 또는 대안적으로, 컬러 데 이터는 가상 오브젝트들을 나타내는 그레이스케일 이미지(예컨대, 흑백 사진과 유사한)일 수 있다. 부가적으로, 표면 데이터 프레임(210-1)은 가상 밴티지 포인트(306-1)와 연관된 공간에서의 포인트로부터 가상 오브젝트의 표면들에 대한 깊이 데이터를 포함하는 가상 3D 공간의 또 다른 뷰를 나타낼 수 있는, 깊 이 데이터를 포함할 수 있다. 컬러 데이터처럼, 깊이 데이터는 가상 밴티지 포인트(306-1)의 관 점으로부터 가상 3D 공간 내에서의 가상 오브젝트를 묘사할 수 있다. 그러나, 가상 오브젝트의가시적 외형을 나타내기(즉, 광이 어떻게 가상 오브젝트의 표면들과 상호작용하는지를 컬러 또는 그레이스 케일로 나타내는)보다는, 깊이 데이터는 가상 밴티지 포인트(306-1)의 가상 위치에 대하여 가상 오브젝트 (예컨대, 뿐만 아니라 가상 3D 공간 내에서의 다른 오브젝트들)의 표면상에서의 각각의 포인트의 깊 이(즉, 거리 또는 위치)를 나타낼 수 있다. 컬러 데이터와 마찬가지로, 깊이 데이터는 임의의 적절한 형태로 캡처되고, 인코딩되고, 포맷되고, 송신되며, 표현될 수 있다. 예를 들어, 도시된 바와 같이, 깊이 데이 터는 그레이스케일 이미지 데이터에 의해 표현될 수 있다(예컨대, 깊이 데이터 내에 표현된 각각의 픽셀에 대한 6 또는 8비트들). 그러나, 가시 광이 어떻게 가상 오브젝트의 표면들로부터 반사되는지(즉, 컬러 데이터에서 표현된 바와 같이)보다는, 깊이 데이터의 그레이스케일 이미지는 이미지에서의 각각 의 픽셀에 대해, 상기 픽셀에 의해 표현된 포인트가 가상 밴티지 포인트(306-1)로부터 얼마나 멀리 떨어져 있는 지를 나타낼 수 있다. 예를 들어, 가상 밴티지 포인트(306-1)에 더 가까운 포인트들은 그레이의 더 어두운 음영 들을 나타내는 값들(예컨대, 6-비트 구현의 경우에 0b111111에 더 가까운 이진 값들, 여기에서 0b111111은 흑색 을 나타낸다)로 표현될 수 있다. 반대로. 가상 밴티지 포인트(306-1)로부터 더 멀리 떨어진 포인트들은 그레이 의 더 밝은 음영들을 나타내는 값들(예컨대, 6-비트 구현의 경우에 0b000000에 더 가까운 이진 값들, 여기에서 0b000000은 백색을 나타낸다)로 표현될 수 있다. 표면 데이터 프레임들의 각각의 세트들은 시스템에 의해 제공된 각각의 가상 엔티티 디스크립션 프레 임(예컨대, 가상 엔티티 디스크립션 프레임을 포함한)이 가상 3D 공간으로의 상이한 가상 밴티지 포 인트들로부터 가상 씬의 가상 3D 공간의 렌더링들을 나타내는 표면 데이터 프레임들의 각각의 세트 (예컨대, 표면 데이터 프레임들(210-1 내지 210-N)을 포함하는 세트)와 연관된다. 도 2에 도시된 바와 같이, 표 면 데이터 프레임들의 각각의 세트들에서 각각의 표면 데이터 프레임은 그 후 비디오 데이터 패키징 시스 템으로 제공될 수 있으며, 이것은 각각의 가상 밴티지 포인트와 연관된 각각의 컬러 비디오 데이터 스트림들 및 깊이 비디오 데이터 스트림들을 생성하기 위해 표면 데이터 프레임들을 조직하고, 동기화하고, 인 코딩하고, 압축하고, 조합하며, 및/또는 그 외 프로세싱할 수 있다. 예시를 위해, 도 6은 구성의 특정한 구성요소들의 보다 상세한 뷰를 도시한다. 구체적으로, 도 6은 표면 데이터 프레임들(즉, 표면 데이터 프레임들(210-1 내지 210-8))의 완전한 세트를 렌더링하는 8개의 3D 렌 더링 엔진들(즉, 3D 렌더링 엔진들(204-1 내지 204-8))을 예시한다. 표면 데이터 프레임들(210-1 내지 210-8)은 표면들이 가상 3D 공간에 대하여 상이한 밴티지 포인트들(예컨대, 각각, 가상 밴티지 포인트들(306-1 내지 306-8))로부터 나타날 것이므로 가상 3D 공간 내에 포함된 가상 오브젝트들(예컨대, 가상 3D 공간 내 에서의 가상 오브젝트)의 표면들의 컬러 및 깊이 데이터를 나타낼 수 있다. 표면 데이터 프레임들은 각각 도 2에 예시된 컬러 데이터 이미지와 유사한 이미지(즉, 컬러 데이터를 예시한 이미지)에 의해 도 6에서 표현될 수 있지만, 각각의 표면 데이터 프레임은 또한, 도 2에 예시된 깊이 데이터 이미지와 유사한 이미 지(즉, 깊이 데이터를 예시한 이미지)에 의해 표현될 수 있는, 깊이 데이터를 나타내는 데이터를 포함할 수 있다는 것이 이해될 것이다. 3D 렌더링 엔진들은 각각, 상기 설명된 바와 같이, 가상 엔티티 디스크립션 프레임에 기초하여, 뿐만 아니라 자산 저장 시스템으로부터 액세스된 데이터에 기초하여 연관된 가상 밴티지 포인트들로부터 표면 데이터 프레임들을 생성할 수 있다. 예를 들어, 가상 씬과 연관된 복수의 가상 엔티티들을 나타 내는 유지 데이터는 자산 저장 시스템에 저장되는 가상 오브젝트를 나타내는 컬러 및 깊이 데이터로 의 링크를 포함할 수 있다. 이와 같이, 가상 엔티티 디스크립션 프레임(상기 설명된 바와 같이 시스템 에 의해 생성되고 3D 렌더링 엔진들로 제공되어 온)은 자산 저장 시스템에 저장된 가상 오브젝 트를 나타내는 컬러 및 깊이 데이터로의 링크를 포함하도록 생성될 수 있다. 3D 렌더링 엔진들의 각 각은 시스템으로부터 가상 엔티티 디스크립션 프레임을 수신하는 것, 및 가상 엔티티 디스크립션 프 레임 내에 포함된 링크를 사용하여 자산 저장 시스템으로부터 자산 저장 시스템에 저장된 가상 오브젝트를 나타내는 컬러 및 깊이 데이터를 액세스하는 것을 포함한 동작들을 수행함으로써 그것들 각각 의 밴티지 포인트들로부터 그것들 각각의 표면 데이터 프레임들을 렌더링하도록 구성될 수 있다. 가 상 엔티티 디스크립션 프레임에 포함된 데이터 및 자산 저장 시스템으로부터 액세스된 컬러 및 깊이 데이터 양쪽 모두를 갖고, 3D 렌더링 엔진들은 도시된 바와 같이, 가상 3D 공간을 둘러싼 밴티지 포 인트들로부터 가상 3D 공간(예컨대, 가상 오브젝트를 포함한)의 뷰들을 제공하기 위해 표면 데이터 프레임들을 렌더링할 수 있다. 각각의 표면 데이터 프레임은 시간 시퀀스 동안 각각의 가상 밴티지 포인트로부터 가시적인 가상 오 브젝트의 표면들의 컬러 및 깊이 데이터를 나타내는 표면 데이터 프레임들의 별개의 시퀀스 내에 포함될수 있다. 예를 들어, 표면 데이터 프레임(210-1)은 시간 시퀀스 동안 가상 밴티지 포인트(306-1)로부터 가시적 인 가상 오브젝트의 표면들의 컬러 및 깊이 데이터를 나타내는 표면 데이터 프레임들의 제 1 시퀀스 내에 포함될 수 있고, 표면 데이터 프레임(210-2)은 시간 시퀀스 동안 가상 밴티지 포인트(306-2)로부터 가시적인 가 상 오브젝트의 표면들의 컬러 및 깊이 데이터를 나타내는 표면 데이터 프레임들의 제 2 시퀀스 내에 포함 될 수 있는 등이다. 다시 말해서, 일단 표면 데이터 프레임들이 렌더링되면, 각각의 3D 렌더링 엔진 은 표면 데이터 프레임들의 상이한 각각의 시퀀스들에서 다른 표면 데이터 프레임들을 계속해서 렌더링할 수 있 다. 예를 들어, 3D 렌더링 엔진들은 가상 엔티티 디스크립션 프레임(예컨대, 도 5에 예시된 가상 엔 티티 디스크립션 프레임들의 시퀀스와 같은) 후 부가적인 가상 엔티티 디스크립션 프레임들을 수신할 수 있으며, 부가적인 가상 엔티티 디스크립션 프레임에 기초하여 추가 표면 데이터 프레임들을 생성할 수 있다. 예시를 위해, 도 7은 각각, 밴티지 포인트들(306-1 내지 306-8)로부터 가시적인 가상 오브젝트의 표면들의 컬러 및 깊이 데이터를 나타내는 표면 데이터 프레임들의 복수의 대표적인 프레임 시퀀스들(예컨대, 프레 임 시퀀스들(702-1 내지 702-8))을 도시한다. 예를 들어, 각각의 프레임 시퀀스에서 제 1 표면 데이터 프 레임들(즉, 오브젝트의 상이한 뷰들이 도 7에서 가시적이도록 커버되지 않은 표면 데이터 프레임들)이 도 6에 예시된 표면 데이터 프레임들에 대응할 수 있다. 따라서, 프레임 시퀀스들(702-1 내지 702-8)은 각각, 3D 렌더링 엔진들(204-1 내지 204-8)과, 및 그에 따라, 가상 밴티지 포인트들(306-1 내지 306-8)과 연관될 수 있다. 예를 들어, 프레임 시퀀스(702-1)는 특정한 시간 시퀀스(예컨대, 실시간의 특정한 기간, 몰입형 가 상 세계 세상과 연관된 특정한 가상 타임라인 등) 동안 가상 밴티지 포인트(306-1)로부터 보여지는 바와 같이 가상 3D 공간 내에 포함된 가상 오브젝트들의 컬러 및 깊이 양쪽 모두를 나타낼 수 있다. 유사하게, 프레 임 시퀀스(702-2)는 시간 시퀀스 동안 가상 밴티지 포인트(306-2)로부터 보여지는 바와 같이 가상 3D 공간 내에 포함된 가상 오브젝트들의 컬러 및 깊이, 및 프레임 시퀀스들(702-3 내지 702-8)에 대한 등등을 나 타낼 수 있다. 상기 설명되고 예시된 바와 같이, 3D 렌더링 엔진들에 의해 생성되고 프레임 시퀀스들에 포함된 표면 데이터 프레임들의 각각은 비디오 데이터 패키징 시스템으로 송신되거나 또는 그 외 전달될 수 있으며, 이 것은 3D 렌더링 엔진들에 통신 가능하게 결합될 수 있다. 표면 데이터 프레임들의 상이한 프레임 시퀀스들 의 각각에 기초하여, 비디오 데이터 패키징 시스템은 가상 밴티지 포인트들의 각각에 대한 컬러 비디오 데이터 스트림 및 깊이 비디오 데이터 스트림을 송신하기 위해 하나 이상의 수송 스트림들을 생성할 수 있다. 예를 들어, 비디오 데이터 패키징 시스템은 각각의 프레임 시퀀스와 연관된(즉, 각각의 3D 렌 더링 엔진 및 가상 밴티지 포인트와 연관된) 개개의 컬러 비디오 데이터 스트림들 및 깊이 비디오 데 이터 스트림들을 포함하는 단일 수송 스트림을 생성할 수 있거나, 또는 비디오 데이터 패키징 시스템은 각 각의 프레임 시퀀스와 연관된 컬러 비디오 데이터 스트림 및 깊이 비디오 데이터 스트림에 대한 상이한 수 송 스트림들을 생성할 수 있다. 일단 수송 스트림이 생성되면, 비디오 데이터 패키징 시스템은 사용자와 연관된 클라이언트-측 미디어 플 레이어 디바이스로의 스트리밍을 위해 수송 스트림을 제공할 수 있다. 예를 들어, 비디오 데이터 패키징 시스템 은 수송 스트림을 미디어 플레이어 디바이스 자체로 스트리밍(예컨대, 네트워크를 통해 송신)할 수 있거나, 또는 수송 스트림이 또 다른 시스템에 의해 추가로 프로세싱되고 미디어 플레이어 디바이스로 스트리밍 될 데이터 파이프라인에 수송 스트림을 포함할 수 있다(예컨대, 파이프라인과 연관된 다른 디바이스들, 프로세 스들, 및/또는 시스템들에 의해 프로세싱되고 및/또는 재패키징된 후). 상기 언급된 바와 같이, 몇몇 예들에서, 시스템 및/또는 가상 엔티티 디스크립션 프레임에 기초하여 상이 한 밴티지 포인트들로부터 가상 씬의 프레임들을 렌더링하기 위해 여기에서 설명된 다른 시스템들(예컨대, 다른 서버-측 시스템들) 및 디바이스들은 사용자들에 의해 경험될 가상 현실 미디어 콘텐트를 생성하기 위해 사용될 수 있다. 예를 들어, 상기 설명된 동작들 외에, 가상 현실 미디어 콘텐트 제공자 시스템(예컨대, 그 시스템 내 에 시스템, 비디오 데이터 패키징 시스템, 및/또는 여기에서 설명된 다른 디바이스들 및 시스템들이 포함될 수 있거나 또는 이들 시스템들이 그 외 연관될 수 있는)은 비디오 데이터 패키징 시스템을 생성하 고 제공하는 수송 스트림에 기초하여 가상 현실 미디어 콘텐트를 추가로 생성하고 제공할 수 있다. 가상 현실 미디어 콘텐트는 가상 씬을 나타낼 수 있으며 가상 씬에 대하여 임의의 가상 위치에 대응하는 동적으로 선택 가 능한 가상 밴티지 포인트로부터 경험되도록 사용자에게 제공 가능할 수 있다. 예를 들어, 동적으로 선택 가능한 가상 밴티지 포인트는 사용자가 미디어 플레이어 디바이스를 사용하여 가상 씬을 경험하는 동안 미디어 플레이 어 디바이스의 사용자에 의해 선택될 수 있다. 게다가, 가상 현실 미디어 콘텐트는 사용자로 하여금 가상 씬 내 에서의 임의의 가상 위치에 대응하는 동적으로 선택 가능한 가상 밴티지 포인트로부터 가상 씬을 경험하도록 허용하기 위해 미디어 플레이어 디바이스로 제공될 수 있다(예컨대, 시스템을 포함하거나 또는 그 외 그것과 연관되는 가상 현실 미디어 콘텐트 제공자 시스템에 의해). 예시를 위해, 도 8은 시스템 및 비디오 데이터 패키징 시스템을 포함하는 대표적인 가상 현실 미디어 콘텐트 제공자 시스템(\"제공자 시스템\")이 네트워크에 의해 가상 씬을 경험하기 위해 사용자 에 의해 사용된 대표적인 클라이언트-측 미디어 플레이어 디바이스(\"미디어 플레이어 디바이스 \")로 제공되는 가상 현실 미디어 콘텐트를 생성하는 대표적인 구성을 도시한다. 하나 이상의 수송 스트림들이 상기 설명된 바와 같이 프레임 시퀀스들에 기초하여 생성된 후, 제공자 시스 템은 미디어 플레이어 디바이스가 렌더링하도록 구성될 수 있는 가상 현실 미디어 콘텐트를 형성하기 위해 하나 이상의 수송 스트림들을 추가로 인코딩하고, 패키징하고, 암호화하거나, 또는 그 외 프로세싱할 수 있다. 예를 들어, 가상 현실 미디어 콘텐트는 이하에서 설명될 바와 같이, 가상 씬 내에서의 임의의 임의 적 가상 밴티지 포인트(예컨대, 사용자에게 관심 있을 수 있는 가상 밴티지 포인트들이 아닌 가상 밴 티지 포인트들을 포함한)로부터 가상 씬의 뷰를 제공하도록 미디어 플레이어 디바이스에 의해 렌더링 될 수 있는 복수의 2D 비디오 데이터 스트림들(예컨대, 각각의 가상 밴티지 포인트에 대해 컬러 데이터와 및 깊이 데이터와 연관된 2D 비디오 데이터 스트림들)을 포함하거나 또는 이를 나타낼 수 있다. 부가적으로 또 는 대안적으로, 가상 현실 미디어 콘텐트는 임의적 가상 밴티지 포인트들로부터 볼 수 있도록 또한 렌더링될 수 있는 가상 씬 내에 포함된 가상 오브젝트들의 하나 이상의 체적 모델들(예컨대, 3D 또는 4D 모델들)을 나 타낸 데이터를 포함할 수 있다. 가상 현실 미디어 콘텐트는 그 후 네트워크에 의해 사용자와 연관된 미디어 플레이어 디바이스와 같은 하나 이상의 미디어 플레이어 디바이스들로 분배될 수 있다. 예를 들어, 제공자 시스템은 사용자가 미디어 플레이어 디바이스를 사용하여 가상으로 가상 씬을 경험 할 수 있도록 미디어 플레이어 디바이스로 가상 현실 미디어 콘텐트를 제공할 수 있다. 몇몇 예들에서, 사용자가 가상 현실 미디어 콘텐트(예컨대, 가상 씬을 나타내는)에 의해 표현된 몰입 형 가상 현실 세계 내에서의 하나 이상의 별개의 위치들에 제한되는 것은 바람직하지 않을 수 있다. 이와 같이, 제공자 시스템은 가상 씬이 가상 밴티지 포인트들로부터뿐만 아니라, 가상 씬 내에서(예컨 대, 가상 3D 공간 내에서 또는 그 주위에서)의 임의적 가상 위치에 대응하는 임의의 동적으로 선택 가능한 가상 밴티지 포인트로부터 렌더링되도록 허용하기 위해 가상 씬을 나타내는 가상 현실 미디어 콘텐트 내에 서 충분한 데이터를 제공할 수 있다. 예를 들어, 동적으로 선택 가능한 가상 밴티지 포인트는 사용자가 미 디어 플레이어 디바이스를 사용하여 가상 씬을 경험하는 동안 사용자에 의해 선택될 수 있다. 여기에서 사용된 바와 같이, \"임의적 가상 위치\"는 가상 씬과 연관된 공간에서(예컨대, 가상 씬의 가상 3D 공간 내에서 또는 그 주위에서) 임의의 가상 포인트를 나타낼 수 있다. 예를 들어, 임의적 가상 위치들은 가상 씬을 둘러싼 고정 위치들(예컨대, 가상 밴티지 포인트들과 연관된 고정 위치들)에 제한되지 않으며, 또한 가상 밴티지 포인트들과 연관된 위치들과 가상 3D 공간의 안에서의 위치들 사이에서의 위치들 모두를 포함 한다. 게다가, 임의적 가상 위치들은 가상 밴티지 포인트들 중 임의의 것과 동조하는 것에 제한되지 않는 임의적 가상 밴티지 포인트들과 연관될 수 있다. 몇몇 예들에서, 이러한 임의적 가상 위치들은 가상 씬 내 에서의 가장 바람직한 가상 밴티지 포인트들에 대응할 수 있다. 예를 들어, 가상 씬이 농구 게임을 포함한 다면, 사용자는 농구 코트 상에서의 임의의 임의적 가상 위치에 있는 게임을 경험할 가상 밴티지 포인트들 을 동적으로 선택할 수 있다. 예를 들어, 사용자는 농구 코트 위 아래로 농구공을 따르기 위해 그 또는 그녀의 가상 밴티지 포인트들을 동적으로 선택하고 게임의 동작 중에 농구 코트에 서있는 것처럼 농구 게임을 경험할 수 있다. 다시 말해서, 예를 들어, 가상 밴티지 포인트들이 농구 코트를 둘러싼 고정 위치들에 배치될 수 있지만, 사용자는 농구 코트 상에서의 임의의 임의적 위치와 연관되는 게임을 경험할 임의적 가상 밴티지 포인트들을 동적으로 선택할 수 있다. 네트워크는 제공자-특정 유선 또는 무선 네트워크(예컨대, 케이블 또는 위상 캐리어 네트워크 또는 이동 전화 네트워크), 인터넷, 광역 네트워크, 콘텐트 전달 네트워크, 또는 임의의 다른 적절한 네트워크를 포함할 수 있다. 데이터는 특정한 구현을 제공할 수 있는 바와 같이 임의의 통신 기술들, 디바이스들, 미디어, 및 프로 토콜들을 사용하여 제공자 시스템과 미디어 플레이어 디바이스(뿐만 아니라 명시적으로 도시되지 않 은 다른 미디어 플레이어 디바이스들) 사이에서 흐를 수 있다. 미디어 플레이어 디바이스는 제공자 시스템으로부터 수신된 가상 현실 미디어 콘텐트를 액세스하고 경험하기 위해 사용자에 의해 사용될 수 있다. 예를 들어, 미디어 플레이어 디바이스는 임의적 가상 밴티지 포인트(예컨대, 사용자에 의해 선택되고 가상 3D 공간 내에서의 임의적 가상 위치에 대응하는 동적으로 선택 가능한 가상 밴티지 포인트)로부터 사용자에 의해 경험될 가상 씬의 가상 3D 공간의 3D 표현을 생성하도록 구성될 수 있다(예컨대, 2D 비디오 데이터 스트림들일 수 있는, 수송 스트림 내에 포함된 가상 밴티지 포인트들의 각각에 대한 컬러 비디오 데이터 스트림 및 깊이 비디오 데이터 스트림에 기초하여). 이를 위해, 미디어 플레이어 디바이스는 몰입형 가상 현실 세계(예컨대, 가상 씬을 나타내는 몰입형 가상 현실 세계)의 시야를 제공하고 사용자가 몰입형 가상 현실 세계를 경험할 때 시야 내에 제공된 몰입 형 가상 현실 세계를 동적으로 업데이트하기 위해 사용자로부터 사용자 입력을 검출할 수 있는 임의의 디 바이스를 포함하거나 또는 그것에 의해 구현될 수 있다. 예를 들어, 도 9는 가상 현실 미디어 콘텐트를 경험하기 위해 사용자에 의해 사용될 수 있는 다양한 대표 적인 유형들의 미디어 플레이어 디바이스들을 도시한다. 구체적으로, 도시된 바와 같이, 미디어 플레이어 디바이스는 헤드-장착 디스플레이 스크린을 포함하는 헤드-장착 가상 현실 디바이스(예컨대, 가상 현 실 게이밍 디바이스), 개인용 컴퓨터 디바이스(예컨대, 데스크탑 컴퓨터, 랩탑 컴퓨터 등), 이동 또는 무 선 디바이스(예컨대, 가능하게는 헤드 장착 장치에 의해 사용자의 머리에 장착된, 스마트폰, 태블릿 디바이스 등)와 같은, 또는 가상 현실 미디어 콘텐트를 수신하고 및/또는 제공하는 것을 가능하게 하기 위해 특 정한 구현을 제공할 수 있는 임의의 다른 디바이스 또는 디바이스들의 구성에 의해 여러 상이한 형태 인자들 중 하나를 취할 수 있다. 상이한 유형들의 미디어 플레이어 디바이스들(예컨대, 헤드-장착 가상 현실 디바이스들, 개인용 컴퓨터 디바이스들, 이동 디바이스들 등)은 사용자에 대해 상이한 레벨들의 몰입감을 가진 상이한 유형들의 가상 현실 경험들을 제공할 수 있다. 도 10은 사용자가 가상 씬에 대하여 대표적인 임의적 가상 위치에 대응하는 동적으로 선택 가능한 가상 밴 티지 포인트로부터 경험되는 바와 같이 가상 씬을 나타내는 대표적인 가상 현실 미디어 콘텐트를 제공받는 대표 적인 가상 현실 경험을 예시한다. 구체적으로, 가상 현실 미디어 콘텐트는 샷이 이루어지는 가상 씬의 가상 3D 공간 내에서 농구대 바로 밑의 임의적 가상 위치에 대응하는 가상 밴티지 포인트로부터의 가상 씬 을 도시하는 시야 내에서 제공된다. 가상 씬에 기초한 몰입형 가상 현실 세계는 몰입형 가상 현실 세계를 돌아보고 및/또는 돌아다니기 위해(즉, 경험할 가상 밴티지 포인트를 동적으로 선택하기 위해) 사 용자 입력(예컨대, 머리 움직임들, 키보드 입력 등)을 제공함으로써 경험할 뷰어에 대해 이용 가능할 수 있다. 예를 들어, 시야는 사용자가 몰입형 가상 현실 세계를 쉽게 및 자연스럽게 돌아볼 수 있는 윈 도우를 제공할 수 있다. 시야는 미디어 플레이어 디바이스에 의해(예컨대, 미디어 플레이어 디바이 스의 디스플레이 스크린상에서) 제공될 수 있으며 몰입형 가상 현실 세계 내에서 사용자를 둘러싼 오브젝트들을 묘사한 비디오를 포함할 수 있다. 부가적으로, 시야는 사용자가 몰입형 가상 현실 세 계를 경험할 때 사용자에 의해 제공된 사용자 입력에 응답하여 동적으로 변할 수 있다. 예를 들어, 미디어 플레이어 디바이스는 사용자 입력(예컨대, 시야가 제공되는 디스플레이 스크린을 이동하거나 또는 도는)을 검출할 수 있다. 이에 응답하여, 시야는 이전 가상 밴티지 포인트 또는 가상 위치로부터 보 여진 오브젝트들 대신에 상이한 오브젝트들 및/또는 상이한 가상 밴티지 포인트 또는 가상 위치로부터 보여진 오브젝트들을 디스플레이할 수 있다. 도 10에서, 몰입형 가상 현실 세계는 사용자가 현재 선택한 농구대 하에서의 위치의 가상 밴티지 포 인트로부터 실질적으로 앞, 뒤, 좌측, 우측, 및/또는 위에 있는 몰입형 가상 현실 세계 내에서 임의의 방 향으로 볼 수 있음을 나타내는, 반구형으로서 예시된다. 다른 예들에서, 몰입형 가상 현실 세계는 사용자 가 또한 내려볼 수 있도록 180도 구에 의한 전체 360도를 포함할 수 있다. 부가적으로, 사용자는 몰 입형 가상 현실 세계 내에서의 다른 위치들로 돌아다닐 수 있다(즉, 가상 3D 공간 내에서의 상이한 동적 으로 선택 가능한 가상 밴티지 포인트들을 동적으로 선택한). 예를 들어, 사용자는 하프 코트에서의 가상 밴티지 포인트, 농구대를 향한 프리-드로우 라인으로부터의 가상 밴티지 포인트, 농구대 위에 매달린 가상 밴티 지 포인트 등을 선택할 수 있다. 도 11은 가상 씬의 가상 엔티티 디스크립션 프레임에 기초하여 상이한 밴티지 포인트들로부터 가상 씬의 프레임 들을 렌더링하기 위한 대표적인 방법을 예시한다. 도 11은 일 실시예에 따른 대표적인 동작들을 예시하지 만, 다른 실시예들은 도 11에 도시된 동작들 중 임의의 것을 생략하고, 부가하고, 재순서화하며, 및/또는 수정 할 수 있다. 도 11에 도시된 동작들 중 하나 이상은 시스템에 의해 및/또는 그것의 임의의 구현에 의해 수 행될 수 있다. 동작에서, 가상 씬 캡처 시스템은 가상 씬의 가상 3D 공간 내에 포함된 복수의 가상 엔티티들을 나타내는 데이터를 유지할 수 있다. 복수의 가상 엔티티들은 가상 3D 공간으로 가상 오브젝트 및 복수의 가상 밴티지 포인트들을 포함할 수 있다. 구체적으로, 예를 들어, 복수의 가상 밴티지 포인트들은 제 1 가상 밴티지 포인트 및 제 1 가상 밴티지 포인트와 상이한 제 2 가상 밴티지 포인트를 포함할 수 있다. 동작은 여기에서 설명된 방식들 중 임의의 것에서 수행될 수 있다. 동작에서, 가상 씬 캡처 시스템은 시간 시퀀스에서의 특정한 포인트에서 복수의 가상 엔티티들에서의 적 어도 하나의 가상 엔티티의 상태를 나타내는 가상 엔티티 디스크립션 프레임을 생성할 수 있다. 예를 들어, 가 상 씬 캡처 시스템은 복수의 가상 엔티티들을 나타내는 유지 데이터에 기초하여 가상 엔티티 디스크립션 프레임 을 생성할 수 있다. 동작은 여기에서 설명된 방식들 중 임의의 것에서 수행될 수 있다. 동작에서, 가상 씬 캡처 시스템은 동작에서 생성된 가상 엔티티 디스크립션 프레임을 콘텐트 제공 자 시스템과 연관된 복수의 서버-측 3D 렌더링 엔진들로 제공할 수 있다. 예를 들어, 가상 씬 캡처 시스템은 가 상 엔티티 디스크립션 프레임을 제 1 가상 밴티지 포인트와 연관되고, 가상 엔티티 디스크립션 프레임에 기초하 여, 시간 시퀀스에서의 특정한 포인트에서 제 1 가상 밴티지 포인트로부터 가시적인 가상 오브젝트의 표면들의 컬러 및 깊이 데이터를 나타내는 제 1 표면 데이터 프레임을 렌더링하도록 구성된 제 1 3D 렌더링 엔진으로 제 공할 수 있다. 게다가, 가상 씬 캡처 시스템은 제 2 가상 밴티지 포인트와 연관되며, 가상 엔티티 디스크립션 프레임에 기초하여, 시간 시퀀스에서의 특정한 포인트에서 제 2 가상 밴티지 포인트로부터 가시적인 가상 오브 젝트의 표면들의 컬러 및 깊이 데이터를 나타내는 제 2 표면 데이터 프레임을 렌더링하도록 구성된 제 2 3D 렌 더링 엔진으로 가상 엔티티 디스크립션 프레임을 제공할 수 있다. 동작은 여기에서 설명된 방식들 중 임 의의 것에서 수행될 수 있다. 특정한 실시예들에서, 여기에서 설명된 시스템들, 구성요소들, 및/또는 프로세스들 중 하나 이상은 하나 이상의 적절히 구성된 컴퓨팅 디바이스들에 의해 구현되고 및/또는 수행될 수 있다. 이를 위해, 상기 설명된 시스템들 및/또는 구성요소들 중 하나 이상은 여기에서 설명된 프로세스들 중 하나 이상을 수행하도록 구성된 적어도 하 나의 비-일시적 컴퓨터-판독 가능한 매체상에 구체화된 임의의 컴퓨터 하드웨어 및/또는 컴퓨터-구현된 지시들 (예컨대, 소프트웨어)을 포함하거나 또는 그것에 의해 구현될 수 있다. 특히, 시스템 구성요소들은 하나의 물리 적 컴퓨팅 디바이스 상에 구현될 수 있거나 또는 하나 이상의 물리적 컴퓨팅 디바이스 상에 구현될 수 있다. 따 라서, 시스템 구성요소들은 임의의 수의 컴퓨팅 디바이스들을 포함할 수 있으며, 다수의 컴퓨터 운영 시스템들 중 임의의 것을 이용할 수 있다. 특정한 실시예들에서, 여기에서 설명된 프로세스들 중 하나 이상은 비-일시적 컴퓨터-판독 가능한 매체에 구체 화되고 하나 이상의 컴퓨팅 디바이스들에 의해 실행 가능한 지시들로서 적어도 부분적으로 구현될 수 있다. 일 반적으로, 프로세서(예컨대, 마이크로프로세서)는, 비-일시적 컴퓨터-판독 가능한 매체(예컨대, 메모리 등)로부 터 지시들을 수신하며, 이들 지시들을 실행하고, 그에 의해 여기에서 설명된 프로세스들 중 하나 이상을 포함한, 하나 이상의 프로세스들을 수행한다. 이러한 지시들은 다양한 알려진 컴퓨터-판독 가능한 미디어 중 임 의의 것을 사용하여 저장되고 및/또는 송신될 수 있다. 컴퓨터-판독 가능한 매체(또한 프로세서-판독 가능한 매체로서 불리우는)는 컴퓨터에 의해(예컨대, 컴퓨터의 프 로세서에 의해) 판독될 수 있는 데이터(예컨대, 지시들)를 지시하는데 참여하는 임의의 비-일시적 매체를 포함 한다. 이러한 매체는, 이에 제한되지 않지만, 비-휘발성 미디어, 및/또는 휘발성 미디어를 포함한, 많은 형태들 을 취할 수 있다. 비-휘발성 미디어는, 예를 들어, 광학 또는 자기 디스크들 및 다른 영구 메모리를 포함할 수 있다. 휘발성 미디어는, 예를 들어, 통상적으로 메인 메모리를 구성하는, 동적 랜덤 액세스 메모리(\"DRAM\")를 포함할 수 있다. 일반적인 형태들의 컴퓨터-판독 가능한 미디어는, 예를 들어, 디스크, 하드 디스크, 자기 테이 프, 임의의 다른 자기 매체, 컴팩트 디스크 판독-전용 메모리(\"CD-ROM\"), 디지털 비디오 디스크(\"DVD\"), 임의의 다른 광학 매체, 랜덤 액세스 메모리(\"RAM\"), 프로그램 가능한 판독-전용 메모리(\"PROM\"), 전기적으로 삭제 가 능한 프로그램 가능 판독-전용 메모리(\"EPROM\"), FLASH-EEPROM, 임의의 다른 메모리 칩 또는 카트리지, 또는 컴 퓨터가 판독할 수 있는 임의의 다른 유형의 매체를 포함한다. 도 12는 구체적으로 여기에서 설명된 프로세스들 중 하나 이상을 수행하도록 구성될 수 있는 대표적인 컴퓨팅 디바이스를 예시한다. 도 12에 도시된 바와 같이, 컴퓨팅 디바이스는 통신 인터페이스, 프로 세서, 저장 디바이스, 및 통신 기반시설을 통해 통신 가능하게 연결된 입력/출력(\"I/O\") 모 듈을 포함할 수 있다. 대표적인 컴퓨팅 디바이스가 도 12에서 도시되지만, 도 12에 예시된 구성요 소들은 제한적이도록 의도되지 않는다. 부가적인 또는 대안적인 구성요소들은 다른 실시예들에서 사용될 수 있 다. 도 12에 도시된 컴퓨팅 디바이스의 구성요소들이 이제 더 상세하게 설명될 것이다. 통신 인터페이스는 하나 이상의 컴퓨팅 디바이스들과 통신하도록 구성될 수 있다. 통신 인터페이스(120 2)의 예들은, 제한 없이, 유선 네트워크 인터페이스(네트워크 인터페이스 카드와 같은), 무선 네트워크 인터페 이스(무선 네트워크 인터페이스 카드와 같은), 모뎀, 오디오/비디오 연결, 및 임의의 다른 적절한 인터페이스를 포함한다. 프로세서는 일반적으로 데이터를 프로세싱하거나 또는 여기에서 설명된 지시들, 프로세스들, 및/또는 동 작들 중 하나 이상의 실행을 해석하고, 실행하고, 및/또는 지시할 수 있는 임의의 유형 또는 형태의 프로세싱 유닛(예컨대, 중앙 프로세싱 유닛 및/또는 그래픽 프로세싱 유닛)을 나타낸다. 프로세서는 저장 디바이스 또는 또 다른 컴퓨터-판독 가능한 매체에 저장될 수 있는 바와 같이 하나 이상의 애플리케이션들 또는 다른 컴퓨터-실행 가능한 지시들에 따라 동작들의 실행을 지시할 수 있다. 저장 디바이스는 하나 이상의 데이터 저장 미디어, 디바이스들, 또는 구성들을 포함할 수 있으며 임의의 유형, 형태, 및 조합의 데이터 저장 미디어 및/또는 디바이스를 이용할 수 있다. 예를 들어, 저장 디바이스 는 이에 제한되지 않지만, 하드 드라이브, 네트워크 드라이브, 플래시 드라이브, 자기 디스크, 광학 디스 크, RAM, 동적 RAM, 다른 비-휘발성 및/또는 휘발성 데이터 저장 유닛들, 또는 그것의 조합 또는 서브-조합을 포함할 수 있다. 여기에서 설명된 데이터를 포함한, 전자 데이터는 저장 디바이스에 일시적으로 및/또는 영구적으로 저장될 수 있다. 예를 들어, 여기에서 설명된 동작들 중 임의의 것을 수행하도록 프로세서에 지시하기 위해 구성된 하나 이상의 실행 가능한 애플리케이션들을 나타내는 데이터는 저장 디바이스 내에 저장될 수 있다. 몇몇 예들에서, 데이터는 저장 디바이스 내에 존재하는 하나 이상의 데이터 베이스들에 배열될 수 있다. I/O 모듈은 사용자 입력을 수신하고 사용자 출력을 제공하도록 구성된 하나 이상의 I/O 모듈들을 포함할 수 있다. 하나 이상의 I/O 모듈들은 단일 가상 현실 경험을 위한 입력을 수신하기 위해 사용될 수 있다. I/O 모 듈은 입력 및 출력 능력들을 지원하는 임의의 하드웨어, 펌웨어, 소프트웨어, 또는 그것의 조합을 포함할 수 있다. 예를 들어, I/O 모듈은 이에 제한되지 않지만, 키보드 또는 키패드, 터치스크린 구성요소(예컨 대, 터치스크린 디스플레이), 수신기(예컨대, RF 또는 적외선 수신기), 모션 센서들, 및/또는 하나 이상의 입력 버튼들을 포함한, 사용자 입력을 캡처하기 위한 하드웨어 및/또는 소프트웨어를 포함할 수 있다. I/O 모듈은 이에 제한되지 않지만, 그래픽 엔진, 디스플레이(예컨대, 디스플레이 스크린), 하나 이상의 출력 드라이버들(예컨대, 디스플레이 드라이버들), 하나 이상의 오디오 스피커들, 및 하나 이상의 오디오 드라 이버들을 포함한, 사용자에게 출력을 제공하기 위한 하나 이상의 디바이스들을 포함할 수 있다. 특정한 실시예 들에서, I/O 모듈은 사용자로의 프리젠테이션을 위한 그래픽 데이터를 디스플레이로 제공하도록 구성된다. 그래픽 데이터는 특정한 구현을 제공할 수 있는 바와 같이 하나 이상의 그래픽 사용자 인터페이스들 및/또는 임의의 다른 그래픽 콘텐트를 나타낼 수 있다. 몇몇 예들에서, 여기에서 설명된 설비들 중 임의의 것은 컴퓨팅 디바이스의 하나 이상의 구성요소들에 의 해 또는 그것 내에 구현될 수 있다. 예를 들어, 저장 디바이스 내에 존재하는 하나 이상의 애플리케이션 들은 시스템(도 1 참조)의 가상 엔티티 상태 추적 설비 또는 가상 엔티티 디스크립션 프레임 설비와 연관된 하나 이상의 동작들 또는 기능들을 수행하도록 프로세서에 지시하기 위해 구성될 수 있다. 마찬가지로, 시스템의 저장 설비는 저장 디바이스에 의해 또는 그것 내에 구현될 수 있 다. 앞서 언급한 실시예들이 개개인들에 의해 제공된 개인 정보를 모으고, 저장하며, 및/또는 이용하는 정도로, 이 러한 정보는 개인 정보의 보호에 관한 모든 적용 가능한 법들에 따라 사용될 것이라는 것이 이해되어야 한다. 부가적으로, 이러한 정보의 수집, 저장, 및 사용은 예를 들어, 정보의 유형 및 상황에 대해 적절할 수 있는 바 와 같이 잘 알려진 \"옵트-인\" 또는 \"옵트-아웃\" 프로세스들을 통해, 이러한 활동에 대한 개인의 합의의 대상이 될 수 있다. 개인 정보의 저장 및 사용은, 예를 들어, 특히 민감한 정보에 대한 다양한 암호화 및 익명화를 통 해, 정보의 유형을 반영하는 적절하게 안전한 방식에 있을 수 있다. 이전 설명에서, 다양한 대표적인 실시예들은 수반된 도면들을 참조하여 설명되었다. 그러나, 이어지는 청구항들 에서 제시된 바와 같이 발명의 범위로부터 벗어나지 않고, 다양한 수정들 및 변화들이 이루어질 수 있으며, 부 가적인 실시예들이 구현될 수 있다는 것이 명백할 것이다. 예를 들어, 여기에서 설명된 일 실시예의 특정한 특 징들은 여기에서 설명된 또 다른 실시예와 조합되거나 또는 그것으로 대체될 수 있다. 설명 및 도면들은 따라서 제한적인 의미보다는 예시적인 것으로 간주될 것이다. 부호의 설명100: 가상 씬 캡처 시스템 102: 가상 엔티티 상태 추적 설비 104: 가상 엔티티 디스크립션 프레임 설비 106: 저장 설비 108: 가상 오브젝트 데이터 110: 가상 밴티지 포인트 데이터 202: 가상 씬 제어 시스템 204: 3D 렌더링 엔진 206: 가상 엔티티 디스크립션 프레임 208: 자산 저장 시스템 210: 표면 데이터 프레임 212: 비디오 데이터 패키징 시스템 300: 가상 씬 302: 가상 3D 공간 304: 가상 오브젝트 306: 가상 밴티지 포인트 402: 가상 오브젝트 404: 물리-기반 오브젝트 거동 500: 가상 엔티티 디스크립션 프레임 702: 프레임 시퀀스 804: 네트워크 806: 미디어 플레이어 디바이스 808: 사용자 902: 헤드-장착 가상 현실 디바이스 904: 개인용 컴퓨터 906: 이동 또는 무선 디바이스 1006: 몰입형 가상 현실 세계 1200: 컴퓨팅 디바이스 1202: 통신 인터페이스 1204: 프로세서 1206: 저장 디바이스 1208: I/O 모듈 1210: 통신 기반시설 1212: 애플리케이션도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12"}
{"patent_id": "10-2019-7035469", "section": "도면", "subsection": "도면설명", "item": 1, "content": "수반된 도면들은 다양한 실시예들을 예시하며 명세서의 일 부분이다. 예시된 실시예들은 단지 예들이며 개시의 범위를 제한하지 않는다. 도면들 전체에 걸쳐, 동일한 또는 유사한 참조 번호들은 동일한 또는 유사한 요소들을 지정한다. 도 1은 여기에서 설명된 원리들에 따른 가상 씬의 가상 엔티티 디스크립션 프레임에 기초하여 상이한 밴티지 포 인트들로부터 가상 씬의 프레임들을 렌더링하기 위한 대표적인 가상 씬 캡처 시스템을 예시하는 도면. 도 2는 도 1의 가상 씬 캡처 시스템이 여기에서 설명된 원리들에 따른 가상 씬의 가상 엔티티 디스크립션 프레 임에 기초하여 상이한 밴티지 포인트들로부터 가상 씬의 프레임들을 렌더링하는 것을 가능하게 하는 대표적인 구성을 예시하는 도면. 도 3은 여기에서 설명된 원리들에 따른 복수의 가상 엔티티들을 포함한 대표적인 가상 씬을 예시하는 도면. 도 4는 여기에서 설명된 원리들에 따른 도 3의 가상 씬에 대해 이루어질 수 있는 대표적인 수정들을 예시하는 도면. 도 5는 여기에서 설명된 원리들에 따른 도 1의 가상 씬 캡처 시스템에 의해 생성될 수 있는 대표적인 가상 엔티티 디스크립션 프레임들을 예시하는 도면. 도 6은 여기에서 설명된 원리들에 따른 대표적인 가상 엔티티 디스크립션 프레임에 기초하여 상이한 밴티지 포 인트들로부터 가시적인 가상 오브젝트들의 표면들의 컬러 및 깊이 데이터를 나타내는 표면 데이터 프레임들을 렌더링하는 대표적인 3차원(\"3D\") 렌더링 엔진들을 예시하는 도면. 도 7은 여기에서 설명된 원리들에 따른 상이한 밴티지 포인트들로부터 가시적인 대표적인 가상 오브젝트의 표면 들의 컬러 및 깊이 데이터를 나타내는 표면 데이터 프레임들의 복수의 대표적인 프레임 시퀀스들을 예시하는 도 면. 도 8은 대표적인 가상 현실 미디어 콘텐트 제공자 시스템이 여기에서 설명된 원리들에 따른 가상 씬을 경험하기 위해 사용자에 의해 사용된 대표적인 클라이언트-측 미디어 플레이어 디바이스로 네트워크에 의해 제공되는 가 상 현실 미디어 콘텐트를 생성하는 대표적인 구성을 예시하는 도면. 도 9는 여기에서 설명된 원리들에 따른 가상 현실 미디어 콘텐트를 경험하기 위해 사용자에 의해 사용될 수 있 는 다양한 대표적인 유형들의 미디어 플레이어 디바이스들을 예시하는 도면. 도 10은 사용자가 여기에서 설명된 원리들에 따른 가상 씬에 대하여 대표적인 임의적 가상 위치에 대응하는 동 적으로 선택 가능한 가상 밴티지 포인트로부터 경험되는 바와 같이 가상 씬을 나타내는 대표적인 가상 현실 미 디어 콘텐트를 제공받는 대표적인 가상 현실 경험을 예시하는 도면. 도 11은 여기에서 설명된 원리들에 따른 가상 씬의 가상 엔티티 디스크립션 프레임에 기초하여 상이한 밴티지 포인트들로부터 가상 씬의 프레임들을 렌더링하기 위한 대표적인 방법을 예시하는 도면. 도 12는 여기에서 설명된 원리들에 따른 대표적인 컴퓨팅 디바이스를 예시하는 도면."}
