{"patent_id": "10-2021-0161926", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0075596", "출원번호": "10-2021-0161926", "발명의 명칭": "폭염, 한파 재난 대응을 위한 쉼터 정보 시각화 시스템 및 이의 구동방법", "출원인": "주식회사 이엔지소프트", "발명자": "남상혁"}}
{"patent_id": "10-2021-0161926", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "시, 군, 구에서 읍, 면, 동까지 상세하게 지역을 선택하는 지역선택부와,상기 지역선택부에서 선택된 지역 및 주변에 위치한 쉼터를 지도에 표시하는 지도표시부와,상기 지도표시부에서 사용자가 원하는 쉼터를 선택하여 상세정보를 열람하는 쉼터위치표시부와,상기 지도표시부에서 선택된 지역 내의 전체 쉼터 정보를 데이터화하여 정보제공 및 분석 그래프를 사용자에게전달하는 쉼터정보부와,인공지능을 통해 분석된 폭염 또는 한파 위험도, 지역 내 취약계층 및 지역 내 쉼터 데이터를 기반으로 상기 지도표시부에 폭염 또는 한파 위험도가 상대적으로 높은 지역을 위험하다고 표시하는 위험지역 표시부를 포함하는폭염, 한파 재난 대응을 위한 쉼터 정보 시각화 시스템."}
{"patent_id": "10-2021-0161926", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,상기 위험지역 표시부는 상기 쉼터정보부에서 전달된 정보 및 현재 날씨 정보와 지역 열분포도 데이터를 통하여상기 지도표시부에 폭염 또는 한파 위험도를 격자형식으로 나누어 색상으로 표시하는 격자위험도를 구비하는 것을 특징으로 하는 폭염, 한파 재난 대응을 위한 쉼터 정보 시각화 시스템."}
{"patent_id": "10-2021-0161926", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2항에 있어서,상기 격자위험도는 폭염 또는 한파의 위험에 따른 상기 인공지능의 분석결과로 관심, 주의, 경계 및 심각 등급으로 색상을 표시하고,상기 격자위험도를 선택하면 해당 지역의 고령인구수, 유아인구수, 경로당 접근성, 노인 복지관 접근성 및 병원접근성 정보를 제공하는 것을 특징으로 하는 폭염, 한파 재난 대응을 위한 쉼터 정보 시각화 시스템."}
{"patent_id": "10-2021-0161926", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3항에 있어서,상기 쉼터정보부는 상기 지도표시부에 표시된 쉼터를 목록으로 나열하는 쉼터목록표와,상기 지도표시부에 표시된 쉼터의 최대 수용가능 인원과 지역 내 65세 이상 기초 생활수급자 인원을 비교하고,지역 내 온열/한랭질환자의 인원을 비교하는 수용가능 인원 그래프 및 온열/한랭질환자 발생 그래프를 구비하는것을 특징으로 하는 폭염, 한파 재난 대응을 위한 쉼터 정보 시각화 시스템."}
{"patent_id": "10-2021-0161926", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4항에 있어서,상기 쉼터목록표는 각각의 쉼터 운영시간 정보를 통해서 야간까지 운영하는 쉼터만 따로 표시하는 야간쉼터목록표와,각각의 쉼터 운영시간 정보를 통해서 주말까지 운영하는 쉼터만 따로 표시하는 주말쉼터목록표를 구비하는 것을특징으로 하는 폭염, 한파 재난 대응을 위한 쉼터 정보 시각화 시스템."}
{"patent_id": "10-2021-0161926", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5항에 있어서,상기 쉼터위치표시부는 상기 지역선택부에서 선택된 지역 내의 쉼터에 대하여 쉼터 명, 로드뷰, 면적, 상세 주공개특허 10-2023-0075596-3-소, 수용인원, 냉난방기의 종류와 개수, 전화번호 및 운영시간을 전달하는 것을 특징으로 하는 폭염, 한파 재난대응을 위한 쉼터 정보 시각화 시스템."}
{"patent_id": "10-2021-0161926", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "시, 군, 구에서 읍, 면, 동까지 지역을 선택하는 단계;선택된 지역을 기준으로 주변에 위치한 전체 쉼터를 지도에 표시하는 단계;표시된 지도에 나타낸 전체 쉼터 중에 사용자가 원하는 쉼터를 선택하여 상세정보를 열람하는 단계;선택된 지역 내의 전체 쉼터 정보를 데이터화하며 정보제공 및 분석 그래프를 사용자에게 전달하는 단계; 및인공지능을 통해 분석된 지역 내의 폭염 또는 한파 위험도, 취약계층의 인원수 및 전체 쉼터의 데이터를 기반으로 폭염 또는 한파 위험도가 상대적으로 높은 위험지역을 지도에 표시하는 단계;를 포함하는 폭염, 한파 재난대응을 위한 쉼터 정보 시각화 시스템의 구동방법."}
{"patent_id": "10-2021-0161926", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7항에 있어서,상기 위험지역을 지도에 표시하는 단계는상기 상세정보를 열람하는 단계에서 전달된 정보 및 현재 날씨 정보와 지역 열분포도 데이터를 통하여 상기 지도에 표시하는 단계에 폭염 또는 한파 위험도를 격자형식으로 나누어 색상으로 표시하는 격자위험도를 구비하는것을 특징으로 하는 폭염, 한파 재난 대응을 위한 쉼터 정보 시각화 시스템의 구동방법."}
{"patent_id": "10-2021-0161926", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8항에 있어서,상기 격자위험도는 폭염 또는 한파의 위험에 따른 상기 인공지능의 분석결과로 관심, 주의, 경계 및 심각 등급으로 색상을 표시하고,상기 격자위험도를 선택하면 해당 지역의 고령인구수, 유아인구수, 경로당 접근성, 노인 복지관 접근성 및 병원접근성 정보를 제공하는 것을 특징으로 하는 폭염, 한파 재난 대응을 위한 쉼터 정보 시각화 시스템의구동방법."}
{"patent_id": "10-2021-0161926", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9항에 있어서,상기 상세정보를 열람하는 단계는상기 지도에 표시하는 단계에 표시된 쉼터를 목록으로 나열하는 쉼터목록표와,상기 지도표시부에 표시된 쉼터의 최대 수용가능 인원과 지역 내 65세 이상 기초 생활수급자 인원을 비교하고,지역 내 온열/한랭질환자의 인원을 비교하는 수용가능 인원 그래프 및 온열/한랭질환자 발생 그래프를 구비하는것을 특징으로 하는 폭염, 한파 재난 대응을 위한 쉼터 정보 시각화 시스템의 구동방법."}
{"patent_id": "10-2021-0161926", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 10항에 있어서,상기 쉼터목록표는 각각의 쉼터 운영시간 정보를 통해서 야간까지 운영하는 쉼터만 따로 표시하는 야간쉼터목록표와,각각의 쉼터 운영시간 정보를 통해서 주말까지 운영하는 쉼터만 따로 표시하는 주말쉼터목록표를 구비하는 것을특징으로 하는 폭염, 한파 재난 대응을 위한 쉼터 정보 시각화 시스템의 구동방법."}
{"patent_id": "10-2021-0161926", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11항에 있어서,공개특허 10-2023-0075596-4-쉼터를 선택하여 상세정보를 열람하는 단계는선택된 쉼터에 대하여 쉼터 명, 로드뷰, 면적, 상세 주소, 수용인원, 냉난방기의 종류와 개수, 전화번호 및 운영시간을 전달하는 것을 특징으로 하는 폭염, 한파 재난 대응을 위한 쉼터 정보 시각화 시스템의 구동방법."}
{"patent_id": "10-2021-0161926", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명에 따른 폭염, 한파 재난 대응을 위한 쉼터 정보 시각화 시스템은 시, 군, 구에서 읍, 면, 동까지 상세하 게 지역을 선택하는 지역선택부와, 상기 지역선택부에서 선택된 지역 및 주변에 위치한 쉼터를 지도에 표시하는 지도표시부와, 상기 지도표시부에서 사용자가 원하는 쉼터를 선택하여 상세정보를 열람하는 쉼터위치표시부와, 상기 지도표시부에서 선택된 지역 내의 전체 쉼터 정보를 데이터화하여 정보제공 및 분석 그래프를 사용자에게 전달하는 쉼터정보부와, 인공지능을 통해 분석된 폭염 또는 한파 위험도, 지역 내 취약계층 및 지역 내 쉼터 데 이터를 기반으로 상기 지도표시부에 폭염 또는 한파 위험도가 상대적으로 높은 지역을 위험하다고 표시하는 위험 지역 표시부를 구비할 수 있다."}
{"patent_id": "10-2021-0161926", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 폭염, 한파 재난 대응을 위한 쉼터 정보 시각화 시스템 및 이의 구동방법에 관한 것으로, 더욱 상세 하게는 폭염 또는 한파에 대응하기 위해 주변에 위치한 쉼터의 정보를 사용자가 용이하게 습득할 수 있는 폭염, 한파 재난 대응을 위한 쉼터 정보 시각화 시스템 및 이의 구동방법에 관한 것이다."}
{"patent_id": "10-2021-0161926", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 지구온난화, 엘니뇨 현상 등 세계적인 기상이변과 함께 사회의 발전에 따른 도시의 복잡화 및 과밀화 등으 로 인해 재난 발생의 위험성이 증가하고 있고 그 규모도 점차적으로 커지고 있다. 특히, 폭염이나 한파에 대해서는 위험하다는 인식이 부족하여 더 큰 피해가 발생하기도 하며, 국가적으로 재난 으로 관리를 시작한 것이 얼마되지 않아 체계적인 대응 정보나 프로세스가 부족한 실정이기도 하다. 그래서, 폭염 발생의 지역별 특징과 피해 유형에 따라 차별화된 정책적 접근이 필요하다. 최근 연구 결과를 보 면 폭염발생 일수와 온열 질환자 수 사이의 관련성은 지자체별로 큰 차이를 보이고 있다. 폭염 다발 지역인 경 상북도와 대구 등은 상대적으로 적은 온열 질환자 발생 경향을 보인 반면, 특정 지역에서는 낮은 폭염 발생 일 수에 비해 상대적으로 높은 온열/한랭질환자 수가 나타나는 곳이 있어 이들 지자체별 정보 공유 및 차별화된 대 책 수립이 요구된다. 이에 따라, 각 지자체에서는 경로당, 노인시설, 주민 센터, 복지(회)관, 보건소, 마을회관, 면·동사무소, 정자, 공원 등 같은 기존의 시설을 쉼터로 지정하여 관리하고 있으며, 전국에 약 50,000개소의 쉼터가 지정되어 운영되고 있다. 그러나, 이와 같은 쉼터는 사용자에게 쉼터의 위치 및 상세정보를 전달하기가 어려워 활용도가 떨어지는 상황으 로 효율적인 관리 및 운영이 필요한 실정이다. 그리고 각 지자체별 폭염에 따른 대처방안을 공유하는 시스템이 없어 체계적인 대응 및 프로세스 정보를 공유하기가 어렵다는 문제점이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 국내 등록특허공보 제10-2204198호(2021.01.12.)"}
{"patent_id": "10-2021-0161926", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 폭염, 한파 등과 같은 자연재난에 대해 지역별 쉼터 정보를 사용자가 용이하게 확인할 수 있 는 폭염, 한파 재난 대응을 위한 쉼터 정보 시각화 시스템 및 이의 구동방법을 제공하는 것이다. 본 발명의 다른 목적은 지역별 쉼터의 위치 및 각 쉼터의 수용인원과 상기 지역별 취약계층의 인원을 시각화로 표현할 수 있는 폭염, 한파 재난 대응을 위한 쉼터 정보 시각화 시스템 및 이의 구동방법을 제공하는 것이다."}
{"patent_id": "10-2021-0161926", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 목적을 달성하기 위한 본 발명의 일측면에 따른 폭염, 한파 재난 대응을 위한 쉼터 정보 시각화 시 스템은 시, 군, 구에서 읍, 면, 동까지 상세하게 지역을 선택하는 지역선택부와, 상기 지역선택부에서 선택된 지역 및 주변에 위치한 쉼터를 지도에 표시하는 지도표시부와, 상기 지도표시부에서 사용자가 원하는 쉼터를 선 택하여 상세정보를 열람하는 쉼터위치표시부와, 상기 지도표시부에서 선택된 지역 내의 전체 쉼터 정보를 데이터화하여 정보제공 및 분석 그래프를 사용자에게 전달하는 쉼터정보부와, 인공지능을 통해 분석된 폭염 또는 한 파 위험도, 지역 내 취약계층 및 지역 내 쉼터 데이터를 기반으로 상기 지도표시부에 폭염 또는 한파 위험도가 상대적으로 높은 지역을 위험하다고 표시하는 위험지역 표시부를 구비할 수 있다. 상기 위험지역 표시부는 상기 쉼터정보부에서 전달된 정보 및 현재 날씨 정보와 지역 열분포도 데이터를 통하여 상기 지도표시부에 폭염 또는 한파 위험도를 격자형식으로 나누어 색상으로 표시하는 격자위험도를 구비할 수 있다. 상기 격자위험도는 폭염 또는 한파의 위험에 따른 상기 인공지능의 분석결과로 관심, 주의, 경계 및 심각 등급 으로 색상을 표시하고, 상기 격자위험도를 선택하면 해당 지역의 고령인구수, 유아인구수, 경로당 접근성, 노인 복지관 접근성 및 병원 접근성 정보를 제공할 수 있다. 상기 쉼터정보부는 상기 지도표시부에 표시된 쉼터를 목록으로 나열하는 쉼터목록표와, 상기 지도표시부에 표시 된 쉼터의 최대 수용가능 인원과 지역 내 65세 이상 기초 생활수급자 및 저소득 노인층의 인원을 비교하는 수용 가능 인원 그래프와, 상기 지도표시부에 표시된 지역 내 온열/한랭질환자의 인원을 연령별 및 성별로 비교하는 온열/한랭질환자 발생 그래프를 구비할 수 있다. 상기 쉼터목록표는 각각의 쉼터 운영시간 정보를 통해서 야간까지 운영하는 쉼터만 따로 표시하는 야간쉼터목록 표와, 각각의 쉼터 운영시간 정보를 통해서 주말까지 운영하는 쉼터만 따로 표시하는 주말쉼터목록표를 구비할 수 있다. 상기 쉼터위치표시부는 상기 지역선택부에서 선택된 지역 내의 쉼터에 대하여 쉼터 명, 로드뷰, 면적, 상세 주 소, 수용인원, 냉난방기의 종류와 개수, 전화번호 및 운영시간을 전달할 수 있다. 또한, 상기와 같은 목적을 달성하기 위한 본 발명의 일측면에 따른 폭염, 한파 재난 대응을 위한 쉼터 정보 시 각화 시스템의 구동방법은 시, 군, 구에서 읍, 면, 동까지 지역을 선택하는 단계; 선택된 지역을 기준으로 주변 에 위치한 전체 쉼터를 지도에 표시하는 단계; 표시된 지도에 나타낸 전체 쉼터 중에 사용자가 원하는 쉼터를 선택하여 상세정보를 열람하는 단계; 선택된 지역 내의 전체 쉼터 정보를 데이터화하며 정보제공 및 분석 그래 프를 사용자에게 전달하는 단계; 및 인공지능을 통해 분석된 지역 내의 폭염 또는 한파 위험도, 취약계층의 인 원수 및 전체 쉼터의 데이터를 기반으로 폭염 또는 한파 위험도가 상대적으로 높은 위험지역을 지도에 표시하는 단계;를 구비할 수 있다. 상기 위험지역을 지도에 표시하는 단계는 상기 상세정보를 열람하는 단계에서 전달된 정보 및 현재 날씨 정보와 지역 열분포도 데이터를 통하여 상기 지도에 표시하는 단계에 폭염 또는 한파 위험도를 격자형식으로 나누어 색 상으로 표시하는 격자위험도를 구비할 수 있다. 상기 격자위험도는 폭염 또는 한파의 위험에 따른 상기 인공지능의 분석결과로 관심, 주의, 경계 및 심각 등급 으로 색상을 표시하고, 상기 격자위험도를 선택하면 해당 지역의 고령인구수, 유아인구수, 경로당 접근성, 노인 복지관 접근성 및 병원 접근성 정보를 제공할 수 있다. 상기 상세정보를 열람하는 단계는 상기 지도에 표시하는 단계에 표시된 쉼터를 목록으로 나열하는 쉼터목록표와, 상기 지도에 표시하는 단계에 표시된 쉼터의 최대 수용가능 인원과 지역 내 65세 이상 기초 생활 수급자 및 저소득 노인층의 인원을 비교하는 수용가능 인원 그래프와, 상기 지도에 표시하는 단계에 표시된 지 역 내 온열/한랭질환자의 인원을 연령별 및 성별로 비교하는 온열/한랭질환자 발생 그래프를 구비할 수 있다. 상기 쉼터목록표는 각각의 쉼터 운영시간 정보를 통해서 야간까지 운영하는 쉼터만 따로 표시하는 야간쉼터목록 표와, 각각의 쉼터 운영시간 정보를 통해서 주말까지 운영하는 쉼터만 따로 표시하는 주말쉼터목록표를 구비할 수 있다. 쉼터를 선택하여 상세정보를 열람하는 단계는 선택된 쉼터에 대하여 쉼터 명, 로드뷰, 면적, 상세 주소, 수용인 원, 냉난방기의 종류와 개수, 전화번호 및 운영시간을 전달할 수 있다."}
{"patent_id": "10-2021-0161926", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 폭염, 한파 재난 대응을 위한 쉼터 정보 시각화 시스템 및 이의 구동방법에 의하면, 전국에 형 성된 쉼터의 정보를 데이터화하여 폭염 및 한파 시에 사용자가 네트워크 맵을 통하여 용이하게 정보를 습득할수 있다. 또한, 쉼터목록화에 표현되는 선택된 지역 내에 취약계층의 인원과 쉼터 수용가능 인원을 비교하는 그래프를 형 성하고, 상기 그래프를 기반으로 폭염 및 한파 재난에 대한 위험지역을 지도 내에서 표시할 수 있다."}
{"patent_id": "10-2021-0161926", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 첨부한 도면을 참조하여 본 발명의 일 실시예에 대해 상세하게 설명한다. 그러나 본 발명이 이러한 실시예에 한정되는 것은 아니며 다양한 형태로 변형될 수 있음은 물론이다. 도면에서는 본 발명을 명확하고 간략하게 설명하기 위하여 설명과 관계없는 부분의 도시를 생략하였으며, 명세 서 전체를 통하여 동일 또는 극히 유사한 부분에 대해서는 동일한 도면 참조부호를 사용한다. 그리고 도면에서 는 설명을 좀더 명확하게 하기 위하여 두께, 넓이 등을 확대 또는 축소하여 도시하였는바, 본 발명의 두께, 넓 이 등은 도면에 도시된 바에 한정되지 않는다. 그리고 명세서 전체에서 어떠한 부분이 다른 부분을 \"포함\"한다고 할 때, 특별히 반대되는 기재가 없는 한 다른 부분을 배제하는 것이 아니며 다른부분을 더 포함할 수 있다. 도 1은 본 발명에 따른 폭염, 한파 재난 대응을 위한 쉼터 정보 시각화 시스템의 모습을 나타낸 도면이고, 도 2 는 본 발명에 따른 폭염, 한파 재난 대응을 위한 쉼터 정보 시각화 시스템의 모습에서 사용자가 원하는 쉼터의 상세정보를 나타낸 도면이다. 도 1 내지 도 2에 도시된 바와 같이, 폭염, 한파 재난 대응을 위한 쉼터 정보 시각화 시스템은 시, 군, 구에서 읍, 면, 동까지 상세하게 지역을 선택하는 지역선택부와, 지역선택부에서 선택된 지역 및 주변에 위 치한 쉼터를 지도에 표시하는 지도표시부와, 지도표시부에서 사용자가 원하는 쉼터를 선택하여 상세 정보를 열람하는 쉼터위치표시부와, 지도표시부에서 선택된 지역 내의 전체 쉼터 정보를 데이터화하 여 정보제공 및 분석 그래프를 사용자에게 전달하는 쉼터정보부와, 인공지능을 통해 분석된 폭염 또는 한 파 위험도, 지역 내 취약계층 및 지역 내 쉼터 데이터를 기반으로 지도표시부에 폭염 또는 한파 위험도가 상대적으로 높은 지역을 위험하다고 표시하는 위험지역 표시부를 구비할 수 있다. 폭염, 한파 재난 대응을 위한 쉼터 정보 시각화 시스템은 PC Web에서 시각화된 화면을 보여주는 시각화 서버를 구비할 수 있다. 여기서, 지역선택부는 화면의 좌측 상단에 형성되어 전국지도가 간단하게 표현되고, 행정 구역 단위인 '시'와, '군'과, '구'를 선택한 다음에 '읍'과, '면'과, '동'까지 상세하게 선택해서 사용자가 원하는 지역의 정보를 습득할 수 있다. 지역선택부는 사용자가 최종적으로 선택한 지역에 영역표시를 추가적으로 표현하여 사용자가 자신이 선택 한 지역이 맞는지 바로 확인하는 선택위치표시를 구비할 수 있다. 지도표시부는 사용자가 검색을 원하는 지역을 선택한 다음에 화면의 중앙부에 지도를 시각화하고 사용자가 선택한 지역에서 원하는 위치로 움직일 수 있다. 지도표시부는 사용자가 원하는 지역이 선택되면, 선택된 지역 내에 위치한 시청, 구청 또는 군청을 기준으 로 반경 1~2km 내에 위치한 쉼터를 지도에 표시하며, 표시된 쉼터를 사용자가 한번 더 선택해 정보를 파악할 수 있다. 그리고, 지도표시부는 도청이나 주민센터를 기준으로 반경 1~2km 내에 위치한 쉼터를 지도에 표시할 수 있 으며, 취약계층이 이동할 수 있는 최대 거리를 2km로 반영할 수 있다. 지도표시부는 쉼터를 지도에서 빠르게 찾도록 각각의 쉼터가 있는 위치에 쉼터위치표시부가 표현되어 사용자가 선택할 수 있다. 쉼터위치표시부는 사용자가 지도표시부에서 쉼터위치창을 선택하고, 팝업창이 뜨면서 선택된 쉼 터의 명칭, 면적, 상세 주소, 수용인원, 냉난방기의 종류 및 개수, 전화번호 및 운영시간을 전달할 수 있다. 쉼터위치창은 지도표시부의 화면에 팝업창으로 뜨면서 지도표시부에 활성화를 잠시 꺼두고, 쉼 터위치표시부의 팝업창만 사용하도록 유도할 수 있으며, 팝업창의 일부에는 선택된 쉼터의 로드뷰를 확인하는 선택버튼이 위치될 수 있다. 쉼터위치창은 선택된 쉼터의 운영시간 뿐만 아니라, 야간운영 및 주말운영을 시행하는지 미리 확인하여 사 용자에게 용이하게 확인하도록 '체크표시' 또는 '미운영표시'를 시각화해서 전달할 수 있다. 쉼터위치창은 화면의 일부에 사용자가 선택한 쉼터의 실제 건물사진 및 3D형태의 화면을 확인하는 로드뷰 를 팝업창으로 선택하는 선택버튼이 구비되며, 로드뷰가 지도표시부에 팝업창으로 띄워져 사용 자가 직접 화면을 회전시키면서 쉼터의 주변을 미리 확인할 수 있다. 로드뷰 및 쉼터위치창은 지도표시부에 팝업창형태로 생성되며, 생성된 로드뷰 및 쉼터위치 창이 사용자에 의해 닫혀지기 전까지 지도표시부를 선택하지 못하도록 지도표시부의 선택기능을 잠시 막을 수 있다. 쉼터위치창은 선택된 쉼터의 야간 또는 주말 운영을 사용자가 용이하게 확인하도록 체크표시로 형성되는 야간운영표시칸 및 주말운영표시칸을 구비할 수 있다. 야간운영표시칸 및 주말운영표시칸은 선택된 쉼터의 운영시간을 야간에도 운영되는지를 판단하고 주 말에도 운영되는지를 판단하여 간한하게 체크표시할 수 있다. 쉼터정보부는 화면의 좌측 하단에 위치되어 상단에는 지역선택부가 형성될 수 있다. 쉼터정보부는 화면 아래쪽에 지역선택부에서 선택된 지역 내의 전체 쉼터를 사용자가 빠르게 파악하 도록 스크롤 방식으로 형성되며, 노출되는 정보는 쉼터명, 종류 및 로드뷰 선택을 표로 형성한 지역 내 쉼 터목록표를 구비할 수 있다. 쉼터목록표는 지도표시부의 전체 쉼터를 목록으로 나열하는 전체목록표와, 전체 쉼터 중 야간에 도 운영하는 쉼터를 목록으로 나열하는 야간목록표와, 전체 쉼터 중 주말에도 운영하는 쉼터를 목록으로 나열하는 주말목록표를 구비할 수 있다. 여기서, 쉼터목록표는 사용자가 원하는 목록표를 클릭하지 않았을 시, 기본적으로 전체목록표를 나타 낼 수 있다. 야간목록표 및 주말목록표는 각각의 목록표를 선택할 때마다 지도표시부에 목록표에만 나온 쉼 터만 쉼터위치표시부가 표시될 수 있다. 또한, 쉼터정보부는 화면 윗쪽에 쉼터위치표시부에서 전달된 쉼터의 수용가능인원 및 지역선택부 에서 선택된 지역 내의 65세 이상 기초 생활수급자 및 저소득 노인층의 인원수를 확인하고 서로 비교한 다 음, 비교된 내용을 그래프로 표현하는 수용가능 인원 그래프를 구비할 수 있다. 그리고, 수용가능 인원 그 래프는 후술할 위험지역 표시부에 비교한 데이터를 전달할 수 있다. 쉼터정보부는 지도표시부에 표시된 지역 내에 온열/한랭질환자가 발생한 인원을 연도별로 먼저 나누고, 각 각의 연도별 온열/한랭질환자 발생 인원 중에서 65세 이상 인원과 65세 미만 인원을 구분하여 표현하는 연령별 온열/한랭질환자 발생 그래프를 구비할 수 있다. 쉼터정보부는 각각의 연도별 온열/한랭질환자 발생 인원 중에서 남성과 여성을 구분하여 표현하는 성별 온 열/한랭질환자 발생 그래프를 구비할 수 있다. 위험지역 표시부는 인공지능을 통해 빠르게 선별되어 전국의 어느 지역을 선택하더라도 사용자가 지도표시 부에서 바로 파악할 수 있도록 동기화될 수 있다. 다음은 본 발명의 일 실시 예에 따른 폭염, 한파 재난 대응을 위한 쉼터 정보 시각화 시스템 중 위험지역 표시 부에 대하여 자세히 설명하도록 한다. 도 3은 본 발명에 따른 폭염, 한파 재난 대응을 위한 쉼터 정보 시각화 시스템의 모습에서 위험지역 표시부를 사용하고 격자위험도 등급을 나타낸 도면이고, 도 4는 본 발명에 따른 폭염, 한파 재난 대응을 위한 쉼터 정보 시각화 시스템 모습에서 위험도 예측 정보를 알려주는 것으로 현재 일을 기준으로 과거 정보는 60시간까지, 예 측 정보는 72시간까지 위험도 등급을 조회할 수 있도록 위험지역 표시부를 사용하고 격자위험도 등급을 나타낸 도면이다. 도 3 내지 도 4를 참고하면, 위험지역 표시부는 지도표시부에서 폭염 또는 한파에 위험하다고 판단되 는 지역을 사용자가 빠르게 파악할 수 있도록 지도에 위험지역을 격자형식으로 나누어 색상으로 표시하는 격자 위험도를 구비할 수 있다. 위험지역 표시부는 화면의 상단 우측에 위치되어 사용자가 원할 때에 작동하도록 ON/OFF 형태로 구비될 수 있다. 위험지역 표시부는 현재 날씨가 폭염 또는 한파인지 파악하고, 각각의 격자 지역마다 취약계층의 인원수와 쉼터의 최대 수용인원을 비교하여 모두 수용이 가능한지를 판단해서 격자위험도를 표시할 수 있다. 격자위험도는 폭염 또는 한파의 위험에 따른 인공지능의 결과로 관심, 주의, 경계 및 심각 등급으로 색상 을 표시하는 위험등급표시와, 격자위험도를 선택하면 해당 지역의 고령인구수, 유아인구수, 경로당 접근성, 노인 복지관 접근성 및 병원 접근성 정보를 제공하는 격자정보창을 구비할 수 있다. 격자위험도는 지도 위 폭염 또는 한파 분석정보를 보여주며, 격자 간격은 100mx100m 단위로 나누어져 각각 의 격자 정보를 시각화로 표출할 수 있다. 위험등급표시는 선택된 격자의 해당 지역에 현재 날씨에 따른 폭염 또는 한파 위험도를 열분포 데이터를 바탕으로 판단하여 관심등급, 주의등급, 경계등급 및 심각등급으로 표현할 수 있다. 상기 등급은 모두 색상으로 같이 표현되어 사용자가 빠르게 파악할 수 있다. 격자정보창은 선택된 격자의 해당 지역에 고령인구수, 유아인구수, 경로당접근성(거리), 노인 복지관 접근 성(거리), 노인 복지시설 접근성(거리) 및 병원 접근성(거리)를 빠르게 인공지능으로 계산하여 위험등급표시 와 함께 팝업형태로 표현될 수 있다. 격자정보창은 해당 격자를 바탕으로 근처 쉼터의 접근성을 사용자가 빠르게 파악하도록 유도할 수 있다. 추가적으로, 쉼터위치표시부는 지도표시부가 넓은 범위의 지역을 보여주고 있을 때, 한 지역에 많은 쉼터가 몰려있게 되면서 파란색 화살표가 집중되는 것을 방지하기 위해서 해당 지역에 원이 형성되고 상기 원 안에 해당 지역의 쉼터 갯수가 작성될 수 있다. 상기 원은 해당 지역에 쉼터가 많아질 수록 색상이 초록색-> 노란색 -> 주황색으로 점차 변해질 수 있다. 다음은 본 발명의 다른 실시 예에 따른 폭염, 한파 재난 대응을 위한 쉼터 정보 시각화 시스템의 구동방법에 대 해 자세히 설명하도록 한다. 이하에 설명에서는 상술한 실시 예와 서로 다른 부분만을 상세하게 설명하여 동일 하거나 극히 유사한 부분에 대해서는 상세한 설명을 생략한다. 도 4는 본 발명에 따른 폭염, 한파 재난 대응을 위한 쉼터 정보 시각화 시스템의 구동방법의 단계를 나타낸 블 록도이다.도 4를 참고하면, 본 발명에 따른 폭염, 한파 재난 대응을 위한 쉼터 정보 시각화 시스템의 구동방법은 시, 군, 구에서 읍, 면, 동까지 지역을 선택하는 단계(S100); 선택된 지역을 기준으로 주변에 위치한 전체 쉼터를 지도 에 표시하는 단계(S200); 표시된 지도에 나타낸 전체 쉼터 중에 사용자가 원하는 쉼터를 선택하여 상세정보를 열람하는 단계(S300); 선택된 지역 내의 전체 쉼터 정보를 데이터화하며 정보제공 및 분석 그래프를 사용자에게 전달하는 단계(S400); 및 인공지능을 통해 분석된 지역 내의 폭염 또는 한파 위험도, 취약계층의 인원수 및 전 체 쉼터의 데이터를 기반으로 폭염 또는 한파 위험도가 상대적으로 높은 위험지역을 지도에 표시하는 단계 (S500);를 구비할 수 있다. (S100) 단계는 전국지도가 간단하게 표현되고, 행정 구역 단위인 '시'와, '군'과, '구'를 선택한 다음에 '읍'과, '면'과, '동'까지 상세하게 선택해서 사용자가 원하는 지역의 정보를 습득할 수 있다. (S100) 단계는 사용자가 원하는 지역을 선택했는지 파악하기 위해, 선택된 지역을 지역선택부의 전국지도 에서 위치표시 및 지역부각을 표현시키는 선택위치표시를 구비할 수 있다. (S200) 단계는 선택된 지역 내에 위치한 시청, 도청, 구청, 군청 및 주민센터를 기준으로 반경 1~2km 내 쉼터를 지도에 표시할 수 있다. 또한, (S200) 단계는 사용자가 원하는 쉼터의 실제 건물사진 및 3D 지도로 표현되는 로드뷰를 팝업창 형태 로 띄울 수 있다. (S200) 단계는 지역선택부에서 선택된 지역의 지도에서 나타나는 쉼터를 모두 쉼터위치표시부로 간단 하게 표시할 수 있으며, 표시된 쉼터위치표시부는 사용자가 선택해 쉼터위치창을 팝업창으로 띄울 수 있다. (S200) 단계에서 선택된 지역에 데이터가 존재하지 않는지 확인하는 단계(S210)를 구비할 수 있다. 여기서, 해 당지역의 데이터가 존재한다면 선택된 지역의 쉼터를 지도에 표시하는 단계(S211)를 구비할 수 있다. 만약, (S210)단계에서 선택된 지역에 데이터가 존재하지 않을 경우, 선택된 지역보다 상위 지역의 쉼터를 지도 에 표시하는 단계(S212)를 구비할 수 있다. (S300) 단계는 선택된 지역 내의 전체 쉼터 중에서 사용자가 원하는 쉼터에 대하여 쉼터 명, 면적, 상세 주소, 수용인원, 냉난방기의 종류 및 개수, 전화번호 및 운영시간을 전달할 수 있다. (S300) 단계는 지도표시부에서 사용자에 의해 선택된 쉼터위치표시부에 상세한 정보를 전달하는 쉼터 위치창이 팝업되고, 쉼터위치창을 통해서 사용자가 선택한 쉼터의 상세정보 및 로드뷰까지 확인 할 수 있다. (S300) 단계는 각각의 쉼터 운영시간 정보를 통해서 야간까지 운영하는 쉼터만 따로 표시하는 야간쉼터목록표 와, 각각의 쉼터 운영시간 정보를 통해서 주말까지 운영하는 쉼터만 따로 표시하는 주말쉼터목록표를 구비할 수 있다. 다음으로, (S400) 단계는 선택된 지역 내의 전체 쉼터를 사용자가 확인하기 용이하도록 화면에 스크롤 방식으로 형성되고, 전체 쉼터의 상세정보 중에서 쉼터 최대 수용인원수를 확인하고, 선택된 지역 내의 65세 이상 기초 생활수급자 및 저소득 노인층의 인원수를 비교하는 수용가능 인원 그래프를 구비할 수 있다. (S400) 단계는 수용가능 인원 그래프를 쉼터정보부에 표현하여 사용자가 선택된 지역 내에 쉼터의 수 가 적절한지 또는 부족한지를 빠르게 파악할 수 있다. (S400) 단계에 표시된 지역 내 온열/한랭질환자의 인원을 연령별로 나열하는 그래프를 구비하는 연령별 온열/한 랭질환자 발생 그래프와, 지역 내 온열/한랭질환자의 인원을 성별로 비교하는 성별 온열/한랭질환자 발생 그래프를 구비할 수 있다. (S500) 단계는 인공지능을 통해서 선택된 지역 내의 폭염 또는 한파 위험도가 야외활동 기준을 초과하면서, 지 역 내에 65세 이상 기초 생활수급자 및 저소득 노인층의 인원수가 쉼터의 수용가능 인원을 초과하는 지역 선별 하고, 사용자가 위험지역을 빠르게 파악하도록 지도에 위험지역을 부각시켜 표현할 수 있다. 상기 위험지역을 지도에 표시하는 단계는 (S500) 단계는 상세정보를 열람하는 단계(S400)에서 전달된 정보 및 현재 날씨 정보와 지역 열분포도 데이터를 통하여 지도에 표시하는 단계(S200)에 폭염 또는 한파 위험도를 격자 형식으로 나누어 색상으로 표시하는 격자위험도를 구비할 수 있다. (S500) 단계는 먼저 지역선택부에서 선택된 지역의 폭염 또는 한파 위험도를 확인하여 데이터화 시키고, 쉼터위치표시부 및 쉼터정보부에 출력되는 지역 내의 쉼터 수용가능 인원수를 확인한 다음, 지도표시 부에 표현된 지도 내에 거주하는 65세 이상 기초 생활수급자 및 저소득 노인층의 인원수를 데이터화할 수 있다. 그리고, (S500) 단계는 데이터화 된 1) 폭염 또는 한파 위험도, 2) 지역 내 쉼터 수용가능 인원수 및 3) 지도 내 65세 이상 기초 생활수급자 및 저소득 노인층의 인원수를 비교하여, 선택된 지역에서 폭염 또는 한파 위험도 가 야외활동 기준을 초과하고 지역 내 쉼터 수용가능 인원수가 취약계층의 인원수 보다 부족할 경우에 위험지역 으로 판단되어 지도표시부에 위험지역을 알리는 위험등급표시와, 격자위험도를 선택하면 해당 지역의 고령인구수, 유아인구수, 경로당 접근성, 노인 복지관 접근성 및 병원 접근성 정보를 제공하는 격자정보 창을 구비할 수 있다. 다음은 본 발명의 일 실시 예에 따른 폭염, 한파 재난 대응을 위한 쉼터 정보 시각화 시스템의 구동방법 중 (S500) 단계에 대하여 자세히 설명하도록 한다. 도 5는 도 4에서 폭염, 한파 재난 대응을 위한 쉼터 정보 시각화 시스템의 구동방법 중 위험지역을 표시하는 단 계를 순서대로 나타낸 순서도이다. 도 5를 참고하면, (S500) 단계는 지도표시부에 형성된 격자위험도가 켜져있는지 확인하는 단계(S51 0)와, 격자위험도가 켜져있으면 지도표시부에 지도를 격자형식으로 나누는 단계(S511)와, 현재 날씨 에 따른 폭염 또는 한파 위험도를 확인하는 단계(S520)와, 지도표시부에서 선택된 지역 내의 취약계층의 인원수와 쉼터의 최대 수용인원을 비교하는 단계(S530)와, 각각의 격자별 폭염 또는 한파 위험도 및 수용인원 비교하여 분석한 후에 관심, 주의, 경계 및 심각 등급으로 분류하여 색상으로 표시하는 단계(S540)를 구비할 수 있다. (S510) 단계는 지역선택부에서 선택된 지역의 폭염 또는 한파 위험도를 인공지능 분석결과를 통해 격자 지 역의 취약 인구, 노인 복지 및 위생 관련 시설, 노인 치료 시설 및 야외활동 기준에 적합하는지를 판단하기 위 해 데이터를 미리 정리할 수 있다. 그리고, (S510) 단계는 지도표시부에 구비된 위험지역 표시부에 활성화 체크가 선택되었는지 판단하 는 (S511) 단계와, (S512) 단계를 구비할 수 있다. (S511) 단계는 사용자가 지도표시부에 형성된 격자위험도를 ON 버튼을 클릭했을 때, 지도를 격자형식 으로 나눌 수 있다. (S520) 단계는 인공지능이 현재 날씨에 따른 폭염 또는 한파 위험도를 확인할 수 있다. (S530) 단계는 지도표시부에 선택된 지역 내의 취약계층 인원수와 쉼터의 최대 수용인원을 비교하고, 각각 의 격자표시영역 마다 상기 데이터를 전달할 수 있다. (S540) 단계는 각각의 격자표시영역별 분석정보를 관심, 주의, 경고 및 위험 등급 중 어느 하나의 등급으로 분 류한 다음, 각각의 등급 색상에 맞게 지도표시부에 표현될 수 있다. 이를 통해, 전국에 형성된 쉼터의 정보를 데이터화하여 사용자가 화면을 통해서 빠르게 폭염 및 한파 주의보에 서 주변에 위치한 쉼터의 상세정보를 확인하는 네트워크 맵을 구비할 수 있다. 이상에서는 본 발명의 실시 예에 따른 폭염, 한파 재난 대응을 위한 쉼터 정보 시각화 시스템 및 이의 구동방법 에 대해 설명하였으나, 본 발명의 사상은 본 명세서에 제시되는 실시 예에 제한되지 아니한다. 그리고, 본 발명 의 사상을 이해하는 당업자는 동일한 사상의 범위 내에서, 구성요소의 부가, 변경, 삭제, 추가 등에 의해서 다른 실시 예를 용이하게 제안할 수 있을 것이나, 이 또한 본 발명의 사상범위 내에 든다고 할 것이다."}
{"patent_id": "10-2021-0161926", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 폭염, 한파 재난 대응을 위한 쉼터 정보 시각화 시스템의 모습을 나타낸 도면. 도 2는 본 발명에 따른 폭염, 한파 재난 대응을 위한 쉼터 정보 시각화 시스템의 모습에서 사용자가 원하는 쉼 터의 상세정보를 나타낸 도면. 도 3은 본 발명에 따른 폭염, 한파 재난 대응을 위한 쉼터 정보 시각화 시스템의 모습에서 위험지역 표시부를 사용하고 격자위험도 등급을 나타낸 도면. 도 4는 본 발명에 따른 폭염, 한파 재난 대응을 위한 쉼터 정보 시각화 시스템 모습에서 위험도 예측 정보를 알 려주는 것으로 현재 일을 기준으로 과거 정보는 60시간까지, 예측 정보는 72시간까지 위험도 등급을 조회할 수 있도록 위험지역 표시부를 사용하고 격자위험도 등급을 나타낸 도면. 도 5는 본 발명에 따른 폭염, 한파 재난 대응을 위한 쉼터 정보 시각화 시스템의 구동방법의 단계를 나타낸 블 록도. 도 6은 도 5에서 폭염, 한파 재난 대응을 위한 쉼터 정보 시각화 시스템의 구동방법 중 위험지역을 표시하는 단 계를 순서대로 나타낸 순서도."}
