{"patent_id": "10-2018-0107642", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0029465", "출원번호": "10-2018-0107642", "발명의 명칭": "반도체 제조 장비에 대한 사용자 상호작용을 자동화하기 위한 시스템 및 방법", "출원인": "램 리써치 코포레이션", "발명자": "운터구겐버거, 래이너"}}
{"patent_id": "10-2018-0107642", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "기판을 프로세싱하도록 구성된 복수의 프로세스 모듈들을 포함하는 기판 프로세싱 툴의 상태를 수신하도록 구성된 인터페이스; 및 상기 상태에 기초하여 상기 인터페이스로부터 상기 기판 프로세싱 툴에 의해 이전에 수신된 입력과 상기 상태를상관시키고 상기 상관에 기초하여 상기 기판 프로세싱 툴을 제어하기 위한 출력을 생성하는 제어기를 포함하는,시스템."}
{"patent_id": "10-2018-0107642", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 상기 제어기는 상기 기판 프로세싱 툴의 복수의 상태들 및 상기 복수의 상태들에 기초하여 상기 기판 프로세싱툴에 의해 수신된 대응하는 입력들을 데이터베이스에 저장하고, 그리고 상기 데이터베이스를 사용하여 상기 상관을 수행하도록 구성되는, 시스템."}
{"patent_id": "10-2018-0107642", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서, 상기 제어기는 하나 이상의 상기 기판 프로세싱 툴 및 부가적인 기판 프로세싱 툴과 연관된 이력 데이터에 기초하여 상기 데이터베이스를 업데이트하고, 그리고 상기 업데이트된 데이터베이스를 사용하여 상기 상관을 수행하도록 구성되는, 시스템."}
{"patent_id": "10-2018-0107642", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 2 항에 있어서, 상기 제어기는 부가적인 기판 프로세싱 툴과 연관된 데이터를 상기 데이터베이스에 저장하고, 그리고 상기 데이터를 사용하여 상기 상관을 수행하도록 구성되고, 상기 데이터는 상기 부가적인 기판 프로세싱 툴의 상태들 및상기 상태들에 기초하여 상기 부가적인 기판 프로세싱 툴에 의해 수신된 대응하는 입력들을 포함하는, 시스템."}
{"patent_id": "10-2018-0107642", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서, 상기 기판 프로세싱 툴의 상기 상태는 상기 기판 프로세싱 툴과 연관된 에러를 나타내는 데이터를 포함하고, 그리고 상기 입력은 상기 에러에 대한 응답을 나타내는 데이터를 포함하는, 시스템."}
{"patent_id": "10-2018-0107642", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서, 상기 기판 프로세싱 툴의 상기 상태는 상기 기판 프로세싱 툴과 연관된 임박한 에러를 나타내는 데이터를 포함하고, 그리고 상기 입력은 상기 에러를 방지하기 위한 응답을 나타내는 데이터를 포함하는, 시스템."}
{"patent_id": "10-2018-0107642", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서, 상기 제어기는 상기 기판 프로세싱 툴의 오퍼레이터의 존재를 검출하고 그리고 상기 출력에 기초하여 상기 오퍼레이터에 의해 수신된 응답에 따라 상기 기판 프로세싱 툴을 제어하도록 구성되는, 시스템."}
{"patent_id": "10-2018-0107642", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "공개특허 10-2019-0029465-3-제 1 항에 있어서, 상기 제어기는 상기 기판 프로세싱 툴의 오퍼레이터의 부재를 검출하고 그리고 상기 출력에 기초하여 상기 오퍼레이터의 상기 부재시 상기 기판 프로세싱 툴을 제어하도록 구성되는, 시스템."}
{"patent_id": "10-2018-0107642", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1 항에 있어서, 상기 제어기는 상기 기판 프로세싱 툴의 오퍼레이터의 부재를 검출하고 그리고 상기 출력에 대해 상기 오퍼레이터에게 통보하도록 구성되는, 시스템."}
{"patent_id": "10-2018-0107642", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 1 항에 있어서, 상기 제어기는 상기 기판의 프로세싱의 완료를 보장하고, 상기 기판에 대한 대미지를 방지하고, 그리고 상기 프로세스 모듈들의 유휴를 방지하도록 상기 출력에 기초하여 상기 기판 프로세싱 툴을 제어하도록 구성되는, 시스템."}
{"patent_id": "10-2018-0107642", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 1 항에 있어서, 상기 제어기는 상기 프로세스 모듈들에 의해 상기 기판의 프로세싱의 스케줄링을 최적화하도록 상기 출력에 기초하여 상기 기판 프로세싱 툴을 제어하도록 구성되는, 시스템."}
{"patent_id": "10-2018-0107642", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "기판을 프로세싱하도록 구성된 복수의 프로세스 모듈들을 포함하는 기판 프로세싱 툴의 상태를 수신하는 단계;상기 상태에 기초하여 상기 기판 프로세싱 툴에 의해 이전에 수신된 입력과 상기 상태를 상관시키는 단계; 및상기 상관에 기초하여 상기 기판 프로세싱 툴을 제어하도록 출력을 생성하는 단계를 포함하는, 방법."}
{"patent_id": "10-2018-0107642", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 12 항에 있어서, 상기 기판 프로세싱 툴의 복수의 상태들 및 상기 복수의 상태들에 기초하여 상기 기판 프로세싱 툴에 의해 수신된 대응하는 입력들을 데이터베이스에 저장하는 단계; 및상기 데이터베이스를 사용하여 상기 상관을 수행하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2018-0107642", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13 항에 있어서, 하나 이상의 상기 기판 프로세싱 툴 및 부가적인 기판 프로세싱 툴과 연관된 이력 데이터에 기초하여 상기 데이터베이스를 업데이트하는 단계; 및 상기 업데이트된 데이터베이스를 사용하여 상기 상관을 수행하는 단계를 포함하는, 방법."}
{"patent_id": "10-2018-0107642", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 13 항에 있어서, 부가적인 기판 프로세싱 툴과 연관된 데이터를 상기 데이터베이스에 저장하는 단계로서, 상기 데이터는 상기 부가적인 기판 프로세싱 툴의 상태들 및 상기 상태들에 기초하여 상기 부가적인 기판 프로세싱 툴에 의해 수신된대응하는 입력들을 포함하는, 상기 저장하는 단계; 및상기 데이터를 사용하여 상기 상관을 수행하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2018-0107642", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "공개특허 10-2019-0029465-4-제 12 항에 있어서, 상기 기판 프로세싱 툴의 상기 상태는 상기 기판 프로세싱 툴과 연관된 에러를 나타내는 데이터를 포함하고, 그리고 상기 입력은 상기 에러에 대한 응답을 나타내는 데이터를 포함하는, 방법."}
{"patent_id": "10-2018-0107642", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 12 항에 있어서, 상기 기판 프로세싱 툴의 상기 상태는 상기 기판 프로세싱 툴과 연관된 임박한 에러를 나타내는 데이터를 포함하고, 그리고 상기 입력은 상기 에러를 방지하기 위한 응답을 나타내는 데이터를 포함하는, 방법."}
{"patent_id": "10-2018-0107642", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 12 항에 있어서, 상기 기판 프로세싱 툴의 오퍼레이터의 존재를 검출하는 단계; 및 상기 출력에 기초하여 상기 오퍼레이터에 의해 수신된 응답에 따라 상기 기판 프로세싱 툴을 제어하는 단계를더 포함하는, 방법."}
{"patent_id": "10-2018-0107642", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 12 항에 있어서,상기 기판 프로세싱 툴의 오퍼레이터의 부재를 검출하는 단계; 및 상기 출력에 기초하여 상기 오퍼레이터의 부재시 상기 기판 프로세싱 툴을 제어하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2018-0107642", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 12 항에 있어서, 상기 기판 프로세싱 툴의 오퍼레이터의 부재를 검출하는 단계; 및 상기 출력에 관해 상기 오퍼레이터에게 통보하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2018-0107642", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제 12 항에 있어서,상기 기판의 프로세싱의 완료를 보장하고, 상기 기판에 대한 대미지를 방지하고, 그리고 상기 프로세스 모듈들의 유휴를 방지하도록 상기 출력에 기초하여 상기 기판 프로세싱 툴을 제어하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2018-0107642", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제 12 항에 있어서, 상기 프로세스 모듈들에 의한 상기 기판의 프로세싱의 스케줄링을 최적화하도록 상기 출력에 기초하여 상기 기판 프로세싱 툴을 제어하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2018-0107642", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "프로세서; 및유형의 머신 판독가능 매체 상에 저장된 머신 판독가능 인스트럭션들을 포함하고,상기 머신 판독가능 인스트럭션들은, 상기 프로세서에 의해 실행될 때, 기판을 프로세싱하도록 구성된 복수의 프로세스 모듈들을 포함하는 기판 프로세싱 툴의 상태를 수신하고, 상기 상태에 기초하여 상기 기판 프로세싱 툴에 의해 이전에 수신된 입력과 상기 상태를 상관시키고, 그리고 상기 상관에 기초하여 상기 기판 프로세싱 툴을 제어하도록 출력을 생성하도록, 상기 프로세서를 구성하는, 시스템.공개특허 10-2019-0029465-5-청구항 24 제 23 항에 있어서, 상기 머신 판독가능 인스트럭션들은, 상기 기판 프로세싱 툴의 복수의 상태들 및 상기 복수의 상태들에 기초하여 상기 기판 프로세싱 툴에 의해 수신된 대응하는 입력들을 데이터베이스에 저장하고, 그리고 상기 데이터베이스를 사용하여 상기 상관을 수행하도록 상기 프로세서를 구성하는, 시스템."}
{"patent_id": "10-2018-0107642", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제 24 항에 있어서, 상기 머신 판독가능 인스트럭션들은, 하나 이상의 상기 기판 프로세싱 툴 및 부가적인 기판 프로세싱 툴과 연관된 이력 데이터에 기초하여 상기 데이터베이스를 업데이트하고, 그리고 상기 업데이트된 데이터베이스를 사용하여 상기 상관을 수행하도록 상기 프로세서를 구성하는, 시스템."}
{"patent_id": "10-2018-0107642", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "제 24 항에 있어서, 상기 머신 판독가능 인스트럭션들은, 부가적인 기판 프로세싱 툴과 연관된 데이터를 상기 데이터베이스에 저장하고, 그리고상기 데이터를 사용하여 상기 상관을 수행하도록 상기 프로세서를 구성하고, 상기 데이터는 상기 부가적인 기판 프로세싱 툴의 상태들 및 상기 상태들에 기초하여 상기 부가적인 기판 프로세싱 툴에 의해 수신된 대응하는 입력들을 포함하는, 시스템."}
{"patent_id": "10-2018-0107642", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "제 23 항에 있어서, 상기 기판 프로세싱 툴의 상태는 상기 기판 프로세싱 툴과 연관된 에러를 나타내는 데이터를 포함하고, 그리고상기 입력은 상기 에러에 대한 응답을 나타내는 데이터를 포함하는, 시스템."}
{"patent_id": "10-2018-0107642", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_28", "content": "제 23 항에 있어서, 상기 기판 프로세싱 툴의 상기 상태는 상기 기판 프로세싱 툴과 연관된 임박한 에러를 나타내는 데이터를 포함하고, 그리고 상기 입력은 상기 에러를 방지하기 위한 응답을 나타내는 데이터를 포함하는, 시스템."}
{"patent_id": "10-2018-0107642", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "제 23 항에 있어서, 상기 머신 판독가능 인스트럭션들은, 상기 기판 프로세싱 툴의 오퍼레이터의 존재를 검출하고, 그리고상기 출력에 기초하여 상기 오퍼레이터에 의해 수신된 응답에 따라 상기 기판 프로세싱 툴을 제어하도록 상기프로세서를 구성하는, 시스템."}
{"patent_id": "10-2018-0107642", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_30", "content": "제 23 항에 있어서, 상기 머신 판독가능 인스트럭션들은, 공개특허 10-2019-0029465-6-상기 기판 프로세싱 툴의 오퍼레이터의 부재를 검출하고, 그리고상기 출력에 기초하여 상기 오퍼레이터의 부재시 상기 기판 프로세싱 툴을 제어하도록 상기 프로세서를 구성하는, 시스템."}
{"patent_id": "10-2018-0107642", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_31", "content": "제 23 항에 있어서, 상기 머신 판독가능 인스트럭션들은, 상기 기판 프로세싱 툴의 오퍼레이터의 부재를 검출하고, 그리고 상기 출력에 관해 상기 오퍼레이터에게 통보하도록 상기 프로세서를 구성하는, 시스템."}
{"patent_id": "10-2018-0107642", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_32", "content": "제 23 항에 있어서, 상기 머신 판독가능 인스트럭션들은, 상기 기판의 프로세싱의 완료를 보장하고, 상기 기판에 대한 대미지를 방지하고, 그리고 상기 프로세스 모듈들의 유휴를 방지하도록 상기 출력에 기초하여 상기 기판 프로세싱 툴을 제어하도록 상기 프로세서를 구성하는, 시스템."}
{"patent_id": "10-2018-0107642", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_33", "content": "제 23 항에 있어서, 상기 머신 판독가능 인스트럭션들은, 상기 프로세스 모듈들에 의한 상기 기판의 프로세싱의 스케줄링을 최적화하도록 상기 출력에 기초하여 상기 기판 프로세싱 툴을 제어하도록 상기 프로세서를 구성하는, 시스템."}
{"patent_id": "10-2018-0107642", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "시스템은 인터페이스 및 제어기를 포함한다. 인터페이스는 기판을 프로세싱하도록 구성된 복수의 프로세스 모듈 들을 포함하는 기판 프로세싱 툴의 상태를 수신하도록 구성된다. 제어기는 이 상태에 기초하여 인터페이스로부 터 기판 프로세싱 툴에 의해 이전에 수신된 입력과 이 상태를 상관시키고 이 상관에 기초하여 기판 프로세싱 툴 을 제어하기 위한 입력을 생성하도록 구성된다."}
{"patent_id": "10-2018-0107642", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 일반적으로 반도체 제조 장비, 보다 구체적으로 인공 지능을 통해 반도체 제조 장비에 대한 사용자 상호작용들을 자동화하는 것에 관한 것이다."}
{"patent_id": "10-2018-0107642", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "본 명세서에 제공된 배경기술 설명은 일반적으로 본 개시의 맥락을 제공하기 위한 것이다. 본 발명자들의 성과"}
{"patent_id": "10-2018-0107642", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "로서 본 배경기술 섹션에 기술되는 정도의 성과 및 출원시 종래 기술로서 인정되지 않을 수도 있는 기술의 양태 들은 본 개시에 대한 종래 기술로서 명시적으로나 암시적으로 인정되지 않는다. 반도체 프로세싱 시스템은 통상적으로 반도체 웨이퍼들과 같은 기판들의 증착, 에칭 및 다른 처리를 수행하기 위한 복수의 프로세싱 챔버들 (또한 프로세스 모듈들이라고 함) 을 포함한다. 프로세싱 동안, 기판은 기판 프 로세싱 시스템의 프로세싱 챔버 내 기판 지지부 상에 배치된다. 증착 동안, 하나 이상의 전구체들을 포함하는 가스 혼합물들이 프로세싱 챔버 내로 도입되고, 플라즈마가 화학 반응들을 활성화하도록 스트라이킹될 수도 있 다. 에칭 동안, 에칭 가스들을 포함하는 가스 혼합물들이 도입되고, 플라즈마가 화학 반응들을 활성화하도록 스트라이킹될 수도 있다. 컴퓨터 제어된 로봇은 통상적으로 일 프로세싱 챔버로부터 반도체 기판들이 프로세싱 되는 후속하는 또 다른 프로세싱 챔버로 반도체 기판들을 이송한다. 시스템은 인터페이스 및 제어기를 포함한다. 인터페이스는 기판을 프로세싱하도록 구성된 복수의 프로세스 모 듈들을 포함하는 기판 프로세싱 툴의 상태를 수신하도록 구성된다. 제어기는 이 상태에 기초하여 인터페이스로 부터 기판 프로세싱 툴에 의해 이전에 수신된 입력과 이 상태를 상관시키고 이 상관에 기초하여 기판 프로세싱 툴을 제어하기 위한 출력을 생성하도록 구성된다. 다른 특징들에서, 제어기는 기판 프로세싱 툴의 복수의 상태들 및 복수의 상태들에 기초하여 기판 프로세싱 툴 에 의해 수신된 대응하는 입력들을 데이터베이스에 저장하고, 그리고 데이터베이스를 사용하여 상관을 수행하도 록 구성된다. 다른 특징들에서, 제어기는 하나 이상의 기판 프로세싱 툴 및 부가적인 기판 프로세싱 툴과 연관된 이력 데이터 에 기초하여 데이터베이스를 업데이트하고, 그리고 업데이트된 데이터베이스를 사용하여 상관을 수행하도록 구 성된다. 다른 특징들에서, 제어기는 부가적인 기판 프로세싱 툴과 연관된 데이터를 데이터베이스에 저장하고, 그리고 데 이터를 사용하여 상관을 수행하도록 구성되고, 데이터는 부가적인 기판 프로세싱 툴의 상태들 및 상태들에 기초 하여 부가적인 기판 프로세싱 툴에 의해 수신된 대응하는 입력들을 포함한다. 다른 특징들에서, 기판 프로세싱 툴의 상태는 기판 프로세싱 툴과 연관된 에러를 나타내는 데이터를 포함하고, 그리고 입력은 에러에 대한 응답을 나타내는 데이터를 포함한다. 다른 특징들에서, 기판 프로세싱 툴의 상태는 기판 프로세싱 툴과 연관된 임박한 에러를 나타내는 데이터를 포 함하고, 그리고 입력은 에러를 방지하기 위한 응답을 나타내는 데이터를 포함한다. 다른 특징들에서, 제어기는 기판 프로세싱 툴의 오퍼레이터의 존재를 검출하고 그리고 출력에 기초하여 오퍼레 이터에 의해 수신된 응답에 따라 기판 프로세싱 툴을 제어하도록 구성된다. 다른 특징들에서, 제어기는 기판 프로세싱 툴의 오퍼레이터의 부재를 검출하고 그리고 출력에 기초하여 오퍼레 이터의 부재시 기판 프로세싱 툴을 제어하도록 구성된다. 다른 특징들에서, 제어기는 기판 프로세싱 툴의 오퍼레이터의 부재를 검출하고 그리고 출력에 대해 오퍼레이터 에게 통보하도록 구성된다. 다른 특징들에서, 제어기는 기판의 프로세싱의 완료를 보장하고, 기판에 대한 대미지를 방지하고, 그리고 프로 세스 모듈들의 유휴를 방지하도록 출력에 기초하여 기판 프로세싱 툴을 제어하도록 구성된다. 다른 특징들에서, 제어기는 프로세스 모듈들에 의해 기판의 프로세싱의 스케줄링을 최적화하도록 출력에 기초하 여 기판 프로세싱 툴을 제어하도록 구성된다. 또 다른 특징들에서, 방법은 기판을 프로세싱하도록 구성된 복수의 프로세스 모듈들을 포함하는 기판 프로세싱 툴의 상태를 수신하는 단계를 포함한다. 방법은 상태에 기초하여 기판 프로세싱 툴에 의해 이전에 수신된 입력 과 상태를 상관시키는 단계를 더 포함한다. 방법은 상관에 기초하여 기판 프로세싱 툴을 제어하도록 출력을 생 성하는 단계를 더 포함한다. 다른 특징들에서, 방법은 기판 프로세싱 툴의 복수의 상태들 및 복수의 상태들에 기초하여 기판 프로세싱 툴에 의해 수신된 대응하는 입력들을 데이터베이스에 저장하는 단계를 더 포함한다. 방법은 데이터베이스를 사용하여 상관을 수행하는 단계를 더 포함한다. 다른 특징들에서, 방법은 하나 이상의 기판 프로세싱 툴 및 부가적인 기판 프로세싱 툴과 연관된 이력 데이터에 기초하여 데이터베이스를 업데이트하는 단계를 더 포함한다. 방법은 업데이트된 데이터베이스를 사용하여 상관 을 수행하는 단계를 더 포함한다. 다른 특징들에서, 방법은 부가적인 기판 프로세싱 툴과 연관된 데이터를 데이터베이스에 저장하는 단계로서, 데 이터는 부가적인 기판 프로세싱 툴의 상태들 및 상태들에 기초하여 부가적인 기판 프로세싱 툴에 의해 수신된 대응하는 입력들을 포함하는, 저장하는 단계를 더 포함한다. 방법은 데이터를 사용하여 상관을 수행하는 단계 를 더 포함한다. 다른 특징들에서, 방법은 기판 프로세싱 툴의 상태는 기판 프로세싱 툴과 연관된 에러를 나타내는 데이터를 포 함하고, 그리고 입력은 에러에 대한 응답을 나타내는 데이터를 포함한다. 다른 특징들에서, 방법은 기판 프로세싱 툴의 상태는 기판 프로세싱 툴과 연관된 임박한 에러를 나타내는 데이 터를 포함하고, 그리고 입력은 에러를 방지하기 위한 응답을 나타내는 데이터를 포함한다. 다른 특징들에서, 방법은 기판 프로세싱 툴의 오퍼레이터의 존재를 검출하는 단계를 더 포함한다. 방법은 출력 에 기초하여 오퍼레이터에 의해 수신된 응답에 따라 기판 프로세싱 툴을 제어하는 단계를 더 포함한다. 다른 특징들에서, 방법은 기판 프로세싱 툴의 오퍼레이터의 부재를 검출하는 단계를 더 포함한다. 방법은 출력 에 기초하여 오퍼레이터의 부재시 기판 프로세싱 툴을 제어하는 단계를 더 포함한다. 다른 특징들에서, 방법은 기판 프로세싱 툴의 오퍼레이터의 부재를 검출하는 단계를 더 포함한다. 방법은 출력 에 관해 오퍼레이터에게 통보하는 단계를 더 포함한다. 다른 특징들에서, 방법은 기판의 프로세싱의 완료를 보장하고, 기판에 대한 대미지를 방지하고, 그리고 프로세 스 모듈들의 유휴를 방지하도록 출력에 기초하여 기판 프로세싱 툴을 제어하는 단계를 더 포함한다. 다른 특징들에서, 방법은 프로세스 모듈들에 의한 기판의 프로세싱의 스케줄링을 최적화하도록 출력에 기초하여 기판 프로세싱 툴을 제어하는 단계를 더 포함한다. 또 다른 특징들에서, 시스템은 프로세서 및 유형의 머신 판독가능 매체 상에 저장된 머신 판독가능 인스트럭션 들을 포함한다. 프로세서에 의해 실행될 때, 머신 판독 가능 인스트럭션들은 기판을 프로세싱하도록 구성된 복 수의 프로세스 모듈들을 포함하는 기판 프로세싱 툴의 상태를 수신하도록 프로세서를 구성한다. 머신 판독가능 인스트럭션들은 상태에 기초하여 기판 프로세싱 툴에 의해 이전에 수신된 입력과 상태를 상관시키도록 프로세서 를 구성한다. 머신 판독가능 인스트럭션들은 상관에 기초하여 기판 프로세싱 툴을 제어하도록 출력을 생성하도 록 프로세서를 구성한다. 다른 특징들에서, 머신 판독가능 인스트럭션들은 기판 프로세싱 툴의 복수의 상태들 및 복수의 상태들에 기초하 여 기판 프로세싱 툴에 의해 수신된 대응하는 입력들을 데이터베이스에 저장하도록 프로세서를 구성한다. 머신 판독가능 인스트럭션들은 데이터베이스를 사용하여 상관을 수행하도록 프로세서를 구성한다. 다른 특징들에서, 머신 판독가능 인스트럭션들은 하나 이상의 기판 프로세싱 툴 및 부가적인 기판 프로세싱 툴 과 연관된 이력 데이터에 기초하여 데이터베이스를 업데이트하도록 프로세서를 구성한다. 머신 판독가능 인스 트럭션들은 업데이트된 데이터베이스를 사용하여 상관을 수행하도록 프로세서를 구성한다. 다른 특징들에서, 머신 판독가능 인스트럭션들은 부가적인 기판 프로세싱 툴과 연관된 데이터를 데이터베이스에 저장하도록 프로세서를 구성하고, 데이터는 부가적인 기판 프로세싱 툴의 상태들 및 상태들에 기초하여 부가적 인 기판 프로세싱 툴에 의해 수신된 대응하는 입력들을 포함한다. 머신 판독가능 인스트럭션들은 데이터를 사 용하여 상관을 수행하도록 프로세서를 구성한다. 다른 특징들에서, 기판 프로세싱 툴의 상태는 기판 프로세싱 툴과 연관된 에러를 나타내는 데이터를 포함하고, 그리고 입력은 에러에 대한 응답을 나타내는 데이터를 포함한다. 다른 특징들에서, 기판 프로세싱 툴의 상태는 기판 프로세싱 툴과 연관된 임박한 에러를 나타내는 데이터를 포 함하고, 그리고 입력은 에러를 방지하기 위한 응답을 나타내는 데이터를 포함한다. 다른 특징들에서, 머신 판독가능 인스트럭션들은 기판 프로세싱 툴의 오퍼레이터의 존재를 검출하도록 프로세서 를 구성한다. 머신 판독가능 인스트럭션들은 출력에 기초하여 오퍼레이터에 의해 수신된 응답에 따라 기판 프 로세싱 툴을 제어하도록 프로세서를 구성한다. 다른 특징들에서, 머신 판독가능 인스트럭션들은 기판 프로세싱 툴의 오퍼레이터의 부재를 검출하도록 프로세서 를 구성한다. 머신 판독가능 인스트럭션들은 출력에 기초하여 오퍼레이터의 부재시 기판 프로세싱 툴을 제어하 도록 프로세서를 구성한다. 다른 특징들에서, 머신 판독가능 인스트럭션들은 기판 프로세싱 툴의 오퍼레이터의 부재를 검출하도록 프로세서 를 구성한다. 머신 판독가능 인스트럭션들은 출력에 관해 오퍼레이터에게 통보하도록 프로세서를 구성한다. 다른 특징들에서, 머신 판독가능 인스트럭션들은, 기판의 프로세싱의 완료를 보장하고, 기판에 대한 대미지를 방지하고, 그리고 프로세스 모듈들의 유휴를 방지하도록 출력에 기초하여 기판 프로세싱 툴을 제어하도록 프로 세서를 구성한다. 다른 특징들에서, 머신 판독가능 인스트럭션들은 프로세스 모듈들에 의한 기판의 프로세싱의 스케줄링을 최적화 하도록 출력에 기초하여 기판 프로세싱 툴을 제어하도록 프로세서를 구성한다. 본 개시의 추가 적용가능 영역들은 상세한 기술, 청구항들 및 도면들로부터 명백해질 것이다. 상세한 기술 및 구체적인 예들은 단지 예시를 목적으로 의도되고, 본 개시의 범위를 제한하는 것으로 의도되지 않았다."}
{"patent_id": "10-2018-0107642", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "관련 출원들에 대한 교차 참조 본 출원은 2017년 9월 11일 출원된 미국 특허 가출원 번호 제 62/556,733 호의 이점을 주장한다. 상기 참조된 출원의 전체 개시는 본 명세서에 참조로서 인용된다. 본 개시는 인공 지능을 통해 반도체 프로세싱 툴들에 대한 사용자 상호작용들을 자동화하는 시스템들 및 방법들 에 관한 것이다. 반도체 프로세싱 툴들은 피처들, 옵션들 및 프로세스들의 면에서 높은 변동성을 갖는다. 고 객 상호작용들을 자동화하는 현재 방법은 사용자 요청들을 요건들로 변환하는 단계 및 후속하여 고객의 반도체 프로세싱 툴의 제어 시스템 상에서 이 피처들을 구현하는 단계를 수반한다. 현재 방법은 많은 과제들에 직면한 다. 예를 들어, 일부 고객 요청들은 매우 구체적이고 일시적이다. 이들 요청들에 대해, 맞춤 (custom) 프로그 래밍을 포함하는, 전통적인 전개 사이클들에 대한 턴어라운드 (turnaround) 시간은 길고 비용이 많이 든다. 반도체 프로세싱 툴 각각을 제어하기 위해 절차들 및 시퀀스들을 하드코딩하는 대신, 본 개시는 반도체 프로세 싱 툴로 하여금 기판 프로세싱 툴과의 사용자 상호작용들에 기초하여 학습 및 트레이닝하게 하기 위한 제어 시 스템을 제안한다. 학습 및 트레이닝은 기판 프로세싱 툴과의 사용자 상호작용들을 자동화하도록 사용될 수 있 다. 예를 들어, 학습 및 트레이닝은 복잡한 유지보수 태스크들을 수행하고, 웨이퍼 쓰루풋 분석을 자동화하고, 그리고 프로세스 모듈들의 유휴 시간들을 감소시키기 위해 스케줄링을 최적화한다. 학습 및 트레이닝은 에러들 을 검출하고 에러 복구 절차들을 제안하도록 사용될 수 있다. 학습 및 트레이닝은 또한 웨이퍼 및/또는 기판 프로세싱 툴에 대한 대미지를 방지하도록 에러 복구 절차들을 자동으로 수행하도록 사용될 수 있다. 예를 들어, 제어 시스템은 툴 동작들/에러 복구들 동안 수행된 사용자 액션들/개입들로부터 실시간으로 학습될 수 있다. 일단 제어 시스템이 트레이닝되고 태스크들을 자동으로 수행하도록 준비되면, 사용자는 생산 동안 대 체할 제어 시스템에 대한 자동화된 모드를 선택할 수 있다. 자동화된 모드가 활성화되면, 웨이퍼/툴에 대한 대 미지가 일어나려고 할 때 개입할 사용자가 존재하지 않는다면 제어 시스템이 개입한다. 사용자가 존재하면, 제 어 시스템은 사용자를 보조하도록 제안할 수 있다. 사용자는 제어 시스템으로 하여금 대체하게 하고 자동으로 응답할 수 있게 하거나, 사용자는 제어 시스템의 동작을 제어할 수 있다. 이에 따라, 제어 시스템은 사용자 독 립적으로 동작할 수 있거나, 액션들을 제안하고 사용자 상호작용하여 태스크들을 수행할 수 있다. 제어 시스템은 다양한 센서들로부터의 데이터 및 기판 프로세싱 툴의 다양한 상태들과 연관된 데이터를 실시간 으로 분석한다. 툴 상태들의 예들은 이로 제한되는 것은 아니지만, 유휴인, 유지보수 중인, 에너지 절약 모드,등을 포함한다. 일반적으로 말하면, 툴 (즉, 기판 프로세싱 툴) 의 상태는 주어진 순간에 툴의 동작 파라미터 들의 스냅샷 또는 조건들이다. 제어 시스템은 사용자가 툴 상태들에 응답 또는 반응하는 방법을 학습할 수 있 다. 예를 들어, 미리 결정된 회 수 (예를 들어, 3 내지 5) 사용자가 툴 상태에 유사하게 반응한 후 (예를 들어, 사 용자가 툴 상태에 응답하여 일련의 동작들 또는 커맨드들을 수행한 후), 제어 시스템은 툴 상태에 응답하여 사 용자에 의해 수행된 동작들의 시퀀스를 학습할 수 있다. 후속하여, 학습에 기초하여, 이 툴 상태에 직면할 때, 제어 시스템은 이 툴 상태를 이 툴 상태에 대해 학습된 사용자 액션들 또는 응답들과 상관시킨다. 제어 시스템 은 어떠한 사용자 개입 없이 학습된 동작들의 시퀀스를 실행할 수 있고 또는 시퀀스를 수행하도록 제안할 수 있 다. 제어 시스템은 또한 다양한 기판 프로세싱 툴들로부터 가용한 이력 데이터 (예를 들어, 이벤트 로그, 알람 로그, 등) 로부터 학습할 수 있다. 예를 들어, 이력 데이터는 시뮬레이터에서 리플레이될 수 있고, 툴 상태들 의 데이터베이스 및 툴 상태들에 대한 사용자 응답들이 생성되거나 컴파일될 수 있다. 이어서, 실시간으로 툴 정보에 액세스하여, 제어 시스템은 생산 동안 발생할 수도 있는 임의의 상황에 학습된 지식을 인가할 수 있다. 다른 툴들로부터 획득된 지식을 사용하여 구축된 데이터베이스는 특정한 기판 프로세싱 툴의 제어 시스템에 대 해 커스터마이즈될 (customize) 수 있다. 다른 툴들로부터 획득된 지식은 또한 기판 프로세싱 툴의 제어 시스 템의 사용중인 (in-use) 데이터베이스를 업데이트하도록 사용될 수 있다. 본 개시의 시스템들 및 방법들의 이 들 및 다른 특징들은 이하에 상세히 기술된다. 본 개시는 다음과 같이 구성된다. 기판 프로세싱 툴을 포함하는 기판 프로세싱 시스템은 도 1을 참조하여 기술 된다. 기판 프로세싱 툴의 프로세스 모듈들 (프로세싱 챔버들) 의 예들은 도 2 및 도 3을 참조하여 기술된다. 기판 프로세싱 툴을 제어하는 제어기는 도 4를 참조하여 기술된다. 기판 프로세싱 시스템, 복수의 업스트림 및 다운스트림 시스템들, 계측 시스템, 및 호스트를 포함하는 네트워크된 시스템은 도 5를 참조하여 기술된다. 복 수의 기판 프로세싱 시스템들을 더 포함하는 네트워크된 시스템은 도 6을 참조하여 기술된다. 제어기를 사용하 여 기판 프로세싱 툴을 제조하기 위한 다양한 방법들은 도 7 내지 도 9를 참조하여 후속하여 기술된다. 도 1은 기판 프로세싱 시스템 의 일 예의 상면도를 도시한다. 기판 프로세싱 시스템 기판 프로세싱 툴 및 제어기 를 포함한다. 기판 프로세싱 툴 (또한 본 개시 전반에서 툴이라고 함) 은 복수의 프로 세스 모듈들 을 포함한다. 예를 들어, 프로세스 모듈들 각각은 기판 상에서 하나 이상의 각각의 프로 세스들을 수행하도록 구성될 수도 있다. 프로세싱될 기판들은 EFEM (equipment front end module) 의 로 딩 스테이션의 포트들을 통해 기판 프로세싱 툴 내로 로딩된다. 로봇 은 기판들이 프로세스 모듈들 에 의해 프로세싱되는 후속하는 하나 이상의 프로세스 모듈들 내로 기판들을 이송한다. 제어기 는 도 4를 참조하여 이하에 기술된 바와 같이 기판 프로세싱 툴 을 제어한다. 제어기 는 기술된 기능 성을 수행할 수 있는 서버 또는 임의의 다른 적합한 컴퓨팅 디바이스를 포함할 수 있다. 도 2는 프로세스 모듈 의 예로서 시스템 을 도시한다. 전술한 예가 PECVD (plasma enhanced chemical vapor deposition) 의 맥락에서 기술될 것이지만, 본 개시의 교시들은 ALD (atomic layer deposition), PEALD, CVD, 또는 다른 프로세스와 같은 다른 기판 프로세싱 시스템들에 적용될 수도 있다. 시스 템 은 시스템 의 다른 컴포넌트들을 둘러싸고 RF 플라즈마 (사용된다면) 를 담는, 프로세싱 챔버 를 포함한다. 시스템 은 상부 전극 ESC (electrostatic chuck) 또는 다른 기판 지지부를 포함한다. 동작 동안, 기판 이 ESC 상에 배치된다. 예를 들어, 상부 전극 은 프로세스 가스들을 도입하고 분배하는 샤워헤드와 같은 가스 분배 디바이스 를 포함할 수도 있다. 가스 분배 디바이스 는 프로세싱 챔버의 상단 표면에 연결된 일 단부를 포함하는 스템 부분을 포함할 수도 있다. 베이스 부분은 일반적으로 실린더형이고, 프로세싱 챔버의 상단 표면으로부터 이격되는 위치에 스템 부분의 반대편 단부로부터 외향으로 방사상으로 연장한다. 샤워헤드의 베이스 부분의 기 판-대면 표면 또는 대면 플레이트는 기화된 전구체, 프로세스 가스 또는 퍼지 가스가 흐르는 복수의 홀들을 포 함한다. 대안적으로, 상부 전극 은 도전 플레이트를 포함할 수도 있고, 프로세스 가스들은 또 다른 방식 으로 도입될 수도 있다. ESC 는 하부 전극으로 기능하는 베이스플레이트 를 포함한다. 베이스플레이트 는 세라믹 멀티- 존 히팅 플레이트에 대응할 수도 있는, 히팅 플레이트 를 포함할 수도 있다. 내열 층 은 히팅 플레 이트 와 베이스플레이트 사이에 배치될 수도 있다. 베이스플레이트 는 베이스플레이트 를 통해 냉각제를 흘리기 위한 하나 이상의 채널들 을 포함할 수도 있다.플라즈마가 사용된다면, RF 생성 시스템 은 RF 전압을 생성하고 상부 전극 및 하부 전극 (예를 들어, ESC 의 베이스플레이트 ) 중 하나로 출력한다. 상부 전극 및 베이스플레이트 중 다른 하나 는 DC 접지될 수도 있거나, AC 접지될 수도 있거나 플로팅할 수도 있다. 단지 예를 들면, RF 생성 시스템 은 매칭 및 분배 네트워크 에 의해 상부 전극 또는 베이스플레이트 에 의해 피딩되는 RF 전력을 생성하는 RF 생성기 를 포함할 수도 있다. 다른 예들에서, 플라즈마는 유도성으로 또는 리모트로 생성될 수도 있다. 가스 전달 시스템 은 하나 이상의 가스 소스들 (52-1, 52-2, … 및 52-N (집합적으로 가스 소스들 ) 을 포함하고, N은 0보다 큰 정수이다. 가스 소스들 은 밸브들 (54-1, 54-2, … 및 54-N (집합적으로 밸브 들 ) 및 질량 유량 제어기들 (mass flow controllers) (56-1, 56-2, … 및 56-N (집합적으로 질량 유량 제 어기들 ) 에 의해 매니폴드 에 연결된다. 증기 전달 시스템 이 매니폴드 또는 프로세싱 챔 버 에 연결되는 또 다른 매니폴드 (미도시) 로 기화된 전구체를 공급한다. 매니폴드 의 출력은 프로 세싱 챔버 로 피드된다. 온도 제어기 는 히팅 플레이트 에 배치된 복수의 TCE들 (thermal control elements) 에 연결될 수도 있다. 온도 제어기 는 ESC 및 기판 의 온도를 제어하기 위해 복수의 TCE들 을 제어 하도록 사용될 수도 있다. 온도 제어기 는 채널들 을 통한 냉각제 플로우를 제어하도록 냉각제 어셈 블리 와 연통할 수도 있다. 예를 들어, 냉각제 어셈블리 는 냉각제 펌프, 저장부 및 하나 이상의 온 도 센서들을 포함할 수도 있다. 온도 제어기 는 ESC 를 냉각하기 위해 채널들 을 통해 냉각제 를 선택적으로 흘리도록 냉각제 어셈블리 를 동작시킨다. 밸브 및 펌프 는 프로세싱 챔버 로부터 반응물질들을 배기하도록 사용될 수도 있다. 시스템 제 어기 는 시스템 의 컴포넌트들을 제어하도록 사용될 수도 있다. 도 3은 프로세스 모듈 의 예로서 기판의 층을 에칭하기 위한 프로세싱 챔버 를 도시한다. 특정한 챔 버가 도시되고 기술되지만, 본 개시의 교시들은 다른 기판 프로세싱 장치들에 적용될 수도 있다. 프로세싱 챔버 는 하부 챔버 영역 및 상부 챔버 영역 을 포함한다. 하부 챔버 영역 은 챔버 측벽 표면들 , 챔버 하단 표면 및 가스 분배 디바이스 의 하부 표면에 의해 규정된다. 상부 챔버 영역 은 가스 분배 디바이스 의 상부 표면 및 돔 의 내측 표면에 의해 규정된다. 일부 예들에서, 돔 은 제 1 환형 지지부 상에 놓인다. 일부 예들에서, 제 1 환형 지지부 는 상부 챔버 영역 으로 프로세스 가스를 전달하기 위해 하나 이상의 이격된 홀들 을 포함한다. 일부 예들에서, 프로세스 가스는 하나 이상의 이격된 홀들 에 의해 가스 분배 디바이스 를 포함하는 평 면에 대해 예각으로 상향 방향으로 전달되지만, 다른 각도들/방향들이 사용될 수도 있다. 일부 예들에서, 제 1 환형 지지부 의 가스 플로우 채널 은 하나 이상의 이격된 홀들 로 가스를 공급한다. 제 1 환형 지지부 는 가스 플로우 채널 로부터 하부 챔버 영역 으로 프로세스 가스를 전달하 기 위해 하나 이상의 이격된 홀들 을 규정하는 제 2 환형 지지부 상에 놓일 수도 있다. 일부 예들 에서, 가스 분배 디바이스 의 홀들 은 홀들 과 정렬한다. 다른 예들에서, 가스 분배 디바이 스 는 보다 작은 직경을 갖고 홀들 이 필요하지 않다. 일부 예들에서, 프로세스 가스는 하나 이상 의 이격된 홀들 에 의해 가스 분배 디바이스 를 포함하는 평면에 대해 예각으로 기판 을 향 해 하향 방향으로 전달되지만, 다른 각도들/방향들이 사용될 수도 있다. 다른 예들에서, 상부 챔버 영역 은 평탄한 상단 표면을 갖는 실린더형이고, 하나 이상의 평탄한 유도 코 일들이 사용될 수도 있다. 여전히 다른 예들에서, 샤워헤드와 기판 지지부 사이에 위치된 스페이서와 함께 단 일 챔버가 사용될 수도 있다. 기판 지지부 는 하부 챔버 영역 내에 배치된다. 일부 예들에서, 기판 지지부 는 정전 척 (ESC) 을 포함하지만, 다른 타입들의 기판 지지부들이 사용될 수 있다. 기판 은 에칭 동안 기판 지지부 의 상부 표면 상에 배치된다. 일부 예들에서, 기판 의 온도는 히터 플레이트 , 유체 채널들 을 갖는 선택가능한 냉각 플레이트 및 하나 이상의 센서들 (미도시) 에 의해 제어될 수도 있지만, 임의의 다른 적합한 기판 지지부 온도 제어 시스템들이 사용될 수도 있다. 일부 예들에서, 가스 분배 디바이스 는 샤워헤드 (예를 들어, 복수의 이격된 홀들 을 가진 플레이 트 ) 를 포함한다. 복수의 이격된 홀들 은 플레이트 의 상부 표면으로부터 플레이트 의 하부 표면으로 연장된다. 일부 예들에서, 이격된 홀들 은 0.4\"에서 0.75\" 범위의 직경을 가지고 샤워 헤드는 알루미늄과 같은 도전성 재료 또는 도전성 재료로 만들어진 임베딩된 전극 (embedded electrode) 을 가 지는 세라믹과 같은 비-도전성 재료로 이루어진다. 하나 이상의 유도 코일들 은 돔 의 외측 부분 둘레에 배열된다. 에너자이징되면 (energized), 하 나 이상의 유도 코일들 이 돔 내부에 전자기장을 생성한다. 일부 예들에서, 상부 코일 및 하부 코 일이 사용된다. 가스 주입기 가 가스 전달 시스템 (150-1) 으로부터 하나 이상의 가스 혼합물들을 주입 한다. 일부 예들에서, 가스 전달 시스템 (150-1) 은, 하나 이상의 가스 소스들 , 하나 이상의 밸브들 , 하 나 이상의 질량 유량 제어기들 (MFCs) 및 혼합 매니폴드 (mixing manfold) 를 포함하지만, 다른 유형의 가스 전달 시스템들이 사용될 수도 있다. 가스 스플리터 (미도시) 는 가스 혼합물의 플로우 레이트를 가변하도록 사용될 수도 있다. 또 다른 가스 전달 시스템 (150-2) 은 에칭 가스 또는 에칭 가스 혼합물 (가스 주입기 로부터의 에칭 가스에 더하여 또는 대신하여) 을 가스 플로우 채널들 (129 및/또는 134) 에 공급 하기 위해 사용될 수도 있다. 일부 예들에서, 가스 주입기 는 가스를 하향 방향으로 지향시키는 중앙 주입 위치와 하향 방향에 대하여 비스듬히 가스를 주입하는 하나 이상의 측면 주입 위치들을 포함한다. 일부 예들에서, 가스 전달 시스템 (150- 1) 은 가스 혼합물의 제 1 부분을 제 1 플로우 레이트로 중앙 주입 위치에 그리고 가스 혼합물의 제 2 부분을 제 2 플로우 레이트로 가스 주입기 의 측면 주입 위치(들)로 전달한다. 다른 예들에서, 상이한 가스 혼 합물들이 가스 주입기 에 의해 전달된다. 일부 예들에서, 가스 전달 시스템 (150-1) 은 후술될 바와 같 이 튜닝 가스 (tuning gas) 를 가스 플로우 채널들 (129 및 134) 및/또는 프로세싱 챔버의 다른 위치들로 전달 한다. 플라즈마 생성기 는 하나 이상의 유도 코일들 로 출력되는 RF 전력을 생성하도록 사용될 수도 있다. 플라즈마 는 상부 챔버 영역 에서 생성된다. 일부 예들에서, 플라즈마 생성기 는 RF 생성기 와 매칭 네트워크 를 포함한다. 매칭 네트워크 는 RF 생성기 의 임피던스를 하나 이상의 유도 코일들 의 임피던스에 매칭시킨다. 일부 예들에서, 가스 분배 디바이스 는 접지 와 같은 기준 전위에 연결된다. 밸브 와 펌프 는 하부 챔버 영역 및 상부 챔버 영역 의 내부의 압력을 제어하거나 반응물질들을 배출시키도록 사용될 수도 있다. 제어기 는 프로세스 가스, 퍼지 가스, RF 플라즈마와 챔버 압력의 플로우를 제어하기 위해 가스 전달 시 스템들 (150-1 및 150-2), 밸브 , 펌프 및 플라즈마 생성기 와 통신한다. 일부 예들에서, 플라즈마는 하나 이상의 유도 코일들 에 의해 돔 의 내부에서 지속된다. 하나 이상의 가스 혼합물 들은 가스 주입기 (및/또는 홀들 ) 를 이용하여 챔버의 상단 부분으로부터 도입되고 플라즈마는 가 스 분배 디바이스 를 이용하여 돔 내에 한정된다. 돔 내에 플라즈마를 한정하는 것은 플라즈마 종의 체적 재결합 (volume recombination) 과 가스 분배 디 바이스 를 통한 목표된 에천트 종 (echant species) 의 발산을 허용한다. 일부 예들에서 기판 에 RF 바이어스가 인가되지 않는다. 그 결과, 기판 상에 활성화된 시스 (sheath) 가 없고 이온들이 임의의 유한한 에너지를 가지고 기판에 충돌하지 않는다. 일정 양의 이온들은 가스 분배 디바이스 를 통해 플라 즈마 영역으로부터 확산될 것이다. 그러나, 확산되는 플라즈마의 양은 돔 내부에 위치한 플라즈마 보다 한 자릿수 적다. 플라즈마의 대부분의 이온들은 고압에서 체적 재결합함으로써 손실된다. 가스 분배 디바이스 의 상부 표면에서의 표면 재결합 손실은 또한 가스 분배 디바이스 아래의 이온 밀도를 낮춘다. 다른 예들에서, RF 바이어스 전력 생성기 가 제공되고 RF 생성기 및 매칭 네트워크 를 포함 한다. RF 바이어스는 가스 분배 디바이스 와 기판 지지부 사이에서 플라즈마를 생성하거나 이온들을 끌 어당기기 위해 (attract) 기판 상에 셀프-바이어스 (self-bias) 를 만들어 내는데 사용될 수 있다. 제어 기 는 RF 바이어스를 제어하기 위해 사용될 수도 있다. 도 4는 도 1에 도시된 기판 프로세싱 툴 을 제어하는 제어기 의 간략화된 예를 도시한다. 예를 들어, 제어기 는 기술된 기능성을 수행할 수 있는 서버 또는 임의의 다른 적합한 컴퓨팅 디바이스를 포함할 수도 있다. 제어기 는 통상적으로 하나 이상의 CPU들 또는 프로세서들 , 하나 이상의 입력 디바이스들 (예를 들어, 키패드, 터치패드, 마우스 등), 디스플레이 를 포함하는 디스플레이 서브시스템, 네트워크 인터페이스 , 메모리 , 및 벌크 저장부 를 포함한다. 네트워크 인터페이스 는 제어기 를 분산 네트워크 시스템 에 연결한다. 분산 네트워크 시스템 은 LAN (local area network), WAN (wide area network) 예컨대 인터넷, 또는 다른 타입의 네트워크를 포 함할 수도 있다. 예를 들어, 네트워크 인터페이스 는 유선 인터페이스 (예를 들어, Ethernet 인터페이스) 및/또는 무선 인터페이스 (예를 들어, Wi-Fi, Bluetooth, NFC (near field communication), 또는 다른 무선 인터페이스) 를 포함할 수도 있다. 메모리 는 휘발성 또는 비휘발성 메모리, 캐쉬 또는 다른 타입의 메모리를 포함할 수도 있다. 벌크 저장부 는 플래시 메모리, 하나 이상의 HDD들 (hard disk drives), 또는 다른 벌크 저장 디바이스를 포함할 수도 있다. 제어기 의 프로세서 는 OS (operating system) 및 하나 이상의 애플리케이션들 을 실 행한다. 애플리케이션들 은 기판 프로세싱 툴 을 제어하는 제어 시스템을 구현한다. 애플리케이션 들 은 인공 지능을 통해 기판 프로세싱 툴 에 대한 사용자 상호작용들을 자동화하도록 도 7 내지 도 9를 참조하여 이하에 기술된 방법들을 구현한다. 애플리케이션들 은 기판 프로세싱 툴 에 대한 사용 자 상호작용들을 자동화하는 인공 지능 (AI) 엔진을 구현한다. 벌크 저장부 는 각각의 기능들을 수행하 기 위해 애플리케이션들 에 의해 사용된 데이터 구조들을 저장하는 하나 이상의 데이터베이스 를 저장할 수도 있다. 제어기 는 제어기 가 프로세스 모듈들 및 로봇 으로 인터페이싱하는 인터페이스 를 포 함한다. 제어기 는 인터페이스 를 통해 기판 프로세싱 툴 의 로봇 및 프로세스 모듈들 을 제어한다. 제어기 는 인터페이스 를 통해 도 2 및 도 3에 도시된 프로세스 모듈들 의 제어 기들 (80 및 176) 과 통신한다. 프로세스 모듈들 의 제어기들 (80 및 176) 은 기술된 기능성을 수행할 수 있는 서버 또는 임의의 다른 적합한 컴퓨팅 디바이스를 또한 포함할 수도 있다. 제어기 는 인터페이스 를 통해 기판 프로세싱 툴 에 의해 채용된 다양한 센서들과 통신한다. 제어기 는 인터페이스 를 통해 프로세스 모듈들 및 로봇 과 연관된 다양한 센서들로부터 데이터를 수신한다. 제어기 는 기판 프로세싱 툴 의 다양한 컴포넌트들을 제어하도록 인터페이스 를 통해 신호들을 전송한다. 예를 들어, 신호들은 프로세스 모듈들 의 밸브들, 펌프들, 등을 제어할 수도 있고; 신호들은 프 로세스 모듈들 의 압력, 온도, 전력 가스들 등을 포함하는 다양한 프로세스 파라미터들을 제어할 수도 있고; 신호들은 로봇 등을 제어할 수도 있다. 제어기 는 프로세스 모듈들 및 기판 프로세싱 툴 에 의해 채용된 다양한 센서들로부터 수신된 데 이터에 기초하여 임의의 주어진 시간에 기판 프로세싱 툴 의 상태를 결정한다. 제어기 는 기판 프로 세싱 툴 의 상태에 기초하여 기판 프로세싱 툴 을 제어한다. 제어기 는 디스플레이 서브시스템 및/또는 입력 디바이스들 을 통해 (또는 네트워크 인터페이 스 를 통해 리모트로) 수신된 오퍼레이터 입력들에 기초하여 기판 프로세싱 툴 을 제어한다 (예를 들 어, 신호들을 전송한다). 제어기 는 애플리케이션들 및 데이터베이스 의 제어 하의 기판 프 로세싱 툴 에 대한 사용자 상호작용들을 자동화하고, 이는 이하에 상세히 기술된 바와 같이 인공 지능 (AI) 엔진을 구현한다. 제어기 는 사용자 상호작용들로 또는 사용자 상호작용들 없이 AI 엔진을 사용하여 기판 프로세싱 툴 을 제어할 수 있다. 제어기 는 기판 프로세싱 툴 의 상태에 기초하여 알람들을 생성할 수 있다. 예를 들어, 제어기 는 기판 프로세싱 툴 에서의 이벤트들, 에러들 (발생한 에러들 뿐만 아니라 임박한 에러들), 등에 기초하여 알람을 생성할 수 있다. 알람들은 디스플레이 서브시스템 을 통해 기판 프로세싱 툴 의 사용자 (즉, 오퍼레이터) 에게 경보하도록 출력될 수 있다. 알람들은 또한 기판 프로세싱 툴 의 오디오 서브시스템 (미 도시) 을 통해 출력될 수 있다. 알람들은 또한 네트워크 인터페이스 를 통해 메시지로서 전달될 수도 있 다. 애플리케이션들 은 기판 프로세싱 툴 의 특정한 상태들에 응답하여 수행되는 특정한 사용자 액션들로 부터 학습한다. 예를 들어, 애플리케이션들 은 알람들에 응답하여 수행된 사용자 액션들 (예를 들어, 에 러들을 복구하도록 수행된 액션들) 로부터 학습한다. 기판 프로세싱 툴 에서 발생하는 이벤트들에 대한 사 용자의 동일한 반응들을 모니터링한 후 (예를 들어, 사용자가 특정한 이벤트에 대해 소위 3 내지 5 회 동일한 세트의 입력들로 반응한 후), 애플리케이션들 은 기판 프로세싱 툴 의 상태 및 이 상태에 응답하여 오퍼레이터에 의해 수행된 대응하는 액션들을 데이터베이스 에 저장한다. 일부 구현예들에서, 데이터베이스 는 기판 프로세싱 툴 의 상태들과 연관된 관계들 및 이 상태들에 응답하여 오퍼레이터에 의해 수행된 대응하는 액션들을 이미 저장할 수도 있다. 이러한 구현예들에서, 애플리 케이션들 은 기판 프로세싱 툴 의 계속된 동작으로부터의 학습에 기초하여 데이터베이스 를 업 데이트하도록 계속될 수도 있다. 다른 구현예들에서, 데이터베이스 는 다양한 기판 프로세싱 툴들의 상태들과 연관된 관계들 및 이 상태들 에 응답하여 오퍼레이터들에 의해 수행된 대응하는 액션들을 이미 저장할 수도 있다. 예를 들어, 관계들은 다 양한 기판 프로세싱 툴들로부터 이력 데이터 (예를 들어, 이벤트 로그들, 알람 로그들, 등을 포함) 를 리플레이 함으로써 도출될 수도 있다. 리플레이는 시뮬레이팅 환경 (예를 들어, 도 1 내지 도 3에 도시된 것과 유사한 기판 프로세싱 시스템을 시뮬레이팅함으로써) 에서 수행될 수도 있다. 시뮬레이션 프로세스는 다른 기판 프로 세싱 시스템들로부터 수신된 생산 데이터 (툴 상태들 및 응답들) 를 리플레이하는 것에 더하여, 다양한 다른 동 작 조건들 및 응답들이 학습 프로세스를 더 개선하도록 시뮬레이션될 수 있다는 부가적인 장점을 제공한다. 예 를 들어, 가짜 알람들 (예를 들어, 에러에 의해 잘못 트리거되는 불필요한 유지보수 태스크) 이 시뮬레이팅 조 건들 하에서 에러 검출을 개선함으로써 최소화되거나 방지될 수 있다. 이러한 구현예들에서, 다양한 기판 프로세싱 시스템들로부터 수신된 데이터에 기초하여 데이터베이스 가 생성되면, 애플리케이션들 은 기판 프로세싱 툴 의 실제 구성에 따라 데이터베이스 를 구성 (예를 들어, 조정 (adapt) 또는 커스터마이징) 할 수도 있다. 애플리케이션들 은 기판 프로세싱 툴 의 계속된 동작으로부터의 학습에 기초하여 데이터베이스 를 업데이트하도록 계속될 수도 있다. 학습에 기초하여, 제어기 는 기판 프로세싱 툴 의 상태에 응답하여 액션을 수행하도록 사용자를 유도 할 (prompt) 수 있다. 예를 들어, 제어기 는 기판 프로세싱 툴 의 상태를 데이터베이스 내에 저장된 상태에 대한 응답과 상관시킬 수 있다. 이 상관에 기초하여, 제어기 는 기판 프로세싱 툴 에 서 에러 검출시 데이터베이스 에서 발견된 수정 또는 복구 액션을 제안할 수 있다. 또 다른 예로서, 제 어기 는 예방적 또는 수정 유지보수 동작이 수행되어야 한다고 기판 프로세싱 툴 내 하나 이상의 센서 들로부터의 데이터를 사용하여 결정할 수 있다. 제어기 는 툴 상태를 데이터베이스 에 저장된 데이 터와 상관시킬 수 있고 이 상관에 기초하여 수행할 적합한 액션을 제안할 수 있다. 제어기 는 사용자 상호작용 없이 자동으로 제안된 액션을 수행하도록 제안 (예를 들어, 디스플레이 서브시 스템 상의 GUI 상에 제안) 할 수 있다. 제어기 는 오퍼레이터가 존재한다면 기판 프로세싱 툴 과 상호작용하도록 결정할 수 있다. 제어기 는 하루 중 시간에 기초하여 (예를 들어, 스케줄링된 시프트 들의 타이밍들 또는 작업 시간들에 기초하여), 제어기 에 현재 로그인된 사용자가 있는지 여부에 기초하여, 등등으로 오퍼레이터의 부재 또는 존재를 검출할 수 있다. 사용자가 존재하지 않는다면 (즉, 기판 프로세싱 툴 이 방치된다면 (unattended)), 제어기 는 자동으로 태스크를 수행할 수 있고 기판 프로세 싱 툴 의 상태 및 이 상태에 응답하여 수행될 액션에 관한 메시지를 통해 사용자에게 통보할 수 있다. 애플리케이션들 의 구성 및/또는 태스크의 타입에 기초하여, 사용자는 또한 사용자로부터 어떠한 다른 입 력 없이 액션을 수행하도록 제어기 를 리모트로 인증할 수 있다 (즉, 사용자가 기판 프로세싱 툴 의 근방에 존재하지 않을 때). 대안적으로, 사용자는 액션을 수행하고, 제어기의 태스크 실행을 모니터링하고, 필 요하다면 개입하도록 제어기 를 리모트로 (또는 로컬로, 즉, 사용자가 기판 프로세싱 툴 근방에 존재 할 때) 인증할 수 있다. 상기 언급된 바와 같이, 애플리케이션들 은 기판 프로세싱 툴 의 사용자 (즉, 오퍼레이터) 의 액션들 로부터 에러를 복구하는 방법, (에러-수정 수단으로서 트리거될 뿐만 아니라 예방 수단으로서 스케줄링된) 복잡 한 유지보수 태스크들을 수행하는 방법, 등을 학습한다. 학습에 기초하여, 제어기 는 에러들을 검출할 수 있고, 에러로부터 복구할 수 있고, 그리고 웨이퍼가 대미지를 받거나 폐기되는 (scrap) 것을 방지할 수 있다. 일부 상황들은 기판 프로세싱 툴 과 같은 반도체 프로세싱 장비에 특유하거나 고유하고 인공 지능 (AI) 엔 진을 구축하는 것을 과제가 되게 한다는 것을 주의해야 한다. 예를 들어, 기판 프로세싱 툴 의 프로세스 모듈들 은 다양한 프로세스들을 위한 다양한 화학물질들: 다양한 가스들 및 액체들 (집합적으로 유체들); 다양한 압력들, 온도들, 및 전력; 다양한 유체들, 압력들, 온도들, 및 전력들의 시퀀스들, 등을 사용할 수 있다. 매우 다양하고 넓은 범위의 전기적, 기계적, 및 화학적 제어들을 수반하는 기판 프로세싱 툴들에 대한 사용자 상호작용들을 학습 및 자동화하는 것이 과제가 될 수 있다. 때로는, (예를 들어, 몇 초의 또는 초의 분율의) 고속 응답이 기판 프로세싱 툴 과 같은 반도체 프로세싱 장비에서 웨이퍼가 대미지를 받거나 폐기되는 것을 방지하는데 중요할 수 있다. 본 개시에 따른 인공 지능 (AI) 엔진은 인간 오퍼레이터가 할 수 있는 것보다 훨씬 고속으로 이러한 상황들에 응답할 수 있다. 기판 프로세싱 툴 과 같은 반도체 프로세싱 장비에 특정한 또 다른 특유의 또는 고유의 파라미터는 큐 시간 이고: 프로세스들의 시퀀스를 사용하여 프로세싱될 웨이퍼는 미리 결정된 시간 소위 큐 시간 내에 일 프로세스 모듈로부터 또 다른 모듈로 이송되어야 한다. 큐 시간은 일 프로세스 모듈에서 웨이퍼 상에서 이미 수행된 프 로세스의 타입 및 또 다른 프로세스 모듈에서 웨이퍼 상에서 후속하여 수행될 프로세스 타입에 따라 가변할 수 있다. 웨이퍼가 큐 시간 내에 프로세싱되지 않으면, 웨이퍼는 폐기되어야 할 수도 있다. AI 엔진은 사용자가 존재하지 않는다면 큐 시간 내에 (즉, 큐 시간이 만료되기 전에) 개입하도록 학습된 큐 시간 데이터를 사용하고 웨이퍼가 폐기되는 것을 방지한다. AI 엔진은 기판 프로세싱 툴 내 에러들을 검출한다. AI 엔진이 학습에 기초하여 (즉, 툴 상태와 데이터베 이스 에 저장된 데이터의 상관에 기초하여) 툴 상태에 대한 이전 복구 절차를 인지하면, AI 엔진은 다음 중 하나를 실행한다: 사용자가 툴을 동작시킨다면 (예를 들어, 사용자가 존재한다면), AI 엔진은 사용자를 도울 지 제안할 수 있다. 사용자는 AI 엔진으로 하여금 복구 시퀀스를 자동으로 실행하게 할 수 있다. 사용자는 AI 엔진의 복구 시퀀스 자동 실행이 필요하다면 개입할 수 있다. 대안적으로, 사용자가 존재하지 않는다면 그리고 AI 엔진이 웨이퍼 폐기 가능성을 검출한다면, AI 엔진은 자동으로 개입할 수 있고 웨이퍼가 폐기되는 것을 방지 할 수 있다. AI 엔진이 학습할 수 있고 AI 엔진이 후속하여 작용할 수 있는 상황들 또는 시나리오의 다른 예들은 다음을 포 함한다. 예를 들어, 기판 프로세싱 툴 은 로봇 그리퍼 (gripper) 에러들을 겪을 수 있다. 예를 들어, 툴 은 로봇 그리퍼 에러들로 인해 생산 동안 하루에 두 번 정지할 수도 있다. 대체 부품이 주문될 수도 있지만 배 달되는데 수 주가 걸릴 수 있고, 이는 툴 고장 시간 (downtime) 및 24/7 기술자 지원을 야기할 수 있다. 로봇 그리퍼 에러들의 복구는 복잡하고 숙련된 개입을 필요로 한다. 복구시 에러들이 로봇 고장을 야기할 수도 있고 웨이퍼 폐기를 발생시킬 수도 있다. 웨이퍼들은 또한 큐 시간 제약들을 받는다. 이에 따라, 웨이퍼들은 미리 결정된 시간 내에 복구되어야 하거나 웨이퍼들은 폐기되어야 한다. 이 상황은 툴 고장 시간을 유발할 수 있고 24/7 기술자 지원을 필요로 할 수 있다. 대신, AI 엔진은 다음과 같이 응답할 수 있다. AI 엔진은 실시간으로 툴 정봉에 액세스한다. AI 엔진은 에러 들 및 툴 상태들에 대한 사용자 개입들을 학습할 것이다. 상기 상황에 대한 사용자 응답들을 복수 회 (예를 들 어, 3 내지 5 회) 기록한 후, AI 엔진은 데이터베이스 내 저장된 시퀀스를 실행할 수 있고 에러들로부터 복구할 수 있다. 예를 들어, 생산 동안, AI 엔진은 자동 복구 모도로 설정될 수 있다. 이 모드가 활성화되고 상기 에러가 발생하면, 큐 시간이 웨이퍼들을 위험에 빠뜨린다면 AI 엔진이 개입할 것이다. 이렇게, 툴은 대체 부품이 설치될 때까지 생산에 사용될 수 있다. AI 엔진은 로봇 과 연관된 센서들로부터 수신된 데이터에 기초하여 에러를 예상할 수 있고 에러가 발생하기 전에 부품을 사전 대비하여 주문할 수 있다. 이러한 사전 대 비 액션들이 툴 고장 시간, 24/7 기술자 지원 필요성, 및 웨이퍼가 폐기될 가능성을 방지하거나 최소화할 수 있 다. 도 5는 기판 프로세싱 시스템 , 시스템 A (250-1) 및 시스템 B (250-2) (집합적으로 다른 시스템들 250), 계 측 시스템 , 및 분산 네트워크 시스템 을 통해 서로 통신하는 호스트 를 포함하는 네트워크를 도시한다. 예를 들어, 시스템 A (250-1) 및 시스템 B (250-2) 는 기판 프로세싱 시스템 에 대해 업스트림 및 다운스트림에 각각 위치될 수도 있다. 예를 들어, 기판 프로세싱 시스템 으로부터 업스트림에 위치된 시스템 A (250-1) 는 기판 프로세싱 시스템 에 의한 프로세싱을 위해 기판을 준비할 수도 있다. 시스템 A (250-1) 는 기판에 대한 데이터를 제공할 수도 있다. 시스템 A (250-1) 로부터 수신된 데이터에 따라, 기판 프 로세싱 시스템 은 기판을 프로세싱하기 위한 기판 프로세싱 툴 의 하나 이상의 프로세스 모듈들 및 로봇 의 설정들 및/또는 프로세스 파라미터들을 최적화할 수 있다. 이에 따라, 기판 프로세싱 시스템 은 기판 프로세싱 툴 의 상태를 개선하기 위해 시스템 A (250-1) 로부터의 데이터를 사용할 수 있다. 기판 프로세싱 시스템 은 학습할 수 있고 나중에 유사한 데이터를 예상할 수 있다. 부가적으로, 기판 프로세싱 시스템 은 다운스트림에 위치된 시스템 B (250-2) 로부터 데이터를 수신할 수도 있고 데이터로부터 학습할 수 있다 (즉, 데이터에 기초하여 하나 이상의 프로세스 모듈들 및 로봇 의 설정들 및/또는 프로세스 파 라미터들을 최적화한다). 계측 시스템 은 기판 프로세싱 시스템 에 의해 기판의 프로세싱 전, 동안, 그리고/또는 후에 기판의 다수회 측정들을 수행하도록 광학 계측 및 질량 계측 중 하나 이상을 사용할 수 있다. 예를 들어, 질량 계측시스템은 질량 변화를 결정하기 위해 프로세스 전 및 프로세스 후에 질량을 측정하도록 사용될 수도 있다. 광 학 계측은 두께를 결정하기 위해 표면의 스펙트럼 모델을 생성하도록 사용될 수 있다. 질량 변화 및 두께는 피 드백으로서 사용될 수 있다. 측정들은 기판의 상태 및 기판 상에서 수행된 하나 이상의 프로세스들 (예를 들어, 증착, 에칭, 세정, 등) 의 성공을 나타낼 수 있다. 예를 들어, 측정에 기초하여, 기판의 상태는 다음: 기판이 기판 프로세싱 시스템 에 의한 프로세싱을 위해 준비가 되었는지 여부, 기판이 하나 이상의 프로세 스 모듈들 에 의해 정확하게 프로세싱되었는지 여부 (예를 들어, 기판이 적절히 에칭; 세정되었는지 여부 및/또는 증착이 정확하게 수행되었는지 여부, 등), 기판 프로세싱 시스템 에 의한 기판의 프로세싱이 성공 적으로 완료되었는지 여부, 등 중 하나 이상을 나타낼 수도 있다. 계측 데이터는 기판 프로세싱 툴 의 하 나 이상의 프로세스 모듈들 및 로봇 의 설정들 및/또는 프로세스 파라미터들을 최적화하도록 사용될 수 있다. 이에 따라, 계측 데이터는 기판 프로세싱 툴 의 상태를 더 개선하도록 사용될 수 있다. 하나의 계 측 시스템만이 예측의 간략함을 위해 도시되었지만, 2 이상의 계측 시스템이 사용될 수 있다. 예를 들어, 일 계측 시스템은 기판이 기판 프로세싱 시스템 에 의해 프로세싱되기 전에 사용될 수도 있고, 그리고 또 다른 계측 시스템이 기판이 기판 프로세싱 시스템 에 의해 프로세싱된 후 사용될 수도 있다. 호스트 는 하나 이상의 서버들을 포함할 수도 있다. 서버 각각은 도 4에 도시된 제어기 의 모든 컴 포넌트들을 포함할 수도 있다. 호스트 는 제어기 의 기능들 일부 또는 전부를 수행할 수도 있다. 호스트 는 제어기 를 사용하거나 사용하지 않고 기판 프로세싱 툴 을 제어할 수도 있다. 호스 트 는 제어기 를 통해 그리고/또는 직접적으로 (즉, 제어기 를 통해 통신하지 않고) 기판 프로 세싱 툴 와 통신할 수 있다. 호스트 는 기판 프로세싱 툴 의 임의의 컴포넌트 (예를 들어, 로봇 및 임의의 프로세스 모듈들 ) 와 직접적으로 통신할 수 있다. 프로세스 모듈들 의 예들인, 제어기 들 (80 및 176) (도 3 및 도 4 참조) 은 도 4에 도시된 제어기 와 유사할 수도 있다. 프로세스 모듈 각각은 네트워크 인터페이스 를 통해 직접 호스트 와 통신할 수도 있다. 프로세스 모듈 각각 은 인터페이스 를 통해 다른 프로세스 모듈들 , 로봇 , 및/또는 제어기 와 통신할 수도 있다. 로봇 은 또한 제어기 와 유사한 제어기를 포함할 수도 있다. 로봇 은 네트워크 인터페이스 를 통해 직접적으로 호스트 와 통신할 수도 있다. 로봇 은 인터페이스 를 통해 프로세스 모듈 들 및/또는 제어기 와 통신할 수도 있다. 이에 따라, 프로세스 모듈들 및 로봇 은 호스트 와 직접적으로 통신할 수 있고 호스트 에 의해 직접적으로 제어될 수 있다. 호스트 는 구내 에 (on-premises) 또는 클라우드 내에 위치될 수 있다. 호스트 는 사용자 상호작용으로 또는 사용자 상 호작용 없이 기판 프로세싱 툴 을 제어하는 것과 관련된 부가적인 데이터를 저장할 수 있다. 부가적인 데 이터는 이로 제한되지 않지만, 다른 시스템들 , 계측 시스템 , 및 다른 기판 프로세싱 시스템들 (도 6 및 이하의 대응하는 기술 참조) 로부터의 데이터를 포함할 수 있다. 도 6은 분산 네트워크 시스템 을 통해 서로 통신할 수 있는 복수의 기판 프로세싱 시스템들 (1-1, 1-2, 1- 3, . . ., 및 1-N) (집합적으로 기판 프로세싱 시스템들 )을 도시하고, 여기서 N은 1 보다 큰 정수이다. 기 판 프로세싱 시스템들 은 단일 위치에 위치될 수도 있고 또는 복수의 위치들에 걸쳐 분포될 수도 있다. 기 판 프로세싱 시스템들 은 자신들의 상태들에 관한 데이터 및 이에 대한 응답들을 서로 공유할 수도 있다. 임의의 기판 프로세싱 시스템들 이 공유된 데이터에 기초하여 (예를 들어, 상기 기술된 시뮬레이션 프로세 스를 사용하여 공유된 데이터를 리플레이함으로써) 기판 프로세싱 시스템들 내 또는 외부의 하나 이상의 기 판 프로세싱 시스템들의 애플리케이션들 및 데이터베이스 를 생성, 업데이트, 및/또는 커스터마이 징할 수 있다. 사용시, AI 엔진 (즉, 애플리케이션들 및 데이터베이스 ) 은 툴의 모든 상태들에 실시간으로 액세스 한다. AI 엔진은 툴 상태들과 데이터베이스 에 저장된 사용자 액션들을 상관시킬 수 있다. AI 엔진은 사용자들이 툴 상태들에 반응하는 방법을 학습할 수 있다 (예를 들어, AI 엔진은 사용자들이 특정한 알람들로부 터 복구하는 방법을 학습한다). 사용자가 툴 상태에 유사하게 반응하는 소위 3 내지 5 번의 발생 후에, AI 엔 진은 사용자에 대한 시퀀스를 실행할 수 있다. 시퀀스가 인정되면 (즉, 현재 툴 상태가 데이터베이스 내 학습된 응답과 상태를 상관시키면), AI 엔진은 툴이 현재 사용자에 의해 동작되는지 (즉, 사용자가 존재하는지) 검출할 것이다. 사용자가 존재하면, AI 엔진은 사 용자를 도울 것을 제안할 것이다 (예를 들어, (상관에 기초하여 발견된) GUI 상에 메시지 또는 제안된 응답을 디스플레이함으로써). 대안적으로, 시퀀스가 인정되면, 그리고 사용자가 존재하지 않으면, AI 엔진이 이렇게 하기로 셋업 (즉, 구성) 되었다면, 제어를 대체할 수 있다. AI 엔진은 또한 큐 시간에 대해 학습할 수 있다. AI 엔진은 사용자가 존재하지 않으면 그리고 웨이퍼들이 폐기 될 것 같으면, 개입하기 위해 이 데이터를 사용할 수 있다. 고객들 (즉, 다른 툴들) 및 랩 툴들로부터 학습된 시나리오들 (예를 들어, 리플레이들, 시뮬레이션들, 등) 이 저장, 수집, 및 마스터 데이터베이스로 컴파일될 수 있고, 이는 나중에 다른 툴들 상에 개별 데이터베이스들을 설치, 커스터마이징, 또는 업데이트하도록 사용될 수 있다. AI 엔진의 기능 능력들은 AI 엔진상의 툴로부터 학습뿐만 아니라 상기 언급된 바와 같은 다른 툴들로부 터 학습으로 시간에 따라 계속해서 성장할 수 있다. 자신들의 학습된 AI 엔진들에 대한 데이터를 공유하기를 원치 않는 고객들은 여전히 자신들의 툴 선단 (fleet) (즉, 자신들의 툴들의 세트) 에 대한 AI 학습을 집합할 기능성을 갖는다. 반도체 제작 장비에 대한 사용자 상호작용을 자동화하는 방법들이 도 7 내지 도 9를 참조하여 이하에 기술된다. 이하의 기술에서, 용어 제어는 이하에 기술된 방법들을 구현하는, 도 1 내지 도 6을 참조하여 상기 기술된 하나 이상의 애플리케이션들 을 지칭한다. 즉, 용어 제어는 기술된 기능성을 수행하도록 도 1 내지 도 6에 도 시된 기판 프로세싱 시스템들 의 하나 이상의 컴포넌트들에 의해 실행된 코드 또는 인스트럭션들을 나타낸 다. 예를 들어, 이하에 기술된 방법은 도 1 및 도 4에 도시된 제어기 및/또는 도 5에 도시된 호스트 에 의해 수행될 수도 있다. 도 7은 인공 지능을 사용하여 반도체 제작 장비 (예를 들어, 도 1의 기판 프로세싱 시스템 ) 에 대한 사용자 상호작용을 자동화하기 위한 방법 을 도시한다. 302에서, 제어 (예를 들어, 하나 이상의 애플리케이션들 ) 는 기판 프로세싱 툴 (예를 들어, 도 1의 기판 프로세싱 툴 ) 의 상태들을 모니터링한다. 304에서, 제어는 툴 상태들에 대한 오퍼레이터 응답들을 모니터링한다. 306에서, 제어는 툴 상태들 및 툴 상태들에 대한 오퍼레이터의 응답들의 데이터베이스 (예를 들어, 하나 이상의 데이터베이스 ) 를 컴파일 (즉, 생성 또는 구축) 한다. 예를 들어, 제어는, 오퍼레이터가 동일한 응답을 사용하여 미리 결정된 회 수 (예를 들어, 3 내지 5 회) 툴 상태에 반응한 후 데이터베이스에 툴 상태 및 툴 상태들에 대한 오퍼레이터의 응답을 저장한다. 308에서, 제어는 기판 프로세싱 툴로부터 수신된 데이터에 기초하여 기판 프로세싱 툴의 현재 툴 상태를 실시간 으로 결정하고 현재 툴 상태에 대한 응답이 데이터베이스에 있는지 여부를 결정한다. 예를 들어, 제어는 현재 툴 상태를 데이터베이스에 저장된 공지된 응답들과 툴 상태들에 상관시킴으로써 이 결정을 한다. 제어는, 이 상관이 현재 툴 상태와 매칭하는 툴 상태를 데이터베이스에서 발견할 수 없다면 302로 돌아간다. 310에서, 현재 툴 상태에 대한 매칭이 데이터베이스에서 발견되면, 제어는 현재 툴 상태에 응답할 오퍼레이터가 존재하는지 여부를 결정한다. 예를 들어, 제어는 하루 중 시간 및 오퍼레이터들의 시프트 스케줄에 기초하여 오퍼레이터의 존재 또는 부재, 오퍼레이터가 시스템 (예를 들어, 제어기 ) 에 로그인되었는지 여부, 등을 검출한다. 312에서, 오퍼레이터가 존재한다면, 제어는 기판 프로세싱 툴의 디스플레이 상 (예를 들어, 디스플레이 상의 GUI 상) 에 데이터베이스에서 발견된 매칭하는 툴 상태에 대응하는 응답을 출력한다. 제어는 응답에 따라 기판 프로세싱 툴을 제어할 것을 제안한다. 314에서, 제어는 오퍼레이터가 어떠한 오퍼레이터의 입력 없이 응답에 따라 기판 프로세싱 툴을 자동으로 제어 하게 하는지 여부를 결정한다. 316에서, 오퍼레이터가 어떠한 오퍼레이터의 입력 없이 응답에 따라 기판 프로 세싱 툴의 자동 제어하게 한다면, 제어는 오퍼레이터 개입 없이 기판 프로세싱 툴을 자동으로 제어하고, 그리고 제어는 302로 돌아간다. 318에서, 오퍼레이터가 어떠한 오퍼레이터의 입력 없이 응답에 따라 기판 프로세싱 툴의 자동 제어를 허용하지 않는다면, 제어는 오퍼레이터로부터의 입력 또는 입력들을 수신하고 오퍼레이터의 입력 또는 입력들에 따라 기 판 프로세싱 툴을 제어하고, 그리고 제어는 302로 돌아간다. 320에서, 제어가 310에서 오퍼레이터가 존재하지 않는다고 결정하면, 제어는 현재 툴 상태 및 현재 툴 상태에 대한 응답에 관해 오퍼레이터에게 통보하고, 제어는 316으로 진행한다. 예를 들어, 제어는 현재 툴 상태 및 현 재 툴 상태에 대한 응답에 관해 오퍼레이터에게 메시지를 전송한다 도시되지 않지만, 제어는 316으로 진행하는 대신 314로 진행할 수 있다. 제어가 314로 진행하면, 오퍼레이터는 리모트로 제어로 하여금 어떠한 오퍼레이터 입력 없이 응답에 따라 기판 프로세싱 툴을 자동으로 제어하게 하고, 이 경우 제어는 316으로 진행한다. 대안 적으로, 제어가 314로 진행하면, 그리고 오퍼레이터가 제어로 하여금 어떠한 오퍼레이터의 입력 없이 응답에 따 라 기판 프로세싱 툴을 자동으로 제어하게 하지 않으면, 제어는 318로 진행한다. 도 8은 복수의 기판 프로세싱 툴들로부터 수신된 툴 상태들 및 데이터에 기초하여 특정한 기판 프로세싱 툴에 대한 응답들의 데이터베이스를 구축하기 위한 방법 을 도시한다. 402에서, 제어는 복수의 기판 프로세싱툴들로부터 수신된 툴 상태들 및 데이터에 기초하여 툴 상태들에 대한 대응하는 오퍼레이터 응답들의 마스터 데 이터베이스를 구축한다. 404에서, 제어는 특정한 기판 프로세싱 툴의 구성에 따라 (복수의 기판 프로세싱 툴들 로부터 수신된 데이터로부터 402에서 생성된) 마스터 데이터베이스를 구성함으로써 특정한 기판 프로세싱 툴의 데이터베이스를 커스터마이징한다. 대안적으로, 특정한 기판 프로세싱 툴이 이미 데이터베이스를 갖는다면, 제 어는 (복수의 기판 프로세싱 툴들로부터 수신된 데이터로부터 402에서 생성된) 마스터 데이터베이스로부터 관련 정보를 부가함으로써 데이터베이스를 업데이트한다. 제어는 특정한 기판 프로세싱 툴의 구성에 기초하여 관련 정보를 선택한다. 406에서, 제어는 도 7에 도시된 방법 에 따라 커스터마이징된/업데이트된 데이터베이 스를 사용하여 특정한 기판 프로세싱 툴의 제어 동작들을 수행한다. 도 9는 시뮬레이팅된 환경에서 복수의 기판 프로세싱 툴들로부터 수신된 데이터를 리플레이함으로써 특정한 기 판 프로세싱 툴에 대한 툴 상태들 및 응답들의 데이터베이스를 구축하기 위한 방법 을 도시한다. 452에 서, 제어는 복수의 기판 프로세싱 툴들로부터 데이터를 수집한다 (예를 들어, 도 6 참조). 454에서, 제어는 시 뮬레이팅된 기판 프로세싱 툴에서 데이터를 리플레이하고, 툴 상태들에 대한 응답들이 시뮬레이팅될 수 있다. 456에서, 제어는 시뮬레이팅된 환경에서 복수의 기판 프로세싱 툴들로부터 수신된 데이터를 리플레이하는 것에 기초하여 툴 상태들 및 툴 상태들에 대한 대응하는 응답들의 마스터 데이터베이스를 구축한다. 458에서, 제어는 특정한 기판 프로세싱 툴의 구성에 따라 (복수의 기판 프로세싱 툴들로부터 수신된 데이터로부 터 456에서 생성된) 마스터 데이터베이스를 구성함으로써 특정한 기판 프로세싱 툴의 데이터베이스를 커스터마 이징한다. 대안적으로, 특정한 기판 프로세싱 툴이 이미 데이터베이스를 갖는다면, 제어는 (복수의 기판 프로 세싱 툴들로부터 수신된 데이터로부터 456에서 생성된) 마스터 데이터베이스로부터 관련된 정보를 부가함으로써 데이터베이스를 업데이트한다. 제어는 특정한 기판 프로세싱 툴의 구성에 기초하여 관련된 정보를 선택한다. 460에서, 제어는 도 7에 도시된 방법 에 따라 커스터마이징된/업데이트된 데이터베이스를 사용하여 특정 한 기판 프로세싱 툴의 제어 동작들을 수행한다. 본 개시 전체에서, 컴퓨터들 (예를 들어, 서버들), 애플리케이션들 (예를 들어, 컴퓨터 프로그램들), 등과 같은 용어들에 대한 참조들은 단지 예시적인 목적이다. 컴퓨터들 (예를 들어, 서버들) 과 같은 용어들은 머신 판독 가능 인스트럭션들을 실행하도록 구성된 하나 이상의 프로세서들 및 메모리를 포함하는 컴퓨팅 디바이스들을 나 타내는 것으로 일반적으로 이해될 것이다. 애플리케이션들 (예를 들어, 컴퓨터 프로그램들) 과 같은 용어들은 컴퓨팅 디바이스들에 의해 실행가능한 머신 판독가능 인스트럭션들을 나타내는 것으로 일반적으로 이해될 것이다. 본 개시 전체에서, 프로세스 모듈들은 단지 예로서 사용된다. 본 개시의 교시들은 임의의 타입의 프로세싱 장 비 (예를 들어, 배치 반응기들, 이온 주입기들, 등) 에 적용가능하다. 예를 들어, 본 개시의 교시들은 생리학 적 샘플들, 화학적 샘플들, 의학적 샘플들, 등과 같은 임의의 장비 프로세싱 샘플들에 적용될 수 있다. 또한, 본 개시 전체에서, 기판은 단지 예로서 사용된다. 본 개시의 교시들은 임의의 객체 또는 워크피스를 프로세싱 하도록 적용될 수 있다. 예를 들어, 본 개시의 교시들은 광학적, 열적, 자기, 및 기계적 프로세스들을 사용하 여 객체들 또는 워크피스들을 프로세싱하도록 적용될 수 있다. 즉, 본 개시의 교시들은 복수의 프로세스들을 사용하여 객체를 프로세싱하는 임의의 장비의 동작으로부터 학습하고 그리고 객체의 대미지 위험을 감소시키고 인간 상호작용을 최소화하도록 학습에 기초한 객체의 프로세싱 및 장비를 제어하도록 적용될 수 있다. 전술한 기술은 본질적으로 단순히 예시적이고 어떠한 방법으로도 개시, 이들의 애플리케이션 또는 용도들을 제 한하도록 의도되지 않는다. 개시의 광범위한 교시가 다양한 형태들로 구현될 수 있다. 따라서, 본 개시는 특 정한 예들을 포함하지만, 다른 수정 사항들이 도면들, 명세서, 및 이하의 청구항들을 연구함으로써 명백해질 것 이기 때문에, 본 개시의 진정한 범위는 이렇게 제한되지 않아야 한다. 방법 내의 하나 이상의 단계들이 본 개 시의 원리들을 변경하지 않고 상이한 순서로 (또는 동시에) 실행될 수도 있다는 것이 이해되어야 한다. 또한, 실시예들 각각이 특정한 피처들을 갖는 것으로 상기에 기술되었지만, 본 개시의 임의의 실시예에 대하여 기술된 임의의 하나 이상의 이들 피처들은, 조합이 명시적으로 기술되지 않아도, 임의의 다른 실시예들의 피처들로 및/ 또는 임의의 다른 실시예들의 피처들과 조합하여 구현될 수 있다. 즉, 기술된 실시예들은 상호 배타적이지 않 고, 하나 이상의 실시예들의 또 다른 실시예들과의 치환들이 본 개시의 범위 내에 남는다. 엘리먼트들 간 (예를 들어, 모듈들, 회로 엘리먼트들, 반도체 층들, 등 간) 의 공간적 및 기능적 관계들은, \"연 결된 (connected)\", \"인게이지된 (engaged)\", \"커플링된 (coupled)\", \"인접한 (adjacent)\", \"옆에 (next to)\", \"~의 상단에 (on top of)\", \"위에 (above)\", \"아래에 (below)\", 및 \"배치된 (disposed)\"을 포함하는, 다양한 용어들을 사용하여 기술된다. \"직접적 (direct)\"인 것으로 명시적으로 기술되지 않는 한, 제 1 엘리먼트와 제2 엘리먼트 간의 관계가 상기 개시에서 기술될 때, 이 관계는 제 1 엘리먼트와 제 2 엘리먼트 사이에 다른 중개 하는 엘리먼트가 존재하지 않는 직접적인 관계일 수 있지만, 또한 제 1 엘리먼트와 제 2 엘리먼트 사이에 (공간 적으로 또는 기능적으로) 하나 이상의 중개하는 엘리먼트들이 존재하는 간접적인 관계일 수 있다. 본 명세서에 서 논의된 바와 같이, 구 A, B, 및 C 중 적어도 하나는 비배타적인 논리 OR를 사용하여, 논리적으로 (A 또는 B 또는 C) 를 의미하는 것으로 해석되어야 하고, \"적어도 하나의 A, 적어도 하나의 B, 및 적어도 하나의 C\"를 의 미하도록 해석되지 않아야 한다. 일부 구현예들에서, 제어기는 상술한 예들의 일부일 수도 있는 시스템의 일부일 수 있다. 이러한 시스템들은, 프로세싱 툴 또는 툴들, 챔버 또는 챔버들, 프로세싱용 플랫폼 또는 플랫폼들, 및/또는 특정 프로세싱 컴포넌트 들 (웨이퍼 페데스탈, 가스 플로우 시스템, 등) 을 포함하는, 반도체 프로세싱 장비를 포함할 수 있다. 이들 시스템들은 반도체 웨이퍼 또는 기판의 프로세싱 이전에, 프로세싱 동안에 그리고 프로세싱 이후에 그들의 동작 을 제어하기 위한 전자장치에 통합될 수도 있다. 전자장치들은 시스템 또는 시스템들의 다양한 컴포넌트들 또 는 하위부분들을 제어할 수도 있는 \"제어기\"로서 지칭될 수도 있다. 제어기는, 시스템의 프로세싱 요건들 및/ 또는 타입에 따라서, 프로세싱 가스들의 전달, 온도 설정사항들 (예를 들어, 가열 및/또는 냉각), 압력 설정사 항들, 진공 설정사항들, 전력 설정사항들, 무선 주파수 (RF) 생성기 설정사항들, RF 매칭 회로 설정사항들, 주 파수 설정사항들, 플로우 레이트 설정사항들, 유체 전달 설정사항들, 위치 및 동작 설정사항들, 툴들 및 다른 이송 툴들 및/또는 특정 시스템과 연결되거나 인터페이싱된 로드록들 내외로의 웨이퍼 이송들을 포함하는, 본 명세서에 개시된 프로세스들 중 임의의 프로세스들을 제어하도록 프로그램될 수도 있다. 일반적으로 말하면, 제어기는 인스트럭션들을 수신하고, 인스트럭션들을 발행하고, 동작을 제어하고, 세정 동작 들을 인에이블하고, 엔드포인트 측정들을 인에이블하는 등을 하는 다양한 집적 회로들, 로직, 메모리, 및/또는 소프트웨어를 갖는 전자장치로서 규정될 수도 있다. 집적 회로들은 프로그램 인스트럭션들을 저장하는 펌웨어 의 형태의 칩들, 디지털 신호 프로세서들 (DSP), ASIC (application specific integrated circuit) 으로서 규 정되는 칩들 및/또는 프로그램 인스트럭션들 (예를 들어, 소프트웨어) 을 실행하는 하나 이상의 마이크로프로세 서들, 또는 마이크로제어기들을 포함할 수도 있다. 프로그램 인스트럭션들은 반도체 웨이퍼 상에서 또는 반도 체 웨이퍼에 대한 특정 프로세스를 실행하기 위한 동작 파라미터들을 규정하는, 다양한 개별 설정사항들 (또는 프로그램 파일들) 의 형태로 제어기로 또는 시스템으로 전달되는 인스트럭션들일 수도 있다. 일부 실시예들에 서, 동작 파라미터들은 하나 이상의 층들, 재료들, 금속들, 산화물들, 실리콘, 이산화 실리콘, 표면들, 회로들, 및/또는 웨이퍼의 다이들의 제조 동안에 하나 이상의 프로세싱 단계들을 달성하도록 프로세스 엔지니어에 의해 서 규정된 레시피의 일부일 수도 있다. 제어기는, 일부 구현예들에서, 시스템에 통합되거나, 시스템에 커플링되거나, 이와 달리 시스템에 네트워킹되거 나, 또는 이들의 조합으로 될 수 있는 컴퓨터에 커플링되거나 이의 일부일 수도 있다. 예를 들어, 제어기는 웨 이퍼 프로세싱의 원격 액세스를 가능하게 할 수 있는 공장 (fab) 호스트 컴퓨터 시스템의 전부 또는 일부이거나 \"클라우드\" 내에 있을 수도 있다. 컴퓨터는 제조 동작들의 현 진행을 모니터링하고, 과거 제조 동작들의 이력 을 조사하고, 복수의 제조 동작들로부터 경향들 또는 성능 계측치들을 조사하고, 현 프로세싱의 파라미터들을 변경하고, 현 프로세싱을 따르는 프로세싱 단계들을 설정하고, 또는 새로운 프로세스를 시작하기 위해서 시스템 으로의 원격 액세스를 인에이블할 수도 있다. 일부 예들에서, 원격 컴퓨터 (예를 들어, 서버) 는 로컬 네트워 크 또는 인터넷을 포함할 수도 있는 네트워크를 통해서 프로세스 레시피들을 시스템에 제공할 수 있다. 원격 컴퓨터는 차후에 원격 컴퓨터로부터 시스템으로 전달될 파라미터들 및/또는 설정사항들의 입력 또는 프로그래밍 을 인에이블하는 사용자 인터페이스를 포함할 수도 있다. 일부 예들에서, 제어기는 하나 이상의 동작들 동안에 수행될 프로세스 단계들 각각에 대한 파라미터들을 특정한, 데이터의 형태의 인스트럭션들을 수신한다. 이 파 라미터들은 제어기가 제어하거나 인터페이싱하도록 구성된 툴의 타입 및 수행될 프로세스의 타입에 특정적일 수 도 있다는 것이 이해되어야 한다. 따라서, 상술한 바와 같이, 제어기는 예를 들어 서로 네트워킹되어서 함께 공통 목적을 위해서, 예를 들어 본 명세서에 기술된 프로세스들 및 제어들을 위해서 협력하는 하나 이상의 개별 제어기들을 포함함으로써 분산될 수도 있다. 이러한 목적을 위한 분산형 제어기의 예는 챔버 상의 프로세스를 제어하도록 조합되는, (예를 들어, 플랫폼 레벨에서 또는 원격 컴퓨터의 일부로서) 원격으로 위치한 하나 이상 의 집적 회로들과 통신하는 챔버 상의 하나 이상의 집적 회로들일 수 있다. 비한정적으로, 예시적인 시스템들은 플라즈마 에칭 챔버 또는 모듈, 증착 챔버 또는 모듈, 스핀-린스 챔버 또는 모듈, 금속 도금 챔버 또는 모듈, 세정 챔버 또는 모듈, 베벨 에지 에칭 챔버 또는 모듈, PVD (physical vapor deposition) 챔버 또는 모듈, CVD (chemical vapor deposition) 챔버 또는 모듈, ALD (atomic layer deposition) 챔버 또는 모듈, ALE (atomic layer etch) 챔버 또는 모듈, 이온 주입 챔버 또는 모듈, 트랙(track) 챔버 또는 모듈, 및 반도체 웨이퍼들의 제조 및/또는 제작 시에 사용되거나 연관될 수도 있는 임의의 다른 반도체 프로세싱 시스템들을 포함할 수도 있다. 상술한 바와 같이, 툴에 의해서 수행될 프로세스 단계 또는 단계들에 따라서, 제어기는, 반도체 제작 공장 내의 툴 위치들 및/또는 로드 포트들로부터/로드 포트들로 웨이퍼들의 컨테이너들을 이동시키는 재료 이송 시에 사용 되는, 다른 툴 회로들 또는 모듈들, 다른 툴 컴포넌트들, 클러스터 툴들, 다른 툴 인터페이스들, 인접 툴들, 이 웃하는 툴들, 공장 도처에 위치한 툴들, 메인 컴퓨터, 또 다른 제어기 또는 툴들 중 하나 이상과 통신할 수도 있다."}
{"patent_id": "10-2018-0107642", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 개시는 상세한 기술 및 첨부된 도면들로부터 보다 완전히 이해될 것이다. 도 1은 본 개시에 따른 기판 프로세싱 시스템의 예의 기능적 블록도이다. 도 2는 본 개시에 따른 도 1의 기판 프로세싱 시스템의 프로세스 모듈의 일 예의 기능적 블록도이다. 도 3은 본 개시에 따른 도 1의 기판 프로세싱 시스템의 프로세스 모듈의 또 다른 예의 기능적 블록도이다. 도 4는 본 개시에 따른 도 1의 기판 프로세싱 시스템의 기판 프로세싱 툴을 제어하는 제어기의 기능적 블록도이 다. 도 5는 본 개시에 따른 도 1의 기판 프로세싱 시스템, 기판 프로세싱 시스템으로부터 업스트림 및 다운스트림의 복수의 시스템들, 계측 시스템 및 호스트를 포함하는 분산 네트워크 시스템의 기능적 블록도이다. 도 6은 본 개시에 따른 복수의 도 1의 기판 프로세싱 시스템을 더 포함하는 도 5의 분산 네트워크 시스템의 기 능적 블록도이다. 도 7은 본 개시에 따라 인공 지능을 사용하여 도 1의 기판 프로세싱 시스템에 대한 사용자 상호작용을 자동화하 는 방법의 플로우차트이다. 도 8은 본 개시에 따른 복수의 기판 프로세싱 툴들로부터 수신된 데이터에 기초하여 기판 프로세싱 툴에 대한 툴 상태들 및 응답들의 데이터베이스를 구축하는 방법의 플로우차트이다. 도 9는 본 개시에 따른 복수의 기판 프로세싱 툴들로부터 수신된 데이터를 리플레이하고 시뮬레이션을 사용함으 로써 기판 프로세싱 툴에 대한 툴 상태들 및 응답들의 데이터베이스를 구축하는 방법의 플로우차트이다. 도면들에서, 참조 번호들은 유사한 그리고/또는 동일한 엘리먼트들을 식별하도록 재사용될 수도 있다."}
