{"patent_id": "10-2022-0130669", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0050813", "출원번호": "10-2022-0130669", "발명의 명칭": "접이식 지능형 보행 보조 장치", "출원인": "최용해", "발명자": "최용해"}}
{"patent_id": "10-2022-0130669", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "손잡이가 장착되며, 전면에 개방가능한 함체가 제공되는 제1바디;상기 제1바디의 하부에 위치하며, 그 상단과 상기 제1바디의 하단을 연결하는 제1연결 샤프트를 중심으로 상기제1바디에 대해 회동가능하며, 전면에 상기 함체가 수용되는 공간이 형성된 제2바디; 및상기 제2바디의 하단에 제공된 제2연결 샤프트를 통해 상기 제2바디와 결합하며, 상기 제2연결 샤프트를 중심으로 상기 제2바디에 대해 상대 회동이 가능하며, 저면에 휠이 제공된 제3바디를 포함하는 접이식 지능형 보행 보조기."}
{"patent_id": "10-2022-0130669", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,제3연결 샤프트를 통해 상기 제1바디의 하단과 결합하며, 상기 제3연결 샤프트를 축으로 상기 제1바디에 대해상대 회동이 가능한 받침판을 더 포함하는 접이식 지능형 보행 보조기."}
{"patent_id": "10-2022-0130669", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 제1바디에 결합되며, 그 끝단이 상기 제1연결 샤프트에 형성된 홈에 삽입가능한 제1락킹부; 및상기 제2바디에 결합되며, 그 끝단이 상기 제2연결 샤프트에 형성된 홈에 삽입가능한 제2락킹부를 포함하되,상기 제1락킹부의 끝단이 상기 제1연결 샤프트에 형성된 홈에 삽입될 경우 상기 제1바디와 상기 제2바디의 상대회동이 제한되고, 상기 제2락킹부의 끝단이 상기 제2연결 샤프트에 형성된 홈에 삽입될 경우 상기 제2바디와 상기 제2바디의 상대 회동이 제한되는 접이식 지능형 보행 보조기."}
{"patent_id": "10-2022-0130669", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "접이식 지능형 보행 보조 장치가 개시된다. 접이식 지능형 보행 보조 장치는 손잡이가 장착되며, 전면에 개방가 능한 함체가 제공되는 제1바디; 상기 제1바디의 하부에 위치하며, 그 상단과 상기 제1바디의 하단을 연결하는 제 1연결 샤프트를 중심으로 상기 제1바디에 대해 회동가능하며, 전면에 상기 함체가 수용되는 공간이 형성된 제2바 디; 및 상기 제2바디의 하단에 제공된 제2연결 샤프트를 통해 상기 제2바디와 결합하며, 상기 제2연결 샤프트를 중심으로 상기 제2바디에 대해 상대 회동이 가능하며, 저면에 휠이 제공된 제3바디를 포함한다."}
{"patent_id": "10-2022-0130669", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 접이식 지능형 보행 보조 장치에 관한 것으로, 보다 상세하게는 크게 제1바디, 제2바디, 그리고 제3 바디로 구성되어 접히거나 펼침이 가능한 접이식 지능형 보행 보조 장치에 관한 것이다."}
{"patent_id": "10-2022-0130669", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "보행보조기는 관절염, 하지 절단, 고도의 비만, 외상성 관절 좌상, 인공관절치환술 등에 기인하여 직립보행시 자세 균형 제어에 어려움을 겪는 보행 장애인을 위한 자세 균형 재활 훈련에 주로 활용되며, 이런 환자 외에도 보행이 비정상적인 노약자나 거동이 불편한 사람들의 보행을 보조하는 장치로 많이 활용된다. 접이식 보행보조기의 경우, 좌우 방향 접이식과 전후 방향 접이식이 있으며, 좌우 방향 접이식의 경우 주로 엑 스자(X자) 링크 구조를 이용해 의자에 위치한 손잡이를 잡아당기면 좌우로 접힐 수 있는 방식으로 되어 있고, 전후 방향 접이식의 경우에 하나의 힌지를 중심으로 접거나 복수의 링크를 이용하여 접히도록 되어 있다. 이처럼 기존의 접이식 보행보조기는 링크에 연결된 손잡이를 잡고 움직이면서 접는 방식이 일반적이어서, 구조 가 복잡하고 사용자가 접고펴는데 상당한 불편함을 겪고 있다."}
{"patent_id": "10-2022-0130669", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 간단한 구조로 사용자가 접고 펼수 있는 접이식 지능형 보행 보조 장치를 제공한다. 또한, 본 발명은 보관 공간을 최소화할 수 있는 접이식 지능형 보행 보조 장치을 제공한다."}
{"patent_id": "10-2022-0130669", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 따른 접이식 지능형 보행 보조 장치는 손잡이가 장착되며, 전면에 개방가능한 함체가 제공되는 제1바 디; 상기 제1바디의 하부에 위치하며, 그 상단과 상기 제1바디의 하단을 연결하는 제1연결 샤프트를 중심으로 상기 제1바디에 대해 회동가능하며, 전면에 상기 함체가 수용되는 공간이 형성된 제2바디; 및 상기 제2바디의 하단에 제공된 제2연결 샤프트를 통해 상기 제2바디와 결합하며, 상기 제2연결 샤프트를 중심으로 상기 제2바디 에 대해 상대 회동이 가능하며, 저면에 휠이 제공된 제3바디를 포함한다. 또한, 제3연결 샤프트를 통해 상기 제1바디의 하단과 결합하며, 상기 제3연결 샤프트를 축으로 상기 제1바디에 대해 상대 회동이 가능한 받침판을 더 포함할 수 있다. 또한, 상기 제1바디에 결합되며, 그 끝단이 상기 제1연결 샤프트에 형성된 홈에 삽입가능한 제1락킹부; 및 상기 제2바디에 결합되며, 그 끝단이 상기 제2연결 샤프트에 형성된 홈에 삽입가능한 제2락킹부를 포함하되, 상기 제 1락킹부의 끝단이 상기 제1연결 샤프트에 형성된 홈에 삽입될 경우 상기 제1바디와 상기 제2바디의 상대 회동이 제한되고, 상기 제2락킹부의 끝단이 상기 제2연결 샤프트에 형성된 홈에 삽입될 경우 상기 제2바디와 상기 제2 바디의 상대 회동이 제한될 수 있다."}
{"patent_id": "10-2022-0130669", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 접이식 지능형 보행 보조 장치는 제1 및 제2락킹부의 조작으로 사용자가 용이하게 접고 펼칠 수 있다. 또한, 본 발명에 따른 접이식 지능형 보행 보조 장치는 제1바디 내지 제3바디가 상대 회동하여 접힘 상태로 전 환가능하므로, 접힘 상태에서 사용자의 휴대가 용이하고 보관 공간이 최소화될 수 있다."}
{"patent_id": "10-2022-0130669", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면들을 참조하여 본 발명의 바람직한 실시 예를 상세히 설명할 것이다. 그러나 본 발명의 기술 적 사상은 여기서 설명되는 실시 예에 한정되지 않고 다른 형태로 구체화될 수도 있다. 오히려, 여기서 소개되 는 실시 예는 개시된 내용이 철저하고 완전해질 수 있도록 그리고 당업자에게 본 발명의 사상이 충분히 전달될 수 있도록 하기 위해 제공되는 것이다. 본 명세서에서, 어떤 구성요소가 다른 구성요소 상에 있다고 언급되는 경우에 그것은 다른 구성요소 상에 직접 형성될 수 있거나 또는 그들 사이에 제 3의 구성요소가 개재될 수도 있다는 것을 의미한다. 또한, 도면들에 있 어서, 막 및 영역들의 두께는 기술적 내용의 효과적인 설명을 위해 과장된 것이다. 또한, 본 명세서의 다양한 실시 예 들에서 제1, 제2, 제3 등의 용어가 다양한 구성요소들을 기술하기 위해서 사 용되었지만, 이들 구성요소들이 이 같은 용어들에 의해서 한정되어서는 안 된다. 이들 용어들은 단지 어느 구성요소를 다른 구성요소와 구별시키기 위해서 사용되었을 뿐이다. 따라서, 어느 한 실시 예에 제 1 구성요소로 언 급된 것이다른 실시 예에서는 제 2 구성요소로 언급될 수도 있다. 여기에 설명되고 예시되는 각 실시 예는 그 것의 상보적인 실시 예도 포함한다. 또한, 본 명세서에서 '및/또는'은 전후에 나열한 구성요소들 중 적어도 하 나를 포함하는 의미로 사용되었다. 명세서에서 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한 복수의 표현을 포함한다. 또한, \"포함하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 구성요소 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징이나 숫자, 단계, 구성요소 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 배제하는 것으로 이해되어서는 안 된다. 또한, 본 명세서에서 \"연결\"은 복수의 구성 요소를 간접적으로 연결하는 것, 및 직접적으로 연결하는 것을 모두 포함하는 의미로 사용된다. 또한, 하기에서 본 발명을 설명함에 있어 관련된 공지 기능 또는 구성에 대한 구체적인 설명이 본 발명의 요지 를 불필요하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명은 생략할 것이다. 도 1은 본 발명의 실시 예에 따른 접이식 지능형 보행 보조 시스템을 나타내는 사시도이고, 도 2는 도 1의 접이 식 지능형 보행 보조 시스템을 나타내는 좌측면도이다. 도 1 및 도 2를 참조하면, 접이식 지능형 보행 보조 시스템은 제1바디, 제2바디, 제3바디, 제1락킹부, 제2락킹부, 손잡이, 함체부, 그리고 받침판을 포함한다. 제1바디는 접이식 지능형 보행 보조 시스템의 상부 영역에 제공된다. 제2바디는 제1바디의 하부에 위치한다. 제1바디의 하단과 제2바디의 상단은 제1연결 샤프 트를 축으로 서로 연결된다. 제1바디와 제2바디는 제1연결 샤프트를 중심으로 상대 회동이 가능한다. 제2바디의 전면은 개방되며 내부에 수용 공간이 형성된다. 제3바디는 제2바디의 하부에 위치한다. 제3바디는 한 쌍 제공되며, 제2바디의 하단 양측에 각각 위치한다. 제2바디와 제3바디는 제2연결 샤프트를 축으로 서로 연결된다. 제2바디와 제3바디는 제2연결 샤프트를 중심으로 상대 회동이 가능하다. 제3바디의 저면에는 복수 개의 휠 이 제공된다. 휠은 제3바디들 각각에 한 쌍씩 제공되며, 지면을 따라 구를 수 있다. 제1락킹부는 제1바디에 결합되며, 그 끝단이 제1연결 샤프트에 형성된 홈에 삽입될 수 있다. 제 1락킹부의 끝단이 제1연결 샤프트에 형성된 홈에 삽입될 경우, 제1바디와 제2바디의 상대 회동이 제한된다. 사용자가 제1랑킹부를 당겨 제1락킹부의 끝단이 제1연결 샤프트에 형성된 홈 으로부터 빠져 나올 경우 제1바디와 제2바디의 상대 회동이 가능하다. 제2락킹부는 제2바디에 결합되며, 그 끝단이 제2결 샤프트에 형성된 홈에 삽입될 수 있다. 제2 락킹부의 끝단이 제2연결 샤프트에 형성된 홈에 삽입될 경우, 제2바디와 제3바디의 상대 회동이 제한된다. 사용자가 제2랑킹부를 당겨 제2락킹부의 끝단이 제2연결 샤프트에 형성된 홈 으로부터 빠져 나올 경우 제2바디와 제3바디의 상대 회동이 가능하다. 손잡이는 제1바디의 상단에 설치되며, 제1바디에 대해 상대 회동이 가능하다. 손잡이의 회 동으로, 손잡이의 각도 조절이 가능하다. 함체부는 제1바디의 전면에 제공되며, 내부에 수용 공간을 형성한다. 함체부의 내부에는 접이식 지능형 보행 보조 시스템의 움직임을 제어할 수 있는 각종 전자기기와 통신수단이 수용될 수 있다. 함체부 는 그 하단이 제1바디의 하단과 축 결합하며, 제1바디에 대해 상대 회동이 가능하다. 함체부 의 상대 회동으로 함체부의 내부 공간이 개방될 수 있다. 받침판은 제3연결 샤프트를 통해 제1바디의 하단과 결합하며, 제3연결 샤프트를 축으로 제 1바디에 대해 상대 회동이 가능하다. 받침판은 사용자가 물건을 올려놓을 수 있는 받침대로 사용할 수 있다. 도 3은 본 발명의 실시 예에 따른 접이식 지능형 보행 보조 시스템에서 합체부와 받침판의 접힘 상태를 나타내 는 측면도이고, 도 4는 도 3에 도시된 접이식 지능형 보행 보조 시스템의 일부를 나타내는 도면이다.도 3 및 도 4와 같이, 사용자의 조작에 의해 함체부와 받침판이 접힘 상태로 전환될 수 있다. 도 5는 본 발명의 실시 예에 따른 접이식 지능형 보행 보조 시스템에서 제1바디와 제2바디의 접힘 상태를 나타 내는 사시도이고, 도 6은 도 5의 접이식 지능형 보행 보조 시스템을 나타내는 좌측면도이다. 도 5 및 도 6을 참조하면, 사용자가 제1락킹부의 체결을 해제할 경우 제1바디가 제1연결 샤프트(11 5)를 축으로 상대 회동하여 제2바디 측으로 접힐 수 있다. 이 경우, 함체부가 제2바디의 전면에 형성된 공간 내에 수용된다. 도 7는 본 발명의 실시 예에 따른 접이식 지능형 보행 보조 시스템에서 제1바디 내지 제3바디의 접힘 상태를 나 타내는 사시도이다. 도 7을 참조하면, 사용자가 제2락킹부의 체결을 해제할 경우 제2바디가 제2연결 샤프트를 축으 로 상대 회동하여 제3바디 측으로 접힐 수 있다. 제1바디 내지 제3바디의 접힘 상태에서 접이식 지능형 보행 보조 시스템의 사용자 휴대가 용이하며, 보관 공간이 최소화될 수 있다. 때문에 접이식 지능형 보행 보조 시스템은 차량 트렁크 등에 적재가 가능하다. 이상, 본 발명을 바람직한 실시 예를 사용하여 상세히 설명하였으나, 본 발명의 범위는 특정 실시 예에 한정되"}
{"patent_id": "10-2022-0130669", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "는 것은 아니며, 첨부된 특허청구범위에 의하여 해석되어야 할 것이다. 또한, 이 기술분야에서 통상의 지식을 습득한 자라면, 본 발명의 범위에서 벗어나지 않으면서도 많은 수정과 변형이 가능함을 이해하여야 할 것이다."}
{"patent_id": "10-2022-0130669", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시 예에 따른 접이식 지능형 보행 보조 시스템을 나타내는 사시도이다. 도 2는 도 1의 접이식 지능형 보행 보조 시스템을 나타내는 좌측면도이다. 도 3은 본 발명의 실시 예에 따른 접이식 지능형 보행 보조 시스템에서 합체부와 받침판의 접힘 상태를 나타내 는 측면도이다. 도 4는 도 3에 도시된 접이식 지능형 보행 보조 시스템의 일부를 나타내는 도면이다. 도 5는 본 발명의 실시 예에 따른 접이식 지능형 보행 보조 시스템에서 제1바디와 제2바디의 접힘 상태를 나타 내는 사시도이다. 도 6은 도 5의 접이식 지능형 보행 보조 시스템을 나타내는 좌측면도이다. 도 7는 본 발명의 실시 예에 따른 접이식 지능형 보행 보조 시스템에서 제1바디 내지 제3바디의 접힘 상태를 나 타내는 사시도이다."}
