{"patent_id": "10-2022-0169624", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0084855", "출원번호": "10-2022-0169624", "발명의 명칭": "감성분석 기반의 고령친화제품의 사용성평가 방법 및 이를 위한 시스템", "출원인": "동의대학교 산학협력단", "발명자": "문인혁"}}
{"patent_id": "10-2022-0169624", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자의 단말은 고령친화제품으로부터 제품정보를 수신하는 단계;상기 단말은 상기 제품정보에 매칭되는 전체 기능 정보를 서버로부터 수신하는 단계;상기 전체 기능 정보를 복수의 고유 기능으로 분류하는 단계;상기 단말은 상기 고령친화제품으로부터 사용현황정보를 수신하는 단계;상기 사용현황정보 내의 기능 사용 횟수 및 상기 고유 기능에 기초하여 사용성 평가 대상을 지정하는 단계;상기 사용성 평가 대상에 따른 상기 사용자의 사용성 평가 정보를 수신하는 단계; 및상기 사용자의 사용성 평가 정보를 분석하는 단계;를 포함하는감성분석 기반의 고령친화제품의 사용성평가방법."}
{"patent_id": "10-2022-0169624", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 전체 기능 정보를 복수의 고유 기능으로 분류하는 단계는, 상기 전체 기능 정보를 평균 사용 빈도수에 따라 구분되는 제1 내지 제3 고유 기능으로 분류하는감성분석 기반의 고령친화제품의 사용성평가방법."}
{"patent_id": "10-2022-0169624", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서,상기 사용현황정보는 상기 사용자가 상기 고령친화제품의 입력부를 통해 입력한 입력 정보 및 상기 입력 정보에대응하여 상기 고령친화제품의 프로세서가 생성한 제어 정보를 포함하고,상기 사용현황정보 내의 기능 사용 횟수 및 상기 고유 기능에 기초하여 사용성 평가 대상을 지정하는 단계는,상기 제어 정보에 기능 사용 정보를 매칭하여 기능 사용의 횟수를 카운팅하는 단계, 및 상기 기능 사용의 횟수에 기초하여 상기 기능 사용 정보를 제1 내지 제3 사용 기능으로 분류하는 단계를 포함하는감성분석 기반의 고령친화제품의 사용성평가방법."}
{"patent_id": "10-2022-0169624", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3 항에 있어서,상기 제1 고유 기능의 평균 사용 빈도수는 제1 평균 빈도수 이상이고, 상기 제2 고유 기능의 평균 사용 빈도수는 상기 제1 평균 빈도수 미만 및 제2 평균 빈도수 이상이고, 상기 제3 고유 기능의 평균 사용 빈도수는 상기제3 평균 빈도수 미만인감성분석 기반의 고령친화제품의 사용성평가방법."}
{"patent_id": "10-2022-0169624", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4 항에 있어서,상기 제1 사용 기능을 사용한 빈도수는 제1 유저 빈도수 이상이고, 상기 제2 사용 기능을 사용한 빈도수는 상기제1 유저 빈도수 미만 및 제2 유저 빈도수 이상이고, 상기 제3 사용 기능을 사용한 빈도수는 상기 제2 유저 빈도수 미만인공개특허 10-2024-0084855-3-감성분석 기반의 고령친화제품의 사용성평가방법."}
{"patent_id": "10-2022-0169624", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5 항에 있어서,상기 사용성 평가 대상에 따른 상기 사용자의 사용성 평가 정보를 수신하는 단계는, 상기 단말은 제1 및 제2 사용 기능에 해당하는 기능 항목의 사용에 대한 사용성 평가 정보를 상기 사용자로부터수신하는 단계,제1 및 제2 고유 기능 내의 고유 항목과 제3 사용 기능 내의 기능 항목 중 공통 항목을 추출하는 단계 및 상기 공통 항목에 대한 사용성 평가 정보를 상기 사용자로부터 수신하는 단계를 포함하는감성분석 기반의 고령친화제품의 사용성평가방법."}
{"patent_id": "10-2022-0169624", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1 고령친화제품이 에드버타이징 신호를 출력하는 단계;상기 제1 고령친화제품이 제2 고령친화제품으로부터 응답 신호를 수신하는 단계;상기 제1 고령친화제품이 상기 제2 고령친화제품으로 페어링 요청 신호를 전송하는 단계;상기 제1 고령친화제품이 상기 제2 고령친화제품으로부터 페어링 승인 신호를 수신하는 단계; 상기 제1 고령친화제품이 제2 고령친화제품으로부터 제2 사용현황정보를 수신하는 단계;상기 제1 고령친화제품의 제1 사용현황정보와 상기 제2 사용현황정보를 상기 제1 고령친화제품의 사용자의 단말로 전송하는 단계;상기 단말은 제1 및 제2 사용현황정보에서 제1 및 제2 입력정보와 제1 및 제2 제어 정보를 추출하는 단계; 상기 단말은 상기 제1 제어 정보에 제1 기능 사용 정보를 매칭하고, 상기 제2 제어 정보에 제2 기능 사용 정보를 매칭하는 단계;상기 단말은 제1 및 제2 기능 사용의 횟수를 카운팅하는 단계;상기 단말은 상기 제1 및 제2 기능 사용의 횟수에 기초하여 제1 기능 사용 정보를 제1-1 내지 제1-3 사용 기능으로 분류하고, 상기 제2 기능 사용 정보를 제2-1 내지 제2-3 사용 기능으로 분류하는 단계; 및 상기 단말은 분류 결과에 기초하여 상기 사용자에게 질의할 사용성 평가 정보의 우선 순위를 설정하는 단계;를포함하는감성분석 기반의 고령친화제품의 사용성평가방법."}
{"patent_id": "10-2022-0169624", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7 항에 있어서,상기 제1 및 제2 고령친화제품이 서로 기 설정된 페어링 유지 시간 동안에만 상기 제1 고령친화제품이 상기 제2사용현황정보를 수신하는감성분석 기반의 고령친화제품의 사용성평가방법."}
{"patent_id": "10-2022-0169624", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8 항에 있어서,상기 단말은 상기 제1-1 및 제1-2 사용 기능으로 분류된 기능 항목과 상기 제2-1 및 제2-2 사용 기능으로 분류된 기능 항목 중 공통 항목이 존재하면, 상기 공통 항목의 제1 사용성 평가를 질의하는 유저 인터페이스를 표시하는 단계;를 더 포함하는감성분석 기반의 고령친화제품의 사용성평가방법.공개특허 10-2024-0084855-4-청구항 10 제9 항에 있어서,상기 단말은 상기 제1-3 사용 기능으로 분류된 기능 항목, 상기 제2-3 사용 기능으로 분류된 기능 항목, 서버로부터 수신한 상기 제1 고령친화제품의 제1 고유 기능 및 상기 제2 고령친화제품의 제2 고유 기능 모두에 해당하는 공통 항목이 존재하면 사용자로부터 해당 공통 항목의 제2 사용성 평가를 질의하는 유저 인터페이스를 표시하는 단계;를 더 포함하는감성분석 기반의 고령친화제품의 사용성평가방법."}
{"patent_id": "10-2022-0169624", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10 항에 있어서,상기 제2 사용성 평가는 공통 항목에 대한 사용의 빈도수가 적은 이유를 평가하기 위한 것인감성분석 기반의 고령친화제품의 사용성평가방법."}
{"patent_id": "10-2022-0169624", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "실시예는 사용자의 단말은 고령친화제품으로부터 제품정보를 수신하는 단계; 상기 단말은 상기 제품정보에 매칭 되는 전체 기능 정보를 서버로부터 수신하는 단계; 상기 전체 기능 정보를 복수의 고유 기능으로 분류하는 단계; 상기 단말은 상기 고령친화제품으로부터 사용현황정보를 수신하는 단계; 상기 사용현황정보 내의 기능 사용 횟수 및 상기 고유 기능에 기초하여 사용성 평가 대상을 지정하는 단계; 상기 사용성 평가 대상에 따른 상기 사용자의 사용성 평가 정보를 수신하는 단계; 및 상기 사용자의 사용성 평가 정보를 분석하는 단계;를 포함하는 감성분석 기반의 고령친화제품의 사용성평가방법을 제공할 수 있다."}
{"patent_id": "10-2022-0169624", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 감성분석 기반의 고령친화제품의 사용성평가 방법 및 이를 위한 시스템에 관한 것이다."}
{"patent_id": "10-2022-0169624", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 생활수준의 향상과 의료기술의 발전 등으로 한국의 고령자수는 급격하게 증가하여, 전 세계적으로도 유래 가 없는 속도로 고령화가 진행되고 있다. 급격한 고령화에 따른 신체기능 저하 및 예방 및 회복을 위한 고령친 화제품 분야의 시장수요가 증가하고 있는 추세이다. 고령친화제품은 사용자와 기기 사이의 상호관계가 무엇보다 중요하게 작 용되어 고령친화제품의 유효성은 단순 한 제품 성능평가뿐만 아니라 사용자(고령자)의 특성을 고려한 개발 기준, 제품개발 및 사용성 평가 등 기술 융 ·복합적 접근이 중요하다. 고령친화제품의 기술 융복합형 제품개발과정은 세계적으로도 초기단계이므로 국내 관련분 야 산업의 발전을 위해서는 제품개발 개발 중에 제품의 사용성평가 도입이 시급한 상황이다. 사용성평가기술은 인간중심제품개발(Human Centered Design) 관점에서 보면 고령친화분야뿐만 아니라 의료복지 및 다양한 연관 산업계 전 분야에서 응용가능한 기술이다. 특히, 고령친화분야는 고령자의 신체적 노화를 극복 하는 인간중심의 기술개발이 중요한 분야로 고령친화 분야의 사용성평가 노하우와 핵심역량을 통해 산업계 전반 에 영향을 미 칠 수 것이다. 한편, 중소기업 위주의 국내 고령친화제품 시장에서 전문연구인력과 연구 및 실험장비, 연구 및 기술개발 비용 을 투자해야 하는 관련 기술의 특성상 관련기업들이 사용성평가기술을 통한 제품의 경쟁력을 높이는데 어려움을 겪고 있다. 고령자, 장애인 등은 신체적 능력, 인지적 능력, 그리고 감각적 능력 등에 있어 일반 사용자들보다 저하된 특성 을 갖고 있기 때문에 제품개 발과정에서 이들의 특성이 고려되지 않는다면 제품의 사용에 있어 사용상의 불편뿐 만 아니라 사고발생 가능성이 높다. 따라서 모든 사용자들의 공평하고 안전한 사용성을 보장하기 위하여 제품개 발 완료 후 뿐만 아니라 제품개발 초기부터 성능평가까지 전주기적 단계에서 제품 사용자에 대한 분석(user analysis)과 사용성평가(usability evaluation) 가 중요하다. 앞서 기술한 바와 같이 고령자를 위한 제품의 개발에 있어 제품의 사용성과 안전성은 가장 중요하게 고려되어야 하는 요소이다. 고령친화제품의 사용성과 안전성을 보장하기 위해 필요한 것이 해당제품들에 대한 고령자 및 이 해관계자들의 경험을 측정하여 제품 설계에 반영하는 것이다. 선행기술문헌 특허문헌(특허문헌 0001) 공개특허공보 제10-2006-0014216호(2006.02.15.) (특허문헌 0002) 공개특허공보 제10-2012-0104714호(2012.09.24.) (특허문헌 0003) 공개특허공보 제10-2016-0082181호(2016.07.08.)"}
{"patent_id": "10-2022-0169624", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "고령친화제품을 사용하는 사용자에게 위해를 일으킬 수 있는 사용 오류나 장애 또는 그 가능성이 감소되었거나 최소화되어 안전하고 효과적으로 작업을 수행할 수 있음을 증명하기 위해 실시할 수 있도록 하는 감성분석 기반 의 고령친화제품의 사용성평가 방법 및 이를 위한 시스템을 제공한다. 본 발명은 기존 설문방식의 사용성평가는 제품마다 평가항목을 개발하는 데 어려움이 있고 사용자가 설문에 답 변할 때 점수가 편향될 수 있는 문제를 해결할 수 있는 감성분석 기반의 고령친화제품의 사용성평가 방법 및 이 를 위한 시스템을 제공한다. 본 발명은 제품의 사용 환경의 특성을 반영하여 고령친화제품의 사용성 평가가 진행될 수 있도록 하는 감성분석 기반의 고령친화제품의 사용성평가 방법 및 이를 위한 시스템을 제공한다. 본 발명은 사용자가 고령자인 점을 감안하여 보다 효율적이고 유?한 사용성 평가 정보의 수집이 가능하도록 하 는 감성분석 기반의 고령친화제품의 사용성평가 방법 및 이를 위한 시스템을 제공한다."}
{"patent_id": "10-2022-0169624", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "실시예는 사용자의 단말은 고령친화제품으로부터 제품정보를 수신하는 단계; 상기 단말은 상기 제품정보에 매칭 되는 전체 기능 정보를 서버로부터 수신하는 단계; 상기 전체 기능 정보를 복수의 고유 기능으로 분류하는 단계; 상기 단말은 상기 고령친화제품으로부터 사용현황정보를 수신하는 단계; 상기 사용현황정보 내의 기능 사 용 횟수 및 상기 고유 기능에 기초하여 사용성 평가 대상을 지정하는 단계; 상기 사용성 평가 대상에 따른 상기 사용자의 사용성 평가 정보를 수신하는 단계; 및 상기 사용자의 사용성 평가 정보를 분석하는 단계;를 포함하는 감성분석 기반의 고령친화제품의 사용성평가방법을 제공할 수 있다. 다른 측면에서, 상기 전체 기능 정보를 복수의 고유 기능으로 분류하는 단계는, 상기 전체 기능 정보를 평균 사 용 빈도수에 따라 구분되는 제1 내지 제3 고유 기능으로 분류하는 감성분석 기반의 고령친화제품의 사용성평가 방법을 제공할 수 있다. 다른 측면에서 상기 사용현황정보는 상기 사용자가 상기 고령친화제품의 입력부를 통해 입력한 입력 정보 및 상 기 입력 정보에 대응하여 상기 고령친화제품의 프로세서가 생성한 제어 정보를 포함하고, 상기 사용현황정보 내 의 기능 사용 횟수 및 상기 고유 기능에 기초하여 사용성 평가 대상을 지정하는 단계는, 상기 제어 정보에 기능 사용 정보를 매칭하여 기능 사용의 횟수를 카운팅하는 단계, 및 상기 기능 사용의 횟수에 기초하여 상기 기능 사용 정보를 제1 내지 제3 사용 기능으로 분류하는 단계를 포함하는 감성분석 기반의 고령친화제품의 사용성평 가방법을 제공할 수 있다. 다른 측면에서, 상기 제1 고유 기능의 평균 사용 빈도수는 제1 평균 빈도수 이상이고, 상기 제2 고유 기능의 평 균 사용 빈도수는 상기 제1 평균 빈도수 미만 및 제2 평균 빈도수 이상이고, 상기 제3 고유 기능의 평균 사용 빈도수는 상기 제3 평균 빈도수 미만인 감성분석 기반의 고령친화제품의 사용성평가방법을 제공할 수 있다. 다른 측면에서, 상기 제1 사용 기능을 사용한 빈도수는 제1 유저 빈도수 이상이고, 상기 제2 사용 기능을 사용 한 빈도수는 상기 제1 유저 빈도수 미만 및 제2 유저 빈도수 이상이고, 상기 제3 사용 기능을 사용한 빈도수는 상기 제2 유저 빈도수 미만인 감성분석 기반의 고령친화제품의 사용성평가방법을 제공할 수 있다. 다른 측면에서, 상기 사용성 평가 대상에 따른 상기 사용자의 사용성 평가 정보를 수신하는 단계는, 상기 단말 은 제1 및 제2 사용 기능에 해당하는 기능 항목의 사용에 대한 사용성 평가 정보를 상기 사용자로부터 수신하는 단계, 제1 및 제2 고유 기능 내의 고유 항목과 제3 사용 기능 내의 기능 항목 중 공통 항목을 추출하는 단계 및 상기 공통 항목에 대한 사용성 평가 정보를 상기 사용자로부터 수신하는 단계를 포함하는 감성분석 기반의 고령 친화제품의 사용성평가방법을 제공할 수 있다.또 다른 측면에서, 제1 고령친화제품이 에드버타이징 신호를 출력하는 단계; 상기 제1 고령친화제품이 제2 고령 친화제품으로부터 응답 신호를 수신하는 단계; 상기 제1 고령친화제품이 상기 제2 고령친화제품으로 페어링 요 청 신호를 전송하는 단계; 상기 제1 고령친화제품이 상기 제2 고령친화제품으로부터 페어링 승인 신호를 수신하 는 단계; 상기 제1 고령친화제품이 제2 고령친화제품으로부터 제2 사용현황정보를 수신하는 단계; 상기 제1 고 령친화제품의 제1 사용현황정보와 상기 제2 사용현황정보를 상기 제1 고령친화제품의 사용자의 단말로 전송하는 단계; 상기 단말은 제1 및 제2 사용현황정보에서 제1 및 제2 입력정보와 제1 및 제2 제어 정보를 추출하는 단계; 상기 단말은 상기 제1 제어 정보에 제1 기능 사용 정보를 매칭하고, 상기 제2 제어 정보에 제2 기능 사용 정보를 매칭하는 단계; 상기 단말은 제1 및 제2 기능 사용의 횟수를 카운팅하는 단계; 상기 단말은 상기 제1 및 제2 기능 사용의 횟수에 기초하여 제1 기능 사용 정보를 제1-1 내지 제1-3 사용 기능으로 분류하고, 상기 제2 기능 사용 정보를 제2-1 내지 제2-3 사용 기능으로 분류하는 단계; 및 상기 단말은 분류 결과에 기초하여 상기 사용자에게 질의할 사용성 평가 정보의 우선 순위를 설정하는 단계;를 포함하는 감성분석 기반의 고령친화제품 의 사용성평가방법을 제공할 수 있다. 다른 측면에서, 상기 제1 및 제2 고령친화제품이 서로 기 설정된 페어링 유지 시간 동안에만 상기 제1 고령친화 제품이 상기 제2 사용현황정보를 수신하는 감성분석 기반의 고령친화제품의 사용성평가방법을 제공할 수 있다. 다른 측면에서, 상기 단말은 상기 제1-1 및 제1-2 사용 기능으로 분류된 기능 항목과 상기 제2-1 및 제2-2 사용 기능으로 분류된 기능 항목 중 공통 항목이 존재하면, 상기 공통 항목의 제1 사용성 평가를 질의하는 유저 인터 페이스를 표시하는 단계;를 더 포함하는 감성분석 기반의 고령친화제품의 사용성평가방법을 제공할 수 있다. 다른 측면에서, 상기 단말은 상기 제1-3 사용 기능으로 분류된 기능 항목, 상기 제2-3 사용 기능으로 분류된 기 능 항목, 서버로부터 수신한 상기 제1 고령친화제품의 제1 고유 기능 및 상기 제2 고령친화제품의 제2 고유 기 능 모두에 해당하는 공통 항목이 존재하면 사용자로부터 해당 공통 항목의 제2 사용성 평가를 질의하는 유저 인 터페이스를 표시하는 단계;를 더 포함하는 감성분석 기반의 고령친화제품의 사용성평가방법을 제공할 수 있다. 다른 측면에서, 상기 제2 사용성 평가는 공통 항목에 대한 사용의 빈도수가 적은 이유를 평가하기 위한 것인 감 성분석 기반의 고령친화제품의 사용성평가방법을 제공할 수 있다."}
{"patent_id": "10-2022-0169624", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "실시예는 고령의 사용자들이 모두 자신의 단말을 통해서 설문을 진행할 것을 기대하기는 어려운 점을 고려하여 복수의 단말들 중에서 어느 하나의 단말에서라도 설문이 이루어질 경우 다수의 사용자들의 사용 관점을 반영한 사용성 평가가 이루지도록 할 수 있다. 또한, 실시예는, 사용성 평가 정보에 기초하여 고령친화제품의 복수의 기능들 각각에 대한 기능에 대한 펌웨어 업데이트, 구조적인 개선을 통한 신제품 출시가 가능하도록 한다. 또한, 실시예는 주요 기능에 대한 설문을 우선적으로 진행함에 따라 고령자로 하여금 사용성 평가 설문의 부담 을 줄이고 그에 따라 사용성 평가 정보의 수집을 용이하게 한다. 또한, 실시예는 다수의 사용자가 주로 사용하는 기능에 대한 설문을 우선적으로 진행함으로서 사용자 관점에서 사용 빈도가 높은 기능의 평가가 우선적으로 이루어지도록 한다. 또한, 실시예는 고령친화제품의 제품 고유 특성 상 다수의 사용자들이 주로 사용하는 기능에 대한 사용성 평가 가 중요하게 여겨지는 특성을 가지는 제품에 보다 적합한 사용성 평가 프로세스를 제공할 수 있다. 또한, 실시예는 다수의 사용자가 주로 사용하는 기능, 즉 실제 사용자들에게 보다 중요하게 여겨지는 기능을 우 선적으로 업데이트할 수 있도록 해당 기능의 사용성 평가 정보에 대한 데이터 수집이 용이하도록 한다. 또한, 실시예는 복수의 고령친화제품들이 페어링될 때, 복수의 고령친화제품들의 사용현황정보를 수집하여 이를 토대로 사용성 평가 정보를 수집할 수 있다. 이는, 다수의 사용자가 고령친화제품들을 동일한 환경에서 사용할 때의 사용자들이 주로 사용하는 기능 및 기능의 사용성을 평가할 수 있다. 따라서, 고령친화제품이 사용되는 환 경이 중요한 고려 대상인 경우와 같이 특정 환경에서 다수의 사용자가 어떤 방식으로 제품을 사용하는지에 대한 정보의 취득이 중요한 경우에 보다 유의미한 사용성 평가 정보를 수집할 수 있다. 또한, 실시예는 사용자들이 주로 사용하는 기능에 대해서 우선적으로 설문을 진행할 뿐만 아니라, 주로 사용되 어야 하는 기능이나 사용자들의 사용 빈도가 낮은 기능에 대해서는 사용 빈도가 낮은 이유를 질의함으로써 중요 기능에 대한 사용을 유도하면서도 중요 기능이나 사용 빈도가 낮은 기능의 발생 이유에 대한 평가 정보를 수집하여 고령친화제품 개발에 중요 정보가 수집되도록 한다. 다양한 실시예에서, 제품 개발자나 제조 업체 또는 써드 파티 측에서 고령친화제품이 가지는 기능에 대한 기술 적 업데이트를 진행한 경우에는 비록 이전에 사용성 평가 대상이었더라도 다시 한번 더 사용성 평가가 이루어지 도록 하여 업데이트된 기능에 대한 사용성 평가 정보를 수집하도록 하고, 기술적 업데이트가 되지 않았고 이전 에 이미 사용성 평가 대상이었다면 사용성 평가 대상에서 제외함으로써 설문의 질적 수준을 향상시키고 사용자 의 설문 참여율을 높일 수 있다."}
{"patent_id": "10-2022-0169624", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변환을 가할 수 있고 여러 가지 실시예를 가질 수 있는 바, 특정 실시예들을 도면에 예시하고"}
{"patent_id": "10-2022-0169624", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "상세한 설명에 상세하게 설명하고자 한다. 본 발명의 효과 및 특징, 그리고 그것들을 달성하는 방법은 도면과 함께 상세하게 후술되어 있는 실시예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시 예들에 한정되는 것이 아니라 다양한 형태로 구현될 수 있다. 이하의 실시예에서, 제1, 제2 등의 용어는 한정적 인 의미가 아니라 하나의 구성 요소를 다른 구성 요소와 구별하는 목적으로 사용되었다. 또한, 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 또한, 포함하다 또는 가지다 등의 용어는 명 세서상에 기재된 특징, 또는 구성요소가 존재함을 의미하는 것이고, 하나 이상의 다른 특징들 또는 구성요소가 부가될 가능성을 미리 배제하는 것은 아니다. 또한, 도면에서는 설명의 편의를 위하여 구성 요소들이 그 크기가 과장 또는 축소될 수 있다. 예컨대, 도면에서 나타난 각 구성의 크기 및 두께는 설명의 편의를 위해 임의로 나 타내었으므로, 본 발명이 반드시 도시된 바에 한정되지 않는다. 이하, 첨부된 도면을 참조하여 본 발명의 실시예들을 상세히 설명하기로 하며, 도면을 참조하여 설명할 때 동일 하거나 대응하는 구성 요소는 동일한 도면부호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 도 1은 본 발명의 다양한 실시 예에 따른 감성분석 기반의 고령친화제품의 사용성평가 시스템을 나타낸다. 도 1을 참조하면, 본 발명의 실시예에 따른 감성분석 기반의 고령친화용품의 사용성평가 시스템은 서버 , 단말 및 고령친화제품을 포함할 수 있다. 서버는 고령친화제품의 특성 정보에 따라 제품의 속성별로 사용성 평가 문항을 맵핑할 수 있다. 서버는 서버에 접속하는 각 단말(200: 201 내 지 203)로부터 고령친화제품의 품목 또는 특성 정보를 수신하면, 고령친화제품의 특성 정보에 기반하 여 해당 제품의 세분화된 속성을 분석하고, 분석된 속성에 해당하는 사용성 평가 문항을 맵핑할 수 있다. 예를 들면, 특성 정보로는 제품의 보조 행위(예: 보행, 수면, 목욕 등), 이동성, 휴대성, 변형 여부, 재질 등을 포함 할 수 있다. 세분화된 속성은 사용 대상, 사용시 자세, 제품의 조작에 사용되는 신체 부위, 조작 방법, 재질에 따른 내구성 등을 포함할 수 있다. 선택된 속성에 따라 더 세분화된 하위 속성을 포함할 수 있다. 예를 들면, 서버는 단말(200: 201 내지 203)로부터 평가 대상의 고령친화제품으로 보행보조차를 수신 하면, 보행보조차의 특성 정보에 기반하여, 세분화된 속성을 분석할 수 있다. 예컨대, 보행보조차의 제품별로 특성 정보는 다를 수 있다. 따라서, A 업체에서 생산된 보행보조차 a와 B 업체에서 생산된 보행보조차 b는 서로 다른 특성 정보를 가질 수 있다. 일 실시 예에 따르면, 서버는 수신된 보행보조차에 해당하는 특성 정보를 저장하고 있거나, 또는 외부 장치로부터 보행보조차에 해당하는 제품의 특성 정보를 수신할 수 있다. 예컨대, 외부 장치는 고령친화제품의 특성 정보를 저장하고 있는 데이터베이스 또는 고령친화제품의 특성 정 보를 검색하는 검색 엔진 등이 될 수 있다.일례에 따라, 서버는 단말(200: 201 내지 203)로부터 보행보조차를 수신하고, 보행보조차의 특성 정보로 사용자의 보행을 보조하는 이동성을 갖는 제품이라는 정보를 획득할 수 있다. 서버는 이동성이라는 특성 정보에 기반하여 직선로 이동, 경사로(오르막길, 내리막길) 이동, 방향 전환, 브레이크 기능 유무, 이동 편의성 등의 세분화된 속성을 분석할 수 있다. 이에 따라, 서버는 이동성의 세분화된 속성인 직선로 이동, 경사로 이동, 방향 전환, 브레이크 기능, 이동 편의성 각각에 맵핑되는 사용성 평가 문항을 제공할 수 있다. 예를 들어, 서버는 제품의 세분화된 속성으로 브레이크 기능을 가지면, 브레이크 기능의 속성에 맵핑되는 브레 이크 수행 능력, 브레이크 조작 편이성, 브레이크 안전성, 브레이크 동작 시 소음 발생 여부 등에 관한 사용성 평가 문항뿐 아니라, 브레이크의 부착 위치나 브레이크 조작 방법에 따른 하위 속성을 분석하고, 하위 속성에 맵핑되는 사용성 평가 문항을 더 제공할 수 있다. 예를 들면, 세분화된 속성에 대한 사용자 평가 문항의 일례로 '경사가 있는 내리막길에서 넘어질 위험 없이 안 전하게 보행할 수 있는가', '브레이크 작동에 의한 정지 시 미끄러질 위험은 없는가, 또는 '화장실, 좁은 복도, 엘리베이터 출입구 등의 좁은 공간의 이동 시 문제가 없는가' 등을 포함할 수 있다. 다른 예에 따라, 서버(10 0)가 단말(201 내지 203)로부터 휠체어를 수신하고, 휠체어의 특성 정보로 사용자의 보행 및 기립을 보조하는 이동성을 갖는 제품이라는 정보를 획득할 수 있다. 서버는 이동성이라는 특성 정보에 기반하여, 보행보조 차와 동일한 세분화된 속성을 분석하고, 직선로 이동, 경사로 이동, 방향 전환, 브레이크 기능 등과 같은 세분 화된 속성에 맵핑되는 동일한 사용성 평가 문항을 가져올 수 있다. 또 다른 예에 따라, 서버가 단말(201 내지 203)로부터 장애인을 위한 전동 스쿠터를 수신하면, 전동 스쿠 터의 특성 정보로 이동성을 획득할 수 있다. 서버는 보행보조차 및 휠체어와 마찬가지로, 이동성이라는 동 일한 특성 정보를 기반하여, 직선로 이동, 경사로 이동, 방향 전환, 브레이크 기능 등과 같은 동일한 속성에 맵 핑되는 동일한 사용성 평가 문항을 가져올 수 있다. 그러나, 서버는 보행보조차, 휠체어, 전동 스쿠터는 사용 대상, 사용시 자세, 제품의 조작에 사용되는 신체 부위, 조작 방법 등과 같은 특성 정보에 있어서, 서로 다른 속성을 가지므로, 이동성과 관련된 속성을 제외하고는 각각 다른 속성에 따라 맵핑되는 다른 사용성 평가 문항을 가져올 수 있다. 기존의 평가 시스템에서 보행보조차는 보행보조차 만의 사용성 평가 문항을 따로 가지 고, 휠체어는 휠체어 만의 사용성 평가 문항을 따로 가지는 등 해당 제품에만 해당하는 고정된 사용성 평가 문 항을 제공하였다. 또한, 기존의 평가 시스템에서는 고령친화제품을 평가하는 기관이나 평가자마다 제품에 대한 서로 다른 사용성 평가 문항을 이용하였다. 따라서, 기존의 평가 시스템에서는 새로 개발되는 제품의 사용 성 평가에 오랜 시간이 소요될 뿐 아니라, 유사한 제품에 대해서 동일한 기준으로 평가하는 것이 어려운 점이 있었다. 그러나, 본 발명의 다양한 실시 예는 제품의 특성 정보에 기반하여 세분화된 속성을 바탕으로 맵핑된 사용성 평가 문항을 이용함으로써, 동일한 종류의 제품을 새로운 방식으로 제공하거나, 다른 종류의 제품을 동 일한 방식으로 제공하는 경우에도 호환성있게 사용성 평가를 제공할 수 있다. 또한, 본 발명의 사용성 평가 시 스템에서는, 새로운 개발된 제품에 대해서도 해당 제품의 특성 정보에 기반한 세분화된 속성을 바탕으로 기존의 사용성 평가 문항을 맵핑함으로써, 빠르게 사용성 평가를 제공할 수 있다. 서버는 제품의 특성 정보에 기반하여 제품의 속성에 따라 맵핑된 사용성 평가 문항의 제공을 통해, 사용성 평가 결과를 수집하고, 사용성 평가 결과에 기반하여 제품별로 객관화된 평가 지표를 획득할 수 있다. 예를 들 면, 서버는 사용성 평가 문항별로 평가 항목에 따른 평가 계수, 가중치 등을 할당할 수 있다. 예를 들면, 맵핑되는 사용성 평가 문항이 고령친화제품의 사용에 있어서의 안전성과 관련된 문항이면, 서버는 해 당 문항이 안전성에 미치는 정도에 기반하여, 해당 문항에 안정성과 관련된 평가 계수, 가중치 등을 할당할 수 있다. 또는, 해당 문항의 답변에 따라 평가 계수, 가중치 등을 달리할 수 있다. 서버는 해당 제품과 관련하여 제 공되는 사용성 평가 항목 전체에 대해 할당된 평가 계수, 가중치 등에 기반하여, 안전성, 조작성 등의 항목별로 점수를 산출할 수 있다. 나아가, 서버는 단말(201 내지 203)을 통해 수신된 모든 사용성 평가의 점수에 대 한 평균, 표준 편차 등의 연산을 통해, 각 제품에 대한 객관화된 지표를 산출할 수 있다. 일 실시 예에 따르면, 서버는 한 사용자로부터 일정 간격으로 2 번의 사용성 평가를 수신하고, 2 번의 사 용성 평가에 대해 크론바하 알파(Cronbach's alpha) 알고리즘을 이용하여, 내적 일치도를 산출할 수 있다. 서버 는 내적 일치도에 기반하여, 해당 사용자의 사용성 평가의 점수의 신뢰도를 산출하고, 신뢰도를 사용성 평 가의 점수에 반영할 수 있다. 일 실시 예에 따라, 서버는 사용성 평가를 수행하는 사용자에 대한 정보을 수신할 수 있다. 이에 따라, 서 버는 사용자 정보에 기반하여 사용성 평가 항목을 더 세분화하여 제공하거나, 사용성 평가 결과를 출력 할때, 사용자에 대한 정보를 반영할 수 있다. 예를 들면, 서버가 보행보조차에 대한 사용성 평가를 수행 할 때, 제품별로 제품의 조작 시에 사용하는 신체 부위, 제품의 조작에 의해 접촉되는 신체 부위, 제품의 조작 으 로 영향을 미치는 신체 부위 등을 세분화할 수 있고, 해당 신체 부위(예: 어깨, 손목, 허리 등)의 속성에 따 라 서로 다른 사용성 평가 문항을 맵핑할 수 있다. 뿐만 아니라, 서버는 사용자의 정보(예: 키, 성별)에 바탕 하여, 사용자의 성별, 신체적 특징 등에 따른 세분화된 사용성 평가 문항을 더 맵핑할 수 있다. 도 2는 본 발명의 실시예에 따른 감성분석 기반의 고령친화제품의 사용성평가 시스템을 구성하는 고령친화제품 의 블록도이다. 예시적인 고령친화제품의 블록도를 도시한 도 2를 참조하면, 고령친화제품은 프로세서, 메모리 통신부, 센서부를 포함할 수 있다. 프로세서는 예를 들어 어플리케이션 플랫폼의 일부로서 운영 체제 또는 응용 프로그램을 구동하여 프로세 서에 연결된 다수의 하드웨어 또는 소트프웨어 구성요소들을 제어할 수 있고, 각정 데이터 처러 및 연산을 수행할 수 있다. 프로세서는 GPU(graphic processing unit) 및/또는 이미지 신호 프로세서를 더 포함할 수 있다. 프로세서는 도 2에 도시된 구성요소들 중 적어도 일부를 포함할 수도 있다. 프로세서는 다 른 구성요소들 중 적어도 하나로부터 수신된 명령 또는 데이터를 휘발성 메모리에 로드하여 처리하고, 결과 데 이터를 비휘발성 메모리에 저장할 수 있다. 프로세서는 통신부 및/또는 메모리에 저장된 프로그 램에 따라 고령친화제품을 제어할 수 있다. 메모리는 예를 들면, 내장 메모리 또는 외장 메모리를 포함할 수 있다. 내장 메모리는, 예를 들면, 휘발성 메모리(예: DRAM, SRAM, 또는 SDRAM 등), 비휘발성 메모리(예: OTPROM(one time programmable ROM), PROM, EPROM, EEPROM, mask ROM, flash ROM, 플래시 메모리, 하드 드라이브, 또는 솔리드 스테이트 드라이브(SSD) 중 적어도 하나를 포함할 수 있다. 외장 메모리는 플래시 드라이브(flash drive), 예를 들면, CF(compact flash), SD(secure digital), Micro-SD, Mini-SD, xD(extreme digital), MMC(multi-media card) 또는 메모리 스틱 등 을 포함할 수 있다. 외장 메모리는 다양한 인터페이스를 통하여 고령친화제품과 기능적으로 또는 물리적으 로 연결될 수 있다. 통신부는 본원에서 더 논의된 바와 같이 서버 및/또는 단말과 통신하도록 구성될 수 있다. 통신 부는 모뎀, 이더넷 카드, 통신 포트, 개인 컴퓨터 메모리 카드 국제 협회(PCMCIA) 슬롯 및 카드 등과 같은 데이터를 송수신할 수 있는 적합한 네트워크 인터페이스를 포함할 수 있다. 통신부를 통해 전송된 데이터 는 네트워크 인터페이스에 의해 전송되고 수신될 수 있는 전자, 전자기, 광학 또는 기타 신호의 형태로 될 수 있다. 통신부는 예를 들어, 블루투스, 와이파이와 같은 무선 전송 표준을 사용하여 셀룰러 네트워크를 통 해 데이터를 전송하거나, 다른 적합하거나 원하는 무선 전송을 사용할 수 있다. 통신부는 2.4 GHz ISM 대 역에서 동작하는 블루투스 저에너지(Bluetooth LTE)를 사용하여 데이터를 전송할 수도 있다. 도 3은 본 발명의 실시예에 따른 감성분석 기반의 고령친화제품의 사용성평가방법에서 사용성 평가 감성 분류 모델을 생성하는 방법의 흐름도이다. 도 3을 참조하면, 본 발명의 실시예에 따른 사용성 평가 감성 분류 모델을 생성하는 방법(S10)은 기존 사용성 평가 결과 데이터셋을 구축하는 단계(S11), 머신러닝 및/또는 딥러닝 네트워크를 이용하여 기존 사용성 평가 결 과 데이터셋을 인공지능 학습하는 단계(S12), 학습 결과에 기초하여 사용성 평가 감성 분류 모델을 생성하는 단 계(S13)를 포함할 수 있다. 도 4는 본 발명의 실시예에 따른 감성분석 기반의 고령친화제품의 사용성평가방법의 흐름도이다. 도 3 및 도 4를 참조하면, 본 발명의 실시예에 따른 감성분석 기반의 고령친화제품의 사용성평가방법(S20)은 사 용자의 단말로부터 사용자의 고령친화제품의 사용에 따른 지표별 의견 정보를 수신하는 단계(S21), 수신한 지표별 의견 정보를 입력으로 하는 사용성평가 감성분류 모델로부터 자동화된 사용성평가 결과 정보를 생성하는 단계(S22)를 포함할 수 있다. 다양한 실시예에서 수신한 지표별 의견 정보를 입력으로 하는 사용성평 가 감성분류 모델의 출력 결과를 토픽 모델링, 네트워크 분석, TF-IDF 텍스트 분석에 기초하여 사용성 평가 결 과 정보를 도출할 수도 있다. 실시예는 사용자가 안전성, 조작 및 기능성, 편의성 등 지표별로 자유롭게 의견을 작성하면 텍스트 마이닝, 인 공지능 등의 기술을 사용하여 문장에서 해달 지표에 대한 긍정, 부정, 중립인지 판별하고 중요 키워드를 추출하 여 평가결과의 원인이 무엇인지 알 수 있는 보다 자동화되고 정량적인 평가가 가능하도록 한다.도 5는 본 발명의 다른 실시예에 따른 감성분석 기반의 고령친화제품의 사용성평가방법의 흐름도이다. 도 2 및 도 5를 참조하면, 본 발명의 다른 실시예에 따른 감성분석 기반의 고령친화제품의 사용성평가방법 (S100)은 제품정보를 수신하는 단계(S110), 전체 기능 정보를 수신하는 단계(S120), 전체 기능 정보를 복수의 고유 기능으로 분류하는 단계(S130), 사용현황정보를 수신하는 단계(S140), 제어 정보를 추출하는 단계(S150), 제어 정보에 기능 사용 정보를 매칭하는 단계(S160), 기능 사용 횟수를 카운팅하는 단계(S170), 기능 사용 정보 를 복수의 사용 기능으로 분류하는 단계(S180), 사용성 평가 정보를 수신하여 사용성을 평가하는 단계(S190)를 포함할 수 있다. 상세하게, 단말은 고령친화제품의 통신부와 페어링하여 고령친화제품에 대한 고유 제품 정 보를 수신할 수 있다. 단말은 수신한 고유 제품 정보를 서버로 전송할 수 있다. 서버는 수신한 제품 정보에 매칭되는 고령친화제품의 전체 고유 기능 정보를 단말로 제공할 수 있다. 단말은 수신한 전체 고유 기능 정보를 제1 내지 제3 고유 기능으로 분류할 수 있다. 단말은 전체 고 유 기능 정보를 고령친화제품의 제품 특성 정보에 기초하여 제1 내지 제3 고유 기능으로 분류할 수 있다. 단말은 서버로부터 전체 고유 기능 정보와 함께 수신한 제품 특성 정보에 기초하여 전체 고유 기능 정보를 제1 내지 제3 고유 기능으로 분류할 수 있다. 단말은 전체 고유 기능 정보 중에서 제품 제조업체가 지정 및/또는 유저들의 평균적인 제품 사용 정보에 기초하여 전체 고유 기능 정보를 제1 내지 제3 고유 기능으 로 분류할 수 있다. 제1 내지 제3 고유 기능은 고령친화제품의 다양한 기능이나 조작 기능 중에서 사용의 빈도 수에 따라서 분류하는 기준이 될 수 있다. 예시적으로, 고령친화제품이 보행차인 경우라고 하면, 제1 고유 기능은 가속 기능, 브레이크 조작 기능, 핸들 조작 기능 등과 같이 평균 사용 빈도수가 높은 기능이 될 수 있다. 다양한 실시예에서, 제1 고유 기능은 평균 사용 빈도수가 제1 평균 빈도수 이상에 해당하는 기능이 될 수 있다. 또한, 제2 고유 기능은 라이트 온/오 프 기능, 경보음 기능, 충전 기능 등과 같이 제1 고유 기능만큼의 평균 사용 빈도수가 높지는 않으나 비교적 평 균 사용 빈도가 높은 기능들로서, 제2 고유 기능의 평균 사용 빈도수는 제1 평균 빈도수보다 적은 값을 가지는 제2 평균 빈도수 이상 및 제1 평균 빈도수 미만에 해당하는 기능이 될 수 있다. 또한, 제3 고유 기능은 제품 정 보 표시 기능, 파워 조절 기능, 설정값 변경 기능 등과 같이 일반적으로 평균 사용 빈도수가 적은 기능들로서, 제3 고유 기능의 평균 빈도수는 제2 평균 빈도수 미만에 해당하는 기능이 될 수 있다. 다양한 실시예에서, 고령친화제품의 입력부에 입력된 명령 신호 및 명령 신호에 따라 고령친화제품 의 각종 기능이 제어된 제어 기록을 저장할 수 있다. 다양한 실시예에서, 고령친화제품이 보행차인 경우 보행차의 핸들 조작과 같이 입력부의 명령 신호 입력에 의해 제어되는 것이 아닌 물리적 제어 기능의 경우 물리적 제어 기능의 사용 현황을 파악하기 위하여 고령친화제품에는 물리적 제어 기능을 검출하기 위 한 복수의 센서부가 탑재될 수 있다. 그리고, 프로세서는 복수의 센서부로부터의 센싱 정보를 수신하여 고령친화제품의 각종 기능의 제어 기록을 메모리에 저장할 수 있다. 단말은 고령친화제품과 페어링되면 고령친화제품으로부터 사용현황정보를 수신할 수 있다. 다양 한 실시예에서, 단말은 고령친화제품으로부터 주기적으로 사용현황정보를 수신할 수 있다. 사용현황정보는 입력 정보 및 입력 정보에 대응하는 제어 정보를 포함할 수 있다. 입력 정보는 고령친화제품 의 입력부가 사용자로부터 수신한 명령 신호 및 고령친화제품에 탑재되어 물리적 제어 기능을 검출하기 위한 복수의 센서부의 센싱 정보를 포함할 수 있다. 또한, 제어 정보는 고령친화제품의 프 로세서가 입력 정보에 기초하여 각 기능의 제어를 위해 생성한 제어 정보가 될 수 있다. 고령친화제품 은 단말로부터의 사용현황정보의 요청에 응답하여 저장된 제어 기록을 메모리로부터 읽어 드려 사용현황정보를 추출하고 사용현황정보를 통신부를 통해 단말로 전송할 수 있다. 단말은 고령친화제품으로부터 수신한 사용현황정보에서 입력 정보 및 입력 정보에 대응하는 제어 정 보를 추출할 수 있다. 단말은 추출한 제어 정보에 기능 사용 정보를 매칭할 수 있다. 예를 들어, 제어 정보가 가속을 위한 모터 제어 정보인 경우 이에 매칭되는 기능 사용 정보는 “가속 기능”이 될 수 있다. 단말은 기능 사용 정보로부터 기능 사용 횟수를 카운팅할 수 있다. 예들 들어, 기능 사용 정보가 “브레이 크 기능 사용” 정보인 경우 브레이크 기능의 사용 횟수를 카운팅할 수 있다. 단말은 기능 사용의 횟수에 기초하여 기능 사용 정보를 제1 내지 제3 사용 기능으로 분류할 수 있다. 제1 사용 기능은 제1 사용 기능을 사용한 빈도수가 미리 설정된 제1 유저 빈도수 이상인 경우에 해당하고, 제2 사용 기능은 제2 사용 기능을 사용한 빈도수가 미리 설정되고 제1 유저 빈도수보다는 적은 값을 가지는 제2 유 저 빈도수 이상 및 제1 유저 사용 빈도수 미만에 해당하며, 제3 사용 기능은 사용 빈도수가 제2 유저 빈도수 미 만에 해당하는 기능들이다. 제1 내지 제3 사용 기능 각각은 적어도 하나의 기능 항목을 포함할 수 있다. 단말은 제1 및 제2 사용 기능에 해당하는 기능 항목의 사용에 대한 제1 사용성 평가 정보를 사용자로부터 수신할 수 있다. 또한, 단말은 제1 및 제2 고유 기능 내의 고유 항목과 제3 사용 기능 내의 기능 항목 중 공통 항목을 추출할 수 있다. 단말은 공통 항목에 대한 제2 사용성 평가 정보를 사용자로부터 수신할 수 있다. 여기서의 제1 사용성 평가 정보는 제1 및 제2 사용 기능을 평가하기 위해 단말에서 표시된 유저 인터페이 스를 통해 사용자로부터 수신한 정보에 해당한다. 그리고, 제2 사용성 평가 정보는 공통 항목에 대한 사용의 빈 도수가 적은 이유를 평가하기 위해 단말에서 표시된 유저 인터페이스를 통해 사용자로부터 수신한 정보에 해당한다. 도 6은 본 발명의 다른 실시예에 따른 감성분석 기반의 고령친화제품의 사용성평가방법의 흐름도이다. 도 6을 참조하면, 본 발명의 다른 실시예에 따른 감성분석 기반의 고령친화제품의 사용성평가방법(S200)은 제1 고령친화제품이 에드버타이징 신호를 출력하는 단계(S201), 제1 고령친화제품이 제2 고령친화제품으로부터 응답 신호를 수신하는 단계(S202), 제1 고령친화제품이 제2 고령친화제품으로 페어링 요청 신호를 전송하는 단계 (S203), 제1 고령친화제품이 제2 고령친화제품으로부터 페어링 승인 신호를 수신하는 단계(S204), 제1 고령친화 제품이 제2 고령친화제품으로부터 사용현황정보를 수신하는 단계(S205), 기 설정된 페어링 유지 시간 동안 사용 현황정보를 수신하는 단계(S206), 제1 고령친화제품이 제1 사용현황정보 및 제2 사용현황정보를 단말로 전송하 는 단계(S207), 제1 및 제2 사용현황정보에서 제1 및 제2 입력정보와 제1 및 제2 제어 정보를 추출하는 단계 (S208), 제1 제어 정보에 제1 기능 사용 정보를 매칭하고, 제2 제어 정보에 제2 기능 사용 정보를 매칭하는 단 계(S209), 제1 및 제2 기능 사용의 횟수를 카운팅하는 단계(S210), 기능 사용의 횟수에 기초하여 제1 기능 사용 정보를 제1-1 내지 제1-3 사용 기능으로 분류하고, 제2 기능 사용 정보를 제2-1 내지 제2-3 사용 기능으로 분류 하는 단계(S211) 및 분류 결과에 기초하여 사용자에게 질의할 사용성 평가 정보의 우선 순위를 설정하는 단계 (S212)를 포함할 수 있다. 도 1, 도 2 및 도 4를 참조하면, 고령친화제품은 복수의 고령친화제품(301, 302, 303)을 포함할 수 있다. 제1 고령친화제품, 제2 고령친화제품 및 제3 고령친화제품은 모두 동일한 제품이 될 수 있고, 서로 다른 사용자에 의하여 사용되는 제품일 수 있다. 제1 사용자가 제1 고령친화제품을 사용한다고 가정할 때, 제1 고령친화제품의 사용이 개시되면, 예를 들어 전원이 온(ON)되면, 제1 고령친화제품은 에드버타이징 신호를 출력할 수 있다. 제1 고령친화제품 의 위치로부터 소정의 반경 내에 제2 고령친화제품이 존재하면, 제2 고령친화제품은 에드버타이 징 신호를 수신할 수 있다. 제2 고령친화제품은 에드버타이징 신호 내의 고유 제품정보를 분석하여 미리 설정된 고유 제품정보에 해당 하면 응답 신호를 출력할 수 있다. 여기서의 미리 설정된 고유 제품정보에 해당 여부는 서로 페어링이 가능한 제품일 때 미리 설정된 고유 제품정보에 해당한다고 본다. 제1 고령친화제품은 제2 고령친화제품이 출력한 응답 신호를 수신할 수 있다. 제1 고령친화제품은 응답 신호의 수신에 응답하여 페어링 요청 신호를 출력할 수 있다. 제2 고령친화제품은 페어링 요청 신호를 수신하는 것이 응답하여 페어링 승인 신호를 전송할 수 있다. 제1 고령친화제품은 페어링 승인 신호를 수신하는 것에 응답하여 사용현황정보 요청 신호를 출력할 수 있 다. 제2 고령친화제품은 사용현황정보 요청 신호의 수신에 응답하여 주기적으로 제2 고령친화제품의 제2 사용현황정보를 제1 고령친화제품으로 전송할 수 있다. 제2 사용현황정보는 제2 사용자가 제2 고령친화제 품을 사용할 때 제2 고령친화제품의 입력부를 통해 입력하는 입력 정보, 제2 고령친화제품의 프로세서에 의한 입력 정보에 대응하는 제어 정보를 포함할 수 있다. 제1 고령친화제품은 제2 고령친화제품과 페어링되는 기 설정된 시간 동안 제1 고령친화제품은 제2 고령친화제품의 제2 사용현황정보를 수신할 수 있다. 제1 고령친화제품은 기 설정된 시간이 도과하기 전에 페어링이 중단되는 경우, 페어링 이후 페어링 중단 시점까지 수신한 제2 사용현황정보를 메모리에서 삭제할 수 있다. 그리고, 제2 고령친화제품은 다시 에드버타이징 신호를 출력할 수 있다. 실시예는 기 설정된 시간 동안 페어링을 유지하면서 사용현황정보를 수신하는 경우에만 사용현황정보를 활용함 으로써 충분한 데이터의 분석이 가능하도록 한다. 제1 고령친화제품은 제1 고령친화제품의 입력부를 통해 입력되는 제1 입력 정보, 제1 고령친화 제품의 프로세서에 의한 제1 입력 정보에 대응하는 제1 제어 정보를 포함한 제1 사용현황정보 및 기 설정된 시간 동안 수신한 제2 사용현황정보를 제1 사용자의 제1 단말로 전송할 수 있다. 여기서의 제2 사용현황정보는 제2 고령친화제품의 입력부를 통해 입력하는 제2 입력 정보, 제2 고령 친화제품의 프로세서에 의한 제2 입력 정보에 대응하는 제2 제어 정보를 포함한다. 제1 단말은 제1 사용현황정보에서 제1 입력 정보 및 제1 제어 정보를 추출하고, 제2 사용현황정보에서 제2 입력 정보 및 제2 제어 정보를 추출할 수 있다. 제1 단말은 제1 제어 정보에 제1 기능 사용 정보를 매칭하고, 제2 제어 정보에 제2 기능 사용 정보를 매칭 할 수 있다. 제1 단말은 제1 기능 사용 정보로부터 제1 기능 사용의 횟수를 카운팅하고, 제2 기능 사용 정보로부터 제2 기능 사용의 횟수를 카운팅할 수 있다. 제1 단말은 제1 기능 사용 횟수에 기초하여 제1 기능 사용 정보를 제1-1 내지 제1-3 사용 기능으로 분류하 고, 제2 기능 사용 횟수에 기초하여 제2 기능 사용 정보를 제2-1 내지 제2-3 사용 기능으로 분류할 수 있다. 제1 단말은 제1-1 및 제1-2 사용 기능으로 분류된 기능 항목과 제2-1 및 제2-2 사용 기능으로 분류된 기능 항목 중 공통 항목이 존재하면, 해당 공통 항목의 사용성 평가를 질의하는 유저 인터페이스를 표시할 수 있다. 제1 단말은 제1 사용자로부터 제1 사용성 평가 정보를 수신할 수 있다. 또한, 제1 단말은 제1-3 사용 기능으로 분류된 기능 항목과 제2-3 사용 기능으로 분류된 기능 항목 그리고, 제1 및 제2 고유 기능 내의 고유 항목에 모두 해당하는 공통 항목이 존재하면 제1 사용자로부터 해당 공통 항목의 사용성 평가를 질의하는 유저 인터페이스를 표시할 수 있다. 그리고, 제1 단말은 제1 사용자 로부터 제2 사용성 평가 정보를 수신할 수 있다. 여기서의 제1 및 제2 사용성 평가 정보의 성격은 앞서 설명한 바와 같다. 전술한 실시예는 제1 및 제2 고령친화제품(301, 302)을 대상으로 설명하였으나, 제1 고령친화제품은 제2 고령친화제품으로부터 제2 사용현황정보를 수신하는 것 뿐만 아니라 페어링된 제3 고령친화제품으로 부터 제3 사용현황정보를 수신할 수도 있다. 또한, 제1 고령친화제품은 페어링된 보다 많은 다른 고령친화 제품들로부터 사용현황정보를 수집할 수도 있다. 그리고, 제1 및 제2 사용성 평가 정보 수신하는데 있어서, 전 술한 바와 같이 평가 대상 항목은 페어링된 모든 고령친화제품들의 기능 사용의 횟수, 공통 항목을 분석하 여 설정될 수 있다. 전술한 실시예는 제1 고령친화제품이 제2 고령친화제품으로부터 제2 사용현황정보를 수신하고, 제1 단말에서 사용성 평가가 이루어지는 것으로 설명하였으나, 이에 제한되는 것은 아니고 위 프로세스는 그대 로 진행하면서도 제2 고령친화제품은 독자적으로 제1 고령친화제품으로부터 제1 사용현황정보를 수신 하고 제2 사용자의 제2 단말에서도 전술한 바와 같은 사용성 평가가 이루어질 수도 있다. 즉, 고령의 사용 자들이 모두 자신의 단말을 통해서 설문을 진행할 것을 기대하기는 어려운 점을 고려하여 복수의 단말들 중에서 어느 하나의 단말에서라도 설문이 이루어질 경우 다수의 사용자들의 사용 관점을 반영한 사용성 평가가 이루지도록 한다. 또한, 실시예는, 사용성 평가 정보에 기초하여 고령친화제품의 복수의 기능들 각각에 대한 기능에 대한 펌 웨어 업데이트, 구조적인 개선을 통한 신제품 출시가 가능하도록 한다.또한, 실시예는 주요 기능에 대한 설문을 우선적으로 진행함에 따라 고령자로 하여금 사용성 평가 설문의 부담 을 줄이고 그에 따라 사용성 평가 정보의 수집을 용이하게 한다. 또한, 실시예는 다수의 사용자가 주로 사용하는 기능에 대한 설문을 우선적으로 진행함으로서 사용자 관점에서 사용 빈도가 높은 기능의 평가가 우선적으로 이루어지도록 한다. 또한, 실시예는 고령친화제품의 특성 상 다수의 사용자들이 주로 사용하는 기능에 대한 사용성 평가가 중 요하게 여겨지는 특성을 가지는 제품에 보다 적합한 사용성 평가 프로세스를 제공할 수 있다. 또한, 실시예는 다수의 사용자가 주로 사용하는 기능, 즉 실제 사용자들에게 보다 중요하게 여겨지는 기능을 우 선적으로 업데이트할 수 있도록 해당 기능의 사용성 평가 정보에 대한 데이터 수집이 용이하도록 한다. 또한, 실시예는 복수의 고령친화제품들이 페어링될 때, 복수의 고령친화제품들의 사용현황정보를 수집하여 이를 토대로 사용성 평가 정보를 수집할 수 있다. 이는, 다수의 사용자가 고령친화제품들을 동일한 환경에서 사용할 때의 사용자들이 주로 사용하는 기능 및 기능의 사용성을 평가할 수 있다. 따라서, 고령친화제품이 사용되는 환 경이 중요한 고려 대상인 경우와 같이 특정 환경에서 다수의 사용자가 어떤 방식으로 제품을 사용하는지에 대한 정보의 취득이 중요한 경우에 보다 유의미한 사용성 평가 정보를 수집할 수 있다. 또한, 실시예는 사용자들이 주로 사용하는 기능에 대해서 우선적으로 설문을 진행할 뿐만 아니라, 주로 사용되 어야 하는 기능이나 사용자들의 사용 빈도가 낮은 기능에 대해서는 사용 빈도가 낮은 이유를 질의함으로써 중요 기능에 대한 사용을 유도하면서도 중요 기능이나 사용 빈도가 낮은 기능의 발생 이유에 대한 평가 정보를 수집 하여 고령친화제품 개발에 중요 정보가 수집되도록 한다. 다양한 실시예에서, 단말은 사용성 평가를 지정할 때, 전술한 공통 항목이 이전 사용성 평가 대상에 속하 는지 여부를 판단할 수 있다. 그리고, 단말은 공통 항목이 이전 사용성 평가 대상에 속하면서도 기술적으 로 업데이트되지 않은 경우에는 사용성 평가 항목에서 배제할 수 있다. 이와 달리, 공통 항목이 이전 사용성 평 가 대상에 속하지만 기술적으로 업데이트된 기능에 해당하는 경우에는 전술한 바와 같이 사용성 평가 대상으로 삼을 수 있다. 따라서, 제품 개발자나 제조 업체 또는 써드 파티 측에서 고령친화제품이 가지는 기능에 대 한 기술적 업데이트를 진행한 경우에는 비록 이전에 사용성 평가 대상이었더라도 다시 한번 더 사용성 평가가 이루어지도록 하여 업데이트된 기능에 대한 사용성 평가 정보를 수집하도록 하고, 기술적 업데이트가 되지 않았 고 이전에 이미 사용성 평가 대상이었다면 사용성 평가 대상에서 제외함으로써 설문의 질적 수준을 향상시키고 사용자의 설문 참여율을 높일 수 있다. 이상 설명된 본 발명에 따른 실시예는 다양한 컴퓨터 구성요소를 통하여 실행될 수 있는 프로그램 명령어의 형 태로 구현되어 컴퓨터 판독 가능한 기록 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능한 기록 매체는 프로그 램 명령어, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 컴퓨터 판독 가능한 기록 매체에 기록되는 프로그램 명령어는 본 발명을 위하여 특별히 설계되고 구성된 것이거나 컴퓨터 소프트웨 어 분야의 당업자에게 공지되어 사용 가능한 것일 수 있다. 컴퓨터 판독 가능한 기록 매체의 예에는, 하드 디 스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체, CD-ROM 및 DVD와 같은 광기록 매체, 플롭티컬 디스크 (floptical disk)와 같은 자기-광 매체(magneto-optical medium), 및 ROM, RAM, 플래시 메모리 등과 같은, 프 로그램 명령어를 저장하고 실행하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령어의 예에는, 컴파일러에 의하여 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용하여 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드도 포함된다. 하드웨어 장치는 본 발명에 따른 처리를 수행하기 위하여 하나 이 상의 소프트웨어 모듈로 변경될 수 있으며, 그 역도 마찬가지이다. 본 발명에서 설명하는 특정 실행들은 일 실시 예들로서, 어떠한 방법으로도 본 발명의 범위를 한정하는 것은 아 니다. 명세서의 간결함을 위하여, 종래 전자적인 구성들, 제어 시스템들, 소프트웨어, 상기 시스템들의 다른 기 능적인 측면들의 기재는 생략될 수 있다. 또한, 도면에 도시된 구성 요소들 간의 선들의 연결 또는 연결 부재들 은 기능적인 연결 및/또는 물리적 또는 회로적 연결들을 예시적으로 나타낸 것으로서, 실제 장치에서는 대체 가 능하거나 추가의 다양한 기능적인 연결, 물리적인 연결, 또는 회로 연결들로서 나타내어질 수 있다. 또한, “필 수적인”, “중요하게” 등과 같이 구체적인 언급이 없다면 본 발명의 적용을 위하여 반드시 필요한 구성 요소 가 아닐 수 있다. 또한 설명한 본 발명의 상세한 설명에서는 본 발명의 바람직한 실시 예를 참조하여 설명하였지만, 해당 기술 분"}
{"patent_id": "10-2022-0169624", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "야의 숙련된 당업자 또는 해당 기술분야에 통상의 지식을 갖는 자라면 후술할 특허청구범위에 기재된 본 발명의 사상 및 기술 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수정 및 변경시킬 수 있음을 이해할수 있을 것이다. 따라서, 본 발명의 기술적 범위는 명세서의 상세한 설명에 기재된 내용으로 한정되는 것이 아 니라 특허청구범위에 의해 정하여져야만 할 것이다."}
{"patent_id": "10-2022-0169624", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 다양한 실시 예에 따른 감성분석 기반의 고령친화제품의 사용성평가 시스템을 나타낸다. 도 2는 본 발명의 실시예에 따른 감성분석 기반의 고령친화제품의 사용성평가 시스템을 구성하는 고령친화제품 의 블록도이다. 도 3은 본 발명의 실시예에 따른 감성분석 기반의 고령친화제품의 사용성평가방법에서 사용성 평가 감성 분류 모델을 생성하는 방법의 흐름도이다. 도 4는 본 발명의 실시예에 따른 감성분석 기반의 고령친화제품의 사용성평가방법의 흐름도이다. 도 5는 본 발명의 다른 실시예에 따른 감성분석 기반의 고령친화제품의 사용성평가방법의 흐름도이다. 도 6은 본 발명의 다른 실시예에 따른 감성분석 기반의 고령친화제품의 사용성평가방법의 흐름도이다."}
