{"patent_id": "10-2021-7031361", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0144730", "출원번호": "10-2021-7031361", "발명의 명칭": "데이터 기억", "출원인": "베이징 센스타임 테크놀로지 디벨롭먼트 컴퍼니", "발명자": "장, 펑"}}
{"patent_id": "10-2021-7031361", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "데이터를 저장하기 위한 방법에 있어서,저장 대기 데이터에 필요한 저장 공간의 크기에 기반하여 목표 메모리 중의 적어도 두 개의 후보 저장 공간을확정하는 것;상기 저장 대기 데이터의 제1 데이터 해제 시간 및 수명 주기 중의 적어도 하나에 기반하여 상기 저장 대기 데이터를 상기 적어도 두 개의 후보 저장 공간에 기억하는 복수의 후보 저장 방식 중의 각 후보 저장 방식의 목표가중치를 확정하는 것; 및상기 복수의 후보 저장 방식 중의 각 후보 저장 방식의 목표 가중치에 기반하여 상기 저장 대기 데이터의 목표저장 방식을 확정하는 것을 포함하되,각 후보 저장 공간은 적어도 하나의 후보 저장 방식에 대응하는것을 특징으로 하는 데이터를 저장하기 위한 방법."}
{"patent_id": "10-2021-7031361", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 후보 저장 공간에 대응하는 후보 저장 방식은 제1 후보 저장 방식 및 제2 후보 저장 방식 중의 적어도 하나를 포함하고,상기 제1 후보 저장 방식 중의 시작 기억 주소는 상기 후보 저장 공간의 시작 주소이며, 상기 제2 후보 저장 방식 중의 종료 기억 주소는 상기 후보 저장 공간의 종료 주소인것을 특징으로 하는 데이터를 저장하기 위한 방법."}
{"patent_id": "10-2021-7031361", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항 또는 제2항에 있어서,상기 저장 대기 데이터에 대응하는 제1 데이터 해제 시간 및 수명 주기 중의 적어도 하나에 기반하여 상기 저장대기 데이터를 상기 적어도 두 개의 후보 저장 공간에 기억하는 복수의 후보 저장 방식 중의 각 후보 저장 방식의 목표 가중치를 확정하는 것은,복수의 후보 저장 방식에 대해, 상기 저장 대기 데이터의 제1 데이터 해제 시간 및 제2 데이터 해제 시간에 기반하여 당해 후보 저장 방식의 목표 가중치를 확정하는 것을 포함하고,상기 제2 데이터 해제 시간은 상기 저장 대기 데이터의 상기 후보 저장 방식 중의 기억 위치에 인접하는 저장공간에 기억된 데이터의 데이터 해제 시간인것을 특징으로 하는 데이터를 저장하기 위한 방법."}
{"patent_id": "10-2021-7031361", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,당해 후보 저장 방식의 상기 목표 가중치는 상기 제1 데이터 해제 시간과 상기 제2 데이터 해제 시간 사이의 시간 간격과 음의 상관 관계를 가지는것을 특징으로 하는 데이터를 저장하기 위한 방법."}
{"patent_id": "10-2021-7031361", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2021-0144730-3-제1항 또는 제2항에 있어서,상기 저장 대기 데이터에 대응하는 제1 데이터 해제 시간 및 수명 주기 중의 적어도 하나에 기반하여 상기 저장대기 데이터를 상기 적어도 두 개의 후보 저장 공간에 기억하는 복수의 후보 저장 방식 중의 각 후보 저장 방식의 목표 가중치를 확정하는 것은,복수의 후보 저장 방식에 대해, 상기 저장 대기 데이터의 수명 주기 및 상기 후보 저장 방식에 대응하는 후보저장 공간의 시작 주소에 기반하여 당해 후보 저장 방식의 목표 가중치를 확정하는 것을 포함하는것을 특징으로 하는 데이터를 저장하기 위한 방법."}
{"patent_id": "10-2021-7031361", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 복수의 후보 저장 방식에 대해, 상기 저장 대기 데이터의 수명 주기 및 당해 후보 저장 방식에 대응하는후보 저장 공간의 시작 주소에 기반하여 당해 후보 저장 방식의 목표 가중치를 확정하는 것은,상기 저장 대기 데이터에 대응하는 최대 수명 주기를 확정하는 것;상기 저장 대기 데이터의 수명 주기와 상기 최대 수명 주기 사이의 제1 비율값을 확정하는 것;당해 후보 저장 방식에 대응하는 후보 저장 공간의 시작 주소와 상기 목표 메모리의 종료 주소 사이의 제2 비율값을 확정하는 것; 및상기 제1 비율값 및 상기 제2 비율값에 기반하여 당해 후보 저장 방식의 상기 목표 가중치를 확정하는 것을 포함하는것을 특징으로 하는 데이터를 저장하기 위한 방법."}
{"patent_id": "10-2021-7031361", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 후보 저장 방식의 상기 목표 가중치는 상기 제1 비율값과 상기 제2 비율값 사이의 차분 절대치와 음의 상관 관계를 가지는것을 특징으로 하는 데이터를 저장하기 위한 방법."}
{"patent_id": "10-2021-7031361", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항 또는 제2항에 있어서,상기 저장 대기 데이터에 대응하는 제1 데이터 해제 시간 및 수명 주기 중의 적어도 하나에 기반하여 상기 저장대기 데이터를 상기 적어도 두 개의 후보 저장 공간에 기억하는 복수의 후보 저장 방식 중의 각 후보 저장 방식의 목표 가중치를 확정하는 것은,복수의 후보 저장 방식에 대해, 상기 저장 대기 데이터에 대응하는 제1 데이터 해제 시간 및 제2 데이터 해제시간에 기반하여 당해 후보 저장 방식의 제1 가중치를 확정하는 것;상기 저장 대기 데이터의 수명 주기 및 당해 후보 저장 방식에 대응하는 후보 저장 공간의 시작 주소에 기반하여 당해 후보 저장 방식의 제2 가중치를 확정하는 것; 및상기 제1 가중치와 상기 제2 가중치의 가중치 합에 기반하여 당해 후보 저장 방식의 목표 가중치를 얻는 것을포함하되,상기 제2 데이터 해제 시간은 상기 저장 대기 데이터의 당해 후보 저장 방식 중의 기억 위치에 인접하는 저장공간에 기억된 데이터의 데이터 해제 시간인것을 특징으로 하는 데이터를 저장하기 위한 방법."}
{"patent_id": "10-2021-7031361", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항 또는 제2항에 있어서,공개특허 10-2021-0144730-4-상기 저장 대기 데이터의 제1 데이터 해제 시간 및 수명 주기 중의 적어도 하나에 기반하여 상기 저장 대기 데이터를 상기 적어도 두 개의 후보 저장 공간에 기억하는 복수의 후보 저장 방식 중의 각 후보 저장 방식의 목표가중치를 확정하는 것은,복수의 후보 저장 방식에 대해, 상기 저장 대기 데이터의 제1 데이터 해제 시간, 수명 주기 및 당해 후보 저장방식에 대응하는 저장 공간의 크기에 기반하여 당해 후보 저장 방식의 목표 가중치를 확정하는 것을 포함하는것을 특징으로 하는 데이터를 저장하기 위한 방법."}
{"patent_id": "10-2021-7031361", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 당해 후보 저장 방식의 목표 가중치를 확정하는 것은,상기 저장 대기 데이터에 대응하는 제1 데이터 해제 시간 및 제2 데이터 해제 시간에 기반하여 당해 후보 저장방식의 제1 가중치를 확정하는 것;상기 저장 대기 데이터의 수명 주기 및 당해 후보 저장 방식에 대응하는 후보 저장 공간의 시작 주소에 기반하여 당해 후보 저장 방식의 제2 가중치를 확정하는 것;상기 후보 저장 방식에 대응하는 후보 저장 공간의 크기 및 상기 목표 메모리의 합계 저장 공간의 크기에 기반하여 당해 후보 저장 방식의 제3 가중치를 확정하는 것; 및상기 제1 가중치, 상기 제2 가중치 및 상기 제3 가중치의 가중치 합에 기반하여 당해 후보 저장 방식의 상기 목표 가중치를 얻는 것을 포함하되,상기 제2 데이터 해제 시간은 상기 저장 대기 데이터의 당해 후보 저장 방식 중의 기억 위치에 인접하는 저장공간에 기억된 데이터의 데이터 해제 시간인것을 특징으로 하는 데이터를 저장하기 위한 방법."}
{"patent_id": "10-2021-7031361", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항 또는 제2항에 있어서,상기 저장 대기 데이터의 제1 데이터 해제 시간 및 수명 주기 중의 적어도 하나에 기반하여 상기 저장 대기 데이터를 상기 적어도 두 개의 후보 저장 공간에 기억하는 복수의 후보 저장 방식 중의 각 후보 저장 방식의 목표가중치를 확정하는 것은,복수의 후보 저장 방식에 대해, 상기 저장 대기 데이터의 제1 데이터 해제 시간 및 당해 후보 저장 방식에 대응하는 저장 공간의 크기에 기반하여 당해 후보 저장 방식의 목표 가중치를 확정하는 것을 포함하는것을 특징으로 하는 데이터를 저장하기 위한 방법."}
{"patent_id": "10-2021-7031361", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1항 또는 제2항에 있어서,상기 저장 대기 데이터의 제1 데이터 해제 시간 및 수명 주기 중의 적어도 하나에 기반하여 상기 저장 대기 데이터를 상기 적어도 두 개의 후보 저장 공간에 기억하는 복수의 후보 저장 방식 중의 각 후보 저장 방식의 목표가중치를 확정하는 것은,복수의 후보 저장 방식에 대해, 상기 저장 대기 데이터의 수명 주기 및 당해 후보 저장 방식에 대응하는 저장공간의 크기에 기반하여 당해 후보 저장 방식의 목표 가중치를 확정하는 것을 포함하는것을 특징으로 하는 데이터를 저장하기 위한 방법."}
{"patent_id": "10-2021-7031361", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제1항 내지 제12항 중 어느 한 항에 있어서,상기 저장 대기 데이터를 상기 목표 저장 방식에 대응하는 후보 저장 공간의 제1 주소부터 제2 주소에 기억하는공개특허 10-2021-0144730-5-것; 및상기 제1 주소부터 상기 제2 주소에 대응하는 저장 공간을 이미 할당한 저장 공간으로 설정하는 것을 더 포함하되,상기 제1 주소 및 상기 제2 주소 중의 하나는 상기 목표 저장 방식에 대응하는 후보 저장 공간의 시작 주소이거나, 상기 제1 주소 및 상기 제2 주소 중의 하나는 상기 목표 저장 방식에 대응하는 후보 저장 공간의 종료 주소인것을 특징으로 하는 데이터를 저장하기 위한 방법."}
{"patent_id": "10-2021-7031361", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 저장 대기 데이터에 대응하는 제1 데이터 해제 시간에 도달한 후에, 상기 제1 주소부터 상기 제2 주소에대응하는 저장 공간을 해제하는 것; 및상기 제1 주소부터 상기 제2 주소에 대응하는 저장 공간을 할당하지 않은 저장 공간으로 설정하는 것을 더 포함하는것을 특징으로 하는 데이터를 저장하기 위한 방법."}
{"patent_id": "10-2021-7031361", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제1항 내지 제14항 중 어느 한 항에 있어서,상기 복수의 후보 저장 방식 중의 각 후보 저장 방식의 목표 가중치에 기반하여 상기 저장 대기 데이터의 목표저장 방식을 확정하는 것은,상기 복수의 후보 저장 방식의 각각의 목표 가중치 중에서 가장 큰 목표 가중치에 대응하는 후보 저장 방식을상기 저장 대기 데이터의 상기 목표 저장 방식으로 확정하는 것; 또는,상기 복수의 후보 저장 방식의 각각의 목표 가중치 중에서 소정의 가중치 한계값을 초과하는 임의의 목표 가중치에 대응하는 후보 저장 방식을 상기 목표 저장 방식으로 확정하는 것을 포함하는것을 특징으로 하는 데이터를 저장하기 위한 방법."}
{"patent_id": "10-2021-7031361", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제1항 내지 제15항 중 어느 한 항에 있어서,상기 목표 메모리는 인공 지능(AI) 칩의 공유 캐쉬인것을 특징으로 하는 데이터를 저장하기 위한 방법."}
{"patent_id": "10-2021-7031361", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "데이터 처리 장치에 있어서,저장 대기 데이터에 필요한 저장 공간의 크기에 기반하여 목표 메모리 중의 적어도 두 개의 후보 저장 공간을확정하기 위한 제1 확정 유닛;상기 저장 대기 데이터의 제1 데이터 해제 시간 및 수명 주기 중의 적어도 하나에 기반하여 상기 저장 대기 데이터를 상기 적어도 두 개의 후보 저장 공간에 기억하는 복수의 후보 저장 방식 중의 각 후보 저장 방식의 목표가중치를 확정하기 위한 제2 확정 유닛; 및상기 복수의 후보 저장 방식 중의 각 후보 저장 방식의 목표 가중치에 기반하여 상기 저장 대기 데이터의 목표저장 방식을 확정하기 위한 제3 확정 유닛을 구비하되,각 후보 저장 공간은 적어도 하나의 후보 저장 방식에 대응하는것을 특징으로 하는 데이터 처리 장치.공개특허 10-2021-0144730-6-청구항 18 컴퓨터 프로그램이 기록되어 있는 컴퓨터 판독 가능 기록 매체에 있어서,상기 컴퓨터 프로그램은 프로그램 명령을 포함하고,상기 프로그램 명령이 전자 디바이스의 프로세서에 의해 실행될 때에, 상기 프로세서로 하여금 제1항 내지 제16항 중 어느 한 항에 기재된 방법에 실행하도록 하는것을 특징으로 하는 컴퓨터 판독 가능 기록 매체."}
{"patent_id": "10-2021-7031361", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "전자 디바이스에 있어서,프로세서에 의해 실행 가능한 명령이 기억되어 있는 메모리; 목표 메모리; 및 프로세서를 포함하고,상기 프로세서에 의해 상기 명령이 실행될 때에, 제1항 내지 제16항 중 어느 한 항에 기재된 방법이 구현되는것을 특징으로 하는 전자 디바이스."}
{"patent_id": "10-2021-7031361", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서,상기 전자 디바이스는 AI 칩이며,상기 목표 메모리는 상기 AI 칩의 공유 캐쉬인것을 특징으로 하는 전자 디바이스."}
{"patent_id": "10-2021-7031361", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 실시예는 데이터를 저장하기 위한 방법 및 관련 제품을 개시하고, 당해 방법은 저장 대기 데이터에 필 요한 저장 공간의 크기에 기반하여 목표 메모리 중의 적어도 두 개의 후보 저장 공간을 확정하는 것; 상기 저장 대기 데이터의 제1 데이터 해제 시간 및 수명 주기 중의 적어도 하나에 기반하여 상기 저장 대기 데이터를 상기 적어도 두 개의 후보 저장 공간에 기억하는 복수의 후보 저장 방식 중의 각 후보 저장 방식의 목표 가중치를 확 정하는 것; 및 상기 복수의 후보 저장 방식 중의 각 후보 저장 방식에 대응하는 목표 가중치에 기반하여 상기 저 장 대기 데이터의 목표 저장 방식을 확정하는 것을 포함하되, 각 후보 저장 공간은 적어도 하나의 후보 저장 방 식에 대응한다."}
{"patent_id": "10-2021-7031361", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 컴퓨터 분야에 관한 것으로, 특히, 데이터를 저장하기 위한 방법 및 관련 제품에 관한 것이다."}
{"patent_id": "10-2021-7031361", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공 지능(artificial intelligence, AI) 칩은 일반적으로 서로 다른 기능을 가지는 복수의 계산 유닛, 한정된 스페이스를 구비한 고속 공유 캐쉬 및 더블 데이터 레이트 동기 다이나믹 랜덤 액세스 메모리(Double Data Rate Synchronous Dynamic Random Access Memory, DDR SDRAM, DDR)에 의해 구성된다. 본 발명의 실시예는 데이터를 저장하기 위한 방법 및 관련 제품을 개시한다. 제1 양태에 따르면, 본 발명의 실시예는 데이터를 저장하기 위한 방법을 제공하는바, 당해 방법은 저장 대기 데 이터에 필요한 저장 공간의 크기에 기반하여 목표 메모리 중의 적어도 두 개의 후보 저장 공간을 확정하는 것; 상기 저장 대기 데이터의 제1 데이터 해제 시간 및 수명 주기 중의 적어도 하나에 기반하여 상기 저장 대기 데 이터를 상기 적어도 두 개의 후보 저장 공간에 기억하는 복수의 후보 저장 방식 중의 각 후보 저장 방식의 목표 가중치를 확정하는 것; 및 상기 복수의 후보 저장 방식 중의 각 후보 저장 방식의 목표 가중치에 기반하여 상기 저장 대기 데이터의 목표 저장 방식을 확정하는 것을 포함하되, 각 후보 저장 공간은 적어도 하나의 후보 저장 방식에 대응한다. 제2 양태에 따르면, 본 발명의 실시예는 데이터 처리 장치를 제공하는바, 당해 장치는 저장 대기 데이터에 필요 한 저장 공간의 크기에 기반하여 목표 메모리 중의 적어도 두 개의 후보 저장 공간을 확정하기 위한 제1 확정 유닛; 상기 저장 대기 데이터의 제1 데이터 해제 시간 및 수명 주기 중의 적어도 하나에 기반하여 상기 저장 대 기 데이터를 상기 적어도 두 개의 후보 저장 공간에 기억하는 복수의 후보 저장 방식 중의 각 후보 저장 방식의 목표 가중치를 확정하기 위한 제2 확정 유닛; 및 상기 복수의 후보 저장 방식 중의 각 후보 저장 방식의 목표 가중치에 기반하여 상기 저장 대기 데이터의 목표 저장 방식을 확정하기 위한 제3 확정 유닛을 구비하되, 각 후보 저장 공간은 적어도 하나의 후보 저장 방식에 대응한다. 제3 양태에 따르면, 본 발명의 실시예는 전자 디바이스를 제공하는바, 당해 전자 디바이스는 프로세서에 의해 실행 가능한 명령이 기억되어 있는 메모리; 목표 메모리; 및 프로세서를 포함하되, 상기 프로세서에 의해 상기 명령이 실행될 때에, 상기 제1 양태 및 임의의 옵션의 실시 형태의 방법이 구현된다. 제4 양태에 따르면, 본 발명의 실시예는 칩을 제공하는바, 당해 칩은 프로세서; 데이터 인터페이스; 및 상기 제 1 양태에 기재된 목표 메모리를 포함하되, 프로세서는 제1 양태 또는 제1 양태의 임의의 구현 가능한 형태의 방 법을 실행한다. 제5 양태에 따르면, 본 발명의 실시예는 컴퓨터 판독 가능 기록 매체를 제공하는바, 당해 컴퓨터 기록 매체에는 컴퓨터 프로그램이 기억되어 있으며, 당해 컴퓨터 프로그램은 프로그램 명령을 포함하고, 당해 프로그램 명령이 전자 디바이스의 프로세서에 의해 실행될 때에, 당해 프로세서로 하여금 상기 제1 양태 및 임의의 옵션의 실시 형태의 방법을 실행하도록 한다. 제6 양태에 따르면, 본 발명의 실시예는 컴퓨터 프로그램 제품을 제공하는바, 당해 컴퓨터 프로그램 제품은 프 로그램 명령을 포함하고, 상기 프로그램 명령이 프로세서에 의해 실행될 때에, 상기 프로세서가 상기 제1 양태 및 임의의 옵션의 실시 형태의 방법을 실행하도록 한다. 본 발명의 실시예에 있어서, 상기 저장 대기 데이터의 제1 데이터 해제 시간 및 수명 주기 중의 적어도 하나에 기반하여 상기 저장 대기 데이터를 상기 적어도 두 개의 후보 저장 공간에 기억하는 복수의 후보 저장 방식 중 의 각 후보 저장 방식의 목표 가중치를 확정함으로써, 복수의 후보 저장 방식 중에서 메모리의 단편화를 효과적 으로 줄일 수 있는 저장 방식을 확정할 수 있다."}
{"patent_id": "10-2021-7031361", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 명세서 실시예, 특허청구의 범위 및 상기 도면에 있어서의 \"제1\", \"제2\" 및 \"제3\" 등과 같은 용어는 유사한 대상을 구별하기 위하여 사용될 뿐, 특정 순서 또는 매우 뛰어난 우선 순위를 설명하기 위하여 사용되지 않는다. 한편, \"포함\" 및 \"구비\"와 같은 용어 및 이들의 임의의 변형은 예를 들면 일련의 단계 또는 유닛을 포 함하는 비배타적인 포함을 커버하려는 것을 의도하고 있다. 방법, 시스템, 제품 또는 디바이스는 반드시 이들의 명확히 리스트된 단계 또는 유닛에 한정되지 않으며, 명확히 리스트 되지 않은, 이러한 과정, 방법, 제품 또는 디바이스의 고유의 기타 단계 또는 유닛을 포함할 수 있다. AI 칩의 고속 공유 캐쉬의 크기는 일반적으로 수 MB이며, 현재의 일반적인 것은 8MB 또는 12MB이다. CPU의 레지 스터는 AI 칩의 명령 및 중앙 처리 장치(Central Processing Unit, CPU)의 명령과는 다른바, CPU의 레지스터는 고정의 크기를 가지며, 예를 들면 32 비트의 CPU의 레지스터는 32비트에 고정되어 있다. 그러나, AI 칩에는 레 지스터가 없고, 또한 뉴럴 네트워크의 텐서(tensor)의 크기도 고정되어 있지 않으며, 고정된 저장 공간을 tensor에 분배할 수 없다. 한정된 공유 캐쉬 공간 및 할당 대기의 tensor의 고정되지 않은 크기를 고려하면, 할 당 전략이 효과적이지 않을 경우, 메모리의 단편화가 매우 용이하게 발생하는바, 이러한 메모리의 단편화는 작 은 불연속인 형식으로 서로 다른 위치에 출현되며, 이러한 비어 있는 메모리를 사용할 수 없게 되어, 고속 공유 캐쉬의 역할을 충분히 발휘할 수 없다. 실제로는 이러한 비어 있는 메모리의 단편화가 존재하는 형식은 내부 단 편화 및 외부 단편화와 같은 두 가지가 있다. 내부 단편화의 발생: 모든 메모리 할당은 4, 8 또는 16로 나뉘어 떨어지는(프로세서 아키텍처에 따라 다름) 주 소에서 시작할 필요가 있기 때문에, 또는 메모리 관리 유닛(memory management unit, MMU)의 페이징 메커니즘에한정되기 때문에, 메모리 할당 알고리즘은 소정의 크기의 메모리 블록만을 데이터에 대해 할당할 수 있다. 특정 데이터를 저장할 때에 43 바이트의 메모리 블록을 점용할 필요가 있다고 가정하면, 적절한 크기의 메모리가 없 기 때문에, 44 바이트, 48 바이트 등의 약간 큰 바이트를 얻을 수 있다. 따라서, 필요한 사이즈를 반올림하여 발생되는 여분의 공간을 내부 단편화라고 부른다. 외부 단편화의 발생: 빈번한 할당 및 물리 페이지의 재이용에 의해, 대량의 연속된 작은 페이지 블록이 이미 분 배된 페이지 중에 산재하여, 외부 단편화가 발생하게 된다. 하나의 블록의 합계 100개의 단위(예를 들면 하나의 주소)의 연속된 비어 있는 메모리 공간이 있으며, 범위가 0∼99인 것으로 가정한다. 그 중에서 하나의 블록의 메모리 예를 들면 10개의 단위를 신청할 경우, 신청된 메모리 블록은 0∼9의 구간을 점용할 수 있다. 이 때, 만 약 5개의 단위 등의 하나의 블록의 메모리를 계속하여 신청하면, 신청된 2번째 블록의 메모리 블록은 10∼14의 구간을 점용하게 된다. 첫 번째 블록의 메모리 블록을 해제한 후, 또 20개의 단위 등의 10개의 단위보다 큰 하 나의 블록의 메모리 블록을 신청하면, 앞에 해제한 메모리 블록이 새로운 요건을 충족시킬 수 없기 때문에, 15 로부터 시작하여 20개의 단위의 메모리 블록을 할당하게 된다. 현재의 메모리 공간의 전체 상태는 0∼9이 비어 있고, 10∼14이 점용되어 있으며, 15∼24이 점용되어 있고, 25∼99가 비어 있다. 여기서, 0∼9이 하나의 메모리 의 단편이다. 10∼14이 항상 점용되어 있고, 또 그 후에 신청하는 공간이 모두 10개의 단위보다 크면, 0∼9의 구간을 사용할 수 없게 되어 0∼9구간이 외부 단편화로 된다. 본 발명의 실시예는 고속 공유 캐쉬의 역할을 충분히 발휘하기 위하여, 단편화를 줄일 수 있는 데이터를 저장하 기 위한 방법을 제공한다. 본 발명의 실시예에 의해 제공되는 데이터를 저장하기 위한 방법은 주로 AI 칩 중의 공유 캐쉬를 할당하는 시나 리오에 적용된다. AI 칩에 의해, 텍스트 식별, 이미지 식별, 이미지 초해상도 처리, 음성 식별, 텍스트 번역 등 과 같은 데이터 처리 태스크를 실행하기 위하여서는 모두 공유 캐쉬를 점용할 필요가 있음을 이해해야 한다. 즉, 본 발명의 실시예에 의해 제공되는 데이터를 저장하기 위한 방법은 주로 AI 칩을 이용하여 데이터 처리 태 스크를 실행하는 시나리오에 적용되지만, 본 발명의 실시예에 의해 제공되는 데이터를 기억하기 위한 방법은, 기타 메모리 또는 캐쉬를 할당하는 장면에도 적용되는바, 본 발명의 실시예는 이에 대해 한정하지 않는다. 본 발명의 실시예에 의해 제공되는 데이터를 저장하기 위한 방법은 또한, AI 모델의 컴파일 장면에도 적용될 수 있는바, 즉 AI 모델을 컴파일 소프트웨어를 이용하여 AI 칩에 의해 실행 가능한 명령 시퀀스에 컴파일하는 장면 에도 적용된다. AI 모델의 컴파일의 장면에 있어서, 데이터 처리 장치는 본 발명의 실시예에 의해 제공되는 데 이터를 저장하기 위한 방법을 실행함으로써, AI 모델이 처리 조작을 실행할 때의 공유 캐쉬의 할당을 시뮬레이 트하고, 또한 AI 모델을 컴파일하여 공유 캐쉬의 메모리 할당 및 해제를 지시할 수 있는 명령 시퀀스를 얻을 수 있다. AI 칩이 AI 모델을 컴파일하여 명령 시퀀스를 얻을 때에, 공유 캐쉬의 메모리 할당 및 해제의 흐름은 본 발명의 실시예에 의해 제공되는 데이터를 저장하기 위한 방법을 실행하여 얻은 메모리 할당 및 해제의 흐름과 같다. 이러한 장면에 있어서, AI 칩은 데이터 처리 태스크를 실행할 때에 본 발명의 실시예에 의해 제공되는 데 이터를 저장하기 위한 방법을 실시간으로 실행할 필요가 없으며, 명령 시퀀스만 실행하면 되기에, 더 적은 시간 을 소모한다. 상기 장면에 있어서, 데이터 처리 장치 중의 AI 칩은 데이터 처리 태스크를 실행할 때에 메모리의 단편화의 발 생을 줄이고, 캐쉬 할당의 성공률을 향상시킬 수 있다. 이하, 먼저 본 발명의 실시예에 나타나는 몇몇의 용어의 의미를 소개한다. AI 칩의 공유 캐쉬는 데이터 처리 장치 프로그램이 실행될 때에 동적으로 할당할 수 있다. 여기서, 공유 캐쉬는 캐쉬 블록 등과 같은 복수의 저장 공간에 분할될 수 있다. 서로 다른 캐쉬 블록의 크기는 같거나 다르고, 캐쉬 데이터의 요건에 따라 결정될 수 있다. 본 발명의 실시예에 있어서, 캐쉬 블록의 상태를 마크할 수 있는바, 예 를 들면 이미 할당한 블록을 used_item로 마크하고, 할당하지 않은 블록을 free_item로 마크할 수 있다. 초기 상태는 공유 캐쉬 전체가 하나의 free_item이며, 일정한 횟수의 메모리 할당 및 해제를 거친 후, 복수의 used_item이 존재할 가능성이 있으며, 이러한 used_item 사이에는 하나 또는 0개의 free_item이 존재할 가능성 이 있다. 이미 할당한 블록이란, 이미 점용된 저장 공간을 가리키고, 할당하지 않은 블록이란, 점용되지 않은 저장 공간을 가리킨다. 몇몇의 실시예에 있어서, 컴파일러는 AI 칩에 명령 시퀀스를 생성하고, 각 명령의 명령 시퀀스 중의 일련 번호 를 명령 일련 번호라 부른다. 컴파일러는 데이터 처리 장치에 의해 실행되는 하나의 소프트웨어 또는 하나의 세 그먼트의 프로그램 코드이다. 각 tensor(데이터로 이해할 수 있음)는 복수의 명령에 의해(명령의 출력 또는 명령의 입력으로) 사용될 수 있고, 이러한 명령 중의 최소의 일련 번호가 tensor의 시작 일련 번호(start program counter, start_pc)로 불리고, 가장 큰 일련 번호가 tensor의 종료 일련 번호(end program counter, end_pc)로 불린다. end_pc와 start_pc 사이의 차이 값이 tensor의 수명 주기로 불릴 수 있다. 데이터의 데이터 해제 시간 이란, 당해 데이터에 의해 점용된 주소가 해제되는 시간 즉 데이터가 해제되는 시간을 가리킨다. 도 1은 본 발명의 실시예에 의해 제공되는 데이터를 저장하기 위한 방법을 나타낸 플로우 차트이다. 101에 있어서, 데이터 처리 장치가 저장 대기 데이터에 필요한 저장 공간의 크기에 기반하여 목표 메모리 중의 적어도 두 개의 후보 저장 공간을 확정한다. 옵션으로서, 저장 대기 데이터는 입력 이미지 데이터 또는 뉴럴 네트워크를 이용하여 입력 이미지에 대해 처리 를 실행하여 발생된 중간 결과 및/또는 최종 결과일 수 있다. 예를 들면 저장 대기 데이터는 특징 맵의 적어도 일부 또는 모델의 가중치 등의 모델 데이터일 수 있는바, 본 발명의 실시예는 이에 대해 한정하지 않는다. 각 후보 저장 공간(free_item에 대응함)의 크기는 상기 저장 대기 데이터를 저장하기 위하여 점용할 필요가 있 는 저장 공간의 크기 이상이다. 데이터 처리 장치는 서버, 데스크톱 컴퓨터, 노트북 컴퓨터, 휴대전화, 태블릿 컴퓨터 등과 같은 데이터 처리 조작을 실행할 수 있는 디바이스일 수 있다. 옵션으로서, 상기 목표 메모리는 인 공 지능(AI) 칩의 공유 캐쉬이다. 데이터 처리 장치는 상기 목표 메모리의 할당되지 않은 복수의 개별 저장 공간(즉 free_item)으로부터 상기 저 장 대기 데이터를 저장할 수 있는 두 개 또는 두 개 이상의 후보 저장 공간을 확정할 수 있다. 실제의 적용에 있어서, 데이터 처리 장치 중의 프로세서는 공유 캐쉬의 모든 저장 공간(즉 item)을 선형으로 스캔하여, 저장 대기 데이터(예를 들면 tensor)에 의해 점용될 필요가 있는 저장 공간 이상의 free_item을 후보 저장 공간으로 서 상기 적어도 두 개의 후보 저장 공간을 얻는다. 102에 있어서, 상기 저장 대기 데이터의 제1 데이터 해제 시간 및 수명 주기 중의 적어도 하나에 기반하여 상기 저장 대기 데이터를 상기 적어도 두 개의 후보 저장 공간에 기억하는 복수의 후보 저장 방식 중의 각 후보 저장 방식의 목표 가중치를 확정한다. 여기서, 각 후보 저장 공간은 적어도 하나의 후보 저장 방식에 대응한다. 상기 저장 대기 데이터의 제1 데이터 해제 시간은 상기 저장 대기 데이터가 해제되는 시간일 수 있고, 곧 상기 저장 대기 데이터가 차지하는 저장 공 간이 해제되는 시간일 수 있다. 상기 저장 대기 데이터의 수명 주기는 상기 저장 대기 데이터가 해제되는 시간 과 상기 저장 대기 데이터가 기억되는 시간 사이의 간격일 수 있다. 예시적으로, 각 후보 저장 방식의 목표 가 중치는 상기 저장 대기 데이터의 제1 데이터 해제 시간과 제2 데이터 해제 시간 사이의 간격과 음의 상관 관계 를 가지는바, 여기서, 상기 제2 데이터 해제 시간은 상기 저장 대기 데이터의 상기 후보 저장 방식 중의 기억 위치에 인접하는 저장 공간에 기억된 데이터의 데이터 해제 시간이다. 후속으로 단계 102의 실시 형태를 더 상 세하게 설명한다. 103에 있어서, 상기 복수의 후보 저장 방식 중의 각 후보 저장 방식의 목표 가중치에 기반하여 상기 저장 대기 데이터의 목표 저장 방식을 확정한다. 상기 복수의 후보 저장 방식 중의 각 후보 저장 방식의 목표 가중치에 기반하여 상기 저장 대기 데이터의 목표 저장 방식을 확정하는 것은, 데이터 처리 장치가 상기 복수의 후보 저장 방식의 각각의 목표 가중치 중에서 가 장 큰 목표 가중치에 대응하는 후보 저장 방식을 상기 저장 대기 데이터의 목표 저장 방식으로 확정하는 것일 수도 있고, 데이터 처리 장치가 상기 복수의 후보 저장 방식의 각각의 목표 가중치 중에서 소정의 가중치 한계 값을 초과하는 임의의 목표 가중치에 대응하는 후보 저장 방식을 상기 저장 대기 데이터의 목표 저장 방식으로 확정하는 것일 수도 있는바, 여기서 상기 가중치 한계값은 0.6, 0.75, 0.8 등일 수 있다. 옵션으로서, 데이터 처리 장치는 단계 103을 실행한 후에, 상기 저장 대기 데이터를 상기 목표 저장 방식에 대 응하는 후보 저장 공간의 제1 주소부터 제2 주소에 기억하는 것; 및 상기 제1 주소부터 상기 제2 주소에 대응하 는 저장 공간을 이미 분배한 저장 공간(즉 used_item)으로 설정하는 것을 더 실행할 수 있다. 옵션으로서, 상기 제1 주소 및 상기 제2 주소 중의 하나는 상기 목표 저장 방식에 대응하는 후보 저장 공간의 시작 주소이거나, 상기 제1 주소 및 상기 제2 주소 중의 하나는 상기 목표 저장 방식에 대응하는 후보 저장 공간의 종료 주소이다. 몇몇의 실시예에 있어서, 데이터 처리 장치는 상기 저장 대기 데이터에 대응하는 제1 데이터 해제 시 간에 도달한 후에, 상기 제1 주소부터 상기 제2 주소에 대응하는 저장 공간을 해제하는 것; 및 상기 제1 주소부 터 상기 제2 주소에 대응하는 저장 공간을 분배하지 않은 저장 공간(즉 free_item)으로 설정하는 것을 더 실행 할 수 있다. 몇몇의 실시예에 있어서, 데이터 처리 장치는 특정 메모리 관리 소프트웨어를 이용하여 도 1의 방법 흐름을 실행한다. 몇몇의 실시예에 있어서, 목표 저장 방식에 대응하는 후보 저장 공간이 저장 대기 데이터에 필요한 저장 공간보 다 크면, 저장 대기 데이터를 상기 제1 주소부터 제2 주소에 기억한 후에, 목표 저장 방식에 대응하는 후보 저 장 공간 중의 저장 대기 데이터를 저장하지 않은 공간을 아직 분배하지 않은 저장 공간(즉 free_item)으로 설정 한다. 예를 들면 제1 주소가 목표 저장 방식에 대응하는 후보 저장 공간의 시작 주소인 것으로 가정하면, 제2 주소의 다음 주소에서 목표 저장 방식에 대응하는 후보 저장 공간의 종료 주소까지의 사이의 저장 공간을 할당 하지 않은 저장 공간으로 설정한다. 또한, 예를 들면 제2 주소가 목표 저장 방식에 대응하는 후보 저장 공간의 종료 주소인 것으로 가정하면, 목표 저장 방식에 대응하는 후보 저장 공간의 시작 주소에서 제1 주소의 앞의 하 나의 주소까지의 사이의 저장 공간을 할당하지 않은 저장 공간으로 설정한다. 본 발명의 실시예에 있어서, 상기 저장 대기 데이터의 제1 데이터 해제 시간 및 수명 주기 중의 적어도 하나에 기반하여 상기 저장 대기 데이터를 상기 적어도 두 개의 후보 저장 공간에 기억하는 복수의 후보 저장 방식 중 의 각 후보 저장 방식의 목표 가중치를 확정하고, 복수의 목표 가중치에 기반하여 복수의 후보 저장 방식 중에 서 메모리의 단편화를 효과적으로 줄일 수 있는 저장 방식을 확정할 수 있다. 몇몇의 실시예에 있어서, 각 후보 저장 공간에 대응하는 후보 저장 방식은 제1 후보 저장 방식 및 제2 후보 저 장 방식 중의 적어도 하나를 포함하되, 여기서, 상기 제1 후보 저장 방식 중의 시작 기억 주소는 상기 후보 저 장 공간의 시작 주소이며, 상기 제2 후보 저장 방식 중의 종료 기억 주소는 상기 후보 저장 공간의 종료 주소이 다. 즉, 각 후보 저장 공간은 하나 또는 두 개의 할당 방법에 대응하는바, 즉 좌측 할당(제1 후보 저장 방식에 대응함) 및 우측 할당(제2 후보 저장 방식에 대응함)에 대응하고, 각각 이 두 할당 방법의 목표 가중치를 계산 할 수 있다. 좌측 할당이란, 저장 대기 데이터를 특정 후보 저장 공간의 시작 주소부터 특정 주소까지 기억하는 것을 가리키는바, 즉 당해 저장 대기 데이터에 대해 당해 후보 저장 공간의 시작 주소에서부터 그 뒤의 연속된 복수의 주소를 할당하는 것을 가리킨다. 우측 할당이란, 저장 대기 데이터를 특정 후보 저장 공간이 특정 주소 에서부터 종료 주소까지 기억하는 것을 가리키는바, 즉 당해 저장 대기 데이터에 대해 당해 저장 공간의 종료 주소 및 당해 종료 주소 앞의 연속된 복수의 주소를 할당하는 것을 가리킨다. 특정 후보 저장 공간의 크기가 저 장 대기 데이터를 저장하기 위하여 필요한 저장 공간의 크기보다 크면, 당해 후보 저장 공간은 두 개의 할당 방 법(즉 좌측 할당 및 우측 할당)이 있고, 특정 후보 저장 공간의 크기가 저장 대기 데이터를 저장하기 위하여 필 요한 저장 공간의 크기와 같으면, 당해 후보 저장 공간은 하나의 할당 방법(즉 좌측 할당과 우측 할당이 같음) 만이 있다. 예를 들어 설명하면, 10개의 후보 저장 공간의 크기가 저장 대기 데이터를 저장하기 위하여 필요한 저장 공간의 크기보다 크면, 데이터 처리 장치는 20회의 목표 가중치 계산을 실행하는바, 즉 각 후보 저장 공간 에 대해 좌측 할당하는 방식에 대응하는 목표 가중치 및 우측 할당하는 방식에 대응하는 목표 가중치를 계산한 다. 당해 실시 형태에 있어서, 제1 후보 저장 방식 또는 제2 후보 저장 방식을 채용하여 저장 대기 데이터를 저장한 후에, 당해 저장 대기 데이터가 차지하는 저장 공간이 해제된 후, 인접하는 저장 공간과 하나의 상대적으로 큰 저장 공간으로 합병될 수 있기에, 메모리의 단편화를 줄일 수 있다. 도 2는 본 발명의 실시예에 의해 제공되는 후보 저장 방식의 목표 가중치를 계산하는 과정을 나타낸 모식도이다. 도 2에 나타낸바와 같이, 211-216에 나타낸 검은색 사각형 영역은 목표 메모리 내의 이미 할당된 저장 공간(즉 used_item)을 나타내고, 201-205에 나타낸 흰색 사각형 영역은 당해 목표 메모리 내의 할당되지 않은 저장 공간(즉 free_item)을 나타낸다. 저장 공간 201, 저장 공간 203, 저장 공간 205가 모두 저장 대기 데 이터를 저장할 수 있고, 저장 공간 201 및 저장 공간 203의 크기가 저장 대기 데이터를 저장하기 위하여 필요한 저장 공간의 크기보다 크며, 저장 공간 205의 크기가 저장 대기 데이터를 저장하기 위하여 필요한 저장 공간의 크기와 같다고 가정한다. 도 2에 나타낸바와 같이, 가중치 계산에 있어서, 도면 내의 검은색 사각형 영역은 저 장 공간이 점용된 부분을 나타내고, 흰색 사각형 영역은 저장 공간이 점용되지 않은 부분을 나타내며, 사각형 영역 상단은 대응하는 저장 공간의 시작 주소를 나타내고, 사각형 영역 하단은 대응하는 저장 공간의 종료 주소 를 나타낸다. 첫번째 목표 가중치 계산에 있어서, 저장 대기 데이터를 저장 공간 201의 시작 주소부터 특정 주 소(좌측 할당)에 기억할 때의 목표 가중치를 계산한다. 두번째 목표 가중치 계산에 있어서, 저장 대기 데이터를 저장 공간 201이 특정 주소에서 종료 주소(즉 우측 할당)에 기억할 때의 목표 가중치를 계산한다. 세번째 목표 가중치 계산에 있어서, 저장 대기 데이터를 저장 공간 203의 시작 주소부터 특정 주소(좌측 할당)에 기억할 때 의 목표 가중치를 계산한다. 네번째 목표 가중치 계산에 있어서, 저장 대기 데이터를 저장 공간 203이 특정 주 소에서 종료 주소(우측 할당)에 기억할 때의 목표 가중치를 계산한다. 다섯번째 목표 가중치 계산에 있어서, 저 장 대기 데이터를 저장 공간 205의 시작 주소부터 종료 주소(즉 좌측 할당과 우측 할당이 같음)에 기억할 때의목표 가중치를 계산하며, 이하도 마찬가지다. 몇몇의 실시예에 있어서, 데이터 처리 장치는 N 번째 목표 가중치 계산에 있어서, 저장 대기 데이터를 특정 후 보 저장 공간에 기억할 때의 목표 가중치를 계산하고, 당해 목표 가중치를 제1 목표 가중치로 설정한 후, 또한, 현재의 최대 목표 가중치가 상기 제1 목표 가중치 미만일 경우, 상기 현재의 최대 목표 가중치를 상기 제1 목표 가중치로 갱신할 수 있다. 옵션으로서, 데이터 처리 장치는 첫번째 목표 가중치 계산을 실행하여 하나의 목표 가중치를 얻은 후에, 당해 목표 가중치를 현재의 최대 목표 가중치로서 보존하고, i 번째 목표 가중치 계산을 통해 얻은 목표 가중치와 보존한 현재의 최대 목표 가중치를 비교하고, 새로 계산하여 얻은 목표 가중치가 현재 의 최대 목표 가중치보다 크면, 현재의 최대 목표 가중치를 새로 계산하여 얻은 목표 가중치로 갱신하고, 그렇 지 않을 경우에는 현재의 최대 목표 가중치를 그대로 유지하는바, 여기서 i는 1보다 큰 양의 정수이다. 전술한 실시예에서는 저장 대기 데이터를 적어도 두 개의 후보 저장 공간에 기억하는 복수의 후보 저장 방식 중 의 각 후보 저장 방식의 목표 가중치를 확정하는 실시 형태를 상세하게 설명하지 않았다. 이하, 참고 후보 저장 방식의 목표 가중치를 계산하는 예를 들어, 목표 가중치 옵션을 계산하는 몇몇의 실시 형태를 소개한다. 상기 참고 후보 저장 방식은 상기 적어도 두 개의 후보 저장 공간 중의 임의의 후보 저장 방식이다. 옵션의 일 실시 형태에 있어서, 저장 대기 데이터의 제1 데이터 해제 시간과 제2 데이터 해제 시간 사이의 시간 간격에 기반하여 후보 저장 방식의 목표 가중치를 확정할 수 있다. 참고 후보 저장 방식에 대응하는 목표 가중 치는, 상기 저장 대기 데이터의 제1 데이터 해제 시간과 제2 데이터 해제 시간 사이의 시간 간격과 음의 상관 관계를 가진다. 여기서, 상기 제2 데이터 해제 시간은 상기 저장 대기 데이터의 상기 참고 후보 저장 방식 중의 기억 위치에 인접하는 저장 공간에 기억된 데이터의 데이터 해제 시간이다. 예시적으로, 참고 후보 저장 방식에 대응하는 목표 가중치는 상기 저장 대기 데이터의 제1 데이터 해제 시간과 제2 데이터 해제 시간 사이의 간격 역수이다. 예를 들어 설명하면, 제1 데이터 해제 시간이 t1이고, 제2 데이터 해제 시간이 t2이면, 참고 후보 저 장 방식에 대응하는 목표 가중치는 이다. 도 2의 예를 들면, 저장 공간 201의 경우, 인접하는 저장 공간은 211 또는 212이다. 첫번째 가중치를 계산할 때 에, 좌측 할당이기 때문에, 저장 공간 201의 인접하는 저장 공간은 211이며, 두번째 가중치를 계산할 때에, 우 측 할당이기 때문에, 저장 공간 201의 인접하는 저장 공간은 212이며. 저장 공간 205의 경우, 인접하는 저장 공 간은 215일 수도 있고, 216일 수도 있다. 옵션의 일 실시 형태에 있어서, 상기 저장 대기 데이터에 대응하는 제1 데이터 해제 시간 및 수명 주기 중의 적 어도 하나에 기반하여 상기 저장 대기 데이터를 상기 적어도 두 개의 후보 저장 공간에 기억하는 복수의 후보 저장 방식 중의 각 후보 저장 방식의 목표 가중치를 확정하는 것은, 상기 저장 대기 데이터의 수명 주기 및 상 기 후보 저장 방식에 대응하는 후보 저장 공간의 시작 주소에 기반하여 상기 후보 저장 방식의 목표 가중치를 확정하는 것을 포함한다. 옵션으로서, 상기 목표 저장 방식의 확정은 상기 목표 메모리에 기억된 데이터의 수명 주기가 기억 주소와 함께 증가 또는 감소하도록 한다. 데이터 처리 장치를 이용하여 본 발명의 실시예에 의해 제공되는 데이터를 저장하기 위한 방법을 실행하면, 상기 목표 메모리에 기억된 데이터의 수명 주기가 기억 주 소와 함께 증가 또는 감소하도록 할 수 있음을 이해할 수 있다. 즉, 수명 주기가 작은 저장 대기 데이터를 가능 한 한 저장 공간의 한측(좌측 기억 등)에 기억하고, 수명 주기가 긴 저장 대기 데이터를 가능한 한 저장 공간의 다른 한측(우측 기억 등)에 기억한다. 몇몇의 실시예에 있어서, 상기 저장 대기 데이터의 제1 데이터 해제 시간 및 수명 주기 중의 적어도 하나에 기반하여 상기 저장 대기 데이터를 상기 적어도 두 개의 후보 저장 공간에 기 억하는 복수의 후보 저장 방식 중의 각 후보 저장 방식의 목표 가중치를 확정하는 것은, 상기 저장 대기 데이터 에 대응하는 최대 수명 주기를 확정하는 것; 상기 저장 대기 데이터의 수명 주기와 상기 최대 수명 주기 사이의 제1 비율값을 확정하는 것; 및 상기 후보 저장 방식에 대응하는 후보 저장 공간의 시작 주소와 상기 목표 메모 리의 종료 주소 사이의 제2 비율값을 확정하고, 제1 비율값 및 제2 비율값에 기반하여 상기 후보 저장 방식의 목표 가중치를 확정하는 것을 포함한다. 예시적으로, 상기 후보 저장 방식의 목표 가중치는 상기 제1 비율값과 상기 제2 비율값 사이의 차분 절대치와 음의 상관 관계를 가진다. 저장 대기 데이터에 대응하는 최대 수명 주기 는 명령 시퀀스 중의 각 명령에 각각 대응하는 데이터의 수명 주기 중 가장 큰 수명 주기일 수 있는바, 즉 저장 대기 데이터에 관련된 데이터가 목표 메모리의 최대 지속 시간을 점용한다. 예시적으로, 저장 대기 데이터에 대 응하는 최대 수명 주기는 이번의 화상 처리 과정에서 발생된 모든 기억할 필요가 있는 데이터의 수명 주기 최대 치이며, 이미 할당한 메모리 및 할당하지 않은 메모리의 모든 데이터의 수명 주기 최대치를 포함하지만, 본 발 명의 실시예는 이에 대해 한정하지 않는다.몇몇의 실시예에 있어서, 후보 저장 공간의 시작 주소는 목표 메모리의 시작 주소에 대한 후보 저장 공간의 시 작 주소의 오프셋 값으로 나타낼 수 있으며, 목표 메모리의 종료 주소는 목표 메모리의 시작 주소에 대한 목표 메모리의 종료 주소의 오프셋 값으로 나타낼 수 있다. 옵션의 일 실시 형태에 있어서, 후보 저장 공간의 시작 주소와 목표 메모리의 합계 저장 공간의 크기 사이의 제 2 비율값을 확정하고, 당해 제2 비율값을 당해 후보 저장 공간에 대응하는 적어도 하나의 후보 저장 방식의 제2 비율값으로 사용할 수 있지만, 본 발명의 실시예는 이에 한정되지 않는다. 옵션의 일 실시 형태에 있어서, 상기 저장 대기 데이터에 대응하는 제1 데이터 해제 시간 및 수명 주기 중의 적 어도 하나에 기반하여 상기 저장 대기 데이터를 상기 적어도 두 개의 후보 저장 공간에 기억하는 복수의 후보 저장 방식 중의 각 후보 저장 방식의 목표 가중치를 확정하는 것은, 상기 저장 대기 데이터에 대응하는 제1 데 이터 해제 시간 및 상기 후보 저장 방식에 대응하는 기억 위치에 인접하는 저장 공간에 기억된 데이터의 제2 데 이터 해제 시간에 기반하여 상기 후보 저장 방식의 제1 가중치를 확정하는 것; 상기 저장 대기 데이터의 수명 주기 및 상기 후보 저장 방식에 대응하는 후보 저장 공간의 시작 주소에 기반하여 상기 후보 저장 방식의 제2 가중치를 확정하는 것; 및 상기 제1 가중치와 상기 제2 가중치의 가중치 합에 기반하여 상기 후보 저장 방식의 목표 가중치를 얻는 것을 포함한다. 당해 실시 형태에 있어서, 저장 대기 데이터의 제1 데이터 해제 시간 및 수명 주기를 종합적으로 고려함으로써, 메모리의 단편화를 효과적으로 줄일 수 있다. 옵션의 일 실시 형태에 있어서, 상기 저장 대기 데이터의 제1 데이터 해제 시간 및 수명 주기 중의 적어도 하나 에 기반하여 상기 저장 대기 데이터를 상기 적어도 두 개의 후보 저장 공간에 기억하는 복수의 후보 저장 방식 중의 각 후보 저장 방식의 목표 가중치를 확정하는 것은, 상기 저장 대기 데이터의 제1 데이터 해제 시간, 수명 주기 및 복수의 후보 저장 방식 중의 각 후보 저장 방식에 대응하는 저장 공간의 크기에 기반하여 상기 복수의 후보 저장 방식의 목표 가중치를 확정하는 것을 포함한다. 여기서, 후보 저장 방식에 대응하는 저장 공간의 크 기는 당해 후보 저장 방식에 대응하는 후보 저장 공간의 크기일 수 있다. 몇몇의 실시예에 있어서, 상기 후보 저장 방식에 대응하는 목표 가중치는 제1 지표, 제2 지표 및 제3 지표의 가 중치 합을 포함한다. 여기서, 상기 제1 지표는 상기 저장 대기 데이터의 제1 데이터 해제 시간과 제2 데이터 해 제 시간 사이의 간격에 기반하여 확정되어, 상기 제2 데이터 해제 시간은 상기 저장 대기 데이터의 상기 후보 저장 방식 중의 기억 위치에 인접하는 저장 공간에 기억된 데이터의 데이터 해제 시간이며, 상기 제2 지표는 제 1 비율값과 제2 비율값 사이의 차이 값에 기반하여 확정된다. 상기 제1 비율값은 상기 저장 대기 데이터의 수명 주기와 상기 저장 대기 데이터에 대응하는 최대 수명 주기 사이의 비율값이고, 상기 제2 비율값은 상기 후보 저 장 방식에 대응하는 후보 저장 공간의 시작 주소와 상기 목표 메모리의 종료 주소 사이의 비율값이며, 상기 제3 지표는 상기 후보 저장 방식에 대응하는 저장 공간과 상기 목표 메모리의 합계 저장 공간 사이의 비율값에 기반 하여 확정된다. 당해 실시 형태에 있어서, 저장 대기 데이터의 제1 데이터 해제 시간, 수명 주기 및 필요한 저장 공간의 크기를 종합적으로 고려함으로써, 확정된 목표 저장 방식이 메모리의 단편화를 더 효과적으로 줄이도록 할 수 있고, 차 지하는 저장 공간을 감소할 수 있다. 옵션으로서, 상기 후보 저장 방식에 대응하는 목표 가중치는 이하의 식을 충족시킨다. （1）； 여기서, α, β, γ은 모두 0 이상의 목표 가중치 계수이며, 또한 α+β+γ=1이며, weight는 상기 후보 저장 방 식에 대응하는 목표 가중치를 나타내고, w1은 제1 지표를 나타내며, w2는 제2 지표를 나타내고, w3은 제3 지표 를 나타낸다. 옵션으로서, cost1=abs(e-e1)이고, w1=1/cost1이며, e는 상기 제1 데이터 해제 시간을 나타내고, e1은 상기 제2 데이터 해제 시간을 나타내고, abs(e-e1)은 e와 e1의 차이 값의 절대치를 나타낸다. 옵션으로서, cost2=abs((c/c_max)-(start/mem_size))이며, w2=1-cost2이며, c는 상기 가중치 합을 나타내고, c_max는 상기 저장 대기 데이터에 대응하는 최대 수명 주기를 나타내며, start는 상기 후보 저장 방식에 대응하는 후보 저장 공간의 시작 주소를 나타내고, mem_size는 목표 메모리의 합계 저장 공간의 크기를 나타내며, 목표 메모리의 종 료 주소로서 나타낼 수 있다. 옵션으로서, w3=1-s_cand/mem_size이며, s_cand는 후보 저장 방식에 대응하는 후 보 저장 공간의 크기를 나타내고, mem_size는 상기 목표 메모리의 합계 저장 공간의 크기를 나타낸다. 당해 실시 형태에 있어서, 목표 가중치 계수 α, β 및 γ은 테스트를 통해 얻은 결과이다. 특정 단계에서 α, β 및 γ의 값을 변경하고, α+β+γ=1인 것을 확보하여, 복수 그룹의 다른 파라미터의 조합 세트를 취득하며, 일 그룹의 테스트 세트를 실행하여, 각 그룹의 파라미터의 조합 세트의 당해 테스트 세트에서의 결과로 보존한 다. 따라서, 최종적으로 일 그룹의 성능이 뛰어난 파라미터의 조합 세트를 선택한다. 당해 실시 형태에 있어서, 후보 저장 방식의 목표 가중치를 계산하는 방법은 세 개의 할당 원칙의 종합적인 결 과이다. w1은 제1 할당 원칙에 대응하며, 당해 원칙은 가능한 한 end_pc에 가까운 위치를 분배하고, 인접하는 저장 공간의 해제 시간이 가까이 되도록 하며, 큰 비어 있는 저장 공간으로 합병하여 메모리의 단편화를 줄인다. 각 데이터는 하나의 end_pc에 대응하고, 각 데이터에 대응하는 end_pc는 당해 데이터가 차지하는 저장 공간이 해제되는 시점을 나타낸다. 가능한 한 end_pc에 가까운 위치를 분배하면, 저장 대기 데이터를 가능한 한 대응하는 end_pc와 당해 저장 대기 데이터에 대응하는 end_pc에 의해 가까운 데이터에 인접하는 위치에 할당할 수 있다. 예를 들어 설명하면, 목표 메모리가 특정 저장 공간에 기억한 데이터에 대응하는 end_pc가 당해 저장 대기 데이터에 대응하는 end_pc와보다 가까우면, 당해 저장 대기 데이터를 당해 저장 공간에 인접하는 공간 저 장 공간에 할당한다. w2는 제2 할당 원칙에 대응하며, 당해 원칙은 수명 주기가 짧은 데이터(할당과 해제가 빈 번함)와 수명 주기가 긴 데이터를 나누어 할당하는바, 할당과 해제가 빈번한 데이터들의 위치를 가능한 한 가까 이 함으로써, 메모리의 단편화를 줄인다. w3은 제3의 할당 원칙에 대응하며, 당해 원칙은 요건을 충족시키는 최 소의 비어 있는 저장 공간을 저장 대기 데이터에 할당하는 것이다. 당해 실시 형태에 있어서, 다양한 할당 원칙 을 조합시켜 할당 대기 데이터에 주소를 할당함으로써, 메모리의 단편화를 효과적으로 줄일 수 있다. 데이터 처리 장치는 이 세 개의 할당 원칙 중의 임의의 두 개를 조합시켜 목표 가중치를 계산할 수도 있고, 제1 원칙 또는 제2 원칙을 채용하여 목표 가중치를 계산할 수도 있음을 이해해야 한다. 예를 들어 설명하면, 상기 후보 저장 방식에 대응하는 목표 가중치는 이하의 식을 충족시킨다. （2）； 여기서, 식 안의 w1, w2는 각각 식 중의 w1, w2과 같고, α, β은 모두 0보다 큰 가중치 계수이며, 또한 α+β=1이다. 또한, 예를 들어 설명하면, 상기 후보 저장 방식에 대응하는 목표 가중치는 이하의 식을 충족시킨다. （3）； 여기서, 식 중의 w1, w3는 각각 식 중의 w1, w3과 같고, α, 은 모두 0보다 큰 가중치 계수이며, 또한 α+ =1이다. 또한, 예를 들어 설명하면, 상기 후보 저장 방식에 대응하는 목표 가중치는 이하의 식을 충족시킨다. （4）； 여기서, 식 중의 w2, w3는 각각 식 중의 w2, w3과 같고, β, 은 모두 0보다 큰 가중치 계수이며, 또한 β+ =1이다. 또한, 예를 들어 설명하면, 상기 후보 저장 방식에 대응하는 목표 가중치는 이하의 식을 충족시킨다. （5）； 또한, 예를 들어 설명하면, 상기 후보 저장 방식에 대응하는 목표 가중치는 이하의 식을 충족시킨다. （6）； 당해 실시 형태에 있어서, 다양한 할당 원칙을 조합시켜 할당 대기 데이터에 주소를 할당함으로써, 메모리의 단 편화를 효과적으로 줄일 수 있다. 도 3은 본 발명의 실시예에 의해 제공되는 데이터를 저장하기 위한 다른 일 방법을 나타낸 플로우 차트이다. 도 3에 나타낸바와 같이, 당해 방법은 이하의 단계를 포함할 수 있다. 301에 있어서, 데이터 처리 장치가 목표 메모리의 할당되지 않은 복수의 개별 저장 공간들 중에서 저장 대기 데 이터를 저장할 수 있는 두 개 또는 두 개 이상의 후보 저장 공간을 확정한다.302에 있어서, N 번째 목표 가중치를 계산할 때에, 저장 대기 데이터의 제1 데이터 해제 시간 및 수명 주기 중 의 적어도 하나에 기반하여 저장 대기 데이터를 제1 후보 저장 공간에 기억하는 제1 목표 가중치를 계산한다. 옵션으로서, 상기 제1 후보 저장 공간은 상기 두 개 또는 두 개 이상의 후보 저장 공간 중의 임의의 후보 저장 공간이다. 저장 대기 데이터를 제1 후보 저장 공간에 기억하는 제1 목표 가중치를 계산할 때에, 식∼식 중의 임의의 하나를 채용하여 목표 가중치를 계산할 수 있다. 데이터 처리 장치는, 저장 대기 데이터를 제1 후 보 저장 공간에 기억하는 것으로 가정하여 목표 가중치를 계산할 뿐, 저장 대기 데이터를 제1 후보 저장 공간에 기억하는 조작을 실행하지 않음을 이해할 수 있다. 상기 N은 0보다 큰 정수다. 실제의 적용에 있어서, 데이터 처리 장치는 각 후보 저장 공간에 저장 대기 데이터를 저장할 때 대응하는 하나의 목표 가중치 또는 두 개의 목 표 가중치를 계산하고, 각 회의 목표 가중치 계산은 하나의 목표 가중치를 계산할 수 있다. 303에 있어서, 현재의 최대 목표 가중치를 갱신한다. 몇몇의 실시예에 있어서, N=1일 때에, 현재의 최대 목표 가중치의 갱신은 첫 번째 계산하여 얻은 목표 가중치를 현재의 최대 목표 가중치로 저장한다. N>1일 때에, 현재의 최대 목표 가중치의 갱신은 N 번째 계산하여 얻은 목 표 가중치가 현재 저장되어 있는 현재의 최대 목표 가중치보다 클 경우, 현재의 최대 목표 가중치를 N 번째 계 산하여 얻은 목표 가중치로 갱신한다. N 번째 계산하여 얻은 목표 가중치가 현재 저장되어 있는 현재의 최대 목 표 가중치 미만일 경우, 현재의 최대 목표 가중치를 그대로 유지한다. 304에 있어서, 다음 번의 목표 가중치의 계산을 정지하는지 여부를 판단한다. 몇몇의 실시예에 있어서, 다음 번의 목표 가중치의 계산을 정지하는지 여부를 판단하는 것은, 현재 복수의 후보 저장 방식의 목표 가중치를 계산하여 얻은 경우, 다음 번의 목표 가중치의 계산을 정지한다고 판단하고, 현재 복수의 후보 저장 방식의 목표 가중치를 계산하여 얻지 못한 경우, 다음 번의 목표 가중치의 계산을 계속한다고 판단한다. 다음 번의 목표 가중치 계산을 정지하지 않으면, N+1을 실행하고, 단계 302를 실행하며, 다음 번의 목표 가중치 계산을 정지하면, 단계 305을 실행한다. 305에 있어서, 현재의 최대 목표 가중치에 대응하는 후보 저장 방식을 목표 저장 방식으로 설정하고, 저장 대기 데이터를 목표 저장 방식에 대응하는 후보 저장 공간의 제1 주소부터 제2 주소에 기억한다. 306에 있어서, 상기 제1 주소부터 상기 제2 주소에 대응하는 저장 공간을 이미 할당한 저장 공간으로 설정한다. 307에 있어서, 제1 데이터 해제 시간에 도달한 후, 상기 제1 주소부터 상기 제2 주소를 해제한다. 몇몇의 실시예에 있어서, 상기 제1 주소부터 상기 제2 주소에 대응하는 저장 공간을 할당하지 않은 저장 공간으 로 설정할 수 있다. 308에 있어서, 제2 주소가 후보 저장 공간의 종료 주소이면, 상기 제2 주소의 다음 주소부터 제3주소(제3주소는 제2 주소의 오른쪽에 위치함)에 모두 데이터를 저장하지 않았을 경우, 상기 제1 주소부터 상기 제3주소를 할당 하지 않은 개별 저장 공간으로 설정한다. 여기서, 제3주소의 다음 주소를 시작 주소로 하는 저장 공간은 이미 할당한 저장 공간(used_item)이다. 단계 308을 이하로 바꿀 수 있는바, 즉 제1 주소가 후보 저장 공간의 시작 주소이면, 상기 목표 메모리의 제4 주소(제4주소는 제1 주소의 왼쪽에 위치함)로부터 상기 제1 주소의 앞의 주소에 모두 데이터를 저장하지 않았을 경우, 상기 제4주소부터 상기 제2 주소까지를 할당하지 않은 개별 저장 공간으로 설정한다. 여기서, 제4주소 앞 의 주소를 종료 주소로 설정하는 저장 공간은 이미 할당한 저장 공간(used_item)이다. 이렇게 함으로써, 두 개의 인접하는 할당하지 않은 저장 공간을 더 큰 하나의 할당하지 않은 저장 공간으로 신 속하게 설정할 수 있다. 본 발명의 실시예에 의해 제공되는 방법에 따르면, 메모리의 단편화를 효과적으로 줄일 수 있다. 전술한 실시예에 설명한 데이터를 저장하기 위한 방법은, 데이터 처리 장치를 통해 AI 칩을 이용하여 데이터 처 리 태스크를 실행하는 장면에 적용할 수 있는바, 즉 공유 캐쉬의 주소 할당 및 해제의 실시간 관리에 적용할 수 있으며, AI 모델의 컴파일 장면에 적용할 수도 있다. AI 모델의 컴파일 시나리오에서는, 데이터 처리 장치는 본 발명의 실시예에 의해 제공되는 데이터를 저장하기 위한 방법을 실행함으로써, AI 모델이 처리와 조작을 실행할 때의 공유 캐쉬의 할당을 시뮬레이트할 수 있고, 또한 AI 모델을 컴파일하여 공유 캐쉬의 메모리 할당 및 해제 를 지시하는 명령 시퀀스를 얻을 수 있다. 데이터 처리 장치의 AI 칩은 명령 시퀀스를 실행함으로써 데이터 처 리 태스크를 실행할 수 있다. AI 칩은 명령 시퀀스를 실행하여 데이터 처리 태스크를 실행하는 과정에서, 명령시퀀스 중의 명령을 따라 데이터를 공유 캐쉬에 기억하고, 또한 공유 캐쉬 중의 데이터를 해제하고, 공유 캐쉬 의 이용률을 향상시킬 수 있다. 도 4는 본 발명의 실시예에 의해 제공되는 데이터 처리 장치의 구성을 나타낸 모식도이며, 도 4에 나타낸바와 같이, 당해 장치는 제1 확정 유닛, 제2 확정 유닛 및 제3 확정 유닛을 구비한다. 제1 확정 유닛은 저장 대기 데이터에 필요한 저장 공간의 크기에 기반하여 목표 메모리 중의 적어도 두 개 의 후보 저장 공간을 확정한다. 제2 확정 유닛은 상기 저장 대기 데이터의 제1 데이터 해제 시간 및 수명 주기 중의 적어도 하나에 기반하 여 상기 저장 대기 데이터를 상기 적어도 두 개의 후보 저장 공간에 기억하는 복수의 후보 저장 방식 중의 각 후보 저장 방식의 목표 가중치를 확정하되, 각 후보 저장 공간은 적어도 하나의 후보 저장 방식에 대응한다. 제3 확정 유닛은 상기 복수의 후보 저장 방식 중의 각 후보 저장 방식의 목표 가중치에 기반하여 상기 저 장 대기 데이터의 목표 저장 방식을 확정한다. 옵션의 일 실시 형태에 있어서, 상기 후보 저장 공간에 대응하는 후보 저장 방식은 제1 후보 저장 방식 및 제2 후보 저장 방식 중의 적어도 하나를 포함하되, 상기 제1 후보 저장 방식 중의 시작 기억 주소는 상기 후보 저장 공간의 시작 주소이며, 상기 제2 후보 저장 방식 중의 종료 기억 주소는 상기 후보 저장 공간의 종료 주소이다. 옵션의 일 실시 형태에 있어서, 제2 확정 유닛은 또한, 복수의 후보 저장 방식에 대해, 상기 저장 대기 데 이터의 제1 데이터 해제 시간 및 제2 데이터 해제 시간에 기반하여 당해 후보 저장 방식의 목표 가중치를 확정 하되, 상기 제2 데이터 해제 시간은 상기 저장 대기 데이터의 상기 후보 저장 방식 중의 기억 위치에 인접하는 저장 공간에 기억된 데이터의 데이터 해제 시간이다. 옵션의 일 실시 형태에 있어서, 상기 후보 저장 방식에 대응하는 목표 가중치는 상기 저장 대기 데이터의 제1 데이터 해제 시간과 제2 데이터 해제 시간 사이의 간격과 음의 상관 관계를 가진다. 옵션의 일 실시 형태에 있어서, 제2 확정 유닛은 또한 복수의 후보 저장 방식에 대해, 상기 저장 대기 데 이터의 수명 주기 및 상기 후보 저장 방식에 대응하는 후보 저장 공간의 시작 주소에 기반하여 상기 후보 저장 방식의 목표 가중치를 확정한다. 옵션의 일 실시 형태에 있어서, 제2 확정 유닛은 또한 상기 저장 대기 데이터에 대응하는 최대 수명 주기 를 확정하고, 상기 저장 대기 데이터의 수명 주기와 상기 최대 수명 주기 사이의 제1 비율값을 확정하며, 상기 후보 저장 방식에 대응하는 후보 저장 공간의 시작 주소와 상기 목표 메모리의 종료 주소 사이의 제2 비율값을 확정하고, 제1 비율값 및 제2 비율값에 기반하여 상기 후보 저장 방식의 목표 가중치를 확정한다. 옵션의 일 실시 형태에 있어서, 상기 후보 저장 방식의 목표 가중치는 상기 제1 비율값과 상기 제2 비율값 사이 의 차분 절대치와 음의 상관 관계를 가진다. 옵션의 일 실시 형태에 있어서, 제2 확정 유닛은 또한 복수의 후보 저장 방식에 대해, 상기 저장 대기 데 이터에 대응하는 제1 데이터 해제 시간 및 제2 데이터 해제 시간에 기반하여 상기 후보 저장 방식의 제1 가중치 를 확정하되, 제2 데이터 해제 시간은 저장 대기 데이터의 당해 후보 저장 방식 중의 기억 위치에 인접하는 저 장 공간에 기억된 데이터의 데이터 해제 시간이며, 상기 저장 대기 데이터의 수명 주기 및 상기 후보 저장 방식 에 대응하는 후보 저장 공간의 시작 주소에 기반하여 상기 후보 저장 방식의 제2 가중치를 확정하고, 상기 제1 가중치와 상기 제2 가중치의 가중치 합에 기반하여 상기 후보 저장 방식의 목표 가중치를 얻는다. 옵션의 일 실시 형태에 있어서, 제2 확정 유닛은 또한 복수의 후보 저장 방식에 대해, 상기 저장 대기 데 이터의 제1 데이터 해제 시간, 수명 주기 및 당해 후보 저장 방식에 대응하는 저장 공간의 크기에 기반하여 당 해 후보 저장 방식의 목표 가중치를 확정한다. 옵션의 일 실시 형태에 있어서, 제2 확정 유닛은 또한 상기 저장 대기 데이터에 대응하는 제1 데이터 해제 시간 및 제2 데이터 해제 시간에 기반하여 당해 후보 저장 방식의 제1 가중치를 확정하고, 상기 저장 대기 데이 터의 수명 주기 및 당해 후보 저장 방식에 대응하는 후보 저장 공간의 시작 주소에 기반하여 당해 후보 저장 방 식의 제2 가중치를 확정하고, 상기 후보 저장 방식에 대응하는 후보 저장 공간의 크기 및 상기 목표 메모리의 합계 저장 공간의 크기에 기반하여 당해 후보 저장 방식의 제3 가중치를 확정하고, 상기 제1 가중치, 상기 제2 가중치 및 상기 제3 가중치의 가중치 합에 기반하여 당해 후보 저장 방식의 상기 목표 가중치를 얻되, 상기 제2 데이터 해제 시간은 상기 저장 대기 데이터의 당해 후보 저장 방식 중의 기억 위치에 인접하는 저장 공간에 기억된 데이터의 데이터 해제 시간이다. 옵션의 일 실시 형태에 있어서, 제2 확정 유닛은 또한 복수의 후보 저장 방식에 대해, 상기 저장 대기 데 이터의 제1 데이터 해제 시간 및 당해 후보 저장 방식에 대응하는 저장 공간의 크기에 기반하여 당해 후보 저장 방식의 목표 가중치를 확정한다. 옵션의 일 실시 형태에 있어서, 제2 확정 유닛은 또한, 복수의 후보 저장 방식에 대해, 상기 저장 대기 데 이터의 수명 주기 및 당해 후보 저장 방식에 대응하는 저장 공간의 크기에 기반하여 당해 후보 저장 방식의 목 표 가중치를 확정한다. 옵션의 일 실시 형태에 있어서, 상기 장치는 상기 저장 대기 데이터를 상기 목표 저장 방식에 대응하는 후보 저 장 공간의 제1 주소부터 제2 주소에 기억하고, 상기 제1 주소부터 상기 제2 주소에 대응하는 저장 공간을 이미 할당한 저장 공간으로 설정하기 위한 설정 유닛을 더 구비하되, 상기 제1 주소 및 상기 제2 주소 중의 하 나는 상기 목표 저장 방식에 대응하는 후보 저장 공간의 시작 주소이거나, 상기 제1 주소 및 상기 제2 주소 중 의 하나는 상기 목표 저장 방식에 대응하는 후보 저장 공간의 종료 주소이다. 옵션의 일 실시 형태에 있어서, 상기 장치는 상기 저장 대기 데이터에 대응하는 제1 데이터 해제 시간에 도달한 후에, 상기 제1 주소부터 상기 제2 주소에 대응하는 저장 공간을 해제하기 위한 해제 유닛을 더 구비하며, 설정 유닛은 또한 상기 제1 주소부터 상기 제2 주소에 대응하는 저장 공간을 할당하지 않은 저장 공간으로 설정한다. 옵션의 일 실시 형태에 있어서, 제3 확정 유닛은 또한 상기 복수의 후보 저장 방식의 각각의 목표 가중치 중에서 가장 큰 목표 가중치에 대응하는 후보 저장 방식을 상기 저장 대기 데이터의 상기 목표 저장 방식으로 확정하는 것; 또는 상기 복수의 후보 저장 방식의 각각의 목표 가중치 중에서 소정의 가중치 한계값을 초과하는 임의의 목표 가중치에 대응하는 후보 저장 방식을 상기 목표 저장 방식으로 확정하는 것을 포함한다. 옵션의 일 실시 형태에 있어서, 상기 목표 메모리는 인공 지능(AI) 칩의 공유 캐쉬이다. 옵션의 일 실시 형태에 있어서, 제1 확정 유닛은 또한 상기 목표 메모리의 할당되지 않은 복수의 개별 저 장 공간들 중에서 상기 저장 대기 데이터를 저장할 수 있는 상기 적어도 두 개의 후보 저장 공간을 확정하되, 상기 후보 저장 공간의 크기는 저장 대기 데이터가 차지하는 저장 공간이상이다. 옵션의 일 실시 형태에 있어서, 설정 유닛은 또한 제2 주소가 후보 저장 공간의 종료 주소이며, 상기 제2 주소의 다음 주소부터 제3주소에 모두 데이터를 저장하지 않았을 경우, 상기 제1 주소부터 상기 제3주소를 할당 하지 않은 개별 저장 공간으로 설정한다. 여기서, 제3주소의 다음 주소를 시작 주소로 하는 저장 공간은 이미 할당한 저장 공간이다. 옵션의 일 실시 형태에 있어서, 설정 유닛은 또한, 제1 주소가 후보 저장 공간의 시작 주소이며, 상기 목 표 메모리의 제4주소부터 상기 제1 주소 앞 주소에 모두 데이터를 저장하지 않았을 경우, 상기 제4주소부터 상 기 제2 주소를 할당하지 않은 개별 저장 공간으로 설정한다. 여기서, 제4주소 앞 주소를 종료 주소로 하는 저장 공간은 이미 할당한 저장 공간이다. 도 5는 본 발명의 실시예에 의해 제공되는 데이터 처리 장치의 구성을 나타낸 모식도이다. 도 5에 나타낸바와 같이, 데이터 처리 장치는 AI 칩과 메모리를 구비하며, AI 칩은 메모리로부터 데이터 및 명령을 취득하고, 최종 처리 결과를 메모리에 출력할 수 있다. AI 칩 중의 계산 유닛은 처리 태 스크를 실행하고, 계산 유닛은 데이터를 처리하는 과정에서 데이터를 공유 캐쉬(즉 목표 메모리)에 기억하며, 또한 당해 공유 캐쉬로부터 데이터를 취득한다. 공유 캐쉬의 주소 할당 및 해제는 전술한 실시예의 데이터를 저장하기 위한 방법을 채용할 수 있다. 몇몇의 실시예에 있어서, 메모리는 AI 칩 의 내부에 위치할 가능성이 있다. 몇몇의 실시예에 있어서, AI 칩이 특정 데이터 처리 태스크를 실행할 때에, 데이터 처리 장치에서 실행되는 특정 메모리 관리 소프트웨어는 전술한 실시예의 데이터를 저장하기 위한 방법 을 실행함으로써, 공유 캐쉬의 주소 할당 및 해제를 관리한다. 몇몇의 실시예에 있어서, AI 칩이 특정 데이터 처리 태스크를 실행할 때에, 메모리로부터 읽어낸 명령을 실행하여 데이터 처리 태스크를 구현하며, 데이터 처 리 태스크를 구현하는 과정에서 메모리로부터 읽어낸 명령은 공유 캐쉬의 주소 할당 및 해제를 지시한다. 즉, AI 칩은 메모리로부터 읽어낸 명령을 실행하고, 전술한 실시예의 메모리 할당 및 해제의 흐름을 구현할 수 있다. 도 6은 본 발명의 실시예에 의해 제공되는 전자 디바이스의 구성 모식도이며, 당해 전자 디바이스는 서로 다른 구성 또는 성능을 실현하기 위하여, 비교적 큰 차이를 가질 수 있다. 당해 전자 디바이스는 하나 또 는 복수의 중앙 처리 장치(central processing units, CPU)(예를 들면 하나 또는 복수의 프로세서), 메모 리, 애플리케이션 프로그램 또는 데이터를 저장하기 위한 하나 또는 복수의 기록 매체(예 를 들면 하나 또는 복수의 대용량 기억 디바이스) 및 하나 또는 복수의 AI 칩을 포함할 수 있다. 여기서, 메모리 및 기록 매체는 단기 기억 또는 영속 기억일 수 있다. 기록 매체에 저장된 프로그램은 하나 또는 복수의 모듈(도면에는 나타나지 않았음)을 포함할 수 있고, 각 모듈은 전자 디바이스에 대한 일련의 명령 조작을 포함할 수 있다. 또한, 중앙 처리 장치는 기록 매체와 통신하여, 전자 디바이스 상 에서 기록 매체 내의 일련 명령 조작을 실행한다. AI 칩은 CPU에 의해 할당된 다양한 데이터 처 리 태스크를 실행할 수 있다. 전자 디바이스는 본 발명에 의해 제공되는 데이터 처리 장치일 수 있다. 전자 디바이스는 하나 또는 복수의 전원, 하나 또는 복수의 유선 또는 무선 네트워크 인터페이스 , 하나 또는 복수의 입출력 인터페이스, 및/또는 Windows ServerTM, Mac OS XTM, UnixTM, LinuxTM, FreeBSDTM 등의 하나 또는 복수의 조작 시스템을 더 포함할 수 있다. 상기 실시예 중의 데이터 처리 장치에 의해 실행되는 단계는 당해 도 6에 나타낸 전자 디바이스에 의해 구성될 수 있다. 구체적으로, 중앙 처리 장치는 도 4 내의 각 유닛의 기능을 실현할 수 있다. 본 발명의 실시예는 컴퓨터 프로그램이 기억되어 있는 컴퓨터 판독 가능 기록 매체를 제공하는바, 상기 컴퓨터 프로그램은 프로그램 명령을 포함하며, 상기 컴퓨터 프로그램이 프로세서에 의해 실행될 때에, 저장 대기 데이 터에 필요한 저장 공간의 크기에 기반하여 목표 메모리 중의 적어도 두 개의 후보 저장 공간을 확정하는 것; 상 기 저장 대기 데이터의 제1 데이터 해제 시간 및 수명 주기 중의 적어도 하나에 기반하여 상기 저장 대기 데이 터를 상기 적어도 두 개의 후보 저장 공간에 기억하는 복수의 후보 저장 방식 중의 각 후보 저장 방식의 목표 가중치를 확정하는 것; 및 상기 복수의 후보 저장 방식 중의 각 후보 저장 방식의 목표 가중치에 기반하여 상기 저장 대기 데이터의 목표 저장 방식을 확정하는 것이 구현되되, 각 후보 저장 공간은 적어도 하나의 후보 저장 방식에 대응한다. 당해 컴퓨터 판독 가능 기록 매체는 불휘발성의 기록 매체일 수 있다. 본 발명의 실시예는 명령을 포함하는 컴퓨터 프로그램 제품을 제공하는바, 당해 제품이 컴퓨터 상에서 실행될 때에, 컴퓨터가 상기 실시예에 의해 제공되는 데이터를 저장하기 위한 방법이 구현된다. 상기는 본 발명이 구체적인 실시 형태에 지나지 않으며, 본 발명의 보호 범위는 이에 한정되지 않는다. 당업자 는 본 발명에 개시되어 있는 기술 범위 내에서 다양한 동등의 변경 또는 치환을 용이하게 생각해낼 수 있다. 이 러한 변경 또는 치환은 본 발명의 보호 범위 내에 커버된다. 따라서, 본 발명의 보호 범위는 특허청구의 범위 보호 범위를 따르는 것으로 간주한다."}
{"patent_id": "10-2021-7031361", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 의해 제공되는 데이터를 저장하기 위한 방법 플로우 차트이다. 도 2는 본 발명의 실시예에 의해 제공되는 목표 가중치를 계산하는 과정의 모식도이다. 도 3은 본 발명의 실시예에 의해 제공되는 데이터를 저장하기 위한 다른 일 방법의 플로우 차트이다. 도 4는 본 발명의 실시예에 의해 제공되는 데이터 처리 장치의 구성 모식도이다. 도 5는 본 발명의 실시예에 의해 제공되는 다른 일 데이터 처리 장치의 구성 모식도이다. 도 6은 본 발명의 실시예에 의해 제공되는 전자 디바이스의 구성을 나타낸 모식도이다."}
