{"patent_id": "10-2024-0060597", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0010517", "출원번호": "10-2024-0060597", "발명의 명칭": "사용자 데이터 기반의 공기조화기 제어 방법과, 이를 제공하는 서버와 공기조화기", "출원인": "엘지전자 주식회사", "발명자": "한동우"}}
{"patent_id": "10-2024-0060597", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "공기조화기가 서버로 사용자 데이터를 전송하는 단계;상기 서버가 수신된 사용자 데이터를 저장하는 단계;상기 저장된 사용자 데이터의 개수가 기준치 이상이 되면, 상기 서버가 상기 저장된 사용자 데이터를 군집화하는 단계: 및,상기 서버가 상기 군집화 결과에 대응하는 설정 파라미터를 상기 공기조화기로 전송하는 단계;를 포함하는 사용자 데이터 기반의 공기조화기 제어 방법."}
{"patent_id": "10-2024-0060597", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 사용자 데이터는,상기 공기조화기에 대한 조작 입력 이벤트에 기초한 데이터인 사용자 데이터 기반의 공기조화기 제어 방법."}
{"patent_id": "10-2024-0060597", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 사용자 데이터는,상기 공기조화기를 온(on)시키거나 오프(off)시키는 입력, 소정 운전 모드를 요청하는 입력, 설정온도를 변경하는 입력, 소정 입력이 수신된 시점에 센서에서 센싱된 데이터 중 적어도 하나를 포함하는 사용자 데이터 기반의공기조화기 제어 방법."}
{"patent_id": "10-2024-0060597", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 사용자 데이터는,상기 공기조화기에 취침 관련 기능이 설정된 상태에서, 획득되는 데이터인 사용자 데이터 기반의 공기조화기 제어 방법."}
{"patent_id": "10-2024-0060597", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에서, 상기 사용자 데이터가 기설정된 야간 시간대에 소정 페인 포인트(Pain point) 패턴을 가지고, 자동으로 취침 운전 모드의 설정 파라미터가 변경되는 굿슬립 모드가 활성화되지 않은 상태인 경우에, 상기 서버가 상기 군집화 결과에 대응하는 설정 파라미터와 관련된 추천 정보를 상기 공기조화기의 관리 애플리케이션에 등록된 단말로 전송하는 단계;를 더 포함하는 사용자 데이터 기반의 공기조화기 제어 방법."}
{"patent_id": "10-2024-0060597", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에서, 상기 서버가 상기 단말로부터 상기 추천 정보에 대한 승낙 입력 또는 상기 굿슬립 모드의 활성화 입력이 수신하는 단계;를 더 포함하고,상기 승낙 입력 또는 상기 활성화 입력이 수신되면, 상기 서버가 상기 군집화 결과에 대응하는 설정 파라미터를상기 공기조화기로 전송하는 사용자 데이터 기반의 공기조화기 제어 방법.공개특허 10-2025-0010517-3-청구항 7 제1항에 있어서,상기 공기조화기가 상기 설정 파라미터를 적용하는 단계;를 더 포함하는 사용자 데이터 기반의 공기조화기 제어방법."}
{"patent_id": "10-2024-0060597", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 서버는, 상기 사용자 데이터를 수신하는 제1 서버,다수의 사용자 데이터를 학습하여, 소정 페인 포인트(Pain point) 패턴에 대응하는 설정 파라미터를 출력하는제2 서버를 포함하는 사용자 데이터 기반의 공기조화기 제어 방법."}
{"patent_id": "10-2024-0060597", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "공기조화기로부터 사용자 데이터를 수신하는 통신 인터페이스;상기 수신된 사용자 데이터를 저장하는 메모리; 및,상기 저장된 사용자 데이터의 개수가 기준치 이상이 되면, 상기 저장된 사용자 데이터를 기반으로 군집화를 수행하는 프로세서:를 포함하고,상기 프로세서는, 상기 군집화 결과에 대응하는 설정 파라미터를 판별하고, 상기 통신 인터페이스가 상기 판별된 설정 파라미터를상기 공기조화기로 전송하도록 제어하는 서버."}
{"patent_id": "10-2024-0060597", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 사용자 데이터가 기설정된 야간 시간대에 소정 페인 포인트(Pain point) 패턴을 가지고, 자동으로 취침 운전 모드의 설정 파라미터가 변경되는 굿슬립 모드가 활성화되지 않은 상태인 경우에, 상기 군집화 결과에 대응하는 설정 파라미터와 관련된 추천 정보를 상기 공기조화기의 관리 애플리케이션에 등록된 단말로 전송하는 서버."}
{"patent_id": "10-2024-0060597", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 단말로부터 상기 추천 정보에 대한 승낙 입력 또는 상기 굿슬립 모드의 활성화 입력이 수신되면, 상기 군집화 결과에 대응하는 설정 파라미터를 상기 공기조화기로 전송하는 서버."}
{"patent_id": "10-2024-0060597", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "공기조화기로부터 수신되는 사용자 데이터를 저장하는 제1 서버; 및,다수의 사용자 데이터를 학습하여, 소정 페인 포인트(Pain point) 패턴에 대응하는 설정 파라미터를 출력하는제2 서버:를 포함하고,상기 제2 서버는, 상기 제1 서버로부터 사용자 데이터가 수신되면, 수신된 사용자 데이터에 기초한 설정 파라미터 정보를 상기 공기조화기로 전송하는 서버."}
{"patent_id": "10-2024-0060597", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "디폴트 설정으로 공기조화기를 제어하는 제어부;공개특허 10-2025-0010517-4-조작 입력을 수신하는 입력 인터페이스; 및,서버로 상기 조작 입력에 기초하는 사용자 데이터를 전송하는 통신부;를 포함하고,상기 통신부를 통하여 상기 서버로부터 설정 파라미터가 수신되면, 상기 제어부는, 상기 설정 파라미터를 적용하여 변경된 설정으로 제어하는 공기조화기."}
{"patent_id": "10-2024-0060597", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 일 실시 예에 따른 사용자 데이터 기반의 공기조화기 제어 방법은, 공기조화기가 서버로 사용자 데이 터를 전송하는 단계, 상기 서버가 수신된 사용자 데이터를 저장하는 단계, 상기 저장된 사용자 데이터의 개수가 기준치 이상이 되면, 상기 서버가 상기 저장된 사용자 데이터를 군집화하는 단계, 및, 상기 서버가 상기 군집화 결과에 대응하는 설정 파라미터를 상기 공기조화기로 전송하는 단계를 포함함으로써, 맞춤형 기능을 제공할 수 있다."}
{"patent_id": "10-2024-0060597", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는, 공기조화기 제어 방법과, 이를 제공하는 서버와 공기조화기에 관한 것으로, 더욱 상세하게는, 사용 자 데이터 기반의 고객 맞춤 공기조화기 제어 방법과, 이를 제공하는 서버와 공기조화기에 관한 것이다."}
{"patent_id": "10-2024-0060597", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "홈 어플라이언스(home appliance)는, 공기조화기, 의류처리장치(세탁기, 건조기 등), 냉장고 등의 가정, 빌딩 내부에서 사용되는 전기기기일 수 있다. 홈 어플라이언스의 기능이 고도화되면서, 홈 어플라이언스에 다양한 기능이 부가되고 있으며, 이를 위해, 서버 등으로부터 데이터를 다운로드하여, 데이터를 업데이트하는 기능이 요구되고 있다. 또한, 홈 어플라이언스는, 와이파이(wi-fi) 통신 모듈 등 통신 모듈을 구비하여 다른 기기와 통신함으로써, 다양한 추가 기능 및 서비스를 제공할 수 있다. 공기조화기는 쾌적한 실내 환경을 조성하기 위해 실내로 냉온의 공기를 토출하여, 실내 온도를 조절하고, 실내 공기를 정화하도록 함으로서 인간에게 보다 쾌적한 실내 환경을 제공하기 위해 설치된다. 일반적으로 공기조화기는 열교환기로 구성되어 실내에 설치되는 실내기와, 압축기 및 열교환기 등으로 구성되어 실내기로 냉매를 공급하는 실외기를 포함한다. 공기조화기는 열교환기를 포함하는 실내기와, 압축기 및 열교환기를 포함하는 실외기로 분리되어 제어되며, 압 축기 또는 열교환기로 공급되는 전원을 제어함으로써 동작된다. 또한, 공기조화기는 실외기에 적어도 하나의 실 내기가 연결될 수 있으며, 요청되는 운전 상태에 따라, 실내기로 냉매를 공급하여, 냉방 또는 난방모드로 운전 된다. 선행문헌(대한민국 공개특허공보 10-2022-0162530호)은, 공기조화기, 공기조화기의 제어 방법 및 제어 시스템에 관한 것으로, 공기조화기의 현재 상태 정보를 서버에 전송하고, 서버는 현재 상태 정보에 대한 응답으로 인공지 능 모델에서 쾌적 온도 그래프를 획득한 후, 과냉방 구간이 식별되면 제품으로 설정온도 상승 요청을 보내고 있 다. 선행문헌(대한민국 공개특허공보 10-2022-0162530호)은, 과냉방 사용자의 현재 상태 정보를 획득하며, 과냉방 되는 구간을 식별해 설정온도 상승을 요청하는 기술로, 현재 상태 및 인공지능 모델 정확성에 의존하는 기술이 기 때문에, 모델이 잘못된 예측을 하는 경우 사용자가 선호하지 않은 설정으로 불편함이 발생할 수 있다."}
{"patent_id": "10-2024-0060597", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시의 목적은, 제조사에서 미리 결정된 기능을 사용자 데이터 기반으로 변경함으로써, 사용자의 불편함을 해소할 수 있는 공기조화기, 서버 및 그 제어 방법을 제공함에 있다. 본 개시의 목적은, 사용자 맞춤형 자동 취침 운전 모드를 제공하여 사용자의 만족도를 증대할 수 있는 공기조화 기, 서버 및 그 제어 방법을 제공함에 있다. 본 개시의 목적은, 서버가 공기조화기 사용 시 발생하는 사용자의 이벤트 데이터를 분석하여 최적화된 파라미터 를 공기조화기로 전달함으로써, 각 고객에게 최적화된 기능과 공기조화기를 편리하게 사용할 수 있는 기술을 제공함에 있다. 본 개시의 목적은, 사용자가 환경에 맞는 공기조화기 기능을 제공 받음으로써, 반복적인 조작 없이 편안한 환경 에서 공기조화기를 사용할 수 있는 기술을 제공함에 있다. 본 개시의 목적은, 사용자의 행동 정보(이벤트)를 바탕으로 기능 최적화를 제공함에 있다."}
{"patent_id": "10-2024-0060597", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 실시 예에 따른 공기조화기, 서버, 및 이를 포함하는 홈 어플라이언스 시스템은, 사용자 데이터에 기 반하여 맞춤형 기능을 제공할 수 있다. 본 개시의 일 실시 예에 따른 사용자 데이터 기반의 공기조화기 제어 방법은, 공기조화기가 서버로 사용자 데이 터를 전송하는 단계, 상기 서버가 수신된 사용자 데이터를 저장하는 단계, 상기 저장된 사용자 데이터의 개수가 기준치 이상이 되면, 상기 서버가 상기 저장된 사용자 데이터를 군집화하는 단계, 및, 상기 서버가 상기 군집화 결과에 대응하는 설정 파라미터를 상기 공기조화기로 전송하는 단계를 포함함으로써, 맞춤형 기능을 제공할 수 있다. 상기 사용자 데이터는, 상기 공기조화기에 대한 조작 입력 이벤트에 기초한 데이터일 수 있다. 상기 사용자 데이터는, 상기 공기조화기를 온(on)시키거나 오프(off)시키는 입력, 소정 운전 모드를 요청하는 입력, 설정온도를 변경하는 입력, 소정 입력이 수신된 시점에 센서에서 센싱된 데이터 중 적어도 하나를 포함할 수 있다. 상기 사용자 데이터는, 상기 공기조화기에 취침 관련 기능이 설정된 상태에서, 획득되는 데이터일 수 있다. 본 개시의 일 실시 예에 따른 사용자 데이터 기반의 공기조화기 제어 방법은, 상기 사용자 데이터가 기설정된 야간 시간대에 소정 페인 포인트(Pain point) 패턴을 가지고, 자동으로 취침 운전 모드의 설정 파라미터가 변경 되는 굿슬립 모드가 활성화되지 않은 상태인 경우에, 상기 서버가 상기 군집화 결과에 대응하는 설정 파라미터 와 관련된 추천 정보를 상기 공기조화기의 관리 애플리케이션에 등록된 단말로 전송하는 단계를 더 포함할 수 있다. 본 개시의 일 실시 예에 따른 사용자 데이터 기반의 공기조화기 제어 방법은, 상기 서버가 상기 단말로부터 상 기 추천 정보에 대한 승낙 입력 또는 상기 굿슬립 모드의 활성화 입력이 수신하는 단계를 더 포함할 수 있다. 이 경우에, 상기 승낙 입력 또는 상기 활성화 입력이 수신되면, 상기 서버가 상기 군집화 결과에 대응하는 설정 파라미터를 상기 공기조화기로 전송할 수 있다. 본 개시의 일 실시 예에 따른 사용자 데이터 기반의 공기조화기 제어 방법은, 상기 공기조화기가 상기 설정 파 라미터를 적용하는 단계를 더 포함할 수 있다. 상기 서버는, 상기 사용자 데이터를 수신하는 제1 서버, 다수의 사용자 데이터를 학습하여, 소정 페인 포인트 (Pain point) 패턴에 대응하는 설정 파라미터를 출력하는 제2 서버를 포함할 수 있다. 본 개시의 일 실시 예에 따른 서버는, 공기조화기로부터 사용자 데이터를 수신하는 통신 인터페이스, 상기 수신 된 사용자 데이터를 저장하는 메모리, 및, 상기 저장된 사용자 데이터의 개수가 기준치 이상이 되면, 상기 저장 된 사용자 데이터를 기반으로 군집화를 수행하는 프로세서를 포함한다. 상기 프로세서는, 상기 군집화 결과에 대응하는 설정 파라미터를 판별하고, 상기 통신 인터페이스가 상기 판별 된 설정 파라미터를 상기 공기조화기로 전송하도록 제어한다. 상기 사용자 데이터가 기설정된 야간 시간대에 소정 페인 포인트(Pain point) 패턴을 가지고, 자동으로 취침 운 전 모드의 설정 파라미터가 변경되는 굿슬립 모드가 활성화되지 않은 상태인 경우에, 서버는 상기 군집화 결과 에 대응하는 설정 파라미터와 관련된 추천 정보를 상기 공기조화기의 관리 애플리케이션에 등록된 단말로 전송 할 수 있다. 상기 단말로부터 상기 추천 정보에 대한 승낙 입력 또는 상기 굿슬립 모드의 활성화 입력이 수신되면, 서버는 상기 군집화 결과에 대응하는 설정 파라미터를 상기 공기조화기로 전송할 수 있다. 본 개시의 일 실시 예에 따른 서버는, 공기조화기로부터 수신되는 사용자 데이터를 저장하는 제1 서버, 및, 다 수의 사용자 데이터를 학습하여, 소정 페인 포인트(Pain point) 패턴에 대응하는 설정 파라미터를 출력하는 제2서버를 포함하고, 상기 제2 서버는, 상기 제1 서버로부터 사용자 데이터가 수신되면, 수신된 사용자 데이터에 기초한 설정 파라미터 정보를 상기 공기조화기로 전송한다. 본 개시의 일 실시 예에 따른 공기조화기는, 디폴트 설정으로 공기조화기를 제어하는 제어부, 조작 입력을 수신 하는 입력 인터페이스, 및, 서버로 상기 조작 입력에 기초하는 사용자 데이터를 전송하는 통신부를 포함하고, 상기 통신부를 통하여 상기 서버로부터 설정 파라미터가 수신되면, 상기 제어부는, 상기 설정 파라미터를 적용 하여 변경된 설정으로 제어할 수 있다."}
{"patent_id": "10-2024-0060597", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 실시 예들 중 적어도 하나에 의하면, 제조사에서 미리 결정된 기능을 사용자 데이터 기반으로 변경함 으로써, 사용자의 불편함을 해소할 수 있고, 사용자 경험을 향상할 수 있다. 본 개시의 실시 예들 중 적어도 하나에 의하면, 사용자 맞춤형 자동 취침 운전 모드를 제공하여 사용자의 만족 도를 증대할 수 있다. 본 개시의 실시 예들 중 적어도 하나에 의하면, 서버가 공기조화기 사용 시 발생하는 사용자의 이벤트 데이터를 분석하여 최적화된 파라미터를 공기조화기로 전달함으로써, 각 고객에게 최적화된 기능을 제공하고, 각 고객은 공기조화기를 편리하게 사용할 수 있다. 본 개시의 실시 예들 중 적어도 하나에 의하면, 사용자가 환경에 맞는 공기조화기 기능을 제공 받음으로써, 반 복적인 조작 없이 편안한 환경에서 공기조화기를 사용할 수 있다. 본 개시의 실시 예들 중 적어도 하나에 의하면, 사용자의 행동 정보(이벤트)를 바탕으로 기능 최적화를 제공할 수 있다. 한편, 그 외의 다양한 효과는 후술될 본 발명의 실시예에 따른 상세한 설명에서 직접적 또는 암시적으로 개시될 것이다."}
{"patent_id": "10-2024-0060597", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 첨부한 도면을 참조하여 본 개시의 실시 예를 상세하게 설명한다. 그러나 본 개시는 이러한 실시 예 에 한정되는 것은 아니며 다양한 형태로 변형될 수 있음은 물론이다. 도면에서는 본 개시를 명확하고 간략하게 설명하기 위하여 설명과 관계없는 부분의 도시를 생략하였으며, 명세 서 전체를 통하여 동일 또는 극히 유사한 부분에 대해서는 동일한 도면 참조부호를 사용한다. 한편, 이하의 설명에서 사용되는 구성요소에 대한 접미사 \"모듈\" 및 \"부\"는 단순히 본 명세서 작성의 용이함만 이 고려되어 부여되는 것으로서, 그 자체로 특별히 중요한 의미 또는 역할을 부여하는 것은 아니다. 따라서, 상 기 \"모듈\" 및 \"부\"는 서로 혼용되어 사용될 수도 있다. 또한, 본 명세서에서, 다양한 요소들을 설명하기 위해 제1, 제2 등의 용어가 이용될 수 있으나, 이러한 요소들 은 이러한 용어들에 의해 제한되지 아니한다. 이러한 용어들은 한 요소를 다른 요소로부터 구별하기 위해서만 이용된다. 도 1은 본 개시의 일 실시 예에 따른 공기조화기의 구성을 예시하는 도면이다. 도 1을 참조하면, 본 개시에 따른 공기조화기는, 실내기, 실내기에 연결되는 실외기를 포함할 수 있다. 공기조화기의 실내기는, 스탠드형 공기조화기, 벽걸이형 공기조화기 및 천장형 공기조화기 중 어느 것이라 도 적용 가능하나, 도면에서는, 스탠드형 실내기를 예시한다. 한편, 공기조화기는, 환기장치, 공기청정장치, 가습장치 및 히터 중 적어도 하나를 더 포함할 수 있으며, 실내기 및 실외기의 동작에 연동하여 동작할 수 있다. 실외기는, 냉매를 공급받아 압축하는 압축기(미도시)와, 냉매와 실외공기를 열교환하는 실외 열교환기(미도 시)와, 공급되는 냉매로부터 기체 냉매를 추출하여 압축기로 공급하는 어큐뮬레이터(미도시)와, 난방운전에 따 른 냉매의 유로를 선택하는 사방밸브(미도시)를 포함한다. 또한, 다수의 센서, 밸브 및 오일회수기 등을 더 포 함하나, 그 구성에 대한 설명은 하기에서 생략하기로 한다. 실외기는 구비되는 압축기 및 실외 열교환기를 동작시켜 설정에 따라 냉매를 압축하거나 열교환하여 실내기 로 냉매를 공급한다. 실외기는 원격제어기(미도시) 또는 실내기의 요구(demand)에 의해 구동될 수 있다. 이때, 구동되는 실내기에 대응하여 냉/난방 용량이 가변 됨에 따라 실외기의 작동 개수 및 실외기에 설치 된 압축기의 작동 개수가 가변 되는 것도 가능하다. 또한, 도 1에서는 하나의 실내기와 실외기를 도시 하였지만, 본 개시는 이에 한정되지 않는다. 예를 들어, 하나의 실외기에 여러 실내기가 냉매배관으로 연결될 수 있다. 이때, 실외기는, 연결된 실내기로 압축된 냉매를 공급한다. 실내기는, 실외기로부터 냉매를 공급받아 실내로 냉온의 공기를 토출한다. 실내기는 실내 열교환기 (미도시)와, 실내기팬(미도시), 공급되는 냉매가 팽창되는 팽창밸브(미도시), 다수의 센서(미도시)를 포함한다. 이때, 실외기 및 실내기는 유선 또는 무선으로 연결되어 상호 데이터를 송수신하며, 실외기 및 실내기 는 원격제어기(미도시)와 유선 또는 무선으로 연결되어 원격제어기(미도시)의 제어에 따라 동작할 수 있다. 리모컨(미도시)은 실내기에 연결되어, 실내기로 사용자의 제어명령을 입력하고, 실내기의 상태정보를 수신 하여 표시할 수 있다. 이때 리모컨은 실내기와의 연결 형태에 따라 유선 또는 무선으로 통신할 수 있다. 도 2는 도 1의 실외기와 실내기의 개략도이다. 도 2를 참조하면, 공기조화기는, 크게 실내기와 실외기로 구분된다. 실외기는, 냉매를 압축시키는 역할을 하는 압축기와, 압축기를 구동하는 압축기용 전동기(102b)와, 압 축된 냉매를 방열시키는 역할을 하는 실외측 열교환기와, 실외 열교환기의 일측에 배치되어 냉매의 방열을 촉진 시키는 실외 팬(105a)과 실외 팬(105a)을 회전시키는 모터로 이루어진 실외 송풍기와, 응축된 냉매를 팽창하는 팽창기구 또는 팽창 밸브와, 압축된 냉매의 유로를 바꾸는 냉/난방 절환밸브 또는 사방밸브와, 기체화된 냉매를 잠시 저장하여 수분과 이물질을 제거한 뒤 일정한 압력의 냉매를 압축기로 공급하는 어큐뮬레이터 등을 포함할 수 있다. 실내기는 실내에 배치되어 냉/난방 기능을 수행하는 실내측 열교환기와, 실내측 열교환기의 일측 에 배치되어 냉매의 방열을 촉진시키는 실내 팬(109a)과 실내 팬(109a)을 회전시키는 전동기(109b)로 이루어진 실내 송풍기 등을 포함한다. 실내측 열교환기는 적어도 하나가 설치될 수 있다. 압축기는 인버터 압축기, 정속 압축기 중 적어도 하나가 사용될 수 있다. 또한, 공기조화기는 실내를 냉방시키는 냉방기로 구성되는 것도 가능하고, 실내를 냉방시키거나 난방시키 는 히트 펌프로 구성되는 것도 가능하다. 한편, 실외기 내의 실외 팬(105a)은, 모터(105b)를 구동하는 실외 팬 구동부(미도시)에 의해 구동될 수 있 다. 한편, 실외기 내의 압축기는, 압축기 모터(102b)를 구동하는 압축기 모터 구동부(미도시)에 의해 구동 될 수 있다. 한편, 실내기 내의 실내 팬(109a)은, 실내 팬 모터(109b)를 구동하는 실내 팬 구동부(미도시)에 의해 구동 될 수 있다. 도 3은 도 1의 공기조화기의 간략한 내부 블록도이다. 도 3을 참조하면, 본 개시의 일 실시 예에 따른 공기조화기는, 각종 데이터를 저장하는 메모리, 다른 전자기기와 통신하는 통신부, 공기조화기의 전반적인 동작을 제어하는 제어부를 포함할 수 있다. 공기조화기는, 인터페이스(120, 130), 센서부, 구동부를 더 포함할 수 있다. 메모리는 공기조화기의 동작에 필요한 각종 정보들을 기록하는 것으로, 휘발성 또는 비휘발성 기록 매체를 포함할 수 있다. 메모리에는 공기조화기의 동작에 관련된 각종 설정 정보, 각 운전 모드의 동작을 위한 데이터가 저장 될 수 있다. 예를 들어, 메모리에는, 냉방 모드, 난방 모드, 공기청정 모드, 취침 운전 모드 등 각종 운전 모드의 설정 정보, 센서부에서 획득되는 센싱 데이터, 통신부를 통하여 수신된 데이터, 사용자의 조 작 입력 정보, 기타 알고리즘이 저장될 수 있다. 한편, 본 개시의 일 실시 예에 따른 공기조화기는 다양한 자동 운전 모드들을 제공할 수 있다. 제어부 는, 사용자의 자동 운전 모드 동작 명령에 대응하여, 복수개의 자동 운전 모드들 중 어느 하나의 자동 운 전 모드에 따라 동작하도록 제어할 수 있다. 메모리는, 복수개의 자동 운전 모드들의 초기 설정값 및 현재 설정값들을 저장할 수 있다. 통신부는, 하나 이상의 통신 모듈을 구비하여, 다른 전자기기와, 통신을 수행하여, 각종 신호를 주고 받을 수 있다. 또한, 제어부는 통신부를 통해 공기조화기의 상태 정보, 사용자의 조작 입력 등 사용자 데이터 를 소정 서버로 전송할 수 있다. 한편, 상기 통신부를 통하여 소정 서버로부터 제어 신호가 수신되면, 제어부는 수신되는 제어 신호에 따라 동작하도록 공기조화기를 제어할 수 있다. 한편, 본 개시의 일 실시 예에 따른 홈 어플라이언스 시스템은 공기조화기 등의 홈 어플라이언스와 서버를 포함할 수 있다. 서버는, 공기조화기 등 홈 어플라이언스 제조사가 운영하는 서버 또는 서비스 제공자가 운영하 는 서버일 수 있고, 일종의 클라우드(Cloud) 서버일 수 있다. 본 개시의 일 실시 예에 따른 공기조화기는, 상기 통신부를 통하여 서버와 통신할 수 있다. 인터페이스(120, 130)는 입력 인터페이스와 출력 인터페이스를 포함할 수 있다. 입력 인터페이스는 사용자 입력을 수신할 수 있다. 예를 들어, 입력 인터페이스는 복수의 조작 버튼 을 구비하여, 입력되는 버튼에 대응하는 신호를 제어부로 전달할 수 있다. 한편, 공기조화기는 원격제어장치를 통한 입력에 따라 동작할 수도 있다. 예를 들어, 공기조화기는, 유/무선 리모컨 또는 사용자의 이동 단말기를 통한 입력을 수신할 수 있고, 수 신된 입력에 대응하는 동작을 수행할 수 있다. 실시 예에 따라서, 입력 인터페이스는 사용자의 음성 명령을 수신하나 이상의 마이크(MIC)를 구비할 수 있 다. 출력 인터페이스는, 오디오 신호를 출력하는 오디오 출력부를 포함할 수 있다. 오디오 출력부는, 제어부의 제어에 따라, 동작모드, 동작상태, 에러상태에 대응하는 알림음, 경고음 등을 출 력할 수 있다. 오디오 출력부는, 제어부의 제어에 따라, 동작모드, 동작상태, 에러상태 등의 알림 메 시지, 사용자의 명령 입력에 대응하는 정보, 사용자의 명령 입력에 대응하는 처리 결과 등을 오디오로 출력할 수 있다. 오디오 출력부는, 제어부로부터의 전기 신호를 오디오 신호로 변환하여 출력할 수 있다. 이 를 위해, 오디오 출력부는, 스피커 등을 구비할 수 있다.또한, 출력 인터페이스는 사용자의 명령 입력에 대응하는 정보, 사용자의 명령 입력에 대응하는 처리 결과, 동작모드, 동작상태, 에러상태 등을 영상으로 표시하는 디스플레이를 포함할 수 있다. 실시 예에 따라서는, 상기 디스플레이는 터치패드와 상호 레이어 구조를 이루어 터치스크린으로 구성될 수 있다. 이 경우에, 상기 디스플레이는 출력 장치 이외에 사용자의 터치에 의한 정보의 입력이 가능한 입력 장치로도 사용될 수 있다. 구동부는, 제어부의 제어에 따라 압축기, 실외팬, 실내팬, 열교환기, 밸브, 풍향 조절 수단 등의 동 작을 제어할 수 있다. 구동부는, 실외기 내의 압축기를 구동하기 위한 압축기 구동부, 열교환을 위한 실외 팬(105a)을 동작시키는 실외 팬 구동부, 열교환을 위한 실내 팬(109a)을 동작시키는 실내 팬 구동부, 풍향 을 제어하기 베인 구동부 등을 포함할 수 있다. 한편, 제어부는, 압축기, 실내 팬(109a), 실외 팬(105a)의 동작 제어를 위해, 각각 압축기 구동부, 실외 팬 구동부, 실내 팬 구동부를 제어할 수 있다. 예를 들어, 제어부는, 압축기 구동부, 실외 팬 구동부, 실내 팬 구동부에, 목표 온도에 기초하여, 각각 해 당하는 속도 지령치 신호를 출력할 수 있다. 한편, 제어부는, 압축기 구동부, 실외 팬 구동부, 실내 팬 구동부에 대한 제어 이외에, 공기조화기 전반의 동작을 제어할 수 있다. 예를 들어, 제어부는, 냉/난방 절환밸브 또는 사방밸브의 동작을 제어할 수 있다. 또는, 제어부(14 0)는, 팽창기구 또는 팽창 밸브의 동작을 제어할 수 있다. 센서부는, 실내외의 온도를 센싱하는 하나 이상의 온도 센서와 습도를 센싱하는 습도 센서, 공기질을 센싱 하는 먼지 센서 등을 구비할 수 있다. 또한, 제어부는, 센서부에서 감지되는 데이터에 기초하여, 공기조화기의 동작을 제어할 수 있다. 한편, 제어부는 소정 동작시 작동 시간을 카운팅(counting)할 수 있다. 또는 본 개시의 일 실시 예에 따른 공기조화기는 별도의 타이머(timer)를 더 포함할 수도 있다. 제어부는, 사용자의 자동 운전 모드 동작 명령에 대응하여, 복수개의 자동 운전 모드들 중 어느 하나의 자 동 운전 모드에 따라 동작하도록 제어할 수 있다. 본 개시에 따르면, 상기 복수개의 자동 운전 모드들은, 설정값들이 고정된 고정 자동 운전 모드와 사용 이력에 따라 상기 설정값들이 가변되는 가변 자동 운전 모드를 포함할 수 있다. 한편, 상기 고정 자동 운전 모드는 설정값들이 기본값으로 고정되어 디폴트(default)로 제공되는 자동 운전 모 드일 수 있다. 본 개시는 사용자의 공기조화기 사용 패턴과 무관한 고정 자동 운전 모드와 사용자의 공기조화기 사 용 패턴이 학습되어 설정값에 반영되어 가변되는 가변 자동 운전 모드를 제어할 수 있다. 한편, 상기 가변 자동 운전 모드는, 상이한 초기 설정값을 가지는 복수의 가변 자동 운전 모드들을 포함할 수 있다. 즉, 본 개시의 일 실시 예에 따른 공기조화기는 다른 초기 설정값을 가지는 복수의 가변 자동 운전 모드들을 제공하고, 각 가변 자동 운전 모드들은 사용자의 사용 패턴을 학습하여 설정값들이 사용자에 최적화되 도록 변경될 수 있다. 상기 가변 자동 운전 모드들은 사용자의 사용 패턴에 따라 설정값들이 변경될 수 있다. 도 4는 본 개시의 일 실시 예에 따른 홈 어플라이언스 시스템 구성도이다. 도 4를 참조하면, 본 개시의 일 실시 예에 따른 홈 어플라이언스 시스템은, 공기조화기 등 홈 어플라이언 스와 서버를 포함한다. 또한, 홈 어플라이언스 시스템은, 단말을 더 포함할 수 있다. 홈 어플라이언스는, 내부에 통신 인터페이스(예를 들어, 통신부)를 구비하고, 내부 네트워크 내의 전자기 기들 또는 외부 네트워크를 통해 접속 가능한 전자기기들과 데이터를 교환할 수 있다. 이를 위해, 통신 인터페 이스(미도시)는, 서버, AP 장치 등과 유, 무선으로 데이터 교환을 수행할 수 있다. 홈 어플라이언스 시스템은, 사용자 측에 추천 정보를 제공할 수 있다. 홈 어플라이언스 시스템은, 홈 어플라이 언스의 모델, 사용되는 국가, 기타 통계 데이터에 기반하여, 소정 운전 코스(모드), 상세 설정 등을 추천하는등 추천 정보를 제공할 수 있다. 더 바람직하게는, 홈 어플라이언스 시스템은, 사용자에 개인화된 맞춤형 세팅 정보를 추천할 수 있다. 추천 세 팅 정보는, 공기조화기 등 홈 어플라이언스의 사용자 데이터, 사용자의 단말에 입력되는 정보에 기초 하여 생성될 수 있다. 단말은, 통신 가능한 전자기기로, 예를 들어, 스마트폰, 태블릿 PC 등 사용자가 휴대하여 이동 가능한 이 동 단말기 등이 해당될 수 있다. 또한, 단말은, 데스크탑 PC(미도시) 등 고정된 장소에서 사용되는 단말기 일 수 있다, 개인화된 정보와 서비스 제공이 더 용이하도록, 단말은, 사용자 개인이 휴대하면서 사용하는 이동 단말기인 것이 더 바람직할 수 있다. 이하에서는 단말로 이동 단말기가 사용되는 경우로 실시 예들을 설명한다. 한편, 가전 관리 애플리케이션(앱)은, 가전 기기의 등록, 동작 제어를 위한 애플리케이션으로, 이동 단말기 에 설치될 수 있다. 예를 들어, 가전 관리 애플리케이션은 ThinQ(씽큐) 앱으로 명명될 수 있다. 이동 단말기는, 홈 어플라이언스와 무선 통신을 수행하고, 무선 접속된 홈 어플라이언스를 원격 제어하거 나, 홈 어플라이언스로부터 모니터링 데이터를 수신할 수 있다. 이동 단말기는 SoftAP(Software enabled Access Point)를 이용하여, 홈 어플라이언스와 연동을 시도할 수 있다. SoftAP는 무선 액세스 포인트의 기능을 소프트웨어로 구현하여, 무선 AP와 같이, 동작하도록 하는 것을 의미할 수 있다. 이동 단말기는 무선랜 모듈을 이용하여, SoftAP를 구동시켜, 홈 어플라이언스와 연동을 시도할 수 있다. 서버는, 네트워크 등을 통해 접속되는 홈 어플라이언스와, 데이터를 송수신할 수 있다. 예를 들어, 서버 는, 이동 단말기의 요청에 의해 홈 어플라이언스로, 업데이트 정보를 제공할 수 있다. 다른 예로, 서버는, 이동 단말기 또는 홈 어플라이언스로부터의 요청이 없는 경우라도, 필요시에 홈 어플라이언스로 업데이트 정보를 제공할 수 있다. 한편, 홈 어플라이언스는, 각종 설정(소정 기능, 기능별 세부 설정, 효과음, 동작음 등)에 대해서도 업그레이드 가능하다. 따라서, 홈 어플라이언스는, 신규 설정에 대한 데이터를 상기 서버 또는 상기 이동 단말기(20 0)로부터 수신하여 업그레이드함으로써, 다양한 효과를 제한없이 확장하며 사용자에게 제공할 수 있다. 따라서, 해당 홈 어플라이언스 제품의 출시시점에 제공된 설정 외에도 다양한 기능과 효과를 제공할 수 있다. 홈 어플라이언스는, 내부에서 시스템 애플리케이션, 운전 모드와 관련한 애플리케이션, 또는 다운로드 애플리케 이션을 실행할 수 있다. 한편, 업데이트 정보는, 펌웨어 업데이트 정보, 소프트웨어 업데이트 정보 등을 포함할 수 있다. 펌웨어 업데이 트 정보는, 홈 어플라이언스 내의 펌웨어를 업데이트하기 위한 데이터로서, 예를 들어, 홈 어플라이언스의 부하 제어 또는 안전 제어에 대하 업데이트 정보일 수 있다. 한편, 소프트웨어 업데이트 정보는, 신규 운전 모드와 관련한 업그레이드 정보를 포함할 수 있다. 이러한 신규 운전 모드와 관련한 업그레이드 정보에 기초하여, 운전 모드의 업그레이드가 수행될 수 있다. 한편, 소프트웨어 업데이트 정보는, 시스템 애플리케이션, 운전 모드와 관련한 애플리케이션, 또는 다운로드 애플리케이션에 대한 업데이트 정보를 더 포함할 수 있다. 이러한 업데이 트 정보에 기초하여, 운전 모드의 업데이트가 수행될 수 있다. 펌웨어 업데이트 정보는, 펌웨어, 운영 체제 또 는 프레임워크에 대한 데이트 데이터를 포함할 수 있다. 이러한 펌웨어 업데이트 정보에 기초하여, 펌웨어가 업 데이트될 수 있다. 홈 어플라이언스는, 신규 운전 모드와 관련한 업그레이드 정보를 서버 또는 이동 단말기로부터 수신 하고, 신규 운전 모드와 관련한 업그레이드 정보에 기초하여, 신규 운전 모드를 위한 업그레이드(upgrade)를 수 행할 수 있다. 한편, 본 개시의 일 실시 예에 따른 홈 어플라이언스는, 신규 운전 모드에 대한 업그레이드 외에, 기존의 운전 모드에 대한 상세 설정 가변 등과 관련된 업데이트를 수행할 수도 있다. 한편, 홈 어플라이언스 시스템은, 액세스 포인트(access point; AP) 장치(미도시)를 더 포함할 수 있다. AP 장 치는, 인접 전자 기기(electric device)에 내부 네트워크를 제공할 수 있다. 특히, 무선 네트워크를 제공할 수 있다.한편, AP 장치는, 내부 네트워크 내의 전자 기기들에, 소정 통신 방식에 의한 무선 채널을 할당하고, 해당 채널 을 통해, 무선 데이터 통신을 수행할 수 있다. 여기서, 소정 통신 방식은, WiFi 통신 방식일 수 있다. 이때, 내부 네트워크 내에 위치하는 이동 단말기는, AP 장치를 통해, 홈 어플라이언스에 접속함으로써, 홈 어플라이언스에 대한 모니터링, 원격제어 등을 수행할 수 있게 된다. 한편, AP 장치는, 내부 네트워크 외에, 외부 네트워크를 통해, 외부 전자기기와 데이터 통신을 수행할 수 있다. 예를 들어, AP 장치는, 외부 네트워크를 통해, 외부에 위치하는 이동 단말기와 무선 데이터 통신을 수행할 수 있다. 이때, 외부 네트워크에 위치하는 이동 단말기는, 외부 네트워크, 및 AP 장치를 통해, 홈 어플라 이언스에 접속함으로써, 홈 어플라이언스에 대한 모니터링, 원격제어 등을 수행할 수 있게 된다. 다른 예로, AP 장치는, 외부 네트워크를 통해, 외부에 위치하는 서버와 무선 데이터 통신을 수행할 수 있 다. 한편, 서버는, 홈 어플라이언스에 대한 펌웨어 정보, 운전 정보(코스 정보 등)를 저장하고, 홈 어플라이언 스에 대한 제품 정보를 등록할 수 있다. 예를 들어, 서버는, 홈 어플라이언스 판매사가 운영하는 서버일 수 있다. 서버는, 복수개의 서버(301, 302)를 포함할 수 있다. 예를 들어, 제1 서버는, 가전 관리 애플리케이 션(씽큐 앱)을 관리하는 씽큐 서버일 수 있다. 제2 서버는, 제1 서버와 연동하여 직접 홈 어플라이언 스를 제어하는 가전 서비스 서버일 수 있다. 다른 예로, 서버는, 등록된 홈 어플라이언스에 관한 데이터를 획득하는 제1 서버와, 제1 서버로 부터 홈 어플라이언스에 관한 데이터를 수신하고, 상기 수신된 데이터에 기초하여 홈 어플라이언스 관련 정보를 생성하는 제2 서버를 포함할 수 있다. 예를 들어, 제1 서버는 씽큐 서버이고, 제2 서버는 데이 터 처리 서버일 수 있다. 실시 예에 따라서, 제2 서버는 홈 어플라이언스 관련 정보를 생성하는 가전 서비 스 서버일 수 있다. 또는, 서버는, 씽큐 서버, 데이터 처리 서버, 가전 서비스 서버를 포함할 수 있다. 제1 서버는, 홈 어플라이언스 사용데이터, 로그 데이터, 고객 프로파일 데이터 등 다양한 로우 데이터(Raw Data)를 획득할 수 있다. 제1 서버는, 로우 데이터를 직접 홈 어플라이언스로부터 수신할 수 있다. 또한, 제1 서버는, 다양한 복수의 서버로부터 로우 데이터를 획득할 수 있다. 제2 서버는, 제1 서버로부터 전달받은 로우 데이터를 처리하고, 로우 데이터에 기초한 2차 데이터를 생산할 수 있다. 예를 들어, 제2 서버는, 학습된 인공신경망을 포함하고, 제1 서버로부터 전달받은 사용자 데이터에 기초하여 사용자 맞춤형 정보를 출력할 수 있다. 도 5는 본 개시의 일 실시 예에 따른 서버의 주요 구성에 대한 블록도이다. 도 5를 참조하면, 서버는, 통신 인터페이스, 메모리, 및 프로세서를 구비할 수 있다. 제1 서버와 제2 서버는, 각각, 통신 인터페이스, 메모리, 및 프로세서를 구비할 수 있다. 프로세서는, 서버의 전반적인 동작을 제어할 수 있다. 통신 인터페이스는, 이동 단말기, 공기조화기 등 홈 어플라이언스, 다른 서버 등으로부터 상태 정보, 동작 정보, 조작 정보, 음성 데이터, 문자 데이터 등 각종 데이터를 수신할 수 있다. 그리고 통신 인터페이스는 수신되는 각종 정보에 대응하는 데이터를 그대로 또는 소정 처리 후에 이동 단 말기, 공기조화기 등 홈 어플라이언스, 다른 서버 등으로 송신할 수 있다. 이를 위해, 통신 인터페이스는 인터넷 모듈, 이동 통신 모듈 등 하나 이상의 통신 모듈을 구비할 수 있다. 메모리는, 수신되는 정보를 저장하고, 이에 대응하는 결과 정보 생성을 위한 데이터를 구비할 수 있다. 또한, 메모리에는 해당 서버의 동작을 위한 데이터가 저장될 수 있다. 예를 들어, 메모리에는, 음성 인식 알고리즘, 홈 어플라이언스의 제품 정보, 상태 정보, 홈 어플라이언스의 제어를 위한 데이터가 저장될 수 있다. 또한, 메모리에는 공기조화기 등 홈 어플라이언스의 사용자 데이터, 사용 패턴 정보가 저장될 수 있 다. 사용자 데이터는 사용자의 홈 어플라이언스의 조작 데이터, 사용 이력 데이터 등을 포함할 수 있다. 사용자데이터는 사용자 및/또는 홈 어플라이언스의 식별 정보를 더 포함할 수 있다. 서버는 수신하는 음성 데이터, 공기조화기 등 홈 어플라이언스의 사용자 데이터, 사용 패턴 정보에 대하여 딥러닝(Deep Learning) 등 머신 러닝(machine learning)을 수행할 수 있고, 메모리는, 머신 러닝 에 사용되는 데이터, 결과 데이터 등을 저장할 수 있다. 머신 러닝(Machine Learning)의 일종인 딥러닝(Deep Learning) 기술은 데이터를 기반으로 다단계로 깊은 수준까 지 내려가 학습하는 것이다. 딥러닝(Deep learning)은 단계를 높여갈수록 복수의 데이터들로부터 핵심적인 데이터를 추출하는 머신 러닝 (Machine Learning) 알고리즘의 집합을 나타낼 수 있다. 딥러닝 구조는 인공신경망(ANN)를 포함할 수 있으며, 예를 들어 딥러닝 구조는 CNN(Convolutional Neural Network), RNN(Recurrent Neural Network), DBN(Deep Belief Network) 등 심층신경망(DNN)으로 구성될 수 있다. 본 개시에 따른 딥러닝 구조는 공지된 다양한 구조를 이용할 수 있다. 예를 들어, 본 개시에 따른 딥러닝 구조 는 CNN(Convolutional Neural Network), RNN(Recurrent Neural Network), DBN(Deep Belief Network) 등일 수 있다. 한편, 인공신경망의 학습은 주어진 입력에 대하여 원하는 출력이 나오도록 노드간 연결선의 웨이트(weight)를 조정(필요한 경우 바이어스(bias) 값도 조정)함으로써 이루어질 수 있다. 또한, 인공신경망은 학습에 의해 웨이 트(weight) 값을 지속적으로 업데이트시킬 수 있다. 또한, 인공신경망의 학습에는 역전파(Back Propagation) 등 의 방법이 사용될 수 있다. 한편, 서버에는 머신 러닝으로 기학습된 인공신경망(Artificial Neural Network)이 탑재될 수 있다. 본 개시의 일 실시 예에 따른 서버는, 수신되는 음성 데이터, 사용자 데이터, 사용 패턴 정보를 입력 데이터로 하는 머신 러닝(machine learning) 기반의 음성 인식, 사용 패턴 인식을 수행할 수 있다. 프로세서는 인공신경망, 예를 들어, CNN(Convolutional Neural Network), RNN(Recurrent Neural Network), DBN(Deep Belief Network) 등 심층신경망(Deep Neural Network: DNN)을 포함될 수 있고, 심층신경망 을 학습할 수 있다. 또는, 서버는, 별도의 학습 모듈(미도시)을 구비할 수도 있다. 한편, 상기 프로세서는 설정에 따라 학습 후 인공신경망 구조로 업데이트시키도록 제어할 수 있다. 한편, 상기 프로세서는 공기조화기로부터 수신되는 사용자 데이터, 사용 패턴 정보에 기초하여 메모 리에 저장된 데이터들을 검색하여 가장 유사한 사용 패턴을 찾을 수 있다. 또한, 상기 프로세서는, 검색된 가장 유사한 사용 패턴에 대응하는 설정 정보를 공기조화기로 전송하도록 통신 인터페이스를 제어할 수 있다. 도 6은 본 개시의 일 실시예에 따른 공기조화기의 제어방법을 도시한 순서도이다. 도 6을 참조하면, 공기조화기는, 사용자의 조작 또는 예약 설정에 따라 운전을 시작한다(S610). 제어부 는, 제조사에 의해 설정된 초기값(디폴트 설정)으로 공기조화기를 제어한다. 공기조화기는, 제 조사에 의해 설정된 초기값(디폴트 설정)에 대응하여 동작한다(S630). 예를 들어, 공기조화기는, 제공 가 능한 냉방, 난방, 공기청정, 기타 기능 중 사용자가 선택한 기능에 대하여, 제조사에 의해 설정된 초기값(디폴 트 설정)에 따라 동작된다. 한편, 본 개시에 따른 공기조화기는, 사용자 맞춤형 기능을 제공할 수 있다. 예를 들어, 공기조화기 는, 사용자의 사용 패턴에 기반한 냉방 기능, 난방 기능, 공기청정 기능을 제공할 수 있다. 또한, 공기조화기는, 사용자의 사용 패턴에 기반한 취침 관련 기능을 제공할 수 있다. 예를 들어, 사용자 가 취침 운전 모드를 선택하면, 공기조화기는 시간 경과에 따라 설정온도를 조금씩 높게 변경하면서, 과냉 방으로 사용자가 잠에서 깨거나 수면의 질이 나빠지는 것을 방지할 수 있다. 취침 운전 모드 운전시, 사용자는 공기조화기 제품 오프(off) 시간을 설정할 수 있다. 공기조화기는 설정된 수면 로직(예를 들어, 취침 운전 모드)을 수행하다가 설정된 제품 오프 시간(예를 들어, 60분, 90분,120분)이 경과되면 자동으로 오프될 수 있다. 본 명세서에서 특별한 설명이 없으면, 공기조화기 제품 오프는, 공기조화기가 소정 운전 모드로 동작 하다가 해당 운전 모드가 종료되는 운전 오프와 공기조화기 제품 자체가 오프되는 것을 모두 포함하는 개 념일 수 있다. 취침 운전 모드 운전시, 사용자는 설정온도를 설정할 수 있다. 공기조화기는, 설정된 설정온도를 기준으로 냉방 또는 난방 운전을 수행하다가, 취침 운전 모드에 따라 설정온도를 가변할 수 있다. 사용자가 취침 운전 모 드와 관련하여 설정온도를 별도로 설정하지 않으면, 공기조화기는 현재의 설정온도를 기준으로 냉방 또는 난방 운전을 수행하다가, 수면 로직에 따라 설정온도를 가변할 수 있다. 인체는 동일한 온도 환경에 지속적으로 노출되면, 시간이 경과함에 따라 쾌적의 정도가 달라지게 된다. 또한, 인체가 일정한 온도가 지속적으로 유지되는 실내에 장시간 머무를 경우 실내 온도에 순응하게 되어 시간이 경과 함에 따라 한냉감과 불쾌감을 느끼게 된다. 따라서, 일정한 설정 온도로 유지되는 냉방 방식은, 시간이 경과함에 따라 사용자에게 점차적으로 불쾌감을 줄 수 있고, 과냉방 및 에너지 과소비의 원인이 될 수 있다. 그러므로, 온도 환경에 대한 인체 순응 특성을 고려하여, 시간 경과에 따라 설정온도를 단계적으로 상승시키는 취침 운전 모드로, 좋은 수면 환경을 제공할 수 있다. 인체 순응 특성에 개인차가 있으므로 사용자 데이터에 기 반하여 설정온도, 제품 오프 시점 등을 조절해줌으로써, 더 사용자에게 최적화된 수면 환경을 제공할 수 있다. 수면 로직도 설정값이 가변되는 가변 자동 운전 모드일 수 있다. 본 개시에 따른 수면 로직은, 사용자의 실제 공기조화기 사용 데이터에 기초하여, 설정값을 변경하는 자동 운전 모드(이하, 굿슬립 모드)를 포함할 수 있다. 공기조화기는 서버로 사용자 데이터를 전송한다(S630). 공기조화기는 이벤트 발생시 실시간으로 서버에 사용자 데이터를 전송할 수 있다. 또한, 공기조화기는 운전 중에 소정 주기(예를 들어, 몇분 단위)에 따라 서버로 사용자 데이터를 전송할 수 있다. 또한, 공기조화기는 제품 오프시에도 서버 로 사용자 데이터를 전송할 수 있다. 한편, 사용자 데이터는, 공기조화기에 대한 조작 입력 이벤트에 기초한 데이터를 포함할 수 있다. 사용자 데이터는, 공기조화기의 조작 데이터, 사용 이력 데이터 등을 포함할 수 있다. 사용자 데이터는, 공기조화 기를 온(on)시키거나 오프(off)시키는 입력, 소정 운전 모드를 요청하는 입력, 설정온도를 변경하는 입력, 소정 입력이 수신된 시점에 센서부의 센서에서 센싱된 데이터 중 적어도 하나를 포함할 수 있다. 예를 들 어, 공기조화기를 온/오프 시키는 조작 입력, 공기조화기의 냉방 운전 모드, 난방 운전 모드를 온/오 프시키는 조작 입력, 설정온도, 설정습도 등을 설정하는 입력, 취침 운전 모드, 자동 온/오프 기능 등 소정 기 능을 활성화시키거나 비활성화시키는 입력 등을 포함할 수 있다. 공기조화기는, 입력 인터페이스를 통하여 사용자의 조작 입력을 수신할 수 있다. 통신부는, 서 버로 조작 입력에 기초하는 사용자 데이터를 전송할 수 있다. 한편, 사용자 데이터는, 사용자 및/또는 공기조화기의 식별 정보를 더 포함할 수 있다. 서버는, 사용 자 데이터를 공기조화기의 식별 정보에 대응하여 관리할 수 있다. 즉, 서버는, 사용자 데이터를 공기 조화기 별로 매핑시켜 저장할 수 있다. 실시 예에 따라서, 사용자 데이터를 사용자 별로 매핑시켜 저장할 수 있다. 예를 들어, 복수의 가족 구성원 중 공기조화기를 조작한 사용자를 식별할 수 있는 경우에, 식별된 사용자 별로도 사용자 데이터를 저장할 수 있다. 예를 들어, 가전 관리 애플리케이션에서 해당 공기조화기를 조작하는 입력을 수행한 계정에 기초하여, 사 용자를 식별할 수 있다. 또한, 공기조화기가 카메라를 구비하는 경우에 영상 기반으로 공기조화기를 조작한 사용자가 식별될 수 있다. 한편, 공기조화기는, 입력 인터페이스를 통하여 사용자 맞춤 변경 기능 설정 입력을 수신할 수 있다 (S640). 예를 들어, 사용자 맞춤 변경 기능 설정 입력은, 굿슬립 모드를 활성화시키는 입력일 수 있다. 사용자 맞춤 변경 기능 설정 입력 수신(S640)에 따라, 공기조화기는, 서버에 사용자 맞춤 변경 기능 을 요청할 수 있다(S650). 실시 예에 따라서, 공기조화기는, 자동으로 서버에 사용자 맞춤 변경 기능을 요청할 수 있다(S650). 공기조화기 사용 시 발생하는 사용자의 이벤트 데이터는 실시간으로 서버에 전송되어 적재되고, 서버 는 사용자의 이벤트 데이터를 저장하고, 사용 목적에 따라 군집화 및 분석을 수행할 수 있다. 서버는 이후 분석된 결과를 바탕으로, 사용자가 다시 공기조화기를 사용할 때 필요한 동작 파라미터 를 공기조화기 제품에 제공할 수 있다. 공기조화기는 서버로부터 전달받은 파라미터 변수를 바 탕으로 개별 고객의 환경에 맞는 최적화된 기능을 제공할 수 있다. 서버가 수집된 데이터를 군집화하여 개별 고객의 사용 환경에 맞는 최적화된 공조 기능을 구현함으로써 사 용자 맞춤 경험을 제공한다. 서버는 군집화 알고리즘으로 사용자의 이벤트 데이터를 분석하여 가장 비슷한 특성을 가진 그룹으로 분류 할 수 있다. 또한, 서버는, 군집화 분석 결과에 기초하여, 특정구간(이벤트)에 대응하여 제공 가능한 복수 개의 로직 중 한 로직을 사용자 맞춤 동작 파라미터로 결정할 수 있다. 예를 들어, 서버는, 사용자 데이터 중 야간 시간대의 설정온도 변경 조작 패턴을 복수의 그룹 중 가장 유 사도가 높은 그룹으로 분류할 수 있다. 서버는, 분류된 그룹에 대응하여 설정된 설정온도 변경 패턴을 설 정온도에 대한 맞춤 동작 파라미터로 판별할 수 있다. 또한, 서버는, 사용자 데이터 중 제품 오프 시간 데이터에 기초하여, 공기조화기가 소정 운전 모드로 동작하고 자동으로 오프될 시간을 결정할 수 있다. 서버가 결정한 시간은 제품 오프 시간에 대한 맞춤 동 작 파라미터일 수 있다. 또한, 서버는, 사용자 데이터 중 소정 기능, 운전 모드를 동작시키는 이벤트 데이터에 기초하여, 공기조화 기가 소정 기능, 운전 모드를 자동으로 수행할 시간을 결정할 수 있다. 서버가 결정한 시간은 기능 또는 운전 모드의 자동 시작 시간에 대한 맞춤 동작 파라미터일 수 있다. 사용자 데이터는, 공기조화기에 취침 관련 기능이 설정된 상태에서, 획득되는 데이터일 수 있다. 공기조화 기에 취침 관련 기능이 설정된 상태에서, 획득된 데이터는 굿슬립 모드의 사용자 맞춤 동작 파라미터를 도 출하는데 활용될 수 있다. 서버는, 사용자 데이터에 기반하여, 요청된 사용자 맞춤 변경 기능에 대응하는 사용자 맞춤 동작 파라미터 를 판별할 수 있다. 예를 들어, 굿슬립 모드의 사용자 맞춤 동작 파라미터는, 설정온도의 상승/하강 여부, 설정 온도의 변경 시점, 제품 오프 시점 등 사용자 맞춤으로 설정 가능한 항목과, 각 항목에 대한 설정값 정보를 포 함할 수 있다. 공기조화기는, 통신부를 통하여, 서버로부터 설정 파라미터를 수신할 수 있다(S660). 제어부는, 수신된 사용자 맞춤 설정 파라미터를 적용할 수 있다(S670). 예를 들어, 사용자 맞춤 동작 파라 미터에, 설정온도, 제품 오프 시점 관련 정보가 포함되어 있으면, 굿슬립 모드의 설정온도, 제품 오프 시점 항 목의 설정값을 수신된 정보에 기초하여 변경할 수 있다(S670). 이후, 공기조화기는 변경된 설정이 적용된 대응 동작을 수행할 수 있다(S680). 예를 들어, 공기조화기 는 수신된 사용자 맞춤 설정 파라미터에 대응하여 변경된 설정이 적용된 굿슬립 모드로 동작할 수 있다. 종래에는 공기조화기가 제공하는 여러 기능들이 제조사에서 정의한 대로 동작하였다. 따라서 제공되는 기능 중 일부는 고객의 편리함보단 불쾌함(추위, 더위)을 가중 시키는 기능이 있을 수 있다. 이러한 문제점을 해결하기 위해, 본 개시는 사용자의 이벤트 데이터를 활용하여 사용자 맞춤형 기능 조절을 가 능하게 함으로써 사용자 경험을 향상시킨다. 즉, 제조사에 의해 결정된 기능을 사용자의 공기조화기 사용 패턴 과 환경에 맞게 변경하여 적용함으로써 사용자의 경험을 향상시킨다. 본 개시에 따르면, 사용자는 공기조화기 사용시 반복되는 조작을 피하고 쾌적한 환경을 즐길 수 있어 공기 조화기 사용에 있어 편리성이 증대된다. 또한, 맞춤형 기능 제공으로 공기조화기 사용시 불필요한 에너지 낭비를 줄일 수 있으며 이를 통해 전반적 인 에너지 효율성을 향상시킬 수 있다. 도 7은 본 개시의 일 실시예에 따른 서버의 제어방법을 도시한 순서도이다. 도 7을 참조하면, 서버가 공기조회기로부터 사용자 데이터를 수신한다(S710). 서버는, 통신 인 터페이스를 통하여 공기조화기로부터 사용자 데이터를 수신할 수 있다. 또한, 서버는, 통신 인터페이스를 통하여 이동 단말기로부터 사용자 데이터를 수신할 수 있다. 예를 들어, 사용자는 이동 단말기에서 가전 관리 애플리케이션을 실행시키고, 공기조화기를 조작할 수 있다. 따라서, 공기조화기를 동작시키는 사용자 데이터는 사용자의 이동 단말기로부터도 획득될 수 있다. 한편, 서버는, 수신된 사용자 데이터를 저장한다(S720). 수신된 사용자 데이터는 메모리에 저장될 수 있다. 한편, 프로세서는, 메모리에 저장된 사용자 데이터의 개수가 기준치 이상이 되면, 저장된 사용자 데 이터를 군집화할 수 있다(S730). 메모리에 특정 N일 동안 M개 이상의 데이터가 저장되면, 프로세서는, 군집화 알고리즘으로 데이터를 기능의 목적에 맞게 분류할 수 있다. 예를 들어, 프로세서 는, 야간 시간대의 사용자 데이터 중에서 설정온도 변경, 공기조화기 제품 오프, 취침 기능 활성화/ 비활성화 여부, 취침 기능과 관련있는 데이터를 추출하고, 추출된 데이터를 항목별로 별도로 군집화하거나 복수 의 항목을 조합하여 군집화할 수 있다. 또한, 프로세서는, 군집화 결과에 대응하는 설정 파라미터를 도출할 수 있다(S740). 프로세서는, 개 별 사용자의 환경과 선호도에 따른 맞춤형 기능 제공을 위한 동작 파라미터 변수 값을 도출한다. 예를 들어, 사 용자 데이터가 야간 시간대에 공기조화기를 자주 끄거나 설정온도를 높이는 사용자 그룹으로 분류되면, 프 로세서는, 해당 그룹에 최적화된 설정온도 파라미터 변수 값, 제품 오프 시간 파라미터 변수 값을 도출할 수 있다. 한편, 공기조화기 또는 이동 단말기로부터 사용자 맞춤 변경 기능에 대한 요청이 수신되면(S750), 서 버는, 사용자 데이터 분석 결과에 기초한 사용자 맞춤 동작 파라미터를 공기조화기로 전송할 수 있다 (S770). 서버는, 사용자 데이터 분석 결과 중 요청된 기능에 대응하는 분석 결과를 응답할 수 있다(S760). 서버 는, 요청된 기능에 대응하는 사용자 맞춤 동작 파라미터를 공기조화기로 전송할 수 있다(S770). 서버는, 공기조화기 사용 시 발생하는 사용자의 이벤트 데이터를 분석하고 최적화된 파라미터를 도출 하여(S730, S740), 최적화된 파라미터를 공기조화기로 전달할 수 있다(S770). 이를 통해 고객에게 최적화 된 기능을 제공할 수 있다. 사용자는 환경에 맞는 공기조화기 기능을 제공 받음으로써, 반복적인 조작 없이 편 안한 환경에서 공기조화기를 사용할 수 있다. 프로세서는, 사용자 데이터를 군집화 알고리즘으로 분류하고 분석할 수 있다(S730). 또한, 프로세서 는, 군집화 결과에 대응하는 설정 파라미터(사용자 맞춤 동작 파라미터)를 판별하고(S74), 통신 인터페이스 가 상기 판별된 설정 파라미터를 공기조화기로 전송하도록 제어할 수 있다(S770). 한편, 서버는, 사용자 데이터 분석 결과, 사용자 데이터가 기설정된 야간 시간대에 소정 페인 포인트(Pain point) 패턴을 가지면, 해당 페인 포인트 패턴의 재발을 방지하는 방향으로 사용자 맞춤 동작 파라미터를 도출 할 수 있다. 기설정된 야간 시간대에 공기조화기를 조작하거나 취침 운전 모드 상태에서 공기조화기를 조작하는 패턴 중 적어도 일부를 페인 포인트(Pain point) 패턴으로 볼 수 있다. 사용자 맞춤 동작 파라미터는, 사용자의 페인 포인트 패턴을 방지하거나 최소화할 수 있는 동작 파라미터를 포 함할 수 있다. 예를 들어, 사용자 맞춤 동작 파라미터는, 사용자의 조작 패턴과 동일하거나 가장 유사한 그룹에 설정된 하나 이상의 동작 파라미터일 수 있다. 이러한 사용자 맞춤 동작 파라미터가 공기조화기의 취침 운전 모드 설정에 적용되면, 이후에 사용자가 잠 에서 깨서 공기조화기를 조작할 필요가 없어져, 수면의 질이 개선될 수 있다. 한편, 서버는, 자동으로 취침 운전 모드의 설정 파라미터가 변경되는 굿슬립 모드를 사용하지 않는 사용자 에게 굿슬립 모드의 사용을 선제적으로 추천할 수 있다. 특히, 서버는, 사용자 데이터 분석 결과, 사용자 데이터가 기설정된 야간 시간대에 소정 페인 포인트(Pain point) 패턴을 가지는 사용자에게 굿슬립 모드의 사용 을 추천할 수 있다. 서버는, 사용자 데이터 분석 결과, 사용자 데이터가 기설정된 야간 시간대에 소정 페인 포인트(Pain point) 패턴을 가지고, 자동으로 취침 운전 모드의 설정 파라미터가 변경되는 굿슬립 모드가 활 성화되지 않은 상태인 경우에, 도출된 사용자 맞춤 동작 파라미터 및 굿슬립 모드의 사용을 추천할 수 있다. 예를 들어, 서버는 군집화 결과에 대응하는 설정 파라미터(사용자 맞춤 동작 파라미터)와 관련된 추천 정 보를 공기조화기의 관리 애플리케이션(ex, 씽큐 앱)에 등록된 이동 단말기로 전송할 수 있다. 사용자는 공기조화기가 등록된 가전 관리 애플리케이션을 실행하여, 굿슬립 모드 추천 정보를 확인할 수 있다. 사용자는 추천 정보를 포함하는 유저 인터페이스 화면을 통하여 추천 정보에 대하여 승낙하거나 설정 메 뉴 항목에서 굿슬립 모드를 활성화시키는 입력으로 굿슬립 모드를 활성화시킬 수 있다. 서버는, 이동 단말기로부터 추천 정보에 대한 승낙 입력 또는 굿슬립 모드의 활성화 입력이 수신되면, 군집화 결과에 대응하는 설정 파라미터를 공기조화기로 전송할 수 있다. 도 8은 본 개시의 일 실시예에 따른 공기조화기와 서버의 제어방법을 도시한 순서도로, 공기조화기와 서버 사이 의 신호 흐름이 예시된다. 사용자가 공기조화기를 작동시키면 초기에는 제조사에서 설정한 값을 바탕으로 공기조화기의 기능 동 작이 수행된다(S810). 공기조화기는 사용자 데이터를 서버로 전송한다(S820). 공기조화기는 고 객이 공기조화기를 사용 시 발생하는 이벤트 데이터를 실시간 또는 주기적으로 서버로 전송할 수 있 다. 서버는, 수신되는 사용자 데이터를 저장한다(S830). 특정 N일 동안 M개 이상의 데이터가 저장되면, 서버 는, 그 데이터를 기반으로 군집화 알고리즘을 적용하고, 데이터를 기능의 목적에 맞게 분류한다(S840). 서 버는, 사용자 경험에 의해 발생한 데이터를 기반으로 목적에 맞게 군집화를 수행할 수 있다. 서버는, 군집된 결과를 기능의 목적에 맞게 다시 공기조화기 제품으로 다시 전달할 수 있다. 공기조 화기 운전 시, 서버에 소정 운전 모드애 대한 요청이 있으면 그 모드에 맞는 운전 조건을 공기조화기 에 전달할 수 있다. 서버는, 분석 결과를 바탕으로, 개별 사용자의 환경과 선호도에 따른 맞춤형 기능 제공을 위한 동작 파라 미터 변수 값을 도출하여 저장한다(S850). 한편, 맞춤형 기능 요청이 있으면(S860), 서버는 해당 공기조화기 및 요청된 맞춤형 기능에 대응하는 최적화된 동작 파라미터를 추출하고(S870), 서버는 최적화된 동작 파라미터를 공기조화기에 전송한다 (S880). 공기조화기는 수신된 동작 파라미터의 변수를 요청한 맞춤형 기능에 적용한다(S890). 공기조화기는 새로 적용된 파라미터 변수 값을 활용하여 고객에게 최적화된 기능을 제공할 수 있다. 도 9 내지 도 11은 본 개시의 실시예에 따른 공기조화기와 서버의 제어방법에 관한 설명에 참조되는 도면이다. 도 9는 사용자 맞춤형 자동 취침 운전 모드인 굿슬립 모드의 고객 경험 시나리오를 도시한 것이다. 굿슬립 모드는 씽큐 앱 콘텐츠로 제공될 수 있다. 굿슬립 모드는 사용자의 취침 습관에 맞게 설정온도를 자동으로 조정해주는 수면모드일 수 있다. 도 9를 참조하면, 고객은 기존의 고정된 수면 로직에 따른 취침 기능을 사용할 수 있다 한편, N일 동안 수면시 공기조화기를 오프시키거나 설정온도를 변경하는 등의 사용자 데이터가 서버 에 수집될 수 있다. 서버는 수집된 사용자 데이터를 분석하여 페인 포인트를 가진 고객을 분류할 수 있다. 한편, 기존 고 객의 취침 운전 모드 관련 데이터를 선분류하여 서버의 고객 분류에 반영할 수 있다. 기존 고객의 취 침 운전 모드 관련 데이터는 제조사가 오프라인에서 분석하여 소정 페인 포인트를 가진 고객 및 유형을 분류할 수 있다. 또한, 기존 고객의 취침 운전 모드 관련 데이터로 서버의 인공신경망이 학습될 수 있다. 또한, 서버는 수집된 사용자 데이터를 분석하여 페인 포인트를 가지는 고객을 위한 굿슬립 모드의 동작 파 라미터를 판별할 수 있다. 한편, 사용자는 씽큐 앱을 통하여 굿슬립 모드를 활성화할 수 있다. 또한, 굿슬립 모드 설정 여부에 따라 씽큐앱이 제공하는 콘텐츠가 달라질 수 있다.서버는 굿슬립 모드를 활성화시킨 고객 중에서 페인 포인트가 있는 고객의 공기조화기에게 는 맞춤 파라미터를 전송할 수 있다. 공기조화기는 수신된 맞춤 파라미터를 적용할 수 있다. 이에 따라, 사용자는 최적화된 취침 기능을 사용하면, 서버에서 제공해준 조건으로 동작하는 취침모드를 경험할 수 있다. 굿슬립 모드를 활성화시킨 고객 중에서 페인 포인트가 없는 고객은 기존의 고정된 수면 로직에 불편함이 없는 것이기 때문에, 서버는 파라미터를 별도로 전송하지 않는다. 굿슬립 모드를 활성화 시키지 않은 고객 중에서 페인 포인트가 있 고객에게는 굿슬립 모드를 제안할 수 있 다. 사용자는 이동 단말기로 씽큐 앱을 실행시켜 제안을 확인할 수 있다. 한편, 서버는, 이동 단말기 및/또는 공기조화기로부터 수신되는 사용자 데이터를 저장하는 제1 서버, 및, 다수의 사용자 데이터를 학습하여, 소정 페인 포인트(Pain point) 패턴에 대응하는 설정 파라미 터를 출력하는 제2 서버를 포함할 수 있다. 제2 서버는, 제1 서버로부터 사용자 데이터가 수신되면, 사용자 데이터 분석하여 페인 포인트(Pain point) 패턴을 방지하는 설정 파라미터를 도출할 수 있다. 또한, 제2 서버는, 수신된 사용자 데이터에 기 초하여 도출된 설정 파라미터 정보를 공기조화기로 전송할 수 있다. 다른 실시 예에서, 공기조화기의 사용자 데이터는 직접 제2 서버로 전송될 수 있다. 도 10을 참조하면, 서버는, 이동 단말기로부터 수신되는 사용자 데이터를 저장하는 제1 서버, 및, 공기조화기로부터 수신되는 사용자 데이터를 저장하는 제2 서버를 포함할 수 있다. 제1 서버는 이동 단말기로부터 수신되는 사용자 데이터를 제2 서버로 전달할 수 있다. 제2 서버는 제1 서버 및, 공기조화기로부터 수신되는 사용자 데이터를 분석하고, 설정 파라미터 를 도출할 수 있다. 또한, 제2 서버는, 수신된 사용자 데이터에 기초하여 도출된 설정 파라미터 정보를 공 기조화기로 전송할 수 있다. 한편, 제2 서버는 도출된 설정 파라미터 정보를 제1 서버에 전달하고, 제1 서버는 가전 관리 애 플리케이션 또는 다른 메시지 서비스를 통하여, 사용자에게 도출된 설정 파라미터 정보 및/또는 굿슬립 모드의 사용을 안내하는 알림을 발송할 수 있다. 도 11은 본 개시의 일 실시 예에 따른 굿슬립모드 서버 상세 동작 흐름을 도시한 도면이다. 도 11을 참조하면, 서버는 3개의 서버(301, 302, 303)를 포함한다. 가전 서비스 서버는 상술한 제2 서버의 역할을 수행할 수 있다. 푸시(Push) 서버는 사용자에게 푸시 알림을 제공하는 서버이다. 푸시 서버의 알람 기능은 제1 서버 또는 제2 서버에서 제공되는 것도 가능하다. 씽큐 서버 또는 클라우드릿(Cloudlet)은 상술한 제1 서버의 동작을 수행할 수 있다. 클라우드릿은 제2 서 버의 전단에서 데이터를 사전 처리함으로써, 데이터의 전송량을 감소시키고 데이터 전송 속도를 상승시킬 수 있다. 다른 실시 예에서는 서버는 씽큐 서버와 클라우드릿(Cloudlet)을 각각 구비할 수 있다. 이 경우에, 씽큐 서버는 제1 서버의 기능 중에서 가전 관리 애플리케이션을 위한 기능을 수행하고, 클라우드릿이 제2 서버 를 위한 데이터 전처리 기능을 수행하는 것도 가능하다. 고객의 공기조화기 사용 데이터는, 공기조화기 제품과 씽큐 앱을 통하여 획득될 수 있다. 예를 들어, 공기조화기 제품의 고객 사용 데이터(A)는, 취침예약 남은 시간 데이터, 설정온도 데이터, 실 내온도 데이터, 운전 온/오프 데이터 등을 포함할 수 있다. 씽큐 앱의 고객 사용 데이터(B)는, 굿슬립 모드 온/오프 데이터, 취침예약 남은 시간 데이터, 운전 온/오 프 데이터 등을 포함할 수 있다. 공기조화기 제품의 고객 사용 데이터(A)와 씽큐 앱의 고객 사용 데이터(B)는, 제1 서버에 전송 될 수 있다.제1 서버는 공기조화기 제품의 고객 사용 데이터(A)와 씽큐 앱의 고객 사용 데이터(B)에서 굿슬 립 모드와 관련된 데이터를 추출할 수 있다(C). 예를 들어, 제1 서버는 취침예약 남은 시간 데이터, 설정 온도 데이터, 실내온도 데이터, 운전 온/오프 데이터, 굿슬립 모드 온/오프 데이터를 추출할 수 있다. 제1 서버는 추출된 데이터를 가공할 수 있다(D). 예를 들어, 제1 서버의 가공 데이터는, 초기설정온 도, 초기예약 설정시간, 제품 Off 시점 취침예약 남은 시간, 제품 Off 시점 취침예약 실내 온도, 재사용 시점의 실내온도, 동작 중 설정온도를 포함할 수 있다. 한편, 제1 서버는 사용자 입력에 의한 데이터 변경인지를 판단하고(E), 사용자 입력에 의한 사용자 데이터 를 제2 서버로 전달한다. 제2 서버는 전달받은 데이터를 가공한다(F). 예를 들어, 제2 서버의 가공 데이터는, 아래와 데이터를 포함할 수 있다. 제품 Off 시점 취침예약 사용시간 = 초기예약 설정시간 - 제품 Off 시점 취침예약 남은 시간 동작 중 설정온도 변경정보 = 초기설정온도 - 동작 중 설정온도 자동On 실내온도 = 재사용 시점의 실내온도 - b 제2 서버는 굿슬립 모드 사용 데이터를 적재할 수 있다(G). 굿슬립 모드 사용 데이터는 가공된 데이터 및 학습 데이터를 포함할 수 있다. 예를 들어, 가공된 데이터는, 초기설정온도, 초기예약 설정시간, 자동On 실내온 도, 제품 Off 시점 취침예약 사용시간, 동작 중 설정온도 변경정보, 제품 Off 시점 취침예약 실내 온도를 포함 할 수 있다. 한편, 제1 서버 또는 제2 서버는 실시간 취침예약 사용여부를 판단할 수 있다(H). 예를 들어, 제1 서 버 또는 제2 서버는 취침예약 사용시 통잠모드 동작 설정 정보와 굿슬립 모드 설정 정보를 확인할 수 있다. 한편, 제2 서버는 데이터를 학습할 수 있다(I). 제2 서버는 초기조건 학습을 수행할 수 있다. 초기조 건 학습은, 가장 많이 사용된 초기 설정온도, 가장 많이 사용된 초기 예약 설정시간 등을 포함할 수 있다. 제2 서버는 페인 포인트별 설정조건 학습을 수행할 수 있다. 페인 포인트별 설정조건 학습은, 제품 오프, 재사 용, 동작 중 설정 변경 등을 포함할 수 있다. 한편, 제2 서버는 굿슬립 모드 학습결과 데이터를 적재할 수 있다(J). 제2 서버는 가공된 데이터 및 학습된 데이터를 적재할 수 있다. 학습결과 데이터는, 초기설정온도, 초기예약 설정시간, 자동On 실내온도, 제 품 Off 시점 취침예약 사용시간, 동작 중 설정온도 변경정보, 제품 Off 시점 취침예약 실내 온도를 포함할 수 있다. 제1 서버는 페인 포인트별 설정 정보를 반영할 수 있다(K). 예를 들어, 초기설정 맞춤 동작 설정, 페인 포인트별 맞춤 동작 설정 정보 요청하고, 설정 정보를 공기조화기로 전달할 수 있다. 공기조화기는 초기 설정을 반영할 수 있다(L). 초기 설정에는 초기 설정온도, 초기 취침예약 설정시간을 포함할 수 있다. 또한, 공기조화기는 페인 포인트별 맞춤 동작 설정을 반영할 수 있다(M). 페인 포인트별 맞춤 동작 설정에 는 제품 오프, 재사용, 동작중 설정변경을 포함할 수 있다. 한편, 제2 서버는 페인 포인트별 맞춤 설정 푸시 알림 전송 여부를 판단할 수 있다(N). 제2 서버는 각 페인 포인트별 설정조건이 변경된 경우에 푸시 알림을 전송하도록 판단할 수 있다. 푸시 서버는 맞춤 설정 푸시 알림을 수행할 수 있다(O). 푸시 서버는 씽큐 앱을 통하여 맞춤 설 정 푸시 알림을 제공할 수 있다(P). 한편, 푸시 서버는 굿슬립 모드를 사용하지 않는 사용자에게 사용 추천 푸시 알림을 수행할 수 있다(R). 푸시 서버는 씽큐 앱을 통하여 굿슬립 모드 사용 추천 푸시 알림을 제공할 수 있다(S). 이상에서는 본 개시의 바람직한 실시 예에 대하여 도시하고 설명하였지만, 본 개시는 상술한 특정의 실시 예에"}
{"patent_id": "10-2024-0060597", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "한정되지 아니하며, 특허청구범위에서 청구하는 본 개시의 요지를 벗어남이 없이 당해 발명이 속하는 기술분야 에서 통상의 지식을 가진 자에 의해 다양한 변형실시가 가능하다.부호의 설명 100: 공기조화기 200: 단말 300: 서버"}
{"patent_id": "10-2024-0060597", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시 예에 따른 공기조화기의 구성을 예시하는 도면이다. 도 2는 도 1의 실외기와 실내기의 개략도이다. 도 3은 도 1의 공기조화기의 간략한 내부 블록도이다. 도 4는 본 개시의 일 실시 예에 따른 홈 어플라이언스 시스템 구성도이다. 도 5는 본 개시의 일 실시 예에 따른 서버의 주요 구성에 대한 블록도이다. 도 6은 본 개시의 일 실시예에 따른 공기조화기의 제어방법을 도시한 순서도이다. 도 7은 본 개시의 일 실시예에 따른 서버의 제어방법을 도시한 순서도이다. 도 8은 본 개시의 일 실시예에 따른 공기조화기와 서버의 제어방법을 도시한 순서도이다. 도 9 내지 도 11은 본 개시의 실시예에 따른 공기조화기와 서버의 제어방법에 관한 설명에 참조되는 도면이다."}
