{"patent_id": "10-2019-0124288", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0042187", "출원번호": "10-2019-0124288", "발명의 명칭": "헬스 케어 시스템 및 이의 동작 방법", "출원인": "신봉근", "발명자": "신봉근"}}
{"patent_id": "10-2019-0124288", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "환자의 사용자 단말로부터 치료 부스 요청을 수신하는 단계;상기 환자의 주변에 위치한 치료 부스에 대한 정보를 상기 사용자 단말로 전송하고, 상기 사용자 단말로부터 상기 환자에 의해 선택된 치료 부스에 대한 정보를 포함하는 치료 예약 요청을 수신하는 단계;상기 수신된 치료 예약 요청을 기초로 상기 환자의 치료를 예약하는 단계;상기 환자를 위한 치료 정보에 따라 상기 환자에 대한 상기 치료가 상기 선택된 치료 부스에서 완료된 경우, 상기 사용자 단말로부터 상기 치료에 대한 피드백 정보를 수신하는 단계; 및상기 수신된 피드백 정보를 치료 기관 단말로 전송하는 단계를 포함하는,헬스 케어 시스템의 동작 방법."}
{"patent_id": "10-2019-0124288", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 치료가 완료된 경우, 상기 선택된 치료 부스로부터 치료 완료 정보를 수신하는 단계; 및상기 치료 완료 정보를 수신한 경우, 상기 사용자 단말에게 상기 치료에 대한 피드백 요청을 전송하는 단계;를 더 포함하는,헬스 케어 시스템의 동작 방법."}
{"patent_id": "10-2019-0124288", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 수신된 피드백 정보를 상기 치료 기관 단말로 전송한 후, 상기 치료 기관 단말로부터 상기 환자를 위한 제2 치료 정보를 수신하는 단계를 더 포함하고,상기 제2 치료 정보는 상기 치료 정보와 동일하거나 다른,헬스 케어 시스템의 동작 방법."}
{"patent_id": "10-2019-0124288", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 선택된 치료 부스에는 인공 지능 로봇이 포함되고,상기 인공 지능 로봇은 상기 선택된 치료 부스에서 상기 수신된 치료 정보에 따라 상기 환자를 치료하는, 헬스 케어 시스템의 동작 방법.공개특허 10-2021-0042187-2-청구항 5 제1항에 있어서,상기 치료 정보는 상기 환자의 통증 부위에 대한 정보, 상기 환자의 치료 부위에 대한 정보, 및 치료 방법 정보를 포함하는,헬스 케어 시스템의 동작 방법."}
{"patent_id": "10-2019-0124288", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 치료를 예약한 경우, 예약 정보를 생성하고 상기 사용자 단말로 상기 생성된 예약 정보를 전송하는 단계를 더 포함하는,헬스 케어 시스템의 동작 방법."}
{"patent_id": "10-2019-0124288", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 치료를 예약한 경우, 상기 선택된 치료 부스의 식별 정보, 상기 치료의 예약 일시 정보, 및 상기 환자의식별 정보를 기초로 일회용 방문 코드 정보를 생성하는 단계;상기 선택된 치료 부스의 식별 정보, 상기 치료의 예약 일시 정보, 및 상기 환자의 식별 정보를 서로 맵핑하여맵핑 테이블에 기록하고, 상기 생성된 일회용 방문 코드 정보를 상기 사용자 단말로 전송하는 단계; 및상기 선택된 치료 부스로부터 상기 선택된 치료 부스가 상기 사용자 단말의 방문 코드를 읽어 획득된 정보 및출입 인증 요청을 수신하는 경우, 상기 획득된 정보가 상기 맵핑 테이블에 있는지 여부 및 상기 출입 인증 요청의 시점과 상기 예약 일시 정보와 매칭되는지 여부를 체크하는 단계; 및상기 체크 결과를 기초로 상기 환자의 출입을 인증하는 단계 를 더 포함하는, 헬스 케어 시스템의 동작 방법."}
{"patent_id": "10-2019-0124288", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "사용자 단말; 및상기 사용자 단말로부터 치료 부스 요청을 수신하고, 환자의 주변에 위치한 치료 부스에 대한 정보를 상기 사용자 단말로 전송하며, 상기 사용자 단말로부터 상기 환자에 의해 선택된 치료 부스에 대한 정보를 포함하는 치료예약 요청을 수신하고, 상기 수신된 치료 예약 요청을 기초로 상기 환자의 치료를 예약하고, 상기 선택된 치료부스에서 상기 환자를 위한 치료 정보에 따라 상기 환자에 대한 상기 치료가 완료된 경우, 상기 사용자 단말로부터 상기 치료에 대한 피드백 정보를 수신하고, 상기 수신된 피드백 정보를 치료 기관 단말로 전송하는 헬스케어 서버를 포함하는,헬스 케어 시스템."}
{"patent_id": "10-2019-0124288", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,공개특허 10-2021-0042187-3-상기 헬스 케어 서버는,상기 치료가 완료된 경우, 상기 선택된 치료 부스로부터 치료 완료 정보를 수신하고, 상기 치료 완료 정보를 수신한 경우, 상기 사용자 단말에게 상기 치료에 대한 피드백 요청을 전송하는,헬스 케어 시스템."}
{"patent_id": "10-2019-0124288", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에 있어서,상기 헬스 케어 서버는 상기 수신된 피드백 정보를 상기 치료 기관 단말로 전송한 후 상기 치료 기관 단말로부터 상기 환자를 위한 제2 치료 정보를 수신하고,상기 제2 치료 정보는 상기 치료 정보와 동일하거나 다른,헬스 케어 시스템."}
{"patent_id": "10-2019-0124288", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제8항에 있어서,상기 선택된 치료 부스에는 인공 지능 로봇이 포함되고,상기 인공 지능 로봇은 상기 선택된 치료 부스에서 상기 수신된 치료 정보에 따라 상기 환자를 치료하는, 헬스 케어 시스템."}
{"patent_id": "10-2019-0124288", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제8항에 있어서,상기 치료 정보는 상기 환자의 통증 부위에 대한 정보, 상기 환자의 치료 부위에 대한 정보, 및 치료 방법 정보를 포함하는,헬스 케어 시스템."}
{"patent_id": "10-2019-0124288", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제8항에 있어서,상기 헬스 케어 서버는 상기 환자의 치료를 예약한 경우, 예약 정보를 생성하고 상기 사용자 단말로 상기 생성된 예약 정보를 전송하는,헬스 케어 시스템."}
{"patent_id": "10-2019-0124288", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제8항에 있어서,상기 헬스 케어 서버는,상기 환자의 치료를 예약한 경우, 상기 선택된 치료 부스의 식별 정보, 상기 치료의 예약 일시 정보, 및 상기환자의 식별 정보를 기초로 일회용 방문 코드 정보를 생성하고, 상기 선택된 치료 부스의 식별 정보, 상기 치료의 예약 일시 정보, 및 상기 환자의 식별 정보를 서로 맵핑하여 맵핑 테이블에 기록하며, 상기 생성된 일회용방문 코드 정보를 상기 사용자 단말로 전송하고, 상기 선택된 치료 부스로부터 상기 선택된 치료 부스가 상기공개특허 10-2021-0042187-4-사용자 단말의 방문 코드를 읽어 획득된 정보 및 출입 인증 요청을 수신하는 경우, 상기 획득된 정보가 상기 맵핑 테이블에 있는지 여부 및 상기 출입 인증 요청의 시점과 상기 예약 일시 정보와 매칭되는지 여부를체크하고, 상기 체크 결과를 기초로 상기 환자의 출입을 인증하는,헬스 케어 시스템."}
{"patent_id": "10-2019-0124288", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "헬스 케어 시스템이 개시된다. 일 실시예는 환자의 사용자 단말로부터 치료 부스 요청을 수신하고, 상기 환자의 주변에 위치한 치료 부스에 대한 정보를 상기 사용자 단말로 전송하며, 상기 사용자 단말로부터 상기 환자에 의 해 선택된 치료 부스에 대한 정보를 포함하는 치료 예약 요청을 수신하고, 상기 수신된 치료 예약 요청을 기초로 상기 환자의 치료를 예약하고, 상기 환자를 위한 치료 정보에 따라 상기 환자에 대한 상기 치료가 상기 선택된 치료 부스에서 완료된 경우, 상기 사용자 단말로부터 상기 치료에 대한 피드백 정보를 수신하고, 상기 수신된 피 드백 정보를 상기 치료 기관 단말로 전송한다."}
{"patent_id": "10-2019-0124288", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "아래 실시예들은 헬스 케어 시스템에 관한 것이다."}
{"patent_id": "10-2019-0124288", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "환자는 의사로부터 치료를 받기 위해선 병원에 방문한다. 하지만, 환자와 멀리 떨어진 곳에 병원이 위치하면 환자는 병원에 방문하기 힘들다. 그리고 수명이 연장되고 고령사회로 접어들면서 재활과 통증치료관련 전문인 력이 부족한 실태이다. 재활 및 통증치료에 대한 새로운 접근이 필요한 상황이다. 관련 선행기술로, 한국 공개특허공보 제10-2013-0051911호(발명의 명칭: 헬스 케어 서비스 제공 장치 및 방법, 출원인: 삼성전자 주식회사)가 있다. 공개특허공보에는 적어도 하나 이상의 센서들로부터 센서 데이터를 이용 하여 헬스 데이터를 산출하는 과정, 상기 헬스 데이터를 미리 정해진 헬스 서비스에 따라 적어도 하나 이상의 액추에이터들 중 해당 액추에이터에 반영하기 위한 액추에이터 제어 신호로 가공하는 과정, 및 상기 해당 액추 에이터에 상기 액추에이터 제어 신호를 전달하는 과정을 포함하는 헬스 케어 서비스 제공 방법이 개시된다."}
{"patent_id": "10-2019-0124288", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 측에 따른 헬스 케어 시스템의 동작 방법은 환자의 사용자 단말로부터 치료 부스 요청을 수신하는 단계; 상 기 환자의 주변에 위치한 치료 부스에 대한 정보를 상기 사용자 단말로 전송하고, 상기 사용자 단말로부터 상기 환자에 의해 선택된 치료 부스에 대한 정보를 포함하는 치료 예약 요청을 수신하는 단계; 상기 수신된 치료 예 약 요청을 기초로 상기 환자의 치료를 예약하는 단계; 상기 환자를 위한 치료 정보에 따라 상기 환자에 대한 상 기 치료가 상기 선택된 치료 부스에서 완료된 경우, 상기 사용자 단말로부터 상기 치료에 대한 피드백 정보를 수신하는 단계; 및 상기 수신된 피드백 정보를 치료 기관 단말로 전송하는 단계를 포함한다. 상기 동작 방법은 상기 치료가 완료된 경우, 상기 선택된 치료 부스로부터 치료 완료 정보를 수신하는 단계; 및 상기 치료 완료 정보를 수신한 경우, 상기 사용자 단말에게 상기 치료에 대한 피드백 요청을 전송하는 단계를 더 포함할 수 있다. 상기 동작 방법은 상기 수신된 피드백 정보를 상기 치료 기관 단말로 전송한 후, 상기 치료 기관 단말로부터 상 기 환자를 위한 제2 치료 정보를 수신하는 단계를 더 포함할 수 있다. 상기 제2 치료 정보는 상기 치료 정보와 동일하거나 다를 수 있다. 상기 선택된 치료 부스에는 인공 지능 로봇이 포함될 수 있다. 상기 인공 지능 로봇은 상기 선택된 치료 부스에서 상기 수신된 치료 정보에 따라 상기 환자를 치료할 수 있다. 상기 치료 정보는 상기 환자의 통증 부위에 대한 정보, 상기 환자의 치료 부위에 대한 정보, 및 치료 방법 정보 를 포함할 수 있다. 상기 동작 방법은 상기 치료를 예약한 경우, 예약 정보를 생성하고 상기 사용자 단말로 상기 생성된 예약 정보 를 전송하는 단계를 더 포함할 수 있다. 상기 동작 방법은 상기 치료를 예약한 경우, 상기 선택된 치료 부스의 식별 정보, 상기 치료의 예약 일시 정보, 및 상기 환자의 식별 정보를 기초로 일회용 방문 코드 정보를 생성하는 단계; 상기 선택된 치료 부스의 식별 정 보, 상기 치료의 예약 일시 정보, 및 상기 환자의 식별 정보를 서로 맵핑하여 맵핑 테이블에 기록하고, 상기 생 성된 일회용 방문 코드 정보를 상기 사용자 단말로 전송하는 단계; 및 상기 선택된 치료 부스로부터 상기 선택 된 치료 부스가 상기 사용자 단말의 방문 코드를 읽어 획득된 정보 및 출입 인증 요청을 수신하는 경우, 상기 획득된 정보가 상기 맵핑 테이블에 있는지 여부 및 상기 출입 인증 요청의 시점과 상기 예약 일시 정보와 매칭 되는지 여부를 체크하는 단계; 및 상기 체크 결과를 기초로 상기 환자의 출입을 인증하는 단계를 더 포함할 수 있다. 일 측에 따른 헬스 케어 시스템은 사용자 단말; 및 상기 사용자 단말로부터 치료 부스 요청을 수신하고, 환자의 주변에 위치한 치료 부스에 대한 정보를 상기 사용자 단말로 전송하며, 상기 사용자 단말로부터 상기 환자에 의 해 선택된 치료 부스에 대한 정보를 포함하는 치료 예약 요청을 수신하고, 상기 수신된 치료 예약 요청을 기초 로 상기 환자의 치료를 예약하고, 상기 선택된 치료 부스에서 상기 환자를 위한 치료 정보에 따라 상기 환자에 대한 상기 치료가 완료된 경우, 상기 사용자 단말로부터 상기 치료에 대한 피드백 정보를 수신하고, 상기 수신 된 피드백 정보를 상기 치료 기관 단말로 전송하는 헬스 케어 서버를 포함한다. 상기 헬스 케어 서버는 상기 치료가 완료된 경우, 상기 선택된 치료 부스로부터 치료 완료 정보를 수신하고, 상 기 치료 완료 정보를 수신한 경우, 상기 사용자 단말에게 상기 치료에 대한 피드백 요청을 전송할 수 있다. 상기 헬스 케어 서버는 상기 수신된 피드백 정보를 상기 치료 기관 단말로 전송한 후 상기 치료 기관 단말로부 터 상기 환자를 위한 제2 치료 정보를 수신할 수 있다. 상기 제2 치료 정보는 상기 치료 정보와 동일하거나 다를 수 있다. 상기 선택된 치료 부스에는 인공 지능 로봇이 포함될 수 있다. 상기 인공 지능 로봇은 상기 선택된 치료 부스에서 상기 수신된 치료 정보에 따라 상기 환자를 치료할 수 있다. 상기 치료 정보는 상기 환자의 통증 부위에 대한 정보, 상기 환자의 치료 부위에 대한 정보, 및 치료 방법 정보 를 포함할 수 있다. 상기 헬스 케어 서버는 상기 환자의 치료를 예약한 경우, 예약 정보를 생성하고 상기 사용자 단말로 상기 생성 된 예약 정보를 전송할 수 있다. 상기 헬스 케어 서버는 상기 환자의 치료를 예약한 경우, 상기 선택된 치료 부스의 식별 정보, 상기 치료의 예 약 일시 정보, 및 상기 환자의 식별 정보를 기초로 일회용 방문 코드 정보를 생성하고, 상기 선택된 치료 부스 의 식별 정보, 상기 치료의 예약 일시 정보, 및 상기 환자의 식별 정보를 서로 맵핑하여 맵핑 테이블에 기록하 며, 상기 생성된 일회용 방문 코드 정보를 상기 사용자 단말로 전송하고, 상기 선택된 치료 부스로부터 상기 선 택된 치료 부스가 상기 사용자 단말의 방문 코드를 읽어 획득된 정보 및 출입 인증 요청을 수신하는 경우, 상기 획득된 정보가 상기 맵핑 테이블에 있는지 여부 및 상기 출입 인증 요청의 시점과 상기 예약 일시 정보와 매칭 되는지 여부를 체크하고, 상기 체크 결과를 기초로 상기 환자의 출입을 인증할 수 있다."}
{"patent_id": "10-2019-0124288", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "일 실시예에 따르면, 로봇이 중/경도의 통증 치료를 하고 전문 인력(예를 들어, 의사)이 중증 이상의 통증 및 재활치료환자에 집중하여 치료의 질을 높일 수 있다. 또한, 일 실시예에 따르면, 의료서비스 취약지역에서도 통증 치료와 관리가 이루어질 수 있다. 또한, 일 실시예에 따르면, 로봇이 정해진 프로토콜대로 치료 또는 시술을 함으로써 더 좋은 결과를 낼 수 있다. 또한, 일 실시예에 따르면, 의료진의 시간이 절약될 수 있고 반복 시술에서 오는 의료진의 근골격계 통증과 스 트레스가 감소할 수 있어 전반적인 의료 서비스의 질이 향상될 수 있다."}
{"patent_id": "10-2019-0124288", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서, 첨부된 도면을 참조하여 실시 예들을 상세하게 설명한다. 그러나, 실시예들에는 다양한 변경이 가해 질 수 있어서 특허출원의 권리 범위가 이러한 실시예들에 의해 제한되거나 한정되는 것은 아니다. 실시예들에 대한 모든 변경, 균등물 내지 대체물이 권리 범위에 포함되는 것으로 이해되어야 한다. 실시예에서 사용한 용어는 단지 설명을 목적으로 사용된 것으로, 한정하려는 의도로 해석되어서는 안된다. 단 수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 명세서에서, \"포함하다\" 또 는 \"가지다\" 등의 용어는 명세서 상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것 이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 실시예가 속 하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일 반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥 상 가지는 의미와 일치하는 의 미를 가지는 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적 인 의미로 해석되지 않는다. 또한, 첨부 도면을 참조하여 설명함에 있어, 도면 부호에 관계없이 동일한 구성 요소는 동일한 참조부호를 부여 하고 이에 대한 중복되는 설명은 생략하기로 한다. 실시예를 설명함에 있어서 관련된 공지 기술에 대한 구체적 인 설명이 실시예의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 도 1 내지 도 2b는 일 실시예에 따른 헬스 케어 시스템을 설명하기 위한 흐름도이다. 도 1을 참조하면, 일 실시예에 따른 헬스 케어 시스템은 치료 기관 단말, 사용자 단말, 헬스 케 어 서버, 치료 부스를 포함한다. 도 1에는 하나의 치료 기관 단말, 하나의 사용자 단말, 하나의 치료 부스가 도시되어 있으나, 헬스 케어 시스템은 복수의 치료 기관 단말들, 복수의 사용자 단말들, 및 복수의 치료 부스들을 포함할 수 있다. 환자는 의사 또는 치료사(예를 들어, 물리 치료사)로부터 원격 진료(telemedicine)를 통해 진단을 받을 수 있다. 다시 말해, 의사 또는 물리 치료사는 원격 진료를 통해 환자를 진단할 수 있다. 치료 기관 단말은 의사 또는 치료사가 이용하는 단말(예를 들어, 고정 단말 또는 이동 단말)을 나타낸다. 치료 기관 단말은 의사 또는 물리 치료사가 환자를 진단한 결과, 치료 부위, 및 치료 방법을 포함하는 치 료 정보를 생성하여 헬스 케어 서버로 전송할 수 있다. 사용자 단말은 환자가 사용하는 단말(예를 들어, 고정 단말 또는 이동 단말)을 나타낼 수 있다. 사용자 단말은 헬스 케어 시스템의 서비스를 위한 헬스 케어 어플리케이션을 저장할 수 있다. 환자는 사용자 단말(또는 헬스 케어 어플리케이션)을 활용하여 주변의 하나 이상의 치료 부스들을 검색할 수 있고, 치료 부스를 예약할 수 있다. 달리 표현하면, 사용자 단말은 헬스 케어 서버로부터 환자 주변에 위치한 치료 부스들에 대한 정보를 수신할 수 있고, 헬스 케어 서버에게 치료 부스 예약을 요 청할 수 있다. 헬스 케어 서버는 여러 치료 부스들 중 치료 부스를 예약하여 예약 정보를 생성할 수있고, 예약 정보를 치료 부스로 전송할 수 있다. 환자는 치료 부스에 방문하고 인증 절차(또는 방문 절차)를 거친 뒤 치료 부스에서 치료받는다. 실 시예에 있어서, 치료 부스에는 AI(Artificial Intelligence) 로봇이 있을 수 있고, AI 로봇은 헬스 케어 서버로부터 수신한 치료 정보에 따라 환자를 치료할 수 있다. 치료 부스는 무인으로 운영될 수 있으나 이에 제한되지 않고 유인으로 운영될 수 있다. 환자는 치료받은 후 치료에 대한 피드백을 헬스 케어 어플리케이션에 기록할 수 있다. 달리 표현하면, 사용자 단말은 치료에 대한 피드백 정보를 헬스 케어 서버로 전송할 수 있다. 헬스 케어 서버는 피드백 정보를 치료 기관 단말로 전송할 수 있고, 의사 또는 물리 치료사는 피드백 정보를 확인하여 치료 정보를 유지 또는 변경할 수 있다. 이하, 도 2a 및 도 2b를 참조하면서 헬스 케어 시스템의 구체적 동작의 일례들을 설명한다. 도 2a에 헬스 케어 시스템의 동작의 일례가 도시된다. 도 2a를 참조하면, 치료 기관 단말은 헬스 케어 서버로 치료 정보를 전송한다(210-1). 치료 정보는, 예를 들어, 의사 또는 치료사가 원격 진료를 통해 환자를 진단한 결과, 치료 방법, 환자의 치료 부위, 환자의 통증 부위, 및 치료 시 주의 사항 중 하나 이상을 포함할 수 있다. 사용자 단말은 헬스 케어 서버로 치료 부스 요청을 전송한다(210-2). 일례로, 환자는 원격 진료를 받은 후 헬스 케어 어플리케이션을 구동할 수 있고, 헬스 케어 어플리케이션 내의 치료 부스 항목을 선택할 수 있으며, 이러한 선택을 기초로 사용자 단말은 헬스 케어 서버에 치료 부스를 검색해 줄 것(또는 주변 치료 부스에 대한 정보를 제공해 줄 것)을 요청할 수 있다. 헬스 케어 서버는 주변 치료 부스에 대한 정보를 사용자 단말로 전송한다(210-3). 일례로, 헬스 케 어 서버은 사용자 단말로부터 치료 부스 요청을 수신하면, 환자의 주변(예를 들어, 반경 10km 이내) 에 위치한 하나 이상의 치료 부스들을 검색할 수 있고, 검색된 하나 이상의 치료 부스들에 대한 정보(예를 들어, 검색된 하나 이상의 치료 부스들의 예약 가능 일시, 위치, 이동 경로 등)를 사용자 단말로 전송할 수 있다. 사용자 단말은 검색된 하나 이상의 치료 부스들에 대한 정보를 디스플레이에 표시할 수 있다. 사용자 단말은 검색된 하나 이상의 치료 부스들 중에서 환자가 선택한 치료 부스에 대한 정보를 포함 하는 치료 예약 요청을 헬스 케어 서버로 전송한다(210-4). 일례로, 환자는 검색된 하나 이상의 치료 부 스들 중에서 환자와 가장 가까운 치료 부스를 선택하였음을 나타내는 선택 정보를 헬스 케어 서버로 전송할 수 있다. 또한, 치료 예약 요청에는 치료의 예약 일시 정보가 포함될 수 있다. 일례로, 환자는 사용자 단말에 현재 시점으로부터 일주일 뒤의 오후 2시를 치료 예약 일시로 입력하면, 사용자 단말은 치료 예약 일시 정보(즉, 현재 시점으로부터 일주일 뒤의 오후 2시)를 헬스 케어 서버에 전송할 수 있다. 헬스 케어 서버는 치료 예약 요청을 기초로 환자의 치료를 예약한다(210-5). 일례로, 치료 예약 요청 내 의 치료 예약 장소가 치료 부스로 설정되어 있고 치료 예약 요청 내의 치료 예약 일시가 현재 시점으로부 터 일주일 뒤의 오후 2시로 설정되어 있으면, 헬스 케어 서버는 현재 시점으로부터 일주일 뒤의 오후 2시 에 환자가 치료 부스에서 치료받을 것임을 예약할 수 있다. 실시예에 있어서, 헬스 케어 서버는 환자의 치료를 예약한 경우, 치료 예약 요청에 상응하는 예약 정보를 생성하고 생성된 예약 정보를 사용자 단말로 전송할 수 있다. 환자는 치료 예약이 정확히 되었는지를 확 인할 수 있다. 헬스 케어 서버는 치료 기관 단말로부터 수신한 치료 정보를 예약된 치료 부스로 전송한다(210- 6). 또한, 헬스 케어 서버는 치료 예약 요청에 상응하는 예약 정보를 치료 부스로 전송한다. 환자는 예약된 일시에 치료 부스로 방문하고, 소정의 인증 절차(또는 방문 절차)를 거친 뒤 치료 부스 에 입장할 수 있다. 일례로, 환자는 출입 인증(예를 들어, 비밀번호 기반의 본인 인증, 생체 정보 기반의 본인 인증)에 성공하면, 치료 부스에 들어갈 수 있다. 또는, 도 3 또는 도 4를 통해 설명할 출입 인증을 통해 환자는 치료 부스에 들어갈 수 있다. 치료 부스 내의 AI 로봇은 헬스 케어 서버로부터 수신한 치료 정보에 따라 환자를 치료한다. 일례로, 치료 부스 내에는 통증 치료 레이저가 있고 AI 로봇은 환자의 통증 부위(또는 치료 부위)에 통증치료 레이저로 환자를 치료할 수 있다. 치료가 완료된 후 환자는 치료 부스에서 치료에 대한 결제를 할 수 있다. 구현에 따라, 결제는 헬스 케어 어플리케이션을 통해 수행될 수 있다. 치료가 완료된 후 환자는 헬스 케어 어플리케이션에 치료에 대한 피드백을 기록할 수 있다. 일례로, 환자는 치 료로 인해 통증이 감소하였다는 피드백, 통증이 사라지지 않고 유지된다는 피드백, 또는 다른 부위에 통증이 발 생하였다는 피드백 등을 헬스 케어 어플리케이션에 기록할 수 있다. 사용자 단말은 치료에 대한 피드백 정보를 헬스 케어 서버로 전송한다(210-7). 실시예에 있어서, 치료가 완료된 후, 헬스 케어 서버는 치료 완료 정보를 치료 부스로부터 수신할 수 있고, 치료 완료 정보를 수신한 경우, 사용자 단말에게 치료에 대한 피드백을 요청할 수 있다. 헬스 케어 서버는 치료에 대한 피드백 정보를 치료 기관 단말로 전송한다(210-8). 구현에 따라, 사용자 단말은 치료에 대한 피드백 정보를 치료 기관 단말로 전송할 수 있다. 의사 또는 치료사는 치료에 대한 피드백 정보를 확인하여 치료 방법을 변경할 것인지 결정할 수 있다. 이 때, 의사 또는 치료사는 원격 진료를 통해 환자로부터 치료에 대한 피드백을 더욱 자세히 들을 수 있고, 환자에 대 한 치료 방법을 변경할 것인지를 결정할 수 있다. 의사 또는 치료사는 치료 기관 단말을 통해 치료 정보 를 변경하거나 유지할 수 있다. 치료 기관 단말은 환자를 위한 치료 정보를 헬스 케어 서버로 전송한다(210-9). 의사 또는 치료사가 치료 방법을 변경하지 않았으면, 단계에서의 치료 정보는 단계에서의 치료 정보와 동일하고, 의사 또 는 치료사가 치료 방법을 변경했으면, 단계에서의 치료 정보는 단계에서의 치료 정보와 다르다. 구 현에 따라, 의사 또는 치료사가 더 이상 치료 받을 필요가 없다고 결정하면, 치료 기관 단말은 치료 정보 를 헬스 케어 서버로 전송하지 않을 수 있다. 단계(210-9) 후, 단계(210-2) 내지 단계(210-8)이 수행될 수 있다. 도 2b에 헬스 케어 시스템의 동작의 다른 일례가 도시된다. 치료 기관 단말은 치료 정보를 사용자 단말로 전송한다(220-1). 치료 정보는, 예를 들어, 의사 또는 치료 사가 원격 진료를 통해 환자를 진단한 결과, 치료 방법, 환자의 치료 부위, 환자의 통증 부위, 및 치료 시 주의 사항 중 하나 이상을 포함할 수 있다. 사용자 단말은 헬스 케어 서버로 치료 부스 요청을 전송한다(220-2). 단계(220-2)에는 단계(210- 2)에 대한 설명이 적용될 수 있으므로, 단계(220-2)에 대한 상세한 설명을 생략한다. 헬스 케어 서버는 주변 치료 부스에 대한 정보를 사용자 단말로 전송한다(220-3). 단계(220-3)에는 단계(210-3)에 대한 설명이 적용될 수 있으므로, 단계(220-3)에 대한 상세한 설명을 생략한다. 사용자 단말은 검색된 하나 이상의 치료 부스들 중에서 환자가 선택한 치료 부스에 대한 정보를 포함 하는 치료 예약 요청을 헬스 케어 서버로 전송한다(220-4). 단계(220-4)에는 단계(210-4)에 대한 설명이 적용될 수 있으므로, 단계(220-4)에 대한 상세한 설명을 생략한다. 헬스 케어 서버는 치료 예약 요청을 기초로 환자의 치료를 예약한다(220-5). 단계(220-5)에는 단계(210- 5)에 대한 설명이 적용될 수 있으므로, 단계(220-5)에 대한 상세한 설명을 생략한다. 헬스 케어 서버는 환자의 치료를 예약한 경우, 치료 예약 요청에 상응하는 예약 정보를 생성하고 생성된 예약 정보를 치료 기관 단말로 전송할 수 있다. 치료 기관 단말은 헬스 케어 서버로부터 예약 정보를 수신하면, 치료 정보를 치료 부스로 전송 할 수 있다(220-6). 구현에 따라, 치료 기관 단말은 헬스 케어 서버를 통해 치료 정보를 치료 부스 로 전송할 수 있다. 환자는 예약된 일시에 치료 부스로 방문하고, 소정의 인증 절차(또는 방문 절차)를 거친 뒤 치료 부스 에 입장할 수 있다. 치료 부스에 치료가 완료된 후 환자는 헬스 케어 어플리케이션에 치료에 대한 피드백을 기록할 수 있고, 사용자 단말은 치료에 대한 피드백 정보를 헬스 케어 서버로 전송한다(220-7). 단계(220-7)에는 단 계(220-7)에 대한 설명이 적용될 수 있으므로, 단계(220-7)에 대한 상세한 설명을 생략한다. 헬스 케어 서버는 치료에 대한 피드백 정보를 치료 기관 단말로 전송한다(220-8). 도 3은 일 실시예에 따른 치료 부스의 출입 인증의 일례를 설명하기 위한 도면이다. 도 3을 참조하면, 치료 부스에는 비쥬얼 코드(140-1)(예를 들어, QR 코드)가 부착되어 있다. 비쥬얼 코드 (140-1)에는 치료 부스의 식별 정보가 인코딩되어 있을 수 있다. 환자가 예약 일시에 치료 부스에 방문한 경우, 환자는 사용자 단말의 카메라가 비쥬얼 코드(140-1)를 읽을 수 있게 끔 사용자 단말을 비쥬얼 코드(140-1)에 가까이할 수 있다. 사용자 단말은 비쥬얼 코드(140-1)를 읽으면, 비쥬얼 코드(140-1)에서 식별 정보를 획득 또는 추출할 수 있다. 사용자 단말은 획득된 식별 정보를 헬스 케어 서버에 전송하여 헬스 케어 서버에 출입 인증을 요청할 수 있다 . 헬스 케어 서버는 사용자 단말로부터 수신한 식별 정보를 기초로 환자의 출입을 인증할 수 있고 , 인증 결과를 치료 부스로 전송할 수 있다. 일례로, 헬스 케어 서버는 사용자 단말(12 0)로부터 식별 정보를 수신했을 때의 일시 정보(이하, 제1 일시 정보)가 단계을 통해 생성된 예약 정보의 일시 정보와 매칭되는지 및 사용자 단말로부터 수신한 식별 정보가 예약 정보 내의 치료 부스 식별 정보와 일치되는지 확인할 수 있다. 여기서, 헬스 케어 서버는 제1 일시 정보가 예약 정보 내의 일시 정 보와 매칭되고 수신한 식별 정보가 해당 예약 정보 내의 치료 부스 식별 정보와 일치하면, 해당 환자는 치 료 부스에 출입해도 좋다고 인증할 수 있다. 그리고, 헬스 케어 서버는 환자가 치료 부스에 출 입해도 좋다는 인증 결과를 치료 부스로 전송할 수 있다. 치료 부스는 문을 오픈(open)할 수 있고 환자는 치료 부스로 들어갈 수 있으며 AI 로봇으로부터 치료를 받을 수 있다. 만약, 헬스 케어 서버(12 0)는 사용자 단말로부터 수신한 식별 정보 및 제1 일시 정보 중 적어도 하나가 예약 정보와 매칭되지 않으 면, 환자의 출입을 거부할 수 있고, 인증 실패를 치료 부스로 전송할 수 있다. 이 경우, 치료 부스 는 문을 오픈하지 않는다. 이 때, 치료 부스는 예약 정보와 매칭되지 않아 문을 오픈할 수 없다고 방문자 에 알릴 수 있다. 도 4a는 일 실시예에 따른 치료 부스의 출입 인증의 다른 일례를 설명하기 위한 도면이다. 도 4a를 참조하면, 헬스 케어 서버는 치료 부스의 식별 정보, 환자의 치료의 예약 일시 정보, 및 환 자의 식별 정보 중 적어도 하나를 기초로 일회용 방문 코드 정보를 생성할 수 있다. 일례로, 헬스 케어 서버 는 도 2의 단계을 통해 치료를 예약한 경우, 치료 부스의 식별 정보 ax01, 환자의 치료의 예약 일시 정보 2019txy, 및 환자의 식별 정보 abc를 조합하여 일회용 방문 코드 정보를 생성할 수 있다. 그리고, 헬스 케어 서버는 치료 부스의 식별 정보 ax01, 환자의 치료의 예약 일시 정보 2019txy, 및 환자의 식별 정보 abc를 서로 맵핑하여 맵핑 테이블에 기록할 수 있다. 헬스 케어 서버는 생성된 일회용 방문 코드 정보를 사용자 단말로 전송할 수 있다(410-1). 사용자 단말은 일회용 방문 코드 정보를 기초로 방문 코드(120-1)를 디스플레이에 표시할 수 있다. 치료 부스의 카메라는 사용자 단말의 디스플레이에 표시된 방문 코드(120-1)를 읽을 수 있고(410-2), 치료 부스는 방문 코드(120-1)를 읽어서 획득한 정보를 기초로 헬스 케어 서버에 환자의 출입 인증을 요청할 수 있다(410-3). 방문 코드(120-1)를 읽어서 획득한 정보에는 치료 부스의 식별 정보, 환자의 치 료의 예약 일시 정보, 및 환자의 식별 정보가 포함될 수 있다. 헬스 케어 서버는 치료 부스가 방문 코드(120-1)를 읽어서 획득한 정보 및 맵핑 테이블을 기초로 출 입 여부를 인증할 수 있다. 일례로, 헬스 케어 서버는 치료 부스가 방문 코드(120-1)를 읽어서 획득 한 정보에 치료 부스의 식별 정보 ax01, 환자의 치료의 예약 일시 정보 2019txy, 및 환자의 식별 정보 abc 가 있으면, 맵핑 테이블에 ax01, 2019txy, 및 abc이 서로 맵핑되어 있는지 체크할 수 있고 예약 일시 정보2019txy이 인증 요청 시점과 매칭되는지 체크할 수 있다. 맵핑 테이블에 ax01, 2019txy, 및 abc이 서로 맵핑되 어 있고 예약 일시 정보2019txy이 인증 요청 시점과 매칭되면, 헬스 케어 서버는 환자의 출입을 허용할 수 있다. 만약, 인증 요청 시점이 예약 일시 정보 2019txy와 매칭되지 않으면 헬스 케어 서버는 환자의 출입 을 거부할 수 있다. 헬스 케어 서버는 인증 결과를 치료 부스로 전송할 수 있다(410-4). 치료 부스는 인증 결과가 출입 허용을 나타내면, 문을 오픈한다. 환자는 치료 부스로 들어갈 수 있 고 AI 로봇으로부터 치료를 받는다. 만약, 치료 부스는 인증 결과가 출입 거부를 나타내면, 문을 오픈하 지 않는다. 이 경우, 치료 부스는 방문자의 예약이 없어 문을 오픈할 수 없다고 해당 방문자에게 알릴 수 있다. 도 4b를 참조하면, 환자는 치료 부스에 방문한 후 헬스 케어 어플리케이션을 구동하여 헬스 케어 어플리케 이션 내의 출입 인증 항목을 선택할 수 있다. 이 경우, 사용자 단말은 인증 코드(120-2)를 디스플레이에 표시할 수 있다. 이 때, 사용자 단말에는 앞서 설명 드린 치료 정보가 저장되어 있을 수 있다. 인증 코드(120-2)는 헬스 케어 어플리케이션에 의해 랜덤하게 생성된 것이거나 헬스 케어 서버로부터 수신 한 것일 수 있다. 인증 코드(120-2)는, 예를 들어, QR 코드 또는 랜덤한 n자리 숫자 코드일 수 있다. 치료 부스는 인증 코드(120-2)를 읽을 수 있다. 구현에 따라, 환자는 n자리 숫자 코드를 치료 부스 에 입력할 수 있다. 치료 부스는 인증 코드(120-2)를 읽어 획득한 정보(또는 입력 받은 n자리 숫자 코드)를 헬스 케어 서버 로 전송하여 헬스 케어 서버에 출입 인증을 요청할 수 있다(420-1). 헬스 케어 서버는 치료 부스가 인증 코드(120-2)를 읽어 획득한 정보(또는 치료 부스가 입력 받 은 n자리 숫자 코드)를 기초로 환자의 출입을 인증할 수 있다. 헬스 케어 서버는 인증 결과를 치료 부스로 전송할 수 있다(420-2). 구현에 따라, 헬스 케어 서버 는 인증 결과와 함께 환자의 치료 정보를 치료 부스로 전송할 수 있다. 다시 말해, 앞서 도 2a 및 도 2b를 통해 설명한 예와 달리, 헬스 케어 서버는 환자 출입 인증이 성공했을 때 환자의 치료 정보를 치 료 부스로 전송할 수 있다. 도 5는 일 실시예에 따른 헬스 케어 시스템의 동작 방법을 설명하기 위한 순서도이다. 도 5를 참조하면, 헬스 케어 서버는 환자를 위한 치료 정보를 치료 기관 단말로부터 수신한다. 헬스 케어 서버는 환자의 사용자 단말로부터 치료 부스 요청을 수신한다. 헬스 케어 서버는 환자의 주변에 위치한 치료 부스에 대한 정보를 사용자 단말로 전송하고, 사용자 단말로부터 환자에 의해 선택된 치료 부스에 대한 정보를 포함하는 치료 예약 요청을 수신한다. 헬스 케어 서버는 수신된 치료 예약 요청을 기초로 환자의 치료를 예약한다. 헬스 케어 서버는 수신된 치료 정보를 선택된 치료 부스로 전송한다. 헬스 케어 서버는 수신된 치료 정보에 따라 환자에 대한 치료가 선택된 치료 부스에서 완료된 경우, 사용자 단말로부터 치료에 대한 피드백 정보를 수신한다. 헬스 케어 서버는 수신된 피드백 정보를 치료 기관 단말로 전송한다. 일 실시예에 있어서, 헬스 케어 서버는 수신된 피드백 정보를 치료 기관 단말로 전송한 후, 치료 기 관 단말로부터 환자를 위한 제2 치료 정보를 수신할 수 있다. 이 때, 제2 치료 정보는 치료 정보와 동일 하거나 다를 수 있다. 일 실시예에 있어서, 헬스 케어 서버는 선택된 치료 부스에서 환자의 치료가 완료된 경우, 선택된 치 료 부스로부터 치료 완료 정보를 수신할 수 있고, 치료 완료 정보를 수신한 경우, 사용자 단말에게 치료에 대한 피드백 요청을 전송할 수 있다. 일 실시예에 있어서, 선택된 치료 부스에는 AI 로봇이 포함될 수 있다. 여기서, AI 로봇은 선택된 치료 부스에서 수신된 치료 정보에 따라 환자를 치료할 수 있다. 일 실시예에 있어서, 치료 정보는 환자의 통증 부위에 대한 정보, 환자의 치료 부위에 대한 정보, 및 치료 방법 정보를 포함할 수 있다. 일 실시예에 있어서, 헬스 케어 서버는 치료를 예약한 경우, 예약 정보를 생성할 수 있고 사용자 단말 로 생성된 예약 정보를 전송할 수 있다. 일 실시예에 있어서, 헬스 케어 서버는 치료를 예약한 경우, 선택된 치료 부스의 식별 정보, 치료의 예약 일시 정보, 및 환자의 식별 정보를 기초로 일회용 방문 코드 정보를 생성할 수 있다. 헬스 케어 서버 는 선택된 치료 부스의 식별 정보, 치료의 예약 일시 정보, 및 환자의 식별 정보를 서로 맵핑하여 맵 핑 테이블에 기록할 수 있고, 생성된 일회용 방문 코드 정보를 사용자 단말로 전송할 수 있다. 헬스 케어 서버는 선택된 치료 부스로부터 선택된 치료 부스가 사용자 단말의 방문 코드를 읽어 획득 된 정보 및 출입 인증 요청을 수신하는 경우, 획득된 정보가 맵핑 테이블에 있는지 여부 및 출입 인증 요청의 시점이 예약 일시 정보와 매칭되는지 여부를 체크할 수 있고, 체크 결과를 기초로 환자의 출입을 인증할 수 있 다. 도 1 내지 도 4를 통해 기술된 사항들은 도 5를 통해 기술된 사항들에 적용될 수 있으므로, 상세한 설명을 생략 한다. 도 6은 일 실시예에 따른 헬스 케어 서버를 설명하기 위한 블록도이다. 도 6을 참조하면, 헬스 케어 서버는 메모리 및 컨트롤러를 포함한다. 컨트롤러는 통신 인터페이스를 통해 치료 기관 단말로부터 환자를 위한 치료 정보를 수신한다. 컨트롤러는 통신 인터페이스를 통해 환자의 사용자 단말로부터 치료 부스 요청을 수신한다. 컨트롤러는 통신 인터페이스를 통해 환자의 주변에 위치한 치료 부스에 대한 정보를 사용자 단말로 전송한다. 컨트롤러는 통신 인터페이스를 통해 사용자 단말로부터 환자에 의해 선택된 치료 부스에 대한 정보를 포함하는 치료 예약 요청을 수신하고, 수신된 치료 예약 요청을 기초로 환자의 치료를 예약한다. 컨트롤러는 통신 인터페이스를 통해 수신된 치료 정보를 선택된 치료 부스로 전송하고, 수신된 치료 정보에 따라 환자에 대한 치료가 선택된 치료 부스에서 완료된 경우, 통신 인터페이스를 통해 사용자 단말 로부터 치료에 대한 피드백 정보를 수신한다. 컨트롤러는 수신된 피드백 정보를 통신 인터페이스를 통해 치료 기관 단말로 전송한다. 도 1 내지 도 5를 통해 기술된 사항들은 도 6을 통해 기술된 사항들에 적용될 수 있으므로, 상세한 설명을 생략 한다. 도 7 내지 도 11은 일 실시예에 따른 치료 부스를 설명하기 위한 블록도이다. 도 7을 참조하면, 치료 부스는 AI 로봇 및 치료 기기를 포함한다. 실시예에 따라, AI 로봇과 치료 기기는 서로 물리적으로 구별되거나 일체형일 수 있다. 치료 기기는 통증 치료, 미용 치료, 또는 비만 치료를 위한 기기일 수 있다. 구현에 따라, 치료 부스에는 통증 치료를 위한 치료 기기, 미용 치료를 위한 치료 기기, 및 비만 치료를 위한 치료 기기 중 둘 이상이 위치 할 수 있다. 치료 기기는 치료를 위한 레이저, 초음파, 고주파, 저주파, 또는 광을 출력할 수 있다. 일례로, 치료 기 기는 AI 로봇의 제어에 따라 레이저, 초음파, 고주파, 또는 광을 치료받을 부위에 출력할 수 있다. AI 로봇은 치료 받은 환자의 상태를 체크할 수 있고, 치료 받은 환자의 상태를 치료 기관 단말로 전 송할 수 있다. 일례로, AI 로봇은 치료 행위를 녹화할 수 있고 녹화하여 생성된 영상을 치료 기관 단말 로 전송할 수 있다. 환자는 치료받은 부위에 대한 영상을 찍어 헬스 케어 어플리케이션을 통해 업로드할수 있다. 해당 영상은 치료 기관 단말로 전송될 수 있다. 의사 또는 치료사는 치료 받은 환자의 상태를 통해 적절한 처방을 내리고, 환자는 이후에 치료 부스에 방 문하여 해당 처방에 따라 AI 로봇으로부터 치료를 받을 수 있다. AI 로봇은 치료 뿐 아니라 도 1 내지 도 6을 통해 설명한 치료 부스의 동작을 수행할 수 있다. 구현에 따라, 치료 부스는 관리 장치를 더 포함할 수 있다. 이러한 관리 장치는 도 1 내지 도 6을 통해 설명한 치료 부스의 동작을 수행할 수 있다. 일례로, 관리 장치는 헬스 케어 서버로부터 치료 정보 와 예약 정보를 수신할 수 있고, 환자의 출입이 인증되면 치료 부스의 문을 오픈할 수 있다. 도 8 및 도 9에 도시된 장비는 AI 로봇과 치료 기기가 통합된 것이다. 장비는 스스로 이 동할 수 있다. 구현에 따라, 도 7을 통해 설명한 관리 장치는 장비에 포함될 수 있다. 장비의 치료 기기는 도 10에 도시된 것과 같이 레이저를 출력할 수 있다. 장비의 치료 기기 는 감지 센서를 포함할 수 있고 해당 감지 센서는 레이저가 출력되는 동안 환자가 레이저에 가까워지는 것 을 감지하면 도 11에 도시된 것과 같이 레이저의 출력을 중단할 수 있다. 실시예에 따르면, AI 로봇은 환자의 특성(예를 들어, 피부색 및/또는 털의 유무 등)을 파악할 수 있고, 파악된 특성을 기초로 치료 정보에 포함된 치료 방식의 일부를 변경할 수 있다. 이에 따라, AI 로봇은 환 자의 특성에 맞는 정확한 치료를 수행할 수 있다. 실시예에 따르면, AI 로봇은 환자의 특성을 파악하여 환자가 치료받을 부위에 최적의 치료를 할 수 있다. 일례로, 테니스 엘보(Tennis Elbow) 환자의 경우, AI 로봇은 해당 환자의 성별, 신장, 팔꿈치 뼈의 모양, 팔꿈치 뼈의 굴곡, 팔꿈치 뼈의 사이즈 등을 고려하여 해당 환자를 치료할 수 있다. 실시예에 따르면, AI 로봇은 치료 기기를 이용하여 환자를 치료할 수 있다. 이 때, AI 로봇은 환자의 긴장을 감지하거나 해당 환자가 치료 기기에서 출력되는 레이저를 피하려는 움직임을 감지할 수 있 다. 이러한 감지 결과를 기초로 AI 로봇은 치료 기기의 사용을 일시 정지할 수 있다. 실시예에 따르면, AI 로봇은 환자가 치료받는 도중 해당 환자가 움직이는 경우, 치료 기기의 작동을 잠시 멈추고 환자가 정위치에 오면 치료를 재시작할 수 있다. 실시예에 따르면, AI 로봇은 의사가 처방한 치료 부위를 정확히 이해하고 감지하여 치료 부위에 레이져를 조사할 수 있다. 실시예에 따르면, 치료 부스에는 환자가 치료받을 때 앉는 치료용 의자(또는 환자가 치료받을 때 누울 수 있는 치료용 베드)가 있을 수 있다. AI 로봇은 환자의 치료 부위에 레이저를 조사할 수 있도록 환자의 치 료 정보를 기초로 치료용 의자의 등받이의 기울기, 치료용 의자의 높이 등을 조절할 수 있다. 일례로, 환자의 치료 부위가 허벅지의 특정 부분인 경우, AI 로봇은 환자가 치료용 의자에 앉게 해당 환자를 가이드할 수 있고, 해당 환자가 치료용 의자에 앉은 경우, 치료받을 부위에 레이저를 조사할 수 있도록 치료용 의자의 등받 이의 기울기를 조절할 수 있다. 환자가 통증 치료를 위해 치료 부스에 방문했을 때의 일례를 설명한다. 환자가 치료 부스에 방문한 경우, AI 로봇은 환자를 치료실로 안내할 수 있다. 치료실에는 치료용 베드 및/또는 치료용 의자가 있을 수 있다. AI 로봇은 환자의 치료 정보를 기초로 환자가 어떤 부위에서 통증을 느끼는지를 파악할 수 있다. 달리 표 현하면, AI 로봇은 치료 정보를 기초로 환자의 치료 부위를 파악할 수 있다. AI 로봇은 환자의 치료 정보(또는 진단 정보)를 기초로 환자의 치료 자세(pose)를 결정할 수 있고, 환자에 게 결정된 치료 자세를 취해줄 것을 요청할 수 있다. 일례로, AI 로봇은 환자의 치료 부위가 무릎인 경우, 환자의 치료 자세를 \"치료용 베드에 눕고 무릎을 노출하는 것\"으로 결정할 수 있고, 환자에게 결정된 치 료 자세를 취해 달라고 요청할 수 있다. 달리 표현하면, AI 로봇은 환자에게 치료용 베드에 눕고 무릎을 노출해달라고 안내할 수 있다. 다른 일례로, AI 로봇은 환자의 치료 부위가 허리인 경우, 환자의 치료 자 세를 \"치료용 베드에 엎드리고(또는 옆으로 눕고) 허리를 노출하는 것\"으로 결정할 수 있고, 환자에게 결정된 치료 자세를 취해 달라고 요청할 수 있다. 달리 표현하면, AI 로봇은 환자에게 치료용 베드에 엎드리거나 옆으로 눕고, 허리를 노출해달라고 안내할 수 있다. AI 로봇은 카메라를 통해 환자가 취한 자세를 확인할 수 있고, 확인된 자세가 결정된 치료 자세에 부합되 면 치료 부위를 스캐닝할 수 있다. 만약, AI 로봇은 확인된 자세가 결정된 치료 자세에 부합되지 않으면, 환자에게 결정된 치료 자세에 부합되게 움직여달라고 요청할 수 있다. AI 로봇은 환자의 치료 부위를 스캐닝할 수 있다. 일례로, AI 로봇은 환자의 치료 부위를 카메라 및 /또는 센서를 통해 스캐닝할 수 있다. AI 로봇은 스캐닝을 통해 환자의 피부 특성(예를 들어, 피부색, 피 부톤)을 파악할 수 있다. 또한, AI 로봇은 스캐닝 결과를 기초로 레이저의 조사 영역(또는 치료 영역)을 정확히 파악 또는 결정할 수 있다. AI 로봇은 레이저의 조사 영역에 레이저가 정확히 조사될 수 있게 치료용 베드 또는 치료용 의자를 제어할 수 있다. 일례로, AI 로봇은 환자가 치료용 베드에 누워 무릎을 노출하고 있는 경우, 무릎에 대한 스캐닝 을 통해 레이저의 조사 영역을 정확히 파악 또는 결정할 수 있고, 파악된 조사 영역에 레이저가 정확히 조사될 수 있게 치료용 베드를 제어할 수 있다. AI 로봇은 스캐닝 결과를 기초로 치료 세기(intensity)를 결정할 수 있다. 일례로, AI 로봇은 스캐 닝을 통해 환자의 피부색이 검다고 확인한 경우, 테이블을 참조하여 레이저의 세기를 결정할 수 있다. 여기서, 테이블에는 레이저의 세기와 피부색이 맵핑되어 있다. AI 로봇은 환자가 치료받는 동안 환자의 상태를 모니터링할 수 있고 모니터링 결과를 기초로 치료를 일시 중지할 수 있다. 일례로, AI 로봇은 환자가 눈을 찡그리거나 환자가 움직여 치료 부위가 레이저의 조사 영역에서 벗어난 경우, 환자가 통증을 느끼고 있다고 판단하여 치료를 일시 중지할 수 있다. 달리 표현하면, AI 로봇은 모니터링 결과를 기초로 환자가 치료로 인한 통증을 느끼는지 감지할 수 있고, 환자가 치료로 인한 통증을 느끼고 있다고 감지하는 경우, 치료를 일시 중지할 수 있다. AI 로봇은 환자가 치료받는 동안 환자가 움직인 경우, 치료를 일시 중지할 수 있고, 환자의 치료 부위에 레이저가 정확히 조사될 수 있도록 치료용 베드 또는 치료용 의자를 제어하거나 치료 기기의 위치를 조절 할 수 있다. AI 로봇은 환자와 대화할 수 있다. 일례로, AI 로봇은 환자에게 아픈지, 치료 종료까지 남은 시간 등을 안내할 수 있다. 또한, AI 로봇은 환자가 치료로 인해 아프다고 말한 경우, 치료를 일시 중지할 수 있다. AI 로봇은 치료가 종료된 경우, 환자에게 치료 이후의 행동을 안내할 수 있다. 치료 이후의 환자의 행동 에 대한 정보는 환자의 사용자 단말로 전송될 수 있다. 환자가 미용 치료를 위해 치료 부스에 방문했을 때의 일례를 설명한다. 미용 치료에는 피부 치료, 제모 치료, 바디(body) 미용 치료 등이 있으나 이에 제한되지 않는다. 환자가 치료 부스에 방문한 경우, AI 로봇은 환자를 치료실로 안내할 수 있다. 치료실에는 치료용 베드 및/또는 치료용 의자가 있을 수 있다. AI 로봇은 환자의 치료 정보(또는 진단 정보)를 기초로 환자가 어떤 부위에서 미용 치료를 원하는지 파악 할 수 있다. 달리 표현하면, AI 로봇은 치료 정보를 기초로 환자의 미용 치료 부위를 파악할 수 있다. AI 로봇은 환자의 치료 정보(또는 진단 정보)를 기초로 환자의 치료 자세(pose)를 결정할 수 있고, 환자에 게 결정된 치료 자세를 취해줄 것을 요청할 수 있다. 일례로, AI 로봇은 환자의 미용 치료 부위가 눈 밑 피부인 경우, 환자의 치료 자세를 \"치료용 베드에 눕는 것\"으로 결정할 수 있고, 환자에게 결정된 치료 자세를 취해 달라고 요청할 수 있다. 달리 표현하면, AI 로봇은 환자에게 치료용 베드에 누으라고 안내할 수 있 다. AI 로봇은 카메라를 통해 환자가 취한 자세를 확인할 수 있고, 확인된 자세가 결정된 치료 자세에 부합되 면 치료 부위를 스캐닝할 수 있다. 만약, AI 로봇은 확인된 자세가 결정된 치료 자세에 부합되지 않으면, 환자에게 결정된 치료 자세에 부합되게 움직여달라고 요청할 수 있다. AI 로봇은 환자의 미용 치료 부위를 스캐닝할 수 있다. 일례로, AI 로봇은 환자의 미용 치료 부위를 카메라 및/또는 센서를 통해 스캐닝할 수 있다. AI 로봇은 스캐닝을 통해 환자의 특성(예를 들어, 피부톤, 피부 굴곡, 얼굴 사이즈, 털 유무, 얼굴 윤곽, 및 바디(body) 윤곽 중 하나 이상)을 파악할 수 있다.또한, AI 로봇은 스캐닝 결과를 기초로 레이저의 조사 영역(또는 치료 영역)을 정확히 파악할 수 있다. AI 로봇은 환자의 미용 치료 부위에 레이저가 정확히 조사될 수 있게 치료용 베드 또는 치료용 의자를 제 어할 수 있다. 일례로, AI 로봇은 환자가 치료용 베드에 누워 있는 경우, 스캐닝을 통해 레이저의 조사 영역을 정확히 파악할 수 있고, 파악된 조사 영역에 레이저가 정확히 조사될 수 있게 치료용 베드를 제어할 수 있다. AI 로봇은 스캐닝 결과를 기초로 치료 세기(intensity)를 결정할 수 있다. 일례로, AI 로봇은 스캐 닝을 통해 환자의 피부색이 검다고 확인한 경우, 테이블을 참조하여 레이저의 세기를 결정할 수 있다. 여기서, 테이블에는 레이저의 세기와 피부색이 맵핑되어 있다. AI 로봇은 환자의 미용 치료 부위(또는 레이저의 조사 영역)에 쿨링젤을 도포하거나 미용 치료 부위(또는 레이저의 조사 영역)보다 넓게 쿨링젤을 도포할 수 있다. AI 로봇(710은 미용 치료 부위(또는 레이저의 조사 영역)에 레이저를 조사할 수 있다. AI 로봇은 환자가 미용 치료받는 동안 환자의 상태를 모니터링할 수 있고 모니터링 결과를 기초로 치료를 일시 중지할 수 있다. 일례로, AI 로봇은 환자가 눈을 찡그리거나 환자가 움직여 치료 부위가 레이저의 조사 영역에서 벗어난 경우, 환자가 통증을 느끼고 있다고 판단하여 치료를 일시 중지할 수 있다. 달리 표현하 면, AI 로봇은 모니터링 결과를 기초로 환자가 치료로 인한 통증을 느끼는지 감지할 수 있고, 환자가 치료 로 인한 통증을 느끼고 있다고 감지하는 경우, 치료를 일시 중지할 수 있다. 실시예에 따라, AI 로봇은 신경 감지 장치를 이용하여 치료 시 사전 대처를 수행할 수 있다. 일례로, AI 로봇은 신경 감지 장치를 이용하여 환자의 뇌파를 측정할 수 있고 뇌파의 변화를 통해 사전 대처(예를 들어, 치료 일시 중지 또는 레이저 세기를 감소)를 수행할 수 있다. AI 로봇은 환자가 치료받는 동안 환자가 움직인 경우, 치료를 일시 중지할 수 있고, 환자의 치료 부위에 레이저가 정확히 조사될 수 있도록 치료용 베드 또는 치료용 의자를 제어하거나 치료 기기의 위치를 조절할 수 있다. AI 로봇은 환자와 대화할 수 있다. 일례로, AI 로봇은 환자에게 아픈지, 치료 종료까지 남은 시간 등을 안내할 수 있다. 또한, AI 로봇은 환자가 치료로 인해 아프다고 말한 경우, 치료를 일시 중지할 수 있다. AI 로봇은 미용 치료에 의해 스모크(smoke)가 발생하는 경우, 스모크 흡입 기기를 구동할 수 있다. AI 로봇은 치료가 종료된 경우, 치료받은 부위에 쿨링을 수행할 수 있다. 일례로, AI 로봇은 치료받 은 부위에 팩을 놓을 수 있다. AI 로봇은 치료가 종료된 경우, 환자에게 치료 이후의 행동을 안내할 수 있다. 치료 이후의 환자의 행동 에 대한 정보는 환자의 사용자 단말로 전송될 수 있다. 통증 치료, 미용 치료에 대한 내용은 비만 치료에도 적용될 수 있다. 또한, 통증 치료, 미용 치료에서 레이저 이외에 초음파, 고주파, 저주파, 또는 광 등이 이용될 수 있다. AI 로봇을 이용한 치료는 치료 부스에서 독립적으로 수행될 수 있고, 병원에서 의료진과 함께 수행될 수 있다. 도 1 내지 도 6을 통해 기술된 사항들은 도 7 내지 도 11을 통해 기술된 사항들에 적용될 수 있으므로, 상세한 설명을 생략한다. 이상에서 설명된 장치는 하드웨어 구성요소, 소프트웨어 구성요소, 및/또는 하드웨어 구성요소 및 소프트웨어 구성요소의 조합으로 구현될 수 있다. 예를 들어, 실시예들에서 설명된 장치 및 구성요소는, 예를 들어, 프로 세서, 콘트롤러, ALU(arithmetic logic unit), 디지털 신호 프로세서(digital signal processor), 마이크로컴 퓨터, FPGA(field programmable gate array), PLU(programmable logic unit), 마이크로프로세서, 또는 명령 (instruction)을 실행하고 응답할 수 있는 다른 어떠한 장치와 같이, 하나 이상의 범용 컴퓨터 또는 특수 목적 컴퓨터를 이용하여 구현될 수 있다. 처리 장치는 운영 체제(OS) 및 상기 운영 체제 상에서 수행되는 하나 이상 의 소프트웨어 애플리케이션을 수행할 수 있다. 또한, 처리 장치는 소프트웨어의 실행에 응답하여, 데이터를접근, 저장, 조작, 처리 및 생성할 수도 있다. 이해의 편의를 위하여, 처리 장치는 하나가 사용되는 것으로 설"}
{"patent_id": "10-2019-0124288", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "명된 경우도 있지만, 해당 기술분야에서 통상의 지식을 가진 자는, 처리 장치가 복수 개의 처리 요소 (processing element) 및/또는 복수 유형의 처리 요소를 포함할 수 있음을 알 수 있다. 예를 들어, 처리 장치 는 복수 개의 프로세서 또는 하나의 프로세서 및 하나의 콘트롤러를 포함할 수 있다. 또한, 병렬 프로세서 (parallel processor)와 같은, 다른 처리 구성(processing configuration)도 가능하다. 소프트웨어는 컴퓨터 프로그램(computer program), 코드(code), 명령(instruction), 또는 이들 중 하나 이상의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결합적으로 (collectively) 처리 장치를 명령할 수 있다. 소프트웨어 및/또는 데이터는, 처리 장치에 의하여 해석되거나 처리 장치에 명령 또는 데이터를 제공하기 위하여, 어떤 유형의 기계, 구성요소(component), 물리적 장치, 가상 장치(virtual equipment), 컴퓨터 저장 매체 또는 장치, 또는 전송되는 신호 파(signal wave)에 영구적으로, 또는 일시적으로 구체화(embody)될 수 있다. 소프트웨어는 네트워크로 연결된 컴퓨터 시스템 상에 분산되어서, 분산된 방법으로 저장되거나 실행될 수도 있다. 소프트웨어 및 데이터는 하나 이상의 컴퓨터 판독 가능 기록 매 체에 저장될 수 있다. 실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등 을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 실시예를 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판 독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체 (magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도 록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 상기된 하드웨어 장치는 실시예의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도 록 구성될 수 있으며, 그 역도 마찬가지이다."}
{"patent_id": "10-2019-0124288", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이상과 같이 실시예들이 비록 한정된 실시예와 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가 진 자라면 상기의 기재로부터 다양한 수정 및 변형이 가능하다. 예를 들어, 설명된 기술들이 설명된 방법과 다 른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태 로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다. 그러므로, 다른 구현들, 다른 실시예들 및 청구범위와 균등한 것들도 후술하는 청구범위의 범위에 속한다. 도면 도면1 도면2a 도면2b 도면3 도면4a 도면4b 도면5 도면6 도면7 도면8 도면9 도면10 도면11"}
{"patent_id": "10-2019-0124288", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1 내지 도 2b는 일 실시예에 따른 헬스 케어 시스템을 설명하기 위한 흐름도이다. 도 3은 일 실시예에 따른 치료 부스의 출입 인증의 일례를 설명하기 위한 도면이다. 도 4는 일 실시예에 따른 치료 부스의 출입 인증의 다른 일례를 설명하기 위한 도면이다. 도 5는 일 실시예에 따른 헬스 케어 시스템의 동작 방법을 설명하기 위한 순서도이다. 도 6은 일 실시예에 따른 헬스 케어 서버를 설명하기 위한 블록도이다. 도 7 내지 도 11은 일 실시예에 따른 치료 부스를 설명하기 위한 블록도이다."}
