{"patent_id": "10-2014-0019265", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2015-0098119", "출원번호": "10-2014-0019265", "발명의 명칭": "의료 영상 내 거짓양성 병변후보 제거 시스템 및 방법", "출원인": "삼성전자주식회사", "발명자": "조백환"}}
{"patent_id": "10-2014-0019265", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "의료 영상을 수신하는 영상 입력부와,상기 의료 영상 내에서 병변후보를 검출하는 병변후보 검출기와,상기 의료 영상 내에서 해부학적 객체들을 검출하는 주변 객체 검출기와,상기 병변후보를 상기 병변후보의 위치와 상기 해부학적 객체의 위치 사이의 관계정보를 포함하는 해부학적 맥락정보에 기초하여 검증하는 병변후보 검증기와,상기 검증결과에 기초하여 상기 병변후보 중 거짓양성 병변후보를 제거하는 거짓양성 제거기를 포함하는, 의료 영상 내 거짓양성 병변후보 제거 시스템."}
{"patent_id": "10-2014-0019265", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 의료 영상은 인체의 유방을 초음파 또는 X-선을 이용하여 촬영한 유방 영상이며,상기 주변 객체 검출기는 상기 유방 영상으로부터, 상기 해부학적 객체로서 피부, 지방, 유방실질, 근육, 뼈 중적어도 하나를 검출하고,상기 병변후보 검증기는 상기 병변후보와 상기 유방 영상 내에서 검출된 상기 피부, 지방, 유방실질, 근육, 뼈중 적어도 하나와의 위치 관계를 포함하는 해부학적 맥락에 기초하여 검증하는, 의료 영상 내 거짓양성 병변후보 제거 시스템."}
{"patent_id": "10-2014-0019265", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 병변후보 검출기는, 하르 피처 검출(Harr feature detection), 디포머블 파트 모델(deformable part model, DPM), 또는 딥 러닝(Deep Learning) 중 적어도 하나를 이용하여 상기 의료 영상으로부터 병변후보를 검출하는, 의료 영상 내 거짓양성 병변후보 제거 시스템."}
{"patent_id": "10-2014-0019265", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 주변 객체 검출기는, 상기 의료 영상으로부터 상기 해부학적 객체들 각각을 개별적으로 검출하는 복수의 개별 객체 검출기를 포함하는, 의료 영상 내 거짓양성 병변후보 제거 시스템."}
{"patent_id": "10-2014-0019265", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4 항에 있어서,상기 복수의 개별 객체 검출기 각각은, 딥 러닝(deep learning), 슬라이딩 윈도 기법, 또는 수퍼픽셀 기법을 이용하는, 의료 영상 내 거짓양성 병변후보 제거 시스템."}
{"patent_id": "10-2014-0019265", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서,상기 주변 객체 검출기는, 공개특허 10-2015-0098119-2-상기 의료 영상으로부터 상기 해부학적 객체들을 한꺼번에 검출하는 단일 객체 검출기를 포함하는, 의료 영상내 거짓양성 병변후보 제거 시스템."}
{"patent_id": "10-2014-0019265", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서,상기 단일 객체 검출기는, 딥러닝 기법, 슬라이딩 윈도우(sliding window) 기법 또는 수퍼픽셀(superpixel) 기법을 이용하는, 의료 영상 내 거짓양성 병변후보 제거 시스템."}
{"patent_id": "10-2014-0019265", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 6 항에 있어서,상기 단일 객체 검출기는, 상기 의료 영상으로의 전체 혹은 일부로부터 복수의 피처 맵(feature map)들을 추출하고, 추출된 상기 피처 맵들 각각에 대응하는 해부학적 객체를 할당하며, 특정 해부학적 객체가 할당된 피처 맵의 상기 의료 영상 내 위치를 할당된 특정 해부학적 객체로 라벨링하는, 의료 영상 내 거짓양성 병변후보 제거 시스템."}
{"patent_id": "10-2014-0019265", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1 항에 있어서,상기 병변후보 검증기는,서포트 벡터 머신(support vector machine, SVM), 인공 지능 네트워크(artificial neural network, ANN), 딥러닝 기법 및 베이즈 네트워크(Bayesian Network) 중 적어도 하나의 기법을 이용하는, 의료 영상 내 거짓양성병변후보 제거 시스템."}
{"patent_id": "10-2014-0019265", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 1 항에 있어서,상기 해부학적 맥락정보는,\"인체의 특정 부위는 미리 정의된 해부학적 객체들을 가진다\", \"인체의 특정 부위에서, 서로 다른 해부학적 객체들은 미리 정의된 위치관계를 가진다\", 및 \"동일한 해부학적 객체들은 서로 모여서 존재한다\"라는 상기 해부학적 객체에 관련된 도메인 지식(domain knowledge)과,\"특정 병변후보는 인체의 특정 부위 중 특정 해부학적 객체들 내에만 존재한다\"라는 상기 병변후보에 관련된 도메인 지식을포함하는, 의료 영상 내 거짓양성 병변후보 제거 시스템."}
{"patent_id": "10-2014-0019265", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 10 항에 있어서,상기 해부학적 맥락정보는,상기 병변후보 및 상기 해부학적 객체의 검출정보로부터 추출되는 자체정보를 포함하며,상기 자체정보는 신뢰도(confidence level), 밝기, 질감, 및 형상에 관한 정보들 중 적어도 하나를 포함하는,의료 영상 내 거짓양성 병변후보 제거 시스템."}
{"patent_id": "10-2014-0019265", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 10 항에 있어서,상기 해부학적 맥락정보는,상기 병변후보 및 상기 해부학적 객체의 검출정보들 사이의 상관관계로부터 추출되는 관계정보를 포함하며,상기 관계정보는 상기 병변후보와 상기 해부학적 객체 사이의 거리, 상기 병변후보와 상기 해부학적 객체 사이공개특허 10-2015-0098119-3-의 상대적인 위치, 또는 상기 병변후보와 상기 해부학적 객체 사이의 밝기, 질감 또는 형상의 유사한 정도에 관한 정보들 중 적어도 하나를 포함하는, 의료 영상 내 거짓양성 병변후보 제거 시스템."}
{"patent_id": "10-2014-0019265", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 10 항에 있어서,상기 해부학적 맥락정보는,미리 구축된 학습데이터로부터 획득된, 상기 의료 영상 내에서 상기 병변후보가 존재하는 위치의 확률분포 정보를 더 포함하는, 의료 영상 내 거짓양성 병변후보 제거 시스템."}
{"patent_id": "10-2014-0019265", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 10 항에 있어서,상기 의료 영상이 동영상 중의 연속적인 2차원 프레임들 중 하나 또는 3차원 영상의 단면들 중 하나인 경우,상기 해부학적 맥락정보는, 인접 프레임 또는 인접 단면에서 획득된 상기 병변후보 또는 상기 해부학적 객체의위치 정보를 포함하는 인접 영상 정보를 더 포함하는, 의료 영상 내 거짓양성 병변후보 제거 시스템."}
{"patent_id": "10-2014-0019265", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "의료 영상을 수신하는 영상 입력 단계와,상기 의료 영상 내에서 병변후보를 검출하는 병변후보 검출 단계와,상기 의료 영상 내에서 해부학적 객체들을 검출하는 주변 객체 검출 단계와,상기 병변후보를 상기 병변후보의 위치와 상기 해부학적 객체의 위치 사이의 관계정보를 포함하는 해부학적 맥락정보에 기초하여 검증하는 병변후보 검증 단계와,상기 검증결과에 기초하여 상기 병변후보 중 거짓양성 병변후보를 제거하는 거짓양성 제거 단계를포함하는, 의료 영상 내 거짓양성 병변후보 제거 방법."}
{"patent_id": "10-2014-0019265", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 15 항에 있어서,상기 의료 영상은 인체의 유방을 초음파 또는 X-선을 이용하여 촬영한 유방 영상이며,상기 주변 객체 검출 단계는 상기 유방 영상으로부터, 상기 해부학적 객체로서 피부, 지방, 유방실질, 근육, 뼈중 적어도 하나를 검출하고,상기 병변후보 검증 단계는 상기 병변후보와 상기 유방 영상 내에서 검출된 상기 피부, 지방, 유방실질, 근육,뼈 중 적어도 하나와의 위치 관계를 포함하는 해부학적 맥락에 기초하여 검증하는,의료 영상 내 거짓양성 병변후보 제거 방법."}
{"patent_id": "10-2014-0019265", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 15 항에 있어서,상기 병변후보 검출 단계는, 하르 피처 검출(Harr feature detection), 디포머블 파트 모델(deformable part model, DPM), 또는 딥 러닝 기법 중 적어도 하나를 이용하여 상기 의료 영상으로부터 병변후보를 검출하는, 의료 영상 내 거짓양성 병변후보제거 방법."}
{"patent_id": "10-2014-0019265", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 15 항에 있어서,상기 주변 객체 검출 단계는, 공개특허 10-2015-0098119-4-상기 의료 영상으로부터 상기 해부학적 객체들 각각을 개별적으로 검출하는 복수의 개별 객체 검출 단계를 포함하는, 의료 영상 내 거짓양성 병변후보 제거 방법."}
{"patent_id": "10-2014-0019265", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 18 항에 있어서,상기 복수의 개별 객체 검출 단계 각각은, 딥 러닝 기법, 슬라이딩 윈도우 기법, 수퍼픽셀 기법 등을 이용하는,의료 영상 내 거짓양성 병변후보 제거 방법."}
{"patent_id": "10-2014-0019265", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 15 항에 있어서,상기 주변 객체 검출 단계는, 상기 의료 영상으로부터 상기 해부학적 객체들을 한꺼번에 검출하는 단일 객체 검출 단계를 포함하는, 의료 영상 내 거짓양성 병변후보 제거 방법."}
{"patent_id": "10-2014-0019265", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제 20 항에 있어서,상기 단일 객체 검출 단계는, 딥 러닝 기법, 슬라이딩 윈도우(sliding window) 기법 또는 수퍼픽셀(superpixel)기법을 이용하는, 의료 영상 내 거짓양성 병변후보 제거 방법."}
{"patent_id": "10-2014-0019265", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제 20 항에 있어서,상기 단일 객체 검출 단계는, 상기 의료 영상의 전체 혹은 일부부터 복수의 피처 맵(feature map)들을 추출하는 단계, 추출된 상기 피처 맵들 각각에 대응하는 해부학적 객체를 할당하는 단계, 특정 해부학적 객체가 할당된 피처 맵의 상기 의료 영상 내 위치를 할당된 특정 해부학적 객체로 라벨링하는 단계를포함하는, 의료 영상 내 거짓양성 병변후보 제거 방법."}
{"patent_id": "10-2014-0019265", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제 15 항에 있어서,상기 병변후보 검증 단계는,서포트 벡터 머신(support vector machine, SVM), 인공 지능 네트워크(artificial neural network, ANN), 베이즈 네트워크(Bayesian Network) 중 적어도 하나의 기법을 이용하는, 의료 영상 내 거짓양성 병변후보 제거방법."}
{"patent_id": "10-2014-0019265", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제 15 항에 있어서,상기 해부학적 맥락정보는,\"인체의 특정 부위는 미리 정의된 해부학적 객체들을 가진다\", \"인체의 특정 부위에서, 서로 다른 해부학적 객체들은 미리 정의된 위치관계를 가진다\", 및 \"동일한 해부학적 객체들은 서로 모여서 존재한다\"라는 상기 해부학적 객체에 관련된 도메인 지식(domain knowledge)과,\"특정 병변후보는 인체의 특정 부위 중 특정 해부학적 객체들 내에만 존재한다\"라는 상기 병변후보에 관련된 도메인 지식을공개특허 10-2015-0098119-5-포함하는, 의료 영상 내 거짓양성 병변후보 제거 방법."}
{"patent_id": "10-2014-0019265", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제 24 항에 있어서,상기 해부학적 맥락정보는,상기 병변후보 및 상기 해부학적 객체의 검출정보로부터 추출되는 자체정보를 포함하며,상기 자체정보는 신뢰도, 밝기, 질감, 및 형상에 관한 정보들 중 적어도 하나를 포함하는, 의료 영상 내 거짓양성 병변후보 제거 방법."}
{"patent_id": "10-2014-0019265", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "제 24 항에 있어서,상기 해부학적 맥락정보는,상기 병변후보 및 상기 해부학적 객체의 검출정보들 사이의 상관관계로부터 추출되는 관계정보를 포함하며,상기 관계정보는 상기 병변후보와 상기 해부학적 객체 사이의 거리, 상기 병변후보와 상기 해부학적 객체 사이의 상대적인 위치, 또는 상기 병변후보와 상기 해부학적 객체 사이의 밝기, 질감 또는 형상의 유사한 정도에 관한 정보들 중 적어도 하나를 포함하는, 의료 영상 내 거짓양성 병변후보 제거 방법."}
{"patent_id": "10-2014-0019265", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "제 24 항에 있어서,상기 해부학적 맥락정보는,미리 구축된 학습데이터로부터 획득된, 상기 의료 영상 내에서 상기 병변후보가 존재하는 위치의 확률분포 정보를 더 포함하는, 의료 영상 내 거짓양성 병변후보 제거 방법."}
{"patent_id": "10-2014-0019265", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_28", "content": "제 24 항에 있어서,상기 의료 영상이 동영상 중의 연속적인 2차원 프레임들 중 하나 또는 3차원 영상의 단면들 중 하나인 경우, 상기 해부학적 맥락정보는, 인접 프레임 또는 인접 단면에서 획득된 상기 병변후보 또는 상기 해부학적 객체의위치 정보를 포함하는 인접 영상 정보를 더 포함하는, 의료 영상 내 거짓양성 병변후보 제거 방법.명 세 서기 술 분 야의료 영상의 병변후보 검출에 관련된다. 보다 상세하게는 의료 영상 내 거짓양성 병변후보를 제거하는 기법에 [0001]관련된다.배 경 기 술일반적으로, 컴퓨터 보조 검출(Computer Aided Detection, CAD)은, 의사의 진단을 돕기 위하여 의료 영상에서 [0002]컴퓨터를 이용하여 자동으로 병변을 검출하는 기술이다. 그러나, 현재로서는 영상의 저-화질 및 비-정형성으로인해 CAD 기술의 정확도를 향상시키기가 매우 어렵다.예를 들어, 초음파 영상은 의사에 의해 프로브(probe)의 위치와 각도가 임의로 선택된다. 그러므로 획득되는 초 [0003]음파 영상들은 서로 그 위치와 각도가 일치되어 있지 않아 비-정형적이다. 따라서 이러한 비-정형적인 영상들에대해 단순히 병변을 자동으로 검출하는 알고리즘을 적용하면, 병변 뿐만 아니라 병변이 아닌 단순한 해부학적인요소들까지도 병변으로 오인하여 검출하는 경우가 많았다.공개특허 10-2015-0098119-6-발명의 내용해결하려는 과제의료 영상 내에서 검출된 병변후보를 해부학적 맥락정보를 이용하여 검증함으로써, 거짓양성 병변후보를 제거하 [0004]는 의료 영상 내 거짓양성 병변후보 제거 시스템 및 방법을 제안한다.과제의 해결 수단일 양상에 따른 의료 영상 내 거짓양성 병변후보 제거 시스템은, 의료 영상을 수신하는 영상 입력부와, 상기 의 [0005]료 영상 내에서 병변후보를 검출하는 병변후보 검출기와, 상기 의료 영상 내에서 해부학적 객체들을 검출하는주변 객체 검출기와, 상기 병변후보를 상기 병변후보의 위치와 상기 해부학적 객체의 위치 사이의 관계정보를포함하는 해부학적 맥락정보에 기초하여 검증하는 병변후보 검증기와, 상기 검증결과에 기초하여 상기 병변후보중 거짓양성 병변후보를 제거하는 거짓양성 제거기를 포함할 수 있다.일 실시예에 있어서, 상기 의료 영상은 인체의 유방을 초음파 또는 X-선을 이용하여 촬영한 유방 영상이며, 상 [0006]기 주변 객체 검출기는 상기 유방 영상으로부터, 상기 해부학적 객체로서 피부, 지방, 유방실질, 근육, 뼈 중적어도 하나를 검출하고, 상기 병변후보 검증기는 상기 병변후보와 상기 유방 영상 내에서 검출된 상기 피부,지방, 유방실질, 근육, 뼈 중 적어도 하나와의 위치 관계를 포함하는 해부학적 맥락에 기초하여 검증할 수있다.다른 실시예에 있어서, 상기 병변후보 검출기는, 하르 피처 검출(Harr feature detection), 디포머블 파트 모델 [0007](deformable part model, DPM), 또는 딥 러닝(Deep Learning) 중 적어도 하나를 이용하여 상기 의료 영상으로부터 병변후보를 검출할 수 있다.또 다른 실시예에 있어서, 상기 주변 객체 검출기는, 상기 의료 영상으로부터 상기 해부학적 객체들 각각을 개 [0008]별적으로 검출하는 복수의 개별 객체 검출기를 포함할 수 있다.또 다른 실시예에 있어서, 상기 복수의 개별 객체 검출기 각각은, 딥 러닝, 슬라이딩 윈도 기법, 또는 수퍼픽셀 [0009]기법을 이용할 수 있다.또 다른 실시예에 있어서, 상기 주변 객체 검출기는, 상기 의료 영상으로부터 상기 해부학적 객체들을 한꺼번에 [0010]검출하는 단일 객체 검출기를 포함할 수 있다.또 다른 실시예에 있어서, 상기 단일 객체 검출기는, 딥러닝 기법, 슬라이딩 윈도우 기법 또는 수퍼픽셀 기법을 [0011]이용할 수 있다.또 다른 실시예에 있어서, 상기 단일 객체 검출기는, 상기 의료 영상으로의 전체 혹은 일부로부터 복수의 피처 [0012]맵(feature map)들을 추출하고, 추출된 상기 피처 맵들 각각에 대응하는 해부학적 객체를 할당하며, 특정 해부학적 객체가 할당된 피처 맵의 상기 의료 영상 내 위치를 할당된 특정 해부학적 객체로 라벨링할 수 있다.또 다른 실시예에 있어서, 상기 병변후보 검증기는, 서포트 벡터 머신(support vector machine, SVM), 인공 지 [0013]능 네트워크(artificial neural network, ANN), 딥 러닝 기법 및 베이즈 네트워크(Bayesian Network) 중 적어도 하나의 기법을 이용할 수 있다.또 다른 실시예에 있어서, 상기 해부학적 맥락정보는, \"인체의 특정 부위는 미리 정의된 해부학적 객체들을 가 [0014]진다\", \"인체의 특정 부위에서, 서로 다른 해부학적 객체들은 미리 정의된 위치관계를 가진다\", 및 \"동일한 해부학적 객체들은 서로 모여서 존재한다\"라는 상기 해부학적 객체에 관련된 도메인 지식(domain knowledge)과, \"특정 병변후보는 인체의 특정 부위 중 특정 해부학적 객체들 내에만 존재한다\"라는 상기 병변후보에 관련된도메인 지식을 포함할 수 있다.또 다른 실시예에 있어서, 상기 해부학적 맥락정보는, 상기 병변후보 및 상기 해부학적 객체의 검출정보로부터 [0015]추출되는 자체정보를 포함하며, 상기 자체정보는 신뢰도(confidence level), 밝기, 질감, 및 형상에 관한 정보들 중 적어도 하나를 포함할 수 있다.또 다른 실시예에 있어서, 상기 해부학적 맥락정보는, 상기 병변후보 및 상기 해부학적 객체의 검출정보들 사이 [0016]의 상관관계로부터 추출되는 관계정보를 포함하며, 상기 관계정보는 상기 병변후보와 상기 해부학적 객체 사이의 거리, 상기 병변후보와 상기 해부학적 객체 사이의 상대적인 위치, 또는 상기 병변후보와 상기 해부학적 객공개특허 10-2015-0098119-7-체 사이의 밝기, 질감 또는 형상의 유사한 정도에 관한 정보들 중 적어도 하나를 포함할 수 있다.또 다른 일 실시예에 있어서, 상기 해부학적 맥락정보는, 미리 구축된 학습데이터로부터 획득된, 상기 의료 영 [0017]상 내에서 상기 병변후보가 존재하는 위치의 확률분포 정보를 더 포함할 수 있다.또 다른 일 실시예에 있어서, 상기 의료 영상이 동영상 중의 연속적인 2차원 프레임들 중 하나 또는 3차원 영상 [0018]의 단면들 중 하나인 경우, 상기 해부학적 맥락정보는, 인접 프레임 또는 인접 단면에서 획득된 상기 병변후보또는 상기 해부학적 객체의 위치 정보를 포함하는 인접 영상 정보를 더 포함할 수 있다.또한, 다른 양상에 따라 의료 영상 내 거짓양성 병변후보 제거 방법은, 의료 영상을 수신하는 영상 입력 [0019]단계와, 상기 의료 영상 내에서 병변후보를 검출하는 병변후보 검출 단계와, 상기 의료 영상 내에서 해부학적객체들을 검출하는 주변 객체 검출 단계와, 상기 병변후보를 상기 병변후보의 위치와 상기 해부학적 객체의 위치 사이의 관계정보를 포함하는 해부학적 맥락정보에 기초하여 검증하는 병변후보 검증 단계와, 상기 검증결과에 기초하여 상기 병변후보 중 거짓양성 병변후보를 제거하는 거짓양성 제거 단계를 포함할 수 있다.상술한 양상들 및 실시예들, 그리고 그 이외의 다른 양상들이나 실시예들에 대해 아래의 상세한 설명에서 더 발 [0020]견될 수 있다.발명의 효과의료 영상의 병변 오인 검출을 감소시키고, 의사의 최종 진단의 정확도를 향상시키는 의료 영상 내 거짓양성 병 [0021]변후보 제거 시스템 및 방법을 구현할 수 있는 효과가 있다.도면의 간단한 설명도 1은 일반적인 컴퓨터 보조 진단 시스템의 구성을 예시한 블록도, [0022]도 2는 유방 초음파 영상 내의 병변후보 및 해부학적 구조를 예시한 도면,도 3은 의료 영상 내 거짓양성 병변후보 제거 시스템의 일 실시예를 나타낸 블록도,도 4는 도 3의 실시예에서, 주변 객체 검출기의 일 실시예를 나타낸 블록도,도 5는 도 4의 주변 객체 검출기의 피처 맵의 예들을 보여주는 도면,도 6은 도 3의 실시예에서, 주변 객체 검출기의 다른 실시예를 설명하기 위한 도면,도 7은 도 3의 실시예에서, 원본 영상에서 검출된 병변후보 및 해부학적 객체들이 표시된 합성 영상의 예를 설명하기 위한 도면,도 8은 도 3의 실시예에서, 병변후보 검증기의 일 실시예를 더 상세히 나타낸 블록도,도 9는 도 3의 실시예에서, 병변후보 검증기에 의해 이용되는 맥락정보의 일 실시예를 나타낸 블록도,도 10은 도 9의 맥락정보의 예 중에서, 확률정보의 일 실시예를 나타낸 그래프,도 11은 의료 영상 내 거짓양성 병변후보 제거 방법의 일 실시예를 나타낸 흐름도,도 12는 의료 영상 내 거짓양성 병변후보 제거 방법의 다른 실시예를 나타낸 흐름도,도 13은 의료 영상 내 거짓양성 병변후보 제거 방법의 또 다른 실시예를 나타낸 흐름도이다.발명을 실시하기 위한 구체적인 내용의료 영상 내 거짓양성 병변후보 제거 시스템 및 방법의 실시예에 의해, CAD(Computer Aided Detection 또는 [0023]Computer Aided Diagnosis) 시스템의 병변후보 검출 기술이 제공된다. 이 기술은 예컨대, 유방 초음파 촬영술에의해 생성되는 초음파 영상 또는 X-선 유방 의료 영상에서 병변후보를 검출하는 경우에 이용될 수 있다.본 문서에서, \"해부학적 객체\"라는 용어는 특정한 해부학적인 성질이나 기능에 따라 구별될 수 있는 요소를 지 [0024]칭할 수 있다. 예컨대 유방의 경우, 해부학적 객체는 피부(skin), 피하지방(subcutaneous fat), 유방실질(glandular tissue), 후방지방(retromammary fat), 대흉근(pectoralis muscle), 갈비뼈(rib) 등을 포함할 수있다.\"병변후보영역(lesion candidate region/portion)\"라 함은, CAD에 의해 검출된, 병변영역(lesion)으로 진단될 [0025]공개특허 10-2015-0098119-8-가능성이 있는 의료 영상 내의 특정 영역을 의미한다. CAD에 의해 검출된 병변후보영역이 실제로 병변영역인지여부는 의사에 의하여 판단될 것이다.의료 영상 내 거짓양성 병변후보 제거 시스템 및 방법은, 의료 영상 내에서 검출된 병변후보 병변후보를 해부학 [0026]적 맥락정보를 이용하여 검증함으로써, 거짓양성(false positive, FP) 병변후보를 제거한다. 다시 말해서, 먼저영상에서 병변후보 및 해부학적 객체가 검출된다. 그런 다음, 검출된 병변후보 및 해부학적 객체의 위치 및 위치 관계가 해부학적 맥락정보에 기초하여 검증된다. 마지막으로, 검증 결과에 기초하여, 병변후보 중에서 거짓양성 병변후보가 제거된다. 이에 따라 병변후보 검출의 효율성을 향상시킬 수 있다.여기서 \"거짓양성 병변후보\"라 함은 영상 내에서 검출된 병변후보들 중에서 의학적으로 진단할 가치가 있는 병 [0027]변후보가 아닌 잘못 검출된 병변후보를 의미한다. 예를 들어, 병변후보가 지방과 같은 특정 해부학적 객체라고판단되는 경우, 이 병변후보는 거짓양성일 가능성이 크다. 다른 예를 들어, 영상이 유방 영상인 경우에, 병변후보가 의학적으로 유방암과 관련된 종양이나 낭종이 발견되지 않는 위치에 존재한다고 판단되면, 이 병변후보는거짓양성일 가능성이 크다.의료 영상이 초음파 또는 X-선에 의한 유방 영상일 때, 이 영상으로부터, 유방암의 낭종 등의 병변후보, 및 피 [0028]부, 피하지방, 유방실질, 후방지방, 대흉근육, 갈비뼈 등의 해부학적 객체를 검출할 수 있다.병변후보의 검출은 영상 내에서 자동으로 병변후보를 발견하기 위한 다양한 알고리즘을 이용하는 기법을 통하여 [0029]수행될 수 있다. 예컨대, 하르 피처 검출 기법(Haar feature detection), 디포머블 파트 모델(deformable partmodel), 딥 러닝(Deep Learning) 등의 기법을 이용할 수 있다.해부학적 객체의 검출은, 영상으로부터 복수의 해부학적 객체들 각각을 개별적으로 검출함으로써 수행될 수 있 [0030]다. 이 경우, CDBN(Convolutional Deep Belief Network) CNN(Convolutional Neural Network)등과 같은 여러 가지 딥 러닝(Deep Learning) 기법들 중 하나를 이용할 수 있다. 또한, 피부를 검출하는 피부 검출기, 지방을 검출하는 지방 검출기, 유방실질을 검출하는 유방실질 검출기, 근육을 검출하는 근육 검출기 등과 같이 각각의 해부학적 객체에 대해 별도의 검출기를 채용할 수도 있다.한편, 해부학적 객체의 검출은 하나의 유방 초음파 영상으로부터 복수의 해부학적 객체들을 한꺼번에 검출함으 [0031]로써 수행될 수도 있다. 이 경우, 딥 러닝(deep learning) 기법, 슬라이딩 윈도우(sliding window) 기법 또는수퍼픽셀(superpixel) 기법을 이용할 수 있다. 먼저, 유방 초음파 영상으로부터 여러 가지 피처 맵(featuremap)을 추출하고, 추출된 피처 맵들을 대응하는 해부학적 객체들에 할당하며, 특정 해부학적 객체가 할당된 피처 맵들의 영상 내 위치를 특정 해부학적 객체로 라벨링할 수 있다.이렇게 검출된 피부, 지방, 근육, 뼈 등의 해부학적 객체들은 각 해부학적 객체들의 위치 관계에 관한 해부학적 [0032]맥락정보(context)에 기초하여 검증될 수 있다.해부학적 맥락정보(context)는 병변후보 및 해부학적 객체와 관련된 도메인 지식(domain knowledge)을 포함할 [0033]수 있다. 또한 해부학적 맥락정보는 병변후보 및 해부학적 객체와 직접 연관된 자체정보를 포함할 수 있다. 그리고 해부학적 맥락정보는 병변후보와 해부학적 객체 사이의 관계와 연관된 관계정보를 포함할 수 있다. 더 나아가 해부학적 맥락은, 특정 인체 부위의 의료 영상 내에서 병변후보 및/또는 해부학적 객체가 존재할 위치의확률분포 정보를 포함할 수 있다. 이러한 확률분포 정보는 미리 구축된 학습데이터에 기초하여 획득될 수 있다.또한 해부학적 맥락은, 의료 영상이 동영상 중의 연속적인 2차원(2D) 프레임들 중 하나 또는 3차원(3D) 영상의단면들 중 하나인 경우, 인접 프레임 또는 인접 단면에서 획득된 해부학적 객체의 위치 정보와 같은 인접 영상정보를 포함할 수 있다.아래에서 의료 영상 내 거짓양성 병변후보 제거 시스템 및 방법이 도면들을 참조하여 예시로서 기술된다. [0034]이하에서, 2차원 유방 초음파 영상을 예로 들어, 의료 영상 내 거짓양성 병변후보 제거 시스템 및 방법의 실시 [0035]예를 설명한다. 그러나, 의료 영상의 범위가 유방 초음파 영상으로 제한될 필요는 없다. 예를 들어, 의료 영상은 유방 또는 그 외의 다른 부위에 대한 초음파 또는 X선 영상일 수 있고, 2차원 영상 또는 3차원 영상일 수 있다.도 1은 일반적인 컴퓨터 보조 진단 시스템(CAD)의 구성을 예시하는 블록도이다. [0036]도 1을 참조하면, 일반적으로 컴퓨터 보조 진단 시스템(10)은 영상 획득부(12), 병변 검출부(14), 및 병변 진단 [0037]부(16)를 포함한다. 영상 획득부(12)는 예컨대 환자의 유방에 대한 초음파 진단 영상을 촬영하고, 촬영된 영상들을 저장하는 의료 영상 시스템으로부터 영상을 수신할 수 있다. 병변 검출부(14)는 영상 획득부(12)에서 수신공개특허 10-2015-0098119-9-된 영상에 대해 병변 검출 알고리즘을 적용함으로써, 병변후보의 존재 여부를 판단하고, 존재하는 병변후보의위치를 검출한다. 병변 진단부(16)는 검출된 병변후보의 악성 여부를 판단할 수 있다. 컴퓨터 보조 진단 시스템(10)은 검출된 병변후보를 영상과 함께 진단결과로서 디스플레이를 통해 표시할 수 있다.이와 같은 종래의 CAD 시스템에서, 특히 병변후보를 검출하는 병변 검출부(14)에 있어서, 예컨대 초음파 영상의 [0038]경우 화질이 좋지 않고 비정형적이라는 것 때문에 다수의 거짓양성 병변후보들이 검출되는 문제가 있었다. 거짓양성 병변후보는 검출 오류이다. 그러므로, 진단 성능 및 효율을 향상시키기 위해서 병변 검출부(14)에서의 검출 오류를 감소시키는 것, 즉 거짓양성을 감소시키는 것이 요구된다.도 2는 유방 초음파 영상 내의 병변후보 및 해부학적 구조를 예시하는 도면이다. [0039]도 2를 참조하면, 인체의 유방을 촬영한 2차원 초음파 영상(10)이 예시된다. 도시된 영상(10)은 피부(11), 피하 [0040]지방(12), 유방실질(13), 후방지방(14), 대흉균(15), 및 갈비뼈(16)의 해부학적 객체들을 포함한다. 또한 도시된 영상(10)은 낭종이나 악셩 병변과 같은 병변후보(21, 22)를 포함한다. 이들 해부학적 객체들은 최상단의 피부(11)로부터 차례로 아래쪽으로 피하지방(12), 유방실질(13), 후방지방(14), 대흉균(15), 및 갈비뼈(16)가 배치되는 해부학적 구조를 보여준다. 그리고 병변후보(21, 22)는 영상 내의 다양한 위치에서 발견될 수 있다.도 3은 의료 영상 내 거짓양성 병변후보 제거 시스템의 일 실시예를 나타낸 블록도이다. [0041]도 3을 참조하면, 거짓양성 병변후보 제거 시스템(30)은 영상 입력부(31), 병변후보 검출기(33), 주변 객체 검 [0042]출기(35), 병변후보 검증기(37), 및 거짓양성 제거기(39) 등의 컴포넌트를 포함할 수 있다.영상 입력부(31)는 의료 영상을 수신하는 컴포넌트이다. 의료 영상은 예컨대, 도 2에 예시되어 있는 바와 같은, [0043]인체의 유방을 초음파를 이용하여 촬영한 유방 초음파 영상일 수 있다. 이러한 의료 영상은 초음파 또는 X선 등을 이용하여 인체의 특정 부위를 촬영하는 의료 영상 진단 장치 또는 촬영 장치, 또는 이러한 영상들을 저장하고 있는 저장 장치로부터 입력될 수 있다.병변후보 검출기(33)는 의료 영상을 분석하여 병변후보의 존재 여부 및 존재하는 병변후보의 위치를 검출하는 [0044]컴포넌트이다. 병변후보 검출기(33)는 병변후보의 검출을 위해, 예컨대, 하르 피처 검출(Haar featuredetection), 디포머블 파트 모델(deformable part model), 및/또는 딥 러닝 등과 같은 기법을 이용할 수 있다.검출된 병변후보 각각에 병변후보 검출기(33)에 의해 신뢰도(confidence level)를 나타내는 값(score)이 대응될수 있다. 이 신뢰도 값은 각각의 병변후보가 실제로 병변이라고 판단될 수 있는 가능성을 수치로 나타낸 것이라고 볼 수 있다.주변 객체 검출기(35)는 의료 영상 내에서 복수의 해부학적 객체들을 검출할 수 있다. 주변 객체 검출기(35)는, [0045]의료 영상이 유방 초음파 영상(10)인 경우, 해부학적 객체로서 피부, 지방, 유방실질, 근육, 뼈 등을 검출할 수있다. 주변 객체 검출기(35)는 모든 해부학적 객체들을 한꺼번에 검출하는 하나의 단일 객체 검출기로 이루어질수 있고, 또는 각각의 해부학적 객체를 개별적으로 검출하는 복수의 개별 객체 검출기들로 이루어질 수 있다.주변 객체 검출기(35)는 도 4 내지 도 6에 도시된 바를 참조하여 아래에서 더 상세히 설명된다.병변후보 검증기(37)는, 병변후보 검출기(33)에 의해 검출된 병변후보 및 주변 객체 검출기(35)에 의해 검출된 [0046]해부학적 객체를, 해부학적 맥락에 관련된 정보를 포함하는 맥락정보(370)에 기초하여 검증할 수 있다. 이경우, 병변후보 검증기(37)는, 예컨대, SVM(support vector machine), ANN(artificial neural network), 및 베이즈 네트워크(Bayesian Network) 등과 같은 기계학습 및 통계적 방법을 이용할 수 있다. 병변후보 검증기(37)는 도 8에 도시된 바를 참조하여 아래에서 더 상세히 설명된다.맥락정보(370)는 의료 영상이 포함하고 있는 해부학적 부위의 해부학적인 맥락을 나타내는 맥락정보를 포함할 [0047]수 있다. 맥락정보는 특히 병변후보 및 해부학적 객체들 각자의 위치 및 그들 사이의 상호 위치 관계 등을 일반적으로 나타내는 도메인 지식 등을 포함할 수 있다. 예를 들어, 병변후보 검증기(37)는, 의료 영상이 유방 초음파 영상(10)인 경우, 검출된 병변후보, 피부, 지방, 유방실질, 근육, 뼈 등의 각자의 위치 상호 위치 관계 등을나타내는 도메인 지식을 이용할 수 있다. 맥락정보(370)는 예컨대 컴퓨터 판독가능 스토리지 매체 상에 저장될수 있다. 맥락정보(370)는 도 9에 도시된 바를 참조하여 아래에서 더 상세히 설명된다.예를 들어, 병변후보 검출기(33)는 DPM 기법을 이용하여 영상을 분석한 후 영상 내의 하나의 특정 영역을 \"신뢰 [0048]도 85%의 병변후보\"라고 결정함으로써 병변후보를 검출한다고 가정하자. 그리고 주변 객체 검출기(35)는 슬라이딩 윈도우 기법을 이용하여 영상을 분석한 후 영상 내의 다른 하나의 특정 영역을 \"신뢰도 95%의 피하지방\" 이라고 결정함으로써 \"피하지방\"이라는 해부학적 객체를 검출한다고 가정하자. 주변 객체 검출기(35)는, 같은 방공개특허 10-2015-0098119-10-식으로, \"피부\", \"유방실질\", \"후방지방\", \"대흉근\" 등과 같이 다른 해부학적 객체들을 검출한다고 가정하자. 이 예에서, 병변후보 검증기(37)는 검출된 \"병변후보\"가 실제로 병변인지 아닌지를 해부학적 맥락정보를 이용하 [0049]여 검증할 수 있다. 예컨대, 병변후보 검증기(37)는 병변후보로서 검출된 특정 영역(이하 \"A 영역\"이라고 하자)이 해부학적 객체들이 존재하는 위치와 어떠한 관계에 있는지를 SVM 기법을 이용하여 검증할 수 있다. 다시말해서 병변후보 검증기(37)는 A 영역이 다른 객체들과 비교할 때 동일 위치에 존재하는지, 근접하는지, 또는멀리 떨어져 있는지 등과 같은 해부학적 맥락 정보를 참조할 수 있다. 이에 따라 병변후보 검증기(37)는 A 영역이 실제로 병변으로서 판단될 가능성이 큰지 아니면 실제로 병변으로서 판단될 가능성이 작은 거짓양성인지 여부를 판단할 수 있다.거짓양성 제거기(39)는 병변후보 검증기(37)에 의해 검증된 결과를 수신할 수 있다. 이에 따라 거짓양성 제거기 [0050]는 병변후보 검출기(33)에 의해 검출된 병변후보 중에서 병변후보 검증기(37)에 의해 거짓양성으로 판정된 병변후보들을 제거한 후 원본 영상(10)에 포함시켜 출력할 수 있다. 그 결과는 도 7을 참조하여 아래에서 더 상세히기술될 것이다.도 4는 도 3의 실시예에서, 주변 객체 검출기의 일 실시예를 나타낸 블록도이다. [0051]도 4를 참조하면, 도 3의 주변 객체 검출기(31)의 일 실시예로서, 영상 내의 모든 해부학적 객체들을 한꺼번에 [0052]검출하는 단일 검출기(40)가 도시된다. 단일 검출기(40)는 슬라이딩 윈도우 기법을 이용하는 경우를 예시한다.도시된 바와 같이, 단일 검출기(40)는 HOG(histogram of gradient) 특징점, 즉 피처 맵(feature map)을 이용하 [0053]여 해부학적 객체들을 검출할 수 있다. 이를 위하여, 단일 검출기(40)는 피처 맵 추출부(41), 피처 맵 할당부(43), 및 영상 라벨링부(45)를 포함할 수 있다. 피처 맵 추출부(41)는 영상으로부터 적어도 하나의 피처 맵을추출한다. 피처 맵 할당부(43)는 추출된 피처 맵을 대응하는 해부학적 객체에 할당한다. 이를 위하여, 추출된피처 맵은 이미 저장되어 있는 다수의 피처 맵들과 비교될 수 있다. 이미 저장되어 있는 다수의 피처 맵들 중에서 일치하는 것이 존재하면, 그 일치하는 피처 맵이 대응되어 있는 해부학적 객체에 추출된 피처 맵을 대응시킬수 있다. 영상 라벨링부(45)는 특정 해부학적 객체가 할당된 피처 맵의 영상 내 위치를 그 특정 해부학적 객체로 라벨링할 수 있다. 이에 따라 영상 내의 피처 맵의 위치는 특정 해부학적 객체로서 검출될 수 있다.이 외에도 단일 검출기는 수퍼픽셀 기법을 이용하여 구성될 수 있다. 이 경우, 영상 내의 픽셀들을 수퍼픽셀로 [0054]재한정한 후, 각각의 수퍼픽셀에 대해 강도(intensity), 텍스처, 스파스 코딩(sparse coding), DBN(deepbelief network)를 이용한 특징점 등의 영상 정보를 이용하는 분류기(classifier) 형식으로 구성 가능하다.도 5는 도 4의 주변 객체 검출기의 피처 맵의 예들을 보여주는 도면이다. [0055]도 5를 참조하면, 낭종의 피처 맵(51), 다른 낭종의 피처 맵(53), 악성 병변의 피처 맵(55), 유방실질의 피처 [0056]맵(57)을 포함하는 피처 맵 그룹(50)이 예시된다. 이러한 피처 맵 그룹(50)은 단지 예시에 불과하며, 더 다양한병변 종류 및/또는 해부학적 구조를 식별하기 위한 다양한 피처 맵들이 더 포함될 수 있음은 자명하다. 이러한피처 맵들은 도 3의 병변후보 검출기(33)에 의해서도 유사하게 이용될 수 있다.도 6은 도 3의 실시예에서, 주변 객체 검출기의 다른 실시예를 설명하기 위한 도면이다. [0057]도 6을 참조하면, 도 3의 주변 객체 검출기(35)의 예로서, 복수의 개별 객체 검출기들(61, 63, 65, 67)을 포함 [0058]하는 멀티 검출기(60)가 예시된다. 피부 객체 검출기(61)는 원본 영상(10)으로부터 피부(11) 영역만을검출한다. 피하지방 객체 검출기(63)는 원본 영상(10)으로부터 피하지방(12) 영역만을 검출한다. 유방실질 객체검출기(65)는 원본 영상(10)으로부터 유방실질(13) 영역만을 검출할 수 있다. 대흉근 객체 검출기(67)는 원본영상(10)으로부터 대흉근(15) 영역만을 검출할 수 있다.이 경우, 복수의 개별 객체 검출기(61, 63, 65, 67) 각각은, 다양한 딥 러닝(Deep Learning) 기법들 중 하나를 [0059]이용하여 구성될 수 있다. 예컨대, DHN(Deep Hierachical Network), CDBN(Convolutional Deep BeliefNetwork), DDN(Deconvolutional Deep Network) 등을 이용할 수 있다.도 7은 도 3의 실시예에서, 원본 영상에서 검출된 병변후보 및 해부학적 객체들이 표시된 합성 영상의 예를 설 [0060]명하기 위한 도면이다.도 7은 도 3의 거짓양성 제거기(39)가 병변후보 검증기(37)에 의해 검증된 결과에 따라 거짓양성을 제거한 후 [0061]원본 영상(10)에 검출 결과를 포함시켜 출력한 합성 영상의 예이다. 도시된 바와 같이, 원본 영상 중에서 갈비뼈 영역(71), 피하지방 영역(72), 유방실질 영역(73)이 표시되어 있으며, 또한 두 개의 병변후보(74)가 도시되공개특허 10-2015-0098119-11-어 있다. 병변후보(74)는 신뢰도 값이 0.69로 표시되고 나머지 병변후보는 신뢰도 값으로서 0.12가 표시되어 있다.도 8은 도 3의 실시예에서, 병변후보 검증기의 일 실시예를 더 상세히 보여주는 블록도이다. [0062]도 8을 참조하면, 도 3의 병변후보 검증기(37)는 자체정보 추출기(371), 관계정보 추출기(373), 병변 존재확률 [0063]계산기(375), 및 검증처리부(377) 등의 컴포넌트를 포함할 수 있다. 자체정보 추출기(371)는 병변후보 검출기(33)에 의해 검출된 병변후보로부터 병변후보 자체와 연관된 정보, 즉 [0064]병변후보의 자체정보를 추출할 수 있다. 병변후보의 자체정보는 예컨대, 신뢰도 값, 병변후보 영역을 형성하는픽셀의 밝기(또는, 강도)를 나타내는 값, 병변후보 영역의 질감을 나타내는 값, 및/또는 병변후보의 형상을 나타내는 정보 등을 포함할 수 있다. 또한 자체정보 추출기(371)는 주변 객체 검출기(35)에 의해 검출된 해부학적객체들로부터 마찬가지로 해부학적 객체의 자체정보를 추출할 수 있다. 해부학적 객체의 자체정보도 유사하게신뢰도 값, 해부학적 객체 영역을 형성하는 픽셀의 밝기(또는, 강도)를 나타내는 값, 해부학적 객체 영역의 질감을 나타내는 값, 및/또는 해부학적 객체의 형상을 나타내는 정보 등을 포함할 수 있다. 자체정보 추출기(371)에 의해 추출된 자체정보는 맥락정보(370)에 포함될 수 있다.관계정보 추출기(373)는 병변후보 및 해부학적 객체의 검출정보들 사이의 상관관계로부터 추출되는 관계정보를 [0065]포함할 수 있다. 관계정보는 병변후보와 해부학적 객체 사이의 거리, 병변후보와 해부학적 객체 사이의 상대적인 위치, 및/또는 병변후보와 해부학적 객체 사이의 밝기, 질감 또는 형상의 유사한 정도에 관한 정보를 포함할수 있다. 관계정보 추출기(373)에 의해 추출된 관계정보는 맥락정보(370)에 포함될 수 있다.병변 존재확률 계산기(375)는 미리 구축된 학습데이터로부터 특정 병변후보가 특정 해부학적 구조 내에서 존재 [0066]하는 위치의 확률분포 정보를 계산할 수 있다. 병변 존재확률 계산기(375)에 의해 계산된 확률분포 정보는 확률정보로서 맥락정보(370)에 포함될 수 있다.검증 처리부(377)는 맥락정보(370)에 포함된 정보를 이용하여 병변후보 검증기(37)의 검증 기능을 수행하는 컴 [0067]포넌트이다. 즉 자체정보 추출기(371), 관계정보 추출기(373), 및/또는 병변 존재확률 계산기(375)에 의해 획득된 자체정보, 관계정보, 확률정보 등은 맥락정보(370)에 추가된다. 맥락정보(370)는 도 9를 참조하여 아래에서더 설명되는 바와 같이, 도메인 지식, 자체정보, 관계정보, 확률정보, 및/또는 인접 영상정보를 포함할 수있다. 검증 처리부(377)는 맥락정보(370) 내의 도메인 지식, 자체정보, 관계정보, 확률정보, 및/또는 인접 영상정보를 이용하여 특정 병변정보가 거짓양성인지 아닌지를 검증하는 프로세스를 수행할 수 있다.맥락정보(370)는 도메인 지식, 자체정보, 관계정보, 확률정보, 및/또는 인접 영상정보를 포함할 수 있는 맥락정 [0068]보를 저장하는 컴퓨터-판독가능 스토리지 매체로서 병변후보 검증기(37)에 하나의 컴포넌트로서 포함될 수도 있고, 또는 병변후보 검증기(37)의 외부에 있으면서 유선 또는 무선 통신 연결에 의해 데이터 통신 가능하게 연결되어 있는 별도의 외부 컴포넌트일 수 있다. 맥락정보(370)에 저장되어 있는 맥락정보는 도 9에 도시된 바를 참조하여 아래에서 더 상세히 설명된다.도 9는 도 3의 실시예에서, 병변후보 검증기에 의해 이용되는 맥락정보의 일 실시예를 보여주는 블록도이다. [0069]도 9를 참조하면, 맥락정보(370)에 저장되는 해부학적 맥락정보는 해부학적 도메인 지식(3701), 자체정보 [0070](3703), 관계정보(3705), 확률정보(3707), 및/또는 인접 영상정보(3709)를 포함할 수 있다.맥락정보 중 도메인 지식(domain knowledge)(3701)은 영역들 사이의 위치 관계를 나타내는 정보이다. 도메인 지 [0071]식(3701)에는 적어도, \"인체의 특정 부위는 미리 정의된 해부학적 객체들을 가진다\", \"인체의 특정 부위에서,서로 다른 해부학적 객체들은 미리 정의된 위치관계를 가진다\", 및 \"동일한 해부학적 객체들은 서로 모여서 존재한다\"라는 정보와 같은 해부학적 객체와 관련된 일반적인 지식이 포함될 수 있다.예컨대, 유방 초음파 영상의 경우, \"유방의 경우, 피부, 피하지방, 유방실질, 후방지방, 대흉근, 갈비뼈의 해부 [0072]학적 객체들을 가진다\", \"유방의 경우, 피부가 최상층에 위치하고, 피부의 아래에 피하지방이 위치하며, 피하지방 아래에 유방실질이 위치하고, 유방실질 아래에 후방지방이 위치하며, 후방지방 바로 아래에 대흉균이 위치하고, 대흉근 아래에 갈비뼈가 위치한다\"와 같은 해부학적인 위치 정보가 도메인 지식으로서 포함될 수 있다.또한 도메인 지식(3701)에는 병변후보와 관련된 도메인 지식으로서, 예컨대 \"특정 병변후보는 인체의 특정 부위 [0073]중 특정 해부학적 객체들 내에만 존재한다\"라는 정보가 포함될 수 있다.예컨대, 유방 초음파 영상의 경우, \"유방의 경우, 유방암이 촉진가능한 시기에, 유방암 낭종은 유방실질 부위에 [0074]공개특허 10-2015-0098119-12-존재한다\"와 같은 일반적인 의학적인 위치 정보가 포함될 수 있다.또한 맥락정보는 또한 병변후보 및 해부학적 객체의 검출정보로부터 추출되는 자체정보(3703)를 포함할 수 [0075]있다. 자체정보(3703)는 신뢰도(confidence level), 밝기, 질감, 및/또는 형상에 관한 정보들을 포함할 수있다. 예컨대, 특정 병변후보 또는 특정 해부학적 객체를 구성하는 픽셀의 밝기 값, 특정 병변후보 또는 특정해부학적 객체를 나타내는 영역의 질감, 특정 병변후보 또는 특정 해부학적 객체의 형상에 관한 정보를 포함할수 있다.더 나아가 맥락정보는 병변후보 및 해부학적 객체의 검출정보들 사이의 상관관계로부터 추출되는 관계정보 [0076](3705)를 포함할 수 있다. 관계정보(3705)는 병변후보와 해부학적 객체 사이의 거리, 병변후보와 해부학적 객체사이의 상대적인 위치, 또는 병변후보와 해부학적 객체 사이의 밝기, 질감 또는 형상의 유사한 정도에 관한 정보들 중 적어도 하나를 포함할 수 있다. 여기서, 병변후보와 해부학적 객체 사이의 상대적인 위치는, 예컨대 유방 영상의 경우, 병변후보가 피부 및 피하지방에 대해 아래에 위치하며 대흉근에 대해 위에 위치하는지 여부를나타내는 관계정보일 수 있다.더 나아가 맥락정보는 확률정보(3707)를 포함할 수 있다. 확률정보(3707)는 미리 구축된 학습데이터로부터 획득 [0077]될 수 있다. 확률정보(3307)는 특정 의료 영상 내에서 병변 및 해부학적 객체 각각이 존재하는 위치의 확률분포정보일 수 있다.예컨대, 유방 초음파 영상의 경우, \"피부는 영상의 최상단에 100% 존재한다\", \"피하지방\"은 영상의 최상단으로 [0078]부터 10cm 떨어진 위치에서 발견될 확률은 50%이다\", \"유방암 낭종과 같은 병변은 피하지방과 후방지방 사이에서 10 ~ 31% 확률로 발견될 수 있다\" 등과 같은 확률분포 정보가 확률정보(3705)에 포함될 수 있다.또 더 나아가 맥락정보는 인접 영상정보(3709)를 포함할 수 있다. 인접 영상정보(3709)는, 의료 영상이 동영상 [0079]중의 연속적인 2차원 프레임들 중 하나 또는 3차원 영상의 단면들 중 하나인 경우, 인접 프레임 또는 인접 단면에서 획득된 병변정보 및/또는 해부학적 객체의 위치 정보를 포함할 수 있다.예컨대, 현재 의료 영상이, 3차원 초음파 볼륨 영상의 슬라이스들 중 하나인 경우, 이전에 인접한 슬라이스들을 [0080]분석한 결과 검출된 병변정보 및/또는 해부학적 객체들의 위치는 현재 슬라이스에서 검출된 병변정보 및/또는해부학적 객체들과 연관성이 높을 것이다. 따라서, 인접 영상정보에 포함된 이전에 검출된 해부학적 객체들의위치 정보는 현재 영상에서 검출된 병변정보 및/또는 해부학적 객체들을 검증하고 조정하기 위한 참고 자료로서유용할 수 있다.도 10은 도 9의 맥락정보의 예 중에서, 확률정보의 일 실시예를 보여주는 그래프이다. [0081]도 10을 참조하면, 유방 초음파 영상에서 병변이 발견될 위치의 확률분포가 그래프로서 도시된다. 도시된 그래 [0082]프에서, 수평축은 피부에서부터 체내로 들어가는 방향으로 대흉근까지의 거리를 나타내며, 수직축은 병변이 발견될 확률이다. 그래프에서 알 수 있는 바와 같이, 병변은 피부와 대흉근 근처에서 발견될 확률이 낮고, 피부와대흉근 사이의 중간 지점에서 약 31% 정도까지 발견확률을 가진다는 것을 알 수 있다. 이러한 확률분포는 기존의 병변 발견 과정에서 축적된 데이터를 학습데이터로 구축하고, 이 학습데이터를 통해 획득될 수 있다.도 11은 의료 영상 내 거짓양성 병변후보 제거 방법의 일 실시예를 나타낸 흐름도이다. [0083]도 11을 참조하면 의료 영상 내 거짓양성 병변후보 제거 방법(110)은 예컨대 도 3에 도시된 시스템의 영상 입력 [0084]부로 의료 영상이 입력(111)되는 것으로 시작될 수 있다. 이러한 의료 영상은 초음파 또는 X선 등을 이용하여인체의 특정 부위를 촬영하는 의료 영상 진단 장치 또는 촬영 장치, 또는 이러한 영상들을 저장하고 있는 저장장치로부터 입력될 수 있다.영상이 입력되면, 도 3에 도시된 시스템의 병변후보 검출기(33) 및 주변 객체 검출기(35)에 의하여, 입력된 영 [0085]상을 분석하여, 영상 내의 특정 위치에 존재하는 병변후보 및 해부학적 객체를 관심영역으로서 검출하는 검출단계가 진행된다(113). 이 검출 단계(113)는 영상이 유방 초음파 영상인 경우, 유방암의 낭종과 같은 병변으로의심할 수 있는 영역을 병변후보로서 검출하고, 피부, 지방, 유방실질, 근육, 뼈 등을 해부학적 객체로서 검출할 수 있다.그런 다음, 검출된 관심영역들 중 특히 병변후보의 거짓양성 판정을 위한 자료로서 이용하기 위하여 [0086]맥락정보가, 예컨대 도 3의 병변후보 검증기(37)에 의해 컴퓨터-판독가능 스토리지 매체로부터, 획득된다(115).맥락정보는 도 3의 맥락정보(370)일 수 있다. 이 예에서 맥락정보(370)는 도메인 지식을 포함할 수 있고, 컴퓨터 판독가능한 매체 상에 미리 저장될 수 있다. 도메인 지식은, 병변후보에 관련된 도메인 지식 및/또는 해부학공개특허 10-2015-0098119-13-적 객체에 관련된 도메인 지식을 포함할 수 있다. 도메인 지식은, 예컨대, 도 9의 도메인 지식(3701)일 수있다.맥락정보가 획득되면, 예컨대 도 3의 병변후보 검증기(37)에 의해, 획득한 맥락정보에 기초하여, 관심영역 중 [0087]병변후보의 거짓양성인지 여부가 검증될 수 있다(117). 예를 들어, 병변후보가 피부로 판정된 영역과 동일한 위치에 존재한다면, 이 병변후보는 실제로 병변으로 판단되지 않을 가능성이 높다고 판단되고 따라서 거짓양성으로 판단될 것이다. 예를 들어, 병변후보가 유방실질 영역에 존재한다고 판정되면, 이 병변후보는 실제로 병변으로 판단될 가능성이 높다고 판단되고 따라서 거짓양성이 아니라고 판단될 것이다.이러한 검증 단계(117)의 검증 결과는, 이후 예컨대 도 3의 거짓양성 제거기(39)에 의해 이용됨으로써, 거짓양 [0088]성이 제거된 병변후보 결과가 출력될 수 있다.도 12는 의료 영상 내 거짓양성 병변후보 제거 방법의 다른 실시예를 나타낸 흐름도이다. [0089]도 12를 참조하면 의료 영상 내 거짓양성 병변후보 제거 방법(120)은 예컨대 도 3에 도시된 시스템의 영상 입력 [0090]부로 의료 영상이 입력(121)되는 것으로 시작될 수 있다. 이러한 의료 영상은 초음파 또는 X선 등을 이용하여인체의 특정 부위를 촬영하는 의료 영상 진단 장치 또는 촬영 장치, 또는 이러한 영상들을 저장하고 있는 저장장치로부터 입력될 수 있다.영상이 입력되면, 도 3에 도시된 시스템의 병변후보 검출기(33) 및 주변 객체 검출기(35)에 의하여, 입력된 영 [0091]상을 분석하여, 영상 내의 특정 위치에 존재하는 병변후보 및 해부학적 객체를 관심영역으로서 검출하는 검출단계가 진행된다(123). 이 검출 단계(123)는 영상이 유방 초음파 영상인 경우, 유방암의 낭종과 같은 병변으로의심할 수 있는 영역을 병변후보로서 검출하고, 피부, 지방, 유방실질, 근육, 뼈 등을 해부학적 객체로서 검출할 수 있다.그런 다음, 검출된 관심영역들 중 특히 병변후보의 거짓양성 판정을 위한 자료로서 이용하기 위하여 [0092]맥락정보가, 예컨대 도 3의 병변후보 검증기(37)에 의해 컴퓨터-판독가능 스토리지 매체로부터, 획득된다(125).맥락정보는 도 3의 맥락정보(370)일 수 있다. 이 예에서 맥락정보(370)는 도메인 지식을 포함할 수 있고, 컴퓨터 판독가능한 매체 상에 미리 저장될 수 있다. 도메인 지식은, 병변후보에 관련된 도메인 지식 및/또는 해부학적 객체에 관련된 도메인 지식을 포함할 수 있다. 도메인 지식은, 예컨대, 도 9의 도메인 지식(3701)일 수있다.또한 이 단계(125)에서, 병변후보 검증기(37)는 이전 단계(123)에서 검출된 관심영역으로부터 자체정보 및 관계 [0093]정보를 추출할 수 있다. 추출된 자체정보는 관심영역 즉 병변후보 및 해부학적 객체의 신뢰도, 밝기, 질감, 및/또는 형상에 관한 정보들을 포함할 수 있다. 예컨대, 특정 병변후보 또는 특정 해부학적 객체를 구성하는 픽셀의 밝기 값, 특정 병변후보 또는 특정 해부학적 객체를 나타내는 영역의 질감, 특정 병변후보 또는 특정 해부학적 객체의 형상에 관한 정보를 포함할 수 있다. 한편 추출된 관계정보는 병변후보와 해부학적 객체 사이의거리, 병변후보와 해부학적 객체 사이의 상대적인 위치, 또는 병변후보와 해부학적 객체 사이의 밝기, 질감 또는 형상의 유사한 정도에 관한 정보를 포함할 수 있다. 추출된 자체정보 및 관계정보는 예컨대 도 9의 자체정보(3703) 및 관계정보(3705)로서 맥락정보(370)에 추가될 수 있다.맥락정보가 획득되면, 예컨대 도 3의 병변후보 검증기(37)에 의해, 획득한 맥락정보 즉 자체정보, 관계정보 및 [0094]도메인 지식에 기초하여, 관심영역 중 병변후보의 거짓양성인지 여부가 검증될 수 있다(127). 예를 들어, 병변후보가 피부로 판정된 영역과 동일한 위치에 존재한다면, 이 병변후보는 실제로 병변으로 판단되지 않을 가능성이 높다고 판단되고 따라서 거짓양성으로 판단될 것이다. 예를 들어, 병변후보가 유방실질 영역에 존재한다고판정되면, 이 병변후보는 실제로 병변으로 판단될 가능성이 높다고 판단되고 따라서 거짓양성이 아니라고 판단될 것이다.이러한 검증 단계(127)의 검증 결과는, 이후 예컨대 도 3의 거짓양성 제거기(39)에 의해 이용됨으로써, 거짓양 [0095]성이 제거된 병변후보 결과가 출력될 수 있다.도 13은 의료 영상 내 거짓양성 병변후보 제거 방법의 또 다른 실시예를 나타낸 흐름도이다. [0096] 도 13을 참조하면 의료 영상 내 거짓양성 병변후보 제거 방법(130)은 예컨대 도 3에 도시된 시스템의 영상 입 [0097]력부로 의료 영상이 입력(131)되는 것으로 시작될 수 있다. 이러한 의료 영상은 초음파 또는 X선 등을 이용하여인체의 특정 부위를 촬영하는 의료 영상 진단 장치 또는 촬영 장치, 또는 이러한 영상들을 저장하고 있는 저장장치로부터 입력될 수 있다.공개특허 10-2015-0098119-14-영상이 입력되면, 도 3에 도시된 시스템의 병변후보 검출기(33) 및 주변 객체 검출기(35)에 의하여, 입력된 영 [0098]상을 분석하여, 영상 내의 특정 위치에 존재하는 병변후보 및 해부학적 객체를 관심영역으로서 검출하는 검출단계가 진행된다(133). 이 검출 단계(133)는 영상이 유방 초음파 영상인 경우, 유방암의 낭종과 같은 병변으로의심할 수 있는 영역을 병변후보로서 검출하고, 피부, 지방, 유방실질, 근육, 뼈 등을 해부학적 객체로서 검출할 수 있다.그런 다음, 검출된 관심영역들 중 특히 병변후보의 거짓양성 판정을 위한 자료로서 이용하기 위하여 [0099]맥락정보가, 예컨대 도 3의 병변후보 검증기(37)에 의해 컴퓨터-판독가능 스토리지 매체로부터, 획득된다(135).맥락정보는 도 3의 맥락정보(370)일 수 있다. 이 예에서 맥락정보(370)는 도메인 지식을 포함할 수 있고, 컴퓨터 판독가능한 매체 상에 미리 저장될 수 있다. 도메인 지식은, 병변후보에 관련된 도메인 지식 및/또는 해부학적 객체에 관련된 도메인 지식을 포함할 수 있다. 도메인 지식은, 예컨대, 도 9의 도메인 지식(3701)일 수있다.또한 이 단계(135)에서, 병변후보 검증기(37)는 이전 단계(133)에서 검출된 관심영역으로부터 자체정보 및 관계 [0100]정보를 추출할 수 있다. 추출된 자체정보는 관심영역 즉 병변후보 및 해부학적 객체의 신뢰도, 밝기, 질감, 및/또는 형상에 관한 정보들을 포함할 수 있다. 예컨대, 특정 병변후보 또는 특정 해부학적 객체를 구성하는 픽셀의 밝기 값, 특정 병변후보 또는 특정 해부학적 객체를 나타내는 영역의 질감, 특정 병변후보 또는 특정 해부학적 객체의 형상에 관한 정보를 포함할 수 있다. 한편 추출된 관계정보는 병변후보와 해부학적 객체 사이의거리, 병변후보와 해부학적 객체 사이의 상대적인 위치(유방 영상의 경우, 병변후보가 피부 및 피하지방에 대해아래에 위치하며 대흉근에 대해 위에 위치하는지 여부와 같은), 또는 병변후보와 해부학적 객체 사이의 밝기,질감 또는 형상의 유사한 정도에 관한 정보를 포함할 수 있다. 추출된 자체정보 및 관계정보는 예컨대 도 9의자체정보(3703) 및 관계정보(3705)로서 맥락정보(370)에 추가될 수 있다.더 나아가 맥락정보는 확률정보를 포함할 수 있다. 확률정보는 미리 구축된 학습데이터로부터 획득될 수 있다. [0101]확률정보는 특정 의료 영상 내에서 병변 및 해부학적 객체 각각이 존재하는 위치의 확률분포 정보일 수 있다.이 확률정보는 도메인 지식과 마찬가지로 미리 저장된다. 확률정보는 예컨대 도 9의 확률정보(3707)로서 맥락정보(370)에 추가될 수 있다.또 더 나아가 맥락정보는 인접 영상정보를 포함할 수 있다. 의료 영상이 동영상 중의 연속적인 2차원 프레임들 [0102]중 하나 또는 3차원 영상의 단면들 중 하나인 경우, 인접 영상정보는 현재 프레임 또는 현재 단면에 대해 인접하는 인접 프레임 또는 인접 단면에서 획득될 수 있다. 이러한 인접 영상정보는 병변정보 및/또는 해부학적 객체의 위치 정보를 포함할 수 있다. 이 인접 영상정보는 도메인 지식 및 확률정보와 마찬가지로 미리 저장된다.인접 영상정보는 예컨대 도 9의 인접 영상정보(3709)로서 맥락정보(370)에 추가될 수 있다. 맥락정보가 획득되면, 예컨대 도 3의 병변후보 검증기(37)에 의해, 획득한 맥락정보 즉 자체정보, 관계정보 및 [0103]도메인 지식에 기초하여, 관심영역 중 병변후보의 거짓양성인지 여부가 검증될 수 있다(137). 예를 들어, 병변후보가 피부로 판정된 영역과 동일한 위치에 존재한다면, 이 병변후보는 실제로 병변으로 판단되지 않을 가능성이 높다고 판단되고 따라서 거짓양성으로 판단될 것이다. 예를 들어, 병변후보가 유방실질 영역에 존재한다고판정되면, 이 병변후보는 실제로 병변으로 판단될 가능성이 높다고 판단되고 따라서 거짓양성이 아니라고 판단될 것이다.이러한 검증 단계(137)의 검증 결과는, 이후 예컨대 도 3의 거짓양성 제거기(39)에 의해 이용됨으로써, 거짓양 [0104]성이 제거된 병변후보 결과가 출력될 수 있다.상술한 의료 영상 내 거짓양성 병변후보 제거 시스템은, 프로세서, 메모리, 사용자 입력장치, 프레젠테이션 장 [0105]치 중 적어도 일부를 포함하는 컴퓨팅 장치에 의해 구현될 수 있다. 메모리는, 프로세서에 의해 실행되면 특정태스크를 수행할 있도록 코딩되어 있는 컴퓨터-판독가능 소프트웨어, 애플리케이션, 프로그램 모듈, 루틴, 인스트럭션(instructions), 및/또는 데이터 등을 저장하는 매체이다. 프로세서는 메모리에 저장되어 있는 컴퓨터-판독가능 소프트웨어, 애플리케이션, 프로그램 모듈, 루틴, 인스트럭션, 및/또는 데이터 등을 판독하여 실행할 수있다. 사용자 입력장치는 사용자로 하여금 프로세서에게 특정 태스크를 실행하도록 하는 명령을 입력하거나 특정 태스크의 실행에 필요한 데이터를 입력하도록 하는 수단일 수 있다. 사용자 입력장치는 물리적인 또는 가상적인 키보드나 키패드, 키버튼, 마우스, 조이스틱, 트랙볼, 터치-민감형 입력수단, 또는 마이크로폰 등을 포함할 수 있다. 프레젠테이션 장치는 디스플레이, 프린터, 스피커, 또는 진동장치 등을 포함할 수 있다.컴퓨팅 장치는 스마트폰, 태블릿, 랩탑, 데스크탑, 서버, 클라이언트 등의 다양한 장치를 포함할 수 있다. 컴퓨 [0106]공개특허 10-2015-0098119-15-팅 장치는 하나의 단일한 스탠드-얼론 장치일 수도 있고, 통신망을 통해 서로 협력하는 다수의 컴퓨팅 장치들로이루어진 분산형 환경에서 동작하는 다수의 컴퓨팅 장치를 포함할 수 있다.또한 상술한 의료 영상 내 거짓양성 병변후보 제거 방법은, 프로세서를 구비하고, 또한 프로세서에 의해 실행되 [0107]면 의료 영상 내 거짓양성 병변후보 제거 방법을 수행할 있도록 코딩된 컴퓨터 판독가능 소프트웨어, 애플리케이션, 프로그램 모듈, 루틴, 인스트럭션, 및/또는 데이터 구조 등을 저장한 메모리를 구비하는 컴퓨팅 장치에의해 실행될 수 있다.도 1 내지 도 10을 참조하여 기술된 영상 내 거짓양성 병변후보 제거 시스템들은 단지 예시에 불과하다. 해당 [0108]기술분야의 통상의 지식을 가진 자는, 청구항들의 범위 내에서 다양한 조합의 다른 시스템들이 가능하다는 것을쉽게 이해할 것이다. 영상 내 거짓양성 병변후보 제거 시스템의 컴포넌트들은, 각각의 기능을 구현하는 회로들을 포함하는 하드웨어에 의해 구현될 수 있다. 또한 영상 내 거짓양성 병변후보 제거 시스템의 컴포넌트들은,컴퓨팅 장치의 프로세서에 의해 수행되면 특정 태스크를 실행할 수 있도록 하는 컴퓨터-실행가능 소프트웨어,펌웨어 및 하드웨어의 조합에 의해 구현될 수도 있다.한편 도 11 내지 도 13을 참조하여 기술된 영상 내 거짓양성 병변후보 제거 방법들은 단지 예시에 불과하다. 해 [0109]당 기술분야의 통상의 지식을 가진 자는, 청구항들의 범위 내에서 다양한 조합의 다른 방법들이 가능하다는 것을 쉽게 이해할 것이다. 영상 내 거짓양성 병변후보 제거 방법의 예들은, 컴퓨팅 장치의 프로세서에 의해 수행되면 특정 태스크를 실행할 수 있도록 하는 컴퓨터-실행가능 인스트럭션으로 코딩될 수 있다. 컴퓨터-실행가능인스트럭션은 소프트웨어 개발자에 의해 예를 들어 베이직, 포트란, C, C++ 등과 같은 프로그래밍 언어에 의해코딩된 후, 기계언어로 컴파일될 수 있다.부호의 설명10 : 유방 초음파 영상 [0110]11 : 피부12 : 피하지방13 : 유방실질14 : 후방지방15 : 대흉근16 : 갈비뼈21, 22 : 병변후보30 : 거짓양성 병변후보 제거 시스템31 : 영상 입력부33 : 병변후보 검출기35 : 주변 객체 검출기37 : 병변후보 검증기370 : 맥락정보371 : 도메인 지식373 : 자체정보375 : 관계정보377 : 확률정보379 : 인접 영상정보39 : 거짓양성 제거기공개특허 10-2015-0098119-16-도면도면1도면2공개특허 10-2015-0098119-17-도면3도면4공개특허 10-2015-0098119-18-도면5공개특허 10-2015-0098119-19-도면6공개특허 10-2015-0098119-20-도면7도면8공개특허 10-2015-0098119-21-도면9도면10공개특허 10-2015-0098119-22-도면11도면12공개특허 10-2015-0098119-23-도면13공개특허 10-2015-0098119-24-"}
{"patent_id": "10-2014-0019265", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "의료 영상 내 거짓양성 병변후보 제거 시스템 및 방법이 개시된다. 일 예에 따라, 의료 영상을 수신하는 영상 입력 단계와, 상기 의료 영상 내에서 병변후보를 검출하는 병변후보 검출 단계와, 상기 의료 영상 내에서 해부학 적 객체들을 검출하는 주변 객체 검출 단계와, 상기 병변후보를 상기 병변후보의 위치와 상기 해부학적 객체의 위치 사이의 관계정보를 포함하는 해부학적 맥락정보에 기초하여 검증하는 병변후보 검증 단계와, 상기 검증결과 에 기초하여 상기 병변후보 중 거짓양성 병변후보를 제거하는 거짓양성 제거 단계를 포함할 수 있다."}
{"patent_id": "10-2014-0019265", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "의료 영상의 병변후보 검출에 관련된다. 보다 상세하게는 의료 영상 내 거짓양성 병변후보를 제거하는 기법에 관련된다."}
{"patent_id": "10-2014-0019265", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로, 컴퓨터 보조 검출(Computer Aided Detection, CAD)은, 의사의 진단을 돕기 위하여 의료 영상에서 컴퓨터를 이용하여 자동으로 병변을 검출하는 기술이다. 그러나, 현재로서는 영상의 저-화질 및 비-정형성으로 인해 CAD 기술의 정확도를 향상시키기가 매우 어렵다. 예를 들어, 초음파 영상은 의사에 의해 프로브(probe)의 위치와 각도가 임의로 선택된다. 그러므로 획득되는 초 음파 영상들은 서로 그 위치와 각도가 일치되어 있지 않아 비-정형적이다. 따라서 이러한 비-정형적인 영상들에 대해 단순히 병변을 자동으로 검출하는 알고리즘을 적용하면, 병변 뿐만 아니라 병변이 아닌 단순한 해부학적인"}
{"patent_id": "10-2014-0019265", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "요소들까지도 병변으로 오인하여 검출하는 경우가 많았다.발명의 내용"}
{"patent_id": "10-2014-0019265", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "의료 영상 내에서 검출된 병변후보를 해부학적 맥락정보를 이용하여 검증함으로써, 거짓양성 병변후보를 제거하 는 의료 영상 내 거짓양성 병변후보 제거 시스템 및 방법을 제안한다."}
{"patent_id": "10-2014-0019265", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 양상에 따른 의료 영상 내 거짓양성 병변후보 제거 시스템은, 의료 영상을 수신하는 영상 입력부와, 상기 의 료 영상 내에서 병변후보를 검출하는 병변후보 검출기와, 상기 의료 영상 내에서 해부학적 객체들을 검출하는 주변 객체 검출기와, 상기 병변후보를 상기 병변후보의 위치와 상기 해부학적 객체의 위치 사이의 관계정보를 포함하는 해부학적 맥락정보에 기초하여 검증하는 병변후보 검증기와, 상기 검증결과에 기초하여 상기 병변후보 중 거짓양성 병변후보를 제거하는 거짓양성 제거기를 포함할 수 있다. 일 실시예에 있어서, 상기 의료 영상은 인체의 유방을 초음파 또는 X-선을 이용하여 촬영한 유방 영상이며, 상 기 주변 객체 검출기는 상기 유방 영상으로부터, 상기 해부학적 객체로서 피부, 지방, 유방실질, 근육, 뼈 중 적어도 하나를 검출하고, 상기 병변후보 검증기는 상기 병변후보와 상기 유방 영상 내에서 검출된 상기 피부, 지방, 유방실질, 근육, 뼈 중 적어도 하나와의 위치 관계를 포함하는 해부학적 맥락에 기초하여 검증할 수 있다. 다른 실시예에 있어서, 상기 병변후보 검출기는, 하르 피처 검출(Harr feature detection), 디포머블 파트 모델 (deformable part model, DPM), 또는 딥 러닝(Deep Learning) 중 적어도 하나를 이용하여 상기 의료 영상으로 부터 병변후보를 검출할 수 있다. 또 다른 실시예에 있어서, 상기 주변 객체 검출기는, 상기 의료 영상으로부터 상기 해부학적 객체들 각각을 개 별적으로 검출하는 복수의 개별 객체 검출기를 포함할 수 있다. 또 다른 실시예에 있어서, 상기 복수의 개별 객체 검출기 각각은, 딥 러닝, 슬라이딩 윈도 기법, 또는 수퍼픽셀 기법을 이용할 수 있다. 또 다른 실시예에 있어서, 상기 주변 객체 검출기는, 상기 의료 영상으로부터 상기 해부학적 객체들을 한꺼번에 검출하는 단일 객체 검출기를 포함할 수 있다. 또 다른 실시예에 있어서, 상기 단일 객체 검출기는, 딥러닝 기법, 슬라이딩 윈도우 기법 또는 수퍼픽셀 기법을 이용할 수 있다. 또 다른 실시예에 있어서, 상기 단일 객체 검출기는, 상기 의료 영상으로의 전체 혹은 일부로부터 복수의 피처 맵(feature map)들을 추출하고, 추출된 상기 피처 맵들 각각에 대응하는 해부학적 객체를 할당하며, 특정 해부 학적 객체가 할당된 피처 맵의 상기 의료 영상 내 위치를 할당된 특정 해부학적 객체로 라벨링할 수 있다. 또 다른 실시예에 있어서, 상기 병변후보 검증기는, 서포트 벡터 머신(support vector machine, SVM), 인공 지 능 네트워크(artificial neural network, ANN), 딥 러닝 기법 및 베이즈 네트워크(Bayesian Network) 중 적어 도 하나의 기법을 이용할 수 있다. 또 다른 실시예에 있어서, 상기 해부학적 맥락정보는, \"인체의 특정 부위는 미리 정의된 해부학적 객체들을 가 진다\", \"인체의 특정 부위에서, 서로 다른 해부학적 객체들은 미리 정의된 위치관계를 가진다\", 및 \"동일한 해 부학적 객체들은 서로 모여서 존재한다\"라는 상기 해부학적 객체에 관련된 도메인 지식(domain knowledge)과, \"특정 병변후보는 인체의 특정 부위 중 특정 해부학적 객체들 내에만 존재한다\"라는 상기 병변후보에 관련된 도메인 지식을 포함할 수 있다. 또 다른 실시예에 있어서, 상기 해부학적 맥락정보는, 상기 병변후보 및 상기 해부학적 객체의 검출정보로부터 추출되는 자체정보를 포함하며, 상기 자체정보는 신뢰도(confidence level), 밝기, 질감, 및 형상에 관한 정보 들 중 적어도 하나를 포함할 수 있다. 또 다른 실시예에 있어서, 상기 해부학적 맥락정보는, 상기 병변후보 및 상기 해부학적 객체의 검출정보들 사이 의 상관관계로부터 추출되는 관계정보를 포함하며, 상기 관계정보는 상기 병변후보와 상기 해부학적 객체 사이 의 거리, 상기 병변후보와 상기 해부학적 객체 사이의 상대적인 위치, 또는 상기 병변후보와 상기 해부학적 객체 사이의 밝기, 질감 또는 형상의 유사한 정도에 관한 정보들 중 적어도 하나를 포함할 수 있다. 또 다른 일 실시예에 있어서, 상기 해부학적 맥락정보는, 미리 구축된 학습데이터로부터 획득된, 상기 의료 영 상 내에서 상기 병변후보가 존재하는 위치의 확률분포 정보를 더 포함할 수 있다. 또 다른 일 실시예에 있어서, 상기 의료 영상이 동영상 중의 연속적인 2차원 프레임들 중 하나 또는 3차원 영상 의 단면들 중 하나인 경우, 상기 해부학적 맥락정보는, 인접 프레임 또는 인접 단면에서 획득된 상기 병변후보 또는 상기 해부학적 객체의 위치 정보를 포함하는 인접 영상 정보를 더 포함할 수 있다. 또한, 다른 양상에 따라 의료 영상 내 거짓양성 병변후보 제거 방법은, 의료 영상을 수신하는 영상 입력 단계와, 상기 의료 영상 내에서 병변후보를 검출하는 병변후보 검출 단계와, 상기 의료 영상 내에서 해부학적 객체들을 검출하는 주변 객체 검출 단계와, 상기 병변후보를 상기 병변후보의 위치와 상기 해부학적 객체의 위 치 사이의 관계정보를 포함하는 해부학적 맥락정보에 기초하여 검증하는 병변후보 검증 단계와, 상기 검증결과 에 기초하여 상기 병변후보 중 거짓양성 병변후보를 제거하는 거짓양성 제거 단계를 포함할 수 있다. 상술한 양상들 및 실시예들, 그리고 그 이외의 다른 양상들이나 실시예들에 대해 아래의 상세한 설명에서 더 발 견될 수 있다."}
{"patent_id": "10-2014-0019265", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "의료 영상의 병변 오인 검출을 감소시키고, 의사의 최종 진단의 정확도를 향상시키는 의료 영상 내 거짓양성 병 변후보 제거 시스템 및 방법을 구현할 수 있는 효과가 있다."}
{"patent_id": "10-2014-0019265", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "의료 영상 내 거짓양성 병변후보 제거 시스템 및 방법의 실시예에 의해, CAD(Computer Aided Detection 또는 Computer Aided Diagnosis) 시스템의 병변후보 검출 기술이 제공된다. 이 기술은 예컨대, 유방 초음파 촬영술에 의해 생성되는 초음파 영상 또는 X-선 유방 의료 영상에서 병변후보를 검출하는 경우에 이용될 수 있다. 본 문서에서, \"해부학적 객체\"라는 용어는 특정한 해부학적인 성질이나 기능에 따라 구별될 수 있는 요소를 지 칭할 수 있다. 예컨대 유방의 경우, 해부학적 객체는 피부(skin), 피하지방(subcutaneous fat), 유방실질 (glandular tissue), 후방지방(retromammary fat), 대흉근(pectoralis muscle), 갈비뼈(rib) 등을 포함할 수 있다. \"병변후보영역(lesion candidate region/portion)\"라 함은, CAD에 의해 검출된, 병변영역(lesion)으로 진단될 가능성이 있는 의료 영상 내의 특정 영역을 의미한다. CAD에 의해 검출된 병변후보영역이 실제로 병변영역인지 여부는 의사에 의하여 판단될 것이다. 의료 영상 내 거짓양성 병변후보 제거 시스템 및 방법은, 의료 영상 내에서 검출된 병변후보 병변후보를 해부학 적 맥락정보를 이용하여 검증함으로써, 거짓양성(false positive, FP) 병변후보를 제거한다. 다시 말해서, 먼저 영상에서 병변후보 및 해부학적 객체가 검출된다. 그런 다음, 검출된 병변후보 및 해부학적 객체의 위치 및 위 치 관계가 해부학적 맥락정보에 기초하여 검증된다. 마지막으로, 검증 결과에 기초하여, 병변후보 중에서 거짓 양성 병변후보가 제거된다. 이에 따라 병변후보 검출의 효율성을 향상시킬 수 있다. 여기서 \"거짓양성 병변후보\"라 함은 영상 내에서 검출된 병변후보들 중에서 의학적으로 진단할 가치가 있는 병 변후보가 아닌 잘못 검출된 병변후보를 의미한다. 예를 들어, 병변후보가 지방과 같은 특정 해부학적 객체라고 판단되는 경우, 이 병변후보는 거짓양성일 가능성이 크다. 다른 예를 들어, 영상이 유방 영상인 경우에, 병변후 보가 의학적으로 유방암과 관련된 종양이나 낭종이 발견되지 않는 위치에 존재한다고 판단되면, 이 병변후보는 거짓양성일 가능성이 크다. 의료 영상이 초음파 또는 X-선에 의한 유방 영상일 때, 이 영상으로부터, 유방암의 낭종 등의 병변후보, 및 피 부, 피하지방, 유방실질, 후방지방, 대흉근육, 갈비뼈 등의 해부학적 객체를 검출할 수 있다. 병변후보의 검출은 영상 내에서 자동으로 병변후보를 발견하기 위한 다양한 알고리즘을 이용하는 기법을 통하여 수행될 수 있다. 예컨대, 하르 피처 검출 기법(Haar feature detection), 디포머블 파트 모델(deformable part model), 딥 러닝(Deep Learning) 등의 기법을 이용할 수 있다. 해부학적 객체의 검출은, 영상으로부터 복수의 해부학적 객체들 각각을 개별적으로 검출함으로써 수행될 수 있 다. 이 경우, CDBN(Convolutional Deep Belief Network) CNN(Convolutional Neural Network)등과 같은 여러 가 지 딥 러닝(Deep Learning) 기법들 중 하나를 이용할 수 있다. 또한, 피부를 검출하는 피부 검출기, 지방을 검 출하는 지방 검출기, 유방실질을 검출하는 유방실질 검출기, 근육을 검출하는 근육 검출기 등과 같이 각각의 해 부학적 객체에 대해 별도의 검출기를 채용할 수도 있다. 한편, 해부학적 객체의 검출은 하나의 유방 초음파 영상으로부터 복수의 해부학적 객체들을 한꺼번에 검출함으 로써 수행될 수도 있다. 이 경우, 딥 러닝(deep learning) 기법, 슬라이딩 윈도우(sliding window) 기법 또는 수퍼픽셀(superpixel) 기법을 이용할 수 있다. 먼저, 유방 초음파 영상으로부터 여러 가지 피처 맵(feature map)을 추출하고, 추출된 피처 맵들을 대응하는 해부학적 객체들에 할당하며, 특정 해부학적 객체가 할당된 피 처 맵들의 영상 내 위치를 특정 해부학적 객체로 라벨링할 수 있다. 이렇게 검출된 피부, 지방, 근육, 뼈 등의 해부학적 객체들은 각 해부학적 객체들의 위치 관계에 관한 해부학적 맥락정보(context)에 기초하여 검증될 수 있다. 해부학적 맥락정보(context)는 병변후보 및 해부학적 객체와 관련된 도메인 지식(domain knowledge)을 포함할 수 있다. 또한 해부학적 맥락정보는 병변후보 및 해부학적 객체와 직접 연관된 자체정보를 포함할 수 있다. 그 리고 해부학적 맥락정보는 병변후보와 해부학적 객체 사이의 관계와 연관된 관계정보를 포함할 수 있다. 더 나 아가 해부학적 맥락은, 특정 인체 부위의 의료 영상 내에서 병변후보 및/또는 해부학적 객체가 존재할 위치의 확률분포 정보를 포함할 수 있다. 이러한 확률분포 정보는 미리 구축된 학습데이터에 기초하여 획득될 수 있다. 또한 해부학적 맥락은, 의료 영상이 동영상 중의 연속적인 2차원(2D) 프레임들 중 하나 또는 3차원(3D) 영상의 단면들 중 하나인 경우, 인접 프레임 또는 인접 단면에서 획득된 해부학적 객체의 위치 정보와 같은 인접 영상 정보를 포함할 수 있다. 아래에서 의료 영상 내 거짓양성 병변후보 제거 시스템 및 방법이 도면들을 참조하여 예시로서 기술된다. 이하에서, 2차원 유방 초음파 영상을 예로 들어, 의료 영상 내 거짓양성 병변후보 제거 시스템 및 방법의 실시 예를 설명한다. 그러나, 의료 영상의 범위가 유방 초음파 영상으로 제한될 필요는 없다. 예를 들어, 의료 영상 은 유방 또는 그 외의 다른 부위에 대한 초음파 또는 X선 영상일 수 있고, 2차원 영상 또는 3차원 영상일 수 있 다. 도 1은 일반적인 컴퓨터 보조 진단 시스템(CAD)의 구성을 예시하는 블록도이다. 도 1을 참조하면, 일반적으로 컴퓨터 보조 진단 시스템은 영상 획득부, 병변 검출부, 및 병변 진단 부를 포함한다. 영상 획득부는 예컨대 환자의 유방에 대한 초음파 진단 영상을 촬영하고, 촬영된 영상 들을 저장하는 의료 영상 시스템으로부터 영상을 수신할 수 있다. 병변 검출부는 영상 획득부에서 수신된 영상에 대해 병변 검출 알고리즘을 적용함으로써, 병변후보의 존재 여부를 판단하고, 존재하는 병변후보의 위치를 검출한다. 병변 진단부는 검출된 병변후보의 악성 여부를 판단할 수 있다. 컴퓨터 보조 진단 시스템 은 검출된 병변후보를 영상과 함께 진단결과로서 디스플레이를 통해 표시할 수 있다. 이와 같은 종래의 CAD 시스템에서, 특히 병변후보를 검출하는 병변 검출부에 있어서, 예컨대 초음파 영상의 경우 화질이 좋지 않고 비정형적이라는 것 때문에 다수의 거짓양성 병변후보들이 검출되는 문제가 있었다. 거짓 양성 병변후보는 검출 오류이다. 그러므로, 진단 성능 및 효율을 향상시키기 위해서 병변 검출부에서의 검 출 오류를 감소시키는 것, 즉 거짓양성을 감소시키는 것이 요구된다. 도 2는 유방 초음파 영상 내의 병변후보 및 해부학적 구조를 예시하는 도면이다. 도 2를 참조하면, 인체의 유방을 촬영한 2차원 초음파 영상이 예시된다. 도시된 영상은 피부, 피하 지방, 유방실질, 후방지방, 대흉균, 및 갈비뼈의 해부학적 객체들을 포함한다. 또한 도시 된 영상은 낭종이나 악셩 병변과 같은 병변후보(21, 22)를 포함한다. 이들 해부학적 객체들은 최상단의 피 부로부터 차례로 아래쪽으로 피하지방, 유방실질, 후방지방, 대흉균, 및 갈비뼈가 배 치되는 해부학적 구조를 보여준다. 그리고 병변후보(21, 22)는 영상 내의 다양한 위치에서 발견될 수 있다. 도 3은 의료 영상 내 거짓양성 병변후보 제거 시스템의 일 실시예를 나타낸 블록도이다. 도 3을 참조하면, 거짓양성 병변후보 제거 시스템은 영상 입력부, 병변후보 검출기, 주변 객체 검 출기, 병변후보 검증기, 및 거짓양성 제거기 등의 컴포넌트를 포함할 수 있다. 영상 입력부는 의료 영상을 수신하는 컴포넌트이다. 의료 영상은 예컨대, 도 2에 예시되어 있는 바와 같은, 인체의 유방을 초음파를 이용하여 촬영한 유방 초음파 영상일 수 있다. 이러한 의료 영상은 초음파 또는 X선 등 을 이용하여 인체의 특정 부위를 촬영하는 의료 영상 진단 장치 또는 촬영 장치, 또는 이러한 영상들을 저장하 고 있는 저장 장치로부터 입력될 수 있다. 병변후보 검출기는 의료 영상을 분석하여 병변후보의 존재 여부 및 존재하는 병변후보의 위치를 검출하는 컴포넌트이다. 병변후보 검출기는 병변후보의 검출을 위해, 예컨대, 하르 피처 검출(Haar feature detection), 디포머블 파트 모델(deformable part model), 및/또는 딥 러닝 등과 같은 기법을 이용할 수 있다. 검출된 병변후보 각각에 병변후보 검출기에 의해 신뢰도(confidence level)를 나타내는 값(score)이 대응될 수 있다. 이 신뢰도 값은 각각의 병변후보가 실제로 병변이라고 판단될 수 있는 가능성을 수치로 나타낸 것이라 고 볼 수 있다. 주변 객체 검출기는 의료 영상 내에서 복수의 해부학적 객체들을 검출할 수 있다. 주변 객체 검출기는, 의료 영상이 유방 초음파 영상인 경우, 해부학적 객체로서 피부, 지방, 유방실질, 근육, 뼈 등을 검출할 수 있다. 주변 객체 검출기는 모든 해부학적 객체들을 한꺼번에 검출하는 하나의 단일 객체 검출기로 이루어질 수 있고, 또는 각각의 해부학적 객체를 개별적으로 검출하는 복수의 개별 객체 검출기들로 이루어질 수 있다. 주변 객체 검출기는 도 4 내지 도 6에 도시된 바를 참조하여 아래에서 더 상세히 설명된다. 병변후보 검증기는, 병변후보 검출기에 의해 검출된 병변후보 및 주변 객체 검출기에 의해 검출된 해부학적 객체를, 해부학적 맥락에 관련된 정보를 포함하는 맥락정보에 기초하여 검증할 수 있다. 이 경우, 병변후보 검증기는, 예컨대, SVM(support vector machine), ANN(artificial neural network), 및 베 이즈 네트워크(Bayesian Network) 등과 같은 기계학습 및 통계적 방법을 이용할 수 있다. 병변후보 검증기 는 도 8에 도시된 바를 참조하여 아래에서 더 상세히 설명된다. 맥락정보는 의료 영상이 포함하고 있는 해부학적 부위의 해부학적인 맥락을 나타내는 맥락정보를 포함할 수 있다. 맥락정보는 특히 병변후보 및 해부학적 객체들 각자의 위치 및 그들 사이의 상호 위치 관계 등을 일반 적으로 나타내는 도메인 지식 등을 포함할 수 있다. 예를 들어, 병변후보 검증기는, 의료 영상이 유방 초음 파 영상인 경우, 검출된 병변후보, 피부, 지방, 유방실질, 근육, 뼈 등의 각자의 위치 상호 위치 관계 등을 나타내는 도메인 지식을 이용할 수 있다. 맥락정보는 예컨대 컴퓨터 판독가능 스토리지 매체 상에 저장될 수 있다. 맥락정보는 도 9에 도시된 바를 참조하여 아래에서 더 상세히 설명된다. 예를 들어, 병변후보 검출기는 DPM 기법을 이용하여 영상을 분석한 후 영상 내의 하나의 특정 영역을 \"신뢰 도 85%의 병변후보\"라고 결정함으로써 병변후보를 검출한다고 가정하자. 그리고 주변 객체 검출기는 슬라이 딩 윈도우 기법을 이용하여 영상을 분석한 후 영상 내의 다른 하나의 특정 영역을 \"신뢰도 95%의 피하지방\" 이 라고 결정함으로써 \"피하지방\"이라는 해부학적 객체를 검출한다고 가정하자. 주변 객체 검출기는, 같은 방식으로, \"피부\", \"유방실질\", \"후방지방\", \"대흉근\" 등과 같이 다른 해부학적 객체들을 검출한다고 가정하자. 이 예에서, 병변후보 검증기는 검출된 \"병변후보\"가 실제로 병변인지 아닌지를 해부학적 맥락정보를 이용하 여 검증할 수 있다. 예컨대, 병변후보 검증기는 병변후보로서 검출된 특정 영역(이하 \"A 영역\"이라고 하 자)이 해부학적 객체들이 존재하는 위치와 어떠한 관계에 있는지를 SVM 기법을 이용하여 검증할 수 있다. 다시 말해서 병변후보 검증기는 A 영역이 다른 객체들과 비교할 때 동일 위치에 존재하는지, 근접하는지, 또는 멀리 떨어져 있는지 등과 같은 해부학적 맥락 정보를 참조할 수 있다. 이에 따라 병변후보 검증기는 A 영역 이 실제로 병변으로서 판단될 가능성이 큰지 아니면 실제로 병변으로서 판단될 가능성이 작은 거짓양성인지 여 부를 판단할 수 있다. 거짓양성 제거기는 병변후보 검증기에 의해 검증된 결과를 수신할 수 있다. 이에 따라 거짓양성 제거기 는 병변후보 검출기에 의해 검출된 병변후보 중에서 병변후보 검증기에 의해 거짓양성으로 판정된 병변 후보들을 제거한 후 원본 영상에 포함시켜 출력할 수 있다. 그 결과는 도 7을 참조하여 아래에서 더 상세히 기술될 것이다. 도 4는 도 3의 실시예에서, 주변 객체 검출기의 일 실시예를 나타낸 블록도이다. 도 4를 참조하면, 도 3의 주변 객체 검출기의 일 실시예로서, 영상 내의 모든 해부학적 객체들을 한꺼번에 검출하는 단일 검출기가 도시된다. 단일 검출기는 슬라이딩 윈도우 기법을 이용하는 경우를 예시한다. 도시된 바와 같이, 단일 검출기는 HOG(histogram of gradient) 특징점, 즉 피처 맵(feature map)을 이용하 여 해부학적 객체들을 검출할 수 있다. 이를 위하여, 단일 검출기는 피처 맵 추출부, 피처 맵 할당부 , 및 영상 라벨링부를 포함할 수 있다. 피처 맵 추출부는 영상으로부터 적어도 하나의 피처 맵을 추출한다. 피처 맵 할당부는 추출된 피처 맵을 대응하는 해부학적 객체에 할당한다. 이를 위하여, 추출된 피처 맵은 이미 저장되어 있는 다수의 피처 맵들과 비교될 수 있다. 이미 저장되어 있는 다수의 피처 맵들 중에 서 일치하는 것이 존재하면, 그 일치하는 피처 맵이 대응되어 있는 해부학적 객체에 추출된 피처 맵을 대응시킬 수 있다. 영상 라벨링부는 특정 해부학적 객체가 할당된 피처 맵의 영상 내 위치를 그 특정 해부학적 객체 로 라벨링할 수 있다. 이에 따라 영상 내의 피처 맵의 위치는 특정 해부학적 객체로서 검출될 수 있다. 이 외에도 단일 검출기는 수퍼픽셀 기법을 이용하여 구성될 수 있다. 이 경우, 영상 내의 픽셀들을 수퍼픽셀로 재한정한 후, 각각의 수퍼픽셀에 대해 강도(intensity), 텍스처, 스파스 코딩(sparse coding), DBN(deep belief network)를 이용한 특징점 등의 영상 정보를 이용하는 분류기(classifier) 형식으로 구성 가능하다. 도 5는 도 4의 주변 객체 검출기의 피처 맵의 예들을 보여주는 도면이다. 도 5를 참조하면, 낭종의 피처 맵, 다른 낭종의 피처 맵, 악성 병변의 피처 맵, 유방실질의 피처 맵을 포함하는 피처 맵 그룹이 예시된다. 이러한 피처 맵 그룹은 단지 예시에 불과하며, 더 다양한 병변 종류 및/또는 해부학적 구조를 식별하기 위한 다양한 피처 맵들이 더 포함될 수 있음은 자명하다. 이러한 피처 맵들은 도 3의 병변후보 검출기에 의해서도 유사하게 이용될 수 있다. 도 6은 도 3의 실시예에서, 주변 객체 검출기의 다른 실시예를 설명하기 위한 도면이다. 도 6을 참조하면, 도 3의 주변 객체 검출기의 예로서, 복수의 개별 객체 검출기들(61, 63, 65, 67)을 포함 하는 멀티 검출기가 예시된다. 피부 객체 검출기는 원본 영상으로부터 피부 영역만을 검출한다. 피하지방 객체 검출기는 원본 영상으로부터 피하지방 영역만을 검출한다. 유방실질 객체 검출기는 원본 영상으로부터 유방실질 영역만을 검출할 수 있다. 대흉근 객체 검출기는 원본 영상으로부터 대흉근 영역만을 검출할 수 있다. 이 경우, 복수의 개별 객체 검출기(61, 63, 65, 67) 각각은, 다양한 딥 러닝(Deep Learning) 기법들 중 하나를 이용하여 구성될 수 있다. 예컨대, DHN(Deep Hierachical Network), CDBN(Convolutional Deep Belief Network), DDN(Deconvolutional Deep Network) 등을 이용할 수 있다. 도 7은 도 3의 실시예에서, 원본 영상에서 검출된 병변후보 및 해부학적 객체들이 표시된 합성 영상의 예를 설 명하기 위한 도면이다. 도 7은 도 3의 거짓양성 제거기가 병변후보 검증기에 의해 검증된 결과에 따라 거짓양성을 제거한 후 원본 영상에 검출 결과를 포함시켜 출력한 합성 영상의 예이다. 도시된 바와 같이, 원본 영상 중에서 갈비 뼈 영역, 피하지방 영역, 유방실질 영역이 표시되어 있으며, 또한 두 개의 병변후보가 도시되어 있다. 병변후보는 신뢰도 값이 0.69로 표시되고 나머지 병변후보는 신뢰도 값으로서 0.12가 표시되어 있 다. 도 8은 도 3의 실시예에서, 병변후보 검증기의 일 실시예를 더 상세히 보여주는 블록도이다. 도 8을 참조하면, 도 3의 병변후보 검증기는 자체정보 추출기, 관계정보 추출기, 병변 존재확률 계산기, 및 검증처리부 등의 컴포넌트를 포함할 수 있다. 자체정보 추출기는 병변후보 검출기에 의해 검출된 병변후보로부터 병변후보 자체와 연관된 정보, 즉 병변후보의 자체정보를 추출할 수 있다. 병변후보의 자체정보는 예컨대, 신뢰도 값, 병변후보 영역을 형성하는 픽셀의 밝기(또는, 강도)를 나타내는 값, 병변후보 영역의 질감을 나타내는 값, 및/또는 병변후보의 형상을 나 타내는 정보 등을 포함할 수 있다. 또한 자체정보 추출기는 주변 객체 검출기에 의해 검출된 해부학적 객체들로부터 마찬가지로 해부학적 객체의 자체정보를 추출할 수 있다. 해부학적 객체의 자체정보도 유사하게 신뢰도 값, 해부학적 객체 영역을 형성하는 픽셀의 밝기(또는, 강도)를 나타내는 값, 해부학적 객체 영역의 질 감을 나타내는 값, 및/또는 해부학적 객체의 형상을 나타내는 정보 등을 포함할 수 있다. 자체정보 추출기(37 1)에 의해 추출된 자체정보는 맥락정보에 포함될 수 있다. 관계정보 추출기는 병변후보 및 해부학적 객체의 검출정보들 사이의 상관관계로부터 추출되는 관계정보를 포함할 수 있다. 관계정보는 병변후보와 해부학적 객체 사이의 거리, 병변후보와 해부학적 객체 사이의 상대적 인 위치, 및/또는 병변후보와 해부학적 객체 사이의 밝기, 질감 또는 형상의 유사한 정도에 관한 정보를 포함할 수 있다. 관계정보 추출기에 의해 추출된 관계정보는 맥락정보에 포함될 수 있다. 병변 존재확률 계산기는 미리 구축된 학습데이터로부터 특정 병변후보가 특정 해부학적 구조 내에서 존재 하는 위치의 확률분포 정보를 계산할 수 있다. 병변 존재확률 계산기에 의해 계산된 확률분포 정보는 확률 정보로서 맥락정보에 포함될 수 있다. 검증 처리부는 맥락정보에 포함된 정보를 이용하여 병변후보 검증기의 검증 기능을 수행하는 컴 포넌트이다. 즉 자체정보 추출기, 관계정보 추출기, 및/또는 병변 존재확률 계산기에 의해 획득 된 자체정보, 관계정보, 확률정보 등은 맥락정보에 추가된다. 맥락정보는 도 9를 참조하여 아래에서 더 설명되는 바와 같이, 도메인 지식, 자체정보, 관계정보, 확률정보, 및/또는 인접 영상정보를 포함할 수 있다. 검증 처리부는 맥락정보 내의 도메인 지식, 자체정보, 관계정보, 확률정보, 및/또는 인접 영상 정보를 이용하여 특정 병변정보가 거짓양성인지 아닌지를 검증하는 프로세스를 수행할 수 있다. 맥락정보는 도메인 지식, 자체정보, 관계정보, 확률정보, 및/또는 인접 영상정보를 포함할 수 있는 맥락정 보를 저장하는 컴퓨터-판독가능 스토리지 매체로서 병변후보 검증기에 하나의 컴포넌트로서 포함될 수도 있 고, 또는 병변후보 검증기의 외부에 있으면서 유선 또는 무선 통신 연결에 의해 데이터 통신 가능하게 연결 되어 있는 별도의 외부 컴포넌트일 수 있다. 맥락정보에 저장되어 있는 맥락정보는 도 9에 도시된 바를 참 조하여 아래에서 더 상세히 설명된다. 도 9는 도 3의 실시예에서, 병변후보 검증기에 의해 이용되는 맥락정보의 일 실시예를 보여주는 블록도이다. 도 9를 참조하면, 맥락정보에 저장되는 해부학적 맥락정보는 해부학적 도메인 지식, 자체정보 , 관계정보, 확률정보, 및/또는 인접 영상정보를 포함할 수 있다. 맥락정보 중 도메인 지식(domain knowledge)은 영역들 사이의 위치 관계를 나타내는 정보이다. 도메인 지 식에는 적어도, \"인체의 특정 부위는 미리 정의된 해부학적 객체들을 가진다\", \"인체의 특정 부위에서, 서로 다른 해부학적 객체들은 미리 정의된 위치관계를 가진다\", 및 \"동일한 해부학적 객체들은 서로 모여서 존 재한다\"라는 정보와 같은 해부학적 객체와 관련된 일반적인 지식이 포함될 수 있다. 예컨대, 유방 초음파 영상의 경우, \"유방의 경우, 피부, 피하지방, 유방실질, 후방지방, 대흉근, 갈비뼈의 해부 학적 객체들을 가진다\", \"유방의 경우, 피부가 최상층에 위치하고, 피부의 아래에 피하지방이 위치하며, 피하지 방 아래에 유방실질이 위치하고, 유방실질 아래에 후방지방이 위치하며, 후방지방 바로 아래에 대흉균이 위치하 고, 대흉근 아래에 갈비뼈가 위치한다\"와 같은 해부학적인 위치 정보가 도메인 지식으로서 포함될 수 있다. 또한 도메인 지식에는 병변후보와 관련된 도메인 지식으로서, 예컨대 \"특정 병변후보는 인체의 특정 부위 중 특정 해부학적 객체들 내에만 존재한다\"라는 정보가 포함될 수 있다. 예컨대, 유방 초음파 영상의 경우, \"유방의 경우, 유방암이 촉진가능한 시기에, 유방암 낭종은 유방실질 부위에 존재한다\"와 같은 일반적인 의학적인 위치 정보가 포함될 수 있다. 또한 맥락정보는 또한 병변후보 및 해부학적 객체의 검출정보로부터 추출되는 자체정보를 포함할 수 있다. 자체정보는 신뢰도(confidence level), 밝기, 질감, 및/또는 형상에 관한 정보들을 포함할 수 있다. 예컨대, 특정 병변후보 또는 특정 해부학적 객체를 구성하는 픽셀의 밝기 값, 특정 병변후보 또는 특정 해부학적 객체를 나타내는 영역의 질감, 특정 병변후보 또는 특정 해부학적 객체의 형상에 관한 정보를 포함할 수 있다. 더 나아가 맥락정보는 병변후보 및 해부학적 객체의 검출정보들 사이의 상관관계로부터 추출되는 관계정보 를 포함할 수 있다. 관계정보는 병변후보와 해부학적 객체 사이의 거리, 병변후보와 해부학적 객체 사이의 상대적인 위치, 또는 병변후보와 해부학적 객체 사이의 밝기, 질감 또는 형상의 유사한 정도에 관한 정 보들 중 적어도 하나를 포함할 수 있다. 여기서, 병변후보와 해부학적 객체 사이의 상대적인 위치는, 예컨대 유 방 영상의 경우, 병변후보가 피부 및 피하지방에 대해 아래에 위치하며 대흉근에 대해 위에 위치하는지 여부를 나타내는 관계정보일 수 있다. 더 나아가 맥락정보는 확률정보를 포함할 수 있다. 확률정보는 미리 구축된 학습데이터로부터 획득 될 수 있다. 확률정보는 특정 의료 영상 내에서 병변 및 해부학적 객체 각각이 존재하는 위치의 확률분포 정보일 수 있다. 예컨대, 유방 초음파 영상의 경우, \"피부는 영상의 최상단에 100% 존재한다\", \"피하지방\"은 영상의 최상단으로 부터 10cm 떨어진 위치에서 발견될 확률은 50%이다\", \"유방암 낭종과 같은 병변은 피하지방과 후방지방 사이에 서 10 ~ 31% 확률로 발견될 수 있다\" 등과 같은 확률분포 정보가 확률정보에 포함될 수 있다. 또 더 나아가 맥락정보는 인접 영상정보를 포함할 수 있다. 인접 영상정보는, 의료 영상이 동영상 중의 연속적인 2차원 프레임들 중 하나 또는 3차원 영상의 단면들 중 하나인 경우, 인접 프레임 또는 인접 단면 에서 획득된 병변정보 및/또는 해부학적 객체의 위치 정보를 포함할 수 있다. 예컨대, 현재 의료 영상이, 3차원 초음파 볼륨 영상의 슬라이스들 중 하나인 경우, 이전에 인접한 슬라이스들을 분석한 결과 검출된 병변정보 및/또는 해부학적 객체들의 위치는 현재 슬라이스에서 검출된 병변정보 및/또는 해부학적 객체들과 연관성이 높을 것이다. 따라서, 인접 영상정보에 포함된 이전에 검출된 해부학적 객체들의 위치 정보는 현재 영상에서 검출된 병변정보 및/또는 해부학적 객체들을 검증하고 조정하기 위한 참고 자료로서 유용할 수 있다. 도 10은 도 9의 맥락정보의 예 중에서, 확률정보의 일 실시예를 보여주는 그래프이다. 도 10을 참조하면, 유방 초음파 영상에서 병변이 발견될 위치의 확률분포가 그래프로서 도시된다. 도시된 그래 프에서, 수평축은 피부에서부터 체내로 들어가는 방향으로 대흉근까지의 거리를 나타내며, 수직축은 병변이 발 견될 확률이다. 그래프에서 알 수 있는 바와 같이, 병변은 피부와 대흉근 근처에서 발견될 확률이 낮고, 피부와 대흉근 사이의 중간 지점에서 약 31% 정도까지 발견확률을 가진다는 것을 알 수 있다. 이러한 확률분포는 기존 의 병변 발견 과정에서 축적된 데이터를 학습데이터로 구축하고, 이 학습데이터를 통해 획득될 수 있다. 도 11은 의료 영상 내 거짓양성 병변후보 제거 방법의 일 실시예를 나타낸 흐름도이다. 도 11을 참조하면 의료 영상 내 거짓양성 병변후보 제거 방법은 예컨대 도 3에 도시된 시스템의 영상 입력 부로 의료 영상이 입력되는 것으로 시작될 수 있다. 이러한 의료 영상은 초음파 또는 X선 등을 이용하여 인체의 특정 부위를 촬영하는 의료 영상 진단 장치 또는 촬영 장치, 또는 이러한 영상들을 저장하고 있는 저장 장치로부터 입력될 수 있다. 영상이 입력되면, 도 3에 도시된 시스템의 병변후보 검출기 및 주변 객체 검출기에 의하여, 입력된 영 상을 분석하여, 영상 내의 특정 위치에 존재하는 병변후보 및 해부학적 객체를 관심영역으로서 검출하는 검출 단계가 진행된다. 이 검출 단계는 영상이 유방 초음파 영상인 경우, 유방암의 낭종과 같은 병변으로 의심할 수 있는 영역을 병변후보로서 검출하고, 피부, 지방, 유방실질, 근육, 뼈 등을 해부학적 객체로서 검출 할 수 있다. 그런 다음, 검출된 관심영역들 중 특히 병변후보의 거짓양성 판정을 위한 자료로서 이용하기 위하여 맥락정보가, 예컨대 도 3의 병변후보 검증기에 의해 컴퓨터-판독가능 스토리지 매체로부터, 획득된다. 맥락정보는 도 3의 맥락정보일 수 있다. 이 예에서 맥락정보는 도메인 지식을 포함할 수 있고, 컴퓨 터 판독가능한 매체 상에 미리 저장될 수 있다. 도메인 지식은, 병변후보에 관련된 도메인 지식 및/또는 해부학적 객체에 관련된 도메인 지식을 포함할 수 있다. 도메인 지식은, 예컨대, 도 9의 도메인 지식일 수 있다. 맥락정보가 획득되면, 예컨대 도 3의 병변후보 검증기에 의해, 획득한 맥락정보에 기초하여, 관심영역 중 병변후보의 거짓양성인지 여부가 검증될 수 있다. 예를 들어, 병변후보가 피부로 판정된 영역과 동일한 위 치에 존재한다면, 이 병변후보는 실제로 병변으로 판단되지 않을 가능성이 높다고 판단되고 따라서 거짓양성으 로 판단될 것이다. 예를 들어, 병변후보가 유방실질 영역에 존재한다고 판정되면, 이 병변후보는 실제로 병변으 로 판단될 가능성이 높다고 판단되고 따라서 거짓양성이 아니라고 판단될 것이다. 이러한 검증 단계의 검증 결과는, 이후 예컨대 도 3의 거짓양성 제거기에 의해 이용됨으로써, 거짓양 성이 제거된 병변후보 결과가 출력될 수 있다. 도 12는 의료 영상 내 거짓양성 병변후보 제거 방법의 다른 실시예를 나타낸 흐름도이다. 도 12를 참조하면 의료 영상 내 거짓양성 병변후보 제거 방법은 예컨대 도 3에 도시된 시스템의 영상 입력 부로 의료 영상이 입력되는 것으로 시작될 수 있다. 이러한 의료 영상은 초음파 또는 X선 등을 이용하여 인체의 특정 부위를 촬영하는 의료 영상 진단 장치 또는 촬영 장치, 또는 이러한 영상들을 저장하고 있는 저장 장치로부터 입력될 수 있다. 영상이 입력되면, 도 3에 도시된 시스템의 병변후보 검출기 및 주변 객체 검출기에 의하여, 입력된 영 상을 분석하여, 영상 내의 특정 위치에 존재하는 병변후보 및 해부학적 객체를 관심영역으로서 검출하는 검출 단계가 진행된다. 이 검출 단계는 영상이 유방 초음파 영상인 경우, 유방암의 낭종과 같은 병변으로 의심할 수 있는 영역을 병변후보로서 검출하고, 피부, 지방, 유방실질, 근육, 뼈 등을 해부학적 객체로서 검출 할 수 있다. 그런 다음, 검출된 관심영역들 중 특히 병변후보의 거짓양성 판정을 위한 자료로서 이용하기 위하여 맥락정보가, 예컨대 도 3의 병변후보 검증기에 의해 컴퓨터-판독가능 스토리지 매체로부터, 획득된다. 맥락정보는 도 3의 맥락정보일 수 있다. 이 예에서 맥락정보는 도메인 지식을 포함할 수 있고, 컴퓨 터 판독가능한 매체 상에 미리 저장될 수 있다. 도메인 지식은, 병변후보에 관련된 도메인 지식 및/또는 해부학 적 객체에 관련된 도메인 지식을 포함할 수 있다. 도메인 지식은, 예컨대, 도 9의 도메인 지식일 수 있다. 또한 이 단계에서, 병변후보 검증기는 이전 단계에서 검출된 관심영역으로부터 자체정보 및 관계 정보를 추출할 수 있다. 추출된 자체정보는 관심영역 즉 병변후보 및 해부학적 객체의 신뢰도, 밝기, 질감, 및/ 또는 형상에 관한 정보들을 포함할 수 있다. 예컨대, 특정 병변후보 또는 특정 해부학적 객체를 구성하는 픽셀 의 밝기 값, 특정 병변후보 또는 특정 해부학적 객체를 나타내는 영역의 질감, 특정 병변후보 또는 특정 해부학 적 객체의 형상에 관한 정보를 포함할 수 있다. 한편 추출된 관계정보는 병변후보와 해부학적 객체 사이의 거리, 병변후보와 해부학적 객체 사이의 상대적인 위치, 또는 병변후보와 해부학적 객체 사이의 밝기, 질감 또 는 형상의 유사한 정도에 관한 정보를 포함할 수 있다. 추출된 자체정보 및 관계정보는 예컨대 도 9의 자체정보 및 관계정보로서 맥락정보에 추가될 수 있다. 맥락정보가 획득되면, 예컨대 도 3의 병변후보 검증기에 의해, 획득한 맥락정보 즉 자체정보, 관계정보 및 도메인 지식에 기초하여, 관심영역 중 병변후보의 거짓양성인지 여부가 검증될 수 있다. 예를 들어, 병변 후보가 피부로 판정된 영역과 동일한 위치에 존재한다면, 이 병변후보는 실제로 병변으로 판단되지 않을 가능성 이 높다고 판단되고 따라서 거짓양성으로 판단될 것이다. 예를 들어, 병변후보가 유방실질 영역에 존재한다고 판정되면, 이 병변후보는 실제로 병변으로 판단될 가능성이 높다고 판단되고 따라서 거짓양성이 아니라고 판단 될 것이다. 이러한 검증 단계의 검증 결과는, 이후 예컨대 도 3의 거짓양성 제거기에 의해 이용됨으로써, 거짓양 성이 제거된 병변후보 결과가 출력될 수 있다. 도 13은 의료 영상 내 거짓양성 병변후보 제거 방법의 또 다른 실시예를 나타낸 흐름도이다. 도 13을 참조하면 의료 영상 내 거짓양성 병변후보 제거 방법은 예컨대 도 3에 도시된 시스템의 영상 입 력부로 의료 영상이 입력되는 것으로 시작될 수 있다. 이러한 의료 영상은 초음파 또는 X선 등을 이용하여 인체의 특정 부위를 촬영하는 의료 영상 진단 장치 또는 촬영 장치, 또는 이러한 영상들을 저장하고 있는 저장 장치로부터 입력될 수 있다.영상이 입력되면, 도 3에 도시된 시스템의 병변후보 검출기 및 주변 객체 검출기에 의하여, 입력된 영 상을 분석하여, 영상 내의 특정 위치에 존재하는 병변후보 및 해부학적 객체를 관심영역으로서 검출하는 검출 단계가 진행된다. 이 검출 단계는 영상이 유방 초음파 영상인 경우, 유방암의 낭종과 같은 병변으로 의심할 수 있는 영역을 병변후보로서 검출하고, 피부, 지방, 유방실질, 근육, 뼈 등을 해부학적 객체로서 검출 할 수 있다. 그런 다음, 검출된 관심영역들 중 특히 병변후보의 거짓양성 판정을 위한 자료로서 이용하기 위하여 맥락정보가, 예컨대 도 3의 병변후보 검증기에 의해 컴퓨터-판독가능 스토리지 매체로부터, 획득된다. 맥락정보는 도 3의 맥락정보일 수 있다. 이 예에서 맥락정보는 도메인 지식을 포함할 수 있고, 컴퓨 터 판독가능한 매체 상에 미리 저장될 수 있다. 도메인 지식은, 병변후보에 관련된 도메인 지식 및/또는 해부학 적 객체에 관련된 도메인 지식을 포함할 수 있다. 도메인 지식은, 예컨대, 도 9의 도메인 지식일 수 있다. 또한 이 단계에서, 병변후보 검증기는 이전 단계에서 검출된 관심영역으로부터 자체정보 및 관계 정보를 추출할 수 있다. 추출된 자체정보는 관심영역 즉 병변후보 및 해부학적 객체의 신뢰도, 밝기, 질감, 및/ 또는 형상에 관한 정보들을 포함할 수 있다. 예컨대, 특정 병변후보 또는 특정 해부학적 객체를 구성하는 픽셀 의 밝기 값, 특정 병변후보 또는 특정 해부학적 객체를 나타내는 영역의 질감, 특정 병변후보 또는 특정 해부학 적 객체의 형상에 관한 정보를 포함할 수 있다. 한편 추출된 관계정보는 병변후보와 해부학적 객체 사이의 거리, 병변후보와 해부학적 객체 사이의 상대적인 위치(유방 영상의 경우, 병변후보가 피부 및 피하지방에 대해 아래에 위치하며 대흉근에 대해 위에 위치하는지 여부와 같은), 또는 병변후보와 해부학적 객체 사이의 밝기, 질감 또는 형상의 유사한 정도에 관한 정보를 포함할 수 있다. 추출된 자체정보 및 관계정보는 예컨대 도 9의 자체정보 및 관계정보로서 맥락정보에 추가될 수 있다. 더 나아가 맥락정보는 확률정보를 포함할 수 있다. 확률정보는 미리 구축된 학습데이터로부터 획득될 수 있다. 확률정보는 특정 의료 영상 내에서 병변 및 해부학적 객체 각각이 존재하는 위치의 확률분포 정보일 수 있다. 이 확률정보는 도메인 지식과 마찬가지로 미리 저장된다. 확률정보는 예컨대 도 9의 확률정보로서 맥락정 보에 추가될 수 있다. 또 더 나아가 맥락정보는 인접 영상정보를 포함할 수 있다. 의료 영상이 동영상 중의 연속적인 2차원 프레임들 중 하나 또는 3차원 영상의 단면들 중 하나인 경우, 인접 영상정보는 현재 프레임 또는 현재 단면에 대해 인접 하는 인접 프레임 또는 인접 단면에서 획득될 수 있다. 이러한 인접 영상정보는 병변정보 및/또는 해부학적 객 체의 위치 정보를 포함할 수 있다. 이 인접 영상정보는 도메인 지식 및 확률정보와 마찬가지로 미리 저장된다. 인접 영상정보는 예컨대 도 9의 인접 영상정보로서 맥락정보에 추가될 수 있다. 맥락정보가 획득되면, 예컨대 도 3의 병변후보 검증기에 의해, 획득한 맥락정보 즉 자체정보, 관계정보 및 도메인 지식에 기초하여, 관심영역 중 병변후보의 거짓양성인지 여부가 검증될 수 있다. 예를 들어, 병변 후보가 피부로 판정된 영역과 동일한 위치에 존재한다면, 이 병변후보는 실제로 병변으로 판단되지 않을 가능성 이 높다고 판단되고 따라서 거짓양성으로 판단될 것이다. 예를 들어, 병변후보가 유방실질 영역에 존재한다고 판정되면, 이 병변후보는 실제로 병변으로 판단될 가능성이 높다고 판단되고 따라서 거짓양성이 아니라고 판단 될 것이다. 이러한 검증 단계의 검증 결과는, 이후 예컨대 도 3의 거짓양성 제거기에 의해 이용됨으로써, 거짓양 성이 제거된 병변후보 결과가 출력될 수 있다. 상술한 의료 영상 내 거짓양성 병변후보 제거 시스템은, 프로세서, 메모리, 사용자 입력장치, 프레젠테이션 장 치 중 적어도 일부를 포함하는 컴퓨팅 장치에 의해 구현될 수 있다. 메모리는, 프로세서에 의해 실행되면 특정 태스크를 수행할 있도록 코딩되어 있는 컴퓨터-판독가능 소프트웨어, 애플리케이션, 프로그램 모듈, 루틴, 인스 트럭션(instructions), 및/또는 데이터 등을 저장하는 매체이다. 프로세서는 메모리에 저장되어 있는 컴퓨터-판 독가능 소프트웨어, 애플리케이션, 프로그램 모듈, 루틴, 인스트럭션, 및/또는 데이터 등을 판독하여 실행할 수 있다. 사용자 입력장치는 사용자로 하여금 프로세서에게 특정 태스크를 실행하도록 하는 명령을 입력하거나 특 정 태스크의 실행에 필요한 데이터를 입력하도록 하는 수단일 수 있다. 사용자 입력장치는 물리적인 또는 가상 적인 키보드나 키패드, 키버튼, 마우스, 조이스틱, 트랙볼, 터치-민감형 입력수단, 또는 마이크로폰 등을 포함 할 수 있다. 프레젠테이션 장치는 디스플레이, 프린터, 스피커, 또는 진동장치 등을 포함할 수 있다. 컴퓨팅 장치는 스마트폰, 태블릿, 랩탑, 데스크탑, 서버, 클라이언트 등의 다양한 장치를 포함할 수 있다. 컴퓨 팅 장치는 하나의 단일한 스탠드-얼론 장치일 수도 있고, 통신망을 통해 서로 협력하는 다수의 컴퓨팅 장치들로 이루어진 분산형 환경에서 동작하는 다수의 컴퓨팅 장치를 포함할 수 있다. 또한 상술한 의료 영상 내 거짓양성 병변후보 제거 방법은, 프로세서를 구비하고, 또한 프로세서에 의해 실행되 면 의료 영상 내 거짓양성 병변후보 제거 방법을 수행할 있도록 코딩된 컴퓨터 판독가능 소프트웨어, 애플리케 이션, 프로그램 모듈, 루틴, 인스트럭션, 및/또는 데이터 구조 등을 저장한 메모리를 구비하는 컴퓨팅 장치에 의해 실행될 수 있다. 도 1 내지 도 10을 참조하여 기술된 영상 내 거짓양성 병변후보 제거 시스템들은 단지 예시에 불과하다. 해당"}
{"patent_id": "10-2014-0019265", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "기술분야의 통상의 지식을 가진 자는, 청구항들의 범위 내에서 다양한 조합의 다른 시스템들이 가능하다는 것을 쉽게 이해할 것이다. 영상 내 거짓양성 병변후보 제거 시스템의 컴포넌트들은, 각각의 기능을 구현하는 회로들 을 포함하는 하드웨어에 의해 구현될 수 있다. 또한 영상 내 거짓양성 병변후보 제거 시스템의 컴포넌트들은, 컴퓨팅 장치의 프로세서에 의해 수행되면 특정 태스크를 실행할 수 있도록 하는 컴퓨터-실행가능 소프트웨어, 펌웨어 및 하드웨어의 조합에 의해 구현될 수도 있다. 한편 도 11 내지 도 13을 참조하여 기술된 영상 내 거짓양성 병변후보 제거 방법들은 단지 예시에 불과하다. 해"}
{"patent_id": "10-2014-0019265", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "당 기술분야의 통상의 지식을 가진 자는, 청구항들의 범위 내에서 다양한 조합의 다른 방법들이 가능하다는 것 을 쉽게 이해할 것이다. 영상 내 거짓양성 병변후보 제거 방법의 예들은, 컴퓨팅 장치의 프로세서에 의해 수행 되면 특정 태스크를 실행할 수 있도록 하는 컴퓨터-실행가능 인스트럭션으로 코딩될 수 있다. 컴퓨터-실행가능 인스트럭션은 소프트웨어 개발자에 의해 예를 들어 베이직, 포트란, C, C++ 등과 같은 프로그래밍 언어에 의해 코딩된 후, 기계언어로 컴파일될 수 있다."}
{"patent_id": "10-2014-0019265", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일반적인 컴퓨터 보조 진단 시스템의 구성을 예시한 블록도, 도 2는 유방 초음파 영상 내의 병변후보 및 해부학적 구조를 예시한 도면, 도 3은 의료 영상 내 거짓양성 병변후보 제거 시스템의 일 실시예를 나타낸 블록도, 도 4는 도 3의 실시예에서, 주변 객체 검출기의 일 실시예를 나타낸 블록도, 도 5는 도 4의 주변 객체 검출기의 피처 맵의 예들을 보여주는 도면, 도 6은 도 3의 실시예에서, 주변 객체 검출기의 다른 실시예를 설명하기 위한 도면, 도 7은 도 3의 실시예에서, 원본 영상에서 검출된 병변후보 및 해부학적 객체들이 표시된 합성 영상의 예를 설 명하기 위한 도면, 도 8은 도 3의 실시예에서, 병변후보 검증기의 일 실시예를 더 상세히 나타낸 블록도, 도 9는 도 3의 실시예에서, 병변후보 검증기에 의해 이용되는 맥락정보의 일 실시예를 나타낸 블록도, 도 10은 도 9의 맥락정보의 예 중에서, 확률정보의 일 실시예를 나타낸 그래프, 도 11은 의료 영상 내 거짓양성 병변후보 제거 방법의 일 실시예를 나타낸 흐름도, 도 12는 의료 영상 내 거짓양성 병변후보 제거 방법의 다른 실시예를 나타낸 흐름도, 도 13은 의료 영상 내 거짓양성 병변후보 제거 방법의 또 다른 실시예를 나타낸 흐름도이다."}
