{"patent_id": "10-2011-7002245", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2011-0028526", "출원번호": "10-2011-7002245", "출원인": "소니 일렉트로닉스 인코포레이티드", "발명자": "아브라함스 마크 데이비드"}}
{"patent_id": "10-2011-7002245", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "복수의 사용자 - 상기 사용자는 벤더 웹 사이트에 액세스하기 위해 컴퓨터 네트워크에 접속된 사용자 컴퓨터를구비함 -에 의해 컴퓨터 네트워크를 통해 액세스가능한 벤더 웹 사이트를 통해 벤더 컴퓨터로부터 사용자 컴퓨터에게 추천을 제공하기 위한 컴퓨터 시스템에서, 그래픽 전자 컴포넌트 생성 시스템은,벤더 컴퓨터 상에서 실행가능하고, 벤더의 전자 컴포넌트를 나타내고 벤더 컴퓨터 웹 사이트를 통해 사용자를인터렉티브하게 가이드하는 인터렉티브 벤더 그래픽 전자 컴포넌트를 벤더 컴퓨터로 하여금 생성하도록 유발하기 위한 명령을 포함하는 그래픽 전자 컴포넌트 생성 프로그램을 포함하고,상기 그래픽 전자 컴포넌트 생성 프로그램은, 사용자에 의한 선택을 위해 사용자 컴퓨터와 연관된 표시 디바이스 상에 상기 인터렉티브 벤더 전자 컴포넌트를 상기 사용자 컴퓨터가 표시하도록 유발하는 벤더 웹 사이트에상기 사용자 컴퓨터가 액세스했을 때, 상기 사용자 컴퓨터에 표시 명령을 전송하도록 동작하고,상기 벤더 컴퓨터는, 사용자로부터 개인 정보를 수신하도록 동작하고, 상기 사용자-선택된 전자 컴포넌트 서브세트와 조합하여 상기 수신된 개인 정보를 분석하며, 상기 개인 정보에 기초하여 추가 컴포넌트 또는 액세서리의 추천을 사용자에게 프리젠팅하도록 동작하는 인공 지능(Artificial Intelligence) 기능을 포함하는 시스템."}
{"patent_id": "10-2011-7002245", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 벤더 컴퓨터는 벤더 웹 사이트와 인터렉트하는 사용자 컴퓨터에 의해 선택된 전자 컴포넌트를 나타내는 데이터를 기록하고, 사용자에 의해 제공되거나 이력 데이터 또는 클릭 스트림 데이터를 통해 획득된 개인 데이터를 기록하는 시스템."}
{"patent_id": "10-2011-7002245", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 벤더 컴퓨터는 상기 인공 지능 기능을 이용함으로써, 사용자의 전자 컴포넌트를 분석하고사용자의 개인적 선호도에 따라 향상되거나 추가적인 전자 컴포넌트를 추천하는 시스템."}
{"patent_id": "10-2011-7002245", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 AI 기능은 사용자의 개인 정보를 추가로 분석하여 추가적인 벤더 제품을 교차-판매하거나업-판매할 수 있는 시스템."}
{"patent_id": "10-2011-7002245", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 전자 컴포넌트는 AV 컴포넌트를 포함하는 시스템."}
{"patent_id": "10-2011-7002245", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 인터렉티브 벤더 그래픽 전자 컴포넌트 디스플레이는 적어도 하나의 다이얼로그 박스를포함하는 시스템."}
{"patent_id": "10-2011-7002245", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 상기 인터렉티브 벤더 그래픽 전자 컴포넌트 디스플레이는 각각이 연관된 다이얼로그 박스에표시되는 분리된 전자 컴포넌트를 나타내는 데이터를 포함하고, 사용자는 각 다이얼로그 박스로부터 전자 컴포넌트를 독립적으로 선택하거나 선택하지 않을 수 있는 시스템."}
{"patent_id": "10-2011-7002245", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 각 전자 컴포넌트의 각 연관된 다이얼로그 박스는 상기 연관된 전자 컴포넌트의 적어도하나의 모델을 나타내는 데이터를 포함하는 시스템."}
{"patent_id": "10-2011-7002245", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "공개특허 10-2011-0028526-2-제7항에 있어서, 상기 각 전자 컴포넌트의 각 연관된 다이얼로그 박스는 상기 연관된 전자 컴포넌트의 복수의다른 모델을 나타내는 데이터를 포함하는 시스템."}
{"patent_id": "10-2011-7002245", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제7항에 있어서, 상기 전자 컴포넌트는 AV 컴포넌트를 포함하는 시스템."}
{"patent_id": "10-2011-7002245", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서, 상기 AV 컴포넌트는 AM/FM 수신기, 증폭기, 턴테이블, 등화기, 컴팩트 디스크(CD) 플레이어,DVD 플레이어, 카세트 레코더/플레이어, DAT 플레이어, 텔레비전, HD 텔레비전, 범용 컴퓨터, MD 플레이어,TiVo 레코더/플레이어, 비디오 카세트 레코더/플레이어(VCR/P) 또는 레이저 디스크 플레이어를 포함하는 그룹에서 선택되는 시스템."}
{"patent_id": "10-2011-7002245", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "전자 컴포넌트 세트의 전자 컴포넌트 접속성 구성을 결정하기 위한 컴퓨터-구현 방법에 있어서,분석 엔진을 제공하는 단계;로직 규칙을 포함하는 규칙 데이터베이스를 제공하는 단계;상기 전자 컴포넌트 세트의 주지된 속성을 분석하는 단계; 및상기 규칙 데이터베이스로부터 규칙을 적용하여 적합한 전자 컴포넌트 접속성 구성을 결정하는 단계를포함하고, 상기 방법은사용자로부터 개인 정보를 수신하는 단계;상기 사용자-선택된 전자 컴포넌트 서브세트와 조합하여 상기 수신된 개인 정보를 분석하는 단계; 및상기 개인 정보에 기초하여 추가 컴포넌트 또는 액세서리의 추천을 사용자에게 프리젠팅하는 단계를 더 포함하는 컴퓨터-구현 방법."}
{"patent_id": "10-2011-7002245", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서, 상기 분석 엔진은 상기 전자 컴포넌트들 사이에 존재하는 양립불가능성을 더 결정하는 컴퓨터-구현 방법.명 세 서기 술 분 야본 발명은 인핸스먼트(enhancement) 및 액세서리와 같은 다른 정보뿐만 아니라, 전자 컴포넌트 접속성 구성을 [0001]전자 컴포넌트의 사용자에게 추천하기 위한 방법 및 시스템에 관한 것으로, 특히 본 발명은 오디오비주얼(AudioVisual: AV) 컴포넌트 및 그 액세서리에 관련된 정보를 사용자에게 제공하기 위한 방법 및 시스템에 관한 것이다.배 경 기 술현재, 가정 및 전문가 사용을 위한 전자 컴포넌트의 인기가 상승하고 있다. 특히, 이들 전자 컴포넌트를 포함 [0002]하는 홈/오피스 오락 기기는 더 널리 퍼지고 있고, 동시에 더욱 더 복잡하게 되고 있다. 이렇게 복잡성이 증가된 하나의 원인은 부분적으로는, 보통의 소비자(또는 사용자)에게 현재 가용한 전자 컴포넌트들의 증가하는 개수 및 다양성 때문이다. 특히, 몇 가지를 들면, 중앙 채널 스피커, 서브우퍼, 서라운드 사운드 시스템, 컴팩트디스크(CD) 플레이어, 미니 디스크(MD) 플레이어, DVD 플레이어, DAT 레코더/플레이어, 테이프 카세트 레코더/플레이어, VCR, 종래 대형 스크린 및 고해상도(HD) 텔레비전, 케이블 및 위성 디시 신호 소스, 셋탑 인터넷 시스템, 컴퓨터 제어 시스템, TiVo(VCR이 필요없는 MPEG-기반의 텔레비전 프로그램 저장장치), 등을 포함하여,범용 컴퓨터 및 컴퓨터 시스템, AM/FM 스테레오 튜너/수신기, 축음기 플레이어, 증폭기, 프리-증폭기, 확성기가있다. 공개특허 10-2011-0028526-3-뿐만 아니라, 사용자는 선택할 복수의 브랜드 이름, 각 회사에 의해 제공되는 수많은 모델, 조합할 컴포넌트 타 [0003]입간의 폭넓은 변동, 현재 및 새로운 기기간의 양립성 또는 양립불가능성, 아날로그 및 디지털과 같은 현재 및미래 인터페이스 기술간의 양립성 또는 양립불가능성, COAX, RCA 잭, 광학 포트 등에 직면할 수 있다. 이러한모든 기기는 이하에서, 집합적으로 전자 컴포넌트 또는 전자 기기로서 지칭되고, 서브 세트는 AV 컴포넌트 또는기기 및 관련된 액세서리이다.다수의 전자 기기 사용자들은 상기 언급된 기기의 각각 및 모든 것을 함께 접속하는데 어려움을 가질 것이라고 [0004]생각하는 것은 어렵지 않다. 기기 또는 컴포넌트 중, 전체는 아니라도, 대부분이, 기기가 그 의도된 목적에 따라 수행되도록, 적어도 적절한 구성으로 함께 접속되는 것이 바람직하다. 각 컴포넌트에 의해 가용하게 되는특징들 중, 모두는 아니라도, 대부분을, 컴포넌트간의 양립불가능성에 충돌함이 없이, 활용하는 것이 바람직하다. 예를 들어, AV 컴포넌트에 대해, DVD 플레이어는 광학 입력 및 출력 포트를 가지고 있지만, 수신기는 단지RCA 잭만을 가지고 있다. 그러므로, DVD 플레이어의 광학 입력 및 출력을 이용하는 것이 가장 바람직한 것으로보이지만, 대신에, 사용자는 수신기를 수용하기 위해 RCA 잭을 이용해야만 한다.현재, 원하는 컴포넌트를 함께 구성하는 것을 돕는 경우에, 사용자들은 각 컴포넌트에 대한 제품 매뉴얼을 검토 [0005]하고, 각 컴포넌트의 각 벤더의 판매대리인을 접촉하거나, 동일하거나 유사한 컴포넌트의 다른 사용자로부터 도움을 얻는 것을 포기한다. 제품 매뉴얼은 사용자의 전체 시스템 컴포넌트의, 종종 배선 구성과 같은 특정 접속성 구성도를, 있다 하더라도, 거의 제공하지 않는다. 하나의 벤더는, 적절한 접속을 용이하게 하는데 필요한다른 벤더의 컴포넌트에 관한 정보를 가지고 있지 않는다. 이것은 사용자가 새롭거나 현재 기술수준의 컴포넌트 및/또는 다른 벤더의 컴포넌트와 조합된 과거 및 구식 컴포넌트를 가지고 있는 경우에 특히 그렇다. 마지막으로, 사용자는 컴포넌트 구성을 결정하는데 과도한 양의 시간을 소비해야 하고, 더욱 더 나쁜 것은, 시스템을함께 접속하는 것과 관련하여, 사용자보다 동일하거나 적은 지식을 가진 다른 사용자를 의지해야 한다는것이다.결과적으로, 사용자는 배선 및 입출력 접속성 구성, 또는 동작하는 전자 컴포넌트 시스템을 달성하기 위해 이해 [0006]될 필요가 있는 옵션 및 도면에 대해 혼란한 상태로 남아있다.앞서 언급한 어려움뿐만 아니라, 그러한 전자 기기의 사용자들은 그러한 기기에 관한 다른 정보를 원할 수 [0007]있다. 예를 들면, 사용자는 특정 기기를 현재 소유하거나 구입할 의사가 있고, 구입하고자 하는 기기가 최고급품인지 또는 단지 중간 정도인지 여부를 알기를 원할 수 있다. 사용자는 또한 어느 컴포넌트가 양립가능한지또는, 더 양호하게는, 어느 컴포넌트가 다른 컴포넌트와 가장 잘 동작하는지를 결정하기를 원할 수 있다. 마지막으로, 사용자는 “원-스톱-쇼핑” 경험을 원하고, 특정 사용자 파라미터가 주어진 상태에서 컴포넌트의 최상의 조합을 결정되도록 사용자의 전자 컴포넌트 시스템 요구사항이 분석될 수 있게 할 수 있기를 바랄 수 있다.뿐만 아니라, 사용자는 특정 컴포넌트에 대해 가용한 전체 액세서리 범위에 관해 알기를 원할 수 있다.따라서, 사용자의 현재 및 장래 컴포넌트에 관한 정보를 수신하는 방법을 제공하고 그 사용자에게 적절한 컴포 [0008]넌트 접속성 구성을 제공하는 방법 및 시스템이 필요하다. 뿐만 아니라, 사용자로부터 개인 정보의 수신 시,사용자가 주변장치, 비디오 카세트, 테이프 카세트, CD, DVD, MD 등과 같은 관련된 상품뿐만 아니라, 인핸스먼트, 업그레이드, 추가 또는 관련된 기기를 구매하도록 설득하는 추가 제안 및 추천을 제공하는 것이 필요하다.발명의 내용과제의 해결 수단본 발명의 하나의 양태에 따르면, 사용자에게 추천된 전자 컴포넌트 접속성구성을 프리젠팅하기 위한 컴퓨터-구 [0009]현 방법이 제공된다. 본 발명의 하나의 양태의 양호한 실시예는 적어도 소정 사용자-선택가능한 전자 컴포넌트의 그룹을 나타내는 데이터를 표시하기 위한 사용자 인터페이스 디스플레이를 제공하는 단계, 소정 사용자-선택가능한 전자 컴포넌트 그룹으로부터 사용자-선택된 전자 컴포넌트 서브세트를 나타내는 데이터를 수신하는단계, 메모리 저장 디바이스로부터 사용자 선택된 전자 컴포넌트 서브세트의 각 컴포넌트와 연관된 속성을 검색하는 단계, 사용자-선택된 전자 컴포넌트 서브세트를 나타내는 데이터와, 연관된 속성을 비교하여, 적합한 전자컴포넌트 접속성 구성을 결정하는 단계, 및 전자 컴포넌트 접속성 구성을 나타내는 데이터를 사용자에게 프리젠팅하는 단계를 포함한다. 양호하게는, 전자 컴포넌트는 AV 컴포넌트를 포함한다.바람직하게는, 본 양호한 실시예에 따른 방법은 그래픽 데이터를 표시하기 위한 그래픽 사용자 인터페이스 디스 [0010]플레이를 제공하는 단계를 포함한다. 더 바람직하게는, 방법은 사용자-선택된 전자 컴포넌트 서브세트의 전자공개특허 10-2011-0028526-4-컴포넌트 접속성 구성의 그래픽 표현을 프리젠팅하는 단계를 포함한다. 가장 바람직하게는, 전자 컴포넌트 접속성 구성의 그래픽 표현을 프리젠팅하는 단계는, 사용자-선택된 전자 컴포넌트 서브세트의 각 전자 컴포넌트상에서 적절한 커넥터간의 접속을 보여주는 전기 와이어 또는 신호 케이블(특정 와이어는 라벨링됨)의 표현을표시하는 단계를 포함한다.바람직하게는, 본 양호한 실시예는 사용자로부터 개인 정보를 수신하는 단계, 사용자-선택된 전자 컴포넌트 서 [0011]브세트와 조합하여 개인 정보를 분석하는 단계, 및 추가 또는 다른 컴포넌트 또는 액세서리와 같은 추가 정보의추천을 사용자에게 프리젠팅하는 단계를 더 포함한다. 바람직하게는, 이러한 원하는 방법은 사용자-선택된 전자 컴포넌트 서브세트에서 사용자에 의해 선택된 것들과는 달리, 특정 전자 컴포넌트에 관해 사용자에게 정보를포워딩하는 단계를 포함한다. 가장 바람직하게는, 개인 정보는 사용자 인구통계학적 데이터, 구매 이력데이터, 클릭 스트림 데이터 또는 사용자-제공된 데이터로 구성된 그룹으로부터 선택된다. 가장 바람직한 실시예에서, 상기 양호한 방법은 사용자-선택된 전자 컴포넌트 서브세트로부터 전자 컴포넌트 중 [0012]적어도 하나에 대한 기술적 스펙 및 접속성 정보를 검색하는 단계를 포함한다. 가장 바람직하게는, 전자 컴포넌트의 대표 데이터는 객체-지향 데이터베이스에 전자 컴포넌트 타입별로 저장된다.가장 바람직하게는, 전자 컴포넌트 접속성 구성을 프리젠팅하는 단계는 입력 및 출력 포트를 포함하여, 사용자- [0013]선택된 전자 컴포넌트 서브세트의 그래픽 표현을 프리젠팅하는 단계, 및 사용자에 의해 다르게는 선택되지 않고사용자가 사용자의 시스템을 향상시키기 위해 구매하기를 원하는 제안된 전자 컴포넌트의 그래픽 표현을 프리젠팅하는 단계를 포함한다.상기 설명된 양호한 실시예를 따른 방법은 가용한 전자 컴포넌트의 텍스트 표현을 표시할 수 있고 사용자 입력 [0014]및 선택을 수신할 수 있는 텍스트 표시 디바이스를 통해 달성된다. 바람직하게는, 텍스트 표시 디바이스는 전자 컴포넌트를 포함한다. 더 바람직하게는, 전자 컴포넌트는 전자 컴포넌트의 사용자 그룹내에 존재한다. 가장 바람직하게는, 표시 디바이스는 스크롤가능한 표시 스크린을 표함하는 DVD 플레이어를 포함한다.상기 설명된 양호한 실시예에 따른 방법은, 컴퓨터 네트워크를 통해 달성된다. 네트워크는 로컬 영역 네트워크 [0015](LAN) 또는 와이드 영역 네트워크(WAN)를 포함한다. 네트워크는 또한 클라이언트/서버 네트워크를 포함한다.가장 바람직하게는, 네트워크는 인터넷과 같은 글로벌 컴퓨터 정보 네트워크를 포함한다.본 발명의 또 다른 양태에 따르면, 복수의 사용자에 의해 컴퓨터 네트워크를 통해 액세스가능한 벤더 웹 사이트 [0016]를 통해 전자 컴포넌트의 사용자에게 추천을 제공하기 위한 컴퓨터-구현 방법이 제공된다. 사용자는 벤더 웹사이트에 액세스하기 위해 컴퓨터 네트워크에 접속된 사용자 컴퓨터를 구비한다.본 발명의 이러한 양태에 따른 양호한 실시예는 적어도 소정 사용자-선택가능한 전자 컴포넌트 그룹을 나타내는 [0017]데이터를 포함하는 벤더/사용자 인터렉티브 웹 사이트를 제공하는 단계, 소정 사용자-선택가능한 전자 컴포넌트의 그룹으로부터 사용자-선택된 전자 컴포넌트 서브세트를 나타내고, 컴퓨터 네트워크를 통해 전자적으로 포워딩된 데이터를, 수신하는 단계, 사용자-선택된 전자 컴포넌트 서브세트를 나타내는 데이터를 객체-지향 데이터베이스에 저장하는 단계, 사용자 선택된 전자 컴포넌트 서브세트의 각각을 그 연관된 기술적 속성으로 식별하는단계, 사용자-선택된 전자 컴포넌트 서브세트의 기술적 속성을 비교하여 적합한 전자 컴포넌트 접속성 구성을결정하는 단계, 및 제안된 전자 컴포넌트 접속성 구성을 나타내는 데이터를 컴퓨터 네트워크를 통해 사용자에게전자적으로 포워딩하는 단계를 포함한다.본 발명의 이러한 양태의 양호한 실시예에 따르면, 사용자 인터페이스 디스플레이를 제공하는 단계는 그래픽 사 [0018]용자 인터페이스 디스플레이를 제공하는 단계를 더 포함한다. 더 바람직하게는, 이러한 단계는 사용자-선택된전자 컴포넌트 서브세트의 전자 컴포넌트 접속성 구성의 그래픽 표현을 프리젠팅하는 단계를 포함한다. 더 바람직하게는, 그래픽 프리젠테이션은 사용자-선택된 전자 컴포넌트 서브세트의 각 전자 컴포넌트 상에서 적절한커넥터의 접속을 보여주는 전기 와이어 또는 신호 케이블(일부는 라벨링됨)을 나타내는 데이터를 표시하는 단계를 포함한다. 바람직하게는, 본 실시예는 사용자로부터 개인 정보를 수신하는 단계, 사용자-선택된 전자 컴포넌트 서브세트와 [0019]조합하여 개인 정보를 분석하는 단계, 및 추가 컴포넌트 또는 액세서리의 추천을 사용자에게 프리젠팅하는 단계를 더 포함한다. 양호하게는, 이러한 추천을 프리젠팅하는 단계는, 사용자-선택된 전자 컴포넌트 서브세트에서사용자에 의해 이전에 선택된 것과는 달리 벤더 컴포넌트에 관련된 정보를 포워딩하는 단계를 포함한다. 바람직하게는, 개인 정보는 사용자 인구통계학적 데이터, 구매 이력 데이터, 클릭 스트림 데이터 또는 사용자-제공공개특허 10-2011-0028526-5-된 데이터를 포함하는 그룹으로부터 선택된다. 가장 바람직하게는, 각 컴포넌트의 기술적 속성을 검색하는 단계는, 사용자-선택된 전자 컴포넌트 서브세트로부터 전자 컴포넌트 중 적어도 하나에 대한 기술적 스펙 및 접속성 정보를 검색하는 단계를 포함한다.본 발명의 이러한 양태의 가장 양호한 실시예에서, 전자 컴포넌트 접속성 구성을 프리젠팅하는 단계는 입/출력 [0020]포트 또는 잭을 포함하여, 사용자-선택된 전자 컴포넌트 서브세트의 그래픽 표현을 프리젠팅하는 단계, 및 사용자가 사용자의 전자 컴포넌트 시스템을 향상시키기 위해 구매하기를 원하는 제안된 전자 컴포넌트를 프리젠팅하는 단계를 포함한다. 가장 바람직하게는, 전자 컴포넌트는 AV 컴포넌트를 포함한다.본 발명의 또 다른 양태에 따르면, 복수의 사용자에 의해 컴퓨터 네트워크를 통해 액세스가능한 벤더 웹 사이트 [0021]를 통해 벤더 컴퓨터로부터 사용자 컴퓨터에게 추천을 제공하기 위한 컴퓨터 시스템에서 - 사용자는 벤더 웹 사이트에 액세스하기 위해 컴퓨터 네트워크에 접속된 사용자 컴퓨터를 구비함 -, 그래픽 전자 컴포넌트 생성 시스템은 벤더 컴퓨터 상에서 실행가능하고, 벤더의 전자 컴포넌트를 나타내고 벤더 컴퓨터 웹 사이트를 통해 사용자를 인터렉티브하게 가이드하는 인터렉티브 벤더 그래픽 전자 컴포넌트를 벤더 컴퓨터로 하여금 생성하도록 유발하기 위한 명령을 포함하는 그래픽 전자 컴포넌트 생성 프로그램을 포함한다. 그래픽 전자 컴포넌트 생성 프로그램은, 사용자에 의한 선택을 위해 사용자 컴퓨터와 연관된 표시 디바이스 상에 인터렉티브 벤더 전자 컴포넌트를 사용자 컴퓨터가 표시하도록 유발하는 벤더 웹 사이트에 사용자 컴퓨터가 액세스했을 때, 사용자 컴퓨터에 표시 명령을 전송하도록 동작한다.본 발명의 이러한 양태의 양호한 실시예에 따르면, 벤더 컴퓨터는 사용자 선택된 전자 컴포넌트를 기록하고, 사 [0022]용자에 의해 제공되거나 이력 데이터 또는 클릭 스트림 데이터를 통해 획득된 개인 데이터를 기록한다. 바람직하게는, 벤더 컴퓨터는 벤더 컴퓨터가 사용자의 전자 컴포넌트를 분석하고 사용자의 개인적 선호도에 따라 향상되거나 추가적인 전자 컴포넌트를 추천하도록 허용하는 인공 지능(Artificial Intelligence: AI) 기능을 포함한다. 더 바람직하게는, AI 기능은 이들 용어들이 본 명세서에 기재된 바와 같이, 추가적인 벤더 제품을 교차-판매하거나 업-판매할 수 있도록 사용자의 개인 정보를 추가로 분석한다.본 발명의 추가 양태에 따르면, 전자 컴포넌트의 사용자에게 추천을 프리젠팅하기 위한 컴퓨터-구현 방법이 제 [0023]공된다. 본 발명의 이러한 양태의 양호한 실시예에 따른 방법은, 객체 지향 데이터베이스로부터, 적어도 소정사용자-선택가능한 전자 컴포넌트의 그룹을 나타내는 데이터를 포함하는 사용자 인터페이스 디스플레이를 제공하는 단계, 소정 사용자-선택가능한 전자 컴포넌트 그룹으로부터 사용자-선택된 전자 컴포넌트 서브세트를 나타내는 데이터를 수신하는 단계, 전자 컴포넌트 속성 수집 모듈로부터, 사용자-선택된 전자 컴포넌트 서브세트의각 컴포넌트와 연관된 속성을 검색하는 단계, 사용자-선택된 전자 컴포넌트 서브세트의 수신된 데이터 및 연관된 속성을 규칙 데이터베이스를 구비하는 분석 엔진에 전달하는 단계, 사용자-선택된 전자 컴포넌트 서브세트및 연관된 속성을 분석하여 적합한 전자 컴포넌트 접속성 구성을 결정하는 단계, 및 전자 컴포넌트 접속성 구성을 나타내는 데이터를 사용자에게 프리젠팅하는 단계를 포함한다.바람직하게는, 컴포넌트 객체 지향 데이터베이스의 각 전자 컴포넌트 오브젝트는 각 전자 컴포넌트의 기술적 정 [0024]보를 포함한다. 기술적 정보는 바람직하게는 전자 컴포넌트와 연관된 입/출력 포트 또는 잭의 타입을포함한다. 기술적 정보는 전자 컴포넌트에 의해 지원되는 사운드 성능 타입을 포함한다. 바람직하게는, 사운드 성능 타입은 디지털 사운드 성능을 포함한다. 기술적 정보는 각 전자 컴포넌트와 연관된 디바이스 버스의타입을 포함한다.이러한 본 발명의 양태의 양호한 실시예에서, 전자 컴포넌트의 속성을 조사하고, 규칙 데이터베이스로부터 규칙 [0025]을 적용하여, 적합한 입/출력 접속성 구성을 결정하고 전자 컴포넌트들 사이에 존재하는 양립불가능성을 결정하는 분석 엔진이 제공된다. 바람직하게는, 적합한 입/출력 컴포넌트 접속성 구성은 광학, RCA 잭 또는 COAX 접속성 구성을 포함한다.또 다른 양호한 실시예에서, 사용자 인터페이스 디스플레이는 전자 컴포넌트를 포함한다. 가장 바람직하게는, [0026]전자 컴포넌트는 DVD 플레이어와 같은 AV 컴포넌트를 포함한다. 이러한 양호한 실시예에서, 소정 사용자-선택가능한 전자 컴포넌트 그룹을 나타내는 데이터는 적어도 텍스트 포맷 또는 적어도 그래픽 포맷으로 사용자에게제공된다.상기 언급된 양태들의 또 다른 실시예에 따르면, 소정 사용자-선택가능한 전자 컴포넌트 그룹을 나타내는 데이 [0027]터가 적어도 하나의 다이얼로그 박스로 표시되는 그래픽 사용자 인터페이스 디스플레이가 제공된다. 바람직하게는, 소정 사용자-선택가능한 전자 컴포넌트 그룹은 각각이 연관된 다이얼로그 박스에 표시되는 분리된 전자공개특허 10-2011-0028526-6-컴포넌트를 포함하고, 사용자는 각 다이얼로그 박스로부터 전자 컴포넌트를 독립적으로 선택하거나 선택하지 않을 수 있다. 각 전자 컴포넌트의 각 연관된 다이얼로그 박스는 연관된 전자 컴포넌트의 적어도 하나의 모델을포함한다. 더 바람직하게는, 각 전자 컴포넌트의 각 연관된 다이얼로그 박스는 연관된 전자 컴포넌트의 복수의다른 모델을 나타내는 데이터를 포함한다. 전자 컴포넌트는 바람직하게는 AV 컴포넌트이고, AM/FM 수신기, 증폭기, 턴테이블, 등화기, 컴팩트 디스크(CD) 플레이어, DVD 플레이어, 카세트 레코더/플레이어, DAT 플레이어,텔레비전, HD 텔레비전, 범용 컴퓨터, MD 플레이어, TiVo 레코더/플레이어, 비디오 카세트 레코더/플레이어(VCR/P) 또는 레이저 디스크 플레이어를 포함한다.상기 설명된 바와 같은 본 발명의 컴퓨터 시스템 양태에서, 인터렉티브 그래픽 전자 컴포넌트 디스플레이가 적 [0028]어도 하나의 다이얼로그 박스를 포함하는 양호한 실시예가 제공된다. 바람직하게는, 인터렉티브 벤더 그래픽전자 컴포넌트 디스플레이는 각각이 연관된 다이얼로그 박스에 표시되는 분리된 전자 컴포넌트의 표현을 포함하고, 사용자는 각 다이얼로그 박스로부터 전자 컴포넌트를 독립적으로 선택하거나 선택하지 않을 수 있다. 더바람직하게는, 각 전자 컴포넌트의 각 연관된 다이얼로그 박스는 연관된 전자 컴포넌트의 적어도 하나의 모델을나타내는 데이터를 포함한다.다르게는, 각 전자 컴포넌트의 각 연관된 다이얼로그 박스는 연관된 전자 컴포넌트의 복수의 다른 모델을 나타 [0029]내는 데이터를 포함한다. 가장 바람직하게는, 전자 컴포넌트는 AV 컴포넌트이다. 바람직하게는, AV 컴포넌트는 AM/FM 수신기, 증폭기, 턴테이블, 등화기, 컴팩트 디스크(CD) 플레이어, DVD 플레이어, 카세트 레코더/플레이어, DAT 플레이어, 텔레비전, HD 텔레비전, 범용 컴퓨터, MD 플레이어, TiVo 레코더/플레이어, 비디오 카세트 레코더/플레이어(VCR/P) 또는 레이저 디스크 플레이어를 포함하는 그룹으로부터의 임의의 하나의 컴포넌트를포함한다. 본 발명의 다른 양태에서, 전자 컴포넌트의 사용자에게 전자 컴포넌트 및 관련된 추천을 제공하기 위한 컴퓨터- [0030]구현 방법이 제공된다. 양호한 방법은 적어도 소정 사용자-선택가능한 전자 컴포넌트 그룹을 나타내는 데이터를 포함하는 그래픽 사용자 인터페이스 디스플레이를 제공하는 단계 - 소정 사용자-선택가능한 전자 컴포넌트그룹으로부터의 각 전자 컴포넌트는 그 자신의 다이얼로그 박스와 연관됨 -, 소정 사용자-선택가능한 전자 컴포넌트 그룹에서, 사용자-선택된 전자 컴포넌트 서브세트를 나타내는 데이터를 수신하는 단계, 메모리 저장 디바이스로부터 사용자 선택된 전자 컴포넌트 서브세트의 각 컴포넌트와 연관된 속성을 검색하는 단계, 사용자-선택된 전자 컴포넌트 서브세트와 연관된 속성을 비교하여 적합한 전자 컴포넌트 접속성 구성을 결정하는 단계, 및전자 컴포넌트 접속성 구성을 나타내는 데이터를 사용자에게 프리젠팅하는 단계를 포함한다.바람직하게는, 이러한 방법은 임의의 소정 전자 컴포넌트와 연관되지 않은 추가적인 사용자 인터렉티브 다이얼 [0031]로그 박스를 제공하는 단계를 포함한다. 더 바람직하게는, 방법은 비연관된 다이얼로그 박스를 통해 사용자로부터 적어도 하나의 사용자-공급된 전자 컴포넌트를 수신하는 단계를 포함한다. 다르게는, 인간 조작자가수신, 검색 및 비교 단계를 수행한다. 이러한 대안에서, 사용자는 인간 조작자와 통신할 수 있다. 바람직하게는, 통신은 전자 통신을 통해서이다. 다르게는, 통신은 음성 통신을 통해서이다. 본 발명의 또 다른 양태에서, 전자 컴포넌트 세트의 전자 컴포넌트 접속성 구성을 결정하기 위한 컴퓨터-구현 [0032]방법이 제공된다. 본 양태의 양호한 실시예는 분석 엔진을 제공하는 단계, 로직 규칙을 포함하는 규칙 데이터베이스를 제공하는 단계, 전자 컴포넌트 세트의 주지된 속성을 분석하는 단계, 및 규칙 데이터베이스로부터 규칙을 적용하여 적합한 전자 컴포넌트 접속성 구성을 결정하는 단계를 포함한다. 바람직하게는, 분석 엔진은 전자 컴포넌트들 사이에 존재하는 양립불가능성을 추가로 결정한다.도면의 간단한 설명도 1a는 본 발명의 양호한 실시예에 따른 표시 디바이스의 개략도이다. [0033]도 1b는 도 1a의 양호한 실시예에 따라 이어지는 단계들의 플로우차트이다.도 2는 본 발명의 다른 실시예에 따른 컴퓨터 시스템의 개략도이다.도 3은 도 2에 도시된 실시예에 따라 이어지는 단계들의 플로우차트이다.도 4는 사용자에 의해 선택가능한 전자 컴포넌트를 표시하기 위한 표시 디바이스의 사용자 인터페이스 표시 스크린의 도시이다.도 5는 추천된 전자 컴포넌트 접속성 구성 및 다른 정보를 표시하기 위한 표시 디바이스의 사용자 인터페이스공개특허 10-2011-0028526-7-표시 스크린의 도시이다.도 6은 본 발명의 다른 양호한 실시예에 따른 컴퓨터 네트워크 시스템의 개략도이다.도 7은 본 발명의 또 다른 실시예에 따른 컴퓨터 네트워크 시스템의 개략도이다.도 8은 가용자 전자 컴포넌트 및 사용자-선택된 전자 컴포넌트 서브세트와 관련된 샘플 웹 사이트 페이지의 도시이다.도 9는 사용자에 의해 선택된 전자 컴포넌트의 프리젠테이션 및 접속성 구성과 관련된 샘플 웹 사이트 페이지의도시이다.도 10은 접속성 구성 및 명령형 텍스트와 관련된 샘플 웹 사이트 페이지의 도시이다.발명을 실시하기 위한 구체적인 내용이제, 본 발명의 양호한 실시예에 따른 사용자 인터페이스 표시 디바이스(20)를 예시하고 있는 도 1a를 참조한 [0034]다. 본 양호한 실시예의 표시 디바이스(20)는 DVD 플레이어이다. 그러나, 본 기술분야의 통상의 기술자라면,표시 디바이스가 사용자와 상호작용할 수 있고 사용자 선택가능한 전자 컴포넌트를 표시할 수 있는 임의의 타입일 수 있다는 것을 잘 알고 있을 것이다. 표시 디바이스(20)는 표시 스크린(22), DVD 드라이브(24), 및 사용자인터페이스 유닛(26)을 포함한다. 인터페이스 유닛(26)은 숫자 키패드, 알파벳 키패드, 또는 문자숫자식 키패드일 수 있다. 그러나, 인터페이스 유닛(26)은 표시 스크린(22)으로부터 컴포넌트를 선택할 수 있는 임의의 타입의 키패드 또는 다른 입력 디바이스일 수 있다. 예를 들면, 인터페이스 유닛은 원격 제어 유닛(26′)으로 도시된 것과 같이, 디스플레이로부터 이격되어 있을 수 있다.도 1b는 본 발명에 따른 양호한 방법을 예시하고 있다. 동작시, 사용자는 우선 DVD를 DVD 드라이브(24)에 [0035]넣고, DVD 플레이어(20)를 활성화시켜 디스크를 플레이시킨다. 디스크는 사용자가 선택할 수 있는 소정 전자컴포넌트를 나타내는 데이터의 정적 메모리를 포함할 것이다. 디스크는 광고, 제조자 주의표시, 특징있는 모델또는 컴포넌트 등과 같은 다른 정보를 포함할 수 있다. 그래서, 일단 DVD가 로딩되어 플레이되도록활성화되면, 사용자는 선택을 시작할 수 있다.단계(150)에 도시된 바와 같이, 사용자는 양호하게는 구성을 위해 가용한 AV 기기 또는 컴포넌트의 표시를 위해 [0036]사용자 인터페이스 표시 스크린(22)을 액세스할 수 있다. AV 컴포넌트는 사용자에 의한 선택을 위해 하나씩 텍스트로 표시될 수 있다. 즉, 사용자-선택가능한 컴포넌트는 사용자가 선택을 우측 또는 좌측으로, 또는 위 및아래로 스크롤하여 선택을 할 수 있도록 직렬로 제공될 수 있다. 이러한 스크롤링은 사용자 인터페이스 유닛(26)을 이용함으로써 수행된다. AV 컴포넌트의 선택은 하나의 벤더로부터이고 다양한 벤더를 포함할 수 있다.AV 컴포넌트의 표시는 텍스트만을, 또는 그래픽만을, 또는 텍스트 및 그래픽 모두를 포함할 수 있다.시스템(20)은 AV 컴포넌트의 사용자-선택된 서브세트(subset)를 수신하고, 이러한 정보를, 단계(160)에 도시된 [0037]바와 같이 사용자의 선택과 매칭하는 디스크(도시되지 않음) 상의 저장된 메모리 또는 페이지에 전송한다. 단계(170)에 예시된 바와 같이, 시스템은 저장된 페이지로부터 AV 컴포넌트(component)의 서브세트와 연관된 기술적 속성을 검색한다. 그리고나서, 시스템(20)은 단계(180)에 도시된 바와 같이, 적합한 AV 컴포넌트 접속성 구성의 사용자 판독가능한 표시를 생성한다. 이러한 표시는 텍스트 구성 명령을 포함하거나, 사용자에 의해 선택된 AV 컴포넌트 및 AV 컴포넌트간의 접속을 도시하는 그래픽을 포함하거나, 이들 모두를 포함할 수 있다. 이들표시들은, 사용자가 그 시스템을 함께 접속할 때 사용자에게 가이드하도록 기록된 인덱스로 또는 컬러 코딩을통해 라벨링된, 전기 배선 또는 신호 케이블의 표현을 포함할 수 있다.도 2는 본 발명의 다른 양호한 실시예에 따른 컴퓨터 시스템(50)의 개략도를 예시하고 있다. 시스템은 처리 유 [0038]닛(100), 데이터 입력 디바이스 또는 키보드(102), 사용자 인터페이스 표시 디바이스 또는 모니터(104), 및 데이터 판독 디바이스 또는 CD/ROM 드라이브(106)를 포함한다. CD/ROM 디바이스는 대신에, 테이프 드라이브, DVD드라이브 또는, 테이프 카세트, 디스켓, CD, DVD 디스크, MD 등과 같은 주지된 저장 매체(108, 점선 안에 도시됨)로부터 메모리 저장을 수신할 수 있는 임의의 다른 드라이브 디바이스일 수 있다. 임의의 주지된, 상용으로 가용한, 컴퓨터 하드웨어 및 시스템 소프트웨어는 처리 유닛(100), 키보드(102), 모니 [0039]터(104), 및 데이터 저장 디바이스 드라이브(106)를 명령하고 제어하는데 활용될 수 있다. 양호하게는, 컴퓨터시스템(50)은 컴퓨터 시스템(50)의 프로세서(100)와, 디스크 드라이브(106)에 로딩된 저장 매체(108)를 액세스할 수 있는 디스크 드라이브(106)간의 인터페이스를 제공하기 위한 인터페이스 유닛(110)을 포함한다.공개특허 10-2011-0028526-8-저장 매체(108)는 양호하게는, 속성 수집 모듈(114) 및 비교기(116)를 포함하는 데이터베이스를 포함한다. 이 [0040]들 저장 매체(108)의 부분들은 인터페이스 모듈(110)을 통해 사용자에 의해 액세스가능하고, 전자 컴포넌트 정보의 입력 및 출력을 허용한다.이러한 양호한 실시예에서, 사용자는 저장 매체(108)를 저장 디바이스 드라이브(106)에 삽입하고, 저장 매체 [0041](108)와 연관된 소프트웨어 프로그램을 동작시킨다. 소프트웨어 프로그램의 동작은 퍼스널 컴퓨터 또는 클라이언트/서버 컴퓨터 시스템과 같은 일반 목적 컴퓨터 시스템 상에서 소프트웨어 프로그램을 동작시키는 주지된 방법에 따라 실행될 수 있다. 본 기술분야의 숙련자라면, 저장 매체(108)에 내장된 소프트웨어 프로그램을 동작시키는 임의의 수단이 본 발명에 의해 생각될 수 있고 본 발명을 구현하는데 활용될 수도 있다는 것을 잘 알고있을 것이다.본 발명의 도 2에 도시된 시스템(50)의 동작은 도 3에 도시된 플로우차트에 의해, 나중에는 특정 예를 통해 일 [0042]반적으로 설명될 것이다. 이제, 도 3을 참조하면, 도 1b에 도시된 제1 단계와 유사하게, 단계(350)는 사용자가AV 컴포넌트의 서브세트를 선택하는 제1 액세스 스크린을 제공한다. 본 발명의 이러한 양호한 실시예에서, 사용자 선택 스크린을 구축하기 위한 AV 컴포넌트 정보는 컴포넌트 객체-지향 데이터베이스(352)로부터 도출된다.각 컴포넌트(353)의 식별도 또한 컴포넌트 객체-지향 데이터베이스(352)내에 포함된다. 이들 컴포넌트 ID(353)는 각 AV 컴포넌트에 접속된 속성을 포함한다. 이들 속성들은 본질적으로 기술적이다. 즉, 이들은 기술적인스펙, 배선도 또는 각 AV 컴포넌트의 다른 속성을 포함한다. 뿐만 아니라, 이들은 각 컴포넌트의 전력 레이팅또는 각 컴포넌트가 수용할 수 있는 전력량, RCA 잭, COAX 또는 광학 포트의 범위에 걸치는 각 컴포넌트 상에서가용한 입력 및 출력 포트의 타입과 같은 컴포넌트의 다른 양태를 포함할 수 있다. 뿐만 아니라, 기술적 속성은 컴포넌트가 S-Link, IEEE 1394-fier 와이어, 제어 A1 또는 임의의 다른 장래 인터페이스 표준을 핸들링할 수있는지 여부를 포함한다.애니메이션을 포함한, 그래픽 표현은 Shock WaveTM 기술과 같은 상용 애니메이션 툴 소프트웨어를 이용하여 생 [0043]성될 수 있다. 각 AV 컴포넌트는 썸네일 이미지 또는 텍스트 또는 양쪽으로 표현될 수 있다. 그러므로, 단계(350)에 따라 사용자에게 양호하게 제공되는 제1 스크린은 도 4에 소정 사용자-선택가능한 전자, 또는 구체적으로 AV 컴포넌트의 그룹으로서 도시되어 있다. 사용자는 사용자가 소유하는 컴포넌트 또는 사용자가 그 시스템에 포함하기를 원하는 것들을 하이라이팅하도록 프롬프트된다. 이러한 프롬프팅은 사용자가 AV 컴포넌트의 서브세트에 부가될 AV 컴포넌트를 계속해서 선택하는 한 계속된다. 사용자가 원하는 모든 선택을 수행한 후, 사용자는 양호하게는 도 4에 도시된 바와 같이 “완료”또는 “구성”버튼을 클릭(click)함으로써 선택 프로세스를 완료한다. 단계(354)에 도시된 바와 같이, 본 양호한 실시예에 따른 시스템은 사용자 선택된 AV 컴포넌트 서브세트를 모으 [0044]고, 수집 모듈(355)을 이용하여 AV 컴포넌트 속성을 수집한다. 그리고나서, 이들 속성들을 사용자에 의해 선택된 컴포넌트와 접속시킨다. 다음 단계(356)에서, 사용자에 의해 선택된 AV 컴포넌트 서브세트의 컴포넌트 속성이 분석 엔진(358)에 의해 분석된다. 이러한 분석 엔진은 양호하게는, 규칙 데이터베이스(360)를 이용하여 기능한다. 규칙 데이터베이스(360)에 내장된 규칙은 조건 세트로서 생성된다. 즉, 분석 엔진(358)에 의해 분석된 AV 컴포넌트의 서브세트에 기초하여, 규칙 데이터베이스(360)로부터의 특정 규칙 세트가 적용되고, 결과적인적합한 AV 컴포넌트 접속성 구성이 결정될 것이다. 뿐만 아니라, 시스템(20)은 나중 이용을 위해 사용자 선택된 AV 컴포넌트 서브세트와 그 연관된 기술적 속성을 저장하고, 이들을 비교기(116)를 이용하여 비교함으로써,적합한 AV 컴포넌트 접속성 구성을 결정한다. 이러한 특징은 사용자가 다음번에 프로그램을 실행할 때, 시스템이 사용자와의 인터렉션을 개인화할 수 있도록 허용할 것이다. 즉, 시스템은 사용자가 이전에 선택한 컴포넌트에 관한 정보를 가지게 되고, 이러한 정보를 그 사용자와의 후속 인터렉션 동안에 검색할 수 있다.그럼으로써, 본 발명은 예를 들면, 사용자 소유의 컴포넌트가 구식이 되었고 새로운 모델이 이제 가용하다는 것을 사용자에게 프롬프트할 수 있다.단계(362)에 도시된 바와 같이, 일단 이러한 정보가 다시 수집되면, 본 양호한 실시예에 따른 본 발명은 추천된 [0045]구성을 사용자에게 제공한다. 뿐만 아니라, 단계(362)에 도시된 바와 같이, 본 양호한 실시예에 따른 시스템은규칙 데이터베이스(360)로부터 도출된 서브세트 규칙에 따라 분석 엔진(358)에 의해 수행된 분석 결과로서 발생하는 사용자 오락 시스템의 양립불가능성 또는 약점을 식별할 수 있다. 상기 AV 컴포넌트 접속성 구성뿐만 아니라, 본 양호한 실시예에 따른 본 발명은 컴포넌트 업그레이드 추천을 할 [0046]수 있다. 또한, 단계(362′)에 도시된 바와 같이, 본 양호한 실시예에 따른 시스템은 개인화된 교차-판매 및업-판매 추천을 사용자에게 제공한다. 교차-판매(cross-selling)는 일반적으로 판매되는 메인 시스템과 함께공개특허 10-2011-0028526-9-이용되는 특정 액세서리에 대한 제안을 제공하는 것으로 정의된다. 본 특정 실시예에서, 교차-판매는 사용자에게 관심있는 특정 CD 또는 DVD의 제안으로 구성된다. 본 공보에 기재된 업-판매(up-sell)는 사용자가 사용하고있는 AV 컴폰넌트, 브랜드 X는 예를 들면 브랜드 Y와 동일한 성능을 가지고 있지 않다는 것을 사용자에게 광고하는 것으로 정의된다. 그러므로, 사용자는 현재의 기기보다 장점을 지정함으로써, 그가 현재 소유하고 있는브랜드 X 대신에 브랜드 Y 컴포넌트를 사야 할 것이다.교차-판매 및 업-셀을 수행하고 다른 개인화된 추천을 사용자에게 제공하는 능력은 도 3에 도시된 바와 같이, [0047]개인화 툴(364)에 의해 달성된다. 임의의 공지된 상용 개인화 제품은 본 발명의 양호한 실시예와 관련하여 개인화 툴(364)을 구현하는데 이용될 수 있다. 하나의 그러한 개인화 툴은 Net Perceptionsⓡ으로서, 본 발명을구현하는데 활용될 수 있다. 다른 하나는 DataStageⓡ로서, 확립된 변형가능한 규칙 및 제품 카탈로그를 이용하여 사용자에게 관심이 될 수 있는 다른 제품의 추천을 수행한다. 뿐만 아니라, 본 발명과 관련하여 생성되고이용될 수 있는 다른 맞춤형 개인화 툴이 있다.도 4는 전형적인 윈도우즈ⓡ-타입 사용자 인터페이스 프로그램 스크린 상에 나타날 수 있는 샘플 사용자 인터페 [0048]이스 표시 스크린(230)을 예시하고 있다. 도시된 바와 같이, 각각이 전형적인 오락 시스템의 분리된 AV 컴포넌트 전용인 다이얼로그 박스가 사용자에게 제공된다. 구체적으로는, 컴포넌트 A에 대한 제1 다이얼로그 박스(232)는 모든 가용한 수신기를 나타낸다. 이러한 다이얼로그 박스(232)는, 모든 타입 A 컴포넌트의 다양한 수신기 모델 번호(235) 및 이미지(237, 가용한 경우)를 포함하는, 스크롤가능한 서브스크린(233)을 포함한다. 사용자는 관심있는 특정 모델 번호에 “클릭”하도록 프롬프트된다. 그렇게 했을 때, 그 특정 컴포넌트가 하일라이트되고 사용자는 선택된 컴포넌트에 관한 추가 정보(234)를 더 액세스할 수 있다. 다르게는, 각 모델 번호(235) 및 이미지(237) 다음에, 사용자가 최종적으로 특정 모델을 선택하기에 앞서서, 사용자에 의해 선택된 컴포넌트에 관한 추가 정보를 수집하기 위한 사용자 선택가능한 아이콘(도시되지 않음)이 있을 수 있다.도 4에서 용이하게 알 수 있는 바와 같이, 사용자는 다음 다이얼로그 박스로 계속하도록 프롬프트되어, 관심이 [0049]있는 컴포넌트 또는 사용자가 현재 소유하고 있는 컴포넌트를 선택한다. 일단 사용자가 선택 프로세스를 완료하면, 사용자는 “구성”아이콘(236)을 클릭한다. 이러한 액션은 소정 사용자-선택가능한 AV 컴포넌트의 그룹으로부터 사용자 선택된 AV 컴포넌트 서브세트를 AV 컴포넌트 속성 수집 모듈(355, 도 3)에 전소안다. 사용자가 선택 프로세스 동안에 실수를 하거나 결정을 변경하면, 그는 다이얼로그 박스에서 특정 컴포넌트의 특정 선택을 리셋하거나, 리셋 버튼(238)으로 모든 컴포넌트의 전체 선택을 리셋할 수 있다.도 5는 대부분의 계산 및 분석이 시스템(50)에 의해 수행된 후 시스템(50)에 의해 생성된 AV 컴포넌트 접속성 [0050]구성의 사용자로의 프리젠테이션을 예시하고 있다. 이러한 측면에서, 본 양호한 실시예의 사용자에게는 도 4에도시된 바와 같이 동일한 표시 스크린(230)이 프리젠팅(presenting)되지만, 이들 주어진 AV 컴포넌트에 대한 접속의 가장 적합한 선택을 보여주는 접속도와 함께, 사용자에 의해 선택된 컴포넌트를 예시하고 있다. 또한, 시스템에 의해 제공되는 것은, 사용자의 오락 시스템의 이들 배선 또는 케이블링을 구성하는 방법에 관한 단계 명령(240)에 의한 텍스트 단계이다. 와이어 또는 케이블은 참조의 용이성을 위해 W1, W2 및 W3 등으로 라벨링된다. 라벨링은 다른 심볼 또는 인덱스로 구성되어, 사용자가 컴포넌트를 함께 접속하는데 도움을 준다.사용자에 의해 선택된 특정 AV 컴포넌트를 구성하는 방법에 관한 텍스트 명령(240)뿐만 아니라, 시스템이 사용 [0051]자에 의해 선택된 AV 컴포넌트의 측면에서 수행된 분석 결과인 추가 텍스트 인덱스(242)가 제공된다. 즉, 시스템이 사용자-선택된 서브세트를 검토할 때, 시스템은 그 서브세트에 현재 존재하고 있는 AV 컴포넌트가 그 사용자를 위한 최적 컴포넌트 조합인지 여부를 분석한다. 뿐만 아니라, 시스템은 선택된 AV 컴포넌트가 특정 벤더로부터 가용한 가장 진보되고, 최상의 가장 적합한 컴포넌트인지를 알기 위해 체크한다. 그와 같이, 이러한 본발명의 양태는 사용자가 이들 컴포넌트를 선택하지 않았고 따라서 이들을 그때에 소유하고 있지 않을 가능성이높다는 것을 알고서, 진보된 AV 컴포넌트를 사용자에게 판매하고 마케팅하는 즉각적인 수단을 제공할 수 있다.이러한 추가 정보를 사용자에게 제공하기 위한 수집 프로세스의 일부로서, 본 발명의 실시예에 따른 시스템은, [0052]AV 컴포넌트 정보를 수신할 뿐만 아니라, 사용자로부터 개인 정보를 추가로 수신하고 사용자 선택된 AV 컴포넌트 서브세트와 함께 그 개인 정보를 분석한다. 일단 시스템이 그렇게 했다면, 추가 추천을 사용자에게 프리젠팅한다. 이들 추천들은 사용자에게 가용하고 전체적으로 오락 시스템을 추가로 향상시키는 진보되거나 더 하이레벨의 컴포넌트 및/또는 액세서리로 구성된다.상기 언급된 정보뿐만 아니라, 본 발명의 양호한 실시예에 따른 시스템은 사용자의 관심사가 되는 CD, 비디오 [0053]공개특허 10-2011-0028526-10-및 MD 등과 같은 액세서리에 관한 정보를 사용자에게 제공할 수 있다. 그러한 정보는 사용자에 의해 시스템에제공되는 사용자 인구통계학적(demographic) 데이터, 사용자에 의해 제공되거나 벤더에 의해 얻어지는 역사적인구매 데이터, AV 구성 세션 동안에 사용자의 액션 키 스트로크를 검토함으로써 얻어지는 클릭 스트림 데이터,또는 벤더가 그러한 개인 정보를 수신하는 임의의 다른 수단을 통해 수집된다.본 발명의 다른 양호한 실시예에 따르면, 도 6은 일반적으로 200으로 지정된, AV 접속성 구성 및 다른 관련된 [0054]정보를 추천하기 위한 컴퓨터 네트워크 시스템의 개략도를 예시하고 있다. 본 실시예는 도 2-5와 관련하여 상기 설명된 것과 유사하지만, 본 실시예는 컴퓨터 네트워크를 특징으로 한다. 컴퓨터 네트워크 시스템(200)은각각이 도 2와 관련하여 설명된 것과 유사한 처리 유닛(204)을 포함하는 사용자 또는 고객 컴퓨터(202) 그룹을포함한다. 고객 컴퓨터(202)는 또한 도 2와 관련하여 기재된 바와 같이, 키보드(206) 및 모니터(208)를 포함한다. 이들 고객 컴퓨터(202) 각각에 내장된 것은 AV 컴포넌트 정보를 적어도 일시적으로 저장하기 위한 데이터베이스(도시되지 않음)이다. 이러한 네트워크 시스템은 또한 인터페이스 허브(또는 네트워크 서버, 210)를 포함한다. 네트워크 서버(210)와 인터페이싱되는 것은 데이터베이스(214)를 포함하는 벤더 컴퓨터(212)이다. 도6에 도시된 데이터베이스는 도 2에 도시된 저장 매체(108)와 동일하거나 유사하게 저장된 정보를 포함하고, 속성 수집 모듈 및 비교기를 포함하고 이들로 제한되지 않는다. 도 2 및 3과 관련하여 기재된 이용 또는 동작은도 6에 도시된 양호한 실시예에도 동일하게 적용가능하고, 네트워크(210) 접속도 부가된다.특히, 본 실시예는 AV 구성에 관한 정보를 위해 복수의 사용자 또는 고객들이 서버 컴퓨터(212)를 액세스하는 [0055]것을 허용한다. 예를 들면, 수 명의 사용자들은 시스템(200)으로부터 AV 컴포넌트 접속성 구성을 얻기를 원한다. 예를 들면, 하나 이상의 고객 컴퓨터(202)가 도 3과 관련하여 상기 설명된 바와 같이 요구를 한다. 정보는 네트워크(210)를 통해 네트워크 서버 컴퓨터(212)의 하나로 전달된다. 그리고나서, 서버 컴퓨터(212)는 소정, 사용자 선택된 AV 컴포넌트의 그룹으로부터 사용자 선택된 AV 컴포넌트 서브세트를 취하여, 이를 어느 AV컴포넌트 접속성 구성이 요구를 하는 특정 사용자에 대해 가장 적합한지를 결정하는 그 서브모듈을 포함하여,데이터베이스 또는 저장 매체(214)에 전달한다.도 6에 도시된 네트워크는 양호하게는 로컬 영역 네트워크, 와이드 영역 네트워크, 또는 클라이언트/서버 네트 [0056]워크일 수 있다. 본 기술분야의 통상의 기술자라면, 임의의 주지된 상용 네트워킹 시스템 및 네트워킹 소프트웨어가 본 발명에 의해 고려될 수 있고 본 발명의 범주내에 든다는 것을 잘 알고 있을 것이다.도 7은 본 발명의 또 다른 양호한 실시예를 예시하고 있다. 이러한 시스템(300)은 인터넷과 같이, 글로벌 통신 [0057]컴퓨터 네트워크를 활용하는 네트워크 시스템(301)을 포함한다. 고객 또는 사용자 컴퓨터(302)는 도 2 및 6과관련하여 설명된 것과 유사하고, 유사한 참조부호는 유사한 구성요소를 나타낸다. 그러므로, 도 7에 예시된 바와 같이, AV 컴포넌트를 추천하기 위한 컴퓨터 시스템(300)이 제공된다. 인터넷(301)을 통해 액세스가능한 벤더 웹 사이트(vendor web site)를 통해 사용자 컴퓨터(302)에게 추천을 하는데 이용되는 벤더 컴퓨터(312)도 포함된다.본 양호한 실시예에서, 컴퓨터 시스템(300)은 벤더 컴퓨터(312) 상에서 실행가능한 그래픽 AV 컴포넌트 생성 프 [0058]로그램을 포함하고, 벤더 컴퓨터가, 벤더의 AV 컴포넌트를 나타내는 인터렉티브한 벤더 그래픽 AV 컴포넌트 표시를 생성하도록 하기 위한 명령을 포함하며, 사용자를 벤더 컴퓨터 웹 사이트를 통해 인터렉티브하게 가이드한다.그래픽 AV 컴포넌트 생성 프로그램은 사용자 컴퓨터가 벤더 웹 사이트에 액세스했을 때 표시 명령을 사용자 컴 [0059]퓨터(302)에 전송하도록 동작한다. 이것은 사용자 컴퓨터가 선택을 위해 그 모니터(308) 상에 인터렉티브 벤더AV 컴포넌트를 표시하도록 유발한다. 그러한 디스플레이의 하나의 예는 인터넷과 같은 글로벌 컴퓨터 정보 네트워크를 통해 액세스되는 것이 될 것이다. 이러한 예는 도 4에 기재되거나 도시된 것과 유사하다. 그러나,이러한 특정 실시예가 인터넷 접속을 통해 달성되므로, 페이지의 최상부에 표시되는 URL 어드레스가 있다(도시되지 않음).유사하게, 사용자-선택된 서브세트에 기초한 사용자로의 추천의 스크린 표시가 이용될 수 있다. 다시, 이러한 [0060]표시는 페이지의 상부에 URL 어드레스를 포함한다(도시되지 않음)는 점을 제외하고는, 도 5에 도시된 것과 유사하다.상기 언급된 바와 같이, 분석 엔진은 규칙 데이터베이스를 활용하여 기능한다. 규칙은 양호하게는 조건 세트로 [0061]서 생성된다. 분석 엔진이 규칙을 이용하는 방법의 하나의 예로서, 이하의 예시가 제공된다.객체-지향 데이터베이스의 각 컴포넌트 오브젝트는 I/O 포트의 타입, 양, 지원되는 디지털 사운드 성능의 타입, [0062]공개특허 10-2011-0028526-11-존재하는 경우 각 컴포넌트가 가지는 디바이스 버스의 타입, 및 다른 속성을 포함하고 이들로 제한되지 않는 정보를 포함할 것이다. 분석 엔진은 이들 속성을 조사하고 규칙 데이터베이스의 규칙을 이용하여, 컴포넌트들간에 존재하는 임의의 양립불가능성을 지적할 뿐만 아니라(예를 들면, DVD 플레이어와 수신기가 선택되지만, 어느것도 Dolby 5.1 AC3 컨버전을 수행할 수 없다), 컴포넌트를 접속하는 최상의 I/O 구성(예를 들면, 광학, RCA 또는 COAX)을 결정한다.예를 들면, 일부 규칙들은 이하와 같이 동작한다. [0063]DVD I/O가 광학 출력을 가지고 있고 수신기가 Dolby 5.1 AC3 컨버터를 구비하는 경우, DVD 광학 출력을 수신기 [0064]광학 입력에 접속하라.그렇지 않고, DVD I/O는 RCA 출력을 가지고 있고 수신기 I/O는 RCA 입력을 가지고 있으며, 수신기 또는 DVD가 [0065]Dolby 5.1 AC3 컨버터를 가지고 있는 경우, DVD RCA 출력을 수신기 RCA 입력에 접속하라.DVD I/O가 광학 출력 및 RCA 출력 및 수신기 I/O 광학 입력 및 RCA 입력을 가지고 있고 DVD 및 수신기가 Dolby [0066]5.1 AC3 컨버터를 가지고 있지 않은 경우, Dolby 5.1 AC3 사운드는 Dolby 5.1 AC3 디코더 어댑터없이는 이 선택으로부터 렌더링될 수 없다는 것을 사용자에게 경고하라.다른 DVD 플레이어나 다른 수신기 중 어느 하나를 추천하라. [0067]규칙에서의 우선권 순서는 양호하게는 설정된다. 더 나은 성능 접속이 우선 체크될 것이다. 이 경우에, 추가 [0068]적인 규칙이 정확한 업그레이드 DVD 및 수신기를 고객에게 표시하는데 이용될 것이다.본 발명의 양호한 실시예에서, 시스템은 분석 엔진 및 그래픽 기술과 함께 객체 지향 데이터베이스를 이용하여 [0069]그 태스크를 달성한다. AV 컴포넌트에 대한 정확한 접속성 구성을 알기를 원하는 사용자는 구입했거나 구입할계획이 있는 컴포넌트를 선택할 것이다. 아이템 리스트는 오브젝트 데이터베이스에 저장된 정보로부터 생성될것이다. 컴포넌트가 선택된 후, 고객은 최적 구성의 그래픽 표현 및 텍스트 기술을 요구한다.이러한 요구가 수행된 경우, 분석 엔진은 오브젝트 데이터베이스에 저장된, 그 컴포넌트의 대응하는 속성을 얻 [0070]음으로써, 사용자에 의해 선택된 컴포넌트를 조사할 것이다. 분석 엔진은 분석 엔진의 구성 기능을 위해, 입력으로서 오브젝트의 속성을 이용한다.구성 기능은 선택된 AV 컴포넌트에 기초하여 가능한 셋업 구성을 조사할 것이다. 규칙-기반 AI는 구성 기능을 [0071]가이드하여 선택된 AV 컴포넌트에 대한 최상의 가능한 구성을 출력하는데 이용될 것이다.출력은 그래픽 성능을 가지지 않는 툴을 이용하는 디바이스에 대해서는 텍스트 기술만일 수 있다. 다르게는, [0072]출력은 그래픽을 지원하는 디바이스에 대해서는 그래픽 및 텍스트일 수 있다.이제, 도 8을 참조하면, 본 발명의 양호한 실시예가 특정 예를 통해 설명된다. 그 현재 시스템내에 AV 컴포넌 [0073]트가 주어진 상태에서, AV 컴포넌트의 사용자는 수락가능하거나 적합한 AV 컴포넌트 접속성 구성을 달성하기 위해, 다양한 AV 컴포넌트를 함께 접속하는데 일부 도움을 얻기를 원할 수 있다. 이러한 측면에서, 사용자는 벤더의 구성 툴 웹 사이트(400)에 액세스한다. 이 경우에, Sonyⓡ AV 구성 툴 웹 [0074]사이트이다. 그러나, 임의의 벤터의 웹 사이트 또는 다수의 다른 벤더를 나타내는 일반적인 웹 사이트일 수 있다. 일단 액세스된 경우, 사용자에게는 수 개의 다이얼로그 윈도우를 포함하는 그래픽 사용자 인터페이스 표시(401)가 프리젠팅된다. 각 다이얼로그 윈도우는 사용자가 선택할 수 있는 특정 컴포넌트 전용이다. 도 8에 도시된 바와 같이, 제1 다이얼로그 박스(402)는 수신기 컴포넌트 전용이다. 수신기의 다양한 모델 번호들은 사용자에 의한 선택을 위해 리스트된다. 스크린을 가로 질러 이동하면, 제2 다이얼로그 박스(404)는 사용자가 선택할 수 있는 DVD 플레이어 전용이다. 마지막으로, 이러한 특정 예에서, 스크린(406)의 우측의 최종 다이얼로그박스는 MD 플레이어/레코더 전용이다. 상요자는 텍스트 명령에 의해 프롬프트되어 리스트로부터 컴포넌트를 선택한 후 “구성”(410)을 누른다.이러한 특정 예에서, 상요자는 수신기 모델 번호 STR-DE625, DVD 플레이어 모델 번호 DVP-S550D를 선택했고, MD [0075]에 대해서는 “none(미해당)”을 선택했다. 다시, 선택이 수행된 후, 사용자는 “구성”버튼(410)을 클릭하도록 프롬프트되어 이러한 사용자 선택된 AV 컴포넌트 서브세트를 벤더, 이 경우에는 소니ⓡ에 전송한다. 예를들어, 사용자가 실수하여 잘못된 컴포넌트를 선택하거나, 어떤 이유로 인해 다른 세션을 시작하기를 원하는 경우, 사용자는 “리셋”버튼(412)을 클릭하여 선택을 리셋하고 다시 시작한다. 벤더(또는 벤더 컴퓨터)가 사용자 선택된 AV 컴포넌트 서브세트를 수신한 후, 상기 설명된 것과 같은 방법을 수행하여, 사용자로부터 입력이공개특허 10-2011-0028526-12-주어진 상태에서, 적합한 AV 컴포넌트 접속성 구성을 결정한다.도 9에 도시된 바와 같이, 밴더(또는 벤더 컴퓨터)는 그래픽 표현과 병치된 연관 배선 및/또는 케이블링 도와 [0076]함께, 사용자에 의해 선택된 컴포넌트의 그래픽 표시를 전송한다. 와이어 및 케이블은 W1, W2, W3, W4, W5, 등과 같은 인덱스로 라벨링된다. 이와 같이, 벤더는 사용자에게 수신기, 특히 수신기(416) 및 DVD(418)의 텍스트기술을 프리젠팅한다. 뿐만 아니라, 벤더는 DVD 그림(420) 및 수신기 그림(422)과 같은 컴포넌트의 그림을 제공한다. 컴포넌트의 후면 패널은 2개의 AV 컴포넌트의 배선 구성을 도시할 목적으로 표시된다. 이들은 각각도 9에서 DVD(424) 및 수신기(426)로서 도시되어 있다.배선 및/또는 케이블링 도는 추가 세부사항을 위해 확대될 수 있다. 도 10에 가장 잘 도시된 바와 같이, 모든 [0077]접속성 접속은 사용자가 그 배선 셋업에 이용할 있도록 상세하게 도시되어 있다. 뿐만 아니라, 벤더는 컴포넌트가 가지고 있거나 가지고 있지 않은 성능이 무엇인지뿐만 아니라, 이들 컴포넌트의 장점 및 단점들에 관해서도 텍스트 명령(428)을 제공한다.본 발명의 범주내에서 고안될 수 있는 다수의 대안, 변동 및 변형이 있다. 예를 들면, 본 기술분야의 숙련자라 [0078]면, 본 발명이 휴대용 저장 매체, 랜, 등 또는 인터넷을 통해 구현될 수 있는 것으로 상기 기재되어 있지만, AV컴포넌트 접속성 구성을 사용자에게 제공하는 다른 방법이 있다는 것을 잘 알고 있을 것이다. 예를 들면, 라이브 AV 구성 툴에 액세스할 수 있는 키오스크는 제품이 판매되는 소비 매장에서 셋업될 수 있다.뿐만 아니라, CD 및 DVD는 엔진 및 데이터베이스를 포함하도록 생성될 수 있거나, 이들은 고정된 정적 솔루션 [0079]세트 및 고정된 AV 기기 세트를 포함할 수 있다. 이들 CD 또는 DVD는 AV 기기의 구매자에게 배포될 수 있다.기능은 라이브 데이터베이스 및 분석 엔진을 이용하고 있는 것과 동일하게 나타난다. DVD 플레이어는 통상 컴포넌트의 원격으로 제어되는 빌트인 포인팅 디바이스를 이용하여 툴을 동작시킬 수 있다.본 발명의 개인화 양태의 일부는 고객으로부터 직접 입력을 얻고, 고객이 찾는 것, 고객이 클릭하는 것, 및 고 [0080]객이 구매하는 것을 관찰함으로써, 인터넷 고객의 선호도를 캡쳐링하는 방법이다. 선호도가 캡쳐된 후, 추천엔진이 이용되고, 협업 필터링 및 다른 방법이 이용되어 환경을 생성하거나 이러한 특정 사용자에게 맞는 제품또는 서비스를 추천할 것이다. AV 구성 툴은 고객이 선택한 것이 어떤 컴포넌트인지를 조사하고, 이러한 사용자에 관해 수집된 다른 정보와 함께, 제품에 대한 추천을 한다. 추천은 다른 컴포넌트, 더 나은 컴포넌트, 또는 관련된 제품 또는 서비스에 대한 것일 수 있다.상기 설명된 방법의 또 다른 대안 또는 추가로서, 사용자가 사용자 선택가능한 전자 컴포넌트의 하나로서 제공 [0081]되지 않는 전자 컴포넌트 또는 특정 모델을 선택하려고 시도하는 경우, 시스템은 사람 어시스턴트를 사용자에게제공한다. 이러한 어시스턴트는 사용자와 이메일, 전화, 보이스-넷, 인터렉티브 웹 페이지 등을 통해 통신할 것이다. 사용자는 실시간으로 또는 다르게, 사용자의 질문이나 관심사에 대해 응답하는 도움 데스크에 이메일을메시징하는 능력을 가질 수도 있다. 이들 응답은 접속성 도, 컴포넌트의 선택, 컴포넌트 또는 액세서리의 제안된 구매, 등을 포함한다. 어시스턴트는 관심사가 되는 특정 컴포넌트의 가장 가까운 허가된 딜러에게 사용자를연결시켜 준다. 이러한 어시스턴트는 사용자와 임의의 방식으로 통신중에 있는 컴퓨터 시스템 또는 실제 사람일 수 있다.본 발명의 범주내에서 고려될 수 있는 다른 대안으로서, 전자 컴포넌트에 대한 일반적인 디폴트 셋업을 제공하 [0082]는 시스템 및 방법이 제공된다. 그러나, 시스템이 사용자로부터 정보를 수신하는 경우, 이러한 정보에 기초하여, 시스템은 다른 구성을 제공한다. 단지 예로서, 사용자로부터 프롬프팅하지 않고, 시스템은 각 컴포넌트에대해 가용한 최신 모델을 제공하고, 이들 컴포넌트가 제공된 상태에서, 가용한 최상의 구성을 제공할 것이다.사용자가 더 새로운 특정 기기를 핸들링할 수 없는 수신기를 가지고 있다는 것을 시스템에게 통지하는 정보를사용자가 제출한 경우, 시스템은 사용자의 시스템이 동작하도록 허용하는 구성을 제공할 것이다. 뿐만 아니라,그러나, 사용자가 더 새로운 수신기를 구매하지 않기로 결정하는 경우, 시스템은 사운드 품질, 전력, 효과 등의손실에 관해 사용자에게 프롬프트할 것이다.상기 설명된 특징들의 이들 및 다른 변동 및 조합들이 이하에 제시되는 청구의 범위에 의해 정의된 바와 같이 [0083]본 발명으로부터 벗어나지 않고서도 활용될 수 있으므로, 양호한 실시예의 상기 설명은 본 발명의 제한으로보다는 예시로서 받아들여야 할 것이다.공개특허 10-2011-0028526-13-도면도면1a도면1b공개특허 10-2011-0028526-14-도면2공개특허 10-2011-0028526-15-도면3공개특허 10-2011-0028526-16-도면4공개특허 10-2011-0028526-17-도면5공개특허 10-2011-0028526-18-도면6공개특허 10-2011-0028526-19-도면7공개특허 10-2011-0028526-20-도면8공개특허 10-2011-0028526-21-도면9공개특허 10-2011-0028526-22-도면10공개특허 10-2011-0028526-23-"}
{"patent_id": "10-2011-7002245", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "사용자로부터 수신된 정보에 기초하여 전자 컴포넌트 접속성 구성 및 마케팅 정보를 특정 전자 기기의 사용자에 게 추천하기 위한 컴퓨터-구현 방법 및 시스템. 방법은 소정 사용자-선택가능한 전자 컴포넌트의 그룹을 나타내는 데이터를 포함하는 사용자 인터페이스 디스플레이를 제공하는 단계, 소정 사용자-선택가능한 전자 컴포넌트 그룹으로부터 사용자-선택된 전자 컴포넌트 서브세트를 나타내는 데이터를 수신하는 단계, 데이터베이스로부터 전자 컴포넌트 서브세트의 각 컴포넌트와 연관된 속성을 검색하는 단계, 전자 컴포넌트 서브 세트와 연관된 속성을 비교하여, 적합한 컴포넌트 구성을 결정하는 단계, 및 전자 컴포넌트 구성을 나 타내는 데이터를 사용자에게 프리젠팅하는 단계를 포함한다."}
{"patent_id": "10-2011-7002245", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인핸스먼트(enhancement) 및 액세서리와 같은 다른 정보뿐만 아니라, 전자 컴포넌트 접속성 구성을 전자 컴포넌트의 사용자에게 추천하기 위한 방법 및 시스템에 관한 것으로, 특히 본 발명은 오디오비주얼(Audio Visual: AV) 컴포넌트 및 그 액세서리에 관련된 정보를 사용자에게 제공하기 위한 방법 및 시스템에 관한 것이다."}
{"patent_id": "10-2011-7002245", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "현재, 가정 및 전문가 사용을 위한 전자 컴포넌트의 인기가 상승하고 있다. 특히, 이들 전자 컴포넌트를 포함 하는 홈/오피스 오락 기기는 더 널리 퍼지고 있고, 동시에 더욱 더 복잡하게 되고 있다. 이렇게 복잡성이 증가 된 하나의 원인은 부분적으로는, 보통의 소비자(또는 사용자)에게 현재 가용한 전자 컴포넌트들의 증가하는 개 수 및 다양성 때문이다. 특히, 몇 가지를 들면, 중앙 채널 스피커, 서브우퍼, 서라운드 사운드 시스템, 컴팩트 디스크(CD) 플레이어, 미니 디스크(MD) 플레이어, DVD 플레이어, DAT 레코더/플레이어, 테이프 카세트 레코더/ 플레이어, VCR, 종래 대형 스크린 및 고해상도(HD) 텔레비전, 케이블 및 위성 디시 신호 소스, 셋탑 인터넷 시 스템, 컴퓨터 제어 시스템, TiVo (VCR이 필요없는 MPEG-기반의 텔레비전 프로그램 저장장치), 등을 포함하여, 범용 컴퓨터 및 컴퓨터 시스템, AM/FM 스테레오 튜너/수신기, 축음기 플레이어, 증폭기, 프리-증폭기, 확성기가 있다. 뿐만 아니라, 사용자는 선택할 복수의 브랜드 이름, 각 회사에 의해 제공되는 수많은 모델, 조합할 컴포넌트 타 입간의 폭넓은 변동, 현재 및 새로운 기기간의 양립성 또는 양립불가능성, 아날로그 및 디지털과 같은 현재 및 미래 인터페이스 기술간의 양립성 또는 양립불가능성, COAX, RCA 잭, 광학 포트 등에 직면할 수 있다. 이러한 모든 기기는 이하에서, 집합적으로 전자 컴포넌트 또는 전자 기기로서 지칭되고, 서브 세트는 AV 컴포넌트 또는 기기 및 관련된 액세서리이다. 다수의 전자 기기 사용자들은 상기 언급된 기기의 각각 및 모든 것을 함께 접속하는데 어려움을 가질 것이라고 생각하는 것은 어렵지 않다. 기기 또는 컴포넌트 중, 전체는 아니라도, 대부분이, 기기가 그 의도된 목적에 따 라 수행되도록, 적어도 적절한 구성으로 함께 접속되는 것이 바람직하다. 각 컴포넌트에 의해 가용하게 되는 특징들 중, 모두는 아니라도, 대부분을, 컴포넌트간의 양립불가능성에 충돌함이 없이, 활용하는 것이 바람직하 다. 예를 들어, AV 컴포넌트에 대해, DVD 플레이어는 광학 입력 및 출력 포트를 가지고 있지만, 수신기는 단지 RCA 잭만을 가지고 있다. 그러므로, DVD 플레이어의 광학 입력 및 출력을 이용하는 것이 가장 바람직한 것으로 보이지만, 대신에, 사용자는 수신기를 수용하기 위해 RCA 잭을 이용해야만 한다. 현재, 원하는 컴포넌트를 함께 구성하는 것을 돕는 경우에, 사용자들은 각 컴포넌트에 대한 제품 매뉴얼을 검토 하고, 각 컴포넌트의 각 벤더의 판매대리인을 접촉하거나, 동일하거나 유사한 컴포넌트의 다른 사용자로부터 도 움을 얻는 것을 포기한다. 제품 매뉴얼은 사용자의 전체 시스템 컴포넌트의, 종종 배선 구성과 같은 특정 접속 성 구성도를, 있다 하더라도, 거의 제공하지 않는다. 하나의 벤더는, 적절한 접속을 용이하게 하는데 필요한 다른 벤더의 컴포넌트에 관한 정보를 가지고 있지 않는다. 이것은 사용자가 새롭거나 현재 기술수준의 컴포넌 트 및/또는 다른 벤더의 컴포넌트와 조합된 과거 및 구식 컴포넌트를 가지고 있는 경우에 특히 그렇다. 마지막 으로, 사용자는 컴포넌트 구성을 결정하는데 과도한 양의 시간을 소비해야 하고, 더욱 더 나쁜 것은, 시스템을 함께 접속하는 것과 관련하여, 사용자보다 동일하거나 적은 지식을 가진 다른 사용자를 의지해야 한다는 것이다. 결과적으로, 사용자는 배선 및 입출력 접속성 구성, 또는 동작하는 전자 컴포넌트 시스템을 달성하기 위해 이해 될 필요가 있는 옵션 및 도면에 대해 혼란한 상태로 남아있다. 앞서 언급한 어려움뿐만 아니라, 그러한 전자 기기의 사용자들은 그러한 기기에 관한 다른 정보를 원할 수 있다. 예를 들면, 사용자는 특정 기기를 현재 소유하거나 구입할 의사가 있고, 구입하고자 하는 기기가 최고급 품인지 또는 단지 중간 정도인지 여부를 알기를 원할 수 있다. 사용자는 또한 어느 컴포넌트가 양립가능한지 또는, 더 양호하게는, 어느 컴포넌트가 다른 컴포넌트와 가장 잘 동작하는지를 결정하기를 원할 수 있다. 마지 막으로, 사용자는 “원-스톱-쇼핑” 경험을 원하고, 특정 사용자 파라미터가 주어진 상태에서 컴포넌트의 최상 의 조합을 결정되도록 사용자의 전자 컴포넌트 시스템 요구사항이 분석될 수 있게 할 수 있기를 바랄 수 있다. 뿐만 아니라, 사용자는 특정 컴포넌트에 대해 가용한 전체 액세서리 범위에 관해 알기를 원할 수 있다. 따라서, 사용자의 현재 및 장래 컴포넌트에 관한 정보를 수신하는 방법을 제공하고 그 사용자에게 적절한 컴포 넌트 접속성 구성을 제공하는 방법 및 시스템이 필요하다. 뿐만 아니라, 사용자로부터 개인 정보의 수신 시, 사용자가 주변장치, 비디오 카세트, 테이프 카세트, CD, DVD, MD 등과 같은 관련된 상품뿐만 아니라, 인핸스먼 트, 업그레이드, 추가 또는 관련된 기기를 구매하도록 설득하는 추가 제안 및 추천을 제공하는 것이 필요하다."}
{"patent_id": "10-2011-7002245", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 하나의 양태에 따르면, 사용자에게 추천된 전자 컴포넌트 접속성구성을 프리젠팅하기 위한 컴퓨터-구 현 방법이 제공된다. 본 발명의 하나의 양태의 양호한 실시예는 적어도 소정 사용자-선택가능한 전자 컴포넌트 의 그룹을 나타내는 데이터를 표시하기 위한 사용자 인터페이스 디스플레이를 제공하는 단계, 소정 사용자-선택 가능한 전자 컴포넌트 그룹으로부터 사용자-선택된 전자 컴포넌트 서브세트를 나타내는 데이터를 수신하는 단계, 메모리 저장 디바이스로부터 사용자 선택된 전자 컴포넌트 서브세트의 각 컴포넌트와 연관된 속성을 검색 하는 단계, 사용자-선택된 전자 컴포넌트 서브세트를 나타내는 데이터와, 연관된 속성을 비교하여, 적합한 전자 컴포넌트 접속성 구성을 결정하는 단계, 및 전자 컴포넌트 접속성 구성을 나타내는 데이터를 사용자에게 프리젠 팅하는 단계를 포함한다. 양호하게는, 전자 컴포넌트는 AV 컴포넌트를 포함한다. 바람직하게는, 본 양호한 실시예에 따른 방법은 그래픽 데이터를 표시하기 위한 그래픽 사용자 인터페이스 디스 플레이를 제공하는 단계를 포함한다. 더 바람직하게는, 방법은 사용자-선택된 전자 컴포넌트 서브세트의 전자컴포넌트 접속성 구성의 그래픽 표현을 프리젠팅하는 단계를 포함한다. 가장 바람직하게는, 전자 컴포넌트 접 속성 구성의 그래픽 표현을 프리젠팅하는 단계는, 사용자-선택된 전자 컴포넌트 서브세트의 각 전자 컴포넌트 상에서 적절한 커넥터간의 접속을 보여주는 전기 와이어 또는 신호 케이블(특정 와이어는 라벨링됨)의 표현을 표시하는 단계를 포함한다. 바람직하게는, 본 양호한 실시예는 사용자로부터 개인 정보를 수신하는 단계, 사용자-선택된 전자 컴포넌트 서 브세트와 조합하여 개인 정보를 분석하는 단계, 및 추가 또는 다른 컴포넌트 또는 액세서리와 같은 추가 정보의 추천을 사용자에게 프리젠팅하는 단계를 더 포함한다. 바람직하게는, 이러한 원하는 방법은 사용자-선택된 전 자 컴포넌트 서브세트에서 사용자에 의해 선택된 것들과는 달리, 특정 전자 컴포넌트에 관해 사용자에게 정보를 포워딩하는 단계를 포함한다. 가장 바람직하게는, 개인 정보는 사용자 인구통계학적 데이터, 구매 이력 데이터, 클릭 스트림 데이터 또는 사용자-제공된 데이터로 구성된 그룹으로부터 선택된다. 가장 바람직한 실시예에서, 상기 양호한 방법은 사용자-선택된 전자 컴포넌트 서브세트로부터 전자 컴포넌트 중 적어도 하나에 대한 기술적 스펙 및 접속성 정보를 검색하는 단계를 포함한다. 가장 바람직하게는, 전자 컴포 넌트의 대표 데이터는 객체-지향 데이터베이스에 전자 컴포넌트 타입별로 저장된다. 가장 바람직하게는, 전자 컴포넌트 접속성 구성을 프리젠팅하는 단계는 입력 및 출력 포트를 포함하여, 사용자- 선택된 전자 컴포넌트 서브세트의 그래픽 표현을 프리젠팅하는 단계, 및 사용자에 의해 다르게는 선택되지 않고 사용자가 사용자의 시스템을 향상시키기 위해 구매하기를 원하는 제안된 전자 컴포넌트의 그래픽 표현을 프리젠 팅하는 단계를 포함한다. 상기 설명된 양호한 실시예를 따른 방법은 가용한 전자 컴포넌트의 텍스트 표현을 표시할 수 있고 사용자 입력 및 선택을 수신할 수 있는 텍스트 표시 디바이스를 통해 달성된다. 바람직하게는, 텍스트 표시 디바이스는 전 자 컴포넌트를 포함한다. 더 바람직하게는, 전자 컴포넌트는 전자 컴포넌트의 사용자 그룹내에 존재한다. 가 장 바람직하게는, 표시 디바이스는 스크롤가능한 표시 스크린을 표함하는 DVD 플레이어를 포함한다. 상기 설명된 양호한 실시예에 따른 방법은, 컴퓨터 네트워크를 통해 달성된다. 네트워크는 로컬 영역 네트워크 (LAN) 또는 와이드 영역 네트워크(WAN)를 포함한다. 네트워크는 또한 클라이언트/서버 네트워크를 포함한다. 가장 바람직하게는, 네트워크는 인터넷과 같은 글로벌 컴퓨터 정보 네트워크를 포함한다. 본 발명의 또 다른 양태에 따르면, 복수의 사용자에 의해 컴퓨터 네트워크를 통해 액세스가능한 벤더 웹 사이트 를 통해 전자 컴포넌트의 사용자에게 추천을 제공하기 위한 컴퓨터-구현 방법이 제공된다. 사용자는 벤더 웹 사이트에 액세스하기 위해 컴퓨터 네트워크에 접속된 사용자 컴퓨터를 구비한다. 본 발명의 이러한 양태에 따른 양호한 실시예는 적어도 소정 사용자-선택가능한 전자 컴포넌트 그룹을 나타내는 데이터를 포함하는 벤더/사용자 인터렉티브 웹 사이트를 제공하는 단계, 소정 사용자-선택가능한 전자 컴포넌트 의 그룹으로부터 사용자-선택된 전자 컴포넌트 서브세트를 나타내고, 컴퓨터 네트워크를 통해 전자적으로 포워 딩된 데이터를, 수신하는 단계, 사용자-선택된 전자 컴포넌트 서브세트를 나타내는 데이터를 객체-지향 데이터 베이스에 저장하는 단계, 사용자 선택된 전자 컴포넌트 서브세트의 각각을 그 연관된 기술적 속성으로 식별하는 단계, 사용자-선택된 전자 컴포넌트 서브세트의 기술적 속성을 비교하여 적합한 전자 컴포넌트 접속성 구성을 결정하는 단계, 및 제안된 전자 컴포넌트 접속성 구성을 나타내는 데이터를 컴퓨터 네트워크를 통해 사용자에게 전자적으로 포워딩하는 단계를 포함한다. 본 발명의 이러한 양태의 양호한 실시예에 따르면, 사용자 인터페이스 디스플레이를 제공하는 단계는 그래픽 사 용자 인터페이스 디스플레이를 제공하는 단계를 더 포함한다. 더 바람직하게는, 이러한 단계는 사용자-선택된 전자 컴포넌트 서브세트의 전자 컴포넌트 접속성 구성의 그래픽 표현을 프리젠팅하는 단계를 포함한다. 더 바 람직하게는, 그래픽 프리젠테이션은 사용자-선택된 전자 컴포넌트 서브세트의 각 전자 컴포넌트 상에서 적절한 커넥터의 접속을 보여주는 전기 와이어 또는 신호 케이블(일부는 라벨링됨)을 나타내는 데이터를 표시하는 단계 를 포함한다. 바람직하게는, 본 실시예는 사용자로부터 개인 정보를 수신하는 단계, 사용자-선택된 전자 컴포넌트 서브세트와 조합하여 개인 정보를 분석하는 단계, 및 추가 컴포넌트 또는 액세서리의 추천을 사용자에게 프리젠팅하는 단계 를 더 포함한다. 양호하게는, 이러한 추천을 프리젠팅하는 단계는, 사용자-선택된 전자 컴포넌트 서브세트에서 사용자에 의해 이전에 선택된 것과는 달리 벤더 컴포넌트에 관련된 정보를 포워딩하는 단계를 포함한다. 바람 직하게는, 개인 정보는 사용자 인구통계학적 데이터, 구매 이력 데이터, 클릭 스트림 데이터 또는 사용자-제공된 데이터를 포함하는 그룹으로부터 선택된다. 가장 바람직하게는, 각 컴포넌트의 기술적 속성을 검색하는 단 계는, 사용자-선택된 전자 컴포넌트 서브세트로부터 전자 컴포넌트 중 적어도 하나에 대한 기술적 스펙 및 접속 성 정보를 검색하는 단계를 포함한다. 본 발명의 이러한 양태의 가장 양호한 실시예에서, 전자 컴포넌트 접속성 구성을 프리젠팅하는 단계는 입/출력 포트 또는 잭을 포함하여, 사용자-선택된 전자 컴포넌트 서브세트의 그래픽 표현을 프리젠팅하는 단계, 및 사용 자가 사용자의 전자 컴포넌트 시스템을 향상시키기 위해 구매하기를 원하는 제안된 전자 컴포넌트를 프리젠팅하 는 단계를 포함한다. 가장 바람직하게는, 전자 컴포넌트는 AV 컴포넌트를 포함한다. 본 발명의 또 다른 양태에 따르면, 복수의 사용자에 의해 컴퓨터 네트워크를 통해 액세스가능한 벤더 웹 사이트 를 통해 벤더 컴퓨터로부터 사용자 컴퓨터에게 추천을 제공하기 위한 컴퓨터 시스템에서 - 사용자는 벤더 웹 사 이트에 액세스하기 위해 컴퓨터 네트워크에 접속된 사용자 컴퓨터를 구비함 -, 그래픽 전자 컴포넌트 생성 시스 템은 벤더 컴퓨터 상에서 실행가능하고, 벤더의 전자 컴포넌트를 나타내고 벤더 컴퓨터 웹 사이트를 통해 사용 자를 인터렉티브하게 가이드하는 인터렉티브 벤더 그래픽 전자 컴포넌트를 벤더 컴퓨터로 하여금 생성하도록 유 발하기 위한 명령을 포함하는 그래픽 전자 컴포넌트 생성 프로그램을 포함한다. 그래픽 전자 컴포넌트 생성 프 로그램은, 사용자에 의한 선택을 위해 사용자 컴퓨터와 연관된 표시 디바이스 상에 인터렉티브 벤더 전자 컴포 넌트를 사용자 컴퓨터가 표시하도록 유발하는 벤더 웹 사이트에 사용자 컴퓨터가 액세스했을 때, 사용자 컴퓨터 에 표시 명령을 전송하도록 동작한다. 본 발명의 이러한 양태의 양호한 실시예에 따르면, 벤더 컴퓨터는 사용자 선택된 전자 컴포넌트를 기록하고, 사 용자에 의해 제공되거나 이력 데이터 또는 클릭 스트림 데이터를 통해 획득된 개인 데이터를 기록한다. 바람직 하게는, 벤더 컴퓨터는 벤더 컴퓨터가 사용자의 전자 컴포넌트를 분석하고 사용자의 개인적 선호도에 따라 향상 되거나 추가적인 전자 컴포넌트를 추천하도록 허용하는 인공 지능(Artificial Intelligence: AI) 기능을 포함한 다. 더 바람직하게는, AI 기능은 이들 용어들이 본 명세서에 기재된 바와 같이, 추가적인 벤더 제품을 교차-판 매하거나 업-판매할 수 있도록 사용자의 개인 정보를 추가로 분석한다. 본 발명의 추가 양태에 따르면, 전자 컴포넌트의 사용자에게 추천을 프리젠팅하기 위한 컴퓨터-구현 방법이 제 공된다. 본 발명의 이러한 양태의 양호한 실시예에 따른 방법은, 객체 지향 데이터베이스로부터, 적어도 소정 사용자-선택가능한 전자 컴포넌트의 그룹을 나타내는 데이터를 포함하는 사용자 인터페이스 디스플레이를 제공 하는 단계, 소정 사용자-선택가능한 전자 컴포넌트 그룹으로부터 사용자-선택된 전자 컴포넌트 서브세트를 나타 내는 데이터를 수신하는 단계, 전자 컴포넌트 속성 수집 모듈로부터, 사용자-선택된 전자 컴포넌트 서브세트의 각 컴포넌트와 연관된 속성을 검색하는 단계, 사용자-선택된 전자 컴포넌트 서브세트의 수신된 데이터 및 연관 된 속성을 규칙 데이터베이스를 구비하는 분석 엔진에 전달하는 단계, 사용자-선택된 전자 컴포넌트 서브세트 및 연관된 속성을 분석하여 적합한 전자 컴포넌트 접속성 구성을 결정하는 단계, 및 전자 컴포넌트 접속성 구성 을 나타내는 데이터를 사용자에게 프리젠팅하는 단계를 포함한다. 바람직하게는, 컴포넌트 객체 지향 데이터베이스의 각 전자 컴포넌트 오브젝트는 각 전자 컴포넌트의 기술적 정 보를 포함한다. 기술적 정보는 바람직하게는 전자 컴포넌트와 연관된 입/출력 포트 또는 잭의 타입을 포함한다. 기술적 정보는 전자 컴포넌트에 의해 지원되는 사운드 성능 타입을 포함한다. 바람직하게는, 사운 드 성능 타입은 디지털 사운드 성능을 포함한다. 기술적 정보는 각 전자 컴포넌트와 연관된 디바이스 버스의 타입을 포함한다. 이러한 본 발명의 양태의 양호한 실시예에서, 전자 컴포넌트의 속성을 조사하고, 규칙 데이터베이스로부터 규칙 을 적용하여, 적합한 입/출력 접속성 구성을 결정하고 전자 컴포넌트들 사이에 존재하는 양립불가능성을 결정하 는 분석 엔진이 제공된다. 바람직하게는, 적합한 입/출력 컴포넌트 접속성 구성은 광학, RCA 잭 또는 COAX 접 속성 구성을 포함한다. 또 다른 양호한 실시예에서, 사용자 인터페이스 디스플레이는 전자 컴포넌트를 포함한다. 가장 바람직하게는, 전자 컴포넌트는 DVD 플레이어와 같은 AV 컴포넌트를 포함한다. 이러한 양호한 실시예에서, 소정 사용자-선택 가능한 전자 컴포넌트 그룹을 나타내는 데이터는 적어도 텍스트 포맷 또는 적어도 그래픽 포맷으로 사용자에게 제공된다. 상기 언급된 양태들의 또 다른 실시예에 따르면, 소정 사용자-선택가능한 전자 컴포넌트 그룹을 나타내는 데이 터가 적어도 하나의 다이얼로그 박스로 표시되는 그래픽 사용자 인터페이스 디스플레이가 제공된다. 바람직하 게는, 소정 사용자-선택가능한 전자 컴포넌트 그룹은 각각이 연관된 다이얼로그 박스에 표시되는 분리된 전자컴포넌트를 포함하고, 사용자는 각 다이얼로그 박스로부터 전자 컴포넌트를 독립적으로 선택하거나 선택하지 않 을 수 있다. 각 전자 컴포넌트의 각 연관된 다이얼로그 박스는 연관된 전자 컴포넌트의 적어도 하나의 모델을 포함한다. 더 바람직하게는, 각 전자 컴포넌트의 각 연관된 다이얼로그 박스는 연관된 전자 컴포넌트의 복수의 다른 모델을 나타내는 데이터를 포함한다. 전자 컴포넌트는 바람직하게는 AV 컴포넌트이고, AM/FM 수신기, 증 폭기, 턴테이블, 등화기, 컴팩트 디스크(CD) 플레이어, DVD 플레이어, 카세트 레코더/플레이어, DAT 플레이어, 텔레비전, HD 텔레비전, 범용 컴퓨터, MD 플레이어, TiVo 레코더/플레이어, 비디오 카세트 레코더/플레이어 (VCR/P) 또는 레이저 디스크 플레이어를 포함한다. 상기 설명된 바와 같은 본 발명의 컴퓨터 시스템 양태에서, 인터렉티브 그래픽 전자 컴포넌트 디스플레이가 적 어도 하나의 다이얼로그 박스를 포함하는 양호한 실시예가 제공된다. 바람직하게는, 인터렉티브 벤더 그래픽 전자 컴포넌트 디스플레이는 각각이 연관된 다이얼로그 박스에 표시되는 분리된 전자 컴포넌트의 표현을 포함하 고, 사용자는 각 다이얼로그 박스로부터 전자 컴포넌트를 독립적으로 선택하거나 선택하지 않을 수 있다. 더 바람직하게는, 각 전자 컴포넌트의 각 연관된 다이얼로그 박스는 연관된 전자 컴포넌트의 적어도 하나의 모델을 나타내는 데이터를 포함한다. 다르게는, 각 전자 컴포넌트의 각 연관된 다이얼로그 박스는 연관된 전자 컴포넌트의 복수의 다른 모델을 나타 내는 데이터를 포함한다. 가장 바람직하게는, 전자 컴포넌트는 AV 컴포넌트이다. 바람직하게는, AV 컴포넌트 는 AM/FM 수신기, 증폭기, 턴테이블, 등화기, 컴팩트 디스크(CD) 플레이어, DVD 플레이어, 카세트 레코더/플레 이어, DAT 플레이어, 텔레비전, HD 텔레비전, 범용 컴퓨터, MD 플레이어, TiVo 레코더/플레이어, 비디오 카세 트 레코더/플레이어(VCR/P) 또는 레이저 디스크 플레이어를 포함하는 그룹으로부터의 임의의 하나의 컴포넌트를 포함한다. 본 발명의 다른 양태에서, 전자 컴포넌트의 사용자에게 전자 컴포넌트 및 관련된 추천을 제공하기 위한 컴퓨터- 구현 방법이 제공된다. 양호한 방법은 적어도 소정 사용자-선택가능한 전자 컴포넌트 그룹을 나타내는 데이터 를 포함하는 그래픽 사용자 인터페이스 디스플레이를 제공하는 단계 - 소정 사용자-선택가능한 전자 컴포넌트 그룹으로부터의 각 전자 컴포넌트는 그 자신의 다이얼로그 박스와 연관됨 -, 소정 사용자-선택가능한 전자 컴포 넌트 그룹에서, 사용자-선택된 전자 컴포넌트 서브세트를 나타내는 데이터를 수신하는 단계, 메모리 저장 디바 이스로부터 사용자 선택된 전자 컴포넌트 서브세트의 각 컴포넌트와 연관된 속성을 검색하는 단계, 사용자-선택 된 전자 컴포넌트 서브세트와 연관된 속성을 비교하여 적합한 전자 컴포넌트 접속성 구성을 결정하는 단계, 및 전자 컴포넌트 접속성 구성을 나타내는 데이터를 사용자에게 프리젠팅하는 단계를 포함한다. 바람직하게는, 이러한 방법은 임의의 소정 전자 컴포넌트와 연관되지 않은 추가적인 사용자 인터렉티브 다이얼 로그 박스를 제공하는 단계를 포함한다. 더 바람직하게는, 방법은 비연관된 다이얼로그 박스를 통해 사용자로 부터 적어도 하나의 사용자-공급된 전자 컴포넌트를 수신하는 단계를 포함한다. 다르게는, 인간 조작자가 수신, 검색 및 비교 단계를 수행한다. 이러한 대안에서, 사용자는 인간 조작자와 통신할 수 있다. 바람직하게 는, 통신은 전자 통신을 통해서이다. 다르게는, 통신은 음성 통신을 통해서이다. 본 발명의 또 다른 양태에서, 전자 컴포넌트 세트의 전자 컴포넌트 접속성 구성을 결정하기 위한 컴퓨터-구현 방법이 제공된다. 본 양태의 양호한 실시예는 분석 엔진을 제공하는 단계, 로직 규칙을 포함하는 규칙 데이터 베이스를 제공하는 단계, 전자 컴포넌트 세트의 주지된 속성을 분석하는 단계, 및 규칙 데이터베이스로부터 규 칙을 적용하여 적합한 전자 컴포넌트 접속성 구성을 결정하는 단계를 포함한다. 바람직하게는, 분석 엔진은 전 자 컴포넌트들 사이에 존재하는 양립불가능성을 추가로 결정한다."}
{"patent_id": "10-2011-7002245", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이제, 본 발명의 양호한 실시예에 따른 사용자 인터페이스 표시 디바이스를 예시하고 있는 도 1a를 참조한"}
{"patent_id": "10-2011-7002245", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "다. 본 양호한 실시예의 표시 디바이스는 DVD 플레이어이다. 그러나, 본 기술분야의 통상의 기술자라면, 표시 디바이스가 사용자와 상호작용할 수 있고 사용자 선택가능한 전자 컴포넌트를 표시할 수 있는 임의의 타입 일 수 있다는 것을 잘 알고 있을 것이다. 표시 디바이스는 표시 스크린, DVD 드라이브, 및 사용자 인터페이스 유닛을 포함한다. 인터페이스 유닛은 숫자 키패드, 알파벳 키패드, 또는 문자숫자식 키패 드일 수 있다. 그러나, 인터페이스 유닛은 표시 스크린으로부터 컴포넌트를 선택할 수 있는 임의의 타 입의 키패드 또는 다른 입력 디바이스일 수 있다. 예를 들면, 인터페이스 유닛은 원격 제어 유닛(26′)으로 도 시된 것과 같이, 디스플레이로부터 이격되어 있을 수 있다. 도 1b는 본 발명에 따른 양호한 방법을 예시하고 있다. 동작시, 사용자는 우선 DVD를 DVD 드라이브에 넣고, DVD 플레이어를 활성화시켜 디스크를 플레이시킨다. 디스크는 사용자가 선택할 수 있는 소정 전자 컴포넌트를 나타내는 데이터의 정적 메모리를 포함할 것이다. 디스크는 광고, 제조자 주의표시, 특징있는 모델 또는 컴포넌트 등과 같은 다른 정보를 포함할 수 있다. 그래서, 일단 DVD가 로딩되어 플레이되도록 활성화되면, 사용자는 선택을 시작할 수 있다. 단계에 도시된 바와 같이, 사용자는 양호하게는 구성을 위해 가용한 AV 기기 또는 컴포넌트의 표시를 위해 사용자 인터페이스 표시 스크린을 액세스할 수 있다. AV 컴포넌트는 사용자에 의한 선택을 위해 하나씩 텍 스트로 표시될 수 있다. 즉, 사용자-선택가능한 컴포넌트는 사용자가 선택을 우측 또는 좌측으로, 또는 위 및 아래로 스크롤하여 선택을 할 수 있도록 직렬로 제공될 수 있다. 이러한 스크롤링은 사용자 인터페이스 유닛 을 이용함으로써 수행된다. AV 컴포넌트의 선택은 하나의 벤더로부터이고 다양한 벤더를 포함할 수 있다. AV 컴포넌트의 표시는 텍스트만을, 또는 그래픽만을, 또는 텍스트 및 그래픽 모두를 포함할 수 있다. 시스템은 AV 컴포넌트의 사용자-선택된 서브세트(subset)를 수신하고, 이러한 정보를, 단계에 도시된 바와 같이 사용자의 선택과 매칭하는 디스크(도시되지 않음) 상의 저장된 메모리 또는 페이지에 전송한다. 단 계에 예시된 바와 같이, 시스템은 저장된 페이지로부터 AV 컴포넌트(component)의 서브세트와 연관된 기술 적 속성을 검색한다. 그리고나서, 시스템은 단계에 도시된 바와 같이, 적합한 AV 컴포넌트 접속성 구 성의 사용자 판독가능한 표시를 생성한다. 이러한 표시는 텍스트 구성 명령을 포함하거나, 사용자에 의해 선택 된 AV 컴포넌트 및 AV 컴포넌트간의 접속을 도시하는 그래픽을 포함하거나, 이들 모두를 포함할 수 있다. 이들 표시들은, 사용자가 그 시스템을 함께 접속할 때 사용자에게 가이드하도록 기록된 인덱스로 또는 컬러 코딩을 통해 라벨링된, 전기 배선 또는 신호 케이블의 표현을 포함할 수 있다. 도 2는 본 발명의 다른 양호한 실시예에 따른 컴퓨터 시스템의 개략도를 예시하고 있다. 시스템은 처리 유 닛, 데이터 입력 디바이스 또는 키보드, 사용자 인터페이스 표시 디바이스 또는 모니터, 및 데 이터 판독 디바이스 또는 CD/ROM 드라이브를 포함한다. CD/ROM 디바이스는 대신에, 테이프 드라이브, DVD 드라이브 또는, 테이프 카세트, 디스켓, CD, DVD 디스크, MD 등과 같은 주지된 저장 매체(108, 점선 안에 도시 됨)로부터 메모리 저장을 수신할 수 있는 임의의 다른 드라이브 디바이스일 수 있다. 임의의 주지된, 상용으로 가용한, 컴퓨터 하드웨어 및 시스템 소프트웨어는 처리 유닛, 키보드, 모니 터, 및 데이터 저장 디바이스 드라이브를 명령하고 제어하는데 활용될 수 있다. 양호하게는, 컴퓨터 시스템은 컴퓨터 시스템의 프로세서와, 디스크 드라이브에 로딩된 저장 매체를 액세스 할 수 있는 디스크 드라이브간의 인터페이스를 제공하기 위한 인터페이스 유닛을 포함한다.저장 매체는 양호하게는, 속성 수집 모듈 및 비교기를 포함하는 데이터베이스를 포함한다. 이 들 저장 매체의 부분들은 인터페이스 모듈을 통해 사용자에 의해 액세스가능하고, 전자 컴포넌트 정 보의 입력 및 출력을 허용한다. 이러한 양호한 실시예에서, 사용자는 저장 매체를 저장 디바이스 드라이브에 삽입하고, 저장 매체 와 연관된 소프트웨어 프로그램을 동작시킨다. 소프트웨어 프로그램의 동작은 퍼스널 컴퓨터 또는 클라이 언트/서버 컴퓨터 시스템과 같은 일반 목적 컴퓨터 시스템 상에서 소프트웨어 프로그램을 동작시키는 주지된 방"}
{"patent_id": "10-2011-7002245", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "법에 따라 실행될 수 있다. 본 기술분야의 숙련자라면, 저장 매체에 내장된 소프트웨어 프로그램을 동작 시키는 임의의 수단이 본 발명에 의해 생각될 수 있고 본 발명을 구현하는데 활용될 수도 있다는 것을 잘 알고 있을 것이다. 본 발명의 도 2에 도시된 시스템의 동작은 도 3에 도시된 플로우차트에 의해, 나중에는 특정 예를 통해 일 반적으로 설명될 것이다. 이제, 도 3을 참조하면, 도 1b에 도시된 제1 단계와 유사하게, 단계는 사용자가 AV 컴포넌트의 서브세트를 선택하는 제1 액세스 스크린을 제공한다. 본 발명의 이러한 양호한 실시예에서, 사 용자 선택 스크린을 구축하기 위한 AV 컴포넌트 정보는 컴포넌트 객체-지향 데이터베이스로부터 도출된다. 각 컴포넌트의 식별도 또한 컴포넌트 객체-지향 데이터베이스내에 포함된다. 이들 컴포넌트 ID(35 3)는 각 AV 컴포넌트에 접속된 속성을 포함한다. 이들 속성들은 본질적으로 기술적이다. 즉, 이들은 기술적인 스펙, 배선도 또는 각 AV 컴포넌트의 다른 속성을 포함한다. 뿐만 아니라, 이들은 각 컴포넌트의 전력 레이팅 또는 각 컴포넌트가 수용할 수 있는 전력량, RCA 잭, COAX 또는 광학 포트의 범위에 걸치는 각 컴포넌트 상에서 가용한 입력 및 출력 포트의 타입과 같은 컴포넌트의 다른 양태를 포함할 수 있다. 뿐만 아니라, 기술적 속성 은 컴포넌트가 S-Link, IEEE 1394-fier 와이어, 제어 A1 또는 임의의 다른 장래 인터페이스 표준을 핸들링할 수 있는지 여부를 포함한다. 애니메이션을 포함한, 그래픽 표현은 Shock WaveTM 기술과 같은 상용 애니메이션 툴 소프트웨어를 이용하여 생 성될 수 있다. 각 AV 컴포넌트는 썸네일 이미지 또는 텍스트 또는 양쪽으로 표현될 수 있다. 그러므로, 단계 에 따라 사용자에게 양호하게 제공되는 제1 스크린은 도 4에 소정 사용자-선택가능한 전자, 또는 구체적으 로 AV 컴포넌트의 그룹으로서 도시되어 있다. 사용자는 사용자가 소유하는 컴포넌트 또는 사용자가 그 시스템 에 포함하기를 원하는 것들을 하이라이팅하도록 프롬프트된다. 이러한 프롬프팅은 사용자가 AV 컴포넌트의 서 브세트에 부가될 AV 컴포넌트를 계속해서 선택하는 한 계속된다. 사용자가 원하는 모든 선택을 수행한 후, 사 용자는 양호하게는 도 4에 도시된 바와 같이 “완료”또는 “구성”버튼을 클릭(click)함으로써 선택 프로세스 를 완료한다. 단계에 도시된 바와 같이, 본 양호한 실시예에 따른 시스템은 사용자 선택된 AV 컴포넌트 서브세트를 모으 고, 수집 모듈을 이용하여 AV 컴포넌트 속성을 수집한다. 그리고나서, 이들 속성들을 사용자에 의해 선택 된 컴포넌트와 접속시킨다. 다음 단계에서, 사용자에 의해 선택된 AV 컴포넌트 서브세트의 컴포넌트 속성 이 분석 엔진에 의해 분석된다. 이러한 분석 엔진은 양호하게는, 규칙 데이터베이스를 이용하여 기 능한다. 규칙 데이터베이스에 내장된 규칙은 조건 세트로서 생성된다. 즉, 분석 엔진에 의해 분석 된 AV 컴포넌트의 서브세트에 기초하여, 규칙 데이터베이스로부터의 특정 규칙 세트가 적용되고, 결과적인 적합한 AV 컴포넌트 접속성 구성이 결정될 것이다. 뿐만 아니라, 시스템은 나중 이용을 위해 사용자 선택 된 AV 컴포넌트 서브세트와 그 연관된 기술적 속성을 저장하고, 이들을 비교기를 이용하여 비교함으로써, 적합한 AV 컴포넌트 접속성 구성을 결정한다. 이러한 특징은 사용자가 다음번에 프로그램을 실행할 때, 시스템 이 사용자와의 인터렉션을 개인화할 수 있도록 허용할 것이다. 즉, 시스템은 사용자가 이전에 선택한 컴포넌트 에 관한 정보를 가지게 되고, 이러한 정보를 그 사용자와의 후속 인터렉션 동안에 검색할 수 있다. 그럼으로써, 본 발명은 예를 들면, 사용자 소유의 컴포넌트가 구식이 되었고 새로운 모델이 이제 가용하다는 것 을 사용자에게 프롬프트할 수 있다. 단계에 도시된 바와 같이, 일단 이러한 정보가 다시 수집되면, 본 양호한 실시예에 따른 본 발명은 추천된 구성을 사용자에게 제공한다. 뿐만 아니라, 단계에 도시된 바와 같이, 본 양호한 실시예에 따른 시스템은 규칙 데이터베이스로부터 도출된 서브세트 규칙에 따라 분석 엔진에 의해 수행된 분석 결과로서 발생 하는 사용자 오락 시스템의 양립불가능성 또는 약점을 식별할 수 있다. 상기 AV 컴포넌트 접속성 구성뿐만 아니라, 본 양호한 실시예에 따른 본 발명은 컴포넌트 업그레이드 추천을 할 수 있다. 또한, 단계(362′)에 도시된 바와 같이, 본 양호한 실시예에 따른 시스템은 개인화된 교차-판매 및 업-판매 추천을 사용자에게 제공한다. 교차-판매(cross-selling)는 일반적으로 판매되는 메인 시스템과 함께이용되는 특정 액세서리에 대한 제안을 제공하는 것으로 정의된다. 본 특정 실시예에서, 교차-판매는 사용자에 게 관심있는 특정 CD 또는 DVD의 제안으로 구성된다. 본 공보에 기재된 업-판매(up-sell)는 사용자가 사용하고 있는 AV 컴폰넌트, 브랜드 X는 예를 들면 브랜드 Y와 동일한 성능을 가지고 있지 않다는 것을 사용자에게 광고 하는 것으로 정의된다. 그러므로, 사용자는 현재의 기기보다 장점을 지정함으로써, 그가 현재 소유하고 있는 브랜드 X 대신에 브랜드 Y 컴포넌트를 사야 할 것이다. 교차-판매 및 업-셀을 수행하고 다른 개인화된 추천을 사용자에게 제공하는 능력은 도 3에 도시된 바와 같이, 개인화 툴에 의해 달성된다. 임의의 공지된 상용 개인화 제품은 본 발명의 양호한 실시예와 관련하여 개 인화 툴을 구현하는데 이용될 수 있다. 하나의 그러한 개인화 툴은 Net Perceptionsⓡ으로서, 본 발명을 구현하는데 활용될 수 있다. 다른 하나는 DataStageⓡ로서, 확립된 변형가능한 규칙 및 제품 카탈로그를 이용 하여 사용자에게 관심이 될 수 있는 다른 제품의 추천을 수행한다. 뿐만 아니라, 본 발명과 관련하여 생성되고 이용될 수 있는 다른 맞춤형 개인화 툴이 있다. 도 4는 전형적인 윈도우즈ⓡ-타입 사용자 인터페이스 프로그램 스크린 상에 나타날 수 있는 샘플 사용자 인터페 이스 표시 스크린을 예시하고 있다. 도시된 바와 같이, 각각이 전형적인 오락 시스템의 분리된 AV 컴포넌 트 전용인 다이얼로그 박스가 사용자에게 제공된다. 구체적으로는, 컴포넌트 A에 대한 제1 다이얼로그 박스 는 모든 가용한 수신기를 나타낸다. 이러한 다이얼로그 박스는, 모든 타입 A 컴포넌트의 다양한 수 신기 모델 번호 및 이미지(237, 가용한 경우)를 포함하는, 스크롤가능한 서브스크린을 포함한다. 사 용자는 관심있는 특정 모델 번호에 “클릭”하도록 프롬프트된다. 그렇게 했을 때, 그 특정 컴포넌트가 하일라 이트되고 사용자는 선택된 컴포넌트에 관한 추가 정보를 더 액세스할 수 있다. 다르게는, 각 모델 번호 및 이미지 다음에, 사용자가 최종적으로 특정 모델을 선택하기에 앞서서, 사용자에 의해 선택된 컴 포넌트에 관한 추가 정보를 수집하기 위한 사용자 선택가능한 아이콘(도시되지 않음)이 있을 수 있다. 도 4에서 용이하게 알 수 있는 바와 같이, 사용자는 다음 다이얼로그 박스로 계속하도록 프롬프트되어, 관심이 있는 컴포넌트 또는 사용자가 현재 소유하고 있는 컴포넌트를 선택한다. 일단 사용자가 선택 프로세스를 완료 하면, 사용자는 “구성”아이콘을 클릭한다. 이러한 액션은 소정 사용자-선택가능한 AV 컴포넌트의 그룹 으로부터 사용자 선택된 AV 컴포넌트 서브세트를 AV 컴포넌트 속성 수집 모듈(355, 도 3)에 전소안다. 사용자 가 선택 프로세스 동안에 실수를 하거나 결정을 변경하면, 그는 다이얼로그 박스에서 특정 컴포넌트의 특정 선 택을 리셋하거나, 리셋 버튼으로 모든 컴포넌트의 전체 선택을 리셋할 수 있다. 도 5는 대부분의 계산 및 분석이 시스템에 의해 수행된 후 시스템에 의해 생성된 AV 컴포넌트 접속성 구성의 사용자로의 프리젠테이션을 예시하고 있다. 이러한 측면에서, 본 양호한 실시예의 사용자에게는 도 4에 도시된 바와 같이 동일한 표시 스크린이 프리젠팅(presenting)되지만, 이들 주어진 AV 컴포넌트에 대한 접 속의 가장 적합한 선택을 보여주는 접속도와 함께, 사용자에 의해 선택된 컴포넌트를 예시하고 있다. 또한, 시 스템에 의해 제공되는 것은, 사용자의 오락 시스템의 이들 배선 또는 케이블링을 구성하는 방법에 관한 단계 명 령에 의한 텍스트 단계이다. 와이어 또는 케이블은 참조의 용이성을 위해 W1, W2 및 W3 등으로 라벨링된 다. 라벨링은 다른 심볼 또는 인덱스로 구성되어, 사용자가 컴포넌트를 함께 접속하는데 도움을 준다. 사용자에 의해 선택된 특정 AV 컴포넌트를 구성하는 방법에 관한 텍스트 명령뿐만 아니라, 시스템이 사용 자에 의해 선택된 AV 컴포넌트의 측면에서 수행된 분석 결과인 추가 텍스트 인덱스가 제공된다. 즉, 시스 템이 사용자-선택된 서브세트를 검토할 때, 시스템은 그 서브세트에 현재 존재하고 있는 AV 컴포넌트가 그 사용 자를 위한 최적 컴포넌트 조합인지 여부를 분석한다. 뿐만 아니라, 시스템은 선택된 AV 컴포넌트가 특정 벤더 로부터 가용한 가장 진보되고, 최상의 가장 적합한 컴포넌트인지를 알기 위해 체크한다. 그와 같이, 이러한 본 발명의 양태는 사용자가 이들 컴포넌트를 선택하지 않았고 따라서 이들을 그때에 소유하고 있지 않을 가능성이 높다는 것을 알고서, 진보된 AV 컴포넌트를 사용자에게 판매하고 마케팅하는 즉각적인 수단을 제공할 수 있다. 이러한 추가 정보를 사용자에게 제공하기 위한 수집 프로세스의 일부로서, 본 발명의 실시예에 따른 시스템은, AV 컴포넌트 정보를 수신할 뿐만 아니라, 사용자로부터 개인 정보를 추가로 수신하고 사용자 선택된 AV 컴포넌 트 서브세트와 함께 그 개인 정보를 분석한다. 일단 시스템이 그렇게 했다면, 추가 추천을 사용자에게 프리젠 팅한다. 이들 추천들은 사용자에게 가용하고 전체적으로 오락 시스템을 추가로 향상시키는 진보되거나 더 하이 레벨의 컴포넌트 및/또는 액세서리로 구성된다. 상기 언급된 정보뿐만 아니라, 본 발명의 양호한 실시예에 따른 시스템은 사용자의 관심사가 되는 CD, 비디오 및 MD 등과 같은 액세서리에 관한 정보를 사용자에게 제공할 수 있다. 그러한 정보는 사용자에 의해 시스템에 제공되는 사용자 인구통계학적(demographic) 데이터, 사용자에 의해 제공되거나 벤더에 의해 얻어지는 역사적인 구매 데이터, AV 구성 세션 동안에 사용자의 액션 키 스트로크를 검토함으로써 얻어지는 클릭 스트림 데이터, 또는 벤더가 그러한 개인 정보를 수신하는 임의의 다른 수단을 통해 수집된다. 본 발명의 다른 양호한 실시예에 따르면, 도 6은 일반적으로 200으로 지정된, AV 접속성 구성 및 다른 관련된 정보를 추천하기 위한 컴퓨터 네트워크 시스템의 개략도를 예시하고 있다. 본 실시예는 도 2-5와 관련하여 상 기 설명된 것과 유사하지만, 본 실시예는 컴퓨터 네트워크를 특징으로 한다. 컴퓨터 네트워크 시스템은 각각이 도 2와 관련하여 설명된 것과 유사한 처리 유닛을 포함하는 사용자 또는 고객 컴퓨터 그룹을 포함한다. 고객 컴퓨터는 또한 도 2와 관련하여 기재된 바와 같이, 키보드 및 모니터를 포함한 다. 이들 고객 컴퓨터 각각에 내장된 것은 AV 컴포넌트 정보를 적어도 일시적으로 저장하기 위한 데이터 베이스(도시되지 않음)이다. 이러한 네트워크 시스템은 또한 인터페이스 허브(또는 네트워크 서버, 210)를 포 함한다. 네트워크 서버와 인터페이싱되는 것은 데이터베이스를 포함하는 벤더 컴퓨터이다. 도 6에 도시된 데이터베이스는 도 2에 도시된 저장 매체와 동일하거나 유사하게 저장된 정보를 포함하고, 속 성 수집 모듈 및 비교기를 포함하고 이들로 제한되지 않는다. 도 2 및 3과 관련하여 기재된 이용 또는 동작은 도 6에 도시된 양호한 실시예에도 동일하게 적용가능하고, 네트워크 접속도 부가된다. 특히, 본 실시예는 AV 구성에 관한 정보를 위해 복수의 사용자 또는 고객들이 서버 컴퓨터를 액세스하는 것을 허용한다. 예를 들면, 수 명의 사용자들은 시스템으로부터 AV 컴포넌트 접속성 구성을 얻기를 원한 다. 예를 들면, 하나 이상의 고객 컴퓨터가 도 3과 관련하여 상기 설명된 바와 같이 요구를 한다. 정보 는 네트워크를 통해 네트워크 서버 컴퓨터의 하나로 전달된다. 그리고나서, 서버 컴퓨터는 소 정, 사용자 선택된 AV 컴포넌트의 그룹으로부터 사용자 선택된 AV 컴포넌트 서브세트를 취하여, 이를 어느 AV 컴포넌트 접속성 구성이 요구를 하는 특정 사용자에 대해 가장 적합한지를 결정하는 그 서브모듈을 포함하여, 데이터베이스 또는 저장 매체에 전달한다. 도 6에 도시된 네트워크는 양호하게는 로컬 영역 네트워크, 와이드 영역 네트워크, 또는 클라이언트/서버 네트"}
{"patent_id": "10-2011-7002245", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "워크일 수 있다. 본 기술분야의 통상의 기술자라면, 임의의 주지된 상용 네트워킹 시스템 및 네트워킹 소프트 웨어가 본 발명에 의해 고려될 수 있고 본 발명의 범주내에 든다는 것을 잘 알고 있을 것이다. 도 7은 본 발명의 또 다른 양호한 실시예를 예시하고 있다. 이러한 시스템은 인터넷과 같이, 글로벌 통신 컴퓨터 네트워크를 활용하는 네트워크 시스템을 포함한다. 고객 또는 사용자 컴퓨터는 도 2 및 6과 관련하여 설명된 것과 유사하고, 유사한 참조부호는 유사한 구성요소를 나타낸다. 그러므로, 도 7에 예시된 바 와 같이, AV 컴포넌트를 추천하기 위한 컴퓨터 시스템이 제공된다. 인터넷을 통해 액세스가능한 벤 더 웹 사이트(vendor web site)를 통해 사용자 컴퓨터에게 추천을 하는데 이용되는 벤더 컴퓨터도 포 함된다. 본 양호한 실시예에서, 컴퓨터 시스템은 벤더 컴퓨터 상에서 실행가능한 그래픽 AV 컴포넌트 생성 프 로그램을 포함하고, 벤더 컴퓨터가, 벤더의 AV 컴포넌트를 나타내는 인터렉티브한 벤더 그래픽 AV 컴포넌트 표 시를 생성하도록 하기 위한 명령을 포함하며, 사용자를 벤더 컴퓨터 웹 사이트를 통해 인터렉티브하게 가이드한 다. 그래픽 AV 컴포넌트 생성 프로그램은 사용자 컴퓨터가 벤더 웹 사이트에 액세스했을 때 표시 명령을 사용자 컴 퓨터에 전송하도록 동작한다. 이것은 사용자 컴퓨터가 선택을 위해 그 모니터 상에 인터렉티브 벤더 AV 컴포넌트를 표시하도록 유발한다. 그러한 디스플레이의 하나의 예는 인터넷과 같은 글로벌 컴퓨터 정보 네 트워크를 통해 액세스되는 것이 될 것이다. 이러한 예는 도 4에 기재되거나 도시된 것과 유사하다. 그러나, 이러한 특정 실시예가 인터넷 접속을 통해 달성되므로, 페이지의 최상부에 표시되는 URL 어드레스가 있다(도시 되지 않음). 유사하게, 사용자-선택된 서브세트에 기초한 사용자로의 추천의 스크린 표시가 이용될 수 있다. 다시, 이러한 표시는 페이지의 상부에 URL 어드레스를 포함한다(도시되지 않음)는 점을 제외하고는, 도 5에 도시된 것과 유사 하다. 상기 언급된 바와 같이, 분석 엔진은 규칙 데이터베이스를 활용하여 기능한다. 규칙은 양호하게는 조건 세트로 서 생성된다. 분석 엔진이 규칙을 이용하는 방법의 하나의 예로서, 이하의 예시가 제공된다. 객체-지향 데이터베이스의 각 컴포넌트 오브젝트는 I/O 포트의 타입, 양, 지원되는 디지털 사운드 성능의 타입, 존재하는 경우 각 컴포넌트가 가지는 디바이스 버스의 타입, 및 다른 속성을 포함하고 이들로 제한되지 않는 정 보를 포함할 것이다. 분석 엔진은 이들 속성을 조사하고 규칙 데이터베이스의 규칙을 이용하여, 컴포넌트들간 에 존재하는 임의의 양립불가능성을 지적할 뿐만 아니라(예를 들면, DVD 플레이어와 수신기가 선택되지만, 어느 것도 Dolby 5.1 AC3 컨버전을 수행할 수 없다), 컴포넌트를 접속하는 최상의 I/O 구성(예를 들면, 광학, RCA 또 는 COAX)을 결정한다. 예를 들면, 일부 규칙들은 이하와 같이 동작한다. DVD I/O가 광학 출력을 가지고 있고 수신기가 Dolby 5.1 AC3 컨버터를 구비하는 경우, DVD 광학 출력을 수신기 광학 입력에 접속하라. 그렇지 않고, DVD I/O는 RCA 출력을 가지고 있고 수신기 I/O는 RCA 입력을 가지고 있으며, 수신기 또는 DVD가 Dolby 5.1 AC3 컨버터를 가지고 있는 경우, DVD RCA 출력을 수신기 RCA 입력에 접속하라. DVD I/O가 광학 출력 및 RCA 출력 및 수신기 I/O 광학 입력 및 RCA 입력을 가지고 있고 DVD 및 수신기가 Dolby 5.1 AC3 컨버터를 가지고 있지 않은 경우, Dolby 5.1 AC3 사운드는 Dolby 5.1 AC3 디코더 어댑터없이는 이 선 택으로부터 렌더링될 수 없다는 것을 사용자에게 경고하라. 다른 DVD 플레이어나 다른 수신기 중 어느 하나를 추천하라. 규칙에서의 우선권 순서는 양호하게는 설정된다. 더 나은 성능 접속이 우선 체크될 것이다. 이 경우에, 추가 적인 규칙이 정확한 업그레이드 DVD 및 수신기를 고객에게 표시하는데 이용될 것이다. 본 발명의 양호한 실시예에서, 시스템은 분석 엔진 및 그래픽 기술과 함께 객체 지향 데이터베이스를 이용하여 그 태스크를 달성한다. AV 컴포넌트에 대한 정확한 접속성 구성을 알기를 원하는 사용자는 구입했거나 구입할 계획이 있는 컴포넌트를 선택할 것이다. 아이템 리스트는 오브젝트 데이터베이스에 저장된 정보로부터 생성될 것이다. 컴포넌트가 선택된 후, 고객은 최적 구성의 그래픽 표현 및 텍스트 기술을 요구한다. 이러한 요구가 수행된 경우, 분석 엔진은 오브젝트 데이터베이스에 저장된, 그 컴포넌트의 대응하는 속성을 얻 음으로써, 사용자에 의해 선택된 컴포넌트를 조사할 것이다. 분석 엔진은 분석 엔진의 구성 기능을 위해, 입력 으로서 오브젝트의 속성을 이용한다. 구성 기능은 선택된 AV 컴포넌트에 기초하여 가능한 셋업 구성을 조사할 것이다. 규칙-기반 AI는 구성 기능을 가이드하여 선택된 AV 컴포넌트에 대한 최상의 가능한 구성을 출력하는데 이용될 것이다. 출력은 그래픽 성능을 가지지 않는 툴을 이용하는 디바이스에 대해서는 텍스트 기술만일 수 있다. 다르게는, 출력은 그래픽을 지원하는 디바이스에 대해서는 그래픽 및 텍스트일 수 있다. 이제, 도 8을 참조하면, 본 발명의 양호한 실시예가 특정 예를 통해 설명된다. 그 현재 시스템내에 AV 컴포넌 트가 주어진 상태에서, AV 컴포넌트의 사용자는 수락가능하거나 적합한 AV 컴포넌트 접속성 구성을 달성하기 위 해, 다양한 AV 컴포넌트를 함께 접속하는데 일부 도움을 얻기를 원할 수 있다. 이러한 측면에서, 사용자는 벤더의 구성 툴 웹 사이트에 액세스한다. 이 경우에, Sonyⓡ AV 구성 툴 웹 사이트이다. 그러나, 임의의 벤터의 웹 사이트 또는 다수의 다른 벤더를 나타내는 일반적인 웹 사이트일 수 있 다. 일단 액세스된 경우, 사용자에게는 수 개의 다이얼로그 윈도우를 포함하는 그래픽 사용자 인터페이스 표시 가 프리젠팅된다. 각 다이얼로그 윈도우는 사용자가 선택할 수 있는 특정 컴포넌트 전용이다. 도 8에 도 시된 바와 같이, 제1 다이얼로그 박스는 수신기 컴포넌트 전용이다. 수신기의 다양한 모델 번호들은 사용 자에 의한 선택을 위해 리스트된다. 스크린을 가로 질러 이동하면, 제2 다이얼로그 박스는 사용자가 선택 할 수 있는 DVD 플레이어 전용이다. 마지막으로, 이러한 특정 예에서, 스크린의 우측의 최종 다이얼로그 박스는 MD 플레이어/레코더 전용이다. 상요자는 텍스트 명령에 의해 프롬프트되어 리스트로부터 컴포넌트를 선 택한 후 “구성”을 누른다. 이러한 특정 예에서, 상요자는 수신기 모델 번호 STR-DE625, DVD 플레이어 모델 번호 DVP-S550D를 선택했고, MD 에 대해서는 “none(미해당)”을 선택했다. 다시, 선택이 수행된 후, 사용자는 “구성”버튼을 클릭하도 록 프롬프트되어 이러한 사용자 선택된 AV 컴포넌트 서브세트를 벤더, 이 경우에는 소니ⓡ에 전송한다. 예를 들어, 사용자가 실수하여 잘못된 컴포넌트를 선택하거나, 어떤 이유로 인해 다른 세션을 시작하기를 원하는 경 우, 사용자는 “리셋”버튼을 클릭하여 선택을 리셋하고 다시 시작한다. 벤더(또는 벤더 컴퓨터)가 사용 자 선택된 AV 컴포넌트 서브세트를 수신한 후, 상기 설명된 것과 같은 방법을 수행하여, 사용자로부터 입력이주어진 상태에서, 적합한 AV 컴포넌트 접속성 구성을 결정한다. 도 9에 도시된 바와 같이, 밴더(또는 벤더 컴퓨터)는 그래픽 표현과 병치된 연관 배선 및/또는 케이블링 도와 함께, 사용자에 의해 선택된 컴포넌트의 그래픽 표시를 전송한다. 와이어 및 케이블은 W1, W2, W3, W4, W5, 등 과 같은 인덱스로 라벨링된다. 이와 같이, 벤더는 사용자에게 수신기, 특히 수신기 및 DVD의 텍스트 기술을 프리젠팅한다. 뿐만 아니라, 벤더는 DVD 그림 및 수신기 그림과 같은 컴포넌트의 그림을 제 공한다. 컴포넌트의 후면 패널은 2개의 AV 컴포넌트의 배선 구성을 도시할 목적으로 표시된다. 이들은 각각 도 9에서 DVD 및 수신기로서 도시되어 있다. 배선 및/또는 케이블링 도는 추가 세부사항을 위해 확대될 수 있다. 도 10에 가장 잘 도시된 바와 같이, 모든 접속성 접속은 사용자가 그 배선 셋업에 이용할 있도록 상세하게 도시되어 있다. 뿐만 아니라, 벤더는 컴포넌 트가 가지고 있거나 가지고 있지 않은 성능이 무엇인지뿐만 아니라, 이들 컴포넌트의 장점 및 단점들에 관해서 도 텍스트 명령을 제공한다."}
{"patent_id": "10-2011-7002245", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "본 발명의 범주내에서 고안될 수 있는 다수의 대안, 변동 및 변형이 있다. 예를 들면, 본 기술분야의 숙련자라 면, 본 발명이 휴대용 저장 매체, 랜, 등 또는 인터넷을 통해 구현될 수 있는 것으로 상기 기재되어 있지만, AV 컴포넌트 접속성 구성을 사용자에게 제공하는 다른 방법이 있다는 것을 잘 알고 있을 것이다. 예를 들면, 라이 브 AV 구성 툴에 액세스할 수 있는 키오스크는 제품이 판매되는 소비 매장에서 셋업될 수 있다. 뿐만 아니라, CD 및 DVD는 엔진 및 데이터베이스를 포함하도록 생성될 수 있거나, 이들은 고정된 정적 솔루션 세트 및 고정된 AV 기기 세트를 포함할 수 있다. 이들 CD 또는 DVD는 AV 기기의 구매자에게 배포될 수 있다. 기능은 라이브 데이터베이스 및 분석 엔진을 이용하고 있는 것과 동일하게 나타난다. DVD 플레이어는 통상 컴 포넌트의 원격으로 제어되는 빌트인 포인팅 디바이스를 이용하여 툴을 동작시킬 수 있다. 본 발명의 개인화 양태의 일부는 고객으로부터 직접 입력을 얻고, 고객이 찾는 것, 고객이 클릭하는 것, 및 고 객이 구매하는 것을 관찰함으로써, 인터넷 고객의 선호도를 캡쳐링하는 방법이다. 선호도가 캡쳐된 후, 추천 엔진이 이용되고, 협업 필터링 및 다른 방법이 이용되어 환경을 생성하거나 이러한 특정 사용자에게 맞는 제품 또는 서비스를 추천할 것이다. AV 구성 툴은 고객이 선택한 것이 어떤 컴포넌트인지를 조사하고, 이러한 사용 자에 관해 수집된 다른 정보와 함께, 제품에 대한 추천을 한다. 추천은 다른 컴포넌트, 더 나은 컴포넌트, 또 는 관련된 제품 또는 서비스에 대한 것일 수 있다. 상기 설명된 방법의 또 다른 대안 또는 추가로서, 사용자가 사용자 선택가능한 전자 컴포넌트의 하나로서 제공 되지 않는 전자 컴포넌트 또는 특정 모델을 선택하려고 시도하는 경우, 시스템은 사람 어시스턴트를 사용자에게 제공한다. 이러한 어시스턴트는 사용자와 이메일, 전화, 보이스-넷, 인터렉티브 웹 페이지 등을 통해 통신할 것 이다. 사용자는 실시간으로 또는 다르게, 사용자의 질문이나 관심사에 대해 응답하는 도움 데스크에 이메일을 메시징하는 능력을 가질 수도 있다. 이들 응답은 접속성 도, 컴포넌트의 선택, 컴포넌트 또는 액세서리의 제안 된 구매, 등을 포함한다. 어시스턴트는 관심사가 되는 특정 컴포넌트의 가장 가까운 허가된 딜러에게 사용자를 연결시켜 준다. 이러한 어시스턴트는 사용자와 임의의 방식으로 통신중에 있는 컴퓨터 시스템 또는 실제 사람 일 수 있다. 본 발명의 범주내에서 고려될 수 있는 다른 대안으로서, 전자 컴포넌트에 대한 일반적인 디폴트 셋업을 제공하 는 시스템 및 방법이 제공된다. 그러나, 시스템이 사용자로부터 정보를 수신하는 경우, 이러한 정보에 기초하 여, 시스템은 다른 구성을 제공한다. 단지 예로서, 사용자로부터 프롬프팅하지 않고, 시스템은 각 컴포넌트에 대해 가용한 최신 모델을 제공하고, 이들 컴포넌트가 제공된 상태에서, 가용한 최상의 구성을 제공할 것이다. 사용자가 더 새로운 특정 기기를 핸들링할 수 없는 수신기를 가지고 있다는 것을 시스템에게 통지하는 정보를 사용자가 제출한 경우, 시스템은 사용자의 시스템이 동작하도록 허용하는 구성을 제공할 것이다. 뿐만 아니라, 그러나, 사용자가 더 새로운 수신기를 구매하지 않기로 결정하는 경우, 시스템은 사운드 품질, 전력, 효과 등의 손실에 관해 사용자에게 프롬프트할 것이다. 상기 설명된 특징들의 이들 및 다른 변동 및 조합들이 이하에 제시되는 청구의 범위에 의해 정의된 바와 같이 본 발명으로부터 벗어나지 않고서도 활용될 수 있으므로, 양호한 실시예의 상기 설명은 본 발명의 제한으로보다 는 예시로서 받아들여야 할 것이다.도면 도면1a 도면1b 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10"}
{"patent_id": "10-2011-7002245", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1a는 본 발명의 양호한 실시예에 따른 표시 디바이스의 개략도이다. 도 1b는 도 1a의 양호한 실시예에 따라 이어지는 단계들의 플로우차트이다. 도 2는 본 발명의 다른 실시예에 따른 컴퓨터 시스템의 개략도이다. 도 3은 도 2에 도시된 실시예에 따라 이어지는 단계들의 플로우차트이다. 도 4는 사용자에 의해 선택가능한 전자 컴포넌트를 표시하기 위한 표시 디바이스의 사용자 인터페이스 표시 스 크린의 도시이다. 도 5는 추천된 전자 컴포넌트 접속성 구성 및 다른 정보를 표시하기 위한 표시 디바이스의 사용자 인터페이스표시 스크린의 도시이다. 도 6은 본 발명의 다른 양호한 실시예에 따른 컴퓨터 네트워크 시스템의 개략도이다. 도 7은 본 발명의 또 다른 실시예에 따른 컴퓨터 네트워크 시스템의 개략도이다. 도 8은 가용자 전자 컴포넌트 및 사용자-선택된 전자 컴포넌트 서브세트와 관련된 샘플 웹 사이트 페이지의 도 시이다. 도 9는 사용자에 의해 선택된 전자 컴포넌트의 프리젠테이션 및 접속성 구성과 관련된 샘플 웹 사이트 페이지의 도시이다. 도 10은 접속성 구성 및 명령형 텍스트와 관련된 샘플 웹 사이트 페이지의 도시이다."}
