{"patent_id": "10-2022-0143636", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0061824", "출원번호": "10-2022-0143636", "발명의 명칭": "조기경보 운영 최적화를 위한 오탐지 평가 시스템 및 방법", "출원인": "한국전력공사", "발명자": "오준석"}}
{"patent_id": "10-2022-0143636", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전력 설비에서 계측되는 다변량 입력 태그 선정에 따른 상시 전력 설비의 운전 데이터중 데이터베이스에저장되는 이력 데이터를 선별 취득하는 데이터 취득부(110);상기 이력 데이터로부터 미리 설정되는 유사도 기반으로 기계 학습을 위한 다변량 신호인 학습 데이터를 생성하는 추천부(120);상기 학습 데이터를 압축하여 재샘플링 데이터를 생성하는 압축부(140);상기 재샘플링 데이터를 미리 설계되는 조기 경보 학습 모델의 입력 데이터로 사용하여 실시간 감시를 수행하는학습부(150); 및 상기 실시간 감시를 통해 미리 정의되는 일정 조건을 만족하면 최종 경보를 생성하는 계산부(160);를 포함하는 것을 특징으로 하는 조기경보 운영 최적화를 위한 오탐지 평가 시스템."}
{"patent_id": "10-2022-0143636", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 계산부(160)는 상기 조기 경보 학습 모델을 통해 예측한 예측값과 실제값의 차인 잔차(residual)값을 감시하며, 상기 잔차값을 1차 필터링하여 최종 잔차값을 산출하고, 상기 최종 잔차값을 이용하여 상기 최종 경보를생성하는 것을 특징으로 하는 조기경보 운영 최적화를 위한 오탐지 평가 시스템."}
{"patent_id": "10-2022-0143636", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 계산부(160)는 상기 필터링된 잔차값이 미리 설정된 임곗값(threshold) 이상이 되어 알람이 발생하게되면, 미리 정의되는 강도(strength)와 연속성(continuity)의 조건에 따라 알람 등급을 평가하고, 정의된 조건이상의 알람만을 상기 최종 경보로 생성하는 것을 특징으로 하는 조기경보 운영 최적화를 위한 오탐지 평가 시스템."}
{"patent_id": "10-2022-0143636", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 강도의 조건은 미리 설정되는 임계치(threshold)를 몇 배 이상 초과하는지에 대한 평가 기준이며, 상기 연속성의 조건은 실시간으로 관측되는 데이터가 몇 회 이상을 동일한 강도 등급(동일한 임계치의 배수)을 초과하였는지를 평가하는 기준인 것을 특징으로 하는 조기경보 운영 최적화를 위한 오탐지 평가 시스템."}
{"patent_id": "10-2022-0143636", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 3 항에 있어서,상기 계산부(160)는 상기 강도의 조건 및 상기 연속성의 조건을 만족하면 알람 코드를 생성하고, 상기 알람 코드를 바탕으로 심각도 등급을 판정하는 규칙을 생성하는 것을 특징으로 하는 조기경보 운영 최적화를 위한 오탐지 평가 시스템.공개특허 10-2024-0061824-3-청구항 6 제 5 항에 있어서,상기 계산부(160)는 상기 규칙을 미리 설정되는 규칙 수정 조건에 해당되는지를 판단하여 상기 판단 결과에 따라 새로 작성 또는 수정하는 것을 특징으로 하는 조기경보 운영 최적화를 위한 오탐지 평가 시스템."}
{"patent_id": "10-2022-0143636", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 2 항에 있어서,상기 계산부(160)는 상기 학습 데이터에 대해 스케일 다운(scaling down) 또는 등간격(equidistant intervals)으로 압축하여 상기 재샘플링 데이터를 추출하는 것을 특징으로 하는 조기경보 운영 최적화를 위한 오탐지 평가 시스템."}
{"patent_id": "10-2022-0143636", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서,상기 압축은 크기순으로 재정렬되는 학습 데이터에 대해 균등한 간격을 데이터를 선택하거나 세그먼트를 여러개로 나누고 각 세그먼트의 평균값을 취하는 방식으로 이루어지는 것을 특징으로 하는 조기경보 운영 최적화를위한 오탐지 평가 시스템."}
{"patent_id": "10-2022-0143636", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "(a) 데이터 취득부(110)가 전력 설비에서 계측되는 다변량 입력 태그 선정에 따른 상시 전력 설비의 운전 데이터중 데이터베이스에 저장되는 이력 데이터를 선별 취득하는 단계;(b) 추천부(120)가 상기 이력 데이터로부터 미리 설정되는 유사도 기반으로 기계 학습을 위한 다변량 신호인 학습 데이터를 생성하는 단계;(c) 압축부(140)가 상기 학습 데이터를 압축하여 재샘플링 데이터를 생성하는 단계;(d) 학습부(150)가 상기 재샘플링 데이터를 미리 설계되는 조기 경보 학습 모델의 입력 데이터로 사용하여 실시간 감시를 수행하는 단계; 및 (e) 계산부(160)가 상기 실시간 감시를 통해 미리 정의되는 일정 조건을 만족하면 최종 경보를 생성하는 단계;를 포함하는 것을 특징으로 하는 조기경보 운영 최적화를 위한 오탐지 평가 방법."}
{"patent_id": "10-2022-0143636", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9 항에 있어서,상기 (e) 단계는,(e-1) 상기 계산부(160)가 상기 조기 경보 학습 모델을 통해 예측한 예측값과 실제값의 차인 잔차(residual)값을 감시하는 단계; 및 (e-2) 상기 계산부(160)가 상기 잔차값을 1차 필터링하여 최종 잔차값을 산출하고, 상기 최종 잔차값을 이용하여 상기 최종 경보를 생성하는 단계;를 포함하는 것을 특징으로 하는 조기경보 운영 최적화를 위한 오탐지 평가방법.공개특허 10-2024-0061824-4-청구항 11 제 10 항에 있어서,상기 (e-2) 단계는, 상기 계산부(160)가 상기 필터링된 잔차값이 미리 설정된 임곗값(threshold) 이상이 되어 알람이 발생하게되면, 미리 정의되는 강도(strength)와 연속성(continuity)의 조건에 따라 알람 등급을 평가하는 단계; 및 상기 계산부(160)가 정의된 조건 이상의 알람만을 상기 최종 경보로 생성하는 단계;를 포함하는 것을 특징으로하는 조기경보 운영 최적화를 위한 오탐지 평가 방법."}
{"patent_id": "10-2022-0143636", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11 항에 있어서,상기 강도의 조건은 미리 설정되는 임계치(threshold)를 몇 배 이상 초과하는지에 대한 평가 기준이며, 상기 연속성의 조건은 실시간으로 관측되는 데이터가 몇 회 이상을 동일한 강도 등급(동일한 임계치의 배수)을 초과하였는지를 평가하는 기준인 것을 특징으로 하는 조기경보 운영 최적화를 위한 오탐지 평가 방법."}
{"patent_id": "10-2022-0143636", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 11 항에 있어서,상기 (e) 단계는, 상기 계산부(160)가 상기 강도의 조건 및 상기 연속성의 조건을 만족하면 알람 코드를 생성하고, 상기 알람 코드를 바탕으로 심각도 등급을 판정하는 규칙을 생성하는 단계;를 포함하는 것을 특징으로 하는 조기경보 운영최적화를 위한 오탐지 평가 방법."}
{"patent_id": "10-2022-0143636", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13 항에 있어서,상기 (e) 단계는, 상기 계산부(160)가 상기 규칙을 미리 설정되는 규칙 수정 조건에 해당되는지를 판단하여 상기 판단 결과에 따라 새로 작성 또는 수정하는 단계;를 포함하는 것을 특징으로 하는 조기경보 운영 최적화를 위한 오탐지 평가방법."}
{"patent_id": "10-2022-0143636", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 9 항에 있어서,상기 (c) 단계는, 상기 계산부(160)가 상기 학습 데이터에 대해 스케일 다운(scaling down) 또는 등간격(equidistant intervals)으로 압축하여 상기 재샘플링 데이터를 추출하는 단계;를 포함하는 것을 특징으로 하는 조기경보 운영 최적화를 위한 오탐지 평가 방법."}
{"patent_id": "10-2022-0143636", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 15 항에 있어서,상기 압축은 크기순으로 재정렬되는 학습 데이터에 대해 균등한 간격을 데이터를 선택하거나 세그먼트를 여러공개특허 10-2024-0061824-5-개로 나누고 각 세그먼트의 평균값을 취하는 방식으로 이루어지는 것을 특징으로 하는 조기경보 운영 최적화를위한 오탐지 평가 방법."}
{"patent_id": "10-2022-0143636", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "신호 잡음(noise)으로 인한 이상신호에 오탐지(false alarm)가 되지 않도록 알람 필터링 기술을 도입하여 조기 경보 운영을 최적할 수 있는 시스템이 개시된다. 상기 시스템은, 미리 설정되는 다변량 입력 태그 선정에 의해 전력 설비의 운전에 따른 이력 데이터를 선별 취득하는 데이터 취득부, 상기 이력 데이터로부터 미리 설정되는 유사도 기반으로 기계 학습을 위한 다변량 신호인 학습 데이터를 생성하는 추천부, 상기 학습 데이터를 압축하여 재샘플링 데이터를 생성하는 압축부, 상기 재샘플링 데이터를 미리 설계되는 조기 경보 학습 모델의 입력 데이터 로 사용하여 실시간 감시를 수행하는 학습부, 및 상기 실시간 감시를 통해 미리 정의되는 일정 조건을 만족하면 최종 경보를 생성하는 계산부를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2022-0143636", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 플랜트의 이상 징후를 사전에 발견하기 위한 조기경보(early warning) 기술에 관한 것으로서, 더 상 세하게는 조기경보 운영 최적화를 위한 다변량 신호 압축 및 알람 평가 기술에 대한 것이다."}
{"patent_id": "10-2022-0143636", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로, 발전 또는 화학 등의 대형 플랜트들은 수백 개의 기계 및 전기 설비들이 복잡하게 연결되어 운전되 고 있다. 이런 대형 플랜트들은 안정적으로 전력 및 제품을 공급하기 위해 사고의 발단이 되는 이상 징후를 상 시로 측정해 신뢰성을 확보하여야 한다. 조기경보 기술은 신호 그룹의 정상상태 패턴을 학습한 후 신호가 학습된 정상 구간을 벗어나 이상상태로 변화해 가는 추세(trend)를 조기에 감지하는 기술이다. 조기경보(early warning) 기술에서 핵심이 되는 부분은 과거 이력 데이터를 기반으로 정상상태(normal state) 데이터 즉 과거 패턴을 정확히 추출하는 데 있다. 조기경보의 예측모델(또는 학습모델)을 생성 시 잡음(noise), 이상(abnormal) 신호, 통신 장애로 인한 계측 오 류와 같은 비정상 데이터가 포함되게 되면 예측모델의 성능이 저하되고 오탐지(false alarm)를 발생하거나 또는 정작 문제가 되는 신호에 민감하게 반응하지 않아 조기경보를 발생하지 못하게 되는 문제가 있다. 또한, 알람이 발생하더라도 모든 알람을 중요도 또는 심각한 정도에 따른 평가 없이 관리하게 될 경우 센서와 같이 빈도가 높지만 위험 영향이 낮은 계기장치에 대한 알람으로 인해 정작 중대한 설비(보일러, 터빈, 보조기 기) 결함에 대한 알람을 놓칠 수 있다. 현재, 학습모델 예측성능 향상 및 오탐 방지를 위한 다변량 신호 기반 학습 데이터 압축 기술이 없다. 또한, 조 기경보 알람(alarm)에 대한 평가기준이 없다. 부연하면, 기존의 조기경보 제품은 알람에 대한 중요도 평가 없이 다수의 알람(alarm)이 발생하고 있어 알람 (alarm) 관리에 많은 시간이 소요된다. 또한, 발생되는 대다수의 알람은 설비의 이상보다는 계측기 오류로 인한 경우가 많아 중요도에 대한 평가없이 발생되는 알람은 오히려 사용자의 업무에 부담을 가중하게 된다. 이와 더불어 학습 데이터의 크기는 조기 경보 시스템의 연산에 가장 큰 영향을 미치는 부분으로 학습모델 수량 이 많아질수록 s/W(Software)의 부담이 높아지고 프로세스 속도가 느려져 사용자가 불편을 호소하거나 결국 외 면을 받게 되는 경우가 많다. 선행기술문헌 특허문헌 (특허문헌 0001) 1. 대한민국 공개특허번호 제10-2021-0109206호"}
{"patent_id": "10-2022-0143636", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 위 배경기술에 따른 문제점을 해소하기 위해 제안된 것으로서, 신호 잡음(noise)으로 인한 이상신호 에 오탐지(false alarm)가 되지 않도록 알람 필터링 기술을 도입하여 조기 경보 운영을 최적할 수 있는 시스템 및 방법을 제공하는데 그 목적이 있다. 또한, 본 발명은 설비의 상태가 변화되는 신호의 변동성(정비 전·후, 계절 변화 등)으로 인한 오탐지를 방지하 기 위해 변동성 패턴을 학습 데이터에 포함할 수 있도록 하는 시스템 및 방법을 제공하는데 다른 목적이 있다.또한, 본 발명은 조기경보에서 발생하는 다양한 조건의 알람(alarm)에 대해서도 강도(strength)와 연속성 (continuity)에 따른 평가 기준을 적용하여 발생된 알람(alarm)에 대해 심각한 수준을 평가후 우선순위가 높은 알람을 쉽게 판별하고 관리할 수 있는 시스템 및 방법을 제공하는데 또 다른 목적이 있다."}
{"patent_id": "10-2022-0143636", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명은 위에서 제시된 과제를 달성하기 위해, 신호 잡음(noise)으로 인한 이상신호에 오탐지(false alarm)가 되지 않도록 알람 필터링 기술을 도입하여 조기 경보 운영을 최적할 수 있는 시스템을 제공한다. 상기 시스템은, 전력 설비에서 계측되는 다변량 입력 태그 선정에 따른 상시 전력 설비의 운전 데이터중 데이터베이스에 저장 되는 이력 데이터를 선별 취득하는 데이터 취득부; 상기 이력 데이터로부터 미리 설정되는 유사도 기반으로 기계 학습을 위한 다변량 신호인 학습 데이터를 생성하 는 추천부; 상기 학습 데이터를 압축하여 재샘플링 데이터를 생성하는 압축부; 상기 재샘플링 데이터를 미리 설계되는 조기 경보 학습 모델의 입력 데이터로 사용하여 실시간 감시를 수행하는 학습부; 및 상기 실시간 감시를 통해 미리 정의되는 일정 조건을 만족하면 최종 경보를 생성하는 계산부;를 포함하는 것을 특징으로 한다. 이때, 상기 계산부는 상기 조기 경보 학습 모델을 통해 예측한 예측값과 실제값의 차인 잔차(residual)값을 감 시하며, 상기 잔차값을 1차 필터링하여 최종 잔차값을 산출하고, 상기 최종 잔차값을 이용하여 상기 최종 경보 를 생성하는 것을 특징으로 한다. 또한, 상기 계산부는 상기 필터링된 잔차값이 미리 설정된 임계값(threshold) 이상이 되어 알람이 발생하게 되 면, 미리 정의되는 강도(strength)와 연속성(continuity)의 조건에 따라 알람 등급을 평가하고, 정의된 조건 이 상의 알람만을 상기 최종 경보로 생성하는 것을 특징으로 한다. 또한, 상기 강도의 조건은 미리 설정되는 임계치(threshold)를 몇 배 이상 초과하는지에 대한 평가 기준이며, 상기 연속성의 조건은 실시간으로 관측되는 데이터가 몇 회 이상을 동일한 강도 등급(동일한 임계치의 배수)을 초과하였는지를 평가하는 기준인 것을 특징으로 한다. 또한, 상기 계산부는 상기 강도의 조건 및 상기 연속성의 조건을 만족하면 알람 코드를 생성하고, 상기 알람 코 드를 바탕으로 심각도 등급을 판정하는 규칙을 생성하는 것을 특징으로 한다. 또한, 상기 계산부는 상기 규칙을 미리 설정되는 규칙 수정 조건에 해당되는지를 판단하여 상기 판단 결과에 따 라 새로 작성 또는 수정하는 것을 특징으로 한다. 또한, 상기 계산부는 상기 학습 데이터에 대해 스케일 다운(scaling down) 또는 등간격(equidistant intervals)으로 압축하여 상기 재샘플링 데이터를 추출하는 것을 특징으로 한다. 또한, 상기 압축은 크기순으로 재정렬되는 학습 데이터에 대해 균등한 간격을 데이터를 선택하거나 세그먼트를 여러 개로 나누고 각 세그먼트의 평균값을 취하는 방식으로 이루어지는 것을 특징으로 한다. 다른 한편으로, 본 발명의 다른 일실시예는, (a) 데이터 취득부가 전력 설비에서 계측되는 다변량 입력 태그 선 정에 따른 상시 전력 설비의 운전 데이터중 데이터베이스에 저장되는 이력 데이터를 선별 취득하는 단계; (b) 추천부가 상기 이력 데이터로부터 미리 설정되는 유사도 기반으로 기계 학습을 위한 다변량 신호인 학습 데이터 를 생성하는 단계; (c) 압축부가 상기 학습 데이터를 압축하여 재샘플링 데이터를 생성하는 단계; (d) 학습부가 상기 재샘플링 데이터를 미리 설계되는 조기 경보 학습 모델의 입력 데이터로 사용하여 실시간 감시를 수행하는 단계; 및 (e) 계산부가 상기 실시간 감시를 통해 미리 정의되는 일정 조건을 만족하면 최종 경보를 생성하는 단 계;를 포함하는 것을 특징으로 하는 조기경보 운영 최적화를 위한 오탐지 평가 방법을 제공한다. 또한, 상기 (e) 단계는, (e-1) 상기 계산부가 상기 조기 경보 학습 모델을 통해 예측한 예측값과 실제값의 차인 잔차(residual)값을 감시하는 단계; 및 (e-2) 상기 계산부가 상기 잔차값을 1차 필터링하여 최종 잔차값을 산출 하고, 상기 최종 잔차값을 이용하여 상기 최종 경보를 생성하는 단계;를 포함하는 것을 특징으로 한다.또한, 상기 (e-2) 단계는, 상기 계산부가 상기 필터링된 잔차값이 미리 설정된 임계값(threshold) 이상이 되어 알람이 발생하게 되면, 미리 정의되는 강도(strength)와 연속성(continuity)의 조건에 따라 알람 등급을 평가하 는 단계; 및 상기 계산부가 정의된 조건 이상의 알람만을 상기 최종 경보로 생성하는 단계;를 포함하는 것을 특 징으로 한다. 또한, 상기 (e) 단계는, 상기 계산부가 상기 강도의 조건 및 상기 연속성의 조건을 만족하면 알람 코드를 생성 하고, 상기 알람 코드를 바탕으로 심각도 등급을 판정하는 규칙을 생성하는 단계;를 포함하는 것을 특징으로 한 다. 또한, 상기 (e) 단계는, 상기 계산부가 상기 규칙을 미리 설정되는 규칙 수정 조건에 해당되는지를 판단하여 상 기 판단 결과에 따라 새로 작성 또는 수정하는 단계;를 포함하는 것을 특징으로 한다. 또한, 상기 (c) 단계는, 상기 계산부가 상기 학습 데이터에 대해 스케일 다운(scaling down) 또는 등간격 (equidistant intervals)으로 압축하여 상기 재샘플링 데이터를 추출하는 단계;를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2022-0143636", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 효과에 따르면, 조기경보(early warning) 기술에서 예측 성능에 가장 핵심이 되는 학습 데이터의 정 상상태(normal)의 데이터의 크기를 축소하여 가장 빈번하게 발생하는 연산과정(예측값 산출)의 속도를 향상하는 효과가 있다. 또한, 본 발명의 다른 효과로서는 압축 데이터를 기반으로 구축된 학습모델을 통해 실측값과 예측값의 잔차 (residual)를 감시하게 되며 이때 설정된 임계치(threshold)를 초과한 신호에 대해 smoothing 기법을 적용함으 로써 알람을 방지하는 1차 필터링을 수행하고, 이를 통해 센서 계측 시 발생하는 오류나 설비 운전 중에 발생하 는 spike와 같이 순간적으로 발생하는 이상 신호로 인해 발생되는 오탐지를 방지할 수 있다는 점을 들 수 있다. 또한, 본 발명의 또 다른 효과로서는 1차 필터 된 잔차 신호는 강도와 연속성의 개념을 도입하여 발생한 알람에 대해 재평가를 수행하며, 임계치의 배수(강도)를 연속적으로 발생하는 빈도(연속성)를 관측하여 이를 알람 코드 (alarm code) 및 시각(색상) 정보로 변화해서 사용자에 전달하고, 전달되는 알람 코드와 색상을 통해 사용자는 어떤 알람을 지속적으로 감시 또는 조치해야 하는지 쉽게 판단하는데 도움을 주게 된다는 점을 들 수 있다. 또한, 본 발명의 또 다른 효과서는 앞서 전달된 알람 코드는 사용자가 해당 설비의 이상 감지를 위해 별로 규칙 을 설정할 수 있으며, 신호의 연관관계를 이용하여 심각도(severity)를 등급으로 구분할 수 있으며, 이렇게 개 발된 규칙들은 조기경보에서 다수의 알람이 발생하더라도 모든 알람을 감시할 필요 없이 규칙을 만족한 경우에 만 심각도에 따른 알람을 발생하므로 감시 업무의 효율을 극대화할 수 있는 효과적인 방법이라는 점을 들 수 있 다."}
{"patent_id": "10-2022-0143636", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변경을 가할 수 있고 여러 가지 실시예를 가질 수 있는바, 특정 실시예들을 도면에 예시하고 상세한 설명에 구체적으로 설명하고자 한다. 그러나 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어 야 한다. 각 도면을 설명하면서 유사한 참조부호를 유사한 구성요소에 대해 사용한다. 제 1, 제 2등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소들은 상기 용어들에 의해 한정되어서는 안 된다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용 된다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제 1 구성요소는 제 2 구성요소로 명명될 수 있고, 유사 하게 제 2 구성요소도 제 1 구성요소로 명명될 수 있다. \"및/또는\" 이라는 용어는 복수의 관련된 기재된 항목들 의 조합 또는 복수의 관련된 기재된 항목들 중의 어느 항목을 포함한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미가 있다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의 미를 가지는 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적 인 의미로 해석되지 않아야 한다. 이하 첨부된 도면을 참조하여, 본 발명의 일실시예에 따른 조기경보 운영 최적화를 위한 오탐지 평가 시스템 및 방법을 상세하게 설명하기로 한다. 조기경보 기술은 신호 그룹의 정상상태 패턴을 학습한 후 신호가 학습된 정상구간을 벗어나 이상상태로 변화해 가는 추세(trend)를 조기에 감지하는 기술이다. 도 1은 본 발명의 일실시예에 따른 조기경보 운영 최적화를 위한 오탐지 평가 시스템의 구성 블럭도이다. 도 1을 참조하면, 오탐지 평가 시스템은, 데이터 취득부, 추천부, 데이터 저장소, 압축부 , 학습부, 계산부, 표시부 등을 포함하여 구성될 수 있다. 데이터 취득부는 전력 설비의 운전 데이터 및 이 운전 데이터를 이용한 이력 데이터를 취득하는 기능을 수 행한다. 또한, 데이터 취득부는 다변량 입력 태그 선정에 의해 입력된 이력 데이터를 선택하는 기능을 수 행한다. 데이터 취득부는 전력 설비의 현장에 설치되는 센서, 계측기 등을 통해 생성된 데이터를 취득한다. 물론, 데이터 취득부는 통신망(미도시)을 통해 센서, 계측기들과 연결되어 데이터를 취득할 수도 있고, 직접 센 서들과 연결될 수 있다. 이를 위해, 데이터 취득부는 통신 모뎀, 메모리 등을 포함하여 구성될 수 있다. 통신망은 복수의 단말 및 서버들과 같은 각각의 노드 상호 간에 정보 교환이 가능한 연결 구조를 의미하는 것으 로, 공중교환 전화망(PSTN), 공중교환 데이터망(PSDN), 종합정보통신망(ISDN: Integrated Services Digital Networks), 광대역 종합 정보 통신망(BISDN: Broadband ISDN), 근거리 통신망(LAN: Local Area Network), 대도 시 지역망(MAN: Metropolitan Area Network), 광역 통신망(WLAN: Wide LAN) 등이 될 수 있다. 그러나, 본 발명은 이에 한정되지는 않으며, 무선 통신망인 CDMA(Code Division Multiple Access), WCDMA(Wideband Code Division Multiple Access), Wibro(Wireless Broadband), WiFi(Wireless Fidelity),HSDPA(High Speed Downlink Packet Access) 망, 블루투쓰(bluetooth), NFC(Near Field Communication) 네트워 크, 위성 방송 네트워크, 아날로그 방송 네트워크, DMB(Digital Multimedia Broadcasting) 네트워크 등이 될 수 있다. 또는, 이들 유선 통신망 및 무선 통신망의 조합일 수 있다. 발전설비는 전력을 생산하는 발전기, 발전된 전력을 공급하기 위한 전선로, 발전기를 제어하는 제어 장치, 전기 기계/기구 중 주 차단기의 2차측 단자까지의 설비등이 된다. 물론, 발전설비에는 각종 센서, 계측기 등이 설치 되어 운전 데이터를 생성한다. 추천부는 이력 데이터로부터 유사도 기반으로 학습 데이터를 추천하는 기능을 수행한다. 부연하면, 데이터 취득부 및/또는 데이터 저장소로부터 이력 데이터를 획득하여 유사도 기반에 따라 학습을 위한 학습 데이터를 생성하는 기능을 수행한다. 데이터 저장소는 데이터 취득부를 통해 획득된, 운전 데이터, 이력 데이터, 추전부를 통해 생성 되는 학습 데이터 등을 저장하는 기능을 수행한다. 이를 위해 데이터 저장소는 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), 멀티미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어 SD(Secure Digital) 또는 XD(eXtreme Digital) 메모리 등), 램(Random Access Memory, RAM), SRAM(Static Random Access Memory), 롬(Read Only Memory, ROM), EEPROM(Electrically Erasable Programmable Read Only Memory), PROM(Programmable Read Only Memory), 자기 메모리, 자기 디스크, 광디스크 중 적어도 하나의 타입의 저장매체를 포함할 수 있다. 또한, 인터넷(internet)상에서 저장 기능을 수행하는 웹 스토리지(web storage), 클라우드 서버와 관련되어 동 작할 수도 있다. 압축부는 다변량 입력 태그에 따라 다변량 신호인 학습 데이터를 압축하여 재샘플링 데이터를 생성하는 기 능을 수행한다. 학습부는 재샘플링 데이터를 조기 경보 학습 모델의 입력 데이터로 사용하여 실시간 감시를 수행하는 기능 을 수행한다. 부연하면, 조기 경보 학습 모델을 통해 예측한 예측값과 실제값의 차인 잔차(residual)값을 감시 하는 기능을 수행한다. 조기 경보 학습모델에 대해 설명하면 다음과 같다. AAKR은 정상상태를 나타내는 과거 데이터(≒훈련 데이터 혹 은 메모리 벡터)와 측정 데이터(≒시험 데이터)와의 비교를 통해 시스템의 상태를 예측한다. 훈련 데이터를 로 정의하였을 때, 는 센서의 번째 데이터를 나타낸다. 의 형태는 식 과 같다. 수학식 1"}
{"patent_id": "10-2022-0143636", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이와 비슷하게, 시험 데이터는 식 와 같이 표현할 수 있다. 수학식 2"}
{"patent_id": "10-2022-0143636", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "AAKR의 수학적 모델링 방법은 3가지 단계로 구성되어 있다. 첫 번째는 훈련 데이터와 시험 데이터의 거리를 계 산하는 것이다. 거리를 정의하는 함수에는 여러 가지가 있으나, 본 알고리즘에서는 보편적으로 사용되는 유클리 드 거리 (Euclidean Distance)를 사용하였다. 번째의 훈련 데이터(X)와 시험 데이터(x)의 거리는 식 과 같 은 공식으로 정의된다.수학식 3"}
{"patent_id": "10-2022-0143636", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "훈련 데이터와 시험 데이터의 거리들을 계산한 거리행렬(d)은 식 와 같이 정의된다. 수학식 4"}
{"patent_id": "10-2022-0143636", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "다음으로 거리 행렬들의 크기에 기반하여 시스템에 어느 정도의 영향을 미치는지 가중치를 판단하기 위해 가우시안 커널 함수를 적용하는데 그 형태는 식 와 같다. 수학식 5"}
{"patent_id": "10-2022-0143636", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "여기에서, 는 커널의 폭이고, 는 가중치 벡터이다. 계산부는 잔차값을 필터링하여 필터링된 잔차값을 이용하여 최종 경보를 발생하는 기능을 수행한다. 부연 하면, 잔차값(즉 신호(tag))에 대해 스무딩(smoothing) 기법을 적용하여 발생된 알람을 1차 필터링한다. 1차 필 터링된 잔차가 설정된 임곗값(threshold) 이상이 되어 알람이 발생하게 되면, 정의된 강도(strength)와 연속성 (continuity)의 조건에 따라 알람 등급을 평가한 후, 정의된 조건 이상의 알람만을 최종 경보로 발생시킨다. 출력부는 최종 경보를 출력하는 기능을 수행한다. 최종 경보는 음성, 그래픽, 및 문자의 조합이 될 수 있 다. 이를 위해, 출력부는 디스플레이, 사운드 시스템 등을 포함하여 구성될 수 있다. 디스플레이는 LCD(Liquid Crystal Display), LED(Light Emitting Diode) 디스플레이, PDP(Plasma Display Panel), OLED(Organic LED) 디스플레이, 터치 스크린, CRT(Cathode Ray Tube), 플렉시블 디스플레이, 마이크로 LED, 미 니 LED 등이 될 수 있다. 터치 스크린은 출력 수단뿐만 아니라 입력 수단으로도 사용될 수 있다. 도 2는 도 1에 도시된 계산부의 세부 구성 블럭도이다. 도 2를 참조하면, 계산부는, 조기 경보 학습 모델을 통해 예측한 예측값과 실제값의 차인 잔차(residual)값을 감시하는 감시 모듈, 스무딩 기법(즉, 스 무딩 알고리즘)을 적용하여 발생된 잔차를 1차 필터링하고, 필터링된 잔차에 대해 강도 및 연속성의 조건에 따 라 알람 등급을 평하는 평가 모듈, 알람 등급에 따라 알람 및 심각도 정보를 결정하고 알람을 제공하는 제 공 모듈, 알람 조건(즉, 알람 규칙)을 수정하는 수정 모듈 등을 포함하여 구성될 수 있다. 스무딩 기법(즉, 스무딩 알고리즘)은 데이터내의 중요한 패턴을 찾기 위해 노이즈나 미세한 구조를 제거함으로 써 근사치를 만드는 것을 말한다. 스무딩에는 여러가지 많은 알고리즘이 이용된다. 가장 많이 이용되는 알고리 즘은 \"이동 평균\"이며, 이는 반복된 통계조사로부터 중요한 경항을 찾는데 이용된다. 강도는 실제값이 얼마나 높이 올라가는가(또는 내려가는가) 하는 정도로 기울기 클수록 강도가 높아진다. 연속 성은 같은 강도에서 얼마나 오래 지속되는지를 알려주는 지표이다. 같은 강도를 유지하고 있을 때 연속성(C)은 높아진다. 일를 보여주는 도면이 도 14이며, 이에 대해서는 후술하기로 한다. 도 2에 도시된 \"~ 모듈\"은 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 소프트웨어 및/또는 하드웨어로 구현될 수 있다. 하드웨어 구현에 있어, 상술한 기능을 수행하기 위해 디자인된 ASIC(application specific integrated circuit), DSP(digital signal processing), PLD(programmable logic device), FPGA(field programmable gate array), 프로세서, 마이크로프로세서, 다른 전자 유닛 또는 이들의 조합으로 구 현될 수 있다. 소프트웨어 구현에 있어, 소프트웨어 구성 컴포넌트(요소), 객체 지향 소프트웨어 구성 컴포넌트, 클래스 구성 컴포넌트 및 작업 구성 컴포넌트, 프로세스, 기능, 속성, 절차, 서브 루틴, 프로그램 코드의 세그먼트, 드라이 버, 펌웨어, 마이크로 코드, 데이터, 데이터베이스, 데이터 구조, 테이블, 배열 및 변수를 포함할 수 있다. 소 프트웨어, 데이터 등은 메모리에 저장될 수 있고, 프로세서에 의해 실행된다. 메모리나 프로세서는 당업자에게 잘 알려진 다양한 수단을 채용할 수 있다. 도 3은 본 발명의 일실시예에 따른 조기경보 운영을 최적화하는 과정을 보여주는 흐름도이다. 도 3을 참조하면, 데이터 취득부가 다변량 입력 태그를 선정한 후, 전력 설비의 정비 전·후, 기동·정지, 계절 변화, 운전 조건 변경 등 신호 변동성을 고려한 이력 데이터에 대한 기간을 조회하여 데이터를 입력한다(단계 S310,S320). 다변량 입력 태그는 온도, 압력, 유량, 차압, 음향레벨, 진동, 전류, 전압 등 전력 설비에서 계측되는 모든 신 호를 의미하며, 신호의 스케일이 모두 다른 데이터 입력 태그로 사용할 수 있다. 이력 데이터는 전력 설비의 운 전 데이터 중 RTDB(Real Time Database)에 저장되는 모든 과거 데이터를 의미한다. 기간을 조회한다는 것은 과 거 데이터 중에 학습에 사용할 특정한 구간의 데이터를 불러 온다는 의미이다. 이때 불러오는 데이터는 다변량 입력 태그에 대해 동일한 시간을 가진 데이터 구간을 불러온다. 이후, 추천부가 다변량 신호인 선별된 이력 데이터에 대해 유사도 기반 학습 데이터를 추천한다(단계 S330). 압축부가 추천된 학습 데이터에 대해 스케일 다운(scaling down) 또는 등간격(equidistant intervals)으 로 압축하여 재샘플링된 재샘플링 데이터를 추출한다(단계 S340,S351,S352). 이후, 학습부가 이 샘플링 데이터를 조기 경보 학습모델의 입력 데이터로 사용하여 실시간 감시를 수행한 다(단계 S360). 도 4는 도 3에 도시된 조기 경보 알고리즘 학습 단계 이후 규칙을 수정하는 과정을 보여주는 흐름도이다. 도 4 를 참조하면, 학습부가 조기 경보 학습 모델을 통해 예측한 예측값과 실제값의 차인 잔차(residual)값을 감시하며, 상기 잔차값을 스무딩 기법을 적용하고, 1차 필터링을 수행하여 필링된 최종 잔차값을 생성한다(단계 S410,S420). 1차 필터링이 잔차에 대해 스무딩 기법을 적용하는 것으로 순간적으로 크기가 올라갔거나 외부 충격신호 등으로 외란이 발생했을 경우 신호가 왜곡되는 것을 방지하여 추세(trend) 변화에 미치는 영향을 낮출 수 있다. 스무딩 을 통해 불필요하게 발생하는 알람을 1차적으로 걸러주는 기능을 한다. 이후, 강도 및 연속성 기반으로 최종 잔차값에 해당하는 알람을 평가한다(단계 S430). 이후, 알람 및 심각도(severity)를 평가하여 정보를 제공하여 알람 조치를 실행한다(단계 S440,S450). 이후, 규칙 수정 조건에 해당하는 지를 판단한다(단계 S460). 부연하면, 도 15와 같이 규칙이 수정되는 조건은 기존의 규칙 조건에 따라 알람을 평가를 하고 이때 상관성 분석을 통해 유사도가 높은 신호가 명확히 규명되면 (다수의 사례를 통해 반복적으로 발견) 유사도가 높은 신호를 규칙 조건에 추가할 수 있다. 또는 다수의 사례를 통해 발견된 설비결함이 크게 문제가 되지 않거나 높은 수준으로 문제가 있다고 판단되면 심각도의 레벨을 높이거나 낮추어 알람의 평가등급을 조정할 수 있다. 단계 S460에서, 규칙 수정 조건에 해당하지 않으면 단계 S410 내지 단계 S460이 다시 진행된다. 이와 달리, 단계 S460에서, 규칙 수정 조건에 해당하면 규칙 작성 또는 수정을 수행한다(단계 S470). 이후, 단 계 S410 내지 단계 S460이 다시 진행된다. 도 5는 스케일링 다운 예시를 보여주는 그래프이다. 도 5를 참조하면, 도 5를 참조하면, 조기경보에서 학습 데 이터는 학습모델의 예측 성능을 좌우하는 매우 중요한 요소이다. 학습 모델을 생성하기 위해 입력되는 학습 데 이터(또는 메모리 벡터)는 정상 운전 상태의 신호 패턴을 갖는 과거 이력으로부터 추출된 데이터를 의미한다. 발전소와 같이 다수의 설비로 구성된 복잡한 공정(process)을 가진 경우 다양한 변수와 잡음(noise)이 신호 곳 곳에 섞여 있으므로 신호 전처리를 통해 이상신호를 잘 걸러내야 한다. 뿐만 아니라 다수의 전력 설비를 동시에 감시해야 하므로 시스템이 저장하고 있어야 하는 학습 데이터의 크기(size)를 최소한으로 축소할수록 안정적이 고 장기적인 운영이 가능하다. 또한, 사계절이 뚜렷한 국내의 경우에는 계절적 영향으로 인해 외기 조건 및 출력(부하) 조건이 달라지므로 설 비의 운전상 상태도 이에 따라 변화하는 패턴을 가지고 있다. 이러한 패턴 즉 신호의 추세(trend) 변화를 잘 반영할 수 있도록 학습 데이터를 추출하는 것이 매우 중요하다. 이에 따라 본 발명의 일실시예에서는 다변량의 복잡한 원신호로부터 추세의 변화를 보존하면서 근접한 유 사 데이터의 크기를 축소(scaling down) 또는 등간격(equidistant intervals)으로 신호를 재샘플링하여 학습 데이터를 압축 저장한다. 도 6은 본 발명의 일실시예에 따른 원신호에 대한 크기 재정렬을 보여주는 그래프이다. 도 6을 참조하면, 우선 원 데이터를 크기 순으로 재정렬한다. 재정렬된 데이터는 인접한 데이터가 많을수록 밀도가 높고 인접한 데이터 가 적을수록 밀도가 낮게 분포하게 된다. 데이터의 전체적인 추세는 그래프의 곡선으로 표현되며 그래프의 곡선을 보존하게 되면 추세에 대한 정보를 잃 지 않게 된다. 재정렬된 데이터에 대해 균등한 간격으로 데이터를 선택하거나 세그먼트를 여러 개로 나누고 각 세그먼트의 평균값을 취해 원 데이터를 압축하는 방식이다. 도 7은 본 발명의 일실시예에 따른 원신호와 압축된 신호 비교를 보여주는 그래프이다. 도 7을 참조하면, 원 벡 터 신호와 압축된 벡터 신호가 도시되며, 압축된 벡터 신호가 변동폭이 적음을 볼 수 있다. 도 8은 일반적인 스무딩(smoothing)을 통한 오알람(false) 필터링의 개념도이다. 도 8을 참조하면, 본 발명의 일실시예에서 사용된 스무딩(smoothing) 기법은 잔차(residual)에 대해 특정 크기 데이터 간격을 연속적으로 이 동하면서 산출한 평균값을 이용하였다. 특정 크기의 간격을 이동하여 산출한 평균값은 평균값의 흐름 즉 추세 (trend)를 알 수 있다. 또한, 전체적인 패턴에서 벗어나는 관측값인 이상치(outlier)에 대해 주변 데이터와의 부분 평균을 산출함으로 써 센서의 계측 오류와 같은 오알람(false alarm)의 영향을 낮출 수 있다. 도 8에 도시된 바와 같이, 상하로 변동하는 헌팅(hunting)과 같은 신호 에 대해 본 스무딩(smoothing) 기법을 적용시, 낮게 평가함으로써 잘못된 신호 분석에 따른 오알람을 사전 에 방지할 수 있다. 도 9는 본 발명의 일실시예에 따른 강도와 연속성 기반 평가를 보여주는 개념도이다. 앞서 스케일 다운(scaling down)된 학습 데이터틀 이용하여 학습모델을 구축한 뒤 실시간으로 입력되는 새로운 데이터(실측값)에 대해 조 기경보 알고리즘은 예측값을 산출한다. 산출한 예측값과 실측값의 차인 잔차값을 매 관측값에 대해 출력한다. 출력된 잔차는 오탐지를 방지하기 위해 스무딩(smoothing)을 통해 1차 필터 과정을 거친다. 이후, 도 9에 도시된 바와 같이, 강도(strength)와 연속성(continuity)을 기준으로 다시 한번 재평가받게 된다. 강도의 조건은 미리 설정되는 임계치(threshold)를 몇 배 이상 초과하는지에 대한 평가 기준이며, 연속성의 조 건은 실시간으로 관측되는 데이터가 몇 회 이상을 동일한 강도 등급(동일한 임계치의 배수)을 초과하였는지를 평가하는 기준이다. 강도와 연속성에 대한 평가 결과를 코드(code)로 변환하여 알람(alarm)으로 최종 표기한다. 임계치는 양의 방향(positive)과 음의 방향(negative)으로 구분되며 양의 방향은 (실측값-예측값)의 값이 우상 향인 잔차에 대해 임계치를 의미한다. 음의 방향은 (실측값-예측값)의 값이 우하향인 잔차의 임계치를 의미한다. 강도와 연속성은 사용자가 code를 해석하지 않고도 시각정보로 구분이 가능하도록 색상으로 단계와 횟수에 따라 등급을 구분한다. 각각의 등급은 5단계(S1,S2,S3,S4,S5)로 나타내며 강도가 높아질수록 색상은 빨간색으로 짙어 지며, 연속성이 높을수록 색상이 파란색으로 짙어진다. 이 결과는 알람(alarm)을 발생할 때 감시 챠트(chart) 상에서 색상으로 표시된다. 상기의 기술을 바탕으로 예를 들면 양의 방향으로 임계치 초과, 강도 3등급(임계치의 3배), 관측 횟수 4회 시 발생한 알람의 코드는‘HS3C4’가 된다. 상기와 같이 개발된 알람 코드는 설비 결함(failure)에 대한 이상을 감지하기 위한 규칙(rule)을 개발하는 데 있어 기준으로 활용할 수 있다. 예를 들어 ‘A’라고 하는 학습모델 내의 신호(tag) 간의 연관성을 고려하여 ‘ A’ 학습모델의 ‘AAAA’ 태그와 ‘BBBB’ 태그의 잔차값이 ‘HS3C4’가 되었을 때 이를 심각도(severity)를 1 등급으로 평가하여 알람(alarm) 이벤트에는 ‘severity class 1‘ 로 표기하여 실제 알람의 우선순위에 대한 정 보를 함께 제공한다. 따라서, 사용자(설비 운영)에게 신속하고 정확한 의사결정에 도움을 주게 된다. 도 10은 본 발명의 일실시예에 따른 다변량 신호 압축 실시예를 보여주는 그래프이다. 도 10을 참조하면, 3가지 사례(1011,1012,1021,1022,1031,1032)를 통해 상기에서 기술한 발명의 원리에 대한 실시예를 나타내었다. 사용 된 신호는 실제 발전소 운전 데이터를 추출하여 사용하였으며, 사례별로 앞서 기술한 스케일 다운(scaling down)으로 재샘플링하여 학습 데이터를 압축한 후 원신호와 비교하였다. 부연하면, 재정렬된 데이터에 대해 균등한 간격으로 데이터를 선택(그래프 좌)하거나 세그먼트를 여러 개로 나 누고 각 세그먼트의 평균값(그래프 우)을 취해 원 데이터를 압축한다."}
{"patent_id": "10-2022-0143636", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 7, "content": "도 11은 본 발명의 일실시예에 따른 잔차 스무딩을 통한 알람 필터링 실시예 1이다. 도 11을 참조하면, 실시예1 의 경우, 원 잔차(origin residual)는 5곳에서 알람이 발생한 사례이다. 이 사례에 대해 스무딩(smoothing) 기 법을 적용시, 알람 발생지점의 이전 데이터를 이용하여 산술 평균값을 적용함으로써 알람이 발생하지 않는 것을 확인할 수 있다. AAKR은 Auto-Associative Kernel Regression의 약어이다. 도 12는 본 발명의 일실시예에 따른 잔차 스무딩을 통한 알람 필터링 실시예 2이다. 도 12를 참조하면, 실시예2 의 경우도 원 잔차(origin residual)에서는 예측값과 실제값이 큰 차이가 발생하여 오알람이 3곳에서 나타났으 나, 스무딩(smoothing) 기법을 적용하여 알람이 발생하지 않는 것을 확인할 수 있다. 도 13은 본 발명의 일실시예에 따른 잔차 스무딩을 통한 알람 필터링 실시예 3이다. 도 13을 참조하면, 실시예3 의 경우, 원 잔차(origin residual)에서 실제 설비 기동(startup)으로 인해 예측값과 실제값이 큰 차이가 발생 한 것을 알 수 있다. 이 때문에 원 잔차에서도 이상 알람(alarm), 즉 유효한 알람이 발생하였으며, 동일하게 smoothing 기법을 사용한 잔차 신호에서 발생 이전 시점부터 잔차가 높아지고 있어 실제로 해당 시점에 이상 알 람인 유효 알람을 발생하는 것을 알 수 있다. 도 14는 본 발명의 일실시예에 따른 강도 및 연속성 기반 평가를 통한 알람 발생을 보여주는 그래프이다. 도 14 를 참조하면, 최초 알람 발생 이후 설비의 열화로 인해 잔차값이 점차 상승하는 추세에 있다. 부여 하면, 잔차값은 실제값에서 조기 경보 학습 모델에서 예측되는 예측값을 뺀값이다. 잔차값이 상승(양의 방향)하면 10분 간격으로 (강도1, 연속1회), (강도1, 연 속2), (강도1, 연속3)의 알람을 발생시킨 후 40분째 (강도2, 연속1)로 새로운 알람을 발생시킨다. 이후에 도 잔차값은 지속적으로 상승하고 있으므로 높은 강도와 연속성에 대한 평가를 받아 이를 알람 코드(code)로 변 환한다. 상기에서 발생한 여러 알람 코드(code)를 바탕으로 신호(태그)간의 고장 메커니즘을 바탕으로 규칙(rule)을 개 발할 수 있다. 이를 보여주는 프로그램 코드가 도 15에 도시된다. 도 15는 본 발명의 일실시예에 따른 심각도(severity) 등급 판정 규칙를 생성하는 프로그램 코드이다. 도 15를 참조하면, 이렇게 개발된 규칙은 등급을 나누어 심각도(severity)로 표현된다. 표현된 심각도는 알람&이벤트 로 그에서 표시되어 사용자가 이벤트 정보만으로도 설비명, 알람 위치, 알람의 중요도를 파악하는데 중요한 정보로 활용된다. 도 15는 프로그램 코드의 한예로서 베어링 이슈가 발생하고, 초과 변동이 금속 온도(metal temperature) 및 윤 활유(lubrication oil)로 발생하는 경우, 심각도를 클래스1(class1), 클래스2(class2)의 등급으로 정의하는 예 이다. 도 16은 본 발명의 일실시예에 따른 해외 발전소 대상 원격 감시를 보여주는 화면예이다. 도 16을 참조하면, 학 습 데이터의 크기를 효율적으로 축소시켜 조기 경보 시스템의 연산속도를 대폭 향상함으로써 기존 기술의 문제 점에 대해 새로운 방안을 제안하고 있다. 도 17은 본 발명의 일실시예에 따른 민간 발전사 설치 운영을 보여주는 그래프이다. 도 17을 참조하면, 조기경 보 기술은 지능형 디지털 발전분야와 관련하여 최근 각광받고 있는 인공지능 및 빅 데이터에 기반한 기술로써 최신의 선도기술을 적용하였으며, 본 기술은 ‘TRL: 시제품 인증 및 표준화’ 단계에서 ’TRL: 사업화‘단계에 진입하고 있어 현장 도입 시 상당기간 동안 활용이 가능할 것으로 예상된다. 또한, 국·내외 발전소를 대상으로 관련 기술이 시장에 점차적으로 도입되고 있으며, 본 발명의 조기경보 기술 은 발전분야뿐만 아니라 모든 기계시스템에 활용이 가능하여 타 산업분야인 국방, 화학/정유 플랜트, 대형 선박 및 풍력발전 등 신재생 에너지 분야로도 확대적용이 가능한 기술이다. 또한, 여기에 개시된 실시형태들과 관련하여 설명된 방법 또는 알고리즘의 단계들은, 마이크로프로세서, 프로세 서, CPU(Central Processing Unit) 등과 같은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태 로 구현되어 컴퓨터 판독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 (명령) 코드, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 (명령) 코드는 본 발명을 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소 프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프 등과 같은 자기 매체(magnetic media), CD-ROM, DVD, 블루레이 등과 같 은 광기록 매체(optical media) 및 롬(ROM: Read Only Memory), 램(RAM: Random Access Memory), 플래시 메모 리 등과 같은 프로그램 (명령) 코드를 저장하고 수행하도록 특별히 구성된 반도체 기억 소자가 포함될 수 있다. 여기서, 프로그램 (명령) 코드의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프 리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 상기된 하드웨어 장치는 본 발명의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가 지이다."}
{"patent_id": "10-2022-0143636", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시예에 따른 조기경보 운영 최적화를 위한 오탐지 평가 시스템의 구성 블럭도이다. 도 2는 도 1에 도시된 계산부의 세부 구성 블럭도이다. 도 3은 본 발명의 일실시예에 따른 조기경보 운영을 최적화하는 과정을 보여주는 흐름도이다. 도 4는 도 3에 도시된 조기 경보 알고리즘 학습 단계 이후 규칙을 수정하는 과정을 보여주는 흐름도이다. 도 5는 스케일링 다운 예시를 보여주는 그래프이다. 도 6은 본 발명의 일실시예에 따른 원신호에 대한 크기 재정렬을 보여주는 그래프이다. 도 7은 본 발명의 일실시예에 따른 원신호와 압축된 신호 비교를 보여주는 그래프이다. 도 8은 일반적인 스무딩(smoothing)을 통한 오알람(false) 필터링의 개념도이다. 도 9는 본 발명의 일실시예에 따른 강도와 연속성 기반 평가를 보여주는 개념도이다. 도 10은 본 발명의 일실시예에 따른 다변량 신호 압축 실시예를 보여주는 그래프이다. 도 11은 본 발명의 일실시예에 따른 잔차 스무딩을 통한 알람 필터링 실시예 1이다.도 12는 본 발명의 일실시예에 따른 잔차 스무딩을 통한 알람 필터링 실시예 2이다. 도 13은 본 발명의 일실시예에 따른 잔차 스무딩을 통한 알람 필터링 실시예 3이다. 도 14는 본 발명의 일실시예에 따른 강도 및 연속성 기반 평가를 통한 알람 발생을 보여주는 그래프이다. 도 15는 본 발명의 일실시예에 따른 심각도(severity) 등급 판정 규칙를 생성하는 프로그램 코드이이다. 도 16은 본 발명의 일실시예에 따른 해외 발전소 대상 원격 감시를 보여주는 화면예이다. 도 17은 본 발명의 일실시예에 따른 민간 발전사 설치 운영을 보여주는 그래프이다."}
