{"patent_id": "10-2021-0041287", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0047285", "출원번호": "10-2021-0041287", "발명의 명칭": "자기 디스크 암호화 보호 방법 및 장치", "출원인": "베이징 바이두 넷컴 사이언스 앤 테크놀로지 코.,", "발명자": "시 젠젠"}}
{"patent_id": "10-2021-0041287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "자기 디스크 암호화 보호 방법으로서,타깃 기기의 자기 디스크에 대해 암호화를 진행하여, 암호화 자기 디스크를 획득하고 상기 암호화 자기 디스크에 대응되는 암호 키를 생성하는 단계;상기 타깃 기기에 보안 칩이 설치되어 있는지 여부를 검출하는 단계; 및검출 결과에 따라 상기 암호 키의 암호화 방식과 상기 암호 키에 대응되는 암호 키 파라미터의 저장 슬롯을 결정하는 단계를 포함하고, 상기 암호화 자기 디스크는 복수 개의 저장 슬롯을 포함하며, 제1 저장 슬롯에는 고정 패스워드에 기반하여 상기 자기 디스크에 대해 암호화를 진행하기 위한 패스워드 암호 키 파라미터가 저장되는 자기 디스크 암호화 보호 방법."}
{"patent_id": "10-2021-0041287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 타깃 기기에 보안 칩이 설치되어 있는지 여부를 검출하고, 검출 결과에 따라 상기 암호 키의 암호화 방식과 상기 암호 키에 대응되는 암호 키 파라미터의 저장 슬롯을 결정하는 단계는,상기 타깃 기기에 기설정된 시스템이 설치될 경우, 상기 암호 키에 대해 화이트 박스 암호화를 진행하는 단계;및상기 타깃 기기에 보안 칩이 설치되어 있다고 결정된 것에 응답하여, 상기 암호 키 파라미터를 제2 저장 슬롯에저장하는 단계를 포함하는 것을 특징으로 하는 자기 디스크 암호화 보호 방법."}
{"patent_id": "10-2021-0041287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 타깃 기기에 보안 칩이 설치되어 있는지 여부를 검출하고, 검출 결과에 따라 상기 암호 키의 암호화 방식과 상기 암호 키에 대응되는 암호 키 파라미터의 저장 슬롯을 결정하는 단계는,상기 타깃 기기에 보안 칩이 설치되어 있지 않다고 결정된 것에 응답하여, 상기 암호 키 파라미터를 제3 저장슬롯에 저장하는 단계를 더 포함하는 것을 특징으로 하는 자기 디스크 암호화 보호 방법."}
{"patent_id": "10-2021-0041287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 타깃 기기에 보안 칩이 설치되어 있는지 여부를 검출하고, 검출 결과에 따라 상기 암호 키의 암호화 방식과 상기 암호 키에 대응되는 암호 키 파라미터의 저장 슬롯을 결정하는 단계는,상기 기설정된 시스템 작동시, 상기 암호화 자기 디스크에 대해 복호화할 때 활성화된 슬롯을 검출하는 단계;활성화된 슬롯이 제1 저장 슬롯이라고 결정된 것에 응답하여, 상기 고정 패스워드와 상기 패스워드 암호 키 파라미터를 통해 상기 암호화 자기 디스크에 대해 복호화를 진행하여, 복호화 자기 디스크를 획득하는 단계; 및상기 타깃 기기에 보안 칩이 설치되어 있는지 여부를 검출하고, 검출 결과에 따라, 상기 복호화 자기 디스크에대해 재차 암호화를 진행하여 획득한 제1 업데이트 암호 키의 암호화 방식과 상기 제1 업데이트 암호 키에 대응되는 제1 업데이트 암호 키 파라미터의 저장 슬롯을 결정하는 단계를 더 포함하는 것을 특징으로 하는 자기 디스크 암호화 보호 방법.공개특허 10-2021-0047285-3-청구항 5 제4항에 있어서,상기 타깃 기기에 보안 칩이 설치되어 있는지 여부를 검출하고, 검출 결과에 따라, 상기 복호화 자기 디스크에대해 재차 암호화를 진행하여 획득한 제1 업데이트 암호 키의 암호화 방식과 상기 제1 업데이트 암호 키에 대응되는 제1 업데이트 암호 키 파라미터의 저장 슬롯을 결정하는 단계는,상기 타깃 기기에 보안 칩이 설치되어 있다고 결정된 것에 응답하여, 상기 제1 업데이트 암호 키와 상기 기설정된 시스템의 시스템 상태를 상기 보안 칩에 관련 저장하는 단계;상기 타깃 기기에 보안 칩이 설치되어 있지 않다고 결정된 것에 응답하여, 상기 제1 업데이트 암호 키에 대해화이트 박스 암호화를 진행하는 단계; 및상기 고정 패스워드를 상기 제1 업데이트 암호 키로 교체하고, 상기 제1 업데이트 암호 키 파라미터를 제3 저장슬롯에 저장하는 단계를 포함하는 것을 특징으로 하는 자기 디스크 암호화 보호 방법."}
{"patent_id": "10-2021-0041287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4항에 있어서,상기 타깃 기기에 보안 칩이 설치되어 있는지 여부를 검출하고, 검출 결과에 따라 상기 암호 키의 암호화 방식과 상기 암호 키에 대응되는 암호 키 파라미터의 저장 슬롯을 결정하는 단계는,활성화된 슬롯이 제2 저장 슬롯이라고 결정된 것에 응답하여, 상기 암호 키가 상기 제2 저장 슬롯 중의 암호 키파라미터와 매칭되는지 여부를 결정하는 단계;상기 암호 키가 상기 제2 저장 슬롯 중의 암호 키 파라미터와 매칭되는 것에 응답하여, 상기 암호 키 및 상기암호 키 파라미터를 통해 상기 암호화 자기 디스크에 대해 복호화를 진행하여, 복호화 자기 디스크를 획득하는단계;복호화 자기 디스크에 대해 암호화를 진행하여, 제2 업데이트 암호 키와 제2 업데이트 암호 키 파라미터를 생성하고, 상기 제2 업데이트 암호 키와 기설정된 시스템의 시스템 상태를 상기 보안 칩에 관련 저장하는 단계; 및상기 제2 업데이트 암호 키 파라미터를 제3 저장 슬롯에 저장하는 단계를 더 포함하는 것을 특징으로 하는 자기디스크 암호화 보호 방법."}
{"patent_id": "10-2021-0041287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항 내지 제6항 중 어느 한 항에 있어서,상기 타깃 기기에 보안 칩이 설치되어 있는지 여부를 검출하고, 검출 결과에 따라 상기 암호 키의 암호화 방식과 상기 암호 키에 대응되는 암호 키 파라미터의 저장 슬롯을 결정하는 단계는,상기 기설정된 시스템를 업그레이드하기 전에, 암호화 자기 디스크에 대해 복호화를 진행하고, 복호화할 때 활성화된 슬롯을 검출하며, 상기 타깃 기기에 보안 칩이 설치되어 있는지 여부를 결정하는 단계;활성화된 슬롯이 제3 저장 슬롯이라고 결정된 것 및 상기 타깃 기기에 보안 칩이 설치되어 있다고 결정된 것에응답하여, 상기 제2 업데이트 암호 키와 상기 제2 업데이트 암호 키 파라미터를 통해 상기 암호화 자기 디스크에 대해 복호화를 진행하여, 복호화 자기 디스크를 획득하는 단계;복호화 자기 디스크에 대해 암호화를 진행하여, 업그레이드 암호 키와 업그레이드 암호 키 파라미터를 생성하는단계; 및상기 업그레이드 암호 키에 대해 화이트 박스 암호화를 진행하고, 상기 업그레이드 암호 키 파라미터를 제2 저장 슬롯에 저장하는 단계를 더 포함하는 것을 특징으로 하는 자기 디스크 암호화 보호 방법."}
{"patent_id": "10-2021-0041287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "자기 디스크 암호화 보호 장치로서,타깃 기기에 자기 디스크에 대해 암호화를 진행하여, 상기 자기 디스크에 대응되는 암호 키를 생성하고, 암호화공개특허 10-2021-0047285-4-자기 디스크를 획득하도록 구성되는 암호화 유닛; 및상기 타깃 기기에 보안 칩이 설치되어 있는지 여부를 검출하고, 검출 결과에 따라 상기 암호 키의 암호화 방식과 상기 암호 키에 대응되는 암호 키 파라미터의 저장 슬롯을 결정하도록 구성되는 결정 유닛을 포함하며, 상기 암호화 자기 디스크는 복수 개의 저장 슬롯을 포함하고, 제1 저장 슬롯에는 고정 패스워드에 기반하여 상기 자기 디스크에 대해 암호화를 진행하기 위한 패스워드 암호 키 파라미터가 저장되는 자기 디스크 암호화 보호 장치."}
{"patent_id": "10-2021-0041287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 결정 유닛은 또한, 상기 타깃 기기에 기설정된 시스템이 설치될 경우, 상기 암호 키에 대해 화이트 박스 암호화를 진행하고, 상기타깃 기기에 보안 칩이 설치되어 있다고 결정된 것에 응답하여, 상기 암호 키 파라미터를 제2 저장 슬롯에 저장하도록 구성되는 자기 디스크 암호화 보호 장치."}
{"patent_id": "10-2021-0041287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 결정 유닛은 또한, 상기 타깃 기기에 보안 칩이 설치되어 있지 않다고 결정된 것에 응답하여, 상기 암호 키 파라미터를 제3 저장슬롯에 저장하도록 구성되는 자기 디스크 암호화 보호 장치."}
{"patent_id": "10-2021-0041287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 결정 유닛은 또한, 상기 기설정된 시스템 작동시, 상기 암호화 자기 디스크에 대해 복호화할 때 활성화된 슬롯을 검출하고, 활성화된 슬롯이 제1 저장 슬롯이라고 결정된 것에 응답하여, 상기 고정 패스워드와 상기 패스워드 암호 키 파라미터를 통해 상기 암호화 자기 디스크에 대해 복호화를 진행하여, 복호화 자기 디스크를 획득하며, 상기 타깃 기기에 보안 칩이 설치되어 있는지 여부를 검출하고, 검출 결과에 따라, 상기 복호화 자기 디스크에 대해 재차 암호화를 진행하여 획득한 제1 업데이트 암호 키의 암호화 방식과 상기 제1 업데이트 암호 키에 대응되는 제1 업데이트 암호 키 파라미터의 저장 슬롯을 결정하도록 구성되는 자기 디스크 암호화 보호 장치."}
{"patent_id": "10-2021-0041287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 결정 유닛은 또한, 상기 타깃 기기에 보안 칩이 설치되어 있다고 결정된 것에 응답하여, 상기 제1 업데이트 암호 키와 상기 기설정된 시스템의 시스템 상태를 상기 보안 칩에 관련 저장하고, 상기 타깃 기기에 보안 칩이 설치되어 있지 않다고결정된 것에 응답하여, 상기 제1 업데이트 암호 키에 대해 화이트 박스 암호화를 진행하며, 상기 고정 패스워드를 상기 제1 업데이트 암호 키로 교체하고, 상기 업데이트 암호 키 파라미터를 제3 저장 슬롯에 저장하도록 구성되는 자기 디스크 암호화 보호 장치."}
{"patent_id": "10-2021-0041287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서,상기 결정 유닛은 또한, 활성화된 슬롯이 제2 저장 슬롯이라고 결정된 것에 응답하여, 상기 암호 키가 상기 제2 저장 슬롯 중의 암호 키파라미터와 매칭되는지 여부를 결정하고, 상기 암호 키가 상기 제2 저장 슬롯 중의 암호 키 파라미터와 매칭되는 것에 응답하여, 상기 암호 키 및 상기 암호 키 파라미터를 통해 상기 암호화 자기 디스크에 대해 복호화를공개특허 10-2021-0047285-5-진행하여, 복호화 자기 디스크를 획득하며, 복호화 자기 디스크에 대해 암호화를 진행하여, 제2 업데이트 암호키와 제2 업데이트 암호 키 파라미터를 생성하고, 상기 제2 업데이트 암호 키와 기설정된 시스템의 시스템 상태를 상기 보안 칩에 관련 저장하며, 상기 제2 업데이트 암호 키 파라미터를 제3 저장 슬롯에 저장하도록 구성되는 자기 디스크 암호화 보호 장치."}
{"patent_id": "10-2021-0041287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제8항 내지 제13항 중 어느 한 항에 있어서,상기 결정 유닛은 또한, 상기 기설정된 시스템를 업그레이드하기 전에, 암호화 자기 디스크에 대해 복호화를 진행하고, 복호화할 때 활성화된 슬롯을 검출하며, 상기 타깃 기기에 보안 칩이 설치되어 있는지 여부를 결정하고, 활성화된 슬롯이 제3저장 슬롯이라고 결정된 것 및 상기 타깃 기기에 보안 칩이 설치되어 있다고 결정된 것에 응답하여, 상기 제2업데이트 암호 키와 상기 제2 업데이트 암호 키 파라미터를 통해 상기 암호화 자기 디스크에 대해 복호화를 진행하여, 복호화 자기 디스크를 획득하며, 복호화 자기 디스크에 대해 암호화를 진행하여, 업그레이드 암호 키와업그레이드 암호 키 파라미터를 생성하고, 상기 업그레이드 암호 키에 대해 화이트 박스 암호화를 진행하고, 상기 업그레이드 암호 키 파라미터를 제2 저장 슬롯에 저장하도록 구성되는 자기 디스크 암호화 보호 장치."}
{"patent_id": "10-2021-0041287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "적어도 하나의 프로세서; 및상기 적어도 하나의 프로세서와 통신 연결되는 메모리를 포함하는 전자 기기로서,상기 메모리에 상기 적어도 하나의 프로세서에 의해 실행 가능한 명령이 저장되며, 상기 명령이 상기 적어도 하나의 프로세서에 의해 실행되어, 상기 적어도 하나의 프로세서가 제1항 내지 제6항 중 어느 한 항에 따른 방법을 수행할 수 있도록 하는 전자 기기."}
{"patent_id": "10-2021-0041287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "컴퓨터 명령이 저장된 비일시적 컴퓨터 판독 가능한 저장 매체로서,상기 컴퓨터 명령은 상기 컴퓨터가 제1항 내지 제6항 중 어느 한 항에 따른 방법을 수행하도록 하는 비일시적컴퓨터 판독 가능한 저장 매체."}
{"patent_id": "10-2021-0041287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "컴퓨터 판독 가능한 저장 매체에 저장된 컴퓨터 프로그램으로서,상기 컴퓨터 프로그램이 프로세서에 의해 실행될 경우 제1항 내지 제6항 중 어느 한 항에 따른 방법을 구현하도록 하는 컴퓨터 프로그램."}
{"patent_id": "10-2021-0041287", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 인공 지능"}
{"patent_id": "10-2021-0041287", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "에 관한 자기 디스크 암호화 보호 방법 및 장치를 공개한다. 구체적인 구현 수단은 하기와 같다. 타깃 기기의 자기 디스크에 대해 암호화를 진행하여, 자기 디스크에 대응되는 암호 키를 생성하고, 암호화 자기 디스크를 획득하며, 타깃 기기에 보안 칩이 설치되어 있는지 여부를 검출하고, 검출 결과에 따라 암 (뒷면에 계속) 대 표 도 - 도2"}
{"patent_id": "10-2021-0041287", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 2, "content": "공개특허10-2021-0047285 호 키의 암호화 방식과 암호 키 파라미터의 저장 슬롯을 결정하며, 여기서, 암호화 자기 디스크는 복수 개의 저 장 슬롯을 포함하고, 제1 저장 슬롯에는 고정 패스워드에 기반하여 자기 디스크에 대해 암호화를 진행하는 암호 키 파라미터가 저장된다. 상기 수단은, 상이한 하드웨어가 자기 디스크에 대해 상이한 암호화 방식을 사용하여 보호하는 것을 판정함으로써, 암호화 자기 디스크의 안전성을 향상시킨다. 또한, 제1 저장 슬롯에 고정 패스워드 에 기반하여 자기 디스크에 대해 암호화를 진행하는 암호 키 파라미터가 저장되어 있어, 그 고정 패스워드 암호 화 방식은 기존의 Linux 시스템의 설치에 적용할 수 있다. CPC특허분류 G06F 21/62 (2013.01)명 세 서 청구범위 청구항 1 자기 디스크 암호화 보호 방법으로서, 타깃 기기의 자기 디스크에 대해 암호화를 진행하여, 암호화 자기 디스크를 획득하고 상기 암호화 자기 디스크 에 대응되는 암호 키를 생성하는 단계; 상기 타깃 기기에 보안 칩이 설치되어 있는지 여부를 검출하는 단계; 및 검출 결과에 따라 상기 암호 키의 암호화 방식과 상기 암호 키에 대응되는 암호 키 파라미터의 저장 슬롯을 결 정하는 단계를 포함하고, 상기 암호화 자기 디스크는 복수 개의 저장 슬롯을 포함하며, 제1 저장 슬롯에는 고정 패스워드에 기반하여 상 기 자기 디스크에 대해 암호화를 진행하기 위한 패스워드 암호 키 파라미터가 저장되는 자기 디스크 암호화 보 호 방법. 청구항 2 제1항에 있어서, 상기 타깃 기기에 보안 칩이 설치되어 있는지 여부를 검출하고, 검출 결과에 따라 상기 암호 키의 암호화 방식 과 상기 암호 키에 대응되는 암호 키 파라미터의 저장 슬롯을 결정하는 단계는, 상기 타깃 기기에 기설정된 시스템이 설치될 경우, 상기 암호 키에 대해 화이트 박스 암호화를 진행하는 단계; 및 상기 타깃 기기에 보안 칩이 설치되어 있다고 결정된 것에 응답하여, 상기 암호 키 파라미터를 제2 저장 슬롯에 저장하는 단계를 포함하는 것을 특징으로 하는 자기 디스크 암호화 보호 방법. 청구항 3 제2항에 있어서, 상기 타깃 기기에 보안 칩이 설치되어 있는지 여부를 검출하고, 검출 결과에 따라 상기 암호 키의 암호화 방식 과 상기 암호 키에 대응되는 암호 키 파라미터의 저장 슬롯을 결정하는 단계는, 상기 타깃 기기에 보안 칩이 설치되어 있지 않다고 결정된 것에 응답하여, 상기 암호 키 파라미터를 제3 저장 슬롯에 저장하는 단계를 더 포함하는 것을 특징으로 하는 자기 디스크 암호화 보호 방법. 청구항 4 제3항에 있어서, 상기 타깃 기기에 보안 칩이 설치되어 있는지 여부를 검출하고, 검출 결과에 따라 상기 암호 키의 암호화 방식 과 상기 암호 키에 대응되는 암호 키 파라미터의 저장 슬롯을 결정하는 단계는, 상기 기설정된 시스템 작동시, 상기 암호화 자기 디스크에 대해 복호화할 때 활성화된 슬롯을 검출하는 단계; 활성화된 슬롯이 제1 저장 슬롯이라고 결정된 것에 응답하여, 상기 고정 패스워드와 상기 패스워드 암호 키 파 라미터를 통해 상기 암호화 자기 디스크에 대해 복호화를 진행하여, 복호화 자기 디스크를 획득하는 단계; 및 상기 타깃 기기에 보안 칩이 설치되어 있는지 여부를 검출하고, 검출 결과에 따라, 상기 복호화 자기 디스크에 대해 재차 암호화를 진행하여 획득한 제1 업데이트 암호 키의 암호화 방식과 상기 제1 업데이트 암호 키에 대응 되는 제1 업데이트 암호 키 파라미터의 저장 슬롯을 결정하는 단계를 더 포함하는 것을 특징으로 하는 자기 디 스크 암호화 보호 방법.청구항 5 제4항에 있어서, 상기 타깃 기기에 보안 칩이 설치되어 있는지 여부를 검출하고, 검출 결과에 따라, 상기 복호화 자기 디스크에 대해 재차 암호화를 진행하여 획득한 제1 업데이트 암호 키의 암호화 방식과 상기 제1 업데이트 암호 키에 대응 되는 제1 업데이트 암호 키 파라미터의 저장 슬롯을 결정하는 단계는, 상기 타깃 기기에 보안 칩이 설치되어 있다고 결정된 것에 응답하여, 상기 제1 업데이트 암호 키와 상기 기설정 된 시스템의 시스템 상태를 상기 보안 칩에 관련 저장하는 단계; 상기 타깃 기기에 보안 칩이 설치되어 있지 않다고 결정된 것에 응답하여, 상기 제1 업데이트 암호 키에 대해 화이트 박스 암호화를 진행하는 단계; 및 상기 고정 패스워드를 상기 제1 업데이트 암호 키로 교체하고, 상기 제1 업데이트 암호 키 파라미터를 제3 저장 슬롯에 저장하는 단계를 포함하는 것을 특징으로 하는 자기 디스크 암호화 보호 방법. 청구항 6 제4항에 있어서, 상기 타깃 기기에 보안 칩이 설치되어 있는지 여부를 검출하고, 검출 결과에 따라 상기 암호 키의 암호화 방식 과 상기 암호 키에 대응되는 암호 키 파라미터의 저장 슬롯을 결정하는 단계는, 활성화된 슬롯이 제2 저장 슬롯이라고 결정된 것에 응답하여, 상기 암호 키가 상기 제2 저장 슬롯 중의 암호 키 파라미터와 매칭되는지 여부를 결정하는 단계; 상기 암호 키가 상기 제2 저장 슬롯 중의 암호 키 파라미터와 매칭되는 것에 응답하여, 상기 암호 키 및 상기 암호 키 파라미터를 통해 상기 암호화 자기 디스크에 대해 복호화를 진행하여, 복호화 자기 디스크를 획득하는 단계; 복호화 자기 디스크에 대해 암호화를 진행하여, 제2 업데이트 암호 키와 제2 업데이트 암호 키 파라미터를 생성 하고, 상기 제2 업데이트 암호 키와 기설정된 시스템의 시스템 상태를 상기 보안 칩에 관련 저장하는 단계; 및 상기 제2 업데이트 암호 키 파라미터를 제3 저장 슬롯에 저장하는 단계를 더 포함하는 것을 특징으로 하는 자기 디스크 암호화 보호 방법. 청구항 7 제1항 내지 제6항 중 어느 한 항에 있어서, 상기 타깃 기기에 보안 칩이 설치되어 있는지 여부를 검출하고, 검출 결과에 따라 상기 암호 키의 암호화 방식 과 상기 암호 키에 대응되는 암호 키 파라미터의 저장 슬롯을 결정하는 단계는, 상기 기설정된 시스템를 업그레이드하기 전에, 암호화 자기 디스크에 대해 복호화를 진행하고, 복호화할 때 활 성화된 슬롯을 검출하며, 상기 타깃 기기에 보안 칩이 설치되어 있는지 여부를 결정하는 단계; 활성화된 슬롯이 제3 저장 슬롯이라고 결정된 것 및 상기 타깃 기기에 보안 칩이 설치되어 있다고 결정된 것에 응답하여, 상기 제2 업데이트 암호 키와 상기 제2 업데이트 암호 키 파라미터를 통해 상기 암호화 자기 디스크 에 대해 복호화를 진행하여, 복호화 자기 디스크를 획득하는 단계; 복호화 자기 디스크에 대해 암호화를 진행하여, 업그레이드 암호 키와 업그레이드 암호 키 파라미터를 생성하는 단계; 및 상기 업그레이드 암호 키에 대해 화이트 박스 암호화를 진행하고, 상기 업그레이드 암호 키 파라미터를 제2 저 장 슬롯에 저장하는 단계를 더 포함하는 것을 특징으로 하는 자기 디스크 암호화 보호 방법. 청구항 8 자기 디스크 암호화 보호 장치로서, 타깃 기기에 자기 디스크에 대해 암호화를 진행하여, 상기 자기 디스크에 대응되는 암호 키를 생성하고, 암호화자기 디스크를 획득하도록 구성되는 암호화 유닛; 및 상기 타깃 기기에 보안 칩이 설치되어 있는지 여부를 검출하고, 검출 결과에 따라 상기 암호 키의 암호화 방식 과 상기 암호 키에 대응되는 암호 키 파라미터의 저장 슬롯을 결정하도록 구성되는 결정 유닛을 포함하며, 상기 암호화 자기 디스크는 복수 개의 저장 슬롯을 포함하고, 제1 저장 슬롯에는 고정 패스워드에 기반하여 상 기 자기 디스크에 대해 암호화를 진행하기 위한 패스워드 암호 키 파라미터가 저장되는 자기 디스크 암호화 보 호 장치. 청구항 9 제8항에 있어서, 상기 결정 유닛은 또한, 상기 타깃 기기에 기설정된 시스템이 설치될 경우, 상기 암호 키에 대해 화이트 박스 암호화를 진행하고, 상기 타깃 기기에 보안 칩이 설치되어 있다고 결정된 것에 응답하여, 상기 암호 키 파라미터를 제2 저장 슬롯에 저장 하도록 구성되는 자기 디스크 암호화 보호 장치. 청구항 10 제9항에 있어서, 상기 결정 유닛은 또한, 상기 타깃 기기에 보안 칩이 설치되어 있지 않다고 결정된 것에 응답하여, 상기 암호 키 파라미터를 제3 저장 슬롯에 저장하도록 구성되는 자기 디스크 암호화 보호 장치. 청구항 11 제10항에 있어서, 상기 결정 유닛은 또한, 상기 기설정된 시스템 작동시, 상기 암호화 자기 디스크에 대해 복호화할 때 활성화된 슬롯을 검출하고, 활성화 된 슬롯이 제1 저장 슬롯이라고 결정된 것에 응답하여, 상기 고정 패스워드와 상기 패스워드 암호 키 파라미터 를 통해 상기 암호화 자기 디스크에 대해 복호화를 진행하여, 복호화 자기 디스크를 획득하며, 상기 타깃 기기 에 보안 칩이 설치되어 있는지 여부를 검출하고, 검출 결과에 따라, 상기 복호화 자기 디스크에 대해 재차 암호 화를 진행하여 획득한 제1 업데이트 암호 키의 암호화 방식과 상기 제1 업데이트 암호 키에 대응되는 제1 업데 이트 암호 키 파라미터의 저장 슬롯을 결정하도록 구성되는 자기 디스크 암호화 보호 장치. 청구항 12 제11항에 있어서, 상기 결정 유닛은 또한, 상기 타깃 기기에 보안 칩이 설치되어 있다고 결정된 것에 응답하여, 상기 제1 업데이트 암호 키와 상기 기설정 된 시스템의 시스템 상태를 상기 보안 칩에 관련 저장하고, 상기 타깃 기기에 보안 칩이 설치되어 있지 않다고 결정된 것에 응답하여, 상기 제1 업데이트 암호 키에 대해 화이트 박스 암호화를 진행하며, 상기 고정 패스워드 를 상기 제1 업데이트 암호 키로 교체하고, 상기 업데이트 암호 키 파라미터를 제3 저장 슬롯에 저장하도록 구 성되는 자기 디스크 암호화 보호 장치. 청구항 13 제11항에 있어서, 상기 결정 유닛은 또한, 활성화된 슬롯이 제2 저장 슬롯이라고 결정된 것에 응답하여, 상기 암호 키가 상기 제2 저장 슬롯 중의 암호 키 파라미터와 매칭되는지 여부를 결정하고, 상기 암호 키가 상기 제2 저장 슬롯 중의 암호 키 파라미터와 매칭되 는 것에 응답하여, 상기 암호 키 및 상기 암호 키 파라미터를 통해 상기 암호화 자기 디스크에 대해 복호화를진행하여, 복호화 자기 디스크를 획득하며, 복호화 자기 디스크에 대해 암호화를 진행하여, 제2 업데이트 암호 키와 제2 업데이트 암호 키 파라미터를 생성하고, 상기 제2 업데이트 암호 키와 기설정된 시스템의 시스템 상태 를 상기 보안 칩에 관련 저장하며, 상기 제2 업데이트 암호 키 파라미터를 제3 저장 슬롯에 저장하도록 구성되 는 자기 디스크 암호화 보호 장치. 청구항 14 제8항 내지 제13항 중 어느 한 항에 있어서, 상기 결정 유닛은 또한, 상기 기설정된 시스템를 업그레이드하기 전에, 암호화 자기 디스크에 대해 복호화를 진행하고, 복호화할 때 활 성화된 슬롯을 검출하며, 상기 타깃 기기에 보안 칩이 설치되어 있는지 여부를 결정하고, 활성화된 슬롯이 제3 저장 슬롯이라고 결정된 것 및 상기 타깃 기기에 보안 칩이 설치되어 있다고 결정된 것에 응답하여, 상기 제2 업데이트 암호 키와 상기 제2 업데이트 암호 키 파라미터를 통해 상기 암호화 자기 디스크에 대해 복호화를 진 행하여, 복호화 자기 디스크를 획득하며, 복호화 자기 디스크에 대해 암호화를 진행하여, 업그레이드 암호 키와 업그레이드 암호 키 파라미터를 생성하고, 상기 업그레이드 암호 키에 대해 화이트 박스 암호화를 진행하고, 상 기 업그레이드 암호 키 파라미터를 제2 저장 슬롯에 저장하도록 구성되는 자기 디스크 암호화 보호 장치. 청구항 15 적어도 하나의 프로세서; 및 상기 적어도 하나의 프로세서와 통신 연결되는 메모리를 포함하는 전자 기기로서, 상기 메모리에 상기 적어도 하나의 프로세서에 의해 실행 가능한 명령이 저장되며, 상기 명령이 상기 적어도 하 나의 프로세서에 의해 실행되어, 상기 적어도 하나의 프로세서가 제1항 내지 제6항 중 어느 한 항에 따른 방법 을 수행할 수 있도록 하는 전자 기기. 청구항 16 컴퓨터 명령이 저장된 비일시적 컴퓨터 판독 가능한 저장 매체로서, 상기 컴퓨터 명령은 상기 컴퓨터가 제1항 내지 제6항 중 어느 한 항에 따른 방법을 수행하도록 하는 비일시적 컴퓨터 판독 가능한 저장 매체. 청구항 17 컴퓨터 판독 가능한 저장 매체에 저장된 컴퓨터 프로그램으로서, 상기 컴퓨터 프로그램이 프로세서에 의해 실행될 경우 제1항 내지 제6항 중 어느 한 항에 따른 방법을 구현하도 록 하는 컴퓨터 프로그램. 발명의 설명 기 술 분 야"}
{"patent_id": "10-2021-0041287", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 3, "content": "본 발명의 실시예는 컴퓨터 기술분야에 관한 것이고, 구체적으로 인공 지능 기술에 관한 것이며, 자기 디스크 암호화 보호 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2021-0041287", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "기밀 데이터가 오프라인으로 도난되는 것을 방지하기 위해, 자기 디스크 장치는 일반적으로 자기 디스크 암호화 기술을 사용하며, 기존 LUKS(Linux Unified Key Setup, Linux 통합 암호 키 설정) 자기 디스크 암호화 암호 키 는 간단한 패스워드 또는 파일을 통해 보호된다. 패스워트를 통해 보호하는 방식은 수동으로 입력하여야 하므로 자동 운전 시스템 요구를 만족시키지 못한다. 파일을 통해 보호하는 방식은, 파일이 암호화되지 않은 자기 디스 크에 저장해야 하므로, 안전성을 보장할 수 없다."}
{"patent_id": "10-2021-0041287", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "발명의 내용"}
{"patent_id": "10-2021-0041287", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 자기 디스크 암호화 보호 방법, 장치, 기기 및 저장 매체를 제공한다."}
{"patent_id": "10-2021-0041287", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "제1 양태에 따르면, 자기 디스크 암호화 보호 방법을 제공하되, 상기 방법은 타깃 기기의 자기 디스크에 대해 암호화를 진행하여, 자기 디스크에 대응되는 암호 키를 생성하고, 암호화 자기 디스크를 획득하는 단계; 타깃 기기에 보안 칩이 설치되어 있는지 여부를 검출하는 단계; 및 검출 결과에 따라 암호 키의 암호화 방식과 암호 키에 대응되는 암호 키 파라미터의 저장 슬롯을 결정하는 단계를 포함하고, 암호화 자기 디스크는 복수 개의 저 장 슬롯을 포함하며, 제1 저장 슬롯에는 고정 패스워드에 기반하여 자기 디스크에 대해 암호화를 진행하기 위한 패스워드 암호 키 파라미터가 저장된다. 제2 양태에 따르면, 자기 디스크 암호화 보호 장치를 제공하되, 상기 장치는 타깃 기기의 자기 디스크에 대해 암호화를 진행하여, 자기 디스크에 대응되는 암호 키를 생성하고, 암호화 자기 디스크를 획득하도록 구성되는 암호화 유닛; 및 타깃 기기에 보안 칩이 설치되어 있는지 여부를 검출하고, 검출 결과에 따라 암호 키의 암호화 방식과 암호 키에 대응되는 암호 키 파라미터의 저장 슬롯을 결정하도록 구성되는 결정 유닛을 포함하고, 암호 화 자기 디스크는 복수 개의 저장 슬롯을 포함하며, 제1 저장 슬롯에는 고정 패스워드에 기반하여 자기 디스크 에 대해 암호화를 진행하기 위한 패스워드 암호 키 파라미터가 저장된다. 제3 양태에 따르면, 적어도 하나의 프로세서; 및 적어도 하나의 프로세서와 통신 연결되는 메모리를 포함하는 전자 기기에 를 제공하되, 메모리에 적어도 하나의 프로세서에 의해 실행 가능한 명령이 저장되며, 명령이 적어 도 하나의 프로세서에 의해 실행되어, 적어도 하나의 프로세서가 상기 제1 양태 중의 어느 한 방법을 수행할 수 있도록 한다. 제4 양태에 따르면, 컴퓨터 명령이 저장된 비일시적 컴퓨터 판독 가능한 저장 매체를 제공하되, 컴퓨터 명령은 컴퓨터가 제1양태 중 어느 한 방법을 수행하도록 한다. 제5 양태에 따르면, 컴퓨터 판독 가능한 저장 매체에 저장된 컴퓨터 프로그램을 제공하되, 컴퓨터 프로그램이 프로세서에 의해 실행될 경우 제1양태 중 어느 한 방법을 구현하도록 한다."}
{"patent_id": "10-2021-0041287", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 기술에 따르면, 보안 칩에 관한 상이한 타깃 기기의 검출 결과를 판정하고, 자기 디스크에 대해 상이 한 암호화 방식을 사용하여 보호함으로써, 암호화 자기 디스크의 안전성을 향상시킨다. 또한, 제1 저장 슬롯에 고정 패스워드에 기반하여 자기 디스크에 대해 암호화를 진행하기 위한 패스워드 암호 키 파라미터가 저장되어 있어, 그 고정 패스워드 암호화 방식은 기존의 Linux 시스템의 설치에 적용할 수 있다. 본 부분에서 설명되는 내용은 본 발명의 실시예의 핵심적이거나 중요한 특징을 식별하기 위한 것이 아니며, 본 발명의 범위를 제한하려는 의도도 아님을 이해해야 한다. 본 발명의 기타 특징은 하기의 명세서에 의해 쉽게 이 해될 것이다."}
{"patent_id": "10-2021-0041287", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래 도면과 결부시켜 본 발명의 예시적 실시예를 설명하되, 여기에 이해를 돕기 위한 본 발명의 실시예의 다양"}
{"patent_id": "10-2021-0041287", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "한 세부사항들이 포함되지만, 이들은 단지 예시적인 것으로 이해해야 한다. 따라서, 본 기술분야의 통상의 기술 자는 본 발명의 범위 및 정신을 벗어나지 않는 전제 하에 여기서 설명된 실시예에 대해 다양한 변형 및 수정을 진행할 수 있음을 이해해야 한다. 마찬가지로, 명확 및 간략을 위해, 아래의 설명에서 공지 기능 및 구조에 대 한 설명을 생략한다. 도 1은 본 발명의 자기 디스크 암호화 보호 방법 및 장치를 구현할수 있는 예시적 아키텍처이다. 도 1에 도시된 바와 같이, 시스템 아키텍처는 단말 기기(101, 102, 103), 네트워크 및 서버를 포함할 수 있다. 네트워크는 단말 기기(101, 102, 103)와 서버 사이에서 통신 링크의 매체를 제공한 다. 네트워크는 다양한 연결 타입을 포함할 수 있는 바, 예를 들면 유선, 무선 통신 링크 또는 광섬유 케 이블 등이다. 단말 기기(101, 102, 103)는 네트워크 연결을 지원하여 데이터 교류 및 데이터 처리를 진행할 수 있는 하드웨어 기기 또는 소프트웨어일 수도 있다. 단말 기기(101, 102, 103)가 하드웨어인 경우 정보 교류, 네트워크 연결, 정보 처리 등 기능을 지원하는 다양한 전자 기기일 수 있으며, 스마트폰, 태블릿PC, e-book 리더, 휴대형 랩톱 컴퓨터 및 데스크톱 컴퓨터, 차량용 컴퓨터 등등을 포함하나 이에 한정되는 것은 아니다. 단말 기기(101, 102, 103)가 소프트웨인 경우 상기 열거된 전자 기기에 설치될 수 있다. 예컨대 분산형 서비스를 제공하는 복수의 소 프트웨어 또는 소프트웨어 모듈로 구현되거나, 하나의 소프트웨어 또는 소프트웨어 모듈로 구현될 수 있으며 여 기서는 구체적으로 한정하지 않는다. 서버는 다양한 서비스를 제공하는 서버일 수 있고, 예를 들면 단말 기기(101, 102, 103)에 대해 자기 디스 크 암호화를 진행하는 백그라운드 처리 서버일 수 있다. 백그라운드 처리 서버는 단말 기기에 대해 자기 디스크 암호화를 진행하고, 타깃 기기에 보안 칩이 설치되어 있는지 여부의 검출 결과에 따라, 암호 키의 암호화 방식 및 암호 키에 대응되는 암호 키 파라미터의 저장 슬롯을 결정한다. 예시로서, 서버는 클라우드 서버일 수 있다. 설명해야 할 것은, 서버는 하드웨어 또는 소프트웨어일 수 있다. 서버가 하드웨어인 경우 복수의 서 버로 구성된 분산형 서버 클러스터로 구현될 수 있고, 하나의 서버로 구현될 수도 있다. 서버가 소프트웨어인 경우 복수의 소프트웨어 또는 소프트웨어 모듈(예를 들면 분산형 서비스를 제공하는 소프트웨어 도는 소프트웨 어 모듈)로 구현되거나, 하나의 소프트웨어 또는 소프트웨어 모듈로 구현될 수 있으며 여기서는 구체적으로 한 정하지 않는다. 또한, 설명해야 할 것은, 본 발명의 실시예에서 제공되는 자기 디스크 암호화 보호 방법은 서버에 의해 수행될 수 있고, 단말 기기에 의해 수행될 수도 있으며, 서버와 단말기의 서로 간의 배합에 의해 수행될 수도 있다. 상 응하게, 정보 처리 장치에 포함되는 각각의 부분(예를 들어, 각각의 유닛, 서브 유닛, 모듈, 서브 모듈)은 전부 서버에 설치될 수 있고, 전부 단말 기기에 설치될 수도 있으며, 각각 서버와 단말 기기에 설치될 수도 있다. 이해해야 할 것은 도 1 중의 단말 기기, 네트워크 및 서버의 개수는 예시적인 것일 뿐이며, 실제 필요에 따라 임의의 개수의 단말 기기, 네트워크 및 서버를 구비할 수 있다. 자기 디스크 암호화 보호 방법이 상기 전자 기 기에 실행되고 기타 전자 기기와 데이터 전송을 진행할 필요 없을 때, 상기 시스템 아키텍처는 자기 디스크 암 호화 보호 방법만 포함하여 상기 전자 기기(예를 들어 서버 또는 단말 기기)에서 실행될 수 있다. 계속하여 도 2를 참조하면, 이는 자기 디스크 암호화 보호 방법의 일 실시예의 흐름을 도시하고, 하기와 같은 단계를 포함한다. 단계에서, 타깃 기기의 자기 디스크에 대해 암호화를 진행하여, 자기 디스크에 대응되는 암호 키를 생성하 고, 암호화 자기 디스크를 획득한다. 본 실시예에서, 자기 디스크 암호화 보호 방법의 수행 주체(예를 들어 도 1 중의 단말 기기 또는 서버)는 타깃 기기의 자기 디스크에 대해 암호화를 진행하여, 자기 디스크에 대응되는 암호 키를 생성하고, 암호화 자기 디스 크를 획득할 수 있다. 예시로서, 상기 수행 주체는 LUKS(Linux Unified Key Setup, Linux, 통합 암호 키 설정) 기술에 기반하여 타깃 기기의 자기 디스크에 대해 암호화를 진행하고, AES(Advanced Encryption Standard, 고급 암호화 표준) 암호화 알고리즘, Cast암호화 알고리즘, Serpent암호화 알고리즘 사용을 포함하되 이에 제한되지 않는다. LUKS 기술은 Linux 하드 디스크 암호화의 표준이다. 표준을 제공하는 자기 디스크 포맷을 통해, LUKS 기술은 발행 버전 사이의 호환성을 촉진시킬 수 있을 뿐만 아니라, 복수 개의 사용자 비밀번호에 대한 안전 관리도 제공할 수 있다. 타깃 기기는 자기 디스크가 설치된 임의의 단말 기기일 수 있고, 예시로서, 타깃 기기는 도 1에 도시된 데스크 톱 컴퓨터, 차량용 컴퓨터 등일 수 있다. 설명해야 할 것은, 본 단계의 수행 주체는 단말 기기일 수 있고, 서버일 수도 있다. 단말 기기에 자기 디스크 암호화 기능이 구비될 때, 본 단계의 수행 주체는 자기 디스크 암호화 기능을 구비한 단말 기기일 수 있고, 서 버에 자기 디스크 암호화 기능이 구비될 때, 본 단계의 수행 주체는 자기 디스크 암호화 기능을 구비한 서버일 수 있다. 단계에서, 타깃 기기에 보안 칩이 설치되어 있는지 여부를 검출하고, 검출 결과에 따라 암호 키의 암호화 방식과 암호 키에 대응되는 암호 키 파라미터의 저장 슬롯을 결정한다. 본 실시예에서, 상기 수행 주체는 단계의 타깃 기기에 보안 칩이 설치되어 있는지 여부를 검출하고, 검출 결과에 따라 암호 키의 암호화 방식과 암호 키에 대응되는 암호 키 파라미터의 저장 슬롯을 결정할 수 있다. 여기서, 암호화 자기 디스크는 복수 개의 저장 슬롯를 포함하고, 예를 들어 LUKS기술 암호화에 기반하여 획득한 암호화 자기 디스크이며, 그 내부의 암호화 분할 구역은 볼륨 헤더, 암호화 데이터 영역 등 부분으로 이루어지 고, 볼륨 헤더에 기본적으로 8개의 슬롯(key slot)이 제공될 수 있으며, 각 슬롯에는 상이한 암호화 방식에 기 반하여 획득한 암호 키의 암호 키 파라미터가 저장될 수 있다. 암호 키 및 대응되는 암호 키 파라미터는 암호화 자기 디스크에 대해 복호화를 진행하는 하나의 열쇠로 볼 수 있고, 임의의 하나의 열쇠를 사용하여도 LUKS기술 암호화에 기반하여 획득한 암호화 자기 디스크를 열 수 있다. 본 실시예에서, 제1 저장 슬롯에는 고정 패스워드에 기반하여 자기 디스크에 대해 암호화를 진행하기 위한 패스 워드 암호 키 파라미터가 저장되고, 그 고정 패스워드 암호화 방식은 기존의 Linux 시스템에 설치될 수 있다. 예시로서, 기존의 Linux 시스템은 Ubuntu일 수 있다. Ubuntu시스템 설치 시, Ubuntu시스템을 설치하는 자기 디 스크에 대해 암호화 진행시 수동으로 고정 패스워드를 입력하고, 패스워드 암호 키 파라미터는 제1 저장 슬롯에 저장된다. 본 실시예에서, 임의의 암호화 방식을 사용하여 암호 키에 대해 암호화를 진행할 수 있다. 화이트 박스 암호화, 블랙 박스 암호화, 암호 키와 시스템 상태의 바인딩 등을 포함하나 이에 제한되지 않는다. 암호 키를 시스템 상 태에 바인딩하는 암호화 방식은 BIOS(Basic Input Output System, 기본 입출력 시스템), GRUB(GRand Unified Bootloader, 거대 통합 부트로더), 커널 또는 초기화 미러 등 기설정된 시스템의 임의의 부분 상태가 변화될 때 암호 키를 획득할 수 없고 암호 키의 안전성을 한층 더 보장하는데 사용된다. 예시로서, 보안 칩이 존재하는 타깃 기기의 경우, 상기 수행 주체는 암호 키와 시스템 상태를 바인딩하고, 암호 키와 기설정된 시스템의 시스템 상태를 보안 칩에 관련 저장하며, 암호 키 파라미터를 암호화 자기 디스크의 제 2 저장 슬롯에 저장할 수 있다. 보안 칩이 존재하지 않는 타깃 기기의 경우, 암호 키는 화이트 박스를 사용하여 보호되고, 비밀번호 암호문을 LUKS header에 저장하고, 암호 키 파라미터를 암호화 자기 디스크의 제3 저장 슬 롯에 저장한다. 계속하여 도 3을 참조하면, 도 3은 본 실시예에 따른 자기 디스크 암호화 보호 방법의 응용 장면의 일 모식도이 다. 도 3의 응용 장면에서, 사용자는 가정용 차량의 차량용 컴퓨터에 자동 운전 시스템을 설치하여야 한다. 차량용 컴퓨터가 차량용 컴퓨터의 자기 디스크에 대해 암호화를 진행하여, 자기 디스크 에 대응되는 암호 키를 생성하고, 암호화 자기 디스크를 획득하며, 다음, 차량용 컴퓨터가 차량용 컴 퓨터에 보안 칩이 설치되어 있는지 여부를 검출하고, 검출 결과에 따라 암호 키의 암호화 방식과 암호 키에 대 응되는 암호 키 파라미터의 저장 슬롯을 결정하며, 여기서, 암호화 자기 디스크는 복수 개의 저장 슬롯을 포함 하고, 제1 저장 슬롯에는 고정 패스워드에 기반하여 자기 디스크에 대해 암호화를 진행하기 위한 패스워드 암호 키 파라미터가 저장된다. 본 발명의 상기 실시예에서 제공되는 방법에 따르면, 상이한 하드웨어에 보안 칩이 설치되어 있는지 여부를 판 정하고, 자기 디스크에 대해 상이한 암호화 방식을 사용하여 보호함으로써, 암호화 자기 디스크의 안전성을 향 상시킨다. 또한, 제1 저장 슬롯에는 고정 패스워드에 기반하여 자기 디스크에 대해 암호화를 진행하기 위한 패 스워드 암호 키 파라미터가 저장되고, 그 고정 패스워드암호화 방식은 기존의 Linux 시스템에 설치될 수 있다. 계속하여 도 4를 참조하면, 이는 본 발명에 따른 자기 디스크 암호화 보호 방법의 다른 실시예의 예시적 흐름 을 도시하고, 하기와 같은 단계를 포함한다.단계에서, 타깃 기기에 기설정된 시스템이 설치될 경우, 타깃 기기의 자기 디스크에 대해 암호화를 진행하 여, 자기 디스크에 대응되는 암호 키를 생성하고, 암호화 자기 디스크를 획득한다. 단계에서, 암호 키에 대해 화이트 박스 암호화를 진행하고, 타깃 기기에 보안 칩이 설치되어 있다고 결정 된 것에 응답하여, 암호 키 파라미터를 제2 저장 슬롯에 저장하며, 타깃 기기에 보안 칩이 설치되어 있지 않다 고 결정된 것에 응답하여, 암호 키 파라미터를 제3 저장 슬롯에 저장한다. 단계에서, 기설정된 시스템 작동시, 암호화 자기 디스크에 대해 복호화할 때 활성화된 슬롯을 검출한다. 단계에서, 활성화된 슬롯이 제1 저장 슬롯이라고 결정된 것에 응답하여, 고정 패스워드와 패스워드 암호 키 파라미터를 통해 암호화 자기 디스크에 대해 복호화를 진행하여, 복호화 자기 디스크를 획득한다. 단계에서, 타깃 기기에 보안 칩이 설치되어 있는지 여부를 검출하고, 검출 결과에 따라, 복호화 자기 디스 크에 대해 재차 암호화를 진행하여 획득한 제1 업데이트 암호 키의 암호화 방식과 제1 업데이트 암호 키에 대응 되는 제1 업데이트 암호 키 파라미터의 저장 슬롯을 결정한다. 본 실시예에서, 상기 수행 주체는 하기와 같은 구체적은 방식을 통하여 상기 단계를 수행할 수 있다. 단계에서, 타깃 기기에 보안 칩이 설치되어 있다고 결정된 것에 응답하여, 제1 업데이트 암호 키와 기설 정된 시스템의 시스템 상태를 보안 칩에 관련 저장한다. 단계에서, 타깃 기기에 보안 칩이 설치되어 있지 않다고 결정된 것에 응답하여, 제1 업데이트 암호 키에 대해 화이트 박스 암호화를 진행한다. 단계에서, 고정 패스워드를 제1 업데이트 암호 키로 교체하고, 제1 업데이트 암호 키 파라미터를 제3 저 장 슬롯에 저장한다. 단계에서, 활성화된 슬롯이 제2 저장 슬롯이라고 결정된 것에 응답하여, 암호 키가 제2 저장 슬롯 중의 암 호 키 파라미터와 매칭되는지 여부를 결정한다. 단계에서, 암호 키가 제2 저장 슬롯 중의 암호 키 파라미터와 매칭되는 것에 응답하여, 암호 키 및 암호 키 파라미터를 통해 암호화 자기 디스크에 대해 복호화를 진행하여, 복호화 자기 디스크를 획득한다. 단계에서, 복호화 자기 디스크에 대해 암호화를 진행하여, 제2 업데이트 암호 키와 제2 업데이트 암호 키 파라미터를 생성하고, 제2 업데이트 암호 키와 기설정된 시스템의 시스템 상태를 보안 칩에 관련 저장한다. 단계에서, 제2 업데이트 암호 키 파라미터를 제3 저장 슬롯에 저장한다. 단계에서, 기설정된 시스템를 업그레이드하기 전에, 암호화 자기 디스크에 대해 복호화를 진행하고, 복호 화할 때 활성화된 슬롯을 검출하며, 타깃 기기에 보안 칩이 설치되어 있는지 여부를 결정한다. 단계에서, 활성화된 슬롯이 제3 저장 슬롯이라고 결정된 것 및 타깃 기기에 보안 칩이 설치되어 있다고 결 정된 것에 응답하여, 제2 업데이트 암호 키와 제2 업데이트 암호 키 파라미터를 통해 암호화 자기 디스크에 대 해 복호화를 진행하여, 복호화 자기 디스크를 획득한다. 단계에서, 복호화 자기 디스크에 대해 암호화를 진행하여, 업그레이드 암호 키와 업그레이드 암호 키 파라 미터를 생성한다. 단계에서, 업그레이드 암호 키에 대해 화이트 박스 암호화를 진행하고, 업그레이드 암호 키 파라미터를 제 2 저장 슬롯에 저장한다. 설명해야 할 것은, 위에서 기재된 내용을 제외하고, 본 발명의 실시예는 도 2에 대응되는 실시예와 동일하거나 유사한 특징, 효과를 더 포함할 수 있으며, 여기서 더이상 설명하지 않는다. 도 4로부터 보아낼 수 있다시피, 도 2에 대응되는 실시예와 비교하면, 본 실시예 중의 자기 디스크 암호화 보호 방법의 흐름은 기설정된 시스템의 설치, 작동 및 업그레이드 과정 중의 자기 디스크 복호화 프로세스를 강 조한다. 설명해야 할 것은, 비록 본 실시예에 기설정된 시스템의 완전한 설치, 작동 및 업그레이드 과정을 포함 하지만, 자기 디스크 암호화 보호 방법의 실시예에 별도의 설치, 작동 또는 업그레이드 과정이 포함될 수 있음 을 이해해야 한다. 이로부터, 본 실시예에서 설명된 수단에서, 기설정된 시스템의 설치, 작동 또는 업그레이드 과정에서, 자기 디스크 자동 복호화를 실현하여, 스마트화 정도가 향상되고, 타깃 기기에 보안 칩이 존재할 때, 암호 키와 시스템 상태를 바인딩하며, 시스템 상태가 변화되어 암호 키를 획득할 수 없을 때 암호 키의 안전성을 한층 더 보장하고, 기설정된 시스템 작동, 업그레이드 과정에 대하여, 암호 키 이전을 진행하여, 기설정된 시스템 업그레이드 성공 여부가 다음번 시스템 작동시 자기 디스크 복호화에 영향주지 않도록 하여 스마트화 정 도를 한층 더 향상시킨다. 또한, 도 5를 참조하면, 상기 각 도면에 도시된 방법의 구현으로서, 본 발명은 자기 디스크 암호화 보호 장치의 일 실시예를 제공하고, 상기 장치 실시예는 도 2에 도시된 방법 실시예와 대응되며, 아래에 기재된 특징을 제외 하고, 상기 장치 실시예는 도 2에 도시된 방법 실시예와 동일하거나 대응되는 특징을 더 포함할 수 있으며, 도 2에 도시된 방법 실시예와 동일하거나 대응되는 효과를 발생한다. 상기 장치는 구체적으로 다양한 전자 기기에 응용될 수 있다. 도 5에 도시된 바와 같이, 본 실시예의 자기 디스크 암호화 보호 장치는, 타깃 기기의 자기 디스크에 대해 암호화를 진행하여, 자기 디스크에 대응되는 암호 키를 생성하고, 암호화 자기 디스크를 획득하도록 구성되는 암호화 유닛; 및 타깃 기기에 보안 칩이 설치되어 있는지 여부를 검출하고, 검출 결과에 따라 암호 키의 암호화 방식과 암호 키에 대응되는 암호 키 파라미터의 저장 슬롯을 결정하도록 구성되는 결정 유닛을 포 함하고, 암호화 자기 디스크는 복수 개의 저장 슬롯을 포함하며, 제1 저장 슬롯에는 고정 패스워드에 기반하여 자기 디스크에 대해 암호화를 진행하기 위한 패스워드 암호 키 파라미터가 저장된다. 일부 실시예에서, 결정 유닛은 또한, 타깃 기기에 기설정된 시스템이 설치될 경우, 암호 키에 대해 화이트 박스 암호화를 진행하고, 타깃 기기에 보안 칩이 설치되어 있다고 결정된 것에 응답하여, 암호 키 파라미터를 제2 저장 슬롯에 저장하도록 구성된다. 일부 실시예에서, 결정 유닛은 또한, 타깃 기기에 보안 칩이 설치되어 있지 않다고 결정된 것에 응답하여, 암호 키 파라미터를 제3 저장 슬롯에 저장하도록 구성된다. 일부 실시예에서, 결정 유닛은 또한, 기설정된 시스템 작동시 암호화 자기 디스크에 대해 복호화할 때 활 성화된 슬롯을 검출하고, 활성화된 슬롯이 제1 저장 슬롯이라고 결정된 것에 응답하여, 고정 패스워드와 패스워 드 암호 키 파라미터를 통해 암호화 자기 디스크에 대해 복호화를 진행하여, 복호화 자기 디스크를 획득하며, 타깃 기기에 보안 칩이 설치되어 있는지 여부를 검출하고, 검출 결과에 따라, 복호화 자기 디스크에 대해 재차 암호화를 진행하여 획득한 제1 업데이트 암호 키의 암호화 방식과 제1 업데이트 암호 키에 대응되는 제1 업데이 트 암호 키 파라미터의 저장 슬롯을 결정하도록 구성된다. 일부 실시예에서, 결정 유닛은 또한, 타깃 기기에 보안 칩이 설치되어 있다고 결정된 것에 응답하여, 제1 업데이트 암호 키와 기설정된 시스템의 시스템 상태를 보안 칩에 관련 저장하고, 타깃 기기에 보안 칩이 설치되 어 있지 않다고 결정된 것에 응답하여, 제1 업데이트 암호 키에 대해 화이트 박스 암호화를 진행하며, 고정 패 스워드를 제1 업데이트 암호 키로 교체하고, 업데이트 암호 키 파라미터를 제3 저장 슬롯에 저장하도록 구성된 다. 일부 실시예에서, 결정 유닛은 또한, 활성화된 슬롯이 제2 저장 슬롯이라고 결정된 것에 응답하여, 암호 키가 제2 저장 슬롯 중의 암호 키 파라미터와 매칭되는지 여부를 결정하고, 암호 키가 제2 저장 슬롯 중의 암호 키 파라미터와 매칭되는 것에 응답하여, 암호 키 및 암호 키 파라미터를 통해 암호화 자기 디스크에 대해 복호 화를 진행하여, 복호화 자기 디스크를 획득하며, 복호화 자기 디스크에 대해 암호화를 진행하여, 제2 업데이트 암호 키와 제2 업데이트 암호 키 파라미터를 생성하고, 제2 업데이트 암호 키와 기설정된 시스템의 시스템 상태 를 보안 칩에 관련 저장하며, 제2 업데이트 암호 키 파라미터를 제3 저장 슬롯에 저장하도록 구성된다. 일부 실시예에서, 결정 유닛은 또한, 기설정된 시스템를 업그레이드하기 전에, 암호화 자기 디스크에 대해 복호화를 진행하고, 복호화할 때 활성화된 슬롯을 검출하며, 타깃 기기에 보안 칩이 설치되어 있는지 여부를 결 정하고, 활성화된 슬롯이 제3 저장 슬롯이라고 결정된 것 및 타깃 기기에 보안 칩이 설치되어 있다고 결정된 것 에 응답하여, 제2 업데이트 암호 키와 상기 제2 업데이트 암호 키 파라미터를 통해 암호화 자기 디스크에 대해 복호화를 진행하여, 복호화 자기 디스크를 획득하며, 복호화 자기 디스크에 대해 암호화를 진행하여, 업그레이 드 암호 키와 업그레이드 암호 키 파라미터를 생성하고, 업그레이드 암호 키에 대해 화이트 박스 암호화를 진행 하고, 업그레이드 암호 키 파라미터를 제2 저장 슬롯에 저장하도록 구성된다. 아래에서 도 6을 참조하면, 본 발명의 실시예에 따르면, 본 발명은 전자 기기 및 판독 가능한 저장 매체를 더 제공한다. 도 6에 도시된 바와 같이, 본 발명의 실시예에 따른 자기 디스크 암호화 보호 방법의 전자 기기의 블록도 이다. 전자 기기는 랩톱 컴퓨터, 데스크톱 컴퓨터, 운영 플랫폼, 개인 정보 단말기, 서버, 블레이드 서버, 대형컴퓨터, 및 기타 적합한 컴퓨터와 같은 다양한 형태의 디지털 컴퓨터를 의미한다. 전자 기기는 개인 디지털 처 리, 셀룰러폰, 스마트폰, 웨어러블 기기 및 기타 유사한 컴퓨팅 장치와 같은 다양한 형태의 이동 장치를 의미할 수도 있다. 본문에서 나타낸 부재, 이들의 연결과 관계, 및 이들의 기능은 단지 예시적인 것으로, 본문에서 설 명 및/또는 요구된 본 발명의 구현을 한정하지 않는다. 도 6에 도시된 바와 같이, 상기 전자 기기는 하나 또는 다수의 프로세서, 메모리, 및 고속 인터페이 스 및 저속 인터페이스를 포함하는 각 부재를 연결하기 위한 인터페이스를 포함한다. 각 부재는 상이한 버스를 이용하여 서로 연결되고, 공통 메인보드에 장착될 수 있거나 필요에 따라 기타 방식으로 장착될 수 있다. 프로 세서는, 메모리에 저장되거나 메모리에서 외부 입력/출력 장치(예를 들어, 인터페이스에 커플링된 표시 기기)에 GUI의 그래픽 정보를 표시하는 명령을 포함하는 전자 기기 내에서 실행되는 명령을 처리할 수 있다. 기타 실시 형태에서, 필요에 따라 복수 개의 프로세서 및/또는 복수 개의 버스를 복수 개의 메모리와 함께 사용할 수 있다. 마찬가지로, 복수 개의 전자 기기를 연결할 수 있고, 각 기기는 일부 필요한 동작(예를 들어, 서버 어레 이, 한 그룹의 블레이드 서버, 또는 다중 프로세서 시스템)을 제공한다. 도 6에서 하나의 프로세서를 예로 든다. 메모리는 본 발명에서 제공되는 비일시적 컴퓨터 판독 가능한 저장 매체이다. 여기서, 메모리에는 적어도 하나의 프로세서에 의해 실행 가능한 명령이 저장되어, 적어도 하나의 프로세서가 본 발명에서 제공되는 자기 디스크 암호화 보호 방법을 수행하도록 할 수 있다. 본 발명의 비일시적 컴퓨터 판독 가능한 저장 매체에는 컴 퓨터가 본 발명에서 제공되는 자기 디스크 암호화 보호 방법을 수행하도록 하는 컴퓨터 명령이 저장된다. 메모리는 비일시적 컴퓨터 판독 가능한 저장 매체로서, 비일시적 소프트웨어 프로그램, 비일시적 컴퓨터 실행 가능한 프로그램, 및 본 발명의 실시예의 자기 디스크 암호화 보호 방법에 대응되는 프로그램 명령/모듈 (예를 들어, 도 5에 도시된 암호화 유닛 및 결정 유닛)과 같은 모듈을 저장할 수 있다. 프로세서 는 메모리에 저장된 비일시적 소프트웨어 프로그램, 명령 및 모듈을 실행함으로써, 서버의 다양한 기 능 애플리케이션 및 데이터 처리를 수행하는데, 즉 상기 방법 실시예의 자기 디스크 암호화 보호 방법을 구현한 다. 메모리는 프로그램 저장 영역 및 데이터 저장 영역을 포함할 수 있고, 여기서, 프로그램 저장 영역은 운영 체제, 적어도 하나의 기능에 필요한 응용 프로그램을 저장할 수 있으며, 데이터 저장 영역은 자기 디스크 암호 화 보호 방법 전자 기기의 사용에 따라 구축된 데이터 등을 저장할 수 있다. 이 밖에, 메모리는 고속 랜덤 액세스 메모리를 포함할 수 있고, 적어도 하나의 자기 디스크 메모리, 플래시 메모리, 또는 기타 비일시적 고체 상태 메모리와 같은 비일시적 메모리를 더 포함할 수 있다. 일부 실시예에서, 메모리는 프로세서에 대해 원격으로 설치된 메모리를 선택적으로 포함할 수 있고, 이러한 원격 메모리는 네트워크를 통해 자기 디스 크 암호화 보호 방법의 전자 기기에 연결될 수 있다. 상기 네트워크의 구현예로 인터넷, 인트라넷, 근거리 통신 망, 이동 통신망 및 이들의 조합을 포함하지만 이에 한정되지 않는다. 자기 디스크 암호화 보호 방법의 전자 기기는 입력 장치 및 출력 장치를 더 포함할 수 있다. 프로세 서, 메모리, 입력 장치 및 출력 장치는 버스 또는 기타 방식을 통해 연결될 수 있고, 도 6 에서 버스를 통해 연결되는 것을 예로 든다. 입력 장치는 입력된 디지털 또는 문자 정보를 수신할 수 있고, 자기 디스크 암호화 보호의 전자 기기의 사 용자 설정 및 기능 제어와 관련된 암호 키 신호 입력을 발생할 수 있으며, 상기 입력 장치는 예를 들어 터치스 크린, 암호 키패드, 마우스, 트랙 패널, 터치 패널, 지시 바, 하나 또는 복수 개의 마우스 버튼, 트랙 볼, 조이 스틱 등 입력 장치이다. 출력 장치는 표시 기기, 보조 조명 장치(예를 들어, LED) 및 촉각 피드백 장치(예 를 들어, 진동 모터) 등을 포함할 수 있다. 상기 표시 기기는 액정 표시 장치(LCD), 발광 다이오드(LED) 표시 장치 및 플라스마 표시 장치를 포함할 수 있지만 이에 한정되지 않는다. 일부 실시형태에서, 표시 기기는 터치 스크린일 수 있다. 여기서 설명된 시스템 및 기술의 다양한 실시형태는 디지털 전자 회로 시스템, 집적 회로 시스템, 전용 ASIC(전 용 집적 회로), 컴퓨터 하드웨어, 펌웨어, 소프트웨어, 및/또는 이들의 조합에서 구현될 수 있다. 이러한 다양 한 실시 형태는 하나 또는 다수의 컴퓨터 프로그램에서의 구현을 포함할 수 있고, 상기 하나 또는 다수의 컴퓨 터 프로그램은 적어도 하나의 프로그램 가능 프로세서를 포함하는 프로그램 가능 시스템에서 실행 및/또는 해석 될 수 있으며, 상기 프로그램 가능 프로세서는 전용 또는 범용 프로그램 가능 프로세서일 수 있고, 저장 시스템, 적어도 하나의 입력 장치, 및 적어도 하나의 출력 장치로부터 데이터 및 명령을 수신할 수 있으며, 데 이터 및 명령을 상기 저장 시스템, 상기 적어도 하나의 입력 장치, 및 상기 적어도 하나의 출력 장치에 전송할수 있다. 이러한 컴퓨팅 프로그램(프로그램, 소프트웨어, 소프트웨어 애플리케이션, 또는 코드라고도 함)은 프로그램 가 능 프로세서의 기계 명령을 포함하고, 하이레벨 프로세스 및/또는 객체에 대한 프로그래밍 언어, 및/또는 어셈 블리/기계 언어를 이용하여 이러한 컴퓨팅 프로그램을 실행할 수 있다. 본문에서 사용된 바와 같이, 용어 “기 계 판독 가능한 매체” 및 “컴퓨터 판독 가능한 매체”는 기계 명령 및/또는 데이터를 프로그램 가능 프로세서 에 제공하기 위한 임의의 컴퓨터 프로그램 제품, 기기, 및/또는 장치(예를 들어, 자기 디스크, 광 디스크, 메모 리, 프로그램 가능 로직 장치(PLD))를 의미하고, 기계 판독 가능한 신호인 기계 명령을 수신하는 기계 판독 가 능한 매체를 포함한다. 용어 “기계 판독 가능한 신호”는 기계 명령 및/또는 데이터를 프로그램 가능 프로세서 에 제공하기 위한 임의의 신호를 의미한다. 사용자와의 인터랙션을 제공하기 위하여, 컴퓨터에서 여기서 설명된 시스템 및 기술을 실시할 수 있고, 상기 컴 퓨터는 사용자에게 정보를 표시하기 위한 표시 장치(예를 들어, CRT(음극선관) 또는 LCD(액정 표시 장치) 모니 터); 및 암호 키보드 및 지향 장치(예를 들어, 마우스 또는 트랙 볼)를 구비하며, 사용자는 상기 암호 키보드 및 상기 지향 장치를 통해 컴퓨터에 입력을 제공한다. 다른 타입의 장치는 또한 사용자와의 인터랙션을 제공할 수 있는데, 예를 들어, 사용자에게 제공된 피드백은 임의의 형태의 감지 피드백(예를 들어, 시각 피드백, 청각 피드백, 또는 촉각 피드백)일 수 있고; 임의의 형태(소리 입력, 음성 입력, 또는 촉각 입력)로 사용자로부터의 입력을 수신할 수 있다. 여기서 설명된 시스템 및 기술을 백그라운드 부재를 포함하는 컴퓨팅 시스템(예를 들어, 데이터 서버), 또는 미 들웨어 부재를 포함하는 컴퓨팅 시스템(예를 들어, 응용 서버), 또는 프론트 엔드 부재를 포함하는 컴퓨팅 시스 템(예를 들어, 그래픽 사용자 인터페이스 또는 웹 브라우저를 구비하는 사용자 컴퓨터이고, 사용자는 상기 그래 픽 사용자 인터페이스 또는 웹 브라우저를 통해 여기서 설명된 시스템 및 기술의 실시형태와 인터랙션할 수 있 음), 또는 이러한 백그라운드 부재, 미들웨어 부재, 또는 프론트 엔드 부재의 임의의 조합을 포함하는 컴퓨팅 시스템에서 실시할 수 있다. 임의의 형태 또는 매체의 디지털 데이터 통신(예를 들어, 통신 네트워크)을 통해 시스템의 부재를 서로 연결시킬 수 있다. 통신 네트워크의 예시로 근거리 통신망(LAN), 광역 통신망(WAN), 인터 넷을 포함한다. 컴퓨터 시스템은 클라이언트 및 서버를 포함할 수 있다. 클라이언트 및 서버는 일반적으로 서로 멀리 떨어져 있 고 일반적으로 통신 네트워크를 통해 서로 인터랙션한다. 대응되는 컴퓨터에서 실행되고 또한 서로 클라이언트- 서버 관계를 가지는 컴퓨터 프로그램을 통해 클라이언트 및 서버의 관계를 생성한다. 본 발명의 실시예의 기술적 해결수단에 따르면, 상이한 하드웨어가 자기 디스크에 대해 상이한 암호화 방식을 사용하여 보호하는 것을 판정함으로써, 암호화 자기 디스크의 안전성을 향상시킨다. 또한, 제1 저장 슬롯에 고 정 패스워드에 기반하여 자기 디스크에 대해 암호화를 진행하는 패스워드 암호 키가 저장되어 있어, 그 고정 패 스워드 암호화 방식은 기존의 Linux 시스템의 설치에 적용할 수 있다. 위에서 설명한 다양한 형태의 프로세스를 사용하여, 단계를 재배열, 추가 또는 삭제할 수 있음을 이해해야 한다. 예를 들어, 본 발명에 기재된 각 단계는 동시에 수행될 수 있거나 순차적으로 수행될 수 있거나 상이한 순서로 수행될 수 있고, 본 발명에서 공개된 기술적 해결수단이 이루고자 하는 결과를 구현할 수만 있으면, 본 문은 여기서 한정하지 않는다."}
{"patent_id": "10-2021-0041287", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "상기 구체적인 실시형태는 본 발명의 보호 범위를 한정하지 않는다. 본 기술분야의 통상의 기술자는 설계 요구 및 다른 요소에 따라 다양한 수정, 조합, 서브 조합 및 대체를 진해할 수 있음을 이해해야 한다. 본 발명의 정 신 및 원칙 내에서 진행한 임의의 수정, 등가적 대체 및 개선 등은 모두 본 발명의 보호 범위 내에 속해야 한다.도면 도면1 도면2 도면3 도면4 도면5 도면6"}
{"patent_id": "10-2021-0041287", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도면은 본 수단을 더욱 잘 이해하기 위한 것으로, 본 발명에 대해 한정하지 않는다. 여기서, 도 1은 본 발명의 일 실시예가 적용될 수 있는 예시적 시스템 아키텍처이다. 도 2는 본 발명에 따른 자기 디스크 암호화 보호 방법의 일 실시예의 흐름도이다. 도 3은 본 발명에 따른 자기 디스크 암호화 보호 방법의 일 응용 장면의 모식도이다. 도 4는 본 발명에 따른 자기 디스크 암호화 보호 방법의 다른 실시예의 흐름도이다. 도 5는 본 발명에 따른 자기 디스크 암호화 보호 장치의 일 실시예의 구조 모식도이다. 도 6은 본 발명의 실시예를 구현하는 전자 기기/단말 기기 또는 서버에 적합한 컴퓨터 시스템의 구조 모식도이 다."}
