{"patent_id": "10-2023-0075650", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0081298", "출원번호": "10-2023-0075650", "발명의 명칭": "무인주행 운반차량", "출원인": "바인바인주식회사", "발명자": "송현진"}}
{"patent_id": "10-2023-0075650", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "포도원 운행 시 작업 물품 또는 약품을 적재하는 몸체부;상기 몸체부 양측에 형성되어 상기 몸체부를 이동시키는 이동부 및인공지능을 이용하여 상기 몸체부 또는 이동부를 제어하는 제어부를 포함하는 무인주행 운반차량"}
{"patent_id": "10-2023-0075650", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제어부는,상기 인공지능의 분석에 이용될 인공지능정보를 저장하는 저장부;상기 인공지능을 통해 상기 인공지능정보를 분석하여 분석정보를 생성하는 분석부;상기 분석정보로부터 상기 몸체부 또는 이동부 중 하나 이상의 작동을 판단하여 제어정보를 생성하는 판단부;및상기 판단부에서 판단된 상기 제어정보를 몸체부 또는 이동부로 전달하는 통신부를 포함하는 무인주행 운반차량"}
{"patent_id": "10-2023-0075650", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 제어부는,사용자로부터 조작정보를 입력 받는 조작부를 더 포함하는 무인주행 운반차량"}
{"patent_id": "10-2023-0075650", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 제어부는,상기 몸체부 사방의 장애물을 파악하는 센서부;를 더 포함하고,상기 센서부는,상기 몸체부가 이동될 시 일측면에 위치하는 장애물을 인식하여 감지정보를 생성하는 근접센서부; 및상기 몸체부의 전방을 촬영하여 영상정보를 생성하는 비전센서부를 포함하고,상기 분석부는 감지정보 또는 영상정보에 따라 상기 분석정보를 갱신하는 것을 특징으로 하는 무인주행 운반차량"}
{"patent_id": "10-2023-0075650", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 무인주행 운반차량은,공개특허 10-2024-0081298-3-상기 몸체부의 하단 전방에 형성되어 예초를 진행하는 예초부를 더 포함하고,상기 예초부는,상기 몸체부 하단에 연결되는 예초하우징부;상기 예초하우징부의 하면에 형성되어 예초를 진행하는 커터부 및상기 예초하우징부의 전방에 형성되는 안전가드를 포함하는 무인주행 운반차량"}
{"patent_id": "10-2023-0075650", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 무인주행 운반차량은,상기 몸체부의 상측에 형성되어 적재된 약품을 보관 및 분사하는 약품분사부를 더 포함하고,상기 약품분사부는,상기 약품을 보관하는 보관부;상기 보관부에 보관되는 약품의 분사 정도를 조절하는 펌핑부 및상기 펌핑부로부터 전달된 약품을 외부로 배출하는 배출부를 포함하는 무인주행 운반차량"}
{"patent_id": "10-2023-0075650", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 배출부는,상기 몸체부의 후방에 형성되는 메인지지부;상기 메인지지부에 연결되고, 상기 펌핑부로부터 전달된 약품이 이동하게 형성되는 하나 이상의 이송관; 및각 이송관의 길이 방향을 따라 적어도 하나 이상이 형성되어 상기 약품을 배출하는 분사노즐을 포함하는 무인주행 운반차량"}
{"patent_id": "10-2023-0075650", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제2항에 있어서,상기 예초부는,상기 예초하우징부와 연결되어 상기 예초하우징부를 상승 또는 하강시키는 리프트부를 더 포함하는 무인 주행운반차량"}
{"patent_id": "10-2023-0075650", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 리프트부는,상기 예초하우징부가 상승 또는 하강으로 이동되게 형성되는 공간; 및상기 공간에 상기 예초하우징부와 연결되도록 형성되어 상승 또는 하강시키는 제1 리프트실린더를 포함하는 무인주행 운반차량공개특허 10-2024-0081298-4-청구항 10 제4항에 있어서,상기 메인지지부는,상기 몸체부에 연결되는 체결부;상기 체결부에 의해 몸체부에 고정되는 하부지지대;상기 하부지지대의 상측에 형성되는 제2 리프트실린더 및상기 분사노즐이 연결되고, 상기 제2 리프트실린더의 상측에 형성되어 상기 제2 리프트실린더에 의해 상승 또는하강하는 상부지지대를 포함하는 무인주행 운반차량"}
{"patent_id": "10-2023-0075650", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 무인주행 운반차량에 관한 것으로서, 포도원 운행 시 작업 물품 또는 약품을 적재하는 몸체부; 상기 몸체부 양측에 형성되어 상기 몸체부를 이동시키는 이동부 및 인공지능을 이용하여 상기 몸체부 또는 이동부를 제어하는 제어부를 포함하며, 몸체부의 하단 전방에 형성되어 예초를 진행하는 예초부를 더 포함하고, 몸체부의 상측에 형성되어 적재된 약품을 보관 및 분사하는 약품분사부를 더 포함하고, 하부 일측에 탈착 가능하는 예초하 우징부를 포함하고, 예초하우징부에 하나 이상의 커터부가 형성되며, 약품 또는 물을 분사노즐을 통해 분사하고, 근접센서부 또는 비전센서부의 감지정보에 따라 이동부, 예초부, 약품분사부의 이동을 제어할 수 있는 무인주행 운반차량에 관한 것이다."}
{"patent_id": "10-2023-0075650", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 무인주행 운반차량에 관한 것으로, 상세하게는 포도원에서 작동 시 사용자로부터 조작정보를 입력 받 아 무인으로 운반이 가능하고, 추가적으로 약품 또는 물을 포도원에 배출하거나 예초작업을 수행할 수 있는 무 인주행 운반차량에 관한 것이다."}
{"patent_id": "10-2023-0075650", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "국내의 포도 생산은 인구의 고령화 및 4차 산업 혁명 등의 영향으로 포도 재배의 기계화 및 새로운 수형 시스템 의 연구 개발 필요성으로 대두되고 있다. 국내 포도 농가의 재배 방식은 대부분 웨이크만식(평덕형), 개량일문자형 포도 수형으로 재배하고 있다. 이러한 시설은 노동 집약적 구조임에도 불구하고, 포도 묘목의 낮은 높이(90 내지 140cm)로 인해 사용자의 직립 보행이 힘들며, 포도 한 그루의 전체 작업 시간이 5 내지 10분 이상이 소요되고, 숙련자라도 5분 이상 소요되는 문제가 있다. 또한, 생육기간에 따라 묘목에 약품을 분사할 시, 작업자가 인체에 해로운 약품에 노출되거나 관리하기가 까다 로워 포도가 병해충 등에 취약한 단점이 있다. 종래기술로는 대한민국 등록공개공보 제10-2016-0079194호 “분무와 운반이 가능한 무인 다목적 운용기”가 기 재되어 있다. 그러나, 종래기술의 프레임은 이동될 시 전방의 영상을 촬영하는 비전센서부, 장애물을 인식하여 감지정보를 생 성하는 근접센서부가 형성되지 않아 근처에 장애물 또는 사람이 위치할 시 안전에 문제점이 발생될 수 있으며, 분무 시 높이조절의 기능이 없으며 예초작업 시 추가적인 장비를 보유해야 하는 불편함이 있다. 따라서, 기존 웨이크만식, 개량일문자형 포도 수형을 작업자의 편의성, 노동 집중 시간 절약, 피로도 경감, 병 해충 방지 등이 고려된 기계화 작업을 위한 무인주행 운반차량의 개발이 필요한 실정이다."}
{"patent_id": "10-2023-0075650", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서 본 발명은 상기의 문제점을 해결하기 위하여, 기계화 작업이 원활하게 하는 작업공간에서 자율 또는 수 동으로 주행하여 포도원 관리의 자동화 및 기계화가 가능한 무인주행 운반차량을 제공하는 데 목적이 있다. 또한, 무인주행으로 이동 시 예초작업을 수행하고, 제어부를 이용하여 장애물을 피하면서 전진, 후진, 좌회전 및 우회전을 할 수 있으며, 배출부로부터 약품 또는 물을 분사하는 무인주행 운반차량을 제공하는데 목적이 있다."}
{"patent_id": "10-2023-0075650", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 과제를 해결하기 위하여, 본 발명의 실시예에 따른 무인주행 운반차량은 포도원 운행 시 작업 물품 또는 약품을 적재하는 몸체부; 상기 몸체부 양측에 형성되어 상기 몸체부를 이동시키는 이동부 및 인공지능을 이용하 여 상기 몸체부 또는 이동부를 제어하는 제어부를 포함할 수 있다. 또한, 상기 제어부는, 상기 인공지능의 분석에 이용될 인공지능정보를 저장하는 저장부; 상기 인공지능을 통해 상기 인공지능정보를 분석하여 분석정보를 생성하는 분석부; 상기 분석정보로부터 상기 몸체부 또는 이동부 중 하나 이상의 작동을 판단하여 제어정보를 생성하는 판단부; 및 상기 판단부에서 판단된 상기 제어정보를 몸체부 또는 이동부로 전달하는 통신부를 포함할 수 있다. 또한, 상기 제어부는, 사용자로부터 조작정보를 입력 받는 조작부를 더 포함할 수 있다. 또한, 상기 제어부는, 상기 몸체부 사방의 장애물을 파악하는 센서부;를 더 포함하고, 상기 센서부는, 상기 몸 체부가 이동될 시 일측면에 위치하는 장애물을 인식하여 감지정보를 생성하는 근접센서부; 및 상기 몸체부의 전 방을 촬영하여 영상정보를 생성하는 비전센서부를 포함하고, 상기 분석부는 감지정보 또는 영상정보에 따라 상 기 분석정보를 갱신할 수 있다. 또한, 상기 무인주행 운반차량은, 상기 몸체부의 하단 전방에 형성되어 예초를 진행하는 예초부를 더 포함하고, 상기 예초부는, 상기 몸체부 하단에 연결되는 예초하우징부; 상기 예초하우징부의 하면에 형성되어 예초를 진행 하는 커터부 및 상기 예초하우징부의 전방에 형성되는 안전가드를 포함할 수 있다. 또한, 상기 무인주행 운반차량은, 상기 몸체부의 상측에 형성되어 적재된 약품을 보관 및 분사하는 약품분사부 를 더 포함하고, 상기 약품분사부는, 상기 약품을 보관하는 보관부; 상기 보관부에 보관되는 약품의 분사 정도 를 조절하는 펌핑부 및 상기 펌핑부로부터 전달된 약품을 외부로 배출하는 배출부를 포함할 수 있다. 또한, 상기 배출부는, 상기 몸체부의 후방에 형성되는 메인지지부; 상기 메인지지부에 연결되고, 상기 펌핑부로 부터 전달된 약품이 이동하게 형성되는 하나 이상의 이송관; 및 각 이송관의 길이 방향을 따라 적어도 하나 이 상이 형성되어 상기 약품을 배출하는 분사노즐을 포함할 수 있다. 본 발명의 다른 실시예에 따른 무인주행 운반차량은 상기 예초부는, 상기 예초하우징부와 연결되어 상기 예초하 우징부를 상승 또는 하강시키는 리프트부를 더 포함할 수 있다. 또한, 상기 리프트부는, 상기 예초하우징부가 상승 또는 하강으로 이동되게 형성되는 공간; 및 상기 공간에 상 기 예초하우징부와 연결되도록 형성되어 상승 또는 하강시키는 제1 리프트실린더를 포함할 수 있다. 또한, 상기 메인지지부는, 상기 몸체부에 연결되는 체결부; 상기 체결부에 의해 몸체부에 고정되는 하부지지대; 상기 하부지지대의 상측에 형성되는 제2 리프트실린더 및 상기 분사노즐이 연결되고, 상기 제2 리프트실린더의 상측에 형성되어 상기 제2 리프트실린더에 의해 상승 또는 하강하는 상부지지대를 포함할 수 있다."}
{"patent_id": "10-2023-0075650", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따른 무인주행 운반차량은 무인주행으로 몸체부의 하단 전방에 예초부가 형성되어 예초를 진행할 수 있으며, 몸체부의 상측에 약품분사부가 형성되어 약품 또는 물을 배출하고, 이동 시 제어부를 이용하 여 사람 또는 장애물을 피할 수 있다. 또한, 본 발명의 실시예에 따른 무인주행 운반차량은 예초하우징부와 연결되도록 형성된 제1 리프트실린더를 이 용하여 예초하우징부를 상승 또는 하강시키고, 제2 리프트실린더를 이용하여 메인지지부의 높이를 작업 공간에 형성된 포도의 위치에 맞게 조절할 수 있다."}
{"patent_id": "10-2023-0075650", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "또한, 본 발명의 효과는 이상에서 언급한 효과들로 제한되지 않으며, 이하에서 설명할 내용으로부터 통상의 기 술자에게 자명한 범위 내에서 다양한 효과들이 포함될 수 있다."}
{"patent_id": "10-2023-0075650", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 도면을 참조한 본 발명의 설명은 특정한 실시 형태에 대해 한정되지 않으며, 다양한 변환을 가할 수 있고 여러 가지 실시예를 가질 수 있다. 또한, 이하에서 설명하는 내용은 본 발명의 사상 및 기술 범위에 포함되는 모든 변환, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 이하의 설명에서 제1, 제2 등의 용어는 다양한 구성요소들을 설명하는데 사용되는 용어로서, 그 자체에 의미가 한정되지 아니하며, 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 본 명세서 전체에 걸쳐 사용되는 동일한 참조번호는 동일한 구성요소를 나타낸다. 본 발명에서 사용되는 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 또한, 이하에서 기재되는 \"포함하다\", \"구비하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것으로 해석되어야 하며, 하나 또는 그 이 상의 다른 특징들이나, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 다르게 정의되지 않는 한 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속 하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 갖고 있다. 일반적 으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥 상 갖는 의미와 일치하는 의미를 갖 는 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 또한, 첨부 도면을 참조하여 설명함에 있어, 도면 부호에 관계없이 동일한 구성 요소는 동일한 참조부호를 부여 하고 이에 대한 중복되는 설명은 생략하기로 한다. 본 발명을 설명함에 있어서 관련된 공지 기술에 대한 구체적 인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 이하, 본 발명의 실시예를 첨부한 도 1 내지 도 11을 참조하여 상세히 설명하기로 한다. 도 1은 본 발명의 실시예에 따른 무인주행 운반차량의 모습을 나타낸 사시도이고, 도 2는 본 발명의 실시예에 따른 무인주행 운반차량의 제어부의 구성을 나타내기 위한 블록구성도이며, 도 3은 도 2에 도시된 센서부의 구 성을 나타내기 위한 블록구성도이고, 도 4는 도 1에 도시된 몸체부에 예초부가 더 형성된 모습을 나타낸 저면사 시도이며, 도 5는 도 1에 도시된 몸체부에 약품분사부가 더 형성된 모습을 나타낸 배면사시도이고, 도 6은 도 1 에 도시된 몸체부에 예초부 및 약품분사부가 모두 형성된 모습을 나타낸 예시도이다.먼저, 도 1을 참조하면, 본 발명의 실시예에 따른 무인주행 운반차량은 몸체부, 이동부 및 제어부 를 포함할 수 있다. 몸체부는 포도원 운행 시 작업 물품 또는 약품을 적재할 수 있다. 여기서, 포도원은 포도를 재배하는 농장 을 의미하며, 이하에서는, 설명의 용이성을 위해 작업 공간으로 지칭하기로 한다. 몸체부는 포도 관리에 관련된 장비 또는 재배된 포도를 운반하는 것이 바람직하나, 이에 한정하지는 않는다. 이동부는 몸체부 양측에 형성되어 몸체부를 이동시킬 수 있다. 이동부는 몸체부를 구동시키도록 적어도 두 개 이상의 바퀴가 형성될 수 있다. 여기서, 바퀴는 무한궤도 또는 캐터필러로 지칭하는 장치로 마련되는 것이 가장 바람직하나, 이에 한정되는 사 항은 아니다. 또한, 이동부는 엔진에서 구동력을 전달받아 이동될 수 있다. 여기서 엔진은 몸체부 내부에 형성될 수 있다. 이동부의 최대 속도는 무인주행 운반차량의 안전상의 이유로 1km/h 내지 5km/h로 설정될 수 있으나, 가장 바람직하게는 3km/h로 설정될 수 있다. 이동부는 상술된 바퀴의 회전 방향 또는 회전 속도에 따라 전진, 후진, 좌회전 및 우회전을 할 수 있다. 도 2를 참조하면, 제어부는 저장부, 분석부, 판단부, 통신부, 조작부 및 센서부를 포함할 수 있다. 저장부는 인공지능의 분석에 이용될 인공지능정보를 저장할 수 있다. 인공지능정보는 분석부가 이동부의 이동속도, 방향, 커터부의 동작 속도, 리프트부의 높이조절, 분사노즐로부터 분사되는 세기 등을 도출하기 위하여 저장부에 미리 저장된 정보일 수 있다. 인공지능정보는 한국금융연구원, 빅데이터캠퍼스, 국가통계포털 및 Kaggle을 포함하는 외부서버에서 전달 받은 데이터셋(Dataset)일 수 있다. 분석부는 인공지능정보를 사용하여 무인주행 운반차량이 이동 또는 동작 시 필요한 정보들을 분석할 수 있 다. 분석부는 인공지능을 통해 인공지능정보를 분석하여 분석정보를 생성할 수 있다. 분석정보는 저장부에 저장되는 인공지능정보를 분석하여 생성하는 정보를 말할 수 있다. 구체적으로, 분석부는 영상정보를 생성하는 비전센서부로부터 전달받은 영상정보를 분석하여 판단부 로 전달시키며, 판단부는 이동부의 제어정보를 생성하여 이동부로 전달시켜 가이드라인(미도시)을 따라 스스로 안전 주행 시킬 수 있다. 영상정보는 몸체부의 전방을 촬영하는 정보를 의미할 수 있다. 제어정보는 몸체부 또는 이동부 중 하나 이상의 작동을 제어하는 정보를 의미할 수 있다. 가이드라인(미도시)은 무인주행 운반차량이 이동될 수 있는 레일 또는 작업 공간으로 마련될 수 있다. 가장 바람직하게 가이드라인은 작업 공간에 직선 또는 곡선 형태인 핑크색 선일 수 있으나, 반드시 이에 한정되 는 것은 아니며, 비전센서부에 인식되도록 빨강, 파랑 또는 노랑을 포함하는 채도가 강한 색의 선일 수 있 다. 또한, 가이드라인은 몸체부의 폭 방향에 맞춰 좌우 복선형으로 형성될 수 있어, 이동부가 분석부의 분석 내용에 따라 이동할 시 슬립 현상이 발생하는 것을 방지할 수 있다. 다시 말해, 가이드라인은 몸체부의 양측에 형성된 각 이동부가 이동하는 선으로 형성됨으로써, 이동부 가 작업공간 내에서 미끄러지는 사고를 방지할 수 있다. 여기서, 작업 공간은 무인주행 운반차량이 사용자에 의해 작업되는 공간 즉, 비가림차양, 노지 및 하우스시설을 포함하는 포도원으로 마련될 수 있으나, 반드시 이에 한정되지 않고, 포도 재배 가능한 모든 공간 또는 예초부 또는 약품분사부를 통해 포도원을 관리할 수 있는 모든 공간을 포함할 수 있다. 보다 구체적으로, 분석부는 비전센서부에서 생성된 영상정보를 OpenCV 라이브러리에 포함된 Canny edge detection 또는 허프 변환(hough transform) 알고리즘을 이용하여 가이드라인의 윤곽선, 기울기 및 방향을 검출하는 라인트레이싱을 진행할 수 있다. 여기서, OpenCV는 오픈 소스 컴퓨터 비전(Open Computer Vision) 라이브러리로, 실시간 이미지 프로세싱을 통하 여 객체 추적 가능한 알고리즘을 포함하고 있을 수 있다. 예컨대, 분석부는 OpenCV를 이용하여 영상정보를 분석함으로서, 상기에 언급한 알고리즘 이외에 무인주행 운반차량 주행 시 가이드라인 또는 장애물의 유무를 검출 가능한 모든 알고리즘을 사용할 수도 있다. Canny edge detection은 통상적으로 사용되는 엣지 찾기 알고리즘으로, 가우시안 필터를 이용하여 영상정보 내 의 노이즈를 제거한 후, 가이드라인 또는 장애물의 윤곽선(edge)의 픽셀 값을 0으로 만드는 이진화 작업을 진행 함으로써, 영상정보에서 윤곽선을 도출할 수 있다. 허프 변환은 상기 영상정보에서 도출된 윤곽선들의 교차점을 이용하여 상기 가이드라인의 기울기 및 방향을 검 출할 수 있다. 이러한 기울기 및 방향은 각 이동부의 이동속도 및 방향을 분석하는 데 사용될 수 있다. 즉, 분석부는 상기와 같은 알고리즘을 이용하여 라인트레이싱을 진행함으로써, 이동부의 이동 방향 및 속도를 분석할 수 있어, 사용자가 보다 간편하게 무인주행 운반차량의 이동 구간을 설정하게 할 수 있는 효과가 있다. 이때, 분석부는 영상정보에서 농업용 호스를 인식하였을 시, 상기 농업용 호스가 놓인 위치, 기울기 및 방 향을 이용하여 이동부의 경로를 탐색하는 라인트레이싱을 진행할 수도 있다. 또한, 분석부는 사용자로부터 조작정보를 입력 받는 조작부로부터 전달받은 이동부의 속도제어, 펌 핑부의 압력제어, 배출부의 배출방향 또는 배출속도 등의 조작정보를 분석할 수도 있다. 구체적으로, 분석부는 인공지능인 PID 제어(Proportional Integral Derivation Control) 및 피드 포워드 제어(feed forward control) 등을 이용하여 인공지능정보 또는 조작정보를 분석할 수 있다. 여기서, 조작정보는 사용자가 조작부를 통해 이동부의 이동 속도, 약품분사부의 약품 분사 속도, 예초부의 예초 정도 등을 입력한 정보일 수 있으나, 반드시 이에 한정되는 사항은 아니며, 무인주행 운반차 량이 작업 공간 내에서 작업을 진행할 수 있도록 사용자로부터 입력 받는 모든 정보들을 포함할 수 있다. 예컨대, 분석부는 감지정보 및 영상정보에 따라 분석정보를 갱신할 수 있어, 이동부가 판단부로부 터 제어정보를 받아 제어되는 이동속도로 이동되거나 사용자의 조작정보를 입력 받아 이동되도록 할 수 있다. 분석부는 PID 제어를 이용하여 작업공간을 파악하고 전진, 후진, 좌회전 및 우회전이 가능하게 움직일 수 있다. PID 제어(Proportional Integral Derivation Control)는 비례(Proportion), 적분(Integral), 미분 (Derivation)의 동작을 조합시켜서 사용하는 제어 방식이다. PID 제어(Proportional Integral Derivation Control)는 기본적으로 피드백(Feedback)제어의 구조를 가지고 있 으며, 제어하고자 하는 이동부의 출력을 측정하여 이를 사용자로부터 입력 받는 조작정보와 비교하여 오차 를 계산하고, 이 오차를 바탕으로 제어에 필요한 조작정보를 빠르고 정확하게 출력할 수 있다. 분석부는 PID 제어(Proportional Integral Derivation Control)를 이용하여 조작정보, 감지정보 또는 영상 정보를 분석하여 현재 이동부의 이동 속도 또는 약품분사부의 약품 분사 속도를 사용자로부터 입력 받 은 조작정보의 수치로 빠르고 정확하게 출력할 수 있다. 이때, 감지정보는 몸체부가 이동될 시, 근접센서부 에서 몸체부의 사방 또는 팔방에 위치하는 장애물 또는 작업 공간 내의 요철(凹凸) 부분 등이 인식되 는 정보일 수 있다. 예를 들어, 작업 공간에 경사 또는 미끄럼 구간이 형성되었을 경우, 분석부는 근접센서부에서 감지된 경사 또는 미끄럼 구간을 PID제어를 통해 분석함으로써, 하기 제어부에서 이동부가 경사 또는 미끄럼 구간으로 이동하지 않도록 할 수 있다. 즉, 분석부는 PID제어를 통해 무인주행 운반차량이 미끄러지지 않고 운전될 수 있는 구간을 계산하여 무인 주행 운반차량이 전진 또는 후진하게 할 수 있어, 무인주행 운반차량의 사고 피해를 저하시킬 수 있는 효과가 있다. 이에 따라, 분석부는 상술된 PID 제어(Proportional Integral Derivation Control)를 이용하여 조작부(3 5)로부터 전달받은 조작정보, 센서부로부터 제공받은 장애물을 인식한 감지정보 및 몸체부의 전방을 촬 영하여 생성된 영상정보를 분석한 분석정보를 판단부로 전달하며, 전달받은 분석정보를 판단부에서 판 단하여 무인주행 운반차량의 이동을 조정할 수 있다. 또한, 분석부는 피드 포워드 제어(feedforward control system) 방식으로 주행하려는 경로에 미리 산출된 적정주행속도를 토대로 분석정보를 생성할 수 있다. 분석정보는 피드 포워드 제어(feedforward control system) 방식으로 작업 공간에 장애물이 파악되는 것을 예측 한 정보이다. 예측한 상황이 발생 시 분석부에서 미리 예측한 분석정보를 판단부로 전달하여 빠르게 동 작될 수 있는 정보를 나타낸다. 피드 포워드 제어(feedforward control system)는 외부 변화를 측정하여 그 변화의 영향으로 제어 결과가 목표 치를 벗어날 것을 예측하고 미리 필요한 조작을 하는 제어기능이다. 예를 들어, 무인주행 운반차량의 전방 또는 측방에 장애물이 갑자기 생겼을 시, 분석부는 피드 포워드 제어 (feedforward control system)를 통해 센서부의 감지에 따라 이동부의 방향을 조절하여 갑자기 생성된 장애물을 피하거나 이동부의 속도를 줄여 장애물에 부딪히지 않는 방안을 분석할 수 있다. 판단부는 분석정보로부터 몸체부 또는 이동부 중 하나 이상의 작동을 판단하여 제어정보를 생성할 수 있다. 제어정보는 분석부로부터 분석정보를 전달받아 몸체부, 이동부, 예초부 및 약품부사부를 제어할 수 있는 정보를 나타낸다. 판단부는 분석부로부터 전달받은 분석정보를 판단하여 제어정보를 생성하고, 생성된 제어정보를 통신부 로 전달하며 제어정보를 전달 받은 통신부는 제어정보를 이동부로 전달하여 무인주행 운반차량의 속도를 제어하도록 할 수 있다. 통신부는 판단부에서 생성된 제어정보를 몸체부, 이동부, 예초부 및 약품분사부에 전 달할 수 있다. 통신부는 외부서버와 통신하여 인공지능 정보를 수집할 수도 있다. 조작부는 사용자로부터 조작정보를 입력받을 수 있다. 조작정보는 사용자가 무인주행 운반차량을 제어하기 위하여 조작부를 통해 수동 또는 원격으로 입력하는 정 보를 말할 수 있다. 조작정보에 대한 설명은 상기에서 구체적으로 설명하였으므로 생략하기로 한다. 조작부는 수동조작이 가능하도록 몸체부의 일측에 조이스틱 및 버튼 등으로 형성될 수 있으며, 원격 조 작이 가능하도록 조작기 등의 단말로 형성되어 와이파이, 블루투스 및 RF통신 등으로 통신될 수 있으나, 이는 예시적인 것으로, 조작부가 사용자로부터 조작정보를 입력 받을 수 있는 모든 구성 또는 방법이 사용될 수 있다. 여기서, 조이스틱은 전진, 후진, 좌우 회전 및 360도 회전이 가능한 스틱으로, 사용자의 입력 방향에 따라 xyz 의 좌표 공간 내의 수치로 조작정보를 입력할 수 있다. RF통신은 무선 주파수를 방사하여 정보를 교환하는 통신 방법으로, 주파수를 이용하여 광대역 통신할 수 있으며, 환경 및 기후의 영향을 덜 받아 안정성이 높다. 주파수 대역은 일반적으로 30kHz 내지 300GHz이다. 즉, 조작부는 RF통신을 이용하여 100m 떨어진 거리에서도 사용자로부터 입력된 조작정보를 분석부 또는 몸체부로 전달할 수 있다. 또한, 조작부, 분석부 및 몸체부는 Serial통신을 이용하여 각 정보 또는 데이터를 교환할 수도 있 다. 센서부는 몸체부 사방의 장애물을 파악할 수 있다. 도 3을 참조하면, 센서부는 근접센서부 및 비전센서부를 포함할 수 있다. 근접센서부는 몸체부가 이동될 시 사방에 위치하는 장애물 또는 요철 등을 인식하여 감지정보를 생성 할 수 있다. 이를 위해, 근접센서부는 몸체부의 외부에 형성될 수 있으나, 반드시 이에 한정되는 사항 은 아니며, 무인주행 운반차량의 운전 구간에 형성된 장애물 또는 요철을 인식할 수 있는 모든 위치에 형성될 수 있다. 근접센서부는 생성한 감지정보를 판단부로 전달하며, 감지정보를 전달받은 판단부가 생성한 제어 정보를 통신부로 전달하고, 제어정보를 전달받은 통신부가 이동부, 예초부 및 약품분사부 로 제어정보를 전달하여 동작을 제어하도록 할 수 있다. 비전센서부는 조작부 하단에 형성되어 몸체부 전방의 영상을 촬영한 영상정보를 생성하는 것이 바 람직하나, 이에 한정하지는 않는다. 비전센서부는 생성한 영상정보를 분석부로 전달하여 상기 분석부에서 가이드라인 또는 장애물 위 치 등을 분석할 수 있도록 할 수 있다. 이후, 비전센서부는 분석부로부터 생성된 분석정보를 통해 판단부가 제어정보를 생성하여 이동부 , 예초부 및 약품분사부로 보내어 동작을 제어하도록 할 수 있다. 이에 대한 구체적인 작동 설명은 상기에서 설명하였으므로 생략하기로 한다. 비전센서부는 작업 공간을 파악하고, 제어부가 몸체부를 이동시킬 시 전진, 후진, 좌회전 및 우회 전이 가능하게 할 수 있다. 즉, 비전센서부는 무인주행 운반차량이 작업 공간을 벗어날 시 해당 작업 공간 을 찾아서 예초작업, 약품 또는 물을 분사하는 작업 등을 지속적으로 진행하는 데 도움을 줄 수 있다. 비전센서부는 HSV(Hue Saturation Value), RGB(Red, Green, Blue), CMYK(Cyan, Magenta, Yellow, blac K)등이 이용될 수 있으며, HSV(Hue Saturation Value)를 이용하는 것이 가장 바람직하다. HSV(Hue Saturation Value)는 색상(H), 채도(S), 명도(V)로 색을 지정하는 방법을 이용할 수 있다. RGB(Red, Green, Blue)는 빛의 삼원색인 빨간색(Red), 녹색(Green), 파란색(Blue)로 색을 지정하는 방법을 이 용할 수 있다. CMYK(Cyan, Magenta, Yellow, blacK)는 청록색(Cyan, 시안), 자홍색(Magenta, 마젠타), 노랑색(Yellow, 옐로), 검정색(blacK, 블랙)로 색을 지정하는 방법을 이용할 수 있다. 가장 바람직하게, 비전센서부는 HSV를 이용하여 영상정보를 생성할 수 있으며, 생성된 영상정보는 분석부 로 전달되어 각 색이 지정된 위치가 좌표 상에서 표시될 수 있다. 다시 말해, 비전센서부는 HSV(Hue Saturation Value)를 통해 장애물을 색상, 채도 명도의 좌표를 써서 특 정한 색을 지정하여 무인주행 운반차량이 장애물을 피하면서 약품 또는 물을 주는 작업을 진행할 수 있게 지원 할 수 있다. 또한, 제어부는 감지정보를 받아서 부저(미도시)로 감지정보를 전달할 수 있다. 부저는 감지정보를 전달받아 경고음을 발생시킬 수 있으며, 사용자에 의해 조작부를 통해서 경고음이 종료 될 수 있다. 이때, 경고음의 소리크기 또는 동작시간은 사용자에 의해 기 설정 될 수 있다. 부저는 몸체부가 작업 공간에 진입 시 또는 작업 공간에서 빠져나올 시 3초 내지 8초 동안 경고음을 울릴 수 있다. 제어부는 무인주행 운반차량을 전기적으로 동작되게 전기를 충전 및 방전하게끔 배터리를 포함할 수 있다. 여기서, 배터리는 납, 리튬, 리튬인산철, 리튬 이온, 리튬 폴리머 중 하나 이상을 포함할 수 있으나, 이에 한정 되지는 않는다. 한편, 예초부는 몸체부의 하단에 형성되어 예초를 진행할 수 있으며, 예초부는 약품분사부가 사용자에 의해 탈거된 이후 사용될 수 있다. 도 4를 참조하면, 예초부는 예초하우징부, 커터부 및 안전가드를 포함할 수 있다. 예초하우징부는 몸체부의 하단에 탈착 가능하게 형성될 수 있다. 예초하우징부는 볼트(미도시), 너트(미도시)로 결합되는게 바람직하나, 이에 한정하지는 않는다. 예초하우징부는 삼각형의 모형으로 형성되는 것이 바람직하나, 반드시 이에 한정되는 것은 아니다. 예초하우징부는 예초작업 수행 시 지면에서 40mm 내지 60mm로 밀착할 수 있다. 예초하우징부의 하단에 는 커터부가 형성될 수 있다. 커터부는 개별 모터(미도시)에 각각 연결되어 회전 작동될 수 있다. 커터부는 회전 작동되지 않는 문제 가 발생 시 개별 모터와 각각 따로 교체될 수 있다. 커터부는 적어도 하나 이상으로 형성되나 가장 바람직하게는 세 개로 형성될 수 있다. 커터부는 예초하우징부의 하면에 형성되며 예초를 진행할 수 있다. 이때, 커터부는 안전가드가 작업 공간에 진입될 시 예초작업을 수행할 수 있다. 또한, 커터부는 강판 레이저 절곡 방식으로 제조될 수 있으나, 반드시 이에 한정되는 사항은 아니며, 통상 적으로 사용되는 커터가 적용될 수도 있다. 안전가드는 예초하우징부의 전방에 형성되며, 지면 방향으로 돌출될 수 있다. 안전가드는 사용자의 부상을 예방하기 위해 예초하우징부의 폭 방향을 따라 형성될 수 있다. 여기서, 폭 방향은 몸체부 정면에서 바라볼 시 가로방향을 의미한다. 안전가드는 예초작업을 수행하는 중 커터부의 파편, 튕겨 나온 돌멩이 등을 막아줌으로써 사용자의 부 상을 예방할 수 있다. 도 5를 참조하면, 약품분사부는 몸체부의 외부에 형성될 수 있다. 약품분사부는 몸체부의 상측 에 형성되어 적재된 약품을 보관 및 분사할 수 있다. 또한, 약품분사부는 예초하우징부가 사용자에 의해 탈거된 이후 사용될 수 있다. 약품분사부는 보관부, 펌핑부 및 배출부를 포함할 수 있다. 보관부는 몸체부의 상측에 탈착 가능하게 형성되며 약품 또는 물 160 내지 200L를 보관할 수 있다. 약품 및 물은 사용자에 의해 혼합된 상태로 보관부에 보관될 수 있다. 약품은 포도 농사 시 필요한 농약 또 는 영양제로 구성될 수 있다. 보관부는 몸체부의 상측에 결합되는게 바람직하나, 이에 한정하지는 않는다. 또한, 보관부는 내부에 날개(미도시)가 형성될 수 있다. 날개는 보관부내에 투입된 약품 또는 물이 섞이도록 하거나 혼합된 약품들을 지속적으로 회전시켜 침전을 방지할 수 있다. 날개는 제어부를 통해 좌측방향 또는 우측방향으로 회전될 수 있다. 보관부는 가운데 상단부분에 뚜껑이 형성될 수 있다. 뚜껑은 보관부에 이물질이 들어가거나 보관부에 저장되어 있는 내용물이 흐르는 것을 방지할 수 있다. 펌핑부는 보관부에 보관되는 약품 또는 물이 외부로 배출되도록 압력을 조절할 수 있다. 펌핑부는 보관부 타측면에 위치될 수 있다. 펌핑부는 보관부와 연결되며, 보관부로부터 공급받은 약품 또는 물이 배출되도록 압력을 조절할 수 있다. 이때, 압력은 10 내지 40bar로 적용될 수 있다. 또한, 펌핑부는 보관부에서 14 내지 22L를 흡입하여 배출부에서 분사 또는 직사로 포도에 약품을 뿌릴 수 있게 할 수 있다. 펌핑부는 고압펌프 또는 고압동력분무기 중 하나로 마련될 수 있으나, 이에 한정되는 것은 아니다. 배출부는 몸체부의 배면에 위치되어 형성될 수 있다 배출부는 메인지지부, 이송관 및 분사노즐를 포함할 수 있다. 메인지지부는 몸체부의 후방에 형성될 수 있다. 메인지지부는 사용자에 의해 볼트(미도시), 너트(미도시)로 펌핑부 측면에 탈착되는 위치의 상부에 결 합되는게 바람직하나, 이에 한정하지는 않는다.메인지지부는 펌핑부로부터 이송관이 연결될 수 있다. 이송관은 분사노즐이 형성되는 위치를 따라 길게 형성될 수 있다. 이송관은 보관부와 펌핑부를 연결하여 보관부에 보관되는 약품 또는 물을 펌핑부로 이동 하게 형성될 수 있다. 이송관은 메인지지부에 연결되고, 펌핑부로부터 전달된 약품 또는 물이 이동하게 형성될 수 있다. 분사노즐은 이송관의 길이 방향을 따라 적어도 하나 이상이 형성되어 약품을 배출할 수 있다. 분사노즐은 배출부에 연결되어 포도원에 약품 또는 물을 분사시킬 수 있다. 다시 말해, 분사노즐(53 3)은 몸체부가 작업 공간에 진입 시 펌핑부로부터 공급받은 약품 또는 물을 배출할 수 있다. 분사노즐은 약품 또는 물을 배출하는 부분에 솔레노이드 밸브(미도시)가 구비될 수 있다. 여기서, 솔레노 이드 밸브는 분사노즐의 직경을 조절할 수 있다. 분사노즐은 제어부를 통해서 분사 세기 및 방향 등이 원격으로 조절될 수 있다. 구체적으로, 분사노즐은 작업 공간에 진입 시 제어부에서 제어정보를 전달받아 100RPM 내지 900RPM에 서 작동될 수 있다. 분사노즐의 RPM은 800RPM 내지 900RPM 으로 설정하는 것이 바람직하나, 이에 한정하지 는 않는다. RPM은 분사노즐이 1분 동안 몇 번의 회전을 하는지 나타내는 단위이다. 분사노즐의 회전 방향은 메인지지부를 기준으로 상하방향 또는 좌우방향으로 회전하는게 바람직하지 만, 이에 한정하지는 않는다. 분사노즐의 상하방향중 상방향은 상부지지대의 상부를 향하며, 하방향은 하부지지대의 하부를 향하도록 설정될 수 있다. 분사노즐의 우방향은 보관부 방향으로 향하며, 좌방향은 우방향의 반대방향으로 지칭될 수 있다. 분사노즐은 판단부에 의해 동작되거나 일시 정지될 수 있다. 분사노즐의 각도는 사용자에 의해 조작부를 통해서 작업 공간에 조성된 포도의 위치에 따라 조절될 수 있다. 예를 들어, 분사노즐은 약품 또는 물을 평상시에는 지지대의 길이방향으로 상측으로 분사될 수 있으며, 사 용자의 선택 시 수평방향으로 분사될 수 있거나 메인지지부 위치를 기준으로 하방대각선 30° 내지 60°로 설정될 수 있으나, 이에 한정되지는 않는다. 또한, 펌핑부에서 10 내지 40bar 압력에 0.2 내지 0.75KW의 출력으로 작동하여, 원형 또는 일자형 노즐타입 에 직경 1.8φ인 분사노즐이 약 또는 물을 뿌릴 수 있게 할 경우, 분사노즐의 분무 토출량은 하기 표 1과 같이 나타날 수 있다. 표 1 분판직경 분무 토출량(ℓ/min) 분사각(°) (2.0MPa)도달거리(m) (2.0MPa/직사) 0.5MPa1.0MPa2.0MPa 1.8φ 분사 3.8 4.5 5.1 ~60 8.0 직사 5.9 6.9 7.8 이에 따라, 분사노즐은 상술된 바와 같이 회전하여 약품 또는 물을 다양한 각도로 분사할 수 있어, 무인주 행 운반차량이 작업 공간을 지나가는 시간 동안 고르게 약품 또는 물이 분사되도록 할 수 있다. 도 6을 참조하면, 몸체부에 예초부 및 약품분사부가 모두 형성될 수도 있다. 즉, 본 발명의 실시예 에 따른 무인주행 운반차량은 상술된 바와 같이 예초부 및 약품분사부가 각각 따로 사용하는 것도 가능 하나, 모두 부착된 상태에서도 작동할 수 있다. 몸체부에 예초부가 탈착될 시 방제기로 사용할 수 있으며, 약품분사부가 탈착될 시 예초기로 사용 할 수 있다. 즉, 방제기 또는 예초기로 구분하기 위해 예초부 또는 약품분사부가 탈착되는 것이 바람직 하다. 이하에서는, 본 발명의 다른 실시예에 따른 무인주행 운반차량에 대해 구체적으로 설명하기로 한다. 도 7은 본 발명의 다른 실시예에 따른 무인주행 운반차량의 예초부를 나타낸 저면사시도이고, 도 8a는 도 7에 도시된 예초하우징부가 하강된 모습을 나타낸 작동예시도이며, 도 8b는 도 7에 도시된 예초하우징부가 상승된 모습을 나타낸 작동예시도이고, 도 9는 본 발명의 다른 실시예에 따른 무인주행 운반차량의 약품분사부의 모습 을 나타낸 배면사시도이며, 도 10a는 도 9에 도시된 메인지지부가 상승하기 전의 모습을 나타낸 작동예시도이고, 도 10b는 도 9에 도시된 메인지지부가 상승된 모습을 나타낸 작동예시도이며, 도 11은 본 발명 의 다른 실시예에 따른 무인주행 운반차량에 예초부 및 약품분사부가 모두 형성된 모습을 보여주는 예시도이다. 도 7 내지 도 11을 참조하면, 본 발명의 다른 실시예에 따른 무인주행 운반차량의 예초부는 리프트부를 더 포함할 수 있으며, 메인지지부는 체결부, 하부지지대 및 제2 리프트실린더를 포함할 수 있다. 여기서, 리프트부, 체결부, 하부지지대, 제2 리프트실린더 및 상부지지대를 제외 하고, 본 발명의 다른 실시예에 따른 무인주행 운반차량은 상기에서 설명한 본 발명의 실시예에 따른 무인주행 운반차량과 실질적으로 동일할 수 있다. 따라서, 리프트부, 체결부, 하부지지대, 제2 리프트실린더 및 상부지지대에 대해 서만 설명하기로 한다. 도 7 내지 도 8b를 참조하면, 리프트부는 공간 및 제1 리프트실린더를 포함할 수 있다. 리프트부는 예초하우징부와 연결되어 예초하우징부를 상승 또는 하강시킬 수 있다. 공간은 몸체부의 내부에 위치되며 예초하우징부가 상승 또는 하강으로 이동되게 형성될 수 있다. 다시 말하면, 공간은 예초하우징부가 상승 또는 하강으로 이동되게 예초하우징부가 형성되는 몸체 부의 하부 일측에 형성될 수 있다. 공간에 제1 리프트실린더가 위치될 수 있다. 제1 리프트실린더는 공간에 예초하우징부와 연결되도록 형성되어 상승 또는 하강될 수 있다. 제1 리프트실린더는 내부에 유압 또는 고압을 인가하면 제1 리프트실린더가 예초하우징부를 상승 또는 하강시킬 수 있다. 제1 리프트실린더는 신장과 수축이 가능한 유압실린더 또는 고압실린더로 마련될 수 있다. 리프트부는 예초작업이 일시적으로 끝나고 몸체부가 이동될 시, 지면에서 150mm 내지 250mm로 리프팅되 어 안전사고를 방지할 수 있다. 또한, 리프트부는 예초작업 중 일시중지 상태로 전환 시 몸체부가 이동되지 않아도 리프팅될 수 있다. 도 9 내지 도 10b을 참조하면, 메인지지부는 체결부, 하부지지대, 제2 리프트실린더 및 상부지지대를 포함할 수 있다. 체결부는 몸체부에 연결될 수 있다. 하부지지대는 체결부에 의해 몸체부에 고정될 수 있다. 제2 리프트실린더는 하부지지대의 상측에 형성될 수 있다. 상부지지대는 분사노즐이 연결되고, 제2 리프트실린더의 상측에 형성되어 제2 리프트실린더 에 의해 상승 또는 하강될 수 있다. 상부지지대는 상승 또는 하강되어 분사노즐의 높이 조절 에 도움될 수 있다. 제2 리프트실린더는 신장과 수축이 가능한 유압실린더 또는 고압실린더로 마련될 수 있으나, 이에 한정되 지는 않는다.제2 리프트실린더는 내부에 유압 또는 고압이 인가되면 상부지지대를 상승 또는 하강시킬 수 있다. 이에 따라, 사용자는 작업 공간에 맞추어 상부지지대의 높이를 조절할 수 있다. 도 11을 참조하면, 몸체부에 예초부 및 약품분사부가 모두 형성될 수 있다. 즉, 본 발명의 다른 실 시예 따른 무인주행 운반차량은 상술된 바와 같이 예초부 및 본 발명의 실시예 따른 무인주행 운반차량은 상술된 바와 같이 약품분사부가 각각 따로 사용하는 것도 가능하나, 모두 부착된 상태에서도 작동할 수 있 다."}
{"patent_id": "10-2023-0075650", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이상으로 첨부된 도면을 참조하여 본 발명의 실시예를 설명하였으나, 본 발명의 속하는 기술분야에서 통상의 지 식을 가진 자는 본 발명의 기술적 사상이나 필수적인 특징을 변경하지 않고 다른 구체적인 형태로 실시할 수 있 다는 것을 이해할 수 있을 것이다. 따라서 이상에서 기술한 실시예는 모든 면에서 예시적인 것이며 한정적이 아 닌 것이다."}
{"patent_id": "10-2023-0075650", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 무인주행 운반차량의 모습을 나타낸 사시도이다. 도 2는 본 발명의 실시예에 따른 무인주행 운반차량의 제어부의 구성을 나타내기 위한 블록구성도이다. 도 3은 도 2에 도시된 센서부의 구성을 나타내기 위한 블록구성도이다. 도 4는 도 1에 도시된 몸체부에 예초부가 더 형성된 모습을 나타낸 저면사시도이다. 도 5는 도 1에 도시된 몸체부에 약품분사부가 더 형성된 모습을 나타낸 배면사시도이다. 도 6은 도 1에 도시된 몸체부에 예초부 및 약품분사부가 모두 형성된 모습을 나타낸 예시도이다. 도 7은 본 발명의 다른 실시예에 따른 무인주행 운반차량의 예초부를 나타낸 저면사시도이다. 도 8a 및 도 8b는 도 7에 도시된 예초하우징부의 작동예시도이다. 도 9는 본 발명의 다른 실시예에 따른 무인주행 운반차량의 약품분사부의 모습을 나타낸 배면사시도이다. 도 10a 및 도 10b는 도 9에 도시된 메인지지부의 작동예시도이다. 도 11은 본 발명의 다른 실시예에 따른 무인주행 운반차량에 예초부 및 약품분사부가 모두 형성된 모습을 보여 주는 예시도이다."}
