{"patent_id": "10-2023-0047114", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0151065", "출원번호": "10-2023-0047114", "발명의 명칭": "문자 정보를 기록하는 음성 신호 재생 장치", "출원인": "주식회사 인디체", "발명자": "변정수"}}
{"patent_id": "10-2023-0047114", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "제 1 항에 있어서,상기 토픽 데이터는 상기 디지털 화상 데이터 및 상기 디지털 음성 데이터중 하나와연관되며, 상기 배열수단은, 상기 비디오 영역의 상기 부수 정보 영역내에 상기 디지털 화상 데이터와 연관된토픽 데이터를제공하며, 상기 오디오 영역의 상기 부수 정보 영역 내에 상기 디지털 음성 데이터와 연관된 토픽데이터를 제공하는, 디지털 화상 및 디지털 음성 데이터 기록 장치.상기 메뉴 데이터는 상기 토픽 데이터가 위치되는 트랙의 각각의 영역을 지시하는 위치 데이터를포함하며, 상기 기록 수단은 각각의 상기 연속적인 트랙들의 상기 서브 코드 영역 내에 상기 위치를 기록하는, 디지털 화상 및 디지털 음성 데이터 기록 장치. 각각의 트랙의 상기 비디오 및 오디오 영역들 내에 기록된 데이터의 내용을 식별하는 목차 데이터(tableof-content data)를 생성하기 위한 수단을 더 포함하며, 상기 기록 수단은 각각의 상기 연속적인 트랙들의상기 서브 코드 영역내에 상기 목차 데이터를 기록하는, 디지털 화상 및 디지털 음성 데이터 기록 장치. 상기 기록 수단은 기록된화상 및 음성 데이터를 이미 갖고 있는 트랙들 위에 상기 목차 데이터를 애프터레코딩(after record)하도록 조작 가능한, 디지털 화상 및 디지털 음성 데이터 기록 장치.상기 목차 데이터는 식별 토픽 목차(identifyingtopic table of contents)를 포함하며, 상기 메뉴 데이터는 상기 식별 토픽 목차를 포함하는, 디지털 화상 및디지털 음성 데이터 기록 장치"}
{"patent_id": "10-2023-0047114", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 실시 예에 따른 음성신호 및 텍스트가 매칭된 데이터베이스의 구축방법은 제1 텍스트와 매칭된 제1 음 성신호 및 텍스트가 매칭되지 않은 제2 음성신호를 포함하는 캡챠용 음성신호를 제공하는 단계, 캡챠용 음성신호 에 대한 제1 및 제2 입력 텍스트를 요청하는 단계, 제1 및 제2 입력 텍스트가 수신된 경우 제1 텍스트와 제1 입 력 텍스트를 비교하는 단계, 및 제1 텍스트와 제1 입력 텍스트가 일치할 경우 제2 음성신호와 제2 입력 텍스트를 매칭하여 저장하는 단계를 포함한다.본 발명의 실시 예는 인공 지능(Artificial Intelligence) 모듈, 드론 (Unmanned Aerial Vehicle, UAV), 로봇,증강 현실(Augmented Reality, AR) 장치, 가상 현실(virtual reality, VR) 장치, 5G 서비스와 관련된 장치 등과연계될 수 있다. 공개특허10-2024-0151065 CPC특허분류 G06F 40/279 (2020.01)명 세 서 청구범위 청구항 1 제 1 항에 있어서,상기 토픽 데이터는 상기 디지털 화상 데이터 및 상기 디지털 음성 데이터중 하나와 연관되며, 상기 배열수단은, 상기 비디오 영역의 상기 부수 정보 영역내에 상기 디지털 화상 데이터와 연관된 토픽 데이터를제공하며, 상기 오디오 영역의 상기 부수 정보 영역 내에 상기 디지털 음성 데이터와 연관된 토픽 데이터를 제공하는, 디지털 화상 및 디지털 음성 데이터 기록 장치.상기 메뉴 데이터는 상기 토픽 데이터가 위 치되는 트랙의 각각의 영역을 지시하는 위치 데이터를포함하며, 상기 기록 수단은 각각의 상기 연속적인 트랙들 의 상기 서브 코드 영역 내에 상기 위치를 기록하는, 디지털 화상 및 디지털 음성 데이터 기록 장치. 각각의 트 랙의 상기 비디오 및 오디오 영역들 내에 기록된 데이터의 내용을 식별하는 목차 데이터(tableof-content dat a)를 생성하기 위한 수단을 더 포함하며, 상기 기록 수단은 각각의 상기 연속적인 트랙들의상기 서브 코드 영역 내에 상기 목차 데이터를 기록하는, 디지털 화상 및 디지털 음성 데이터 기록 장치. 상기 기록 수단은 기록된 화상 및 음성 데이터를 이미 갖고 있는 트랙들 위에 상기 목차 데이터를 애프터레코딩(after record)하도록 조 작 가능한, 디지털 화상 및 디지털 음성 데이터 기록 장치.상기 목차 데이터는 식별 토픽 목차(identifying topic table of contents)를 포함하며, 상기 메뉴 데이터는 상기 식별 토픽 목차를 포함하는, 디지털 화상 및 디지털 음성 데이터 기록 장치 발명의 설명"}
{"patent_id": "10-2023-0047114", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "발명이 속하는 기술분야 및 그 분야의 종래기술 산업상의 이용분야 본 발명은 화상 신호 및 음성 신호를 기록 재생하는 화상 음성 신호 기록 재생 장치에 관한 것이다.종래의 기술 종래에는, 화상 신호나 음성 신호를 기록 재생하는 장치가 여러 종류 실시되어 있다. 이 같은 장치에 있어서 화상 신호나 음성 신호를 기록할 때 동시에 이들신호에 부수되는 정보도 기록 재생하는 것이 고려되었다. 이들 장치에서, 예컨대 서브 코드 영역 등에 화상 신호나 음성 신호에 부수하는 정보를 기록하게 되어 있으며 음성신호 및 텍스트가 매칭된 데이터베이스의 구축 방법은 제1 텍스트와 매칭된 제1 음성신호 및 텍스트가 매칭되지 않은 제2 음성신호를 포함하는 캡챠용 음성신 호를 제공하는 단계, 캡챠용 음성신호에 대한 제1 및 제2 입력 텍스트를 요청하는 단계, 제1 및 제2 입력 텍스 트가 수신된 경우 제1 텍스트와 제1 입력 텍스트를 비교하는 단계, 및 제1 텍스트와 제1 입력 텍스트가 일치할 경우 제2 음성신호와 제2 입력 텍스트를매칭하여 저장하는 단계를 포함한다.본 발명의 실시 예는 인공 지능 (Artificial Intelligence) 모듈, 드론(Unmanned Aerial Vehicle, UAV), 로봇,증강 현실(Augmented Reality, AR) 장치, 가상 현실(virtual reality, VR) 장치, 5G 서비스와 관련된 장치 등과연계될 수 있다.음성신호 및 텍 스트가 매칭된 데이터베이스의 구축방법 및 이를 위한 시스템, 이를 기록한 컴퓨터 판독 가능한 기록매체에 관 한 것으로, 특히 캡챠 시스템을 활용하여 음성신호와 텍스트가 매칭된 데이터베이스를구축"}
{"patent_id": "10-2023-0047114", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "사용자의 제어에 의해서 동작하는 기기들은 사용자가 제어 동작을 수행할 수 있는 사용자 인터페이스를 제공한 다. 사용자 인터페이스는 기기 자체의 기능 및 동작을 직접 컨트롤하는 방식에서 점차적으로 사용자들의 물리적 힘을 적게 요구하면서 직관적인 동작으로 제어될 수 있는 방향으로 개발되고 있다. 근래에는 사용자의 음성을 파악하고 이를 바탕으로 특정 동작을 수행하는 음성인식 기능을 기반으로 동작하는 음성인식 기반의 기기들이 늘어나고 있다. 음성으로 표현되는 언어는 자연인에게 가장 자연스러운 의사소통 수단이기 때문에 음성인식기반 의 기기들은 매우 직관적이며 사용이 편리한 장점이 있다.화상 신호나 음성 신호에 부수한 문자 정보를 기록 재 생할 수 있게 구성된 종래의 화상 음성 기록 재생 장치에서는 기록된 문자 정보를 재생하는 경우에 모두 기록된 문자 정보를 재생하고 있었다. 따라서, 고속으로 필요한 문자 정보만을 검색할 수 없다는 문제가 있었다. 즉, 기록된 문자 정보 모두를 재생 출력하고있었으므로 불필요한 문자 정보까지 재생되고 있었다. 또한, 이와 같은 문자 정보를 기록할 수 있는 화상 음성 신호 기록 재생 장치에 있어서, 상술한 바와 같이문자 방송의 데이 터도 취급할 수 있게 구성한 경우에, 문자 방송의 데이터를 복호하고 표시하기 위한 하드웨어와 소프트웨어, 및 문자 정보를 복호하고, 표시하기 위한 하드웨어 및 소프트웨어의 양쪽을 구비한 시스템이 필요하게 되며 회로구성의 규모가 커져서 경제적으로 바람직하지 못한 문제가 있었다.과제를 해결하기 위한 수단본 발명에 있어서, 화상 신호 및 음성 신호에 부수하는 부수 정보를 기록하는 부수 정보 영역을 화상 신호및 음성 신호의 기록 영 역과는 따로 설치하고 또한, 상기 화상 및 음성 신호에 부수한 문자 정보의 내용에의해서 설치된 내용 식별 정 보와, 이 식별 정보와 상기 문자 정보의 내용과의 대응을 정의하는 정보를 상기 부수 정보 영역에 기록하도록 디지털 화상 음성 신호 기록 재생 장치를 구성한다.이 경우, 상기 문자 정보가 기록되어 있는 기록 매체 상의 위치를 나타내는 위치 정보도 상기 부수 정보영역에 기록하도록 구성한다. 또는, 상기 부수 정보 영역을 화상 신호에 부수하는 정보가 기록되는 제 1부수 정보 영역과, 음성 신호에 부수하는 정보가 기록되는 제 2 부수 정 보 영역과, 상기 제 1, 제 2 이외의 부수 정보가 기록되는 제 2 부수 정보 영역과, 상기 제 1, 제 2 이외의 부 수 정보가 기록되는 제 3 의부수 정보 영역으로 분할된 구성으로 하는 것이 바람직하다.또한, 부수 정보 영역을 이같이 3 분할된 구성으로 한 경우에 있어서, 영상,음성에 기록된 정보의 내용을나타내는 목차 정보를 정보 영 역에 반복 기록하는 구성을 채용할 수도 있다. 또한, 이목차 정보 내의 개개의 목차항목에 대해서 목차 항목을 기록한 기록 매체 상의 위치가, 그 목차 항목이 나타내는 화상. 음성 신호의 기록 위치와 일치하고 있는지 아닌 지를 나타내는 정보를 부가해서 기록하고, 재생 시에는 그 정보를 판독함으로써 상기 목차 정보 중의 어느목차 항목을 재생중인가를 판별할 수 있게 하는 구성도 채용된다. 또한, 본 발명에 있어서, 화상 신호 및 음성 신호 외에 문자 정보를 기록 또는 재생하는 기능을 구비하며,또한, 기록하는 문자 코드로서 문자 방송에서 사용되고 있는 문자 코드를 사용할 수 있도록 화상 음성 신호 기록 재생 장치를 구성한다. 또한, 본 발명에 있어서, 화상 신호 및 음성 신호 외에 문자 정보를 기록 또는 재생하는 기능을 구비하며,또한, 문자 정보를 표시하기 위한 제 어 코드로서 문자 방송에서 사용되어 있는 제어 코드를 사용하도록 화상 음성 신호 기록 재생 장치를 구성한다. 또한, 본 발명에 있어서, 화상 신호 및 음성 신호 외에 문자 정보를 여러 가지 언어에 의해서 기록 또는재생되 는 기능을 구비하며, 또한, 문자 정보의 기록시에는 기록되는 문자 정보의 언어의 종류에 따라 식별정보를 그 문자 정보에 부여해서 기록하고, 재생 시에 그 식별 정보를 지정함으로써 이 지정된 식별 정보가 부여되어 있는 언어의 문자 정보만을 선택할 수 있도록 화상 음성 신호 기록 재생장치를 구성한다. 작용 식별 정보와 문자 정 보의 내용과의 대응을 정의하는 정보에 기초하여 희망하는 내용의 문자 정보만을 검색하는 동작이 실행된다. 또 한, 문자 정보의 검색에 있어서 문자 정보가 기록되어 있는 기록 매체 상의 위치를 나타내는 정보에 기초하여 희망하는 문자 정보가 기록되어 있는 기록 영역만을 검색하는 동작이 실행된다. 목차 정보가 반복 기록되어 있 다는 것에서 재생 시 어느 테이프 위치로부터도 신속하게 목차 정보를얻을 수 있고, 또한, 어느 목차 항목을 재 생중인가를 판별할 수 있다. 문자 정보의 기록 시에 사용하는 문자 코드 또는 제어 코드로서 문자 방송에 있어 서 사용되고 있는 것을사용함으로써 문자 정보의 재생시의 복호 표시를 위한 시스템으로서 문자 방송 수신용의 시스템을 공용할수 있다. 언어의 종류에 따른 식별 정보를 부여해서 문자 정보를 기록함으로써 재생시, 희망하 는 언어에 의한 문자정보만을 선택할 수 있다."}
{"patent_id": "10-2023-0047114", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술한 필요성 및/또는 문제점을 해결하는 것을 목적으로 한다. 본 발명은 비용 및 시간을 절약하면 서 음성인식 모델용 데이터베이스를 구축하기 위한 것이다 디지털 VTR의 기록 포맷 구성하는 디지털 VTR의 1 트 랙의 기록 포맷을 도시한다. 이 도면에 있어서 트랙의양단에는 마진이 설치된다. 그 내 측에 기록 시간 측으로 부터 후기록를 확실하게 행하기 위한 T-SYNC영역, 음성 신호를 기록하는 오디오 영역, 화상 신호를 기록하는 비 디오 영역, 그리고 부차적 데이터를 기록하기 위한 서브 코드 영역이 설치된다. 또한, 각 영역간에는 편집 시의 마진과 치환 기록에 의한 잔상방지용의 프리앰블 및 포스트앰블이 설치되는 동시에 영역 확보를 위한 내부블록 갭(IBG)이 설치된다. 다음에 상기의 각 영역에 기록되는 데이터의 상세를 설명한다. T-SYNC 영역 이 영역은 제 3 도의 에 도시된 바와 같이 53 개의 동기 블록으로 구성되며 318 바이트의 데이터 량을갖는다. 1 동기 블록은 동일한 6 바이트의 데이터 길이를 가지며 2 바이트(16 비트)의 동기 데이터와 3 바이트의 ID 부[ID0, ID1 및 IDP(패리티)]와 1 바이트의 더미 데이터로 구성된다. 또한, 서보를 위한 신호(통칭 ATF 신호)는 이 영역 에 포개서 버스트적으로 기록되거나 트랙 전체에 기록되거나 한다. 오디오 영역 이 기록 신호에 대한 프 레이밍 처리 및 오류 정정 부호 부가를 행한 포맷을 또, 그 1 동기의 블록의 구성을 동일한 에 도시한다.에 있 어서, 기록되는 오디오 데이터는 1 트랙에서 9 동기 블록분이 있으며 이것에 대해서 8바이트의 수평 패리티(C 1)와 5 동기 블록 분의 수직 패리티(C2)가 부가된다. 1 동기 블록은 90 바이트로구성되며 오디오 데이터의 선두 에는 5 바이트의 부수 정보를 격납하는 영역 AAUX가 설치된다 비디오 영역 이 영역의 기록 신호에 대한 프레이 밍 처리 및 오류 정정 부호 부가를 행한 포맷을 비디오 데이터는 27 개의 버퍼링 유닛 BUFO-FUF26의 영역 내에 기록되는 동시에 이 영역에 인접해서 부수 정보를 기록하는 영역 VAUX가 도면의 α, β, ｒ로서 나타내어지듯이3 동기 블록 분설치된다. 이것들에 대해서 8 바이트의 수평 패리티(C1)와 11 동기 블록 분의 수직 패리티가부가 된다.또, 버퍼링 유닛의 구성을 에 도시한다. 1 개의 버퍼링 유닛에는 동기 블록 5 개 분의 비디오 데이터가 격 납되며, 각 비디오 데이터의 선두 측의 1 바이트에는 양자화 데이터를 격납하는 영역 Q가설치된다. 이 영역 Q의 하위 4 비트에는 양자화 테이블 No.를 나타내는 QNo0∼QNo3이 상위 4 비트에는 양자화 테이블 No.의 전환점(스 위칭 포인트)을 나타내는 데이터 SWPO-SWP3가 각각 격납된다 양자화 데이터에 계속하는 7 바이트의 영역에 비디 오 데이터가 격납된다. 1 동기 블록은 90 바이트로 구성된다. 있어서 설명한 VAUX 영역으로 구성되는 1 동기 블록(α, β, 또는 ｒ)은 같이 구성된다. 서브코드 영역 이 영역의 기록 신호에 대한 프레이밍 처리 및 오류 정정 부호 부가를 행한 포맷을 그 1 동기 블록의 구성을 동일한 기록 데이터를 격납하는 영역으로선 1 트랙에서 5 바이트의 길이의 것이 12 동기 블록 분 준비되며, 이 데이터 영역에 대해서 2 바이트의 수평 패리티(C1)가 부 가된다. 1 동기블록은 12 바이트로 구성된다."}
{"patent_id": "10-2023-0047114", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 있어서, 화상 신호 및 음성 신호에 부수하는 부수 정보를 기록하는 부수 정보 영역을 화상 신호및 음 성 신호의 기록 영역과는 따로 설치하고 또한, 상기 화상 및 음성 신호에 부수한 문자 정보의 내용에의해서 설 치된 내용 식별 정보와, 이 식별 정보와 상기 문자 정보의 내용과의 대응을 정의하는 정보를 상기 부수 정보 영 역에 기록하도록 디지털 화상 음성 신호 기록 재생 장치를 구성한다. 이 경우, 상기 문자 정보가 기록되어 있는 기록 매체 상의 위치를 나타내는 위치 정보도 상기 부수 정보영역에 기록하도록 구성한다. 또는, 상기 부수 정 보 영역을 화상 신호에 부수하는 정보가 기록되는 제 1부수 정보 영역과, 음성 신호에 부수하는 정보가 기록되 는 제 2 부수 정보 영역과, 상기 제 1, 제 2 이외의 부수 정보가 기록되는 제 2 부수 정보 영역과, 상기 제 1, 제 2 이외의 부수 정보가 기록되는 제 3 의부수 정보 영역으로 분할된 구성으로 하는 것이 바람직하다. 또한, 부수 정보 영역을 이같이 3 분할된 구성으로 한 경우에 있어서, 영상,음성에 기록된 정보의 내용을나타내는 목 차 정보를 상기 제 3 의 부수 정보 영역에 반복 기록하는 구성을 채용할 수도 있다. 또한, 이목차 정보 내의 개 개의 목차항목에 대해서 목차 항목을 기록한 기록 매체 상의 위치가, 그 목차 항목이 나타내는 화상. 음성 신호 의 기록 위치와 일치하고 있는지 아닌지를 나타내는 정보를 부가해서 기록하고, 재생 시에는 그 정보를 판독함 으로써 상기 목차 정보 중의 어느목차 항목을 재생중인가를 판별할 수 있게 하는 구성도 채용된다. 또한, 본 발 명에 있어서, 화상 신호 및 음성 신호 외에 문자 정보를 기록 또는 재생하는 기능을 구비하며,또한, 기록하는 문자 코드로서 문자 방송에서 사용되고 있는 문자 코드를 사용할 수 있도록 화상 음성 신호 기록 재생 장치를 구성한다. 또한, 본 발명에 있어서, 화상 신호 및 음성 신호 외에 문자 정보를 기록 또는 재생하는 기능을 구비 하며,또한, 문자 정보를 표시하기 위한 제어 코드로서 문자 방송에서 사용되어 있는 제어 코드를 사용하도록 화 상 음성 신호 기록 재생 장치를 구성한다. 또한, 본 발명에 있어서, 화상 신호 및 음성 신호 외에 문자 정보를 여러 가지 언어에 의해서 기록 또는재생되는 기능을 구비하며, 또한, 문자 정보의 기록시에는 기록되는 문자 정 보의 언어의 종류에 따라 식별정보를 그 문자 정보에 부여해서 기록하고, 재생 시에 그 식별 정보를 지정함으로 써 이 지정된 식별 정보가 부여되어 있는 언어의 문자 정보만을 선택할 수 있도록 화상 음성 신호 기록 재생장 치를 구성한다. 작용 식별 정보와 문자 정보의 내용과의 대응을 정의하는 정보에 기초하여 희망하는 내용의 문 자 정보만을 검색하는 동작이 실행된다. 또한, 문자 정보의 검색에 있어서 문자 정보가 기록되어 있는 기록 매 체 상의 위치를 나타내는 정보에 기초하여 희망하는 문자 정보가 기록되어 있는 기록 영역만을 검색하는 동작이 실행된다. 목차 정보가 반복 기록되어 있다는 것에서 재생 시 어느 테이프 위치로부터도 신속하게 목차 정보를 얻을 수 있고, 또한, 어느 목차 항목을 재생중인가를 판별할 수 있다. 문자 정보의 기록 시에 사용하는 문자 코 드 또는 제어 코드로서 문자 방송에 있어서 사용되고 있는 것을사용함으로써 문자 정보의 재생시의 복호 표시를 위한 시스템으로서 문자 방송 수신용의 시스템을 공용할수 있다.언어의 종류에 따른 식별 정보를 부여해서 문자 정보를 기록함으로써 재생시, 희망하는 언어에 의한 문자정보만을 선택할 수 있다."}
{"patent_id": "10-2023-0047114", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "문자 정보와 그 토픽 태그를 규정하는 정보가 테이프에 기록되고 있으므로 이 정보에 기초하여 소망의 문자정보 만을 검색하는 것이 가능하다. 또, 문자 정보의 검색 때, 문자 정보가 기록되어 있는 기록 영역을 나타내는 정 보도 아울러 기록되고 있으므로, 이 정보가 나타내는 기록 영역만을 검색하면 되며 신속한 검색을 할 수 있다. 또한, 목차 정보가 어느 테이프 위치에 있어서도 반복 기록되어 있으므로, 재생 시 어느 테이프 위치로부터도 곧바로 목차 정보를 얻을 수 있으며, 또한 어느목차 항목의 부분을 재생중인가를 판별할 수 있다. 문자 정보의 기록 시에 사용하는 문자 코드 또는 제어 코드로서 문자 방송에서 사용되고 있는 것을 사용함으로써, 문자 정보 의 재생 시의 복호 표시를 위한 시스템으로서 문자 방송 수신용의 시스템을 공용할 수있다. 언어의 종류에 따른식별 정보를 부여하고, 문자 정보를 기록함으로써 재생시, 소망의 언어에 의한 문자정보만을 선택할 수 있다."}
{"patent_id": "10-2023-0047114", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "기록 매체 상에 디지털 화상 및 디지털 음성 데이터를 기록하기 위한 장치 에 있어서,디지털 화상 및 디지털 음 성 데이터 및 기록되는 식별 토픽들을 갖는 토픽 데이터를 수신하기 위한 수단으로서, 상기 각각의 토픽 데이터 는 상기 수신된 디지털 화상 및 디지털 음성 데이터에 대응하는, 상기 수신수단과;상기 식별 토픽들에 따라 메 뉴 데이터를 생성하기 위한 수단으로서, 상기 메뉴 데이터는 상기 식별 토픽들의 메뉴를 나타내는, 상기 생성 수단과;기록하기 위한 선정된 포맷으로 상기 디지털 화상 및 디지털 음성 데이터, 상기 토픽 데이터 및 상기 메 뉴데이터를 배열하기 위한 수단으로서, 상기 포맷은 화상 데이터, 음성 데이터 및 메뉴 데이터가 각각 제공되는 비디오, 오디오 및 서브 코드 영역들을 포함하며, 상기 비디오 및 오디오 영역들은 토픽 데이터가 제공되는 각 각의 부수 정보 영역들을 갖는, 상기 배열 수단과;상기 기록 매체 상에 연속적인 트랙들을 기록하기 위한 수단 으로서, 각각의 트랙은 상기 선정된 포맷으로상기 디지털 화상 데이터, 상기 디지털 음성 데이터, 상기 토픽 데 이터 및 상기 메뉴 데이터를 포함하는,상기 기록 수단을 포함하는 디지털 화상 및 디지털 음성 데이터 기록 장 치."}
