{"patent_id": "10-2022-0043351", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0144278", "출원번호": "10-2022-0043351", "발명의 명칭": "안저를 촬영한 대상 영상에 기초하여 정상 안저 영상을 획득하기 위한 안저 영상 처리 장치", "출원인": "재단법인 아산사회복지재단", "발명자": "김남국"}}
{"patent_id": "10-2022-0043351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "프로세서에 의하여 수행되는 방법에 있어서,안저(fundus)를 촬영한 대상 영상 및 노이즈 값에 기초하여 생성된 입력 영상과 상기 입력 영상에 기계 학습 모델을 적용함으로써 산출된 스코어(score)를 이용하여 출력 영상을 획득하는 단계;상기 대상 영상 및 상기 출력 영상에 기초하여 복원 영상을 획득하는 단계; 및상기 대상 영상 및 상기 복원 영상에 기초하여 상기 복원 영상의 정상 영역을 결정하는 단계를 포함하는 방법."}
{"patent_id": "10-2022-0043351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 기계 학습 모델은,정상 안저에 관한 트레이닝 영상 및 노이즈 값에 기초하여 생성된, 트레이닝 입력에 상기 기계 학습 모델을 적용함으로써 산출된 임시 스코어에 기초하여 트레이닝된,방법."}
{"patent_id": "10-2022-0043351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 복원 영상을 획득하는 단계는,상기 대상 영상의 정상 영역(normal region) 및 상기 출력 영상의 일부 영역에 기초하여 상기 복원 영상을 획득하는 단계를 포함하는,방법."}
{"patent_id": "10-2022-0043351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 복원 영상을 획득하는 단계는,상기 대상 영상의 상기 정상 영역과 다른 영역을 상기 출력 영상의 일부 영역으로 변경함으로써 상기 복원 영상을 획득하는 단계를 포함하는,방법."}
{"patent_id": "10-2022-0043351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 복원 영상의 정상 영역을 결정하는 단계는,공개특허 10-2023-0144278-3-상기 대상 영상 및 상기 복원 영상 간의 차이에 기초하여 상기 복원 영상의 정상 영역을 결정하는 단계를 포함하는,방법."}
{"patent_id": "10-2022-0043351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 복원 영상의 정상 영역을 결정하는 단계는,상기 대상 영상의 픽셀 및 상기 대상 영상의 상기 픽셀에 대응하는 상기 복원 영상의 픽셀 간의 픽셀 값 차이가임계 이하인 픽셀의 집합을 상기 복원 영상의 상기 정상 영역으로 결정하는 단계를 포함하는,방법."}
{"patent_id": "10-2022-0043351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 복원 영상에 기초하여 다른 출력 영상을 획득하고 상기 결정된 복원 영상의 정상 영역에 기초하여 다른 복원 영상을 획득함으로써, 복원 영상을 업데이트하는 단계; 및상기 복원 영상을 업데이트할 때마다 해당 복원 영상의 정상 영역을 결정함으로써 상기 복원 영상의 정상 영역의 결정을 반복하는 단계를 더 포함하는 방법."}
{"patent_id": "10-2022-0043351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 출력 영상을 획득하는 단계는,상기 대상 영상에 노이즈 분포로부터 샘플링된 노이즈 값들을 결합함으로써 상기 입력 영상을 생성하는 단계;상기 입력 영상에 상기 기계 학습 모델을 적용함으로써 상기 입력 영상의 획득에 이용된 상기 노이즈 분포의 로그 확률 밀도 함수(log probability density function)의 그래디언트(gradient)에 대한 추정 값을 포함하는 상기 스코어를 산출하는 단계; 및상기 스코어에 기초하여 상기 입력 영상의 픽셀 값을 조정함으로써 상기 출력 영상을 획득하는 단계를포함하는,방법."}
{"patent_id": "10-2022-0043351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 입력 영상의 픽셀 값을 조정함으로써 상기 출력 영상을 획득하는 단계는,상기 입력 영상의 픽셀 값에 디노이징(denoise)을 적용함으로써 상기 출력 영상을 획득하는 단계를 포함하는,방법."}
{"patent_id": "10-2022-0043351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "공개특허 10-2023-0144278-4-하드웨어와 결합되어 제1항 내지 제9항 중 어느 하나의 항의 방법을 실행시키기 위하여 컴퓨터 판독 가능한 기록매체에 저장된 컴퓨터 프로그램."}
{"patent_id": "10-2022-0043351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "안저(fundus)를 촬영한 대상 영상 및 노이즈 값에 기초하여 생성된 입력 영상과 상기 입력 영상에 기계 학습 모델을 적용함으로써 산출된 스코어(score)를 이용하여 출력 영상을 획득하고, 상기 대상 영상 및 상기 출력 영상에 기초하여 복원 영상을 획득하며, 상기 대상 영상 및 상기 복원 영상에 기초하여 상기 복원 영상의 정상 영역을 결정하는 프로세서를 포함하는 장치."}
{"patent_id": "10-2022-0043351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 기계 학습 모델은,정상 안저에 관한 트레이닝 영상 및 노이즈 값에 기초하여 생성된, 트레이닝 입력에 상기 기계 학습 모델을 적용함으로써 산출된 임시 스코어에 기초하여 트레이닝된,장치."}
{"patent_id": "10-2022-0043351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서,상기 프로세서는,상기 대상 영상의 정상 영역(normal region) 및 상기 출력 영상의 일부 영역에 기초하여 상기 복원 영상을 획득하는,장치."}
{"patent_id": "10-2022-0043351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서,상기 프로세서는,상기 대상 영상의 상기 정상 영역과 다른 영역을 상기 출력 영상의 일부 영역으로 변경함으로써 상기 복원 영상을 획득하는,장치."}
{"patent_id": "10-2022-0043351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11항에 있어서,상기 프로세서는,상기 대상 영상 및 상기 복원 영상 간의 차이에 기초하여 상기 복원 영상의 정상 영역을 결정하는,장치.공개특허 10-2023-0144278-5-청구항 16 제11항에 있어서,상기 프로세서는,상기 대상 영상의 픽셀 및 상기 대상 영상의 상기 픽셀에 대응하는 상기 복원 영상의 픽셀 간의 픽셀 값 차이가임계 이하인 픽셀의 집합을 상기 복원 영상의 상기 정상 영역으로 결정하는,장치."}
{"patent_id": "10-2022-0043351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제11항에 있어서,상기 프로세서는,상기 복원 영상에 기초하여 다른 출력 영상을 획득하고 상기 결정된 복원 영상의 정상 영역에 기초하여 다른 복원 영상을 획득함으로써, 복원 영상을 업데이트하고,상기 복원 영상을 업데이트할 때마다 해당 복원 영상의 정상 영역을 결정함으로써 상기 복원 영상의 정상 영역의 결정을 반복하는, 장치."}
{"patent_id": "10-2022-0043351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제11항에 있어서,상기 프로세서는,상기 대상 영상에 노이즈 분포로부터 샘플링된 노이즈 값들을 결합함으로써 상기 입력 영상을 생성하고,상기 입력 영상에 상기 기계 학습 모델을 적용함으로써 상기 입력 영상의 획득에 이용된 상기 노이즈 분포의 로그 확률 밀도 함수(log probability density function)의 그래디언트(gradient)에 대한 추정 값을 포함하는 상기 스코어를 산출하며,상기 스코어에 기초하여 상기 입력 영상의 픽셀 값을 조정함으로써 상기 출력 영상을 획득하는,장치."}
{"patent_id": "10-2022-0043351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에 있어서,상기 프로세서는,상기 입력 영상의 픽셀 값을 조정함으로써 상기 출력 영상을 획득하고,상기 입력 영상의 픽셀 값에 디노이징(denoise)을 적용함으로써 상기 출력 영상을 획득하는,장치."}
{"patent_id": "10-2022-0043351", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "일 실시예에 따른 안저 영상 처리 장치는, 안저(fundus)를 촬영한 대상 영상 및 노이즈 값에 기초하여 생성된 입 력 영상과 상기 입력 영상에 기계 학습 모델을 적용함으로써 산출된 스코어(score)를 이용하여 출력 영상을 획득 하고, 상기 대상 영상 및 상기 출력 영상에 기초하여 복원 영상을 획득하며, 상기 대상 영상 및 상기 복원 영상 에 기초하여 상기 복원 영상의 정상 영역을 결정하는 프로세서를 포함할 수 있다."}
{"patent_id": "10-2022-0043351", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "이하, 안저 영상 처리에 관한 기술이 개시된다."}
{"patent_id": "10-2022-0043351", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "눈과 관련된 다양한 연구 중에 최근 가장 주목받고 있는 것이 바로 안저 영상이다. 안저 영상은 비침습적으로 간편하고 저렴하게 인체의 혈관, 신경, 망막 등의 상태를 측정하고 관찰할 수 있는 특징이 있다. 이러한 특징 때문에 안과에서는 다양한 안과 질환 진단을 위해 안저 영상을 활용하고 있다. 이 안저카메라로 촬영한 안저 영상은 망막에 분포하고 있는 혈관, 망막신경 섬유층, 황반, 시신경유두 등을 관 찰하는 데 이용될 수 있으며, 촬영한 결과는 해부학적 조직의 특징을 면밀히 분석함으로써 질환 여부를 판단하 기 위한 유용한 자료로 사용되고 있다. 안저 영상의 판독에 있어서 현실적인 문제는, 미세한 병변의 정밀한 판 독을 위하여 고도의 숙련된 전문의가 필요하지만 검사 수요대비 안저 영상 판독 전문의의 공급이 턱없이 부족하 므로 검사 결과의 판독에 많은 어려움이 있다. 특히, 당뇨, 고혈압과 같은 만성질환 환자의 경우 내과 또는 가 정의학과와 별개로 안과 분야를 전문적으로 검사하는 과정을 거쳐야 하는 번거로움이 있어 많은 불편함이 있다. 안저 영상 판독에 최초의 인공지능 기술을 도입한 사례로, 세간의 관심을 불러 일으킨 배경에는 2015년 2월부터 7월까지 진행한 Kaggle의 \"Diabetic Retinopathy Detection\" 대회의 공헌이 크다고 할 수 있다. 이 대회는 5 개 등급으로 레이블링된 안저 영상을 참여자에게 제공하여 판독 모델을 학습할 수 있게 하였으며, 팀별로 학습 한 모델을 가지고 레이블을 부여하지 않은 테스트 데이터를 판독한 결과를 제출하여 quadratic weighted kappa 방식으로 예측 결과를 평가받아 순위를 정하였다. 이 대회에서는 레이블(기계학습 대상 클래스)을 정상, 경미 한 당뇨성망막병증, 중증 당뇨성망막병증, 심각한 당뇨성망막병증, 증식성 당뇨성망막병증의 총 5개의 범주로 정의하였다. 결과 평가 방법을 quadratic weighted kappa로 한 이유를 추정해 보면, 제시한 5개의 클래스 레이 블이 순서의 의미를 내포하고 있으므로, 예측 모델이 정상을 초기 질병으로 오판한 결과보다는 정상을 중증 또 는 심각한 상태의 병증으로 예측한 것에 대해서 더 많은 벌점을 적용하는 방식이 현장에서 사용하는데 더 합리 적이라는 이유일 것이다. 661개 팀이 총상금 10만 달러를 두고 각축을 벌였으며, 이 대회에서 Min-Pooling 팀 이 0.84957(quadratic weighted kappa score)의 점수 로 1등을 차지하였다. Min-Pooling 팀이 사용한 모델 학 습 방법은 여러 개의 심층신경망을 개별적으로 학습하고, 이 결과를 앙상블하는 방법을 사용하였다."}
{"patent_id": "10-2022-0043351", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시예에 따른 프로세서에 의하여 수행되는 방법에 있어서, 안저(fundus)를 촬영한 대상 영상 및 노이즈 값 에 기초하여 생성된 입력 영상과 상기 입력 영상에 기계 학습 모델을 적용함으로써 산출된 스코어(score)를 이 용하여 출력 영상을 획득하는 단계, 상기 대상 영상 및 상기 출력 영상에 기초하여 복원 영상을 획득하는 단계, 및 상기 대상 영상 및 상기 복원 영상에 기초하여 상기 복원 영상의 정상 영역을 결정하는 단계를 포함할 수 있 다. 상기 기계 학습 모델은, 정상 안저에 관한 트레이닝 영상 및 노이즈 값에 기초하여 생성된, 트레이닝 입력에 상 기 기계 학습 모델을 적용함으로써 산출된 임시 스코어에 기초하여 트레이닝될 수 있다. 상기 복원 영상을 획득하는 단계는, 상기 대상 영상의 정상 영역(normal region) 및 상기 출력 영상의 일부 영 역에 기초하여 상기 복원 영상을 획득하는 단계를 포함할 수 있다. 상기 복원 영상을 획득하는 단계는, 상기 대상 영상의 상기 정상 영역과 다른 영역을 상기 출력 영상의 일부 영 역으로 변경함으로써 상기 복원 영상을 획득하는 단계를 포함할 수 있다. 상기 복원 영상의 정상 영역을 결정하는 단계는, 상기 대상 영상 및 상기 복원 영상 간의 차이에 기초하여 상기 복원 영상의 정상 영역을 결정하는 단계를 포함할 수 있다.상기 복원 영상의 정상 영역을 결정하는 단계는, 상기 대상 영상의 픽셀 및 상기 대상 영상의 상기 픽셀에 대응 하는 상기 복원 영상의 픽셀 간의 픽셀 값 차이가 임계 이하인 픽셀의 집합을 상기 복원 영상의 상기 정상 영역 으로 결정하는 단계를 포함할 수 있다. 일 실시예에 따른 방법은, 상기 복원 영상에 기초하여 다른 출력 영상을 획득하고 상기 결정된 복원 영상의 정 상 영역에 기초하여 다른 복원 영상을 획득함으로써, 복원 영상을 업데이트하는 단계 및 상기 복원 영상을 업데 이트할 때마다 해당 복원 영상의 정상 영역을 결정함으로써 상기 복원 영상의 정상 영역의 결정을 반복하는 단 계를 더 포함할 수 있다. 상기 출력 영상을 획득하는 단계는, 상기 대상 영상에 노이즈 분포로부터 샘플링된 노이즈 값들을 결합함으로써 상기 입력 영상을 생성하는 단계, 상기 입력 영상에 상기 기계 학습 모델을 적용함으로써 상기 입력 영상의 획 득에 이용된 상기 노이즈 분포의 로그 확률 밀도 함수(log probability density function)의 그래디언트 (gradient)에 대한 추정 값을 포함하는 상기 스코어를 산출하는 단계, 및 상기 스코어에 기초하여 상기 입력 영 상의 픽셀 값을 조정함으로써 상기 출력 영상을 획득하는 단계를 포함할 수 있다. 상기 입력 영상의 픽셀 값을 조정함으로써 상기 출력 영상을 획득하는 단계는, 상기 입력 영상의 픽셀 값에 디 노이징(denoise)을 적용함으로써 상기 출력 영상을 획득하는 단계를 포함할 수 있다. 일 실시예에 따른 장치는 안저(fundus)를 촬영한 대상 영상 및 노이즈 값에 기초하여 생성된 입력 영상과 상기 입력 영상에 기계 학습 모델을 적용함으로써 산출된 스코어(score)를 이용하여 출력 영상을 획득하고, 상기 대 상 영상 및 상기 출력 영상에 기초하여 복원 영상을 획득하며, 상기 대상 영상 및 상기 복원 영상에 기초하여 상기 복원 영상의 정상 영역을 결정하는 프로세서를 포함할 수 있다. 상기 기계 학습 모델은, 정상 안저에 관한 트레이닝 영상 및 노이즈 값에 기초하여 생성된, 트레이닝 입력에 상 기 기계 학습 모델을 적용함으로써 산출된 임시 스코어에 기초하여 트레이닝될 수 있다. 상기 프로세서는, 상기 대상 영상의 정상 영역(normal region) 및 상기 출력 영상의 일부 영역에 기초하여 상기 복원 영상을 획득할 수 있다. 상기 프로세서는, 상기 대상 영상의 상기 정상 영역과 다른 영역을 상기 출력 영상의 일부 영역으로 변경함으로 써 상기 복원 영상을 획득할 수 있다. 상기 프로세서는, 상기 대상 영상 및 상기 복원 영상 간의 차이에 기초하여 상기 복원 영상의 정상 영역을 결정 할 수 있다. 상기 프로세서는, 상기 대상 영상의 픽셀 및 상기 대상 영상의 상기 픽셀에 대응하는 상기 복원 영상의 픽셀 간 의 픽셀 값 차이가 임계 이하인 픽셀의 집합을 상기 복원 영상의 상기 정상 영역으로 결정할 수 있다. 상기 프로세서는, 상기 복원 영상에 기초하여 다른 출력 영상을 획득하고 상기 결정된 복원 영상의 정상 영역에 기초하여 다른 복원 영상을 획득함으로써, 복원 영상을 업데이트하고, 상기 복원 영상을 업데이트할 때마다 해 당 복원 영상의 정상 영역을 결정함으로써 상기 복원 영상의 정상 영역의 결정을 반복할 수 있다. 상기 프로세서는, 상기 대상 영상에 노이즈 분포로부터 샘플링된 노이즈 값들을 결합함으로써 상기 입력 영상을 생성하고, 상기 입력 영상에 상기 기계 학습 모델을 적용함으로써 상기 입력 영상의 획득에 이용된 상기 노이즈 분포의 로그 확률 밀도 함수(log probability density function)의 그래디언트(gradient)에 대한 추정 값을 포 함하는 상기 스코어를 산출하며, 상기 스코어에 기초하여 상기 입력 영상의 픽셀 값을 조정함으로써 상기 출력 영상을 획득할 수 있다. 상기 프로세서는, 상기 입력 영상의 픽셀 값을 조정함으로써 상기 출력 영상을 획득하고, 상기 입력 영상의 픽 셀 값에 디노이징(denoise)을 적용함으로써 상기 출력 영상을 획득할 수 있다."}
{"patent_id": "10-2022-0043351", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "실시예들에 대한 특정한 구조적 또는 기능적 설명들은 단지 예시를 위한 목적으로 개시된 것으로서, 다양한 형 태로 변경되어 구현될 수 있다. 따라서, 실제 구현되는 형태는 개시된 특정 실시예로만 한정되는 것이 아니며, 본 명세서의 범위는 실시예들로 설명한 기술적 사상에 포함되는 변경, 균등물, 또는 대체물을 포함한다. 제1 또는 제2 등의 용어를 다양한 구성요소들을 설명하는데 사용될 수 있지만, 이런 용어들은 하나의 구성요소 를 다른 구성요소로부터 구별하는 목적으로만 해석되어야 한다. 예를 들어, 제1 구성요소는 제2 구성요소로 명 명될 수 있고, 유사하게 제2 구성요소는 제1 구성요소로도 명명될 수 있다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이해되어야 할 것이다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 명세서에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 설명된 특징, 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것이 존재함 으로 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이들 을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 해당 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가진다. 일반적으로 사용되 는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의미를 갖는 것으로 해석되어야 하며, 본 명세서에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 이하, 실시예들을 첨부된 도면들을 참조하여 상세하게 설명한다. 첨부 도면을 참조하여 설명함에 있어, 도면 부호에 관계없이 동일한 구성 요소는 동일한 참조 부호를 부여하고, 이에 대한 중복되는 설명은 생략하기로 한 다. 도 1은 일 실시예에 따른 영상 처리 장치를 나타낸다. 영상 처리 장치는, 대상 영상을 처리함으로써 복원 영상을 획득하는 장치로서, 영상 획득부 및 프로세서를 포함할 수 있다. 영상 획득부는 대상 영상을 획득하여 프로세서에 전달할 수 있다. 대상 영상은, 안저 (fundus)를 촬영한 안저 영상(fundus image)을 포함할 수 있다. 예를 들어, 안저 영상은 망막 안저 영상 (retinal fundus image)을 포함할 수 있다. 안저 영상은, 정상 안저 및 비정상 안저 중 하나에 대한 영상을 나타낼 수 있다. 정상 안저는 질환이 없는 건 강한 안저를 나타낼 수 있다. 정상 안저에 대한 정상 안저 영상은 정상 영역을 포함할 수 있다. 정상 안저 영 상은 비정상 영역을 포함하지 않을 수 있다. 비정상 안저는 질환(예: 당뇨성망막병증, 녹내장 등)을 가지는 안 저를 나타낼 수 있다. 비정상 안저에 대한 비정상 안저 영상은 정상 영역과 함께 비정상 영역을 포함할 수 있 다. 정상 영역은 질환을 가지는 안저의 특징이 나타나지 않는 영역으로서, 정상 안저의 특징을 가지는 영역을 나타 낼 수 있다. 비정상 영역은, 질환을 가지는 안저의 특징이 나타나는 영역으로서, 질환을 가지는 안저의 특징을 가지는 영역(예: 병변 영역)을 나타낼 수 있다. 특히, 비정상 안저 영상의 정상 영역은 정상 안저에 비해 질환을 가지는 안저의 특징이 나타나지 않는 영역을 나타낼 수 있다. 비정상 안저 영상의 비정상 영역은, 질환으로 인하여 정상 안저와 구분되는 특징을 가지는 영역을 나타낼 수 있다. 후술하겠으나, 대상 영상의 정상 영 역은, 대상 영상으로부터 복원 영상을 획득하기 위하여 변경되는 영역을 나타낼 수 있다. 일 실시예에서, 안저 카메라는 환자의 안저를 촬영함으로써 생성된 촬영 데이터를 영상 처리 장치로 유선 및/또는 무선 전기 통신을 통해 전송할 수 있다. 영상 획득부는 영상 처리 장치와 분리된 안저 카메 라로부터 촬영 데이터를 유선 및/또는 무선으로 수신하는 인터페이스를 포함할 수 있다. 일부 실시예들에서, 영상 획득부는 유선 인터페이스 포트를 포함할 수 있다. 다른 일부 실시예들에서, 영상 획득부는 무 선으로 데이터를 수신하는 통신 모듈을 포함할 수 있다. 다른 일 실시예에서, 안저 카메라는 영상 처리 장치에 집적될 수도 있다. 이 경우, 영상 획득부는 안저 카메라로 구현될 수 있다. 안저 카메라는 안저 영상을 획득할 수 있는 다양한 안저 카메라들을 포함할 수 있다. 예를 들어, 상기 안저 카 메라는 산동 안저 카메라, 무산동 안저 카메라, OCT 형(type) 안저 카메라 등을 포함할 수 있다. 프로세서는 영상 획득부를 통해 획득된 안저 영상을 처리할 수 있다. 프로세서는 대상 영상 을 처리함으로써 복원 영상을 획득할 수 있다. 예시적으로, 대상 영상은 안저 질환을 가지는 대상 환자에 대하여 촬영된 비정상 안저 영상을 포함할 수 있다. 복원 영상은 질환이 없는 대상 환자의 정상 안저에 대하여 촬영된 영상을 추정한 영상을 포함할 수 있다. 복원 영상는, 대상 영상의 비정 상 영역을 변경함으로써 획득될 수 있다. 프로세서의 복원 영상 획득은 도 2에서 후술한다. 도 2는 일 실시예에 따른 영상 처리 장치의 프로세서의 동작을 나타낸다. 도 3은 일 실시예에 따른 영상 처리 장치의 프로세서에 의한 복원 영상 획득 및 복원 영상의 정상 영역 결정 동작을 나타낸다. 단계에서, 프로세서는 대상 영상으로부터 출력 영상을 획득할 수 있다. 프로세서(예: 도 1의 프로세서 )는 영상 획득부(예: 도 1의 영상 획득부)으로부터 안저를 촬영한 대상 영상을 획득할 수 있다. 프 로세서는 대상 영상 및 노이즈 값에 기초하여 입력 영상을 생성할 수 있다. 입력 영상은, 대상 영상에 노이즈 값을 부가함으로써 대상 영상의 픽셀 값들을 변경한 영상을 나타낼 수 있다. 프로세서는 생성된 입력 영상을 이용하여 출력 영상을 획득할 수 있다. 출력 영상은, 입력 영상의 픽셀 값들 중 노이즈 값으로 추정되는 값을 감소시킴으로써 획득된 영상을 나타낼 수 있다. 후술하겠으나, 프로세서는 입력 영상에 기계 학습 모델을 적용 함으로써 산출된 스코어를 이용하여 출력 영상을 획득할 수 있다. 기계 학습 모델은 정상 안저 영상을 이용하 여 트레이닝된 모델이기 때문에, 프로세서는 입력 영상보다 정상 안저 영상과 유사한 출력 영상을 획득할 수 있 다. 기계 학습 모델을 이용한 출력 영상의 획득은 도 4 및 도 5에서 후술한다. 단계에서, 프로세서는 대상 영상 및 출력 영상에 기초하여 복원 영상을 획득할 수 있다. 복원 영상은 대 상 영상보다 정상 안저 영상과 유사한 영상을 나타낼 수 있다. 복원 영상은 대상 영상의 비정상 영역이 정상 안저 영상과 유사하게 복원된 영상을 포함할 수 있다. 프로세서는 대상 영상의 정상 영역을 복원 영상의 일부 영역으로서 이용함으로써, 대상 영상의 정상 영역을 유지하면서 정상 영역과 다른 영역을 출력 영상에 기초하여 변경할 수 있다. 프로세서는 대상 영상의 정상 영역 및 출력 영상의 일부 영역에 기초하여 복원 영상을 획득할 수 있다. 프로세서는 대상 영상의 정상 영역과 다른 영역(예: 비정상 영역)을 출력 영상의 일부 영역으로 변경 함으로써 복원 영상을 획득할 수 있다. 예를 들어, 도 3에 나타난 바와 같이, 프로세서는 대상 영상의 정상 영역을 복원 영상의 일부 (예: 영역)로 이용할 수 있다. 프로세서는 출력 영상으로부터 추출된 영역 중 다른 영역을 복 원 영상의 일부(예: 영역)로 이용할 수 있다. 프로세서는 대상 영상의 정상 영역과 다른 영역을 출원 영상의 일부 영역으로 변경함으로써, 복원 영상을 획득할 수 있다. 단계에서, 프로세서는 복원 영상의 정상 영역을 결정할 수 있다. 전술한 바와 같이, 정상 영역은 질환을 가지는 안저의 특징이 나타나지 않는 영역으로서, 정상 안저의 특징을 가지는 영역을 나타낼 수 있다. 복원 영상의 정상 영역은 정상 안저의 특징을 가지고, 대상 영상의 고유한 특 징을 유지하는 영역을 나타낼 수 있다. 대상 영상의 고유한 특징은, 정상 안저 및/또는 질환 안저에 의한 특징 과 구분되는 대상 환자 및/또는 촬영 기법에 관한 특징으로서, 혈관, 신경 섬유층, 황반, 시신경유두, 및 망막 간의 상대적인 위치 및/또는 크기, 혈관의 위치, 혈관의 분기, 촬영된 각도 등을 포함할 수 있다. 예를 들어, 복원 영상의 정상 영역은 정상 안저의 특징을 가지고 대상 영상과의 임계 이하의 차이를 가지는 영역을 나타낼수 있다. 프로세서는 대상 영상 및 복원 영상 간의 임계 이하의 변화를 가지는 영역을 복원 영상의 정상 영역으로 결정할 수 있다. 복원 영상의 임계 이하의 변화를 가지는 영역은, 대상 영상과 유사하고 정상 안저의 특징을 가지는 것으로 판단될 수 있다. 다만, 복원 영상의 임계를 초과하는 변화를 가지는 영역은, 대상 영상의 고유한 특징 을 유지하지 않는 영역으로 판단될 수 있다. 다시 말해, 복원 영상의 임계를 초과하는 변화를 가지는 영역은, 대상 영상과 유사하지 않은 영역으로 판단될 수 있다. 임계를 초과하는 변화를 가지는 영역은 정상 안저의 특 징을 가지지만 대상 영상의 고유한 특징을 유지하지 않으므로, 프로세서는 복원 영상의 임계를 초과하는 변화를 가지는 영역을 복원 영상의 정상 영역의 결정으로부터 배제시킬 수 있다. 도 6 및 도 7에서 후술하겠으나, 복 원 영상의 획득을 반복함으로써, 초기 대상 영상의 고유한 특징을 갖는 복원 영상, 다시 말해 초기 대상 영상과 유사한 정상 안저 영상의 특징을 갖는 복원 영상을 획득할 수 있다. 프로세서는 대상 영상 및 복원 영상에 기초하여 복원 영상의 정상 영역을 결정할 수 있다. 프로세서는 대상 영 상 및 복원 영상 간의 차이에 기초하여 복원 영상의 정상 영역을 결정할 수 있다. 프로세서는 대상 영상의 픽 셀 및 대상 영상의 픽셀에 대응하는 복원 영상의 픽셀 간의 픽셀 값 차이가 임계 이하인 픽셀의 집합을 복원 영 상의 정상 영역으로 결정할 수 있다. 예를 들어, 프로세서는 대상 영상 및 복원 영상의 대응하는 픽셀들 간의 픽셀 값 차이를 계산할 수 있다. 프로 세서는 계산된 픽셀 값 차이가 임계 이하인 경우에 응답하여, 복원 영상의 해당 픽셀이 정상 영역에 속하는 것으로 결정할 수 있다. 프로세서는 계산된 픽셀 값 차이가 임계를 초과하는 경우에 응답하여, 복원 영상의 해당 픽셀이 정상 영역에 속하지 않는 것으로 결정할 수 있다. 결과적으로, 프로세서는, 대상 영상의 정상 영역보다 크거나 같은 크기의 정상 영역을 가지는 복원 영상을 획득 할 수 있다. 예를 들어, 도 3에서 나타난 바와 같이, 프로세서는 대상 영상의 정상 영역 및 출력 영 상의 일부 영역에 기초하여 복원 영상을 획득할 수 있다. 프로세서는 복원 영상의 영역 을 대상 영상의 정상 영역과 임계 이하의 차이를 가지므로, 복원 영상의 정상 영역의 적어도 일 부로 결정할 수 있다. 프로세서는 복원 영상의 영역을 임계 이하의 차이를 가지는 영역(332a) 및 임 계를 초과하는 차이를 가지는 영역(332b)으로 구분할 수 있다. 프로세서는 복원 영상의 영역(332a)를 복원 영 상의 정상 영역의 적어도 일부로 결정할 수 있다. 프로세서는, 복원 영상의 영역(332b)를 복원 영상의 정상 영 역의 결정으로부터 배제할 수 있다. 따라서, 프로세서는 복원 영상의 정상 영역을 복원 영상의 영역 및 영역(332a)으로 결정할 수 있다. 프로세서는 대상 영상의 정상 영역보다 큰 크기의 정 상 영역을 가지는 복원 영상을 획득할 수 있다. 도 4는 일 실시예에 따른 기계 학습 모델을 이용하여 출력 영상의 획득을 나타낸다. 일 실시예에 따른 프로세서는, 대상 영상 및 노이즈 값에 기초하여 생성된 입력 영상과 입력 영상에 기계 학습 모델을 적용함으로써 산출된 스코어를 이용하여 출력 영상을 획득할 수 있다. 단계에서, 프로세서는 대상 영상에 노이즈 값들을 결합함으로써 상기 입력 영상을 생성할 수 있다. 입력 영상은, 교란 데이터(Perturbation data)로서 교란 영상을 포함할 수 있다. 프로세서는 노이즈 분포로부터 노 이즈 값들을 샘플링할 수 있다. 노이즈 분포는 노이즈 값들의 확률 분포(probability distribution)로서, 예시 적으로, 평균이 0인 가우시안 분포(Gaussian distribution)를 포함할 수 있다. 단계에서, 프로세서는 입력 영상에 기계 학습 모델을 적용함으로써 스코어를 산출할 수 있다. 스코어는 기계 학습 모델의 출력으로서, 입력 영상의 획득에 이용된 노이즈 분포의 로그 확률 밀도 함수(log probability density function)의 그래디언트(gradient)에 대한 추정 값을 나타낼 수 있다. 스코어는 입력 영상과 동일한 차원(dimension)을 가질 수 있다. 예를 들어, 입력 영상이 512 512의 영상으로서 512 512의 차원을 가지 는 경우, 스코어는 512 512의 차원을 가질 수 있다. 스코어의 원소(element)는 각각 입력 영상의 픽셀에 대 응할 수 있다. 스코어의 원소 값은, 입력 영상의 대응하는 픽셀에 포함된 노이즈 값에 대한 추정치를 포함할 수 있다. 후술하겠으나, 기계 학습 모델은 정상 안저에 관한 트레이닝 데이터를 이용하여 트레이닝될 수 있다. 정상 안 저에 관한 트레이닝 데이터를 학습한 기계 학습 모델은 입력 영상을 정상 안저 영상으로 복원하기 위한 스코어 를 출력할 수 있다. 단계에서, 프로세서는 입력 영상의 픽셀 값을 조정함으로써 출력 영상을 획득할 수 있다. 프로세서는 스 코어에 기초하여 입력 영상의 픽셀 값을 조정함으로써 출력 영상을 획득할 수 있다. 예를 들어, 프로세서는 입 력 영상의 픽셀 값에 디노이징(denoise)을 적용함으로써 출력 영상을 획득할 수 있다. 디노이징은, 영상의 노 이즈 성분을 억제하는 동작을 나타낼 수 있다. 영상은 영상의 실제 정보를 나타내는 영상 성분과 함께 노이즈 성분을 포함할 수 있다. 영상의 대상 픽셀 값은 해당 픽셀의 영상 정보를 가지는 영상 값과 함께 노이즈 값을 포함할 수 있다. 예를 들어, 디노이징은 대상 픽셀 값에 포함된 것으로 추정되는 노이즈 값을 감소시키는 동작 을 나타낼 수 있다. 도 5는 일 실시예에 따른 기계 학습 모델의 스코어를 이용하여 출력 영상을 획득하는 동작을 나타낸다. 프로세서(예: 도 1의 프로세서)는, 입력 영상에 기계 학습 모델을 적용함으로써 스코어를 산출할 수 있다. 기계 학습 모델은 입력 영상으로부터 스코어를 산출하도록 설계 및 트레이닝된 모델로서, 예시적으로 뉴럴 네트 워크(예: 스코어 기반 생성 모델(score-based generative model)로서 구현될 수 있다. 뉴럴 네트워크의 개략적인 구조에 대해 하기와 같이 설명한다. 일 실시예에 따르면 뉴럴 네트워크는 복수의 노 드들로 구성되는 복수의 레이어들을 포함할 수 있다. 또한, 뉴럴 네트워크는 복수의 레이어들의 각각에 포함된 복수의 노드들을 다른 레이어에 포함된 노드에 연결시키는 연결 가중치들을 포함할 수 있다. 예를 들어, 뉴럴 네트워크는 연결선(edge)으로 연결된 많은 수의 노드들을 이용하여 생물학적인 시스템의 계산 능력을 모방하는 인식 모델을 나타낼 수 있다. 뉴럴 네트워크는 복수의 레이어들을 포함할 수 있다. 예를 들어, 뉴럴 네트워크 는 입력 레이어(input layer), 히든 레이어(hidden layer), 출력 레이어(output layer)을 포함할 수 있다. 일 실시예에 따른 영상 처리 장치는 뉴럴 네트워크를 포함하는 기계 학습 모델을 입력 영상에 대응하는 데이터 에 적용함으로써 전술한 스코어를 산출할 수 있다. 도 4에서 전술한 바와 같이, 스코어는 기계 학습 모델의 출 력으로서, 입력 영상의 획득에 이용된 노이즈 분포의 로그 확률 밀도 함수(log probability density functio n)의 그래디언트(gradient)에 대한 추정 값을 나타낼 수 있다. 영상 처리 장치는 뉴럴 네트워크의 입력 레이어에 입력 영상에 대응하는 데이터를 입력할 수 있다. 영상 처리 장치는 입력 레이어부터 출력 레이어까지 하나 이상의 레이어를 거쳐 입력 영상에 대응하는 데이터를 전파시킬 수 있다. 입력 영상에 대응하는 데이터는 전파되는 동안 추상화된 특징 데이터(예를 들어, 특징 벡터)로서 추 출될 수 있고, 영상 처리 장치는 특징 데이터로부터 스코어를 생성할 수 있다. 다만, 이는 순전한 예시로서, 기계 학습 모델의 구조를 전술한 뉴럴 네트워크로 한정하는 것은 아니다. 기계 학습 모델의 트레이닝의 구체적인 사항에 대해 하기와 같이 설명한다. 기계 학습 모델은 뉴럴 네트워크를 포함할 수 있다. 트레이닝 장치는 뉴럴 네트워크를 메모리에 저장된 내부 데이터베이스로부터 획득하거나, 통신부를 통해 외부 서버로부터 수신하여 획득할 수 있다. 트레이닝 장치는 영상 처리 장치와 독립적으로 구현되는 장치일 수 있으나 이로 한정하는 것은 아니고, 영상 처리 장치에 통합될 수도 있다. 일 실시예에 따른 트레이닝 장치는 뉴럴 네트워크의 적어도 일부를 감독 학습(supervised learning)을 통해 트 레이닝시킬 수 있다. 트레이닝 장치는 소프트웨어 모듈, 하드웨어 모듈, 또는 이들의 조합으로 구현될 수 있다. 감독 학습은 트레이닝 데이터의 트레이닝 입력 그에 대응하는 트레이닝 출력을 함께 뉴럴 네트워크에 입 력하고, 트레이닝 데이터의 트레이닝 출력에 대응하는 출력 데이터가 출력되도록 연결선들의 연결 가중치를 업 데이트하는 기법을 나타낼 수 있다. 트레이닝 데이터는 복수의 트레이닝 쌍들(training pairs)로 구성되는 데이터 세트(data set)를 나타낼 수 있다. 예를 들어, 트레이닝 쌍은 트레이닝 입력 및 트레이닝 출력을 포함할 수 있고, 트레이닝 출력은 쌍을 이 루는 트레이닝 입력으로부터 출력되어야 하는 값(예를 들어, 참값(ground truth))을 나타낼 수 있다. 따라서, 트레이닝 데이터는 복수의 트레이닝 입력들을 포함하고, 복수의 트레이닝 입력들의 각각에 매핑된 트레이닝 출 력을 포함할 수 있다. 일 실시예에 따른 기계 학습 모델은 정상 안저에 관한 트레이닝 영상을 이용하여 트레이닝될 수 있다. 트레이 닝 영상은 정상 안저에 관한 영상을 포함할 수 있다. 트레이닝 영상은 비정상 안저에 관한 영상을 포함하지 않 을 수 있다. 트레이닝 영상으로부터 비정상 안저에 관한 영상을 배제시킴으로써, 기계 학습 모델은 정상 안저 에 관한 영상(예: 정상 안저 영상)을 복원하기 위한 스코어를 출력하도록 트레이닝될 수 있다. 트레이닝 장치는 트레이닝 영상 및 노이즈 값에 기초하여 트레이닝 입력을 생성할 수 있다. 예를 들어, 트레이 닝 장치는 트레이닝 영상에 노이즈 분포로부터 샘플링된 노이즈 값들을 결합함으로써 트레이닝 입력을 생성할수 있다. 트레이닝 장치는 트레이닝 입력에 기계 학습 모델을 적용함으로써 임시 스코어를 산출할 수 있다. 트레이닝 장치는 임시 스코어를 참값 스코어와 비교함으로써 목적 함수(objective function)을 계산할 수 있다. 참값 스코어는 트레이닝 입력의 획득에 이용된 노이즈 분포에 기초하여 획득될 수 있다. 트레이닝 장치는 목적 함수에 기초하여 기계 학습 모델의 파라미터를 업데이트할 수 있다. 트레이닝 장치는 현재 설정된 연결 가중치 들이 얼마나 최적에 가까운지를 측정하기 위해 정의된 목적 함수의 결과에 기초하여 연결 가중치들을 계속 변경 하고, 트레이닝을 반복적으로 수행할 수 있다. 다만, 트레이닝을 감독 학습으로 한정하는 것은 아니며, 트레이닝 장치는 뉴럴 네트워크의 적어도 일부를 자율 학습(unsupervised learning)을 통해 트레이닝시킬 수도 있다. 자율 학습은 트레이닝 데이터의 트레이닝 입력 을 전방 전파(forward propagate)한 출력에 기초하여 손실을 계산할 수 있고, 손실이 감소되도록 연결선들의 연 결 가중치를 업데이트하는 기법을 나타낼 수 있다. 트레이닝 입력은, 트레이닝 영상(또는, 원본 영상으로도 표현됨)에 노이즈 값들이 결합됨으로써 생성될 수 있다. 복수의 트레이닝 입력들은, 하나의 트레이닝 영상에 서로 다른 노이즈 분포로부터 샘플링된 노이즈 값들 에 기초하여 생성될 수 있다. 서로 다른 노이즈 분포들은, 예시적으로, 평균이 0이고 표준 편차가 서로 다른 가우시안 분포들을 포함할 수 있다. 하나의 트레이닝 영상으로부터 획득된 복수의 트레이닝 입력들은 노이즈 분포의 표준 편차의 크기에 따라 스텝(step)에 매핑될 수 있다. 예를 들어, 노이즈 분포의 표준 편차는 가장 큰 번호의 스텝으로부터 가장 작은 번호의 스텝으로 지수적으로 (exponentially) 감소할 수 있다. 도 5에서, t는 스텝을 나타내고, X(t)는 스텝 t에 매핑된 트레이닝 입력을 나타낼 수 있다. 하나의 트레이닝 영상으로부터 획득된 복수의 트레이닝 입력들은, 노이즈 분포의 표준 편차가 큰 순서대로 큰 번호의 스텝에 매핑될 수 있다. 원본 영상은 스텝 0에 매핑될 수 있다. 가장 큰 번호의 스텝 에 매핑된 트레이닝 영상은, 노이즈 영상으로 정의될 수 있다. 도 5에서, 원본 영상(X)에 노이즈 값들을 결합됨으로써 T개의 트레이닝 입력들(X, X, ... X(T))이 생 성될 수 있다. 원본 영상에서부터 노이즈 영상까지 스텝이 증가함에 따라, 각 영상의 변화량(dx)은 순방향 (Forward) 확률미분방정식(stochastic differential equation; SDE)으로 표현될 수 있다:"}
{"patent_id": "10-2022-0043351", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기서, f(x, t)는 SDE의 드리프트 계수(drift coefficient)를 나타내고, g(t)는 SDE의 디퓨전 계수(diffusion coefficient)를 나타내고, w는 Wiener 프로세스를 나타내고, x는 영상의 데이터 값을 나타낼 수 있다. 일 실시예에 따른 트레이닝 장치는, 원본 영상에 설정된 스텝의 번호에 매핑된 노이즈 분포로부터 샘플링된 노 이즈 값들을 원본 영상에 결합함으로써 대상 트레이닝 입력(예: 동요시킨(perturbed) 영상)을 생성할 수 있다. 트레이닝 장치는 대상 트레이닝 입력에 적용됨으로써 결합된 노이즈 값들을 추정하는 스코어를 출력하도록 기계 학습 모델을 트레이닝시킬 수 있다. 스코어는 대상 트레이닝 입력의 스텝(예: 스텝 5)의 직전 스텝(예: 스텝 4)의 트레이닝 입력을 기준으로 결합된 것으로 추정되는 노이즈 값들을 나타낼 수 있다. 다시 말해, 트레이닝 장치는 대상 트레이닝 입력(예: 스텝 5의 트레이닝 입력)으로부터 직전 스텝의 트레이닝 입력(예: 스텝 4의 트 레이닝 입력)을 복원하기 위한 스코어를 출력하도록 기계 학습 모델을 트레이닝시킬 수 있다. 일 실시예에 따른 프로세서는, 출력 영상의 획득을 위하여 스코어 산출 및 출력 영상 획득을 반복할 수 있다. 예를 들어, 프로세서는 획득된 대상 영상에 스텝 N에 매핑된 노이즈 분포로부터 샘플링된 노이즈 값들을 결합함 으로써 입력 영상을 획득할 수 있다. 스텝 N에 매핑된 노이즈 분포로부터 샘플링된 노이즈 값들이 결합된 입력 영상은 스텝 N의 입력 영상으로 표현될 수 있다. 프로세서는 입력 영상에 트레이닝된 기계 학습 모델에 적용함 으로써 스코어를 획득할 수 있다. 프로세서는 획득된 스코어에 기초하여 입력 영상의 픽셀 값을 조정함으로써 임시 출력 영상을 획득할 수 있다. 프로세서는 입력 영상 및 임시 출력 영상에 기초하여 출력 영상을 획득할 수 있다. 예를 들어, 프로세서는 입력 영상의 정상 영역 및 임시 출력 영상의 일부 영역에 기초하여 출력 영상 을 획득할 수 있다. 프로세서는 입력 영상의 정상 영역과 다른 영역을 임시 출력 영상의 일부 영역으로 변경함 으로써 프로세서는 입력 영상은 입력 영상을 출력 영상으로 업데이트할 수 있다. 업데이트된 입력 영상은 스텝 N의 직전 스텝, 다시 말해, 스텝 N-1의 입력 영상으로 표현될 수 있다. 프로세서는 출력 영상의 획득을 반복함 으로써, 스텝 0의 출력 영상을 획득할 수 있다. 프로세서는 스텝 0의 입력 영상을 출력 영상으로 획득할 수 있 다. 노이즈 영상에서부터 원본 영상까지 스텝이 감소함에 따라, 각 영상의 변화량(dx)은 역방향(Reverse) 확률미분 방정식(stochastic differential equation; SDE)으로 표현될 수 있다:"}
{"patent_id": "10-2022-0043351", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "여기서, f(x, t)는 SDE의 드리프트 계수(drift coefficient)를 나타내고, g2(t)는 SDE의 디퓨전 계수(diffusion coefficient)를 나타내고, x는 영상의 데이터 값을 나타내고, 는 스코어를 나타내고, 는 역 (reverse) Wiener 프로세스를 나타낼 수 있다. 참고로, 전술한 동작에 따라 트레이닝된 기계 학습 모델은, 생성 모델로서, 스코어 기반 생성 모델(score-based generative model) 또는 디퓨젼 모델(diffusion model)로 표현될 수 있고, 또한 트레이닝을 위한 동작을 디퓨 젼 프로세스(diffusion process)로 표현될 수 있다. 도 6 및 도 7은 일 실시예에 따른 복원 영상의 획득 및 복원 영상의 정상 영역의 결정을 반복하는 동작을 나타 낸다. 일 실시예에 따른 프로세서(예: 도 1의 프로세서)는 복원 영상을 반복적으로 획득할 수 있다. 단계에서, 프로세서는 획득된 복원 영상을 대상 영상으로 이용함으로써, 복원 영상을 업데이트할 수 있다. 프로세서는 대상 영상에 기초하여 획득된 복원 영상으로 대상 영상을 업데이트할 수 있다. 프로세서는 결정된 복원 영상의 정상 영역으로 대상 영상의 정상 영역을 업데이트할 수 있다. 일 실시예에 따른 프로세서는 획득된 복원 영상(예: 업데이트된 대상 영상) 및 노이즈 값들에 기초하여 다른 입 력 영상을 생성할 수 있다. 프로세서는, 다른 입력 영상에 기계 학습 모델을 적용함으로써 다른 스코어를 산출 할 수 있다. 프로세서는 산출된 다른 스코어에 기초하여 다른 출력 영상을 획득할 수 있다. 프로세서는 결정 된 복원 영상의 정상 영역에 기초하여 다른 복원 영상을 획득할 수 있다. 예를 들어, 프로세서는 획득된 복원 영상(예: 업데이트된 대상 영상) 및 다른 출력 영상에 기초하여 다른 복원 영상을 획득할 수 있다. 프로세서는 획득된 복원 영상의 정상 영역과 다른 영역을 다른 출력 영상의 일부 영역으로 변경함으로써 다른 복원 영상을 획득할 수 있다. 일 실시예에 따른 프로세서는 획득된 복원 영상 및 노이즈 값들에 기초하여 생성된 다른 입력 영상으로 입력 영 상을 업데이트할 수 있다. 프로세서는 업데이트된 입력 영상에 기계 학습 모델을 적용함으로써 산출된 스코어 로 스코어를 업데이트할 수 있다. 프로세서는 업데이트된 스코어에 기초하여 획득된 출력 영상으로 출력 영상 을 업데이트할 수 있다. 프로세서는 업데이트된 대상 영상의 정상 영역에 기초하여 다른 복원 영상을 획득할 수 있다. 예를 들어, 프로세서는 업데이트된 대상 영상 및 업데이트된 출력 영상에 기초하여 획득된 복원 영상 으로 복원 영상을 업데이트할 수 있다. 프로세서는 업데이트된 대상 영상의 정상 영역과 다른 영역을 업데이트 된 출력 영상의 일부 영역으로 변경함으로써 복원 영상을 업데이트할 수 있다. 단계에서, 프로세서는 복원 영상의 정상 영역의 결정을 반복할 수 있다. 프로세서는 복원 영상을 업데이 트할 때마다 해당 복원 영상의 정상 영역을 결정할 수 있다. 도 3에서 전술한 바와 같이, 프로세서는 대상 영상의 정상 영역보다 큰 크기의 정상 영역을 가지는 복원 영상을 획득할 수 있다. 프로세서는 복원 영상 및 복원 영상의 정상 영역 결정을 반복함으로써, 점진적으로 복원 영상 의 정상 영역을 증가시킬 수 있다. 일 실시예에서, 프로세서는 복원 영상의 정상 영역이 미리 결정된 크기보다 크거나 같은 크기를 가지는 경우에 복원 영상 획득 및 복원 영상의 정상 영역 결정의 반복을 중단할 수 있다. 다른 일 실시예에서, 프로세서는 미 리 결정된 횟수만큼 복원 영상의 획득 및 복원 영상의 정상 영역 결정을 반복할 수 있다. 일 실시예에 따른 프로세서는 대상 영상 및 복원 영상 간의 차이가 임계를 초과하는 영역을 복원 영상의 정상 영역의 결정으로부터 배제할 수 있다. 차이가 임계를 초과하는 영역은 복원 영상이 대상 영상의 고유한 특징을 가지지 않는 것으로 판단될 수 있기 때문이다. 프로세서는, 복원 영상으로 대상 영상을 업데이트할 수 있다. 프로세서는, 복원 영상의 대상 영상의 고유한 특징을 가지지 않는 영역(예: 복원 영상(또는 업데이트된 대상 영 상)의 정상 영역과 다른 영역)을 다시 복원할 수 있다. 프로세서는 복원 영상의 획득을 반복적으로 수행함으로 써, 점진적으로 복원 영상의 정상 영역의 크기를 증가시키고, 대상 영상과 유사한 정상 안저에 대한 영상을 획 득할 수 있다.알고리즘 1은 일 실시예에 따른 영상 처리 방법을 나타낼 수 있다."}
{"patent_id": "10-2022-0043351", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "여기서, 는 복원 영상의 정상 영역을 나타내고, 는 대상 영상(또는 원본 영상)을 나타내며, 는 복원 영상 의 정상 영역의 결정에 관한 임계를 나타내고, 은, 평균이 이고 분산이 인 가우시안 분포를 따르는 확 률 변수로서, 0번째 이터레이션(iteration)의 스텝 T의 입력 영상(예: 교란 영상)을 나타내며, 는 평균이 0이 고 분산(variance)가 인 가우시안 분포를 따르는 확률 변수로서, 스텝마다 결합되는 노이즈를 나타낼 수 있다. 알고리즘 1의 행 3 내지 5에서, 프로세서는 복원 영상의 정상 영역 및 대상 영상의 업데이트를 반복할 수 있다. k는 복원 영상 획득 및 복원 영상의 정상 영역 결정에 대한 이터레이션(iteration)을 나타내는 변수일 수 있다. 여기서, 는 k번째 이터레이션(iteration)의 복원 영상의 정상 영역을 나타내고, 는 k번째 이터레이션 (iteration)의 스텝(step) N의 임시 출력 영상을 나타낼 수 있다. 알고리즘 1의 행 4에서, 프로세서는 복원 영상의 정상 영역을 업데이트할 수 있다. 알고리즘 1의 행 5에서, 프로세서는 k-1번째 반복에서 획득된 복원 영상으로 k번째 이터레이션의 대상 영상을 업데이트할 수 있다. 프로세서는, 대상 영상의 정상 영역 및 출력 영상의 나머지 영상을 대상 영상으로 획득할 수 있다. 알고리즘 1의 행 6 내지 9에서, 프로세서는 임시 출력 영상의 획득을 반복함으로써 출력 영상을 획득할 수 있다. i는 입력 영상에 기초하여 출력 영상을 생성함에 있어서, 임시 출력 영상의 획득에 대응하는 스텝(ste p)의 반복을 나타내는 변수일 수 있다. 알고리즘 1의 행 7에서, 프로세서는 입력 영상에 기계 학습 모델을 적용함으로써 산출된 스코어에 기초하여 출 력 영상을 획득할 수 있다. 프로세서는, 산출된 스코어와 함께 스텝 i+1의 노이즈 분포의 분산 및 스텝 i의 노 이즈 분포의 분산 간의 차이에 기초하여 임시 출력 영상을 획득할 수 있다. 여기서, 는 k번째 이터레이 션의 스텝 i+1의 입력 영상을 나타내고, 는 k번째 이터레이션의 스텝 i의 임시 출력 영상을 나타낼 수 있고, 는 스텝 i의 노이즈 분포의 분산을 나타낼 수 있고, 는 스텝 i+1의 입력 영상에 기계 학습 모델 을 적용함으로써 획득된 스코어 벡터를 나타낼 수 있다. 알고리즘 1의 행 8에서, 프로세서는 대상 영상에 노이 즈 값들을 결합할 수 있다. 여기서, 는 원본 영상( )에 노이즈 값들을 결합함으로써 획득된 스텝 i의 대상 영상을 나타낼 수 있다. 알고리즘 1의 행 9에서, 프로세서는 대상 영상 및 임시 출력 영상에 기초하여 출력 영 상을 획득할 수 있다. 프로세서는 출력 영상의 획득을 반복할 수 있다. 예를 들어, 프로세서는 획득된 출력 영상으로 입력 영상을 업데이트할 수 있다. 프로세서는 업데이트된 입력 영상으로부터 다른 출력 영상을 획득 할 수 있다. 알고리즘 1의 행 10 내지 12에서, 프로세서는 출력 영상의 획득을 반복할 수 있다. 여기서, 는, 충분히 작 은 값으로서, 스텝 i에 매핑된 임계 값 이하의 값을 나타낼 수 있다. j는 출력 영상의 획득 스텝을 나타내는 변수일 수 있다. 예를 들어, 프로세서는 스텝 j의 노이즈 분포에 기초한 출력 영상의 획득을 반복할 수 있다. 이상에서 설명된 실시예들은 하드웨어 구성요소, 소프트웨어 구성요소, 및/또는 하드웨어 구성요소 및 소프트웨 어 구성요소의 조합으로 구현될 수 있다. 예를 들어, 실시예들에서 설명된 장치, 방법 및 구성요소는, 예를 들 어, 프로세서, 콘트롤러, ALU(arithmetic logic unit), 디지털 신호 프로세서(digital signal processor), 마 이크로컴퓨터, FPGA(field programmable gate array), PLU(programmable logic unit), 마이크로프로세서, 또는 명령(instruction)을 실행하고 응답할 수 있는 다른 어떠한 장치와 같이, 범용 컴퓨터 또는 특수 목적 컴퓨터를 이용하여 구현될 수 있다. 처리 장치는 운영 체제(OS) 및 상기 운영 체제 상에서 수행되는 소프트웨어 애플리 케이션을 수행할 수 있다. 또한, 처리 장치는 소프트웨어의 실행에 응답하여, 데이터를 접근, 저장, 조작, 처 리 및 생성할 수도 있다. 이해의 편의를 위하여, 처리 장치는 하나가 사용되는 것으로 설명된 경우도 있지만,"}
{"patent_id": "10-2022-0043351", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "해당 기술분야에서 통상의 지식을 가진 자는, 처리 장치가 복수 개의 처리 요소(processing element) 및/또는 복수 유형의 처리 요소를 포함할 수 있음을 알 수 있다. 예를 들어, 처리 장치는 복수 개의 프로세서 또는 하 나의 프로세서 및 하나의 컨트롤러를 포함할 수 있다. 또한, 병렬 프로세서(parallel processor)와 같은, 다른 처리 구성(processing configuration)도 가능하다. 소프트웨어는 컴퓨터 프로그램(computer program), 코드(code), 명령(instruction), 또는 이들 중 하나 이상의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결합적으로 (collectively) 처리 장치를 명령할 수 있다. 소프트웨어 및/또는 데이터는, 처리 장치에 의하여 해석되거나 처리 장치에 명령 또는 데이터를 제공하기 위하여, 어떤 유형의 기계, 구성요소(component), 물리적 장치, 가상 장치(virtual equipment), 컴퓨터 저장 매체 또는 장치, 또는 전송되는 신호 파(signal wave)에 영구적으로, 또는 일시적으로 구체화(embody)될 수 있다. 소프트웨어는 네트워크로 연결된 컴퓨터 시스템 상에 분산되어서, 분산된 방법으로 저장되거나 실행될 수도 있다. 소프트웨어 및 데이터는 컴퓨터 판독 가능 기록 매체에 저장될 수 있다. 실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단 독으로 또는 조합하여 포함할 수 있으며 매체에 기록되는 프로그램 명령은 실시예를 위하여 특별히 설계되고 구 성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 위에서 설명한 하드웨어 장치는 실시예의 동작을 수행하기 위해 하나 또는 복수의 소프트웨어 모듈로서 작동하 도록 구성될 수 있으며, 그 역도 마찬가지이다."}
{"patent_id": "10-2022-0043351", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "이상과 같이 실시예들이 비록 한정된 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가진 자라면 이를 기초로 다양한 기술적 수정 및 변형을 적용할 수 있다. 예를 들어, 설명된 기술들이 설명된 방법과 다른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다. 그러므로, 다른 구현들, 다른 실시예들 및 특허청구범위와 균등한 것들도 후술하는 특허청구범위의 범위에 속한 다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7"}
{"patent_id": "10-2022-0043351", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 따른 영상 처리 장치를 나타낸다. 도 2는 일 실시예에 따른 영상 처리 장치의 프로세서의 동작을 나타낸다. 도 3은 일 실시예에 따른 영상 처리 장치의 프로세서에 의한 복원 영상 획득 및 복원 영상의 정상 영역 결정 동 작을 나타낸다. 도 4는 일 실시예에 따른 기계 학습 모델을 이용하여 출력 영상의 획득을 나타낸다. 도 5는 일 실시예에 따른 기계 학습 모델의 스코어를 이용하여 출력 영상을 획득하는 동작을 나타낸다. 도 6 및 도 7은 일 실시예에 따른 복원 영상의 획득 및 복원 영상의 정상 영역의 결정을 반복하는 동작을 나타 낸다."}
