{"patent_id": "10-2019-0168831", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0077321", "출원번호": "10-2019-0168831", "발명의 명칭": "시설물 외관조사를 위한 빅데이터 구축방법", "출원인": "국토안전관리원", "발명자": "남우석"}}
{"patent_id": "10-2019-0168831", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "시설물 외관조사를 수행하는 인공지능의 딥러닝에 제공되는 빅데이터 구축방법에 있어서, 시설물의 손상에 대한 영상데이터를 획득하는 획득단계; 및획득된 영상데이터를 카테고리별로 분류하는 분류단계를 포함하고,상기 획득단계는,과거 안전점검 시 촬영된 영상을 획득하는 단계; 및웹사이트로부터 영상을 추출하는 단계를 포함하고,상기 분류단계에서 상기 카테고리는,손상이 있는 것으로 판단된 손상범주;손상은 아니나 손상과 유사한 것으로 판단된 유사범주; 및손상확인이 불가하다고 판단된 확인불가범주를 포함하는,시설물 외관조사를 위한 빅데이터 구축방법."}
{"patent_id": "10-2019-0168831", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 획득단계는,손상 유형 별로 촬영한 영상을 획득하는 단계를 더 포함하고,상기 분류단계에서,상기 손상 유형 별로 촬영한 영상은 상기 손상범주로 분류되는,시설물 외관조사를 위한 빅데이터 구축방법."}
{"patent_id": "10-2019-0168831", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 손상범주는손상의 크기 정보가 포함된 제1 하위범주; 및그 외로 분류되는 제2 하위범주를 포함하는,시설물 외관조사를 위한 빅데이터 구축방법."}
{"patent_id": "10-2019-0168831", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,손상의 크기에 대한 척도를 제공하는 척도수단을 포함하는 영상은 상기 제1 하위범주로 분류되는,시설물 외관조사를 위한 빅데이터 구축방법."}
{"patent_id": "10-2019-0168831", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,공개특허 10-2021-0077321-3-상기 분류단계 이후에, 영상의 명도, 채도, 크기, 색상, 색조, 선명도 중 적어도 하나를 변경하여 영상데이터를 가공하는 가공단계를더 포함하는,시설물 외관조사를 위한 빅데이터 구축방법."}
{"patent_id": "10-2019-0168831", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 가공단계는,상기 확인불가범주 외의 카테고리로 분류된 영상을 가공하는,시설물 외관조사를 위한 빅데이터 구축방법."}
{"patent_id": "10-2019-0168831", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 확인불가범주로 분류된 영상데이터는 인공지능의 딥러닝에 제공되지 않는, 시설물 외관조사를 위한 빅데이터 구축방법."}
{"patent_id": "10-2019-0168831", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 시설물 외관조사를 위한 빅데이터 구축방법은, 시설물 외관조사를 수행하는 인공지 능의 딥러닝에 제공되는 빅데이터 구축방법에 있어서, 시설물의 손상에 대한 영상데이터를 획득하는 획득단계; 및 획득된 영상데이터를 카테고리별로 분류하는 분류단계를 포함하고, 상기 획득단계는, 과거 안전점검 시 촬영 된 영상을 획득하는 단계; 및 웹사이트로부터 영상을 추출하는 단계를 포함하고, 상기 분류단계에서 상기 카테고 리는, 손상이 있는 것으로 판단된 손상범주; 손상은 아니나 손상과 유사한 것으로 판단된 유사범주; 및 손상확인 이 불가하다고 판단된 확인불가범주를 포함할 수 있다."}
{"patent_id": "10-2019-0168831", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 시설물 외관조사를 위한 빅데이터 구축방법에 관한 것이다."}
{"patent_id": "10-2019-0168831", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "시설물은 건설된 이후에 시간이 지남에 따라 노후화가 진행되므로, 시설물의 노화 상태를 파악하기 위해 안전하 고 신뢰도 있는 검사 방법이 필요하다. 시설물은 시설물 안전관리에 관한 특별법에 정한 주기나 수준에 의해 점검 및 진단을 받는다. 이러한 과정에서 가장 중요한 기본조사인 외관조사는 육안에 의존하여 수행된다. 육안에 의한 조사는 점검자 주관에 의존하기 때문에 누락이나 오류로 인해 자칫 대형사고로 이어질 수 있으며 정밀하고 객관적인 점검결과가 필요한 실정이다. 4차 산업혁명 기술인 인공지능(AI) 기술이 전 분야에 활발히 적용 중인 바, 시설물 안전점검 분야에서도 연구개 발이 활발히 진행되고 있다. AI 기술의 활용도를 높이고 신뢰성을 확보하기 위해서는 양질의 학습데이터 취득이 중요하다. 본 발명의 발명자는 시설물 외관조사를 수행하는 AI에 학습데이터를 효과적으로 제공할 수 있도록, 시설물 외관 조사를 위한 빅데이터 구축방법에 대해 오랫동안 연구하고 시행착오를 거친 끝에 본 발명을 완성하기에 이르렀 다."}
{"patent_id": "10-2019-0168831", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 시설물 외관조사를 수행하는 AI에 학습데이터를 효과적으로 제공할 수 있는, 시설물 외관조사 를 위한 빅데이터 구축방법을 제공하는 것이다. 본 발명의 명시되지 않은 또 다른 목적들은 하기의 상세한 설명 및 그 효과로부터 용이하게 추론할 수 있는 범 위 내에서 추가적으로 고려될 것이다."}
{"patent_id": "10-2019-0168831", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 측면에 따르면, 시설물 외관조사를 수행하는 인공지능의 딥러닝에 제공되는 빅데이터 구축방법에 있어서, 시설물의 손상에 대한 영상데이터를 획득하는 획득단계; 및 획득된 영상데이터를 카테고리별로 분류하 는 분류단계를 포함하고, 상기 획득단계는, 과거 안전점검 시 촬영된 영상을 획득하는 단계; 및 웹사이트로부터 영상을 추출하는 단계를 포함하고, 상기 분류단계에서 상기 카테고리는, 손상이 있는 것으로 판단된 손상범주; 손상은 아니나 손상과 유사한 것으로 판단된 유사범주; 및 손상확인이 불가하다고 판단된 확인불가범주를 포함 하는, 시설물 외관조사를 위한 빅데이터 구축방법이 제공된다. 상기 획득단계는, 손상 유형 별로 촬영한 영상을 획득하는 단계를 더 포함하고, 상기 분류단계에서, 상기 손상 유형 별로 촬영한 영상은 상기 손상범주로 분류될 수 있다. 상기 손상범주는 손상의 크기 정보가 포함된 제1 하위범주; 및 그 외로 분류되는 제2 하위범주를 포함할 수 있 다. 손상의 크기에 대한 척도를 제공하는 척도수단을 포함하는 영상은 상기 제1 하위범주로 분류될 수 있다. 상기 분류단계 이후에, 영상의 명도, 채도, 크기, 색상, 색조, 선명도 중 적어도 하나를 변경하여 영상데이터를 가공하는 가공단계를 더 포함할 수 있다. 상기 가공단계는, 상기 확인불가범주 외의 카테고리로 분류된 영상을 가공할 수 있다. 상기 확인불가범주로 분류된 영상데이터는 인공지능의 딥러닝에 제공되지 않을 수 있다."}
{"patent_id": "10-2019-0168831", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따르면, 시설물 외관과 관련된 영상데이터를 효과적으로 구축할 수 있다. 본 발명의 실시예에 따르면, AI에 양질의 학습데이터를 제공할 수 있다. 한편, 여기에서 명시적으로 언급되지 않은 효과라 하더라도, 본 발명의 기술적 특징에 의해 기대되는 이하의 명 세서에서 기재된 효과 및 그 잠정적인 효과는 본 발명의 명세서에 기재된 것과 같이 취급됨을 첨언한다."}
{"patent_id": "10-2019-0168831", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명을 설명함에 있어서 관련된 공지기능에 대하여 이 분야의 기술자에게 자명한 사항으로서 본 발명의 요지 를 불필요하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명을 생략한다. 본 출원에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함 하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조 합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 이하, 본 발명에 따른 시설물 외관조사를 위한 빅데이터 구축방법을 첨부도면을 참조하여 상세히 설명하기로 하 며, 첨부 도면을 참조하여 설명함에 있어, 동일하거나 대응하는 구성 요소는 동일한 도면번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 도 1은 인공지능에 의한 시설물 외관조사 방법을 나타낸 도면이다. 도 2는 본 발명의 일 실시예에 따른 시설물 외관조사를 위한 빅데이터 구축방법을 나타낸 순서도이다. 도 3는 본 발명의 일 실시예에 따른 시설물 외관조사 를 위한 빅데이터 구축방법에서 획득단계, 분류단계, 가공단계를 나타낸 도면이다. 도 4는 본 발명의 일 실시예 에 따른 시설물 외관조사를 위한 빅데이터 구축방법에서 손상범주로 분류된 실제 영상을 나타낸 사진이다. 도 5 는 본 발명의 일 실시예에 따른 시설물 외관조사를 위한 빅데이터 구축방법에서 유사범주와 확인불가범주로 분 류된 실제 영상을 나타낸 사진이다. 도 1을 참조하면, 인공지능은 시설물 외관조사를 수행할 수 있도록 학습할 수 있다. 시설물 외관조사는 시설물 의 외관의 손상에 대해 조사하는 것이다. 조사대상 이미지를 인공지능에 입력하면, 인공지능은 이를 분석하여 시설물 외관조사 결과를 도출할 수 있다. 인공지능은 시설물 외관조사를 수행할 수 있도록 시설물 외관 영상에 대해 학습(딥러닝)한다. 다양한 방식으로 획득되는 영상은 저장 및 분류되어 빅데이터로 구축될 수 있다. 인공지능은 이러한 빅데이터를 학습데이터로 사 용한다. 한편, 인공지능이 분석한 결과는 다시 빅데이터로 업데이트될 수 있다. 본 발명에 따른 시설물 외관조사를 위한 빅데이터 구축방법은 시설물 외관조사를 수행하는 인공지능의 딥러닝에 제공되는 빅데이터를 구축하는 방법이다. 도 2를 참조하면, 본 발명에 따른 시설물 외관조사를 위한 빅데이터 구축방법은, 영상데이터를 획득단계(S100); 및 획득된 영상데이터를 분류하는 분류단계(S200)를 포함하고, 영상데이터를 가공하는 가공단계(S300)를 더 포 함할 수 있다. 획득단계(S100)는 시설물의 손상에 대한 영상데이터를 획득하는 단계이다. 시설물의 손상은 시설물 외관의 손상 일 수 있다. 획득단계(S100)는, 과거 안전점검 시 촬영된 영상을 획득하는 단계(S110); 및 웹사이트로부터 영상을 추출하는 단계(S120)를 포함할 수 있다. 과거 안전점검 시 촬영된 영상을 획득하는 단계(S110)는 국토부 또는 시설안전공단 등의 기관에서 정기적 또는 비정기적으로 시행하는 안전점검에서 촬영한 영상(정지영상(사진) 및/또는 동영상을 의미하며, 이하 동일함)을 획득하는 단계이다. 상술한 각 기관의 서버에 영상이 저장되어 있으므로, 본 발명에서는 각 기관의 서버로부터 영상을 획득할 수 있다. 예를 들어, 관리자가 각 기관의 서버에서 영상을 본 발명의 서버로 옮겨서 저장할 수 있다. 과거 안전점검 시 촬영한 영상은 시설물을 촬영한 것으로서, 손상을 포함 또는 미포함할 수 있다. 웹사이트로부터 영상을 추출하는 단계(S120)는 스크래핑(scrapping) 또는 크롤링(crawling) 등의 방식을 통해 웹사이트로부터 시설물에 관한 영상을 수집하는 단계이다. 시설물에 관한 영상 추출은, 웹사이트에 검색어를 입력하고, 해당 검색어에 따라 검색된 영상을 모두 수집함으 로써 이루어질 수 있다. 검색어는 시설물의 명칭, 시설물의 부분 명칭, 손상 유형 중 적어도 하나를 포함할 수 있다. 웹사이트로부터 추출된 영상은 손상을 포함 또는 미포함할 수 있다. 또한, 시설물과 관련 없는 노이즈(noise)를 포함할 수도 있다.분류단계(S200)는 획득된 영상데이터를 카테고리별로 분류하는 분류단계이다. 즉, 과거 안전점검 시 촬영한 영 상, 그리고 웹사이트로부터 추출한 영상을 소정의 카테고리별로 분류하는 단계이다. 카테고리는 손상이 있는 것으로 판단된 손상범주; 손상은 아니나 손상과 유사한 것으로 판단된 유사범주; 및 손 상확인이 불가하다고 판단된 확인불가범주를 포함할 수 있다. 손상범주는 시설물에 육안으로 구분 가능한 손상이 발생한 영상을 포함한다. 손상은 유형에 따라 분류될 수 있다. 손상 유형은 콘크리트 손상과 강재 손상으로 구분될 수 있다. 콘크리트 손 상은, 균열, 망상균열, 박리/박락, 철근노출, 백태를 포함할 수 있다. 강재 손상은 부식, 도장손상을 포함할 수 있다. 균열은 콘크리트 외벽에 형성된 갈라짐이며, 선형으로 형성될 수 있다. 방향에 따라 축방향(종방향), 축과 직각 방향(수평방향), 경사방향(대각선방향)으로 구분될 수 있다. 망상균열은 거북등균열이라고도 하며 불규칙한 방향성을 가지는 균열이다. 박리/박락은 콘크리트 표면 일부가 떨어져 나간 것이다. 박리/박락은 동결 융해 등과 같은 원인에 의해 발생될 수 있다. 콘크리트 박리(scaling)는 콘크리트 표면의 모르타르가 점진적으로 손실되는 현상이며, 박락 (spalling)은 콘크리트가 균열을따라서 일부 조각이 떨어져 나가는 현상이다. 박락은 층분리 현상을 포함하는 개념으로 이해할 수 있다. 철근노출은 콘크리트 내부의 철근이 노출된 것이다. 백태(efflorescence)는 노후화된 콘크리트 표면에 발생되는 백색의 결정으로，콘크리트중의 황산 칼슘, 황산 마 그네슘, 수산화칼슘 등이 물에 녹아 침출되어 대기 중 의 탄산가스와 화합되어 생성될 수 있다. 백태가 발생되 는 원인은 콘크리트 타설 직후 시멘트 중의 가용 성분이 표면에서 석출되기도 하며, 콘크리트 구조체에 우수 및 지하수 등이 침입하여 콘크리트 중의 가용 성분이 콘크리트 표면으로 이동되어 발생될 수 있다. 백태는 콘크리 트 구조물에 모세관 공극 또는 균열이 발생된 결함부로 물이 침투하고 있는 부위에서 발생될 수 있다. 따라서 백태가 발생한 부위에 대한 상세 점검을 실시하시고 균열 등의 결함 유무를 판단하여 구조물에 대한 근본적인 보수를 우선적으로 시행할 수 있어야 한다. 강재 부식은 강재가 산화되어 부식된 것이며, 도장손상은 강재의 도막이 손상된 유형이다. 손상범주는 손상의 크기 정보가 포함된 제1 하위범주; 및 그 외로 분류되는 제2 하위범주를 포함할 수 있다. 제1 하위범주는 시설물에 육안으로 구분 가능한 손상이 확인되고, 또한, 그 손상의 크기 정보를 포함하는 영상 을 포함한다. 제1 하위범주는 손상의 크기에 대한 척도를 제공하는 척도수단을 포함하는 영상을 포함한다. 예를 들어, 손상과 눈금자가 함께 촬영된 영상을 포함할 수 있다. 눈금자는 균열자를 포함할 수 있다. 눈금자의 눈금은 손상과 인접하여 위치할 수 있고, 영상으로부터 손상의 크기를 직관적으로 알 수 있다. 제2 하위범주는 시설물에 육안으로 구분 가능한 손상이 확인되나, 손상의 크기 정보를 직관적으로 알 수 없는 영상을 포함할 수 있다. 제1 하위범주와 제2 하위범주 각각 손상의 유형 별로 다시 세분화될 수 있다. 유사범주는 시설물에 손상이 발생하지 않았으나, 손상과 혼동 가능한 부분이 촬영된 영상을 포함할 수 있다. 혼 동이 가능한 부분은 콘크리트의 음각 장식, 시공 이음부, 거미줄, 식물, 그림(낙서), 글자 중 적어도 하나일 수 있다. 유사범주의 카테고리를 두는 것은 인공지능의 학습의 정확도를 향상시키기 위함이다. 확인불가범주는 시설물에 육안으로 구분 가능한 손상의 유무가 확인되지 않는 영상을 포함할 수 있다. 예를 들 어, 손상과 백묵이 겹쳐진 경우, 손상이 육안으로 구분 불가능하므로 손상확인이 불가능한 것으로 볼 수 있다. 이러한 확인불가범주의 영상은 인공지능의 학습데이터로 부적절한 것으로 볼 수 있으므로, 인공지능의 딥러닝에 는 활용되지 않을 수 있다. 획득단계(S100)는, 손상 유형 별로 촬영한 영상을 획득하는 단계(S130)를 더 포함할 수 있다. 손상 유형 별로 촬영한 영상을 획득하는 단계(S130)는 상술한 손상의 유형 별로 적어도 하나의 영상을 촬영하여 획득하는 단계이다. 손상 유형 별로 목적성을 가지고 영상을 촬영하고 수집하게 되면, 손상 유형의 표준을 설정할 수 있다. 손상 유형 별로 촬영한 영상은, 분류단계(S200)에서 손상범주로 분류될 수 있다. 또한, 손상범주 내에서 손상 유형 별로 세분화되어 저장될 수 있다. 가공단계(S300)는 분류단계(S200) 이후에, 분류된 영상데이터를 가공하는 단계로, 영상의 명도, 채도, 크기, 색 상, 색조, 선명도 중 적어도 하나를 변경할 수 있다. 예를 들어, 가공단계(S300)에서 영상은 모두 흑백화될 수 있다. 가공단계(S300)에서 가공의 대상이 되는 영상데이터는 분류단계(S200)에서 손상범주, 유사범주로 분류된 영상이 다. 즉, 가공단계(S300)에서 상기 확인불가범주 외의 카테고리로 분류된 영상을 가공할 수 있다. 확인불가범주 에 속하는 영상은 인공지능의 딥러닝에 제공되지 않으므로, 가공할 필요가 없다. 도 3을 참조하면, 과거 안전점검을 통해 획득한 영상, 웹사이트에서 추출한 영상, 손상유형 별로 별도로 획득한 영상은 각각 손상범주(10, 20), 유사범주, 확인불가범주로 분류될 수 있다. 특히, 척도수단을 포함하는 영상은 손상범주 중 제1 하위범주로 분류되며, 척도수단을 포함하지 않는 영상은 손상범주 중 제2 하위범주 로 분류될 수 있다. 또한, 손상범주(10, 20)에 속하는 영상은 손상 유형 별로 세분류될 수 있다. 과거 안전점검을 통해 획득한 영상 중 손상을 포함하는 영상은 손상범주(10, 20)로 분류될 수 있다. 손상유형 별로 별도로 획득한 영상은 모두 손상범주(10, 20)로 분류될 수 있다. 웹사이트에서 추출한 영상은 손상범주 (10, 20), 유사범주, 확인불가범주로 분류될 수 있다. 제1 하위범주, 제2 하위범주, 유사범주에 속하는 영상은 가공될 수 있다. 이렇게 가공된 영상은 인 공지능의 딥러닝에 제공될 수 있다. 이 경우, 확인불가범주로 분류된 영상데이터는 인공지능의 딥러닝에 제공되 지 않는다. 도 4(a)를 참조하면, 육안으로 식별 가능한 손상과 척도수단을 함께 촬영한 영상이 도시되어 있다. 이러한 영상 은 손상범주의 제1 하위범주로 분류될 수 있다. 도 4(b)를 참조하면, 척도수단이 없으며, 식별 가능한 손상이 촬영된 영상이 도시되어 있다. 이러한 영상은 손 상범주의 제2 하위범주로 분류될 수 있다. 도 5(a)를 참조하면, 손상과 혼동될 수 있는 영상이 도시되어 있다. 이음부, 양각, 음각을 포함하는 이러한 영 상은 유사범주로 분류될 수 있다. 도 5(b)를 참조하면, 손상확인이 불가능한 영상이 도시되어 있다. 이러한 영상은 확인불가범주로 분류될 수 있 다. 본 발명에서, 인공지능의 딥러닝에 활용되는 빅데이터는 대량의 영상데이터이며, 이러한 영상데이터는 손상 유 무, 척도수단 유무, 손상 유형, 손상과 혼동 여부, 확인 불가 등의 기준으로 분류되어 저장될 수 있다. 인공지 능은 분류 저장된 영상데이터로 학습하여 시설물 외관조사 능력을 가질 수 있다. 본 발명의 보호범위가 이상에서 명시적으로 설명한 실시예의 기재와 표현에 제한되는 것은 아니다. 또한, 본 발"}
{"patent_id": "10-2019-0168831", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "명이 속하는 기술분야에서 자명한 변경이나 치환으로 말미암아 본 발명의 보호범위가 제한될 수도 없음을 다시 한 번 첨언한다."}
{"patent_id": "10-2019-0168831", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 인공지능에 의한 시설물 외관조사 방법을 나타낸 도면이다. 도 2는 본 발명의 일 실시예에 따른 시설물 외관조사를 위한 빅데이터 구축방법을 나타낸 순서도이다. 도 3는 본 발명의 일 실시예에 따른 시설물 외관조사를 위한 빅데이터 구축방법에서 획득단계, 분류단계, 가공 단계를 나타낸 도면이다. 도 4는 본 발명의 일 실시예에 따른 시설물 외관조사를 위한 빅데이터 구축방법에서 손상범주로 분류된 실제 영 상을 나타낸 사진이다. 도 5는 본 발명의 일 실시예에 따른 시설물 외관조사를 위한 빅데이터 구축방법에서 유사범주와 확인불가범주로 분류된 실제 영상을 나타낸 사진이다. 첨부된 도면은 본 발명의 기술사상에 대한 이해를 위하여 참조로서 예시된 것임을 밝히며, 그것에 의해 본 발명 의 권리범위가 제한되지는 아니한다."}
