{"patent_id": "10-2020-0059002", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0142319", "출원번호": "10-2020-0059002", "발명의 명칭": "초음파 영상 처리 장치", "출원인": "주식회사 뉴퐁", "발명자": "이재용"}}
{"patent_id": "10-2020-0059002", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "초음파 영상 처리 장치로서,피검자의 신체 부위에 대한 초음파 데이터를 트랜스듀서로부터 획득하는 획득부;상기 획득된 초음파 데이터에 기초하여 생성된 초음파 영상의 분석을 통해 상기 초음파 영상 내 복수의 구조물을 식별하는 분석부; 및상기 복수의 구조물 중 사용자의 선택이 이루어진 선택 구조물에 관한 정보를 상기 초음파 영상과 함께 화면에표시하는 제어부를 포함하고,상기 신체 부위는 얼굴 부위인 것인, 초음파 영상 처리 장치."}
{"patent_id": "10-2020-0059002", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제어부는,상기 선택 구조물에 관한 정보를 상기 초음파 영상 상에 오버랩하여 화면에 표시하되,상기 화면에 표시되는 상기 선택 구조물의 표시 형태를 상기 선택 구조물의 종류에 따라 각기 다르게 제어하는것인, 초음파 영상 처리 장치."}
{"patent_id": "10-2020-0059002", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 선택 구조물의 종류는, 구조물의 속성에 따라 해부학적 구조물 관련 제1 종류와 인공 구조물 관련 제2 종류로 구분되고,제1 종류는 근육, 혈관, 신경 및 피하지방 중 적어도 하나를 포함하고,제2 종류는 보형물 및 리프팅 와이어 중 적어도 하나를 포함하는 것인, 초음파 영상 처리 장치."}
{"patent_id": "10-2020-0059002", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 분석부는,복수의 학습 초음파 영상을 입력값으로 하고 복수의 학습 초음파 영상 각각과 매칭되는 구조물의 종류 정보를출력값으로 하는 딥러닝 모델 기반의 기학습 사항에 기초하여 상기 분석을 수행하고, 상기 딥러닝 모델에 상기초음파 영상을 입력으로 적용함으로써 상기 초음파 영상 내 복수의 구조물의 종류를 식별하는 것인, 초음파 영상 처리 장치."}
{"patent_id": "10-2020-0059002", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2항에 있어서,상기 분석부는,상기 초음파 영상의 생성 이전에 상기 피검자의 신체 부위에 대하여 기 생성된 이전 초음파 영상이 저장부에 존재하는 경우, 상기 이전 초음파 영상을 고려하여 상기 복수의 구조물 중 이상 구조물이 존재하는지 판단하고,상기 제어부는,상기 분석부에서 상기 이상 구조물이 존재하는 것으로 판단되면, 상기 복수의 구조물 중 상기 이상 구조물에 관공개특허 10-2021-0142319-3-한 정보를 이상 구조물이 아닌 비이상 구조물에 관한 정보와 대비하여 보다 인식 또는 식별이 용이한 형태로 표시되도록 제어하는 것인, 초음파 영상 처리 장치."}
{"patent_id": "10-2020-0059002", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 분석부는,상기 이전 초음파 영상이 존재하는 경우, 상기 초음파 영상과 상기 이전 초음파 영상 간의 비교를 통해 상기 이전 초음파 영상 내 구조물을 기준으로 한 상기 초음파 영상 내 구조물 간의 상태 차이를 산출하고,산출 결과, 상기 초음파 영상 내 구조물 중에서 상기 이전 초음파 영상 내 구조물 대비 미리 설정된 차이값 이상으로 상태 차이가 나타나는 구조물을 상기 이상 구조물인 것으로 판단하는 것인, 초음파 영상 처리 장치."}
{"patent_id": "10-2020-0059002", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 제어부는, 상기 피검자의 얼굴 부위에 착용된 마스크 기기의 동작을 제어하고,상기 획득부는, 상기 제어에 응답하여 상기 마스크 기기에 구비된 상기 트랜스듀서로부터 상기 초음파 데이터를무선 통신을 통해 획득하는 것인, 초음파 영상 처리 장치."}
{"patent_id": "10-2020-0059002", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 마스크 기기는,상기 피검자의 얼굴 부위에 착용 가능한 형태로 마련되는 몸체부;상기 몸체부의 내면에 구비되고, 상기 피검자의 얼굴 부위를 향하여 초음파 신호를 조사하고, 상기 피검자로부터 반사되는 초음파 신호에 기초하여 초음파 데이터를 생성하는 트랜스듀서; 및상기 트랜스듀서와 상기 몸체부를 서로 연결시키며, 상기 제어에 응답하여 상기 트랜스듀서를 상기 몸체부의 내면에 형성된 미리 설정된 경로를 따라 이동시키는 이동 제어 유닛을 포함하는 것인, 초음파 영상 처리 장치."}
{"patent_id": "10-2020-0059002", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 제어부는,상기 마스크 기기가 상기 피검자의 얼굴 부위에 정상 착용된 것으로 감지된 경우, 상기 트랜스듀서가 상기 미리설정된 경로를 따라 이동하며 상기 초음파 데이터를 생성하도록 상기 마스크 기기의 동작을 제어하고,상기 정상 착용에 대한 판단은, 상기 마스크 기기의 양측의 내면에 서로 마주하도록 배치된 발광 소자와 수광소자를 이용하여 이루어지는 것인, 초음파 영상 처리 장치."}
{"patent_id": "10-2020-0059002", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에 있어서,상기 제어부는,상기 마스크 기기가 상기 피검자의 얼굴 부위에 정상 착용된 것으로 감지된 경우, 상기 피검자의 얼굴 부위를향하여 노출된 상기 트랜스듀서의 일면이 상기 얼굴 부위에 접촉되도록 상기 트랜스듀서를 상기 내면으로부터돌출 이동시키는 제어를 수행하고,상기 미리 설정된 경로에 대한 상기 트랜스듀서의 이동 제어시, 상기 트랜스듀서의 일면의 일영역에 마련된 압력센서를 통해 측정되는 압력 측정 값이 미리 설정된 압력 범위에 속한 값을 가지도록 하며 상기 트랜스듀서를이동시키는 것인, 초음파 영상 처리 장치.공개특허 10-2021-0142319-4-청구항 11 제10항에 있어서,상기 마스크 기기는,초음파 젤을 저장하는 젤 저장부; 및상기 트랜스듀서와 이웃하여 배치되고, 상기 피검자의 얼굴 부위에 대한 초음파 젤의 도포를 위해 상기 젤 저장부에 저장된 초음파 젤을 상기 얼굴 부위를 향하여 공급하는 젤 공급 노즐부를 포함하고,상기 제어부는, 상기 미리 설정된 경로에 대한 상기 트랜스듀서의 이동시 상기 얼굴 부위를 향하여 초음파 젤이공급되도록 상기 젤 공급 노즐부의 동작을 제어하는 것인, 초음파 영상 처리 장치."}
{"patent_id": "10-2020-0059002", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "초음파 영상 처리 장치에 관한 것이며, 초음파 영상 처리 장치는, 피검자의 신체 부위에 대한 초음파 데이터를 트랜스듀서로부터 획득하는 획득부; 상기 획득된 초음파 데이터에 기초하여 생성된 초음파 영상의 분석을 통해 상기 초음파 영상 내 복수의 구조물을 식별하는 분석부; 및 상기 복수의 구조물 중 사용자의 선택이 이루어진 선 택 구조물에 관한 정보를 상기 초음파 영상과 함께 화면에 표시하는 제어부를 포함하고, 상기 신체 부위는 얼굴 부위일 수 있다."}
{"patent_id": "10-2020-0059002", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본원은 초음파 영상 처리 장치에 관한 것이다. 특히, 본원은 초음파 영상 내에서 피하지방, 근육, 혈관, 보형물 등의 각 구조물들을 식별하고, 식별된 각 구조물들을 서로 다른 색상으로 채색하여 표시되도록 할 수 있는 초음 파 영상 처리 장치에 관한 것이다."}
{"patent_id": "10-2020-0059002", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 초음파 진단 장치는 사람이 들을 수 없는 주파수의 음파(2∼20MHz), 즉 초음파 신호를 피검사체에 쏘아 반사된 초음파 신호로 피검사체의 내부 조직을 영상화시키는 장치이다. 초음파는 서로 다른 두 물질의 경 계에서 반사율이 다르기 때문에 이러한 영상화가 가능할 수 있다. 초음파 진단 장치는 초음파를 이용해 근육, 힘줄, 그리고 많은 내부 장기들, 이들의 크기, 구조와 병리학적 손 상을 실시간으로 단층 영상으로 가시화하는 것이 가능하다. 초음파 진단 장치는, 자기공명영상(MRI)이나 엑스선 전산화 단층 촬영(CT)에 비해 가격이 저렴하고 이동이 용이하다는 장점이 있다. 도 1은 종래의 초음파 진단 장치의 구성 예를 개략적으로 나타낸 도면이다. 도 1을 참조하면, 종래의 초음파 진단 장치는, 모니터(11, 디스플레이부)가 마련되는 장치 본체 및 복수 의 초음파 프로브를 포함할 수 있다. 복수의 초음파 프로브 각각은, 장치 본체에 마련되는 스위치 박스, 스위치 박스에 연결되는 케이블, 및 케이블에 결합되어 초음파 진단을 직접 실행하는 프 로브 하우징을 포함할 수 있다. 그런데, 초음파 진단 장치는 일반적으로 프로브가 케이블을 통해 장치 본체와 연결되어 있기 때문 에, 장치 본체로부터 케이블의 길이에 해당하는 범위 내에서만 초음파 진단의 수행 및 초음파 영상의 획득이 가능하고, 케이블로 인하여 피검자가 진단 자세를 취함에 있어서 제한이 따르는 등의 문제가 있다. 또한, 초음파 진단 장치를 이용한 초음파 영상의 획득은, 일반적으로 사용자(의료진)가 초음파 영상을 획득하고 자 하는 대상 부위에 먼저 초음파 젤을 바르고, 이후 손에 쥔 프로브를 해당 대상 부위에 대해 이동시켜감에 따 라(문지름에 따라) 이루어지는데, 이러한 초음파 영상의 획득 기술은 사용자(의료진)로 하여금 번거로움을 야기 하는 문제가 있다. 본원의 배경이 되는 기술은 한국공개특허공보 제10-2011-0041122호에 개시되어 있다."}
{"patent_id": "10-2020-0059002", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본원은 전술한 종래 기술의 문제점을 해결하기 위한 것으로서, 종래에 프로브가 케이블을 통해 장치 본체와 연 결되어 있음에 따라, 장치 본체로부터 케이블의 길이에 해당하는 범위 내에서만 초음파 진단의 수행 및 초음파 영상의 획득이 가능하고, 케이블로 인하여 피검자가 진단 자세를 취함에 있어서 제한이 따르는 문제를 해소할 수 있는 초음파 영상 처리 장치 및 시스템을 제공하려는 것을 목적으로 한다. 본원은 전술한 종래 기술의 문제점을 해결하기 위한 것으로서, 종래에 초음파 영상의 획득을 위해, 사용자(의료 진)가 대상 부위 혹은 프로브의 전면에 초음파 젤을 직접 발라야 하고, 손에 쥔 프로브를 해당 대상 부위에 대 해 계속 이동시키는 조작을 수행해야 했던 문제(번거로움)를 해소할 수 있는 초음파 영상 처리 장치 및 시스템 을 제공하려는 것을 목적으로 한다. 다만, 본원의 실시예가 이루고자 하는 기술적 과제는 상기된 바와 같은 기술적 과제들로 한정되지 않으며, 또 다른 기술적 과제들이 존재할 수 있다."}
{"patent_id": "10-2020-0059002", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본원의 일 실시예에 따른 초음파 영상 처리 장치는, 피검자의 신체 부위에 대한 초음파 데이터를 트랜스듀서로부터 획득하는 획득부; 상기 획득된 초음파 데이터에 기초하여 생성된 초음파 영상의 분석을 통해 상기 초음파 영상 내 복수의 구조물을 식별하는 분석부; 및 상기 복수의 구조물 중 사용자의 선택이 이루어진 선택 구조물에 관한 정보를 상기 초음파 영상과 함께 화면에 표시 하는 제어부를 포함하고, 상기 신체 부위는 얼굴 부위일 수 있다. 또한, 상기 제어부는, 상기 선택 구조물에 관한 정보를 상기 초음파 영상 상에 오버랩하여 화면에 표시하되, 상 기 화면에 표시되는 상기 선택 구조물의 표시 형태를 상기 선택 구조물의 종류에 따라 각기 다르게 제어할 수 있다. 또한, 상기 선택 구조물의 종류는, 구조물의 속성에 따라 해부학적 구조물 관련 제1 종류와 인공 구조물 관련 제2 종류로 구분되고, 제1 종류는 근육, 혈관, 신경 및 피하지방 중 적어도 하나를 포함하고, 제2 종류는 보형 물 및 리프팅 와이어 중 적어도 하나를 포함할 수 있다. 또한, 상기 분석부는, 복수의 학습 초음파 영상을 입력값으로 하고 복수의 학습 초음파 영상 각각과 매칭되는 구조물의 종류 정보를 출력값으로 하는 딥러닝 모델 기반의 기학습 사항에 기초하여 상기 분석을 수행하고, 상 기 딥러닝 모델에 상기 초음파 영상을 입력으로 적용함으로써 상기 초음파 영상 내 복수의 구조물의 종류를 식 별할 수 있다. 또한, 상기 분석부는, 상기 초음파 영상의 생성 이전에 상기 피검자의 신체 부위에 대하여 기 생성된 이전 초음 파 영상이 저장부에 존재하는 경우, 상기 이전 초음파 영상을 고려하여 상기 복수의 구조물 중 이상 구조물이 존재하는지 판단할 수 있다. 또한, 상기 제어부는, 상기 분석부에서 상기 이상 구조물이 존재하는 것으로 판단 되면, 상기 복수의 구조물 중 상기 이상 구조물에 관한 정보를 이상 구조물이 아닌 비이상 구조물에 관한 정보 와 대비하여 보다 인식 또는 식별이 용이한 형태로 표시되도록 제어할 수 있다. 또한, 상기 분석부는, 상기 이전 초음파 영상이 존재하는 경우, 상기 초음파 영상과 상기 이전 초음파 영상 간 의 비교를 통해 상기 이전 초음파 영상 내 구조물을 기준으로 한 상기 초음파 영상 내 구조물 간의 상태 차이를 산출하고, 산출 결과, 상기 초음파 영상 내 구조물 중에서 상기 이전 초음파 영상 내 구조물 대비 미리 설정된 차이값 이상으로 상태 차이가 나타나는 구조물을 상기 이상 구조물인 것으로 판단할 수 있다. 또한, 상기 제어부는, 상기 피검자의 얼굴 부위에 착용된 마스크 기기의 동작을 제어하고, 상기 획득부는, 상기 제어에 응답하여 상기 마스크 기기에 구비된 상기 트랜스듀서로부터 상기 초음파 데이터를 무선 통신을 통해 획 득할 수 있다. 또한, 상기 마스크 기기는, 상기 피검자의 얼굴 부위에 착용 가능한 형태로 마련되는 몸체부; 상기 몸체부의 내 면에 구비되고, 상기 피검자의 얼굴 부위를 향하여 초음파 신호를 조사하고, 상기 피검자로부터 반사되는 초음 파 신호에 기초하여 초음파 데이터를 생성하는 트랜스듀서; 및 상기 트랜스듀서와 상기 몸체부를 서로 연결시키 며, 상기 제어에 응답하여 상기 트랜스듀서를 상기 몸체부의 내면에 형성된 미리 설정된 경로를 따라 이동시키 는 이동 제어 유닛을 포함할 수 있다. 또한, 상기 제어부는, 상기 마스크 기기가 상기 피검자의 얼굴 부위에 정상 착용된 것으로 감지된 경우, 상기 트랜스듀서가 상기 미리 설정된 경로를 따라 이동하며 상기 초음파 데이터를 생성하도록 상기 마스크 기기의 동 작을 제어하고, 상기 정상 착용에 대한 판단은, 상기 마스크 기기의 양측의 내면에 서로 마주하도록 배치된 발 광 소자와 수광 소자를 이용하여 이루어질 수 있다. 또한, 상기 제어부는, 상기 마스크 기기가 상기 피검자의 얼굴 부위에 정상 착용된 것으로 감지된 경우, 상기 피검자의 얼굴 부위를 향하여 노출된 상기 트랜스듀서의 일면이 상기 얼굴 부위에 접촉되도록 상기 트랜스듀서 를 상기 내면으로부터 돌출 이동시키는 제어를 수행할 수 있다. 또한, 상기 제어부는, 상기 미리 설정된 경로에대한 상기 트랜스듀서의 이동 제어시, 상기 트랜스듀서의 일면의 일영역에 마련된 압력센서를 통해 측정되는 압 력 측정 값이 미리 설정된 압력 범위에 속한 값을 가지도록 하며 상기 트랜스듀서를 이동시킬 수 있다. 또한, 상기 마스크 기기는, 초음파 젤을 저장하는 젤 저장부; 및 상기 트랜스듀서와 이웃하여 배치되고, 상기 피검자의 얼굴 부위에 대한 초음파 젤의 도포를 위해 상기 젤 저장부에 저장된 초음파 젤을 상기 얼굴 부위를 향하여 공급하는 젤 공급 노즐부를 포함할 수 있다. 또한, 상기 제어부는, 상기 미리 설정된 경로에 대한 상기 트랜스듀서의 이동시 상기 얼굴 부위를 향하여 초음파 젤이 공급되도록 상기 젤 공급 노즐부의 동작을 제어할 수 있다. 상술한 과제 해결 수단은 단지 예시적인 것으로서, 본원을 제한하려는 의도로 해석되지 않아야 한다. 상술한 예 시적인 실시예 외에도, 도면 및 발명의 상세한 설명에 추가적인 실시예가 존재할 수 있다."}
{"patent_id": "10-2020-0059002", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본원의 과제 해결 수단에 의하면, 초음파 영상 내 식별된 각 구조물의 표시 형태를 각기 다르게 제어할 수 있는 초음파 영상 처리 장치를 제공할 수 있다. 이러한 본원은 초음파 영상을 화면에 표시함에 있어서 초음 파 영상 내 각 구조물을 서로 다른 색상(모양)으로 구분하여 표시할 수 있는바, 사용자가 본원의 초음파 영상 처리 장치를 통해 표시되는 초음파 영상으로 하여금, 각 구조물의 형태(모양)나 위치, 상태 등을 보다 직관적으 로 확인하고 인식할 수 있도록 제공할 수 있다. 전술한 본원의 과제 해결 수단에 의하면, 피검자의 얼굴에 착용된 마스크 기기로부터 초음파 데이터를 무선 통 신을 통해 획득하고, 이를 토대로 피검자의 얼굴 부위에 대한 초음파 영상을 획득할 수 있으므로, 종래에 장치 본체로부터 케이블의 길이에 해당하는 범위 내에서만 초음파 진단의 수행 및 초음파 영상의 획득이 가능하고, 케이블로 인하여 피검자가 진단 자세를 취함에 있어서 제한이 따르는 문제를 해소할 수 있다. 전술한 본원의 과제 해결 수단에 의하면, 마스크 기기에 대한 전자적인 제어를 통해 마스크 기기로부터 초음파 영상의 생성을 위한 초음파 데이터를 손쉽게 획득할 수 있으므로, 종래에 초음파 영상의 획득을 위해 사용자(의 료진)가 손에 쥔 프로브를 대상 부위에 대하여 계속 이동시키는 조작을 취해야 했던 번거로움을 해소할 수 있고, 사용자의 편의성을 향상시킬 수 있다. 전술한 본원의 과제 해결 수단에 의하면, 트랜스듀서의 이동 제어시 초음파 젤이 피검자의 얼굴 부위에 자동으 로 공급되도록 할 수 있음에 따라, 종래에 초음파 영상의 획득을 위해 사용자(의료진)가 대상 부위 혹은 프로브 의 전면에 초음파 젤을 직접 발라야 했던 수고로움(번거로움)을 해소할 수 있다. 다만, 본원에서 얻을 수 있는 효과는 상기된 바와 같은 효과들로 한정되지 않으며, 또 다른 효과들이 존재할 수 있다."}
{"patent_id": "10-2020-0059002", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본원이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본원의 실시예를 상세히 설명한다. 그러나 본원은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본원을 명확하게 설명하기 위해서 설명과 관계없는 부분 은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 본원 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\" 또는 \"간접적으로 연결\"되어 있는 경우 도 포함한다. 본원 명세서 전체에서, 어떤 부재가 다른 부재 \"상에\", \"상부에\", \"상단에\", \"하에\", \"하부에\", \"하단에\" 위치 하고 있다고 할 때, 이는 어떤 부재가 다른 부재에 접해 있는 경우뿐 아니라 두 부재 사이에 또 다른 부재가 존 재하는 경우도 포함한다. 본원 명세서 전체에서, 어떤 부분이 어떤 구성 요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성 요소를 제외하는 것이 아니라 다른 구성 요소를 더 포함할 수 있는 것을 의미한다. 도 2는 본원의 일 실시예에 따른 초음파 영상 처리 시스템의 개략적인 구성을 나타낸 도면이다. 도 3은 본원의 일 실시예에 따른 초음파 영상 처리 장치와 연동되는 마스크 기기의 개략적인 구성을 나타낸 블록도이다. 도 4는 본원의 일 실시예에 따른 초음파 영상 처리 장치와 연동되는 마스크 기기의 후면 도를 개략적으로 나타낸 도면이다. 도 5는 도 4에 도시된 A 부분을 확대하여 나타낸 도면이다. 도 6은 본원의 일 실시예에 따른 초음파 영상 처리 장치와 연동되는 마스크 기기의 평면도를 개략적으로 나타낸 도 면이다. 이하에서는 설명의 편의상, 본원의 일 실시예에 따른 초음파 영상 처리 시스템은 본 시스템이라 하 고, 본원의 일 실시예에 따른 초음파 영상 처리 장치는 본 장치라 하기로 한다. 도 2 내지 도 6을 참조하면, 본 시스템은 본 장치 및 마스크 기기를 포함할 수 있다. 본 장치는 초음파 영상 처리 장치로서, 마스크 기기로부터 획득한 초음파 데이터에 기초하여 초음파 영상을 생성하고, 생성된 초음파 영상을 분석하여 화면에 표시할 수 있다. 마스크 기기는 피검자의 얼굴 부위에 착용되는 기기일 수 있다. 마스크 기기는 피검자의 얼굴 부위를 향하여 초음파 신호를 조사하고, 피검자로부터 반사되는 초음파 신호에 기초하여 초음파 데이터를 생 성할 수 있다. 마스크 기기는 생성된 초음파 데이터를 무선 통신을 통해 본 장치로 전송할 수 있다. 즉, 본 장치와 마스크 기기 간에는 무선 통신을 통해 연결되어 데이터를 송수신할 수 있다. 무 선 통신은 일예로 RF(Radio Frequency) 통신, NFC(Near Field Communication) 통신, 블루투스(Bluetooth) 통신, 비콘(Beacon) 통신 등일 수 있으나, 이에만 한정되는 것은 아니고, 다양한 무선 통신 기술이 적용될 수 있다. 본 장치는 획득부, 분석부, 제어부 및 저장부를 포함할 수 있다. 획득부는 피검자의 신체 부위에 대한 초음파 데이터를 트랜스듀서(220, transducer)로부터 획득할 수 있다. 이때, 트랜스듀서는 마스크 기기에 구비된 트랜스듀서를 의미할 수 있다. 획득부(11 0)는 마스크 기기 내 트랜스듀서에 의해 생성된 초음파 데이터를 트랜스듀서로부터 무선 통신 을 통해 전달받음으로써, 피검자의 신체 부위에 대한 초음파 데이터를 획득할 수 있다. 여기서, 초음파 데이터의 획득이 이루어지는 피검자의 신체 부위라 함은, 마스크 기기가 피검자 의 얼굴에 착용 가능한 형태의 것임에 따라 일예로 피검자의 얼굴 부위를 의미할 수 있다. 다만, 이에만 한 정되는 것은 아니고, 피검자의 신체 부위로는 피검자의 인체의 적어도 일부 부위가 적용될 수 있다. 분석부는 획득부에서 획득된 초음파 데이터에 기초하여 생성된 초음파 영상의 분석을 통해 초음파 영 상 내 복수의 구조물을 식별할 수 있다. 여기서, 구조물이라 함은 초음파 신호를 이용하여 관찰 가능한 피검자 의 신체 부위에 존재하는 구조물로서, 해부학적 구조물 및 인공 구조물을 포함할 수 있다. 해부학적 구조물은 피검자의 인체(신체 부위) 내 자체적으로 존재하는 구조물에 해당하는 것으로서, 근육, 혈관, 신경 및 피하지방 중 적어도 하나가 포함될 수 있다. 인공 구조물은 피검자의 인체에 자체적으로 존재 하는 해부학적 구조물과는 달리, 인공적으로 제조(생성)되어 피검자의 신체 부위에 삽입(주입)된 구조물에 해당하는 것으로서, 보형물 및 리프팅 와이어 중 적어도 하나가 포함될 수 있다. 다만, 이러한 해부학적 구조물 및 인공 구조물의 예는 본원의 이해를 돕기 위한 하나의 예시일 뿐, 이에만 한정 되는 것은 아니고, 신체 부위와 관련된 다양한 종류의 구조물들이 고려될 수 있다. 예시적으로, 해부학적 구 조물에는 골격(뼈)이 더 포함될 수 있다. 또한, 해부학적 구조물 내 보형물로는 실리콘 보형물, 식염수 보형물, 더블루멘 보형물, 하이드로 젤 보형물 등 다양한 재료로 이루어진 보형물들이 고려될 수 있다. 제어부는 분석부에 의해 식별된 초음파 영상 내 복수의 구조물 중 사용자의 선택이 이루어진 선택 구 조물에 관한 정보를 초음파 영상과 함께 화면에 표시할 수 있다. 여기서, 사용자는 시술자, 의료진, 의사 등을 의미할 수 있으나, 이에 한정되는 것은 아니다. 선택 구조물은, 초음파 영상에서 식별된 복수의 구조물 중 사용자 입력에 의해 선택된 구조물을 의미하는 것으 로서, 복수의 구조물 중 적어도 하나의 구조물을 의미할 수 있다. 제어부는 선택 구조물에 관한 정보를 초음파 영상과 함께 본 장치에 자체 구비된 디스플레이 패널의 화면 상에 표시할 수도 있고, 혹은 도면에 도시하지는 않았으나, 본 장치와 네트워크 통신을 통해 연결된 사용자 단말(미도시)의 화면 상에 표시할 수 있다. 여기서, 사용자 단말(미도시)이라 함은 PCS(Personal Communication System), GSM(Global System for Mobile communication), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)- 2000, W-CDMA(WCode Division Multiple Access), Wibro(Wireless Broadband Internet) 단말, 스마트폰 (Smartphone), 스마트패드(SmartPad), 태블릿 PC, 노트북, 웨어러블 디바이스, 데스크탑 PC 등과 같은 모든 종 류의 유무선 통신 장치를 포함할 수 있으며, 이에 한정되는 것은 아니다. 또한, 본 장치와 사용자 단말(미도시) 사이를 연결하는 네트워크 통신으로는, 일예로 3GPP(3rd Generation Partnership Project) 네트워크, LTE(Long Term Evolution) 네트워크, WIMAX(World Interoperability for Microwave Access) 네트워크, 인터넷(Internet), LAN(Local Area Network), Wireless LAN(Wireless Local Area Network), WAN(Wide Area Network), PAN(Personal Area Network), 블루투스(Bluetooth) 네트워크, NFC(Near Field Communication) 네트워크, 위성 방송 네트워크, 아날로그 방송 네트워크, DMB(Digital Multimedia Broadcasting) 네트워크 등이 포함될 수 있으며, 이에 한정된 것은 아니고, 다양한 종류의 유/무선 통신이 적용될 수 있다. 제어부는 선택 구조물에 관한 정보를 초음파 영상 상에 오버랩하여 화면에 표시할 수 있다. 이때, 제어부 는 화면에 표시되는 선택 구조물의 표시 형태를 선택 구조물의 종류에 따라 각기 다르게 제어할 수 있다. 여기서, 표시 형태는 색상 및 모양 중 적어도 하나를 포함할 수 있으며, 이에 한정되는 것은 아니다. 제어부는 선택 구조물이 무엇인지에 따라, 화면 상에 표시되는 해당 선택 구조물의 표시 형태(색상이나 모 양)을 제어할 수 있다. 즉, 제어부는 복수의 구조물 중 적어도 하나의 구조물을 화면에 표시함에 있어서, 복수의 구조물 각각을 서로 다른 색상으로 화면에 표시할 수 있다. 여기서, 선택 구조물의 종류는 구조물의 속성에 따라 해부학적 구조물 관련 제1 종류와 인공 구조물 관련 제2 종류로 구분될 수 있다. 여기서, 제1 종류는 근육, 혈관, 신경 및 피하지방 중 적어도 하나를 포함하고, 제2 종 류는 보형물 및 리프팅 와이어 중 적어도 하나를 포함할 수 있다. 예시적으로, 제어부는 선택 구조물이 근육인 경우, 화면에 표시되는 초음파 영상 상에서 근육에 대응되는 부분(영역)이 빨간색으로 오버랩되어 표시되도록 제어할 수 있다. 즉, 제어부는 근육에 대응되는 구조물의 부분(영역)을 빨간색으로 하여 초음파 영상 상에 오버랩하여 화면에 표시할 수 있다. 다른 예로, 제어부는 선택 구조물이 보형물인 경우, 초음파 영상 내 보형물에 대응되는 부분(영역)을 파란 색으로 하여 초음파 영상 상에 오버랩하여 화면에 표시할 수 있다. 또 다른 예로, 제어부(1300는 선택 구조물이 피하지방인 경우, 초음파 영상 내 피하지방에 대응되는 부분(영역)을 노란색으로 하여 초음파 영상과 함께 화면 에 표시할 수 있다. 이처럼, 제어부는 초음파 영상 내 복수의 구조물 중 적어도 하나의 구조물을 화면에 표시함에 있어서, 각 구조물을 각기 다른 색상으로 하여 초음파 영상 상에 오버랩하여 화면에 함께 표시할 수 있다. 일반적으로 초음파 영상은 흑백영상과 같이 표현되기 때문에, 숙달된 전문의 이외의 사용자에게 있어서는 해당 초음파 영상을 보고 초음파 영상 내 각 구조물의 형태, 위치 등을 바로 확인하는 데에 어려움이 있다. 이에 반 해, 본 장치는 초음파 영상을 화면에 표시함에 있어서, 초음파 영상 내 각 구조물을 서로 다른 색상(모 양)으로 구분하여 표시할 수 있는바, 사용자에게 있어서 각 구조물의 형태(모양)나 위치, 상태 등을 보다 직관 적으로 확인하고 인식할 수 있도록 제공할 수 있다. 이때, 분석부는 복수의 학습 초음파 영상을 입력값으로 하고 복수의 학습 초음파 영상 각각과 매칭되는 구 조물의 종류 정보를 출력값으로 하는 딥러닝 모델 기반의 기학습 사항에 기초하여 생성된 초음파 영상에 대한 분석을 수행할 수 있다. 이를 통해 분석부는 딥러닝 모델(기학습된 딥러닝 모델)에 생성된 초음파 영상을 입력으로 적용함으로써, 초음파 영상 내 복수의 구조물의 종류(특히, 복수의 구조물 각각의 종류)를 식별할 수 있다. 즉, 분석부는 딥러닝 모델을 이용하여, 생성된 초음파 영상으로부터 복수의 구조물 각각의 종류를 식별(구 분)해 낼 수 있다. 제어부는 딥러닝 모델을 이용하여 식별된 초음파 영상 내 복수의 구조물 각각의 종류를 기반으로 하여, 사 용자의 선택이 이루어진 선택 구조물에 관한 정보를 초음파 영상과 함께 화면에 표시할 수 있다. 구체적으로, 본 장치에서 고려되는 딥러닝 모델은, 주어진 초음파 영상에 대하여 해당 초음파 영상에 포함 된 구조물의 종류를 출력하도록 학습된 신경망 모델일 수 있다. 이를 위해, 딥러닝 모델은 복수의 피검자들의 신체 부위(특히, 얼굴 부위)에 대한 초음파 영상을 학습 초음파 영상(복수의 학습 초음파 영상)으로서 입력값으 로 하고, 입력된 복수의 학습 초음파 영상 각각과 매칭되는 구조물의 종류 정보를 출력값으로 출력하도록 학습 될 수 있다. 분석부는 이러한 딥러닝 모델의 기학습 사항에 기초하여, 획득부에서 획득된 초음파 데이터를 이용해 생성된 초음파 영상을 기 학습된 딥러닝 모델의 입력으로 제공하고, 그 결과로서 딥러닝 모델로부터 생성된 초 음파 영상에 대응하는 구조물(즉, 초음파 영상 내 복수의 구조물) 각각의 종류에 대한 정보를 획득(출력, 식 별)할 수 있다. 딥러닝 모델은 인공지능(AI) 알고리즘 모델, 기계학습(머신러닝) 모델, 신경망 모델(인공 신경망 모델), 뉴로 퍼지 모델 등을 의미할 수 있다. 또한, 딥러닝 모델은 예시적으로 합성곱 신경망(Convolution Neural Network, CNN), 순환 신경망(RNN, Recurrent Neural Network), 딥 신경망(Deep Neural Network) 등 종래에 이미 공지되 었거나 향후 개발되는 다양한 신경망 모델이 적용될 수 있다. 또한, 분석부는 획득부로부터 획득된 초음파 데이터를 토대로 초음파 영상이 생성되기 이전에, 피검 자의 신체 부위에 대하여 기 생성된 이전 초음파 영상이 저장부에 존재하는지 확인할 수 있다. 분석부는 초음파 영상의 생성 이전에 피검자의 신체 부위에 대하여 기 생성된 이전 초음파 영상이 저장부에 존재하는 경우(존재하는 것으로 확인된 경우), 이전 초음파 영상을 고려하여 초음파 영상 내 복 수의 구조물 중 이상 구조물이 존재하는지 판단할 수 있다. 이때, 후술하는 설명에서는, 획득부로부터 획득된 초음파 데이터에 기초하여 생성된 초음파 영상은 금번 초음파 영상이라 달리 지칭될 수 있다. 또한, 금번 초음파 영상이 생성되기 이전에, 과거에 이미 피검자의 신체 부위에 대해 생성되었던 초음파 영상(즉, 과거에 이미 생성되어 저장부에 저장되어 있던 초음파 영상) 은 이전 초음파 영상이라 달리 지칭될 수 있다. 저장부는 마스크 기기로부터 획득된 초음파 데이터를 기초로 생성된 초음파 영상을 저장할 수 있다. 저장부는 복수의 피검자의 신체 부위에 대한 초음파 영상을 복수개 저장할 수 있다. 즉, 저장부에 저 장된 복수개의 초음파 영상은 복수의 피검자에 대한 것일 수 있다. 저장부에는 초음파 영상뿐만 아니라 분 석부에 의해 식별된 해당 초음파 영상에 대응되는 복수의 구조물에 대한 정보도 함께 저장될 수 있다. 분석부는 획득부가 피검자의 신체 부위에 대한 초음파 데이터를 획득했을 때, 금번 초음파 영 상을 생성하기 이전에 저장부에 피검자의 신체 부위에 대하여 기 저장된 이전 초음파 영상이 존재하 는지 확인할 수 있다. 이때, 분석부는 이전 초음파 영상이 존재하면, 이전 초음파 영상을 고려하여 금번 초음파 영상 내 복수의 구조물 중에서 이상이 있는 이상 구조물이 존재하는지 판단할 수 있다. 이때, 분석부는 이전 초음파 영상이 존재하는 경우, 금번 초음파 영상과 이전 초음파 영상 간의 비교를 통 해, 이전 초음파 영상 내 구조물을 기준으로 한 금번 초음파 영상 내 구조물 간의 상태 차이를 산출할 수 있다. 여기서, 상태 차이라 함은 크기 차이나 위치 차이를 의미할 수 있다. 분석부는 산출 결과, 금번 초음파 영상 내 구조물 중에서 이전 초음파 영상 내 구조물 대비 미리 설정된 차이값(즉, 미리 설정된 크기 차이값, 혹은 미리 설정된 위치 차이값) 이상으로 상태 차이가 나타나는 구조물을 이상 구조물인 것으로 판단할 수 있다. 제어부는 분석부에서 금번 초음파 영상 내 이상 구조물이 존재하는 것으로 판단되면, 복수의 구조물 중 이상 구조물에 관한 정보를 이상 구조물이 아닌 비이상 구조물에 관한 정보와 대비하여 보다 인식 또는 식별 이 용이한 형태로 표시되도록 제어할 수 있다. 일예로, 금번 초음파 영상과 이전 초음파 영상 간의 비교를 수행한 결과, 금번 초음파 영상 내 보형물의 크기와 이전 초음파 영상 내 보형물의 크기가 미리 설정된 크기 차이값 이상으로 차이가 나면, 분석부는 금번 초 음파 영상 내 보형물을 이상 구조물인 것으로 판단할 수 있다. 이후, 제어부는 금번 초음파 영상 내 이상 구조물이 존재하므로, 금번 초음파 영상 내 복수의 구조물 중 이상 구조물(일예로, 보형물)에 관한 정보를 이상 구조물이 아닌 비이상 구조물(일예로, 근육, 혈관, 신경, 피하지방, 리프팅 와이어)에 관한 정보와 대비하여 보 다 인식 또는 식별이 용이한 형태로 표시되도록 제어할 수 있다. 여기서, 이상 구조물을 비이상 구조물 대비 인식 또는 식별이 용이한 형태로 표시한다는 것은, 시각적으로 강조 된 형태, 크기가 확장된 형태, 청각적인 효과를 수반하는 형태 및 동적인 애니메이션 형태 중 적어도 하나로 표 시하는 것을 의미할 수 있다. 예시적으로, 분석부가 초음파 영상(금번 초음파 영상) 내에서 복수의 구조물로서 보형물과 피하지방을 식 별하였다고 하자. 이때, 분석부는 저장부에 이전 초음파 영상이 존재하는지 판단하고, 이전 초음파 영상이 존재하면 이전 초음파 영상과 초음파 영상(금번 초음파 영상)을 서로 비교할 수 있다. 비교 결과, 금번 초음파 영상에서의 보형물의 크기가 이전 초음파 영상에서의 보형물의 크기 대비 일예로 미리 설정된 크기 차이 값 이상으로 작은 것으로 차이가 나면, 분석부는 해당 보형물이 초기에 얼굴 부위에 삽입되었을 때와 대비 하여 그 크기가 작아져, 해당 보형물에 대하여 보정(보완)을 수행하거나 다시 재수술을 해야 할 필요성이 있는 것으로 판단하여, 해당 보형물을 이상 구조물인 것으로 판단할 수 있다. 반면, 분석부는 피하지방의 경우, 이전 초음파 영상과 대비하여 미리 설정된 차이값 이상으로 상태 차이가 나타나지 않으면, 해당 피하지방을 비이상 구조물인 것으로 판단할 수 있다. 만약, 금번 초음파 영상 내 피하지 방의 두께와 이전 초음파 영상 내 피하지방의 두께 간의 차이가 미리 설정된 차이값(미리 설정된 두께 값) 이상 으로 차이가 나면, 초음파 영상 내 피하지방에 해당하는 구조물은 비이상 구조물인 것으로 판단될 수 있다. 이에 따르면, 복수의 구조물 중 보형물이 이상 구조물인 것으로 판단되고, 복수의 구조물 중 피하지방이 비이상 구조물인 것으로 판단된 경우, 제어부는 화면에 표시되는 초음파 영상 상에서, 이상 구조물인 보형물에 해 당하는 부분(영역)이 비이상 구조물인 피하지방에 해당하는 부분(영역) 대비 인식 또는 식별이 용이한 형태로 표시되도록 제어할 수 있다. 달리 말해, 제어부는 화면에 표시되는 초음파 영상 상에서, 이상 구조물인 보 형물에 해당하는 부분(영역)을 비이상 구조물인 피하지방에 해당하는 부분(영역) 보다 시각적으로 강조된 형태, 크기가 확장된 형태, 청각적인 효과를 수반하는 형태 및 동적인 애니메이션 형태 중 적어도 하나의 것으로 표시 되도록 제어할 수 있다. 즉, 제어부는 복수의 구조물 중에서 이상 구조물이 비이상 구조물 대비 보다 인식 또는 식별이 용이한 형 태로 표시되도록 제어(달리 표현해, 이상 구조물을 비이상 구조물 대비 시각적으로 강조된 형태, 크기가 확장된 형태, 청각적인 효과를 수반하는 형태 및 동적인 애니메이션 형태 중 적어도 하나로 표시되도록 제어)할 수 있 다. 이러한 본 장치는 이상 구조물을 비이상 구조물 대비 이식 또는 식별이 용이한 형태로 표시되도록 제어함 에 따라, 초음파 영상에서 식별된 복수의 구조물 중 이상 구조물이 비이상 구조물 대비 보다 직관적으로 인식되 고 식별될 수 있도록 하여, 해당 이상 구조물에 대한 조치가 보다 신속히 이루어지도록 제공할 수 있다. 한편, 제어부는 피검자의 신체 부위로서 얼굴 부위에 착용된 마스크 기기의 동작을 제어할 수 있다. 본 장치 내 획득부는 제어부에 의한 제어(동작 제어)에 응답하여, 마스크 기기에 구 비된 트랜스듀서로부터 초음파 데이터를 무선 통신을 통해 획득할 수 있다. 마스크 기기에 대한 보다 구체적인 설명은 도 3 내지 도 6을 참조하여 보다 쉽게 이해될 수 있다. 이하에서는 마스크 기기를 설명함에 있어서, 도 3과 도 6의 도면을 기준으로 9시-3시 방향을 좌우방향, 도 3의 도면을 기준으로 12시-6시 방향을 상하방향, 도 6의 도면을 기준으로 12시-6시 방향을 전후방향이라 하기로 한다. 다만, 이러한 방향 설정은 본원의 이해를 돕기 위한 예시일 뿐, 이에만 한정되는 것은 아니다.도 3 내지 도 6을 참조하면, 마스크 기기는 몸체부, 트랜스듀서, 이동 제어 유닛, 발광 소 자, 수광 소자, 압력센서, 젤 저장부 및 젤 공급 노즐부를 포함할 수 있다. 마스크 기기는 일예로 본 장치의 제어부로부터 전송된 동작 제어 명령에 기초하여 동작이 제어 될 수 있다. 몸체부는 피검자의 신체 부위인 얼굴 부위에 착용 가능한 형태로 마련될 수 있다. 몸체부는 일 예로 플라스틱 등의 재질로 이루어질 수 있으나, 이에만 한정되는 것은 아니고, 다양한 재질이 적용될 수 있다. 트랜스듀서(220, transducer)는 몸체부의 내면(is)에 구비될 수 있다. 트랜스듀서는 마스크 기기 를 착용한 피검자의 신체 부위인 얼굴 부위를 향하여 초음파 신호를 조사하고, 피검자로부터 반 사되는 초음파 신호(반사 초음파 신호)에 기초하여 초음파 데이터를 생성할 수 있다. 여기서, 몸체부의 내면(is)은 피검자의 신체 부위인 얼굴 부위가 접촉되는 면으로서, 후측면을 의미 할 수 있다. 트랜스듀서는 탐촉자 등으로 달리 지칭될 수 있다. 트랜스듀서로부터 조사되는 초음파 신호의 파형은 일예로 평면 초음파 신호의 평면파형일 수 있다. 구체적으로, 트랜스듀서로부터 조사되는 초음파 신호의 파형은 파면의 모양이 직선 또는 평면을 이루면서 진행하는 파동인 평면파(plane wave) 및 전진 중에 선미에서 뒤쪽으로 팔자(八字)를 그리며 퍼져나가는 파, 즉 음원으로부터 거리가 멀어질수록 더욱 넓은 면적으로 퍼져나 가는 파인 발산파(diverging wave)의 파형을 포함하는 개념일 수 있으며, 이에만 한정되는 것은 아니다. 또한, 도면에 도시하지는 않았으나, 마스크 기기는 통신부(미도시)를 포함할 수 있으며, 통신부(미도시)는 트랜스듀서에 의해 생성된 초음파 데이터를 본 장치로 무선 통신을 통해 전송(제공)할 수 있다. 이동 제어 유닛은 트랜스듀서와 몸체부를 서로 연결시킬 수 있다. 이동 제어 유닛은 제어 부의 제어에 응답(동작 제어 명령에 응답)하여, 트랜스듀서를 몸체부의 내면(is)에 형성된 미리 설정된 경로(p)를 따라 이동시킬 수 있다. 구체적으로, 마스크 기기의 몸체부 내에는 미리 설정된 경로(p)를 따라 형성되는 레일이 마련될 수 있다. 이동 제어 유닛은 레일을 따라 이동 가능하도록 레일과 결합될 수 있다. 이동 제어 유 닛의 일단은 레일과 결합되고, 이동 제어 유닛의 타단은 트랜스듀서와 결합될 수 있다. 여 기서, 이동 제어 유닛의 일단은 전방을 향한 단부를 의미하고, 이동 제어 유닛의 타단은 후방을 향한 단부를 의미할 수 있다. 레일이 형성되는 경로이자 트랜스듀서의 이동이 이루어지는 미리 설정된 경로(p)는, 피검자의 신 체 부위인 얼굴 부위에 대한 전체 스캔이 가능하도록 설정될 수 있다. 즉, 미리 설정된 경로(p)는 트랜스듀 서를 통해 획득되는 초음파 데이터로 하여금 피검자의 얼굴 부위 전체에 대한 초음파 영상의 생성이 가 능하도록, 트랜스듀서로부터 조사되는 초음파 신호가 피검자의 얼굴 부위 전체를 커버하며 조사될 수 있도록 하는 경로로 설정될 수 있다. 제어부는 마스크 기기가 피검자의 얼굴 부위에 정상 착용된 것으로 감지된 경우, 트랜스듀서(22 0)가 미리 설정된 경로(p)를 따라 이동하며 초음파 데이터를 생성하도록 마스크 기기의 동작을 제어할 수 있다. 구체적으로, 제어부는 마스크 기기가 피검자의 얼굴 부위에 정상 착용된 것으로 감지된 경우, 이 동 제어 유닛이 레일을 통하여 미리 설정된 경로(p)를 따라 이동하도록, 이동 제어 유닛을 이동 시키는 제어할 수 있다. 제어부가 이동 제어 유닛을 이동시킴에 따라, 이동 제어 유닛의 타단에 결합된 트랜스듀서가 미리 설정된 경로(p)를 따라 이동될 수 있다. 이때, 트랜스듀서는 미리 설정된 경로(p)를 따라 이동하면서, 피검자의 얼굴 부위를 향하여 초음파 신호를 조사하고 피검자로부터 반사된 초음파 신호를 획득함으로써 초음파 데이터를 생성할 수 있다. 트랜스듀서가 미리 설정된 경로(p)를 따라 이동하면서 초음파 데이터를 생성함에 따라, 이로부터 본 장치는 피검자의 얼굴 부위 전체에 대한 초음 파 영상을 획득할 수 있다. 마스크 기기가 피검자의 얼굴 부위에 정상 착용 되었는지에 대한 판단(즉, 정상 착용에 대한 판단)은, 마스크 기기의 양측의 내면에 서로 마주하도록 배치된 발광 소자와 수광 소자를 이용하여 이루 어질 수 있다.발광 소자는 몸체부의 양측 중 일예로 좌측의 내면에 배치되어 광을 방출시킬 수 있다. 수광 소자 는 몸체부의 양측 중 좌측의 내면과 마주하는 우측의 내면에 배치되고, 발광 소자로부터 방출되 는 광의 적어도 일부를 수신광으로서 수신할 수 있다. 이에 따라, 발광 소자와 수광 소자는 몸체부 의 내면에서, 서로 마주하도록 배치될 수 있다. 발광 소자로부터 발출되는 광은 예시적으로 LED 광일 수 있으나, 이에 한정되는 것은 아니다. 본 장치의 획득부는 수광 소자가 수신하는 수신광의 양(수신광량)에 대한 정보를 마스크 기기 로부터 획득할 수 있으며, 제어부는 수광 소자가 수신한 수신광량을 기초로 마스크 기기가 피검자의 얼굴 부위에 정상 착용되었는지 여부를 감지할 수 있다. 피검자가 마스크 기기를 얼굴 부위에 착용하지 않은 경우에는, 발광 소자와 수광 소자의 사 이에 어떠한 물체도 없음에 따라, 수광 소자가 발광 소자로부터 방출된 광의 대부분을 수신할 수 있 다. 이에 반해, 피검자가 마스크 기기를 얼굴 부위에 착용한 경우에는, 발광 소자로부터 방출된 광이 피검자의 얼굴 부위에 의해 가려짐에 따라, 수광 소자가 발광 소자로부터 방출된 광을 거의 수신하지 못할 수 있다. 따라서, 본 장치는 수광 소자가 수신하는 수신광량을 이용하여 마스크 기기가 피검자의 얼굴 부위에 정상적으로 착용되었는지를 감지(판단)할 수 있다. 제어부는 획득부가 수신한 수신광량에 대한 정보를 기초로 하여, 수광 소자가 수신하는 수신광 의 양(수신광량)이 미리 설정된 광량 이하인 경우, 마스크 기기가 피검자의 얼굴 부위에 정상 착용된 것으로 감지할 수 있다. 반면, 제어부는 수신광량이 미리 설정된 광량을 초과하는 경우, 마스크 기기(20 0)가 피검자의 얼굴 부위에 정상 착용되지 않은 것으로 감지할 수 있다. 제어부는 마스크 기기가 피검자의 얼굴 부위에 정상 착용된 경우에 한하여, 트랜스듀서가 미 리 설정된 경로(p)를 따라 이동하며 초음파 데이터를 생성하도록 제어할 수 있다. 이때, 제어부는, 마스크 기기가 피검자의 얼굴 부위에 정상 착용된 것으로 감지된 경우, 피검자 의 얼굴 부위를 향하여 노출된 트랜스듀서의 일면(s)이 피검자의 얼굴 부위에 접촉되도록 트랜스듀 서를 몸체부의 내면(is)으로부터 돌출 이동시키는 제어를 수행할 수 있다. 이때, 제어부는 이동 제어 유닛의 동작 제어를 통해 트랜스듀서가 몸체부의 내면(is)으로 부터의 돌출 이동되도록 할 수 있다. 이를 위해, 이동 제어 유닛은 전후방향에 대하여 길이가 확장 가능하 도록 마련될 수 있다. 이는 도 7을 참조하여 보다 쉽게 이해될 수 있다. 도 7은 본원의 일 실시예에 따른 초음파 영상 처리 장치와 연동되는 마스크 기기에서 트랜스듀서 가 마스크 기기의 내면(is)으로부터 돌출되지 않은 경우(a)와 돌출된 경우(a)의 예를 나타낸 도면이 다. 도 7을 참조하면, 트랜스듀서는 평소에 도 7의 (a)에 도시된 바와 같이, 몸체부 내에 내장된 형태로 마련되어 있을 수 있으며, 이때 트랜스듀서의 일면(s)은 몸체부의 후면을 향해 노출된 형태로 마련되 어 있을 수 있다. 이때, 마스크 기기가 피검자의 얼굴 부위에 정상 착용된 것으로 감지된 경우, 트랜스듀서는 도 7 의 (b)에 도시된 바와 같이, 몸체부의 내면(is)으로부터 후방을 향하여 돌출 이동된 상태로 마련될 수 있 다. 이처럼, 트랜스듀서가 몸체부의 내면(is)으로부터 돌출 이동되도록 제어하기 위해, 이동 제어 유 닛은 전후방향에 대하여 확장 가능한 형태의 것으로 마련될 수 있다. 즉, 도 7의 (a)에는 이동 제어 유닛이 확장되기 이전의 상태(확장 전 상태)가 도시되어 있고, 도 7의 (b) 에는 이동 제어 유닛이 확장된 이후의 상태(확장 된 상태)가 도시되어 있다. 이에 따르면, 제어부는 마스크 기기가 피검자의 얼굴 부위에 정상 착용된 경우, 이동 제어 유닛 을 확장 전 상태에서 확장 후 상태로 상태가 변경되도록 제어할 수 있다. 이를 통해, 제어부는 얼굴 부위에 대한 마스크 기기의 정상 착용시, 이동 제어 유닛을 전후방향에 대하여 그 길이를 확장시킴으 로써, 이동 제어 유닛의 타면에 연결된 트랜스듀서가 몸체부의 내면(is)으로부터 후방을 향해 돌출 이동되도록 제어할 수 있다. 트랜스듀서가 후방을 향해 돌출 이동되도록 제어됨으로써, 트랜스듀서 의 일면(s)이 피검자의 얼굴 부위에 접촉될 수 있다. 달리 표현해, 제어부는 마스크 기기가 피검자의 얼굴 부위에 정상 착용된 경우, 트랜스듀서 의 일면(s)이 피검자의 얼굴 부위에 접촉되도록 이동 제어 유닛의 길이를 전후방향에 대하여 확장시키 는 제어를 수행할 수 있다. 이동 제어 유닛의 길이 확장에 의해, 트랜스듀서가 몸체부의 내면 (is)으로부터 돌출된 상태로 변경될 수 있다. 제어부는 트랜스듀서를 내면(is)으로부터 돌출 이동시킨 상태로 미리 설정된 경로(p)를 따라 이동시 킬 수 있다. 이때, 제어부는 미리 설정된 경로(p)에 대한 트랜스듀서의 이동 제어시(즉, 미리 설정된 경로를 따라 트랜스듀서를 이동시킬 때), 트랜스듀서의 일면(s)의 일영역에 마련된 압력센서를 통해 측정되는 압력 측정 값이 미리 설정된 압력 범위에 속한 값을 가지도록 하며(즉, 미리 설정된 압력 범위에 속한 값으로 유지하도록 하며) 트랜스듀서를 이동시킬 수 있다. 즉, 도 5에 도시된 바와 같이, 트랜스듀서의 일면(s)의 일영역에는 압력센서가 마련될 수 있다. 특히, 마스크 기기는 트랜스듀서의 일면(s)에 마련되되, 상하방향에 대하여 간격을 두고 마련되는 복 수개(일예로 2개)의 압력센서를 포함할 수 있다. 이때, 본원의 일예에서는 압력센서가 2개 마련되는 것으로 예시하였으나, 이에 한정되는 것은 아니고, 그 개수 및 크기 등은 다양하게 설정될 수 있다. 제어부는 트랜스듀서를 내면(is)으로부터 돌출 이동시킨 이후에 미리 설정된 경로(p)를 따라 이동되 도록 제어할 수 있다. 이때, 제어부는 트랜스듀서를 미리 설정된 경로(p)를 따라 이동시킴에 있어서, 트랜스듀서의 일면(s)에 마련된 2개의 압력센서 각각을 통해 측정되는 두 압력 측정 값이 모두, 미리 설정된 압력 범위에 속하는 값으로 유지되도록 하면서 트랜스듀서를 미리 설정된 경로(p)를 따라 이동시킬 수 있다. 이때, 제어부는 트랜스듀서를 미리 설정된 경로(p)를 따라 이동시키는 제어를 수행함에 있어서, 압력 센서를 통해 측정된 압력 측정 값이 미리 설정된 압력 범위에 속하는 값으로 유지되도록 하기 위해, 이동 제어 유닛의 확장 정도(즉, 전후방향에 대한 이동 제어 유닛의 길이)를 측정된 압력 측정 값을 기초로 조 절할 수 있다. 이에 따르면, 피검자의 얼굴 형태(특히, 얼굴의 크기나 얼굴의 굴곡 형태 등)는 개개인 마다 각기 다르게 형성 되어 있다. 이에, 본 장치는 2개의 압력센서를 통해 측정되는 압력 측정 값을 미리 설정된 압력 범위 사이의 값으로 유지시키며 트랜스듀서를 이동시킴으로써, 마스크 기기를 착용한 각각의 피검자의 얼 굴 형태에 맞추어 트랜스듀서가 각 피검자의 얼굴 부위의 피부에 접촉된 상태로 이동되도록 할 수 있다. 이러한, 본 장치는 트랜스듀서가 피검자의 얼굴 부위의 피부 전체를 훑으면서 이동되도록 제어할 수 있는바, 이로부터 피검자의 얼굴 부위 전체에 대한 초음파 영상의 생성을 가능하게 할 수 있다. 본 장치는 각각의 피검자의 얼굴 형태에 맞춤화된 초음파 영상을 획득(생성)할 수 있다. 젤 저장부는 초음파 젤을 저장할 수 있다. 젤 저장부는 몸체부의 일 영역에 내장된 형태로 마련 될 수 있다. 젤 저장부는 초음파 젤을 외부로부터 공급받아 저장해둘 수 있다. 젤 공급 노즐부는 도 5에 도시된 바와 같이 트랜스듀서와 이웃하여 배치될 수 있다. 젤 공급 노즐부 는 젤 저장부와 연결되어 있을 수 있다. 젤 공급 노즐부는 피검자의 얼굴 부위에 대한 초음 파 젤의 도포를 위해 젤 저장부에 저장된 초음파 젤을 얼굴 부위를 향하여 공급(분사)할 수 있다. 즉, 젤 공급 노즐부는 젤 저장부에 저장된 초음파 젤이 피검자의 얼굴 부위에 도포될 수 있도록, 젤 저장 부에 저장된 초음파 젤을 얼굴 부위를 향해 분사(분출)할 수 있다. 제어부는 미리 설정된 경로(p)에 대한 트랜스듀서의 이동시 피검자의 얼굴 부위를 향하여 초음파 젤이 공급되도록 젤 공급 노즐부의 동작을 제어할 수 있다. 일반적으로 초음파 젤은, 두 매질의 음향 저항을 갖게 만들어 반사되지 않고 프로브(혹은 트랜스듀서)로부터 조 사되는 초음파가 인체 조직에 보다 많이 투과되도록 하고, 피검자의 피부에 대하여 프로브(혹은 트랜스듀서)를 보다 원활하게 이동시키기 위해 이용된다. 본 장치는 마스크 기기를 통해 피검자의 신체 부위로서 얼굴 부위에 대한 초음파 영상을 획득 하고자 트랜스듀서를 미리 설정된 경로(p)를 따라 이동시키는 제어를 수행할 때, 마스크 기기 자체에 저장되어 있던 초음파 젤(즉, 저장부에 저장된 초음파 젤)을 미리 설정된 경로(p)를 따라 이동되는 트랜스듀서 의 측면에서 피검자의 얼굴 부위를 향해 분사되도록 젤 공급 노즐부의 동작을 제어할 수 있다.한편, 일반적으로 초음파 진단 장치를 이용한 초음파 영상의 획득은, 사용자(의료진)가 초음파 영상을 획득하고 자 하는 대상 부위 혹은 프로브(트랜스듀서)의 전면에 먼저 초음파 젤을 바르고, 이후 손에 쥔 프로브를 해당 대상 부위에 대해 이동시켜감에 따라(문지름에 따라) 이루어지는데, 이러한 초음파 영상의 획득 기술은 사용자 (의료진)로 하여금 번거로움을 야기하는 문제가 있다. 즉, 종래에는 초음파 영상을 획득하고자 할 때 사용자(의 료진)가 직접 초음파 젤을 바르고, 프로브를 직접 수동으로 움직이는 동작을 취해야 했기 때문에, 사용자를 번 거롭게 하는 문제가 있었다. 이에 반해, 본 장치는 피검자의 얼굴 부위에 착용된 마스크 기기로부터 초음파 데이터를 획득하고 이를 토대로 초음파 영상을 획득(생성)할 수 있는바, 종래와 같이 사용자(의료진)가 초음파 영상의 획득을 위해 수작업으로 프로브를 움직이도록 제어할 필요가 없으므로, 사용자의 편의성을 증가시키고, 피검자의 얼굴 부 위 전체에 대한 초음파 영상을 손쉽게 획득(생성)할 수 있다. 또한, 본 장치는 미리 설정된 경로(p)를 따라 트랜스듀서가 이동되도록 제어할 때, 젤 공급 노즐부 의 동작을 제어하여 트랜스듀서의 측면에서 초음파 젤이 피검자의 얼굴 부위를 향해 공급되도록 할 수 있으므로, 종래에 사용자(의료진)가 초음파 영상 획득을 위해 대상 부위 혹은 프로브(트랜스듀서)의 전면 에 초음파 젤을 직접 발라야 했던 번거로움을 해소할 수 있다. 즉, 본 장치는 마스크 기기에 대한 전자적인 제어(트랜스듀서를 미리 설정된 경로를 따라 이동시키는 제어, 트랜스듀서의 이동 제어시 얼굴 부위에 대하여 초음파 젤이 공급되도록 하는 제어 등)를 통해, 피검자 의 얼굴 부위 전체에 대한 초음파 영상을 자동으로 손쉽게 획득되도록 할 수 있다. 이러한 본 장치는 종래에 초음파 영상의 획득을 위해 사용자(의료진)가 직접 초음파 젤을 바르거나 프로브를 수동으로 움직이도록 조작해야 했던 사용자(의료진)의 번거로움(수고로움)을 없앨 수 있다. 본 장치는 피검자에게 마스크 기기를 착용시키는 것 만으로, 이를 토대로 마스크 기기에 대 한 전자적인 제어를 통해 피검자의 얼굴 부위에 대한 초음파 영상을 획득할 수 있는바, 사용자의 편의성을 향상시킬 수 있다. 본 시스템 및 본 장치는, 피검자의 얼굴 부위에 대한 초음파 영상(즉, 얼굴 초음파 영상)으로부 터 피하지방, 근육, 혈관, 신경, 실리콘 보형물, 리프팅 와이어 등의 각종 구조물을 서로 구분하기 위해, 초음 파 영상을 인공지능 기법(딥러닝 모델)을 이용하여 학습시킬 수 있다. 이후, 본원은 학습된 딥러닝 모델을 이용 하여, 초음파 영상(금번 초음파 영상) 내에 포함되어 있는 복수의 구조물(일예로, 해부학적 구조물과 관련하여 인체 내 조직이나, 인공 구조물과 관련하여 각종 물질들)을 식별하고, 식별된 복수의 구조물들을 각 구조물에 대하여 기 정해진 고유의 색상으로 채색하여 초음파 영상 위에 오버랩하여 화면에 표시할 수 있다. 이하에서는 상기에 자세히 설명된 내용을 기반으로, 본원의 동작 흐름을 간단히 살펴보기로 한다. 도 8은 본원의 일 실시예에 따른 초음파 영상 처리 장치의 제어 방법에 대한 동작 흐름도이다. 도 8에 도시된 초음파 영상 처리 장치의 제어 방법은 앞서 설명된 본 장치(100, 초음파 영상 처리 장치)에 의하 여 수행될 수 있다. 따라서, 이하 생략된 내용이라고 하더라도 본 장치(100, 초음파 영상 처리 장치)에 대하여 설명된 내용은 초음파 영상 처리 장치의 제어 방법에 대한 설명에도 동일하게 적용될 수 있다. 도 8을 참조하면, 단계S11에서 획득부는, 피검자의 신체 부위에 대한 초음파 데이터를 트랜스듀서로부터 획득할 수 있다. 여기서, 피검자의 신체 부위는 얼굴 부위일 수 있다. 다음으로, 단계S12에서 분석부는, 단계S11에서 획득된 초음파 데이터에 기초하여 생성된 초음파 영상의 분석을 통해 초음파 영상 내 복수의 구조물을 식별할 수 있다. 이때, 단계S12에서 분석부는, 복수의 학습 초음파 영상을 입력값으로 하고 복수의 학습 초음파 영상 각각과 매 칭되는 구조물의 종류 정보를 출력값으로 하는 딥러닝 모델 기반의 기학습 사항에 기초하여 초음파 영상에 대한 분석을 수행하고, 딥러닝 모델에 초음파 영상을 입력으로 적용함으로써 초음파 영상 내 복수의 구조물 각각의 종류를 식별할 수 있다. 다음으로, 단계S13에서 제어부는, 단계S12에서 식별된 복수의 구조물 중 사용자의 선택이 이루어진 선택 구조물 에 관한 정보를 초음파 영상과 함께 화면에 표시할 수 있다. 이때, 단계S13에서, 제어부는 선택 구조물에 관한 정보를 초음파 영상 상에 오버랩하여 화면에 표시하되, 화면 에 표시되는 선택 구조물의 표시 형태를 상기 선택 구조물의 종류에 따라 각기 다르게 제어할 수 있다.상술한 설명에서, 단계 S11 내지 S13은 본원의 구현예에 따라서, 추가적인 단계들로 더 분할되거나, 더 적은 단 계들로 조합될 수 있다. 또한, 일부 단계는 필요에 따라 생략될 수도 있고, 단계 간의 순서가 변경될 수도 있다. 본원의 일 실시 예에 따른 초음파 영상 처리 장치의 제어 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로 그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프 로그램 명령은 본 발명을 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이 프와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크 (floptical disk)와 같은 자기-광 매체(magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같 은 프로그램 명령을 저장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴 파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행 될 수 있는 고급 언어 코드를 포함한다. 상기된 하드웨어 장치는 본 발명의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지이다. 또한, 전술한 초음파 영상 처리 장치의 제어 방법은 기록 매체에 저장되는 컴퓨터에 의해 실행되는 컴퓨터 프로 그램 또는 애플리케이션의 형태로도 구현될 수 있다."}
{"patent_id": "10-2020-0059002", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "전술한 본원의 설명은 예시를 위한 것이며, 본원이 속하는 기술분야의 통상의 지식을 가진 자는 본원의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본원의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본원의 범위에 포함되는 것으로 해 석되어야 한다."}
{"patent_id": "10-2020-0059002", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 종래의 초음파 진단 장치의 구성 예를 개략적으로 나타낸 도면이다. 도 2는 본원의 일 실시예에 따른 초음파 영상 처리 시스템의 개략적인 구성을 나타낸 도면이다. 도 3은 본원의 일 실시예에 따른 초음파 영상 처리 장치와 연동되는 마스크 기기의 개략적인 구성을 나타낸 블 록도이다. 도 4는 본원의 일 실시예에 따른 초음파 영상 처리 장치와 연동되는 마스크 기기의 후면도를 개략적으로 나타낸 도면이다. 도 5는 도 4에 도시된 A 부분을 확대하여 나타낸 도면이다. 도 6은 본원의 일 실시예에 따른 초음파 영상 처리 장치와 연동되는 마스크 기기의 평면도를 개략적으로 나타낸 도면이다. 도 7은 본원의 일 실시예에 따른 초음파 영상 처리 장치와 연동되는 마스크 기기에서 트랜스듀서가 마스크 기기 의 내면으로부터 돌출되지 않은 경우(a)와 돌출된 경우(a)의 예를 나타낸 도면이다. 도 8은 본원의 일 실시예에 따른 초음파 영상 처리 장치의 제어 방법에 대한 동작 흐름도이다."}
