{"patent_id": "10-2021-0182271", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0093387", "출원번호": "10-2021-0182271", "발명의 명칭": "GPU 병렬연산을 이용하여 모션 캡쳐로 동영상을 사진으로 출력 가능한 블루투스 프린터", "출원인": "강지수", "발명자": "강지수"}}
{"patent_id": "10-2021-0182271", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "이동통신 단말기의 영상을 모션 캡쳐 한 후 블루투스를 이용하여 프린터를 연결시키고 인쇄물을 출력하는 방법에 있어서, 블루투스 통신 기능을 지닌 단말기의 데이터(동영상)가 GPU를 이용하여 모션 캡쳐 시켜 사진화 되는 단계;모션 캡쳐가 진행된 영상을 사진으로 연결된 프린터에서 출력하는 단계;출력된 사진을 책의 형태로 애니메이션 효과를 주는 단계를 포함하는 것을 특징으로 하는 블루투스 기능을 이용한 모션 캡쳐 동영상 사진 변환 인쇄 방법."}
{"patent_id": "10-2021-0182271", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 이동통신 단말기에서 사용자가 선택하면 GPU 모듈을 이용하여 모션 캡쳐를 진행하는 단계를 더 포함하는 것을특징으로 한 블루투스 기능을 이용하는 모션 캡쳐 동영상 사진 변환 인쇄 방법."}
{"patent_id": "10-2021-0182271", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 이동통신 단말기의 블루투스 모드를 켜고 프린터와 인터페이스 하는 과정에서 프린터의 고유 번호를 뜨게 하여더욱 블루투스 연결이 쉽도록 하는 단계를 더 포함하는 것을 특징으로 한 블루투스 기능을 이용하는 모션 캡쳐동영상 사진 변환 인쇄 방법."}
{"patent_id": "10-2021-0182271", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,카메라를 통해 영상을 찍고 원하는 부분을 선택하고 사용자가 원하는 시간 간격만큼 조절이 가능하게 하는 단계를 포함하는 것을 특징으로 한 블루투스 기능을 이용하는 모션 캡쳐 동영상 사진 변환 인쇄 방법."}
{"patent_id": "10-2021-0182271", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,이동통신 단말기와 프린터를 연결시킨 후 이동통신 단말기에서 프린터로 데이터를 보내게 되면 프린터에 정상적으로 데이터가 전송되었다는 문구를 포함하는 것을 특징으로 한 블루투스 기능을 이용하는 모션 캡쳐 동영상 사진 변환 인쇄 방법."}
{"patent_id": "10-2021-0182271", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,데이터가 모두 출력이 되면 자동으로 블루투스를 끄는 것을 요청하는 문구를 포함하는 것을 특징으로 한 블루투스 기능을 이용하는 모션 캡쳐 동영상 사진 변환 인쇄 방법.공개특허 10-2023-0093387-3-청구항 7 제6항에 있어서,출력된 사진을 바로바로 뽑아내는 것이 아닌 작업물을 안에서 한 번에 모아뒀다가 펀칭기로 찍어서 내보내는 것을 포함하는 것을 특징으로 한 블루투스 기능을 이용하는 모션 캡쳐 동영상 사진 변환 인쇄 방법."}
{"patent_id": "10-2021-0182271", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 동영상을 사진으로 출력하는 프린터로 블루투스를 연동시켜 동영상을 프린터로 전송하고 GPU 병렬연산 을 이용하여 모션 캡쳐(Motion capture)를 통하여 사진 형태로 여러 장으로 바꾼 뒤 인쇄하는 발명품이다. 프린 터와 카메라가 한 세트이며, 카메라로 영상을 찍는 즉시 편집, 인쇄가 가능하다. 또한, 이동통신 단말기로 원래 가지고 있던 영상을 블루투스로 연동시켜 전송하고 출력하는 것도 포함한다. 기계에서 나올 때 펀칭(punching)기 능으로 구멍이 뚫려서 나오게 되며, 그 구멍에 사용자가 클립으로 고정시켜 사용할 수 있다. 사진을 빠르게 넘기 며 마치 움직이는 영상처럼 보이는 효과를 줄 수 있다. 이러한 방식으로 사용자가 동영상을 사진으로 아날로그 식으로 보관, 전시를 하는 것을 포함한다."}
{"patent_id": "10-2021-0182271", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 이동통신 단말기나 카메라를 연동 제어하는 영상 프린터를 이용한 영상을 사진으로 출력하는 것에 관한 것으로서, 상세하게는 블루투스를 이용한 이동통신 단말기나 카메라와 출력기의 인터페이스 (interface)를 통해 상호 연결하여 출력되는 영상정보를 모션캡쳐하여 사용자가 원하는 부분을 원하는 간격의 시간으로 사진화 작업을 시킨 후에 인쇄를 한다. 사진은 오른쪽 밑 모서리 부분을 기준으로 인쇄가 되며 클립으 로 찍혀서 출력되는 것을 포함한다. 그 후 책 형태로 만들어진 인쇄물을 손으로 훑듯이 쓸어 넘기면 마치 사진 이 움직이는 것처럼 보이는 애니메이션 효과를 가질 수 있다. 본 발명에서 언급한 이동통신 단말기는 휴대폰, 태블릿, 노트북 등을 다 포함하고 있으며 이동통신(移動通信, mobile communications)이란 “사용자가 자유롭게 이동하는 중에도 계속적인 통신이 가능하도록 해주는 통신시 스템을 말한다.” 이동통신 단말기로는 그 기기 자체에서 편집이 가능하기 때문에 사용자가 원하는 영상의 원하 는 부분만 추출하여 블루투스를 통해 출력기와 인터페이스를 하게 되면 출력기를 통해 사진이 나오는 방식이다. 또한, 카메라로 찍은 영상의 길이가 길면 사진이 너무 많이 나오고 두꺼워질 우려가 있으므로 적당한 시간의 길 이, 약 10-20초 정도가 적합하다고 생각하며 카메라는 그 부분을 영상 편집, 필터 넣기가 가능하게 한다. 또한, 출력기에는 다이얼을 달아서 0.1-1초까지 사용자가 원하는 간격으로 지정하여 영상을 사진으로 인쇄할 수 있게 하는 것을 포함한다."}
{"patent_id": "10-2021-0182271", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "본 발명은 사진을 현장에서 찍고 원하는 사진을 바로 인출하는 사진 프린터가 인기를 끌고 있는 요즈음 사진 대신 영상을 인쇄하면 더 재미있고, 당시의 상황을 더욱 자세하고 소중한 추억으로 남길 수 있다는 점에서 개발하게 되었다. “블루투스(Bluetooth)란 약10m 내의 단거리에서 최대 1Mbps ~ 3Mbps의 속도로 2.4GHz의 ISM(Industrial Scientific Medical) 주파수를 이용하여 각종 디지털 장비 간의 통신에 물리적인 장치 케이블 없이 무선으로 음 성 및 데이터를 전송하는 PAN(Personal Area Network)의 대표적인 무선통신기술을 의미한다. 블루투스는 ISM밴 드인 2.4GHz를 사용하고 있기 때문에 정보사용 이용료 등 따로 부과되는 이용 요금이 없고, 저전력 파워 모드를 지원하고 있기 때문에 휴대용 기기에 주로 사용되고 있다. 블루투스는 일반적으로 SCO(Synchronous Connection- Oriented)링크를 통해 음성을 전송하고, ACL(Asynchronous Connection-Less)링크를 통해 데이터를 전송하며, 전송할 데이터의 종류에 따른 각종 프로파일을 지원한다.” 이러한 블루투스는 다양한 분야에서 사용되고 있으며, PDA(Personal Digital Assistants), Note-PC, 단말기 내 에 블루투스가 탑재된 뒤부터 블루투스에서 응용된 분야가 무수히 많아지는 추세이며, 그 중 대표적인 것이 해드셋(Headset), 핸드프리(Handsfree), 프린트, 무선 키보드, 블루투스 TV 등이 있다. GPU는 영상정보를 처리하면서 화면에 출력하는 일을 한다. 많은 게임에서 그래픽 사양이 높아지게 되며 그래픽 카드 또한 계속 발전해서 성능이 높아지고 있으며 이러한 그래픽처리를 위해 고성능 처리장치를 이용한 그래픽 카드의 핵심이다. 게임이나 영상편집 등의 멀티미디어 작업에서는 CPU를 보조해주는 부품으로 등장하였으며 GPU는 4차 산업혁명의 핵심이라고 불리는 인공지능(AI) 컴퓨터의 부품으로 손꼽히고 있다."}
{"patent_id": "10-2021-0182271", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 사진을 현장에서 찍고 원하는 사진을 바로 인출하는 사진 프린터가 인기를 끌고 있는 요즈음 사진 대신 영상을 인쇄하면 더 재미있고, 당시의 상황을 더욱 자세하고 소중한 추억으로 남길 수 있다는 점에서 개발하게 되었다. “블루투스(Bluetooth)란 약10m 내의 단거리에서 최대 1Mbps ~ 3Mbps의 속도로 2.4GHz의 ISM(Industrial Scientific Medical) 주파수를 이용하여 각종 디지털 장비 간의 통신에 물리적인 장치 케이블 없이 무선으로 음 성 및 데이터를 전송하는 PAN(Personal Area Network)의 대표적인 무선통신기술을 의미한다. 블루투스는 ISM밴 드인 2.4GHz를 사용하고 있기 때문에 정보사용 이용료 등 따로 부과되는 이용 요금이 없고, 저전력 파워 모드를 지원하고 있기 때문에 휴대용 기기에 주로 사용되고 있다. 블루투스는 일반적으로 SCO(Synchronous Connection- Oriented)링크를 통해 음성을 전송하고, ACL(Asynchronous Connection-Less)링크를 통해 데이터를 전송하며, 전송할 데이터의 종류에 따른 각종 프로파일을 지원한다.” 이러한 블루투스는 다양한 분야에서 사용되고 있으며, PDA(Personal Digital Assistants), Note-PC, 단말기 내 에 블루투스가 탑재된 뒤부터 블루투스에서 응용된 분야가 무수히 많아지는 추세이며, 그 중 대표적인 것이 해 드셋(Headset), 핸드프리(Handsfree), 프린트, 무선 키보드, 블루투스 TV 등이 있다. GPU는 영상정보를 처리하면서 화면에 출력하는 일을 한다. 많은 게임에서 그래픽 사양이 높아지게 되며 그래픽 카드 또한 계속 발전해서 성능이 높아지고 있으며 이러한 그래픽처리를 위해 고성능 처리장치를 이용한 그래픽 카드의 핵심이다. 게임이나 영상편집 등의 멀티미디어 작업에서는 CPU를 보조해주는 부품으로 등장하였으며 GPU는 4차 산업혁명의 핵심이라고 불리는 인공지능(AI) 컴퓨터의 부품으로 손꼽히고 있다."}
{"patent_id": "10-2021-0182271", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명으로 디지털화 된 영상을 아날로그화 한다는 점에서 색다른 방식으로 저장할 수 있다. 데이터가 지워지 거나 오류가 생길 염려가 없으며, 새로운 방식의 저장방법으로 기존의 추억을 통해 새로운 추억으로 만들 수 있 다."}
{"patent_id": "10-2021-0182271", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "설명한 바와 같이, 본 발명의 제조방법에 의해 만들어진 동영상 사진 변환 프린터는 일반적으로 생산되는 모션 캡쳐 카메라에서 프린터를 더한 것이다. 인테리어의 용도로 활용할 수 있으며 동영상을 사진으로, 재미까 지 더해진 책 형태로 보관하는 것을 가능하게 한다. 새로운 방식의 동영상 저장방법으로 사용할 수 있으며 책 형태로 보관된 추억의 일부분을 공유함으로써 또 다르게 색다른 추억을 쌓을 수 있게 한다."}
{"patent_id": "10-2021-0182271", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 도면1과 같이 GPU 병렬연산 모듈, 출력부, 모션캡쳐부로 구성된다. 출력부 은 다수의 영상출력부(200a,200b,200c,200d ...)로 구성이 되는데, 분할된 3D 영상물을 출력하는 영상출력 부 여러 개가 합쳐져 전체로써 하나의 3D 영상물를 출력하는 역할을 한다. 영상출력부는 출력부가 하나의 큰 화면을 구성하며 각 영상출력부에 의한 화면의 경계부가 닿을 수 있게 설치되는 것이다. 모션캡쳐부는 사용자의 모션을 인식하고 모션 정보를 생성하며 이를 GPU 병렬연산 모듈로 송출시키는 역할을 한다. 출력부에 설치되어 있는 공간 내에서 사용자의 시선과 손동작, 몸동작 등을 인식 가능하게 한다. GPU 병렬연산 모듈은 다수의 영상 출력부(200a,200b,200c,200d...)와 상응하는 다양한 렌더 연산 qn(100a,100b,100c,100d...)로 구성된다. 즉, 렌더 연산부와 영상 출력부가 1:1로 연결된다는 것이다. 렌더 연산부(100a)는 3D 영상물과 3D 영상물 상에서 각 영상 출력부에서 출력되는 영상 좌표의 값으 로 구성되는 분할 영역 정보가 저장되어, 3D 영상물을 분할 영역 정보에 따라 분류하고, 분류된 3D 영상물을 렌더링을 한 뒤, 렌더링 된 분할 3D 영상물을 연결된 영상출력부로 보낼 수 있게 된다."}
{"patent_id": "10-2021-0182271", "section": "도면", "subsection": "도면설명", "item": 1, "content": "단말기에서 블루투스 모드를 실행하고 프린터를 검색하여 정보를 요청하고 프린터에서 정보가 전송이 되 면 단말기와 출력기가 연결된다. GPU 병렬연산 모듈을 통해 모션 캡쳐를 실행하고 단말기와 출력기의 연결이 진 행되면 데이터(영상) 선택 후 프린트 포맷을 설정 후 전송과 데이터를 전송한다. 전송완료 메시지가 뜬다면 프 린트를 수행하고 완료된다. 전송에 실패를 하게 되면 데이터를 다시 전송하여 프린트를 수행한다. 사진이 출력 되면 사용자가 블루투스의 끄기 기능으로 종료한다."}
