{"patent_id": "10-2023-0042432", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0062891", "출원번호": "10-2023-0042432", "발명의 명칭": "세포 분석 방법 및 장치", "출원인": "(주)힉스컴퍼니", "발명자": "이대건"}}
{"patent_id": "10-2023-0042432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "적어도 하나의 프로세서에 의해 수행되는 세포 분석 방법으로서,제1 파장을 갖는 제1 광(light)을 의심 부위에 포함된 제1 세포 영역에 조사하여 제1 스펙클 패턴(specklepattern)을 획득하는 단계;제2 파장을 갖는 제2 광을 상기 제1 세포 영역에 조사하여 제2 스펙클 패턴을 획득하는 단계; 및상기 제1 스펙클 패턴 및 상기 제2 스펙클 패턴을 기초로 상기 제1 세포 영역을 정상 세포 영역 및 비정상 세포영역으로 구분하는 단계;를 포함하는 세포 분석 방법."}
{"patent_id": "10-2023-0042432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제1 광을 상기 의심 부위에 포함된 제2 세포 영역에 조사하여 제3 스펙클 패턴을 획득하는 단계;상기 제2 광을 상기 제2 세포 영역에 조사하여 제4 스펙클 패턴을 획득하는 단계;상기 제3 스펙클 패턴 및 상기 제4 스펙클 패턴을 기초로 상기 제2 세포 영역을 정상 세포 영역 및 비정상 세포영역으로 구분하는 단계; 및상기 정상 세포 영역 및 비정상 세포 영역이 구분된 상기 제1 세포 영역 및 상기 제2 세포 영역을 결합하여 상기 의심 부위 중 적어도 일부 영역에 대한 세포 분석을 수행하는 단계;를 더 포함하는 세포 분석 방법."}
{"patent_id": "10-2023-0042432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 정상 세포 영역 및 비정상 세포 영역이 구분된 상기 제1 세포 영역 및 상기 제2 세포 영역을 결합하여 상기 의심 부위 중 적어도 일부 영역에 대한 세포 분석을 수행하는 단계는,상기 의심 부위에서의 상기 제1 세포 영역의 위치 좌표 값 및 상기 제2 세포 영역의 위치 좌표 값을 이용하여상기 제1 세포 영역 및 상기 제2 세포 영역을 결합하는 단계;를 포함하는 세포 분석 방법."}
{"patent_id": "10-2023-0042432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 세포 분석이 수행되는 경우, 상기 의심 부위에 대한 과거 분석 이력을 검색하는 단계; 및검색 결과 상기 의심 부위에 대한 과거 분석 이력이 존재하는 경우, 상기 세포 분석의 수행 결과를 기초로 상기의심 부위에 대한 과거 분석 데이터를 업데이트하는 단계;공개특허 10-2024-0062891-3-를 더 포함하는 세포 분석 방법."}
{"patent_id": "10-2023-0042432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2항에 있어서,상기 세포 분석을 기초로 상기 의심 부위 중 상기 정상 세포 영역을 제1 색상으로 표시하고, 상기 비정상 세포영역을 제2 색상으로 표시한 세포 분석 데이터를 생성하는 단계;를 더 포함하는 세포 분석 방법."}
{"patent_id": "10-2023-0042432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 생성된 세포 분석 데이터를 스마트 글래스(smart glass)로 전송하는 단계;를 더 포함하는 세포 분석 방법."}
{"patent_id": "10-2023-0042432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 스마트 글래스는,상기 스마트 글래스를 착용한 사용자의 시선 방향 및 시야 범위를 포함하는 시야 데이터를 생성하고,상기 생성된 시야 데이터 및 상기 세포 분석 데이터를 기초로 상기 스마트 글래스의 디스플레이 상에 상기 정상세포 영역 및 상기 비정상 세포 영역을 표시하는, 세포 분석 방법."}
{"patent_id": "10-2023-0042432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 제1 세포 영역을 정상 세포 영역 및 비정상 세포 영역으로 구분하는 단계는,학습된 인공신경망 모델에 상기 제1 스펙클 패턴 및 상기 제2 스펙클 패턴을 제공하여 상기 제1 세포 영역을 정상 세포 영역 및 비정상 세포 영역으로 구분하는 단계;를 포함하는 세포 분석 방법."}
{"patent_id": "10-2023-0042432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항 내지 제8항 중 어느 한 항에 따른 방법을 컴퓨터에서 실행하기 위해 컴퓨터 판독 가능한 기록 매체에 저장된 컴퓨터 프로그램."}
{"patent_id": "10-2023-0042432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "컴퓨팅 장치로서,통신 모듈;메모리; 및상기 메모리와 연결되고, 상기 메모리에 포함된 컴퓨터 판독 가능한 적어도 하나의 프로그램을 실행하도록 구성공개특허 10-2024-0062891-4-된 적어도 하나의 프로세서를 포함하고,상기 적어도 하나의 프로그램은,제1 파장을 갖는 제1 광을 의심 부위에 포함된 제1 세포 영역에 조사하여 제1 스펙클 패턴을 획득하고,제2 파장을 갖는 제2 광을 상기 제1 세포 영역에 조사하여 제2 스펙클 패턴을 획득하고,상기 제1 스펙클 패턴 및 상기 제2 스펙클 패턴을 기초로 상기 제1 세포 영역을 정상 세포 영역 및 비정상 세포영역으로 구분하기 위한 명령어들을 포함하는 컴퓨팅 장치."}
{"patent_id": "10-2023-0042432", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 세포 분석 방법에 관한 것이다. 세포 분석 방법은, 제1 파장을 갖는 제1 광을 의심 부위에 포함된 제1 세포 영역에 조사하여 제1 스펙클 패턴을 획득하는 단계, 제2 파장을 갖는 제2 광을 제1 세포 영역에 조사하여 제2 스펙클 패턴을 획득하는 단계 및 제1 스펙클 패턴 및 제2 스펙클 패턴을 기초로 제1 세포 영역을 정상 세포 영역 및 비정상 세포 영역으로 구분하는 단계를 포함한다."}
{"patent_id": "10-2023-0042432", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 세포 분석 방법 및 장치에 관한 것으로, 구체적으로, 정상 세포와 비정상 세포를 구분하여 수술에 활 용하기 위한 세포 분석 방법 및 장치에 관한 것이다. 이 특허는 과학기술정보통신부 방송통신발전기금을 지원받아 출원한 것이다."}
{"patent_id": "10-2023-0042432", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 의료 분야에서 이미지 분석을 통해 환자의 건강 상태를 진단하는 기술이 활발히 사용되고 있다. 예를 들어, 환자의 X-ray 이미지, MRI 이미지 등을 인공신경망 모델에 제공하는 경우, 환자의 질환 유무 등에 대한 정보가 획득될 수 있다. 한편, 의료 분야에서 수술 중 암 질환을 진단하고, 암 세포가 전이된 영역과 정상인 영역을 구분하는 것은 쉽지 않다. 예를 들어, MRI 이미지 등으로 암 세포를 검출하는 것은 정확도가 낮을 수 있다. 또한, 사전에 암 세포를 검출한 경우에도, 암 세포의 정확한 위치를 특정하기는 쉽지 않아, 수술 중 육안으로 어떤 세포가 정상 세포이 고 어떤 세포가 암 세포인지 판단하는 것은 어려운 문제가 있다."}
{"patent_id": "10-2023-0042432", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점을 해결하기 위한 세포 분석 방법, 컴퓨터 판독 가능 매체에 저장된 컴퓨터 프로 그램, 컴퓨터 프로그램이 저장된 컴퓨터 판독 가능 매체 및 장치(시스템)를 제공한다."}
{"patent_id": "10-2023-0042432", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명은 방법, 장치(시스템), 컴퓨터 판독 가능 매체에 저장된 컴퓨터 프로그램 또는 컴퓨터 프로그램이 저장 된 컴퓨터 판독 가능 매체를 포함한 다양한 방식으로 구현될 수 있다. 본 발명의 일 실시예에 따르면, 적어도 하나의 프로세서에 의해 수행되는 세포 분석 방법은, 제1 파장을 갖는 제1 광을 의심 부위에 포함된 제1 세포 영역에 조사하여 제1 스펙클 패턴을 획득하는 단계, 제2 파장을 갖는 제 2 광을 제1 세포 영역에 조사하여 제2 스펙클 패턴을 획득하는 단계 및 제1 스펙클 패턴 및 제2 스펙클 패턴을 기초로 제1 세포 영역을 정상 세포 영역 및 비정상 세포 영역으로 구분하는 단계를 포함한다. 본 발명의 일 실시예에 따르면, 제1 광을 의심 부위에 포함된 제2 세포 영역에 조사하여 제3 스펙클 패턴을 획 득하는 단계, 제2 광을 제2 세포 영역에 조사하여 제4 스펙클 패턴을 획득하는 단계, 제3 스펙클 패턴 및 제4 스펙클 패턴을 기초로 제2 세포 영역을 정상 세포 영역 및 비정상 세포 영역으로 구분하는 단계 및 정상 세포 영역 및 비정상 세포 영역이 구분된 제1 세포 영역 및 제2 세포 영역을 결합하여 의심 부위 중 적어도 일부 영역에 대한 세포 분석을 수행하는 단계를 더 포함한다. 본 발명의 일 실시예에 따르면, 정상 세포 영역 및 비정상 세포 영역이 구분된 제1 세포 영역 및 제2 세포 영역 을 결합하여 의심 부위 중 적어도 일부 영역에 대한 세포 분석을 수행하는 단계는, 의심 부위에서의 제1 세포 영역의 위치 좌표 값 및 제2 세포 영역의 위치 좌표 값을 이용하여 제1 세포 영역 및 제2 세포 영역을 결합하는 단계를 포함한다. 본 발명의 일 실시예에 따르면, 세포 분석이 수행되는 경우, 의심 부위에 대한 과거 분석 이력을 검색하는 단계 및 검색 결과 의심 부위에 대한 과거 분석 이력이 존재하는 경우, 세포 분석의 수행 결과를 기초로 의심 부위에 대한 과거 분석 데이터를 업데이트하는 단계를 더 포함한다. 본 발명의 일 실시예에 따르면, 세포 분석을 기초로 의심 부위 중 정상 세포 영역을 제1 색상으로 표시하고, 비 정상 세포 영역을 제2 색상으로 표시한 세포 분석 데이터를 생성하는 단계를 더 포함한다. 본 발명의 일 실시예에 따르면, 생성된 세포 분석 데이터를 스마트 글래스로 전송하는 단계를 더 포함한다. 본 발명의 일 실시예에 따르면, 스마트 글래스는, 스마트 글래스를 착용한 사용자의 시선 방향 및 시야 범위를 포함하는 시야 데이터를 생성하고, 생성된 시야 데이터 및 세포 분석 데이터를 기초로 스마트 글래스의 디스플 레이 상에 정상 세포 영역 및 비정상 세포 영역을 표시한다. 본 발명의 일 실시예에 따르면, 제1 세포 영역을 정상 세포 영역 및 비정상 세포 영역으로 구분하는 단계는, 학 습된 인공신경망 모델에 제1 스펙클 패턴 및 제2 스펙클 패턴을 제공하여 제1 세포 영역을 정상 세포 영역 및 비정상 세포 영역으로 구분하는 단계를 포함한다. 본 발명의 일 실시예에 따른 상술된 방법을 컴퓨터에서 실행하기 위해 컴퓨터 판독 가능한 기록 매체에 저장된 컴퓨터 프로그램이 제공된다. 본 발명의 일 실시예에 따른 컴퓨팅 장치는, 통신 모듈, 메모리 및 메모리와 연결되고, 메모리에 포함된 컴퓨터 판독 가능한 적어도 하나의 프로그램을 실행하도록 구성된 적어도 하나의 프로세서를 포함한다. 적어도 하나의 프로그램은, 제1 파장을 갖는 제1 광을 의심 부위에 포함된 제1 세포 영역에 조사하여 제1 스펙클 패턴을 획득 하고, 제2 파장을 갖는 제2 광을 제1 세포 영역에 조사하여 제2 스펙클 패턴을 획득하고, 제1 스펙클 패턴 및 제2 스펙클 패턴을 기초로 제1 세포 영역을 정상 세포 영역 및 비정상 세포 영역으로 구분하기 위한 명령어들을 포함한다."}
{"patent_id": "10-2023-0042432", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 다양한 실시예에서 사용자는 암세포 및 정상 세포를 육안으로 구분하기 어려운 경우에도, LSP 모듈, 컴퓨팅 장치 및 스마트 글래스를 통해 간단히 의심 부위의 정상 여부를 식별할 수 있다. 본 발명의 다양한 실시예에서 환자마다 수술이 진행되는 등으로 정상 세포 영역 및 비정상 세포 영역이 변경되 는 경우에도 프로세서는 과거 분석 데이터를 통해 이를 추적 관찰할 수 있다. 본 발명의 다양한 실시예에서 스마트 글래스를 착용한 사용자는 의심 부위를 응시하는 것만으로 간단히 어떤 세 포 영역이 비정상인지 여부를 확인할 수 있다."}
{"patent_id": "10-2023-0042432", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과는 이상에서 언급한 효과로 제한되지 않으며, 언급되지 않은 다른 효과들은 청구범위의 기재로부"}
{"patent_id": "10-2023-0042432", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 3, "content": "터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자(\"통상의 기술자\"라 함)에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0042432", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 실시를 위한 구체적인 내용을 첨부된 도면을 참조하여 상세히 설명한다. 다만, 이하의 설명에 서는 본 발명의 요지를 불필요하게 흐릴 우려가 있는 경우, 널리 알려진 기능이나 구성에 관한 구체적 설명은 생략하기로 한다. 첨부된 도면에서, 동일하거나 대응하는 구성요소에는 동일한 참조부호가 부여되어 있다. 또한, 이하의 실시예들 의 설명에 있어서, 동일하거나 대응되는 구성요소를 중복하여 기술하는 것이 생략될 수 있다. 그러나, 구성요소 에 관한 기술이 생략되어도, 그러한 구성요소가 어떤 실시예에 포함되지 않는 것으로 의도되지는 않는다. 개시된 실시예의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 후술되어 있는 실시예 들을 참조하면 명확해질 것이다. 그러나, 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 발명이 완전하도록 하고, 본 발명이 통상의 기술 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것일 뿐이다. 본 명세서에서 사용되는 용어에 대해 간략히 설명하고, 개시된 실시예에 대해 구체적으로 설명하기로 한다. 본 명세서에서 사용되는 용어는 본 발명에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 관련 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 발명의 설명 부분에서 상 세히 그 의미를 기재할 것이다. 따라서, 본 발명에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가지는 의미와 본 발명의 전반에 걸친 내용을 토대로 정의되어야 한다. 본 명세서에서의 단수의 표현은 문맥상 명백하게 단수인 것으로 특정하지 않는 한, 복수의 표현을 포함한다. 또 한, 복수의 표현은 문맥상 명백하게 복수인 것으로 특정하지 않는 한, 단수의 표현을 포함한다. 명세서 전체에 서 어떤 부분이 어떤 구성요소를 포함한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제 외하는 것이 아니라 다른 구성요소를 더 포함할 수 있음을 의미한다. 본 발명에서, \"포함하다\", \"포함하는\" 등의 용어는 특징들, 단계들, 동작들, 요소들 및/또는 구성 요소들이 존 재하는 것을 나타낼 수 있으나, 이러한 용어가 하나 이상의 다른 기능들, 단계들, 동작들, 요소들, 구성 요소들 및/또는 이들의 조합이 추가되는 것을 배제하지는 않는다. 본 발명에서, 특정 구성 요소가 임의의 다른 구성 요소에 \"결합\", \"조합\", \"연결\" 되거나, \"반응\" 하는 것으로 언급된 경우, 특정 구성 요소는 다른 구성 요소에 직접 결합, 조합 및/또는 연결되거나, 반응할 수 있으나, 이 에 한정되지 않는다. 예를 들어, 특정 구성 요소와 다른 구성 요소 사이에 하나 이상의 중간 구성 요소가 존재 할 수 있다. 또한, 본 발명에서 \"및/또는\"은 열거된 하나 이상의 항목의 각각 또는 하나 이상의 항목의 적어도 일부의 조합을 포함할 수 있다. 본 발명에서, \"제1\", \"제2\" 등의 용어는 특정 구성 요소를 다른 구성 요소와 구별하기 위해 사용되는 것으로, 이러한 용어에 의해 상술된 구성 요소가 제한되진 않는다. 예를 들어, \"제1\" 구성 요소는 \"제2\" 구성 요소와 동 일하거나 유사한 형태의 요소일 수 있다. 본 발명에서, \"스펙클 패턴(speckle pattern)\"은 간섭성 광원의 간섭이 나타내는 패턴을 지칭할 수 있다. 예를 들어, 체세포에 조사된 광원은 서로 다른 공간적 위치의 물체에 반사될 수 있으며, 이에 따라, 광도의 증폭, 부 분적 및/또는 완전한 소거가 광 기록 평면의 다양한 지점에서 발생하여 스펙클 패턴을 생성할 수 있다. 본 발명에서, \"의심 부위\"는 암 등의 이상 병변이 의심되는 환자의 개복 부위를 지칭할 수 있다. 본 발명에서, \"세포 분석\"은 의심 부위에서 정상 세포를 포함하는 정상 세포 영역과 암세포 등의 비정상 세포를 포함하는 비정상 세포를 구분하는 것을 지칭할 수 있다.도 1은 본 발명의 일 실시예에 따른 LSP 모듈, 컴퓨팅 장치 및 스마트 글래스를 이용하여 세포 분석이 수행되는 예시를 나타내는 블록도이다. 도시된 것과 같이, 컴퓨팅 장치는 LSP(laser speckle pattern) 모듈로부터 스펙클 패턴을 획득하여 의심 부위(예: 개복 시 암 세포 전이가 의심되는 부위)에 대 한 세포 분석 데이터를 생성할 수 있다. 여기서, LSP(laser speckle pattern) 모듈은 서로 다른 파장의 광(light)을 조사할 수 있는 장치로서, 스펙클 패턴을 생성하기 위해 사용되는 장치를 지칭할 수 있다. 일 실시예에 따르면, 의사 등의 사용자는 LSP 모듈을 이용하여 의심 부위에 광을 조사하고, 이를 기초로 스펙클 패턴을 생성할 수 있다. 예를 들어, 사용자는 LSP 모듈을 의심 부위에 비스듬히(예: 약 30도의 기 울기로) 입사시켜 스펙클 패턴을 생성할 수 있다. 이와 같이 광을 의심 부위에 비스듬히 입사시키는 경우, 의심 부위를 구성하는 세포 내의 객체 등에 의해 빛이 반사되거나 산란될 수 있으며, 반사되거나 산란된 빛이 서로 간섭을 일으키는 경우, 스펙클 패턴이 생성될 수 있다. 또한, 이와 같이 생성된 스펙클 패턴은 임의의 이미지 센서 등을 통해 기록되어 컴퓨팅 장치에 제공될 수 있다. 일 실시예에 따르면, 세포의 외측 부분의 특성을 결정하는 스펙클 패턴(예: 제1 스펙클 패턴)을 생성하기 위해 제1 파장을 갖는 제1 광이 사용될 수 있다. 예를 들어, 제1 광은 약 450nm의 제1 파장을 갖는 청색 광일 수 있 다. 추가적으로, 세포의 내측 부분의 특성을 결정하는 스펙클 패턴(예: 제2 스펙클 패턴)을 생성하기 위해 제2 파장을 갖는 제2 광이 사용될 수 있다. 예를 들어, 제2 광은 약 635nm의 제2 파장을 갖는 적색 광일 수 있다. 이와 같이 파장이 다른 2개의 광을 사용하여 각각의 스펙클 패턴을 획득하는 경우, 컴퓨팅 장치는 세포의 외측 및 내측의 특성을 모두 활용하여 단순히 표면의 이미지를 이용하여 세포 분석을 수행하는 경우보다 더욱 정밀하게 의심 부위의 정상 세포 영역 및 비정상 세포 영역을 구분할 수 있다. 일 실시예에 따르면, 컴퓨팅 장치는 스펙클 패턴을 기초로 세포 영역을 정상 세포 또는 비정상 세포로 구 분하도록 학습된 인공신경망 모델(예: 분류 모델)에 획득한 스펙클 패턴을 제공하여 의심 부위의 정상 세포 영 역 및 비정상 세포 영역을 구분할 수 있다. 예를 들어, 인공신경망 모델은 데이터 전처리, 특징 추출(feature extraction) 및 분류(classification) 과정을 통해 세포 영역에서 정상 세포 영역 및 비정상 세포 영역을 구분 할 수 있다. 일 실시예에 따르면, 의심 부위는 복수의 세부적인 세포 영역으로 구분될 수 있으며, 각각의 세포 영역에서 스 펙클 패턴이 생성될 수 있다. 예를 들어, LSP 모듈을 제1 세포 영역에 조사하는 경우 제1 스펙클 패턴 및 제2 스펙클 패턴이 생성되고, LSP 모듈을 제2 세포 영역에 조사하는 경우 제3 스펙클 패턴 및 제4 스펙클 패턴이 생성될 수 있다. 이 경우, 컴퓨팅 장치는 제1 및 제2 스펙클 패턴을 이용하여 제1 세포 영역을 정상 세 포 영역 및 비정상 세포 영역으로 구분하고, 제3 및 제4 스펙클 패턴을 이용하여 제2 세포 영역을 정상 세포 영 역 및 비정상 세포 영역으로 구분할 수 있다. 그리고 나서, 컴퓨팅 장치는 제1 세포 영역 및 제2 세포 영역을 결합하여 의심 부위 중 적어도 일부 영역 에 대한 세포 분석을 수행할 수 있다. 예를 들어, 각각의 세포 영역은 대응하는 위치 좌표 값을 가질 수 있으며, 컴퓨팅 장치는 위치 좌표 값에 기초하여 각각의 세포 영역을 결합할 수 있다. 즉, 이와 같이 세부 적인 영역으로 구분하여 분석한 결과를 결합하여 세포 분석에 이용함으로써, 컴퓨팅 장치는 의심 부위 전 체에 대한 스펙클 패턴을 이용하는 경우보다 정밀한 세포 분석 데이터를 생성할 수 있다. 일 실시예에 따르면, 컴퓨팅 장치는 세포 분석이 수행되는 경우, 의심 부위에 대한 과거 분석 이력을 검색 할 수 있다. 예를 들어, 환자 마다 세포 분석이 수행된 이력이 있는 경우, 과거 분석 이력은 데이터베이스 상에 저장되어 관리될 수 있으며, 컴퓨팅 장치는 환자의 과거 분석 이력을 데이터베이스에서 검색할 수 있다. 검색 결과 의심 부위에 대한 과거 분석 이력이 존재하는 경우, 컴퓨팅 장치는 세포 분석의 수행 결과를 기초로 의심 부위에 대한 과거 분석 데이터를 업데이트할 수 있다. 일 실시예에 따르면, 이와 같이 생성된 세포 분석 데이터는 의심 부위를 수술하기 위한 사용자(예: 의사)의 스 마트 글래스로 전송될 수 있다. 여기서, 세포 분석 데이터는 의심 부위에 포함된 체세포를 정상 세포 또는 암세포로 구분한 것으로서, 예를 들어, 의심 부위 중 정상 세포 영역을 제1 색상으로 표시하고, 비정상 세포 영 역을 제2 색상으로 표시한 이미지 데이터를 지칭할 수 있다. 일 실시예에 따르면, 사용자가 스마트 글래스를 통해 의심 부위를 응시하는 경우, 의심 부위와 세포 분석 데이터가 매칭될 수 있으며, 스마트 글래스 상에 정상 세포 영역 및 비정상 세포 영역이 구분되어 표시될 수 있다. 이와 같은 구성에 의해, 사용자는 암세포 및 정상 세포를 육안으로 구분하기 어려운 경우에도, LSP 모 듈, 컴퓨팅 장치 및 스마트 글래스를 통해 간단히 의심 부위의 정상 여부를 식별할 수 있다.도 2는 본 발명의 일 실시예에 따른 스마트 글래스를 도시하는 평면도이다. 도시된 것과 같이, 스마트 글 래스는 외부 상황을 촬영하도록 구성된 적어도 하나의 전면 카메라(또는 이미지 센서)(222, 224), 사용자 의 좌안과 우안을 촬영하도록 구성된 적어도 하나의 후면 카메라(232, 234), 제1 영상을 오버레이하여 표시하도 록 구성된 제1 디스플레이(예: 투명 디스플레이), 제2 영상을 오버레이하여 표시하도록 구성된 제2 디스플 레이(예: 투명 디스플레이) 및 적어도 하나의 전면 카메라(222, 224) 및 적어도 하나의 후면 카메라(232, 234)로부터 적어도 하나의 이미지를 수신하여 처리하고, 제1 디스플레이 및 제2 디스플레이의 동작을 제어하도록 구성된 제어부를 포함한다. 전면 카메라(222, 224)는 스마트 글래스의 외부 또는 바깥쪽으로 노출되어 외부 상황 및/또는 의심 부위를 촬영하도록 구성된 카메라로, 좌측의 전면 카메라 및 우측의 전면 카메라를 포함한다. 후면 카메라 (232, 234)는 스마트 글래스의 내부 또는 안쪽으로 노출되어 사용자의 양안을 촬영하도록 구성된 카메라로, 사용자의 좌안을 촬영하는 좌측의 후면 카메라 및 사용자의 우안을 촬영하는 우측의 후면 카메라를 포함한다. 후면 카메라(232, 234)는 사용자 눈의 움직임, 깜빡임, 동공 크기, 눈물 발생 여 부 및 시선 등의 시각 정보를 촬영하도록 구성될 수 있다. 추가적으로 또는 대안적으로, 후면 카메라(232, 23 4)는 투명 디스플레이(212, 214) 옆에 배치될 수 있다. 일 실시예에 따르면, 후면 카메라(232, 234)를 이용하여 사용자의 좌안 및/또는 우안이 촬영될 수 있으며, 홍채 인식을 통해 사용자 인증을 진행하여 보다 고 정밀의 보안 기능을 제공할 수 있다. 즉, 스마트 글래스를 착용하는 경우, 해당 사용자가 사전 등록된 사 용자인지 여부가 판정될 수 있다. 디스플레이(212, 214)는 투명 OLED(Organic Light-Emitting Diode) 디스플레이로, 스마트 글래스의 전면 에 설치되어 사용자의 육안으로 인식되는 텍스트 또는 이미지를 재생할 수 있다. 일 실시예에 따르면, 디스플레 이(212, 214)는 마이크로 디스플레이일 수 있다. 디스플레이(212, 214)는 텍스트, 이미지 및/또는 홀로그램을 표시해서 사용자가 디스플레이(212, 214)를 투과해서 외부 사물 또는 사람을 인식할 때, 임의의 정보(예: 세포 의 정상 또는 비정상 여부 등)를 표시할 수 있다. 디스플레이(212, 214)는 투과도를 낮춰 사용자가 텍스트, 이 미지 및/또는 홀로그램을 보다 선명하게 인식하도록 할 수 있다. 예를 들어, 제1 디스플레이는 제1 영상을 오버레이하여 표시하고, 제2 디스플레이는 제2 영상을 오버레이하여 표시하도록 구성될 수 있다. 도 1에 도시된 바와 같이 제1 디스플레이는 사용자의 좌안 앞에 배치되고, 제2 디스플레이는 사용자의 우안 앞에 배치될 수 있다. 일 실시예에 따르면, 디스플레이(212, 214)는 투명 OLED 대신에 렌즈에 영상이 투사되는 방식으로 구현될 수 있 다. 이 경우, 스마트 글래스의 프레임의 양측에 설치된 프로젝터로부터 빔이 투명 디스플레이를 향해 방출 되고, 사용자는 투명 디스플레이에 투사된 영상을 확인할 수 있다. 제어부는 적어도 하나의 전면 카메라(222, 224) 및 적어도 하나의 후면 카메라(232, 234)로부터 적어도 하나의 이미지(예: 세포 분석 데이터에 대응하는 이미지)를 수신하여 처리하고, 제1 디스플레이 및 제2 디스플레 이의 동작을 제어하도록 구성된다. 또한, 제어부는 중앙 서버와 주고받는 통신 신호에 기초하여 스마트 글 래스의 동작을 제어할 수 있다. 예를 들어, 제어부는 투명 디스플레이(212, 214)에 텍스트, 이미지 및/또 는 홀로그램이 표시되도록 할 수 있다. 또한, 마이크(242, 244)를 통해 명령 신호가 수신되면, 제어부는 명령 신호에 대응하는 텍스트, 이미지 및/또는 홀로그램을 투명 디스플레이(212, 214)에 표시할 수 있다. 일 실시예에 따르면, 스마트 글래스의 사용자는 제1 디스플레이를 통해 의심 부위와 연관된 임의의 영상을 좌안으로 확인하고, 사용자는 제2 디스플레이를 통해 의심 부위와 연관된 임의의 영상을 우안 으로 확인할 수 있다. 이 때, 제어부는 적어도 하나의 후면 카메라(232, 234)로부터 수신되는 적어도 하나 의 이미지를 통해 사용자의 눈 상태를 감지할 수 있다. 사용자의 눈 상태가 비정상인 것으로 판정하는 것에 응 답하여, 제어부는 제1 디스플레이 또는 제2 디스플레이를 선택적으로 재생할 수 있다. 스마트 글래스의 제어부는, 적어도 하나의 후면 카메라(232, 234)로부터 수신되는 적어도 하나의 이미지에 기초하여 사용자의 주시안(dominant eye)을 결정할 수 있다. 주시안을 결정하는 것에 응답하여, 제어부는 제1 디스플레이 또는 제2 디스플레이 중 사용자의 주시안에 대응하는 디스플레이를 제1 시간 기간 동안 재생할 수 있다. 이 때, 제어부는 사용자의 비-주시안(non-dominant eye)에 대응하는 디스플레이의 재생을 제1 시간 기간 동안 중지할 수 있다. 스마트 글래스의 제어부는, 적어도 하나의 후면 카메라(232, 234)로부터 수신되는 적어도 하나의 이미지에 기초하여 사용자의 주시안의 피로도를 결정할 수 있다. 주시안의 피로도에 따라, 제어부는 제1 시간 기간을 동 적으로 조정할 수 있다. 또한, 제1 시간 기간(또는 조정된 제1 시간 기간)이 경과한 후, 제어부는 사용자의 비-주시안에 대응하는 디스플레이를 제2 시간 기간 동안 재생하고, 사용자의 주시안에 대응하는 디스플레이의 재생 을 제2 시간 기간 동안 중지할 수 있다. 이 경우, 제어부는, 적어도 하나의 후면 카메라(232, 234)로부터 수신 되는 적어도 하나의 이미지에 기초하여 사용자의 비-주시안의 피로도를 결정하고, 비-주시안의 피로도에 기초하 여 제2 시간 기간을 동적으로 조정할 수 있다. 스마트 글래스의 제어부는, 적어도 하나의 후면 카메라(232, 234)로부터 수신되는 적어도 하나의 이미지에 기초하여 사용자의 눈동자 움직임을 트래킹할 수 있다. 눈동자의 움직임에 따라, 제어부는 제1 디스플레이 및/또는 제2 디스플레이 상에 표시할 홀로그램 형상 등을 보정하거나 출력 위치를 보정할 수 있다. 이러한 구성에 의해, 보다 현실감 있는 증강 현실 경험을 제공할 수 있다. 일 실시예에 따르면, 제어부는 적어도 하나의 전면 카메라(222, 224)에 의해 촬영되는 적어도 하나의 이미지에 기초하여 제1 디스플레이 및/또는 제2 디스플레이 상에 표시할 홀로그램 등을 결정하도록 구성될 수 있다. 스마트 글래스는 좌측의 제1 마이크 및 우측의 제2 마이크를 포함할 수 있다. 마이크(242, 24 4)는 사용자의 음성 및 외부 소리를 인식하도록 구성된다. 일 실시예에 따르면, 마이크(242, 244)는 전면 카메 라(222, 224) 및 후면 카메라(232, 234)의 좌우에 장착될 수 있다. 이때, 마이크(242, 244)는 서로 다른 방향으 로 설치되는 것이 가능하다. 예를 들면, 어느 하나의 마이크(242, 244)는 전방을 향하고, 나머지는 후방을 향하 도록 설치될 수 있다. 서로 다른 방향으로 설치되는 마이크(242, 244)로 인하여 소리가 들리는 방향을 감지하도 록 할 수 있다. 마이크(242, 244)에서 수신된 신호는 제어부로 제공된다. 제어부는 마이크(242, 244)로부터 수 신되는 소리 또는 음성(음성 명령)에 기초하여 제1 디스플레이 또는 제2 디스플레이 중 적어도 하나 상에 표시할 영상을 결정할 수 있다. 프레임은 안경 모양을 가지도록 구성된다. 프레임은 두개의 다리가 구비되어 사용자가 착용할 수 있 도록 형성될 수 있다. 프레임의 다리에는 2개의 감지 센서(252, 254)가 각각의 다리에 1개씩 설치되어 사 용자의 스마트 글래스의 착용을 감지할 수 있다. 또한, 프레임의 전방에는 필요에 따라 스마트 글래 스를 보호하는 렌즈 또는 강화 유리가 장착될 수 있다. 투명 디스플레이(212, 214)는 보호 렌즈 또는 강화 유리 상에 또는 내에 배치될 수 있다. 추가적으로, 프레임의 양측에는 터치 센서가 설치되어, 사용자의 터치 입력에 의한 스마트 글래스 제어가 가능할 수 있다. 이러한 구성을 통해, 사용자는 음성 명 령, 제스처 명령, 눈 동자 명령, 눈 깜빡인 명령, 터치 입력 등을 포함한 다양한 입력 방식을 통해 스마트 글래 스를 제어할 수 있다. 예를 들어, 사용자는 터치 입력을 통해 영상 기록 시작/정지 등과 같은 다양한 제어 를 할 수 있다. IMU 센서는 제1 디스플레이와 제2 디스플레이 사이에 위치하며, 사용자의 동작을 감지하여 스마 트 글래스의 방향을 센싱할 수 있다. 제어부는 센싱된 스마트 글래스의 방향의 변화 정도를 기초로 영상의 송출을 제어할 수 있다. 변화 정도는 IMU 센서를 통해 센싱된 스마트 글래스의 변경 각에 따 라 결정될 수 있고, 예를 들어, 변화 정도는 스마트 글래스를 착용한 사용자 머리의 흔들림 정도, 움직임 속도 또는 상하좌우의 빠른 돌림 정도 등에 해당할 수 있다. 도 3은 본 발명의 일 실시예에 따른 인공신경망 모델을 나타내는 예시도이다. 인공신경망 모델은, 기 계학습 모델의 일 예로서, 기계 학습(machine learning) 기술과 인지과학에서, 생물학적 신경망의 구조에 기초 하여 구현된 통계학적 학습 알고리즘 또는 그 알고리즘을 실행하는 구조이다. 일 실시예에 따르면, 인공신경망 모델은, 생물학적 신경망에서와 같이 시냅스의 결합으로 네트워크를 형성 한 인공 뉴런인 노드(node)들이 시냅스의 가중치를 반복적으로 조정하여, 특정 입력에 대응한 올바른 출력과 추 론된 출력 사이의 오차가 감소되도록 학습함으로써, 문제 해결 능력을 가지는 기계학습 모델을 나타낼 수 있다. 예를 들어, 인공신경망 모델은 기계 학습, 딥러닝 등의 인공지능 학습법에 사용되는 임의의 확률 모델, 뉴 럴 네트워크 모델 등을 포함할 수 있다. 인공신경망 모델은 다층의 노드들과 이들 사이의 연결로 구성된 다층 퍼셉트론(multilayer perceptron, MLP)으로 구현된다. 본 실시예에 따른 인공신경망 모델은 MLP를 포함하는 다양한 인공신경망 모델 구조들 중의 하나를 이용하여 구현될 수 있다. 도 3에 도시된 바와 같이, 인공신경망 모델은, 외부로부터 입력 신 호 또는 데이터를 수신하는 입력층, 입력 데이터에 대응한 출력 신호 또는 데이터를 출력하는 출력층, 입력층과 출력층 사이에 위치하며 입력층으로부터 신호를 받아 특성을 추출하여 출력층으로 전달하는 n개(여기서, n은 양의 정수)의 은닉층(330_1 내지 330_n)으로 구성된다. 여기서, 출력층은 은닉층(330_1 내지 330_n)으로부터 신호를 받아 외부로 출력한다. 인공신경망 모델의 학습 방법에는, 교사 신호(정답)의 입력에 의해서 문제의 해결에 최적화되도록 학습하 는 지도 학습(Supervised Learning) 방법과, 교사 신호를 필요로 하지 않는 비지도 학습(Unsupervised Learning) 방법이 있다. 일 실시예에 따르면, 인공신경망 모델의 입력변수는, 차량의 전방을 촬영한 이미 지 데이터 및/또는 좌측 영역, 우측 영역의 이미지 데이터를 포함할 수 있다. 이와 같이 상술된 입력변수가 입 력층을 통해 입력되는 경우, 인공신경망 모델의 출력층에서 출력되는 출력변수는 차량 근방의 가드레일의 존재 유무 및 가드레일의 위치를 나타내는 데이터 등이 될 수 있다. 이와 같이, 인공신경망 모델의 입력층과 출력층에 복수의 입력변수와 대응되는 복수의 출력변수 가 각각 매칭되고, 입력층, 은닉층(330_1 내지 330_n) 및 출력층에 포함된 노드들 사이의 시냅스 값 이 조정됨으로써, 특정 입력에 대응한 올바른 출력이 추출될 수 있도록 학습될 수 있다. 이러한 학습 과정을 통 해, 인공신경망 모델의 입력변수에 숨겨져 있는 특성을 파악할 수 있고, 입력변수에 기초하여 계산된 출력 변수와 목표 출력 간의 오차가 줄어들도록 인공신경망 모델의 노드들 사이의 시냅스 값(또는 가중치)를 조 정할 수 있다. 도 4는 본 발명의 일 실시예에 따른 세포 분석 방법의 예시를 나타내는 도면이다. 세포 분석 방법은 적어도 하나의 프로세서(예: 컴퓨팅 장치의 적어도 하나의 프로세서)에 의해 수행될 수 있다. 프로세서는 제1 파장을 갖는 제1 광을 의심 부위에 포함된 제1 세포 영역에 조사하여 제1 스펙클 패턴을 획득할 수 있다(S410). 또한, 프로세서는 제2 파장을 갖는 제2 광을 제1 세포 영역에 조사하여 제2 스펙클 패턴을 획득 함으로써 개시될 수 있다(S420). 프로세서는 제1 스펙클 패턴 및 제2 스펙클 패턴을 기초로 제1 세포 영역을 정상 세포 영역 및 비정상 세포 영 역으로 구분할 수 있다(S430). 예를 들어, 프로세서는 이미지 분석을 위한 학습된 인공신경망 모델에 제1 스펙 클 패턴 및 제2 스펙클 패턴을 입력하여 기초로 제1 세포 영역을 정상 세포 영역 및 비정상 세포 영역으로 구분 할 수 있다. 추가적으로, 프로세서는 제1 광을 의심 부위에 포함된 제2 세포 영역에 조사하여 제3 스펙클 패턴을 획득하고, 제2 광을 제2 세포 영역에 조사하여 제4 스펙클 패턴을 획득할 수 있다. 또한, 프로세서는 제3 스펙클 패턴 및 제4 스펙클 패턴을 기초로 제2 세포 영역을 정상 세포 영역 및 비정상 세포 영역으로 구분할 수 있다. 이 경우, 프로세서는 정상 세포 영역 및 비정상 세포 영역이 구분된 제1 세포 영역 및 제2 세포 영역을 결합하여 의심 부 위 중 적어도 일부 영역에 대한 세포 분석을 수행할 수 있다. 일 실시예에 따르면, 프로세서는 의심 부위에서의 제1 세포 영역의 위치 좌표 값 및 제2 세포 영역의 위치 좌표 값을 이용하여 제1 세포 영역 및 제2 세포 영역을 결합할 수 있다. 이 경우, 프로세서는 위치 좌표 값과 함께 각 세포 영역의 각도를 고려할 수도 있다. 이와 같은 구성에 의해, 프로세서는 국소 부위 마다 세포 분석을 수 행한 후, 이를 결합하여 의심 부위 전체에 대한 세포 분석 결과를 획득할 수 있다. 프로세서는 세포 분석이 수행되는 경우, 의심 부위에 대한 과거 분석 이력을 검색하고, 검색 결과 의심 부위에 대한 과거 분석 이력이 존재하는 경우, 세포 분석의 수행 결과를 기초로 의심 부위에 대한 과거 분석 데이터를 업데이트할 수 있다. 즉, 환자마다 수술이 진행되는 등으로 정상 세포 영역 및 비정상 세포 영역이 변경되는 경 우에도 프로세서는 과거 분석 데이터를 통해 이를 추적 관찰할 수 있다. 일 실시예에 따르면, 프로세서는 세포 분석을 기초로 의심 부위 중 정상 세포 영역을 제1 색상으로 표시하고, 비정상 세포 영역을 제2 색상으로 표시한 세포 분석 데이터를 생성할 수 있다. 또한, 프로세서는 생성된 세포 분석 데이터를 스마트 글래스로 전송할 수 있다. 이 경우, 스마트 글래스를 착용한 사용자는 의심 부위를 응시 하는 것만으로 간단히 어떤 세포 영역이 비정상인지 여부를 확인할 수 있다. 도 5는 본 발명의 일 실시예에 따른 스마트 글래스 기반의 비정상 세포 식별 방법의 예시를 나타내는 도면 이다. 스마트 글래스 기반의 비정상 세포 식별 방법은 적어도 하나의 프로세서(예: 스마트 글래스의 적어 도 하나의 프로세서)에 의해 수행될 수 있다. 프로세서는 스마트 글래스를 착용한 사용자의 시선 방향 및 시야 범위를 포함하는 시야 데이터를 생성할 수 있 다(S510). 예를 들어, 프로세서는 적어도 하나의 전면 카메라 및 후면 카메라를 이용하여 사용자의 시선 방향을 결정하거나 사용자가 응시중인 시야 범위를 결정할 수 있다. 이 경우, 프로세서는 생성된 시야 데이터 및 세포 분석 데이터를 기초로 스마트 글래스의 디스플레이 상에 정상 세포 영역 및 비정상 세포 영역을 표시할 수 있다. 즉, 프로세서는 사용자가 실제 응시하고 있는 장면에 정상 세포 영역 및 비정상 세포 영역을 매칭하여 표시할 수 있다. 도 6은 본 발명의 일 실시예에 따른 컴퓨팅 장치의 내부 구성을 나타내는 블록도이다. 컴퓨팅 장치는 메모리, 프로세서, 통신 모듈 및 입출력 인터페이스를 포함할 수 있으며, 도 6에 도시된 바와 같이, 컴퓨팅 장치는 통신 모듈을 이용하여 네트워크를 통해 정보 및/또는 데이터를 통신할 수 있도록 구성될 수 있다. 메모리는 비-일시적인 임의의 컴퓨터 판독 가능한 기록매체를 포함할 수 있다. 일 실시예에 따르면, 메모 리는 RAM(random access memory), ROM(read only memory), 디스크 드라이브, SSD(solid state drive), 플래시 메모리(flash memory) 등과 같은 비소멸성 대용량 저장 장치(permanent mass storage device)를 포함할 수 있다. 다른 예로서, ROM, SSD, 플래시 메모리, 디스크 드라이브 등과 같은 비소멸성 대용량 저장 장치는 메 모리와는 구분되는 별도의 영구 저장 장치로서 컴퓨팅 장치에 포함될 수 있다. 또한, 메모리에는 운 영체제와 적어도 하나의 프로그램 코드가 저장될 수 있다. 이러한 소프트웨어 구성요소들은 메모리와는 별도의 컴퓨터에서 판독 가능한 기록매체로부터 로딩될 수 있 다. 이러한 별도의 컴퓨터에서 판독 가능한 기록매체는 이러한 컴퓨팅 장치에 직접 연결가능한 기록 매체 를 포함할 수 있는데, 예를 들어, 플로피 드라이브, 디스크, 테이프, DVD/CD-ROM 드라이브, 메모리 카드 등의 컴퓨터에서 판독 가능한 기록매체를 포함할 수 있다. 다른 예로서, 소프트웨어 구성요소들은 컴퓨터에서 판독 가능한 기록매체가 아닌 통신 모듈을 통해 메모리에 로딩될 수도 있다. 예를 들어, 적어도 하나의 프 로그램은 개발자들 또는 애플리케이션의 설치 파일을 배포하는 파일 배포 시스템이 통신 모듈을 통해 제공 하는 파일들에 의해 설치되는 컴퓨터 프로그램에 기반하여 메모리에 로딩될 수 있다. 프로세서는 기본적인 산술, 로직 및 입출력 연산을 수행함으로써, 컴퓨터 프로그램의 명령을 처리하도록 구성될 수 있다. 명령은 메모리 또는 통신 모듈에 의해 다른 사용자 단말(미도시) 또는 다른 외부 시 스템으로 제공될 수 있다. 통신 모듈은 네트워크를 통해 사용자 단말(미도시)과 컴퓨팅 장치가 서로 통신하기 위한 구성 또는 기능을 제공할 수 있으며, 컴퓨팅 장치가 외부 시스템(일례로 별도의 클라우드 시스템 등)과 통신하기 위 한 구성 또는 기능을 제공할 수 있다. 일례로, 컴퓨팅 장치의 프로세서의 제어에 따라 제공되는 제어 신호, 명령, 데이터 등이 통신 모듈과 네트워크를 거쳐 사용자 단말 및/또는 외부 시스템의 통신 모듈을 통해 사용자 단말 및/또는 외부 시스템으로 전송될 수 있다. 또한, 컴퓨팅 장치의 입출력 인터페이스는 컴퓨팅 장치와 연결되거나 컴퓨팅 장치가 포함 할 수 있는 입력 또는 출력을 위한 장치(미도시)와의 인터페이스를 위한 수단일 수 있다. 도 6에서는 입출력 인 터페이스가 프로세서와 별도로 구성된 요소로서 도시되었으나, 이에 한정되지 않으며, 입출력 인터페 이스가 프로세서에 포함되도록 구성될 수 있다. 컴퓨팅 장치는 도 6의 구성요소들보다 더 많은 구성요소들을 포함할 수 있다. 그러나, 대부분의 종래기술적 구성요소들을 명확하게 도시할 필요성은 없다. 컴퓨팅 장치의 프로세서는 복수의 사용자 단말 및/또는 복수의 외부 시스템으로부터 수신된 정보 및 /또는 데이터를 관리, 처리 및/또는 저장하도록 구성될 수 있다. 상술된 방법 및/또는 다양한 실시예들은, 디지털 전자 회로, 컴퓨터 하드웨어, 펌웨어, 소프트웨어 및/또는 이 들의 조합으로 실현될 수 있다. 본 발명의 다양한 실시예들은 데이터 처리 장치, 예를 들어, 프로그래밍 가능한 하나 이상의 프로세서 및/또는 하나 이상의 컴퓨팅 장치에 의해 실행되거나, 컴퓨터 판독 가능한 기록 매체 및/ 또는 컴퓨터 판독 가능한 기록 매체에 저장된 컴퓨터 프로그램으로 구현될 수 있다. 상술된 컴퓨터 프로그램은 컴파일된 언어 또는 해석된 언어를 포함하여 임의의 형태의 프로그래밍 언어로 작성될 수 있으며, 독립 실행형 프로그램, 모듈, 서브 루틴 등의 임의의 형태로 배포될 수 있다. 컴퓨터 프로그램은 하나의 컴퓨팅 장치, 동일 한 네트워크를 통해 연결된 복수의 컴퓨팅 장치 및/또는 복수의 상이한 네트워크를 통해 연결되도록 분산된 복 수의 컴퓨팅 장치를 통해 배포될 수 있다. 상술된 방법 및/또는 다양한 실시예들은, 입력 데이터를 기초로 동작하거나 출력 데이터를 생성함으로써, 임의 의 기능, 함수 등을 처리, 저장 및/또는 관리하는 하나 이상의 컴퓨터 프로그램을 실행하도록 구성된 하나 이상 의 프로세서에 의해 수행될 수 있다. 예를 들어, 본 발명의 방법 및/또는 다양한 실시예는 FPGA(Field Programmable Gate Array) 또는 ASIC(Application Specific Integrated Circuit)과 같은 특수 목적 논리 회로 에 의해 수행될 수 있으며, 본 발명의 방법 및/또는 실시예들을 수행하기 위한 장치 및/또는 시스템은 FPGA 또는 ASIC와 같은 특수 목적 논리 회로로서 구현될 수 있다. 컴퓨터 프로그램을 실행하는 하나 이상의 프로세서는, 범용 목적 또는 특수 목적의 마이크로 프로세서 및/또는 임의의 종류의 디지털 컴퓨팅 장치의 하나 이상의 프로세서를 포함할 수 있다. 프로세서는 읽기 전용 메모리, 랜덤 액세스 메모리의 각각으로부터 명령 및/또는 데이터를 수신하거나, 읽기 전용 메모리와 랜덤 액세스 메모 리로부터 명령 및/또는 데이터를 수신할 수 있다. 본 발명에서, 방법 및/또는 실시예들을 수행하는 컴퓨팅 장치 의 구성 요소들은 명령어들을 실행하기 위한 하나 이상의 프로세서, 명령어들 및/또는 데이터를 저장하기 위한 하나 이상의 메모리 디바이스를 포함할 수 있다. 일 실시예에 따르면, 컴퓨팅 장치는 데이터를 저장하기 위한 하나 이상의 대용량 저장 장치와 데이터를 주고받 을 수 있다. 예를 들어, 컴퓨팅 장치는 자기 디스크(magnetic disc) 또는 광 디스크(optical disc)로부터 데이 터를 수신하거나/수신하고, 자기 디스크 또는 광 디스크로 데이터를 전송할 수 있다. 컴퓨터 프로그램과 연관된 명령어들 및/또는 데이터를 저장하기에 적합한 컴퓨터 판독 가능한 저장 매체는, EPROM(Erasable Programmable Read-Only Memory), EEPROM(Electrically Erasable PROM), 플래시 메모리 장치 등의 반도체 메모리 장치를 포 함하는 임의의 형태의 비 휘발성 메모리를 포함할 수 있으나, 이에 한정되지 않는다. 예를 들어, 컴퓨터 판독 가능한 저장 매체는 내부 하드 디스크 또는 이동식 디스크와 같은 자기 디스크, 광 자기 디스크, CD-ROM 및 DVD-ROM 디스크를 포함할 수 있다. 사용자와의 상호 작용을 제공하기 위해, 컴퓨팅 장치는 정보를 사용자에게 제공하거나 디스플레이하기 위한 디 스플레이 장치(예를 들어, CRT (Cathode Ray Tube), LCD(Liquid Crystal Display) 등) 및 사용자가 컴퓨팅 장 치 상에 입력 및/또는 명령 등을 제공할 수 있는 포인팅 장치(예를 들어, 키보드, 마우스, 트랙볼 등)를 포함할 수 있으나, 이에 한정되지 않는다. 즉, 컴퓨팅 장치는 사용자와의 상호 작용을 제공하기 위한 임의의 다른 종류 의 장치들을 더 포함할 수 있다. 예를 들어, 컴퓨팅 장치는 사용자와의 상호 작용을 위해, 시각적 피드백, 청각 피드백 및/또는 촉각 피드백 등을 포함하는 임의의 형태의 감각 피드백을 사용자에게 제공할 수 있다. 이에 대 해, 사용자는 시각, 음성, 동작 등의 다양한 제스처를 통해 컴퓨팅 장치로 입력을 제공할 수 있다. 본 발명에서, 다양한 실시예들은 백엔드 구성 요소(예: 데이터 서버), 미들웨어 구성 요소(예: 애플리케이션 서 버) 및/또는 프론트 엔드 구성 요소를 포함하는 컴퓨팅 시스템에서 구현될 수 있다. 이 경우, 구성 요소들은 통 신 네트워크와 같은 디지털 데이터 통신의 임의의 형태 또는 매체에 의해 상호 연결될 수 있다. 예를 들어, 통 신 네트워크는 LAN(Local Area Network), WAN(Wide Area Network) 등을 포함할 수 있다. 본 명세서에서 기술된 예시적인 실시예들에 기반한 컴퓨팅 장치는, 사용자 디바이스, 사용자 인터페이스(UI) 디 바이스, 사용자 단말 또는 클라이언트 디바이스를 포함하여 사용자와 상호 작용하도록 구성된 하드웨어 및/또는 소프트웨어를 사용하여 구현될 수 있다. 예를 들어, 컴퓨팅 장치는 랩톱(laptop) 컴퓨터와 같은 휴대용 컴퓨팅 장치를 포함할 수 있다. 추가적으로 또는 대안적으로, 컴퓨팅 장치는, PDA(Personal Digital Assistants), 태 블릿 PC, 게임 콘솔(game console), 웨어러블 디바이스(wearable device), IoT(internet of things) 디바이스, VR(virtual reality) 디바이스, AR(augmented reality) 디바이스 등을 포함할 수 있으나, 이에 한정되지 않는 다. 컴퓨팅 장치는 사용자와 상호 작용하도록 구성된 다른 유형의 장치를 더 포함할 수 있다. 또한, 컴퓨팅 장 치는 이동 통신 네트워크 등의 네트워크를 통한 무선 통신에 적합한 휴대용 통신 디바이스(예를 들어, 이동 전 화, 스마트 전화, 무선 셀룰러 전화 등) 등을 포함할 수 있다. 컴퓨팅 장치는, 무선 주파수(RF; Radio Frequency), 마이크로파 주파수(MWF; Microwave Frequency) 및/또는 적외선 주파수(IRF; Infrared Ray Frequency)와 같은 무선 통신 기술들 및/또는 프로토콜들을 사용하여 네트워크 서버와 무선으로 통신하도록 구 성될 수 있다. 본 발명에서 특정 구조적 및 기능적 세부 사항을 포함하는 다양한 실시예들은 예시적인 것이다. 따라서, 본 발 명의 실시예들은 상술된 것으로 한정되지 않으며, 여러 가지 다른 형태로 구현될 수 있다. 또한, 본 발명에서 사용된 용어는 일부 실시예를 설명하기 위한 것이며 실시예를 제한하는 것으로 해석되지 않는다. 예를 들어, 단 수형 단어 및 상기는 문맥상 달리 명확하게 나타내지 않는 한 복수형도 포함하는 것으로 해석될 수 있다. 본 발명에서, 달리 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함하여 본 명세서에서 사용되는 모든 용 어는 이러한 개념이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의 미를 갖는다. 또한, 사전에 정의된 용어와 같이 일반적으로 사용되는 용어들은 관련 기술의 맥락에서의 의미와 일치하는 의미를 갖는 것으로 해석되어야 한다."}
{"patent_id": "10-2023-0042432", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "본 명세서에서는 본 발명이 일부 실시예들과 관련하여 설명되었지만, 본 발명의 발명이 속하는 기술분야의 통상 의 기술자가 이해할 수 있는 본 발명의 범위를 벗어나지 않는 범위에서 다양한 변형 및 변경이 이루어질 수 있 다. 또한, 그러한 변형 및 변경은 본 명세서에 첨부된 특허청구의 범위 내에 속하는 것으로 생각되어야 한다."}
{"patent_id": "10-2023-0042432", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 발명의 실시예들은, 이하 설명하는 첨부 도면들을 참조하여 설명될 것이며, 여기서 유사한 참조 번호는 유사 한 요소들을 나타내지만, 이에 한정되지는 않는다. 도 1은 본 발명의 일 실시예에 따른 LSP 모듈, 컴퓨팅 장치 및 스마트 글래스를 이용하여 세포 분석이 수행되는 예시를 나타내는 블록도이다.도 2는 본 발명의 일 실시예에 따른 스마트 글래스를 도시하는 평면도이다. 도 3은 본 발명의 일 실시예에 따른 인공신경망 모델을 나타내는 예시도이다. 도 4는 본 발명의 일 실시예에 따른 세포 분석 방법의 예시를 나타내는 도면이다. 도 5는 본 발명의 일 실시예에 따른 스마트 글래스 기반의 비정상 세포 식별 방법의 예시를 나타내는 도면이다. 도 6은 본 발명의 일 실시예에 따른 컴퓨팅 장치의 내부 구성을 나타내는 블록도이다."}
