{"patent_id": "10-2022-0059423", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0159971", "출원번호": "10-2022-0059423", "발명의 명칭": "심층신경망 기반 객체 탐지 장치, 시스템 및 방법", "출원인": "성균관대학교산학협력단", "발명자": "이주찬"}}
{"patent_id": "10-2022-0059423", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "엣지 디바이스로부터 수신된 단일 피처에 기초하여 영상의 객체를 탐지하는 클라우드를 포함하는 심층신경망 기반 객체 탐지 장치에 있어서,기 학습된 추출기 및 기 학습된 복원기의 정보를 저장하는 메모리; 및상기 메모리를 제어하는 프로세서를 포함하고,상기 프로세서는, 상기 엣지 디바이스의 추출기에 포함된 복수의 레이어 중에서 소정의 분할점에 해당하는 제1레이어에서 출력된 상기 영상에 관한 단일 피처를 수신하고,상기 단일 피처를 상기 제1 레이어 직후의 제2 레이어에 입력하여, 상기 추출기의 출력 피처를 획득하며, 상기출력 피처를 상기 복원기에 입력하여 상기 영상 속 객체를 탐지하는 것을 특징으로 하는 심층신경망 기반 객체탐지 장치."}
{"patent_id": "10-2022-0059423", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 추출기는,학습용 영상과 함께 상기 학습용 영상으로부터 탐지된 객체 정보를 입력받아 학습되고, 추론시에 영상을 입력받으면 단일 피처를 출력하도록 학습된 인공신경망인 것을 특징으로 하는 심층신경망 기반 객체 탐지 장치."}
{"patent_id": "10-2022-0059423", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 복원기는,학습용 영상과 함께 상기 학습용 영상으로부터 탐지된 객체 정보를 입력 받아 학습되고, 추론시에 상기 추출기로부터 제공되는 단일 피처를 입력받으면, 복수의 피처를 출력하도록 학습된 인공신경망인 것을 특징으로 하는심층신경망 기반 객체 탐지 장치."}
{"patent_id": "10-2022-0059423", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 복원기의 각 레이어는 상기 추출기의 소정의 중간 레이어 피처들을 복원하도록 상기 추출기의 각 레이어와역연산의 관계를 갖는 것을 특징으로 하는 심층신경망 기반 객체 탐지 장치."}
{"patent_id": "10-2022-0059423", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 추출기에 포함된 복수의 레이어 중에서 적어도 하나의 레이어의 채널의 개수는 상기 복원기에 포함된 복수의 레이어들 중에서 적어도 하나의 레이어에 대응되는 채널의 개수보다 적은 비대칭 구조인 것을 특징으로 하는심층신경망 기반 객체 탐지 장치."}
{"patent_id": "10-2022-0059423", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서,상기 추출기에 포함된 복수의 레이어의 개수는 상기 복원기에 포함된 복수의 레이어의 개수보다 적은 비대칭 구조인 것을 특징으로 하는 심층신경망 기반 객체 탐지 장치.공개특허 10-2023-0159971-3-청구항 7 취득된 영상을 처리한 단일 피처를 클라우드에 전송하는 엣지 디바이스를 포함하는 심층신경망 기반 객체 탐지장치에 있어서, 기 학습된 추출기에 대한 정보를 저장하는 메모리; 및상기 취득된 영상을 기 학습된 상기 추출기에 입력하되, 상기 추출기에 포함된 복수의 레이어 중에서 소정의 분할점에 해당하는 제1 레이어에서 상기 영상에 관한 상기 단일 피처를 추출하여 상기 클라우드로 전송하는 프로세서를 포함하는 것을 특징으로 하는 심층신경망 기반 객체 탐지 장치."}
{"patent_id": "10-2022-0059423", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서,상기 클라우드는,상기 엣지 디바이스의 추출기와 동일한 추출기 및 복원기를 포함하고,상기 엣지 디바이스로부터 상기 단일 피처를 수신하며, 상기 단일 피처를 상기 제1 레이어 직후의 제2 레이어에입력하여, 상기 추출기의 출력 피처를 획득하고, 상기 출력 피처를 상기 복원기에 입력하여 상기 영상 속 객체를 탐지하는 데에 이용되는 복수의 중간 피처를 획득하는 것을 특징으로 하는 심층신경망 기반 객체 탐지 장치."}
{"patent_id": "10-2022-0059423", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 7 항에 있어서,상기 엣지 디바이스는,상기 엣지 디바이스 및 상기 프로세서 간 네트워크 속도, 및 상기 엣지 디바이스 및 상기 프로세서의 성능 중적어도 하나를 분석하여, 분석 결과에 따라 상기 제1 레이어에 관한 상기 분할점의 위치를 결정하는 것을 특징으로 하는 심층신경망 기반 객체 탐지 장치."}
{"patent_id": "10-2022-0059423", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 8 항에 있어서,상기 복원기의 각 레이어는 상기 추출기의 소정의 중간 레이어 피처들을 복원하도록 상기 추출기의 각 레이어와역연산의 관계를 갖는 것을 특징으로 하는 심층신경망 기반 객체 탐지 장치."}
{"patent_id": "10-2022-0059423", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 8 항에 있어서,상기 추출기에 포함된 복수의 레이어 중에서 적어도 하나의 레이어의 채널의 개수는 상기 복원기에 포함된 복수의 레이어들 중에서 적어도 하나의 레이어에 대응되는 채널의 개수보다 적은 비대칭 구조인 것을 특징으로 하는심층신경망 기반 객체 탐지 장치."}
{"patent_id": "10-2022-0059423", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 8 항에 있어서,상기 추출기에 포함된 복수의 레이어의 개수는 상기 복원기에 포함된 복수의 레이어의 개수보다 적은 비대칭 구조인 것을 특징으로 하는 심층신경망 기반 객체 탐지 장치."}
{"patent_id": "10-2022-0059423", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "취득된 영상을 기 학습된 추출기에 입력하되, 상기 추출기에 포함된 복수의 레이어 중에서 소정의 분할점에 해당하는 제1 레이어에서 상기 영상에 관한 단일 피처를 추출하는 엣지 디바이스; 및상기 추출기와 동일한 추출기 및 복원기를 포함하고, 상기 엣지 디바이스에서 추출된 상기 단일 피처를 수신하고, 상기 단일 피처를 상기 제1 레이어 직후의 제2 레공개특허 10-2023-0159971-4-이어에 입력하여, 상기 추출기의 출력 피처를 획득하고, 상기 출력 피처를 상기 복원기에 입력하여 상기 영상속 객체를 탐지하는 데에 이용되는 복수의 중간 피처를 획득하는 클라우드;를 포함하는 것을 특징으로 하는 심층신경망 기반 객체 탐지 시스템."}
{"patent_id": "10-2022-0059423", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13 항에 있어서,상기 복원기의 각 레이어는 상기 추출기의 소정의 중간 레이어 피처들을 복원하도록 상기 추출기의 각 레이어와역연산의 관계를 갖는 것을 특징으로 하는 심층신경망 기반 객체 탐지 시스템."}
{"patent_id": "10-2022-0059423", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 13 항에 있어서,상기 추출기에 포함된 복수의 레이어 중에서 적어도 하나의 레이어의 채널의 개수는 상기 복원기에 포함된 복수의 레이어들 중에서 적어도 하나의 레이어에 대응되는 채널의 개수보다 적은 비대칭 구조인 것을 특징으로 하는심층신경망 기반 객체 탐지 시스템."}
{"patent_id": "10-2022-0059423", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "엣지 디바이스가 취득된 영상을 기 학습된 추출기에 입력시키는 단계;상기 엣지 디바이스가 상기 추출기에 포함된 복수의 레이어 중에서 소정의 분할점에 해당하는 제1 레이어에서상기 영상에 관한 단일 피처를 추출하는 단계;상기 엣지 디바이스가 추출된 상기 단일 피처를 클라우드로 전송하는 단계;상기 엣지 디바이스의 추출기와 동일한 추출기 및 복원기를 포함하는 클라우드가 상기 단일 피처를 상기 제1 레이어 직후의 제2 레이어에 입력하여, 상기 추출기의 출력 피처를 획득하는 단계; 및상기 클라우드가 상기 출력 피처를 상기 복원기에 입력하여 상기 영상 속 객체를 탐지하는 데에 이용되는 복수의 중간 피처를 획득하는 단계;를 포함하는 것을 특징으로 하는 심층신경망 기반 객체 탐지 방법."}
{"patent_id": "10-2022-0059423", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 16 항에 있어서,상기 엣지 디바이스가 상기 엣지 디바이스 및 상기 클라우드 간 네트워크 속도, 및 상기 엣지 디바이스 및 상기클라우드의 성능 중 적어도 하나를 분석하는 단계; 및상기 분석의 결과에 따라 상기 레이어에 대한 상기 분할점의 위치를 결정하는 단계를 더 포함하는 것을 특징으로 하는 심층신경망 기반 객체 탐지 방법."}
{"patent_id": "10-2022-0059423", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "엣지 디바이스가 취득된 영상을 기 학습된 추출기에 입력시키는 단계;상기 엣지 디바이스가 상기 추출기에 포함된 복수의 레이어 중에서 소정의 분할점에 해당하는 제1 레이어에서상기 영상에 관한 단일 피처를 추출하는 단계; 및상기 엣지 디바이스가 추출된 상기 단일 피처를 클라우드로 전송하는 단계;를 포함하는 것을 특징으로 하는 심층신경망 기반 객체 탐지 방법."}
{"patent_id": "10-2022-0059423", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 18 항에 있어서,상기 엣지 디바이스의 추출기와 동일한 추출기 및 복원기를 포함하는 클라우드가 상기 단일 피처를 상기 제1 레이어 직후의 제2 레이어에 입력하여, 상기 추출기의 출력 피처를 획득하는 단계; 및상기 클라우드가 상기 출력 피처를 상기 복원기에 입력하여 상기 영상 속 객체를 탐지하는 데에 이용되는 복수의 중간 피처를 획득하는 단계;를 포함하는 것을 특징으로 하는 심층신경망 기반 객체 탐지 방법.공개특허 10-2023-0159971-5-청구항 20 제 18 항에 있어서,상기 엣지 디바이스가 상기 엣지 디바이스 및 상기 클라우드 간 네트워크 속도, 및 상기 엣지 디바이스 및 상기클라우드의 성능 중 적어도 하나를 분석하는 단계; 및상기 분석의 결과에 따라 상기 레이어에 대한 상기 분할점의 위치를 결정하는 단계를 더 포함하는 것을 특징으로 하는 심층신경망 기반 객체 탐지 방법."}
{"patent_id": "10-2022-0059423", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 심층신경망 기반 객체 탐지 장치, 시스템 및 방법에 관한 것으로, 더욱 상세하게는 영상의 객체를 신 속하게 실시간으로 탐지할 수 있는 심층신경망 기반 객체 탐지 장치, 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2022-0059423", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 심층신경망 기반 객체 탐지 장치, 시스템 및 방법에 관한 것으로, 더욱 상세하게는 영상의 객체를 신 속하게 실시간으로 탐지할 수 있는 심층신경망 기반 객체 탐지 장치, 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2022-0059423", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 심층신경망(DNN)의 발전으로 컴퓨터 비전과 관련된 여러 과업에서 탁월한 성능이 구현되고 있다. 그러나 아직까지 리소스 제약으로 인해 에지 장치가 실시간으로 영상을 취득하고, 복잡한 심층신경망으로 DNN 모델의 실시간 추론을 수행하는 것에 어려움이 있다. 이러한 경우에 엣지 장치에서 취득된 영상을 고성능의 GPU가 탑재 된 클라우드에 전송하여 처리할 수 있다. 그러나 무선 네트워크를 이용해야 하는 엣지 장치의 특성상 영상 전송 시간이 많이 소요될 수 있다. 이러한 문제를 해결하기 위해서 엣지 장치에서 심층신경망의 일부분을 이용하고, 원래 영상보다 작은 피처를 클라우드에 전송하여 처리하는 엣지-클라우드 분할 추론 기법을 사용할 수 있다. 일반적으로 피처를 추출하는 레이어를 거듭할수록 피처의 크기가 작아지기 때문에 네트워크 별로 적절한 분할점 이 존재해야 한다. 하지만, 이미지 분류기와 달리, 일반적인 심층신경망 기반의 객체 탐지기는 크기가 다양한 객체들을 효과적으로 탐지하기 위해서 여러 레이어의 피처를 이용해야 한다. 즉, 피처를 추출하는 레이어의 마지막 피처만을 이용하여 객체 탐지를 수행하는 것이 아니라, 피처를 추출하는 복수의 레이어들 중 소정의 중간 피처들도 필요하다. 이러한 이유로 분할 추론 상황에서 전송량이 늘어나기 때문에, 일반적인 객체 탐지기의 레이어에서는 적절한 분 할점을 찾기 힘들다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허 제10-2021-0036226호 (특허문헌 0002) 대한민국 공개특허 제10-2021-0062346호"}
{"patent_id": "10-2022-0059423", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 본 발명은 상술한 바와 같은 문제점을 해결하기 위하여 제안된 것으로, 영상의 객체를 신속하게 실시간 으로 탐지할 수 있는 심층신경망 기반 객체 탐지 장치, 시스템 및 방법을 제공하는데 목적이 있다. 본 발명의 목적은 이상에서 언급한 것으로 제한되지 않으며, 언급되지 않은 또 다른 목적들은 아래의 기재로부 터 본 발명이 속하는 기술 분야의 통상의 지식을 가진 자에게 명확히 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0059423", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 목적을 달성하기 위한 본 발명의 실시예에 따른 엣지 디바이스로부터 수신된 단일 피처에 기초하여 영상의 객체를 탐지하는 클라우드를 포함하는 심층신경망 기반 객체 탐지 장치는, 기 학습된 추출기 및 기 학습 된 복원기의 정보를 저장하는 메모리; 및 상기 메모리를 제어하는 프로세서를 포함하고, 상기 프로세서는, 상기 엣지 디바이스의 추출기에 포함된 복수의 레이어 중에서 소정의 분할점에 해당하는 제1 레이어에서 출력된 상기 영상에 관한 단일 피처를 수신하고, 상기 단일 피처를 상기 제1 레이어 이후의 나머지 레이어에 입력하여, 상기 추출기의 출력 피처를 획득하며, 상기 출력 피처를 상기 복원기에 입력하여 상기 영상 속 객체를 탐지한다. 여기서, 상기 추출기는, 학습용 영상과 함께 상기 학습용 영상으로부터 탐지된 객체 정보를 입력받아 학습되고, 추론시에 영상을 입력받으면 단일 피처를 출력하도록 학습된 인공신경망이다. 여기서, 상기 복원기는, 학습용 영상과 함께 상기 학습용 영상으로부터 탐지된 객체 정보를 입력 받아 학습되고, 추론시에 상기 추출기로부터 제공되는 단일 피처를 입력받으면, 복수의 피처를 출력하도록 학습된 인 공신경망일 수 있다. 여기서, 상기 복원기의 각 레이어는 상기 추출기의 소정의 중간 레이어 피처들을 복원하도록 상기 추출기의 각 레이어와 역연산의 관계를 갖는다. 여기서, 상기 추출기에 포함된 복수의 레이어 중에서 적어도 하나의 레이어의 채널의 개수는 상기 복원기에 포 함된 복수의 레이어들 중에서 적어도 하나의 레이어에 대응되는 채널의 개수보다 적은 비대칭 구조이다. 여기서, 상기 추출기에 포함된 복수의 레이어의 개수는 상기 복원기에 포함된 복수의 레이어의 개수보다 적은 비대칭 구조이다. 본 발명의 다른 실시예에 다른 취득된 영상을 처리한 단일 피처를 클라우드에 전송하는 엣지 디바이스를 포함하 는 심층신경망 기반 객체 탐지 장치는, 기 학습된 추출기에 대한 정보를 저장하는 메모리; 및 상기 취득된 영상 을 기 학습된 상기 추출기에 입력하되, 상기 추출기에 포함된 복수의 레이어 중에서 소정의 분할점에 해당하는 제1 레이어에서 상기 영상에 관한 상기 단일 피처를 추출하여 상기 클라우드로 전송하는 프로세서를 포함한다. 여기서, 상기 클라우드는, 상기 엣지 디바이스의 추출기와 동일한 추출기를 포함하고, 상기 엣지 디바이스로부 터 상기 단일 피처를 수신하며, 상기 단일 피처를 상기 제1 레이어 직후의 제2 레이어에 입력하여, 상기 추출기 의 출력 피처를 획득하고, 상기 출력 피처를 상기 복원기에 입력하여 상기 영상 속 객체를 탐지하는 데에 이용 되는 복수의 중간 피처를 획득한다. 여기서, 상기 엣지 디바이스는, 상기 엣지 디바이스 및 상기 프로세서 간 네트워크 속도, 및 상기 엣지 디바이 스 및 상기 프로세서의 성능 중 적어도 하나를 분석하여, 분석 결과에 따라 상기 제1 레이어에 관한 상기 분할 점의 위치를 결정한다. 여기서, 상기 복원기의 각 레이어는 상기 추출기의 소정의 중간 레이어 피처들을 복원하도록 상기 추출기의 각 레이어와 역연산의 관계를 갖는다. 여기서, 상기 추출기에 포함된 복수의 레이어 중에서 적어도 하나의 레이어의 채널의 개수는 상기 복원기에 포 함된 복수의 레이어들 중에서 적어도 하나의 레이어에 대응되는 채널의 개수보다 적은 비대칭 구조이다. 여기서, 상기 추출기에 포함된 복수의 레이어의 개수는 상기 복원기에 포함된 복수의 레이어의 개수보다 적은 비대칭 구조이다. 본 발명의 다른 실시예에 따른 심층신경망 기반 객체 탐지 시스템은 취득된 영상을 기 학습된 추출기에 입력하 되, 상기 추출기에 포함된 복수의 레이어 중에서 소정의 분할점에 해당하는 제1 레이어에서 상기 영상에 관한 단일 피처를 추출하는 엣지 디바이스; 및 상기 추출기와 동일한 추출기 및 복원기를 포함하고, 상기 엣지 디바 이스에서 추출된 상기 단일 피처를 수신하고, 상기 단일 피처를 상기 제1 레이어 직후의 제2 레이어에 입력하여, 상기 추출기의 출력 피처를 획득하고, 상기 출력 피처를 상기 복원기에 입력하여 상기 영상 속 객체 를 탐지하는 데에 이용되는 복수의 중간 피처를 획득하는 클라우드;를 포함한다. 여기서, 상기 복원기의 각 레이어는 상기 추출기의 소정의 중간 레이어 피처들을 복원하도록 상기 추출기의 각 레이어와 역연산의 관계를 갖는다. 여기서, 상기 추출기에 포함된 복수의 레이어 중에서 적어도 하나의 레이어의 채널의 개수는 상기 복원기에 포 함된 복수의 레이어들 중에서 적어도 하나의 레이어에 대응되는 채널의 개수보다 적은 비대칭 구조이다. 여기서, 상기 추출기에 포함된 복수의 레이어의 개수는 상기 복원기에 포함된 복수의 레이어의 개수와는 다른 비대칭 구조이다. 본 발명의 다른 실시예에 따른 심층신경망 기반 객체 탐지 방법은 엣지 디바이스가 취득된 영상을 기 학습된 추 출기에 입력시키는 단계; 상기 엣지 디바이스가 상기 추출기에 포함된 복수의 레이어 중에서 소정의 분할점에 해당하는 제1 레이어에서 상기 영상에 관한 단일 피처를 추출하는 단계; 상기 엣지 디바이스가 추출된 상기 단 일 피처를 클라우드로 전송하는 단계; 상기 엣지 디바이스의 추출기와 동일한 추출기 및 복원기를 포함하는 클 라우드가 상기 단일 피처를 상기 제1 레이어 직후의 제2 레이어에 입력하여, 상기 추출기의 출력 피처를 획득하 는 단계; 및 상기 클라우드가 상기 출력 피처를 상기 복원기에 입력하여 상기 영상 속 객체를 탐지하는 데에 이 용되는 복수의 중간 피처를 획득하는 단계;를 포함한다. 여기서, 상기 엣지 디바이스가 상기 엣지 디바이스 및 상기 클라우드 간 네트워크 속도, 및 상기 엣지 디바이스 및 상기 클라우드의 성능 중 적어도 하나를 분석하는 단계; 및 상기 분석의 결과에 따라 상기 레이어에 대한 상 기 분할점의 위치를 결정하는 단계를 더 포함한다. 여기서, 엣지 디바이스가 취득된 영상을 기 학습된 추출기에 입력시키는 단계; 상기 엣지 디바이스가 상기 추출 기에 포함된 복수의 레이어 중에서 소정의 분할점에 해당하는 제1 레이어에서 상기 영상에 관한 단일 피처를 추 출하는 단계; 및 상기 엣지 디바이스가 추출된 상기 단일 피처를 클라우드로 전송하는 단계;를 포함한다. 여기서, 상기 엣지 디바이스의 추출기와 동일한 추출기 및 복원기를 포함하는 클라우드가 상기 단일 피처를 상 기 제1 레이어 직후의 제2 레이어에 입력하여, 상기 추출기의 출력 피처를 획득하는 단계; 및 상기 클라우드가 상기 출력 피처를 상기 복원기에 입력하여 상기 영상 속 객체를 탐지하는 데에 이용되는 복수의 중간 피처를 획 득하는 단계;를 포함한다. 여기서, 상기 엣지 디바이스가 상기 엣지 디바이스 및 상기 클라우드 간 네트워크 속도, 및 상기 엣지 디바이스 및 상기 클라우드의 성능 중 적어도 하나를 분석하는 단계; 및 상기 분석의 결과에 따라 상기 레이어에 대한 상 기 분할점의 위치를 결정하는 단계를 더 포함한다."}
{"patent_id": "10-2022-0059423", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따른 심층신경망 기반 객체 탐지 장치, 시스템 및 방법에 의하면, 영상의 객체를 신속하게 실시간으로 탐지 할 수 있다."}
{"patent_id": "10-2022-0059423", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과는 이상에서 언급한 것으로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재로부 터 본 발명이 속하는 기술 분야의 통상의 지식을 가진 자에게 명확히 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0059423", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 목적 및 효과, 그리고 그것들을 달성하기 위한 기술적 구성들은 첨부되는 도면과 함께 상세하게 뒤에 설명이 되는 실시 예들을 참조하면 명확해질 것이다. 본 발명을 설명함에 있어서 공지 기능 또는 구성에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명을 생략할 것 이다. 그리고 뒤에 설명되는 용어들은 본 발명에서의 구조, 역할 및 기능 등을 고려하여 정의된 용어들로서 이 는 사용자, 운용자의 의도 또는 관례 등에 따라 달라질 수 있다. 그러나 본 발명은 이하에서 개시되는 실시 예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있"}
{"patent_id": "10-2022-0059423", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "다. 단지 본 실시 예들은 본 발명의 개시가 완전하도록 하고, 본 발명이 속하는 기술분야에서 통상의 지식을 가 진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 오로지 특허청구범위에 기재된 청구항의 범주에 의하여 정의될 뿐이다. 그러므로 그 정의는 본 명세서 전반에 걸친 내용을 토대로 내려져야 할것이다. 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다 른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 이하에서는 첨부한 도면을 참조하며, 본 발명의 바람직한 실시예들을 보다 상세하게 설명하기로 한다. 도 1은 본 발명의 일 실시예에 따른 심층신경망 기반 객체 탐지 시스템의 구성을 도시하는 블록도이고, 도 2는 본 발명의 일 실시예에 따른 엣지 디바이스와 클라우드의 구동을 설명하기 위한 개념도이다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 심층신경망 기반 객체 탐지 시스템은 엣지 컴퓨팅을 실행하는 적어도 하나 이상의 엣지 디바이스와, 엣지 디바이스로부터 데이터를 받아 클라우드 컴퓨팅을 실행하 고 엣지로 실행 결과를 전달하는 클라우드(Cloud, 200)를 포함한다. 예를 들어, 엣지 디바이스는 스마트 디바이스, 드론, 웨어러블 디바이스에 해당할 수 있으며, 이에 한정하 지 않는다. 엣지 디바이스는 영상을 취득하는 카메라, 기 학습된 추출기에 관한 정보를 저장하는 메모리 및 엣지 디바 이스의 구성들을 제어하는 프로세서를 포함할 수 있다. 엣지 디바이스는 기본적으로 데이터를 수집할 수 있고, 데이터를 정제할 수 있으며, 데이터를 샘플링, 클 리닝, 결합 등의 전처리를 수행하고, 그 결과를 클라우드로 전송할 수 있다. 엣지 디바이스의 기능을 다양하게 설계할 수 있는데, 예를 들어, 클라우드로 보내지 않고도 자체적으 로 데이터를 처리하도록 설계할 수도 있으나, 본 발명에서는 데이터 처리를 엣지 디바이스가 클라우드 와 분할하여 처리하는 실시예 위주로 설명한다. 일 실시예로, 엣지 디바이스는 카메라를 통해 취아이득된 영상을 기 학습된 추출기에 입력하여, 추출 기에 포함된 복수의 레이어를 통해 단일 피처를 추출할 수 있다. 여기서, 추출기는 학습용 영상과 함께 상기 학습용 영상으로부터 탐지된 객체 정보를 입력받아 학습되고, 추론 시에 영상을 입력받으면 단일 피처를 출력하도록 학습된 인공신경망일 수 있다. 여기서, 추출기는 오토 인코더 (auto encoder)의 인코더에 해당할 수 있다. 특히, 엣지 디바이스는 취득된 영상을 기 학습된 추출기에 입력하되, 추출기에 포함된 복수의 레이어 중에서 소정의 분할점에 해당하는 제1 레이어의 출력으로 상기 영상에 관한 단일 피처를 추출하여 클라 우드로 전송할 수 있다. 여기서, 복수의 레이어에 대한 소정의 분할점의 위치를 결정하기 위해서, 엣지 디바이스는 엣지 디바이스 및 클라우드 간 네트워크 속도, 및 엣지 디바이스 및 클라우드의 성능 중 적어도 하나를 분석할 수 있고, 분석 결과에 따라 분할점의 위치를 결정할 수 있다. 상기 분할점에 해당하는 레이어를 제1 레 이어로 명명할 수 있다. 클라우드는 엣지 디바이스로부터 수신된 태스크(task)를 종합적으로 수행하거나 특정 엣지 디바이스 에 타스크를 일부 분배하는 등의 핵심 처리를 수행할 수 있다. 클라우드에서 처리된 결과는 엣지 디바이스로 전달될 수 있다. 일 실시예로, 클라우드는 엣지 디바이스로부터 수신된 단일 피처에 기초하여 영상의 객체를 탐지할 수 있다. 이를 위해, 클라우드는 기 학습된 추출기 및 기 학습된 복원기의 정보를 저장하는 메모리 및 클 라우드의 구성들을 제어하는 프로세서를 포함할 수 있다. 클라우드는 엣지 디바이스로부터 수신된 단일 피처를 추출기의 복수의 레이어 중 제1 레이어 직 후의 제2 레이어에 입력하여, 추출기의 출력 피처를 획득할 수 있다. 이어서, 프로세서는 추출기 의 출력 피처를 복원기에 입력하여, 복원기로부터 객체 탐지에 필요한 소정의 복수의 중간 피처 를 획득할 수 있다. 여기서, 추출기는 학습용 영상과 함께 상기 학습용 영상으로부터 탐지된 객체 정보를 입력 받으면, 출력 피처를 출력하도록 기 학습된 인공 신경망일 수 있다. 클라우드에 포함된 추출기는 엣지 디바이스에 포함된 추출기와 동일하다. 복원기는 학습용 영상과 함께 상기 학습용 영상으로부터 탐지된 객체 정보를 입력 받으면, 복원 피처를 출 력하도록 기 학습된 인공신경망일 수 있다. 복원기는 오토 인코더의 디코더에 해당할 수 있다. 복원기를 구성하는 각 레이어는 추출기의 소정의 중간 레이어 피처들을 복원하도록 추출기의 레 이어와 역연산의 관계를 갖도록 설계된다. 일 실시예로, 추출기의 마지막 레이어가 분할점으로 결정되면, 가장 고레벨의 피처가 클라우드로 전 송되어 복원기를 통과하게 된다. 반대로, 추출기의 앞쪽 레이어에서 분할되면, 엣지 디바이스는 해당 레이어까지 진행된 저레벨의 피처를 클라우드로 전송하게 된다. 클라우드에서는 전송받은 피처 를 추출기의 분할점 직후의 레이어에 입력시켜 고레벨의 출력 피처를 획득하여, 획득된 출력 피처를 복원 기에 통과시킨다. 클라우드는 출력 피처를 복원기에 입력하여 얻는 여러 레벨의 중간 피처를 이후 객체 탐지에 사용하 게 된다. 따라서, 본 발명에 의하면 엣지 디바이스에서 클라우드로 단일 피처를 전송하더라도 중간 피처들을 획득할 수 있기 때문에 정상적인 객체 탐지가 가능하다. 한편, 각 레이어에서 출력되는 피처의 크기가 레이어에 따라 다를 수 있고, 따라서, 클라우드는 수신하는 단일 피처의 크기를 이용하여, 추출기에 포함된 복수의 레이어들 중에서 상기 단일 피처를 입력할 제2 레 이어를 결정할 수 있다. 도 3은 종래 기술과 본 발명의 일 실시예 간의 차이점을 설명하기 위한 도면이다. 도 3을 참조하면, 종래 기술로서, (a)는 엣지 디바이스는 추출기를 포함하지 않고, 클라우드가 추출기를 포함하 는 경우로, 엣지 디바이스는 취득된 영상을 클라우드로 전송하고, 클라우드는 영상을 추출기에 입력시켜, 추출 기로부터 객체 탐지에 이용될 소정의 복수의 중간 피처들을 획득한다. 즉, 엣지 디바이스는 영상을 취득하는 기 능만 하고, 클라우드가 인공지능 모델을 기반으로 영상의 객체를 탐지한다. 이 경우, 엣지 디바이스에서 클라우 드로 영상을 전송하면서, 영상 전송 시간이 많이 소요되는 문제가 있을 수 있다. (b)는 엣지 디바이스만 추출기를 포함하는 경우로서, 엣지 디바이스의 추출기에서 소정의 복수의 중간 피처들을 추출하여 추출된 중간 피처들을 클라우드로 전송하면, 클라우드에서 복수의 중간 피처들을 기반으로 영상 속 객 체를 탐지한다. 이 경우, 엣지 디바이스의 성능의 한계에 부딪히는 문제와, 영상 전송 시간의 문제가 해결되지 않는 단점이 있다. (c)는 엣지 디바이스와 클라우드가 동일한 추출기를 포함하는 경우로서, 엣지 디바이스의 추출기의 복수의 레이 어 중 어느 중간 레이어에서 단일 피처를 추출하여 클라우드로 전송하면, 클라우드의 추출기에서 상기 중간 레 이어 직후에 대응하는 레이어에 상기 단일 피처를 입력시킴으로써, 소정의 복수의 중간 피처들을 획득하고, 복 수의 중간 피처들을 기반으로 영상 속 객체를 탐지한다. 이 경우, 복수의 피처들 중 가장 앞쪽의 피처가 얻어지 기 전에 분할 레이어가 한정되기 때문에 지연시간 이득이 제한된다. 이들 종래기술과 대조적으로 도 2에 도시된 본 발명의 일 실시예에 따른 심층신경망 기반 객체 탐지 시스템 은 엣지 디바이스가 추출기를 포함하고, 클라우드가 추출기와 복원기를 포함한다."}
{"patent_id": "10-2022-0059423", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "요약하여 다시 설명하자면, 엣지 디바이스가 엣지 디바이스 및 프로세서 간 네트워크 속도, 및 엣지 디바이스 및 프로세서의 성능 중 적어도 하나를 분석하고, 분석 결과에 따라 분할점의 위치를 결정하면, 분할점에 해당하는 제1 레이어에서 출력된 단일 피처를 클라우드로 전송한다. 클라우드 는 엣지 디바이스로부터 전송된 단일 피처가 출력된 제1 레이어 직후에 해당하는 추출기의 레이어에 단일 피처를 입력시켜 고레벨의 피처를 획득할 수 있다. 이어, 획득된 피처를 복원기에 입력 하여, 복원기로부터 객체 탐지에 필요한 소정의 복수의 중간 피처를 획득할 수 있다. 여기서, 복원기(22 0)를 구성하는 각 레이어는 추출기의 소정의 중간 레이어에 대응하는 중간 피처들을 복원하도록 추출기의 레이어와 역연산의 관계를 갖는다. 도 4는 본 발명의 다른 실시예에 따른 심층 신경망 기반 객체 탐지 시스템을 설명하기 위한 개념도이다. 도 1 및 도 2를 참조하여 설명한 심층신경망 기반 객체 탐지 시스템은 클라우드의 복원기를 통해 엣지 클라우드의 전송량을 줄일 수 있지만, 무선 네트워크 상황에서는 여전히 전송시간이 해결되지 않는 문제가 있다. 또한 리소스가 제한되는 엣지 디바이스에서는 추출기를 실행시키는 데에 상당한 지연시 간이 발생하는 문제도 있을 수 있다. 이러한 문제들을 해결하기 위해서, 도 4에 도시된 본 발명의 다른 실시예에 따른 심층신경망 기반 객체 탐지 시 스템은 추출기(111, 211)의 각 레이어에 포함된 채널의 수는 도 2에 도시된 추출기의 각 레이어에 포 함된 채널의 수보다 적을 수 있다. 하지만, 단순히 추출기(111, 211)의 채널의 수를 축소하면, 객체 탐지 정확도가 손실되기 때문에 이를 보완하기 위해서 복원기의 스케일은 늘리는 비대칭 스케일링을 적용한다. 일 실시예로, 추출기(111, 211)에 포함된 복수의 레이어 중에서 적어도 하나의 레이어의 채널의 개수는 복원기 에 포함된 복수의 레이어들 중에서 상기 적어도 하나의 레이어에 대응되는 적어도 하나의 레이어의 채널의 개수보다 적은 비대칭 구조일 수 있다. 또한, 일 실시예로, 추출기(111, 211)에 포함된 복수의 레이어들의 개수는 복원기에 포함된 복수의 레이어 들의 개수와는 다른 비대칭 구조일 수 있다. 이때, 추출기(111, 211)에 포함된 복수의 레이어들의 개수는 복원 기에 포함된 복수의 레이어들의 개수보다 적은 비대칭 구조일 수 있다. 이는 추출기는 성능이 보다 떨어지는 엣지 디바이스에서 실행되는 반면, 복원기는 성능이 보다 좋은 클라우드에서 실행되기 때문이다. 즉, 추출기는 엣지 디바이스에서 실행되기 때문에, 수행 시간이 길며(즉, 지연 시간이 길며), 따라서, 추출기에 포함된 레이어들의 개수가 복원기에 포함된 레이어들의 개수보다 작음으로써, 지연 시간을 감소시킬 수 있다. 뿐만 아니라, 추출기에 포함된 복수의 레이어 중에서 적어도 하나의 레이어의 채널의 개수가 복원기에 포함된 복수의 레이어 중에서 상기 적어도 하나의 레이어에 대응되는 적어도 하나 의 레이어의 채널의 개수보다 작음으로써, 지연 시간을 감소시킬 수 있을 뿐만 아니라, 엣지 디바이스에서 클라우드로 전송하는 데이터의 전송량을 줄일 수 있다. 한편, 추출기(111, 211)에 포함되는 복수의 레이어들의 개수, 및/또는 추출기(111, 211)에 포함되는 복수의 레 이어들 중에서 적어도 하나의 레이어에 포함된 채널의 개수를 줄이면, 성능의 열화(즉, 객체 탐지 정확도가 감 소)가 발생할 수 있다. 따라서, 도 4에 도시된 바와 같이, 복원기에 포함되는 복수의 레이어들의 개수, 및/또는 복원기에 포 함되는 복수의 레이어들 중에서 적어도 하나의 레이어에 포함된 채널의 개수를 늘임으로써, 상기 성능의 열화를 방지할 수 있다. 도 5는 본 발명의 일 실시예에 따른 심층신경망 기반 객체 탐지 방법을 설명하기 위한 순서도이다. 본 실시예에 따른 심층신경망 기반 객체 탐지 방법은, 도 1의 시스템과 실질적으로 동일한 구성에서 진행될 수 있다. 따라서, 도 1의 시스템와 동일한 구성요소는 동일한 도면부호를 부여하고, 반복되는 설명은 생략한 다. 도 5를 참조하면, 본 발명의 일 실시예에 따른 심층신경망 기반 객체 탐지 방법은 먼저, 엣지 디바이스가 취득 된 영상을 기 학습된 추출기에 입력시킨다(S110). 다음으로, 엣지 디바이스가 상기 추출기에 포함된 복수의 레이어 중에서 소정의 분할점에 해당하는 제1 레이어 의 출력으로 상기 영상에 관한 단일 피처를 추출한다(S120). 다음으로, 엣지 디바이스가 추출된 상기 단일 피처를 클라우드로 전송한다(S130). 다음으로, 엣지 디바이스의 추출기와 동일한 추출기 및 복원기를 포함하는 클라우드가 상기 단일 피처를 상기 제1 레이어 직후에 해당하는 제2 레이어에 입력하여, 상기 추출기의 출력 피처를 획득한다(S140). 다음으로, 클라우드가 상기 출력 피처를 상기 복원기에 입력하여 상기 영상 속 객체를 탐지하는 데에 이용하기 위한 복수의 중간 피처를 획득한다(S150). 다음으로, 클라우드가 복수의 중간 피처를 기반으로 영상 속의 객체를 탐지할 수 있다(S160). 전술한 심층신경망 기반 객체 탐지 시스템은, 프로세서, 메모리, 사용자 입력장치, 프레젠테이션 장치 중 적어 도 일부를 포함하는 컴퓨팅 장치에 의해 구현될 수 있다. 메모리는, 프로세서에 의해 실행되면 특정 태스크를 수행할 수 있도록 코딩되어 있는 컴퓨터-판독가능 소프트웨어, 애플리케이션, 프로그램 모듈, 루틴, 인스트럭션 (instructions), 및/또는 데이터 등을 저장하는 매체이다. 프로세서는 메모리에 저장되어 있는 컴퓨터-판독가능 소프트웨어, 애플리케이션, 프로그램 모듈, 루틴, 인스트럭션, 및/또는 데이터 등을 판독하여 실행할 수 있다. 컴퓨팅 장치는 스마트폰, 태블릿, 랩탑, 데스크탑, 서버, 클라이언트 등의 다양한 장치를 포함할 수 있다. 컴퓨 팅 장치는 하나의 단일한 스탠드-얼론 장치일 수도 있고, 통신망을 통해 서로 협력하는 다수의 컴퓨팅 장치들로 이루어진 분산형 환경에서 동작하는 다수의 컴퓨팅 장치를 포함할 수 있다. 또한 전술한 심층신경망 기반 객체 탐지 방법은, 프로세서를 구비하고, 또한 프로세서에 의해 실행되면 인공지 능 모델을 활용한 객체 탐지 방법을 수행할 수 있도록 코딩된 컴퓨터 판독가능 소프트웨어, 애플리케이션, 프로 그램 모듈, 루틴, 인스트럭션, 및/또는 데이터 구조 등을 저장한 메모리를 구비하는 컴퓨팅 장치에 의해 실행될 수 있다. 상술한 본 실시예들은 다양한 수단을 통해 구현될 수 있다. 예를 들어, 본 실시예들은 하드웨어, 펌웨어 (firmware), 소프트웨어 또는 그것들의 결합 등에 의해 구현될 수 있다. 하드웨어에 의한 구현의 경우, 본 실시예들에 따른 인공지능 모델을 활용한 영상 진단 방법은 하나 또는 그 이 상의 ASICs(Application Specific Integrated Circuits), DSPs(Digital Signal Processors), DSPDs(Digital Signal Processing Devices), PLDs(Programmable Logic Devices), FPGAs(Field Programmable Gate Arrays), 프로세서, 컨트롤러, 마이크로 컨트롤러 또는 마이크로 프로세서 등에 의해 구현될 수 있다. 예를 들어, 실시예들에 따른 객체 탐지 방법은 심층 신경망의 뉴런(neuron)과 시냅스(synapse)가 반도체 소자들 로 구현된 인공지능 반도체 장치를 이용하여 구현될 수 있다. 이때 반도체 소자는 현재 사용하는 반도체 소자들, 예를 들어 SRAM이나 DRAM, NAND 등일 수도 있고, 차세대 반도체 소자들, RRAM이나 STT MRAM, PRAM 등 일 수도 있고, 이들의 조합일 수도 있다. 실시예들에 따른 객체 탐지 방법을 인공지능 반도체 장치를 이용하여 구현할 때, 오토 인코더를 소프트웨어로 학습한 결과(가중치)를 어레이로 배치된 시냅스 모방소자에 전사하거나 인공지능 반도체 장치에서 학습을 진행 할 수도 있다. 펌웨어나 소프트웨어에 의한 구현의 경우, 본 실시예들에 따른 객체 탐지 방법은 이상에서 설명된 기능 또는 동 작들을 수행하는 장치, 절차 또는 함수 등의 형태로 구현될 수 있다. 소프트웨어 코드는 메모리 유닛에 저장되 어 프로세서에 의해 구동될 수 있다. 메모리 유닛은 상기 프로세서 내부 또는 외부에 위치하여, 이미 공지된 다 양한 수단에 의해 프로세서와 데이터를 주고 받을 수 있다. 또한, 위에서 설명한 \"시스템\", \"프로세서\", \"컨트롤러\", \"컴포넌트\", \"모듈\", \"인터페이스\", \"모델\", 또는 \"유 닛\" 등의 용어는 일반적으로 컴퓨터 관련 엔티티 하드웨어, 하드웨어와 소프트웨어의 조합, 소프트웨어 또는 실 행 중인 소프트웨어를 의미할 수 있다. 예를 들어, 전술한 구성요소는 프로세서에 의해서 구동되는 프로세스, 프로세서, 컨트롤러, 제어 프로세서, 개체, 실행 스레드, 프로그램 및/또는 컴퓨터일 수 있지만 이에 국한되지 않는다. 예를 들어, 컨트롤러 또는 프로세서에서 실행 중인 애플리케이션과 컨트롤러 또는 프로세서가 모두 구 성 요소가 될 수 있다. 하나 이상의 구성 요소가 프로세스 및/또는 실행 스레드 내에 있을 수 있으며, 구성 요 소들은 하나의 장치(예: 시스템, 컴퓨팅 디바이스 등)에 위치하거나 둘 이상의 장치에 분산되어 위치할 수 있다. 한편, 또 다른 실시예는 전술한 객체 탐지 방법을 수행하는, 컴퓨터 기록매체에 저장되는 컴퓨터 프로그램을 제 공한다. 또한 또 다른 실시예는 전술한 객체 탐지 방법을 실현시키기 위한 프로그램을 기록한 컴퓨터로 읽을 수 있는 기록매체를 제공한다. 기록매체에 기록된 프로그램은 컴퓨터에서 읽히어 설치되고 실행됨으로써 전술한 단계들을 실행할 수 있다. 이 와 같이, 컴퓨터가 기록매체에 기록된 프로그램을 읽어 들여 프로그램으로 구현된 기능들을 실행시키기 위하여, 전술한 프로그램은 컴퓨터의 프로세서(CPU)가 컴퓨터의 장치 인터페이스(Interface)를 통해 읽힐 수 있는 C,C++, Python, JAVA, 기계어 등의 컴퓨터 언어로 코드화된 코드(Code)를 포함할 수 있다. 이러한 코드는 전술한 기능들을 정의한 함수 등과 관련된 기능적인 코드를 포함할 수 있고, 전술한 기능들을 컴 퓨터의 프로세서가 소정의 절차대로 실행시키는데 필요한 실행 절차 관련 제어 코드를 포함할 수도 있다. 또한, 이러한 코드는 전술한 기능들을 컴퓨터의 프로세서가 실행시키는데 필요한 추가 정보나 미디어가 컴퓨터 의 내부 또는 외부 메모리의 어느 위치(주소 번지)에서 참조 되어야 하는지에 대한 메모리 참조 관련 코드를 더 포함할 수 있다. 또한, 컴퓨터의 프로세서가 전술한 기능들을 실행시키기 위하여 원격(Remote)에 있는 어떠한 다른 컴퓨터나 서 버 등과 통신이 필요한 경우, 코드는 컴퓨터의 프로세서가 컴퓨터의 통신 모듈을 이용하여 원격(Remote)에 있는 어떠한 다른 컴퓨터나 서버 등과 어떻게 통신해야만 하는지, 통신 시 어떠한 정보나 미디어를 송수신해야 하는 지 등에 대한 통신 관련 코드를 더 포함할 수도 있다. 이상에서 전술한 바와 같은 프로그램을 기록한 컴퓨터로 읽힐 수 있는 기록매체는, 일 예로, ROM, RAM, CD-ROM, 자기 테이프, 플로피디스크, 광 미디어 저장장치 등이 있다. 또한 컴퓨터가 읽을 수 있는 기록매체는 네트워크로 연결된 컴퓨터 시스템에 분산되어, 분산방식으로 컴퓨터가 읽을 수 있는 코드가 저장되고 실행될 수 있다. 그리고, 본 발명을 구현하기 위한 기능적인(Functional) 프로그램과 이와 관련된 코드 및 코드 세그먼트 등은,"}
{"patent_id": "10-2022-0059423", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "기록매체를 읽어서 프로그램을 실행시키는 컴퓨터의 시스템 환경 등을 고려하여, 본 발명이 속하는 기술분야의 프로그래머들에 의해 용이하게 추론되거나 변경될 수도 있다. 도 5를 통해 설명된 객체 탐지 방법은, 컴퓨터에 의해 실행되는 애플리케이션이나 프로그램 모듈과 같은 컴퓨터 에 의해 실행 가능한 명령어를 포함하는 기록 매체의 형태로도 구현될 수 있다. 컴퓨터 판독 가능 매체는 컴퓨 터에 의해 액세스될 수 있는 임의의 가용 매체일 수 있고, 휘발성 및 비휘발성 매체, 분리형 및 비분리형 매체 를 모두 포함한다. 또한, 컴퓨터 판독가능 매체는 컴퓨터 저장 매체를 모두 포함할 수 있다. 컴퓨터 저장 매체 는 컴퓨터 판독가능 명령어, 데이터 구조, 프로그램 모듈 또는 기타 데이터와 같은 정보의 저장을 위한 임의의 방법 또는 기술로 구현된 휘발성 및 비휘발성, 분리형 및 비분리형 매체를 모두 포함한다. 전술한 객체 탐지 방법은, 단말기에 기본적으로 설치된 애플리케이션(이는 단말기에 기본적으로 탑재된 플랫폼 이나 운영체제 등에 포함된 프로그램을 포함할 수 있다)에 의해 실행될 수 있고, 사용자가 애플리케이션 스토어 서버, 애플리케이션 또는 해당 서비스와 관련된 웹 서버 등의 애플리케이션 제공 서버를 통해 마스터 단말기에 직접 설치한 애플리케이션(즉, 프로그램)에 의해 실행될 수도 있다. 이러한 의미에서, 전술한 객체 탐지 방법은 단말기에 기본적으로 설치되거나 사용자에 의해 직접 설치된 애플리케이션(즉, 프로그램)으로 구현되고 단말기 에 등의 컴퓨터로 읽을 수 있는 기록매체에 기록될 수 있다. 이상, 본 발명의 특정 실시예에 대하여 상술하였다. 그러나, 본 발명의 사상 및 범위는 이러한 특정 실시예에 한정되는 것이 아니라, 본 발명의 요지를 변경하지 않는 범위 내에서 다양하게 수정 및 변형이 가능하다는 것을 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자라면 이해할 것이다."}
{"patent_id": "10-2022-0059423", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "따라서, 이상에서 기술한 실시예들은 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이므로, 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 하 며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 도면 도면1 도면2 도면3 도면4 도면5"}
{"patent_id": "10-2022-0059423", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 심층신경망 기반 객체 탐지 시스템의 구성을 도시하는 블록도이다. 도 2는 본 발명의 일 실시예에 따른 엣지 디바이스와 클라우드의 개념도이다. 도 3은 종래 기술과 본 발명의 일 실시예 간의 차이점을 설명하기 위한 도면이다. 도 4는 본 발명의 다른 실시예에 따른 심층 신경망 기반 객체 탐지 시스템을 설명하기 위한 개념도이다. 도 5는 본 발명의 일 실시예에 따른 심층신경망 기반 객체 탐지 방법을 설명하기 위한 순서도이다."}
