{"patent_id": "10-2023-0139514", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0055847", "출원번호": "10-2023-0139514", "발명의 명칭": "질병 분석을 위한 조직병리 이미지 전처리 시스템 및 방법", "출원인": "서울대학교병원", "발명자": "이세준"}}
{"patent_id": "10-2023-0139514", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "질병 분석을 위한 조직병리 이미지 전처리 시스템에 있어서, 슬라이드에 부착되어 염색된 생체조직의 슬라이드 이미지를 획득하는 이미지 획득부;질병 분석을 보조하기 위하여 상기 슬라이드 이미지를 전처리하는 이미지 전처리부로서, 상기 이미지 전처리부는: 상기 슬라이드 이미지로부터 배경을 분리하여 조직이미지를 추출하는 이미지 분할부;상기 조직이미지의 해상도, 크기 및 조직 포함 정도를 기초로 상기 조직이미지를 잘라 복수의 패치를 생성하는이미지 틸팅부; 및 상기 복수의 패치 간의 색상을 정규화하는 이미지 색상 보정부; 를 포함하는, 조직병리 이미지 전처리 시스템."}
{"patent_id": "10-2023-0139514", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 인공지능 신경망을 이용하여 전처리된 상기 조직이미지로부터 특정 유전변이 유무, 암 유무, 생존율 예측 및 약물효과 예측 중 적어도 하나 이상을 포함하는 질병 분석 정보를 제공하는 질병 분석부; 를 더 포함하는, 조직병리 이미지 전처리 시스템."}
{"patent_id": "10-2023-0139514", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 이미지 분할부는 상기 슬라이드 이미지로부터 RGB 데이터를 추출한 후, 오츠(Otsu) 이진화 알고리즘을 적용하여 최적의 임계값을 찾은 후, 상기 임계값 설정을 통해 바이너리 이미지기반으로 조직이미지를 추출하는 것을 특징으로 하는, 조직병리 이미지 전처리 시스템."}
{"patent_id": "10-2023-0139514", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 이미지 분할부는 Unet 딥러닝 기반의 모델을 이용해 조직이미지를 추출하는 것을 특징으로 하는, 조직병리이미지 전처리 시스템."}
{"patent_id": "10-2023-0139514", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 이미지 색상 보정부는 H&E(Hematoxyling and Eosin) 레퍼런스 이미지를 기초로 Macenko, Reinhard,Vagadana, 딥러닝 기반 StainGAN 중 적어도 하나를 이용하여 복수의 패치 간의 색상을 정규화하는 것을 특징으로 하는, 조직병리 이미지 전처리 시스템. 공개특허 10-2025-0055847-3-청구항 6 제2항에 있어서,상기 이미지 전처리부는, 인공지능 신경망의 학습에 필요한 데이터의 확보를 위하여 데이터 증강(Data Augmentation)을 수행하는 데이터증강 처리부를 더 포함하고, 상기 증강 처리부는 리사이즈(Resize), 수평 플리핑(Horizontal flipping), 수직 플리핑(Vertical flipping),크롭 변환(Crop transformation), 딥러닝 기반의 GAN 기법 중 적어도 하나 이상을 이용하는 것을 특징으로하는, 조직병리 이미지 전처리 시스템."}
{"patent_id": "10-2023-0139514", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 이미지 전처리부는 상기 슬라이드 이미지를 패쓰프로파일러(PathProfiler) 알고리즘을 이용하여 이미지 품질 점수(quality score)를 제공하는 슬라이드 이미지 품질 평가부를 더 포함하고, 상기 슬라이드 이미지 품질평가부는, 질병 진단을 위한 이미지의 후속 분석 가능 정도, 이미지 염색 정도 및 이미지 화질 정도의 점수 중 적어도 하나 이상을 포함하는 품질 점수를 제공하는 것을 특징으로 하는, 조직병리 이미지 전처리 시스템."}
{"patent_id": "10-2023-0139514", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 이미지 전처리부는 상기 복수의 패치를 스크리닝한 후, 질병 진단을 위하여 적합한지 여부를 평가하는 패치 품질 평가부를 더 포함하고, 상기 패치 품질 평가부는, 파일크기 분포 컷오프(cut-off), 캐니(Canny)를 이용하여 엣지(edge)를 검출하여 이미지 포함 범위 컷오프, 이미지 내 색상 간 표준편차 분포 컷오프, 미리 설정된 기준에 따라 수동(manual) 제거 중 적어도 하나 이상을수행하는 것을 특징으로 하는, 조직병리 이미지 전처리 시스템."}
{"patent_id": "10-2023-0139514", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 이미지 전처리부는, 상기 이미지 틸팅부에 의하여 생성된 복수의 패치의 수, 패치 품질 평가부에 의해 제거된 패치의 수 및 최종 생성된 패치의 수 중 적어도 하나 이상에 대한 결과를 제공하는 결과 요약부를 더 포함하는 것을 특징으로 하는,조직병리 이미지 전처리 시스템."}
{"patent_id": "10-2023-0139514", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 이미지 분할부, 이미지 틸팅부, 이미지 색상 보정부, 증강 처리부, 슬라이드 이미지 품질 평가부 및 패치품질 평가부가 수행하는 각각의 전처리 진행 과정에 대한 정보를 사용자에게 제공하는 사용자 인터페이스 제공부를 더 포함하는, 조직병리 이미지 전처리 시스템. 공개특허 10-2025-0055847-4-청구항 11 프로세서에 의하여 수행되는 질병 분석을 위한 조직병리 이미지 전처리 방법에 있어서, 슬라이드에 부착되어 염색된 생체조직의 슬라이드 이미지를 획득하는 단계;질병 분석을 보조하기 위하여 상기 슬라이드 이미지를 전처리하는 단계로서, 상기 전처리하는 단계는: 상기 슬라이드 이미지를 패쓰프로파일러(PathProfiler) 알고리즘을 이용하여 이미지 품질 점수(quality score)를 제공하는 슬라이드 이미지 품질 평가 단계; 상기 슬라이드 이미지로부터 배경을 분리하여 조직이미지를 추출하는 단계;상기 조직이미지의 해상도, 크기 및 조직 포함 정도를 기초로 상기 조직이미지를 잘라 복수의 패치를 생성하는단계; 및 상기 복수의 패치 간의 색을 정규화하는 단계; 를 포함하는, 조직병리 이미지 전처리 방법."}
{"patent_id": "10-2023-0139514", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 인공지능 신경망을 이용하여 전처리된 상기 조직이미지로부터 특정 유전변이 유무, 암 유무, 생존율 예측 및 약물효과 예측 중 적어도 하나 이상을 포함하는 질병 분석 정보를 제공하는 단계; 를 더 포함하는, 조직병리 이미지 전처리 방법."}
{"patent_id": "10-2023-0139514", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 전처리하는 단계는, 인공지능 신경망의 학습에 필요한 데이터의 확보를 위하여 데이터 증강(Data Augmentation)을 수행하는 데이터증강 처리 단계; 를 더 포함하고, 상기 증강 처리 단계는 리사이즈(Resize), 수평 플리핑(Horizontal flipping), 수직 플리핑(Verticalflipping), 크롭 변환(Crop transformation), 딥러닝 기반의 GAN 기법 중 적어도 하나 이상을 이용하는 것을특징으로 하는, 조직병리 이미지 전처리 방법."}
{"patent_id": "10-2023-0139514", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서, 상기 전처리하는 단계는 상기 복수의 패치를 스크리닝한 후, 질병 진단을 위하여 적합한지 여부를 평가하는 패치 품질 평가 단계를 더 포함하고, 상기 패치 품질 평가 단계는, 파일크기 분포 컷오프(cut-off), 캐니(Canny)를 이용하여 엣지(edge)를 검출하여 이미지 포함 범위 컷오프, 이미지 내 색상 간 표준편차 분포 컷오프, 미리 설정된 기준에 따라 수동(manual) 제거 중 적어도 하나 이상을 수행하는 것을 특징으로 하는, 조직병리 이미지 전처리 방법."}
{"patent_id": "10-2023-0139514", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "공개특허 10-2025-0055847-5-제14항에 있어서,상기 전처리하는 단계는, 생성된 복수의 패치의 수, 상기 품질 평가 단계에 의해 제거된 패치의 수 및 최종 생성된 패치의 수 중 적어도하나 이상에 대한 결과를 제공하는 결과 요약 단계를 더 포함하는 것을 특징으로 하는, 조직병리 이미지 전처리방법."}
{"patent_id": "10-2023-0139514", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "컴퓨터에 의해 판독 가능하고, 상기 컴퓨터에 의해 동작 가능한 프로그램 명령어를 저장하는 컴퓨터 판독가능한기록매체로서, 상기 프로그램 명령어가 상기 컴퓨터의 프로세서에 의해 실행되는 경우 상기 프로세서가 제11항내지 제15항 중 어느 하나의 항에 따른 조직병리 이미지 전처리 방법을 수행하게 하는 컴퓨터 판독가능 기록매체."}
{"patent_id": "10-2023-0139514", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "실시예들은 질병 분석을 위한 조직병리 이미지 전처리 시스템에 있어서, 슬라이드에 부착되어 염색된 생체조직의 슬라이드 이미지를 획득하는 이미지 획득부; 질병 분석을 보조하기 위하여 상기 슬라이드 이미지를 전처리하는 이미지 전처리부로서, 상기 이미지 전처리부는: 상기 슬라이드 이미지로부터 배경을 분리하여 조직이미지를 추출 하는 이미지 분할부; 상기 조직이미지의 해상도, 크기 및 조직 포함 정도를 기초로 상기 조직이미지를 잘라 복수 의 패치를 생성하는 이미지 틸팅부; 및 상기 복수의 패치 간의 색상을 정규화하는 이미지 색상 보정부; 를 포함 한다."}
{"patent_id": "10-2023-0139514", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 명세서는 질병 분석을 위한 조직병리 이미지 전처리 시스템 및 방법에 관한 것으로서, 보다 상세하게는 딥러 닝 알고리즘을 활용하여 암조직 병리이미지의 특정 유전변이 확인, 암 유무 확인, 생존율 예측, 약물효과 예측 등의 분석에 정확한 진단 및 결과도출을 위하여 데이터를 보정, 추출 등 전처리 하는 GUI(Graphic User Interface) 기반의 조직병리 이미지 전처리 시스템 및 방법을 제공한다."}
{"patent_id": "10-2023-0139514", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "암의 분자적 아형 중 하나인 MSI(microsatellite instability)는 고형암의 종류에 상관없이 면역 항암제 치료 효과가 뛰어나다고 알려져 있다. 최근 암 환자의 조직 슬라이드를 스캔하여, 디지털로 변환된 이미지를 이용하 여 MSI 유형의 암 진단에 도움을 주는 딥러닝 기반의 소프트웨어 개발이 활발한 실정이다. 정확도 높은 암 진단 을 위해서는 이미지의 전처리 과정이 무엇보다 중요하다. 연구 목적뿐만 아니라 의료 현장에서 진단 알고리즘을 사용하기 위해서는 이미지 전처리 과정을 거쳐야 하며, 이미지 전처리 단계에서 연구자 또는 의료진이 직접 이 미지를 확인해야 하는 번거로움이 있다. 또한, 종래의 GUI 형식의 tool 관련 문헌은 최적의 파라미터 값이 제공 되지 않아, 모든 방법들을 시도할 수밖에 없는 비효율적인 구성으로 되어 있는 문제점이 있었다."}
{"patent_id": "10-2023-0139514", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상기의 문제점을 해결하기 위하여 본 출원은 사용자 편의성을 위해 GUI 형식의 자동 이미지 전처리 시스템을 제 공한다. 구체적으로, 다양한 슬라이드 파일 포맷 형태의 대용량 조직 병리 이미지 뷰어, 슬라이드 내 조직 이미 지 추출하는 다양한 방법 제시 및 결과 뷰어, 슬라이드를 작은 이미지(patch)로 분리하는 다양한 방법 제시 및 결과 뷰어, 작은 이미지들 간의 색상을 정규화하는 다양한 방법 제시 및 결과 뷰어, 데이터 증강을 위한 다양한 방법 제시 및 결과 뷰어, 이물질, 낮은 해상도, 펜 마커 등의 최종 진단에 영향을 주는 작은 이미지 제거 및 결 과 뷰어, 슬라이드 내 tissue type (암조직, 정상조직) 선별 및 결과 뷰어, 진단 알고리즘에 최적화된 이미지 전처리 과정 및 파라미터 값을 제공하여, 다량의 이미지를 빠른 속도 처리 가능하다."}
{"patent_id": "10-2023-0139514", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 출원의 일 실시예에 따른 질병 분석을 위한 조직병리 이미지 전처리 시스템은 슬라이드에 부착되어 염색된 생체조직의 슬라이드 이미지를 획득하는 이미지 획득부; 질병 분석을 보조하기 위하여 상기 슬라이드 이미지를 전처리하는 이미지 전처리부로서, 상기 이미지 전처리부는: 상기 슬라이드 이미지로부터 배경을 분리하여 조직 이미지를 추출하는 이미지 분할부; 상기 조직이미지의 해상도, 크기 및 조직 포함 정도를 기초로 상기 조직이미 지를 잘라 복수의 패치를 생성하는 이미지 틸팅부; 및 상기 복수의 패치들 간의 색상을 정규화하는 이미지 색상 보정부; 를 포함할 수 있다. 일 실시예에서, 상기 시스템은 인공지능 신경망을 이용하여 전처리된 상기 조직이미지로부터 특정 유전변이 유 무, 암 유무, 생존율 예측 및 약물효과 예측 중 적어도 하나 이상을 포함하는 질병 분석 정보를 제공하는 질병 분석부; 를 더 포함할 수 있다. 일 실시예에서, 상기 이미지 분할부는 상기 슬라이드 이미지로부터 RGB 데이터를 추출한 후, 오츠(Otsu) 이진화 알고리즘을 적용하여 최적의 임계값을 찾은 후, 상기 임계값 설정을 통해 바이너리 이미지 기반으로 조직이미지 를 추출할 수 있다. 일 실시예에서, 상기 이미지 분할부는 Unet 딥러닝 기반의 모델을 이용해 조직이미지를 추출할 수 있다. 일 실시예에서, 상기 이미지 색상 보정부는 H&E(Hematoxyling and Eosin) 레퍼런스 이미지를 기초로 Macenko, Reinhard, Vagadana, 딥러닝 기반 StainGAN 중 적어도 하나를 이용하여 복수의 패치들 간의 색상을 정규화할 수 있다. 일 실시예에서, 상기 이미지 전처리부는, 인공지능 신경망의 학습에 필요한 데이터의 확보를 위하여 데이터 증 강(Data Augmentation)을 수행하는 데이터 증강 처리부를 더 포함하고, 상기 증강 처리부는 리사이즈(Resize), 수평 플리핑(Horizontal flipping), 수직 플리핑(Vertical flipping), 크롭 변환(Crop transformation), 딥러 닝 기반의 GAN 기법 중 적어도 하나 이상을 이용할 수 있다. 일 실시예에서, 상기 이미지 전처리부는 상기 슬라이드 이미지를 패쓰프로파일러(PathProfiler) 알고리즘을 이 용하여 이미지 품질 점수(quality score)를 제공하는 슬라이드 이미지 품질 평가부를 더 포함하고, 상기 슬라이 드 이미지 품질 평가부는, 질병 진단을 위한 이미지의 후속 분석 가능 정도, 이미지 염색 정도 및 이미지 화질 정도의 점수 중 적어도 하나 이상을 포함하는 품질 점수를 제공할 수 있다. 일 실시예에서, 상기 이미지 전처리부는 상기 복수의 패치를 스크리닝한 후, 질병 진단을 위하여 적합한지 여부 를 평가하는 패치 품질 평가부를 더 포함하고, 상기 패치 품질 평가부는, 파일크기 분포 컷오프(cut-off), 캐니 (Canny)를 이용하여 엣지(edge)를 검출하여 이미지 포함 범위 컷오프, 이미지 내 색상 간 표준편차 분포 컷오프, 미리 설정된 기준에 따라 수동(manual) 제거 중 적어도 하나 이상을 수행할 수 있다. 일 실시예에서, 상기 이미지 전처리부는, 상기 이미지 틸팅부에 의하여 생성된 복수의 패치의 수, 패치 품질 평 가부에 의해 제거된 패치의 수 및 최종 생성된 패치의 수 중 적어도 하나 이상에 대한 결과를 제공하는 결과 요 약부를 더 포함할 수 있다. 일 실시예에서, 상기 시스템은 상기 이미지 분할부, 이미지 틸팅부, 이미지 색상 보정부, 증강 처리부, 슬라이"}
{"patent_id": "10-2023-0139514", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "드 이미지 품질 평가부, 패치 품질 평가부 및 결과 요약부가 수행하는 각각의 전처리 진행 과정에 대한 정보를 사용자에게 제공하는 사용자 인터페이스 제공부를 더 포함하는, 조직병리 이미지 전처리 시스템. 본 출원의 또 다른 일 실시예에 따른 프로세서에 의하여 수행되는 질병 분석을 위한 조직병리 이미지 전처리 방 법은 슬라이드에 부착되어 염색된 생체조직의 슬라이드 이미지를 획득하는 단계; 질병 분석을 보조하기 위하여 상기 슬라이드 이미지를 전처리하는 단계로서, 상기 전처리하는 단계는: 상기 슬라이드 이미지를 패쓰프로파일 러(PathProfiler) 알고리즘을 이용하여 이미지 품질 점수(quality score)를 제공하는 슬라이드 이미지 품질 평 가 단계; 상기 슬라이드 이미지로부터 배경을 분리하여 조직이미지를 추출하는 단계; 상기 조직이미지의 해상도, 크기 및 조직 포함 정도를 기초로 상기 조직이미지를 잘라 복수의 패치를 생성하는 단계; 및 상기 복수 의 패치들 간의 색을 정규화하는 단계; 를 포함할 수 있다. 일 실시예에서, 상기 방법은 인공지능 신경망을 이용하여 전처리된 상기 조직이미지로부터 특정 유전변이 유무, 암 유무, 생존율 예측 및 약물효과 예측 중 적어도 하나 이상을 포함하는 질병 분석 정보를 제공하는 단계; 를 더 포함할 수 있다. 일 실시예에서, 상기 전처리하는 단계는, 인공지능 신경망의 학습에 필요한 데이터의 확보를 위하여 데이터 증 강(Data Augmentation)을 수행하는 데이터 증강 처리 단계; 를 더 포함하고, 상기 증강 처리 단계는 리사이즈 (Resize), 수평 플리핑(Horizontal flipping), 수직 플리핑(Vertical flipping), 크롭 변환(Crop transformation), 딥러닝 기반의 GAN 기법 중 적어도 하나 이상을 이용할 수 있다. 일 실시예에서, 상기 전처리하는 단계는 상기 복수의 패치를 스크리닝한 후, 질병 진단을 위하여 적합한지 여부 를 평가하는 패치 품질 평가 단계를 더 포함하고, 상기 패치 품질 평가 단계는, 파일크기 분포 컷오프(cut- off), 캐니(Canny)를 이용하여 엣지(edge)를 검출하여 이미지 포함 범위 컷오프, 이미지 내 색상 간 표준편차분포 컷오프, 미리 설정된 기준에 따라 수동(manual) 제거 중 적어도 하나 이상을 수행할 수 있다. 일 실시예에서, 상기 전처리하는 단계는, 생성된 복수의 패치의 수, 상기 품질 평가 단계에 의해 제거된 패치의"}
{"patent_id": "10-2023-0139514", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 3, "content": "수 및 최종 생성된 패치의 수 중 적어도 하나 이상에 대한 결과를 제공하는 결과 요약 단계를 더 포함할 수 있 다. 본 출원의 또 다른 일 실시예에 따른 컴퓨터에 의해 판독 가능하고, 상기 컴퓨터에 의해 동작 가능한 프로그램 명령어를 저장하는 컴퓨터 판독가능한 기록매체는, 상기 프로그램 명령어가 상기 컴퓨터의 프로세서에 의해 실 행되는 경우 상기 프로세서가 질병 분석을 위한 조직병리 이미지 전처리 방법을 수행하게 한다."}
{"patent_id": "10-2023-0139514", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "일 측면에서, 본 출원의 실시예들에 따르면, 딥러닝 알고리즘을 활용하여 암조직 병리이미지의 특정 유전변이 확인, 암 유무 확인, 생존율 예측, 약물효과 예측 등의 분석에 정확한 진단 및 결과도출을 위하여 데이터를 보 정, 추출하는 전처리 용도로 활용 가능하다. 또한, 본 발명에 의하면 사용자 편의성을 위해 GUI 형식의 자동 이미지 전처리 시스템을 제공할 수 있고, 최적 의 파라미터 값을 제공하여 효율적이고 정확한 암 진단을 보조하여 다량의 이미지를 빠른 속도로 처리 가능하다. 각 전처리 과정의 단계별로 진행 과정을 뷰어함으로써 전처리 단계의 진행 과정이 한눈에 파악 가능 하고 필요에 따라 단계별 추가 수정이 가능하다. 본 출원의 효과들은 이상에서 언급한 효과들로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 청구범위의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0139514", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 출원의 일부 실시예들을 예시적인 도면을 참조하여 상세하게 설명한다. 각 도면의 구성 요소들에 참조 부호를 부가함에 있어서, 동일한 구성 요소들에 대해서는 비록 다른 도면상에 표시되더라도 가능한 한 동일한 부호를 가질 수 있다. 또한, 본 실시예들을 설명함에 있어, 관련된 공지 구성 또는 기능에 대한 구체적인 설명 이 본 기술 사상의 요지를 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명은 생략할 수 있다. 본 명세서 상에서 언급된 \"포함한다\", \"갖는다\", \"이루어진다\" 등이 사용되는 경우 \"~만\"이 사용되지 않는 이상 다른 부분이 추가될 수 있다. 구성 요소를 단수로 표현한 경우에 특별한 명시적인 기재 사항이 없는 한 복수를 포함하는 경우를 포함할 수 있다. 또한, 본 출원의 구성 요소를 설명하는 데 있어서, 제1, 제2, A, B, (a), (b) 등의 용어를 사용할 수 있다. 달 리 명시하지 않는 한, 이러한 용어는 그 구성 요소를 다른 구성 요소와 구별하기 위한 것일 뿐, 그 용어에 의해 해당 구성 요소의 본질, 차례, 순서 또는 개수 등이 한정되지 않는다. 본 명세서에서 '학습' 혹은 '러닝'은 절차에 따른 컴퓨팅(computing)을 통하여 기계 학습(machine learning)을 수행함을 지칭하는 용어이다. 본 명세서에서 \"부(unit)\", \"모듈(module)\"\"장치\", 또는 \"시스템\" 등의 용어는 하드웨어뿐만 아니라 해당 하드 웨어에 의해 구동되는 소프트웨어의 조합을 지칭할 수 있는 것으로 의도된다. 예를 들어, 하드웨어는 CPU(Central Processing Unit), GPU(Graphic Processing Unit) 또는 다른 프로세서(processor)를 포함하는 데 이터 처리 기기일 수 있다. 또한, 소프트웨어는 실행중인 프로세스, 객체(object), 실행파일(executable), 실행 스레드(thread of execution), 프로그램(program) 등을 지칭할 수 있다. 도 1은, 본 출원의 일 실시예에 따른, 질병 분석을 위한 조직병리 이미지 전처리 시스템의 구성을 나타내는 개 략도이다. 도 1을 참조하면, 질병 분석을 위한 조직병리 이미지 전처리 시스템(이하, \"이미지 전처리 시스템\")은 이미 지 획득부, 이미지 전처리부, 질병 분석부 및 사용자 인터페이스 제공부를 포함할 수 있다. 이미지 획득부는 슬라이드에 부착되어 염색된 생체조직의 슬라이드 이미지를 획득한다. 상기 이미지 획득 부는 데이터베이스(미도시)·촬영 장치(미도시)와 연결되어 상호작용할 수 있다. 상기 데이터베이스는 암 의 유무 및 진행 정도에 따라 각기 다른 세포 영역의 형상 데이터가 저장된다. 이러한 데이터베이스는 소프트웨 어적으로 생성되고 관리될 수 있다. 이미지 획득부가 획득하는 생체조직의 슬라이드 이미지는 핵 영역의 이미지일 수 있고, 세포질 영역일 수도 있으며, 핵 영역과 세포질 영역을 포함하는 세포 전체 영역일 수도 있다. 상기 촬영장치는 피검사자로부터 채취한 생체조직을 촬영한다. 이러한 촬영장치는 현미경을 포함할 수 있 다. 일 실시예에서, 이미지 획득부는 조직 단위를 파라핀 또는 냉동 포매한 암조직을 슬라이드에 부착 후 H&E(Hematoxyling and Eosin) 염색한 이미지에서 배경으로부터 조직영역만을 추출한 이미지를 획득할 수 있다. 상기 이미지의 형식은 *.svs, *.tiff, *.dcm, *png, *jpg 등 다양한 형식을 포함할 수 있다. 이미지 전처리부는 질병 분석을 보조하기 위하여 상기 슬라이드 이미지를 전처리한다. 이미지 전처리부 는 딥러닝 알고리즘을 활용하여 암조직 병리이미지의 특정 유전변이 확인, 암 유무 확인, 생존율 예측, 약 물효과 예측 등의 분석에 정확한 진단 및 결과도출을 위하여 이미지를 보정, 추출하는 기능을 한다. 상기 이미 지 전처리부의 각 구성에 대한 세부적인 설명은 도 2를 참조하여 상세히 설명한다. 질병 분석부는 전처리부에 의하여 전처리된 조직이미지로부터 인공지능 신경망을 이용하여 특정 유전 변이 유무, 암 유무, 생존율 예측 및 약물효과 예측 중 적어도 하나 이상을 포함하는 질병 분석 정보를 제공한 다. 사용자 인터페이스 제공부는 상기 전처리부가 수행하는 각각의 전처리 진행 과정에 대한 정보를 사용 자에게 제공할 수 있다. 상기 사용자 인터페이스 제공부는 디스플레이를 포함할 수 있고, 전처리 진행 과 정에 대한 정보를 상기 디스플레이 상에 출력하도록 더 구성될 수 있다. 사용자는 스마트폰, 태블릿PC 등의 디 스플레이 화면을 통해 진행 중인 이미지의 전처리 과정을 실시간으로 모니터링할 수 있다. 상기 디스플레이는 액정 디스플레이(liquid crystal display, LCD), 박막 트랜지스터 액정 디스 플레이(thin film transistor- liquid crystal display, TFT LCD), 유기 발광 다이오드(organic light-emitting diode, OLED), 플렉시블 디스 플레이(flexible display), 3차원 디스플레이(3D display) 등 다양한 출력부재가 선택 적용되어질 수 있다. 상기 이미지 전처리 시스템이 본 명세서에 서술되지 않은 다른 구성요소를 포함할 수도 있다는 것이 통상의 기술자에게 명백할 것이다. 예를 들어, 상기 이미지 전처리 시스템은 네트워크 인터페이스, 데이터 엔트리를 위한 입력 장치, 및 디스플레이, 인쇄 또는 다른 데이터 표시를 위한 출력 장치를 포함하는, 본 명세서에 서술 된 동작에 필요한 다른 하드웨어 요소를 포함할 수도 있다. 도 2는, 본 출원의 일 실시예에 따른, 전처리부의 세부적인 구성을 나타내는 개략도이다. 도 2를 참조하면, 상기 이미지 전처리부는 슬라이드 이미지 품질 평가부; 이미지 분할부; 이미"}
{"patent_id": "10-2023-0139514", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "지 틸팅부; 이미지 색상 보정부; 데이터 증강 처리부; 패치 품질 평가부; 및 결과 요약부 를 포함할 수 있다. 슬라이드 이미지 품질 평가부는 상기 슬라이드 이미지를 패쓰프로파일러(PathProfiler) 알고리즘을 이용하 여 이미지 품질 점수(quality score)를 제공하고, 질병 진단을 위한 이미지의 후속 분석 가능 정도, 이미지 염 색 정도 및 이미지 화질 정도의 점수 중 적어도 하나 이상을 포함하는 품질 점수를 제공한다. 이미지 분할부는 상기 슬라이드 이미지로부터 배경을 분리하여 조직이미지를 추출한다. 상기 이미지 분할 부는 상기 슬라이드 이미지로부터 RGB 데이터를 추출한 후, 오츠(Otsu) 이진화 알고리즘을 적용하여 최적 의 임계값(Threshold)을 찾은 후, 상기 임계값 설정을 통해 바이너리 이미지 기반으로 조직이미지를 추출할 수 있다. 오츠 이진화 알고리즘은 경계값을 임의로 정해서 픽셀들을 두 부류로 나누고 두 부류의 명암 분포를 반복 해서 구한 다음 두 부류의 명암 분포를 가장 균일하게 하는 경계 값을 선택한다. 특정 임계값을 T라 하면, T를 기준으로 이진 분류된 픽셀의 비율의 차가 가장 작은 최적의(optimal) T를 구하는 것이다. 일 실시예에서, 상기 이미지 분할부는 Unet 딥러닝 기반의 모델을 이용해 조직이미지를 추출할 수 있다. U-net 모델은 바이오메디컬(Biomedical) 분야에서 이미지 분할(Segmentation)을 목적으로 개발된 대표적인 인공 신경망 모델 중의 하나이다. U-net 모델은 U자 형태로 목표 과정의 여러가지 과정을 하나의 신경망을 통해서 재배치하는 프로세스를 가지고 있다. 인코더-디코더 구조 모델은 입력과 출력 데이터 처리를 분리 및 연계할 수 있도록 설계하여 처리 효율과 품질을 높이는 인공지능 모델이다. U-net 모델은 작은 경계를 분리할 수 있도록 학습되어야 한다. 각 픽셀이 경계와 얼마나 가까운지에 따른 Weight-Map을 만들고 학습할 때 경계에 가까운 픽 셀의 Loss를 Weight-Map에 비례하게 증가시킴으로써 경계를 잘 학습하도록 설계될 수 있다. 이미지 틸팅부는 상기 조직이미지의 해상도, 크기 및 조직 포함 정도를 기초로 상기 조직이미지를 잘라 복 수의 패치를 생성한다. 일 예에서, 상기 복수의 패치는 사각형 형태로 잘라질 수 있다. 상기 이미지 틸팅부 는 아래의 해상도, 크기, 조직 포함 정도의 조합 중 적어도 하나 이상의 방법으로 자를 수 있다. i) 해상도: 10x, 20x, 40x ii) 크기: 256 pixel, 512pixel iii) 조직포함 정도: 40%, 60%, 80% 이미지 색상 보정부는 상기 복수의 패치들 간의 색상을 정규화한다. 상기 이미지 색상 보정부는 헤마 톡실린 및 에오신(Hematoxylin and Eosin, H&E) 레퍼런스 이미지를 기초로 Macenko, Reinhard, Vagadana, 딥 러닝 기반 StainGAN 중 적어도 하나를 이용하여 복수의 패치들 간의 색상을 정규화할 수 있다. 조직이미지의 경우 H&E 염색 용액에 따라 영상의 색상이 달라진다. 따라서, 데이터셋이 같은 색상으로 표준화될 경우 이미지 간의 색상 차이가 감소하므로 효율적인 인공지능 모델 학습이 가능하다. 따라서, 상기 이미지 색상 보정부는 상기 이미지 틸팅부에서 생성된 복수의 패치들에 색상 정규화(stain normalization)를 실행 하며, 이때 색상 정규화는 Macenko, Reinhard, Vagadana, 딥러닝 기반 StainGAN 중 적어도 하나를 사용할 수 있다. 데이터 증강 처리부는 인공지능 신경망의 학습에 필요한 데이터의 확보를 위하여 데이터 증강(Data Augmentation)을 수행한다. 상기 증강 처리부는 리사이즈(Resize), 수평 플리핑(Horizontal flipping), 수직 플리핑(Vertical flipping), 크롭 변환(Crop transformation), 딥러닝 기반의 GAN 기법 중 적어도 하나 이상을 이용할 수 있다. 데이터 증강 처리부의 학습 데이터 증강 방법을 통해 대량의 학습 데이터를 생성 가능하여, 대량의 학습 데이터가 필요한 딥러닝 알고리즘의 한계를 극복하고 정확도를 향상시킬 수 있는 특징이 있다. 패치 품질 평가부는 상기 복수의 패치를 스크리닝한 후, 질병 진단을 위하여 적합한지 여부를 평가한다. 상기 패치 품질 평가부는, 한 이미지에서 틸팅된 파일들의 크기 분포, 캐니를 이용한 엣지를 검출하여 이미지 포함 범위 분포, 이미지 색상간 표준편차 분포를 제공한다. 파일크기 분포 컷오프(cut-off), 캐니(Canny) 를 이용하여 검출된 엣지(edge) 값을 이용한 이미지 포함 범위 컷오프, 이미지 내 색상 간 표준편차 분포 컷오 프를 미리 설정된 기준에 따라 패치가 수동(manual) 제거 될 수 있다."}
{"patent_id": "10-2023-0139514", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "결과 요약부는 상기 이미지 틸팅부에 의하여 생성된 복수의 패치의 수, 패치 품질 평가부에 의해 제거된 패치의 수 및 최종 생성된 패치의 수 중 적어도 하나 이상에 대한 결과를 제공한다. 도 3는, 본 출원의 일 실시예에 따른, 질병 분석을 위한 조직병리 이미지 전처리 방법의 흐름도이다. 도 3을 참조하면, 상기 이미지 전처리 방법은: (예컨대, 이미지 획득부에 의해) 슬라이드에 부착되어 염색 된 생체조직의 슬라이드 이미지를 획득하는 단계(S100); (예컨대, 이미지 전처리부에 의해) 질병 분석을 보조하기 위하여 상기 슬라이드 이미지를 전처리하는 단계(S200); (예컨대, 질병 분석부에 의해) 인공지능 신경망을 이용하여 전처리된 상기 조직이미지로부터 특정 유전변이 유무, 암 유무, 생존율 예측 및 약물효과 예 측 중 적어도 하나 이상을 포함하는 질병 분석 정보를 제공하는 단계(S300);를 포함한다. 이하, 설명의 명료성 을 위해서, 상기 이미지 전처리 방법이 상기 이미지 전처리 시스템에 의해 수행되는 실시예들로 본 발명을 보다 상세하게 서술한다. 도 4는, 본 출원의 일 실시예에 따른, 전처리하는 단계의 세부적인 흐름도이다. 도 4를 참조하면, 상기 전처리하는 방법은: (예컨대, 슬라이드 이미지 품질 평가부에 의해) 슬라이드 이미 지를 패쓰프로파일러 알고리즘을 이용하여 이미지 품질 점수(quality score)를 제공하는 슬라이드 이미지 품질 평가 단계(S210); (예컨대, 이미지 분할부에 의해) 상기 슬라이드 이미지로부터 배경을 분리하여 조직이미 지를 추출하는 단계(S220); (예컨대, 이미지 틸팅부에 의해) 상기 조직이미지의 해상도, 크기 및 조직 포 함 정도를 기초로 상기 조직이미지를 잘라 복수의 패치를 생성하는 단계(S230); (예컨대, 색상 보정부에 의해) 상기 복수의 패치들 간의 색을 정규화하는 단계(S240); (예컨대, 데이터 증강 처리부에 의해) 인공 지능 신경망의 학습에 필요한 데이터의 확보를 위하여 데이터 증강(Data Augmentation)을 수행하는 데이터 증강 처리 단계(S250); (예컨대, 패치 품질 평가부에 의해) 상기 복수의 패치를 스크리닝한 후, 질병 진단을 위"}
{"patent_id": "10-2023-0139514", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "하여 적합한지 여부를 평가하는 패치 품질 평가 단계(S260) 및 (예컨대, 결과 요약부에 의해) 생성된 복수"}
{"patent_id": "10-2023-0139514", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "의 패치의 수 또는 상기 품질 평가 단계에 의해 제거된 패치의 수에 대한 결과를 제공하는 결과 요약 단계 (S270)를 포함한다. 이하, 설명의 명료성을 위해서, 상기 전처리하는 방법이 상기 이미지 전처리부에 의해 수행되는 실시예들로 본 발명을 보다 상세하게 서술한다. 도 5는, 본 출원의 일 실시예에 따른, 질병 분석을 위한 조직병리 이미지 전처리 시스템을 GUI tool로 구현한 예시이다. 도 5를 참조하면, 이미지 전처리 시스템 또는 방법은 GUI(Graphic User Interface) 기반의 조직병리 이미지 전처리 프로그램을 제공할 수 있다. 사용자 인터페이스 제공부에 의하여 상기 슬라이드 이미지 품질 평가 부, 이미지 분할부, 이미지 틸팅부, 이미지 색상 보정부, 증강 처리부, 패치 품질 평"}
{"patent_id": "10-2023-0139514", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "가부 및 결과 요약부가 수행하는 각각의 전처리 진행 과정에 대한 정보를 사용자에게 제공할 수 있다. 일 예에서, 이미지 분할부가 슬라이드 이미지로부터 배경을 분리하여 조직이미지를 추출하는 과정에 서, 사용자는 Unet 딥러닝 기반의 모델을 클릭해 조직이미지를 추출할 수 있고, 마스크 배율, 배치 사이즈 등을 포함하는 다양한 파라미터를 지정할 수 있다. 또한, 조직이미지를 추출한 후의 이미지 및 분석 결과를 함께 보 여줄 수 있으며, 분석 진행 상황을 실시간으로 열람 가능하다. 도 6a 내지 도 6c는, 본 출원의 일 실시예에 따른, 전처리할 이미지를 불러오는 과정을 도시하는 이미지이다. 도 6a 내지 도 6c를 참조하면, 생성된 데이터의 저장 위치를 선택하는 메인 창과 각 단계마다 생성되는 폴더와 결과파일을 볼 수 있다. 다양한 슬라이드 파일 포맷 형태의 대용량 조직 병리 이미지 뷰어로서, 상기 이미지의 형식은 *.svs, *.tiff, *.dcm, *png, *jpg 등 형식을 포함하고, 이미지 스캔 정보가 제공될 수 있다. 도 7은, 본 출원의 일 실시예에 따른, 전처리부가 슬라이드 이미지의 품질을 평가하는 과정을 도시하는 이미지 이다. 도 7을 참조하면, 슬라이드 이미지 품질 평가부는 상기 슬라이드 이미지를 패쓰프로파일러(PathProfiler) 알고리즘을 이용하여 이미지 품질 점수(quality score)를 제공한다. 상기 슬라이드 이미지 품질 평가부는 질병 진단을 위한 이미지의 후속 분석 가능 정도, 이미지 염색 정도 및 이미지 화질 정도의 점수 중 적어도 하 나 이상을 포함하는 품질 점수를 제공할 수 있다. 일 예에서, 상기 품질 점수는 0 - 10 범위의 값일 수 있다. 도 8a 및 도 8b는, 본 출원의 일 실시예에 따른, 전처리부가 이미지를 분할하는 과정을 도시하는 이미지이다. 도 8a 및 도 8b를 참조하면, 이미지 분할부는 상기 슬라이드 이미지로부터 배경을 분리하여 조직이미지를 추출한다. 상기 이미지 분할부는 상기 슬라이드 이미지로부터 RGB 데이터를 추출한 후, 오츠(Otsu) 이진화 알고리즘을 적용하여 최적의 임계값을 찾은 후, 상기 임계값 설정을 통해 바이너리 이미지 기반으로 조직이미지 를 추출할 수 있다. 일 예에서, 오츠 이진화 알고리즘 적용 설정은 smooth intensity 1.25로 할 수 있다. 추가 적으로, 이미지 분할부는 Unet 딥러닝 기반의 모델을 이용해 조직이미지를 추출할 수 있는데, 일 예에서 mask magnification 1.25 및 batch size 8로 설정할 수 있다. 도 9는, 본 출원의 일 실시예에 따른, 전처리부가 이미지를 틸팅하는 과정을 도시하는 이미지이다. 도 9를 참조하면, 이미지 틸팅부는 상기 조직이미지의 해상도, 크기 및 조직 포함 정도를 기초로 상기 조 직이미지를 잘라 복수의 패치를 생성한다. 일 예에서, 상기 이미지 틸팅부는 파라미터 설정을 해상도 20x, 크기 512 pixel로 하여 자를 수 있다. 도 10은, 본 출원의 일 실시예에 따른, 전처리부가 이미지 색을 보정하는 과정을 도시하는 이미지이다. 도 10을 참조하면, 이미지 색상 보정부는 헤마톡실린 및 에오신(Hematoxylin and Eosin, H&E) 레퍼런스 이미지를 기초로 Macenko, Reinhard, Vagadana, 딥러닝 기반 StainGAN 중 적어도 하나를 이용하여 복수의 패치 들 간의 색상을 정규화할 수 있다. 일 예에서, 이미지 색상 보정부는 파라미터 설정을 Macenko로 하여 각 패치들의 색상을 정규화하는 보정을 할 수 있다. 도 11은, 본 출원의 일 실시예에 따른, 전처리부가 생성된 패치를 스크리닝한 후 패치의 품질을 평가하는 과정 을 도시하는 이미지이다. 도 11을 참조하면, 패치 품질 평가부는 복수의 패치를 스크리닝한 후, 질병 진단을 위하여 적합한지 여부 를 평가한다. 상기 패치 품질 평가부는, 캐니 엣지 검출(Canny edge detection) 설정을 통해 조직 포함 정도를 나타내는 임계 값 설정이 가능하고 색상 표준 편차의 분포 임계 값 설정이 가능하다."}
{"patent_id": "10-2023-0139514", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 7, "content": "도 12는, 본 출원의 일 실시예에 따른, 전처리부가 전처리 결과의 요약 정보를 제공하는 과정을 도시하는 이미 지이다."}
{"patent_id": "10-2023-0139514", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 8, "content": "도 12를 참조하면, 결과 요약부는 이미지 틸팅부에 의하여 생성된 복수의 패치의 수, 데이터 증강 처 리부에 의해 생성된 패치의 수, 패치 품질 평가부에 의해 제거된 패치의 수 및 최종 생성된 패치의 수 중 적어도 하나 이상에 대한 결과를 제공한다. 이와 같은 질병 분석을 위한 조직병리 이미지 전처리 시스템 및 방법에 의하면, 딥러닝 알고리즘을 활용하여 암 조직 병리이미지의 특정 유전변이 확인, 암 유무 확인, 생존율 예측, 약물효과 예측 등의 분석에 정확한 진단 및 결과도출을 위하여 데이터를 보정, 추출하는 전처리 용도로 활용 가능하다. 또한, 본 발명에 의하면 사용자 편의성을 위해 GUI 형식의 자동 이미지 전처리 시스템을 제공할 수 있고, 최적 의 파라미터 값을 제공하여 효율적이고 정확한 암 진단을 보조하여 다량의 이미지를 빠른 속도로 처리 가능하다. 각 전처리 과정의 단계별로 진행 과정을 뷰어함으로써 전처리 단계의 진행 과정이 한눈에 파악 가능 하고 필요에 따라 추가 수정이 가능하다. 이상에서 설명한 실시예들에 따른 질병 분석을 위한 조직병리 이미지 전처리 시스템 및 방법에 의한 동작은 적 어도 부분적으로 컴퓨터 프로그램으로 구현되어, 컴퓨터로 읽을 수 있는 기록매체에 기록될 수 있다. 예를 들어, 프로그램 코드를 포함하는 컴퓨터-판독가능 매체로 구성되는 프로그램 제품과 함께 구현되고, 이는 기술 된 임의의 또는 모든 단계, 동작, 또는 과정을 수행하기 위한 프로세서에 의해 실행될 수 있다. 상기 컴퓨터는 데스크탑 컴퓨터, 랩탑 컴퓨터, 노트북, 스마트 폰, 또는 이와 유사한 것과 같은 컴퓨팅 장치일 수도 있고 통합될 수도 있는 임의의 장치일 수 있다. 컴퓨터는 하나 이상의 대체적이고 특별한 목적의 프로세서, 메모리, 저장공간, 및 네트워킹 구성요소(무선 또는 유선 중 어느 하나)를 가지는 장치다. 상기 컴퓨 터는 예를 들어, 마이크로소프트의 윈도우와 호환되는 운영 체제, 애플 OS X 또는 iOS, 리눅스 배포판(Linux distribution), 또는 구글의 안드로이드 OS와 같은 운영체제(operating system)를 실행할 수 있다. 상기 컴퓨터가 읽을 수 있는 기록매체는 컴퓨터에 의하여 읽혀질 수 있는 데이터가 저장되는 모든 종류의 기록 신원확인 장치를 포함한다. 컴퓨터가 읽을 수 있는 기록매체의 예로는 ROM, RAM, CD-ROM, 자기 테이프, 플로피 디스크, 광 데이터 저장신원확인 장치 등을 포함한다. 또한 컴퓨터가 읽을 수 있는 기록매체는 네트워크로 연결된 컴퓨터 시스템에 분산되어, 분산 방식으로 컴퓨터가 읽을 수 있는 코드가 저장되고 실행될 수도 있다. 또한, 본 실시예를 구현하기 위한 기능적인 프로그램, 코드 및 코드 세그먼트(segment)들은 본 실시예가 속하는 기술 분야의 통상의 기술자에 의해 용이하게 이해될 수 있을 것이다. 이상에서 살펴본 본 발명은 도면에 도시된 실시예들을 참고로 하여 설명하였으나 이는 예시적인 것에 불과하며 당해 분야에서 통상의 지식을 가진 자라면 이로부터 다양한 변형 및 실시예의 변형이 가능하다는 점을 이해할 것이다. 그러나, 이와 같은 변형은 본 발명의 기술적 보호범위 내에 있다고 보아야 한다. 따라서, 본 발명의 진 정한 기술적 보호범위는 첨부된 특허청구범위의 기술적 사상에 의해서 정해져야 할 것이다."}
{"patent_id": "10-2023-0139514", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 출원의 예시적인 실시예들을 보다 명확하게 설명하기 위해, 실시예에 대한 설명에서 필요한 도면이 아래에서 간단히 소개된다. 아래의 도면들은 본 명세서의 실시예를 설명하기 목적일 뿐 한정의 목적이 아니라는 것으로 이해되어야 한다. 또한, 설명의 명료성을 위해 아래의 도면들에서 과장, 생략 등 다양한 변형이 적용된 일부 요 소들이 도시될 수 있다. 도 1은, 본 출원의 일 실시예에 따른, 질병 분석을 위한 조직병리 이미지 전처리 시스템의 구성을 나타내는 개 략도이다. 도 2는, 본 출원의 일 실시예에 따른, 전처리부의 세부적인 구성을 나타내는 개략도이다. 도 3은, 본 출원의 일 실시예에 따른, 질병 분석을 위한 조직병리 이미지 전처리 방법의 흐름도이다. 도 4는, 본 출원의 일 실시예에 따른, 전처리 단계의 세부적인 흐름도이다. 도 5는, 본 출원의 일 실시예에 따른, 질병 분석을 위한 조직병리 이미지 전처리 시스템을 GUI tool로 구현한 예시이다. 도 6a 내지 도 6c는, 본 출원의 일 실시예에 따른, 전처리할 이미지를 불러오는 과정을 도시하는 이미지이다. 도 7은, 본 출원의 일 실시예에 따른, 전처리부가 슬라이드 이미지의 품질을 평가하는 과정을 도시하는 이미지 이다. 도 8a 및 도 8b는, 본 출원의 일 실시예에 따른, 전처리부가 이미지를 분할하는 과정을 도시하는 이미지이다. 도 9는, 본 출원의 일 실시예에 따른, 전처리부가 이미지를 틸팅하는 과정을 도시하는 이미지이다. 도 10은, 본 출원의 일 실시예에 따른, 전처리부가 이미지 색을 보정하는 과정을 도시하는 이미지이다. 도 11은, 본 출원의 일 실시예에 따른, 전처리부가 생성된 패치를 스크리닝한 후 패치의 품질을 평가하는 과정 을 도시하는 이미지이다."}
{"patent_id": "10-2023-0139514", "section": "도면", "subsection": "도면설명", "item": 2, "content": "도 12는, 본 출원의 일 실시예에 따른, 전처리부가 전처리 결과의 요약 정보를 제공하는 과정을 도시하는 이미 지이다."}
