{"patent_id": "10-2020-0064492", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0147366", "출원번호": "10-2020-0064492", "발명의 명칭": "강화학습 기반의 유사일을 사용한 태양광 발전량 예측 시스템 및 방법", "출원인": "숭실대학교산학협력단", "발명자": "송경빈"}}
{"patent_id": "10-2020-0064492", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "예측 대상일의 태양광 발전량을 예측하기 위한 태양광 발전량 예측 시스템에 있어서,상기 예측 대상일의 기상 예보 데이터를 기반으로, 상기 예측 대상일을 기준으로 설정된 유사일 선택 범위 내의후보 유사일들 중 상기 예측 대상일의 태양광 발전량 예측을 위한 하나 이상의 유사일을 선택하는 유사일 선택모듈; 및상기 유사일 선택 모듈에 의해 선택된 유사일의 과거 태양광 발전량 데이터 및 상기 예측 대상일의 기상 예보데이터를 기반으로, 상기 예측 대상일의 태양광 발전량을 예측하는 태양광 발전량 예측 모듈을 포함하는 태양광발전량 예측 시스템."}
{"patent_id": "10-2020-0064492", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 예측 대상일의 기상 예보 데이터는:일사량 정보를 포함하며, 이와 더불어 일조시간, 기온, 운량, 습도 또는 강수량 정보를 더 포함할 수 있는 태양광 발전량 예측 시스템."}
{"patent_id": "10-2020-0064492", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 유사일 선택 모듈은:상기 예측 대상일의 기상 예보 데이터와 상기 후보 유사일들의 과거 기상 데이터를 기반으로, 유사일을 선택하는 유사일 선택 모델을 생성하는 유사일 선택 모델 생성부;상기 유사일의 과거 태양광 발전량 데이터와 상기 예측 대상일의 태양광 발전량 데이터 간의 차이를 기반으로,상기 유사일 선택 모델을 강화 학습시키는 유사일 선택 모델 검증부; 및상기 예측 대상일의 기상 예보 데이터를 기반으로, 상기 강화 학습된 유사일 선택 모델을 통해 상기 후보 유사일들 중 하나 이상의 유사일을 선택하는 유사일 선택부를 포함하는 태양광 발전량 예측 시스템."}
{"patent_id": "10-2020-0064492", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 유사일 선택 모델은:DQN(Deep Q-Network) 알고리즘 기반의 제1 인공신경망을 포함하고;상기 예측 대상일로부터 기 설정된 범위에 해당하는 유사일 선택 범위 내의 후보 유사일의 과거 기상 데이터와상기 예측 대상일의 기상 예보 데이터를 상태 입력 값으로 사용하고;상기 상태 입력 값에서의 과거 기상 데이터와 기상 예보 데이터 간의 유사도를 기준으로 선택된 유사일을 선택입력 값으로 사용하고;상기 선택 입력 값에서의 과거 태양광 발전량 데이터와 상기 예측 대상일의 태양광 발전량 데이터 간의 차이를보상 입력 값으로 사용하는 태양광 발전량 예측 시스템.공개특허 10-2021-0147366-3-청구항 5 제4항에 있어서,상기 태양광 발전량 예측 모듈은:상기 유사일 선택 모듈에 의해 선택된 유사일의 과거 태양광 발전량 데이터와 상기 예측 대상일의 기상 예보 데이터를 기반으로, 발전량 예측 모델을 생성하는 발전량 예측 모델 생성부;상기 발전량 예측 모델을 통해 예측된 예측 대상일의 태양광 발전량 데이터와 과거 태양광 발전량 데이터를 비교하여, 상기 발전량 예측 모델을 검증하는 발전량 예측 모델 검증부; 및상기 예측 대상일의 기상 예보 데이터를 기반으로, 상기 검증된 발전량 예측 모델을 통해 상기 예측 대상일의태양광 발전량을 예측하는 발전량 예측부를 포함하는 태양광 발전량 예측 시스템."}
{"patent_id": "10-2020-0064492", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 발전량 예측 모델은:Fully Connected Deep Neural Network 알고리즘 기반의 제2 인공신경망을 포함하고;상기 유사일 선택 모델에 의해 선택된 유사일의 과거 태양광 발전량 데이터와 상기 예측 대상일의 기상 예보 데이터를 입력 값으로 사용하고;상기 예측 대상일의 예측 태양광 발전량을 출력하는 태양광 발전량 예측 시스템."}
{"patent_id": "10-2020-0064492", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "예측 대상일의 태양광 발전량을 예측하기 위한 태양광 발전량 예측 방법에 있어서,(a) 예측 대상일의 기상 예보 데이터를 기반으로, 상기 예측 대상일을 기준으로 설정된 유사일 선택 범위 내의후보 유사일들 중 상기 예측 대상일의 태양광 발전량 예측을 위한 하나 이상의 유사일을 선택하는 단계; 및(b) 상기 (a) 단계에 의해 선택된 유사일의 과거 태양광 발전량 데이터 및 상기 예측 대상일의 기상 예보 데이터를 기반으로, 상기 예측 대사일의 태양광 발전량을 예측하는 단계를 포함하는 태양광 발전량 예측 방법."}
{"patent_id": "10-2020-0064492", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 (a) 단계는:(a-1) 상기 예측 대상일의 기상 예보 데이터와 상기 후보 유사일들의 과거 기상 데이터를 기반으로, 유사일을선택하는 유사일 선택 모델을 생성하는 단계;(a-2) 상기 유사일의 과거 태양광 발전량 데이터와 상기 예측 대상일의 태양광 발전량 데이터 간의 차이를 기반으로, 상기 유사일 선택 모델을 강화 학습시키는 단계; 및(a-3) 상기 예측 대상일의 기상 예보 데이터를 기반으로, 상기 강화 학습된 유사일 선택 모델을 통해 상기 후보유사일들 중 하나 이상의 유사일을 선택하는 단계를 포함하는 태양광 발전량 예측 방법."}
{"patent_id": "10-2020-0064492", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "공개특허 10-2021-0147366-4-제8항에 있어서,상기 (b) 단계는:(b-1) 상기 (a) 단계에 의해 선택된 유사일의 과거 태양광 발전량 데이터와 상기 예측 대상일의 기상 예보 데이터를 기반으로, 발전량 예측 모델을 생성하는 단계;(b-2) 상기 발전량 예측 모델을 통해 예측된 예측 대상일의 태양광 발전량 데이터와 과거 태양광 발전량 데이터를 비교하여, 상기 발전량 예측 모델을 검증하는 단계; 및(b-3) 상기 예측 대상일의 기상 예보 데이터를 기반으로, 상기 검증된 발전량 예측 모델을 통해 상기 예측 대상일의 태양광 발전량을 예측하는 단계를 포함하는 태양광 발전량 예측 방법."}
{"patent_id": "10-2020-0064492", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 예측 대상일의 태양광 발전량을 예측하기 위한 태양광 발전량 예측 시스템에 있어서, 상기 예측 대상일의 기상 예보 데이터를 기반으로, 상기 예측 대상일을 기준으로 설정된 유사일 선택 범 위 내의 후보 유사일들 중 상기 예측 대상일의 태양광 발전량 예측을 위한 하나 이상의 유사일을 선택하는 유사 일 선택 모듈; 및 상기 유사일 선택 모듈에 의해 선택된 유사일의 과거 태양광 발전량 데이터 및 상기 예측 대상 일의 기상 예보 데이터를 기반으로, 상기 예측 대상일의 태양광 발전량을 예측하는 태양광 발전량 예측 모듈을 포함한다."}
{"patent_id": "10-2020-0064492", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 강화학습 기반의 유사일을 사용한 태양광 발전량 예측 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2020-0064492", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 소용량 태양광 발전의 보급이 확대되었으며 특히 1MW 이하의 중, 소형 태양광 설비가 전체 설치량의 대다 수를 차지하고 있다. 또한 태양광 발전의 경우 간헐성 문제가 있기 때문에 소규모 발전량을 정확히 예측해 계통 운영과 전력수급 균형에 활용하여 비용 절감과 안정적인 전력 공급 운영에 활용하고자 하는 노력이 지속적으로 이루어지고 있다. 소용량 태양광 발전량은 다양한 기상 요인들과의 상관관계가 높은 것으로 알려져 있으며, 특히 일사량, 계절에 따른 기온의 영향, 일조 시간, 강수 여부 등이 발전량 예측에 고려되어야 한다. 소용량 태양광 발전의 경우 1MW이상의 대규모 태양광 발전 단지와 다르게 태양광 발전량에 상관관계가 높다고 알려져 있는 일사량, 전천 운량, 기온 등을 정밀하게 측정할 수 있는 측정 장치를 설치하고 관리하는 것은 현실 적으로 어려운 일이다. 종래의 태양광 발전량 예측 기술은 과거 기상 인자, 모듈 상태 등과 같은 환경 조건과 태양광 발전량의 관계를 자기 회귀 또는 인공지능 모델을 만들어 환경 조건의 추정 값을 입력으로 하여 태양광 발전량을 추정하는 방법 을 사용한다. 따라서 예측하고자 하는 태양광 발전기의 상태에 따라 환경 조건에 따른 태양광 발전량을 추정하 는 예측 모델을 만드는 복잡한 과정을 필요로 하며, 기후 모니터링 장치, 구름 사진 측정 장치, 모듈 진단 장치 등의 추가 장치를 요구하기도 한다. 이러한 예측 모델 생성 과정과 추가적인 장치의 필요는 대용량 태양광 발전 단지의 경우 적합할 수 있으나, 다양한 위치에 많은 수가 설치되는 소용량 태양광 발전기의 경우 적용하기 어렵 다는 문제점이 있다. 이에 따라 추가적인 장비의 설치 없이 소용량 태양광 발전기의 발전량을 예측하기 위한 기술 개발의 필요성이 요구되고 있다."}
{"patent_id": "10-2020-0064492", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 실시예는 외부로부터 수신한 기상 데이터와 과거의 태양광 발전량 데이터를 기반으로 강화 학습을 수 행하여 예측 대상일과 유사한 기상을 갖는 유사일을 선택하고, 선택된 유사일의 과거 태양광 발전량 데이터와 예측 대상일의 기상 예보 데이터를 기반으로 예측 대상일의 태양광 발전량을 예측할 수 있는 강화학습 기반의 유사일을 사용한 태양광 발전량 예측 시스템 및 방법을 제공하는 것을 목적으로 한다. 한편, 본 발명에서 이루고자 하는 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급하"}
{"patent_id": "10-2020-0064492", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "지 않은 또 다른 기술적 과제들은 아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에 게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2020-0064492", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 예측 대상일의 태양광 발전량을 예측하기 위한 태양광 발전량 예측 시스템에 있어 서, 상기 예측 대상일의 기상 예보 데이터를 기반으로, 상기 예측 대상일을 기준으로 설정된 유사일 선택 범위 내의 후보 유사일들 중 상기 예측 대상일의 태양광 발전량 예측을 위한 하나 이상의 유사일을 선택하는 유사일 선택 모듈; 및 상기 유사일 선택 모듈에 의해 선택된 유사일의 과거 태양광 발전량 데이터 및 상기 예측 대상일 의 기상 예보 데이터를 기반으로, 상기 예측 대상일의 태양광 발전량을 예측하는 태양광 발전량 예측 모듈을 포 함한다. 상기 예측 대상일의 기상 예보 데이터는: 일사량 정보를 포함하며, 이와 더불어 일조시간, 기온, 운량, 습도 또 는 강수량 정보를 더 포함할 수 있다. 상기 유사일 선택 모듈은: 상기 예측 대상일의 기상 예보 데이터와 상기 후보 유사일들의 과거 기상 데이터를 기반으로, 유사일을 선택하는 유사일 선택 모델을 생성하는 유사일 선택 모델 생성부; 상기 유사일의 과거 태양 광 발전량 데이터와 상기 예측 대상일의 태양광 발전량 데이터 간의 차이를 기반으로, 상기 유사일 선택 모델을 강화 학습시키는 유사일 선택 모델 검증부; 및 상기 예측 대상일의 기상 예보 데이터를 기반으로, 상기 강화 학 습된 유사일 선택 모델을 통해 상기 후보 유사일들 중 하나 이상의 유사일을 선택하는 유사일 선택부를 포함한 다. 상기 유사일 선택 모델은: DQN(Deep Q-Network) 알고리즘 기반의 제1 인공신경망을 포함하고; 상기 예측 대상일 로부터 기 설정된 범위에 해당하는 유사일 선택 범위 내의 후보 유사일의 과거 기상 데이터와 상기 예측 대상일 의 기상 예보 데이터를 상태 입력 값으로 사용하고; 상기 상태 입력 값에서의 과거 기상 데이터와 기상 예보 데 이터 간의 유사도를 기준으로 선택된 유사일을 선택 입력 값으로 사용하고; 상기 선택 입력 값에서의 과거 태양 광 발전량 데이터와 상기 예측 대상일의 태양광 발전량 데이터 간의 차이를 보상 입력 값으로 사용한다. 상기 태양광 발전량 예측 모듈은: 상기 유사일 선택 모듈에 의해 선택된 유사일의 과거 태양광 발전량 데이터와 상기 예측 대상일의 기상 예보 데이터를 기반으로, 발전량 예측 모델을 생성하는 발전량 예측 모델 생성부; 상 기 발전량 예측 모델을 통해 예측된 예측 대상일의 태양광 발전량 데이터와 과거 태양광 발전량 데이터를 비교 하여, 상기 발전량 예측 모델을 검증하는 발전량 예측 모델 검증부; 및 상기 예측 대상일의 기상 예보 데이터를 기반으로, 상기 검증된 발전량 예측 모델을 통해 상기 예측 대상일의 태양광 발전량을 예측하는 발전량 예측부 를 포함한다. 상기 발전량 예측 모델은: Fully Connected Deep Neural Network 알고리즘 기반의 제2 인공신경망을 포함하고; 상기 유사일 선택 모델에 의해 선택된 유사일의 과거 태양광 발전량 데이터와 상기 예측 대상일의 기상 예보 데 이터를 입력 값으로 사용하고; 상기 예측 대상일의 예측 태양광 발전량을 출력한다. 본 발명의 일 실시예에 따른 예측 대상일의 태양광 발전량을 예측하기 위한 태양광 발전량 예측 방법에 있어서, (a) 예측 대상일의 기상 예보 데이터를 기반으로, 상기 예측 대상일을 기준으로 설정된 유사일 선택 범위 내의 후보 유사일들 중 상기 예측 대상일의 태양광 발전량 예측을 위한 하나 이상의 유사일을 선택하는 단계; 및 (b) 상기 (a) 단계에 의해 선택된 유사일의 과거 태양광 발전량 데이터 및 상기 예측 대상일의 기상 예보 데이터를 기반으로, 상기 예측 대사일의 태양광 발전량을 예측하는 단계를 포함한다. 상기 (a) 단계는: (a-1) 상기 예측 대상일의 기상 예보 데이터와 상기 후보 유사일들의 과거 기상 데이터를 기 반으로, 유사일을 선택하는 유사일 선택 모델을 생성하는 단계; (a-2) 상기 유사일의 과거 태양광 발전량 데이 터와 상기 예측 대상일의 태양광 발전량 데이터 간의 차이를 기반으로, 상기 유사일 선택 모델을 강화 학습시키 는 단계; 및 (a-3) 상기 예측 대상일의 기상 예보 데이터를 기반으로, 상기 강화 학습된 유사일 선택 모델을 통 해 상기 후보 유사일들 중 하나 이상의 유사일을 선택하는 단계를 포함할 수 있다. 상기 (b) 단계는: (b-1) 상기 (a) 단계에 의해 선택된 유사일의 과거 태양광 발전량 데이터와 상기 예측 대상일 의 기상 예보 데이터를 기반으로, 발전량 예측 모델을 생성하는 단계; (b-2) 상기 발전량 예측 모델을 통해 예 측된 예측 대상일의 태양광 발전량 데이터와 과거 태양광 발전량 데이터를 비교하여, 상기 발전량 예측 모델을 검증하는 단계; 및 (b-3) 상기 예측 대상일의 기상 예보 데이터를 기반으로, 상기 검증된 발전량 예측 모델을 통해 상기 예측 대상일의 태양광 발전량을 예측하는 단계를 포함할 수 있다."}
{"patent_id": "10-2020-0064492", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따른 강화학습 기반의 유사일을 사용한 태양광 발전량 예측 시스템 및 방법은 외부로부터 수신한 기상 데이터와 과거의 태양광 발전량 데이터를 기반으로 강화 학습을 수행하여 예측 대상일과 유사한 기상을 갖는 유사일을 선택하고, 선택된 유사일의 과거 태양광 발전량 데이터와 예측 대상일의 기상 예보 데이터 를 기반으로 예측 대상일의 태양광 발전량을 예측할 수 있다. 한편, 본 발명에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효"}
{"patent_id": "10-2020-0064492", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "과들은 아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2020-0064492", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 다른 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술 되는 실 시 예를 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시 예에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시 예는 본 발명의 개시가 완전하도록 하고, 본 발명이 속하"}
{"patent_id": "10-2020-0064492", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명 은 청구항의 범주에 의해 정의될 뿐이다. 만일 정의되지 않더라도, 여기서 사용되는 모든 용어들(기술 혹은 과학 용어들을 포함)은 이 발명이 속한 종래 기술에서 보편적 기술에 의해 일반적으로 수용되는 것과 동일한 의미를 가진다. 일반적인 사전들에 의해 정의된 용어들은 관련된 기술 그리고/혹은 본 출원의 본문에 의미하는 것과 동일한 의미를 갖는 것으로 해석될 수 있고, 그리고 여기서 명확하게 정의된 표현이 아니더라도 개념화되거나 혹은 과도하게 형식적으로 해석되지 않 을 것이다. 본 명세서에서 사용된 용어는 실시 예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 '포함한다' 및/또는 이 동사의 다양한 활용형들 예를 들어, '포함', '포함하는', '포함하고', '포함하며' 등은 언급된 조성, 성분, 구성요소, 단계, 동작 및/또는 소자는 하나 이상의 다른 조성, 성분, 구성요소, 단계, 동작 및/또 는 소자의 존재 또는 추가를 배제하지 않는다. 본 명세서에서 '및/또는' 이라는 용어는 나열된 구성들 각각 또 는 이들의 다양한 조합을 가리킨다. 한편, 본 명세서 전체에서 사용되는 '~부', '~기', '~블록', '~모듈' 등의 용어는 적어도 하나의 기능이나 동작 을 처리하는 단위를 의미할 수 있다. 예를 들어 소프트웨어, FPGA 또는 ASIC과 같은 하드웨어 구성요소를 의미 할 수 있다. 그렇지만 '~부', '~기', '~블록', '~모듈' 등이 소프트웨어 또는 하드웨어에 한정되는 의미는 아니 다. '~부', '~기', '~블록', '~모듈'은 어드레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 '~부', '~기', '~블록', '~모듈'은 소프트웨어 구성요소들, 객체지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태스크 구성 요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프 로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로 코드, 회로, 데이터, 데이 터베이스, 데이터 구조들, 테이블들, 어레이들 및 변수들을 포함한다. 구성요소들과 '~부', '~기', '~블록', '~ 모듈'들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 '~부', '~기', '~블록', '~모듈'들로 결합되거나 추가적인 구성요소들과 '~부', '~기', '~블록', '~모듈'들로 더 분리될 수 있다. 이하, 본 명세서의 첨부된 도면을 참조하여 본 발명의 실시예를 상세하게 설명한다. 도 1은 본 발명의 일 실시예에 따른 태양광 발전량 예측 시스템의 구성을 개략적으로 나타낸 블록도이다. 도 1을 참조하면, 태양광 발전량을 예측하고자 하는 일자인 예측 대상일에서의 태양광 발전량을 예측할 수 있는 태양광 발전량 예측 시스템은 외부 서버로부터 기상 데이터를 수집하고 이를 데이터베이스에 저장하는 기상 데이터 수집 모듈, 태양광 발전기의 과거 태양광 발전량 데이터를 수집하고 이를 데이터베이스 에 저장하는 태양광 발전량 데이터 수집 모듈, 기상 데이터 수집 모듈과 태양광 발전량 데이터 수집 모듈 로부터 수집된 데이터를 저장하는 데이터베이스, 예측 대상일의 기상 예보 데이터를 기반으로, 상기 예측 대상일을 기준으로 설정된 유사일 선택 범위 내의 후보 유사일들 중 상기 예측 대상일의 태양광 발전량 예측을 위한 하나 이상의 유사일을 선택하는 유사일 선택 모듈 및 상기 유사일 선택 모듈에 의해 선택된 유사일의 과거 태양광 발전량 데이터와 상기 예측 대상일의 기상 예보 데이터를 기반으로, 상기 예측 대상일의 태양광 발 전량을 예측하는 태양광 발전량 예측 모듈을 포함할 수 있다. 도 2는 본 발명의 일 실시예에 따른 기상 데이터 수집 모듈의 동작을 개략적으로 나타낸 도면이다. 도 2를 참조하면, 기상 데이터 수집 모듈은 발전량을 예측하고자 하는 예측 대상 태양광 발전기가 위치한 지역의 과거 기상 데이터와 예측 대상일의 기상 예보 데이터를 외부 서버로부터 수집하여 데이터베이스 에 저장한다. 이때 외부 서버는 기상청 서버를 포함한 기상 데이터를 보관 및 관리하는 서버를 말한다. 기상 데이터는 과 거 기상 데이터와 기상 예보 데이터를 모두 포함한다. 기상 데이터는 일사량 정보를 포함하며 이와 더불어 일조 시간, 기온, 운량, 습도 또는 강수량 등 태양광 발전량에 영향을 줄 수 있는 기상 데이터를 모두 포함할 수 있 다. 기상 데이터 수집 모듈을 통해 수집된 기상 데이터는 데이터베이스에 저장됨과 더불어 정규화와 같은 전처리 과정을 통해 차후 유사일 선택 모듈 및 태양광 발전량 예측 모듈의 입력 데이터로 사용될 수 있다. 도 3은 본 발명의 일 실시예에 따른 태양광 발전량 데이터 수집 모듈의 동작을 개략적으로 나타낸 도면이 다. 도 3을 참조하면, 태양광 발전량 데이터 수집 모듈은 예측 대상 태양광 발전기에서 생산한 과거의 태 양광 발전량 데이터를 수집하여 데이터베이스에 저장한다. 태양광 발전량 데이터 수집 모듈을 통해 수집된 태양광 발전량 데이터는 데이터베이스에 저장됨과 더 불어 정규화와 같은 전처리 과정을 통해 차후 유사일 선택 모듈 및 태양광 발전량 예측 모듈의 입력 데이터로 사용될 수 있다. 데이터베이스는 기상 데이터 수집 모듈로부터 수집된 기상 데이터와 태양광 발전량 데이터 수집 모듈 로부터 수집된 태양광 발전량 데이터를 수집 및 저장한다. 이와 더불어 과거, 현재 및 미래의 연, 월, 일 등을 포함한 날짜 정보를 수집 및 저장한다. 도 4는 본 발명의 일 실시예에 따른 유사일 선택 모듈의 구성을 개략적으로 나타낸 블록도이다. 도 4를 참조하면, 유사일 선택 모듈은 유사일 선택 인터페이스부, 유사일 선택 모델 생성부, 유 사일 선택 모델 검증부 및 유사일 선택부를 포함할 수 있다. 도 5은 유사일 선택 모델의 가치함수(DQN)의 구성을 개략적으로 나타낸 블록도이다. 도 5을 참조하면 유사일 선택 모델은 유사일 선택 인터페이스부에서 입력된 정보를 상태 입력 값으로 하고, 상태 입력 값과 선택 입력 값에 따른 기대 보상을 출력으로 하는 심층 신경망의 형태로 표현된다. 유사일 선택 모듈은 예측 대상일을 기준으로 설정된 유사일 선택 범위 내의 후보 유사일들 중에서, 예측 대상일에서의 기상 예보 데이터와 기상이 서로 유사한 유사일을 선택하며, 이 과정에서 예측 대상일의 태양광 발전량 데이터와 후보 유사일의 과거 태양광 발전량 데이터가 반영된다. 이때 유사일은 하나 이상으로 선택될 수 있으며, 선택된 유사일은 추후 태양광 발전량 예측 모듈에서 예측 대상일의 태양광 발전량을 예측하는 데 사용된다. 후보 유사일은 예측 대상일을 기준으로 기 설정된 범위에 해당하도록 설정된 유사일 선택 범위에 해당하는 일자 들을 말한다. 유사일 선택 범위는 제1 유사일 선택 범위와 제2 유사일 선택 범위를 포함한다. 제1 유사일 선택 범위는 예측 대상일로부터 제1 범위 전에 해당하는 기간을 말한다. 예를 들어, 예측 대상일이 2020년 5월 15일이고, 제1 범위는 10일로 설정된 경우, 제1 유사일 선택 범위는 예측 대상일을 제외하고 10일 전에 해당하는 기간인 2020년 5월 4일부터 2020년 5월 14일까지를 말한다. 제2 유사일 선택 범위는 예측 대상일의 기 설정된 햇수 전에 해당하는 일자로부터 제2 범위 전후에 해당하는 기 간을 말한다. 예를 들어, 예측 대상일이 상기와 같이 2020년 5월 15일이고, 기 설정된 햇수는 1년으로 설정되고, 제2 범위는 15일로 설정된 경우, 제2 유사일 범위는 2019년 5월 15일 전후 15일에 해당하는 기간인 2019년 5월 5일부터 2019년 5월 30일까지를 말한다. 유사일 선택 범위는 사용자의 설정에 따라 제1 유사일 선택 범위 및 제2 유사일 선택 범위 중 적어도 어느 하나 를 포함할 수 있는데, 만약 제1 및 제2 유사일 선택 범위를 모두 포함하는 것으로 설정한 경우, 위의 예에서 유 사일 선택 범위는 2019년 5월 5일부터 2019년 5월30일 까지의 기간과 2020년 5월 4일부터 2020년 5월 14일까지 의 기간이 이에 해당하게 된다. 즉, 이 경우 후보 유사일은 위의 유사일 선택 범위에 포함된 각각의 일자들 모 두를 말한다. 유사일 선택 모듈에서의 유사일 선택은 유사일 선택 모델을 통해 이루어진다. 유사일 선택 모델은 예측 대 상일의 기상 예보 데이터와 후보 유사일들의 과거 기상 데이터를 기반으로 유사일을 선택하며, 이 과정에서 예 측 대상일의 태양광 발전량 데이터와 유사일의 과거 태양광 발전량 데이터 간의 차이를 반영하여 유사일 선택 모델을 강화 학습시킨다. 유사일 선택 모델은 강화 학습이 이루어질 수 있는 DQN(Deep Q-Network) 알고리즘 또는 Double DQN 알고리즘 기 반의 제1 인공신경망을 포함한다. DQN 알고리즘은 상태(state) 입력 값, 선택(action) 입력 값 및 보상(reward) 입력 값을 사용한다. 본 발명의 유사일 선택 모델에서는 예측 대상일로부터 기 설정된 범위에 해당하는 유사일 선택 범위 내의 후보 유사일의 과거 기상 데이터와 상기 예측 대상일의 기상 예보 데이터를 상태(state) 입력 값으로 사용한다. 또한, 상태 입력 값에서의 과거 기상 데이터와 기상 예보 데이터 간의 유사도를 기준으로 선택된 유사일을 선택 (action) 입력 값으로 사용한다. 이때 후보 유사일에서의 과거 기상 데이터와 예측 대상일의 기상 예보 데이터 간의 유사도가 높은 순서대로 기 설정된 개수의 유사일을 선택할 수 있다. 마지막으로, 선택 입력 값에서의 과 거 태양광 발전량 데이터와 예측 대상일에서의 실제 태양광 발전량 데이터 간의 차이를 보상(reward) 입력 값으 로 사용한다. 유사일 선택 모듈의 각 구성부에 대해 살펴보면 다음과 같다. 유사일 선택 인터페이스부는 각종 실행 명령을 전달한다. 여기서 실행 명령은 유사일 선택 모델 생성 명령 과 유사일 선택 명령을 포함한다. 유사일 선택 모델 생성부는 유사일 선택 인터페이스부로부터 유사일 선택 모델 생성 명령을 전달받으 면, 예측 대상일의 기상 예보 데이터와 후보 유사일들의 과거 기상 데이터를 기반으로 유사일을 선택하는 유사 일 선택 모델을 생성한 후 이를 유사일 선택 모델 검증부로 전달한다. 유사일 선택 모델 검증부는 유사일의 과거 태양광 발전량 데이터와 예측 대상일의 태양광 발전량 데이터 간의 차이를 기반으로 유사일 선택 모델을 강화 학습시킨다. 즉, 유사일 선택 모델 생성부에서 생성된 유 사일 선택 모델의 보상(reward)의 결과가 충분히 만족 될 때까지 반복적으로 유사일 선택 모델의 가치함수(DQN) 또는 정책을 피드백하여 유사일 선택 모델 생성부로 다시 전달한다. 이때 유사일의 과거 태양광 발전량 데 이터와 예측 대상일에서의 태양광 발전량 데이터 간의 차이가 작을수록 높은 보상(reward)을 주는 방식으로 가 치함수(DQN)을 조절하여 강화학습 기반의 유사일 선택 모델을 학습시킬 수 있다. 이러한 강화 학습이 완료되면 유사일 선택 모델 검증부는 강화 학습이 완료된 유사일 선택 모델을 유사일 선택부로 전달한다. 유사일 선택부는 유사일 선택 인터페이스부로부터 유사일 선택 명령을 수신하면, 예측 대상일의 기상 예보 데이터를 기반으로, 강화 학습된 유사일 선택 모델을 통해 후보 유사일들 중 하나 이상의 유사일을 선택한 다. 도 6은 본 발명의 일 실시예에 따른 태양광 발전량 예측 모듈의 구성을 개략적으로 나타낸 블록도이다. 도 6을 참조하면, 태양광 발전량 예측 모듈은 발전량 예측 인터페이스부, 발전량 예측 모델 생성부 , 발전량 예측 모델 검증부 및 최종 발전량 예측부를 포함한다. 도 7은 태양광 발전량 예측 모델의 구성을 개략적으로 나타낸 블록도이다. 도 7을 참조하면 태양광 발전량 예측 모델은 발전량 예측 인터페이스부에서 입력된 유사일의 과거 기상 데 이터 및 유사일의 과거 태양광 발전량 데이터와 예측 대상일의 기상 예보 데이터를 입력 값으로 하고, 예측 대 상일의 태양광 발전량을 출력으로 하는 심층 신경망의 형태로 표현된다. 즉, 태양광 발전량 예측 모듈은 유사일 선택 모듈에 의해 선택된 유사일의 과거 태양광 발전량 데이 터 및 유사일의 과거 기상 데이터와 예측 대상일의 기상 예보 데이터를 기반으로, 예측 대상일의 태양광 발전량 을 예측한다. 다시 말해, 태양광 발전량 예측 모듈은 유사일 선택 모듈로부터 입력 받은 유사일, 데이터베이스 로부터 입력 받은 유사일의 과거 기상 데이터 및 유사일의 과거 태양광 발전량 데이터를 바탕으로 제2 인 공신경망 기반의 발전량 예측 모델을 생성한다. 이후 생성된 발전량 예측 모델에 대한 검증을 통해 최종 발전량 예측 모델을 생성하여 예측 대상일의 최종 발전량을 산출한다. 태양광 발전량 예측 모듈의 각 구성부에 대해 살펴보면 다음과 같다. 발전량 예측 인터페이스부는 각종 실행 명령을 전달한다. 여기서 실행 명령은 발전량 예측 모델 생성 명령 과 발전량 산출 명령을 포함한다. 발전량 예측 모델 생성부는 발전량 예측 인터페이스부로부터 발전량 예측 모델 생성 명령을 전달받으 면, 유사일 선택 모듈에 의해 선택된 유사일의 과거 태양광 발전량 데이터와 예측 대상일의 기상 예보 데 이터를 기반으로, 발전량 예측 모델을 생성한다. 발전량 예측 모델은 Fully Connected Deep Network, LSTM 및 CNN Layer 알고리즘 중 적어도 어느 하나의 알고 리즘을 기반으로 한 제2 인공신경망을 포함한다. 본 발명의 발전량 예측 모델에서는 유사일 선택 모델에 의해 선택된 유사일의 과거 태양광 발전량 데이터 와 예측 대상일의 기상 예보 데이터를 입력 값으로 사용하며 예측 대상일의 예측 태양광 발전량을 출력한다. 발전량 예측 모델 검증부는 발전량 예측 모델을 통해 예측된 예측 대상일의 태양광 발전량 데이터와 과거 태양광 발전량 데이터를 비교하여, 발전량 예측 모델을 검증한다. 즉, 발전량 예측 모델 생성부에서 생성 된 발전량 예측 모델과 과거 발전량 데이터들을 사용하여 발전량 예측 모델의 학습이 충분히 만족 될 때까지 반 복적으로 모델의 파라미터를 업데이트하도록 모델을 피드백하여 발전량 예측 모델 생성부로 다시 전달한다. 다시 말해, 발전량 예측 모델 검증부는 발전량 예측 모델의 파라미터를 조절하여 발전량 예측 모델 생성부로 재전달하고, 파라미터의 조절이 완료되었다고 판단된 경우 파라미터 조절이 완료된 발전량 예측 모델을 최종 발전량 예측부로 전달한다. 예를 들어, 본 발명에서는 과거 50일의 데이터를 발전량 산출 모델 학습 데이터로 사용하며, 그 중 15일을 발전 량 산출 모델 검증을 위해 사용할 수 있다. 물론, 이러한 값들은 사용자의 선택 또는 모델의 최적화 과정에서 변경될 수 있음은 자명하다. 최종 발전량 예측부는 발전량 예측 인터페이스부로부터 최종 발전량 예측 명령을 수신하면, 예측 대 상일의 기상 예보 데이터를 기반으로, 파라미터 조절을 통해 검증된 발전량 예측 모델을 사용하여 예측 대상일 의 태양광 발전량을 예측한다. 즉, 데이터베이스로부터 예측 대상일의 날짜 정보와 기상 예보 데이터를 입 력 받은 후 발전량 예측 모델 검증부로부터 전달받은 검증된 발전량 예측 모델을 사용하여 예측 발전량을 산출한다. 이후 산출된 최종 발전량을 발전량 예측 인터페이스부로 전달한다. 마지막으로, 발전량 예측 인터페이스부는 최종 발전량 예측 결과를 수신하여 이를 사용자에게 표 또는 그 래프 등의 방식으로 출력한다. 본 발명의 일 실시예에 따른 태양광 발전량 예측 방법은, 예측 대상일의 태양광 발전량을 예측하기 위한 태양광 발전량 예측 방법에 있어서, 예측 대상일의 기상 예보 데이터를 기반으로, 상기 예측 대상일을 기준으로 설정된 유사일 선택 범위 내의 후보 유사일들 중 상기 예측 대상일의 태양광 발전량 예측을 위한 하나 이상의 유사일을 선택하는 단계((a) 단계) 및 상기 (a) 단계에 의해 선택된 유사일의 과거 태양광 발전량 데이터 및 상기 예측 대상일의 기상 예보 데이터를 기반으로, 상기 예측 대사일의 태양광 발전량을 예측하는 단계((b) 단계)를 포한 한다. 이때, (a) 단계는 상기 예측 대상일의 기상 예보 데이터와 상기 후보 유사일들의 과거 기상 데이터를 기반으로, 유사일을 선택하는 유사일 선택 모델을 생성하는 단계((a-1) 단계), 상기 유사일의 과거 태양광 발전량 데이터와 상기 예측 대상일의 태양광 발전량 데이터 간의 차이를 기반으로, 상기 유사일 선택 모델을 강화 학습시키는 단계((a-2) 단계) 및 상기 예측 대상일의 기상 예보 데이터를 기반으로, 상기 강화 학습된 유사일 선택 모델을 통해 상기 후보 유사일들 중 하나 이상의 유사일을 선택하는 단계((a-3) 단계)를 포함할 수 있다. 또한, b) 단계는 상기 (a) 단계에 의해 선택된 유사일의 과거 태양광 발전량 데이터와 상기 예측 대상일의 기상 예보 데이터를 기반으로, 발전량 예측 모델을 생성하는 단계((b-1) 단계), 상기 발전량 예측 모델을 통해 예측 된 예측 대상일의 태양광 발전량 데이터와 과거 태양광 발전량 데이터를 비교하여, 상기 발전량 예측 모델을 검 증하는 단계((b-2) 단계) 및 상기 예측 대상일의 기상 예보 데이터를 기반으로, 상기 검증된 발전량 예측 모델 을 통해 상기 예측 대상일의 태양광 발전량을 예측하는 단계((b-3) 단계)를 포함할 수 있다. 본 발명의 실시예에 따른 강화학습 기반의 유사일을 사용한 태양광 발전량 예측 시스템 및 방법은 외부로부터 수신한 기상 데이터와 과거의 태양광 발전기의 태양광 발전량 데이터에 강화학습을 적용함으로써 예측하고자 하 는 일자와 유사한 기상을 갖는 유사일을 선택하고, 선택된 유사일을 사용하여 예측 대상일의 발전량을 예측할 수 있다. 이상에서 실시예를 통해 본 발명을 설명하였으나, 위 실시예는 단지 본 발명의 사상을 설명하기 위한 것으로 이 에 한정되지 않는다. 통상의 기술자는 전술한 실시예에 다양한 변형이 가해질 수 있음을 이해할 것이다. 본 발 명의 범위는 첨부된 특허청구범위의 해석을 통해서만 정해진다."}
{"patent_id": "10-2020-0064492", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 태양광 발전량 예측 시스템의 구성을 개략적으로 나타낸 블록도이다. 도 2는 본 발명의 일 실시예에 따른 기상 데이터 수집 모듈의 동작을 개략적으로 나타낸 도면이다. 도 3은 본 발명의 일 실시예에 따른 태양광 발전량 데이터 수집 모듈의 동작을 개략적으로 나타낸 도면이다. 도 4는 본 발명의 일 실시예에 따른 유사일 선택 모듈의 구성을 개략적으로 나타낸 블록도이다. 도 5은 유사일 선택 모델의 가치함수(DQN)의 구성을 개략적으로 나타낸 블록도이다. 도 6은 본 발명의 일 실시예에 따른 태양광 발전량 예측 모듈의 구성을 개략적으로 나타낸 블록도이다. 도 7은 태양광 발전량 예측 모델의 구성을 개략적으로 나타낸 블록도이다."}
