{"patent_id": "10-2022-0167068", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0082923", "출원번호": "10-2022-0167068", "발명의 명칭": "난소 종양 분류 방법 및 장치", "출원인": "가톨릭대학교 산학협력단", "발명자": "최윤진"}}
{"patent_id": "10-2022-0167068", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "분류장치가 주석 및 캘리퍼 중 적어도 하나를 포함하는 피 검사자의 초음파 영상을 입력 받는 단계;상기 분류장치가 상기 초음파 영상을 제1 모델에 입력하여 상기 주석 및 캘리퍼가 제거된 초음파 영상을 생성하는 단계; 상기 분류장치가 상기 주석 및 캘리퍼가 제거된 초음파 영상을 제2모델에 입력하는 단계; 및상기 분류장치가 상기 제2 모델의 출력 값을 기초로 상기 피 검사자의 난소 종양 정보를 분류하는 단계; 를 포함하는난소 종양 분류 방법."}
{"patent_id": "10-2022-0167068", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서상기 난소 종양 정보는 낭선종(Cystadenoma), 난소기형종(cystic teratoma), 자궁내막종(endometrioma), 악성종양(malignant tumor) 및 정상(normal) 중 적어도 하나를 포함하는 난소 종양 분류 방법."}
{"patent_id": "10-2022-0167068", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서 상기 제1 모델 및 제2 모델은 인공신경망으로 구현된 모델이며 상기 제1 모델은 유넷(U-net)구조로 된 컨볼루션 오토-인코더(Convolution Auto-encoder)를 포함하고상기 제2 모델은 컨볼루션 뉴럴 네트워크(Convolution neural network)을 포함하는 난소 종양 분류 방법."}
{"patent_id": "10-2022-0167068", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서상기 분류장치가 상기 제2이 모델이 상기 난소 종양 정보를 분류하기 위하여 상기 초음파 영상에서 유의하게 사용된 영역을 시각화해서 보여주는 단계; 를 더 포함하는 난소 종양 분류 방법."}
{"patent_id": "10-2022-0167068", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서상기 시각화한 영상은 Grad-CAM 모델을 이용해 상기 제2모델을 분석한 결과를 포함하는 난소 종양 분류 방법."}
{"patent_id": "10-2022-0167068", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "주석 및 캘리퍼 중 적어도 하나를 포함하는 피 검사자의 초음파 영상을 입력 받는 입력장치;상기 초음파 영상을 제1 모델에 입력하여 상기 주석 및 캘리퍼가 제거된 초음파 영상을 생성하고, 상기 주석 및캘리퍼가 제거된 초음파 영상을 제2 모델에 입력하고, 상기 제2 모델의 출력 값을 기초로 상기 피 검사자의 난소 종양 정보를 분류하는 연산장치; 공개특허 10-2024-0082923-3-상기 제1 모델 및 제2 모델을 저장하는 저장장치;난소 종양 분류 장치."}
{"patent_id": "10-2022-0167068", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서상기 난소 종양 정보는 낭선종(Cystadenoma), 난소기형종(cystic teratoma), 자궁내막종(endometrioma), 악성종양(malignant tumor) 및 정상(normal) 중 적어도 하나를 포함하는 난소 종양 분류 장치."}
{"patent_id": "10-2022-0167068", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서 상기 제1 모델 및 제2 모델은 인공신경망으로 구현된 모델이며 상기 제1 모델은 유넷(U-net)구조로 된 컨볼루션 오토-인코더(Convolution Auto-encoder)를 포함하고상기 제2 모델은 컨볼루션 뉴럴 네트워크(Convolution neural network)을 포함하는 난소 종양 분류 장치."}
{"patent_id": "10-2022-0167068", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제6항에 있어서상기 연산장치는 상기 제2이 모델이 상기 난소 종양 정보를 분류하기 위하여 상기 초음파 영상에서 유의하게 사용된 영역을 시각화해서 보여주는 난소 종양 분류 장치."}
{"patent_id": "10-2022-0167068", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제6항에 있어서상기 시각화한 영상은 Grad-CAM 모델을 이용해 상기 제2모델을 분석한 결과를 포함하는 난소 종양 분류 장치."}
{"patent_id": "10-2022-0167068", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "난소 종양 분류 방법은 분류장치가 주석 및 캘리퍼 중 적어도 하나를 포함하는 피 검사자의 초음파 영상을 입력 받는 단계; 상기 분류장치가 상기 초음파 영상을 제1 모델에 입력하여 상기 주석 및 캘리퍼가 제거된 초음파 영 상을 생성하는 단계; 상기 분류장치가 상기 주석 및 캘리퍼가 제거된 초음파 영상을 제2모델에 입력하는 단계; 및 상기 분류장치가 상기 제2 모델의 출력 값을 기초로 상기 피 검사자의 난소 종양 정보를 분류하는 단계; 를 포함한다."}
{"patent_id": "10-2022-0167068", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "이하 설명하는 기술은 학습모델을 이용해서 초음파 영상으로부터 난소종양을 분류하는 발명에 대한 것이다."}
{"patent_id": "10-2022-0167068", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "난소 종양(Ovarian tumor)는 난소에 생기는 종양을 의미한다. 난소 종양은 임상적으로 악성(malignant), 양성 (benign) 등으로 구별되는 경우도 있다. 난소 종양이 있다고 판단되면 난소 종양의 종류가 무엇인지 판단한다. 난소종양을 진단하는데 초음파 검사가 자주 이용된다. 초음파 영상은 난소 종양의 크기, 특성 등과 같은 정보를 제공하는데 이용될 수 있다. 최근 인공지능 모델이 의료 분야에서도 폭넓게 활용되면서, 인공지능 모델을 이용한 종양 예측 내지 분류 기술 이 등장하고 있다. 선행기술문헌 특허문헌(특허문헌 0001) 한국 공개특허공보 10-2021-0137828"}
{"patent_id": "10-2022-0167068", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "일반적으로 초음파 영상에는 캘리퍼(calipers)가 표시되어 있은 경우가 많다. 캘리퍼는 검사부위의 사이즈를 측 정하는데 주로 이용된다. 또한 초음파 영상에는 의료진이 초음파 영상을 보면서 주석을 다는 경우가 많다. 다만, 인공지능 모델을 학습할 때 과거에 수집된 다수의 영상을 활용하게되며 이러한 영상에는 주석과 캘리퍼가 다수 포함되어 있다. 이 영상의 주석이나 캘리퍼는 인공지능 모델 학습에 노이즈(noise) 또는 편향(bias)으로 작용하여 정확한 분류에 지장을 줄 수 있다. 이하 설명하는 기술은 초음파 영상에 표시된 캘리퍼 및 주석을 자동으로 제거하고, 자동으로 제거한 결과를 토 대로 난소 종양을 분류하는 방법을 제공한다."}
{"patent_id": "10-2022-0167068", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "난소 종양 분류 방법은 분류장치가 주석 및 캘리퍼 중 적어도 하나를 포함하는 피 검사자의 초음파 영상을 입력 받는 단계; 상기 분류장치가 상기 초음파 영상을 제1 모델에 입력하여 상기 주석 및 캘리퍼가 제거된 초음파 영 상을 생성하는 단계; 상기 분류장치가 상기 주석 및 캘리퍼가 제거된 초음파 영상을 제2모델에 입력하는 단계; 및 상기 분류장치가 상기 제2 모델의 출력 값을 기초로 상기 피 검사자의 난소 종양 정보를 분류하는 단계; 를 포함한다."}
{"patent_id": "10-2022-0167068", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이하 설명하는 기술을 이용하면 초음파 영상에서 캘리퍼 및 주석을 자동으로 제거할 수 있다. 이하 설명하는 기술을 이용하면 캘리퍼 및 주석이 제거된 초음파 영상을 기초로 난소 종양 분류할 수 있다."}
{"patent_id": "10-2022-0167068", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 설명하는 기술은 다양한 변경을 가할 수 있고 여러 가지 실시예를 가질 수 있다. 명세서의 도면에 이하 설 명하는 기술의 특정 실시 형태가 기재될 수 있다. 그러나, 이는 이하 설명하는 기술의 설명을 위한 것이며 이하 설명하는 기술을 특정한 실시 형태에 대해 한정하려는 것이 아니다. 따라서 이하 설명하는 기술의 사상 및 기술 범위에 포함되는 모든 변경, 균등 물 내지 대체물이 이하 설명하는 기술에 포함하는 것으로 이해되어야 한다. 다양한 구성요소들을 설명하기 위해서 제1, 제2 A, B 등의 용어가 사용될 수 있다. 하지만 상기 용어는 단지 하 나의 구성요소를 다른 구성요소들과 구별하기 위해서 사용될 뿐, 상기 용어로 해당 구성요소들을 한정하려고 하 는 것이 아니다. 제1, 제2, A, B 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 해당 구성요소들은 상기 용어 들에 의해 한정되지는 않으며, 단지 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 예 를 들어, 이하 설명하는 기술의 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. “및, 또는” 이라는 용어는 복수의 관련된 기 재된 항목들의 조합 또는 복수의 관련된 기재된 항목들 중의 어느 항목을 포함한다. 본 명세서에서 사용되는 용어에서 단수의 표현은 문맥상 명백하게 다르게 해석되지 않는 한 복수의 표현을 포함 하는 것으로 이해되어야 하고, \"포함한다\" 등의 용어는 설시 된 특징, 개수, 단계, 동작, 구성요소, 부분품 또 는 이들을 조합한 것이 존재함을 의미하는 것이지, 하나 또는 그 이상의 다른 특징들이나 개수, 단계 동작 구성 요 소, 부분품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 배제하지 않는 것으로 이해되어야 한다. 도면에 대한 상세한 설명을 하기에 앞서, 본 명세서에서의 구성부들에 대한 구분은 각 구성부가 담당하는 주기 능 별로 구분한 것에 불과함을 명확히 하고자 한다. 즉, 이하에서 설명할 2개 이상의 구성부가 하나의 구성부로 합쳐지거나 또는 하나의 구성부가 보다 세분화된 기능별로 2개 이상으로 분화되어 구비될 수도 있다. 그리고 이 하에서 설명할 구성 부 각각은 자신이 담당하는 주기능 이외에도 다른 구성부가 담당하는 기능 중 일부 또는 전 부의 기능을 추가적으로 수행할 수도 있으며, 구성 부 각각이 담당하는 주기능 중 일부 기능이 다른 구성부에의 해 전담되어 수행될 수도 있음은 물론이다. 또, 방법 또는 동작 방법을 수행함에 있어서, 상기 방법을 이루는 각 과정들은 문맥상 명백하게 특정 순서를 기 재하지 않은 이상 명기된 순서와 다르게 일어날 수 있다. 즉, 각 과정들은 명기된 순서와 동일하게 일어날 수도 있고 순서대로 진행될 수 있다. 이하 난소 종양 분류 장치(이하 분류장치)가 난소종양을 분류하는 과정을 설명한다. 도1은 분류장치가 난소종양을 분류하는 전체적인 과정을 보여준다. 분류장치는 피 검사자의 초음파 영상을 입력 받을 수 있다. 분류장치는 입력 받은 초음파 영상을 제1 모델에 입력할 수 있다. 분류장치는 제1모델의 출력 값을 제2모델에 입력할 수 있다. 분류장치는 제2 모델의 출력 값을 기초로 피 검사자의 난소 종양 정보를 출력할 수 있다. 초음파 영상은 난소 종양 판단에 불필요한 정보가 포함되어 있을 수 있다. 초음파 영상에는 캘리퍼(calipers) 및 주석(annotation) 중 적어도 하나가 표시되어 있을 수 있다. 제1 모델은 초음파 영상에 표시된 캘리퍼 및 주석을 제거하는 모델일 수 있다. 제1 모델은 오토-인코더(Auto- Encoder) 또는 U-Net으로 구현된 모델일 수 있다. 제1모델이 구현된 하나의 실시예에 대해선 아래에서 설명한다. 제2모델은 초음파 영상에 난소 종양을 나타내는 영역이 있는지 분류하여 피 검사자의 난소 종양 정보를 출력하 는 모델일 수 있다. 초음파 영상은 CNN(Convolution neural network)으로 구현된 모델일 수 있다. 제2 모델이 구현된 하나의 실시예에 대해선 아래에서 설명한다. 난소 종양 정보는 낭선종(Cystadenoma), 난소기형종(Cystic teratoma), 자궁내막종(endometrioma), 암(cancer) 및 정상(normal)을 포함할 수 있다. 분류장치는 상기 제2이 모델이 상기 난소 종양 대한 정보를 분류하기 위하여 상기 초음파 영상에서 유의하게 사 용된 영역을 시각화해서 보여줄 수 있다. 분류장치는 설명가능한 인공지능 기법(Explainable Artificial Intelligence, XAI)을 이용해서 유의하게 사용 된 영역을 시각화해서 보여줄 수 있다. 설명가능한 인공지능 기법에는 Grad-CAM(Class Activation Map)이 포함 되어 있을 수 있다. 이하 모델을 구현하는데 이용된 데이터를 확보하는 과정, 모델의 실시예 및 모델의 성능을 평가한 결과에 대하 여 살펴본다. 이하 제1 모델 및 제2 모델을 구축할 때 이용한 데이터를 확보하는 과정에 대하여 설명한다. 도2는 모델 구축에 사용되는 난소 종양 데이터를 확보하는 과정을 보여준다. 난소 종양 데이터는 2010년 1월부터 2020년 3월까지 서울 성모병원(St. Mary's Hospital)을 방문한 1154명의 환자의 초음파 영상 1613개를 포함할 수 있다(S210). 환자의 초음파 영상은 캘리퍼 및 주석이 표시되어 있을 수 있다. 주석은 환자 식별(Patient identification) 정보, 환자 이름(Patient Name), 측정된 시간(Time stamp)에 대한 정보가 포함되어 있을 수 있다. 환자의 초음파 영상은 5가지로 분류할 수 있다. 첫번째는 정상(Normal)이다. 두번째는 낭선종(Cystadenoma)이다. 세번째는 난소기형종(cystic teratoma)이다. 네번째는 자궁내막종(endometrioma)이다. 다섯 번째는 암(Cancer)이다(S220). 초음파 영상은 초음파 영상 외의 부분을 제외(Crop out)할 수 있다(S230). 초음파 영상은 영상의 해상도가 360 x 360이 되도록 재구축 될 수 있다(S240). 난소 종양 데이터는 초음파 영상을 처리하여 데이터 증강(Data Augmentation)이 될 수 있다. 데이터 증강을 위 해서 회전(rotation) 또는 뒤집기(Flip)을 이용할 수 있다(S250). 더 나아가 초음파 영상은 영상의 픽셀 값이 0부터 1사이 값을 가지도록 조절할 수 있다. 이하 제1 모델에 대하여 살펴본다. 도3은 몇몇 실시예에 따른 제1 모델 예를 보여준다. 제1 모델은 초음파 영상에 표시된 캘리퍼 및 주석을 제거하는 모델일 수 있다. 제1 모델은 U-net기반 모델일 수 있다. 제1모델은 오토-인코더 또는 U-net로 구현된 모델일 수 있다. 제1 모델은 초음파 영상에서 특징을 추출하는 제1 경로와 추출된 특징으로부터 영상을 재구성하는 제2 경로로 나누어질 있다. 제1 모델은 제1 경로의 각 단계에서 계산된 값을 제2 경로의 각 단계에 입력되도록 구성될 수 있다 (Copy & Concatenation). 제1 모델은 캘리퍼 및 주석 주 적어도 하나가 표시된 영상(Image with mark)을 입력 받을 수 있다. 제1모델에 입력되는 영상은 360 x 360 크기를 가지는 영상일 수 있다. 제1 모델은 캘리퍼 및 주석이 제거된 영상(Image without mark)을 출력할 수 있다. 제1모델이 출력하는 영상은 360 x 360 크기를 가지는 영상일 수 있다. 제1 모델은 컨볼루션 레이어(Con2d), 스퀴즈 익스텐션 레이어(SEB Block), 평균 풀링 레이어(AvgPool), 다이레 이트 컨볼루션 레이어(Dilated Conv2d), 컨볼루션 트랜스포즈 레이어(Conv Transpose)를 포함할 수 있다. 컨볼루션 레이어는 컨볼루션 연산(convolution)을 수행할 수 있다. 컨볼루션 레이어는 2D 컨볼루션 연산을 수행 할 수 있다. 즉 컨볼루션 레이어는 컨볼루션 연산을 통해서 영상에서 특징을 추출할 수 있다. 컨볼루션 레이어 의 필터의 크기는 3x3 일 수 있다. 스퀴즈 익스텐션 레이어는 스퀴즈 & 엑사이티드(Squeeze & Excitation)연산을 수행할 수 있다. 스퀴즈 엑사이티 드 레이어는 스퀴즈&엑사이티드 연산을 통해서 입력정보에 서로 다른 가중치를 부여할 수 있다. 평균 풀링 레이어는 입력 값에서 특정 값을 강조하기 위해서 입력 영상에서 일정 영역에 해당하는 값의 평균을 계산할 수 있다. 평균 풀링 레이어의 필터의 크기는 2x2일 수 있다. 다이아레이트(Dilated) 컨볼루션 레이어는 내부에 Zero 패딩을 추가한 컨볼루션 필터를 이용해서 컨볼루션 연산 을 수행할 수 있다. 다이아레이트 컨볼루션 레이어는 컨볼루션 레이어보다 넓은 범위의 특징을 잡아낼 수 있다. 다이아레이트 컨볼루션 레이어는 다양한 Dilation value값을 이용해 연산을 수행할 있다. 컨볼루션 트랜스포즈(Transpose) 레이어는 컨볼루션 레이어와는 다르게 up-sampling하기 위하여 주로 사용된다. 컨볼루션 트랜스포즈 레이어의 필터의 크기는 2x2일 수 있다. 이하 제2 모델에 대하여 살펴본다. 도4는 몇몇 실시예에 따른 제2 모델 예를 보여준다. 제2모델은 초음파 영상에 난소 종양을 나타내는 영역이 있는지 분류하여 피 검사자의 난소 종양 정보를 출력하 는 모델일 수 있다. 제2 모델은 피 검사자의 난소 종양 정보를 출력할 수 있다. 예를 들어 제2 모델은 입력 받은 영상이 5개의 분류 중 하나에 속할 확률을 계산할 수 있다. 각 분류는 정상 (normal), 낭선종(Cystadenoma), 난소기형종(Cystic teratoma), 자궁내막종(endometrioma) 및 암(cancer)이 포 함할 수 있다. 제2 모델은 CNN(Convolution neural network)일 수 있다. 제2 모델은 제1 모델의 출력 값을 입력 받을 수 있다. 다시 말하면 제2 모델은 캘리퍼 및 주석이 제거된 영상 (Image without mark)을 입력 받을 수 있다. 제2 모델은 컨볼루션 레이어(Conv2d), 최대 풀링 레이어(Max Pool2d), 밀도 레이어(Dense Block), 트랜지션 레 이어(Transition layer), 전역 평균 레이어(Global Ave Pool 2d), 완전 연결 레이어(Fully Connected layer)을 포함할 수 있다. 밀도 레이어는 종래 알려진 모델을 이용할 수 있다. 종래 알려진 모델로는 DenseNet121 및 Dense161이 포함되어 있을 수 있다. 이하 제1 모델의 성능을 평가한 결과에 대하여 살펴본다. 도5는 몇몇 실시예에 따른 제1 모델의 성능을 보여주는 예이다. 도5 Before CAE는 제1 모델이 입력 받은 초음파 영상일 수 있다. 도5 After CAE는 제1 모델이 출력하는 초음파 영상일 수 있다. 도5 Normal는 난소 종양이 없는 정상적인 환자의 초음파 영상이다. 도5 Cystadenoma는 낭선종이 있는 환자의 초 음파 영상이다. 도5 Cystic teratoma는 난소기형종이 있는 환자의 초음파 영상이다. 도5 Endometrioma는 자궁내 막종이 있는 환자의 초음파 영상이다. 도5 Cancer는 난소암이 있는 환자의 초음파 영상이다. 화살표는 초음파 영상에 포함된 캘리퍼 또는 주석을 가리킬 수 있다. 도5 After CAE의 초음파 영상은 도5 Before CAE 와 비교해 볼 때 캘리퍼 및 주석이 없다. 즉 도5는 제1 모델이 초음파 영상에서 캘리퍼 및 주석을 잘 제거할 수 있다는 것을 보여준다. 이하 제2모델의 성능을 평가한 결과에 대하여 살펴본다. 도6은 몇몇 실시예에 따른 제2 모델의 성능을 보여주는 예이다. 제2 모델의 성능평가는 모델이 초음파 영상을 Normal(정상), Cystadenoma(낭선종), Mature cystic teratoma(성 숙 난소기형종), Endometrioma(자궁내막종) 및 악성종양 (Malignancy)로 잘 분류하는 지로 수행하였다. 도6 Confusion Matrix의 X축은 모델이 예측한 결과를 보여준다. 도6 Confusion Matrix의 Y축은 실제 분류된 질 병의 종류를 보여준다. Confusion Matrix 및 ROC(Receiver operating characteristic)을 통해 제2 모델이 초음파 영상을 얼마나 잘 분 류하는지 보여준다. 도6 (A)는 제2 모델의 Dense Block을 DenseNet121로 구현했을 때의 결과를 보여준다. 도6 (B)는 제2 모델의 Dense Block을 DenseNet161로 구현했을 때의 결과를 보여준다. Confusion matrix는 제2 모델이 초음파 영상을 악성종양(Malignancy)로 분류하는 성능이 가장 좋은 것을 보여준 다. 분류성능은 도6 (A)에서는 83.7%, (B)에서는 86.6%인 것을 확인할 수 있다. 또한 Confusion matrix는 초음 파 영상을 악성 종양 외 다른 클래스로 분류하는 성능도 나쁘지 않다는 것을 보여준다(70~80%). 도6 ROC는 제2 모델이 초음파 영상을 각 클래스에 얼마나 잘 분류하는 지를 보여준다. 각 클래스에 대한 AUC값 은 0.89 내지 0.98인 것을 확인할 수 있다. 도6의 결과를 통하여 제2 모델이 초음파 영상을 잘 분류하는 것을 확인할 수 있다. 이하 분류장치가 제2 모델이 난소 종양 정보를 분류하기 위하여 초음파 영상에서 유의하게 사용된 영역을 시각 화해서 보여준 결과를 살펴본다. 도7은 몇몇 실시예에 따른 시각화한 결과를 보여주는 예이다. Ultrasonogram image는 제2 모델에 입력되는 초음파 영상을 보여준다. 도7에서 Grad-Cam은 설명 가능한 인공지능 기법을 이용해 제2 모델이 어느 영역을 중심으로 판단하였는지 보여 준다. 설명 가능한 인공지능 기법은 Grad-CAM(Gradient-weighted Class Activation Mapping)일 수 있다. 도7에서 파란색으로 표시된 영역은 제2 모델이 난소 종양을 분류하기 위해서 덜 중요하게 살펴본 영역을 보여준 다. 도7에서 빨간색으로 표시된 영역은 제2 모델이 난소 종양을 분류하기 위해서 중요하게 살펴본 영역을 보여 준다. 도7에서 Before CAE는 제1 모델에 입력하지 않는 초음파 영상을 의미한다. 도7에서 After CAE는 제1 모델에 입 력하여 출력한 초음파 영상을 의미한다. 다시 말하면 도7의 결과는 캘리퍼 및 주석이 표시된 영상이 바로 제2 모델이 입력된 경우와 제1모델을 이용해서 캘리퍼 및 주석이 제거된 영상이 제2 모델이 입력되었을 때를 비교한 결과일 수 있다. 빨간색 동그라미로 표시된 영역은 캘리퍼 및 주석이 있는 영역일 수 있다. Grad-CAM의 결과에서 볼 수 있듯이 캘리퍼 및 주석이 표시된 영상(Before CAE)이 제2 모델에 입력되면 제2 모델 은 초음파 및 주석이 표시된 영역을 고려해서 판단한다. 다시 말하면 초음파 영상에 표시된 캘리퍼 및 주석은 제2모델의 판단에 잘못된 영향을 줄 수 있다는 것을 보여준다. 반면 캘리퍼 및 주석이 제거된 영상(After CAE)이 제2 모델에 입력되면, 제2 모델은 초음파 영상에서 난소종양 이 있을 것으로 의심되는 영역을 중심으로 판단한다. 도7은 초음파 영상에 표시된 캘리퍼 및 주석은 제2 모델이 난소 종양을 판단하는데 방해가 되는 것을 보여준다. 또한 도7은 제1 모델을 통하여 초음파 영상에서 캘리퍼 및 주석이 제거되어야 제2 모델이 난소 종양을 판단하는 데 도움이 되는 것을 보여준다. 이하 분류장치의 구성에 대해 살펴본다. 도8은 몇몇 실시예에 따른 난소 종양 분류장치의 구성의 예이다. 도8의 난소종양 분류장치는 도1의 분류장치와 동일하다. 난소종양 분류장치는 PC, 노트북, 서버 또는 데이터 처리 전용 칩셋 등과 같이 물리적으로 다양한 형태로 구현될 수 있다. 난소종양 분류장치는 입력장치, 저장장치, 연산장치, 출력장치, 인터페이스 장치 및 통신장치를 포함할 수 있다. 입력장치는 일정한 명령 또는 데이터를 입력 받는 인터페이스 장치(키보드, 마우스, 터치스크린 등)를 포 함할 수도 있다. 입력장치는 별도의 저장장치(USB, CD, 하드디스크 등)을 통하여 정보를 입력 받는 구성을 포함할 수도 있다. 입력장치는 입력 받는 데이터를 별도의 측정장치를 통하여 입력 받을 수 있다. 입력장 치는 별도의 DB을 통하여 데이터를 입력 받을 수도 있다. 입력장치는 피 검사자의 초음파 영상을 입 력 받을 수 있다. 입력장치가 입력 받는 초음파 영상은 주석 및 캘리퍼가 포함되어 있을 수 있다. 저장장치은 입력장치로부터 온 정보를 저장할 수도 있다. 저장장치는 제1 모델 및 제2모델을 저 장할 수 있다. 저장장치는 연산장치가 연산하는 과정에서 생성한 데이터를 저장할 수 있다. 저장장치 는 연산장치가 연산한 결과를 저장할 수 있다. 연산장치는 입력장치가 입력 받은 피 검사자의 초음파 영상을 제1모델에 입력할 수 있다. 연산장치 는 제1모델의 출력 값을 제2모델에 입력할 수 있다. 연산장치는 제2모델의 출력 값을 기초로 피 검사 자의 난소 종양을 분류할 수 있다. 연산장치가 이용하는 제1 모델은 도1에서 설명한 제1 모델일 수 있다. 즉 제1 모델은 초음파 영상에서 캘 리퍼 및 주석을 제거하는 모델일 수 있다. 연산장치가 이용하는 제2 모델은 도1에서 설명한 제2 모델일 수 있다. 즉 제2 모델은 초음파 영상을 기초 로 피 검사자의 난소 종양 정도를 분류하는 모델일 수 있다. 연산장치는 상기 제2 모델이 상기 난소 종양 정보를 분류하기 위하여 초음파 영상에서 유의하게 사용된 영 역을 시각화 할 수 있다. 연산장치가 시각화한 결과는 출력장치를 통해 출력될 수 있다. 연산장치 는 시각화를 위해서 Grad-CAM을 이용할 수 있다. 출력장치는 일정한 정보를 출력하는 장치가 될 수도 있다. 출력장치은 데이터 처리 과정에 만들어진 데이터, 분류결과 등을 출력할 수도 있다. 출력장치은 디스플레이, 문서를 출력하는 장치, 등과 같이 물리 적으로 다양한 형태로 구현될 수도 있다. 인터페이스 장치는 외부로부터 일정한 명령 및 데이터를 입력 받는 장치일 수 있다. 인터페이스 장치(85 0)는 물리적으로 연결된 입력 장치 또는 외부 저장장치로부터 피 검사자의 초음파 영상을 입력 받을 수 있다. 인터페이스 장치는 난소 종양을 분류한 결과를 다른 객체에 전달할 수도 있다. 한편 인터페이스 장치(85 0)는 통신장치가 수신하는 데이터를 입력 받는 구성을 포함할 수 있다. 통신장치는 유선 또는 무선 네트워크를 통해 일정한 정보를 수신하고 전송하는 구성을 포함할 수 있다. 통 신장치는 외부 객체로부터 환자의 초음파 영상을 수신할 수 있다. 통신장치는 또한 통신장치는 난소 종양을 분류한 결과를 외부 객체에 송신할 수 있다. 난소 종양 분류방법은 컴퓨터에서 실행될 수 있는 실행가능한 알고리즘을 포함하는 프로그램(또는 어플리케이션)으로 구현될 수 있다. 상기 프로그램은 일시적 또는 비일시적 판독 가능 매체(non-transitory computer readable medium)에 저장되어 제공될 수 있다. 비일시적 판독 가능 매체 란 레지스터, 캐쉬, 메모리 등과 같이 짧은 순간 동안 데이터를 저장하는 매체가 아니 라 반영구적으로 데이터를 저장하며, 기기에 의해 판독(reading)이 가능한 매체를 의미한다. 구체적으로는, 상술한 다양한 어플리케이션 또는 프로그램들은 CD, DVD, 하드 디스크, 블루레이 디스크, USB, 메모리카드, ROM (read-only memory), PROM (programmable read only memory), EPROM(Erasable PROM, EPROM) 또는 EEPROM(Electrically EPROM) 또는 플래시 메모리 등과 같은 비일시적 판독 가능 매체에 저장되어 제공될 수 있다. 일시적 판독 가능 매체는 스태틱 램(Static RAM，SRAM), 다이내믹 램(Dynamic RAM，DRAM), 싱크로너스 디램 (Synchronous DRAM，SDRAM), 2배속 SDRAM(Double Data Rate SDRAM，DDR SDRAM), 증강형 SDRAM(Enhanced SDRAM ，ESDRAM), 동기화 DRAM(Synclink DRAM，SLDRAM) 및 직접 램버스 램(Direct Rambus RAM，DRRAM) 과 같은 다양 한 RAM을 의미한다. 본 실시예 및 본 명세서에 첨부된 도면은 전술한 기술에 포함되는 기술적 사상의 일부를 명확하게 나타내고 있 는 것에 불과하며, 전술한 기술의 명세서 및 도면에 포함된 기술적 사상의 범위 내에서 당업자가 용이하게 유추 할 수 있는 변형 예와 구체적인 실시예는 모두 전술한 기술의 권리범위에 포함되는 것이 자명하다고 할 것이다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8"}
{"patent_id": "10-2022-0167068", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도1은 분류장치가 난소종양을 분류하는 전체적인 과정을 보여준다. 도2는 모델 구축에 사용되는 난소 종양 데이터를 확보하는 과정을 보여준다. 도3은 몇몇 실시예에 따른 제1모델의 예이다. 도4는 몇몇 실시예에 따른 제2모델의 예이다. 도5는 몇몇 실시예에 따른 제1모델의 성능을 보여주는 예이다. 도6은 몇몇 실시예에 따른 제2모델의 성능을 보여주는 예이다. 도7은 몇몇 실시예에 따른 시각화한 결과를 보여주는 예이다. 도8은 난소 종양 분류 장치의 구성을 보여준다."}
