{"patent_id": "10-2020-0111929", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0030120", "출원번호": "10-2020-0111929", "발명의 명칭": "증강된 일관성 정규화를 이용한 음성 인식 모델 학습 방법 및 시스템", "출원인": "네이버 주식회사", "발명자": "김희수"}}
{"patent_id": "10-2020-0111929", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "적어도 하나의 프로세서에 의해 수행되는 음성 인식 모델 학습 방법에 있어서,레이블이 할당되지 않은 복수의 음성 샘플을 수신하는 단계;음성 인식 모델을 이용하여 상기 복수의 음성 샘플로부터 휴먼 레이블링(human labeling)을 위한 제1 세트의 음성 샘플을 추출하는 단계;상기 제1 세트의 음성 샘플과 대응되는 제1 세트의 레이블을 수신하는 단계;상기 음성 인식 모델을 이용하여 상기 복수의 음성 샘플로부터 머신 레이블링(machine labeling)을 위한 제2 세트의 음성 샘플을 추출하는 단계;상기 음성 인식 모델을 이용하여 상기 제2 세트의 음성 샘플과 대응되는 제2 세트의 레이블을 결정하는 단계;상기 제2 세트의 음성 샘플을 증강(augment)하는 단계; 및상기 제1 세트의 음성 샘플, 상기 제1 세트의 레이블, 상기 증강된 제2 세트의 음성 샘플 및 상기 제2 세트의레이블에 기초하여 준지도 학습(semi-supervised learning)을 수행하여 상기 음성 인식 모델을 업데이트하는 단계를 포함하는, 음성 인식 모델 학습 방법."}
{"patent_id": "10-2020-0111929", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제2 세트의 음성 샘플을 증강하는 단계는,상기 제2 세트의 음성 샘플에 대해 피치 시프팅(pitch shifting)을 수행하는 단계를 포함하는, 음성 인식 모델 학습 방법."}
{"patent_id": "10-2020-0111929", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 제2 세트의 음성 샘플을 증강하는 단계는,상기 제2 세트의 음성 샘플에 대해 타임 스케일링(time scaling)을 수행하는 단계를 포함하는, 음성 인식 모델 학습 방법."}
{"patent_id": "10-2020-0111929", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 제2 세트의 음성 샘플을 증강하는 단계는,상기 제2 세트의 음성 샘플에 가산성 백색 가우시안 노이즈(Additive White Gaussian Noise)를 추가하는 단계를 포함하는, 음성 인식 모델 학습 방법."}
{"patent_id": "10-2020-0111929", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 음성 인식 모델을 이용하여 상기 복수의 음성 샘플로부터 휴먼 레이블링을 위한 제1 세트의 음성 샘플을추출하는 단계는,공개특허 10-2022-0030120-3-상기 음성 인식 모델을 이용하여 상기 복수의 음성 샘플 각각의 불확실성 스코어(uncertainty score)를 산출하는 단계; 및상기 복수의 음성 샘플 중 가장 높은 불확실성 스코어를 가지는 미리 결정된 개수의 음성 샘플을 상기 제1 세트의 음성 샘플로 추출하는 단계를 포함하는, 음성 인식 모델 학습 방법."}
{"patent_id": "10-2020-0111929", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 음성 인식 모델을 이용하여 상기 복수의 음성 샘플로부터 머신 레이블링을 위한 제2 세트의 음성 샘플을추출하는 단계는,상기 복수의 음성 샘플 중 미리 결정된 임계치 이하의 불확실성 스코어를 가지는 적어도 하나의 음성 샘플을 상기 제2 세트의 음성 샘플로 추출하는 단계를 포함하는, 음성 인식 모델 학습 방법."}
{"patent_id": "10-2020-0111929", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5항에 있어서,상기 불확실성 스코어는 상기 음성 인식 모델에 의해 출력되는 텍스트 시퀀스의 길이 정규화된 결합 확률(length-normalized joint probability)을 나타내는, 음성 인식 모델 학습 방법."}
{"patent_id": "10-2020-0111929", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 음성 인식 모델을 업데이트하는 단계는,상기 음성 인식 모델에 의해 예측되는 상기 제1 세트의 음성 샘플과 대응되는 제1 세트의 출력 데이터, 그리고상기 제1 세트의 레이블 사이의 차이가 최소화되도록 상기 음성 인식 모델을 업데이트하는 단계를 포함하는, 음성 인식 모델 학습 방법."}
{"patent_id": "10-2020-0111929", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 음성 인식 모델을 업데이트하는 단계는,상기 음성 인식 모델에 의해 예측되는 상기 증강된 제2 세트의 음성 샘플과 대응되는 제2 세트의 출력 데이터,그리고 상기 제2 세트의 레이블 사이의 차이가 최소화되도록 상기 음성 인식 모델을 업데이트 하는 단계를 더 포함하는, 음성 인식 모델 학습 방법."}
{"patent_id": "10-2020-0111929", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 제1 세트의 출력 데이터와 상기 제1 세트의 레이블 사이의 차이, 그리고 상기 제2 세트의 출력 데이터와상기 제2 세트의 레이블 사이의 차이는, 표준 크로스-엔트로피 손실 함수(standard cross-entropy lossfunction)에 의해 산출되는, 음성 인식 모델 학습 방법."}
{"patent_id": "10-2020-0111929", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서,상기 음성 인식 모델은 지도 학습(supervised learning)을 수행하여 생성된 인공신경망 모델인, 음성 인식 모델학습 방법.공개특허 10-2022-0030120-4-청구항 12 제1항에 있어서,상기 휴먼 레이블링을 위한 제1 세트의 음성 샘플의 수가 상기 머신 레이블링을 위한 제2 세트의 음성 샘플의수보다 적은, 음성 인식 모델 학습 방법."}
{"patent_id": "10-2020-0111929", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제1항에 있어서,상기 제1 세트의 레이블은 사람에 의해 생성된 정답 레이블인, 음성 인식 모델 학습 방법."}
{"patent_id": "10-2020-0111929", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제1항에 있어서,상기 제2 세트의 레이블은 상기 음성 인식 모델에 의해 예측된 수도 레이블(pseudo label)인, 음성 인식 모델학습 방법."}
{"patent_id": "10-2020-0111929", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제1항 내지 제14항 중 어느 한 항에 따른 음성 인식 모델 학습 방법을 컴퓨터에서 실행하기 위해 컴퓨터 판독가능한 기록 매체에 저장된 컴퓨터 프로그램."}
{"patent_id": "10-2020-0111929", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "음성 인식 모델 학습 시스템으로서,통신 모듈;메모리; 및상기 메모리와 연결되고, 상기 메모리에 포함된 컴퓨터 판독 가능한 적어도 하나의 프로그램을 실행하도록 구성된 적어도 하나의 프로세서를 포함하고,상기 적어도 하나의 프로그램은,레이블링 되지 않은 복수의 음성 샘플을 수신하고,음성 인식 모델을 이용하여 상기 복수의 음성 샘플로부터 휴먼 레이블링을 위한 제1 세트의 음성 샘플을 추출하고,상기 제1 세트의 음성 샘플과 대응되는 제1 세트의 레이블을 수신하고,상기 음성 인식 모델을 이용하여 상기 복수의 음성 샘플로부터 머신 레이블링을 위한 제2 세트의 음성 샘플을추출하고,상기 음성 인식 모델을 이용하여 상기 제2 세트의 음성 샘플과 대응되는 제2 세트의 레이블을 결정하고,상기 제2 세트의 음성 샘플을 증강하고,상기 제1 세트의 음성 샘플, 상기 제1 세트의 레이블, 상기 증강된 제2 세트의 음성 샘플 및 상기 제2 세트의레이블에 기초하여 준지도 학습을 수행하여 상기 음성 인식 모델을 업데이트하기 위한 명령어들을 포함하는, 음성 인식 모델 학습 시스템."}
{"patent_id": "10-2020-0111929", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 음성 인식 모델 학습 방법에 관한 것이다. 음성 인식 모델 학습 방법은 레이블이 할당되지 않은 복수 의 음성 샘플을 수신하는 단계, 음성 인식 모델을 이용하여 복수의 음성 샘플로부터 휴먼 레이블링(human labeling)을 위한 제1 세트의 음성 샘플을 추출하는 단계, 제1 세트의 음성 샘플과 대응되는 제1 세트의 레이블 을 수신하는 단계, 음성 인식 모델을 이용하여 복수의 음성 샘플로부터 머신 레이블링(machine labeling)을 위한 제2 세트의 음성 샘플을 추출하는 단계, 음성 인식 모델을 이용하여 제2 세트의 음성 샘플과 대응되는 제2 세트 의 레이블을 결정하는 단계, 제2 세트의 음성 샘플을 증강(augment)하는 단계 및 제1 세트의 음성 샘플, 제1 세 트의 레이블, 증강된 제2 세트의 음성 샘플 및 제2 세트의 레이블에 기초하여 준지도 학습(semi-supervised learning)을 수행하여 음성 인식 모델을 업데이트하는 단계를 포함한다."}
{"patent_id": "10-2020-0111929", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 음성 인식 모델 학습 방법 및 시스템에 관한 것으로, 구체적으로 증강된 일관성 정규화를 이용한 효 율적인 점진적 음성 인식 모델 학습 방법 및 시스템에 관한 것이다."}
{"patent_id": "10-2020-0111929", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공지능 기술 및 IoT(Internet Over Things) 기술의 급격한 발전으로 인해, 사용자의 음성 요청에 대응하는 특 정 서비스를 사용자에게 제공하는 지능형 개인 또는 가상 비서(Intelligent Personal Assistant)를 탑재한 인공 지능 스피커, 스마트폰 등과 같은 단말이 널리 이용되고 있다. 이러한 지능형 개인 비서는 인공지능 음성 인식 기술을 이용해 사용자의 음성 명령을 인식하고, 음성 명령에 대응하는 서비스를 제공하고 있다. 예를 들어, 인 공지능 스피커는 사용자의 음성 명령을 통해 전화를 걸 수 있는 것은 물론이고, 특정 애플리케이션을 실행하거 나, 날씨 정보를 제공하거나, 인터넷 검색을 통한 정보를 제공하는 등의 서비스를 제공할 수 있다. 이러한 음성 인식 서비스의 품질을 향상시키기 위해서는 수많은 학습 데이터를 이용하여 계속해서 음성 인식 모 델을 업데이트해야 한다. 종래의 기술에서는, 음성 인식 모델을 학습하기 위해 인간 주해자(human annotator) 가 직접 수많은 음성 샘플에 대하여 정답 레이블을 결정해야 하므로 많은 비용이 든다는 문제가 있다."}
{"patent_id": "10-2020-0111929", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 상기와 같은 문제를 해결하기 위한 음성 인식 모델 학습 방법, 기록 매체에 저장된 컴퓨터 프로그램 및 장치(시스템)를 제공한다."}
{"patent_id": "10-2020-0111929", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시는 방법, 장치(시스템) 또는 판독 가능 저장 매체에 저장된 컴퓨터 프로그램을 포함한 다양한 방식으로 구현될 수 있다. 본 개시의 일 실시예에 따르면, 적어도 하나의 프로세서에 의해 수행되는 음성 인식 모델 학습 방법은 레이블이 할당되지 않은 복수의 음성 샘플을 수신하는 단계, 음성 인식 모델을 이용하여 복수의 음성 샘플로부터 휴먼 레 이블링(human labeling)을 위한 제1 세트의 음성 샘플을 추출하는 단계, 제1 세트의 음성 샘플과 대응되는 제1 세트의 레이블을 수신하는 단계, 음성 인식 모델을 이용하여 복수의 음성 샘플로부터 머신 레이블링(machine labeling)을 위한 제2 세트의 음성 샘플을 추출하는 단계, 음성 인식 모델을 이용하여 제2 세트의 음성 샘플과 대응되는 제2 세트의 레이블을 결정하는 단계, 제2 세트의 음성 샘플을 증강(augment)하는 단계 및 제1 세트의 음성 샘플, 제1 세트의 레이블, 증강된 제2 세트의 음성 샘플 및 제2 세트의 레이블에 기초하여 준지도 학습 (semi-supervised learning)을 수행하여 음성 인식 모델을 업데이트하는 단계를 포함한다. 본 개시의 일 실시예에 따른 음성 인식 모델 학습 방법을 컴퓨터에서 실행하기 위해 컴퓨터 판독 가능한 기록 매체에 저장된 컴퓨터 프로그램이 제공된다. 본 개시의 일 실시예에 따른 음성 인식 모델 학습 시스템은, 통신 모듈, 메모리 및 메모리와 연결되고, 메모리 에 포함된 컴퓨터 판독 가능한 적어도 하나의 프로그램을 실행하도록 구성된 적어도 하나의 프로세서를 포함한 다. 적어도 하나의 프로그램은, 레이블링 되지 않은 복수의 음성 샘플을 수신하고, 음성 인식 모델을 이용하 여 복수의 음성 샘플로부터 휴먼 레이블링을 위한 제1 세트의 음성 샘플을 추출하고, 제1 세트의 음성 샘플과 대응되는 제1 세트의 레이블을 수신하고, 음성 인식 모델을 이용하여 복수의 음성 샘플로부터 머신 레이블링을 위한 제2 세트의 음성 샘플을 추출하고, 음성 인식 모델을 이용하여 제2 세트의 음성 샘플과 대응되는 제2 세트 의 레이블을 결정하고, 제2 세트의 음성 샘플을 증강하고, 제1 세트의 음성 샘플, 제1 세트의 레이블, 증강된 제2 세트의 음성 샘플 및 제2 세트의 레이블에 기초하여 준지도 학습을 수행하여 음성 인식 모델을 업데이트하 기 위한 명령어들을 포함한다."}
{"patent_id": "10-2020-0111929", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 다양한 실시예에서 음성 인식 모델을 학습하기 위해 인간이 직접 텍스트 시퀀스로 전사해야 하는 음 성 샘플의 수를 줄여, 비용은 절감하면서, 음성 인식 모델의 성능 저하가 거의 없도록 할 수 있다. 구체적으로, 레이블링 비용을 2/3 가량 절감하면서, 글자 수준 오류율(character-level error rate; CER)은 약 0.26 %p만 증가(즉, 성능 저하)하고, 레이블링 비용을 약 6/7 가량 절감하면서, CER은 약 1.08 %p만 증가하는 것이 가능하다. 본 개시의 다양한 실시예에서 음성 샘플에 대한 텍스트 시퀀스의 결합 확률을 고려한 불확실성 스코어를 산출할 수 있으며, 불확실성 스코어를 기준으로 음성 인식 모델을 학습하는데 유용한 샘플(informative sample)을 추출 할 수 있다. 본 개시의 다양한 실시예에서 음성 샘플에 포함된 언어 정보를 손상시키지 않으면서 음성 샘플을 증강(augmen t)할 수 있으며, 이러한 음성 샘플의 증강은 음성 인식 모델 학습의 효율성을 향상시킬 수 있다. 또한, 증강된 음성 샘플을 이용하여 음성 인식 모델의 강인성을 향상시킬 수 있다."}
{"patent_id": "10-2020-0111929", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 개시의 실시를 위한 구체적인 내용을 첨부된 도면을 참조하여 상세히 설명한다. 다만, 이하의 설명에 서는 본 개시의 요지를 불필요하게 흐릴 우려가 있는 경우, 널리 알려진 기능이나 구성에 관한 구체적 설명은 생략하기로 한다. 첨부된 도면에서, 동일하거나 대응하는 구성요소에는 동일한 참조부호가 부여되어 있다. 또한, 이하의 실시예 들의 설명에 있어서, 동일하거나 대응되는 구성요소를 중복하여 기술하는 것이 생략될 수 있다. 그러나, 구성 요소에 관한 기술이 생략되어도, 그러한 구성요소가 어떤 실시예에 포함되지 않는 것으로 의도되지는 않는다. 개시된 실시예의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 후술되어 있는 실시예 들을 참조하면 명확해질 것이다. 그러나, 본 개시는 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 개시가 완전하도록 하고, 본 개시가 통상의 기술 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것일 뿐이다. 본 명세서에서 사용되는 용어에 대해 간략히 설명하고, 개시된 실시예에 대해 구체적으로 설명하기로 한다. 본 명세서에서 사용되는 용어는 본 개시에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 관련 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 발명의 설명 부분에서 상세히 그 의미를 기재할 것이다. 따라서, 본 개시에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어 가 가지는 의미와 본 개시의 전반에 걸친 내용을 토대로 정의되어야 한다. 본 명세서에서의 단수의 표현은 문맥상 명백하게 단수인 것으로 특정하지 않는 한, 복수의 표현을 포함한다. 또한, 복수의 표현은 문맥상 명백하게 복수인 것으로 특정하지 않는 한, 단수의 표현을 포함한다. 명세서 전체에서 어떤 부분이 어떤 구성요소를 포함한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있음을 의미한다. 또한, 명세서에서 사용되는 '모듈' 또는 '부'라는 용어는 소프트웨어 또는 하드웨어 구성요소를 의미하며, '모 듈' 또는 '부'는 어떤 역할들을 수행한다. 그렇지만, '모듈' 또는 '부'는 소프트웨어 또는 하드웨어에 한정되 는 의미는 아니다. '모듈' 또는 '부'는 어드레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서, '모듈' 또는 '부'는 소프트웨어 구성요소들, 객체지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이 크로 코드, 회로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레이들 또는 변수들 중 적어도 하나를 포 함할 수 있다. 구성요소들과 '모듈' 또는 '부'들은 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 '모듈' 또는 '부'들로 결합되거나 추가적인 구성요소들과 '모듈' 또는 '부'들로 더 분리될 수 있다. 본 개시의 일 실시예에 따르면, '모듈' 또는 '부'는 프로세서 및 메모리로 구현될 수 있다. '프로세서'는 범용 프로세서, 중앙 처리 장치(CPU), 마이크로프로세서, 디지털 신호 프로세서(DSP), 제어기, 마이크로제어기, 상태 머신 등을 포함하도록 넓게 해석되어야 한다. 몇몇 환경에서, '프로세서'는 주문형 반도체(ASIC), 프로그램가 능 로직 디바이스(PLD), 필드 프로그램가능 게이트 어레이(FPGA) 등을 지칭할 수도 있다. '프로세서'는, 예를 들어, DSP와 마이크로프로세서의 조합, 복수의 마이크로프로세서들의 조합, DSP 코어와 결합한 하나 이상의 마 이크로프로세서들의 조합, 또는 임의의 다른 그러한 구성들의 조합과 같은 처리 디바이스들의 조합을 지칭할 수 도 있다. 또한, '메모리'는 전자 정보를 저장 가능한 임의의 전자 컴포넌트를 포함하도록 넓게 해석되어야 한 다. '메모리'는 임의 액세스 메모리(RAM), 판독-전용 메모리(ROM), 비-휘발성 임의 액세스 메모리(NVRAM), 프 로그램가능 판독-전용 메모리(PROM), 소거-프로그램가능 판독 전용 메모리(EPROM), 전기적으로 소거가능 PROM(EEPROM), 플래쉬 메모리, 자기 또는 광학 데이터 저장장치, 레지스터들 등과 같은 프로세서-판독가능 매체 의 다양한 유형들을 지칭할 수도 있다. 프로세서가 메모리로부터 정보를 판독하고/하거나 메모리에 정보를 기 록할 수 있다면 메모리는 프로세서와 전자 통신 상태에 있다고 불린다. 프로세서에 집적된 메모리는 프로세서 와 전자 통신 상태에 있다. 본 개시에서 '음성 인식 모델'은 스피치(speech) 데이터를 입력하면, 입력된 음성에 포함된 언어 정보에 대응하 는 텍스트 데이터를 출력하는 모델을 지칭할 수 있다. 즉, 음성 인식 모델은 STT(Speech-to-Text) 기술을 구현 할 수 있다. 본 개시의 일 실시예에서, 음성 인식 모델은 학습 데이터를 이용하여 지도 학습, 비지도 학습 또 는 준지도 학습을 수행함으로써 생성 또는 업데이트되는 인공신경망 모델에 해당할 수 있다. 예를 들면, 음성 인식 모델은 Listen, Attend and Spell(LAS) 기반의 E2E-ASR(End-to-End Automatic Speech Recognition) 모델 일 수 있다. 본 개시에서 '음성 샘플'은 음성 인식 모델을 학습, 업데이트, 그리고 테스트하기 위해 수집한 사용자의 스피치 (speech) 데이터를 지칭할 수 있다. 음성 샘플은 수집된 데이터를 전처리하여 일정한 포맷으로 가공한 것일 수 있다. 예를 들면, 음성 샘플은 수집한 사용자의 스피치 데이터로부터, 200ms의 윈도우 길이(window-length)와 100ms의 보폭 길이(stride-length)를 갖는 해밍 윈도우(hamming window)를 이용하여 추출한 스펙토그램 (Spectrogram)을 포함할 수 있다. 본 개시에서 '레이블'은 음성 샘플에 대응하는 텍스트 시퀀스를 지칭할 수 있다. 예를 들면, 레이블은 음성 샘 플에 포함된 언어 정보, 언어학적 의미를 텍스트로 전사(transcribe)한 것일 수 있다. 레이블은 음성 샘플이 음성 인식 모델에 입력될 때 출력되는 수도 레이블(pseudo label)과 인간 주해자(human annotator)가 음성 샘플 에 대하여 전사한 정답 레이블을 포함할 수 있다. 도 1은 사용자가 음성 명령을 통해 사용자 단말로부터 서비스를 제공받는 예시를 나타내는 도면이다. 일 실시예에서, 사용자 단말은 마이크 등의 입력 장치를 통해 사용자로부터 음성 명령을 수신할 수 있다. 이 경우, 사용자 단말은 수신된 음성 명령을 음성 인식 모델을 이용하여 인식하고, 인식된 음성 명 령에 대응하는 정보 및/또는 서비스를 사용자에게 제공할 수 있다. 도시된 바와 같이, 사용자가 \"오 늘 날씨 알려줘\"라는 음성 명령을 발화하는 경우, 사용자 단말은 해당 음성 명령을 자동으로 인식하고, 오 늘의 일기 예보를 스피커 등을 통해 출력할 수 있다. 사용자 단말은 사용자가 발화하는 음성 명령을 인식하고, 음성 명령에 대응하는 서비스/정보를 제공 하도록 구성된 임의의 장치일 수 있다. 예를 들어, 사용자 단말은 음성 검색 서비스, 인공지능(AI, Artificial Intelligence) 비서 서비스, 지도 내비게이션(Navigation) 서비스, 셋톱 박스(set-top box) 제어서비스 등의 서비스를 제공할 수 있다. 도 1에서는 사용자 단말이 인공지능 스피커로 도시되었으나, 이에 한정되지 않으며, 음성 명령을 인식하고 그에 대응하는 서비스를 제공할 수 있는 임의의 장치일 수 있다. 사용자의 음성 명령을 인식하기 위하여, 사용자 단말은 기계 학습 등을 통해 생성된 음성 인식 모델 을 이용할 수 있다. 이러한 음성 인식 모델은 음성 인식의 정확도를 높이기 위해, 반복적인/점진적인 학습을 통해 업데이트될 수 있다. 사람이 음성 샘플을 청취하고 직접 정답 레이블을 생성한 휴먼 레이블드 샘플(Human Labeled Sample; HLS)을 최대한 많이 사용함으로써, 음성 인식 모델의 성능을 극대화할 수 있지만, 레이블링 비 용의 한계로 HLS만을 이용한 음성 인식 모델 학습 방법은 현실적으로 어려움이 있다. 특히, 음성 샘플을 레이 블링하는 작업, 즉, 사람이 음성 샘플을 듣고 전사하는 작업은 이미지를 레이블링하는 작업보다 훨씬 높은 비용 이 요구되므로, 휴먼 레이블링 비용을 최소화하면서 음성 인식 성능을 최대화할 수 있는 기계 학습 방식이 요구 된다. 일 실시예에서, HLS를 최소화하기 위해 준지도 학습(Semi-Supervised Learning; SSL)과 능동 학습(Active Learning; AL)을 접목하고, 레이블이 할당되지 않은 음성 샘플을 이용하여 학습 효율성을 더욱 향상시키기 위해 일관성 정규화(Consistency Regularization; CR) 기법을 사용할 수 있다. 구체적으로, 레이블이 할당되지 않은 음성 샘플 풀에서 불확실성 스코어가 가장 높은(즉, 음성 인식 모델의 신뢰도가 가장 낮은) n개의 음성 샘플을 추출하여 휴먼 레이블링 작업을 수행함으로써 복수의 HLS를 준비할 수 있다. 여기서, n은 자연수이고, 휴먼 레 이블링 비용 예산에 따라 결정될 수 있다. 또한, 레이블이 할당되지 않은 음성 샘플 풀에 남아 있는 음성 샘플 중 불확실성 스코어가 미리 정해진 임계치 미만(즉, 음성 인식 모델의 신뢰도가 임계치 초과)인 음성 샘플을 추 출하여 머신 레이블링 작업을 수행하고, 음성 샘플을 증강함으로써 복수의 머신 레이블드 샘플(Machine Labeled Sample; MLS)을 준비할 수 있다. 그리고, 음성 인식 모델은 HLS와 MLS를 함께 사용하여 학습/업데이트될 수 있 다. 여기서, MLS는 음성 인식 모델을 학습/업데이트하는데 HLS를 보조하는 역할을 수행할 수 있다. 도 2는 본 개시의 일 실시예에 따른 음성 인식 서비스를 제공하고 음성 인식 모델을 학습하기 위하여, 정보 처 리 시스템이 복수의 사용자 단말(210_1, 210_2, 210_3)과 통신 가능하도록 연결된 구성을 나타내는 개요도 이다. 정보 처리 시스템은 네트워크를 통해 음성 인식 기반 서비스를 제공할 수 있는 시스템(들) 및 /또는 음성 인식 모델을 학습할 수 있는 시스템(들)을 포함할 수 있다. 일 실시예에서, 정보 처리 시스템(23 0)은 음성 인식 기반 서비스 또는 음성 인식 모델 학습과 관련된 컴퓨터 실행 가능한 프로그램(예를 들어, 다운 로드 가능한 어플리케이션) 및 데이터를 저장, 제공 및 실행할 수 있는 하나 이상의 서버 장치 및/또는 데이터 베이스, 또는 클라우드 컴퓨팅 서비스 기반의 하나 이상의 분산 컴퓨팅 장치 및/또는 분산 데이터베이스를 포함 할 수 있다. 정보 처리 시스템에 의해 제공되는 음성 인식 기반 서비스는, 복수의 사용자 단말(210_1, 210_2, 210_3)의 각각에 설치된 음성 검색 어플리케이션, 인공지능 비서 어플리케이션 등을 통해 사용자에게 제 공될 수 있다. 예를 들어, 정보 처리 시스템은 음성 검색 어플리케이션, 인공지능 비서 어플리케이션 등 을 통해 사용자로부터 입력되는 음성 명령에 대응하는 정보를 제공하거나 대응하는 처리를 수행할 수 있다. 추 가적으로, 정보 처리 시스템은 음성 인식 모델을 학습/업데이트하기 위해, 복수의 사용자 단말(210_1, 210_2, 210_3)로부터 음성 샘플을 수집할 수 있다. 복수의 사용자 단말(210_1, 210_2, 210_3)은 네트워크를 통해 정보 처리 시스템과 통신할 수 있다. 네트워크는 복수의 사용자 단말(210_1, 210_2, 210_3)과 정보 처리 시스템 사이의 통신이 가능하도록 구성될 수 있다. 네트워크는 설치 환경에 따라, 예를 들어, 이더넷(Ethernet), 유선 홈 네트워크(Power Line Communication), 전화선 통신 장치 및 RS-serial 통신 등의 유선 네트워크, 이동통신망, WLAN(Wireless LAN), Wi-Fi, Bluetooth 및 ZigBee 등과 같은 무선 네트워크 또는 그 조합으로 구성될 수 있다. 통신 방식은 제한되지 않으며, 네트워크가 포함할 수 있는 통신망(일례로, 이동통신망, 유선 인터넷, 무선 인터넷, 방 송망, 위성망 등)을 활용하는 통신 방식뿐만 아니라 사용자 단말(210_1, 210_2, 210_3) 사이의 근거리 무선 통 신 역시 포함될 수 있다. 도 2에서 휴대폰 단말(210_1), 태블릿 단말(210_2) 및 PC 단말 (210_3)이 사용자 단말의 예로서 도시되었으나, 이에 한정되지 않으며, 사용자 단말(210_1, 210_2, 210_3)은 유선 및/또는 무선 통신이 가능하고 음성 기반 서 비스 어플리케이션, 검색 어플리케이션, 웹 브라우저 어플리케이션 등이 설치되어 실행될 수 있는 임의의 컴퓨 팅 장치일 수 있다. 예를 들어, 사용자 단말은, AI 스피커, 스마트폰, 휴대폰, 내비게이션, 컴퓨터, 노트북, 디지털방송용 단말, PDA(Personal Digital Assistants), PMP(Portable Multimedia Player), 태블릿 PC, 게임 콘솔(game console), 웨어러블 디바이스(wearable device), IoT(internet of things) 디바이스, VR(virtual reality) 디바이스, AR(augmented reality) 디바이스, 셋톱 박스 등을 포함할 수 있다. 또한, 도 2에는 3개의 사용자 단말(210_1, 210_2, 210_3)이 네트워크를 통해 정보 처리 시스템과 통신하는 것으로 도시되어있으나, 이에 한정되지 않으며, 상이한 수의 사용자 단말이 네트워크를 통해 정보 처리 시스템과 통 신하도록 구성될 수도 있다. 도 3은 본 개시의 일 실시예에 따른 사용자 단말 및 정보 처리 시스템의 내부 구성을 나타내는 블록 도이다. 사용자 단말은 음성 기반 서비스 어플리케이션 등이 실행 가능하고 유/무선 통신이 가능한 임의 의 컴퓨팅 장치를 지칭할 수 있으며, 예를 들어, 도 2의 휴대폰 단말(210_1), 태블릿 단말(210_2), PC 단말 (210_3) 등을 포함할 수 있다. 도시된 바와 같이, 사용자 단말은 메모리, 프로세서, 통신 모듈 및 입출력 인터페이스를 포함할 수 있다. 이와 유사하게, 정보 처리 시스템은 메모리, 프로세서, 통신 모듈 및 입출력 인터페이스를 포함할 수 있다. 도 3에 도시된 바와 같이, 사용 자 단말 및 정보 처리 시스템은 각각의 통신 모듈(316, 336)을 이용하여 네트워크를 통해 정보 및/또는 데이터를 통신할 수 있도록 구성될 수 있다. 또한, 입출력 장치는 입출력 인터페이스를 통 해 사용자 단말에 정보 및/또는 데이터를 입력하거나 사용자 단말로부터 생성된 정보 및/또는 데이터 를 출력하도록 구성될 수 있다. 메모리(312, 332)는 비-일시적인 임의의 컴퓨터 판독 가능한 기록매체를 포함할 수 있다. 일 실시예에 따르면, 메모리(312, 332)는 RAM(random access memory), ROM(read only memory), 디스크 드라이브, SSD(solid state drive), 플래시 메모리(flash memory) 등과 같은 비소멸성 대용량 저장 장치(permanent mass storage device) 를 포함할 수 있다. 다른 예로서, ROM, SSD, 플래시 메모리, 디스크 드라이브 등과 같은 비소멸성 대용량 저장 장치는 메모리와는 구분되는 별도의 영구 저장 장치로서 사용자 단말 또는 정보 처리 시스템에 포함 될 수 있다. 또한, 메모리(312, 332)에는 운영체제와 적어도 하나의 프로그램 코드(예를 들어, 사용자 단말 에 설치되어 구동되는 음성 기반 서비스 어플리케이션 등을 위한 코드)가 저장될 수 있다. 이러한 소프트웨어 구성요소들은 메모리(312, 332)와는 별도의 컴퓨터에서 판독 가능한 기록매체로부터 로딩될 수 있다. 이러한 별도의 컴퓨터에서 판독가능한 기록매체는 이러한 사용자 단말 및 정보 처리 시스템 에 직접 연결가능한 기록 매체를 포함할 수 있는데, 예를 들어, 플로피 드라이브, 디스크, 테이프, DVD/CD-ROM 드라이브, 메모리 카드 등의 컴퓨터에서 판독 가능한 기록매체를 포함할 수 있다. 다른 예로서, 소 프트웨어 구성요소들은 컴퓨터에서 판독 가능한 기록매체가 아닌 통신 모듈을 통해 메모리(312, 332)에 로딩될 수도 있다. 예를 들어, 적어도 하나의 프로그램은 개발자들 또는 어플리케이션의 설치 파일을 배포하는 파일 배포 시스템이 네트워크를 통해 제공하는 파일들에 의해 설치되는 컴퓨터 프로그램에 기반하여 메모리 (312, 332)에 로딩될 수 있다. 프로세서(314, 334)는 기본적인 산술, 로직 및 입출력 연산을 수행함으로써, 컴퓨터 프로그램의 명령을 처리하 도록 구성될 수 있다. 명령은 메모리(312, 332) 또는 통신 모듈(316, 336)에 의해 프로세서(314, 334)로 제공 될 수 있다. 예를 들어, 프로세서(314, 334)는 메모리(312, 332)와 같은 기록 장치에 저장된 프로그램 코드에 따라 수신되는 명령을 실행하도록 구성될 수 있다. 통신 모듈(316, 336)은 네트워크를 통해 사용자 단말과 정보 처리 시스템이 서로 통신하기 위한 구성 또는 기능을 제공할 수 있으며, 사용자 단말 및/또는 정보 처리 시스템이 다른 사용자 단말 또 는 다른 시스템(일례로 별도의 클라우드 시스템 등)과 통신하기 위한 구성 또는 기능을 제공할 수 있다. 일례 로, 사용자 단말의 프로세서가 메모리 등과 같은 기록 장치에 저장된 프로그램 코드에 따라 생 성한 요청 또는 데이터(예를 들어, 사용자의 음성 명령에 대응하는 데이터 등)는 통신 모듈의 제어에 따라 네트워크를 통해 정보 처리 시스템으로 전달될 수 있다. 역으로, 정보 처리 시스템의 프로세서 의 제어에 따라 제공되는 제어 신호나 명령이 통신 모듈과 네트워크를 거쳐 사용자 단말의 통신 모듈을 통해 사용자 단말에 수신될 수 있다. 예를 들어, 사용자 단말은 정보 처리 시스템 으로부터 통신 모듈을 통해 음성 명령과 연관된 정보 등을 수신할 수 있다. 입출력 인터페이스는 입출력 장치와의 인터페이스를 위한 수단일 수 있다. 일 예로서, 입력 장치는 오디오 센서 및/또는 이미지 센서를 포함한 카메라, 키보드, 마이크로폰, 마우스 등의 장치를, 그리고 출력 장 치는 디스플레이, 스피커, 햅틱 피드백 디바이스(haptic feedback device) 등과 같은 장치를 포함할 수 있다. 다른 예로, 입출력 인터페이스는 터치스크린 등과 같이 입력과 출력을 수행하기 위한 구성 또는 기능이 하 나로 통합된 장치와의 인터페이스를 위한 수단일 수 있다. 예를 들어, 사용자 단말의 프로세서가 메 모리에 로딩된 컴퓨터 프로그램의 명령을 처리함에 있어서 정보 처리 시스템이나 다른 사용자 단말이 제공하는 정보 및/또는 데이터를 이용하여 구성되는 서비스 화면 등이 입출력 인터페이스를 통해 디스플레 이에 표시될 수 있다. 도 3에서는 입출력 장치가 사용자 단말에 포함되지 않도록 도시되어 있으나,이에 한정되지 않으며, 사용자 단말과 하나의 장치로 구성될 수 있다. 또한, 정보 처리 시스템의 입 출력 인터페이스는 정보 처리 시스템과 연결되거나 정보 처리 시스템이 포함할 수 있는 입력 또 는 출력을 위한 장치(미도시)와의 인터페이스를 위한 수단일 수 있다. 도 3에서는 입출력 인터페이스(318, 338)가 프로세서(314, 334)와 별도로 구성된 요소로서 도시되었으나, 이에 한정되지 않으며, 입출력 인터페이스 (318, 338)가 프로세서(314, 334)에 포함되도록 구성될 수 있다. 사용자 단말 및 정보 처리 시스템은 도 3의 구성요소들보다 더 많은 구성요소들을 포함할 수 있다. 그러나, 대부분의 종래기술적 구성요소들을 명확하게 도시할 필요성은 없다. 일 실시예에 따르면, 사용자 단말 은 상술된 입출력 장치 중 적어도 일부를 포함하도록 구현될 수 있다. 또한, 사용자 단말은 트 랜시버(transceiver), GPS(Global Positioning system) 모듈, 카메라, 각종 센서, 데이터베이스 등과 같은 다 른 구성요소들을 더 포함할 수 있다. 예를 들어, 사용자 단말이 스마트폰인 경우, 일반적으로 스마트폰이 포함하고 있는 구성요소를 포함할 수 있으며, 예를 들어, 가속도 센서, 자이로 센서, 카메라 모듈, 각종 물리적 인 버튼, 터치패널을 이용한 버튼, 입출력 포트, 진동을 위한 진동기 등의 다양한 구성요소들이 사용자 단말 에 더 포함되도록 구현될 수 있다. 일 실시예에 따르면, 사용자 단말의 프로세서는 음성 기반 서비스를 제공하는 어플리케이션 등이 동 작하도록 구성될 수 있다. 이 때, 해당 어플리케이션 및/또는 프로그램과 연관된 코드가 사용자 단말의 메모리에 로딩될 수 있다. 어플리케이션 및/또는 프로그램이 동작되는 동안에, 사용자 단말의 프로 세서는 입출력 장치로부터 제공된 정보 및/또는 데이터를 입출력 인터페이스를 통해 수신하거나 통신 모듈을 통해 정보 처리 시스템으로부터 정보 및/또는 데이터를 수신할 수 있으며, 수신된 정보 및/또는 데이터를 처리하여 메모리에 저장할 수 있다. 또한, 이러한 정보 및/또는 데이터는 통신 모듈 을 통해 정보 처리 시스템에 제공할 수 있다. 음성 기반 서비스 어플리케이션 등을 위한 프로그램이 동작되는 동안에, 프로세서는 입출력 인터페이스 와 연결된 터치 스크린, 키보드, 오디오 센서 및/또는 이미지 센서를 포함한 카메라, 마이크로폰 등의 입 력 장치를 통해 입력되거나 선택된 텍스트, 이미지, 영상, 음성 등을 수신할 수 있으며, 수신된 텍스트, 이미지, 영상 및/또는 음성 등을 메모리에 저장하거나 통신 모듈 및 네트워크를 통해 정보 처리 시스템에 제공할 수 있다. 일 실시예에서, 프로세서는 입력 장치를 통해 음성 기반 서비스 어플리케 이션 상에서 사용자에 의해 입력된 음성 명령 관련 데이터를 네트워크 및 통신 모듈을 통해 정보 처 리 시스템에 제공할 수 있다. 정보 처리 시스템의 프로세서는 복수의 사용자 단말 및/또는 복 수의 외부 시스템으로부터 수신된 정보 및/또는 데이터를 관리, 처리 및/또는 저장하도록 구성될 수 있다. 일 실시예에서, 정보 처리 시스템은 사용자 단말로부터 수신한 음성 명령 관련 데이터에 대응하는 정보 를 사용자 단말로 제공할 수 있다. 추가적으로, 정보 처리 시스템은 사용자 단말로부터 레이블 이 할당되지 않은 음성 샘플을 수집할 수 있다. 도 4는 본 개시의 일 실시예에 따른 음성 샘플에 대한 레이블링 작업을 통해 HLS 데이터베이스(DB) 및 MLS DB를 구축하는 예시를 나타내는 도면이다. 정보 처리 시스템의 프로세서는 사용자 단말들로부터 레이블이 할당되지 않은 음성 샘플을 수집할 수 있다. 수집된 음성 샘플은 레이블이 할당되지 않은 음성 샘플 DB에 저장될 수 있다. 수집된 모든 음성 샘플에 대하여 휴먼 레이블링을 수행하는 것은 많은 비용이 요구되므로, 프로세서는 음성 인식 모델을 이용하여 음성 샘플로부터 휴먼 레이블링을 수행하 기 위한 음성 샘플을 추출할 수 있다. 프로세서는 음성 샘플 중에서 음성 인식 모델을 학습하는데 유용한 샘플(informative sample)을 선택 하기 위해 불확실성 기반의 AL(uncertainty-based AL)을 사용할 수 있다. 구체적으로, 프로세서는 각각의 음성 샘플의 불확실성 스코어에 기초하여 휴먼 레이블링을 위한 음성 샘플을 추출할 수 있다. 일 실시예에서, 프로세서는 미리 생성된 음성 인식 모델을 이용하여 레이블이 할당되지 않은 음성 샘플 DB 내의 음성 샘플들의 불확실성 스코어를 산출하고, 가장 높은 불확실성 스코어를 가지는 n개의 음성 샘플을 추출할 수 있다. 여기서, n은 자연수이고, 휴먼 레이블링 비용 예산에 따라 결정될 수 있다. 일 실시예에서, 음성 샘플의 불확실성 스코어는 음성 인식 모델에 의해 출력되는 텍스트 시퀀스의 길이 정 규화된 결합 확률(length-normalized joint probability)을 나타낼 수 있다. 예를 들어, 음성 샘플의 불확실 성 스코어와 신뢰도 스코어는 아래의 수학식 1 내지 3을 이용하여 산출될 수 있다.수학식 1"}
{"patent_id": "10-2020-0111929", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "수학식 2"}
{"patent_id": "10-2020-0111929", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "수학식 3"}
{"patent_id": "10-2020-0111929", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "여기서, 는 음성 샘플 DB 내의 음성 샘플을 나타내고, 는 음성 인식 모델에 의해 출력되는 텍스트 시퀀스(즉, 가장 가능성이 높은 디코딩된 텍스트)를 나타내고, 는 출력 텍스트 시퀀스의 결합 확률을 나타내고, 은 출력 텍스트 시퀀스의 길이를 나타내고, 은 길이 정규화된 로 그 결합 확률을 나타내고, 는 음성 샘플의 불확실성 스코어를 나타내고, 는 음성 샘플의 신뢰도 스코어를 나 타낼 수 있다. 위에서 확인할 수 있듯이, 긴 텍스트에 대한 결합 확률이 과소 평가(underestimating)되는 것을 방지하기 위해, 프로세서는 출력 텍스트의 길이에 기초하여 결합 확률을 정규화할 수 있다. 일 실시예에서, 음 성 샘플의 불확실성 스코어는 음성 인식 모델이 음성 샘플의 출력 텍스트 시퀀스를 디코딩하는 동안, 음성 인식 모델의 디코더 부분에서 산출될 수 있다. 가장 높은 불확실성 스코어(가장 낮은 신뢰도 스코어)를 가지는 n개의 음성 샘플은 휴먼 레이블링을 위해, 인간 주해자(Human annotator)에게 제공될 수 있다. 인간 주해자는 전달받은 n개의 음성 샘플(42 2)을 청취하고 정답 레이블을 생성할 수 있다. 정답 레이블은 음성 샘플 내에 포함된 스피치를 전사 한 텍스트 시퀀스일 수 있다. 프로세서는 불확실성 높은 n개의 음성 샘플과 대응되는 n개의 정답 레이블 을 HLS DB에 HLS(Human Labeled Sample)로서 저장할 수 있다. 이 때, 하나의 HLS는 음성 샘플과 정 답 레이블의 쌍으로 구성될 수 있다. 추가적으로, 프로세서는 레이블이 할당되지 않은 음성 샘플 DB에서 머신 레이블링을 위한 음성 샘플 을 추출할 수 있다. 불확실성이 높은 음성 샘플(즉, 음성 인식 모델의 신뢰도가 낮은 샘플)을 이용하여 MLS를 준비하는 경우, MLS가 음성 인식 모델에 잘못된 정보를 제공하여 음성 인식 모델의 성능을 오히려 떨어뜨릴 수 있다. 따라서, 프로세서는 음성 샘플 DB 내의 남아 있는 음성 샘플 중 미리 결정된 임계치 이하의 불확실성 스코어(임계치 이상의 신뢰도 스코어)를 가지는 적어도 하나의 음성 샘플을 머신 레이블링을 위한 불확실성이 낮은 음성 샘플로 추출할 수 있다. 불확실성 낮은 음성 샘플은 머신 레이블링을 위해 음성 인식 모델로 제공될 수 있다. 음성 인식 모 델은 전달받은 음성 샘플 각각에 대응하는 수도 레이블(pseudo label)을 예측할 수 있다. 수도 레이블은 음성 샘플이 음성 인식 모델에 입력될 때, 출력되는 텍스트 시퀀스일 수 있다. 수도 레이블은 HLS에 비해 정보가 적을뿐 아니라 잡음이 많을 수 있으므로 HLS와 동일한 방식으로 MLS를 처리하 는 경우, 음성 인식 모델을 학습/업데이트하는데 도움이 되지 않거나, 오히려 잘못된 정보를 제공하여 음 성 인식 모델의 성능을 저해할 수도 있다. 이를 방지하기 위해, 불확실성 낮은 음성 샘플은 데이터 증강 유닛으로 제공될 수 있다. 데이터 증강 유닛은 전달받은 음성 샘플을 증강(augment)하여 증강된 음성 샘플을 생성할 수 있다. 음성 샘플의 증강은 음성 샘플에 왜곡, 노이즈 등을 추가하는 것을 의미할 수 있다. 이미지 샘플 증강과 달리, 음성 샘플에 포함된 언어 정보는 왜곡, 노이즈 등에 매우 취약하 여, 음성 샘플 내의 언어 정보는 왜곡, 노이즈 등에 의해 쉽게 손상될 수 있다. 따라서, 음성 샘플 증강 프로 세스는 왜곡, 노이즈 등이 추가되더라도 음성 샘플 내의 언어학적 의미가 변경되지 않도록 신중하게 설계되어야한다. 일 실시예에 따르면, 데이터 증강 유닛은 음성 샘플에 대해 피치 시프팅(pitch shifting)을 수행할 수 있다. 대안적으로, 데이터 증강 유닛은 음성 샘플에 대해 타임 스케일링(time scaling)을 수행할 수 있다. 대안적으로, 데이터 증강 유닛은 음성 샘플에 가산성 백색 가우시안 노이즈(Additive White Gaussian Noise)를 추가할 수 있다. 프로세서는 증강된 음성 샘플과 대응되는 수도 레이블을 MLS DB에 MLS(Machine Labeled Sample)로서 저장할 수 있다. 이 때, 하나의 MLS는 증강된 음성 샘플과 수도 레이블의 쌍으로 구성될 수 있다. 프로세서는 HLS DB 내의 HLS와 MLS DB 내의 MLS를 사용하여 음성 인식 모델을 업데이트할 수 있다. 일 실시예에 따르면, 프로세서는 HLS DB에 저장된 음성 샘플-정답 레이블 쌍들과, MLS DB에 저장된 증강된 음성 샘플-수도 레이블 쌍들에 기초하여 준지도 학습(semi-supervised learning)을 수행하여 음 성 인식 모델을 업데이트할 수 있다. HLS와 MLS를 모두 이용하여 음성 인식 모델을 업데이트함으로 써, 음성 인식 모델의 강인성(robustness)을 향상시킬 수 있다. 일 실시예에 따르면, 프로세서는 음성 인식 모델에 의해 예측되는 음성 샘플과 대응되는 출력 데이터, 그리고 음성 샘플의 정답 레이블 사이의 차이가 최소화되도록 음성 인식 모델을 업데이 트할 수 있다. 예를 들어, 음성 인식 모델에 의해 예측되는 음성 샘플과 대응되는 출력 데이터와 정 답 레이블 사이의 차이는, 아래와 같은 표준 크로스-엔트로피 손실 함수(standard cross-entropy loss function)에 의해 산출될 수 있다. 수학식 4"}
{"patent_id": "10-2020-0111929", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "여기서 는 지도 손실(supervised loss)을 나타내고, B는 미니 배치(mini-batch)의 크기를 나타내고, 은 n 번째 HLS 샘플의 길이를 나타내고, 은 정답 레이블을 나타내고, 은 음성 인식 모델에 의해 예 측된 출력 데이터(즉, 음성 인식 모델에 의해 예측되는 음성 샘플과 대응되는 텍스트 시퀀스)를 나타 내고, H는 크로스-엔트로피(cross-entropy)를 나타낸다. 또한, 프로세서는 음성 인식 모델에 의해 예측되는 증강된 음성 샘플과 대응되는 출력 데이터, 그리 고 음성 샘플의 수도 레이블 사이의 차이가 최소화되도록 음성 인식 모델을 업데이트할 수 있다. 예를 들면, 음성 인식 모델에 의해 예측되는 증강된 음성 샘플과 대응되는 출력 데이터와 음 성 샘플의 수도 레이블 사이의 차이는, 아래와 같은 표준 크로스-엔트로피 손실 함수에 의해 산출될 수 있다. 수학식 5"}
{"patent_id": "10-2020-0111929", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "는 비지도 손실(unsupervised loss)을 나타내고, B는 미니 배치(mini-batch)의 크기를 나타내고, 은 n 번째 MLS 샘플의 길이를 나타내고, A는 증강 함수를 나타내고, 은 음성 인식 모델에 의해 예측되는 증강된 음성 샘플과 대응되는 출력 데이터(즉, 음성 인식 모델에 의해 예측되는 증강된 음성 샘플과 대 응되는 텍스트 시퀀스)를 나타내고, 은 수도 레이블을 나타내고, H는 크로스-엔트로피(cross- entropy)를 나타낸다.음성 인식 모델을 업데이트하는데 사용되는 총 손실( )은 지도 손실( )과 비지도 손실( )을 통합하여, 아래의 수학식 6과 같이 정의될 수 있다. 수학식 6"}
{"patent_id": "10-2020-0111929", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "여기서 는 비지도 손실의 계수 값을 나타낼 수 있다. 예를 들어, 는 0과 1 사이의 상수 값일 수 있다. 는 준지도 학습(semi-supervised learning)을 수행하여 음성 인식 모델을 업데이트하는 과정에서, 신뢰할 수 있는 샘플인 HLS을 사용하는 지도 손실에 가중치를 더하기 위해 사용될 수 있다. 프로세서는 총 손실( )이 최소화하도록 준지도 학습을 수행할 수 있다. 일 실시예에서, 프로세서는 일정량의 음성 샘플이 레이블이 할당되지 않은 음성 샘플 DB에 추가될 때 마다, 상술한 흐름에 따라 새로운 HLS와 MLS을 HLS DB와 MLS DB에 저장하고, HLS DB 내의 HLS 와 MLS DB 내의 MLS를 사용하여 음성 인식 모델을 업데이트하는 과정을 반복할 수 있다. 도 5는 본 개시의 일 실시예에 따른 초기 음성 인식 모델 생성 방법을 나타내는 흐름도이다. 일 실시예에 서, 초기 음성 인식 모델을 생성하는 방법은 프로세서(예를 들어, 정보 처리 시스템의 적어도 하나의 프로 세서)에 의해 수행될 수 있다. 도시된 바와 같이, 초기 음성 인식 모델을 생성하는 방법은 프로세서가 레 이블이 할당되지 않은 복수의 음성 샘플을 수신함으로써 개시될 수 있다(S510). 그 후, 프로세서는 인간 주해 자로부터 레이블이 할당되지 않은 복수의 음성 샘플 각각에 대한 정답 레이블을 수신할 수 있다(S520). 그 후, 프로세서는 단계(S510)에서 수신한 음성 샘플 및 단계(S520)에서 수신한 정답 레이블의 쌍들에 기초하여, 초기 음성 인식 모델을 생성할 수 있다(S530). 즉, 프로세서는 HLS를 이용하여 인공신경망 모델의 지도 학습을 수행함으로써 초기 음성 인식 모델을 생성할 수 있다. 여기서, 하나의 HLS는 음성 샘플과 정답 레 이블의 쌍으로 구성될 수 있다. 도 6은 본 개시의 일 실시예에 따른 점진적 음성 인식 모델 학습 방법을 나타내는 흐름도이다. 일 실시예 에서, 음성 인식 모델을 학습하는 방법은 프로세서(예를 들어, 정보 처리 시스템의 적어도 하나의 프로세 서)에 의해 수행될 수 있다. 도시된 바와 같이, 음성 인식 모델을 학습하는 방법은 프로세서가 레이블이 할당되지 않은 복수의 음성 샘플을 수신함으로써 개시될 수 있다(S610). 복수의 음성 샘플은 음성 인식 서비스 를 제공하는 동안 사용자 단말로부터 수집된 음성 샘플일 수 있다. 복수의 음성 샘플을 수신하는 것에 응답하여, 프로세서는 음성 인식 모델을 이용하여 복수의 음성 샘플로부터 휴먼 레이블링을 위한 제1 세트의 음성 샘플을 추출할 수 있다(S620). 일 실시예에서, 프로세서는 음성 인식 모델을 이용하여 복수의 음성 샘플 각각의 불확실성 스코어를 산출하고, 복수의 음성 샘플 중 가장 높은 불확실 성 스코어를 가지는 미리 결정된 개수의 음성 샘플을 제1 세트의 음성 샘플로 추출할 수 있다. 여기서, 불확실 성 스코어는 음성 인식 모델에 의해 출력되는 텍스트 시퀀스의 길이 정규화된 결합 확률을 나타낼 수 있다. 그 후, 프로세서는 제1 세트의 음성 샘플과 대응되는 제1 세트의 레이블을 수신할 수 있다(S630). 여기서, 제1 세트의 레이블은 사람에 의해 생성된 정답 레이블일 수 있다. 프로세서는 제1 세트의 음성 샘플과 제1 세트의 레이블을 HLS로 저장할 수 있다. 또한, 프로세서는 음성 인식 모델을 이용하여 복수의 음성 샘플로부터 머신 레이블링을 위한 제2 세트의 음성 샘플을 추출할 수 있다(S640). 일 실시예에서, 프로세서는 복수의 음성 샘플 중 미리 결정된 임계치 이하의 불 확실성 스코어를 가지는 적어도 하나의 음성 샘플을 제2 세트의 음성 샘플로 추출할 수 있다. 휴먼 레이블링을 위한 제1 세트의 음성 샘플의 수는 머신 레이블링을 위한 제2 세트의 음성 샘플의 수보다 적을 수 있다. 그 후, 프로세서는 음성 인식 모델을 이용하여 제2 세트의 음성 샘플과 대응되는 제2 세트의 레이블을 결정할 수 있다(S650). 여기서, 제2 세트의 레이블은 음성 인식 모델에 의해 예측된 수도 레이블일 수 있다. 또한, 프로세서는 제2 세트의 음성 샘플을 증강할 수 있다(S660). 일 실시예에서, 프로세서는 제2 세트의 음성 샘플에 대해 피치 시프팅을 수행할 수 있다. 다른 실시예에서, 프로세서는 제2 세트의 음성 샘플에 대해 타임 스케일링을 수행할 수 있다. 또 다른 실시예에서, 프로세서는 제2 세트의 음성 샘플에 가산성 백색 가우시안노이즈를 추가할 수 있다. 프로세서는 증강된 제2 세트의 음성 샘플과 제2 세트의 레이블을 MLS로 저장할 수 있다. 그 후, 프로세서는 제1 세트의 음성 샘플, 제1 세트의 레이블, 증강된 제2 세트의 음성 샘플 및 제2 세트의 레 이블에 기초하여 준지도 학습을 수행하여 음성 인식 모델을 업데이트할 수 있다(S670). 일 실시예에서, 프로세 서는 음성 인식 모델에 의해 예측되는 제1 세트의 음성 샘플과 대응되는 제1 세트의 출력 데이터, 그리고 제1 세트의 레이블 사이의 차이가 최소화되도록 음성 인식 모델을 업데이트할 수 있다. 추가적으로, 프로세서는 음 성 인식 모델에 의해 예측되는 증강된 제2 세트의 음성 샘플과 대응되는 제2 세트의 출력 데이터, 그리고 제2 세트의 레이블 사이의 차이가 최소화되도록 음성 인식 모델을 업데이트할 수 있다. 여기서, 제1 세트의 출력 데이터와 제1 세트의 레이블 사이의 차이, 그리고 제2 세트의 출력 데이터와 제2 세트의 레이블 사이의 차이는, 표준 크로스-엔트로피 손실 함수에 의해 산출될 수 있다. 도시된 바와 같이, 프로세서는 S610 내지 S670을 반 복적으로 수행함으로써, 음성 인식 모델을 점진적으로 학습/업데이트할 수 있다. 도 7은 본 개시의 일 실시예에 따른 음성 인식 모델을 생성, 업데이트, 그리고 테스트하기 위한 음성 샘플(710, 720, 730)의 예시를 나타내는 도면이다. 정보 처리 시스템의 프로세서는 사용자 단말들로부터 음성 샘플(710, 720, 730)을 수신할 수 있다. 수신된 음성 샘플은 초기 음성 샘플, 후속 음성 샘플, 그리고 테스트 용 음성 샘플로 분류될 수 있다. 일 실시예에서, 프로세서는 200ms의 윈도우 길이(window-length)와 100ms의 보폭 길이(stride-length)를 갖는 해밍 윈도우(hamming window)를 이용하여, 수신된 음성 샘플로부터 스펙토그램(Spectrogram)을 추출할 수 있다. 프로세서는 초기 음성 샘플을 이용하여 초기 음성 인식 모델을 생성할 수 있다. 일 실시예에서, 프로세서 는 초기 음성 샘플을 이용하여 도 5에서 상술한 초기 음성 인식 모델 생성 방법을 수행함으로써, 초기 음 성 인식 모델을 생성할 수 있다. 그 후, 프로세서는 후속 음성 샘플을 이용하여 음성 인식 모델을 업데이 트할 수 있다. 일 실시예에서, 프로세서는 후속 음성 샘플을 이용하여 도 6에서 상술한 음성 인식 모델 학습 방법을 수행함으로써, 음성 인식 모델을 업데이트할 수 있다. 예를 들어, 프로세서는 후속 음성 샘플 을 여러 구간(예를 들어, 30개의 구간)으로 나누고, 각 구간의 음성 샘플을 이용하여 음성 인식 모델 업데 이트를 여러 번(예를 들어, 30번) 수행할 수 있다. 음성 인식 모델의 생성 및 업데이트가 완료된 후, 프로세서는 테스트용 음성 샘플을 이용하여 음성 인식 모델의 성능을 테스트할 수 있다. 일 실시예에서, 프로세서는 테스트용 음성 샘플 각각을 업데이트 완료 된 음성 인식 모델에 입력하고, 출력 데이터와 인간 주해자가 생성한 정답 레이블을 비교함으로써, 음성 인식 모델의 성능을 테스트할 수 있다. 음성 인식 모델의 성능은 글자 수준 오류율(Character-level Error Rate; CER)로 평가될 수 있다. 여기서, CER은 출력 데이터와 정답 레이블 사이의 글자 차이에 기초하여 결정될 수 있 다. 일 실시예에서, 초기 음성 샘플의 수는 후속 음성 샘플의 수보다 적을 수 있다. 예를 들면, 초기 음 성 샘플은 110시간의 음성 샘플을 포함하고, 후속 음성 샘플은 386시간의 음성 샘플을 포함하고, 테 스트용 음성 샘플은 56시간의 음성 샘플을 포함할 수 있다. 또한, 초기 음성 샘플은 후속 음성 샘 플보다 먼저 수집된 음성 샘플이고, 후속 음성 샘플은 테스트용 음성 샘플보다 먼저 수집된 음 성 샘플일 수 있다. 이와 같은 구성에 의해, 본 개시의 실시예들에 따른 음성 인식 모델 학습 방법의 성능을 실제 상황과 유사하게 평가할 수 있다. 이러한 환경에서 수행된 본 개시의 실시예들에 따른 음성 인식 모델 학 습 방법의 성능 평가는 이하에서 도 8 내지 10을 참고하여 설명한다. 성능 평가에서는 음성 샘플의 신뢰도 스 코어(수학식 3의 값)가 임계값(τ=0.9)을 초과하는 음성 샘플들을 추출하여 머신 레이블링을 수행했다. 또한, 음성 인식 모델 학습에서 MLS의 영향을 강조하기 위해 비지도 손실의 계수 값( )을 1로 사용했다. 도 8은 휴먼 레이블링을 위한 음성 샘플을 추출하는 방식에 따른 음성 인식 모델의 성능 차이를 나타내는 그래 프이다. 앞서 설명한 것과 같이, 음성 인식 모델을 학습/업데이트하기 위해 레이블이 할당되지 않은 음성 샘플 로부터 휴먼 레이블링을 수행하기 위한 음성 샘플을 추출할 수 있다. 그래프에서 'NP'는 상술한 수학식 1 및 2 를 이용하여 음성 샘플의 불확실성 스코어를 산출한 경우를 나타낸다. 그래프에서 'RND'는 휴먼 레이블링을 수 행할 음성 샘플을 랜덤하게 추출한 경우를 나타낸다. 그래프에서 'Loss'와 'CER'은 수학식 1 내지 2가 아닌 다 른 방식으로 불확실성 스코어를 산출한 경우를 나타낸다. 각각의 기준에 따라 추출되는 휴먼 레이블링을 수행할 음성 샘플들의 음성 인식 모델 학습에 대한 유용성을 평 가하기 위해, 복수의 음성 샘플을 상술한 기준에 따라 정렬하고, 5개의 음성 샘플 세트로 분할할 수 있다. 예를 들면, 총 386.5시간의 음성 샘플을 각각의 기준에 따라 정렬하고, 77.3시간의 5개의 음성 샘플 세트로 분할 할 수 있다. 여기서, 'set1/5'는 가장 불확실성 높은 샘플들(즉, 음성 인식 모델 학습에 유용한 샘플들)을 포함 하는 세트이고, 'set5/5'는 가장 불확실성이 낮은 샘플들(즉, 음성 인식 모델 학습에 유용하지 않은 샘플들)을 포함하는 세트이다. 그 후, 각 음성 샘플 세트를 이용하여 HLS를 준비하고, 준비된 HLS를 이용하여 지도 학습 을 수행하여 음성 인식 모델을 생성할 수 있다. 생성된 음성 인식 모델의 성능은 CER(%)로 나타낼 수 있다. 여기서, CER(%)이 낮을수록 음성 인식 모델의 성능이 좋음을 의미할 수 있다. 도시된 바와 같이, 'NP', 'Loss', 'CER'은 각각 'set1/5'에서 최소의 CER(%) 값을 가지며, 'set1/5'에서 'NP'가 가장 작은 CER(%) 값을 갖는다. 또한, 'NP'에서는 불확실성 스코어가 낮은(즉, 신뢰도 스코어가 높은) 음성 샘 플 세트를 사용할수록 CER(%)이 거의 단조적(monotonically)으로 증가하는 것을 확인할 수 있다. 반면 'Loss', 'CER'에서는 'NP'와 달리, 각 음성 샘플 세트에 대한 CER(%) 값에 대하여 예상 밖의 변화 형태가 나타나는 것을 확인할 수 있다. 이는, 'Loss' 또는 'CER' 방식을 이용하여 음성 샘플의 불확실성 스코어를 산출하는 경우, 음 성 인식 모델을 통해 예측되는 텍스트 시퀀스 사이의 결합 확률을 고려하지 않고, 정답 레이블과 음성 인식 모 델에 의해 예측되는 레이블 사이의 차이를 측정하여 불확실성 스코어를 결정하기 때문이다. 따라서, 휴먼 레이 블링을 수행할 음성 샘플을 추출하기 위해, 음성 샘플의 NP 값(상술한 수학식 1 및 2)을 이용하여 음성 샘플의 불확실성 스코어를 산출하는 것이다른 기준으로 불확실성 스코어를 산출하는 것보다 정확하고 효과적이다. 도 9는 본 개시의 음성 샘플 증강 방식에 따른 음성 인식 모델 성능의 차이를 나타내는 그래프이다. 그래프에 서 'NoCR'은 데이터 증강을 수행하지 않은 경우를 나타내고, 'CR-P'는 데이터 증강으로서 음성 샘플에 대해 피 치 시프팅을 수행한 경우를 나타내고, 'CR-A'는 데이터 증강으로서 음성 샘플에 가산성 백색 가우시안 노이즈를 추가한 경우를 나타내고, 'CR-S'는 데이터 증강으로서 음성 샘플에 대해 타임 스케일링을 수행한 경우를 나타낸 다. 예를 들어, 'CR-P'는 음성 샘플의 음정을 2.5 단계(1 단계는 한 옥타브를 8개로 나눈 것) 시프트한 것을 나타내고, 'CR-A'는 음성 샘플에 SNR(Signal-to-Noise Ratio)이 5 이하인 가산성 백색 가우시안 노이즈를 추가 한 것을 나타내고, 'CR-S'는 음성 샘플의 재생 속도를 1.5 배 빠르게 타임 스케일링한 것을 나타낸다. 도 9에서, x축은 HLS의 양(즉, 음성 샘플의 시간)을 나타내고, x축의 '(LUxy)'의 xy는 HLS(x)와 MLS(y)의 비율 을 나타낸다. 예를 들어, 38.6h(LU19)의 경우 38.6시간 분량의 HLS와 HLS 9배 양의 MLS에 기초하여 준지도 학 습을 수행하여 음성 인식 모델 업데이트를 진행한 경우를 나타낸다. 도 9의 그래프는 아래 표 1 과 함께 분석 될 수 있다. 표 1은 각 행 및 각 열에 대응하는 조건으로 업데이트된 음성 인식 모델의 성능(CER(%))을 나타낸 다. 여기서, CER(%)이 낮을수록 음성 인식 모델의 성능이 좋은 것으로 평가할 수 있다. 표 1 Set-up Supervised LearningNoCR CR-S CR-A CR-P A+B(386h) 10.89 - - - - LU12(137h) 11.23 11.93 11.94 11.62 11.15 LU14(77.4h) 11.97 12.24 12.39 12.08 11.80 LU16(57h) 13.63 13.21 12.60 12.63 11.97 LU19(38.6h) 13.83 14.17 13.54 13.02 12.57 표 1에서 확인할 수 있는 것과 같이, 386 시간의 HLS만을 이용하여 지도 학습을 통해 생성된 음성 인식 모델의 성능이 CER=10.89 %로 가장 좋다. 또한, 표 1과 도 9에서 확인할 수 있는 것과 같이, HLS의 양이 줄어들고 MLS 의 양이 늘어날수록 음성 인식 모델의 성능이 점점 안 좋아지는 것을 확인할 수 있다. 추가적으로, LU16의 경 우를 제외하고 'NoCR'의 CER(%)이 'Supervised learning'의 CER(%)보다 높은 것으로 보아, 증강하지 않은 음성 샘플을 포함하는 MLS는 오히려 음성 인식 모델의 학습에 부정적인 영향을 주는 것을 확인할 수 있다. 특히, 성 능 평가에서 비교적 낮은 신뢰도 스코어 임계값(τ=0.9)을 기초로 머신 레이블링을 수행할 음성 샘플을 추출하 였고, 높은 비지도 손실의 계수 값( =1)을 설정하여 음성 인식 모델을 준지도 학습했기 때문에, MLS 내의 정확 하지 않은 수도 레이블의 음성 인식 모델에 대한 부정적 영향이 잘 드러난다. 표 1과 도 9에서 LU12와 LU14의 'CR-S'를 제외하고, 각 행에서, 'NoCR'보다 증강된 음성 샘플을 이용한 경우 ('CR-S', 'CR-A', 'CR-P')의 CER(%)이 낮다는 것을 확인할 수 있다. 또한, 'CR-S', 'CR-A', 'CR-P' 중 'CR- P'가 가장 낮은 CER(%)을 가지므로, 데이터 증강으로서 음성 샘플에 대해 피치 시프팅을 수행한 경우, 음성 인식 모델의 성능이 가장 좋다는 것을 확인할 수 있다. 한편, 음성 인식 모델 학습에 이용되는 HLS의 수가 적을 때(예를 들면, LU16 또는 LU19), MLS에 포함된 음성 샘 플의 증강의 효과가 더욱 두드러지게 나타나는 것을 확인할 수 있다. 예를 들어, LU19에서 증강된 음성 샘플을 사용하는 경우의 CER(%)이 'Supervised learning'과 'NoCR'에 비해 각각 1.26 %p 및 1.60 %p 감소한다. 반면, 충분한 양의 HLS을 이용하여 음성 인식 모델을 학습/업데이트한 경우(예를 들어, LU12)에는 음성 샘플 증강의 효과가 미미한 것으로 보이나, 이는 음성 인식 모델에 대한 HLS의 학습 효과가 충분히 크게 나타나기 때문이다. 도 10은 본 개시의 일 실시예에 따라 음성 인식 모델을 여러 번 업데이트하는 경우, 학습 회차와 음성 인식 모 델 성능의 관계를 나타내는 그래프이다. 도 10의 그래프는 음성 인식 모델을 30회차까지 업데이트하고, 각각 회차에 업데이트된 음성 인식 모델의 CER(%)을 나타낸다. LU12, LU16 각각에 대하여 'NoCR'의 CER(%)이 'CR- S', 'CR-A'. 'CR-P'의 CER(%)보다 더 큰 것을 확인할 수 있다. 즉, 'NoCR'에서 정확하지 않은 수도 레이블(즉, 정확하지 않은 MLS)로 인한 음성 인식 모델의 성능 저하가 나타난다. 본 개시의 실시예들에 따르면, 비지도 손실( )이 음성 인식 모델이 잘 모르는 음성 샘플에 높은 신뢰도 스코어를 부여하는 것을 제약 하므로, 상술한 문제를 완화하여 기계 학습에서 MLS를 활용하면서 우수한 음성 인식 모델 성능을 제공할 수 있 다. 결론적으로, 본 개시의 실시예들에 따라 음성 인식 모델을 학습/업데이트하는 경우, 0.26 %p의 CER 증가(즉, 성 능 저하)만으로 레이블링 비용을 2/3 가량 절감할 수 있으며, 1.08 %p의 CER 증가만으로 레이블링 비용을 6/7 가량 절감할 수 있다. 따라서, 음성 인식 모델의 성능 저하(예를 들면, 정확하지 않은 MLS로 인한 성능 저하) 는 거의 없도록 하면서, 음성 인식 모델을 업데이트하기 위한 휴먼 레이블링 비용을 현저하게 줄이는 것이 가능 하다. 상술한 음성 인식 모델 학습 방법은 컴퓨터에서 실행하기 위해 컴퓨터 판독 가능한 기록 매체에 저장된 컴퓨터 프로그램으로 제공될 수 있다. 매체는 컴퓨터로 실행 가능한 프로그램을 계속 저장하거나, 실행 또는 다운로드 를 위해 임시 저장하는 것일 수도 있다. 또한, 매체는 단일 또는 수개 하드웨어가 결합된 형태의 다양한 기록 수단 또는 저장수단일 수 있는데, 어떤 컴퓨터 시스템에 직접 접속되는 매체에 한정되지 않고, 네트워크 상에 분산 존재하는 것일 수도 있다. 매체의 예시로는, 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매 체, CD-ROM 및 DVD 와 같은 광기록 매체, 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto- optical medium), 및 ROM, RAM, 플래시 메모리 등을 포함하여 프로그램 명령어가 저장되도록 구성된 것이 있을 수 있다. 또한, 다른 매체의 예시로, 애플리케이션을 유통하는 앱 스토어나 기타 다양한 소프트웨어를 공급 내 지 유통하는 사이트, 서버 등에서 관리하는 기록매체 내지 저장매체도 들 수 있다. 본 개시의 방법, 동작 또는 기법들은 다양한 수단에 의해 구현될 수도 있다. 예를 들어, 이러한 기법들은 하드 웨어, 펌웨어, 소프트웨어, 또는 이들의 조합으로 구현될 수도 있다. 본원의 개시와 연계하여 설명된 다양한 예시적인 논리적 블록들, 모듈들, 회로들, 및 알고리즘 단계들은 전자 하드웨어, 컴퓨터 소프트웨어, 또는 양자 의 조합들로 구현될 수도 있음을 통상의 기술자들은 이해할 것이다. 하드웨어 및 소프트웨어의 이러한 상호 대 체를 명확하게 설명하기 위해, 다양한 예시적인 구성요소들, 블록들, 모듈들, 회로들, 및 단계들이 그들의 기능 적 관점에서 일반적으로 위에서 설명되었다. 그러한 기능이 하드웨어로서 구현되는지 또는 소프트웨어로서 구 현되는지의 여부는, 특정 애플리케이션 및 전체 시스템에 부과되는 설계 요구사항들에 따라 달라진다. 통상의 기술자들은 각각의 특정 애플리케이션을 위해 다양한 방식들로 설명된 기능을 구현할 수도 있으나, 그러한 구현 들은 본 개시의 범위로부터 벗어나게 하는 것으로 해석되어서는 안된다. 하드웨어 구현에서, 기법들을 수행하는 데 이용되는 프로세싱 유닛들은, 하나 이상의 ASIC들, DSP들, 디지털 신 호 프로세싱 디바이스들(digital signal processing devices; DSPD들), 프로그램가능 논리 디바이스들 (programmable logic devices; PLD들), 필드 프로그램가능 게이트 어레이들(field programmable gate arrays; FPGA들), 프로세서들, 제어기들, 마이크로제어기들, 마이크로프로세서들, 전자 디바이스들, 본 개시에 설명된 기능들을 수행하도록 설계된 다른 전자 유닛들, 컴퓨터, 또는 이들의 조합 내에서 구현될 수도 있다. 따라서, 본 개시와 연계하여 설명된 다양한 예시적인 논리 블록들, 모듈들, 및 회로들은 범용 프로세서, DSP, ASIC, FPGA나 다른 프로그램 가능 논리 디바이스, 이산 게이트나 트랜지스터 로직, 이산 하드웨어 컴포넌트들, 또는 본원에 설명된 기능들을 수행하도록 설계된 것들의 임의의 조합으로 구현되거나 수행될 수도 있다. 범용 프로세서는 마이크로프로세서일 수도 있지만, 대안으로, 프로세서는 임의의 종래의 프로세서, 제어기, 마이크로 제어기, 또는 상태 머신일 수도 있다. 프로세서는 또한, 컴퓨팅 디바이스들의 조합, 예를 들면, DSP와 마이크 로프로세서, 복수의 마이크로프로세서들, DSP 코어와 연계한 하나 이상의 마이크로프로세서들, 또는 임의의 다른 구성의 조합으로서 구현될 수도 있다. 펌웨어 및/또는 소프트웨어 구현에 있어서, 기법들은 랜덤 액세스 메모리(random access memory; RAM), 판독 전 용 메모리(read-only memory; ROM), 비휘발성 RAM(non-volatile random access memory; NVRAM), PROM(programmable read-only memory), EPROM(erasable programmable read-only memory), EEPROM(electrically erasable PROM), 플래시 메모리, 컴팩트 디스크(compact disc; CD), 자기 또는 광학 데이 터 스토리지 디바이스 등과 같은 컴퓨터 판독가능 매체 상에 저장된 명령들로서 구현될 수도 있다. 명령들은 하나 이상의 프로세서들에 의해 실행 가능할 수도 있고, 프로세서(들)로 하여금 본 개시에 설명된 기능의 특정 양태들을 수행하게 할 수도 있다. 이상 설명된 실시예들이 하나 이상의 독립형 컴퓨터 시스템에서 현재 개시된 주제의 양태들을 활용하는 것으로 기술되었으나, 본 개시는 이에 한정되지 않고, 네트워크나 분산 컴퓨팅 환경과 같은 임의의 컴퓨팅 환경과 연계 하여 구현될 수도 있다. 또 나아가, 본 개시에서 주제의 양상들은 복수의 프로세싱 칩들이나 장치들에서 구현 될 수도 있고, 스토리지는 복수의 장치들에 걸쳐 유사하게 영향을 받게 될 수도 있다. 이러한 장치들은 PC들, 네트워크 서버들, 및 휴대용 장치들을 포함할 수도 있다."}
{"patent_id": "10-2020-0111929", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "본 명세서에서는 본 개시가 일부 실시예들과 관련하여 설명되었지만, 본 개시의 발명이 속하는 기술분야의 통상 의 기술자가 이해할 수 있는 본 개시의 범위를 벗어나지 않는 범위에서 다양한 변형 및 변경이 이루어질 수 있 다. 또한, 그러한 변형 및 변경은 본 명세서에 첨부된 특허청구의 범위 내에 속하는 것으로 생각되어야 한다."}
{"patent_id": "10-2020-0111929", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 개시의 실시예들은, 이하 설명하는 첨부 도면들을 참조하여 설명될 것이며, 여기서 유사한 참조 번호는 유사 한 요소들을 나타내지만, 이에 한정되지는 않는다. 도 1은 사용자가 음성 명령을 통해 사용자 단말로부터 서비스를 제공받는 예시를 나타내는 도면이다. 도 2는 본 개시의 일 실시예에 따른 음성 인식 서비스를 제공하고 음성 인식 모델을 학습하기 위하여, 정보 처 리 시스템이 복수의 사용자 단말과 통신 가능하도록 연결된 구성을 나타내는 개요도이다. 도 3은 본 개시의 일 실시예에 따른 사용자 단말 및 정보 처리 시스템의 내부 구성을 나타내는 블록도이다. 도 4는 본 개시의 일 실시예에 따른 음성 샘플에 대한 레이블링 작업을 통해 HLS 데이터베이스(DB) 및 MLS DB를 구축하는 예시를 나타내는 도면이다. 도 5는 본 개시의 일 실시예에 따른 초기 음성 인식 모델 생성 방법을 나타내는 흐름도이다. 도 6은 본 개시의 일 실시예에 따른 점진적 음성 인식 모델 학습 방법을 나타내는 흐름도이다. 도 7은 본 개시의 일 실시예에 따른 음성 인식 모델을 생성, 업데이트, 그리고 테스트하기 위한 음성 샘플의 예 시를 나타내는 도면이다. 도 8은 휴먼 레이블링을 위한 음성 샘플을 추출하는 방식에 따른 음성 인식 모델의 성능 차이를 나타내는 그래 프이다. 도 9는 본 개시의 음성 샘플 증강 방식에 따른 음성 인식 모델 성능의 차이를 나타내는 그래프이다. 도 10은 본 개시의 일 실시예에 따라 음성 인식 모델을 여러 번 업데이트하는 경우, 학습 회차와 음성 인식 모 델 성능의 관계를 나타내는 그래프이다."}
