{"patent_id": "10-2023-0085093", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0056397", "출원번호": "10-2023-0085093", "발명의 명칭": "신규한 키뉴레니나제 및 이의 용도", "출원인": "서울대학교산학협력단", "발명자": "마틴 스타이네거"}}
{"patent_id": "10-2023-0085093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "서열번호 2, 서열번호 3, 서열번호 4 및 서열번호 5의 아미노산 서열로 구성된 군에서 선택되는 어느 하나의 아미노산 서열로 이루어진 신규한 키뉴레니나제."}
{"patent_id": "10-2023-0085093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 키뉴레니나제는 페길레이션화된 것인, 신규한 키뉴레니나제."}
{"patent_id": "10-2023-0085093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 키뉴레니나제는 슈도모나스 종, 보르데텔라 종 또는 라인헤이메라 종 유래인 것인, 신규한 키뉴레니나제."}
{"patent_id": "10-2023-0085093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "서열번호 7, 서열번호 8, 서열번호 9 및 서열번호 10의 염기서열로 구성된 군에서 선택되는 어느 하나의 염기서열로 이루어진 신규한 키뉴레니나제를 암호화하는 폴리뉴클레오티드."}
{"patent_id": "10-2023-0085093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항의 폴리뉴클레오티드를 포함하는 발현벡터."}
{"patent_id": "10-2023-0085093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항의 발현벡터가 도입된 형질전환 세포."}
{"patent_id": "10-2023-0085093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항의 숙주세포를 배양하는 단계; 및상기 세포 배양물로부터 키뉴레니나제를 수득하는 단계를 포함하는 신규한 키뉴레니나제를 제조하는 방법."}
{"patent_id": "10-2023-0085093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항의 신규한 키뉴레니나제를 유효성분으로 포함하는 암 예방 또는 치료용 약학 조성물."}
{"patent_id": "10-2023-0085093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 암은 흑색종, 위암, 간암, 폐암, 대장암, 유방암, 전립선암, 난소암, 췌장암, 자궁경부암, 갑상선암, 후두암, 급성 골수성 백혈병, 뇌종양, 신경모세포종, 망막 모세포종, 두경부암, 침샘암 및 림프종으로 구성된 군에서 선택되는 어느 하나인 것인, 암 예방 또는 치료용 약학 조성물."}
{"patent_id": "10-2023-0085093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항의 신규한 키뉴레니나제를 개체에 투여하는 단계를 포함하는 암을 예방 또는 치료하는 방법."}
{"patent_id": "10-2023-0085093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "키뉴레니나제; 및 면역글로불린 Fc 영역을 포함하는 융합단백질."}
{"patent_id": "10-2023-0085093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "공개특허 10-2024-0056397-3-제11항에 있어서,상기 키뉴레니나제는 서열번호 2, 서열번호 3, 서열번호 4 및 서열번호 5의 아미노산 서열로 구성된 군에서 선택되는 어느 하나의 아미노산 서열인 것인, 융합단백질."}
{"patent_id": "10-2023-0085093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항의 융합단백질 두개가 결합된 융합단백질 이량체."}
{"patent_id": "10-2023-0085093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항 내지 제13항 중 어느 하나의 융합단백질을 포함하는 약학 조성물."}
{"patent_id": "10-2023-0085093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 약학 조성물은 항암제인 것인, 약학 조성물."}
{"patent_id": "10-2023-0085093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "암세포에 발현하는 단백질에 특이적으로 결합하는 항체에 키뉴레니나제가 결합된 이중특이 항체."}
{"patent_id": "10-2023-0085093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서,상기 암세포에 발현하는 단백질은 EGFR, VEGFR, CD20, CD38, RNAK-L, BTK, Bcr-abl, PDGFR/FGFR 계열,MEK/RAF/KRAS, HER2/Neu, Ubiquitin, JAK, ALK, PARP, TGFβRI, Proteasome, Bcl-2, C-Met, VR1, VR2, VR3,c-kit, AXL, RET, Braf, DNMT, CDK4/6, 및 STING으로 이루어진 군; 또는 CTLA-4, PD-1, PD-L1, PD-L2, B7-H4, HVEM, TIM3, GAL9, LAG3, VISTA, KIR, BTLA, 및 TIGIT로 이루어진 군에서 선택되는 어느 하나인 것인, 이중특이 항체."}
{"patent_id": "10-2023-0085093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제16항의 이중특이 항체를 포함하는 항암제."}
{"patent_id": "10-2023-0085093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제1항의 신규한 키뉴레니나제; 제11항의 융합단백질; 제13항의 융합단백질 이량체; 또는 제16항의 이중특이 항체를 포함하는 지질 전달체."}
{"patent_id": "10-2023-0085093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "하기 (i) 내지 (v)를 포함하는 융합단백질을 코딩하는 폴리뉴클레오티드:(i) 제1항의 신규한 키뉴레니나제; (ii) 막관통 도메인; (iii) 적어도 하나의 공자극 도메인을 포함하는 세포내 신호전달 도메인;(iv) 자가-절단성 펩타이드; 및 (v) 신호 기전 조절 인자."}
{"patent_id": "10-2023-0085093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제1항에 있어서,상기 (i) 제1항의 신규한 키뉴레니나제와 상기 (ii) 막관통 도메인 사이에는 스페이서를 더 포함하는 것인, 폴리뉴클레오티드.공개특허 10-2024-0056397-4-청구항 22 제20항의 폴리뉴클레티드가 도입된 면역 세포."}
{"patent_id": "10-2023-0085093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제22항에 있어서,상기 면역 세포는 T 세포 또는 NK 세포인 것인, 면역 세포."}
{"patent_id": "10-2023-0085093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제23항의 면역 세포를 포함하는 항암제."}
{"patent_id": "10-2023-0085093", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 신규한 키뉴레니나제(kynureninase) 및 이의 암 치료 용도에 관한 것으로, 상기 신규한 키뉴레니나제 는 기존에 알려진 키뉴레니나제와 유사하거나 보다 높은 촉매 활성 및 열적 안정성을 나타내고, 키뉴레닌(L- kynurenine, L-KYN)에 의해 유도되는 T 세포 증식 억제를 체외 배양 시스템에서 보다 효과적으로 회복시키므로, 면역 억제 종양 미세환경을 극복하기 위한 강력한 치료 효소로서 활용이 가능하다. 특히, 상기 신규한 키뉴레니 나제는 종양 동물 모델에서 우수한 종양 성장 억제 효과를 나타내므로 다양한 암 면역 치료제로서 효과적으로 활 용할 수 있어 산업적 활용 가능성이 높다."}
{"patent_id": "10-2023-0085093", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 신규한 키뉴레니나제 및 이의 암 치료 용도에 관한 것이다."}
{"patent_id": "10-2023-0085093", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "암 면역 치료요법은 화학 요법, 방사선 요법과 함께 암 환자의 주요 치료 옵션 중 하나가 되었다. 대중적인 암 면역 치료요법으로는 PD-1, PD-L1과 같은 면역 체크포인트(Immune Checkpoint)를 차단하기 위하여 단일 클론 항 체를 투여하거나 키메라 항원 수용체를 가지도록 조작된 T 세포를 환자에게 전달해, 표적 암세포를 인식하게 하 는 방법이 있다. 그러나 고형 종양에 대한 이런 면역 치료요법에 대한 반응율은 여전히 낮기 때문에 추가적인 치료 방법의 개발이 필요한 상황이다. 종양 미세환경(Tumor microenvironments)은 CD8 T 세포 및 NK 세포와 같은 일차 종양 공격 세포와 수지상 세포 와 같은 항원 제시 세포를 무력화하는 면역 억제성이 있는 것으로 알려져 있다. 종양은 면역 체크포인트 외에도 산성 pH와 같은 면역 억제 미세환경을 가지고 있어 NK 세포의 세포 사멸 및 CD8 T 세포 증식 억제를 유도하고, TGF-β, IL-10 같은 면역 억제 사이토카인 및 세포외 아데노신과 키뉴레닌(L-kynurenine, L-KYN)과 같은 면역 억제인자를 가지고 있다. 트립토판 분해 작용으로부터 만들어지는 키뉴레닌의 생성은, IDO1(indoleamine-pyrrole 2,3-dioxygenase) 및/ 또는 TDO(Tryptophan 2,3-dioxygenase)가 상향 조절되기 때문에 종양 세포에서 증가한다. 또한, 키뉴레닌은 effector T 세포 활성화의 억제 및 종양 혈관 신생 촉진과 관련이 있으며, T 세포 사멸, Treg 유도 및 PD-1 상 향 조절과 같은 면역 억제 표현형을 유도하는 T 세포에 존재하는 단백질 수용체 AhR(Aryl hydrocarbon receptor)의 리간드이다. 최근, 키뉴레닌을 줄이는 것이 암에 대한 더 강한 면역 반응을 유도하므로 암 치료에 적용될 수 있다는 것이 입증되었다. 구체적으로, 박테리아 키뉴레닌 분해 효소 중 하나인 키뉴레니나제 (kynureninase, KYNase)가 키뉴레닌을 빠르게 분해하여 동종 이식 암 동물 모델에서 종양 성장을 억제하는 것으 로 보고되었다. 선행기술문헌 특허문헌 (특허문헌 0001) US 2019/0350975 A1, (특허문헌 0002) US 2021/0213059 A1 비특허문헌 (비특허문헌 0001) Nature Biotechnology volume 36, pages 758-764"}
{"patent_id": "10-2023-0085093", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "발명의 내용"}
{"patent_id": "10-2023-0085093", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "이에 본 발명자들은 키뉴레닌(L-kynurenine, L-KYN)에 의해 유도되는 T 세포 증식 억제를 극복하기 위하여, 메 타게놈 분석과 인공지능 방법을 사용하여 반응성이 높은 키뉴레니나제를 발굴하고자 연구한 결과, 신규한 4종의 키뉴레니나제가 기존에 알려진 키뉴레니나제와 유사하거나 보다 높은 촉매 활성을 나타내고, L-KYN에 의해 유도 되는 T 세포 증식 억제를 효과적으로 극복하며, 종양 성장 억제 효과도 현저하게 우수한 것을 확인하고 본 발명 을 완성하였다."}
{"patent_id": "10-2023-0085093", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 과제를 해결하기 위하여, 본 발명의 일 측면은 서열번호 2, 서열번호 3, 서열번호 4 및 서열번호 5의 아미 노산 서열로 구성된 군에서 선택되는 어느 하나의 아미노산 서열로 이루어지는 신규한 키뉴레니나제를 제공한다. 본 발명의 다른 측면은 상기 신규한 키뉴레니나제를 암호화하는 폴리뉴클레오티드를 제공한다. 본 발명의 또 다른 측면은 상기 신규한 키뉴레니나제를 암호화하는 폴리뉴클레오티드를 포함하는 발현벡터를 제 공한다. 본 발명의 또 다른 측면은 상기 발현벡터가 도입된 숙주세포를 제공한다. 본 발명의 또 다른 측면은 상기 신규한 키뉴레니나제를 제조하는 방법을 제공한다. 본 발명의 또 다른 측면은 상기 신규한 키뉴레니나제를 포함하는 암 예방 또는 치료용 약학 조성물을 제공한다. 본 발명의 또 다른 측면은 상기 신규한 키뉴레니나제를 개체에 투여하는 단계를 포함하는 암 예방 또는 치료 방 법을 제공한다. 본 발명의 또 다른 측면은 키뉴레니나제; 및 면역글로불린 Fc 영역을 포함하는 융합단백질 및 이의 항암제 용도 를 제공한다. 본 발명의 또 다른 측면은 키뉴레니나제가 암세포에 발현하는 단백질에 특이적으로 결합하는 항체에 결합된 이 중특이 항체 및 이의 항암제 용도를 제공한다. 본 발명의 또 다른 측면은 상기 융합단백질 또는 상기 이중특이 항체를 포함하는 지질 전달체를 제공한다. 본 발명의 또 다른 측면은 상기 신규한 키뉴레니나제가 도입된 CAR-T 세포를 제공한다."}
{"patent_id": "10-2023-0085093", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 신규한 키뉴레니나제는 기존에 알려진 키뉴레니나제와 유사하거나 보다 높은 촉매 활성 및 열적 안정성을 나타내고, 키뉴레닌(L-kynurenine, L-KYN)에 의해 유도되는 T 세포 증식 억제를 체외 배양 시스템에서 보다 효과적으로 회복시키므로, 면역 억제 종양 미세환경을 극복하기 위한 강력한 치료 효소로서 활용이 가능하 다. 또한, 상기 신규한 키뉴레니나제는 종양 동물 모델에서 우수한 종양 성장 억제 효과를 나타내므로 다양한 암 면역 치료제로서 널리 활용될 것이다."}
{"patent_id": "10-2023-0085093", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "신규한 키뉴레니나제 본 발명의 일 측면은, 서열번호 2, 서열번호 3, 서열번호 4 및 서열번호 5의 아미노산 서열로 구성된 군에서 선 택되는 어느 하나의 아미노산 서열로 이루어지는 신규한 키뉴레니나제를 제공한다. 본 명세서에서 사용된 용어, \"키뉴레니나제(kynureninase)\"는 L-키뉴레닌 가수분해효소(L-Kynurenine hydrolase)라고도 하며, L-키뉴레닌을 가수분해하여 안트라닐산과 알라닌을 생성하는 반응을 촉매하는 효소를 의미한다. 간, 신장, Pseudomonas 등의 세균 및 균류(Neurospora crassa) 등에서 발견되고, 피리독살인산 (pyridoxal phosphate, PLP)을 조효소로 하고 트립토판의 대사 및 니코틴산의 생합성에 관여하는 것으로 알려져 있다. 본 명세서에서 사용된 용어, \"키뉴레닌(Kynurenine)\"은 L-키뉴레닌이라고도 하며, 니아신(niacin) 생산에 사용 되는 아미노산 L-트립토판의 대사산물을 의미한다. C10H12N2O3의 분자식을 가지고, 광학 이성질체 중 L체를 단순 히 키뉴레닌이라고도 부르며, 하기와 같은 화학식 1로 표시될 수 있다. [화학식 1]"}
{"patent_id": "10-2023-0085093", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "키뉴레닌은 주로 간에서 생성되는 트립토판-2,3-디옥시게나아제(tryptophan-2,3-dioxygenase, TDO)와 면역 활성 화에 대한 반응으로 많은 조직에서 생성되는 인돌아민 2,3-디옥시게나아제(Indoleamine 2,3-Dioxygenase, ID O)에 의해 합성된다. 키뉴레닌과 그 추가 분해 산물은 염증시 혈관 확장 및 면역 반응 조절을 포함하여 다양한 생물학적 기능을 수행한다. 일부 암은 키뉴레닌 생성을 증가시켜 종양 성장을 증가시킨다.상기 신규한 키뉴레니 나제는 페길레이션(PEGylation)화된 것일 수 있다. 본 명세서에서 사용된 용어, \"페길레이션(PEGylation 또는 pegylation)\"은 폴리에틸렌 글리콜(polyethylene glycol, PEG) 폴리머 사슬을 약물, 치료 단백질 또는 소포와 같은 거대 구조와 분자에 공유 및 비공유 부착 또 는 융합하는 과정을 의미하고, 이를 PEG화라고 한다. PEG화는 생성된 유도체 또는 응집체 상호작용에 영향을 미 치며, 이는 일반적으로 생체 내에서 제거뿐만 아니라 결합 및 분해 속도를 늦춘다. 본 발명의 일 구현예에서, 상기 신규한 키뉴레니나제는 생체 내 안정성 및 생체 적합성을 증가시키기 위하여, PEG화될 수 있다. 상기 PEG화는 상기 신규한 키뉴레니나제의 활성에 영향을 미치지 않을 수 있다. 상기 신규한 키뉴레니나제는 슈도모나스(Pseudomonas) sp., 보르데텔라(Bordetella) sp., 또는 라인헤이메라 (Rheinheimera) sp. 유래일 수 있다. 본 발명의 일 구현예에서, 상기 신규한 키뉴레니나제는 기존에 알려진 키뉴레니나제(Pseudomonas fluorescence 유래의 키뉴레니나제; WP_017531066.1) 보다 높은 촉매 활성 및 열적 안정성을 나타내고, 키뉴레닌에 의해 유도 되는 T 세포 증식 억제를 체외 배양 시스템에서 보다 효과적으로 회복시키며, 종양 동물 모델에서 우수한 종양 성장 억제 효과를 나타낼 수 있다. 신규한 키뉴레니나제를 암호화하는 폴리뉴클레오티드 본 발명의 또 다른 측면은, 서열번호 7, 서열번호 8, 서열번호 9 및 서열번호 10의 염기서열로 구성된 군에서 선택되는 어느 하나의 염기서열로 이루어진 신규한 키뉴레니나제를 암호화하는 폴리뉴클레오티드를 제공한다. 상기 신규한 키뉴레니나제는 전술한 바와 같다. 상기 폴리뉴클레오티드는 동일한 폴리펩타이드를 암호화한다면, 하나 이상의 염기가 치환, 결실, 삽입 또는 이 들의 조합에 의해 변이될 수 있다. 폴리뉴클레오티드 서열을 화학적으로 합성하여 제조하는 경우, 당업계에 널 리 공지된 합성법, 예를 들어 문헌(Engels and Uhlmann, Angew Chem IntEd Engl., 37:73-127, 1988)에 기술된방법을 이용할 수 있으며, 트리에스테르, 포스파이트, 포스포르아미다이트 및 H-포스페이트 방법, PCR 및 기타 오토프라이머 방법, 고체 지지체 상의 올리고뉴클레오티드 합성법 등을 들 수 있다. 본 발명에 있어서, 상기 폴리뉴클레오티드는 서열번호 7, 서열번호 8, 서열번호 9 또는 서열번호 10의 염기서열 로 구성될 수 있다. 상기 폴리뉴클레오티드는 서열번호 7, 서열번호 8, 서열번호 9 또는 서열번호 10인 각각의 염기서열과 적어도 약 70%, 적어도 약 75%, 적어도 약 80%, 적어도 약 85%, 적어도 약 86%, 적어도 약 87%, 적 어도 약 88%, 적어도 약 89%, 적어도 약 90%, 적어도 약 91%, 적어도 약 92%, 적어도 약 93%, 적어도 약 94%, 적어도 약 95%, 적어도 약 96%, 적어도 약 97%, 적어도 약 98%, 적어도 약 99% 또는 적어도 약 100%의 동일성을 가지는 염기서열을 포함하거나 이들로 이루어질 수 있다. 상기 폴리뉴클레오티드는 신호 서열 또는 선도 서열을 추가적으로 포함할 수 있다. 본 명세서에서 사용된 용어, \"신호 서열(signal sequence)\"은 목적 단백질의 분비를 지시하는 신호 펩타이드를 암호화하는 핵산을 의미한다. 상기 신호 펩타이드는 숙주 세포에서 번역된 후에 절단된다. 구체적으로, 본 발명 의 신호 서열은 ER(endoplasmic reticulum) 막을 관통하는 단백질의 이동을 개시하는 아미노산 서열을 암호화하 는 뉴클레오티드이다. 신호 서열은 당업계에 그 특징이 잘 알려져 있으며, 통상 16 내지 30개의 아미노산 잔기를 포함하나, 그보다 더 많거나 적은 아미노산 잔기를 포함할 수 있다. 통상적인 신호 펩타이드는 기본 N 말단 영역, 중심의 소수성 영 역 및 보다 극성인(polar) C 말단 영역의 세 영역으로 구성된다. 중심 소수성 영역은 미성숙 폴리펩타이드가 이 동하는 동안 막지질 이중층을 통하여 신호 서열을 고정시키는 4 내지 12개의 소수성 잔기를 포함한다. 개시 이후에, 신호 서열은 흔히 신호 펩티다아제(signal peptidases)로 알려진 세포 효소에 의하여 ER의 루멘 (lumen) 내에서 절단된다. 이때, 상기 신호 서열은 tPa(tissue plasminogen activation), HSV gDs(signal sequence of herpes simplex virus glycoprotein D), IgG 신호 서열 또는 성장 호르몬(growth hormone)의 분비 신호 서열일 수 있다. 바람직하게, 포유동물 등을 포함하는 고등 진핵 세포에서 사용되는 분비 신호 서열을 사 용할 수 있다. 본 명세서에서 사용된 용어, \"선도 서열(leader sequence)\"은 개시코돈으로부터 상류(upstream)에 존재하는 메 신저 RNA(mRNA)의 영역으로, 단백질로 번역되지 않은 부분을 의미한다. 폴리뉴클레오티드를 포함하는 발현 벡터 본 발명의 또 다른 측면은, 상기 신규한 키뉴레니나제를 암호화하는 폴리뉴클레오티드를 포함하는 벡터를 제공 한다. 상기 신규한 키뉴레니나제는 전술한 바와 같다. 본 명세서에서 사용하는 용어, \"벡터\"는 숙주 세포에 도입되어 숙주 세포 유전체 내로 재조합 및 삽입될 수 있 다. 또는 상기 벡터는 에피좀으로서 자발적으로 복제될 수 있는 뉴클레오티드 서열을 포함하는 핵산 수단으로 이해된다. 상기 벡터는 선형 핵산, 플라스미드, 파지미드, 코스미드, RNA 벡터, 바이러스 벡터, 미니 염색체 및 이의 유사체들을 포함한다. 바이러스 벡터의 예로는 레트로바이러스, 아데노바이러스 및 아데노 관련 바이러스 를 포함하나 이에 제한되지 않는다. 구체적으로, 상기 벡터는 플라스미드 DNA, 파아지 DNA 등이 될 수 있고, 상업적으로 개발된 플라스미드(pUC18, pBAD, pIDTSAMRT-AMP 등), 대장균 유래 플라스미드(pYG601BR322, pBR325, pUC118, pUC119 등), 바실러스 서브 틸리스 유래 플라스미드(pUB110, pTP5 등), 효모-유래 플라스미드(YEp13, YEp24, YCp50 등), 파아지 DNA(Charon4A, Charon21A, EMBL3, EMBL4, λgt10, λgt11, λZAP 등), 동물 바이러스 벡터(레트로바이러스 (retrovirus), 아데노바이러스(adenovirus), 백시니아 바이러스(vaccinia virus 등), 곤충 바이러스 벡터(배큘 로바이러스(baculovirus) 등) 등이 될 수 있다. 상기 벡터는 숙주 세포에 따라서 단백질의 발현량과 수식 등이 다르게 나타나므로, 목적에 가장 적합한 숙주세포를 선택하여 사용함이 바람직하다. 또한, 상기 플라스미드는 항생제 내성 유전자와 같은 선별 마커를 포함할 수 있고, 플라스미드를 유지하는 숙주 세포는 선택적인 조건하에서 배양될 수 있다. 본 명세서에서 사용하는 용어, 목적 단백질의 \"유전자 발현\" 또는 \"발현\"은 DNA 서열의 전사, mRNA 전사체의 번 역 및 융합 단백질 생산물 또는 이의 단편의 분비를 의미하는 것으로 이해된다. 유용한 발현 벡터는 RcCMV(Invitrogen, Carlsbad) 또는 이의 변이체일 수 있다. 상기 발현 벡터는 포유류 세포에서 목적 유전자의 연속적인 전사를 촉진하기 위한 인간 CMV(cytomegalovirus) 프로모터 및 전사 후 RNA의 안정 상태 수준을 높이기 위한 우태 성장 인자(bovine growth hormone) 폴리아데닐레이션 신호서열을 포함할 수 있다. 신규한 키뉴레니나제를 발현하는 형질전환 세포 본 발명의 또 다른 측면은, 상기 신규한 키뉴레니나제를 암호화하는 폴리뉴클레오티드를 포함하는 발현 벡터가 도입된 형질전환 세포를 제공한다. 상기 신규한 키뉴레니나제는 전술한 바와 같다. 본 명세서에서 사용된 용어, \"형질전환 세포\"는 재조합 발현 벡터가 도입될 수 있는 원핵 세포 및 진핵 세포를 나타낸다. 상기 형질전환 세포는 벡터를 숙주 세포에 도입하여 형질전환시켜서 제작될 수 있다. 또한, 상기 벡 터에 포함된 폴리뉴클레오티드를 발현시켜 본 발명의 신규한 키뉴레니나제를 생산할 수 있다. 상기 형질전환은 다양한 방법에 의하여 수행될 수 있다. 본 발명의 신규한 키뉴레니나제를 생산할 수 있는 한, 특별히 이에 제한되지 않는다, 구체적으로, 상기 형질전환 방법은 CaCl2 침전법, CaCl2 침전법에 DMSO(dimethyl sulfoxide)라는 환원 물질을 사용함으로써 효율을 높인 Hanahan 방법, 전기천공법(electroporation), 인산 칼 슘(calcium phosphate) 침전법, 원형질 융합법, 실리콘 카바이드 섬유를 이용한 교반법, 아그로박테리아 매개된 형질전환법, PEG를 이용한 형질전환법, 덱스트란 설페이트, 리포펙타민 및 건조/억제 매개된 형질전환 방법 등 이 사용될 수 있다. 또한, 감염(infection)을 수단으로 하여 바이러스 입자를 사용하여 목적물을 세포 내로 전 달시킬 수 있다. 또한, 유전자 밤바드먼트 등에 의해 벡터를 숙주세포 내로 도입할 수 있다. 또한, 상기 형질전환 세포의 제작에 사용되는 숙주세포 역시 본 발명의 신규한 키뉴레니나제를 생산할 수 있는 한, 특별히 이에 제한되지 않는다. 구체적으로 상기 숙주 세포는 원핵 세포, 진핵 세포, 포유동물, 식물, 곤충, 균류 또는 세포성 기원의 세포를 포함할 수 있지만 이에 한정되지 않는다. 상기 원핵 세포의 일 예로는 대장균 을 사용할 수 있다. 또한, 진핵 세포의 일 예로는 효모를 사용할 수 있다. 또한, 상기 포유동물 세포로 CHO 세 포, F2N 세포, COS 세포, BHK 세포, 바우스(Bowes) 흑색종 세포, HeLa 세포, 911 세포, AT1080 세포, A549 세 포, SP2/0 세포, 인간 림프아구(human lymphoblastoid), NSO 세포, HT-1080 세포, PERC.6 세포, HEK293 세포 또는 HEK293T 세포 등을 사용할 수 있으나, 이에 한정되지 않으며, 당업자에게 알려진 포유동물 숙주 세포로 사 용 가능한 세포는 모두 이용 가능하다. 신규한 키뉴레니나제의 제조방법 본 발명의 또 다른 측면은, 상기 신규한 키뉴레니나제를 제조하는 방법을 제공한다. 상기 신규한 키뉴레니나제 는 전술한 바와 같다. 상기 신규한 키뉴레니나제를 제조하는 방법은 i) 상기 형질전환된 숙주 세포를 배양하는 단계; 및 ii) 상기 세 포 배양물로부터 신규한 키뉴레니나제를 수득하는 단계를 포함할 수 있다. 상기 형질전환 세포를 배양하는 방법은 당업계에 널리 알려져 있는 방법을 이용하여 수행할 수 있다. 구체적으 로, 상기 배양은 본 발명의 신규한 키뉴레니나제를 발현시켜서 생산할 수 있는 한 특별히 이에 제한되지 않는다. 구체적으로, 상기 배양은 배치 공정 또는 주입 배치 또는 반복 주입 배치 공정(fed batch or repeated fed batch process)에서 연속식으로 배양할 수 있다. 또한, 배양물로부터 상기 신규한 키뉴레니나제를 수득하는 단계는 당업계에 공지된 방법에 의해 수행될 수 있다. 구체적으로, 상기 수득 방법은 생산된 본 발명의 신규한 키뉴레니나제를 수득할 수 있는 한, 특별히 이에 제한되지 않는다. 바람직하게는, 상기 수득 방법은 원심분리, 여과, 추출, 분무, 건조, 증발, 침전, 결정화, 전 기영동, 분별용해(예를 들면, 암모늄설페이트 침전), 크로마토그래피(예를 들어, 이온 교환, 친화성, 소수성 및 크기배제) 등의 방법일 수 있다. 신규한 키뉴레니나제의 용도 본 발명의 또 다른 측면은, 상기 신규한 키뉴레니나제를 유효성분으로 포함하는 암 예방 또는 치료용 약학 조성 물을 제공한다. 본 발명의 또 다른 측면은, 상기 신규한 키뉴레니나제를 개체에 투여하는 단계를 포함하는 암을 예방 또는 치료 하는 방법을 제공한다. 본 명세서에서 사용된 용어, \"암(cancer)\"은 세포가 정상적인 성장 한계를 무시하고 분열 및 증식하는 공격적인 (aggressive) 특성, 주위 조직에 침투하는 침투적인(invasive) 특성 및 체내의 다른 부위로 퍼지는 전이적인 (metastatic) 특성을 갖는 세포에 의한 질병을 총칭하는 의미하며, 악성 종양(tumor)과 동일한 의미로사용된다. 상기 암은 키뉴레린이 과발현된 것을 특징으로 할 수 있다. 또한, 상기 암은 흑색종, 위암, 간암, 폐암, 대장암, 유방암, 전립선암, 난소암, 췌장암, 자궁경부암, 갑상선암, 후두암, 급성 골수성 백혈병, 뇌종양, 신경 모세포종, 망막 모세포종, 두경부암, 침샘암 및 림프종으로 구성된 군으로부터 선택되는 어느 하나인 것일 수 있다. 또한, \"암의 치료\"는 암 세포 또는 조직의 성장을 억제하거나 예방한다는 것을 의미하고, 이는 치료하거나 처리 하지 않았을 때와 비교시에 암의 성장 및 암 전이를 감소시키고, 항암제에 대한 내성을 줄여 치료 효과가 더 발 휘되도록 하는 것도 포함하는 개념이다. 상기 암 전이(metastasis)는 종양(암) 세포가 신체의 멀리 떨어진 부분 으로 확산되는 과정을 의미하고, \"항암제에 대한 내성\" 또는 \"항암제 내성\"이란 항암제를 이용하여 암 환자를 치료할 때, 치료 초기부터 치료 효과가 없거나 초기에는 암 치료 효과가 있으나 계속적인 치료 과정에서 암 치 료 효과가 상실되는 것을 의미한다. \"예방\"은 상기 약학 조성물의 투여에 의해 암의 발생을 억제하거나 그의 발 병을 지연시키는 모든 행위를 말한다. 본 발명의 암 예방 또는 치료용 약학 조성물에서 상기 신규한 키뉴레니나제가 항암 활성을 나타낼 수 있는 한, 용도, 제형, 배합 목적 등에 따라 임의의 양(유효량)으로 포함될 수 있다. 여기서, \"유효량\"이란 항암 효과를 유도할 수 있는 유효성분의 양을 말한다. 이러한 유효량은 당업자의 통상의 능력 범위 내에서 실험적으로 결정 될 수 있다. 본 발명의 약학 조성물은 유효성분으로서 상기 항체 또는 이의 단편을 조성물의 총 중량을 기준으 로 약 0.1 중량% 내지 약 90 중량%, 구체적으로 약 0.5 중량% 내지 약 75 중량%, 보다 구체적으로 약 1 중량% 내지 약 50 중량%로 함유할 수 있다. 본 발명의 약학 조성물은, 통상적인 방법에 따라 제제로 배합되는 통상적이고 무독성인 약학적으로 허용가능한 담체를 포함할 수 있다. 상기 약학적으로 허용 가능한 담체는 환자에게 전달하기에 적절한 비-독성 물질이면 어떠한 담체라도 가능하다. 증류수, 알코올, 지방, 왁스 및 비활성 고체가 담체로 포함될 수 있다. 약물학적으로 허용되는 애쥬번트(완충제, 분산제) 또한 약물학적 조성물에 포함될 수 있다. 본 명세서에서 사용된 용어, \"약학적으로 허용가능한 담체\"란 생물체를 자극하지 않고 투여 화합물의 생물학적 활성 및 특성을 저해하지 않는 담체 또는 희석제를 말한다. 액상 용액으로 제제화되는 조성물에 있어서 허용되 는 약학적 담체로는, 멸균 및 생체에 적합한 것으로서, 식염수, 멸균수, 링거액, 완충 식염수, 알부민 주사용액, 덱스트로즈 용액, 말토 덱스트린 용액, 글리세롤, 에탄올 및 이들 성분 중 한 성분 이상을 혼합하여 사용할 수 있으며, 필요에 따라 감미제, 용해 보조제, 습윤제, 유화제, 등장화제, 흡수제, 항산화제, 보존제, 활택제, 충전제, 완충액, 정균제 등 다른 통상의 첨가제를 첨가할 수 있다. 본 발명의 조성물은 비경구 투여(예컨대, 근육내, 정맥내 또는 피하 주사)를 위한 다양한 제형으로 제조될 수 있다. 본 발명의 약학 조성물이 비경구용 제형으로 제조될 경우, 적합한 담체와 함께 당업계에 공지된 방법에 따라 주사제, 경피 투여제, 비강 흡입제 및 좌제의 형태로 제제화될 수 있다. 주사용 제제에는 멸균된 수용액제, 비수성용제, 현탁제, 유제, 동결건조 제제 및 좌제가 포함된다. 비수성용제, 현탁제로는 프로필렌글리콜, 폴리에틸렌글리콜, 올리브 오일과 같은 식물성 기름, 에틸올레이트와 같은 주사 가 능한 에스테르 등이 사용될 수 있다. 좌제의 기제로는 위텝솔, 마크로골, 트윈61, 카카오지, 라우린지, 글리세 로제라틴 등이 사용될 수 있다. 한편, 주사제에는 용해제, 등장화제, 현탁화제, 유화제, 안정화제, 방부제 등과 같은 종래의 첨가제가 포함될 수 있다. 약제학적 조성물의 제제화와 관련하여서는 당업계에 공지되어 있으며, 구체적으로 문헌[Remington's Pharmaceutical Sciences(19th ed., 1995)] 등을 참조할 수 있다. 상기 문헌은 본 명세서의 일부로서 간주된다. 본 발명의 항체 또는 조성물은 치료학적으로 유효한 양 또는 약학적으로 유효한 양으로 환자에게 투여될 수 있 다. 본 명세서에서 사용된 용어, \"투여\"란, 적절한 방법으로 개체에게 소정의 물질을 도입하는 것을 의미하며, 상기 조성물의 투여 경로는 목적 조직에 도달할 수 있는 한 어떠한 일반적인 경로를 통하여 투여될 수 있다. 복강내 투여, 정맥내 투여, 근육내 투여, 피하 투여, 피내 투여, 국소 투여, 비내 투여, 직장내 투여될 수 있으나, 이 에 한정되지는 않는다.여기서 \"치료학적으로 유효한 양\" 또는 \"약학적으로 유효한 양\"이란 대상 질환을 예방 또는 치료하는데 유효한 조성물의 양으로서, 의학적 치료에 적용 가능한 합리적인 수혜/위험 비율로 질환을 치료하기에 충분하며 부작용 을 일으키지 않을 정도의 양을 의미한다. 상기 유효량의 수준은 환자의 건강 상태, 질환의 종류, 중증도, 약물 의 활성, 약물에 대한 민감도, 투여 방법, 투여 시간, 투여 경로 및 배출 비율, 치료 기간, 배합 또는 동시 사 용되는 약물을 포함한 요소 및 기타 의학 분야에 잘 알려진 요소에 따라 결정될 수 있다. 구체적으로, 상기 치료학적으로 유효한 양은 암을 치료하는데 효과적인 약물의 양을 의미한다. 본 발명의 조성 물에서 신규한 키뉴레니나제의 유효량은 환자의 나이, 성별, 체중에 따라 달라질 수 있으며, 일반적으로는 체중 kg 당 약 0.1 mg 내지 약 1,000 mg, 또는 약 5 mg 내지 약 200 mg을 매일 또는 격일 투여하거나 1일 1회 내지 3회로 나누어 투여할 수 있다. 그러나, 투여 경로, 질병의 중증도, 성별, 체중, 연령 등에 따라서 증감될 수 있 으므로, 본 발명의 범위는 이에 한정되지 않는다. 본 발명의 신규한 키뉴레니나제 또는 이를 포함하는 약학 조성물은 개별 치료제로 투여하거나 다른 치료제와 병 용하여 투여될 수 있고, 종래의 치료제와 순차적으로 또는 동시에 투여될 수 있으며, 단일 또는 다중 투여될 수 있다. 이때, 상기 다른 치료제는 항암 활성의 상승, 보강을 위하여 이미 안전성이 검증되고 항암 활성을 갖는 것으로 공지된 임의의 화합물이나 천연 추출물을 추가로 포함할 수 있다. 상기한 요소들을 모두 고려하여 최소 한의 부작용으로 또는 부작용 없이 최소한의 양으로 최대 효과를 얻을 수 있는 양을 투여하는 것이 중요하며, 이는 당업자에 의해 용이하게 결정될 수 있다. 키뉴레니나제 및 면역글로불린 Fc 영역을 포함하는 융합단백질 및 이의 용도 본 발명의 또 다른 측면은, 키뉴레니나제; 및 면역글로불린 Fc 영역을 포함하는 융합단백질을 제공한다. 상기 키뉴레니나제는 서열번호 2, 서열번호 3, 서열번호 4 및 서열번호 5의 아미노산 서열로 구성된 군에서 선 택되는 어느 하나의 아미노산 서열인 것일 수 있다. 본 발명의 또 다른 측면은, 키뉴레니나제; 및 면역글로불린 Fc 영역을 포함하는 융합단백질 두개가 결합된 융합 단백질 이량체를 제공한다. 본 발명의 또 다른 측면은, 상기 융합단백질 이량체를 포함하는 약학 조성물을 제공한다. 이때, 상기 약학 조성물은 항암제일 수 있다. 또한, 암은 상술한 바와 같다. 키뉴레니나제가 포함된 이중특이 항체 및 이의 용도 본 발명의 또 다른 측면은, 암세포에 발현하는 단백질에 특이적으로 결합하는 항체에 키뉴레니나제가 결합된 이 중특이 항체를 제공한다. 이때, 상기 암세포에 발현하는 단백질은 EGFR, VEGFR, CD20, CD38, RNAK-L, BTK, Bcr-abl, PDGFR/FGFR 계열, MEK/RAF/KRAS, HER2/Neu, Ubiquitin, JAK, ALK, PARP, TGFβRI, Proteasome, Bcl-2, C-Met, VR1, VR2, VR3, c-kit, AXL, RET, Braf, DNMT, CDK4/6, 및 STING으로 이루어진 군; 또는 CTLA-4, PD-1, PD-L1, PD-L2, B7-H4, HVEM, TIM3, GAL9, LAG3, VISTA, KIR, BTLA, 및 TIGIT로 이루어진 군에서 선택되는 어느 하나인 것일 수 있다. 본 발명의 또 다른 측면은, 상기 이중특이 항체를 포함하는 항암제를 제공한다. 키뉴레니나제를 포함하는 전달체 본 발명의 또 다른 측면은, 상기 신규한 키뉴레니나제; 상기 융합단백질; 상기 융합단백질 이량체; 또는 상기 이중특이 항체를 포함하는 지질 전달체를 제공한다. 상기 지질 전달체는 나노파티클(nano-particle), 엑소좀(exosome), 또는 리포솜(liposome)일 수 있다. 키뉴레니나제가 발현된 면역 세포 및 이의 용도 본 발명의 또 다른 측면은, 하기 (i) 내지 (v)를 포함하는 융합단백질을 코딩하는 폴리뉴클레오티드를 제공한다: (i) 제1항의 신규한 키뉴레니나제; (ii) 막관통 도메인; (iii) 적어도 하나의 공자극 도메인을 포함하는 세포내 신호전달 도메인; (iv) 자가-절단성 펩타이드; 및 (v) 신호 기전 조절 인자. 이때, (i) 제1항의 신규한 키뉴레니나제와 (ii) 막관통 도메인 사이에는 스페이서를 더 포함할 수 있다. 본 발명의 또 다른 측면은, 상기 폴리뉴클레오티드가 도입된 면역 세포를 제공한다. 이때, 상기 면역 세포는 T 세포 또는 NK 세포 일 수 있다. 본 발명의 또 다른 측면은, 상기 면역 세포를 포함하는 항암제를 포함한다. 이하, 실시예를 통하여 본 발명을 더욱 상세히 설명하고자 한다. 이들 실시예는 오로지 본 발명을 예시하기 위 한 것으로, 본 발명의 범위가 이들 실시예에 의해 제한되는 것으로 해석되지 않는 것은 당업계에서 통상의 지식 을 가진 자에게 있어서 자명할 것이다. 실시예 1. 신규한 키뉴레니나제의 선별 및 준비 실시예 1.1. 신규한 키뉴레니나제의 선별 실시예 1.1.1. 메타게놈을 이용한 신규한 키뉴레니나제의 발굴 MMseq2의(버전 3fa46) 반복적 검색(--num-iterations 3 -s 7.5 -c 0.9)을 사용하여, 메타게놈 단백질 서열 및 배양된 생명체의 단백질 서열 데이터베이스(UniProt C. UniProt: a worldwide hub of protein knowledge. Nucleic acids research 2019;47:D506-D15) 에 존재하는 총 3,144,354,589개 잠재 단백질 서열에 대하여 슈도 모나스 플루오레센스(Pseudomonas fluorescence) 유래의 키뉴레니나제(kynureninase) 단백질 서열 (WP_017531066.1; K1)과 유사한 단백질을 검색하였다. 이를 통하여, E-value가 10-3 미만이면서 최소 90%의 양방향 서열 유사도를 보이는 10,195개의 서열을 찾았다. 중복성을 줄이기 위해 MMseq2의 필터 결과 모듈을 사용하여 세트의 다른 서열에 대해 최소 90% 서열 일치를 가 진 서열을 필터링하여 제거하여 5,690개의 서열을 수득하였다. 메타게놈 서열은 분류학적 레이블을 포함하지 않 기 때문에, UniProtKB/TrEMBL+Swiss-Prot(2020_05) 데이터베이스에서 발굴된 서열을 MMseq2의 분류학적 방법을 통해 분석함으로써 분류 레이블을 결정하였다(도 1). 실시예 1.1.2. 시퀀스 임베딩을 이용한 반응성 키뉴레니나제의 예측 발굴된 각 단백질 서열에 대해 ESM 사전학습된 랭귀지 모델(ESM pre-trained language model)에 의해 생성된 임베딩을 기반으로 한 예측기를 사용하여 반응속도 매개변수 중 하나인 촉매 효율성(kcat/KM)을 예측하였다. 예측 자는 먼저 랭귀지 모델을 사용하여 단백질 시퀀스를 fixed size vector-space 임베딩으로 변환하고 랜덤 포레스 트 회귀 모델(random forest regression model)을 적용하여 kcat/KM을 예측한다. 예측자를 만들기 위하여, kcat/KM 측정치를 갖는 159개의 서열로 구성된 학습 세트를 먼저 생성하였다. 152개의 서열은 미국 공개특허 2019/0350975 A1에서 발췌한 것으로 기준과 평균 96.5% 서열 동일성을 가지고 있는 호모 사피엔스의 키뉴레니나제였다. 나머지 7개의 서열은 이전에 발표된 호모 사피엔스(Homo Sapiens), 무스 무스쿨 루스(Mus musculus), 무실라기니박터 팔루디스(Mucilaginibacter Paludis), 아시네토박터 바우만니 (Acinetobacter Baumannii), 사이클로박테륨 마리눔(Cyclobacterium marinum), 클라미도필라 페코룸 (Chlamydophila pecorum)과 슈도모나스 플루오레센스(Pseudomonas fluorescens) 유래 효소 서열에서 나왔다. 각 시퀀스에 대해 ESM-1 랭귀지 모델을 사용하여 1,280 차원의 벡터 표현(vector representation of 1280 dimensions)을 계산하였다. 무작위로 159개의 임베딩을 20% 검증 세트 및 80% 훈련 세트로 먼저 나누고, 임베딩 을 input, kcat/KM을 output으로 사용하여 KNN(K-nearest neighbors algorithm), SVR(Support Vector Regression), 랜덤 포레스트(random forest) 기반의 세 개의 회귀 모델을 학습시켰다. 이러한 예측자의 검증 세 트에서 측정된 스피어맨 상관관계(spearman correlations)는 각각 0.802, 0.756 및 0.813이었다. 인간 효소 서열에 포함된 19개의 아미노산을 야생형이 아닌 돌연변이로 대체하는 과정을 인실리코 방법으로 수 행하였고, 이후 돌연변이된 효소들의 kcat/KM 수치를 예측하였다. 상위 100개의 돌연변이 중 56개가 키뉴레닌 효 소의 기질 결합 포켓에 해당되는 240-290 위치에 있었다. 랜덤 포레스트 예측자를 사용하여 MMseq2에서 탐지된 5,690개의 단백질 서열에 대한 효소 활성 순위를 매겼다. 상위 10개 서열 중 4개는 메타게놈으로부터 슈도모나스 종에서 예측되었고, 나머지 6개는 다양한 단백질 박테리 아에서 온 것으로 예측되었다. 일반적인 경향으로, 예측자는 진핵생물 보다 박테리아의 서열에서 더 높은 kcat/KM 을 예측한다. 최상위 순위의 서열은 슈도모나스 속 유래 단백질, Uniprot KYN 단백질(A0A0Q5EY38)(K2)로, 이전 모델 학습에 사용한 슈도모나스 플루오레센스(P. fluorescens) K1 과 70.6% 서열 동일성을 가지고 있고, 그 다 음으로 슈도모나스 sp. 유래 서열(K3) 그리고 보르데텔라(Bordetella) sp. 유래 서열(K4)이다. 추가 비교를 위 하여, 31위를 차지한 라인헤이메라(Rheinheimera) sp. 유래 서열(K5)도 선택하였다. 기존에 알려진 키뉴레니나 제(K1) 및 선별된 키뉴레니나제(K2-K5)의 아미노산 서열은 하기 표 1에 기재된 바와 같다. 표 1 단백질 아미노산 서열 서열 번호 K1 from Pseudomonas fluorescenceMTSRSHCQTLDAQDPLAPLRDQFALPAGVIYLDGNSLGARPVASLARAQQVIAEEWGNGLIRSWNSAGWADLSL RLGNRLAPLIGAGAGEVAITDTTSINLFKVLSAALTVQRQREPARKVIVSEASNFPTDLYIAEGLAELLQQGYC LRLVNSPDELPQAIDADVAVVMLTHVNYKTGYMYDMQALTALSHECGALSIWDLAHSAGAVPIDLRAAGADYAI GCTYKYLNGGPGSQAFVWVNPALVDQVRQPLSGWFGHTRQFAMESNYAPSAGIARYLCGTQPITSLAMVECGLQ IFEQTDMACLRRKSLALTDLFIALVEARCAAHGLVLITPREHARRGSHVSFEHPEGYAVIQALIARGVIGDYRE PRIMRFGFTPLYTRFSEVWDAVEILGEILDESTWDQPQFKVRHSVT1 K2 from Pseudomonas sp.MATQQHLRELDLADPLAALRDEFALPEGVIYLDGNSLGARPKAALARATQMIEQEWGEGLIRSWNTAQWSTLSA RLGDKLAPLIGADSGEVVITDTTTVNLFKILAAGLRIQAERAPQRKIILSELHNFPADLYVIEGLADLLQQGYE LRLIERPQDLPGLLDDQVALVLLTHVNYKSGHMYDMTATTGLIHQHGALALWDLAHSAGAVPVQLKAANADYAI GCTYKYLNGGPGSPAFVWVSPQLCDQVWQPLSGWWGHARQFAMEPHYAPASGITRYLCGTQPLVSLGMVESGLD IFAKTSMQALRNKSLALTDLFIELVEARCKDHPLTLITPRDHAQRGSHVSFEHPEGYAVVQALIARGVIGDYRE PRIMRFGFTPLYTSFQDVGAAVQALVEVLDSQQWREPQFQTRHSVT2 K3 from Pseudomonas sp.MITRNDCLALDAQDPLAHLRHQFALPEGVIYLDGNSLGARPIAALERAQAVIAEEWGNGLIRSWNSAGWLDLPE RLGNRLAGLIGAGEGEVVVTDTTSINLFKVLGAALRVQAMRAPTRRVIVSESSNFPTDLYIAEGLMDLLQQGYS LRLVDSPEELAQAIDQDTAVVMLTHVNYKTGYMHDMQAVTVLIHECGALAIWDLAHSAGAVPVDLRQAGADYAI GCTYKYLNGGPGSQAFVWVAPQLCDLVTQPLSGWFGHSRQFDMASGYEPSSGIARYLCGTQPITSLAMVECGLE IFAQTDMPSLRRKSLALTDLFIQMVEQRCAAHDLKLITPREHARRGSHVSFEHPQGYAVIQALIARGVIGDYRE PRIMRFGFTPLYTSFTEVFDAVQILGEILDQQTWSQAQFQVRHSVT3 K4 from Bordetella sp.MHTREACLQADQQDPLAPLKAQFDIPAGVLYMDGNSLGVLPKAAVARSAQVIQQEWGQGLIRSWNDASWFELPS RLGDKLGRLIGAGTGQVVVTDTTSLNLFKSLAAAIRIQQQAAPQRKIIVSERDNFPTDLYMIQGMIDLLQQGYE MRLVDEDLSLEQALDDSVAVLLLSHVNYRTGHMYDMADVTAQAHARGALTIWDLAHAAGAVPVDLTGANADFAV GCTYKYLNGGPGAPAFIWVAPRHTDHFWQPLSGWWGHQRPFDMAVNYEPAGGIRRYLCGTQPIVSLSLVECGLD ISLQADMNEVRRKSLALTDLFIALVESRCARHPLTLVTPREHAHRGSHVSLRHPHGYAVMQALIARGVIGDYRE PEVLRFGFTPLYFGYTDVWDAVEILTDVLDSEIWKQPEFSRRGAVT4 K5 from Rheinheimera sp.MTCAALQQRDIDDPLSGKRAAFYLPDNTLYLDGNSLGAMPKIAAERAAEVVSQQWGEGLITSWNRHHWIDLPFS VGDKIGHLIGAAPGQVICCDSTSVNLFKVLCAALSLQPARSKVLSVSGNFPTDLYMVEGLSALTGNNHYQLQLV DESELEQAITGQVAVLLLTHVDFRSGRLFDMAKLTRLAQDKGALVIWDLAHSAGALPLALDQCHVDFAVGCGYK YLNGGPGAPAFLYAAKRHHAMLQQPLTGWMGHKTPFSFSTQYEKASGIAQFLTGTPPVISMSVLDAALDVFADV DIAQLRQKSLALSDCFHQLVSQNDCLNELERITPYAAAERGSQLAYRHPQAYALCQALIKQGVIADFRAPDILR LGFTPLYLRYIDVWTAVEILADVMRSSEYLKAEYQIKQKVT5 실시예 1.2. 플라스미드 제작 기존에 알려진 슈도모나스 플루오레센스 유래 키뉴레니나제(K1) 유전자와 실시예 1.1에서 인공지능으로 선별된 키뉴레니나제(K2-K5) 유전자를 각각 대장균에서 이종 발현을 위한 코돈 최적화 후 합성하였다(Gene universal). 이후, 합성된 유전자 단편을 NdeI 과 XhoI로 절단한 후, pET-28b(+) 벡터에 삽입하여 N-His6이 태그된 키뉴레니 나제를 발현하는 플라스미드를 제작하였다. 플라스미드 제작에 사용된 키뉴레니나제를 암호화하는 유전자의 염 기서열은 하기 표 2에 기재된 바와 같고, N-His6이 태그된 키뉴레니나제를 암호화하는 유전자의 염기서열을 하기 표 3에 기재된 바와 같다.표 2 유전자 염기서열 서열 번호 K1 from Pseudomonas fluorescenceATGACCAGCCGTAGCCATTGCCAGACCCTGGATGCACAGGATCCGCTGGCCCCGCTGCGTGATCAGTTTGCCC TGCCGGCCGGTGTTATTTATCTGGATGGTAATAGTCTGGGTGCACGTCCGGTTGCCAGCCTGGCCCGTGCTCA GCAGGTGATTGCAGAAGAATGGGGTAATGGCCTGATTCGTAGTTGGAATAGTGCCGGCTGGGCAGATCTGAGT CTGCGTCTGGGTAATCGCCTGGCCCCGTTAATTGGTGCCGGCGCCGGCGAAGTGGCCATTACCGATACCACCA GTATTAATCTGTTTAAAGTGCTGAGCGCCGCCCTGACCGTTCAGCGCCAGCGTGAACCGGCCCGTAAAGTTAT TGTGAGCGAAGCCAGTAATTTTCCGACCGATCTGTATATTGCCGAAGGCCTGGCAGAACTGCTGCAGCAGGGT TATTGCCTGCGCCTGGTTAATAGTCCGGATGAACTGCCGCAGGCAATTGATGCAGATGTTGCCGTTGTTATGC TGACCCATGTTAATTATAAAACCGGCTATATGTACGATATGCAGGCCCTGACCGCCCTGAGCCATGAATGTGG CGCACTGAGTATTTGGGATCTGGCCCATAGTGCAGGTGCCGTGCCGATTGATCTGCGCGCAGCCGGTGCCGAT TATGCAATTGGCTGCACCTATAAATATCTGAATGGCGGTCCGGGCAGTCAGGCCTTTGTTTGGGTTAATCCGG CCCTGGTGGATCAGGTGCGTCAGCCGCTGAGTGGTTGGTTTGGCCATACCCGCCAGTTTGCAATGGAAAGTAA TTATGCACCGAGCGCAGGCATTGCCCGTTATCTGTGCGGCACCCAGCCGATTACCAGTCTGGCAATGGTTGAA TGTGGCCTGCAGATTTTTGAACAGACCGATATGGCCTGCCTGCGTCGCAAAAGTCTGGCACTGACCGATCTGT TTATTGCACTGGTGGAAGCACGTTGTGCAGCACATGGTCTGGTTCTGATTACCCCGCGTGAACATGCACGTCG TGGCAGTCATGTTAGTTTTGAACATCCGGAAGGCTATGCAGTGATTCAGGCACTGATTGCCCGCGGCGTGATT GGCGATTATCGCGAACCGCGCATTATGCGTTTTGGCTTTACCCCGCTGTATACCCGTTTTAGTGAAGTTTGGG ATGCCGTGGAAATTCTGGGTGAAATTCTGGATGAAAGCACCTGGGATCAGCCGCAGTTTAAAGTGCGCCATAG TGTTACC6 K2 from Pseudomonas sp.ATGGCAACCCAGCAGCATCTGCGTGAACTGGATCTGGCAGATCCGCTGGCCGCACTGCGTGATGAATTTGCCC TGCCGGAAGGCGTTATTTATCTGGATGGTAATAGTCTGGGTGCACGCCCGAAAGCCGCCCTGGCTCGTGCTAC CCAGATGATTGAACAGGAATGGGGCGAAGGTCTGATTCGCAGTTGGAATACCGCACAGTGGAGTACCCTGAGC GCCCGTCTGGGTGATAAACTGGCACCGCTGATTGGTGCCGATAGTGGTGAAGTTGTGATTACCGATACCACCA CCGTTAATCTGTTTAAAATTCTGGCCGCAGGTCTGCGTATTCAGGCCGAACGCGCACCGCAGCGCAAAATTAT TCTGAGCGAACTGCATAATTTCCCGGCCGATCTGTATGTTATTGAAGGTCTGGCAGATCTGCTGCAGCAGGGT TATGAACTGCGTCTGATTGAACGCCCGCAGGATCTGCCGGGCCTGCTGGATGATCAGGTTGCACTGGTTCTGC TGACCCATGTGAATTATAAAAGCGGTCACATGTATGATATGACCGCCACCACCGGTCTGATTCATCAGCATGG CGCACTGGCCCTGTGGGATCTGGCCCATAGCGCAGGTGCAGTGCCGGTGCAGCTGAAAGCCGCAAATGCCGAT TATGCCATTGGTTGCACCTATAAATATCTGAATGGCGGCCCGGGCAGTCCGGCATTTGTGTGGGTTAGCCCGC AGCTGTGTGATCAGGTGTGGCAGCCGCTGAGCGGTTGGTGGGGTCATGCACGTCAGTTTGCCATGGAACCGCA TTATGCCCCGGCAAGTGGTATTACCCGTTATCTGTGCGGCACCCAGCCGCTGGTGAGTCTGGGTATGGTGGAA AGTGGCCTGGATATTTTTGCAAAAACCAGCATGCAGGCACTGCGCAATAAAAGTCTGGCCCTGACCGATCTGT TTATTGAACTGGTGGAAGCACGCTGTAAAGATCATCCGCTGACCCTGATTACCCCGCGTGATCATGCACAGCG TGGCAGCCATGTGAGTTTTGAACATCCGGAAGGCTATGCCGTGGTGCAGGCCCTGATTGCCCGTGGTGTGATT GGCGATTATCGCGAACCGCGCATTATGCGCTTTGGTTTTACCCCGCTGTATACCAGCTTTCAGGATGTGGGCG CCGCAGTTCAGGCACTGGTTGAAGTTCTGGATAGTCAGCAGTGGCGTGAACCGCAGTTTCAGACCCGTCATAG TGTTACC7 K3 from Pseudomonas sp.ATGATCACCCGTAATGATTGTCTGGCACTGGATGCACAGGATCCGCTGGCACATCTGCGTCATCAGTTTGCAC TGCCGGAAGGCGTTATTTATCTGGATGGCAATAGTCTGGGTGCCCGCCCGATTGCAGCACTGGAACGCGCACA GGCAGTGATTGCCGAAGAATGGGGTAATGGTCTGATTCGCAGCTGGAATAGCGCCGGTTGGCTGGATCTGCCG GAACGTCTGGGCAATCGTCTGGCCGGCCTGATTGGTGCAGGTGAAGGCGAAGTTGTGGTTACCGATACCACCA GTATTAATCTGTTTAAAGTTCTGGGCGCCGCCCTGCGCGTTCAGGCAATGCGTGCCCCGACCCGTCGTGTGAT TGTTAGTGAAAGTAGCAATTTTCCGACCGATCTGTATATTGCAGAAGGTCTGATGGATCTGCTGCAGCAGGGC TATAGCCTGCGCCTGGTGGATAGCCCGGAAGAACTGGCCCAGGCCATTGATCAGGATACCGCAGTGGTGATGC TGACCCATGTTAATTATAAAACCGGTTATATGCACGATATGCAGGCCGTGACCGTGCTGATTCATGAATGTGG TGCACTGGCAATTTGGGATCTGGCACATAGTGCAGGTGCCGTGCCGGTGGATCTGCGTCAGGCAGGCGCCGAT TATGCAATTGGTTGCACCTATAAATATCTGAATGGCGGTCCGGGTAGCCAGGCATTTGTGTGGGTTGCACCGC AGCTGTGCGATCTGGTTACCCAGCCGCTGAGTGGCTGGTTTGGCCATAGCCGTCAGTTTGATATGGCCAGTGG CTATGAACCGAGTAGTGGTATTGCCCGCTATCTGTGTGGCACCCAGCCGATTACCAGTCTGGCCATGGTTGAA TGTGGCCTGGAAATTTTTGCACAGACCGATATGCCGAGCCTGCGCCGCAAAAGTCTGGCACTGACCGATCTGT TTATTCAGATGGTGGAACAGCGTTGTGCAGCCCATGATCTGAAACTGATTACCCCGCGCGAACATGCACGTCG CGGCAGTCATGTGAGTTTTGAACATCCGCAGGGTTATGCCGTTATTCAGGCACTGATTGCCCGTGGCGTTATT GGTGATTATCGTGAACCGCGCATTATGCGCTTTGGTTTTACCCCGCTGTATACCAGTTTTACCGAAGTTTTTG ATGCAGTTCAGATTCTGGGCGAAATTCTGGATCAGCAGACCTGGAGCCAGGCACAGTTTCAGGTGCGCCATAG CGTTACC8K4 from Bordetella sp.ATGCATACCCGTGAAGCCTGCCTGCAGGCCGATCAGCAGGATCCGCTGGCACCGCTGAAAGCACAGTTTGATA TTCCGGCCGGCGTGCTGTATATGGATGGCAATAGTCTGGGTGTGCTGCCGAAAGCCGCAGTTGCCCGTAGCGC ACAGGTTATTCAGCAGGAATGGGGTCAGGGCCTGATTCGCAGCTGGAATGATGCCAGTTGGTTTGAACTGCCG AGTCGTCTGGGTGATAAACTGGGCCGTCTGATTGGTGCAGGTACCGGTCAGGTTGTTGTTACCGATACCACCA GCCTGAATCTGTTTAAAAGTCTGGCCGCAGCCATTCGCATTCAGCAGCAGGCCGCCCCGCAGCGTAAAATTAT TGTTAGTGAACGTGATAACTTCCCGACCGATCTGTATATGATTCAGGGTATGATTGATCTGCTGCAGCAGGGT TATGAAATGCGCCTGGTGGATGAAGATCTGAGCCTGGAACAGGCCCTGGATGATAGTGTGGCAGTTCTGCTGC TGAGCCATGTGAATTATCGCACCGGCCACATGTATGATATGGCAGATGTGACCGCCCAGGCACATGCACGTGG TGCACTGACCATTTGGGATCTGGCACATGCCGCAGGTGCCGTTCCGGTTGATCTGACCGGCGCCAATGCCGAT TTTGCAGTGGGTTGTACCTATAAATATCTGAATGGCGGTCCGGGCGCCCCGGCATTTATTTGGGTGGCACCGC GCCATACCGATCATTTTTGGCAGCCGCTGAGCGGTTGGTGGGGCCATCAGCGCCCGTTTGATATGGCCGTGAA TTATGAACCGGCAGGCGGTATTCGCCGCTATCTGTGCGGCACCCAGCCGATTGTTAGTCTGAGTCTGGTGGAA TGCGGCCTGGATATTAGTCTGCAGGCCGACATGAATGAAGTTCGTCGCAAAAGTCTGGCACTGACCGATCTGT TTATTGCACTGGTGGAAAGCCGTTGTGCCCGCCATCCGCTGACCCTGGTGACCCCTCGCGAACATGCCCATCG CGGCAGTCATGTGAGTCTGCGTCATCCGCATGGCTATGCCGTGATGCAGGCACTGATTGCACGTGGTGTGATT GGTGATTATCGTGAACCGGAAGTTCTGCGTTTTGGCTTTACCCCGCTGTATTTTGGTTATACCGATGTTTGGG ATGCAGTGGAAATTCTGACCGATGTTCTGGATAGTGAAATTTGGAAACAGCCGGAATTTAGTCGCCGTGGTGC CGTGACC9 K5 from Rheinheimera sp.ATGACCTGCGCAGCCCTGCAGCAGCGTGATATTGATGATCCGCTGAGCGGCAAACGCGCAGCATTTTATCTGC CGGATAATACCCTGTATCTGGATGGCAATAGTCTGGGCGCAATGCCGAAAATTGCCGCCGAACGTGCAGCCGA AGTTGTGAGCCAGCAGTGGGGTGAAGGCCTGATTACCAGTTGGAATCGTCATCATTGGATTGATCTGCCGTTT AGCGTGGGCGATAAAATTGGCCATCTGATTGGCGCAGCACCGGGCCAGGTGATTTGCTGCGATAGTACCAGCG TTAATCTGTTTAAAGTGCTGTGTGCAGCCCTGAGCCTGCAGCCGGCACGTAGCAAAGTTCTGAGCGTTAGCGG TAATTTTCCGACCGATCTGTATATGGTGGAAGGCCTGAGCGCACTGACCGGCAATAATCATTATCAGCTGCAG CTGGTTGATGAAAGCGAACTGGAACAGGCCATTACCGGCCAGGTTGCAGTTCTGCTGCTGACCCATGTGGATT TTCGTAGTGGCCGCCTGTTTGATATGGCAAAACTGACCCGCCTGGCCCAGGATAAAGGCGCCCTGGTTATTTG GGATCTGGCCCATAGTGCCGGCGCACTGCCGCTGGCACTGGATCAGTGCCATGTTGATTTTGCAGTTGGCTGT GGTTATAAATATCTGAATGGTGGCCCGGGCGCACCGGCCTTTCTGTATGCCGCCAAACGTCATCATGCAATGC TGCAGCAGCCGCTGACCGGTTGGATGGGTCATAAAACCCCGTTTAGTTTTAGTACCCAGTATGAAAAAGCAAG TGGTATTGCCCAGTTTCTGACCGGCACCCCGCCGGTTATTAGCATGAGCGTTCTGGATGCCGCACTGGATGTG TTTGCAGATGTGGATATTGCACAGCTGCGTCAGAAAAGCCTGGCACTGAGCGATTGTTTTCATCAGCTGGTTA GTCAGAATGATTGCCTGAATGAACTGGAACGTATTACCCCGTATGCAGCAGCAGAACGTGGCAGCCAGCTGGC CTATCGTCATCCGCAGGCCTATGCACTGTGTCAGGCACTGATTAAACAGGGTGTTATTGCCGATTTTCGTGCC CCGGATATTCTGCGCCTGGGTTTTACCCCGCTGTATCTGCGTTATATTGATGTTTGGACCGCCGTTGAAATTC TGGCAGATGTGATGCGCAGCAGTGAATATCTGAAAGCCGAATATCAGATTAAACAGAAAGTTACC10 표 3 유전자 염기서열 서열 번호 K1 from Pseudomonas fluorescenceATGGGCAGCAGCCATCATCATCATCATCACAGCAGCGGCCTGGTGCCGCGCGGCAGCCATATGACCAGCCGTA GCCATTGCCAGACCCTGGATGCACAGGATCCGCTGGCCCCGCTGCGTGATCAGTTTGCCCTGCCGGCCGGTGT TATTTATCTGGATGGTAATAGTCTGGGTGCACGTCCGGTTGCCAGCCTGGCCCGTGCTCAGCAGGTGATTGCA GAAGAATGGGGTAATGGCCTGATTCGTAGTTGGAATAGTGCCGGCTGGGCAGATCTGAGTCTGCGTCTGGGTA ATCGCCTGGCCCCGTTAATTGGTGCCGGCGCCGGCGAAGTGGCCATTACCGATACCACCAGTATTAATCTGTT TAAAGTGCTGAGCGCCGCCCTGACCGTTCAGCGCCAGCGTGAACCGGCCCGTAAAGTTATTGTGAGCGAAGCC AGTAATTTTCCGACCGATCTGTATATTGCCGAAGGCCTGGCAGAACTGCTGCAGCAGGGTTATTGCCTGCGCC TGGTTAATAGTCCGGATGAACTGCCGCAGGCAATTGATGCAGATGTTGCCGTTGTTATGCTGACCCATGTTAA TTATAAAACCGGCTATATGTACGATATGCAGGCCCTGACCGCCCTGAGCCATGAATGTGGCGCACTGAGTATT TGGGATCTGGCCCATAGTGCAGGTGCCGTGCCGATTGATCTGCGCGCAGCCGGTGCCGATTATGCAATTGGCT GCACCTATAAATATCTGAATGGCGGTCCGGGCAGTCAGGCCTTTGTTTGGGTTAATCCGGCCCTGGTGGATCA GGTGCGTCAGCCGCTGAGTGGTTGGTTTGGCCATACCCGCCAGTTTGCAATGGAAAGTAATTATGCACCGAGC GCAGGCATTGCCCGTTATCTGTGCGGCACCCAGCCGATTACCAGTCTGGCAATGGTTGAATGTGGCCTGCAGA TTTTTGAACAGACCGATATGGCCTGCCTGCGTCGCAAAAGTCTGGCACTGACCGATCTGTTTATTGCACTGGT GGAAGCACGTTGTGCAGCACATGGTCTGGTTCTGATTACCCCGCGTGAACATGCACGTCGTGGCAGTCATGTT AGTTTTGAACATCCGGAAGGCTATGCAGTGATTCAGGCACTGATTGCCCGCGGCGTGATTGGCGATTATCGCG AACCGCGCATTATGCGTTTTGGCTTTACCCCGCTGTATACCCGTTTTAGTGAAGTTTGGGATGCCGTGGAAAT TCTGGGTGAAATTCTGGATGAAAGCACCTGGGATCAGCCGCAGTTTAAAGTGCGCCATAGTGTTACC11K2 from Pseudomonas sp.ATGGGCAGCAGCCATCATCATCATCATCACAGCAGCGGCCTGGTGCCGCGCGGCAGCCATATGGCAACCCAGC AGCATCTGCGTGAACTGGATCTGGCAGATCCGCTGGCCGCACTGCGTGATGAATTTGCCCTGCCGGAAGGCGT TATTTATCTGGATGGTAATAGTCTGGGTGCACGCCCGAAAGCCGCCCTGGCTCGTGCTACCCAGATGATTGAA CAGGAATGGGGCGAAGGTCTGATTCGCAGTTGGAATACCGCACAGTGGAGTACCCTGAGCGCCCGTCTGGGTG ATAAACTGGCACCGCTGATTGGTGCCGATAGTGGTGAAGTTGTGATTACCGATACCACCACCGTTAATCTGTT TAAAATTCTGGCCGCAGGTCTGCGTATTCAGGCCGAACGCGCACCGCAGCGCAAAATTATTCTGAGCGAACTG CATAATTTCCCGGCCGATCTGTATGTTATTGAAGGTCTGGCAGATCTGCTGCAGCAGGGTTATGAACTGCGTC TGATTGAACGCCCGCAGGATCTGCCGGGCCTGCTGGATGATCAGGTTGCACTGGTTCTGCTGACCCATGTGAA TTATAAAAGCGGTCACATGTATGATATGACCGCCACCACCGGTCTGATTCATCAGCATGGCGCACTGGCCCTG TGGGATCTGGCCCATAGCGCAGGTGCAGTGCCGGTGCAGCTGAAAGCCGCAAATGCCGATTATGCCATTGGTT GCACCTATAAATATCTGAATGGCGGCCCGGGCAGTCCGGCATTTGTGTGGGTTAGCCCGCAGCTGTGTGATCA GGTGTGGCAGCCGCTGAGCGGTTGGTGGGGTCATGCACGTCAGTTTGCCATGGAACCGCATTATGCCCCGGCA AGTGGTATTACCCGTTATCTGTGCGGCACCCAGCCGCTGGTGAGTCTGGGTATGGTGGAAAGTGGCCTGGATA TTTTTGCAAAAACCAGCATGCAGGCACTGCGCAATAAAAGTCTGGCCCTGACCGATCTGTTTATTGAACTGGT GGAAGCACGCTGTAAAGATCATCCGCTGACCCTGATTACCCCGCGTGATCATGCACAGCGTGGCAGCCATGTG AGTTTTGAACATCCGGAAGGCTATGCCGTGGTGCAGGCCCTGATTGCCCGTGGTGTGATTGGCGATTATCGCG AACCGCGCATTATGCGCTTTGGTTTTACCCCGCTGTATACCAGCTTTCAGGATGTGGGCGCCGCAGTTCAGGC ACTGGTTGAAGTTCTGGATAGTCAGCAGTGGCGTGAACCGCAGTTTCAGACCCGTCATAGTGTTACC12 K3 from Pseudomonas sp.ATGGGCAGCAGCCATCATCATCATCATCACAGCAGCGGCCTGGTGCCGCGCGGCAGCCATATGATCACCCGTA ATGATTGTCTGGCACTGGATGCACAGGATCCGCTGGCACATCTGCGTCATCAGTTTGCACTGCCGGAAGGCGT TATTTATCTGGATGGCAATAGTCTGGGTGCCCGCCCGATTGCAGCACTGGAACGCGCACAGGCAGTGATTGCC GAAGAATGGGGTAATGGTCTGATTCGCAGCTGGAATAGCGCCGGTTGGCTGGATCTGCCGGAACGTCTGGGCA ATCGTCTGGCCGGCCTGATTGGTGCAGGTGAAGGCGAAGTTGTGGTTACCGATACCACCAGTATTAATCTGTT TAAAGTTCTGGGCGCCGCCCTGCGCGTTCAGGCAATGCGTGCCCCGACCCGTCGTGTGATTGTTAGTGAAAGT AGCAATTTTCCGACCGATCTGTATATTGCAGAAGGTCTGATGGATCTGCTGCAGCAGGGCTATAGCCTGCGCC TGGTGGATAGCCCGGAAGAACTGGCCCAGGCCATTGATCAGGATACCGCAGTGGTGATGCTGACCCATGTTAA TTATAAAACCGGTTATATGCACGATATGCAGGCCGTGACCGTGCTGATTCATGAATGTGGTGCACTGGCAATT TGGGATCTGGCACATAGTGCAGGTGCCGTGCCGGTGGATCTGCGTCAGGCAGGCGCCGATTATGCAATTGGTT GCACCTATAAATATCTGAATGGCGGTCCGGGTAGCCAGGCATTTGTGTGGGTTGCACCGCAGCTGTGCGATCT GGTTACCCAGCCGCTGAGTGGCTGGTTTGGCCATAGCCGTCAGTTTGATATGGCCAGTGGCTATGAACCGAGT AGTGGTATTGCCCGCTATCTGTGTGGCACCCAGCCGATTACCAGTCTGGCCATGGTTGAATGTGGCCTGGAAA TTTTTGCACAGACCGATATGCCGAGCCTGCGCCGCAAAAGTCTGGCACTGACCGATCTGTTTATTCAGATGGT GGAACAGCGTTGTGCAGCCCATGATCTGAAACTGATTACCCCGCGCGAACATGCACGTCGCGGCAGTCATGTG AGTTTTGAACATCCGCAGGGTTATGCCGTTATTCAGGCACTGATTGCCCGTGGCGTTATTGGTGATTATCGTG AACCGCGCATTATGCGCTTTGGTTTTACCCCGCTGTATACCAGTTTTACCGAAGTTTTTGATGCAGTTCAGAT TCTGGGCGAAATTCTGGATCAGCAGACCTGGAGCCAGGCACAGTTTCAGGTGCGCCATAGCGTTACC13 K4 from Bordetella sp.ATGGGCAGCAGCCATCATCATCATCATCACAGCAGCGGCCTGGTGCCGCGCGGCAGCCATATGCATACCCGTG AAGCCTGCCTGCAGGCCGATCAGCAGGATCCGCTGGCACCGCTGAAAGCACAGTTTGATATTCCGGCCGGCGT GCTGTATATGGATGGCAATAGTCTGGGTGTGCTGCCGAAAGCCGCAGTTGCCCGTAGCGCACAGGTTATTCAG CAGGAATGGGGTCAGGGCCTGATTCGCAGCTGGAATGATGCCAGTTGGTTTGAACTGCCGAGTCGTCTGGGTG ATAAACTGGGCCGTCTGATTGGTGCAGGTACCGGTCAGGTTGTTGTTACCGATACCACCAGCCTGAATCTGTT TAAAAGTCTGGCCGCAGCCATTCGCATTCAGCAGCAGGCCGCCCCGCAGCGTAAAATTATTGTTAGTGAACGT GATAACTTCCCGACCGATCTGTATATGATTCAGGGTATGATTGATCTGCTGCAGCAGGGTTATGAAATGCGCC TGGTGGATGAAGATCTGAGCCTGGAACAGGCCCTGGATGATAGTGTGGCAGTTCTGCTGCTGAGCCATGTGAA TTATCGCACCGGCCACATGTATGATATGGCAGATGTGACCGCCCAGGCACATGCACGTGGTGCACTGACCATT TGGGATCTGGCACATGCCGCAGGTGCCGTTCCGGTTGATCTGACCGGCGCCAATGCCGATTTTGCAGTGGGTT GTACCTATAAATATCTGAATGGCGGTCCGGGCGCCCCGGCATTTATTTGGGTGGCACCGCGCCATACCGATCA TTTTTGGCAGCCGCTGAGCGGTTGGTGGGGCCATCAGCGCCCGTTTGATATGGCCGTGAATTATGAACCGGCA GGCGGTATTCGCCGCTATCTGTGCGGCACCCAGCCGATTGTTAGTCTGAGTCTGGTGGAATGCGGCCTGGATA TTAGTCTGCAGGCCGACATGAATGAAGTTCGTCGCAAAAGTCTGGCACTGACCGATCTGTTTATTGCACTGGT GGAAAGCCGTTGTGCCCGCCATCCGCTGACCCTGGTGACCCCTCGCGAACATGCCCATCGCGGCAGTCATGTG AGTCTGCGTCATCCGCATGGCTATGCCGTGATGCAGGCACTGATTGCACGTGGTGTGATTGGTGATTATCGTG AACCGGAAGTTCTGCGTTTTGGCTTTACCCCGCTGTATTTTGGTTATACCGATGTTTGGGATGCAGTGGAAAT TCTGACCGATGTTCTGGATAGTGAAATTTGGAAACAGCCGGAATTTAGTCGCCGTGGTGCCGTGACC14K5 from Rheinheimera sp.ATGGGCAGCAGCCATCATCATCATCATCACAGCAGCGGCCTGGTGCCGCGCGGCAGCCATATGACCTGCGCAG CCCTGCAGCAGCGTGATATTGATGATCCGCTGAGCGGCAAACGCGCAGCATTTTATCTGCCGGATAATACCCT GTATCTGGATGGCAATAGTCTGGGCGCAATGCCGAAAATTGCCGCCGAACGTGCAGCCGAAGTTGTGAGCCAG CAGTGGGGTGAAGGCCTGATTACCAGTTGGAATCGTCATCATTGGATTGATCTGCCGTTTAGCGTGGGCGATA AAATTGGCCATCTGATTGGCGCAGCACCGGGCCAGGTGATTTGCTGCGATAGTACCAGCGTTAATCTGTTTAA AGTGCTGTGTGCAGCCCTGAGCCTGCAGCCGGCACGTAGCAAAGTTCTGAGCGTTAGCGGTAATTTTCCGACC GATCTGTATATGGTGGAAGGCCTGAGCGCACTGACCGGCAATAATCATTATCAGCTGCAGCTGGTTGATGAAA GCGAACTGGAACAGGCCATTACCGGCCAGGTTGCAGTTCTGCTGCTGACCCATGTGGATTTTCGTAGTGGCCG CCTGTTTGATATGGCAAAACTGACCCGCCTGGCCCAGGATAAAGGCGCCCTGGTTATTTGGGATCTGGCCCAT AGTGCCGGCGCACTGCCGCTGGCACTGGATCAGTGCCATGTTGATTTTGCAGTTGGCTGTGGTTATAAATATC TGAATGGTGGCCCGGGCGCACCGGCCTTTCTGTATGCCGCCAAACGTCATCATGCAATGCTGCAGCAGCCGCT GACCGGTTGGATGGGTCATAAAACCCCGTTTAGTTTTAGTACCCAGTATGAAAAAGCAAGTGGTATTGCCCAG TTTCTGACCGGCACCCCGCCGGTTATTAGCATGAGCGTTCTGGATGCCGCACTGGATGTGTTTGCAGATGTGG ATATTGCACAGCTGCGTCAGAAAAGCCTGGCACTGAGCGATTGTTTTCATCAGCTGGTTAGTCAGAATGATTG CCTGAATGAACTGGAACGTATTACCCCGTATGCAGCAGCAGAACGTGGCAGCCAGCTGGCCTATCGTCATCCG CAGGCCTATGCACTGTGTCAGGCACTGATTAAACAGGGTGTTATTGCCGATTTTCGTGCCCCGGATATTCTGC GCCTGGGTTTTACCCCGCTGTATCTGCGTTATATTGATGTTTGGACCGCCGTTGAAATTCTGGCAGATGTGAT GCGCAGCAGTGAATATCTGAAAGCCGAATATCAGATTAAACAGAAAGTTACC15 실시예 1.3. 선별된 키뉴레니나제의 준비 실시예 1.2에서 준비한 플라스미드는 대장균 BL21(DE3) 세포(New England Biolabs)로 형질전환 (transformation) 하였다. LB 배지에서 형질전환된 세포를 밤새도록 배양한 후, 배양액(10 mL)을 4L baffled flask에 100 μg/ml의 카나마이신(kanamycin)를 포함하는 TB 배지(1 L)에 첨가하였다. OD600이 1.0에 도달할 때 까지 37℃에서 회전 진탕기(170 rpm)로 배양하였다. 200 μM의 Isopropyl β-D-1-thiogalactopyranoside(IPTG)를 첨가하기 전에, 배양액을 ice bath에서 10분 동안 냉각하였다. 이후, 15℃에서 16시간 동안 170 rpm의 속도로 배양물을 흔들고, 세포는 원심분리기를 통해 수득하 고(5,000 rpm, 10분, 4℃), 수득한 세포는 -80℃에서 저장하였다. 이후, 저장된 박테리아 세포는 4℃에서 1 mM pyridoxal phosphate(PLP; Tokyo Chemical Industry, cofactor)가 함유된 인산염 완충 식염수(DPBS; Alfa Aesar)로 해동하고, 고압분산장비(microfluidizer)(20,000 psi, 2 cycle; LM20 Microfluidics Inc.)를 사용하 여 용해시켰다. 세포 잔해 이물질을 제거하기 위하여 원심분리(13,000 rpm, 45분, 4℃)를 수행한 후, 상등액을 0.45 μm 주사기 필터를 통해 여과하고, 4℃에서 KTA Pure FPLC(Cytiva)를 사용하여 HisTrap HP column(Cytiva)에 로딩하였다. 용해물을 로딩한 후, 컬럼을 DPBS 8 column volume(CV)로 세척하고, 300 mM의 imidazole이 포함된 DPBS로 단백 질을 추출하였다. 노란색으로 변한 부분을 수집하였고, 4℃에서 Amicon 원심 필터(30 kDa cutoff)를 사용하여 농축하였다. 이러한 과정을 통하여 수득한 기존에 알려진 N-His6-태그된 키뉴레니나제(K1) 및 선별된 N-His6-태 그된 키뉴레니나제(K2-K5)의 아미노산 서열은 하기 표 4에 기재된 바와 같다. 표 4 단백질 아미노산 서열 서열 번호 K1 from Pseudomonas fluorescenceMGSSHHHHHHSSGLVPRGSHMTSRSHCQTLDAQDPLAPLRDQFALPAGVIYLDGNSLGARPVASLARAQQVIA EEWGNGLIRSWNSAGWADLSLRLGNRLAPLIGAGAGEVAITDTTSINLFKVLSAALTVQRQREPARKVIVSEA SNFPTDLYIAEGLAELLQQGYCLRLVNSPDELPQAIDADVAVVMLTHVNYKTGYMYDMQALTALSHECGALSI WDLAHSAGAVPIDLRAAGADYAIGCTYKYLNGGPGSQAFVWVNPALVDQVRQPLSGWFGHTRQFAMESNYAPS AGIARYLCGTQPITSLAMVECGLQIFEQTDMACLRRKSLALTDLFIALVEARCAAHGLVLITPREHARRGSHV SFEHPEGYAVIQALIARGVIGDYREPRIMRFGFTPLYTRFSEVWDAVEILGEILDESTWDQPQFKVRHSVT16 K2 from Pseudomonas sp.MGSSHHHHHHSSGLVPRGSHMATQQHLRELDLADPLAALRDEFALPEGVIYLDGNSLGARPKAALARATQMIE QEWGEGLIRSWNTAQWSTLSARLGDKLAPLIGADSGEVVITDTTTVNLFKILAAGLRIQAERAPQRKIILSEL HNFPADLYVIEGLADLLQQGYELRLIERPQDLPGLLDDQVALVLLTHVNYKSGHMYDMTATTGLIHQHGALAL WDLAHSAGAVPVQLKAANADYAIGCTYKYLNGGPGSPAFVWVSPQLCDQVWQPLSGWWGHARQFAMEPHYAPA SGITRYLCGTQPLVSLGMVESGLDIFAKTSMQALRNKSLALTDLFIELVEARCKDHPLTLITPRDHAQRGSHV SFEHPEGYAVVQALIARGVIGDYREPRIMRFGFTPLYTSFQDVGAAVQALVEVLDSQQWREPQFQTRHSVT17K3 from Pseudomonas sp.MGSSHHHHHHSSGLVPRGSHMITRNDCLALDAQDPLAHLRHQFALPEGVIYLDGNSLGARPIAALERAQAVIA EEWGNGLIRSWNSAGWLDLPERLGNRLAGLIGAGEGEVVVTDTTSINLFKVLGAALRVQAMRAPTRRVIVSES SNFPTDLYIAEGLMDLLQQGYSLRLVDSPEELAQAIDQDTAVVMLTHVNYKTGYMHDMQAVTVLIHECGALAI WDLAHSAGAVPVDLRQAGADYAIGCTYKYLNGGPGSQAFVWVAPQLCDLVTQPLSGWFGHSRQFDMASGYEPS SGIARYLCGTQPITSLAMVECGLEIFAQTDMPSLRRKSLALTDLFIQMVEQRCAAHDLKLITPREHARRGSHV SFEHPQGYAVIQALIARGVIGDYREPRIMRFGFTPLYTSFTEVFDAVQILGEILDQQTWSQAQFQVRHSVT18 K4 from Bordetella sp.MGSSHHHHHHSSGLVPRGSHMHTREACLQADQQDPLAPLKAQFDIPAGVLYMDGNSLGVLPKAAVARSAQVIQ QEWGQGLIRSWNDASWFELPSRLGDKLGRLIGAGTGQVVVTDTTSLNLFKSLAAAIRIQQQAAPQRKIIVSER DNFPTDLYMIQGMIDLLQQGYEMRLVDEDLSLEQALDDSVAVLLLSHVNYRTGHMYDMADVTAQAHARGALTI WDLAHAAGAVPVDLTGANADFAVGCTYKYLNGGPGAPAFIWVAPRHTDHFWQPLSGWWGHQRPFDMAVNYEPA GGIRRYLCGTQPIVSLSLVECGLDISLQADMNEVRRKSLALTDLFIALVESRCARHPLTLVTPREHAHRGSHV SLRHPHGYAVMQALIARGVIGDYREPEVLRFGFTPLYFGYTDVWDAVEILTDVLDSEIWKQPEFSRRGAVT19 K5 from Rheinheimera sp.MGSSHHHHHHSSGLVPRGSHMTCAALQQRDIDDPLSGKRAAFYLPDNTLYLDGNSLGAMPKIAAERAAEVVSQ QWGEGLITSWNRHHWIDLPFSVGDKIGHLIGAAPGQVICCDSTSVNLFKVLCAALSLQPARSKVLSVSGNFPT DLYMVEGLSALTGNNHYQLQLVDESELEQAITGQVAVLLLTHVDFRSGRLFDMAKLTRLAQDKGALVIWDLAH SAGALPLALDQCHVDFAVGCGYKYLNGGPGAPAFLYAAKRHHAMLQQPLTGWMGHKTPFSFSTQYEKASGIAQ FLTGTPPVISMSVLDAALDVFADVDIAQLRQKSLALSDCFHQLVSQNDCLNELERITPYAAAERGSQLAYRHP QAYALCQALIKQGVIADFRAPDILRLGFTPLYLRYIDVWTAVEILADVMRSSEYLKAEYQIKQKVT20 25℃에서 1시간 동안 PLP(최종 농도 1 mM)와 배양한 후, 단백질을 4℃에서 DPBS를 이용하여 size exclusion chromatography(HiLoad Superdex 200 pg column; cytiva)에 적용하였다. 각 분획에서의 단백질의 순도는 SDS- PAGE를 이용하여 측정하였다(도 2). 장기 보관을 위해 글리세롤 함유 완충제(20% v/v)를 사용하였으며, 추후 사 용할 때까지 -80℃에서 보관하였다. 실험예 1. 선별된 키뉴레니나제의 활성 분석 선별된 키뉴레니나제(K2-K5)의 활성을 분석하기 위하여, 평형 상태 특이 활성도(The steady-state specific activity)를 측정하였다. 구체적으로, 평형 상태 특이 활성도 측정은 37℃에서 DPBS 완충액에 20 μL의 효소와 80 μL의 L-키뉴레닌(sigma Aldrich)을 혼합하여 수행하였다. 기질의 소비량은 Microplate reader(Synergy H1, Biotek)를 사용하여 37℃에서 365 nm 신호를 1분 동안 모니터링하여 측정하였다. 다양한 농도의 기질(0~700 μM)을 적용하여 초기 반응 속도(initial rates)를 측정하였다. 효소의 반응 속도 파 라미터인 전환 속도(turnover rates; kcat)과 촉매 효율(Catalytic efficiencies; kcat/KM)은 Origin software를 사용하고 미카엘리스-멘텐 방정식(Michaelis-Menten equation)에 적용하여 계산하였다. 또한, 대조군으로 체외 및 체내 생물학적 활성이 현재까지 가장 높은 것으로 알려진 슈도모나스 플루오레센스 유래 키뉴레니나제(K1)를 준비하였다. 그 결과, K1의 미카엘리스 멘텐 반응 속도 매개변수(Michaelis-Menten kinetic parameters), 전환 속도 (turnover rates, kcat) 및 촉매 효율(Catalytic efficiencies; kcat/KM) 값은 하기 표 5에 기재된 바와 같이, 실 험 오차 범위 내에서 K1의 값과 유사한 것을 확인하였다(도 3a 내지 3c). 표 5 kcat (s-1)KM (μM)kcat/KM (M-1 s-1) K1 8.1 819.9 X 104 K2 8.3 1854.5 X 104 K3 7.3 838.8 X 104 K4 17 1611.0 X 105 K5 6.2 916.8 X 104 구체적으로, 실시예 1에서 선별된 키뉴레니나제(K2-K5)는 K1과 비슷하거나 훨씬 더 높은 반응 속도 매개변수를 나타냈다. 특히, K4는 K1보다 2.0배만큼 높은 kcat를 나타냈고, K4의 kcat/KM 값은 K1과 비슷하였다. 예측된 kcat/KM 순서는 실험 결과와 일치하진 않지만, 이러한 데이터는 높은 효소 촉매 활성을 가진 잠재적이고 효과적인 치료 효소를 발견하기 위해 현재 적용한 알고리즘이 상당히 유용함을 시사한다. 또한, K4가 K1보다 암 치료제개발을 위한 더 나은 후보가 될 수 있는 가능성을 보여준다. 실험예 2. 선별된 키뉴레니나제 활성의 pH 의존성 분석 고형암에서 세포외 공간은 pH 6.0 내지 pH 6.5로 정상 조직(pH 7.0 내지 pH 7.5) 보다 유의하게 더 산성이기 때 문에, pH 의존적 촉매 활성은 암 치료에서 치료 효소의 효과를 결정하는 중요한 요인이 될 수 있다. 따라서, 선 별된 키뉴레니나제(K4) 활성의 pH 의존성을 분석하기 위하여, 다음과 같은 실험을 수행하였다. 대조군으로 슈도 모나스 플루오레센스 유래 키뉴레니나제 (K1)를 준비하였다. K1 및 K4의 특이 활성도는 L-키뉴레닌(700 μM)의 소모율을 25℃에서 pH 5.0 내지 pH 8.0 완충액(pH 5.0 내지 pH 6.0의 구연산 50 mM, pH 6.5 내지 pH 8.0의 인산칼륨)에서 측정하였다. 효소의 특이 활성도를 측정하기 전에, 효소는 25℃에서 10분 동안 각 완충액으로 사전 배양하였다. 그 결과, K1 및 K4 모두 pH 7.0에서 최적의 활성을 보이고 산성 pH 조건에서 촉매 활성이 떨어지는 것을 확인하 였다. 그러나 K4는 훨씬 더 낮은 pH 범위에서도 여전히 K1보다 높은 촉매 활성을 나타냈다(도 4). 이는, K4가 암 치료에 유망한 치료 효소가 될 수 있는 가능성을 보여준다. 실험예 3. 선별된 키뉴레니나제 활성의 열적 안정성 분석 열적 안정성은 치료 효소의 생체 내 적용에도 중요하기 때문에, 선별된 키뉴레니나제(K4) 활성의 열적 안정성을 분석하기 위하여, 다음과 같은 실험을 수행하였다. 대조군으로 슈도모나스 플루오레센스 유래 키뉴레니나제(K 1)를 준비하였다. 실험예 3.1. PEG-키뉴레니나제의 제조 생체 내 적용을 위한 안정성 및 생체 적합성을 높이기 위해, 세균 유래 내독소(endotoxin)를 제거한 후 K1과 K4 에 PEG를 결합하였다. 엔도톡신을 제거하기 위해 상분리법(Phase separation method)을 적용하였다. 구체적으로, 단백질 용액에 TritonTMX-114(Sigma-Aldrich, 1% v/v)를 직접 첨가하고 4℃에서 피펫팅하여 혼합하 였다. 10분 동안 배양한 후, 시료를 37℃에서 5분 동안 유지하여 상분리가 가능하도록 하였다. 이후, 시료를 원심분리(13,000 rpm, 1분, 37℃)하고, 마이크로 피펫을 이용하여 상부의 황색 수층을 채취하였다. 이 과정은 낮은 엔도톡신 수준을 보장하기 위해 두 번 반복하였다. PEGylation 전에, 생성된 샘플 은 25℃에서 1시간 동안 1 mM의 PLP로 배양하였다. 이어서, 단백질에 100배 몰 이상 되는 methoxy-PEG- CO(CH2)2COO-NHS(5 kDa; NOF America Corporation)를 직접 분말 형태로 첨가하여 25℃에서 1시간 동안 배양하 였다. 반응하지 않은 PEGylation 시약은 4℃에서 원심 필터를 사용하여 제거하였다. 엔도톡신 수치는 크로모제 닉 엔도톡신 정량 키트(chromogenic endotoxin quantification kit)(Thermo Fisher Scientific사의 Limulus amebocyte lysate)를 사용하여 측정하였으며, PEGylation의 순도 및 정도는 SDS-PAGE를 사용하여 확인하였다. 실험예 3.2. 선별된 키뉴레니나제 활성의 열적 안정성 확인 CD 분광법을 이용해 K1과 K4의 열 변성을 모니터링하였다. 그 결과, K1과 K4의 용융 온도(Tm)는 각각 60.8℃, 61.1℃로 유사하였다. PEG-K1과 PEG-K4의 용융 온도는 57.4℃, 60.0℃로 비-PEGylation 단백질과 유사하였다 (도 5a). 촉매 활성이 37℃에서 더 긴 배양 시간 후에도 유지되는지 여부를 추가로 모니터링하기 위하여 24시간 동안 특 이 활성도를 측정하였다. 그 결과, K1과 K4의 촉매 활성이 각각 40%, 43% 감소하여 K1과 K4가 적어도 유사한 열 적 안정성을 나타내어 오랜 배양 후에도 K1 보다 높은 촉매활성을 유지하는 것을 확인하였다(도 5b). 한편, 실 험예 3.1에서 제조한 K1-PEG 및 K4-PEG 효소는 비-PEGylated 효소에 비해 86% 및 83%의 특이 활성을 보였으며, 이는 PEGylation 동안 반응성이 유지되는 것을 의미한다. 따라서, PEGylation 과정은 이들 효소의 활성을 크게 줄이지는 않는다는 것을 확인하였다. 실험예 4. 선별된 키뉴레니나제의 KYN-유도 T 세포 증식 억제 회복 효과 실험예 4.1. 세포주와 동물 모델의 준비 B16-F10 흑색종 세포주는 ATCC(American Type Culture Collection, Manassas, Virginia, USA, #CRL-6475)에서 구입하였다. 세포주는 DMEM(Dulbecco's Modified Eagle's Medium, Corning, New-York, USA #10-013-CV)에 10% FBS (Fetal Bovine Serum, Corning, New-York, USA, #35-015-CV)와 1% 페니실린/스트렙토마이신(Thermo, Waltham, MA, USA, #10378016)이 첨가된 배지에서 배양하였다. C57BL/6J 종의 쥐는 Jackson lab(Bar Harbor,Maine, USA)에서 구입하였다. 생체 내(In-vivo) 연구는 서울아산병원 연구소의 IACUC(#2022-12-098)와 헬릭스 미스 동물연구소의 승인(VIC-22-06-004)을 받았고, 승인된 절차에 따라 수행하였다. 실험예 4.2. 생체 외(In vitro) T 세포 활성의 측정 K1-PEG와 K4-PEG가 KYN에 의한 CD8+ T 세포(비장 유래)의 활성화 및 증식 억제를 회복시킬 수 있는지 확인하기 위하여, CD8+ T 세포 활성화 배지에 K1-PEG와 K4-PEG(0.02 μM 또는 0.05 μM)를 L-KYN 존재 하에서 각각 처리 하였다. 구체적으로, C57BL/6J 마우스의 비장으로부터 CD8+ T 세포의 추출은 제공된 프로토콜에 따라 EasySepTM magnet(STEMCELL, Vancouver, Canada, #18000)을 이용한 EasySepTM 마우스 CD8+ T cell isolation kit를 통해 분리하였다. 정제된 CD8+ T 세포는 5 μg/mL의 anti-mCD3 항체(클론: 145-2C11, ebioscienceTM, CA, USA, #16- 0031-96)로 미리 코팅한 원형바닥형의 96 웰-플레이트에서 배양하였다. T 세포 활성을 위한 배지의 조성은 Gibco(Waltham, Massachusetts, USA)로부터 구입한 RPMI1640(#22400-071), 10% FBS(#26140-087), β-mercaptoethanol(55 μM, #21985-023), 1X GlutaMax(#35050-061), 100 mM penicillin/streptomycin(#10378-016) 및 200 mM sodium pyruvate(#11360-070), anti-mCD28(clone:37.51, ebioscienceTM, CA, USA, #16-0281-86, 2μg/mL) 및 rhIL-2(PEPROTECH, NJ, Cranbury, USA, #200-02, 400 U/mL)으로 이루어져 있으며, L-Kyn(Sigma, MA, USA, #K8625-100, 1 mM)의 처리 및 미처리 그룹에 K1-PEG 및 K4-PEG(0.02 uM 또는 0.05 μM)를 처리하였다. 활성화 5일 째에, T 세포의 증식 수준을 나타내는 T 세포군의 크기는 현미경(ZEISS primovert, Oberkochen, Germany, #491206-0001-000)으로 관찰하였다. 추가적으로 세포수는 활성화 7일 째에, hematocytometer(MARIENFELD, Lauda-K nigshofen, Germany, #0640010)를 사용하여 측정하였다. 그 결과, CD8+ T 세포의 세포 사멸로 인한 증식 억제 수준은 고농도의 L-Kyn(1 mM)에서 유의하게 감소된 반면, K1-PEG 또는 K4-PEG로 처리된 그룹(5일째) 에서는 완화되는 것을 확인하였다. 그러나 T 세포 증식 후 형성된 T 세포군의 크기는 K1-PEG보다 K4-PEG로 처리된 배양에서 훨씬 크게 관찰되었다(도 6a). 또한, 세포 수는 T 세포 군의 증식 패턴과 유사하게 나타났다(p-value=0.039, 7일째)(도 6b). 이는, K4-PEG가 생물학적으로 관련된 맥락 에서 K1-PEG보다 기능적으로 더 활성화되었음을 시사한다. 실험예 5. 선별된 키뉴레니나제의 흑색종 성장 억제 효과 실험예 5.1. 동종 이식 종양 동물 모델의 준비 동종 이식 종양 동물 모델을 확립하기 위하여, B16-F10 흑색종 세포주를 C57BL/6J 마우스(6주령, 암컷)의 옆구 리 측면에 피하 이식하였다. 종양 부피가 약 50 mm3(주사 후 7일)에 도달하면 임의로 쥐를 하나의 그룹당 13마 리씩 3개의 그룹으로 분류하였다. K1-PEG(용량: 20 mg/kg) 와 K4-PEG(용량: 20 mg/kg)를 C57BL/6J 마우스에 주 2회, 총 3회 종양 부근에 주사(peritumoral injection) 하였다(도 7a). 종양의 크기는 주 2회 측정하였으며, 하기와 같은 수학식 1에 따라 계산하였다: [수학식 1] [종양의 부피(V) = 길이(L) x 너비2(W2) x 1/2] 또한, T/C 비율(%)은 종양 추출시 대조군의 종양 부피(Vc) 대 종양 추출시 실험군의 종양 부피(Vt)로 측정하였 으며, 종양 성장 억제율(Tumor growth inhibition rate, TGI %)은 하기와 같은 수학식 2에 따라 계산하였다: [수학식 2] [TGI(%) = (Vc-Vt)/Vc x 100] 실험예 5.2. 키뉴레니나제의 종양 성장 억제 효과 확인 K1-PEG와 K4-PEG의 항 종양 효과를 평가하기 위하여, 쥐에서 흑색종 동종 이식 모델을 확립하고, K1-PEG 또는 K4-PEG(20 mg/kg)를 암 조직에 투여하였다. 그 결과, K1-PEG 처리 그룹은 3차 처리 후 대조군에 비해 종양 성장 억제 효과가 나타났는데, K4-PEG 처리 그룹은 이 보다 훨씬 강한 종양 성장 억제율을 보였다(도 7b). 구체적으로, K4-PEG 그룹은 TGI(%)가 63.9%(p-value는 0.00008), K1-PEG 그룹은 TGI(%)가 37.8%(p-value는 0.0067)으로 나타났다(도 7c). 또한, K4-PEG 처리 그룹은 K1-PEG 처리 그룹과 비교하여, 종양 무게가 유의하게 감소한 것을 확인하였다(도 7d 및 도 7e). 실험예 5.3. 키뉴레니나제의 혈장 내 Kyn 분해 효과 확인 쥐의 종양 성장 관찰이 종료되는 시점에, 안와 채혈을 통해서 혈액을 채취하고, KYN ELISA KIT(ImmuSmol, #BA- E-2200)를 사용하여 제공된 프로토콜에 따라서 마우스 혈장 내 Kyn 수치를 측정하였다. 그 결과, K1-PEG 및 K4-PEG 처리된 그룹의 혈장 내 Kyn 농도는 대조군에 비해 유의한 차이를 보였다(도 7g). 하 지만 부작용의 척도인 체중은 유의미한 변화를 나타내지 않았다(도 7f). 이는, K4-PEG가 K1-PEG보다 더 나은 항 암 치료 효소가 될 수 있음을 시사한다. 실험예 6. 선별된 키뉴레니나제의 대장암종 성장 억제 효과 실험예 6.1. 세포주와 동물 모델의 준비 CT-26 마우스 대장암 세포주는 KCLB(Korean Cell Line Bank, 국내, #80009)에서 구입하였다. 세포주는 실험예 4.1과 동일하게 DMEM(Dulbecco's Modified Eagle's Medium, Corning, New-York, USA #10-013-CV)에 10% FBS (Fetal Bovine Serum, Corning, New-York, USA, #35-015-CV)와 1% 페니실린/스트렙토마이신(Thermo, Waltham, MA, USA, #10378016)이 첨가된 배지에서 배양하였다. BALB/c 종의 쥐는 라온바이오㈜에서 구입하였다. 해당 생 체 내(in-vivo) 연구는 헬릭스미스 동물연구소의 승인(VIC-22-06-003)을 받았고, 승인된 절차에 따라 수행하였 다. 실험예 6.2. 동종 이식 종양 동물 모델의 준비 동종 이식 종양 동물 모델을 확립하기 위하여, CT-26 대장암 세포주 (1x106 cells/마우스)를 BALB/c 마우스 (6 주령, 암컷)의 옆구리 측면에 피하 이식하였다. 종양 부피가 약 50 내지 100 mm3 (주사 후 8일)에 도달하면 임 의로 쥐를 하나의 그룹당 6마리씩 3개의 그룹으로 분류하였다. 대조군에는 PBS를 처리하였으며, K1-PEG(용량: 20 mg/kg)와 K4-PEG(용량: 20 mg/kg)를 BALB/c 마우스에 주 2회, 총 3회 종양 부근에 주사(peritumoral injection) 하였다 (도 8a). 종양의 크기는 주 2회 측정하였으며, 종양의 부피와 T/C 비율(%)은 실험예 5.1에서 설명한 것과 동일한 방법으로 계산하였다. 실험예 6.3. 키뉴레니나제의 종양 성장 억제 효과 확인 K1-PEG와 K4-PEG의 항 종양 효과를 평가하기 위하여, 쥐에서 대장암 동종 이식 모델을 확립하고, K1-PEG 또는 K4-PEG (20mg/kg)을 암 조직에 투여하였다. 그 결과, K1-PEG 처리 그룹은 3차 처리 후 대조군에 비해 종양 성장 억제 효과가 나타났으며, K4-PEG 처리 그룹은 이보다 훨씬 강한 종양 성장 억제율을 보였다 (도 8b). 구체적으 로, K4-PEG 그룹은 TGI(%)가 56.8% (p-value는 0.0045)의 종양 성장 억제율을 보였지만, K1-PEG 그룹은 TGI (%)가 36.29% (p-value는 0.098)으로 나타났다. 또한 K1-PEG 그룹과 K4-PEG 그룹을 비교했을 경우, TGI(%)는 28.854% (p-value=0.021)로 유의한 차이를 보였다 (도 8c). 또한, 종양 적출 후 대조군 그룹과 K4-PEG 그룹의 p-value는 0.061으로, K1-PEG 그룹의 p-value는 0.233으로 차이를 보였다 (도 8d 및 도 8e). 부작용의 척도인 각 그룹 간의 체중의 변화에는 큰 차이를 나타내지 않았다 (도 8f). 이는, K4-PEG가 K1-PEG보 다 더 나은 항암 치료 효소가 될 수 있음을 시사한다.도면 도면1 도면2 도면3a 도면3b 도면3c 도면4 도면5a 도면5b 도면6a 도면6b 도면7a 도면7b 도면7c 도면7d 도면7e 도면7f 도면7g 도면8a 도면8b 도면8c 도면8d 도면8e 도면8f"}
{"patent_id": "10-2023-0085093", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "공개특허 10-2024-0056397"}
{"patent_id": "10-2023-0085093", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "서열목록(첨부)"}
{"patent_id": "10-2023-0085093", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 UniProtKB 및 메타게놈 데이터베이스를 통한 검색으로 발굴된 단백질 서열을 MMseq2의 분류학적 방법을 통해 분석한 분류학적 분포도이다. 도 2는 선별 및 제조한 키뉴레니나제의 순도를 SDS-PAGE를 이용하여 확인한 결과이다. 도 3a는 선별된 키뉴레니나제의 활성을 분석하기 위하여 미카엘리스-멘텐 반응 속도 매개변수(Michaelis-Menten kinetic parameters)를 측정한 결과이다. 도 3b는 선별된 키뉴레니나제의 활성을 분석하기 위하여 전환 속도(turnover rates, kcat)를 측정한 결과이다. 도 3c는 선별된 키뉴레니나제의 활성을 분석하기 위하여 촉매 효율성(Catalytic efficiencies, kcat/KM)을 측정 한 결과이다. 도 4는 선별된 키뉴레니나제 활성의 pH 의존성을 분석한 결과이다.도 5a는 선별된 키뉴레니나제 활성의 열적 안정성을 분석하기 위하여, 용융 온도를 측정한 결과이다. 도 5b는 선별된 키뉴레니나제 활성의 열적 안정성이 PEGylation 전후로 유지되는지 확인하기 위하여, 배양 시 간에 따른 활성을 측정한 결과이다. 도 6a은 선별된 키뉴레니나제의 키뉴레닌-유도 T 세포 증식 억제 회복 효과를 확인하기 위하여, L-KYN 존재 하 에서 K1-PEG 및 K4-PEG를 각각 처리한 후 T 세포의 형태학적 변화를 관찰한 결과이다. 도 6b는 선별된 키뉴레니나제의 키뉴레닌-유도 T 세포 증식 억제 회복 효과를 확인하기 위하여, L-KYN 존재 하 에서 K1-PEG 및 K4-PEG를 각각 처리한 후 T 세포수의 변화를 측정한 결과이다(*p≤0.05, **p≤0.01, ***p≤ 0.001). 도 7a는 선별된 키뉴레니나제의 종양 성장 억제 효과를 확인하기 위하여, 흑색종 동종 이식 동물 모델을 이용한 실험 계획을 나타낸 모식도이다. 도 7b는 선별된 키뉴레니나제의 종양 성장 억제 효과를 확인하기 위하여, 대조군(PBS, n=13), K1-PEG(20 mg/kg, n=13), K4-PEG(20 mg/kg, n=13)를 각각 투여한 흑색종(B16-F10) 동종 이식 모델의 각 군에서의 종양 부피 변화 를 측정한 결과이다. 도 7c는 선별된 키뉴레니나제의 종양 성장 억제 효과를 확인하기 위하여, 대조군(PBS, n=13), K1-PEG(20 mg/kg, n=13), K4-PEG(20 mg/kg, n=13)를 각각 투여한 흑색종(B16-F10) 동종 이식 모델의 종양 성장 곡선이다(*p≤ 0.05, **p≤0.01, ***p≤0.001). 오차 막대는 Mean±표준오차를 나타낸다. 도 7d는 선별된 키뉴레니나제의 종양 성장 억제 효과를 확인하기 위하여, 대조군(PBS, n=13), K1-PEG(20 mg/kg, n=13), K4-PEG(20 mg/kg, n=13)를 각각 투여한 후 실험 종료 시점에 흑색종 동종 이식 모델로부터 수득한 종양 의 대표적인 사진이다. 도 7e는 선별된 키뉴레니나제의 종양 성장 억제 효과를 확인하기 위하여, 대조군(PBS, n=13), K1-PEG(20 mg/kg, n=13), K4-PEG(20 mg/kg, n=13)를 각각 투여한 후 실험 종료 시점에 흑색종 동종 이식 모델로부터 수득한 종양 의 무게를 측정한 그래프이다(*p≤0.05, **p≤0.01, ***p≤0.001). 오차 막대는 Mean±표준오차를 나타낸다. 도 7f는 선별된 키뉴레니나제의 종양 성장 억제 효과를 확인하기 위하여, 대조군(PBS, n=13), K1-PEG(20 mg/kg, n=13), K4-PEG(20 mg/kg, n=13)를 각각 투여한 흑색종 동종 이식 모델 마우스의 체중 변화를 측정한 결과이다. 도 7g는 선별된 키뉴레니나제의 혈장 내 키뉴레린 분해 효과를 확인하기 위하여, 대조군(PBS, n=13), K1-PEG(20 mg/kg, n=13), K4-PEG(20 mg/kg, n=13)를 각각 투여한 후 실험 종료 시점에 흑색종 동종 이식 모델 마우스의 혈장 내 키뉴레린 농도를 측정한 결과이다. 도 8a는 선별된 키뉴레니나제의 종양 성장 억제 효과를 확인하기 위하여, 대장암종 동종 이식 동물 모델을 이용 한 실험 계획을 나타낸 모식도이다. 도 8b는 선별된 키뉴레니나제의 종양 성장 억제 효과를 확인하기 위하여, 대조군(PBS, n=6), K1-PEG(20 mg/kg, n=6), K4-PEG(20 mg/kg, n=6)를 각각 투여한 대장암종(CT-26) 동종 이식 모델의 각 군에서의 종양 부피 변화를 측정한 결과이다. 도 8c는 선별된 키뉴레니나제의 종양 성장 억제 효과를 확인하기 위하여, 대조군(PBS, n=6), K1-PEG(20 mg/kg, n=6), K4-PEG(20 mg/kg, n=6)를 각각 투여한 대장암종(CT-26) 동종 이식 모델의 종양 성장 곡선이다(*p≤0.05, **p≤0.01, ***p≤0.001). 오차 막대는 Mean±표준오차를 나타낸다. 도 8d는 선별된 키뉴레니나제의 종양 성장 억제 효과를 확인하기 위하여, 대조군(PBS, n=6), K1-PEG(20 mg/kg, n=6), K4-PEG(20 mg/kg, n=6)를 각각 투여한 후 실험 종료 시점에 대장암종 동종 이식 모델로부터 수득한 종양 의 대표적인 사진이다. 도 8e는 선별된 키뉴레니나제의 종양 성장 억제 효과를 확인하기 위하여, 대조군(PBS, n=6), K1-PEG(20 mg/kg, n=6), K4-PEG(20 mg/kg, n=6)를 각각 투여한 후 실험 종료 시점에 대장암종 동종 이식 모델로부터 수득한 종양 의 무게를 측정한 그래프이다. 오차 막대는 Mean±표준오차를 나타낸다. 도 8f는 선별된 키뉴레니나제의 종양 성장 억제 효과를 확인하기 위하여, 대조군(PBS, n=6), K1-PEG(20 mg/kg, n=6), K4-PEG(20 mg/kg, n=6)를 각각 투여한 대장암종 동종 이식 모델 마우스의 체중 변화를 측정한 결과이다."}
