{"patent_id": "10-2021-0182082", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0092572", "출원번호": "10-2021-0182082", "발명의 명칭": "지역 기반 서비스를 제공하는 방법 및 시스템", "출원인": "주식회사 당근마켓", "발명자": "문주성"}}
{"patent_id": "10-2021-0182082", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "적어도 하나의 프로세서에 의해 실행되는, 지역 기반 서비스를 제공하는 방법에 있어서,상기 지역 기반 서비스를 제공하는 어플리케이션에 가입된 복수의 사용자 계정과 연관된 복수의 사용자 단말의위치를 수신하는 단계; 상기 복수의 사용자 단말의 위치를 기초로 복수의 구역 노드를 생성하는 단계; 및상기 복수의 사용자 단말의 각각의 위치에 속하는 구역 노드 내에서 상기 지역 기반 서비스를 상기 복수의 사용자 단말의 각각에 제공하는 단계 를 포함하는, 지역 기반 서비스를 제공하는 방법."}
{"patent_id": "10-2021-0182082", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 복수의 사용자 단말의 위치를 기초로 복수의 구역 노드를 생성하는 단계는,주어진 영역을 미리 설정된 크기의 미리 결정된 형태를 가진 복수의 참조 노드로 분할하는 단계; 상기 분할된 복수의 참조 노드의 각각 내에서의 복수의 사용자 단말의 수를 산출하는 단계; 및상기 산출된 복수의 사용자 단말의 수 및 상기 복수의 참조 노드를 기초로 상기 복수의 구역 노드를 생성하는단계를 포함하는, 지역 기반 서비스를 제공하는 방법."}
{"patent_id": "10-2021-0182082", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 산출된 복수의 사용자 단말의 수 및 상기 복수의 참조 노드를 기초로 상기 복수의 구역 노드를 생성하는단계는,상기 복수의 참조 노드 중 하나의 참조 노드 내의 복수의 사용자 단말의 수가 미리 결정된 사용자 단말 수보다작은 경우, 상기 하나의 참조 노드 및 상기 하나의 참조 노드에 인접한 참조 노드 내에서의 복수의 사용자 단말의 분포를 기초로 상기 하나의 참조 노드 및 상기 인접한 참조 노드를 그루핑하는 단계; 및 상기 그루핑된 참조 노드를 상기 복수의 구역 노드 중 일부로서 결정하는 단계를 포함하는, 지역 기반 서비스를 제공하는 방법."}
{"patent_id": "10-2021-0182082", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 산출된 복수의 사용자 단말의 수 및 상기 복수의 참조 노드를 기초로 상기 복수의 구역 노드를 생성하는단계는,상기 복수의 참조 노드 중 하나의 참조 노드 내의 복수의 사용자 단말의 수가 미리 결정된 사용자 단말 수보다크거나 동일한 경우, 상기 하나의 참조 노드를 복수의 세부 참조 노드로 분할하는 단계; 및공개특허 10-2023-0092572-2-상기 분할된 복수의 세부 참조 노드를 상기 복수의 구역 노드 중 일부로서 결정하는 단계 를 포함하는, 지역 기반 서비스를 제공하는 방법."}
{"patent_id": "10-2021-0182082", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2항에 있어서,상기 복수의 참조 노드는 참조 노드 레벨에 따라 조정되고, 상기 산출된 복수의 사용자 단말의 수 및 상기 복수의 참조 노드를 기초로 상기 복수의 구역 노드를 생성하는단계는,상기 산출된 복수의 사용자 단말의 수에 따라 상기 복수의 참조 노드의 레벨을 조정함으로써 상기 복수의 참조노드의 크기를 변경시키는 단계; 및 상기 변경된 크기를 가진 복수의 참조 노드를 이용하여 상기 복수의 구역 노드를 생성하는 단계를 포함하는, 지역 기반 서비스를 제공하는 방법."}
{"patent_id": "10-2021-0182082", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제2항에 있어서,상기 분할된 복수의 참조 노드의 각각 내에서의 복수의 사용자 단말과 연관된 사용자 계정 정보를 수신하는 단계; 및상기 사용자 계정 정보를 이용하여 상기 복수의 사용자 단말의 상기 지역 기반 서비스에 대한 적합성을 판정하는 단계를 더 포함하고,상기 산출된 복수의 사용자 단말의 수 및 상기 복수의 참조 노드를 기초로 상기 복수의 구역 노드를 생성하는단계는,상기 판정된 적합성 및 상기 산출된 복수의 사용자 단말의 수를 반영하도록 상기 복수의 참조 노드를 조정함으로써, 상기 복수의 구역 노드를 생성하는 단계를 포함하는, 지역 기반 서비스를 제공하는 방법."}
{"patent_id": "10-2021-0182082", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제2항에 있어서,상기 분할된 복수의 참조 노드의 각각 내에서의 교통량 정보를 수신하는 단계를 더 포함하고, 상기 산출된 복수의 사용자 단말의 수 및 상기 복수의 참조 노드를 기초로 상기 복수의 구역 노드를 생성하는단계는,상기 교통량 정보 및 상기 산출된 복수의 사용자 단말의 수를 반영하도록 상기 복수의 참조 노드를 조정함으로써, 상기 복수의 구역 노드를 생성하는 단계를 포함하는, 지역 기반 서비스를 제공하는 방법."}
{"patent_id": "10-2021-0182082", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 복수의 사용자 단말의 위치를 기초로 복수의 구역 노드를 생성하는 단계는,공개특허 10-2023-0092572-3-주어진 영역을 미리 설정된 크기의 미리 결정된 형태를 가진 복수의 참조 노드로 분할하는 단계; 상기 분할된 복수의 참조 노드에서의 사용자 단말 분포, 사용자 계정 정보 또는 교통량 정보 중 적어도 하나의정보를 수신하는 단계; 및상기 수신된 적어도 하나의 정보를 기계학습 모델을 입력하여, 상기 복수의 참조 노드를 이용하여 생성된 복수의 구역 노드를 생성하는 단계를 포함하는, 지역 기반 서비스를 제공하는 방법."}
{"patent_id": "10-2021-0182082", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항 내지 제8항 중 어느 한 항의 방법에 따른 각각의 단계를 수행하는 명령어를 포함하는 프로그램이 기록된,컴퓨터 판독가능 저장매체."}
{"patent_id": "10-2021-0182082", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "지역 기반 서비스를 제공하는 시스템으로서,하나 이상의 인스트럭션(instructions)을 저장하는 메모리:상기 저장된 하나 이상의 인스트럭션을 실행함으로써, 상기 지역 기반 서비스를 제공하는 어플리케이션에 가입된 복수의 사용자 계정과 연관된 복수의 사용자 단말의위치를 수신하고, 상기 복수의 사용자 단말의 위치를 기초로 복수의 구역 노드를 생성하고, 상기 복수의 사용자단말의 각각의 위치에 속하는 구역 노드 내에서 상기 지역 기반 서비스를 상기 복수의 사용자 단말의 각각에 제공하도록 구성된 프로세서를 포함하는, 시스템."}
{"patent_id": "10-2021-0182082", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 지역 기반 서비스를 제공하는 방법에 관한 것이다. 지역 기반 서비스를 제공하는 방법은, 지역 기반 서비스를 제공하는 어플리케이션에 가입된 복수의 사용자 단말 계정과 연관된 복수의 사용자 단말의 위치를 수신 하는 단계, 복수의 사용자 단말의 위치를 기초로 복수의 구역 노드를 생성하는 단계, 복수의 사용자 단말의 각각 의 위치에 속하는 구역 노드 내에서 상기 지역 기반 서비스를 사용자 단말의 각각에 제공하는 단계를 포함한다."}
{"patent_id": "10-2021-0182082", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 지역 기반 서비스를 제공하는 방법 및 시스템에 관한 것으로, 구체적으로, 지역 기반 서비스를 제공 하는 어플리케이션에 가입된 복수의 사용자 계정과 연관된 복수의 사용자 단말의 위치에 기초하여 복수의 구역 노드를 생성하고, 사용자 단말의 위치가 속하고 있는 구역 노드 내에서 지역 기반 서비스를 제공하는 방법 및 시스템에 관한 것이다."}
{"patent_id": "10-2021-0182082", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "이동통신 기술의 발달과 더불어 다양한 통신망에서 이동 단말의 위치를 산출하는 기술이 활발하게 연구되고 있 으며, 이러한 위치 정보를 가공하여 다양한 서비스를 제공하는 지역 기반 서비스의 이용이 증가하고 있다. 일 반적으로, 지역 기반 서비스는 무선 인터넷 사용자에게 사용자가 위치하고 있는 지역에 따르는 특정 서비스 또 는 정보 등을 지칭할 수 있다. 기존의 지역 기반 서비스는, 미리 정해진 행정구를 기준으로 분리된 지역을 기초로 제공되어 왔다. 즉, 사용자 는 사용자가 속한 행정구에 대응하는 구역에서 지역 서비스를 제공받을 수 있다. 이에 따라, 사용자는 자신이 속한 행정구의 크기와 모양에 따라 결정된 구역에서의 지역 서비스를 제공받을 수 있다. 즉, 사용자는 자신의 위치에서 거리가 가까운 위치의 지역이 아니라 거리가 먼 지역에서 지역 서비스를 이용해야 하는 불편함이 있었"}
{"patent_id": "10-2021-0182082", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "다.발명의 내용"}
{"patent_id": "10-2021-0182082", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 상기와 같은 문제점을 해결하기 위한 지역 기반 서비스를 제공하는 방법 및 시스템을 제공한다."}
{"patent_id": "10-2021-0182082", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시는 방법, 시스템(장치) 또는 판독가능 저장매체에 저장된 컴퓨터 프로그램을 포함한 다양한 방식으로 구 현될 수 있다. 본 개시의 일 실시예에 따르면, 적어도 하나의 프로세서에 의해 실행되는 지역 기반 서비스를 제공하는 방법에 있어서, 지역 기반 서비스를 제공하는 어플리케이션에 가입된 복수의 사용자 계정과 연관된 복수의 사용자 단말 의 위치를 수신하는 단계, 복수의 사용자 단말의 위치를 기초로 복수의 구역 노드를 생성하는 단계, 복수의 사 용자 단말의 각각의 위치에 속하는 구역 노드 내에서 지역 기반 서비스를 복수의 사용자 단말의 각각에 제공하 는 단계를 포함한다. 본 개시의 일 실시예에 따르면, 복수의 사용자 단말의 위치를 기초로 복수의 구역 노드를 생성하는 단계는, 주 어진 영역을 미리 설정된 크기의 미리 결정된 형태를 가진 복수의 참조 노드로 분할하는 단계, 분할된 복수의 참조 노드의 각각 내에서의 복수의 사용자 단말의 수를 산출하는 단계 및 산출된 복수의 사용자 단말의 수 및 복수의 참조 노드를 기초로 복수의 구역 노드를 생성하는 단계를 포함한다. 본 개시의 일 실시예에 따르면, 산출된 복수의 사용자 단말의 수 및 복수의 참조 노드를 기초로 복수의 구역 노 드를 생성하는 단계는, 복수의 참조 노드 중 하나의 참조 노드 내의 복수의 사용자 단말의 수가 미리 결정된 사 용자 단말 수보다 작은 경우, 하나의 참조 노드 및 하나의 참조 노드에 인접한 참조 노드 내에서의 복수의 사용 자 단말의 분포를 기초로 하나의 참조 노드 및 인접한 참조 노드를 그루핑하는 단계 및 그루핑된 참조 노드를 복수의 구역 노드 중 일부로서 결정하는 단계를 포함한다. 본 개시의 일 실시예에 따르면, 산출된 복수의 사용자 단말의 수 및 복수의 참조 노드를 기초로 복수의 구역 노 드를 생성하는 단계는, 복수의 참조 노드 중 하나의 참조 노드 내의 복수의 사용자 단말의 수가 미리 결정된 사 용자 단말 수보다 크거나 동일한 경우, 하나의 참조 노드를 복수의 세부 참조 노드로 분할하는 단계 및 분할된 복수의 세부 참조 노드를 복수의 구역 노드 중 일부로서 결정하는 단계를 포함한다. 본 개시의 일 실시예에 따르면, 복수의 참조 노드는 참조 노드 레벨에 따라 조정되고, 산출된 복수의 사용자 단 말의 수 및 복수의 참조 노드를 기초로 복수의 구역 노드를 생성하는 단계는, 산출된 복수의 사용자 단말의 수 에 따라 복수의 참조 노드의 레벨을 조정함으로써 복수의 참조 노드의 크기를 변경시키는 단계 및 변경된 크기 를 가진 복수의 참조 노드를 이용하여 복수의 구역 노드를 생성하는 단계를 포함한다. 본 개시의 일 실시예에 따르면, 본 방법은 분할된 복수의 참조 노드의 각각 내에서의 복수의 사용자 단말과 연 관된 사용자 계정 정보를 수신하는 단계 및 복수의 사용자과 연관된 사용자 계정 정보를 이용하여 복수의 사용 자 단말의 지역 기반 서비스에 대한 적합성을 판정하는 단계를 더 포함하고, 산출된 복수의 사용자 단말의 수 및 복수의 참조 노드를 기초로 복수의 구역 노드를 생성하는 단계는, 판정된 적합성 및 산출된 복수의 사용자 단말의 수를 반영하도록 복수의 참조 노드를 조정함으로써, 복수의 구역 노드를 생성하는 단계를 포함한다. 본 개시의 일 실시예에 따르면, 본 방법은 분할된 복수의 참조 노드의 각각 내에서의 교통량 정보를 수신하는 단계를 더 포함하고, 산출된 복수의 사용자 단말의 수 및 복수의 참조 노드를 기초로 복수의 구역 노드를 생성 하는 단계는, 교통량 정보 및 산출된 복수의 사용자 단말의 수를 반영하도록 복수의 참조 노드를 조정함으로써, 복수의 구역 노드를 생성하는 단계를 포함한다. 본 개시의 일 실시예에 따르면, 복수의 사용자 단말의 위치를 기초로 복수의 구역 노드를 생성하는 단계는, 주 어진 영역을 미리 설정된 크기의 미리 결정된 형태를 가진 복수의 참조 노드로 분할하는 단계, 분할된 복수의 참조 노드에서의 사용자 단말 분포, 사용자 계정 정보 또는 교통량 정보 중 적어도 하나의 정보를 수신하는 단 계 및 수신된 적어도 하나의 정보를 기계학습 모델을 입력하여, 복수의 참조 노드를 이용하여 생성된 복수의 구 역 노드를 생성하는 단계를 포함한다. 본 개시의 일 실시예에 따르면, 상술된 지역 기반 서비스를 제공하는 방법에 따른 각각의 단계를 수행하는 명령 어를 포함하는 프로그램이 기록된 컴퓨터 판독가능 저장매체를 포함한다. 본 개시의 일 실시예에 따른 지역 기반 서비스를 제공하는 시스템은, 하나 이상의 인스트럭션(instructions)을 저장하는 메모리, 저장된 하나 이상의 인스트럭션을 실행함으로써, 지역 기반 서비스를 제공하는 어플리케이션 에 가입된 복수의 사용자 계정과 연관된 복수의 사용자 단말의 위치를 수신하고, 복수의 사용자 단말의 위치를 기초로 복수의 구역 노드를 생성하고, 복수의 사용자 단말의 각각의 위치에 속하는 구역 노드 내에서 지역 기반 서비스를 복수의 사용자 단말의 각각에 제공하도록 구성된 프로세서를 포함한다."}
{"patent_id": "10-2021-0182082", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 일부 실시예에 따르면, 사용자 단말이 속한 구역 노드 내에서 지역 기반 서비스를 제공할 수 있다. 본 개시의 일부 실시예에 따르면, 지역 기반 서비스를 제공하는 어플리케이션에 가입된 복수의 사용자 계정과 연관된 복수의 사용자 단말의 수에 기초하여 구역 노드를 생성함으로써, 사용자 단말에게 제공할 서비스의 제공 범위를 자동으로 조절할 수 있다. 본 개시의 일부 실시예에 따르면, 참조 노드에서 수신된 사용자 단말 분포, 사용자 계정 정보 또는 교통량 정보 중 적어도 하나의 정보를 이용하여 구역 노드를 생성함으로써, 사용자 단말에게 제공할 서비스의 제공 범위를 자동으로 조절할 수 있다. 본 개시의 일부 실시예에 따르면, 지역 기반 서비스를 제공하기 위해, 행정구를 기준으로 한 지역 분리 대신 참 조 노드를 이용한 지역 분리를 이용함으로써, 지역 기반 서비스를 이용하는 사용자 간의 물리적 거리를 우선적 으로 반영하여 거래를 위한 효율적인 매칭이 이루어질 수 있다. 본 개시의 일부 실시예에 따르면, 공간에 대한 그리드 셀 분할을 위해, 이웃하는 도형까지의 거리가 동일한 참 조 노드를 활용함으로써, 사용자가 이동할 때 발생하는 양자화 오류(quantization error)가 최소화될 수 있다. 본 개시의 효과는 이상에서 언급한 효과로 제한되지 않으며, 언급되지 않은 다른 효과들은 청구범위의 기재로부"}
{"patent_id": "10-2021-0182082", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "터 본 개시가 속하는 기술분야에서 통상의 지식을 가진 자(“통상의 기술자”라 함)에게 명확하게 이해될 수 있 을 것이다."}
{"patent_id": "10-2021-0182082", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 개시의 실시를 위한 구체적인 내용을 첨부된 도면을 참조하여 상세히 설명한다. 다만, 이하의 설명에 서는 본 개시의 요지를 불필요하게 흐릴 우려가 있는 경우, 널리 알려진 기능이나 구성에 관한 구체적 설명은 생략하기로 한다. 첨부된 도면에서, 동일하거나 대응하는 구성요소에는 동일한 참조부호가 부여되어 있다. 또한, 이하의 실시예 들의 설명에 있어서, 동일하거나 대응되는 구성요소를 중복하여 기술하는 것이 생략될 수 있다. 그러나, 구성 요소에 관한 기술이 생략되어도, 그러한 구성요소가 어떤 실시예에 포함되지 않는 것으로 의도되지는 않는다. 개시된 실시예의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 후술되어 있는 실시예 들을 참조하면 명확해질 것이다. 그러나, 본 개시는 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 개시가 완전하도록 하고, 본 개시가 통상의 기술 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것일 뿐이다. 본 명세서에서 사용되는 용어에 대해 간략히 설명하고, 개시된 실시예에 대해 구체적으로 설명하기로 한다. 본 명세서에서 사용되는 용어는 본 개시에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 관련 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 발명의 설명 부분에서 상세히 그 의미를 기재할 것이다. 따라서, 본 개시에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어 가 가지는 의미와 본 개시의 전반에 걸친 내용을 토대로 정의되어야 한다. 본 명세서에서의 단수의 표현은 문맥상 명백하게 단수인 것으로 특정하지 않는 한, 복수의 표현을 포함한다. 또한, 복수의 표현은 문맥상 명백하게 복수인 것으로 특정하지 않는 한, 단수의 표현을 포함한다. 명세서 전체 에서 어떤 부분이 어떤 구성요소를 포함한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있음을 의미한다. 또한, 명세서에서 사용되는 '모듈' 또는 '부'라는 용어는 소프트웨어 또는 하드웨어 구성요소를 의미하며, '모 듈' 또는 '부'는 어떤 역할들을 수행한다. 그렇지만, '모듈' 또는 '부'는 소프트웨어 또는 하드웨어에 한정되 는 의미는 아니다. '모듈' 또는 '부'는 어드레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서, '모듈' 또는 '부'는 소프트웨어 구성요소들, 객체지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이 크로 코드, 회로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레이들 또는 변수들 중 적어도 하나를 포 함할 수 있다. 구성요소들과 '모듈' 또는 '부'들은 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 '모듈' 또는 '부'들로 결합되거나 추가적인 구성요소들과 '모듈' 또는 '부'들로 더 분리될 수 있다. 본 개시의 일 실시예에 따르면, '모듈' 또는 '부'는 프로세서 및 메모리로 구현될 수 있다. '프로세서'는 범용 프로세서, 중앙 처리 장치(CPU), 마이크로프로세서, 디지털 신호 프로세서(DSP), 제어기, 마이크로제어기, 상태 머신 등을 포함하도록 넓게 해석되어야 한다. 몇몇 환경에서, '프로세서'는 주문형 반도체(ASIC), 프로그램가 능 로직 디바이스(PLD), 필드 프로그램가능 게이트 어레이(FPGA) 등을 지칭할 수도 있다. '프로세서'는, 예를 들어, DSP와 마이크로프로세서의 조합, 복수의 마이크로프로세서들의 조합, DSP 코어와 결합한 하나 이상의 마 이크로프로세서들의 조합, 또는 임의의 다른 그러한 구성들의 조합과 같은 처리 디바이스들의 조합을 지칭할 수 도 있다. 또한, '메모리'는 전자 정보를 저장 가능한 임의의 전자 컴포넌트를 포함하도록 넓게 해석되어야 한 다. '메모리'는 임의 액세스 메모리(RAM), 판독-전용 메모리(ROM), 비-휘발성 임의 액세스 메모리(NVRAM), 프 로그램가능 판독-전용 메모리(PROM), 소거-프로그램가능 판독 전용 메모리(EPROM), 전기적으로 소거가능 PROM(EEPROM), 플래쉬 메모리, 자기 또는 광학 데이터 저장장치, 레지스터들 등과 같은 프로세서-판독가능 매체 의 다양한 유형들을 지칭할 수도 있다. 프로세서가 메모리로부터 정보를 판독하고/하거나 메모리에 정보를 기 록할 수 있다면 메모리는 프로세서와 전자 통신 상태에 있다고 불린다. 프로세서에 집적된 메모리는 프로세서 와 전자 통신 상태에 있다.본 개시에서, '시스템'은 서버 장치와 클라우드 장치 중 적어도 하나의 장치를 포함할 수 있으나, 이에 한정되 는 것은 아니다. 예를 들어, 시스템은 하나 이상의 서버 장치로 구성될 수 있다. 다른 예로서, 시스템은 하나 이상의 클라우드 장치로 구성될 수 있다. 또 다른 예로서, 시스템은 서버 장치와 클라우드 장치가 함께 구성되 어 동작될 수 있다. 본 개시에서, '지역 기반 서비스'는. 사용자의 위치의 근방에 있는 다른 사용자들 사이의 서비스 및/또는 정보 를 제공할 수 있는 임의의 서비스를 지칭할 수 있다. 예를 들어, 지역 기반 서비스는 사용자가 사용자 위치의 근방의 또는 가까운 다른 사용자와 물품(예를 들어, 중고 물품)을 거래할 수 있는 지역 기반 거래 서비스를 지 칭할 수 있다. 다른 예로서, 지역 기반 서비스는 사용자가 사용자의 위치의 근방의 또는 가까운 다른 사용자와 이용할 수 있는 간편결제 서비스를 지칭할 수 있다. 또 다른 예로서, 지역 기반 서비스는 사용자가 사용자 위 치의 근방의 또는 가까운 다른 사용자와 게시판을 통해 정보를 주고받을 수 있는 서비스를 지칭할 수 있다. 또 다른 예로서, 지역 기반 서비스는 사용자가 사용자의 위치의 근방의 또는 가까운 다른 사용자와 대화방을 통해 통신할 수 있는 서비스를 지칭할 수 있다. 본 개시에서, '사용자'는 지역 기반 서비스를 제공하는 어플리케이션을 이용하는 사용자 또는 지역 기반 서비스 를 제공하는 어플리케이션의 사용자 계정을 지칭할 수 있다. 여기서, 사용자 계정은 지역 기반 서비스를 제공 하는 어플리케이션에서 생성하고 이용하는 계정 또는 이와 관련된 데이터를 나타낼 수 있다. 본 개시에서는, '사용자'가 '사용자 계정'을 지칭할 수 있으며, '사용자 계정'은 '사용자'를 지칭할 수 있다. 본 개시에서, '참조 노드'는 주어진 영역을 미리 설정된 크기의 참조 노드(예를 들어, 다각형, 원 등)의 형태로 분할한 영역을 지칭할 수 있다. 본 개시에서, '구역 노드'는 사용자의 위치를 기준으로 사용자에게 다양한 지역 기반 서비스를 제공할 수 있는 제공 범위로, 하나 이상의 참조 노드를 이용하여 생성된 영역을 포함할 수 있다. 본 개시에서, '기계학습 모델'은 주어진 입력에 대한 정답(ground truth)을 추론하는데 사용하는 임의의 모델을 포함할 수 있다. 일 실시예에 따르면, 기계학습 모델은 입력 레이어(층), 복수 개의 은닉 레이어 및 출력 레이 어를 포함한 인공신경망 모델을 포함할 수 있다. 여기서, 각 레이어는 복수의 노드를 포함할 수 있다. 본 개시에서, '디스플레이'는 컴퓨팅 장치와 연관된 임의의 디스플레이 장치를 지칭할 수 있는데, 예를 들어, 컴퓨팅 장치에 의해 제어되거나 컴퓨팅 장치로부터 제공된 임의의 정보/데이터를 표시할 수 있는 임의의 디스플 레이 장치를 지칭할 수 있다. 본 개시에서, '복수의 A의 각각' 또는 '복수의 A 각각'은 복수의 A에 포함된 모든 구성요소의 각각을 지칭하거 나, 복수의 A에 포함된 일부 구성 요소의 각각을 지칭할 수 있다. 예를 들어, 복수의 사용자 단말의 각각은 복 수의 사용자의 단말 중 적어도 일부의 사용자 단말의 각각을 지칭할 수 있다. 도 1은 본 개시의 일 실시예에 따라 사용자 단말에서 동작하는 어플리케이션을 통해 지역 기반 서비스가 제공되는 예시를 나타내는 도면이다. 도시된 바와 같이, 사용자는 사용자 단말을 이용하여 지역 기 반 서비스를 위한 어플리케이션을 실행 중일 수 있으며, 사용자 단말을 통해 현재 자신의 위치를 기반으로 한 서비스를 제공받을 수 있다. 일 실시예에 따르면, 제1 인터페이스에 접근을 요청하는 사용자의 입력에 응답하여, 사용자 단말의 프로세서는 디스플레이 상에 제1 인터페이스를 출력할 수 있다. 여 기서, 제1 인터페이스에 접근을 요청하는 사용자의 입력은, 어플리케이션의 실행을 위한 아이콘에 대 한 터치 또는 클릭 입력, 다른 페이지에서 제1 인터페이스로 전환하기 위한 아이콘 또는 버튼 등에 대한 터치 또는 클릭, 또는 드래그 입력 등을 포함할 수 있다. 예를 들어, 사용자 단말의 프로세서는 어플리케 이션을 실행하기 위해 해당 서비스 어플리케이션의 아이콘을 터치하는 사용자의 입력에 응답하여, 제1 인 터페이스의 화면이 사용자 단말의 디스플레이 상에 표시될 수 있다. 일 실시예에 따르면, 제1 인터페이스는 사용자의 위치의 근방에 있는 다른 사용자들 사이의 서비스 및/또 는 정보를 제공할 수 있는 임의의 서비스를 제공하기 위한 인터페이스일 수 있다. 예를 들어, 도시된 바와 같 이, 지역 기반 서비스는 중고거래 서비스, 알바 서비스, 농수산물 서비스, 중고차 거래 서비스, 과외 클래 스, 부동산, 생활 서비스, 국민지원금 서비스, 맛집 추천 등을 포함할 수 있으나, 이에 한정되지 않는다. 추가적으로, 사용자 단말의 프로세서는 제1 인터페이스에 접근을 요청하는 사용자의 입력에 응답하여, 지역 기반 서비스와 연관된 데이터를 수신할 수 있다. 이 경우, 사용자 단말의 프로세서는, 지 역 기반 서비스와 연관된 데이터를 저장 및 관리하는 외부 시스템(예를 들어, 정보 처리 시스템)로부터 해당 데이터를 수신할 수 있다. 예를 들어, 지역 기반 서비스와 연관된 데이터는 현재 사용자의 실시간 위치, 사용자 가 미리 설정해 놓은 지역의 위치, 사용자가 미리 설정해 놓은 지역과 현재 사용자의 실시간 위치 간의 일치 여 부, 사용자가 제공받고자 하는 서비스 등과 같이 지역 기반 서비스를 이용하기 위한 데이터를 포함할 수 있다. 추가적으로, 프로세서는 제1 인터페이스에 접근을 요청하는 사용자의 입력에 응답하여, 지역 기반 서비스 제공 여부를 결정할 수 있다. 예를 들어, 사용자의 실시간 위치가 확인되었는지 여부, 사용자가 미리 설정해 놓은 지역과 현재 사용자의 실시간 위치가 일치하는지 여부 등에 따라 지역 기반 서비스 제공 여부를 결정할 수 있다. 지역 기반 서비스 제공 여부를 결정하는 단계는 사용자 단말의 프로세서 또는 정보 처리 시스템의 프로세서에 의해 수행될 수 있다. 일 실시예에서, 사용자 단말의 프로세서는 제1 인터페이스에서 제2 인터페이스로 전환되고서, 지역 기반 서비스를 제공할 수 있다. 제1 인터페이스에서 제2 인터페이스로의 전환은 사용자의 입력에 응답하여 수행될 수 있다. 예를 들어, 사용자 단말의 프로세서는 제1 인터페이스에서 제2 인터페 이스로의 전환을 요청하는 사용자의 입력(예를 들어, 복수의 지역 기반 서비스 중에서 하나의 지역 기반 서비스를 선택)에 응답하여, 지역 기반 서비스를 출력할 수 있다. 추가적으로, 사용자 단말의 프로세서는 지역 기반 서비스 제공 여부 결정에 따라, 지역 기반 서비스가 선 택적으로 제공될 수 있다. 일 실시예에서, 사용자의 실시간 위치가 확인되지 않아, 지역 기반 서비스를 제공하 지 않기로 결정한 경우, 사용자 단말의 프로세서는 제1 인터페이스 내에 지역 기반 서비스를 출력하 지 않을 수 있다. 제2 인터페이스에는 제1 인터페이스에서 사용자가 선택한 지역 기반 서비스를 제공하기 위한 복수의 영역을 포함할 수 있다. 예를 들어, 사용자가 제1 인터페이스에서 '중고거래' 서비스를 선택하였다 면, 프로세서는 중고거래를 위한 물품 항목을 검색할 수 있는 검색창을 제1 영역에 출력하고, 사용자의 위 치 및 복수의 사용자 단말의 위치를 기초로 생성된 구역 노드 내에서, 제1 영역에서 검색된 물품 항목에 대한 중고거래가 가능한 복수의 사용자 단말의 위치를 제2 영역에 출력할 수 있다. 도시된 바와 같이, 사용자가 검색창에 'A 물품'을 검색하면, 사용자 단말이 속한 구역 노드 내에서 A 물품을 판매하는 복수의 사용 자(또는 사용자 단말)의 위치가 출력될 수 있다. 추가적으로, 생성된 구역 노드 내에서, 제1 영역에서 검색된 물품 항목에 대한 중고거래가 가능한 사용자 단말의 수가 미리 결정된 사용자 단말 수보다 작을 경우, 구역 노드를 이루고 있는 참조 노드 및 인접한 참조 노드를 그루핑하여 구역 노드의 크기가 더 크게 설정될 수 있다. 즉, 중고거래 서비스의 제공 범위를 더 넓어 진 구역 노드가 제2 영역에 출력될 수 있다. 반대로, 생성된 구역 노드 내에서, 제1 영역에서 검색 된 물품 항목에 대한 중고거래가 가능한 사용자 단말의 수가 미리 결정된 사용자 단말 수보다 크거나 동일할 경 우, 구역 노드를 이루고 있는 참조 노드를 복수의 세부 참조 노드로 분할함으로써, 구역 노드의 크기가 더 작게 설정될 수 있다. 즉, 중고거래 서비스의 제공 범위를 더 좁혀진 구역 노드가 제2 영역에 출력될 수 있다. 이와 같은 구성에 의하여, 사용자가 속한 구역 노드 내에 지역 기반 서비스를 이용하는 미리 결정된 수의 사용 자 단말이 포함될 수 있도록 해당 구역 노드의 크기를 자동으로 조절함으로써, 지역 기반 서비스가 미리 결정된 수의 사용자 수가 확보된 구역 노드 내에서 사용자에게 제공될 수 있다. 도 2는 본 개시의 일 실시예에 따라 지역 기반 서비스를 위한 지역 분리의 예시를 나타내는 도면이다. 기존의 지역 기반 서비스는 지역을 행정구 단위로 분할한 뒤, 사용자가 사용자 단말을 이용하여 미리 설정한 행정 구와 사용자의 실시간 위치를 비교하여 서로 일치할 경우 지역 기반 서비스를 제공해왔다. 하지만, 이러한 기 존의 지역 기반 서비스는, 행정구를 기준으로 지역을 분리하고 있기 때문에, 행정구가 형성된 모양에 따라 거래 서비스를 위한 사용자 매칭에 한계가 발생한다는 문제점이 있었다. 즉, 행정구를 기준으로 서비스를 제공하는 기존의 지역 기반 서비스는 사용자들 간의 물리적 거리를 반영하지 않아 효율적인 거래 서비스가 이루어지 지 않을 수 있었다. 예를 들어, 도 2에 도시된 바와 같이, '사용자 A'가 지역 기반 서비스를 진행하고자 할 때, 물리적으로 가까운 위치에 있으나 다른 행정구에 속한 '사용자 B'보다 같은 행정구 내에 위치하고 있으나 물리적으로 먼 위치에 있는 '사용자 C'가 우선적으로 노출되어 비효율적인 거래가 이루어질 수 있 다. 이러한 문제점을 해결하기 위한 본 발명의 지역 기반 서비스에서는 지역을 행정구 단위로 분리하는 것이 아닌, 일정한 모양의 참조 노드를 이용한 복수의 그리드로 지역을 분리하여 거래 서비스를 위한 사용자 매칭이수행될 수 있다. 일 실시예에서, 본 발명의 지역 기반 서비스는 지역을 육각형을 가진 참조 노드를 이용 한 그리드로 분할하여 구역 노드를 생성할 수 있다. 예를 들어, 본 발명의 지역 기반 서비스는 사용자가 위치하고 있는 지역을 기준으로 미리 설정된 크기의 육각형 형태로 분할하여 복수의 참조 노드를 생성하고, 복 수의 참조 노드 내에 포함된, 거래를 위한 사용자들의 수에 기초하여 구역 노드를 생성함으로써 물리적 거리에 기초하여 효율적인 거래가 이루어질 수 있다. 도 2에 도시된 바와 같이, '사용자 A'가 본 발명의 지역 기 반 서비스를 이용하고자 할 때, '사용자 B'와 '사용자 C' 중에서 물리적으로 가까운 위치에 있는 '사 용자 B'와 거래를 진행할 수 있는 편리함이 제공될 수 있다. 도 2에서는 육각형 그리드를 사용하여 지역을 분리한 것으로 도시되었으나, 이에 한정되지 않으며, 삼각형, 사 각형, 팔각형 등의 임의의 다각형 또는 원 형태가 사용될 수 있다. 도 3은 본 개시의 일 실시예에 따른 지역 기반 서비스를 제공하기 위하여, 정보 처리 시스템이 복수의 사 용자 단말(310_1, 310_2, 310_3)과 통신 가능하도록 연결될 구성을 나타내는 개요도이다. 정보 처리 시스템 은 네트워크를 통해 복수의 사용자 단말(310_1, 310_2, 310_3)에 지역 기반 서비스를 제공할 수 있는 시스템을 포함할 수 있다. 일 실시예에 따르면, 정보 처리 시스템은 컴퓨터 실행 가능한 프로그램(예를 들어, 다운로드 가능한 어플리케이션) 및 데이터를 저장, 제공 및 실행할 수 있는 하나 이상의 서버 장치 및/또 는 데이터베이스, 또는 클라우드 컴퓨팅 서비스 기반의 하나 이상의 분산 컴퓨팅 장치 및/또는 분산 데이터베이 스를 포함할 수 있다. 예를 들어, 정보 처리 시스템은 지역 기반 서비스를 위한 별도의 시스템(예를 들어, 서버 장치, 클라우드 장치 등)들을 포함할 수 있다. 정보 처리 시스템에 의해 제공되는 지역 기반 서비스는, 복수의 사용자 단말(310_1, 310_2, 310_3)의 각각에 설치된 지역 기반 서비스 제공 어플리케이션을 통해 사용자에게 제공될 수 있다. 복수의 사용자 단말(310_1, 310_2, 310_3)은 네트워크를 통해 정보 처리 시스템과 통신할 수 있다. 네트워크는, 복수의 사용자 단말(310_1, 310_2, 310_3)과 정보 처리 시스템 사이의 통신이 가능하도 록 구성될 수 있다. 네트워크는 설치 환경에 따라, 예를 들어, 이더넷(Ethernet), 유선 홈 네트워크 (Power Line Communication), 전화선 통신 장치 및 RS-serial 통신 등의 유선 네트워크, 이동통신망, WLAN(Wireless LAN), Wi-Fi, Bluetooth 및 ZigBee 등과 같은 무선 네트워크 또는 그 조합으로 구성될 수 있다. 통신 방식은 제한되지 않으며, 네트워크가 포함할 수 있는 통신망(일례로, 이동통신망, 유선 인터넷, 무선 인터넷, 방송망, 위성망 등)을 활용하는 통신 방식뿐만 아니라 사용자 단말(310_1, 310_2, 310_3) 사이의 근거 리 무선 통신 역시 포함될 수 있다. 예를 들어, 네트워크는, PAN(personal area network), LAN(local area network), CAN(campus area network), MAN(metropolitan area network), WAN(wide area network), BBN(broadband network), 인터넷 등의 네트워크 중 하나 이상의 임의의 네트워크를 포함할 수 있다. 또한, 네트워크는 버스 네트워크, 스타 네트워크, 링 네트워크, 메쉬 네트워크, 스타-버스 네트워크, 트리 또는 계층적(hierarchical) 네트워크 등을 포함하는 네트워크 토폴로지 중 임의의 하나 이상을 포함할 수 있으 나, 이에 제한되지 않는다. 도 3에서 스마트폰 단말(310_1), 태블릿 단말(310_2) 및 랩톱(laptop) 컴퓨터 단말(310_3)이 사용자 단말의 예 로서 도시되었으나, 이에 한정되지 않으며, 사용자 단말(310_1, 310_2, 310_3)은 유선 및/또는 무선 통신이 가 능하고 지역 기반 서비스 제공 어플리케이션이 설치되어 실행될 수 있는 임의의 컴퓨팅 장치일 수 있다. 예를 들어, 사용자 단말은, 스마트폰, 휴대폰, 내비게이션, 컴퓨터, 노트북, 디지털방송용 단말, PDA(Personal Digital Assistants), PMP(Portable Multimedia Player), 태블릿 PC, 게임 콘솔(game console), 웨어러블 장치 (wearable device), IoT(internet of things) 장치, VR(virtual reality) 장치, AR(augmented reality) 장치 등을 포함할 수 있다. 또한, 도 3에는 3개의 사용자 단말(310_1, 310_2, 310_3)이 네트워크를 통해 정보 처리 시스템과 통신하는 것으로 도시되어 있으나, 이에 한정되지 않으며, 상이한 수의 사용자 단말(310_1, 310_2, 310_3)이 네트워크를 정보 처리 시스템과 통신하도록 구성될 수도 있다. 일 실시예에서, 정보 처리 시스템은 사용자 단말(310_1, 310_2, 310_3)로부터 거래 물품 검색어를 포함하 는 지역 기반 서비스 요청 정보를 수신하고, 해당 거래 물품 검색어와 연관된 지역 기반 서비스를 사용자 단말 (310_1, 310_2, 310_3)로 전송할 수 있다. 또한, 정보 처리 시스템은 사용자 단말(310_1, 310_2, 310_ 3)로부터 지역 기반 서비스 요청 정보를 수신하고, 사용자의 위치를 기준으로 사용자로부터 요청받은 거래 서비 스가 가능한 다른 사용자들의 분포 정보를 사용자 단말(310_1, 310_2, 310_3)로 전송할 수 있다. 예를 들어, 사용자 단말(310_1, 310_2, 310_3)은 수신된 거래 물품 검색어와 연관된 지역 기반 서비스 정보를 출력할 수 있 다.일 실시예에 따르면, 정보 처리 시스템은 복수의 사용자 단말(310_1, 310_2, 310_3)의 각각의 위치를 수신 할 수 있다. 예를 들어, 복수의 사용자 단말은 지역 기반 서비스를 제공하는 어플리케이션에 복수의 사용자 단 말의 각각과 연관된 해당 어플리케이션의 사용자 계정을 이용하여 가입하는 동안 또는 해당 어플리케이션의 요 청에 응답하여, 사용자 단말의 사용자 위치를 정보 처리 시스템에 제공할 수 있다. 정보 처리 시스템 은 복수의 사용자 단말의 위치를 기초로 복수의 구역 노드를 생성할 수 있다. 정보 처리 시스템은 복수의 사용자 단말(310_1, 310_2, 310_3)의 각각의 위치에 속하는 구역 노드 내에서 지역 기반 서비스를 해당 사용자 단말에 제공할 수 있다. 도 4는 본 개시의 일 실시예에 따른 사용자 단말 및 정보 처리 시스템의 내부 구성을 나타내는 블록 도이다. 사용자 단말은 지역 기반 서비스를 제공하는 어플리케이션이 실행 가능하고 유/무선 통신이 가능 한 임의의 컴퓨팅 장치를 지칭할 수 있으며, 예를 들어, 도 3의 스마트폰 단말(310_1), 태블릿 단말(310_2), 랩 톱 컴퓨터 단말(310_3) 등을 포함할 수 있다. 도시된 바와 같이, 사용자 단말은 메모리, 프로세서 , 통신 모듈 및 입출력 인터페이스를 포함할 수 있다. 이와 유사하게, 정보 처리 시스템 은 메모리, 프로세서, 통신 모듈 및 입출력 인터페이스를 포함할 수 있다. 도 4에 도시된 바와 같이, 사용자 단말 및 정보 처리 시스템은 각각의 통신 모듈(416, 436)을 이용하여 네트워크 를 통해 정보 및/또는 데이터를 통신할 수 있도록 구성될 수 있다. 또한, 입출력 장치는 입출력 인 터페이스를 통해 사용자 단말에 정보 및/또는 데이터를 입력하거나 사용자 단말로부터 생성된 정보 및/또는 데이터를 출력하도록 구성될 수 있다. 메모리(412, 432)는 비-일시적인 임의의 컴퓨터 판독 가능한 기록매체를 포함할 수 있다. 일 실시예에 따르면, 메모리(412, 432)는 RAM(random access memory), ROM(read only memory), 디스크 드라이브, SSD(solid state drive), 플래시 메모리(flash memory) 등과 같은 비소멸성 대용량 저장 장치(permanent mass storage device) 를 포함할 수 있다. 다른 예로서, ROM, SSD, 플래시 메모리, 디스크 드라이브 등과 같은 비소멸성 대용량 저장 장치는 메모리와는 구분되는 별도의 영구 저장 장치로서 사용자 단말 또는 정보 처리 시스템에 포함 될 수 있다. 또한, 메모리(412, 432)에는 운영체제와 적어도 하나의 프로그램 코드(예를 들어, 사용자 단말 에 설치되어 구동되는 지역 기반 서비스와 연관된 어플리케이션 등을 위한 코드)가 저장될 수 있다. 이러한 소프트웨어 구성요소들은 메모리(412, 432)와는 별도의 컴퓨터에서 판독 가능한 기록매체로부터 로딩될 수 있다. 이러한 별도의 컴퓨터에서 판독가능한 기록매체는 이러한 사용자 단말 및 정보 처리 시스템 에 직접 연결가능한 기록 매체를 포함할 수 있는데, 예를 들어, 플로피 드라이브, 디스크, 테이프, DVD/CD-ROM 드라이브, 메모리 카드 등의 컴퓨터에서 판독 가능한 기록매체를 포함할 수 있다. 다른 예로서, 소 프트웨어 구성요소들은 컴퓨터에서 판독 가능한 기록매체가 아닌 통신 모듈을 통해 메모리(412, 432)에 로딩될 수도 있다. 예를 들어, 적어도 하나의 프로그램은 개발자들 또는 어플리케이션의 설치 파일을 배포하는 파일 배포 시스템이 네트워크를 통해 제공하는 파일들에 의해 설치되는 컴퓨터 프로그램(예: 지역 기반 서비스 와 연관된 어플리케이션)에 기반하여 메모리(412, 432)에 로딩될 수 있다. 프로세서(414, 434)는 기본적인 산술, 로직 및 입출력 연산을 수행함으로써, 컴퓨터 프로그램의 명령을 처리하 도록 구성될 수 있다. 명령은 메모리(412, 432) 또는 통신 모듈(416, 436)에 의해 프로세서(414, 434)로 제공 될 수 있다. 예를 들어, 프로세서(414, 434)는 메모리(412, 432)와 같은 기록 장치에 저장된 프로그램 코드에 따라 수신되는 명령을 실행하도록 구성될 수 있다. 통신 모듈(416, 436)은 네트워크를 통해 사용자 단말과 정보 처리 시스템이 서로 통신하기 위한 구성 또는 기능을 제공할 수 있으며, 사용자 단말 및/또는 정보 처리 시스템이 다른 사용자 단말 또 는 다른 시스템(일례로 별도의 클라우드 시스템 등)과 통신하기 위한 구성 또는 기능을 제공할 수 있다. 일례 로, 사용자 단말의 프로세서가 메모리 등과 같은 기록 장치에 저장된 프로그램 코드에 따라 생 성한 요청(예를 들어, 지역 기반 서비스 제공 요청 정보)은 통신 모듈의 제어에 따라 네트워크를 통 해 정보 처리 시스템으로 전달될 수 있다. 역으로, 정보 처리 시스템의 프로세서의 제어에 따 라 제공되는 제어 신호나 명령이 통신 모듈과 네트워크를 거쳐 사용자 단말의 통신 모듈을 통해 사용자 단말에 수신될 수 있다. 예를 들어, 사용자 단말은 정보 처리 시스템으로부터 통 신 모듈을 통해 지역 기반 정보(예: 지역 기반 거래 정보 등)를 수신할 수 있다. 입출력 인터페이스는 입출력 장치와의 인터페이스를 위한 수단일 수 있다. 일 예로서, 입력 장치는 이미지 센서를 포함한 카메라, 키보드, 마이크로폰, 마우스 등의 장치를, 그리고 출력 장치는 디스플레이, 스피 커, 햅틱 피드백 디바이스(haptic feedback device) 등과 같은 장치를 포함할 수 있다. 다른 예로, 입출력 인터페이스는 터치스크린 등과 같이 입력과 출력을 수행하기 위한 구성 또는 기능이 하나로 통합된 장치와의 인터페이스를 위한 수단일 수 있다. 예를 들어, 사용자 단말의 프로세서가 메모리에 로딩된 컴 퓨터 프로그램의 명령을 처리함에 있어서 정보 처리 시스템이나 다른 사용자 단말이 제공하는 정보 및/또는 데이터를 이용하여 구성되는 서비스 화면이 입출력 인터페이스를 통해 디스플레이에 표시될 수 있 다. 도 4에서는 입출력 장치가 사용자 단말에 포함되지 않도록 도시되어 있으나, 이에 한정되지 않 으며, 사용자 단말과 하나의 장치로 구성될 수 있다. 또한, 정보 처리 시스템의 입출력 인터페이스 는 정보 처리 시스템과 연결되거나 정보 처리 시스템이 포함할 수 있는 입력 또는 출력을 위한 장치(미도시)와의 인터페이스를 위한 수단일 수 있다. 도 4에서는 입출력 인터페이스(418, 438)가 프로세서 (414, 434)와 별도로 구성된 요소로서 도시되었으나, 이에 한정되지 않으며, 입출력 인터페이스(418, 438)가 프 로세서(414, 434)에 포함되도록 구성될 수 있다. 사용자 단말 및 정보 처리 시스템은 도 4의 구성요소들보다 더 많은 구성요소들을 포함할 수 있다. 그러나, 대부분의 종래기술적 구성요소들을 명확하게 도시할 필요성은 없다. 일 실시예에 따르면, 사용자 단말 은 상술된 입출력 장치 중 적어도 일부를 포함하도록 구현될 수 있다. 또한, 사용자 단말은 트 랜시버(transceiver), GPS(Global Positioning system) 모듈, 카메라, 각종 센서, 데이터베이스 등과 같은 다 른 구성요소들을 더 포함할 수 있다. 예를 들어, 사용자 단말이 스마트폰인 경우, 일반적으로 스마트폰이 포함하고 있는 구성요소를 포함할 수 있으며, 예를 들어, 가속도 센서, 자이로 센서, 카메라 모듈, 각종 물리적 인 버튼, 터치패널을 이용한 버튼, 입출력 포트, 진동을 위한 진동기 등의 다양한 구성요소들이 사용자 단말 에 더 포함되도록 구현될 수 있다. 일 실시예에 따르면, 사용자 단말의 프로세서는 지역 기반 서비스 어플리케이션(예: 지역 기반 서비 스 전용 어플리케이션 또는 지역 기반 서비스를 제공할 수 있는 웹 브라우저 어플리케이션)을 동작하도록 구성 될 수 있다. 이 때, 해당 어플리케이션과 연관된 프로그램 코드가 사용자 단말의 메모리에 로딩될 수 있다. 어플리케이션이 동작되는 동안에, 사용자 단말의 프로세서는 입출력 장치로부터 제공 된 정보 및/또는 데이터를 입출력 인터페이스를 통해 수신하거나 통신 모듈을 통해 정보 처리 시스템 으로부터 정보 및/또는 데이터를 수신할 수 있으며, 수신된 정보 및/또는 데이터를 처리하여 메모리 에 저장할 수 있다. 또한, 이러한 정보 및/또는 데이터는 통신 모듈을 통해 정보 처리 시스템에 제 공할 수 있다. 지역 기반 서비스를 제공하는 어플리케이션이 동작되는 동안에, 프로세서는 입출력 인터페이스와 연 결된 터치 스크린, 키보드, 오디오 센서 및/또는 이미지 센서를 포함한 카메라, 마이크로폰 등의 입력 장치를 통해 입력되거나 선택된 음성 데이터, 텍스트, 이미지, 영상 등을 수신할 수 있으며, 수신된 음성 데이터, 텍스 트, 이미지 및/또는 영상 등을 메모리에 저장하거나 통신 모듈 및 네트워크를 통해 정보 처리 시스템에 제공할 수 있다. 사용자 단말의 프로세서는 정보 및/또는 데이터를 입출력 인터페이 스를 통해 입출력 장치로 전송하여, 출력할 수 있다. 예를 들어, 사용자 단말의 프로세서(41 4)는 디스플레이 출력 가능 장치(예: 터치 스크린, 디스플레이 등), 음성 출력 가능 장치(예: 스피커) 등의 입 출력 장치를 통해 처리된 정보 및/또는 데이터를 출력할 수 있다. 사용자 단말의 프로세서는 입출력 장치, 다른 사용자 단말, 정보 처리 시스템 및/또는 복 수의 외부 시스템으로부터 수신된 정보 및/또는 데이터를 관리, 처리 및/또는 저장하도록 구성될 수 있다. 프 로세서에 의해 처리된 정보 및/또는 데이터는 통신 모듈 및 네트워크를 통해 정보 처리 시스템 에 제공될 수 있다. 사용자 단말의 프로세서는 입출력 인터페이스를 통해 입출력 장치 로 정보 및/또는 데이터를 전송하여 출력할 수 있다. 예를 들면, 프로세서는 수신한 정보 및/또는 데이터를 사용자 단말의 화면에 디스플레이할 수 있다. 정보 처리 시스템의 프로세서는 복수의 사용자 단말 및/또는 복수의 외부 시스템으로부터 수신 된 정보 및/또는 데이터를 관리, 처리 및/또는 저장하도록 구성될 수 있다. 프로세서에 의해 처리된 정보 및/또는 데이터는 통신 모듈 및 네트워크를 통해 사용자 단말에 제공할 수 있다. 도 5는 본 개시의 일 실시예에 따른 프로세서의 상세 구성을 나타내는 블록도이다. 도시된 바와 같이, 프로세 서는 사용자 단말 위치 수신부, 구역 노드 생성부 및 지역 기반 서비스 제공부를 포함할 수 있다. 도 5에서는 프로세서에서 동작되는 사용자 단말 위치 수신부, 구역 노드 생성부 및 지역 기반 서비스 제공부를 별도의 유닛으로 도시하였으나, 이에 한정되지 않으며, 사용자 단말 위치 수신 부, 구역 노드 생성부 및 지역 기반 서비스 제공부의 둘 이상의 임의의 조합이 하나의 유닛으로동작될 수 있다. 추가적으로 또는 이와 달리, 사용자 단말 위치 수신부, 구역 노드 생성부 및 지역 기반 서비스 제공부는 두 개 이상의 서브 유닛으로 구현될 수 있다. 사용자 단말 위치 수신부는 통신 모듈(예: 통신 모듈)을 통해 지역 기반 서비스를 제공하는 어플리케 이션을 통해 해당 어플리케이션의 사용자 계정과 연관된 사용자 단말의 위치를 수신할 수 있다. 일 실시예에 따르면, 사용자 계정이 해당 어플리케이션에 가입하여 지역 기반 서비스의 최초 요청을 수행하는 동안에, 사용 자 단말 위치 수신부는 사용자 계정과 연관된 사용자 단말의 실시간 위치 정보를 수신하거나, 사용자 단말 의 위치 정보를 파악할 수 있는 위치 추적 수단으로부터 사용자 단말의 실시간 위치 정보를 수신할 수 있다. 추가적으로 또는 이와 달리, 해당 어플리케이션이 사용자 계정과 연관된 사용자 단말의 위치를 요청하는 것에 응답하여, 사용자 계정과 연관된 사용자 단말은 자신의 위치를 사용자 단말 위치 수신부)에 전송할 수 있 다. 이렇게 전송받은 사용자 단말의 위치 정보를 구역 노드 생성부 및/또는 지역 기반 서비스 제공부 로 제공할 수 있다. 구역 노드 생성부는 사용자 단말 위치 수신부로부터 사용자 단말의 위치를 수신하여, 복수의 참조 노 드를 이용하여 구역 노드를 생성할 수 있다. 여기서, 참조 노드는 주어진 영역을 미리 설정된 크기의 다각형 (예: 육각형 등)의 형태로 분할한 영역을 지칭할 수 있으며, 복수의 참조 노드로 이루어진 영역인 구역 노드는 사용자에게 다양한 지역 기반 서비스를 제공할 수 있는 제공 범위의 영역을 지칭할 수 있다. 구역 노드 생성부는 복수의 사용자 단말의 위치를 기초로 주어진 일정 영역을 미리 결정된 형태를 가지는 복수의 참조 노드로 분할할 수 있다. 예를 들어, 구역 노드 생성부는 미리 설정된 크기의 육각형 그리드 의 형태로 영역을 분할하고, 분할된 복수의 참조 노드 각각에 포함된, 지역 기반 서비스를 제공하는 어플리케이 션에 가입된 복수의 사용자 계정이 이용하는 복수의 사용자 단말의 수를 산출할 수 있다. 그리고 나서, 구역 노드 생성부는 산출된 복수의 사용자 단말의 수 및 복수의 참조 노드를 기초로 구역 노드를 생성할 수 있 다. 일 실시예에서, 복수의 참조 노드 중 하나의 참조 노드 내에 존재하는 복수의 사용자 단말의 수가 미리 결정된 사용자 단말의 수보다 작은 경우, 해당 참조 노드는 인접하고 있는 참조 노드와 그루핑될 수 있다. 예를 들어, 참조 노드는 인접한 참조 노드 내의 복수의 사용자 단말의 분포를 기초로 그루핑되어 구역 노드로 결정될 수 있 다. 이렇게 그루핑된 참조 노드는 복수의 구역 노드 중 일부로서 결정될 수 있다. 다른 실시예에서, 복수의 참조 노드 중 하나의 참조 노드 내에 존재하는 복수의 사용자 단말의 수가 미리 결정된 사용자 단말의 수보다 크거나 동일한 경우, 해당 참조 노드를 복수의 세부 참조 노드로 분할하여 구역 노드로 결정할 수 있다. 이렇 게 분할된 복수의 세부 참조 노드는 복수의 구역 노드 중 일부로서 결정될 수 있다. 구역 노드 생성부는 참조 노드 레벨을 조정하여 참조 노드의 크기를 변경시킬 수 있다. 일 실시예에서, 구역 노드 생성부는 복수의 참조 노드 내에 산출된 복수의 사용자 단말의 수에 따라 참조 노드의 레벨을 조정하고 변경된 크기를 가진 참조 노드를 이용하여 구역 노드를 생성할 수 있다. 예를 들어, 복수의 참조 노 드 중 하나의 참조 노드 내에 존재하는 복수의 사용자 단말의 수가 미리 결정된 사용자 단말의 수보다 작은 경 우, 해당 참조 노드의 레벨을 증가시켜 참조 노드의 크기를 증가시킬 수 있다. 다른 예에서, 복수의 참조 노드 중 하나의 참조 노드 내에 존재하는 복수의 사용자 단말의 수가 미리 결정된 사용자 단말의 수보다 크거나 같은 경우, 해당 참조 노드의 레벨을 감소시켜 참조 노드의 크기를 감소시킬 수 있다. 구역 노드 생성부는 통신 모듈(예: 통신 모듈)을 통해 분할된 복수의 참조 노드의 각각 내에서의 복 수의 사용자 단말과 연관된 사용자 계정 정보를 수신하고, 복수의 참조 노드 내에서의 복수의 사용자 단말의 지 역 기반 서비스에 대한 적합성 판정에 따라 참조 노드를 조정할 수 있다. 여기서, 적합성 판정은, 복수의 사용 자 단말과 연관된 사용자 계정이, 지역 기반 서비스를 제공받고자 하는 사용자 단말에게 적합한 서비스를 제공 할 수 있는지 여부를 판정하는 것을 지칭할 수 있다. 구역 노드 생성부는 참조 노드 내의 지역 기반 서비 스와 연관된 데이터를 기초로 참조 노드에 포함된 복수의 사용자 단말의 지역 기반 서비스에 대한 적합성을 판 정할 수 있다. 일 실시예에 따르면, 구역 노드 생성부는 참조 노드 내의 지역 기반 거래 서비스와 연관된 통계 데이터를 기초로 참조 노드 내의 복수의 사용자 단말의 지역 기반 거래 서비스에 대한 적합성을 판정할 수 있다. 예를 들어, 구역 노드 생성부는 참조 노드 내의 중고 거래 거래량, 중고 물품 거래 등록 수 및/또 는 중고 거래 빈도수 등을 기초로 구역 노드 내의 복수의 사용자 단말의 적합성을 판정할 수 있다. 추가적으로 또는 이와 달리, 구역 노드 생성부는 참조 노드 내에서 중고 거래가 수행하거나 중고 거래 물품을 등록한 사용자 단말들의 수만을 반영하도록 참조 노드를 조정함으로써 구역 노드를 생성할 수 있다. 구역 노드 생성부는 통신 모듈(예: 통신 모듈)을 통해 분할된 복수의 참조 노드의 각각 내에서의 교 통량 정보를 수신하고, 복수의 참조 노드 내에서의 교통량(traffic) 정보에 기초하여 참조 노드를 조정할 수 있 다. 여기서, 교통량 정보는, 참조 노드 내에서 지역 기반 서비스에 집중되는 데이터의 양을 지칭할 수 있다. 일 실시예에서, 구역 노드 생성부는 교통량 정보 및 참조 노드 내에서 산출된 복수의 사용자 단말의 수를 반영하도록 복수의 참조 노드를 조정할 수 있다. 예를 들어, 구역 노드 생성부는 구역 노드 내에 교통량 이 많다고 판단되는 경우, 복수의 참조 노드를 기초로 구역 노드를 분할할 수 있다. 다른 예로서, 구역 노드 생성부는 구역 노드 내에 교통량이 적다고 판단되는 경우, 복수의 참조 노드를 이용하여 구역 노드를 더 확장할 수 있다. 구역 노드 생성부는 분할된 복수의 참조 노드에서의 사용자 단말 분포, 사용자 계정 정보 또는 교통량 정 보 중 적어도 하나를 수신하고, 이렇게 수신된 정보를 기계학습 모델에 입력하여 복수의 참조 노드를 이용하여 생성된 복수의 구역 노드를 생성할 수 있다. 여기서, 사용자 단말의 분포는 복수의 참조 노드의 각각 내에서의 사용자 단말의 수, 사용자 단말의 집중도 등을 포함할 수 있다. 또한, 사용자 계정 정보는, 복수의 사용자 단 말의 각각과 연관된 나이, 지역 서비스 이용량(예: 게시판 글 등록수, 채팅방 내에서의 데이터량, 중고 거래량/ 빈도수, 중고 거래 물품 등록 수 등) 등을 포함할 수 있다. 상술된 바와 같이, 복수의 참조 노드를 이용하여 생성된 복수의 구역 노드는 지역 기반 서비스 제공부에 제공할 수 있다. 지역 기반 서비스 제공부는 구역 노드 생성부로부터 복수의 구역 노드를 수신하고, 사용자 단말의 위 치를 수신하여 해당 사용자 단말에 지역 기반 서비스를 제공할 수 있다. 일 실시예에 따르면, 지역 기반 서비 스 제공부는 사용자 단말의 위치가 복수의 구역 노드 중 어느 구역 노드에 속하는지 결정할 수 있다. 지 역 기반 서비스 제공부는 이렇게 결정된 구역 노드를 사용자 단말에 제공할 수 있으며, 사용자 단말이 결 정된 구역 노드 내에서 지역 기반 서비스를 제공하도록 허용할 수 있다. 즉, 해당 사용자 단말이 결정된 구역 노드 내의 다른 사용자 단말과의 지역 기반 서비스를 이용할 수 있다. 도 6은 본 개시의 일 실시예에 따른 지역 기반 서비스를 제공하는 방법의 예시를 나타내는 흐름도이다. 일 실시예에 따르면, 지역 기반 서비스를 제공하는 방법은 프로세서(예를 들어, 정보 처리 시스템의 프로 세서 및/또는 사용자 단말의 프로세서)에 의해 수행될 수 있다. 도시된 바와 같이, 지역 기반 서비 스를 제공하는 방법은 지역 기반 서비스를 제공하는 어플리케이션에 가입된 복수의 사용자 계정과 연관된 복수의 사용자 단말의 위치를 수신함으로써(S610), 개시될 수 있다. 예를 들어, 사용자 단말의 지역 기반 서비 스 요청에 응답하여, 지역 기반 서비스를 제공하는 어플리케이션에서 사용자 단말의 위치가 수신될 수 있다. 그리고 나서, 프로세서는 복수의 사용자 단말의 위치를 기초로 복수의 구역 노드를 생성할 수 있다(S620). 여 기서, 구역 노드는 주어진 영역을 미리 설정된 크기의 육각형의 형태로 분할한 영역인 참조 노드로 이루어질 수 있으며, 생성된 구역 노드 범위 내에서 사용자 단말에게 지역 기반 서비스를 제공할 수 있다. 여기서, 육각형 의 형태의 참조 노드를 기초로 생성된 구역 노드가 이용되는 경우, 구역 노드의 중첩을 최소화하거나 제거될 수 있을 뿐만 아니라, 구역 노드에서 사용자 단말이 이동할 수 있는 물리적 거리가 최소화될 수 있다. 그리고 나 서, 프로세서는 복수의 사용자 단말의 각각의 위치에 속하는 구역 노드 내에서 지역 기반 서비스를 사용자 단말 각각에 제공할 수 있다(S630). 도 7은 본 개시의 일 실시예에 따른 구역 노드를 결정하는 방법의 예시를 나타내는 흐름도이다. 일 실시 예에서, 구역 노드를 결정하는 방법은 프로세서(예를 들어, 정보 처리 시스템의 프로세서 및/또는 사 용자 단말의 프로세서)에 의해 수행될 수 있다. 도시된 바와 같이, 구역 노드를 결정하는 방법은 프 로세서가 주어진 영역을 미리 설정된 크기의 미리 결정된 형태를 가지는 복수의 참조 노드로 분할함으로써 (S710), 개시될 수 있다. 일 실시예에 따르면, 프로세서는 복수의 사용자 단말의 위치를 기준으로 일정 영역을 미리 설정된 크기의 육각형 그리드의 형태로 분할할 수 있다. 그 후, 프로세서는 분할된 복수의 참조 노드 각각에서 복수의 사용자 단말의 수를 산출하고(S720), 산출된 복수 의 사용자 단말의 수를 미리 결정된 사용자 단말의 수와 비교할 수 있다(S730). 일 실시예에서, 프로세서는, 복수의 참조 노드 중 하나의 참조 노드 내에 포함되어 있는 복수의 사용자 단말의 수를 미리 결정된 사용자 단 말의 수와 비교하여 참조 노드의 분할 또는 그루핑 여부를 결정할 수 있다. 여기서, 복수의 사용자 단말의 각 각은 지역 기반 서비스를 제공하는 어플리케이션에 가입된 복수의 사용자 계정과 연관된 사용자 단말을 지칭할 수 있다. 예를 들어, 복수의 사용자 단말의 각각은 해당 어플리케이션의 복수의 사용자 계정이 이용되고 있는 사용자 단말을 포함할 수 있다. 프로세서는, 하나의 참조 노드 내에서 산출된 복수의 사용자 단말의 수가 미리 결정된 사용자 단말의 수보다 크 거나 동일할 경우, 하나의 참조 노드를 복수의 세부 참조 노드로 분할하고(S740), 분할된 복수의 세부 참조 노 드를 구역 노드 중 일부로 결정할 수 있다(S750). 일 실시예에서, 프로세서는, 하나의 참조 노드에서의 사용자 단말 분포, 사용자 계정 정보 또는 교통량 정보 중 적어도 하나의 정보에 기초하여 하나의 참조 노드를 복수의 세부 참조 노드로 분할할 수 있다. 예를 들어, 하나의 참조 노드에서의 사용자 단말 분포, 사용자 계정 정보, 사용자 단말의 지역 기반 서비스에 대한 적합성 또는 교통량 정보 중 적어도 하나의 정보가 미리 설정된 임계치 이상인 경우 참조 노드는 세부 참조 노드로 분할될 수 있다. 프로세서는, 하나의 참조 노드 내에서 산출된 복수의 사용자 단말의 수가 미리 결정된 사용자 단말의 수보다 작 을 경우, 하나의 참조 노드 및 하나의 참조 노드에 인접한 참조 노드 내에서의, 복수의 사용자 단말의 분포를 기초로 하나의 참조 노드 및 인접한 참조 노드의 적어도 일부를 그루핑하고(S760), 그루핑된 참조 노드를 구역 노드 중 일부로 결정할 수 있다(S770). 일 실시예에서, 프로세서는, 하나의 참조 노드에서의 사용자 단말의 적 합성 여부, 사용자 단말의 분포, 사용자 계정 정보 또는 교통량 정보 중 적어도 하나의 정보에 기초하여 하나의 참조 노드 및 하나의 참조 노드에 인접한 참조 노드를 그루핑할 수 있다. 예를 들어, 하나의 참조 노드에서의 사용자 단말의 적합성 여부, 사용자 단말 분포, 사용자 계정 정보, 사용자 단말의 지역 기반 서비스에 대한 적 합성 또는 교통량 정보 중 적어도 하나의 정보가 미리 설정된 임계치 이하인 경우 참조 노드는 인접한 참조 노 드와 그루핑될 수 있다. 도 8은 본 개시의 다른 실시예에 따른 구역 노드를 결정하는 방법의 예시를 나타내는 흐름도이다. 일 실 시예에서, 구역 노드를 결정하는 방법은 프로세서(예를 들어, 정보 처리 시스템의 프로세서 및/또는 사용자 단말의 프로세서)에 의해 수행될 수 있다. 도시된 바와 같이, 구역 노드를 결정하는 방법은 프로세서가 복수의 참조 노드 내에서 산출된 복수의 사용자 단말의 수에 따라 복수의 참조 노드의 레벨을 조정 하여 복수의 참조 노드의 크기를 변경시킴으로써(S810), 개시될 수 있다. 일 실시예에서, 프로세서는 복수의 참조 노드 중 하나의 참조 노드 내에 존재하는 복수의 사용자 단말의 수를 미리 결정된 사용자 단말의 수와 비 교하여 참조 노드의 크기를 증가시키거나 감소시킬 수 있다. 추가적으로 또는 이와 달리, 프로세서는 복수의 참조 노드의 각각에서의 사용자 단말의 적합성 여부, 사용자 단말 분포, 사용자 계정 정보, 사용자 단말의 지역 기반 서비스에 대한 적합성 또는 교통량 정보 중 적어도 하나를 기초로 복수의 참조 노드의 크기를 조정 또는 변경할 수 있다. 그리고 나서, 프로세서는, 참조 노드 레벨에 따라 변경된 크기를 가지는 복수의 참조 노드를 이용하여 구역 노 드를 생성할 수 있다(S820). 일 실시예에서, 사용자 단말은 이렇게 생성된 구역 노드 내에서 지역 기반 서비스 를 제공받을 수 있다. 도 9는 본 개시의 또 다른 실시예에 따른 구역 노드를 결정하는 방법의 예시를 나타내는 흐름도이다. 일 실시예에 따르면, 지역 기반 서비스를 제공하는 방법은 프로세서(예를 들어, 정보 처리 시스템의 프로세서 및/또는 사용자 단말의 프로세서)에 의해 수행될 수 있다. 도시된 바와 같이, 지역 기반 서비스를 제공하는 방법은 주어진 영역을 미리 설정된 크기의 미리 결정된 형태를 가지는 복수의 참조 노드로 분할 함으로써(S910), 개시될 수 있다. 일 실시예에 따르면, 프로세서는 복수의 사용자 단말의 위치를 기준으로 일 정 영역을 미리 설정된 크기의 육각형 그리드의 형태로 분할할 수 있다. 그 후, 프로세서는 분할된 복수의 참조 노드에서의 사용자 단말 분포, 사용자 계정 정보 또는 교통량 정보 중 적어도 하나의 정보를 수신하고(S920), 수신된 적어도 하나의 정보를 기계학습 모델에 입력하여 구역 노드를 생 성할 수 있다(S930). 일 실시예에서, 기계학습 모델은 복수의 사용자 단말의 위치에 기초한 사용자 단말 분포, 복수의 사용자 단말의 지역 기반 서비스에 대한 적합성을 판정하기 위한 사용자 계정 정보, 참조 노드를 범위로 하여 지역 기반 서비스에 집중되는 데이터의 양인 교통량 정보 중 적어도 하나를 입력 받아, 구역 노드에 대한 정보를 출력하도록 구성될 수 있다. 도 10은 본 개시의 일 실시예에 따른 인공신경망 모델을 나타내는 예시도이다. 인공신경망 모델은, 기계학습 모델의 일 예로서, 기계학습(Machine Learning) 기술과 인지과학에서, 생물학적 신경망 의 구조에 기초하여 구현된 통계학적 학습 알고리즘 또는 그 알고리즘을 실행하는 구조이다. 일 실시예에 따르면, 인공신경망 모델은, 생물학적 신경망에서와 같이 시냅스의 결합으로 네트워크를 형 성한 인공 뉴런인 노드(Node)들이 시냅스의 가중치를 반복적으로 조정하여, 특정 입력에 대응한 올바른 출력과 추론된 출력 사이의 오차가 감소되도록 학습함으로써, 문제 해결 능력을 가지는 기계학습 모델을 나타낼 수 있 다. 예를 들어, 인공신경망 모델은 기계 학습, 딥러닝 등의 인공지능 학습법에 사용되는 임의의 확률 모델, 뉴럴 네트워크 모델 등을 포함할 수 있다. 일 실시예에 따르면, 구역 노드 생성부가 기계학습 모델의 한 형태로, 인공신경망 모델의 형태로 생 성될 수 있다. 예를 들어, 인공신경망 모델은 참조 노드에서의 사용자 단말 분포, 사용자 계정 정보 또 는 교통량 정보 중 적어도 하나의 정보를 수신하여 구역 노드를 출력하도록 구성될 수 있다. 인공신경망 모델 은 다층의 노드들과 이들 사이의 연결로 구성된 다층 퍼셉트론(MLP: multilayer perceptron)으로 구현된 다. 본 실시예에 따른 인공신경망 모델은 MLP를 포함하는 다양한 인공신경망 모델 구조들 중의 하나를 이용하여 구현될 수 있다. 도 10에 도시된 바와 같이, 인공신경망 모델은, 외부로부터 입력 신호 또는 데이터를 수신하는 입력층, 입력 데이터에 대응한 출력 신호 또는 데이터를 출력하는 출력층 , 입력층과 출력층 사이에 위치하며 입력층으로부터 신호를 받아 특성을 추출하여 출 력층으로 전달하는 n개(여기서, n은 양의 정수)의 은닉층(1030_1 내지 1030_n)으로 구성된다. 여기서, 출력층은 은닉층(1030_1 내지 1030_n)으로부터 신호를 받아 외부로 출력한다. 인공신경망 모델의 학습 방법에는, 교사 신호(정답)의 입력에 의해서 문제의 해결에 최적화되도록 학습하 는 지도 학습(Supervised Learning) 방법과, 교사 신호를 필요로 하지 않는 비지도 학습(Unsupervised Learning) 방법이 있다. 정보 처리 시스템은 참조 노드에서의 사용자 단말 분포, 사용자 계정 정보 또는 교통 량 정보 중 적어도 하나의 정보로부터 구역 노드를 생성하도록 학습된 인공신경망 모델을 지도 학습 및/ 또는 비지도 학습시킬 수 있다. 이렇게 학습된 인공신경망 모델은 정보 처리 시스템의 메모리에 저장될 수 있다. 일 실시예에 따르면, 인공신경망 모델의 입력변수는, 참조 노드에서의 사용자 단말 분포, 사용자 계정 정 보 또는 교통량 정보 중 적어도 하나의 정보가 될 수 있다. 즉, 상술된 참조 노드에서의 사용자 단말 분포, 사 용자 계정 정보 또는 교통량 정보 중 적어도 하나의 정보 등을 나타내거나 특징화하는 벡터가 입력층을 통해 입력될 수 있다. 이와 같이 상술된 입력변수가 입력층을 통해 입력되는 경우, 인공신경망 모델 의 출력층에서 출력되는 출력변수는 구역 노드를 나타내거나 특징화하는 벡터가 될 수 있다. 이와 같이, 인공신경망 모델의 입력층과 출력층에 복수의 입력변수와 대응되는 복수의 출력 변수가 각각 매칭되고, 입력층, 은닉층(1030_1 내지 1030_n) 및 출력층에 포함된 노드들 사이의 시 냅스 값이 조정됨으로써, 특정 입력에 대응한 올바른 출력이 추출될 수 있도록 학습될 수 있다. 이러한 학습 과정을 통해, 인공신경망 모델의 입력변수에 숨겨져 있는 특성을 파악할 수 있고, 입력변수에 기초하여 산출된 출력변수와 목표 출력 간의 오차가 줄어들도록 인공신경망 모델의 노드들 사이의 시냅스 값(또는 가중치)를 조정할 수 있다. 이렇게 학습된 인공신경망 모델을 이용하여, 구역 노드가 출력될 수 있다. 도 11은 본 개시의 일 실시예에 따른 지역 기반 서비스를 제공하기 위해 구역 노드를 생성하는 예시를 나타내는 도면이다. 일 실시예에 따르면, 프로세서는 지역 기반 서비스를 제공하는 어플리케이션의 사용자 계정과 연관 된 사용자 단말의 위치를 기초로 하나의 구역 노드를 구성하는 참조 노드 및 하나의 구역 노드를 구성하 는 복수의 참조 노드 내의 해당 사용자 단말의 수를 결정할 수 있다. 이렇게 결정된 사용자 단말의 수를 기초로 참조 노드가 조정될 수 있다. 구체적으로, 제1 동작은 사용자 단말의 위치를 기준으로 생성된 참조 노드 내에 위치하고 있는 복 수의 사용자 단말의 수가 미리 결정된 사용자 단말 수보다 크거나 동일한 경우의 예시를 나타낸다. 이 경우, 프로세서는 하나의 구역 노드를 구성하고 있는 참조 노드를 복수의 세부 참조 노드로 분할할 수 있다. 이렇게 분할된 세부 참조 노드를 기초로 구역 노드가 생성될 수 있다. 제2 동작은 사용자 단말의 위치를 기준으로 생성된 복수의 참조 노드 내에 위치하고 있는 복수의 사용자 단말의 수가 미리 결정된 사용자 단말 수보다 작은 경우의 예시를 나타낸다. 일 실시예에서, 구역 노드 를 구성하고 있는 복수의 참조 노드 내에 존재하는 복수의 사용자 단말의 수가 미리 결정된 사용자 단말의 수보 다 작은 경우, 해당 복수의 참조 노드가 인접하고 있는 하나 이상의 참조 노드와 그루핑될 수 있다. 예를 들어, 참조 노드는 인접한 참조 노드 내의 복수의 사용자 단말의 분포를 기초로 그루핑되어 구역 노드로 결정될 수 있다. 도 11에서는 설명의 편의상 몇 개의 사용자 단말의 수만을 표시하였으나, 하나의 참조 노드 내에 포함된 실제 사용자 단말의 수는 수 십 내지 수백만 개의 수가 포함될 수 있다. 도 12는 본 개시의 일 실시예에 따른 참조 노드 레벨에 따라 구역 노드를 결정하는 방법의 예시를 나타내는 도 면이다. 일 실시예에 따르면, 복수의 참조 노드는 참조 노드 레벨에 따라 조정될 수 있다. 구체적으로, 제1동작은 분할된 참조 노드 내의 복수의 사용자 단말의 수가 미리 결정된 사용자 단말의 수보다 크거나 동 일하여 참조 노드 레벨을 감소시키는 경우의 예시를 나타낸다. 예를 들어, 참조 노드 레벨을 감소시킴으로써 크기를 줄인 참조 노드를 이용하여 구역 노드를 생성할 수 있다. 제2 동작은 분할된 참조 노드 내 의 복수의 사용자 단말의 수가 미리 결정된 사용자 단말의 수보다 작아 참조 노드 레벨을 증가시키는 경우의 예 시를 나타낸다. 예를 들어, 참조 노드 레벨을 증가시킴으로써 크기를 늘린 참조 노드를 이용하여 구역 노드를 생성할 수 있다. 도 12에서는 설명의 편의상 몇 개의 사용자 단말의 수만을 표시하였으나, 하나의 참조 노드 내에 포함된 실제 사용자 단말의 수는 수 십 내지 수백만 개의 수가 포함될 수 있다. 상술한 방법은 컴퓨터에서 실행하기 위해 컴퓨터 판독 가능한 기록매체에 저장된 컴퓨터 프로그램으로 제공될 수 있다. 매체는 컴퓨터로 실행 가능한 프로그램을 계속 저장하거나, 실행 또는 다운로드를 위해 임시 저장하 는 것일수도 있다. 또한, 매체는 단일 또는 수개 하드웨어가 결합된 형태의 다양한 기록 수단 또는 저장수단일 수 있는데, 어떤 컴퓨터 시스템에 직접 접속되는 매체에 한정되지 않고, 네트워크 상에 분산 존재하는 것일 수 도 있다. 매체의 예시로는, 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체, CD-ROM 및 DVD 와 같은 광기록 매체, 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto optical medium), 및 ROM, RAM, 플래시 메모리 등을 포함하여 프로그램 명령어가 저장되도록 구성된 것이 있을 수 있다. 또한, 다른 매체 의 예시로, 어플리케이션을 유통하는 앱 스토어나 기타 다양한 소프트웨어를 공급 내지 유통하는 사이트, 서버 등에서 관리하는 기록매체 내지 저장매체도 들 수 있다. 본 개시의 방법, 동작 또는 기법들은 다양한 수단에 의해 구현될 수도 있다. 예를 들어, 이러한 기법들은 하드 웨어, 펌웨어, 소프트웨어, 또는 이들의 조합으로 구현될 수도 있다. 본원의 개시와 연계하여 설명된 다양한 예시적인 논리적 블록들, 모듈들, 회로들, 및 알고리즘 단계들은 전자 하드웨어, 컴퓨터 소프트웨어, 또는 양자 의 조합들로 구현될 수도 있음을 통상의 기술자들은 이해할 것이다. 하드웨어 및 소프트웨어의 이러한 상호 대 체를 명확하게 설명하기 위해, 다양한 예시적인 구성요소들, 블록들, 모듈들, 회로들, 및 단계들이 그들의 기능 적 관점에서 일반적으로 위에서 설명되었다. 그러한 기능이 하드웨어로서 구현되는지 또는 소프트웨어로서 구 현되는 지의 여부는, 특정 어플리케이션 및 전체 시스템에 부과되는 설계 요구사항들에 따라 달라진다. 통상의 기술자들은 각각의 특정 어플리케이션을 위해 다양한 방식들로 설명된 기능을 구현할 수도 있으나, 그러한 구현 들은 본 개시의 범위로부터 벗어나게 하는 것으로 해석되어서는 안된다. 하드웨어 구현에서, 기법들을 수행하는 데 이용되는 프로세싱 유닛들은, 하나 이상의 ASIC들, DSP들, 디지털 신 호 프로세싱 디바이스들(digital signal processing devices; DSPD들), 프로그램가능 논리 디바이스들 (programmable logic devices; PLD들), 필드 프로그램가능 게이트 어레이들(field programmable gate arrays; FPGA들), 프로세서들, 제어기들, 마이크로제어기들, 마이크로프로세서들, 전자 디바이스들, 본 개시에 설명된 기능들을 수행하도록 설계된 다른 전자 유닛들, 컴퓨터, 또는 이들의 조합 내에서 구현될 수도 있다. 따라서, 본 개시와 연계하여 설명된 다양한 예시적인 논리 블록들, 모듈들, 및 회로들은 범용 프로세서, DSP, ASIC, FPGA나 다른 프로그램 가능 논리 디바이스, 이산 게이트나 트랜지스터 로직, 이산 하드웨어 컴포넌트들, 또는 본원에 설명된 기능들을 수행하도록 설계된 것들의 임의의 조합으로 구현되거나 수행될 수도 있다. 범용 프로세서는 마이크로프로세서일 수도 있지만, 대안으로, 프로세서는 임의의 종래의 프로세서, 제어기, 마이크로 제어기, 또는 상태 머신일 수도 있다. 프로세서는 또한, 컴퓨팅 디바이스들의 조합, 예를 들면, DSP와 마이크 로프로세서, 복수의 마이크로프로세서들, DSP 코어와 연계한 하나 이상의 마이크로프로세서들, 또는 임의의 다 른 구성의 조합으로서 구현될 수도 있다. 펌웨어 및/또는 소프트웨어 구현에 있어서, 기법들은 랜덤 액세스 메모리(random access memory; RAM), 판독 전 용 메모리(read-only memory; ROM), 비휘발성 RAM(non-volatile random access memory; NVRAM), PROM(programmable read-only memory), EPROM(erasable programmable read-only memory), EEPROM(electrically erasable PROM), 플래시 메모리, 컴팩트 디스크(compact disc; CD), 자기 또는 광학 데이 터 스토리지 디바이스 등과 같은 컴퓨터 판독가능 매체 상에 저장된 명령들로서 구현될 수도 있다. 명령들은 하나 이상의 프로세서들에 의해 실행 가능할 수도 있고, 프로세서(들)로 하여금 본 개시에 설명된 기능의 특정 양태들을 수행하게 할 수도 있다. 소프트웨어로 구현되는 경우, 상술된 기법들은 하나 이상의 명령들 또는 코드로서 컴퓨터 판독 가능한 매체 상 에 저장되거나 또는 컴퓨터 판독 가능한 매체를 통해 전송될 수도 있다. 컴퓨터 판독가능 매체들은 한 장소에 서 다른 장소로 컴퓨터 프로그램의 전송을 용이하게 하는 임의의 매체를 포함하여 컴퓨터 저장 매체들 및 통신매체들 양자를 포함한다. 저장 매체들은 컴퓨터에 의해 액세스될 수 있는 임의의 이용 가능한 매체들일 수도 있다. 비제한적인 예로서, 이러한 컴퓨터 판독가능 매체는 RAM, ROM, EEPROM, CD-ROM 또는 다른 광학 디스크 스토리지, 자기 디스크 스토리지 또는 다른 자기 스토리지 디바이스들, 또는 소망의 프로그램 코드를 명령들 또 는 데이터 구조들의 형태로 이송 또는 저장하기 위해 사용될 수 있으며 컴퓨터에 의해 액세스될 수 있는 임의의 다른 매체를 포함할 수 있다. 또한, 임의의 접속이 컴퓨터 판독가능 매체로 적절히 칭해진다. 예를 들어, 소프트웨어가 동축 케이블, 광섬유 케이블, 연선, 디지털 가입자 회선 (DSL), 또는 적외선, 무선, 및 마이크로파와 같은 무선 기술들을 사용하여 웹사이트, 서버, 또는 다른 원격 소스로부터 전송되면, 동축 케 이블, 광섬유 케이블, 연선, 디지털 가입자 회선, 또는 적외선, 무선, 및 마이크로파와 같은 무선 기술들은 매 체의 정의 내에 포함된다. 본원에서 사용된 디스크(disk) 와 디스크(disc)는, CD, 레이저 디스크, 광 디스크, DVD(digital versatile disc), 플로피디스크, 및 블루레이 디스크를 포함하며, 여기서 디스크들(disks)은 보통 자기적으로 데이터를 재생하고, 반면 디스크들(discs) 은 레이저를 이용하여 광학적으로 데이터를 재생한다. 위의 조합들도 컴퓨터 판독가능 매체들의 범위 내에 포함되어야 한다. 소프트웨어 모듈은, RAM 메모리, 플래시 메모리, ROM 메모리, EPROM 메모리, EEPROM 메모리, 레지스터들, 하드 디스크, 이동식 디스크, CD-ROM, 또는 공지된 임의의 다른 형태의 저장 매체 내에 상주할 수도 있다. 예시적인 저장 매체는, 프로세가 저장 매체로부터 정보를 판독하거나 저장 매체에 정보를 기록할 수 있도록, 프로세서에 연결될 수 있다. 대안으로, 저장 매체는 프로세서에 통합될 수도 있다. 프로세서와 저장 매체는 ASIC 내에 존 재할 수도 있다. ASIC은 유저 단말 내에 존재할 수도 있다. 대안으로, 프로세서와 저장 매체는 유저 단말에서 개별 구성요소들로서 존재할 수도 있다. 이상 설명된 실시예들이 하나 이상의 독립형 컴퓨터 시스템에서 현재 개시된 주제의 양태들을 활용하는 것으로 기술되었으나, 본 개시는 이에 한정되지 않고, 네트워크나 분산 컴퓨팅 환경과 같은 임의의 컴퓨팅 환경과 연계 하여 구현될 수도 있다. 또 나아가, 본 개시에서 주제의 양상들은 복수의 프로세싱 칩들이나 장치들에서 구현 될 수도 있고, 스토리지는 복수의 장치들에 걸쳐 유사하게 영향을 받게 될 수도 있다. 이러한 장치들은 PC들, 네트워크 서버들, 및 휴대용 장치들을 포함할 수도 있다."}
{"patent_id": "10-2021-0182082", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "본 명세서에서는 본 개시가 일부 실시예들과 관련하여 설명되었지만, 본 개시의 발명이 속하는 기술분야의 통상 의 기술자가 이해할 수 있는 본 개시의 범위를 벗어나지 않는 범위에서 다양한 변형 및 변경이 이루어질 수 있 다. 또한, 그러한 변형 및 변경은 본 명세서에 첨부된 특허청구의 범위 내에 속하는 것으로 생각되어야 한다."}
{"patent_id": "10-2021-0182082", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 개시의 실시예들은, 이하 설명하는 첨부 도면들을 참조하여 설명될 것이며, 여기서 유사한 참조 번호는 유사 한 요소들을 나타내지만, 이에 한정되지는 않는다. 도 1은 본 개시의 일 실시예에 따라 사용자 단말에서 동작하는 어플리케이션을 통해 지역 기반 서비스가 제공되 는 예시를 나타내는 도면이다. 도 2는 본 개시의 일 실시예에 따라 지역 기반 서비스를 위한 지역 분리의 예시를 나타내는 도면이다. 도 3은 본 개시의 일 실시예에 따른 지역 기반 서비스를 제공하기 위하여, 정보 처리 시스템이 복수의 사용자 단말과 통신 가능하도록 연결될 구성을 나타내는 개요도이다. 도 4는 본 개시의 일 실시예에 따른 사용자 단말 및 정보 처리 시스템의 내부 구성을 나타내는 블록도이다. 도 5는 본 개시의 일 실시예에 따른 프로세서의 상세 구성을 나타내는 블록도이다. 도 6은 본 개시의 일 실시예에 따른 지역 기반 서비스를 제공하는 방법의 예시를 나타내는 흐름도이다. 도 7은 본 개시의 일 실시예에 따른 구역 노드를 결정하는 방법의 예시를 나타내는 흐름도이다. 도 8은 본 개시의 다른 실시예에 따른 구역 노드를 결정하는 방법의 예시를 나타내는 흐름도이다. 도 9는 본 개시의 또 다른 실시예에 따른 구역 노드를 결정하는 방법의 예시를 나타내는 흐름도이다. 도 10은 본 개시의 일 실시예에 따른 인공신경망 모델을 나타내는 예시도이다. 도 11은 본 개시의 일 실시예에 따른 지역 기반 서비스를 제공하기 위해 구역 노드를 생성하는 예시를 나타내는도면이다. 도 12는 본 개시의 일 실시예에 따른 참조 노드 레벨에 따라 구역 노드를 결정하는 방법의 예시를 나타내는 도 면이다."}
