{"patent_id": "10-2020-0025384", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0110009", "출원번호": "10-2020-0025384", "발명의 명칭": "ＩｏＴ 디바이스 충전용 무선전력 전송 장치", "출원인": "한국전력공사", "발명자": "조혜원"}}
{"patent_id": "10-2020-0025384", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "다수의 안테나들로 구성되어 수신기로 전력을 전송하기 위한 송신 배열 안테나;상기 수신기의 위치에 따라 상기 송신 배열 안테나의 각 안테나에 인가하는 전력신호의 위상을 가변적으로 조절하기 위한 위상 조절부;상기 수신기로부터 전력 전송을 요청받아 상기 수신기의 위치를 추정하기 위한 수신기 검출부; 및상기 수신기의 위치에 따라 프레넬 영역에서 포커싱 빔포밍을 형성하기 위해 상기 각 안테나에 인가하는 전력신호의 위상을 결정하여 상기 위상 조절부를 제어하기 위한 컨트롤러;를 포함하는 IoT 디바이스 충전용 무선전력 전송 장치."}
{"patent_id": "10-2020-0025384", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 위상 조절부로부터 전달받은 상기 각 안테나에 인가하는 전력신호를 증폭시키기 위한 전력 증폭부;상기 위상 조절부에 상기 각 안테나에 인가하는 전력신호로 분배하는 전력 분배 네트워크를 구성하기 위한 전력분배부;상기 전력 분배부에 제공하는 전력신호를 생성하기 위한 RF 신호 생성부;를 더 포함하는 IoT 디바이스 충전용 무선전력 전송 장치."}
{"patent_id": "10-2020-0025384", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 수신기는, IoT(Internet of Thing) 환경에 존재하는 센서 또는 전자기기를 포함하는 IoT 디바이스인 IoT디바이스 충전용 무선전력 전송 장치."}
{"patent_id": "10-2020-0025384", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 프레넬 영역의 경계는, 수학식 R0≥2D2/λ를 만족하는 것(여기서, R0는 프레넬 영역의 경계, D는 안테나 크기 차원, λ는 파장 길이)인 IoT 디바이스 충전용 무선전력 전송 장치."}
{"patent_id": "10-2020-0025384", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 송신 배열 안테나는,다수의 안테나들을 그룹핑하여 안테나 그룹을 형성하고,상기 위상 조절부는,상기 안테나 그룹 별로 연결하여 안테나 그룹별로 전력신호를 인가하는 것인 IoT 디바이스 충전용 무선전력 전공개특허 10-2021-0110009-3-송 장치."}
{"patent_id": "10-2020-0025384", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서,상기 송신 배열 안테나는, 도파관 슬롯 배열 안테나 타입인 IoT 디바이스 충전용 무선전력 전송 장치."}
{"patent_id": "10-2020-0025384", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서,상기 슬롯은, 지면에 평행한 방향으로 형성하되 지그재그형으로 배열하는 것인 IoT 디바이스 충전용 무선전력전송 장치."}
{"patent_id": "10-2020-0025384", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "다수의 안테나들로 구성되어 수신기로 전력을 전송하기 위한 송신 배열 안테나;미리 정해진 충전영역에 고정형 포커싱 빔포밍을 형성하는 위상 지연 회로를 구성하기 위해 상기 송신 배열 안테나의 각 안테나에 인가하는 전력신호의 위상을 고정하기 위한 위상 지연부;상기 수신기로부터 전력 전송을 요청받아 상기 수신기의 위치를 추정하기 위한 수신기 검출부; 및상기 충전영역 내에 상기 수신기가 위치함에 따라 상기 수신기의 위치에서 포커싱 빔포밍을 형성하기 위해 스위칭 제어를 통해 상기 위상 지연 회로의 경로를 변경하기 위한 컨트롤러;를 포함하는 IoT 디바이스 충전용 무선전력 전송 장치."}
{"patent_id": "10-2020-0025384", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서,상기 위상 지연부로부터 전달받은 상기 각 안테나에 인가하는 전력신호를 증폭시키기 위한 전력 증폭부;상기 위상 지연부에 상기 각 안테나에 인가하는 전력신호로 분배하는 전력 분배 네트워크를 구성하기 위한 전력분배부;상기 전력 분배부에 제공하는 전력신호를 생성하기 위한 RF 신호 생성부;를 더 포함하는 IoT 디바이스 충전용 무선전력 전송 장치."}
{"patent_id": "10-2020-0025384", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 8 항에 있어서,상기 수신기는, IoT(Internet of Thing) 환경에 존재하는 센서 또는 전자기기를 포함하는 IoT 디바이스인 IoT디바이스 충전용 무선전력 전송 장치."}
{"patent_id": "10-2020-0025384", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 8 항에 있어서,상기 송신 배열 안테나는,공개특허 10-2021-0110009-4-다수의 안테나들을 그룹핑하여 안테나 그룹을 형성하고,상기 위상 지연부는,상기 안테나 그룹 별로 연결하여 안테나 그룹별로 전력신호를 인가하는 것인 IoT 디바이스 충전용 무선전력 전송 장치."}
{"patent_id": "10-2020-0025384", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11 항에 있어서,상기 송신 배열 안테나는, 도파관 슬롯 배열 안테나 타입인 IoT 디바이스 충전용 무선전력 전송 장치."}
{"patent_id": "10-2020-0025384", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 12 항에 있어서,상기 슬롯은, 지면에 평행한 방향으로 형성하되 지그재그형으로 배열하는 것인 IoT 디바이스 충전용 무선전력전송 장치."}
{"patent_id": "10-2020-0025384", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "다수의 안테나들로 구성되어 수신기로 전력을 전송하되, 상기 수신기의 위치에서 포커싱 빔포밍을 형성하기 위해 각 안테나의 배치를 조정하여 고정형 포커싱 빔포밍을 형성하기 위한 송신 배열 안테나;상기 수신기로부터 전력 전송을 요청받아 상기 수신기의 위치를 추정하기 위한 수신기 검출부; 및상기 송신 배열 안테나에 의해 형성된 충전영역 내에 상기 수신기가 위치함에 따라 각 안테나에 전력신호 인가를 제어하기 위한 컨트롤러;를 포함하는 IoT 디바이스 충전용 무선전력 전송 장치."}
{"patent_id": "10-2020-0025384", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 14 항에 있어서,상기 각 안테나에 인가하는 전력신호를 증폭시키기 위한 전력 증폭부;상기 각 안테나에 인가하는 전력신호로 분배하는 전력 분배 네트워크를 구성하기 위한 전력 분배부;상기 전력 분배부에 제공하는 전력신호를 생성하기 위한 RF 신호 생성부;를 더 포함하되,상기 컨트롤러는, 상기 전력 분배부를 제어하여 상기 각 안테나에 전력신호를 인가시키는 것인 IoT 디바이스 충전용 무선전력 전송 장치."}
{"patent_id": "10-2020-0025384", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 15 항에 있어서,상기 각 안테나는, 구의 면적을 따라 배치하되, 수학식 (여기서, θsphere는 안테나의 구면 각도, R은 수신기까지의 거리, X는 단위 안테나의 폭, NX는 안테나의 가로 배열 개수)를 만족하는 것인 IoT 디바이스인 IoT 디바이스 충전용 무선전력 전공개특허 10-2021-0110009-5-송 장치."}
{"patent_id": "10-2020-0025384", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 IoT 디바이스 충전용 무선전력 전송 장치에 관한 것으로, 본 발명의 실시예에 따른 IoT 디바이스 충전 용 무선전력 전송 장치는, 다수의 안테나들로 구성되어 수신기로 전력을 전송하기 위한 송신 배열 안테나; 상기 수신기의 위치에 따라 상기 송신 배열 안테나의 각 안테나에 인가하는 전력신호의 위상을 가변적으로 조절하기 위한 위상 조절부; 상기 수신기로부터 전력 전송을 요청받아 상기 수신기의 위치를 추정하기 위한 수신기 검출부; 및 상기 수신기의 위치에 따라 프레넬 영역에서 포커싱 빔포밍을 통해 상기 수신기의 위치에서 동일한 위상의 안테나 빔을 형성하도록 상기 각 안테나에 인가하는 전력신호의 위상을 결정하여 상기 위상 조절부를 제 어하기 위한 컨트롤러;를 포함한다."}
{"patent_id": "10-2020-0025384", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 IoT 디바이스 충전용 무선전력 전송 장치에 관한 것으로서, 보다 상세하게는 무선전력 전송 대상의 위치를 추정해 미리 정해진 충전 영역 중 최적의 충전 영역을 선택하여 전력을 전송함으로써 전력 관리의 복잡 도를 낮추어 효율적으로 전력 전송을 가능하게 하기 위한, IoT 디바이스 충전용 무선전력 전송 장치에 관한 것 이다."}
{"patent_id": "10-2020-0025384", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근에는 5세대 이동통신, 자율주행, 인공지능, 사물인터넷(Internet of Things, IoT) 등의 기술을 구현하기 위 한 다양한 센서나 전자기기 등에서 전력관리에 대한 중요성이 커지고 있다. 특히, 무선통신을 이용하는 센서나 전자기기들은 자체 전력원을 사용할 경우에 발열이나 비용 등에 대해 고려할 문제들이 있기 때문에, 무선전력전송을 통해 이들에 대한 전력관리의 효율성을 증대시킬 필요가 있다. 무선전력전송 기술은 공기를 매질로 하여 자기장이나 전자기파 형태로 전력을 전송하는 기술로서, 비방사 방식 과 방사 방식으로 구분할 수 있다. 먼저, 비방사 방식은 수 ㎝ 이내에서 접촉식으로 자기장을 이용하여 전력을 전달하는 방식으로서, 자기 유도 방 식 및 자기 공진 방식이 있다. 이러한 비방사 방식은 수신기의 움직임 및 각도의 자유도가 낮은 단점이 있다. 다음으로, 방사 방식은 안테나를 통해 전자기파를 방사하여 장거리까지 전력을 전달하는 방식으로서, 마이크로 파 전송 방식이 있다. 이러한 방사 방식은 다수의 안테나를 이용하여 효율을 증가시키고 빔포밍 기술을 통해 다 수의 기기에 충전할 수 있다. 방사 방식은 안테나의 크기와 배열을 늘려서 전력 전송 효율을 향상시킬 수 있다. 이를 위해, 무선 전력 전송기는 RF 신호 발생기(RF Signal Source Generator), 이를 증폭하는 증폭기 (Amplifier), 이를 안테나에 분배하는 전력 분배 네트워크(Power Distribution Network)를 필수적으로 포함한 다. 이러한 무선 전력 전송기는 인가되는 신호의 위상을 조절하는 위상 조절기(Phase Shifter)를 더 포함할 수 있다. 그런데, 기존에는 원거리에서 안테나 빔 형성의 경우, 수신기와 송신기 중심 간의 각도 차이를 극복하는 것으로 서, 안테나 빔은 수신기의 위치에서 동일 위상이 되지 못하고 제대로 전력 전달이 되지 않는 한계가 있다. 그리고, 수 m의 거리에서 안테나 빔을 형성할 때 안테나 개수는 수백~수천개 이상이 필요하며 그에 따라 필요한 능동 회로, 소자가 기하급수적으로 증가할 수 있다. 이와 같이 수백~수천개의 RF 능동 소자를 갖는 경우에는 가격이 매우 비싸고 소비전력량과 복잡도가 매우 크고, 시간에 따라 열이 발생하여 소자의 열화 가능성이 존재한다. 이는 신호의 세기가 줄어들거나 위상 값이 변하여 전력 전송의 오류가 증가할 수 있음을 나타낸다. 따라서, 기존의 무선전력전송 기술은 원거리에서 비효율적인 시스템을 극복하고 복잡도를 낮춰 전력을 전송할 수 있는 방안을 마련할 필요가 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 등록특허공보 제10-1398367호 (2014.05.15 등록)"}
{"patent_id": "10-2020-0025384", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "발명의 내용"}
{"patent_id": "10-2020-0025384", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 무선전력 전송 대상의 위치를 추정해 미리 정해진 충전 영역 중 최적의 충전 영역을 선택하여 전력을 전송함으로써 전력 관리의 복잡도를 낮추어 효율적으로 전력 전송을 가능하게 하기 위한, IoT 디바이스 충전용 무선전력 전송 장치를 제공하는데 있다."}
{"patent_id": "10-2020-0025384", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일실시예에 따른 IoT 디바이스 충전용 무선전력 전송 장치는, 다수의 안테나들로 구성되어 수신기로 전력을 전송하기 위한 송신 배열 안테나; 상기 수신기의 위치에 따라 상기 송신 배열 안테나의 각 안테나에 인 가하는 전력신호의 위상을 가변적으로 조절하기 위한 위상 조절부; 상기 수신기로부터 전력 전송을 요청받아 상 기 수신기의 위치를 추정하기 위한 수신기 검출부; 및 상기 수신기의 위치에 따라 프레넬 영역에서 포커싱 빔포 밍을 형성하기 위해 상기 각 안테나에 인가하는 전력신호의 위상을 결정하여 상기 위상 조절부를 제어하기 위한 컨트롤러;를 포함할 수 있다. 실시예에 따르면, 상기 위상 조절부로부터 전달받은 상기 각 안테나에 인가하는 전력신호를 증폭시키기 위한 전 력 증폭부; 상기 위상 조절부에 상기 각 안테나에 인가하는 전력신호로 분배하는 전력 분배 네트워크를 구성하 기 위한 전력 분배부; 상기 전력 분배부에 제공하는 전력신호를 생성하기 위한 RF 신호 생성부;를 더 포함할 수 있다. 상기 수신기는, IoT(Internet of Thing) 환경에 존재하는 센서 또는 전자기기를 포함하는 IoT 디바이스일 수 있 다. 상기 프레넬 영역의 경계는, 수학식 R0≥2D2/λ를 만족하는 것(여기서, R0는 프레넬 영역의 경계, D는 안테나 크 기 차원, λ는 파장 길이)일 수 있다. 상기 송신 배열 안테나는, 다수의 안테나들을 그룹핑하여 안테나 그룹을 형성하고, 상기 위상 조절부는, 상기 안테나 그룹 별로 연결하여 안테나 그룹별로 전력신호를 인가하는 것일 수 있다. 상기 송신 배열 안테나는, 도파관 슬롯 배열 안테나 타입일 수 있다. 상기 슬롯은, 지면에 평행한 방향으로 형성하되 지그재그형으로 배열하는 것일 수 있다. 또한, 본 발명의 다른 실시예에 따른 IoT 디바이스 충전용 무선전력 전송 장치는, 다수의 안테나들로 구성되어 수신기로 전력을 전송하기 위한 송신 배열 안테나; 미리 정해진 충전영역에 고정형 포커싱 빔포밍을 형성하는 위상 지연 회로를 구성하기 위해 상기 송신 배열 안테나의 각 안테나에 인가하는 전력신호의 위상을 고정하기 위한 위상 지연부; 상기 수신기로부터 전력 전송을 요청받아 상기 수신기의 위치를 추정하기 위한 수신기 검출 부; 및 상기 충전영역 내에 상기 수신기가 위치함에 따라 상기 수신기의 위치에서 포커싱 빔포밍을 형성하기 위 해 스위칭 제어를 통해 상기 위상 지연 회로의 경로를 변경하기 위한 컨트롤러;를 포함할 수 있다. 실시예에 따르면, 상기 위상 지연부로부터 전달받은 상기 각 안테나에 인가하는 전력신호를 증폭시키기 위한 전 력 증폭부; 상기 위상 지연부에 상기 각 안테나에 인가하는 전력신호로 분배하는 전력 분배 네트워크를 구성하 기 위한 전력 분배부; 상기 전력 분배부에 제공하는 전력신호를 생성하기 위한 RF 신호 생성부;를 더 포함할 수 있다. 상기 송신 배열 안테나는, 다수의 안테나들을 그룹핑하여 안테나 그룹을 형성하고, 상기 위상 지연부는, 상기 안테나 그룹 별로 연결하여 안테나 그룹별로 전력신호를 인가하는 것일 수 있다. 또한, 본 발명의 또 다른 실시예에 따른 IoT 디바이스 충전용 무선전력 전송 장치는, 다수의 안테나들로 구성되 어 수신기로 전력을 전송하되, 상기 수신기의 위치에서 포커싱 빔포밍을 형성하기 위해 각 안테나의 배치를 조 정하여 고정형 포커싱 빔포밍을 형성하기 위한 송신 배열 안테나; 상기 수신기로부터 전력 전송을 요청받아 상 기 수신기의 위치를 추정하기 위한 수신기 검출부; 및 상기 송신 배열 안테나에 의해 형성된 충전영역 내에 상기 수신기가 위치함에 따라 각 안테나에 전력신호 인가를 제어하기 위한 컨트롤러;를 포함할 수 있다. 실시예에 따르면, 상기 각 안테나에 인가하는 전력신호를 증폭시키기 위한 전력 증폭부; 상기 각 안테나에 인가 하는 전력신호로 분배하는 전력 분배 네트워크를 구성하기 위한 전력 분배부; 상기 전력 분배부에 제공하는 전 력신호를 생성하기 위한 RF 신호 생성부;를 더 포함하되, 상기 컨트롤러는, 상기 전력 분배부를 제어하여 상기 각 안테나에 전력신호를 인가시키는 것일 수 있다. 상기 각 안테나는, 구의 면적을 따라 배치하되, 수학식 (여기서, θsphere는 안테나의 구면 각도, R은 수신기까지의 거리, X는 단위 안테나의 폭, NX는 안테나의 가로 배열 개수)를 만족하는 것일 수 있다."}
{"patent_id": "10-2020-0025384", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 무선전력 전송 대상의 위치를 추정해 미리 정해진 충전 영역 중 최적의 충전 영역을 선택하여 전력을 전송함으로써 전력 관리의 복잡도를 낮추어 효율적으로 전력 전송을 가능하게 할 수 있다. 또한, 본 발명은 복잡도 높은 비효율적인 시스템을 극복하고 복잡도를 낮추어 전력을 전송할 수 있는 시스템을 제공할 수 있다. 또한, 본 발명은 크기가 큰 안테나 또는 안테나 배열의 근거리내 성능 열화를 극복하기 위하여 포커싱 빔포밍을 하여 프레넬 영역에서 배열 이득을 유지할 수 있다. 또한, 본 발명은 RF 체인으로 조절하는 안테나 모듈의 단위를 안테나 당 하나가 아닌 여러 안테나 당 하나로 높 은 안테나의 이득을 가지면서 제어할 안테나의 개수를 줄여 복잡도를 낮출 수 있다. 또한, 본 발명은 다수의 안테나의 위상 신호를 고정하여 위상 천이기의 개수를 줄이거나 없앨 수 있다. 또한, 본 발명은 전력 전송 제어 단계에서 미리 정해진 영역에 전력을 집중하므로 위상 제어의 복잡도를 낮출 수 있다."}
{"patent_id": "10-2020-0025384", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 본 발명의 바람직한 실시 예를 첨부한 도면을 참조하여 상세히 설명한다. 다만, 하기의 설명 및 첨부된 도 면에서 본 발명의 요지를 흐릴 수 있는 공지 기능 또는 구성에 대한 상세한 설명은 생략한다. 또한, 도면 전체 에 걸쳐 동일한 구성 요소들은 가능한 한 동일한 도면 부호로 나타내고 있음에 유의하여야 한다. 이하에서 설명되는 본 명세서 및 청구범위에 사용된 용어나 단어는 통상적이거나 사전적인 의미로 한정해서 해 석되어서는 아니 되며, 발명자는 그 자신의 발명을 가장 최선의 방법으로 설명하기 위한 용어로 적절하게 정의 할 수 있다는 원칙에 입각하여 본 발명의 기술적 사상에 부합하는 의미와 개념으로 해석되어야만 한다. 따라서 본 명세서에 기재된 실시 예와 도면에 도시된 구성은 본 발명의 가장 바람직한 일 실시 예에 불과할 뿐 이고, 본 발명의 기술적 사상을 모두 대변하는 것은 아니므로, 본 출원시점에 있어서 이들을 대체할 수 있는 다 양한 균등물과 변형 예들이 있을 수 있음을 이해하여야 한다. 첨부 도면에 있어서 일부 구성요소는 과장되거나 생략되거나 또는 개략적으로 도시되었으며, 각 구성요소의 크 기는 실제 크기를 전적으로 반영하는 것이 아니다. 본 발명은 첨부한 도면에 그려진 상대적인 크기나 간격에 의 해 제한되어지지 않는다. 명세서 전체에서 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있음을 의미한다. 또한, 어떤 부분이 다른 부 분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이 에 두고 \"전기적으로 연결\"되어 있는 경우도 포함한다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. \"포함하다\" 또는 \"가지다\" 등 의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정 하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 또한, 명세서에서 사용되는 \"부\"라는 용어는 소프트웨어, FPGA 또는 ASIC과 같은 하드웨어 구성요소를 의미하며, \"부\"는 어떤 역할들을 수행한다. 그렇지만 \"부\"는 소프트웨어 또는 하드웨어에 한정되는 의미는 아니 다. \"부\"는 어드레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생 시키도록 구성될 수도 있다. 따라서, 일 예로서 \"부\"는 소프트웨어 구성요소들, 객체지향 소프트웨어 구성요소 들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로 코드, 회로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레이들 및 변수들을 포함한다. 구성요소들과 \"부\"들 안에서 제공되는 기능은 더 작 은 수의 구성요소들 및 \"부\"들로 결합되거나 추가적인 구성요소들과 \"부\"들로 더 분리될 수 있다. 아래에서는 첨부한 도면을 참고하여 본 발명의 실시예에 대하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설 명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 이하, 첨부된 도면을 참조하여 본 발명의 바람직한 실시예를 설명한다. 도 1 및 도 2는 본 발명의 실시예에 따른 무선전력 전송 개념을 설명하는 도면이고, 도 3은 본 발명의 실시예에 따른 IoT 디바이스 충전용 무선전력 전송 장치에 대한 도면이며, 도 4는 송신 배열 안테나의 여러 형태를 나타 낸 도면이고, 도 5는 포커싱 빔포밍을 설명하는 도면이다. 도 1 및 도 2에 도시된 바와 같이, 본 발명의 실시예에 따른 IoT 디바이스 충전용 무선전력 전송 장치는, 무선전력 전송 대상의 위치를 추정해 미리 정해진 충전 영역 중 최적의 충전 영역을 선택하여 전력을 전송함으 로써 전력 관리의 복잡도를 낮추어 효율적으로 전력 전송을 가능하게 한다. 여기서, IoT 디바이스는 IoT(Internet of Thing) 환경에 존재하는 센서(sensor) 또는 전자기기(electronic device)를 포괄적으로 포함 하는 것일 수 있다. 본 발명에서 '송신기'라 함은 무선전력 전송 장치에 해당하고, '수신기'라 함은 IoT 디바이스에 해당한다. 이러한 무선전력 전송 장치는 전력 관리의 복잡도를 낮추기 위해 다음과 같은 특징을 가질 수 있다. 첫 번째로, 무선전력 전송 장치는 크기가 큰 안테나 또는 안테나 배열의 근거리내 성능 열화를 극복하기 위하여 프레넬 영역(fresnel zone)에서의 포커싱 빔포밍(focusing beam forming)을 통해 배열 이득을 유지할 수 있다. 즉, 충전 영역은 프레넬 영역이 된다. 두 번째로, 무선전력 전송 장치는 RF 체인으로 조절하는 안테나 모듈의 단위를 안테나당 하나가 아닌 여러 안테나 당 하나로 높은 안테나의 이득을 가지면서 제어할 안테나의 개수를 줄여 복잡도를 낮출 수 있다. 세 번째로, 무선전력 전송 장치는 다수의 안테나의 위상 신호를 고정하여 위상천이기의 개수를 줄이거나 없앨 수 있다. 마지막으로, 무선전력 전송 장치는 전력 전송 제어 단계에서 미리 정해진 영역에 전력을 집중하므로 위상 제어의 복잡도를 낮출 수 있다. 도 3에 도시된 바와 같이, 무선전력 전송 장치는 RF 신호 생성부, 전력 분배부, 위상 조절부 , 전력 증폭부, 송신 배열 안테나, 수신기 검출부, 컨트롤러를 포함한다. 구체적으로, RF 신호 생성부는 전력신호를 생성할 수 있다. 예를 들어, 전력신호는 일정한 진폭과 위상을 가지고 다양한 주파수 범위의 전자기파일 수 있다. 다음으로, 전력 분배부는 송신 배열 안테나에 맞게 전력신호를 분배하는 전력 분배 네트워크(power distribution network)를 구성하는 것으로서, 단일 입력 신호와 두 개 이상의 출력신호를 갖는다. 출력신호의 전력 레벨은 입력 전력 레벨의 1/N(N은 출력수)이다. 다음으로, 위상 조절부는 전력 분배부를 통해 인가되는 각각의 전력신호의 위상(phase)을 수신기의 위치에 따라 가변적으로 조절할 수 있다. 이때, 위상 조절부는 능동 소자(active element)로 인한 열 발생 으로 성능 열화 가능성을 줄이기 위해 다수의 안테나들을 그룹핑하여 안테나 그룹별로 전력신호의 위상을 조절 할 수 있다. 이를 통해, 위상 조절부는 가변형 포커싱 빔포밍을 구현할 수 있는 반면, 고정형 포커싱 빔포밍을 구현하 기 위해 도 8과 같이 위상 지연부로 대체할 수 있다. 다음으로, 전력 증폭부는 위상 조절부를 통해 인가되는 각각의 전력신호의 강도를 증폭시킨다. 다음으로, 송신 배열 안테나는 전력 증폭부를 통해 인가되는 각각의 전력신호를 수신기 즉, IoT 디바 이스로 전력을 전송한다. 이러한 송신 배열 안테나는 다수의 안테나들로 구성되어 있다. 다수의 안테나들 각각은 예를 들어, 도파관 (waveguide) 안테나, 다이폴 안테나, 야기 안테나, 패치 안테나, 비발디 안테나, 와이어 안테나, 슬롯 배열 안 테나 중 어느 하나로 구현될 수 있으며, 1차원 내지 3차원으로 배치될 수 있다. 여기서는 저손실을 위해 슬롯 배열 안테나를 구현하되 도파관 안테나로 구현하는 경우에 대해 설명하기로 한다. 또한, 송신 배열 안테나는 도 4의 (a)와 같은 평면형(planar type), 도 4의 (b)와 같은 절곡형(bending type), 도 4의 (c)와 같은 파라볼릭형(parabolic type)일 수 있으나, 설명의 편의상 평면형인 경우에 대해 설명 하기로 한다. 다음으로, 수신기 검출부는 IoT 디바이스로부터 전력 전송을 요청받으면, IoT 디바이스의 위치를 추정한다. 이때, 수신기 검출부는 수신 안테나를 통해 IoT 디바이스로부터 전력 전송을 요청받고, 카메라 를 통해 IoT 디바이스의 위치를 확인한 다음 IoT 디바이스의 위치를 추정한다. 다음으로, 컨트롤러는 수신기 검출부를 통해 추정된 IoT 디바이스의 위치에 기초해 송신 배열 안테나 에 포함되는 다수의 안테나들에 인가되는 전력신호의 위상을 결정하여 위상 조절부를 제어한다. 즉, 컨트롤러는 IoT 디바이스의 위치에 따라 정해진 충전 영역에서 다수의 안테나를 이용하여 IoT 디바이 스의 위치에 전자기파를 집중 가능하도록 최적의 충전 영역을 선택하여 전력을 전송하게 한다. 이때, 컨트롤러는 다수의 IoT 디바이스가 있을 경우라면 우선순위에 따라 충전 영역을 선택하여 전력을 전 송한다. 도 5를 참조하면, 컨트롤러는 원거리 영역에서 송신 배열 안테나의 빔 형성에 있어서, 다수의 안테나 들에 인가되는 신호의 위상을 조절하여 빔의 방향만을 변경시키는 것이 아니라, 프레넬 영역에서 포커싱 빔포밍 을 형성한다. 즉, 컨트롤러는 수신기(IoT 디바이스)의 위치에서 동일한 위상으로 송신 배열 안테나의 빔을 초점(focal point)에 집중하도록 조절한다. 이때, 수신기의 위치에서의 각 신호의 위상은 동일해지므로 보 강 간섭이 발생한다. 다시 말해, 컨트롤러는 전력 전송을 위해 IoT 디바이스의 위치를 추정해 다수의 안테나 각각에 대해 전력 신호의 위상을 결정하여 인가한다. 그러면, IoT 디바이스의 위치에서 각각의 전력신호는 각 안테나와의 거리 제 곱에 반비례하여 감쇠하나, 동일한 위상으로 도착하므로 상호 보강 간섭이 발생하게 된다. 여기서, 프레넬 영역은 원거리 영역의 빔 패턴 기법이 동작하지 않는 영역으로서, 안테나의 크기 차원(D)과 파 장 길이(λ)에 의해 결정된다. 즉, 프레넬 영역의 경계(R0)는 프라운호퍼 회절(Fraunhofer diffraction)을 기반 으로 R0≥2D2/λ와 같이 나타낼 수 있다. 예를 들어, 프레넬 영역은 5.8㎓ 주파수 대역에서 40㎝ 안테나 길이일 때 6.62m 이내이고, 24㎓ 주파수 대역에서 40㎝ 안테나 길이일 때 25.6m 이내이다. 각 안테나에 인가하는 전력신호의 위상(βn)은 의 관계를 갖는다. 여기서, rn은 각 안테나에서 수신기 (IoT 디바이스) 까지의 거리이고, λ는 파장 길이이다. 수신기 수신 전력(Pr)은 자유공간을 통한 무선 링크의 송수신 전력관계를 표현하는 프리스 방정식(Friis Formula)에 따라 아래 수학식 1과 같이 나타낼 수 있다. 수학식 1"}
{"patent_id": "10-2020-0025384", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기서, Pt는 전체 송신전력, Nt는 송신안테나 개수, Gt는 송신안테나 이득, Gr은 수신안테나 이득, k는 자유공 간 경로손실 계수이다. Gt와 Gr은 3차원에서 임의의 주어진 방향으로 어떻게 분배되는지와 관련하여 방향성을 구 면 좌표(θ,φ)로 표기한다. 여기서, θ는 지정된 기준면(예, 지면) 위쪽으로의 고도 또는 각도이고, φ는 특정 방향의 기준평면에 대한 투영과 해당 평면에서 특정 기준 방향(예, 북쪽 또는 동쪽)과의 사이 각도인 방위각이 다. 이상에서 살펴본 바와 같이, 프레넬 영역에서는 포커싱 빔포밍의 특성에 의해 일반 빔포밍에 비해 효율이 더 높 고, 전력신호가 집중되는 영역을 형성한다. 즉, 컨트롤러는 프레넬 영역에서 포커싱 빔포밍을 통해 안테나 빔이 수신기의 위치에서 동일한 위상이 되 도록 함으로써 전력 전달의 효율을 향상시켜줄 수 있다. 이를 위해, 각 안테나로 인가되는 전력신호의 위상은 각 안테나 마다 위상 조절부를 이용하여 수신기의 위 치에 따라 적응적으로 조절할 수 있다. 즉, 위상 조절부는 가변형 포커싱 빔포밍을 구현한다. 이는 능동소자인 위상 조절부의 개수가 많아지면 능동소자에 의한 성능 열화가 발생할 가능성이 있다. 그 래서, 각 안테나로 인가되는 전력신호의 위상은 일부 안테나를 그룹핑하여 안테나 그룹 마다 위상 조절부 를 이용하여 수신기의 위치에 따라 적응적으로 조절하는 것이 바람직하다. 이에 대해 후술할 도 6 및 도 7을 참조하여 설명하기로 한다. 또한, 각 안테나로 인가되는 전력신호의 위상은 위상 조절부에 의해 수신기의 위치에 따라 적응적으로 조 절하여 결정할 수도 있으나, 다른 실시예로서 위상 조절부 대신 위상 지연부를 이용하여 각 안테나 마다 미리 정해진 수신기의 위치에 따라 고정할 수도 있다. 이에 대해 후술할 도 8 내지 도 10을 참조하여 설명 하기로 한다. 그리고, 각 안테나로 인가되는 전력신호의 위상은 또 다른 실시예로서 안테나 배치를 물리적으로 조정하여 수신 기의 위치에서 보강 간섭이 일어나게 결정할 수 있다. 이에 대해 후술할 도 11을 참조하여 설명하기로 한다. 먼저, 도 6 및 도 7을 참조하여 각 안테나로 인가되는 전력신호의 위상을 결정함에 있어서, 안테나 그룹을 통해 가변형 포커싱 빔포밍을 구현하는 경우에 대해 살펴보기로 한다. 도 6은 서브어레이 형태의 송신 배열 안테나를 나타낸 도면이고, 도 7은 슬롯 배열 안테나를 나타낸 도면이다. 도 6 및 도 7을 참조하면, 송신 배열 안테나는 다수의 안테나들을 그룹핑하고, RF 체인[즉, 하나의 위상 조절부와 하나의 전력 증폭부]은 안테나 그룹별로 연결하여 안테나 그룹별로 전력신호의 위상을 조절 한다. 즉, 하나의 RF 체인은 하나의 안테나 그룹에 연결한다. 각 안테나 그룹의 개수는 전력 전송 효율에 30% 이상 손실을 발생시키지 않는 한도 내에서 정해진다. 도 6에서 각 안테나 그룹에는 16개의 배열 슬롯 안테나가 포함된다. 도 7의 슬롯 배열 안테나는 한 변의 길이가 5λ(1λ=12.5㎜)의 파장 길이를 갖는 정육면체의 도파관 안테나로 구현할 수 있다. 즉, 송신 배열 안테나는 도파관 슬롯 배열 안테나 타입이다. 슬롯(slot)은 지면에 평행한 방향으로 형성하되 지그재그형으로 배열한다. 이와 같이, 송신 배열 안테나는 안테나 그룹을 형성하고, RF 체인은 안테나 그룹별로 연결하여 전력신호의 위상을 조절함으로써, 능동 회로 또는 능동 소자의 개수를 줄일 수 있기 때문에 소비 전력량과 복잡도를 줄일 수 있다. 다음으로, 도 8 내지 도 10에서 각 안테나로 인가되는 전력신호의 위상을 결정함에 있어서, 위상 지연부를 통해 고정형 포커싱 빔포밍을 구현하는 경우에 대해 살펴보기로 한다. 이 경우에는 전술한 도 6 및 도 7의 안테 나 그룹을 통해 고정형 포커싱 빔포밍을 구현할 수도 있다. 즉, 하나의 RF 체인은 하나의 안테나에 연결하거나, 하나의 안테나 그룹에 연결할 수 있다. 도 8은 고정형 포커싱 빔포밍 개요를 설명하는 도면이고, 도 9는 고정형 포커싱 빔포밍의 충전 영역을 설명하는 도면이며, 도 10은 위상 지연 회로에 대한 도면이다. 도 8 내지 도 10을 참조하면, 각 안테나로 인가되는 전력신호의 위상은 수신기의 위치에 따라 적응적으로 조절 가능한 위상 조절부를 대체하여 미리 정해진 충전영역에 따라 고정하는 위상 지연부를 이용하여 결정 할 수 있다. 즉, 고정형 포커싱 빔포밍은 능동소자인 위상 조절부 대신 수동소자인 위상 지연부를 이용함에 따라 능동소자로 인한 성능 열화를 줄일 수 있다. 위상 조절부는 가변형 포커싱 빔포밍을 구현함에 있어서 수신기의 위치에 따라 충전영역을 가변하여 위상 제어를 연속적으로 수행할 수 있는 반면에, 위상 지연부는 고정형 포커싱 빔포밍을 구현함에 있어서 미리 정해진 충전영역 내에 수신기가 위치할 경우에만 위상 제어를 수행한다. 도 8에서 컨트롤러는 가변형 포커싱 빔포밍의 경우에 N개의 충전영역을 커버하기 위해 N번의 위상 제어를 위한 위상 조절 신호를 위상 조절부로 전달하지만, 고정형 포커싱 빔포밍의 경우에 4개의 충전영역을 커버 하기 위해 4개의 충전영역에 수신기가 위치할 경우에만 위상 제어를 위한 위상 조절 신호를 위상 지연부로 전달한다. 이와 같이 위상 지연부는 미리 정해진 충전영역에 수신기가 위치할 경우에, 해당 충전영역으로 전력 전송 을 집중하도록 안테나 빔을 형성한다. 도 9의 충전영역은 일정한 길이와 폭을 갖도록 설계할 수 있고, 미리 정해진 충전영역은 각 안테나로 인가되는 신호들의 위상을 미리 조정하여 설정할 수 있다. 이러한 충전영역은 인접 영역과 서로 중첩 영역을 가지지 않는 것이 바람직하다.이를 위해, 위상 지연부는 미리 정해진 충전영역에 따라 위상 지연 회로를 구성한 후, 스위칭을 통해 수신 기가 위치하는 해당 충전영역으로 안테나 빔을 형성한다. 도 10을 참조하면, 위상 지연 회로는 기준 경로(Ref.) 이외에 위상 지연을 줄 수 있는 나머지 위상 지연 경로를 구성할 수 있다. 위상 지연 회로 내의 경로는 RF 체인에 포함된 하나 또는 복수의 위상 지연부의 조합을 통해 형성된다. 이때, 컨트롤러는 스위칭 소자(예, SPDT, SP4T 등)의 스위칭 제어를 통해 위상 지연 경로를 변경할 수 있 다. 여기서, 위상 지연 경로의 개수는 2개 내지 4개일 수 있다. 위상 지연부는 미리 정해진 충전영역에 고정형 포커싱 빔포밍을 형성하는 위상 지연 회로를 구성하기 위해 송신 배열 안테나의 각 안테나에 인가하는 전력신호의 위상을 고정한다. 그리고, 컨트롤러는 충전영역 내에 수신기가 위치함에 따라 수신기의 위치에서 동일한 위상의 안테나 빔을 형성하도록 스위칭 제어를 통해 위상 지연 회로의 경로를 변경한다. 다음으로, 도 11에서 각 안테나로 인가되는 전력신호의 위상을 결정함에 있어서, 물리적인 안테나 배치를 통해 고정형 포커싱 빔포밍을 구현하는 경우에 대해 살펴보기로 한다. 도 11은 안테나 배치를 통한 고정형 포커싱 빔포밍을 설명하는 도면이다. 전술한 도 8 내지 도 10의 위상 지연부를 통해 고정형 포커싱 빔포밍을 구현하는 경우는 평면형으로 각 안 테나를 배열하는 경우일 수 있으나, 안테나 배치를 통한 고정형 포커싱 빔포밍은 각 안테나의 위치를 물리적으 로 바꾸어 원하는 전력 전송 위치와의 거리를 동일하게 만든다. 즉, 송신 배열 안테나의 각 안테나는 공간 적으로 위치를 바꾼다. 이 경우에는 위상 조절부 또는 위상 지연부를 사용하지 않을 수 있다. 즉, RF 체인은 전력 증폭부 만 포함하고, 전력 분배부로부터 동일한 위상의 전력신호가 인가된다. 이를 통해, 각 안테나에서 방 사된 신호는 각 안테나의 배치가 물리적으로 변경되어 동일한 경로 지연을 통해 전력 전송 위치에서 보강 간섭 이 일어난다. 송신 배열 안테나는 수신기의 위치에서 동일한 위상의 안테나 빔을 형성하도록 각 안테나의 배치를 조정하 여 고정형 포커싱 빔포밍을 형성한다. 컨트롤러는 송신 배열 안테나에 의해 형성된 충전영역 내에 수신기가 위치함에 따라 각 안테나에 전 력신호 인가를 제어한다. 전력 증폭부는 각 안테나에 인가하는 전력신호를 증폭시키고, 전력 분배부는 각 안테나에 인가하는 전력신호로 분배하는 전력 분배 네트워크를 구성하며, RF 신호 생성부는 전력 분배부에 제공하는 전 력신호를 생성한다. 이때, 컨트롤러는 전력 분배부를 제어하여 각 안테나에 전력신호를 인가시킨다. 도 12는 무선전력 전송 장치의 PoC(Proof of Concept) 구성을 나타낸 도면이고, 도 13은 도 12의 무선전력 전송 장치의 고정형 포커싱 빔포밍을 구현한 경우에 대한 시뮬레이션 결과를 나타낸 도면이며, 도 14는 도 12의 송신 배열 안테나 및 측정결과를 나타내는 도면이고, 도 15는 도 12의 송신 배열 안테나를 평면형으로 구현한 경우를 나타낸 도면이고, 도 16은 도 12의 송신 배열 안테나를 구형으로 구현한 경우를 나타낸 도면이다. 도 12를 참조하면, 무선전력 전송 장치의 PoC 구성은 RF 소스, 8 분배 네트워크(8way divider delay line), 송 신 RF 체인 및 송신 배열 안테나(96×96)로 구성한다. 수신기는 수신 배열 렉테나(24×24)로 사용한다. 도 13은 도 12의 무선전력 전송 장치가 5m와 10m 영역의 수신기에 전력을 전송하려는 경우에, 수신기의 위치를 거리에 따라 달리하였을 때 수신 전력 레벨을 측정한 결과를 나타낸다. (a)는 적응형 빔포밍(Friis equation)에 대한 수신 전력 레벨을 나타내고, (b)는 10m 영역의 고정형 빔포밍(10m fixed beamforming)에 대한 수신 전력 레벨을 나타내며, (c)는 5m 영역의 고정형 빔포밍(5m fixed beamforming)에 대한 수신 전력 레벨을 나타낸다. 5m를 중심으로 3㏈ 떨어지는 지점을 기준으로 하면, 약 4m 정도의 반경을 커버한다. 이를 통해, 5m, 10m의 영역 을 지정하여 약 앞뒤 14m 정도의 영역을 커버할 수 있다. 도 12 및 도 14를 참조하면, 송신 배열 안테나의 단위 안테나는 도파관 슬롯 안테나이고, 12×12 배열로 그룹핑 하였다. 알루미늄 재질로 제작된 단위 안테나는 24㎓ 주파수 대역에서 동작하도록 설계되었으며, 도 14의 측정 결과에서 안테나 반사계수(S11)는 -16.4㏈이고, 안테나 이득은 27.7㏈i이다. 이에 따라, 도 15는 평면형의 송신 배열 안 테나를 나타내고, 도 16은 구형의 송신 배열 안테나를 나타낸다. 도 17은 도 12의 RF 체인을 위상 지연을 통해 고정형 빔포밍을 구현하는 PA 보드를 나타낸 도면이고, 도 18은 도 12의 RF 체인을 안테나 배치를 통해 고정형 빔포밍을 구현하는 PA 보드를 나타낸 도면이며, 도 19은 도 18의 송신 배열 안테나의 거시도를 나타낸 도면이고, 도 20은 도 19의 송신 배열 안테나에서 구면 각도를 설명하는 도면이다. 도 17을 참조하면, 평면 형태의 송신 배열 안테나를 위한 RF 체인을 구현하는 PA 보드는 5m, 10m에 전력을 집중 할 수 있는 위상값을 미리 구성하고, 이를 PIN 다이오드 스위치를 통해 재구성한다. 또한, 전력을 증폭하는 드 라이버 앰프를 구비한다. 도 18은 10m를 기준으로하는 고정형 빔포밍을 안테나 배치를 통해 구성하는 경우를 나타낸다. 도 18을 참조하면, 구 형태의 송신 배열 안테나를 위한 RF 체인을 구현하는 PA 보드는 별도의 위상 지연 회로가 없이 전력을 증폭하는 드라이버 앰프로 구성된다. 도 19는 구 형태의 송신 배열 안테나를 나타내고, 구의 면적을 따라 안테나를 배치하여 10m를 타겟으로 하는 안 테나의 위상 지연을 형성한다. 도 20을 참조하면, 사용하는 안테나 또는 안테나 그룹의 폭과 길이가 동일하고, 가로 배열 및 세로 배열의 개수가 동일하다고 가정할 때, 안테나의 구면 각도(θsphere)는 아래 수학식 2와 같이 정해진다. 수학식 2"}
{"patent_id": "10-2020-0025384", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "여기서, R은 수신기까지의 거리, X는 단위 안테나의 폭, NX는 안테나의 가로 배열 개수를 의미한다. 일부 실시 예에 의한 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨 터 판독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 본 발명을 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CDROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체 (magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도 록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 비록 상기 설명이 다양한 실시예들에 적용되는 본 발명의 신규한 특징들에 초점을 맞추어 설명되었지만, 본 기 술 분야에 숙달된 기술을 가진 사람은 본 발명의 범위를 벗어나지 않으면서도 상기 설명된 장치 및 방법의 형태 및 세부 사항에서 다양한 삭제, 대체, 및 변경이 가능함을 이해할 것이다. 따라서, 본 발명의 범위는 상기 설명 에서보다는 첨부된 특허청구범위에 의해 정의된다. 특허청구범위의 균등 범위 안의 모든 변형은 본 발명의 범위 에 포섭된다."}
{"patent_id": "10-2020-0025384", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1 및 도 2는 본 발명의 실시예에 따른 무선전력 전송 개념을 설명하는 도면, 도 3은 본 발명의 실시예에 따른 IoT 디바이스 충전용 무선전력 전송 장치에 대한 도면, 도 4는 송신 배열 안테나의 여러 형태를 나타낸 도면이고, 도 5는 포커싱 빔포밍을 설명하는 도면, 도 6은 서브어레이 형태의 송신 배열 안테나를 나타낸 도면, 도 7은 슬롯 배열 안테나를 나타낸 도면, 도 8은 고정형 포커싱 빔포밍 개요를 설명하는 도면, 도 9는 고정형 포커싱 빔포밍의 충전 영역을 설명하는 도면, 도 10은 위상 지연 회로에 대한 도면, 도 11은 안테나 배치를 통한 고정형 포커싱 빔포밍을 설명하는 도면, 도 12는 무선전력 전송 장치의 PoC(Proof of Concept) 구성을 나타낸 도면, 도 13은 도 12의 무선전력 전송장치의 고정형 포커싱 빔포밍을 구현한 경우에 대한 시뮬레이션 결과를 나타낸 도면, 도 14는 도 12의 송신 배열 안테나 및 측정결과를 나타내는 도면, 도 15는 도 12의 송신 배열 안테나를 평면형으로 구현한 경우를 나타낸 도면,도 16은 도 12의 송신 배열 안테나를 구형으로 구현한 경우를 나타낸 도면, 도 17은 도 12의 RF 체인을 위상 지연을 통해 고정형 빔포밍을 구현하는 PA 보드를 나타낸 도면, 도 18은 도 12의 RF 체인을 안테나 배치를 통해 고정형 빔포밍을 구현하는 PA 보드를 나타낸 도면, 도 19는 도 18의 송신 배열 안테나의 거시도를 나타낸 도면, 도 20은 도 19의 송신 배열 안테나에서 구면 각도를 설명하는 도면이다."}
