{"patent_id": "10-2021-0174070", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0085667", "출원번호": "10-2021-0174070", "발명의 명칭": "지능형 스마트 방범 도어 출입 관리 시스템", "출원인": "선문대학교 산학협력단", "발명자": "황찬승"}}
{"patent_id": "10-2021-0174070", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "공동 현관문을 출입하기 위해 세대를 호출하는 방문자 단말기;호출된 세대의 사용자 단말기로 통신 연결하여 방문자 정보를 전송하는 관리 서버;상기 방문자 정보를 확인하여 공동 현관문의 개방 요청을 상기 관리 서버로 전송하는 사용자 단말기; 를 포함하고,상기 방문자 단말기를 통해 상기 공동 현관문의 개방을 위한 상기 방문자 정보는 1회용 출입 코드를 통해 확인되는 방범 도어 출입 관리 시스템."}
{"patent_id": "10-2021-0174070", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 공동 현관문에는 1회용 출입 코드 인식부가 구비되고, 상기 방문자 단말기는 상기 공동 현관문을 출입하기 위해 상기 1회용 출입 코드 인식부에 의해 인식되는 1회용출입 코드의 생성을 요청하는 1회용 출입 코드 요청부가 마련되며,상기 출입 관리 서버에는 상기 1회용 출입 코드 요청부에 의해 1회용 출입 코드의 요청에 따라 1회용 출입 코드를 생성하는 1회용 출입 코드 생성부가 구비되는 방범 도어 출입 관리 시스템."}
{"patent_id": "10-2021-0174070", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항에 있어서, 상기 출입 관리 서버에는, 방문자 알람을 상기 사용자 단말기에 전송해주기 위한 알람 생성부, 각 세대의 세대 주소, 세대주 이름중 적어도 어느 하나에 대한 세대 정보에 매칭하기 위해 사용자 단말기 정보및 방문자 정보를 저장하는 저장부,상기 알람 생성부 및 상기 저장부의 동작을 제어하는 제어부를 포함하는 방범 도어 출입 관리 시스템."}
{"patent_id": "10-2021-0174070", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1 항에 있어서,상기 출입 관리 서버에는, 각 세대의 세대 주소, 세대주 이름중 적어도 어느 하나에 대한 세대 정보에 매칭하기 위해 사용자 단말기 정보및 방문자 정보를 저장하는 저장부와,상기 공동 현관문의 출입 관리를 제어하기 위한 제어부를 포함하고, 상기 공동 현관문에서 상기 방문자 단말기를 통해 1회용 출입 코드를 인식하면, 상기 제어부에서는 호출 세대의 사용자 단말기 정보를 상기 출입 관리 서버의 상기 저장부로부터 추출하고, 방문자 알람을 생성하도록 알람 생성부를 제어하며, 출입 관리 앱을 통해 생성된 방문자 알람을 해당 사용자 단공개특허 10-2023-0085667-3-말기로 전송하도록 통신부를 제어하는 방범 도어 출입 관리 시스템."}
{"patent_id": "10-2021-0174070", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1 항에 있어서,각 세대의 현관문에는 방문자의 영상 정보를 획득할 수 있는 영상 획득부가 설치되고, 사용자 단말기에는, 상기 방문자 단말기를 통해 세대 호출이 요청되면 푸시 알람을 확인할 수 있는 알람부, 상기 영상 획득부에서 획득된 영상 정보를 확인할 수 있는 영상 확인부를 포함하는 방범 도어 출입 관리시스템."}
{"patent_id": "10-2021-0174070", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1 항에 있어서,상기 공동 현관문에는 1회용 출입 코드 인식부가 마련되고, 상기 출입 관리 서버에는 1회용 출입 코드 생성부, 세대 정보가 저장되는 저장부, 상기 공동 현관문을 제어하는제어부가 구비되며, 상기 사용자 단말기에는, 상기 출입 관리 서버에 마련된 상기 1회용 출입 코드 생성부를 통해 생성한 1회용 출입 코드를 상기 1회용 출입코드 인식부에 인식시키면, 상기 출입 관리 서버에 마련된 저장부에 저장된 세대 정보와의 매칭 작업을 통해매칭이 이루어지면 상기 제어부에서 공동 현관문을 개방하도록 제어하고, 상기 1회용 출입 코드를 상기 1회용 출입 코드 인식부에서 인식이 안되는 경우, 설정 회수를 초과하여 인식이안되면, 상기 저장부에 등록된 전 세대에 전달하거나 또는 경비실에 알리도록 하기 위한 SOS 처리부가 마련되는방범 도어 출입 관리 시스템."}
{"patent_id": "10-2021-0174070", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1 항에 있어서, 상기 출입 관리 서버에는 제어부가 마련되고, 해당 세대의 현관문에는 인체 동작 감지 센서가 구비되며, 상기 인체 동작 감지 센서에서 방문자의 비정상적인 동작이 포착되면, 포착된 이상 동작에 대한 정보에 대하여상기 제어부에서는 상기 사용자 단말기에 푸시 알람을 통해 알려주며, 상기 사용자 단말기에는 경비실에 안전을 위해 확인해줄 것을 요청하는 SOS 처리부가 마련되는 방범 도어 출입관리 시스템."}
{"patent_id": "10-2021-0174070", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1 항에 있어서,상기 현관문에는 방문자의 영상 정보를 획득하는 영상 획득부가 마련되고,상기 사용자 단말기에는, 상기 상기 방문자 단말기로부터 세대 방문을 요청 받으면, 상기 영상 획득부에 저장된 영상을 확인하는 영상 확인부가 마련되며, 공개특허 10-2023-0085667-4-해당 세대의 현관문에는 상기 영상 확인부를 통해 확인된 방문자에 따라 해당 세대의 현관문 개방을 진행하기위해 원격 제어되는 도어록 유니트가 설치되는 방범 도어 출입 관리 시스템."}
{"patent_id": "10-2021-0174070", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1 항에 있어서,방문자가 방문하는 해당 세대의 현관문에는 원격 제어가 가능한 도어록 유니트가 마련되고,상기 도어록 유니트는, 현관문을 록킹 및 해제하기 위한 록킹부, 상기 록킹부를 동작시키는 액추에이터, 상기 액추에이터의 동작을 제어하는 도어록 제어부, 상기 사용자 단말기 또는 상기 출입 관리 서버와 통신하여 도어록 제어부에 상기 해당 세대의 현관문의 개방 여부를 원격 제어하기 위해 통신하는 통신부를 포함하는 방범 도어 출입 관리 시스템."}
{"patent_id": "10-2021-0174070", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9 항에 있어서,상기 도어록 유니트에는 상기 현관문의 록킹 해제를 위한 전자키의 매칭 여부를 판단하는 전자키 매칭부가 마련되고, 상기 출입 관리 서버에는 상기 전자키 매칭부에 전자키 매칭 여부 판단을 위한 전자키 정보를 제공해주기 위해전자키가 저장되는 전자키 저장부가 구비되며, 상기 사용자 단말기에는 해당 세대의 현관문 개방 동작을 하기 위한 도어 개방부가 형성되고, 상기 도어 개방부를 동작시키면, 상기 전자키 매칭부가 상기 동작되는 도어 개방부에 의해 제공되는 전자키 매칭 여부를 판단하며, 상기 전자키 매칭부의 매칭이 이루어지면, 도어록 제어부에서는 상기 액추에이터를 제어하여 록킹부의 동작으로현관문의 록킹 상태를 해제하는 방범 도어 출입 관리 시스템."}
{"patent_id": "10-2021-0174070", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1 항에 있어서,상기 출입 관리 서버에는, 각 세대의 세대 주소, 세대주 이름중 적어도 어느 하나에 대한 세대 정보에 매칭하기 위해 사용자 단말기 정보및 방문자 정보를 저장하는 저장부와,상기 공동 현관문의 출입 관리를 제어하기 위한 제어부를 포함하고,상기 사용자 단말기에는 상기 방문자 단말기를 통해 1회용 출입 코드를 발급받아서 상기 공동 현관문을 출입한방문 이력을 확인하기 위한 방문 이력 요청부를 포함하며, 상기 저장부에는 상기 방문 이력 요청부에 의해 방문 이력 요청이 수신되면 제공해주기 위한 방문 이력 정보를저장하는 방범 도어 출입 관리 시스템."}
{"patent_id": "10-2021-0174070", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 본 발명은 출입 통제를 확실하게 할 수 있는 지능형 스마트 방범 도어 출입 관리 시스템에 관한 것이다. 본 발명은 공동 현관문을 출입하기 위해 세대를 호출하는 방문자 단말기; 호출된 세대의 사용자 단말기로 통신 연결하여 방문자 정보를 전송하는 관리 서버; 상기 방문자 정보를 확인하여 공동 현관문의 개방 요청을 상기 관 리 서버로 전송하는 사용자 단말기; 를 포함하고, 상기 방문자 단말기를 통해 상기 공동 현관문의 개방을 위한 상기 방문자 정보는 1회용 출입 코드를 통해 확인되는 방범 도어 출입 관리 시스템이 제공될 수 있다."}
{"patent_id": "10-2021-0174070", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 출입 통제를 확실하게 할 수 있는 지능형 스마트 방범 도어 출입 관리 시스템에 관한 것이다."}
{"patent_id": "10-2021-0174070", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로, 공동 주택이나 아파트의 공동 현관문은, 외부인의 출입을 제한하기 위하여 인터폰을 통해 방문자의 신원 확인 후에 개방될 수 있다. 그러므로, 공동 주택이나 아파트의 거주자는, 거주자 인증 카드키 또는 공동 비밀번호 입력을 통해 공동 현관문 의 개방을 제어할 수 있다. 최근에는, 거주자의 이동 단말기를 이용하여 인증을 수행한 후에 공동 현관문의 개방을 제어할 수도 있다. 외부인의 경우에는, 인터폰을 통해 해당 세대를 호출하고, 해당 세대의 거주자가 인터폰을 통해 영상과 음성으 로 외부인을 확인한 후에, 세대의 거주자가 공동 현관문을 개방하면 외부인이 공동 현관문을 출입할 수 있다. 그러나, 해당 세대의 거주자가 부재 시에, 외부인 및 인증 카드를 소지하지 않는 거주자는, 공동 현관문의 출입 이 제한될 수 밖에 없는 문제가 있다. 또한, 택배, 우편, 배달 등을 수행하는 외부인은, 관리 사무소에 공동 현관문의 개방 요청을 통해 거주자의 신 원 확인 없이도 출입할 수 있어 출입 보안이 낮아지는 문제도 있었다. 또한, 인증 카드 분실 및 비밀 번호 노출 등에 의해서도 외부인이 신원 확인 없이 공동 현관문을 출입할 수 있 으므로, 출입 보안에 문제가 발생하였다. 최근에 코로나 바이러스 펜데믹 상황에서 비대면이 일상화되면서 각종 택배 및 배달이 급증하는 추세이므로, 공 동 주택 거주자의 안전을 위해 더욱 더 공동 현관문 출입 관리의 중요성이 커지고 있다."}
{"patent_id": "10-2021-0174070", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 공동 주택에 설치된 공동 현관문 및 해당 세대의 현관문의 출입 관리를 확실하여 각종 배달 사고 방 지 및 방범에 기여할 수 있는 지능형 스마트 방범 도어 출입 관리 시스템을 제공하는 것이다."}
{"patent_id": "10-2021-0174070", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 해결 수단은 공동 현관문을 출입하기 위해 세대를 호출하는 방문자 단말기; 호출된 세대의 사용자 단 말기로 통신 연결하여 방문자 정보를 전송하는 관리 서버; 상기 방문자 정보를 확인하여 공동 현관문의 개방 요 청을 상기 관리 서버로 전송하는 사용자 단말기; 를 포함하고, 상기 방문자 단말기를 통해 상기 공동 현관문의 개방을 위한 상기 방문자 정보는 1회용 출입 코드를 통해 확인되는 방범 도어 출입 관리 시스템이 제공될 수 있 다."}
{"patent_id": "10-2021-0174070", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이와 같이, 본 발명은 공동 주택의 1층에 마련된 공동 현관문의 출입시, 택배 기사, 또는 배달원 등의 방문자가 1회용 출입코드를 받아서 인식이 이루어지면 자동적으로 공동 현관문이 개방되게 함으로써, 세대 거주자의 부재 시, 방문자에게 노출되어 무용지물이 되던 공용 비밀번호의 노출 문제를 근본적으로 해결할 수 있다. 만일, 공동 현관문에 마련된 1회용 출입 코드 인식부를 통한 인식 과정 오류가 설정 회수를 초과하면, 사용자 단말기에 이러한 상황을 푸시알람을 통해 알려주고, 1회용 출입 코드 재생성 작업 또는 경비실(또는 관리사무소)에 연락하여 보안 문제를 해결되게 할 수 있다. 또한, 본 발명은 공동 현관문을 통과한 방문자가 해당 세대의 현관문에 도착하여 초인종을 누르는 경우, 해당 세대의 사용자 단말기를 통해 인지하여 영상 획득부를 통한 영상 정보, 인체 동작 감지 센서 등을 활용하여 방문자를 확인후 현관문 개방 여부를 판단할 수 있으므로, 1회용 출입 코드를 통해 공동 현관문을 통과하더라도 해당 현관문에서 이상 행동을 보이거나 또는 지인 여부에 따라 안전하게 현관문 개방 여부를 판단할 수 있으며, 만일 이상 행동을 보이는 경우, 경비실 또는 관리 사무소에 연락하여 후속 조치를 취할 수 있어 주민 안전을 위 한 경비 수준이 대폭 향상될 수 있다. 본 발명은 공동 주택의 설치된 공동 현관문을 출입하는 많은 방문자들이 1회용 출입 코드를 발급받아서 출입이 허용되고, 해당 세대의 현관문에 도착후 초인종을 누르는 경우, 해당 세대의 거주자가 이를 인지하고 영상 정보, 인체 동작 감지 센서 등을 통해 지인, 배달원, 단순 외부인 등을 판단하여 후속 조치를 취할 수 있으므로, 2중 안전 장치로서의 기능을 발휘할 수 있으며, 그에 따라 공동 주택에서의 보안 문제를 근본적으로 향상시킬 수 있다."}
{"patent_id": "10-2021-0174070", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 1, "content": "도 1은 본 발명의 도어 시스템을 나타낸 구성도이다. 하기 설명하는 용어중 도어는 공동 현관문, 해당 세대의 현관문을 포함하는 의미일 수 있다. 도 1을 참조하면, 본 발명의 방범 도어 시스템은 방문하고자 하는 세대를 호출하는 방문자 단말기, 방 문자 단말기와 통신 연결되고 방문자 정보가 저장 및 관리되는 방문자 서버, 방문자 단말기에 의해 호출된 세대의 사용자 단말기로 통신 연결하여 방문자 정보를 전송하고 공동 주택에 설치된 공동 현관문 의 출입을 관리하는 출입 관리 서버, 그리고 방문자 정보를 확인하여 공동 현관문의 개방 요청을 관리 서버로 전송하는 사용자 단말기를 포함할 수 있다. 또한, 본 발명의 방범 도어 시스템은, 해당 세대의 현관문에서 방문자를 확인할 수 있는 정보를 획득할 수 있는 영상 획득부, 통신 연결되어 원격으로 도어(D)를 제어하여 개방할 수 있도록 해당 세대의 현관문에 마련된 도어록 유니트를 포함할 수 있다. 도 2를 참조하면, 공동 현관문에는 화면부와, 1회용 출입 코드를 인식할 수 있는 1회용 출입 코드 인식 부가 구비될 수 있다. 1회용 출입 코드는 예를 들어 1회용 QR(Quick Response) 코드가 될 수 있다. 방문자 단말기는 출입 관리 앱을 설치하고, 출입 관리 서버와 사용자 단말기에 통신 연결될 수 있는데, 무선으로 네트워크에 접속하여 데이터를 송수신할 수 있다. 그리고, 방문자 단말기는, 세대 주소 정보 및 세대 호출 요청을 포함하는 1회용 출입 코드 요청부를 포함할 수 있다. 1회용 출입 코드 요청부를 통해 요청이 이루어지면, 출입 관리 서버에서는 1회용 출 입 코드를 생성하여 방문자 단말기에 제공해줄 수 있다. 방문자 서버는 방문자 단말기와 통신 연결될 수 있고, 방문자에 대한 기본적인 정보가 저장될 수 있 는 데이터베이스부가 마련될 수 있다. 출입 관리 서버는 통신부, 알람 생성부, 저장부, 제어부, 1회용 출입 코드 생성부 , 초인종 인식부을 포함할 수 있다. 통신부는 사용자 단말기, 방문자 단말기, 방문자 서버와 통신망을 통해 통신 연결하여 각 종 정보를 송수신할 수 있다. 알람 생성부는 방문자 알람을 사용자 단말기에 전송해줄 수 있다. 저장부는 각 세대의 세대 주소, 세대주 이름 등에 대한 세대 정보에 매칭하여 사용자 단말기 정보 및 방문 자 정보를 저장할 수 있다. 따라서, 저장부는 방문자 서버의 데이터베이스부로부터 사용자 단말기 정보 및 방문자 정보를 제공받을 수 있다. 제어부는 출입 관리 서버의 모든 구성 요소를 통합적으로 제어할 수 있다. 1회용 출입 코드 생성부는 방문자 단말기를 통해 1회용 출입 코드 요청이 이루어지면 공동 현관문 출입을 위한 1회용 출입 코드를 생성하여 방문자 단말기에 제공해줄 수 있다. 공동 현관문에 형성된 1회용 출입 코드 인식부를 통해 1회용 출입 코드를 인식하여 방문자 정보를 확인할 수 있다. 즉, 1회용 출입 코드를 인식하면, 제어부에서는 호출 세대의 사용자 단말기 정보를 출입 관리 서버 의 저장부로부터 추출하고, 방문자 알람을 생성하도록 알람 생성부를 제어하며, 출입 관리 앱을 통해 생성된 방문자 알람을 해당 사용자 단말기로 전송하도록 통신부를 제어하고, 사용자 단말기 로부터 알람 확인이 수신되면 방문자 정보를 저장부로부터 추출하며, 추출한 방문자 정보를 출입 관 리 앱을 통해 사용자 단말기로 전송하도록 통신부를 제어하고, 출입 관리 앱을 통해 사용자 단말기 로부터 공동 현관문 개방 요청이 수신되면 공동 현관문을 개방하도록 공동 현관문을 제어할 수 있 다. 다시 말해서, 사용자는 출입 관리 앱의 공동 현관문 개방 기능을 통해 원격지에서도 방문자(택배, 우편, 배달) 를 위한 공동 현관문 개방을 진행할 수 있다. 제어부는, 호출 세대의 사용자 단말기 정보를 추출할 때, 1회용 출입 코드 생성부에 의해 생성된 1회 용 출입 코드를 인식하면, 방문자에 의해 요청된 세대 주소 정보를 추출하고, 추출한 세대 주소 정보에 매 칭되는 사용자 단말기 정보를 저장부로부터 추출할 수 있다. 출입 관리 서버는, 방문자 알람을 전송할 때, 출입 관리 앱을 통해 방문자 관련 푸시 알람을 생성하여 사 용자 단말기로 전송할 수 있다. 출입 관리 서버는, 공동 현관문을 개방할 때, 사용자 단말기로부터 공동 현관문 개방 요청이 수 신되면 공동 현관문이 개방되도록 공동 현관문을 원격 제어할 수 있다. 또한, 출입 관리 서버는, 공동 현관문을 개방할 때, 사용자 단말기로부터 공동 현관문 개방 요청 이 수신되지 않으면 공동 현관문을 개방하지 않을 수 있다. 출입 관리 서버는, 공동 현관문을 개방할 때, 사용자 단말기로부터 공동 현관문 개방 거부 요청이 수 신되면 공동 현관문을 개방하지 않을 수 있다. 출입 관리 서버는, 방문자 단말기로부터 세대 호출 신호를 수신하면 호출된 세대의 사용자 단말기 정 보를 저장부로부터 추출하고, 추출된 사용자 단말기 정보에 상응하는 사용자 단말기로 방문자 알람을 출입 관리 앱을 통해 전송하며, 사용자 단말기로부터 알람 확인이 수신되면 사용자 단말기로 출입 관리 앱 을 통해 방문자 정보를 전송하고, 사용자 단말기로부터 출입 관리 앱을 통해 공동 현관문 개방 요청이 수 신되면 공동 현관문을 자동적으로 개방하도록 제어할 수 있다. 방문자 정보에는 방문자 얼굴 이미지, 방문자 이름, 방문자 소속 회사(업체), 방문 목적 등 중에서 적어도 하나 가 포함될 수 있다. 방문 목적으로는 예를 들어 “택배 방문”, “전기 검침”,“짜장면 배달”등이 될 수 있다. 또는 방문자 정보는 해당 세대의 지인인 경우, 지인의 이름, 해당 세대와의 관계, 방문 목적 등이 될 수 있다. 따라서, 지인인 경우, 해당 지인의 방문자 단말기에 출입 관리 앱을 설치하고, 1회용 출입 코드를 요청하면, 출 입 관리 서버의 1회용 출입 코드 생성부에서는 저장부에 등록된 방문자 정보에 매칭되면, 1회용출입 코드를 생성하여 방문자 단말기에 제공해줄 수 있으며, 그에 따라 지인은 본인 소유의 방문자 단말기에 제공된 1회용 출입 코드를 공동 현관문의 1회용 출입 코드 인식부를 통해 인식되게 하면, 공동 현관문은 자동적으로 개방될 수 있다. 다시 말해서, 해당 세대를 방문하기 위한 방문자는, 방문자 단말기를 통해 공동 현관문에 마련된 1회 용 출입 코드 인식부에 생성된 1회용 출입 코드 생성부를 통해 생성된 1회용 출입 코드를 인식시 켜서 세대 호출을 할 수 있다. 다음, 출입 관리 서버는, 세대 정보에 등록된 해당 사용자 단말기의 전화 번호로 푸시 알람(push alarm)을 전송할 수 있다. 그리고, 사용자는, 전송된 푸시 알람을 확인하고, 출입 관리 앱을 실행할 수 있다. 이때, 방문자의 출입 요청 정보인 영상 정보 및 요청 시간은 사용자 선택에 의해 저장부에 저장할 수 있다. 한편, 사용자 단말기에는 세대 호출이 요청되면 푸시 알람을 확인할 수 있는 알람부, 영상 획득부 에서 획득된 영상 정보를 확인할 수 있는 영상 확인부를 포함할 수 있다. 또한, 사용자 단말기에는 방문자가 세대 호출을 위해 1회용 출입 코드 생성부를 통해 생성한 1회용 출입 코드를 1회용 출입 코드 인식부에 인식시키면, 출입 관리 서버에 마련된 저장부에 저 장된 세대 정보와의 매칭 작업을 통해 제어부에서 공동 현관문을 개방하도록 제어하며, 이때 1회용 출 입 코드를 1회용 출입 코드 인식부에서 인식이 안되면, 재차 인식 동작을 수행하며, 만일 설정치 이상 (예를 들어 3회)으로 인식 동작 회수가 초과되면, 출입 관리 앱을 설치하고 출입 관리 서버의 저장부(23 0)에 등록된 전 세대에 이러한 상황을 인지시키거나 또는 경비실(또는 관리 사무소)에 알리도록 하기 위한 SOS 처리부가 마련될 수 있다. SOS 처리부를 통해 세대 호출 정보에 따른 매칭이 이루어지지 못하는 경우는 생성된 1회용 출입 코드(11 1)의 에러 또는 비정상적인 방문자일 가능성이 있다. 따라서, 생성된 1회용 출입 코드의 에러 상태인 경우 에는 후속 조치로 해당 방문자가 해당 세대의 사용자 단말기로 전화를 걸어서 확인 작업을 진행할 수 있다. 이때, 사용자는 사용자 단말기상의 영상 확인부를 통해 해당 방문자를 확인하고, 전화 통화를 통해 공동 현관문 통과 여부를 판단하여, 확인된 방문자인 경우에는 공동 현관문을 개방하도록 출입 관리 서 버에 요청하는 재 확인부를 포함할 수 있다. 또한, 사용자 단말기에는 방문자 단말기를 통해 1회용 출입 코드를 발급받아서 공동 현관문을 출 입한 방문 이력을 확인하기 위한 방문 이력 요청부를 포함할 수 있다. 출입 관리 서버에는 방문 이력 요청부에 의해 특정 방문자의 방문 이력 요청이 수신되면 제공해주기 위한 방문 이력 정보를 저장부에 저장할 수 있다. 또한, 사용자 단말기에는 도어록 유니트를 통해 현관문을 개방하기 위한 도어 개방부를 포함할 수 있다. 출입 관리 서버에서는 재 확인부를 통해 재확인 요청이 수신되면, 제어부에서 저장부에 저 장된 세대 정보와 매칭 작업을 통해 해당 세대의 요청임을 확인하고, 그에 따라 공동 현관문을 개방되게 할 수 있다. 이처럼, 공동 현관문을 통과한 방문자가 해당 목적인 세대의 현관문에 도착하여 해당 세대의 현관문에서 초 인종을 누르면, 초인종의 동작 상태를 인식하는 초인종 동작 감지 센서가 해당 세대의 내부에 마련될 수 있 다. 출입 관리 서버에는 초인종 동작 감지 센서에 의해 감지된 초인종 동작 정보를 인식하는 초인종 인식 부가 더 포함될 수 있다. 초인종 인식부에서 초인종이 눌려짐을 인식하면, 제어부에서는 사용자 단말기의 알람부를 통해 사용자에게 초인종이 눌려짐을 알리는 푸시 알람을 제공해줄 수 있다. 따라서, 각 세대별 초인종이 눌려지 면, 출입 관리 서버의 제어부에서는 눌려진 초인종 동작 정보에 해당하는 세대 정보를 매칭시킬 수있다. 제어부에 의해 매칭이 이루어지면, 각 세대의 세대주의 사용자 단말기중 해당되는 사용자 단말기 에 초인종 동작 정보를 알려줄 수 있다. 사용자 단말기에서는 본인의 현관문에 마련된 초인종이 눌려져 동작되었음을 푸시 알람을 통해 인지하면, 사용자는 영상 확인부를 동작시켜서 영상 획득부에 의해 획득된 영상 정보를 제공받을 수 있다. 다시 말해서, 해당 세대의 입주자인 사용자는, 출입 관리 앱을 통해 해당 세대의 현관문에 설치된 영상 획득부 를 이용한 방문자의 영상을 획득할 수 있다. 영상 획득부는 사용자 단말기와 무선 통신망을 이 용하여 통신 연결되기 위한 통신부, 방문자의 동영상을 획득할 수 있는 CCTV를 포함하고, 인체 동작 감지 센서를 더 포함할 수 있다. 인체 동작 감지 센서는 해당 세대의 현관문에서 비정상적인 동작이 포착되면, 사용자 단말기에 푸시 알람을 통해 알려주고, 경우에 따라 경비실에안전을 위해 확인해줄 것을 요청할 수 있다. 비정상적인 동작은 예를 들어, 현관문 앞에서 여러번 왔다갔다 하거나 또는 소정 시간 이상 정지된 상태로 현관 문을 관찰하거나, 현관문을 강제로 개방하기 위한 액션을 취하는 등의 동작이 될 수 있다. 영상 획득부를 통해 방문자에 대한 영상 정보를 획득하여 사용자 단말기의 영상 확인부를 통해 영상 정보를 확인하면, 방문자에 따라 지인인 경우, 현관문을 열어줄지 여부를 판단하여 조치를 취할 수 있고, 만일 알 수 없는 외부인인 경우에는 출입 관리 앱을 종료하거나 또는 경비실에 안전을 위해 신고 차원에서 알려줄 수 있다. 사용자 단말기를 통해 현관문(D)을 원격으로 개방하기 위해 마련되는 도어록 유니트는 현관문(D)에 부착되어 현관문을 직접 잠금 또는 해제 가능한 기계적 장치일 수 있다. 현관문(D)의 잠금 또는 해제가 가능한 입력부, 록킹부, 전자키 매칭부, 액추에이터, 도어 록 제어부, 통신부를 포함할 수 있다. 입력부는 직접 비밀번호를 입력하여 록킹 상태를 해제할 수 있고, 록킹부는 실질적인 잠금 및 해제가 이루어지는 기계적 수단일 수 있으며, 전자키 매칭부는 입력부를 통해 직접 전자키인 비밀번호가 입 력되어 매칭이 이루어지면, 록킹 상태를 해제시키도록 할 수 있다. 또한, 전자키 매칭부를 통해 입력된 전자키인 비밀번호가 매칭되면 동작되는 액추에이터는 록킹부 가 잠금 및 해제 동작을 할 수 있도록 하는 구동력을 제공해줄 수 있다. 전자키는 출입 관리 서버의 전자키 저장부로부터 전자키 매칭부로 제공될 수 있다. 사용자 단말기는 도어록 유니트의 록킹 또는 해제 동작의 승인 권한, 전자키 부여 및 삭제 권한을 가 질 수 있다. 또한, 도어록 제어부는 전자키 매칭부 및 액추에이터의 동작을 제어할 수 있다. 본 발명의 도어록 유니트는 직접 입력부를 통해 전자키인 비밀번호를 입력하여 전자키 매칭부에 의한 매칭에 의해 록킹부를 액추에이터에 의해 해제 동작을 구현할 수 있고, 또한, 원격 제어를 통해 구현할 수 있다. 따라서, 본 발명의 도어록 유니트는 IOT(사물 인터넷) 장치일 수 있다. 사용자 단말기를 통해 원격 제어를 통해 현관문을 개방하기 위해서, 사용자 단말기에는 도어 개방부 가 마련될 수 있고, 도어 개방부에는 해당 전자키인 비밀번호를 입력하면, 출입 관리 서버의 제 어부에서는 전송된 비밀번호와 전자키 저장부에 저장된 전자키를 도어록 유니트의 전자키 매칭 부에 제공하여 매칭시켜서 일치하면 현관문(D)을 열어줄 수 있다. 또는, 도어 개방부에서는 미리 전자키인 비밀번호를 입력하여 저장해두고, 원격으로 현관문을 열어야할 상 황이면, 사용자 단말기상에서 매번 비밀번호을 입력하지 않고 현관문 개방 명령을 내려서 전자키 매칭부 를 통한 매칭 작업후 현관문 개방 동작을 진행할 수 있다. 따라서, 본 발명은 사용자 단말기의 도어 개방부를 통해 현관문 오픈을 동작시키면, 도어록 유니트 의 도어록 제어부에서는 액추에이터를 동작시켜서 록킹부를 통해 록킹 상태를 해제시켜서 현관문(D)을 열어줄 수 있다. 본 발명은 해당 세대의 현관문 앞에서 방문자가 초인종을 누르는 경우, 영상 획득부를 통해 방문자의 영상 정보를 확인하여 현관문 개방 여부를 판단하게 되는데, 만일 공동 현관문을 통과하기 위해 1회용 출입 코드 를 인식시켜서 공동 현관문을 자동적으로 개방시켜서 안으로 진입하는 정상적인 방문자 외에 불순한 목적을 가진 비정상적인 방문자가 진입하는 경우에, 해당 세대에 현관문 앞에서 이상 행동을 보이게 되면, 이를 확인하여 경비실 또는 관리 사무소에 신고할 수 있다. 비정상적인 방문자는 예를 들어 정상적인 방문자가 1회용 출입 코드를 발급받아서 공동 현관문을 통과시, 공동 현관문이 개방되는 순간 동시에 안으로 진입할 가능성을 배제할 수 없다. 이런 경우에, 1회용 출입 코드 확인을 통해 진입한 방문자가 아니기 때문에, 방범 상태에 문제가 발생할 수 있다. 따라서, 이러한 특수한 상황이 발생 하더라도 본 발명은 각 세대의 현관문 앞에서 인체 동작 감지 센서를 통해 이상 행동을 감지하고 안전을 위해 후속 조치를 취할 수 있으므로, 이중으로 보안 수단이 작동하는 시스템이 될 수 있다. 또한, 인체 동작 감지 센서에 의한 센싱 정보에 의해 방문자의 이상 행동을 판단할 때, 이상 행동 패턴에 의한 정보를 학습시킨 머신 러닝 또는 딥러닝 모델을 탑재한 인공 지능 모듈을 출입 관리 서버에 갖추어서 보다 정확하게 판단할 수 있다. 도 6은 본 발명에 따른 방범 도어 시스템의 출입 관리 방법을 설명하기 위한 흐름도이다. 도 6에 도시된 바와 같이, 본 발명의 방범 도어 시스템은 방문자 단말기와 호출 세대의 사용자 단말기 에 통신 연결되는 출입 관리 서버를 포함할 수 있다. 먼저, 방문자 단말기는, 세대 호출 신호를 출입 관리 서버로 전송하는 제1 단계(S10)를 포함할 수 있 다. 여기서, 세대 호출부는, 세대 주소 정보 및 세대 호출 요청을 포함하는 방문자 입력을 수신하면 방문자 입 력에 상응하여 출입 관리 서버와 해당 세대의 사용자 단말기에 세대 호출 신호를 전송할 수 있다. 방문자 단말기는, 출입 관리 서버와 해당 세대의 사용자 단말기에 세대 호출 신호를 동시에 전 송할 수도 있다. 또한, 방문자 단말기는, 방문자의 1회용 출입 코드 및 영상을 획득하면 획득한 방문자의 1회용 출입 코드 및 영상 정보를 출입 관리 서버와 해당 세대의 사용자 단말기로 전송할 수도 있다. 그리고, 출입 관리 서버는, 세대 호출 신호를 수신하여 호출 세대의 사용자 단말기 정보를 추출하는 제 2 단계(S20)를 포함할 수 있다. 여기서, 출입 관리 서버는, 1회용 출입 코드에 의해 세대 호출 신호를 수신하면 세대 호출 신호로부 터 세대 주소 정보를 추출하고, 추출한 세대 주소 정보에 매칭되는 사용자 단말기 정보를 추출할 수 있다. 일 예로, 추출한 세대 주소 정보는, 각 세대에 지정된 호수와 세대가 포함되는 동수일 수 있다. 그리고, 출입 관리 서버는, 방문자의 1회용 출입 코드를 수신하면 수신한 방문자의 1회용 출입 코드 를 세대 주소 정보에 매칭하여 저장할 수도 있다. 이어서, 출입 관리 서버는, 추출된 사용자 단말기 정보에 상응하는 사용자 단말기로 방문자 알람을 전송할 수 있는 제 3 단계(S30)를 포함할 수 있다. 여기서, 출입 관리 서버는, 출입 관리 앱을 통해 방문자 관련 푸시 알람을 생성하여 사용자 단말기로 전송할 수 있다. 그런 다음에, 사용자 단말기는, 방문자 알람을 수신하여 알람 확인하고, 출입 관리 앱을 실행하는 제4 단 계(S40) 포함할 수 있다. 사용자 단말기는, 방문자 알림 확인 신호가 전송되면 출입 관리 앱을 실행 요청하는 사용자 입력이 있는지 를 확인하고, 사용자 입력이 있으면 출입 관리 앱을 실행할 수도 있다. 다른 예로서, 사용자 단말기는, 1회용 출입 코드의 인식에 의해 방문자 알림 확인 신호가 전송되면 자동으로 출입 관리 앱을 실행할 수도 있다. 그리고, 출입 관리 서버는, 알람 확인에 상응하여 방문자 단말기로부터 획득한 방문자 정보를 사용 자 단말기로 전송할 수 있는 제5 단계(S50)를 포함할 수 있다. 여기서, 출입 관리 서버는, 사용자 단말기로부터 알람 확인을 수신하면 사용자 단말기 정보와 매칭되 는 방문자 정보가 저장부 내에 존재하는지를 확인하고, 방문자 정보가 저장부 내에 존재하면 방문자 정보를 추출하며, 추출한 방문자 정보를 사용자 단말기로 전송할 수 있다. 다시 말해서, 출입 관리 서버는, 사용자 단말기로부터 알람 확인을 수신하면 방문자 단말기로부 터 획득한 방문자의 1회용 출입 코드에 의한 방문자 정보를 실시간으로 사용자 단말기로 전송할 수 있다. 이어서, 방문자의 1회용 출입 코드에 의해 출입 관리 서버의 저장부에 등록된 해당 세대 정보가 매칭되는지 여부를 판단하는 제6 단계(S60), 제6 단계(S60) 진행에 의해 매칭이 이루어지면, 제어부에서 공동 현관문의 개방을 진행하는 제7 단계(S70)를 포함할 수 있다. 출입 관리 서버는, 공동 현관문 개방 요청이 수신되면 공동 현관문이 개방되도록 공동 현관문을 원격 제어할 수 있다. 만일, 방문자의 1회용 출입 코드가 인식이 정확하게 되지 않아 방문자 정보가 전송되지 못하거나 매칭되지 않으면, 1회용 출입 코드의 재 인식 동작을 진행하고, 진행된 재 인식 동작 회수가 설정치를 초과하면, 공 동 현관문 개방은 진행되지 않고 정지하는 제8 단계(S80)를 포함할 수 있다. 즉, 출입 관리 서버는, 사용자 단말기로부터 공동 현관문 개방 요청이 수신되지 않거나 또는 사용자 단말기로부터 거부 요청이 수신되면 공동 현관문을 개방하지 않을 수 있다. 또한, 상기 제8 단계(S80) 진행 상황은 출입 관리 서버의 저장부에 등록된 모든 세대의 사용자 단말 기에 알림 표시를 제공해줄 수 있는 제9 단계(S90)를 포함할 수 있다. 다른 경우로서, 사용자 단말기는, 실행된 출입 관리 앱을 통해 공동 현관문 방문 이력을 출입 관리 서버 에 요청하고, 출입 관리 서버로부터 공동 현관문 방문 이력을 수신하면 공동 현관문 방문 이력을 방 문 이력 요청부를 통해 표시할 수 있다. 또한, 출입 관리 서버는, 공동 현관문을 원격 제어하여 공동 현관문을 개방하고, 방문자의 출입 시간을 확인하여 방문자의 출입 시간을 세대 주소 정보와 매칭하여 저장부에 저장할 수 있다. 또 다른 경우로서, 출입 관리 서버는, 사용자 단말기로부터 공동 현관문 방문 이력 요청이 수신되면, 사용자 단말기 정보와 매칭되는 공동 현관문 방문 이력 정보가 저장부 내에 존재하는지를 확인하고, 공동 현관문 방문 이력 정보가 저장부 내에 존재하면 공동 현관문 방문 이력 정보를 추출하며, 추출한 공동 현 관문 방문 이력 정보를 사용자 단말기로 전송할 수 있다. 여기서, 공동 현관문 방문 이력 정보는, 방문자의 영상 정보와 방문자의 호출 및 출입 시간 등을 포함할 수 있 는데, 이에 한정되지는 않는다. 1회용 출입 코드에 의해 방문자 정보 확인이 이루어지면, 공동 현관문이 개방되고, 개방된 공동 현관 문을 통과하여 해당 세대의 현관문에 도착하여 초인종을 누르는 경우, 사용자 단말기에서는 푸시 알람 을 통해 방문자가 사용자의 현관문 초인총을 눌렀음을 확인할 수 있고, 그러면, 영상 획득부를 통해 해당 방문자의 영상 정보를 확인할 수 있다. 해당 방문자의 영상 정보를 통해 전혀 알 수 없는 방문자인 경우에는 방문자 단말기를 통해 현관문을 개방 하지 못함을 알리고, 배달 물품, 우편물, 택배 물품 등인 경우, 현관문 앞에 놓고 가라는 의사 표시를 해당 방 문자에게 전화 번호를 아는 경우 전화 통화를 하거나 또는 출입 관리 앱을 통해 해당 방문자의 방문자 단말기 를 통해 확인되도록 진행할 수 있다. 한편, 영상 획득부를 통해 확인된 방문자가 지인인 경우에는 해당 현관문에 설치된 디지털 도어록인 도어 록 유니트를 통해 원격으로 개방하여 집안으로 들어가게 할 수 있다."}
{"patent_id": "10-2021-0174070", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 방범 도어 시스템을 나타낸 구성도이다. 도 2는 본 발명의 방범 도어 시스템에서 공동 현관문에 형성된 1회용 출입 코드 인식부 및 방문자 단말기에 의 해 1회용 출입 코드를 인식하는 과정을 설명하기 위한 도면이다. 도 3은 해당 세대의 현관문에 마련된 본 발명의 영상 획득부 및 도어록 유니트의 개략적인 구성도이다. 도 4는 본 발명의 영상 획득부와 도어록 유니트의 구성 및 출입 관리 서버와 사용자 단말기와의 관계를 설명하 기 위한 구성도이다. 도 5는 본 발명에 따른 방범 도어 시스템에서 출입 관리 서버, 사용자 단말기, 공동 현관문, 경비실의 관계를 설명하기 위한 구성도이다. 도 6은 본 발명에 따른 방범 도어 시스템의 출입 관리 방법을 설명하기 위한 흐름도이다."}
