{"patent_id": "10-2023-0065540", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0168032", "출원번호": "10-2023-0065540", "발명의 명칭": "이동 로봇 기반의 불법 주정차 단속 방법 및 이동 로봇", "출원인": "에이치엘만도 주식회사", "발명자": "조영하"}}
{"patent_id": "10-2023-0065540", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "적어도 하나의 프로세서에 의해 수행되는 이동 로봇 기반의 불법 주정차 단속 방법으로서,이동 로봇이 주행하는 영역에 대응하는 주행 맵을 추출하는 단계;상기 이동 로봇으로부터 획득된 센싱 데이터에 기초하여 상기 영역 중 적어도 일부의 영역이 불법 주정차 영역인지 여부를 판정하는 단계;상기 불법 주정차 영역인 것으로 판정되는 경우, 상기 추출된 주행 맵 상에 불법 주정차 영역을 설정하는 단계;및상기 불법 주정차 영역이 설정된 주행 맵을 이용하여 차량의 불법 주정차 여부를 결정하는 단계;를 포함하는 이동 로봇 기반의 불법 주정차 단속 방법."}
{"patent_id": "10-2023-0065540", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,이동 로봇이 주행하는 영역에 대응하는 주행 맵을 추출하는 단계는,상기 이동 로봇의 위치를 추출하는 단계; 및상기 이동 로봇의 위치에서 사전 결정된 거리 이내의 영역에 대응하는 주행 맵을 추출하는 단계;를 포함하는 이동 로봇 기반의 불법 주정차 단속 방법."}
{"patent_id": "10-2023-0065540", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 영역 중 적어도 일부의 영역이 불법 주정차 영역인지 여부를 판정하는 단계는,적어도 하나의 센서를 이용하여 상기 이동 로봇이 주행하는 영역 상의 적어도 하나의 표지판을 식별하는 단계;상기 식별된 적어도 하나의 표지판이 불법 주정차 영역과 연관된 표지판인지 여부를 결정하는 단계; 및상기 적어도 하나의 표지판이 불법 주정차 영역과 연관된 표지판인 것으로 결정되는 경우, 상기 적어도 하나의표지판에 기초하여 상기 영역 중 적어도 일부의 영역을 불법 주정차 영역으로 판정하는 단계;를 포함하는 이동 로봇 기반의 불법 주정차 단속 방법."}
{"patent_id": "10-2023-0065540", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 적어도 하나의 표지판은 제1 표지판 및 제2 표지판을 포함하고,상기 적어도 하나의 표지판에 기초하여 상기 영역 중 적어도 일부의 영역을 불법 주정차 영역으로 판정하는 단계는,상기 제1 표지판의 위치와 상기 제2 표지판의 위치의 사이 구간을 불법 주정차 영역으로 판정하는 단계;공개특허 10-2024-0168032-3-를 포함하는 이동 로봇 기반의 불법 주정차 단속 방법."}
{"patent_id": "10-2023-0065540", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서,상기 식별된 적어도 하나의 표지판이 불법 주정차 영역과 연관된 표지판인지 여부를 결정하는 단계는,학습된 제1 인공신경망 모델에 상기 적어도 하나의 표지판과 연관된 이미지를 제공하여 불법 주정차 영역과 연관된 표지판인지 여부를 결정하는 단계;를 포함하는 이동 로봇 기반의 불법 주정차 단속 방법."}
{"patent_id": "10-2023-0065540", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제3항에 있어서,상기 불법 주정차 영역이 설정된 주행 맵을 이용하여 차량의 불법 주정차 여부를 결정하는 단계는,상기 불법 주정차 영역 상에 차량이 사전 결정된 임계값 이상 포함되는지 여부를 인식하는 단계; 및상기 차량이 사전 결정된 임계값 이상 포함되는 경우, 불법 주정차인 것으로 결정하는 단계;를 포함하는 이동 로봇 기반의 불법 주정차 단속 방법."}
{"patent_id": "10-2023-0065540", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 차량이 불법 주정차인 것으로 결정되는 경우, 상기 차량의 차량 번호를 인식하는 단계; 및상기 인식된 차량 번호를 이용하여 불법 주정차 신고를 전송하는 단계;를 더 포함하는 이동 로봇 기반의 불법 주정차 단속 방법."}
{"patent_id": "10-2023-0065540", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 차량의 차량 번호를 인식하는 단계는,학습된 제2 인공신경망 모델에 상기 차량의 번호판과 연관된 이미지를 제공하여 상기 차량 번호를 인식하는 단계;를 포함하는 이동 로봇 기반의 불법 주정차 단속 방법."}
{"patent_id": "10-2023-0065540", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서,상기 차량의 차량 번호를 인식하는 단계는,제1 시각에 상기 차량 번호를 인식하는 단계; 및상기 제1 시각 이후의 제2 시각에 상기 차량 번호를 재인식하는 단계;를 포함하고,공개특허 10-2024-0168032-4-상기 인식된 차량 번호를 이용하여 불법 주정차 신고를 전송하는 단계는,상기 제1 시각 및 상기 제2 시각에 차량 번호가 인식되는 경우, 상기 불법 주정차 신고를 전송하는 단계;를 포함하는 이동 로봇 기반의 불법 주정차 단속 방법."}
{"patent_id": "10-2023-0065540", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 제1 시각에 상기 차량 번호가 인식되는 경우, 상기 제1 시각과 상기 제2 시각 사이에 불법 주정차 경고 방송을 송출하는 단계;를 더 포함하는 이동 로봇 기반의 불법 주정차 단속 방법."}
{"patent_id": "10-2023-0065540", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "이동 로봇으로서,이동 로봇 주변의 상황과 연관된 센싱 데이터를 획득하기 위한 적어도 하나의 센서;상기 적어도 하나의 센서로부터 획득된 센싱 데이터를 이용하여 차량의 불법 주정차 여부를 결정하는 제어부;및상기 제어부의 명령에 기초하여 상기 이동 로봇을 구동시키는 구동부;를 포함하는 이동 로봇."}
{"patent_id": "10-2023-0065540", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 제어부는,상기 이동 로봇이 주행하는 영역에 대응하는 주행 맵을 추출하고,상기 이동 로봇으로부터 획득된 센싱 데이터에 기초하여 상기 영역 중 적어도 일부의 영역이 불법 주정차 영역인지 여부를 판정하고,상기 불법 주정차 영역인 것으로 판정되는 경우, 상기 추출된 주행 맵 상에 불법 주정차 영역을 설정하는, 이동로봇."}
{"patent_id": "10-2023-0065540", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서,상기 제어부는,상기 적어도 하나의 센서를 이용하여 상기 이동 로봇이 주행하는 영역 상의 적어도 하나의 표지판을 식별하고,상기 식별된 적어도 하나의 표지판이 불법 주정차 영역과 연관된 표지판인지 여부를 결정하고,상기 적어도 하나의 표지판이 불법 주정차 영역과 연관된 표지판인 것으로 결정되는 경우, 상기 적어도 하나의표지판에 기초하여 상기 영역 중 적어도 일부의 영역을 불법 주정차 영역으로 판정하는, 이동 로봇."}
{"patent_id": "10-2023-0065540", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "공개특허 10-2024-0168032-5-제13항에 있어서,상기 적어도 하나의 표지판은 제1 표지판 및 제2 표지판을 포함하고,상기 제어부는,상기 제1 표지판의 위치와 상기 제2 표지판의 위치의 사이 구간을 불법 주정차 영역으로 판정하는, 이동 로봇."}
{"patent_id": "10-2023-0065540", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제13항에 있어서,상기 제어부는,학습된 제1 인공신경망 모델에 상기 적어도 하나의 표지판과 연관된 이미지를 제공하여 불법 주정차 영역과 연관된 표지판인지 여부를 결정하는, 이동 로봇."}
{"patent_id": "10-2023-0065540", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제13항에 있어서,상기 제어부는,상기 불법 주정차 영역 상에 차량이 사전 결정된 임계값 이상 포함되는지 여부를 인식하고,상기 차량이 사전 결정된 임계값 이상 포함되는 경우, 불법 주정차인 것으로 결정하는, 이동 로봇."}
{"patent_id": "10-2023-0065540", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제11항에 있어서,상기 제어부는,상기 차량이 불법 주정차인 것으로 결정되는 경우, 상기 차량의 차량 번호를 인식하고,상기 인식된 차량 번호를 이용하여 불법 주정차 신고를 전송하는, 이동 로봇."}
{"patent_id": "10-2023-0065540", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서,상기 제어부는,학습된 제2 인공신경망 모델에 상기 차량의 번호판과 연관된 이미지를 제공하여 상기 차량 번호를 인식하는, 이동 로봇."}
{"patent_id": "10-2023-0065540", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제17항에 있어서,상기 제어부는,제1 시각에 상기 차량 번호를 인식하고,상기 제1 시각 이후의 제2 시각에 상기 차량 번호를 재인식하고,공개특허 10-2024-0168032-6-상기 제1 시각 및 상기 제2 시각에 차량 번호가 인식되는 경우, 상기 불법 주정차 신고를 전송하는, 이동 로봇."}
{"patent_id": "10-2023-0065540", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서,상기 제어부는,상기 제1 시각에 상기 차량 번호가 인식되는 경우, 상기 제1 시각과 상기 제2 시각 사이에 불법 주정차 경고 방송을 송출하는, 이동 로봇."}
{"patent_id": "10-2023-0065540", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 이동 로봇 기반의 불법 주정차 단속 방법에 관한 것이다. 이동 로봇 기반의 불법 주정차 단속 방법은, 이동 로봇이 주행하는 영역에 대응하는 주행 맵을 추출하는 단계, 이동 로봇으로부터 획득된 센싱 데이터에 기초 하여 영역 중 적어도 일부의 영역이 불법 주정차 영역인지 여부를 판정하는 단계, 불법 주정차 영역인 것으로 판 정되는 경우, 추출된 주행 맵 상에 불법 주정차 영역을 설정하는 단계 및 불법 주정차 영역이 설정된 주행 맵을 이용하여 차량의 불법 주정차 여부를 결정하는 단계를 포함한다."}
{"patent_id": "10-2023-0065540", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 이동 로봇 기반의 불법 주정차 단속 방법 및 이의 이동 로봇에 관한 것으로, 구체적으로, 주행 맵 상 에 불법 주정차 영역을 설정하고, 이동 로봇이 설정된 불법 주정차 영역 상에 존재하는 차량을 단속하는 이동 로봇 기반의 불법 주정차 단속 방법 및 이의 이동 로봇에 관한 것이다."}
{"patent_id": "10-2023-0065540", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 불법 주정차 단속을 위한 기술들이 지속적으로 개발되고 있다. 예를 들어, CCTV 등의 복수의 카메라 센서 를 이용하여 불법 주정차를 단속하거나, 주차구역 내에 설치된 센서를 이용하여 불법 주정차를 감지하는 기술들 이 개발되고 있다. 그러나, 이러한 종래의 기술들은 특정 공간에 한정하여 불법 주정차를 단속할 수 있을 뿐이며, 각각의 공간에 별도의 카메라 센서 등을 설치하여야 하므로 시스템 비용이 증가하는 문제가 있다. 한편, 이러한 문제를 해결하 기 위해 이동식 단속 시스템이 개발되고 있으나, 이러한 경우에도 주정차된 임의의 차량을 촬영한 후, 사후적으 로 불법 주정차 여부를 결정할 수 있을 뿐이어서, 실시간으로 불법 주정차에 대한 조치를 취하기 어려운 문제가 있다."}
{"patent_id": "10-2023-0065540", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점을 해결하기 위한 이동 로봇 기반의 불법 주정차 단속 방법 및 이동 로봇을 제공 한다."}
{"patent_id": "10-2023-0065540", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명은 방법, 장치(시스템), 컴퓨터 판독 가능 매체에 저장된 컴퓨터 프로그램 또는 컴퓨터 프로그램이 저장 된 컴퓨터 판독 가능 매체를 포함한 다양한 방식으로 구현될 수 있다. 본 발명의 일 실시예에 따르면, 적어도 하나의 프로세서에 의해 수행되는 이동 로봇 기반의 불법 주정차 단속 방법은, 이동 로봇이 주행하는 영역에 대응하는 주행 맵을 추출하는 단계, 이동 로봇으로부터 획득된 센싱 데이 터에 기초하여 영역 중 적어도 일부의 영역이 불법 주정차 영역인지 여부를 판정하는 단계, 불법 주정차 영역인 것으로 판정되는 경우, 추출된 주행 맵 상에 불법 주정차 영역을 설정하는 단계 및 불법 주정차 영역이 설정된 주행 맵을 이용하여 차량의 불법 주정차 여부를 결정하는 단계를 포함한다. 본 발명의 일 실시예에 따르면, 이동 로봇이 주행하는 영역에 대응하는 주행 맵을 추출하는 단계는, 이동 로봇 의 위치를 추출하는 단계 및 이동 로봇의 위치에서 사전 결정된 거리 이내의 영역에 대응하는 주행 맵을 추출하 는 단계를 포함한다.본 발명의 일 실시예에 따르면, 영역 중 적어도 일부의 영역이 불법 주정차 영역인지 여부를 판정하는 단계는, 적어도 하나의 센서를 이용하여 이동 로봇이 주행하는 영역 상의 적어도 하나의 표지판을 식별하는 단계, 식별 된 적어도 하나의 표지판이 불법 주정차 영역과 연관된 표지판인지 여부를 결정하는 단계 및 적어도 하나의 표 지판이 불법 주정차 영역과 연관된 표지판인 것으로 결정되는 경우, 적어도 하나의 표지판에 기초하여 영역 중 적어도 일부의 영역을 불법 주정차 영역으로 판정하는 단계를 포함한다. 본 발명의 일 실시예에 따르면, 적어도 하나의 표지판은 제1 표지판 및 제2 표지판을 포함한다. 적어도 하나의 표지판에 기초하여 영역 중 적어도 일부의 영역을 불법 주정차 영역으로 판정하는 단계는, 제1 표지판의 위치와 제2 표지판의 위치의 사이 구간을 불법 주정차 영역으로 판정하는 단계를 포함한다. 본 발명의 일 실시예에 따르면, 식별된 적어도 하나의 표지판이 불법 주정차 영역과 연관된 표지판인지 여부를 결정하는 단계는, 학습된 제1 인공신경망 모델에 적어도 하나의 표지판과 연관된 이미지를 제공하여 불법 주정 차 영역과 연관된 표지판인지 여부를 결정하는 단계를 포함한다. 본 발명의 일 실시예에 따르면, 불법 주정차 영역이 설정된 주행 맵을 이용하여 차량의 불법 주정차 여부를 결 정하는 단계는, 불법 주정차 영역 상에 차량이 사전 결정된 임계값 이상 포함되는지 여부를 인식하는 단계 및 차량이 사전 결정된 임계값 이상 포함되는 경우, 불법 주정차인 것으로 결정하는 단계를 포함한다. 본 발명의 일 실시예에 따르면, 차량이 불법 주정차인 것으로 결정되는 경우, 차량의 차량 번호를 인식하는 단 계 및 인식된 차량 번호를 이용하여 불법 주정차 신고를 전송하는 단계를 더 포함한다. 본 발명의 일 실시예에 따르면, 차량의 차량 번호를 인식하는 단계는, 학습된 제2 인공신경망 모델에 차량의 번 호판과 연관된 이미지를 제공하여 차량 번호를 인식하는 단계를 포함한다. 본 발명의 일 실시예에 따르면, 차량의 차량 번호를 인식하는 단계는, 제1 시각에 차량 번호를 인식하는 단계 및 제1 시각 이후의 제2 시각에 차량 번호를 재인식하는 단계를 포함한다. 인식된 차량 번호를 이용하여 불법 주정차 신고를 전송하는 단계는, 제1 시각 및 제2 시각에 차량 번호가 인식되는 경우, 불법 주정차 신고를 전송 하는 단계를 포함한다. 본 발명의 일 실시예에 따르면, 제1 시각에 차량 번호가 인식되는 경우, 제1 시각과 제2 시각 사이에 불법 주정 차 경고 방송을 송출하는 단계를 더 포함한다. 본 발명의 일 실시예에 따른 이동 로봇은, 이동 로봇 주변의 상황과 연관된 센싱 데이터를 획득하기 위한 적어 도 하나의 센서, 적어도 하나의 센서로부터 획득된 센싱 데이터를 이용하여 차량의 불법 주정차 여부를 결정하 는 제어부 및 제어부의 명령에 기초하여 이동 로봇을 구동시키는 구동부를 포함한다. 본 발명의 일 실시예에 따르면, 제어부는, 이동 로봇이 주행하는 영역에 대응하는 주행 맵을 추출하고, 이동 로 봇으로부터 획득된 센싱 데이터에 기초하여 영역 중 적어도 일부의 영역이 불법 주정차 영역인지 여부를 판정하 고, 불법 주정차 영역인 것으로 판정되는 경우, 추출된 주행 맵 상에 불법 주정차 영역을 설정한다. 본 발명의 일 실시예에 따르면, 제어부는, 적어도 하나의 센서를 이용하여 이동 로봇이 주행하는 영역 상의 적 어도 하나의 표지판을 식별하고, 식별된 적어도 하나의 표지판이 불법 주정차 영역과 연관된 표지판인지 여부를 결정하고, 적어도 하나의 표지판이 불법 주정차 영역과 연관된 표지판인 것으로 결정되는 경우, 적어도 하나의 표지판에 기초하여 영역 중 적어도 일부의 영역을 불법 주정차 영역으로 판정한다. 본 발명의 일 실시예에 따르면, 적어도 하나의 표지판은 제1 표지판 및 제2 표지판을 포함한다. 제어부는, 제1 표지판의 위치와 제2 표지판의 위치의 사이 구간을 불법 주정차 영역으로 판정한다. 본 발명의 일 실시예에 따르면, 제어부는, 학습된 제1 인공신경망 모델에 적어도 하나의 표지판과 연관된 이미 지를 제공하여 불법 주정차 영역과 연관된 표지판인지 여부를 결정한다. 본 발명의 일 실시예에 따르면, 제어부는, 불법 주정차 영역 상에 차량이 사전 결정된 임계값 이상 포함되는지 여부를 인식하고, 차량이 사전 결정된 임계값 이상 포함되는 경우, 불법 주정차인 것으로 결정한다. 본 발명의 일 실시예에 따르면, 제어부는, 차량이 불법 주정차인 것으로 결정되는 경우, 차량의 차량 번호를 인 식하고, 인식된 차량 번호를 이용하여 불법 주정차 신고를 전송한다. 본 발명의 일 실시예에 따르면, 제어부는, 학습된 제2 인공신경망 모델에 차량의 번호판과 연관된 이미지를 제 공하여 차량 번호를 인식한다.본 발명의 일 실시예에 따르면, 제어부는, 제1 시각에 차량 번호를 인식하고, 제1 시각 이후의 제2 시각에 차량 번호를 재인식하고, 제1 시각 및 제2 시각에 차량 번호가 인식되는 경우, 불법 주정차 신고를 전송한다. 본 발명의 일 실시예에 따르면, 제어부는, 제1 시각에 차량 번호가 인식되는 경우, 제1 시각과 제2 시각 사이에 불법 주정차 경고 방송을 송출한다."}
{"patent_id": "10-2023-0065540", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 다양한 실시예에서 이동 로봇은 자율 주행하며 불법 주정차 영역을 실시간을 판단할 수 있으며, 불법 주정차 영역에 주차된 차량에 대한 신고 등 자동적인 조치를 효과적으로 수행할 수 있다. 본 발명의 다양한 실시예에서 이동 로봇은 표지판에 도시된 내용을 기초로 불법 주정차 영역을 간단히 식별할 수 있다. 본 발명의 다양한 실시예에서 불법 주정차 영역을 주행 맵 상에 설정하여 이용하는 경우, 이동 로봇은 불법 주 정차 영역에 진입하는 것을 간단히 인식할 수 있으며, 이를 기초로 집중적인 불법 주정차 단속이 수행될 수 있 다."}
{"patent_id": "10-2023-0065540", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과는 이상에서 언급한 효과로 제한되지 않으며, 언급되지 않은 다른 효과들은 청구범위의 기재로부"}
{"patent_id": "10-2023-0065540", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 3, "content": "터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자(\"통상의 기술자\"라 함)에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0065540", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 실시를 위한 구체적인 내용을 첨부된 도면을 참조하여 상세히 설명한다. 다만, 이하의 설명에 서는 본 발명의 요지를 불필요하게 흐릴 우려가 있는 경우, 널리 알려진 기능이나 구성에 관한 구체적 설명은 생략하기로 한다. 첨부된 도면에서, 동일하거나 대응하는 구성요소에는 동일한 참조부호가 부여되어 있다. 또한, 이하의 실시예들 의 설명에 있어서, 동일하거나 대응되는 구성요소를 중복하여 기술하는 것이 생략될 수 있다. 그러나, 구성요소 에 관한 기술이 생략되어도, 그러한 구성요소가 어떤 실시예에 포함되지 않는 것으로 의도되지는 않는다. 개시된 실시예의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 후술되어 있는 실시예 들을 참조하면 명확해질 것이다. 그러나, 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 발명이 완전하도록 하고, 본 발명이 통상의 기술 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것일 뿐이다. 본 명세서에서 사용되는 용어에 대해 간략히 설명하고, 개시된 실시예에 대해 구체적으로 설명하기로 한다. 본 명세서에서 사용되는 용어는 본 발명에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을선택하였으나, 이는 관련 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 발명의 설명 부분에서 상 세히 그 의미를 기재할 것이다. 따라서, 본 발명에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가지는 의미와 본 발명의 전반에 걸친 내용을 토대로 정의되어야 한다. 본 명세서에서의 단수의 표현은 문맥상 명백하게 단수인 것으로 특정하지 않는 한, 복수의 표현을 포함한다. 또 한, 복수의 표현은 문맥상 명백하게 복수인 것으로 특정하지 않는 한, 단수의 표현을 포함한다. 명세서 전체에 서 어떤 부분이 어떤 구성요소를 포함한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제 외하는 것이 아니라 다른 구성요소를 더 포함할 수 있음을 의미한다. 본 발명에서, \"포함하다\", \"포함하는\" 등의 용어는 특징들, 단계들, 동작들, 요소들 및/또는 구성 요소들이 존 재하는 것을 나타낼 수 있으나, 이러한 용어가 하나 이상의 다른 기능들, 단계들, 동작들, 요소들, 구성 요소들 및/또는 이들의 조합이 추가되는 것을 배제하지는 않는다. 본 발명에서, 특정 구성 요소가 임의의 다른 구성 요소에 \"결합\", \"조합\", \"연결\" 되거나, \"반응\" 하는 것으로 언급된 경우, 특정 구성 요소는 다른 구성 요소에 직접 결합, 조합 및/또는 연결되거나, 반응할 수 있으나, 이 에 한정되지 않는다. 예를 들어, 특정 구성 요소와 다른 구성 요소 사이에 하나 이상의 중간 구성 요소가 존재 할 수 있다. 또한, 본 발명에서 \"및/또는\"은 열거된 하나 이상의 항목의 각각 또는 하나 이상의 항목의 적어도 일부의 조합을 포함할 수 있다. 본 발명에서, \"제1\", \"제2\" 등의 용어는 특정 구성 요소를 다른 구성 요소와 구별하기 위해 사용되는 것으로, 이러한 용어에 의해 상술된 구성 요소가 제한되진 않는다. 예를 들어, \"제1\" 구성 요소는 \"제2\" 구성 요소와 동 일하거나 유사한 형태의 요소일 수 있다. 본 발명에서, \"표지판\"은 운전자 또는 보행자 등에게 주의나 경고를 알리기 위한 시각 매체를 지칭할 수 있다. 또한, \"불법 주정차와 연관된 표지판\"은 법상 주정차가 금지된 영역을 나타내는 표지판으로서, 예를 들어, 어린 이 보호 구역 표지판, 노인 보호 구역 표지판, 장애인 보호 구역 표지판, 주정차 금지 표지판 등을 포함할 수 있으나, 이에 한정되지 않는다. 도 1은 본 발명의 일 실시예에 따른 이동 로봇의 내부 구성을 나타내는 기능적인 블록도이다. 도시된 바와 같이, 이동 로봇은 주행 맵을 기반으로 일정 구간을 순찰하는 자율 주행 로봇을 지칭하는 것으로, 이동 로 봇 주변의 상황과 연관된 센싱 데이터를 획득하기 위한 적어도 하나의 센서, 제어부, 제어부 의 명령에 기초하여 이동 로봇을 구동시키는 구동부 등을 포함할 수 있으나, 이에 한정되지 않 는다. 또한, 제어부는 불법 주정차 영역 결정부, 불법 주정차 판정부, 불법 주정차 처리부 등을 포함하는 것으로 도시되었으나, 이에 한정되지 않는다. 일 실시예에 따르면, 이동 로봇은 다양한 센서를 이용하여 이동 로봇의 주위 환경을 감지할 수 있다. 예를 들어, 이동 로봇은 차량 등의 주변 객체를 검출하거나, 표지판 등을 식별하기 위한 센서로서 카메라 센서, 라이다 센서, 레이더 센서 등을 포함할 수 있으나, 이에 한정되지 않는다. 예를 들어, 이동 로봇 은 이동 로봇의 위치를 검출하기 위한 GNSS(global navigation satellite system) 센서 등을 더 포 함할 수 있다. 일 실시예에 따르면, 이동 로봇은 센서로부터 획득된 센싱 데이터를 이용하여 차량의 불법 주정차 여 부를 결정할 수 있다. 이를 위해, 이동 로봇은 이동 로봇이 주행하는 주행 영역에 대응하는 주행 맵 을 추출하고, 이동 로봇으로부터 획득된 센싱 데이터에 기초하여 주행 영역 중 적어도 일부의 영역이 불법 주정차 영역인지 여부를 판정할 수 있다. 그리고 나서, 해당 영역이 불법 주정차 영역인 것으로 판정되는 경우, 이동 로봇은 추출된 주행 맵 상에 불법 주정차 영역을 설정하고, 불법 주정차 영역이 설정된 주행 맵을 이 용하여 차량의 불법 주정차 여부를 결정할 수 있다. 일 실시예에 따르면, 제어부는 GNSS 센서 등을 이용하여 이동 로봇의 위치를 추출하고, 이동 로봇 의 위치에서 사전 결정된 거리 이내의 영역에 대응하는 주행 맵을 추출할 수 있다. 그리고 나서, 제어부 의 불법 주정차 영역 결정부는 이동 로봇이 주행하는 주행 영역 중 적어도 일부의 영역을 불법 주정차 영역으로 결정할 수 있다. 일 실시예에 따르면, 불법 주정차 영역 결정부는 적어도 하나의 센서를 이용하여 이동 로봇이 주행하는 영역 상의 적어도 하나의 표지판을 식별하고, 식별된 적어도 하나의 표지판이 불법 주정차 영역과 연 관된 표지판인지 여부를 결정할 수 있다. 여기서, 불법 주정차 영역 결정부는 학습된 인공신경망 모델에적어도 하나의 표지판과 연관된 이미지를 제공하여 불법 주정차 영역과 연관된 표지판인지 여부를 결정할 수 있 으나, 이에 한정되지 않는다. 적어도 하나의 표지판이 불법 주정차 영역과 연관된 표지판인 것으로 결정되는 경 우, 불법 주정차 영역 결정부는 적어도 하나의 표지판에 기초하여 주행 영역 중 적어도 일부의 영역을 불 법 주정차 영역으로 판정할 수 있다. 일 실시예에 따르면, 불법 주정차 영역 결정부는 불법 주정차 영역과 연관된 제1 표지판 및 제2 표지판을 식별하고, 제1 표지판의 위치와 제2 표지판의 위치의 사이 구간을 불법 주정차 영역으로 판정할 수 있다. 예를 들어, 불법 주정차 영역 결정부는 어린이 보호 구역이 시작되는 것을 알리는 제1 표지판과 어린이 보호 구 역이 해제되는 것을 알리는 제2 표지판 사이의 구간을 불법 주정차 영역으로 판정할 수 있다. 이와 같이 불법 주정차 영역이 결정되면, 불법 주정차 영역 결정부는 추출된 주행 맵 상에 불법 주정차 영 역을 설정할 수 있다. 불법 주정차 영역이 설정된 주행 맵을 이용하여 이동 로봇이 주행하는 경우, 이동 로봇은 설정된 불법 주정차 영역 상에 차량이 존재하는지 여부를 간단히 인식할 수 있다. 일 실시예에 따르면, 제어부의 불법 주정차 판정부는 결정된 불법 주정차 영역 상에 차량이 존재하는 지 여부를 기초로 해당 차량의 불법 주정차 여부를 판정할 수 있다. 예를 들어, 불법 주정차 판정부는 불 법 주정차 영역 상에 차량이 사전 결정된 임계값(예: 50%) 이상 포함되는지 여부를 인식하고, 차량이 사전 결정 된 임계값 이상 포함되는 경우, 불법 주정차인 것으로 결정할 수 있다. 예를 들어, 차량이 불법 주정차가 시작 되거나 해제되는 지점에 주차되어 있는 경우, 이동 로봇은 해당 차량이 불법 주정차 영역 상에 포함되는 부분의 비율에 기초하여 해당 차량의 불법 주정차 여부를 판정할 수 있다. 일 실시예에 따르면, 제어부의 불법 주정차 처리부는 차량이 불법 주정차인 것으로 결정되는 경우, 차량의 차량 번호를 인식할 수 있다. 예를 들어, 불법 주정차 처리부는 학습된 인공신경망 모델에 차량의 번호판과 연관된 이미지를 제공하여 차량 번호를 인식하거나 추출될 수 있다. 그리고 나서, 불법 주정차 처리부 는 인식된 차량 번호를 이용하여 불법 주정차 신고를 전송할 수 있다. 예를 들어, 불법 주정차 신고는 관 련 지자체 및/또는 관제 센터로 전송되는 것으로, 차량의 주정차 위치, 차량 번호 및/또는 차량 이미지를 포함 할 수 있다. 일 실시예에 따르면, 불법 주정차 처리부는 제1 시각에 차량 번호를 인식하고, 제1 시각 이후의 제2 시각 에 차량 번호를 재인식할 수 있다. 그리고 나서, 불법 주정차 처리부는 제1 시각 및 제2 시각에 동일한 차 량 번호가 인식되는 경우, 불법 주정차 신고를 전송할 수 있다. 즉, 불법 주정차 처리부는 일정 시간 동안 지속적으로 차량이 불법 주정차 영역에 주차된 것을 확인하기 위해 2회 이상 차량 번호를 인식하고, 동일한 차 량 번호가 반복적으로 인식되는 경우에 불법 주정차 신고를 전송할 수 있다. 추가적으로 또는 대안적으로, 불법 주정차 처리부는 제1 시각에 차량 번호가 인식되는 경우, 제1 시각과 제2 시각 사이에 불법 주정차 경고 방송을 송출할 수 있다. 예를 들어, 불법 주정차 처리부는 이동 로봇 의 송출 장치를 통해 \"12가 3456 차량 이동 조치 바랍니다.\" 와 같은 음성을 송출하여 불법 주정차 경고 방송을 수행할 수 있다. 도 1에서는 이동 로봇에 포함된 각각의 기능적인 구성이 구분되어 상술되었으나, 이는 발명의 이해를 돕기 위한 것일 뿐이며, 하나의 연산 장치에서 둘 이상의 기능을 수행할 수도 있다. 이와 같은 구성에 의해, 이동 로 봇은 자율 주행하며 불법 주정차 영역을 실시간을 판단할 수 있으며, 불법 주정차 영역에 주차된 차량에 대한 신고 등 자동적인 조치를 효과적으로 수행할 수 있다. 도 2는 본 발명의 일 실시예에 따른 이동 로봇이 불법 주정차 영역을 결정하는 예시를 나타내는 도면 이다. 일 실시예에 따르면, 이동 로봇은 자율 주행하며 카메라 등으로 전방 이미지를 촬영하고, 객체 인식 알고리즘 등으로 전방 이미지에서 표지판 이미지를 추출할 수 있다. 그리고 나서, 이동 로봇은 추출된 표 지판 이미지에 포함된 문자를 인식하여 해당 표지판이 불법 주정차 영역과 연관된 어린이 보호 구역, 노인 보호 구역 또는 장애인 보호 구역 등의 표지판인지 여부를 판정할 수 있다. 인식된 표지판이 불법 주정차 영역과 연관된 표지판인 것으로 결정되는 경우, 이동 로봇은 해당 표지판에 기초하여 주행 영역 중 적어도 일부의 영역을 불법 주정차 영역으로 판정할 수 있다. 도시된 것과 같이, 표지판은 어린이 보호 구역의 시작을 안내하기 위한 제1 표지판(210_1) 및 어린이 보호 구역의 해제를 안내하기 위한 제2 표지판(210_2)을 포함할 수 있다. 이 경우, 이동 로봇은 제1 표지판 (210_1) 및 제2 표지판(210_2)을 이용하여 불법 주정차 영역인 어린이 보호 구역의 범위를 설정할 수 있다. 예 를 들어, 이동 로봇은 제1 표지판(210_1)의 위치와 제2 표지판(210_2)의 위치의 사이 구간을 불법 주정차영역으로 판정할 수 있다. 도 2에서는 제1 표지판(210_1)으로부터 제2 표지판(210_2)까지의 구간이 불법 주정차 영역인 것으로 도시 되었으나, 이에 한정되지 않으며, 제1 표지판(210_1)의 위치와 제2 표지판(210_2)의 위치의 사이 구간에서 특정 크기만큼 확장된 범위가 불법 주정차 영역으로 결정될 수도 있다. 또한, 도 2에서는 표지판 만을 이용하여 불법 주정차 영역이 결정되는 것으로 상술되었으나, 이에 한정되지 않으며, 지면의 색상, 지면에 표시된 문자 등을 추가로 이용하여 불법 주정차 영역이 결정될 수도 있다. 이와 같은 구성에 의해, 이동 로봇은 표지판에 도 시된 내용을 기초로 불법 주정차 영역을 간단히 식별할 수 있다. 도 3은 본 발명의 일 실시예에 따른 이동 로봇과 연관된 주행 맵의 예시를 나타내는 도면이다. 상술된 것과 같 이, 이동 로봇은 주행 맵에 기초하여 특정 영역을 자율 주행하며 불법 주정차 여부를 단속할 수 있다. 예를 들 어, (a) 이미지와 같이 이동 로봇의 위치에서 사전 결정된 거리 이내의 영역에 대응하는 주행 맵이 추출될 수 있으며, 이동 로봇은 해당 주행 맵을 기초로 자율 주행할 수 있다. 일 실시예에 따르면, 이동 로봇은 센싱 데이터에 기초하여 영역 중 적어도 일부의 영역이 불법 주정차 영역인지 여부를 판정하고, 불법 주정차 영역인 것으로 판정되는 경우, 추출된 주행 맵 상에 불법 주정차 영역을 설 정할 수 있다. 예를 들어, (b) 이미지와 같이 주행 맵 상의 일부 영역이 불법 주정차 영역으로 설정될 수 있다. 즉, 이동 로봇은 주행 맵을 기초로 자율 주행하며 주행 도로 상의 표지판을 인식할 수 있으며, 표지판의 종류 및 내용을 기초로 해당 표지판이 불법 주정차 영역과 연관된 표지판인지 여부를 결정할 수 있다. 그리고 나서, 이동 로봇은 불법 주정차 영역의 시작 구간과 해제 구간을 확인한 후, 시작 구간에서 해제 구간까지의 영역을 불법 주정차 영역으로 결정할 수 있다. 이와 같이, 불법 주정차 영역이 결정된 경우, 이동 로봇은 주행 맵 상에 불법 주정차 영역을 업로드(upload)하여 구간 설정을 수행할 수 있다. 이와 같은 구성에 의해, 불법 주정차 영역을 주행 맵 상에 설정하여 이용하는 경우, 이동 로봇은 불법 주정차 영역에 진입하는 것을 간단히 인식할 수 있으며, 이를 기초로 집중적인 불법 주정차 단속이 수행될 수 있다. 도 4는 본 발명의 일 실시예에 따른 불법 주정차 영역 내의 차량 번호를 식별하는 예시를 나타내는 도면이다. 일 실시예에 따르면, 이동 로봇은 차량이 불법 주정차인 것으로 결정되는 경우 차량의 차량 번호를 인식하고, 인식된 차량 번호를 이용하여 불법 주정차 신고를 전송할 수 있다. 도시된 것과 같이, 이동 로봇은 불법 주정차 영역에 주정차된 차량을 촬영하여 차량 이미지를 획득하고, 획득된 차량 이미지에서 번호판 영역을 결정할 수 있다. 예를 들어, 이동 로봇은 차량 이미지에 포함된 번 호판에 대응하는 영역을 결정하고 해당 영역의 위치를 나타내는 좌표값을 추출하여 데이터 전처리 (preprocessing)를 수행할 수 있다. 즉, 이동 로봇은 임의의 객체 탐지 알고리즘 및/또는 기계학습 모델을 이용 하여 차량 이미지에서 번호판에 대응하는 영역을 검출하고 라벨링(labeling)할 수 있다. 그리고 나서, 이동 로봇은 결정된 번호판 영역의 문자를 인식하여 해당 차량의 차량 번호를 인식할 수 있다. 예를 들어, 이동 로봇은 문자 인식을 위한 학습된 인공신경망 모델에 차량의 번호판과 연관된 이미지 를 제공하여 차량 번호를 인식할 수 있으나, 이에 한정되지 않는다. 일 실시예에 따르면, 이동 로봇은 특정 시간 동안 반복하여 차량 번호를 인식할 수 있다. 예를 들어, 이동 로봇 은 제1 시각에 차량 번호를 인식할 수 있다. 이 경우, 이동 로봇은 인식된 차량 번호를 기초로 불법 주정차 경 고 방송을 송출할 수 있다. 그리고 나서, 이동 로봇은 제1 시각 이후의 제2 시각에 차량 번호를 재인식할 수 있 다. 이와 같이 경고 방송 이후에도 차량 번호가 재인식되는 경우, 이동 로봇은 인식된 차량 번호를 이용하여 불 법 주정차 신고를 전송할 수 있다. 도 5는 본 발명의 일 실시예에 따른 인공신경망 모델을 나타내는 예시도이다. 인공신경망 모델은, 기 계학습 모델의 일 예로서, 기계 학습(machine learning) 기술과 인지과학에서, 생물학적 신경망의 구조에 기초 하여 구현된 통계학적 학습 알고리즘 또는 그 알고리즘을 실행하는 구조이다. 일 실시예에 따르면, 인공신경망 모델은, 생물학적 신경망에서와 같이 시냅스의 결합으로 네트워크를 형성 한 인공 뉴런인 노드(node)들이 시냅스의 가중치를 반복적으로 조정하여, 특정 입력에 대응한 올바른 출력과 추 론된 출력 사이의 오차가 감소되도록 학습함으로써, 문제 해결 능력을 가지는 기계학습 모델을 나타낼 수 있다. 예를 들어, 인공신경망 모델은 기계 학습, 딥러닝 등의 인공지능 학습법에 사용되는 임의의 확률 모델, 뉴 럴 네트워크 모델 등을 포함할 수 있다.인공신경망 모델은 다층의 노드들과 이들 사이의 연결로 구성된 다층 퍼셉트론(multilayer perceptron, MLP)으로 구현될 수 있다. 본 실시예에 따른 인공신경망 모델은 MLP를 포함하는 다양한 인공신경망 모델 구조들 중의 하나를 이용하여 구현될 수 있으나, 이에 한정되지 않는다. 도 5에 도시된 바와 같이, 인공신경망 모델은, 외부로부터 입력 신호 또는 데이터를 수신하는 입력층, 입력 데이터에 대응한 출력 신 호 또는 데이터를 출력하는 출력층, 입력층과 출력층 사이에 위치하며 입력층으로부 터 신호를 받아 특성을 추출하여 출력층으로 전달하는 n개(여기서, n은 양의 정수)의 은닉층(530_1 내지 530_n)으로 구성된다. 여기서, 출력층은 은닉층(530_1 내지 530_n)으로부터 신호를 받아 외부로 출력한다. 인공신경망 모델의 학습 방법에는, 교사 신호(정답)의 입력에 의해서 문제의 해결에 최적화되도록 학습하 는 지도 학습(Supervised Learning) 방법과, 교사 신호를 필요로 하지 않는 비지도 학습(Unsupervised Learning) 방법이 있다. 일 실시예에 따르면, 인공신경망 모델의 입력변수는, 영상의 프레임, 각 영상에서 추출된 특징값 등을 포함할 수 있다. 이와 같이, 인공신경망 모델의 입력층과 출력층에 복수의 입력변수와 대응되는 복수의 출력변수 가 각각 매칭되고, 입력층, 은닉층(530_1 내지 530_n) 및 출력층에 포함된 노드들 사이의 시냅스 값 이 조정됨으로써, 특정 입력에 대응한 올바른 출력이 추출될 수 있도록 학습될 수 있다. 이러한 학습 과정을 통 해, 인공신경망 모델의 입력변수에 숨겨져 있는 특성을 파악할 수 있고, 입력변수에 기초하여 계산된 출력 변수와 목표 출력 간의 오차가 줄어들도록 인공신경망 모델의 노드들 사이의 시냅스 값(또는 가중치)를 조 정할 수 있다. 일 실시예에 따르면, 제1 인공신경망 모델은 적어도 하나의 표지판과 연관된 이미지를 제공받아 해당 표지판이 불법 주정차 영역과 연관된 표지판인지 여부를 결정할 수 있다. 또한, 제2 인공신경망 모델은 차량의 번호판과 연관된 이미지를 제공받아 불법 주정차된 차량의 차량 번호를 인식할 수 있다. 여기서, 제1 인공신경망 모델 및 /또는 제2 인공신경망 모델은 객체 탐지 모델로서, YOLO(you look only once) 기반의 모델일 수 있으나, 이에 한정되지 않는다. 도 6은 본 발명의 일 실시예에 따른 불법 주정차 여부 결정 방법의 예시를 나타내는 흐름도이다. 불법 주 정차 여부 결정 방법은 적어도 하나의 프로세서(예: 이동 로봇의 적어도 하나의 프로세서)에 의해 수행될 수 있다. 불법 주정차 여부 결정 방법은 프로세서가 이동 로봇이 주행하는 영역에 대응하는 주행 맵을 추 출함으로써 개시될 수 있다(S610). 예를 들어, 프로세서는 이동 로봇의 위치를 추출하고, 이동 로봇의 위치에서 사전 결정된 거리 이내의 영역에 대응하는 주행 맵을 추출할 수 있다. 프로세서는 이동 로봇으로부터 획득된 센싱 데이터에 기초하여 영역 중 적어도 일부의 영역이 불법 주정차 영역 인지 여부를 판정할 수 있다(S620). 또한, 프로세서는 불법 주정차 영역인 것으로 판정되는 경우, 추출된 주행 맵 상에 불법 주정차 영역을 설정할 수 있다(S630). 예를 들어, 프로세서는 적어도 하나의 센서를 이용하여 이 동 로봇이 주행하는 영역 상의 적어도 하나의 표지판을 식별할 수 있다. 그리고 나서, 프로세서는 식별된 적어 도 하나의 표지판이 불법 주정차 영역과 연관된 표지판인지 여부를 결정하고, 적어도 하나의 표지판이 불법 주 정차 영역과 연관된 표지판인 것으로 결정되는 경우, 적어도 하나의 표지판에 기초하여 영역 중 적어도 일부의 영역을 불법 주정차 영역으로 판정할 수 있다. 여기서, 프로세서는 학습된 제1 인공신경망 모델에 적어도 하나 의 표지판과 연관된 이미지를 제공하여 불법 주정차 영역과 연관된 표지판인지 여부를 결정할 수 있다. 프로세서는 불법 주정차 영역이 설정된 주행 맵을 이용하여 차량의 불법 주정차 여부를 결정할 수 있다(S640). 예를 들어, 프로세서는 불법 주정차 영역 상에 차량이 사전 결정된 임계값 이상 포함되는지 여부를 인식하고, 차량이 사전 결정된 임계값 이상 포함되는 경우, 불법 주정차인 것으로 결정할 수 있다. 도 7은 본 발명의 일 실시예에 따른 불법 주정차 단속 방법의 예시를 나타내는 흐름도이다. 불법 주정차 단속 방법은 적어도 하나의 프로세서(예: 이동 로봇의 적어도 하나의 프로세서)에 의해 수행될 수 있다. 불법 주정차 단속 방법은 차량이 불법 주정차인 것으로 결정되는 경우 프로세서가 차량의 차량 번호를 인 식함으로써 개시될 수 있다(S710). 예를 들어, 프로세서는 학습된 제2 인공신경망 모델에 차량의 번호판과 연관 된 이미지를 제공하여 차량 번호를 인식할 수 있다. 프로세서는 인식된 차량 번호를 이용하여 불법 주정차 신고를 전송할 수 있다(S720). 예를 들어, 불법 주정차 신고는 관련 지자체 및/또는 관제 센터로 전송되는 것으로, 차량의 주정차 위치, 차량 번호 및 차량 이미지를 포함할 수 있다. 추가적으로 또는 대안적으로, 프로세서는 제1 시각에 차량 번호를 인식하고, 제1 시각 이후의 제2 시각에 차량 번호를 재인식할 수 있다. 그리고 나서, 프로세서는 제1 시각 및 제2 시각에 차량 번호가 인식되는 경우, 불법 주정차 신고를 전송할 수 있다. 추가적으로 또는 대안적으로, 프로세서는 제1 시각에 차량 번 호가 인식되는 경우, 제1 시각과 제2 시각 사이에 불법 주정차 경고 방송을 송출할 수 있다. 상술된 방법 및/또는 다양한 실시예들은, 디지털 전자 회로, 컴퓨터 하드웨어, 펌웨어, 소프트웨어 및/또는 이 들의 조합으로 실현될 수 있다. 본 발명의 다양한 실시예들은 데이터 처리 장치, 예를 들어, 프로그래밍 가능한 하나 이상의 프로세서 및/또는 하나 이상의 컴퓨팅 장치에 의해 실행되거나, 컴퓨터 판독 가능한 기록 매체 및/ 또는 컴퓨터 판독 가능한 기록 매체에 저장된 컴퓨터 프로그램으로 구현될 수 있다. 상술된 컴퓨터 프로그램은 컴파일된 언어 또는 해석된 언어를 포함하여 임의의 형태의 프로그래밍 언어로 작성될 수 있으며, 독립 실행형 프로그램, 모듈, 서브 루틴 등의 임의의 형태로 배포될 수 있다. 컴퓨터 프로그램은 하나의 컴퓨팅 장치, 동일 한 네트워크를 통해 연결된 복수의 컴퓨팅 장치 및/또는 복수의 상이한 네트워크를 통해 연결되도록 분산된 복 수의 컴퓨팅 장치를 통해 배포될 수 있다. 상술된 방법 및/또는 다양한 실시예들은, 입력 데이터를 기초로 동작하거나 출력 데이터를 생성함으로써, 임의 의 기능, 함수 등을 처리, 저장 및/또는 관리하는 하나 이상의 컴퓨터 프로그램을 실행하도록 구성된 하나 이상 의 프로세서에 의해 수행될 수 있다. 예를 들어, 본 발명의 방법 및/또는 다양한 실시예는 FPGA(Field Programmable Gate Array) 또는 ASIC(Application Specific Integrated Circuit)과 같은 특수 목적 논리 회로 에 의해 수행될 수 있으며, 본 발명의 방법 및/또는 실시예들을 수행하기 위한 장치 및/또는 시스템은 FPGA 또 는 ASIC와 같은 특수 목적 논리 회로로서 구현될 수 있다. 컴퓨터 프로그램을 실행하는 하나 이상의 프로세서는, 범용 목적 또는 특수 목적의 마이크로 프로세서 및/또는 임의의 종류의 디지털 컴퓨팅 장치의 하나 이상의 프로세서를 포함할 수 있다. 프로세서는 읽기 전용 메모리, 랜덤 액세스 메모리의 각각으로부터 명령 및/또는 데이터를 수신하거나, 읽기 전용 메모리와 랜덤 액세스 메모 리로부터 명령 및/또는 데이터를 수신할 수 있다. 본 발명에서, 방법 및/또는 실시예들을 수행하는 컴퓨팅 장치 의 구성 요소들은 명령어들을 실행하기 위한 하나 이상의 프로세서, 명령어들 및/또는 데이터를 저장하기 위한 하나 이상의 메모리 디바이스를 포함할 수 있다. 일 실시예에 따르면, 컴퓨팅 장치는 데이터를 저장하기 위한 하나 이상의 대용량 저장 장치와 데이터를 주고받 을 수 있다. 예를 들어, 컴퓨팅 장치는 자기 디스크(magnetic disc) 또는 광 디스크(optical disc)로부터 데이 터를 수신하거나/수신하고, 자기 디스크 또는 광 디스크로 데이터를 전송할 수 있다. 컴퓨터 프로그램과 연관된 명령어들 및/또는 데이터를 저장하기에 적합한 컴퓨터 판독 가능한 저장 매체는, EPROM(Erasable Programmable Read-Only Memory), EEPROM(Electrically Erasable PROM), 플래시 메모리 장치 등의 반도체 메모리 장치를 포 함하는 임의의 형태의 비 휘발성 메모리를 포함할 수 있으나, 이에 한정되지 않는다. 예를 들어, 컴퓨터 판독 가능한 저장 매체는 내부 하드 디스크 또는 이동식 디스크와 같은 자기 디스크, 광 자기 디스크, CD-ROM 및 DVD-ROM 디스크를 포함할 수 있다. 사용자와의 상호 작용을 제공하기 위해, 컴퓨팅 장치는 정보를 사용자에게 제공하거나 디스플레이하기 위한 디 스플레이 장치(예를 들어, CRT (Cathode Ray Tube), LCD(Liquid Crystal Display) 등) 및 사용자가 컴퓨팅 장 치 상에 입력 및/또는 명령 등을 제공할 수 있는 포인팅 장치(예를 들어, 키보드, 마우스, 트랙볼 등)를 포함할 수 있으나, 이에 한정되지 않는다. 즉, 컴퓨팅 장치는 사용자와의 상호 작용을 제공하기 위한 임의의 다른 종류 의 장치들을 더 포함할 수 있다. 예를 들어, 컴퓨팅 장치는 사용자와의 상호 작용을 위해, 시각적 피드백, 청각 피드백 및/또는 촉각 피드백 등을 포함하는 임의의 형태의 감각 피드백을 사용자에게 제공할 수 있다. 이에 대 해, 사용자는 시각, 음성, 동작 등의 다양한 제스처를 통해 컴퓨팅 장치로 입력을 제공할 수 있다. 본 발명에서, 다양한 실시예들은 백엔드 구성 요소(예: 데이터 서버), 미들웨어 구성 요소(예: 애플리케이션 서 버) 및/또는 프론트 엔드 구성 요소를 포함하는 컴퓨팅 시스템에서 구현될 수 있다. 이 경우, 구성 요소들은 통 신 네트워크와 같은 디지털 데이터 통신의 임의의 형태 또는 매체에 의해 상호 연결될 수 있다. 예를 들어, 통 신 네트워크는 LAN(Local Area Network), WAN(Wide Area Network) 등을 포함할 수 있다. 본 명세서에서 기술된 예시적인 실시예들에 기반한 컴퓨팅 장치는, 사용자 디바이스, 사용자 인터페이스(UI) 디 바이스, 사용자 단말 또는 클라이언트 디바이스를 포함하여 사용자와 상호 작용하도록 구성된 하드웨어 및/또는 소프트웨어를 사용하여 구현될 수 있다. 예를 들어, 컴퓨팅 장치는 랩톱(laptop) 컴퓨터와 같은 휴대용 컴퓨팅 장치를 포함할 수 있다. 추가적으로 또는 대안적으로, 컴퓨팅 장치는, PDA(Personal Digital Assistants), 태 블릿 PC, 게임 콘솔(game console), 웨어러블 디바이스(wearable device), IoT(internet of things) 디바이스, VR(virtual reality) 디바이스, AR(augmented reality) 디바이스 등을 포함할 수 있으나, 이에 한정되지 않는 다. 컴퓨팅 장치는 사용자와 상호 작용하도록 구성된 다른 유형의 장치를 더 포함할 수 있다. 또한, 컴퓨팅 장치는 이동 통신 네트워크 등의 네트워크를 통한 무선 통신에 적합한 휴대용 통신 디바이스(예를 들어, 이동 전 화, 스마트 전화, 무선 셀룰러 전화 등) 등을 포함할 수 있다. 컴퓨팅 장치는, 무선 주파수(RF; Radio Frequency), 마이크로파 주파수(MWF; Microwave Frequency) 및/또는 적외선 주파수(IRF; Infrared Ray Frequency)와 같은 무선 통신 기술들 및/또는 프로토콜들을 사용하여 네트워크 서버와 무선으로 통신하도록 구 성될 수 있다. 본 발명에서 특정 구조적 및 기능적 세부 사항을 포함하는 다양한 실시예들은 예시적인 것이다. 따라서, 본 발 명의 실시예들은 상술된 것으로 한정되지 않으며, 여러 가지 다른 형태로 구현될 수 있다. 또한, 본 발명에서 사용된 용어는 일부 실시예를 설명하기 위한 것이며 실시예를 제한하는 것으로 해석되지 않는다. 예를 들어, 단 수형 단어 및 상기는 문맥상 달리 명확하게 나타내지 않는 한 복수형도 포함하는 것으로 해석될 수 있다. 본 발명에서, 달리 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함하여 본 명세서에서 사용되는 모든 용 어는 이러한 개념이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의 미를 갖는다. 또한, 사전에 정의된 용어와 같이 일반적으로 사용되는 용어들은 관련 기술의 맥락에서의 의미와 일치하는 의미를 갖는 것으로 해석되어야 한다."}
{"patent_id": "10-2023-0065540", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "본 명세서에서는 본 발명이 일부 실시예들과 관련하여 설명되었지만, 본 발명의 발명이 속하는 기술분야의 통상 의 기술자가 이해할 수 있는 본 발명의 범위를 벗어나지 않는 범위에서 다양한 변형 및 변경이 이루어질 수 있 다. 또한, 그러한 변형 및 변경은 본 명세서에 첨부된 특허청구의 범위 내에 속하는 것으로 생각되어야 한다."}
{"patent_id": "10-2023-0065540", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 발명의 실시예들은, 이하 설명하는 첨부 도면들을 참조하여 설명될 것이며, 여기서 유사한 참조 번호는 유사 한 요소들을 나타내지만, 이에 한정되지는 않는다. 도 1은 본 발명의 일 실시예에 따른 이동 로봇의 내부 구성을 나타내는 기능적인 블록도이다. 도 2는 본 발명의 일 실시예에 따른 이동 로봇이 불법 주정차 영역을 결정하는 예시를 나타내는 도면이다. 도 3은 본 발명의 일 실시예에 따른 이동 로봇과 연관된 주행 맵의 예시를 나타내는 도면이다. 도 4는 본 발명의 일 실시예에 따른 불법 주정차 영역 내의 차량 번호를 식별하는 예시를 나타내는 도면이다. 도 5는 본 발명의 일 실시예에 따른 인공신경망 모델을 나타내는 예시도이다. 도 6은 본 발명의 일 실시예에 따른 불법 주정차 여부 결정 방법의 예시를 나타내는 흐름도이다. 도 7은 본 발명의 일 실시예에 따른 불법 주정차 단속 방법의 예시를 나타내는 흐름도이다."}
