{"patent_id": "10-2018-0162300", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0073761", "출원번호": "10-2018-0162300", "발명의 명칭": "임대물 내의 시설물의 파손 정보를 결정하기 위한 컴퓨팅 장치 및 방법", "출원인": "(주)슈가힐", "발명자": "윤준용"}}
{"patent_id": "10-2018-0162300", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "임대물 내의 시설물의 파손 정보를 결정하는 컴퓨팅 장치에 있어서,복수의 임대물 정보, 복수의 임대인 정보 및 복수의 임차인 정보를 연관시켜 저장하도록 구성된 데이터베이스;사용자 단말기로부터 임대물의 정보를 수신하도록 구성된 정보 등록 모듈;상기 사용자 단말기로부터의 사진 등록 요청에 응답하여, 상기 임대물 내의 시설물을 미리 결정된 가이드에 따라 촬영하도록 상기 사용자 단말기에게 요청하고, 상기 촬영된 사진을 수신하도록 구성된 사진 등록 모듈;상기 수신된 임대물의 정보와 상기 촬영된 사진을 타임스탬프와 연관시켜 상기 데이터베이스에 저장하도록 구성된 타임스탬프 모듈;상기 사용자 단말기로부터의 파손 정보 확인 요청에 응답하여, 제1 타임스탬프에 연관되어 저장된 상기 임대물내의 시설물의 촬영된 사진과 제2 타임스탬프에 연관되어 저장된 상기 임대물 내의 시설물의 촬영된 사진을 비교하여 상기 임대물 내의 시설물의 파손 정보를 결정하도록 구성된 파손 확인 모듈; 및상기 파손 확인 모듈에 의해 결정된 상기 임대물 내의 시설물 파손 정보를 상기 사용자 단말기 및 상기 임대물의 소유자 단말기 중 적어도 하나로 제공하도록 구성된 출력 모듈을 포함하는, 컴퓨팅 장치."}
{"patent_id": "10-2018-0162300", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 복수의 임대물 정보는, 임대 형태, 보증금, 계약 형태, 면적, 입주일, 임대물 내의 시설물의 사진 정보, 주소, 설계도, 방의 개수, 화장실의 개수 중 적어도 하나를 포함하는, 컴퓨팅 장치."}
{"patent_id": "10-2018-0162300", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 복수의 임대인 정보는,아이디, 주민등록번호, 주소, 애플리케이션을 통한 계약 건수, 허위매물 신고 횟수 중 적어도 하나를 포함하는,컴퓨팅 장치."}
{"patent_id": "10-2018-0162300", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 복수의 임차인 정보는, 아이디, 주민등록번호, 주소, 애플리케이션을 통한 계약 건수, 파손으로 인한 보상 횟수, 임차인 개인정보, 입주일, 퇴거예상일 중 적어도 하나를 포함하는, 컴퓨팅 장치."}
{"patent_id": "10-2018-0162300", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2020-0073761-3-제1항에 있어서,상기 데이터베이스에 저장된 복수의 임대물 정보, 복수의 임대인 정보 및 복수의 임차인 정보에 기초하여 매물정보를 요청하는 사용자 단말기에게 허위 매물이 자동으로 필터링되어 삭제된 매물 정보를 제공하도록 구성된매물 검수 모듈을 더 포함하는, 컴퓨팅 장치."}
{"patent_id": "10-2018-0162300", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 데이터베이스에 저장된 복수의 임대물 정보, 복수의 임대인 정보 및 복수의 임차인 정보에 기초하여 매물정보를 요청하는 사용자 단말기에게 매물을 추천하도록 구성된 매물 추천 모듈을 더 포함하는, 컴퓨팅 장치."}
{"patent_id": "10-2018-0162300", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 파손 확인 모듈은, 상기 제1 타임스탬프에 연관되어 저장된 상기 임대물 내의 시설물의 촬영된 사진과 상기 제2 타임스탬프에 연관되어 저장된 상기 임대물 내의 시설물의 촬영된 사진을 인공신경망의 입력층에 입력하여 상기 임대물의 파손 정보를 결정하도록 구성된, 컴퓨팅 장치."}
{"patent_id": "10-2018-0162300", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "컴퓨팅 장치에 의해 임대물 내의 시설물의 파손 정보를 결정하기 위한 방법에 있어서,복수의 임대물 정보, 복수의 임대인 정보 및 복수의 임차인 정보를 연관시켜 저장하도록 구성된 데이터베이스를준비하는 단계;사용자 단말기로부터 임대물의 정보를 수신하는 단계;상기 사용자 단말기로부터의 사진 등록 요청에 응답하여, 상기 임대물 내의 시설물을 미리 결정된 가이드에 따라 촬영하도록 상기 사용자 단말기에게 요청하고, 상기 촬영된 사진을 수신하는 단계;상기 수신된 임대물의 정보와 상기 촬영된 사진을 타임스탬프와 연관시켜 상기 데이터베이스에 저장하는 단계; 상기 사용자 단말기로부터 파손 정보 확인 요청에 응답하여, 이전에 저장된 상기 임대물 내의 시설물의 촬영된사진과 상기 타임스탬프에 연관되어 저장된 상기 임대물 내의 시설물의 촬영된 사진을 비교하여 상기 임대물 내의 시설물의 파손 정보를 결정하는 단계; 및상기 임대물 내의 시설물 파손 정보를 상기 사용자 단말기 및 상기 임대물의 소유자 단말기 중 적어도 하나로제공하는 단계를 포함하는, 임대물 내의 시설물의 파손 정보를 결정하는 방법."}
{"patent_id": "10-2018-0162300", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 임대물 내의 파손 정보를 결정하는 단계는,이전 저장된 상기 임대물 내의 시설물의 촬영된 사진과 상기 타임스탬프에 연관되어 저장된 상기 임대물 내의시설물의 촬영된 사진을 인공신경망의 입력층에 입력하여 상기 임대물의 파손 정보를 결정하는 단계를포함하는, 임대물 내의 시설물의 파손 정보를 결정하는 방법.공개특허 10-2020-0073761-4-청구항 10 제8항 내지 제9항 중 어느 한 항의 임대물 내의 시설물의 파손 정보를 결정하는 방법에 따른 각각의 단계를 수행하는 명령어를 포함하는 프로그램이 기록된, 컴퓨터 판독가능 저장매체."}
{"patent_id": "10-2018-0162300", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는, 임대물 내의 시설물의 파손 정보를 결정하는 컴퓨팅 장치를 제공한다. 이 시스템은, 복수의 임대물 정보, 복수의 임대인 정보 및 복수의 임차인 정보를 연관시켜 저장하도록 구성된 데이터베이스와 사용자 단말기 로부터 임대물의 정보를 수신하도록 구성된 정보 등록 모듈, 사용자 단말기로부터의 사진 등록 요청에 따라 촬영 (뒷면에 계속)"}
{"patent_id": "10-2018-0162300", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 임대물 내의 시설물의 파손 정보를 결정하기 위한 컴퓨팅 장치 및 방법에 관한 것으로, 보다 상세하 게는, 임대 시설물 및 옵션의 파손 정보를 결정하여 임차인 및/또는 임대인에게 임대물의 파손 위치를 포함한 파손 정보를 제공해주는 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2018-0162300", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "임대차란, 임대인과 임차인이 유상 및 채권적 방법으로 물건을 대차하는 것을 나타낸다. 임대인은 임대차계약 에서 임차인에게 임차 목적물을 사용 및/또는 수익할 수 있도록 해주고, 임차인은 임대인에게 그에 대한 대가로 차임(ex 보증금)을 지급한다. 통상적으로, 임대차 계약이 성립되면, 임차인은 임대인에게 일정 보증금을 지급 하고 임대차가 종료될 때까지 임대 시설물을 사용하다가 계약이 종료되고 보증금을 반환 받으면 임대차 관계는 종료된다. 또한, 임대인은 임차인에게 임대 시설물 본래의 용도에 사용할 수 있도록 유지 보수해 줘야 할 의무 가 있고, 임차인은 임대차 계약 종료 후 임대 시설물을 원상 복구해줘야 할 의무가 있다. 이러한 방식에서는, 임대차계약 기간 동안 임대 시설물의 파손이 있었을 때, 임대인은 임차인에게 계약 종료 후 파손에 대한 비용을 보증금에서 제외하고 임차인에게 돌려주는데, 임대인이 책정한 파손의 비용과 임차인이 책 정한 파손의 비용이 다를 수 있고, 임대 시설물의 파손이 아님에도 임대인 측에서 파손이라고 주장할 수 있다. 이러한 문제점을 해소하기 위하여, 임대인 및 임차인에게 정확한 파손 증빙 자료를 제공할 필요성이 있다."}
{"patent_id": "10-2018-0162300", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 명세서에 개시되는 실시예들은, 사용자에게 정확한 파손 정보 자료를 제공함으로써, 임대 시설물의 파손 위 치를 포함한 파손 정보를 객관적으로 판단할 수 있는 임대물 내의 시설물의 파손 정보를 결정하기 위한 컴퓨팅 장치 및 방법을 제공하고자 한다."}
{"patent_id": "10-2018-0162300", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시예에 따른 임대물 내의 시설물의 파손 정보를 결정하기 위한 컴퓨팅 장치는, 복수의 임대물 정보, 복수의 임대인 정보 및 복수의 임차인 정보를 연관시켜 저장하도록 구성된 데이터베이스, 사용자 단말기 로부터 임대물의 정보를 수신하도록 구성된 정보 등록 모듈, 사용자 단말기로부터의 사진 등록 요청에 응답하여, 상기 임대물 내의 시설물을 미리 결정된 가이드에 따라 촬영하도록 상기 사용자 단말기에게 요청하고, 상기 촬영된 사진을 수신하도록 구성된 사진 등록 모듈, 상기 수신된 임대물의 정보와 상기 촬영된 사진을 타임스탬프와 연관시켜 상기 데이터베이스에 저장하도록 구성된 타임스탬프 모듈, 상기 사용자 단말기로 부터 파손 정보 확인 요청에 응답하여, 제1 타임스탬프에 연관되어 저장된 상기 임대물 내의 시설물의 촬영된 사진과 제2 타임스탬프에 연관되어 저장된 상기 임대물 내의 시설물의 촬영된 사진을 비교하여 상기 임대물 내 의 시설물이 파손 정보를 결정하도록 구성된 파손 확인 모듈, 상기 파손 확인 모듈에 의해 결정된 상기 임대물 내의 시설물 파손 정보를 상기 사용자 단말기 및 상기 임대물의 소유자 단말기 중 적어도 하나로 제공하도록 구 성된 출력 모듈을 포함할 수 있다.또한, 본 개시의 일 실시예에 따른 컴퓨팅 장치에 의해 임대물 내의 시설물의 파손 정보를 결정하기 위한 방법 은, 복수의 임대물 정보, 복수의 임대인 정보 및 복수의 임차인 정보를 연관시켜 저장하도록 구성된 데이터베이 스를 준비하는 단계, 사용자 단말기로부터 임대물의 정보를 수신하는 단계, 사용자 단말기로부터의 사진 등록 요청에 응답하여, 상기 임대물 내의 시설물을 미리 결정된 가이드에 따라 촬영하도록 상기 사용자 단말기에게 요청하고, 상기 촬영된 사진을 수신하는 단계, 상기 수신된 임대물의 정보와 상기 촬영된 사진을 타임스탬프와 연관시켜 상기 데이터베이스에 저장하는 단계, 상기 사용자 단말기로부터 파손 정보 확인 요청에 응답하여, 이 전에 저장된 상기 임대물 내의 시설물의 촬영된 사진과 타임스탬프에 연관되어 저장된 상기 임대물 내의 시설물 의 촬영된 사진을 비교하여 상기 임대물 내의 시설물의 파손 정보를 결정하는 단계, 상기 임대물 내의 시설물 파손 정보를 상기 사용자 단말기 및 상기 임대물의 소유자 단말기 중 적어도 하나로 제공하는 단계를 포함할 수 있다."}
{"patent_id": "10-2018-0162300", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 일 실시예에 따른 임대물 내의 시설물의 파손 정보를 결정하기 위한 컴퓨팅 장치는, 사용자가 입주 시 가이드에 따라 촬영하도록 지시한 실시간 촬영 정보와 사용자가 퇴거 시의 촬영정보를 비교하여 임대물의 파 손 여부 및 파손 위치를 분석하여 사용자에게 정확한 파손 증빙 자료를 제공할 수 있다. 본 개시의 일부 실시예에 따르면, 임대물과 관련된 정보 또는 데이터를 수집하여 수집된 빅데이터를 이용하여 개인화된 추천 중개 서비스 및 허위 매물 자동 검수 등의 서비스를 제공할 수 있다 본 개시의 효과는 이상에서 언급한 효과로 제한되지 않으며, 언급되지 않은 다른 효과들은 청구범위의 기재로부 터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2018-0162300", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 개시의 실시예들을 상세히 설명한다. 다만, 통상의 기술자는 이들 도면에 관 해 여기에 주어진 상세한 설명이 예시의 목적을 위함이며, 본 개시는 이들 제한된 실시예들을 넘어 확장된다는 것을 쉽게 이해할 것이다. 본 개시의 일 실시예에 따른 임대물 내의 시설물의 파손 정보를 결정하기 위한 시스템은, 사용자로부터 임대물 내의 시설물에 대한 정보와 사진 정보를 입력 받으면 임대물 내의 시설물의 파손 정보에 대한 분석을 수행한다. 예를 들어, 이 시스템은, 인공지능(머신러닝)의 방법 중 하나인 지도 학습(Supervised Learning), 비지도 학습 (Unsupervised Learning) 및 준지도 학습(Semi-supervised Learning) 중 적어도 하나를 이용하여, 임대물 내의 시설물의 파손 여부를 판단함으로써, 사용자와 임대인에게 파손 정보를 제공할 수 있다. 도 1은 본 개시의 일 실시예에 따른 사용자 단말기를 이용하여 임대물과 임대물 내의 시설물의 정보를 입 력하는 시스템의 예시도이다. 사용자 단말기의 인터페이스(예를 들어, 터치 디스플레이, 키보드, 마우스, 터치펜, 또는 스틸러스, 마이크로폰, 동작인식 센서 등)를 통하여 임대물과 임대물 내의 시설물에 대한 정보를 입력할 수 있다. 이 같은 정보 입력은, 사용자가 임대물에 입주하고 난 후 일정 기간 내에 입력한 제1 입력 정 보와 사용자와 임대인의 임대차계약이 만료한 후 일정 기간 및/또는 임대차계약이 만료하기 전의 일정 기간에 입력한 제2 입력 정보로, 최소 2회 이상 이루어질 수 있다. 임대물에 대한 정보 입력은, 사용자가 사용자 단말 기를 이용하여 입력한 정보, 즉, 주소, 임대물 구조, 입주일, 퇴거예상일, 계약 형태, 가이드에 따라 등록한 사 진 등을 나타내는 정보를 포함할 수 있다. 입력된 제1 입력 정보와 제2 입력 정보는, 타임스탬프와 연관되어져 각각 제1 타임스탬프와 제2 타임스탬프로 데이터베이스에 사용자별로 정렬되어 저장될 수 있다. 제1 타임스탬 프와 제2 타임스탬프가 생성이 되면, 임대물 내의 시설물의 파손 여부를 판단함으로써, 사용자와 임대인에게 파 손 정보를 제공할 수 있다. 여기서, 파손 정보는, 임대물 내의 시설물의 파손 여부, 임대물 내의 시설물 중 파 손 위치, 임대물 내의 기존 시설물과 현재 시설물 사이의 일치도 등의 정보를 포함할 수 있다. 일 실시예에서는, 사용자는 임대물과 임대물 내의 시설물의 정보를 입력하기 위해 사용자 단말기의 임대물 기본 정보 입력 화면에 주소, 임대물 구조, 입주일, 퇴거예상일, 계약 형태 등의 기본 정보를 입력할 수 있다. 기본 정보 입력이 완료되면, 임대물 기본 정보 입력 화면은 임대물 사진 정보 등록 화면으로 변경되고, 사용자는 임대물 사진 정보 등록 화면의 가이드에 따라 임대물의 사진을 촬영하여 등록할 수 있 다. 임대물 사진 정보 등록 화면의 가이드는, 임대물 기본 정보 입력 화면에서 입력된 임대물의 정 보 및/또는 데이터베이스에서 가져온 임대물의 정보를 바탕으로 미리 설정될 수 있다. 또 다른 사진 정보 등록 화면은, 가이드에 따라 하나의 임대물의 여러 장의 사진을 등록하고, 등록한 사진에 대한 메모를 추 가할 수 있다. 가이드에 따라 모든 임대물의 사진 촬영 등록이 완료되면, 등록된 사진과 메모를 함께 출력 할 수 있다. 임대물과 임대물 내의 시설물의 기본 정보와 사진 정보의 입력은, 사용자가 임대물에 입주 하고 난 후 일정 기간 내에 입력한 입주 시의 정보와 사용자와 임대인의 임대차계약이 만료한 후 일정 기간 및/ 또는 임대차계약이 만료하기 전의 일정 기간에 입력한 퇴거 시의 정보로 입력될 수 있으며 이 같은 입력은, 최 소 2회 이상 이루어질 수 있다. 입주 시의 정보와 퇴거 시의 정보는 타임스탬프와 연관되어져 각각 입주 시의 타임스탬프, 퇴거 시의 타임스탬프로 임대물 정보 DB에 사용자별로 정렬되어 저장될 수 있다. 입주 시의 타임 스탬프와 퇴거 시의 타임스탬프가 생성되고 임대물 정보 DB에 저장되면, 입주 시의 정보와 퇴거 시의 정보를 비 교하여 파손 정보가 출력되어 사용자와 임대인에게 제공될 수 있다. 다른 실시예에서, 사용자는 임대물에 입주 후, 일정 기간(ex 계약서에 명시 되어있는 입주일 전후 일주일) 내에 임대물 기본 정보 입력과 함께 가이드에 따라 촬영된 임대물 내의 시설물의 사진 정보를 등록할 수 있다. 예를 들어, 사용자가 사용자 단말기를 이용하여 임대물 기본 정보에 서울특별시 광진구 자양로 000-00, 거실1방 3화장실2, 2016년 10월 08일, 2018년 10월 8일, 전세를 입력하면 사용자 단말기는, 사용자가 직전에 입력 한 임대물 기본 정보 및/또는 데이터베이스에서 가져온 임대물의 정보에 기초하여 기 설정된 가이드를 표시할 수 있다. 예를 들어, 가이드는, 사용자가 입력한 거실1방3화장실2와 같은 임대물의 구조에 따라 기 설정된 \"화 장실1의 욕조를 찍어주세요\", \"방2의 벽을 찍어주세요.\"와 같이 사용자의 사용이나 부주의로 인해 파손이 발생 할 수 있는 부분을 촬영하도록 지시할 수 있다. 임대물의 기본 정보 입력과 사진 정보 입력이 완료되면, 타임 스탬프와 연관되어져 임대물 정보 DB에 사용자별로 정렬되어 저장될 수 있다. 이와 같은 정보 등록은, 사용자 가 임대물 계약이 만료되기 전의 일정 기간(ex 계약서에 명시 되어있는 퇴거예상일 전 일주일) 동안 다시한번 이루어질 수 있다. 시설물의 촬영을 지시하는 가이드는, 이전의 정보 입력 가이드와 동일하고, 입력 완료 후 타임스탬프와 연관되어져 임대물 정보 DB에 사용자 별로 정렬되어 저장될 수 있다. 또 다른 실시예에서, 사용자는 가이드에 따라 하나의 임대물의 여러 장의 사진을 등록하고, 등록한 사진에 대한 메모를 추가할 수 있다. 예를 들어, 도어락의 사진을 등록할 때, \"도어락은 흔들림없이 현관문에 잘 결속이 되어있어야 합니다.\"라는 가이드에 맞게 도어락이 잘 결속되어 있는지를 증명하는 여러 장의 사진을 등록할 수 있 다. 도어락 사진의 등록과 함께 의 사진을 등록함과 동시에 \"도어락 불빛이 안들어옵니다.\"와 같은 메모를 추 가하여 등록할 수 있다. 가이드에 따라 모든 임대물의 사진 촬영 등록이 완료되면, 임대물 별로 등록된 사진과 함께 메모를 출력할 수 있다. 도 2는 본 개시의 일 실시예에 따른 임대물 내의 시설물의 파손 정보를 결정하기 위한 컴퓨팅 장치의 개략도이 다. 본 실시예에서는, 컴퓨팅 장치는 서버 장치일 수 있으나, 이에 한정하지 않으며, 클라이언트 장치 등 과 같은 임의의 컴퓨팅 장치일 수 있다. 도 2에 도시된 시스템은, 사용자 단말기으로부터 사용자가 입력 한 임대물과 임대물 내의 시설물의 기본 정보와 사진 정보를 입력 받아 통신을 통해 서버장치로부터 임대 물 내의 시설물의 파손 정보 제공을 요청할 수 있다. 여기서, 사용자 단말기는, 사용자로부터 임대물 내 의 시설물의 파손 정보를 수신할 수 있으며 사용자로부터 임대물과 임대물 내의 시설물의 기본 정보와 사진 정 보를 수신할 수 있으며 사용자 인터페이스를 구비한 적절한 컴퓨팅 장치일 수 있다. 임대인 단말기는, 서 버장치로부터 임대물 내의 시설물의 파손 정보(예를 들어, 파손 여부, 파손 위치, 파손 정도 등에 대한 정 보)를 수신할 수 있고, 사용자 인터페이스를 구비한 적절한 컴퓨팅 장치일 수 있다. 예를 들어, 사용자 단말기 및/또는 임대인 단말기의 인터페이스는, 터치 디스플레이, 키보드, 마우스, 터치펜 또는 스틸러스, 마이크로폰, 동작 인식 센서 중의 하나 이상을 포함할 수 있으나, 이에 한정되 는 것은 아니다. 한편, 사용자 단말기 및 또는 임대인 단말기는, 개인용 컴퓨터, 스마트폰, 태블릿 컴퓨터 중의 어느 하나일수 있으나, 이에 한정되는 것은 아니다. 서버장치는, 임대물 정보, 임대인 정보, 임차인 정보를 데이터베이스에서 읽어올 수 있고, 이와 같이 읽어 온 정보에 기초하여 인공신경망을 학습시킴으로써, 사용자가 입력한 정보에 기초하여 임대물 내의 시설물의 파 손 정보를 생성할 수 있다. 여기서 서버장치는, 유선 또는 무선 네트워크를 통해 다른 장치와 통신할 수 있는 컴퓨팅 장치로서, CPU(central processing unit), GPU(graphic processing unit), DSP(digital signal processor) 등 중의 어느 하나를 이용하여 연산 동작을 수행할 수 있는 컴퓨팅 장치일수 있으나, 이에 한정되는 것은 아니다. 서버장치는, 파손 정보를 통신을 통해 사용자 단말기로 제공할 수 있으며, 이렇게 생 성된 파손 정보를 임대물별로 정렬하여 데이터베이스에 저장할 수 있다. 도 3은 본 개시의 일 실시예에 따른 서버장치의 개략도이다. 이하에서는, 서버장치의 구성요소들에 대하 여 좀 더 상세히 설명한다. 도 3에 도시된 바와 같이, 서버장치는, 통신 모듈, 프로세서, 데이 터베이스를 포함할 수 있다. 프로세서는, 정보 등록 모듈, 사진 등록 모듈, 타임스탬프 모듈, 파손 확인 모듈, 출력모듈, 매물 검수 모듈, 매물 추천 모듈을 포함할 수 있고, 데이터베이스는 임대물 정보 DB, 임대인 정보 DB, 임차인 정보 DB를 포함할 수 있다. 도 2에 도시된 서버장치는, 도 3에 도시된 서버장치의 기능 또는 구성 요소들 중에서, 앞서 상술한 도 2에서 설명된 것과 동일한 부재번호 또는 명칭을 갖는 구성요소들에 대해서는, 반복을 피하기 위해 상세한 설명을 생략할 수 있으며, 변경 또는 추가적인 부분만 설명할 수 있다. 데이터베이스는, 임대물의 임대 형태, 보증금, 계약형태, 임대물 면적, 입주일 등이 분류되어 저장되도록 구성된 임대물 정보 DB, 임대인의 아이디, 주민등록번호, 임대물 주소, 어플을 통한 계약 건수, 허위매물 신고 횟수 등이 분류되어 저장되도록 구성된 임대인 정보 DB, 임차인의 아이디, 주민등록번호, 주소, 어플 을 통한 계약 건수, 파손으로 인한 보상 횟수 등이 분류되어 저장되도록 구성된 임차인 정보 DB를 포함할 수 있다. 서버장치는, 복수의 사용자 단말기(110_1 내지 110_n) 및/또는 임대인 단말기(220_1 내지 110_n)로부터 주기적 또는 비주기적으로(예를 들어, 실시간으로) 임차인 및 임대인의 정보를 제공받아 각각 임 차인 정보 DB, 임대인 정보 DB에 저장할 수 있다. 일 실시예에서, 서버장치는, 임대물 정보 DB, 임대인 정보 DB, 임차인 정보 DB에서 매물의 정보와 중개업소의 정보를 읽을 수 있도록 구성된다. 또한, 임대물 정보 DB는, 임대물의 정보로부터 입주 시의 타임스탬프와 퇴거 시의 타임스탬프 정보를 추출하고, 각각의 정보를 비교하여 임대물 내의 시설물의 파손 정보를 출력할 수 있다. 이러한 임대물의 정보에 기초하여, 서버장치는, 인공신경망을, 예를 들어, 준 지 도 학습(Semi-supervised Learning) 방식으로 학습시킬 수 있다. 서버장치는, 학습된 인공신경망을 이용 하여, 사용자 단말기를 통해 입력 받은 임대물 내의 시설물의 기본 정보 및/또는 사진 정보에 기초하여, 임대물 내의 시설물의 파손 정보를 추론하여 생성할 수 있다. 서버장치는, 임대물 내의 시설물의 파손 정보를 통신을 통해 사용자 단말기(110_1 내지 110_n) 및/또는 임 대인 단말기(220_1 내지 220_n)로 제공할 수 있으며, 이렇게 생성된 임대물 내의 시설물의 파손 정보는 임대물정보 DB에 저장할 수 있다. 도 3에서는, 데이터베이스가 서버장치에 포함하는 것으로 도시되어 있으 나, 이에 한정되지 않으며, 구현예에 따라서 데이터베이스가 서버장치 외부에 별도로 존재하여 통신으로 연결될 수도 있다. 통신 모듈은, 사용자 단말기로부터 임대물 내의 시설물의 파손 정보 출력 요청을 수신할 수 있고, 요 청에 응답하여 출력모듈에 의해 양식에 맞게 출력된 임대물 내의 시설물의 파손 정보를 사용자 단말기 (110_1 내지 110_n) 및/또는 임대인 단말기(220_1 내지 220_n)로 제공할 수 있다. 임대물 내의 시설물의 파손 정보 출력 요청은, 사용자가 사용자 단말기를 통해 입주 시의 정보와 퇴거 시의 정보가 모두 입력된 후에 이루어질 수 있다. 통신 모듈은, 이러한 사용자 입력 정보를 포함하는 임대물 내의 시설물의 파손 정보 출력 요청을 프로세서로 전송할 수 있다. 일 실시예에 따르면, 사용자는 사용자 단말기를 통해 입주 시의 임대물 정보와 퇴거 시의 임대물 정보를 입력하여 임대물 내의 시설물의 파손 정보 출력을 요청할 수 있다. 예를 들어, 사용자가 입주 시에 기 설정된 가이드(ex \"화장실1의 욕조를 찍어주세요\")에 따라 촬영한 사진 정보와 사용자가 퇴거 시에 입주 시와 동일한 가이드(ex \"화장실1의 욕조를 찍어주세요\")에 따라 촬영한 사진 정보를 서버장치의 프로세서로 전송 할 수 있다. 정보 등록 모듈은, 사용자가 사용자 단말기를 통해, 임대물의 주소, 임대물 구조, 입주일, 퇴거예상 일, 계약 형태와 같은 임대물의 기본 정보를 수신할 수 있다. 또한 정보 등록 모듈은, 임대물의 기본 정 보 수신이 완료되면, 임대물 내의 시설물의 사진 촬영을 위해 사진 등록 모듈을 불러올 수 있다. 정보 등 록 모듈에 의해 수신된 임대물의 기본 정보는, 임대물 정보 DB에 저장될 수 있다. 사진 등록 모듈은, 사용자 단말기로부터의 임대물 내의 시설물의 사진 정보 등록 요청에 응답하여, 정보 등록 모듈에서 수신된 임대물의 기본 정보 및/또는 데이터베이스에서 가져온 임대물의 정보에 기초하 여 기 설정된 가이드를 사용자 단말기로 출력할 수 있다. 이때, 사진 정보 등록은, 정보 등록 모듈 에서 수신한 입주일의 일정 기간(ex 계약서에 명시 되어있는 입주일 전후 일주일) 동안에만 가능할 수 있다. 사진 정보 등록이 가능한 기간이면 출력된 가이드에 따라, 사용자는 임대물 내의 시설물의 사진을 촬영하고, 사 진 등록 모듈은 가이드에 따라 촬영된 임대물 내의 시설물의 사진을 수신하여 임대물 정보 DB에 저장할 수 있다. 일 실시예에서, 정보 등록 모듈 및/또는 사진 등록 모듈의 임대물 내의 시설물의 정보 수신은 사용자 가 임대물에 입주한 후, 일정 기간(ex 계약서에 명시 되어있는 입주일 전후 일주일)에 1회, 사용자가 임대물 계 약이 만료되기 전의 일정 기간(ex 계약서에 명시 되어있는 퇴거예상일 전 일주일) 에 1회 등록한 정보로, 최소 2회 수신 받을 수 있다. 예를 들어, 사용자가 임대물에 입주한 후 사용자 단말기를 이용하여 서울특별시 광진구 자양로 000-00, 거실1방3화장실2, 2016년 10월 08일, 2018년 10월 8일, 전세를 입력하면, 다음 단계인 임대물 내의 시설물의 사진을 등록하는 단계는 입주일의 일주일 전후인 2016년 10월 01일부터 2016년 10월 15일 에 해당되는 날에만 사진을 등록할 수 있다. 사진 정보 등록이 가능한 날이면, 정보 등록 모듈에서 수신 한 임대물의 기본 정보 및/또는 데이터베이스에서 가져온 임대물의 정보에 기초하여 기 설정된 가이드(ex \"거실 의 바닥을 찍어주세요\")를 사용자 단말기에 출력하여 사용자가 촬영한 임대물 내의 시설물의 사진 정보를 수신하고, 임대물 정보 DB에 저장할 수 있다. 다른 예에서, 사진 정보 등록이 불가능한 날이면, 경고문구(ex \"입주일의 일주일 전후인 2016년 10월 01일부터 2016년 10월 15일까지 사진 정보 등록이 가능합니다.\")를 노출 시켜 사용자가 해당 기간에 사진 정보를 등록하도록 유도할 수 있다. 사용자가 입력한, 입주 후의 임대물 내의 시설물의 기본 정보와 사진 정보가 등록 완료되고 임대물 정보 DB에 저장된 후, 임대물 계약 만료 기간이 다가오면, 사용자는 임대물 계약이 만료되기 전에 다시 한번 임대물 내의 시설물의 사진 정보를 등록할 수 있다. 사용자가 임대물에 입주한 후 사용자 단말기를 통해 입력한 임대 물의 퇴거예상일에 기초하여 퇴거예상일 전 일주일 동안 임대물 내의 시설물의 사진 정보를 등록할 수 있다. 예를 들어, 사용자가 임대물에 입주한 후 사용자 단말기를 이용하여 입력한 퇴거예상일이 2018년 10월 8일 이면, 사용자는 퇴거예상일의 일주일 전인 2018년 10월 1일부터 2018년 10월 8일에 해당되는 날에만 사진을 등 록할 수 있다. 사진 정보 등록이 가능한 날이면, 이전에 출력된 가이드를 동일하게 재 출력하여 사용자에게 노 출시킬 수 있다. 다른 예에서, 사진 정보 등록이 불가능한 날이면, 경고문구(ex \"퇴거일의 일주일 전인 2018년 10월 01일부터 2018년 10월 08일까지 사진 정보 등록이 가능합니다.\")를 노출시켜 사용자가 해당 기간에 사진 정보를 등록하도록 유도할 수 있다. 타임스탬프 모듈은, 수신한 임대물 내의 시설물의 사진 정보를 타임스탬프와 연관시켜 데이터베이스 에 저장할 수 있다. 타임스탬프 모듈은, 임대물 내의 시설물의 사진 정보에 연, 월, 일, 시, 분, 초의 형 태로 타임스탬프가 화면에 기록되도록 하여 임의 변경이 불가능하도록 데이터베이스에 저장할 수 있다. 데이터베이스에 임대물 내의 서설물의 사진 정보가 타임스탬프와 함께 저장할 때, 사용자가 임대물에 입주 한 후, 일정 기간(ex 계약서에 명시 되어있는 입주일 전후 일주일)동안 수신한 임대물 내의 시설물의 사진 정보 에는 제1 타임스탬프를 연관시키고, 임대물 계약이 만료되기 전의 일정 기간(ex 계약서에 명시 되어있는 퇴거예 상일 전 일주일)에 수신한 임대물 내의 시설물의 사진 정보에는 제2 타임스탬프를 연관시켜 제1 타임스탬프와 연관된 임대물 내의 시설물의 사진과 제2 타임스탬프에 연관된 임대물 내의 시설물의 사진을 구분하여 데이터베 이스에 저장할 수 있다. 일 실시예에 따르면, 타임스탬프 모듈은, 사용자가 임대물 내의 시설물의 파손 정보를 결정하기 위해 촬영 하는 임대물 내의 시설물의 사진에 타임스탬프를 연관시킬 수 있다. 예를 들어, 사용자가 임대물에 입주한 후, 일정 기간(ex 계약서에 명시 되어있는 입주일 전후 일주일)동안 수신한 임대물 내의 시설물의 사진 정보에는 \"2016.10.03 16시 25분 43초\"로 타임스탬프가 연관되어 질 수 있고, 임대물 계약이 만료되기 전의 일정 기간(ex 계약서에 명시 되어있는 퇴거예상일 전 일주일)에 수신한 임대물 내의 시설물의 사진 정보에는 \"2018.10.05 13 시 46분 26초\"로 타임스탬프가 연관되어질 수 있다. 각각의 타임스탬프와 연관되어진 임대물 내의 시설물의 사 진 정보는, 임의 변경이 불가능하도록 데이터베이스에 구분되어 저장될 수 있다 파손 확인 모듈은, 타임스탬프 모듈에서 데이터베이스에 저장한 제1 타임스탬프와 연관된 임대 물 내의 시설물의 사진 정보와 제2 타임스탬프와 연관된 임대물 내의 시설물의 사진 정보가 인공신경망의 입력 층에 입력되어 임대물 내의 시설물의 파손 정보를 결정하는 인공신경망을 생성할 수 있다. 예를 들어, 인공신 경망은, 준 지도 학습(Semi-supervised Learning)을 통하여 임대물 내의 시설물의 파손 정보를 추론할 수 있다. 인공신경망 기반의 준 지도 학습 방법을 이용하여 제1 타임스탬프와 연관된 임대물 내의 시설물의 사진 정보와 제2 타임스탬프와 연관된 임대물 내의 시설물의 사진 정보를 분석하고, 이를 바탕으로 임대물 내의 시설물의 파 손 정보(예를 들어, 파손 여부, 파손 정도, 파손 위치 등)를 산출할 수 있다. 인공신경망의 입력층에 입력되는 입력변수는, 타임스탬프 모듈에 의해 결정된 제1 타임스탬프와 연관된 임대물 내의 시설물의 사진 정보와 제2 타임스탬프와 연관된 임대물 내의 시설물의 사진 정보를 나타내는 벡터가 될 수 있다. 예를 들어, 제1 타 임스탬프와 연관된 임대물 내의 시설물의 사진 정보와 제2 타임스탬프와 연관된 임대물 내의 시설물의 사진 정 보의 카테고리를 각각 하나의 벡터 데이터 요소로 구성할 수 있다. 한편, 인공신경망의 출력층에서 출력되는 출력변수는, 일 실시예에 따르면, 파손 확인 모듈에 의해 분석된 임대물 내의 시설물의 파손 정보를 나타 내는 벡터가 될 수 있다. 파손 확인 모듈은, 이러한 입력변수들 및 출력변수들을 이용하여 인공신경망을 학습시킬 수 있다. 일 실시예에 따르면, 타임스탬프 모듈에서 데이터베이스에 저장한 제1 타임스탬프와 연관된 임대물 내의 시설물의 사진 정보와 제2 타임스탬프와 연관된 임대물 내의 시설물의 사진 정보를 가이드별로 나누어 비 교하고, 임대물 내의 시설물의 파손 정보를 산출하도록 구성할 수 있다. 예를 들어, 사진 등록 모듈에서 사용자가 사용자 단말기를 통해 임대물 내의 시설물 사진을 가이드에 따라 등록할 때, 사진 등록 모듈 은 기 설정된 가이드를 임대물의 구조에 따라 사용자 단말기에 여러 개 출력(ex 화장실1의 욕조를 찍 어 주세요, 방2의 벽을 찍어 주세요, 주방의 싱크대 안을 찍어 주세요.) 할 수 있다. 사용자는 기 설정된 여러 개의 가이드에 따라 임대물 내의 시설물의 사진을 촬영하고, 타임스탬프 모듈에 의해 타임스탬프와 연관되 어질 수 있다. 제1 타임스탬프와 연관된 임대물 내의 시설물의 사진 정보와 제2 타임스탬프와 연관된 임대물 내의 시설물의 사진 정보를 이용한 임대물 내의 시설물의 파손 정보 산출은 가이드별로 분석되어 산출할 수 있 다. 출력모듈은, 파손 확인 모듈에서 산출된 임대물 내의 시설물의 파손 정보(예를 들어, 파손 여부, 파 손 정도, 파손 위치 등)를 출력할 수 있다. 임대물 내의 시설물의 파손 정보의 출력은, 사용자 단말기(110_1 내지 110_n)와 임대인 단말기(220_1 내지 220_n)에 출력될 수 있고, 임대인 단말기(220_1 내지 220_n)에 출력될 때는 임대인이 임대물 내의 시설물의 사진 정보 확인이 가능하고, 임대인의 확인 요청 회신이 가능한 양식으로 출력될 수 있다. 매물 검수 모듈은, 데이터베이스에 저장된 임대물 정보, 임대인 정보 및 임차인 정보에 기초하여 사 용자 단말기에게 허위 매물이 자동으로 필터링 되어 삭제된 매물 정보를 제공할 수 있다. 일 실시예에 따르면, 임대인 정보 DB에 저장된 임대인에 대한 허위매물 신고 횟수와 경고 횟수를 이용하여 허위매물 신고 횟수와 경 고 횟수가 많은 임대인에 대해서는 해당 임대인의 임대물이 상단에 노출되지 않도록 조절하거나, 해당 임대인의 매물이 자동으로 필터링되어 삭제된 매물 정보를 사용자 단말기에 제공할 수 있다. 이때, 신고 횟수와 경고의적용은, 다음과 같은 방법을 따를 수 있다. 임대인이 허위매물 1차 신고를 받았을 때, 임대물을 비공개로 처리 한 후, 검수요청을 할 수 있다. 허위매물 1차 신고를 받았음에도, 동일 임대물에 대해 2차 신고 및 재 검수를 통해 재 적발되었을 시, 임대물을 삭제한 후 해당 임대물을 업로드한 임대인에게 경고 1회를 적용할 수 있다. 매물 추천 모듈은, 데이터베이스에 저장된 임대물 정보, 임대인 정보 및 임차인 정보에 기초하여 매 물 정보를 요청하는 사용자 단말기에게 매물을 추천할 수 있다. 일 실시예에 따르면, 사용자가 임대차 계약을 완료한 임대물의 구조, 면적, 주소, 근처 역, 계약 내용과 같은 정보를 이용하여 임차인에게 적합한 매물을 추 천하거나, 사용자의 퇴거예상일을 이용하여 퇴거 후 바로 입주가 가능한 매물을 추천할 수 있다. 도 4는 본 개시의 일 실시예에 따른 임대물 정보 DB에서 보유하고 있는 임대물 및 임대정보의 예를 나타낸 것이다. 임대물 정보는, 사용자 단말기를 통해 입력된 입력 정보일 수 있고, 외부 서버 및/또는 외부 DB에 저 장된 정보일 수 있다. 임대물의 정보는, 임대물에 대한 임대 형태, 계약 형태, 보증금, 거리 정보 및 환경 정 보를 포함할 수 있다. 또한, 임대물의 정보는, 임대물 면적, 입주일, 퇴거일, 임대물 내의 시설물의 사진 정보, 주소, 설계도, 방의 개수, 화장실의 개수 등과 같은 매물의 기본적인 정보일 수 있다. 도 5는 본 개시의 일 실시예에 따른 임대인 정보 DB에서 보유하고 있는 임대인 정보의 예를 나타낸 것이다. 임 대인 정보는, 회원으로 등록된 각 임대인들의 회원 정보, 예를 들어, 임대인의 아이디, 주민등록번호, 주소, 휴 대 단말 번호, 이메일 주소, 허위매물 신고 횟수 등과 같은 정보일 수 있다. 허위매물 신고 횟수는, 임차인이 임대인의 임대물을 선택할 때 참고되거나 허위 매물 자동 검수를 위해 사용될 수 있다. 임대인이 허위매물 1차 신고를 받았을 때 임대물을 비공개로 처리한 후, 검수요청을 할 수 있다. 동일 임대물에 대해 2차 신고 및 재 검수를 통해 재 적발되었을 시, 임대물을 삭제한 후 해당 임대물을 업로드한 임대인에게 경고 1회를 적용하여 허위 매물 자동 검수에 사용할 수 있다. 도 6은 본 개시의 일 실시예에 따른 임차인 정보 DB에서 보유하고 있는 임차인 정보의 예를 나타낸 것이다. 임 차인의 정보는, 회원으로 등록된 각 임차인들의 회원 정보, 예를 들어, 아이디, 주민등록번호, 주소, 휴대 단말 번호, 이메일 주소, 어플을 통한 계약 건수, 파손으로 인한 보상 횟수 등과 같은 정보일 수 있다. 파손으로 인 한 보상 횟수는, 임대인이 임차인과의 임대차 계약을 진행할 때 참고될 수 있다. 일 실시예에 따르면, 데이터베이스에 저장된 임대물 정보, 임대인 정보 및 임차인 정보에 기초하여 사용자 단말기에게 허위 매물이 자동으로 필터링 되어 삭제된 매물 정보를 제공할 수 있다. 예를 들어, 임대인 정보 DB에 저장된 임대인에 대한 허위매물 신고 횟수와 경고 횟수를 이용하여 허위매물 신고 횟수와 경고 횟수가 많 은 임대인에 대해서는 해당 임대인의 임대물이 상단에 노출되지 않도록 조절하거나, 해당 임대인의 매물이 자동 으로 필터링 되어 삭제된 매물 정보를 사용자 단말기에 제공할 수 있다. 이때, 신고 횟수와 경고의 적용은, 다 음과 같은 방법을 따를 수 있다. 임대인이 허위매물 1차 신고를 받았을 때, 임대물을 비공개로 처리한 후, 검 수요청을 할 수 있다. 허위매물 1차 신고를 받았음에도, 동일 임대물에 대해 2차 신고 및 재 검수를 통해 재 적발되었을 시, 임대물을 삭제한 후 해당 임대물을 업로드한 임대인에게 경고 1회를 적용할 수 있다. 다른 실시예에 따르면, 데이터베이스에 저장된 임대물 정보, 임대인 정보 및 임차인 정보에 기초하여 매물 정보를 요청하는 사용자 단말기에게 매물을 추천할 수 있다. 예를 들어, 임차인이 임대차 계약을 완료한 임대 물의 구조, 면적, 주소, 근처 역, 계약 내용을 이용하여 사용자에게 적합한 매물을 추천할 수 있다. 또는, 사 용자의 퇴거예상일을 이용하여 퇴거 후 바로 입주가 가능한 매물을 추천할 수 있다. 도 7은 본 개시의 일 실시예에 따른 임대물 내의 시설물의 파손 정보를 결정하기 위한 시스템 제공 방법을 나타 내는 순서도이다. 임대물 내의 시설물의 파손 정보를 결정하는 방법은, 통신 모듈에 의해, 사용자 단말기로부 터 임대물의 정보를 수신하는 단계(S710)로 개시될 수 있다. 서버장치는, 사용자가 사용자 단말기로부터 입력한 임대물과 임대물 내의 시설물의 기본 정보를 수신할 수 있고, 수신한 정보를 사용자별로 데이터베이스에 저장할 수 있다. 여기서, 임대물 내의 시설물의 파손 정보 출력 요청은, 임대물 내의 시설물의 파손 유무, 파 손 위치, 일치도, 파손 정도 등을 포함할 수 있다. 일 예에서, 도 3을 참조하면, 통신 모듈은, 사용자 단 말기로부터 임대물 내의 시설물의 파손 정보 요청을 수신할 수 있다. 예를 들어, 사용자가 사용자 단말기 를 이용하여 임대물과 임대물 내의 시설물의 기본 정보를 입력하고, 임대물 내의 시설물의 파손 정보를 요 청하게 되면, 통신 모듈은, 사용자의 입력을 서버장치의 프로세서로 전송할 수 있다. 임대물의 정보를 수신하고 나면, 사용자 단말기로부터의 사진 등록 요청에 응답하여, 임대물 내의 시설물을 가 이드에 따라 촬영할 수 있다(S720). 사진 등록 모듈은, 사용자 단말기로부터의 임대물 내의 시설물 의 사진 정보 등록 요청에 응답하여, 정보 등록 모듈에서 수신된 임대물의 기본 정보 및/또는 데이터베이스에서 가져온 임대물의 정보에 기초하여 기 설정된 가이드를 사용자 단말기로 출력할 수 있다. 사용자는 사용자 단말기에 출력된 가이드에 따라 임대물 내의 시설물을 촬영할 수 있다. 이때, 사진 정보 등록은, 정보 등록 모듈에서 수신한 입주일의 일정 기간(ex 계약서에 명시 되어있는 입주일 전후 일주일) 동안에만 가능할 수 있다. 사진 정보 등록이 가능한 기간이면 출력된 가이드에 따라, 사용자는 임대물 내의 시설물의 사 진을 촬영하고, 사진 등록 모듈은 가이드에 따라 촬영된 임대물 내의 시설물의 사진을 수신할 수 있다. 일 실시예에서, 정보 등록 모듈 및/또는 사진 등록 모듈의 임대물 내의 시설물의 정보 수신은 사용자 가 임대물에 입주한 후, 일정 기간(ex 계약서에 명시 되어있는 입주일 전후 일주일)에 1회, 사용자가 임대물 계 약이 만료되기 전의 일정 기간(ex 계약서에 명시 되어있는 퇴거예상일 전 일주일) 에 1회 등록한 정보로, 최소 2회 수신 받을 수 있다. 예를 들어, 사용자가 임대물에 입주한 후 사용자 단말기를 이용하여 서울특별시 광진구 자양로 000-00, 거실1방3화장실2, 2016년 10월 08일, 2018년 10월 8일, 전세를 입력하면, 다음 단계인 임대물 내의 시설물의 사진을 등록하는 단계는 입주일의 일주일 전후인 2016년 10월 01일부터 2016년 10월 15일 에 해당되는 날에만 사진을 등록할 수 있다. 사진 정보 등록이 가능한 날이면, 정보 등록 모듈에서 수신 한 임대물의 기본 정보 및/또는 데이터베이스에서 가져온 임대물의 정보에 기초하여 기 설정된 가이드(ex \"거실 의 바닥을 찍어주세요\")를 사용자 단말기에 출력하여 사용자가 촬영한 임대물 내의 시설물의 사진 정보를 수신하고, 임대물 정보 DB에 저장할 수 있다. 그 후, 수신한 임대물의 정보와 촬영된 사진을 타임스탬프와 연관시켜 데이터베이스에 저장할 수 있다(S730). 타임스탬프 모듈은, 임대물 내의 시설물의 사진 정보에 연, 월, 일, 시, 분, 초의 형태로 타임스탬프가 화 면에 기록되도록 하여 임의 변경이 불가능하도록 데이터베이스에 저장할 수 있다. 데이터베이스에 임대물 내의 서설물의 사진 정보가 타임스탬프와 함께 저장할 때, 사용자가 임대물에 입주한 후, 일정 기간(ex 계약서에 명시 되어있는 입주일 전후 일주일)동안 수신한 임대물 내의 시설물의 사진 정보에는 제1 타임스탬프 를 연관시키고, 임대물 계약이 만료되기 전의 일정 기간(ex 계약서에 명시 되어있는 퇴거예상일 전 일주일)에 수신한 임대물 내의 시설물의 사진 정보에는 제2 타임스탬프를 연관시켜 제1 타임스탬프와 연관된 임대물 내의 시설물의 사진과 제2 타임스탬프에 연관된 임대물 내의 시설물의 사진을 구분하여 데이터베이스에 저장할 수 있 다. 다음 단계(S740)에서는, 제1 타임스탬프에 연관되어 저장된 임대물 내의 시설물의 촬영된 사진과 제2 타임스탬 프에 연관되어 저장된 임대물 내의 시설물의 촬영된 사진을 비교하여 파손 정보를 결정할 수 있다(S740). 파손 확인 모듈은, 타임스탬프 모듈에서 데이터베이스에 저장한 제1 타임스탬프와 연관된 임대물 내 의 시설물의 사진 정보와 제2 타임스탬프와 연관된 임대물 내의 시설물의 사진 정보가 인공신경망의 입력층에 입력되어 임대물 내의 시설물의 파손 정보를 결정하는 인공신경망을 생성할 수 있다. 예를 들어, 인공신경망은, 준 지도 학습(Semi-supervised Learning)을 통하여 임대물 내의 시설물의 파손 정보를 추론할 수 있다. 인공신경망 기반의 준 지도 학습 방법을 이용하여 제1 타임스탬프와 연관된 임대물 내의 시설물의 사진 정보와 제2 타임스탬프와 연관된 임대물 내의 시설물의 사진 정보를 분석하고, 이를 바탕으로 임대물 내의 시설 물의 파손 정보를 산출할 수 있다. 인공신경망의 입력층에 입력되는 입력변수는, 타임스탬프 모듈에 의해 결정된 제1 타임스탬프와 연관된 임대물 내의 시설물의 사진 정보와 제2 타임스탬프와 연관된 임대물 내의 시설 물의 사진 정보를 나타내는 벡터가 될 수 있다. 예를 들어, 제1 타임스탬프와 연관된 임대물 내의 시설물의 사 진 정보와 제2 타임스탬프와 연관된 임대물 내의 시설물의 사진 정보의 카테고리를 각각 하나의 벡터 데이터 요 소로 구성할 수 있다. 한편, 인공신경망의 출력층에서 출력되는 출력변수는, 일 실시예에 따르면, 파손 확인 모듈에 의해 분석된 임대물 내의 시설물의 파손 정보를 나타내는 벡터가 될 수 있다. 파손 확인 모듈 은, 이러한 입력변수들 및 출력변수들을 이용하여 인공신경망을 학습시킬 수 있다. 일 실시예에 따르면, 타임스탬프 모듈에서 데이터베이스에 저장한 제1 타임스탬프와 연관된 임대물 내의 시설물의 사진 정보와 제2 타임스탬프와 연관된 임대물 내의 시설물의 사진 정보를 가이드별로 나누어 비 교하고, 임대물 내의 시설물의 파손 정보를 산출하도록 구성할 수 있다. 예를 들어, 사진 등록 모듈에서 사용자가 사용자 단말기를 통해 임대물 내의 시설물 사진을 가이드에 따라 등록할 때, 사진 등록 모듈 은 기 설정된 가이드를 임대물의 구조에 따라 사용자 단말기에 여러 개 출력(ex 화장실1의 욕조를 찍 어 주세요, 방2의 벽을 찍어 주세요, 주방의 싱크대 안을 찍어 주세요.) 할 수 있다. 사용자는 기 설정된 여러 개의 가이드에 따라 임대물 내의 시설물의 사진을 촬영하고, 타임스탬프 모듈에 의해 타임스탬프와 연관되 어질 수 있다. 제1 타임스탬프와 연관된 임대물 내의 시설물의 사진 정보와 제2 타임스탬프와 연관된 임대물 내의 시설물의 사진 정보를 이용한 임대물 내의 시설물의 파손 정보 산출은 가이드별로 분석되어 산출할 수 있 다. 파손 정보를 사용자 단말기 및 임대물의 소유자 단말기 중 적어도 하나로 제공할 수 있다(S750). 파손 확인 모 듈에서 산출된 임대물 내의 시설물의 파손 정보를 출력할 수 있다. 임대물 내의 시설물의 파손 정보의 출 력은, 사용자 단말기(110_1 내지 110_n)와 임대인 단말기(220_1 내지 220_n)에 출력될 수 있고, 임대인 단말기 (220_1 내지 220_n)에 출력될 때는 임대인이 임대물 내의 시설물의 사진 정보 확인이 가능하고, 임대인의 확인 요청 회신이 가능한 양식으로 출력될 수 있다. 예를 들어, 산출된 임대물 내의 시설물의 파손 정보는, \"안심서 비스 확인 사실 통지서\"라는 양식으로 출력되어 임대인에게 MMS 및/또는 SNS메세지 형식으로 보내질 수 있다. 임대물 내의 시설물의 파손 정보를 출력하는 양식에는, 임대인이 출력물을 확인하고, 시간과 이미지정보에 대한 임대인의 코멘트를 수신할 수 있는 확인요청 양식이 포함될 수 있다. 도 8은 본 개시의 일 실시예에 따른 인공신경망을 나타내는 구조도이다. 인공신경망은, 머신러닝(Machine Learning) 기술과 인지과학에서, 생물학적 신경망의 구조에 기초하여 구 현된 통계학적 학습 알고리즘 또는 그 알고리즘을 실행하는 구조이다. 즉, 인공신경망은, 생물학적 신경 망에서 와 같이 시냅스의 결합으로 네트워크를 형성한 인공 뉴런인 노드(Node)들이 시냅스의 가중치를 반복적으 로 조정하여, 특정 입력에 대응한 올바른 출력과 추론된 출력 사이의 오차가 감소되도록 학습함으로써, 문제 해 결 능력을 가지는 머신러닝 모델을 나타낸다. 일반적으로 인공신경망은 다층의 노드들과 이들 상이의 연결로 구성된 다층 퍼셉트론(MLP: multilayer perceptron)으로 구현된다. 본 실시예에 따른 인공신경망은 MLP를 포함하는 다양한 인공신경망 구조들 중 의 하나를 이용하여 구현될 수 있다. 도 8에 도시된 바와 같이, 인공신경망은, 외부로부터 입력 신호 또 는 데이터(810, 812)를 수신하는 입력층, 입력 데이터에 대응한 출력 신호 또는 데이터(850, 852, 854)를 출력하는 출력층, 입력층과 출력층 사이에 위치하며 입력층으로부터 신호를 받아 특성을 추출하여 출력층으로 전달하는 n개의 은닉층(830_1 내지 830_n)으로 구성된다. 여기서, 출력층은, 은닉층(830_1 내지 830_n)으로부터 신호를 받아 외부로 출력한다. 일반적으로, 인공신경망의 학습 방법에는, 교사 신호(정답)의 입력에 의해서 문제의 해결에 최적화되도록 학습하는 지도 학습(Supervised Learning)방법과, 교사 신호를 필요로 하지 않는 비지도 학습(Unsupervised Learning)방법이 있다. 본 개시에 따른 인공지능(딥러닝)을 활용한 임대물 내의 시설물의 파손 정보 결정 시스 템은, 사용자와 임대인에게 임대물 내의 시설물의 파손 정보를 제공하기 위하여 지도 학습(Supervised Learning) 및 비지도 학습(Unsupervised Learning)을 함께 이용하는 준 지도 학습(Semi-supervised Learning) 을 이용하여, 제1 타임스탬프에 연관되어 저장된 임대물 내의 시설물의 촬영된 사진과 제2 타임스탬프에 연관되 어 저장된 임대물 내의 시설물의 촬영된 사진을 이용하여 임대물 내의 시설물의 파손 정보를 제공하는 인공신경 망을 학습시킬 수 있다. 이렇게 학습된 인공신경망은, 사용자의 임대물 내의 파손 정보 결정 요청에 응답하여 임대물 내의 시설물의 파손 정보를 제공할 수 있다. 일 실시예에 따르면, 도 8에 도시된 바와 같이, 임대물 내의 시설물의 파손 정보를 제공할 수 있는 인공신경망 의 입력변수는, 타임스탬프 모듈에서 임대물 내의 시설물의 사진 정보를 타임스탬프와 연관시킨 제1 타임스탬프에 연관되어 저장된 임대물 내의 시설물의 촬영된 사진 및 제2 타임스탬프에 연관되어 저장된 임대물 내의 시설물의 촬영된 사진의 카테고리를 각각 하나의 벡터 데이터요소로 구성한, 제1 타임스탬프에 연관되어 저장된 임대물 내의 시설물의 촬영된 사진 벡터 및 제2 타임스탬프에 연관되어 저장된 임대물 내의 시설물 의 촬영된 사진 벡터가 될 수 있다. 예를 들어, 사용자가 사진 등록 모듈에서 사용자 단말기에 출력된 가이드1 - \"화장실1의 욕조를 찍어 주세요.\" 가이드2 - \"방2의 벽을 찍어주세요.\" 가이드3 - \"주방의 싱크대 안을 찍어주세요.\" 라는 가이드에 맞 춰 임대물 내의 시설물을 촬영하여 제1 타임스탬프와 연관시켰고, 동일한 가이드에 따라 임대물 내의 시설물을 촬영하여 제2 타임스탬프와 연관시켰다고 가정하자. 이때, 가이드1에 대한 파손 정보를 출력하고자 한다면, 가 이드1에 해당되는 제1 타임스탬프와 연관된 촬영 정보, 제2 타임스탬프와 연관된 촬영 정보와 같은 요소들에는 1의 값을 할당하고, 나머지 가이드들의 요소들에는 0의 값을 할당할 수 있다. 한편, 인공신경망의 출력층에서 출력되는 출력변수는, 파손 확인 모듈에 의해 분석된 임대물 내 의 시설물의 파손 여부, 파손 위치, 일치도(예를 들어, 파손 정도)를 나타내는 벡터가 될 수 있다. 일 실시예 에 따르면, 출력변수는, 파손 여부 벡터, 파손 위치 벡터, 일치도 벡터로 구성될 수 있다. 본 개시에 있어서 인공신경망의 출력변수는, 이상에서 설명한 3가지 유형에 한정되지 않을 수 있다. 이와 같이 인공신경망의 입력층과 출력층에 복수의 입력변수와 대응되는 복수의 출력변수를 각 각 매칭시켜, 입력층, 은닉층(830_1 내지 830_n) 및 출력층에 포함된 노드들 사이의 시냅스 값을 조 정함으로써, 특정 입력에 대응한 올바른 출력을 추론할 수 있도록 학습할 수 있다. 이러한 학습과정을 통해, 인공신경망의 입력변수에 숨겨져 있는 특성을 파악할 수 있고, 입력변수에 기초하여 계산된 출력변수와 목 표 출력 간의 오차가 줄어들도록 인공신경망의 노드들 사이의 시냅스 값(또는 가중치)를 조장할 수 있다. 이렇게 학습된 인공신경망을 이용하여, 임대물 내의 시설물의 파손 여부 및 파손 위치를 추출할 수 있다. 도 9는 본 개시의 일 실시예에 따른 임대물 내의 시설물의 파손 위치를 출력하는 과정을 나타내는 순서도이다. 임대물 내의 시설물의 파손 위치를 출력하는 과정은 파손 확인 모듈에서 제1 타임스탬프에 연관되어 저장 된 임대물 내의 시설물의 촬영된 사진과 제2 타임스탬프에 연관되어 저장된 임대물 내의 시설물의 촬영된 사진 을 비교하는 단계(S910)로 개시될 수 있다. 촬영된 사진을 비교하고 나면, 임대물 내의 시설물의 파손정보를 판단한다(S920). 판단 결과, 임대물 내의 시설물의 파손이 없는 것으로 판명되면, \"일치도 100%\"라는 문구와 함께 결과를 출력하고, 사용자 단말기 및 임대물의 소유자 단말기에 전송(S940)하는 과정을 거쳐 임대물 내의 시설물의 파손 위치를 출력하는 과정을 종료할 수 있다. 이와 달리, 임대물 내의 시설물의 파손정보 판단 (S920)에서, 임대물 내의 시설물의 파손이 있는 것으로 판명되면, 파손 정도, 파손 위치, 일치도를 양식에 맞게 가공(S930)한 뒤, 결과를 출력하고, 사용자 단말기 및 임대물의 소유자 단말기에 전송(S940)하는 과정을 거쳐 임대물 내의 시설물의 파손 위치를 출력하는 과정을 최종 종료할 수 있다. 도 10은 본 개시의 일 실시예에 따른 임대물 내의 시설물의 파손정보를 출력하는 인터페이스 화면을 나타내는 예시도이다. 사용자 단말기(110_1 내지 110_n) 및/또는 임대인 단말기(220_1 내지 220_n)에는 임대물 내의 시 설물의 파손정보가 출력될 수 있다. 출력물의 상단에는 제1 타임스탬프에 연관되어 저장된 임대물 내의 시설물 의 촬영된 사진과 제2 타임스탬프에 연관되어 저장된 임대물 내의 시설물의 촬영된 사진의 일치도가 표시될 수 있다. 제1 타임스탬프에 연관되어 저장된 임대물 내의 시설물의 촬영된 사진과 제2 타임스탬프에 연관되어 저 장된 임대물 내의 시설물의 촬영된 사진의 일치도가 100%라면, 100%의 일치도가 산출된 근거가 되는 촬영 사진과 함께 정보가 출력될 수 있다. 제1 타임스탬프에 연관되어 저장된 임대물 내의 시설물의 촬영된 사진과 제2 타임스탬프에 연관되어 저장된 임대물 내의 시설물의 촬영된 사진의 일치도가 100%가 아니라면, 100% 가 아닌 일치도가 산출된 근거로 제1 타임스탬프에 연관되어 저장된 임대물 내의 시설물의 촬영된 사진과 제2 타임스탬프에 연관되어 저장된 임대물 내의 시설물의 촬영된 사진을 비교하여 파손이 이루어진 부분을 따로 표 시할 수 있다. 이때, 파손이 이루어진 부분을 표시할 때, 파손에 대한 보상 가격을 산출하여 출력할 수 있다. 도 11은 본 개시의 일 실시예에 따른 데이터베이스에 저장된 데이터를 이용하여 사용자에게 허위 매물이 자동 검수 된 매물 정보 제공 및 매물을 추천하는 인터페이스 화면을 나타내는 예시도이다. 데이터베이스에 저 장된 임대물 정보, 임대인 정보 및 임차인 정보에 기초하여 사용자 단말기에게 허위 매물이 자동으로 필터링 되 어 삭제된 매물 정보를 제공할 수 있다. 예를 들어, 임대인 정보 DB에 저장된 임대인에 대한 허위매물 신고 횟 수와 경고 횟수를 이용하여 허위매물 신고 횟수와 경고 횟수가 많은 임대인에 대해서는 해당 임대인의 임대물이 상단에 노출되지 않도록 조절하거나, 해당 임대인의 매물이 자동으로 필터링 되어 삭제된 매물 정보를 사용자 단말기에 제공할 수 있다. 이때, 신고 횟수와 경고의 적용은, 다음과 같은 방법을 따를 수 있다. 임대인이 허 위매물 1차 신고를 받았을 때, 임대물을 비공개로 처리한 후, 검수요청을 할 수 있다. 허위매물 1차 신고를 받 았음에도, 동일 임대물에 대해 2차 신고 및 재 검수를 통해 재 적발되었을 시, 임대물을 삭제한 후 해당 임대물 을 업로드한 임대인에게 경고 1회를 적용할 수 있다. 다른 실시예에 따르면, 데이터베이스에 저장된 임대물 정보, 임대인 정보 및 임차인 정보에 기초하여 매물 정보를 요청하는 사용자 단말기에게 매물을 추천할 수 있다. 예를 들어, 사용자가 임대차 계약을 완료한 임대 물의 구조, 면적, 주소, 근처 역, 계약 내용을 이용하여 사용자에게 적합한 매물을 추천할 수 있다. 또 는, 사용자의 퇴거예상일을 이용하여 퇴거 후 바로 입주가 가능한 매물을 추천할 수 있다. 일반적으로, 본 명세서에 설명된 허위매물이 검수된 매물리스트를 출력하는 시스템은, 무선 전화기, 셀룰러 전 화기, 랩탑 컴퓨터, 무선 멀티미디어 디바이스, 무선 통신 PC (personal computer) 카드, PDA, 외부 모뎀이나 내부 모뎀, 무선 채널을 통해 통신하는 디바이스 등과 같은 다양한 타입들의 디바이스들을 나타낼 수도 있다. 디바이스는, 액세스 단말기 (access terminal; AT), 액세스 유닛, 가입자 유닛, 이동국, 모바일 디바이스, 모바 일 유닛, 모바일 전화기, 모바일, 원격국, 원격 단말, 원격 유닛, 유저 디바이스, 유저 장비 (user equipment), 핸드헬드 디바이스 등과 같은 다양한 이름들을 가질 수도 있다. 본 명세서에 설명된 임의의 디바이스는 명령들 및 데이터를 저장하기 위한 메모리, 뿐만 아니라 하드웨어, 소프트웨어, 펌웨어, 또는 이들의 조합들을 가질 수도 있다. 본 명세서에 기술된 기법들은 다양한 수단에 의해 구현될 수도 있다. 예를 들어, 이러한 기법들은 하드웨어, 펌웨어, 소프트웨어, 또는 이들의 조합으로 구현될 수도 있다. 본 명세서의 개시와 연계하여 설명된 다양한 예 시 적인 논리적 블록들, 모듈들, 회로들, 및 알고리즘 단계들은 전자 하드웨어, 컴퓨터 소프트웨어, 또는 양자 의 조합들로 구현될 수도 있음을 당업자들은 더 이해할 것이다. 하드웨어 및 소프트웨어의 이러한 상호교환성 을 명확하게 설명하기 위해, 다양한 예시 적인 컴포넌트들, 블록들, 모듈들, 회로들, 및 단계들이 그들의 기능 성의 관점에서 일반적으로 위에서 설명되었다. 그러한 기능이 하드웨어로서 구현되는지 또는 소프트웨어로서 구현되는 지의 여부는, 특정 애플리케이션 및 전체 시스템에 부과되는 설계 제약들에 따라 달라진다. 당업자들 은 각각의 특정 애플리케이션을 위해 다양한 방식들로 설명된 기능을 구현할 수도 있으나, 그러한 구현 결정들 은 본 개시의 범위로부터 벗어나게 하는 것으로 해석되어서는 안된다. 하드웨어 구현에서, 기법들을 수행하는 데 이용되는 프로세싱 유닛들은, 하나 이상의 ASIC들, DSP들, 디지털 신 호 프로세싱 디바이스들 (digital signal processing devices; DSPD들), 프로그램가능 논리 디바이스들 (programmable logic devices; PLD들), 필드 프로그램가능 게이트 어레이들 (field programmable gate arrays; FPGA들), 프로세서들, 제어기들, 마이크로제어기들, 마이크로프로세서들, 전자 디바이스들, 본 명세서에 설명된 기능들을 수행하도록 설계된 다른 전자 유닛들, 컴퓨터, 또는 이들의 조합 내에서 구현될 수도 있다. 따라서, 본 명세서의 개시와 연계하여 설명된 다양한 예시 적인 논리 블록들, 모듈들, 및 회로들은 범용 프로세 서, DSP, ASIC, FPGA나 다른 프로그램 가능 논리 디바이스, 이산 게이트나 트랜지스터 로직, 이산 하드웨어 컴 포넌트들, 또는 본 명세서에 설명된 기능들을 수행하도록 설계된 것들의 임의의 조합으로 구현되거나 수행될 수 도 있다. 범용 프로세서는 마이크로프로세서일 수도 있지만, 대안에서, 프로세서는 임의의 종래의 프로세서, 제어기, 마이크로제어기, 또는 상태 머신일 수도 있다. 프로세서는 또한 컴퓨팅 디바이스들의 조합, 예를 들면, DSP와 마이크로프로세서, 복수의 마이크로프로세서들, DSP 코어와 연계한 하나 이상의 마이크로프로세서 들, 또는 임의의 다른 그러한 구성의 조합으로써 구현될 수도 있다. 펌웨어 및/또는 소프트웨어 구현에 있어서, 기법들은 랜덤 액세스 메모리 (random access memory; RAM), 판독 전용 메모리 (read-only memory; ROM), 불휘발성 RAM (non-volatile random access memory; NVRAM), PROM (programmable read-only memory), EPROM (erasable programmable read-only memory), EEPROM (electrically erasable PROM), 플래시 메모리, 컴팩트 디스크 (compact disc; CD), 자기 또는 광학 데이터 스토리지 디바이 스 등과 같은 컴퓨터 판독가능 매체 상에 저장된 명령들로써 구현될 수도 있다. 명령들은 하나 이상의 프로세 서들에 의해 실행 가능할 수도 있고, 프로세서(들)로 하여금 본 명세서에 설명된 기능의 특정 양태들을 수행하 게 할 수도 있다. 소프트웨어로 구현되면, 상기 기능들은 하나 이상의 명령들 또는 코드로서 컴퓨터 판독 가능한 매체 상에 저장 되거나 또는 컴퓨터 판독 가능한 매체를 통해 전송될 수도 있다. 컴퓨터 판독가능 매체들은 한 장소에서 다른 장소로 컴퓨터 프로그램의 전송을 용이하게 하는 임의의 매체를 포함하여 컴퓨터 저장 매체들 및 통신 매체들 양자를 포함한다. 저장 매체들은 컴퓨터에 의해 액세스될 수 있는 임의의 이용 가능한 매체들일 수도 있다. 비제한적인 예로서, 이러한 컴퓨터 판독가능 매체는 RAM, ROM, EEPROM, CD-ROM 또는 다른 광학 디스크 스토리지, 자기 디스크 스토리지 또는 다른 자기 스토리지 디바이스들, 또는 소망의 프로그램 코드를 명령들 또 는 데이터 구조들의 형태로 이송 또는 저장하기 위해 사용될 수 있으며 컴퓨터에 의해 액세스될 수 있는 임의의 다른 매체를 포함할 수 있다. 또한, 임의의 접속이 컴퓨터 판독가능 매체로 적절히 칭해진다. 예를 들어, 소프트웨어가 동축 케이블, 광섬유 케이블, 연선, 디지털 가입자 회선 (DSL), 또는 적외선, 무선, 및 마이크로파와 같은 무선 기술들을 사용하여 웹사이트, 서버, 또는 다른 원격 소스로부터 전송되면, 동축 케 이블, 광섬유 케이블, 연선, 디지털 가입자 회선, 또는 적외선, 무선, 및 마이크로파와 같은 무선 기술들은 매 체의 정의 내에 포함된다. 본 명세서에서 사용된 디스크 (disk) 와 디스크 (disc) 는, CD, 레이저 디스크, 광 디스크, DVD (digital versatile disc), 플로피디스크, 및 블루레이 디스크를 포함하며, 여기서 디스크들 (disks) 은 보통 자기적으로 데이터를 재생하고, 반면 디스크들 (discs) 은 레이저를 이용하여 광학적으로 데이 터를 재생한다. 위의 조합들도 컴퓨터 판독가능 매체들의 범위 내에 포함되어야 한다. 소프트웨어 모듈은 RAM 메모리, 플래시 메모리, ROM 메모리, EPROM 메모리, EEPROM 메모리, 레지스터들, 하드 디스크, 이동식 디스크, CD-ROM, 또는 공지된 임의의 다른 형태의 저장 매체 내에 상주할 수도 있다. 예시 적 인 저장 매체는, 프로세가 저장 매체로부터 정보를 판독하거나 저장 매체에 정보를 기록할 수 있도록, 프로세서 에 커플링 될 수 있다. 대안으로, 저장 매체는 프로세서에 통합될 수도 있다. 프로세서와 저장 매체는 ASIC내에 존재할 수도 있다. ASIC은 유저 단말 내에 존재할 수도 있다. 대안으로, 프로세서와 저장 매체는 유저 단말에서 개별 컴포넌트들로써 존재할 수도 있다. 본 개시의 앞선 설명은 당업자들이 본 개시를 행하거나 이용하는 것을 가능하게 하기 위해 제공된다. 본 개시 의 다양한 수정예들이 당업자들에게 쉽게 자명할 것이고, 본 명세서에 정의된 일반적인 원리들은 본 개시의 취 지 또는 범위를 벗어나지 않으면서 다양한 변형예들에 적용될 수도 있다. 따라서, 본 개시는 본 명세서에 설명 된 예들에 제한되도록 의도된 것이 아니고, 본 명세서에 개시된 원리들 및 신규한 특징들과 일관되는 최광의의 범위가 부여되도록 의도된다. 비록 예시 적인 구현예들이 하나 이상의 독립형 컴퓨터 시스템의 맥락에서 현재 개시된 주제의 양태들을 활용하 는 것을 언급할 수도 있으나, 본 주제는 그렇게 제한되지 않고, 오히려 네트워크나 분산 컴퓨팅 환경과 같은 임 의의 컴퓨팅 환경과 연계하여 구현될 수도 있다. 또 나아가, 현재 개시된 주제의 양상들은 복수의 프로세싱 칩 들이나 디바이스들에서 또는 그들에 걸쳐 구현될 수도 있고, 스토리지는 복수의 디바이스들에 걸쳐 유사하게 영 향을 받게 될 수도 있다. 이러한 디바이스들은 PC들, 네트워크 서버들, 및 핸드헬드 디바이스들을 포함할 수도 있다. 비록 본 주제가 구조적 특징들 및/또는 방법론적 작용들에 특정한 언어로 설명되었으나, 첨부된 청구항들에서 정의된 주제가 위에서 설명된 특정 특징들 또는 작용들로 반드시 제한되는 것은 아님이 이해될 것이다. 오히려, 위에서 설명된 특정 특징들 및 작용들은 청구항들을 구현하는 예시 적인 형태로서 설명된다. 이 명세서에서 언급된 방법은 특정 실시예들을 통하여 설명되었지만, 컴퓨터로 읽을 수 있는 기록매체에 컴퓨터 가 읽을 수 있는 코드로서 구현하는 것이 가능하다. 컴퓨터가 읽을 수 있는 기록매체는 컴퓨터 시스템에 의해 읽힐 수 있는 데이터가 저장되는 모든 종류의 기록장치를 포함한다. 컴퓨터가 읽을 수 있는 기록매체의 예로는 ROM, RAM, CD-ROM, 자기 테이프, 플로피 디스크, 광데이터 저장장치 등이 있다. 또한, 컴퓨터가 읽을 수 있는 기록매체는 네트워크로 연결된 컴퓨터 시스템에 분산되어, 분산방식으로 컴퓨터가 읽을 수 있는 코드가 저장되 고 실행될 수 있다. 그리고, 실시예들을 구현하기 위한 기능적인(functional) 프로그램, 코드 및 코드 세그먼"}
{"patent_id": "10-2018-0162300", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "트들은 본 발명이 속하는 기술분야의 프로그래머들에 의해 용이하게 추론될 수 있다."}
{"patent_id": "10-2018-0162300", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "본 명세서에서는 본 개시가 일부 실시예들과 관련하여 설명되었지만, 본 발명이 속하는 기술분야의 통상의 기술 자가 이해할 수 있는 본 개시의 범위를 벗어나지 않는 범위에서 다양한 변형 및 변경이 이루어질 수 있다는 점 을 알아야 할 것이다. 또한, 그러한 변형 및 변경은 본 명세서에 첨부된 특허청구의 범위 내에 속하는 것으로 생각되어야 한다."}
{"patent_id": "10-2018-0162300", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 개시의 실시예들은, 이하 설명하는 첨부 도면들을 참조하여 설명될 것이며, 여기서 유사한 참조 번호는 유사 한 요소들을 나타내지만, 이에 한정되지는 않는다. 도 1은 본 개시의 일 실시예에 따른 사용자 단말기를 이용하여 임대물과 임대물 내의 시설물의 정보를 입력하는 시스템의 예시도이다. 도 2는 본 개시의 일 실시예에 따른 임대물 내의 시설물의 파손 정보를 결정하기 위한 컴퓨팅 장치의 개략도이 다. 도 3은 본 개시의 일 실시예에 따른 서버장치의 개략도이다. 도 4는 본 개시의 일 실시예에 따른 임대물 정보 DB에서 보유하고 있는 임대물 및 임대정보의 예를 나타낸 것이다. 도 5는 본 개시의 일 실시예에 따른 임대인 정보 DB에서 보유하고 있는 임대인 정보의 예를 나타낸 것이다. 도 6은 본 개시의 일 실시예에 따른 임차인 정보 DB에서 보유하고 있는 임차인 정보의 예를 나타낸 것이다. 도 7은 본 개시의 일 실시예에 따른 임대물 내의 시설물의 파손 정보를 결정하기 위한 시스템 제공 방법을 나타 내는 순서도이다. 도 8은 본 개시의 일 실시예에 따른 인공신경망을 나타내는 구조도이다. 도 9는 본 개시의 일 실시예에 따른 임대물 내의 시설물의 파손 위치를 출력하는 과정을 나타내는 순서도이다. 도 10은 본 개시의 일 실시예에 따른 임대물 내의 시설물의 파손 정보 정보를 출력하는 인터페이스 화면을 나타 내는 예시도이다. 도 11은 본 개시의 일 실시예에 따른 데이터베이스에 저장된 데이터를 이용하여 사용자에게 허위 매물이 자동 검수 된 매물 정보 제공 및 매물을 추천하는 인터페이스 화면을 나타내는 예시도이다."}
