{"patent_id": "10-2020-0134966", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0051866", "출원번호": "10-2020-0134966", "발명의 명칭": "청각 장애인을 위한 가정용 소셜 로봇 장치", "출원인": "한양대학교 에리카산학협력단", "발명자": "한재권"}}
{"patent_id": "10-2020-0134966", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "휠이 장착된 바디;상기 바디에 결합되고 주변 사물을 감지하는 사물 감지 센서;상기 바디에 결합되고, 주변 공간에 대한 상기 바디의 상대 위치 정보를 감지하는 위치 감지 센서;상기 바디에 결합되고, 주변에서 발생하는 소리 정보를 감지하는 소리 감지 센서;상기 바디에 결합되고, 상기 휠을 구동시키는 구동부;상기 바디에 결합하고, 사용자 단말기와 통신가능한 통신부; 및인공 지능 알고리즘을 이용하여, 상기 사물 감지 센서에서 수신된 상기 주변 사물의 정보로부터 사용자를 인지하고, 상기 위치 감지 센서로부터 수신된 상기 상대 위치 정보로부터 상기 바디의 위치 정보와 상기 사용자의위치 정보를 인지하고, 상기 소리 감지 센서에서 수신된 상기 소리 정보를 분석하여 상기 사용자의 인지가 요구되는 알람 요청 정보인지를 판단하고, 상기 알람 요청 정보로 판단될 경우 상기 통신부를 통해 상기 소리 정보의 종류 및 발생 위치 정보를 상기 사용자 단말기에 전송하는 제어부를 포함하는 청각 장애인을 위한 가정용 소셜 로봇 장치."}
{"patent_id": "10-2020-0134966", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 바디에 결합하고, 상기 소리 정보의 종류를 화상으로 표시하는 디스플레이부를 더 포함하는 청각 장애인을위한 가정용 소셜 로봇 장치."}
{"patent_id": "10-2020-0134966", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 바디에 결합하고, 상기 사용자의 터치에 의해 조절되는 스위치부를 더 포함하되,상기 제어부는 상기 스위치부로부터 신호가 수신되면, 상기 소리 정보의 발생 위치로 상기 바디가 이동하도록상기 구동부를 제어하는 청각 장애인을 위한 가정용 소셜 로봇 장치."}
{"patent_id": "10-2020-0134966", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 제어부는 상기 통신부를 통해 상기 소리 정보의 종류 및 발생 위치 정보를 상기 사용자 단말기에전송하고, 기 설정된 시간 동안 상기 스위치로부터 신호가 수신되지 않을 경우, 상기 바디가 상기 사용자의 위치 정보에 해당하는 지점으로 이동하고, 상기 사용자의 위치 정보에 해당하는 지점에서 전진과 후퇴를 반복하도록 상기 구동부를 제어하는 청각 장애인을 위한 가정용 소셜 로봇 장치."}
{"patent_id": "10-2020-0134966", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4 항에 있어서,상기 바디에 장착되며, 충돌을 감지하는 충돌 감지 센서를 더 포함하되,상기 제어부는 상기 바디가 상기 사용자의 위치 정보에 해당하는 지점에서 전진과 후퇴를 반복하는 동안, 상기충돌 감지 센서로부터 충돌 신호를 수신하되, 상기 충돌 신호가 기 설정된 횟수로 수신되는 경우, 상기 바디의전진 및 후퇴 이동이 중단되도록 상기 구동부를 제어하는 청각 장애인을 위한 가정용 소셜 로봇 장치.공개특허 10-2022-0051866-3-"}
{"patent_id": "10-2020-0134966", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "청각 장애인을 위한 가정용 소셜 로봇 장치가 개시된다. 청각 장애인을 위한 가정용 소셜 로봇 장치는 휠이 장착 된 바디; 상기 바디에 결합되고 주변 사물을 감지하는 사물 감지 센서; 상기 바디에 결합되고, 주변 공간에 대한 상기 바디의 상대 위치 정보를 감지하는 위치 감지 센서; 상기 바디에 결합되고, 주변에서 발생하는 소리 정보를 (뒷면에 계속)"}
{"patent_id": "10-2020-0134966", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 청각 장애인을 위한 가정용 소셜 로봇 장치에 관한 것으로, 소리 정보를 시각적으로 표시하여 청각 장애인을 보조할 수 있는 가정용 소셜 로봇 장치를 제공한다."}
{"patent_id": "10-2020-0134966", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "청각 장애인은 소리 정보를 쉽게 인지하지 못하여 위험에 처하거나 생활에 불편함을 겪는 경우가 빈번하게 발생 되고 있다. 특히 가정 내에서 발생할 수 있는 위험들은 소리 정보를 통해 즉각적으로 대응함으로써 예방할 수 있으나, 청각 정애인들은 이러한 능력이 부족하여 위험에 쉽게 처하는 문제가 발생한다. 이러한 문제를 해결하기 위하여 청각 장애인들의 생활을 보조하기 위해 다양한 기기들이 개발되고 있다. 기존의 기기들은 마이크가 장착된 센서를 집안 곳곳에 부착하고, 센서에서 측정된 소리를 청각 장애인들에게 알려준다. 이러한 부착형 기기들은 센서를 집안 곳곳에 설치해야 하는 번거로움과 부착된 기기에 대한 추가적인 관리, 그 리고 유지 비용에 대한 부담으로 널리 보급이 이루어지지 못하고 있는 실정이다. 또한, 미처 예상하지 못하는 곳에서 소리가 발생할 수 있는 사각지대에 대한 염려 또한 존재하여 사용자가 신경 써야하는 부분이 다량 존재 하는 한계가 있다."}
{"patent_id": "10-2020-0134966", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 청각 장애인에게 소리 정보의 발생을 효과적으로 전달할 수 있는 청각 장애인을 위한 가정용 소셜 로 봇 장치를 제공한다."}
{"patent_id": "10-2020-0134966", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 따른 청각 장애인을 위한 가정용 소셜 로봇 장치는 휠이 장착된 바디; 상기 바디에 결합되고 주변 사 물을 감지하는 사물 감지 센서; 상기 바디에 결합되고, 주변 공간에 대한 상기 바디의 상대 위치 정보를 감지하 는 위치 감지 센서; 상기 바디에 결합되고, 주변에서 발생하는 소리 정보를 감지하는 소리 감지 센서; 상기 바 디에 결합되고, 상기 휠을 구동시키는 구동부; 상기 바디에 결합하고, 사용자 단말기와 통신가능한 통신부; 및 인공 지능 알고리즘을 이용하여, 상기 사물 감지 센서에서 수신된 상기 주변 사물의 정보로부터 사용자를 인지 하고, 상기 위치 감지 센서로부터 수신된 상기 상대 위치 정보로부터 상기 바디의 위치 정보와 상기 사용자의 위치 정보를 인지하고, 상기 소리 감지 센서에서 수신된 상기 소리 정보를 분석하여 상기 사용자의 인지가 요구 되는 알람 요청 정보인지를 판단하고, 상기 알람 요청 정보로 판단될 경우 상기 통신부를 통해 상기 소리 정보 의 종류 및 발생 위치 정보를 상기 사용자 단말기에 전송하는 제어부를 포함한다. 또한, 상기 바디에 결합하고, 상기 소리 정보의 종류를 화상으로 표시하는 디스플레이부를 더 포함할 수 있다. 또한, 상기 바디에 결합하고, 상기 사용자의 터치에 의해 조절되는 스위치부를 더 포함하되, 상기 제어부는 상 기 스위치부로부터 신호가 수신되면, 상기 소리 정보의 발생 위치로 상기 바디가 이동하도록 상기 구동부를 제 어할 수 있다. 또한, 상기 제어부는 상기 통신부를 통해 상기 소리 정보의 종류 및 발생 위치 정보를 상기 사용자 단말기에 전 송하고, 기 설정된 시간 동안 상기 스위치로부터 신호가 수신되지 않을 경우, 상기 바디가 상기 사용자의 위치 정보에 해당하는 지점으로 이동하고, 상기 사용자의 위치 정보에 해당하는 지점에서 전진과 후퇴를 반복하도록 상기 구동부를 제어할 수 있다. 또한, 상기 바디에 장착되며, 충돌을 감지하는 충돌 감지 센서를 더 포함하되, 상기 제어부는 상기 바디가 상기 사용자의 위치 정보에 해당하는 지점에서 전진과 후퇴를 반복하는 동안, 상기 충돌 감지 센서로부터 충돌 신호 를 수신하되, 상기 충돌 신호가 기 설정된 횟수로 수신되는 경우, 상기 바디의 전진 및 후퇴 이동이 중단되도록 상기 구동부를 제어할 수 있다."}
{"patent_id": "10-2020-0134966", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하면, 가정용 소셜 로봇 장치가 자율 주행으로 실내를 배회하는 동안 소리 발생을 인지하고, 소리 정보를 사용자 단말기에 전송함으로써 청각 장애인에게 소리 정보의 발생을 신속하게 인지시킬 수 있다. 또한, 본 발명에 의하면, 청각 장애인이 사용자 단말기를 통해 소리 정보를 확인하지 못한 경우, 청각 장애인의 위치로 가정용 소셜 로봇 장치가 이동하고, 청각 장애인과의 충돌로 소리 정보의 발생을 청각 장애인에게 인지 시킬 수 있다."}
{"patent_id": "10-2020-0134966", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면들을 참조하여 본 발명의 바람직한 실시 예를 상세히 설명할 것이다. 그러나 본 발명의 기술 적 사상은 여기서 설명되는 실시 예에 한정되지 않고 다른 형태로 구체화될 수도 있다. 오히려, 여기서 소개되 는 실시 예는 개시된 내용이 철저하고 완전해질 수 있도록 그리고 당업자에게 본 발명의 사상이 충분히 전달될 수 있도록 하기 위해 제공되는 것이다. 본 명세서에서, 어떤 구성요소가 다른 구성요소 상에 있다고 언급되는 경우에 그것은 다른 구성요소 상에 직접 형성될 수 있거나 또는 그들 사이에 제 3의 구성요소가 개재될 수도 있다는 것을 의미한다. 또한, 도면들에 있 어서, 막 및 영역들의 두께는 기술적 내용의 효과적인 설명을 위해 과장된 것이다. 또한, 본 명세서의 다양한 실시 예 들에서 제1, 제2, 제3 등의 용어가 다양한 구성요소들을 기술하기 위해서 사 용되었지만, 이들 구성요소들이 이 같은 용어들에 의해서 한정되어서는 안 된다. 이들 용어들은 단지 어느 구성 요소를 다른 구성요소와 구별시키기 위해서 사용되었을 뿐이다. 따라서, 어느 한 실시 예에 제 1 구성요소로 언 급된 것이다른 실시 예에서는 제 2 구성요소로 언급될 수도 있다. 여기에 설명되고 예시되는 각 실시 예는 그 것의 상보적인 실시 예도 포함한다. 또한, 본 명세서에서 '및/또는'은 전후에 나열한 구성요소들 중 적어도 하 나를 포함하는 의미로 사용되었다. 명세서에서 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한 복수의 표현을 포함한다. 또한, \"포함하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 구성요소 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징이나 숫자, 단계, 구성요소 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 배제하는 것으로 이해되어서는 안 된다. 또한, 본 명세서에서 \"연결\"은 복수의 구성 요소를 간접적으로 연결하는 것, 및 직접적으로 연결하는 것을 모두 포함하는 의미로 사용된다. 또한, 하기에서 본 발명을 설명함에 있어 관련된 공지 기능 또는 구성에 대한 구체적인 설명이 본 발명의 요지 를 불필요하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명은 생략할 것이다. 도 1은 본 발명의 실시 예에 따른 청각 장애인을 위한 가정용 소셜 로봇 장치를 나타내는 사시도이고, 도 2는 도 1의 청각 장애인을 위한 가정용 소셜 로봇 장치의 구성을 나타내는 블록도이다. 도 1 및 도 2를 참조하면, 본 발명에 따른 청각 장애인을 위한 가정용 소셜 로봇 장치는 실내에서 발생하 는 소리의 종류 및 발생 위치를 파악하고, 이를 청각장애인에게 전달하여 청각장애인이 소리에 대응할 수 있도 록 보조한다. 청각 장애인을 위한 가정용 소셜 로봇 장치는 바디, 사물 감지 센서, 위치 감지 센서, 소리 감지 센서, 충돌 감지 센서, 스위치부, 구동부, 통신부, 디스플레 이부, 그리고 제어부를 포함한다. 바디는 소정 형상을 가지며, 가정용 소셜 로봇 장치의 몸체를 구성한다. 실시 예에 의하면, 바디 는 육면체 형상을 가질 수 있다. 도면에는 도시하지 않았지만, 바디의 저면에는 휠이 제공된다. 휠은 지면을 따라 굴러 바디를 이동시킬 수 있고, 바디의 방향을 전환시킬 수 있다. 사물 감지 센서는 바디의 전면에 결합한다. 사물 감지 센서는 바디 주변을 촬영하여 사물 을 감지한다. 사물 감시 센서는 바디에 대한 사물의 상대적 위치 정보와 사물의 형상 정보를 감지할 수 있다. 사물 감지 센서는 깊이 지각 카메라가 사용될 수 있다. 위치 감지 센서는 바디의 전면에 결합한다. 위치 감지 센서는 주변 공간에 대한 바디의 상 대 위치 정보를 감지한다. 위치 감지 센서는 주변 공간을 스캐닝하여 주변 공간의 3차원 정보를 획득할 수 있다. 소리 감지 센서는 바디와 결합하며, 주변에서 발생하는 소리 정보를 감지한다. 소리 정보는 실내에서 발생할 수 있는 다양한 소리를 포함한다. 소리 감지 센서는 마이크로폰 어레이 센서가 사용될 수 있다. 충돌 감지 센서는 바디와 결합하며, 바디의 충돌 여부를 감지한다. 충돌 감지 센서는 진동 감지 센서 또는 가속도 센서가 사용될 수 있다. 스위치부는 바디와 결합하며, 바디의 외부에 노출된다. 스위치부는 사용자의 터치 또는 조 작으로 스위칭 신호를 발생시킨다. 구동부)는 바디의 내부에 제공되며, 휠을 구동시킨다. 통신부는 바디의 내부에 제공되며, 사용자 단말기와 통신 가능하다. 디스플레이부는 바디의 상면에 결합하며, 소리 감지 센서에서 측정된 소리 정보를 시각적으로 표시한다. 제어부는 사물 감지 센서, 위치 감지 센서, 소리 감지 센서, 충돌 감지 센서, 그리고 스위치부로부터 정보를 수신하고, 수신된 정보를 인공지능 알고리즘으로 분석한다. 구체적으로, 제어부는 사물 감지 센서로부터 바디 주변의 이미지 정보를 수신하고, 이미지 정보 를 분석하여 사용자의 위치 정보와 사용자의 형상 정보를 생성한다. 여기서 사용자란, 실내에서 거주하는 사람 으로써, 바람직하게는 청각 장애인을 일컫는다. 실내에 다수의 사람이 거주하는 경우, 이중 청각 장애인의 형상 정보(키, 체형, 머리 스타일 등)가 초기 설정 시 데이터 저장부에 저장되고, 제어부는 수신된 이미지 정보를 분 석하여 청각 장애인의 형상 정보와 일치하는 대상체를 청각 장애인으로 판단하고, 청각 장애인의 위치 정보를 생성한다. 제어부는 위치 감지 센서로부터 주변 공간의 3차원 정보와 바디의 위치 정보를 수신한다. 제어 부는 주변 공간의 3차원 정보와 바디의 위치 정보를 분석하여, 로봇 장치의 자율 주행 경로를 산출한다. 제어부는 소리 감지 센서로부터 소리 정보를 수신하고, 소리 정보를 분석하여, 해당 소리가 사용자의 인지가 요구되는 알람 요청 정보인지 판단한다. 알람 요청 정보에 해당하는 소리는 사용자에 의해 미리 설정될 수 있다. 알람 요청 정보는 사용자가 해당 소리를 인지할 경우 즉각적인 조치가 요구되는 생활 속 다양한 소리 정보를 의미한다. 실시 예에 의하면, 알람 요청 정보는 물 소리, 물 끓는 소리, 아기 울음 소리, 노크 소리, 초 인종 소리, 화재 알람 소리 등을 포함한다. 제어부는 소리 감지 센서로부터 수신된 소리 정보가 알람 요청 정보로 판단되는 경우, 로봇 장치 의 현재 위치 정보와, 소리 정보의 종류와 발생 위치 정보를 디스플레부에 전송한다. 디스플레이부 는 로봇 장치의 현재 위치 정보와, 소리 정보의 종류와 발생 위치 정보를 시각적으로 표시한다. 제어부는 소리 감지 센서로부터 수신된 소리 정보가 알람 요청 정보로 판단되는 경우, 수신된 소리 정보의 종류와 발생 위치 정보를 통신부를 통해 사용자 단말기에 전송한다. 사용자 단말기는 스마 트폰, 개인용 PC, 그리고 테블릿 PC 등을 포함하며, 문자 메시지, SNS 메시지, 웹페이지 알람 등으로 사용자 단 말기에 전송될 수 있다. 제어부는 소리 정보의 종류와 발생 위치 정보를 사용자 단말기에 전송 후, 기 설정된 시간 동안 스위 치부로부터 스위칭 신호가 수신되지 않은 경우, 로봇 장치가 청각 장애인의 위치 정보에 해당하는 지 점으로 이동하도록 구동부를 제어한다. 그리고 제어부는 청각 장애인의 위치 정보에 해당하는 지점으 로 바디가 전진 및 후퇴를 반복하도록 구동부를 제어한다. 이 과정에서 바디는 청각 장애인과 충돌한다. 충돌 과정에서 충돌 감지 센서에 측정된 신호는 제어부에 전송되며, 제어부는 바디 의 충돌 여부 및 충돌 횟수를 산출한다. 바디의 충돌 회수는 사용자에 의해 미리 설정되며, 기 설정 된 회수로 바디가 충돌하게 되면, 제어부는 구동부의 구동을 정지시킨다. 이와 달리, 제어부는 스위치부로부터 스위칭 신호가 수신되면, 구동부의 구동을 정지시킬 수 있다. 바디가 청각 장애인과 충돌하는 동안, 디스플레이부에는 로봇 장치의 현재 위치 정보와, 소리 정보의 종류와 발생 위치 정보가 시각적으로 표시된다. 제어부는 스위치부로부터 스위칭 신호가 수신되면, 소리 정보의 발생 위치 정보에 대응하는 지점으로 로봇 장치가 이동하도록 구동부를 제어한다. 이하, 상술한 가정용 소셜 로봇 장치가 청각 장애인의 생활을 보조하는 과정에 대해 자세하게 설명한다. 도 3 내지 도 5는 본 발명에 따른 가정용 소셜 로봇 장치가 청각 장애인의 생활을 보조하는 과정을 순차적으로 나타내는 도면이다. 도 3을 참조하면, 로봇 장치는 사물 감지 센서로부터 바디 주변의 이미지 정보를 수신하고, 이 미지 정보를 분석하여 사용자의 위치 정보와 사용자의 형상 정보를 생성한다. 사용자의 형상 정보 가 기 저장된 청각 장애인의 형상 정보와 일치하는 경우, 청각 장애인의 위치 정보를 저장한다. 로봇 장치는 위치 감지 센서로부터 수신된 주변 공간의 3차원 정보와 바디의 위치 정보를 분석 하여, 자율 주행 경로를 산출하고, 산출된 경로를 따라 실내 공간을 배회한다. 소리 감지 센서에 주변 소리 정보가 수신되면, 소리 정보는 제어부에 전달된다. 제어부(20 0)는 수신된 소리 정보가 알람 요청 정보에 해당하는지 분석한다. 수신된 소리 정보가 알람 요청 정보 에 해당한다고 판단될 경우, 제어부는 로봇 장치의 현재 위치 정보, 소리 정보의 종류와 소리 발 생 위치 정보를 통신부를 통해 사용자 단말기에 전송한다. 청각 장애인은 사용자 단말기에 수신된 정보를 통해 소리 정보의 발생을 확인할 수 있다. 청각 장애인 이 사용자 단말기를 통해 소리 정보를 확인하고, 스위치부를 터치하거나 누를 경우, 스위칭 신호 가 제어부에 전송된다. 제어부는 스위칭 신호가 수신되면, 로봇 장치가 소리 정보의 발생 위치 정보에 해당하는 지점으로 이동하도록 구동부를 제어한다. 청각 장애인은 로봇 장치를 따라 이동 함으로써 발생된 소리 정보에 대해 즉각적인 조치를 취할 수 있다. 한편, 청각 장애인이 사용자 단말기에 수신된 정보를 확인하지 못할 수 있다. 제어부는 로봇 장치 의 현재 위치 정보와, 소리 정보의 종류와 소리 발생 위치 정보를 사용자 단말기에 전송 후 기 설정된 시간 동안 스위칭 신호가 발생되지 않을 경우, 청각 장애인이 사용자 단말기에 수신된 정보를 확인하지 못한 것으로 판단하고, 청각 장애인이 위치하고 있는 지점으로 이동한다. 제어부는 사물 감지 센서 로부터 수신된 이미지 정보를 분석하여 해당 지점에 청각 장애인이 위치하고 있는 것으로 판단되면, 청각 장애인의 위치 정보에 해당하는 지점으로 바디가 전진 및 후퇴를 반복하도록 구동부를 제어 한다. 이 과정에서 바디는 청각 장애인과 충돌하므로, 청각 장애인이 소리 정보의 발생을 인지할 수 있게 된다. 소리 정보의 발생을 인지한 청각 장애인이 스위치부를 터치하거나 누를 경우, 스위칭 신호가 제어부에 전송된다. 제어부는 스위칭 신호가 수신되면, 로봇 장치가 소리 정보의 발생 위치 정보에 해당하는 지점으로 이동하도록 구동부를 제어한다. 청각 장애인은 로봇 장치를 따라 이동함으로써 발생된 소리 정보에 대해 즉각적으로 대응할 수 있다. 청각 장애인이 로봇 장치에 저장된 위치 정보에서 다른 지점으로 이동할 경우, 로봇 장치는 자율 주행 경로를 따라 이동하고, 사물 감지 센서로부터 수신된 이미지 정보를 분석하여 청각 장애인의 위치를 찾는다. 청각 장애인이 발견되면, 청각 장애인이 위치하는 지점으로 이동 후 상술한 과정으로 청각 장애인와 충돌한다. 이상, 본 발명을 바람직한 실시 예를 사용하여 상세히 설명하였으나, 본 발명의 범위는 특정 실시 예에 한정되"}
{"patent_id": "10-2020-0134966", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "는 것은 아니며, 첨부된 특허청구범위에 의하여 해석되어야 할 것이다. 또한, 이 기술분야에서 통상의 지식을 습득한 자라면, 본 발명의 범위에서 벗어나지 않으면서도 많은 수정과 변형이 가능함을 이해하여야 할 것이다."}
{"patent_id": "10-2020-0134966", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시 예에 따른 청각 장애인을 위한 가정용 소셜 로봇 장치를 나타내는 사시도이다. 도 2는 도 1의 청각 장애인을 위한 가정용 소셜 로봇 장치의 구성을 나타내는 블록도이다. 도 3 내지 도 5는 본 발명에 따른 가정용 소셜 로봇 장치가 청각 장애인의 생활을 보조하는 과정을 순차적으로 나타내는 도면이다."}
