{"patent_id": "10-2023-0051198", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0154813", "출원번호": "10-2023-0051198", "발명의 명칭": "하이브리드 360도 영상 감시 카메라 및 그를 이용한 영상 처리 방법", "출원인": "주식회사 피에스아이노딕", "발명자": "박인천"}}
{"patent_id": "10-2023-0051198", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "주간과 야간에 걸쳐 주변의 사물에 대한 360도 영상을 취득하여 메인 보드로 전달하는 카메라 모듈;전용 클라이언트 프로그램이나 웹/앱 프로그램 연결을 통한 패킷 정보교환을 통해 상기 카메라 모듈의 설정 및제어처리를 수행하고, 상기 카메라 모듈로부터 360도 원본(original) 영상을 수신하여 외부의 디지털 영상 수신장치 및 아날로그 영상 수신장치로 전달할 영상을 처리 및 생성하며, 상기 360도 원본 영상을 분석하여 사람이나 사물, 문자나 이미지를 인식 및 처리하여 상응하는 정보를 표출하고, 시스템의 전체 인터페이스 처리와 시스템의 정보, 사용자 정보 또는 영상 저장을 위한 보안 및 암호화 정보를 저장 및 관리하는 메인 보드;상기 메인 보드로부터 처리된 영상을 수신하여 아날로그 신호로 변환하여 송신하고, 아날로그 카메라의 제어 정보를 송/수신 및 처리하는 아날로그 처리 보드;단일 이더넷(ethernet) 선을 기반으로 상기 메인 보드로부터의 디지털 신호를 상기 디지털 영상 수신장치로 전송하거나, 디지털 영상 수신장치로부터의 디지털 신호를 상기 메인 보드로 전송하며, PoE(Power over Ethernet)에 의한 전원부로의 전원 공급을 처리하는 PoE 인터페이스부;단일 동축케이블을 기반으로 상기 아날로그 처리 보드로부터의 아날로그 영상신호를 상기 아날로그 영상 수신장치로 전송하거나, 아날로그 영상 수신장치로부터의 아날로그 신호 또는 디지털 신호를 상기 아날로그 처리 보드로 전송하며, PoC(Power over Coaxial)에 의한 전원부로의 전원 공급을 처리하는 PoC 인터페이스부; 및상기 PoE 인터페이스부 또는 PoC 인터페이스부로부터 전원을 공급받은 후 상기 카메라 모듈, 메인 보드 및 아날로그 처리 보드의 구동용 전원으로 변환하여 카메라 모듈, 메인 보드 및 아날로그 처리 보드로 각각 구동 전원을 공급하는 전원부를 포함하는 하이브리드 360도 영상 감시 카메라."}
{"patent_id": "10-2023-0051198", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 메인 보드에서의 영상 처리 및 분석과 관련하여 오디오 신호의 입/출력을 처리하는 오디오 모듈을 더 포함하는 하이브리드 360도 영상 감시 카메라."}
{"patent_id": "10-2023-0051198", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,각종 IoT(Internet of Things) 센서 정보의 연계를 통해 주변 사물의 정보를 수집하고 출력을 처리하는 센서 모듈을 더 포함하는 하이브리드 360도 영상 감시 카메라."}
{"patent_id": "10-2023-0051198", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,스위치 및 릴레이의 제어를 통해 주변 IoT 기기의 동작을 제어하는 제어 모듈을 더 포함하는 하이브리드 360도영상 감시 카메라."}
{"patent_id": "10-2023-0051198", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2024-0154813-3-제1항에 있어서,상기 카메라 모듈과 메인 보드는 MIPI(Mobile Industry Processor Interface)/CSI(Camera Serial interface)신호를 통해 상호 영상 신호를 송수신하도록 구성된 하이브리드 360도 영상 감시 카메라."}
{"patent_id": "10-2023-0051198", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 메인 보드는,전용 클라이언트 프로그램이나 웹/앱 프로그램 연결을 통한 패킷 정보교환을 통해 상기 카메라 모듈의 설정 및제어를 수행하고, 상기 아날로그 처리 보드로부터 전달되는 제어 정보의 처리와, 카메라 모듈 및 사용자 정보의원격 설정 및 제어를 수행하는 제어 처리부;상기 카메라 모듈로부터 360도 원본(original) 영상을 수신하여 상기 디지털 영상 수신장치 및 아날로그 영상수신장치로 전달할 영상을 처리 및 생성하고, 상기 제어 처리부로 입력된 이미지 및 영상 스트림과 관련한 설정과 제어 명령을 수신하여 상기 카메라 모듈 및 시스템 관련 기능을 조정하는 영상 처리부;상기 360도 원본 영상을 분석하여 사람이나 사물, 문자나 이미지를 인식 및 처리하여 상응하는 정보를 표출하는AI(인공지능) 처리부;상기 카메라 모듈, 제어 처리부, 영상 처리부 및 AI(인공지능) 처리부와 모듈의 동작상태, 통신상태, 설정값 등을 확인하고 설정하는 기능을 수행하는 사용자 인터페이스부; 및카메라 시스템의 전체 인터페이스 처리와 카메라 시스템의 정보, 사용자 정보 또는 영상 저장을 위한 보안 및암호화 정보를 저장 및 관리하는 시스템 관리부를 포함하여 구성된 하이브리드 360도 영상 감시 카메라."}
{"patent_id": "10-2023-0051198", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 영상 처리부는 프레임 속도 변화를 포함한 영상신호의 형태변환, H.264, H.265를 포함한 코덱(CODEC)을 통한 디지털 영상으로의 압축, 디와프(Dewarp)와 같은 영상변환, 영상분할, 영상결합, 영상추출을 포함한 영상처리를 수행하는 하이브리드 360도 영상 감시 카메라."}
{"patent_id": "10-2023-0051198", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서,상기 영상 처리부는 360도 영상 중 일정 각도의 영상의 추출이나 여러 각도의 영상을 조합하여 다양한 뷰를 만드는 것을 포함한 영상의 추출 및 조합의 처리를 수행하는 하이브리드 360도 영상 감시 카메라."}
{"patent_id": "10-2023-0051198", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제6항에 있어서,상기 영상 처리부는 디지털 영상 수신장치와 아날로그 영상 수신장치로 전달할 영상을 생성함에 있어서, 멀티스트리밍을 통해 원본 영상을 여러 개의 다른 형태의 영상 스트림으로 동시에 생성하는 하이브리드 360도 영상 감시 카메라."}
{"patent_id": "10-2023-0051198", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "공개특허 10-2024-0154813-4-제6항에 있어서,상기 영상 처리부는 영상 저장 기능을 통해 카메라에 내장되어 있는 또는 탈착형 저장 매체에 원본 영상 및 처리된 영상을 저장하는 하이브리드 360도 영상 감시 카메라."}
{"patent_id": "10-2023-0051198", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제6항에 있어서,상기 영상 처리부와 상기 아날로그 처리 보드는 MIPI(Mobile Industry Processor Interface)/CSI(CameraSerial interface) 신호 또는 일반표준 아날로그 방식의 CCIR(Consultative Committee on InternationalRadio) 또는 EIA(Electronic Industries Association) 신호를 이용하여 상호 영상 신호를 송수신하도록 구성된하이브리드 360도 영상 감시 카메라."}
{"patent_id": "10-2023-0051198", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제6항에 있어서,상기 아날로그 처리 보드는,상기 메인 보드의 영상 처리부로부터 디지털 신호 또는 아날로그 신호를 수신하여 아날로그 영상신호로 변환하여 송신하는 아날로그 영상 송신부; 및상기 아날로그 영상 수신장치의 DVR(Digital Video Recorder)과 카메라를 연결할 때, 별도의 제어선 없이 동축케이블만으로 카메라를 제어할 수 있는 UTC(up the coax) 통신 방법을 사용하여 카메라의 제어 정보를 송수신하여 처리하는 데이터 처리부를 포함하여 구성된 하이브리드 360도 영상 감시 카메라."}
{"patent_id": "10-2023-0051198", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "a) 영상 처리부가 카메라 모듈로부터 영상 정보를 취득하는 단계;b) 영상 처리부가 취득한 360도 원본 영상 및 영상 변환된 영상으로부터 영상 스트림을 생성하는 단계;c) AI(인공지능) 처리부가 생성된 상기 영상 스트림의 정보를 분석하여 AI 정보를 생성하는 단계;d) AI(인공지능) 처리부가 상기 생성된 AI 정보를 상기 영상 스트림에 결합하여 AI 정보가 결합된 영상 스트림을 생성하는 단계;e) 영상 처리부가 상기 생성된 AI 정보가 결합된 영상 스트림(i)을 디지털 영상 수신장치 또는 아날로그 영상수신장치 측으로 전송하는 단계;f) 제어 처리부가 상기 영상 스트림의 동작 설정 상태 여부를 판별하는 단계; 및g) 상기 판별에서 상기 영상 스트림이 동작 설정 상태에 있으면, 제어 처리부가 상기 단계 b)로 프로세스를 회귀시키고, 상기 영상 스트림이 동작 설정 상태에 있지 않으면, 프로세스를 종료하는 단계를 포함하는 하이브리드 360도 영상 감시 카메라를 이용한 영상 처리 방법."}
{"patent_id": "10-2023-0051198", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 단계 e)에서 영상 처리부가 상기 생성된 AI 정보가 결합된 영상 스트림(i)을 디지털 영상 수신장치 또는아날로그 영상 수신장치 측으로 전송하되,e-1) 영상 처리부가 일정 주기(Ti)로 영상 스트림 전송량과 수신 측의 영상 스트림 수신량을 각각 측정하는 단계;공개특허 10-2024-0154813-5-e-2) 영상 처리부가 상기 영상 스트림 전송량과 영상 스트림 수신량 간의 차이가 미리 설정한 설정값(A)보다 큰지를 판별하는 단계; 및e-3) 상기 판별에서 상기 영상 스트림 전송량과 영상 스트림 수신량 간의 차이가 설정값(A)보다 크면, 영상 처리부가 영상 전송 형태를 변경 제어하는 단계를 더 포함하는 하이브리드 360도 영상 감시 카메라를 이용한 영상처리 방법."}
{"patent_id": "10-2023-0051198", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 단계 e-1)에서 영상 처리부가 일정 주기(Ti)로 영상 스트림 전송량과 수신 측의 영상 스트림 수신량을 각각 측정함에 있어서, 영상 스트림 송신 측(영상 처리부)에서는 영상 스트림 수신 측으로부터 일정 주기(Ti) 동안 수신된 영상 정보량을 받아 주기 Ti 동안 영상정보의 전송량을 측정하는 것을 특징으로 하는 하이브리드 360도 영상 감시 카메라를 이용한 영상 처리 방법."}
{"patent_id": "10-2023-0051198", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제14항에 있어서,상기 단계 e-3)에서 영상 처리부가 영상 전송 형태를 변경 제어함에 있어서, 영상의 이미지 크기를 조절하거나영상 전송속도를 조절하는 방식으로 영상 전송 형태를 변경 제어하는 것을 특징으로 하는 하이브리드 360도 영상 감시 카메라를 이용한 영상 처리 방법."}
{"patent_id": "10-2023-0051198", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 하이브리드 360도 영상 감시 카메라 및 그를 이용한 영상 처리 방법에 관한 것이다. 본 발명에 따른 하이브리드 360도 영상 감시 카메라는, 주변의 사물에 대한 360도 영상을 취득하여 메인 보드로 전달하는 카메라 모듈; 카메라 모듈로부터 360도 원본 영상을 수신하여 외부의 디지털 및 아날로그 영상 수신장 (뒷면에 계속)"}
{"patent_id": "10-2023-0051198", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 영상 감시 카메라에 관한 것으로서, 더 상세하게는 디지털 및 아날로그 출력을 겸비한 360도 영상 감 시 카메라를 도입함으로써, 영상 수신장치의 신호방식에 상관 없이 영상의 전송, 변환 및 처리가 가능한 하이브 리드 360도 영상 감시 카메라 및 그를 이용한 영상 처리 방법에 관한 것이다."}
{"patent_id": "10-2023-0051198", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "보안 감시 카메라는 실내와 실외 다양한 곳에 설치되어 운영되고 있으나, 넓은 각도 또는 여러 장소를 감시하기 위해서는 그만큼 다수의 카메라를 설치해야 한다. 이는 제품의 비용 및 설치공사 비용의 상승을 수반하며, 시스 템 구성을 복잡하게 만드는 원인이 된다. 이를 해결하기 위한 방법으로 어안(Fisheye) 렌즈 등을 이용하여 일반 카메라보다 넓은 화각을 제공하는 카메라를 사용할 수 있다. 이러한 360도 카메라는 일반 카메라에 비해 넓은 화각을 통해 여러 대의 일반 화각 카메라를 대체하는 효과를 가질 수 있다. 영상 감시 카메라는 디지털 방식과 아날로그 방식으로 분류할 수 있다. 디지털 방식 카메라는 디지털 영상정보 처리와 IP 패킷 기반의 영상전송을 기반으로 하여 영상의 변형, 압축, 분할 등이 쉽고, 다양한 기능의 접목 구 현이 용이한 반면, 전송에 있어 지연이 발생할 수 있으며, 네트워크 연결 방식으로 인해 아날로그 방식에 비해 보안이 다소 취약하다. 아날로그 방식 카메라는 전용 케이블을 통해 지연이 적고 안정적인 영상 전달에 장점이 있으며 보안에 강하고 구현이 단순하다. 일반적으로 디지털 카메라는 복잡한 기능의 구현이 가능한 만큼 고사양의 제품으로 구현되며, 아날로그 카메라 는 아날로그 신호 기반의 동축케이블 전송 제약으로 저사양 중심의 제품으로 구현되어 적용되고 있다. 360도 카메라에는 대부분 다양한 영상변환 및 처리가 가능한 디지털 카메라 방식이 적용된다. 360도 어안렌즈 (Fisheye)에 의해 생성된 원본 영상뿐 아니라, 영상의 디와프(De-warp:영상 평활화) 처리에 의해 펼쳐진 영상, 다양한 뷰 모드를 적용한 분할영상, 일부영역만 추출한 영상, 여러 개의 영상스트림의 동시전송(멀티스트림) 등 이 가능하기 때문이다. 기존의 아날로그 방식 360도 카메라는 카메라단에서는 영상 전송만 담당하고, 영상의 변환이나 처리는 영상 수 신장치에서 수행하는 구조로 구성되어 있다. 이와 같은 기존의 아날로그 방식 360도 카메라에서는 영상 수신장 치의 영상처리 부하가 집중되는 문제가 발생하며, 카메라단에서 원본 영상 전체를 전달하다보니 아날로그 방식 으로 전송할 수 있는 영상의 품질에 제약이 있어 수신장치에서 필요한 영상 품질을 확보하기 어려운 문제가 있 다. 이러한 요인들로 인해 아날로그 방식에서 360도 카메라의 적용에는 한계가 존재한다. 360도 카메라와 영상 수신장치 간 처리방식(디지털 방식 또는 아날로그 방식)이 다를 경우 장치간 연결이 어렵 다. 디지털 방식의 360도 카메라를 설치하고자 할 때 영상 수신장치까지 교체해야 하는 문제가 발생한다. 특히 기존 아날로그 카메라와 아날로그 방식 영상 수신장치를 사용하는 환경에서 새로운 디지털 방식 360도 카메라를 설치하고자 하거나 추가하고자 할 때, 연결이 복잡해지며 별도의 신호 변환에 따른 비용이 발생한다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국 공개특허공보 제10-2021-0112495호(2021.09.15. 공개)"}
{"patent_id": "10-2023-0051198", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 사항을 종합적으로 감안하여 창출된 것으로서, 디지털 및 아날로그 출력을 겸비한 360도 영상 감시 카메라를 도입함으로써, 영상 수신장치의 신호방식에 상관없이, 그리고 다른 방식으로의 영상 수신장 치의 교체(아날로그에서 디지털 방식 또는 디지털에서 아날로그 방식으로의 교체)에도 상관없이 360도 영상 감 시 카메라에 의해 촬영된 영상의 전송, 변환 및 처리가 가능한 하이브리드 360도 영상 감시 카메라 및 그를 이 용한 영상 처리 방법을 제공함에 그 목적이 있다."}
{"patent_id": "10-2023-0051198", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기의 목적을 달성하기 위하여 본 발명에 따른 하이브리드 360도 영상 감시 카메라는, 주간과 야간에 걸쳐 주변의 사물에 대한 360도 영상을 취득하여 메인 보드로 전달하는 카메라 모듈; 전용 클라이언트 프로그램이나 웹/앱 프로그램 연결을 통한 패킷 정보교환을 통해 상기 카메라 모듈의 설정 및 제어처리를 수행하고, 상기 카메라 모듈로부터 360도 원본(original) 영상을 수신하여 외부의 디지털 영상 수신 장치 및 아날로그 영상 수신장치로 전달할 영상을 처리 및 생성하며, 상기 360도 원본 영상을 분석하여 사람이 나 사물, 문자나 이미지를 인식 및 처리하여 상응하는 정보를 표출하고, 시스템의 전체 인터페이스 처리와 시스 템의 정보, 사용자 정보 또는 영상 저장을 위한 보안 및 암호화 정보를 저장 및 관리하는 메인 보드; 상기 메인 보드로부터 처리된 영상을 수신하여 아날로그 신호로 변환하여 송신하고, 아날로그 카메라의 제어 정 보를 송/수신 및 처리하는 아날로그 처리 보드; 단일 이더넷(ethernet) 선을 기반으로 상기 메인 보드로부터의 디지털 신호를 상기 디지털 영상 수신장치로 전 송하거나, 디지털 영상 수신장치로부터의 디지털 신호를 상기 메인 보드로 전송하며, PoE(Power over Etherne t)에 의한 전원부로의 전원 공급을 처리하는 PoE 인터페이스부; 단일 동축케이블을 기반으로 상기 아날로그 처리 보드로부터의 아날로그 영상신호를 상기 아날로그 영상 수신장 치로 전송하거나, 아날로그 영상 수신장치로부터의 아날로그 신호 또는 디지털 신호를 상기 아날로그 처리 보드 로 전송하며, PoC(Power over Coaxial)에 의한 전원부로의 전원 공급을 처리하는 PoC 인터페이스부; 및 상기 PoE 인터페이스부 또는 PoC 인터페이스부로부터 전원을 공급받은 후 상기 카메라 모듈, 메인 보드 및 아날 로그 처리 보드의 구동용 전원으로 변환하여 카메라 모듈, 메인 보드 및 아날로그 처리 보드로 각각 구동 전원 을 공급하는 전원부를 포함하는 점에 그 특징이 있다. 여기서, 바람직하게는 상기 메인 보드에서의 영상 처리 및 분석과 관련하여 오디오 신호의 입/출력을 처리하는 오디오 모듈을 더 포함할 수 있다. 또한, 각종 IoT(Internet of Things) 센서 정보의 연계를 통해 주변 사물의 정보를 수집하고 출력을 처리하는 센서 모듈을 더 포함할 수 있다. 또한, 스위치 및 릴레이의 제어를 통해 주변 IoT 기기의 동작을 제어하는 제어 모듈을 더 포함할 수 있다. 또한, 상기 카메라 모듈과 메인 보드는 MIPI(Mobile Industry Processor Interface)/CSI(Camera Serial interface) 신호를 통해 상호 영상 신호를 송수신하도록 구성될 수 있다. 또한, 상기 메인 보드는, 전용 클라이언트 프로그램이나 웹/앱 프로그램 연결을 통한 패킷 정보교환을 통해 상기 카메라 모듈의 설정 및 제어를 수행하고, 상기 아날로그 처리 보드로부터 전달되는 제어 정보의 처리와, 카메라 모듈 및 사용자 정보의 원격 설정 및 제어를 수행하는 제어 처리부; 상기 카메라 모듈로부터 360도 원본(original) 영상을 수신하여 상기 디지털 영상 수신장치 및 아날로그 영상 수신장치로 전달할 영상을 처리 및 생성하고, 상기 제어 처리부로 입력된 이미지 및 영상 스트림과 관련한 설정 과 제어 명령을 수신하여 상기 카메라 모듈 및 시스템 관련 기능을 조정하는 영상 처리부; 상기 360도 원본 영상을 분석하여 사람이나 사물, 문자나 이미지를 인식 및 처리하여 상응하는 정보를 표출하는 AI(인공지능) 처리부; 상기 카메라 모듈, 제어 처리부, 영상 처리부 및 AI(인공지능) 처리부와 모듈의 동작상태, 통신상태, 설정값 등 을 확인하고 설정하는 기능을 수행하는 사용자 인터페이스부; 및 카메라 시스템의 전체 인터페이스 처리와 카메라 시스템의 정보, 사용자 정보 또는 영상 저장을 위한 보안 및 암호화 정보를 저장 및 관리하는 시스템 관리부를 포함하여 구성될 수 있다. 여기서, 상기 영상 처리부는 프레임 속도 변화를 포함한 영상신호의 형태변환, H.264, H.265 등 코덱(CODEC)을 통한 디지털 영상으로의 압축, 디와프(Dewarp)와 같은 영상변환, 영상분할, 영상결합, 영상추출 등과 같은 영상 처리를 수행할 수 있다. 또한, 상기 영상 처리부는 360도 영상 중 일정 각도의 영상의 추출이나 여러 각도의 영상을 조합하여 다양한 뷰 를 만드는 등 영상의 추출 및 조합의 처리를 수행할 수 있다. 또한, 상기 영상 처리부는 디지털 영상 수신장치와 아날로그 영상 수신장치로 전달할 영상을 생성함에 있어서, 멀티스트리밍을 통해 원본 영상을 여러 개의 다른 형태의 영상스트림으로 동시에 생성할 수 있다. 또한, 상기 영상 처리부는 영상 저장 기능을 통해 카메라에 내장되어 있는 또는 탈착형 저장 매체에 원본 영상 및 처리된 영상을 저장할 수 있다. 또한, 상기 영상 처리부와 상기 아날로그 처리 보드는 MIPI(Mobile Industry Processor Interface)/CSI(Camera Serial interface) 신호 또는 일반표준 아날로그 방식의 CCIR(Consultative Committee on International Radio) 또는 EIA(Electronic Industries Association) 신호를 이용하여 상호 영상 신호를 송수신하도록 구성될 수 있다. 또한, 상기 아날로그 처리 보드는, 상기 메인 보드의 영상 처리부로부터 디지털 신호 또는 아날로그 신호를 수신하여 아날로그 영상신호로 변환하 여 송신하는 아날로그 영상 송신부; 및 상기 아날로그 영상 수신장치의 DVR(Digital Video Recorder)과 카메라를 연결할 때, 별도의 제어선 없이 동축 케이블만으로 카메라를 제어할 수 있는 UTC(up the coax) 통신 방법을 사용하여 카메라의 제어 정보를 송수신하 여 처리하는 데이터 처리부를 포함하여 구성될 수 있다. 또한, 상기의 목적을 달성하기 위하여 본 발명에 따른 하이브리드 360도 영상 감시 카메라를 이용한 영상 처리 방법은, a) 영상 처리부가 카메라 모듈로부터 영상 정보를 취득하는 단계; b) 영상 처리부가 취득한 360도 원본 영상 및 영상 변환된 영상으로부터 영상 스트림을 생성하는 단계; c) AI(인공지능) 처리부가 생성된 상기 영상 스트림의 정보를 분석하여 AI 정보를 생성하는 단계; d) AI(인공지능) 처리부가 상기 생성된 AI 정보를 상기 영상 스트림에 결합하여 AI 정보가 결합된 영상 스트림 을 생성하는 단계; e) 영상 처리부가 상기 생성된 AI 정보가 결합된 영상 스트림(i)을 디지털 영상 수신장치 또는 아날로그 영상 수신장치 측으로 전송하는 단계; f) 제어 처리부가 상기 영상 스트림의 동작 설정 상태 여부를 판별하는 단계; 및 g) 상기 판별에서 , 상기 영상 스트림이 동작 설정 상태에 있으면, 제어 처리부가 상기 단계 b)로 프로세스를 회귀시키고, 상기 영상 스트림이 동작 설정 상태에 있지 않으면, 프로세스를 종료하는 단계를 포함하는 점에 그 특징이 있다. 여기서, 상기 단계 e)에서 영상 처리부가 상기 생성된 AI 정보가 결합된 영상 스트림(i)을 디지털 영상 수신장 치 또는 아날로그 영상 수신장치 측으로 전송하되, e-1) 영상 처리부가 일정 주기(Ti)로 영상 스트림 전송량과 수신 측의 영상 스트림 수신량을 각각 측정하는 단 계; e-2) 영상 처리부가 상기 영상 스트림 전송량과 영상 스트림 수신량 간의 차이가 미리 설정한 설정값(A)보다 큰 지를 판별하는 단계; 및 e-3) 상기 판별에서 상기 영상 스트림 전송량과 영상 스트림 수신량 간의 차이가 설정값(A)보다 크면, 영상 처 리부가 영상 전송 형태를 변경 제어하는 단계를 더 포함할 수 있다. 이때, 상기 단계 e-1)에서 영상 처리부가 일정 주기(Ti)로 영상 스트림 전송량과 수신 측의 영상 스트림 수신량 을 각각 측정함에 있어서, 영상 스트림 송신 측(영상 처리부)에서는 영상 스트림 수신 측으로부터 일정 주기 (Ti) 동안 수신된 영상 정보량을 받아 주기 Ti 동안 영상정보의 전송량을 측정할 수 있다. 또한, 상기 단계 e-3)에서 영상 처리부가 영상 전송 형태를 변경 제어함에 있어서, 영상의 이미지 크기를 조절 하거나 영상 전송속도를 조절하는 방식으로 영상 전송 형태를 변경 제어할 수 있다."}
{"patent_id": "10-2023-0051198", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이와 같은 본 발명에 의하면, 디지털 영상전송과 아날로그 영상전송 기능을 겸비하므로 디지털 방식의 영상 수 신장치 또는 아날로그 방식의 영상 수신장치에 상관없이 연결이 가능하며, 디지털 방식과 아날로그 방식 모두에 동시에 연결이 가능하여 근거리에서는 아날로그 방식으로 원거리에서는 디지털 방식으로 각기 다른 위치에서 감 시가 가능하다. 또한, 기설치된 수신장치의 종류에 상관없이 360도 카메라의 연결이 가능하며, 기존에 설치된 영상 수신장치를 다른 방식의 영상 수신장치로 교체하더라도(예를 들면, 아날로그 방식을 디지털 방식 또는 디지털 방식을 아날 로그 방식으로 교체하더라도) 카메라의 교체없이 바로 360도 영상의 전송이 가능하여 현장 설치가 편리하며, 이 에 따라 운영 비용을 절감할 수 있다. 또한, 아날로그 방식의 경우에도 디지털 방식의 카메라가 제공하는 모든 기능을 제공할 수 있고, 영상의 변환, 결합, 분할 등의 기능과 인공지능에 의한 영상의 분석 및 인식 기술 또한 카메라단에서 수행 후 아날로그 방식 으로 전송이 가능하며, 특히 디지털 360도 영상감시 카메라가 제공하는 다양한 디와프 영상이나 분할 영상을 아 날로그 출력으로도 동일하게 공급할 수 있도록 구현이 가능하다. 또한, 아날로그 영상 수신장치에서 별도 처리 없이도 카메라 단에서 다양한 디지털 카메라의 기능이 수행될 수 있고, 이를 통해 아날로그 영상 수신장치의 영상처리 및 변환에 따른 부하를 최소화 할 수 있으며, 영상품질 자 동 제어를 통해 전송속도의 특성이 변하거나 전송환경이 열악한 경우에도 사용자 측에서 별도의 분석이나 판단 없이 자동으로 적정한 영상을 생성하여 전송할 수 있다. 또한, 전원과 영상신호선을 결합한 PoE, PoC 방식을 적용하여 카메라를 단순하고 간편하게 설치 운용할 수 있으 며, 이를 통해 전원선과 통신선을 별도로 구성하지 않고 1개의 이더넷 선으로 디지털 영상 수신장치와 연결이 가능하고, 1개의 동축선으로 아날로그 영상 수신장치와 연결이 가능하며, 이에 따라 시스템의 연결 구성을 단순 화하고 설치의 편리함을 확보할 수 있다."}
{"patent_id": "10-2023-0051198", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서 및 청구범위에 사용된 용어나 단어는 통상적이거나 사전적인 의미로 한정되어 해석되지 말아야 하며, 발명자는 그 자신의 발명을 가장 최선의 방법으로 설명하기 위해 용어의 개념을 적절하게 정의할 수 있다는 원 칙에 입각하여 본 발명의 기술적 사상에 부합하는 의미와 개념으로 해석되어야 한다. 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다 른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있다는 것을 의미한다. 또한, 명세서에 기 재된 \"…부\", \"…기\", \"모듈\", \"장치\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어나 소프트웨어 또는 하드웨어 및 소프트웨어의 결합으로 구현될 수 있다. 이하 첨부된 도면을 참조하여 본 발명의 실시예를 상세히 설명한다. 도 1은 본 발명의 실시예에 따른 하이브리드 360도 영상 감시 카메라와 외부의 영상 수신장치와의 신호 송수신 관계를 나타낸 도면이다. 도 1을 참조하면, 본 발명에 따른 하이브리드 360도 영상 감시 카메라는 PoE 인터페이스부(후술함) 및 이 더넷 기반의 IP Network를 통해 외부의 디지털 영상수신장치 또는 웹/앱(Web/App) 프로그램과 연결되 고, PoC 인터페이스부(후술함) 및 동축케이블을 통해 아날로그 영상수신장치와 연결된다. 디지털 영상수신장치는 하이브리드 360도 영상 감시 카메라로부터 디지털 신호를 수신하여 영상을 사 용자에게 제공하며, 양방향 통신으로 카메라의 정보를 취득하거나 설정할 수 있다. 아날로그 영상수신장치(12 0)는 하이브리드 360도 영상 감시 카메라로부터 아날로그 신호를 수신하여 영상을 사용자에게 제공하며, 마찬가지로 양방향 통신으로 카메라의 정보를 취득하거나 설정할 수 있다. 디지털 영상수신장치는 IP패킷을 통해 영상과 제어정보를 송수신하고, 아날로그 영상수신장치는 동축 케이블을 통해 아날로그 영상신호를 수신하며, 제어정보는 UTC(up the coax) 방식을 통해 송수신한다. 하이브리드 360도 영상 감시 카메라는 각각 별도의 제어선 없이 하나의 선으로 영상정보와 제어정보를 전 달할 수 있으며, 하이브리드 카메라의 PoE, PoC 인터페이스를 통해 전원을 공급받는다. 이와 같이 영상과 제어 정보, 전원의 공급이 디지털 방식과 아날로그 방식 모두 1개의 케이블을 통해 구성되기 때문에 시스템 구성 및 연결이 단순해진다. 디지털 영상수신장치와 아날로그 영상수신장치는 각각의 장치로 구현되거나 일체형 장치로 구현될 수 있다. 디지털 제어장치와 디지털 영상수신장치는 NVR(Network Video Recorder)의 형태로, 디지털 제어장치 와 아날로그 영상수신장치는 DVR(Digital Video Recorder)의 형태로 구현될 수 있다. 하이브리드 360도 영상 감시 카메라는 디지털 방식이나 아날로그 방식으로 각각 연결이 가능하여, 한 가지 방식 또는 두 가지 방식 모두의 연결도 가능하다. 현장에서는 아날로그 방식으로 전용 동축케이블을 통해 영상 감시를 수행하고, 원격지에서는 디지털 방식에 의해 영상감시의 수행이 가능하여 다양한 형태의 시스템 구성을 유연하게 지원할 수 있다. 도 2는 본 발명의 실시예에 따른 하이브리드 360도 영상 감시 카메라의 시스템 구성을 개략적으로 나타낸 도면 이다. 도 2를 참조하면, 본 발명에 따른 하이브리드 360도 영상 감시 카메라는 카메라 모듈, 메인 보드 , 아날로그 처리 보드, PoE 인터페이스부, PoC 인터페이스부, 전원부를 포함하여 구 성된다. 여기서, 본 발명에서 언급하는 360도 영상 감시 카메라는 전방향 카메라로서, 이외에도 120도 이상의 넓은 화각을 가지는 카메라 또한 본 발명의 범주에 포함될 수 있다.카메라 모듈은 주간과 야간에 걸쳐 주변의 사물에 대한 360도 영상을 취득하여 메인 보드로 전달한다. 이와 같은 카메라 모듈은 어안렌즈, LED, 이미지 센서 등으로 구성되어 주간과 야간 360도 영상 을 취득하여 메인 보드로 취득한 영상을 전달한다. 메인 보드는 전용 클라이언트 프로그램이나 웹/앱 프로그램 연결을 통한 패킷 정보교환을 통해 상기 카메 라 모듈의 설정 및 제어처리를 수행하고, 상기 카메라 모듈로부터 360도 원본(original) 영상을 수신 하여 외부의 디지털 영상 수신장치 및 아날로그 영상 수신장치로 전달할 영상을 처리 및 생성하며, 상기 360도 원본 영상을 분석하여 사람이나 사물, 문자나 이미지를 인식 및 처리하여 상응하는 정보를 표출하고, 시스템의 전체 인터페이스 처리와 시스템의 정보, 사용자 정보 또는 영상 저장을 위한 보안 및 암호 화 정보를 저장 및 관리한다. 여기서, 상기 카메라 모듈과 메인 보드는 MIPI(Mobile Industry Processor Interface)/CSI(Camera Serial interface) 신호를 통해 상호 영상 신호를 송수신하도록 구성될 수 있다. 여기서, 또한 상기 메인 보드는 제어 처리부, 영상 처리부, AI(인공지능) 처리부, 사용자 인터페이스부 및 시스템 관리부를 포함하여 구성될 수 있다. 제어 처리부는 전용 클라이언트 프로그램이나 웹/앱 프로그램 연결을 통한 패킷 정보교환을 통해 상기 카 메라 모듈의 설정 및 제어를 수행하고, 후술하는 아날로그 처리 보드로부터 전달되는 제어 정보의 처 리와, 카메라 모듈 및 사용자 정보의 원격 설정 및 제어를 수행한다. 이와 같은 제어 처리부의 디지 털 제어장치에서 카메라의 정보를 취득하거나 카메라를 설정 및 제어하는 기능은 클라이언트 프로그램, Web, App 프로그램 등을 통하여 구현될 수 있다. 영상 처리부는 상기 카메라 모듈로부터 360도 원본(original) 영상을 수신하여 상기 디지털 영상 수 신장치 및 아날로그 영상 수신장치로 전달할 영상을 처리 및 생성하고, 상기 제어 처리부로 입 력된 이미지 및 영상 스트림과 관련한 설정과 제어 명령을 수신하여 상기 카메라 모듈 및 시스템 관련 기 능을 조정한다. 또한, 제어 처리부를 통해 저장 방식과 저장 시간 등을 조정한다. 여기서, 이와 같은 영상 처리부는 프레임 속도 변화를 포함한 영상신호의 형태변환, H.264, H.265 등 코덱 (CODEC)을 통한 디지털 영상으로의 압축, 디와프(Dewarp)와 같은 영상변환, 영상분할, 영상결합, 영상추출 등과 같은 영상처리를 수행할 수 있다. 또한, 영상 처리부는 360도 영상 중 일정 각도의 영상의 추출이나 여러 각도의 영상을 조합하여 다양한 뷰(view)를 만드는 등 영상의 추출 및 조합의 처리를 수행할 수 있다. 또한, 영 상 처리부는 디지털 영상 수신장치와 아날로그 영상 수신장치로 전달할 영상을 생성함에 있어서, 멀티스트리밍을 통해 원본 영상을 여러 개의 다른 형태(예컨대, 신호형태, 화면크기 및 전송프레임수) 의 영상스트림으로 동시에 생성할 수 있다. 즉, 원본영상, 변환영상, 뷰 영상과 이들에 대해 다양한 압축방식이 나 전송 프레임이 적용된 변형 스트림 등이 생성될 수 있다. 여러 개로 생성되는 스트림은 라이브 재생용, 저장 용, 전송용 등으로 사용자의 선택에 의해 각각 사용될 수 있다. 이때, 디지털 영상 스트림은 디지털 영상 수신장치, 웹, 앱 프로그램에 송신하고, 아날로그용 스트림 은 아날로그 처리 보드로 전달되며, 저장용 스트림은 영상저장 목적으로 사용된다. 또한, 영상 처리부는 영상 저장 기능을 통해 카메라에 내장되어 있는 또는 탈착형 저장 매체(예를 들면, 메모리, SD 카드 등)에 원본 영상 및 처리된 영상을 저장할 수 있다. 또한, 이상과 같은 영상 처리부와 아날로그 처리 보드는 MIPI(Mobile Industry Processor Interface)/CSI(Camera Serial interface) 신호 또는 일반표준 아날로그 방식의 CCIR(Consultative Committee on International Radio) 또는 EIA(Electronic Industries Association) 신호를 이용하여 상호 영상 신호를 송 수신하도록 구성될 수 있다. AI(인공지능) 처리부는 상기 360도 원본 영상을 분석하여 사람이나 사물, 문자나 이미지를 인식 및 처리하 여 상응하는 정보를 표출한다. 즉, AI(인공지능) 처리부는 영상의 분석 및 인식을 처리하여 기존 아날로그 방식처럼 영상을 전송한 후 아날로그 영상 수신장치에서 분석하지 않고, 카메라 단에서 영상분석을 통해 사람 및 사물의 인식, 사물의 형태나 동작의 인식, 문자나 이미지의 인식을 처리하여 현장에서 즉시 정보를 표출할 수 있다. 또한, AI(인공지능) 처리부는 후술하는 센서 모듈, 제어 모듈 등을 통해 인식된 정보 를 가시화할 수 있고, 카메라 단에서 즉시 인식처리하기 때문에 기존방식과 달리 실시간성을 제공하며, 수신장 치의 부하를 최소화할 수 있다.사용자 인터페이스부는 상기 카메라 모듈, 제어 처리부, 영상 처리부 및 AI(인공지능) 처 리부와 모듈(카메라 모듈 및 후술하는 오디오 모듈, 센서 모듈, 제어 모듈)의 동작상 태, 통신상태, 설정값 등을 확인하고 설정하는 기능을 수행한다. 이와 같은 사용자 인터페이스부는 시리얼 통신을 통해 메인 보드의 기능을 감시 및 설정하는 기능을 수행한다. 시스템 관리부는 카메라 시스템의 전체 인터페이스 처리와 카메라 시스템의 정보, 사용자 정보 또는 영상 저장을 위한 보안 및 암호화 정보를 저장 및 관리한다. 이러한 시스템 관리부는 각 처리부와의 통신을 통 해 상태정보를 취득 및 관리한다. 또한, 후술하는 오디오 모듈, 센서 모듈, 제어 모듈의 정보를 송수신 처리한다. 한편, 아날로그 처리 보드는 상기 메인 보드로부터 처리된 영상을 수신하여 아날로그 신호로 변환하 여 송신하고, 아날로그 카메라의 제어 정보를 송/수신 및 처리한다. 여기서, 이와 같은 아날로그 처리 보드 는, 상기 메인 보드의 영상 처리부로부터 디지털 신호 또는 아날로그 신호를 수신하여 아날로그 영상신호로 변환하여 송신하는 아날로그 영상 송신부; 및 상기 아날로그 영상 수신장치의 DVR(Digital Video Recorder)과 카메라(즉, 본 발명의 하이브리드 360도 영상 감시 카메라)를 연결할 때, 별도 의 제어선 없이 동축 케이블만으로 카메라를 제어할 수 있는 UTC(up the coax) 통신 방법을 사용하여 카메라의 제어 정보를 송수신하여 처리하는 데이터 처리부로 구성될 수 있다. 이를 통해 기존 디지털 방식과 동일하 게 양방향 카메라의 제어를 수행할 수 있다. 또한, 아날로그 카메라의 영상 및 이미지 설정, 전송방식 제어 등 을 수행할 수 있다. PoE 인터페이스부는 단일 이더넷(ethernet) 선을 기반으로 상기 메인 보드로부터의 디지털 신호를 상 기 디지털 영상 수신장치로 전송하거나, 디지털 영상 수신장치로부터의 디지털 신호를 상기 메인 보 드로 전송하며, PoE(Power over Ethernet)에 의한 전원부(후술함)로의 전원 공급을 처리한다. PoC 인터페이스부는 단일 동축케이블을 기반으로 상기 아날로그 처리 보드로부터의 아날로그 영상신 호를 상기 아날로그 영상 수신장치로 전송하거나, 아날로그 영상 수신장치로부터의 아날로그 신호 또 는 디지털 신호를 상기 아날로그 처리 보드로 전송하며, PoC(Power over Coaxial)에 의한 전원부로의 전원 공급을 처리한다. 이상과 같은 두 가지 인터페이스는 각각 통신과 전원공급을 단일 선을 통해 처리하여 카메라의 연결 및 구성을 단순화하고, 설치를 편리하게 하는 구조로 구성된다. 전원부는 상기 PoE 인터페이스부 또는 PoC 인터페이스부로부터 전원을 공급받은 후 상기 카메라 모듈, 메인 보드 및 아날로그 처리 보드의 구동용 전원으로 변환하여 카메라 모듈, 메인 보드 및 아날로그 처리 보드로 각각 구동 전원을 공급한다. 이와 같은 전원부는 연결된 장치로 부터 PoE나 PoC에 의한 전원공급이 없을 경우에는 별도의 전원공급장치를 통해 전원을 공급받을 수 있도록 구성 된다. 이상과 같은 구성을 가지는 본 발명에 따른 하이브리드 360도 영상 감시 카메라는 바람직하게는 상기 메인 보드에서의 영상 처리 및 분석과 관련하여 오디오 신호의 입/출력을 처리하는 오디오 모듈을 더 포함 할 수 있다. 오디오 모듈은 오디오 신호의 입력 처리와 스피커를 통한 오디오 출력을 처리한다. 또한, 각종 IoT(Internet of Things) 센서 정보의 연계를 통해 주변 사물의 정보를 수집하고 출력을 처리하는 센서 모듈을 더 포함할 수 있다. 또한, 스위치 및 릴레이의 제어를 통해 주변 IoT 기기의 동작을 제어하는 제어 모듈을 더 포함할 수 있다. 이상의 설명과 같은 본 발명에 따른 하이브리드 360도 영상 감시 카메라는 360도 카메라가 아날로그 출력을 지 원하는 카메라로서, 그 기능은 360도 디지털 카메라에서만 지원이 가능하던 기능(예를 들면, 영상의 변형, 일부 화면 전송, AI 적용 등)을 모두 수용하고 있다는 점이 가장 큰 특징이라고 할 수 있으며, 경우에 따라서는 디지 털 출력 부분은 생략될 수도 있다. 즉, 디지털 출력과 아날로그 출력을 모두 지원하는 하이브리드 형태일 수도 있고, 아날로그 출력만 지원하는 형태일 수도 있다. 그러면, 이하에서는 이상과 같은 구성을 가지는 본 발명에 따른 하이브리드 360도 영상 감시 카메라를 기반으로 한 영상 처리 방법에 대해 설명해 보기로 한다. 도 3은 본 발명의 실시예에 따른 하이브리드 360도 영상 감시 카메라를 이용한 영상 처리 방법의 실행 과정을 나타낸 흐름도이다. 도 3을 참조하면, 본 발명에 따른 하이브리드 360도 영상 감시 카메라를 이용한 영상 처리 방법은, 먼저 메인 보드의 영상 처리부가 카메라 모듈로부터 영상 정보를 취득한다(단계 S301). 그런 후, 영상 처리부는 취득한 360도 원본 영상 및 영상 변환된 영상으로부터 영상 스트림을 생성한다(단 계 S302∼S304). 즉, 영상 처리부는 영상정보를 취득한 후 원래의 영상 뿐 아니라 디워프와 같은 영상 변 환, 변환 후 영상의 추출, 추출한 영상을 여러 개로 조합하여 뷰를 생성하며, 이후 각각의 목적에 따른 영상 스 트림을 생성한다. 이때, 영상스트림(i=1, ... , n)은 디지털장치 전송용, 아날로그 장치 전송용, 저장용 등으로 구분되며, 각각의 목적에 맞도록 또는 사용자 측의 초기 설정값에 의해 영상을 생성한다. 이렇게 하여 영상 처리부에 의해 영상 스트림이 생성되면, AI(인공지능) 처리부는 생성된 상기 영상 스트림의 정보를 분석하여 AI 정보를 생성한다(단계 S305, S306). 그런 후, AI(인공지능) 처리부는 상기 생성된 AI 정보를 상기 영상 스트림에 결합하여 AI 정보가 결합된 영상 스트림을 생성한다(단계 S307). 이때, AI 정보가 결합된 영상 스트림을 생성하거나, 별도의 영상 정보를 생성할 수도 있다. 이후, 영상 처리부는 상기 생성된 AI 정보가 결합된 영상 스트림(i)을 디지털 영상 수신장치 또는 아 날로그 영상 수신장치 측으로 전송한다(단계 S308). 그리고 제어 처리부는 상기 영상 스트림의 동작 설정 상태 여부를 판별한다(단계 S312). 상기 단계 S312의 판별에서 상기 영상 스트림이 동작 설정 상태에 있으면, 제어 처리부는 상기 단계 S304 로 프로세스를 회귀시키고, 상기 영상 스트림이 동작 설정 상태에 있지 않으면, 프로세스를 종료한다. 여기서, 이와 관련하여 부연 설명을 해보기로 한다. 영상 스트림(라이브 감시, 전송 또는 저장을 위해 만들어지는 동영상)은 기본 영상 스트림(i=1)과 함께 여러 개 의 영상 스트림으로 구성되며, 동시에 생성된다. 영상 스트림 1, 2, … n이 각각 동시에 다른 형태(원본 영상, 디와프 등 변형된 영상, 뷰로 조합된 영상 등 영상의 형태가 다르거나, 영상의 압축방식/전송 프레임수/사이즈 등 영상정보 생성기법이 다르거나)로 생성될 수 있다. 예를 들어, 스트림 1은 원본 영상을 H.264로, 스트림 2는 디와프 영상을 H.265로, 스트림 3은 뷰 영상을 H.264로 각각 생성할 수 있다. 이러한 스트림의 특성은 사용자 측(영상 수신장치 측)의 설정에 의해 결정된다. 사용자는 목적에 따라 스트림을 선택할 수 있다. 예를 들면, 도 1에서 사용자는 Web/App은 스트림 1을 수 신하고, 디지털 영상 수신장치는 스트림 1과 스트림 2를 수신하고, 아날로그 영상 수신장치는 스트림 3을 수신하는 것으로 선택할 수 있다. 기본 영상(i=1) 외의 영상 스트림(i=2,…, n)은 사용자가 스트림의 동작을 선택하면(즉, 영상 스트림이 동작 설 정 상태에 있으면) 생성되고, 선택하지 않으면(즉, 영상 스트림이 동작 설정 상태에 있지 않으면) 생성되지 않 는다. 예를 들어, 디지털 영상 수신장치를 사용하지 않으면 스트림 2는 생성을 중단하게 된다. 즉, 영상 스트림 1∼n까지 사용자(영상 수신장치)가 사용을 종료할 때까지(다시 말해, 영상 수신장치가 가동을 중지할 때 까지) 지속적으로 생성된다. 또는 사용자의 설정에 의해 해당 기능(디지털 또는 아날로그 영상 수신)을 사용하 지 않을 경우, 영상 처리부는 해당 스트림의 생성을 중단하게 된다. 여기서, 바람직하게는 상기 단계 S308에서 영상 처리부가 상기 생성된 AI 정보가 결합된 영상 스트림(i)을 디지털 영상 수신장치 또는 아날로그 영상 수신장치 측으로 전송하되, 영상 처리부가 일정 주기 (Ti)로 영상 스트림 전송량과 수신 측의 영상 스트림 수신량을 각각 측정하는 단계(S309); 영상 처리부가 상기 영상 스트림 전송량과 영상 스트림 수신량 간의 차이가 미리 설정한 설정값(A)보다 큰지를 판별하는 단계 (S310); 및 상기 단계 S310의 판별에서 상기 영상 스트림 전송량과 영상 스트림 수신량 간의 차이가 설정값(A) 보다 크면, 영상 처리부가 영상 전송 형태를 변경 제어하는 단계(S311)를 더 포함할 수 있다. 이때, 상기 단계 S309에서 영상 처리부가 일정 주기(Ti)로 영상 스트림 전송량과 수신 측의 영상 스트림 수신량을 각각 측정함에 있어서, 영상 스트림 송신 측(영상 처리부)에서는 영상 스트림 수신 측으로부터 일정 주기(Ti) 동안 수신된 영상 정보량을 받아 주기 Ti 동안 영상정보의 전송량을 측정할 수 있다. 또한, 상기 단계 S311에서 영상 처리부가 영상 전송 형태를 변경 제어함에 있어서, 영상의 이미지 크기를 조절하거나 영상 전송속도를 조절하는 방식으로 영상 전송 형태를 변경 제어할 수 있다.여기서, 이상과 관련하여 조금 더 설명을 부가해 보기로 한다. 영상의 생성량(전송량)과 수신측의 수신량이 차이가 발생하면, 가변압축방식(VBR)의 경우에는 전송량의 조절을 통해 자동으로 조정할 수 있으나, 고정압축방식(CBR)이나 아날로그 전송의 경우에는 영상이 깨지거나 끊기는 현 상이 발생한다. 이러한 현상을 최소화하기 위해, 본 발명의 영상 처리 방법에서는 영상 전송량과 수신량의 차이 를 확인하여 자동으로 영상의 품질을 제어한다. 이는 영상 처리부와 수신장치 측 간의 데이터 송수신 정보 량을 교환하여 이루어지며 송신 측에서는 수신 측으로부터 주기 Ti 동안 수신된 영상 정보량을 받아 주기 Ti 동 안 영상 정보의 전송량을 측정하게 된다. 이를 통해 영상스트림 중 전송에 사용된 영상스트림 i의 생성된 영상 정보량과 영상 수신량의 차이를 계산할 수 있으며, 이 차이값이 일정 수준(A)을 넘게 되면 다음 영상 생성 시 전송 영상의 형태를 변경하는 정보로 사용된다. 영상 스트림 i는 크게 영상의 이미지 크기를 조절하거나 영상 전송속도를 조절하는 두 가지 방법으로 영상 전송형태를 제어할 수 있다. 카메라 영상의 특성은 사용자에 의해 초기에 선택되어 영상의 화질을 중시할 경우에는 영상의 크기를 조절하고, 영상의 움직임 특성을 중시할 경우에 는 영상의 전송속도 (fps)를 조절하는 방법으로 제어한다. 영상 전송량과 수신량이 일정 수준을 넘었을 경우, 영상 스트림의 특성이 품질 중심이면 영상해상도(이미지의 크기)는 유지한 채 영상 전송속도를 조절하고, 스트 림의 특성이 움직임 중심이면 영상 전송속도는 유지하고 영상 해상도를 조절한다. 각 영상 스트림(i)은 영상의 전송매체와 사용목적이 다르기 때문에 각각의 송수신량 측정을 통해 위와 같은 제어를 수행한다."}
{"patent_id": "10-2023-0051198", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이상의 설명과 같이, 본 발명에 따른 하이브리드 360도 영상 감시 카메라 및 그를 이용한 영상 처리 방법은 디 지털 및 아날로그 출력을 겸비한 하이브리드 360도 영상 감시 카메라를 도입함으로써, 디지털 방식의 영상 수신 장치 또는 아날로그 방식의 영상 수신장치에 상관없이 연결이 가능하며, 디지털 방식과 아날로그 방식 모두에 동시에 연결이 가능하여 근거리에서는 아날로그 방식으로 원거리에서는 디지털 방식으로 각기 다른 위치에서 감 시가 가능하다. 또한, 기설치된 수신장치의 종류에 상관없이 360도 카메라의 연결이 가능하며, 기존에 설치된 영상 수신장치를 다른 방식의 영상 수신장치로 교체하더라도(예를 들면, 아날로그 방식을 디지털 방식 또는 디지털 방식을 아날 로그 방식으로 교체하더라도) 카메라의 교체없이 바로 360도 영상의 전송이 가능하여 현장 설치가 편리하며, 이 에 따라 운영 비용을 절감할 수 있다. 또한, 아날로그 방식의 경우에도 디지털 방식의 카메라가 제공하는 모든 기능을 제공할 수 있고, 영상의 변환, 결합, 분할 등의 기능과 인공지능에 의한 영상의 분석 및 인식 기술 또한 카메라단에서 수행 후 아날로그 방식 으로 전송이 가능하며, 특히 디지털 360도 영상감시 카메라가 제공하는 다양한 디와프 영상이나 분할 영상을 아 날로그 출력으로도 동일하게 공급할 수 있도록 구현이 가능하다. 또한, 아날로그 영상 수신장치에서 별도 처리 없이도 카메라 단에서 다양한 디지털 카메라의 기능이 수행될 수 있고, 이를 통해 아날로그 영상 수신장치의 영상처리 및 변환에 따른 부하를 최소화 할 수 있으며, 영상품질 자 동 제어를 통해 전송속도의 특성이 변하거나 전송환경이 열악한 경우에도 사용자 측에서 별도의 분석이나 판단 없이 자동으로 적정한 영상을 생성하여 전송할 수 있다. 또한, 전원과 영상신호선을 결합한 PoE, PoC 방식을 적용하여 카메라를 단순하고 간편하게 설치 운용할 수 있고, 이를 통해 전원선과 통신선을 별도로 구성하지 않고 1개의 이더넷 선으로 디지털 영상 수신장치와 연결이 가능하고, 1개의 동축선으로 아날로그 영상 수신장치와 연결이 가능하며, 이에 따라 시스템의 연결 구성을 단순 화하고 설치의 편리함을 확보할 수 있다. 이상, 바람직한 실시예를 통하여 본 발명에 관하여 상세히 설명하였으나, 본 발명은 이에 한정되는 것은"}
{"patent_id": "10-2023-0051198", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "아니며, 본 발명의 기술적 사상을 벗어나지 않는 범위 내에서 다양하게 변경, 응용될 수 있음은 당해 기술분야 의 통상의 기술자에게 자명하다. 따라서, 본 발명의 진정한 보호 범위는 다음의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술적 사상은 본 발명의 권리 범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2023-0051198", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 하이브리드 360도 영상 감시 카메라와 외부의 영상 수신장치와의 신호 송수신 관계를 나 타낸 도면이다. 도 2는 본 발명에 따른 하이브리드 360도 영상 감시 카메라의 시스템 구성을 개략적으로 나타낸 도면이다. 도 3은 본 발명에 따른 하이브리드 360도 영상 감시 카메라를 이용한 영상 처리 방법의 실행 과정을 나타낸 흐 름도이다."}
