{"patent_id": "10-2019-0169268", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0077533", "출원번호": "10-2019-0169268", "발명의 명칭": "사용자 얼굴 피부 분석 방법 및 서버", "출원인": "고려대학교 산학협력단", "발명자": "이성환"}}
{"patent_id": "10-2019-0169268", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "서버에 의해 수행되는 사용자 얼굴 피부 분석 방법에 있어서,(a) 사용자 단말로부터 수신된 제 1 얼굴 영상과 제 2얼굴 영상을 기초로 삼차원 좌표 데이터를 포함하는 제 1삼차원 얼굴 모형과 제 2 삼차원 얼굴 모형을 각각 생성하는 단계; (b) 상기 제 1 삼차원 얼굴 모형에서 사용자가 지정한 제 1 관심영역의 삼차원 좌표 데이터를 기초로 제 2 삼차원 얼굴 모형에서 상기 제 1 관심영역과 매칭되는 제 2 관심 영역을 특정하는 단계;(c) 상기 제 1 삼차원 얼굴 모형의 제 1 관심 영역과 상기 제 2 삼차원 얼굴 모형의 제 2 관심 영역의 삼차원좌표 데이터 및 개별 특징 데이터에 기초하여 상기 제 1 관심 영역과 제 2 관심 영역을 매칭시키는 단계; 및(d) 상기 매칭된 제 1 관심 영역과 제 2 관심 영역에서 변화 데이터를 추출하여 비교 분석 데이터를 생성하고,상기 개별 특징 데이터 및 상기 비교 분석 데이터를 포함하는 피부 변화 분석 결과 데이터를 생성하여 상기 사용자 단말에 제공하는 단계;를 포함하는 것인,사용자 얼굴 피부 분석 방법."}
{"patent_id": "10-2019-0169268", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 (a)단계는 수신된 복수의 얼굴 영상을 입력으로 인공신경망을 이용한 얼굴 피부 분석 모델을 이용하여 삼차원 얼굴 모형을 생성하는 단계를 포함하는 것인,사용자 얼굴 피부 분석 방법."}
{"patent_id": "10-2019-0169268", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 삼차원 좌표 데이터는 상기 얼굴 피부 분석 모델을 통해 생성한 상기 삼차원 얼굴 모형의 정점의 삼차원좌표 및 깊이 정보를 포함하는 것인,사용자 얼굴 피부 분석 방법."}
{"patent_id": "10-2019-0169268", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 (b) 단계는 미리 입력된 삼차원 얼굴 모형을 기초로 컨볼루션 신경망에 기반한 딥러닝 모델인 얼굴 피부분석 모델을 통해 여드름, 다크서클, 홍조 영역 또는 모공 영역 중 하나 이상의 특징을 학습하여 피부 특징 영역을 추출하고, 상기 피부 특징 영역을 제1관심영역으로 지정하는 단계를 포함하는 것인,사용자 얼굴 피부 분석 방법."}
{"patent_id": "10-2019-0169268", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 3 항에 있어서, 상기 (c)단계는 매칭된 상기 제 1 관심 영역과 상기 제 2 관심 영역간 정합을 위한 정점을 선택하고, 상기 선택된 정점을 기준으로 매칭된 상기 제 2 관심 영역을 정렬하여 정합된 제 2 관심 영역으로 변환하는 단계를 더포함하는 것인,사용자 얼굴 피부 분석 방법.공개특허 10-2021-0077533-3-청구항 6 제 1 항에 있어서, 상기 개별 특징 데이터는 상기 제 1 관심 영역과 상기 제 2 관심 영역의 픽셀 값의 분포를 나타내는 2차원 그래프인 히스토그램 분석 데이터를 포함하는 것인,사용자 얼굴 피부 분석 방법."}
{"patent_id": "10-2019-0169268", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서, 상기 (d)단계는 상기 제 1 관심 영역과 상기 제 2 관심 영역을 기설정된 정상 피부의 히스토그램과 차이를 기초로 비교 분석하는 단계를 더 포함하는 것인,사용자 얼굴 피부 분석 방법."}
{"patent_id": "10-2019-0169268", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "사용자 얼굴 피부 분석 서버에 있어서,사용자 얼굴 피부 분석 프로그램이 저장된 메모리;상기 메모리에 저장된 프로그램을 실행하는 프로세서를 포함하며, 상기 프로세서는 상기 프로그램의 실행에 의해, 사용자 단말로부터 수신된 제 1 얼굴 영상과 제 2얼굴 영상을기초로 삼차원 좌표 데이터를 포함하는 제 1 삼차원 얼굴 모형과 제 2 삼차원 얼굴 모형을 각각 생성하고,상기 제 1 삼차원 얼굴 모형에서 사용자가 지정한 제 1 관심영역의 삼차원 좌표 데이터를 기초로 제 2 삼차원얼굴 모형에서 상기 제 1 관심영역과 매칭되는 제 2 관심 영역을 특정하고,상기 제 1 삼차원 얼굴 모형의 제 1 관심 영역과 상기 제 2 삼차원 얼굴 모형의 제 2 관심 영역의 삼차원 좌표데이터 및 개별 특징 데이터에 기초하여 상기 제 1 관심 영역과 제 2 관심 영역을 매칭시키고,상기 매칭된 제 1 관심 영역과 제 2 관심 영역에서 변화 데이터를 추출하여 비교 분석 데이터를 생성하고, 상기개별 특징 데이터 및 상기 비교 분석 데이터를 포함하는 피부 변화 분석 결과 데이터를 생성하여 상기 사용자단말에 제공하는 것인,사용자 얼굴 피부 분석 서버."}
{"patent_id": "10-2019-0169268", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서,상기 프로세서는 상기 제 1 삼차원 얼굴 모형과 제 2 삼차원 얼굴 모형을 생성하는 경우,상기 수신된 복수의 얼굴 영상을 입력으로 인공신경망을 이용한 얼굴 피부 분석 모델을 이용하여 삼차원 얼굴모형을 생성하는 것인,사용자 얼굴 피부 분석 서버."}
{"patent_id": "10-2019-0169268", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9 항에 있어서,상기 삼차원 좌표 데이터는 상기 얼굴 피부 분석 모델을 통해 생성한 상기 삼차원 얼굴 모형의 정점의 삼차원좌표 및 깊이 정보를 포함하는 것인,사용자 얼굴 피부 분석 서버."}
{"patent_id": "10-2019-0169268", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 8 항에 있어서,공개특허 10-2021-0077533-4-상기 프로세서는 상기 제 1 삼차원 얼굴 모형에서 제 1 관심영역을 지정하기 위해 미리 입력된 삼차원 얼굴 모형을 기초로 컨볼루션 신경망에 기반한 딥러닝 모델인 얼굴 피부 분석 모델을 통해 여드름, 다크서클, 홍조 영역 또는 모공 영역 중 하나 이상의 특징을 학습하여 피부 특징 영역을 추출하고, 상기 피부 특징 영역을 제1관심영역으로 지정하는 것인,사용자 얼굴 피부 분석 서버."}
{"patent_id": "10-2019-0169268", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 10 항에 있어서, 상기 프로세서는 상기 제 1 관심 영역과 제 2 관심 영역을 매칭시킨 후, 매칭된 상기 제 1 관심 영역과 상기제 2 관심 영역간 정합을 위한 정점을 선택하고, 상기 선택된 정점을 기준으로 매칭된 상기 제 2 관심 영역을정렬하여 정합된 제 2 관심 영역으로 변환하는 것인, 사용자 얼굴 피부 분석 서버."}
{"patent_id": "10-2019-0169268", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 1 항에 따르는 사용자 얼굴 피부 분석 방법을 수행하기 위한 컴퓨터 프로그램이 기록된 비일시적 컴퓨터 판독가능 기록매체."}
{"patent_id": "10-2019-0169268", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본원의 일 측면에 따른 사용자 얼굴 피부 분석 방법은 사용자 단말로부터 수신된 제 1 얼굴 영상과 제 2얼굴 영 상을 기초로 삼차원 좌표 데이터를 포함하는 제 1 삼차원 얼굴 모형과 제 2 삼차원 얼굴 모형을 각각 생성하는 단계; 제 1 삼차원 얼굴 모형에서 사용자가 지정한 제 1 관심영역의 삼차원 좌표 데이터를 기초로 제 2 삼차원 얼굴 모형에서 제 1 관심영역과 매칭되는 제 2 관심 영역을 특정하는 단계; 제 1 삼차원 얼굴 모형의 제 1 관심 영역과 제 2 삼차원 얼굴 모형의 제 2 관심 영역의 삼차원 좌표 데이터 및 개별 특징 데이터에 기초하여 제 1 관 심 영역과 제 2 관심 영역을 매칭시키는 단계; 매칭된 제 1 관심 영역과 제 2 관심 영역에서 변화 데이터를 추출 하여 비교 분석 데이터를 생성하고, 개별 특징 데이터 및 비교 분석 데이터를 포함하는 피부 변화 분석 결과 데 이터를 생성하여 사용자 단말에 제공하는 단계;를 포함한다."}
{"patent_id": "10-2019-0169268", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 사용자 얼굴 피부 분석 방법에 관한 것으로, 보다 상세하게는 카메라를 통해 얻은 동일 인물의 전후 얼굴 사진을 취득하여 얼굴에 대한 3차원 모형을 추정한 후 두 사진 간의 영역 매칭을 진행한 후 선택된 영역에 대해 피부 분석 및 비교를 진행하는 방법에 관한 것이다."}
{"patent_id": "10-2019-0169268", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 헬스케어나 미에 대한 관심이 증가하면서 피부 상태를 진단하고 관리해주는 여러 시스템들이 등장하고 있 다. 기존에는 병원에서 주기적으로 환자를 모니터링하고 직접 관리 및 솔루션을 제공하는 방식을 사용하였지만, 최근에는 특수한 장비를 이용하여 촬영된 사용자의 영상만으로도 다양한 피부 트러블을 진단하고 일정 수준의 솔루션 제공이 가능한 시스템들이 개발되어 사용되고 있다. 종래의 촬영 영상을 이용한 피부 분석 및 솔루션 제공의 경우 전과 후의 상황을 비교할 때 특정 영역에 대한 변 화를 보여주기보다는 전체 얼굴 또는 사전에 지정된 큰 영역 안에서 얼마나 개선 또는 악화가 되었는지 말해주 는데 이는 정확히 어떤 영역에서 피부가 손상되었거나 개선되었는지 보여주지 못한다. 이로써 사용자는 관심 영 역에 대한 변화 정보를 얻기보다는 전체적인 변화만 볼 수가 있다. 즉 이는 사용자의 관심 영역에 대한 정보가 포함되지 않을뿐더러, 변화된 부분을 따로 보여주지 않기 때문에 신뢰성이 낮아질 수 있다. 이러한 문제를 해결하기 위해서는 피부 변화 전과 후의 상태에 대해 더욱 자세히 알려주어야 할 필요성이 있다. 예로 들자면, 단순히 피부가 3점에서 4점으로 개선되었다는 것보다는 오른쪽 볼 및 입 주변 영역에서 여드름이 60% 없어졌다고 말하는 것이 소비자로선 훨씬 도움이 될 것이다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허공보 제 10-2019-0084771 호 (발명의 명칭: 피부 상태 측정용 모듈)"}
{"patent_id": "10-2019-0169268", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술한 문제점을 해결하기 위한 것으로, 한 쌍의 전후 얼굴 영상을 통해 정확한 영역 매칭을 진행함 으로써, 특정 얼굴 영역에 대한 정확한 피부 상태 분석과 특정 영역에서의 전후 사진에 대한 비교분석을 진행할 수 있는 시스템을 제공하는 것을 기술적 과제로 한다. 다만, 본 실시예가 이루고자 하는 기술적 과제는 상기된 바와 같은 기술적 과제로 한정되지 않으며, 또 다른 기 술적 과제들이 존재할 수 있다."}
{"patent_id": "10-2019-0169268", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 해결하기 위한 기술적 수단으로서, 본 개시의 제 1측면에 따른 사용자 얼굴 피부 분석 방 법은 사용자 단말로부터 수신된 제 1 얼굴 영상과 제 2얼굴 영상을 기초로 삼차원 좌표 데이터를 포함하는 제 1 삼차원 얼굴 모형과 제 2 삼차원 얼굴 모형을 각각 생성하는 단계; 제 1 삼차원 얼굴 모형에서 사용자가 지정한 제 1 관심영역의 삼차원 좌표 데이터를 기초로 제 2 삼차원 얼굴 모형에서 제 1 관심영역과 매칭되는 제 2 관심 영역을 특정하는 단계; 제 1 삼차원 얼굴 모형의 제 1 관심 영역과 제 2 삼차원 얼굴 모형의 제 2 관심 영역의 삼차원 좌표 데이터 및 개별 특징 데이터에 기초하여 제 1 관심 영역과 제 2 관심 영역을 매칭시키는 단계; 매 칭된 제 1 관심 영역과 제 2 관심 영역에서 변화 데이터를 추출하여 비교 분석 데이터를 생성하고, 개별 특징 데이터 및 비교 분석 데이터를 포함하는 피부 변화 분석 결과 데이터를 생성하여 사용자 단말에 제공하는 단 계;를 포함한다. 또한, 본 개시의 제 2 측면에 따른 사용자 얼굴 피부 분석 서버는 사용자 얼굴 피부 분석 프로그램이 저장된 메 모리; 상기 메모리에 저장된 프로그램을 실행하는 프로세서를 포함한다. 상기 프로세서는 상기 프로그램의 실행 에 의해, 사용자 단말로부터 수신된 제 1 얼굴 영상과 제 2얼굴 영상을 기초로 삼차원 좌표 데이터를 포함하는 제 1 삼차원 얼굴 모형과 제 2 삼차원 얼굴 모형을 각각 생성하고, 상기 제 1 삼차원 얼굴 모형에서 사용자가 지정한 제 1 관심영역의 삼차원 좌표 데이터를 기초로 제 2 삼차원 얼굴 모형에서 상기 제 1 관심영역과 매칭되 는 제 2 관심 영역을 특정하고, 상기 제 1 삼차원 얼굴 모형의 제 1 관심 영역과 상기 제 2 삼차원 얼굴 모형의 제 2 관심 영역의 삼차원 좌표 데이터 및 개별 특징 데이터에 기초하여 상기 제 1 관심 영역과 제 2 관심 영역 을 매칭시키고, 상기 매칭된 제 1 관심 영역과 제 2 관심 영역에서 변화 데이터를 추출하여 비교 분석 데이터를 생성하고, 상기 개별 특징 데이터 및 상기 비교 분석 데이터를 포함하는 피부 변화 분석 결과 데이터를 생성하 여 상기 사용자 단말에 제공한다."}
{"patent_id": "10-2019-0169268", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본원의 과제 해결 수단 중 어느 하나에 의하면, 한 쌍의 얼굴 영상으로 어떠한 장소에서든 용이하고 빠 르게 피부 상태를 비교분석 할 수 있다. 또한, 본 발명에 의한 관심 영역에 대한 피부 비교분석 방법은 사용자가 원하는 또는 사전에 설정된 특정한 영 역에 대한 비교분석을 진행함으로써 더욱 효과적이고 유의미한 비교분석을 진행할 수 있다."}
{"patent_id": "10-2019-0169268", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본원이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본원의 실시예를 상세히 설명한다. 그러나 본원은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본원을 명확하게 설명하기 위해서 설명과 관계없는 부분 은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 본원 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\"되어 있는 경우도 포함한다. 본원 명세서 전체에서, 어떤 부재가 다른 부재 “상에” 위치하고 있다고 할 때, 이는 어떤 부재가 다른 부재에 접해 있는 경우뿐 아니라 두 부재 사이에 또 다른 부재가 존재하는 경우도 포함한다. 이하 첨부된 도면을 참고하여 본 발명의 일 실시예를 상세히 설명하기로 한다. 도 1은 본 발명의 일 실시예에 따른 사용자 얼굴 피부 분석 서버의 구성을 도시한 블록도이다. 도시된 바와 같이 사용자 얼굴 피부 분석 서버는 통신 모듈, 메모리, 프로세서, 데이터베 이스 및 입력모듈을 포함할 수 있다. 통신모듈은 접속된 사용자 단말과 데이터를 송수신할 수 있다. 통신모듈은 다른 네트워크 장치 와 유무선 연결을 통해 제어 신호 또는 데이터 신호와 같은 신호를 송수신하기 위해 필요한 하드웨어 및 소프트 웨어를 포함하는 장치일 수 있다. 메모리에는 사용자 얼굴 피부 분석 프로그램이 저장된다. 사용자 얼굴 피부 분석 프로그램은 사용자 단말 로부터 수신된 제 1 얼굴 영상과 제 2얼굴 영상을 기초로 삼차원 좌표 데이터를 포함하는 제 1 삼차원 얼굴 모 형과 제 2 삼차원 얼굴 모형을 각각 생성하고, 상기 제 1 삼차원 얼굴 모형에서 사용자가 지정한 제 1 관심영역 의 삼차원 좌표 데이터를 기초로 제 2 삼차원 얼굴 모형에서 상기 제 1 관심영역과 매칭되는 제 2 관심 영역을 특정하고, 상기 제 1 삼차원 얼굴 모형의 제 1 관심 영역과 상기 제 2 삼차원 얼굴 모형의 제 2 관심 영역의 삼 차원 좌표 데이터 및 개별 특징 데이터에 기초하여 상기 제 1 관심 영역과 제 2 관심 영역을 매칭시키고, 상기 매칭된 제 1 관심 영역과 제 2 관심 영역에서 변화 데이터를 추출하여 비교 분석 데이터를 생성하고, 상기 개별 특징 데이터 및 상기 비교 분석 데이터를 포함하는 피부 변화 분석 결과 데이터를 생성하여 상기 사용자 단말에 제공한다. 이러한 메모리에는 사용자 얼굴 피부 분석 서버의 구동을 위한 운영 체제나 사용자 얼굴 피부 분석 프로그램의 실행 과정에서 발생되는 여러 종류가 데이터가 저장된다. 이때, 메모리는 전원이 공급되지 않아도 저장된 정보를 계속 유지하는 비휘발성 저장장치 및 저장된 정보 를 유지하기 위하여 전력이 필요한 휘발성 저장장치를 통칭하는 것이다. 또한, 메모리는 프로세서가 처리하는 데이터를 일시적 또는 영구적으로 저장하는 기능을 수행할 수 있다. 여기서, 메모리는 저장된 정보를 유지하기 위하여 전력이 필요한 휘발성 저장장치 외에 자기 저장 매체(magnetic storage media) 또는 플래시 저장 매체(flash storage media)를 포함할 수 있으나, 본 발명의 범위가 이에 한정되는 것은 아니다. 프로세서는 메모리에 저장된 프로그램을 실행하되, 사용자 얼굴 피부 분석 프로그램의 실행에 따르는 전체 과정을 제어한다. 프로세서가 수행하는 각각의 동작에 대해서는 추후 보다 상세히 살펴보기로 한다. 이러한 프로세서는 데이터를 처리할 수 있는 모든 종류의 장치를 포함할 수 있다. 예를 들어 프로그램 내 에 포함된 코드 또는 명령으로 표현된 기능을 수행하기 위해 물리적으로 구조화된 회로를 갖는, 하드웨어에 내 장된 데이터 처리 장치를 의미할 수 있다. 이와 같이 하드웨어에 내장된 데이터 처리 장치의 일 예로써, 마이 크로프로세서(microprocessor), 중앙처리장치(central processing unit: CPU), 프로세서 코어(processor core), 멀티프로세서(multiprocessor), ASIC(application-specific integrated circuit), FPGA(field programmable gate array) 등의 처리 장치를 망라할 수 있으나, 본 발명의 범위가 이에 한정되는 것은 아니다. 데이터베이스는 프로세서의 제어에 따라, 사용자 얼굴 피부 분석 시스템에 필요한 데이터를 저장 또 는 제공한다. 이러한 데이터베이스는 메모리와는 별도의 구성 요소로서 포함되거나, 또는 메모리 의 일부 영역에 구축될 수도 있다. 도 2는 본 발명의 일 실시예에 따른 사용자 얼굴 피부 분석 시스템의 구성을 도시한 블록도이다. 사용자 얼굴 피부 분석 방법은 서버 또는 사용자 단말에서 실시될 수 있다. 사용자 얼굴 피부 분석 방법에서 얼굴영상과 같은 데이터 수집은 사용자 단말에서 이루어질 수 있다. 수집된 데이터 분석은 서버 에서 이루어지고, 피부 분석 결과 데이터가 사용자 단말에 제공 될 수 있다. 복수의 사용자는 각각 자신의 사용자 단말을 통해 사용자 얼굴 피부 분석 방법을 실시할 수 있다. 도 3은 본 발명의 일 실시예에 따른 사용자 얼굴 피부 분석 방법의 진행 단계를 나타낸 흐름도이다. 프로세서는 사용자 단말로부터 수신된 제 1 얼굴 영상과 제 2얼굴 영상을 기초로 삼차원 좌표 데이터를 포 함하는 제 1 삼차원 얼굴 모형과 제 2 삼차원 얼굴 모형을 각각 생성한다(S110). 예를 들어, 피부 변화를 분석하기 위해 사용자 단말로부터 수신된 피부 변화 전 제1얼굴영상은 도4 (a), 피부 변화 후 제2얼굴영상은 도4 (b)에 표시된 영상과 같을 수 있다. 이 때, 사용자 단말은 비교 대상인 도4 (a)의 제 1 얼굴영상을 촬영하고, 이후 스킨케어 등을 통해 변화된 도4 (b)의 제 2 얼굴영상을 촬영하여 해당 영상을 서버로 송신할 수 있다. 프로세서는 수신된 얼굴영상을 기초로 삼차원 얼굴모형을 생성하기 위해 인공신경망을 이용한 딥러닝 기술 기반의 얼굴 피부 분석 모델을 이용할 수 있다. 프로세서는 얼굴 피부 분석 모델을 통해 이차원 영상인 제 1 얼굴영상 및 제 2 얼굴영상을 입력으로, 각각 삼차원 얼굴모형을 생성하면서 삼차원 좌표 데이터를 획득하고, 삼차원 얼굴 모형의 정점을 추출하고, 삼차원 얼굴 모형의 깊이 정보를 추정할 수 있다. 도5는 삼차원 얼굴 모 형의 깊이 정보를 추정한 결과이며, 도 6은 삼차원 얼굴 모형에서 추출된 정점을 포함하는 삼차원 좌표 데이터 를 표시한 도면이다. 다시 도 3을 참조하면, 프로세서는 제 1 삼차원 얼굴 모형에서 사용자가 지정한 제 1 관심영역의 삼차원 좌표 데이터를 기초로 제 2 삼차원 얼굴 모형에서 제 1 관심영역과 매칭되는 제 2 관심 영역을 특정한다(S120). 이 때 제 1 관심영역과 매칭되는 제 2 관심 영역을 특정하기 위해서 제1삼차원 얼굴모형 및 제 2 삼차원 얼굴 모형에서 추출된 정점을 이용할 수 있다. 예를 들어 얼굴 모형에서 공통으로 추출된 정점 중 하나인 눈을 기준 으로 제 1 삼차원 얼굴모형에서 지정된 영역과 같은 영역을 찾아낼 수 있다. 제 1 관심영역은 사용자가 관심있는 영역을 얼굴 영상에서 직접 지정할 수도 있고, 인공지능 기술의 일종인 객 체 감지(object detection) 또는 위치 검출(localization) 기술을 이용하여 여드름, 다크서클과 같은 피부 특징 을 검출하거나 openCV를 활용한 간단한 컴퓨터 비젼 기술 (붉은 영역 검출, 모공 검출)을 활용해서 해당 영역을 지정하는 것도 가능하다. 즉 프로세서는 미리 입력된 삼차원 얼굴 모형을 기초로 컨볼루션 신경망에 기반 한 딥러닝 모델인 얼굴 피부 분석 모델을 통해 여드름, 다크서클, 붉은 영역 또는 모공 영역 중 하나 이상의 특 징을 학습하여 피부 특징 영역을 추출하고, 피부 특징 영역을 제1관심영역으로 지정할 수 있다. 그리고, 정점 좌표값을 이용하여 제 1 삼차원 얼굴 모형에서 선택된 제 1 관심영역에 대응하는 영역을 제 2 삼 차원 얼굴 모형에서 찾아낼 수 있다. 얼굴의 정점 및 랜드마크 검출을 위해 딥러닝 기반의 컨볼루션 신경망을 활용할 수 있다. 컴퓨터 비전에서 많이 쓰이는 68개 랜드마크와 같이 4만~6만개의 점은 각각 얼굴에서의 특정한 영역을 담당할 수 있다. 예를 들면 ID: 1인 정점이 눈에 해당되는 경우 얼굴 정렬 과정에서 항상 눈 쪽으로 배 치가 될 수 있다. 이런 방법으로 사용자 또는 전문인이 한 얼굴 영역 내에서 특정한 영역을 지정하면 다른 사진 에서도 해당 ID가 같은 정점 영역을 토대로 같은 영역을 찾아낼 수 있다. 프로세서는 제 1 삼차원 얼굴 모형의 제 1 관심 영역과 제 2 삼차원 얼굴 모형의 제 2 관심 영역의 삼차원 좌표 데이터 및 개별 특징 데이터에 기초하여 제 1 관심 영역과 제 2 관심 영역을 매칭시킨다(S130). 프로세서는 매칭된 제 1 관심 영역과 제 2 관심 영역간 정합을 위한 정점을 선택하고, 선택된 정점을 기준 으로 매칭된 제 2 관심 영역을 정렬하여 정합된 제 2 관심 영역으로 변환할 수 있다. 도 7을 참고하면, (a)에서와 같이 사용자가 제 1 관심영역(c)를 지정하면, (b)에서와 같이 제 1 관심영역과 대 응되는 제 2 관심 영역(d)을 매칭할 수 있다. 또한 비교 분석을 위해 매칭영역(d)를 관심영역(c)에 대응되는 동 일한 형태인 정합영역(e)로 변환할 수 있다. 변환된 정합영역(e)은 관심영역(c)과 좌표가 1대1로 대응되므로 비 교분석이 용이하다. 프로세서는 매칭된 제 1 관심 영역과 제 2 관심 영역에서 변화 데이터를 추출하여 비교 분석 데이터를 생 성하고, 개별 특징 데이터 및 비교 분석 데이터를 포함하는 피부 변화 분석 결과 데이터를 생성하여 사용자 단 말에 제공한다(S140). 본 발명은 전체적인 얼굴 피부 영역에 대한 분석이 아닌 지정된 또는 관심 영역에 대해 따로 피부 분석을 진행 할 수 있으며 변화 전에 촬영된 사진에서 대응되는 영역을 변화 후의 사진에서 정확히 검출하여 정밀한 비교분석을 진행하고 분석 데이터를 시각화할 수 있다. 피부 변화 분석 결과 데이터는 시각화된 데이터를 포함할 수 있으며, 구체적인 예로 도8 및 도9에서 도시되는 내용을 포함할 수 있다. 도 8은 본 발명의 일 실시예에 따른 사용자 얼굴 피부 분석 방법에서 분석 결과를 설명하는 도면이다. (a)는 제1얼굴영상이고 (b)는 제2얼굴영상이며, 제1 관심 영역은 (c1), 제2 관심영역은 (c2)이다. (d1), (e1)은 분석을 위해 (c1)을 변환한 영상이고, (d2), (e2)는 분석을 위해 (c2)을 변환한 영상이다. 원본 영상에서 추출 한 (c1), (c2)는 명암대비가 균일하지 않을 수 있으므로 명암값 분포를 재분배하는 작업인 히스토그램 평활화 (histogram equalization)을 거쳐 (d1), (d2)의 형태로 변환되고, 다시 (e1), (e2)의 형태로 정규화 (normalization)될 수 있다. 평활화 및 정규화를 거쳐 도 9와 같은 히스토그램 그래프를 생성할 수 있다. (f)는 (e1)과 (e2)의 차이를 표시한 영상이다. 프로세서는 제1 관심영역(c1) 및 제2 관심영역(c2)에서 앞선 과정을 거쳐 생성한 히스토그램 그래프를 각 각 개별 특징 데이터에 포함시킬 수 있다. 추가적으로 프로세서는 정상 피부로 설정된 영역의 히스토그램 그래프와 관심영역의 히스토그램 그래프의 분포 차이를 구하기 위해 코릴레이션(correlation), 교차점 (intersection) 또는 카이제곱(Chi-square)과 같은 히스토그램 비교 기법을 사용할 수 있고, 비교 결과 유사도 가 낮을수록 피부상태가 나쁜 것으로 판단하며, 해당 데이터를 각각 개별 특징 데이터에 포함시킬 수 있다. 프 로세서는 정상피부로 설정된 영역과 관심영역간 히스토그램 비교를 통해 관심영역의 피부상태를 객관적으 로 판단할 수 있고, 제1 관심영역과 제2관심영역간 히스토그램 비교를 통해 피부상태의 변화 정도를 판단하는 것도 가능하다. 도 9는 본 발명의 일 실시예에 따른 사용자 얼굴 피부 분석 방법에서 히스토그램을 설명하는 도면이다. 히스토그램이란 영상의 밝기값에 대한 분포를 보여주는 그래프로 영상분석을 위한 중요한 도구이다. 입력되는 영상의 히스토그램을 분석함으로써 영상의 밝기 구성, 명암의 대비 등에 대한 정보를 알 수 있으며 이를 피부 분석에 활용 가능하다. 시각화하는 과정의 경우 피부 특징 별로 점수를 주거나 히스토그램 분석을 이용할 수 있다. 히스토그램은 도9와 같이 픽셀 값의 분포를 나타낸 2차원 그래프이다. (a)는 변화 전 제 1 관심 영역의 피부 영상이고 (b)는 변화 후 제 2 관심 영역의 피부 영상이며 (c)는 피부 트러블이 없는 정상 피부의 영상이다. (a), (b), (c)의 픽셀 값 의 분포를 (d)의 그래프상에 함께 표시하였다. 이를 통해 정상 피부의 히스토그램과 피부 트러블이 발생한 히스 토그램, 스킨케어 후 피부의 히스토그램을 비교할 수 있다. 정상피부의 히스토그램 분포에 비해 얼마만큼 벗어 나 있는지를 산출하여 차이값을 비정상적인 정도로 규정할 수 있다. 차이값이 높을수록 피부 상태가 안 좋다는 것을 의미한다. 사용자는 직접 전문의의 소견을 들을 필요 없이, 또는 일일이 과거 피부 정보를 기억할 필요 없이 용이하게 분 석된 결과를 접할 수 있다. 따라서 단순히 전체 영역에서의 피부 상태를 측정하는 것보다는 본 발명을 이용하여 어떤 영역(Where), 어떻게(What), 언제(When) 이런 분석이 진행되었는지 효과적으로 기록하고 이를 충분히 활용 하여 더욱 정밀하고 신뢰성 있는 피부 상태 분석을 진행할 수 있다. 본 발명의 일 실시예는 컴퓨터에 의해 실행되는 프로그램 모듈과 같은 컴퓨터에 의해 실행가능한 명령어를 포함 하는 기록 매체의 형태로도 구현될 수 있다. 컴퓨터 판독 가능 매체는 컴퓨터에 의해 액세스될 수 있는 임의의 가용 매체일 수 있고, 휘발성 및 비휘발성 매체, 분리형 및 비분리형 매체를 모두 포함한다. 또한, 컴퓨터 판독 가능 매체는 컴퓨터 저장 매체를 포함할 수 있다. 컴퓨터 저장 매체는 컴퓨터 판독가능 명령어, 데이터 구조, 프로그램 모듈 또는 기타 데이터와 같은 정보의 저장을 위한 임의의 방법 또는 기술로 구현된 휘발성 및 비휘발 성, 분리형 및 비분리형 매체를 모두 포함한다. 본 발명의 방법 및 시스템은 특정 실시예와 관련하여 설명되었지만, 그것들의 구성 요소 또는 동작의 일부 또는 전부는 범용 하드웨어 아키텍쳐를 갖는 컴퓨터 시스템을 사용하여 구현될 수 있다."}
{"patent_id": "10-2019-0169268", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "전술한 본원의 설명은 예시를 위한 것이며, 본원이 속하는 기술분야의 통상의 지식을 가진 자는 본원의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본원의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본원의 범위에 포함되는 것으로 해 석되어야 한다."}
{"patent_id": "10-2019-0169268", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 사용자 얼굴 피부 분석 서버의 구성을 도시한 블록도이다. 도 2는 본 발명의 일 실시예에 따른 사용자 얼굴 피부 분석 시스템의 구성을 도시한 블록도이다. 도 3은 본 발명의 일 실시예에 따른 사용자 얼굴 피부 분석 방법의 진행 단계를 나타낸 흐름도이다. 도 4는 본 발명의 일 실시예에 따른 사용자 얼굴 피부 분석 방법을 설명하는 도면이다. 도 5는 본 발명의 일 실시예에 따른 사용자 얼굴 피부 분석 방법을 설명하는 도면이다. 도 6은 본 발명의 일 실시예에 따른 사용자 얼굴 피부 분석 방법을 설명하는 도면이다. 도 7은 본 발명의 일 실시예에 따른 사용자 얼굴 피부 분석 방법에서 매칭 및 정합을 설명하는 도면이다. 도 8은 본 발명의 일 실시예에 따른 사용자 얼굴 피부 분석 방법에서 분석 결과를 설명하는 도면이다. 도 9는 본 발명의 일 실시예에 따른 사용자 얼굴 피부 분석 방법에서 히스토그램을 설명하는 도면이다."}
