{"patent_id": "10-2021-0128279", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0045428", "출원번호": "10-2021-0128279", "발명의 명칭": "홍채 영상 분석을 통한 치매 진단방법 및 이를 이용한 어플리케이션과 장치", "출원인": "최지인", "발명자": "최지인"}}
{"patent_id": "10-2021-0128279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자 단말기로부터 사용자의 눈을 촬영한 사용자 홍채 영상이 서버에 전송되는 전송단계;영상처리모듈에서 상기 사용자 홍채 영상을 그레이 스케일, 가우시안 필터, 캐니 엣지 알고리즘을 포함한 이미지 프로세싱 수단 중 어느 하나 이상을 이용하여 상기 사용자 홍채 영상을 전처리 하는 단계;분석모듈에서 상기 전처리 단계 이후에, 사용자 홍채 영상을 미리 정해 놓은 기준에 따라 영상의 구획을 나누는구획 분류단계;분석모듈에서 상기 구획 분류단계를 거친 사용자 홍채 영상에서 미리 정해놓은 기준에 따라 특징부를 추출하는특징부 추출단계;분석모듈에서 상기 특징부 추출단계에서 획득된 영상 정보를 데이터베이스에 저장된 홍채 맵에 적용하여 특징부를 맵핑하는 맵핑 단계; 및분석모듈에서 데이터베이스부에 저장된 학습된 데이터 알고리즘과 상기 맵핑단계에서 얻어진 맵핑 데이터를 비교분석하여 경도인지장애, 알츠하이머병 또는 치매 여부를 진단하는 단계를 포함하는홍채 영상 분석을 통한 치매 진단방법."}
{"patent_id": "10-2021-0128279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,상기 데이터베이스부에 저장된 학습된 데이터 알고리즘은 경도인지장애, 알츠하이머병 또는 치매 환자 군과 정상인 군의 홍채 영상에서 추출된 특징부의 맵핑 정보가 학습된 것인홍채 영상 분석을 통한 치매 진단방법."}
{"patent_id": "10-2021-0128279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항에 있어서,상기 구획분류 단계는 상기 사용자 홍채 영상을 10분할 이상으로 구획을 지정하는 것이고,상기 맵핑 단계는 상기 구획별로 분류된 영상이미지 별로 맵핑되는 것인홍채 영상 분석을 통한 치매 진단방법."}
{"patent_id": "10-2021-0128279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 2항에 있어서,상기 특징부 추출단계는 슈왈브 방사형 주름(Radial contraction folds of Schwalbe)의 모양을 기준으로 경도인지장애, 알츠하이머병 또는 치매 환자 군의 홍채 영상을 기초로 학습되어 정해지는 것인홍채 영상 분석을 통한 치매 진단방법."}
{"patent_id": "10-2021-0128279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 3항에 있어서,상기 구획 분류 단계는 상기 특징부가 5 내지 11 이상 포함되는 이미지로부 무작위로 구획되는 것인홍채 영상 분석을 통한 치매 진단방법."}
{"patent_id": "10-2021-0128279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2023-0045428-3-제 1항 내지 제5항에 있어서, 어느 한 항에 따른 방법이 적용된 어플리 케이션."}
{"patent_id": "10-2021-0128279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1항 내지 제5항에 있어서, 어느 한 항에 따른 방법이 적용된 장치."}
{"patent_id": "10-2021-0128279", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 홍채 영상 분석을 통한 치매 진단방법 및 이를 이용한 어플리케이션과 장치에 관한 것이다. 본 발명은 홍채 영상 분석을 통하여 빠르고 편리하게 알츠하이머병 또는 치매를 진단할 수 있도록 하는 방법을 제공한다. 특히 상기 방법을 통하여 알츠하이머병 또는 치매를 조기에 진단하여 빠른 치료가 이루어질 수 있도록 한다. (뒷면에 계속)"}
{"patent_id": "10-2021-0128279", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 홍채 영상 분석을 통한 치매 진단방법 및 이를 이용한 어플리케이션과 장치에 관한 것이다. 보다 상 세하게는 학습된 데이터를 기반으로 홍채 영상 및 홍채 맵을 통한 맵핑, 영상 처리 기법을 적용하여 비교적 빠 르고 간단하게 치매 발현을 조기에 진단할 수 있는 홍채 영상 분석을 통한 치매 진단방법 및 이를 이용한 어플 리케이션과 장치를 제공한다."}
{"patent_id": "10-2021-0128279", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "알츠하이머병(Alzheimer's disease)은 나이와 관련된 신경퇴행성 질환 중에 가장 대표적인 치매를 일으키는 가 장 흔한 퇴행성 뇌질환을 말한다. 이는 주로 노인들에게서 나타나는 치매의 약 70% 이상을 차지하는 질병이며, 매우 서서히 발병하여 점진적으로 진행되는 경과가 특징적이다. 알츠하이머가 발병한 환자는 신경세포 소실로 인해 전반적 뇌 위축 소견을 나타내며, 뇌 조직에서 특징적인 병변인 신경반(neuritic plaque)과 신경섬유다발 (neurofibrillary tangle) 등이 관찰된다. 이러한 뇌 병리 소견은 질병 초기에는 주로 기억력을 담당하는 주요 뇌 부위인 해마와 내후각뇌피질 부위에 국한되어 나타나지만 점차 뇌 전체로 확장되어 초기에는 기억력 저하가 주로 나타나다가 병이 진행됨에 따라 언어능력, 사고판단력, 일상생활수행능력 등이 저하되고 경우에 따라서는 정신이상행동 등이 동반되는 등 다양한 임상 증상이 나타나면서 중증으로 발전하게 된다. 현재까지 알츠하이머병의 정확한 발병 기전과 원인에 대해서는 정확히 알려져 있지는 않다. 현재 베타 아밀로이 드(betaamyloid)가 과량 만들어져 뇌에 침착되면서 뇌 세포에 유해한 영향을 주는 것이 발병의 핵심 기전으로 추정되나, 그 외에도 타우 단백질(tau protein)의 과인산화, 염증, 산화적 손상 등도 발병과 관련이 있는 것으 로 보인다는 연구결과 등이 알려지고 있다. 참고로, 경도인지장애(Mild Cognitive Impairment: MCI)는 동일 연령대에 비해 인지기능, 특히 기억력이 저하되 어 있지만, 일상생활을 수행하는 능력은 유지하고 있는 치매의 전단계를 지칭한다. 경도인지장애가 나타나는 사 람의 경우 알츠하이머병으로의 진행가능성이 매우 높은 고위험군으로 지목되고 있다. 따라서 경도인지장애는 알 츠하이머병을 가장 조기에 발견할 수 있는 단계로써 최근 새로운 유형의 알츠하이머병 치료약물이 알츠하이머병 의 말기보다 초기에 더욱 더 효과적이라는 점에서 치료효과의 극대화와 관련하여 경도인지장애의 조기 발견은 임상적으로 매우 중요한 의미를 가진다. 더구나 65세 이상의 남자의 경우 알츠하이머병의 유병률이 33%, 여자의 경우 45%에 이르며, 인구증가 및 의학의 발전으로 인한 평균수명의 증가와 함께 2040년 정도에는 전세계적으로 알츠하이머병 환자가 약 8100만여명에 이를 것으로 추산되는 바 조기에 알츠하이머병으로 진행가능성이 높은 군 을 선별하고, 이에 대한 적절한 치료 체계를 확립하는 것은 매우 중요한 일이다. 이러한 알츠하이머병 또는 치매를 진단하는 방법으로는 뇌척수액 또는 혈청에서 베타 아밀로이드 단백질을 검출 하는 방법, tau 단백질의 농도를 측정하는 방법, 신경아교원섬유 산성 단백질(glial fibrillary acidic protein, GFAP)-항체를 검출하는 방법 등의 생화학적 방법들이 제안되었으나, 진단 방법의 임상 적용의 효율성 과 정확도 등의 문제가 제기되고 있다.(국제공개특허 제92/17152호; 미국특허 제4,666,829호; 국제공개특허 제 89/06242호; 미국특허 제5,231,000호 등) 또한 최근에는 혈액의 자가항체 분석법(KR 10-1873247 B1) 또는 특이 적 유전자 발현패턴분석법(KR 10-1873249 B1) 등이 개발되고 있다. 그러나 위와 같은 생화학적 진단방법의 경우, 그 시간 및 비용이 많이 들기 때문에 다수의 사람들이 활용하기 어렵고, 일정한 징후가 나타난 사람들이 주로 활용하는 수단이 되기 때문에 알츠하이머병 또는 치매로 발전하기 전단계인 경도인지장애, 또는 비교적 치료가능성이 높은 알츠하이머병 또는 치매의 발병 초기 단계에서 발병사 실을 진단하기 어렵다는 일정한 문제점과 이로 인한 치료의 한계점을 가지게 된다. 이에 따라 최근에는 디지털 장비를 이용하여 보다 간편하게 알츠하이머병 또는 치매를 진단하는 방법이 주목을 받고 있다. 특히 알츠하이머병 또는 치매를 초기에 진단하거나, 그 전 단계라 할 수 있는 경도인지장애를 진단 하는 경우 상기 알츠하이머병 또는 치매로 진행되는 것을 효과적으로 예방하거나 치료 성공률을 높일 수 있기때문에 다양한 형태의 디지털 장비 또는 콘테츠를 활용한 진단방법이 시도되고 있다. 관련된 기술을 보면, 디지털 장비를 통하여 뇌파를 측정하여 치매 징후를 분석하는 치매진단 시스템(KR 10- 2018-0126239 A), 인공지능 및 빅데이터를 기반으로 한 가상현실을 활용하여 치매 및 뇌질환을 진단하는 방법 (KR 10-2269428 A) 등이 제시되고 있다. 이에 본 발명자는 홍채 영상 분석을 기초로 보다 빠르고 편리하게 알츠하이머병 또는 치매를 진단할 수 있도록 하는 영상처리 및 알고리즘을 연구하였고, 그에 따라 보다 신뢰성 높은 결과를 얻을 수 있는 과제해결원리를 도 출하여 본 발명을 완성하였다. 선행기술문헌 특허문헌 (특허문헌 0001) KR 10-2018-0126239 A (특허문헌 0002) KR 10-2269428 B1"}
{"patent_id": "10-2021-0128279", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 홍채 영상 분석을 통하여 빠르고 편리하게 알츠하이머병 또는 치매를 진단할 수 있도록 하는 방법을 제공하기 위한 것이다. 특히 상기 방법을 통하여 알츠하이머병 또는 치매를 조기에 진단하여 빠른 치료 가 가능할 수 있도록 하기 위한 것이다. 본 발명의 목적은 수집된 홍채의 영상처리 및 관심영역 추출, 수집된 홍채 맵과 비교분석 하는 과정과 누적된 빅데이터를 기반으로 치매 징후 여부를 진단하는 알고리즘을 적용하고, 이를 통하여 보다 신뢰성 높은 결과를 가지는 홍채 영상 분석을 통한 치매 진단방법을 제공하기 위한 것이다. 본 발명의 다른 목적은 상기 방법이 적용된 알츠하이머병 또는 치매 진단용 어플리케이션을 제공하기 위한 것이다. 본 발명의 다른 목적은 상기 방법이 적용된 알츠하이머병 또는 치매 진단용 장치를 제공하기 위한 것이다."}
{"patent_id": "10-2021-0128279", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위하여, 본 발명의 일 실시예에 따른 홍채 영상 분석을 통한 치매 진단방법은 사용자 단 말기로부터 사용자의 눈을 촬영한 사용자 홍채 영상이 서버에 전송되는 전송단계; 영상처리모듈에서 상기 사용 자 홍채 영상을 그레이 스케일, 가우시안 필터, 캐니 엣지 알고리즘을 포함한 이미지 프로세싱 수단 중 어느 하 나 이상을 이용하여 상기 사용자 홍채 영상을 전처리 하는 단계; 분석모듈에서 상기 전처리 단계 이후에, 사용 자 홍채 영상을 미리 정해 놓은 기준에 따라 영상의 구획을 나누는 구획 분류단계; 분석모듈에서 상기 구획 분 류단계를 거친 사용자 홍채 영상에서 미리 정해놓은 기준에 따라 특징부를 추출하는 특징부 추출단계; 분석모듈 에서 상기 특징부 추출단계에서 획득된 영상 정보를 데이터베이스에 저장된 홍채 맵에 적용하여 특징부를 맵핑 하는 맵핑 단계; 및 분석모듈에서 데이터베이스부에 저장된 학습된 데이터 알고리즘과 상기 맵핑단계에서 얻어 진 맵핑 데이터를 비교분석하여 경도인지장애, 알츠하이머병 또는 치매 여부를 진단하는 단계를 포함하는 것이다. 상기 데이터베이스부에 저장된 학습된 데이터 알고리즘은 경도인지장애, 알츠하이머병 또는 치매 환자 군과 정 상인 군의 홍채 영상에서 추출된 특징부의 맵핑 정보가 학습된 것일 수 있다. 상기 홍채 영상 분석을 통한 치매 진단방법에 있어서 상기 구획분류 단계는 상기 사용자 홍채 영상을 10분할 이 상으로 구획을 지정하는 것이고, 상기 맵핑 단계는 상기 구획별로 분류된 영상이미지 별로 맵핑되는 것일 수 있 다. 상기 특징부 추출단계는 슈왈브 방사형 주름(Radial contraction folds of Schwalbe)의 모양을 기준으로 경도 인지장애, 알츠하이머병 또는 치매 환자 군의 홍채 영상을 기초로 학습되어 정해지는 것일 수 있다.상기 구획 분류 단계는 상기 특징부가 3 이상 포함되는 이미지로부 무작위로 구획되는 것일 수 있다. 본 발명의 다른 일 실시예에 따른 어플리케이션은 상기 홍채 영상 분석을 통한 치매 진단방법이 적용될 수 있다. 본 발명의 다른 일 실시예에 따른 장치는 상기 홍채 영상 분석을 통한 치매 진단방법이 적용될 수 있다."}
{"patent_id": "10-2021-0128279", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 홍채 영상 분석을 통하여 빠르고 편리하게 알츠하이머병 또는 치매를 진단할 수 있도록 하는 방법을 제공한다. 특히 상기 방법을 통하여 알츠하이머병 또는 치매를 조기에 진단하여 빠른 치료가 이루어질 수 있도 록 한다. 본 발명은 수집된 홍채의 영상처리 및 관심영역 추출, 수집된 홍채 맵과 비교분석 하는 과정과 누적된 빅데이터 를 기반으로 치매 징후 여부를 진단하는 알고리즘을 적용하고 이를 통하여 보다 신뢰성 높은 결과를 가지는 홍 채 영상 분석을 통한 치매 진단방법을 제공한다. 본 발명 다른 일 실시예는 상기 방법이 적용된 알츠하이머병 또는 치매 진단용 어플리케이션을 제공한다. 본 발명의 또 다른 일 실시예는 상기 방법이 적용된 알츠하이머병 또는 치매 진단용 장치를 제공한다."}
{"patent_id": "10-2021-0128279", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본 발명의 실시예 에 대하여 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 본 발명의 명세서에 있어서, 어떤 구성요소를 포함(comprising 또는 including)한다고 기재된 경우, 이는 특별 히 한정 또는 반대되는 사항의 기재가 없는 한 열린 구성을 말하는 것으로 포함되는 구성요소 이외의 다른 구성 요소를 더 포함할 수 있는 것이다. 또한, 본 발명의 명세서에 기재된 \"-부\"로 기재된 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 지칭 한다. 이는 하드웨어, 소프트웨어 및 이들의 결합으로부터 구현되는 것일 수 있다. 나아가, \"일(a 또는 an)\", \"하나(one)\", 및 유사 관련 어구는 본 발명을 기술하는 문맥에 있어서 본 명세서에 달리 지시되거나 문맥에 의 해 분명하게 반박되지 않는 한, 단수 및 복수 모두를 포함하는 의미로 사용될 수 있다. 본 발명의 일 실시예에 따른 홍채 영상 분석을 통한 치매 진단방법은 사용자 단말기로부터 사용자의 눈을 촬영 한 사용자 홍채 영상이 서버에 전송되는 전송단계(S1); 영상처리모듈에서 상기 사용자 홍채 영상을 그레이 스케 일, 가우시안 필터, 캐니 엣지 알고리즘을 포함한 이미지 프로세싱 수단 중 어느 하나 이상을 이용하여 상기 사 용자 홍채 영상을 전처리 하는 단계(S2); 분석모듈에서 상기 전처리 단계 이후에, 사용자 홍채 영상을 미리 정 해 놓은 기준에 따라 영상의 구획을 나누는 구획 분류단계(S3); 분석모듈에서 상기 구획 분류단계를 거친 사용 자 홍채 영상에서 미리 정해놓은 기준에 따라 특징부를 추출하는 특징부 추출단계(S4); 분석모듈에서 상기 특징 부 추출단계에서 획득된 영상 정보를 데이터베이스에 저장된 홍채 맵에 적용하여 특징부를 맵핑하는 맵핑 단계 (S5); 및 분석모듈에서 데이터베이스부에 저장된 학습된 데이터 알고리즘과 상기 맵핑단계에서 얻어진 맵핑 데 이터를 비교분석하여 경도인지장애, 알츠하이머병 또는 치매 여부를 진단하는 단계(S6)를 포함하는 것이다. 상기 전송단계(S1)은 사용자 단말기에 포함된 카메라를 통하여 촬영된 사용자의 홍채이미지가 서버를 통하여 시 스템에 전송되는 단계를 말하며, 상기 데이터의 전송수단은 유/무선 수단을 모두 포함하며, 특별히 한정되지 아니한다. 또한 상기 사용자 단말기는 카메라를 포함하고 데이터를 송수신 할 수 있는 수단이 포함되는 모든 디바 이스를 포함하는 것이다. 상기 전송단계(S1)를 통하여 촬영된 이미지가 분석을 위하여 서버를 통하여 시스템에 전송될 수 있으며, 설정에 따라 상기 서버에 연동된 사용자 데이터베이스에 저장되는 것일 수 있다. 상기 전처리 단계(S2)는 수집된 사용자의 홍채 영상을 분석할 수 있는 형태로 영상 이미지를 보정하는 단계를 말한다. 상기 사용자 홍채 영상을 그레이 스케일, 가우시안 필터, 캐니 엣지 알고리즘을 포함한 이미지 프로세 싱 수단 중 어느 하나 이상을 이용하여 홍채 영상 분석을 통한 치매 진단시스템에서 정량화 된 기준범위로 이미 지를 보정하는 단계를 말한다. 상기 전처리 단계(S2)를 통하여 진단의 오차를 감소시켜 수집된 데이터를 정량화 시킬 수 있다. 상기 구획분류단계(S3)는 사용자 홍채 영상을 미리 정해 놓은 기준에 따라 영상의 구획을 나누는 것을 의미한다. 특정된 구획별로 나누어 특징부를 검출하는 것일 수 있으며, 특징부의 숫자에 따라 그 구획의 크기를 조정하는 것일 수 있다. 특히 특징부 별로 분류된 구획범위 내에서 추출된 특징부의 맵핑 정보를 기반으로 이미지 진단의 정확도를 높일 수 있다. 상기 구획분류단계(S3)는 마름모 꼴을 포함한 사각의 형상으로 사용자 홍채 이미지 상에서 동공부에 2개의 꼭지 점을 지정하고, 홍채주름 방향으로 변을 이루는 사각형일 수 있다. 이를 통하여 구분된 각 구획 별로, 홍채 주 름으로 구성된 신경의 교차점 중 특이점을 추출하고 특정되고 구별되는 이미지를 가지는 관심영역을 특정할 수 있다. 본 발명에서 제공하는 특징부 추출, 구획분류 및 맵핑단계는 심층 신경망이 합성곱 신경망(Convolutional Neural Network: CNN)을 포함한 인공지능이 적용된 것일 수 있다. 상기 구획분류단계(S3)는 10 이상의 구획이 임의적으로 설정될 수 있으며, 상기 각 구획은 미리 정해 놓은 특징 부를 5 내지 11개 이상 가지는 영역을 기초로 설정된 것일 수 있다. 또한 각 구획은 상기 특징부를 기초로 설정 되며, 서로 영역이 중첩될 수 있다. 상기 특징부가 5개 미만인 경우 구획분류단계(S3)에서 설정된 영역이 너무 작고, 각 특징부의 분포, 선형화 이 미지 등의 결과에 대한 오차가 커지기 때문에 진단의 정확도가 낮아지는 문제가 있다. 반면 상기 특징부가 11개 를 초과하는 경우에는 서로 멀리 존재하는 특징부 포인트를 기초로 구획이 분류되어, 중첩되는 구획이 다수 발 생하며, 맵핑 단계에서 비교적 긴 선형의 이미지가 다수 현출되어 맵핑 데이터의 신뢰성이 낮아지는 문제가 있 다. 따라서 상기 특징부를 5 내지 11의 범위로 하는 경우 홍채의 이미지 및 질병의 진단 맵핑 등으로 진단의 신 뢰성이 높은 복수개의 구획이 설정되도록 프로그래밍 할 수 있다. 상기 특징부추출단계(S4)는 분석모듈에서 상기 구획 분류단계를 거친 사용자 홍채 영상에서 미리 정해놓은 기준 에 따라 특징부를 추출하는 단계를 말한다. 상기 특징부는 경도인지장애, 알츠하이머병 또는 치매 환자 군과 정상인 군의 홍채 영상을 기반으로 딥러닝을 통하여 알고리즘화 된 특정 및 구분되는 홍채주름의 교차점 이미지를 기초로 추출되는 것일 수 있다. 각 홍채주름의 각 교차점을 중심으로 슈왈브 방사형 주름(Radial contraction folds of Schwalbe)의 모양 및 동공으로부터 교차점의 거리를 기초로 촬영된 이미지 내의 특징부 여부에 대한 특징부 결정단계를 진행한다. 데이터베이스에 저장된 홍채 맵의 알고리즘에 따라 상기 특징부 결정단계 이후에 상기 특징부를 점으로 표시하 고, 각 특징부 포인트로부터 일정한 반경 영역 내에 존재하는 다른 특징부를 모두 연결하여 표현된 선형의 이미 지를 도출하는 선형화 단계를 진행하며, 상기 선형화 단계 이후에 상기 교차점의 개수, 모양, 선형화 이미지를 경도인지장애, 알츠하이머병 또는 치매 환자 군과 정상인 군의 홍채 영상을 기반으로 딥러닝을 통하여 형성된 데이터와 비교 분석하여 발병 여부를 진단하는 단계로 진행되는 것이다. 상기 딥러닝은 미리 데이터베이스에 저장된 데이터를 기반으로 일정한 기준에 따라 학습부를 통하여 고도화될 수 있으며, 누적되는 사용자 데이터 베이스 및 실제 의료기관의 진단 결과 데이터의 업데이트를 받아 지속적으 로 학습되어 진단능력이 정교해지는 것일 수 있다. 상기 데이터베이스부에 저장된 학습된 데이터 알고리즘은 경도인지장애, 알츠하이머병 또는 치매 환자 군과 정 상인 군의 홍채 영상에서 추출된 특징부의 맵핑 정보가 학습된 것일 수 있다. 본 발명에 서 말하는 맵핑 정보는 교차점의 개수, 모양, 선형화 이미지로 분류된 홍채 영상 분석 데이터를 포함 하며, 이는 딥러닝을 통하여 경도인지장애, 알츠하이머병 또는 치매 환자 군과 정상인 군의 특징적 사항이 알고 리즘으로 표현된 것일 수 있다. 상기 진단방법에 의하는 경우 지속인 데이터 누적 및 학습에 따라 특징부 및 선형화 이미지를 포함한 맵핑 정보 를 기반으로 진단의 정확성이 보다 고도화될 수 있다. 상기 맵핑 단계는 상기 구획별로 분류된 영상이미지 별로 맵핑되는 것일 수 있다. 각 구획 별로 맵핑하여 특징 부 및 선형화 된 이미지를 분석함으로서, 각 구획 내의 독립적인 결과를 기초로 진단하며, 각 구획별로 진단된 결과를 종합하여 2차 진단을 진행함으로서 보다 신뢰성 높은 진단결과를 얻을 수 있다. 상기 특징부 추출단계는 슈왈브 방사형 주름(Radial contraction folds of Schwalbe)의 모양을 기준으로 경도 인지장애, 알츠하이머병 또는 치매 환자 군의 홍채 영상을 기초로 학습되어 정해지는 것일 수 있다. 상기 구획 분류 단계는 상기 특징부가 3 이상 포함되는 이미지로부 무작위로 구획되는 것일 수 있다. 본 발명의 다른 일 실시예에 따른 어플리케이션은 상기 홍채 영상 분석을 통한 치매 진단방법이 적용될 수 있다. 본 발명의 다른 일 실시예에 따른 장치는 상기 홍채 영상 분석을 통한 치매 진단방법이 적용될 수 있다. 이상에서 본 발명의 바람직한 실시예에 대하여 상세하게 설명하였지만 본 발명의 권리범위는 이에 한정되는 것 은 아니고 다음의 청구범위에서 정의하고 있는 본 발명의 기본 개념을 이용한 당업자의 여러 변형 및 개량 형태 또한 본 발명의 권리범위에 속하는 것이다."}
{"patent_id": "10-2021-0128279", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 홍채 영상 분석을 통한 치매 진단방법의 순서도에 관한 것이다. 도 2는 본 발명의 일 실시예에 따른 홍채 영상 분석을 통한 치매 진단방법에서 구획분류단계를 나타난 예시도이 다. 도 3은 본 발명의 일 실시예에 따른 홍채 영상 분석을 통한 치매 진단방법에서 특징부 추출단계를 나타난 예시 도이다. 도 4은 본 발명의 일 실시예에 따른 홍채 영상 분석을 통한 치매 진단방법에서 맵핑 단계를 나타난 예시도이다."}
