{"patent_id": "10-2023-0016274", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0071256", "출원번호": "10-2023-0016274", "발명의 명칭": "임상 의사 결정 지원 장치 및 방법", "출원인": "경희대학교 산학협력단", "발명자": "홍충선"}}
{"patent_id": "10-2023-0016274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "하나 이상의 로컬 단말과 통신을 수행하는 통신부; 및상기 통신부와 연결된 제어부를 포함하며, 상기 제어부는상기 하나 이상의 로컬 단말로 의료 진단 모델을 전송하며,상기 하나 이상의 로컬 단말로부터 상기 하나 이상의 로컬 단말 각각이 보유한 데이터 세트를 기초로 상기 의료진단 모델을 학습하여 생성한 로컬 매개 변수를 수신하며,상기 하나 이상의 로컬 단말로부터 수신한 로컬 매개 변수 각각에 소정의 가중치를 부여 후 통합하여 상기 의료진단 모델을 업데이트하는, 임상 의사 결정 지원 서버 장치."}
{"patent_id": "10-2023-0016274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 상기 의료 진단 모델은증상에 대한 데이터를 입력 받아 질병 종류에 대한 데이터를 출력하도록 학습되는 인공 신경망인, 임상 의사 결정 지원 서버 장치."}
{"patent_id": "10-2023-0016274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 소정의 가중치는상기 의료 진단 모델의 글로벌 매개 변수와 상기 하나 이상의 로컬 단말로부터 수신한 로컬 매개 변수와의 거리에 기초하여 결정되는, 임상 의사 결정 지원 서버 장치."}
{"patent_id": "10-2023-0016274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 제어부는상기 의료 진단 모델의 글로벌 매개 변수와 상기 하나 이상의 로컬 단말로부터 수신한 로컬 매개 변수와의 각각의 거리가 소정 임계치 이하가 될 때 까지 의료 진단 모델의 업데이트를 반복하는, 임상 의사 결정 지원 서버장치."}
{"patent_id": "10-2023-0016274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "서버와 통신을 수행하는 통신부; 증상 및 질병 종류에 대한 학습 데이터를 저장하는 데이터 베이스; 및상기 통신부 및 상기 데이터 베이스와 연결된 제어부를 포함하며, 공개특허 10-2024-0071256-3-상기 제어부는상기 서버로부터 의료 진단 모델을 수신하며,상기 데이터 베이스에 저장된 학습 데이터에 기초하여 상기 의료 진단 모델을 학습 시키며, 상기 학습된 의료 진단 모델에 대한 로컬 매개 변수를 추출하여 상기 서버로 전송하는, 임상 의사 결정 지원 단말 장치."}
{"patent_id": "10-2023-0016274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서, 상기 제어부는 상기 서버로 전송한 로컬 매개 변수에 대한 응답으로 상기 서버로부터 업데이트된 의료 진단 모델을 수신하는,임상 의사 결정 지원 단말 장치."}
{"patent_id": "10-2023-0016274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서, 상기 업데이트된 의료 진단 모델은상기 서버가 하나 이상의 임상 의사 결정 지원 단말 장치로부터 수신한 로컬 매개 변수에 소정 가중치를 부여하여 통합한 글로벌 매개 변수에 기초하여 생성된, 임상 의사 결정 지원 단말 장치."}
{"patent_id": "10-2023-0016274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서, 상기 소정 가중치는 상기 서버에 구비된 의료 진단 모델의 글로벌 매개 변수와 상기 서버가 상기 하나 이상의 임상 의사 결정 지원단말 장치로부터 수신한 로컬 매개 변수와의 거리에 기초하여 결정되는, 임상 의사 결정 지원 단말 장치."}
{"patent_id": "10-2023-0016274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 6 항에 있어서, 상기 제어부는 상기 업데이트된 의료 진단 모델을 기초로 사용자로부터 수신한 증상 데이터에 대한 질병 종류를 예측하며, 약물 추천 모델에 예측된 질병 종류를 입력하여 추천 약물 데이터를 생성하는, 임상 의사 결정 지원 단말 장치."}
{"patent_id": "10-2023-0016274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9항에 있어서, 상기 제어부는 의료 전문가로부터 상기 추천 약물 데이터에 포함된 하나 이상의 추천 약물 중 적어도 하나를 선택하는 입력을수신하며,공개특허 10-2024-0071256-4-선택 결과를 기초로 상기 약물 추천 모델을 학습하는, 임상 의사 결정 지원 단말 장치."}
{"patent_id": "10-2023-0016274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "하나 이상의 프로세서들, 및상기 하나 이상의 프로세서들에 의해 실행되는 하나 이상의 프로그램들을 저장하는 메모리를 구비한 컴퓨팅 장치에서 수행되는 방법으로서,하나 이상의 로컬 단말로 의료 진단 모델을 전송하는 단계;상기 하나 이상의 로컬 단말로부터 상기 하나 이상의 로컬 단말 각각이 보유한 데이터 세트를 기초로 상기 의료진단 모델을 학습하여 생성한 로컬 매개 변수를 수신하는 단계; 및상기 하나 이상의 로컬 단말로부터 수신한 로컬 매개 변수 각각에 소정의 가중치를 부여 후 통합하여 상기 의료진단 모델을 업데이트하는 단계를 포함하는, 방법."}
{"patent_id": "10-2023-0016274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11 항에 있어서, 상기 의료 진단 모델은증상에 대한 데이터를 입력 받아 질병 종류에 대한 데이터를 출력하도록 학습되는 인공 신경망인, 방법."}
{"patent_id": "10-2023-0016274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 11 항에 있어서,상기 소정의 가중치는상기 의료 진단 모델의 글로벌 매개 변수와 상기 하나 이상의 로컬 단말로부터 수신한 로컬 매개 변수와의 거리에 기초하여 결정되는, 방법."}
{"patent_id": "10-2023-0016274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13 항에 있어서,상기 의료 진단 모델을 업데이트하는 단계는상기 의료 진단 모델의 글로벌 매개 변수와 상기 하나 이상의 로컬 단말로부터 수신한 로컬 매개 변수와의 각각의 거리가 소정 임계치 이하가 될 때 까지 반복하는, 방법."}
{"patent_id": "10-2023-0016274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "하나 이상의 프로세서들, 및상기 하나 이상의 프로세서들에 의해 실행되는 하나 이상의 프로그램들을 저장하는 메모리를 구비한 컴퓨팅 장치에서 수행되는 방법으로서,서버로부터 의료 진단 모델을 수신하는 단계;데이터 베이스에 저장된 학습 데이터에 기초하여 상기 의료 진단 모델을 학습 시키는 단계; 및 공개특허 10-2024-0071256-5-상기 학습된 의료 진단 모델에 대한 로컬 매개 변수를 추출하여 상기 서버로 전송하는 단계를 포함하는, 방법."}
{"patent_id": "10-2023-0016274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 15 항에 있어서, 상기 서버로 전송한 로컬 매개 변수에 대한 응답으로 상기 서버로부터 업데이트된 의료 진단 모델을 수신하는단계를 더 포함하는, 방법."}
{"patent_id": "10-2023-0016274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 16 항에 있어서, 상기 업데이트된 의료 진단 모델은상기 서버가 하나 이상의 임상 의사 결정 지원 단말 장치로부터 수신한 로컬 매개 변수에 소정 가중치를 부여하여 통합한 글로벌 매개 변수에 기초하여 생성된, 방법."}
{"patent_id": "10-2023-0016274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 17 항에 있어서, 상기 소정 가중치는 상기 서버에 구비된 의료 진단 모델의 글로벌 매개 변수와 상기 서버가 상기 하나 이상의 임상 의사 결정 지원단말 장치로부터 수신한 로컬 매개 변수와의 거리에 기초하여 결정되는, 방법."}
{"patent_id": "10-2023-0016274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 16 항에 있어서, 상기 업데이트된 의료 진단 모델을 기초로 사용자로부터 수신한 증상 데이터에 대한 질병 종류를 예측하는단계; 및 약물 추천 모델에 예측된 질병 종류를 입력하여 추천 약물 데이터를 생성하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2023-0016274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 19항에 있어서, 상기 추천 약물 데이터를 생성하는 단계는의료 전문가로부터 상기 추천 약물 데이터에 포함된 하나 이상의 추천 약물 중 적어도 하나를 선택하는 입력을수신하며,선택 결과를 기초로 상기 약물 추천 모델을 학습하는, 방법."}
{"patent_id": "10-2023-0016274", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "임상 의사 결정 지원을 위한 서버 장치, 단말 장치 및 방법이 개시된다. 일 실시예에 따른 임상 의사 결정 지원 서버 장치는 하나 이상의 로컬 단말과 통신을 수행하는 통신부; 및 통신부와 연결된 제어부를 포함하며, 제어부 는 하나 이상의 로컬 단말로 의료 진단 모델을 전송하며, 하나 이상의 로컬 단말로부터 하나 이상의 로컬 단말 각각이 보유한 데이터 세트를 기초로 의료 진단 모델을 학습하여 생성한 로컬 매개 변수를 수신하며, 하나 이상 의 로컬 단말로부터 수신한 로컬 매개 변수 각각에 소정의 가중치를 부여 후 통합하여 의료 진단 모델을 업데이 트할 수 있다."}
{"patent_id": "10-2023-0016274", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "임상 의사 결정 지원을 위한 서버 장치, 단말 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2023-0016274", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 정보통신기술(ICT)은 도시 서비스의 확장성, 견고성 및 유연성을 제공하는 지속 가능한 도시 개발을 위한 여러 혁신에서 중요한 역할을 하고 있다. 빠르게 성장하는 현대 사회에 새로운 종류의 질병과 복잡한 증상이 발 병되면서 건강관리가 주요 문제가 되었다. 스마트 헬스케어 인프라를 구축하는 것은 시민들에게 더 나은 헬스케어 시설을 제공하기 위한 스마트시티의 궁 극적인 목표 중 하나다. 신경망 모델이 질병을 분류하고 환자에게 적절한 치료를 추천하는 데 인상적인 성능을 보여주므로, 인공지능(AI)의 최근 추세는 이 목표를 용이하게 한다. 일반적으로 신경망 훈련을 위해서는 풍부한 양의 데이터가 필요하지만 여러 다른 종류들로 이뤄진 임상 데이터 의 특성은 전통적인 중앙 집중 형식 네트워크에 대해 취약한 문제가 있다. 그리고, 잘 일반화된 의료 진단 모델 을 구현하기 위한 목적으로 민감한 임상 데이터를 한 곳에서 대량으로 수집하기는 어렵다. 또한 의료 데이터베 이스에 새로운 입력을 추가하려면 기존 모델을 처음부터 다시 교육해야 한다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허 제 10-2021-0120490 호"}
{"patent_id": "10-2023-0016274", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "임상 의사 결정 지원을 위한 서버 장치, 단말 장치 및 방법을 제공하는데 목적이 있다."}
{"patent_id": "10-2023-0016274", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 양상에 따르면, 임상 의사 결정 지원 서버 장치는 하나 이상의 로컬 단말과 통신을 수행하는 통신부; 및 통 신부와 연결된 제어부를 포함하며, 제어부는 하나 이상의 로컬 단말로 의료 진단 모델을 전송하며, 하나 이상의 로컬 단말로부터 하나 이상의 로컬 단말 각각이 보유한 데이터 세트를 기초로 의료 진단 모델을 학습하여 생성 한 로컬 매개 변수를 수신하며, 하나 이상의 로컬 단말로부터 수신한 로컬 매개 변수 각각에 소정의 가중치를 부여 후 통합하여 의료 진단 모델을 업데이트할 수 있다. 의료 진단 모델은 증상에 대한 데이터를 입력 받아 질병 종류에 대한 데이터를 출력하도록 학습되는 인공 신경 망일 수 있다. 소정의 가중치는 의료 진단 모델의 글로벌 매개 변수와 하나 이상의 로컬 단말로부터 수신한 로컬 매개 변수와 의 거리에 기초하여 결정될 수 있다. 제어부는 의료 진단 모델의 글로벌 매개 변수와 하나 이상의 로컬 단말로부터 수신한 로컬 매개 변수와의 각각 의 거리가 소정 임계치 이하가 될 때 까지 의료 진단 모델의 업데이트를 반복할 수 있다. 일 양상에 따르면, 임상 의사 결정 지원 단말 장치는 서버와 통신을 수행하는 통신부; 증상 및 질병 종류에 대 한 학습 데이터를 저장하는 데이터 베이스; 및 통신부 및 데이터 베이스와 연결된 제어부를 포함하며, 제어부는 서버로부터 의료 진단 모델을 수신하며, 데이터 베이스에 저장된 학습 데이터에 기초하여 의료 진단 모델을 학 습 시키며, 학습된 의료 진단 모델에 대한 로컬 매개 변수를 추출하여 서버로 전송할 수 있다. 제어부는 서버로 전송한 로컬 매개 변수에 대한 응답으로 서버로부터 업데이트된 의료 진단 모델을 수신할 수 있다. 업데이트된 의료 진단 모델은 서버가 하나 이상의 임상 의사 결정 지원 단말 장치로부터 수신한 로컬 매개 변수 에 소정 가중치를 부여하여 통합한 글로벌 매개 변수에 기초하여 생성될 수 있다.소정 가중치는 서버에 구비된 의료 진단 모델의 글로벌 매개 변수와 서버가 하나 이상의 임상 의사 결정 지원 단말 장치로부터 수신한 로컬 매개 변수와의 거리에 기초하여 결정될 수 있다. 제어부는 업데이트된 의료 진단 모델을 기초로 사용자로부터 수신한 증상 데이터에 대한 질병 종류를 예측하며, 약물 추천 모델에 예측된 질병 종류를 입력하여 추천 약물 데이터를 생성할 수 있다. 제어부는 의료 전문가로부터 추천 약물 데이터에 포함된 하나 이상의 추천 약물 중 적어도 하나를 선택하는 입 력을 수신하며, 선택 결과를 기초로 약물 추천 모델을 학습할 수 있다. 일 양상에 따르면, 하나 이상의 프로세서들, 및 하나 이상의 프로세서들에 의해 실행되는 하나 이상의 프로그램 들을 저장하는 메모리를 구비한 컴퓨팅 장치에서 수행되는 임상 의사 결정 지원 서버 장치의 동작 방법은 하나 이상의 로컬 단말로 의료 진단 모델을 전송하는 단계; 하나 이상의 로컬 단말로부터 하나 이상의 로컬 단말 각 각이 보유한 데이터 세트를 기초로 의료 진단 모델을 학습하여 생성한 로컬 매개 변수를 수신하는 단계; 및 하 나 이상의 로컬 단말로부터 수신한 로컬 매개 변수 각각에 소정의 가중치를 부여 후 통합하여 의료 진단 모델을 업데이트하는 단계를 포함할 수 있다. 의료 진단 모델을 업데이트하는 단계는 의료 진단 모델의 글로벌 매개 변수와 하나 이상의 로컬 단말로부터 수 신한 로컬 매개 변수와의 각각의 거리가 소정 임계치 이하가 될 때 까지 반복할 수 있다. 일 양상에 따르면, 하나 이상의 프로세서들, 및 하나 이상의 프로세서들에 의해 실행되는 하나 이상의 프로그램 들을 저장하는 메모리를 구비한 컴퓨팅 장치에서 수행되는 임상 의사 결정 지원 단말 장치의 동작 방법은 서버 로부터 의료 진단 모델을 수신하는 단계; 데이터 베이스에 저장된 학습 데이터에 기초하여 의료 진단 모델을 학 습 시키는 단계; 및 학습된 의료 진단 모델에 대한 로컬 매개 변수를 추출하여 서버로 전송하는 단계를 포함할 수 있다. 임상 의사 결정 지원 단말 장치의 동작 방법은 서버로 전송한 로컬 매개 변수에 대한 응답으로 서버로부터 업데 이트된 의료 진단 모델을 수신하는 단계를 더 포함할 수 있다. 임상 의사 결정 지원 단말 장치의 동작 방법은 업데이트된 의료 진단 모델을 기초로 사용자로부터 수신한 증상 데이터에 대한 질병 종류를 예측하는 단계; 및 약물 추천 모델에 예측된 질병 종류를 입력하여 추천 약물 데이 터를 생성하는 단계를 더 포함할 수 있다. 추천 약물 데이터를 생성하는 단계는 의료 전문가로부터 추천 약물 데이터에 포함된 하나 이상의 추천 약물 중 적어도 하나를 선택하는 입력을 수신하며, 선택 결과를 기초로 약물 추천 모델을 학습할 수 있다."}
{"patent_id": "10-2023-0016274", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "시퀀스 투 시퀀스 의료 진단 모델의 어텐션 메커니즘을 이용하여 의료 진단 모델을 처음부터 다시 훈련할 필요 없이 복잡한 증상을 가진 새로운 종류의 질병에 효과적으로 대응할 수 있다."}
{"patent_id": "10-2023-0016274", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 도면을 참조하여 본 발명의 구체적인 실시형태를 설명하기로 한다. 이하의 상세한 설명은 본 명세서에서 기술된 방법, 장치 및/또는 시스템에 대한 포괄적인 이해를 돕기 위해 제공된다. 그러나 이는 예시에 불과하며 본 발명은 이에 제한되지 않는다. 본 발명의 실시예들을 설명함에 있어서, 본 발명과 관련된 공지기술에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명을 생략하기로 한다. 그리고, 후술되는 용어들은 본 발명에서의 기능을 고려하여 정의된 용어들로서 이는 사용자, 운용자의 의도 또는 관례 등에 따라 달라질 수 있다. 그러므로 그 정의는 본 명세서 전반에 걸친 내용을 토대로 내려져야 할 것이다. 상세한 설명에서 사용되 는 용어는 단지 본 발명의 실시예들을 기술하기 위한 것이며, 결코 제한적이어서는 안 된다. 명확하게 달리 사 용되지 않는 한, 단수 형태의 표현은 복수 형태의 의미를 포함한다. 본 설명에서, \"포함\" 또는 \"구비\"와 같은 표현은 어떤 특성들, 숫자들, 단계들, 동작들, 요소들, 이들의 일부 또는 조합을 가리키기 위한 것이며, 기술된 것 이외에 하나 또는 그 이상의 다른 특성, 숫자, 단계, 동작, 요소, 이들의 일부 또는 조합의 존재 또는 가능 성을 배제하도록 해석되어서는 안 된다. 또한, 제1, 제2 등의 용어는 다양한 구성 요소들을 설명하는데 사용될 수 있지만, 구성 요소들은 용어들에 의해 한정되어서는 안 된다. 용어들은 하나의 구성 요소를 다른 구성 요소로부터 구별하는 목적으로 사용될 수 있다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제1 구성 요소는 제2 구성 요소로 명명될 수 있고, 유사 하게 제2 구성 요소도 제1 구성 요소로 명명될 수 있다. 도 1은 일 실시예에 따른 임상 의사 결정 지원 시스템의 동작 환경을 설명하기 위한 예시도이다. 도 1을 참조하면, 임상 의사 결정 지원 시스템은 임상 의사 결정 지원 서버 장치 및 하나 이상의 임 상 의사 결정 지원 단말 장치를 포함할 수 있다. 일 예로, 임상 의사 결정 지원 시스템은 지역 의료 전문가의 전자건강기록(Electronic Health Records, EHR)에서 이질적인 임상 데이터를 학습하는 데 서로 다른 의료 진단 모델이 공동으로 참여하는 개인화된 의료 아키텍처일 수 있다. 중앙 집중식 서버인 임상 의사 결정 지원 서버 장치의 글로벌 모델은 교육 프로세스 에 참여하지 않고 하나 이상의 임상 의사 결정 지원 단말 장치에 구비된 모든 로컬 모델의 공유된 지식을 캡처하고 교육 라운드를 모니터링할 수 있다. 하나 이상의 임상 의사 결정 지원 단말 장치에 구비된 각 로컬 모델은 의료 기록의 자체 개인 훈련 데이터 세트에서 자체 신경망을 훈련시킬 수 있다. 각 훈련된 모델은 관련 증상을 기반으로 질병을 분류하는 데 도움이 되도록 개별 의료 전문가의 개인 기기에 배치될 수 있다. 이러한 모델의 분류 출력은 의료 전문가들이 최종 결 과를 평가하기 위해 전문 지식을 바탕으로 분석할 수 있다. 임상 의사 결정 지원 단말 장치는 증상-질병 쌍의 평가 결과를 모델 보정을 위해 로컬 데이터 베이스에 저 장할 수 있다. 임상 의사 결정 지원 단말 장치의 로컬 모델은 교육 프로세스의 각 라운드 후에 모델 업데 이트를 중앙 서버인 임상 의사 결정 지원 서버 장치로 전송할 수 있다. 임상 의사 결정 지원 서버 장치 는 수집된 로컬 모델 업데이트를 집계하고 새 글로벌 모델을 만들 수 있다. 그런 다음 임상 의사 결정 지 원 서버 장치는 집계된 글로벌 모델을 배포하여 로컬 모델을 대체하고 성능을 업데이트할 수 있다. 도 2는 일 실시예에 따른 임상 의사 결정 지원 서버 장치의 구성도이다. 도 2를 참조하면, 임상 의사 결정 지원 서버 장치는 하나 이상의 로컬 단말과 통신을 수행하는 통신부 및 통신부와 연결된 제어부를 포함할 수 있다. 일 실시예에 따르면, 제어부는 하나 이상의 로컬 단말로 의료 진단 모델을 전송할 수 있다. 예를 들어, 연 합 통신 라운드 시작 시(t=0), 제어부는 처음에 가중치Wk에 의해 매개 변수화된 로컬 모델Mk로 의료 기관의 각 로컬 단말에서 사용될 기본 글로벌 모델 Mglobal을 배포할 수 있다. 일 실시예에 따르면, 제어부는 하나 이상의 로컬 단말로부터 하나 이상의 로컬 단말 각각이 보유한 데이터 세트를 기초로 의료 진단 모델을 학습하여 생성한 로컬 매개 변수를 수신할 수 있다. 일 예에 따르면, 하나 이상의 로컬 단말은 각각 의료 진단 모델을 학습시킬 수 있는 데이터 세트를 보유할 수 있다. 예를 들어, 로컬 단말에서 보유하고 있는 개인화된 증상 인식 지식 데이터 세트는 Dk={Xk,Yk}와 같이 나타 낼 수 있으며, Xk 는 입력 특징(즉, 증상)을 나타내고 Yk 는 관련 대상 레이블(즉, 질병)을 각각 나타낼 수 있다. 각 데이터 세트 Dk 는 로컬 모델 Mk : Xk →Yk를 훈련하는 데 사용될 수 있다. 각 로컬 모델에 대한 교육 절차는 아래 수학식 1과 같이 정의할 수 있다. [수학식 1]"}
{"patent_id": "10-2023-0016274", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기서, W'k 는 훈련 후 업데이트된 가중치를 나타내며 L(.)은 모델 구조 Mk, 훈련 데이터 Dk 및 로컬 가중치 매 개 변수 Wk 와 논쟁하는 각 로컬 모델의 일반적인 손실 함수를 나타낸다. 일 예에 따르면, 로컬 단말은 학습을 마친 후, 업데이트된 로컬 매개 변수 Wt+1k 를 임상 의사 결정 지원 서버 장 치로 전송할 수 있다. 일 실시예에 따르면, 제어부는 하나 이상의 로컬 단말로부터 수신한 로컬 매개 변수 각각에 소정의 가중치 를 부여 후 통합하여 의료 진단 모델을 업데이트할 수 있다. 일 예에 따르면, 제어부는 업데이트된 로컬 매개 변수를 수신하는 즉시 글로벌 모델의 매개 변수와 해당 로컬 모델 사이의 거리를 계산하여 로컬 모델의 주의 가중치(Attention Weight) αk를 측정할 수 있다. [수학식 2]"}
{"patent_id": "10-2023-0016274", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "일 예에 따르면, 제어부는 주의 메커니즘(Attention Mechanism)을 통해 로컬 매개 변수를 집계하여 최적화 프로세스를 수행하고 다음 통신 라운드 에 대한 글로벌 모델을 업데이트할 수 있다. 일 실시예에 따르면, 의료 진단 모델은 증상에 대한 데이터를 입력 받아 질병 종류에 대한 데이터를 출력하도록 학습되는 인공 신경망일 수 있다. 도 3은 일 실시예에 따른 의료 진단 모델을 설명하기 위한 예시도이다. 일 예로, 의료 진단 모델은 심층 반복 신경망(Deep RNN)으로 구성될 수 있다. 로컬 의료 진단 모델을 구성하는 동안 증상-질병 매핑을 위한 시퀀스 간 모델링을 처리할 수 있다. 여기서, 증상은 입력 시퀀스이며 질병은 출력 시퀀스로 처리된다. 각 매핑은 각각 인코더 네트워크와 디코더 네트워크에 대한 두 개의 RNN 모델로 구성될 수 있다. 의료 진단 모델은 인코더-디코더 네트워크에 어텐션 메커니즘을 적용함으로써, 입력 증상과 대상 질병 사이에 직접적인 단축키를 설정할 수 있다. 숨겨진 상태가 있는 인코더 네트워크는 입력 시퀀스 x를 처리하고 각 소스의 숨겨진 상태는 아래 수학식 3과 같이 정의될 수 있는 바다노의 가산 스타일(Bahdanau's additive styl e)의 점수 함수에 의해 현재 목표 숨겨진 상태와 비교될 수 있다. [수학식 3]"}
{"patent_id": "10-2023-0016274", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "여기서, W1, W2 및 va 는 가중치 행렬이다. 이후, 주의 가중치(Attention weight, 205) αts 는 아래 수학식 4와 같이 나타낼 수 있다. [수학식 4]"}
{"patent_id": "10-2023-0016274", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "계산된 주의 가중치를 기초로 컨텍스트 벡터(Context vector, 206) ct 로 알려진 입력 시퀀스의 더 작은 차원 표현이 소스 상태의 가중 평균으로 계산되고 아래 수학식 5와 같이 정의될 수 있다. [수학식 5]"}
{"patent_id": "10-2023-0016274", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "디코더 네트워크는 컨텍스트 벡터로 초기화되며 출력 시퀀스 y를 생성하도록 훈련될 수 있다. 컨텍스트 벡 터는 현재 대상의 숨겨진 상태와 연결되며 아래 수학식과 같이 어텐션 벡터(Attention vector, 207)를 산출할 수 있다. [수학식 6]"}
{"patent_id": "10-2023-0016274", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "최종 어텐션 벡터는 소프트맥스 로직과 손실을 도출하는 데 사용될 수 있다. 증상-질병 매핑 문제를 시퀀스 대 시퀀스 모델로 처리하고 주의 메커니즘을 적용함으로써, 의료 진단 모델은 훈련 데이터에 새로운 입력 기능이 추가될 때마다 처음부터 다시 훈련될 필요가 없다. 일 실시예에 따르면, 소정의 가중치는 의료 진단 모델의 글로벌 매개 변수와 하나 이상의 로컬 단말로부터 수신 한 로컬 매개 변수와의 거리에 기초하여 결정될 수 있다. 예를 들어, 위의 수학식 2와 같이 제어부는 업데 이트된 로컬 매개 변수를 수신하는 즉시 글로벌 모델의 매개 변수와 해당 로컬 모델 사이의 거리를 계산하여 로 컬 모델의 주의 가중치 αk를 측정할 수 있다. 일 실시예에 따르면, 제어부는 의료 진단 모델의 글로벌 매개 변수와 하나 이상의 로컬 단말로부터 수신한 로컬 매개 변수와의 각각의 거리가 소정 임계치 이하가 될 때 까지 의료 진단 모델의 업데이트를 반복할 수 있 다. 일 예로, 제어부는 글로벌 모델과 각 로컬 모델 사이의 가중 거리를 최소화하는 것을 목표로 동작할 수 있 으며, 글로벌 모델 성능이 수렴될 때까지 반복할 수 있다. 도 4는 임상 의사 결정 지원 단말 장치의 구성도이다. 도 4를 참조하면, 임상 의사 결정 지원 단말 장치는 서버와 통신을 수행하는 통신부, 증상 및 질병 종류에 대한 학습 데이터를 저장하는 데이터 베이스 및 통신부 및 데이터 베이스와 연결된 제어 부를 포함할 수 있다. 일 실시예에 따르면, 제어부는 서버로부터 의료 진단 모델을 수신할 수 있다. 예를 들어, 서버는 도 1 내 지 도 2에서 설명한 임상 의사 결정 지원 서버 장치일 수 있다. 일 예로, 제어부는 가중치Wk에 의해 매개 변수화된 로컬 모델 Mk로 의료 기관의 각 로컬 단말에서 사용될 기본 글로벌 모델Mglobal을 수신할 수 있다. 제어부는 글로벌 모델을 수신하여 자신의 로컬 모델을 사용할 수 있다. 일 실시예에 따르면, 제어부는 데이터 베이스에 저장된 학습 데이터에 기초하여 의료 진단 모델을 학습시 킬 수 있다. 일 예에 따르면, 제어부는 의료 진단 모델을 학습시킬 수 있는 데이터 세트를 보유할 수 있다. 예를 들어, 제어부에서 보유하고 있는 개인화된 증상 인식 지식 데이터 세트는 Dk={Xk,Yk}와 같이 나타낼 수 있으며, Xk 는 입력 특징(즉, 증상)을 나타내고 Yk 는 관련 대상 레이블(즉, 질병)을 각각 나타낼 수 있다. 각 데이터 세 트 Dk 는 로컬 모델 Mk : Xk →Yk를 훈련하는 데 사용될 수 있다. 각 로컬 모델에 대한 교육 절차는 위에서 설명 한 수학식 1과 같이 정의할 수 있다. 일 실시예에 따르면, 제어부는 학습된 의료 진단 모델에 대한 로컬 매개 변수를 추출하여 서버로 전송할 수 있다. 이후, 제어부는 서버로 전송한 로컬 매개 변수에 대한 응답으로 서버로부터 업데이트된 의료 진 단 모델을 수신할 수 있다. 일 예로, 업데이트된 의료 진단 모델은 서버가 하나 이상의 임상 의사 결정 지원 단말 장치로부터 수신한 로컬 매개 변수에 소정 가중치를 부여하여 통합한 글로벌 매개 변수에 기초하여 생성된 것일 수 있다. 이때, 소정 가 중치는 서버에 구비된 의료 진단 모델의 글로벌 매개 변수와 서버가 하나 이상의 임상 의사 결정 지원 단말 장 치로부터 수신한 로컬 매개 변수와의 거리에 기초하여 결정될 수 있다. 예를 들어, 소정의 가중치는 위의 수학 식 2에서 설명한 로컬 모델의 주의 가중치(Attention Weight) αk일 수 있다. 일 실시예에 따르면, 제어부는 업데이트된 의료 진단 모델을 기초로 사용자로부터 수신한 증상 데이터에 대한 질병 종류를 예측하며, 약물 추천 모델에 예측된 질병 종류를 입력하여 추천 약물 데이터를 생성할 수 있 다. 일 예로, 제어부는 의료 전문가가 환자의 질병 상태와 피드백을 분석해 다양한 질병에 대한 적절한 치료제 (의약품)를 추천할 수 있도록 지원할 수 있다. 질병 예측 모델의 최종 결과는 건강관리 로컬 데이터 베이스에 저장될 수 있다. 일 예에 따르면, 각 약물 권장 모델 Mdrugk 는 임상 의사 결정 지원 단말 장치에 배포되고 개인 데이터 세트 Ddrugk 로 임상 의사 결정 지원 단말 장치에서 훈련될 수 있다. 일 실시예에 따르면, 제어부는 의료 전문가로부터 추천 약물 데이터에 포함된 하나 이상의 추천 약물 중 적어도 하나를 선택하는 입력을 수신하며, 선택 결과를 기초로 약물 추천 모델을 학습할 수 있다. 예를 들어, 환자의 증상 및 질병 상태가 약물 권장 모델에 입력으로 전송되어 권장 약물 목록이 생성되고, 이후 해당 의료 전문가의 전문 지식에 의해 최종 결정될 수 있다. 이후, 권장 약물에 대한 환자 피드백은 더 나은 약물 권장 모 델의 추가 개선을 위해 로컬 데이터 베이스로 전송될 수 있다. 도 5는 임상 의사 결정 지원 서버 장치의 동작 방법을 설명하기 위한 흐름도이다. 일 예에 따르면, 의사 결정 지원 서버 장치는 하나 이상의 프로세서들, 및 하나 이상의 프로세서들에 의해 실행 되는 하나 이상의 프로그램들을 저장하는 메모리를 구비한 컴퓨팅 장치일 수 있다. 일 실시예에 따르면, 의사 결정 지원 서버 장치는 하나 이상의 로컬 단말로 의료 진단 모델을 전송할 수 있다 . 예를 들어, 의료 진단 모델은 증상에 대한 데이터를 입력 받아 질병 종류에 대한 데이터를 출력하도록 학습되는 인공 신경망일 수 있다. 일 실시예에 따르면, 의사 결정 지원 서버 장치는 하나 이상의 로컬 단말로부터 하나 이상의 로컬 단말 각각이 보유한 데이터 세트를 기초로 의료 진단 모델을 학습하여 생성한 로컬 매개 변수를 수신할 수 있다. 이후, 의사 결정 지원 서버 장치는 하나 이상의 로컬 단말로부터 수신한 로컬 매개 변수 각각에 소정의 가중치를 부여 후 통합하여 의료 진단 모델을 업데이트할 수 있다. 예를 들어, 소정의 가중치는 의료 진단 모델의 글로벌 매개 변수와 하나 이상의 로컬 단말로부터 수신한 로컬 매개 변수와의 거리에 기초하여 결정될 수 있다. 일 예에 따르면, 의사 결정 지원 서버 장치는 의료 진단 모델의 글로벌 매개 변수와 하나 이상의 로컬 단말로부 터 수신한 로컬 매개 변수와의 각각의 거리가 소정 임계치 이하가 될 때 까지 반복할 수 있다. 도 5의 실시예 중 도 1 내지 도 4를 참조하여 설명한 내용과 중복되는 내용은 생략하였다. 도 6은 임상 의사 결정 지원 단말 장치의 동작 방법을 설명하기 위한 흐름도이다. 일 예에 따르면, 임상 의사 결정 지원 단말 장치는 하나 이상의 프로세서들, 및 하나 이상의 프로세서들에 의해 실행되는 하나 이상의 프로그램들을 저장하는 메모리를 구비한 컴퓨팅 장치일 수 있다. 일 실시예에 따르면, 임상 의사 결정 지원 단말 장치는 서버로부터 의료 진단 모델을 수신할 수 있다. 예 를 들어, 의료 진단 모델은 증상에 대한 데이터를 입력 받아 질병 종류에 대한 데이터를 출력하도록 학습되는 인공 신경망일 수 있다. 일 실시예에 따르면, 임상 의사 결정 지원 단말 장치는 데이터 베이스에 저장된 학습 데이터에 기초하여 의료 진단 모델을 학습 시킬 수 있다. 일 예에 따르면, 임상 의사 결정 지원 단말 장치는 의료 진단 모델을 학습시킬 수 있는 데이터 세트를 보유할 수 있다. 예를 들어, 임상 의사 결정 지원 단말 장치에서 보유하고 있는 개인화된 증상 인식 지식 데이터 세트 는 Dk={Xk,Yk}와 같이 나타낼 수 있으며, Xk 는 입력 특징(즉, 증상)을 나타내고 Yk 는 관련 대상 레이블(즉, 질 병)을 각각 나타낼 수 있다. 각 데이터 세트 Dk 는 로컬 모델 Mk : Xk →Yk를 훈련하는 데 사용될 수 있다. 각 로컬 모델에 대한 교육 절차는 위에서 설명한 수학식 1과 같이 정의할 수 있다. 일 실시예에 따르면, 임상 의사 결정 지원 단말 장치는 학습된 의료 진단 모델에 대한 로컬 매개 변수를 추출하 여 서버로 전송할 수 있다. 이후, 임상 의사 결정 지원 단말 장치는 서버로 전송한 로컬 매개 변수에 대한 응답으로 서버로부터 업데이트된 의료 진단 모델을 수신할 수 있다. 이때, 업데이트된 의료 진단 모델은 서버가 하나 이상의 임상 의사 결정 지원 단말 장치로부터 수신한 로컬 매개 변수에 소정 가중치를 부여하여 통합한 글 로벌 매개 변수에 기초하여 생성된 것일 수 있다. 일 예로, 소정 가중치는 서버에 구비된 의료 진단 모델의 글로벌 매개 변수와 서버가 하나 이상의 임상 의사 결 정 지원 단말 장치로부터 수신한 로컬 매개 변수와의 거리에 기초하여 결정될 수 있다. 일 실시예에 따르면, 임상 의사 결정 지원 단말 장치는 업데이트된 의료 진단 모델을 기초로 사용자로부터 수신 한 증상 데이터에 대한 질병 종류를 예측할 수 있으며, 약물 추천 모델에 예측된 질병 종류를 입력하여 추천 약 물 데이터를 생성할 수 있다. 도 6의 실시예 중 도 1 내지 도 4를 참조하여 설명한 내용과 중복되는 내용은 생략하였다. 도 7은 예시적인 실시예들에서 사용되기에 적합한 컴퓨팅 장치를 포함하는 컴퓨팅 환경을 예시하여 설명하 기 위한 블록도이다. 도시된 실시예에서, 각 컴포넌트들은 이하에 기술된 것 이외에 상이한 기능 및 능력을 가 질 수 있고, 이하에 기술된 것 이외에도 추가적인 컴포넌트를 포함할 수 있다. 도시된 컴퓨팅 환경은 컴퓨팅 장치를 포함한다. 일 실시예에서, 컴퓨팅 장치는 임상 의사 결정 지 원 서버 장치 또는 임상 의사 결정 지원 단말 장치일 수 있다. 컴퓨팅 장치는 적어도 하나의 프로세서, 컴퓨터 판독 가능 저장 매체 및 통신 버스를 포함한다. 프로세서는 컴퓨팅 장치로 하여금 앞서 언급된 예시적인 실시예에 따라 동작하도록 할 수 있 다. 예컨대, 프로세서는 컴퓨터 판독 가능 저장 매체에 저장된 하나 이상의 프로그램들을 실행할 수 있 다. 하나 이상의 프로그램들은 하나 이상의 컴퓨터 실행 가능 명령어를 포함할 수 있으며, 컴퓨터 실행 가능 명 령어는 프로세서에 의해 실행되는 경우 컴퓨팅 장치로 하여금 예시적인 실시예에 따른 동작들을 수행하 도록 구성될 수 있다. 컴퓨터 판독 가능 저장 매체는 컴퓨터 실행 가능 명령어 내지 프로그램 코드, 프로그램 데이터 및/또는 다 른 적합한 형태의 정보를 저장하도록 구성된다. 컴퓨터 판독 가능 저장 매체에 저장된 프로그램은 프로 세서에 의해 실행 가능한 명령어의 집합을 포함한다. 일 실시예에서, 컴퓨터 판독 가능 저장 매체는 메 모리(랜덤 액세스 메모리와 같은 휘발성 메모리, 비휘발성 메모리, 또는 이들의 적절한 조합), 하나 이상의 자 기 디스크 저장 디바이스들, 광학 디스크 저장 디바이스들, 플래시 메모리 디바이스들, 그 밖에 컴퓨팅 장치 에 의해 액세스되고 원하는 정보를 저장할 수 있는 다른 형태의 저장 매체, 또는 이들의 적합한 조합일 수 있다. 통신 버스는 프로세서, 컴퓨터 판독 가능 저장 매체를 포함하여 컴퓨팅 장치의 다른 다양한 컴 포넌트들을 상호 연결한다. 컴퓨팅 장치는 또한 하나 이상의 입출력 장치를 위한 인터페이스를 제공하는 하나 이상의 입출력 인터 페이스 및 하나 이상의 네트워크 통신 인터페이스를 포함할 수 있다. 입출력 인터페이스 및 네트워 크 통신 인터페이스는 통신 버스에 연결된다. 입출력 장치는 입출력 인터페이스를 통해 컴퓨팅 장치의 다른 컴포넌트들에 연결될 수 있다. 예시적인 입출력 장치는 포인팅 장치(마우스 또는 트랙패드등), 키보드, 터치 입력 장치(터치패드 또는 터치스크린 등), 음성 또는 소리 입력 장치, 다양한 종류의 센서 장치 및/또는 촬영 장치와 같은 입력 장치, 및/또는 디스플레이 장치, 프린터, 스피커 및/또는 네트워크 카드와 같은 출력 장치를 포함할 수 있다. 예시적인 입출력 장치는 컴퓨팅 장치를 구성하는 일 컴포넌트로서 컴퓨팅 장치의 내부에 포함될 수도 있고, 컴퓨팅 장치와는 구별되는 별개의 장치로 컴퓨팅 장치와 연결될 수도 있다."}
{"patent_id": "10-2023-0016274", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "이상에서 본 발명의 대표적인 실시예들을 상세하게 설명하였으나, 본 발명이 속하는 기술분야에서 통상의 지식 을 가진 자는 상술한 실시예에 대하여 본 발명의 범주에서 벗어나지 않는 한도 내에서 다양한 변형이 가능함을 이해할 것이다. 그러므로 본 발명의 권리범위는 설명된 실시예에 국한되어 정해져서는 안 되며, 후술하는 특허 청구범위뿐만 아니라 이 특허청구범위와 균등한 것들에 의해 정해져야 한다."}
{"patent_id": "10-2023-0016274", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 따른 임상 의사 결정 지원 시스템의 동작 환경을 설명하기 위한 예시도이다. 도 2는 일 실시예에 따른 임상 의사 결정 지원 서버 장치의 구성도이다. 도 3은 일 실시예에 따른 의료 진단 모델을 설명하기 위한 예시도이다. 도 4는 임상 의사 결정 지원 단말 장치의 구성도이다. 도 5는 임상 의사 결정 지원 서버 장치의 동작 방법을 설명하기 위한 흐름도이다. 도 6은 임상 의사 결정 지원 단말 장치의 동작 방법을 설명하기 위한 흐름도이다. 도 7은 예시적인 실시예들에서 사용되기에 적합한 컴퓨팅 장치를 포함하는 컴퓨팅 환경을 예시하여 설명하기 위 한 블록도이다."}
