{"patent_id": "10-2023-0038627", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0143396", "출원번호": "10-2023-0038627", "발명의 명칭": "데이터에 기반하여 엔티티를 선택하기 위한 방법 및 장치", "출원인": "삼성전자주식회사", "발명자": "김복근"}}
{"patent_id": "10-2023-0038627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "제1 NF(network function)에 의해 수행되는 방법에 있어서,제1 시간 구간에서 복수의 제2 NF들의 각 NF의 부하를 나타내기 위한 부하 정보를 획득하는 동작;복수의 시간 구간들 중에서 기준 시점(timing) 이전의 제1 세트의 부하 정보에 기반하여, 제1 부하 값을 식별하는 동작;상기 복수의 시간 구간들 중에서 상기 기준 시점 이후의 제2 세트의 부하 정보에 기반하여 식별된 제2 부하 값및 상기 제1 부하 값 사이의 차이가 임계값 이상인지 여부를 식별하는 동작;상기 차이가 상기 임계값 이상인 경우, 상기 부하 정보에 기반하여 상기 복수의 제2 NF들 중에서 제2 NF를 선택하는 동작; 상기 차이가 임계값 미만인 경우, 상기 제1 시간 구간 다음의 제2 시간 구간에서, 상기 복수의 제2 NF들의 각NF의 부하를 나타내기 위한 예측 부하 정보를 획득하는 동작; 및상기 부하 정보 및 상기 예측 부하 정보에 기반하여 상기 복수의 제2 NF들 중에서 상기 제2 NF를 선택하는 동작을 포함하고,상기 예측 부하 정보는, 상기 부하 정보에 기반하여 인공 지능 모델(artificial intelligence model, AImodel)을 이용하여 획득되는, 방법."}
{"patent_id": "10-2023-0038627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 방법은,상기 임계값 미만인 상기 차이의 크기에 기반하여, 상기 부하 정보와 상기 예측 부하 정보 사이의 적용 비율(ratio)을 식별하는 동작;상기 부하 정보, 상기 예측 부하 정보, 및 상기 적용 비율에 기반하여, 상기 복수의 제2 NF들의 각 NF의 부하를식별하는 동작을 포함하는, 방법."}
{"patent_id": "10-2023-0038627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서,상기 방법은,상기 임계값 미만인 상기 차이가 제1 값을 갖는 경우, 상기 적용 비율을 제1 비율 값으로 식별하는 동작;상기 임계값 미만인 상기 차이가 상기 제1 값보다 작은 제2 값을 갖는 경우, 상기 적용 비율을 상기 제1 비율값보다 큰 제2 비율 값으로 식별하는 동작을 포함하고,상기 적용 비율은, 상기 복수의 제2 NF들의 각 NF의 부하를 식별함에 있어 이용되는 상기 예측 부하 정보의 비율인,공개특허 10-2024-0143396-3-방법."}
{"patent_id": "10-2023-0038627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 2에 있어서,상기 방법은,상기 부하 정보가 포함하는 제1 파라미터들 및 상기 제1 파라미터들 사이의 비율에 기반하여, 제1 부하 가중치를 식별하는 동작; 및상기 예측 부하 정보가 포함하는 제2 파라미터들 및 상기 제2 파라미터들 사이의 비율에 기반하여, 제2 부하 가중치를 식별하는 동작을 포함하고,상기 복수의 제2 NF들의 각 NF의 부하는, 상기 제1 부하 가중치, 상기 제2 부하 가중치, 및 상기 적용 비율에기반하여 식별되는,방법."}
{"patent_id": "10-2023-0038627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 4에 있어서,상기 제1 파라미터들 또는 상기 제2 파라미터들은, 상기 복수의 제2 NF들 각각이 제공하는 서비스와 관련된 요소(factor), 사용자 평면(user plane) 요소, 또는 제어 평면(control plane) 요소 중 적어도 하나를 포함하고,상기 서비스와 관련된 요소는:상기 복수의 제2 NF들 각각과 관련된 단말(user equipment)의 수, PDU(protocol data unit) 세션(session)의 수, 또는 QoS(quality of service) 플로우(flow)의 수, 및 상기 복수의 제2 NF들 각각의 CPU(central processing unit), 메모리(memory), 또는 디스크(disk)의부하를 나타내는 정보를 포함하는,방법."}
{"patent_id": "10-2023-0038627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 5에 있어서,상기 사용자 평면 요소는, 트래픽(traffic), 패킷 드랍률(packet drop rate), 또는 IP(internet protocol) 풀(pool) 사용량을 포함하고,상기 제어 평면 요소는, TPS(transaction per second), 또는 호(call)에 대한 정보를 포함하는,방법."}
{"patent_id": "10-2023-0038627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 1에 있어서,상기 인공 지능 모델은 RNN(recurrent neural network)를 포함하고,상기 인공 지능 모델은, 지정된 기간 동안의 부하 정보 중 제1 부분에 기반하여 학습되고,상기 복수의 시간 구간들과 관련된 상기 제1 세트의 부하 정보 및 상기 제2 세트의 부하 정보는, 상기 지정된기간 동안의 부하 정보 중 상기 제1 부분과 다른 제2 부분에 포함되는,공개특허 10-2024-0143396-4-방법."}
{"patent_id": "10-2023-0038627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 7에 있어서,상기 인공 지능 모델은, 복수의 인공 지능 모델들에 포함되고,상기 복수의 인공 지능 모델들 각각은, 상기 제1 부분에 기반하여 학습되고,상기 인공 지능 모델은, 상기 복수의 인공 지능 모델들 중 상기 차이가 가장 작은 값을 갖는 모델인,방법."}
{"patent_id": "10-2023-0038627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 1에 있어서,상기 제1 NF는, SMF(session management function)를 포함하고,상기 복수의 제2 NF들은, 복수의 UPF(user plane function)들을 포함하는,방법."}
{"patent_id": "10-2023-0038627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 1에 있어서,상기 제1 부하 값은, 상기 제1 세트의 부하 정보에 기반하여, 상기 인공 지능 모델을 이용하여 예측되는 값인, 방법."}
{"patent_id": "10-2023-0038627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1 NF(network function)를 위한 장치에 있어서,송수신기(transceiver); 및상기 송수신기와 동작적으로 결합된 프로세서(processor)를 포함하고,상기 프로세서는:제1 시간 구간에서 복수의 제2 NF들의 각 NF의 부하를 나타내기 위한 부하 정보를 획득하고;복수의 시간 구간들 중에서 기준 시점(timing) 이전의 제1 세트의 부하 정보에 기반하여, 제1 부하 값을 식별하고;상기 복수의 시간 구간들 중에서 상기 기준 시점 이후의 제2 세트의 부하 정보에 기반하여 식별된 제2 부하 값및 상기 제1 부하 값 사이의 차이가 임계값 이상인지 여부를 식별하고;상기 차이가 상기 임계값 이상인 경우, 상기 부하 정보에 기반하여 상기 복수의 제2 NF들 중에서 제2 NF를 선택하고;상기 차이가 임계값 미만인 경우, 상기 제1 시간 구간 다음의 제2 시간 구간에서, 상기 복수의 제2 NF들의 각NF의 부하를 나타내기 위한 예측 부하 정보를 획득하고; 및상기 부하 정보 및 상기 예측 부하 정보에 기반하여 상기 복수의 제2 NF들 중에서 상기 제2 NF를 선택하도록,구성되고,공개특허 10-2024-0143396-5-상기 예측 부하 정보는, 상기 부하 정보에 기반하여 인공 지능 모델(artificial intelligence model, AImodel)을 이용하여 획득되는, 장치."}
{"patent_id": "10-2023-0038627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 11에 있어서,상기 프로세서는:상기 임계값 미만인 상기 차이의 크기에 기반하여, 상기 부하 정보와 상기 예측 부하 정보 사이의 적용 비율(ratio)을 식별하고; 및상기 부하 정보, 상기 예측 부하 정보, 및 상기 적용 비율에 기반하여, 상기 복수의 제2 NF들의 각 NF의 부하를식별하도록, 구성되는, 장치."}
{"patent_id": "10-2023-0038627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 12에 있어서,상기 프로세서는:상기 임계값 미만인 상기 차이가 제1 값을 갖는 경우, 상기 적용 비율을 제1 비율 값으로 식별하고;상기 임계값 미만인 상기 차이가 상기 제1 값보다 작은 제2 값을 갖는 경우, 상기 적용 비율을 상기 제1 비율값보다 큰 제2 비율 값으로 식별하도록, 구성되고,상기 적용 비율은, 상기 복수의 제2 NF들의 각 NF의 부하를 식별함에 있어 이용되는 상기 예측 부하 정보의 비율인,장치."}
{"patent_id": "10-2023-0038627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 12에 있어서,상기 프로세서는:상기 부하 정보가 포함하는 제1 파라미터들 및 상기 제1 파라미터들 사이의 비율에 기반하여, 제1 부하 가중치를 식별하고; 및상기 예측 부하 정보가 포함하는 제2 파라미터들 및 상기 제2 파라미터들 사이의 비율에 기반하여, 제2 부하 가중치를 식별하도록, 구성되고,상기 복수의 제2 NF들의 각 NF의 부하는, 상기 제1 부하 가중치, 상기 제2 부하 가중치, 및 상기 적용 비율에기반하여 식별되는,장치."}
{"patent_id": "10-2023-0038627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "청구항 14에 있어서,상기 제1 파라미터들 또는 상기 제2 파라미터들은, 상기 복수의 제2 NF들 각각이 제공하는 서비스와 관련된 요공개특허 10-2024-0143396-6-소(factor), 사용자 평면(user plane) 요소, 또는 제어 평면(control plane) 요소 중 적어도 하나를 포함하고,상기 서비스와 관련된 요소는:상기 복수의 제2 NF들 각각과 관련된 단말(user equipment)의 수, PDU(protocol data unit) 세션(session)의 수, 또는 QoS(quality of service) 플로우(flow)의 수, 및 상기 복수의 제2 NF들 각각의 CPU(central processing unit), 메모리(memory), 또는 디스크(disk)의부하를 나타내는 정보를 포함하는,장치."}
{"patent_id": "10-2023-0038627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "청구항 15에 있어서,상기 사용자 평면 요소는, 트래픽(traffic), 패킷 드랍률(packet drop rate), 또는 IP(internet protocol) 풀(pool) 사용량을 포함하고,상기 제어 평면 요소는, TPS(transaction per second), 또는 호(call)에 대한 정보를 포함하는,장치."}
{"patent_id": "10-2023-0038627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "청구항 11에 있어서,상기 인공 지능 모델은 RNN(recurrent neural network)를 포함하고,상기 인공 지능 모델은, 지정된 기간 동안의 부하 정보 중 제1 부분에 기반하여 학습되고,상기 복수의 시간 구간들과 관련된 상기 제1 세트의 부하 정보 및 상기 제2 세트의 부하 정보는, 상기 지정된기간 동안의 부하 정보 중 상기 제1 부분과 다른 제2 부분에 포함되는,장치."}
{"patent_id": "10-2023-0038627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "청구항 17에 있어서,상기 인공 지능 모델은, 복수의 인공 지능 모델들에 포함되고,상기 복수의 인공 지능 모델들 각각은, 상기 제1 부분에 기반하여 학습되고,상기 인공 지능 모델은, 상기 복수의 인공 지능 모델들 중 상기 차이가 가장 작은 값을 갖는 모델인,장치."}
{"patent_id": "10-2023-0038627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "청구항 11에 있어서,상기 제1 NF는, SMF(session management function)를 포함하고,상기 복수의 제2 NF들은, 복수의 UPF(user plane function)들을 포함하는,장치.공개특허 10-2024-0143396-7-청구항 20 NWDAF(network data analytics function)에 의해 수행되는 방법에 있어서,제1 NF로부터, 복수의 제2 NF들 중에서 제2 NF의 선택(selection)을 위한 요청 메시지를 수신하는 동작;제1 시간 구간에서 상기 복수의 제2 NF들의 각 NF의 부하를 나타내기 위한 부하 정보를 획득하는 동작;복수의 시간 구간들 중에서 기준 시점(timing) 이전의 제1 세트의 부하 정보에 기반하여, 제1 부하 값을 식별하는 동작;상기 복수의 시간 구간들 중에서 상기 기준 시점 이후의 제2 세트의 부하 정보에 기반하여 식별된 제2 부하 값및 상기 제1 부하 값 사이의 차이가 임계값 이상인지 여부를 식별하는 동작;상기 차이가 상기 임계값 이상인 경우, 상기 부하 정보를 포함하는 응답 메시지를 생성하는 동작;상기 차이가 임계값 미만인 경우, 상기 제1 시간 구간 다음의 제2 시간 구간에서, 상기 복수의 제2 NF들의 각NF의 부하를 나타내기 위한 예측 부하 정보 및 상기 부하 정보를 포함하는 상기 응답 메시지를 생성하는 동작을포함하고, 및상기 응답 메시지를, 상기 제1 NF에게 전송하는 동작을 포함하고,상기 예측 부하 정보는, 상기 부하 정보에 기반하여 인공 지능 모델(artificial intelligence model, AImodel)을 이용하여 획득되는, 방법."}
{"patent_id": "10-2023-0038627", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "실시예들에 있어서, 제1 NF(network function)에 의해 수행되는 방법은, 제1 시간 구간에서 복수의 제2 NF들의 각 NF의 부하를 나타내기 위한 부하 정보를 획득하는 동작을 포함할 수 있다. 상기 방법은, 복수의 시간 구간들 중에서 기준 시점(timing) 이전의 제1 세트의 부하 정보에 기반하여, 제1 부하 값을 식별하는 동작을 포함할 수 (뒷면에 계속)"}
{"patent_id": "10-2023-0038627", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "아래의 설명들은, 데이터(data)에 기반하여 엔티티(entity)를 선택하기 위한 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2023-0038627", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "통신 시스템에서, 코어 네트워크(core network)(또는 코어 망)는, 복수의 엔티티(entity)들을 포함할 수 있다. 예를 들어, 상기 복수의 엔티티들은 NF(network function)들을 포함할 수 있다. 상기 복수의 엔티티들 중 일부 엔티티들은, 서비스를 제공하기 위하여, 다른 엔티티들을 선택할 수 있다."}
{"patent_id": "10-2023-0038627", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "실시예들에 있어서, 제1 NF(network function)에 의해 수행되는 방법은, 제1 시간 구간에서 복수의 제2 NF들의 각 NF의 부하를 나타내기 위한 부하 정보를 획득하는 동작을 포함할 수 있다. 상기 방법은, 복수의 시간 구간들 중에서 기준 시점(timing) 이전의 제1 세트의 부하 정보에 기반하여, 제1 부하 값을 식별하는 동작을 포함할 수 있다. 상기 방법은, 상기 복수의 시간 구간들 중에서 상기 기준 시점 이후의 제2 세트의 부하 정보에 기반하여 식별된 제2 부하 값 및 상기 제1 부하 값 사이의 차이가 임계값 이상인지 여부를 식별하는 동작을 포함할 수 있 다. 상기 방법은, 상기 차이가 상기 임계값 이상인 경우, 상기 부하 정보에 기반하여 상기 복수의 제2 NF들 중 에서 제2 NF를 선택하는 동작을 포함할 수 있다. 상기 방법은, 상기 차이가 임계값 미만인 경우, 상기 제1 시간 구간 다음의 제2 시간 구간에서, 상기 복수의 제2 NF들의 각 NF의 부하를 나타내기 위한 예측 부하 정보를 획득 하는 동작을 포함할 수 있다. 상기 방법은, 상기 부하 정보 및 상기 예측 부하 정보에 기반하여 상기 복수의 제 2 NF들 중에서 상기 제2 NF를 선택하는 동작을 포함할 수 있다. 상기 예측 부하 정보는, 상기 부하 정보에 기반 하여 인공 지능 모델(artificial intelligence model, AI model)을 이용하여 획득될 수 있다. 실시예들에 있어서, 제1 NF(network function)를 위한 장치는, 송수신기(transceiver)를 포함할 수 있다. 상기 장치는, 상기 송수신기와 동작적으로 결합된 프로세서(processor)를 포함할 수 있다. 상기 프로세서는, 제1 시간 구간에서 복수의 제2 NF들의 각 NF의 부하를 나타내기 위한 부하 정보를 획득하도록 구성될 수 있다. 상기 프로세서는, 복수의 시간 구간들 중에서 기준 시점(timing) 이전의 제1 세트의 부하 정보에 기반하여, 제1 부하 값을 식별하도록 구성될 수 있다. 상기 프로세서는, 상기 복수의 시간 구간들 중에서 상기 기준 시점 이후의 제 2 세트의 부하 정보에 기반하여 식별된 제2 부하 값 및 상기 제1 부하 값 사이의 차이가 임계값 이상인지 여부 를 식별하도록 구성될 수 있다. 상기 프로세서는, 상기 차이가 상기 임계값 이상인 경우, 상기 부하 정보에 기 반하여 상기 복수의 제2 NF들 중에서 제2 NF를 선택하도록 구성될 수 있다. 상기 프로세서는, 상기 차이가 임계 값 미만인 경우, 상기 제1 시간 구간 다음의 제2 시간 구간에서, 상기 복수의 제2 NF들의 각 NF의 부하를 나타 내기 위한 예측 부하 정보를 획득하도록 구성될 수 있다. 상기 프로세서는, 상기 부하 정보 및 상기 예측 부하 정보에 기반하여 상기 복수의 제2 NF들 중에서 상기 제2 NF를 선택하도록, 구성될 수 있다. 상기 예측 부하 정 보는, 상기 부하 정보에 기반하여 인공 지능 모델(artificial intelligence model, AI model)을 이용하여 획득 될 수 있다. 실시예들에 있어서, NWDAF(network data analytics function)에 의해 수행되는 방법은, 제1 NF로부터, 복수의 제2 NF들 중에서 제2 NF의 선택(selection)을 위한 요청 메시지를 수신하는 동작을 포함할 수 있다. 상기 방법 은, 제1 시간 구간에서 상기 복수의 제2 NF들의 각 NF의 부하를 나타내기 위한 부하 정보를 획득하는 동작을 포 함할 수 있다. 상기 방법은, 복수의 시간 구간들 중에서 기준 시점(timing) 이전의 제1 세트의 부하 정보에 기 반하여, 제1 부하 값을 식별하는 동작을 포함할 수 있다. 상기 방법은, 상기 복수의 시간 구간들 중에서 상기 기준 시점 이후의 제2 세트의 부하 정보에 기반하여 식별된 제2 부하 값 및 상기 제1 부하 값 사이의 차이가 임 계값 이상인지 여부를 식별하는 동작을 포함할 수 있다. 상기 방법은, 상기 차이가 상기 임계값 이상인 경우, 상기 부하 정보를 포함하는 응답 메시지를 생성하는 동작을 포함할 수 있다. 상기 방법은, 상기 차이가 임계값 미만인 경우, 상기 제1 시간 구간 다음의 제2 시간 구간에서, 상기 복수의 제2 NF들의 각 NF의 부하를 나타내기 위한 예측 부하 정보 및 상기 부하 정보를 포함하는 상기 응답 메시지를 생성하는 동작을 포함할 수 있다. 상기 응답 메시지를, 상기 제1 NF에게 전송하는 동작을 포함할 수 있다. 상기 예측 부하 정보는, 상기 부하 정보에 기반하여 인공 지능 모델(artificial intelligence model, AI model)을 이용하여 획득될 수 있다."}
{"patent_id": "10-2023-0038627", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시에서 사용되는 용어들은 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 다른 실시예의 범위를 한 정하려는 의도가 아닐 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 용어들은 본 개시에 기재된 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가질 수 있다. 본 개시에 사용된 용어 들 중 일반적인 사전에 정의된 용어들은, 관련 기술의 문맥상 가지는 의미와 동일 또는 유사한 의미로 해석될 수 있으며, 본 개시에서 명백하게 정의되지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 경우에 따라서, 본 개시에서 정의된 용어일지라도 본 개시의 실시예들을 배제하도록 해석될 수 없다. 이하에서 설명되는 본 개시의 다양한 실시예들에서는 하드웨어적인 접근 방법을 예시로서 설명한다. 하지만, 본 개시의 다양한 실시예들에서는 하드웨어와 소프트웨어를 모두 사용하는 기술을 포함하고 있으므로, 본 개시의 다양한 실시예들이 소프트웨어 기반의 접근 방법을 제외하는 것은 아니다. 이하 설명에서 사용되는 신호를 지칭하는 용어(예: 신호, 정보, 메시지, 시그널링, 데이터(data))), 연산 상태 를 위한 용어(예: 단계(step), 동작(operation), 절차(procedure)), 데이터를 지칭하는 용어(예: 패킷, 사용자 스트림, 정보(information), 비트(bit), 심볼(symbol), 코드워드(codeword)), 전자 장치의 구성 요소를 지칭하 는 용어 등은 설명의 편의를 위해 예시된 것이다. 따라서, 본 개시가 후술되는 용어들에 한정되는 것은 아니며, 동등한 기술적 의미를 가지는 다른 용어가 사용될 수 있다. 또한, 본 개시에서, 특정 조건의 만족(satisfied), 충족(fulfilled) 여부를 판단하기 위해, 초과 또는 미만의 표현이 사용될 수 있으나, 이는 일 예를 표현하기 위한 기재일 뿐 이상 또는 이하의 기재를 배제하는 것이 아니 다. '이상'으로 기재된 조건은 '초과', '이하'로 기재된 조건은 '미만', '이상 및 미만'으로 기재된 조건은 '초 과 및 이하'로 대체될 수 있다. 또한, 이하, 'A' 내지 'B'는 A부터(A 포함) B까지의(B 포함) 요소들 중 적어도 하나를 의미한다. 이하, 'C' 및/또는 'D'는 'C' 또는 'D' 중 적어도 하나, 즉, {'C', 'D', 'C'와 'D'}를 포함 하는 것을 의미한다. 본 개시는, 일부 통신 규격 (예: 3GPP(3rd Generation Partnership Project))에서 사용되는 용어들을 이용하여 실시예들을 설명하지만, 이는 설명을 위한 예시일 뿐이다. 본 개시의 실시예들은, 다른 통신 및 방송 시스템에 도 적용될 수 있다. 도 1은 통신 시스템의 예를 도시한다. 도 1을 참고하면, 통신 시스템은 무선 접속 망(radio access network, RAN) 및 코어 망(core network, CN)을 포함할 수 있다. 무선 접속 망은 단말과 직접 연결되는 네트워크로서, 단말에게 무선 접속을 제공하는 인프라스 트럭쳐(infrastructure)이다. 무선 접속 망은 기지국을 포함하는 복수의 기지국들의 집합을 포함하며, 복수의 기지국들은 상호 간 형성된 인터페이스를 통해 통신을 수행할 수 있다. 복수의 기지국들 간 인터페이스들 중 적어도 일부는 유선이거나 무선일 수 있다. 기지국은 CU(central unit) 및 DU(distributed unit)으로 분리된 구조를 가질 수 있다. 이 경우, 하나의 CU가 복수의 DU들을 제어할 수 있다. 기지국은 기지국(base station) 외에 '액세스 포인트(access point, AP)', 'gNB(next generation node B)', '5G 노드(5th generation node)', '무선 포인트(wireless point)', '송 수신 포인트(transmission/reception point, TRP)', 또는 이와 동등한 기술적 의미를 가지는 다른 용어로 지칭 될 수 있다. 단말은 무선 접속 망에 접속하고, 기지국과 무선 채널을 통해 통신을 수행한다. 단 말은 단말(terminal) 외 '사용자 장비(user equipment, UE)', '이동국(mobile station)', '가입자국 (subscriber station)', '원격 단말(remote terminal)', '무선 단말(wireless terminal)', 또는 '사용자 장치 (user device)' 또는 이와 동등한 기술적 의미를 가지는 다른 용어로 지칭될 수 있다. 코어 망은 전체 시스템을 관리하는 네트워크로서, 무선 접속 망을 제어하고, 무선 접속 망을 통 해 송수신되는 단말에 대한 데이터 및 제어 신호들을 처리할 수 있다. 코어 망은 사용자 평면(user plane) 및 제어 평면(control plane)의 제어, 이동성(mobility)의 처리, 가입자 정보의 관리, 과금, 다른 종류 의 시스템(예: LTE(long term evolution) 시스템)과의 연동 등 다양한 기능들을 수행할 수 있다. 상술한 다양한 기능들을 수행하기 위해, 코어 망은 서로 다른 NF(network function)들을 가진 기능적으로 분리된 다수의 엔티티(entity)들을 포함할 수 있다. 상기 엔티티는, NF 또는 노드(node)로 참조될 수 있다. 예 를 들어, 코어 망은 AMF(access and mobility management function)(130a), SMF(session management function)(130b), UPF(user plane function)(130c), PCF(policy and charging function)(130d), NRF(network repository function)(130e), UDM(user data management)(130f), NEF(network exposure function)(130g), UDR(unified data repository)(130h), 또는 NWDAF(network data analytics function)(130i)을 포함할 수 있다. 다만, 본 개시의 실시예가 이에 제한되는 것은 아니다. 예를 들어, 코어 망은 다른 NF들을 더 포함 할 수 있고, 도 1에서 예시하는 NF들 중 적어도 하나를 덜 포함할 수도 있다. 예를 들어, 도 1의 코어 망의 상기 엔티티들 각각은 독립적으로 존재하는 엔티티들로 도시되나, 본 개시의 실시예가 이에 제한되는 것은 아니다. 예를 들어, 특정 NF는 다른 NF에 포함될 수 있다. 예를 들어, SMF(130b) 는 NWDAF(130i)를 포함할 수 있다. SMF(130b)가 포함하는 NWDAF(130i)는 NWDAF(130i)의 기능을 수행하는 하드 웨어, 소프트웨어, 또는 하드웨어 및 소프트웨어로 구성될 수 있다. 단말은 무선 접속 망과 연결되어 코어 망의 이동성 관리 기능(mobility management function) 을 수행하는 AMF(130a)에 접속할 수 있다. AMF(130a)는 무선 접속 망의 접속과 단말의 이동성 관리 (mobility management)를 수행할 수 있다. SMF(130b)는 세션을 관리할 수 있다. AMF(130a)는 SMF(130b)와 연결 되고, AMF(130a)는 SMF(130b)로 단말에 대한 세션 관련 메시지를 라우팅(routing)할 수 있다. SMF(130b) 는 UPF(130c)와 연결하여 단말에게 제공할 사용자 평면의 자원(resource)을 할당하며, 기지국과 UPF(130c) 사이에 데이터를 전송하기 위한 터널을 수립할 수 있다. PCF(130d)는 단말이 사용하는 세션에 대한 정책(policy) 및 과금(charging)에 관련된 정보를 제어할 수 있다. NRF(130e)는 이동통신 사업자 네트워크 에 설치된 NF들에 대한 정보를 저장하고, 저장된 정보를 알려주는 기능을 수행할 수 있다. NRF(130e)는 모든 NF 들과 연결될 수 있다. 각 NF들은 사업자 네트워크에서 구동을 시작할 때, NRF(130e)에 등록함으로써 NRF(130e) 로 해당 NF가 네트워크 내에서 구동되고 있음을 알릴 수 있다. UDM(130f)는 4G 네트워크의 HSS(home subscriber server)와 유사한 역할을 수행하는 NF로서, 단말의 가입 정보, 또는 단말이 네트워크 내 에서 사용하는 컨텍스트(context)를 저장할 수 있다. NEF(130g)는 제3 자(3rd party) 서버와 5G 이동통신 시스 템 내의 NF를 연결해주는 역할을 수행할 수 있다. 예를 들어, 제3 자 서버(또는 제3 자 어플리케이션(3rd party application))는 AF(application function)일 수 있다. 또한, NEF(130g)는 UDR(130h)에 데이터를 제공하거나 업데이트, 또는 데이터를 획득하는 역할을 수행할 수 있다. UDR(130h)은 단말의 가입 정보를 저장하거나, 정책 정보를 저장하거나, 외부로 노출(Exposure)되는 데이터를 저장하거나, 또는 제3자 어플리케이션(3rd party application)에 필요한 정보를 저장하는 기능을 수행할 수 있다. 또한, UDR(130h)는 저장된 데이터를 다른 NF에 제공해주는 역할도 수행할 수 있다. NWDAF(130i)는 네트워크 데이터의 수집 및 분석 기능을 제공할 수 있다. 예 를 들어, NWDAF(130i)는, 다른 NF로부터 데이터를 획득하고, 획득된 데이터에 기반하여 분석 또는 학습을 통한 추론을 수행할 수 있다. 도 2a는 통신 시스템에서 기지국의 기능적 구성의 예를 도시한다. 도 2a에 예시된 구성은 기지국의 구성으로서 이해될 수 있다. 이하 사용되는 '…부', '…기' 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어나 소프트웨어, 또는, 하드웨어 및 소 프트웨어의 결합으로 구현될 수 있다. 도 2a를 참고하면, 기지국은 무선 통신부, 백홀 통신부, 저장부, 제어부를 포함할 수 있다. 무선 통신부는 무선 채널을 통해 신호를 송수신하기 위한 기능들을 수행한다. 예를 들어, 무선 통신부 는 시스템의 물리 계층 규격에 따라 기저대역 신호 및 비트 열 간 변환 기능을 수행한다. 예를 들어, 데이 터 송신 시, 무선 통신부는 송신 비트열을 부호화 및 변조함으로써 복소 심벌들을 생성한다. 또한, 데이터 수신 시, 무선 통신부는 기저대역 신호를 복조 및 복호화를 통해 수신 비트열을 복원한다. 또한, 무선 통신부는 기저대역 신호를 RF(radio frequency) 대역 신호로 상향변환한 후 안테나를 통해 송 신하고, 안테나를 통해 수신되는 RF 대역 신호를 기저대역 신호로 하향변환한다. 이를 위해, 무선 통신부 는 송신 필터, 수신 필터, 증폭기, 믹서(mixer), 오실레이터(oscillator), DAC(digital to analog convertor),ADC(analog to digital convertor) 등을 포함할 수 있다. 또한, 무선 통신부는 다수의 송수신 경로(pat h)들을 포함할 수 있다. 나아가, 무선 통신부는 다수의 안테나 요소들(antenna elements)로 구성된 적어도 하나의 안테나 어레이(antenna array)를 포함할 수 있다. 하드웨어의 측면에서, 무선 통신부는 디지털 유닛(digital unit) 및 아날로그 유닛(analog unit)으로 구성 될 수 있으며, 아날로그 유닛은 동작 전력, 동작 주파수 등에 따라 다수의 서브 유닛(sub-unit)들로 구성될 수 있다. 디지털 유닛은 적어도 하나의 프로세서(예: DSP(digital signal processor))로 구현될 수 있다. 무선 통신부는 상술한 바와 같이 신호를 송신 및 수신한다. 이에 따라, 무선 통신부의 전부 또는 일 부는 '송신부(transmitter)', '수신부(receiver)' 또는 '송수신부(transceiver)'로 지칭될 수 있다. 또한, 이 하 설명에서, 무선 채널을 통해 수행되는 송신 및 수신은 무선 통신부에 의해 상술한 바와 같은 처리가 수 행되는 것을 포함하는 의미로 사용된다. 백홀 통신부는 네트워크 내 다른 노드들과 통신을 수행하기 위한 인터페이스를 제공한다. 즉, 백홀 통신부 는 기지국에서 다른 노드, 예를 들어, 다른 접속 노드, 다른 기지국, 상위 노드, 코어 망 등으로 송 신되는 비트열을 물리적 신호로 변환하고, 다른 노드로부터 수신되는 물리적 신호를 비트열로 변환한다. 저장부는 기지국의 동작을 위한 기본 프로그램, 응용 프로그램, 설정 정보 등의 데이터를 저장한다. 저장부는 휘발성 메모리, 비휘발성 메모리 또는 휘발성 메모리와 비휘발성 메모리의 조합으로 구성될 수 있다. 그리고, 저장부는 제어부의 요청에 따라 저장된 데이터를 제공한다. 제어부는 기지국의 전반적인 동작들을 제어한다. 예를 들어, 제어부는 무선 통신부를 통해 또는 백홀 통신부를 통해 신호를 송신 및 수신한다. 또한, 제어부는 저장부에 데이터를 기록하 고, 읽는다. 그리고, 제어부는 통신 규격에서 요구하는 프로토콜 스택(protocol stack)의 기능들을 수행할 수 있다. 다른 구현 예에 따라, 프로토콜 스택은 무선 통신부에 포함될 수 있다. 이를 위해, 제어부 는 적어도 하나의 프로세서(processor)를 포함할 수 있다. 다양한 실시 예들에 따라, 제어부는 무선 통신 망을 이용한 동기화를 수행하도록 제어할 수 있다. 예를 들어, 제어부는 기지국이 후술하는 다양한 실시 예들에 따른 동작들을 수행하도록 제어할 수 있다. 도 2b는 통신 시스템에서 단말의 기능적 구성의 예를 도시한다. 도 2b에 예시된 구성은 단말의 구성으로서 이해될 수 있다. 이하 사용되는 '…부', '…기' 등의 용어는 적 어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어나 소프트웨어, 또는, 하드웨어 및 소프 트웨어의 결합으로 구현될 수 있다. 도 2b를 참고하면, 단말은 통신부, 저장부, 제어부를 포함할 수 있다. 통신부는 무선 채널을 통해 신호를 송수신하기 위한 기능들을 수행한다. 예를 들어, 통신부는 시스템 의 물리 계층 규격에 따라 기저대역 신호 및 비트 열 간 변환 기능을 수행한다. 예를 들어, 데이터 송신 시, 통 신부는 송신 비트 열을 부호화 및 변조함으로써 복소 심벌들을 생성한다. 또한, 데이터 수신 시, 통신부 는 기저대역 신호를 복조 및 복호화를 통해 수신 비트 열을 복원한다. 또한, 통신부는 기저대역 신호 를 RF 대역 신호로 상향변환한 후 안테나를 통해 송신하고, 안테나를 통해 수신되는 RF 대역 신호를 기저대역 신호로 하향변환한다. 예를 들어, 통신부는 송신 필터, 수신 필터, 증폭기, 믹서, 오실레이터, DAC, ADC 등을 포함할 수 있다. 또한, 통신부는 다수의 송수신 경로(path)들을 포함할 수 있다. 나아가, 통신부는 다수의 안테나 요 소들로 구성된 적어도 하나의 안테나 어레이를 포함할 수 있다. 하드웨어의 측면에서, 통신부는 디지털 회 로 및 아날로그 회로(예: RFIC(radio frequency integrated circuit))로 구성될 수 있다. 여기서, 디지털 회로 및 아날로그 회로는 하나의 패키지로 구현될 수 있다. 또한, 통신부는 다수의 RF 체인들을 포함할 수 있다. 나아가, 통신부는 빔포밍을 수행할 수 있다. 통신부는 상술한 바와 같이 신호를 송신 및 수신한다. 이에 따라, 통신부의 전부 또는 일부는 '송신 부', '수신부' 또는 '송수신부'로 지칭될 수 있다. 또한, 이하 설명에서 무선 채널을 통해 수행되는 송신 및 수 신은 통신부에 의해 상술한 바와 같은 처리가 수행되는 것을 포함하는 의미로 사용된다. 저장부는 단말의 동작을 위한 기본 프로그램, 응용 프로그램, 설정 정보 등의 데이터를 저장한다. 저 장부는 휘발성 메모리, 비휘발성 메모리 또는 휘발성 메모리와 비휘발성 메모리의 조합으로 구성될 수 있 다. 그리고, 저장부는 제어부의 요청에 따라 저장된 데이터를 제공한다. 제어부는 단말의 전반적인 동작들을 제어한다. 예를 들어, 제어부는 통신부를 통해 신호를 송신 및 수신한다. 또한, 제어부는 저장부에 데이터를 기록하고, 읽는다. 그리고, 제어부는 통 신 규격에서 요구하는 프로토톨 스택의 기능들을 수행할 수 있다. 이를 위해, 제어부는 적어도 하나의 프 로세서 또는 마이크로(micro) 프로세서를 포함하거나, 또는, 프로세서의 일부일 수 있다. 또한, 통신부의 일부 및 제어부는 CP(communication processor)라 지칭될 수 있다. 다양한 실시 예들에 따라, 제어부 는 무선 통신망을 이용한 동기화를 수행하도록 제어할 수 있다. 예를 들어, 제어부는 단말이 후술하 는 다양한 실시 예들에 따른 동작들을 수행하도록 제어할 수 있다. 도 2c는 통신 시스템에서 코어 망 엔티티의 기능적 구성의 예를 도시한다. 도 2c에 예시된 코어 망 엔티티는 도 1의 AMF(130a), SMF(130b), UPF(130c), PCF(130d), NRF(130e), UDM(130f), NEF(130g), UDR(130h), 또는 NWDAF(130i) 중 적어도 하나의 기능을 가지는 장치의 구성으로서 이해 될 수 있다. 다만 본 개시의 실시예가 이에 제한되는 것은 아니다. 예를 들어, 도 2c의 코어 망 엔티티는 상술한 예와 다른 엔티티에 대한 기능적 구성의 예로 이해될 수 있다. 상기 엔티티는, 노드(node), 또는 NF(network function)으로 참조될 수 있다. 이하 사용되는 '…부', '…기' 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어나 소프트웨어, 또는, 하드웨어 및 소프트웨어의 결합으로 구 현될 수 있다. 도 2c를 참고하면, 코어 망 엔티티는 통신부, 저장부, 제어부를 포함할 수 있다. 통신부는 네트워크 내 다른 장치들과 통신을 수행하기 위한 인터페이스를 제공한다. 즉, 통신부는 코 어 망 엔티티에서 다른 장치로 송신되는 비트열을 물리적 신호로 변환하고, 다른 장치로부터 수신되는 물 리적 신호를 비트 열로 변환한다. 즉, 통신부는 신호를 송신 및 수신할 수 있다. 이에 따라, 통신부 는 모뎀(modem), 송신부(transmitter), 수신부(receiver) 또는 송수신부(transceiver)로 지칭될 수 있다. 이때, 통신부는 코어 망 엔티티가 백홀 연결(예: 유선 백홀 또는 무선 백홀)을 거쳐 또는 네트워크를 거쳐 다른 장치들 또는 시스템과 통신할 수 있도록 한다. 저장부는 코어 망 엔티티의 동작을 위한 기본 프로그램, 응용 프로그램, 설정 정보 등의 데이터를 저 장한다. 저장부는 휘발성 메모리, 비휘발성 메모리 또는 휘발성 메모리와 비휘발성 메모리의 조합으로 구 성될 수 있다. 그리고, 저장부는 제어부의 요청에 따라 저장된 데이터를 제공한다. 제어부는 코어 망 엔티티의 전반적인 동작들을 제어한다. 예를 들어, 제어부는 통신부를 통해 신호를 송수신한다. 또한, 제어부는 저장부에 데이터를 기록하고, 읽는다. 이를 위해, 제어부 는 적어도 하나의 프로세서(processor)를 포함할 수 있다. 다양한 실시 예들에 따라, 다양한 실시 예들에 따라, 제어부는 무선 통신망을 이용한 동기화를 수행하도록 제어할 수 있다. 예를 들어, 제어부는 코 어 망 엔티티가 후술하는 다양한 실시 예들에 따른 동작들을 수행하도록 제어할 수 있다. 도 3은 통신 시스템에서 NF(network function) 선택(selection)의 예를 도시한다. 도 3의 통신 시스템은 도 1의 통신 시스템에 대한 예시를 나타낼 수 있다. 예를 들어, 통신 시스템은 기지국들(110-1, 110-2, 110-3) 및 코어 망을 포함할 수 있다. 도 3은 설명의 편의를 위하여 5G(5th generation) 통신 시스템에 대한 예를 도시하나, 본 개시의 실시예가 이에 제한되는 것은 아니다. 예를 들어, 도 3의 통신 시스템은 5G 통신 시스템 뿐만 아니라 LTE(long term evolution) 통신 시스템을 포함할 수 있다. 도 3을 참조하면, 통신 시스템은 기지국들(110-1, 110-2, 110-3) 및 코어 망을 포함할 수 있다. 코 어 망은, 복수의 NF들을 포함할 수 있다. 예를 들어, 코어 망은, AMF들(310-1, 310-2), SMF들(320- 1, 320-2), UPF들(330-1, 330-2, 330-3), PCF, UDM, AUSF(authentication server function), 및 NSSF(network slicing selection function을 포함할 수 있다. 다만, 본 개시의 실시예가 이에 제한되 는 것은 아니다. 예를 들어, 코어 망은, 도 3에서 예시된 NF들을 이외의 다른 NF를 더 포함하거나, 도 3에서 예시된 NF들 중 적어도 일부를 덜 포함할 수도 있다. 네트워크 슬라이싱(network slicing)은, 가상화된(vituralized) 네트워크를 논리적으로 구성하고, 네트워크 슬 라이스(slice)(또는 슬라이스)들로 분리하는 기술이다. 하나의 단말(예: 도 1의 단말)은 다양한 서비스들 을 제공받는 경우 두 개 이상의 슬라이스들에 접속할 수 있다. 상기 네트워크 슬라이스는, 특정 서비스를 지원 하기 위하여 물리적인 네트워크 자원을 가상화함으로써, 분리한 각 구성을 나타낼 수 있다. 가상화된 네트워크 구조에서 다양한 서비스들을 지원하기 위해 네트워크 슬라이싱 기술이 도입되었다. 네트워크 슬라이싱은 특정 서비스를 지원하기 위한 NF들의 집합을 나타낼 수 있다. 도 3을 참조하면, 통신 시스템은, 복수의 네트워 크 슬라이스들(301, 302, 303)과 관련된 기지국들(110-1, 110-2, 110-3) 및 코어 망의 NF들에 기반하여, 다양한 서비스들(381, 382, 383, 384, 385)을 제공할 수 있다. 도 3의 통신 시스템이 포함하는 노드들(예: 기지국, NF들), 슬라이스, 및 서비스의 수는 예시적인 것이며, 본 개시의 실시예가 이에 제한 해석되지 않는다. 상술한 바와 같이, 통신 시스템(예: 5G 통신 시스템 또는 LTE 통신 시스템)의 코어 망(예: 5GC(5G core) 또는 EPC(evolved packet core))은 복수의 NF들을 포함할 수 있다. 상기 복수의 NF들 중 일부 NF들은 위치 정 보, 서비스, 또는 용량(capacity)을 고려하여, 연결될 다른 NF들을 선택할 수 있다. 상기 일부 NF들은 소비자 NF(consumer NF)로, 상기 다른 NF들은 제공자 NF(provider NF)로 참조될 수 있다. 코어 망의 구성에 있어 서, 효율적인 NF 선택(selection) 방법이 요구된다. 상기 NF 선택은, DNN(data network name) 및 S-NSSAI(Single network slice selection assistance information)을 포함하는 서비스 관련 파라미터(parameter), TA(tracking area) 및 TA list을 포함하는 위치 파라미터, 및 용량 파라미터에 기반하여 수행될 수 있다. 예를 들어, 상기 NF 선택은, DNN, S-NSSAI, 및 위치 파라미터에 기반하여 복수의 NF들을 식별하고, 식별된 복수의 NF들 중에서 용량 정보에 기반하여 특정 NF를 선 택할 수 있다. 상기 복수의 NF들은, NF 그룹(group)으로 참조될 수 있다. 상기 NF 그룹은, 동일한 서비스를 제 공할 수 있는 NF들의 집합을 나타낼 수 있다. 상기 복수의 NF들 중 특정 NF를 선택하는 것은, 상기 복수의 NF들 내에서 용량 값에 기반하여 고정된 비율을 통해 RR(round-robin) 방식을 이용하여 분배함을 포함할 수 있다. 상 기 용량 값은, NF의 용량에 비례하여 설정될 수 있고, 설정된 용량 값에 기반하여 로드 밸런싱(load balancin g)이 수행될 수 있다. 상술한 바와 같이 고정된 비율을 통해 NF를 선택하는 방법은 비교적 단순하게 구성된 네트워크 구조에 대하여 적용될 수 있다. 그러나, 도 3에서 예시하는 통신 시스템과 같이, 다양한 서비스들을 제공하기 위한 다양 하고 세분화된 NF들이 운용됨에 따라 네트워크 구조가 복잡해지고 있다. 상기 고정된 비율을 통한 NF 선택은, 네트워크를 운용하는 사업자가 선택 비율을 수동적으로 설정해야 한다. 그러나, 복잡해진 네트워크 구조에 대하 여 상기 선택 비율을 수동적으로 설정하는 것은 어려울 수 있다. 또한, 상기 고정된 비율을 통한 NF 선택은, 단 말과 서비스의 종류가 증가하고 트래픽(traffic)의 패턴(pattern)이 복잡해짐에 따른 네트워크 환경 변화에 대 응하기 어려울 수 있다. 또한, 상기 고정된 비율을 통한 NF 선택은, 코어 망 내 NF의 변경(예: 추가, 삭제)가 발생되는 경우, 상기 비율을 수동적으로 설정해야 하는 문제가 있다. 따라서, 복잡한 네트워크 환경을 위하여, 선택할 NF(이하, 대상(target) NF)의 데이터(data)를 수집하고 상기 데이터에 기반하여 자동으로 NF 선 택을 수행하는 방법이 요구된다. 본 개시의 실시예는, 대상 NF로부터 수집한 데이터의 다양한 파라미터들(parameter)들에 기반하여 로드 밸런싱 을 수행하고, 동적으로 실시간 네트워크의 환경을 반영하기 위한 적응형(adaptive) NF 선택 방법을 제안한다. 본 개시의 실시예에 따른 장치 및 방법은, 대상 NF로부터 데이터를 수집하고 인공 지능 모델(artificial intelligence model, AI model)을 이용하여 데이터를 처리 및 분석함으로써, NF 선택을 수행할 수 있다. 예를 들어, 본 개시의 실시예에 따른 장치 및 방법은, 수집된 데이터에 기반하여 현재의 대상 NF의 부하 또는 미래의 예측된 대상 NF의 부하를 식별할 수 있다. 본 개시의 실시예에 따른 장치 및 방법은, 식별된 결과에 기반하여 NF 선택을 수행함으로써, 로드 밸런싱을 강화(reinforce)할 수 있다. 본 개시의 실시예에 따른 장치 및 방법을 통해, 사업자는 상기 파라미터들을 설정하고 가중치를 설정함으로써, 네트워크 환경에 맞게 네트워크를 운용할 수 있다. 이에 따라, 본 개시의 실시예에 따른 장치 및 방법은, NF들 사이의 로드 밸런싱을 수행함으로써 네트 워크의 품질(quality)을 개선하고, 운용 비용을 줄일 수 있다. 도 4는 대상(target) NF와 관련된 부하 정보를 수집하는(collect) 방법에 대한 예를 도시한다. 상기 대상 NF는, 상기 부하 정보에 기반하여 선택될 NF를 나타낼 수 있다. 이하, 상기 대상 NF는 제2 NF로 참조될 수 있다. 또한, 복수의 제2 NF들 중에서 제2 NF를, 상기 부하 정보에 기반하여 선택하는 주체인 NF 는 제1 NF로 참조될 수 있다. 예를 들어, NWDAF, UDM, 제2 NF, 및 제1 NF 각각은, 도 2c의 코어 망 엔티티에 포함될 수 있다. 도 4는 상기 복수의 제2 NF들 각각으로부터 데이터를 수집하는 NWDAF의 동작의 예를 도시한다. 도 4에서는, NWDAF가 제1 NF의 외부에 존재하는 NF로 예시되나, 본 개시의 실시예가 이에 제한되는 것은 아니다. 예를 들어, NWDAF와 실질적으로 동일한 기능을 수행하는 논리적 구성 또는 NWDAF가 제1 NF에 포함될 수도 있다. 도 4의 동작들은, NWDAF에 의해 이벤트 노출 서비스들(event exposure services)을 이용하여 관련된 이벤 트 상에서 데이터 수집을 알리기 위하여, NWDAF가 제2 NF에서 구독/비구독(subscribe/unsubscribe) 하는 절차를 나타낼 수 있다. 로컬 규제 요구사항들(local regulation requirements)에 기반한 단말(예: 도 1 의 단말)을 위한 사용자 동의(user consent) 데이터 수집 및 수집된 데이터의 사용이 요구될 수 있다. 예 를 들어, 상기 사용자 동의는 분석(analytics) 또는 모델 훈련(model training)을 위하여 이용될 수 있다. 도 4를 참조하면, NWDAF는, UDM과 사용자 동의의 승인 여부를 식별하기 위한 절차를 수행할 수 있다. 상기 사용자 동의에 기반하여 NWDAF는 제2 NF에 대한 구독 여부를 식별할 수 있다. NWDAF가 특정 이벤트와 관련하여 제2 NF에 대하여 구독하는 경우, 제2 NF는 상기 특정 이벤트에 대한 보고와 함께 NWDAF에게 제2 NF에 대한 데이터를 전송할 수 있다. 예를 들어, 제2 NF는, 동 작에서, Nnf_EventExposure_Notify 메시지를 통해 상기 데이터를 NWDAF에게 전송할 수 있다. 예를 들어, 상기 데이터는, 제2 NF의 부하 정보를 포함할 수 있다. 상기 부하 정보는, 제2 NF의 부하를 식 별하기 위한 정보를 포함할 수 있다. 상기 부하를 식별하기 위한 정보는 복수의 파라미터들을 포함할 수 있다. 예를 들어, 상기 부하 정보는, 제2 NF가 제공하는 서비스와 관련된 요소(factor), 사용자 평면(user plane) 요소, 및 제어 평면(control plane) 요소를 포함할 수 있다. 예를 들어, 상기 복수의 파라미터들은, 상 기 서비스와 관련된 요소, 상기 사용자 평면 요소, 또는 상기 제어 평면 요소 중 적어도 하나를 포함할 수 있다. 예를 들어, 상기 서비스와 관련된 요소는, 제2 NF와 관련된 단말(user equipment)의 수, PDU(protocol data unit) 세션(session)의 수, 또는 QoS(quality of service) 플로우(flow)의 수 중 적어도 하나를 포함할 수 있다. 예를 들어, 상기 제2 NF와 관련된 단말의 수는, 제2 NF가 서비스 가능한 단말의 최대 수 또 는 제2 NF가 서비스를 제공하고 있는 단말의 수를 포함할 수 있다. 예를 들어, 상기 PDU 세션의 수 및 상 기 QoS 플로우의 수는, 제2 NF가 서비스를 제공하는 PDU 세션 및 QoS 플로우의 수를 나타낼 수 있다. 또한, 예를 들어, 상기 서비스와 관련된 요소는, 제2 NF의 CPU(central processing unit), 메모리 (memory), 또는 디스크(disk)의 부하를 나타내는 정보 중 적어도 하나를 포함할 수 있다. 예를 들어, 상기 사용자 평면 요소는, 트래픽(traffic), 패킷 드랍률(packet drop rate), 또는 IP(internet protocol) 풀(pool) 사용량 중 적어도 하나를 포함할 수 있다. 예를 들어, 상기 트래픽은, 단위 시간 동안 사용 된 트래픽의 양 및 최대로 서비스 가능한 트래픽의 성능 용량 정보를 포함할 수 있다. 상기 패킷 드랍률은, 데 이터 송수신에 실패하여, 드랍된 패킷의 수 및 크기(size)를 포함할 수 있다. 상기 패킷 드랍률은, 드랍 패킷 (drop packet)으로 참조될 수 있다. 예를 들어, 상기 IP 풀 사용량은, IP 풀 내에서 특정 단말에게 할당된 IP의 수(또는 사용량)을 포함할 수 있다. 예를 들어, 상기 제어 평면 요소는, TPS(transaction per second) 또는 호(call)에 대한 정보를 포함할 수 있 다. 상기 TPS는, 단위 시간(초) 단 메시지의 수를 포함할 수 있다. 상기 호에 대한 정보는, 호 절차(call procedure)에 따라 시도(attempt), 성공(success), 실패(fail) 및 실패 이유(cause)에 대한 정보를 포함할 수 있다. 상기 부하 정보에 포함되는 복수의 파라미터들은, 제2 NF에 기반하여 식별될 수 있다. 예를 들어, 상기 복 수의 파라미터들은, 제2 NF의 기능(function) 또는 역할(role)에 기반하여 식별될 수 있다. 예를 들어, NWDAF는 제2 NF로부터 주기적으로 상기 부하 정보를 획득할 수 있다. 예를 들어, NWDAF는 지정된 길이의 주기 마다 상기 부하 정보를 획득할 수 있다. 예를 들어, 상기 지정된 길이는, 5분 일 수 있다. 다만, 본 개시의 실시예가 이에 제한되는 것은 아니다.도 4를 참조하면, 제1 NF는, NF 선택을 위한 요청 메시지를 NWDAF에게 전송할 수 있다. 예를 들어, 동작(420-1)에서, 제1 NF는, 상기 요청 메시지를 NWDAF에게 전송할 수 있다. 도 4에서는, 동작(420- 1)이 동작의 직전에 수행되는 것으로 예시하나, 본 개시의 실시예가 이에 제한되는 것은 아니다. 예를 들 어, 동작(420-1)은, 동작이 수행되기 이전의 임의의 시점에서 수행될 수도 있다. 또는, 동작(420-2)에서, 제1 NF는, 상기 요청 메시지를 NWDAF에게 전송할 수 있다. 다시 말해서, 제1 NF는, NWDAF(40 0)가 제2 NF로부터 상기 부하 정보를 획득하기 전 또는 획득한 후의 시간에, 상기 요청 메시지를 NWDAF에게 전송할 수 있다. 동작(420-1)을 참조하면, NWDAF는, 상기 요청 메시지의 수신에 기반하여, 상기 부하 정보를 수집할 수 있다. 동작(420-2)을 참조하면, NWDAF는, 상기 요청 메시지의 수신에 기반하 여, 수집된 상기 부하 정보를 식별할 수 있다. 동작을 참조하면, NWDAF는, 상기 요청 메시지에 응답하여, 응답 메시지를 제1 NF에게 전송할 수 있다. 상기 응답 메시지는, 상기 부하 정보에 기반하여 식별된 제2 NF의 부하를 포함할 수 있다. 예를 들 어, 상기 제2 NF의 부하는, 복수의 제2 NF들 중 제2 NF를 선택하기 위한 정보를 나타낼 수 있다. 이 와 관련된 구체적인 내용은, 이하 도 8에서 서술된다. 도 4를 참조하면, 제2 NF는, 제1 NF에 의해 선택되는 NF일 수 있다. 예를 들어, 제1 NF는, AMF, 또는 SMF를 포함할 수 있다. 예를 들어, 제2 NF는, SMF, UPF, UDM, 또는 PCF를 포함할 수 있다. 다 만, 본 개시의 실시예가 상술한 예들에 의해 제한될 것은 아니다. 또한, 도 4를 참조하면, NWDAF가 하나의 제2 NF로부터 데이터를 수집하는 예를 도시하나, 본 개시의 실시예가 이에 제한되는 것이 아니다. 예를 들어, NWDAF는, 제2 NF를 포함하는 복수의 제2 NF들 각각 으로부터 부하 정보를 수집할 수 있다. 도 5a는 수집된 부하 정보에 기반하여 예측 부하 정보를 획득하는 인공 지능 모델(artificial intelligence model, AI model)의 예를 도시한다. 도 5a의 인공 지능 모델은, 순차적인 입력(input)을 학습하는 적층된(stacked) RNN(recurrent neural network) 및 출력(output)을 생성하기 위한 FC(fully connected) 신경망(neural network)로 구성 된 기계 학습(machine learning) 모델을 포함할 수 있다. 예를 들어, 상기 RNN은 GRU(gated recurrent unit), LSTM(long short-term memory)를 포함할 수 있다. 다만, 본 개시의 실시예가 이에 제한되는 것은 아니다. 인공 지능 모델은, 다른 계열의 AI 모델로 구성될 수도 있다. 도 5a의 인공 지능 모델은, 도 4의 NWDAF에 포함될 수 있다. 예를 들어, NWDAF는 인공 지능 모 델 또는 인공 지능 모델과 실질적으로 동일한 기능을 수행하는 구성요소를 포함할 수 있다. 또한, 도 4에서 서술된 바와 같이 NWDAF는 제1 NF에 포함될 수 있는 바, 인공 지능 모델은 제1 NF 에 포함될 수도 있다. 도 5a를 참조하면, 인공 지능 모델은 입력에 기반하여 출력을 생성할 수 있다. 예를 들어, 입력 은, 부하 정보의 복수의 파라미터들을 포함할 수 있다. 예를 들어, 상기 부하 정보는, 도 4에서 NWDAF가 제2 NF로부터 획득한 부하 정보를 포함할 수 있다. 예를 들어, 상기 복수의 파라미터들은, NWDAF가 제2 NF로부터 획득한 상기 부하 정보의 파라미터들을 포함할 수 있다. 예를 들어, 입력(51 0)은, CPU 부하, PDU 세션 수(count), 트래픽, 및 드랍 패킷을 포함할 수 있다. 입력 에 포함되는 상기 파라미터들은, 현재 시점을 기준으로, 과거에 수집된 파라미터들(즉, 이전(previous) 파 라미터들)을 나타낼 수 있다. 다만, 본 개시의 실시예가 이에 제한되는 것은 아니다. 예를 들어, 입력은, 도 5a의 파라미터들 외의 다른 파라미터들을 더 포함하거나, 도 5a의 파라미터들 중 일부를 제외한 파라미터를 포함할 수도 있다. 입력은, 인공 지능 모델의 입력 레이어(layer)에 대한 입력(x1, x2, ...xp)일 수 있다. 인공 지능 모델은, 입력에 기반하여 출력을 생성할 수 있다. 예를 들어, 출력은, 복수의 파라미터들을 포함할 수 있다. 출력이 포함하는 상기 복수의 파라미터들은, 입력이 포함하는 상기 복 수의 파라미터들과 대응할 수 있다. 예를 들어, 출력은, CPU 부하, PDU 세션 수(count), 트래 픽, 및 드랍 패킷을 포함할 수 있다. 출력에 포함되는 상기 파라미터들은, 현재 시점을 기준으 로, 미래에 수집될 파라미터들(즉, 예측된(predicted) 파라미터들)을 나타낼 수 있다. 다만, 본 개시의 실시예 가 이에 제한되는 것은 아니다. 예를 들어, 출력은, 도 5a의 파라미터들 외의 다른 파라미터들을 더 포함하거나, 도 5a의 파라미터들 중 일부를 제외한 파라미터를 포함할 수도 있다. 출력은, 인공 지능 모델 의 출력 레이어(layer)에 대한 출력(y1, y2, ...yq)일 수 있다. 도 5a를 참조하면, 인공 지능 모델은, 부하 정보에 포함된 복수의 파라미터들에 기반하여, 상기 복수의 파 라미터들에 대응하는 파라미터들을 출력으로 생성할 수 있다. 상기 생성된 출력은, 예측된 파라미터들을 나타낼 수 있다. 상기 예측된 파라미터들을 생성하기 위하여, 인공 지능 모델은, 학습될 수 있다. 인공 지능 모델 의 학습을 위한 데이터에 대한 예는 이하 도 5b에서 구체적으로 서술된다. 도 5b는 복수의 시간 구간들의 부하 정보에 기반하여 인공 지능 모델을 학습하는 방법에 대한 예를 도시한다. 상기 부하 정보는, 도 4에서 NWDAF가 대상 NF인 제2 NF로부터 수집하는 부하 정보를 나타낼 수 있다. 도 5b의 학습 대상인 상기 인공 지능 모델은, 도 5a의 인공 지능 모델의 예를 나타낼 수 있다. 도 5b는 NWDAF가 지정된 기간 동안 부하 정보를 수집하는 예를 도시한다. 예를 참조하면, NWDAF는 현재 시점으로부터 지정된 기간 만큼의 과거 시점까지의 시간 구간 동안의 부하 정보를 수집할 수 있다. 예를 들어, 지정된 기간은 3개월일 수 있다. 예를 들어, 상기 시간 구간은 5분일 수 있다. 상기 시간 구간은, 상기 부하 정보를 수집하는 주기를 나타낼 수 있다. 예를 참조하면, 시간의 흐름에 따라 현재 시점이 변경되고 지정된 기간은 특정한 길이를 갖는 바, 과거 시점이 변경될 수 있다. 지정된 기간은, NWDAF가 제2 NF와 관련하여 저장하는 데이터의 길이를 나타낼 수도 있 다. 예를 들어, 지정된 기간은, 복수의 시간 구간들을 포함하는 시퀀스(sequence)의 세트로 구성될 수 있다. 예를 들어, 상기 시퀀스의 세트는, 시퀀스들(540-1, 540-2, 540-3, ..., 540-n)을 포함할 수 있다. 예를 들어, 하나의 시퀀스의 시간적 길이는 6시간일 수 있다. 다시 말해서, 하나의 시퀀스는 72개의 시간 구간들을 포함할 수 있다. 예를 들어, 시퀀스들(540-1, 540-2, 540-3, ..., 540-n) 중 인접한 2개의 시퀀스들 사이의 시간적 차이는 하나 의 시간 구간으로 정의될 수 있다. 예를 들어, 시퀀스(540-1)와 시퀀스(540-2) 사이의 차이는 하나의 시간 구간의 길이(예: 5분)에 대응할 수 있다. 인공 지능 모델은, 시퀀스 별로 학습을 수행할 수 있다. 예를 들어, 인공 지능 모델은, 하나의 시퀀 스(540-n)에 기반하여 학습될 수 있다. 도 5b를 참조하면, 시퀀스(540-n)에 대한 구체적인 예가 도시된다. 예를 참조하면, 시퀀스(540-n)는, 복수의 시간 구간들(570-1, 570-2, 570-3, ..., 570-n, 및 580)을 포함 할 수 있다. 예를 들어, 복수의 시간 구간들(570-1, 570-2, 570-3, ..., 570-n, 및 580) 중에서 기준 시점 (reference timing) 이전의 제1 세트의 부하 정보에 기반하여, 인공 지능 모델은, 기준 시점 이후의 부하 정보를 예측할 수 있다. 다시 말해서, 인공 지능 모델은 예측 부하 정보를 식별할 수 있다. 예를 들어, 기준 시점은 시퀀스(540-n) 내 가장 빠른 시점으로부터 5시간 지난 지점을 나타낼 수 있다. 예 를 들어, 상기 제1 세트의 부하 정보는, 제1 시간 영역에 대응하는 부하 정보를 나타낼 수 있다. 예를 들 어, 제1 시간 영역의 시간적 길이는 5시간일 수 있다. 예를 들어, 상기 제1 세트의 부하 정보는, 복수의 시간 구간들(570-1, 570-2, 570-3, ..., 570-n)에 대응하는 부하 정보를 포함할 수 있다. 인공 지능 모델은, 상기 예측 부하 정보와 기준 시점 이후의 제2 세트의 부하 정보를 비교할 수 있다. 예를 들어, 상기 제2 세트의 부하 정보는, 제2 시간 영역에 대응하는 부하 정보를 나타낼 수 있다. 예를 들어, 제2 시간 영역의 시간적 길이는 1시간일 수 있다. 예를 들어, 상기 제2 세트의 부하 정보는, 부하 정보를 포함하는 복수의 시간 구간들에 대응하는 부하 정보를 포함할 수 있다. 예를 들어, 상기 제2 세트의 부하 정보 내 포함되는 복수의 파라미터들은, 도 5b에서 도시하는 바와 같이, CPU 부하, 트래픽, 드랍 패킷, PDU 세션 수를 포함할 수 있다. 상술한 바와 같이, 인공 지능 모델은, 상기 예측 부하 정보 및 상기 제2 세트의 부하 정보를 비교함으로써, 인공 지능 모델을 학습할 수 있다. 도 5b를 참조하면, 지정된 기간 내 시퀀스들(540-1, 540-2, 540-3, ..., 540-n) 중 제1 부분은, 인공 지 능 모델의 학습을 위해 이용될 수 있다. 또한, 지정된 기간 내 시퀀스들(540-1, 540-2, 540-3, ..., 540-n) 중 상기 제1 부분과 다른 제2 부분은, 학습된 인공 지능 모델의 예측 정확도(또는 정확도)를 평가 하기 위해 이용될 수 있다. 다시 말해서, 도 5b의 예를 통해, 인공 지능 모델을 학습하는 것은, 상기 제1 부분의 시퀀스들 각각에 기반하여 수행될 수 있다. 상기 제1 부분 및 상기 제2 부분은 서로 중첩되지 않을수 있다. 예를 들어, 상기 제1 부분에 포함되는 시퀀스들(540-1, 540-2, 540-3, ..., 540-n)의 부분은, 상기 제2 부분에 포함되는 시퀀스들(540-1, 540-2, 540-3, ..., 540-n)의 부분과 서로 상이할 수 있다. 예를 들어, 상기 제1 부분은 시퀀스들(540-1, 540-2, 540-3, ..., 540-n)의 70%를 포함할 수 있다. 상기 제2 부분은 시퀀 스들(540-1, 540-2, 540-3, ..., 540-n)의 30%를 포함할 수 있다. 다만, 본 개시의 실시예가 이에 제한되는 것 은 아니며, 상기 제1 부분 과 상기 제2 부분 사이의 비율을 변경될 수 잇다. 또한, 상기 제1 부분 및 상기 제2 부분 각각은 시퀀스들(540-1, 540-2, 540-3, ..., 540-n)의 임의의 시퀀스들을 포함할 수 있다. 다시 말해서, 상기 제1 부분 또는 상기 제2 부분이 포함하는 시퀀스들은 시계열적으로 식별되는 것이 아니라, 임의적으로 (randomly) 식별될 수 있다. 도 5b에서는, 인공 지능 모델이 상기 복수의 파라미터들을 포함하는 부하 정보(또는, 제2 세트의 부하 정 보) 및 예측 부하 정보 사이를 비교하는 예로 설명하였으나, 본 개시의 실시예가 이에 제한되는 것은 아니다. 예를 들어, 후술하는 바와 같이 부하 정보의 복수의 파라미터들에 기반하여 변환된(scaled) 부하 값 및 예측 부 하 정보의 변환된 부하 값을 비교함으로써, 인공 지능 모델이 학습될 수도 있다. 예를 들어, 복수의 시간 구간들(570-1, 570-2, 570-3, ..., 570-n, 및 580) 중에서 기준 시점 이전의 제1 세트의 부하 정보에 기반하여, 인공 지능 모델은, 기준 시점 이후와 관련된 제1 부하 값을 식별할 수 있다. 예를 들어, 기준 시점은 시퀀스(540-n) 내 가장 빠른 시점으로부터 5시간 지난 지점을 나타낼 수 있 다. 예를 들어, 상기 제1 세트의 부하 정보는, 제1 시간 영역에 대응하는 부하 정보를 나타낼 수 있다. 예 를 들어, 제1 시간 영역의 시간적 길이는 5시간일 수 있다. 예를 들어, 상기 제1 세트의 부하 정보는, 복 수의 시간 구간들(570-1, 570-2, 570-3, ..., 570-n)에 대응하는 부하 정보를 포함할 수 있다. 상기 제1 부하 값은, 상기 제1 세트의 부하 정보에 기반하여, 예측되는 기준 시점 이후와 관련된 값을 나타낼 수 있다. 상기 제1 부하 값은, 상기 제1 세트의 부하 정보의 복수의 파라미터들 및 상기 복수의 파라미터들 사이의 비율 (ratio)에 기반하여 변환된(scaled) 값을 나타낼 수 있다. 인공 지능 모델은, 상기 제1 부하 값과 기준 시 점 이후의 제2 세트의 부하 정보에 기반하여 식별된 제2 부하 값을 비교할 수 있다. 예를 들어, 상기 제2 세트의 부하 정보는, 제2 시간 영역에 대응하는 부하 정보를 나타낼 수 있다. 예를 들어, 제2 시간 영역 의 시간적 길이는 1시간일 수 있다. 예를 들어, 상기 제2 세트의 부하 정보는, 부하 정보를 포함하는 복수의 시간 구간들에 대응하는 부하 정보를 포함할 수 있다. 상기 제2 부하 값은, 부하 정보를 포함하는 상기 복수의 시간 구간들에 대응하는 부하 정보의 복수의 파라미터들 및 상기 복수의 파라미터들 사이의 비율에 기반하여 변환된 값을 나타낼 수 있다. 상술한 바와 같이, NWDAF는, 상기 제1 부하 값과 상기 제2 부하 값 을 비교함으로써, 인공 지능 모델을 학습할 수 있다. 상기 제1 부하 값 및 상기 제2 부하 값을 계산하는 방법은, 이하 도 6의 부하 가중치를 계산하는 방법과 실질적으로 동일하게 이해될 수 있다. 도 5b에서는, 하나의 인공 지능 모델을 포함하는 NWDAF을 예로 도시하나, 본 개시의 실시예가 이에 제한되는 것은 아니다. 예를 들어, NWDAF는 복수의 인공 지능 모델들을 포함할 수 있다. 예를 들어, NWDAF는, 지정된 기간 동안 획득된 부하 정보에 기반하여, 상기 복수의 인공 지능 모델들 각각을 학 습할 수 있다. 이 때, 상기 복수의 인공 지능 모델들 각각은, 시간적 조건 또는 위치적 조건을 달리하여 학습될 수 있다. 예를 들어, 상기 복수의 인공 지능 모델들 중 일부는, 지정된 기간 전체에 대한 부하 정보에 기 반하여 학습될 수 있다. 예를 들어, 상기 복수의 인공 지능 모델들 중 일부는, 지정된 기간 내 특정 요일 에 대한 학습 정보에 기반하여 학습될 수 있다. 예를 들어, 상기 복수의 인공 지능 모델들 중 나머지 일부는, 지정된 기간 내 특정 시간(예: 0~8시, 8~16시, 또는 16~24시)에 대한 학습 정보에 기반하여 학습될 수 있 다. 또는, 상기 복수의 인공 지능 모델들은, 위치적 조건(예: 서비스 지역)을 고려하여 학습될 수 있다. 또한, 도 5b에서 예시하는 시간적 길이는, 설명의 편의를 위한 예시적인 것에 불과하며, 본 개시의 실시예가 이 에 제한되는 것은 아니다. 예를 들어, 지정된 기간의 시간적 길이는 다른 길이를 가질 수 있다. 예를 들어, 하나의 시퀀스의 시간적 길이는 다른 길이를 가질 수 있다. 예를 들어, 하나의 시퀀스 내 제1 시간 영역 및 제2 시간 영역의 시간적 길이는 다른 길이를 가질 수 있다. 예를 들어, 하나의 시간 구간의 시간적 길이는 다른 길이를 가질 수 있다. 또한, 지정된 기간 내 상기 제1 부분 및 상기 제2 부분은 서로 다른 비율로 식 별될 수 있다. 도 6은 복수의 파라미터들 사이의 비율에 기반하여 부하 가중치(load weight)를 식별하는 방법에 대한 예들을 도시한다. 상기 복수의 파라미터들은, NWDAF가 제2 NF로부터 획득한 데이터(또는 부하 정보)에 포함되는 파라미 터들을 나타낼 수 있다. 도 6의 상기 부하 정보는, 하나의 시간 구간(예: 도 5b의 시간 구간(570-1))에 대한 부 하 정보를 나타낼 수 있다. 다시 말해서, 상기 부하 정보는, 하나의 수집 구간 동안 수집된 데이터를 나타낼 수 있다. 도 6의 방법은, 도 4의 NWDAF에 의해 수행될 수 있다. 도 6에서는, NWDAF에 의해 수행되는 동작을 예 시로 서술되나, 본 개시의 실시예가 이에 제한되는 것은 아니다. 예를 들어, NWDAF를 포함하는 제1 NF에 의해 수행될 수도 있다. 도 6가 상기 부하 정보가 포함하는 복수의 파라미터들에 기반하여 부하 가중치를 식별하는 예들(601, 602, 60 3)을 도시된다. 예를 들어, 상기 복수의 파라미터들은, CPU 부하, 트래픽, PDU 세션 수, 또는 IP 풀을 포함할 수 있다. 상기 부하 가중치는, 상기 복수의 파라미터들 각각에 대하여 스코어링(scoring) 된 변환 값들 및 상기 복수의 파라미터들 사이의 비율에 기반하여 계산되는 값의 합(summation)을 나타낼 수 있 다. 상기 변환 값들 각각은, 상기 복수의 파라미터들 사이의 비교가 가능하도록 변환된(scaled) 수를 나타낼 수 있다. 예를 들어, 상기 변환 값들 각각은 0 내지 100 사이의 값일 수 있다. 예를 들어, 상기 CPU 부하의 크기는 상기 PDU 세션 수와 스케일링이 상이하여 대소를 비교하기 어렵기 때문에, 상기 복수의 파라미터들 각각은 변환 값으로 변환될 수 있다. 예를 참조하면, 복수의 파라미터들(610, 620, 630) 사이의 비율은 1:1:1로 구성될 수 있다. 예를 들어, 상 기 부하 가중치는, 복수의 파라미터들(610, 620, 630) 각각을 동일한 비율로 반영한 값에 기반하여 식별될 수 있다. 예를 들어, CPU 부하의 변환 값이 10, 트래픽의 변환 값이 20, PDU 세션 수의 변환 값이 30인 경우를 가정한다. 예의 상기 부하 가중치는, 20(=10*1/3+20*1/3+30*1/3)일 수 있다. 예를 참조하면, 복수의 파라미터들(610, 620, 630) 사이의 비율은 2:3:4로 구성될 수 있다. 예를 들어, 상 기 부하 가중치는, 복수의 파라미터들(610, 620, 630) 각각을 서로 상이한 비율로 반영한 값에 기반하여 식별될 수 있다. 예를 들어, CPU 부하의 변환 값이 10, 트래픽의 변환 값이 20, PDU 세션 수의 변환 값이 30인 경우를 가정한다. 예의 상기 부하 가중치는, 약 22.2(=10*2/9+20*3/9+30*4/9)일 수 있다. 예를 참조하면, 복수의 파라미터들(610, 620, 630, 640) 사이의 비율은 1:1:1:1로 구성될 수 있다. 예를 들어, 상기 부하 가중치는, 복수의 파라미터들(610, 620, 630, 640) 각각을 서로 동일한 비율로 반영한 값에 기 반하여 식별될 수 있다. 예를 들어, CPU 부하의 변환 값이 10, 트래픽의 변환 값이 20, PDU 세션 수 의 변환 값이 30, 및 IP 풀의 변환 값이 40인 경우를 가정한다. 예의 상기 부하 가중치는, 25(=10*1/4+20*1/4+30*1/4+40*1/4)일 수 있다. 상술한 바를 참조하면, NWDAF는 획득된 부하 정보에 기반하여, 상기 부하 정보와 관련된 NF(즉, 대상 NF) 의 부하 상태를 나타내는 부하 가중치를 식별할 수 있다. 예를 들어, NWDAF는, 가장 최근 수집된 부하 정 보에 기반하여, 상기 부하 정보와 관련된 NF의 현재 부하 상태를 식별할 수 있다. 예를 들어, 상기 가장 최근 수집된 부하 정보는, 도 5b의 현재 시점 또는 현재 시점에 가장 가까운 시간 구간 동안 획득된 부하 정보를 나타낼 수 있다. 만약, NWDAF가 포함하는 인공 지능 모델(예: 인공 지능 모델)의 예측 정확도 가 높은 경우, 가장 최근 수집된 부하 정보 뿐만 아니라, 예측된 부하 정보(또는, 예측 부하 정보)를 고려하여 NF의 부하 상태를 식별할 수 있다. 다시 말해서, 현재 부하 정보 및 예측 부하 정보에 기반하여 상기 NF의 부하 상태를 식별하고, 복수의 NF들 중 하나의 NF를 선택함으로써, 보다 효율적인 로드 밸런싱이 수행될 수 있다. 상 기 예측 정확도에 기반하여, 예측 부하 정보를 이용하는 방법은, 이하 도 7에서 구체적으로 서술된다. 도 7은 부하 정보 및 예측 부하 정보에 기반하여 복수의 NF들의 각 NF의 부하를 식별하는 방법의 예를 도시한다. 상기 부하 정보는, NWDAF가 가장 최근 수집한 부하 정보를 나타낼 수 있다. 예를 들어, 상기 가장 최근 수 집한 부하 정보는, 도 5b의 현재 시점 또는 현재 시점에 가장 가까운 시간 구간 동안 획득된 부하 정 보를 나타낼 수 있다. 예를 들어, 상기 하나의 시간 구간은, 도 5b의 시퀀스(540-n)에 포함되는 마지막 시간 구 간을 나타낼 수 있다. 상기 예측 부하 정보는, 상기 예측 부하 정보는, 상기 부하 정보에 기반하여, NWDAF(40 0)가 포함하는 인공 지능 모델을 이용하여 예측된 부하 정보를 나타낼 수 있다. 도 7의 방법은, 도 4의 NWDAF에 의해 수행될 수 있다. 도 7에서는, NWDAF에 의해 수행되는 동작을 예 시로 서술되나, 본 개시의 실시예가 이에 제한되는 것은 아니다. 예를 들어, NWDAF를 포함하는 제1NF에 의해 수행될 수도 있다. 도 7은 인공 지능 모델의 예측 정확도(또는 정확도)에 따라 부하 정보 및 예측 부하 정보에 기 반하여 NF의 부하를 식별하는 예를 도시한다. 예를 들어, 부하 정보 및 예측 부하 정보 각각이 포함하는 복수의 파라미터들은, CPU 부하, 트래픽, 드랍 패킷, 및 PDU 세션 수를 포함할 수 있다. 인공 지능 모델의 상기 예측 정확도를 측정하는 것은, 지정된 기간 동안 수집된 부하 정보에 기반하여 수 행될 수 있다. 예측 정확도와 관련하여 도 5b가 참조될 수 있다. 도 5b를 참조하면, 상기 예측 정확도는 지정된 기간 동안 수집된 부하 정보 중 인공 지능 모델을 학 습하기 위해 이용되는 상기 제1 부분과 다른 상기 제2 부분에 기반하여 식별될 수 있다. 예를 들어, 지정된 기 간 동안 수집된 부하 정보 중 상기 제1 부분에 기반하여 인공 지능 모델은 학습될 수 있다. 학습된 인공 지능 모델의 상기 예측 정확도는, 상기 제2 부분에 기반하여 식별될 수 있다. 상기 제2 부분은, 인공 지능 모델에 대하여 학습되지 않은 정보인 바, 알지 못하는 부하 정보를 나타낼 수 있다. 예를 들어, NWDAF는, 상기 제2 부분에 포함되는 시퀀스들 각각을 이용하여, 인공 지능 모델의 상기 예측 정확도를 식별할 수 있다. 예를 들어, NWDAF는, 상기 제2 부분에 포함되는 시퀀스(540-n)에 기반하여, 상기 예측 정확도를 식별할 수 있다. 예를 들어, 인공 지능 모델은, 시퀀스(540-n)의 제1 시간 영역의 부하 정보에 기반하여, 제2 시간 영역의 부하 정보를 예측할 수 있다. 제1 시간 영역 내 부하 정보에 기반하여 예측된 부하 정보와, 제2 시간 영역의 부하 정보(실제 획득된 부하 정보) 사이의 차 이가 임계값 이상인 경우, NWDAF는 상기 예측 정확도가 낮은 것으로 식별할 수 있다. 이와 달리, 상기 차 이가 상기 임계값 미만인 경우, NWDAF는 상기 예측 정확도가 높은 것으로 식별할 수 있다. 예를 들어, 상 기 임계값은, NF를 이용하여 제공할 서비스, 또는, 상기 NF의 유형에 기반하여 설정될 수 있다. 상기 NF는 대상 NF로 참조될 수 있다. 예를 들어, 상기 NF는 도 4의 제2 NF를 포함할 수 있다. 예를 들어, 상기 NF가 제공 하는 상기 서비스, NF의 유형이 부하에 민감한 경우, 상기 임계값은 작아질 수 있다. 예를 들어, 상기 임계값은 10%일 수 있다. 또한, 상기 차이가 10%인 것은, 상기 예측 정확도가 90%인 것으로 이해될 수 있다. 상기 예에서는, 인공 지능 모델이 상기 복수의 파라미터들을 포함하는 제1 시간 영역의 부하 정보에 기반하여 예측된 부하 정보와 제2 시간 영역의 부하 정보 사이를 비교하는 예로 설명하였으나, 본 개시의 실시예가 이에 제한되는 것은 아니다. 예를 들어, NWDAF은 인공 지능 모델을 이용하여, 제1 시간 영 역의 부하 정보(제1 세트의 부하 정보)에 기반하여 기준 시점 이후를 위한 제1 부하 값을 식별할 수 있다. 또한, NWDAF는, 제2 시간 영역의 부하 정보(제2 세트의 부하 정보)에 기반하여 제2 부하 값을 식별할 수 있다. NWDAF는 인공 상기 제1 부하 값과 상기 제2 부하 값을 비교함으로써, 인공 지능 모델 의 예측 정확도를 식별할 수 있다. 예를 들어, 상기 제1 부하 값과 상기 제2 부하 값 사이의 차이가 상기 임계값 이상인지 여부를 식별할 수 있다. 상기 제1 부하 값 및 상기 제2 부하 값을 계산하는 방법은, 이하 도 6 의 부하 가중치를 계산하는 방법과 실질적으로 동일하게 이해될 수 있다. 또한, 상기 예에서는, 하나의 시퀀스(540-n) 내 부하 정보에 기반하여 상기 제1 부하 값 및 상기 제2 부하 값을 계산하는 예가 서술되나, 이는 설명의 편의를 위한 예시적인 것에 불과할 뿐, 본 개시의 실시예가 이에 제한되 는 것은 아니다. 예를 들어, NWDAF는, 지정된 기간 내 상기 제2 부분에 포함되는 시퀀스들 각각에 대 하여 상기 제1 부하 값 및 상기 제2 부하 값의 차이를 식별하고, 상기 시퀀스들 전체의 상기 차이에 대한 평균 값과 상기 임계값을 비교할 수도 있다. 예를 들어, 상기 차이가 상기 임계값 이상인 경우, 인공 지능 모델의 상기 예측 정확도가 떨어지는 상황인 바, NWDAF는 부하 정보만 이용하여, 복수의 NF들의 각 NF의 부하를 식별할 수 있다. 상기 복수의 NF 들은 대상 NF들을 포함할 수 있다. 예를 들어, 상기 복수의 NF들은 도 4의 제2 NF를 포함할 수 있다. 부하 정보를 이용하여 상기 각 NF의 부하를 식별하는 것은, 도 6에서 서술된 부하 가중치를 식별하는 것을 포함 할 수 있다. 예를 들어, 상기 차이가 상기 임계값 미만인 경우, 인공 지능 모델의 상기 예측 정확도가 높은 상황인 바, NWDAF는 부하 정보 및 예측 부하 정보를 모두 이용하여, 복수의 NF들의 각 NF의 부하를 식별할 수 있다. 부하 정보 및 예측 부하 정보를 이용하여 상기 각 NF의 부하를 식별하는 것은, 도 6에서 서 술된 부하 가중치를 식별하는 것을 포함할 수 있다. 상기 각 NF의 부하를 식별함에 있어서, 이용되는 부하 정보 및 예측 부하 정보 사이의 적용 비율 (ratio)은, 상기 차이의 크기에 기반하여 식별될 수 있다. 예를 들어, 상기 적용 비율은 50% 내지 100%의 값이고, 상기 임계값이 10%인 경우가 가정된다. 예를 들어, 상기 차이가 5%인 경우, 상기 적용 비율은 75%일 수 있 다. 예를 들어, 상기 차이가 0%인 경우, 상기 적용 비율은 100%일 수 있다. 상기 적용 비율은, 예측 부하 정보 가 상기 NF의 부하를 식별함에 있어서 이용되는 비율을 나타낼 수 있다. 다시 말해서, 상기 적용 비율이 75%인 경우, 부하 정보가 25%, 예측 부하 정보가 75% 이용될 수 있다. 상기 적용 비율에 기반하여, 상기 복수의 NF들 중 각 NF의 부하가 식별될 수 있다. 상기 각 NF의 부하는, 상기 각 NF의 부하 가중치를 식별하는 것과 실질적으로 동일하게 이해될 수 있다. 예를 들어, 상기 복수의 NF들 중 부하 정보 및 예측 부하 정보와 관련된 NF에 대하여, 부하 정보에 대한 부하 가중치를 제1 부하 가중치로, 예측 부하 정보에 대한 부하 가중치를 제2 부하 가중치로, 상기 적용 비율이 75%인 경우로 가정 한다. 상기 NF의 부하(또는, 상기 NF의 부하 가중치)는, 상기 제1 부하 가중치, 상기 제2 부하 가중치, 및 상기 적용 비율에 기반하여 식별될 수 있다. 예를 들어, 상기 NF의 부하는, 상기 제1 부하 가중치*1/4+상기 제2 부하 가중치*3/4로 식별될 수 있다. 상기의 예에서는, 상기 복수의 NF들 중 하나의 NF에 대한 부하를 식별하는 예를 서술하였으나, NWDAF는 상기 복수의 NF들 각각에 대한 부하를 상술한 방법을 통해 식별할 수 있다. 도 7의 예에서는 하나의 인공 지능 모델의 상기 예측 정확도를 식별하는 경우가 서술되나, 본 개시의 실시 예가 이에 제한되는 것은 아니다. 도 5b에서 서술한 바와 같이, NWDAF는 복수의 인공 지능 모델들을 포함 할 수 있고, 상기 복수의 인공 지능 모델들을 학습할 수 있다. 도 7에서 서술된 바와 같이, NWDAF는 상기 복수의 인공 지능 모델들 각각에 대하여 예측 정확도를 식별할 수 있다. NWDAF는, 상기 복수의 인공 지능 모델들 중 예측 정확도가 가장 높은(즉, 상기 차이가 가장 작은 값을 갖는) 인공 지능 모델을 식별할 수 있다. NWDAF는, 상기 예측 정확도가 가장 높은 인공 지능 모델을 이용하여, 상기 복수의 NF들 각각에 대한 부하 (또는 부하 가중치)를 식별할 수 있다. 또한, NWDAF가 상기 복수의 인공 지능 모델들을 포함하는 경우, 상기 예측 정확도에 기반하여, 일부 인공 지능 모델들을 상기 복수의 NF들 각각에 대한 부하(또는 부하 가중치)를 식별하기 위하여 이용하지 않을 수 있 다. 예를 들어, NWDAF는, 상기 복수의 인공 지능 모델들 각각에 대하여 식별된 예측 정확도가 상기 임계값 과 다른 임계값 이상인지 여부를 식별할 수 있다. 예를 들어, 상기 예측 정확도가 상기 다른 임계값 이상인 경 우, 상기 예측 정확도를 갖는 인공 지능 모델의 예측 부하 정보는, 다른 인공 지능 모델들의 예측 부하 정보에 기반하여 보정되거나, 상기 부하를 식별하기 위한 값으로 이용되지 않을 수 있다. 이는, 상기 예측 정확도를 측 정하기 위한 부하 정보의 복수의 파라미터들은 일반적으로 선형적으로 증가하거나 감소하기 때문이다. 따라서, 시간에 따라 비선형적으로(또는 급격하게) 변경된 값을 갖는 예측 부하 정보를 식별하는 경우, NWDAF는 인 공 지능 모델의 결함으로 식별할 수 있다. NWDAF는 상기 복수의 NF들에 대한 부하를 식별함에 있어서, 상 기 결합이 식별된 인공 지능 모델을 제외할 수 있다. 상술한 바를 참조하면, 본 개시의 실시예에 따른 장치 및 방법은, 인공 지능 모델을 이용하여 수집된 데이터(부 하 정보)에 기반하여 데이터(예측 부하 정보)를 예측할 수 있다. 본 개시의 실시예에 따른 장치 및 방법은, 상 기 수집된 데이터를 인공 지능 모델을 이용하여 처리하거나, 인공 지능 모델에 입력으로 적용할 데이터를 처리 하거나, 또는 복수의 인공 지능 모델들을 이용함으로써, 예측 부하 정보의 정확도 및 예측 부하 정보를 계산하 는 안정성을 증가시킬 수 있다. 도 8은 NF 별 부하에 기반하여, 복수의 NF들 중 NF를 선택하는 방법의 예를 도시한다. 상기 NF 별 부하는, NWDAF가 식별한 복수의 NF들의 각 NF의 부하(또는 부하 가중치)를 나타낼 수 있다. 상 기 복수의 NF들은 대상 NF들을 포함할 수 있다. 도 8은, NWDAF가 식별한 상기 NF 별 부하에 기반하여, SMF가 복수의 UPF들 중 UPF를 선택하는 방법의 예가 도시된다. 복수의 UPF들은 하나의 UPF 그룹(group)으로 참조될 수 있다. 예를 들어, SMF(81 0)는 도 4의 제1 NF의 일 예를 나타낼 수 있다. 예를 들어, UPF들 각각은 도 4의 제2 NF의 일 예를 나타낼 수 있다. 도 8의 방법은, NWDAF로부터 획득된 상기 NF 별 부하에 기반하여, SMF에 의해 수행될 수 있다. 도 8을 참조하면, SMF는, 신규로 유입된 호(call)의 수가 10개임을 식별할 수 있다. SMF는, NWDAF로부터 획득된 상기 NF 별 부하에 기반하여, 상기 10개의 호들을 위한 복수의 UPF들 중 하나의 UPF를 식별할 수 있다. 예를 들어, 상기 NF 별 부하는, 제1 UPF(820-1)의 부하 가중치, 제2 UPF(820-2)의 부하 가중치, 제3 UPF(820-3)의 부하 가중치를 포함할 수 있다. 예를 들어, 제1 UPF(820-1)의 부하 가중치는 25일 수있다. 예를 들어, 제2 UPF(820-2)의 부하 가중치는 25일 수 있다. 예를 들어, 제3 UPF(820-3)의 부하 가중치는 50일 수 있다. SMF는, 복수의 UPF들에 대한 부하 가중치들에 기반하여, 각 UPF의 부하 용량(load capability)을 식 별할 수 있다. 상기 부하 용량은, 복수의 UPF들의 부하 가중치들의 합을 대상 UPF의 부하 가중치로 나눈 값을 나타낼 수 있다. 예를 들어, 제1 UPF(820-1)의 부하 용량은, 4(=(25+25+50)/25)일 수 있다. 예를 들어, 제2 UPF(820-2)의 부하 용량은, 4(=(25+25+50)/25)일 수 있다. 예를 들어, 제3 UPF(820-3)의 부하 용량은, 2(=(25+25+50)/50)일 수 있다. 상기 부하 용량이 커질수록, 더 적은 수의 호가 할당될 수 있다. 예를 들어, SMF는 제1 UPF(820-1)에게 10개 중 4개의 호를 할당할 수 있다. 예를 들어, SMF는 제2 UPF(820-2)에 게 10개 중 4개의 호를 할당할 수 있다. 예를 들어, SMF는 제3 UPF(820-3)에게 10개 중 2개의 호를 할당할 수 있다. 도 8의 예에서는 설명의 편의를 위하여, 10개의 호들 중 특정 개수의 호를 특정 UPF에 할당하는 방식을 예시로 서술하였으나, 본 개시의 실시예가 이에 제한되는 것은 아니다. 예를 들어, SMF는 상기 부하 용량에 따른 확률에 기반하여, 호들을 UPF들에게 비율적으로 할당할 수 있다. 도 8의 예에서는, 설명의 편의를 위하여 한 번에 10개의 호들이 발생된 경우를 예로 도시하였으나, 본 개시의 실시예가 이에 제한되는 것은 아니다. 예를 들어, 하나의 호가 발생되거나 복수의 호들이 순차적으로 발생된 경 우, SMF는 복수의 UPF들에 대한 부하 가중치에 기반하여 부하 용량을 식별하고, 식별된 부하 용량에 기반하여 복수의 UPF들 중 하나의 UPF를 선택할 수 있다. 또는, 10개의 호들이 한 번에 발생된 경우에도, SMF는 10개의 호들 각각에 대하여 할당할 하나의 UPF를 식별할 수도 있다. 상술한 바를 참조하면, 본 개시의 실시예에 따른 장치 및 방법은, 부하 정보에 기반하여, NF(예: SMF)가 상기 NF와 연결된 복수의 NF들 중 대상 NF(예: UPF)를 선택할 수 있다. 이에 따라, 본 개시의 실시예에 따른 장 치 및 방법은, 상기 복수의 NF들에 대한 로드 밸런싱을 수행할 수 있다. 도 9는 인공 지능 모델의 예측 정확도에 기반하여 NF 선택을 수행하는 방법에 대한 동작 흐름의 예를 도시한다. 도 9의 방법은, 도 4의 NWDAF를 포함하는 제1 NF에 의해 수행되는 동작을 예시한다. 예를 들어, 제1 NF는 SMF 또는 AMF를 포함할 수 있다. 도 9를 참조하면, 동작에서, 제1 NF는 제1 시간 구간에서 복수의 제2 NF들의 각 NF의 부하를 나타내 기 위한 부하 정보를 획득할 수 있다. 예를 들어, 제1 NF는, 상기 부하 정보를 상기 복수의 제2 NF들 각각 으로부터 수집할(collect) 수 있다. 예를 들어, 상기 제1 시간 구간은, 현재 시점(예: 도 5b의 현재 시점(53 1))으로부터 지정된 길이의 시간을 포함할 수 있다. 예를 들어, 상기 제1 시간 구간에 대한 상기 부하 정보는, 가장 최근 수집된 부하 정보를 나타낼 수 있다. 예를 들어, 상기 부하 정보는, 복수의 제2 NF들의 각 NF의 부하를 나타내기 위한 정보를 나타낼 수 있다. 예를 들어, 상기 복수의 제2 NF들 각각은 도 4의 제2 NF의 예를 나타낼 수 있다. 예를 들어, 상기 제2 NF들 각 각은 UPF 또는 SMF를 포함할 수 있다. 상기 부하 정보는, 제2 NF의 부하를 식별하기 위한 정보를 포함할 수 있다. 상기 부하를 식별하기 위한 정보는 복수의 파라미터들을 포함할 수 있다. 예를 들어, 상기 부하 정보는, 제2 NF가 제공하는 서비스와 관련된 요소(factor), 사용자 평면(user plane) 요소, 및 제어 평면(control plane) 요소를 포함할 수 있다. 예를 들어, 상기 복수의 파라미터들은, 상 기 서비스와 관련된 요소, 상기 사용자 평면 요소, 또는 상기 제어 평면 요소 중 적어도 하나를 포함할 수 있다. 예를 들어, 상기 서비스와 관련된 요소는, 제2 NF와 관련된 단말(user equipment)의 수, PDU(protocol data unit) 세션(session)의 수, 또는 QoS(quality of service) 플로우(flow)의 수 중 적어도 하나를 포함할 수 있다. 예를 들어, 상기 제2 NF와 관련된 단말의 수는, 제2 NF가 서비스 가능한 단말의 최대 수 또 는 제2 NF가 서비스를 제공하고 있는 단말의 수를 포함할 수 있다. 예를 들어, 상기 PDU 세션의 수 및 상 기 QoS 플로우의 수는, 제2 NF가 서비스를 제공하는 PDU 세션 및 QoS 플로우의 수를 나타낼 수 있다. 또한, 예를 들어, 상기 서비스와 관련된 요소는, 제2 NF의 CPU(central processing unit), 메모리 (memory), 또는 디스크(disk)의 부하를 나타내는 정보 중 적어도 하나를 포함할 수 있다. 예를 들어, 상기 사용자 평면 요소는, 트래픽(traffic), 패킷 드랍률(packet drop rate), 또는 IP(internet protocol) 풀(pool) 사용량 중 적어도 하나를 포함할 수 있다. 예를 들어, 상기 트래픽은, 단위 시간 동안 사용 된 트래픽의 양 및 최대로 서비스 가능한 트래픽의 성능 용량 정보를 포함할 수 있다. 상기 패킷 드랍률은, 데 이터 송수신에 실패하여, 드랍된 패킷의 수 및 크기(size)를 포함할 수 있다. 상기 패킷 드랍률은, 드랍 패킷 (drop packet)으로 참조될 수 있다. 예를 들어, 상기 IP 풀 사용량은, IP 풀 내에서 특정 단말에게 할당된 IP의 수(또는 사용량)을 포함할 수 있다. 예를 들어, 상기 제어 평면 요소는, TPS(transaction per second) 또는 호(call)에 대한 정보를 포함할 수 있 다. 상기 TPS는, 단위 시간(초) 단 메시지의 수를 포함할 수 있다. 상기 호에 대한 정보는, 호 절차(call procedure)에 따라 시도(attempt), 성공(success), 실패(fail) 및 실패 이유(cause)에 대한 정보를 포함할 수 있다. 상기 부하 정보에 포함되는 복수의 파라미터들은, 제2 NF에 기반하여 식별될 수 있다. 예를 들어, 상기 복 수의 파라미터들은, 제2 NF의 기능(function) 또는 역할(role)에 기반하여 식별될 수 있다. 예를 들어, 제1 NF는 제2 NF로부터 주기적으로 상기 부하 정보를 획득할 수 있다. 예를 들어, 제1 NF는 지정된 길이의 주기 마다 상기 부하 정보를 획득할 수 있다. 예를 들어, 상기 지정된 길이는, 5분일 수 있다. 다만, 본 개시의 실시예가 이에 제한되는 것은 아니다. 동작에서, 제1 NF는 복수의 시간 구간들 중에서 기준 시점(reference timing) 이전의 제1 세트의 부 하 정보에 기반하여, 제1 부하 값을 식별할 수 있다. 예를 들어, 제1 NF는 상기 복수의 시간 구간들 중에 서 상기 기준 시점 이전의 상기 제1 세트의 부하 정보에 기반하여, 상기 제1 부하 값을 식별할 수 있다. 예를 들어, 상기 제1 부하 값은, 상기 상기 제1 세트의 부하 정보에 기반하여, 인공 지능 모델(예: 도 5a의 인공 지 능 모델)을 이용하여 예측된 값일 수 있다. 예를 들어, 상기 복수의 시간 구간들은 6시간일 수 있다. 예를 들어, 제1 NF는 하나의 시퀀스를 구성하는 상기 복수의 시간 구간들 중에서 기준 시점 이전의 상기 제1 세트의 부하 정보를 식별할 수 있다. 예를 들어, 제1 NF는, 제1 NF가 포함하는 인공 지능 모델 (예: 도 5a의 인공 지능 모델)을 이용하여, 상기 제1 세트의 부하 정보에 기반하여 상기 기준 시점 이후에 대하여 예측된 정보인 상기 제1 부하 값을 식별할 수 있다. 예를 들어, 상기 제1 부하 값은, 상기 기준 시점 이 전의 부하 정보인 상기 제1 세트의 부하 정보에 기반하여, 상기 기준 시점 이후에 대하여 예측되는 부하 정보에 기반하여 식별되는 값을 나타낼 수 있다. 예를 들어, 상기 제1 부하 값은, 도 6에서 서술된 부하 가중치를 계산 하는 방법과 실질적으로 동일한 방법을 통해 계산될 수 있다. 동작에서, 제1 NF는 상기 복수의 시간 구간들 중에서 상기 기준 시점 이후의 제2 세트의 부하 정보에 기반하여 식별된 제2 부하 값 및 제1 부하 값 사이의 차이가 임계값 이상인지 여부를 식별할 수 있다. 예를 들 어, 상기 제2 부하 값은, 상기 제2 세트의 부하 정보에 기반하여 식별되는 값을 나타낼 수 있다. 예를 들어, 상 기 제2 부하 값은, 도 6에서 서술된 부하 가중치를 계산하는 방법과 실질적으로 동일한 방법을 통해 계산될 수 있다. 예를 들어, 제1 NF는 상기 제1 부하 값과 상기 제2 부하 값 사이의 상기 차이에 기반하여, 제1 NF가 포함하는 상기 인공 지능 모델의 예측 정확도를 식별할 수 있다. 예를 들어, 제1 NF는 상기 차이가 상기 임계값 이상인 경우, 상기 인공 지능 모델의 예측 정확도가 비교적 낮은 것으로 식별할 수 있다. 예를 들어, 제 1 NF는 상기 차이가 상기 임계값 미만인 경우, 상기 인공 지능 모델의 예측 정확도가 비교적 높은 것으로 식별할 수 있다. 동작에서, 상기 차이가 상기 임계값 이상임을 식별하는 경우, 제1 NF는 동작을 수행할 수 있다. 이와 달리, 동작에서, 상기 차이가 상기 임계값 미만임을 식별하는 경우, 제1 NF는 동작을 수행 할 수 있다. 동작에서, 제1 NF는 상기 부하 정보에 기반하여, 상기 복수의 제2 NF들 중에서 제2 NF를 선택할 수 있다. 예를 들어, 제1 NF는, 동작에서 획득된 상기 제1 시간 구간에 대한 상기 부하 정보에 기반하여, 제1 부하 가중치를 식별할 수 있다. 예를 들어, 상기 제1 부하 가중치는, 상기 부하 정보가 포함하는 복수의 파라미터들 및 상기 복수의 파라미터들 사이의 비율에 기반하여 식별될 수 있다. 예를 들어, 제1 NF는, 상기 복수의 제2 NF들 각각에 대한 제1 부하 가중치를 식별할 수 있다. 예를 들어, 제1 NF는, 상기 복수의 제2 NF들 각각에 대한 제1 부하 가중치에 기반하여, 상기 복수의 제2 NF들에 대한 부하 용량 (capability)을 식별할 수 있다. 예를 들어, 제1 NF는, 상기 복수의 제2 NF들에 대한 부하 용량에 기반하 여, 상기 복수의 제2 NF들 중 하나의 제2 NF를 선택할 수 있다.동작에서, 제1 NF는, 상기 제1 시간 구간 다음의 제2 시간 구간에서 상기 복수의 제2 NF들의 각 NF의 부하를 나타내기 위한 예측 부하 정보를 획득하고, 상기 부하 정보 및 상기 예측 부하 정보에 기반하여 상기 복 수의 제2 NF들 중에서 제2 NF를 선택할 수 있다. 예를 들어, 제1 NF는, 상기 제1 시간 구간에 대한 상기 부하 정보에 기반하여, 상기 인공 지능 모델을 이 용하여 상기 제2 시간 구간에 대한 상기 예측 부하 정보를 획득할 수 있다. 예를 들어, 제1 NF는, 상기 제 1 시간 구간에 대한 상기 부하 정보에 기반하여, 상기 제1 부하 가중치를 식별할 수 있다. 예를 들어, 제2 NF는 상기 예측 부하 정보에 기반하여, 제2 부하 가중치를 식별할 수 있다. 예를 들어, 상기 제2 부하 가 중치는, 상기 예측 부하 정보가 포함하는 복수의 파라미터들 및 상기 복수의 파라미터들 사이의 비율에 기반하 여, 식별될 수 있다. 예를 들어, 제1 NF는, 상기 제1 부하 값 및 상기 제2 부하 값 사이의 상기 차이의 크기에 기반하여, 상기 부하 정보 및 상기 예측 부하 정보 사이의 적용 비율을 식별할 수 있다. 예를 들어, 상기 적용 비율은 50% 내지 100%이고, 상기 임계값이 10%인 경우가 가정된다. 예를 들어, 상기 차이가 5%인 경우, 상기 적용 비율은 75%일 수 있다. 예를 들어, 상기 차이가 0%인 경우, 상기 적용 비율은 100%일 수 있다. 상기 적용 비율은, 상기 예측 부하 정보가 상기 제2 NF의 부하를 식별함에 있어서 이용되는 비율을 나타낼 수 있다. 다시 말해서, 상기 적용 비율이 75%인 경우, 상기 부하 정보가 25%, 상기 예측 부하 정보가 75% 이용될 수 있다. 예를 들어, 제1 NF는, 상기 복수의 제2 NF들 각각에 대한 상기 제1 부하 가중치, 상기 제2 부하 가중치, 및 상기 적용 비율에 기반하여, 상기 복수의 제2 NF들에 대한 부하 용량을 식별할 수 있다. 예를 들어, 제1 NF는, 상기 복수의 제2 NF들에 대한 부하 용량에 기반하여, 상기 복수의 제2 NF들 중 하나의 제2 NF를 선 택할 수 있다. 설명의 편의를 위하여, 도 9에서는 제1 NF가 수행하는 동작들의 예시로 서술되었으나, 본 개시의 실시예가 이에 제한되는 것은 아니다. 예를 들어, 제1 NF가 포함하는 NWDAF는 부하 정보를 수집하고, 수집된 부하 정보를 처리하고, 처리된 부하 정보에 기반하여 대상 NF(예: 상기 복수의 제2 NF들)의 부하를 식별할 수 있다. 예를 들어, 도 4에서 서술된 바와 같이, NWDAF는, 제1 NF로부터 요청 메시지를 수신함에 응답 하여, 상기 대상 NF의 부하에 대한 정보를 포함하는 응답 메시지를 제1 NF에게 전송할 수 있다. 도 10a 및 도 10b는 시간의 흐름에 따른, 예측된 부하 정보 및 수집된 부하 정보를 나타내는 그래프의 예를 도 시한다. 상기 예측된 부하 정보 및 상기 수집된 부하 정보 각각은, 복수의 파라미터들을 포함할 수 있다. 예를 들어, 상 기 복수의 파라미터들은, 트래픽(traffic) 및 PDU 세션(session)의 수를 포함할 수 있다. 도 10a는, 시간의 흐름에 따라 수집된 트래픽의 수와 인공 지능 모델에 이용하여 예측된 트래픽의 수를 도시하 는 그래프의 예를 도시한다. 그래프의 가로축은 시간(time)(단위: 시간(hour))을, 세로축은 트래픽 의 수를 나타낼 수 있다. 그래프는, 시간의 흐름에 따라 수집된 트래픽의 수를 나타내는 제1 라인 및 예측된 트래픽의 수를 나타내는 제2 라인을 포함할 수 있다. 제1 라인 및 제2 라인을 비 교하면, 제1 라인의 수집된 트래픽 수와 제2 라인의 예측된 트래픽 수 사이의 오차율은, 약 1.45% 일 수 있다. 예를 들어, 상기 오차율은, MAPE(mean absolute percentage error)에 기반하여 계산될 수 있다. 도 10b는, 시간의 흐름에 따라 수집된 PDU 세션의 수와 인공 지능 모델에 이용하여 예측된 PDU 세션의 수를 도 시하는 그래프의 예를 도시한다. 그래프의 가로축은 시간(time)(단위: 시간(hour))을, 세로축은 PDU 세션의 수를 나타낼 수 있다. 그래프는, 시간의 흐름에 따라 수집된 PDU 세션의 수를 나타내는 제1 라인 및 예측된 PDU 세션의 수를 나타내는 제2 라인을 포함할 수 있다. 제1 라인 및 제2 라 인을 비교하면, 제1 라인의 수집된 PDU 세션의 수와 제2 라인의 예측된 PDU 세션의 수 사이 의 오차율은, 약 1.68%일 수 있다. 예를 들어, 상기 오차율은, MAPE에 기반하여 계산될 수 있다. 도 10a 및 도 10b를 참조하면, 본 개시의 실시예에 따른 장치 및 방법은, 지정된 기간(예: 3개월) 동안 수집된 부하 정보와 인공 지능 모델을 이용하여 상기 부하 정보로부터 예측된 부하 정보 사이의 오차율을 낮게 형성할 수 있다. 이에 따라, 상기 인공 지능 모델을 포함하는 NF(예: NWDAF 또는 제1 NF)은 현재 또는 과거 에 수집된 부하 정보에 기반하여, 미래의 부하 정보를 비교적 정확하게 예측할 수 있다. 도 10a 및 도 10b에서 서술된 바와 같이, 낮은 오차율을 갖는 상기 인공 지능 모델을 이용하여 NF 선택을 수행함으로써 로드 밸런싱을수행하는 예는 이하 도 10c에서 구체적으로 서술된다. 도 10c는 시간의 흐름에 따른 대상 NF들의 부하를 나타내는 그래프의 예를 도시한다. 상기 대상 NF들은, 2개의 UPF들을 포함할 수 있다. 이는 설명의 편의를 위하여 2개의 UPF들로 예시하였을 뿐, 본 개시의 실시예가 이에 제한되는 것은 아니다. 예를 들어, 상기 대상 NF들은 3개 이상의 UPF들을 포함할 수 있다. 도 10c는, 시간의 흐름에 따라 2개의 UPF들 사이에서 부하의 비율을 도시하는 그래프의 예를 도시한다. 그래프의 가로축은 시간(time)(단위: 시간(hour))을, 세로축은, 2개의 UPF들에 대하여 할당된 부하의 비 율(단위: 퍼센트(percent))을 나타낸다. 그래프는, 제1 UPF에 대한 부하의 비율을 나타내는 제1 라인 및 제2 UPF에 대한 부하의 비율을 나 타내는 제2 라인을 포함할 수 있다. 제1 라인 및 제2 라인을 참조하면, 시간의 흐름에 따라 상기 2개의 UPF들 중 상기 제1 UPF가 차지하는 부하의 비율이 점차 증가할 수 있고, 상기 제2 UPF가 차지하는 부하의 비율이 점차 감소될 수 있다. 예를 들어, 현재 시점에서, 상기 제1 UPF 및 상기 제2 UPF가 각각 차지하는 부하의 비율은 서로 동일한 비율(즉, 50%)일 수 있다. 본 개시의 실시예에 따른 장치 및 방법은, 현재 시점 및 현재 시점 이전의 시점에 수집한 부하 정 보에 기반하여, 인공 지능 모델을 이용하여 미래의 부하 정보를 예측할 수 있다. 예를 들어, 본 개시의 실시예 에 따른 장치 및 방법은, 수집될 부하 정보가 아닌, 수집된 부하 정보에 기반하여 NF들의 부하를 예측하고, 예 측된 부하에 기반하여 상기 NF들 중에서 특정 NF를 선택할 수 있다. 이에 따라, 본 개시의 실시예에 따른 장치 및 방법은, 선제적인(preemptive) 로드 밸런싱을 수행할 수 있다. 또한, 본 개시의 실시예에 따른 장치 및 방법은, 통신 시스템의 네트워크 환경에 따라 NF들의 부하를 식별하기 위한 파라미터를 달리 설정함으로써, 보다 정교하게 NF 선택을 수행할 수 있다. 예를 들어, 점점 세분화 및 복 잡화되는 5G 통신 시스템의 네트워크 환경에 있어서, 네트워크에 포함되는 NF의 구성이 복잡화될 수 있다. 예를 들어, 2개의 UPF가 하나의 그룹을 형성하는 네트워크 환경은, 3개 이상의 UPF들을 포함할 수 있도록 변경되고 있다. 이에 따라, 본 개시의 실시예에 따른 장치 및 방법을 이용하여 상기 3개 이상의 UPF들에 대한 부하를 식 별하기 위한 파라미터를 설정함으로써, 효과적으로 NF 선택을 수행할 수 있다. 또한, 본 개시의 실시예에 따른 장치 및 방법은, 상술한 바와 같이 세분화 및 복잡화되는 상기 네트워크 환경을 운용하는 사업자가 수동으로 관리하는 것이 아닌, 인공 지능 모델에 기반하여 동적인 운용을 수행할 수 있다. 예를 들어, 본 개시의 실시예에 따른 장치 및 방법은, 실시간 또는 짧은 시간 구간 동안 수집된 데이터(또는 부 하 정보)를 분석함으로써, 변화하는 네트워크 환경을 고려하여 대상 NF들 각각의 부하를 식별할 수 있다. 본 개 시의 실시예에 따른 장치 및 방법을 이용함에 따라, 상기 사업자는, 효율적으로 네트워크를 운용하고 리소스 (resource) 사용을 최소화하고, 네트워크 관리에 이용되는 비용을 줄일 수 있다. 실시예들에 있어서, 제1 NF(network function)에 의해 수행되는 방법은, 제1 시간 구간에서 복수의 제2 NF들의 각 NF의 부하를 나타내기 위한 부하 정보를 획득하는 동작을 포함할 수 있다. 상기 방법은, 복수의 시간 구간들 중에서 기준 시점(timing) 이전의 제1 세트의 부하 정보에 기반하여, 제1 부하 값을 식별하는 동작을 포함할 수 있다. 상기 방법은, 상기 복수의 시간 구간들 중에서 상기 기준 시점 이후의 제2 세트의 부하 정보에 기반하여 식별된 제2 부하 값 및 상기 제1 부하 값 사이의 차이가 임계값 이상인지 여부를 식별하는 동작을 포함할 수 있 다. 상기 방법은, 상기 차이가 상기 임계값 이상인 경우, 상기 부하 정보에 기반하여 상기 복수의 제2 NF들 중 에서 제2 NF를 선택하는 동작을 포함할 수 있다. 상기 방법은, 상기 차이가 임계값 미만인 경우, 상기 제1 시간 구간 다음의 제2 시간 구간에서, 상기 복수의 제2 NF들의 각 NF의 부하를 나타내기 위한 예측 부하 정보를 획득 하는 동작을 포함할 수 있다. 상기 방법은, 상기 부하 정보 및 상기 예측 부하 정보에 기반하여 상기 복수의 제 2 NF들 중에서 상기 제2 NF를 선택하는 동작을 포함할 수 있다. 상기 예측 부하 정보는, 상기 부하 정보에 기반 하여 인공 지능 모델(artificial intelligence model, AI model)을 이용하여 획득될 수 있다. 일 실시예에 따르면, 상기 방법은, 상기 임계값 미만인 상기 차이의 크기에 기반하여, 상기 부하 정보와 상기 예측 부하 정보 사이의 적용 비율(ratio)을 식별하는 동작을 포함할 수 있다. 상기 방법은, 상기 부하 정보, 상 기 예측 부하 정보, 및 상기 적용 비율에 기반하여, 상기 복수의 제2 NF들의 각 NF의 부하를 식별하는 동작을 포함할 수 있다.일 실시예에 따르면, 상기 방법은, 상기 임계값 미만인 상기 차이가 제1 값을 갖는 경우, 상기 적용 비율을 제1 비율 값으로 식별하는 동작을 포함할 수 있다. 상기 방법은, 상기 임계값 미만인 상기 차이가 상기 제1 값보다 작은 제2 값을 갖는 경우, 상기 적용 비율을 상기 제1 비율 값보다 큰 제2 비율 값으로 식별하는 동작을 포함할 수 있다. 상기 적용 비율은, 상기 복수의 제2 NF들의 각 NF의 부하를 식별함에 있어 이용되는 상기 예측 부하 정보의 비율일 수 있다. 일 실시예에 따르면, 상기 방법은, 상기 부하 정보가 포함하는 제1 파라미터들 및 상기 제1 파라미터들 사이의 비율에 기반하여, 제1 부하 가중치를 식별하는 동작을 포함할 수 있다. 상기 방법은, 상기 예측 부하 정보가 포 함하는 제2 파라미터들 및 상기 제2 파라미터들 사이의 비율에 기반하여, 제2 부하 가중치를 식별하는 동작을 포함할 수 있다. 상기 복수의 제2 NF들의 각 NF의 부하는, 상기 제1 부하 가중치, 상기 제2 부하 가중치, 및 상 기 적용 비율에 기반하여 식별될 수 있다. 일 실시예에 따르면, 상기 제1 파라미터들 또는 상기 제2 파라미터들은, 상기 복수의 제2 NF들 각각이 제공하는 서비스와 관련된 요소(factor), 사용자 평면(user plane) 요소, 또는 제어 평면(control plane) 요소 중 적어 도 하나를 포함할 수 있다. 상기 서비스와 관련된 요소는, 상기 복수의 제2 NF들 각각과 관련된 단말(user equipment)의 수, PDU(protocol data unit) 세션(session)의 수, 또는 QoS(quality of service) 플로우(flow) 의 수, 및 상기 복수의 제2 NF들 각각의 CPU(central processing unit), 메모리(memory), 또는 디스크(disk)의 부하를 나타내는 정보를 포함할 수 있다. 일 실시예에 따르면, 상기 사용자 평면 요소는, 트래픽(traffic), 패킷 드랍률(packet drop rate), 또는 IP(internet protocol) 풀(pool) 사용량을 포함할 수 있다. 상기 제어 평면 요소는, TPS(transaction per second), 또는 호(call)에 대한 정보를 포함할 수 있다. 일 실시예에 따르면, 상기 인공지능 모델은 RNN(recurrent neural network)를 포함할 수 있다. 상기 인공지능 모델은, 지정된 기간 동안의 부하 정보 중 제1 부분에 기반하여 학습될 수 있다. 상기 복수의 시간 구간들과 관 련된 상기 제1 세트의 부하 정보 및 상기 제2 세트의 부하 정보는, 상기 지정된 기간 동안의 부하 정보 중 상기 제1 부분과 다른 제2 부분에 포함될 수 있다. 일 실시예에 따르면, 상기 인공 지능 모델은, 복수의 인공 지능 모델들에 포함될 수 있다. 상기 복수의 인공 지 능 모델들 각각은, 상기 제1 부분에 기반하여 학습될 수 있다. 상기 인공 지능 모델은, 상기 복수의 인공 지능 모델들 중 상기 차이의 크기가 최소값을 갖는 모델일 수 있다. 일 실시예에 따르면, 상기 제1 NF는, SMF(session management function)를 포함할 수 있다. 상기 복수의 제2 NF들은, 복수의 UPF(user plane function)들을 포함할 수 있다. 일 실시예에 따르면, 상기 제1 부하 값은, 상기 제1 세트의 부하 정보에 기반하여, 상기 인공 지능 모델을 이용 하여 예측되는 값일 수 있다. 실시예들에 있어서, 제1 NF(network function)를 위한 장치는, 송수신기(transceiver)를 포함할 수 있다. 상기 장치는, 상기 송수신기와 동작적으로 결합된 프로세서(processor)를 포함할 수 있다. 상기 프로세서는, 제1 시 간 구간에서 복수의 제2 NF들의 각 NF의 부하를 나타내기 위한 부하 정보를 획득하도록 구성될 수 있다. 상기 프로세서는, 복수의 시간 구간들 중에서 기준 시점(timing) 이전의 제1 세트의 부하 정보에 기반하여, 제1 부하 값을 식별하도록 구성될 수 있다. 상기 프로세서는, 상기 복수의 시간 구간들 중에서 상기 기준 시점 이후의 제 2 세트의 부하 정보에 기반하여 식별된 제2 부하 값 및 상기 제1 부하 값 사이의 차이가 임계값 이상인지 여부 를 식별하도록 구성될 수 있다. 상기 프로세서는, 상기 차이가 상기 임계값 이상인 경우, 상기 부하 정보에 기 반하여 상기 복수의 제2 NF들 중에서 제2 NF를 선택하도록 구성될 수 있다. 상기 프로세서는, 상기 차이가 임계 값 미만인 경우, 상기 제1 시간 구간 다음의 제2 시간 구간에서, 상기 복수의 제2 NF들의 각 NF의 부하를 나타 내기 위한 예측 부하 정보를 획득하도록 구성될 수 있다. 상기 프로세서는, 상기 부하 정보 및 상기 예측 부하 정보에 기반하여 상기 복수의 제2 NF들 중에서 상기 제2 NF를 선택하도록, 구성될 수 있다. 상기 예측 부하 정 보는, 상기 부하 정보에 기반하여 인공 지능 모델(artificial intelligence model, AI model)을 이용하여 획득 될 수 있다. 일 실시예에 따르면, 상기 프로세서는, 상기 임계값 미만인 상기 차이의 크기에 기반하여, 상기 부하 정보와 상 기 예측 부하 정보 사이의 적용 비율(ratio)을 식별하도록 구성될 수 있다. 상기 프로세서는, 상기 부하 정보, 상기 예측 부하 정보, 및 상기 적용 비율에 기반하여, 상기 복수의 제2 NF들의 각 NF의 부하를 식별하도록, 구 성될 수 있다.일 실시예에 따르면, 상기 프로세서는, 상기 임계값 미만인 상기 차이가 제1 값을 갖는 경우, 상기 적용 비율을 제1 비율 값으로 식별하도록 구성될 수 있다. 상기 프로세서는, 상기 임계값 미만인 상기 차이가 상기 제1 값보 다 작은 제2 값을 갖는 경우, 상기 적용 비율을 상기 제1 비율 값보다 큰 제2 비율 값으로 식별하도록, 구성될 수 있다. 상기 적용 비율은, 상기 복수의 제2 NF들의 각 NF의 부하를 식별함에 있어 이용되는 상기 예측 부하 정보의 비율일 수 있다. 일 실시예에 따르면, 상기 프로세서는, 상기 부하 정보가 포함하는 제1 파라미터들 및 상기 제1 파라미터들 사 이의 비율에 기반하여, 제1 부하 가중치를 식별하도록 구성될 수 있다. 상기 프로세서는, 상기 예측 부하 정보 가 포함하는 제2 파라미터들 및 상기 제2 파라미터들 사이의 비율에 기반하여, 제2 부하 가중치를 식별하도록, 구성될 수 있다. 상기 복수의 제2 NF들의 각 NF의 부하는, 상기 제1 부하 가중치, 상기 제2 부하 가중치, 및 상 기 적용 비율에 기반하여 식별될 수 있다. 일 실시예에 따르면, 상기 제1 파라미터들 또는 상기 제2 파라미터들은, 상기 복수의 제2 NF들 각각이 제공하는 서비스와 관련된 요소(factor), 사용자 평면(user plane) 요소, 또는 제어 평면(control plane) 요소 중 적어 도 하나를 포함할 수 있다. 상기 서비스와 관련된 요소는, 상기 복수의 제2 NF들 각각과 관련된 단말(user equipment)의 수, PDU(protocol data unit) 세션(session)의 수, 또는 QoS(quality of service) 플로우(flow) 의 수, 및 상기 복수의 제2 NF들 각각의 CPU(central processing unit), 메모리(memory), 또는 디스크(disk)의 부하를 나타내는 정보를 포함할 수 있다. 일 실시예에 따르면, 상기 사용자 평면 요소는, 트래픽(traffic), 패킷 드랍률(packet drop rate), 또는 IP(internet protocol) 풀(pool) 사용량을 포함할 수 있다. 상기 제어 평면 요소는, TPS(transaction per second), 또는 호(call)에 대한 정보를 포함할 수 있다. 일 실시예에 따르면, 상기 인공지능 모델은 RNN(recurrent neural network)를 포함할 수 있다. 상기 인공지능 모델은, 지정된 기간 동안의 부하 정보 중 제1 부분에 기반하여 학습될 수 있다. 상기 복수의 시간 구간들과 관 련된 상기 제1 세트의 부하 정보 및 상기 제2 세트의 부하 정보는, 상기 지정된 기간 동안의 부하 정보 중 상기 제1 부분과 다른 제2 부분에 포함될 수 있다. 일 실시예에 따르면, 상기 인공 지능 모델은, 복수의 인공 지능 모델들에 포함될 수 있다. 상기 복수의 인공 지 능 모델들 각각은, 상기 제1 부분에 기반하여 학습될 수 있다. 상기 인공 지능 모델은, 상기 복수의 인공 지능 모델들 중 상기 차이의 크기가 최소값은 갖는 모델일 수 있다. 일 실시예에 따르면, 상기 제1 NF는, SMF(session management function)를 포함할 수 있다. 상기 복수의 제2 NF들은, 복수의 UPF(user plane function)들을 포함할 수 있다. 실시예들에 있어서, NWDAF(network data analytics function)에 의해 수행되는 방법은, 제1 NF로부터, 복수의 제2 NF들 중에서 제2 NF의 선택(selection)을 위한 요청 메시지를 수신하는 동작을 포함할 수 있다. 상기 방법 은, 제1 시간 구간에서 상기 복수의 제2 NF들의 각 NF의 부하를 나타내기 위한 부하 정보를 획득하는 동작을 포 함할 수 있다. 상기 방법은, 복수의 시간 구간들 중에서 기준 시점(timing) 이전의 제1 세트의 부하 정보에 기 반하여, 제1 부하 값을 식별하는 동작을 포함할 수 있다. 상기 방법은, 상기 복수의 시간 구간들 중에서 상기 기준 시점 이후의 제2 세트의 부하 정보에 기반하여 식별된 제2 부하 값 및 상기 제1 부하 값 사이의 차이가 임 계값 이상인지 여부를 식별하는 동작을 포함할 수 있다. 상기 방법은, 상기 차이가 상기 임계값 이상인 경우, 상기 부하 정보를 포함하는 응답 메시지를 생성하는 동작을 포함할 수 있다. 상기 방법은, 상기 차이가 임계값 미만인 경우, 상기 제1 시간 구간 다음의 제2 시간 구간에서, 상기 복수의 제2 NF들의 각 NF의 부하를 나타내기 위한 예측 부하 정보 및 상기 부하 정보를 포함하는 상기 응답 메시지를 생성하는 동작을 포함할 수 있다. 상기 응답 메시지를, 상기 제1 NF에게 전송하는 동작을 포함할 수 있다. 상기 예측 부하 정보는, 상기 부하 정보에 기반하여 인공 지능 모델(artificial intelligence model, AI model)을 이용하여 획득될 수 있다. 실시예들에 있어서, NWDAF(network data analytics function)의 장치는 송수신기(transceiver)를 포함할 수 있 다. 상기 장치는, 상기 송수신기와 동작적으로 결합된 프로세서(processor)를 포함할 수 있다. 상기 프로세서는, 제1 NF로부터, 복수의 제2 NF들 중에서 제2 NF의 선택(selection)을 위한 요청 메시지를 수신하는 동작을 포함할 수 있다. 상기 방법은, 제1 시간 구간에서 상기 복수의 제2 NF들의 각 NF의 부하를 나타내기 위 한 부하 정보를 획득하도록 구성될 수 있다. 상기 프로세서는, 복수의 시간 구간들 중에서 기준 시점(timing) 이전의 제1 세트의 부하 정보에 기반하여, 제1 부하 값을 식별하도록 하도록 구성될 수 있다. 상기 프로세서는, 상기 복수의 시간 구간들 중에서 상기 기준 시점 이후의 제2 세트의 부하 정보에 기반하여 식별된 제2 부하 값및 상기 제1 부하 값 사이의 차이가 임계값 이상인지 여부를 식별하도록 하도록 구성될 수 있다. 상기 프로세서 는, 상기 차이가 상기 임계값 이상인 경우, 상기 부하 정보를 포함하는 응답 메시지를 생성하도록 하도록 구성 될 수 있다. 상기 프로세서는, 상기 차이가 임계값 미만인 경우, 상기 제1 시간 구간 다음의 제2 시간 구간에서, 상기 복수의 제2 NF들의 각 NF의 부하를 나타내기 위한 예측 부하 정보 및 상기 부하 정보를 포함하 는 상기 응답 메시지를 생성하도록 하도록 구성될 수 있다. 상기 응답 메시지를, 상기 제1 NF에게 전송하는 동 작을 포함할 수 있다. 상기 예측 부하 정보는, 상기 부하 정보에 기반하여 인공 지능 모델(artificial intelligence model, AI model)을 이용하여 획득될 수 있다. 본 개시의 청구항 또는 명세서에 기재된 실시예들에 따른 방법들은 하드웨어, 소프트웨어, 또는 하드웨어와 소 프트웨어의 조합의 형태로 구현될(implemented) 수 있다. 소프트웨어로 구현하는 경우, 하나 이상의 프로그램(소프트웨어 모듈)을 저장하는 컴퓨터 판독 가능 저장 매체 가 제공될 수 있다. 컴퓨터 판독 가능 저장 매체에 저장되는 하나 이상의 프로그램은, 전자 장치(device) 내의 하나 이상의 프로세서에 의해 실행 가능하도록 구성된다(configured for execution). 하나 이상의 프로그램은, 전자 장치로 하여금 본 개시의 청구항 또는 명세서에 기재된 실시예들에 따른 방법들을 실행하게 하는 명령어 (instructions)를 포함한다. 이러한 프로그램(소프트웨어 모듈, 소프트웨어)은 랜덤 액세스 메모리 (random access memory), 플래시(flash) 메모리를 포함하는 불휘발성(non-volatile) 메모리, 롬(read only memory, ROM), 전기적 삭제가능 프로그램가 능 롬(electrically erasable programmable read only memory, EEPROM), 자기 디스크 저장 장치(magnetic disc storage device), 컴팩트 디스크 롬(compact disc-ROM, CD-ROM), 디지털 다목적 디스크(digital versatile discs, DVDs) 또는 다른 형태의 광학 저장 장치, 마그네틱 카세트(magnetic cassette)에 저장될 수 있다. 또는, 이들의 일부 또는 전부의 조합으로 구성된 메모리에 저장될 수 있다. 또한, 각각의 구성 메모리는 다수 개 포함될 수도 있다. 또한, 프로그램은 인터넷(Internet), 인트라넷(Intranet), LAN(local area network), WAN(wide area network), 또는 SAN(storage area network)과 같은 통신 네트워크, 또는 이들의 조합으로 구성된 통신 네트워크를 통하여 접근(access)할 수 있는 부착 가능한(attachable) 저장 장치(storage device)에 저장될 수 있다. 이러한 저장 장치는 외부 포트를 통하여 본 개시의 실시예를 수행하는 장치에 접속할 수 있다. 또한, 통신 네트워크상의 별 도의 저장장치가 본 개시의 실시예를 수행하는 장치에 접속할 수도 있다. 상술한 본 개시의 구체적인 실시예들에서, 개시에 포함되는 구성 요소는 제시된 구체적인 실시예에 따라 단수 또는 복수로 표현되었다. 그러나, 단수 또는 복수의 표현은 설명의 편의를 위해 제시한 상황에 적합하게 선택된 것으로서, 본 개시가 단수 또는 복수의 구성 요소에 제한되는 것은 아니며, 복수로 표현된 구성 요소라 하더라 도 단수로 구성되거나, 단수로 표현된 구성 요소라 하더라도 복수로 구성될 수 있다. 한편 본 개시의 상세한 설명에서는 구체적인 실시예에 관해 설명하였으나, 본 개시의 범위에서 벗어나지 않는 한도 내에서 여러 가지 변형이 가능함은 물론이다.도면 도면1 도면2a 도면2b 도면2c 도면3 도면4 도면5a 도면5b 도면6 도면7 도면8 도면9 도면10a 도면10b 도면10c"}
{"patent_id": "10-2023-0038627", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "임시명세서(첨부)공개특허10-2024-0143396 -39-"}
{"patent_id": "10-2023-0038627", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 통신 시스템의 예를 도시한다. 도 2a는 통신 시스템에서 기지국의 기능적 구성의 예를 나타낸다. 도 2b는 통신 시스템에서 단말의 기능적 구성의 예를 나타낸다. 도 2c는 통신 시스템에서 코어 망 엔티티(core network entity)의 기능적 구성의 예를 나타낸다. 도 3은 통신 시스템에서 NF(network function) 선택(selection)의 예를 도시한다. 도 4는 대상(target) NF와 관련된 부하 정보를 수집하는(collect) 방법에 대한 예를 도시한다. 도 5a는 수집된 부하 정보에 기반하여 예측 부하 정보를 획득하는 인공 지능 모델(artificial intelligence model, AI model)의 예를 도시한다. 도 5b는 복수의 시간 구간들의 부하 정보에 기반하여 인공 지능 모델을 학습하는 방법에 대한 예를 도시한다. 도 6은 복수의 파라미터들 사이의 비율에 기반하여 부하 가중치(load weight)를 식별하는 방법에 대한 예들을 도시한다. 도 7은 부하 정보 및 예측 부하 정보에 기반하여 복수의 NF들의 각 NF의 부하를 식별하는 방법의 예를 도시한다. 도 8은 NF 별 부하에 기반하여, 복수의 NF들 중 NF를 선택하는 방법의 예를 도시한다. 도 9는 인공 지능 모델의 예측 정확도에 기반하여 NF 선택을 수행하는 방법에 대한 동작 흐름의 예를 도시한다. 도 10a 및 도 10b는 시간의 흐름에 따른, 예측된 부하 정보 및 수집된 부하 정보를 나타내는 그래프의 예를 도 시한다. 도 10c는 시간의 흐름에 따른 대상 NF들의 부하를 나타내는 그래프의 예를 도시한다."}
