{"patent_id": "10-2022-0054401", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0154686", "출원번호": "10-2022-0054401", "발명의 명칭": "빛에 반응하는 시냅스 소자 및 이를 이용한 인센서 비전 시스템", "출원인": "한국과학기술원", "발명자": "최양규"}}
{"patent_id": "10-2022-0054401", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "기판; 상기 기판 상에 형성되는 채널, 소스 및 드레인; 상기 채널 상에 형성되는 전하 저장층; 및 상기 전하 저장층 상에 형성되는 게이트를 포함하는 빛에 반응하는 시냅스 소자."}
{"patent_id": "10-2022-0054401", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 시냅스 소자는, 상기 게이트에 전압 펄스를 인가하여 상기 전하 저장층에 저장된 전자의 양을 조절함으로써, 빛에 따른 출력 전류 및 광 반응성을 제어하는 것을 특징으로 하는 빛에 반응하는 시냅스 소자."}
{"patent_id": "10-2022-0054401", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 전하 저장층은, 전하가 저장된 양에 따라 상이한 웨이트(Weight)를 가져 시냅스 동작을 구현하도록 폴리 실리콘(poly-silicon),비정질 실리콘(amorphous silicon), 금속 산화물(metal oxide), 실리콘 질화물(silicon nitride), 실리콘 나노결정 물질(silicon nano-crystal) 및 금속 산화물 나노 결정을 갖는 물질 중 적어도 하나로 형성되는 것을 특징으로 하는 빛에 반응하는 시냅스 소자."}
{"patent_id": "10-2022-0054401", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 게이트는, 빛의 투과율을 향상시키기 위해 투명한 전도성 물질로 형성되는 것을 특징으로 하는 빛에 반응하는 시냅스소자."}
{"patent_id": "10-2022-0054401", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 기판은, 전압 펄스가 인가되는 백 게이트(Back gate)로 작용하는 것을 특징으로 하는 빛에 반응하는 시냅스 소자."}
{"patent_id": "10-2022-0054401", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 채널, 상기 소스 및 상기 드레인은, 상기 기판 상에 수평 방향 또는 수직 방향으로 형성되는 것을 특징으로 하는 빛에 반응하는 시냅스 소자."}
{"patent_id": "10-2022-0054401", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2023-0154686-3-제1항에 있어서,상기 소스 및 상기 드레인은, 상기 채널의 좌우 양단에 형성되거나, 상기 채널의 상하 양단에 형성되는 것을 특징으로 하는 빛에 반응하는 시냅스 소자."}
{"patent_id": "10-2022-0054401", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 채널, 상기 소스 및 상기 드레인은, 실리콘, 게르마늄, 실리콘 게르마늄 또는 3-5족 화합물 반도체 중 적어도 하나로 형성되는 것을 특징으로 하는빛에 반응하는 시냅스 소자."}
{"patent_id": "10-2022-0054401", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 채널은, 평면형, 핀(fin)형, 나노선(nanowire)형 또는 나노시트(nanosheet)형 중 적어도 하나의 형태로 형성되는 것을특징으로 하는 빛에 반응하는 시냅스 소자."}
{"patent_id": "10-2022-0054401", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 소스 및 상기 드레인은, n형 실리콘, p형 실리콘 또는 금속실리사이드 중 적어도 하나로 형성되는 것을 특징으로 하는 빛에 반응하는 시냅스 소자."}
{"patent_id": "10-2022-0054401", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 n형 실리콘 또는 상기 p형 실리콘으로 형성되는 상기 소스 및 드레인은, 확산(diffusion), 고상 확산(solid-phase diffusion), 에피택셜 성장(epitaxial growth) 및 선택적 에피택셜성장(epitaxial growth) 또는 이온 주입(ion implantation) 및 후속 열처리 중 적어도 하나의 방식을 통해 형성되는 것을 특징으로 하는 빛에 반응하는 시냅스 소자."}
{"patent_id": "10-2022-0054401", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항에 있어서,상기 금속실리사이드로 형성되는 상기 소스 및 상기 드레인은, 어븀(Er), 이터븀(Yb), 사마륨(Sm), 이트륨(Y), 가돌륨(Gd), 터븀(Tb), 세륨(Ce), 백금(Pt), 납(Pb), 이리듐(Ir), 니켈(Ni), 티타늄(Ti), 텅스텐(W) 또는 코발트(Co) 중 적어도 하나로 형성된 금속실리사이드를 포함하거나, 개선된 접합을 위한 도펀트 편석(dopant segregation)을 포함하는 것을 특징으로 하는 빛에 반응하는 소자."}
{"patent_id": "10-2022-0054401", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제1항에 있어서,상기 기판은, 실리콘(Si), 실리콘 게르마늄(SiGe), 인장 실리콘(strained Si), 인장 실리콘 게르마늄(strained SiGe), 절연층 매몰 실리콘(Silicon-On-Insulator, SOI), 실리콘 카바이드(SiC) 또는 3-5족 화합물 반도체 중 적어도 하나로 형성되는 것을 특징으로 하는 빛에 반응하는 시냅스 소자.공개특허 10-2023-0154686-4-청구항 14 제1항에 있어서,상기 게이트는, n형 폴리 실리콘, p형 폴리 실리콘, 질화 티타늄(TiN), 질화 탄탈륨(TaN), 알루미늄(Al), 몰리브덴(Mo), 마그네슘(Mg), 크롬(Cr), 팔라듐(Pd), 백금(Pt), 니켈(Ni), 티타늄(Ti), 금(Au), 탄탈륨(Ta), 텅스텐(W), 은(Ag) 또는 주석(Sn) 중 적어도 하나로 형성되는 것을 특징으로 하는 빛에 반응하는 시냅스 소자."}
{"patent_id": "10-2022-0054401", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제1항에 있어서,상기 게이트는, 상기 채널 전체를 둘러싸는 전면 게이트(gate-all-around) 구조를 갖는 것을 특징으로 하는 빛에 반응하는 시냅스 소자."}
{"patent_id": "10-2022-0054401", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제1항에 있어서,상기 게이트는, 이중 게이트(double-gate), 삼중 게이트(tri-gate) 또는 오메가 게이트(Omega-gate) 중 적어도 하나를 포함하는 다중 게이트(multiple-gate) 구조를 갖는 것을 특징으로 하는 빛에 반응하는 시냅스 소자."}
{"patent_id": "10-2022-0054401", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제1항에 있어서,상기 채널과 상기 전하 저장층 사이에 개재되는 터널링 절연막을 더 포함하고, 상기 터널링 절연막은, 상기 채널과 상기 전하 저장층을 절연하도록 산화 실리콘(silicon oxide), 실리콘 질화물(silicon nitride), 산화 알루미늄(aluminum oxide), 산화 하프늄(hafnium oxide), 산화질화 하프늄(Hafnium Oxynitride), 산화 아연(zinc oxide), 산화 지르코늄(zirconium oxide) 또는 산화하프늄지르코늄(HZO) 중 적어도 하나로 형성되는 것을특징으로 하는 빛에 반응하는 시냅스 소자."}
{"patent_id": "10-2022-0054401", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제1항에 있어서,상기 전하 저장층과 상기 게이트 사이에 개재되는 블로킹 절연막을 더 포함하고, 상기 블로킹 절연막은, 상기 전하 저장층과 상기 게이트 사이를 절연하도록 산화 실리콘(silicon oxide), 실리콘 질화물(siliconnitride), 산화 알루미늄(aluminum oxide), 산화 하프늄(hafnium oxide), 산화질화 하프늄(HafniumOxynitride), 산화 아연(zinc oxide), 산화 지르코늄(zirconium oxide) 또는 산화하프늄지르코늄(HZO) 중 적어도 하나로 형성되는 것을 특징으로 하는 빛에 반응하는 시냅스 소자."}
{"patent_id": "10-2022-0054401", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제1항에 있어서,상기 게이트와 상기 드레인 사이에 형성되는 층간 절연막공개특허 10-2023-0154686-5-을 더 포함하고, 상기 층간 절연막은, 상기 게이트와 상기 드레인 사이를 절연하도록 산화 실리콘(silicon oxide), 실리콘 질화물(silicon nitride),산화 알루미늄(aluminum oxide), 산화 하프늄(hafnium oxide), 산화질화 하프늄(Hafnium Oxynitride), 산화 아연(zinc oxide), 산화 지르코늄(zirconium oxide) 또는 산화하프늄지르코늄(HZO) 중 적어도 하나로 형성되는 것을 특징으로 하는 빛에 반응하는 시냅스 소자."}
{"patent_id": "10-2022-0054401", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "빛을 감지하는 센서 기능 및 인공 신경망의 신호 처리를 수행하는 시냅스 기능을 갖도록 빛에 반응하는 시냅스소자를 포함하는 인센서 비전 시스템."}
{"patent_id": "10-2022-0054401", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제20항에 있어서,상기 인센서 비전 시스템은, 상기 시냅스 소자 이외에 뉴런, 저항, 축전기 또는 트랜지스터 중 적어도 하나의 추가 컴포넌트를 더 포함하는것을 특징으로 하는 인센서 비전 시스템."}
{"patent_id": "10-2022-0054401", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "빛에 반응하는 시냅스 소자 및 이를 이용한 인센서 비전 시스템이 개시된다. 일 실시예에 따르면, 빛에 반응하 는 시냅스 소자는 기판; 상기 기판 상에 형성되는 채널, 소스 및 드레인; 상기 채널 상에 형성되는 전하 저장층; 및 상기 전하 저장층 상에 형성되는 게이트를 포함할 수 있다."}
{"patent_id": "10-2022-0054401", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "아래의 실시예들은 빛에 반응하는 시냅스 소자 및 이를 이용한 인센서 비전 시스템에 관한 것이다."}
{"patent_id": "10-2022-0054401", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공지능 동작에서 막대한 에너지를 소모하는 기존의 폰 노이만(von Neumann) 방식의 한계를 극복할 수 있는 대 안으로, 뉴로모픽 컴퓨팅(neuromorphic computing) 시스템이 많은 관심을 받고 있다. 뉴로모픽 컴퓨팅은 인간 의 뇌를 하드웨어적으로 모방하여 인공지능 동작을 구현하는 방식이다. 인간의 뇌는 매우 복잡한 기능을 수행 하지만 뇌가 소비하는 에너지는 20 W 밖에 되지 않는다. 뉴로모픽 컴퓨팅은 이러한 인간의 뇌 구조 자체를 모 방하여 기존 컴퓨팅보다 월등한 연상, 추론, 인식 등의 인공지능 동작을 초 저전력으로 수행한다. 특히, 뉴로모픽 컴퓨팅은 효율적인 패턴 인식, 물체 감지 및 실시간 이미지 처리를 가능하게 하기 위한, 비전 시스템에 많이 사용된다. 일반적인 뉴로모픽 기반 비전 시스템은 광 신호를 감지하는 이미지 센서, 광 신호를 전기 신호로 변환하는 변환 회로 및 전송된 신호를 처리하는 인공 신경망이 결합된 시스템이 사용된다. 그러나 별도의 인공 신경망 이외에 추가적인 이미지 센서 및 변환 회로를 포함하는 기존 비전 시스템은 하드웨 어 비용이 높을 뿐만 아니라, 광 신호를 적절한 전기 신호로 변환하는 과정에서 병목 현상이 발생하여 신호 지 연과 추가 전력 소비가 발생하는 단점을 갖는다. 따라서, 기존 비전 시스템이 갖는 한계 및 단점을 극복하기 위해, 빛을 감지하는 이미지 센서 단에서 인공 신경 망의 신호 처리 기능을 수행할 수 있는 새로운 소자 및 시스템이 제안될 필요가 있다."}
{"patent_id": "10-2022-0054401", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "일 실시예들은, 적은 하드웨어 비용을 갖고 변환 과정에서 발생되는 신호 지연과 추가 전력 소비를 방지하고자, 빛을 감지하는 센서 기능 및 인공 신경망의 신호 처리를 수행하는 시냅스 기능을 갖는 인센서 비전 시스템을 제 안하고자 한다. 또한, 일 실시예들은 상기 인센서 비전 시스템에서 사용 가능하도록 센서 기능 및 시냅스 기능을 구현한 시냅스 소자를 제안하고자 한다.다만, 일 실시예들이 해결하고자 하는 기술적 과제들은 상기 과제로 한정되는 것은 아니며, 설명되는 예시들의 기술적 사상 및 영역으로부터 벗어나지 않는 범위에서 다양하게 확장될 수 있다."}
{"patent_id": "10-2022-0054401", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시예에 따르면, 빛에 반응하는 시냅스 소자는, 기판; 상기 기판 상에 형성되는 채널, 소스 및 드레인; 상 기 채널 상에 형성되는 전하 저장층; 및 상기 전하 저장층 상에 형성되는 게이트를 포함할 수 있다. 일 측에 따르면, 상기 시냅스 소자는, 상기 게이트에 전압 펄스를 인가하여 상기 전하 저장층에 저장된 전자의 양을 조절함으로써, 빛에 따른 출력 전류 및 광 반응성을 제어하는 것을 특징으로 할 수 있다. 다른 일 측에 따르면, 상기 전하 저장층은, 전하가 저장된 양에 따라 상이한 웨이트(Weight)를 가져 시냅스 동 작을 구현하도록 폴리 실리콘(poly-silicon), 비정질 실리콘(amorphous silicon), 금속 산화물(metal oxide), 실리콘 질화물(silicon nitride), 실리콘 나노결정 물질(silicon nano-crystal) 및 금속 산화물 나노 결정을 갖는 물질 중 적어도 하나로 형성되는 것을 특징으로 할 수 있다. 또 다른 일 측에 따르면, 상기 게이트는, 빛의 투과율을 향상시키기 위해 투명한 전도성 물질로 형성되는 것을 특징으로 할 수 있다. 또 다른 일 측에 따르면, 상기 기판은, 전압 펄스가 인가되는 백 게이트(Back gate)로 작용하는 것을 특징으로 할 수 있다. 또 다른 일 측에 따르면, 상기 채널, 상기 소스 및 상기 드레인은, 상기 기판 상에 수평 방향 또는 수직 방향으 로 형성되는 것을 특징으로 할 수 있다. 또 다른 일 측에 따르면, 상기 소스 및 상기 드레인은, 상기 채널의 좌우 양단에 형성되거나, 상기 채널의 상하 양단에 형성되는 것을 특징으로 할 수 있다. 또 다른 일 측에 따르면, 상기 채널, 상기 소스 및 상기 드레인은, 실리콘, 게르마늄, 실리콘 게르마늄 또는 3- 5족 화합물 반도체 중 적어도 하나로 형성되는 것을 특징으로 할 수 있다. 또 다른 일 측에 따르면, 상기 채널은, 평면형, 핀(fin)형, 나노선(nanowire)형 또는 나노시트(nanosheet)형 중 적어도 하나의 형태로 형성되는 것을 특징으로 하는 빛에 반응하는 시냅스 소자. 또 다른 일 측에 따르면, 상기 소스 및 상기 드레인은, n형 실리콘, p형 실리콘 또는 금속실리사이드 중 적어도 하나로 형성되는 것을 특징으로 할 수 있다. 또 다른 일 측에 따르면, 상기 n형 실리콘 또는 상기 p형 실리콘으로 형성되는 상기 소스 및 드레인은, 확산 (diffusion), 고상 확산(solid-phase diffusion), 에피택셜 성장(epitaxial growth) 및 선택적 에피택셜 성장 (epitaxial growth) 또는 이온 주입(ion implantation) 및 후속 열처리 중 적어도 하나의 방식을 통해 형성되 는 것을 특징으로 할 수 있다. 또 다른 일 측에 따르면, 상기 금속실리사이드로 형성되는 상기 소스 및 상기 드레인은, 어븀(Er), 이터븀(Yb), 사마륨(Sm), 이트륨(Y), 가돌륨(Gd), 터븀(Tb), 세륨(Ce), 백금(Pt), 납(Pb), 이리듐(Ir), 니켈(Ni), 티타늄 (Ti), 텅스텐(W) 또는 코발트(Co) 중 적어도 하나로 형성된 금속실리사이드를 포함하거나, 개선된 접합을 위한 도펀트 편석(dopant segregation)을 포함하는 것을 특징으로 할 수 있다. 또 다른 일 측에 따르면, 상기 기판은, 실리콘(Si), 실리콘 게르마늄(SiGe), 인장 실리콘(strained Si), 인장 실리콘 게르마늄(strained SiGe), 절연층 매몰 실리콘(Silicon-On-Insulator, SOI), 실리콘 카바이드(SiC) 또 는 3-5족 화합물 반도체 중 적어도 하나로 형성되는 것을 특징으로 할 수 있다. 또 다른 일 측에 따르면, 상기 게이트는, n형 폴리 실리콘, p형 폴리 실리콘, 질화 티타늄(TiN), 질화 탄탈륨 (TaN), 알루미늄(Al), 몰리브덴(Mo), 마그네슘(Mg), 크롬(Cr), 팔라듐(Pd), 백금(Pt), 니켈(Ni), 티타늄(Ti), 금(Au), 탄탈륨(Ta), 텅스텐(W), 은(Ag) 또는 주석(Sn) 중 적어도 하나로 형성되는 것을 특징으로 할 수 있다. 또 다른 일 측에 따르면, 상기 게이트는, 상기 채널 전체를 둘러싸는 전면 게이트(gate-all-around) 구조를 갖 는 것을 특징으로 할 수 있다. 또 다른 일 측에 따르면, 상기 게이트는, 이중 게이트(double-gate), 삼중 게이트(tri-gate) 또는 오메가 게이 트(Omega-gate) 중 적어도 하나를 포함하는 다중 게이트(multiple-gate) 구조를 갖는 것을 특징으로 할 수있다. 또 다른 일 측에 따르면, 상기 시냅스 소자는, 상기 채널과 상기 전하 저장층 사이에 개재되는 터널링 절연막을 더 포함하고, 상기 터널링 절연막은, 상기 채널과 상기 전하 저장층을 절연하도록 산화 실리콘(silicon oxide), 실리콘 질화물(silicon nitride), 산화 알루미늄(aluminum oxide), 산화 하프늄(hafnium oxide), 산화질화 하 프늄(Hafnium Oxynitride), 산화 아연(zinc oxide), 산화 지르코늄(zirconium oxide) 또는 산화하프늄지르코늄 (HZO) 중 적어도 하나로 형성되는 것을 특징으로 할 수 있다. 또 다른 일 측에 따르면, 상기 시냅스 소자는, 상기 전하 저장층과 상기 게이트 사이에 개재되는 블로킹 절연막 을 더 포함하고, 상기 블로킹 절연막은, 상기 전하 저장층과 상기 게이트 사이를 절연하도록 산화 실리콘 (silicon oxide), 실리콘 질화물(silicon nitride), 산화 알루미늄(aluminum oxide), 산화 하프늄(hafnium oxide), 산화질화 하프늄(Hafnium Oxynitride), 산화 아연(zinc oxide), 산화 지르코늄(zirconium oxide) 또는 산화하프늄지르코늄(HZO) 중 적어도 하나로 형성되는 것을 특징으로 할 수 있다. 또 다른 일 측에 따르면, 상기 시냅스 소자는, 상기 게이트와 상기 드레인 사이에 형성되는 층간 절연막을 더 포함하고, 상기 층간 절연막은, 상기 게이트와 상기 드레인 사이를 절연하도록 산화 실리콘(silicon oxide), 실 리콘 질화물(silicon nitride), 산화 알루미늄(aluminum oxide), 산화 하프늄(hafnium oxide), 산화질화 하프 늄(Hafnium Oxynitride), 산화 아연(zinc oxide), 산화 지르코늄(zirconium oxide) 또는 산화하프늄지르코늄 (HZO) 중 적어도 하나로 형성되는 것을 특징으로 할 수 있다. 일 실시예에 따르면, 인센서 비전 시스템은, 빛을 감지하는 센서 기능 및 인공 신경망의 신호 처리를 수행하는 시냅스 기능을 갖도록 빛에 반응하는 시냅스 소자를 포함할 수 있다. 일 측에 따르면, 상기 인센서 비전 시스템은, 상기 시냅스 소자 이외에 뉴런, 저항, 축전기 또는 트랜지스터 중 적어도 하나의 추가 컴포넌트를 더 포함하는 것을 특징으로 할 수 있다."}
{"patent_id": "10-2022-0054401", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "일 실시예들은, 빛을 감지하는 센서 기능 및 인공 신경망의 신호 처리를 수행하는 시냅스 기능을 갖는 인센서 비전 시스템을 제안함으로써, 광 신호를 전기 신호로 변환하는 변환 회로를 포함하지 않아 적은 하드웨어 비용 을 갖고 변환 과정에서 발생되는 신호 지연과 추가 전력 소비를 방지하는 기술적 효과를 달성할 수 있다. 또한, 일 실시예들은 상기 인센서 비전 시스템에서 사용 가능하도록 센서 기능 및 시냅스 기능을 구현한 시냅스 소자를 제안할 수 있다. 다만, 일 실시예들의 효과는 상기 효과들로 한정되는 것은 아니며, 설명 예시들의 기술적 사상 및 영역으로부터 벗어나지 않는 범위에서 다양하게 확장될 수 있다."}
{"patent_id": "10-2022-0054401", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 실시예들을 첨부된 도면을 참조하여 상세하게 설명한다. 그러나 본 발명이 실시예들에 의해 제한되거나 한정되는 것은 아니다. 또한, 각 도면에 제시된 동일한 참조 부호는 동일한 부재를 나타낸다.또한, 본 명세서에서 사용되는 용어(Terminology)들은 본 발명의 바람직한 실시예를 적절히 표현하기 위해 사용 된 용어들로서, 이는 사용자, 운용자의 의도 또는 본 발명이 속하는 분야의 관례 등에 따라 달라질 수 있다. 따라서, 본 용어들에 대한 정의는 본 명세서 전반에 걸친 내용을 토대로 내려져야 할 것이다. 도 1a 내지 1b는 기존 비전 시스템과 대비하여 일 실시예에 따른 인센서 비전 시스템을 도시한 도면이다. 보다 상세하게, 도 1a는 별도의 인공 신경망 이외에 추가적인 이미지 센서 및 변환 회로를 포함하는 기존 비전 시스 템을 도시한 도면이며, 도 1b는 일 실시예에 따른 인센서 비전 시스템을 도시한 도면이다. 도 1a 내지 1b를 참조하면, 기존 비전 시스템은 빛(광 신호)을 감지하는 이미지 센서, 광 신호를 전기 신호로 변환하는 변환 회로 및 전송된 전기 신호를 처리하는 인공 신경망을 포함하는 구조를 갖는다. 이에, 도 1a에 도시된 바와 같은 기존의 비전 시스템은 별도의 인공 신경망 이외에 추가적인 이미지 센서 및 변 환 회로를 포함하기 때문에 하드웨어 비용이 높을 뿐만 아니라, 광 신호를 적절한 전기 신호로 변환하는 과정에 서 병목 현상이 발생하여 신호 지연과 추가 전력 소비가 발생하는 단점을 갖는다. 반면, 도 1b에 도시된 바와 같은 일 실시예에 따른 인센서 비전 시스템은 센서단에 센서 내부 인공 신경망을 포 함함으로써, 광 신호를 전기 신호로 변환하는 변환 회로를 포함하지 않아 적은 하드웨어 비용을 갖고 변환 과정 에서 발생되는 신호 지연과 추가 전력 소비를 방지하는 기술적 효과를 달성할 수 있다. 이를 위해, 인센서 비전 시스템은 빛을 감지하는 센서 기능 및 인공 신경망의 신호 처리를 수행하는 시냅스 기 능을 갖는 시냅스 소자로 센서 내부 인공 신경망을 구성할 수 있다. 이와 같은 시냅스 소자에 대한 상세한 설 명은 도 2 내지 3을 참조하여 기재하기로 한다. 인센서 비전 시스템은 설명된 바와 같이 시냅스 소자로 구성되는 센서 내부 인공 신경망만을 포함하는 구조로 제한되거나 한정되지 않고, 구현 목적 및 응용 범위에 따라 시냅스 소자 이외에 뉴런, 저항, 축전기 또는 트랜 지스터 중 적어도 하나의 추가 컴포넌트(미도시)를 더 포함할 수 있다. 도 2는 일 실시예에 따른 인센서 비전 시스템에 포함되는 시냅스 소자의 구조를 도시한 도면이고, 도 3은 일 실 시예에 따른 시냅스 소자를 촬영한 주사전자현미경(SEM) 및 투과전자현미경(TEM) 사진이다. 도 2 내지 3을 참조하면, 일 실시예에 따른 시냅스 소자는, 기판, 채널, 소스, 드레인 , 전하 저장층 및 게이트를 포함하는 MOSFET의 구조를 가질 수 있다. 시냅스 소자는 설명된 구성요소 이외에 터널링 절연막, 블로킹 절연막 및 층간 절연막을 더 포함하는 구조를 가질 수도 있으며, 이에 제한되거나 한정되지 않는다. 기판은, 단결정 반도체 기판으로, 실리콘(Si), 실리콘 게르마늄(SiGe), 인장 실리콘(strained Si), 인장 실리콘 게르마늄(strained SiGe), 절연층 매몰 실리콘(Silicon-On-Insulator, SOI), 실리콘 카바이드(SiC) 또 는 3-5족 화합물 반도체 중 적어도 하나로 형성될 수 있다. 또한 기판은 전압 펄스가 인가되는 백 게이트(Back gate)로 작용하도록 구성될 수 있다. 채널, 소스 및 드레인은, 기판 상에 형성되는 구성요소로서, 실리콘, 게르마늄, 실리콘 게 르마늄 또는 3-5족 화합물 반도체 중 적어도 하나로 형성될 수 있다. 보다 상세하게, 소스 및 드레인 은 채널과 동일한 물질로 형성되는 가운데 n형 또는 p형의 불순물이 주입 또는 도핑되어 형성될 수 있다. 예를 들어, 소스 및 드레인은 n형 실리콘, p형 실리콘 또는 금속실리사이드 중 적어도 하나로 형성될 수 있다. 소스 및 드레인이 n형 실리콘 또는 p형 실리콘으로 형성되는 경우, 소스 및 드레인은 확산 (diffusion), 고상 확산(solid-phase diffusion), 에피택셜 성장(epitaxial growth) 및 선택적 에피택셜 성장 (epitaxial growth) 또는 이온 주입(ion implantation) 및 후속 열처리 중 적어도 하나의 방식을 통해 형성될 수 있다. 소스 및 드레인이 금속실리사이드로 형성되는 경우, 소스 및 드레인은 어븀(Er), 이터븀 (Yb), 사마륨(Sm), 이트륨(Y), 가돌륨(Gd), 터븀(Tb), 세륨(Ce), 백금(Pt), 납(Pb), 이리듐(Ir), 니켈(Ni), 티 타늄(Ti), 텅스텐(W) 또는 코발트(Co) 중 적어도 하나로 형성된 금속실리사이드를 포함일 수 있다. 이 경우, 시냅스 소자는 쇼트키 장벽 MOSFET일 수 있다. 또한, 소스 및 드레인이 금속실리사이드로 형성되는 경우, 개선된 접합을 위한 도펀트 편석(dopant segregation)을 포함할 수도 있다. 이 경우, 시냅스 소자는 도펀트 편석 쇼트키 장벽 MOSFET일 수 있다. 이 때, 채널, 소스 및 드레인은, 기판 상에 수평 방향 또는 수직 방향으로 형성될 수 있다. 채널, 소스 및 드레인이 기판 상에 수평 방향으로 형성되는 경우 시냅스 소자(20 0)는 수평형 MOSFET일 수 있으며, 채널, 소스 및 드레인이 기판 상에 수직 방향으로 형성 되는 경우 시냅스 소자는 수직형 MOSFET일 수 있다. 채널, 소스 및 드레인이 기판 상에 수평 방향으로 형성되는 경우 소스 및 드레인 은 채널의 좌우 양단에 형성될 수 있으며, 채널, 소스 및 드레인이 기판 상에 수직 방향으로 형성되는 경우 소스 및 드레인은 채널의 상하 양단에 형성될 수 있다. 채널은 평면형, 핀(fin)형, 나노선(nanowire)형 또는 나노시트(nanosheet)형 중 적어도 하나의 형태로 형 성될 수 있다. 전하 저장층은, 전하가 저장된 양에 따라 상이한 웨이트(Weight)를 가져 시냅스 동작을 구현하도록 폴리 실리콘(poly-silicon), 비정질 실리콘(amorphous silicon), 금속 산화물(metal oxide), 실리콘 질화물(silicon nitride), 실리콘 나노결정 물질(silicon nano-crystal) 및 금속 산화물 나노 결정을 갖는 물질 중 적어도 하나 로 형성될 수 있다. 게이트는, n형 폴리 실리콘, p형 폴리 실리콘, 질화 티타늄(TiN), 질화 탄탈륨(TaN), 알루미늄(Al), 몰리 브덴(Mo), 마그네슘(Mg), 크롬(Cr), 팔라듐(Pd), 백금(Pt), 니켈(Ni), 티타늄(Ti), 금(Au), 탄탈륨(Ta), 텅스 텐(W), 은(Ag) 또는 주석(Sn) 중 적어도 하나의 전도성 물질로 형성될 수 있다. 특히, 게이트는, 빛의 투과율을 향상시키기 위해 산화 아연(ZnO), 산화 주석(SnO), 인듐 주석 산화물(ITO) 등의 투명한 전도성 물질로 형성될 수 있다. 또한 게이트는, 채널 전체를 둘러싸는 전면 게이트(gate-all-around) 구조를 가질 수 있다. 또한, 게이트는, 이중 게이트(double-gate), 삼중 게이트(tri-gate) 또는 오메가 게이트(Omega-gate) 중 적어도 하나를 포함하는 다중 게이트(multiple-gate) 구조를 가질 수 있다. 이처럼 시냅스 소자는 설명된 바와 같은 전하 저장층 및 게이트를 포함함으로써, 게이트에 전압 펄스를 인가하여 전하 저장층에 저장된 전자의 양을 조절함으로써, 빛에 따른 출력 전류 및 광 반응 성을 제어할 수 있다. 즉, 시냅스 소자는 설명된 바와 같은 전하 저장층 및 게이트를 포함함으 로써, 빛을 감지하는 센서 기능 및 인공 신경망의 신호 처리를 수행하는 시냅스 기능을 가질 수 있다. 따라서, 시냅스 소자는 센서 단에서 실시간 신호 처리가 가능한 인센서 비전 시스템을 구현할 수 있다. 터널링 절연막은, 채널과 전하 저장층 사이에 개재되어, 채널과 전하 저장층을 절연 하도록 산화 실리콘(silicon oxide), 실리콘 질화물(silicon nitride), 산화 알루미늄(aluminum oxide), 산화 하프늄(hafnium oxide), 산화질화 하프늄(Hafnium Oxynitride), 산화 아연(zinc oxide), 산화 지르코늄 (zirconium oxide) 또는 산화하프늄지르코늄(HZO) 중 적어도 하나로 형성될 수 있다. 터널링 절연막은 구 현 예시에 따라 생략 가능하다. 블로킹 절연막은, 전하 저장층과 게이트 사이에 개재되어, 전하 저장층과 게이트 사 이를 절연하도록 산화 실리콘(silicon oxide), 실리콘 질화물(silicon nitride), 산화 알루미늄(aluminum oxide), 산화 하프늄(hafnium oxide), 산화질화 하프늄(Hafnium Oxynitride), 산화 아연(zinc oxide), 산화 지 르코늄(zirconium oxide) 또는 산화하프늄지르코늄(HZO) 중 적어도 하나로 형성될 수 있다. 블로킹 절연막 은 구현 예시에 따라 생략 가능하다. 층간 절연막은, 게이트와 드레인 사이에 형성된 채, 게이트와 드레인 사이를 절연하 도록 산화 실리콘(silicon oxide), 실리콘 질화물(silicon nitride), 산화 알루미늄(aluminum oxide), 산화 하 프늄(hafnium oxide), 산화질화 하프늄(Hafnium Oxynitride), 산화 아연(zinc oxide), 산화 지르코늄 (zirconium oxide) 또는 산화하프늄지르코늄(HZO) 중 적어도 하나로 형성될 수 있다. 층간 절연막은 구현예시에 따라 생략 가능하다. 설명된 구조의 시냅스 소자는 도 3에 도시된 주사전자현미경(SEM) 사진과 같이 높은 집적도의 어레이 구조 로 구현될 수 있다. 또한, 도 3에 도시된 투과전자현미경(TEM) 사진에는, 시냅스 소자가 채널, 산화 실리콘(silicon oxide), 실리콘 질화물(silicon nitride), 산화 실리콘(silicon oxide) 3층 구조의 터널링 절연막, 실리 콘 질화물(silicon nitride)으로 형성된 전하 저장층, 산화 실리콘(silicon oxide)으로 형성된 블로킹 절 연막, 티타늄(Ti), 질화티타늄(TiN), 텅스텐(W) 3층 구조의 게이트를 포함하는 구조임을 나타내고 있 다. 도 4a 내지 4c는 일 실시예에 따른 시냅스 소자로부터 측정된 빛의 세기와 게이트에 인가된 전압 펄스의 개수에 따른 전기적 측정 결과 그래프를 도시한 도면이다. 보다 상세하게, 도 4a는 일 실시예에 따른 시냅스 소자에서 빛의 세기(P)에 따른 MOSFET의 transfer characteristic(ID-VG)를 도시한 그래프이고, 도 4b는 일 실시예에 따 른 시냅스 소자에서 게이트에 인가된 전압 펄스의 개수(Npulse)에 따른 MOSFET의 transfer characteristic(ID- VG)를 도시한 그래프이며, 도 4c는 일 실시예에 따른 시냅스 소자에서 인가된 전압 펄스의 개수(Npulse)에 따른 MOSFET의 드레인 전류(ID)를 다양한 빛의 세기(P)에서 측정한 것을 도시한 그래프이다. 도 4a를 참조하면, 일 실시예에 따른 시냅스 소자에서는 빛의 세기(P)가 증가함에 따라 전류의 크기가 증가하여, threshold voltage(VT)가 왼쪽으로 이동하는 것을 확인할 수 있다. 이에, 일 실시예에 따른 시냅스 소자는 센서의 역할을 수행할 수 있다. 한편, 이러한 VT의 이동은 빛이 꺼졌을 때 원상태로 복구되므로 일시적 이다. 도 4b를 참조하면, 일 실시예에 따른 시냅스 소자에서는 9V의 크기와 10μs의 폭을 가지는 양의 전압 펄스가 인 가됨에 따라, 전하 저장층에 저장된 전자의 양이 증가하고, 이에 따라 VT가 오른쪽으로 이동하는 것을 확인할 수 있다. 즉, 일 실시예에 따른 시냅스 소자는 인공 신경망의 시냅스의 역할을 수행할 수 있다. 이러한 VT의 이동은 또 다른 전압 펄스가 인가되지 않는 한 반영구적이다. 도 4c를 참조하면, 일 실시예에 따른 시냅스 소자는 전압 펄스의 개수를 조정함으로써 전류 및 광 반응성을 조 절할 수 있으며, 해당 방법으로 빛의 감지 및 인공 신경망의 신호 처리를 동시에 수행할 수 있다. 즉, 일 실시 예에 따른 시냅스 소자는 빛을 감지하는 센서 기능 및 인공 신경망의 신호 처리를 수행하는 시냅스 기능을 단일 소자에서 구현할 수 있다. 해당 시냅스 소자에서는 32 비트(=25 bit)를 예로 들어, 전압 펄스가 인가되지 않은 상태가 1 mW의 빛이 들어왔을 때 큰 전류(44.7 nA)를 출력하는 높은 웨이트(weight)를 가지는 상태이고, 전압 펄스가 31개 인가된 상태가 1mW의 빛이 들어왔을 때 작은 전류(2.63 nA)를 출력하는 낮은 웨이트(weight)를 가 지는 상태이다. 이러한 시냅스 소자를 이용하면 센서 단에서 실시간 신호 처리가 가능한 인센서 비전 시스템이 구현될 수 있다. 한편, 해당 측정에서 드레인 전류(ID)는 0V의 게이트 전압(VG)이 인가되었을 때로 추출되었다. 도 5a 내지 5b는 일 실시예에 따른 시냅스 소자를 이용해 패턴 인식을 수행한 결과를 도시한 도면이다. 보다 상세하게, 도 5a는 2x2 흑백 화소로 구성된 이미지에서 좌상에서 우하방향의 대각선(diagonal) 패턴(A)과 우상 에서 좌하방향의 부대각선(off-diagonal) 패턴(B)을 식별하기 위해, 일 실시예에 따른 시냅스 소자를 이용해 구 성되는 인센서 비전 시스템을 도시한 도면이고, 도 5b는 도 5a의 인센서 비전 시스템에 의해 패턴 인식이 수행 된 결과를 도시한 도면이다. 도 5a를 참조하면, 2x2 흑백 화소로 구성된 이미지에서 좌상에서 우하 방향의 대각선(diagonal) 패턴(A)과 우상 에서 좌하 방향의 부대각선(off-diagonal) 패턴(B)을 식별하기 위한, 픽셀 배열도와 해당 회로도를 포함한 인센 서 비전 시스템이 구성되었다. 인센서 비전 시스템은 4개의 픽셀(1~4)과 2개의 패턴(A, B)을 연결하는 8개의 빛에 반응하는 시냅스 소자로 구 성되어 있다. 각 시냅스 소자는 전술된 구조를 통해 전하 저장층에 저장된 전자의 양을 조절함으로써 상이한 웨이트를 설정하였다. 이와 같은 인센서 비전 시스템은 2개의 패턴(A, B)을 나타내는 노드에서 출력되는 전류 중 어떤 것이 큰 것인지를 통해 입력된 이미지의 패턴을 구분할 수 있다. 즉, A 패턴을 나타내는 노드에서 출 력되는 전류(Iout,A)의 크기가 B 패턴을 나타내는 노드에서 출력되는 전류(Iout,B)의 크기보다 크면 입력된 이미지는 A 패턴으로 인식될 수 있으며, 반대로, Iout,B의 크기가 Iout,A의 크기보다 크면 입력된 이미지는 B 패 턴으로 인식될 수 있다. 도 5b를 참조하면, 입력된 이미지가 A 패턴일 때는, Iout,A의 크기가 Iout,B의 크기보다 더 크고, 입력된 이미 지가 B 패턴일 때는, Iout,B의 크기가 Iout,A의 크기보다 더 큰 것을 확인할 수 있다. 한편, 이러한 인센서 비전 시스템을 이용하면, 변환 회로가 필요 없어 신호 지연 및 전력 소비를 제거할 수 있 으므로, 1 ms 내에 150nW 미만의 전력으로도 패턴 인식을 수행할 수 있다. 도 6은 일 실시예에 따른 시냅스 소자의 측정 데이터를 반영하여, 소프트 시뮬레이션을 이용해 손글씨 숫자 패 턴 인식을 수행한 결과를 도시한 도면이다. 도 6을 참조하면, 설명된 시냅스 소자를 포함하는 인센서 비전 시스템은 소프트웨어 시뮬레이션을 통해 Modified National Institute of Standards and Technology (MNIST) database 상의 손글씨 숫자 패턴 인식을 수행한 결과, 학습 횟수(number of epoch)에 따른 인식률(recognition rate)이 일반적인 비전 시스템과 비교하 여 큰 차이가 없기에, 복잡한 패턴 인식에도 응용될 수 있음을 보여준다."}
{"patent_id": "10-2022-0054401", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이상과 같이 실시예들이 비록 한정된 실시예와 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가 진 자라면 상기의 기재로부터 다양한 수정 및 변형이 가능하다. 예를 들어, 설명된 기술들이 설명된 방법과 다 른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태 로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다. 그러므로, 다른 구현들, 다른 실시예들 및 특허청구범위와 균등한 것들도 후술하는 특허청구범위의 범위에 속한 다."}
{"patent_id": "10-2022-0054401", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1a 내지 1b는 기존 비전 시스템과 대비하여 일 실시예에 따른 인센서 비전 시스템을 도시한 도면이다. 도 2는 일 실시예에 따른 인센서 비전 시스템에 포함되는 시냅스 소자의 구조를 도시한 도면이다. 도 3은 일 실시예에 따른 시냅스 소자를 촬영한 주사전자현미경(SEM) 및 투과전자현미경(TEM) 사진이다. 도 4a 내지 4c는 일 실시예에 따른 시냅스 소자로부터 측정된 빛의 세기와 게이트에 인가된 전압 펄스의 개수에 따른 전기적 측정 결과 그래프를 도시한 도면이다. 도 5a 내지 5b는 일 실시예에 따른 시냅스 소자를 이용해 패턴 인식을 수행한 결과를 도시한 도면이다. 도 6은 일 실시예에 따른 시냅스 소자의 측정 데이터를 반영하여, 소프트 시뮬레이션을 이용해 손글씨 숫자 패 턴 인식을 수행한 결과를 도시한 도면이다."}
