{"patent_id": "10-2020-0158651", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0071481", "출원번호": "10-2020-0158651", "발명의 명칭": "포스 장치, 포스 장치의 주문 정보 처리방법, 기록매체", "출원인": "한병엽", "발명자": "한병엽"}}
{"patent_id": "10-2020-0158651", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "포스(POS: Point Of Sales) 장치의 주문 정보 처리 방법에 있어서,상기 포스 장치가, 하나 이상의 온라인 주문 서비스 장치 및 상기 포스 장치에 연결된 입력부 중 적어도 하나로부터 주문 정보를 입력받는 단계;상기 포스 장치에 연결된 영수증 프린팅 장치가 상기 주문 정보에 따라 영수증을 출력할 때 상기 포스 장치의운영체제가 상기 영수증 프린팅 장치로 전송되는 주문 정보를 수집하는 단계;상기 포스 장치가 상기 수집한 주문 정보를 연관시켜 저장하거나 상기 연관된 주문 정보를 외부로 전송하는 단계를 포함하는 포스 장치의 주문 정보 처리 방법."}
{"patent_id": "10-2020-0158651", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "포스(POS: Point Of Sales) 장치가, 하나 이상의 온라인 주문 서비스 장치 및 상기 포스 장치에 연결된 입력부중 적어도 하나로부터 주문 정보를 입력받는 기능, 상기 포스 장치에 연결된 영수증 프린팅 장치가 상기 주문정보에 따라 영수증을 출력할 때 상기 포스 장치의 운영체제가 상기 영수증 프린팅 장치로 전송되는 주문 정보를 수집하는 기능; 상기 포스 장치가 상기 수집한 주문 정보를 연관시켜 저장하거나 상기 연관된 주문 정보를외부로 전송하는 기능을 실현시키기 위한 프로그램을 기록한 컴퓨터 해독가능한 기록매체."}
{"patent_id": "10-2020-0158651", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "외부와 통신하는 통신부;입력부를 제어하고, 주문 정보를 처리하는 프로세서; 및상기 프로세서에 의하여 실행되는 운영체제와, 상기 주문 정보를 저장하는 메모리부를 포함하고,상기 프로세서는 하나 이상의 온라인 주문 서비스 장치 및 상기 입력부 중 적어도 하나로부터 상기 주문 정보를 입력받고,상기 프로세서에 의하여 제어되는 영수증 프린팅 장치가 상기 주문 정보에 따라 영수증을 출력할 때, 상기 운영체제를 통하여 상기 영수증 프린팅 장치로 전송되는 주문 정보를 수집하며,상기 수집된 주문 정보를 상기 메모리부에 저장하거나, 상기 통신부를 통하여 외부로 전송하는 것을 특징으로하는 포스(POS: Point Of Sales) 장치."}
{"patent_id": "10-2020-0158651", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 운영체제는 상기 영수증 프린팅 장치로 전송되는 상기 주문 정보 관련 IRP(Input/output Rrquest Packet)를 수집하는 것을특징으로 하는 포스 장치."}
{"patent_id": "10-2020-0158651", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서,상기 운영체제는서로 다른 온라인 주문 서비스 회사의 상기 온라인 주문 서비스 장치들에 로그인(log-in)한 상태에서 상기 복수의 온라인 주문 서비스 장치 각각으로부터 입력받은 상기 주문 정보에 따라 상기 영수증 프린팅 장치로 전송되공개특허 10-2022-0071481-3-는 상기 주문 정보 관련 IRP(Input/output Rrquest Packet)를 수집하는 것을 특징으로 하는 포스 장치."}
{"patent_id": "10-2020-0158651", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 운영체제는 상기 입력부 및 상기 영수증 프린팅 장치의 제조회사와 상관없이 상기 주문 정보 관련 IRP를수집하는 것을 특징으로 하는 포스 장치."}
{"patent_id": "10-2020-0158651", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제3항에 있어서,네크워크를 통하여 상기 통신부와 통신하는 포장용기 관리장치를 더 포함하며,상기 포장용기 관리장치는,상기 통신부로부터 전송된 상기 주문 정보를 통해 포장상품 식별코드를 결정하고 상기 포장상품 식별코드를 기초로 포장용기의 종류 및 수량을 결정하고,상기 포장용기의 종류 및 수량을 기초로 포장용기 재고 데이터베이스를 갱신하며,상기 포장용기 재고 데이터베이스를 주기적으로 모니터링하여 기준 재고 수량 이하인 재고 부족 포장용기의 종류를 결정하고,상기 재고 부족 포장용기의 종류를 기초로 관리자 단말에 상기 재고 부족 포장용기의 주문을 추천하는 것을 특징으로 하는 포스 장치."}
{"patent_id": "10-2020-0158651", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제3항에 있어서,네크워크를 통하여 상기 통신부와 통신하는 포장용기 관리장치를 더 포함하며,상기 포장용기 관리장치는,포장용기 재고 데이터를 포함하는 상기 주문 정보를 상기 통신부로부터 수집하고,상기 주문 정보를 전처리하여 인공지능 처리용 주문 데이터를 생성하며,상기 인공지능 처리용 주문 데이터를 포장용기 재고 예측 모델에 입력하여 포장용기 재고 소진 정보를결정하고,관리자 단말에 상기 포장용기 재고 소진 정보를 제공하는 것을 특징으로 하는 포스 장치."}
{"patent_id": "10-2020-0158651", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 실시예에 따른 포스 장치는 외부와 통신하는 통신부; 입력부를 제어하고, 주문 정보를 처리하는 프로 세서; 및 상기 프로세서에 의하여 실행되는 운영체제와, 상기 주문 정보를 저장하는 메모리부를 포함하고, 상기 프로세서는 하나 이상의 온라인 주문 서비스 장치 및 상기 입력부 중 적어도 하나로부터 상기 주문 정보를 입력 받고, 상기 프로세서에 의하여 제어되는 영수증 프린팅 장치가 상기 주문 정보에 따라 영수증을 출력할 때, 상기 운영체제를 통하여 상기 영수증 프린팅 장치로 전송되는 주문 정보를 수집하며, 상기 수집된 주문 정보를 상기 메모리부에 저장하거나, 상기 통신부를 통하여 외부로 전송한다."}
{"patent_id": "10-2020-0158651", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 포스 장치, 포스 장치의 주문 정보 처리방법, 기록매체에 관한 것이다."}
{"patent_id": "10-2020-0158651", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인터넷의 발달에 따라 오프라인을 통한 거래 보다 인터넷을 통한 전자 상거래가 활발해지고 있다. 인터넷을 통 한 전자 상거래의 플랫폼(Platform)은 매우 다양한 형태로 등장하고 있다. 종래 영세업자 들은 영업에 필요한 물품들을 오프라인을 통해 직접 구매하여야 하는 불편이 있었다. 또한 영세업자들이 구매한 물품은 전산화 처리가 되지 않아, 영세업자들은 얼마의 재고가 있는지 하루 물품 소 비량은 어떻게 되는지 물품에 대해 구매를 한다면 얼마나 구매를 하여야 하는지 등에 대하여 인지하지 못하는 문제를 가지고 있다. 선행기술문헌특허문헌 (특허문헌 0001) 한국공개특허 제 10-2006-0106244(공개일 : 2006.10.12) (특허문헌 0002) 한국등록특허 제 10-171423(공고일 : 2017.03.02)"}
{"patent_id": "10-2020-0158651", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 실시예에 따른 포스 장치, 포스 장치의 주문 정보 처리방법, 기록매체은 온라인 및 오프라인 상에서 이루어진 주문을 처리하기 위한 것이다. 본 출원의 과제는 이상에서 언급한 과제로 제한되지 않으며, 언급되지 않는 또 다른 과제는 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2020-0158651", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일측면에 따른 포스(POS: Point Of Sales) 장치의 주문 정보 처리 방법에 있어서, 상기 포스 장치가, 하나 이상의 온라인 주문 서비스 장치 및 상기 포스 장치에 연결된 입력부 중 적어도 하나로부터 주문 정보를 입력받는 단계; 상기 포스 장치에 연결된 영수증 프린팅 장치가 상기 주문 정보에 따라 영수증을 출력할 때 상 기 포스 장치의 운영체제가 상기 영수증 프린팅 장치로 전송되는 주문 정보를 수집하는 단계; 상기 포스 장치가 상기 수집한 주문 정보를 연관시켜 저장하거나 상기 연관된 주문 정보를 외부로 전송하는 단계를 포함하는 포스 장치의 주문 정보 처리 방법이 제공된다. 본 발명의 다른 일측면에 따르면, 포스(POS: Point Of Sales) 장치가, 하나 이상의 온라인 주문 서비스 장치 및 상기 포스 장치에 연결된 입력부 중 적어도 하나로부터 주문 정보를 입력받는 기능, 상기 포스 장치에 연결된 영수증 프린팅 장치가 상기 주문 정보에 따라 영수증을 출력할 때 상기 포스 장치의 운영체제가 상기 영수증 프 린팅 장치로 전송되는 주문 정보를 수집하는 기능; 상기 포스 장치가 상기 수집한 주문 정보를 연관시켜 저장하 거나 상기 연관된 주문 정보를 외부로 전송하는 기능을 실현시키기 위한 프로그램을 기록한 컴퓨터 해독가능한 기록매체가 제공된다. 본 발명의 또다른 측면에 따르면, 외부와 통신하는 통신부; 입력부를 제어하고, 주문 정보를 처리하는 프로세서; 및 상기 프로세서에 의하여 실행되는 운영체제와, 상기 주문 정보를 저장하는 메모리부를 포함하고, 상기 프로세서는 하나 이상의 온라인 주문 서비스 장치 및 상기 입력부 중 적어도 하나로부터 상기 주문 정보를 입력받고, 상기 프로세서에 의하여 제어되는 영수증 프린팅 장치가 상기 주문 정보에 따라 영수증을 출력할 때, 상기 운영체제를 통하여 상기 영수증 프린팅 장치로 전송되는 주문 정보를 수집하며, 상기 수집된 주문 정보를 상기 메모리부에 저장하거나, 상기 통신부를 통하여 외부로 전송하는 것을 특징으로 하는 포스(POS: Point Of Sales) 장치가 제공된다. 상기 운영체제는 상기 영수증 프린팅 장치로 전송되는 상기 주문 정보 관련 IRP(Input/output Rrquest Packet) 를 수집할 수 있다. 상기 운영체제는 서로 다른 온라인 주문 서비스 회사의 상기 온라인 주문 서비스 장치들에 로그인(log-in)한 상 태에서 상기 복수의 온라인 주문 서비스 장치 각각으로부터 입력받은 상기 주문 정보에 따라 상기 영수증 프린 팅 장치로 전송되는 상기 주문 정보 관련 IRP(Input/output Rrquest Packet)를 수집할 수 있다. 상기 운영체제는 상기 입력부 및 상기 영수증 프린팅 장치의 제조회사와 상관없이 상기 주문 정보 관련 IRP를 수집할 수 있다. 본 발명의 또다른 측면에 따른 포스 장치는 네크워크를 통하여 상기 통신부와 통신하는 포장용기 관리장치를 더 포함하며, 상기 포장용기 관리장치는, 상기 통신부로부터 전송된 상기 주문 정보를 통해 포장상품 식별코드를 결정하고 상기 포장상품 식별코드를 기초로 포장용기의 종류 및 수량을 결정하고, 상기 포장용기의 종류 및 수 량을 기초로 포장용기 재고 데이터베이스를 갱신하며, 상기 포장용기 재고 데이터베이스를 주기적으로 모니터링 하여 기준 재고 수량 이하인 재고 부족 포장용기의 종류를 결정하고, 상기 재고 부족 포장용기의 종류를 기초로 관리자 단말에 상기 재고 부족 포장용기의 주문을 추천할 수 있다. 본 발명의 또다른 측면에 따른 포스 장치는 네크워크를 통하여 상기 통신부와 통신하는 포장용기 관리장치를 더 포함하며, 상기 포장용기 관리장치는, 포장용기 재고 데이터를 포함하는 상기 주문 정보를 상기 통신부로부터 수집하고, 상기 주문 정보를 전처리하여 인공지능 처리용 주문 데이터를 생성하며, 상기 인공지능 처리용 주문 데이터를 포장용기 재고 예측 모델에 입력하여 포장용기 재고 소진 정보를 결정하고, 관리자 단말에 상기 포장 용기 재고 소진 정보를 제공할 수 있다."}
{"patent_id": "10-2020-0158651", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따른 포스 장치, 포스 장치의 주문 정보 처리방법, 기록매체은 운영체제의 커널 레벨에서 주문 정보를 수집함으로써 온라인 및 오프라인 상에서 이루어진 주문을 통합적으로 처리할 수 있다. 본 발명의 실시예에 따른 포스 장치, 포스 장치의 주문 정보 처리방법, 기록매체은 운영체제의 커널 레벨에서 주문 정보를 수집함으로써 다양한 주변 장치에 범용적으로 적용할 수 있다. 본 출원의 효과는 이상에서 언급한 효과로 제한되지 않으며, 언급되지 않는 또 다른 효과는 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2020-0158651", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 본 발명의 실시예에 대하여 첨부한 도면을 참조하여 상세하게 설명하기로 한다. 다만, 첨부된 도면은 본"}
{"patent_id": "10-2020-0158651", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "발명의 내용을 보다 쉽게 개시하기 위하여 설명되는 것일 뿐, 본 발명의 범위가 첨부된 도면의 범위로 한정되는"}
{"patent_id": "10-2020-0158651", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "것이 아님은 이 기술분야의 통상의 지식을 가진 자라면 용이하게 알 수 있을 것이다. 또한, 본 출원에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되 어야 한다. 도 1은 네트워크에 접속된 본 발명의 실시예에 따른 포스 장치의 일례를 나타낸다. 본 발명의 실시예에 따른 포 스(POS: Point Of Sales) 장치는 포스 단말기를 포함할 수 있다. 도 2는 본 발명의 실시예에 따른 포스 장 치에 포함된 포스 단말기의 일례를 나타낸다. 도 1 및 도 2에 도시된 바와 같이, 포스 단말기는 정보를 전달하기 위한 버스 또는 다른 통신 메커니 즘을 포함할 수 있다. 이와 같은 버스 또는 다른 통신 메커니즘은, 프로세서, 메모리부(RM), 통신부 (예를 들어, 모뎀 또는 이더넷 카드, 또는 이동통신 모듈), 디스플레이부(예를 들면, CRT 또는 LCD, OLED), 입력부, 영수증 프린팅 장치 및/또는 하위시스템들을 상호 접속한다. 입력부는 키보드, 키패드, 마우스, 트랙볼, 스타일러스, 터치 패드, 터치 스크린(118T), 카드 리더기 (118C), 바코드 리더기(118BQ), QR 코드 리더기(118BQ) 등 일 수 있으나 이에 한정되는 것은 아니다. 영수증 프린팅 장치, 카드 리더기(118C), 바코드 리더기(118BQ), QR 코드 리더기(118BQ)는 직렬 통신 포트 또는 병렬 통신 포트에 연결되어 프로세서와 통신할 수 있다. 또한 영수증 프린팅 장치, 카드 리더기(118C), 바코드 리더기(118BQ), QR 코드 리더기(118BQ)는 통신부 를 통하여 프로세서와 유선 또는 무선 네트워크 통신할 수 도 있고, 통신부의 블루투스나 NFC를 통하여 프로세서와 근거리 무선통신을 수행할 수도 있다. 휘발성 메모리(예를 들면, RAM)는 응용 프로그램의 일시적 로딩(loading)이나 데이터의 일시적 저장 등에 사용될 수 있다. 메모리부(RM)는 비휘발성 메모리(예를 들면, ROM), 디스크 드라이브 (예를 들면, HDD, SSD, 광 디스 크, 플래쉬 메모리 드라이브 등)를 포함하나 이에 한정되는 것은 아니다. 광 디스크는 CD, DVD, Blu-ray disc이 나 이에 한정되는 것은 아니다. 또한 도 2에 도시된 바와 같이, 디스크 드라이브는 프로세서와 함께 하우징에 구비될 수 있으나, 이와 다르게 원격에 설치되어 프로세서와 원격 통신을 수행할 수도 있다. 메모리부(RM)는 본 발명의 실시예에 따른 포스 단말기의 동작에 필요한 운영 체제(operating system)，드 라이버, 애플리케이션 프로그램, 데이터 및 데이터베이스 등을 저장할 수 있다. 디스플레이부는 본 발명의 실시예에 따른 포스 단말기의 동작 및 유저 인터페이스를 표시할 수 있다. 프로세서는 CPU, 마이크로 컨트롤러, 디지털 신호 프로세서(DSP) 등일 수 있으나 이에 한정되는 것은 아니며, 본 발명의 실시예에 따른 포스 단말기의 동작을 제어한다. 프로세서는 메모리부(RM)에 접속하여 메모리부(RM)에 저장된 명령들이나 로직의 하나 이상의 시퀀스들을 실행하는 것에 의해 이후에 설명될 본 발명의 실시예에 따른 포스 단말기의 동작을 제어한다. 버스를 포함하는 배선들(wires)을 포함하는 송신 매체들은 동축 케이블들, 동선(copper wire), 및 광섬유 들을 포함한다. 본 발명의 실시예에 따른 포스 단말기는, 통신 링크 및 통신부를 통해 메시지들, 데이터, 정보 및 프 로그램 코드을 포함하는 명령들을 송신하고 수신할 수도 있다. 통신부는 통신 링크와 연결된 유선 또는 무선 네트워크(예를 들면, LAN, WIFI, WLAN, PTSN, 이동통신망)를 통한 통신을 수행할 수도 있고, 블루투스나 NFC와 같은 근거리 무선통신을 수행할 수도 있다. 다음으로 이와 같은 포스 단말기의 동작에 대해 도면을 참조하여 설명한다. 앞서 설명된 바와 같이 포스 단말기는 외부와 통신하는 통신부, 입력부를 제어하고 주문 정보를 처리하는 프로세서 및 프로세서에 의하여 실행되는 운영체제와 주문 정보를 저장하는 메모리부(RM)를 포함한다. 이 때 프로세서는 하나 이상의 온라인 주문 서비스 장치 및 입력부 중 적어도 하나로부터 주문 정보를 입력받는다. 온라인 주문 서비스 장치와 포스 단말기는 서버-클라이언트 통신을 수행할 수 있 다. 포스 단말기가 구비된 매장은 다양한 방법으로 주문을 받을 수 있다. 다양한 방법 중 하나(이하, 주문방법 1)는 온라인 주문 서비스 회사로부터 주문을 받는 것이고, 다른 하나(이하, 주문방법 2)는 손님으로부터 직접 주문을 받는 것이다. 주문방법 1의 경우, 온라인 주문 서비스 장치는 주문자 단말(미도시)로부터 주문을 받고, 매장의 포스 단 말기로 주문 정보를 송신할 수 있다. 매장 매니저는 포스 단말기로 수신된 주문 정보를 확인하고 해 당 주문에 따라 음식 등을 만들어 배달할 수 있다. 매장 매니저는 포스 단말기를 조작하는 사람으로 매장 의 관리자일 수도 있고 매장의 종업원일 수도 있으나 이에 한정되는 것은 아니다. 주문방법 2의 경우, 매장 매니저는 매장을 직접 방문한 손님으로부터 주문을 받거나 전화로 주문을 받을 수 있 다. 이에 따라 매장 매니저는 주문 정보를 포스 단말기의 입력부(예를 들어, 키보드, 키패드, 마우스, 트 랙볼, 스타일러스, 터치 패드, 터치 스크린(118T))를 통하여 입력시킬 수 있다. 이 때 프로세서에 의하여 제어되는 영수증 프린팅 장치가 주문 정보에 따라 영수증을 출력할 때, 프 로세서는 운영체제를 통하여 영수증 프린팅 장치로 전송되는 주문 정보를 수집한다. 이 때 운영체제 는 윈도나 리눅스 등일 수 있으나, 이에 한정되는 것은 아니다.프로세서는 수집된 주문 정보를 메모리부(RM)에 저장한다. 이 때 프로세서는 주문 정보를 이루고 있 는 항목별 데이터를 서로 연관시켜 저장할 수 있다. 예를 들어, 영수증 프린팅 장치로 전송되는 주문 정보 는 주문된 메뉴, 주문 날짜, 주문 수량, 가격을 포함할 수 있다. 이 때 주문 정보는 주문처에 대한 정보를 더 포함할 수 있다. 주문처에 대한 정보는 주문이 이루어진 온라인 주 문 서비스 회사의 식별정보 및 포스 프로그램에 의한 주문 여부에 대한 정보 중 적어도 하나를 포함할 수 있다. 프로세서는 이들 항목에 해당되는 데이터를 연관시켜 메모리부(RM)에 저장할 수 있다. 또는, 프로세서 는 통신부를 통하여 주문 정보를 외부로 전송한다. 예를 들어, 프로세서는 서로 연관된 항목별 데이터를 통신부를 통하여 외부로 전송하거나, 외부의 컴퓨팅 장치가 항목별 데이터를 서로 연관시킬 수 있다. 일반적인 포스 프로그램은 고객이 매장에서 주문한 내역이나 전화로 주문한 내역을 처리하는 것이었는데, 최근 에는 포스 단말기가 \"배달의 민족\"이나 \"요기요\" 같은 온라인 주문 서비스 회사의 프로그램 혹은 웹사이트 를 기존의 포스 프로그램과 별도로 실행하거나 접속한다. 이 때 일반적인 포스 프로그램은 온라인 주문 서비스 회사의 프로그램 혹은 웹사이트과 연동이 안될 수 있다. 기존의 포스 프로그램이 온라인 주문 서비스 회사의 프로그램 혹은 웹사이트과 연동하려면, 온라인 주문 서비스 회사가 API(Application Programming Interface)를 제공해야 하는데, 온라인 주문 서비스 회사는 이와 같은 API를 제공하지 않고 있는 실정이다. 이에 따라 매장의 매니저는 포스 프로그램의 주문 내역뿐만 아니라 서로 다른 온라인 주문 서비스 회사의 주문 내역을 일일이 확인해야 하므로 업무량이 증가할 수 있다. 특히, 매니저가 여러 매장을 관리하는 경우 업무량이 대폭 증가할 수 있다. 예를 들어, 포스 프로그램과, 온라인 주문 서비스 회사의 프로그램 또는 웹사이트가 연동되지 않기 때문에 매장 의 매니저는 매장을 방문한 고객의 주문을 처리하기 위한 포스 프로그램과, 온라인 주문 서비스의 프로그램 또 는 웹사이트 각각에 해당되는 창을 포스 단말기의 디스플레이부에 띄어놓고 영업을 해야 한다. 이에 따라 매장의 매니저는 각 창에서 표시되는 주문을 일일이 처리해야 한다. 본 발명의 경우, 운영체제는 영수증 프린팅 장치로 전송되는 주문 정보 관련 IRP(Input/output Rrquest Packet)를 수집할 수 있다. 또한, 운영체제는 서로 다른 온라인 주문 서비스 회사의 온라인 주문 서비스 장치 들에 로그인(log-in)한 상태에서 복수의 온라인 주문 서비스 장치 각각으로부터 입력받은 주문 정보 에 따라 영수증 프린팅 장치로 전송되는 주문 정보 관련 IRP(Input/output Rrquest Packet)를 수집할 수 있다. 본 발명의 운영체제는, 운영체제의 커널 레벨(kernel level)에서 주문 정보 관련 IRP(Input/output Request Packet)를 수집하는 프로그램을 포함한다. 즉, 포스 프로그램, 온라인 주문 서비스 프로그램, 온라인 주문 서비스 웹사이트에서 주문이 이루어지면, 영수 증 발급이 이루어져야 한다. 이에 따라 포스 프로그램, 온라인 주문 서비스 프로그램, 온라인 주문 서비스 웹서 버의 요청에 따라 운영체제는 영수증 프린팅 장치로 주문 관련 IRP를 전송할 수 있다. 이 때 본 발명은 영수증 프린팅 장치로 전송되는 주문 관련 IRP를 수집함으로써 포스 프로그램, 온라인 주 문 서비스 프로그램, 온라인 주문 서비스 웹사이트에서 이루어지는 주문을 통합적으로 관리할 수 있다. 예를 들어, 일반적인 경우 매장의 매니저는 포스 프로그램, 온라인 주문 서비스 프로그램, 온라인 주문 서비스 웹사이트 각각의 매출을 별도로 파악한 후 이들 매출을 합산하는 번거로운 과정을 거칠 수 있다. 이에 비하여 본 발명의 경우, 포스 단말기는 주문 정보의 항목별 데이터를 연관시켜 저장할 수 있으므로, 매장의 전체 매출뿐만 아니라 매장 고객에 따른 매출, 서로 다른 온라인 주문 서비스 회사별 매출, 메뉴별 매출, 시기별 주문 메뉴 등을 통합적으로 관리할 수 있다. 또한 본 발명에 의하여 수집된 주문 정보가 매장 관리 장치와 같은 외부 장치로 전송되는 경우, 매장 관리 장치 역시 매장의 전체 매출뿐만 아니라 매장 고객에 따른 매출, 서로 다른 온라인 주문 서비스 회사별 매출, 메뉴별 매출, 시간대별/시기별 주문 메뉴, 시간대별/시기별 매출 등을 통합적으로 관리할 수 있다. 이에 따 라 온라인 주문 서비스 장치가 API를 제공하지 않더라도 매장에 대한 통합적 관리가 가능하다. 뿐만 아니라 포스 단말기 또는 매장 관리 장치는 인공지능을 통하여 주문 정보에 대한 기계 학습을 수행함으로써 다양한 서비스를 제공할 수 있다. 예를 들어, 시간대별/시기별 주문 메뉴에 따른 고객 선호 메뉴 의 추천이라던가 시간대별/시기별 매출에 따른 식자재 및 용기의 재고 예측 등을 제공할 수 있다. 또한, 본 발명은 운영체제의 커널 레벨에서 주문 정보 관련 IRP를 수집하여 처리하므로 포스 단말기의 운 영체제를 지원하는 다양한 포스 프로그램, 다양한 입력부, 그리고 다양한 온라인 주문 서비스 장치에 서 적용가능한 범용성을 제공할 수 있다. 예를 들어, 본 발명의 운영체제는 입력부 및 영수증 프린팅 장치 의 제조회사와 상관없이 주문 정보 관련 IRP를 수집할 수 있다. 다음으로 본 발명에 의하여 수집된 주문 정보를 통하여 포장용기를 관리하는 것에 대하여 설명한다. 본 발명의 실시예에 따른 포스 장치는 네크워크를 통하여 통신부와 통신하는 포장용기 관리장치를 더 포함할 수 있다. 포장용기 관리장치는, 통신부로부터 전송된 주문 정보를 통해 포장상품 식별코드를 결정하고 포장상 품 식별코드를 기초로 포장용기의 종류 및 수량을 결정할 수 있다. 포장용기 관리장치는, 포장용기의 종류 및 수량을 기초로 포장용기 재고 데이터베이스를 갱신할 수 있다. 포장용기 관리장치는, 포장용기 재고 데이터베이스를 주기적으로 모니터링하여 기준 재고 수량 이하인 재 고 부족 포장용기의 종류를 결정할 수 있다. 포장용기 관리장치는, 재고 부족 포장용기의 종류를 기초로 관리자 단말에 재고 부족 포장용기의 주 문을 추천할 수 있다. 포스 단말기는 포장용기 관리장치와 네트워크를 통해 연결될 수 있고, 포스 단말기로부터 전송 된 주문 정보를 처리할 수 있는 컴퓨팅 장치에 해당할 수 있다. 관리자 단말은 포장용기 관리장치와 네트워크를 통해 연결될 수 있고, 포장용기 재고를 관리하는 컴 퓨팅 장치에 해당할 수 있다. 예를 들어, 반드시 이에 한정되지 않지만, 스마트폰, 노트북, 태블릿 PC 또는 컴 퓨터로 구현될 수 있다. 여기서 관리자는 매장의 매니저일 수도 있고, 매니저와는 다른 사람일 수도 있다. 관리자 단말은 포장용기 관리장치로부터 포장용기 재고 현황을 제공받거나 또는 포장용기의 추천을 기초로 포장용기를 발주처 단말에 주문할 수 있다. 발주처 단말은 포장용기 관리장치와 네트워크를 통해 연결될 수 있고 관리자 단말에 의하여 주 문된 포장용기의 정보를 포장용기 관리장치로부터 전송 받을 수 있다. 예를 들어, 포장용기 관리장치는 관리자 단말에 의해 관리되는 특정 매장에서 치킨 박스(즉, 포장용 기)의 수량이 부족한 것을 포스 단말기로부터 전송된 주문 정보에 따라 인식할 수 있고 발주처 단말 에 치킨박스 정보를 전송할 수 있다. 포장용기 관리장치는 컴퓨팅 서버로 구현될 수 있고, 포스 단말기 및 관리자 단말과 연동하여 포장용기에 대한 주문을 발주처 단말에 자동으로 발주할 수 있는 컴퓨팅 장치에 해당한다. 일 실시예에서, 포장용기 관리장치는 매장 별 포장용기의 종류 및 수량을 데이터베이스에 저장할 수 있고, 매장에서 주문이 발생할 때마다 포장용기의 종류 및 수량을 데이터베이스를 통해 갱신할 수 있다. 일 실시예에서, 데이터베이스는 새롭게 생겨난 발주처 및 새롭게 발주되는 포장용기 등을 데이터로 저장할 수 있다. 데이터베이스는 포장용기 관리장치의 요청, 주기적 또는 주요한 업데이트에 따라 데이터를 포장용기 관리장치에 전송할 수 있다. 일 실시예에서, 매니저가 포스 단말기를 통해 발주 요청을 하여도 발주처 정보에 대한 에러(Error)메시지 가 출현하는 경우 관리자의 요청에 따라 데이터베이스에서 발주처 정보를 업데이트 할 수 있다. 다른 일 실시예에서, 관리자의 요청 없이도 주요한 업데이트 사항이 있는 경우 데이터베이스에서 포장용기 관리 장치로 외부 데이터를 전송할 수 있다. 포장용기 관리장치는 포스 단말기로부터 주문 정보를 수신하면, 주문 정보를 통해 포장상품 식별코드 를 결정한다. 예를 들어, 포장용기 관리장치는 주문 정보의 메뉴 및 수량이 치킨 하나에 대한 주문이라면, 치킨 하나를 포장하는데 필요한 포장 용기로 포장상품 식별코드를 결정할 수 있다. 포장용기 관리장치는 포장상품 식별코드를 기초로 특정 포장용기의 종류 및 수량을 결정할 수 있다. 여기 에서, 포장상품 식별코드는 SKU(Stock Keeping Unit) 값에 해당할 수 있고 매니저에 의해 고유적으로 생성된 임 의 문자, 숫자 또는 이들의 조합으로 구성될 수 있다. 본 발명의 포스 단말기는 메뉴 및 수량에 따라 주문 정보에 포장상품 식별코드를 포함시켜 포장용기 관리 장치로 전송할 수 있다. 일 실시예에서, 포장용기 관리장치는 포장상품의 메뉴 변경에 따라 포장상품과 특정 포장용기의 종류 및 수량의 대응관계를 수정할 수 있다. 예를 들어, 포장용기 관리장치는 후라이드치킨 메뉴개발에 따라 후라 이드치킨 메뉴에 콘셀러드가 포함되는 경우 콘셀러드 용기를 후라이드치킨 메뉴에 대응시킬 수 있다. 일 실시예에서, 포장용기 관리장치는 주문 정보의 포장용기 식별코드와 연관된 SKU(Stock Keeping Unit)를 기초로 특정 포장상품의 종류를 결정할 수 있다. 예를 들어, 포장용기 관리장치는 SKU값이 {KIMSO(KIMCHI SOUP) - PCK(PACKING) - A1(포장용기 A1 집합) - 1(개수)}라 기재되어 있는 경우, SKU 값을 기초로 김치찌개를 하나 포장하는 경우에 A1 집합의 포장용기를 1개 필요로 한다는 정보를 인식할 수 있다. 포장용기 관리장치는 특정 포장용기의 종류 및 수량을 기초로 포장용기 재고 데이터베이스를 갱신할 수 있 다. 일 실시예에서, 포장용기 관리장치는 주문에 따라 특정 포장용기가 포장에 사용되어 재고가 소진되는 경우 포장상품에 따른 특정 포장용기의 종류 및 수량에 대한 데이터에 따라 매장 내 포장용기의 재고를 갱신할 수 있다. 다른 일 실시예에서, 포장용기 관리장치는 매장 내에 포장용기가 입고되는 경우 발주처에 주문한 포장용기 의 종류 및 수량 데이터를 기초로 매장 내 특정 포장용기의 재고를 갱신할 수 있다. 포장용기 관리장치는 포장용기 재고 데이터베이스를 주기적으로 모니터링하여 기준 재고 수량 이하인 재고 부족 포장용기의 종류를 결정할 수 있다. 예를 들어, 포장용기 관리장치는 치킨박스 용기의 개수가 30개 이하가 되는 경우 치킨박스 용기를 재고 부족 포장 용기로 결정할 수 있다. 일 실시예에서, 포장용기 관리장치는 포장용기 재고 데이터베이스의 갱신 때마다 매장 종류별 포장용기 소 비 정보를 통해 구축된 포장용기 재고 모델을 기초로 재고 부족 예상 포장용기의 종류를 결정할 수 있다. 예를 들어, 재고 부족 포장용기는 다음의 [수학식1]에 의해 결정된다. 포장용기 관리장치는 [수학식1]에서 특정 포장용기에 대한 f(x) 값이 0인 경우 재고 부족 예상 포장용기에 해당하지 아니한다고 결정하고, [수학식 1]에서 특정 포장용기에 대한 f(x) 값이 1인 경우 재고 부족 예상 포장용기에 해당한다고 결정한다. [수학식1] 은 다음과 같다.[수학식 1]"}
{"patent_id": "10-2020-0158651", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "예를 들어, 위 [수학식1]에 따라 포장용기x의 재고가 100개 있고 대상 포장용기의 하루 평균 소진량이 30개인 경우 초기값에 따라 계산을 해 보면 [수학식1]의 결과는 f(x)=1이 되고 포장용기 관리장치는 포장용기x를 재고 부족 포장용기로 결정한다. 일 실시예에서, 포장용기 관리장치는 재고 부족 예상 포장용기의 종류 결정 과정에서 동일 포장용기 발주 처 별로 포장용기의 종류 집합을 포장용기 재고 모델에 제공하여 업체별 재고 부족 예상 포장용기를 결정할 수 있다. 예를 들어, 포장용기 관리장치는 발주처 별로 매장의 재고 소진양을 검토한 데이터가 존재하는 경우, 발주 처의 데이터를 입력 받아 재고 부족 포장용기를 결정할 수 있다. 포장용기 관리장치는 기준 재고 수량 이하라고 판단한 포장용기에 대해 재고 부족을 관리자 단말에게 알리고 주문을 추천할 수 있다. 일 실시예에서, 포장용기 관리장치는 재고 부족 포장용기의 종류가 결정되 면 동일 포장용기 발주처에 의해 제조되는 다른 포장용기의 재고 수량을 기초로 재고 부족 포장용기와 함께 추 천할 수 있다. 예를 들어, 포장용기 관리장치는 산출된 재고 부족 포장 용기의 발주처를 추천함과 동시에, 발주의 경제성 및 편의성 재고를 위해 동일 발주처에서 제공하는 포장용기를 함께 추천할 수 있다. 포장용기 관리장치는 재고 부족 포장용기의 종류를 기초로 포장용기 주문 입찰 문서를 생성하고 적어도 하 나의 포장용기 발주처에 의한 가격 입찰을 기초로 특정 포장용기 발주처 정보를 추천에 포함시킬 수 있다. 예를 들어, 포장용기 관리장치는 특정 발주처가 특정 포장용기의 할인행사를 진행하는 이벤트가 있는 경우 에는 해당 포장용기 발주처 정보를 추천에 포함시킬 수 있다.일 실시예에서, 포장용기 관리장치는 특정 포장용기 발주처 정보에 따른 추천이 성공적으로 수행되면 배송 지의 주소를 중심으로 결정되는 특정 영역 상에서 새롭게 발생되는 주문에 대한 우선 추천권을 일정 시간 동안 특정 포장용기 발주처에 제공할 수 있다. 예를 들어, 포장용기 포장용기가 성공적으로 발주된 경우, 다음 발주 시에는 동일한 발주처를 추천하거나 관리자의 배송지 주소를 기반으로 발주처를 추천할 수 있다. 다른 실시예에서, 관리자는 포장용기가 성공적으로 발주된 경우, 발주처에 대한 피드백을 진행할 수 있고 포장 용기 관리장치는 다음 발주시에 과거 관리자의 피드백에 근거하여 발주처를 추천할 수 있다. 도 3은 본 발명의 일 실시예에 따른 포장상품의 식별코드에 따른 특정 포장용기의 종류 및 수량을 결정하는 과 정을 설명하는 도면이다. 도 3은 포스 단말기, 포장상품에 대응하는 특정용기 집합 테이블(T1), 특정용기 집합 테이블(T2) 및 포장용기 재고를 포함한다. 포스 단말기 및 포장용기 관리장치 중 적어도 하나는 주문 정보를 입력받고 주문에 따른 특정용기를 대응시키는 역할을 수행한다. 포장상품과 특정용기의 대응관계는 특정용기 집합 테이블(T1)과 특정용기 집합 테 이블(T2)에 따라 정해진다. 특정용기 집합 테이블는 포스 단말기의 메모리부(RM)나 포장용기 관리장치 의 데이터베이스에 저장될 수 있다. 포장상품에 대응하는 특정용기 집합 테이블(T1)은 포장상품의 주문에 따라 특정용기 집합을 대응관계를 나타낸 다. 예를 들어, 포장상품에 대응하는 특정용기 집합 테이블(T1)은 1번 테이블을 통해 A1 특정용기 집합과 주문 A간의 대응관계를 나타낼 수 있다. 일 실시예에서, 포장용기 관리장치는 포장상품의 변경 또는 새로운 메뉴 개발에 따라 포장상품에 대응하는 특정용기 집합 테이블(T1)을 수정할 수 있다. 예를 들어, 포장용기 관리장치는 포장상품에 대응하는 특정 용기 집합 테이블(T1)이 A(김치찌게)의 주문에 대해서 기존의 A1 포장용기 집합(김치찌개 통, 공기밥 통 및 반 찬통 3개)이 대응되었으나 메뉴의 변경에 따라 반찬을 5개 제공하는 경우, 포장상품에 대응하는 특정용기 집합 테이블(T1)을 A(김치찌개)의 주문에 대해서 A2 포장용기 집합(김치찌개 통, 공기밥 통 및 반찬통 5개)을 제공하 는 것으로 대응관계를 변경할 수 있다. 특정용기 집합 테이블(T2)은 각각의 특정용기 집합에 따른 특정용기의 종류 및 수량을 나타낸다. 예를 들어, 특 정용기 집합 테이블(T2)은 A1 특정 용기 집합과 그에 필요한 특정용기(70파이 3개, 105파이 2개, 70호 2개, 84 호 1개, 젓가락 4개 및 비닐 1개)의 대응관계를 나타낼 수 있다. 일 실시예에서, 포장용기 관리장치는 기존메뉴 변경에 따라서 포장용기 집합 A1의 구성을 변경할 수 있고, 새로운 메뉴 생성에 따라서 새로운 포장용기 집합 C1 등을 생성할 수 있다. 포장용기 재고(T3)는 특정용기의 소진에 따라 포장용기 관리장치에 의해 포장용기 재고 데이터베이스가 갱 신될 수 있다. 일실시예에서, 포장용기 관리장치는 포장용기 재고의 데이터를 입력 받아 부족 포장용기의 종류를 결정할 수 있다. 예를 들어, 특정용기 집합 테이블는 특정 포장용기 69호의 기준재고가 30개이고 특정 포장용기 69호의 현재 재고가 25개 인 경우에는, 특정 포장용기 69호를 부족 포장용기로 결정할 수 있다. 다음으로 도면을 참조하여 인공지능 기반의 포장용기 관리장치에 대해 설명한다. 포장용기 관리장치는, 주문 정보와 포장용기 재고 데이터를 포함하는 주문 정보를 통신부로부터 수집 할 수 있다. 포장용기 관리장치는 주문 정보를 전처리하여 인공지능 처리용 주문 데이터를 생성할 수 있다. 포장용기 관리장치는 인공지능 처리용 주문 데이터를 포장용기 재고 예측 모델에 입력하여 포장용기 재고 소진 정보를 결정할 수 있다. 포장용기 관리장치는 관리자 단말에 포장용기 재고 소진 정보를 제공할 수 있다. 관리자 단말은 포장용기 재고를 확인할 수 있으며, 포장용기 관리장치로부터 제공된 포장용기 재고 소진 정보에 대해 생산자에게 제공하기 위해 시각화시킬 수 있다. 포장용기 관리장치는 포장용기 재고 처리 과정에서 생성된 데이터를 포스 및 관리자 단말에 전송할 수 있다. 또한, 포장용기 관리장치는 포장용기 재고 처리 과정에서 생성된 데이터를 데이터 베이스에 저장 하여 데이터를 백업하거나 데이터를 클라우드화 시킬 수 있다. 예를 들어, 포장용기 관리장치는 지속적인 주문 정보의 발생에 따라 변동되는 포장용기 재고 소진 정보를 갱신하여 자동으로 데이터를 데이터 베이스를 갱신할 수 있다. 일 실시예에서, 관리자는 데이터베이스에 저장되어 있는 포장용기 재고 소진 정보를 생산자에게 제공할 수 있다. 데이터베이스는 포장용기를 생산하는 업체의 리스트 정보를 저장할 수 있다. 예를 들어, 데이터베이스는 특정 포장용기를 판매하는 업체의 리스트와 해당 업체의 특정 포장용기 예상 단가, 예상 발주 기간 및 생산능력 을 저장할 수 있다. 다른 예를 들어, 데이터베이스는 네트워크를 통해 특정 포장용기를 판매하는 업체로부터 포장용기 생산 단가, 발주 기간 및 생산능력에 대한 정보를 입력 받아 갱신할 수 있다. 또한, 데이터베이스는 포장용기 관리장치의 요청 및 일정한 주기에 따라 포장용기를 판매하는 업체의 정보 를 포장용기 관리장치에 제공할 수 있다. 포장용기 관리장치는 포스 단말기로부터 포장용기 재고 데이터를 포함하는 주문 정보를 수집할 수 있 다. 예를 들어, 포장용기 관리장치는 주문 정보에 따라서 필요한 포장용기의 종류 및 개수를 결정하고 주 문이 발생한 시간, 장소에 대한 정보를 주문 정보로 수집할 수 있다. 일 실시예에서, 포장용기 관리장치는 주문 정보를 전송이 가능한 형태의 파일로 변환하여 클라우드에 저장 할 수 있다. 클라우드는 포장용기 관리장치가 아닌 네트워크를 통해 연결된 다른 장치로 데이터를 저장하 거나 처리할 수 있다. 예를 들어, 포장용기 관리장치는 주문 정보를 클라우드에 저장하여, 장소에 구애받지 않고 관리자 단말 을 통해 주문 정보에 대해서 접근 및 관리할 수 있다. 다른 예를 들어, 포장용기 관리장치는 주문 정보를 클라우드에 저장하는 과정에서, 가용 클라우드 자원에 배치작업을 실행할 수 있고 가용 클라우드 자원을 선별하는 과정에서 가용 클라우드 자원 간의 최소 비용 매칭 으로 주문 정보를 클라우드에 배치할 수 있다. 좀 더 구체적으로 최소 비용 매칭은 주문 정보의 모든 태스크를 처리하고 배치하는데 소요되는 비용의 총 합이 최소가 될 수 있는 매칭 조합을 통해 결정될 수 있다. 포장용기 관리장치는 주문 정보를 전처리하여 인공지능 처리용 주문 데이터를 생성할 수 있다. 예를 들어, 포장용기 관리장치는 주문 정보에 저장되어 있는 포장용기의 종류, 수량, 소진 시간, 소진된 장소에 따라 서 헤더 테이블(HT)을 작성하고 그에 따른 전위 트리(PT)를 생성하여 주문 정보를 전처리 할 수 있다. 이에 대 한 자세한 설명은 이후에 도면을 참조하여 설명한다. 일 실시예에서, 포장용기 관리장치는 주문 정보를 기초로 주문에 따른 포장용기의 종류와 수량을 결정할 수 있다. 예를 들어, 포장용기 관리장치는 고객이 부대찌개를 주문하는 경우 부대찌개 메뉴와 대응하는 국 용기 1개, 반찬 용기 3개 및 공기밥 용기 1개를 결정할 수 있다. 일 실시예에서, 포장용기 관리장치는 포장용기의 종류와 수량이 결정되면 포장용기의 재고량을 산출하여 인공지능 처리용 주문 데이터를 생성할 수 있다. 예를 들어, 포장용기 관리장치는 소모되는 포장용기의 종 류와 수량에 따라 영세업체에 남아 있는 포장용기 재고량을 산출할 수 있다. 포장용기 관리장치는 인공지능 처리용 주문 데이터를 포장용기 재고 예측 모델에 입력하여 포장용기 재고 소진 정보를 결정할 수 있다. 예를 들어, 포장용기 관리장치는 전처리된 인공지능 처리용 주문 데이터를생산자에게 제공하기 위한 메타데이터를 생성하기위해 포장용기 재고 예측 모델에 입력하여 예측된 포장용기 재 고 소진 정보를 결정할 수 있다. 일 실시예에서, 포장용기 관리장치는 기존에 수집된 인공지능 처리용 주문 데이터를 통해 요일별 시간별 재고 수량 변화율을 기계학습하여 포장용기 재고 예측 모델을 생성할 수 있다. 예를 들어, 포장용기 관리장치는 수집된 인공지능 처리용 주문 데이터에서 일요일에 짜장면 용기가 많이 소모되는 경우, 반복된 인공지능 처리용 주문 데이터의 기계학습을 통해 포장용기 재고 예측 모델을 생성하고 기계학습을 통행 생성된 포장용기 재고 예측 모델을 기반으로 포장용기 재고 소진 정보를 결정할 수 있다. 일 실시예에서, 포장용기 관리장치는 포장용기 재고 예측 모델 및 조달기간을 고려하여 발주시점을 같이 제공하는 포장용기 재고 소진 정보를 결정할 수 있다. 포장용기 관리장치는 포장용기 재고 예측 모델에서 결정된 재고 소진 정보에 더해 포장용기 제조업체에서 영세업체까지의 조달 기간을 고려하여 한계 발주시점을 계산하여 이러한 한계 발주시점을 포함하는 포장용기 재고 소진 정보를 결정할 수 있다. 예를 들어, 포장용기 관리장치는 특정 포장용기에 대한 조달기간이 3일이고 재고 소진 정보에 의한 재고 소진일이 2020.8.19(수)인 경우, 주말을 제외한 2020.8.14(금)을 한계 발주시점으로 결정할 수 있다. 일 실시예에서, 포장용기 관리장치는 포장용기 재고소진 정보를 제공할 때, 포장용기 소진 전에 제작 가능 한 업체를 검색하고 포장용기 제작업체를 리스트로 결정할 수 있다. 예를 들어, 포장용기 관리장치는 포장 용기 재고 소진 정보에 기초하여 A1용기가 부족할 것으로 예상되는 경우 해당 A1용기를 생산하는 업체를 리스트 로 결정할 수 있다. 일 실시예에서, 포장용기 관리장치는 검색된 포장용기 제조 업체 중 관리자 단말에 의해 선택된 포장 용기 제조 업체에 예상 배송일 및 예상 단가를 요청하여 예상 배송일이 포장용기 소진 예상일보다 늦지 않은 경 우에는 관리자 단말의 승인하에 포장용기 제조 업체에 포장용기 배송 주문을 신청할 수 있다. 예를 들어, 포장용기 관리장치는 제조 업체로부터 예상 배송일 및 예상 단가를 요청하여 얻은 정보를 제조 업체에 다시 배포하여 역경매 방식으로 다시 배송일 및 예상 단가를 요청할 수 있다. 일 실시예에서, 포장용기 관리장치는 포장용기 재고 예측 모델을 통해 포장용기와 연관되게 이용되는 포장 용기를 결정하고 저장 용기 제조 업체에 주문 가능 여부를 질의하여 가능한 경우 연관되게 이용되는 포장용기를 함께 주문할 수 있다. 예를 들어, 포장용기 관리장치는 배송 단가를 낮추기 위해 포장용기 재고 예측 모델을 통해 결정된 포장용 기와 연관되게 이용되는 포장용기를 같이 생산 및 발주할 수 있도록 연관 포장용기를 결정할 수 있다. 포장상품의 식별코드에 따른 특정 포장용기의 종류 및 수량을 결정하는 과정은 앞서 도 3을 통하여 설명되었으 므로 이에 대한 설명은 생략된다. 도 4를 참조하면 데이터를 헤더 테이블 및 전위 트리에 배치하는 것은 헤더 테이블(HT) 및 전위 트리(PT)를 포 함한다. 헤더 테이블(HT)는 포장 용기에 대한 정보를 저장하는 엔트리로 구성되며, 각 엔트리는 포장용기의 이름, 소진 수량, 소진시간, 소진장소, 및 링크로 구성된다. 링크는 포장 용기의 전위 트리(PT)에서의 노드 위치를 나타낸 다. 전위 트리(PT)는 적어도 하나의 노드로 구성된다. 일 실시예에서, 전위 트리(PT)는 포장용기의 종류에 따라 정 해질 수 있다. 예를 들어, 포장용기 관리장치는 전위 트리(PT)에서 국그릇 집단은 B용기 집단의 구성 용기 인 B1, B2 용기를 B용기 집단의 자식 노드에 위치시킬 수 있다. 본 발명의 실시예에 따른 포스 장치의 주문 정보 처리 방법은 포스 장치가, 하나 이상의 온라인 주문 서비스 장 치 및 포스 장치에 연결된 입력부 중 적어도 하나로부터 주문 정보를 입력받는 단계; 포스 장치에 연 결된 영수증 프린팅 장치가 주문 정보에 따라 영수증을 출력할 때 포스 장치의 운영체제가 영수증 프린팅 장치로 전송되는 주문 정보를 수집하는 단계; 포스 장치가 수집한 주문 정보를 연관시켜 저장하거나 연관된 주문 정보를 외부로 전송하는 단계를 포함한다. 이와 같은 주문 정보 처리 방법에 대해서는 앞서 설명된 포스 장치를 통하여 설명되었으나 본 발명의 주문 정보 처리 방법이 앞서 설명된 포스 장치에 한정되는 것은 아니다. 또한, 본 발명의 실시예에 따른 컴퓨터 해독가능한 기록매체는, 포스 장치가, 하나 이상의 온라인 주문 서비스 장치 및 포스 장치에 연결된 입력부 중 적어도 하나로부터 주문 정보를 입력받는 기능, 포스 장치에 연결된 영수증 프린팅 장치가 주문 정보에 따라 영수증을 출력할 때 포스 장치의 운영체제가 영수증 프린 팅 장치로 전송되는 주문 정보를 수집하는 기능; 포스 장치가 수집한 주문 정보를 연관시켜 저장하거나 연 관된 주문 정보를 외부로 전송하는 기능을 실현시키기 위한 프로그램을 기록한다. 이상과 같이 본 발명에 따른 실시예를 살펴보았으며, 앞서 설명된 실시예 이외에도 본 발명이 그 취지나 범주에 서 벗어남이 없이 다른 특정 형태로 구체화 될 수 있다는 사실은 해당 기술에 통상의 지식을 가진 이들에게는 자명한 것이다. 그러므로, 상술된 실시예는 제한적인 것이 아니라 예시적인 것으로 여겨져야 하고, 이에 따라 본 발명은 상술한 설명에 한정되지 않고 첨부된 청구항의 범주 및 그 동등 범위 내에서 변경될 수도 있다."}
{"patent_id": "10-2020-0158651", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 네트워크에 접속된 본 발명의 실시예에 따른 포스 장치의 일례를 나타낸다. 도 2는 본 발명의 실시예에 따른 포스 장치에 포함된 포스 단말기의 일례를 나타낸다. 도 3은 본 발명의 일 실시예에 따른 포장상품의 식별코드에 따른 특정 포장용기의 종류 및 수량을 결정하는 과 정을 설명하는 도면이다. 도 4는 데이터를 전처리 하는 과정에서 일 실시예에 따른 데이터를 헤더 테이블 및 전위 트리에 배치하는 것을 설명하는 도면이다."}
