{"patent_id": "10-2022-0178679", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0012264", "출원번호": "10-2022-0178679", "발명의 명칭": "입력 전압 센서리스 브릿지리스 PFC 전력 변환 장치 제어 방법 및 그 장치", "출원인": "삼성전자주식회사", "발명자": "안효민"}}
{"patent_id": "10-2022-0178679", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "역률보상 전력 변환 장치의 입력 전압을 충전하는 DC 링크 커패시터; (\"입력 전압 센서 없는\"이라는 한정을 독립항에서는 삭제하고, 종속항에 추가바랍니다. 만일, 이러한 한정이 없으면, 특허성이 현저히 낮아진다면, 독립항에 유지바랍니다) (회피설계가 용이하지 않도록 하기 위한 수정 요청임)상기 DC 링크 커패시터 양단의 전압을 센싱하는 출력전압 센서; 및상기 출력전압 센서를 통해 센싱된 상기 DC 링크 커패시터 양단의 전압으로부터 맥동 전압을 추출하고,상기 맥동 전압으로부터 상기 맥동 전압의 주파수와 위상을 추출하고,상기 추출된 맥동 전압의 주파수로부터 추정 입력 전압의 주파수를 결정하고,상기 DC 링크 커패시터 양단의 전압에 기초하여 상기 추정 입력 전압의 위상이 상기 입력 전압의 위상과 동상인지 혹은 역상인지를 판별하고, 상기 추정 입력 전압의 위상이 역상이면 상기 추정 입력 전압 위상을 상기 입력전압의 위상과 동상이 되도록 보정하고, 및상기 보정에 기초하여 역률 제어를 수행하도록 제어하는 적어도 하나의 프로세서를 포함하는 역률보상 전력 변환 장치.(카테고리는 \"입력 전압 센서 없는\"라는 한정을 삭제바랍니다. 상기 이유와 같이 회피설계를 고려한 수정 요청임)"}
{"patent_id": "10-2022-0178679", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 상기 역률보상 전력 변환 장치는 입력 전압 센서없는 역률보상 전력 변환 장치이고,상기 적어도 하나의 프로세서는 상기 맥동 전압의 주파수를 0.5배하여 상기 추정 입력 전압의 주파수를 결정하는 것을 특징으로 하는 역률보상 전력 변환 장치."}
{"patent_id": "10-2022-0178679", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서, 상기 적어도 하나의 프로세서는 상기 DC 링크 커패시터 양단의 전압으로부터 상기 맥동 전압의 위상에 기초하여상기 추정 입력 전압의 위상을 보정하는 것을 특징으로 하는 역률보상 전력 변환 장치."}
{"patent_id": "10-2022-0178679", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서, 상기 적어도 하나의 프로세서는 상기 DC 링크 커패시터 양단의 전압이 승압되면, 상기 추정 입력 전압의 위상이상기 입력 전압의 위상과 동상으로 판단하고, 상기 DC 링크 커패시터 양단의 전압이 승압되지 않으면, 상기 추정 입력 전압의 위상이 상기 입력 전압의 위상과 역상으로 판단하는 것을 특징으로 하는 역률보상 전력 변환 장치."}
{"patent_id": "10-2022-0178679", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2024-0012264-3-제 1 항에 있어서,상기 역률보상 전력 변환 장치는 입력 전압 센서 없는 토템폴 브릿지리스 역률보상 전력 변환 장치이고,상기 적어도 하나의 프로세서는 상기 토템폴 브릿지리스 역률보상 전력 변환 장치에서 2개의 스위치를 포함하는하나의 레그에서 하나의 스위치만 동작시키는 모드 1으로 스위치를 동작시켜 상기 DC 링크 커패시터에 승압이발생하면, 상기 추정 입력 전압의 위상과 상기 입력 전압의 위상이 동상인 것으로 판단하는 것을 특징으로 하는역률보상 전력 변환 장치."}
{"patent_id": "10-2022-0178679", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서, 상기 적어도 하나의 프로세서는 상기 DC 링크 커패시터의 전압이 승압 임계전압을 넘어서면 상기 승압이 발생한것으로 판단하는 것을 특징으로 하는 역률보상 전력 변환 장치."}
{"patent_id": "10-2022-0178679", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서,상기 역률보상 전력 변환 장치는 입력 전압 센서 없는 토템폴 브릿지리스 전력 변환 장치이고,상기 적어도 하나의 프로세서는 상기 입력전압 센서 없는 역률보상 전력 변환 장치에서 2개의 스위치를 포함하는 레그에서 하나의 스위치만 동작시키는 모드 1으로 스위치를 동작시켜 상기 DC 링크 커패시터에 승압이 발생하지 않으면, 상기 추정 입력 전압의 위상과 상기 입력 전압의 위상이 역상인 것으로 판단하는 것을 특징으로하는 역률보상 전력 변환 장치."}
{"patent_id": "10-2022-0178679", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서,상기 적어도 하나의 프로세서는 상기 추정 입력 전압의 위상과 상기 입력 전압의 위상이 역상인 것으로 판단한것에 기초하여 상기 추정 입력 전압의 위상을 180도 지연시켜서 상기 추정 입력 전압의 위상을 보정하는 것을특징으로 하는 역률보상 전력 변환 장치."}
{"patent_id": "10-2022-0178679", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서,상기 적어도 하나의 프로세서는 상기 추정 입력 전압의 위상과 상기 입력 전압의 위상이 동상으로 된 후에 상기입력전압 센서 없는 역률보상 전력 변환 장치에서 상기 2개의 스위치를 서로 상보 스위칭하는 모드 2로 스위치를 동작시켜 역률보상을 수행하는 것을 특징으로 하는 역률보상 전력 변환 장치."}
{"patent_id": "10-2022-0178679", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 1 항에 있어서,상기 역률보상 전력 변환 장치는 입력 전압 센서 없는 토템폴 브릿지리스 역률보상 전력 변환 장치이고,상기 적어도 하나의 프로세서는 상기 토템폴 브릿지리스 역률보상 전력 변환 장치에서 2개의 스위치를 포함하는각각의 레그에서 하나의 스위치만 동작시키는 모드 1으로 스위치를 동작시켜 상기 DC 링크 커패시터에 승압이발생하면, 상기 추정 입력 전압의 위상과 상기 입력 전압의 위상이 동상인 것으로 판단하는 것을 특징으로 하는역률보상 전력 변환 장치.공개특허 10-2024-0012264-4-청구항 11 제 10 항에 있어서,상기 적어도 하나의 프로세서는 상기 추정 입력 전압의 위상과 상기 입력 전압의 위상이 동상으로 된 후에 상기입력전압 센서 없는 역률보상 전력 변환 장치에서 상기 각각의 레그에 포함된 2개의 스위치를 서로 상보 스위칭하는 모드 2로 스위치를 동작시켜 역률보상을 수행하는 것을 특징으로 하는 역률보상 전력 변환 장치."}
{"patent_id": "10-2022-0178679", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 1 항에 있어서,상기 역률보상 전력 변환 장치는 입력 전압 센서 없는 세미 브릿지리스 전력 변환 장치이고,상기 적어도 하나의 프로세서는 상기 세미 브릿지리스 전력 변환 장치에서 스위치가 1개씩 포함되는 각 레그에서 하나의 스위치만 동작시키는 모드 1으로 스위치를 동작시켜 상기 DC 링크 커패시터에 승압이 발생하면, 상기추정 입력 전압의 위상과 상기 입력 전압의 위상이 동상인 것으로 판단하는 것을 특징으로 하는 역률보상 전력변환 장치."}
{"patent_id": "10-2022-0178679", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 11 항에 있어서,상기 역률보상 전력 변환 장치는 입력 전압 센서 없는 세미 브릿지리스 전력 변환 장치이고, 상기 적어도 하나의 프로세서는 상기 추정 입력 전압의 위상과 상기 입력 전압의 위상이 동상으로 된 후에 상기입력전압 센서 없는 역률보상 전력 변환 장치의 모드 1 운전을 유지하는 것을 특징으로 하는 역률보상 전력 변환 장치."}
{"patent_id": "10-2022-0178679", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 1 항에 있어서,상기 적어도 하나의 프로세서가 상기 맥동 전압을 추출하기 위해, 상기 DC 링크 커패시터 양단의 전압을 밴드패스 필터링할 때 발생하는 지연 및 디지털 샘플링할 때 발생하는 지연 중 적어도 하나에 따른 지연을 보상하는것을 특징으로 하는 역률보상 전력 변환 장치."}
{"patent_id": "10-2022-0178679", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "역률보상 전력 변환 장치의 입력 전압을 DC 링크 커패시터에 충전하는 단계; 상기 DC 링크 커패시터 양단의 전압을 출력전압 센서를 통해 센싱하는 단계; 상기 출력전압 센서를 통해 센싱된 상기 DC 링크 커패시터 양단의 전압으로부터 맥동 전압을 추출하는 단계;상기 맥동 전압으로부터 상기 맥동 전압의 주파수와 위상을 추출하는 단계;상기 추출된 맥동 전압의 주파수로부터 추정 입력 전압의 주파수를 결정하는 단계;상기 DC 링크 커패시터 양단의 전압에 기초하여 상기 추정 입력 전압의 위상이 상기 입력 전압의 위상과 동상인지 혹은 역상인지를 판별하는 단계;상기 추정 입력 전압의 위상이 역상이면 상기 추정 입력 전압 위상을 상기 입력 전압의 위상과 동상이 되도록보정하는 단계; 및공개특허 10-2024-0012264-5-상기 보정에 기초하여 역률 제어를 수행하도록 제어하는 단계를 포함하는, 역률보상 전력 변환 장치에서 역률보상 방법."}
{"patent_id": "10-2022-0178679", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 15 항에 있어서,상기 역률보상 전력 변환 장치는 입력 전압 센서 없는 토템폴 브릿지리스 역률보상 전력 변환 장치이고,상기 추정 입력 전압의 위상이 상기 입력 전압의 위상과 동상인지 혹은 역상인지를 판별하는 단계는, 상기 토템폴 브릿지리스 역률보상 전력 변환 장치에서 2개의 스위치를 포함하는 하나의 레그에서 하나의 스위치만 동작시키는 모드 1으로 스위치를 동작시키는 단계;상기 모드 1 동작에 기초하여, 상기 DC 링크 커패시터에 승압이 발생하면 상기 추정 입력 전압의 위상과 상기입력 전압의 위상이 동상인 것으로 판단하는 단계를 포함하는, 역률보상 전력 변환 장치에서 역률 보상 방법."}
{"patent_id": "10-2022-0178679", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 15 항에 있어서,상기 역률보상 전력 변환 장치는 입력 전압 센서 없는 토템폴 브릿지리스 역률보상 전력 변환 장치이고,상기 추정 입력 전압의 위상이 상기 입력 전압의 위상과 동상인지 혹은 역상인지를 판별하는 단계는, 상기 토템폴 브릿지리스 역률보상 전력 변환 장치에서 2개의 스위치를 포함하는 하나의 레그에서 하나의 스위치만 동작시키는 모드 1으로 스위치를 동작시키는 단계;상기 모드 1 동작에 기초하여, 상기 DC 링크 커패시터에 승압이 발생하지 않으면 상기 추정 입력 전압의 위상과상기 입력 전압의 위상이 역상인 것으로 판단하는 단계를 포함하는, 역률보상 전력 변환 장치에서 역률 보상 방법."}
{"patent_id": "10-2022-0178679", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 17 항에 있어서,상기 추정 입력 전압 위상을 상기 입력 전압의 위상과 동상이 되도록 보정하는 단계는,상기 추정 입력 전압의 위상과 상기 입력 전압의 위상이 역상인 것으로 판단한 것에 기초하여 상기 추정 입력전압의 위상을 180도 지연시켜서 상기 추정 입력 전압의 위상을 보정하는 단계를 포함하는, 역률보상 전력 변환장치에서 역률 보상 방법."}
{"patent_id": "10-2022-0178679", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 15 항에 있어서,상기 역률보상 전력 변환 장치는 입력 전압 센서 없는 세미 브릿지리스 전력 변환 장치이고,상기 추정 입력 전압의 위상이 상기 입력 전압의 위상과 동상인지 혹은 역상인지를 판별하는 단계는, 상기 세미 브릿지리스 역률보상 전력 변환 장치에서 하나의 스위치를 포함하는 각 레그에서 상기 하나의 스위치만 동작시키는 모드 1으로 스위치를 동작시키는 단계;상기 모드 1 동작에 기초하여, 상기 DC 링크 커패시터에 승압이 발생하면 상기 추정 입력 전압의 위상과 상기입력 전압의 위상이 동상인 것으로 판단하고, 승압이 발생하지 않으면 상기 추정 입력 전압의 위상과 상기 입력전압의 위상이 역상인 것으로 판단하는 단계를 포함하는, 역률보상 전력 변환 장치에서 역률 보상 방법.공개특허 10-2024-0012264-6-청구항 20 제 19 항에 있어서,상기 보정에 기초하여 역률 제어를 수행하도록 제어하는 단계는, 상기 추정 입력 전압의 위상과 상기 입력 전압의 위상이 동상으로 된 후에 상기 입력전압 센서 없는 역률보상전력 변환 장치의 모드 1 운전을 유지하여 상기 역률 제어를 수행하도록 제어하는 단계를 포함하는, 역률보상전력 변환 장치."}
{"patent_id": "10-2022-0178679", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 일 실시예에 따른 역률보상 전력 변환 장치는, 입력 전압 센서 역률보상 전력 변환 장치의 입력 전압 을 충전하는 DC 링크 커패시터, DC 링크 커패시터 양단의 전압을 센싱하는 출력전압 센서, 및 출력전압 센서를 통해 센싱된 DC 링크 커패시터 양단의 전압으로부터 맥동 전압을 추출하고, 맥동 전압으로부터 맥동 전압의 주파 수와 위상을 추출하고, 추출된 맥동 전압의 주파수로부터 추정 입력 전압의 주파수를 결정하고, DC 링크 커패시 터 양단의 전압에 기초하여 추정 입력 전압의 위상이 입력 전압의 위상과 동상인지 혹은 역상인지를 판별하고, 추정 입력 전압의 위상이 역상이면 추정 입력 전압 위상을 입력 전압의 위상과 동상이 되도록 보정하고, 및 상기 보정에 따라 역률 제어를 수행하도록 제어하는 적어도 하나의 프로세서를 포함한다."}
{"patent_id": "10-2022-0178679", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시의 일 실시예들은 본 개시는 디지털 제어를 수행하는 역률 보상(PFC: power factor correction) 회로의 일종인 브릿지리스 PFC 컨버터(bridgeless PFC converter)의 입력 전압 센서리스 제어 방법과 그러한 방법을 채 용한 브릿지리스 PFC 전력 변환 장치에 관한 것이다."}
{"patent_id": "10-2022-0178679", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "가전기기를 포함하여 모든 전기기기는 전력 손실을 줄이고 전력 효율을 최적으로 하는 것이 전력 사용 측면에서 유리하다. 또한, 전력 변환 장치와 같은 전기기기는 높은 스위칭 주파수로 구동되므로, 전력 변환 장치에서 사 용되는 부품을 줄이면 원가를 줄일 수 있고, 고장 확률도 떨어뜨릴 수 있다. 따라서, 입력 전압 센서 없이도 역 률 보상 전력 변환 장치의 스위치 제어를 할 수 있는 브릿지리스 PFC 전력 변환(PFC converter) 장치가 필요하 다."}
{"patent_id": "10-2022-0178679", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시예에 따른 입력 전압 센서 없는 역률보상 전력 변환 장치는, 역률보상 전력 변환 장치의 입력 전압을 충전하는 DC 링크 커패시터, DC 링크 커패시터 양단의 전압을 센싱하는 출력전압 센서, 및 출력전압 센 서를 통해 센싱된 DC 링크 커패시터 양단의 전압으로부터 맥동 전압을 추출하고, 맥동 전압으로부터 맥동 전압 의 주파수와 위상을 추출하고, 추출된 맥동 전압의 주파수로부터 추정 입력 전압의 주파수를 결정하고, DC 링크 커패시터 양단의 전압에 기초하여 추정 입력 전압의 위상이 입력 전압의 위상과 동상인지 혹은 역상인지를 판별 하고, 추정 입력 전압의 위상이 역상이면 추정 입력 전압 위상을 입력 전압의 위상과 동상이 되도록 보정하고, 및 보정에 기초하여 역률 제어를 수행하도록 제어하는 적어도 하나의 프로세서를 포함한다. 일 실시예에서, 역률보상 전력 변환 장치는 입력 전압 센서없는 역률보상 전력 변환 장치이고, 적어도 하나의 프로세서는 상기 맥동 전압의 주파수를 0.5배하여 상기 추정 입력 전압의 주파수를 결정하는 것을 특징으로 한 다. 본 개시의 일 실시예에 따른 역률보상 전력 변환 장치에서 역률보상 방법은, 역률보상 전력 변환 장치의 입력 전압을 DC 링크 커패시터에 충전하는 단계, DC 링크 커패시터 양단의 전압을 출력전압 센서를 통해 센싱하는 단 계, 출력전압 센서를 통해 센싱된 DC 링크 커패시터 양단의 전압으로부터 맥동 전압을 추출하는 단계, 맥동 전 압으로부터 맥동 전압의 주파수와 위상을 추출하는 단계, 추출된 맥동 전압의 주파수로부터 추정 입력 전압의 주파수를 결정하는 단계, DC 링크 커패시터 양단의 전압에 기초하여 추정 입력 전압의 위상이 입력 전압의 위상 과 동상인지 혹은 역상인지를 판별하는 단계, 추정 입력 전압의 위상이 역상이면 추정 입력 전압 위상을 입력 전압의 위상과 동상이 되도록 보정하는 단계 및 보정에 기초하여 역률 제어를 수행하도록 제어하는 단계를 포함 한다."}
{"patent_id": "10-2022-0178679", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시에서 사용되는 용어에 대해 간략히 설명하고, 본 개시의 일 실시예에 대해 구체적으로 설명하기로 한다. 본 개시에서 사용되는 용어는 본 개시의 일 실시예에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적 인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 본 개시의 실 시예의 설명 부분에서 상세히 그 의미를 기재할 것이다. 따라서 본 개시에서 사용되는 용어는 단순한 용어의 명 칭이 아닌, 그 용어가 가지는 의미와 본 개시의 전반에 걸친 내용을 토대로 정의되어야 한다. 본 개시 전체에서 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다 른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있음을 의미한다. 또한, 본 개시에 기재된 \"...부\", \"모듈\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어 또는 소프트웨어로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 아래에서는 첨부한 도면을 참고하여 본 개시의 실시예에 대하여 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 개시의 일 실시예는 여러 가지 상이한 형태 로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 개시의 일 실시예를 명 확하게 설명하기 위해서 설명과 관계없는 부분은 생략하였으며, 본 개시 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 본 개시의 일 실시예에 의하면, 브릿지리스 PFC 전력 변환 장치에서 입력 전압 센서 없이 입력 전압을 추정하여 PFC 제어를 하도록 하는 브릿지리스 전력 변환 장치와 이러한 전력 변환 장치를 제어하는 방법이 요구된다. 본 개시의 일 실시예에 따른 입력 전압 센서 없는 역률보상 전력 변환 장치는, 역률보상 전력 변환 장치의 입력 전압을 충전하는 DC 링크 커패시터, DC 링크 커패시터 양단의 전압을 센싱하는 출력전압 센서, 및 출력전압 센 서를 통해 센싱된 DC 링크 커패시터 양단의 전압으로부터 맥동 전압을 추출하고, 맥동 전압으로부터 맥동 전압 의 주파수와 위상을 추출하고, 추출된 맥동 전압의 주파수로부터 추정 입력 전압의 주파수를 결정하고, DC 링크 커패시터 양단의 전압에 기초하여 추정 입력 전압의 위상이 입력 전압의 위상과 동상인지 혹은 역상인지를 판별 하고, 추정 입력 전압의 위상이 역상이면 추정 입력 전압 위상을 입력 전압의 위상과 동상이 되도록 보정하고, 및 보정에 기초하여 역률 제어를 수행하도록 제어하는 적어도 하나의 프로세서를 포함한다. 일 실시예에서, 역률보상 전력 변환 장치는 입력 전압 센서없는 역률보상 전력 변환 장치이고, 적어도 하나의 프로세서는 맥동 전압의 주파수를 0.5배하여 추정 입력 전압의 주파수를 결정하는 것을 특징으로 한다. 일 실시예에서, 적어도 하나의 프로세서는 DC 링크 커패시터 양단의 전압으로부터 맥동 전압의 위상에 기초하여 추정 입력 전압의 위상을 보정하는 것을 특징으로 한다. 일 실시예에서, 적어도 하나의 프로세서는 DC 링크 커패시터 양단의 전압이 승압되면, 추정 입력 전압의 위상이 입력 전압의 위상과 동상으로 판단하고, DC 링크 커패시터 양단의 전압이 승압되지 않으면, 추정 입력 전압의 위상이 입력 전압의 위상과 역상으로 판단하는 것을 특징으로 한다. 일 실시예에서, 역률보상 전력 변환 장치는 입력 전압 센서 없는 토템폴 브릿지리스 역률보상 전력 변환 장치이 고, 적어도 하나의 프로세서는 토템폴 브릿지리스 역률보상 전력 변환 장치에서 2개의 스위치를 포함하는 하나 의 레그에서 하나의 스위치만 동작시키는 모드 1으로 스위치를 동작시켜 DC 링크 커패시터에 승압이 발생하면, 추정 입력 전압의 위상과 입력 전압의 위상이 동상인 것으로 판단하는 것을 특징으로 한다. 일 실시예에서, 적어도 하나의 프로세서는 DC 링크 커패시터의 전압이 승압 임계전압을 넘어서면 승압이 발생한 것으로 판단하는 것을 특징으로 한다. 일 실시예에서, 역률보상 전력 변환 장치는 입력 전압 센서 없는 토템폴 브릿지리스 전력 변환 장치이고, 적어 도 하나의 프로세서는 입력전압 센서 없는 역률보상 전력 변환 장치에서 2개의 스위치를 포함하는 레그에서 하 나의 스위치만 동작시키는 모드 1으로 스위치를 동작시켜 DC 링크 커패시터에 승압이 발생하지 않으면, 추정 입 력 전압의 위상과 입력 전압의 위상이 역상인 것으로 판단하는 것을 특징으로 한다. 일 실시예에서, 적어도 하나의 프로세서는 추정 입력 전압의 위상과 입력 전압의 위상이 역상인 것으로 판단한 것에 기초하여 추정 입력 전압의 위상을 180도 지연시켜서 추정 입력 전압의 위상을 보정하는 것을 특징으로 한 다. 일 실시예에서, 적어도 하나의 프로세서는 추정 입력 전압의 위상과 입력 전압의 위상이 동상으로 된 후에 입력 전압 센서 없는 역률보상 전력 변환 장치에서 2개의 스위치를 서로 상보 스위칭하는 모드 2로 스위치를 동작시켜 역률보상을 수행하는 것을 특징으로 한다. 일 실시예에서, 역률보상 전력 변환 장치는 입력 전압 센서 없는 토템폴 브릿지리스 역률보상 전력 변환 장치이 고, 적어도 하나의 프로세서는 토템폴 브릿지리스 역률보상 전력 변환 장치에서 2개의 스위치를 포함하는 각각 의 레그에서 하나의 스위치만 동작시키는 모드 1으로 스위치를 동작시켜 DC 링크 커패시터에 승압이 발생하면, 추정 입력 전압의 위상과 입력 전압의 위상이 동상인 것으로 판단하는 것을 특징으로 한다. 일 실시예에서, 적어도 하나의 프로세서는 추정 입력 전압의 위상과 입력 전압의 위상이 동상으로 된 후에 입력 전압 센서 없는 역률보상 전력 변환 장치에서 각각의 레그에 포함된 2개의 스위치를 서로 상보 스위칭하는 모드 2로 스위치를 동작시켜 역률보상을 수행하는 것을 특징으로 한다. 일 실시예에서, 역률보상 전력 변환 장치는 입력 전압 센서 없는 세미 브릿지리스 전력 변환 장치이고, 적어도 하나의 프로세서는 세미 브릿지리스 전력 변환 장치에서 스위치가 1개씩 포함되는 각 레그에서 하나의 스위치만 동작시키는 모드 1으로 스위치를 동작시켜 DC 링크 커패시터에 승압이 발생하면, 추정 입력 전압의 위상과 입력 전압의 위상이 동상인 것으로 판단하는 것을 특징으로 한다. 일 실시예에서, 역률보상 전력 변환 장치는 입력 전압 센서 없는 세미 브릿지리스 전력 변환 장치이고, 적어도 하나의 프로세서는 추정 입력 전압의 위상과 입력 전압의 위상이 동상으로 된 후에 입력전압 센서 없는 역률보 상 전력 변환 장치의 모드 1 운전을 유지하는 것을 특징으로 한다. 일 실시예에서, 적어도 하나의 프로세서가 맥동 전압을 추출하기 위해, DC 링크 커패시터 양단의 전압을 밴드 패스 필터링할 때 발생하는 지연 및 디지털 샘플링할 때 발생하는 지연 중 적어도 하나에 따른 지연을 보상하는 것을 특징으로 한다. 본 개시의 일 실시예에 따른 역률보상 전력 변환 장치에서 역률보상 방법은, 역률보상 전력 변환 장치의 입력 전압을 DC 링크 커패시터에 충전하는 단계, DC 링크 커패시터 양단의 전압을 출력전압 센서를 통해 센싱하는 단 계, 출력전압 센서를 통해 센싱된 DC 링크 커패시터 양단의 전압으로부터 맥동 전압을 추출하는 단계, 맥동 전 압으로부터 맥동 전압의 주파수와 위상을 추출하는 단계, 추출된 맥동 전압의 주파수로부터 추정 입력 전압의 주파수를 결정하는 단계, DC 링크 커패시터 양단의 전압에 기초하여 추정 입력 전압의 위상이 입력 전압의 위상 과 동상인지 혹은 역상인지를 판별하는 단계, 추정 입력 전압의 위상이 역상이면 추정 입력 전압 위상을 입력 전압의 위상과 동상이 되도록 보정하는 단계 및 보정에 기초하여 역률 제어를 수행하도록 제어하는 단계를 포함 한다. 일 실시예에서, 역률보상 전력 변환 장치는 입력 전압 센서 없는 토템폴 브릿지리스 역률보상 전력 변환 장치이 고, 추정 입력 전압의 위상이 입력 전압의 위상과 동상인지 혹은 역상인지를 판별하는 단계는, 토템폴 브릿지리 스 역률보상 전력 변환 장치에서 2개의 스위치를 포함하는 하나의 레그에서 하나의 스위치만 동작시키는 모드 1 으로 스위치를 동작시키는 단계; 및 모드 1 동작에 기초하여, DC 링크 커패시터에 승압이 발생하면 추정 입력 전압의 위상과 입력 전압의 위상이 동상인 것으로 판단하는 단계를 포함한다. 일 실시예에서, 역률보상 전력 변환 장치는 입력 전압 센서 없는 토템폴 브릿지리스 역률보상 전력 변환 장치이 고, 추정 입력 전압의 위상이 입력 전압의 위상과 동상인지 혹은 역상인지를 판별하는 단계는, 토템폴 브릿지리 스 역률보상 전력 변환 장치에서 2개의 스위치를 포함하는 하나의 레그에서 하나의 스위치만 동작시키는 모드 1 으로 스위치를 동작시키는 단계; 및 모드 1 동작에 기초하여, DC 링크 커패시터에 승압이 발생하지 않으면 추정 입력 전압의 위상과 입력 전압의 위상이 역상인 것으로 판단하는 단계를 포함한다. 일 실시예에서, 추정 입력 전압 위상을 입력 전압의 위상과 동상이 되도록 보정하는 단계는, 추정 입력 전압의 위상과 입력 전압의 위상이 역상인 것으로 판단한 것에 기초하여 추정 입력 전압의 위상을 180도 지연시켜서 추 정 입력 전압의 위상을 보정하는 단계를 포함한다. 일 실시예에서, 역률보상 전력 변환 장치는 입력 전압 센서 없는 세미 브릿지리스 전력 변환 장치이고, 추정 입 력 전압의 위상이 입력 전압의 위상과 동상인지 혹은 역상인지를 판별하는 단계는, 세미 브릿지리스 역률보상 전력 변환 장치에서 하나의 스위치를 포함하는 각 레그에서 하나의 스위치만 동작시키는 모드 1으로 스위치를 동작시키는 단계; 모드 1 동작에 기초하여, DC 링크 커패시터에 승압이 발생하면 추정 입력 전압의 위상과 입력 전압의 위상이 동상인 것으로 판단하고, 승압이 발생하지 않으면 추정 입력 전압의 위상과 입력 전압의 위상이 역상인 것으로 판단하는 단계를 포함한다 일 실시예에서, 보정에 기초하여 역률 제어를 수행하도록 제어하는 단계는, 추정 입력 전압의 위상과 입력 전압 의 위상이 동상으로 된 후에 입력전압 센서 없는 역률보상 전력 변환 장치의 모드 1 운전을 유지하여 역률 제어 를 수행하도록 제어하는 단계를 포함한다. 본 개시의 일 실시예에 따른 역률보상 방법을 수행할 수 있는 컴퓨터 프로그램을 저장하고 있는 컴퓨터 가독 매 체는, 역률보상 전력 변환 장치의 입력 전압을 DC 링크 커패시터에 충전하는 단계, DC 링크 커패시터 양단의 전 압을 출력전압 센서를 통해 센싱하는 단계, 출력전압 센서를 통해 센싱된 DC 링크 커패시터 양단의 전압으로부 터 맥동 전압을 추출하는 단계, 맥동 전압으로부터 맥동 전압의 주파수와 위상을 추출하는 단계, 추출된 맥동 전압의 주파수로부터 추정 입력 전압의 주파수를 결정하는 단계, DC 링크 커패시터 양단의 전압에 기초하여 추 정 입력 전압의 위상이 입력 전압의 위상과 동상인지 혹은 역상인지를 판별하는 단계, 추정 입력 전압의 위상이 역상이면 추정 입력 전압 위상을 입력 전압의 위상과 동상이 되도록 보정하는 단계 및 보정에 기초하여 역률 제 어를 수행하도록 제어하는 단계를 수행할 수 있는 컴퓨터 프로그램 코드를 포함한다. 본 명세서 전반에 걸쳐 'PFC 전력 변환 장치'는 간략하게 '역률보상 전력 변환 장치', '전력 제어 장치'혹은 간 단히 '전력 변환 장치'로 지칭될 수 있고,'컨버터'는 '전력 변환 장치' 혹은 '전력 제어 장치'와 동일한 의미로 사용될 수 있다. 도 1은 역률보상(PFC: power factor correction) 회로를 포함한 전력 변환 장치의 회로도이다. 도 1은 PFC 회로를 포함한 전력 변환 장치를 도시한다. 도 1에 따른 PFC 회로를 포함한 전력 변환 장치 는 정류부가 다이오드로 구성된 브릿지 타입의 전력 변환 장치이다. 전력 변환 장치는 입력 전압 과 정류부, PFC 회로, 및 DC 링크 커패시터로 이루어진다. 전력 변환 장치는 부하와 연결되어 부하에 따른 전력을 소비하면서 부하를 감당하게 된다. PFC 회로는 인덕터와 스위치 및 다이오드를 포함할 수 있다. 전력 변환 장치가 브릿지 타입인 경우 정류부는 모두 다이오드로 구성된다. PFC 회로의 스위치 는 전압 부스팅(boosting)을 위해 능동 스위치 소자를 사용할 수 있다. 스위치는 IGBT(Insulated Gate Bipolar Transistor)나 트랜지스터(transistor), MOSFET(Metal Oxide Semiconductor Field Effect Transistor)로 구성될 수 있으나, 이에 한정되는 것은 아니다. 도 2는 브릿지리스 PFC 전력 변환 장치를 보여주는 도면이다. 브릿지 타입에서는 PFC 회로가 정류부 뒷단에 구성되었으나, 도 2에 따른 브릿지리스 PFC 전력 변환 장치 에서는 입력 전압의 일단에 인덕터를 연결하고, 도 1 의 정류부에 대응되는 어느 한 레그에 정류용 다이오드 대신 스위치 Q1, Q2를 구비하여 DC 링크 커패시터 양단의 전압 부스팅(boosting) 을 수행할 수 있도록 한다. 따라서 도 1에서와 같이 PFC 회로가 정류부 뒷단에 있는 것과는 다르게 브 릿지리스 PFC 전력 변환 장치에서는 정류부가 브릿지리스로 구성되어 정류부가 포함하는 다이오드 대신 스위치 Q1, Q2를 배치하여 앞단의 인덕터에 저장된 에너지를 DC 링크 커패시터로 보내는 과정 을 통해 전압 부스팅 및 PFC를 수행하게 된다. 도 2에서 전압제어기와 전류제어기는 PI 제어기를 사용할 수 있으나 이에 제한되는 것은 아니고 P 제 어기나 PID 제어기도 사용될 수 있다. 도 2를 참조하면, DC 링크 커패시터 양단의 전압을 센싱한 전압값 VDC 와 전압 지령 Vref간의 차이값은 전압 제어기에 입력되면 제어연산이 수행된다. 전압제어기의 출력과 위상 추정기에 의해 검출된 입력 전압(Vin)을 곱하여 전류 지령(i*)을 생성하고 생성된 전류 지령(i*)과 센싱된 입력 전류 isen의 차이값을 전류제 어기에 입력하면 전류제어기는 스위치 Q1과 Q2의 스위칭 지령을 출력한다. PWM 생성기 는 스위칭 지령에 따라 Q1에 인가되는 PWM_1 신호와 Q2에 인가되는 PWM_2 신호를 생성한다. PWM_1과 PWM_2 신호는 제어기 동작의 결과에 따라 최종적으로 Q1과 Q2에 각각 인가되는 PWM(Pulse Width Modulation) 신호이다. 브릿지리스 PFC 전력 변환 장치에서는 전압 극성 판별기를 통해 입력 전압이 음의 반주기인지 양의 반주기인지 판별하고, 동작 스위치 판별기를 통해 동작 스위치를 결정해야 한다. 그런데, 브릿지리스 PFC 전력 변환 장치의 경우, 도 2에서 보듯이 전력 변환 장치(컨버터) 회로의 그라운드는 GND1이다. 따라서, 입력 전압의 극성 판별과 위상 추정을 위해 입력 전압을 절연기를 통하여 절연한 후 제어 회로에 적용해야 한다. 따라서, 입력 전압의 절연을 위해 절연형 오피앰프(Op. Amp.), 절연 전원 회로 등이 이용되거나 혹은 감산기가 이용되어야 한다. 그러나 이와 같이 절연 회로를 이용하거나 감산기를 이용하는 방법은 PCB 설계 부피 상승 및 원재료 가격 상승을 초래한다. 또한, 기존의 입력 전압 센싱 방법을 이용할 경우 소신호인 전압 센싱 신호가 EMI 필터, 릴레이 등 부가 회로가 위치한 지점을 지나와야 되므로 회로 설계 시 PCB 패턴 설계, 입력 노이즈 회피 설계 등을 고려해야 한다. 하지만, 본 개시에 따른 브릿지리스 PFC 전력 변환 장 치는 입력 전압을 센싱하는 센서를 사용하지 않으므로 입력 전압 계측이 필요 없고 계측 대상인 출력 전압은 DC 링크 커패시터로 인해 상대적으로 노이즈가 적고 제어 그라운드(GND1, 45)도 가까이 위치할 수 있기에 설계에 편리함이 있다. 따라서, 디지털 제어를 수행하는 역률보상(PFC) 회로의 일종인 브릿지리스 PFC 전력 변환 장치에서 입력 전압 센서없이 DC 링크 커패시터 양단의 전압 또는 출력 전압을 통해 입력 전압의 위상을 판별하여 브릿지리스 PFC 전력 변환 장치를 제어하는 방법과 그러한 방법을 채용한 입력 전압 센서리스 브릿지리스 PFC 전력 변환 장치가 필요하다. 도 2에서 절연기, 위상 추정기, 전압 극성 판별기, 동작 스위치 판별기, 전압 제어기 , 전류 제어기, 및 PWM 생성기의 동작 수행은 브릿지리스 PFC 전력 변환 장치의 프로세서 (별도로 도시되지 않음)에 의해 수행될 수 있다. 도 3은 본 개시의 일 실시예에 따른 입력 전압 센서가 없는 브릿지리스 PFC 전력 변환 장치를 도시하는 회로도 이다. 도 3에 따른 브릿지리스 PFC 전력 변환 장치는 단방향 토템폴(totem-pole) 토폴로지를 갖는다. 하지만, 본 개시에 따른 입력 전압 센서 없는 브릿지리스 PFC 전력 변환 장치는 양방향 토템폴 PFC 전력 변환 장 치, 세미-브릿지리스(semi-bridgeless) PFC 전력 변환 장치 등 입력 전압의 부호에 따라 동작 스위치가 결 정되는 브릿지리스 PFC 전력 변환 장치 토폴로지 모두에 적용이 가능하다. 본 개시의 일 실시예에 따른 입력 전압 센서가 없는 브릿지리스 PFC 전력 변환 장치의 주요 블록에 대한 설명은 다음과 같다. 맥동 추출기는 DC 링크 커패시터 양단에서 직류 성분을 제외한 맥동 전압을 추출하는 블록이다. DC 링크 커패시터 양단 전압은 DC 전압 성분과 입력 전압 주파수의 2배가 되는 맥동 전압 성분의 합으 로 구성되어 있다. 맥동 추출기는 FFT(fast fourier transform) 혹은 밴드-패스 필터(band-pass filter) 등을 통하여 입력 전압 주파수의 2배 주파수로 맥동하는 맥동 전압을 추출할 수 있다. 맥동 추출기는 하드웨어 회로 혹은 디지털 회로로 구현 가능하다. 또한 맥동 추출기는 소프트웨어 코드로도 구현가능하다. 실세 센싱한 맥동 전압을 하드웨어 필터없이 출력 전압의 맥동 성분을 소프트웨어로 구현된 FFT 혹은 소프트웨어 필터로 추출이 가능하다. 혹은 하드웨어 필터는 스위칭 노이즈나 화이트 노이즈 필터링으로만 사용하고, 출력 전압의 맥동 성분을 소프트웨어로 구현된 FFT 혹은 소프트웨어 필터로 추출이 가능하다. 맥동 전압 위상 추정기는 맥동 추출기에 의해 추출된 맥동 전압의 주파수와 위상을 추출하는 블 록으로 PLL(phase locked loop) 등을 이용하여 맥동 전압의 주파수와 위상을 추출할 수 있다. 입력 전압 위 상 복원기는 추출된 맥동 전압으로부터 추정 입력 전압의 주파수와 위상을 복원하는 블록이다. 추출된 맥동 전압의 주파수는 입력 전압 주파수의 2배이고 위상이 지연되어 있는 상태이므로, 입력 전압 위상 복원 기는 추출된 맥동 전압으로부터 추정 입력 전압의 위상을 보정할 수 있다. 역상/동상 판별기는 위상이 복원된, 추정 입력 전압의 위상이 실제 입력 전압과 동상인지 역상인지를 판별할 수 있다. DC 링크 커패시터 양단에 걸리는 출력 전압으로는 추정된 입력 전압이 양의 반주기 전압인지 음의 반주기 전압인지 판별이 불가능하다. 따라서, 역상/동상 판별기는 추정된 입력 전압의 위상이 실제 입력 전압과 동상인 지 역상인지를 판별하게 되며, 판별 방법은 후술하도록 한다. 동작 모드 판별기)는 브릿지리스 PFC 전력 변환 장치의 동작 모드를 판별하는 블록이다. 일 실시예에 따라, 브릿지리스 PFC 전력 변환 장치의 동작 모드는 크게 2가지로 모드 1 동작 모드에서는 입력 전압이 양수인지 음수인지에 따라 하나의 스위치만 선 택하여 스위칭을 수행하는 모드이고, 모드 2 동작 모드는 두 개의 스위치 Q1, Q2가 교번하여 스위칭을 하는 모드이다. 모드 2에서 메인 스위치 Q1은 모드 1에서와 동일하게 스위칭을 하고, 메인 스위치 Q1의 반대되는 스위치 Q2는 메인 스위치 Q1이 온(ON)일 경우, 오프(OFF)가 되고, 메인 스위치 Q1이 오프 (OFF)일 경우 온(ON)으로 동작하게 된다. 그러나, 세미(semi) 브릿지리스 PFC 전력 변환 장치와 같이 상보 스위 칭이 필요하지 않는 경우에는 전력 변환 장치는 모드 1을 유지하여 동작하면 된다. 세미 브릿지리스 PFC 전력 변환 장치에 대해서는 도 13을 조하여 다시 설명하도록 한다. 전력 변환 장치가 모드 1과 모드 2 중 어떤 모드로 동작할 것인지는 역상/동상 판별기에 의해 결정되며 해 당 내용은 후술하도록 한다. 입력 전압 위상 생성기는 맥동 전압으로부터 추정한 입력 전압의 위상이 실제 입력 전압과 동상일 경우에는 추정한 입력 전압의 위상을 그대로 출력하고, 맥동 전압으로부터 추 정한 입력 전압의 위상이 실제 입력 전압 대비 역상일 경우에는 추정한(복원된) 입력 전압의 위상을 π(180 도) 만큼 지연시키는 블록이다. 입력 전압 위상 생성기는 현재 동작 모드와 DC 링크 전압 센서에 의해 센싱되는 전압이 승압되고 있는지에 따라 추정한 입력 전압과 실제 입력 전압이 동상인지 역상인지를 판별 하는 것이다. 메인 스위치 판별기는 도 2의 '동작 스위치 판별기' 와 동일한 역할을 하며, 복원된 입 력 전압의 위상으로 계통의 입력 전압이 음의 반주기인지 양의 반주기인지 판별하여 스위칭 동작이 이루어 지는 메인 스위치를 결정하는 블록이다. 도 3에서 맥동 추출기, 맥동 전압 위상 추정기, 입력 전압 위상 복원기, 역상/동상 판별기 , 동작 모드 판단기, 입력 전압 위상 생성기, 메인 스위치 판별기, 전압 제어기, 전 류 제어기, 및 PWM 생성기의 동작 수행은 브릿지리스 PFC 전력 변환 장치의 프로세서(별도로 도시되지 않음)에 의해 수행될 수 있다. 도 3은 비록 입력 전압 센서가 없는 브릿지리스 PFC 전력 변환 장치를 도시하였지만, 본 개시의 일 실시 예에 따라 도 2에서와 같은 입력 전압 센서를 추가하고, 맥동 전압을 추출하여 입력 전압을 복원하면서 입력 전 압 센서에 의해 센싱되는 입력 전압과 복원된 입력 전압을 비교하여 정확한 입력 전압을 복원하여 사용할 수도 있다. 도 4는 본 개시의 일 실시예에 따른 입력 전압 센서가 없는 브릿지리스 PFC 전력 변환 장치를 도시하는 회로도 이다. 도 4에 따른 브릿지리스 PFC 전력 변환 장치가 도 3의 브릿지리스 PFC 전력 변환 장치와 다른 점은 DC 링 크 전압 센서에 의해 센싱된 DC 링크 커패시터 양단의 전압을 입력으로 받아 맥동 추출기에 DC 링 크 전압을 입력하기 전 지연을 보상하는 지연 보상기가 있다는 점이다. 지연 보상기는 DC 링크 커패 시터 양단의 전압을 밴드 패스 필터(혹은 저역 통과 필터) 등에 의해 필터링할 때 발생하는 지연, 디지털 샘플링 지연 등에 따른 지연을 보상하는 블록이다. 이와 같이 지연이 보상된 맥동 전압은 맥동 추출기(21 0)에 입력될 수 있다. 도 4에서 맥동 추출기, 맥동 전압 위상 추정기, 입력 전압 위상 복원기, 역상/동상 판별기 , 동작 모드 판단기, 입력 전압 위상 생성기, 메인 스위치 판별기, 지연 보상기, 전 압 제어기, 전류 제어기, 및 PWM 생성기의 동작 수행은 브릿지리스 PFC 전력 변환 장치의 프로세서(별도로 도시되지 않음)에 의해 수행될 수 있다. 도 4는 비록 입력 전압 센서가 없는 브릿지리스 PFC 전력 변환 장치를 도시하였지만, 본 개시의 일 실시 예에 따라 도 2에서와 같은 입력 전압 센서를 추가하고, 맥동 전압을 추출하여 입력 전압을 복원하면서 입력 전 압 센서에 의해 센싱되는 입력 전압과 복원된 입력 전압을 비교하여 정확한 입력 전압을 복원하여 사용할 수도 있다. 도 5는 본 개시의 일 실시예에 따른 순시 전력 Ps의 등가 회로를 도시한다. 여기서 PLS는 인덕터의 전력이고, Prect는 입력 전력에서 인덕터 전력을 제외한 전력이다. 즉, Prect가 출력 전력이다. 먼저 본 개시의 일 실시예에 따른 브릿지리스 PFC 전력 변환 장치에서 입력 전압과 출력 전압 관계를 알아보도록 한다. 먼저 수학식 1은 입력 전압, 수학식 2는 입력 전류이다. ... 수학식 1 ... 수학식 2 입력 순시 전력 Ps는 (입력 전압) * (입력 전류)이기 때문에, 입력 순시 전력은 아래 수학식 3과 같이 구해진다. ... 수학식 3 수학식 4는 출력 전력 Prec을 나타낸다. ... 수학식 4 위 수학식 4에서 VsIs는 출력 전력의 DC 성분으로 출력 전력 Prec의 평균값이다. 그리고 -Pripsin(2ωt+φ)이 출력 전력의 맥동 성분이며, 2ω가 출력 전력의 주파수 성분이다. 수학식 4에서 보듯이 맥동 전력의 주파수는 2ω가 되며 맥동 전압의 주파수와 동일함을 알 수 있다. 출력 전력의 맥동 성분은 맥동 추출기에 의해 추출될 수 있다. 이 때 맥동 추출기는 출력 전압에서 맥동 성분을 추출하기 위해 출력 전압을 밴드 패스 필터(band pass filter)에 통과시키거나 혹은 출력 전압을 패스트 푸리에 변환(Fast Fourier Transformation) 할 수 있다. 맥동 전압 위상 추정기는 맥동 전압의 주파수와 위상을 추정하며 앞에서 살펴본 바와 같이 PLL을 사 용할 수 있다. 도 6은 본 개시의 일 실시예에 따른 입력 전압과 맥동 전압의 파형도이다. 도 6에서 입력 전압은 y축 한칸 당 200V 단위로 도시되었고, 맥동 전압은 y축 한칸 당 10V 단위로 도시되었 다. 앞서 수학식 4에서 DC 링크 커패시터 양단에 걸리는 출력 전압의 맥동 전압 성분은 -Pripsin(2ωt+φ)로 도 출하였다. 수학식 4와 도 6에서 보는 바와 같이 추출된 맥동 전압 주파수가 입력 전압 주파수의 2배이기 때 문에 입력 전압을 복원하기 위해서는 추출한 맥동 전압의 주파수를 절반으로 변환해야 한다. 또한, 맥동 전 압은 정상 상태에서 입력 전압보다 위상이 0.5π(90도) 만큼 지연되어 있다. 따라서, 입력 전압 위상 복원 기에서 도 6의 그래프의 가장 왼쪽 지점에서 맥동 전압으로부터 주파수를 1/2배한 파형은 앞선 맥동 전압 성분이 음수(-) 값을 가지는데서 알 수 있는 바와 같이 입력 전압 대비 180도 만큼 위상 차이가 있을 것이다. 입력 전압 위상 복원기는 맥동 전압에서 추출한 입력 전압을 180도 만큼 위상 지연을 통해 위상을 복원하 게 된다. 따라서, 입력 전압 위상 복원기 출력은 입력 전압과 주파수(ω)가 동일하고, 맥동 전압 성분 이 위 수식에서 음수(-)를 가지고 있으므로 이 음수를 보상하여 주파수 ω를 가진 사인파의 위상을 180도 지연 시킨 전압이라고 할 수 있다. 앞선 방식대로 추정한 입력 전압의 위상은 실제 입력 전압의 시작 위상 조건에 따라, 추정한 입력 전압의 위상이 실제 입력 전압의 위상 대비 역상 혹은 동상이 될 수 있다. 브릿지리스 PFC 전력 변환 장치의 프로세서는 추정한 입력 전압이 실제 입력 전압의 역상(음의 반주기)인지 혹은 동상(양의 반주기)인지를 판 별하여 동작 스위치를 결정해야 한다. 따라서, 추정한 입력 전압의 위상이 실제 입력 전압 대비 역상인지 동상인지를 판별해야 하며, 이는 동작모드 판단기에 의해 확인이 가능하다. 도 7은 본 개시의 일 실시예에 따라 역상/동상 판별기가 추정 입력 전압 위상을 역상으로 추정한 경우의 파형도 이다. 도 7을 참조하면, 하단의 입력 전압 위상 정보는 입력 전압의 위상각 0도 지점인 t1에서 '0'의 값을 가지고 위상 정보는 360도(2π)까지 지속적으로 증가한다. 그런데, 도 7에서는 추정된 입력 전압의 위상이 역상으로 추 정된 것을 알 수 있다. 도 8은 본 개시의 일 실시예에 따라 역상/동상 판별기가 추정 입력 전압 위상을 동상으로 추정한 경우의 파형도 이다. 도 8을 참조하면, 하단의 입력 전압 위상 정보는 입력 전압의 위상각 0도 지점인 t'1에서 '0'의 값을 가지 고 위상 정보는 360도(2π)까지 지속적으로 증가한다. 도 8에서는 도 7과 달리 추정된 입력 전압의 위상이 동상 으로 추정된 것을 알 수 있다. 도 9는 본 개시의 일 실시예에 따른 브릿지리스 PFC 전력 변환 장치가 모드 1으로 동작하는 회로도이다. 우선 브릿지리스 PFC 전력 변환 장치의 동작 모드가 모드 1으로 셋팅된 경우, 입력 전압이 양의 반주 기이면 도 9와 같이 Q2 스위치가 메인 스위치가 되어 동작을 한다. 앞서 살펴본 바와 같이 모드 1은 입력 전압이 양수인지 음수인지에 따라 하나의 스위치만 선택되서 스위칭을 수행하는 모드이다. 모드 1에서는 Q2 스위치가 메인 스위치가 되어 동작을 하므로 Q2 스위치가 온(ON)되는 경우 전류의 경로는 도 9에 도시된 바와 같고, 이 때 에너지는 인덕터에 축적된다. 인덕터에 축적된 에너지는 Q2가 오프되는 경 우 DC 링크 커패시터에 충전되어 승압(부스팅)이 이루어지게 된다. 따라서, 도 9에서 모드 1으로 동작하게 되면 입력 전압의 위상과 추정한 입력 전압의 위상이 동상이면 정상으로 승압 동작이 수행될 것이다. 도 10은 본 개시의 일 실시예에 따른 브릿지리스 PFC 전력 변환 장치가 역상 조건이고 Q2 스위치가 메인 스위치 로 동작할 때의 등가 회로도이다. 도 10을 참조하면, 본 개시의 일 실시예에 따른 브릿지리스 PFC 전력 변환 장치의 모드 1 동작에서 Q2 스위치가 메인 스위치로 동작할 때 입력 전압이 역상일 때의 등가 회로도이다. 입력 전압이 역 상 조건일 때 브릿지리스 PFC 전력 변환 장치의 Q2 스위치가 메인 스위치가 되면 메인 스위치가 다이 오드 정류기와 같이 동작하여 승압 동작을 하지 않는다. 반면, 브릿지리스 PFC 전력 변환 장치가 정상 상 태이고 모드 1으로 동작할 때, DC 링크 커패시터에서 승압 동작이 이루어지면 입력 전압의 위상과 추정 된 입력 전압의 위상이 동일(동상)한 것으로 판단한다. 따라서, DC 링크 커패시터의 전압 센서를 통해 모드 1 동작 시 승압이 이루어지는 것을 검출하면, 입력 전압의 위상과 추정된 입력 전압의 위상이 동상인 것으로 판단할 수 있다. 도 11a는 본 개시의 일 실시예에 따른 토템폴 브릿지리스 PFC 전력 변환 장치의 회로도이다. 도 11a를 참조하면, 본 개시의 일 실시예에 따른 토템폴(totempole) 브릿지리스 PFC 전력 변환 장치(2000_1)에 서와 같은 토폴로지에서는 두 개의 레그 1과 레그 2 각각에 모두 두 개의 스위치가 구비된다. 토템폴 브릿지리스 PFC 전력 변환 장치(2000_1)에서는 두 개의 스위치 Q1_1(31_1)과 Q2_1(32_1) 간, 그리고, Q3_1(33_1)과 Q4_1(34_1) 간에 상보 스위칭이 필요하기 때문에, PFC 제어를 위해서 토템폴 브릿지리스 PFC 전력 변환 장치(2000_1)는 모드 2에서 동작하게 된다. 모드 2에서 메인 스위치 Q1_1(31_1)은 모드 1에서와 동일하게 스위칭을 하고, 레그 1의 메인 스위치 Q1_1(31_1)의 반대되는 스위치 Q2_1(32_1)은 메인 스위치 Q1_1(31_1)이 온(ON)일 경우, 오프(OFF)가 되고, 메인 스위치 Q1_1(31_1)가 오프(OFF) 일 경우 온(ON)으로 동 작하게 된다. 마찬가지로, 레그 2의 메인 스위치 Q3_1(33_1)의 반대되는 스위치 Q4_1(34_1)은 메인 스위치 Q3_1(33_1)이 온(ON)일 경우, 오프(OFF)가 되고, 메인 스위치 Q3_1(33_1)가 오프(OFF) 일 경우 온(ON)으로 동 작하게 된다. 그러나, 세미(semi) 브릿지리스 PFC 전력 변환 장치와 같이 상보 스위칭이 필요하지 않는 경우에 는 모드 1을 유지하면 된다. 세미 브릿지리스 PFC 전력 변환 장치에 대해서는 도 13을 참조하여 다시 설명하도 록 한다. 도 11a는 비록 입력 전압 센서가 없는 토템폴 브릿지리스 PFC 전력 변환 장치(2000_1)를 도시하였지만, 본 개시 의 일 실시예에 따라 도 2에서와 같은 입력 전압 센서를 추가하고, 맥동 전압을 추출하여 입력 전압을 복원하면 서 입력 전압 센서에 의해 센싱되는 입력 전압과 복원된 입력 전압을 비교하여 정확한 입력 전압을 판단할 수도 있다. 도 11b는 본 개시의 일 실시예에 따라 입력 전압 양의 반주기 동안 토템폴 브릿지리스 PFC 전력 변환 장치가 동 작하는 회로도이다. 도 11b를 참조하면, 입력 전압은 양의 반주기 상태이다. 도 11b에 따른 토템폴 브릿지리스 PFC 전력 변환 장치(2000_1)에서는 Q2_1(32_1)가 오프 상태이고, 인덕터(15_1)에서는 방전이 이루어지고 DC 링크 커패시터(4 0)에 전류가 충전되는 전류 이동 경로를 표시하고 있다. 도 11c는 본 개시의 일 실시예에 따라 입력 전압 양의 반주기 동안 토템폴 브릿지리스 PFC 전력 변환 장치가 동 작하는 회로도이다. 도 11c는 도 11b와 달리 인덕터(15_1)에 충전되는 전류 이동 경로를 표시하고 있다. 도 11c에서 보듯이 입력 전 압의 양의 반주기 동안 Q2_1(32_1)이 온(ON)되어 전류는 Q2_1(32_1)를 도통하고, Q4_1(34_1)의 역병렬 다 이오드를 도통하여 인덕터(15_1)에 충전이 이루어지게 되며 DC 링크 커패시터에는 충전이 이루어지지 않는 다. 도 11b와 도 11c에서와 같은 방전과 충전 동작에 의해 DC 링크 커패시터에는 승압(boosting)이 이루어 질 수 있다. 도 11d는 본 개시의 일 실시예에 따라 입력 전압 음의 반주기 동안 토템폴 브릿지리스 PFC 전력 변환 장치가 동 작하는 회로도이다. 도 11d에서는 입력 전압은 음의 반주기 상태이다. 도 11d에 따른 토템폴 브릿지리스 PFC 전력 변환 장치 (2000_1)에서는 Q4_1(34_1)가 오프 상태이고, 인덕터(15_1)에서는 방전이 이루어지고 DC 링크 커패시터에전류가 충전되는 전류 이동 경로를 표시하고 있다. 도 11e는 본 개시의 일 실시예에 따라 입력 전압 음의 반주기 동안 토템폴 브릿지리스 PFC 전력 변환 장치가 동 작하는 회로도이다. 도 11e는 도 11d와 달리 인덕터(15_1)에 충전되는 전류 이동 경로를 표시하고 있다. 도 11e에서 보듯이 입력 전 압의 음의 반주기 동안 Q4_1(34_1)이 온(ON)되어 전류는 Q4_1(34_1)를 도통하고, Q2_1(32_1)의 역병렬 다 이오드를 도통하여 인덕터(15_1)에 충전이 이루어지게 되며 DC 링크 커패시터에는 충전이 이루어지지 않는 다. 도 11d와 도 11e에서와 같은 방전과 충전 동작에 의해 DC 링크 커패시터에는 승압(boosting)이 이루어 질 수 있다. 도 12는 본 개시의 일 실시예에 따라 토템폴 브릿지리스 PFC 전력 변환 장치 제어 순서도이다. 단계 S1210에서 토템폴 브릿지리스 PFC 전력 변환 장치(2000_1)의 위상 추정기는 PLL 등을 통해 DC 링크 커패시 터 양단에 걸리는 출력 전압에서 맥동 전압을 추출하고, 추출된 맥동 전압의 위상을 추정한다. 여기서 위상 추정기는 위상 추정에 의해 맥동 전압의 주파수도 추정할 수 있다. 토템폴 브릿지리스 PFC 전력 변환 장치 (2000_1)의 프로세서는 맥동 전압의 위상과 주파수를 추정하여 추정 입력 전압을 생성한다. 단계 S1220에서 토 템폴 브릿지리스 PFC 전력 변환 장치(2000_1)는 하나의 스위치 만을 메인 스위치로서 동작시키는 모드 1 동작을 수행한다. 단계 S1230에서, 토템폴 브릿지리스 PFC 전력 변환 장치(2000_1)가 모드 1 동작 중 DC 링크 커패시터 전압이 승압되는지를 판단한다. 만일 토템폴 브릿지리스 PFC 전력 변환 장치(2000_1)가 모드 1 동작 중 DC 링크 커패시터 전압이 승압되면 추정된 입력 전압과 실제 입력 전압(10_1)이 동상인 것을 의미하므로, 토템 폴 브릿지리스 PFC 전력 변환 장치(2000_1)는 단계 S1250에서 모드 2 동작을 수행한다. 만일 DC 링크 커패시터 전압이 승압되지 않으면 추정된 입력 전압과 실제 입력 전압(10_1)이 역상인 것을 의미하므로, 단계 S1240 에서 토템폴 브릿지리스 PFC 전력 변환 장치(2000_1)의 프로세서는 추정 입력 전압의 위상을 지연시켜 실제 입 력 전압(10_1)과 위상이 동일하게 되도록 한 후 S1220 단계에서 모드 1 동작을 계속 수행할 수 있다. 위와 같은 토템폴 브릿지리스 PFC 전력 변환 장치(2000_1)의 제어 방식은 본 개시의 일 실시예에 따라 세미 브 릿지리스 PFC 전력 변환 장치와 양방향 토템폴 브릿지리스 PFC 전력 변환 장치 등에도 적용가능하다. 도 13은 본 개시의 일 실시예에 따른 세미 브릿지리스 PFC 전력 변환 장치의 회로도이다. 도 13을 참조하면, 세미 브릿지리스 PFC 전력 변환 장치(2000_2)는 각 레그 하부에 각각 스위치 Q1_2(31_2)와 스위치 Q2_2(32_2)를 구비한다. 세미(semi) 브릿지리스 PFC 전력 변환 장치(2000_2)에서는 상보 스위칭이 필요하지 않으므로 모드 1을 유지하면 서 스위치를 동작시키면 된다. 따라서, 앞선 브릿지리스 PFC 전력 변환 장치에서 살펴본 바와 같이 모드 1을 유지하면서 스위치를 동작시킬 때 DC 링크 커패시터(40_2) 양단의 전압이 승압되면 맥동 전압으로부터 추출 한 추정된 입력 전압과 실제 입력 전압(10_2)이 동상이라고 판단할 수 있고, 승압되지 않으면 맥동 전압으로부 터 추출한 추정된 입력 전압과 실제 입력 전압이 역상이라고 판단할 수 있다. 또한 PFC 제어를 수행할 때 계속해서 모드 1을 유지하면서 스위치를 동작시키면 된다. 도 11a는 비록 입력 전압 센서가 없는 세미 브릿지리스 PFC 전력 변환 장치(2000_2)를 도시하였지만, 본 개시의 일 실시예에 따라 도 2에서와 같은 입력 전압 센서를 추가하고, 맥동 전압을 추출하여 입력 전압을 복원하면서 입력 전압 센서에 의해 센싱되는 입력 전압과 복원된 입력 전압을 비교하여 정확한 입력 전압을 판단할 수도 있 다. 도 14는 본 개시의 일 실시예에 따른 출력 전압과 출력 전압의 맥동 전압 파형도이다. 도 14에서 출력 전압은 DC 링크 커패시터(40, 40_1, 40_2) 양단에서 추출된 전압이고 도 14 그래프에서 출력 전 압의 스케일은 y축 한칸 당 100V이다. 도 14에서 출력 전압의 맥동 전압의 스케일은 y축 한칸 당 5V이다. 결국 맥동 전압은 출력 전압에서 직류 성분 을 제거한 전압이라고 할 수 있다. 도 15는 본 개시의 일 실시예에 따른 추정 입력 전압과 맥동 전압의 위상 정보 파형도이다. 도 15를 참조하면, 맥동 전압은 입력 전압보다 2배의 주파수를 가지므로 추정 입력 전압의 주파수는 맥동 전압 주파수의 1/2 배이다. 또한, 일 실시예에 따르면, 도 15의 추정 입력 전압과 맥동 전압의 위상 정보에 따르면 추정 입력 전압의 위상은 맥동 전압 위상 대비 지연이 있으므로 도 2와 도 3의 입력 전압 위상 복원기에의해 추정 입력 전압의 위상과 맥동 전압 위상이 '0'이 되는 지점이 동일하도록 추정 입력 전압의 위상이 복원 될 수 있다. 도 16은 본 개시의 일 실시예에 따른 PFC 전력 변환 장치에서 입력 전압과 입력 전류 및 추정 입력 전압의 위상 정보 파형도이다. PFC 전력 변환 장치는 도 3 및 도 4의 브릿지리스 PFC 전력 변환 장치와 도 11a의 토템폴 토폴로지 를 적용한 토템폴 브릿지리스 PFC 전력 변환 장치(2000_1), 도 13에 따른 세미 브릿지리스 PFC 전력 변환 장치 (2000_2) 및 양방향 토템폴 브릿지리스 PFC 전력 변환 장치를 모두 아울러 통칭하는 PFC 전력 변환 장치일 수 있다. PFC 전력 변환 장치에서 복원한 입력 전압의 위상 정보는 추정 입력 전압이 실제 입력 전압 대비 역상인 지 동상인이 여부를 판별하여 역상이면 180도 만큼 위상을 지연시켜 추정 입력 전압을 최종적으로 실제 입력 전 압으로 복원한 위상 정보이다. 따라서, 본 개시의 일 실시예에 따라 최종 복원된 입력 전압의 위상 정보는 실제 입력 전압과 비교해보면 위상이 서로 일치함을 알 수 있다. 따라서, 본 개시의 일 실시예에 따른 PFC 전력 변환 장치에서는 입력 전압의 위상을 센싱하지 않고도 입 력 전압의 위상을 정확히 판별할 수 있고, PFC 전력 변환 장치는 추정 입력 전압을 실제 입력 전압 위상과 일치시킨 후 역률보상 제어에 의해 입력 전류와 입력 전압의 위상이 거의 일치하여 역률이 거의 1에 가 까운 값을 가지도록 제어할 수 있다. 도 17a와 도 17b는 본 개시의 일 실시예에 따른 PFC 전력 변환 장치의 동작 파형도이다. 도 17a에 도시되지는 않지만, PFC 전력 변환 장치가 기동되면 이는 초기 충전 단계로서, 초기 충전 단계 에서는 PFC가 동작하지 않으면서 오로지 DC 링크 커패시터가 충전되는 구간이다. 도 17a를 참조하면, 본 개시의 일 실시예에 따른 PFC 전력 변환 장치의 동작 파형도에서 0.2초까지는 추정 입력 전압 생성 단계로서, PFC 전력 변환 장치의 맥동 전압 위상 추정기와 입력 전압 위상 복원기는 일단 추정된 입력 전압이 실제 입력 전압 대비 역상인지 아니면 동상인지 판별은 하지 않고 맥동 전압으로부터 입력 전압을 추정한다. 추정된 입력 전압의 주파수는 맥동 전압 주파수의 1/2배이다. 입력 전압 위상 복원기는 추출된 맥동 전압으로부터 추정 입력 전압의 위상을 복원할 수 있다. 이렇게 추정 입력 전압의 위상은 계통의 실제 입력 전압의 위상 과 동상이거나 역상이다. 0.2초 지점부터 PFC 전력 변환 장치는 모드 1으로 동작한다. PFC 전력 변환 장치는 0.2초부터 ta 지점까지 모드 1 운전 상태에서 DC 링크 커패시터 양단 전압에 승압이 이루어지지 않고 있으므로 추정 입력 전압은 실제 입력 전압 대비 역상이라고 판단한다. 따라서, PFC 전력 변환 장치의 프로세서는 ta 지점에 서 추정 입력 전압을 180도 만큼 위상 지연시켜 실제 입력 전압과 위상이 동일하도록 최종 복원된 입력 전압을 생성할 수 있다. ta에서 추정 입력 전압을 180도 만큼 위상 지연시켜 실제 입력 전압과 위상이 동일한 동상 상태가 되면 DC 링크 커패시터 양단 전압이 승압되는 것을 확인할 수 있다. PFC 전력 변환 장치의 프로세서는 이제 tb 지 점에서 두 개의 스위치가 상보 스위칭을 하는 모드 2로 동작을 하도록 PFC 전력 변환 장치의 스위칭 제어 를 하게 된다. 일 실시예에서, PFC 전력 변환 장치의 프로세서는 DC 링크 커패시터 양단의 전압이 소정의 승압 임계전압 을 넘어서면 - 예를 들어 이전 0.05초 동안의 전압의 평균값보다 15V가 커지거나 이전 0.05초 동안의 전압의 평 균값이 5% 상승하면 - 승압이 되었다고 판단할 수 있다. 도 17b에 따르면 입력 전압의 역상 판별 시점에서 추정된 입력 전압의 위상 지연이 이루어지는 것을 알 수 있다. 도 17b는 도 17a의 파형도에서 역상 판별 시점 부근을 좀더 확대하여 볼 수 있는 파형도이다. 파형도의 가장 위 파형은 계통의 실제 입력 전압의 파형도이다. 두번째 파형도에서 복원(추정)한 입력 전압 위 상을 살펴보면, 현재 실제 입력 전압 위상 대비 역상(180도 지연)인 것을 알 수 있다. 이는, PFC 전력 변환 장 치가 브릿지리스 PFC 전력 변환 장치인 경우 메인 스위치 Q1만 동작을 하고 다른 스위치 Q2는 동작을 하지 않는 모드 1 동작을 하면서 DC 링크 커패시터 양단의 승압을 판단한 결과 승압이 이 루어지지 않으므로 추정 입력 전압의 위상이 실제 입력 전압의 위상이 서로 역상이라고 판단하고 추정 입력 전 압의 위상을 180도 지연시켜 최종적으로 입력 전압을 복원한다. 도 18은 본 개시의 일 실시예에 따라 DC 링크 커패시터 전압 센싱에 따른 입력 전압의 역상 판단 파형도이다. 도 18을 참조하면, 입력 전압을 정류하여 생성되는 DC 링크 전압(VDC)이 도시되고 있다. DC 링크 전압(VDC) 의 리플(ripple) 빈도는 입력 전압의 주파수의 2배 주파수로 나타난다. 이러한 리플 성분을 DC 링크 전압 (VDC)에서 직류 성분을 제외한 맥동 전압으로서 추출할 수 있다. 일 실시예에 따라, PFC 전력 변환 장치의 프로세서는 t21 시점에서 역상 판별 동작을 시작한다. PFC 전력 변환 장치의 프로세서는 t21 시점에서, DC 링크 전압을 센싱한 결과 DC 링크 전압이 상승하지 않 으므로 DC 링크 전압(VDC)에서 추출한 맥동 전압으로부터 추정된 입력 전압이 실제 입력 전압 대비 그 위상이 ' 역상'이라고 판단한다. 따라서, 도 17a와 도 17b에서 살펴본 바와 같이 추정한 입력 전압은 '역상'이라는 판단 에 기초하여 위상을 180도 만큼 지연시켜서 실제 입력 전압의 위상과 일치시킨다. 위상을 180도 만큼 보정 하는 시점인 t22 이후부터 추정한 입력 전압이 실제 입력 전압과 동상이 되었다면, 모드 1 동작에서 DC 링크 전압(VDC)은 상승하기 시작할 것이다. PFC 전력 변환 장치의 프로세서는 t23 시점에서 재차 추정 입력 전 압의 위상이 실제 입력 전압과 동상인지 역상인지를 판별하기 위해 모드 1 동작을 수행할 수 있고, DC 링크 전압(VDC)이 상승하여 DC 링크 전압(VDC)이 소정의 승압 임계 전압(VTH)보다 커지면, 추정된 입력 전압이 실제 입 력 전압 대비 그 위상이 '동상'이라고 판단한다. 일 실시예에서, PFC 전력 변환 장치의 프로세서는 t24 시 점에서 추정 입력 전압이 실제 입력 전압과 동상이고 주파수도 일치하므로 PFC 정상 동작을 수행하도록 PFC 전력 변환 장치의 스위칭을 제어한다. 도 19는 본 개시의 일 실시예에 따라 DC 링크 커패시터 전압 센싱에 따른 입력 전압의 동상 판단 파형도이다. 도 18과 달리 도 19에서 추정된 입력 전압은 처음부터 실제 입력 전압과 동상이 경우이다. 도 19를 살펴보 면, PFC 전력 변환 장치의 프로세서는 t31 시점에서 추정 입력 전압의 위상이 실제 입력 전압과 동상 인지 역상인지를 판별하기 위해 모드 1 동작을 수행할 수 있고, DC 링크 전압(VDC)이 상승하여 DC 링크 전압 (VDC)이 소정의 승압 임계 전압(VTH)보다 커지면, 추정된 입력 전압이 실제 입력 전압 대비 그 위상이 '동상'이 라고 판단한다. 일 실시예에서, PFC 전력 변환 장치의 프로세서는 t32 시점에서 추정 입력 전압이 실제 입 력 전압과 동상이고 주파수도 일치하므로 PFC 정상 동작을 수행하도록 PFC 전력 변환 장치의 스위칭 을 제어한다. 도 20은 본 개시의 일 실시예에 따른 전력 변환 장치의 블록도이다. 도 20의 블록도에 따른 PFC 전력 변환 장치는 도 3 내지 도 4, 도 11a 및 도 13에 따른 전력 변환 장치 모두에 대응되고 적용될 수 있다. 도 20에 따른 PFC 전력 변환 장치의 블록도는 계통에 따른 회로도와 더 불어 PFC 회로의 게이트 제어, PFC 전력 변환 장치의 전반적인 제어를 수행하는 마이컴 혹은 프로세 서를 포함할 수 있다. 도 20에 도시된 바와 같이, 본 개시의 일 실시예에 따른 전력 변환 장치는, 구동부, 프로세서 , 통신 인터페이스, 센서부, 출력 인터페이스, 사용자 입력 인터페이스, 메모리 를 포함할 수 있다. 제어장치의 각 구성요소들은 모두 필수적인 것은 아니며, 제조사의 설계 사상 에 따라 각 구성요소들은 가감될 수 있다. 예를 들어, 본 개시의 일 실시예에 따른 PFC 전력 변환 장치는 통신부의 적어도 일부를 포함하지 않을 수도 있고, 구동부, 센서부, 출력 인터페이스 및/또는 사용자 입력 인터페이스의 적어도 일부를 포함하지 않을 수 있다. 이하 상기 구성요소들에 대해 차례로 살펴본다. 구동부는 외부 전원으로부터 전력을 공급받고, 프로세서의 구동 제어 신호에 따라 부하에 전류를 공급할 수 있다. 구동부는 EMI (Electro Magnetic Interference) 필터, 정류 회로, 인버터 회로, PFC 회로, 저역 통과 필터를 포함할 수 있으나, 이에 한정되는 것은 아니다. EMI 필터는 외부 전원(ES: External Source)으로부터 공급되는 교류 전력에 포함된 고주파 잡음을 차단하 고, 미리 정해진 주파수(예를 들어, 50Hz 또는 60Hz)의 교류 전압과 교류 전류를 통과시킬 수 있다. EMI 필터 와 외부 전원(ES) 사이에는 과전류를 차단하기 위한 퓨즈(Fuse)와 릴레이(Relay)가 마련될 수 있다. EMI 필터에 의하여 고주파 잡음이 차단된 교류 전력은 정류 회로에 공급된다.정류 회로는 정류부가 포함하는 회로일 수 있다. 정류 회로는 교류 전력을 직류 전력으로 변환 할 수 있다. 예를 들어, 정류 회로는 시간에 따라 크기와 극성(양의 전압 또는 음의 전압)이 변화하는 교 류 전압을 크기와 극성이 일정한 직류 전압으로 변환하고, 시간에 따라 크기와 방향(양의 전류 또는 음의 전 류)이 변화하는 교류 전류를 크기가 일정한 직류 전류로 변환할 수 있다. 정류 회로는 브리지 다이오드를 포함할 수 있다. 정류 회로는 본 개시의 일 실시예에 따른 PFC 전력 변환 장치에서 브릿지리스, 세미 브릿지리스, 토템폴 브릿지리스 구조에 의해 순수 다이오드만으로 구성되는 브릿지 구조가 아닌, 스위치가 일부 포함되는 회 로로 구성될 수 있다. 예를 들어, 정류 회로는 4개의 다이오드를 포함할 수 있다. 다이오드는 스위치에 포함된 역병렬 다이오드일 수 있다. 다이오드는 시간에 따라 극성이 변화하는 교류 전압을 극성이 일정한 양의 전압으로 변환하고, 시간에 따라 방향이 변화하는 교류 전류를 방향이 일정한 양의 전류로 변환할 수 있다. 또 다른 일 실시예에서, 정류 회로는 2개의 다이오드와 2개의 스위치를 포함할 수 있다. 일 실시예에서, 1개 의 스위치와 1개의 다이오드가 1개의 정류 레그를 구성하고, 또 다른 1개의 스위치와 1개의 다이오드로 또 다른 1개의 정류 레그를 구성할 수 있다. 일 실시예에서, 정류 회로는 2개의 스위치로 구성되는 1개의 레그와 2개의 다이오드로 구성되는 1개의 레그를 포함할 수 있다. 하지만, 이는 입력 전원이 단상인 경우로서, 만일 입 력 전원이 3상이면, 3개의 스위치와 3개의 다이오드로 3개의 레그를 포함하는 정류 회로를 구성할 수 있 다. 프로세서는 스위치를 제어하여, DC 링크 커패시터에 충전되는 전압이 급격하게 증가하지 않고 서 서히 증가하도록 제어할 수 있다. 스위치는 트랜지스터, 싸이리스터, IGBT, MOSFET, GTO 등으로 구성될 수 있으 나 이에 한정되는 것은 아니다. 인버터 회로는 본 개시의 일 실시예에 따른 PFC 전력 변환 장치에서는 생략될 수 있다. 인버터 회 로(21130는 부하(도시되지 않음)에 전류를 공급하거나 차단하는 스위칭 회로를 포함할 수 있다. 스위칭 회로는 제 1 스위치와 제 2 스위치를 포함할 수 있다. 제 1 스위치와 제 2 스위치는 정류 회로로부터 출력되는 플러스 라인과 마이너스 라인 사이에서 직렬로 연결될 수 있다. 제 1 스위치와 제 2 스위치는 프로세서의 구동 제어 신호에 따라 턴-온되거나 턴-오프될 수 있다. 인버터 회로는 부하에 공급되는 전류를 제어할 수 있다. 예를 들어, 인버터 회로에 포함된 제 1 스 위치와 제 2 스위치의 턴 온/턴 오프에 따라 부하에 흐르는 전류의 크기 및 방향이 변화할 수 있다. 이 경우, 부하에는 교류 전류가 공급될 수 있다. 제 1 스위치 및 제 2 스위치의 스위칭 동작에 따라 부하에 사인파 형태 의 교류 전류가 공급된다. 또한, 제 1 스위치 및 제 2 스위치의 스위칭 주기가 길수록(예컨대, 제 1 스위치 및 제 2 스위치의 스위칭 주파수가 작을수록) 부하에 공급되는 전류가 커질 수 있으며, 인버터 회로는 부하 에 교류를 공급할 때 필요할 수 있으므로 부하에 직류를 공급하는 PFC 전력 변환 장치에서는 인버터 회로 가 필요하지 않을 수 있다. 전력 변환 장치의 구동부는 대역 통과 필터를 포함할 수 있다. 대역 통과 필터는 아날로 그 회로로 구성될 수도 있고 디지털 프로그래밍으로로 구현될 수도 있다. 대역 통과 필터는 본 개시의 일 실시예에 따른 PFC 전력 변환 장치(30000에서 저대역 통과 필터일 수 있다. 프로세서는, PFC 전력 변환 장치의 전반적인 동작을 제어한다. 프로세서는 메모리에 저장된 프로그램들을 실행함으로써, 무선 전력 송신부, 통신 인터페이스, 센서부, 출력 인터 페이스, 사용자 입력 인터페이스, 메모리를 제어할 수 있다. 본 개시의 일 실시예에 의하면, 프로세서는, 인공 지능(AI) 프로세서를 탑재할 수도 있다. 인공 지능(AI) 프로세서는, 인공 지능(AI)을 위한 전용 하드웨어 칩 형태로 제작될 수도 있고, 기존의 범용 프로세서(예: CPU 또는 application processor) 또는 그래픽 전용 프로세서(예: GPU)의 일부로 제작되어 가열 장치에 탑재 될 수도 있다. 본 개시의 일 실시예에 의하면, 프로세서는 PFC 전력 변환 장치 가 포함하는 전압제어기, 전 류제어기, PWM 생성기의 제어기 동작을 수행할 수 있다. 여기서 전류제어기, 전압제어기 등의 제어기 는 PI 제어기일 수 있으나 이에 한정되는 것은 아니다. 프로세서는 필요에 따라 IoT(Internet of Things) 네트워크 상에서 동작하거나 홈 네트워크에서 동작하도 록 통신 인터페이스를 포함할 수 있다. 통신 인터페이스는, 근거리 통신부, 원거리통신부를 포함할 수 있다. 근거리 통신부(2310, short-range wireless communication interface)는, 블루투스 통신부, BLE(Bluetooth Low Energy) 통신부, 근거리 무선 통신부(Near Field Communication interface), WLAN(와이파이) 통신부, 지그비(Zigbee) 통신부, 적 외선(IrDA, infrared Data Association) 통신부, WFD(Wi-Fi Direct) 통신부, UWB(Ultra Wideband) 통신부, Ant+ 통신부 등을 포함할 수 있으나, 이에 한정되는 것은 아니다. 원거리통신부는, 이동 통신망 상에서 기지국, 외부의 단말, 서버 중 적어도 하나와 무선 신호를 송수신한다. 여기에서, 무선 신호는, 음성 호 신호, 화상 통화 호 신호 또는 문자/멀티미디어 메시지 송수신에 따른 다양한 형태의 데이터를 포함할 수 있다. 원거 리통신부는, 3G 모듈, 4G 모듈, 5G 모듈, LTE 모듈, NB-IoT 모듈, LTE-M 모듈 등을 포함할 수 있으나, 이에 한정되는 것은 아니다. 본 개시의 일 실시예에 의하면, 통신 인터페이스를 통해 PFC 전력 변환 장치 외부의 서버나 다른 전기기기와 통신을 하고 데이터를 송수신할 수 있다. 센서부는 전류 센서 및 DC 링크 전압 센서를 포함할 수 있다. 본 개시의 일 실시예에 따라 센 서부는 입력 전압 센서를 구비하지 않는다. 전류 센서는 PFC 전력 변환 장치 회로의 다양한 위치에 배치되어, 전류(주로 교류 전류) 정보를 획득할 수 있다. DC 링크 전압 센서는 DC 링크 전압을 센싱 하여 전압제어기 입력으로 사용될 수 있다. 출력 인터페이스는, 오디오 신호 또는 비디오 신호의 출력을 위한 것으로, 디스플레이부와 음향 출 력부 등이 포함될 수 있다. 본 개시의 일 실시예에 의하면, PFC 전력 변환 장치는 디스플레이부를 통해서 PFC 전력 변환 장치 와 관련된 정보를 표시해 줄 수 있다. 예를 들어, PFC 전력 변환 장치는 PFC 전력 변환 장치(300 0)의 운전 모드(모드 1, 모드 2) 정보, 역률 정보나 각 고조파 성분값(예를 들어 입력 전류 대비 각 고조파 성 분의 % 혹은 A(ampere))를 디스플레이부에 표시할 수 있다. 디스플레이부와 터치패드가 레이어 구조를 이루어 터치 스크린으로 구성되는 경우, 디스플레이부는 출력 장치 이외에 입력 장치로도 사용될 수 있다. 디스플레이부는 액정 디스플레이(liquid crystal display), 박막 트랜지스터 액정 디스플레이(thin film transistor-liquid crystal display), 발광 다이오드 (LED, light-emitting diode), 유기 발광 다이오드(organic light-emitting diode), 플렉서블 디스플레이 (flexible display), 3차원 디스플레이(3D display), 전기영동 디스플레이(electrophoretic display) 중에서 적어도 하나를 포함할 수 있다. 그리고 전력 변환 장치의 구현 형태에 따라 디스플레이부를 2개 이 상 포함할 수도 있다. 음향 출력부는 통신 인터페이스로부터 수신되거나 메모리에 저장된 오디오 데이터를 출력할 수 있다. 또한, 음향 출력부는 PFC 전력 변환 장치에서 수행되는 기능과 관련된 음향 신호를 출력 할 수 있다. 음향 출력부는 스피커(speaker), 버저(Buzzer) 등을 포함할 수 있다. 본 개시의 일 실시예에 의하면, 출력 인터페이스는 운전 모드 정보, 역률 정보, 고조파 성분 정보 중 적 어도 하나를 디스플레이부를 통해 출력할 수 있다. 본 개시의 일 실시예에 의하면, 출력 인터페이스 는 현재 파워 레벨, 동작 모드(예컨대, PFC 제어 중, 저소음 모드, 일반 모드, 고출력 모드 등), 역률 제 어 상태, 현재 역률 등을 표시할 수도 있다. 사용자 입력 인터페이스는, 사용자로부터의 입력을 수신하기 위한 것이다. 사용자 입력 인터페이스(260 0)는 키 패드(key pad), 돔 스위치 (dome switch), 터치 패드(접촉식 정전 용량 방식, 압력식 저항막 방식, 적 외선 감지 방식, 표면 초음파 전도 방식, 적분식 장력 측정 방식, 피에조 효과 방식 등), 조그 휠, 조그 스위치 중 적어도 하나일 수 있으나, 이에 한정되는 것은 아니다. 사용자 입력 인터페이스는 음성 인식 모듈을 포함할 수 있다. 예를 들어, PFC 전력 변환 장치는 마 이크로폰을 통해 아날로그 신호인 음성 신호를 수신하고, ASR(Automatic Speech Recognition) 모델을 이용하여 음성 부분을 컴퓨터로 판독 가능한 텍스트로 변환할 수 있다. PFC 전력 변환 장치는 자연어 이해(Natural Language Understanding, NLU) 모델을 이용하여 변환된 텍스트를 해석하여, 사용자의 발화(utterance) 의도를 획득할 수 있다. 여기서 ASR 모델 또는 NLU 모델은 인공지능 모델일 수 있다. 인공지능 모델은 인공지능 모델의 처리에 특화된 하드웨어 구조로 설계된 인공지능 전용 프로세서에 의해 처리될 수 있다. 인공지능 모델은 학습 을 통해 만들어 질 수 있다. 여기서, 학습을 통해 만들어진다는 것은, 기본 인공지능 모델이 학습 알고리즘에 의하여 다수의 학습 데이터들을 이용하여 학습됨으로써, 원하는 특성(또는, 목적)을 수행하도록 설정된 기 정의 된 동작 규칙 또는 인공지능 모델이 만들어짐을 의미한다. 인공지능 모델은, 복수의 신경망 레이어들로 구성될 수 있다. 복수의 신경망 레이어들 각각은 복수의 가중치들(weight values)을 갖고 있으며, 이전(previous) 레이어의 연산 결과와 복수의 가중치들 간의 연산을 통해 신경망 연산을 수행한다. 언어적 이해는 인간의 언어/문자를 인식하고 응용/처리하는 기술로서, 자연어 처리(Natural Language Processing), 기계 번역(Machine Translation), 대화 시스템(Dialog System), 질의 응답(Question Answering), 음성 인식/합성(Speech Recognition/Synthesis) 등을 포함한다. 메모리는, 프로세서의 처리 및 제어를 위한 프로그램을 저장할 수도 있고, 입/출력되는 데이터들 (예컨대, PFC 전력 변환 장치의 운전 모드, 역률 정보, 고조파 성분에 관한 정보 등)을 저장할 수도 있다. 메모리는 인공지능 모델을 저장할 수도 있다. 메모리는 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), 멀티미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 램(RAM, Random Access Memory), SRAM(Static Random Access Memory), 롬(ROM, Read-Only Memory), EEPROM(Electrically Erasable Programmable Read-Only Memory), PROM(Programmable Read-Only Memory), 자기 메모리, 자기 디스크, 광디스크 중 적어도 하나의 타입의 저장매체를 포함할 수 있다. 또한, PFC 전력 변환 장 치는 인터넷(internet)상에서 저장 기능을 수행하는 웹 스토리지(web storage) 또는 클라우드 서버를 운 영할 수도 있다. 도 21은 본 개시의 일 실시예에 따른 전력 변환 장치에서 입력 전압 센서없이 입력 전압을 복원하여 PFC 제어 방법을 나타내는 흐름도이다. 단계 S2110에서 PFC 전력 변환 장치는 입력 전압을 DC 링크 커패시터에 충전한다. 일 실시예에서, PFC 전력 변환 장치는 입력 전압 센서가 없는 PFC 전력 변환 장치일 수 있다. 단계 S2120에서 PFC 전력 변환 장치는 DC 링크 커패시터의 양단 전압을 출력 전압 센서를 통해 센싱한다. 단계 S2130에서 PFC 전력 변환 장치는 센싱된 출력 전압으로부터 맥동 전압을 추출한다. 맥동 전압은 출력 전압에서 DC 성분을 제거한 성분이라고 할 수 있다. 단계 S2140에서 PFC 전력 변환 장치는 맥동 전압으로부터 맥동 전압의 주파수와 위상을 추출한다. 수학식 4에서 본 바와 같이 맥동 전압의 주파수는 입력 전압 주파수의 2배이다. 단계 S2150에서 PFC 전력 변환 장치는 추출된 맥동 전압의 주파수로부터 추정 입력 전압의 주파수를 결정 한다. 맥동 전압은 계통의 입력 전압에 비해 2배의 주파수로 맥동하므로 추정 입력 전압의 주파수는 맥동 전압 주파수의 1/2배가 될 것이다. 단계 S2160에서 PFC 전력 변환 장치는 DC 링크 커패시터 양단의 전압에 따라 추정 입력 전압의 위상 이 계통의 입력 전압과 동상인지 혹은 역상인지를 판별한다. 앞서 살펴본 바와 같이 PFC 전력 변환 장치 의 프로세서는 PFC 전력 변환 장치의 모드 1 운전 중 DC 링크가 승압하면 추정 입력 전압의 위상이 계통의 입력 전압과 동상이라고 판단한다. 단계 S2170에서 PFC 전력 변환 장치는 추정 입력 전압의 위상이 역상이면 추정 입력 전압 위상을 조정하 여 계통의 입력 전압의 위상과 동상이 되도록 제어한다. 단계 S2180에서 PFC 전력 변환 장치의 프로세서는 추정 입력 전압이 계통의 실제 입력 전압과 동상이 되도록 위상을 조정한 후 PFC 제어를 수행할 수 있다. 본 개시의 일 실시예에 따른 PFC 전력 변환 장치에서 도시된 구성요소 모두가 필수구성요소인 것은 아니 다. 도시된 구성요소보다 더 많은 구성요소에 의해 PFC 전력 변환 장치가 구현될 수도 있고, 그보다 적은 구성요소에 의해서 PFC 전력 변환 장치가 구현될 수 있다. 본 명세서 전반에 걸쳐서 PFC 전력 변환 장치 는 가전장치, 가전기기, 조리기기 혹은 전기장치로 지칭될 수 있으며, 이들 용어는 서로 교환되거나 대체 되어 사용될 수 있다. 또한 본 명세서 전반에 걸쳐서 PFC 전력 변환 장치를 포함하는 전기기기는 독립되 어 판매되는 가전 장치일 수도 있고 가전 장치의 일부 제품을 구성하는 장치일 수도 있다. 본 개시의 일부 실시예는 컴퓨터에 의해 실행되는 프로그램 모듈과 같은 컴퓨터에 의해 실행가능한 명령어를 포 함하는 기록 매체의 형태로도 구현될 수 있다. 컴퓨터 판독 가능 매체는 컴퓨터에 의해 액세스될 수 있는 임의 의 가용 매체일 수 있고, 휘발성 및 비휘발성 매체, 분리형 및 비분리형 매체를 모두 포함한다. 또한, 컴퓨터 판독가능 매체는 컴퓨터 저장 매체 및 통신 매체를 모두 포함할 수 있다. 컴퓨터 저장 매체는 컴퓨터 판독가능 명령어, 데이터 구조, 프로그램 모듈 또는 기타 데이터와 같은 정보의 저장을 위한 임의의 방법 또는 기술로 구 현된 휘발성 및 비휘발성, 분리형 및 비분리형 매체를 모두 포함한다. 통신 매체는 전형적으로 컴퓨터 판독가능명령어, 데이터 구조, 프로그램 모듈, 또는 반송파와 같은 변조된 데이터 신호의 기타 데이터, 또는 기타 전송 메커니즘을 포함하며, 임의의 정보 전달 매체를 포함한다. 또한, 본 개시의 일부 실시예는 컴퓨터에 의해 실 행되는 컴퓨터 프로그램과 같은 컴퓨터에 의해 실행가능한 명령어를 포함하는 컴퓨터 프로그램 또는 컴퓨터 프 로그램 제품 (computer program product)으로도 구현될 수 있다. 기기로 읽을 수 있는 저장매체는, 비일시적(non-transitory) 저장매체의 형태로 제공될 수 있다. 여기서, ‘비 일시적 저장매체'는 실재(tangible)하는 장치이고, 신호(signal)(예: 전자기파)를 포함하지 않는다는 것을 의미 할 뿐이며, 이 용어는 데이터가 저장매체에 반영구적으로 저장되는 경우와 임시적으로 저장되는 경우를 구분하 지 않는다. 예로, '비일시적 저장매체'는 데이터가 임시적으로 저장되는 버퍼를 포함할 수 있다. 일 실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어를 통해 또는 두개의 사용자 장치들(예: 스마트폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품(예: 다운 로더블 앱(downloadable app))의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다."}
{"patent_id": "10-2022-0178679", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 역률보상(PFC: power factor correction) 회로를 포함한 전력 변환 장치의 회로도이다. 도 2는 브릿지리스 PFC 전력 변환 장치를 보여주는 도면이다. 도 3은 본 개시의 일 실시예에 따른 입력 전압 센서가 없는 브릿지리스 PFC 전력 변환 장치를 도시하는 회로도 이다. 도 4는 본 개시의 일 실시예에 따른 입력 전압 센서가 없는 브릿지리스 PFC 전력 변환 장치를 도시하는 회로도 이다. 도 5는 본 개시의 일 실시예에 따른 순시 전력 Ps의 등가 회로를 도시한다. 도 6은 본 개시의 일 실시예에 따른 입력 전압과 맥동 전압의 파형도이다. 도 7은 본 개시의 일 실시예에 따라 역상(reversed-phase)/동상(in-phase) 판별기가 추정 입력 전압 위상을 역 상(reversed-phase)으로 추정한 경우의 파형도이다. 도 8은 본 개시의 일 실시예에 따라 역상/동상 판별기가 추정 입력 전압 위상을 동상(in-phase)으로 추정한 경 우의 파형도이다. 도 9는 본 개시의 일 실시예에 따른 브릿지리스 PFC 전력 변환 장치가 모드 1으로 동작하는 회로도이다. 도 10은 본 개시의 일 실시예에 따른 브릿지리스 PFC 전력 변환 장치가 역상 조건이고 Q2 스위치가 메인 스위치 로 동작할 때의 등가 회로도이다. 도 11a는 본 개시의 일 실시예에 따른 토템폴 브릿지리스 PFC 전력 변환 장치의 회로도이다. 도 11b는 본 개시의 일 실시예에 따라 입력 전압 양의 반주기 동안 토템폴 브릿지리스 PFC 전력 변환 장치가 동 작하는 회로도이다. 도 11c는 본 개시의 일 실시예에 따라 입력 전압 양의 반주기 동안 토템폴 브릿지리스 PFC 전력 변환 장치가 동 작하는 회로도이다. 도 11d는 본 개시의 일 실시예에 따라 입력 전압 음의 반주기 동안 토템폴 브릿지리스 PFC 전력 변환 장치가 동 작하는 회로도이다. 도 11e는 본 개시의 일 실시예에 따라 입력 전압 음의 반주기 동안 토템폴 브릿지리스 PFC 전력 변환 장치가 동 작하는 회로도이다. 도 12는 본 개시의 일 실시예에 따라 토템폴 브릿지리스 PFC 전력 변환 장치 제어 순서도이다. 도 13은 본 개시의 일 실시예에 따른 세미 브릿지리스 PFC 전력 변환 장치의 회로도이다. 도 14는 본 개시의 일 실시예에 따른 출력 전압과 출력 전압의 맥동 전압 파형도이다. 도 15는 본 개시의 일 실시예에 따른 복원한 입력 전압과 맥동 전압의 위상 정보 파형도이다. 도 16은 본 개시의 일 실시예에 따른 PFC 전력 변환 장치에서 입력 전압과 입력 전류 및 추정 입력 전압의 위상 정보 파형도이다. 도 17a는와 도 17b는 본 개시의 일 실시예에 따른 PFC 전력 변환 장치의 동작 파형도이다. 도 19는 본 개시의 일 실시예에 따라 DC 링크 커패시터 전압 센싱에 따른 입력 전압의 동상 판단 파형도이다. 도 20은 본 개시의 일 실시예에 따른 전력 변환 장치의 블록도이다. 도 21은 본 개시의 일 실시예에 따른 전력 변환 장치에서 입력 전압 센서없이 입력 전압을 복원하여 PFC 제어 방법을 나타내는 흐름도이다."}
