{"patent_id": "10-2019-0012917", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0095631", "출원번호": "10-2019-0012917", "발명의 명칭": "사용자 의류를 이용한 스타일 코디 제공 방법", "출원인": "주식회사 비즈모델라인", "발명자": "김재형"}}
{"patent_id": "10-2019-0012917", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "스타일 코디(Style Coordination)를 제공하는 서버를 통해 실행되는 방법에 있어서, 스타일 코디를 위해 지정된 C(C≥2)개의 의류 카테고리 정보와 각 의류 카테고리에 속한 의류의 스타일을 구별하기 위해 설정된 각 의류 카테고리 별 s(s≥1)개의 스타일 항목 정보와 각 스타일 항목의 변수값에 대응하는각 스타일 항목 별 스타일 특징정보를 테이블화하여 관리DB에 저장하는 제1 단계; 사용자 단말로부터 스타일 코디를 제공받을 대상에 대응하는 사용자에 대한 고유 정보와 피팅 정보와 스타일 정보를 하나 이상 포함하는 대상자 특징정보를 등록받아 상기 사용자의 고유한 사용자 식별정보와 연계하여 회원DB에 저장하는 제2 단계; 사용자가 소장하고 있는 T(T≥3)개의 각 의류에 대한 의류 기본정보와 각 의류가 속한 의류 카테고리 정보 및각 의류에 대한 의류 카테고리 기준 각 스타일 항목 별 스타일 특징정보를 테이블화한 사용자 의류 정보를 사용자 식별정보와 연계하여 옷장DB에 저장하는 절차를 수행하는 제3 단계; 상기 옷장DB에 저장된 사용자 의류 정보에 대응하는 N(3≤N≤U)개의 의류 중 회원DB에 저장된 특정 사용자의 대상자 특징정보를 근거로 상기 사용자에게 코디된 n(2≤n≤N)개의 의류 조합을 포함하는 스타일 코디정보를 확인하는 제4 단계; 상기 코디된 n개의 의류가 속한 n개의 의류 카테고리를 확인하고 상기 관리DB에 저장된 각 의류 카테고리 별 s개의 스타일 항목 정보와 각 스타일 항목 별 스타일 특징정보를 근거로 상기 n개의 의류에 대한 각 스타일 항목별 스타일 특징정보를 확인하여 테이블화한 코디 스타일 정보를 구성하여 사용자 식별정보와 연계해 코디DB에저장하는 제5 단계; 상기 사용자 식별정보를 근거로 상기 코디DB에 저장된 코디 스타일 정보에 대한 사용자의 코디 만족도 정보를확인하는 제6 단계;상기 확인된 사용자의 코디 만족도 정보를 근거로 지정된 기준 만족도 이상의 코디 스타일 정보와 대상자 특징정보를 확인하는 제7 단계; 및 상기 확인된 코디 스타일 정보와 대상자 특징정보를 근거로 지정된 인공지능알고리즘에 적용할 스타일 코디 학습정보를 구성한 후 상기 지정된 인공지능알고리즘에 상기 스타일 코디 학습정보를 적용하여 학습시키는 제8 단계;를 포함하는 사용자 의류를 이용한 스타일 코디 제공 방법."}
{"patent_id": "10-2019-0012917", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서, 복수의 쇼핑몰에 등록된 의류상품 중 인기상품에 대응하는 상품 이미지를 수집하고 이미지 분석하여 각 의류 카테고리 별로 인기상품의 스타일 항목 별 스타일 특징정보를 인식하고 테이블화하여 표본DB에 저장하는 단계를더 포함하여 이루어지는 것을 특징으로 하는 사용자 의류를 이용한 스타일 코디 제공 방법."}
{"patent_id": "10-2019-0012917", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2항에 있어서, 상기 인기상품은, 최근 일정 기간 내 판매된 개수가 기 설정된 기준 개수 이상인 의류상품, 최근 일정 기간 내 등록된 긍정 댓글의 개수가 기 설정된 기준 개수 이상인 의류상품, 각 쇼핑몰에서 인기상품으로 설정한 의류상품 중 적어도 하나의 의류상품을 포함하여 이루어지는 것을 특징으로공개특허 10-2020-0095631-3-하는 사용자 의류를 이용한 스타일 코디 제공 방법."}
{"patent_id": "10-2019-0012917", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 2항에 있어서, 상기 코디된 n개의 의류는, 상기 표본DB에 저장된 인기상품의 스타일 항목 별 스타일 특징정보 중 지정 개수 이상의 스타일 항목 별 스타일특징정보를 포함하는 의류 중에서 우선 선택되는 것을 특징으로 하는 사용자 의류를 이용한 스타일 코디 제공방법."}
{"patent_id": "10-2019-0012917", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1항에 있어서, 상기 의류 카테고리는, 복수의 상의 관련 카테고리, 복수의 하의 관련 카테고리, 복수의 아우터 관련 카테고리, 복수의 스타일 종류 관련 카테고리, 복수의 용도 관련 카테고리, 의류와 매칭되어 코디 가능한 가방 관련 카테고리, 신발 관련 카테고리, 모자 관련 카테고리, 벨트 관련 카테고리, 액세서리 관련 카테고리 중 적어도 하나 또는 둘 이상 조합한 C개의 카테고리를 포함하여 이루어지는 것을특징으로 하는 사용자 의류를 이용한 스타일 코디 제공 방법."}
{"patent_id": "10-2019-0012917", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1항에 있어서, 상기 스타일 항목은, 스타일 종류 항목, 소재/옷감 관련 항목, 핏 관련 항목, 색상 관련 항목, 날염/패턴 관련 항목 중 하나 이상의 항목을 포함하여 이루어지는 것을 특징으로 하는 사용자 의류를 이용한 스타일 코디 제공 방법."}
{"patent_id": "10-2019-0012917", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1항에 있어서, 상기 스타일 항목은, 상기 의류 카테고리가 상의 관련 카테고리를 포함하는 경우, 목 부분 스타일 항목, 어깨 부분 스타일 항목, 소매 부분 스타일 항목, 손목 부분 스타일 항목, 가슴 부분 스타일 항목, 공개특허 10-2020-0095631-4-등 부분 스타일 항목, 옆구리 부분 스타일 항목, 밑단 부분 스타일 항목,주머니 관련 스타일 항목, 바느질 관련 스타일 항목 중 하나 이상의 항목을 포함하여 이루어지는 것을 특징으로 하는 사용자 의류를 이용한 스타일 코디 제공 방법."}
{"patent_id": "10-2019-0012917", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1항에 있어서, 상기 스타일 항목은, 상기 의류 카테고리가 하의 관련 카테고리를 포함하는 경우, 허리 부분 스타일 항목, 엉덩이 부분 스타일 항목, 지퍼 부분 스타일 항목, 밑단 부분 스타일 항목,주머니 관련 스타일 항목, 바느질 관련 스타일 항목 중 하나 이상의 항목을 포함하여 이루어지는 것을 특징으로 하는 사용자 의류를 이용한 스타일 코디 제공 방법."}
{"patent_id": "10-2019-0012917", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1항에 있어서, 상기 고유 정보는, 스타일 코디를 제공받을 사용자의 키, 몸무게, 생일, 나이, 직업, 출근방법, 결혼유무, 체형 중 하나 이상의 고유한 정보를 포함하여 이루어지는 것을 특징으로 하는 사용자 의류를 이용한 스타일 코디 제공 방법."}
{"patent_id": "10-2019-0012917", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 1항에 있어서, 상기 피팅 정보는, 셔츠 피팅, 티셔츠 피팅, 바지 피팅, 코트 피팅, 자켓 피팅, 청바지 피팅, 신발 피팅을 하나 이상 포함하는 복수의 피팅 정보 중 사용자가 선호하는 피팅 정보를 포함하여 이루어지는 것을 특징으로 하는 사용자 의류를 이용한 스타일 코디 제공 방법."}
{"patent_id": "10-2019-0012917", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 1항에 있어서, 상기 사용자 스타일 정보는, 의류 카테고리 별 착용 빈도, 의류 카테고리 별 선호 색상, 선호 스타일 종류, 직장의 드레스 코드, 선호 브랜드를 하나 이상 포함하는 복수의 스타일 정보 중 사용자와 관련된 스타일 정보를 포함하여 이루어지는 것을 특징으로 하는 사용자 의류를 이용한 스타일 코디 제공 방법."}
{"patent_id": "10-2019-0012917", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 1항에 있어서, 상기 제3 단계는, 공개특허 10-2020-0095631-5-사용자 단말로부터 사용자가 소장하고 있는 T개의 각 의류에 대한 의류 기본정보와 각 의류가 속한 의류 카테고리 정보를 수신하고 각 의류에 대한 의류 카테고리 기준 스타일 항목 별 스타일 특징정보를 수신하는 단계; 및 상기 수신된 각 의류의 의류 기본정보와 의류 카테고리 정보 및 각 스타일 항목 별 스타일 특징정보를 포함하는사용자 의류 정보를 구성하여 옷장DB에 저장하는 단계;를 포함하여 이루어지는 것을 특징으로 하는 사용자 의류를 이용한 스타일 코디 제공 방법."}
{"patent_id": "10-2019-0012917", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 1항에 있어서, 상기 제3 단계는, 사용자 단말로부터 사용자가 소장하고 있는 T개의 각 의류에 대한 의류 기본정보와 각 의류의 의류사진 이미지를 수신하는 단계; 상기 수신된 각 의류의 의류사진 이미지를 이미지 분석하여 지정된 C개의 의류 카테고리 중 각 의류가 속한 의류 카테고리를 인식하고 상기 관리DB에 저장된 각 의류 카테고리 별 s개의 스타일 항목 정보와 각 스타일 항목별 스타일 특징정보를 근거로 각 의류에 대한 스타일 항목 별 스타일 특징정보를 인식하는 단계; 및 상기 수신된 각 의류의 의류 기본정보와 상기 인식된 의류 카테고리 정보 및 각 스타일 항목 별 스타일 특징정보를 포함하는 사용자 의류 정보를 구성하여 옷장DB에 저장하는 단계;를 포함하여 이루어지는 것을 특징으로 하는 사용자 의류를 이용한 스타일 코디 제공 방법."}
{"patent_id": "10-2019-0012917", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 1항에 있어서, 사용자 단말로부터 사용자의 스타일 코디를 요청하는 코디요청 정보를 수신하는 단계를 더 포함하여 이루어지는것을 특징으로 하는 사용자 의류를 이용한 스타일 코디 제공 방법."}
{"patent_id": "10-2019-0012917", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 14항에 있어서, 상기 코디요청 정보는, 스타일 코디의 용도 정보, 스타일 코디의 미적 의도 정보, 스타일 코디할 일시 정보를 하나 이상 포함하여 이루어지는 것을 특징으로 하는 사용자 의류를 이용한 스타일코디 제공 방법."}
{"patent_id": "10-2019-0012917", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 1항 또는 제 14항에 있어서, 지정된 조건을 근거로 상기 M개의 의류 중 사용자에게 스타일 코디 가능한 N(3≤N≤U)개의 의류를 선별하는 단계를 더 포함하여 이루어지는 것을 특징으로 하는 사용자 의류를 이용한 스타일 코디 제공 방법."}
{"patent_id": "10-2019-0012917", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 1항에 있어서, 상기 제4 단계는, 상기 회원DB로부터 스타일 코디할 특정 사용자의 대상자 특징정보를 추출하고 상기 옷장DB로부터 스타일 코디가능한 N개의 사용자 의류 정보를 추출하는 단계;공개특허 10-2020-0095631-6-지정된 스타일 코디 전문가 단말로 상기 추출된 대상자 특징정보와 상기 N개의 사용자 의류 정보를 제공하는 단계; 및상기 스타일 코디 전문가 단말로부터 상기 대상자 특징정보와 상기 N개의 사용자 의류 정보를 근거로 상기 사용자에게 코디된 n개의 의류 조합을 포함하는 스타일 코디정보를 수신하는 단계;를 포함하여 이루어지는 것을 특징으로 하는 사용자 의류를 이용한 스타일 코디 제공 방법."}
{"patent_id": "10-2019-0012917", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 1항에 있어서, 상기 제4 단계는, 상기 회원DB로부터 스타일 코디할 특정 사용자의 대상자 특징정보를 추출하고 상기 옷장DB로부터 스타일 코디가능한 N개의 사용자 의류 정보를 추출하는 단계;상기 추출된 대상자 특징정보와 상기 N개의 사용자 의류 정보를 이용하여 스타일 코디를 위해 지정된 인공지능알고리즘에 적용할 입력정보를 구성하는 단계; 및상기 인공지능알고리즘에 상기 구성된 입력정보를 적용하여 상기 인공지능알고리즘을 통해 상기 사용자에게 코디된 n개의 의류 조합을 포함하는 스타일 코디정보를 확인하는 단계;를 포함하여 이루어지는 것을 특징으로 하는 사용자 의류를 이용한 스타일 코디 제공 방법."}
{"patent_id": "10-2019-0012917", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 1항에 있어서, 상기 제4 단계는, 상기 회원DB로부터 스타일 코디할 특정 사용자의 대상자 특징정보를 추출하고 상기 옷장DB로부터 스타일 코디가능한 N개의 사용자 의류 정보를 추출하는 단계;상기 추출된 대상자 특징정보와 상기 N개의 사용자 의류 정보를 이용하여 스타일 코디를 위해 지정된 인공지능알고리즘에 적용할 입력정보를 구성하는 단계;상기 인공지능알고리즘에 상기 구성된 입력정보를 적용하여 상기 인공지능알고리즘을 통해 상기 사용자에게 코디된 n개의 의류 조합을 포함하는 스타일 코디정보를 확인하는 단계;지정된 스타일 코디 전문가 단말로 상기 추출된 대상자 특징정보와 p(1≤p≤N)개의 사용자 의류 정보 및 상기확인된 n개의 의류 조합을 포함하는 스타일 코디정보를 제공하는 단계; 및상기 스타일 코디 전문가 단말로부터 상기 대상자 특징정보와 p개의 사용자 의류 정보를 근거로 수정된 n개의의류 조합을 포함하는 스타일 코디정보를 수신하는 단계;를 포함하여 이루어지는 것을 특징으로 하는 사용자 의류를 이용한 스타일 코디 제공 방법."}
{"patent_id": "10-2019-0012917", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 1항에 있어서, 상기 코디된 n개의 의류는, 동일한 의류 카테고리의 의류가 중복 선택되지 않는 것을 특징으로 하는 사용자 의류를 이용한 스타일 코디 제공 방법."}
{"patent_id": "10-2019-0012917", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제 1항에 있어서, 상기 제4 단계는, 사용자 식별정보를 이용하여 사용자 단말로 상기 사용자에게 코디된 n개의 의류 조합을 포함하는 스타일 코디정보를 제공하는 단계; 및 공개특허 10-2020-0095631-7-상기 사용자 단말로부터 상기 스타일 코디정보에 대한 사용자의 코디 승인정보 또는 코디 거부정보를 수신하는단계;를 더 포함하여 이루어지는 것을 특징으로 하는 사용자 의류를 이용한 스타일 코디 제공 방법."}
{"patent_id": "10-2019-0012917", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제 21항에 있어서, 상기 사용자의 코디 거부정보를 수신한 경우 상기 거부된 스타일 코디정보에 포함된 n개의 의류 조합 이외에 다른 의류 조합을 사용자에게 코디하기 위한 절차를 수행하도록 처리하는 단계를 더 포함하여 이루어지는 것을 특징으로 하는 사용자 의류를 이용한 스타일 코디 제공 방법."}
{"patent_id": "10-2019-0012917", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제 21항에 있어서, 상기 제6 단계는, 상기 사용자의 코디 승인정보를 수신한 경우 상기 수신된 코디 승인정보를 근거로 상기 사용자에게 코디된 n개의 의류 조합에 대한 사용자의 코디 만족도 정보를 산출하는 단계를 포함하여 이루어지는 것을 특징으로 하는사용자 의류를 이용한 스타일 코디 제공 방법."}
{"patent_id": "10-2019-0012917", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제 1항 또는 제 21항에 있어서, 상기 제6 단계는, 사용자 식별정보를 이용하여 사용자 단말로 상기 사용자에게 코디된 n개의 의류 조합에 대한 사용자의 코디 만족도 정보를 요청하는 단계; 및상기 사용자 단말로부터 상기 코디 만족도 정보를 수신하는 단계를 포함하여 이루어지는 것을 특징으로 하는 사용자 의류를 이용한 스타일 코디 제공 방법."}
{"patent_id": "10-2019-0012917", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명에 따른 사용자 의류를 이용한 스타일 코디 제공 방법은, 스타일 코디(Style Coordination)를 제공하는 서버를 통해 실행되는 방법에 있어서, 스타일 코디를 위해 지정된 C(C≥2)개의 의류 카테고리 정보와 각 의류 카 테고리에 속한 의류의 스타일을 구별하기 위해 설정된 각 의류 카테고리 별 s(s≥1)개의 스타일 항목 정보와 각 (뒷면에 계속)"}
{"patent_id": "10-2019-0012917", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 사용자 의류를 이용한 스타일 코디 제공 방법에 관한 것으로, 사용자가 소장하고 있는 다수개의 각 의류에 대한 의류 기본정보와 각 의류가 속한 의류 카테고리 정보 및 각 의류에 대한 의류 카테고리 기준 각 스 타일 항목 별 스타일 특징정보를 테이블화한 사용자 의류 정보와, 사용자에 대한 고유 정보와 피팅 정보와 스타 일 정보를 하나 이상 포함하는 대상자 특징정보를 저장하고, 상기 사용자 의류 정보와 대상자 특징정보를 근거 로 상기 사용자가 소장한 의류에 대해 코디된 스타일 코디정보를 사용자에게 제공하는 방법에 관한 것이다. 또한, 본 발명은 사용자의 코디 만족도 정보를 근거로 지정된 기준 만족도 이상의 코디 스타일 정보와 대상자 특징정보를 근거로 지정된 인공지능알고리즘에 적용할 스타일 코디 학습정보를 구성한 후 지정된 인공지능알고 리즘에 스타일 코디 학습정보를 적용하여 학습시키는 방법에 관한 것이다."}
{"patent_id": "10-2019-0012917", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 온라인에서 의류를 구매하는 경우, 해당 쇼핑몰의 회원 가입부터 상품 선택, 사이즈, 색깔 선정 등 다양한 절차를 거치게 된다. 특히 온라인의 경우 실제 의류를 착용할 수 없을 뿐만 아니라 전문 코디가 아닌 이 상 해당 제품이 배송되어 실제 착용한 후 생각했던 제품이 아니거나 어울리지 않는 경우가 많았다.대한민국 공개특허공보 제10-2018-0062114호(2018년 06월 08일 공개)는 코디 제안 시스템 및 방법에 대한 것으 로, 사용자의 헤어 스타일, 얼굴 유형, 체형, 화장품, 의류 및 액세서리와 관련된 사용자의 개인정보를 이용하 여, 사용자에게 코디를 제안할 수 있는 방법이 개시되어 있다. 그러나, 해당 의류에 대한 사진을 이용한 단순 조합을 통해 전문가로부터 코디를 받는 것일 뿐, 다양한 의류 카 테고리 별 의류의 각 스타일 항목 별 스타일 특징정보를 기반으로 스타일 코디할 의류를 조합하지는 않기 때문 에 의류 조합에 제한이나 한계가 존재할 수 밖에 없었다."}
{"patent_id": "10-2019-0012917", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상기와 같은 문제점을 해소하기 위한 본 발명의 목적은, 사용자가 소장하고 있는 다수개의 각 의류에 대한 의류 기본정보와 각 의류가 속한 의류 카테고리 정보 및 각 의류에 대한 의류 카테고리 기준 각 스타일 항목 별 스타 일 특징정보를 테이블화한 사용자 의류 정보와, 사용자에 대한 고유 정보와 피팅 정보와 스타일 정보를 하나 이 상 포함하는 대상자 특징정보를 저장하고, 상기 사용자 의류 정보와 대상자 특징정보를 근거로 상기 사용자가 소장한 의류에 대해 코디된 스타일 코디정보를 사용자에게 제공함과 동시에, 사용자의 코디 만족도 정보를 근거 로 지정된 기준 만족도 이상의 코디 스타일 정보와 대상자 특징정보를 근거로 지정된 인공지능알고리즘에 적용 할 스타일 코디 학습정보를 구성한 후 지정된 인공지능알고리즘에 스타일 코디 학습정보를 적용하여 학습시키는 사용자 의류를 이용한 스타일 코디 제공 방법을 제공함에 있다."}
{"patent_id": "10-2019-0012917", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 따른 사용자 의류를 이용한 스타일 코디 제공 방법은, 스타일 코디(Style Coordination)를 제공하는 서버를 통해 실행되는 방법에 있어서, 스타일 코디를 위해 지정된 C(C≥2)개의 의류 카테고리 정보와 각 의류 카테고리에 속한 의류의 스타일을 구별하기 위해 설정된 각 의류 카테고리 별 s(s≥1)개의 스타일 항목 정보와 각 스타일 항목의 변수값에 대응하는 각 스타일 항목 별 스타일 특징정보를 테이블화하여 관리DB에 저장하는 제 1 단계와 사용자 단말로부터 스타일 코디를 제공받을 대상에 대응하는 사용자에 대한 고유 정보와 피팅 정보와 스타일 정보를 하나 이상 포함하는 대상자 특징정보를 등록받아 상기 사용자의 고유한 사용자 식별정보와 연계 하여 회원DB에 저장하는 제2 단계와 사용자가 소장하고 있는 T(T≥3)개의 각 의류에 대한 의류 기본정보와 각 의류가 속한 의류 카테고리 정보 및 각 의류에 대한 의류 카테고리 기준 각 스타일 항목 별 스타일 특징정보를 테이블화한 사용자 의류 정보를 사용자 식별정보와 연계하여 옷장DB에 저장하는 절차를 수행하는 제3 단계와 상 기 옷장DB에 저장된 사용자 의류 정보에 대응하는 N(3≤N≤U)개의 의류 중 회원DB에 저장된 특정 사용자의 대상 자 특징정보를 근거로 상기 사용자에게 코디된 n(2≤n≤N)개의 의류 조합을 포함하는 스타일 코디정보를 확인하 는 제4 단계와 상기 코디된 n개의 의류가 속한 n개의 의류 카테고리를 확인하고 상기 관리DB에 저장된 각 의류 카테고리 별 s개의 스타일 항목 정보와 각 스타일 항목 별 스타일 특징정보를 근거로 상기 n개의 의류에 대한 각 스타일 항목 별 스타일 특징정보를 확인하여 테이블화한 코디 스타일 정보를 구성하여 사용자 식별정보와 연 계해 코디DB에 저장하는 제5 단계와 상기 사용자 식별정보를 근거로 상기 코디DB에 저장된 코디 스타일 정보에 대한 사용자의 코디 만족도 정보를 확인하는 제6 단계와 상기 확인된 사용자의 코디 만족도 정보를 근거로 지정 된 기준 만족도 이상의 코디 스타일 정보와 대상자 특징정보를 확인하는 제7 단계 및 상기 확인된 코디 스타일 정보와 대상자 특징정보를 근거로 지정된 인공지능알고리즘에 적용할 스타일 코디 학습정보를 구성한 후 상기 지정된 인공지능알고리즘에 상기 스타일 코디 학습정보를 적용하여 학습시키는 제8 단계를 포함하는 것을 특징 으로 한다. 본 발명에 따른 사용자 의류를 이용한 스타일 코디 제공 방법에 있어서, 복수의 쇼핑몰에 등록된 의류상품 중 인기상품에 대응하는 상품 이미지를 수집하고 이미지 분석하여 각 의류 카테고리 별로 인기상품의 스타일 항목 별 스타일 특징정보를 인식하고 테이블화하여 표본DB에 저장하는 단계를 더 포함하여 이루어지는 것을 특징으로 한다.본 발명에 따른 사용자 의류를 이용한 스타일 코디 제공 방법에 있어서, 상기 인기상품은, 최근 일정 기간 내 판매된 개수가 기 설정된 기준 개수 이상인 의류상품, 최근 일정 기간 내 등록된 긍정 댓글의 개수가 기 설정된 기준 개수 이상인 의류상품, 각 쇼핑몰에서 인기상품으로 설정한 의류상품 중 적어도 하나의 의류상품을 포함하 여 이루어지는 것을 특징으로 한다. 본 발명에 따른 사용자 의류를 이용한 스타일 코디 제공 방법에 있어서,상기 코디된 n개의 의류는, 상기 표본DB 에 저장된 인기상품의 스타일 항목 별 스타일 특징정보 중 지정 개수 이상의 스타일 항목 별 스타일 특징정보를 포함하는 의류 중에서 우선 선택되는 것을 특징으로 한다. 본 발명에 따른 사용자 의류를 이용한 스타일 코디 제공 방법에 있어서, 상기 의류 카테고리는, 복수의 상의 관 련 카테고리, 복수의 하의 관련 카테고리, 복수의 아우터 관련 카테고리, 복수의 스타일 종류 관련 카테고리, 복수의 용도 관련 카테고리, 의류와 매칭되어 코디 가능한 가방 관련 카테고리, 신발 관련 카테고리, 모자 관련 카테고리, 벨트 관련 카테고리, 액세서리 관련 카테고리 중 적어도 하나 또는 둘 이상 조합한 C개의 카테고리를 포함하여 이루어지는 것을 특징으로 한다. 본 발명에 따른 사용자 의류를 이용한 스타일 코디 제공 방법에 있어서, 상기 스타일 항목은, 스타일 종류 항목, 소재/옷감 관련 항목, 핏 관련 항목, 색상 관련 항목, 날염/패턴 관련 항목 중 하나 이상의 항목을 포함 하여 이루어지는 것을 특징으로 한다. 본 발명에 따른 사용자 의류를 이용한 스타일 코디 제공 방법에 있어서, 상기 스타일 항목은, 상기 의류 카테고 리가 상의 관련 카테고리를 포함하는 경우, 목 부분 스타일 항목, 어깨 부분 스타일 항목, 소매 부분 스타일 항 목, 손목 부분 스타일 항목, 가슴 부분 스타일 항목, 등 부분 스타일 항목, 옆구리 부분 스타일 항목, 밑단 부 분 스타일 항목,주머니 관련 스타일 항목, 바느질 관련 스타일 항목 중 하나 이상의 항목을 포함하여 이루어지 는 것을 특징으로 한다. 본 발명에 따른 사용자 의류를 이용한 스타일 코디 제공 방법에 있어서, 상기 스타일 항목은, 상기 의류 카테고 리가 하의 관련 카테고리를 포함하는 경우, 허리 부분 스타일 항목, 엉덩이 부분 스타일 항목, 지퍼 부분 스타 일 항목, 밑단 부분 스타일 항목,주머니 관련 스타일 항목, 바느질 관련 스타일 항목 중 하나 이상의 항목을 포 함하여 이루어지는 것을 특징으로 한다. 본 발명에 따른 사용자 의류를 이용한 스타일 코디 제공 방법에 있어서, 상기 고유 정보는, 스타일 코디를 제공 받을 사용자의 키, 몸무게, 생일, 나이, 직업, 출근방법, 결혼유무, 체형 중 하나 이상의 고유한 정보를 포함하 여 이루어지는 것을 특징으로 한다. 본 발명에 따른 사용자 의류를 이용한 스타일 코디 제공 방법에 있어서, 상기 피팅 정보는, 셔츠 피팅, 티셔츠 피팅, 바지 피팅, 코트 피팅, 자켓 피팅, 청바지 피팅, 신발 피팅을 하나 이상 포함하는 복수의 피팅 정보 중 사용자가 선호하는 피팅 정보를 포함하여 이루어지는 것을 특징으로 한다. 본 발명에 따른 사용자 의류를 이용한 스타일 코디 제공 방법에 있어서, 상기 사용자 스타일 정보는, 의류 카테 고리 별 착용 빈도, 의류 카테고리 별 선호 색상, 선호 스타일 종류, 직장의 드레스 코드, 선호 브랜드를 하나 이상 포함하는 복수의 스타일 정보 중 사용자와 관련된 스타일 정보를 포함하여 이루어지는 것을 특징으로 한다.본 발명에 따른 사용자 의류를 이용한 스타일 코디 제공 방법에 있어서, 상기 제3 단계는, 사용자 단말로부터 사용자가 소장하고 있는 T개의 각 의류에 대한 의류 기본정보와 각 의류가 속한 의류 카테고리 정보를 수신하고 각 의류에 대한 의류 카테고리 기준 스타일 항목 별 스타일 특징정보를 수신하는 단계 및 상기 수신된 각 의류 의 의류 기본정보와 의류 카테고리 정보 및 각 스타일 항목 별 스타일 특징정보를 포함하는 사용자 의류 정보를 구성하여 옷장DB에 저장하는 단계를 포함하여 이루어지는 것을 특징으로 한다. 본 발명에 따른 사용자 의류를 이용한 스타일 코디 제공 방법에 있어서, 상기 제3 단계는, 사용자 단말로부터 사용자가 소장하고 있는 T개의 각 의류에 대한 의류 기본정보와 각 의류의 의류사진 이미지를 수신하는 단계와 상기 수신된 각 의류의 의류사진 이미지를 이미지 분석하여 지정된 C개의 의류 카테고리 중 각 의류가 속한 의 류 카테고리를 인식하고 상기 관리DB에 저장된 각 의류 카테고리 별 s개의 스타일 항목 정보와 각 스타일 항목 별 스타일 특징정보를 근거로 각 의류에 대한 스타일 항목 별 스타일 특징정보를 인식하는 단계 및 상기 수신 된 각 의류의 의류 기본정보와 상기 인식된 의류 카테고리 정보 및 각 스타일 항목 별 스타일 특징정보를 포함 하는 사용자 의류 정보를 구성하여 옷장DB에 저장하는 단계를 포함하여 이루어지는 것을 특징으로 한다. 본 발명에 따른 사용자 의류를 이용한 스타일 코디 제공 방법에 있어서, 사용자 단말로부터 사용자의 스타일 코 디를 요청하는 코디요청 정보를 수신하는 단계를 더 포함하여 이루어지는 것을 특징으로 한다. 본 발명에 따른 사용자 의류를 이용한 스타일 코디 제공 방법에 있어서, 상기 코디요청 정보는, 스타일 코디의 용도 정보, 스타일 코디의 미적 의도 정보, 스타일 코디할 일시 정보를 하나 이상 포함하여 이루어지는 것을 특 징으로 한다. 본 발명에 따른 사용자 의류를 이용한 스타일 코디 제공 방법에 있어서, 지정된 조건을 근거로 상기 M개의 의류 중 사용자에게 스타일 코디 가능한 N(3≤N≤U)개의 의류를 선별하는 단계를 더 포함하여 이루어지는 것을 특징 으로 한다. 본 발명에 따른 사용자 의류를 이용한 스타일 코디 제공 방법에 있어서, 상기 제4 단계는, 상기 회원DB로부터 스타일 코디할 특정 사용자의 대상자 특징정보를 추출하고 상기 옷장DB로부터 스타일 코디 가능한 N개의 사용자 의류 정보를 추출하는 단계와 지정된 스타일 코디 전문가 단말로 상기 추출된 대상자 특징정보와 상기 N개의 사 용자 의류 정보를 제공하는 단계 및 상기 스타일 코디 전문가 단말로부터 상기 대상자 특징정보와 상기 N개의 사용자 의류 정보를 근거로 상기 사용자에게 코디된 n개의 의류 조합을 포함하는 스타일 코디정보를 수신하는 단계;를 포함하여 이루어지는 것을 특징으로 한다. 본 발명에 따른 사용자 의류를 이용한 스타일 코디 제공 방법에 있어서,상기 제4 단계는, 상기 회원DB로부터 스 타일 코디할 특정 사용자의 대상자 특징정보를 추출하고 상기 옷장DB로부터 스타일 코디 가능한 N개의 사용자 의류 정보를 추출하는 단계와 상기 추출된 대상자 특징정보와 상기 N개의 사용자 의류 정보를 이용하여 스타일 코디를 위해 지정된 인공지능알고리즘에 적용할 입력정보를 구성하는 단계 및 상기 인공지능알고리즘에 상기 구 성된 입력정보를 적용하여 상기 인공지능알고리즘을 통해 상기 사용자에게 코디된 n개의 의류 조합을 포함하는 스타일 코디정보를 확인하는 단계를 포함하여 이루어지는 것을 특징으로 한다. 본 발명에 따른 사용자 의류를 이용한 스타일 코디 제공 방법에 있어서, 상기 제4 단계는, 상기 회원DB로부터 스타일 코디할 특정 사용자의 대상자 특징정보를 추출하고 상기 옷장DB로부터 스타일 코디 가능한 N개의 사용자 의류 정보를 추출하는 단계와 상기 추출된 대상자 특징정보와 상기 N개의 사용자 의류 정보를 이용하여 스타일 코디를 위해 지정된 인공지능알고리즘에 적용할 입력정보를 구성하는 단계와 상기 인공지능알고리즘에 상기 구성된 입력정보를 적용하여 상기 인공지능알고리즘을 통해 상기 사용자에게 코디된 n개의 의류 조합을 포함하는 스타일 코디정보를 확인하는 단계와 지정된 스타일 코디 전문가 단말로 상기 추출된 대상자 특징정보와 p(1≤p ≤N)개의 사용자 의류 정보 및 상기 확인된 n개의 의류 조합을 포함하는 스타일 코디정보를 제공하는 단계 및 상기 스타일 코디 전문가 단말로부터 상기 대상자 특징정보와 p개의 사용자 의류 정보를 근거로 수정된 n개의 의류 조합을 포함하는 스타일 코디정보를 수신하는 단계를 포함하여 이루어지는 것을 특징으로 한다. 본 발명에 따른 사용자 의류를 이용한 스타일 코디 제공 방법에 있어서, 상기 코디된 n개의 의류는, 동일한 의 류 카테고리의 의류가 중복 선택되지 않는 것을 특징으로 한다. 본 발명에 따른 사용자 의류를 이용한 스타일 코디 제공 방법에 있어서, 상기 제4 단계는, 사용자 식별정보를 이용하여 사용자 단말로 상기 사용자에게 코디된 n개의 의류 조합을 포함하는 스타일 코디정보를 제공하는 단계 및 상기 사용자 단말로부터 상기 스타일 코디정보에 대한 사용자의 코디 승인정보 또는 코디 거부정보를 수신 하는 단계를 더 포함하여 이루어지는 것을 특징으로 한다. 본 발명에 따른 사용자 의류를 이용한 스타일 코디 제공 방법에 있어서, 상기 사용자의 코디 거부정보를 수신한 경우 상기 거부된 스타일 코디정보에 포함된 n개의 의류 조합 이외에 다른 의류 조합을 사용자에게 코디하기 위 한 절차를 수행하도록 처리하는 단계를 더 포함하여 이루어지는 것을 특징으로 한다. 본 발명에 따른 사용자 의류를 이용한 스타일 코디 제공 방법에 있어서, 상기 제6 단계는, 상기 사용자의 코디 승인정보를 수신한 경우 상기 수신된 코디 승인정보를 근거로 상기 사용자에게 코디된 n개의 의류 조합에 대한 사용자의 코디 만족도 정보를 산출하는 단계를 포함하여 이루어지는 것을 특징으로 한다. 본 발명에 따른 사용자 의류를 이용한 스타일 코디 제공 방법에 있어서, 상기 제6 단계는, 사용자 식별정보를 이용하여 사용자 단말로 상기 사용자에게 코디된 n개의 의류 조합에 대한 사용자의 코디 만족도 정보를 요청하 는 단계 및 상기 사용자 단말로부터 상기 코디 만족도 정보를 수신하는 단계를 포함하여 이루어지는 것을 특징 으로 한다."}
{"patent_id": "10-2019-0012917", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 사용자가 소장하고 있는 다수개의 각 의류에 대한 의류 기본정보와 각 의류가 속한 의류 카 테고리 정보 및 각 의류에 대한 의류 카테고리 기준 각 스타일 항목 별 스타일 특징정보를 테이블화한 사용자 의류 정보와, 사용자에 대한 고유 정보와 피팅 정보와 스타일 정보를 하나 이상 포함하는 대상자 특징정보를 저 장하고, 상기 사용자 의류 정보와 대상자 특징정보를 근거로 상기 사용자가 소장한 의류에 대해 코디된 스타일 코디정보를 사용자에게 제공하고, 사용자의 코디 만족도 정보를 근거로 지정된 기준 만족도 이상의 코디 스타일 정보와 대상자 특징정보를 근거로 지정된 인공지능알고리즘에 적용할 스타일 코디 학습정보를 구성한 후 지정된 인공지능알고리즘에 스타일 코디 학습정보를 적용하여 학습시킴으로써, 다양한 의류 카테고리 별 의류의 각 스 타일 항목 별 스타일 특징정보를 기반으로 스타일 코디할 의류를 조합하지는 않기 때문에 의류 조합에 제한이나 한계가 없는 이점이 있다."}
{"patent_id": "10-2019-0012917", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 첨부된 도면과 설명을 참조하여 본 발명의 바람직한 실시예에 대한 동작 원리를 상세히 설명한다. 다만, 하기에 도시되는 도면과 후술되는 설명은 본 발명의 특징을 효과적으로 설명하기 위한 여러 가지 방법 중에서 바람직한 실시 방법에 대한 것이며, 본 발명이 하기의 도면과 설명만으로 한정되는 것은 아니다. 즉, 하기의 실시예는 본 발명의 수 많은 실시예 중에 바람직한 합집합 형태의 실시예 예에 해당하며, 하기의 실 시예에서 특정 구성(또는 단계)를 생략하는 실시예, 또는 특정 구성(또는 단계)에 구현된 기능을 특정 구성(또 는 단계)로 분할하는 실시예, 또는 둘 이상의 구성(또는 단계)에 구현된 기능을 어느 하나의 구성(또는 단계)에 통합하는 실시예, 특정 구성(또는 단계)의 동작 순서를 교체하는 실시예 등은, 하기의 실시예에서 별도로 언급 하지 않더라도 모두 본 발명의 권리범위에 속함을 명백하게 밝혀두는 바이다. 따라서 하기의 실시예를 기준으로 부분집합 또는 여집합에 해당하는 다양한 실시예들이 본 발명의 출원일을 소급받아 분할될 수 있음을 분명하게 명기하는 바이다. 또한, 하기에서 본 발명을 설명함에 있어 관련된 공지 기능 또는 구성에 대한 구체적인 설명이 본 발명의 요지 를 불필요하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명을 생략할 것이다. 그리고 후술되는 용어들은 본 발명에서의 기능을 고려하여 정의된 용어들로서, 이는 사용자, 운용자의 의도 또는 관례 등에 따라 달라질 수 있다. 그러므로 그 정의는 본 발명에서 전반에 걸친 내용을 토대로 내려져야 할 것이다. 결과적으로, 본 발명의 기술적 사상은 청구범위에 의해 결정되며, 이하 실시예는 진보적인 본 발명의 기술적 사"}
{"patent_id": "10-2019-0012917", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "상을 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 효율적으로 설명하기 위한 일 수단일 뿐이다. 도면1은 본 발명의 실시 방법에 따른 사용자 의류를 이용한 스타일 코디 제공 시스템 구성을 도시한 도면이다. 보다 상세하게 본 도면1은 사용자가 소장하고 있는 각 의류에 대한 의류 기본정보와 각 의류 카테고리 별 의류 의 각 스타일 항목 별 스타일 특징정보를 기반으로 스타일 코디할 의류를 조합하여 사용자에게 스타일 코드를"}
{"patent_id": "10-2019-0012917", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "제공하는 시스템의 구성을 도시한 것으로서, 본 발명이 속한 기술분야에서 통상의 지식을 가진 자라면, 본 도면 1을 참조 및/또는 변형하여 상기 스타일 코디 시스템에 대한 다양한 실시 방법을 유추할 수 있을 것이나, 본 발 명은 상기 유추되는 모든 실시 방법을 포함하여 이루어지며, 본 도면1에 도시된 실시 방법만으로 그 기술적 특 징이 한정되지 아니한다. 본 발명의 시스템은, 스타일 코디를 제공받는 사용자가 이용하는 사용자 단말과, 스타일 코디 제공을 위한 서버를 관리 및 운영하는 운영자가 이용하는 운영자 단말과, 스타일 코디 제공을 위한 스타일 코디 전문가가 이용하는 전문가 단말과, 상기 각 단말과 연동하여 사용자의 특징정보에 근거한 스타일 코디정보 를 사용자에게 제공하는 서버를 포함하여 구성될 수 있다. 한편, 상기 서버는 하나 이상의 DB를 구비 하고, 상기 사용자 단말과, 상기 운영자 단말과, 상기 전문가 단말과 통신하는 별도의 서버 형 태로 구축되거나, 기 구축된 서버의 소프트웨어 형태로 구현되는 것이 모두 가능하며, 상기 서버를 구현하는 실시예나 상기 서버의 물리적 서버 구성 또는 명칭에 의해 본 발명이 한정되지 아니한다. 이하, 편의상 본 도면1은 상기 서버를 별도의 서버 형태로 도시하여 본 발명의 특징을 설명하기로 할 것이나, 이러한 실 시예에 의해 본 발명이 한정되지 아니한다. 상기 사용자 단말은 상기 서버와 연동하여 스타일 코디를 제공받는 사용자가 이용하는 컴퓨터 장치의 총칭으로서, 유선망에 연결된 컴퓨터, 노트북 등의 유선단말과, 무선망에 연결된 휴대폰, 스마트폰, 태블릿PC, 노트북 등의 무선단말을 중 적어도 하나를 포함한다. 바람직하게, 상기 사용자 단말은 상기 서버로 스타일 코디를 제공받을 대상에 대응하는 사용자에 대한 고유 정보와 피팅 정보와 스타일 정보를 하나 이상 포 함하는 대상자 특징정보를 제공하여 등록하는 기능과, 상기 서버로 상기 사용자의 스타일 코디를 요청하는 기능과, 상기 서버로부터 스타일 코디를 제공받는 기능과, 상기 서버로 스타일 코디에 대한 승인정보 또는 거부정보를 제공하는 기능을 포함하며, 실시 방법에 따라 상기 기능을 위해 지정된 적어도 하나 이상의 절 차를 수행하는 앱(Application)이 설치될 수 있으며, 이 중 일부의 구성은 웹 방식을 통해 구현될 수도 있다. 이하, 별도의 언급이 없더라도 상기 사용자 단말을 주체로 하여 설명하는 기능은 상기 사용자 단말에 설치된 앱이나 웹 방식을 통해 구현되는 것임을 명백하게 밝혀두는 바이다. 상기 운영자 단말은 상기 서버와 연동하여 스타일 코디 서비스 제공을 위한 운영자가 이용하는 컴퓨 터 장치의 총칭으로서, 유선망에 연결된 컴퓨터, 노트북 등의 유선단말과, 무선망에 연결된 휴대폰, 스마트폰, 태블릿PC, 노트북 등의 무선단말을 중 적어도 하나를 포함한다. 바람직하게, 상기 운영자 단말은 사용자에 게 제공 가능한 각 의류에 대한 의류 기본정보와 각 의류가 속한 의류 카테고리 정보를 수신하고 각 의류에 대 한 의류 카테고리 기준 스타일 항목 별 스타일 특징정보를 상기 서버로 제공하는 기능과, 사용자에게 제공 가능한 각 의류에 대한 의류 기본정보와 각 의류의 의류사진 이미지를 상기 서버로 제공하는 기능을 포함 하며, 실시 방법에 따라 상기 기능을 위해 지정된 적어도 하나 이상의 절차를 수행하는 앱(Application)이 설치 될 수 있으며, 이 중 일부의 구성은 웹 방식을 통해 구현될 수도 있다. 이하, 별도의 언급이 없더라도 상기 운 영자 단말을 주체로 하여 설명하는 기능은 상기 운영자 단말에 설치된 앱이나 웹 방식을 통해 구현되 는 것임을 명백하게 밝혀두는 바이다. 상기 전문가 단말은 상기 서버와 연동하여 사용자의 스타일 코디를 제공하는 스타일 코디 전문가가 이용하는 컴퓨터 장치의 총칭으로서, 유선망에 연결된 컴퓨터, 노트북 등의 유선단말과, 무선망에 연결된 휴대 폰, 스마트폰, 태블릿PC, 노트북 등의 무선단말을 중 적어도 하나를 포함한다. 바람직하게, 상기 전문가 단말 은 상기 서버로부터 대상자 특징정보와 하나 이상의 의류 스타일 정보 및 상기 확인된 하나 이상의 의류 조합을 포함하는 스타일 코디정보를 수신하는 기능과, 상기 대상자 특징정보와 의류 스타일 정보를 근거로 수정된 하나 이상의 의류 조합을 포함하는 스타일 코디정보를 상기 서버로 제공하는 기능을 포함하며, 실 시 방법에 따라 상기 기능을 위해 지정된 적어도 하나 이상의 절차를 수행하는 앱(Application)이 설치될 수 있 으며, 이 중 일부의 구성은 웹 방식을 통해 구현될 수도 있다. 이하, 별도의 언급이 없더라도 상기 전문가 단말 을 주체로 하여 설명하는 기능은 상기 전문가 단말에 설치된 앱이나 웹 방식을 통해 구현되는 것임을 명백하게 밝혀두는 바이다. 도면1을 참조하면, 상기 서버는 각 스타일 항목 별 스타일 특징정보를 테이블화하여 관리DB에 저장하 는 관리정보 저장부와, 상품 이미지를 수집 및 분석하여 각 의류 카테고리 별로 인기상품의 스타일 항목 별 스타일 특징정보를 인식하고 테이블화하여 표본DB에 저장하는 표본정보 저장부와, 대상자 특징정 보를 등록받아 상기 사용자의 고유한 사용자 식별정보와 연계하여 회원DB에 저장하는 회원정보 저장부 와, 사용자 의류 정보를 사용자 식별정보와 연계하여 옷장DB에 저장하는 의류정보 저장부와, 사 용자에게 코디된 둘 이상의 의류 조합을 포함하는 스타일 코디정보를 확인하는 코디정보 확인부와, 각 스 타일 항목 별 스타일 특징정보를 확인하여 테이블화한 코디 스타일 정보를 구성하여 사용자 식별정보와 연계해 코디DB에 저장하는 코디정보 저장부와, 사용자의 코디 만족도 정보를 확인하는 만족도 확인부와, 기준 만족도 이상의 코디 스타일 정보와 대상자 특징정보를 확인하는 특징정보 확인부와, 지정된 인공지능알고리즘에 스타일 코디 학습정보를 적용하여 학습시키는 학습정보 적용부를 포함하여 구성될 수 있다. 한편, 상기 서버는 사용자 단말로부터 사용자의 스타일 코디를 요청하는 코디요청 정보를 수신하는 코디요청 수신부와, 지정된 조건을 근거로 상기 M개의 의류 중 사용자에게 스타일 코디 가능한 N(3≤N≤ M)개의 의류를 선별하는 의류 선별부를 더 포함하여 구성될 수 있다. 여기서, 상기 코디요청 정보는 스타일 코디의 용도 정보(예컨대, 출근, 모임, 만남, 여행, 하객 등), 스타일 코 디의 미적 의도 정보(예컨대, 귀여움, 섹시함 등), 스타일 코디할 일시 정보를 하나 이상 포함할 수 있다. 상기 관리정보 저장부는 스타일 코디를 위해 지정된 C(C≥2)개의 의류 카테고리 정보와 각 의류 카테고리 에 속한 의류의 스타일을 구별하기 위해 설정된 각 의류 카테고리 별 s(s≥1)개의 스타일 항목 정보와 각 스타 일 항목의 변수값에 대응하는 각 스타일 항목 별 스타일 특징정보를 테이블화하여 관리DB에 저장한다. 여기서, 상기 의류 카테고리는 복수의 상의 관련 카테고리(예컨대, 니트티, 반팔티, 긴팔티, 후드티, 카라티 등), 복수의 하의 관련 카테고리(예컨대, 청바지, 면바지, 반바지, 트레이닝, 정정바지 등), 복수의 아우터 관 련 카테고리(예컨대, 점퍼, 야상, 패딩, 자켓, 코트 등), 복수의 스타일 종류 관련 카테고리(예컨대, 캐주얼, 정장 등), 복수의 용도 관련 카테고리(예컨대, 룸웨어, 업무용, 여행용 등), 의류와 매칭되어 코디 가능한 가방 관련 카테고리, 신발 관련 카테고리, 모자 관련 카테고리, 벨트 관련 카테고리, 액세서리 관련 카테고리 중 적 어도 하나 또는 둘 이상 조합한 C개의 카테고리를 포함할 수 있다. 한편, 상기 스타일 항목은 스타일 종류 항목, 소재/옷감 관련 항목, 핏 관련 항목(예컨대, 슬림핏, 레귤러핏, 오버핏 등), 색상 관련 항목, 날염/패턴 관련 항목 중 하나 이상의 항목을 포함할 수 있다. 또한, 상기 스타일 항목은 상기 의류 카테고리가 상의 관련 카테고리를 포함하는 경우, 목 부분 스타일 항목(예 컨대, 하이넥, 카라넥, 라운드넥, 브이넥 등), 어깨 부분 스타일 항목, 소매 부분 스타일 항목, 손목 부분 스타 일 항목, 가슴 부분 스타일 항목, 등 부분 스타일 항목, 옆구리 부분 스타일 항목, 밑단 부분 스타일 항목, 주 머니 관련 스타일 항목, 바느질 관련 스타일 항목 중 하나 이상의 항목을 포함할 수 있다. 또한, 상기 스타일 항목은 상기 의류 카테고리가 하의 관련 카테고리를 포함하는 경우, 허리 부분 스타일 항목, 엉덩이 부분 스타일 항목, 지퍼 부분 스타일 항목, 밑단 부분 스타일 항목, 주머니 관련 스타일 항목, 바느질 관련 스타일 항목 중 하나 이상의 항목을 포함할 수 있다. 상기 표본정보 저장부는 복수의 쇼핑몰에 등록된 의류상품 중 인기상품에 대응하는 상품 이미지를 수집하 고 이미지 분석하여 각 의류 카테고리 별로 인기상품의 스타일 항목 별 스타일 특징정보를 인식하고 테이블화하 여 표본DB에 저장한다. 여기서, 상기 인기상품은 최근 일정 기간 내 판매된 개수가 기 설정된 기준 개수 이상인 의류상품, 최근 일정 기간 내 등록된 긍정 댓글의 개수가 기 설정된 기준 개수 이상인 의류상품, 각 쇼핑몰에서 인기상품으로 설정한 의류상품 중 적어도 하나의 의류상품을 포함할 수 있다. 상기 회원정보 저장부는 사용자 단말로부터 스타일 코디를 제공받을 대상에 대응하는 사용자에 대한 고유 정보와 피팅 정보와 스타일 정보를 하나 이상 포함하는 대상자 특징정보를 등록받아 상기 사용자의 고유한사용자 식별정보와 연계하여 회원DB에 저장한다. 여기서, 상기 고유 정보는 스타일 코디를 제공받을 사용자의 키, 몸무게, 생일, 나이, 직업, 출근방법, 결혼유 무, 체형 중 하나 이상의 고유한 정보를 포함할 수 있다. 여기서, 상기 피팅 정보는 셔츠 피팅, 티셔츠 피팅, 바지 피팅, 코트 피팅, 자켓 피팅, 청바지 피팅, 신발 피팅 을 하나 이상 포함하는 복수의 피팅 정보 중 사용자가 선호하는 피팅 정보를 포함할 수 있다. 여기서, 상기 스타일 정보는 의류 카테고리 별 착용 빈도, 의류 카테고리 별 선호 색상, 선호 스타일 종류, 직 장의 드레스 코드, 선호 브랜드를 하나 이상 포함하는 복수의 스타일 정보 중 사용자와 관련된 스타일 정보를 포함할 수 있다. 상기 의류정보 저장부는 사용자가 소장하고 있는 T(T≥3)개의 각 의류에 대한 의류 기본정보와 각 의류가 속한 의류 카테고리 정보 및 각 의류에 대한 의류 카테고리 기준 각 스타일 항목 별 스타일 특징정보를 테이블 화한 사용자 의류 정보를 사용자 식별정보와 연계하여 옷장DB에 저장하는 절차를 수행한다. 본 발명의 실시 방법에 따르면, 상기 의류정보 저장부는 사용자 단말로부터 사용자가 소장하고 있는 T개의 각 의류에 대한 의류 기본정보와 각 의류가 속한 의류 카테고리 정보를 수신하고 각 의류에 대한 의류 카 테고리 기준 스타일 항목 별 스타일 특징정보를 수신하고, 상기 수신된 각 의류의 의류 기본정보와 의류 카테고 리 정보 및 각 스타일 항목 별 스타일 특징정보를 포함하는 사용자 의류 정보를 구성하여 옷장DB에 저장할 수 있다. 본 발명의 다른 실시 방법에 따르면, 상기 의류정보 저장부는 사용자 단말로부터 사용자가 소장하고 있는 T개의 각 의류에 대한 의류 기본정보와 각 의류의 의류사진 이미지를 수신하고, 상기 수신된 각 의류의 의 류사진 이미지를 이미지 분석하여 지정된 C개의 의류 카테고리 중 각 의류가 속한 의류 카테고리를 인식하고 상 기 관리DB에 저장된 각 의류 카테고리 별 s개의 스타일 항목 정보와 각 스타일 항목 별 스타일 특징정보를 근거로 각 의류에 대한 스타일 항목 별 스타일 특징정보를 인식하여, 상기 수신된 각 의류의 의류 기본정보와 상기 인식된 의류 카테고리 정보 및 각 스타일 항목 별 스타일 특징정보를 포함하는 사용자 의류 정보를 구성하 여 옷장DB에 저장할 수 있다. 상기 코디정보 확인부는 상기 옷장DB에 저장된 사용자 의류 정보에 대응하는 N(3≤N≤M)개의 의류 중 회원DB에 저장된 특정 사용자의 대상자 특징정보를 근거로 상기 사용자에게 코디된 n(2≤n≤N)개의 의류 조합을 포함하는 스타일 코디정보를 확인한다. 여기서, 상기 코디된 n개의 의류는 상기 표본DB에 저장된 인기상품의 스타일 항목 별 스타일 특징정보 중 지정 개수 이상의 스타일 항목 별 스타일 특징정보를 포함하는 의류 중에서 우선 선택될 수 있다. 또한, 상기 코디된 n개의 의류는 동일한 의류 카테고리의 의류가 중복 선택되지 않는 것이 바람직하다. 본 발명의 실시 방법에 따르면, 상기 코디정보 확인부는 상기 회원DB로부터 스타일 코디할 특정 사용 자의 대상자 특징정보를 추출하고 상기 옷장DB로부터 스타일 코디 가능한 N개의 사용자 의류 정보를 추출 하고, 지정된 스타일 코디 전문가 단말로 상기 추출된 대상자 특징정보와 상기 N개의 사용자 의류 정보를제공하여, 상기 스타일 코디 전문가 단말로부터 상기 대상자 특징정보와 상기 N개의 사용자 의류 정보를 근거로 상기 사용자에게 코디된 n개의 의류 조합을 포함하는 스타일 코디정보를 수신할 수 있다. 본 발명의 다른 실시 방법에 따르면, 상기 코디정보 확인부는 상기 회원DB로부터 스타일 코디할 특정 사용자의 대상자 특징정보를 추출하고 상기 옷장DB로부터 스타일 코디 가능한 N개의 사용자 의류 정보를 추출하고, 상기 추출된 대상자 특징정보와 상기 N개의 사용자 의류 정보를 이용하여 스타일 코디를 위해 지정된 인공지능알고리즘에 적용할 입력정보를 구성하여, 상기 인공지능알고리즘에 상기 구성된 입력정보를 적용하여 상기 인공지능알고리즘을 통해 상기 사용자에게 코디된 n개의 의류 조합을 포함하는 스타일 코디정보를 확인할 수 있다. 본 발명의 또 다른 실시 방법에 따르면, 상기 코디정보 확인부는 상기 회원DB로부터 스타일 코디할 특정 사용자의 대상자 특징정보를 추출하고 상기 옷장DB로부터 스타일 코디 가능한 N개의 사용자 의류 정 보를 추출하고, 상기 추출된 대상자 특징정보와 상기 N개의 사용자 의류 정보를 이용하여 스타일 코디를 위해 지정된 인공지능알고리즘에 적용할 입력정보를 구성하여, 상기 인공지능알고리즘에 상기 구성된 입력정보를 적 용하여 상기 인공지능알고리즘을 통해 상기 사용자에게 코디된 n개의 의류 조합을 포함하는 스타일 코디정보를 확인하고, 지정된 스타일 코디 전문가 단말로 상기 추출된 대상자 특징정보와 p(1≤p≤N)개의 사용자 의류 정보 및 상기 확인된 n개의 의류 조합을 포함하는 스타일 코디정보를 제공하여, 상기 스타일 코디 전문가 단말 로부터 상기 대상자 특징정보와 p개의 사용자 의류 정보를 근거로 수정된 n개의 의류 조합을 포함하는 스 타일 코디정보를 수신할 수 있다. 한편, 본 발명의 실시 방법에 따르면, 상기 코디정보 확인부는 사용자 식별정보를 이용하여 사용자 단말 로 상기 사용자에게 코디된 n개의 의류 조합을 포함하는 스타일 코디정보를 제공하고, 상기 사용자 단말 로부터 상기 스타일 코디정보에 대한 사용자의 코디 승인정보 또는 코디 거부정보를 수신할 수 있다. 또한, 상기 코디정보 확인부는 상기 사용자의 코디 거부정보를 수신한 경우 상기 거부된 스타일 코디정보 에 포함된 n개의 의류 조합 이외에 다른 의류 조합을 사용자에게 코디하기 위한 절차를 수행하도록 처리할 수 있다. 상기 코디정보 저장부는 상기 코디된 n개의 의류가 속한 n개의 의류 카테고리를 확인하고 상기 관리 DB에 저장된 각 의류 카테고리 별 s개의 스타일 항목 정보와 각 스타일 항목 별 스타일 특징정보를 근거로 상기 n개의 의류에 대한 각 스타일 항목 별 스타일 특징정보를 확인하여 테이블화한 코디 스타일 정보를 구성하 여 사용자 식별정보와 연계해 코디DB에 저장한다. 상기 만족도 확인부는 상기 사용자 식별정보를 근거로 상기 코디DB에 저장된 코디 스타일 정보에 대 한 사용자의 코디 만족도 정보를 확인한다. 본 발명의 실시 방법에 따르면, 상기 만족도 확인부는 상기 코디정보 확인부를 통해 상기 사용자의 코디 승인정보를 수신한 경우 상기 수신된 코디 승인정보를 근거로 상기 사용자에게 코디된 n개의 의류 조합에 대한 사용자의 코디 만족도 정보를 산출할 수 있다. 본 발명의 다른 실시 방법에 따르면, 상기 만족도 확인부는 사용자 식별정보를 이용하여 사용자 단말(18 5)로 상기 사용자에게 코디된 n개의 의류 조합에 대한 사용자의 코디 만족도 정보를 요청하고, 상기 사용자 단 말로부터 상기 코디 만족도 정보를 수신할 수 있다.상기 특징정보 확인부는 상기 확인된 사용자의 코디 만족도 정보를 근거로 지정된 기준 만족도 이상의 코 디 스타일 정보와 대상자 특징정보를 확인한다. 상기 학습정보 적용부는 상기 확인된 코디 스타일 정보와 대상자 특징정보를 근거로 지정된 인공지능알고 리즘에 적용할 스타일 코디 학습정보를 구성한 후 상기 지정된 인공지능알고리즘에 상기 스타일 코디 학습정보 를 적용하여 학습시킨다. 도면2는 본 발명의 실시 방법에 따라 스타일 항목 별 스타일 특징정보를 저장하는 과정을 도시한 도면이다. 보다 상세하게 본 도면2는 상기 도면1에 도시된 서버에서 각 스타일 항목 별 스타일 특징정보를 저장하는"}
{"patent_id": "10-2019-0012917", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "과정을 도시한 것으로서, 본 발명이 속한 기술분야에서 통상의 지식을 가진 자라면, 본 도면2를 참조 및/또는 변형하여 상기 과정에 대한 다양한 실시 방법(예컨대, 일부 단계가 생략되거나, 또는 순서가 변경된 실시 방 법)을 유추할 수 있을 것이나, 본 발명은 상기 유추되는 모든 실시 방법을 포함하여 이루어지며, 본 도면2에 도 시된 실시 방법만으로 그 기술적 특징이 한정되지 아니한다. 도면2를 참조하면, 서버에서 스타일 코디를 위해 지정된 C(C≥2)개의 의류 카테고리 정보와 각 의류 카테 고리에 속한 의류의 스타일을 구별하기 위해 설정된 각 의류 카테고리 별 s(s≥1)개의 스타일 항목 정보와 각 스타일 항목의 변수값에 대응하는 각 스타일 항목 별 스타일 특징정보를 테이블화하여 관리DB에 저장한다 . 이후, 상기 서버는 복수의 쇼핑몰에 등록된 의류상품 중 인기상품에 대응하는 상품 이미지를 수집하고 , 상기 수집된 상품 이미지를 분석하여 각 의류 카테고리 별로 인기상품의 스타일 항목 별 스타일 특징정 보를 인식한다. 그리고, 상기 서버는 상기 인식된 인기상품의 스타일 항목 별 스타일 특징정보를 테이블화하여 표본 DB에 저장한다. 한편, 상기 서버는 사용자 단말로부터 스타일 코디를 제공받을 대상에 대응하는 사용자에 대한 고유 정보 와 피팅 정보와 스타일 정보를 하나 이상 포함하는 대상자 특징정보가 제공되면, 상기 대상자 특징정보를 등록하고 상기 사용자의 고유한 사용자 식별정보와 연계하여 회원DB에 저장한다. 도면3은 본 발명의 실시 방법에 따라 사용자 의류 정보를 저장하는 과정을 도시한 도면이다. 보다 상세하게 본 도면3은 상기 도면2의 과정 이후, 사용자가 소장하고 있는 T(T≥3)개의 각 의류에 대한 의류 기본정보와 각 의류가 속한 의류 카테고리 정보 및 각 의류에 대한 의류 카테고리 기준 각 스타일 항목 별 스타 일 특징정보를 포함하는 사용자 의류 정보를 옷장DB에 저장하는 과정을 도시한 것으로서, 본 발명이 속한 기술 분야에서 통상의 지식을 가진 자라면, 본 도면3을 참조 및/또는 변형하여 상기 과정에 대한 다양한 실시 방법 (예컨대, 일부 단계가 생략되거나, 또는 순서가 변경된 실시 방법)을 유추할 수 있을 것이나, 본 발명은 상기 유추되는 모든 실시 방법을 포함하여 이루어지며, 본 도면3에 도시된 실시 방법만으로 그 기술적 특징이 한정되 지 아니한다.도면3을 참조하면, 상기 도면2의 과정 이후, 사용자 단말에서 사용자가 소장하고 있는 T개의 각 의류에 대 한 의류 기본정보와 각 의류가 속한 의류 카테고리 정보와 각 의류에 대한 의류 카테고리 기준 스타일 항목 별 스타일 특징정보를 서버로 제공한다. 상기 서버는 상기 사용자 단말로부터 수신된 각 의류의 의류 기본정보와 의류 카테고리 정보 및 각 스타일 항목 별 스타일 특징정보를 포함하는 사용자 의류 정보를 구성하고, 상기 구성된 사용자 의류 정보 를 옷장DB에 저장한다. 도면4는 본 발명의 다른 실시 방법에 따라 사용자 의류 정보를 저장하는 과정을 도시한 도면이다. 보다 상세하게 본 도면4는 상기 도면2의 과정 이후, 사용자가 소장하고 있는 T(T≥3)개의 각 의류에 대한 의류 기본정보와 각 의류가 속한 의류 카테고리 정보 및 각 의류에 대한 의류 카테고리 기준 각 스타일 항목 별 스타 일 특징정보를 포함하는 사용자 의류 정보를 옷장DB에 저장하는 과정을 도시한 것으로서, 본 발명이 속한"}
{"patent_id": "10-2019-0012917", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "기술분야에서 통상의 지식을 가진 자라면, 본 도면4를 참조 및/또는 변형하여 상기 과정에 대한 다양한 실시 방 법(예컨대, 일부 단계가 생략되거나, 또는 순서가 변경된 실시 방법)을 유추할 수 있을 것이나, 본 발명은 상기 유추되는 모든 실시 방법을 포함하여 이루어지며, 본 도면4에 도시된 실시 방법만으로 그 기술적 특징이 한정되 지 아니한다. 도면4를 참조하면, 상기 도면2의 과정 이후, 사용자 단말로부터 사용자가 소장하고 있는 T개의 각 의류에 대한 의류 기본정보와 각 의류의 의류사진 이미지를 서버로 제공한다. 상기 서버는 상기 수신된 각 의류의 의류사진 이미지를 이미지 분석하여 지정된 C개의 의류 카테고리 중 각 의류가 속한 의류 카테고리를 인식하고, 상기 관리DB에 저장된 각 의류 카테고리 별 s개의 스타일 항목 정보와 각 스타일 항목 별 스타일 특징정보를 근거로 각 의류에 대한 스타일 항목 별 스타일 특징정보를 인식한다. 그리고, 상기 서버는 상기 수신된 각 의류의 의류 기본정보와 상기 인식된 의류 카테고리 정보 및 각 스타 일 항목 별 스타일 특징정보를 포함하는 사용자 의류 정보를 구성하고, 상기 구성된 사용자 의류 정보를 옷장DB에 저장한다. 도면5는 본 발명의 실시 방법에 따라 사용자에게 스타일 코디정보를 제공하는 과정을 도시한 도면이다. 보다 상세하게 본 도면5는 상기 도면3 또는 도면4의 과정 이후, 사용자의 대상자 특징정보에 따라 스타일 코디 가능한 사용자 의류 정보를 추출하여 전문가 단말로 제공하고, 상기 전문가 단말로부터 사용자에게 코디된 스타"}
{"patent_id": "10-2019-0012917", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "일 코디정보를 수신하여 사용자에게 제공하는 과정을 도시한 것으로서, 본 발명이 속한 기술분야에서 통상의 지 식을 가진 자라면, 본 도면5를 참조 및/또는 변형하여 상기 과정에 대한 다양한 실시 방법(예컨대, 일부 단계가 생략되거나, 또는 순서가 변경된 실시 방법)을 유추할 수 있을 것이나, 본 발명은 상기 유추되는 모든 실시 방 법을 포함하여 이루어지며, 본 도면5에 도시된 실시 방법만으로 그 기술적 특징이 한정되지 아니한다. 도면5를 참조하면, 상기 도면3 또는 도면4의 과정 이후, 사용자 단말에서 사용자의 스타일 코디를 요청하 는 코디요청 정보를 상기 서버로 제공하면, 상기 서버는 상기 회원DB로부터 스타일 코디할 특정 사용자의 대상자 특징정보를 추출하고, 상기 옷장DB로부터 스타일 코디 가능한 N개의 사용자 의 류 정보를 추출한다.그리고, 상기 서버는 지정된 스타일 코디 전문가 단말로 상기 추출된 대상자 특징정보와 상기 N개의 사용자 의류 정보를 제공한다. 상기 스타일 코디 전문가 단말은 상기 대상자 특징정보와 상기 N개의 사용자 의류 정보를 근거로 상기 사 용자에게 코디된 n개의 의류 조합을 포함하는 스타일 코디정보를 생성하고, 상기 생성된 스타일 코디정보 를 상기 서버로 제공한다. 상기 서버는 사용자 식별정보를 이용하여 사용자 단말로 상기 사용자에게 코디된 n개의 의류 조합을 포함하는 스타일 코디정보를 제공한다. 이후, 상기 사용자 단말에서 상기 스타일 코디정보에 대한 사용자의 코디 승인정보를 상기 서버로 제 공하거나, 상기 스타일 코디정보에 대한 사용자의 코디 거부정보를 상기 서버로 제공한다. 상기 사용자의 코디 거부정보가 제공된 경우, 상기 서버는 상기 거부된 스타일 코디정보에 포함된 n개의 의류 조합 이외에 다른 의류 조합을 사용자에게 코디하기 위한 절차를 수행하도록 처리한다. 도면6은 본 발명의 다른 실시 방법에 따라 사용자에게 스타일 코디정보를 제공하는 과정을 도시한 도면이다. 보다 상세하게 본 도면6은 상기 도면3 또는 도면4의 과정 이후, 사용자의 대상자 특징정보에 따라 스타일 코디 가능한 사용자 의류 정보를 추출하여 지정된 인공지능알고리즘을 통해 사용자의 스타일 코디정보를 확인하고,"}
{"patent_id": "10-2019-0012917", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "상기 확인된 스타일 코디정보를 사용자에게 제공하는 과정을 도시한 것으로서, 본 발명이 속한 기술분야에서 통 상의 지식을 가진 자라면, 본 도면6을 참조 및/또는 변형하여 상기 과정에 대한 다양한 실시 방법(예컨대, 일부 단계가 생략되거나, 또는 순서가 변경된 실시 방법)을 유추할 수 있을 것이나, 본 발명은 상기 유추되는 모든 실시 방법을 포함하여 이루어지며, 본 도면6에 도시된 실시 방법만으로 그 기술적 특징이 한정되지 아니한다. 도면6을 참조하면, 상기 도면3 또는 도면4의 과정 이후, 상기 사용자 단말에서 사용자의 스타일 코디를 요 청하는 코디요청 정보를 상기 서버로 제공하면, 상기 서버는 상기 회원DB로부터 스타일 코 디할 특정 사용자의 대상자 특징정보를 추출하고, 상기 옷장DB로부터 스타일 코디 가능한 N개의 사용 자 의류 정보를 추출한다. 그리고, 상기 서버는 상기 추출된 대상자 특징정보와 상기 N개의 사용자 의류 정보를 이용하여 스타일 코 디를 위해 지정된 인공지능알고리즘에 적용할 입력정보를 구성하고, 상기 인공지능알고리즘에 상기 구성된 입력정보를 적용하여 상기 인공지능알고리즘을 통해 상기 사용자에게 코디된 n개의 의류 조합을 포함하는 스타 일 코디정보를 확인하며, 상기 서버는 사용자 식별정보를 이용하여 사용자 단말로 상기 사용자 에게 코디된 n개의 의류 조합을 포함하는 스타일 코디정보를 제공한다. 이후, 상기 사용자 단말에서 상기 스타일 코디정보에 대한 사용자의 코디 승인정보를 상기 서버로 제 공하거나, 상기 스타일 코디정보에 대한 사용자의 코디 거부정보를 상기 서버로 제공한다. 상기 사용자의 코디 거부정보가 제공된 경우, 상기 서버는 상기 거부된 스타일 코디정보에 포함된 n개의 의류 조합 이외에 다른 의류 조합을 사용자에게 코디하기 위한 절차를 수행하도록 처리한다.도면7은 본 발명의 또 다른 실시 방법에 따라 사용자에게 스타일 코디정보를 제공하는 과정을 도시한 도면이다. 보다 상세하게 본 도면7은 상기 도면3 또는 도면4의 과정 이후, 사용자의 대상자 특징정보에 따라 스타일 코디 가능한 사용자 의류 정보를 추출하고 지정된 인공지능알고리즘을 통해 확인된 스타일 코디정보와 상기 추출된 사용자 의류 정보 및 대상자 특징정보를 전문가 단말로 제공하고, 상기 전문가 단말로부터 사용자에"}
{"patent_id": "10-2019-0012917", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "게 코디된 스타일 코디정보를 수신하여 사용자에게 제공하는 과정을 도시한 것으로서, 본 발명이 속한 기술분야 에서 통상의 지식을 가진 자라면, 본 도면7을 참조 및/또는 변형하여 상기 과정에 대한 다양한 실시 방법(예컨 대, 일부 단계가 생략되거나, 또는 순서가 변경된 실시 방법)을 유추할 수 있을 것이나, 본 발명은 상기 유추되 는 모든 실시 방법을 포함하여 이루어지며, 본 도면7에 도시된 실시 방법만으로 그 기술적 특징이 한정되지 아 니한다. 도면7을 참조하면, 상기 도면3 또는 도면4의 과정 이후, 사용자 단말에서 사용자의 스타일 코디를 요청하 는 코디요청 정보를 상기 서버로 제공하면, 상기 서버는 상기 회원DB로부터 스타일 코디할 특정 사용자의 대상자 특징정보를 추출하고, 상기 옷장DB로부터 스타일 코디 가능한 N개의 사용자 의 류 정보를 추출한다. 그리고, 상기 서버는 상기 추출된 대상자 특징정보와 상기 N개의 사용자 의류 정보를 이용하여 스타일 코 디를 위해 지정된 인공지능알고리즘에 적용할 입력정보를 구성하고, 상기 인공지능알고리즘에 상기 구성된 입력정보를 적용하여 상기 인공지능알고리즘을 통해 상기 사용자에게 코디된 n개의 의류 조합을 포함하는 스타 일 코디정보를 확인한다. 그리고, 상기 서버는 상기 확인된 스타일 코디정보와 상기 추출된 대상자 특징정보와 상기 N개의 사용자 의류 정보를 지정된 스타일 코디 전문가 단말로 제공한다. 상기 스타일 코디 전문가 단말은 상기 대상자 특징정보와 상기 N개의 사용자 의류 정보와 상기 스타일 코 디정보를 근거로 상기 사용자에게 코디된 n개의 의류 조합을 포함하는 스타일 코디정보를 생성하고, 상기 생성된 스타일 코디정보를 상기 서버로 제공한다. 상기 서버는 사용자 식별정보를 이용하여 사용자 단말로 상기 사용자에게 코디된 n개의 의류 조합을 포함하는 스타일 코디정보를 제공한다. 이후, 상기 사용자 단말에서 상기 스타일 코디정보에 대한 사용자의 코디 승인정보를 상기 서버로 제 공하거나, 상기 스타일 코디정보에 대한 사용자의 코디 거부정보를 상기 서버로 제공한다. 상기 사용자의 코디 거부정보가 제공된 경우, 상기 서버는 상기 거부된 스타일 코디정보에 포함된 n개의 의류 조합 이외에 다른 의류 조합을 사용자에게 코디하기 위한 절차를 수행하도록 처리한다. 도면8은 본 발명의 실시 방법에 따라 사용자 식별정보와 코디 스타일 정보를 저장하는 과정을 도시한 도면이다. 보다 상세하게 본 도면8은 상기 도면5 또는 도면6 또는 도면7의 과정 이후, 사용자의 코디 스타일 정보를 구성"}
{"patent_id": "10-2019-0012917", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "하여 사용자 식별정보와 연계해 저장하고, 사용자의 코디 만족도에 따라 스타일 코디 학습정보를 구성하여 지정된 인공지능알고리즘에 적용해 학습시키는 과정을 도시한 것으로서, 본 발명이 속한 기술분야에서 통상의 지식 을 가진 자라면, 본 도면8을 참조 및/또는 변형하여 상기 과정에 대한 다양한 실시 방법(예컨대, 일부 단계가 생략되거나, 또는 순서가 변경된 실시 방법)을 유추할 수 있을 것이나, 본 발명은 상기 유추되는 모든 실시 방 법을 포함하여 이루어지며, 본 도면8에 도시된 실시 방법만으로 그 기술적 특징이 한정되지 아니한다. 도면8을 참조하면, 상기 도면5 또는 도면6 또는 도면7의 과정 이후, 서버에서 코디된 n개의 의류가 속한 n 개의 의류 카테고리를 확인하고, 관리DB에 저장된 각 의류 카테고리 별 s개의 스타일 항목 정보와 각 스타일 항목 별 스타일 특징정보를 근거로 상기 n개의 의류에 대한 각 스타일 항목 별 스타일 특징정보를 확인 한다. 그리고, 상기 서버는 상기 확인된 각 스타일 항목 별 스타일 특징정보를 테이블화한 코디 스타일 정보를 구성하여 사용자 식별정보와 연계해 코디DB에 저장한다. 이후, 상기 서버는 사용자 식별정보를 근거로 상기 코디DB에 저장된 코디 스타일 정보에 대한 사용자의 코 디 만족도 정보를 확인한다. 본 발명의 실시 방법에 따르면, 상기 서버는 상기 사용자의 코디 승인정보를 수신한 경우 상기 수신된 코 디 승인정보를 근거로 상기 사용자에게 코디된 n개의 의류 조합에 대한 사용자의 코디 만족도 정보를 산출할 수 있다. 본 발명의 다른 실시 방법에 따르면, 상기 서버는 사용자 식별정보를 이용하여 사용자 단말로 상기 사용자에게 코디된 n개의 의류 조합에 대한 사용자의 코디 만족도 정보를 요청하고, 상기 사용자 단말로부 터 상기 코디 만족도 정보를 수신할 수 있다. 상기 사용자의 코디 만족도 정보가 확인되면, 상기 서버는 상기 확인된 사용자의 코디 만족도 정보를 근거 로 지정된 기준 만족도 이상의 코디 스타일 정보와 대상자 특징정보를 확인하고, 상기 확인된 코디 스타일 정보와 대상자 특징정보를 근거로 지정된 인공지능알고리즘에 적용할 스타일 코디 학습정보를 구성한 후, 상기 지정된 인공지능알고리즘에 상기 스타일 코디 학습정보를 적용하여 학습시킨다."}
{"patent_id": "10-2019-0012917", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시도면2는 본 발명의 실시 방법에 따라 스타일 항목 별 스타일 특징정보를 저장하는 과정을 도시한 도면이다. 도 2는 본 발명의 실시 방법에 따라 스타일 항목 별 스타일 특징정보를 저장하는 과정을 도시한 도면이다.도 3은 본 발명의 실시 방법에 따라 사용자 의류 정보를 저장하는 과정을 도시한 도면이다. 도 4는 본 발명의 다른 실시 방법에 따라 사용자 의류 정보를 저장하는 과정을 도시한 도면이다. 도 5는 본 발명의 실시 방법에 따라 사용자에게 스타일 코디정보를 제공하는 과정을 도시한 도면이다. 도 6은 본 발명의 다른 실시 방법에 따라 사용자에게 스타일 코디정보를 제공하는 과정을 도시한 도면이다. 도 7은 본 발명의 또 다른 실시 방법에 따라 사용자에게 스타일 코디정보를 제공하는 과정을 도시한 도면이다. 도 8은 본 발명의 실시 방법에 따라 사용자 식별정보와 코디 스타일 정보를 저장하는 과정을 도시한 도면이다."}
