{"patent_id": "10-2020-0130482", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0047044", "출원번호": "10-2020-0130482", "발명의 명칭": "CT 영상의 커널 변환 방법 및 그 장치", "출원인": "메디컬아이피 주식회사", "발명자": "이혁희"}}
{"patent_id": "10-2020-0130482", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "커널 종류별 CT 영상 데이터로 구성된 학습데이터를 이용하여 CT 영상의 커널 변환을 수행하는 인공지능모델을학습시키는 단계; 및제1 커널의 제1 CT 영상 데이터를 상기 인공지능모델에 입력하여 제2 커널의 제2 CT 영상 데이터를 획득하는 단계;를 포함하는 것을 특징으로 하는 CT 영상의 커널 변환 방법."}
{"patent_id": "10-2020-0130482", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서, 상기 학습데이터는 디바이스 종류 및 커널 종류별 CT 영상을 포함하는 것을 특징으로 하는 CT 영상의 커널 변환방법."}
{"patent_id": "10-2020-0130482", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항에 있어서, 상기 학습시키는 단계는,N(N은 2 이상의 자연수)개의 서로 다른 커널의 CT 영상을 기 정의된 커널의 CT 영상으로 변환하는 인공지능모델을 학습시키는 단계;를 포함하는 것을 특징으로 하는 CT 영상의 커널 변환 방법."}
{"patent_id": "10-2020-0130482", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1항에 있어서, 상기 학습시키는 단계는,N(N은 2 이상의 자연수)개의 서로 다른 커널의 CT 영상을 기 정의된 커널의 CT 영상으로 변환하는 N개의 인공지능모델을 각각 학습시키는 단계;를 포함하는 것을 특징으로 하는 CT 영상의 커널 변환 방법."}
{"patent_id": "10-2020-0130482", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1항에 있어서, 상기 제2 커널의 CT 영상 데이터를 획득하는 단계는,상기 제1 CT 영상 데이터를 입력받는 단계;상기 제1 CT 영상 데이터의 메타데이터를 기초로 상기 제1 CT 영상 데이터의 제1 커널의 종류를 파악하는 단계;사용자로부터 제2 커널의 종류를 선택받는 단계;복수 개의 인공지능모델 중에서 상기 제1 커널과 상기 제2 커널 사이의 변환을 수행하는 인공지능모델을 선택하는 단계; 및상기 선택된 인공지능모델에 상기 제1 커널의 CT 영상 데이터를 입력하는 단계;를 포함하는 것을 특징으로 하는CT 영상의 커널 변환 방법."}
{"patent_id": "10-2020-0130482", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5항에 있어서,상기 메타데이터를 기초로 상기 제1 CT 영상 데이터의 제1 디바이스 종류를 파악하는 단계; 및사용자로로부터 제2 디바이스의 종류를 선택받는 단계;를 더 포함하고,상기 인공지능모델을 선택하는 단계는, 상기 제1 디바이스의 제1 커널과 상기 제2 디바이스의 제2 커널 사이의변환을 수행하는 인공지능모델을 선택하는 단계를 포함하는 것을 특징으로 하는 CT 영상의 커널 변환 방법."}
{"patent_id": "10-2020-0130482", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2022-0047044-3-제 1항에 있어서,상기 제2 커널의 제2 CT 영상 데이터를 DICOM(Digital Imaging and Communication in Medicine) 파일로 저장하는 단계;를 더 포함하는 것을 특징으로 하는 CT 영상의 커널 변환 방법."}
{"patent_id": "10-2020-0130482", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "N(N은 1 이상의 자연수)개의 서로 다른 커널의 CT 영상을 M(M은 1 이상의 자연수)개의 서로 다른 커널의 CT 영상으로 변환하는 적어도 하나 이상의 인공지능모델; 및상기 인공지능모델을 이용하여 제1 커널의 제1 CT 영상 데이터를 제2 커널의 제2 CT 영상 데이터로 변환하는 영상변환부;를 포함하는 것을 특징으로 하는 CT 커널 변환 장치."}
{"patent_id": "10-2020-0130482", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8항에 있어서,커널 종류별 CT 영상 데이터로 구성된 학습데이터를 이용하여 상기 적어도 하나 이상의 인공지능모델을 학습시키는 학습부;를 더 포함하는 것을 특징으로 하는 CT 커널 변환 장치."}
{"patent_id": "10-2020-0130482", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 8항에 있어서, 상기 영상변환부는,사용자로부터 상기 제2 커널의 종류를 선택받고 상기 제2 커널의 제2 CT 영상 데이터를 표시하는 사용자 인터페이스;상기 제1 CT 영상 데이터의 메타데이터를 기초로 상기 제1 커널의 종류를 파악하는 영상파악부;복수 개의 인공지능모델 중에서 상기 제1 커널과 상기 제2 커널 사이의 변환을 수행하는 인공지능모델을 선택하는 모델선택부; 및상기 선택된 인공지능모델을 이용하여 제2 커널의 제2 CT 영상 데이터를 획득하는 커널변환부;를 포함하는 것을특징으로 하는 CT 커널 변환 장치."}
{"patent_id": "10-2020-0130482", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 1항 내지 제 7항 중 어느 한 항에 기재된 방법을 수행하기 위한 컴퓨터 프로그램을 기록한 컴퓨터로 읽을 수있는 기록매체."}
{"patent_id": "10-2020-0130482", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "CT 영상의 커널 변환 방법 및 그 장치가 개시된다. CT 커널 변환 장치는 커널 종류별 CT 영상 데이터로 구성된 학습데이터를 이용하여 CT 영상의 커널 변환을 수행하는 인공지능모델을 학습시킨 후, 제1 커널의 제1 CT 영상 데이터를 학습 완료된 인공지능모델에 입력하여 제2 커널의 제2 CT 영상 데이터를 획득한다."}
{"patent_id": "10-2020-0130482", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 실시 예는 CT 영상의 재구성방법에 관한 것으로, 보다 상세하게는 CT 영상의 커널을 변환하는 방법 및 그 장치에 관한 것이다."}
{"patent_id": "10-2020-0130482", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "컴퓨터단층촬영(Computerized Tomography, CT)은 X선 등을 인체에 투영하고 얻은 결과를 컴퓨터로 재구성하여 인체 내부 단면의 모습을 화상으로 처리하는 기기이다. CT 기기에서 촬영된 원 데이터(raw data)에 다양한 종류 의 커널을 적용하여 CT 영상을 재구성할 수 있다. CT 영상은 커널(kernel)의 종류와 영상 재구성 방법에 따라 다양하게 나타난다. 촬영하는 인체 조직이나 부위에 따라 적절한 커널이 사용될 수 있다. 예를 들어, B10(very smooth), B20(smooth), B30(medium smooth), B40(medium), B50(medium sharp), B60(sharp), B70(very sahrp), B80(ultra sharp) 등의 컨롤루션 커널이 적용될 수 있다. 이 외에도 CT 기기마다 서로 다른 다양한 종류의 필터 가 사용될 수 있다. 커널을 이용하여 CT 영상을 재구성하기 위해서는 CT 기기에서 촬영된 원 데이터(raw data)가 필요하다. 원 데이 터는 수 기가바이트(Giga byte) 이상의 크기를 가지므로, 이를 저장 관리하는데 많은 저장공간이 필요하다. 또 한 고객이 병원으로부터 제공받는 CT 영상은 CT 기기의 원 데이터가 아니라 특정 커널을 이용하여 재구성된 CT영상이다. 따라서 고객이 제공받은 CT 영상을 CT 기기에서 다른 커널로 재구성하는 것은 불가능하다. 또한, CT 기기마다 사용하는 커널의 종류는 서로 상이할 수 있다. 예를 들어, 제1 CT 기기는 폐 영역의 CT 영상 재구성에 A 커널을 사용하고, 제2 CT 기기는 동일 폐 영역의 CT 영상 재구성에 B 커널을 사용할 수 있다. 병원 마다 사용하는 CT 기기의 종류 및 커널의 종류가 서로 다를 수 있고, 동일 병원 내에서도 서로 다른 종류의 CT 기기 및 커널이 사용될 수 있으므로, 어떤 CT 기기를 이용하여 촬영하였는지에 따라 CT 영상이 서로 달라지는 문제점이 존재한다. 또한 CT 기기마다 방사선량이 서로 다를 수 있으며 이 경우 각 CT 기기에서 출력되는 CT 영 상의 화질도 서로 상이할 수 있다."}
{"patent_id": "10-2020-0130482", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 실시 예가 이루고자 하는 기술적 과제는, CT 기기의 원 데이터(raw data)가 아닌 DICOM(Digital Imaging and Communication in Medicine) 등의 CT 영상 데이터를 이용하여 커널 변환을 수행하는 방법 및 그 장치를 제공하는 데 있다."}
{"patent_id": "10-2020-0130482", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기의 기술적 과제를 달성하기 위한, 본 발명의 실시 예에 따른 CT 영상의 커널 변환 방법의 일 예는, 커널 종 류별 CT 영상 데이터로 구성된 학습데이터를 이용하여 CT 영상의 커널 변환을 수행하는 인공지능모델을 학습시 키는 단계; 및 제1 커널의 제1 CT 영상 데이터를 상기 인공지능모델에 입력하여 제2 커널의 제2 CT 영상 데이터 를 획득하는 단계;를 포함한다. 상기의 기술적 과제를 달성하기 위한, 본 발명의 실시 예에 따른 CT 커널 변환 장치의 일 예는, N(N은 1 이상의 자연수)개의 서로 다른 커널의 CT 영상을 M(M은 1 이상의 자연수)개의 서로 다른 커널의 CT 영상으로 변환하는 적어도 하나 이상의 인공지능모델; 및 상기 인공지능모델을 이용하여 제1 커널의 제1 CT 영상 데이터를 제2 커 널의 제2 CT 영상 데이터로 변환하는 영상변환부;를 포함한다."}
{"patent_id": "10-2020-0130482", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시 예에 따르면, 다양한 종류의 CT 기기와 다양한 종류의 커널로 촬영된 CT 영상을 원하는 커널의 CT 영상(예를 들어, 표준화된 CT 영상)으로 변환할 수 있다. 다른 실시 예로, 수~수백 메가바이트(Mega byte) 정도의 DICOM 파일로 저장된 CT 영상의 커널을 변환할 수 있으므로 수 기가바이트(Giga byte) 이상의 CT 기기의 원 데이터를 저장 관리할 필요가 없어 저장 공간을 절감할 수 있다. 또한 CT 영상을 커널간 다양하게 변형 가능 하므로 하나의 CT 영상만을 저장하면 되므로, 각 커널별 CT 영상을 저장하지 않을 수 있다. 또 다른 실시 예로, 서로 다른 CT 기기나 커널로 촬영된 CT 영상을 표준화된 영상으로 변환하여 병변 진단(예를 들어, 병변진단용 인공지능모델에 입력)에 사용할 수 있어 병변진단의 정확도를 향상시킬 수 있다."}
{"patent_id": "10-2020-0130482", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서, 첨부된 도면들을 참조하여 본 발명의 실시 예에 따른 CT 영상의 커널 변환 방법 및 그 장치에 대해 상세히 설명한다. 도 1은 본 발명의 실시 예에 따른 CT 영상의 일 예를 도시한 도면이다. 도 1을 참조하면, CT 기기의 방사선량 또는 커널에 따라 CT 영상(100,110,120,130)은 서로 다르게 나타날 수 있 다. 도 1의 위쪽 두 개의 CT 영상(100,110)은 서로 다른 커널을 적용하여 CT 영상을 재구성한 경우이다. 오른쪽 CT 영상에 적용된 커널이 왼쪽 CT 영상에 적용된 커널 보다 좀 더 샤프(sharp)한 커널이다. 도 1의 아래쪽 두 개의 CT 영상(120,130)은 서로 다른 방사선량으로 촬영한 CT 영상이다. 오른쪽 CT 영상의 촬영 방사선량이 왼쪽 CT 영상의 촬영 방사선량 보다 많은 경우이다. 본 실시 예는 이해를 돕기 위한 하나의 예이며 단순히 커널이 샤프하거나 방선선량이 많다고 좋은 CT 영상을 얻 는 것은 아니다. 촬영하는 조직의 종류 또는 인체 부위에 따라 이를 잘 표현할 수 있는 적합한 커널 또는 방사 선량 등이 다를 수 있다. 또한, 의료진이 특정 디바이스의 특정 커널로 촬영된 CT 영상을 오랜 기간 동안 봐 왔 다면, 해당 의료진은 자신에게 익숙한 형태의 CT 영상을 통해 보다 정확한 의학적 판단을 내릴 수 있다. 예를 들어, 고객이 타 병원에서 촬영한 CT 영상을 가지고 온 경우에 의료진은 해당 CT 영상이 익숙하지 않을 수 있다. 주요 제조사의 CT 기기에 적용되는 다양한 종류의 커널의 예가 [표 1]에 나열되어 있다. [표 1]을 참조하면, 각 제조사의 CT 기기, 즉 디바이스별 적용되는 커널의 종류가 다양함을 알 수 있다. [표 1]에는 나타나지 않았지만 각 디바이스별 방사선량이 서로 다를 수 있으며 따라서 동일 커널을 사용하는 경우에도 디바이스별 CT 영상은 서로 다를 수 있다. 표 1 제조사 디바이스 종류 커널종류 캐논(도시바) Aquillion FBP AIDR 필립스 Brillance FBP_soft FBP_sharp GE Discovery FBP IR_sharp ASIR 필립스 iCT FBP IR_sharp IR_soft 필립스 Ingenuity FBP_soft iDOse_soft IR_sharp 필립스 iQon IMR_soft iDOse_soft iDose_sharp 지멘스 Definiton FBP_soft FBP_sharp iDose_sharp 지멘스 Force FBP IR_Br_40 IR_Br_59 도 2는 본 발명의 실시 예에 따른 커널 변환의 개념을 도시한 도면이다. 도 2를 참조하면, CT 영상의 커널 변환에 인공지능모델이 사용된다. 인공지능모델은 CNN(Convolutional Neural Network), DenseNet, U-net, GoogLeNet, Generative adversarial network 등 다양 한 아키텍처로 구현될 수 있다. 예를 들어, 인공지능모델이 CNN으로 구현되는 경우에, 인공지능모델은 학 습데이터를 이용하여 인공 신경망의 연결 가중치를 조정하는 학습 과정을 수행한다. 인공지능모델은 제1 커널의 CT 영상을 입력받으면 제2 커널의 CT 영상을 출력하도록 학습될 수 있다. 이를 위해, 제1 커널의 CT 영상과 제2 커널의 CT 영상을 포함하는 학습 데이터가 사용될 수 있 다. 예를 들어, 인공지능모델은 제1 커널의 CT 영상을 입력받으면 예측 CT 영상을 생성하고, 예측 CT 영상과 학습 데이터에 포함된 제2 커널의 CT 영상을 비교하여 파라메타 등을 조정하는 학습 과정을 수행할 수 있다. 학습 데이터를 이용하여 인공지능모델을 학습시키는 종래의 다양한 방법이 본 실시 예에 적용될 수 있다. [표 1]에서 살핀 바와 같이 다양한 디바이스에 적용되는 다양한 종류의 커널이 존재하므로, 인공지능모델은 각 커널 사이의 변환을 위하여 각각 학습될 수 있다. 예를 들어, [표 1]의 커널 종류를 참조하면, 'FBP' -> 'AIDR', 'FBP'-'FBP_soft' 등과 같이 각 커널 사이의 변환을 위한 각각의 학습 데이터를 이용하여 인공지능모델 을 학습시킬 수 있다. 하나의 인공지능모델이 복수의 커널 변환에 대하여 모두 학습하는 것을 배제하는 것은 아니지만, 본 실시 예에 서는 복수의 인공지능모델이 각각의 커널 변환을 위해 학습하는 예를 설명한다.예를 들어, 3 종류의 CT 커널(a,b,c)이 존재한다고 가정하면, (커널a - 커널b), (커널a - 커널c), (커널b - 커 널c), (커널b - 커널a), (커널c - 커널a), (커널c - 커널b) 등의 커널 변환을 위한 맵핑관계가 존재할 수 있다. 이러한 각각의 커널 맵핑관계에 대하여 커널 변환을 수행하는 각각의 인공지능모델을 학습시킬 수 있다. 즉, 제 1 인공지능모델은 커널a의 영상을 커널b의 영상으로 변환하는 모델이고, 제2 인공지능모델이 커널a의 영상을 커 널c의 영상으로 변환하는 모델이고, 제3 인공지능모델은 커널b의 영상을 커널c의 영상으로 변환하는 모델일 수 있다. 다른 실시 예로, 커널의 종류 뿐만 아니라 디바이스 종류를 함께 고려하는 인공지능모델을 생성할 수 있다. 예를 들어, 도 1에서 살펴본 바와 같이 CT 영상은 커널의 종류 뿐만 아니라 방사선량 등과 같이 CT 기기 의 물리적 속성에 의해서도 영향을 받는다. 예를 들어, [표 1]에서 커널 'FBP'를 동일하게 사용하는 GE의 'Discovery'와 필립스의 'iCT'가 출력하는 CT 영상은 서로 다를 수 있다. 따라서 디바이스 종류 및 커널의 종류 별 학습 데이터를 생성하여 인공지능모델을 학습시킬 수 있다. 일 예로, 제1 디바이스의 제1 커널에 의해 생성된 제1 CT 영상과 제2 디바이스의 제1 커널에 의해 생성된 제2 CT 영상을 포함하는 학습 데이터를 이용하여 인공지능모델을 학습시킬 수 있다. 학습 완료된 인공지능모델은 제 1 디바이스의 제1 커널의 제1 CT 영상을 입력받으면, 제2 디바이스의 제1 커널로 촬영된 것과 같은 제2 CT 영상 을 생성하여 출력할 수 있다. 다른 예로, 제1 디바이스의 제1 커널에 의해 생성된 제1 CT 영상과 제2 디바이스의 제2 커널에 의해 생성된 제2 CT 영상을 포함하는 학습 데이터를 이용하여 인공지능모델을 학습시킬 수 있다. 학습 완료된 인공지능모델은 제 1 디바이스의 제1 커널의 제1 CT 영상을 입력받으면, 제2 디바이스의 제2 커널로 촬영된 것과 같은 제2 CT 영상 을 생성하여 출력할 수 있다. 도 3은 본 발명의 실시 예에 따른 커널 변환 방법을 이용하여 CT 영상을 재구성한 예를 도시한 도면이다. 도 3을 참조하면, CT 기기에서 커널 B30 및 커널 B60을 각각 적용하여 생성한 CT 영상(300,310)이 존재한다. CT 기기에서 커널 B30을 이용하여 생성한 CT 영상에 본 실시 예의 인공지능모델을 적용하여 커널 B60의 CT 영 상을 얻을 수 있다. 인공지능모델을 적용하여 얻은 커널 B60의 CT 영상과 CT 기기 자체에서 원 데이 터를 이용하여 커널 B60으로 재구성한 CT 영상을 비교하면 양자는 거의 일치함을 알 수 있다. CT 기기에서 커널 변환을 위해서는 CT 기기에서 촬영된 원 데이터(raw data)가 필요하며 그 원 데이터(즉, 커널 적용 전의 원본 데이터)는 수 기가바이트 이상의 크기를 가진다. 그러나 본 실시 예의 인공지능모델은 CT 기기 의 원 데이터가 아닌 커널을 적용하여 생성된 CT 영상을 이용하여 커널 변환을 수행한다. CT 영상은 일반적으로 DICOM 등의 형태일 수 있으며, DICOM CT 영상의 크기는 수~수백 메가바이트로서, CT 기기의 원 데이터에 비해 매우 작은 크기를 가진다. 본 실시 예에서 CT 영상은 DICOM 형태의 데이터로 한정되는 것은 아니며 3차원 영상 저장에 사용되는 종래의 다양한 데이터 형태가 본 실시 예에 적용될 수 있다. 다만 이하에서는 설명의 편의를 위하여 CT 영상은 DICOM 형태로 저장된 데이터라고 가정한다. 도 4는 본 발명의 실시 예에 따른 CT 영상의 커널 변환 방법의 일 예를 도시한 흐름도이다. 도 4를 참조하면, CT 커널 변환 장치(이하, '장치'라 함)는 커널 종류별 CT 영상 데이터로 구성된 학습데이터를 이용하여 CT 영상의 커널 변환을 수행하는 인공지능모델을 학습시킨다(S400). 예를 들어, 도 2에 도시된 바와 같이 제1 커널과 제2 커널 사이의 CT 영상 변환을 위한 인공지능모델을 학습시킬 수 있다. 다른 실시 예로 인공 지능모델은 커널 종류 뿐만 아니라 디바이스 종류를 함께 고려한 학습 데이터를 이용하여 학습될 수 있다. 인공지능모델의 학습이 완료되면, 장치는 제1 커널의 제1 CT 영상 데이터를 인공지능모델에 입력하여 제2 커널 의 제2 CT 영상 데이터를 얻을 수 있다(S410). 제1 CT 영상 데이터는 CT 기기의 원 데이터가 아니라 DICOM 등의 형태로 저장된 데이터이다. 장치는 커널 변환하여 생성한 제2 CT 영상 데이터를 DICOM 파일로 저장할 수 있다. 따라서 장치는 CT 기기의 원 데이터를 저장할 필요없이 DICOM 형태의 CT 영상 하나만을 저장하면 이를 이용하여 원하는 다양한 커널 종류의 CT 영상을 생성할 수 있다. 인공지능모델이 디바이스 종류를 함께 고려하여 학습되었다면, 장치는 제1 디바이스의 제1 커널의 제1 영상 데 이터를 인공지능모델에 입력하여 제2 디바이스의 제2 커널의 제2 영상 데이터를 생성할 수 있다. 이때, 제1 디 바이스 및 제2 디바이스는 동일 종류의 디바이스이고 제1 커널과 제2 커널은 서로 다른 종류의 커널이거나, 제1 디바이스 및 제2 디바이스는 서로 다른 종류의 디바이스이고 제1 커널과 제2 커널은 동일한 종류이거나 서로 다 른 종류의 커널일 수 있다.본 실시 예를 이용하면, 서로 다른 종류의 디바이스 및/또는 서로 다른 종류의 커널로 생성된 CT 영상을 모두 표준화된 CT 영상으로 변환할 수 있다. 예를 들어, 커널a로 촬영된 CT 영상과 커널b로 촬영된 CT 영상 등을 모 두 기 정의된 표준화된 CT 영상으로 변환할 수 있다. 표준화된 CT 영상은 기존 디바이스 및/또는 커널의 CT 영 상이거나 가상의 디바이스 및/또는 가상의 커널로 생성된 CT 영상일 수 있다. 예를 들어, 가상의 디바이스 및/ 또는 가상의 커널로 생성된 CT 영상과 기존의 다양한 디바이스 및/또는 커널로 생성된 CT 영상을 학습 데이터로 생성하여 인공지능모델을 학습시킬 수 있다. 표준화된 CT 영상은 병변 진단 등의 다양한 분야에 사용될 수 있다. 즉 본 실시 예의 커널 변환이 병변 진단용 인공지능모델의 전처리 과정에 사용될 수 있다. 예를 들어, CT 영상으로부터 폐 병변을 파악하는 병변진단 인공 지능모델이 존재한다고 할 때 CT 영상을 본 발명의 실시 예에 따른 표준화된 CT 영상으로 변환하여 병변진단 인 공지능모델에 입력할 수 있다. 병변진단 인공지능모델에 입력하는 CT 영상의 화질 등이 모두 동일하므로 병변진 단 인공지능모델의 성능이 향상될 수 있다. 도 5는 본 발명의 실시 예에 따른 CT 영상의 커널 변환의 상세 방법의 일 예를 도시한 흐름도이다. 도 5는 도 4 의 S410 단계의 상세 단계이다. 도 5를 참조하면, 장치는 제1 CT 영상 데이터를 입력받는다(S500). 여기서 제1 CT 영상 데이터는 DICOM 파일 형 태일 수 있다. 이 외에도 3차원 영상을 표시하는 다양한 종류의 데이터 형태가 본 실시 예에 사용될 수 있다. 장치는 제1 CT 영상 데이터에 포함된 메타데이터를 이용하여 제1 CT 영상의 생성에 사용한 제1 커널의 종류를 파악한다(S510). 인공지능모델이 디바이스 종류를 함께 고려하여 학습되었다면, 장치는 메타데이터로부터 디바 이스 종류를 함께 파악할 수 있다. 예를 들어, DICOM 파일의 경우 메타데이터에는 CT 기기의 종류(즉, 디바이스 종류), 커널의 종류 등의 정보가 포함되어 있으므로, 장치는 메타데이터를 기초로 디바이스 종류 및/또는 커널 종류를 파악할 수 있다. 장치는 사용자로부터 CT 영상을 변환할 제2 커널의 종류를 선택받는다(S520). 장치는 사용자로부터 제2 커널의 종류를 입력받기 위한 사용자 인터페이스를 제공할 수 있다. 사용자 인터페이스의 일 예가 도 6에 도시되어 있 다. 장치는 제1 CT 영상 데이터의 제1 커널과 사용자로부터 입력받은 제2 커널 사이의 변환을 수행하는 인공지능모 델을 선택한다(S530). 예를 들어, 도 2에서 설명한 바와 같이, 복수의 커널 사이의 다양한 변환 맵핑관계가 존 재하고 이에 따라 복수의 인공지능모델이 존재한다면, 장치는 이들 복수의 인공지능모델 중 제1 커널과 제2 커 널의 커널 변환을 수행하는 인공지능모델을 선택한다. 도 6 및 도 7은 본 발명의 실시 예에 따른 CT 영상의 커널 변환을 위한 사용자 인터페이스 화면의 일 예를 도시 한 도면이다. 도 6을 참조하면, 사용자 인터페이스는 입력받은 제1 CT 영상을 화면에 표시한다. 사용자가 디바이스 종류 선택 창 및 커널 종류 선택 창을 이용하여 디바이스 종류 및 커널 종류를 선택하면, 장치는 인공지능 모델을 이용하여 제1 CT 영상을 사용자가 선택한 커널로 변환한 제2 CT 영상을 생성하여 화면(도 7)에 표시한다. 도 7은 사용자가 선택한 커널로 변환된 제2 CT 영상을 사용자 인터페이스 화면에 표시한 예이다. 도 8은 본 발명의 실시 예에 따른 CT 커널 변환 장치의 일 예의 구성을 도시한 도면이다. 도 8을 참조하면, 장치는 적어도 하나 이상의 인공지능모델, 학습부 및 영상변환부를 포함한다. 장치는 일반 컴퓨터, 서버, 클라우드 시스템 등 종래의 다양한 종류의 컴퓨팅 장치로 구현될 수 있다. 예를 들 어, 장치는 프로세서, 메모리, 입출력장치 등을 포함하고, 본 발명의 실시 예에 따른 인공지능모델을 포함한 커 널 변환 방법이 구현된 소프트웨어는 메모리에 탑재되어 프로세서에 의해 수행될 수 있다. 인공지능모델은 다양한 종류의 커널 변환을 위하여 복수 개의 인공지능모델(802,804)을 포함할 수 있다. 예를 들어, N(N은 1 이상의 자연수)개의 서로 다른 커널의 CT 영상을 M(M은 1 이상의 자연수)개의 서로 다른 커 널의 CT 영상으로 변환하는 적어도 하나 이상의 인공지능모델(802,804)이 존재할 수 있다. 학습부는 인공지능모델을 학습시킨다. 커널의 다양한 변환을 위하여 복수의 인공지능모델(802,804)이 존재하면, 학습부는 각각의 인공지능모델(802,804)을 학습시킨다. 영상변환부는 학습이 완료된 인공지능모델을 이용하여 제1 커널의 CT 영상을 제2 커널의 CT 영상으로 변환한다. 영상변환부의 상세 구성의 예가 도 9에 도시되어 있다.도 9는 본 발명의 실시 예에 따른 CT 영상 커널 변환 장치의 영상변환부의 상세구성의 일 예를 도시한 도 면이다. 도 9을 참조하면, 영상변환부는 사용자 인터페이스, 영상파악부, 모델선택부 및 커널변환 부를 포함한다. 사용자 인터페이스는 사용자로부터 디바이스 종류 및 커널의 종류를 입력받고 CT 영 상을 표시하는 영역 등을 포함한다. 사용자 인터페이스의 일 예가 도 7에 도시되어 있다. 영상파악부는 장치에 입력된 제1 CT 영상 데이터의 메타데이터를 분석하여 제1 CT 영상을 촬영한 CT 기기 (즉, 디바이스)의 종류 및 제1 CT 영상을 구성하는데 사용된 제1 커널의 종류 등을 파악한다. 모델선택부는 제1 CT 영상 데이터의 제1 커널을 사용자 인터페이스를 통해 입력받은 제2 커널로 변환하기 위한 인공지능모델을 선택한다. 커널변환부는 선택된 인공지능모델을 이용하여 제1 CT 영상 데이터의 제1 커널을 제2 커널로 변환한 제2 CT 영상 데이터를 생성한다. 본 발명은 또한 컴퓨터로 읽을 수 있는 기록매체에 컴퓨터가 읽을 수 있는 코드로서 구현하는 것이 가능하다. 컴퓨터가 읽을 수 있는 기록매체는 컴퓨터 시스템에 의하여 읽혀질 수 있는 데이터가 저장되는 모든 종류의 기 록장치를 포함한다. 컴퓨터가 읽을 수 있는 기록매체의 예로는 ROM, RAM, CD-ROM, 자기 테이프, 플로피디스크, 광데이터 저장장치 등이 있다. 또한 컴퓨터가 읽을 수 있는 기록매체는 네트워크로 연결된 컴퓨터 시스템에 분 산되어 분산방식으로 컴퓨터가 읽을 수 있는 코드가 저장되고 실행될 수 있다. 이제까지 본 발명에 대하여 그 바람직한 실시예들을 중심으로 살펴보았다. 본 발명이 속하는 기술 분야에서 통 상의 지식을 가진 자는 본 발명이 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 변형된 형태로 구현될 수 있음을 이해할 수 있을 것이다. 그러므로 개시된 실시예들은 한정적인 관점이 아니라 설명적인 관점에서 고 려되어야 한다. 본 발명의 범위는 전술한 설명이 아니라 특허청구범위에 나타나 있으며, 그와 동등한 범위 내에 있는 모든 차이점은 본 발명에 포함된 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2020-0130482", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시 예에 따른 CT 영상의 일 예를 도시한 도면, 도 2는 본 발명의 실시 예에 따른 커널 변환의 개념을 도시한 도면, 도 3은 본 발명의 실시 예에 따른 커널 변환 방법을 이용하여 CT 영상을 재구성한 예를 도시한 도면, 도 4는 본 발명의 실시 예에 따른 CT 영상의 커널 변환 방법의 일 예를 도시한 흐름도, 도 5는 본 발명의 실시 예에 따른 CT 영상의 커널 변환의 상세 방법의 일 예를 도시한 흐름도, 도 6 및 도 7은 본 발명의 실시 예에 따른 CT 영상의 커널 변환을 위한 사용자 인터페이스 화면의 일 예를 도시 한 도면, 도 8은 본 발명의 실시 예에 따른 CT 영상 커널 변환 장치의 일 예의 구성을 도시한 도면, 그리고, 도 9는 본 발명의 실시 예에 따른 CT 영상 커널 변환 장치의 영상변환부의 상세구성의 일 예를 도시한 도면이다."}
