{"patent_id": "10-2022-0180132", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0098407", "출원번호": "10-2022-0180132", "발명의 명칭": "재보정을 이용한 혈압 측정 장치", "출원인": "광운대학교 산학협력단", "발명자": "박철수"}}
{"patent_id": "10-2022-0180132", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "혈압을 측정하기 위한 웨어러블 디바이스에 있어서,사용자의 심전도(Electrocardiogram, ECG) 신호를 센싱하여 ECG 데이터를 출력하는 ECG 센서부;상기 사용자의 맥파 (Photoplethysmogram, PPG) 신호를 센싱하여 PPG 데이터를 출력하는 PPG 센서부; 및상기 ECG 데이터 및 상기 PPG 데이터에 대해 전처리를 수행한 후 사전에 학습된 소정의 딥러닝 모델에 적용하여상기 사용자의 혈압을 추정하되,상기 소정의 딥러닝 모델은 CNN(Convolutional Neural Network) 모델, Bi-GRU(Bidirectional Gated RecurrentUnit) 모델 및 Attention 모델을 바인딩하여 학습된 모델이고,상기 프로세서는,상기 전처리된 ECG 및 PPG 데이터를 CNN 모델에 입력하여 CNN 가중치 파라미터를 출력하고,상기 출력된 CNN 가중치 파라미터를 Bi-GRU 모델의 입력데이터로 적용하여 Bi-GRU 가중치 파라미터를 출력하고,상기 Bi-GRU 가중치 파라미터를 어텐션(Attention) 모델에 입력 데이터로 적용한 후 혈압값을 추정하는 것을 특징으로 하는, 혈압 측정을 위한 웨어러블 디바이스."}
{"patent_id": "10-2022-0180132", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 프로세서는 상기 소정의 딥러닝 모델에서 추정된 혈압값과 기준값과의 평균절대오차 크기가 소정값 이상인경우에는 상기 추정된 혈압값을 재측정(recalibration)을 통해 재학습하는, 혈압 측정을 위한 웨어러블 디바이스."}
{"patent_id": "10-2022-0180132", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 프로세서는 상기 ECG 데이터를 0.5 내지 35 헤르츠(Hz)의 대역통과 필터에 적용하여 전처리를 수행하는,혈압 측정을 위한 웨어러블 디바이스."}
{"patent_id": "10-2022-0180132", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 프로세서는 상기 PPG 데이터를 0.5 내지 15 헤르츠(Hz)의 대역통과 필터에 적용하여 전처리를 수행하는,혈압 측정을 위한 웨어러블 디바이스."}
{"patent_id": "10-2022-0180132", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2항에 있어서,상기 소정값은 5인 것을 특징으로 하는, 혈압 측정을 위한 웨어러블 디바이스."}
{"patent_id": "10-2022-0180132", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 프로세서는 상기 전처리된 ECG 및 PPG 데이터를 5초 단위로 나누어서 상기 CNN 모델에 입력하는, 혈압 측정을 위한 웨어러블 디바이스.공개특허 10-2024-0098407-3-청구항 7 제1항에 있어서,상기 웨어러블 디바이스는 스마트 워치(smart watch)를 포함하는, 혈압 측정을 위한 웨어러블 디바이스."}
{"patent_id": "10-2022-0180132", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제2항에 있어서,상기 기준값은 커프(Cuff) 기반으로 측정한 혈압값인, 혈압 측정을 위한 웨어러블 디바이스."}
{"patent_id": "10-2022-0180132", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "웨어러블 디바이스가 혈압을 측정하기 위한 방법에 있어서,사용자의 심전도(Electrocardiogram, ECG) 신호를 센싱하여 ECG 데이터를 출력하는 단계;상기 사용자의 맥파 (Photoplethysmogram, PPG) 신호를 센싱하여 PPG 데이터를 출력하는 단계; 및상기 ECG 데이터 및 상기 PPG 데이터에 대해 전처리를 수행한 후 사전에 학습된 소정의 딥러닝 모델에 적용하여상기 사용자의 혈압을 추정하는 단계를 포함하되,상기 소정의 딥러닝 모델은 CNN(Convolutional Neural Network) 모델, Bi-GRU(Bidirectional Gated RecurrentUnit) 모델 및 어텐션(Attention) 모델을 바인딩하여 학습된 모델이고,상기 혈압을 추정하는 단계는,상기 전처리된 ECG 및 PPG 데이터를 CNN 모델에 입력하여 CNN 가중치 파라미터를 출력하는 단계;상기 출력된 CNN 가중치 파라미터를 Bi-GRU 모델의 입력데이터로 적용하여 Bi-GRU 가중치 파라미터를 출력하는단계; 및상기 Bi-GRU 가중치 파라미터를 어텐션(Attention) 모델에 입력 데이터로 적용한 후 혈압값을 추정하는 단계를포함하는 것을 특징으로 하는, 혈압 측정 방법."}
{"patent_id": "10-2022-0180132", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 소정의 딥러닝 모델에서 추정된 혈압값과 기준값과의 평균절대오차 크기가 상기 추정된 혈압값을 재측정(recalibration)을 통해 재학습하는 단계를 더 포함하는, 혈압 측정 방법."}
{"patent_id": "10-2022-0180132", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 소정값은 5인 것을 특징으로 하는, 혈압 측정 방법."}
{"patent_id": "10-2022-0180132", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제9항에 있어서,상기 혈압을 추정하는 단계는 상기 전처리된 ECG 및 PPG 데이터를 5초 단위로 나누어서 상기 CNN 모델에 입력하는 단계를 포함하는, 혈압 측정 방법."}
{"patent_id": "10-2022-0180132", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제9항에 있어서,상기 혈압을 추정하는 단계는 상기 ECG 데이터를 0.5 내지 35 헤르츠(Hz)의 대역통과 필터에 적용하여 전처리를수행하는 단계를 포함하는, 혈압 측정 방법."}
{"patent_id": "10-2022-0180132", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "공개특허 10-2024-0098407-4-제9항에 있어서,상기 혈압을 추정하는 단계는 상기 PPG 데이터를 0.5 내지 15 헤르츠(Hz)의 대역통과 필터에 적용하여 전처리를수행하는 단계를 포함하는, 혈압 측정 방법."}
{"patent_id": "10-2022-0180132", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제9항 내지 제14항 중 어느 한 항에 기재된 방법을 컴퓨터에서 수행하는 컴퓨터 프로그램을 기록한 컴퓨터로 읽을 수 있는 기록매체."}
{"patent_id": "10-2022-0180132", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명에 따른 혈압을 측정하기 위한 웨어러블 디바이스는 사용자의 심전도(Electrocardiogram, ECG) 신호를 센 싱하여 ECG 데이터를 출력하는 ECG 센서부; 상기 사용자의 맥파 (Photoplethysmogram, PPG) 신호를 센싱하여 PPG 데이터를 출력하는 PPG 센서부; 및 상기 ECG 데이터 및 상기 PPG 데이터에 대해 전처리를 수행한 후 사전에 (뒷면에 계속)"}
{"patent_id": "10-2022-0180132", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 혈압을 측정하기 위한 장치에 관한 것으로, 보다 상세하게는, 재보정 및 재측정을 이용한 혈압 측정 장치에 관한 것이다."}
{"patent_id": "10-2022-0180132", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "생체신호에는 건강상태를 알 수 있는 다양한 정보가 포함되어 있다. 따라서 생체신호를 측정하고, 측정한 생체 신호로 건강상태를 예측할 수 있다. 실생활에서 건강상태를 알기 위해 주로 사용되는 생체신호는 혈압이다. 또한, 해가 거듭될수록 고혈압, 부정맥 등 다양한 심장질환 환자수가 증가하고 있다. 그렇기 때문에 이런 심장 질환을 조기에 발견하기 위해 실시간 혈압 측정은 필요하다. 현재 혈압 측정을 하기 위해 대부분 가압방식의 혈 압측정 기계를 사용한다. 기존의 번거로운 가압 방식의 혈압 측정 방법이 아닌 새로운 방법이 필요하다. 혈압을 측정하는 방법으로는 팔뚝에 감아서 측정하는 커프(Cuff) 기반 방법이 있다. 기존 커프(cuff) 기반 방식 으로는 언제 어디서나 혈압 측정을 할 수 없고 기계가 있더라도 번거로운 단점이 있다. 최근 커프를 사용하지 않고 혈압을 측정하는 Cuff-less 방법이 연구되고 있다. Cuff-less 방법의 혈압계는 혈압과 상관성이 높은 생체 정보를 이용하여 혈압을 간접적으로 측정한다. Cuff-less 방법의 혈압계는 혈압과 상관성이 높은 생체정보를 이용하여 혈압을 간접적으로 측정하지만 혈압 추 정값의 정확도도 매우 낮고 불규칙하며, 또한 연산 복잡도가 높아서 웨어러블 디바이스에 장착하기에 매우 어려 운 실정이다. 이에 본 발명에서는 웨어러블 디바이스에서 연산 복잡도도 낮으면서 정확도가 매우 높은 혈압 측정 방법 등을 제안하고자 한다."}
{"patent_id": "10-2022-0180132", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명에서 이루고자 하는 기술적 과제는 혈압을 측정하기 위한 웨어러블 디바이스를 제공하는 데 있다. 본 발명에서 이루고자 하는 다른 기술적 과제는 웨어러블 디바이스가 혈압을 측정하기 위한 방법을 제공하는 데 있다. 본 발명에서 이루고자 하는 또 다른 기술적 과제는 제9항 내지 제14항 중 어느 한 항에 기재된 방법을 컴퓨터에 서 수행하는 컴퓨터 프로그램을 기록한 컴퓨터로 읽을 수 있는 기록매체를 제공하는 데 있다. 본 발명에서 이루고자 하는 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급하지 않은"}
{"patent_id": "10-2022-0180132", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "또 다른 기술적 과제들은 아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하 게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0180132", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기의 기술적 과제를 달성하기 위한, 본 발명에 따른 혈압을 측정하기 위한 웨어러블 디바이스는, 사용자의 심 전도(Electrocardiogram, ECG) 신호를 센싱하여 ECG 데이터를 출력하는 ECG 센서부; 상기 사용자의 맥파 (Photoplethysmogram, PPG) 신호를 센싱하여 PPG 데이터를 출력하는 PPG 센서부; 및 상기 ECG 데이터 및 상기 PPG 데이터에 대해 전처리를 수행한 후 사전에 학습된 소정의 딥러닝 모델에 적용하여 상기 사용자의 혈압을 추정하되, 상기 소정의 딥러닝 모델은 CNN(Convolutional Neural Network) 모델, Bi-GRU(Bidirectional Gated Recurrent Unit) 모델 및 Attention 모델을 바인딩하여 학습된 모델이고, 상기 프로세서는, 상기 전처리된 ECG 및 PPG 데이터를 CNN 모델에 입력하여 CNN 가중치 파라미터를 출력하고, 상기 출력된 CNN 가중치 파라미터를 Bi-GRU 모델의 입력데이터로 적용하여 Bi-GRU 가중치 파라미터를 출력하고, 상기 Bi-GRU 가중치 파라미터를 어 텐션(Attention) 모델에 입력 데이터로 적용한 후 혈압값을 추정할 수 있다. 상기 프로세서는 상기 소정의 딥러닝 모델에서 추정된 혈압값과 기준값과의 평균절대오차 크기가 소정값 이상인 경우에는 상기 추정된 혈압값을 재측정(recalibration)을 통해 재학습을 수행할 수 있다. 상기 소정값은 5일 수 있다. 상기 프로세서는 상기 ECG 데이터를 0.5 내지 35 헤르츠(Hz)의 대역통과 필터에 적용하여 전처리를 수행할 수 있다. 상기 프로세서는 상기 PPG 데이터를 0.5 내지 15 헤르츠(Hz)의 대역통과 필터에 적용하여 전처리를 수행할 수 있다. 상기 프로세서는 상기 전처리된 ECG 및 PPG 데이터를 5초 단위로 나누어서 상기 CNN 모델에 입력할 수 있다. 상기 웨어러블 디바이스는 스마트 워치(smart watch)를 포함할 수 있다. 상기 기준값은 커프(Cuff) 기반으로 측정한 혈압값일 수 있다. 상기의 다른 기술적 과제를 달성하기 위한, 본 발명에 따른 웨어러블 디바이스가 혈압을 측정하기 위한 방법은, 사용자의 심전도(Electrocardiogram, ECG) 신호를 센싱하여 ECG 데이터를 출력하는 단계; 상기 사용자의 맥파 (Photoplethysmogram, PPG) 신호를 센싱하여 PPG 데이터를 출력하는 단계; 및 상기 ECG 데이터 및 상기 PPG 데 이터에 대해 전처리를 수행한 후 사전에 학습된 소정의 딥러닝 모델에 적용하여 상기 사용자의 혈압을 추정하는 단계를 포함하되, 상기 소정의 딥러닝 모델은 CNN(Convolutional Neural Network) 모델, Bi-GRU(Bidirectional Gated Recurrent Unit) 모델 및 어텐션(Attention) 모델을 바인딩하여 학습된 모델이고, 상기 혈압을 추정하는 단계는, 상기 전처리된 ECG 및 PPG 데이터를 CNN 모델에 입력하여 CNN 가중치 파라미터를 출력하는 단계; 상기 출력된 CNN 가중치 파라미터를 Bi-GRU 모델의 입력데이터로 적용하여 Bi-GRU 가중치 파라 미터를 출력하는 단계; 및 상기 Bi-GRU 가중치 파라미터를 어텐션(Attention) 모델에 입력 데이터로 적용한 후 혈압값을 추정하는 단계를 포함할 수 있다. 상기 방법은, 상기 소정의 딥러닝 모델에서 추정된 혈압값과 기준값과의 평균절대오차 크기가 상기 추정된 혈압 값을 재측정(recalibration)을 통해 재학습하는 단계를 더 포함할 수 있다. 상기 소정값은 5일 수 있다. 상기 방법에서 상기 혈압을 추정하는 단계는 상기 전처리된 ECG 및 PPG 데이터를 5초 단위로 나누어서 상기 CNN 모델에 입력하는 단계를 포함할 수 있다. 상기 방법에서 상기 혈압을 추정하는 단계는 상기 ECG 데이터를 0.5 내지 35 헤르츠(Hz)의 대역통과 필터에 적 용하여 전처리를 수행하는 단계를 포함할 수 있다. 상기 방법에서 상기 혈압을 추정하는 단계는 상기 PPG 데이터를 0.5 내지 15 헤르츠(Hz)의 대역통과 필터에 적 용하여 전처리를 수행하는 단계를 포함할 수 있다."}
{"patent_id": "10-2022-0180132", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 소정의 딥러닝 모델에서 재측정/재보정을 하여 재학습하도록 한 경우가 평균절대오차 크기가 훨 씬 작아지게 되었고, 결과적으로 실제의 혈압값과 비교하여 정확도가 매우 향상되었음을 확인할 수 있다. PTT 기반 딥러닝 모델로 측정된 혈압값의 평균절대오차의 크기 보다 본 발명에서 제안한 소정의 딥러닝 모델(3 개의 모델을 바인딩한 모델)을 통해 예측한 혈압값의 평균절대오차의 크기가 훨씬 더 작은 것으로 시뮬레이션 결과가 나와서 본 발명에서 제안한 소정의 딥러닝 모델을 통해 측정한 혈압값이 매우 정확도가 높으며 불필요한 연산도 줄일 수 있어서 낮은 연산 복잡도로 웨어러블 디바이스에 최적인 장점이 있다 . 본 발명에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효과들은"}
{"patent_id": "10-2022-0180132", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을것이다."}
{"patent_id": "10-2022-0180132", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명에 따른 바람직한 실시 형태를 첨부된 도면을 참조하여 상세하게 설명한다. 첨부된 도면과 함께 이하에 개시될 상세한 설명은 본 발명의 예시적인 실시형태를 설명하고자 하는 것이며, 본 발명이 실시될 수 있 는 유일한 실시형태를 나타내고자 하는 것이 아니다. 이하의 상세한 설명은 본 발명의 완전한 이해를 제공하기 위해서 구체적 세부사항을 포함한다. 그러나, 당업자는 본 발명이 이러한 구체적 세부사항 없이도 실시될 수 있 음을 안다. 몇몇 경우, 본 발명의 개념이 모호해지는 것을 피하기 위하여 공지의 구조 및 장치는 생략되거나, 각 구조 및 장치의 핵심기능을 중심으로 한 블록도 형식으로 도시될 수 있다. 또한, 본 명세서 전체에서 동일한 구성요소에 대해서는 동일한 도면 부호를 사용하여 설명한다. 본 발명을 설명하기에 앞서 인공 지능(AI), 머신 러닝, 딥러닝에 대해 설명한다. 이러한 세 가지 개념의 관계를 가장 쉽게 파악하는 방법은 세 개의 동심원을 가상하면 된다. 인공 지능이 가장 큰 원이고, 그 다음이 머신 러 닝이며, 현재의 인공지능 붐을 주도하는 딥 러닝이 가장 작은 원이라 할 수 있다. 인공 지능이라는 개념은 1956년 미국 다트머스 대학에 있던 존 매카시 교수가 개최한 다트머스 회의에서 처음 등장했으며, 최근 몇 년 사이 폭발적으로 성장하고 있는 중이다. 특히 2015년 이후 신속하고 강력한 병렬 처리 성능을 제공하는 GPU의 도입으로 더욱 가속화되고 있죠. 갈수록 폭발적으로 늘어나고 있는 저장 용량과 이미지, 텍스트, 매핑 데이터 등 모든 영역의 데이터가 범람하게 된 빅데이터 시대의 도래도 이러한 성장세에 큰 영향을 미쳤다. 인공 지능 - 인간의 지능을 기계로 구현 1956년 당시 인공 지능의 선구자들이 꿈꾼 것은 최종적으로 인간의 지능과 유사한 특성을 가진 복잡한 컴퓨터를 제작하는 것이었다. 이렇듯 인간의 감각, 사고력을 지닌 채 인간처럼 생각하는 인공 지능을 '일반 AI(General AI)'라고 하지만, 현재의 기술 발전 수준에서 만들 수 있는 인공지능은 '좁은 AI(Narrow AI)'의 개념에 포함된 다. 좁은 AI는 소셜 미디어의 이미지 분류 서비스나 얼굴 인식 기능 등과 같이 특정 작업을 인간 이상의 능력으 로 해낼 수 있는 것이 특징이다. 머신 러닝 - 인공 지능을 구현하는 구체적 접근 방식 머신 러닝은 메일함의 스팸을 자동으로 걸러주는 역할을 합니다. 한편, 머신 러닝은 기본적으로 알고리즘을 이 용해 데이터를 분석하고, 분석을 통해 학습하며, 학습한 내용을 기반으로 판단이나 예측을 수행한다. 따라서 궁극적으로는 의사 결정 기준에 대한 구체적인 지침을 소프트웨어에 직접 코딩해 넣는 것이 아닌, 대량의 데이터 와 알고리즘을 통해 컴퓨터 그 자체를 '학습'시켜 작업 수행 방법을 익히는 것을 목표로 한다. 머신 러닝은 초 기 인공 지능 연구자들이 직접 제창한 개념에서 나온 것이며, 알고리즘 방식에는 의사 결정 트리 학습, 귀납 논 리 프로그래밍, 클러스터링, 강화 학습, 베이지안(Bayesian) 네트워크 등이 포함된다. 그러나 이 중 어느 것도 최종 목표라 할 수 있는 일반 AI를 달성하진 못했으며, 초기의 머신 러닝 접근 방식으로는 좁은 AI 조차 완성하 기 어려운 경우도 많았던 것이 사실이다. 현재 머신 러닝은 컴퓨터 비전 등의 분야에서 큰 성과를 이뤄내고 있으나, 구체적인 지침이 아니더라도 인공 지 능을 구현하는 과정 전반에 일정량의 코딩 작업이 수반된다는 한계점에 봉착하였다. 가령 머신 러닝 시스템을 기반으로 정지 표지판의 이미지를 인식할 경우, 개발자는 물체의 시작과 끝 부분을 프로그램으로 식별하는 경계 감지 필터, 물체의 면을 확인하는 형상 감지, 'S-T-O-P'와 같은 문자를 인식하는 분류기 등을 직접 코딩으로 제 작해야 한다. 이처럼 머신 러닝은 '코딩'된 분류기로부터 이미지를 인식하고, 알고리즘을 통해 정지 표지판을 '학습'하는 방식으로 작동된다. 머신 러닝의 이미지 인식률은 상용화하기에 충분한 성능을 구현하지만, 안개가 끼거나 나무에 가려서 표지판이 잘 보이지 않는 특정 상황에서는 이미지 인식률이 떨어지기도 한다. 최근까지 컴퓨터 비전과 이미지 인식이 인 간의 수준으로 올라오지 못한 이유는 이 같은 인식률 문제와 잦은 오류 때문이다. 딥 러닝 - 완전한 머신 러닝을 실현하는 기술 초기 머신 러닝 연구자들이 만들어 낸 또 다른 알고리즘인 인공 신경망(artificial neural network)에 영감을 준 것은 인간의 뇌가 지닌 생물학적 특성, 특히 뉴런의 연결 구조였습니다. 그러나 물리적으로 근접한 어떤 뉴 런이든 상호 연결이 가능한 뇌와는 달리, 인공 신경망은 레이어 연결 및 데이터 전파 방향이 일정합니다. 예를 들어, 이미지를 수많은 타일(tile)로 잘라 신경망의 첫 번째 레이어에 입력하면, 그 뉴런들은 데이터를 다 음 레이어로 전달하는 과정을 마지막 레이어에서 최종 출력이 생성될 때까지 반복합니다. 그리고 각 뉴런에는 수행하는 작업을 기준으로 입력의 정확도를 나타내는 가중치가 할당되며, 그 후 가중치를 모두 합산해 최종 출 력이 결정됩니다. 정지 표지판의 경우, 팔각형 모양, 붉은 색상, 표시 문자, 크기, 움직임 여부 등 그 이미지의 특성이 잘게 잘려 뉴런에서 '검사'되며, 신경망의 임무는 이것이 정지 표지판인지 여부를 식별하는 것입니다. 여기서는 충분한 데이터를 바탕으로 가중치에 따라 결과를 예측하는 '확률 벡터(probability vector)'가 활용된 다. 딥 러닝은 인공신경망에서 발전한 형태의 인공 지능으로, 뇌의 뉴런과 유사한 정보 입출력 계층을 활용해 데이 터를 학습합니다. 그러나 기본적인 신경망조차 굉장한 양의 연산을 필요로 하는 탓에 딥 러닝의 상용화는 초기 부터 난관에 부딪혔다. 그럼에도 불구하고 연구자들의 연구는 지속됐고, 슈퍼컴퓨터를 기반으로 딥 러닝 개념을 증명하는 알고리즘을 병렬화하는데 성공했다. 그리고 병렬 연산에 최적화된 GPU의 등장은 신경망의 연산 속도를 획기적으로 가속하며 진정한 딥 러닝 기반 인공 지능의 등장을 불러왔다. 신경망 네트워크는 '학습' 과정에서 수많은 오답을 낼 가능성이 크다. 정지 표지판의 예로 돌아가서, 기상 상태, 밤낮의 변화에 관계 없이 항상 정답을 낼 수 있을 정도로 정밀하게 뉴런 입력의 가중치를 조정하려면 수 백, 수천, 어쩌면 수백만 개의 이미지를 학습해야 할지도 모른다. 이 정도 수준의 정확도에 이르러서야 신경망 이 정지 표지판을 제대로 학습했다고 볼 수 있다. 2012년, 구글과 스탠퍼드대 앤드류 응(Andrew NG) 교수는 1만 6,000개의 컴퓨터로 약 10억 개 이상의 신경망으로 이뤄진 '심층신경망(Deep Neural Network)'을 구현했다. 이 를 통해 유튜브에서 이미지 1,000만 개를 뽑아 분석한 뒤, 컴퓨터가 사람과 고양이 사진을 분류하도록 하는데 성공했습니다. 컴퓨터가 영상에 나온 고양이의 형태와 생김새를 인식하고 판단하는 과정을 스스로 학습하게 한 것이다. 딥 러닝으로 훈련된 시스템의 이미지 인식 능력은 이미 인간을 앞서고 있습니다. 이 밖에도 딥 러닝의 영역에는 혈액의 암세포, MRI 스캔에서의 종양 식별 능력 등이 포함된다. 구글의 알파고는 바둑의 기초를 배우고, 자신과 같은 AI를 상대로 반복적으로 대국을 벌이는 과정에서 그 신경망을 더욱 강화해 나갔다. 딥 러닝의 등장으로 인 해 머신 러닝의 실용성은 강화됐고, 인공 지능의 영역은 확장됐다. 딥 러닝은 컴퓨터 시스템을 통해 지원 가능 한 모든 방식으로 작업을 세분화한다. 운전자 없는 자동차, 더 나은 예방 의학, 더 정확한 영화 추천 등 딥 러 닝 기반의 기술들은 우리 일상에서 이미 사용되고 있거나, 실용화를 앞두고 있다. 딥 러닝은 공상 과학에서 등 장했던 일반 AI를 실현할 수 있는 잠재력을 지닌 인공 지능의 현재이자, 미래로 평가 받고 있다. 이하 딥러닝에 대해 좀 더 구체적으로 살펴본다. 딥러닝이란 인간의 신경망(Neural Network) 이론을 이용한 인공신경망(Artificial Neural Network, ANN)의 일 종으로, 계층 구조(Layer Structure)로 구성하면서 입력층(Input layer)과 출력층(Output layer) 사이에 하나 이상의 숨겨진 층(Hidden layer)(이하, 중간층이라 지칭함)을 갖고 있는 심층 신경망(Deep Neural Network, DNN)을 지칭하는 기계학습(Machine Learning) 모델 또는 알고리즘의 집합입니다. 간단히 말하면, 딥러닝(Deep Learning)은 심층 계층을 가진 인공신경망이라 할 수 있다. 사람의 뇌는 250억 개의 신경세포로 구성되어 있다고 추정됩니다. 뇌는 신경세포로 이루어지며, 각각의 신경세 포(뉴런, Neuron)는 신경망을 구성하는 신경세포 1개를 지칭한다. 신경세포는 1개의 세포체(cell body)와 세포 체의 돌기인 1개의 축삭(Axon or nurite) 및 보통 여러 개의 수상돌기(dendrite or protoplasmic process)를 포함하고 있다. 이러한 신경세포들 간의 정보 교환은 시냅스라고 부르는 신경세포 간의 접합부를 통하여 전달됩 니다. 신경세포 하나만 떼어 놓고 보면 매우 단순하지만, 이러한 신경세포들이 모이면 인간의 지능을 지닐 수 있다. 수상돌기에서 다른 신경세포들이 보내는 신호를 전달받는 부분(Input)이고 축색돌기는 세포체로부터 아주 길게 뻗어가는 부분으로 다른 신경세포에 신호를 전달하는 부분(Output)이다. 신경세포들 사이의 신호를 전달해 주는 축색돌기와 수상돌기 간을 연결해주는 시냅스라는 연결부가 있는데, 신경세포의 신호를 무조건 전달하는 것이 아니라, 신호 강도가 일정한 값(임계치, Threshold) 이상이 되어야 신호를 전달하는 것이다. 즉, 각 시냅 스마다 연결강도가 다를 뿐만 아니라 신호를 전달할지 말지를 결정하게 되는 것이다. 인공지능의 한 분야인 인공신경망(ANN)은 생물학(통상 인간)의 뇌 구조(신경망)를 모방하여 모델링한 수학적 모 델이다. 즉, 인공신경망은 이러한 생물학적 신경세포의 정보처리 및 전달 과정을 모방하여 구현한 것이다. 인간 의 뇌가 문제를 해결하는 방식과 유사하게 구현한 것으로서 신경망은 각 신경세포가 독립적으로 동작하는 하기 때문에 병렬성이 뛰어나다. 또한 많은 연결선에 정보가 분산되어 있어서 몇몇 신경세포에 문제가 발생해도 전체 에 큰 영향을 주지 않으므로 일정 수준의 오류에 강하고 주어진 환경에 대한 학습 능력을 갖고 있다. 심층신경망(Deep neural network)는 인공신경망의 후손이라 볼 수 있으며, 기존의 한계를 뛰어넘어서 과거에 수 많은 인공 지능 기술이 실패를 겪었던 영역에 성공 사례를 거두고 인공신경망의 최신 버전이다. 생물학적 신경 망을 모방하여 인공신경망을 모델링한 내용을 살펴보면 처리 단위(Processing unit) 측면에서는 생물적인 뉴런 (neurons)이 노드(nodes)로, 연결성(Connections)은 시냅스(Synapse)가 가중치(weights)로 다음 표 1과 같이 모델링 되었다. 표 1 생물학적 신경망 인공신경망 세포체 노드(node) 수상돌기 입력(input) 축삭(Axon) 출력(output) 시냅스 가중치(weight) 도 1은 인공신경망의 계층 구조(layer structure)를 예시한 도면이다. 인간의 생물학적 신경세포가 하나가 아닌 다수가 연결되어 의미 있는 작업을 하듯, 인공신경망의 경우도 개별 뉴런들을 서로 시냅스를 통해 서로 연결시켜서 복수개의 계층(layer)이 서로 연결되어 각 층간의 연결 강도는 가중치로 수정(update) 가능합니다. 이와 같이 다층 구조와 연결강도로 학습과 인지를 위한 분야에 활용됩니다. 각 노드들은 가중치가 있는 링크들로 연결되어 있고, 전체 모델은 가중치를 반복적으로 조정하면서 학습을 한다. 가중치는 장기 기억을 위한 기본 수단으로서 각 노드들의 중요도를 표현한다. 간단히 이야기하면, 인공신 경망은 이들 가중치를 초기하고 훈련시킬 데이터 세트로 가중치를 갱신하여 조정하여 전체 모델을 훈련시키는 것입니다. 훈련이 완료된 후에 새로운 입력값이 들어오면 적절한 출력값을 추론해 내게 된다. 인공신경망의 학 습원리는 경험의 일반화로부터 지능이 형성되는 과정이라고 보면 되고 bottom-up 방식으로 이루어지게 된다. 도 1에서 중간층이 2개 이상(즉 5~10개)일 경우를 층이 깊어진다고 보고 심층신경망(Deep Neural Netowkr)이라 하 며, 이러한 심층신경망을 통해서 이루어진 학습과 추론 모델을 딥러닝이라고 지칭할 수 있다. 인공신경망은 입력과 출력을 제외하고 하나의 중간계층(통상적으로 은닉계층, 'hidden layer'라 지칭함)을 가지 고 있어도 어느 정도의 역할을 수행할 수 있지만, 문제의 복잡도가 커지면 노드의 수 또는 계층의 수를 증가시 켜야 한다. 이 중에서 계층의 수를 증가시켜 다층구조 모델을 가져가는 것이 효과적인데, 효율적인 학습이 불가 능하고 네트워크를 학습하기 위한 계산량이 많다는 한계로 인해 활용 범위가 제한적이다. 그러나, 위와 같이 기존의 한계점이 극복됨으로써, 인공신경망은 깊은 구조(Deep Structure)를 가져갈 수 있게 되었습니다. 이로 인해 복잡하고 표현력 높은 모델을 구축할 수 있게 되어 음성인식, 얼굴인식, 물체인식, 문자 인식 등 다양한 분야에서 획기적인 결과들이 발표되고 있다. 도 2는 심층 신경망의 일 예를 도시한 도면이다. 심층 신경망(Deep Neural Network, DNN)은 입력층(input layer)과 출력층(output layer) 사이에 여러 개의 은 닉층(hidden layer)들로 이뤄진 인공신경망(Artificial Neural Network, ANN)이다. 입력층(Input layer)과 출 력층(Output layer) 사이에 하나 이상의 은닉계층(Hidden layer)을 갖고 있는 심층 신경망(Deep Neural Network, DNN)을 지칭하는 머신 러닝(기계학습(Machine Learning)) 모델 또는 알고리즘의 집합이다. 신경망의 연결은 입력층에서 은닉계층으로, 은닉계층에서 출력층으로 이루어진다. 심층 신경망은 일반적인 인공신경망과 마찬가지로 복잡한 비선형 관계(non-linear relationship)들을 모델링할 수 있다. 예를 들어, 물체 식별 모델을 위한 심층 신경망 구조에서는 각 물체가 영상의 기본적 요소들의 계층적 구성으로 표현될 수 있다. 이때, 추가 계층들은 점진적으로 모인 하위 계층들의 특징들을 규합시킬 수 있다. 심 층 신경망의 이러한 특징은, 비슷하게 수행된 인공신경망에 비해 더 적은 수의 유닛(unit, node)들 만으로도 복 잡한 데이터를 모델링할 수 있게 해준다. 이전의 심층 신경망들은 보통 앞먹임 신경망으로 설계되어 왔지만, 최근의 연구들은 심층 학습 구조들을 순환 신경망(Recurrent Neural Network, RNN)에 성공적으로 적용했다. 일례로 언어 모델링(language modeling) 분야 에 심층 신경망 구조를 적용한 사례 등이 있다. 합성곱 신경망(Convolutional Neural Network, CNN)의 경우에 는 컴퓨터 비전(computer vision) 분야에서 잘 적용되었을 뿐만 아니라, 각각의 성공적인 적용 사례에 대한 문 서화 또한 잘 되어 있다. 더욱 최근에는 합성곱 신경망이 자동음성인식(Automatic Speech Recognition, ASR)을 위한 음향 모델링(acoustic modeling) 분야에 적용되었으며, 기존의 모델들 보다 더욱 성공적으로 적용되었다는 평가를 받고 있다. 심층 신경망은 표준 오류역전파 알고리즘으로 학습될 수 있다. 이때, 가중치(weight)들은 아 래의 등식을 이용한 확률적 경사 하강법(stochastic gradient descent)을 통하여 갱신될 수 있다. 혈압과 상관성이 높은 생체정보로는 심전도(Electrocardiogram, ECG), 맥파 (Photoplethysmogram, PPG), 심탄 도(Ballistocardiogram, BCG) 신호를 고려할 수 있다. 이하, ECG 센서부, PPG 센서부, BCG 센서부에 대해 간략 히 살펴본다. 표 2 신호 정의 ECG 심장의 전기적 활동을 기록(심근의 탈분극과 재분극에 의해 일어나는 전기적 흥분 상태의 변화를 측정한 것이다.) PPG 광학적 특성을 이용하여 혈관의 용적 변화를 기록(LED 녹색광은 피부에 전달되어 피부가 일부 흡수하고 반사하게 되어 그 변화를 측정하게 된다.) BCG 심장이 수축할 때 발생되는 물리적 진동을 기록 심전도란 심장이 수축함에 따라 심박동과 함께 발생하는 전위차를 곡선으로 기록한 것이다. 심장은 자동적, 율 동적인 수축을 한다는 점에서 생체내의 다른 부분의 근육에 비해 특이하다. 심장근육의 수축은 생명체의 전기를 공급하는 발전기와 같다. 즉 수축을 일으키는 원동력이 심방의 동방결절에서 발생되는 미세한 전류 인 것이다. 이 미약한 전류가 심장근육을 통하면서 신체내에 전류가 흐르게 되고, 이 전류를 신체의 표면에서 기록할 수 있 게 된다. 이를 기록하는 장치를 심전도(Electrocardiography) 센서(ECG 센서)라 하고, 이 기록을 심전도 (Electrocardiogram, ECG) 이라 한다. 심박수(Photoplethysmograph, PPG) 다음으로, 심박수 센서의 일 예로서 PPG(Photoplethysmograph) 센서를 설명한다. PPG 센서는 광용 적맥파 센서 라고 한다. 광용 적맥파 측정법 (Photoplethysmograph, PPG)은 생체 조직의 광학적 특성을 이용하여 혈관에 흐 르는 혈류량을 측정함으로써 심박 활동 상태 혹은 심박수를 알 수 있는 맥파 측정 방법이다. 맥파는 혈액이 심 장에서 파상하며 나타내는 맥동성 파형으로, 심장의 이완 수축 작용에 따라 나타나는 혈류량의 변화, 즉 혈관의 용적 변화를 통하여 측정 가능하다. 광용 적맥파 측정법은 빛을 이용하여 맥파를 측정하는 방법으로, 용적 변화 시 나타나는 생체조직의 반사, 흡수 투과비 등의 광학적 특성의 변화를 광 센서에서 감지하여 측정하며, 이를 통해 맥박 측정이 가능하다. 이 방법은 비침습적인 맥박 측정이 가능하고 소형화, 사용편의성 등의 장점을 가지고 있어 널리 사용되고 있으며 웨어러블 (wearable) 디바이스에서 생체 신호 감지 센서로 사용될 수 있다. 도 3은 ECG와 PPG, BCG를 이용하여 계산되는 Feature인 PTT(Pulse Transit Time)를 예시적으로 나타낸 도면이 다. ECG와 PPG, BCG를 이용하여 계산되는 Feature인 PTT(Pulse Transit Time)를 이용하여 통계적 방법 기반으로 혈 압을 추정하는 방법이 있다. 그러나, PTT는 동맥의 특성에 의해서도 영향을 받고 시간에 따른 혈관 탄성 변화에 의해서 주기적으로 교정 작업이 필요하다는 단점이 있다. 또한 생체신호 측정 시 사용자의 행동에 따라 잡음이 생겨 특징(Feature)를 구하기 어려워, 혈압 추정 알고리즘의 추정 정도가 감소할 수 있다. 따라서, 전통적으로 특징(Feature)을 구하여 추정하는 방식이 아닌 심층신경망을 통하여 학습이 이루어지는 딥러닝(Deep Learning) 기반 방법이 이를 해결하기 위한 좋은 방법일 수 있다. 본 발명에서는 생체신호인 심전도, 맥파를 덥러닝 모델을 이용하여 혈압을 추정하는 장치 및 방법을 제안하되, 본 발명에서 사용하는 딥러닝 모델은 복수의 모델을 묶어서(binding) 학습된 모델이다. 도 4는 본 발명에 따른 사용자의 생체 신호를 이용한 혈압 측정 장치의 구성요소를 설명하기 위한 블록도 이다. 도 4를 참조하면, 사용자의 생체 신호를 이용한 혈압 측정 장치는 프로세서, ECG 센서부, PPG 센서부, 메모리, 디스플레이부 및 통신부를 포함할 수 있다. 도 4에서 설명한 ECG 센서부 , PPG 센서부는 별도의 센서부로 도시하였으나, 하나의 센서 장치로 통합되어 구성될 수도 있다. 메 모리는 프로세서과 전기적으로 결합되어 구비되고 추정된 혈압값의 정보, 학습데이터, 딥러닝 모델 등을 저장하고 있을 수 있다. 사용자의 생체 신호를 이용한 혈압 측정 장치는 웨어러블 디바이스로서 손목 형 웨어러블 디비아스, 스마트 워치 등을 포함해 사용자가 착용가능한 모든 디바이스 형태일 수 있다. 이하에서 는, 혈압 측정을 위한 웨어러블 디바이스로 명칭하여 설명한다. 도 5는 웨어러블 디바이스가 혈압을 추정하기 위한 과정을 예시한 도면이다. 도 4 및 도 5를 참조하면, ECG 센서부는 사용자의 생체 신호를 센싱하여 심전도 신호(ECG 신호)에 대한 데 이터를 추출 혹은 획득하여 출력할 수 있다. PPG 센서부는 사용자의 생체 신호를 센싱하여 심박수 신호 (PPG 신호)에 대한 데이터를 추출 혹은 획득하여 출력할 수 있다. 프로세서는 ECG 센서부로부터 출력 된 ECG 데이터를 수신하고, PPG 센서부는 추출 혹은 획득한 심박수 신호에 대한 데이터를 프로세서로 전달할 수 있다. 프로세서는 ECG 센서부로부터 수신한 심전도 데이터(혹은 심전도 신호)에 대해 전처리 (Preprocessing)를 수행할 수 있다. 전처리는 ECG 센서부로부터 수신한 ECG 데이터에 대역통과 필터링 (Bandpass filtering)를 적용하여 잡음을 제거하는 과정을 포함할 수 있다. 구체적으로, 프로세서는 ECG 데이터를 0.5 내지 35 헤르츠(Hz)의 대역통과 필터에 적용하여 전처리를 수행할 수 있다. 프로세서는 PPG 데이터를 0.5 내지 15 헤르츠(Hz)의 대역통과 필터에 적용하여 전처리를 수행할 수 있다. 프로세서는 전처리된 ECG 데이터 및 전처리된 PPG 데이터를 본 발명에서 제안하는 사전에 학습된 소정의 딥러닝 모델의 입력값으로 입력할 수 있다. 본 발명에서 제안하는 소정의 딥러닝 모델은 CNN(Convolutional Neural Network) 모델, Bi-GRU(Bidirectional Gated Recurrent Unit) 모델 및 Attention 모델을 바인딩하여 학습된 모델이다. 프로세서는 전처리된 ECG 데이터, PPG 데이터를 CNN(Convolutional Neural Network) 모델, Bi-GRU(Bidirectional Gated Recurrent Unit) 모델 및 Attention 모델로 바인딩된 모델을 통해 학습을 수행하거나 혈압 추정을 테스트할 수 있다. CNN 모델이란 일반적으로 특징 추출(Feature extraction) 역할을 하는 Convolution, Pooling layer 와 classification 역할을 하는 fully connected layer 로 구성되어 있다. 프로세서는 전처리된 ECG 및 PPG 데이터를 CNN 모델에 입력하여 CNN 가중치(Weight) 파라미터를 출력한다. GRU란 장기간 메모리가 필요한 문제에 쓰이는 LSTM(Long Short-Term Memory)의 변형으로, Reset gate와 Update gate가 존재한다. Reset gate는 새로운 입력을 이전 메모리와 어떻게 조합하는지를 결정하며, Update gate는 이 전 메모리 정보를 어느 정도만 유지하여 새로운 state를 계산해 내는지를 결정한다. GRU는 LSTM에 비해 간단한 구조를 가지고 있다. Bi-GRU 모델이란 과거정보를 적당히 리셋시키는 reset gate, 과거와 현재의 정보의 최신화 비율을 결정하는 update gate, 현 시점의 정보 후보군을 계산하는 candidate, 마지막으로 update gate 결과와 candidate 결과를 결합하여 현시점의 은닉층을 계산하는 단계로 이루어져 있다. 프로세서는 CNN 모델에서출력된 CNN 가중치 파라미터를 Bi-GRU 모델의 입력데이터로 적용하여 Bi-GRU 가중치 파라미터를 출력한다. 어텐션(Attention) 모델/메커니즘이란 출력 단어를 예측한다고 했을 때 전체 입력 문장을 전부 다 동일한 비율 로 참고하는 것이 아니라, 해당 시점에서 예측해야 할 단어와 연관이 있는 입력 단어 부분을 좀 더 집중 (attention)해서 보게 하는 메커니즘이다. 어텐션 모델은 디코더에서 출력 단어를 예측하는 매 시점(step)마다, 인코더의 입력 시퀀스를 다시 참고한다. 이 때, 입력 시퀀스를 동일한 비중으로 참고하는 것이 아닌, 예측 단어 와 관련이 있는 입력 단어를 더욱 치중해서 보기 때문에 Attention이란 단어를 사용한다. 어텐션 함수는 주어진 '쿼리(Query)'에 대해 모든 '키(Key)'의 유사도를 각각 구한다. 그리고, 이 유사도를 키(Key)와 매핑되어 있는 각각의 '값(Value)'에 반영한다. 그리고, '유사도가 반영된' 값(Value)을 모두 더해서 리턴하고, 어텐션 값 (Attention value)를 반환한다. 인코더의 각 Attention Weight와 그에 대응하는 hidden state를 가중합하여 Attention Values를 구한다. 최종적으로, 위에서 구한 Attention Weight와 각 hidden state를 통해 최종적인 Attention value를 획득한다. 프로세서는 Bi-GRU 모델에서 출력된 Bi-GRU 가중치 파라미터를 Attention 모델에 입력 데이터로 적용하여 혈압값을 추정한다. 여기서 추정되는 혈압은 수축기 혈압(systolic blood pressure, SBP) 및/또는 이완기 혈압 (diastolic blood pressure, DBP)이다. 도 6은 본 발명에서 제안하는 딥러닝 모델의 입력데이터에 대한 사항을 예시한 도면이다. 도 5 및 도 6을 참조하면, 프로세서는 전처리된 시계열적인 ECG 데이터, 전처리된 시계열적인 PPG 데이터 를 5초 단위로 나누어서 CNN 모델에 입력으로 들어가게 하여 가중치(weight) 값을 출력하고, 가중치 값이 Bi- GRU 모델 그리고 어텐션(attention) 모델을 통해서 업데이트하면서 학습을 하고 이때 출력값으로는 혈압값을 추 정하게 된다. 상기 소정의 딥러닝 모델을 통한에서 예측에서 평균 절대 오차(mean absolute error) 크기가 소정 값(예, 5)를 넘어갈 경우에는 프로세서는 재측정/재보정(re-calibration)을 통해 상기 소정의 딥러닝 모델 을 재학습하도록 하여 추정된 혈압값의 정확도를 현저히 향상시킬 수 있다. 프로세서는 상기 소정의 딥러 닝 모델에서 예측한 혈압값이 커프(cuff)-기반 측정 혈압값과의 평균절대오차(mean absolute error) 크기가 소 정값(예, 5)를 넘어갈 경우에는 사전에 학습된 딥러닝 모델을 리콜하여 새로운 데이터를 이용하여 파라미터들을 업데이트하는 방식으로 재학습을 수행한다. 프로세서는 추정된 혈압값에 대한 정보를 웨어러블 디바이스의 디스플레이부에 디스플레이하여 사용자가 확인할 수 있도록 제어할 수 있다. 프로세서는 추정된 혈압값이 소정의 정상값의 범위를 벗어난 경우에는 상기 추정된 혈압값의 정보를 통신부를 통해 네트워크로 전송 가능하다. 도 7은 본 발명에 따른 웨어러블 디바이스에서 사용자의 혈압을 추정하는 방법을 설명하기 위해 예시한 도 면이다. 도 7의 (a)를 참조하면, 프로세서는 전처리된 ECG 데이터 및 전처리된 PPG 데이터를 본 발명에서 제안하는 사전에 학습된 소정의 딥러닝 모델(Pretrained Model)의 입력값으로 입력할 수 있다. 프로세서는 전처리된 ECG 데이터, PPG 데이터를 사전에 학습된 CNN(Convolutional Neural Network) 모델, Bi-GRU(Bidirectional Gated Recurrent Unit) 모델 및 Attention 모델로 바인딩된 모델을 통해 혈압값을 추정한다. 도 7의 (b)를 참조하면, 만약, 사전에 학습된 소정의 딥러닝 모델(Pretrained Model)에서 예측한 혈압값이 평균 절대 오차(mean absolute error)가 소정값(예, 5)를 넘어갈 경우에는 프로세서는 재측정/재보정(re- calibration)을 통해 소정의 딥러닝 모델을 재학습하도록 한다. 프로세서는 사전에 학습된 딥러닝 모델을 리콜하여 새로운 데이터를 이용하여 파라미터들을 업데이트하는 방식으로 재학습을 수행한다. 이러한 도 8은 본 발명에서 제안한 소정의 딥러닝 모델을 통해 사용자의 혈압을 추정한 값과 기준값과의 평균절대오차 크기를 도시한 도면이다. 도 8의 (a)는 본 발명에 따른 소정의 딥러닝 모델에서 재측정/재보정에 따른 재학습 없는 경우의 기준값과의 평 균절대오차 크기를 나타내고 있고, 도 8의 (b)는 본 발명에 따른 소정의 딥러닝 모델에서 재측정/재보정을 하여 재학습하도록 한 경우의 기준값과의 평균절대오차 크기를 나타내고 있다. 여기서, 기준값이라 함은 ECG, PPG 센 싱을 수행할 때 함께 팔이나 손목에서 커프(cuff)-기반으로 실제 측정한 혈압값일 수 있다. 도 8의 (a)의 본 발명에 따른 소정의 딥러닝 모델에서 재측정/재보정에 따른 재학습 없는 경우보다 도 8의 (b) 는 본 발명에 따른 소정의 딥러닝 모델에서 재측정/재보정을 하여 재학습하도록 한 경우가 평균절대오차 크기가 훨씬 작아지게 되었고, 결과적으로 실제의 혈압값과 비교하여 정확도가 매우 향상되었음을 확인할 수 있다.또한, 도 8의 (b)에 도시된 바와 같이, PTT 기반 딥러닝 모델로 측정된 혈압값의 평균절대오차의 크기 보다 본 발명에서 제안한 소정의 딥러닝 모델(3개의 모델을 바인딩한 모델)을 통해 예측한 혈압값의 평균절대오차의 크 기가 훨씬 더 작은 것으로 시뮬레이션 결과가 나와서 본 발명에서 제안한 소정의 딥러닝 모델을 통해 측정한 혈 압값이 매우 정확도가 높다는 장점이 있다. 이상에서 설명된 실시예들은 본 발명의 구성요소들과 특징들이 소정 형태로 결합된 것들이다. 각 구성요소 또는 특징은 별도의 명시적 언급이 없는 한 선택적인 것으로 고려되어야 한다. 각 구성요소 또는 특징은 다른 구성요 소나 특징과 결합되지 않은 형태로 실시될 수 있다. 또한, 일부 구성요소들 및/또는 특징들을 결합하여 본 발명 의 실시예를 구성하는 것도 가능하다. 본 발명의 실시예들에서 설명되는 동작들의 순서는 변경될 수 있다. 어느 실시예의 일부 구성이나 특징은 다른 실시예에 포함될 수 있고, 또는 다른 실시예의 대응하는 구성 또는 특징과 교체될 수 있다. 특허청구범위에서 명시적인 인용 관계가 있지 않은 청구항들을 결합하여 실시예를 구성하거나 출원 후의 보정에 의해 새로운 청구항으로 포함시킬 수 있음은 자명하다. 프로세서는 컨트롤러(controller), 마이크로 컨트롤러(microcontroller), 마이크로 프로세서 (microprocessor), 마이크로 컴퓨터(microcomputer) 등으로도 호칭될 수 있다. 한편, 프로세서는 하드웨 어(hardware) 또는 펌웨어(firmware), 소프트웨어, 또는 이들의 결합에 의해 구현될 수 있다. 하드웨어를 이용 하여 본 발명의 실시예를 구현하는 경우에는, 본 발명을 수행하도록 구성된 ASICs(application specific integrated circuits) 또는 DSPs(digital signal processors), DSPDs(digital signal processing devices), PLDs(programmable logic devices), FPGAs(field programmable gate arrays) 등이 프로세서에 구비될 수 있다. 본 발명은 본 발명의 필수적 특징을 벗어나지 않는 범위에서 다른 특정한 형태로 구체화될 수 있음은 당업자에 게 자명하다. 따라서, 상기의 상세한 설명은 모든 면에서 제한적으로 해석되어서는 아니되고 예시적인 것으로 고려되어야 한다. 본 발명의 범위는 첨부된 청구항의 합리적 해석에 의해 결정되어야 하고, 본 발명의 등가적 범위 내에서의 모든 변경은 본 발명의 범위에 포함된다."}
{"patent_id": "10-2022-0180132", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 발명에 관한 이해를 돕기 위해 상세한 설명의 일부로 포함되는, 첨부 도면은 본 발명에 대한 실시예를 제공 하고, 상세한 설명과 함께 본 발명의 기술적 사상을 설명한다. 도 1은 인공신경망의 계층 구조(layer structure)를 예시한 도면이다. 도 2는 심층 신경망의 일 예를 도시한 도면이다. 도 3은 ECG와 PPG, BCG를 이용하여 계산되는 Feature인 PTT(Pulse Transit Time)를 예시적으로 나타낸 도면이 다. 도 4는 본 발명에 따른 사용자의 생체 신호를 이용한 혈압 측정 장치의 구성요소를 설명하기 위한 블록도 이다. 도 5는 웨어러블 디바이스가 혈압을 추정하기 위한 과정을 예시한 도면이다. 도 6은 본 발명에서 제안하는 딥러닝 모델의 입력데이터에 대한 사항을 예시한 도면이다. 도 7은 본 발명에 따른 웨어러블 디바이스에서 사용자의 혈압을 추정하는 방법을 설명하기 위해 예시한 도 면이다. 도 8은 본 발명에서 제안한 소정의 딥러닝 모델을 통해 사용자의 혈압을 추정한 값과 기준값과의 평균절대오차 크기를 도시한 도면이다."}
