{"patent_id": "10-2021-7031511", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0134724", "출원번호": "10-2021-7031511", "발명의 명칭": "시뮬레이션된 양자 알고리즘에 기초한 데이터 검색 방법 및 장치 및 디바이스", "출원인": "텐센트 테크놀로지", "발명자": "천 유"}}
{"patent_id": "10-2021-7031511", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "컴퓨터 디바이스에 적용 가능한 시뮬레이션된 양자 알고리즘에 기초한 데이터 검색 방법으로서,복수의 검색될 후보 데이터(to-be-searched candidate data)에 따라 제1 상태 데이터 및 제2 상태 데이터를 생성하는 단계 - 상기 제1 상태 데이터에 대응하는 제1 상태는 상기 복수의 후보 데이터가 동일한 선택 확률(selection probability)을 갖는 상태이고, 상기 제2 상태 데이터에 대응하는 제2 상태는 검색 조건을 만족하는타깃 데이터가 발견된 상태임 - ;상기 제1 상태 데이터 및 상기 제2 상태 데이터에 따라 제1 검색 경로를 생성하는 단계 - 상기 제1 검색 경로의시작점은 상기 제1 상태를 나타내고, 종료점은 상기 제2 상태를 나타내며, 상기 제1 검색 경로는 값이 결정되지않은 복수의 계수를 포함함 - ;상기 제1 검색 경로에 대응하는 제1 처리 함수를 획득하는 단계 - 상기 제1 처리 함수는 복수의 계수를 포함하고, 상기 제1 처리 함수의 출력 값은 상기 제1 검색 경로에 의해 결정되며, 상기 제1 처리 함수의 출력 값의 수렴은 상기 복수의 계수의 값이 목표를 만족한다는 것을 나타냄 - ;상기 제1 검색 경로의 적어도 두 개의 값 집합을 순회하는 단계 - 각각의 값 집합은 상기 복수의 계수에 대응하는 복수의 값을 포함하고, 상이한 값 집합의 복수의 값은 완전히 동일하지 않음 - ;상기 복수의 계수의 값이 각각 상기 순회된 값 집합의 복수의 값인 경우에 시뮬레이션된 양자 알고리즘에 기초하여 제1 처리 함수의 출력 값을 획득하는 단계;상기 제1 처리 함수의 출력 값이 수렴하는 경우, 수렴하는 출력 값에 대응하는 값 집합의 복수의 값을 상기 복수의 계수의 값으로 각각 사용하여 제2 검색 경로를 획득하는 단계; 및상기 제2 검색 경로를 사용하여 상기 타깃 데이터에 대한 복수의 후보 데이터를 검색하는 단계를 포함하는 데이터 검색 방법."}
{"patent_id": "10-2021-7031511", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 복수의 계수의 값이 각각 상기 순회된 값 집합의 복수의 값인 경우 시뮬레이션된 양자 알고리즘에 기초하여 제1 처리 함수의 출력 값을 획득하는 단계 이후에, 상기 데이터 검색 방법은:상기 제1 처리 함수의 출력 값이 수렴하지 않는 경우, 순회한 적어도 두 개의 값 집합 및 상기 적어도 두 개의값 집합에 대응하는 제1 처리 함수의 출력 값을 획득하는 단계;상기 적어도 두 개의 값 집합 및 대응하는 출력 값에 대해 함수 피팅(function fitting)을 수행하여 제2 처리함수를 획득하는 단계 - 상기 제2 처리 함수는 상기 적어도 두 개의 값 집합에 대응하는 상기 출력 값의 분포를서술하도록 구성되고, 상기 제2 처리 함수는 상기 복수의 계수를 포함함 - ; 및예상 함수(expectation function)를 사용하여 업데이트된 값 집합의 복수의 값을 처리하여 획득되는 출력 값이상기 예상 함수의 최대 출력 값이 되도록 업데이트된 값 집합을 획득하는 단계 - 상기 예상 함수는 상기 제2 처리 함수의 예상 복귀(expected return)를 설명하도록 구성됨 -를 더 포함하는 데이터 검색 방법."}
{"patent_id": "10-2021-7031511", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 적어도 두 개의 값 집합 및 대응하는 출력 값에 대해 함수 피팅(function fitting)을 수행하여 제2 처리함수를 획득하는 단계는:공개특허 10-2021-0134724-3-상기 적어도 두 개의 값 집합이 가우스 분포(Gaussian distribution)를 만족하는 경우에 상기 적어도 두 개의값 집합에 대응하는 조건 확률(condition probability)을 획득하는 단계 - 상기 적어도 두 개의 값 집합에 대응하는 출력 값의 분포가 가우스 분포를 만족하는 경우에 상기 조건 확률은 상기 적어도 두 개의 값 집합 및 대응하는 출력 값에 기초하여 제2 처리 함수를 획득할 확률임 - ; 및상기 적어도 두 개의 값 집합, 상기 대응하는 출력 값, 및 상기 조건 확률에 따라 상기 획득된 제2 처리 함수를조정하여 상기 조정된 제2 처리 함수를 획득하는 단계를 포함하는, 데이터 검색 방법."}
{"patent_id": "10-2021-7031511", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,예상 함수를 사용하여 업데이트된 값 집합의 복수의 값을 처리하여 획득되는 출력 값이 상기 예상 함수의 최대출력 값이 되도록 업데이트된 값 집합을 획득하는 단계는:상기 적어도 두 개의 값 집합에 대응하는 상기 제1 처리 함수의 출력 값에서 최대 출력 값을 획득하는 단계;상기 제2 처리 함수와 상기 최대 출력 값의 차이에 따라 상기 제2 처리 함수에 대응하는 상기 예상 함수를 결정하는 단계 - 상기 예상 함수는 상기 차이와 0 사이의 최댓값을 평균화하는 함수임 -; 및경사 알고리즘(gradient algorithm)을 사용하여 상기 예상 함수의 최대 출력 값에 대응하는 값 집합을 상기 업데이트된 값 집합으로 결정하는 단계를 포함하는, 데이터 검색 방법."}
{"patent_id": "10-2021-7031511", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서,상기 적어도 두 개의 값 집합이 가우스 분포를 만족하는 경우에 상기 적어도 두 개의 값 집합에 대응하는 조건확률을 획득하는 단계는:상기 적어도 두 개의 값 집합이 상기 가우스 분포를 만족하는 경우에 상기 적어도 두 개의 값 집합에 대응하는평균값 및 분산을 획득하는 단계; 및상기 평균값 및 상기 분산에 따라 상기 적어도 두 개의 값 집합에 대응하는 조건 확률을 획득하는 단계를 포함하는, 데이터 검색 방법."}
{"patent_id": "10-2021-7031511", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 시뮬레이션된 양자 알고리즘은 복수의 하위 함수 및 상기 복수의 하위 함수에 따라 상기 제1 처리 함수를결정하는 연산 모드를 포함하며, 상기 복수의 계수의 값이 각각 상기 순회된 값 집합의 복수의 값인 경우에 시뮬레이션된 양자 알고리즘에 기초하여 제1 처리 함수의 출력 값을 획득하는 단계는:상기 시뮬레이션된 양자 알고리즘에 기초하여 상기 순회된 값 집합의 복수의 값을 처리하여 상기 복수의 하위함수에 의해 출력된 제1 값을 각각 획득하는 단계; 및상기 연산 모드에 따라, 상기 복수의 하위 함수에 의해 출력된 상기 제1 값에 대한 연산을 수행하여 상기 제1처리 함수의 출력 값을 획득하는 단계를 포함하는, 데이터 검색 방법."}
{"patent_id": "10-2021-7031511", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 제1 상태 데이터 및 상기 제2 상태 데이터에 따라 제1 검색 경로를 생성하는 단계는:상기 제1 상태 데이터, 상기 제2 상태 데이터, 및 타깃 검색 기간에 따라 제1 검색 경로를 생성하는 단계 - 상공개특허 10-2021-0134724-4-기 제1 검색 경로는 상기 타깃 검색 기간을 더 포함하고, 상기 타깃 검색 기간은 상기 제1 상태를 상기 제2 상태로 변환하는 데 필요한 기간임 -를 포함하는, 데이터 검색 방법."}
{"patent_id": "10-2021-7031511", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항 내지 제7항 중 어느 한 항에 있어서,상기 복수의 후보 데이터는 서로 다른 유형을 갖고, 상기 검색 조건은 타깃 유형을 포함하고, 상기 제2 검색 경로를 사용하여 상기 타깃 데이터에 대한 복수의 후보 데이터를 검색하는 단계는:상기 제2 검색 경로를 사용하여 상기 타깃 유형을 만족하는 상기 타깃 데이터에 대한 상기 복수의 후보 데이터를 검색하는 단계를 포함하는, 데이터 검색 방법."}
{"patent_id": "10-2021-7031511", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "데이터 검색 장치로서,복수의 검색될 후보 데이터(to-be-searched candidate data)에 따라 제1 상태 데이터 및 제2 상태 데이터를 생성하도록 구성되어 있는 상태 데이터 생성 모듈 - 상기 제1 상태 데이터에 대응하는 제1 상태는 상기 복수의 후보 데이터가 동일한 선택 확률(selection probability)을 갖는 상태이고, 상기 제2 상태 데이터에 대응하는 제2상태는 검색 조건을 만족하는 타깃 데이터가 발견된 상태임 - ;상기 제1 상태 데이터 및 상기 제2 상태 데이터에 따라 제1 검색 경로를 생성하도록 구성되어 있는 제1 경로 생성 모듈 - 상기 제1 검색 경로의 시작점은 상기 제1 상태를 나타내고, 종료점은 상기 제2 상태를 나타내며, 상기 제1 검색 경로는 값이 결정되지 않은 복수의 계수를 포함함 - ;상기 제1 검색 경로에 대응하는 제1 처리 함수를 획득하도록 구성되어 있는 제1 함수 획득 모듈 - 상기 제1 처리 함수는 복수의 계수를 포함하고, 상기 제1 처리 함수의 출력 값은 상기 제1 검색 경로에 의해 결정되며, 상기 제1 처리 함수의 출력 값의 수렴은 상기 복수의 계수의 값이 목표를 만족한다는 것을 나타냄 - ;상기 제1 검색 경로의 적어도 두 개의 값 집합을 순회하도록 구성되어 있는 집합 획득 모듈 - 각각의 값 집합은상기 복수의 계수에 대응하는 복수의 값을 포함하고, 상이한 값 집합의 복수의 값은 완전히 동일하지 않음 - ;상기 복수의 계수의 값이 각각 상기 순회된 값 집합의 복수의 값인 경우에 시뮬레이션된 양자 알고리즘에 기초하여 제1 처리 함수의 출력 값을 획득하도록 구성되어 있는 출력 값 획득 모듈;상기 제1 처리 함수의 출력 값이 수렴하는 경우, 수렴하는 출력 값에 대응하는 값 집합의 복수의 값을 상기 복수의 계수의 값으로 각각 사용하여 제2 검색 경로를 획득하도록 구성되어 있는 제2 경로 획득 모듈; 및상기 제2 검색 경로를 사용하여 상기 타깃 데이터에 대한 복수의 후보 데이터를 검색하도록 구성되어 있는 데이터 검색 모듈을 포함하는 데이터 검색 장치."}
{"patent_id": "10-2021-7031511", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 제1 처리 함수의 출력 값이 수렴하지 않는 경우, 순회한 적어도 두 개의 값 집합 및 상기 적어도 두 개의값 집합에 대응하는 제1 처리 함수의 출력 값을 획득하도록 구성되어 있는 정보 획득 모듈;상기 적어도 두 개의 값 집합 및 대응하는 출력 값에 대해 함수 피팅(function fitting)을 수행하여 제2 처리함수를 획득하도록 구성되어 있는 제2 함수 획득 모듈 - 상기 제2 처리 함수는 상기 적어도 두 개의 값 집합에대응하는 상기 출력 값의 분포를 서술하도록 구성되고, 상기 제2 처리 함수는 상기 복수의 계수를 포함함 - ;및예상 함수(expectation function)를 사용하여 업데이트된 값 집합의 복수의 값을 처리하여 획득되는 출력 값이상기 예상 함수의 최대 출력 값이 되도록 업데이트된 값 집합을 획득하도록 구성되어 있는 집합 업데이트 모듈공개특허 10-2021-0134724-5-- 상기 예상 함수는 상기 제2 처리 함수의 예상 복귀(expected return)를 설명하도록 구성됨 -을 더 포함하는 데이터 검색 장치."}
{"patent_id": "10-2021-7031511", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 제2 함수 획득 모듈은:상기 적어도 두 개의 값 집합이 가우스 분포(Gaussian distribution)를 만족하는 경우에 상기 적어도 두 개의값 집합에 대응하는 조건 확률(condition probability)을 획득하도록 구성되어 있는 확률 획득 유닛 - 상기 적어도 두 개의 값 집합에 대응하는 출력 값의 분포가 가우스 분포를 만족하는 경우에 상기 조건 확률은 상기 적어도 두 개의 값 집합 및 대응하는 출력 값에 기초하여 제2 처리 함수를 획득할 확률임 - ; 및상기 적어도 두 개의 값 집합, 상기 대응하는 출력 값, 및 상기 조건 확률에 따라 상기 획득된 제2 처리 함수를조정하여 상기 조정된 제2 처리 함수를 획득하도록 구성되어 있는 함수 조정 유닛을 포함하는 데이터 검색 장치."}
{"patent_id": "10-2021-7031511", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항에 있어서,상기 집합 업데이트 모듈은:상기 적어도 두 개의 값 집합에 대응하는 상기 제1 처리 함수의 출력 값에서 최대 출력 값을 획득하고;상기 제2 처리 함수와 상기 최대 출력 값의 차이에 따라 상기 제2 처리 함수에 대응하는 상기 예상 함수를 결정하고 - 상기 예상 함수는 상기 차이와 0 사이의 최댓값을 평균화하는 함수임 -; 그리고경사 알고리즘(gradient algorithm)을 사용하여 상기 예상 함수의 최대 출력 값에 대응하는 값 집합을 상기 업데이트된 값 집합으로 결정하도록 추가로 구성되어 있는, 데이터 검색 장치."}
{"patent_id": "10-2021-7031511", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제9항에 있어서,상기 시뮬레이션된 양자 알고리즘은 복수의 하위 함수 및 상기 복수의 하위 함수에 따라 상기 제1 처리 함수를결정하는 연산 모드를 포함하며, 상기 출력 값 획득 모듈은:상기 시뮬레이션된 양자 알고리즘에 기초하여 상기 순회된 값 집합의 복수의 값을 처리하여 상기 복수의 하위함수에 의해 출력된 제1 값을 각각 획득하도록 구성되어 있는 제1 값 획득 유닛; 및상기 연산 모드에 따라, 상기 복수의 하위 함수에 의해 출력된 상기 제1 값에 대한 연산을 수행하여 상기 제1처리 함수의 출력 값을 획득하도록 구성되어 있는 출력 값 획득 유닛을 포함하는, 데이터 검색 장치."}
{"patent_id": "10-2021-7031511", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "컴퓨터 디바이스로서,프로세서 및 메모리를 포함하며, 상기 메모리는 적어도 하나의 프로그램 코드를 저장하고, 상기 적어도 하나의프로그램 코드는 상기 프로세서에 의해 로딩되고 실행되어 제1항 내지 제8항 중 어느 한 항에 따른 시뮬레이션된 양자 알고리즘에 기초한 데이터 검색 방법에서 수행되는 연산을 실행하는, 컴퓨터 디바이스."}
{"patent_id": "10-2021-7031511", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "컴퓨터 판독 가능형 저장 매체로서,적어도 하나의 프로그램 코드를 저장하고, 상기 적어도 하나의 프로그램 코드는 프로세서에 의해 로딩되고 실행되어 제1항 내지 제8항 중 어느 한 항에 따른 시뮬레이션된 양자 알고리즘에 기초한 데이터 검색 방법에서 수행되는 연산을 실행하는, 컴퓨터 판독 가능형 저장 매체.공개특허 10-2021-0134724-6-"}
{"patent_id": "10-2021-7031511", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 출원의 실시예는 시뮬레이션된 양자 알고리즘에 기초한 데이터 검색 방법 및 장치 및 디바이스를 개시하며 컴 퓨터"}
{"patent_id": "10-2021-7031511", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "에 속한다. 상기 방법은: 복수의 검색될 후보 데이터(to-be-searched candidate data)에 따라 제 1 검색 경로를 생성하는 단계, 상기 제1 검색 경로에 대응하는 제1 처리 함수를 획득하는 단계, 상기 제1 검색 (뒷면에 계속) 대 표 도 - 도1"}
{"patent_id": "10-2021-7031511", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 2, "content": "공개특허10-2021-0134724 경로의 적어도 두 개의 값 집합을 순회하는 단계, 상기 제1 처리 함수의 출력 값이 수렴하는 경우, 수렴하는 출 력 값에 대응하는 값 집합의 복수의 값을 상기 복수의 계수의 값으로 각각 사용하여, 시뮬레이션된 양자 알고리 즘에 기초하여 제1 처리 함수의 출력 값을 획득하여, 제2 검색 경로를 획득하는 단계, 및 상기 제2 검색 경로를 사용하여 상기 타깃 데이터를 검색하는 단계를 포함한다. 상기 적어도 두 개의 값 집합이 순회하고, 순회한 값 집합에 대응하는 출력 값이 획득되므로, 비교적 적은 순회 횟수를 통해 복수의 계수의 정확한 값이 신속하게 획 득될 수 있으며, 이에 의해 제2 검색 경로를 획득하는 효율성이 향상되고 제2 검색 경로를 사용하여 타깃 데이터 가 신속하게 발견될 수 있다. CPC특허분류 G06N 10/00 (2019.01) 발명자 천 유친 중국 518057 광동 센젠 난산 디스트릭트 미드웨스 트 디스트릭트 오브 하이-테크 파크 커지중이 로드 텐센트 빌딩 35층장 성유 중국 518057 광동 센젠 난산 디스트릭트 미드웨스 트 디스트릭트 오브 하이-테크 파크 커지중이 로드 텐센트 빌딩 35층명 세 서 청구범위 청구항 1 컴퓨터 디바이스에 적용 가능한 시뮬레이션된 양자 알고리즘에 기초한 데이터 검색 방법으로서, 복수의 검색될 후보 데이터(to-be-searched candidate data)에 따라 제1 상태 데이터 및 제2 상태 데이터를 생 성하는 단계 - 상기 제1 상태 데이터에 대응하는 제1 상태는 상기 복수의 후보 데이터가 동일한 선택 확률 (selection probability)을 갖는 상태이고, 상기 제2 상태 데이터에 대응하는 제2 상태는 검색 조건을 만족하는 타깃 데이터가 발견된 상태임 - ; 상기 제1 상태 데이터 및 상기 제2 상태 데이터에 따라 제1 검색 경로를 생성하는 단계 - 상기 제1 검색 경로의 시작점은 상기 제1 상태를 나타내고, 종료점은 상기 제2 상태를 나타내며, 상기 제1 검색 경로는 값이 결정되지 않은 복수의 계수를 포함함 - ; 상기 제1 검색 경로에 대응하는 제1 처리 함수를 획득하는 단계 - 상기 제1 처리 함수는 복수의 계수를 포함하 고, 상기 제1 처리 함수의 출력 값은 상기 제1 검색 경로에 의해 결정되며, 상기 제1 처리 함수의 출력 값의 수 렴은 상기 복수의 계수의 값이 목표를 만족한다는 것을 나타냄 - ; 상기 제1 검색 경로의 적어도 두 개의 값 집합을 순회하는 단계 - 각각의 값 집합은 상기 복수의 계수에 대응하 는 복수의 값을 포함하고, 상이한 값 집합의 복수의 값은 완전히 동일하지 않음 - ; 상기 복수의 계수의 값이 각각 상기 순회된 값 집합의 복수의 값인 경우에 시뮬레이션된 양자 알고리즘에 기초 하여 제1 처리 함수의 출력 값을 획득하는 단계; 상기 제1 처리 함수의 출력 값이 수렴하는 경우, 수렴하는 출력 값에 대응하는 값 집합의 복수의 값을 상기 복 수의 계수의 값으로 각각 사용하여 제2 검색 경로를 획득하는 단계; 및 상기 제2 검색 경로를 사용하여 상기 타깃 데이터에 대한 복수의 후보 데이터를 검색하는 단계 를 포함하는 데이터 검색 방법. 청구항 2 제1항에 있어서, 상기 복수의 계수의 값이 각각 상기 순회된 값 집합의 복수의 값인 경우 시뮬레이션된 양자 알고리즘에 기초하 여 제1 처리 함수의 출력 값을 획득하는 단계 이후에, 상기 데이터 검색 방법은: 상기 제1 처리 함수의 출력 값이 수렴하지 않는 경우, 순회한 적어도 두 개의 값 집합 및 상기 적어도 두 개의 값 집합에 대응하는 제1 처리 함수의 출력 값을 획득하는 단계; 상기 적어도 두 개의 값 집합 및 대응하는 출력 값에 대해 함수 피팅(function fitting)을 수행하여 제2 처리 함수를 획득하는 단계 - 상기 제2 처리 함수는 상기 적어도 두 개의 값 집합에 대응하는 상기 출력 값의 분포를 서술하도록 구성되고, 상기 제2 처리 함수는 상기 복수의 계수를 포함함 - ; 및 예상 함수(expectation function)를 사용하여 업데이트된 값 집합의 복수의 값을 처리하여 획득되는 출력 값이 상기 예상 함수의 최대 출력 값이 되도록 업데이트된 값 집합을 획득하는 단계 - 상기 예상 함수는 상기 제2 처 리 함수의 예상 복귀(expected return)를 설명하도록 구성됨 - 를 더 포함하는 데이터 검색 방법. 청구항 3 제2항에 있어서, 상기 적어도 두 개의 값 집합 및 대응하는 출력 값에 대해 함수 피팅(function fitting)을 수행하여 제2 처리 함수를 획득하는 단계는:상기 적어도 두 개의 값 집합이 가우스 분포(Gaussian distribution)를 만족하는 경우에 상기 적어도 두 개의 값 집합에 대응하는 조건 확률(condition probability)을 획득하는 단계 - 상기 적어도 두 개의 값 집합에 대응 하는 출력 값의 분포가 가우스 분포를 만족하는 경우에 상기 조건 확률은 상기 적어도 두 개의 값 집합 및 대응 하는 출력 값에 기초하여 제2 처리 함수를 획득할 확률임 - ; 및 상기 적어도 두 개의 값 집합, 상기 대응하는 출력 값, 및 상기 조건 확률에 따라 상기 획득된 제2 처리 함수를 조정하여 상기 조정된 제2 처리 함수를 획득하는 단계 를 포함하는, 데이터 검색 방법. 청구항 4 제2항에 있어서, 예상 함수를 사용하여 업데이트된 값 집합의 복수의 값을 처리하여 획득되는 출력 값이 상기 예상 함수의 최대 출력 값이 되도록 업데이트된 값 집합을 획득하는 단계는: 상기 적어도 두 개의 값 집합에 대응하는 상기 제1 처리 함수의 출력 값에서 최대 출력 값을 획득하는 단계; 상기 제2 처리 함수와 상기 최대 출력 값의 차이에 따라 상기 제2 처리 함수에 대응하는 상기 예상 함수를 결정 하는 단계 - 상기 예상 함수는 상기 차이와 0 사이의 최댓값을 평균화하는 함수임 -; 및 경사 알고리즘(gradient algorithm)을 사용하여 상기 예상 함수의 최대 출력 값에 대응하는 값 집합을 상기 업 데이트된 값 집합으로 결정하는 단계 를 포함하는, 데이터 검색 방법. 청구항 5 제3항에 있어서, 상기 적어도 두 개의 값 집합이 가우스 분포를 만족하는 경우에 상기 적어도 두 개의 값 집합에 대응하는 조건 확률을 획득하는 단계는: 상기 적어도 두 개의 값 집합이 상기 가우스 분포를 만족하는 경우에 상기 적어도 두 개의 값 집합에 대응하는 평균값 및 분산을 획득하는 단계; 및 상기 평균값 및 상기 분산에 따라 상기 적어도 두 개의 값 집합에 대응하는 조건 확률을 획득하는 단계 를 포함하는, 데이터 검색 방법. 청구항 6 제1항에 있어서, 상기 시뮬레이션된 양자 알고리즘은 복수의 하위 함수 및 상기 복수의 하위 함수에 따라 상기 제1 처리 함수를 결정하는 연산 모드를 포함하며, 상기 복수의 계수의 값이 각각 상기 순회된 값 집합의 복수의 값인 경우에 시 뮬레이션된 양자 알고리즘에 기초하여 제1 처리 함수의 출력 값을 획득하는 단계는: 상기 시뮬레이션된 양자 알고리즘에 기초하여 상기 순회된 값 집합의 복수의 값을 처리하여 상기 복수의 하위 함수에 의해 출력된 제1 값을 각각 획득하는 단계; 및 상기 연산 모드에 따라, 상기 복수의 하위 함수에 의해 출력된 상기 제1 값에 대한 연산을 수행하여 상기 제1 처리 함수의 출력 값을 획득하는 단계 를 포함하는, 데이터 검색 방법. 청구항 7 제1항에 있어서, 상기 제1 상태 데이터 및 상기 제2 상태 데이터에 따라 제1 검색 경로를 생성하는 단계는: 상기 제1 상태 데이터, 상기 제2 상태 데이터, 및 타깃 검색 기간에 따라 제1 검색 경로를 생성하는 단계 - 상기 제1 검색 경로는 상기 타깃 검색 기간을 더 포함하고, 상기 타깃 검색 기간은 상기 제1 상태를 상기 제2 상 태로 변환하는 데 필요한 기간임 - 를 포함하는, 데이터 검색 방법. 청구항 8 제1항 내지 제7항 중 어느 한 항에 있어서, 상기 복수의 후보 데이터는 서로 다른 유형을 갖고, 상기 검색 조건은 타깃 유형을 포함하고, 상기 제2 검색 경 로를 사용하여 상기 타깃 데이터에 대한 복수의 후보 데이터를 검색하는 단계는: 상기 제2 검색 경로를 사용하여 상기 타깃 유형을 만족하는 상기 타깃 데이터에 대한 상기 복수의 후보 데이터 를 검색하는 단계 를 포함하는, 데이터 검색 방법. 청구항 9 데이터 검색 장치로서, 복수의 검색될 후보 데이터(to-be-searched candidate data)에 따라 제1 상태 데이터 및 제2 상태 데이터를 생 성하도록 구성되어 있는 상태 데이터 생성 모듈 - 상기 제1 상태 데이터에 대응하는 제1 상태는 상기 복수의 후 보 데이터가 동일한 선택 확률(selection probability)을 갖는 상태이고, 상기 제2 상태 데이터에 대응하는 제2 상태는 검색 조건을 만족하는 타깃 데이터가 발견된 상태임 - ; 상기 제1 상태 데이터 및 상기 제2 상태 데이터에 따라 제1 검색 경로를 생성하도록 구성되어 있는 제1 경로 생 성 모듈 - 상기 제1 검색 경로의 시작점은 상기 제1 상태를 나타내고, 종료점은 상기 제2 상태를 나타내며, 상 기 제1 검색 경로는 값이 결정되지 않은 복수의 계수를 포함함 - ; 상기 제1 검색 경로에 대응하는 제1 처리 함수를 획득하도록 구성되어 있는 제1 함수 획득 모듈 - 상기 제1 처 리 함수는 복수의 계수를 포함하고, 상기 제1 처리 함수의 출력 값은 상기 제1 검색 경로에 의해 결정되며, 상 기 제1 처리 함수의 출력 값의 수렴은 상기 복수의 계수의 값이 목표를 만족한다는 것을 나타냄 - ; 상기 제1 검색 경로의 적어도 두 개의 값 집합을 순회하도록 구성되어 있는 집합 획득 모듈 - 각각의 값 집합은 상기 복수의 계수에 대응하는 복수의 값을 포함하고, 상이한 값 집합의 복수의 값은 완전히 동일하지 않음 - ; 상기 복수의 계수의 값이 각각 상기 순회된 값 집합의 복수의 값인 경우에 시뮬레이션된 양자 알고리즘에 기초 하여 제1 처리 함수의 출력 값을 획득하도록 구성되어 있는 출력 값 획득 모듈; 상기 제1 처리 함수의 출력 값이 수렴하는 경우, 수렴하는 출력 값에 대응하는 값 집합의 복수의 값을 상기 복 수의 계수의 값으로 각각 사용하여 제2 검색 경로를 획득하도록 구성되어 있는 제2 경로 획득 모듈; 및 상기 제2 검색 경로를 사용하여 상기 타깃 데이터에 대한 복수의 후보 데이터를 검색하도록 구성되어 있는 데이 터 검색 모듈 을 포함하는 데이터 검색 장치. 청구항 10 제9항에 있어서, 상기 제1 처리 함수의 출력 값이 수렴하지 않는 경우, 순회한 적어도 두 개의 값 집합 및 상기 적어도 두 개의 값 집합에 대응하는 제1 처리 함수의 출력 값을 획득하도록 구성되어 있는 정보 획득 모듈; 상기 적어도 두 개의 값 집합 및 대응하는 출력 값에 대해 함수 피팅(function fitting)을 수행하여 제2 처리 함수를 획득하도록 구성되어 있는 제2 함수 획득 모듈 - 상기 제2 처리 함수는 상기 적어도 두 개의 값 집합에 대응하는 상기 출력 값의 분포를 서술하도록 구성되고, 상기 제2 처리 함수는 상기 복수의 계수를 포함함 - ; 및 예상 함수(expectation function)를 사용하여 업데이트된 값 집합의 복수의 값을 처리하여 획득되는 출력 값이 상기 예상 함수의 최대 출력 값이 되도록 업데이트된 값 집합을 획득하도록 구성되어 있는 집합 업데이트 모듈- 상기 예상 함수는 상기 제2 처리 함수의 예상 복귀(expected return)를 설명하도록 구성됨 - 을 더 포함하는 데이터 검색 장치. 청구항 11 제10항에 있어서, 상기 제2 함수 획득 모듈은: 상기 적어도 두 개의 값 집합이 가우스 분포(Gaussian distribution)를 만족하는 경우에 상기 적어도 두 개의 값 집합에 대응하는 조건 확률(condition probability)을 획득하도록 구성되어 있는 확률 획득 유닛 - 상기 적 어도 두 개의 값 집합에 대응하는 출력 값의 분포가 가우스 분포를 만족하는 경우에 상기 조건 확률은 상기 적 어도 두 개의 값 집합 및 대응하는 출력 값에 기초하여 제2 처리 함수를 획득할 확률임 - ; 및 상기 적어도 두 개의 값 집합, 상기 대응하는 출력 값, 및 상기 조건 확률에 따라 상기 획득된 제2 처리 함수를 조정하여 상기 조정된 제2 처리 함수를 획득하도록 구성되어 있는 함수 조정 유닛 을 포함하는 데이터 검색 장치. 청구항 12 제10항에 있어서, 상기 집합 업데이트 모듈은: 상기 적어도 두 개의 값 집합에 대응하는 상기 제1 처리 함수의 출력 값에서 최대 출력 값을 획득하고; 상기 제2 처리 함수와 상기 최대 출력 값의 차이에 따라 상기 제2 처리 함수에 대응하는 상기 예상 함수를 결정 하고 - 상기 예상 함수는 상기 차이와 0 사이의 최댓값을 평균화하는 함수임 -; 그리고 경사 알고리즘(gradient algorithm)을 사용하여 상기 예상 함수의 최대 출력 값에 대응하는 값 집합을 상기 업 데이트된 값 집합으로 결정하도록 추가로 구성되어 있는, 데이터 검색 장치. 청구항 13 제9항에 있어서, 상기 시뮬레이션된 양자 알고리즘은 복수의 하위 함수 및 상기 복수의 하위 함수에 따라 상기 제1 처리 함수를 결정하는 연산 모드를 포함하며, 상기 출력 값 획득 모듈은: 상기 시뮬레이션된 양자 알고리즘에 기초하여 상기 순회된 값 집합의 복수의 값을 처리하여 상기 복수의 하위 함수에 의해 출력된 제1 값을 각각 획득하도록 구성되어 있는 제1 값 획득 유닛; 및 상기 연산 모드에 따라, 상기 복수의 하위 함수에 의해 출력된 상기 제1 값에 대한 연산을 수행하여 상기 제1 처리 함수의 출력 값을 획득하도록 구성되어 있는 출력 값 획득 유닛 을 포함하는, 데이터 검색 장치. 청구항 14 컴퓨터 디바이스로서, 프로세서 및 메모리를 포함하며, 상기 메모리는 적어도 하나의 프로그램 코드를 저장하고, 상기 적어도 하나의 프로그램 코드는 상기 프로세서에 의해 로딩되고 실행되어 제1항 내지 제8항 중 어느 한 항에 따른 시뮬레이션 된 양자 알고리즘에 기초한 데이터 검색 방법에서 수행되는 연산을 실행하는, 컴퓨터 디바이스. 청구항 15 컴퓨터 판독 가능형 저장 매체로서, 적어도 하나의 프로그램 코드를 저장하고, 상기 적어도 하나의 프로그램 코드는 프로세서에 의해 로딩되고 실행 되어 제1항 내지 제8항 중 어느 한 항에 따른 시뮬레이션된 양자 알고리즘에 기초한 데이터 검색 방법에서 수행 되는 연산을 실행하는, 컴퓨터 판독 가능형 저장 매체.발명의 설명 기 술 분 야 본 출원은 2020년 4월 26일에 출원되고 발명의 명칭이 \"시뮬레이션된 양자 알고리즘에 기초한 데이터 검색 방법 및 장치 및 디바이스\"인 중국 특허 출원 번호 202010337586.6에 대한 우선권을 주장하며, 이 문헌은 그 전문이 참조로 여기에 포함된다. 본 출원의 실시예는 컴퓨터 기술 분야에 관한 것으로, 특히 시뮬레이션된 양자 알고리즘에 기초한 데이터 검색 방법 및 장치, 및 디바이스에 관한 것이다."}
{"patent_id": "10-2021-7031511", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "양자 컴퓨팅 기술의 발전과 함께 양자 컴퓨팅의 적용도 증가하고 있다. 기존 컴퓨팅과 비교할 때 양자 컴퓨팅은 데이터 처리 효율성을 크게 향상시킨다. 양자 컴퓨팅의 단열 양자 컴퓨팅(adiabatic quantum computing, AQC)에 서는 검색 경로를 사용하여 데이터를 처리하며, 정확한 검색 경로는 AQC의 효율성을 높일 수 있다. 본 출원의 실시예는 시뮬레이션된 양자 알고리즘에 기초한 데이터 검색 방법 및 장치, 및 디바이스를 제공한다. 기술 솔루션은 다음과 같다: 관점에 따라, 시뮬레이션된 양자 알고리즘에 기초한 데이터 검색 방법이 제공되며, 상기 방법은: 복수의 검색될 후보 데이터(to-be-searched candidate data)에 따라 제1 상태 데이터 및 제2 상태 데이터를 생 성하는 단계 - 상기 제1 상태 데이터에 대응하는 제1 상태는 상기 복수의 후보 데이터가 동일한 선택 확률 (selection probability)을 갖는 상태이고, 상기 제2 상태 데이터에 대응하는 제2 상태는 검색 조건을 만족하는 타깃 데이터가 발견된 상태임 - ; 상기 제1 상태 데이터 및 상기 제2 상태 데이터에 따라 제1 검색 경로를 생성하는 단계 - 상기 제1 검색 경로의 시작점은 상기 제1 상태를 나타내고, 종료점은 상기 제2 상태를 나타내며, 상기 제1 검색 경로는 값이 결정되지 않은 복수의 계수를 포함함 - ; 상기 제1 검색 경로에 대응하는 제1 처리 함수를 획득하는 단계 - 상기 제1 처리 함수는 복수의 계수를 포함하 고, 상기 제1 처리 함수의 출력 값은 상기 제1 검색 경로에 의해 결정되며, 상기 제1 처리 함수의 출력 값의 수 렴은 상기 복수의 계수의 값이 목표를 만족한다는 것을 나타냄 - ; 상기 제1 검색 경로의 적어도 두 개의 값 집합을 순회하는 단계 - 각각의 값 집합은 상기 복수의 계수에 대응하 는 복수의 값을 포함하고, 상이한 값 집합의 복수의 값은 완전히 동일하지 않음 - ; 상기 복수의 계수의 값이 각각 상기 순회된 값 집합의 복수의 값인 경우에 시뮬레이션된 양자 알고리즘에 기초 하여 제1 처리 함수의 출력 값을 획득하는 단계; 상기 제1 처리 함수의 출력 값이 수렴하는 경우, 수렴하는 출력 값에 대응하는 값 집합의 복수의 값을 상기 복 수의 계수의 값으로 각각 사용하여 제2 검색 경로를 획득하는 단계; 및 상기 제2 검색 경로를 사용하여 상기 타깃 데이터에 대한 복수의 후보 데이터를 검색하는 단계 를 포함한다. 다른 관점에 따라, 데이터 검색 장치로서, 상기 장치는: 복수의 검색될 후보 데이터(to-be-searched candidate data)에 따라 제1 상태 데이터 및 제2 상태 데이터를 생 성하도록 구성되어 있는 상태 데이터 생성 모듈 - 상기 제1 상태 데이터에 대응하는 제1 상태는 상기 복수의 후 보 데이터가 동일한 선택 확률(selection probability)을 갖는 상태이고, 상기 제2 상태 데이터에 대응하는 제2 상태는 검색 조건을 만족하는 타깃 데이터가 발견된 상태임 - ; 상기 제1 상태 데이터 및 상기 제2 상태 데이터에 따라 제1 검색 경로를 생성하도록 구성되어 있는 제1 경로 생 성 모듈 - 상기 제1 검색 경로의 시작점은 상기 제1 상태를 나타내고, 종료점은 상기 제2 상태를 나타내며, 상 기 제1 검색 경로는 값이 결정되지 않은 복수의 계수를 포함함 - ;상기 제1 검색 경로에 대응하는 제1 처리 함수를 획득하도록 구성되어 있는 제1 함수 획득 모듈 - 상기 제1 처 리 함수는 복수의 계수를 포함하고, 상기 제1 처리 함수의 출력 값은 상기 제1 검색 경로에 의해 결정되며, 상 기 제1 처리 함수의 출력 값의 수렴은 상기 복수의 계수의 값이 목표를 만족한다는 것을 나타냄 - ; 상기 제1 검색 경로의 적어도 두 개의 값 집합을 순회하도록 구성되어 있는 집합 획득 모듈 - 각각의 값 집합은 상기 복수의 계수에 대응하는 복수의 값을 포함하고, 상이한 값 집합의 복수의 값은 완전히 동일하지 않음 - ; 상기 복수의 계수의 값이 각각 상기 순회된 값 집합의 복수의 값인 경우에 시뮬레이션된 양자 알고리즘에 기초 하여 제1 처리 함수의 출력 값을 획득하도록 구성되어 있는 출력 값 획득 모듈; 상기 제1 처리 함수의 출력 값이 수렴하는 경우, 수렴하는 출력 값에 대응하는 값 집합의 복수의 값을 상기 복 수의 계수의 값으로 각각 사용하여 제2 검색 경로를 획득하도록 구성되어 있는 제2 경로 획득 모듈; 및 상기 제2 검색 경로를 사용하여 상기 타깃 데이터에 대한 복수의 후보 데이터를 검색하도록 구성되어 있는 데이 터 검색 모듈 을 포함한다. 다른 가능한 구현에서, 상기 확률 획득 유닛은: 상기 적어도 두 개의 값 집합이 상기 가우스 분포를 만족하는 경우에 상기 적어도 두 개의 값 집합에 대응하는 평균값 및 분산을 획득하고; 그리고 상기 평균값 및 상기 분산에 따라 상기 적어도 두 개의 값 집합에 대응하는 조건 확률을 획득하도록 추가로 구 성되어 있다. 다른 가능한 구현에서, 상기 제1 경로 생성 모듈은: 상기 제1 상태 데이터, 상기 제2 상태 데이터, 및 타깃 검색 기간에 따라 제1 검색 경로를 생성하도록 추가로 구성되어 있으며, 상기 제1 검색 경로는 상기 타깃 검색 기간을 더 포함하고, 상기 타깃 검색 기간은 상기 제1 상태를 상기 제2 상태로 변환하는 데 필요한 기간이다. 다른 가능한 구현에서, 상기 복수의 후보 데이터는 서로 다른 유형을 갖고, 상기 검색 조건은 타깃 유형을 포함 하고, 상기 데이터 검색 모듈은: 상기 제2 검색 경로를 사용하여 상기 타깃 유형을 만족하는 상기 타깃 데이터에 대한 상기 복수의 후보 데이터 를 검색하도록 추가로 구성되어 있다. 다른 관점에 따라, 컴퓨터 디바이스가 제공되며, 프로세서 및 메모리를 포함하며, 상기 메모리는 적어도 하나의 프로그램 코드를 저장하고, 상기 적어도 하나의 프로그램 코드는 상기 프로세서에 의해 로딩되고 시뮬레이션된 양자 알고리즘에 기초한 데이터 검색 방법에서 수행되는 연산을 실행한다. 다른 관점에 따라, 컴퓨터 판독 가능형 저장 매체가 제공되며, 적어도 하나의 프로그램 코드를 저장하고, 상기 적어도 하나의 프로그램 코드는 상기 프로세서에 의해 로딩되고 실행되어 시뮬레이션된 양자 알고리즘에 기초한 데이터 검색 방법에서 수행되는 연산을 실행한다."}
{"patent_id": "10-2021-7031511", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 출원의 실시예의 목적, 기술적 솔루션 및 이점을 보다 명확하게 하기 위해, 이하에서는 첨부된 도면을 참조 하여 본 출원의 구현을 상세히 설명한다. 본 출원에서 사용된 \"제1\", \"제2\", \"제3\" 등의 용어는 본 명세서의 다양한 개념을 설명하기 위해 사용될 수 있 음을 이해할 수 있을 것이다. 다만, 특별한 언급이 없는 한 그 개념이 그 용어에 의하여 한정되는 것은 아니다. 용어는 단지 한 개념을 다른 개념과 구별하기 위해 사용된다. 예를 들어, 본 출원의 권리 범위를 벗어나지 않으 면서, 제1 처리 함수는 제2 처리 함수로 명명될 수 있고, 제2 처리 함수는 제1 처리 함수으로 명명될 수 있다. 본 출원에서 사용되는 \"각각\", \"복수\" 등의 용어에 있어서, \"복수\"는 둘 이상을 포함하고, \"각각\"은 \"복수의 대 응하는 것 각각\"을 의미한다. 예를 들어, 복수의 계수는 20 개의 계수를 포함하고, 각 계수는 20 개의 계수 각 각을 참조한다. 본 출원의 실시예에서 제공되는 시뮬레이션된 양자 알고리즘을 기반으로 하는 데이터 검색 방법의 이해를 용이 하게 하기 위해 관련된 키워드가 아래에 설명된다. 양자 컴퓨팅(Quantum computing): 양자 논리를 기반으로 계산을 수행하는 컴퓨팅 모드. 양자 컴퓨팅에서 데이터 저장의 기본 단위는 양자 비트(qubit)이다. 큐빗(Qubit): 양자 컴퓨팅의 기본 단위. 고전 컴퓨팅에서 0과 1은 이진법의 기본 단위로 사용된다. 따라서 고전 컴퓨팅을 사용하여 데이터를 연산하는 과정에서 데이터의 상태는 0 또는 1이다. 그러나 양자 컴퓨팅에서 데이터 는 0과 1이 모두 될 수 있다. 즉, 양자 컴퓨팅에서 0과 1은 공존할 수 있다. 즉, 0과 1의 선형 중첩 상태 (linear superposition state)가 존재한다. 이와 같은 방식으로 양자 컴퓨팅에 선형 중첩 상태가 존재하기 때문 에 기존 컴퓨팅에 비해 양자 컴퓨팅은 컴퓨팅 속도와 가능성을 향상시킬 수 있다. 선형 중첩 상태는 식 로 나타낼 수 있다:"}
{"patent_id": "10-2021-7031511", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기서 는 선형 중첩 상태를 나타내고, α는 데이터 상태가 0일 때의 확률 진폭을 나타내고, β는 데이터 상태가 1일 때 확률 진폭을 나타내며, α와 β는 모두 복소수이다. 따라서 α의 모듈러스 제곱 |α|2는 데이터의 상태가 0일 확률을 나타내는 데 사용되며, β의 모듈러스 제곱 |β|2는 데이터의 상태가 1일 확률을 나타내는 데 사용된다. 고유 상태(eigenstate): 에르미트 켤레 행렬(Hermitian conjugate matrix) H의 경우 식 에 대한 해를 H의 고유 상태(eigenstate) 라고 하며, 여기서 는 에너지 고유값 E를 갖는다. 기저 상태(ground state): 가장 낮은 에너지 고유 상태. 분리 가능 상태와 얽힌 상태(Separable state and entangled state): 순수 상태 의 경우: 를 로 분해할 수 있으면 순수 상태를 분리 가능 상태라고 하며, 를 로 분 해할 수 없으면 순수 상태를 얽힌 상태라고 한다. 단열 양자 컴퓨팅(Adiabatic quantum computing, AQC): 양자 컴퓨팅 모드. 수학적 정의는 다음과 같다: 초기 상태 Hamiltonian H0 및 최종 상태 Hamiltonian H1에 대해 n 개의 입자에 작용하며, 각 입자는 p 개의 상태와 k-국소성(k-locality)을 가지며, 여기서 초기 상태 Hamiltonian H0의 기저 상태는 유일한 분리 가능 상태이고, 놈(norm) L2의 작용 하에 초기 상태 Hamiltonian의 출력 상태가 최종 상태 Hamiltonian H1의 기저 상태에 접근 하는 과정을 AQC라고 한다. Hamiltonian은 양자 시스템의 총 에너지를 설명하는 데 사용되며, 초기 상태 Hamiltonian은 양자 시스템의 초기 총 에너지이며, 최종 상태 Hamiltonian은 양자 시스템의 최종 총 에너지이다. 놈 L2는 모든 요소의 제곱의 합을 구한 후 획득된 제곱근이다. 검색 경로에 대응하는 함수 s(t)=1-t/T가 정의되고, t의 값 범위는 [0,T]이며, T는 양자 시스템의 진화 시간이 다. 양자 시스템은 시간 종속 해밀턴(Hamiltonian) H(s)에 따라 초기 상태 Hamiltonian H0의 기저 상태에서 진 화하기 시작하고, 마지막으로 초기 상태 Hamiltonian H0의 출력 상태가 놈 L2의 작용에 따라 최종 상태 Hamiltonian H1의 기저 상태에 접근한다. 이 프로세스가 AQC이다. 시간 종속 Hamiltonian은 H(s)=sH0+(1- s)H1이고, s는 정의된 함수 s(t)이다. 충실도(Fidelity): 충실도는 AQC 동안 출력 상태와 최종 상태 Hamiltonian H1의 기저 상태 사이의 유사성을 나 타내는 데 사용된다. 출력 상태가 최종 상태 Hamiltonian H1의 기저 상태에 가까울수록 더 높은 충실도를 나타 내며, 충실도의 값 범위는 0 내지 1이다. 최적 검색 경로(Optimal search path): 고정된 진화 시간 T에 대해 함수 s(t)를 구하여 진화 시간 T를 식 에 대입하여 최솟값을 출력한다. 식 은 슈뢰딩거 방정식의 식이다. 슈뢰딩거 방정식은 양자 컴퓨팅의 기본 방정식으로, 양자 시스템에서 양자 역학을 설명하는 데 사용된다. 본 출원의 실시예에서, 최적 검색 경로를 획득하는 문제를 식 및 식 에 대한 해를 획득하는 문제로 변환 하면, 최적 검색 경로는 다음 식 및 식 에 대한 해이다:"}
{"patent_id": "10-2021-7031511", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "여기서 는 열 벡터이고, 는 열 벡터에 대응하는 에르미트 켤레 행 벡터이고 두 벡터는 양자 시 스템에서 양자 순수 상태를 나타내는 데 사용된다. 는 의 1차 편도함수를 획득하는 것을 나타 내고; H1 및 H0은 두 개의 알려진 파라미터이고; i는 허수 단위이고; t = 0일 때 이고, 는 초기 상태 Hamiltonian H0의 기저 상태를 나타낸다. 도 1은 본 출원의 실시예에 따른 시뮬레이션된 양자 알고리즘에 기초하여 검색 경로를 획득하기 위한 방법의 흐 름도이다. 이 출원의 이 실시예는 컴퓨터 디바이스에 의해 실행된다. 가능한 구현에서, 컴퓨터 디바이스는 고전 적인 컴퓨터 디바이스이다. 선택적으로 컴퓨터 디바이스는 단말이다. 상기 단말은 휴대 단말, 포켓 사이즈 단말, 핸드헬드 단말, 또는 다른 유형의 단말, 예를 들어, 휴대폰, 컴퓨터, 태블릿 컴퓨터, 노트북 컴퓨터, 데 스크탑 컴퓨터, 스마트 스피커, 또는 스마트워치를 포함하나 이에 제한되지 않는다. 선택적으로 컴퓨터 디바이 스는 서버이다. 서버는 독립된 물리적 서버이거나, 복수의 물리적 서버를 포함하는 서버 클러스터 또는 분산 시 스템이거나, 클라우드 서비스, 클라우드 데이터베이스, 클라우드 컴퓨팅, 클라우드 기능, 클라우드 스토리지, 네트워크 서비스, 클라우드 통신, 미들웨어 서비스, 도메인 네임 서비스, 보안 서비스, 콘텐츠 전송 네트워크 (content delivery network, CDN), 빅데이터, 인공지능 플랫폼을 포함하는 클라우드 서버이다. 다른 가능한 구 현에서, 컴퓨터 디바이스는 양자 컴퓨터 디바이스이다. 양자 컴퓨터 디바이스는 고속의 수학적, 논리적 연산을 수행하고 양자 역학의 법칙에 따라 양자 정보를 저장 및 처리하는 일종의 물리적 장치이다. 양자 컴퓨터 디바이스의 특징은 주로 상대적으로 높은 연산 속도, 상대적으로 강력한 정보 처리 능력, 더 넓은 적용 범위 등을 포 함한다. 양자 컴퓨터 디바이스가 처리하는 정보가 많을수록 양자 컴퓨터 디바이스가 연산을 수행하는 것이 유리 하므로 연산의 정확성을 확보할 가능성이 더 크다. 도 1을 참조하면, 방법에는 다음 단계가 포함된다: 101. 컴퓨터 디바이스는 값이 결정되지 않은 복수의 계수를 포함하는 제1 검색 경로를 획득한다. 본 출원의 이 실시예에서, 제1 검색 경로의 표현 형태가 결정되고, 복수의 계수 간의 관계가 결정되고, 독립 변 수가 결정되고, 독립 변수와 복수의 계수 간의 관계가 결정된다. 그렇지만, 복수의 계수의 값은 아직 결정되지 않았다. 선택적으로, 복수의 계수의 값은 임의의 값이고, 제1 검색 경로에 대응하는 상이한 검색 경로는 복수의 계수에 대해 상이한 값을 설정함으로써 획득될 수 있다. 가능한 구현에서 제1 검색 경로는 s(t)=1-t/T로 정의되고 제1 검색 경로에 대해 푸리에 변환을 수행하여 다음 공식 와 같은 검색 경로를 얻는다:"}
{"patent_id": "10-2021-7031511", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "여기서 T는 진화 시간, t는 독립 변수, bj는 값이 결정되지 않은 계수, j의 값 범위는 1 내지 양의 무한대이고, j는 양의 정수이다. 식 4는 주파수 영역에서 제1 검색 경로를 표현한 형태이다. AQC 동안 고주파 진동이 양자 상태를 간섭하여 양자 상태에서 더 높은 에너지의 여기 상태로 변경될 가능성이 있지만 AQC에서는 양자 상태를 더 낮은 에너지 기저 상태로 변경해야 한다. 따라서, 고주파수 절단(high-frequency truncation)은 M의 주파수로 수행되어야 한다. 즉, 상기 식 4에서 j의 값 범위는 더 이상 1 내지 양의 무한대가 아니라 1에서 M까지이다. 선택적으로, M은 모 든 저주파 주파수, 예를 들어 기준 저주파 주파수보다 작은 값이고 M은 양의 정수이다. 따라서 다음 식 는 최종적으로 획득한 제1 검색 경로이며 제1 검색 경로에서 M 개의 계수 값을 결정해야 한 다."}
{"patent_id": "10-2021-7031511", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "본 출원의 본 실시예는 상기 식 5에 나타낸 제1 검색 경로를 예로 들어 설명한다. 다른 실시예에서, 제1 검색 경로는 다른 표현 형태를 갖는다. 제1 검색 경로의 표현 형태는 본 출원의 이 실시예에서 제한되지 않는다. 102. 컴퓨터 디바이스는 제1 검색 경로에 대응하는 제1 처리 함수를 획득한다. 본 출원의 이 실시예에서, 제1 처리 함수와 제1 검색 경로 사이에 연관이 존재한다. 선택적으로, 제1 처리 함수 는 제1 검색 경로에서 얻고 다른 함수는 연산을 통해 얻는다. 즉, 제1 처리 함수의 출력 값은 제1 검색 경로에 의해 결정된다. 제1 처리 함수의 표현 형태가 결정되었고, 제1 검색 경로에 포함된 값이 결정되지 않은 복수의 계수를 제외한 제1 처리 함수의 모든 계수의 값이 결정되었으며, 복수의 계수가 결정되었고, 독립 변수가 결정 되었으며, 독립 변수와 복수의 계수 사이의 관계가 결정되었다. 제1 처리 함수는 또한 값이 결정되지 않은 전술한 복수의 계수를 포함하기 때문에, 제1 처리 함수에 데이터가 입력되면, 제1 처리 함수의 출력 값이 결정되기 전에 복수의 계수의 값이 먼저 결정될 필요가 있다. 또한, 복수의 계수의 값이 다르기 때문에 제1 처리 함수의 출력 값도 상이하다. 이러한 방식으로, 복수의 계수 에 대해 상이한 값이 얻어진다. 제1 처리 함수의 출력 값이 기준 값으로 수렴하는 경우, 복수의 계수의 값이 목 표를 만족함을 나타낸다. 따라서 제1 처리 함수는 제1 검색 경로의 타깃 함수이다. 가능한 구현에서 제1 검색 경로와 제1 처리 함수는 다음 관계를 만족한다:"}
{"patent_id": "10-2021-7031511", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "식 에서 는 제1 처리 함수이고, 식 에서 s(t)는 제1 검색 경로이다. 제1 검색 경로 s(t)가 제1 처리 함수로 대체된 후 제1 검색 경로 s(t)의 복수 계수의 값이 제1 처리 함수의 변수 t의 값이 T가되도록 결정될 때마다, 제1 처리 함수의 출력 값은 최솟값이다. 또한, 결정된 제1 검색 경로 s(t)는 제1 처리 함수에 여러 번 대입된다. 제1 처리 함수의 출력 값이 모두 수렴하면, 최종적으로 결정된 제1 검색 경로 s(t)에 서 복수의 계수의 값이 목표를 만족한다고 결정할 수 있다. 본 출원의 본 실시예는 식 및 식 에 따라 결정된 제1 처리 함수를 예로 들어 설명한다. 다른 실시예에서, 제1 처리 함수는 다른 표현 형태를 갖는다. 제1 처리 함수의 표현 형태는 본 출원의 이 실시예에서 제한되지 않는다. 103. 컴퓨터 디바이스는 복수의 계수의 값이 값 집합의 복수의 값인 경우 시뮬레이션된 양자 알고리즘에 기초하 여 제1 처리 함수의 출력 값을 획득한다. 본 출원의 이 실시예에서, 컴퓨터 디바이스가 제1 검색 경로의 적어도 두 개의 값 집합을 순회하고, 복수의 계 수는 각각 순회된 값 집합의 복수의 값이고, 제1 처리 함수의 출력 값은 값 집합에 따라 획득된다. 이 경우 출 력 값은 설정된 값에 대응하는 출력 값이다. 제1 처리 함수의 출력 값을 획득하는 과정에서, 컴퓨터 디바이스는 제1 처리 함수의 출력 값이 수렴할 때까지 복수의 값 집합을 순회할 필요가 있다. 제1 처리 함수의 출력 값이 수렴하지 않을 때, 단계 104가 수행된다. 제1 처리 함수의 출력 값이 수렴할 때, 단계 106이 수행된다. 제1 처리 함수의 출력 값이 수렴하지 않는다는 것은 순회된 적어도 두 개의 값 집합에 대응하는 제1 처리 함수 의 모든 출력 값이 특정 값으로 수렴하지 않는다는 것을 의미한다. 제1 처리 함수의 출력 값이 수렴한다는 것은 순회된 적어도 두 개의 값 집합에서 가장 최근에 순회된 적어도 두 개의 값 집합에 대응하는 제1 처리 함수의 출력 값이 동일한 값으로 수렴한다는 것을 의미한다. 제1 처리 함수가 수렴하는 값은 제1 처리 함수에 따라 결 정된다. 가능한 구현에서, 시뮬레이션된 양자 알고리즘은 복수의 하위 함수 및 복수의 하위 함수에 따라 제1 처리 함수 를 결정하는 연산 모드를 포함한다. 컴퓨터 디바이스는 시뮬레이션된 양자 알고리즘에 기초하여 값 집합의 복수 의 값을 처리하여 복수의 하위 함수에 의해 출력된 제1 값을 각각 획득하고, 연산 모드에 따라 복수의 하위 함 수에 의해 출력된 제1 값에 대한 연산을 수행하여 제1 처리 함수의 출력 값을 얻는다. 선택적으로, 제1 처리 함수는 매우 복잡한 함수이다. 값 집합의 복수의 값이 복수의 계수의 값으로 직접 사용되 고 제1 처리 함수에 대입되면 출력 값을 얻을 수 없다. 그렇지만, 시뮬레이션된 양자 알고리즘은 제1 처리 함수 를 획득하기 위해 연산 모드에 따라 복수의 하위 함수에 대해 연산을 수행할 수 있다. 복수의 하위 함수는 비교 적 단순한 기능이다. 값 집합의 복수의 값은 복수의 계수의 값으로 사용되며, 각 하위 함수에 의해 출력되는 제 1 값을 얻기 위해 하위 함수에 대입되므로 연산 모드에 따라 복수의 제1 값에 대해 연산이 수행되어, 제1 처리 함수의 출력 값을 얻는다. 104. 컴퓨터 디바이스는 제1 처리 함수의 출력 값이 수렴하지 않는 경우에 획득된 적어도 두 개의 값 집합 및 대응하는 출력 값에 대해 함수 피팅(function fitting)을 수행하여 적어도 두 개의 값 집합에 대응하는 출력 값 의 분포를 서술하도록 구성된 제2 처리 함수를 획득한다. 본 출원의 이 실시예에서, 컴퓨터 디바이스가 제1 검색 경로의 적어도 두 개의 값 집합을 순회하고, 시뮬레이션 된 양자 알고리즘에 기초하여 적어도 두 개의 값 집합에 대응하는 출력 값을 획득하는 경우, 컴퓨터 디바이스는 적어도 두 개의 값 집합에 대응하는 출력 값의 분포를 서술하도록 구성된 제2 처리 함수를 획득하기 위해, 가우 스 프로세스 회귀 알고리즘을 사용하여 획득된 적어도 두 개의 값 집합 및 대응하는 출력 값에 대해 함수 피팅 을 수행하고, 즉, 제2 처리 함수에 따라, 적어도 두 개의 값 집합에 대응하는 제1 처리 함수의 출력 값의 분포 상황을 결정한다. 가우스 프로세스 회귀 알고리즘은 가우스 프로세스를 사용하여 데이터에 대한 회귀 분석을 수 행하는 머신 러닝 알고리즘으로, 원래 목표 함수에 대응하는 복수의 알려진 데이터 포인트를 사용하여 원래 목 표 함수에 대응하는 피팅 함수를 맞출 수 있다. 가능한 구현에서, 본 출원의 이 실시예의 제1 처리 함수가 원래의 목표 기능이고 획득된 적어도 두 개의 값 집 합 및 대응하는 출력 값이 제1 처리 함수에 대응하는 적어도 두 개의 알려진 데이터 포인트인 경우 알려진 데이 터 포인트는 제2 처리 함수를 얻기 위해 다음 단계를 사용하여 적합한다. 컴퓨터 디바이스는 제1 처리 함수의 적어도 두 개의 값 집합 및 대응하는 출력 값을 획득한다. 선택적으로, 제1 처리 함수 f(x)에 대해, 제1 처리 함수는 미결정 함수이고, 제1 처리 함수는 고차원 함수이다. 즉, 제1 처리 함수의 실현 가능 영역의 차원은 고차원, 예를 들어 x∈Rd, d≤20이며, 이는 실현 가능 영역의 차 원이 20임을 의미한다.본 출원의 이 실시예는 예로서 획득된 k 개의 값 집합을 사용하여 설명된다. k 개의 값 집합이 x1,x2, ... xk이 고, 모드 k 개의 값 집합이 계수의 값 범위 상의 제1 처리 함수의 요건을 만족하면, k 개의 값 집합의 복수의 값을 제1 처리 함수에 대입하여, k 개의 값 집합에 대응하는 제1 처리 함수의 출력 값 [f(x1),f(x2), ...,f(xk)]을 얻는다. 즉, 시뮬레이션된 양자 알고리즘을 기반으로 k 개의 값 집합을 처리하여 제1 처리 함수의 출력 값을 얻는다. k는 양의 정수이고 x는 값 집합을 나타낸다. 가능한 구현에서, k 개의 값 집합에 대응하는 제1 처리 함수의 출력 값이 가우스 분포를 만족할 때, k 개의 값 집합에 대응하는 제1 처리 함수의 출력 값의 가우스 분포는 다음 식 에 나타난다:"}
{"patent_id": "10-2021-7031511", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "여기서 x1:k는 k번째 값 집합에 대한 제1 값 집합을 나타내고, f(x1:k)는 k 개의 값 집합에 대응하는 제1 처리 함 수의 출력 값, 즉 f(x1:k)=[f(x1),f(x2), ...,f(xk)]을 나타내고, μ0은 값 집합에 대응하는 예상 값을 나타내고, μ0(x1:k)는 k 개의 값 집합에 대응하는 예상 값을 나타내고, 즉, μ0(x1:k)=[μ0(x1),μ0(x2), ...,μ0(xk)]이고; Σ0은 공분산 행렬을 나타내고, Σ0(x1,x1)은 값 집합 x1에 따라 결정된 공분산 행렬을 나타내고, Σ0(x1:k,x1:k)는 k 개의 값 집합에 대응하는 공분산 행렬을 나타내며, 즉,"}
{"patent_id": "10-2021-7031511", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "컴퓨터 디바이스는 적어도 두 개의 값 집합에 대응하는 출력 값의 분포를 서술하도록 구성된 제2 처리 함수 를 획득하기 위해 획득된 적어도 두 개의 값 집합 및 대응하는 출력 값에 대한 기능 피팅을 수행한다. 가능한 구현에서, 컴퓨터 디바이스는 적어도 두 개의 값 집합이 가우스 분포를 만족하는 경우에 적어도 두 개의 값 집합에 대응하는 조건 확률을 획득하고, 적어도 두 개의 값 집합, 대응하는 출력 값 및 조건 확률에 따라 제 2 처리 함수를 조정하여 조정된 제2 처리 함수를 획득한다. 적어도 두 개의 값 집합에 대응하는 출력 값의 분포 가 가우스 분포를 만족하는 경우, 조건 확률은 적어도 두 개의 값 집합 및 대응하는 출력 값에 기초하여 제2 처 리 함수를 얻을 확률이다. 선택적으로 가우스 분포는 다변량 가우스 분포이다. 제1 처리 함수의 출력 값의 결합 분포가 가우스 분포를 만족하고 제2 처리 함수에 대한 사후 확률이 획득된 두 개 이상의 값 집합에 대응하는 출력 값을 기반으로 획득하는 경우 사후 확률은 적어도 두 개의 값 집합에 대응 하는 조건 확률로서 사용된다. 선택적으로, 적어도 두 개의 값 집합이 가우스 분포를 만족하는 경우 적어도 두 개의 값 집합에 대응하는 평균 값 및 분산이 획득되고; 적어도 두 개의 값 집합에 대응하는 조건 확률은 평균값과 분산에 따라 획득된다. 예를 들어, 전술한 k 개의 값 집합 및 제1 처리 함수의 대응하는 출력 값은 k 개의 알려진 데이터 포인트로 사 용되며, 제1 처리 함수의 값 집합이 x일 때, 출력 값 f(x)는 k 개의 알려진 데이터 포인트에 따라 결정된다. 이 경우 가우스 회귀 프로세스의 가정에 따라, [f(x1:k),f(x)]가 가우스 분포를 만족하고, 베이지안 규칙(Bayesian rule)에 따라 조건 확률이 다음 식 에 나타난 바와 같이 결정된다:"}
{"patent_id": "10-2021-7031511", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "여기서 μk(x)는 제2 처리 함수의 평균값을 나타내고 는 제1 처리 함수의 분산을 나타내며 평균값 μk(x) 는 다음 식 에 나타난다:"}
{"patent_id": "10-2021-7031511", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "여기서 x1:k는 k번째 값 집합에 대한 제1 값 집합을 나타내고, f(x1:k)는 k 개의 값 집합에 대응하는 제1 처리 함 수의 출력 값, 즉 f(x1:k)=[f(x1),f(x2), ...,f(xk)]을 나타내고, μ0(x)는 값 집합 x에 대응하는 예상 값을 나타 내고, μ0(x1:k)는 k 개의 값 집합에 대응하는 예상 값, 즉 μ0(x1:k)=[μ0(x1),μ0(x2), ...xk)]를 나타내고; Σ0은 공분산 행렬을 나타내고, Σ0(x1,x1)은 값 집합 x1에 따라 결정된 공분산 행렬을 나타내고, Σ0(x1:k,x1:k)는 k 개의 값 집합에 대응하는 공분산 행렬을 나타낸다. 분산 는 다음 식 에 나타난다:"}
{"patent_id": "10-2021-7031511", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 11, "content": "여기서 Σ0은 공분산 행렬을 나타내고, Σ0(x1,x1)은 값 집합 x1에 따라 결정된 공분산 행렬을 나타내고, Σ 0(x1:k,x1:k)는 k 값에 대응하는 공분산 행렬 집합을 나타낸다. 상기 조건 확률을 결정하는 과정에서 조건 확률은 베이지안 규칙에 따라 결정된다. 베이지안 법칙은 사건 1이 성립될 때 사건 2가 성립될 확률과 사건 2가 성립될 때 사건 1이 성립할 확률 사이의 관계를 설명하는데 사용된 다. 따라서 베이지안 규칙에 따르면 f(x1:k)가 가우스 분포를 만족할 때 [f(x1:k),f(x)]도 가우스 분포의 확률을 만족한다고 결정한다. 예를 들어, 가우스 프로세스 회귀 알고리즘을 사용하여 복수의 데이터 포인트에 대응하는 함수가 복수의 알려진 데이터 포인트에 따라 결정된다. 도 2를 참조하면, 제1 처리 함수 f(x)=x*sin(x)-2x*cos(x)가 있다고 가정하고, 제1 처리 함수로부터 복수의 데이터 포인트를 획득하고, 그런 다음 복수의 데이터 포인트에 따라 제1 처리 함수 를 복원한다. 도 2에서 실선은 제1 처리 함수에 대응하는 곡선이고, 검은색 점은 획득한 데이터 포인트를 나타 내고, 점선은 가우스 과정 회귀 알고리즘에 따라 구한 추정 함수(제2 처리 함수)에 대응하는 곡선이고, 음영 부 분은 95% 신뢰 구간에 대응하고, 즉 추정 함수의 곡선이 존재할 수 있는 범위에 대응한다. 도 2의 개략적인 곡 선도는 8 개의 데이터 포인트를 획득할 때 8 개의 데이터 포인트에 따라 예측된 추정 함수에 대응하는 곡 선을 나타낸다. 개략적인 곡선 다이어그램은 예측된 곡선이 충분히 정확하지 않음을 나타내는 비교적 큰 음영 부분을 포함한다. 도 2의 개략적인 곡선도는 17 개의 데이터 포인트가 획득될 때 17 개의 데이터 포 인트에 따라 예측된 제2 처리 함수에 대응하는 곡선을 도시한다. 가우스 과정 회귀 알고리즘을 사용하여 17 개 의 데이터 포인트에 따라 데이터 포인트에 대응하는 제2 처리 함수의 곡선을 비교적 정확하게 그릴 수 있음을 알 수 있다. 즉, 가우스 과정 회귀 알고리즘은 함수를 빠르고 정확하게 추정할 수 있다. 본 출원의 이 실시예는 단지 예로서 전술한 적어도 두 개의 값 집합에 따라 제2 처리 함수를 획득하는 프로세스 를 사용하여 설명된다. 선택적으로, 복수의 값 집합에 대해, 먼저, 제2 처리 함수가 초기화되고, 획득된 제2 처 리 함수가 전술한 단계를 사용하여 적어도 두 개의 값 집합에 따라 매번 조정되어 조정된 제2 처리 함수를 얻는 다. 그런 다음, 조정된 제2 처리 함수는 보다 정확한 제2 처리 함수를 얻기 위해 전술한 단계를 반복하는 등의 방식으로 다른 적어도 두 개의 값 집합에 따라 계속해서 재조정될 수 있다. 105. 컴퓨터 디바이스는 예상 함수(expectation function)를 사용하여 업데이트된 값 집합의 복수의 값을 처리 하여 획득되는 출력 값이 상기 예상 함수의 최대 출력 값이 되도록 업데이트된 값 집합을 획득한다. 전술한 단계에서, 제1 처리 함수에 대응하는 제2 처리 함수는 가우스 프로세스 회귀 알고리즘을 사용하여 알려진 k 개의 값 집합 및 대응하는 출력 값에 따라 더 정확하게 획득될 수 있다. 그러나 보다 정확한 2차 처리 함수를 획득해야 하는 경우 더 많은 값 집합 및 대응하는 출력 값에 따라 보다 정확한 제2 처리 함수를 얻기 위 해 새로운 값 집합 및 대응하는 출력 값을 지속적으로 얻어야 한다. 새로운 값 집합을 얻는 방법이 핵심이다. 따라서, 제2 처리 함수의 예상 복귀를 서술하도록 구성된 예상 함수가 획득되고, 예상 함수는 업데이트된 값 집 합을 획득하도록 지시하도록 구성된다. 예상 함수의 최선의 선택은 제1 처리 함수이다. 즉, 제1 처리 함수를 예 상 함수로 사용한다. 그러나 제1 처리 함수는 아직 알려지지 않은 기능이다. 따라서 예상 개선(EI)에 대응하는 예상 함수가 얻어진다. 가능한 구현에서, 도 3을 참조하면, 업데이트된 값 집합은 다음 단계를 사용하여 얻는다: 1051. 컴퓨터 디바이스는 적어도 두 개의 값 집합에 대응하는 제1 처리 함수의 출력 값에서 최대 출력 값을 획 득한다. 예상 함수와 관련하여 제1 처리 함수에 대해 n 개의 값 집합에 대응하는 출력 값 f(x1:n)을 얻으면 현재 최대 출 력 값은 으로 정의할 수 있다: 여기서 n은 양의 정수이고 은 n 개의 출력 값 중 최대 출력 값을 나타내는 데 사용된다. 새로운 값 집합과 대 응하는 출력 값 (x,f(x))을 더 얻으면 현재 최대 출력 값은 또한 이고, 즉 >f(x), 또는 f(x), 즉, f(x)≥ 이다. 이러한 방식으로 현재 최대 출력 값은 설정된 새로운 값에 따라 만큼 증가한다. 마크 \"+\"는 a+=max(a,0)로 정의된다. 1052. 컴퓨터 디바이스는 제2 처리 함수와 최대 출력 값 간의 차이에 따라 제2 처리 함수에 대응하는 예상 함수 를 결정한다. 예상 함수는 차이와 0 사이의 최댓값을 평균화하는 함수이다. 가능한 구현에서 예상 함수는 다음 식 과 같이 정의된다:"}
{"patent_id": "10-2021-7031511", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 12, "content": "여기서 n은 현재 결정된 n 개의 출력 값, EIn은 n 개의 출력 값이 결정되었을 때의 예상 함수,"}
{"patent_id": "10-2021-7031511", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 13, "content": "는 새로운 값 집합에 대응하는 출력 값을 사용하여 현재 최대 출력 값의 증가를 나타내고, 최댓값은 0 또는 이고, E는 평균을 나타내고, En은 n 개의 출력 값이 결정될 때 평균을 나타낸다. 상기 식 을 식 에 대입하면, 다음 식 과 같이 단순화된 예상 함수를 얻을 수 있다:"}
{"patent_id": "10-2021-7031511", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 14, "content": "여기서 이고, μn(x)는 n 개의 출력 값에 대응하는 평균값을 나타내고, σn(x)는 n 개의 출력 값에 대응하는 표준편차를 나타내고, 는 밀도함수이고, Φ는 누적 함수이다. 1053. 컴퓨터 디바이스는 경사 알고리즘(gradient algorithm)을 사용하여 예상 함수의 최대 출력 값에 대응하는 값 집합을 업데이트된 값 집합으로 결정한다. 가능한 구현에서, 제2 처리 함수에 대응하는 결정된 예상 함수에 따라, 값 집합의 업데이트 규칙은 다음 식 과 같이 정의된다:"}
{"patent_id": "10-2021-7031511", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 15, "content": "즉, 상기 예상 함수의 출력 값이 최대 출력 값일 때, 대응하는 값 집합 x는 새로 획득된 값 집합이다. 또한, 예 상 함수의 출력 값이 0으로 수렴하는 경우, 이미 알고 있는 복수의 값 집합에 대응하는 출력 값이 최댓값을 포 함하고 있으며, 즉 최댓값으로 수렴함을 의미한다. 이 경우 제1 처리 함수의 출력 값도 수렴한다. 또한, 도 4는 값 집합을 업데이트하는 개략적인 흐름도로서, 값 집합이 획득되고 값 집합 내의 복수의 값이 시 뮬레이션된 양자 알고리즘에 기초하여 처리되어 복수의 하위 함수에 대응하는 제1 값을 획득하고, 제1 처리 함 수의 출력 값은 복수의 하위 함수에 대응하는 제1 값 및 복수의 하위 함수에 따라 제1 처리 함수를 결정하는 연 산 모드에 따라 결정되며, 값 집합 및 대응하는 출력 값은 가우스 프로세스 회귀 알고리즘을 사용하여 현재 값 집합과 대응하는 출력 값 그리고 대응하는 출력 값에 따라 피팅되어, 제2 처리 함수를 획득하며, 제2 처리 함수 에 대응하는 예상 함수를 처리하여 예상 함수의 최댓값에 대응하는 값 집합을 획득하며, 이것은 하나의 업데이 트된 값 집합이다. 선택적으로, 본 출원의 이 실시예에서, 제1 값 집합의 복수의 값이 미리 설정되고, 복수의 값은 무작위로 또는 경험적으로 설정된다. 제1 값 집합 이외의 값 집합은 모두 단계 105를 사용하여 획득된다. 106. 컴퓨터 디바이스는 제1 처리 함수의 출력 값이 수렴하는 경우에 수렴하는 출력 값에 대응하는 값 집합의 복수의 값을 복수의 계수의 값으로서 각각 사용하여 제2 검색 경로를 획득한다.본 출원의 이 실시예에서, 제1 처리 함수의 출력 값이 수렴한다는 것은 복수의 값 집합에 대응하는 출력 값이 동일한 값으로 수렴된다는 것을 의미한다. 상기 제1 처리 함수의 출력 값을 획득하는 과정은 순환적 과정이기 때문에, 복수의 값 집합에 대응하는 출력 값이 수렴할 때, 최종적으로 획득된 값 집합의 복수의 값이 복수의 계 수의 값으로 각각 사용되고, 복수의 값은 제2 검색 경로를 획득하기 위해 제1 검색 경로에 대입된다. 데이터는 제2 검색 경로에 따라 후속적으로 처리될 수 있다. 본 출원의 이 실시예에서, 제2 검색 경로는 양자 컴퓨팅에 기초한 검색 경로이다. 양자 컴퓨팅에는 선형 중첩 상태가 있기 때문에 기존 컴퓨팅에 비해 양자 컴퓨팅은 제2 검색 경로를 사용하여 데이터 처리 속도가 빨라 데 이터 처리 효율성을 향상시킬 수 있다. 가능한 구현에서, 획득된 제2 검색 경로는 획득된 제2 검색 경로에 따라 양자 컴퓨팅에서 그로버 검색(Grover search)(양자 검색 알고리즘)의 문제를 해결하기 위해 양자 컴퓨터에 적용된다. 양자 컴퓨팅에서의 그로버 검색 의 경우 n 비트가 있고 각 비트가 0과 1의 두 가지 상태에 대응한다고 가정하면 n 비트가 인코딩되어 2n 개체가 인코딩될 수 있다. 기존 알고리즘의 최악의 경우 목표물을 찾기 위해 2n번의 시도가 필요하다. 그러나 양자 컴퓨 터는 2차 가속을 구현할 수 있기 때문에 기껏해야 2n/2번의 시도만으로도 목표물를 찾을 수 있다. AQC를 기반으로 한 그로버 검색은 다음 두 가지 주어진 Hamiltonians H0 및 H1에 대해 설계된 최적의 검색 경로 이다."}
{"patent_id": "10-2021-7031511", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 16, "content": "여기서 이고, I는 단위 행렬이며, 은 목표 이진 문자열이다. 초기 상태 Hamiltonian H0의 기저 상태는 기존의 선형 경로, 롤랜드-서프(Roland-Cerf) 경로(비선형 경로) 및 전술한 단계를 사용하여 획득되는 제2 검색 경로를 각각 사용하여 최종 상태 Hamiltonian H1의 기저 상태로 진 화한다. 진화 과정의 개략도는 도 5에 도시되어 있으며, 가로축은 진화 시간이고, 세로축은 충실도이고, 곡선 1 은 선형 경로에 대응하는 곡선이고, 곡선 2는 Roland-Cerf 경로에 대응하는 곡선이고, 곡선 3은 곡선 최적의 검 색 경로에 대응한다. 도 5의 개략도는 6 큐비트에 대응하는 진화의 개략도이며, 도 5의 개략도는 8 큐비트에 대응하는 진화의 개략도이며, 도 5의 개략도는 10 큐비트에 대응하는 진화의 개략도이고, 도 5의 개략도는 12 큐비트에 대응하는 진화의 개략도이다. 도 5로부터, 기존의 선형 경로를 사용하면 진화가 끝난 후 충실도가 1에 도달할 수 없는 반면, 롤랜드-서프 경 로와 제2 검색 경로를 사용하면 진화가 끝난 후 충실도가 1에 도달할 수 있다는 것을 알 수 있다. 또한 제2 검 색 경로는 Roland-Cerf 경로에 비해 더 짧은 시간에 더 빠른 속도로 1에 도달할 수 있으므로 AQC의 효율성이 향 상된다. 또한, 도 5로부터, 큐비트의 양이 증가할수록 선형 경로를 사용하여 진화를 수행하는 효과가 점차 나빠진다는 것을 알 수 있다. 이는 선형 경로가 어느 시점에서나 동일한 비율을 갖기 때문이다. 이 경우 매우 작은 에너지 갭이 있을 때 양자의 에너지가 같은 속도로 고에너지 상태로 쉽게 여기되어 기저 상태로 돌아가지 못하게 된다. 도 5에 도시된 전술한 진화 과정은 도 6에 도시된 바와 같이 다른 형태로 표현된다. 도 6에서 횡축은 t/T이고, 종축은 패스이다. 곡선 1은 선형 경로에 대응하는 곡선이고, 곡선 2는 Roland-Cerf 경로에 대응하는 곡선이며, 곡선 3은 제2 검색 경로에 대응하는 곡선이다. 도 6의 개략도는 6 큐비트에 대응하는 진화의 개략도이고, 도 6의 개략도는 8 큐비트에 대응하는 진화의 개략도이고, 도 6의 개략도는 10 큐비트에 대응하는 진 화의 개략도이고, 도 6의 개략도는 12 큐비트에 대응하는 진화의 개략도이다. 도 7은 제2 검색 경로를 사 용하여 6 큐비트, 8 큐비트, 10 큐비트 및 12 큐비트를 각각 진화시키는 개략도이다. 6 큐비트는 곡선 11에 대 응하고, 8 큐비트는 곡선 12에 대응하고, 10 큐비트는 곡선 13에 대응하고, 12 큐비트는 곡선 14에 대응한다. 도 6 및 도 7로부터, 에서 제2 검색 경로에 대응하는 곡선이 상대적으로 평평해진다는 것을 알 수 있 다. 이는 에서의 에너지 갭이 가장 작아 양자 역학의 물리법칙에 부합하기 때문이다. 종래 기술에서 제1 검색 경로는 값이 결정되지 않은 복수의 계수를 포함하고, 복수의 계수의 값은 강화 학습 모 델을 사용하여 각각 결정되어 제2 검색 경로를 획득한다. 그러나 강화 학습 모델(reinforcement learningmodel)은 최종적으로 선택 값을 결정하기 위해 각 계수의 복수의 선택 값을 시도한다. 제2 검색 경로를 획득하 는 과정에서 값이 결정되지 않은 각 계수가 많은 양의 선택적 값에 대응하는 경우 강화 학습 모델은 여러 번 시 도해야 하므로 값을 결정하는 효율성이 상대적으로 낮고, 또한 제2 검색 경로를 획득하는 데 상대적으로 낮은 효율성을 초래한다. 본 출원의 실시예들에서 제공되는 방법에서, 제1 검색 경로의 값 집합을 순회하는 과정에서, 복수의 계수의 상 이한 값이 하나의 순회를 통해 각각 처리될 수 있고, 출력이 제1 처리 함수의 값이 수렴되면, 수렴하는 출력 값 에 대응하는 값 집합의 복수의 값이 복수의 계수의 값으로 각각 사용되어 제2 검색 경로를 획득한다. 따라서, 제1 처리 함수의 출력 값이 수렴되도록 하고, 복수의 계수의 정확한 값을 신속하게 획득하기 위해 소량의 순회 만이 필요하므로, 제2 검색 경로 획득의 효율성이 향상된다. 또한, 제1 처리 함수의 출력 값이 수렴하지 않는 경우, 업데이트된 값 집합에 따라 제1 처리 함수의 새로운 출 력 값을 획득하도록 값 집합이 업데이트된다. 값 집합을 업데이트하는 과정에서 가우스 프로세스 회귀 알고리즘 이 사용된다. 특정 대칭 구조와 기하학적 구조가 없고 경사 정보를 얻기 어려운 연속 함수의 경우 가우스 과정 회귀 알고리즘은 이러한 복잡한 함수를 처리하는 데 비교적 짧은 시간만 소요되며 처리 효율이 높다. 또한, 가 우스 과정 회귀 알고리즘은 잡음을 포함하는 함수를 처리할 수 있고, 여러 종류의 함수를 처리할 수 있으며, 적 용 범위가 넓다. 이 경우, 제2 검색 경로가 획득되면, 제2 검색 경로에 대응하는 처리 함수가 상대적으로 복잡 한 함수이더라도 빠른 처리를 위해 가우스 프로세스 회귀 알고리즘을 사용할 수 있다. 또한, 고전적 컴퓨팅에서 복잡한 기능을 처리할 때 상대적으로 높은 시간 비용과 경제적 비용으로 인해, 양자 시스템의 경우 양자 시스템이 양자 상전이(quantum phase transition)를 겪을 때 양자 시스템이 더 복잡해지며, 이는 양자 시스템에 대응하는 함수는 더 복잡한 함수가 된다. 이 출원의 방법을 사용하면 복잡한 기능을 빠르게 처리할 수 있으므로 시간 비용과 경제적 비용을 줄일 수 있다. 또한, 강화 학습 모델은 이산 데이터만 처리할 수 있고 연속 함수를 직접 처리할 수 없기 때문에 강화 학습 모 델을 사용하여 구한 검색 경로는 로컬 최적 검색 경로일 뿐이다. 그렇지만, 연속 함수는 본 출원에서 검색 경로 를 획득하는 방법을 사용하여 처리될 수 있으므로 획득된 제2 검색 경로는 전역 최적 검색 경로가 된다. 또한, 본 출원의 실시예에서 제공되는 방법에서, 제1 검색 경로의 복수의 계수의 값이 결정되어 제2 검색 경로 를 획득할 수 있다. 복수의 계수의 값으로 다른 값을 사용하는 경우에 구한 검색 경로와 비교하여 가장 빠른 데 이터 처리 속도로 데이터를 처리하기 위해 제2 검색 경로가 사용된다. 도 8은 본 출원의 실시예에 따른 시뮬레이션된 양자 알고리즘에 기초하여 검색 경로를 획득하기 위한 방법의 흐 름도이다. 이 출원의 이 실시예는 컴퓨터 디바이스에 의해 실행된다. 도 8을 참조하면, 방법은 다음 단계를 포 함한다: 801. 컴퓨터 디바이스는 제1 검색 경로 및 제1 검색 경로에 대응하는 제1 처리 함수를 획득한다. 단계 801에서 제1 검색 경로 및 대응하는 제1 처리 함수를 획득하는 구현은 도 1에 도시된 전술한 실시예에서 단계 101 및 단계 102의 구현과 유사하다. 자세한 내용은 여기에서 다시 설명하지 않는다. 802. 컴퓨터 디바이스는 시뮬레이션된 양자 알고리즘에 기초하여 획득된 값 집합의 복수의 값을 처리하여 복수 의 하위 함수에 의해 출력된 제1 값을 획득한다. 시뮬레이션된 양자 알고리즘은 복수의 하위 함수 및 복수의 하위 함수에 따라 제1 처리 함수를 결정하는 연산 모드를 포함한다. 복수의 하위 함수는 값이 결정되지 않은 복수의 계수를 포함한다. 선택적으로, 복수의 계수는 제1 처리 함수에 포함된 값이 결정되지 않은 복수의 계수와 동일하거나, 복수의 계수는 값이 제1 처리 함수에 포함된 값이 결정되지 않은 복수의 계수에 대한 연산을 수행하여 획득될 수 있다. 선택적으로 각 하위 함수에는 값이 결정되지 않은 계수가 포함된다. 대안으로, 복수의 하위 함수에서 하위 함수의 기준 수량은 값이 결정되지 않은 계수를 포함하지만, 하위 함수의 기준 수량 이외의 하위 함수는 값이 결정되지 않은 계수를 포함하지 않는 다. 또한, 본 출원의 이 실시예에서, 획득된 값 집합의 복수의 값은 시뮬레이션된 양자 알고리즘에 기초하여 처리되 어 복수의 하위 함수에 의해 출력된 제1 값을 획득한다. 이와 같이 모의 양자 알고리즘에 포함된 각 하위 함수 가 출력하는 제1 값은 그에 상응하는 물리적 의미를 갖는다. 예를 들어, 하위 함수에 의해 출력되는 제1 값이 양자 속도, 양자 질량 등을 나타내는 경우, 시뮬레이션된 양자 알고리즘은 제1 처리 함수를 복수의 물리량에 대 응하는 하위 함수로 나타낸다.803. 컴퓨터 디바이스는 연산 모드에 따라 복수의 하위 함수에 의해 출력된 제1 값에 대한 연산을 수행하여 제1 처리 함수의 출력 값을 획득한다. 제1 처리 함수의 출력 값을 획득한 후, 컴퓨터 디바이스는 순회된 적어도 두 개의 값 집합에 대응하는 제1 처리 함수의 출력 값을 획득하고, 제1 처리 함수의 출력 값이 수렴하는지를 결정한다. 제1 처리 함수의 출력 값이 수 렴되면, 단계 807이 수행된다. 제1 처리 함수의 출력 값이 수렴하지 않는 경우, 단계 804가 수행된다. 804. 컴퓨터 디바이스는 제1 처리 함수의 출력 값이 수렴하지 않는 경우에 획득된 적어도 두 개의 값 집합 및 대응하는 출력 값에 대해 함수 피팅을 수행하여 적어도 두 개의 값 집합에 대응하는 출력 값의 분포를 서술하도 록 구성된 제2 처리 함수를 획득한다. 단계에서 제2 처리 함수를 획득하는 구현은 도 1에 도시된 전술한 실시예에서 단계의 구현과 유사하 다. 자세한 내용은 여기에서 다시 설명하지 않는다. 805. 컴퓨터 디바이스는 적어도 두 개의 값 집합에 대응하는 출력 값에서 최대 출력 값을 획득하고, 제2 처리 함수와 최대 출력 값 사이의 차이에 따라 제2 처리 함수에 대응하는 예상 함수를 결정한다. 806. 컴퓨터 디바이스는 예상 함수의 최대 출력 값에 대응하는 값 집합을 경사 알고리즘을 사용하여 업데이트된 값 집합으로 결정하고 단계 802를 반복적으로 수행한다. 단계 805에서 예상 함수를 결정하는 구현 및 단계 806에서 업데이트된 값 집합을 획득하는 구현은 도 1에 도시 된 전술한 실시예의 단계 105의 구현과 유사하다. 자세한 내용은 여기에서 다시 설명하지 않는다. 807. 컴퓨터 디바이스는, 제1 처리 함수의 출력 값이 수렴하는 경우, 수렴하는 출력 값에 대응하는 값 집합의 복수의 값을 복수의 계수의 값으로서 각각 사용하여 제2 검색 경로를 획득한다. 본 출원의 실시예에서 제공되는 검색 경로 획득 방법에서, 제1 검색 경로의 값 집합을 순회하는 과정에서, 복수 의 계수의 상이한 값은 하나의 순회를 통해 각각 처리될 수 있고, 제1 처리 함수의 출력 값이 수렴하는 경우, 수렴하는 출력 값에 대응하는 값 집합의 복수의 값이 복수의 계수의 값으로 각각 사용되어 제2 검색 경로를 획 득한다. 따라서, 제1 처리 함수의 출력 값이 수렴되도록 하고, 복수의 계수의 정확한 값을 신속하게 획득하기 위해 소량의 순회만이 필요하므로, 제2 검색 경로 획득의 효율성이 향상된다. 도 1 또는 도 8에 도시된 시뮬레이션된 양자 알고리즘에 기초하여 검색 경로를 획득하기 위한 전술한 방법은 검 색 경로를 사용하여 복수의 후보 데이터를 타깃 데이터로 검색하는 검색 시나리오에 적용될 수 있다. 시뮬레이 션 양자 알고리즘에 기초한 데이터 검색 방법은 시뮬레이션 양자 알고리즘에 기초한 데이터 검색 방법이 검색 시나리오에 적용될 수 있는 예를 들어 설명한다. 도 9는 본 출원의 실시예에 따른 시뮬레이션된 양자 알고리즘에 기초한 데이터 검색 방법의 흐름도이다. 도 9에 도시된 바와 같이, 이 출원의 이 실시예는 컴퓨터 디바이스에 의해 실행된다. 이 방법에는 다음 단계가 포함된 다. 901. 컴퓨터 디바이스는 복수의 검색될 후보 데이터에 따라 제1 상태 데이터 및 제2 상태 데이터를 생성한다. 선택적으로, 후보 데이터는 항목, 이미지 또는 기타 데이터이고, 후보 데이터는 상이한 실제 검색 시나리오에 따른 상이한 형태의 데이터이며, 이는 본 출원의 이 실시예에서 제한되지 않는다. 제1 상태 데이터는 복수의 후 보 데이터에 대한 검색이 아직 시작되지 않은 경우 복수의 후보 데이터의 상태를 설명하는 데 사용되며, 제2 상 태 데이터는 타깃 데이터가 발견되었을 때 복수의 후보 데이터의 상태를 설명하는 데 사용된다. 제1 상태 데이터에 대응하는 제1 상태는 복수의 후보 데이터가 동일한 선택 확률을 갖는 상태이고, 제2 상태 데 이터에 대응하는 제2 상태는 검색 조건을 만족하는 타깃 데이터가 발견된 상태이다. 즉, 복수의 후보 데이터가 제1 상태인 경우, 복수의 후보 데이터에 대한 검색은 아직 시작되지 않고, 복수의 후 보 데이터의 모든 선택 확률은 동일하다. 즉, 컴퓨터 디바이스가 처음으로 복수의 후보 데이터를 검색하는 경우, 복수의 후보 데이터 중 임의의 후보 데이터를 선택할 확률은 동일하다. 복수의 후보 데이터가 제2 상태인 경우, 타깃 데이터를 찾았고, 타깃 데이터를 선택할 확률은 1이다. 즉, 컴퓨터 디바이스가 마지막으로 대한 복 수의 후보 데이터를 검색할 때, 타깃 데이터는 반드시 선택된다. 예를 들어, n 개의 후보 데이터가 있다. n 개의 후보 데이터를 처음으로 검색할 때, 컴퓨터 디바이스는 n 개의 후보 데이터 중에서 임의의 후보 데이터를 선택하고, 후보 데이터를 선택할 확률은 1/n이다.가능한 구현에서, 제1 상태 데이터는 복수의 후보 데이터의 선택 확률을 포함하고, 제2 상태 데이터는 기준 확 률을 포함하고, 복수의 후보 데이터의 선택 확률은 복수의 후보 데이터에 따라 결정되고 기준 확률은 1이다. 예 를 들어, 20 개의 후보 데이터가 있고 20 개의 후보 데이터 중에서 하나의 타깃 데이터를 선택해야 하는 경우 제1 상태 데이터에 포함된 선택 확률은 1/20인 것으로 결정될 수 있다. 가능한 구현에서, 복수의 후보 데이터가 서로 다른 위치에 위치하는 경우, 복수의 후보 데이터에서 타깃 데이터 를 검색할 때 임의의 초기 위치에서 검색을 시작해야 하고, 끝 위치는 타깃 데이터의 위치이다. 이와 같이, 제1 상태 데이터는 시작 위치 정보를 포함하고, 제2 상태 데이터는 종료 위치 정보를 포함한다. 후속 검색 과정에서 발견된 위치 정보가 종료 위치 정보와 동일하면 타깃 데이터가 발견되었음을 나타낸다. 902. 컴퓨터 디바이스는 제1 상태 데이터 및 제2 상태 데이터에 따라 제1 검색 경로를 생성한다. 단계에서 제1 검색 경로를 생성하는 구현은 이전 단계에서 제1 검색 경로를 획득하는 구현과 유사하 고, 이전 단계에서 제1 검색 경로를 획득하는 구현과는, 제1 검색 경로가 값이 결정되지 않은 복수의 계수 를 포함한다는 것 외에, 제1 검색 경로의 시작점은 제1 상태를 의미하고, 종료점은 제2 상태를 의미한다는 점에 서 다르다. 가능한 구현에서, 컴퓨터 디바이스는 제1 상태 데이터, 제2 상태 데이터, 및 타깃 검색 기간에 따라 제1 검색 경로를 생성한다. 제1 검색 경로는 타깃 검색 기간을 더 포함하고, 타깃 검색 기간은 제1 상태를 제2 상태로 변 환하는 데 필요한 기간이다. 선택적으로 타깃 검색 기간은 임의의 기간이며, 예를 들어, 1분, 2분 또는 다른 기 간이다. 타깃 검색 시간이 T이고, 제1 상태 데이터가 (0, 1)이고, 제2 상태 데이터가 (T, 0)인 예가 사용된다. 제1 검색 경로는 s(t)=1-t/T로 생성된다. 제1 검색 경로는 타깃 검색 기간, 제1 상태 데이터 및 제2 상태 데이터의 요건 을 만족한다. 제1 검색 경로 s(t)=1-t/T의 형태는 다음 식 와 같은 제1 검색 경로를 얻도록 변환된다:"}
{"patent_id": "10-2021-7031511", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 17, "content": "여기서 T는 타깃 검색 기간이고, t는 독립변수이고, bj는 값이 결정되지 않은 계수이고, j의 값 범위는 1 내지 양의 무한대이고, j는 양의 정수이다. 본 출원의 이 실시예는 단지 제1 상태 데이터가 (0, 1)이고, 제2 상태 데이터가 (T, 0)이고, 생성된 제1 검색 경로가 s(t)=1-t/T인 예를 사용하여 설명된다. 다른 실시예에서, 제1 상태 데이터 및 제2 상태 데이터를 만족시 키는 다른 검색 경로가 생성된다. 903. 컴퓨터 디바이스는 제1 검색 경로에 대응하는 제1 처리 함수를 획득한다. 제1 처리 함수는 복수의 계수를 포함하고, 제1 처리 함수의 출력 값은 제1 검색 경로에 의해 결정되며, 제1 처리 함수의 출력 값의 수렴은 복수 의 계수의 값이 목표를 만족함을 나타낸다. 904. 컴퓨터 디바이스는 복수의 계수의 값이 값 집합의 복수의 값인 경우 시뮬레이션된 양자 알고리즘에 기초하 여 제1 처리 함수의 출력 값을 획득한다. 905. 컴퓨터 디바이스는 제1 처리 함수의 출력 값이 수렴하지 않는 경우에 획득된 적어도 두 개의 값 집합 및 대응하는 출력 값에 대한 함수 피팅을 수행하여 적어도 두 개의 값 집합에 대응하는 출력 값의 분포를 서술하도 록 구성된 제2 처리 함수를 획득한다. 906. 컴퓨터 디바이스는 예상 함수를 사용하여 업데이트된 값 집합의 복수의 값을 처리하여 획득되는 출력 값이 상기 예상 함수의 최대 출력 값이 되도록 업데이트된 값 집합을 획득한다. 907. 컴퓨터 디바이스는 제1 처리 함수의 출력 값이 수렴하는 경우, 수렴하는 출력 값에 대응하는 값 집합의 복 수의 값을 복수의 계수의 값으로 각각 사용하여 제2 검색 경로를 획득한다. 단계 903 내지 단계 907에서 제2 검색 경로를 결정하는 구현은 도 1에 도시된 실시예에서 단계 102 내지 단계 106에서 제2 검색 경로를 결정하는 구현과 유사하다. 자세한 내용은 여기에서 다시 설명하지 않는다. 908. 컴퓨터 디바이스는 제2 검색 경로를 사용하여 타깃 데이터에 대한 복수의 후보 데이터를 검색한다. 본 출원의 이 실시예에서, 컴퓨터 디바이스는 제2 검색 경로를 사용하여 타깃 데이터에 대한 복수의 후보 데이 터를 검색한다. 검색된 후보 데이터가 검색 조건을 만족하는 경우 후보 데이터가 타깃 데이터임을 나타낸다. 가능한 구현에서, 복수의 후보 데이터는 서로 다른 유형을 가지며, 검색 조건은 타깃 유형을 포함한다. 컴퓨터 디바이스는 제2 검색 경로를 사용하여 타깃 유형을 만족하는 타깃 데이터에 대한 복수의 후보 데이터를 검색한 다. 예를 들어, 후보 데이터가 20 개의 후보 항목인 경우, 20 개의 후보 항목 중에서 하나의 타깃 항목이 선택되어 야 한다. 검색 조건이 타깃 항목 유형인 경우 20 개의 후보 항목 중에서 타깃 항목 유형의 타깃 항목을 찾아야 한다. 검색 과정에서 검색은 검색 경로의 시작점에서 시작된다. 이 경우, 제1 검색에서 타깃 항목이 선택될 수 있는 확률은 1/20이고, 제1 검색에서 타깃 항목이 선택되면 확률은 1이 되고, 검색은 종료되며; 1차 검색에서 타깃 항목이 발견되지 않으면 2차 검색에서 타깃 항목이 선택될 확률은 1/19이고, 2차 검색에서 타깃 항목이 선 택되면 1이 되며, 검색은 종료되며; 만약 2차 검색에서도 타깃 항목이 발견되지 않는다면, 3차 검색에서 타깃 항목이 선택될 확률은 1/18이 되고, 타깃 항목을 찾을 때까지 나머지 후보 항목을 계속 검색한다. 선택적으로, 복수의 후보 데이터는 동일한 유형의 데이터를 포함하고, 검색 조건은 타깃 데이터를 고유하게 나 타낼 수 있는 데이터 식별자 또는 다른 데이터 특징을 포함한다. 후보 데이터의 형태 및 검색 조건은 본 출원의 이 실시예에서 제한되지 않는다. 실제 적용 시나리오에 따르면, 후보 데이터는 복수의 형태의 데이터이며, 검색 조건은 후보 데이터의 형태에 따라 결정된다. 본 출원의 실시예들에서 제공되는 방법에서, 제1 검색 경로의 값 집합을 순회하는 과정에서, 복수의 계수의 상 이한 값은 하나의 순회를 통해 각각 처리될 수 있고, 출력이 제1 처리 함수의 값이 수렴되면, 수렴하는 출력 값 에 대응하는 값 집합의 복수의 값이 복수의 계수의 값으로 각각 사용되어 제2 검색 경로를 획득한다. 따라서, 제1 처리 함수의 출력 값이 수렴되도록 하고, 복수의 계수의 정확한 값을 신속하게 획득하기 위해 소량의 순회 만이 필요하므로, 제2 검색 경로 획득의 효율성이 향상된다. 또한, 복수의 후보 데이터에 대응하는 제1 상태 데 이터 및 제2 상태 데이터에 따라 제1 검색 경로가 생성되므로, 획득한 제2 검색 경로는 복수의 후보 데이터에 적용 가능하고, 제2 검색 경로를 사용하여 복수의 후보 데이터로부터 신속하게 타깃 데이터를 찾을 수 있다. 또한, 획득한 제2 검색 경로는 검색 시간이 가장 짧고 검색 속도가 가장 빠른 검색 경로이기 때문에, 제2 검색 경로를 사용하여 타깃 데이터를 검색하는 과정에서 타깃 데이터를 빠르게 찾을 수 있다. 복수의 후보 데이터로 부터 검색 조건에 따라 데이터 검색 효율을 향상시킨다. 또한, 제2 검색 경로는 기존 컴퓨팅에서의 데이터 검색 모드에 비해 양자 컴퓨팅 기반의 데이터 검색 모드이며, 제2 검색 경로를 사용하여 타깃 데이터를 검색하는 효 율성이 고전 컴퓨팅을 사용하여 타깃 데이터를 검색하는 효율성보다 높다. 도 10은 본 출원의 실시예에 따른 데이터 검색 장치의 개략적인 구조도이다. 도 10을 참조하면, 장치는: 복수의 검색될 후보 데이터(to-be-searched candidate data)에 따라 제1 상태 데이터 및 제2 상태 데이터를 생 성하도록 구성되어 있는 상태 데이터 생성 모듈 - 상기 제1 상태 데이터에 대응하는 제1 상태는 상기 복 수의 후보 데이터가 동일한 선택 확률(selection probability)을 갖는 상태이고, 상기 제2 상태 데이터에 대응 하는 제2 상태는 검색 조건을 만족하는 타깃 데이터가 발견된 상태임 - ; 상기 제1 상태 데이터 및 상기 제2 상태 데이터에 따라 제1 검색 경로를 생성하도록 구성되어 있는 제1 경로 생 성 모듈 - 상기 제1 검색 경로의 시작점은 상기 제1 상태를 나타내고, 종료점은 상기 제2 상태를 나타내 며, 상기 제1 검색 경로는 값이 결정되지 않은 복수의 계수를 포함함 - ; 상기 제1 검색 경로에 대응하는 제1 처리 함수를 획득하도록 구성되어 있는 제1 함수 획득 모듈 - 상기 제1 처리 함수는 복수의 계수를 포함하고, 상기 제1 처리 함수의 출력 값은 상기 제1 검색 경로에 의해 결정되 며, 상기 제1 처리 함수의 출력 값의 수렴은 상기 복수의 계수의 값이 목표를 만족한다는 것을 나타냄 - ; 상기 제1 검색 경로의 적어도 두 개의 값 집합을 순회하도록 구성되어 있는 집합 획득 모듈 - 각각의 값 집합은 상기 복수의 계수에 대응하는 복수의 값을 포함하고, 상이한 값 집합의 복수의 값은 완전히 동일하지 않 음 - ; 상기 복수의 계수의 값이 각각 상기 순회된 값 집합의 복수의 값인 경우에 시뮬레이션된 양자 알고리즘에 기초 하여 제1 처리 함수의 출력 값을 획득하도록 구성되어 있는 출력 값 획득 모듈; 상기 제1 처리 함수의 출력 값이 수렴하는 경우, 수렴하는 출력 값에 대응하는 값 집합의 복수의 값을 상기 복 수의 계수의 값으로 각각 사용하여 제2 검색 경로를 획득하도록 구성되어 있는 제2 경로 획득 모듈; 및 상기 제2 검색 경로를 사용하여 상기 타깃 데이터에 대한 복수의 후보 데이터를 검색하도록 구성되어 있는 데이 터 검색 모듈 을 포함한다. 본 출원의 실시예들에서 제공되는 장치에서, 제1 검색 경로의 값 집합을 순회하는 과정에서, 복수의 계수의 상 이한 값은 하나의 순회를 통해 각각 처리될 수 있고, 출력이 제1 처리 함수의 값이 수렴되면, 수렴하는 출력 값 에 대응하는 값 집합의 복수의 값이 복수의 계수의 값으로 각각 사용되어 제2 검색 경로를 획득한다. 따라서, 제1 처리 함수의 출력 값이 수렴되도록 하고, 복수의 계수의 정확한 값을 신속하게 획득하기 위해 소량의 순회 만이 필요하므로, 제2 검색 경로 획득의 효율성이 향상된다. 또한, 복수의 후보 데이터에 대응하는 제1 상태 데 이터 및 제2 상태 데이터에 따라 제1 검색 경로가 생성되므로, 획득한 제2 검색 경로는 복수의 후보 데이터에 적용 가능하고, 제2 검색 경로를 사용하여 복수의 후보 데이터로부터 신속하게 타깃 데이터를 찾을 수 있다. 가능한 구현에서, 도 11을 참조하면, 장치는: 상기 제1 처리 함수의 출력 값이 수렴하지 않는 경우, 순회한 적어도 두 개의 값 집합 및 상기 적어도 두 개의 값 집합에 대응하는 제1 처리 함수의 출력 값을 획득하도록 구성되어 있는 정보 획득 모듈; 상기 적어도 두 개의 값 집합 및 대응하는 출력 값에 대해 함수 피팅(function fitting)을 수행하여 제2 처리 함수를 획득하도록 구성되어 있는 제2 함수 획득 모듈 - 상기 제2 처리 함수는 상기 적어도 두 개의 값 집합에 대응하는 상기 출력 값의 분포를 서술하도록 구성되고, 상기 제2 처리 함수는 상기 복수의 계수를 포함 함 - ; 및 예상 함수(expectation function)를 사용하여 업데이트된 값 집합의 복수의 값을 처리하여 획득되는 출력 값이 상기 예상 함수의 최대 출력 값이 되도록 업데이트된 값 집합을 획득하도록 구성되어 있는 집합 업데이트 모듈 - 상기 예상 함수는 상기 제2 처리 함수의 예상 복귀(expected return)를 설명하도록 구성됨 - 을 더 포함한다. 다른 가능한 구현에서, 도 11을 참조하면, 제2 기능 획득 모듈은: 적어도 두 개의 값 집합이 가우스 분포를 만족하는 경우에 적어도 두 개의 값 집합에 대응하는 조건 확률을 획 득하도록 구성되어 있는 확률 획득 유닛 - 적어도 두 개의 값 집합에 대응하는 출력 값의 분포가 가우스 분포를 만족하는 경우, 조건 확률은 적어도 두 개의 값 집합 및 대응하는 출력 값에 기초하여 제2 처리 함수를 획득할 확률임 - ; 및 적어도 두 개의 값 집합, 대응하는 출력 값, 및 조건 확률에 따라 획득된 제2 처리 함수를 조정하여 조정된 제2 처리 함수를 획득하도록 구성된 함수 조정 유닛 을 포함한다. 또 다른 가능한 구현에서, 도 11을 참조하면, 집합 업데이트 모듈은: 상기 적어도 두 개의 값 집합에 대응하는 상기 제1 처리 함수의 출력 값에서 최대 출력 값을 획득하고; 상기 제2 처리 함수와 상기 최대 출력 값의 차이에 따라 상기 제2 처리 함수에 대응하는 상기 예상 함수를 결정 하고 - 상기 예상 함수는 상기 차이와 0 사이의 최댓값을 평균화하는 함수임 -; 그리고 경사 알고리즘(gradient algorithm)을 사용하여 상기 예상 함수의 최대 출력 값에 대응하는 값 집합을 상기 업 데이트된 값 집합으로 결정하도록 추가로 구성되어 있다. 다른 가능한 구현에서, 도 11을 참조하면, 확률 획득 유닛은: 적어도 두 개의 값 집합이 가우스 분포를 만족하는 경우에 적어도 두 개의 값 집합에 대응하는 평균값 및 분산 을 획득하고; 그리고 평균값과 분산에 따라 두 개 이상의 값 집합에 대응하는 조건 확률을 획득하도록 구성되어 있다. 다른 가능한 구현에서, 도 11을 참조하면, 시뮬레이션된 양자 알고리즘은 복수의 하위 함수 및 복수의 하위 함 수에 따라 제1 처리 함수를 결정하는 연산 모드를 포함하고, 출력 값 획득 모듈은:상기 시뮬레이션된 양자 알고리즘에 기초하여 상기 순회된 값 집합의 복수의 값을 처리하여 상기 복수의 하위 함수에 의해 출력된 제1 값을 각각 획득하도록 구성되어 있는 제1 값 획득 유닛; 및 상기 연산 모드에 따라, 상기 복수의 하위 함수에 의해 출력된 상기 제1 값에 대한 연산을 수행하여 상기 제1 처리 함수의 출력 값을 획득하도록 구성되어 있는 출력 값 획득 유닛 을 포함한다. 다른 가능한 구현에서, 제1 경로 생성 모듈은: 제1 상태 데이터, 제2 상태 데이터, 및 타깃 검색 기간에 따라 제1 검색 경로를 생성하도록 추가로 구성되고, 제1 검색 경로는 타깃 검색 기간을 더 포함하고, 타깃 검색 기간은 제1 상태를 제2 상태로 변환하는 데 필요한 기간이다. 다른 가능한 구현에서, 복수의 후보 데이터 조각은 서로 다른 유형을 갖고, 검색 조건은 타깃 유형을 포함하고, 데이터 검색 모듈은: 제2 검색 경로를 사용하여, 타깃 유형에 맞는 타깃 데이터에 대한 복수의 후보 데이터를 검색하도록 추가로 구 성된다. 본 출원의 실시예는 컴퓨터 디바이스를 더 제공한다. 컴퓨터 디바이스는 프로세서 및 메모리를 포함하고, 메모 리는 적어도 하나의 프로그램 코드를 저장하고, 적어도 하나의 프로그램 코드는 프로세서에 의해 로드되어 다음 동작: 복수의 검색될 후보 데이터(to-be-searched candidate data)에 따라 제1 상태 데이터 및 제2 상태 데이터를 생 성하는 단계 - 상기 제1 상태 데이터에 대응하는 제1 상태는 상기 복수의 후보 데이터가 동일한 선택 확률 (selection probability)을 갖는 상태이고, 상기 제2 상태 데이터에 대응하는 제2 상태는 검색 조건을 만족하는 타깃 데이터가 발견된 상태임 - ; 상기 제1 상태 데이터 및 상기 제2 상태 데이터에 따라 제1 검색 경로를 생성하는 단계 - 상기 제1 검색 경로의 시작점은 상기 제1 상태를 나타내고, 종료점은 상기 제2 상태를 나타내며, 상기 제1 검색 경로는 값이 결정되지 않은 복수의 계수를 포함함 - ; 상기 제1 검색 경로에 대응하는 제1 처리 함수를 획득하는 단계 - 상기 제1 처리 함수는 복수의 계수를 포함하 고, 상기 제1 처리 함수의 출력 값은 상기 제1 검색 경로에 의해 결정되며, 상기 제1 처리 함수의 출력 값의 수 렴은 상기 복수의 계수의 값이 목표를 만족한다는 것을 나타냄 - ; 상기 제1 검색 경로의 적어도 두 개의 값 집합을 순회하는 단계 - 각각의 값 집합은 상기 복수의 계수에 대응하 는 복수의 값을 포함하고, 상이한 값 집합의 복수의 값은 완전히 동일하지 않음 - ; 상기 복수의 계수의 값이 각각 상기 순회된 값 집합의 복수의 값인 경우에 시뮬레이션된 양자 알고리즘에 기초 하여 제1 처리 함수의 출력 값을 획득하는 단계; 상기 제1 처리 함수의 출력 값이 수렴하는 경우, 수렴하는 출력 값에 대응하는 값 집합의 복수의 값을 상기 복 수의 계수의 값으로 각각 사용하여 제2 검색 경로를 획득하는 단계; 및 상기 제2 검색 경로를 사용하여 상기 타깃 데이터에 대한 복수의 후보 데이터를 검색하는 단계 를 수행한다. 가능한 구현에서, 적어도 하나의 프로그램 코드는 프로세서에 의해 로드되어 다음 동작: 상기 제1 처리 함수의 출력 값이 수렴하지 않는 경우, 순회한 적어도 두 개의 값 집합 및 상기 적어도 두 개의 값 집합에 대응하는 제1 처리 함수의 출력 값을 획득하는 단계; 상기 적어도 두 개의 값 집합 및 대응하는 출력 값에 대해 함수 피팅(function fitting)을 수행하여 제2 처리 함수를 획득하는 단계 - 상기 제2 처리 함수는 상기 적어도 두 개의 값 집합에 대응하는 상기 출력 값의 분포를 서술하도록 구성되고, 상기 제2 처리 함수는 상기 복수의 계수를 포함함 - ; 및 예상 함수(expectation function)를 사용하여 업데이트된 값 집합의 복수의 값을 처리하여 획득되는 출력 값이 상기 예상 함수의 최대 출력 값이 되도록 업데이트된 값 집합을 획득하는 단계 - 상기 예상 함수는 상기 제2 처리 함수의 예상 복귀(expected return)를 설명하도록 구성됨 - 를 수행한다. 가능한 구현에서, 적어도 하나의 프로그램 코드는 프로세서에 의해 로드되어 다음 동작: 상기 적어도 두 개의 값 집합이 가우스 분포(Gaussian distribution)를 만족하는 경우에 상기 적어도 두 개의 값 집합에 대응하는 조건 확률(condition probability)을 획득하는 단계 - 상기 적어도 두 개의 값 집합에 대응 하는 출력 값의 분포가 가우스 분포를 만족하는 경우에 상기 조건 확률은 상기 적어도 두 개의 값 집합 및 대응 하는 출력 값에 기초하여 제2 처리 함수를 획득할 확률임 - ; 및 상기 적어도 두 개의 값 집합, 상기 대응하는 출력 값, 및 상기 조건 확률에 따라 상기 획득된 제2 처리 함수를 조정하여 상기 조정된 제2 처리 함수를 획득하는 단계 를 수행한다. 가능한 구현에서, 적어도 하나의 프로그램 코드는 프로세서에 의해 로드되어 다음 동작: 상기 적어도 두 개의 값 집합에 대응하는 상기 제1 처리 함수의 출력 값에서 최대 출력 값을 획득하는 단계; 상기 제2 처리 함수와 상기 최대 출력 값의 차이에 따라 상기 제2 처리 함수에 대응하는 상기 예상 함수를 결정 하는 단계 - 상기 예상 함수는 상기 차이와 0 사이의 최댓값을 평균화하는 함수임 -; 및 경사 알고리즘(gradient algorithm)을 사용하여 상기 예상 함수의 최대 출력 값에 대응하는 값 집합을 상기 업 데이트된 값 집합으로 결정하는 단계 를 수행한다. 가능한 구현에서, 적어도 하나의 프로그램 코드는 프로세서에 의해 로드되어 다음 동작: 상기 적어도 두 개의 값 집합이 상기 가우스 분포를 만족하는 경우에 상기 적어도 두 개의 값 집합에 대응하는 평균값 및 분산을 획득하는 단계; 및 상기 평균값 및 상기 분산에 따라 상기 적어도 두 개의 값 집합에 대응하는 조건 확률을 획득하는 단계 를 수행한다. 가능한 구현에서, 상기 시뮬레이션된 양자 알고리즘은 복수의 하위 함수 및 상기 복수의 하위 함수에 따라 상기 제1 처리 함수를 결정하는 연산 모드를 포함하며, 적어도 하나의 프로그램 코드는 프로세서에 의해 로드되어 다 음 동작:: 상기 시뮬레이션된 양자 알고리즘에 기초하여 상기 순회된 값 집합의 복수의 값을 처리하여 상기 복수의 하위 함수에 의해 출력된 제1 값을 각각 획득하는 단계; 및 상기 연산 모드에 따라, 상기 복수의 하위 함수에 의해 출력된 상기 제1 값에 대한 연산을 수행하여 상기 제1 처리 함수의 출력 값을 획득하는 단계 를 수행한다. 가능한 구현에서, 적어도 하나의 프로그램 코드는 프로세서에 의해 로드되어 다음 동작: 상기 제1 상태 데이터, 상기 제2 상태 데이터, 및 타깃 검색 기간에 따라 제1 검색 경로를 생성하는 단계 - 상 기 제1 검색 경로는 상기 타깃 검색 기간을 더 포함하고, 상기 타깃 검색 기간은 상기 제1 상태를 상기 제2 상 태로 변환하는 데 필요한 기간임 - 를 수행한다. 가능한 구현에서, 상기 복수의 후보 데이터는 서로 다른 유형을 갖고, 상기 검색 조건은 타깃 유형을 포함하고, 적어도 하나의 프로그램 코드는 프로세서에 의해 로드되어 다음 동작: 상기 제2 검색 경로를 사용하여 상기 타깃 유형을 만족하는 상기 타깃 데이터에 대한 상기 복수의 후보 데이터 를 검색하는 단계 를 수행한다. 이하에서는 컴퓨터 디바이스가 단말인 경우를 예로 들어 설명한다. 도 12는 본 출원의 예시적인 실시예에 따른 단말의 개략적인 구조도이다. 단말은 시뮬레이션된 양자 알고리즘을 기반으로 하는 전술한 데이터 검색 방법에서 단말에 의해 수행되는 단계를 수행하도록 구성된다. 일반적으로 단말은 프로세서 및 메모리를 포함한다. 프로세서는 하나 이상의 프로세싱 코어, 예를 들어, 4-코어 프로세서 또는 8-코어 프로세서를 포함할 수 있다. 프로세서는 디지털 신호 프로세서(Digital Signal Processor, DSP), 필드 프로그래머블 게이트 어 레이(Field Programmable Gate Array, FPGA), 프로그래머블 로직 어레이(Programmable Logic Array, PLA) 중 적어도 하나의 하드웨어 형태로 구현될 수 있다. 프로세서는 대안적으로 메인 프로세서 및 코프로세서를 포함할 수 있다. 메인 프로세서는 깨어 있는 상태에서 데이터를 처리하는 프로세서이며, 중앙처리장치(Central Processing Unit, CPU)라고도 한다. 코프로세서는 대기 상태에서 데이터를 처리하도록 구성된 저전력 프로세서 이다. 일부 실시예에서, 프로세서는 그래픽 처리 장치(GPU)와 통합될 수 있다. GPU는 디스플레이에 표시 해야 하는 콘텐츠를 렌더링하고 그리는 역할을 하도록 구성된다. 일부 실시예에서, 프로세서는 인공 지능 (AI) 프로세서를 더 포함할 수 있다. AI 프로세서는 기계 학습과 관련된 컴퓨팅 작업을 처리하도록 구성된다. 메모리는 하나 이상의 컴퓨터 판독가능 저장 매체를 포함할 수 있다. 컴퓨터 판독 가능형 저장 매체는 비 일시적일 수 있다. 메모리는 고속 RAM(random access memory) 및 비휘발성 메모리, 예를 들어, 하나 이 상의 디스크 저장 장치 또는 플래시 메모리 장치를 더 포함할 수 있다. 일부 실시예에서, 메모리의 비일 시적 컴퓨터 판독 가능형 저장 매체는 적어도 하나의 명령을 저장하도록 구성되며, 적어도 하나의 명령은 본 출 원의 방법 실시예에서 제공된 시뮬레이션된 양자 알고리즘에 기초한 데이터 검색 방법을 구현하기 위해 프로세 서에 의해 실행된다. 일부 실시예에서, 단말은 선택적으로 주변기기 인터페이스 및 적어도 하나의 주변기기를 포함할 수 있다. 프로세서, 메모리, 및 주변기기 인터페이스는 버스 또는 신호 케이블을 사용하여 연결 될 수 있다. 각 주변 장치는 버스, 신호 케이블 또는 회로 기판을 사용하여 주변 장치 인터페이스에 연결 될 수 있다. 구체적으로, 주변기기는 디스플레이 스크린 및 전원 중 적어도 하나를 포함한다. 주변기기 인터페이스는 입출력(I/O)과 관련된 적어도 하나의 주변기기를 프로세서 및 메모리(120 2)에 연결하도록 구성될 수 있다. 일부 실시예에서, 프로세서, 메모리, 및 주변기기 인터페이스 는 동일한 칩 또는 회로 기판에 통합된다. 일부 다른 실시예에서, 프로세서, 메모리, 및 주 변 장치 인터페이스 중 임의의 하나 또는 둘은 별도의 칩 또는 회로 기판 상에 구현될 수 있다. 이것은 이 실시예에서 제한되지 않는다. 디스플레이 스크린은 사용자 인터페이스(UI)를 디스플레이하도록 구성된다. UI는 그래프, 텍스트, 아이콘, 비디오 및 이들의 임의의 조합을 포함할 수 있다. 디스플레이 스크린이 터치스크린일 때, 디스플 레이 스크린은 디스플레이 스크린의 표면 상에서 또는 그 위의 터치 신호를 더 획득할 수 있다. 터 치 신호는 처리를 위한 제어 신호로서 프로세서에 입력될 수 있다. 이 경우에, 디스플레이 스크린 은 소프트 버튼 및/또는 소프트 키보드라고도 하는 가상 버튼 및/또는 가상 키보드를 제공하도록 추가로 구성될 수 있다. 일부 실시예에서, 단말의 전면 패널에 배치된 하나의 디스플레이 스크린이 있을 수 있다. 일부 다른 실시예에서, 단말의 서로 다른 표면에 각각 배치되거나 폴더블 형태로 설계된 적어도 두 개의 디스플레이 스크린이 있을 수 있다. 또 다른 일부 실시예에서, 디스플레이 스크린은 단말의 곡면 또는 접힌 표면에 배치된 플렉서블 디스플레이 스크린일 수 있다. 심지어, 디스플레이 스크린은 직 사각형이 아닌 불규칙한 패턴으로 더 설정될 수 있으며, 특별한 모양의 화면이다. 디스플레이 스크린은 액정 디스플레이(Liquid Crystal Display, LCD), 유기 발광 다이오드(Organic Light Emitting Diode, OLED) 등 과 같은 물질을 사용하여 제조될 수 있다. 전원은 단자의 구성요소에 전원을 공급하도록 구성된다. 전원은 교류, 직류, 1차 전지, 또는 재충전 가능한 전지일 수 있다. 전원이 충전식 배터리를 포함하는 경우, 충전식 배터리는 유선 충전식 배 터리 또는 무선 충전식 배터리일 수 있다. 재충전 가능한 배터리는 급속 충전 기술을 지원하도록 더 구성될 수 있다. 당업자는 도 12에 도시된 구조가 단말에 대한 제한을 구성하지 않으며, 단말은 도면에 도시된 것보다 더 많은 구성 요소를 포함하거나 더 적은 구성 요소를 포함하거나, 일부 구성 요소가 결합되거나, 다른 구성 요소 배치가 사용될 수 있다는 것을 이해할 수 있을 것이다.이하에서는 컴퓨터 디바이스가 서버인 경우를 예로 들어 설명한다. 도 13은 본 출원의 실시예에 따른 서버의 개 략적인 구조도이다. 서버는 다른 구성 또는 성능으로 인해 크게 달라질 수 있으며, 하나 이상의 프로세서 (예를 들어 CPU) 및 하나 이상의 메모리를 포함할 수 있다. 메모리는 적어도 하나의 프로그 램 코드를 저장하고, 적어도 하나의 프로그램 코드는 전술한 방법 실시예에서 제공된 방법을 구현하기 위해 프 로세서에 의해 로드되고 실행된다. 물론, 서버는 입출력을 용이하게 하기 위해 유선 또는 무선 네트워크 인터페이스, 키보드, I/O 인터페이스와 같은 구성요소를 더 포함할 수 있다. 서버는 장치 기능을 구현하도록 구 성된 다른 구성 요소를 더 포함할 수 있다. 자세한 내용은 여기에서 다시 설명되지 않는다. 서버는 시뮬레이션된 양자 알고리즘을 기반으로 하는 전술한 데이터 검색 방법에서 서버에 의해 수행되는 동작을 수행하도록 구성될 수 있다. 컴퓨터 디바이스는 대안적으로 양자 컴퓨터 디바이스일 수 있다. 양자 컴퓨터 디바이스는 또한 시뮬레이션된 양 자 알고리즘을 기반으로 하는 전술한 데이터 검색 방법의 연산을 수행하도록 구성될 수 있다. 본 출원의 실시예는 컴퓨터 판독가능 저장 매체를 더 제공한다. 컴퓨터 판독 가능한 저장 매체는 적어도 하나의 프로그램 코드를 저장하고, 적어도 하나의 프로그램 코드는 프로세서에 의해 로드 다음 동작: 복수의 검색될 후보 데이터(to-be-searched candidate data)에 따라 제1 상태 데이터 및 제2 상태 데이터를 생 성하는 단계 - 상기 제1 상태 데이터에 대응하는 제1 상태는 상기 복수의 후보 데이터가 동일한 선택 확률 (selection probability)을 갖는 상태이고, 상기 제2 상태 데이터에 대응하는 제2 상태는 검색 조건을 만족하는 타깃 데이터가 발견된 상태임 - ; 상기 제1 상태 데이터 및 상기 제2 상태 데이터에 따라 제1 검색 경로를 생성하는 단계 - 상기 제1 검색 경로의 시작점은 상기 제1 상태를 나타내고, 종료점은 상기 제2 상태를 나타내며, 상기 제1 검색 경로는 값이 결정되지 않은 복수의 계수를 포함함 - ; 상기 제1 검색 경로에 대응하는 제1 처리 함수를 획득하는 단계 - 상기 제1 처리 함수는 복수의 계수를 포함하 고, 상기 제1 처리 함수의 출력 값은 상기 제1 검색 경로에 의해 결정되며, 상기 제1 처리 함수의 출력 값의 수 렴은 상기 복수의 계수의 값이 목표를 만족한다는 것을 나타냄 - ; 상기 제1 검색 경로의 적어도 두 개의 값 집합을 순회하는 단계 - 각각의 값 집합은 상기 복수의 계수에 대응하 는 복수의 값을 포함하고, 상이한 값 집합의 복수의 값은 완전히 동일하지 않음 - ; 상기 복수의 계수의 값이 각각 상기 순회된 값 집합의 복수의 값인 경우에 시뮬레이션된 양자 알고리즘에 기초 하여 제1 처리 함수의 출력 값을 획득하는 단계; 상기 제1 처리 함수의 출력 값이 수렴하는 경우, 수렴하는 출력 값에 대응하는 값 집합의 복수의 값을 상기 복 수의 계수의 값으로 각각 사용하여 제2 검색 경로를 획득하는 단계; 및 상기 제2 검색 경로를 사용하여 상기 타깃 데이터에 대한 복수의 후보 데이터를 검색하는 단계 를 수행한다. 가능한 구현에서, 적어도 하나의 프로그램 코드는 프로세서에 의해 로드되어 다음 동작: 상기 제1 처리 함수의 출력 값이 수렴하지 않는 경우, 순회한 적어도 두 개의 값 집합 및 상기 적어도 두 개의 값 집합에 대응하는 제1 처리 함수의 출력 값을 획득하는 단계; 상기 적어도 두 개의 값 집합 및 대응하는 출력 값에 대해 함수 피팅(function fitting)을 수행하여 제2 처리 함수를 획득하는 단계 - 상기 제2 처리 함수는 상기 적어도 두 개의 값 집합에 대응하는 상기 출력 값의 분포를 서술하도록 구성되고, 상기 제2 처리 함수는 상기 복수의 계수를 포함함 - ; 및 예상 함수(expectation function)를 사용하여 업데이트된 값 집합의 복수의 값을 처리하여 획득되는 출력 값이 상기 예상 함수의 최대 출력 값이 되도록 업데이트된 값 집합을 획득하는 단계 - 상기 예상 함수는 상기 제2 처 리 함수의 예상 복귀(expected return)를 설명하도록 구성됨 - 를 수행한다. 가능한 구현에서, 적어도 하나의 프로그램 코드는 프로세서에 의해 로드되어 다음 동작: 상기 적어도 두 개의 값 집합이 가우스 분포(Gaussian distribution)를 만족하는 경우에 상기 적어도 두 개의 값 집합에 대응하는 조건 확률(condition probability)을 획득하는 단계 - 상기 적어도 두 개의 값 집합에 대응 하는 출력 값의 분포가 가우스 분포를 만족하는 경우에 상기 조건 확률은 상기 적어도 두 개의 값 집합 및 대응 하는 출력 값에 기초하여 제2 처리 함수를 획득할 확률임 - ; 및 상기 적어도 두 개의 값 집합, 상기 대응하는 출력 값, 및 상기 조건 확률에 따라 상기 획득된 제2 처리 함수를 조정하여 상기 조정된 제2 처리 함수를 획득하는 단계 를 수행한다. 가능한 구현에서, 적어도 하나의 프로그램 코드는 프로세서에 의해 로드되어 다음 동작: 상기 적어도 두 개의 값 집합에 대응하는 상기 제1 처리 함수의 출력 값에서 최대 출력 값을 획득하는 단계; 상기 제2 처리 함수와 상기 최대 출력 값의 차이에 따라 상기 제2 처리 함수에 대응하는 상기 예상 함수를 결정 하는 단계 - 상기 예상 함수는 상기 차이와 0 사이의 최댓값을 평균화하는 함수임 -; 및 경사 알고리즘(gradient algorithm)을 사용하여 상기 예상 함수의 최대 출력 값에 대응하는 값 집합을 상기 업 데이트된 값 집합으로 결정하는 단계 를 수행한다. 가능한 구현에서, 적어도 하나의 프로그램 코드는 프로세서에 의해 로드되어 다음 동작: 상기 적어도 두 개의 값 집합이 상기 가우스 분포를 만족하는 경우에 상기 적어도 두 개의 값 집합에 대응하는 평균값 및 분산을 획득하는 단계; 및 상기 평균값 및 상기 분산에 따라 상기 적어도 두 개의 값 집합에 대응하는 조건 확률을 획득하는 단계 를 수행한다. 가능한 구현에서, 상기 시뮬레이션된 양자 알고리즘은 복수의 하위 함수 및 상기 복수의 하위 함수에 따라 상기 제1 처리 함수를 결정하는 연산 모드를 포함하며, 적어도 하나의 프로그램 코드는 프로세서에 의해 로드되어 다 음 동작: 상기 시뮬레이션된 양자 알고리즘에 기초하여 상기 순회된 값 집합의 복수의 값을 처리하여 상기 복수의 하위 함수에 의해 출력된 제1 값을 각각 획득하는 단계; 및 상기 연산 모드에 따라, 상기 복수의 하위 함수에 의해 출력된 상기 제1 값에 대한 연산을 수행하여 상기 제1 처리 함수의 출력 값을 획득하는 단계 를 수행한다. 가능한 구현에서, 적어도 하나의 프로그램 코드는 프로세서에 의해 로드되어 다음 동작: 상기 제1 상태 데이터, 상기 제2 상태 데이터, 및 타깃 검색 기간에 따라 제1 검색 경로를 생성하는 단계 - 상 기 제1 검색 경로는 상기 타깃 검색 기간을 더 포함하고, 상기 타깃 검색 기간은 상기 제1 상태를 상기 제2 상 태로 변환하는 데 필요한 기간임 - 를 수행한다. 가능한 구현에서, 상기 복수의 후보 데이터는 서로 다른 유형을 갖고, 상기 검색 조건은 타깃 유형을 포함하고, 적어도 하나의 프로그램 코드는 프로세서에 의해 로드되어 다음 동작: 상기 제2 검색 경로를 사용하여 상기 타깃 유형을 만족하는 상기 타깃 데이터에 대한 상기 복수의 후보 데이터 를 검색하는 단계 를 수행한다. 본 출원의 실시예는 적어도 하나의 프로그램 코드를 저장하는 컴퓨터 프로그램을 더 제공하며, 적어도 하나의 프로그램 코드는 프로세서에 의해 로딩되고 실행되어 전술한 실시예에서의 시뮬레이션된 양자 알고리즘에 기초 한 데이터 검색 방법을 실행한다. 당업자는 전술한 실시예의 단계의 전부 또는 일부가 하드웨어에 의해 구현될 수 있거나 관련 하드웨어에 지시하 는 프로그램이 구현될 수 있음을 이해할 수 있을 것이다. 프로그램은 컴퓨터로 읽을 수 있는 저장매체에 저장될수 있다. 저장 매체는 ROM, 자기 디스크 또는 광 디스크일 수 있다. 전술한 설명은 단지 본 출원의 실시예의 선택적인 실시예일 뿐, 본 출원의 실시예를 제한하도록 의도된 것은 아 니다. 본 출원의 실시예의 정신 및 원칙 내에서 이루어진 모든 수정, 등가 교체 또는 개선은 본 출원의 보호 범 위에 속한다."}
{"patent_id": "10-2021-7031511", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 출원의 실시예에서 기술적인 솔루션을 보다 명확하게 설명하기 위해, 이하에서는 실시예를 설명하는 데 필요 한 첨부 도면을 간략하게 소개한다. 명백하게, 다음 설명에서 첨부된 도면은 본 출원의 일부 실시예만을 도시하 고, 당업자는 창조적 노력 없이 첨부된 도면으로부터 여전히 다른 첨부 도면을 도출할 수 있다. 도 1은 본 출원의 실시예에 따른 시뮬레이션된 양자 알고리즘에 기초하여 검색 경로를 획득하기 위한 방법의 흐 름도이다. 도 2는 본 출원의 일 실시예에 따른 가우스 프로세스 회귀 알고리즘을 사용하여 피팅을 통해 추정 함수를 획득 하는 개략도이다. 도 3은 본 출원의 실시예에 따른 값 집합을 획득하기 위한 방법의 흐름도이다. 도 4는 본 출원의 실시예에 따른 값 집합을 획득하기 위한 방법의 개략적인 흐름도이다.도 5는 본 출원의 실시예에 따른 선형 경로, 비선형 경로 및 제2 검색 경로에 기초한 검색 효과의 개략도이다. 도 6은 본 출원의 실시예에 따른 선형 경로, 비선형 경로 및 제2 검색 경로에 기초한 검색 효과의 다른 개략도 이다. 도 7은 본 출원의 실시예에 따른 제2 검색 경로에 기초한 검색 효과의 개략도이다. 도 8은 본 출원의 실시예에 따른 시뮬레이션된 양자 알고리즘에 기초하여 검색 경로를 획득하기 위한 다른 방법 의 흐름도이다. 도 9는 본 출원의 실시예에 따른 시뮬레이션된 양자 알고리즘에 기초한 데이터 검색 방법의 흐름도이다. 도 10은 본 출원의 실시예에 따른 데이터 검색 장치의 개략적인 구조도이다. 도 11은 본 출원의 실시예에 따른 다른 데이터 검색 장치의 개략적인 구조도이다. 도 12는 본 출원의 실시예에 따른 단말의 개략적인 구조도이다. 도 13은 본 출원의 실시예에 따른 서버의 개략적인 구조도이다."}
