{"patent_id": "10-2022-0086976", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0009711", "출원번호": "10-2022-0086976", "발명의 명칭": "AI 성장 예측 솔루션 기반 아동 발달 및 비만 케어 장치 및 방법", "출원인": "(주) 더흄", "발명자": "황성숙"}}
{"patent_id": "10-2022-0086976", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "AI 성장 예측 솔루션 기반 아동 발달 케어 장치에 있어서,대상자의 리얼 아바타를 생성하기 위한 생성 신호에 따라 카메라를 활성화하여 상기 대상자를 촬영한 영상데이터를 획득하고,상기 영상데이터를 분석하여 상기 대상자의 부위별 신체 치수를 포함하는 제1신체 치수 정보를 식별하고,상기 제1신체 치수 정보를 기반으로 상기 대상자의 관절 포인트 값 및 비관절 포인트 값을 생성하고, 상기 대상자의 관절 포인트 값 및 비관절 포인트 값에 기초하여 상기 리얼 아바타를 생성하여 저장하고,상기 리얼 아바타와 상기 대상자의 나이에 대응하는 표준 아바타를 비교하여 상기 대상자의 발육 상태 정보를식별하고, 상기 대상자의 발육 상태 정보에 따라 식단 프로그램 및 운동 프로그램 중 적어도 하나를 제공하는 프로세서를포함하는 아동 발달 케어 장치."}
{"patent_id": "10-2022-0086976", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 프로세서는, 상기 대상자의 국적에 대응하는 신체 발육 조견표로부터 상기 대상자의 나이에 대응하는 제2신체 치수 정보를식별하고, 상기 제2신체 치수 정보를 기반으로 표준 관절 포인트 값 및 표준 비관절 포인트 값을 생성하고, 표준 관절 포인트 값 및 표준 비관절 포인트 값에 기초하여 상기 표준 아바타를 생성하여 저장하는 아동 발달케어 장치."}
{"patent_id": "10-2022-0086976", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 프로세서는, 제공된 상기 식단 프로그램 및 운동 프로그램 중 적어도 하나의 실행 여부에 관한 정보를 수신하고,상기 실행 여부에 관한 정보에 따라 상기 리얼 아바타를 수정하는 아동 발달 케어 장치."}
{"patent_id": "10-2022-0086976", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 프로세서는, 발육 예측 희망 시점에 관한 정보를 수신하면, 상기 리얼 아바타 생성 시 확인된 상기 대상자의 발육 상태정보, 제공된 상기 식단 프로그램 및 운동 프로그램 중 적어도 하나, 상기 실행 여부에 관한 정보 및 상기 대상자의 국적에 대응하는 신체 발육 조견표를 반영하여 상기 리얼 아바타를 성장시키고,상기 성장한 리얼 아바타와 상기 희망 시점에서 상기 대상자의 나이에 대응하는 표준 아바타를 비교하여 상기대상자의 발육 예측 정보를 식별하는 아동 발달 케어 장치."}
{"patent_id": "10-2022-0086976", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2024-0009711-3-제1항에 있어서,상기 프로세서는, 부위별 목표 신체 치수를 포함하는 제3신체 치수 정보를 식별하고, 상기 제3신체 치수 정보를 기반으로 목표 관절 포인트 값 및 목표 비관절 포인트 값을 생성하고, 상기 목표 관절 포인트 값 및 목표 비관절 포인트 값에 기초하여 목표 아바타를 생성하여 저장하고,상기 리얼 아바타와 상기 목표 아바타를 비교하여 상기 식단 프로그램 및 운동 프로그램 중 적어도 하나를 제공하는 아동 발달 케어 장치."}
{"patent_id": "10-2022-0086976", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 프로세서는, 상기 리얼 아바타 생성 시 확인된 상기 대상자의 발육 상태 정보, 제공된 상기 식단 프로그램 및 운동 프로그램중 적어도 하나, 상기 실행 여부에 관한 정보 및 상기 대상자의 국적에 대응하는 신체 발육 조견표를 반영하여예측 아바타를 생성하고,상기 예측 아바타와 상기 목표 아바타를 비교하여 제공된 상기 식단 프로그램 및 운동 프로그램 중 적어도 하나를 조정하는 아동 발달 케어 장치."}
{"patent_id": "10-2022-0086976", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "AI 성장 예측 솔루션 기반 아동 발달 케어 장치에 의해 수행되는 아동 발달 케어 방법에 있어서,대상자의 리얼 아바타를 생성하기 위한 생성 신호에 따라 카메라를 활성화하여 상기 대상자를 촬영한 영상데이터를 획득하는 단계;상기 영상데이터를 분석하여 상기 대상자의 부위별 신체 치수를 포함하는 제1신체 치수 정보를 식별하는 단계;상기 제1신체 치수 정보를 기반으로 상기 대상자의 관절 포인트 값 및 비관절 포인트 값을 생성하는 단계;상기 대상자의 관절 포인트 값 및 비관절 포인트 값에 기초하여 상기 리얼 아바타를 생성하여 저장하는 단계;상기 리얼 아바타와 상기 대상자의 나이에 대응하는 표준 아바타를 비교하여 상기 대상자의 발육 상태 정보를식별하는 단계;상기 대상자의 발육 상태 정보에 따라 식단 프로그램 및 운동 프로그램 중 적어도 하나를 제공하는 단계를 포함하는 아동 발달 케어 방법."}
{"patent_id": "10-2022-0086976", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 대상자의 발육 상태 정보를 식별하는 단계는,상기 대상자의 국적에 대응하는 신체 발육 조견표로부터 상기 대상자의 나이에 대응하는 제2신체 치수 정보를식별하는 단계;상기 제2신체 치수 정보를 기반으로 표준 관절 포인트 값 및 표준 비관절 포인트 값을 생성하는 단계;표준 관절 포인트 값 및 표준 비관절 포인트 값에 기초하여 상기 표준 아바타를 생성하여 저장하는 단계를 포함하는 아동 발달 케어 방법."}
{"patent_id": "10-2022-0086976", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서,제공된 상기 식단 프로그램 및 운동 프로그램 중 적어도 하나의 실행 여부에 관한 정보를 수신하는 단계;공개특허 10-2024-0009711-4-상기 실행 여부에 관한 정보에 따라 상기 리얼 아바타를 수정하는 단계를 포함하는 아동 발달 케어 방법."}
{"patent_id": "10-2022-0086976", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,발육 예측 희망 시점에 관한 정보를 수신하면, 상기 리얼 아바타 생성 시 확인된 상기 대상자의 발육 상태정보, 제공된 상기 식단 프로그램 및 운동 프로그램 중 적어도 하나, 상기 실행 여부에 관한 정보 및 상기 대상자의 국적에 대응하는 신체 발육 조견표를 반영하여 상기 리얼 아바타를 성장시키는 단계;상기 성장한 리얼 아바타와 상기 희망 시점에서 상기 대상자의 나이에 대응하는 표준 아바타를 비교하여 상기대상자의 발육 예측 정보를 식별하는 단계를 포함하는 아동 발달 케어 방법."}
{"patent_id": "10-2022-0086976", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제7항에 있어서,부위별 목표 신체 치수를 포함하는 제3신체 치수 정보를 식별하는 단계;상기 제3신체 치수 정보를 기반으로 목표 관절 포인트 값 및 목표 비관절 포인트 값을 생성하는 단계;상기 목표 관절 포인트 값 및 목표 비관절 포인트 값에 기초하여 목표 아바타를 생성하여 저장하는 단계;상기 리얼 아바타와 상기 목표 아바타를 비교하여 상기 식단 프로그램 및 운동 프로그램 중 적어도 하나를 제공하는 단계를 포함하는 아동 발달 케어 방법."}
{"patent_id": "10-2022-0086976", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 식단 프로그램 및 운동 프로그램 중 적어도 하나를 제공하는 단계는,상기 리얼 아바타 생성 시 확인된 상기 대상자의 발육 상태 정보, 제공된 상기 식단 프로그램 및 운동 프로그램중 적어도 하나, 상기 실행 여부에 관한 정보 및 상기 대상자의 국적에 대응하는 신체 발육 조견표를 반영하여예측 아바타를 생성하는 단계;상기 예측 아바타와 상기 목표 아바타를 비교하여 제공된 상기 식단 프로그램 및 운동 프로그램 중 적어도 하나를 조정하는 단계를 포함하는 아동 발달 케어 방법."}
{"patent_id": "10-2022-0086976", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 AI 성장 예측 솔루션 기반 아동 발달 케어 장치에 있어서, 대상자의 리얼 아바타를 생성하기 위한 생성 신호에 따라 카메라를 활성화하여 상기 대상자를 촬영한 영상데이터를 획득하고, 상기 영상 데이터를 분석하여 상기 대상자의 부위별 신체 치수를 포함하는 제1신체 치수 정보를 식별하고, 상기 제1신체 치 (뒷면에 계속)"}
{"patent_id": "10-2022-0086976", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 아동 발달 및 비만 케어 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2022-0086976", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "성장기인 영·유아기부터 청소년기에는 기간별로 도달해야 할 신체적 발달 단계를 거치게 되는데, 성장에 필요 한 영양소를 충분히 공급받지 못하면 신체가 충분히 발육을 할 수 없고, 성장기의 불규칙적인 식습관과 스트레 스 증가, 운동 부족 등은 성인기 이후에 고혈압, 당뇨병, 암 등 합병증을 유발할 확률이 높다. 성장기의 아이를 둔 부모는 항상 내 아이의 발달이 또래에 비해 과성장인지 저성장인지에 대한 궁금함이 매우 높으나 비교할 대상이 주변의 지인에 국한되어 자칫 케어의 시간을 놓칠 위험이 있다. 이에 따라 성장 발달 표준치 대비 내 아이의 과 발달 상황이나 저 발달 상황이 실시간으로 분석되어 제공되어 편리한 관리 프로그램이 필요하게 되었다 올바른 발육 과정을 거쳐 건강한 삶을 살아가기 위해서는 현재 발육 상태를 파악하고 올바른 식습관과 규칙적인 운동 등 개선 방안을 모색하는 것이 바람직하다. 한편, 가상 현실에 대한 관심도가 높아지면서 사용자를 촬영한 영상데이터를 이용하여 가상 아바타를 생성하고, 가상 아바타를 이용한 가상 의류 피팅 서비스, 의류 사이즈 추천 서비스 등 다양한 가상 체험 서비스 등의 다양한 기술이 개발되고 있다. 또한, 사진 촬영만으로 칼로리를 계산할 수 있는 기술과 운동량 계산기 등의 다양한 기술들이 개발되고 있다."}
{"patent_id": "10-2022-0086976", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 일 실시예에 따르면, 보다 체계적이고 정확한 AI 성장 예측 솔루션 기반 아동 발달 및 비만 케어 장 치 및 방법을 제공하는 것이다. 본 발명의 일 실시예에 따르면, 가상의 공간에서 시각적으로 형성화 된 리얼 아바타와 표준 아바타, 통계 아바 타의 비교를 통해 한눈으로 쉽게 인지할 수 있는 AI 성장 예측 솔루션 기반 아동 발달 및 비만 케어 장치 및 방 법을 제공하는 것이다. 이로써, 아동의 발육 상태의 관리를 손쉽게 할 수 있다. 본 발명의 일 실시예에 따르면, 목표 아바타에 도달하기 위한 다양한 칼로리 계산을 포함하는 식단 프로그램 및 운동 프로그램을 제공할 수 있다 본 발명의 일 실시예에 따르면, 아동의 성장속도 분석 및 아바타 오토 그로잉 기능을 수행하는 AI 성장 예측 솔 루션 기반 아동 발달 및 비만 케어 장치 및 방법을 제공하는 것이다. 본 발명의 일 실시예에 따르면, 식단프로그램과 운동 프로그램의 실행에 따른 빅데이터 분석을 통해 일정기간 후의 예측 아바타를 생성하여 아이의 성장발달을 예측하고, 체계적인 관리를 유도해내는 AI 성장 예측 솔루션 기반 아동 발달 및 비만 케어 장치 및 방법을 제공하는 것이다. 본 발명의 일 실시예에 따른 모든 과정은 분석을 통한 수치화 되며 빅데이터 분석과정이 그래프화 하여 제공될 수 있으며, 아바타의 생성과 케어 관리를 신체의 부위별로 가능할 수 있다."}
{"patent_id": "10-2022-0086976", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 AI 성장 예측 솔루션 기반 아동 발달 케어 장치에 있어서, 대상자의 리얼 아바타를 생성하기 위한 생성 신호에 따라 카메라를 활성화하여 상기 대상자를 촬영한 영상데이터를 획득하고, 상기 영상 데이터를 분석하여 상기 대상자의 부위별 신체 치수를 포함하는 제1신체 치수 정보를 식별하고, 상기 제1신체 치수 정보를 기반으로 상기 대상자의 관절 포인트 값 및 비관절 포인트 값을 생성하고, 상기 대상자의 관절 포 인트 값 및 비관절 포인트 값에 기초하여 상기 리얼 아바타를 생성하여 저장하고, 상기 리얼 아바타와 상기 대 상자의 나이에 대응하는 표준 아바타를 비교하여 상기 대상자의 발육 상태 정보를 식별하고, 상기 대상자의 발 육 상태 정보에 따라 식단 프로그램 및 운동 프로그램 중 적어도 하나를 제공한다. 상기 프로세서는, 상기 대상자의 국적에 대응하는 신체 발육 조견표로부터 상기 대상자의 나이에 대응하는 제2 신체 치수 정보를 식별하고, 상기 제2신체 치수 정보를 기반으로 표준 관절 포인트 값 및 표준 비관절 포인트 값을 생성하고, 표준 관절 포인트 값 및 표준 비관절 포인트 값에 기초하여 상기 표준 아바타를 생성하여 저장 할 수 있다. 상기 프로세서는, 제공된 상기 식단 프로그램 및 운동 프로그램 중 적어도 하나의 실행 여부에 관한 정보를 수 신하고, 상기 실행 여부에 관한 정보에 따라 상기 리얼 아바타를 수정할 수 있다. 상기 프로세서는, 발육 예측 희망 시점에 관한 정보를 수신하면, 상기 리얼 아바타 생성 시 확인된 상기 대상자 의 발육 상태 정보, 제공된 상기 식단 프로그램 및 운동 프로그램 중 적어도 하나, 상기 실행 여부에 관한 정보 및 상기 대상자의 국적에 대응하는 신체 발육 조견표를 반영하여 상기 리얼 아바타를 성장시키고, 상기 성장한 리얼 아바타와 상기 희망 시점에서 상기 대상자의 나이에 대응하는 표준 아바타를 비교하여 상기 대상자의 발육 예측 정보를 식별할 수 있다. 상기 프로세서는, 부위별 목표 신체 치수를 포함하는 제3신체 치수 정보를 식별하고, 상기 제3신체 치수 정보를 기반으로 목표 관절 포인트 값 및 목표 비관절 포인트 값을 생성하고, 상기 목표 관절 포인트 값 및 목표 비관 절 포인트 값에 기초하여 목표 아바타를 생성하여 저장하고, 상기 리얼 아바타와 상기 목표 아바타를 비교하여 상기 식단 프로그램 및 운동 프로그램 중 적어도 하나를 제공할 수 있다. 상기 프로세서는, 상기 리얼 아바타 생성 시 확인된 상기 대상자의 발육 상태 정보, 제공된 상기 식단 프로그램 및 운동 프로그램 중 적어도 하나, 상기 실행 여부에 관한 정보 및 상기 대상자의 국적에 대응하는 신체 발육조견표를 반영하여 예측 아바타를 생성하고, 상기 예측 아바타와 상기 목표 아바타를 비교하여 제공된 상기 식 단 프로그램 및 운동 프로그램 중 적어도 하나를 조정할 수 있다. 본 발명의 일 실시예에 따른 AI 성장 예측 솔루션 기반 아동 발달 케어 장치에 의해 수행되는 아동 발달 케어 방법에 있어서, 대상자의 리얼 아바타를 생성하기 위한 생성 신호에 따라 카메라를 활성화하여 상기 대상자를 촬영한 영상데이터를 획득하는 단계; 상기 영상데이터를 분석하여 상기 대상자의 부위별 신체 치수를 포함하는 제1신체 치수 정보를 식별하는 단계; 상기 제1신체 치수 정보를 기반으로 상기 대상자의 관절 포인트 값 및 비 관절 포인트 값을 생성하는 단계; 상기 대상자의 관절 포인트 값 및 비관절 포인트 값에 기초하여 상기 리얼 아 바타를 생성하여 저장하는 단계; 상기 리얼 아바타와 상기 대상자의 나이에 대응하는 표준 아바타를 비교하여 상기 대상자의 발육 상태 정보를 식별하는 단계; 상기 대상자의 발육 상태 정보에 따라 식단 프로그램 및 운동 프로그램 중 적어도 하나를 제공하는 단계를 포함한다. 상기 대상자의 발육 상태 정보를 식별하는 단계는, 상기 대상자의 국적에 대응하는 신체 발육 조견표로부터 상 기 대상자의 나이에 대응하는 제2신체 치수 정보를 식별하는 단계; 상기 제2신체 치수 정보를 기반으로 표준 관 절 포인트 값 및 표준 비관절 포인트 값을 생성하는 단계; 표준 관절 포인트 값 및 표준 비관절 포인트 값에 기 초하여 상기 표준 아바타를 생성하여 저장하는 단계를 포함할 수 있다. 상기 방법은, 제공된 상기 식단 프로그램 및 운동 프로그램 중 적어도 하나의 실행 여부에 관한 정보를 수신하 는 단계; 상기 실행 여부에 관한 정보에 따라 상기 리얼 아바타를 수정하는 단계를 포함할 수 있다. 상기 방법은, 발육 예측 희망 시점에 관한 정보를 수신하면, 상기 리얼 아바타 생성 시 확인된 상기 대상자의 발육 상태 정보, 제공된 상기 식단 프로그램 및 운동 프로그램 중 적어도 하나, 상기 실행 여부에 관한 정보 및 상기 대상자의 국적에 대응하는 신체 발육 조견표를 반영하여 상기 리얼 아바타를 성장시키는 단계; 상기 성장 한 리얼 아바타와 상기 희망 시점에서 상기 대상자의 나이에 대응하는 표준 아바타를 비교하여 상기 대상자의 발육 예측 정보를 식별하는 단계를 포함할 수 있다. 상기 방법은, 부위별 목표 신체 치수를 포함하는 제3신체 치수 정보를 식별하는 단계; 상기 제3신체 치수 정보 를 기반으로 목표 관절 포인트 값 및 목표 비관절 포인트 값을 생성하는 단계; 상기 목표 관절 포인트 값 및 목 표 비관절 포인트 값에 기초하여 목표 아바타를 생성하여 저장하는 단계; 상기 리얼 아바타와 상기 목표 아바타 를 비교하여 상기 식단 프로그램 및 운동 프로그램 중 적어도 하나를 제공하는 단계를 포함할 수 있다. 상기 식단 프로그램 및 운동 프로그램 중 적어도 하나를 제공하는 단계는, 상기 리얼 아바타 생성 시 확인된 상 기 대상자의 발육 상태 정보, 제공된 상기 식단 프로그램 및 운동 프로그램 중 적어도 하나, 상기 실행 여부에 관한 정보 및 상기 대상자의 국적에 대응하는 신체 발육 조견표를 반영하여 예측 아바타를 생성하는 단계; 상기 예측 아바타와 상기 목표 아바타를 비교하여 제공된 상기 식단 프로그램 및 운동 프로그램 중 적어도 하나를 조 정하는 단계를 포함할 수 있다. 본 발명에 따른 과제 해결 수단은 아동뿐 아니라 성인의 비만 관리 솔루션에도 적용될 수 있을 것이다."}
{"patent_id": "10-2022-0086976", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따르면, 국가별 신체 발육 조견표를 이용함으로써, 정확하게 대상자의 발육 상태를 확인 하고, 대상자에 대한 식단 프로그램 및 운동 프로그램을 제공할 수 있다. 본 발명의 일 실시예에 따르면, 가상의 공간에서 시각적으로 형성화 된 리얼 아바타와 표준 아바타, 통계 아바 타의 비교를 통해 한눈으로 쉽게 인지할 수 있으므로, 아동의 발육 상태의 관리를 손쉽게 할 수 있다. 본 발명의 일 실시예에 따르면, 아이의 성장발달을 예측하고, 체계적인 관리를 유도할 수 있다."}
{"patent_id": "10-2022-0086976", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명에 따른 바람직한 실시 형태를 첨부된 도면을 참조하여 상세하게 설명한다. 첨부된 도면과 함께 이하에 개시될 상세한 설명은 본 발명의 예시적인 실시형태를 설명하고자 하는 것이며, 본 발명이 실시될 수 있 는 유일한 실시형태를 나타내고자 하는 것이 아니다. 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관 계없는 부분은 생략할 수 있고, 명세서 전체를 통하여 동일 또는 유사한 구성 요소에 대해서는 동일한 참조 부 호를 사용할 수 있다. 도 1은 본 발명의 일 실시예에 따른 아동 발달 케어 장치를 나타낸 도면이다. 도 1을 참조하면, 본 발명에 따른 아동 발달 케어 장치(100, 이하, 케어 장치라 함)는 대상자의 발달 상태 를 확인하고, 그에 맞추어 케어 서비스를 제공하는 장치로써, 컴퓨터, 서버 등으로 구현될 수 있다. 아동의 발육 상태는 생활 환경, 식습관 등에 따라 매우 다양하게 결정될 수 있다. 이에, 국제 기구, 공공기관 등은 성장기 아동의 나이에 따라 표준 몸무게, 표준 키 등 신체 치수를 포함하는 신체 발육 조견표를 만들어 배 포해왔다. 따라서, 신체 발육 조견표와 비교하면 현재 관리가 필요한 성장기의 아동이 어떤 발육 상태를 가지고 있는지 확인이 가능하다. 본 발명은 대상자에 대한 리얼 아바타를 생성하고, 신체 발육 조견표를 이용하여 생성한 표준 아바타를 비교하 여 아동의 현재 발육 상태를 파악 및 그에 맞는 식단 프로그램이나 운동 프로그램을 추천하는 방안에 대해 제안 한다. 본 발명의 일 실시예에 따르면, 케어 장치는 통신부, 입력부, 카메라부, 표시부, 메 모리 및 프로세서를 포함한다. 통신부는 외부 서버(미도시)와의 통신을 수행한다. 이때, 외부 서버는, 신체 발육 조견표를 제공하는 공공 기관에서 사용하는 서버일 수 있다. 이를 위해, 통신부는 5G(5th generation communication), LTE-A(Long Term Evolution-Advanced), LTE(Long Term Evolution), Wi-Fi(Wireless Fidelity) 등의 무선 통신을 수행할 수 있다. 입력부는 케어 장치의 사용자 입력에 대응하여 입력 데이터를 발생시키기 위한 적어도 하나의 입력수 단을 포함한다. 입력부는 키패드, 돔 스위치, 터치 패널, 조그 셔틀, 터치 키 및 메뉴 버튼 등을 포함할 수 있다. 카메라부는 케어 장치의 적어도 일부에 형성되어 케어 장치의 외부에 대한 동영상데이터 및 정 지영상데이터를 포함하는 영상데이터를 획득한다. 이를 위해, 카메라부는 광학적 신호를 수신하여 영상데 이터를 발생시킨다. 카메라부는 카메라 센서와 신호변환부를 구비할 수 있다. 카메라 센서는 광학적 신호 를 전기적 영상신호로 변환한다. 신호변환부는 아날로그 영상신호를 디지털 영상데이터로 변환한다. 표시부는 케어 장치의 동작과 관련된 표시 데이터를 표시한다. 표시부는 액정 디스플레이(LCD; Liquid Crystal Display), 발광 다이오드(LED; Light Emitting Diode) 디스플레이, 유기 발광 다이오드(OLED; Organic LED) 디스플레이, 마이크로 전자기계 시스템(MEMS; Micro Electro Mechanical Systems) 디스플레이 및 전자 종이(Electronic Paper) 디스플레이를 포함한다. 표시부는 입력부와 결합되어 터치스크린(touch screen)으로 구현될 수 있다. 메모리는 케어 장치의 동작 프로그램들을 저장한다. 특히, 메모리는 카메라부에서 획득된 영상데이터, 국가별 신체 발육 조견표를 저장할 수 있다. 메모리는 발육 상태를 식별하고, 그에 맞는 서비 스를 제공하기 위한 AI어플리케이션을 저장한다. 이와 같은 AI어플리케이션은 영상데이터를 기반으로 영상데이터에 포함된 대상자의 신체 치수 정보를 확인하고, 확인된 신체 치수 정보를 기반으로 리얼 아바타를 생성할 수 있다. 또한, AI어플리케이션은 신체 발육 조견표로 부터 표준 신체 치수 정보를 확인하고, 확인된 표준 신체 치수 정보에 기초하여 표준 아바타를 생성할 수 있다. 프로세서는 프로그램 등 소프트웨어를 실행하여 전자장치의 적어도 하나의 다른 구성요소(예: 하드웨 어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이터 처리 또는 연산을 수행할 수 있다. 일 실시예에 따르면, 프로세서는 중앙 처리 장치(CPU) 또는 어플리케이션 프로세서 역할을 수행하는 메인 프로세서 와 이와는 독립적으로 또는 함께 운영 가능한 그래픽 처리 장치(GPU)를 포함할 수 있다. 프로세서는 대상자의 리얼 아바타를 생성하기 위한 생성 신호에 따라 카메라를 활성화하여 상기 대상자를 촬영한 영상데이터를 획득하고, 상기 영상데이터를 분석하여 상기 대상자의 부위별 신체 치수를 포함하는 제1신 체 치수 정보를 식별하고, 상기 제1신체 치수 정보를 기반으로 상기 대상자의 관절 포인트 값 및 비관절 포인트 값을 생성하고, 상기 대상자의 관절 포인트 값 및 비관절 포인트 값에 기초하여 상기 리얼 아바타를 생성하여 저장하고, 상기 리얼 아바타와 상기 대상자의 나이에 대응하는 표준 아바타를 비교하여 상기 대상자의 발육 상 태 정보를 식별하고, 상기 대상자의 발육 상태 정보에 따라 식단 프로그램 및 운동 프로그램 중 적어도 하나를 제공한다. 한편, 프로세서는 상기 동작들을 수행하기 위한 데이터 분석, 처리, 및 결과 정보 생성 중 적어도 일부를 규칙 기반 또는 인공지능(Artificial Intelligence) 알고리즘으로서 기계학습, 신경망 네트워크(neural network), 또는 딥러닝 알고리즘 중 적어도 하나를 이용하여 수행할 수 있다. 신경망 네트워크의 예로는, CNN (Convolutional Neural Network), DNN (Deep Neural Network), RNN (Recurrent Neural Network)과 같은 모델 을 포함할 수 있다. 도 2는 본 발명의 일 실시예에 따른 아동 발달 케어 장치의 동작 흐름도를 나타낸 도면이다. 본 발명의 일 실시예에 따르면, 프로세서는 대상자의 리얼 아바타를 생성하기 위한 생성 신호에 따라 카메 라를 활성화하여 대상자를 촬영한 영상데이터를 획득할 수 있다(S10). 본 발명의 일 실시예에 따르면, 프로세서는 입력부를 통해 생성 신호를 생성하도록 구현된 아이콘을 선택하는 사용자 입력을 수신할 수 있다. 다만, 생성 신호를 수신하는 방식은 본 발명을 한정하지 않는다. 보다 구체적으로, 프로세서는 생성 신호를 수신하면 카메라부를 활성화하여 대상자에 대한 영상데이 터를 획득한다. 이때, 영상데이터는 정지영상데이터 및 동영상데이터를 포함할 수 있다. 본 발명의 일 실시예에 따른 대상자는 아동 발달 케어 장치의 사용자 일 수 있고, 대상자가 유아동인 경우 사용 자는 부모로 대상자와 사용자는 다를 수 있다. 본 발명의 일 실시예에 따르면, 프로세서는 영상데이터를 분석하여 대상자의 부위별 신체 치수를 포함하는 제1신체 치수 정보를 식별한다(S20). 대상자의 부위별 신체 치수는 키, 상체길이, 하체길이, 두상길이, 목길이, 팔길이, 다리길이, 허리길이, 가슴둘 레, 허리둘레, 엉덩이둘레, 허벅지둘레, 종아리둘레, 팔꿈치를 기준으로 위 방향의 팔과 아래 방향의 팔의 두께, 손목둘레, 발목둘레, 목둘레, 두상둘레 등을 포함할 수 있다. 본 발명의 일 실시예에 따르면, 프로세서는 제1신체 치수 정보를 기반으로 대상자의 관절 포인트 값 및 비 관절 포인트 값을 생성할 수 있다(S30). 관절 포인트 값은 키, 상체길이, 하체길이, 두상길이, 목길이, 팔길이, 다리길이, 허리길이 등 신체에서 길이에 대한 기준값이 되는 값이다. 또한, 비관절 포인트 값은, 가슴둘레, 허리둘레, 엉덩이둘레, 허벅지둘레, 종아리둘레, 팔꿈치를 기준으로 위 방향의 팔과 아래 방향의 팔의 두께, 손목둘레, 발목둘레, 목둘레, 두상둘레 등 신체에서 둘레에 대한 기준값이 되는 값이다. 본 발명의 일 실시예에 따르면, 프로세서는 대상자의 관절 포인트 값 및 비관절 포인트 값에 기초하여 리 얼 아바타를 생성하여 저장할 수 있다(S40). 이때, 프로세서는 대상자에 대한 영상데이터가 획득된 시점에 대한 정보, 대상자의 나이, 발육정도, 체형 유형, 입력부로부터 입력된 리얼 아바타를 식별할 수 있는 이름 등을 함께 저장할 수 있다. 본 발명의 일 실시예에 따르면, 프로세서는 리얼 아바타와 대상자의 나이에 대응하는 표준 아바타를 비교 하여 대상자의 발육 상태 정보를 식별할 수 있다(S50). 표준 아바타는 신체 발육 조견표에 나타난 제2신체 치수 정보에 의해 기 생성되어 메모리에 저장되거나, 외부 서버로부터 수신할 수 있다. 한편, 프로세서는 신체 발육 조견표에 나타난 제2신체 치수 정보를 이용하여 표준 아바타를 생성할 수도 있다. 표준 아바타를 생성하는 과정은 도 3을 참조하여 설명한다. 본 발명의 일 실시예에 따르면, 발육 상태 정보는 대상자의 표준 대비 발육의 수준을 나타내는 정보로써, 발육 정도, 체형 유형 등을 포함할 수 있다. 프로세서는 표준 아바타와 비교하여 과성장 하였는지, 저성장 하였는지를 수치로 발육정도를 나타낼 수 있 고, 보다 구체적으로 신체의 전체적인 과성장/저성장 여부, 신체 부위별 과성장/저성장 여부를 수치로 나타낼 수 있다. 이때, 과성장과 저성장 여부는 발육정도를 나타내는 일 카테고리일 뿐, 이에 한정되지 않고 발육정도 를 나누는 기준이나 파라미터는 다양하게 존재할 수 있다. 본 발명의 일 실시예에 따르면, 체형유형은 표준체형, 날씬체형, 통통체형, 비만체형 및 근육질 체형을 포함하 는 다양한 체형유형을 의미한다. 프로세서는 표준 아바타와 비교하여 대상자의 체형이 날씬체형인지 비만체형인지 등을 식별할 수 있다. 프로세서는 대상자의 관절 포인트 값, 비관절 포인트 값과 표준 아바타의 표준 관절 포인트 값 및 표준 비 관절 포인트 값을 비교하여 대상자의 발육정도 및 체형유형을 확인할 수 있다. 본 발명의 일 실시예에 따르면, 프로세서는 대상자의 발육 상태 정보에 따라 식단 프로그램 및 운동 프로 그램 중 적어도 하나를 제공할 수 있다(S60). 이때, 프로세서는 대상자의 발육 상태 정보와 표준 아바타에 기초하여 대상자에게 적합한 식단 프로그램 및 운동 프로그램을 식별하도록 학습된 AI 모델을 통해 식단 프로그램 및 운동 프로그램을 제공할 수 있다. 아울러, 본 발명의 실시 예에서는 프로세서가 메모리에 저장된 AI어플리케이션을 동작시켜 리얼 아바 타 생성, 성장 및 발육 상태 정보를 식별하는 것을 예로 설명하고 있으나, 반드시 이에 한정되는 것은 아니다. 특히, 케어 장치가 통신부를 통해 AI서버(미도시)와 통신을 수행할 경우, AI서버와의 통신을 통해 AI 서버에서 수행되는 리얼 아바타의 생성, 성장 및 발육 상태 정보를 확인할 수 있다. 본 발명의 일 실시예에 따르면, 국가별 신체 발육 조견표를 이용함으로써, 정확하게 대상자의 발육 상태를 확인 하고, 대상자에 대한 식단 프로그램 및 운동 프로그램을 제공할 수 있다. 본 발명의 일 실시예에 따르면, 대상자의 실측을 기반으로 한 관절과 비관절 포인트를 연결하여 생성된 아바타 는 가상공간에 축소된 대상자의 리얼한 사이즈와 리얼한 이미지의 리얼 아바타이다. 본 발명의 일 실시예에 따른 케어 장치 및 방법은 아이의 발달 케어 뿐 아니라 성인의 비만 관리에도 적용 될 수 있음은 당연하다. 따라서, 케어 장치는 대상자의 리얼한 사이즈의 변화와 그로 인한 리얼한 이미지의 변화가 결과에 도달하 기 전 예측 아바타를 통해 예측할 수 있어 식단과 운동량을 조절하며 목표 아바타를 향해 식단과 운동량의 완 급 조절을 수행할 수 있다. 이때, 케어 장치에서 생성된 리얼 아바타나 예측 아바타는 사용자 혹은 대상자의 디바이스(이하, 디바이스 라 한다.)에 표시되어 사용자 혹은 대상자는 직관적으로 대상자의 변화를 확인하고, 이를 통해 편리하게 케어할 수 있다. 이때, 디바이스는 스마트폰, 태블릿 PC, 컴퓨터 등 디스플레이 기능을 구현하는 전자기기이면 제한하 지 않는다. 보다 구체적으로, 디바이스에는 목표 아바타에 도달하려면 어떠한 식단 관리나 운동 관리가 필요한지, 현재 진 행하고 있는 식단 관리와 운동 관리를 계속하게 되면 일정기간 후에는 목표 아바타에 도달할 것인지를 예측 아 바타 등 각각의 아바타를 표시하고, 목표 아바타에 도달하기 위해서 필요한 식단 프로그램과 운동 프로그램을 표시하여 사용자 혹은 대상자가 눈으로 보면서 관리할 수 있게 한다. 도 3은 본 발명의 일 실시예에 따른 아동 발달 케어 장치의 표준 아바타를 생성하는 동작 흐름도를 도시한 도면 이다. 본 발명의 일 실시예에 따르면, 프로세서는 대상자의 국적에 대응하는 신체 발육 조견표로부터 대상자의 나이에 대응하는 제2신체 치수 정보를 식별한다(S51). 본 발명의 일 실시예에 따르면, 국가별로 사람, 특히 유아동의 신체 발육 정도가 다를 수 있는 바, 보다 정확한 아바타 생성 및 성장을 위해 국가별 신체 발육 조견표를 이용한다. 이때, 신체 발육 조견표는 연령, 연령에 대응되는 평균신장, 평균 가슴둘레 등 부위별 신체 치수를 포함할 수 있다. 본 발명의 일 실시예에 따르면, 프로세서는 외부 서버로부터 대상자의 국적에 대응하는 국가별 신체 발육 조견표를 수신하거나, 국가별 신체 발육 조견표를 메모리에 저장하고 대상자의 국적에 대응하는 신체 발육 조견표를 식별할 수 있으며, 어느 하나에 한정되는 것은 아니다. 프로세서는 입력부를 통해 국적에 관한 사용자 입력을 수신하거나, 사용자가 접속한 아동 발달 케어 AI 어플리케이션의 운영 국가, IP 등을 통해 식별할 수 있으며, 국적 정보를 식별하는 방법은 본 발명을 한정하 지 않는다. 부위별 신체 치수는 키, 상체길이, 하체길이, 두상길이, 목길이, 팔길이, 다리길이, 허리길이, 가슴둘레, 허리 둘레, 엉덩이둘레, 허벅지둘레, 종아리둘레, 팔꿈치를 기준으로 위 방향의 팔과 아래 방향의 팔의 두께, 손목둘 레, 발목둘레, 목둘레, 두상둘레 등을 포함할 수 있다. 본 발명의 일 실시예에 따르면, 프로세서는 제2신체 치수 정보를 기반으로 표준 관절 포인트 값 및 표준 비관절 포인트 값을 생성할 수 있다(S30). 표준 관절 포인트 값은 키, 상체길이, 하체길이, 두상길이, 목길이, 팔길이, 다리길이, 허리길이 등 신체에서 길이에 대한 기준값이 되는 표준값이다. 또한, 표준 비관절 포인트 값은, 가슴둘레, 허리둘레, 엉덩이둘레, 허벅지둘레, 종아리둘레, 팔꿈치를 기준으로 위 방향의 팔과 아래 방향의 팔의 두께, 손목둘레, 발목둘레, 목둘레, 두상둘레 등 신체에서 둘레에 대한 기준 값이 되는 표준값이다. 본 발명의 일 실시예에 따르면, 프로세서는 표준 관절 포인트 값 및 표준 비관절 포인트 값에 기초하여 표 준 아바타를 생성하여 저장할 수 있다(S53). 이때, 프로세서는 대상자에 대한 영상데이터가 획득된 시점에 대한 정보, 대상자의 나이, 발육정도, 체형 유형, 입력부로부터 입력된 리얼 아바타를 식별할 수 있는 이름 등을 함께 저장할 수 있다. 본 실시예의 확장되는 예로서, 대상자의 발육 상태를 다른 대상자들의 발육 상태와 비교할 수 있도록 통계 아바 타를 추가로 도입할 수 있다. 통계 아바타는 복수의 대상자를 기준으로 통계를 낸 아바타로 지역별, 나라별, 대륙별, 전 세계 기준 등으로 나 누어 구역 내 평균적인 수치를 기준으로 생성될 수 있고, 혹은 높은 비중을 차지하는 수치를 기준으로 생성될 수 있다. 프로세서는 서비스를 이용하는 복수의 대상자의 발육 상태 정보나, 복수의 대상자의 리얼 아바타 생성 데 이터를 통해 통계 데이터를 추출해내고, 통계 데이터를 기초로 하여 통계 아바타를 생성할 수 있다. 프로세서 는 통계 데이터 추출 및 분류를 위해 사용자가 접속한 아동 발달 케어 AI 어플리케이션의 운영 국가, IP 등을 통해 식별할 수 있으며, 지역 정보를 식별하는 방법은 본 발명을 한정하지 않는다. 이때, 통계 아바타를 생성함에 있어 관절 포인트 값, 비관절 포인트 값을 이용할 수 있음은 표준 아바타와 동일 하다. 프로세서는 생성된 통계 아바타를 이용하여 대상자의 발육 상태 정보를 식별할 수 있다. 도 4는 본 발명의 일 실시예에 따른 희망 시점에서 발육 상태를 예측하는 동작 흐름도를 나타낸 도면이다. 본 발명의 일 실시예에 따르면, 사용자는 대상자의 현재 신체 치수 정보에 기초하여 현재의 발육 상태 정보를 요청할 뿐 아니라, 향후 미래의 어느 시점(발육 예측 희망 시점이라고 한다.)의 발육 상태 정보까지 요청할 수 있다. 특히, 대상자가 유아동의 경우 하루가 다르게 성장하므로 사용자는 제공받은 식단 프로그램이나 운동 프로그램 의 실행 하는 경우 등의 상황에서 대상자가 표준 발육 상태로 성장할 수 있을지 확인하기를 희망할 수 있다. 따라서, 프로세서는 발육 예측 희망 시점에 관한 정보를 수신하면(S410의 Yes), 리얼 아바타를 성장시킬 수 있다(S420). 희망 시점에 관한 정보를 수신하지 않으면(S410의 No), 해당 알고리즘을 시작하지 않는다. 희망 시점에 관한 정보는 아동의 발육 상태를 확인하고자 하는 시점에 관한 정보를 의미하며, 예를 들어 6개월 후나 1년 후 등일 수 있으며, 구체적인 날짜를 통해 나타낼 수 있다.프로세서는 리얼 아바타를 성장시키기 위해, 기 생성된 리얼 아바타 생성 시 확인된 대상자의 발육 상태 정보, 제공된 식단 프로그램 및 운동 프로그램 중 적어도 하나, 제공된 프로그램에 대한 실행 여부에 관한 정보 및 신체 발육 조견표를 식별할 수 있다. 이 외에도, 프로세서는 기 생성된 리얼 아바타 생성의 기반이 된 영상데이터의 촬영날짜, 대상자의 생년월 일, 리얼 아바타 생성 시 확인된 관절 포인트 값 및 비관절 포인트 값을 식별하거나, 대상자의 활동량을 포함하 는 설문 조사 정보를 수신하여 리얼 아바타의 성장에 반영할 수 있다. 프로세서는 상기 식별한 정보들에 기초하여 현재 시점 혹은 미래 시점을 포함하는 희망 시점에서의 대상자 의 성장 속도를 분석하고, 기 생성된 리얼 아바타를 자동적으로 성장시킬 수 있다. 이때, 프로세서는 기 생성된 리얼 아바타는 대상자에 대해 이미 생성되어 저장된 리얼 아바타를 식별함으 로써 획득한다. 이를 위해, 프로세서는 대상자의 얼굴 분석을 수행하여 메모리에 저장된 적어도 하나의 리얼 아바타 를 생성한 기반이 되는 적어도 하나의 레퍼런스 대상자 중에서 대상자와 동일한 레퍼런스 대상자가 존재하는지 확인한다. 본 실시예는 대상자에 대응하는 리얼 아바타가 존재하는 경우를 가정하여 설명한다. 프로세서는 제공된 식단 프로그램 및 운동 프로그램 중 적어도 하나의 실행 여부에 관한 정보를 수신할 수 있다. 실행 여부에 관한 정보는, 일자 별로 혹은 일정 주기 별로 제공된 식단 프로그램에 맞춰 식사를 하고 있는 지, 제공된 운동 프로그램에 맞춰 운동을 하고 있는 지에 대해 대상자가 입력한 정보이다. 실행 여부에 관한 정보는 대상자가 실행하는 하루 또는 1주일의 식단(아침, 점심, 저녁 식단 포함)과 운동량에 관한 정보를 포함할 수 있 다. 프로세서는 입력부를 통해 실행 여부에 관한 정보를 입력하는 사용자 입력을 수신할 수 있다. 본 발명의 일 실시예에 따르면, 프로세서는 실행 여부에 관한 정보를 통해 대상자의 섭취 칼로리 및 소비 칼로리를 계산할 수 있다. 이때, 케어 장치는 식단, 운동량을 입력하는 경우 그에 대응하는 섭취 칼로리, 소비 칼로리를 계산하는 별도의 프로그램을 메모리에 저장할 수 있다. 프로세서는 성장한 리얼 아바타와 희망 시점에서 대상자의 나이에 대응하는 표준 아바타를 비교하여 대상 자의 발육 예측 정보를 식별 할 수 있다(S430). 표준 아바타는 희망 시점에서의 신체 발육 조견표에 대응하는 아바타로써, 프로세서는 희망 시점의 표준 아바타를 생성할 수 있다. 본 발명의 일 실시예에 따르면, 발육 예측 정보는 대상자의 희망 시점의 표준 대비 발육의 수준을 나타내는 정 보로써, 제공된 식단 프로그램이나 운동 프로그램을 실천하는 여부에 따라 달라지는 발육정도 및 체형유형을 포 함할 수 있다. 본 발명의 일 실시예에 따르면, 희망 시점의 발육 상태를 식별함으로써 대상자의 발달 과정을 예측할 수 있고, 이를 피드백 정보로 삼아 제공된 식단 프로그램이나 운동 프로그램을 조정하거나, 프로그램을 착실히 수행하도 록 의욕을 고취시킬 수 있다. 본 발명의 일 실시예에 따르면, 식단프로그램과 운동 프로그램의 실행에 따른 빅데이터 분석을 통해 일정기간 후의 예측 아바타를 생성하여 대상자의 성장 발달을 예측하고, 체계적인 관리를 유도해낼 수 있다. 한편, 다른 예로 프로세서는 제공된 식단 프로그램 및 운동 프로그램 중 적어도 하나의 실행 여부에 관한 정보를 수신하고, 실행 여부에 관한 정보에 따라 대상자의 리얼 아바타를 수정할 수 있다. 이를 위해, 프로세서는 리얼 아바타의 수정을 요청하는 신호를 수신하고, 리얼 아바타 생성 시에 확인된 대상자의 발육 상태 정보, 실행 여부에 관한 정보, 리얼 아바타 생성 날짜 및 수정 요청 신호를 수신한 날짜의 차이 및 신체 발육 조견표를 반영하여 선택된 리얼 아바타를 수정할 수 있다. 도 5는 본 발명의 일 실시예에 따른 아동 발달 케어 장치의 목표 아바타를 이용하여 목표 도달 여부를 식별하는 동작 흐름도를 나타낸 도면이다. 본 발명의 일 실시예에 따르면, 현재 대상자의 발육 상태가 표준 과 비교하여 현저히 모자라는 경우가 존재할 수 있다. 이 경우, 표준에 맞추어 식단 프로그램이나 운동 프로그램을 짜게 되면 대상자에게 너무 혹독하거나, 실행 의욕을 저하시킬 수 있다. 혹은, 표준 발육 상태가 아닌 희망하는 발육 상태가 존재할 수 있다. 이러한 다양한 경우를 반영하기 위해, 본 발명은 목표 아바타를 설정하는 방안을 제안한다. 프로세서는 부위별 목표 신체 치수를 포함하는 제3신체 치수 정보를 식별한다(S510). 프로세서는 입 력부를 통해 제3신체 치수 정보에 관한 사용자 입력을 수신할 수 있다. 이때, 프로세서는 목표 아바 타의 생성을 요청하는 요청 신호를 수신할 수 있다. 부위별 목표 신체 치수는 키, 상체길이, 하체길이, 두상길이, 목길이, 팔길이, 다리길이, 허리길이, 가슴둘레, 허리둘레, 엉덩이둘레, 허벅지둘레, 종아리둘레, 팔꿈치를 기준으로 위 방향의 팔과 아래 방향의 팔의 두께, 손 목둘레, 발목둘레, 목둘레, 두상둘레 등을 포함할 수 있다. 본 발명의 일 실시예에 따르면, 프로세서는 제3신체 치수 정보를 기반으로 목표 관절 포인트 값 및 목표 비관절 포인트 값을 생성하여 목표 아바타 생성할 수 있다(S520). 목표 관절 포인트 값은 키, 상체길이, 하체길이, 두상길이, 목길이, 팔길이, 다리길이, 허리길이 등 신체에서 길이에 대한 기준값이 되는 목표값이다. 또한, 목표 비관절 포인트 값은, 가슴둘레, 허리둘레, 엉덩이둘레, 허벅지둘레, 종아리둘레, 팔꿈치를 기준으로 위 방향의 팔과 아래 방향의 팔의 두께, 손목둘레, 발목둘레, 목둘레, 두상둘레 등 신체에서 둘레에 대한 기준 값이 되는 목표값이다. 본 발명의 일 실시예에 따르면, 프로세서는 목표 아바타를 생성하여 저장할 수 있다. 이때, 프로세서(16 0)는 목표 아바타의 생성을 요청한 대상자의 정보를 함께 저장할 수 있다. 본 발명의 일 실시예에 따르면, 프로세서는 리얼 아바타와 목표 아바타를 비교하여 식단 프로그램 및 운동 프로그램 중 적어도 하나를 제공할 수 있다(S530). 이때, 프로세서는 대상자의 발육 상태 정보와 목표 아바타에 기초하여 대상자에게 적합한 식단 프로그램 및 운동 프로그램을 식별하도록 학습된 AI 모델을 통해 식단 프로그램 및 운동 프로그램을 제공할 수 있다. 이 외에도, 대상자의 발달 케어 혹은 비만 케어가 필요하다고 생각되어 기간과 목표 아바타를 설정한 경우, 사 용자 혹은 대상자는 직접 섭취 칼로리량 및 소비 칼로리량을 선택하여 AI 모델을 통해 제공받은 식단 프로그램 및 운동 프로그램을 조정하는 등 주도적으로 프로그램을 설정할 수 있다. 보다 구체적으로, 프로세서는 대상자가 선호하는 음식, 운동 및 기타 꼭 배려해야 하는 사항들을 입력하는 사용자 입력을 수신함으로써 좀 더 개인화된 케어를 받을 수 있다. 이 외에도, 해당 사항들을 포함하는 정보를 외부로부터 수신할 수 있다. 사용자 혹은 대상자는 섭취 칼로리량 및 소비 칼로리량을 선택하여 주도적으로 아래의 5가지 유형의 프로그램을 제공받을 수 있다. 1. 식단 관리만을 통한 목표 기간, 목표 아바타 설정 및 그에 따른 식단 프로그램, 2. 운동에 의한 칼로리 소비만을 통한 목표 기간, 목표 아바타 설정 및 그에 따른 운동 프로그램, 3. 식단 관리와 운동에 의한 칼로리 소비를 병행하되 식단 관리에 치중된 식단 프로그램 및 운동 프로그램, 4. 식단 관리와 운동에 의한 칼로리 소비를 병행하되 운동 관리에 치중된 식단 프로그램 및 운동 프로그램, 5. 식단 관리와 운동에 의한 칼로리 소비를 균형있게 병행하는 식단 프로그램 및 운동 프로그램. 다만, 이에 한정되는 것은 아니고 사용자 혹은 대상자가 직접 설정할 수 있을 것이다. 목표 아바타를 설정하는 본 실시예에서도 프로세서는 입력부를 통해 실행 여부에 관한 정보를 입력하 는 사용자 입력을 수신할 수 있다. 프로세서는 실행 여부에 관한 정보를 통해 대상자의 섭취 칼로리량 및 소비 칼로리를 계산할 수 있다. 이 를 통해 프로세서는 리얼 아바타 생성 시 확인된 대상자의 발육 상태 정보, 제공된 식단 프로그램 및 운동 프로그램 중 적어도 하나, 실행 여부에 관한 정보 및 대상자의 국적에 대응하는 신체 발육 조견표를 반영하여 예측 아바타를 생성하여 목표 아바타에 도달하기까지의 과정을 디바이스에 제공할 수 있다. 사용자 혹은 대상자는 디바이스를 통해 자신의 변화를 눈으로 확인하며 식단 프로그램이나 운동 프로그램을 조절할 수 있다. 본 발명의 일 실시예에 따른 식단 프로그램은 한끼 분량의 칼로리가 표시된 다양한 음식 사진이 제공되며, 음식 사진을 이용하여 본인이 직접 칼로리를 계산하는 프로그램을 통해 더하거나 빼면서 하루 또는 1주일 1달의 식단 표를 직접 식단을 짤 수도 있으며, AI를 통해 식단표를 손쉽게 제공 받을 수 있다. 마찬가지로 칼로리 소비량이 표시된 부위별 운동별 사진을 시간에 곱하면 소비 칼로리가 책정이 되어 식단관리 를 통한 섭취 칼로리량과 활동량에 따른 소비 칼로리량을 계산하여 목표 아바타에 도달하기 까지의 시간을 예측 할 수 있고, 예측 아바타를 통해 시간과 식단, 운동량 등을 조절할 수 있다."}
{"patent_id": "10-2022-0086976", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 아동 발달 케어 장치를 나타낸 도면이다. 도 2는 본 발명의 일 실시예에 따른 아동 발달 케어 장치의 동작 흐름도를 나타낸 도면이다. 도 3은 본 발명의 일 실시예에 따른 아동 발달 케어 장치의 표준 아바타를 생성하는 동작 흐름도를 도시한 도면 이다. 도 4는 본 발명의 일 실시예에 따른 희망 시점에서 발육 상태를 예측하는 동작 흐름도를 나타낸 도면이다. 도 5는 본 발명의 일 실시예에 따른 아동 발달 케어 장치의 목표 아바타를 이용하여 목표 도달 여부를 식별하는 동작 흐름도를 나타낸 도면이다."}
