{"patent_id": "10-2018-0008272", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2018-0120564", "출원번호": "10-2018-0008272", "발명의 명칭": "마사지 장치 및 마사지 시스템", "출원인": "패밀리 이나다 가부시키가이샤", "발명자": "이나다, 니치무"}}
{"patent_id": "10-2018-0008272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "이용자를 마사지하는 마사지부를 구비한 마사지 장치로서,음성 입력부와,음성 출력부와,적어도 의사의 지식ㆍ노하우에 관한 축적된 데이터에 의거하여 진단, 조언을 판단하는 인공지능부를 구비하며,상기 인공지능부는, 상기 이용자와의 대화에 의해 상기 음성 입력부로부터 입력된 상기 이용자의 음성정보에 따라, 적어도 상기 의사의 지식ㆍ노하우에 관한 데이터에 의거하여 상기 이용자에게 상응한 진단 및 적합한 조언중 적어도 하나를 판단하여 상기 음성 출력부에서 출력하도록 구성되어 있는 것을 특징으로 하는 마사지 장치."}
{"patent_id": "10-2018-0008272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에서,상기 인공지능부는, 적어도 복수의 상이한 분야의 복수의 의사의 지식ㆍ노하우에 관한 축적된 데이터에 의거하여 상기 이용자에게 상응한 진단 및 적합한 조언 중 적어도 하나를 판단하도록 구성되어 있는, 마사지 장치."}
{"patent_id": "10-2018-0008272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에서,상기 이용자가 입력하는 항목 선택부를 더 구비하며,상기 인공지능부는, 상기 이용자가 상기 항목 선택부에서 선택한 항목에 관해, 상기 이용자의 음성정보에 따라상기 의사의 지식ㆍ노하우에 관한 축적된 데이터에 의거하여 당해 이용자에게 상응한 상기 진단 및 적합한 조언중 적어도 하나를 판단하도록 구성되어 있는, 마사지 장치."}
{"patent_id": "10-2018-0008272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에서,상기 이용자의 신체상태를 얻는 신체상태 획득부를 구비하며,상기 인공지능부는, 상기 이용자의 음성정보에 상기 신체상태 획득부로부터 얻은 상기 신체상태를 가미하여 당해 이용자에게 상응한 상기 진단 및 적합한 조언 중 적어도 하나를 판단하도록 구성되어 있는, 마사지 장치."}
{"patent_id": "10-2018-0008272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에서,상기 이용자의 개인정보를 기억하는 기억부를 구비하며,상기 인공지능부는, 상기 이용자의 음성정보에 상기 기억부에 기억된 상기 개인정보를 가미하여 당해 이용자에게 상응한 상기 진단 및 적합한 조언 중 적어도 하나를 판단하도록 구성되어 있는, 마사지 장치."}
{"patent_id": "10-2018-0008272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에서,상기 이용자를 촬영하는 촬영부를 구비하며,상기 인공지능부는, 상기 이용자의 음성정보에 상기 촬영부로부터 촬영한 촬영정보를 가미하여 당해 이용자에게상응한 상기 진단 및 적합한 조언 중 적어도 하나를 판단하도록 구성되어 있는, 마사지 장치.공개특허 10-2018-0120564-3-청구항 7 제1항에서,상기 인공지능부는, 상기 이용자에 대한 상기 진단 및 적합한 조언 중 적어도 어느 하나를 정보 기억부에 축적하고, 당해 이용자의 재이용시의 음성정보에 상기 정보 기억부에 축적된 상기 진단 및 적합한 조언 중 적어도어느 하나를 가미하여 당해 이용자의 재이용시에 상응한 새로운 상기 진단 및 적합한 조언 중 적어도 하나를 판단하도록 구성되어 있는, 마사지 장치."}
{"patent_id": "10-2018-0008272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에서,적어도 일시 정보를 가지는 시계부를 구비하며,상기 인공지능부는, 상기 시계부에서 얻은 상기 이용자의 이용 일시 정보를 가미하여 당해 이용자에게 상응한상기 진단 및 적합한 조언 중 적어도 하나를 판단하도록 구성되어 있는, 마사지 장치."}
{"patent_id": "10-2018-0008272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항 내지 제8항 중 어느 한 항에 기재된 마사지 장치는, 적어도, 상기 이용자가 착석하는 좌석부와, 좌석부에착석한 상기 이용자의 상반신을 후방에서 지지하는 등받이부와, 마사지를 시행하는 상기 마사지부와, 상기 마사지부를 제어하는 제어부를 가지는 의자형 마사지 장치이며,상기 인공지능부는, 상기 좌석부에 착석한 상기 이용자에 대하여 상기 마사지부로 촉진을 수행하고, 상기 이용자의 음성정보에 상기 촉진결과를 가미하여 당해 이용자에게 상응한 상기 진단 및 적합한 조언 중 적어도 하나를 판단하도록 구성되어 있는, 마사지 장치."}
{"patent_id": "10-2018-0008272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항 내지 제8항 중 어느 한 항에서,상기 인공지능부는, 상기 진단 및 적합한 조언 중 적어도 하나의 판단결과에 의거하여, 적합한 마사지 코스의추천 또는 마사지의 금지를 촉구하도록 구성되어 있는, 마사지 장치."}
{"patent_id": "10-2018-0008272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항 내지 제8항 중 어느 한 항에 기재된 마사지 장치를 구비한 마사지 시스템으로서,상기 인공지능부는, 통신 네트워크를 통해 서버와 접속되고, 축적되어 있는 상기 의사의 지식ㆍ노하우에 관한데이터를 갱신할 수 있도록 구성되어 있는, 마사지 시스템."}
{"patent_id": "10-2018-0008272", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "[과제] 인공 지능을 이용하여, 이용자의 증상에 상응한 진단 및 적합한 조언 중 적어도 하나를 얻을 수 있는 마 사지 장치를 제공하는 것. [해결수단] 이용자를 마사지하는 마사지부를 구비한 마사지 장치로서, 음성 입력부와, 음성 출력부와, 적어도 의 사의 지식ㆍ노하우에 관한 축적된 데이터에 의거하여 진단, 조언을 판단하는 인공지능부를 구비하며, 인공지능부 는, 이용자와의 대화에 의해 음성 입력부로부터 입력된 이용자의 음성정보에 따라, 적어도 의사의 지식ㆍ노하우 에 관한 데이터에 의거하여 이용자에게 상응한 진단 및 적합한 조언 중 적어도 어느 하나를 판단하여 상기 음성 출력부에서 출력하도록 구성되어 있다."}
{"patent_id": "10-2018-0008272", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 이용자의 각 부분을 마사지하는 마사지 장치 및 마사지 시스템에 관한 것이다."}
{"patent_id": "10-2018-0008272", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "종래, 이용자의 신체 각 부분을 마사지하는 마사지 장치가 있다. 예를 들면, 어깨나 목을 마사지하는 핸디 (handy) 마사지 장치, 허리, 등 부분을 마사지하는 쿠션 마사지 장치, 발이나 종아리를 마사지 풋(foot) 마사지 장치, 허리, 등, 어깨 등을 마사지하는 의자형 마사지 장치 등이 있다. 이러한 마사지 장치는, 이용자가 예를 들면 하루에 1회 정도 사용하고 있다. 마사지 장치를 사용하는 이용자는, 어깨 결림, 허리 통증, 다리의 피로 등, 그때의 이용자의 증상을 완화하기 위해 사용한다. 이에, 예를 들어, 이용자의 신체 컨디션에 따라 적절한 마사지가 시행되도록, 이용자에게 문진 을 수행하고, 이용자의 답변을 바탕으로 이용자의 신체 컨디션을 판정하도록 한 마사지기가 있다(예를 들어, 특 허문헌 1 참조). 이 마사지기에서는, 이용자에게 문진을 수행하고, 이용자는 그 문진에 대해 '예' 또는 '아니오' 중 하나로 답변하도록 되어 있다.선행기술문헌 특허문헌 (특허문헌 0001) 일복 특허공개 제2000-70318호 공보"}
{"patent_id": "10-2018-0008272", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "그런데 마사지 장치를 사용하는 이용자는, 신체 컨디션 불량 등의 증상이 있는 경우에는, 그 원인이나 대책 등 에 관하여 알고 싶을 경우가 있다. 이 경우, 통상적으로, 이용자가 신체 컨디션 불량 등의 증상의 원인 등을 알 려면, 그 증상에 맞는 병원에 가서, 그 증상의 전문의에게 진단을 받음으로써 원인이나 병명, 증상에 적합한 조 언(어드바이스) 등을 들어야 한다. 그러나 각 전문 의료분야에 정통한 의사가 많더라도, 한 사람이 모든 의료분 야·환부의 증상에 정통한 의사는 매우 적다. 그 때문에, 각 분야의 전문의에게 진찰을 받지 못하면, 자신이 무 슨 질병이나 증상인지를 알 수 없는 경우가 있다. 더구나, 의료기관이 멀리 떨어져 있을 경우나 기상 악화 등의 경우도 있다. 이 때문에, 이용자는, 신체 컨디션 불량 등의 증상이 있더라도 의료기관에 다니기를 주저하는 경 우가 있다. 또한, 신체 컨디션 불량 등의 증상이 있을 경우, 자신의 신체 컨디션에 적절한 마사지 코스 등을 알고 싶은 경 우가 있다. 또한, 상기 특허문헌 1의 마사지기에서는, 이용자에게 수행되는 문진의 내용은 미리 설정된 내용이고, 이용자의 답변도 '예' 또는 '아니오'중 하나이기 때문에, 신체 컨디션의 판정으로부터 선택되는 마사지는 한정된 내용이 된다. 더욱이, 이용자의 신체 컨디션 불량 등에 적합한 조언 등은 할 수가 없다. 이에, 본 발명은, 인공 지능을 이용하여, 이용자의 증상에 상응한 진단 및 적합한 조언 중 적어도 하나를 얻을 수 있는 마사지 장치 및 마사지 시스템을 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2018-0008272", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위하여, 본 발명에 따른 마사지 장치는, 이용자를 마사지하는 마사지부를 구비한 마사지 장치로서, 음성 입력부와, 음성 출력부와, 적어도 의사의 지식ㆍ노하우에 관한 축적된 데이터에 의거하여 진단, 조언을 판단하는 인공지능부를 구비하며, 상기 인공지능부는, 상기 이용자와의 대화에 의해 상기 음성 입력부로 부터 입력된 상기 이용자의 음성정보에 따라, 적어도 상기 의사의 지식ㆍ노하우에 관한 데이터에 의거하여 상기 이용자에게 상응한 진단 및 적합한 조언 중 적어도 어느 하나를 판단하여 상기 음성 출력부에서 출력하도록 구 성되어 있다. 본 명세서 및 청구범위 중의 '이용자의 음성정보'는, 신체 컨디션에 관한 정보, 증상에 관한 정보, 마사지에 관한 정보를 포함한다. 인공지능부에 축적된 데이터는, 의사의 지식ㆍ노하우 이외에, 다양한 분 야의 지식을 축적시킬 수 있다. 이 구성에 의해, 이용자가 마사지 장치의 음성 입력부로부터 신체 컨디션 등을 포함하는 음성정보를 입력하면, 인공지능부가 의사의 지식ㆍ노하우에 관한 축적 된 데이터에 의거하여 이용자에게 상응한 진단이나 조언을 판단 하여, 음성 출력부로부터 출력한다. 이에 따라, 이용자는, 마사지 장치와의 대화로 자신의 증상에 상응한 진단 이나 적합한 조언을 얻을 수가 있다. 이용자는, 마사지 장치에서 신체 컨디션 등에 관한 진단이나 적합한 조언 을 얻을 수 있기 때문에, 병원에 갈 시간, 비용, 노력을 줄일 수 있다. 또한, 상기 인공지능부는, 적어도 복수의 상이한 분야의 복수의 의사의 지식ㆍ노하우에 관한 축적된 데이터에 의거하여 상기 이용자에게 상응한 진단 및 적합한 조언 중 적어도 어느 하나를 판단하도록 구성되어 있어도 좋 다. 본 명세서 및 청구범위 중의 '상이한 분야'는, 상이한 진료과 분야, 동일한 진료과이더라도 전문이 상이한 분야 등을 포함한다. 이와 같이 구성하면, 인공지능부는, 이용자의 음성정보에 대해 상이한 진료과나 상이한 전문분야의 여러 의사의 지식ㆍ노하우를 바탕으로, 다각적인 관점에서 이용자에게 상응한 진단이나 적합한 조언을 판단할 수가 있다. 또한, 상기 이용자가 입력하는 항목 선택부를 더 구비하며, 상기 인공지능부는, 상기 이용자가 상기 항목 선택 부에서 선택한 항목에 관해, 상기 이용자의 음성정보에 따라 상기 의사의 지식ㆍ노하우에 관한 축적된 데이터에의거하여 당해 이용자에게 상응한 상기 진단 및 적합한 조언 중 적어도 어느 하나를 판단하도록 구성되어 있어 도 좋다. 본 명세서 및 청구범위 중의 '항목 선택부'는, '열', '혈압', '어깨 결림', '요통', '두통', '복통', '변비', '어지러움', '부종', '소변 문제', '불면증', '우울증' 등의 항목을 포함한다. 이와 같이 구성하면, 이용자가 걱정이 되는 증상을 항목 선택부에서 선택함으로써, 인공지능부가 수행할 진단이 나 적합한 조언의 시간과 정밀도를 더욱 높일 수가 있다. 또한, 상기 이용자의 신체상태를 얻는 신체상태 획득부를 구비하며, 상기 인공지능부는, 상기 이용자의 음성정 보에 상기 신체상태 획득부로부터 얻은 상기 신체상태를 가미하여 당해 이용자에게 상응한 상기 진단 및 적합한 조언 중 적어도 어느 하나를 판단하도록 구성되어 있어도 좋다. 본 명세서 및 청구범위 중의 '신체상태 획득 부'는, 혈압계, 신체 조성계, 스트레스 지수 계측기 등을 포함한다. '신체상태'는, '맥박수', '체중', '체지방 률', '스트레스 지수' 등을 포함한다. 이와 같이 구성하면, 인공지능부는, 이용자의 음성정보와 신체상태로부터, 이용자에 대해 더욱 세밀한 진단이나 적절한 조언을 할 수가 있다. 또한, 상기 이용자의 개인정보를 기억하는 기억부를 구비하며, 상기 인공지능부는, 상기 이용자의 음성정보에 상기 기억부에 기억된 상기 개인정보를 가미하여 당해 이용자에게 상응한 상기 진단 및 적합한 조언 중 적어도 어느 하나를 판단하도록 구성되어 있어도 좋다. 본 명세서 및 청구범위 중의 '개인정보'에는, '나이', '체중', '신장', '성별', '가족 구성', '가족의 병력' 등을 포함할 수 있다. 이와 같이 구성하면, 인공지능부는, 이용자의 음성정보에 개인정보를 가미하여, 이용자에게 가능성이 있는 질병 이나 그 대책방법의 진단이나 적합한 조언을 할 수 있다. 예를 들면, 이용자의 음성정보와 가족의 병력으로부터, 증상에 따른 질병의 염려나 적합한 진료과를 권하는 것 등을 할 수 있다. 또한, 상기 이용자를 촬영하는 촬영부를 구비하며, 상기 인공지능부는, 상기 이용자의 음성정보에 상기 촬영부 로부터 촬영한 촬영정보를 가미하여 당해 이용자에게 상응한 상기 진단 및 적합한 조언 중 적어도 어느 하나를 판단하도록 구성되어 있어도 좋다. 이와 같이 구성하면, 인공지능부는, 이용자의 음성정보 이용자의 피부색이나 피부 탄력 등의 촬영정보를 가미하 여, 이용자에게 상응한 진단이나 적합한 조언, 운동 메뉴의 제안, 식사 메뉴의 제안 등의 조언을 할 수 있다. 또한, 상기 인공지능부는, 상기 이용자에 대한 상기 진단 및 적합한 조언 중 적어도 어느 하나를 정보 기억부에 축적하고, 당해 이용자의 재이용시의 음성정보에 상기 정보 기억부에 축적된 상기 진단 및 적합 조언 중 적어도 어느 하나를 가미하여 당해 이용자의 재이용시에 상응한 새로운 상기 진단 및 적합한 조언 중 적어도 어느 하나 를 판단하도록 구성되어 있어도 좋다. 이와 같이 구성하면, 인공지능부는, 정보 기억부에 축적된 정보와, 이용자의 재이용시의 음성정보 등을 비교검 토하여 재이용시에 상응한 진단이나 적합한 조언을 판단할 수 있다. 이른바, 재진(再診) 기능을 구비할 수 있다. 재진 기능에 의해, 병원에 다시 갈 시간, 비용, 노력을 줄일 수 있다. 또한, 적어도 일시(日時) 정보를 가지는 시계부를 구비하며, 상기 인공지능부는, 상기 시계부에서 얻은 상기 이 용자의 이용 일시 정보를 가미하여 당해 이용자에게 상응한 상기 진단 및 적합한 조언 중 적어도 어느 하나를 판단하도록 구성되어 있어도 좋다. 이와 같이 구성하면, 인공지능부는, 이용자의 음성정보에 '인플루엔자' 등의 유행시기, 계절의 변화에 따른 기 온차가 큰 시기 등의 이용 일시 정보를 가미하여, 이용자에게 상응한 진단이나 적합한 조언을 판단할 수 있다. 또한, 상기 어느 하나의 마사지 장치는, 적어도, 상기 이용자가 착석하는 좌석부와, 좌석부에 착석한 상기 이용 자의 상반신을 후방에서 지지하는 등받이부와, 마사지를 시행하는 상기 마사지부와, 상기 마사지부를 제어하는 제어부를 가지는 의자형 마사지 장치이며, 상기 인공지능부는, 상기 좌석부에 착석한 상기 이용자에 대해 상기 마사지부로 촉진을 수행하고, 상기 이용자의 음성정보에 상기 촉진결과를 가미하여 당해 이용자에게 상응한 상 기 진단 및 적합한 조언 중 적어도 어느 하나를 판단하도록 구성되어 있어도 좋다. 이와 같이 구성하면, 인공지능부는, 예를 들어, 이용자에 대해 마사지부로 촉진을 수행하고, 그 촉진결과를 가 미하여 이용자에게 상응한 진단이나 적합한 조언을 판단할 수 있다. 촉진으로 얻은 근경도는, 매핑 이미지 등으 로 이용자에게 보여줄 수 있다. 이용자의 근경도를 건강상태와 결부시킨 데이터로서 축적해 나감으로써, 축적된 근경도와 건강상태의 관계를, 이용자의 다음번 이용시의 진단이나 조언에 이용할 수 있다.또한, 상기 인공지능부는, 상기 진단 및 적합한 조언 중 적어도 어느 하나의 판단결과에 의거하여, 적합한 마사 지 코스의 추천 또는 마사지의 금지를 촉구하도록 구성되어 있어도 좋다. 이와 같이 구성하면, 인공지능부는, 이용자의 진단 및 적합한 조언 중 적어도 어느 하나의 판단결과에 의거하여, 이용자에게 적합한 마사지 코스를 추천할 수 있다. 예를 들면, 신체상태를 가미한 판단결과에 따라, 부분적으로 집중하여 마사지를 시행하는 마사지 코스 등을 권할 수 있다. 마사지를 시행하지 않는 편이 낫다는 판단결과의 경우는, 마사지 금지를 촉구할 수 있다. 한편, 본 발명에 따른 마사지 시스템은, 상기 어느 하나의 마사지 장치를 구비한 마사지 시스템으로서, 상기 인 공지능부는, 통신 네트워크를 통해 서버와 접속되어, 축적되어 있는 상기 의사의 지식ㆍ노하우에 관한 데이터를 갱신할 수 있도록 구성되어 있다. 이 구성에 의하면, 통신 네트워크를 통해 의사의 지식ㆍ노하우에 관한 데이터를 최신의 상태로 갱신할 수 있다. 따라서, 이용자는 이용시의 최신 지식ㆍ노하우에 의거하여 진단이나 적합한 조언을 얻을 수 있다."}
{"patent_id": "10-2018-0008272", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하면, 마사지 장치를 사용하는 이용자가, 인공지능부와의 대화로 자신의 증상 등에 상응한 진단 및 적합한 조언 중 적어도 하나를 얻는 것이 가능해진다. 이용자는, 얻은 진단, 조언을 참고로 의료기관에 다닐지 등을 판단할 수 있다. 또한, 자신의 증상에 적절한 마사지 코스 등을 선택하는 것도 가능해진다."}
{"patent_id": "10-2018-0008272", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 실시형태를 도면에 의거하여 설명한다. 이하의 실시형태에서는, 마사지 장치의 일례로서, 의자 형 마사지 장치(이하, 간략히 '마사지 장치'라고도 함)를 예로 들어 설명한다. 본 명세서 및 청구범위 중의 전후좌우 방향의 개념은, 도 1에 도시한 마사지 장치의 좌석부에 이용자가 착석했을 때에 이용자 가 바라본 방향의 개념과 일치하는 것으로 한다. (의자형 마사지 장치의 구성) 도 1은 일 실시형태에 따른 의자형 마사지 장치를 나타내는 사시도이고, 도 2는 도 1에 나타낸 의자형 마사 지 장치의 기능 블록도 이다. 도 1에 나타낸 바와 같이, 의자형 마사지 장치는, 이용자가 착석하는 좌 석부와, 좌석부에 착석한 이용자의 상반신을 후방에서 지지하는 등받이부를 가지고 있다. 좌석부 의 좌우 위치에는 암 레스트(armrest)를 가지고, 좌석부의 전방에는 풋 레스트(footrest)를 가지고 있다. 등받이부에는, 마사지부(롤러 유닛)가 설치되어 있다. 본 도면에서는, 등받이부의 마 사지부만을 나타내고 있으나, 다른 부분에도, 공기주머니(도시생략) 등의 마사지부가 구비되어 있다. 본 실시형태에서는, 상기 마사지부에 의해 촉진(觸診)이 수행되도록 되어 있다. 촉진으로서는, 마사지부 에 의해 이용자의 등의 경로를 따라서 가압하여, 후술하는 것처럼 근경도(筋硬度)를 측정할 수 있다. 근경 도는, 마사지부를 이용자에게 내밀어, 그때의 압박력을 압력센서로 측정함에 따라 측정할 수 있다. 또한, 우측의 암 레스트 부분에는, 마사지 장치를 조작하는 조작기가 구비되어 있다. 본 실시형태 의 조작기는, 태블릿 형 조작기로서 이용자가 조작하는 화면과 음성 입력부(마이크) 및 음성 출력 부(스피커)를 가지고 있다. 또한, 본 실시형태의 마사지 장치는, 상기 조작기에 더하여 단말기(4 0)를 구비하고 있다. 단말기로서는, 스마트폰, 태블릿 등의 단말기로 할 수 있다. 단말기는, 음성 입력 부(마이크) 및 음성 출력부(스피커)를 구비하고 있는 것을 이용할 수 있다. 단말기는, 마사지 장치 와 무선통신(블루투스(등록상표))에 의해 통신 가능하게 되어 있다. 또한, 단말기는, 마사지 장치 와 다른 형식의 무선 또는 유선으로 접속되어 있어도 좋다. 또한, 본 실시형태의 마사지 장치는, 이용자의 신체상태를 얻는 신체상태 획득부를 구비하고 있다. 신 체상태 획득부로서, 마사지 장치와 별도로 구성된 혈압계와 신체 조성계를 구비하고 있다. 혈 압계와 신체 조성계는, 마사지 장치와 무선통신(블루투스(등록상표))에 의해 통신 가능하게 되 어 있다. 신체상태 획득부는, 마사지 장치와 다른 형식의 무선 또는 유선으로 접속되어 있어도 좋다. 또한, 신체상태 획득부는, 마사지 장치에 내장되어 있어도 좋다. 본 예에 의하면, 이용자의 신체상태로 서, 혈압계로부터 '혈압', '맥박수', 신체 조성계로부터 '체중', '체지방률'을 얻을 수 있다. 또한, 신체상 태 획득부로서는, 스트레스 지수 계측기 등을 포함한다. 스트레스 지수 계측기가 구비된 경우, 이용자의 신 체상태로서 '스트레스 지수'를 얻을 수 있다. 이용자의 신체상태는, 이하에 설명하는 기억부에 기억시켜 둘 수 있다. 또한, 도 1에 나타낸 마사지 장치는, 통신 네트워크를 통해 서버에 접속되어 있는 예를 보 여주고 있다. 그리고 마사지 장치에는, 상기 좌석부, 등받이부, 암 레스트, 풋 레스트 등의 마사지부 를 제어하는 제어부와, 이용자와 대화하여, 의사의 지식ㆍ노하우에 관한 데이터에 의거하여 이용자에게 상응한 진단 및 적합한 조언을 수행하는 인공지능부가 구비되어 있다. 도 2에 나타낸 바와 같이, 제어부는 기억부와 접속되어 있다. 제어부는, 예를 들면, 프로세서, 휘 발성 메모리, 비휘발성 메모리 및 I/O 인터페이스 등을 가진다. 기억부는, 예를 들면, 플래시 메모리, 하드 디스크 드라이브 등을 사용할 수 있다. 기억부에는, 상기 마사지부에 의한 마사지 내용이 상이한 복수 의 마사지 코스가 기억되어 있다. 기억부는, 이용자의 개인정보를 기억하는 정보 기억부로서의 기능을 구비 하고 있다. 개인정보로서는, '나이', '체중', '신장', '성별', '가족 구성', '가족의 병력' 등을 포함할 수 있 다. 제어부는, 기억부에 기억된 각 마사지부의 동작 프로그램에 의거하여 프로세서가 휘발성 메모리를 사용 하여 연산처리를 함에 따라, 복수의 마사지 코스 등에 따라 각 마사지부를 동작시킨다. 제어부는, 마사지 코스의 내용을 변경할 수 있다. 또한, 마사지 코스 이외에, 일부의 마사지 내용만을 동작시킬 수도 있다. 제어 부는, 마사지부에 의한 동작의 강약, 등받이부의 젖힘 각도 등의 제어도 수행한다. 한편, 상기 인공지능부로서는, 인공 지능을 갖춘 컴퓨터 등으로 구성된다. 인공지능부는, 이용자의 음 성정보로부터 이야기 내용을 이해하는 기능을 가진다(본 명세서 및 청구범위에서의 '음성정보'는 '이야기 정 보'를 포함하고, '이야기 정보'는 '이야기 내용'을 포함한다). 인공지능부에 의한 이야기 내용의 이해는, 자연 언어로 한 이해 등을 포함한다. 인공지능부는, 이야기 내용으로부터 이해한 정보를 정보 기억부에 축적하고, 새로운 판단을 내릴 때에 이용하는 학습기능을 가지고 있다. 인공지능부의 정보 기억부에 축적되는 데이터로서는, 의사의 지식ㆍ노하우 등이 축적된다. 또한, 여러 의사의 지식이나 노하우로서, 여러 가지 상이한 분야(상이한 진료과 분야, 동일한 진료과이더라도 전문이 상이 한 분야 등)의 의사의 지식이나 노하우 정보를 축적할 수 있다. 이에 따라, 인공지능부는, 여러 가지 상이 한 분야의 의사의 지식이나 노하우에 의거하여, 하나의 증상을 다른 관점에서 고찰하여, 다각적인 관점으로 이 용자에게 상응한 진단 및 적합한 조언 중 적어도 어느 하나를 판단하여 음성 출력부에서 출력할 수 있다. 또한, 인공지능부는, 이용자에게 수행한 진단, 적합한 조언을 정보 기억부에 축적할 수 있다. 이것들을 축적하는 것으로, 이용자의 재이용시 음성정보로 정보 기억부에 축적된 이전의 진단 및 적합한 조언 중 적 어도 어느 하나를 가미하여, 이용자의 재이용 시에, 적합한 새로운 진단 및 적합한 조언 중 적어도 어느 하나를 판단하도록 할 수 있다. 즉, 인공지능부는, 정보 기억부에 축적된 진단, 적합한 조언과, 이용자의 재이 용시의 음성정보 등을 비교 검토하여, 이른바 '재진'을 수행할 수 있다. 그리고 재이용시의 이용자에게 상응한 진단이나 적합한 조언을 판단할 수 있다. 이러한 재진 기능에 의해, 이용자는, 병원에 갈 시간, 비용, 노력을 줄일 수 있다. 또한, 인공지능부는, 미리 기억(등록)되어 있는 개인정보와, 이용자가 입력한 음성정보에 의거하여, 이용자 에게 상응한 진단 및 적합한 조언을 종합적으로 판단할 수 있다. 인공지능부는, 이용자의 '나이', '성별' 등에 상응한 질병 등의 정보를 가미하여 진단 및 조언을 수행할 수 있다. 또한, 나이에 상응한 건강에 관한 조 언을 수행할 수도 있다. 그밖에, '체중'의 변화 등의 정보에 의거하여 이용자에게 조언을 수행할 수 있다. 예를 들면, 인공지능부는, 이용자의 음성정보에 개인정보를 가미하여, 이용자에게 가능성이 있는 질병과 그 대책 방법의 진단이나, 적합한 마사지 코스를 추천하는 등의 조언할 수 있다. 예를 들면, 이용자의 음성정보와 가족 의 병력으로부터, 증상에 따른 질병의 우려나 적합한 진료과 등의 조언을 할 수 있다. 또한, 이용자의 신체상태로서 혈압계로부터 혈압 값과 맥박수가, 신체 조성계로부터 체중, 체지방률 등 의 상태 측정 결과가 마사지 장치로 보내진다. 또한, 신체상태 획득부로서 스트레스 지수 계측기가 구 비되어 있을 경우, 스트레스 지수의 상태 측정 결과가 마사지 장치에 보내진다. 그리고 인공지능부는, 이용자의 음성정보에 신체상태를 가미하여, 의사의 지식ㆍ노하우에 관한 데이터에 의거하여 이용자에게 상응한 진단이나 적합한 조언을 종합적으로 판단하여 음성 출력부에서 출력한다. 인공지능부에 의한 이용자에 게 상응한 진단이나 적합한 조언으로서는, 이용자와 사이에서의 대화 내용과, 이용자의 이야기 내용으로부터 복 수의 키워드를 추출하고, 그것에 따라 이용자의 증상 등을 판단하고, 정보 기억부에 기억되어 있는 의사의 지식ㆍ노하우에 관한 데이터로부터 이용자에 따른 진단이나 적합한 조언을 판단할 수 있다. 예를 들면, 신체상 태 획득부로부터 보낸 이용자의 신체상태 측정 결과에 의거하여, 맥박의 간격(R-R 간격)으로부터 자율신경 의 균형(balance)에 관해서도 가미하고, 의사의 지식ㆍ노하우에 관한 데이터로부터 이용자에 따른 진단이나 적 합한 조언을 판단할 수 있다. 또한, 본 실시형태의 상기 조작기에는, 음성 입력부와 음성 출력부에 더하여, 촬영부인 카메라(2 4)가 구비되어 있다. 카메라는, 단말기에 구비하여도 좋다. 카메라를 구비함으로써, 인공지능부 는, 이 카메라로 촬영한 이용자의 피부색이나 피부 탄력 등의 정보를 이용자의 음성정보에 가미하여, 이용자에게 상응한 진단이나 적합한 조언, 적합한 마사지 코스의 추천, 운동 메뉴의 제안, 식사 메뉴의 제안 등 의 조언을 수행할 수 있다. 또한, 마사지 장치는, 일시(日時) 정보를 가지는 시계부를 구비하고 있다. 시계부는, 예를 들어, 제어부 에 구비할 수 있다. 시계부를 구비함으로써, 예를 들면, 이용자의 이용 일시에 따른 진단이나 적합한 조언 을 판단할 수 있다. 이용자가 마사지 장치를 이용하는 시기나 시간이 다르면, 인공지능부가 음성정보로 부터 한가지의 키워드를 얻었다고 하더라도, 인공지능부가 판단하는 이용자에게 상응한 진단 및 적합한 조 언은 상이할 수 있다. (마사지 장치에 의한 조언의 예) 도 3은 도 1에 도시한 마사지 장치와 이용자(H)의 대화와 조언의 예를 나타내는 도면이다. 본 도면에 의거 하여, 의자형 마사지 장치를 이용하는 이용자(H)와 인공지능부의 기본적인 대화와 조언에 관하여 설명 한다. 또한, 마사지 장치에 관한 구성에 대해서는, 상기 도 1에 도시한 부호를 부여하여 설명한다. 이용자(H)는, 마사지 장치의 인공지능부와의 사이에서 대화를 한다. 대화는, 이용자(H)로부터 시작하여 도 좋고, 이용자(H)가 마사지 장치의 전원을 넣는 것으로 인공지능부로부터 시작하여도 좋다. 이용자 (H)가 마사지 장치의 음성 입력부를 향해서 말을 하면(입력), 인공지능부는 그 음성정보로부터 이 야기 내용을 이해한다. 인공지능부에 의한 이야기 내용의 이해는, 이용자(H)의 음성정보(어조 등으로부터 판단할 수 있는 감정, 목소리 톤, 대화 속도)나, 이야기 정보(걱정이 되는 부위, 마사지에 관한 내용) 등을 포 함하여 이해할 수 있다. 또한, 도 1의 예에서는, 이용자(H)의 신체상태로서 혈압계로부터 혈압 값과 맥박수 가, 신체 조성계로부터 체중, 체지방률 등의 상태 측정 결과가 마사지 장치에 보내진다. 이용자(H)는, 음성 출력부로부터 출력된 인공지능부의 진단이나 조언에 대해, 음성 입력부에서 음 성으로 응답할 수 있다. 이에 따라, 인공지능부와의 사이에서 진단이나 조언에 관한 대화를 할 수가 있다. 즉, 이용자(H)는, 인공지능부와의 사이에서 의사와 대화하고 있는 것처럼 대화를 할 수 있다. 인공지능부 는, 대화에서 얻은 새로운 정보를 바탕으로, 더욱 이용자(H)에게 상응한 진단이나 적합한 조언을 판단하여, 이용자(H)에게 알릴 수 있다. 예를 들면, 인공지능부에 의해 이용자(H)와의 대화로부터 알게 된 정보(자각 증상·질병 등의 증상)에 대해, 적절한 병원에 가기를 촉구하거나, 병원에 갈 필요까지는 없는 증상에 대해서는 적절한 조언과 마사지를 시행할 것을 촉구할 수 있다. 이와 같이, 상기 마사지 장치에 의하면, 인공지능부와 이용자(H)의 대화에 따라, 이용자(H)의 증상에 대해, 가정에서 온갖 분야의 여러 의사의 지식·노하우(정보)에 의거하여, 이용자(H)에게 상응한 진단, 적합한조언을 전문의와 상관없이 받을 수 있고, 이용자 스스로 대책을 검토할 수가 있다. 구체적인 예로서는, 예를 들 면, 이용자(H)가 위통의 자각증상(예를 들면, 가벼운 스트레스로 인한 위통)이 있을 경우, 통상적으로, 병원에 가서 MRI나 엑스레이 등을 촬영하고 진단함으로써, 그 원인이 스트레스에 의한 증상이라고 알 수 있다. 이에 비 해, 상기 마사지 장치의 인공지능부에 의하면, 이용자(H)와의 대화에 의해서 위통의 원인이 스트레스에 의한 것으로 판단할 수 있다. 그리고 인공지능부는, 스트레스를 해소하게 할 조언과, 스트레스를 해소하게 할 마사지 코스를 추천할 수 있다. 따라서, 이용자(H)는 병원에 갈 필요가 없는 증상에 대해, 가정에서 적절한 조언이나 효과있는 마사지에 관한 정보를 얻을 수 있다. 이와 같이, 상기 마사지 장치에 의하면, 이용자(H)와 인공지능부의 대화에 의해서, 인공지능부가 의사가 진단할 때의 질문(문진)을 수행할 수가 있다. 그리고 그 답변의 음성정보에 대해, 온갖 분야ㆍ환부의 질 병이나 증상에 대응한 정보(여러 의사의 지식·노하우)에 의해, 이용자(H)의 통증이 있는 부위나 증상에 알맞은 병명이나 대응을 판단하여 음성출력 할 수 있다. 즉, 예를 들면, 10명의 상이한 진료과 분야, 동일한 진료과이 더라도 10명의 전문이 상이한 분야의 의사의 지식·노하우에 의거하여 이용자(H)에게 상응한 진단이나 적합한 조언을 판단할 수 있다. 따라서, 이용자(H)는, 마사지 장치에서 자신의 병명이나 대응, 진단이나 적합한 조 언을 들을 수 있게 되어, 병원 갈 시간, 비용, 노력을 줄일 수 있게 된다. (이용자에게 상응한 진단이나 적합한 조언을 판단하는 요인의 예) 이하, 인공지능부가 이용자(H)에게 상응한 진단이나 적합한 조언을 판단하기 위한 요인의 예를 개별적으로 설명한다. <이용자의 증상 추출> 인공지능부는, 이용자(H)의 음성정보로부터, 그때의 이용자(H)의 증상을 추출할 수 있다. 이용자(H)의 이야 기 내용으로부터 걱정이 되는 증상으로서, '열', '고혈압', '어깨 결림', '요통', '두통', '복통', '변비', '어 지러움', '부종', '소변 문제', '불면증', '우울증' 등의 증상을 추출할 수 있다. 예를 들면, 인공지능부는, 이용자(H)의 음성정보로부터 '허리가 아프다', '어깨가 뻐근하다' 등의 정보(키워드)를 추출 하여 걱정이 되는 증상을 판단할 수 있다. 예를 들면, 이용자(H)의 이야기 내용으로부터 '미열이 계속되고'라는 정보를 추출한 경우, '열'에 관한 증상으로 판단할 수 있다. 이와 같이, 인공지능부는, 그때의 이용자(H)의 걱정이 되는 증상을 추출하고, 그 증상에 대해, 의사의 지식ㆍ노하우에 관한 데이터에 의거하여 이용자(H)에게 상응한 진단, 적합한 조언을 판단할 수가 있다. 또한, 후술하는 바와 같이, 미리 항목 선택부에 의해 걱정이 되는 증상 항목을 선택하도록 할 수도 있다. 이와 같이 하면, 인공지능부에 의한 증상의 추출이 생략되기 때문에, 인공지능부에 의한 판단으로부터 항목선택 시간을 단축할 수 있다. <질문과 답변으로부터 증상에 관한 정보의 추출> 이용자(H)로부터 인공지능부에 대해 질문할 경우, 예를 들면, 이용자(H)로부터 '오늘은 다리가 피곤합니 다', '오늘은 허리가 아픕니다', '오늘은 어깨가 뻐근합니다' 등의 질문(이야기)을 할 수 있다. 예를 들면, '오 늘은 허리가 아픕니다'라는 질문에 대해 인공지능부로부터의 답변으로서는, '허리의 어디쯤이 아픕니까?', '오늘은 하루 사무업무입니까?' 등의 질문을 더 수행하여, 증상에 관한 정보를 더욱 자세하게 물어 알아낼 수 있다. 한편, 인공지능부로부터 이용자(H)에게 질문할 경우, 예를 들면, '최근 신체에 통증이 있는 부분은 있습니 까?', '뻐근한 곳은 있습니까?' 등의 질문을 할 수 있다. 그리고 이용자(H)로부터 '허리에 통증이 있습니다'라 는 답변을 얻었을 경우에는, 인공지능부로부터 '허리의 어디쯤이 아픕니까?'라고 질문을 반복하여, 증상에 관한 정보를 더욱 자세하게 물어 알아낼 수 있다. 이와 같이 이용자(H)와 인공지능부 사이에서 질문과 답변을 반복할 수 있다. 인공지능부는, 이용자(H) 의 답변에 관련한 질문을 수행하여 새로운 답변을 얻을 수 있도록 대화를 계속할 수 있다. 인공지능부는, 이용자(H) 증상을 상세하게 판단하기 위한 정보를 물어 날아낼 수 있도록, 이용자(H)의 답변 내용을 유도하는 질문을 반복할 수 있다. 그리고 인공지능부는, 이용자(H)로부터 얻은 복수의 답변으로부터 증상을 판단하고, 그 증상에 대해 의사의 지식ㆍ노하우에 관한 데이터에 의거하여 이용자(H)에게 상응한 진단이나 적합 한 조언, 적합한 마사지를 판단할 수 있다. <활동정보의 추출> 인공지능부는, 이용자(H)의 음성정보로부터, 이용자(H)의 활동정보를 판단할 수 있다. 예를 들면, 이야기 내용으로부터, 그날에 어떤 생활을 하고 있었는지의 활동정보를 판단할 수 있다. 예를 들어, '하루종일 서서 일 함', '하루종일 외근', '하루종일 사무업무' 등의 활동정보를 추출할 수 있다. 그리고 인공지능부는, 이용 자(H)의 음성정보에 활동정보를 가미하여 이용자(H)에게 상응하는 진단, 적합한 조언을 판단할 수 있다. 예를 들면, 이용자(H)가 하루종일 사무업무를 했을 경우, 허리와 등이 피곤하다고 판단할 수 있고, 사무업무에 따라 발생하는 증상으로부터 진단 및 조언을 할 수 있다. 또한, 허리와 등 중심의 마사지나, 허리와 등의 피로에 효 과가 있는 경혈을 자극하는 마사지 코스를 권하는 것 등을 할 수 있다. <망진법(望診法)에 의거한 진단> 인공지능부는, 카메라로 촬영된 이용자(H)의 얼굴 촬영정보에 의해, 표정이나 안색으로부터 감정, 건강 상태를 망진법에 의거하여 판단할 수 있다. 이에 따라, 인공지능부는, 이용자(H)의 음성정보에 망진법에 의 한 판단 결과를 가미하여, 이용자(H)에게 상응한 진단이나 조언, 적합한 마사지 코스 등을 판단할 수 있다. <사용 이력의 이용> 인공지능부는, 이용자(H)에게 상응하는 진단이나 적합한 조언을 정보 기억부에 기억시켜 둘 수 있다. 그리고 인공지능부는, 이용자(H)의 새로운 음성정보에 정보 기억부에 기억되어 있는 과거의 진단이나 적합한 조언을 가미하여, 재이용시의 이용자(H)에게 상응한 진단이나 적합한 조언을 판단할 수 있다. 예를 들어, 이용자(H)의 전날의 증상과 진단이나 적합한 조언과 당일의 이용자(H)의 음성정보로부터 추출한 증상을 비교 검토하여, 당일의 이용자(H)에게 상응한 진단이나 적합한 조언을 판단할 수 있다. 이와 같이 이용자(H)에 대한 진단이나 적합한 조언을 기억시켜 두면, 이용자(H)의 재이용시 인공지능부에 의한 대화나 판단을, 과 거의 진단이나 조언을 고려한 것으로 할 수 있다. <기타> 인공지능부는, 이용자(H)의 음성정보에, 시계부로부터 얻어지는 계절, 유행하는 질병 등의 정보를 가미하여, 이용자(H)에게 상응한 진단이나 적합한 조언을 판단할 수 있다. 예를 들면, 이용자(H)의 이용 일시 (시간대, 계절 등)의 정보로서, '인플루엔자' 등의 질병의 유행시기, 계절의 변화에 의한 기온차가 큰 시기 등 의 시기적인 정보를 이용자(H)의 음성정보에 가미하여, 의사의 지식ㆍ노하우에 관한 데이터에 의거하여 이용자 (H)에게 상응한 진단이나 적합한 조언을 판단할 수 있다. <조합> 상기 인공지능부에 의한 이용자(H)에게 상응한 진단이나 적합한 조언을 판단하는 요인은, 조합하는 것이 가 능하며, 조건 등에 따라 인공지능부에서 적절하게 조합된다. 또한, 이상과 같은 인공지능부에 의한 이 용자(H)에게 상응한 진단이나 적합한 조언을 판단하는 요인은 하나의 예이고, 본 발명의 요지를 훼손하지 않는 범위에서 여러 가지 요인을 추가하는 것이 가능하며, 요인은 상기 예에 한정되는 것은 아니다. (마사지 장치에 의한 조언의 예) 도 4는, 도 1에 도시한 마사지 장치와 이용자(H)의 대화의 예와 조언의 예를 나타내는 도면으로, (A)는 항 목 선택의 예를 나타내는 도면이고, (B)는 구체적인 대화의 예를 나타내는 도면이다. 이 도면들에 의거하여, 마 사지 장치와 이용자(H) 사이의 대화와 조언의 일례를 설명한다. 본 예에서는, 이용자(H)의 '열'에 관해서 인공지능부에 의한 진단, 조언의 예이다. 또한, 도 1에 도시한 구성에는 동일한 부호를 부여하여 설명한다. 예를 들어, 이용자(H)는 '최근, 미열이 계속되고 있고, 전에 병원에서 감기로 진단받았지만, 불안한...', '다른 의사의 의견을 이용하고 싶지만, 또다시 병원에 갈 시간을 만들기가 힘들고, 돈도 더 필요하고...'라고 생각한 경우를 예로 들어 설명한다. 이럴 경우, 상기 마사지 장치에 의하면, 이용자(H)는, 항목 선택부에서 '열'을 누른 후, 음성 입력부 를 향해서 '최근 미열이 계속되고...'라고 음성정보를 입력한다. 이 경우, 인공지능부는, '열'에 관한 증상인 것으로 판명되므로, '참 힘드시겠네요. 원인에 짐작이 가지 않는 어지러움이나 이명(耳鳴)은 없습니 까?'라고 질문을 한다. 그리고 이용자(H)가 '그러고 보니, 이명이 가끔 있습니다.'라고 대답하면, 인공지능부 는 '원인을 잘 모르는 미열을 동반하는 이명에 시달리고 있다면, 자율신경 실조증을 의심하는 쪽이 좋을 수 있습니다.'라고 이용자(H)의 증상에 상응한 진단을 음성 출력부에서 출력한다. 이와 같이, 이용자(H)는, 마사지 장치에서, 자신의 증상에 상응한 진단을 얻을 수가 있다. 본 예에서는 간 단한 예를 설명하였지만, 인공지능부에 의해, 상이한 진료과나 상이한 전문분야의 여러 의사의 지식ㆍ노하 우에 의거하여, 다각적인 관점으로 증상에 상응한 진단이나 적합한 조언을 판단할 수 있고, 복수의 진단이나 적 합한 조언을 얻도록 할 수도 있다. (마사지 장치에 의한 조언의 예) 도 5는, 도 4에 도시한 마사지 장치와 이용자(H)의 대화의 예와는 상이한 구체적인 대화의 예를 나타내는 도면이다. 본 예에서는, 이용자(H)의 '어깨 결림'에 관하여 인공지능부에 의한 진단, 조언의 예이다. 또한, 도 1에 도시된 구성에는 동일한 부호를 부여하여 설명한다. 예를 들어, 이용자(H)가 '어깨 결림이 심해서 고생하고 있습니다.'라고 음성정보를 입력하면, 인공지능부는 '참 힘드시겠네요. 앓고 있는 어깨 결림은 양 어깨입니까?' '아니면 왼쪽 어깨만, 오른쪽 어깨만 처럼 한쪽 어 깨만입니까?'라고 질문을 한다. 그리고 이용자(H)가, '양 어깨인지...'라고 대답하면, 인공지능부는 '정말, 양 어깨입니까? 어깨 이외의 부위에 저린 장소나 아픈 곳은 없습니까?' '신경이 쓰이는 정도라도 괜찮으니까, 걱정하지 마시고 말씀해 보십시오.'라고 질문을 한다. 그리고 이용자(H)가, '아프지는 않지만, 오른팔이 약간 저린 느낌은 있습니다.'라고 대답하면, 인공지능부는 '일은 컴퓨터 작업 중심의 사무업무입니까?'라고 질문 을 한다. 그리고 이용자(H)가 '그렇습니다.'라고 대답하면, 인공지능부는 '어깨 결림과 오른팔 저림, 장시 간의 컴퓨터 작업이라면, 일자목(straight neck)에 의한 목으로의 부담이, 어깨 결림의 원인이 될 수 있습니 다.'라고 이용자(H)의 증상에 따른 진단을 음성 출력부로부터 출력한다. 이와 같이, 이용자(H)는, 마사지 장치에서, 자신의 증상에 상응하는 진단을 얻을 수가 있다. 이 예에서도 간단한 예를 설명하였지만, 인공지능부에 의해, 상이한 진료과와 상이한 전문분야의 여러 의사의 지식ㆍ노 하우에 의거하여, 다각적인 관점에서 증상에 상응한 진단이나 적합한 조언을 판단할 수 있고, 복수의 진단이나 적합한 조언을 얻도록 할 수도 있다. (마사지 장치에 의한 촉진(觸診)의 예) 도 6의 (A) ~ (C)는, 도 1에 도시한 마사지 장치에서의 촉진과 근경도 매핑(mapping) 이미지의 예와 인공지능부 의 관계를 나타내는 도면이다. 도 7의 (A), (B)는 도 6에 도시한 근경도 매핑 이미지의 예와 이용자(H)의 건강 상태를 관련시킨 데이터를 축적하는 예를 나타내는 도면이다. 또한, 도 6의 (C), 도 7의 (B)는, 인공지능부(5 0)와 정보 기억부를 모식적인 그림으로 보여준다. 도 6의 (A)에 나타낸 바와 같이, 상기 의자형 마사지 장치에 의하면, 마사지부(도 1)를 이용자(H)의 등 의 경로를 따라 가압하고, 그때의 압박력을 압력센서로 측정하는 것에 의해 근경도를 측정할 수 있다. 도 6의 (B)에 나타낸 바와 같이, 상기 촉진으로 얻은 근경도는, 인공지능부에 의해서 매핑 되고, 그 매핑 결과를 매핑 이미지로서 나타낼 수 있다. 이용자(H)는, 이 매핑 이미지를 화면(도 1)으로 보고 자 신의 근경도에 관해 알 수가 있다. 그리고 도 6의 (C)에 나타낸 바와 같이, 인공지능부는, 근경도의 매핑 이미지를 이용자(H)의 음성정보 를 가미하여, 이용자(H)에게 상응한 진단 및 적합한 조언을 할 수 있다. 예를 들면, 각 부위의 근육의 경도와 전체적인 균형 등으로부터, 오른쪽 어깨만의 어깨 결림이라면, 간질환, 위장장애 등을 예측할 수 있다. 왼쪽 어 깨만의 어깨 결림이라면, 심장질환 등을 예측할 수 있다. 목덜미의 결림, 통증이라면, 지주막하출혈 등을 예측 할 수 있다. 이와 같이, 근경도 매핑 이미지로부터 현재의 건강상태뿐만 아니라, 장래의 건강상태를 예측할 수도 있다. 또한, 인공지능부에서, 이 근경도에 추가하여, 상기 카메라로 촬영한 이용자(H)의 피부색이 나 피부 탄력 등의 촬영정보를 가미할 수도 있다. 예를 들어, 상기와 같이, 이용자(H)의 건강상태를 망진법에 의해 판단하고, 근경도 매핑 이미지로부터 의사의 지식ㆍ노하우에 관한 데이터에 의거하여 이용자(H)에게 상응 한 진단이나 적합한 조언을 판단할 수 있다. 도 7의 (A)에 나타낸 바와 같이, 상기 촉진에 의한 매핑 이미지는, 이용자(H)의 건강상태와 관련시켜(결부 시켜), 도 7의 (B)에 나타낸 바와 같이, 인공지능부의 정보 기억부에 기억해 둘 수가 있다. 이와 같이 하면, 정기적으로 근경도를 측정함으로써, 그 매핑 이미지들로부터 시계열 변화도 고려하여, 그때의 이용자 (H)에게 상응한 진단 및 적합한 조언을 판단할 수 있다. (그 밖의 실시형태) 도 1에 나타낸 바와 같이, 상기 마사지 장치의 제어부 또는 인공지능부가 통신 네트워크를 통해 서버에 접속되어 있어도 좋다. 이렇게 하면, 인공지능부의 정보 기억부에 축적되어 있는 의사의 지식ㆍ노하우에 관한 데이터를, 통신 네트워크를 통해 최신의 상태로 갱신할 수 있다. 또한, 통신 네트워크 를 통해서 새로운 정보를 추가하여 데이터양을 증가시킬 수도 있다. 또한, 서버가 빅 데이터를 구비하고 있는 경우에는, 인공지능부에 의해서 서버의 빅 데이터도 이용하여, 이용자(H)에게 상응한 진단이나 적 합한 조언을 더욱 세밀하게 판단할 수 있다. 또한, 인공지능부는, 이용자(H)에 따른 진단이나 적합한 조언 의 결과에 의거하여, 통신 네트워크에서 얻은 정보로부터 이용자(H)에게 가까운 병원 등을 조언할 수 있다. 이와 같이, 마사지 장치가 통신 네트워크에 접속된 마사지 시스템으로 하면, 인공지능부는 최신 의 의사의 지식ㆍ노하우에 관한 데이터에 의해서, 이용자(H)의 이용시의 음성정보에 의거하여, 이용자(H)에게 상응한 진단이나 적합한 조언을 판단하는 것이 가능해진다. (총괄) 이상과 같이, 상기 마사지 장치에 의하면, 이용자(H)와 인공지능부의 대화로부터, 그때의 이용자(H)의 건강상태 등의 증상에 따라 의사의 지식ㆍ노하우에 관한 데이터에 의거하여 이용자(H)에게 상응한 진단, 적합한 조언을 판단하여 이용자(H)에게 알리는 것이 가능해진다. 또한, 이용자(H)는, 의자형 마사지 장치를 사용할 때의 심신상태 등에 적합한 마사지 코스의 추천이나 마사지의 금지가 바람직하다는 것 등에 관해 알 수도 있게 된다. 게다가 복수의 상이한 분야의 여러 의사의 지식ㆍ노하우에 의거하여 이용자(H)에게 상응한 진단이나 적합 한 조언을 얻을 수도 있고, 마사지 장치에서 다양한 증상에 대해 진단이나 조언을 얻는 것이 가능해진다. 따라서, 이용자(H)는, 마사지 장치에서, 날마다 변화하는 신체 컨디션이나 기분 등에 따라, 그때의 자신에 게 맞는 진단, 적합한 조언, 적합한 마사지 코스 등을 알아내는 것이 가능해진다. (그 밖의 변형 예) 상기 실시형태에서는, 의자형 마사지 장치를 예로 들어 설명하였으나, 마사지 장치는 의자형 이외여도 좋고, 이용자(H)를 마사지하는 마사지 장치라면, 허리 부분 마사지 장치, 목 부분 마사지 장치 등이어도 좋으며, 마사지 장치는 의자형에 한정되는 것은 아니다. 또한, 상기 실시형태는 하나의 예를 나타내고 있으며, 이용자(H)와 인공지능부의 대화내용 등은 다양한 요 인으로 차이점이 있고, 본 발명의 요지를 훼손하지 않는 범위에서 다양한 대화가 가능하며, 본 발명은 상기 실 시형태에 한정되는 것은 아니다."}
{"patent_id": "10-2018-0008272", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시형태에 따른 의자형 마사지 장치를 나타내는 사시도 이다. 도 2는 도 1에 도시한 마사지 장치의 기능 블록도 이다. 도 3은 도 1에 도시한 마사지 장치와 이용자의 대화와 조언의 예를 나타내는 도면이다. 도 4는 도 1에 도시한 마사지 장치와 이용자의 대화의 예와 조언의 예를 나타내는 도면으로서, (A)는 항목 선택 의 예를 나타내는 도면이고, (B)는 구체적인 대화의 예를 나타내는 도면이다. 도 5는 도 4에 도시한 마사지 장치와 이용자의 대화의 예와는 상이한 구체적인 대화의 예를 나타내는 도면이다. 도 6의 (A) ~ (C)는 도 1에 도시한 마사지 장치에서의 촉진과 근경도 매핑(mapping) 이미지의 예와 인공지능부 의 관계를 나타내는 도면이다. 도 7의 (A), (B)는 도 6에 도시한 근경도의 매핑 이미지의 예와 이용자의 건강상태를 관련시킨 데이터를 축적하 는 예를 나타내는 도면이다."}
