{"patent_id": "10-2023-0038366", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0143274", "출원번호": "10-2023-0038366", "발명의 명칭": "정규화 흐름 기반의 이상 탐지 장치 및 이상 탐지 방법", "출원인": "국립한국교통대학교산학협력단", "발명자": "곽정환"}}
{"patent_id": "10-2023-0038366", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "정규화 흐름 기반의 이상 탐지 장치에 있어서,입력 데이터의 스케일과, 상기 입력 데이터에 대해 출력되는 특징 벡터의 스케일이 서로 다르며, 상기 정규화흐름을 통해 특징 벡터 각각에 대해 가능도(Likelihood)를 도출하도록 학습된 인공신경망 집합을 이용하여 상기인공신경망 집합으로 입력되는 상기 입력 데이터에 대한 이상을 탐지하는 탐지부를 포함하는 것을 특징으로 하는 이상 탐지 장치."}
{"patent_id": "10-2023-0038366", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 탐지부는,상기 인공신경망 집합을 이용하여 상기 입력 데이터 또는 상기 입력 데이터를 증강한 증강 데이터로부터 가능도집합을 획득하며, 획득된 가능도 집합을 통합한 결과에 대한 제1 임계값 초과 여부에 기초하여, 상기 입력 데이터에 대한 이상을 추론하는 것을 특징으로 하는 이상 탐지 장치."}
{"patent_id": "10-2023-0038366", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 탐지부는,상기 입력 데이터의 이상이 추론되면, 상기 입력 데이터의 이상 추론에 근거가 되는 근거 위치 정보를추출하며,상기 인공신경망 집합을 이용하여 상기 근거 위치 정보 또는 상기 근거 위치 정보를 증강한 증강 데이터로부터가능도 집합을 획득하며, 획득된 가능도 집합을 통합한 결과에 대한 제2 임계값 초과 여부에 기초하여, 상기 근거 위치 정보에 대한 이상이 추론되면, 상기 입력 데이터의 이상을 최종 탐지하는 것을 특징으로 하는 이상 탐지 장치."}
{"patent_id": "10-2023-0038366", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 장치는,학습 데이터를 이용하여 상기 인공신경망 집합 내 각 인공신경망을 학습하는 학습부를 더 포함하며,상기 학습부는,상기 학습 데이터 또는 상기 학습 데이터를 증강한 증강 데이터의 입력 시 인공신경망으로부터 도출되는 가능도를 최대화하는 손실함수를 이용하여 각 인공신경망에 대한 가중치를 업데이트하는 것을 특징으로 하는 이상 탐지 장치."}
{"patent_id": "10-2023-0038366", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 장치는,검증 데이터를 이용하여 상기 인공신경망 집합을 선택하는 선택부를 더 포함하며,상기 선택부는,기 정의된 메타 휴리스틱 알고리즘을 기반으로, 검증 데이터와 특징 벡터의 서로 다른 스케일 조합을 지원하는공개특허 10-2024-0143274-3-인공신경망 집단에 대한 이상 탐지 성능 기반 적합도를 계산하며, 적합도 계산 결과 기 정의된 조건을 충족하는특정 집단을 이상 탐지에 적합한 인공신경망 집합으로 선택하는 것을 특징으로 하는 이상 탐지 장치."}
{"patent_id": "10-2023-0038366", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 3 항에 있어서,상기 탐지부는,상기 입력 데이터의 이상 추론 과정에서 계산되는 기울기 맵(Gradient Map)을 이용하여 상기 근거 위치 정보를추출하는 것을 특징으로 하는 이상 탐지 장치."}
{"patent_id": "10-2023-0038366", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 3 항에 있어서,상기 제1 임계값은,상기 인공신경망 집합을 이용하여 검증 데이터 또는 상기 검증 데이터를 증강한 증강 데이터로부터 획득되는 제3 가능도 집합의 평균값으로 결정되며,상기 제2 임계값은,상기 인공신경망 집합을 이용하여 상기 검증 데이터의 이상 추론에 근거가 되는 근거 위치 정보, 또는 근거 위치 정보를 증강한 증강 데이터로부터 획득되는 가능도 집합의 평균값으로 결정되는 것을 특징으로 하는 이상 탐지 장치."}
{"patent_id": "10-2023-0038366", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "정규화 흐름 기반의 이상 탐지 장치에서 수행되는 이상 탐지 방법은,입력 데이터의 스케일과, 상기 입력 데이터에 대해 출력되는 특징 벡터의 스케일이 서로 다르며, 상기 정규화흐름을 통해 특징 벡터 각각에 대해 가능도(Likelihood)를 도출하도록 학습된 인공신경망 집합을 이용하여 상기인공신경망 집합으로 입력되는 상기 입력 데이터에 대한 이상을 탐지하는 탐지단계를 포함하는 것을 특징으로하는 이상 탐지 방법."}
{"patent_id": "10-2023-0038366", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서,상기 탐지단계는,상기 인공신경망 집합을 이용하여 상기 입력 데이터 또는 상기 입력 데이터를 증강한 증강 데이터로부터 가능도집합을 획득하며, 획득된 가능도 집합을 통합한 결과에 대한 제1 임계값 초과 여부에 기초하여, 상기 입력 데이터에 대한 이상을 추론하는 것을 특징으로 하는 이상 탐지 방법."}
{"patent_id": "10-2023-0038366", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9 항에 있어서,상기 탐지단계는,상기 입력 데이터의 이상이 추론되면, 상기 입력 데이터의 이상 추론에 근거가 되는 근거 위치 정보를추출하며,상기 인공신경망 집합을 이용하여 상기 근거 위치 정보 또는 상기 근거 위치 정보를 증강한 증강 데이터로부터가능도 집합을 획득하며, 획득된 가능도 집합을 통합한 결과에 대한 제2 임계값 초과 여부에 기초하여, 상기 근거 위치 정보에 대한 이상이 추론되면, 상기 입력 데이터의 이상을 최종 탐지하는 것을 특징으로 하는 이상 탐지 방법."}
{"patent_id": "10-2023-0038366", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 8 항에 있어서,공개특허 10-2024-0143274-4-상기 방법은,학습 데이터를 이용하여 상기 인공신경망 집합 내 각 인공신경망을 학습하는 학습단계를 더 포함하며,상기 학습단계는,상기 학습 데이터 또는 상기 학습 데이터를 증강한 증강 데이터의 입력 시 인공신경망으로부터 도출되는 가능도를 최대화하는 손실함수를 이용하여 각 인공신경망에 대한 가중치를 업데이트하는 것을 특징으로 하는 이상 탐지 방법."}
{"patent_id": "10-2023-0038366", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 8 항에 있어서,상기 방법은,검증 데이터를 이용하여 상기 인공신경망 집합을 선택하는 선택부를 더 포함하며,상기 선택단계는,기 정의된 메타 휴리스틱 알고리즘을 기반으로, 검증 데이터와 특징 벡터의 서로 다른 스케일 조합을 지원하는인공신경망 집단에 대한 이상 탐지 성능 기반 적합도를 계산하며, 적합도 계산 결과 기 정의된 조건을 충족하는특정 집단을 이상 탐지에 적합한 인공신경망 집합으로 선택하는 것을 특징으로 하는 이상 탐지 방법."}
{"patent_id": "10-2023-0038366", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 9 항에 있어서,상기 탐지단계는,상기 입력 데이터의 이상 추론 과정에서 계산되는 기울기 맵(Gradient Map)을 이용하여 상기 근거 위치 정보를추출하는 것을 특징으로 하는 이상 탐지 방법."}
{"patent_id": "10-2023-0038366", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 10 항에 있어서,상기 제1 임계값은,상기 인공신경망 집합을 이용하여 검증 데이터 또는 상기 검증 데이터를 증강한 증강 데이터로부터 획득되는 제3 가능도 집합의 평균값으로 결정되며,상기 제2 임계값은,상기 인공신경망 집합을 이용하여 상기 검증 데이터의 이상 추론에 근거가 되는 근거 위치 정보, 또는 근거 위치 정보를 증강한 증강 데이터로부터 획득되는 가능도 집합의 평균값으로 결정되는 것을 특징으로 하는 이상 탐지 방법."}
{"patent_id": "10-2023-0038366", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 8 항 내지 제 14 항 중 어느 한 항의 방법을 실행시키기 위한 프로그램을 기록한 컴퓨터 판독 가능기록매체."}
{"patent_id": "10-2023-0038366", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "하드웨어와 결합되어, 제 8 항 내지 제 14 항 중 어느 한 항의 방법을 실행시키기 위해 매체에 저장된 컴퓨터프로그램."}
{"patent_id": "10-2023-0038366", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 다중 스케일 특징 및 근거 위치 추정을 활용한 정규화 흐름(Normalizing Flow) 기반의 이상 탐지 방안 에 관한 것이다."}
{"patent_id": "10-2023-0038366", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 다중 스케일 특징 및 근거 위치 추정을 활용한 정규화 흐름(Normalizing Flow) 기반의 이상 탐지 방 안에 관한 것이다."}
{"patent_id": "10-2023-0038366", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 몇 년간 인터넷과 스마트폰 등 스마트 디바이스의 보급으로 인해 데이터 수집의 접근성이 낮아지고 있다. 이로 인해 데이터 분석 기술의 중요성이 더욱 높아지고 있으며, 데이터 기반으로 한 의사결정 및 예측 분야에서 는 이상 탐지(Anomaly detection) 기술의 필요성이 커지고 있다. 이상 탐지 기술은 기존의 데이터 분석 방법으로는 파악하기 어려운 비정상적인 패턴을 검출하고, 이에 대한 대 응책을 마련하는 데 매우 유용하다. 이러한 이상 탐지 기술은 비정상적인 패턴을 검출하기 위한 방법으로 정상과 이상을 구분하는 지도 학습 기반 분류 기술을 이용하거나, 주성분 분석 및 오토 인코더를 이용한 비지도 학습 등이 제안되고 있다. 하지만 지도 학습 기반 방법론은 이상 데이터 수집의 어려움으로 인해 막대한 양의 학습 데이터를 요구하는 인 공지능 기법에는 부적절하며, 기존의 비지도 학습 기반 방법론은 데이터의 분포를 고려하지 않고 단순 통계적인 방법을 이용하기 때문에 다양한 분포를 가지는 데이터 셋에 적용하기에는 어려움이 있다. 한편, 정규화 흐름(Normalizing Flow)은 확률 분포의 변환(transformation)을 수행하는 비지도 학습 기반 모델 링 기법 중에 하나로, 역 변환이 가능(invertible)한 일련의 연산 흐름을 이용하여 복잡한 분포를 가지는 입력 데이터를 간단한 확률 분포로 매핑하는 과정을 의미한다. 이러한 확률론적 모델링 기법을 이용하여 기존에는 새로운 이미지나 음성 데이터를 생성 또는 밀도 추정 (density estimation) 작업에서 활용이 되어왔으며, 최근 이상 탐지를 위한 새로운 방법론으로 주목받고 있다. 현재 대표적인 정규화 흐름 기반 이상 탐지 기법은 입력 데이터로부터 고차원의 특징을 추출하고, 정규화 흐름 을 통해 특징 맵의 가능도를 도출하며, 임계값을 통해 이상 여부를 추론하는 것이 지배적이다. 하지만 입력 데이터의 크기에 따라 얻어지는 특징 정보의 특성을 고려하지 않는 경향이 있고, 이상으로 추론한 근거에 대한 활용 방법이 정립되지 않았기 때문에 그대로 적용하기 어려운 문제점이 발생한다. 따라서 본 발명에서는, 입력 데이터의 크기에 따라 얻어지는 특징 정보의 특성과 이상으로 추론한 근거를 고려 할 수 있는 새로운 이상 탐지 방안을 제안하고자 한다."}
{"patent_id": "10-2023-0038366", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기한 사정을 감안하여 창출된 것으로서, 본 발명에서 도달하고자 하는 목적은, 다중 스케일 특징 및 근거 위치 추정을 활용한 정규화 흐름(Normalizing Flow) 기반의 이상 탐지 방안을 제안하는데 있다."}
{"patent_id": "10-2023-0038366", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위한 본 발명의 일 실시예에 따른 정규화 흐름 기반의 이상 탐지 장치는, 정규화 흐름 기 반의 이상 탐지 장치에 있어서, 입력 데이터의 스케일과, 상기 입력 데이터에 대해 출력되는 특징 벡터의 스케 일이 서로 다르며, 상기 정규화 흐름을 통해 특징 벡터 각각에 대해 가능도(Likelihood)를 도출하도록 학습된 인공신경망 집합을 이용하여 상기 인공신경망 집합으로 입력되는 상기 입력 데이터에 대한 이상을 탐지하는 탐 지부를 포함하는 것을 특징으로 한다. 구체적으로, 상기 탐지부는, 상기 인공신경망 집합을 이용하여 상기 입력 데이터 또는 상기 입력 데이터를 증강 한 증강 데이터로부터 가능도 집합을 획득하며, 획득된 가능도 집합을 통합한 결과에 대한 제1 임계값 초과 여 부에 기초하여, 상기 입력 데이터에 대한 이상을 추론할 수 있다. 구체적으로, 상기 탐지부는, 상기 입력 데이터의 이상이 추론되면, 상기 입력 데이터의 이상 추론에 근거가 되 는 근거 위치 정보를 추출하며, 상기 인공신경망 집합을 이용하여 상기 근거 위치 정보 또는 상기 근거 위치 정 보를 증강한 증강 데이터로부터 가능도 집합을 획득하며, 획득된 가능도 집합을 통합한 결과에 대한 제2 임계값 초과 여부에 기초하여, 상기 근거 위치 정보에 대한 이상이 추론되면, 상기 입력 데이터의 이상을 최종 탐지할 수 있다.구체적으로, 상기 장치는, 학습 데이터를 이용하여 상기 인공신경망 집합 내 각 인공신경망을 학습하는 학습부 를 더 포함하며, 상기 학습부는, 상기 학습 데이터 또는 상기 학습 데이터를 증강한 증강 데이터의 입력 시 인 공신경망으로부터 도출되는 가능도를 최대화하는 손실함수를 이용하여 각 인공신경망에 대한 가중치를 업데이트 할 수 있다. 구체적으로, 상기 장치는, 검증 데이터를 이용하여 상기 인공신경망 집합을 선택하는 선택부를 더 포함하며, 상 기 선택부는, 기 정의된 메타 휴리스틱 알고리즘을 기반으로, 검증 데이터와 특징 벡터의 서로 다른 스케일 조 합을 지원하는 인공신경망 집단에 대한 이상 탐지 성능 기반 적합도를 계산하며, 적합도 계산 결과 기 정의된 조건을 충족하는 특정 집단을 이상 탐지에 적합한 인공신경망 집합으로 선택할 수 있다. 구체적으로, 상기 탐지부는, 상기 입력 데이터의 이상 추론 과정에서 계산되는 기울기 맵(Gradient Map)을 이용 하여 상기 근거 위치 정보를 추출할 수 있다. 구체적으로, 상기 제1 임계값은, 상기 인공신경망 집합을 이용하여 검증 데이터 또는 상기 검증 데이터를 증강 한 증강 데이터로부터 획득되는 제3 가능도 집합의 평균값으로 결정되며, 상기 제2 임계값은, 상기 인공신경망 집합을 이용하여 상기 검증 데이터의 이상 추론에 근거가 되는 근거 위치 정보, 또는 근거 위치 정보를 증강한 증강 데이터로부터 획득되는 가능도 집합의 평균값으로 결정될 수 있다. 상기 목적을 달성하기 위한 본 발명의 일 실시예에 따른 정규화 흐름 기반의 이상 탐지 장치에서 수행되는 이상 탐지 방법은, 입력 데이터의 스케일과, 상기 입력 데이터에 대해 출력되는 특징 벡터의 스케일이 서로 다르며, 상기 정규화 흐름을 통해 특징 벡터 각각에 대해 가능도(Likelihood)를 도출하도록 학습된 인공신경망 집합을 이용하여 상기 인공신경망 집합으로 입력되는 상기 입력 데이터에 대한 이상을 탐지하는 탐지단계를 포함하는 것을 특징으로 한다. 구체적으로, 상기 탐지단계는, 상기 인공신경망 집합을 이용하여 상기 입력 데이터 또는 상기 입력 데이터를 증 강한 증강 데이터로부터 가능도 집합을 획득하며, 획득된 가능도 집합을 통합한 결과에 대한 제1 임계값 초과 여부에 기초하여, 상기 입력 데이터에 대한 이상을 추론할 수 있다. 구체적으로, 상기 탐지단계는, 상기 입력 데이터의 이상이 추론되면, 상기 입력 데이터의 이상 추론에 근거가 되는 근거 위치 정보를 추출하며, 상기 인공신경망 집합을 이용하여 상기 근거 위치 정보 또는 상기 근거 위치 정보를 증강한 증강 데이터로부터 가능도 집합을 획득하며, 획득된 가능도 집합을 통합한 결과에 대한 제2 임계 값 초과 여부에 기초하여, 상기 근거 위치 정보에 대한 이상이 추론되면, 상기 입력 데이터의 이상을 최종 탐지 할 수 있다. 구체적으로, 상기 방법은, 학습 데이터를 이용하여 상기 인공신경망 집합 내 각 인공신경망을 학습하는 학습단 계를 더 포함하며, 상기 학습단계는, 상기 학습 데이터 또는 상기 학습 데이터를 증강한 증강 데이터의 입력 시 인공신경망으로부터 도출되는 가능도를 최대화하는 손실함수를 이용하여 각 인공신경망에 대한 가중치를 업데이 트할 수 있다. 구체적으로, 상기 방법은, 검증 데이터를 이용하여 상기 인공신경망 집합을 선택하는 선택부를 더 포함하며, 상 기 선택단계는, 기 정의된 메타 휴리스틱 알고리즘을 기반으로, 검증 데이터와 특징 벡터의 서로 다른 스케일 조합을 지원하는 인공신경망 집단에 대한 이상 탐지 성능 기반 적합도를 계산하며, 적합도 계산 결과 기 정의된 조건을 충족하는 특정 집단을 이상 탐지에 적합한 인공신경망 집합으로 선택할 수 있다. 구체적으로, 상기 탐지단계는, 상기 입력 데이터의 이상 추론 과정에서 계산되는 기울기 맵(Gradient Map)을 이 용하여 상기 근거 위치 정보를 추출할 수 있다. 구체적으로, 상기 제1 임계값은, 상기 인공신경망 집합을 이용하여 검증 데이터 또는 상기 검증 데이터를 증강 한 증강 데이터로부터 획득되는 제3 가능도 집합의 평균값으로 결정되며, 상기 제2 임계값은, 상기 인공신경망 집합을 이용하여 상기 검증 데이터의 이상 추론에 근거가 되는 근거 위치 정보, 또는 근거 위치 정보를 증강한 증강 데이터로부터 획득되는 가능도 집합의 평균값으로 결정될 수 있다."}
{"patent_id": "10-2023-0038366", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이에, 본 발명의 이상 탐지 장치 및 이상 탐지 방법에서는, 입력 데이터의 스케일(크기) 변환 및 그에 따른 차 별화된 특징 정보를 추출하고, 정규화 흐름을 이용하여 크기가 각기 다른 입력 데이터들의 가능도(Likelihood) 를 도출 및 통합하며, 이에 대한 근거 위치 추정 결과를 이상 탐지 추론 결과에 반영하여 데이터 이상 여부를탐지함으로써, 이상 여부 탐지 결과의 정확도와 신뢰도를 크게 제고할 수 있다."}
{"patent_id": "10-2023-0038366", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명의 바람직한 실시예에 대하여 설명한다. 본 발명의 일 실시예에서는, 정규화 흐름(Normalizing Flow) 기반의 이상 탐지 기술을 다룬다. 이상 탐지 기술은 기존의 데이터 분석 방법으로는 파악하기 어려운 비정상적인 패턴을 검출하고, 이에 대한 대 응책을 마련하는 데 매우 유용하다. 이러한 이상 탐지 기술은 비정상적인 패턴을 검출하기 위한 방법으로 정상과 이상을 구분하는 지도 학습 기반 분류 기술을 이용하거나, 주성분 분석 및 오토 인코더를 이용한 비지도 학습 등이 제안되고 있다. 하지만 지도 학습 기반 방법론은 이상 데이터 수집의 어려움으로 인해 막대한 양의 학습 데이터를 요구하는 인 공지능 기법에는 부적절하며, 기존의 비지도 학습 기반 방법론은 데이터의 분포를 고려하지 않고 단순 통계적인 방법을 이용하기 때문에 다양한 분포를 가지는 데이터 셋에 적용하기에는 어려움이 있다. 한편, 정규화 흐름(Normalizing Flow)은 확률 분포의 변환(transformation)을 수행하는 비지도 학습 기반 모델 링 기법 중에 하나로, 역 변환이 가능(invertible)한 일련의 연산 흐름을 이용하여 복잡한 분포를 가지는 입력 데이터를 간단한 확률 분포로 매핑하는 과정을 의미한다. 이러한 확률론적 모델링 기법을 이용하여 기존에는 새로운 이미지나 음성 데이터를 생성 또는 밀도 추정 (density estimation) 작업에서 활용이 되어왔으며, 최근 이상 탐지를 위한 새로운 방법론으로 주목받고 있다. 현재 대표적인 정규화 흐름 기반 이상 탐지 기법은 입력 데이터로부터 고차원의 특징을 추출하고, 정규화 흐름 을 통해 특징 맵의 가능도를 도출하며, 임계값을 통해 이상 여부를 추론하는 것이 지배적이다. 하지만 입력 데이터의 크기에 따라 얻어지는 특징 정보의 특성을 고려하지 않는 경향이 있고, 이상으로 추론한 근거에 대한 활용 방법이 정립되지 않았기 때문에 그대로 적용하기 어려운 문제점이 발생한다. 따라서 본 발명의 일 실시예에서는, 입력 데이터의 크기에 따라 얻어지는 특징 정보의 특성과 이상으로 추론한 근거를 활용할 수 있는 정규화 흐름 기반의 이상 탐지 방안을 제안하고자 한다. 이와 관련하여, 도 1에는 본 발명의 일 실시예에 따른 이상 탐지 장치의 구성을 보여주고 있다. 도 1에 도시된 바와 같이, 본 발명의 일 실시예에 따른 이상 탐지 장치는 획득부를 포함하는 구성을 가질 수 있다. 또한, 본 발명의 일 실시예에 다른 이상 탐지 장치는 전술한 구성 이외에, 학습부, 및 선택부를 더 포함하는 구성을 가질 수 있다. 이상의 학습부, 선택부, 및 탐지부를 포함하는 이상 탐지 장치의 전체 구성 내지는 적어도 일부는 하드웨어 모듈 형태 또는 소프트웨어 모듈 형태로 구현되거나, 하드웨어 모듈과 소프트웨어 모듈이 조합 된 형태의 딥러닝 모델로 구현될 수 있다. 여기서, 소프트웨어 모듈이란, 프로세서에 의해 실행되는 명령어로 이해될 수 있으며, 이러한 명령어는 메모리 에 탑재된 형태를 가질 수 있다. 이에, 본 발명의 일 실시예에 따른 이상 탐지 장치는 전술한 구성을 통해 다중 스케일 특징 및 근거 위치 추정을 활용한 정규화 흐름(Normalizing Flow) 기반의 이상 탐지를 수행할 수 있는데, 이하에서는 이를 실현하는 객체 탐지 장치 내 구성에 대해 보다 구체적인 설명을 이어 가기로 한다. 한편, 설명에 앞서 본 발명의 일 실시예에서의 입력 데이터의 경우, 학습 데이터와, 검증 데이터, 및 테스트 데 이터로 구분될 수 있는데, 이러한 각 데이터의 정상 분(정상 데이터)에 대해서는, 데이터 증강(Data Augmentation)을 통해 예컨대, 고정된 데이터 크기로 변환, 스케일링 팩터를 통한 데이터 크기 조절, 및 크롭 (Crop)이나 노이즈 변환 등이 수행됨을 전제한다. 학습부는 인공신경망을 학습하는 기능을 담당한다. 보다 구체적으로, 학습부는 학습 데이터의 스케일과, 학습 데이터로부터 출력되는 특징 벡터의 스케일이 서로 다르며, 정규화 흐름을 통해 각 특징 벡터에 대해 가능도(Likelihood)를 도출하는 인공신경망을 다중 스케 일 특징마다 학습하게 된다. 이때, 학습부는 예컨대, 도 2에서와 같이 학습 데이터와 학습 데이터를 증강한 증강 데이터의 입력 시 특 징 벡터 추출에 이어 인공신경망으로부터 도출되는 가능도를 최대화하는 손실함수를 이용하여 인공신경망(정규 화 흐름)에 대한 가중치를 업데이트하는 방식으로 인공신경망을 학습할 수 있다. 이와 관련하여, 본 발명의 일 실시예에 따른 인공신경망은, 예컨대, 도 3에서와 같이, 합성곱 신경망 (Convolutional Neural Network) 또는 순환 신경망(Recurrent Neural Network) 계열의 인공신경망(Artificial Neural Network)로 구성되며, 이러한 인공신경망에는 입력 데이터로부터 특징 벡터를 추출하기 위한 특징 추출 블록(Pre-trained Feature extractor)과 특징 추출 블록(Pre-trained Feature extractor)에서 추출된 특징 벡 터로부터 가중도(Likelihood)를 도출하는 2 이상의 정규화 흐름 블록(Normalizing Flow)이 포함될 수 있다. 참고로, 위 설명에 따르면, 인공신경망은 최적화 블록(Optimizer)을 통해 가능도를 최대화하는 방향의 손실함수 (Loss)를 이용하여 인공신경망의 가중치(Weight)가 업데이트될 수 있음을 알 수 있다. 선택부는 이상 탐지에 적합한 인공신경망 집합을 선택하는 기능을 담당한다. 보다 구체적으로, 선택부는 검증 데이터를 이용하여 이상 탐지에 적합한 인공신경망 집합을 선택하게 된다. 이때, 선택부는 메타 휴리스틱 알고리즘을 기반으로 이상 탐지에 적합한 인공신경 집합을 선택할 수 있다. 이와 관련하여, 선택부는 예컨대 도 4에서와 같이, 검증 데이터와 특징 벡터의 서로 다른 스케일 조합을 지원하는 인공신경망 집합을 해집단으로 각각 설정하고, 유전 알고리즘, 진화 알고리즘, Simulated Annealing과 같은 최적화 알고리즘(메타 휴리스틱 알고리즘)을 기반으로 해집단 각각에 대한 이상 탐지 성능 기반 적합도 계 산하며, 계산 결과 기 정의된 조건(종료 조건)을 충족하는 특정 집단을 이상 탐지에 적합한 인공신경망 집단으 로 선택할 수 있다. 탐지부는 테스트 데이터(입력 데이터)에 대한 이상 탐지 기능을 담당한다. 보다 구체적으로, 탐지부는 이상 탐지에 적합한 인공신경망 집합이 선택되면, 테스트 데이터의 스케일과, 테스트 데이터에 대해 출력되는 특징 벡터의 스케일이 서로 다르며, 정규화 흐름을 통해 특징 벡터 각각에 대해 가능도(Likelihood)를 도출하는 인공신경망 집합을 이용하여 테스트 데이터에 대한 이상 탐지를 수행하게 된다. 이를 위해, 탐지부는 예컨대, 5의 (a) 과정에서와 같이 상기 인공신경망 집합을 이용하여 테스트 데이터 또는 테스트 데이터를 증강한 증강 데이터로부터 가능도 집합을 획득하며, 이러한 가능도 집합을 통합한 결과에 대한 제1 임계값 초과 여부를 기초로, 테스트 데이터에 대한 이상이 추론되면, 테스트 데이터의 이상 추론에 근 거가 되는 근거 위치 정보를 추출한다. 이때, 탐지부는 가능도 집합을 통합한 결과가 제1 임계값을 초과하는 경우, 테스트 데이터에 대한 이상이 발생한 것으로 추론할 수 있다. 이와 관련하여, 탐지부는 테스트 데이터의 이상 추론 과정에서 계산되는 기울기 맵(Gradient Map)을 이용 하여 근거 위치 정보를 추출할 수 있으며, 또한, 제1 임계값은, 상기 인공신경망 집합을 이용하여 검증 데이터 또는 검증 데이터를 증강한 증강 데이터로부터 획득되는 가능도 집합의 평균값으로 결정될 수 있다. 나아가, 탐지부는 테스트 데이터에 대한 이상 추론에 따라 근거 위치 정보가 추출되면, 앞서 예시한 도 5 의 (b) 과정에서와 같이 상기 인공신경망 집합을 이용하여 근거 위치 정보 또는 근거 위치 정보를 증강한 증강 데이터로부터 가능도 집합을 획득하며, 이러한 가능도 집합을 통합한 결과에 대한 제2 임계값 초과 여부를 기초로, 근거 위치 정보에 대한 이상이 추론되면, 테스트 데이터의 이상을 최종 탐지한다. 이때, 탐지부는 가능도 집합을 통합한 결과가 제2 임계값을 초과하는 경우, 근거 위치 정보에 대한 이상이 발생한 것으로 추론할 수 있으며, 여기서의 제2 임계값은, 상기 인공신경망 집합을 이용하여 검증 데이터의 이 상 추론에 근거가 되는 근거 위치 정보, 또는 근거 위치 정보를 증강한 증강 데이터로부터 획득되는 가능도 집 합의 평균값으로 결정될 수 있다. 이상에서 살펴본 바와 같이 본 발명의 일 실시예에 따른 이상 탐지 장치의 구성에 따르면, 입력 데이터의 스케일(크기) 변환 및 그에 따른 차별화된 특징 정보를 추출하고, 정규화 흐름을 이용하여 크기가 각기 다른 입 력 데이터들의 가능도(Likelihood)를 도출 및 통합하며, 이에 대한 근거 위치 추정 결과를 이상 탐지 추론 결과 에 반영하여 데이터 이상 여부를 탐지함으로써, 이상 여부 탐지 결과의 정확도와 신뢰도를 크게 제고할 수 있음 을 알 수 있다. 이하에서는, 도 6을 참조하여, 본 발명의 일 실시예에 따른 이상 탐지 방법을 설명하기로 한다. 설명의 편의를 위해 본 발명의 일 실시예에 따른 딥러닝 모델 학습 방법을 수행하는 주체는, 앞서 도 1을 참조 하여 설명한 이상 탐지 장치임을 전제하기로 한다. 먼저, 이상 탐지 장치는 학습 데이터의 스케일과, 학습 데이터로부터 출력되는 특징 벡터의 스케일이 서로 다르며, 정규화 흐름을 통해 각 특징 벡터에 대해 가능도(Likelihood)를 도출하는 인공신경망을 다중 스케일 특 징마다 학습한다(S100). 이때, 이상 탐지 장치는 앞서 예시한 도 2에서와 같이 학습 데이터와 학습 데이터를 증강한 증강 데이터의 입력 시 특징 벡터 추출에 이어 인공신경망으로부터 도출되는 가능도를 최대화하는 손실함수를 이용하여 인공신 경망(정규화 흐름)에 대한 가중치를 업데이트하는 방식으로 인공신경망을 학습할 수 있다. 이와 관련하여, 본 발명의 일 실시예에 따른 인공신경망은, 앞서 예시한, 도 3에서와 같이, 합성곱 신경망 (Convolutional Neural Network) 또는 순환 신경망(Recurrent Neural Network) 계열의 인공신경망(Artificial Neural Network)로 구성되며, 이러한 인공신경망에는 입력 데이터로부터 특징 벡터를 추출하기 위한 특징 추출 블록(Pre-trained Feature extractor)과 특징 추출 블록(Pre-trained Feature extractor)에서 추출된 특징 벡 터로부터 가중도(Likelihood)를 도출하는 2 이상의 정규화 흐름 블록(Normalizing Flow)이 포함될 수 있다. 참고로, 위 설명에 따르면, 인공신경망은 최적화 블록(Optimizer)을 통해 가능도를 최대화하는 방향의 손실함수 (Loss)를 이용하여 인공신경망의 가중치(Weight)가 업데이트될 수 있음을 알 수 있다. 이어서, 이상 탐지 장치는 검증 데이터를 이용하여 이상 탐지에 적합한 인공신경망 집합을 선택한다 (S200). 이때, 이상 탐지 장치는 메타 휴리스틱 알고리즘을 기반으로 이상 탐지에 적합한 인공신경 집합을 선택할 수 있다. 이와 관련하여, 이상 탐지 장치는 앞서 예시한 도 4에서와 같이, 검증 데이터와 특징 벡터의 서로 다른 스 케일 조합을 지원하는 인공신경망 집합을 해집단으로 각각 설정하고, 유전 알고리즘, 진화 알고리즘, Simulated Annealing과 같은 최적화 알고리즘(메타 휴리스틱 알고리즘)을 기반으로 해집단 각각에 대한 이상 탐지 성능 기 반 적합도 계산하며, 계산 결과 기 정의된 조건(종료 조건)을 충족하는 특정 집단을 이상 탐지에 적합한 인공신 경망 집단으로 선택할 수 있다. 이후, 이상 탐지 장치는 이상 탐지에 적합한 인공신경망 집합이 선택되면, 테스트 데이터의 스케일과, 테 스트 데이터에 대해 출력되는 특징 벡터의 스케일이 서로 다르며, 정규화 흐름을 통해 특징 벡터 각각에 대해 가능도(Likelihood)를 도출하는 인공신경망 집합을 이용하여 테스트 데이터에 대한 이상 탐지를 수행한다 (S300). 이를 위해, 이상 탐지 장치는 앞서 예시한, 도 5의 (a)의 과정에서와 같이 상기 인공신경망 집합을 이용하 여 테스트 데이터 또는 테스트 데이터를 증강한 증강 데이터로부터 가능도 집합을 획득하며, 이러한 가능도 집 합을 통합한 결과에 대한 제1 임계값 초과 여부를 기초로, 테스트 데이터에 대한 이상이 추론되면, 테스트 데이 터의 이상 추론에 근거가 되는 근거 위치 정보를 추출할 수 있다. 이때, 이상 탐지 장치는 가능도 집합을 통합한 결과가 제1 임계값을 초과하는 경우, 테스트 데이터에 대한 이상이 발생한 것으로 추론한다.이와 관련하여, 이상 탐지 장치는 테스트 데이터의 이상 추론 과정에서 계산되는 기울기 맵(Gradient Ma p)을 이용하여 근거 위치 정보를 추출할 수 있으며, 또한, 제1 임계값은, 상기 인공신경망 집합을 이용하여 검 증 데이터 또는 검증 데이터를 증강한 증강 데이터로부터 획득되는 가능도 집합의 평균값으로 결정될 수 있다. 나아가, 이상 탐지 장치는 테스트 데이터에 대한 이상 추론에 따라 근거 위치 정보가 추출되면, 앞서 예시 한 도 5의 (b) 과정에서와 같이 상기 인공신경망 집합을 이용하여 근거 위치 정보 또는 근거 위치 정보를 증강 한 증강 데이터로부터 가능도 집합을 획득하며, 이러한 가능도 집합을 통합한 결과에 대한 제2 임계값 초과 여 부를 기초로, 근거 위치 정보에 대한 이상이 추론되면, 테스트 데이터의 이상을 최종 탐지한다. 이때, 이상 탐지 장치는 가능도 집합을 통합한 결과가 제2 임계값을 초과하는 경우, 근거 위치 정보에 대 한 이상이 발생한 것으로 추론할 수 있으며, 여기서의 제2 임계값은, 상기 인공신경망 집합을 이용하여 검증 데 이터의 이상 추론에 근거가 되는 근거 위치 정보, 또는 근거 위치 정보를 증강한 증강 데이터로부터 획득되는 가능도 집합의 평균값으로 결정될 수 있다. 이상에서 살펴본 바와 같이 본 발명의 일 실시예에 따른 이상 탐지 방법에 따르면, 입력 데이터의 스케일(크기) 변환 및 그에 따른 차별화된 특징 정보를 추출하고, 정규화 흐름을 이용하여 크기가 각기 다른 입력 데이터들의 가능도(Likelihood)를 도출 및 통합하며, 이에 대한 근거 위치 추정 결과를 이상 탐지 추론 결과에 반영하여 데 이터 이상 여부를 탐지함으로써, 이상 여부 탐지 결과의 정확도와 신뢰도를 크게 제고할 수 있음을 알 수 있다. 이상에서 살펴본 바와 같이 본 발명의 일 실시예에 따른 이상 탐지 방법에 따르면, 입력 데이터의 스케일(크기) 변환 및 그에 따른 차별화된 특징 정보를 추출하고, 정규화 흐름을 이용하여 크기가 각기 다른 입력 데이터들의 가능도(Likelihood)를 도출 및 통합하며, 이에 대한 근거 위치 추정 결과를 이상 탐지 추론 결과에 반영하여 데 이터 이상 여부를 탐지함으로써, 이상 여부 탐지 결과의 정확도와 신뢰도를 크게 제고할 수 있음을 알 수 있다. 한편, 본 명세서에서 설명하는 기능적인 동작과 주제의 구현물들은 디지털 전자 회로로 구현되거나, 본 명세서 에서 개시하는 구조 및 그 구조적인 등가물들을 포함하는 컴퓨터 소프트웨어, 펌웨어 혹은 하드웨어로 구현되거 나, 이들 중 하나 이상의 결합으로 구현 가능하다. 본 명세서에서 설명하는 주제의 구현물들은 하나 이상의 컴 퓨터 프로그램 제품, 다시 말해 처리 시스템의 동작을 처리하기 위하여 혹은 이것에 의한 실행을 위하여 유형의 프로그램 저장매체 상에 인코딩된 컴퓨터 프로그램 명령에 관한 하나 이상의 모듈로서 구현될 수 있다. 컴퓨터로 판독 가능한 매체는 기계로 판독 가능한 저장 장치, 기계로 판독 가능한 저장 기판, 메모리 장치, 혹 은 이들 중 하나 이상의 조합일 수 있다. 본 명세서에서 \"시스템\"이나 \"장치\"라 함은 예컨대 프로그래머블 프로세서, 컴퓨터 혹은 다중 프로세서나 컴퓨 터를 포함하여 데이터를 처리하기 위한 모든 기구, 장치 및 기계를 포괄한다. 처리 시스템은, 하드웨어에 부가 하여, 예컨대 프로세서 펌웨어를 구성하는 코드, 프로토콜 스택, 데이터베이스 관리 시스템, 운영 체제 혹은 이 들 중 하나 이상의 조합 등 요청 시 컴퓨터 프로그램에 대한 실행 환경을 형성하는 코드를 포함할 수 있다. 컴퓨터 프로그램(프로그램, 소프트웨어, 소프트웨어 애플리케이션, 스크립트 혹은 코드로도 알려져 있음)은 컴 파일되거나 해석된 언어나 선험적 혹은 절차적 언어를 포함하는 프로그래밍 언어의 어떠한 형태로도 작성될 수 있으며, 독립형 프로그램이나 모듈, 컴포넌트, 서브루틴 혹은 컴퓨터 환경에서 사용하기에 적합한 다른 유닛을 포함하여 어떠한 형태로도 전개될 수 있다. 컴퓨터 프로그램은 파일 시스템의 파일에 반드시 대응하는 것은 아 니다. 프로그램은 요청된 프로그램에 제공되는 단일 파일 내에, 혹은 다중의 상호 작용하는 파일(예컨대, 하나 이상의 모듈, 하위 프로그램 혹은 코드의 일부를 저장하는 파일) 내에, 혹은 다른 프로그램이나 데이터를 보유 하는 파일의 일부(예컨대, 마크업 언어 문서 내에 저장되는 하나 이상의 스크립트) 내에 저장될 수 있다. 컴퓨 터 프로그램은 하나의 사이트에 위치하거나 복수의 사이트에 걸쳐서 분산되어 통신 네트워크에 의해 상호 접속 된 다중 컴퓨터나 하나의 컴퓨터 상에서 실행되도록 전개될 수 있다. 한편, 컴퓨터 프로그램 명령어와 데이터를 저장하기에 적합한 컴퓨터로 판독 가능한 매체는, 예컨대 EPROM, EEPROM 및 플래시메모리 장치와 같은 반도체 메모리 장치, 예컨대 내부 하드디스크나 외장형 디스크와 같은 자 기 디스크, 자기광학 디스크 및 CD-ROM과 DVD-ROM 디스크를 포함하여 모든 형태의 비휘발성 메모리, 매체 및 메 모리 장치를 포함할 수 있다. 프로세서와 메모리는 특수 목적의 논리 회로에 의해 보충되거나, 그것에 통합될 수 있다. 본 명세서에서 설명한 주제의 구현물은 예컨대 데이터 서버와 같은 백엔드 컴포넌트를 포함하거나, 예컨대 애플 리케이션 서버와 같은 미들웨어 컴포넌트를 포함하거나, 예컨대 사용자가 본 명세서에서 설명한 주제의 구현물과 상호 작용할 수 있는 웹 브라우저나 그래픽 유저 인터페이스를 갖는 클라이언트 컴퓨터와 같은 프론트엔드 컴포넌트 혹은 그러한 백엔드, 미들웨어 혹은 프론트엔드 컴포넌트의 하나 이상의 모든 조합을 포함하는 연산 시스템에서 구현될 수도 있다. 시스템의 컴포넌트는 예컨대 통신 네트워크와 같은 디지털 데이터 통신의 어떠한 형태나 매체에 의해서도 상호 접속 가능하다. 본 명세서는 다수의 특정한 구현물의 세부사항들을 포함하지만, 이들은 어떠한 발명이나 청구 가능한 것의 범위 에 대해서도 제한적인 것으로서 이해되어서는 안되며, 오히려 특정한 발명의 특정한 실시형태에 특유할 수 있는 특징들에 대한 설명으로서 이해되어야 한다. 마찬가지로, 개별적인 실시형태의 문맥에서 본 명세서에 기술된 특 정한 특징들은 단일 실시형태에서 조합하여 구현될 수도 있다. 반대로, 단일 실시형태의 문맥에서 기술한 다양 한 특징들 역시 개별적으로 혹은 어떠한 적절한 하위 조합으로도 복수의 실시형태에서 구현 가능하다. 나아가, 특징들이 특정한 조합으로 동작하고 초기에 그와 같이 청구된 바와 같이 묘사될 수 있지만, 청구된 조합으로부 터의 하나 이상의 특징들은 일부 경우에 그 조합으로부터 배제될 수 있으며, 그 청구된 조합은 하위 조합이나 하위 조합의 변형물로 변경될 수 있다. 또한, 본 명세서에서는 특정한 순서로 도면에서 동작들을 묘사하고 있지만, 이는 바람직한 결과를 얻기 위하여 도시된 그 특정한 순서나 순차적인 순서대로 그러한 동작들을 수행하여야 한다거나 모든 도시된 동작들이 수행 되어야 하는 것으로 이해되어서는 안 된다. 특정한 경우, 멀티태스킹과 병렬 프로세싱이 유리할 수 있다. 또한, 상술한 실시형태의 다양한 시스템 컴포넌트의 분리는 그러한 분리를 모든 실시형태에서 요구하는 것으로 이해되 어서는 안되며, 설명한 프로그램 컴포넌트와 시스템들은 일반적으로 단일의 소프트웨어 제품으로 함께 통합되거 나 다중 소프트웨어 제품에 패키징될 수 있다는 점을 이해하여야 한다 이와 같이, 본 명세서는 그 제시된 구체적인 용어에 본 발명을 제한하려는 의도가 아니다. 따라서, 상술한 예를 참조하여 본 발명을 상세하게 설명하였지만, 당업자라면 본 발명의 범위를 벗어나지 않으면서도 본 예들에 대한 개조, 변경 및 변형을 가할 수 있다. 본 발명의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하 여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 등가개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으로 해석되어야 한다. 산업상 이용가능성 본 발명에 따른 이상 탐지 장치 및 이상 탐지 방법에 따르면, 다중 스케일 특징 및 근거 위치 추정을 활용한 정 규화 흐름(Normalizing Flow) 기반의 이상 탐지 방안을 제안하고 있다는 점에서, 기존 기술의 한계를 뛰어 넘음 에 따라 관련 기술에 대한 이용만이 아닌 적용되는 장치의 시판 또는 영업의 가능성이 충분할 뿐만 아니라 현실 적으로 명백하게 실시할 수 있는 정도이므로 산업상 이용가능성이 있는 발명이다."}
{"patent_id": "10-2023-0038366", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 객체 추적 장치를 설명하기 위한 구성도. 도 2 및 도 3은 본 발명의 일 실시예에 따른 인공지능망 학습을 부연 설명하기 위한 예시도. 도 4는 본 발명의 일 실시예에 따른 인공지능망 집합 선택을 부연 설명하기 위한 예시도. 도 5는 본 발명의 일 실시예에 따른 이상 탐지를 부연 설명하기 위한 예시도. 도 6은 본 발명의 일 실시예에 따른 이상 탐지 방법을 설명하기 위한 순서도."}
