{"patent_id": "10-2021-0069870", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0076271", "출원번호": "10-2021-0069870", "발명의 명칭": "간소화된 시그모이드 함수 회로 및 이를 포함하는 뉴로모픽 프로세서", "출원인": "한국전자통신연구원", "발명자": "전인산"}}
{"patent_id": "10-2021-0069870", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "입력 데이터의 실수 영역에서의 부호가 양인 경우, 상기 입력 데이터에 대하여 간소화된 시그모이드 함수에 기반한 연산을 수행하는 제 1 회로;상기 입력 데이터의 실수 영역에서의 부호가 음인 경우, 상기 입력 데이터에 대하여 상기 간소화된 시그모이드함수에 기반한 연산을 수행하는 제 2 회로; 및상기 입력 데이터의 부호에 기반하여 상기 제 1 회로의 출력 및 상기 제 2 회로의 출력 중 어느 하나를 선택하여 출력하는 제 1 멀티플렉서를 포함하되,상기 간소화된 시그모이드 함수는 실수 영역의 시그모이드 함수를 로그 영역의 시그모이드 함수로 변환하고, 상기 로그 영역의 시그모이드 함수를 변분 변환하여 도출되는 간소화된 시그모이드 함수 회로."}
{"patent_id": "10-2021-0069870", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 제 1 회로는:상기 변분 변환을 위한 제 1 계수를 선택하는 제 2 멀티플렉서; 및상기 변분 변환을 위한 제 2 계수를 선택하는 제 3 멀티플렉서를 포함하고,상기 제 2 회로는:상기 변분 변환을 위한 제 3 계수를 선택하는 제 4 멀티플렉서; 및상기 변분 변환을 위한 제 4 계수를 선택하는 제 5 멀티플렉서를 포함하는 간소화된 시그모이드 함수 회로."}
{"patent_id": "10-2021-0069870", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 제 1 회로는:상기 입력 데이터의 크기와 상기 제 1 계수의 곱 연산을 수행하는 제 1 곱셈기; 및상기 입력 데이터의 크기와 상기 제 1 계수의 곱 엽산의 결과와 상기 제 2 계수의 합 연산을 수행하는 제 1 합산기를 더 포함하고,상기 제 2 회로는:상기 입력 데이터의 크기와 상기 제 3 계수의 곱 연산을 수행하는 제 2 곱셈기; 및상기 입력 데이터의 크기와 상기 제 3 계수의 곱 연산의 결과와 상기 제 4 계수의 합 연산을 수행하는 제 2 합산기를 더 포함하는 간소화된 시그모이드 함수 회로."}
{"patent_id": "10-2021-0069870", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 변분 변환은 상기 입력 데이터의 구간별 변분 변환을 통하여 근사화한 결과를 도출하는 간소화된 시그모이드 함수 회로."}
{"patent_id": "10-2021-0069870", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "인공 신경망의 연산을 수행하기 위한 복수의 인공뉴런 구현 소자들을 포함하는 인공뉴런 구현 소자 어레이를 포공개특허 10-2022-0076271-3-함하되,상기 복수의 인공뉴런 구현 소자들 각각은:입력 데이터와 가중치의 곱에 대한 합 연산을 수행하는 합산 회로; 및상기 합산 회로의 연산 결과로부터 활성 함수를 통한 활성 결과를 도출하는 활성 함수 회로를 포함하고,상기 활성 함수는 실수 영역의 시그모이드 함수를 로그 영역의 시그모이드 함수로 변환하고, 상기 로그 영역의시그모이드 함수를 변분 변환하여 도출되는 뉴로모픽 프로세서."}
{"patent_id": "10-2021-0069870", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서,상기 활성 함수 회로는 적어도 하나의 간소화된 시그모이드 함수 회로를 포함하고,상기 적어도 하나의 간소화된 시그모이드 함수 회로는:입력 데이터의 실수 영역에서의 부호가 양인 경우, 상기 입력 데이터에 대하여 간소화된 시그모이드 함수에 기반한 연산을 수행하는 제 1 회로;상기 입력 데이터의 실수 영역에서의 부호가 음인 경우, 상기 입력 데이터에 대하여 상기 간소화된 시그모이드함수에 기반한 연산을 수행하는 제 2 회로; 및상기 입력 데이터의 부호에 기반하여 상기 제 1 회로의 출력 및 상기 제 2 회로의 출력 중 어느 하나를 선택하여 출력하는 제 1 멀티플렉서를 포함하는 뉴로모픽 프로세서."}
{"patent_id": "10-2021-0069870", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서,상기 제 1 회로는:상기 입력 데이터의 크기와 상기 제 1 계수의 곱 연산을 수행하는 제 1 곱셈기; 및상기 입력 데이터의 크기와 상기 제 1 계수의 곱 엽산의 결과와 상기 제 2 계수의 합 연산을 수행하는 제 1 합산기를 더 포함하고,상기 제 2 회로는:상기 입력 데이터의 크기와 상기 제 3 계수의 곱 연산을 수행하는 제 2 곱셈기; 및상기 입력 데이터의 크기와 상기 제 3 계수의 곱 연산의 결과와 상기 제 4 계수의 합 연산을 수행하는 제 2 합산기를 더 포함하는 뉴로모픽 프로세서."}
{"patent_id": "10-2021-0069870", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서,상기 제 1 회로는:상기 변분 변환을 위한 제 1 계수를 선택하는 제 2 멀티플렉서; 및상기 변분 변환을 위한 제 2 계수를 선택하는 제 3 멀티플렉서를 포함하고,상기 제 2 회로는:상기 변분 변환을 위한 제 3 계수를 선택하는 제 4 멀티플렉서; 및상기 변분 변환을 위한 제 4 계수를 선택하는 제 5 멀티플렉서를 포함하는 뉴로모픽 프로세서."}
{"patent_id": "10-2021-0069870", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 5 항에 있어서,상기 변분 변환은 상기 입력 데이터의 구간별 변분 변환을 통하여 근사화한 결과를 도출하는 뉴로모픽공개특허 10-2022-0076271-4-프로세서."}
{"patent_id": "10-2021-0069870", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 5 항에 있어서,외부로부터 상기 입력 데이터를 수신하고, 상기 외부로 상기 입력 데이터에 대한 상기 인공 신경망의 연산 결과를 출력하는 입출력 유닛;상기 입출력 유닛으로부터 상기 입력 데이터를 수신하고, 상기 입력 데이터를 전달하는 제어 로직 유닛;상기 제어 로직 유닛으로부터 상기 인공뉴런 구현 소자 어레이에 상기 입력 데이터를 전달하는 워드 라인 바이어스 유닛;상기 인공뉴런 구현 소자 어레이로부터 상기 입력 데이터에 대한 연산 결과를 검출하는 비트 라인 바이어스 및검출 유닛을 더 포함하는 뉴로모픽 프로세서."}
{"patent_id": "10-2021-0069870", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 5 항에 있어서,상기 인공뉴런 구현 소자 어레이에 포함되는 복수의 인공뉴런 구현 소자들의 연결 관계에 대한 정보를 저장하는비휘발성 메모리;상기 인공뉴런 구현 소자 어레이로부터 검출된 상기 연산 결과를 저장하는 휘발성 메모리를 더 포함하는 뉴로모픽 프로세서."}
{"patent_id": "10-2021-0069870", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 간소화된 시그모이드 함수 회로 및 이를 포함하는 뉴로모픽 프로세서에 대한 것으로, 본 개시에 따른 간소화된 시그모이드 함수 회로는 입력 데이터의 실수 영역에서의 부호가 양인 경우, 상기 입력 데이터에 대하여 간소화된 시그모이드 함수에 기반한 연산을 수행하는 제 1 회로, 상기 입력 데이터의 실수 영역에서의 부호가 음 인 경우, 상기 입력 데이터에 대하여 상기 간소화된 시그모이드 함수에 기반한 연산을 수행하는 제 2 회로 및 상 기 입력 데이터의 부호에 기반하여 상기 제 1 회로의 출력 및 상기 제 2 회로의 출력 중 어느 하나를 선택하여 출력하는 제 1 멀티플렉서를 포함하되, 상기 간소화된 시그모이드 함수는 실수 영역의 시그모이드 함수를 로그 영역의 시그모이드 함수로 변환하고, 상기 로그 영역의 시그모이드 함수를 변분 변환하여 도출된다."}
{"patent_id": "10-2021-0069870", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 인공지능(Artificial Intelligence, AI) 기술에 관한 것으로, 좀 더 상세하게는 인공신경망 (Artificial Neural Network, ANN)에 사용되는 간소화된 시그모이드 함수 회로 및 이를 포함하는 뉴로모픽 프로 세서에 관한 것이다."}
{"patent_id": "10-2021-0069870", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 4차 산업 혁명의 핵심 기술인 인공지능(Artificial Intelligence, AI) 기술에 대한 관심이 높아지고 있다. 인공지능이란, 인간의 지능을 기계, 시스템 등에 인공적으로 구현한 것으로, 인공신경망(Artificial Neural Network, ANN)으로 불리는 학습 알고리즘에 기반하여 구현될 수 있다. 인공신경망은 생물학의 신경망과 유사한 방식으로 데이터를 처리하는 통계학적인 망이다. 인공신경망은 문자 인식, 이미지 인식, 음성 인식, 얼굴 인식 등과 같은 다양한 분야에서 사용될 수 있다. 기술의 발전에 따라, 인공신경망의 복잡도는 보다 증가하고, 인공신경망을 통하여 다뤄지는 데이터의 양과 종류 가 방대해지면서, 인공신경망에 요구되는 연산량이 급격히 증가하였다. 연산량 증가에 따라 인공신경망의 데이 터 처리 속도가 현저히 떨어지는 문제점을 해결하기 위하여, 연산량을 감소시키기 위한 텐서 분해법(Tensor Decomposition), 망 가지치기(Network Pruning), 양자화 등 다양한 방법이 제안되었으나, 연산량을 획기적으로 감소시키기에 어려움이 있다."}
{"patent_id": "10-2021-0069870", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 인공신경망(Artificial Neural Network, ANN)에 사용되는 간소화된 시그모이드 함수 회로 및 이를 포 함하는 뉴로모픽 프로세서를 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2021-0069870", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 실시 예에 따른 간소화된 시그모이드 함수 회로는 입력 데이터의 실수 영역에서의 부호가 양인 경우, 상기 입력 데이터에 대하여 간소화된 시그모이드 함수에 기반한 연산을 수행하는 제 1 회로, 상기 입력 데이터 의 실수 영역에서의 부호가 음인 경우, 상기 입력 데이터에 대하여 상기 간소화된 시그모이드 함수에 기반한 연 산을 수행하는 제 2 회로 및 상기 입력 데이터의 부호에 기반하여 상기 제 1 회로의 출력 및 상기 제 2 회로의 출력 중 어느 하나를 선택하여 출력하는 제 1 멀티플렉서를 포함하되, 상기 간소화된 시그모이드 함수는 실수 영역의 시그모이드 함수를 로그 영역의 시그모이드 함수로 변환하고, 상기 로그 영역의 시그모이드 함수를 변분 변환하여 도출된다. 예로서, 상기 제 1 회로는 상기 변분 변환을 위한 제 1 계수를 선택하는 제 2 멀티플렉서 및 상기 변분 변환을 위한 제 2 계수를 선택하는 제 3 멀티플렉서를 포함하고, 상기 제 2 회로는 상기 변분 변환을 위한 제 3 계수를 선택하는 제 4 멀티플렉서 및 상기 변분 변환을 위한 제 4 계수를 선택하는 제 5 멀티플렉서를 포함한다. 예로서, 상기 제 1 회로는 상기 입력 데이터의 크기와 상기 제 1 계수의 곱 연산을 수행하는 제 1 곱셈기 및 상 기 입력 데이터의 크기와 상기 제 1 계수의 곱 엽산의 결과와 상기 제 2 계수의 합 연산을 수행하는 제 1 합산 기를 더 포함하고, 상기 제 2 회로는 상기 입력 데이터의 크기와 상기 제 3 계수의 곱 연산을 수행하는 제 2 곱 셈기 및 상기 입력 데이터의 크기와 상기 제 3 계수의 곱 연산의 결과와 상기 제 4 계수의 합 연산을 수행하는 제 2 합산기를 더 포함한다. 예로서, 상기 변분 변환은 상기 입력 데이터의 구간별 변분 변환을 통하여 근사화한 결과를 도출한다. 본 개시의 실시 예에 따른 뉴로모픽 프로세서는 인공 신경망의 연산을 수행하기 위한 복수의 인공뉴런 구현 소 자들을 포함하는 인공뉴런 구현 소자 어레이를 포함하되, 상기 복수의 인공뉴런 구현 소자들 각각은 입력 데이 터와 가중치의 곱에 대한 합 연산을 수행하는 합산 회로 및 상기 합산 회로의 연산 결과로부터 활성 함수를 통 한 활성 경과를 도출하는 활성 함수 회로를 포함하고, 상기 활성 함수는 실수 영역의 시그모이드 함수를 로그 영역의 시그모이드 함수로 변환하고, 상기 로그 영역의 시그모이드 함수를 변분 변환하여 도출된다. 예로서, 상기 활성 함수 회로는 적어도 하나의 간소화된 시그모이드 함수 회로를 포함하고, 상기 적어도 하나의 간소화된 시그모이드 함수 회로는 입력 데이터의 실수 영역에서의 부호가 양인 경우, 상기 입력 데이터에 대하 여 간소화된 시그모이드 함수에 기반한 연산을 수행하는 제 1 회로, 상기 입력 데이터의 실수 영역에서의 부호 가 음인 경우, 상기 입력 데이터에 대하여 상기 간소화된 시그모이드 함수에 기반한 연산을 수행하는 제 2 회로 및 상기 입력 데이터의 부호에 기반하여 상기 제 1 회로의 출력 및 상기 제 2 회로의 출력 중 어느 하나를 선택 하여 출력하는 제 1 멀티플렉서를 포함한다. 예로서, 상기 제 1 회로는 상기 입력 데이터의 크기와 상기 제 1 계수의 곱 연산을 수행하는 제 1 곱셈기 및 상 기 입력 데이터의 크기와 상기 제 1 계수의 곱 엽산의 결과와 상기 제 2 계수의 합 연산을 수행하는 제 1 합산 기를 더 포함하고, 상기 제 2 회로는 상기 입력 데이터의 크기와 상기 제 3 계수의 곱 연산을 수행하는 제 2 곱 셈기 및 상기 입력 데이터의 크기와 상기 제 3 계수의 곱 연산의 결과와 상기 제 4 계수의 합 연산을 수행하는 제 2 합산기를 더 포함한다. 예로서, 상기 제 1 회로는 상기 변분 변환을 위한 제 1 계수를 선택하는 제 2 멀티플렉서 및 상기 변분 변환을 위한 제 2 계수를 선택하는 제 3 멀티플렉서를 포함하고, 상기 제 2 회로는 상기 변분 변환을 위한 제 3 계수를 선택하는 제 4 멀티플렉서 및 상기 변분 변환을 위한 제 4 계수를 선택하는 제 5 멀티플렉서를 포함한다. 예로서, 상기 변분 변환은 상기 입력 데이터의 구간별 변분 변환을 통하여 근사화한 결과를 도출한다. 예로서, 본 개시에 따른 뉴로모픽 프로세서는 외부로부터 상기 입력 데이터를 수신하고, 상기 외부로 상기 입력 데이터에 대한 상기 인공 신경망의 연산 결과를 출력하는 입출력 유닛, 상기 입출력 유닛으로부터 상기 입력 데 이터를 수신하고, 상기 입력 데이터를 전달하는 제어 로직 유닛, 상기 제어 로직 유닛으로부터 상기 인공뉴런 구현 소자 어레이에 상기 입력 데이터를 전달하는 워드 라인 바이어스 유닛, 상기 인공뉴런 구현 소자 어레이로 부터 상기 입력 데이터에 대한 연산 결과를 검출하는 비트 라인 바이어스 및 검출 유닛을 더 포함한다. 예로서, 본 개시에 따른 뉴로모픽 프로세서는 상기 인공뉴런 구현 소자 어레이에 포함되는 복수의 인공뉴런 구 현 소자들의 연결 관계에 대한 정보를 저장하는 비휘발성 메모리, 상기 인공뉴런 구현 소자 어레이로부터 검출 된 상기 연산 결과를 저장하는 휘발성 메모리를 더 포함한다."}
{"patent_id": "10-2021-0069870", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시에 따른 간소화된 시그모이드 함수 회로 및 이를 포함하는 뉴로모픽 프로세서에 의하면, 실수 영역에서 연산이 이루어지는 시그모이드 함수를 로그 영역에서 처리함으로써 인공신경망의 연산량을 획기적으로 감소시킬 수 있다."}
{"patent_id": "10-2021-0069870", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서, 본 개시의 기술 분야에서 통상의 지식을 가진 자가 본 개시를 용이하게 실시할 수 있을 정도로, 본 개시의 실시 예들은 명확하고 상세하게 기재될 것이다. 본 명세서에서 사용된 용어는 실시 예들을 설명하기 위한 것이며, 본 개시를 제한하고자 하는 것은 아니다. 본 명세서에서 사용된 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함 한다(comprises) 및/또는 포함하는(comprising)\"은 언급된 구성요소, 단계, 동작 및/또는 소자에 하나 이상의 다른 구성요소, 단계, 동작 및/또는 소자의 존재 또는 추가를 배제하지 않는다. 본 명세서에서 사용되는 \"제 1 및/또는 제 2\" 등의 용어는 다양한 구성요소들을 설명하기 위하여 사용될 수 있 으나, 이는 하나의 구성요소를 다른 구성요소로부터 구별하기 위한 목적으로만 사용될 뿐, 해당 용어로 지칭되 는 구성요소를 한정하기 위한 것은 아니다. 예를 들어, 본 개시의 권리 범위를 벗어나지 않는 한, 제 1 구성요 소는 제 2 구성요소로 명명될 수 있으며, 제 2 구성요소 또한 제 1 구성요소로 명명될 수 있다. 다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자에게 공통적으로 이해될 수 잇는 의미로 사용될 수 있을 것이다. 또한, 일반적 으로 사용되는 사전에 정의되어 있는 용어들은 명백하게 특별히 정의되어 있지 않는 한 이상적으로 또는 과도하 게 해석되지 않는다. 본 명세서에서, 전문에 걸쳐 동일한 참조 부호는 동일한 구성 요소를 지칭할 수 있다. 도 1은 본 개시의 실시 예에 따른 인공신경망(Artificial Neural Network; ANN, 10)을 나타내는 도면이다. 도 1을 참조하면, 본 개시의 실시예에 따른 인공신경망은 입력층(Input Layer, IL), 은닉층(Hidden Layer, HL) 및 출력층(Output Layer, OL)을 포함할 수 있다. 입력층(IL), 은닉층(HL) 및 출력층(OL)은 시냅스(Synapse, SN)를 통하여 서로 연결될 수 있다. 인공신경망은 복수의 인공뉴런들을 포함할 수 있다. 복수의 인공뉴런들은 외부로부터 입력 데이 터(X1, X2, …, Xn)를 수신하는 복수의 입력 뉴런들, 복수의 입력 뉴런들로부터 데이터를 수신하고 이를 처리하 는 복수의 은닉 뉴런들 및 복수의 은닉 뉴런들로부터 데이터를 수신하고 출력 데이터(Y1, Y2, …, Ym)를 생성하 는 복수의 출력 뉴런들을 포함할 수 있다. 입력층(IL)은 복수의 입력 뉴런들을 포함할 수 있고, 은닉층(HL)은 복수의 은닉 뉴런들을 포함할 수 있으며, 출력층(OL)은 복수의 출력 뉴런들을 포함할 수 있다. 입력층(IL), 은닉층(HL) 및 출력층(OL) 각각에 포함된 인공 뉴런들의 개수는 도 1에 도시된 바에 한정되지 않는 다. 또한, 은닉층(HL)은 도 1에 도시된 것보다 더 많은 층(Layer)들을 포함할 수 있다. 은닉층(HL)의 개수는 인 공신경망의 정확도 및 학습 속도와 관련될 수 있다. 또한, 입력 데이터(X1, X2, …, Xn) 및 출력 데이터(Y1, Y2, …, Ym)는 텍스트, 이미지 등 다양한 형태의 데이터일 수 있다. 도 2는 본 개시의 실시 예에 따른 인공뉴런을 나타내는 도면이다. 도 2를 참조하면, 인공뉴런은 합산 회로(Summation Circuit, 110) 및 활성 함수 회로(Activation Function Circuit, 120)를 포함할 수 있다. 합산 회로는 가중치들(W1, W2, …, WK)을 이용하여 입력 신호들(A1, A2, …, AK)을 합산할 수 있다. 입력 신 호들(A1, A2, …, AK) 각각은 임의의 인공뉴런으로부터 생성된 출력 신호일 수 있다. 가중치들(W1, W2, …, WK) 각각은 시냅스(SN, 도 1 참조)의 강도, 다시 말하면 하나의 인공뉴런과 다른 하나의 인공뉴런과의 결합 정도를 나타낼 수 있다. 합산 회로는 가중치들(W1, W2, …, WK)과 입력 신호들(A1, A2, …, AK)을 각각 곱한 후, 그결과들을 합쳐서 합산 결과(B)를 도출할 수 있다. 합산 결과(B)는 수학식 1로 나타낼 수 있다. 수학식 1"}
{"patent_id": "10-2021-0069870", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "활성 함수 회로는 합산 결과(B) 및 활성 함수(Activation Function, f)를 이용하여 활성 결과(C)를 도출 할 수 있다. 본 개시의 실시 예에 따른 활성 함수(f)는 간소화된 시그모이드 함수일 수 있다. 시그모이드 함수 란, 선형인 멀티퍼셉트론에서 비선형 값을 도출하기 위하여 이용될 수 있으며, 예로서 로지스틱(Logistic) 함수 를 포함할 수 있다. 시그모이드 함수는 실수(Real Number) 영역에서 정의될 수 있으며, 수학식 2로 나타낼 수 있다. 수학식 2에서, sig(x)는 실수 영역의 시그모이드 함수를, x는 실수 변수를 의미한다. 수학식 2"}
{"patent_id": "10-2021-0069870", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "본 개시의 실시 예에서, 활성 함수(f)로 이용되는 간소화된 시그모이드 함수는 인공신경망의 연산량을 감소시키 기 위하여 로그 영역에서의 시그모이드 함수를 변분 변환한 형태일 수 있다. 즉, 본 개시의 실시 예에서 이용되 는 활성 함수(f)는 로그 영역의 시그모이드 함수를 도출하고, 도출된 로그 영역의 시그모이드 함수를 변분 변환 하는 과정을 통하여 도출될 수 있다. 로그 영역의 시그모이드 함수는 수학식 2에 제시된 실수 영역의 시그모이드 함수의 양 변에 자연로그를 취하여 유도할 수 있다. 로그 영역의 시그모이드 함수를 유도하는 과정은 수학식 3의 내지 과정으로 나타낼 수 있으며, 수학식 3에서 sig(x)는 실수 영역의 시그모이드 함수를, SIG(X)는 로그 영역의 시그모이드 함수를, x는 실수 변수를, X는 로그 영역의 변수를 의미한다. 이하, 표기의 명확화를 위하여 ex는 exp(x)의 형태로 표현한다. 수학식 3"}
{"patent_id": "10-2021-0069870", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "수학식 3으로부터 도출된 로그 영역의 시그모이드 함수는 인공신경망의 연산량을 줄이기 위하여 변분 변환될 수 있다. 로그 영역의 시그모이드 함수의 변분 변환은 실수 변수 x의 부호에 따라 달리 유도될 수 있다. 먼저, 실 수 변수 x가 양수인 경우 유도 과정은 수학식 4의 내지 과정으로 나타낼 수 있다. 수학식 4에서 F(x) 는 변분 변환을 통하여 도출되는 근사식을 의미하고, D(x)는 로그 영역의 시그모이드 함수 SIG(X)와 근사식의 차이를 의미한다. 또한, Y는 D(x)를 최소화한 함수를 의미한다.수학식 4"}
{"patent_id": "10-2021-0069870", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "실수 변수 x가 음수인 경우 로그 영역의 시그모이드 함수는 수학식 5와 같이 표현된다. 수학식 5에서, x는 음수 이므로 양수인 xp와 -1의 곱으로 표현할 수 있다. 수학식 5에서 sig(x)는 실수 영역에서의 시그모이드 함수를 의미하고, SIG(Xp)는 로그 영역의 시그모이드 함수를 의미한다. 수학식 5"}
{"patent_id": "10-2021-0069870", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "실수 변수 x가 음수인 경우, 유도 과정은 수학식 6의 내지 과정으로 나타낼 수 있다. 수학식 6에서 F(x)는 변분 변환을 통하여 도출되는 근사식을 의미하고, D(x)는 로그 영역의 시그모이드 함수 SIG(Xp)와 근사 식의 차이를 의미한다. 또한, Y는 D(xp)를 최소화한 함수를 의미한다.수학식 6"}
{"patent_id": "10-2021-0069870", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "수학식 4 및 수학식 6에서 도출된 근사식 F(X) 및 F(Xp)는 활성 함수 회로에서 활성 결과(C)를 도출하기 위한 활성 함수(f)로 이용될 수 있다. 도 3은 본 개시의 실시 예에 따른 간소화된 시그모이드 함수 회로를 나타내는 도면이다. 간소화된 시그모 이드 함수 회로는 활성 함수(f)를 구현하기 위한 회로로, 활성 함수 회로(120, 도 2 참조)에 포함될 수 있 다. 도 3을 참조하면, 간소화된 시그모이드 함수 회로는 제 1 회로, 제 2 회로 및 제 1 멀티플 렉서를 포함할 수 있다. 제 1 회로는 제 1 비교기, 제 2 멀티플렉서(212a), 제 3 멀티플렉서 (212b), 제1 곱셈기 및 제 1 합산기를 포함할 수 있다. 제 2 회로는 제 2 비교기, 제 4 멀티플렉서(222a), 제 5 멀티플렉서(222b), 제 2 곱셈기 및 제 2 합산기를 포함할 수 있다. 본 개시의 실시 예에 따르면, 간소화된 시그모이드 함수 회로를 통하여 활성 결과(F)(도 2에 개시된 활성 결과(C)에 대응)가 도출될 수 있다. 로그 도메인에서, 입력 는 벡터로, 방향인 부호 Xs와 크기 X로 표현될 수 있다. 간소화된 시그모이드 함수 회로는 입력된 의 방향 부호가 양(+)인 경우, 제 1 회로로부터의 출력 값이 활성 결과(F)로 도출될 수 있다. 입력된 의 방향 부호가 음(-)인 경우, 제 2 회로로부터의 출 력 값이 활성 결과(F)로 도출될 수 있다. 도 4는 본 개시의 실시 예에 따른 간소화된 시그모이드 함수 회로(200, 도 3 참조)가 적용된 뉴로모픽 프로세서 를 나타내는 도면이다. 도 4를 참조하면, 뉴로모픽 프로세서는 인공뉴런 구현 소자 어레이, 워드 라인 바이어스 유닛, 비트 라인 바이어스 및 검출 유닛, 제어 로직 유닛, 불휘발성 메 모리, 휘발성 메모리 및 입출력 유닛을 포함할 수 있다. 인공뉴런 구현 소자 어레이는 상술한 도 1에 개시된 인공신경망(10, 도 1 참조)을 하드웨어적으로 구현한 것일 수 있다. 인공뉴런 구현 소자 어레이는 복수의 인공뉴런(100, 도 1 참조)들을 구현한 소자들을 포함 할 수 있으며, 복수의 인공뉴런 구현 소자들이 행들 및 열들로 배열된 구조일 수 있다. 복수의 인공뉴런 구현 소자들 각각은 상술한 도 3에 개시된 간소화된 시그모이드 함수 회로(200, 도 3 참조)를 포함할 수 있다. 인공뉴런 구현 소자 어레이는 간소화된 시그모이드 함수에 기반한 결과치를 출력할 수 있다. 도 4 에서, 인공뉴런 구현 소자 어레이와 연결되는 워드 라인(WL) 및 비트 라인(BL)은 하나로 도시되었으나,이는 도면의 복잡도를 줄이기 위한 것일 뿐, 인공뉴런 구현 소자 어레이에 포함되는 복수의 인공뉴런 구현 소자들 각각에 연결되는 워드 라인(WL) 및 비트 라인(BL)을 의미한다. 워드 라인 바이어스 유닛은 제어 로직 유닛으로부터 입력 데이터를 수신하고, 워드 라인(WL)을 통 하여 인공뉴런 구현 소자 어레이에 포함되는 복수의 인공뉴런 구현 소자들 각각에 입력 데이터를 전 달할 수 있다. 또한, 워드 라인 바이어스 유닛은 인공뉴런 구현 소자 어레이에 포함되는 복수의 시 냅스(SN, 도 1 참조) 연결들에 가중치를 기록하기 위한 전류를 워드 라인(WL)을 통하여 공급할 수 있다. 비트 라인 바이어스 및 검출 유닛은 인공뉴런 구현 소자 어레이에 포함되는 복수의 인공뉴런 구현 소자들 각각에서 인공 신경망 연산을 수행할 때 비트 라인(BL)에 접지 전압을 바이어스할 수 있다. 또한, 비트 라인 바이어스 및 검출 유닛은 비트 라인(BL)을 통하여 전류량을 검출함으로써, 인공뉴런 구현 소자 어레이에 포함되는 복수의 인공뉴런 구현 소자들의 연산 결과를 획득할 수 있다. 제어 로직 유닛은 불휘발성 메모리에 저장된 정보를 읽고, 읽혀진 정보에 기반하여 워드 라인 바이 어스 유닛 및 비트 라인 바이어스 및 검출 유닛을 제어할 수 있다. 또한, 제어 로직 유닛은 입출력 유닛을 통하여 수신되는 초기 입력을 입력 데이터로서 워드 라인 바이어스 유닛에 전달하거 나 휘발성 메모리에 저장할 수 있다. 또한, 제어 로직 유닛은 인공뉴런 구현 소자 어레이로 부터 출력된 결과를 입력 데이터로서 워드 라인 바이어스 유닛에 전달하거나 휘발성 메모리에 저장 할 수 있다. 비휘발성 메모리는 인공뉴런 구현 소자 어레이에 포함된 복수의 인공뉴런 구현 소자들의 연결 관계에 대한 정보를 저장할 수 있다. 즉, 비휘발성 메모리는 뉴로모픽 프로세서에 의하여 구현되는 인공 신경망의 전체 구조에 대한 정보를 포함할 수 있다. 휘발성 메모리는 입출력 유닛으로부터 입력된 초기 입력 및 인공뉴런 구현 소자 어레이으로 부터 출력된 결과를 저장할 수 있다. 입출력 유닛은 외부로부터 초기 입력을 수신하여 제어 로직 유닛 에 전달하고, 제어 로직 유닛으로부터 인공뉴런 구현 소자 어레이로부터 출력된 결과를 전달 받아 외부로 출력할 수 있다. 상술된 내용은 본 개시를 실시하기 위한 구체적인 실시 예들이다. 본 개시는 상술된 실시 예들 뿐만 아니라, 단 순하게 설계 변경되거나 용이하게 변경할 수 있는 실시 예들 또한 포함할 것이다. 또한, 본 개시는 실시 예들을 이용하여 용이하게 변형하여 실시할 수 있는 기술들도 포함될 것이다. 따라서, 본 개시의 범위는 상술된 실시 예들에 국한되어 정해져서는 안되며, 후술하는 특허청구범위뿐만 아니라 본 개시의 특허청구범위와 균등한 것들 에 의해 정해져야 할 것이다."}
{"patent_id": "10-2021-0069870", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 실시 예에 따른 인공신경망을 나타내는 도면이다. 도 2는 본 개시의 실시 예에 따른 인공뉴런을 나타내는 도면이다. 도 3은 본 개시의 실시 예에 따른 간소화된 시그모이드 함수 회로를 나타내는 도면이다. 도 4는 본 개시의 실시 예에 따른 간소화된 시그모이드 함수 회로가 적용된 뉴로모픽 프로세서를 나타내는 도면 이다."}
