{"patent_id": "10-2023-0007500", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0115061", "출원번호": "10-2023-0007500", "발명의 명칭": "카메라를 이용한 말초혈관 협착증 판단 방법 및 장치", "출원인": "주식회사 딥메디", "발명자": "윤용훈"}}
{"patent_id": "10-2023-0007500", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "카메라를 이용한 말초혈관의 협착증 판단 방법에 있어서,상기 카메라를 이용하여 피검자의 신체를 촬영한 제1 영상을 획득하는 단계;상기 제1 영상으로부터 상기 피검자의 말초혈관에 상응하는 복수의 영역의 복수의 서브 영상을 획득하는 단계;상기 복수의 서브 영상 각각으로부터 복수의 맥파 신호를 추출하는 단계;상기 추출된 복수의 맥파 신호 각각의 크기를 비교하는 단계; 및상기 비교 결과를 기초로 상기 피검자의 협착증을 판단하는 단계를 포함하는, 카메라를 이용한 협착증 판단 방법."}
{"patent_id": "10-2023-0007500", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 복수의 서브 영상은,상기 피검자의 말초혈관에 상응하는 양팔 및 양다리를 포함하는 4개의 영역에 대한 영상이고,상기 4개의 영역에 상응하는 4개의 서브 영상으로부터 제1 내지 제4 맥파 신호를 추출하는 것을 특징으로 하는,카메라를 이용한 말초혈관 협착증 판단 방법."}
{"patent_id": "10-2023-0007500", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 제1 내지 제4 맥파 신호 중 가장 크기가 큰 맥파 신호를 기준으로 다른 맥파 신호와의 상관도(correlation)를 계산하고, 상기 상관도가 제1 임계값보다 작은 경우, 상기 말초혈관의 협착증이 존재하는 것으로 판단하는 것을 특징으로하는, 카메라를 이용한 말초혈관 협착증 판단 방법."}
{"patent_id": "10-2023-0007500", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 제1 내지 제4 맥파 신호의 각각의 기울기를 계산하고,상기 계산된 기울기가 제2 임계값보다 큰 경우, 상기 말초혈관의 협착증이 존재한다고 판단하는 것을 특징으로하는, 카메라를 이용한 말초혈관 협착증 판단 방법."}
{"patent_id": "10-2023-0007500", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 2 항에 있어서,상기 제1 내지 제4 맥파 신호 중 가장 크기가 큰 맥파 신호 대비 0.5 내지 0.9 인 경우, 상기 말초혈관의 협착증을 경증으로 판단하는 것을 특징으로 하는, 카메라를 이용한 말초혈관 협착증 판단 방법."}
{"patent_id": "10-2023-0007500", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서,상기 제1 내지 제4 맥파 신호 중 가장 크기가 큰 맥파 신호 대비 0.5 보다 작은 경우, 상기 말초혈관의 협착증을 중증으로 판단하는 것을 특징으로 하는, 카메라를 이용한 말초혈관 협착증 판단 방법. 공개특허 10-2024-0115061-3-청구항 7 제 2 항에 있어서,열화상 카메라를 이용하여 상기 4개의 영역에 대한 4개의 열화상 영상을 획득하는 단계; 및상기 획득된 4개의 열화상 영상의 기초로 각각의 영역의 피부 온도를 획득하는 단계를 더 포함하고,상기 판단 단계는,상기 비교 결과와, 상기 각각의 영역의 피부 온도를 기초로 상기 피검자의 협착증을 판단하는 것을 특징으로 하는, 카메라를 이용한 말초혈관 협착증 판단 방법."}
{"patent_id": "10-2023-0007500", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서,상기 판단 단계는,상기 각각의 영역의 피부 온도가 다른 영역과 비교하여 상대적으로 낮은 경우, 상기 말초혈관의 협착증이 존재하는 것으로 판단하는 것을 특징으로 하는, 카메라를 이용한 말초혈관 협착증 판단 방법."}
{"patent_id": "10-2023-0007500", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1 항에 있어서,상기 획득된 제1 영상은,녹색 파장 대역 필터를 통과한 영상인 것을 특징으로 하는, 카메라를 이용한 말초혈관 협착증 판단 방법."}
{"patent_id": "10-2023-0007500", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 1 항에 있어서,상기 복수의 맥파 신호는,CNN(Convolution Neural Network) 기반의 원격 PPG 모델로 학습된 신호인 것을 특징으로 하는, 카메라를 이용한 말초혈관 협착증 판단 방법."}
{"patent_id": "10-2023-0007500", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 1 항 내지 제 10 항 중 어느 한 항에 따른 방법을 컴퓨터에서 실행시키기 위한 프로그램을 기록한 기록매체."}
{"patent_id": "10-2023-0007500", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "피검자의 신체를 촬영하는 카메라; 및프로세서를 포함하고,상기 프로세서는,상기 카메라를 이용하여 피검자의 신체를 촬영한 제1 영상을 획득하고,상기 제1 영상으로부터 상기 피검자의 말초혈관에 상응하는 복수의 영역의 복수의 서브 영상을 획득하고,상기 복수의 서브 영상 각각으로부터 복수의 맥파 신호를 추출하고,상기 추출된 복수의 맥파 신호 각각의 크기를 비교하고, 상기 비교 결과를 기초로 상기 피검자의 협착증을 판단하는, 카메라를 이용한 협착증 판단 장치."}
{"patent_id": "10-2023-0007500", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 12 항에 있어서,상기 복수의 서브 영상은,공개특허 10-2024-0115061-4-상기 피검자의 말초혈관에 상응하는 양팔 및 양다리를 포함하는 4개의 영역에 대한 영상이고,상기 프로세서는,상기 4개의 영역에 상응하는 4개의 서브 영상으로부터 제1 내지 제4 맥파 신호를 추출하는 것을 특징으로 하는,카메라를 이용한 말초혈관 협착증 판단 장치."}
{"patent_id": "10-2023-0007500", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13 항에 있어서,상기 프로세서는,상기 제1 내지 제4 맥파 신호 중 가장 크기가 큰 맥파 신호를 기준으로 다른 맥파 신호와의 상관도(correlation)를 계산하고, 상기 상관도가 제1 임계값보다 작은 경우, 상기 말초혈관의 협착증이 존재하는 것으로 판단하는 것을 특징으로하는, 카메라를 이용한 말초혈관 협착증 판단 장치."}
{"patent_id": "10-2023-0007500", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 14 항에 있어서,상기 프로세서는,상기 제1 내지 제4 맥파 신호의 각각의 기울기를 계산하고,상기 계산된 기울기가 제2 임계값보다 큰 경우, 상기 말초혈관의 협착증이 존재한다고 판단하는 것을 특징으로하는, 카메라를 이용한 말초혈관 협착증 판단 장치."}
{"patent_id": "10-2023-0007500", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 13 항에 있어서,상기 프로세서는,상기 제1 내지 제4 맥파 신호 중 가장 크기가 큰 맥파 신호 대비 0.5 내지 0.9 인 경우, 상기 말초혈관의 협착증을 경증으로 판단하는 것을 특징으로 하는, 카메라를 이용한 말초혈관 협착증 판단 장치."}
{"patent_id": "10-2023-0007500", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 16 항에 있어서,상기 프로세서는,상기 제1 내지 제4 맥파 신호 중 가장 크기가 큰 맥파 신호 대비 0.5 보다 작은 경우, 상기 말초혈관의 협착증을 중증으로 판단하는 것을 특징으로 하는, 카메라를 이용한 말초혈관 협착증 판단 장치."}
{"patent_id": "10-2023-0007500", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 12 항에 있어서,상기 피검자의 신체를 촬영하는 열화상 카메라를 더 포함하고,상기 프로세서는,상기 열화상 카메라를 이용하여 상기 4개의 영역에 대한 4개의 열화상 영상을 획득하고,상기 획득된 4개의 열화상 영상의 기초로 각각의 영역의 피부 온도를 획득하고,상기 비교 결과와, 상기 각각의 영역의 피부 온도를 기초로 상기 피검자의 협착증을 판단하는 것을 특징으로 하는, 카메라를 이용한 말초혈관 협착증 판단 장치."}
{"patent_id": "10-2023-0007500", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "공개특허 10-2024-0115061-5-제 18 항에 있어서,상기 프로세서는,상기 각각의 영역의 피부 온도가 다른 영역과 비교하여 상대적으로 낮은 경우, 상기 말초혈관의 협착증이 존재하는 것으로 판단하는 것을 특징으로 하는, 카메라를 이용한 말초혈관 협착증 판단 장치."}
{"patent_id": "10-2023-0007500", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 12 항에 있어서,상기 획득된 제1 영상은,녹색 파장 대역 필터를 통과한 영상인 것을 특징으로 하는, 카메라를 이용한 말초혈관 협착증 판단 장치."}
{"patent_id": "10-2023-0007500", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제 12 항에 있어서,상기 복수의 맥파 신호는,CNN(Convolution Neural Network) 기반의 원격 PPG 모델로 학습된 신호인 것을 특징으로 하는, 카메라를 이용한 말초혈관 협착증 판단 장치."}
{"patent_id": "10-2023-0007500", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "일 측면에 따른 카메라를 이용한 말초혈관의 협착증 판단 방법에 있어서, 카메라를 이용하여 피검자의 신체를 촬 영한 제1 영상을 획득하는 단계, 제1 영상으로부터 피검자의 말초혈관에 상응하는 복수의 영역의 복수의 서브 영 상을 획득하는 단계, 복수의 서브 영상 각각으로부터 복수의 맥파 신호를 추출하는 단계, 추출된 복수의 맥파 신 호 각각의 크기를 비교하는 단계 및 비교 결과를 기초로 피검자의 협착증을 판단하는 단계를 포함한다."}
{"patent_id": "10-2023-0007500", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "개시된 실시 예들은 카메라를 이용한 말초혈관 협착증 판단 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2023-0007500", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "생체신호에는 건강상태를 알 수 있는 다양한 정보가 포함되어 있다. 따라서, 피검자의 생체신호를 측정하고, 측 정된 생체신호로부터 피검자의 현재 건강 상태를 알 수 있다. 한편, 말초혈관질환이란 동맥경화나 혈전 등에 의해서 하지 근육에 충분한 혈액이 공급되지 않아서 발생하는 질 환이다. 통상적인 동맥경화에 의한 혈관질환과 같이 혈액 내 지방이 침착되면서 혈관의 단면이 좁아지고 내경을 통해서 흘러가는 혈액의 양이 줄어들게 되어서 발생한다. 특히 당뇨병은 말초혈관질환 발생의 고위험 인자인데, 증상이 없는 40세 이상 당뇨인의 약 20%가 말초혈관질환을 가지고 있고, 증상이 있는 말초혈관질환 환자의 20% 가 당뇨인인 것으로 알려져 있다. 종래의 말초혈관질환의 진단은 양팔과 양발목에 커프를 둘러 맥파신호를 측정한 뒤 맥파의 크기를 이용하여 협 착증을 진단하였다. 하지만, 커프로 인해 측정시 센서에 구속되어 있어, 사용 및 측정이 불편한 문제점이 있었 다. [선행기술문헌 번호] 선행문헌 1: 한국 등록특허공보 제10-136680호 선행문헌 2: \"스마트폰의 CMOS 영상센서를 이용한 광용적맥파 측정방법 개발\" 한국산학기술학회논문지 제7권 제 6호, 2015"}
{"patent_id": "10-2023-0007500", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "실시 예들은 전술한 문제점을 해결하고자 창출된 것으로, 카메라를 이용한 말초혈관 협착증 판단 방법 및 장치 를 제공하는 데 있다. 또한, 상기 방법을 컴퓨터에서 실행시키기 위한 프로그램을 기록한 컴퓨터로 읽을 수 있 는 기록매체를 제공하는 데 있다. 해결하려는 기술적 과제는 상기된 바와 같은 기술적 과제들로 한정되지 않으 며, 또 다른 기술적 과제들이 존재할 수 있다."}
{"patent_id": "10-2023-0007500", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 측면에 따른 카메라를 이용한 말초혈관의 협착증 판단 방법에 있어서, 상기 카메라를 이용하여 피검자의 신 체를 촬영한 제1 영상을 획득하는 단계; 상기 제1 영상으로부터 상기 피검자의 말초혈관에 상응하는 복수의 영 역의 복수의 서브 영상을 획득하는 단계; 상기 복수의 서브 영상 각각으로부터 복수의 맥파 신호를 추출하는 단 계; 상기 추출된 복수의 맥파 신호 각각의 크기를 비교하는 단계; 및 상기 비교 결과를 기초로 상기 피검자의 협착증을 판단하는 단계를 포함한다. 상기 복수의 서브 영상은, 상기 피검자의 말초혈관에 상응하는 양팔 및 양다리를 포함하는 4개의 영역에 대한 영상이고, 상기 4개의 영역에 상응하는 4개의 서브 영상으로부터 제1 내지 제4 맥파 신호를 추출할 수 있다. 상기 방법은 상기 제1 내지 제4 맥파 신호 중 가장 크기가 큰 맥파 신호를 기준으로 다른 맥파 신호와의 상관도 (correlation)를 계산하고, 상기 상관도가 제1 임계값보다 작은 경우, 상기 말초혈관의 협착증이 존재하는 것으 로 판단할 수 있다. 상기 방법은 상기 제1 내지 제4 맥파 신호의 각각의 기울기를 계산하고, 상기 계산된 기울기가 제2 임계값보다 큰 경우, 상기 말초혈관의 협착증이 존재한다고 판단할 수 있다. 상기 방법은 상기 제1 내지 제4 맥파 신호 중 가장 크기가 큰 맥파 신호 대비 0.5 내지 0.9 인 경우, 상기 말초 혈관의 협착증을 경증으로 판단할 수 있다. 상기 방법은 상기 제1 내지 제4 맥파 신호 중 가장 크기가 큰 맥파 신호 대비 0.5 보다 작은 경우, 상기 말초혈 관의 협착증을 중증으로 판단할 수 있다. 상기 방법은 열화상 카메라를 이용하여 상기 4개의 영역에 대한 4개의 열화상 영상을 획득하는 단계; 및 상기 획득된 4개의 열화상 영상의 기초로 각각의 영역의 피부 온도를 획득하는 단계를 더 포함하고, 상기 판단 단계는, 상기 비교 결과와, 상기 각각의 영역의 피부 온도를 기초로 상기 피검자의 협착증을 판단할 수 있다. 상기 판단 단계는, 상기 각각의 영역의 피부 온도가 다른 영역과 비교하여 상대적으로 낮은 경우, 상기 말초혈 관의 협착증이 존재하는 것으로 판단할 수 있다. 상기 획득된 제1 영상은, 녹색 파장 대역 필터를 통과한 영상일 수 있다. 상기 복수의 맥파 신호는, CNN(Convolution Neural Network) 기반의 원격 PPG 모델로 학습된 신호일 수 있다. 다른 측면에 따른 카메라를 이용한 말초혈관의 협착증 판단 장치는 피검자의 신체를 촬영하는 카메라; 및 프로 세서를 포함하고, 상기 프로세서는, 상기 카메라를 이용하여 피검자의 신체를 촬영한 제1 영상을 획득하고, 상기 제1 영상으로부 터 상기 피검자의 말초혈관에 상응하는 복수의 영역의 복수의 서브 영상을 획득하고, 상기 복수의 서브 영상 각 각으로부터 복수의 맥파 신호를 추출하고, 상기 추출된 복수의 맥파 신호 각각의 크기를 비교하고, 상기 비교 결과를 기초로 상기 피검자의 협착증을 판단한다. 상기 복수의 서브 영상은, 상기 피검자의 말초혈관에 상응하는 양팔 및 양다리를 포함하는 4개의 영역에 대한 영상이고, 상기 프로세서는, 상기 4개의 영역에 상응하는 4개의 서브 영상으로부터 제1 내지 제4 맥파 신호를 추출할 수 있다. 상기 프로세서는, 상기 제1 내지 제4 맥파 신호 중 가장 크기가 큰 맥파 신호를 기준으로 다른 맥파 신호와의 상관도(correlation)를 계산하고, 상기 상관도가 제1 임계값보다 작은 경우, 상기 말초혈관의 협착증이 존재하 는 것으로 판단할 수 있다. 상기 프로세서는, 상기 제1 내지 제4 맥파 신호의 각각의 기울기를 계산하고, 상기 계산된 기울기가 제2 임계값 보다 큰 경우, 상기 말초혈관의 협착증이 존재한다고 판단할 수 있다. 상기 프로세서는, 상기 제1 내지 제4 맥파 신호 중 가장 크기가 큰 맥파 신호 대비 0.5 내지 0.9 인 경우, 상기 말초혈관의 협착증을 경증으로 판단할 수 있다. 상기 프로세서는, 상기 제1 내지 제4 맥파 신호 중 가장 크기가 큰 맥파 신호 대비 0.5 보다 작은 경우, 상기 말초혈관의 협착증을 중증으로 판단할 수 있다. 상기 장치는 상기 피검자의 신체를 촬영하는 열화상 카메라를 더 포함하고, 상기 프로세서는, 상기 열화상 카메라를 이용하여 상기 4개의 영역에 대한 4개의 열화상 영상을 획득하고, 상기 획득된 4개의 열화상 영상의 기초로 각각의 영역의 피부 온도를 획득하고, 상기 비교 결과와, 상기 각각의 영역 의 피부 온도를 기초로 상기 피검자의 협착증을 판단할 수 있다. 상기 프로세서는, 상기 각각의 영역의 피부 온도가 다른 영역과 비교하여 상대적으로 낮은 경우, 상기 말초혈관 의 협착증이 존재하는 것으로 판단할 수 있다. 상기 획득된 제1 영상은, 녹색 파장 대역 필터를 통과한 영상일 수 있다. 상기 복수의 맥파 신호는, CNN(Convolution Neural Network) 기반의 원격 PPG 모델로 학습된 신호일 수 있다. 또 다른 측면에 따른 카메라를 이용한 말초혈관 협착증 판단 방법을 컴퓨터에서 실행시키기 위한 프로그램을 기 록한 기록매체를 포함한다."}
{"patent_id": "10-2023-0007500", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "일 실시 예에 따른 카메라를 이용한 말초혈관 협착증 판단 방법 및 장치는, 피검자의 신체부위, 특히 양 팔목과 양 발목을 촬영한 영상들로부터 피검자의 말초혈관질환으로 인한 협착층을 정확하게 판단할 수 있기 때문에, 협 착증을 측정함에 있어서 별도의 도구(예를 들어, 거프 등)가 필요하지 않다."}
{"patent_id": "10-2023-0007500", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과들은 상술된 효과들로 제한되지 않으며, 본 발명의 기술적 특징들에 의하여 기대되는 잠정적인 효과들은 아래의 기재로부터 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0007500", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본 개시의 실시 예를 상세히 설명한다. 그러나 본 개시는 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시 예에 한정되지 않는다. 또한, 도면에서 본 개시를 명확하게 설명하기 위해서 설명과 관 계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 본 개시에서 사용되는 용어는, 본 개시에서 언급되는 기능을 고려하여 현재 사용되는 일반적인 용어로 기재되었 으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 다양한 다른 용어를 의미할 수 있다. 따라서 본 개시에서 사용되는 용어는 용어의 명칭만으로 해석되어서는 안되며, 용어가 가지는 의미와 본 개시의 전반에 걸친 내용을 토대로 해석되어야 한다. 또한, 본 개시에서 사용된 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것이며, 본 개시를 한정하려는 의도로 사용되는 것이 아니다. 단수의 표현은 문맥상 명백하게 단수를 뜻하지 않는 한, 복수의 의미를 포함한다. 또한, 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\"되어 있는 경우도 포함한다. 또한 어떤 부분이 어떤 구성 요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성 요소를 제외하는 것이 아니라 다른 구성 요소를 더 포함할 수 있는 것을 의미한다. 본 명세서, 특히, 특허 청구 범위에서 사용된 상기 및 이와 유사한 지시어는 단수 및 복수 모두를 지시하는 것 일 수 있다. 또한, 본 개시에 따른 방법을 설명하는 단계들의 순서를 명백하게 지정하는 기재가 없다면, 기재 된 단계들은 적당한 순서로 행해질 수 있다. 기재된 단계들의 기재 순서에 따라 본 개시가 한정되는 것은 아니 다. 본 명세서에서 다양한 곳에 등장하는 \"일부 실시 예에서\" 또는 \"일 실시 예에서\" 등의 어구는 반드시 모두 동일 한 실시 예를 가리키는 것은 아니다. 본 개시의 일부 실시 예는 기능적인 블록 구성들 및 다양한 처리 단계들로 나타내어질 수 있다. 이러한 기능 블 록들의 일부 또는 전부는, 특정 기능들을 실행하는 다양한 개수의 하드웨어 및/또는 소프트웨어 구성들로 구현 될 수 있다. 예를 들어, 본 개시의 기능 블록들은 하나 이상의 마이크로프로세서들에 의해 구현되거나, 소정의 기능을 위한 회로 구성들에 의해 구현될 수 있다. 또한, 예를 들어, 본 개시의 기능 블록들은 다양한 프로그래 밍 또는 스크립팅 언어로 구현될 수 있다. 기능 블록들은 하나 이상의 프로세서들에서 실행되는 알고리즘으로 구현될 수 있다. 또한, 본 개시는 전자적인 환경 설정, 신호 처리, 및/또는 데이터 처리 등을 위하여 종래 기 술을 채용할 수 있다. 매커니즘, 요소, 수단 및 구성 등과 같은 용어는 넓게 사용될 수 있으며, 기계적이고 물 리적인 구성들로서 한정되는 것은 아니다. 또한, 도면에 도시된 구성 요소들 간의 연결 선 또는 연결 부재들은 기능적인 연결 및/또는 물리적 또는 회로적 연결들을 예시적으로 나타낸 것일 뿐이다. 실제 장치에서는 대체 가능하거나 추가된 다양한 기능적인 연결, 물 리적인 연결, 또는 회로 연결들에 의해 구성 요소들 간의 연결이 나타내어질 수 있다. 실시 예에서, 말초혈관은 팔이나 다리처럼 심장과 다소 떨어져 있는 곳까지 산소가 들어 있는 혈액을 공급하는 혈관을 의미하고, 말초혈관질환은 심부정맥 혈전증, 하지 정맥류, 버거씨병, 대동맥류 등을 포함할 수 있다. 이하 첨부된 도면을 참고하여 본 실시 예들을 상세히 설명하기로 한다. 도 1은 일 실시예에 따른 말초혈관 협착증 판단 장치의 개략 도이다. 도 1을 참조하면, 말초혈관 협착증 판단 장치는 피검자의 신체 부위를 촬영하는 카메라와 프로세서 를 포함한다. 실시 예에 따른 협착증 판단 장치는 카메라를 이용하여 피검자의 신체를 촬영한 제1 영 상을 획득하고, 제1 영상으로부터 피검자의 말초혈관에 상응하는 복수의 영역의 복수의 서브 영상을 획득하고, 복수의 서브 영상 각각으로부터 복수의 맥파 신호를 추출한다. 협착증 판단 장치는 추출된 복수의 맥파 신호 각 각의 크기를 비교하여, 피검자의 협착증을 판단한다. 실시 예에 따른 말초혈관 협착증 판단 장치는 종래기술과 다르게, 카메라를 이요하여 무구속 방식으로 피검자의 신체부위, 예를 들면 양팔, 양다리를 촬영한 후 획득된 영상으로부터 맥파 신호를 추출하고, 이들의 파형을 분석함으로써 협착증을 판단한다. 카메라는 베드에 누운 피검자의 신체 부위를 촬영한다. 카메라는 일반적인 RGB 카메라일 수 있 다. 또한, 카메라의 피검자 사이의 거리는 카메라의 성능 내지 화각에 따라 양팔, 양다리를 모 두 촬영할 수 있는 촬영거리들 두고 설정될 수 있다. 실시 예에서, 카메라 또는 카메라의 이미지 센서는 녹색파장대역의 필터를 구비하여, 녹생파장의 영 상신호만을 추출하여, 맥파신호를 측정할 수도 있다. 프로세서는 카메라를 이용하여 피검자의 신체를 촬영한 제1 영상을 획득하고, 제1 영상으로부터 피검 자의 말초혈관에 상응하는 복수의 영역의 복수의 서브 영상을 획득한다. 여기서, 복수의 영역은 피검자의 양팔 및 양다리를 포함하는 4개의 영역일 수 있다. 프로세서는 복수의 서브 영상 각각으로부터 복수의 맥파 신호를 추출한다. 프로세서는 복수의 서브 영상인 RGB 영상신호로부터 복수의 맥파 신호를 추출할 수 있다. RGB 영상신호로부터 맥파신호를 추출하는 방법 은 다양한 종래기술을 이용할 수 있다. 예를 들면 RGB영상신호의 강도(intensity) 또는 HSI로 변환한 값으로부터 혈류 변화를 추출하고, 회귀분석 (Regression Analysis)을 통해 PPG신호 또는 맥파신호를 추출할 수 있다. 또한, RGB영상신호를 광류(Optical flow) 신호를 변환하여, PPG신호 또는 맥파신호를 추출할 수 있다. 프로세서는 복수의 서브 영상, 즉 RGB 형태의 영상신호들을 HSV 형태로 변환하고, V값을 1로 변경한 HSV 형태의 영상들을 다시 RGB형태로 역변환한다. 그리고, RGB 형태의 영상들에서 G채널 영상들만을 추출할 수 있다. 그리고, 추출된 G채널 영상들만을 다음 기계학습을 통해 학습시켜 PPG신호 모델 또는 맥파신호 모델을 생 성할 수도 있다. 실시 예에서, 프로세서는 미리 학습된 PPG신호 모델 또는 맥파신호 모델에 획득한 복수의 서브 영상 신호들, 또는 RGB 영상 신호들을 입력하여, 복수의 맥파 신호를 추출할 수도 있다. 또한, 프로세서는 RGB 영상들을 옵티컬 플로우 영상들을 변환하고, 매 프레임의 옵티컬 플로우 영상들로부 터 각각의 움직임 벡터를 추출하고, 움직임 벡터들로부터 혈류 속도를 추정하고, 추정된 혈류 속도에 관한 데이 터들을 추출할 수 있다. 그리고, 추출된 혈류 속도에 관한 데이터를 다음 기계학습을 통해 학습시켜, PPG 모델 을 생성할 수도 있다. 여기서, 기계 학습은 여러 데이터를 이용하여 학습한 내용을 기반으로 새로운 데이터에 대한 적절한 작업을 수행할 수 있도록 하는 알고리즘 또는 기술을 의미하며, 뉴럴 네트워크와 동일한 의미일 수 있다. 기계학습 또는 뉴럴 네트워크는, 인공지능(Artificial Intelligence)에 기초하여 뉴럴 네트워크에 입력된 소정의 이미지로부터 객체를 인식하는 방법을 학습하는 알고리즘의 집합일 수 있다. 예를 들어, 뉴럴 네트워크 는, 소정의 이미지를 입력 값으로 하는 지도 학습(supervised learning), 별다른 지도 없이 이미지로부터 객체 를 인식하기 위해 필요한 데이터의 종류를 스스로 학습함으로써, 이미지로부터 객체를 인식하기 위한 패턴을 발 견하는 비지도 학습(unsupervised learning)에 기초하여, 이미지로부터 객체를 인식하는 방법을 학습할 수 있다. 또한, 예를 들어, 뉴럴 네트워크는, 학습에 따라 객체를 인식한 결과가 올바른지에 대한 피드백을 이용하 는 강화 학습(reinforcement learning)을 이용하여, 이미지로부터 객체를 인식하는 방법을 학습할 수 있다. 또한, 뉴럴 네트워크는 인공 지능(AI) 기술에 따른 추론 및 예측을 위한 연산을 수행한다. 구체적으로, 뉴럴 네 트워크는 복수의 계층들을 통한 연산을 수행하는 딥 뉴럴 네트워크(DNN: Deep Neural Network)가 될 수 있다. 뉴럴 네트워크는 연산을 수행하는 내부의 계층(layer)의 개수에 따라서 계층의 개수가 복수일 경우, 즉 연산을 수행하는 뉴럴 네트워크의 심도(depth)가 증가하는 경우, 딥 뉴럴 네트워크(DNN)로 분류될 수 있다. 또한, 딥 뉴럴 네트워크(DNN) 연산은 컨볼루션 뉴럴 네트워크(CNN: Convolution Neural Network) 연산 등을 포함할 수 있다. 뉴럴 네트워크를 통하여 객체를 인식하기 위한 데이터 인식 모델을 구현하고, 구현된 데이터 인식 모델을 학습 데이터를 이용하여 학습시킬 수 있다. 그리고, 학습된 데이터 인식 모델을 이용하여 입력되는 데이터인 이 미지를 분석 또는 분류하여, 이미지 내에 포함되는 객체가 무엇인지를 분석 및 분류할 수 있다. 프로세서는 추출된 복수의 맥파 신호 각각의 크기를 비교하고, 비교 결과를 기초로 피검자의 협착증을 판 단한다. 프로세서는 복수의 맥파 신호 중 가장 크기가 큰 맥파 신호를 기준으로 다른 맥파 신호와의 상관 도(correlation)를 계산할 수 있다. 프로세서는 상관도가 가장 낮은 맥파 신호에 상응하는 신체부위의 말 초혈관이 협착증이 존재하는 것으로 판단할 수 있다. 또한, 프로세서는 복수의 맥파 신호의 기울기가 급격 히 변하는 맥파 신호에 상응하는 신체부위의 말초혈관이 협착증이 존재하는 것으로 판단할 수 있다. 또한, 프로 세서는 복수의 맥파 신호 중 가장 크기가 큰 신호 대비 일정 비율, 예를 들면 0.5 내지 0.9인 맥파 신호에 상응하는 부위의 말초혈관이 협착증이 존재하는 것으로 판단할 수 있다. 또한, 이 경우, 그 비율이 0.5 이하인 경우에는 협착증이 중증인 것으로 판단할 수 있다. 실시 예에서, 신체의 각 부위, 예를 들면 양손, 양발을 포함하는 4개 부위에 상응하는 맥파 신호들의 상관도, 기울기, 크기, 크기의 비율 등을 기초로, 협착증을 판단하는 것으로 설명하였지만, 이에 한정되지 않고, 협착증 이 존재함을 유추할 수 있는 다양한 정보들을 활용할 수 있음은 물론이다. 실시 예에서, 협착증의 판단과 관련하여, 비율의 수치범위를 예로서 설명하였지만, 이에 한정되지 않고, 피검자 의 건강정보, 예를 들면 나이, 성별, 혈압 등을 고려하여, 비율 또는 수치범위를 조절할 수 있음은 물론이다. 도 2는 도 1에 도시된 카메라로 피검자의 촬영부위를 촬영하여 맥파신호를 추출하는 예시 도이다. 도 2를 참조하면, 피검자의 촬영부위는 양손(101 및 102)과 양발(103 및 104)이다. 실시 예에서, 카메라 는 4곳의 촬영자의 신체부위를 동시에 촬영하고, 촬영된 영상에서 각각의 신체 부위에 상응하는 영역을 추 출하여, 각각의 영상을 획득할 수 있다. 또한, 선택적으로, 복수 개의 카메라로 각각의 신체 부위를 동시에 촬 영하여 4개의 촬영 영상으로부터 맥파신호를 추출할 수도 있다. 이때, 복수 개의 카메라의 촬영 시각을 정확하 게 동기화하여, 촬영할 수 있다. 도 3은 다른 실시 예에 따른 말초혈관 협착증 판단 장치의 개략 도이다. 도 3을 참조하면, 말초혈관 협착증 판단 장치는 카메라, 열화상카메라 및 프로세서를 포함 한다. 도 1과 비교하면, 열화상카메라를 더 포함하고 있다. 실시 예에 따른 말초혈관 협착증 판단 장치 는 협착증 판단에, 열화상카메라로 촬영된 신체 각 부위, 예를 들면 양손, 양발의 색온도를 더 고려하여, 협착증 판단의 오류를 줄일 수 있다. 예를 들면, 신체 부위의 말초혈관에서 협착이 발생한 경우, 해당 부위 의 피부 온도는 협착이 없는 부위보다 온도가 낮게 된다. 열화상카메라는 적외선 에너지 또는 열을 감지하여, 이를 실화상으로 변환해 주는 비접촉식 측정 기기를 의미한다. 열화상카메라는 적외선 에너지를 받아들이고 적외선 에너지의 데이터를 사용하여 디지털 또는 아날로그 영상 출력 기능을 통해 이미지를 만들어 출력한다. 열화상카메라는 섭씨 0.01도 정도의 작은 온 도 차이도 감지할 수 있을 만큼 민감하고 측정한 온도를 흑백 또는 원하는 색상 팔레트로서 출력할 수 있다. 실시 예에서, 열화상카메라는 신체의 각 부위, 예를 들면 카메라로 촬영되는 피검자의 부위에 해당하 는 부분을 촬영할 수 있고, 촬영된 부분에 대응하는 열화상(피부 온도) 정보를 디스플레이(미도시)에 출력할 수 있다. 또한, 프로세서는 열화상카메라로부터 수신된 열화상 정보를 피부 온도에 상응하는 수치로 변 환하여, 피부 온도, 예를 들면, 섭씨 36도, 섭씨 34.5도 등으로 표시할 수도 있다. 실시 예에서, 말초혈관 협착증 판단 장치는 카메라로 촬영된 신체의 각 부위의 RGB 영상 신호로부터 각 부위의 맥파 신호를 추출하고, 추출된 맥파 신호들 간의 상관도, 기울기, 크기 등을 고려하여, 각 부위의 협 착증을 판단한다. 또한, 맥파 신호 분석에 추가하여, 각 부위의 열화상 정보, 즉 각 부위의 피부 온도를 함게 고려하여, 협착증 판단의 정확도를 보다 높일 수 있다. 도 4는 도 3에 도시된 프로세서의 상세 개략 도이다. 도 4를 참조하면, 프로세서는 영상 획득부, 영역 추출부, 맥파신호 추출부, 맥파신호 비교 부, 피부온도 획득부 및 판단부를 포함할 수 있다. 여기서, 도시된 구성요소를 모두 포함하거나, 일부 구성요소는 제외하고 실시할 수 있음은 물론이다. 영상획득부는 카메라로부터 촬영된 피검자의 영상을 획득한다. 여기서, 피검자의 영상은 RGB 영상일 수 있다. 또한, G필터를 포함하는 경우, RGB 영상에서 G 영상 신호만 필터링된 영상일 수 있다. 영역 추출부는 피검자의 특정 신체 부위, 예를 들면 도 2에 도시된 바와 같이, 양손, 양발의 4개 부위의 영역을 추출할 수 있다. 맥파신호 추출부는 피검자의 추출된 영역에 대응하는 영상 신호에서 맥파 신호를 추출한다. 도 5a 및 도 5b에 도시된 것처럼, 팔목과 발목에서 각각 맥파 신호를 추출할 수 있다. 도 5c는 팔목과 발목에서 추출된 신호(101 내지 104)의 예시 도들이다. 맥파 신호 비교부는 도 5c에 도시된 것처럼, 4개의 맥파 신호들(101 내지 104)를 비교한다. 예시적으로, 각각의 신호의 상관도를 비교하여, 왼쪽 발목의 맥파 신호가 상관도가 가장 낮다고 판단할 수 있다. 따라 서, 오른족 발목 부위의 말초혈관에 협착증이 존재한다고 판정할 수 있다. 여기서, 각각의 맥파 신호의 상관도 를 가지고 판단하는 것으로 설명하였지만, 이에 한정되지 않고, 전술한 것처럼, 맥파 신호의 기울기, 크기, 맥 파 신호 간의 비율에 따라 협착증을 판단할 수 있음은 물론이다. 피부온도 획득부는 도 6에 도시된 것처럼, 열화상카메라로부터 피검자의 신체 부위(101 내지 104)의 열화상정보 또는 피부온도를 획득한다. 도 6에 도시된 것처럼, 왼쪽 발목의 피부온도가 다른 부위보다 상 대적으로 낮은 것을 알 수 있다. 판단부는 맥파 신호 비교부로부터 각각의 부위의 맥파신호를 비교한 비교 결과를 기초로 각각의 부위 의 말초혈관 협착층을 판단한다. 또한, 판단부는 피부온도 획득부로부터 획득된 각각의 부위의 피부 온도로부터 각각의 부위의 말초혈관 협착층을 판단할 수도 있다. 판단부는 도 5c에 도시된 각각의 부위의 맥파 신호들(101 내지 104), 또는 맥파 신호들을 비교한 결과와, 도 5d에 도시된 각각의 부위의 피부 온도(101 내지 104)를 기초로, 왼쪽 발목에 대응하는 부위가 말초혈관 협착증이 존재한다고 판단할 수 있다. 도 7은 또 다른 실시 예에 따른 카메라를 이용한 말초혈관 협착증 판단 방법을 설명하기 위한 흐름 도이다. 도 7을 참조하면, 단계 700에서, 카메라를 이용하여 피검자의 신체를 촬영한 제1 영상을 획득한다. 여기서, 제1 영상은 RGB 영상 또는 G필터로 필터링된 G 영상일 수 있다. 단계 702에서, 제1 영상으로부터 피검자의 말초혈관에 상응하는 복수의 영역의 복수의 서브 영상을 획득한다. 여기서, 복수의 영역은 피검자의 양팔, 양다리(또는 양발)일 수 있다.단계 704에서, 복수의 서브 영상 각각으로부터 복수의 맥파 신호를 추출한다. 영상 또는 서브 영상으로부터 맥 파 신호를 추출하는 다양한 방법을 이용할 수 있다. 단계 706에서, 추출된 복수의 맥파 신호 각각의 크기를 비교한다. 실시 예에서, 각 부위별 맥파 신호의 퀄리티 가 가장 높은 신호를 기준으로 상관도를 비교 분석할 수 있다. 또한, 각각의 맥파 신호의 피크치에서의 기울기 를 계산할 수도 있다. 따라서, 협착이 심할수록 신호의 퀄리티가 낮아지고, 기울기가 가파르게 되는 특성에 기 초하여, 협착을 판단할 수 잇다. 단계 708에서, 비교 결과를 기초로 피검자의 협착증을 판단한다. 일부 실시 예에 따른 협착증 판단 방법은 컴퓨터에 의해 실행되는 프로그램 모듈과 같은 컴퓨터에 의해 실행 가 능한 명령어를 포함하는 기록 매체의 형태로도 구현될 수 있다. 컴퓨터 판독 가능 매체는 컴퓨터에 의해 액세스 될 수 있는 임의의 가용 매체일 수 있고, 휘발성 및 비휘발성 매체, 분리형 및 비분리형 매체를 모두 포함한다. 또한, 컴퓨터 판독가능 매체는 컴퓨터 저장 매체 및 통신 매체를 모두 포함할 수 있다. 컴퓨터 저장 매체는 컴 퓨터 판독가능 명령어, 데이터 구조, 프로그램 모듈 또는 기타 데이터와 같은 정보의 저장을 위한 임의의 방법 또는 기술로 구현된 휘발성 및 비휘발성, 분리형 및 비분리형 매체를 모두 포함한다. 통신 매체는 전형적으로 컴퓨터 판독가능 명령어, 데이터 구조, 프로그램 모듈, 또는 반송파와 같은 변조된 데이터 신호의 기타 데이터, 또는 기타 전송 메커니즘을 포함하며, 임의의 정보 전달 매체를 포함한다. 또한, 본 명세서에서, 부는 프로세서 또는 회로와 같은 하드웨어 구성(hardware component), 및/또는 프로세서 와 같은 하드웨어 구성에 의해 실행되는 소프트웨어 구성(software component)일 수 있다."}
{"patent_id": "10-2023-0007500", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "전술한 본 발명의 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시 예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가 지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본 발명의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으 로 해석되어야 한다."}
{"patent_id": "10-2023-0007500", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 따른 말초혈관 협착증 판단 장치의 개략 도이다. 도 2는 도 1에 도시된 카메라로 피검자의 촬영부위를 촬영하여 맥파신호를 추출하는 예시 도이다. 도 3은 다른 실시 예에 따른 말초혈관 협착증 판단 장치의 개략 도이다. 도 4는 도 3에 도시된 프로세서의 상세 개략 도이다. 도 5a 내지 도 5c는 팔목과 발목에서 추출된 신호의 예시 도들이다. 도 6은 또 다른 실시 예에 따라, 팔목과 발목의 피부 온도를 측정하는 예시 도이다. 도 7은 또 다른 실시 예에 따른 카메라를 이용한 말초혈관 협착증 판단 방법을 설명하기 위한 흐름 도이다."}
