{"patent_id": "10-2021-0178416", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0089756", "출원번호": "10-2021-0178416", "발명의 명칭": "제조데이터 기반 현장수요형 조립공정 도제 지원 시스템", "출원인": "주식회사 디지포레", "발명자": "박성훈"}}
{"patent_id": "10-2021-0178416", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "도제 지원 장치에 의해 수행되는,제조 공정 관련 데이터를 수집하는 단계;상기 제조 공정 관련 데이터를 기반으로, 특정 제조 공정의 프로세스 및 상기 특정 제조 공정 내 포함된 적어도하나의 세부 공정을 파악하는 단계;상기 파악된 적어도 하나의 세부 공정의 공정별 특이사항을 도출하는 단계;상기 특정 제조 공정에 앱시스트를 반영하여 상기 제조 공정의 선순환 구조를 파악하는 단계; 및상기 도출된 세부 공정의 공정별 특이사항 및 상기 파악된 상기 제조 공정의 선순환 구조를 기반으로, 상기 특정 제조 공정의 노하우 전달을 위한 적어도 하나의 도제 지원 항목을 도출하는 단계를 포함하는,제조 공정 도제 지원 방법."}
{"patent_id": "10-2021-0178416", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,적어도 하나의 숙련자로부터 상기 적어도 하나의 도제 지원 항목에 대한 숙련자 작업 데이터를 수집하는 단계;상기 수집된 숙련자 작업 데이터를 기반으로, 적어도 하나의 세부 공정에 대한 기준 작업 데이터를 생성하는 단계; 및상기 기준 작업 데이터를 기반으로 상기 적어도 하나의 세부 공정에 대한 도제 지원을 위한 콘텐츠를 생성하는단계를 더 포함하는,제조 공정 도제 지원 방법."}
{"patent_id": "10-2021-0178416", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 도제 지원을 받기 위한 비숙련자가 착용한 숙련도 측정 장치로부터 상기 비숙련자의 공정 작업 데이터를수신하는 단계; 및상기 기준 작업 데이터를 기반으로 상기 비숙련자의 공정 작업 데이터를 평가하고, 상기 평가 결과를 상기 비숙련자에게 제공하는 단계를 더 포함하는,제조 공정 도제 지원 방법."}
{"patent_id": "10-2021-0178416", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제조 공정 관련 데이터를 수집하고, 상기 제조 공정 관련 데이터를 기반으로 특정 제조 공정의 프로세서 및 상기 특정 제조 공정 내 포함된 적어도 하나의 세부 공정을 파악하고, 상기 파악된 적어도 하나의 세부 공정의 공정별 특이사항을 도출하고, 상기 특정 제조 공정에 앱시스트를 반영하여 상기 제조 공정의 선순환 구조를 파악하고, 상기 도출된 세부 공정의 공정별 특이사항 및 상기 파악된 상기 제조 공정의 선순환 구조를 기반으로 상기 특정 제조 공정의 노하우 전달을 위한 적어도 하나의 도제 지원 항목을 도출하는 제조 공정 도제 지원 장치.공개특허 10-2023-0089756-3-청구항 5 하드웨어인 컴퓨터와 결합되어, 제1항의 방법을 실행시키기 위한 프로그램이 저장된 컴퓨터 판독 가능한 기록매체."}
{"patent_id": "10-2021-0178416", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 제조데이터 기반 현장수요형 조립공정 도제 지원 시스템에 관한 것으로, 제조업의 현장과 숙련자의 노 하우를 분석하고 이를 디지털라이제이션(Digitalization)함으로써, 제조업의 경쟁력을 유지, 향상시킬 수 있으며, 제조 앱시시트(APPsist)를 통해서 제조 현장의 숙련자들의 노하우를 저장하고, 이를 초보자들에게 전수 함으로써, 제조업의 경쟁령을 유지하는 것은 물론 향상시킬 수 있게 된다."}
{"patent_id": "10-2021-0178416", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 조립공정 도제 지원 시스템에 관한 것이다."}
{"patent_id": "10-2021-0178416", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "제조 경쟁력은 국가의 핵심 경쟁력 중에서 가장 중요한 경쟁력 중 하나이며, 사람과 사람을 통해서 오랜 시간 노하우가 전달된다는 점에서 제조 경쟁력을 유지하는 것은 매우 중요하며 또 어려운 일이다. 최근 들어, 제조 인력의 고령화와 인력난으로 인하여 이러한 제조업의 노하우 전달에 어려움이 생기고 있으며, 제조업 경쟁력 유지, 향상을 위해 다양한 방법이 시도되고 있으나 현재로서는 이를 뚜렷하게 해결할 수 있는 기 술적 방안이 마련되지 않고 있다."}
{"patent_id": "10-2021-0178416", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상술한 바와 같은 문제점을 해결하기 위한 본 발명은 제조업의 현장과 숙련자의 노하우를 분석하고 이를 디지털 라이제이션(Digitalization)함으로써, 제조업의 경쟁력을 유지, 향상시키고자 한다. 또한, 본 발명은 제조 앱시시트(APPsist)를 통해서 제조 현장의 숙련자들의 노하우를 저장하고, 이를 초보자들 에게 전수하고자 한다. 본 발명이 해결하고자 하는 과제들은 이상에서 언급된 과제로 제한되지 않으며, 언급되지 않은 또 다른 과제들 은 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0178416", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 과제를 해결하기 위한 본 발명의 일 실시예에 따른 제조 공정 도제 지원 방법은, 도제 지원 장치에 의해 수행되는, 제조 공정 관련 데이터를 수집하는 단계; 상기 제조 공정 관련 데이터를 기반으로, 특정 제조 공정의 프로세스 및 상기 특정 제조 공정 내 포함된 적어도 하나의 세부 공정을 파악하는 단계; 상기 파악된 적어도 하 나의 세부 공정의 공정별 특이사항을 도출하는 단계; 상기 특정 제조 공정에 앱시스트를 반영하여 상기 제조 공 정의 선순환 구조를 파악하는 단계; 및 상기 도출된 세부 공정의 공정별 특이사항 및 상기 파악된 상기 제조 공 정의 선순환 구조를 기반으로, 상기 특정 제조 공정의 노하우 전달을 위한 적어도 하나의 도제 지원 항목을 도 출하는 단계를 포함한다. 또한, 적어도 하나의 숙련자로부터 상기 적어도 하나의 도제 지원 항목에 대한 숙련자 작업 데이터를 수집하는 단계; 상기 수집된 숙련자 작업 데이터를 기반으로, 적어도 하나의 세부 공정에 대한 기준 작업 데이터를 생성 하는 단계; 및 상기 기준 작업 데이터를 기반으로 상기 적어도 하나의 세부 공정에 대한 도제 지원을 위한 콘텐 츠를 생성하는 단계를 더 포함할 수 있다. 또한, 상기 도제 지원을 받기 위한 비숙련자가 착용한 숙련도 측정 장치로부터 상기 비숙련자의 공정 작업 데이 터를 수신하는 단계; 및 상기 기준 작업 데이터를 기반으로 상기 비숙련자의 공정 작업 데이터를 평가하고, 상 기 평가 결과를 상기 비숙련자에게 제공하는 단계를 더 포함할 수 있다. 또한, 상술한 과제를 해결하기 위한 본 발명의 일 실시예에 따른 제조 공정 도제 지원 장치는, 제조 공정 관련 데이터를 수집하고, 상기 제조 공정 관련 데이터를 기반으로 특정 제조 공정의 프로세서 및 상기 특정 제조 공 정 내 포함된 적어도 하나의 세부 공정을 파악하고, 상기 파악된 적어도 하나의 세부 공정의 공정별 특이사항을 도출하고, 상기 특정 제조 공정에 앱시스트를 반영하여 상기 제조 공정의 선순환 구조를 파악하고, 상기 도출된 세부 공정의 공정별 특이사항 및 상기 파악된 상기 제조 공정의 선순환 구조를 기반으로 상기 특정 제조 공정의노하우 전달을 위한 적어도 하나의 도제 지원 항목을 도출할 수 있다. 이 외에도, 본 발명을 구현하기 위한 다른 방법, 다른 시스템 및 상기 방법을 실행하기 위한 컴퓨터 프로그램을 기록하는 컴퓨터 판독 가능한 기록 매체가 더 제공될 수 있다."}
{"patent_id": "10-2021-0178416", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기와 같은 본 발명에 따르면, 제조업의 현장과 숙련자의 노하우를 분석하고 이를 디지털라이제이션 (Digitalization)함으로써, 제조업의 경쟁력을 유지, 향상시킬 수 있다. 또한, 본 발명에 따르면, 제조 앱시시트(APPsist)를 통해서 제조 현장의 숙련자들의 노하우를 저장하고, 이를 초보자들에게 전수함으로써, 제조업의 경쟁령을 유지하는 것은 물론 향상시킬 수 있게 된다."}
{"patent_id": "10-2021-0178416", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과들은 이상에서 언급된 효과로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재로 부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0178416", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나, 본 발명은 이하에서 개시되는 실시예들에 제한되는 것이 아니라 서 로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하고, 본 발명이 속하는 기술 분야의 통상의 기술자에게 본 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 본 명세서에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명 세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함한다 (comprises)\" 및/또는 \"포함하는(comprising)\"은 언급된 구성요소 외에 하나 이상의 다른 구성요소의 존재 또는 추가를 배제하지 않는다. 명세서 전체에 걸쳐 동일한 도면 부호는 동일한 구성 요소를 지칭하며, \"및/또는\"은 언급된 구성요소들의 각각 및 하나 이상의 모든 조합을 포함한다. 비록 \"제1\", \"제2\" 등이 다양한 구성요소들을 서술하기 위해서 사용되나, 이들 구성요소들은 이들 용어에 의해 제한되지 않음은 물론이다. 이들 용어들은 단 지 하나의 구성요소를 다른 구성요소와 구별하기 위하여 사용하는 것이다. 따라서, 이하에서 언급되는 제1 구성 요소는 본 발명의 기술적 사상 내에서 제2 구성요소일 수도 있음은 물론이다. 다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본 발명이 속하는 기술 분야의 통상의 기술자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것이다. 또한, 일반적으로 사용되 는 사전에 정의되어 있는 용어들은 명백하게 특별히 정의되어 있지 않는 한 이상적으로 또는 과도하게 해석되지 않는다. 이하, 첨부된 도면을 참조하여 본 발명의 실시예를 상세하게 설명한다. 도 1은 본 발명의 실시예에 따른 도제 지원 장치의 블록도이다. 도 2는 본 발명의 실시예에 따른 도제 지원 방법의 흐름도이다. 도 3은 본 발명의 실시예에 따른 도제 지원 시스템의 개략도이다. 도 4는 제조 공정의 숙련자와 비숙련자로부터 공정 수행 데이터를 수집하는 것을 예시한 도면이다. 도 5는 도 4와 같이 수집된 데이터를 이벤트에 따라 처리하고, 작업의 숙련도에 따라 분리하여 분석을 시행하는 것을 예시한 도면이다. 도 6은 특정 제조 공정 내 포함된 세부 공정들을 파악하고, 파악된 세부 공정들을 모듈화하여 제조 공정 도제 지원 방법을 지원하는 것을 예시한 도면이다. 도 7은 제조 공정에 앱시스트 도입에 따른 인과순환지도를 통한 선순환 구조를 예시한 도면이다. 도 8은 특정 제조 공정에 포함된 세부 공정 항목을 도출한 것을 예시한 도면이다. 도 9는 작업자로부터 제조 공정에 대한 작업 데이터를 수집하는 방법을 예시한 도면이다. 도 1을 참조하면, 본 발명의 실시예에 따른 제조 공정 도제 지원 장치는 프로세서, 통신부, 메모리, 입출력부를 포함한다. 프로세서는 적어도 하나의 코어를 포함하며 도제 지원 장치 내 구성들의 제어를 담당하고, 메모리에 저장된 명 령어, 알고리즘, 인공지능 모델을 이용하여 각 구성들을 제어할 수 있다. 통신부는 숙련자의 제조 공정 노하우를 측정하기 위해 숙련자가 착용하였거나 숙련자를 촬영/측정하는 각종 기 기들(예: 카메라, VR, AR, XR, MR 기기 등)로부터 각종 데이터를 수신할 수 있으며, 또한 제작된 제조 공정 도 제 지원 콘텐츠를 미숙련자의 단말, 기기로 제공할 수 있다. 메모리는 제조 공정 도제 지원 방법을 실행하기 위한 각종 명령어, 알고리즘, 인공지능 모델 등이 저장되어 있 으며, 숙련자로부터 수신된 제조 공정 숙련 데이터가 저장될 수 있다. 도제 지원 장치가 제조 공정 관련 데이터를 수집한다. (S110) 도제 지원 장치가 제조 공정 내 포함된 적어도 하나의 세부 공정을 파악한다. (S130) 도제 지원 장치가 세부 공정의 공정별 특이사항을 도출한다. (S150) 도제 지원 장치가 제조 공정의 선순환 구조를 파악한다. (S170) 도제 지원 장치가 제조 공정의 노하우 전달을 위한 적어도 하나의 도제 지원 항목을 도출한다. (S190) 제조 앱시스트(APPsist)란 도제(Apprentice)와 지원(Assist)의 합성어로, 스마트 생산을 위한 지식기반 도제 지 원 시스템을 의미한다. 제조 앱시스트의 목적은 제조 현장의 숙련된 기술자의 노하우를 저장, 전수, 활용하기 위한 것이다. 본 발명의 실시예에 따른 제조 공정 도제 지원 장치는 기업의 생산 공정, 제조 숙련자(장인)의 노하우를 VR, AR, MR 등의 현장 실감형 시각화 기술을 활용하여 측정, 계측, 수집하여 데이터베이스(DB)화 한다. 또한, 본 발명의 실시예에 따른 제조 공정 도제 지원 장치는 수집된 노하우 제조 데이터(공정 데이터, AR, VR, MR 기반 환경 데이터)를 활용하여 AI 시뮬레이션 및 분석 활용을 진행한다. 전술한 실시예에서, AR, VR, MR이 언급되었지만, 3개의 가상현실 기술로 한정되는 것은 아니며 이외에도 제조 공정의 도제 지원 방법에 적합한 기술이라면 무엇이든 적용될 수 있다. 따라서, 본 발명의 실시예에 따른 제조 공정 도제 지원 장치는 제조 앱시스트를 증강현실 기술을 디자털화의 요 소기술로 활용하고, 빅데이터, AI 분석을 이와 결합하여 미숙련 작업자가 유연하게 제조 노하우 기술을 전수받 을 수 있게 된다. 본 발명의 실시예에 따른 도제 지원 장치는 숙련자의 신체에 착용된 적어도 하나의 측정 장치(예: 장갑 등)를 통해서 숙련자의 제조 동작 데이터를 수집할 수 있다. 또한, 도제 지원 장치는 숙련자의 작업을 카메라/라이다를 통해서 촬영함으로써 숙련자의 제조 동작 데이터를 수집할 수 있다. 일 실시예로, 도제 지원 장치는 제조 공정 관련 데이터를 분석하여, 해당 제조 공정에서 노하우 전수가 필요한 적어도 하나의 도제 지원 항목을 도출할 수 있다. 이는, 본 발명이 제조 공정과 관련하여 노하우를 전수하기 위한 것이지만, 모든 제조 공정 항목에 대해서 노하 우 전수가 필요한 것은 아닐 수 있기 때문에 노하우 전수가 꼭 필요한 항목을 도출하는 것을 의미한다. 대표적인 예로, 본 발명의 실시예에 따른 제조 공정 도제 지원 장치는 로봇 생산에 활용되는 서보 모터 조립 노 하우에 대한 도제 지원을 제공할 수 있다. 또한, 서보 모터 조립 노하우를 위해서는 미세한 모터부품 조립에 대한 고도화, 정밀화된 VR, AR 등의 콘텐츠 개발이 필요하고, 어시스트 솔루션 개발이 필요하므로, 서보 모터 조립 노하우를 위한 도제 지원 방법이 성공적 으로 진행되는 경우 다른 필드의 제조 공정에도 유연하게 적용이 가능할 것으로 기대된다. 상세하게는, 서보 모티 조립의 제조 공정(Assembly Process)는 두 개 이사으이 부품 혹은 조립군들 간의 결합으 로 정의될 수 있으며, 조립은 볼팅, 용접, 납땜, 압착, 접착 등 두 개 이상의 부품이 하나의 조립군이 되도록 해주는 조립 주 기능(Main function)과 놓임, 취급, 삽입, 체결, 상해 등 조립의 주 기능 수행을 위해 부가적으 로 필요한 조립 부 기능(Sub-Function)으로 구분될 수 있다. 조립 공정(Assembly Process)은 두 개 이상의 부품 혹은 조립군들 간의 결합으로 정의할 수 있다. 조립은 볼팅, 용접, 납땜, 압착, 접착 등 두 개 이상의 부품이 하나의 조립군이 되도록 해주는 조립 주 기능 (Main function)과 놓임, 취급, 삽입, 체결, 상해 등 조립의 주 기능 수행을 위해 부가적으로 필요한 조립 부 기능(Sub-Function)으로 구분할 수 있다. 제품의 조립 시스템은 부품이나 부품군의 조립대상, 조립 공정, 조립 수행체의 세 가지 측면이 서로 유기적인 관계에 의해 구성되어진다. 조립대상은 실제 조립에 사용되어지는 부품이나 조립군을 의미하며, 조립 공정은 부품이나 조립군을 최종 제품 으로 완성하기 위하여 행해지는 제반 활동을 뜻하고, 조립 수행체는 조립 공정을 수행하는 작업자, 기계, 로봇 을 의미한다. 표 1 표 2"}
{"patent_id": "10-2021-0178416", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "서보모터의 조립 공정은 표 1 및 표 2와 같은 세부 공정들로 구성될 수 있으며, 제조 공정 도제 지원 장치는 각 공정의 숙련자의 공정 동작 데이터, 정규 공정 동작을 위한 기본 정보(예: 세팅값, 납땜 온도 등), 주로 발생하 는 불량 종류, 불량 종류별 요인, 불량이 발생할 경우 처리 방법 등을 DB에 저장할 수 있다. 또한, 제조 공정 도제 지원 장치는 DB에 저장된 데이터들을 기반으로, 도제 지원 콘텐츠를 제작할 수 있다. 시스템다이내믹스 접근법은 복잡한 시스템에 대해 학습하고자 할 때 매우 유용하게 사용할 수 있는 방법론이다. 주어진 문제 또는 예상되는 문제에 대하여 그와 직·간접적으로 관련된 변수들로 구성된 시스템을 정의하고, 변 수들간의 관계를 정량적으로 연구하여 컴퓨터 모형화한 후, 일련의 시뮬레이션을 통해 시스템의 동태적 특성을 밝혀 문제를 해결하는 방식이다. 시스템 다이내믹스의 근간이 되는 시스템 사고에서는 세상을 단위 요소들이 서로 연결되어 있는 복잡한 시스템 으로 본다. 따라서, 시스템 다이내믹스를 이용하면 단순한 정태적 복잡성 뿐 아니라 더 나아가 시간에 대해 고려하며 동태 적 복잡성을 분석할 수 있다. 또한, 시스템다이내믹스는 시스템 사고를 통해 행위자의 상호작용에 대하여 다양한 순환구조의 모형화가 가능하 며 인과구조를 통해 반응과 적용을 표현할 수 있다. 이러한 점을 통해서, 본 발명의 실시예에 따른 제조 공정 도제 지원 장치는 시스템 다이내믹스 방법론을 적용한 앱시스트 적용 효과 모델을 구축하여 제조 공정 관련 변수들의 근본적 구조와 변화를 파악함으로써, 제조 공정 의 앱시스트 도입과 제조 기업 성장 간의 인과순화지도(Causal Loop Diagram)를 확인하여 효과적인 사업 전략 이행에 도움을 줄 수 있다.표 3"}
{"patent_id": "10-2021-0178416", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "인과순환지도란, 변수 간의 관계를 고려하여 전체 시스템을 표현해 주는 그림이다. 도 7과 같이, 인과순환지도를 그린다는 것은 어떤 문제의 원인을 관리, 해결하고자 할 때 문제의 표면적인 현상 뿐만 아니라 문제가 발생하는 비가시적인 잠재원인을 시각화함으로써 복잡하게 엮여있는 전체 시스템을 이해할 수 있다. 상세하게는, 앱시스트 적용 현장교육은 공정숙련도에 긍정적인 영향을 미친다. 공정숙련도가 증가하면 조립공정 (납땜, 부품결합, 스크류 조립공정) 정확도를 상승시키고 작업자 피로도는 감소하게된다. 불량률이 감소하면 품질이 상승하고 이에 따라 생산성이 향상된다. 또한 불량률이 감소하면 폐기 부품수가 감소하고 이에 따라 비용이 절감되는 요인으로 작용할 수 있다. 본 발명의 실시예에 따른 제조 공정 도제 지원 장치는 상술한 바와 같이 시스템 다이내믹스를 이용하고, 인과순 환지도를 분석하여 변수 간의 관계를 고려함으로써, 각각의 제조 공정이 전체 공정에 미치는 영향과 공정 이외 고객 만족과 같은 다양한 부분에 미치는 영향까지 분석할 수 있게 된다. 그리고, 제조 공정 도제 장치는 미숙련자에게 노하우를 전달할 때, 이러한 점을 활용하여 숙련자의 도제 지원 데이터를 가공함으로써, 도제 지원 항목의 효과적인 도출이 가능함은 물론 도제 지원 콘텐츠의 효과적인 제작에 활용할 수 있게 된다. 또한, 본 발명의 실시예에 따른 제조 공정 도제 지원 장치는 인과순환지도의 공정 흐름에 기반하여 각 개별 프 로세스에 대한 AHP 분석을 수행한 후 중요도를 측정/산출할 수 있으며, 인과순환지도에 명시된 항목이 아닌 공 정에 영향을 주는 세부 요인들을 반영하여 변수 선정 시에 더욱 심층적인 분석을 통한 구성 요소들 간의 관계를 더욱 명확하게 파악할 수 있게 된다. 따라서, 본 발명의 실시예에 따른 제조 공정 도제 지원 장치는 단순하게 미숙련자에게 제조 공정의 숙련 노하우 를 전달하는 것 이외에도, 작업 정확도 상승, 불량률 감소, 재작업시간 감소, 작업자 피로도 감소가 반복/강화 되어 작업시간, 검사시간, 폐기 부품 수 감소 및 품질 향상으로 인해 생산성 향상, 매출 증가, 고용 창출로 이 어지는 효과를 발휘할 수 있게 된다. 일 실시예로, 제조 공정 도제 지원 장치는 AHP(Analytic Hierarchy Process) 분석을 이용하여 각 문항간의 쌍대 비교를 통해 평가 항목들의 중요도를 계층구조별로 파악할 수 있으며, 전문가(숙련자)의 노하우에 의한 경험을 계량화된 분석결과로 도출할 수 있게 된다.AHP(Analytic Hierarchy Process)란 계층분석과정 또는 계층분석방법으로 잘 알려져 있으며 1976년 펜실베니아 대학의 Thomas Satty에 의해 제안된 기법으로 복잡한 평가기준을 계층화하여 단계별 요소들에 대한 쌍대비교 (Pairwise comparison)를 통해 상대적 다수 대안에 대한 다면적 평가기준을 통한 의사결정 지원방법 중 하나로 서 경제, 경영, 국방, 정치 등 여러 분야에 적용이 가능한 기법이다. 본 발명의 실시예에 따른 제조 공정 도제 지원 장치가 이러한 AHP 기법을 활용하기 위해서 도 8과 같이 제조 공 정을 적어도 하나의 대분류로 분류하고, 각각의 대분류에 대하여 다시 적어도 하나의 세부항목을 분류한 후 공 정 수행 데이터를 수집하게 된다. 그리고, 제조 공정 도제 지원 장치는 전문가(숙련자)로부터 설문지 작성을 요청하여, 각각의 제조 공정에 대한 중요도, 우선순위를 입력받아 이를 활용할 수 있다. 또한, 본 발명의 실시예에 따른 제조 공정 도제 지원 장치는 도 9와 같이 디바이스 종류에 따라 숙련공(전문가, 숙련자), 비숙련공(비전문가, 비숙련자)로부터 취득하는 데이터 유형을 분류할 수 있으며, 작업 데이터 목록에 따라 데이터 수집 방법이 기 설정되어 있을 수 있다. 일 실시예로, 본 발명의 실시예에 따른 제조 공정 도제 지원 방법은, 적어도 하나의 숙련자로부터 상기 적어도 하나의 도제 지원 항목에 대한 숙련자 작업 데이터를 수집하는 단계, 상기 수집된 숙련자 작업 데이터를 기반으 로, 적어도 하나의 세부 공정에 대한 기준 작업 데이터를 생성하는 단계 및 상기 기준 작업 데이터를 기반으로 상기 적어도 하나의 세부 공정에 대한 도제 지원을 위한 콘텐츠를 생성하는 단계를 더 포함할 수 있다. 일 실시예로, 본 발명의 실시예에 따른 제조 공정 도제 지원 방법은, 상기 도제 지원을 받기 위한 비숙련자가 착용한 숙련도 측정 장치로부터 상기 비숙련자의 공정 작업 데이터를 수신하는 단계 및 상기 기준 작업 데이터 를 기반으로 상기 비숙련자의 공정 작업 데이터를 평가하고, 상기 평가 결과를 상기 비숙련자에게 제공하는 단 계를 더 포함할 수 있다. 이러한 구성을 통해서, 본 발명의 실시예에 따른 제조 공정 도제 지원 장치는 숙련자로부터 각종 제조 공정 숙 련 데이터를 수집하여 이를 관리하는 것은 물론, 이를 이용하여 미숙련자의 제조 공정 숙련을 위한 콘텐츠를 제 작할 수 있다. 또한, 본 발명의 실시예에 따른 제조 공정 도제 지원 장치는 이와 같이 제작된 제조 공정 숙련을 위한 콘텐츠를 영상, 이미지, 음성 등으로 미숙련자에게 제공할 수 있는 것은 물론, VR, AR, XR, MR 등의 기기를 활용하여 실 감도를 높일 수 있는 콘텐츠를 직접적으로 제공함으로써, 미숙련자에게 보다 효과적으로 제조 공정 노하우를 전 달할 수 있게 된다. 이상에서 전술한 본 발명의 일 실시예에 따른 방법은, 하드웨어인 서버와 결합되어 실행되기 위해 프로그램(또 는 어플리케이션)으로 구현되어 매체에 저장될 수 있다. 상기 전술한 프로그램은, 상기 컴퓨터가 프로그램을 읽어 들여 프로그램으로 구현된 상기 방법들을 실행시키기 위하여, 상기 컴퓨터의 프로세서(CPU)가 상기 컴퓨터의 장치 인터페이스를 통해 읽힐 수 있는 C, C++, JAVA, 기 계어 등의 컴퓨터 언어로 코드화된 코드(Code)를 포함할 수 있다. 이러한 코드는 상기 방법들을 실행하는 필요 한 기능들을 정의한 함수 등과 관련된 기능적인 코드(Functional Code)를 포함할 수 있고, 상기 기능들을 상기 컴퓨터의 프로세서가 소정의 절차대로 실행시키는데 필요한 실행 절차 관련 제어 코드를 포함할 수 있다. 또한, 이러한 코드는 상기 기능들을 상기 컴퓨터의 프로세서가 실행시키는데 필요한 추가 정보나 미디어가 상기 컴퓨 터의 내부 또는 외부 메모리의 어느 위치(주소 번지)에서 참조되어야 하는지에 대한 메모리 참조관련 코드를 더 포함할 수 있다. 또한, 상기 컴퓨터의 프로세서가 상기 기능들을 실행시키기 위하여 원격(Remote)에 있는 어떠 한 다른 컴퓨터나 서버 등과 통신이 필요한 경우, 코드는 상기 컴퓨터의 통신 모듈을 이용하여 원격에 있는 어 떠한 다른 컴퓨터나 서버 등과 어떻게 통신해야 하는지, 통신 시 어떠한 정보나 미디어를 송수신해야 하는지 등 에 대한 통신 관련 코드를 더 포함할 수 있다. 상기 저장되는 매체는, 레지스터, 캐쉬, 메모리 등과 같이 짧은 순간 동안 데이터를 저장하는 매체가 아니라 반 영구적으로 데이터를 저장하며, 기기에 의해 판독(reading)이 가능한 매체를 의미한다. 구체적으로는, 상기 저 장되는 매체의 예로는 ROM, RAM, CD-ROM, 자기 테이프, 플로피디스크, 광 데이터 저장장치 등이 있지만, 이에 제한되지 않는다. 즉, 상기 프로그램은 상기 컴퓨터가 접속할 수 있는 다양한 서버 상의 다양한 기록매체 또는 사용자의 상기 컴퓨터상의 다양한 기록매체에 저장될 수 있다. 또한, 상기 매체는 네트워크로 연결된 컴퓨터 시스템에 분산되어, 분산방식으로 컴퓨터가 읽을 수 있는 코드가 저장될 수 있다. 본 발명의 실시예와 관련하여 설명된 방법 또는 알고리즘의 단계들은 하드웨어로 직접 구현되거나, 하드웨어에 의해 실행되는 소프트웨어 모듈로 구현되거나, 또는 이들의 결합에 의해 구현될 수 있다. 소프트웨어 모듈은 RAM(Random Access Memory), ROM(Read Only Memory), EPROM(Erasable Programmable ROM), EEPROM(Electrically Erasable Programmable ROM), 플래시 메모리(Flash Memory), 하드 디스크, 착탈형 디스크, CD-ROM, 또는 본 발명이 속하는 기술 분야에서 잘 알려진 임의의 형태의 컴퓨터 판독가능 기록매체에 상주할 수도 있다."}
{"patent_id": "10-2021-0178416", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "이상, 첨부된 도면을 참조로 하여 본 발명의 실시예를 설명하였지만, 본 발명이 속하는 기술분야의 통상의 기술 자는 본 발명이 그 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 실시될 수 있다는 것을 이해할 수 있을 것이다. 그러므로, 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며, 제한적이 아닌 것으로 이해해야만 한다."}
{"patent_id": "10-2021-0178416", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 도제 지원 장치의 블록도이다. 도 2는 본 발명의 실시예에 따른 도제 지원 방법의 흐름도이다. 도 3은 본 발명의 실시예에 따른 도제 지원 시스템의 개략도이다. 도 4는 제조 공정의 숙련자와 비숙련자로부터 공정 수행 데이터를 수집하는 것을 예시한 도면이다. 도 5는 도 4와 같이 수집된 데이터를 이벤트에 따라 처리하고, 작업의 숙련도에 따라 분리하여 분석을 시행하는 것을 예시한 도면이다. 도 6은 특정 제조 공정 내 포함된 세부 공정들을 파악하고, 파악된 세부 공정들을 모듈화하여 제조 공정 도제 지원 방법을 지원하는 것을 예시한 도면이다. 도 7은 제조 공정에 앱시스트 도입에 따른 인과순환지도를 통한 선순환 구조를 예시한 도면이다. 도 8은 특정 제조 공정에 포함된 세부 공정 항목을 도출한 것을 예시한 도면이다. 도 9는 작업자로부터 제조 공정에 대한 작업 데이터를 수집하는 방법을 예시한 도면이다."}
