{"patent_id": "10-2021-0135217", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0052080", "출원번호": "10-2021-0135217", "발명의 명칭": "반도체 패키지", "출원인": "삼성전자주식회사", "발명자": "김종완"}}
{"patent_id": "10-2021-0135217", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "패키지 기판;상기 패키지 기판 상의 반도체 칩;상기 패키지 기판 상에 제공되고, 상기 반도체 칩의 상면을 덮는 상부 커버 및 상기 반도체 칩의 둘레를 따라연장되어 상기 반도체 칩을 포위하는 사이드 커버를 포함하는, 전자파 차폐 구조체; 및상기 반도체 칩 및 상기 전자파 차폐 구조체에 접촉된 밀봉재;를 포함하고,상기 사이드 커버는 복수의 제1 관통홀을 포함하고, 상기 상부 커버는 복수의 제2 관통홀을 포함하는, 반도체패키지."}
{"patent_id": "10-2021-0135217", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 밀봉재는,상기 전자파 차폐 구조체의 외측면을 덮는 외측 부분;상기 전자파 차폐 구조체의 내측면과 상기 반도체 칩 사이에 제공된 내측 부분; 및상기 사이드 커버의 상기 복수의 제1 관통홀 및 상기 상부 커버의 상기 복수의 제2 관통홀을 채우는 복수의 홀충전부;를 포함하는 것을 특징으로 하는 반도체 패키지."}
{"patent_id": "10-2021-0135217", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 밀봉재의 상기 내측 부분, 상기 외측 부분, 및 상기 복수의 홀 충전부는 동일한 물질을 포함하는 것을 특징으로 하는 반도체 패키지."}
{"patent_id": "10-2021-0135217", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 2 항에 있어서,상기 밀봉재는 에폭시 몰딩 컴파운드를 포함하는 것을 특징으로 하는 반도체 패키지."}
{"patent_id": "10-2021-0135217", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 상부 커버의 두께 및 상기 사이드 커버의 두께는 200㎛ 내지 1000㎛ 사이인 것을 특징으로 하는 반도체 패키지."}
{"patent_id": "10-2021-0135217", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서,상기 사이드 커버의 상기 복수의 제1 관통홀 각각의 사이즈 및 상기 상부 커버의 상기 복수의 제2 관통홀 각각의 사이즈는 상기 밀봉재에 함유된 필러의 입자 사이즈의 2배 이상인 것을 특징으로 하는 반도체 패키지.공개특허 10-2023-0052080-3-청구항 7 제 1 항에 있어서,상기 반도체 칩은 최대 동작 주파수에서 제1 파장의 전자파를 방사하도록 구성되고, 상기 사이드 커버의 상기 복수의 제1 관통홀 각각의 사이즈 및 상기 상부 커버의 상기 복수의 제2 관통홀 각각의 사이즈는 상기 제1 파장을 50으로 나눈 값 이하인 것을 특징으로 하는 반도체 패키지."}
{"patent_id": "10-2021-0135217", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1 항에 있어서,상기 사이드 커버는 제1 물질을 포함하는 제1 사이드 차폐층 및 상기 제1 물질과 상이한 제2 물질을 포함하고상기 제1 사이드 차폐층 상에 적층된 제2 사이드 차폐층을 포함하고,상기 상부 커버는 제3 물질을 포함하는 제1 상부 차폐층 및 상기 제3 물질과 상이한 제4 물질을 포함하고 상기제1 상부 차폐층 상에 적층된 제2 상부 차폐층을 포함하는 것을 특징으로 하는 반도체 패키지."}
{"patent_id": "10-2021-0135217", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1 항에 있어서,상기 반도체 칩의 칩 패드와 상기 패키지 기판의 상부 기판 패드 사이에 제공된 칩 연결 범프들을 더 포함하고,상기 밀봉재는 상기 반도체 칩과 상기 패키지 기판 사이에 채워지고 상기 칩 연결 범프들에 접촉된 것을 특징으로 하는 반도체 패키지."}
{"patent_id": "10-2021-0135217", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "패키지 기판;상기 패키지 기판 상에 실장되고, 무선 주파수 집적 회로를 포함하고, 최대 동작 주파수에서 제1 파장의 전자파를 방사하도록 구성된 반도체 칩;상기 패키지 기판과 상기 반도체 칩 사이에 제공되고, 상기 패키지 기판과 상기 반도체 칩 사이를 전기적으로연결하도록 구성된 칩 연결 범프들;상기 패키지 기판 상에 실장된 전자파 차폐 구조체로서, 상기 반도체 칩의 상면을 덮는 상부 커버 및 상기 반도체 칩을 평면적 관점에서 포위하는 사이드 커버를 포함하고, 상기 사이드 커버는 복수의 제1 관통홀을포함하고, 상기 상부 커버는 복수의 제2 관통홀을 포함하는, 전자파 차폐 구조체; 및상기 패키지 기판 상에 제공되고, 상기 전자파 차폐 구조체, 상기 반도체 칩, 및 상기 칩 연결 범프들에 접촉된밀봉재;를 포함하고,상기 상부 커버의 두께 및 상기 사이드 커버의 두께는 각각 200㎛ 내지 1000㎛ 사이이고, 상기 사이드 커버의 상기 복수의 제1 관통홀 각각의 사이즈 및 상기 상부 커버의 상기 복수의 제2 관통홀 각각의 사이즈는 상기 밀봉재에 함유된 필러의 입자 사이즈의 2배 이상이고 상기 제1 파장을 50으로 나눈 값이하인, 반도체 패키지."}
{"patent_id": "10-2021-0135217", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 기술적 사상은 패키지 기판; 상기 패키지 기판 상의 반도체 칩; 상기 패키지 기판 상에 제공되고, 상 기 반도체 칩의 상면을 덮는 상부 커버 및 상기 반도체 칩의 둘레를 따라 연장되어 상기 반도체 칩을 포위하는 사이드 커버를 포함하는, 전자파 차폐 구조체; 및 상기 반도체 칩 및 상기 전자파 차폐 구조체에 접촉된 밀봉 재;를 포함하고, 상기 사이드 커버는 복수의 제1 관통홀을 포함하고, 상기 상부 커버는 복수의 제2 관통홀을 포 함하는, 반도체 패키지를 제공한다."}
{"patent_id": "10-2021-0135217", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 기술적 사상은 반도체 패키지에 관한 것으로서, 보다 상세하게는 전자파 차폐 구조체를 포함하는 반 도체 패키지에 관한 것이다."}
{"patent_id": "10-2021-0135217", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전자부품의 소형화와 고성능화에 따라, 반도체 패키지는 전자부품 간 전자파 간섭(electromagnetic interference)을 차폐할 수 있는 전자파 차폐 구조체를 구비할 것이 요구되고 있다."}
{"patent_id": "10-2021-0135217", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 기술적 사상이 해결하고자 하는 과제는 전자파 차폐 구조체를 포함하는 반도체 패키지를 제공하는데 있다."}
{"patent_id": "10-2021-0135217", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 과제를 해결하기 위하여 본 발명의 기술적 사상은 패키지 기판; 상기 패키지 기판 상의 반도체 칩; 상기 패키지 기판 상에 제공되고, 상기 반도체 칩의 상면을 덮는 상부 커버 및 상기 반도체 칩의 둘레를 따라 연장되 어 상기 반도체 칩을 포위하는 사이드 커버를 포함하는, 전자파 차폐 구조체; 및 상기 반도체 칩 및 상기 전자 파 차폐 구조체에 접촉된 밀봉재;를 포함하고, 상기 사이드 커버는 복수의 제1 관통홀을 포함하고, 상기 상부 커버는 복수의 제2 관통홀을 포함하는, 반도체 패키지를 제공한다. 상술한 과제를 해결하기 위하여 본 발명의 기술적 사상은 접지 패드를 포함하는 패키지 기판; 상기 패키지 기판 상에 실장된 반도체 칩; 상기 패키지 기판 상에 실장되고, 상기 반도체 칩의 상면을 덮는 상부 커버 및 상기 반 도체 칩의 둘레를 따라 연장되어 상기 반도체 칩을 포위하는 사이드 커버를 포함하고, 상기 사이드 커버는 상기 접지 패드에 전기적으로 연결된, 전자파 차폐 구조체; 상기 반도체 칩 및 상기 전자파 차폐 구조체에 접촉된 밀 봉재;를 포함하고, 상기 사이드 커버는 복수의 관통홀을 포함하고, 상기 밀봉재는 상기 사이드 커버의 상기 복 수의 관통홀을 채우는, 반도체 패키지를 제공한다. 상술한 과제를 해결하기 위하여 본 발명의 기술적 사상은 패키지 기판; 상기 패키지 기판 상에 실장되고, 무선 주파수 집적 회로를 포함하고, 최대 동작 주파수에서 제1 파장의 전자파를 방사하도록 구성된 반도체 칩; 상기 패키지 기판과 상기 반도체 칩 사이에 제공되고, 상기 패키지 기판과 상기 반도체 칩 사이를 전기적으로 연결하 도록 구성된 칩 연결 범프들; 상기 패키지 기판 상에 실장된 전자파 차폐 구조체로서, 상기 반도체 칩의 상면을 덮는 상부 커버 및 상기 반도체 칩을 평면적 관점에서 포위하는 사이드 커버를 포함하고, 상기 사이드 커버는 복수의 제1 관통홀을 포함하고, 상기 상부 커버는 복수의 제2 관통홀을 포함하는, 전자파 차폐 구조체; 및 상기 패키지 기판 상에 제공되고, 상기 전자파 차폐 구조체, 상기 반도체 칩, 및 상기 칩 연결 범프들에 접촉된 밀봉 재;를 포함하고, 상기 상부 커버의 두께 및 상기 사이드 커버의 두께는 각각 200㎛ 내지 1000㎛ 사이이고, 상기 사이드 커버의 상기 복수의 제1 관통홀 각각의 사이즈 및 상기 상부 커버의 상기 복수의 제2 관통홀 각각의 사 이즈는 상기 밀봉재에 함유된 필러의 입자 사이즈의 2배 이상이고 상기 제1 파장을 50으로 나눈 값 이하인, 반 도체 패키지를 제공한다."}
{"patent_id": "10-2021-0135217", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 예시적인 실시예들에 의하면, 반도체 패키지는 전자파를 차폐하도록 구성된 전자파 차폐 구조체를 포 함하므로, 전자파 간섭에 의한 반도체 패키지의 성능 저하를 방지할 수 있다. 또한, 본 발명의 예시적인 실시예 들에 의하면, 반도체 패키지는 반도체 칩 및 전자파 차폐 구조체를 밀봉하도록 구성된 밀봉재를 포함하므로, 반 도체 칩 및 전자파 차폐 구조체의 손상을 방지할 수 있다. 또한, 전자파 차폐 구조체는 밀봉 물질의 유입을 허 용하도록 구성된 관통홀들을 포함하므로, 반도체 칩 및 전자파 차폐 구조체를 밀봉하기 위한 밀봉재를 1회의 밀 봉 공정을 통해 형성할 수 있다."}
{"patent_id": "10-2021-0135217", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부한 도면을 참조하여 본 발명의 기술적 사상의 실시예들에 대해 상세히 설명한다. 도면 상의 동일한 구성요소에 대해서는 동일한 참조부호를 사용하고, 이들에 대한 중복된 설명은 생략한다. 도 1은 본 발명의 예시적인 실시예들에 따른 반도체 패키지의 단면도이다. 도 2는 도 1의 Ⅱ-Ⅱ' 선에 따 른 반도체 패키지의 단면도이다. 도 3은 반도체 패키지의 전자파 차폐 구조체의 일부를 나타 내는 사시도이다. 도 1 내지 도 3을 참조하면, 반도체 패키지는 패키지 기판, 반도체 칩, 전자파 차폐 구조체 (electromagnetic shield structure, 130) 및 밀봉재를 포함할 수 있다. 패키지 기판은 기판 베이스, 제1 상부 기판 패드, 제2 상부 기판 패드, 제1 하부 기판 패 드, 제2 하부 기판 패드, 및 내부 배선 패턴을 포함할 수 있다. 패키지 기판은 예를 들면, 인쇄회로기판(Printed Circuit Board, PCB)일 수 있다. 기판 베이스는 페놀 수지, 에폭시 수지, 폴리이미드 중에서 선택되는 적어도 하나의 물질을 포함할 수 있 다. 제1 상부 기판 패드 및 제2 상부 기판 패드는 기판 베이스의 상면 상에 제공될 수 있고, 제 1 하부 기판 패드 및 제2 하부 기판 패드는 기판 베이스의 하면 상에 제공될 수 있다. 내부 배 선 패턴은 기판 베이스 내에 제공될 수 있다. 내부 배선 패턴은 제1 상부 기판 패드, 제2 상부 기판 패드, 제1 하부 기판 패드, 및 제2 하부 기판 패드에 전기적으로 연결될 수 있다. 내 부 배선 패턴은 기판 베이스 내에 수평 방향(예를 들어, X방향 또는 Y방향)으로 연장된 라인 패턴들 과, 기판 베이스 내에서 수직 방향(예를 들어, Z방향)으로 연장된 비아 패턴들을 포함할 수 있다. 나아가, 패키지 기판은 기판 베이스의 상면 상에 제공된 상부 보호층 및 기판 베이스의 하면 상에 제공된 하부 보호층을 더 포함할 수 있다. 상부 보호층 및 하부 보호층은 예를 들어, 솔더 레지 스트로 형성될 수 있다. 예를 들어, 제1 상부 기판 패드, 제2 상부 기판 패드, 제1 하부 기판 패드, 제2 하부 기판 패드 및 내부 배선 패턴은 구리(Cu), 알루미늄(Al), 텅스텐(W), 티타늄(Ti), 탄탈륨(Ta), 인듐(In), 몰 리브덴(Mo), 망간(Mn), 코발트(Co), 주석(Sn), 니켈(Ni), 마그네슘(Mg), 레늄(Re), 베릴륨(Be), 갈륨(Ga), 루 테늄(Ru) 등과 같은 금속 또는 이들의 합금을 포함할 수 있다. 제1 상부 기판 패드는 마이크로범프와 같은 칩 연결 범프가 부착되는 패드이며, 칩 연결 범프를 통해 반도체 칩과 전기적으로 연결될 수 있다. 칩 연결 범프는 상부 보호층에 마련된 오프닝을 통해 제1 상부 기판 패드에 연결될 수 있다. 제2 상부 기판 패드는 전자파 차폐 구조체가 부착 되는 패드일 수 있다. 제2 상부 기판 패드와 전자파 차폐 구조체 사이에는, 제2 상부 기판 패드(12 2)와 전자파 차폐 구조체 사이를 전기적으로 연결하도록 구성된 도전성 접합 물질이 제공될 수 있다. 도전성 접합 물질은 상부 보호층에 마련된 오프닝을 통해 제2 상부 기판 패드에 연결될 수 있다. 제1 하부 기판 패드는 제1 외부 연결 단자가 부착되는 패드일 수 있다. 제1 외부 연결 단자는 하부 보호층에 마련된 오프닝을 통해 제1 하부 기판 패드에 연결되며, 내부 배선 패턴을 통해 제1 상부 기판 패드에 전기적으로 연결될 수 있다. 제1 외부 연결 단자는 반도체 패키지와 외 부 장치 사이를 전기적 및 물리적으로 연결하도록 구성되며, 입/출력 데이터 신호 전송 또는 전원 및/또는 접지 를 위한 단자로 이용될 수 있다. 제2 하부 기판 패드는 제2 외부 연결 단자가 부착되는 패드일 수 있 다. 제2 외부 연결 단자는 하부 보호층에 마련된 오프닝을 통해 제2 하부 기판 패드에 연결되며, 내부 배선 패턴을 통해 제2 상부 기판 패드에 전기적으로 연결될 수 있다. 예시적인 실시 예들에서, 제2 외부 연결 단자는 외부 장치로부터 접지 전압을 공급받도록 구성될 수 있다. 제1 외부 연결 단자 및 제2 외부 연결 단자는 예를 들면, 솔더 볼 또는 솔더 범프로부터 형성될 수 있다.반도체 칩은 패키지 기판 상에 실장될 수 있다. 반도체 칩은 반도체 기판 및 칩 패드(15 3)를 포함할 수 있다. 예시적인 실시예들에서, 반도체 칩은 페이스-다운(face-down) 방식 또는 플립 칩 방식으로 패키지 기판 상에 실장될 수 있다. 즉, 반도체 칩은 칩 패드가 마련된 반도체 칩의 하면이 패키지 기 판을 향하도록 패키지 기판 상에 실장될 수 있다. 반도체 칩의 칩 패드는 칩 연결 범프 를 통해 제1 상부 기판 패드에 전기적으로 연결될 수 있다. 반도체 칩의 칩 패드는 반도체 칩의 입/출력 데이터 신호 전송을 위한 터미널, 또는 반도체 칩의 전원 및/또는 접지를 위한 터미널 로 이용될 수 있다. 반도체 기판은, 실리콘, 예를 들어, 결정질 실리콘, 다결정질 실리콘, 또는 비정질 실리콘을 포함할 수 있 다. 반도체 기판은 서로 반대된 활성면 및 비활성면을 포함할 수 있다. 반도체 기판의 상기 활성면은 반도체 칩의 하면에 인접되고, 반도체 기판의 상기 비활성면은 반도체 칩의 상면에 인접될 수 있다. 반도체 칩은 반도체 기판의 상기 활성면에 형성된 반도체 소자층을 포함할 수 있다. 반도체 칩의 칩 패드는 반도체 칩의 내부에 제공된 배선 구조(미도시)를 통하여 상기 반도체 소자층에 전기적으로 연결될 수 있다. 예시적인 실시예들에서, 반도체 칩은 메모리 칩으로서, 휘발성 메모리 칩 및/또는 비휘발성 메모리 칩을 포함할 수 있다. 상기 휘발성 메모리 칩은 예를 들어, DRAM(dynamic random access memory), SRAM(static RAM), TRAM(thyristor RAM), ZRAM(zero capacitor RAM), 또는 TTRAM(Twin Transistor RAM)을 포함할 수 있다. 또한, 상기 비휘발성 메모리 칩은 예를 들어, 플래시(flash) 메모리, MRAM(magnetic RAM), STT-MRAM(spin- transfer torque MRAM), FRAM(ferroelectric RAM), PRAM(phase change RAM), RRAM(resistive RAM), 나노튜브 RRAM(nanotube RRAM), 폴리머 RAM(polymer RAM), 또는 절연 저항 변화 메모리(insulator resistance change memory)를 포함할 수 있다. 예시적인 실시예들에서, 반도체 칩은 로직 칩일 수 있다. 예를 들어, 상기 로직 칩은 인공지능 반도체, 마 이크로 프로세서, 그래픽 프로세서, 신호 프로세서, 네트워크 프로세서, 칩셋, 오디오 코덱, 비디오 코덱, 애플 리케이션 프로세서를 포함할 수 있다. 예시적인 실시예들에서, 반도체 칩은 통신용 칩으로서, 무선 신호를 처리하기 위한 신호 처리 회로 등을 포함할 수 있다. 예를 들어, 반도체 칩은 은 무선 주파수 집적회로(Radio-Frequency Integrated Circuit, RFIC)를 포함할 수 있다. 도 1에서는 반도체 패키지가 하나의 반도체 칩을 포함하는 것으로 예시되었으나, 이에 한정되는 것 은 아니다. 예를 들면, 패키지 기판의 상면 상에는 서로 이격된 2개 이상의 반도체 칩이 배치될 수 있다. 상기 2개 이상의 반도체 칩은 동종의 칩일 수도 있고, 이종의 칩일 수도 있다. 전자파 차폐 구조체는 패키지 기판 상에 실장되며, 반도체 칩으로부터 이격될 수 있다. 전자파 차폐 구조체는 표면 실장 기술을 이용하여 패키지 기판 상에 실장될 수 있다. 예를 들어, 전자파 차 폐 구조체는 도전성 접합 물질을 통해 패키지 기판의 제2 상부 기판 패드에 물리적 및 전 기적으로 연결될 수 있다. 예를 들어, 상기 도전성 접합 물질은 솔더를 포함할 수 있다. 전자파 차폐 구조체는 반도체 칩을 덮을 수 있다. 예를 들어, 전자파 차폐 구조체는 반도체 칩 을 덮는 컵(cup) 형상을 가질 수 있으며, 반도체 칩을 수용하는 내측 공간(도 9의 139)을 정의할 수 있다. 전자파 차폐 구조체는 반도체 칩의 상면을 덮고, 반도체 칩을 평면적 관점에서 포위 할 수 있다. 예시적인 실시예들에서, 전자파 차폐 구조체의 두께는 대체로 균일할 수 있다. 전자파 차폐 구조체는 반도체 칩에서 발생된 전자파가 반도체 패키지의 외부로 방출되는 것을 차폐 또는 억제할 수 있고, 또한 반도체 패키지의 외부의 전자 부품에서 발생된 전자파가 반도체 칩(15 0)으로 전달되는 것을 차폐 또는 억제하도록 구성될 수 있다. 예를 들어, 전자파 차폐 구조체는 전자파를 반사(reflection) 및/또는 흡수(absorption)함으로써, 전자파 간섭을 차폐하도록 구성될 수 있다. 예시적인 실 시예들에서, 전자파 차폐 구조체는 미리 정해진 주파수 대역의 전자파를 차폐하도록 구성될 수 있다. 예시적인 실시예들에서, 전자파 차폐 구조체는 금속, 자성체, 카본, 세라믹, 폴리머, 또는 이들의 조합을 포함할 수 있다. 예를 들어, 전자파 차폐 구조체는 구리(Cu), 은(Ag)과 같은 금속을 포함할 수 있다. 예를 들어, 전자파 차폐 구조체는 페라이트(ferrite)를 포함할 수 있다. 전자파 차폐 구조체는 단층 구조일 수도 있고, 다층 구조를 가질 수도 있다. 예를 들어, 다층 구조의 전자파 차폐 구조체는 제1 물질을 포 함하는 제1 층 상에 제1 물질과 상이한 제2 물질을 포함하는 제2 층이 적층된 구조를 가질 수 있다. 예시적인 실시예들에서, 제2 상부 기판 패드는 전기적으로 접지될 수 있다. 제2 상부 기판 패드는 접 지 패드로 지칭될 수도 있다. 예를 들어, 제2 상부 기판 패드는 외부로부터 제공된 접지 전압을 인가받도 록 구성된 제2 외부 연결 단자와 내부 배선 패턴을 통해 연결될 수 있다. 전자파 차폐 구조체와 제2 외부 연결 단자 사이의 전기적 연결 경로에 포함된 도전성 접합 물질, 제2 상부 기판 패드, 내부 배선 패턴, 및 제2 하부 기판 패드는 전자파 차폐 구조체에 흡수된 전자파가 방사되는 전 기적 경로를 구성할 수 있다. 예시적인 실시예들에서, 전자파 차폐 구조체는 반도체 칩을 평면적 관점에서 포위하는 사이드 커버 및 반도체 칩의 상면을 덮는 상부 커버를 포함할 수 있다. 상부 커버는 평판 형태, 예를 들어 사각형의 평판 형태를 가질 수 있다. 상부 커버의 평면적은 반도 체 칩의 평면적보다 크며, 상부 커버는 반도체 칩을 전체적으로 덮을 수 있다. 사이드 커버는 평면적 관점에서 반도체 칩을 포위하도록 사이드 커버는 반도체 칩의 둘레 를 따라 연속적으로 연장된 링 형태를 가질 수 있다. 예를 들어, 사이드 커버는 평면적 관점에서 사각 링 형태를 가질 수 있다. 사이드 커버는 반도체 칩의 측벽과 측 방향(예를 들어, X방향 및/또는 Y 방향)으로 마주하고, 반도체 칩의 측벽으로부터 측 방향(예를 들어, X방향 및/또는 Y방향)으로 이격 될 수 있다. 사이드 커버의 높이는 반도체 칩의 높이보다 클 수 있고, 상부 커버의 가장자리로 부터 패키지 기판의 상면까지 연장될 수 있다. 사이드 커버는 상부 커버의 가장자리로부터 패키 지 기판의 상면까지 대체로 선형적으로 연장될 수 있다. 사이드 커버의 하단은 도전성 접합 물질 에 접촉될 수 있다. 사이드 커버는 제1 관통홀을 포함할 수 있다. 제1 관통홀은 측 방향(예를 들어, X방향 및/또는 Y방향)으로 연장되어 사이드 커버를 관통할 수 있다. 사이드 커버에는 서로 이격된 복수의 제1 관통 홀이 제공될 수 있다. 복수의 제1 관통홀의 영역별 밀도는 균일할 수 있다. 여기서, 복수의 제1 관통 홀의 영역별 밀도는 사이드 커버의 특정 로컬 영역의 면적 대비 상기 특정 로컬 영역 내에 마련된 제 1 관통홀들의 개수로 정의되거나, 또는 사이드 커버의 특정 로컬 영역의 면적 대비 상기 특정 로컬 영역 내에 마련된 제1 관통홀들의 전체 면적으로 정의될 수 있다. 또한, 복수의 제1 관통홀은 서로 균일한 간격으로 이격될 수 있다. 또한, 복수의 제1 관통홀은 서로 동일한 치수(dimension)를 가질 수 있 다. 예를 들어, 복수의 제1 관통홀은 서로 동일한 사이즈를 가질 수 있다. 상부 커버는 제2 관통홀을 포함할 수 있다. 제2 관통홀은 수직 방향(예를 들어, Z방향)으로 연 장되어 상부 커버를 관통할 수 있다. 상부 커버에는 서로 이격된 복수의 제2 관통홀이 제공될 수 있다. 복수의 제2 관통홀의 영역별 밀도는 균일할 수 있다. 여기서, 복수의 제2 관통홀의 영역별 밀도는 상부 커버의 특정 로컬 영역의 면적 대비 상기 특정 로컬 영역 내에 마련된 제2 관통홀들의 개수로 정의되거나, 또는 상부 커버의 특정 로컬 영역의 면적 대비 상기 특정 로컬 영역 내에 마련된 제2 관통홀들의 전체 면적으로 정의될 수 있다. 또한, 복수의 제2 관통홀은 서로 균일한 간격으로 이격될 수 있다. 또한, 복수의 제2 관통홀은 서로 동일한 치수를 가질 수 있다. 예를 들어, 복수의 제2 관통홀 은 서로 동일한 사이즈를 가질 수 있다. 예시적인 실시예들에서, 제1 관통홀의 사이즈(133D)와 제2 관통홀의 사이즈(137D)는 서로 동일할 수 있다. 여기서, 제1 관통홀의 사이즈(133D)는 제1 관통홀의 직경 또는 수직 방향(예를 들어, Z방향)에 따른 최대 폭을 의미할 수 있고, 제2 관통홀의 사이즈(137D)는 제2 관통홀의 직경 또는 수평 방향(예 를 들어, X방향 및/또는 Y방향)에 따른 최대 폭을 의미할 수 있다. 예시적인 실시예들에서, 이웃하는 2개의 제1 관통홀들의 중심들 사이의 거리를 제1 피치(pitch)로 정의하 고, 이웃하는 2개의 제2 관통홀들의 중심들 사이의 거리를 제2 피치(pitch)로 정의할 때, 제1 피치와 제2 피치는 서로 동일할 수 있다. 밀봉재는 패키지 기판 상에 제공될 수 있다. 밀봉재는 패키지 기판의 적어도 일부, 반도체 칩의 적어도 일부, 및 전자파 차폐 구조체의 적어도 일부를 덮을 수 있다. 밀봉재는 반도체 칩 및 전자파 차폐 구조체를 외부 환경으로부터 보호하는 역할을 수행할 수 있다. 예시적인 실시예들에서, 밀봉재는 에폭시계(epoxy-group) 수지 또는 폴리이미드계(polyimide-group) 수지 등을 포함할 수 있다. 예를 들어, 밀봉재는 에폭시 몰딩 컴파운드(epoxy molding compound, EMC)를 포함 할 수 있다. 예를 들어, 밀봉재는 PIE(photoimagable encapsulant)와 같은 감광성 재료를 포함할 수 있다. 예를 들어, 밀봉재는 에폭시계 수지 또는 폴리이미드계 수지로 형성된 베이스 수지(도 9의 181)와, 상기 베이스 수지에 함유된 필러(도 9의 183)를 포함할 수 있다. 상기 필러는 무기 필러 및/또는 유 기 필러를 포함할 수 있다. 예를 들어, 상기 필러는 실리카를 포함할 수 있다. 밀봉재는 전자파 차폐 구조체의 외측면을 덮는 외측 부분, 전자파 차폐 구조체의 내측면과 반도체 칩 사이에 제공된 내측 부분, 사이드 커버의 제1 관통홀들을 채우는 제1 홀 충전부 들, 및 상부 커버의 제2 관통홀들을 채우는 제2 홀 충전부들을 포함할 수 있다. 밀봉재 의 내측 부분은 반도체 칩의 상면 및 측벽을 덮을 수 있고, 또한 반도체 칩과 패키지 기판 사이의 틈에 채워져 칩 연결 범프에 접촉될 수 있다. 밀봉재의 외측 부분, 내 측 부분, 제1 홀 충전부들 및 제2 홀 충전부들은 동일한 물질 및/또는 동일한 물질 조성을 가질 수 있다. 예시적인 실시예들에서, 밀봉재를 형성하기 위하여, 전자파 차폐 구조체의 외측면 상에 밀봉재 를 구성하는 밀봉 물질(도 9의 180)을 공급할 수 있다. 전자파 차폐 구조체의 외측면 상에 제공된 밀봉 물 질은 사이드 커버의 제1 관통홀들 및 상부 커버의 제2 관통홀들을 통해 전자파 차폐 구조체의 내측으로 유입될 수 있다. 전자파 차폐 구조체의 내측으로 유입된 밀봉 물질은 반도체 칩의 상면 및 측벽을 덮을 수 있다. 또한, 전자파 차폐 구조체의 내측으로 유입된 밀봉 물 질은 반도체 칩과 패키지 기판 사이의 틈에 충전되며, 칩 연결 범프들을 포위할 수 있다. 예시적인 실시예들에서, 사이드 커버는 사각형의 반도체 칩의 둘레를 따라 연장된 사각 링 형태를 가 질 수 있다. 사각 링 형태의 사이드 커버는 평면적 관점에서 선형적으로 연장된 4개의 세그먼트들(1311, 1312, 1313, 1314)을 포함할 수 있다. 예를 들어, 제2 수평 방향(예를 들어, Y방향)으로 연장된 제1 세그먼트 및 제2 세그먼트와, 제1 수평 방향(예를 들어, X방향)으로 연장된 제3 세그먼트와 제4 세그 먼트를 포함할 수 있다. 이 때, 사이드 커버의 4개의 세그먼트들(1311, 1312, 1313, 1314) 모두에 제1 관통홀들이 균일한 간격으로 형성될 수 있다. 이 경우, 밀봉재의 형성 공정 동안, 밀봉 물질 이 사이드 커버의 4개의 세그먼트들(1311, 1312, 1313, 1314)의 제1 관통홀들을 통해 서로 다 른 방향에서 반도체 칩을 향하여 유입되므로, 전자파 차폐 구조체의 내측 공간에서 밀봉재(14 0)의 미충전 이슈가 억제될 수 있다. 예시적인 실시예들에서, 전자파 차폐 구조체의 제1 관통홀 및 제2 관통홀을 통한 밀봉 물질 의 유입이 원활할 수 있도록, 제1 관통홀의 사이즈(133D) 및 제2 관통홀의 사이즈(137D)는 밀봉 재에 함유된 필러의 입자 사이즈(도 9의 183D)보다 클 수 있다. 예시적인 실시예들에서, 제1 관통홀 의 사이즈(133D) 및 제2 관통홀의 사이즈(137D)는 밀봉재에 함유된 필러의 입자 사이즈 (183D)의 2배 이상일 수 있다. 예시적인 실시예들에서, 밀봉재에 함유된 필러의 직경이 55마이크로미 터(㎛) 일 때, 제1 관통홀의 사이즈(133D) 및 제2 관통홀의 사이즈(137D)는 110㎛ 이상일 수 있다. 예시적인 실시예들에서, 전자파 차폐 구조체는 미리 결정된 주파수 대역에 대해 99% 이상의 차폐 효과 (shielding effectiveness, S.E.)를 가지도록 구성될 수 있다. 여기서, 차폐 효과는 아래 식에 의해 정의될 수 있다. 하기 식에서, λ는 전자파 차폐 구조체로 입사되는 전자파의 파장, l은 전자파 차폐 구조체 에 제공된 관통홀의 최대 폭(즉, 제1 관통홀의 최대 폭 및 제2 관통홀의 최대 폭), n은 전자파 차폐 구조체에 제공된 관통홀의 개수를 나타낸다. ... 식 또한, 아래 표 1은 데시벨(dB) 단위의 차폐 효과를 퍼센테이지(%) 단위의 차폐 효율(Shielding Efficiency)로 변환한 변환표이다. 표 1 Shielding Effectiveness (dB) Shielding Efficiency (%) 0 010 90 20 99 30 99.39 40 99.99 50 99.999 60 99.9999 70 99.99999 80 99.999999 90 99.9999999 예시적인 실시예들에서, 전자파 차폐 구조체의 차폐 효율은 상기 식 및 표 1을 기초로, 특정 주파수 대 역에 대해 99% 이상의 차폐 효율을 가지도록 구성될 수 있다. 예시적인 실시예들에서, 전자파 차폐 구조체(13 0)에 제공된 제1 관통홀의 사이즈(133D) 및 제2 관통홀의 사이즈(137D), 및/또는 전자파 차폐 구조체 에 제공된 제1 관통홀의 개수 및 제2 관통홀의 개수를 조절하여, 특정 주파수 대역에 대한 전자 파 차폐 구조체의 차폐 효율이 99% 이상이 되도록 구성할 수 있다. 예시적인 실시예들에서, 전자파 차폐 구조체가 제1 파장(λ1)을 갖는 전자파를 차폐하도록 구성되었을 때, 제1 관통홀의 사이즈(133D) 및 제2 관통홀의 사이즈(137D)는 각각 λ1/20 이하 또는 λ1/50 이하일 수 있다. 만일, 제1 관통홀의 사이즈(133D) 및 제2 관통홀의 사이즈(137D)가 너무 큰 경우, 제1 파 장을 갖는 전자파에 대한 차폐가 급격히 저하될 수 있다. 예시적인 실시예들에서, 반도체 칩이 RFIC를 포함하고 최대 동작 주파수(maximum operation frequency)에 서 제1 파장(λ1)의 전자파를 방사하도록 구성되는 경우, 제1 관통홀의 사이즈(133D) 및 제2 관통홀 의 사이즈(137D)는 λ1/50 이하로 설정될 수 있다. 예를 들어, 반도체 칩의 최대 동작 주파수가 11.660Gbps(5.830GHz)인 경우, 제1 관통홀의 사이즈(133D) 및 제2 관통홀의 사이즈(137D)는 1.03mm 이하로 설정될 수 있다. 한편, 전자파 차폐 구조체에서 전자파가 차폐되는 척도는 스킨 뎁스(skin depth)로 나타낼 수 있다. 스킨 뎁스는 전자파 차폐 구조체의 내부로 흡수된 전자파의 세기가 1/e로 감쇄될 때까지의 전자파의 진행 길이 를 의미한다. 스킨 뎁스는 하기 식로 나타낼 수 있다. 하기 식에서, δ는 스킨 뎁스, ρ는 전자파 차폐 구조체의 저항률(μΩ·cm), f는 전자파의 주파수, μ는 전자파 차폐 구조체의 투자율(permeabilit y)을 의미한다. ... 식 스킨 뎁스의 크기가 작을수록 전자파 차폐 특성이 높음을 의미할 수 있다. 예를 들어, 높은 주파수 대역의 전자 파의 경우, 스킨 뎁스가 상대적으로 작으며, 이는 전자파가 차폐 구조체의 내부에서 진행되는 길이가 작고 비교적 작은 두께의 전자파 차폐 구조체로 차폐가 가능함을 의미한다. 반면, 낮은 주파수 대역의 전자파의 경우, 스킨 뎁스가 상대적으로 크며, 이는 전자파가 차폐 구조의 내부에서 진행되는 길이가 길고 전자파 차폐를 위해 요구되는 전자파 차폐 구조체의 두께가 커져야 함을 의미할 수 있다. 도 4는 전자파 차폐 구조체의 두께와 전자파 차폐 구조체에서 차폐되는 최소 차폐 주파수와의 관계를 나타내는 그래프이다. 도 4에서, 가로축은 전자파 차폐 구조체의 두께를 나타내고, 세로축은 최소 차폐 주파수(즉, 전자파 차폐 구조체에서 차폐 가능한 전자파의 최소 주파수)를 나타낸다. 도 1 내지 도 4를 참조하면, 전자파 차폐 구조체의 두께를 조절하여, 최소 차폐 주파수를 조절할 수 있다. 즉, 사이드 커버의 두께(131T) 및 상부 커버의 두께(135T)를 조절함으로써, 전자파 차폐 구조체(13 0)에서 차폐되는 차폐 주파수의 범위를 조절할 수 있다. 예시적인 실시예들에서, 사이드 커버의 두께 (131T) 및 상부 커버의 두께(135T)는 200㎛ 내지 1000㎛ 사이의 범위를 가질 수 있다. 이 경우, 도 4의 그 래프를 참고하면, 전자파 차폐 구조체에서 차폐되는 전자파의 최소 주파수는 0.004 MHz 내지 0.11 MHz 사이일 수 있다. 이 경우, 전자파 차폐 구조체는 낮은 주파수 대역의 전자파도 효과적으로 차폐할 수 있다. 도 5는 본 발명의 예시적인 실시예들에 따른 반도체 패키지를 나타내는 단면도이다. 이하에서, 도 1 내지 도 3을 참조하여 설명된 반도체 패키지와의 차이점을 중심으로, 도 5의 반도체 패키 지에 대해 설명한다. 도 5를 참조하면, 반도체 패키지는 패키지 기판, 반도체 칩, 전자파 차폐 구조체(130a) 및 밀 봉재를 포함할 수 있다. 전자파 차폐 구조체(130a)는 다수의 물질층이 적층된 구조를 가질 수 있다. 예시적인 실시예들에서, 사이드 커버(131a)는 제1 물질을 포함하는 제1 사이드 차폐층, 및 제1 물질과 상 이한 제2 물질을 포함하는 제2 사이드 차폐층을 포함할 수 있다. 사이드 커버(131a)의 제2 사이드 차폐층 은 사이드 커버(131a)의 제1 사이드 차폐층 상에 적층될 수 있다. 예를 들어, 사이드 커버(131a)의 제1 사이드 차폐층은 반도체 칩의 측벽과 마주하며, 사이드 커버(131a)의 제2 사이드 차폐층 은 사이드 커버(131a)의 제1 사이드 차폐층을 사이에 두고 반도체 칩의 측벽으로부터 이격 될 수 있다. 예시적인 실시예들에서, 제1 물질 및 제2 물질 중 하나는 구리(Cu)이고, 나머지 하나는 자성체(예 를 들어, 페라이트)를 포함할 수 있다. 예시적인 실시예들에서, 상부 커버(135a)는 제3 물질을 포함하는 제1 상부 차폐층 및 제3 물질과 상이한 제4 물질을 포함하는 제2 상부 차폐층을 포함할 수 있다. 상부 커버(135a)의 제2 상부 차폐층은 상부 커버(135a)의 제1 상부 차폐층 상에 적층될 수 있다. 예를 들어, 상부 커버(135a)의 제1 상부 차폐층(19 3)은 반도체 칩의 상면과 마주하며, 상부 커버(135a)의 제2 상부 차폐층은 상부 커버(135a)의 제1 상부 차폐층을 사이에 두고 반도체 칩의 상면으로부터 이격될 수 있다. 상부 커버(135a)의 제1 상부 차폐층은 사이드 커버(131a)의 제1 사이드 차폐층에 연결될 수 있고, 상부 커버(135a)의 제 2 상부 차폐층은 사이드 커버(131a)의 제2 사이드 차폐층에 연결될 수 있다. 예시적인 실시예들에서, 제1 상부 차폐층의 제3 물질은 제1 사이드 차폐층의 제1 물질과 동일할 수 있고, 제2 상부 차폐층 의 제4 물질은 제2 사이드 차폐층의 제2 물질과 동일할 수 있다. 다른, 예시적인 실시예들에서, 제1 상부 차폐층의 제3 물질은 제1 사이드 차폐층의 제1 물질과 상이할 수도 있고, 제2 상부 차폐층(19 4)의 제4 물질은 제2 사이드 차폐층의 제2 물질과 상이할 수도 있다. 도 5에서는 전자파 차폐 구조체(130a)가 2층 구조를 가지는 것으로 설명되었으나, 이는 예시적인 것이며 전자파 차폐 구조체(130a)는 3층 이상의 구조를 가질 수도 있다. 예컨대, 사이드 커버(131a) 및 상부 커버(135a)는 3층 이상이 물질층이 적층된 구조를 가질 수 있다. 도 6은 본 발명의 예시적인 실시예들에 따른 반도체 패키지를 나타내는 단면도이다. 이하에서, 도 1 내지 도 3을 참조하여 설명된 반도체 패키지와의 차이점을 중심으로, 도 6의 반도체 패키 지에 대해 설명한다. 도 6을 참조하면, 반도체 패키지는 패키지 기판, 반도체 칩, 전자파 차폐 구조체 밀봉재 , 및 언더필 물질층을 포함할 수 있다. 언더필 물질층은 반도체 칩과 패키지 기판 사이에 제공되며, 칩 연결 범프를 포위할 수 있 다. 언더필 물질층은 에폭시 수지를 포함할 수 있고, 모세관 언더필(capillary under fill) 방법에 의해 형성될 수 있다. 일부 실시예들에서, 언더필 물질층은 비전도성 필름(non-conductive film)을 이용하여 형 성할 수도 있다. 반도체 패키지의 제조 공정 시, 언더필 물질층을 형성하는 단계가 완료된 후에, 전 자파 차폐 구조체의 실장 단계 및 밀봉재의 형성 단계가 차례로 수행될 수 있다. 밀봉재는 반도 체 칩의 상면 및 측벽을 덮고, 언더필 물질층의 측면을 덮을 수 있다. 도 7은 본 발명의 예시적인 실시예들에 따른 반도체 패키지를 나타내는 단면도이다. 이하에서, 도 1 내지 도 3을 참조하여 설명된 반도체 패키지와의 차이점을 중심으로, 도 7의 반도체 패키 지에 대해 설명한다. 도 7을 참조하면, 반도체 패키지는 패키지 기판, 반도체 칩, 전자파 차폐 구조체 밀봉재 , 및 안테나 패턴을 포함할 수 있다. 안테나 패턴은 무선 신호를 송수신하도록 구성될 수 있다. 안테나 패턴은 RFIC를 포함하는 반도체 칩 과 전기적으로 연결될 수 있으며, 상기 반도체 칩으로부터 제공된 신호를 외부로 송신하거나 외부에서 전송된 무선 신호를 수신할 수 있다. 안테나 패턴은 패키지 기판 상에 배치될 수 있다. 안테나 패 턴은 무선 신호의 송수신에 적합한 구조를 가질 수 있다. 예를 들어, 안테나 패턴은 패치 안테나 (patch antenna), 다이폴 안테나(dipole antenna), 미앤더(meander) 등을 포함할 수 있다. 안테나 패턴은 패키지 기판의 상면 상에 제공되며, 전자파 차폐 구조체의 사이드 커버에 인접할 수 있다. 이 때, 안테나 패턴에서 송수신되는 무선 신호는 안테나 패턴에 인접된 사이드 커버 의 관통홀을 통해 전송될 수 있다. 이 때, 안테나 패턴에 인접된 사이드 커버의 관통홀 은 무선 신호를 통과시키기에 적합한 사이즈를 가질 수 있으며, 사이드 커버에 제공된 다른 제1 관통 홀들보다 큰 사이즈를 가질 수 있다. 도 8a 내지 도 8e는 본 발명의 예시적인 실시예들에 따른 반도체 패키지의 제조 방법을 나타내는 단면도 들이다. 도 9는 밀봉재의 형성 과정을 보여주는 단면도이다. 이하에서는, 도 8a 내지 도 8e와 도 9를 참조 하여, 도 1에 예시된 반도체 패키지의 제조 방법을 설명한다. 도 8a를 참조하면, 패키지 기판(101a) 상에 반도체 칩을 실장한다. 상기 패키지 기판(101a)은 2개 이상의 반도체 칩이 실장 가능한 평면적을 가질 수 있다. 반도체 칩은 페이스-다운(face-down) 방식 또는 플 립 칩 방식으로 패키지 기판(101a) 상에 실장될 수 있다. 반도체 칩의 칩 패드는 칩 연결 범프 를 통해 패키지 기판(101a)의 제1 상부 기판 패드에 전기적 및 물리적으로 연결될 수 있다. 도 8b를 참조하면, 패키지 기판(101a) 상에 전자파 차폐 구조체를 실장한다. 전자파 차폐 구조체는 반도체 칩을 덮도록 패키지 기판(101a) 상에 실장될 수 있다. 전자파 차폐 구조체의 사이드 커버 는 도전성 접합 물질을 통해 패키지 기판(101a)의 제2 상부 기판 패드에 전기적 및 물리적으로 연결될 수 있다. 도 8c를 참조하면, 패키지 기판(101a) 상에, 전자파 차폐 구조체 및 반도체 칩을 덮어 밀봉하도록 구 성된 밀봉재를 형성한다. 밀봉재는 전자파 차폐 구조체의 외측면을 덮고, 전자파 차폐 구조체 의 제1 관통홀들 및 제2 관통홀들을 채우고, 전자파 차폐 구조체의 내측 공간(도 9의 13 9)을 채울 수 있다. 예시적인 실시예들에서, 밀봉재는 반도체 칩과 패키지 기판(101a) 사이의 틈에 충전되고 칩 연결 범프들에 접촉될 수 있다. 도 8c 및 도 9를 참조하면, 밀봉재를 형성하기 위하여, 전자파 차폐 구조체의 외측면 상에 액상의 밀 봉 물질을 공급할 수 있다. 전자파 차폐 구조체의 외측면 상에 제공된 밀봉 물질은 사이드 커버 의 제1 관통홀들 및 상부 커버의 제2 관통홀들을 통해 전자파 차폐 구조체의 내측으 로 유입될 수 있다. 전자파 차폐 구조체의 내측으로 유입된 밀봉 물질은 전자파 차폐 구조체의 내측 공간에 채워지며, 반도체 칩의 상면 및 측벽을 덮을 수 있다. 또한, 전자파 차폐 구 조체의 내측으로 유입된 밀봉 물질은 반도체 칩과 패키지 기판(101a) 사이의 틈에 충전되며, 칩 연결 범프들을 포위할 수 있다. 밀봉 물질이 사이드 커버의 제1 관통홀들 및 상부 커버 의 제2 관통홀들을 통해 전자파 차폐 구조체의 내측으로 원활하게 유입될 수 있도록, 제1 관통 홀의 사이즈(133D) 및 제2 관통홀의 사이즈(137D)는 밀봉 물질에 함유된 필러의 입자 사이 즈(183D)보다 클 수 있다. 예컨대, 제1 관통홀의 사이즈(133D) 및 제2 관통홀의 사이즈(137D)는 밀봉 물질에 함유된 필러의 입자 사이즈(183D)의 2배 이상일 수 있다. 이후, 상기 밀봉 물질을 경화 시켜, 밀봉재를 형성할 수 있다. 도 8d를 참조하면, 패키지 기판(101a)의 제1 하부 기판 패드 및 제2 하부 기판 패드 상에 제1 외부 연결 단자 및 제2 외부 연결 단자를 부착한다. 예를 들어, 제1 외부 연결 단자 및 제2 외부 연 결 단자를 형성하기 위하여, 제1 하부 기판 패드 및 제2 하부 기판 패드 상에 솔더볼들을 부착 하고, 상기 솔더볼들에 대한 리플로우 공정을 수행할 수 있다. 도 8e를 참조하면, 도 8d의 결과물에 대한 쏘잉 공정을 수행하여, 도 8d의 결과물을 단일 패키지 사이즈를 갖는 다수의 반도체 패키지들로 분리할 수 있다. 즉, 스크라이브 레인(SL)을 따라 도 8d의 결과물을 절단하여, 도 8d의 결과물을 다수의 반도체 패키지들로 분리할 수 있다. 본 발명의 예시적인 실시예들에 의하면, 반도체 패키지는 전자파를 차폐하도록 구성된 전자파 차폐 구조 체를 포함하므로, 전자파 간섭에 의한 반도체 패키지의 성능 저하를 방지할 수 있다. 또한, 본 발명의 예시적인 실시예들에 의하면, 반도체 패키지는 반도체 칩 및 전자파 차폐 구조체 를 밀봉하도록 구성된 밀봉재를 포함하므로, 반도체 칩 및 전자파 차폐 구조체의 손상을방지할 수 있다. 또한, 전자파 차폐 구조체는 밀봉 물질의 유입을 허용하도록 구성된 관통홀들을 포함하므 로, 반도체 칩 및 전자파 차폐 구조체를 밀봉하기 위한 밀봉재를 1회의 밀봉 공정을 통해 형성 할 수 있다. 이상에서와 같이 도면과 명세서에서 예시적인 실시예들이 개시되었다. 본 명세서에서 특정한 용어를 사용하여 실시예들을 설명되었으나, 이는 단지 본 개시의 기술적 사상을 설명하기 위한 목적에서 사용된 것이지 의미 한"}
{"patent_id": "10-2021-0135217", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "정이나 청구범위에 기재된 본 개시의 범위를 제한하기 위하여 사용된 것은 아니다. 그러므로 본 기술분야의 통 상의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 타 실시예가 가능하다는 점을 이해할 것이다. 따라서, 본 개시의 진정한 기술적 보호범위는 첨부된 청구범위의 기술적 사상에 의해 정해져야 할 것이다."}
{"patent_id": "10-2021-0135217", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 예시적인 실시예들에 따른 반도체 패키지의 단면도이다. 도 2는 도 1의 Ⅱ-Ⅱ' 선에 따른 반도체 패키지의 단면도이다. 도 3은 반도체 패키지의 전자파 차폐 구조체의 일부를 나타내는 사시도이다. 도 4는 전자파 차폐 구조체의 두께와 전자파 차폐 구조체에서 차폐되는 최소 차폐 주파수와의 관계를 나타내는 그래프이다. 도 5는 본 발명의 예시적인 실시예들에 따른 반도체 패키지를 나타내는 단면도이다. 도 6은 본 발명의 예시적인 실시예들에 따른 반도체 패키지를 나타내는 단면도이다. 도 7은 본 발명의 예시적인 실시예들에 따른 반도체 패키지를 나타내는 단면도이다. 도 8a 내지 도 8e는 본 발명의 예시적인 실시예들에 따른 반도체 패키지의 제조 방법을 나타내는 단면도들이다. 도 9는 밀봉재의 형성 과정을 보여주는 단면도이다."}
