{"patent_id": "10-2019-0009504", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0092218", "출원번호": "10-2019-0009504", "발명의 명칭": "그림자 추적 센서와 패턴인식 기술을 이용한 검지소자의 생태독성 분석 장치 및 분석 방법", "출원인": "창원대학교 산학협력단", "발명자": "백도현"}}
{"patent_id": "10-2019-0009504", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "미리 설정된 독성도에서 배양한 적어도 하나의 검지소자 및 용액을 수용하는 수조;상기 수조의 일측에 위치하는 광원;상기 광원에 의해 발생되는 상기 검지소자의 그림자를 인지하는 포토트랜지스터; 상기 인지된 그림자의 행태 정보 특성을 추출하는 특성 추출부; 상기 행태 정보 특성 및 상기 독성도 정보를 이용하여 상기 독성도에 따른 상기 검지소자의 행태 정보를 학습하는 학습부; 및상기 행태 정보 특성을 학습한 데이터를 이용하여 새로 투입되는 검지소자의 그림자의 행태 정보 특성으로 독성도를 평가하는 평가부;를 포함하는 생태독성 평가 장치."}
{"patent_id": "10-2019-0009504", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 검지소자는 물벼룩, 미세조류, 물고기, 올챙이 중 하나를 이용하는 것을 특징으로 하는 생태독성 평가 장치."}
{"patent_id": "10-2019-0009504", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 학습부는 복수의 뉴런들을 계층으로 나누어 서로 연결하고 연결의 가중치를 학습하는 형태의 인공신경망구조로 구성되는 것을 특징으로 하는 생태독성 평가 장치."}
{"patent_id": "10-2019-0009504", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 포토트랜지스터는 복수개가 배열된 어레이 형태로 구성되며, 상기 포토트랜지스터에서 측정된 전압 변화를이용하여 그림자의 위치를 검출하는 것을 특징으로 하는 생태독성 평가 장치."}
{"patent_id": "10-2019-0009504", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 전압 신호인 아날로그 신호를 디지털 신호로 변환하는 아날로그-디지털 변환기를 포함하는 마이크로프로세서를 더 포함하는 것을 특징으로 하는 생태독성 평가 장치."}
{"patent_id": "10-2019-0009504", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "미리 설정된 독성도에서 배양한 적어도 하나의 검지소자를 용액이 차있는 수조에 투입하는 단계;상기 수조의 일측에 위치하는 광원을 발광시키는 단계;상기 수조의 타측에 위치하는 포토트랜지스터를 이용하여 상기 광원에 의해 발생되는 상기 검지소자의 그림자를인지하는 단계; 상기 인지된 그림자의 행태정보 특성을 추출하는 단계; 상기 행태 정보 특성 및 상기 독성도 정보를 이용하여 상기 독성도에 따른 상기 검지소자의 행태 정보를 학습하공개특허 10-2020-0092218-3-는 단계; 및상기 행태 정보 특성을 학습한 데이터를 이용하여 새로 투입되는 검지소자의 그림자 패턴으로 독성도를 평가하는 단계;를 포함하는 생태독성 평가 방법."}
{"patent_id": "10-2019-0009504", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 검지소자는 물벼룩, 미세조류, 물고기, 올챙이 중 하나를 이용하는 것을 특징으로 하는 생태독성 평가 방법."}
{"patent_id": "10-2019-0009504", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서,상기 행태정보를 학습하는 단계는,복수의 뉴런들을 계층으로 나누어 서로 연결하고 연결의 가중치를 학습하는 형태의 인공신경망을 이용하는 것을특징으로 하는 생태독성 평가 방법."}
{"patent_id": "10-2019-0009504", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제6항에 있어서,상기 포토트랜지스터는 복수개가 배열된 어레이 형태로 구성되며, 상기 포토트랜지스터에서 측정된 전압 변화를이용하여 그림자의 위치를 검출하는 것을 특징으로 하는 생태독성 평가 방법."}
{"patent_id": "10-2019-0009504", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 검지소자의 그림자를 인지하는 단계에 있어서,아날로그-디지털 변환기를 이용하여 상기 측정된 전압 신호인 아날로그 신호를 디지털 신호로 변환하는 단계를더 포함하는 것을 특징으로 하는 생태독성 평가 방법."}
{"patent_id": "10-2019-0009504", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 생태독성평가 분석장치 및 그 방법에 관한 것으로, 본 발명의 생태독성평가 분석 장치는 미리 설정된 독성도에서 배양한 적어도 하나의 검지소자 및 용액을 수용하는 수조; 상기 수조의 일측에 위치하는 광원; 상기 광원에 의해 발생되는 상기 검지소자의 그림자를 인지하는 포토트랜지스터; 상기 인지된 그림자의 행태 정보 특 성을 추출하는 특성 추출부; 상기 행태 정보 특성 및 상기 독성도 정보를 이용하여 상기 독성도에 따른 상기 검 지소자의 행태 정보를 학습하는 학습부; 및 상기 학습된 행태 정보 특성 데이터를 이용하여 새로 투입되는 검지 소자의 그림자의 행태 정보 특성으로 독성도를 평가하는 평가부;를 포함하여 구성되어 그림자의 움직임 패턴만을 이용하여 쉽게 오염물질의 유해성을 결정할 수 있다."}
{"patent_id": "10-2019-0009504", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 생태독성평가 분석장치 및 그 방법에 관한 것이며, 보다 상세하게는 독성물질에 노출된 검지소자의 그림자 행동 패턴을 분석하여 범주화하고 행동패턴 변화만을 이용하여 독성도를 평가하는 방법에 관한 것이다."}
{"patent_id": "10-2019-0009504", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "환경부에 따르면 유해화학물질은 매년 약 246,000여종이 유통되고 약 400여 종이 신규로 등록되고 있으며 국내 에는 약 41,000여 종의 유해화학물질이 유통 중인 것으로 알려져 있다. 이러한 유해물질들의 증가로 인해 기존 의 규제 방안으로는 개별 대응이 어렵고 수환경을 건강하게 유지 관리한다는 것은 거의 불가능한 일이다. 또한, 화학 기준을 만족한 방류수에서 생태독성이 나타남에 따라 수생태계로 미지의 유해화학물질의 유입이 우 려된다. 하·폐수를 정상적으로 처리해서 배출허용기준을 준수하여도 미지의 화학물질에 대한 영향이 계속 발견 되었으며, 이러한 미지의 화학물질들이 환경에 미치는 영향을 알 수 없어 물벼룩과 같은 생물체를 이용해 검증 하는 생태독성 관리 제도를 도입하게 되었다. 이미 여러 국가들은 수질 및 수생태계 관리에 있어 기존의 화학적 분석에 의한 농도 평가에서 생태독성평가에 의한 관리 체제로 전환하고 있으며 우리나라도 생물검정 위주의 생태독성 평가체제를 도입, 운영 중에 있다. 환 경부에서는 생태적으로 건강한 하천과 유해물질로부터 안전한 물 환경 조성을 목표로 2007년「수질환경보전법」을「수질 및 수생태계 보전에 관한 법률」로 개정하고 유해물질로부터 안전한 물 환경 조성을 위한「생태독성 통합 관리 제도(Whole Effluent Toxicity: WET)」를 2011년 1월 1일부터 시행하고 있다. 환경부의 수질유해물질의 통합 독성 관리 제도 도입방안 연구에 따르면 각 시험생물을 6개의 인자에 대해 비교하였다. 생태독성에 있어서 가장 높은 점수를 받은 것은 박테리아이고 그 다음이 물벼룩, 조류, 어류 순이 다. 하지만 박테리아는 발광 정도를 정량화하는 방법이 없어 독성의 유무만을 확인하는데 사용되기에 실질적으 로 물벼룩이 생태독성시험에 적합하다. 물벼룩은 높은 번식력, 짧은 생활사, 시험의 용이성, 독성물질에 대한 민감성 등 실험에 적합하기 때문에 오랜 기간 여러 가지 독성물질을 평가하는데 유용하게 사용돼 왔고 연구로 축적된 생태독성자료도 많다. 하지만 생물의 감수성은 물질의 종류마다 다르게 나타날 수 있으며, 종이 다른 경우에는 감수성과 상관관계가 있는 물질은 한정되기 때문에 독일과 같은 해외에서는 업종에 따라 시험 생물종을 다르게 하고 있다. 생태독성은 수많은 미지의 유해화학물질에 대한 독성을 생물체를 이용하여 화학물질 등이 시험생물의 신진대사, 번식의 감소, 생체기능 상실이나 죽음 등에 미치는 것을 분석함으로써 오염물질의 유해성을 결정하는 방법이다. 그러나 생물을 이용하는 방법은 이화학분석과 달리 정량 분석이 불가능하며, 시험생물의 건강상태 및 시험자의 숙련도에 따라 평가 결과가 달라질 수 있다. 생태독성관리 제도는 유럽, 미국 등 선진국에서 산업폐수, 공공수역 등을 대상으로 생태계 안정성을 확보하기 위한 정책방향으로 널리 사용 중에 있다. 국가별로 생태독성 시험 생물종을 정하고 있고 시험종에 따른 독성물 질의 민감도를 고려해서 여러 종류의 시험종을 제시하고 있다. 독일은 업종에 따라 생태독성 시험생물을 다르게 제시하고 있으며 미국의 경우도 가장 민감한 시험생물 3종 이상을 통해 생태독성 시험을 실시한다. 현재 우리나 라는 물벼룩과 발광박테리아를 시험생물종으로 사용하고 있지만 앞으로 다양한 생태독성평가 방법이 도입될 것으로 판단된다. 이중 물벼룩을 이용한 급성 독성 시험법은 그 과정이 복잡하고 번거로워 많이 보급되고 있지 않 은 실정이다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허공보 제10-2008-0107926호(2008년12월11일 공개)"}
{"patent_id": "10-2019-0009504", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기한 문제를 개선하기 위한 것으로, 검지소자의 움직임 데이터만을 이용하여 수질의 독성도를 판단 하는 방법을 제공하는 것이다. 본 발명의 다른 목적은 상기한 문제를 개선하기 위한 것으로, 그림자 추적 센서와 인공지능 기법을 이용하여 검 지소자의 행동 패턴을 분석하여 범주화하는 방법을 제공하는 것이다."}
{"patent_id": "10-2019-0009504", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위한 본 발명의 생태독성 평가 장치는 미리 설정된 독성도에서 배양한 적어도 하나의 검 지소자 및 용액을 수용하는 수조; 상기 수조의 일측에 위치하는 광원; 상기 광원에 의해 발생되는 상기 검지소 자의 그림자를 인지하는 포토트랜지스터; 상기 인지된 그림자의 행태 정보 특성을 추출하는 특성 추출부; 상기 행태 정보 특성 및 상기 독성도 정보를 이용하여 상기 독성도에 따른 상기 검지소자의 행태 정보를 학습하는 학 습부; 및 상기 학습된 행태 정보 특성 데이터를 이용하여 새로 투입되는 검지소자의 그림자의 행태 정보 특성으 로 독성도를 평가하는 평가부;를 포함하여 구성될 수 있다. 바람직하게는, 상기 검지소자는 물벼룩, 미세조류, 물고기, 올챙이 중 하나를 이용할 수 있다. 바람직하게는, 상기 학습부는 복수의 뉴런들을 계층으로 나누어 서로 연결하고 연결의 가중치를 학습하는 형태 의 인공신경망 구조로 구성될 수 있다.바람직하게는, 상기 포토트랜지스터는 복수개가 배열된 어레이 형태로 구성되며, 상기 포토트랜지스터에서 측정 된 전압 변화를 이용하여 그림자의 위치를 검출할 수 있다. 바람직하게는, 상기 전압 신호인 아날로그 신호를 디지털 신호로 변환하는 아날로그-디지털 변환기를 포함하는 마이크로프로세서를 더 포함할 수 있다. 상기 목적을 달성하기 위한 본 발명의 생태독성 평가 방법은 미리 설정된 독성도에서 배양한 적어도 하나의 검 지소자를 용액이 차있는 수조에 투입하는 단계; 상기 수조의 일측에 위치하는 광원을 발광시키는 단계; 상기 수 조의 타측에 위치하는 포토트랜지스터를 이용하여 상기 광원에 의해 발생되는 상기 검지소자의 그림자를 인지하 는 단계; 상기 인지된 그림자의 행태정보 특성을 추출하는 단계; 상기 행태 정보 특성 및 상기 독성도 정보를 이용하여 상기 독성도에 따른 상기 검지소자의 행태 정보를 학습하는 단계; 및 상기 학습된 행태 정보 특성 데 이터를 이용하여 새로 투입되는 검지소자의 그림자 패턴으로 독성도를 평가하는 단계;를 포함하여 구성될 수 있 다. 바람직하게는, 상기 검지소자는 물벼룩, 미세조류, 물고기, 올챙이 중 하나를 이용할 수 있다. 바람직하게는, 상기 행태정보를 학습하는 단계는, 복수의 뉴런들을 계층으로 나누어 서로 연결하고 연결의 가중 치를 학습하는 형태의 인공신경망을 이용할 수 있다. 바람직하게는, 상기 포토트랜지스터는 복수개가 배열된 어레이 형태로 구성되며, 상기 포토트랜지스터에서 측정 된 전압 변화를 이용하여 그림자의 위치를 검출할 수 있다. 바람직하게는, 상기 검지소자의 그림자를 인지하는 단계에 있어서, 아날로그-디지털 변환기를 이용하여 상기 측 정된 전압 신호인 아날로그 신호를 디지털 신호로 변환하는 단계를 더 포함할 수 있다."}
{"patent_id": "10-2019-0009504", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기한 본 발명에 의하면, 검지소자의 그림자의 이동 경로를 추출하기 때문에 검지소자의 움직임 정보를 쉽게 감지할 수 있다. 또한, 상기한 본 발명에 의하면 검지소자의 움직임 정보를 기반으로 독성도 별 데이터를 분류하여 학습 및 축적 하여 평가함으로써 움직임 정보만으로도 쉽게 오염물질의 유해성을 결정할 수 있다."}
{"patent_id": "10-2019-0009504", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변경을 가할 수 있고 여러 가지 실시 예를 가질 수 있는 바, 특정 실시 예들을 도면에 예시하 고 상세하게 설명하고자 한다. 그러나, 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포 함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 본 출원에서 사용한 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함 하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조 합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일 반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의미 를 가진 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의 미로 해석되지 않는다. 이하, 첨부한 도면들을 참조하여, 본 발명의 바람직한 실시 예를 보다 상세하게 설명하고자 한다. 본 발명을 설 명함에 있어 전체적인 이해를 용이하게 하기 위하여 도면상의 동일한 구성요소에 대해서는 동일한 참조부호를 사용하고 동일한 구성요소에 대해서 중복된 설명은 생략한다. 본 발명은 독성물질에 노출된 검지소자의 행동 패턴이 독성도에 따라 달라질 것이라는 생각에서 다양한 조건에 서의 그림자 추적 센서와 인공지능 기법을 이용하여 행동 패턴을 분석하여 범주화하고 범주화된 자료를 이용하 여 행동 패턴의 변화만으로 독성도를 평가할 수 있는 방안을 제시하기 위한 것으로, 독성 물질에서 배양한 검지 소자의 움직임 패턴을 학습하고, 학습데이터를 기반으로 생성한 비교모델을 이용하여 생태독성 평가를 실시하는 방법을 제공할 수 있다. 상기와 같은 목적을 위하여, 본 발명의 도 1은 본 발명의 실시 예에 따른 생태독성 평가 장치의 구조를 개략적 으로 나타내는 구성도이다. 생태독성 평가 장치는 광원, 포토트랜지스터, 마이크로프로세서, PC로 구성된다. 광원은 LED로 구성될 수 있으며, 조도를 조절할 수 있으며 빛을 발산할 수 있는 장치라면 그 종류를 가리 지 않는다. 포토트랜지스터는 광원에서 방출한 빛 에너지를 받아 전기에너지로 변환하는 장치이다. 마이크로프로세서는 포토트랜지스터에서 발생하는 전기에너지 신호를 디지털화하여 PC에 전달하 는 장치로써 하단의 도 2에서 구체적으로 설명하도록 한다. PC는 마이크로프로세서의 신호를 받아 분석, 조합, 학습 등 다양한 동작을 수행할 수 있으며, 그 결 과를 사용자에게 제공할 수 있고, 사용자의 제어에 따라 실험 환경을 변화하여 동작할 수 있다. 도 2는 본 발명의 실시 예에 따른 생태독성 평가 장치의 구조를 보다 구체적으로 나타내는 구성도이다. 도 2는 본 발명의 실시 예인 도 1의 구성을 보다 구체화한 것으로, 이하 내용에서는 본 발명의 대표 실시 예에 해당하는 실험에 대하여 개시하도록 한다. 도 2를 참조하면, 본 발명의 실시 예에 따른 생태독성 평가 장치는 광원, 포토트랜지스터, 검지소자 , 수조, 마이크로프로세서, 관측부로 구성될 수 있다. 검지소자는 미리 설정된 독성도를 가지는 표준물질에서 배양한 표준 수질오염공정시험에 사용될 수 있는 검지소자라면 그 종류를 가리지 않고 이용될 수 있다. 검지소자는 물벼룩, 미세조류, 물고기, 올챙이 등의 다양한 생물체가 이용될 수 있으나, 대표적으로는 물 벼룩을 이용할 수 있다. 검지소자를 배양한 생태독성 물질의 독성도 정보(표준물질)에 관련해서는 하기의 도 7에서 구체적으로 설 명한다. 수조는 광원과 포토트랜지스터사이에 위치할 수 있으며, 수조는 용액으로 채워져 있을 수 있다. 용액은 상기의 표준물질을 포함하는 수용액 또는 순수(淡水)일 수 있다. 수조에는 하기 표준물질에서 배양한 검지소자를 투입하여 위치시킬 수 있다. 광원은 수조의 윗면 또는 측면 어디든지 위치할 수 있으며, 포토트랜지스터와는 평행한 상태로 위치하여 광원의 빛이 포토트랜지스터에 직사할 수 있도록 한다.포토트랜지스터는 복수의 포토트랜지스터를 평면으로 배열할 수 있으며, 평면으로 배열된 각각의 포 토트랜지스터 셀은 광원의 빛을 받아 전압 신호를 출력할 수 있다. 광원의 동작에 따라 포토트랜지스터에는 물벼룩의 그림자가 생성될 수 있다. 광원의 동작에 따라 검지소자의 그림자는 포토트랜스터에 비추어지며, 그림자가 비추어지는 포 토트랜지스터(120-1)는 그림자가 비추어지지 않는 포토트랜지스터(120-2)에 비하여 상대적으로 낮은 전압을 발 생시킬 수 있다. 이러한 전압 신호간의 차를 이용하여 생태독성 평가 장치는 검지소자의 그림자를 인식할 수 있다. 포토트랜지스터는 전압을 발생시키는 장치로써 아날로그 신호에 해당한다. 이러한 아날로그 신호는 관측부 에서 바로 이용할 수가 없으므로 디지털 신호로의 변환이 필요하며, 마이크로프로세서에서는 ADC(Analog-to-Digital Convertor)를 이용하여 아날로그 신호를 디지털 신호로 변환할 수 있다. ADC 는 포토트랜지스터에서 생성된 전기 에너지를 관측부에서 이용할 수 있도록 디지털 신호로 변환할 수 있다. 포토트랜지스터가 어레이 형태로 구성됨에 따라 생성되는 아날로그 신호가 ADC에서 한번에 처리할 수 있는 신호의 양보다 크므로 이러한 문제를 해결하기 위하여 마이크로프로세서는 멀티플렉서(multiplexer) (미도시)를 더 포함하거나 복수의 ADC로 구성될 수 있다. 상기 멀티플렉서는 포토트랜지스터의 출력 신호를 행 또는 열 단위로 마이크로프로세서의 ADC에 전달 하는 동작을 수행하거나, 복수의 ADC를 이용하여 신호를 변환한 후에 취합하는 동작을 수행할 수 있다. 관측부는 특성추출부, 평가부, 학습부로 구성될 수 있다. 특성추출부는 마이크로프로세서에서 변환된 디지털 신호를 받아 검지소자의 움직임 경로(행태 정보)를 취득할 수 있다. 특성추출부는 상기 취득한 행태 정보에서 행태 정보 특성을 추출하여 평가부 및 학습부에 전달 할 수 있다. 학습부는 행태 정보 특성 및 검지소자를 배양한 생태독성 물질의 독성도 정보를 함께 제공받아 학습 을 수행하여 범주화할 수 있다. 학습부는 기계학습(machine learning) 알고리즘을 이용하여 학습을 수행하며, 본 발명에서는 인공신경망 (Artificial Neural Network, ANN)을 이용하여 설명하고 있으나, 딥러닝(Deep Leaning), 콘볼루션 신경망 (CNN), 재귀 신경망(RNN) 등의 기계학습을 수행할 수 있는 모든 학습 방법을 포함할 수 있다. 도 3은 본 발명의 실시 예에 따른 인공신경망의 구조를 개략적으로 나타낸 구성도이다. 도 3에서 좌측의 입력 값은 검지소자의 움직임을 1초단위로 측정하여 30분 감지한 누적 데이터이고, 우측의 출력 값은 인공신경망에서 계산된 독성도이다. 화살표는 노드들 사이의 연결을 의미하며, 화 살표 위의 수는 연결의 가중치를 의미한다. 상기 가중치는 사전학습 데이터로 학습을 진행하면서 올바른 독성도가 도출될 수 있도록 계속 수정되며, 학습이 완료되면 최종적인 값으로 고정된다. 인공신경망의 연산과정은 연산 과정은 인간의 신경망을 구성하는 뉴런에서의 작동 과정과 유사하게 작동한다. 노드는 일정 크기 이상의 자극을 받으면 반응을 하는데, 그 반응의 크기는 입력 값과 노드의 가중치(weight)를 곱한값들이 더해져서 활성 함수(activation function)의 입력으로 들어간다. 활성 함수의 결과가 노드의 출력에 해당한다. 본 발명에서 활성 함수로는 softmax() 함수를 사용하였으며, 하기의 수학식 는 실험에 사용한 텐 서 플로(TensorFlow)의 코드이다. y = tf.matmul (x, W) + b x = tf.placeholder (tf.float32, [None, 30], name = 'x') W= tf.Variable (tf.zeros ([30, 5]), name = 'W') b = tf.Variable (tf.zeros ([5]), name = 'b') ....수학식 상기 수학식 에서 x는 입력값으로써 30분간의 누적 데이터를 의미하고, W는 입력값에 대한 가중치를 의미하 고, b는 고정 가중치를 의미하고, y는 상기 입력값 x에 대한 출력값을 의미할 수 있다. 텐서 플로 코드는 하기의 수학식 을 이용하여 실행되었다. .... 수학식 상기 수학식 에서 숫자는 행렬에 대한 행 또는 열의 크기를 의미할 수 있다. 예를 들어, y는 1x5 행렬, W는 30x5 행렬, x는 1x30 행렬, b는 1x5 행렬 구조로 표현될 수 있으며, 이러한 행렬의 크기는 고정된 것이 아닌 입 력 파라미터와 출력 파라미터의 크기에 따라 변경될 수 있다. 인공지능의 학습은 입력 데이터 x로부터 출력값 y를 예측할 수 있도록 인공신경망을 훈련시키는 것으로 입력 데 이터 x를 이용해 출력 데이터 y를 만들 수 있는 최적의 파라미터 W와 b를 찾는 것을 목적으로 할 수 있다. 상기 가중치 파라미터(W, b)를 찾는 기본 방법은 상기의 수학식 에 학습 데이터를 반복하여 적용하면서 매번 더 정확한 결과를 얻기 위해 W와 b 파라메타를 수정해 나아갈 수 있다. 상기의 수학식 을 반복할 때마다 개선되고 있는지 확인하기 위해 교차 엔트로피 오차 함수(Cross-Entropy Cost Function)를 사용할 수 있다. 반복학습을 수행할 때마다 교차 엔트로피가 감소하며 반복이 거듭될수록 오 차가 점차 작아져 결국은 0에 도달하며, 텐서 플로에서는 이런 과정을 Gradient-DescentOptimizer 클래스를 사 용하여 처리할 수 있다. 도 4는 본 발명의 실시 예에 따른 시간이 경과함에 따라 관찰된 검지소자의 움직임 수를 그래프화한 도면 이다. 도 4를 확인하면, 세로축은 검지소자 수이고, 가로축은 시간(분)으로써 시간이 흘러감에 따라 관찰을 위해 투입한 검지소자의 움직임의 변화를 확인할 수 있다. 도 4의 그래프를 참조하면 독성도가 낮은 표준물질(TU1)에서 배양한 검지소자가 독성도가 높은 표준물질 (TU5)에서 배양한 검지소자에 대비하여 움직임이 활발함을 확인할 수 있다. 이러한 시간대 별 움직임 정보에 대하여 특성을 도출하고, 도출된 특성을 이용하여 학습부은 학습을 수행 함으로써 각 독성도에 대한 분류 기준 데이터를 생성하여 범주화 할 수 있다. 상기 학습을 마친 학습부는 학습 정보를 평가부에 제공하여 독성도를 평가할 수 있으며, 평가부 또한 학습부과 마찬가지로 인공신경망으로 구성될 수 있다. 평가부는 학습을 마친 학습부의 데이터를 받아 미지의 독성도를 가지고 있는 물벼룩을 수조에 투입하여 그림자를 추적하거나, 미지의 독성도를 가지는 오염수가 담긴 수조에 물벼룩을 투입하여 그림자 를 추적할 수 있다. 포토트랜지스터을 이용하여 추적된 그림자 데이터를 누적한 뒤에 마이크로프로세서에서 변환된 디지 털신호를 특성추출부에서 특성을 추출하여 행태정보 특성을 평가부에 제공할 수 있다. 평가부는 행태정보 특성을 받아 학습부에서 제공한 범주화된 데이터와 비교를 수행하여 오염물질의 독성도(생태독성 정보)를 평가할 수 있다. 본 발명의 대표 실시 예에서는 학습부와 평가부를 별도의 인공신경망을 이용하여 동작하는 것으로 설 명하였으나, 하나의 인공신경망을 반복적으로 이용하여 동작하거나, 학습부를 별도의 독립된 공간에 위치 시켜 복수의 생태독성 측정 장치의 데이터를 받아 학습한 뒤 이용할 수도 있다. 도 5는 본 발명의 실시 예에 따른 검지소자의 움직임을 모니터링하는 프로그램 화면으로 검지소자의 통신 포트 설정 버튼, 명령버튼, 경과시간 및 통신포트 설정표시 창, 이동경로 표시화면으로 구 성될 수 있다. 통신포트 설정 버튼은 마이크로프로세서와 PC간 전송 포트를 설정할 수 있다. 명령버튼은 PC에서 검지소자 관측 프로그램으로 지령을 송신하기 위한 Start 버튼, Pause 버튼, Stop 버튼으로 구성될 수 있다. Start 버튼은 분석 시작 명령 버튼으로, Start 버튼을 누르면 검지소자의 이동경로가 왼쪽 창에 출력되면서 경과 시간이 증가하며 생태독성 평가 장치에서 송신되는 데이터를 수신하여 이동경로 표시화면 에 이동 경로의 표시를 시작할 수 있다. Pause 버튼은 일시 정지 명령 버튼으로, Pause 버튼을 누르면 생태독성 평가 장치에서 송신되는 데이터의 수신을 중단하며, 경과 시간도 일시 정지된 상태에서 대기할 수 있다. Stop 버튼을 누르면 왼쪽 창의 정보와 경과 시간이 초기화되고 생태독성 평가 장치에서 송신되는 데 이터의 수신을 중단하며 누적된 데이터를 특성추출부에 전송할 수 있다. 또 다른 실시 예에서는, Start 버튼을 누르면 생태독성 평가 장치에서 측정한 검지소자의 이동 경로 및 경과 시간을 일정 시간 또는 실시간 단위로 특성 추출부에 전달하며, Stop 버튼을 누르면 특 성 추출부에 전달을 정지하는 구성으로 구현될 수도 있다. 경과 시간 및 통신 포트 설정 표시 창은 상기 명령버튼에서 지시한 동작 시작신호, 일시정지 신호에 따라 검지 소자의 이동 경로 측정 시간 및 현재 마이크로프로세서와 PC간의 연결을 위한 통신 포트 설정을 나타낸다. 도 6은 도 5의 프로그램에 따라 상기 검지소자의 이동경로를 보여주는 일 실시 예와 관련된 도면이다. 프로그램 좌측의 검지소자의 이동경로 표시 화면은 포토트랜지스터를 이용하여 인지된 검지소자(21 0)의 그림자 위치를 표시해주는 창으로써 일정 시간에 걸쳐 데이터를 축척하여 이동 경로를 표시할 수 있다. 도 6을 참조하면, 표준물질의 농도 또는 검지소자의 특성에 따라 서로 다른 이동 경로를 나타냄을 확인할 수 있다. 각각의 검지소자는 동일한 표준물질에 배양하더라도 서로 다른 움직임을 가지고 있어 이를 표준화 함으로 써 범주화 하는 기술이 필요하다. 본 발명의 생태독성 평가 장치는 검지소자의 움직임을 범주화 하기 위하여 검지소자의 움직임 경로에 대하여 특성을 추출하고, 특성 정보만을 학습부에 입력하여 학습하는 방법을 이용할 수 있다. 이러한 특성 정보에는 일정 시간 단위로 검지소자의 이동 방향, 속도, 벡터값, 생존 시간 등의 정보를 이 용할 수 있다. 도 7은 이러한 생태독성 물질의 생태독성 수치 값을 결정하기 위한 생태독성실험 방법을 개략적으로 나타내는 동작 흐름도이다. 인공지능 기법을 이용하여 행동 패턴을 범주화 하기 위해서는 우선적으로 생태독성 물질의 표준 값에 해당하는 표준물질의 농도를 산정하여야 한다. 본 발명의 일 실시 예에서는 한국환경공단에서 제시한 물질 별 생태독성 자료에 근거하여 EC50(반수 최대 유효 농도, Half maximal effective concentration)의 농도가 너무 높지 않으며 실험 데이터가 많고 자주 사용되는 물질 위주로 선정하여 예시하였으나, 기타 생태독성을 가지는 모든 물질에 대하여 적용할 수 있다. 상기와 같은 EC50의 농도가 너무 높지 않으며 실험 데이터가 많고 자주 사용되는 물질의 예시로는 중크롬산칼륨 (potassium dichromate, K2Cr2O7, 분자량 : 294.18), 염화칼륨(potassiumchloride, KCl, 분자량 : 74.56), 염화 카드뮴(cadmiumchloride, CdCl2, 분자량 : 183.32), 염화암모늄(ammoniumchloride, NH4Cl, 분자량 : 53.50) 이 있으며, 상기와 같은 4가지 물질로 예시하여 본 발명의 일 실시 예를 설명할 수 있다. 상기 선정된 예시 물질들은 물질 별 생태독성 자료를 조사하는 단계(S710), 상기 조사된 자료에 근거하여 초기 EC50의 농도(mg/L) 및 TU(생태독성, Toxic Unit)값에 해당되는 물질 별 농도를 산정하는 단계(S720), 온도(20± 2℃)에서 광주기를 명:암=16:8의 비율로 유지하여 물벼룩의 유영 저해 및 치사 상태를 관찰하는 초기 실험 단계 (S730), 상기 초기 EC50값과 상기 실험값의 일치 여부를 확인하는 단계(S740), 상기 초기 EC50값과 상기 실험값 이 일치하는 경우에 각 TU값에 해당되는 물질 농도 산정 단계(S750) 및 각 물질 별 TU1~5에 대한 실험을 수행(S760)하여 표준물질의 농도 산정을 수행할 수 있다. 상기 각 TU값에 해당되는 물질 농도 산정 단계는 하기의 수학식 을 이용하여 산출된 EC50(%) 값을 통해 각 TU 에 해당하는 유해물질의 농도를 산출할 수 있다. .... 수학식 또한, 상기 TU1에 해당하는 농도는 EC50의 농도 값이며, TU2~5에 해당하는 농도는 EC50의 농도값에 2 내지 5배에 해당하는 농도이다. 도 8은 본 발명의 실시 예에 따른 표준물질에 대한 생태독성 실험결과에서 구한 생태독성 값을 나타내는 도면으 로써 상기 도 7의 순서도에 따라 구한 표준 물질에 대한 생태독성 실험 결과에서 구한 24시간-EC50의 농도를 기 초로 K2Cr2O7, KCl, CdCl2, NH4Cl의 TU 1~5에 해당되는 물질의 농도를 산정하였고, 그 농도에서 정확히 예측된 TU값이 나타나는지를 확인하기 위한 실험결과이다. K2Cr2O7는 우리나라 표준 독성물질로 24시간-EC50값은 0.4 mg/L이다. KCl의 24시간-EC50 값은 다른 물질에 비해 매우 높은 1.6g/L이다. 물벼룩 배양액 제조 시에도 소량 첨가하는 물질로 비교적 독성이 낮은 물질이다. CdCl2 의 24시간-EC50 값은 1.7 mg/L, NH4Cl의 24시간-EC50 값은 220 mg/L이다. 본 발명은 상기 선정된 물질들에 대하여 수질오염공정시험기준 ES 04751.1에 따라 수행되었으며, 본 발명의 실 시 예의 검지소자 중 대표 실시 예에 해당하는 물벼룩은 생후 24시간 미만인 개체를 사용하여 수행될 수 있다. 본 발명의 일 실시 예에 따르면, 검지소자의 그림자 움직임만을 추출하기 때문에 검지소자의 움직임을 쉽게 감 지할 수 있으며, 움직임 정보를 기반으로 독성도를 학습 및 평가함으로써 움직임 정보만으로 쉽게 오염물질의 유해성을 결정할 수 있는 효과를 기대할 수 있다. 상술한 실시 예에 설명된 특징, 구조, 효과 등은 본 발명의 적어도 하나의 실시 예에 포함되며, 반드시 하나의 실시 예에 만 한정되는 것은 아니다. 나아가, 각 실시 예에 서 예시된 특징, 구조, 효과 등은 실시 예들이 속하 는 분야의 통상의 지식을 가지는 자에 의하여 다른 실시 예들에 대해서도 조합 또는 변형되어 실시 가능하다. 따라서 이러한 조합과 변형에 관계된 내용들은 본 발명의 범위에 포함되는 것으로 해석되어야 할 것이다. 또한, 이상에서 실시 예들을 중심으로 설명하였으나 이는 단지 예시일 뿐 본 발명을 한정하는 것이 아니며, 본 발명이 속하는 분야의 통상의 지식을 가진 자라면 본 실시예의 본질적인 특성을 벗어나지 않는 범위에서 이상에 예시되 지 않은 여러 가지의 변형과 응용이 가능함을 알 수 있을 것이다. 예를 들어, 실시 예들에 구체적으로 나타난 각 구성 요소는 변형하여 실시할 수 있는 것이다. 그리고 이러한 변형과 응용에 관계된 차이점들은 첨부한 청구 범위에서 규정하는 본 발명의 범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2019-0009504", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시 예에 따른 생태독성 평가 장치의 구조를 개략적으로 나타내는 구성도이다. 도 2는 본 발명의 실시 예에 따른 생태독성 평가 장치의 구조를 보다 구체적으로 나타내는 구성도이다. 도 3은 본 발명의 실시 예에 따른 인공신경망의 구조를 개략적으로 나타낸 구성도이다. 도 4는 본 발명의 실시 예에 따른 시간이 경과함에 따라 관찰된 검지소자의 움직임 수를 그래프화한 도면이다. 도 5는 본 발명의 실시 예에 따른 검지소자의 움직임을 모니터링하는 프로그램를 나타내는 도면이다. 도 6은 본 발명의 실시 예에 따른 검지소자의 움직임 측정 결과를 나타내는 도면이다. 도 7은 본 발명의 실시 예에 따른 생태독성 수치 값을 결정하기 위한 생태독성실험 방법을 개략적으로 나타내는 동작 흐름도이다. 도 8은 본 발명의 실시 예에 따른 표준물질에 대한 생태독성 실험결과에서 구한 생태독성 값을 나타내는 도면이 다."}
