{"patent_id": "10-2023-0100109", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0005823", "출원번호": "10-2023-0100109", "발명의 명칭": "관심 영역에 기반하여 카메라 이미지를 처리하는 웨어러블 장치, 방법, 및 비-일시적 컴퓨터", "출원인": "삼성전자주식회사", "발명자": "윤종민"}}
{"patent_id": "10-2023-0100109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "웨어러블 장치(200)에 있어서, 카메라(310);이미지 시그널 프로세서(320); 디스플레이(330); 및프로세서(120)를 포함하고, 상기 프로세서(120)는, 사용자 입력에 기반하여, 상기 디스플레이(330)를 통해 출력되는 제1 프레임에서 관심 영역(region ofinterest, ROI)을 식별하고, 상기 제1 프레임에 포함되는 카메라 영역은, 제1 시점의 상기 카메라(310)를 통해획득되는 제1 카메라 이미지의 적어도 일부 영역에 대응하고,상기 관심 영역이 상기 카메라 영역에 중첩됨에 기반하여, 상기 이미지 시그널 프로세서(320)가 상기 제1 시점이후의 제2 시점에 획득되는 제2 카메라 이미지를 제1 처리 방식으로 처리하도록 제어하고, 상기 관심 영역이 상기 카메라 영역을 벗어남에 기반하여, 상기 이미지 시그널 프로세서(320)가 상기 제2 카메라 이미지를 상기 제1 처리 방식과 구분되는 제2 처리 방식을 통해 처리하도록 제어하고, 및처리된 상기 제2 카메라 이미지의 적어도 일부 영역에 대응하는 상기 카메라 영역을 포함하는 제2 프레임을 상기 디스플레이(330)를 통해 표시하도록 구성되는,웨어러블 장치."}
{"patent_id": "10-2023-0100109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,센서(176)를 더 포함하고,상기 프로세서(120)는, 상기 센서(176)를 통해 식별되는 사용자의 시선을 상기 사용자 입력으로 획득하고,상기 사용자 입력으로 획득되는 상기 사용자의 시선에 기반하여 상기 ROI를 식별하도록 구성되는,웨어러블 장치."}
{"patent_id": "10-2023-0100109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1 또는 청구항 2에 있어서, 상기 프로세서(120)는상기 관심 영역이 중첩되는 상기 카메라 영역의 픽셀 값들의 변화를 나타내는 데이터가 기준 범위 밖에 있음을식별하는 것에 응답하여, 상기 이미지 시그널 프로세서(320)가 상기 카메라 영역 밖의 상기 프레임의 다른 영역의 제2 FPS(frame per second)보다 높은 제1 FPS로 상기 카메라 영역을 위한 상기 제2 카메라 이미지를 획득하도록 제어하고, 및상기 데이터가 상기 기준 범위 내에 있음을 식별하는 것에 응답하여, 상기 이미지 시그널 프로세서(320)가 상기카메라 영역을 위한 상기 제2 카메라 이미지를 상기 제2 FPS로 획득하도록 제어하도록 구성되는,공개특허 10-2025-0005823-3-웨어러블 장치."}
{"patent_id": "10-2023-0100109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1 내지 청구항 3 중 어느 한 항에 있어서, 상기 프로세서(120)는상기 데이터가 기준 범위 밖에 있음을 식별하는 것에 응답하여, 상기 이미지 시그널 프로세서(320)가 상기 제1FPS로 획득되는 상기 카메라 영역을 위한 상기 제2 카메라 이미지의 후처리를 바이패스하도록 제어하도록 구성되는,웨어러블 장치."}
{"patent_id": "10-2023-0100109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1 내지 청구항 4 중 어느 한 항에 있어서, 상기 프로세서(120)는상기 데이터가 상기 기준 범위 내에 있음을 식별하는 것에 응답하여, 상기 이미지 시그널 프로세서(320)가 상기제2 FPS로 획득되는 상기 카메라 영역을 위한 상기 제2 카메라 이미지를 후처리하도록 제어하도록 구성되는,웨어러블 장치."}
{"patent_id": "10-2023-0100109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 1 내지 청구항 5 중 어느 한 항에 있어서, 상기 프로세서(120)는 상기 관심 영역이 상기 카메라 영역을 벗어남에 기반하여, 상기 이미지 시그널 프로세서(320)가 상기 제2 카메라 이미지를 상기 제2 FPS로 획득하고, 및 상기 제2 FPS로 획득되는 상기 카메라 영역을 위한 상기 제2 카메라이미지의 후처리를 바이패스하도록 제어하도록 구성되는,웨어러블 장치."}
{"patent_id": "10-2023-0100109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 1 내지 청구항 6 중 어느 한 항에 있어서, 상기 프로세서(120)는 상기 관심 영역이 중첩되는 상기 카메라 영역의 휘도가 기준 휘도를 초과함을 식별하는 것에 응답하여, 상기 이미지 시그널 프로세서(320)가 상기 제1 시점 이후의 제2 시점에 획득되는 제2 카메라 이미지를 제1 처리 방식으로 처리하도록 제어하고, 및상기 관심 영역이 중첩되는 상기 카메라 영역의 휘도가 기준 휘도 이하임을 식별하는 것에 응답하여, 상기 이미지 시그널 프로세서(320)가 상기 카메라 영역을 위한 상기 제2 카메라 이미지를 상기 제2 처리 방식을 통해 처리하도록 제어하도록 구성되는,웨어러블 장치."}
{"patent_id": "10-2023-0100109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "공개특허 10-2025-0005823-4-청구항 1 내지 청구항 7 중 어느 한 항에 있어서, 상기 프로세서(120)는 어플리케이션을 실행함으로써 획득되는 어플리케이션 이미지에 기반한, 상기 제2 프레임을 상기 디스플레이(330) 상에서 표시하도록 구성되고, 및상기 제2 프레임은 상기 제2 카메라 이미지에 기반한 상기 카메라 영역 및 상기 어플리케이션 이미지에 기반한어플리케이션 영역을 포함하고, 상기 카메라 영역은 상기 어플리케이션의 사용 정보가 나타내는 이전에 설정된 카메라 영역에 기초하여, 설정되는,웨어러블 장치."}
{"patent_id": "10-2023-0100109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 1 내지 청구항 8 중 어느 한 항에 있어서, 상기 프로세서(120)는 상기 제1 카메라 이미지에 포함된 적어도 하나의 객체를 식별하고, 상기 식별된 적어도 하나의 객체 중 지정된 종류의 객체를 식별하고,상기 지정된 종류의 객체의 영역에 기반하여, 상기 카메라 영역을 설정하도록 구성되는,웨어러블 장치."}
{"patent_id": "10-2023-0100109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "카메라(310), 및 디스플레이(330)를 포함하는 웨어러블 장치(200)에서 수행되는 방법에 있어서,사용자 입력에 기반하여, 상기 디스플레이(330)를 통해 출력되는 제1 프레임에서 관심 영역(region ofinterest, ROI)을 식별하는 동작, 상기 제1 프레임에 포함되는 카메라 영역은, 제1 시점의 상기 카메라(310)를통해 획득되는 제1 카메라 이미지의 적어도 일부 영역에 대응하고,상기 관심 영역이 상기 카메라 영역에 중첩됨에 기반하여, 상기 제1 시점 이후의 제2 시점에 획득되는 제2 카메라 이미지를 제1 처리 방식으로 처리하는 동작, 상기 관심 영역이 상기 카메라 영역을 벗어남에 기반하여, 상기 제2 카메라 이미지를 상기 제1 처리 방식과 구분되는 제2 처리 방식을 통해 처리하는 동작, 및처리된 상기 제2 카메라 이미지의 적어도 일부 영역에 대응하는 상기 카메라 영역을 포함하는 제2 프레임을 상기 디스플레이(330)를 통해 표시하는 동작을 포함하는,방법."}
{"patent_id": "10-2023-0100109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "웨어러블 장치(200)에 있어서, 카메라(310);이미지 시그널 프로세서(320); 디스플레이(330); 및프로세서(120)를 포함하고, 상기 프로세서(120)는, 제1 시점의 상기 카메라(310)를 통해 획득되는 상기 웨어러블 장치(200) 주변의 환경에 대한 제1 카메라 이미지공개특허 10-2025-0005823-5-의 적어도 일부 영역을 카메라 영역으로 포함하는 제1 프레임을 상기 디스플레이(330) 상에서 표시하고,상기 제1 프레임이 상기 디스플레이(330) 상에서 표시되는 동안, ROI(region of interest)에 대응하는 상기 프레임 내의 상기 카메라 영역을 식별하고,상기 카메라 영역의 픽셀 값들의 변화를 나타내는 데이터가 기준 범위 밖에 있음을 식별하는 것에 응답하여, 상기 이미지 시그널 프로세서(320)가 상기 카메라 영역 밖의 상기 프레임의 영역의 제2 FPS(frame per second)보다 높은 제1 FPS로 상기 카메라 영역을 위한 상기 카메라 이미지들을 획득하도록 제어하고, 및상기 데이터가 상기 기준 범위 내에 있음을 식별하는 것에 응답하여, 상기 이미지 시그널 프로세서(320)가 상기카메라 영역을 위한 상기 카메라 이미지들을 상기 제2 FPS로 획득하도록 제어하도록 구성되는,웨어러블 장치."}
{"patent_id": "10-2023-0100109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 11에 있어서, 상기 프로세서(120)는, 상기 데이터가 기준 범위 밖에 있음을 식별하는 것에 응답하여, 상기 이미지 시그널 프로세서(320)가 상기 제1FPS로 획득되는 상기 카메라 영역을 위한 상기 카메라 이미지들의 후처리를 바이패스하도록 제어하도록 구성되는,웨어러블 장치."}
{"patent_id": "10-2023-0100109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 11, 또는 청구항 12에 있어서, 상기 프로세서(120)는, 상기 데이터가 상기 기준 범위 내에 있음을 식별하는 것에 응답하여, 상기 이미지 시그널 프로세서(320)가 상기제2 FPS로 획득되는 상기 카메라 이미지들을 후처리하도록 제어하도록 구성되는,"}
{"patent_id": "10-2023-0100109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 11 내지 청구항 13 중 어느 한 항에 있어서, 센서(176)를 더 포함하고,상기 프로세서(120)는, 상기 센서(176)를 통해 사용자 입력을 상기 사용자 입력으로 획득하고,상기 사용자 입력으로 획득되는 상기 사용자의 시선에 기반하여, 상기 ROI를 식별하도록 구성되는,웨어러블 장치."}
{"patent_id": "10-2023-0100109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "청구항 11 또는 청구항 14 중 어느 한 항에 있어서, 상기 프로세서(120)는,상기 카메라 영역의 휘도가 기준 휘도 이하임을 식별하는 것에 응답하여, 상기 이미지 시그널 프로세서(320)가상기 제2 FPS로 상기 카메라 영역을 위한 상기 카메라 이미지들을 획득하고, 및 상기 제2 FPS로 획득되는 상기카메라 영역을 위한 상기 카메라 이미지들의 후처리를 바이패스하도록 제어하고,공개특허 10-2025-0005823-6-웨어러블 장치."}
{"patent_id": "10-2023-0100109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "청구항 11 내지 청구항 14 중 어느 한 항에 있어서, 상기 프로세서(120)는 상기 카메라 영역의 휘도가 기준 휘도를 초과함을 식별하는 것에 응답하여, 상기 이미지 시그널 프로세서(320)가 상기 카메라 영역의 변화를 나타내는 상기 데이터에 기반하여 상기 카메라 영역을 처리하도록 제어하도록 구성되는웨어러블 장치."}
{"patent_id": "10-2023-0100109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "청구항 11 내지 청구항 16 중 어느 한 항에 있어서, 상기 프로세서(120)는어플리케이션을 실행함으로써 획득되는, 제1 어플리케이션 이미지에 기반하는, 상기 제1 프레임을 상기 디스플레이(330) 상에서 표시하고, 및상기 제1 프레임은 상기 제1 카메라 이미지에 기반한 카메라 영역 및 상기 제1 어플리케이션 이미지에 기반한어플리케이션 영역을 포함하고, 상기 제1 프레임의 상기 카메라 영역은 상기 어플리케이션 영역에 중첩되는웨어러블 장치."}
{"patent_id": "10-2023-0100109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "청구항 11 내지 청구항 17 중 어느 한 항에 있어서, 상기 카메라 영역은 상기 어플리케이션의 사용 정보가 나타내는 이전에 설정된 카메라 영역에 기초하여, 설정되는,웨어러블 장치."}
{"patent_id": "10-2023-0100109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "청구항 11 내지 청구항 16 중 어느 한 항에 있어서, 상기 프로세서(120)는 상기 카메라 이미지들에 기반하여, 적어도 하나의 객체를 식별하고,상기 식별된 적어도 하나의 객체 중 지정된 종류의 객체를 식별하고, 및상기 지정된 종류의 객체의 영역에 기반하여, 상기 카메라 영역을 설정하도록 구성되는,웨어러블 장치."}
{"patent_id": "10-2023-0100109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "카메라(310), 및 디스플레이(330)를 포함하는 웨어러블 장치(200)에서 수행되는 방법에 있어서,공개특허 10-2025-0005823-7-제1 시점의 상기 카메라(310)를 통해 획득되는 상기 웨어러블 장치(200) 주변의 환경에 대한 제1 카메라 이미지의 적어도 일부 영역을 카메라 영역으로 포함하는 제1 프레임을 상기 디스플레이(330) 상에서 표시하는 동작, 상기 제1 프레임이 상기 디스플레이(330) 상에서 표시되는 동안, ROI(region of interest)에 대응하는 상기 프레임 내의 상기 카메라 영역을 식별하는 동작, 상기 카메라 영역의 픽셀 값들의 변화를 나타내는 데이터가 기준 범위 밖에 있음을 식별하는 것에 응답하여, 상기 카메라 영역 밖의 상기 프레임의 영역의 제2 FPS(frame per second)보다 높은 제1 FPS로 상기 카메라 영역을위한 상기 카메라 이미지들을 획득하는 동작, 및 상기 데이터가 상기 기준 범위 내에 있음을 식별하는 것에 응답하여, 상기 카메라 영역을 위한 상기 카메라 이미지들을 상기 제2 FPS로 획득하는 동작을 포함하는 방법."}
{"patent_id": "10-2023-0100109", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "웨어러블 장치(wearable device)가 제공된다. 상기 웨어러블 장치에 포함되는 프로세서는, 사용자 입력에 기반하 여, 디스플레이를 통해 출력되는 제1 프레임에서 관심 영역(region of interest, ROI)을 식별하도록 구성될 수 있다. 상기 제1 프레임에 포함되는 카메라 영역은, 제1 시점의 카메라를 통해 획득되는 제1 카메라 이미지의 적 (뒷면에 계속)"}
{"patent_id": "10-2023-0100109", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "아래의 설명들은, 관심 영역(region of interest, ROI)에 기반하여 카메라 이미지를 처리하는 웨어러블 장치 (wearable device), 방법, 및 비-일시적 컴퓨터 판독 가능 저장 매체(non-transitory computer readable storage medium)에 관한 것이다."}
{"patent_id": "10-2023-0100109", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "강화된(enhanced) 사용자 경험(user experience)을 제공하기 위해, 실제 세계(real-world) 내 외부 객체와 연 계로 컴퓨터에 의해 생성된 정보를 표시하는 증강 현실(augmented reality, AR) 서비스를 제공하는 전자 장치가 개발되고 있다. 상기 전자 장치는, 사용자에 의해 착용될 수 있는 웨어러블 장치일 수 있다. 예를 들면, 상기 전자 장치는, AR 안경(glasses), 및/또는 머리 착용형 장치(head-mounted device, HMD)일 수 있다. 상술한 정보는 본 개시에 대한 이해를 돕기 위한 목적으로 하는 배경 기술(related art)로 제공될 수 있다. 상 술한 내용 중 어느 것도 본 개시와 관련된 종래 기술(prior art)로서 적용될 수 있는지에 대하여 어떠한 주장이 나 결정이 제기되지 않는다."}
{"patent_id": "10-2023-0100109", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "웨어러블 장치(wearable device)가 제공된다. 상기 웨어러블 장치는, 카메라를 포함할 수 있다. 상기 웨어러블 장치는 디스플레이를 포함할 수 있다. 상기 웨어러블 장치는 이미지 시그널 프로세서를 포함할 수 있다. 상기 웨어러블 장치는 프로세서를 포함할 수 있다. 상기 프로세서는, 사용자 입력에 기반하여, 상기 디스플레이를 통 해 출력되는 제1 프레임에서 관심 영역(region of interest, ROI)을 식별하도록 구성될 수 있다. 상기 제1 프레 임에 포함되는 카메라 영역은, 제1 시점의 상기 카메라를 통해 획득되는 제1 카메라 이미지의 적어도 일부 영역 에 대응할 수 있다. 상기 프로세서는, 상기 관심 영역이 상기 카메라 영역에 중첩됨에 기반하여, 상기 이미지 시그널 프로세서가 상기 제1 시점 이후의 제2 시점에 획득되는 제2 카메라 이미지를 제1 처리 방식으로 처리하 도록 제어하도록 구성될 수 있다. 상기 프로세서는, 상기 관심 영역이 상기 카메라 영역을 벗어남에 기반하여, 상기 이미지 시그널 프로세서가 상기 제2 카메라 이미지를 상기 제1 처리 방식과 구분되는 제2 처리 방식을 통 해 처리하도록 제어하도록 구성될 수 있다. 상기 프로세서는, 처리된 상기 제2 카메라 이미지의 적어도 일부 영 역에 대응하는 상기 카메라 영역을 포함하는 제2 프레임을 상기 디스플레이를 통해 표시하도록 구성될 수 있다. 방법이 제공된다. 상기 방법은 카메라, 및 디스플레이를 포함하는 웨어러블 장치에서 실행될 수 있다. 상기 방 법은, 사용자 입력에 기반하여, 상기 디스플레이를 통해 출력되는 제1 프레임에서 관심 영역(region of interest, ROI)을 식별하는 동작을 포함할 수 있다. 상기 제1 프레임에 포함되는 카메라 영역은, 제1 시점의 상 기 카메라를 통해 획득되는 제1 카메라 이미지의 적어도 일부 영역에 대응할 수 있다. 상기 방법은 상기 관심 영역이 상기 카메라 영역에 중첩됨에 기반하여, 상기 제1 시점 이후의 제2 시점에 획득되는 제2 카메라 이미지 를 제1 처리 방식으로 처리하는 동작을 포함할 수 있다. 상기 방법은 상기 관심 영역이 상기 카메라 영역을 벗 어남에 기반하여, 상기 제2 카메라 이미지를 상기 제1 처리 방식과 구분되는 제2 처리 방식을 통해 처리하는 동작을 포함할 수 있다. 상기 방법은 처리된 상기 제2 카메라 이미지의 적어도 일부 영역에 대응하는 상기 카메라 영역을 포함하는 제2 프레임을 상기 디스플레이를 통해 표시하는 동작을 포함할 수 있다. 비일시적 컴퓨터 판독가능 저장 매체(non-transitory computer readable storage medium)가 제공된다. 상기 비 일시적 컴퓨터 판독가능 저장 매체는 인스트럭션들을 포함하는 하나 이상의 프로그램들을 저장할 수 있다. 상기 인스트럭션들은, 카메라, 및 디스플레이를 포함하는 웨어러블 장치의 프로세서에 의해 실행될 시, 사용자 입력 에 기반하여, 상기 디스플레이를 통해 출력되는 제1 프레임에서 관심 영역(region of interest, ROI)을 식별하 도록 야기될 수 있다. 상기 제1 프레임에 포함되는 카메라 영역은, 제1 시점의 상기 카메라를 통해 획득되는 제 1 카메라 이미지의 적어도 일부 영역에 대응할 수 있다. 상기 인스트럭션들은, 프로세서에 의해 실행될 시, 상 기 웨어러블 장치가 상기 관심 영역이 상기 카메라 영역에 중첩됨에 기반하여, 상기 이미지 시그널 프로세서가 상기 제1 시점 이후의 제2 시점에 획득되는 제2 카메라 이미지를 제1 처리 방식으로 처리하도록 제어하도록 야 기할 수 있다. 상기 인스트럭션들은, 프로세서에 의해 실행될 시, 상기 웨어러블 장치가 상기 관심 영역이 상기 카메라 영역을 벗어남에 기반하여, 상기 이미지 시그널 프로세서가 상기 제2 카메라 이미지를 상기 제1 처리 방 식과 구분되는 제2 처리 방식을 통해 처리하도록 제어하도록 야기할 수 있다. 상기 인스트럭션들은, 프로세서에 의해 실행될 시, 상기 웨어러블 장치가 처리된 상기 제2 카메라 이미지의 적어도 일부 영역에 대응하는 상기 카 메라 영역을 포함하는 제2 프레임을 상기 디스플레이를 통해 표시하도록 야기할 수 있다. 웨어러블 장치(wearable device)가 제공된다. 상기 웨어러블 장치는, 카메라를 포함할 수 있다. 상기 웨어러블 장치는 디스플레이를 포함할 수 있다. 상기 웨어러블 장치는 이미지 시그널 프로세서를 포함할 수 있다. 상기 웨어러블 장치는 프로세서를 포함할 수 있다. 상기 프로세서는, 제1 시점의 상기 카메라를 통해 획득되는 상기 웨어러블 장치 주변의 환경에 대한 제1 카메라 이미지의 적어도 일부 영역을 카메라 영역으로 포함하는 제1 프 레임을 상기 디스플레이 상에서 표시하도록 구성될 수 있다. 상기 프로세서는 상기 제1 프레임이 상기 디스플레 이 상에서 표시되는 동안, ROI(region of interest)에 대응하는 상기 프레임 내의 상기 카메라 영역을 식별하도 록 구성될 수 있다. 상기 프로세서는 상기 카메라 영역의 픽셀 값들의 변화를 나타내는 데이터가 기준 범위 밖 에 있음을 식별하는 것에 응답하여, 상기 이미지 시그널 프로세서가 상기 카메라 영역 밖의 상기 프레임의 영역 의 제2 FPS(frame per second)보다 높은 제1 FPS로 상기 카메라 영역을 위한 상기 카메라 이미지들을 획득하도 록 제어하도록 구성될 수 있다. 상기 프로세서는 상기 데이터가 상기 기준 범위 내에 있음을 식별하는 것에 응 답하여, 상기 이미지 시그널 프로세서가 상기 카메라 영역을 위한 상기 카메라 이미지들을 상기 제2 FPS로 획득 하도록 제어하도록 구성될 수 있다. 방법이 제공된다. 상기 방법은 카메라, 및 디스플레이를 포함하는 웨어러블 장치에서 실행될 수 있다. 상기 방 법은, 제1 시점의 상기 카메라를 통해 획득되는 상기 웨어러블 장치 주변의 환경에 대한 제1 카메라 이미지의 적어도 일부 영역을 카메라 영역으로 포함하는 제1 프레임을 상기 디스플레이 상에서 표시하는 동작을 포함할 수 있다. 상기 방법은, 상기 제1 프레임이 상기 디스플레이 상에서 표시되는 동안, ROI(region of interest)에 대응하는 상기 프레임 내의 상기 카메라 영역을 식별하는 동작을 포함할 수 있다. 상기 방법은, 상기 카메라 영 역의 픽셀 값들의 변화를 나타내는 데이터가 기준 범위 밖에 있음을 식별하는 것에 응답하여, 상기 카메라 영역 밖의 상기 프레임의 영역의 제2 FPS(frame per second)보다 높은 제1 FPS로 상기 카메라 영역을 위한 상기 카메 라 이미지들을 획득하는 동작을 포함할 수 있다. 상기 방법은, 상기 데이터가 상기 기준 범위 내에 있음을 식별 하는 것에 응답하여, 상기 카메라 영역을 위한 상기 카메라 이미지들을 상기 제2 FPS로 획득하는 동작을 포함할 수 있다. 비일시적 컴퓨터 판독가능 저장 매체(non-transitory computer readable storage medium)가 제공된다. 상기 비 일시적 컴퓨터 판독가능 저장 매체는 인스트럭션들을 포함하는 하나 이상의 프로그램들을 저장할 수 있다. 상기 인스트럭션들은, 카메라, 및 디스플레이를 포함하는 웨어러블 장치의 프로세서에 의해 실행될 시, 상기 웨어러 블 장치가, 사용자 입력에 기반하여, 상기 디스플레이를 통해 출력되는 제1 프레임에서 관심 영역(region of interest, ROI)을 식별하도록 구성될 수 있다. 상기 제1 프레임에 포함되는 카메라 영역은, 제1 시점의 상기 카 메라를 통해 획득되는 제1 카메라 이미지의 적어도 일부 영역에 대응할 수 있다. 상기 인스트럭션들은, 상기 프 로세서에 의해 실행될 시, 상기 웨어러블 장치가, 상기 관심 영역이 상기 카메라 영역에 중첩됨에 기반하여, 상 기 이미지 시그널 프로세서가 상기 제1 시점 이후의 제2 시점에 획득되는 제2 카메라 이미지를 제1 처리 방식으 로 처리하도록 제어하도록 구성될 수 있다. 상기 인스트럭션들은, 상기 프로세서에 의해 실행될 시, 상기 웨어 러블 장치가, 상기 관심 영역이 상기 카메라 영역을 벗어남에 기반하여, 상기 이미지 시그널 프로세서가 상기 제2 카메라 이미지를 상기 제1 처리 방식과 구분되는 제2 처리 방식을 통해 처리하도록 제어하도록 구성될 수 있다. 상기 인스트럭션들은, 상기 프로세서에 의해 실행될 시, 상기 웨어러블 장치가, 처리된 상기 제2 카메라이미지의 적어도 일부 영역에 대응하는 상기 카메라 영역을 포함하는 제2 프레임을 상기 디스플레이를 통해 표 시하도록 구성될 수 있다."}
{"patent_id": "10-2023-0100109", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 도면을 참조하여 본 개시의 실시예에 대하여 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 개시는 여러 가지 상이한 형태로 구현될 수 있으 며 여기에서 설명하는 실시예에 한정되지 않는다. 도면의 설명과 관련하여, 동일하거나 유사한 구성요소에 대해 서는 동일하거나 유사한 참조 부호가 사용될 수 있다. 또한, 도면 및 관련된 설명에서는, 잘 알려진 기능 및구성에 대한 설명이 명확성과 간결성을 위해 생략될 수 있다. 도 1은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네트워크 환경에서 전자 장치는 제1 네트워크(예: 근거리 무선 통신 네트워크)를 통하여 전자 장치와 통신하거나, 또는 제2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장치 또는 서버 중 적어도 하나와 통신할 수 있다. 일실시예에 따르면, 전자 장치 는 서버를 통하여 전자 장치와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 프로세서 , 메모리, 입력 모듈, 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스, 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터 리, 통신 모듈, 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서 는, 전자 장치에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어떤 실시예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈 , 또는 안테나 모듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세서 는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메 모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메 모리에 저장할 수 있다. 일실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또 는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처 리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서 를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능에 특 화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있 다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)과 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구 성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일실시예에 따르면, 보조 프로 세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능 모델이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi- supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않 는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있 다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상 기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일실시예 에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일실시예에 따르면, 인터페이스는, 예 를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터 페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일실시예에 따르면, 카메라 모듈은 하나 이상 의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일실시예에 따르면, 전력 관리 모듈 은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일실시예에 따르면, 배터리 는, 예를 들면, 재충전 불가능한 6차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일실시예에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제1 네트워크(예: 블 루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워크) 또는 제2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통 신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된가입자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제1 네트워크 또는 제2 네트워크와 같은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO(full dimensional MIMO)), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안 테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전 자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제2 네트워크)에 규정되는 다양한 요구사항을 지 원할 수 있다. 일실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이 상), mMTC 실현을 위한 손실 Coverage(예: 664dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링 크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 6ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이 루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일실시예에 따르면, 안테나 모듈은 복수의 안테나들 (예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제1 네트워크 또는 제2 네트워크와 같은 통신 네 트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모 듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품 (예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제1 면(예: 아래 면)에 또는 그에 인접하여 배치 되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일실시예에 따르면, 명령 또는 데이터는 제2 네트워크에 연결된 서버를 통해서 전자 장치와 외 부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가 적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상 기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전 자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제 공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용 한 지능형 서버일 수 있다. 일실시예에 따르면, 외부의 전자 장치 또는 서버는 제2 네트워크 내 에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 외부 전자 장치들(102, 104) 각각은 전자 장치와 동일한 또는 다른 종류의 장치일 수 있다. 일 실시 예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부 전자 장치들(102, 104) 중 적어도 하나 에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 수행할 경우, 전자 장치는 기 능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로 하나 이상의 외부 전자 장치들(102, 104)에게 그 기능 또는 그 서비스의 적어도 일부의 수행을 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부 전자 장치들(102, 104)은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스 를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제공할 수 있다. 예들 들어, 외부 전자 장치 는 어플리케이션에서 실행한 컨텐츠 데이터를 렌더링 후 전자 장치에 전달하고, 상기 데이터를 수신한 전자 장치는 상기 컨텐츠 데이터를 디스플레이 모듈에 출력할 수 있다. 만일, 전자 장치(10 1)가 센서 모듈(예: IMU(inertial measurement unit) 센서)을 통해 사용자 움직임을 감지하면 전자 장치 의 프로세서는 외부 전자장치로부터 수신한 렌더링 데이터를 상기 움직임 정보를 기반으로 보정 하여 디스플레이 모듈에 출력할 수 있다. 또는 프로세서는 외부 전자 장치에 상기 움직임 정보 를 전달하여 이에 따라 화면 데이터가 갱신되도록 렌더링을 요청할 수 있다. 일 실시 예에 따라 외부 전자 장치 는 전자 장치를 보관하고 충전할 수 있는 케이스(case) 장치를 포함한 다양한 형태의 장치일 수 있다. 도 2a는, 웨어러블 장치의 제1 면의 외관의 일 예를 도시한다. 도 2b는, 웨어러블 장치의 제2 면의 외관의 일 예를 도시한다. 도 2c는, 웨어러블 장치의 제1 면의 외관의 일 예를 도시한다. 도 2d는, 웨어러블 장치의 제2 면의 외관의 일 예를 도시한다 도 2a 내지 도 2d의 웨어러블 장치는, 도 1에서 설명된 전자 장치일 수 있다. 웨어러블 장치의 하우징의 제1 면의 외관의 일 예가 도 2a 및 도 2c에 도시되고, 상기 제1 면의 반대되는(opposite to) 제2 면의 외관의 일 예가 도 2b 및 도 2d에 도시될 수 있다. 도 2a 및 도 2c를 참고하면, 일 실시예에 따른, 웨어러블 장치의 제1 면은, 사용자의 신체 부위(예, 상기 사용자의 얼굴) 상에 부착가능한(attachable) 형태를 가질 수 있다. 비록 도시되지 않았지만, 웨어러블 장 치는, 사용자의 신체 부위 상에 고정되기 위한 스트랩, 및/또는 하나 이상의 템플들(temples)을 더 포함할 수 있다. 사용자의 양 눈들 중에서 좌측 눈으로 이미지를 출력하기 위한 제1 디스플레이(250-1), 및 상기 양 눈들 중에서 우측 눈으로 이미지를 출력하기 위한 제2 디스플레이(250-2)가 제1 면 상에 배치될 수 있다. 웨어러블 장 치는 제1 면 상에 형성되고, 상기 제1 디스플레이(250-1), 및 상기 제2 디스플레이(250-2)로부터 방 사되는 광과 상이한 광(예, 외부 광(ambient light))에 의한 간섭을 방지하기 위한, 고무, 또는 실리콘 패킹 (packing)을 더 포함할 수 있다. 상기 제1 디스플레이(250-1), 및 상기 제2 디스플레이(250-2) 각각은 액정 표시 장치(liquid crystal display; LCD), 디지털 미러 표시 장치(digital mirror device; DMD), 실리콘 액정 표시 장치(liquid crystal on silicon; LCoS), 유기 발광 다이오드(organic light emitting diode; OLED) 또는 마이크로 엘이디(micro light emitting diode; micro LED) 중 적어도 하나를 포함할 수 있다. 상기 제1 디스플레이(250-1), 및 상기 제2 디스플레이(250-2) 각각이 액정 표시 장치, 디지털 미러 표시 장치 또는 실리콘 액정 표시 장치 중 적어도 하나로 이루어지는 경우, 웨어러블 장치는 상기 제1 디스플레이 (250-1), 및 상기 제2 디스플레이(250-2) 각각의 화면 출력 영역으로 빛을 조사하는 광원을 포함할 수 있다. 상기 제1 디스플레이(250-1), 및 상기 제2 디스플레이(250-2) 각각이 자체적으로 빛을 발생시킬 수 있는 경우, 웨어러블 장치는 별도의 광원을 포함하지 않을 수 있다. 여기에서, 유기 발광 다이오드 또는 마이크로 엘 이디 중 적어도 하나로 이루어지는 경우, 상기 제1 디스플레이(250-1), 및 상기 제2 디스플레이(250-2) 각각이 자체적으로 빛을 발생시킬 수 있다. 일 실시 예에서, 상기 제1 디스플레이(250-1), 및 상기 제2 디스플레이 (250-2) 각각이 유기 발광 다이오드 또는 마이크로 엘이디로 구현될 시, 광원의 무게만큼 웨어러블 장치가 경량화될 수 있다. 상기 제1 디스플레이(250-1), 및 상기 제2 디스플레이(250-2) 각각은 렌즈를 더 포함할 수 있다. 렌즈는 디스플 레이들(250-1, 250-2)로 출력되는 화면을 사용자의 눈에 보이도록 초점을 조절할 수 있다. 예를 들면 렌즈는 프레넬(Fresnel) 렌즈, 팬케이크(pancake) 렌즈, 또는 멀티 채널 렌즈를 포함할 수 있다. 일 실시예에 따른, 웨어러블 장치는, 상기 제1 디스플레이(250-1), 및 상기 제2 디스플레이(250-2) 각각에 인접한 사용자의 양 눈들을 촬영, 및/또는 추적하기 위한 카메라들(240-1, 240-2)을 포함할 수 있다. 상기 카메 라들(240-1, 240-2)은, ET(eye tracking) 카메라로 참조될 수 있다. 일 실시예에 따른, 웨어러블 장치는, 사용자의 얼굴을 촬영, 및/또는 인식하기 위한 카메라들(240-3, 240-4, 240-11)을 포함할 수 있다. 상기 카메라 들(240-3, 240-4, 240-11)은, FT(face tracking) 카메라로 참조될 수 있다. 상기 카메라들(240-3, 240-4)은, 웨어러블 장치를 착용한 사용자의 얼굴 표정을 검출하는데 이용되는 이미지를 촬영할 수 있다. 일 실시 예 에 따르면, 카메라들(240-1, 240-2, 240-3, 240-4, 240-11)은 GS(global shutter) 카메라일 수 있다. 도 2b 및 도 2d를 참고하면, 도 2a 및 도 2c의 제1 면과 반대되는 제2 면 상에, 웨어러블 장치(20 0)의 외부 환경과 관련된 정보를 획득하기 위한 카메라(예, 카메라들(240-5, 240-6, 240-7, 240-8, 240-9, 240-10)), 및/또는 센서(예, 깊이 센서)가 배치될 수 있다. 예를 들어, 카메라들(240-5, 240-6, 240-7, 240-8, 240-9, 240-10)은, 웨어러블 장치과 상이한 외부 객체를 인식하기 위하여, 제2 면 상에 배치 될 수 있다. 예를 들어, 카메라들(240-9, 240-10)을 이용하여, 웨어러블 장치는 사용자의 양 눈들 각각으 로 송신될 이미지, 및/또는 비디오를 획득할 수 있다. 카메라(240-9)는, 상기 양 눈들 중에서 우측 눈에 대응하 는 제2 디스플레이(250-2)를 통해 표시될 이미지를 획득하도록, 웨어러블 장치의 제2 면 상에 배치될 수 있다. 카메라(240-10)는, 상기 양 눈들 중에서 좌측 눈에 대응하는 제1 디스플레이(250-1)를 통해 표시될 이 미지를 획득하도록, 웨어러블 장치의제2 면 상에 배치될 수 있다. 카메라들(240-5, 240-6, 240-7, 240-8)은, 3DoF(degrees of freedom), 6DoF의 머리 추적(head tracking), 손 검출 및 추적 및 공간인식을 위해 사용될 수 있다. 카메라들(240-5, 240-6, 240-7, 240-8)은, GS 카메라일 수 있다. 카메라들(240-5, 240-6, 240-7, 240-8)은, 6DoF를 위한 공간인식, 깊이 촬영을 통한 SLAM(simultaneous localization and mapping) 기능을 위해 이용될 수 있다. 또한 카메라들(240-5, 240-6, 240-7, 240-8)은, 사용 자 제스처 인식 기능을 위해 이용될 수 있다. 카메라들(240-9, 240-10)은, HR(high resolution) 또는 PV(photo video)를 위한 고해상도의 카메라일 수 있다. 카메라들(240-9, 240-10)은, AF(auto focus) 기능과 IS(image stabilization)(예: 광학식 IS(optical IS, OIS), 디지털 IS(digital IS, DIS))) 기능을 지원할 수 있다. 카메라들(240-9, 240-10)은, GS 카메라일 수 있 다. 하지만, 이에 제한되지 않는다. 카메라들(240-9, 240-10)은, RS(rolling shutter) 카메라일 수 있다. 일 실시예에 따른, 웨어러블 장치는, 웨어러블 장치, 및 외부 객체 사이의 거리를 식별하기 위하여 제2 면 상에 배치된 깊이 센서를 포함할 수 있다. 깊이 센서를 이용하여, 웨어러블 장치는, 웨어러블 장치를 착용한 사용자의 시야(field of view, FoV)의 적어도 일부분에 대한 공간 정보(spatial information)(예, 깊이 맵(depth map))를 획득할 수 있다. 깊이 센서는 TOF(time of flight) 센서로 지칭될 수 있다. TOF는 신호(근적외선, 초음파, 레이저 등)를 이용하여 대상의 거리를 측정하기 위한 기법을 지칭할 수 있다. 비록 도시되지 않았지만, 웨어러블 장치의 제2 면 상에, 외부 객체로부터 출력된 소리를 획득하기 위 한 마이크가 배치될 수 있다. 마이크의 개수는, 실시예에 따라 하나 이상일 수 있다. 상술한 바와 같이, 일 실시예에 따른, 웨어러블 장치는 사용자의 머리에 착용되기 위한 폼 팩터를 가질 수 있다. 웨어러블 장치는, 상기 머리에 착용된 상태 내에서, 증강 현실, 가상 현실, 및/또는 혼합 현실에 기 반하는 사용자 경험을 제공할 수 있다. 외부 공간에 대한 비디오를 레코딩하기 위한 카메라들(240-5, 240-6, 240-7, 240-8, 240-9, 240-10)을 이용하여, 웨어러블 장치, 및 웨어러블 장치에 연결된 서버(예, 도 1의 서버)는 사용자에 의해 선택된 위치(location), 및/또는 장소(place)의 비디오를 제공하는 주문형 서 비스, 및/또는 메타버스 서비스를 제공할 수 있다. 일 실시예에 따른, 웨어러블 장치는, 제1 디스플레이(250-1), 및 제2 디스플레이(250-2) 각각에, 카메라들 (240-9, 240-10)을 통해 획득된 프레임들을 표시할 수 있다. 웨어러블 장치는 제1 디스플레이(250-1), 및 제2 디스플레이(250-2)를 통해 표시되고, 실제 객체를 포함하는 프레임 내에, 가상 객체를 결합하여, 사용자에 게 실제 객체, 및 가상 객체가 혼합된 사용자 경험(예, VST(video see-through))을 제공할 수 있다. 웨어러블 장치는, 카메라들(240-1, 240-2, 240-3, 240-4, 240-5, 240-6, 240-7, 240-8), 및/또는 깊이 센서에 의하여 획득된 정보에 기반하여, 상기 가상 객체를 변경할 수 있다. 예를 들어, 상기 프레임 내에서 실제 객체에 대응하는 시각적 객체, 및 가상 객체가 적어도 부분적으로 중첩된 경우, 웨어러블 장치는 실제 객체와 상호작용하기 위한 모션을 탐지하는 것에 기반하여, 상기 가상 객체를 표시하는 것을 중단할 수 있다. 상기 가 상 객체를 표시하는 것을 중단하여, 웨어러블 장치는, 실제 객체에 대응하는 상기 시각적 객체가 상기 가 상 객체에 의하여 가려짐(occluded by)에 따라, 상기 실제 객체의 가시성(visibility)이 저하되는 것을 방지할 수 있다. 이하에서는, 도 3a 및 도 3b를 참고하여, 도 2a 내지 도 2b의 웨어러블 장치를 포함하는 전자 장치(예, 도 1의 전자 장치)가, 수행하는 동작의 일 예를 설명한다. 도 3a는, 웨어러블 장치의 간략화된 블록도이다. 도 3b는, 웨어러블 장치의 카메라 이미지 처리를 위 한 구성 요소들의 예를 도시한다. 도 3a 및 도 3b의 설명에는 도 1, 도 2a 및 도 2b를 통해 설명된 전자 장치 또는 웨어러블 장치의 구 성 요소 또는 구조가 참조될 수 있다. 도 3a를 참조하면, 웨어러블 장치는 프로세서, 메모리, 카메라, 이미지 시그널 프로세서 (image signal processor, ISP), 및 디스플레이를 포함할 수 있다. 예를 들면, 카메라는 도 1 의 카메라 모듈에 포함될 수 있다. 예를 들면, 카메라는 도 2b의 카메라들(240-9, 240-10) 각각에 대 응될 수 있다. 예를 들면, 이미지 시그널 프로세서는 도 1의 보조 프로세서에 대응될 수 있다. 예를 들면, 디스플레이는 도 1의 디스플레이 모듈에 포함될 수 있다. 예를 들면, 디스플레이는 도 2a 의 디스플레이들(250-1, 250-2) 각각에 대응될 수 있다. 카메라는 웨어러블 장치 주변의 환경에 대한 이미지를 획득할 수 있다. 여기에서, 카메라는 외 부 객체를 인식하기 위하여, 웨어러블 장치의 제2 면 상에 배치된 카메라들(240-9, 240-10)일 수 있 다. 도 3b를 참조하면, 카메라는 렌즈 및 이미지 센서를 포함할 수 있다. 렌즈는 촬영의 대상이 되는 객체, 풍경에 의해 반사된 빛을 집광할 수 있다. 렌즈는 복수의 렌즈들이 광축 방향으로 정렬된 렌즈 어셈블리로 구현될 수 있다. 렌즈 어셈블리에 포함된 렌즈들은 동일한 렌즈 속성(예: 화각, 초점 거리, 또는 f 넘버(f number))을 갖거나, 또는 적어도 하나의 렌즈는 다른 렌즈 렌즈와 적 어도 하나의 다른 렌즈 속성을 가질 수 있다. 렌즈 어셈블리는, 예를 들면, 광각 렌즈 또는 망원 렌즈를 포함할 수 있다. 렌즈는, 예컨대, 액츄에이터(미도시)에 의해 이동할 수 있다. 렌즈의 이동에 따라 렌즈의 위치 가 변함으로써, 렌즈의 초점 거리가 변할 수 있다. 그 결과, 객체에 대한 초점이 조절될 수 있다. 이미지 센서는 객체에 대한 컬러 정보를 획득하기 위한 픽셀들을 포함할 수 있다. 이미지 센서는 복 수의 픽셀들이 격자 형상으로 2차원 배열된 픽셀 어레이를 포함할 수 있다. 상기 복수의 픽셀들 각각에는 복수 의 기준 색들 중 하나가 할당될 수 있다. 예를 들면, 상기 복수의 픽셀들 각각에는 컬러 필터에 의해 복수의 기 준 색들 중 하나가 할당될 수 있다. 예를 들면, 상기 복수의 기준 색들은, RGB(red, green, blue), RGBW(red, green, blue, white), CMY(cyan, magenta, yellow), CMYK(cyan, magenta, yellow, black), 또는 RYB(red, yellow, blue), RGB IR광(infrared ray)일 수 있다. 예를 들면, 컬러 필터는 베이어(bayer) 패턴으로 형성될 수 있다. 하지만, 이에 제한되지 않는다. 예를 들면, 컬러 필터는 RGB, CYYM, CYGM, RGBW, RYYB, 또는 X-trans 의 패턴으로 형성될 수 있다. 실시 예에 따라, 상기 복수의 픽셀들 각각은 복수의 기준 색들 모두를 수광 할 수 있다. 예를 들면, 상기 복수의 픽셀들 각각은 기준 색들에 대한 전기적 신호들을 모두 생성할 수도 있다. 이미지 센서는 RGB 센서, BW(black and white) 센서, IR 센서, 또는 UV 센서를 포함할 수 있다. 이미지 센서는 CCD(charge coupled device), 또는 CMOS(complementary metal oxide semiconductor)를 포함할 수 있다. 이미지 센서의 픽셀들은 렌즈를 통해 수신되는 빛에 기초하여 디지털 신호(또는 전기적 신호)를 생성 할 수 있다. 이미지 센서는 피사체로부터 반사되는 빛을 기반으로 디지털 신호(또는 전기적 신호)를 생성 할 수 있다. 이미지 센서는 상기 전기적 신호를 기반으로 원시 디지털 이미지 데이터(이하, '원시 이미지(raw image)' 라 함)를 생성할 수 있다. 이미지 센서는 객체에 대한 컬러 정보를 포함하는 원시 이미지를 출력할 수 있 다. 예를 들면, 이미지 센서에서 출력하는 원시 이미지는 이미지 픽셀들 각각이 할당된 색상 값을 나타낼 수 있다. 예를 들면, 이미지 센서가 베이어 패턴의 컬러 필터를 통해 원시 이미지를 획득한 경우, 원시 이 미지에 포함된 이미지 픽셀들은 베이어 패턴을 가질 수 있다. 이미지 인터페이스는 이미지 센서와 이미지 시그널 프로세서를 전기적으로 연결시킬 수 있다. 이미지 인터페이스는 이미지 센서에서 출력된 원시 이미지를 ISP에 전송할 수 있다. ISP는 이미지 센서로부터 출력된 원시 이미지에 대한 다양한 처리를 수행할 수 있다. ISP는 이 미지 센서를 통하여 획득된 원시 이미지에 대하여 이미지 처리를 수행할 수 있다. ISP는 카메라(31 0)의 샘플링율에 대응하는 프레임율(frame rate)(또는, FPS(frame per second))로 이미지 센서로부터 출 력된 원시 이미지에 대한 다양한 처리를 수행할 수 있다. 예를 들면, ISP는 원시 이미지에 대해 이미지 보정 및 이미지 신호 처리(image signal processing)를 수 행할 수 있다. 예를 들면, ISP는 이미지 보정을 위해 핫 픽셀 정정(hot pixel correction), 디모자이크 (de-mosaic), 색 보간(color interpolation), 노이즈 리덕션(noise reduction), 렌즈 셰이딩 정정(lens shading correction), 불량 화소 처리(defect pixel correction), 녹색 불균형 정정(green imbalance correction), 크로스토크(crosstalk) 보상 또는 고정 패턴 노이즈(fixed pattern noise, FPN)를 제거하기 위한 오토 다크 레벨 보상(auto dark level compensation, ADLC)을 수행할 수 있다. 예를 들면, ISP는 이미지 신호 처리를 위해 엣지 향상(edge enhancement), 감마 보정(gamma correction), 색 포화 보정(color saturation correction), 또는 색도 보정(hue correction)을 수행할 수 있다. 하지만, 이에 제한되지 않는다. 예를 들면, ISP는 자동 화이트 밸런스(auto white balance, AWB), 자동 초점(auto focus, AF), 자동 노출 (auto exposure, AE), HDR(high dynamic range), 톤 커브 조절(tone curve adjustment), 해상도 조절(예: up- scale, down-scale), 또는 포맷 변환(예: RAW에서 YUV, JPEG(joint photographic experts group)로의 변환)을 수행할 수 있다. 예를 들면, ISP는 이미지에 그래픽 효과를 추가할 수 있다. 예를 들면, ISP는 깊이 지도(depth map) 생성, 3차원 모델링, 파노라마 생성, 특징점 추출, 또는 이미지 합성을 수행할 수 있다. 하지 만, 이에 제한되지 않는다. ISP는 카메라에 포함된 구성 요소들 중 적어도 하나(예: 이미지 센서)에 대한 제어(예: 노출 시 간 제어, 또는 리드 아웃 타이밍 제어(또는, 샘플링 레이트 제어))를 수행할 수 있다. 예를 들면, ISP는 이미지 센서의 샘플링 레이트를 제어할 수 있다. 예를 들면, ISP는 이미지 센서의 샘플링 레이 트를 기준 샘플링 레이트(예: 30 Hz)에서 증가시킬 수 있다. 예를 들면, ISP는 이미지 센서의 샘플링 레이트를 기준 샘플링 레이트(예: 30 Hz) 이하로 낮출 수 있다. 예를 들면, ISP가 이미지 센서의 샘 플링 레이트를 30 Hz로 설정함에 따라, 이미지 센서는 초당 30 장의 원시 이미지들을 획득하고, ISP 로 전달할 수 있다. 샘플링 레이트를 변경함에 따라, 카메라, 및 ISP의 전력 소모가 변경될 수 있다. 예를 들면, 샘플링 레이트를 높이는 경우, 카메라 및 ISP의 전력 소모가 증가될 수 있다. 예를 들면, 샘플링 레이트를 낮추는 경우, 카메라 및 ISP의 전력 소모가 감소될 수 있다. ISP는 처리된 이미지를 추가 처리를 위하여 메모리에 저장할 수 있다. ISP는 처리된 이미지의 출력을 위해, 처리된 이미지를 프로세서로 전달할 수 있다. 실시 예에 따라, ISP에서 처리된 이미지 는 카메라 이미지로 지칭될 수 있다. ISP는 IFE(image front end) 엔진 및 IPE(image processing end)를 포함할 수 있다. IFE 엔진 은 저전력의 엔진이고, IPE는 고전력의 엔진일 수 있다. IFE 엔진의 이미지 처리 속도는 IPE보다 빠를 수 있다. IFE 엔진과 IPE는 지정된 기능을 수행할 수 있다. 예를 들면, IFE 엔진은 ISP가 수행하는 기능들의 일부 기능을 수행하고, IPE는 나머지 기능을 수행할 수 있다. 예를 들면, IFE 엔진은 이미 지 처리 파이프라인의 앞부분을 수행하고, IPE는 이미지 처리 파이프라인의 나머지 부분을 수행할 수 있다. 예를 들어, IFE 엔진은 이미지 보정을 수행할 수 있다. 예를 들면, IPE는 이미지 신호 처리를 수행할 수 있다. 하지만, 이에 제한되지 않는다. IFE 엔진은 이미지 센서로부터 출력되는 원시 이미지에 대한 전처리를 수행할 수 있다. 예를 들면, IFE 엔진은 원시 이미지에 대한 이미지 보정 및 포맷 변환을 수행할 수 있다. 예를 들면, IFE 엔진은 원시 이미지에 대한 핫 픽셀 정정, 디모자이크, 색 보간, 노이즈 리덕션, 렌즈 셰이딩 정정, 불량 화소 처리,녹색 불균형 정정, 크로스토크 보상 또는 오토 다크 레벨 보상을 수행할 수 있다. IFE 엔진은 원시 이미지를 지정된 포맷의 이미지로 변환할 수 있다. 예를 들면, IFE 엔진은 RAWnbit 의 원시 이미지를 YUV 포맷의 이미지로 변환할 수 있다. 여기에서, RAWnbit의 원시 이미지는 n 비트의 RAW 이미 지일 수 있다. 예를 들면, YUV 포맷은 YUV420, 또는 YUV422를 포함할 수 있다. 하지만, 이에 제한되지 않는다. IFE 엔진은 전처리된 이미지를 출력할 수 있다. IFE 엔진은 전처리된 이미지를 IPE로 출력할 수 있다. IFE 엔진은 IPE를 바이패스할 수 있다. 예를 들면, IFE 엔진은 전처리된 이미지를 디스플 레이를 통해 표시되도록 프로세서로 출력할 수 있다. IFE 엔진은 전처리된 이미지를 메모리 로 출력할 수 있다. 실시 예에 따라, 전처리된 이미지는 전처리된 이미지 데이터로 지칭될 수 있다. IPE는 IFE 엔진에 의해 전처리된 이미지에 대한 후처리를 수행할 수 있다. IPE는 IFE 엔진 로부터 수신한 전처리된 이미지를 보정, 합성하여 후처리된 이미지를 생성할 수 있다. 예를 들면, IPE는 엣지 향상, 감마 보정, 색 포화 보정, 또는 색도 보정을 수행할 수 있다. 하지만, 이에 제한되지 않 는다. 예를 들면, IPE는 HDR, 톤 커브 조절, 해상도 조절(예: up-scale, down-scale), 또는 포맷 변환을 수행할 수 있다. 예를 들면, IPE는 깊이 지도(depth map) 생성, 3차원 모델링, 파노라마 생성, 특징점 추 출, 또는 이미지 합성을 수행할 수 있다. 하지만, 이에 제한되지 않는다. 실시 예에 따라, 후처리된 이미지는 후처리된 이미지 데이터로 지칭될 수 있다. IPE는 후처리된 이미지를 출력할 수 있다. IPE는 후처리된 이미지를 디스플레이로 표시되도록 프로세서로 출력할 수 있다. IPE는 후처리된 이미지를 메모리에 저장할 수 있다. 프로세서는 이미지를 획득할 수 있다. 예를 들면, 프로세서는 ISP로부터 카메라 이미지를 획득 할 수 있다. 여기에서, 카메라 이미지는 IFE 엔진에서 전처리된 이미지, 또는 IPE에서 후처리된 이미 지일 수 있다. 예를 들면, 프로세서는 어플리케이션을 실행함에 응답하여 어플리케이션 이미지를 획 득할 수 있다. 프로세서는, 프레임을 생성할 수 있다. 프로세서는, 증강 현실(augmented reality, AR), 가상 현실 (virtual reality, VR), 혼합 현실(mixed reality, MR), 또는 확대 현실(extended reality, XR)을 위한 프레임 을 생성할 수 있다. 프로세서는, VST(video see through)를 위한 프레임을 생성할 수 있다. 프로세서 는, 패스 스루(pass-through) 영역을 포함하는 프레임을 생성할 수 있다. 여기에서, VST 및 패스 스루는 카메라를 통해 획득된 외부 환경과 관련된 정보를 디스플레이를 통해 사용자에게 제공하는 기법을 의미할 수 있다. 예를 들면, 프로세서는 카메라 이미지에 기반하여 프레임을 생성할 수 있다. 예를 들면, 프로세서는 카메라 이미지 및 어플리케이션 이미지에 기반하여 프레임을 생성할 수 있다. 예를 들면, 프로세서는 카메 라 이미지 및 어플리케이션 이미지를 합성함으로써, 프레임을 생성할 수 있다. 프로세서는, 비디오를 생성 할 수 있다. 프로세서는, 순차적으로 획득되는 카메라 이미지들에 기반하여 비디오를 생성할 수 있다. 프 로세서는, 순차적으로 획득되는 카메라 이미지들 및 어플리케이션 이미지들에 기반하여 비디오를 생성할 수 있다. 여기에서, 비디오는 카메라를 통해 순차적으로 획득되는 카메라 이미지들에 기반하여 생성되는 프레임들을 포함할 수 있다. 이하에서, 프레임에서 카메라 이미지에 의해 표시되는 영역은 카메라 영역으로 지 칭되고, 프레임에서 어플리케이션 이미지에 의해 표시되는 영역은 어플리케이션 영역으로 지칭될 수 있다. 프로세서는 상태 정보에 기초하여, 상기 카메라 영역을 설정할 수 있다. 프로세서는 어플리케이션 이 미지에 카메라 영역을 중첩(또는, 합성)함으로써, 프레임을 생성할 수 있다. 예를 들면, 프로세서는 어플 리케이션 이미지 상의 일부 영역을 식별할 수 있다. 예를 들면, 프로세서는 어플리케이션 이미지 상에서 식별된 일부 영역에 대응하는 카메라 영역을 어플리케이션 이미지에 합성할 수 있다. 여기에서, 카메라 영역은 VST 영역 또는 패스 스루 영역으로 지칭될 수 있다. 아래에서, 도 4a, 도 4b, 및 도 4c를 참조하여 웨어러블 장 치가 카메라 영역을 설정하는 동작이 설명될 수 있다. 프로세서는 카메라 이미지에 어플리케이션 이미지의 적어도 일부 영역을 중첩(또는, 합성)함으로써, 프레 임을 생성할 수 있다. 예를 들면, 프로세서는 카메라 이미지 상의 일부 영역을 식별할 수 있다. 예를 들면, 프로세서는 카메라 이미지 상에서 식별된 일부 영역에 대응하는 어플리케이션 영역을 카메라 이미지 에 합성할 수 있다. 프로세서는, 지정된 FPS(frame per second)로 프레임을 생성할 수 있다. 예를 들면, 프로세서는 어플 리케이션 이미지의 FPS, 카메라 이미지의 적어도 하나의 FPS 중 가장 높은 FPS로 프레임을 생성할 수 있다. 프로세서는, 지정된 FPS(frame per second)로 순차적으로 획득되는 카메라 이미지들 및 어플리케이션 이미지 들에 기반하여 프레임들을 포함하는 비디오를 생성할 수 있다. 프로세서는 생성된 프레임을 디스플레이를 통해 표시할 수 있다. 프로세서는 생성된 프레임을 디스플레이에 전달할 수 있다. 여기에서, 프레임을 디스플레이에 전달함은, 디스플레이의 프레 임 버퍼에 프레임을 저장함을 의미할 수 있다. 디스플레이는 전달된 프레임을 표시할 수 있다. 예를 들면, 디스플레이는 프레임 버퍼에 저장된 프레임을 지정된 재생률(refresh rate)로 리드하고, 리드된 프레임을 표시할 수 있다. 여기에서, 재생률은 ISP가 이미지를 생성하는 FPS와 다르거나, 또는 같을 수 있다. 디스플레이는 프레임을 표시할 수 있다. 예를 들면, 디스플레이는 프레임 버퍼에 저장된 프레임을 지 정된 재생률(refresh rate)로 리드하고, 리드된 프레임을 표시할 수 있다. 여기에서, 재생률은 ISP, 및/또 는 프로세서가 이미지를 생성하는 FPS와 다르거나, 또는 같을 수 있다. 프로세서는, 프레임에서 관심 영역(region of interest, ROI)을 식별할 수 있다. 프로세서는, 디스 플레이를 통해 표시되는 프레임에서 관심 영역을 식별할 수 있다. 프로세서는 입력에 기반하여, 관심 영역을 식별할 수 있다. 프로세서는 입력의 시간 길이에 기반하여, 관심 영역을 식별할 수 있다. 여기에서, 입력은, 사용자 입력을 포함할 수 있다. 사용자 입력은 사용자의 시선(gaze)을 포함할 수 있다. 프로 세서는, 사용자의 시선의 유지 시간(또는, 시간 길이)에 기반하여, 프레임에서 관심 영역을 식별할 수 있 다. 여기에서, 사용자의 시선은 ET(eye tracking)를 위한 카메라들(240-1, 240-2)에 획득되는 이미지들에 기반 하여 식별될 수 있다. 카메라들(240-1, 240-2)에 획득되는 이미지들은 글린트 이미지(glint image)일 수 있다. 예를 들면, 카메라들(240-1, 240-2)에 획득되는 이미지들에 포함된 안구의 위치에 기반하여, 프로세서는, 사용자의 시선을 식별할 수 있다. 예를 들면, 카메라들(240-1, 240-2)에 획득되는 이미지들에 포함된 홍채의 위 치에 기반하여, 프로세서는, 사용자의 시선을 식별할 수 있다. 프로세서는, 홍채의 위치를 추적함으 로써 사용자의 시선을 식별할 수 있다. 하지만, 이에 제한되지 않는다. 사용자 입력은 사용자의 입력 모듈(15 0)과의 상호 작용을 포함할 수 있다. 예를 들면, 프로세서는 사용자의 제스처 입력이 지시하는 객체에 기 반하여 관심 영역을 식별할 수 있다. 예를 들면, 프로세서는 사용자의 터치 입력이 지시하는 객체에 기반 하여 관심 영역을 식별할 수 있다. 예를 들면, 프로세서는 사용자의 호버링 입력이 지시하는 객체에 기반 하여 관심 영역을 식별할 수 있다. 프로세서는, 상기 관심 영역이 상기 프레임의 어느 영역에 위치하는지를 식별할 수 있다. 예를 들면, 프로 세서는, 상기 관심 영역이 프레임의 카메라 영역에 위치하는지를 식별할 수 있다. 예를 들면, 프로세서 는, 상기 관심 영역이 프레임의 어플리케이션 영역에 위치하는지를 식별할 수 있다. 프로세서는, 상기 관심 영역이 위치하는 상기 프레임 상의 영역에 따라, 카메라 이미지를 위한 처리 방식 (processing scheme)을 달리할 수 있다. 프로세서는, 상기 관심 영역이 위치하는 상기 프레임 상의 영역에 따라, 다음 번의 프레임을 위한 카메라 이미지의 처리 방식을 달리할 수 있다. 예를 들면, 프로세서는 제1 시점의 프레임에서 식별되는 관심 영역에 기반하여, 제1 시점 이후의 제2 시점의 프레임을 위한 카메라 이미지 의 처리 방식을 달리할 수 있다. 프로세서는, 상기 관심 영역이 위치하는 상기 프레임 상의 영역에 따라, 카메라 이미지를 획득하기 위한 프레임율(또는, FPS)을 변경하거나, 또는 IPE를 통한 이미지 처리 여부를 결정할 수 있다. 프로세서는 관심 영역이 상기 카메라 영역에 중첩됨에 기반하여, 상기 카메라 이미지를 제1 처리 방식으로 처리할 수 있다. 프로세서는 관심 영역이 상기 카메라 영역을 벗어남에 기반하여, 카메라 이미지를 상기 제1 처리 방식과 구분되는 제2 처리 방식을 통해 처리할 수 있다. 프로세서는 상기 관심 영역이 제1 시점 의 카메라 이미지(이하, 제1 카메라 이미지')에 기반한 카메라 영역에 중첩됨에 기반하여, 상기 제1 시점 이후 의 제2 시점에 획득되는 카메라 이미지(이하, '제2 카메라 이미지')를 제1 처리 방식으로 처리할 수 있다. 프로 세서는 상기 관심 영역이 상기 카메라 영역을 벗어남에 기반하여, 상기 제2 카메라 이미지를 상기 제1 처 리 방식과 구분되는 제2 처리 방식을 통해 처리할 수 있다. 여기에서, 제1 처리 방식에 따른 전자 장치의 자원 소모는 제2 처리 방식에 따른 전자 장치의 자원 소모보다 많을 수 있다. 여기에서, 자원은 전력, 및/ 또는 시간을 포함할 수 있다. 아래에서, 도 5a, 도 5b, 및 도 6을 참조하여 웨어러블 장치가 상기 관심 영 역이 상기 카메라 영역에 중첩됨에 기반하여, 카메라 이미지를 처리하는 동작이 설명될 수 있다. 프로세서는 상기 카메라 영역의 변화에 따라, 카메라 이미지를 위한 처리 방식을 달리할 수 있다. 예를 들 면, 상기 카메라 영역의 변화를 나타내는 데이터가 기준 범위 밖에 있는 경우, 카메라 이미지를 상기 제1 처리방식으로 처리할 수 있다. 예를 들면, 상기 카메라 영역의 변화를 나타내는 데이터가 기준 범위 내에 있는 경우, 카메라 이미지를 상기 제2 처리 방식으로 처리할 수 있다. 여기에서, 카메라 영역의 변화는 카메라 영역 에 포함된 픽셀들의 값의 변화량에 의해 식별될 수 있다. 카메라 영역의 변화는 카메라 영역에 포함된 객체의 이동, 또는 이동 속도에 의해 식별될 수 있다. 카메라 영역의 변화는 카메라 영역에 포함된 풍경(또는, 배경)의 변화에 의해 식별될 수 있다. 하지만, 이에 제한되지 않는다. 카메라 영역의 변화는 전자 장치의 움직임에 의해 식별될 수 있다. 예를 들어, 프로세서는 전자 장치의 센서 모듈(예: IMU 센서)에 기반하여, 전자 장치의 움직임을 식별할 수 있다. 예를 들면, 프로세서는 전자 장치의 움직임이 지정된 기준을 초과하는 경우, 카메라 영역이 변화된 것으로 식별할 수 있다. 프로세서는 상기 카메라 영역의 휘도에 따라, 카메라 이미지를 위한 처리 방식을 달리할 수 있다. 예를 들 면, 상기 카메라 영역의 휘도가 기준 휘도를 초과하는 경우, 카메라 이미지를 상기 제1 처리 방식으로 처리할 수 있다. 예를 들면, 상기 카메라 영역의 휘도가 기준 휘도 이하인 경우, 카메라 이미지를 상기 제2 처리 방식 으로 처리할 수 있다. 프로세서는, 프레임의 해상도를 다르게 설정할 수 있다. 프로세서는, 상기 어플리케이션 영역의 해상 도를 다르게 설정할 수 있다. 프로세서는, 포비티드 렌더링(foveated rendering)을 수행할 수 있다. 여기 에서, 포비티드 렌더링은 사용자의 시선에 기반하여 해상도를 설정하는 기법일 수 있다. 예를 들면, 프로세서 는 사용자의 시선에 대응하는 관심 영역에 기반하여, 프레임의 해상도를 다르게 설정할 수 있다. 프로세서는, 상기 관심 영역이 위치하는 상기 프레임 상의 영역에 따라, 상기 프레임의 해상도를 달리할 수 있다. 프로세서는, 상기 관심 영역이 위치하는 상기 프레임 상의 영역에 따라, 상기 어플리케이션 영역 의 해상도를 달리할 수 있다. 예를 들면, 프로세서는 상기 관심 영역과의 거리에 기반하여, 상기 어플리케 이션 영역의 해상도를 설정할 수 있다. 아래에서, 도 7a, 도 7b, 및 도 7c를 참조하여 전자 장치가 프레임 의 해상도를 설정하는 동작이 설명될 수 있다. 프로세서는, 상기 프레임 상의 카메라 영역과의 거리에 따라, 상기 어플리케이션 영역의 해상도를 달리할 수 있다. 예를 들면, 프로세서는, 카메라 영역과 인접한 어플리케이션 영역의 해상도를 카메라 영역과 떨 어진 어플리케이션 영역의 해상도보다 높게 설정할 수 있다. 아래에서, 도 8a, 도 8b, 및 도 8c를 참조하여 웨 어러블 장치가 카메라 영역을 고려하여 프레임의 해상도를 설정하는 동작이 설명될 수 있다. 프로세서는, 웨어러블 장치의 상태에 기반하여 상기 어플리케이션 영역의 해상도를 달리할 수 있다. 예를 들면, 프로세서는 웨어러블 장치의 배터리의 잔량에 기반하여 상기 어플리케이션 영역의 해상도를 달리할 수 있다. 예를 들면, 프로세서는 웨어러블 장치의 배터리의 잔량이 낮아질수록 상기 어플리케이션 영역의 해상도를 낮출 수 있다. 예를 들면, 프로세서는 웨어러블 장치의 온도에 기반하여 상기 어플리케이션 영역의 해상도를 달리할 수 있다. 예를 들면, 프로세서는 웨어러블 장치(20 0)의 온도가 높아질수록 상기 어플리케이션 영역의 해상도를 낮출 수 있다. 아래에서, 도 9a, 및 도 9b를 참조 하여 웨어러블 장치가 웨어러블 장치의 상태에 기반하여 프레임의 해상도를 설정하는 동작이 설명될 수 있다. 상술한 바와 같이, 웨어러블 장치는 사용자와의 인터랙션에 기반하여, 카메라 이미지의 처리 방식을 설정 함에 따라, 사용자에게 사용자가 인지하는 영상의 사용자 경험이 감소되지 않은 사용 환경을 제공하고, 또한 전 력 소모 또는 지연(latency)를 감소시킬 수 있다. 웨어러블 장치는 사용자와의 인터랙션에 기반하여, 해상 도를 감소시킴으로써, 사용자에게 사용자가 인지하는 영상의 사용자 경험이 감소되지 않은 사용 환경을 제공하 고, 또한 전력 소모를 감소시킬 수 있다. 여기에서, 사용자가 인지하는 영상의 사용자 경험은, 사용자가 사용하 는 상황에 따라 고해상도의 이미지 또는 높은 레이트의 주사율로 이미지를 사용자에게 제공함으로써, 감소되지 안을 수 있다. 이하에서는, 도 4a, 도 4b, 도 4c, 및 도 4d를 참조하여, 웨어러블 장치가 카메라 영역 및 어플리케이션 영역을 설정하는 동작의 예를 설명한다. 도 4a는, 웨어러블 장치 주변의 환경에 대한 카메라 이미지에 기반하여 표시되는 프레임의 예를 도시한다. 도 4b는, 웨어러블 장치 주변의 환경에 대한 카메라 이미지에 기반하여 표시되는 프레임의 예를 도시한다. 도 4c는, 웨어러블 장치 주변의 환경에 대한 카메라 이미지에 기반하여 표시되는 프레임의 예를 도시한다. 도 4d는, 웨어러블 장치 주변의 환경에 대한 카메라 이미지에 기반하여 표시되는 프레임의 예를 도시한다.도 4a, 도 4b, 도 4c, 및 도 4d의 설명에는 도 1, 도 2a, 도 2b 도 3a, 및 도 3b를 통해 설명된 전자 장치 또는 웨어러블 장치의 구성 요소 또는 구조가 참조될 수 있다. 프로세서는 이미지를 획득할 수 있다. 예를 들면, 프로세서는 ISP로부터 카메라 이미지를 획득할 수 있다. 여기에서, 카메라 이미지는 IFE 엔진에서 전처리된 이미지, 또는 IPE에서 후처 리된 이미지일 수 있다. 카메라 이미지에는 객체가 포함된 영역과 객체가 포함되지 않은 영역이 포함될 수 있다. 예를 들면, 프로세서는 어플리케이션을 실행함에 응답하여 어플리케이션 이미지 를 획득할 수 있다. 도 4a를 참조하면, 프로세서는 프레임 상에서 상기 카메라 영역을 설정할 수 있다. 예를 들면, 프로세서는 객체가 포함된 영역에 기반하여, 상기 프레임 상에서 상기 카메라 영역을 설정할 수 있다. 예를 들면, 프로세서는 카메라 이미지에서 객체를 식별할 수 있다. 예를 들면, 프로세서 는 식별된 객체에 기반하여, 상기 카메라 영역을 설정할 수 있다. 예를 들면, 프로세서는 카메라 이 미지에서 식별된 객체의 영역에 대응하는 프레임 상의 영역을 상기 카메라 영역으로 설정 할 수 있다. 실시 예에 따라, 카메라 이미지에서의 객체의 식별은 프로세서 외의 다른 구성 요소들 (예: 이미지 시그널 프로세서, 또는 이미지 센서)을 통해 수행될 수 있다. 프로세서는 카메라 이미지에 포함된 객체의 정보에 기초하여, 상기 카메라 영역을 설정할 수 있 다. 예를 들면, 프로세서는 사용자가 사전 설정한 객체가 카메라 이미지에서 식별됨에 응답하여, 식 별된 객체의 영역에 대응하는 프레임 상의 영역을 상기 카메라 영역으로 설정할 수 있다. 예를 들면, 사용자가 사전 설정한 객체는 멀티 미디어 장치(예: 컴퓨터, 노트북, TV(television), 스마트폰), 입력 장치(예: 키보드, 컨트롤러), 또는 출력 장치(예: 스피커)일 수 있다. 여기에서, 객체의 정보는 식별된 객체의 종류, 또는 명칭을 나타낼 수 있다. 프로세서는 상황 정보에 기반하여, 상기 카메라 영역을 설정할 수 있다. 예를 들면, 프로세서는 사용자의 상황에 기반하여 상기 카메라 영역을 설정할 수 있다. 예를 들면, 사용자에게 입력이 요구되는 경우(예: ID(identification), 패스워드, 또는 사용자의 선택을 위한 입력이 요구되는 경우), 프로세서는 입력 장치의 영역에 대응하는 프레임 상의 영역을 상기 카메라 영역으로 설정할 수 있다. 예를 들면, 사용자에 게 집중, 또는 방해 금지가 요구되는 경우(예: 작업 중, 휴식 중, 식사 중인 경우), 프로세서는 사용자에 게 집중, 또는 방해 금지를 위한 환경을 제공하기 위한 객체의 영역에 대응하는 프레임 상의 영역을 상기 카메 라 영역으로 설정할 수 있다. 예를 들면, 프로세서는 주변 소음이 높은 경우(시끄러운 환경), 집중, 또는 방해 금지를 위해 이어폰, 또는 헤드셋의 영역에 대응하는 프레임 상의 영역을 상기 카메라 영역으로 설정할 수 있다. 예를 들면, 프로세서는 주변 조도가 높은 경우(밝은 환경), 집중, 또는 방해 금지를 위해 광원의 스 위치에 대응하는 프레임 상의 영역을 상기 카메라 영역으로 설정할 수 있다. 여기에서, 상황 정보는 전자 장치 주변의 환경에 대한 정보를 포함할 수 있다. 상황 정보는 전자 장치의 사용자의 환경에 대한 정보를 포함할 수 있다. 예를 들면, 주변의 환경은 조도, 소음, 주변의 전자 장치, 실내, 또는 실외, 이동 여부, 또는 탑승 여부 중 적어도 하나를 포함할 수 있다. 예를 들면, 사용자의 환경은 작업 여부, 휴식 여부, 학습 여부, 또는 이동 여부 중 적어도 하나를 포함할 수 있다. 하지만 이에 제한되지 않는다. 프로세서는 사용자 입력에 기반하여 상기 카메라 영역을 설정할 수 있다. 예를 들면, 프로세서 는 사용자 입력이 지정하는 프레임 상의 영역을 상기 카메라 영역으로 설정할 수 있다. 프로세서는 아이 트래킹 카메라(예: 카메라(240-1, 240-2))를 통해 사용자의 시선을 식별할 수 있다. 프로 세서는 사용자의 시선에 기반하여 식별되는 프레임 상의 영역을 상기 카메라 영역으로 설정할 수 있다. 예 를 들면, 프로세서는 사용자의 시선이 향하는 프레임 상의 영역을 상기 카메라 영역으로 설정할 수 있다. 예를 들면, 프로세서는 사용자의 시선이 특정 영역에 기준 시간 이상 유지되는 경우, 해당 특정 영역을 상 기 카메라 영역으로 설정할 수 있다. 프로세서는 제스처 인식을 위한 카메라(예: 카메라들(240-5, 240-6, 240-7, 240-8))를 통해 사용자의 제스 처를 식별할 수 있다. 프로세서는 사용자의 제스처에 기반하여 식별되는 프레임 상의 영역을 상기 카메라 영역으로 설정할 수 있다. 예를 들면, 프로세서는 사용자의 제스처가 지시하는 객체의 영역에 대응하는 프 레임 상의 영역을 상기 카메라 영역으로 설정할 수 있다. 여기에서, 사용자의 제스처는 쥐기(grab, grasp) 입력, 또는 가리키기(pointing) 입력 중 적어도 하나를 포함할 수 있다. 프로세서는 사용자의 시선 및 제스처에 기반하여 프레임 상의 영역을 상기 카메라 영역으로 설정할 수 있 다. 예를 들면, 프로세서는 사용자의 시선이 프레임 상의 영역에 향하고, 사용자의 시선이 향하는 영역을 지시하는 사용자의 다른 입력(예: 쥐기(grab, grasp) 입력, 가리키기 입력, 또는 표정(예: 눈 깜빡임))이 식별 되면, 상기 영역을 상기 카메라 영역으로 설정할 수 있다. 도 4b를 참조하면, 프로세서는 프레임 상에서 둘 이상의 카메라 영역들(431, 432)을 설정할 수 있다. 예를 들면, 프로세서는 카메라 이미지에 포함된 객체들 중 둘 이상의 객체가 사용자가 사전 설정한 객체임에 응답하여, 객체들 각각의 영역(411, 412)에 대응하는 프레임 상의 영역들을 상기 카메라 영역들 (431, 432)로 설정할 수 있다. 프로세서는 어플리케이션의 사용 정보에 기초하여, 상기 카메라 영역(431, 432)을 설정할 수 있다. 예를 들면, 사용 정보는, 어플리케이션의 실행 환경에 대한 정보, 어플리케이션의 종류에 대한 정보, 어플리케 이션을 사용하는 사용자 정보, 및/또는 어플리케이션의 이전 실행 정보를 포함할 수 있다. 프로세서는 어플리케이션의 사용 정보에 포함된, 실행 환경(예: 포어그라운드 및/또는 백그라운드에 서 실행되는 어플리케이션의 유무, 개수, 또는 종류) 정보에 기초하여, 상기 카메라 영역(431, 432)을 설정할 수 있다. 예를 들면, 프로세서는 사용 정보에 포함된, 실행되는 어플리케이션의 종류 정보에 기반하 여 상기 카메라 영역(431, 432)을 설정할 수 있다. 예를 들면, 사용자의 집중(예: 시각적 집중)이 요구되는 어 플리케이션(예: 지도 어플리케이션, 영상 재생 어플리케이션)이 실행 중인 경우, 프로세서는 어플리케이션 이 표시 중인 영역 이외의 영역에서 상기 카메라 영역(431, 432)을 설정할 수 있다. 예를 들면, 사용자의 집중 (예: 시각적 집중)이 요구되지 않는 어플리케이션(예: 음악 재생 어플리케이션)이 실행 중인 경우, 프로세서 는 어플리케이션이 표시 중인 영역을 포함한 영역에서 상기 카메라 영역(431, 432)을 설정할 수 있다. 프로세서는 어플리케이션의 사용자 정보에 기초하여, 상기 카메라 영역(431, 432)을 설정할 수 있다. 예를 들면, 프로세서는 어플리케이션이 이전에 실행될 시 사용자가 설정한 카메라 영역을 현재의 카 메라 영역(431, 432)으로 설정할 수 있다. 예를 들면, 사용자가 이전에 카메라 영역을 설정한 경우, 프로세서 는 이전에 사용자가 설정한 영역을 상기 카메라 영역(431, 432)으로 설정할 수 있다. 예를 들면, 특정 어 플리케이션의 사용 동안 사용자가 카메라 영역을 설정한 경우, 프로세서는 해당 어플리케이션의 실행 시 사용자가 이전에 설정한 영역을 상기 카메라 영역(431, 432)으로 설정할 수 있다. 예를 들면, 사용자가 이전에 카메라 영역을 설정하지 않은 경우, 프로세서는 사용 정보의 다른 일부를 이용하여 상기 카메라 영역(431, 432)을 설정할 수 있다. 예를 들면, 사용자가 이전에 카메라 영역을 설정하지 않은 경우, 프로세서는 어플 리케이션의 실행 환경에 대한 정보, 또는 어플리케이션의 종류에 대한 정보를 이용하여 상기 카메라 영역(431, 432)을 설정할 수 있다. 프로세서는 어플리케이션이 사전 설정한 영역을 상기 카메라 영역(431, 432)으로 설정할 수 있다. 예 를 들면, 프로세서는 어플리케이션 이미지에 포함된 콘텐츠에 기반하여 상기 카메라 영역(431, 432) 을 설정할 수 있다. 예를 들면, 프로세서는 어플리케이션 이미지에 포함된 콘텐츠의 종류에 대해 사 전 설정된 영역을 상기 카메라 영역(431, 432)으로 설정할 수 있다. 예를 들면, 프로세서는 어플리케이션 이미지에 포함된 콘텐츠의 종류를 식별할 수 있다. 예를 들면, 프로세서는 콘텐츠의 종류가 카메라 영역에 의한 합성(또는, 중첩)을 허용하는지를 판별할 수 있다. 예를 들면, 프로세서는 콘텐츠의 종류가 카메라 영역에 의한 합성(또는, 중첩)을 허용하는 경우, 콘텐츠의 영역을 포함한 영역에서 상기 카메라 영역 (431, 432)을 설정할 수 있다. 예를 들면, 프로세서는 콘텐츠의 종류가 카메라 영역에 의한 합성(또는, 중 첩)을 허용하지 않는 경우, 콘텐츠의 영역을 제외한 영역에서 상기 카메라 영역(431, 432)을 설정할 수 있다. 여기에서, 카메라 영역에 의한 합성(또는, 중첩)의 허용 여부는 사용자에 의해 사전 설정될 수 있다. 하지만 이 에 제한되지 않는다. 예를 들면, 프로세서는 사용자와의 시각적 인터랙션이 요구되는 정도에 기반하여, 상 기 카메라 영역(431, 432)을 설정할 수 있다. 예를 들면, 프로세서는 사용자와의 시각적 인터랙션이 요구 되는 콘텐츠(예: 게임, 영상)인 경우, 콘텐츠의 영역을 제외한 영역에서 상기 카메라 영역(431, 432)을 설정할 수 있다. 예를 들면, 프로세서는 사용자와의 시각적 인터랙션이 요구되지 않는 콘텐츠(예: 음악, AI(artificial intelligent) 어시스트에 의한 결과물)인 경우, 콘텐츠의 영역을 포함한 영역에서 상기 카메라 영역(431, 432)을 설정할 수 있다. 도 4c를 참조하면, 프로세서는 기준 비율에 기반하여 프레임 상에서 상기 카메라 영역을 설정할 수 있다. 예를 들면, 프로세서는 분할 화면의 요청을 식별함에 응답하여, 기준 비율에 기반하여 프레임 상에서 상기 카메라 영역을 설정할 수 있다. 예를 들면, 프로세서는 프레임의 아래 부분 을 카메라 영역으로 설정하고, 그 외의 부분을 어플리케이션 영역으로 설정할 수 있다. 프로세서는 카메라 영역을 변경할 수 있다. 예를 들면, 프로세서는 실행 중인 어플리케이션이 변경됨 에 기반하여, 카메라 영역을 변경(예: 크기 조정, 이동, 대체)할 수 있다. 예를 들면, 프로세서는 카메라 영역에 포함된 객체가 변경(예: 크기 조정, 이동, 대체)됨에 따라, 카메라 영역을 변경(예: 크기 조정, 이동, 대체)할 수 있다. 여기에서, 카메라를 통해 촬영되는 객체가 원거리로 이동함에 따라, 프로세서는 카 메라 영역의 크기를 객체의 이동에 따라 작게 변경할 수 있다. 프로세서는 카메라 영역(431, 432, 435)에 대응하는 카메라 이미지 상의 영역(411, 412, 415)을 어플리케 이션 이미지에 합성(또는, 중첩)함으로써, 프레임을 생성할 수 있다. 하지만, 이에 제한되지 않는다. 프로세서는 카메라 영역(431, 432, 435)에 대응하는 카메라 이미지 상의 영역(411, 412, 415)과 어플리케 이션 영역에 대응하는 어플리케이션 이미지 상의 영역을 병합함으로써, 프레임을 생성할 수 있 다. 프로세서는 카메라 영역(431, 432, 435)에 대응하는 카메라 이미지 상의 영역(411, 412, 415)을 어플리케 이션 이미지에 중첩 시, 카메라 이미지 상의 영역(411, 412, 415)의 투명도를 설정할 수 있다. 여기에서, 투명도는 어플리케이션 이미지가 중첩된 카메라 이미지 상의 영역(411, 412, 415)을 투과하여 사용자에게 보이는 정도를 나타낼 수 있다. 여기에서, 투명도는 사용자에 의한 입력에 의해 결정될 수 있다. 하지만 이에 제한되지 않는다. 도 4d를 참조하면, 프로세서는 기준 비율에 기반하여 프레임 상에서 상기 카메라 영역을 설정할 수 있다. 예를 들면, 프로세서는 전체 VST 요청을 식별함에 응답하여, 프레임 상에서 상기 카메라 영 역을 설정할 수 있다. 예를 들면, 프로세서는 프레임의 전체를 카메라 영역으로 설정할 수 있다. 프로세서는 카메라 영역(431, 432, 435)에 대응하는 카메라 이미지 상의 영역(411, 412, 415)에 기반하여 프레임을 생성할 수 있다. 도 5a는, 프레임 상의 관심 영역의 일 예를 도시한다. 도 5b는, 프레임 상의 관심 영역의 예를 도시한다. 도 5c 는, 프레임 상의 관심 영역에 따라, 카메라 이미지를 처리하는 패스의 예를 도시한다. 도 5a, 및 도 5b의 설명에는 도 1, 도 2a, 도 2b 도 3a, 및 도 3b를 통해 설명된 전자 장치 또는 웨어러블 장치의 구성 요소 또는 구조가 참조될 수 있다. 프로세서는, 상기 관심 영역이 상기 프레임의 어느 영역에 위치하는지를 식별할 수 있다. 예를 들면, 프로 세서는, 상기 관심 영역이 프레임의 카메라 영역에 위치하는지를 식별할 수 있다. 예를 들면, 프로세서 는, 상기 관심 영역이 프레임의 어플리케이션 영역에 위치하는지를 식별할 수 있다. 도 5a를 참조하면, 상기 관심 영역이 프레임의 카메라 영역에 위치할 수 있다. 도 5b를 참조하 면, 상기 관심 영역이 프레임의 카메라 영역의 밖에 위치할 수 있다. 프로세서는, 상기 관심 영역이 상기 카메라 영역에 중첩됨에 기반하여, 카메라 이미지를 상기 제1 처리 방 식으로 처리할 수 있다. 프로세서는, 상기 관심 영역이 상기 카메라 영역에 벗어남에 기반하여, 카메라 이 미지를 상기 제2 처리 방식으로 처리할 수 있다. 예를 들면, 제1 처리 방식은, 프로세서가 ISP의 프레임율(또는, FPS)을 변경하는 방식일 수 있다. 예 를 들면, 제1 처리 방식은, 프로세서가 카메라 이미지의 생성 속도(또는, 샘플링율, FPS)를 높게 설정하는 방식일 수 있다. 예를 들면, 제1 처리 방식은, 프로세서가 카메라 이미지를 위한 FPS를 어플리케이션 이미 지를 위한 FPS보다 높게 설정하는 방식일 수 있다. 이하에서, 어플리케이션 이미지를 위한 FPS는 제2 FPS이고, 제2 FPS보다 높은 FPS는 제1 FPS로 지칭될 수 있다. 여기에서, 제2 FPS는 24, 25, 또는 30, FPS이고, 제1 FPS 는 60, 72, 75, 120 또는 144 FPS일 수 있다. 하지만, 이에 제한되지 않는다. 예를 들면, 제1 처리 방식은, 프로세서가 ISP의 프레임율(또는, FPS)을 변경하고, 카메라 이미지의 IPE를 통한 이미지 처리를 바이패스하는 방식일 수 있다. 예를 들면, 제1 처리 방식은, 프로세서가 카메라 이미지를 위한 FPS를 제2 FPS보다 높게 설정하고, 카메라 이미지의 IPE를 통한 이미지 처리를 바이 패스하는 방식일 수 있다. 여기에서, IPE를 바이패스함은, IFE 엔진을 통해 처리된 카메라 이미지가 IFE 엔진에서 프로세서로 직접, 또는 메모리를 통해 간접적으로 전달됨을 의미할 수 있다. IPE를 바이패스함은, IFE 엔진에 의해 처리된 카메라 이미지에 기반한 프레임을 디스플레이를통해 표시함을 의미할 수 있다. IPE를 바이패스함은, IFE 엔진을 통해 처리된 카메라 이미지에 대한 IPE를 통한 이미지 처리가 수행되지 않음을 의미할 수 있다. IPE를 바이패스함은, IFE 엔진을 통해 전처리된 카메라 이미지를 IPE를 통해 후처리하지 않음을 의미할 수 있다. 예를 들면, 제1 처리 방식은, 프로세서가 ISP의 프레임율(또는, FPS)을 변경하거나, 및/또는 카메라 이미지의 IPE를 통한 이미지 처리를 바이패스하지 않는 방식일 수 있다. 예를 들면, 제1 처리 방식은, 프 로세서가 카메라 이미지를 위한 FPS를 제2 FPS보다 높게 설정하고, 카메라 이미지의 IPE를 통한 이미 지 처리를 바이패스하지 않는 방식일 수 있다. 예를 들면, 제1 처리 방식은, 프로세서가 카메라 이미지를 위한 FPS를 제2 FPS보다 높게 설정하고, 카메라 이미지의 IPE를 통한 이미지 처리를 바이패스하는 방식일 수 있다. 예를 들면, 제1 처리 방식은, 프로세서가 카메라 이미지를 위한 FPS를 제2 FPS와 동일하게(또는, 높지 않게) 설정하고, 카메라 이미지의 IPE를 통한 이미지 처리를 바이패스하지 않는 방식일 수 있다. 예를 들면, 제1 처리 방식은, 프로세서가, 카메라 이미지를 위한 FPS를 제2 FPS와 동일하게(또는, 높지 않 게) 설정하고, 카메라 이미지의 IPE를 통한 이미지 처리를 바이패스하지 않는 방식일 수 있다. 여기에서, IPE를 바이패스하지 않음은, IFE 엔진을 통해 처리된 카메라 이미지가 IFE 엔진에서 IPE로 직접, 또는 메모리를 통해 간접적으로 전달됨을 의미할 수 있다. IPE를 바이패스하지 않음은, IFE 엔 진 및 IPE에 의해 처리된 카메라 이미지에 기반한 프레임을 디스플레이를 통해 표시함을 의미할 수 있다. IPE를 바이패스하지 않음은, IFE 엔진을 통해 처리된 카메라 이미지에 대한 IPE를 통 한 이미지 처리가 수행됨을 의미할 수 있다. IPE를 바이패스하지 않음은, IFE 엔진을 통해 전처리된 카메라 이미지를 IPE를 통해 후처리함을 의미할 수 있다. 여기에서, IPE는 HDR(high dynamic range), 톤 커브 조절(tone curve adjustment), 해상도 조절(예: up-scale, down-scale), 또는 포맷 변환(예: RAW에서 YUV, JPEG(joint photographic experts group)로의 변환)을 수행할 수 있다. 예를 들면, IPE는 IFE 엔진을 통해 처리된 카메라 이미지의 해상도를 지정된 해상도(예: HD(high definition)), FHD(full HD), QHD(quad HD), 또는 UHD(ultra HD)) 이상으로 높일 수 있다. 프로세서는 관심 영역과 카메라 영역이 중첩되는 경우, 카메라 이미지를 사용자에게 좀 더 명확하고 또렷하게 표시하기 위하여 IFE 엔진 및 IPE를 통해 처리된 카메라 이미지를 프레임의 카메라 영역에 표시할 수 있다. 예를 들면, 제2 처리 방식은, 프로세서가 ISP의 프레임율(또는, FPS)을 변경하는 방식일 수 있다. 예 를 들면, 제2 처리 방식은, 프로세서가 카메라 이미지의 생성 속도(또는, 샘플링율, FPS)를 낮게 설정하는 방식일 수 있다. 예를 들면, 제2 처리 방식은, 프로세서가 카메라 이미지를 위한 FPS를 제2 FPS와 동일하 게(또는, 높지 않게) 설정하는 방식일 수 있다. 예를 들면, 제2 처리 방식은, ISP의 프레임율(또는, FPS)을 변경하고, 카메라 이미지의 IPE를 통한 이미지 처리를 바이패스하는 방식일 수 있다. 예를 들면, 제2 처리 방식은, 프로세서가 카메라 이미지를 위한 FPS를 제2 FPS와 동일하게(또는, 높지 않게) 높게 설정하고, 카메라 이미지의 IPE를 통한 이미지 처 리를 바이패스하는 방식일 수 있다. 프로세서는, 상기 관심 영역이 상기 카메라 영역에 중첩됨에 기반하여, 카메라 이미지의 생성 속도(또는, 샘플링율, FPS)를 높게 설정할 수 있다. 프로세서는, 상기 관심 영역이 상기 카메라 영역에 중첩됨에 기반 하여, 카메라 이미지를 위한 FPS를 제2 FPS보다 높게 설정할 수 있다. 프로세서는, 상기 관심 영역이 상기 카메라 영역에 중첩됨에 기반하여, 프레임율과 함께 카메라의 샘플링율을 변경할 수 있다. 프로세서 는, 상기 관심 영역이 상기 카메라 영역에 중첩됨에 기반하여, 프레임율과 함께 디스플레이의 재생율을 변 경할 수 있다. 여기에서, 프레임율, 샘플링율, 및 재생율은 서로 대응하여 변경될 수 있다. 예를 들면, 프레임 율, 샘플링율, 및 재생율의 주기는 서로 동일하게 변경될 수 있다. 프로세서는, 상기 관심 영역이 상기 카메라 영역에 중첩됨에 기반하여, 카메라 이미지를 위한 FPS를 제2 FPS보다 높게 설정하고, 카메라 이미지의 IPE를 통한 이미지 처리를 바이패스할 수 있다. 프로세서는, 상기 관심 영역이 상기 카메라 영역에 중첩됨에 기반하여, 카메라 이미지를 위한 FPS를 제2 FPS보다 높게 설정하고, IPE를 바이패스할 수 있다. 프로세서는, 상기 관심 영역이 상기 카메라 영역에 중첩됨에 기반하여, 카메라 이미지를 위한 FPS를 제2 FPS와 동일하게(또는, 높지 않게) 설정하고, 카메라 이미지의 IPE를 통한 이미지 처리를 바이패스하지 않 을 수 있다. 프로세서는, 상기 관심 영역이 상기 카메라 영역에 중첩됨에 기반하여, 카메라 이미지를 위한 FPS를 제2 FPS보다 동일하게(또는, 높지 않게) 설정하고, IPE를 바이패스하지 않을 수 있다. 프로세서는, 상기 관심 영역이 상기 카메라 영역을 벗어남에 기반하여, IPE를 바이패스할 수 있다. 예를 들면, 프로세서는, 상기 관심 영역이 상기 카메라 영역을 벗어남에 기반하여, 카메라 이미지를 위한 FPS를 어플리케이션 이미지를 FPS와 동일하게(또는, 높지 않게) 설정하고, IPE를 바이패스할 수 있다. 도 5c를 참조하면, 프로세서는 관심 영역이 카메라 영역에 위치하는 경우 카메라 이미지를 경로들(521, 525) 중 하나를 통해 처리할 수 있다. 프로세서는 관심 영역이 카메라 영역에 위치 하지 않는 경우 카메라 이미지를 경로를 통해 처리할 수 있다. 경로는 프로세서가 카메라 이미지를 위한 FPS를 제2 FPS보다 높게 설정하고, 카메라 이미지의 IPE를 통한 이미지 처리를 바이패스하는 경로일 수 있다. 경로는 프로세서가 카메라 이미지를 위한 FPS를 제2 FPS와 동일하게(또는, 높지 않게) 설정하고, 카메라 이미지의 IPE를 통한 이미지 처리를 바이패스하지 않는 경로일 수 있다. 경로는 프로세서가 카메라 이미지를 위한 FPS를 제2 FPS와 동일 하게(또는, 높지 않게) 높게 설정하고, 카메라 이미지의 IPE를 통한 이미지 처리를 바이패스하는 경로일 수 있다. 프로세서가, 제1 처리 방식을 선택한 경우, 경로 또는 경로 중에서 선택할 수 있다. 예를 들면, 프로세서는 제1 처리 방식을 선택한 경우, 상기 카메라 영역의 변화에 따라, 경로 또는 경로를 선택할 수 있다. 예를 들면, 프로세서는 제1 처리 방식을 선택한 경우, 상기 카메라 영역의 휘도에 따라, 경로 또는 경로를 선택할 수 있다. 프로세서가, 제2 처리 방식을 선택한 경우, 경로를 선 택할 수 있다. 프로세서는 관심 영역이 카메라 영역에 위치하지 않는 경우, 제2 처리 방식을 선 택할 수 있다. 도 6a는, 프레임 상의 관심 영역의 예를 도시한다. 도 6a의 설명에는 도 1, 도 2a, 도 2b 도 3a, 및 도 3b를 통해 설명된 전자 장치 또는 웨어러블 장치(20 0)의 구성 요소 또는 구조가 참조될 수 있다. 도 6a와 같이, 프레임에 둘 이상의 카메라 영역들(431, 432)이 포함된 경우, 프로세서는 둘 이상의 카메라 영역들(431, 432) 중 어느 한 카메라 영역에 상기 관심 영역이 위치하는지에 따라, 카메라 이미지를 위 한 처리 방식을 달리할 수 있다. 예를 들면, 프로세서는 둘 이상의 카메라 영역들(431, 432) 중 관심 영역이 위치하는 카메라 영역을 위한 카메라 이미지에 제1 처리 방식을 적용하고, 관심 영역이 위치하지 않는 카메라 영역을 위한 카메라 이미지에 제2 처리 방식을 적용할 수 있다. 도 6a를 참조하면, 프로세서는 관심 영역이 위치하는 카메라 영역을 위한 카메라 이미지에 제1 처리 방식을 적용하고, 관심 영역이 위치하지 않는 카메라 영역을 위한 카메라 이미지에 제2 처리 방 식을 적용할 수 있다. 예를 들면, 프로세서는 카메라 영역을 위한 카메라 이미지의 FPS를 제1 FPS로 설정하고, 카메라 영역 을 위한 카메라 이미지의 FPS를 제2 FPS로 설정할 수 있다. 예를 들면, 제1 FPS가 60 FPS이고, 제2 FPS가 30 FPS인 경우, 카메라 영역을 위한 카메라 이미지가 두 번 획득되는 동안, 카메라 영역을 위한 카메 라 이미지는 1번 획득될 수 있다. 예를 들면, 프로세서는 카메라 영역에 대응하는 카메라의 픽 셀들 중 일부 픽셀들을 통해 카메라 이미지를 제1 FPS로 샘플링(또는, 서브 샘플링)할 수 있다. 예를 들면, 프 로세서는 카메라 영역에 대응하는 카메라의 픽셀들 중 일부 픽셀들을 통해 카메라 이미지를 제2 FPS로 샘플링(또는, 서브 샘플링)할 수 있다. 예를 들면, 프로세서는 둘 이상의 카메라 영역들(431, 432)에 관심 영역이 위치하지 않는 경우, 둘 이상의 카메라 영역들(431, 432)을 위한 카메라 이미지에 제2 처리 방식을 적용할 수 있다. 도 6b는, 프레임 상의 관심 영역의 예를 도시한다. 도 6b의 설명에는 도 1, 도 2a, 도 2b 도 3a, 및 도 3b를 통해 설명된 전자 장치 또는 웨어러블 장치(20 0)의 구성 요소 또는 구조가 참조될 수 있다. 도 6b와 같이, 프레임에 카메라 영역만 포함된 경우, 프로세서는 카메라 영역의 어디에 상 기 관심 영역이 위치하는지에 따라, 카메라 이미지를 위한 처리 방식을 달리할 수 있다. 하지만, 이에 제한되지 않는다. 예를 들면, 프레임에 카메라 영역뿐만 아니라 어플리케이션 영역도 포함된 경우에도, 프로세 서는 카메라 영역의 어디에 상기 관심 영역이 위치하는지에 따라, 카메라 이미지를 위한 처리 방식을 달리할 수 있다. 예를 들면, 프로세서는 카메라 영역 중 관심 영역이 위치하는 영역 및/또는 객체를 위한 카메라 이미 지(예: 이미지)에 제1 처리 방식을 적용하고, 관심 영역이 위치하지 않는 영역 및/또는 객체를 위한 카메 라 이미지(예: 이미지)에 제2 처리 방식을 적용할 수 있다. 여기에서, 관심 영역이 위치하는 영역은 관심 영역으로 지정된 거리 이내의 영역일 수 있다. 관심 영역이 위치하는 영역 및/또는 객체를 위한 카메라 이미지 (예: 이미지)와 관심 영역이 위치하지 않는 영역 및/또는 객체를 위한 카메라 이미지(예: 이미지)는 하나의 이미지에서 분리된 이미지일 수 있다. 하지만 이에 제한되지 않는다. 도 6b를 참조하면, 프로세서는 관심 영역이 위치하는 영역을 위한 카메라 이미지에 제1 처리 방 식을 적용하고, 관심 영역이 위치하는 영역을 제외한 카메라 영역을 위한 카메라 이미지에 제2 처리 방식을 적용할 수 있다. 이하에서, 관심 영역이 위치하는 영역을 제외한 카메라 영역은 나 머지 카메라 영역으로 지칭될 수 있다. 예를 들면, 프로세서는 관심 영역이 위치하는 영역을 위한 카메라 이미지의 FPS를 제1 FPS로 설 정하고, 나머지 카메라 영역을 위한 카메라 이미지의 FPS를 제2 FPS로 설정할 수 있다. 예를 들면, 프로세서 는 관심 영역이 위치하는 영역에 대응하는 카메라의 픽셀들 중 일부 픽셀들을 통해 카메라 이미지를 제1 FPS로 샘플링(또는, 서브 샘플링)할 수 있다. 예를 들면, 프로세서는 나머지 카메라 영역에 대응하는 카메라의 픽셀들 중 일부 픽셀들을 통해 카메라 이미지를 제2 FPS로 샘플링(또는, 서브 샘플링) 할 수 있다. 도 6b를 참조하면, 프로세서는 관심 영역이 위치하는 객체를 위한 카메라 이미지에 제1 처리 방 식을 적용하고, 관심 영역이 위치하는 객체를 제외한 카메라 영역을 위한 카메라 이미지에 제2 처리 방식을 적용할 수 있다. 이하에서, 관심 영역이 위치하는 객체를 제외한 카메라 영역은 나 머지 카메라 영역으로 지칭될 수 있다. 예를 들면, 프로세서는 관심 영역이 위치하는 객체를 위한 카메라 이미지의 FPS를 제1 FPS로 설 정하고, 나머지 카메라 영역을 위한 카메라 이미지의 FPS를 제2 FPS로 설정할 수 있다. 예를 들면, 프로세서 는 관심 영역이 위치하는 객체에 대응하는 카메라의 픽셀들 중 일부 픽셀들을 통해 카메라 이미지를 제1 FPS로 샘플링(또는, 서브 샘플링)할 수 있다. 예를 들면, 프로세서는 나머지 카메라 영역에 대응하는 카메라의 픽셀들 중 일부 픽셀들을 통해 카메라 이미지를 제2 FPS로 샘플링(또는, 서브 샘플링) 할 수 있다. 이하에서, 프로세서가 상기 카메라 영역의 변화에 따라, 카메라 이미지를 위한 처리 방식을 달리하는 동작 이 설명될 수 있다. 프로세서는 상기 카메라 영역의 변화에 따라, 카메라 이미지를 위한 처리 방식을 달리할 수 있다. 여기에 서, 카메라 영역의 변화는 디스플레이 상에서 순차적으로 표시되는 프레임들 상에서의 카메라 영역의 위치 이동을 포함할 수 있다. 카메라 영역의 변화는 디스플레이 상에서 순차적으로 표시되는 프레임들 각각의 카메라 영역에 포함된 객체의 이동, 또는 픽셀 값의 변화를 포함할 수 있다. 프로세서는 상기 카메라 영역의 변화를 나타내는 데이터가 기준 범위 밖에 있는 경우, 경로를 선택할 수 있다. 예를 들면, 프로세서는 상기 카메라 영역의 변화를 나타내는 데이터가 기준 범위 밖에 있는 경우, 카메라 이미지를 위한 FPS를 제2 FPS보다 높게 설정하고, 카메라 이미지의 IPE를 통한 이미지 처리 를 바이패스할 수 있다. 프로세서는 상기 카메라 영역 밖의 상기 프레임의 어플리케이션 영역의 제2 FPS보 다 높은 제1 FPS로 상기 카메라 영역을 위한 상기 카메라 이미지를 획득하고, 및 상기 제1 FPS로 획득되는 카메 라 이미지의 후처리를 바이패스할 수 있다. 프로세서는 상기 카메라 영역의 변화를 나타내는 데이터가 기준 범위 내에 있는 경우, 경로를 선택할 수 있다. 프로세서는 상기 카메라 영역의 변화를 나타내는 데이터가 기준 범위 내에 있는 경우, 카메라 이미지를 위한 FPS를 제2 FPS와 동일하게(또는, 높지 않게) 설정하고, 카메라 이미지의 IPE를 통한 이미지 처리를 바이패스하지 않을 수 있다. 프로세서는 상기 데이터가 상기 기준 범위 내에 있음을 식별하는 것에 응답하여, 상기 카메라 영역을 위한 상기 카메라 이미지를 제2 FPS와 동일한(또는, 높지 않은) FPS로 획득하고, 및 카메라 이미지를 후처리할 수 있다. 프로세서는 상기 관심 영역이 상기 카메라 영역에 중첩되는 경우, 상기 카메라 영역의 변화에 따라, 카메 라 이미지를 위한 처리 방식을 달리할 수 있다. 프로세서는 상기 관심 영역이 상기 카메라 영역에 중첩되고, 상기 카메라 영역의 변화를 나타내는 데이터 가 기준 범위 밖에 있는 경우, 경로를 선택할 수 있다. 프로세서는 상기 관심 영역이 상기 카메라 영 역에 중첩되고, 상기 카메라 영역의 변화를 나타내는 데이터가 기준 범위 밖에 있는 경우, 카메라 이미지를 위 한 FPS를 제2 FPS보다 높게 설정하고, 카메라 이미지의 IPE를 통한 이미지 처리를 바이패스할 수 있다. 프 로세서는 상기 관심 영역이 중첩되는 상기 카메라 영역의 변화를 나타내는 데이터가 기준 범위 밖에 있음 을 식별하는 것에 응답하여, 제2 FPS보다 높은 제1 FPS로 상기 카메라 영역을 위한 상기 카메라 이미지를 획득 하고, 및 상기 높은 제1 FPS로 획득되는 카메라 이미지의 후처리를 바이패스할 수 있다. 프로세서는 상기 관심 영역이 상기 카메라 영역에 중첩되고, 상기 카메라 영역의 변화를 나타내는 데이터 가 기준 범위 내에 있는 경우, 경로를 선택할 수 있다. 프로세서는 상기 관심 영역이 상기 카메라 영 역에 중첩되고, 상기 카메라 영역의 변화를 나타내는 데이터가 기준 범위 내에 있는 경우, 카메라 이미지를 위 한 FPS를 제2 FPS와 동일하게(또는, 높지 않게) 설정하고, 카메라 이미지의 IPE를 통한 이미지 처리를 바 이패스하지 않을 수 있다. 프로세서는 상기 데이터가 상기 기준 범위 내에 있음을 식별하는 것에 응답하여, 상기 카메라 영역을 위한 상기 카메라 이미지를 제2 FPS와 동일한(또는, 높지 않은) FPS로 획득하고, 및 카메라 이미지를 후처리할 수 있다. 상술한 바와 같이, 프로세서는 정적인 카메라 영역과 동적인 카메라 영역을 다른 방식으로 처리함으로써, 사용자에게 전력 소모량을 감안한 보다 효율적인 사용 환경을 제공할 수 있다. 이하에서, 프로세서가 상기 카메라 영역의 휘도에 따라, 카메라 이미지를 위한 처리 방식을 달리하는 동작 이 설명될 수 있다. 프로세서는 상기 카메라 영역의 휘도에 따라, 카메라 이미지를 위한 처리 방식을 달리할 수 있다. 프로세서는 상기 카메라 영역의 휘도가 기준 휘도를 초과하는 경우, 제1 처리 방식에 따라 카메라 이미지 를 처리할 수 있다. 예를 들면, 프로세서는 상기 카메라 영역의 휘도가 기준 휘도를 초과하는 경우, 경로 , 또는 경로에 기초하여 카메라 이미지를 처리할 수 있다. 예를 들면, 프로세서는 상기 카메라 영역의 휘도가 기준 휘도를 초과함을 식별하는 것에 응답하여, 상기 제1 FPS로 상기 카메라 이미지를 획득하고, 및 상기 제1 FPS로 획득되는 상기 카메라 이미지의 후처리를 바이패 스할 수 있다. 프로세서는 상기 카메라 영역의 상기 휘도가 상기 기준 휘도를 초과함을 식별하는 것에 응 답하여, 상기 카메라 이미지를 상기 제2 FPS로 획득하고, 및 상기 제2 FPS로 획득되는 상기 카메라 이미지를 후 처리할 수 있다. 예를 들면, 프로세서는 기준 휘도를 초과하는 휘도를 가지는 상기 카메라 영역의 변화를 나타내는 데이터 가 기준 범위 밖에 있는 경우, 경로에 기초하여 카메라 이미지를 처리할 수 있다. 예를 들면, 프로세서 는 기준 휘도를 초과하는 휘도를 가지는 상기 카메라 영역의 변화를 나타내는 데이터가 기준 범위 내에 있 는 경우, 경로에 기초하여 카메라 이미지를 처리할 수 있다. 프로세서는 상기 카메라 영역의 휘도가 기준 휘도 이하인 경우, 제2 처리 방식에 따라 카메라 이미지를 처 리할 수 있다. 예를 들면, 프로세서는 상기 카메라 영역의 휘도가 기준 휘도 이하인 경우, 경로에 기 초하여 카메라 이미지를 처리할 수 있다. 예를 들면, 프로세서는 상기 카메라 영역의 휘도가 기준 휘도 이하임을 식별하는 것에 응답하여, 상기 카 메라 이미지를 상기 제2 FPS로 획득하고, 및 상기 제2 FPS로 획득되는 상기 카메라 이미지의 후처리를 바이패스 할 수 있다. 프로세서는 관심 영역에 중첩되는 상기 카메라 영역의 휘도가 기준 휘도를 초과하는 경우, 제1 처리 방식 에 따라 카메라 이미지를 처리할 수 있다. 예를 들면, 프로세서는 관심 영역에 중첩되는 상기 카메라 영역 의 휘도가 기준 휘도를 초과하는 경우, 경로, 또는 경로에 기초하여 카메라 이미지를 처리할 수 있다. 예를 들면, 프로세서는 관심 영역에 중첩되는 상기 카메라 영역의 휘도가 기준 휘도를 초과함을 식별하는 것에 응답하여, 상기 제1 FPS로 상기 카메라 이미지를 획득하고, 및 상기 제1 FPS로 획득되는 상기 카메라 이미 지의 후처리를 바이패스할 수 있다. 프로세서는 관심 영역에 중첩되는 상기 카메라 영역의 상기 휘도가 상 기 기준 휘도를 초과함을 식별하는 것에 응답하여, 상기 카메라 이미지를 상기 제2 FPS로 획득하고, 및 상기 제 2 FPS로 획득되는 상기 카메라 이미지를 후처리할 수 있다. 프로세서는 관심 영역에 중첩되는 상기 카메라 영역의 휘도가 기준 휘도 이하인 경우, 제2 처리 방식에 따 라 카메라 이미지를 처리할 수 있다. 예를 들면, 프로세서는 상기 카메라 영역의 휘도가 기준 휘도 이하인 경우, 경로에 기초하여 카메라 이미지를 처리할 수 있다. 예를 들면, 프로세서는 관심 영역에 중첩되는 상기 카메라 영역의 휘도가 기준 휘도 이하임을 식별하는 것 에 응답하여, 상기 카메라 이미지를 상기 제2 FPS로 획득하고, 및 상기 제2 FPS로 획득되는 상기 카메라 이미지 의 후처리를 바이패스할 수 있다. 상술한 바와 같이, 프로세서는 사용자의 관심 영역의 휘도가 낮은 경우, 사용자의 인지 능력이 떨어지는 점을 고려하여, 카메라 영역에 저전력의 처리 기법을 적용함으로써, 전력 소모량을 감소시킬 수 있다. 이하에서, 프로세서가 사용자와의 인터랙션에 따라, 카메라 이미지를 위한 처리 방식을 달리하는 동작이 설명될 수 있다. 프로세서는 상기 카메라 영역에 포함되는 객체에 따라, 카메라 이미지를 위한 처리 방식을 달리할 수 있다. 예를 들면, 사용자는 웨어러블 장치를 착용한 상태에서 얼굴이 향하는 방향을 변경할 수 있다. 이에 따라, 웨어러블 장치의 디스플레이에 표시되는 VST 영역에 포함되는 객체가 변경될 수 있다. 프로세서는 사용자가 VST 영역을 바라보지 않는 경우(즉, 관심 영역이 카메라 영역에 중첩되지 않는 경 우)에도, VST 영역에 포함되는 객체의 종류에 따라, 카메라 영역에 대한 처리 기법을 변경할 수 있다. 예를 들면, 프로세서는 상기 카메라 영역에 포함되는 객체가 사용자가 지정한 객체인 경우, 상기 카메라 영역을 제1 처리 기법에 기초하여 처리할 수 있다. 프로세서는 상기 카메라 영역에 객체가 사용자가 지정 한 객체가 포함되는 경우, 상기 카메라 영역을 제1 처리 기법에 기초하여 처리할 수 있다. 예를 들면, 프로세서 는 상기 카메라 영역에 객체가 사용자가 지정한 객체가 포함되면, 경로, 또는 경로를 선택할 수 있다. 프로세서는 상기 카메라 영역에 객체가 사용자가 지정한 객체가 포함되면, 사용자가 얼굴을 이동시 키는 속도에 따라, 경로, 또는 경로를 선택할 수 있다. 예를 들면, 프로세서는 사용자가 얼굴을 기준 속도보다 빠르게 이동시키는 경우, 경로를 선택할 수 있다. 예를 들면, 프로세서는 사용자가 얼 굴을 기준 속도보다 느리게 이동시키는 경우, 경로를 선택할 수 있다. 예를 들면, 프로세서는 상기 카메라 영역에 포함되는 객체가 사용자가 지정한 객체가 아닌 경우, 상기 카 메라 영역을 제2 처리 기법에 기초하여 처리할 수 있다. 프로세서는 상기 카메라 영역에 객체가 사용자가 지정한 객체가 포함되지 않는 경우, 상기 카메라 영역을 제2 처리 기법에 기초하여 처리할 수 있다. 프로세서는 상기 카메라 영역에 객체가 사용자가 지정한 객체가 포함되는지에 따라, 카메라 영역의 처리 기법을 변경함으로써, 사용자가 미리 지정한 객체에 대한 높은 해상도 또는 높은 FPS의 프레임을 제공할 수 있 다. 이하에서, 프로세서가 카메라 영역에 포함되는 객체의 종류 및 크기에 따라, 카메라 이미지를 위한 처리 방식을 달리하는 동작이 설명될 수 있다. 프로세서는 상기 카메라 영역에 포함되는 객체에 따라, 카메라 이미지를 위한 처리 방식을 달리할 수 있다. 예를 들면, 프로세서는 상기 카메라 영역에 포함되는 객체가 텍스트 객체인지에 따라, 카메라 이미 지를 위한 처리 방식을 달리할 수 있다. 프로세서는 상기 카메라 영역에 포함되는 객체의 크기에 따라, 카메라 이미지를 위한 처리 방식을 달리할 수 있다. 예를 들면, 프로세서는 상기 카메라 영역에 포함되는 객체가 텍스트 객체이고, 텍스트의 크기가 기준 크기 이하인지에 따라, 카메라 이미지를 위한 처리 방식을 달리할 수 있다. 프로세서는 상기 카메라 영역에 포함되는 객체의 양에 따라, 카메라 이미지를 위한 처리 방식을 달리할 수 있다. 예를 들면, 프로세서는 상기 카메라 영역에 포함되는 객체가 텍스트 객체이고, 텍스트의 양이 기준 텍스트량 이상인지에 따라, 카메라 이미지를 위한 처리 방식을 달리할 수 있다. 예를 들면, 프로세서는 상기 카메라 영역에 포함되는 객체가 텍스트 객체인 경우, 상기 카메라 영역을 제1 처리 기법에 기초하여 처리할 수 있다. 프로세서는 상기 카메라 영역에 포함되는 객체가 텍스트 객체이고, 텍스트의 크기가 기준 크기 이하인 경 우, 경로를 선택할 수 있다. 프로세서는 상기 카메라 영역에 포함되는 객체가 텍스트 객체이고, 텍스 트의 크기가 기준 크기를 초과하는 경우, 경로를 선택할 수 있다. 프로세서는 상기 카메라 영역에 포함되는 객체가 텍스트 객체이고, 텍스트의 양이 기준 텍스트량 이상인 경우, 경로를 선택할 수 있다. 프로세서는 상기 카메라 영역에 포함되는 객체가 텍스트 객체이고, 텍 스트의 양이 기준 텍스트량 미만인 경우, 경로를 선택할 수 있다. 도 7a는, 프레임 상의 관심 영역에 따른 해상도의 설정의 예를 도시한다. 도 7b는, 프레임 상의 관심 영역에 따 른 해상도의 설정의 예를 도시한다. 도 7c는, 프레임 상의 관심 영역에 따른 해상도의 설정의 예를 도시한다. 도 7a, 도 7b, 및 도 7c의 설명에는 도 1, 도 2a, 도 2b 도 3a, 및 도 3b를 통해 설명된 전자 장치 또는 웨어러블 장치의 구성 요소 또는 구조가 참조될 수 있다. 프로세서는, 프레임의 해상도를 다르게 설정할 수 있다. 프로세서는, 상기 어플리케이션 영역의 해상 도를 다르게 설정할 수 있다. 프로세서는, 포비티드 렌더링을 수행할 수 있다. 프로세서는, 상기 관심 영역이 위치하는 상기 프레임 상의 영역에 따라, 상기 프레임의 해상도를 달리할 수 있다. 프로세서는, 상기 관심 영역이 위치하는 상기 프레임 상의 영역에 따라, 상기 프레임의 해상도를 달리할 수 있다. 예를 들면, 프로세서는 상기 관심 영역과의 거리에 기반하여, 상기 프레임의 해상도를 설 정할 수 있다. 프로세서는 상기 관심 영역과의 거리가 증가할수록 프레임의 해상도가 낮아지도록 설정할 수 있다. 프로세서는 적어도 하나의 기준 거리를 설정할 수 있다. 예를 들면, 하나의 기준 거리가 설정된 경우, 프 로세서는 기준 거리 이내의 영역을 지정된 해상도(예: 기준 해상도, 또는 제1 해상도)로 렌더링하고, 기준 거리를 초과하는 영역을 지정된 해상도보다 낮은 해상도(예: 제1 해상도 이하)로 렌더링할 수 있다. 예를 들면, 둘 이상의 기준 거리들이 설정된 경우, 프로세서는 제1 기준 거리 이내의 제1 영역을 지정된 해상도(예: 기준 해상도, 또는 제0 해상도)로 렌더링하고, 제1 기준 거리를 초과하고 제2 기준 거리 이내의 제2 영역을 지 정된 해상도보다 낮은 해상도(예: 제1 해상도 이하)로 렌더링할 수 있다. 제n-1 기준 거리를 초과하고 제n 기준 거리 이내의 제n 영역을 제n-2 해상도보다 낮은 해상도(예: 제n-1 해상도 이하)로 렌더링할 수 있다. 여기에서, n은 2 이상의 정수일 수 있다. 제0 해상도는 기준 해상도일 수 있다. 여기에서, 기준 해상도는 원본 이미지의 해상도 또는, 원본 이미지에서 업스케일된 이미지의 해상도일 수 있다. 예를 들면, 기준 해상도는 4K의 해상도 를 가질 수 있다. 하지만, 이에 제한되지 않는다. 예를 들면, 기준 해상도는 8k, 2K, 1080p, 또는 이 외의 해상 도를 가질 수 있다. 제1 해상도는 기준 해상도(예: 제0 해상도)로부터 1/2 또는 1/4의 해상도를 가질 수 있다. 제2 해상도는 제1 해상도로부터 1/2 또는 1/4의 해상도를 가질 수 있다. 하지만, 이에 제한되지 않는다. 도 7a를 참조하면, 프로세서는 관심 영역으로부터 제1 기준 거리 이내의 영역을 기준 해상도로 렌더링할 수 있다. 프로세서는 관심 영역으로부터 제1 기준 거리 초과 및 제2 기준 거리 이내의 영역 을 제1 해상도로 렌더링할 수 있다. 프로세서는 관심 영역으로부터 제2 기준 거리 초과 및 제3 기준 거리 이내의 영역을 제2 해상도로 렌더링할 수 있다. 프로세서는 관심 영역으로부터 제3 기준 거리 초과 및 제4 기준 거리 이내의 영역을 제3 해상도로 렌더링할 수 있다. 프로세서는 웨어러블 장치의 상태에 기반하여, 적어도 하나의 기준 거리를 설정할 수 있다. 프로세서 는 웨어러블 장치의 상태에 기반하여, 프레임의 해상도를 다르게 설정할 수 있다.예를 들면, 프로세서는 웨어러블 장치의 배터리 잔량에 기반하여, 프레임의 해상도를 다르게 설정할 수 있다. 예를 들면, 프로세서는 웨어러블 장치의 배터리 잔량이 낮을수록 높은 해상도로 렌더링되는 영역을 감소시킬 수 있다. 예를 들면, 프로세서는 웨어러블 장치의 배터리 잔량이 낮을수록 기준 해 상도로 렌더링되는 영역을 감소시킬 수 있다. 예를 들면, 프로세서는 웨어러블 장치의 배터리 잔량이 낮을수록 낮은 해상도로 렌더링되는 영역을 증가시킬 수 있다. 예를 들면, 프로세서는 웨어러블 장 치의 배터리 잔량이 높을수록 높은 해상도로 렌더링되는 영역을 증가시킬 수 있다. 예를 들면, 프로세서 는 웨어러블 장치의 배터리 잔량이 높을수록 기준 해상도로 렌더링되는 영역을 증가시킬 수 있 다. 예를 들면, 프로세서는 웨어러블 장치의 배터리 잔량이 높을수록 낮은 해상도로 렌더링되는 영역 을 감소시킬 수 있다. 예를 들면, 프로세서는 웨어러블 장치의 온도에 기반하여, 프레임의 해상도를 다르게 설정할 수 있다. 예를 들면, 프로세서는 웨어러블 장치의 온도가 높을수록 높은 해상도로 렌더링되는 영역을 감 소시킬 수 있다. 예를 들면, 프로세서는 웨어러블 장치의 온도가 높을수록 기준 해상도로 렌더 링되는 영역을 감소시킬 수 있다. 예를 들면, 프로세서는 웨어러블 장치의 온도가 높을수록 낮은 해 상도로 렌더링되는 영역을 증가시킬 수 있다. 예를 들면, 프로세서는 웨어러블 장치의 온도가 낮을수 록 높은 해상도로 렌더링되는 영역을 증가시킬 수 있다. 예를 들면, 프로세서는 웨어러블 장치의 온 도가 낮을수록 기준 해상도로 렌더링되는 영역을 증가시킬 수 있다. 예를 들면, 프로세서는 웨어러블 장치의 온도가 낮을수록 낮은 해상도로 렌더링되는 영역을 감소시킬 수 있다. 하지만, 이에 제한되지 않는 다. 프로세서는 웨어러블 장치의 사용자의 사용 환경에 기반하여, 적어도 하나의 기준 거리를 설정할 수 있다. 예를 들면, 프로세서는 사용자의 시선의 변화에 기반하여, 프레임의 해상도를 다르게 설정할 수 있 다. 예를 들면, 프로세서는 사용자의 시선의 변화를 나타내는 데이터가 기준 범위를 초과함에 응답하여, 높은 해상도로 렌더링되는 영역을 감소시킬 수 있다. 예를 들면, 프로세서는 사용자의 시선의 변화를 나타 내는 데이터가 기준 범위를 초과함에 응답하여, 기준 해상도로 렌더링되는 영역을 감소시킬 수 있다. 예를 들면, 프로세서는 사용자의 시선의 변화를 나타내는 데이터가 기준 범위를 초과함에 응답하여, 낮은 해상 도로 렌더링되는 영역을 증가시킬 수 있다. 예를 들면, 프로세서는 사용자의 시선의 변화를 나타내는 데이 터가 기준 범위 이내임에 응답하여, 높은 해상도로 렌더링되는 영역을 증가시킬 수 있다. 예를 들면, 프로세서 는 사용자의 시선의 변화를 나타내는 데이터가 기준 범위 이내임에 응답하여, 기준 해상도로 렌더링 되는 영역을 증가시킬 수 있다. 예를 들면, 프로세서는 사용자의 시선의 변화를 나타내는 데이터가 기준 범위 이내임에 응답하여, 낮은 해상도로 렌더링되는 영역을 감소시킬 수 있다. 하지만, 이에 제한되지 않는다. 예를 들면, 프로세서는 실행 중인 어플리케이션의 종류에 기반하여, 프레임의 해상도를 다르게 설정 할 수 있다. 예를 들면, 프로세서는 실행 중인 어플리케이션이 높은 FPS를 요구하는 경우(예: 게임 어플리케이션), 높은 해상도로 렌더링되는 영역을 감소시킬 수 있다. 예를 들면, 프로세서는 실행 중인 어 플리케이션이 높은 FPS를 요구하는 경우 기준 해상도로 렌더링되는 영역을 감소시킬 수 있다. 예를 들면, 프로세서는 실행 중인 어플리케이션이 높은 FPS를 요구하는 경우 낮은 해상도로 렌더링되는 영 역을 증가시킬 수 있다. 예를 들면, 프로세서는 실행 중인 어플리케이션이 낮은 FPS를 요구하는 경우 (예: 문서 작성 어플리케이션), 높은 해상도로 렌더링되는 영역을 증가시킬 수 있다. 예를 들면, 프로세서(12 0)는 실행 중인 어플리케이션이 낮은 FPS를 요구하는 경우 기준 해상도로 렌더링되는 영역을 증가시 킬 수 있다. 예를 들면, 프로세서는 실행 중인 어플리케이션이 낮은 FPS를 요구하는 경우 낮은 해상 도로 렌더링되는 영역을 감소시킬 수 있다. 하지만, 이에 제한되지 않는다. 도 7a 및 도 7b를 비교하면, 도 7a에서는 기준 해상도로 렌더링되는 영역이 도 7b에서 기준 해상도로 렌더링되는 영역보다 넓을 수 있다. 도 7b에서는 도 7a에서 존재하지 않는 제4 해상도로 렌더링되는 영역 이 포함될 수 있다. 도 7b 및 도 7c를 비교하면, 도 7b와 도 7c에서는 기준 해상도로 렌더링되는 영역이 동일할 수 있다. 즉, 프로세서는 기준 해상도로 렌더링되는 영역을 최소의 영역으로 제한한 경우, 다른 영역들의 해상도를 낮출 수 있다. 예를 들면, 도 7c에서는 도 7b에서보다 제4 해상도로 렌더링되는 영역이 넓을 수 있다. 도 8a는, 프레임 상의 관심 영역에 따른 해상도의 설정의 예를 도시한다. 도 8b는, 프레임 상의 관심 영역에 따 른 해상도의 설정의 예를 도시한다. 도 8c는, 프레임 상의 관심 영역에 따른 해상도의 설정의 예를 도시한다.도 8d는, 프레임 상의 관심 영역에 따른 해상도의 설정의 예를 도시한다. 도 8a, 도 8b, 도 8c, 및 도 8d의 설명에는 도 1, 도 2a, 도 2b 도 3a, 및 도 3b를 통해 설명된 전자 장치 또는 웨어러블 장치의 구성 요소 또는 구조가 참조될 수 있다. 프로세서는, 프레임의 해상도를 다르게 설정할 수 있다. 프로세서는, 상기 어플리케이션 영역의 해상 도를 다르게 설정할 수 있다. 프로세서는, 포비티드 렌더링을 수행할 수 있다. 프로세서는, 상기 어 플리케이션 영역에 포비티드 렌더링을 수행할 수 있다. 예를 들면, 프로세서는, 프레임 중 카메라 영역과 구분되는 상기 어플리케이션 영역에 포비티드 렌더링을 수행할 수 있다. 하지만, 이에 제한되지 않는다. 예를 들면, 프로세서는, 카메라 영역에도 포비티드 렌더링을 수행할 수 있다. 도 8a를 참조하면, 관심 영역으로부터 멀어질수록 해상도가 낮아지도록 렌더링을 수행할 수 있다. 예를 들 면, 프로세서는 프레임 중 카메라 영역들(811, 812)을 제외한 어플리케이션 영역에 대해 관심 영역으 로부터 멀어질수록 해상도가 낮아지도록 렌더링을 수행할 수 있다. 예를 들면, 프로세서는 관심 영역(80 1)으로부터 제1 기준 거리 이내의 영역을 제1 해상도로 렌더링할 수 있다. 프로세서는 관심 영역 으로부터 제1 기준 거리 초과 제2 기준 거리 이내의 영역을 제2 해상도로 렌더링할 수 있다. 프로세 서는 관심 영역으로부터 제2 기준 거리 초과 제3 기준 거리 이내의 영역을 제3 해상도로 렌더링 할 수 있다. 프로세서는 관심 영역으로부터 제3 기준 거리 초과 제4 기준 거리 이내의 영역을 제4 해 상도로 렌더링할 수 있다. 하지만, 이에 제한되지 않는다. 프로세서는, 상기 프레임 상의 카메라 영역과의 거리에 따라, 상기 어플리케이션 영역의 해상도를 달리할 수 있다. 예를 들면, 프로세서는, 카메라 영역과 인접한 어플리케이션 영역의 해상도를 카메라 영역과 떨 어진 어플리케이션 영역의 해상도보다 높게 설정할 수 있다. 예를 들면, 프로세서는, 관심 영역으로부터 실질적으로 동일한 거리만큼 떨어진 영역들 중 카메라 영역에 인접한 영역들의 해상도를 카메라 영역에 인접하 지 않은 영역들의 해상도보다 높게 설정할 수 있다. 예를 들면, 특정 어플리케이션 영역의 해상도는, 관심 영역 이 위치하는 카메라 영역으로부터의 거리에 따라 결정되는 제1 해상도, 또는 관심 영역이 위치하지 않는 카메라 영역으로부터의 거리에 따라 결정되는 제2 해상도 중 높은 해상도가 적용될 수 있다. 도 8b를 참조하면, 프레임들(821, 825)의 경우, 어플리케이션 영역의 일부 영역이 카메라 영역에 인 접하므로, 프로세서는 일부 영역의 해상도를 주변 영역의 해상도보다 높게 설정할 수 있다. 예를 들 면, 프레임의 경우, 프로세서는 관심 영역이 위치한 카메라 영역을 기준 해상도로 렌 더링하고, 카메라 영역으로부터 제2 기준 거리 이내의 영역을 제1 해상도로 렌더링하고, 카메라 영역 으로부터 제2 기준 거리 초과 제3 기준 거리 이내의 영역을 제2 해상도로 렌더링하고, 카메라 영역 으로부터 제3 기준 거리 초과 제4 기준 거리 이내의 영역을 제3 해상도로 렌더링하고, 및 카메라 영 역으로부터 제4 기준 거리 초과 제5 기준 거리 이내의 영역을 제4 해상도로 렌더링할 수 있다. 또한, 예를 들면, 프레임의 경우, 프로세서는 관심 영역이 위치하지 않은 카메라 영역을 기준 해상도로 렌더링하고, 카메라 영역으로부터 제2 기준 거리 이내의 영역을 제1 해상도로 렌 더링하고, 카메라 영역으로부터 제2 기준 거리 초과 제3 기준 거리 이내의 영역을 제2 해상도로 렌더 링하고, 카메라 영역으로부터 제3 기준 거리 초과 제4 기준 거리 이내의 영역을 제3 해상도로 렌더링 하고, 및 카메라 영역으로부터 제4 기준 거리 초과 제5 기준 거리 이내의 영역을 제4 해상도로 렌더 링할 수 있다. 특정 영역의 해상도는, 카메라 영역으로부터의 거리에 따라 결정되는 해상도, 또는 카메라 영역으로 부터의 거리에 따라 결정되는 해상도 중 높은 해상도가 적용될 수 있다. 도 8c를 참조하면, 프레임의 경우, 어플리케이션 영역의 일부 영역(833, 834)이 카메라 영역에 인접 하므로, 프로세서는 일부 영역(833, 834)의 해상도를 주변 영역의 해상도보다 높게 설정할 수 있다. 프레 임의 경우, 어플리케이션 영역의 일부 영역(835, 836)이 카메라 영역에 인접하므로, 프로세서는 일부 영역(835, 836)의 해상도를 주변 영역의 해상도보다 높게 설정할 수 있다. 예를 들면, 프레임의 경우, 프로세서는 관심 영역이 위치한 카메라 영역을 기준 해상도로 렌더링하고, 카메라 영역으로부터 제2 기준 거리 이내의 영역을 제1 해상도로 렌더링하고, 카메라 영역으로부터 제2 기준 거리 초과 제3 기준 거리 이내의 영역을 제2 해상도로 렌더링하고, 카메라 영역으로부터 제3 기 준 거리 초과 제4 기준 거리 이내의 영역을 제3 해상도로 렌더링하고, 및 카메라 영역으로부터 제4 기준 거리 초과 제5 기준 거리 이내의 영역을 제4 해상도로 렌더링할 수 있다. 또한, 예를 들면, 프레임의 경우, 프로세서는 관심 영역이 위치하지 않은 카메라 영역을 기준 해상도로 렌더링하고, 카메라 영역으로부터 제2 기준 거리 이내의 영역을 제1 해상도로 렌 더링하고, 카메라 영역으로부터 제2 기준 거리 초과 제3 기준 거리 이내의 영역을 제2 해상도로 렌더 링하고, 카메라 영역으로부터 제3 기준 거리 초과 제4 기준 거리 이내의 영역을 제3 해상도로 렌더링 하고, 및 카메라 영역으로부터 제4 기준 거리 초과 제5 기준 거리 이내의 영역을 제4 해상도로 렌더 링할 수 있다. 특정 영역의 해상도는, 카메라 영역으로부터의 거리에 따라 결정되는 해상도, 또는 카메라 영역으로 부터의 거리에 따라 결정되는 해상도 중 높은 해상도가 적용될 수 있다. 프로세서는 웨어러블 장치의 상태에 기반하여, 카메라 영역에 인접한 영역들의 해상도를 다르게 설정 할 수 있다. 도 8b를 참조하면, 프로세서는 배터리의 잔량의 기준 잔량 이상인 경우의 프레임의 일부 영역의 해상도를 배터리의 잔량의 기준 잔량 미만인 경우의 프레임의 일부 영역의 해 상도보다 높게 설정할 수 있다. 예를 들면, 배터리의 잔량의 기준 잔량 미만인 경우의 제2 해상도는 배터 리의 잔량의 기준 잔량 이상인 경우의 제2 해상도보다 낮을 수 있다. 예를 들면, 배터리의 잔량의 기준 잔량 미만인 경우, 프레임의 일부 영역의 해상도는 배터리 의 잔량의 기준 잔량 이상인 경우, 프레임의 일부 영역의 해상도보다 낮을 수 있다. 예를 들면, 배터리의 잔량의 기준 잔량 미만인 경우, 프로세서는 관심 영역이 위치하지 않은 카메라 영역 으로부터 제2 기준 거리 이내의 영역을 제3 해상도로 렌더링하고, 카메라 영역으로부터 제2 기 준 거리를 초과하는 영역을 제4 해상도로 렌더링할 수 있다. 프레임의 경우에도, 특정 영역의 해상도 는, 카메라 영역으로부터의 거리에 따라 결정되는 해상도, 또는 카메라 영역으로부터의 거리에 따라 결정되는 해상도 중 높은 해상도가 적용될 수 있다. 도 8c를 참조하면, 프로세서는 배터리 잔량의 기준 잔량 이상인 경우의 프레임의 일부 영역(833, 834)의 해상도를 배터리 잔량의 기준 잔량 미만인 경우의 프레임의 일부 영역(835, 836)의 해상도보다 높 게 설정할 수 있다. 예를 들면, 배터리의 잔량의 기준 잔량 미만인 경우, 프레임의 일부 영역들(835, 836)의 해상도는 배 터리의 잔량의 기준 잔량 이상인 경우, 프레임의 일부 영역들(833, 834)의 해상도보다 낮을 수 있다. 예를 들면, 배터리의 잔량의 기준 잔량 미만인 경우, 프로세서는 관심 영역이 위치하지 않은 카 메라 영역으로부터 제2 기준 거리 이내의 영역을 제3 해상도로 렌더링하고, 카메라 영역으로부 터 제2 기준 거리를 초과하는 영역을 제4 해상도로 렌더링할 수 있다. 프레임의 경우에도, 특정 영역 의 해상도는, 카메라 영역으로부터의 거리에 따라 결정되는 해상도, 또는 카메라 영역으로부터의 거 리에 따라 결정되는 해상도 중 높은 해상도가 적용될 수 있다. 도 8b 및 도 8c에서, 프로세서가 관심 영역이 위치하는 카메라 영역들(811, 813)의 테두리로부터 떨 어진 거리에 기반하여 카메라 영역의 해상도를 결정하는 것으로 예시되었다. 하지만, 이에 제한되지 않는다. 예 를 들면, 프로세서가 카메라 영역들(811, 813)에 위치하는 관심 영역으로부터 떨어진 거리에 기반하 여 카메라 영역의 해상도를 결정할 수 있다. 이 경우, 프레임들(831, 832)에서 관심 영역이 위치하는 카메 라 영역의 위 영역의 해상도는 카메라 영역의 아래 영역의 해상도보다 높을 수 있다. 프로세서는 카메라 영역의 크기에 기초하여, 어플리케이션 영역의 해상도를 결정할 수 있다. 예를 들면, 프로세서는 카메라 영역의 크기가 기준 카메라 영역보다 작은 경우, 어플리케이션 영역의 해상도를 기준 해상도로 설정할 수 있다. 예를 들면, 프로세서는 카메라 영역으로부터 기준 카메라 영역까지의 어플리케 이션 영역의 해상도를 기준 해상도로 설정할 수 있다. 도 8d를 참조하면, 프로세서는 카메라 영역을 둘러싸는 어플리케이션 영역의 해상도를 기준 해상도로 설정할 수 있다. 여기에서, 카메라 영역 및 어플리케이션 영역을 포함하는 영역은 기준 카메라 영역일 수 있다. 하지만, 이에 제한되지 않는다. 도 9a는, 프레임 상의 관심 영역에 따른 해상도의 설정의 예를 도시한다. 도 9b는, 프레임 상의 관심 영역에 따 른 해상도의 설정의 예를 도시한다. 도 9a, 및 도 9b의 설명에는 도 1, 도 2a, 도 2b 도 3a, 및 도 3b를 통해 설명된 전자 장치 또는 웨어러블 장치의 구성 요소 또는 구조가 참조될 수 있다. 도 7b, 및 도 7c와 비교하여, 도 9a, 및 도 9b는 프로세서가 해상도를 웨어러블 장치의 상태에 기반 하여, 둘 이상의 카메라 영역들(811, 812, 813, 814)이 존재하는 프레임들(911, 912, 913, 921, 922, 923)의 해상도를 설정하는 예를 도시한다. 도 9a의 프레임들(911, 912, 913)을 비교하면, 프레임, 프레임, 프레임의 순서대로 해상도가 낮 아질 수 있다. 예를 들면, 프로세서는 배터리 잔량이 낮을수록 높은 해상도로 어플리케이션 영역의 해상도 를 설정할 수 있다. 예를 들면, 배터리 잔량이 가장 높은 제1 잔량 상황에서, 프로세서는 프레임에서 관심 영역이 위치하는 카메라 영역을 둘러싸는 어플리케이션 영역의 해상도를 관심 영역이 위치하지 않는 카메라 영역을 둘러싸는 어플리케이션 영역의 해상도보다 높게 설정할 수 있다. 예를 들면, 프로세서는 관심 영역, 및/또는 카메라 영역들(811, 812)로부터의 거리에 따라, 제1 개수의 단계들(예: 4 단계)로 나누어 어플리케이션 영역의 해상도를 결정할 수 있다. 예를 들면, 프레임의 경우, 프로세서는 관심 영역 이 위치한 카메라 영역으로부터 제2 기준 거리 이내의 영역을 제1 해상도로 렌더링하고, 카메라 영역으로부터 제2 기준 거리 초과 제3 기준 거리 이내의 영역을 제2 해상도로 렌더링하고, 카메라 영 역으로부터 제3 기준 거리 초과 제4 기준 거리 이내의 영역을 제3 해상도로 렌더링하고, 및 카메라 영역으로부터 제4 기준 거리 초과 제5 기준 거리 이내의 영역을 제4 해상도로 렌더링할 수 있다. 프 레임의 경우, 프로세서는 관심 영역이 위치하지 않은 카메라 영역으로부터 제2 기준 거리 이내의 영역을 제1 해상도로 렌더링하고, 카메라 영역으로부터 제2 기준 거리 초과 제3 기준 거리 이 내의 영역을 제2 해상도로 렌더링하고, 카메라 영역으로부터 제3 기준 거리 초과 제4 기준 거리 이내 의 영역을 제3 해상도로 렌더링하고, 및 카메라 영역으로부터 제4 기준 거리 초과 제5 기준 거리 이 내의 영역을 제4 해상도로 렌더링할 수 있다. 예를 들면, 배터리 잔량이 두 번째로 높은 제2 잔량 상황에서, 프로세서는 프레임에서 관심 영역 이 위치하는 카메라 영역을 둘러싸는 어플리케이션 영역의 해상도와 관심 영역이 위치하지 않는 카메라 영역을 둘러싸는 어플리케이션 영역의 해상도를 중간 단계의 제2 해상도로 동일하게 설정할 수 있다. 예를 들면, 프로세서는 관심 영역, 및/또는 카메라 영역들(811, 812)로부터의 거리에 따라, 제1 개수보다 적은 제2 개수의 단계들(예: 3 단계)로 나누어 어플리케이션 영역의 해상도를 결정할 수 있다. 예 를 들면, 프레임의 경우, 프로세서는 관심 영역이 위치한 카메라 영역으로부터 제2 기준 거리 이내의 영역을 제2 해상도로 렌더링하고, 카메라 영역으로부터 제2 기준 거리 초과 제3 기준 거 리 이내의 영역을 제3 해상도로 렌더링하고, 카메라 영역으로부터 제3 기준 거리를 초과하는 영역을 제4 해상도로 렌더링할 수 있다. 프레임의 경우, 프로세서는 관심 영역이 위치하지 않은 카메라 영역으로부터 제2 기준 거리 이내의 영역을 제2 해상도로 렌더링하고, 카메라 영역으로 부터 제2 기준 거리 초과 제3 기준 거리 이내의 영역을 제3 해상도로 렌더링하고, 카메라 영역으로부 터 제3 기준 거리를 초과하는 영역을 제4 해상도로 렌더링할 수 있다. 예를 들면, 배터리 잔량이 제일 낮은 제3 잔량 상황에서, 프로세서는 프레임에서 관심 영역이 위치하는 카메라 영역을 둘러싸는 어플리케이션 영역의 해상도와 관심 영역이 위치하지 않는 카메라 영역을 둘러싸는 어플리케이션 영역의 해상도를 낮은 단계의 해상도로 동일하게 설정할 수 있다. 예 를 들면, 프로세서는 관심 영역, 및/또는 카메라 영역들(811, 812)로부터의 거리에 따라, 제2 개수보 다 적은 제3 개수의 단계들(예: 2 단계)로 나누어 어플리케이션 영역의 해상도를 결정할 수 있다. 예를 들면, 프레임의 경우, 프로세서는 관심 영역이 위치한 카메라 영역으로부터 제2 기준 거리 이내 의 영역을 제3 해상도로 렌더링하고, 카메라 영역으로부터 제2 기준 거리를 초과하는 영역을 제4 해 상도로 렌더링할 수 있다. 프레임의 경우, 프로세서는 관심 영역이 위치하지 않은 카메라 영역으로부터 제2 기준 거리 이내의 영역을 제3 해상도로 렌더링하고, 카메라 영역으로부터 제2 기준 거리를 초과하는 영역을 제4 해상도로 렌더링할 수 있다. 예를 들면, 배터리 잔량이 제일 낮은 제3 잔량 상황에서, 프로세서는 나머지 영역들의 해상도를 가장 낮은 단계의 해상도로 설정할 수 있다. 여기에서, 나머지 영역들은 카메라 영역들(811, 812)을 둘러싸는 어플리 케이션 영역들 이외의 어플리케이션의 영역들일 수 있다. 하지만, 이에 제한되지 않는다. 예를 들면, 프로세서 는 웨어러블 장치의 온도에 기반하여, 프레임, 프레임, 프레임의 해상도를 다르게 설 정할 수 있다. 도 9b의 프레임들(921, 922, 923)은 도 9a의 프레임들(911, 912, 913)과 마찬가지로, 프레임, 프레임 , 프레임의 순서대로 해상도가 낮아질 수 있다. 예를 들면, 프레임의 경우, 프로세서는 관심 영역, 및/또는 카메라 영역들(813, 814)로부터의 거리에 따라, 제1 개수의 단계들(예: 4 단계)로 나누어 어플리케이션 영역의 해상도를 결정할 수 있다. 예를 들면, 프레임의 경우, 프로세서는 관심 영역, 및/또는 카메라 영역들(813, 814)로부터의 거리에 따라, 제1 개수보다 적은 제2 개수의 단계들(예: 3 단계)로 나누어 어플리케이션 영역의 해상도를 결정 할 수 있다. 예를 들면, 프레임의 경우, 프로세서는 관심 영역, 및/또는 카메라 영역들(813, 814)로부터의 거리에 따라, 제1 개수보다 적은 제2 개수의 단계들(예: 3 단계)로 나누어 어플리케이션 영역의 해상도를 결정 할 수 있다. 도 10a는, 웨어러블 장치 주변의 환경에 존재하는 객체들의 예를 도시한다. 도 10b는, 카메라 이미지와 어 플리케이션 이미지 간의 합성의 예를 도시한다. 도 10a, 및 도 10b의 설명에는 도 1, 도 2a, 도 2b 도 3a, 및 도 3b를 통해 설명된 전자 장치 또는 웨어 러블 장치의 구성 요소 또는 구조가 참조될 수 있다. 도 10a는 웨어러블 장치 주변의 환경 및 카메라가 획득하는 주변의 환경에 대한 카메라 이미지를 예시한다. 도 10a를 참조하면, 웨어러블 장치 주변의 환경에는 하나 이상의 객체들(1011, 1012, 1013, 1014, 1015)이 존재할 수 있다. 프로세서는 카메라를 통해 웨어러블 장치 주변의 환경 중 일부 에 대한 카메라 이미지를 획득할 수 있다. 카메라 이미지에는 주변의 환경의 객체들(1011, 1012, 1013, 1014, 1015) 중 일부 객체들(1012, 1013, 1014, 1015)이 포함될 수 있다. 예를 들면, 프로세서는 객체들(1012, 1013, 1014, 1015)이 포함된 영역에 기반하여, 카메라 영역을 설정할 수 있다. 예를 들면, 프로세서는 카메라 이미지에서 일부 객체들(1012, 1013, 1014, 1015)을 식별 할 수 있다. 예를 들면, 프로세서는 식별된 일부 객체들(1012, 1013, 1014, 1015)에 기반하여, 상기 카메 라 영역을 설정할 수 있다. 프로세서는 카메라 이미지에 포함된 객체의 정보에 기초하여, 상기 카메라 영역을 설정할 수 있다. 예를 들면, 프로세서는 사용자가 사전 설정한 객체가 카메라 이미지에서 식별됨에 응답하여, 식별된 객체의 영역에 대응하는 프레임 상의 영역을 상기 카메라 영역으로 설정할 수 있다. 예를 들면, 사용자가 사전 설정한 객체가 컴퓨터 및 키보드인 경우, 프로세서는 카메라 이미지에 포함된 일부 객체들(1012, 1013, 1014, 1015)에서 객체, 및 객체의 영역들에 대응하는 프레임 상의 영역들을 상기 카메라 영 역으로 설정할 수 있다. 여기에서, 객체의 정보는 식별된 객체의 종류, 또는 명칭을 나타낼 수 있다. 도 10b를 참조하면, 프로세서는, 카메라 이미지의 일부 영역을 포함하는 프레임을 생성할 수 있다. 예를 들면, 프로세서는 카메라 이미지 및 어플리케이션 이미지에 기반하여 프레임을 생 성할 수 있다. 예를 들면, 프로세서는 카메라 이미지 및 어플리케이션 이미지를 합성함으로써, 프레임을 생성할 수 있다. 예를 들면, 프로세서는 어플리케이션 이미지에 카메라 영역을 중첩(또는, 합성)함으로써, 프레임 을 생성할 수 있다. 예를 들면, 프로세서는 카메라 이미지에서 식별된 일부 객체들(1012, 1013)에 대응하는 영역을 대응하는 어플리케이션 이미지 상의 영역에 합성할 수 있다. 도 11은, 웨어러블 장치에서 실행되는 방법의 흐름도이다. 도 11의 설명에는 도 1, 도 2a, 도 2b 도 3a, 및 도 3b를 통해 설명된 전자 장치 또는 웨어러블 장치(20 0)의 구성 요소 또는 구조가 참조될 수 있다. 이하 실시예에서 각 동작들은 순차적으로 수행될 수도 있으나, 반드시 순차적으로 수행되는 것은 아니다. 예를 들어, 각 동작들의 순서가 변경될 수도 있으며, 적어도 두 동작들이 병렬적으로 수행될 수도 있다. 도 11을 참조하면, 동작 1110에서, 프로세서는 사용자 입력을 수신할 수 있다. 사용자 입력은 사용자의 시 선(gaze)을 포함할 수 있다. 여기에서, 사용자의 시선은 ET를 위한 카메라들(240-1, 240-2)에 획득되는 이미지 들에 기반하여 식별될 수 있다. 카메라들(240-1, 240-2)에 획득되는 이미지들은 글린트 이미지일 수 있다. 하지 만, 이에 제한되지 않는다. 사용자 입력은 사용자의 입력 모듈과의 상호 작용을 포함할 수 있다. 예를 들 면, 프로세서는 사용자의 제스처 입력이 지시하는 객체에 기반하여 관심 영역을 식별할 수 있다. 동작 1120에서, 프로세서는 사용자 입력이 나타내는 영역이 카메라 영역에 포함되는지를 식별할 수 있다. 여기에서, 사용자 입력이 나타내는 영역은 상기 관심 영역일 수 있다. 동작 1120에서, 사용자 입력이 나타내는 영역이 카메라 영역에 포함되는 경우('예'), 프로세서는 동작 1130을 수행할 수 있다. 동작 1120에서, 사용자 입력이 나타내는 영역이 카메라 영역에 포함되지 않는 경우('아 니오'), 프로세서는 동작 1140을 수행할 수 있다. 동작 1130에서, 프로세서는 제1 처리 방식에 기초하여 카메라 이미지를 처리할 수 있다. 예를 들면, 제1 처리 방식은, 프로세서가 ISP의 프레임율(또는, FPS)을 변경하는 방식일 수 있다. 예 를 들면, 제1 처리 방식은, 프로세서가 카메라 이미지의 생성 속도(또는, 샘플링율, FPS)를 높게 설정하는 방식일 수 있다. 예를 들면, 제1 처리 방식은, 프로세서가 카메라 이미지를 위한 FPS를 제2 FPS보다 높게 설정하는 방식일 수 있다. 예를 들면, 제1 처리 방식은, 프로세서가 ISP의 프레임율(또는, FPS)을 변경하고, 카메라 이미지의 IPE를 통한 이미지 처리를 바이패스하는 방식일 수 있다. 예를 들면, 제1 처리 방식은, 프로세서가 카메라 이미지를 위한 FPS를 제2 FPS보다 높게 설정하고, 카메라 이미지의 IPE를 통한 이미지 처리를 바이 패스하는 방식일 수 있다. 여기에서, IPE를 바이패스함은, IFE 엔진을 통해 처리된 카메라 이미지가 IFE 엔진에서 프로세서로 직접, 또는 메모리를 통해 간접적으로 전달됨을 의미할 수 있다. IPE를 바이패스함은, IFE 엔진에 의해 처리된 카메라 이미지에 기반한 프레임을 디스플레이를 통해 표시함을 의미할 수 있다. IPE를 바이패스함은, IFE 엔진을 통해 처리된 카메라 이미지에 대한 IPE를 통한 이미지 처리가 수행되지 않음을 의미할 수 있다. IPE를 바이패스함은, IFE 엔진을 통해 전처리된 카메라 이미지를 IPE를 통해 후처리하지 않음을 의미할 수 있다. 예를 들면, 제1 처리 방식은, 프로세서가, 카메라 이미지를 위한 FPS를 제2 FPS와 동일하게(또는, 높지 않 게) 설정하고, 카메라 이미지의 IPE를 통한 이미지 처리를 바이패스하지 않는 방식일 수 있다. 여기에서, IPE를 바이패스하지 않음은, IFE 엔진을 통해 처리된 카메라 이미지가 IFE 엔진에서 IPE로 직접, 또는 메모리를 통해 간접적으로 전달됨을 의미할 수 있다. IPE를 바이패스하지 않음은, IFE 엔 진 및 IPE에 의해 처리된 카메라 이미지에 기반한 프레임을 디스플레이를 통해 표시함을 의미할 수 있다. IPE를 바이패스하지 않음은, IFE 엔진을 통해 처리된 카메라 이미지에 대한 IPE를 통 한 이미지 처리가 수행됨을 의미할 수 있다. IPE를 바이패스하지 않음은, IFE 엔진을 통해 전처리된 카메라 이미지를 IPE를 통해 후처리함을 의미할 수 있다. 동작 1140에서, 프로세서는 제2 처리 방식에 기초하여 카메라 이미지를 처리할 수 있다. 예를 들면, 제2 처리 방식은, 프로세서가 ISP의 프레임율(또는, FPS)을 변경하는 방식일 수 있다. 예 를 들면, 제2 처리 방식은, 프로세서가 카메라 이미지의 생성 속도(또는, 샘플링율, FPS)를 낮게 설정하는 방식일 수 있다. 예를 들면, 제2 처리 방식은, 프로세서가 카메라 이미지를 위한 FPS를 제2 FPS와 동일하 게(또는, 높지 않게) 설정하는 방식일 수 있다. 예를 들면, 제2 처리 방식은, ISP의 프레임율(또는, FPS)을 변경하고, 카메라 이미지의 IPE를 통한 이미지 처리를 바이패스하는 방식일 수 있다. 예를 들면, 제2 처리 방식은, 프로세서가 카메라 이미지를 위한 FPS를 제2 FPS와 동일하게(또는, 높지 않게) 높게 설정하고, 카메라 이미지의 IPE를 통한 이미지 처 리를 바이패스하는 방식일 수 있다. 도 12은, 웨어러블 장치에서 실행되는 방법의 흐름도이다. 도 12의 설명에는 도 1, 도 2a, 도 2b 도 3a, 및 도 3b를 통해 설명된 전자 장치 또는 웨어러블 장치(20 0)의 구성 요소 또는 구조가 참조될 수 있다. 이하 실시예에서 각 동작들은 순차적으로 수행될 수도 있으나, 반드시 순차적으로 수행되는 것은 아니다. 예를 들어, 각 동작들의 순서가 변경될 수도 있으며, 적어도 두 동작들이 병렬적으로 수행될 수도 있다. 도 12를 참조하면, 동작 1210에서, 프로세서는 사용자 입력을 수신할 수 있다. 사용자 입력은 사용자의 시 선(gaze)을 포함할 수 있다. 사용자 입력은 사용자의 입력 모듈과의 상호 작용을 포함할 수 있다. 동작 1220에서, 프로세서는 사용자 입력이 나타내는 영역의 변화가 기준 범위를 초과하는지를 식별할 수 있다. 여기에서, 카메라 영역의 변화는 디스플레이 상에서 순차적으로 표시되는 프레임들 상에서의 카메라 영역의 위치 이동을 포함할 수 있다. 카메라 영역의 변화는 디스플레이 상에서 순차적으로 표시되는 프레 임들 각각의 카메라 영역에 포함된 객체의 이동, 또는 픽셀 값의 변화를 포함할 수 있다. 동작 1220에서, 사용자 입력이 나타내는 영역의 변화가 기준 범위를 초과하는 경우('예'), 프로세서는 동 작 1230을 수행할 수 있다. 동작 1220에서, 사용자 입력이 나타내는 영역의 변화가 기준 범위를 초과하지 않는 경우('아니오'), 프로세서는 동작 1240을 수행할 수 있다. 동작 1230에서, 프로세서는 제1 처리 방식에 기초하여 카메라 이미지를 처리할 수 있다. 동작 1240에서, 프로세서는 제2 처리 방식에 기초하여 카메라 이미지를 처리할 수 있다. 상술한 바와 같은 웨어러블 장치는, 카메라를 포함할 수 있다. 일 실시 예에 따르면, 웨어러블 장치 는 디스플레이를 포함할 수 있다. 일 실시 예에 따르면, 웨어러블 장치는 이미지 시그널 프로세 서를 포함할 수 있다. 일 실시 예에 따르면, 웨어러블 장치는 프로세서를 포함할 수 있다. 일 실시 예에 따르면, 상기 프로세서는, 사용자 입력에 기반하여, 상기 디스플레이를 통해 출력되는 제1 프레임에서 관심 영역(region of interest, ROI)을 식별하도록 구성될 수 있다. 일 실시 예에 따르면, 상기 제1 프레임에 포함되는 카메라 영역은, 제1 시점의 상기 카메라를 통해 획득되는 제1 카메라 이미지의 적어도 일부 영역에 대응할 수 있다. 일 실시 예에 따르면, 상기 프로세서는, 상기 관심 영역이 상기 카메라 영역 에 중첩됨에 기반하여, 상기 이미지 시그널 프로세서가 상기 제1 시점 이후의 제2 시점에 획득되는 제2 카 메라 이미지를 제1 처리 방식으로 처리하도록 제어하도록 구성될 수 있다. 일 실시 예에 따르면, 상기 프로세서 는, 상기 관심 영역이 상기 카메라 영역을 벗어남에 기반하여, 상기 이미지 시그널 프로세서가 상기 제2 카메라 이미지를 상기 제1 처리 방식과 구분되는 제2 처리 방식을 통해 처리하도록 제어하도록 구성될 수 있다. 일 실시 예에 따르면, 상기 프로세서는, 처리된 상기 제2 카메라 이미지의 적어도 일부 영역에 대응 하는 상기 카메라 영역을 포함하는 제2 프레임을 상기 디스플레이를 통해 표시하도록 구성될 수 있다. 일 실시 예에 따르면, 웨어러블 장치는 센서를 더 포함할 수 있다. 일 실시 예에 따르면, 상기 프로 세서는, 상기 센서를 통해 식별되는 사용자의 시선을 상기 사용자 입력으로 획득하도록 구성될 수 있 다. 일 실시 예에 따르면, 상기 프로세서는, 상기 사용자 입력으로 획득되는 상기 사용자의 시선에 기반하 여 상기 ROI를 식별하도록 구성될 수 있다. 일 실시 예에 따르면, 상기 프로세서는, 상기 관심 영역이 중첩되는 상기 카메라 영역의 픽셀 값들의 변화 를 나타내는 데이터가 기준 범위 밖에 있음을 식별하는 것에 응답하여, 상기 이미지 시그널 프로세서가 상 기 카메라 영역 밖의 상기 프레임의 다른 영역의 제2 FPS(frame per second)보다 높은 제1 FPS로 상기 카메라 영역을 위한 상기 제2 카메라 이미지를 획득하도록 제어하도록 구성될 수 있다. 일 실시 예에 따르면, 상기 프 로세서는, 상기 데이터가 상기 기준 범위 내에 있음을 식별하는 것에 응답하여, 상기 이미지 시그널 프로 세서가 상기 카메라 영역을 위한 상기 제2 카메라 이미지를 상기 제2 FPS로 획득하도록 제어하도록 구성될 수 있다. 일 실시 예에 따르면, 상기 프로세서는, 상기 데이터가 기준 범위 밖에 있음을 식별하는 것에 응답하여, 상기 이미지 시그널 프로세서가 상기 제1 FPS로 획득되는 상기 카메라 영역을 위한 상기 제2 카메라 이미 지의 후처리를 바이패스하도록 제어하도록 구성될 수 있다. 일 실시 예에 따르면, 상기 프로세서는, 상기 데이터가 상기 기준 범위 내에 있음을 식별하는 것에 응답하 여, 상기 이미지 시그널 프로세서가 상기 제2 FPS로 획득되는 상기 카메라 영역을 위한 상기 제2 카메라 이미지를 후처리하도록 제어하도록 구성될 수 있다.일 실시 예에 따르면, 상기 프로세서는, 상기 관심 영역이 상기 카메라 영역을 벗어남에 기반하여, 상기 이미지 시그널 프로세서가 상기 제2 카메라 이미지를 상기 제2 FPS로 획득하고, 및 상기 제2 FPS로 획득되 는 상기 카메라 영역을 위한 상기 제2 카메라 이미지의 후처리를 바이패스하도록 제어하도록 구성될 수 있다. 일 실시 예에 따르면, 상기 프로세서는, 상기 관심 영역이 중첩되는 상기 카메라 영역의 휘도가 기준 휘도 를 초과함을 식별하는 것에 응답하여, 상기 이미지 시그널 프로세서가 상기 제1 시점 이후의 제2 시점에 획득되는 제2 카메라 이미지를 제1 처리 방식으로 처리하도록 제어하도록 구성될 수 있다. 일 실시 예에 따르면, 상기 프로세서는, 상기 관심 영역이 중첩되는 상기 카메라 영역의 휘도가 기준 휘도 이하임을 식 별하는 것에 응답하여, 상기 이미지 시그널 프로세서가 상기 카메라 영역을 위한 상기 제2 카메라 이미지 를 상기 제2 처리 방식을 통해 처리하도록 제어하도록 구성될 수 있다. 일 실시 예에 따르면, 상기 프로세서는, 어플리케이션을 실행함으로써 획득되는 어플리케이션 이미지에 기 반한, 상기 제2 프레임을 상기 디스플레이 상에서 표시하도록 구성될 수 있다. 일 실시 예에 따르면, 상기 제2 프레임은 상기 제2 카메라 이미지에 기반한 상기 카메라 영역 및 상기 어플리케이션 이미지에 기반한 어플 리케이션 영역을 포함할 수 있다. 일 실시 예에 따르면, 상기 카메라 영역은 상기 어플리케이션의 사용 정보가 나타내는 이전에 설정된 카메라 영 역에 기초하여, 설정될 수 있다. 일 실시 예에 따르면, 상기 프로세서는, 상기 제1 카메라 이미지에 포함된 적어도 하나의 객체를 식별하도 록 구성될 수 있다. 일 실시 예에 따르면, 상기 프로세서는, 상기 식별된 적어도 하나의 객체 중 지정된 종류의 객체를 식별하도록 구성될 수 있다. 일 실시 예에 따르면, 상기 프로세서는, 상기 지정된 종류의 객체의 영역에 기반하여, 상기 카메라 영역을 설정하도록 구성될 수 있다. 상술한 바와 같은, 방법은 카메라, 및 디스플레이를 포함하는 웨어러블 장치에서 실행될 수 있 다. 일 실시 예에 따르면, 방법은, 사용자 입력에 기반하여, 상기 디스플레이를 통해 출력되는 제1 프레임 에서 관심 영역(region of interest, ROI)을 식별하는 동작을 포함할 수 있다. 일 실시 예에서, 상기 제1 프레 임에 포함되는 카메라 영역은, 제1 시점의 상기 카메라를 통해 획득되는 제1 카메라 이미지의 적어도 일부 영역에 대응할 수 있다. 상기 방법은 상기 관심 영역이 상기 카메라 영역에 중첩됨에 기반하여, 상기 제1 시점 이후의 제2 시점에 획득되는 제2 카메라 이미지를 제1 처리 방식으로 처리하는 동작을 포함할 수 있다. 상기 방 법은 상기 관심 영역이 상기 카메라 영역을 벗어남에 기반하여, 상기 제2 카메라 이미지를 상기 제1 처리 방식 과 구분되는 제2 처리 방식을 통해 처리하는 동작을 포함할 수 있다. 상기 방법은 처리된 상기 제2 카메라 이미 지의 적어도 일부 영역에 대응하는 상기 카메라 영역을 포함하는 제2 프레임을 상기 디스플레이를 통해 표 시하는 동작을 포함할 수 있다. 상술한 바와 같은, 비일시적 컴퓨터 판독가능 저장 매체(non-transitory computer readable storage medium)는 인스트럭션들을 포함하는 하나 이상의 프로그램들을 저장할 수 있다. 일 실시 예에 따르면, 상기 인스트럭 션들은, 카메라, 및 디스플레이를 포함하는 웨어러블 장치의 프로세서에 의해 실행될 시, 사용자 입력에 기반하여, 상기 디스플레이를 통해 출력되는 제1 프레임에서 관심 영역(region of interest, ROI)을 식별하도록 야기될 수 있다. 상기 제1 프레임에 포함되는 카메라 영역은, 제1 시점의 상기 카 메라를 통해 획득되는 제1 카메라 이미지의 적어도 일부 영역에 대응할 수 있다. 상기 인스트럭션들은, 프 로세서에 의해 실행될 시, 상기 웨어러블 장치가 상기 관심 영역이 상기 카메라 영역에 중첩됨에 기 반하여, 상기 이미지 시그널 프로세서가 상기 제1 시점 이후의 제2 시점에 획득되는 제2 카메라 이미지를 제1 처리 방식으로 처리하도록 제어하도록 야기할 수 있다. 상기 인스트럭션들은, 프로세서에 의해 실행될 시, 상기 웨어러블 장치가 상기 관심 영역이 상기 카메라 영역을 벗어남에 기반하여, 상기 이미지 시그널 프로세서가 상기 제2 카메라 이미지를 상기 제1 처리 방식과 구분되는 제2 처리 방식을 통해 처리하도록 제어하도록 야기할 수 있다. 상기 인스트럭션들은, 프로세서에 의해 실행될 시, 상기 웨어러블 장치 가 처리된 상기 제2 카메라 이미지의 적어도 일부 영역에 대응하는 상기 카메라 영역을 포함하는 제2 프레임을 상기 디스플레이를 통해 표시하도록 야기할 수 있다. 상술한 바와 같은, 웨어러블 장치는 카메라를 포함할 수 있다. 일 실시 예에 따르면, 웨어러블 장치 는 디스플레이를 포함할 수 있다. 일 실시 예에 따르면, 웨어러블 장치는 이미지 시그널 프로세 서를 포함할 수 있다. 일 실시 예에 따르면, 웨어러블 장치는 프로세서를 포함할 수 있다. 일 실시 예에 따르면, 상기 프로세서는, 제1 시점의 상기 카메라를 통해 획득되는 상기 웨어러블 장치 주변의 환경에 대한 제1 카메라 이미지의 적어도 일부 영역을 카메라 영역으로 포함하는 제1 프레임을 상기 디스플레이 상에서 표시하도록 구성될 수 있다. 일 실시 예에 따르면, 상기 프로세서는 상기 제1 프레임이 상기 디스플레이 상에서 표시되는 동안, ROI(region of interest)에 대응하는 상기 프레임 내의 상기 카메라 영역을 식별하도록 구성될 수 있다. 일 실시 예에 따르면, 상기 프로세서는 상기 카메라 영역 의 픽셀 값들의 변화를 나타내는 데이터가 기준 범위 밖에 있음을 식별하는 것에 응답하여, 상기 이미지 시그널 프로세서가 상기 카메라 영역 밖의 상기 프레임의 영역의 제2 FPS(frame per second)보다 높은 제1 FPS로 상기 카메라 영역을 위한 상기 카메라 이미지들을 획득하도록 제어하도록 구성될 수 있다. 일 실시 예에 따르면, 상기 프로세서는 상기 데이터가 상기 기준 범위 내에 있음을 식별하는 것에 응답하여, 상기 이미 지 시그널 프로세서가 상기 카메라 영역을 위한 상기 카메라 이미지들을 상기 제2 FPS로 획득하도록 제어 하도록 구성될 수 있다. 일 실시 예에 따르면, 상기 프로세서는 상기 데이터가 기준 범위 밖에 있음을 식별하는 것에 응답하여, 상 기 이미지 시그널 프로세서가 상기 제1 FPS로 획득되는 상기 카메라 영역을 위한 상기 카메라 이미지들의 후처리를 바이패스하도록 제어하도록 구성될 수 있다. 일 실시 예에 따르면, 상기 프로세서는 상기 데이터가 상기 기준 범위 내에 있음을 식별하는 것에 응답하 여, 상기 이미지 시그널 프로세서가 상기 제2 FPS로 획득되는 상기 카메라 이미지들을 후처리하도록 제어 하도록 구성될 수 있다. 일 실시 예에 따르면, 웨어러블 장치는 센서를 더 포함할 수 있다. 일 실시 예에 따르면, 상기 프로 세서는 상기 센서를 통해 사용자 입력을 상기 사용자 입력으로 획득하도록 구성될 수 있다. 일 실시 예에 따르면, 상기 프로세서는 상기 사용자 입력으로 획득되는 상기 사용자의 시선에 기반하여, 상기 ROI 를 식별하도록 구성될 수 있다. 일 실시 예에 따르면, 상기 프로세서는 상기 카메라 영역의 휘도가 기준 휘도 이하임을 식별하는 것에 응 답하여, 상기 이미지 시그널 프로세서가 상기 제2 FPS로 상기 카메라 영역을 위한 상기 카메라 이미지들을 획득하고, 및 상기 제2 FPS로 획득되는 상기 카메라 영역을 위한 상기 카메라 이미지들의 후처리를 바이패스하 도록 제어하도록 구성될 수 있다. 일 실시 예에 따르면, 상기 프로세서는 상기 카메라 영역의 휘도가 기준 휘도를 초과함을 식별하는 것에 응답하여, 상기 이미지 시그널 프로세서가 상기 카메라 영역의 변화를 나타내는 상기 데이터에 기반하여 상기 카메라 영역을 처리하도록 제어하도록 구성될 수 있다. 일 실시 예에 따르면, 상기 프로세서는 어플리케이션을 실행함으로써 획득되는, 제1 어플리케이션 이미지 에 기반하는, 상기 제1 프레임을 상기 디스플레이 상에서 표시하도록 구성될 수 있다. 일 실시 예에 따르 면, 상기 제1 프레임은 상기 제1 카메라 이미지에 기반한 카메라 영역 및 상기 제1 어플리케이션 이미지에 기반 한 어플리케이션 영역을 포함할 수 있다. 일 실시 예에 따르면, 상기 제1 프레임의 상기 카메라 영역은 상기 어 플리케이션 영역에 중첩될 수 있다. 일 실시 예에 따르면, 상기 카메라 영역은 상기 어플리케이션의 사용 정보가 나타내는 이전에 설정된 카메라 영 역에 기초하여, 설정될 수 있다. 일 실시 예에 따르면, 상기 프로세서는 상기 카메라 이미지들에 기반하여, 적어도 하나의 객체를 식별하도 록 구성될 수 있다. 일 실시 예에 따르면, 상기 프로세서는 상기 식별된 적어도 하나의 객체 중 지정된 종 류의 객체를 식별하도록 구성될 수 있다. 일 실시 예에 따르면, 상기 프로세서는 상기 지정된 종류의 객체 의 영역에 기반하여, 상기 카메라 영역을 설정하도록 구성될 수 있다. 상술한 바와 같은, 방법은 카메라, 및 디스플레이를 포함하는 웨어러블 장치에서 실행될 수 있 다. 일 실시 예에 따르면, 방법은, 제1 시점의 상기 카메라를 통해 획득되는 상기 웨어러블 장치 주 변의 환경에 대한 제1 카메라 이미지의 적어도 일부 영역을 카메라 영역으로 포함하는 제1 프레임을 상기 디스 플레이 상에서 표시하는 동작을 포함할 수 있다. 일 실시 예에 따르면, 방법은, 상기 제1 프레임이 상기 디스플레이 상에서 표시되는 동안, ROI(region of interest)에 대응하는 상기 프레임 내의 상기 카메라 영 역을 식별하는 동작을 포함할 수 있다. 일 실시 예에 따르면, 방법은, 상기 카메라 영역의 픽셀 값들의 변화를 나타내는 데이터가 기준 범위 밖에 있음을 식별하는 것에 응답하여, 상기 카메라 영역 밖의 상기 프레임의 영역 의 제2 FPS(frame per second)보다 높은 제1 FPS로 상기 카메라 영역을 위한 상기 카메라 이미지들을 획득하는 동작을 포함할 수 있다. 일 실시 예에 따르면, 방법은, 상기 데이터가 상기 기준 범위 내에 있음을 식별하는 것 에 응답하여, 상기 카메라 영역을 위한 상기 카메라 이미지들을 상기 제2 FPS로 획득하는 동작을 포함할 수 있다. 상술한 바와 같은, 비일시적 컴퓨터 판독가능 저장 매체(non-transitory computer readable storage medium)는 인스트럭션들을 포함하는 하나 이상의 프로그램들을 저장할 수 있다. 일 실시 예에 따르면, 상기 인스트럭 션들은, 카메라, 및 디스플레이를 포함하는 웨어러블 장치의 프로세서에 의해 실행될 시, 상기 웨어러블 장치가, 사용자 입력에 기반하여, 상기 디스플레이를 통해 출력되는 제1 프레임에서 관심 영역(region of interest, ROI)을 식별하도록 구성될 수 있다. 일 실시 예에 따르면, 상기 제1 프레임에 포함되는 카메라 영역은, 제1 시점의 상기 카메라를 통해 획득되는 제1 카메라 이미지의 적어도 일부 영역 에 대응할 수 있다. 일 실시 예에 따르면, 상기 인스트럭션들은, 상기 프로세서에 의해 실행될 시, 상기 웨어러블 장치가, 상기 관심 영역이 상기 카메라 영역에 중첩됨에 기반하여, 상기 이미지 시그널 프로세서 가 상기 제1 시점 이후의 제2 시점에 획득되는 제2 카메라 이미지를 제1 처리 방식으로 처리하도록 제어하 도록 구성될 수 있다. 일 실시 예에 따르면, 상기 인스트럭션들은, 상기 프로세서에 의해 실행될 시, 상기 웨어러블 장치가, 상기 관심 영역이 상기 카메라 영역을 벗어남에 기반하여, 상기 이미지 시그널 프로세서 가 상기 제2 카메라 이미지를 상기 제1 처리 방식과 구분되는 제2 처리 방식을 통해 처리하도록 제어하도 록 구성될 수 있다. 일 실시 예에 따르면, 상기 인스트럭션들은, 상기 프로세서에 의해 실행될 시, 상기 웨어러블 장치가, 처리된 상기 제2 카메라 이미지의 적어도 일부 영역에 대응하는 상기 카메라 영역을 포 함하는 제2 프레임을 상기 디스플레이를 통해 표시하도록 구성될 수 있다. 본 문서에 개시된 다양한 실시예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되지 않는다. 본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제1\", \"제2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위 해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없 이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으 로(예: 유선으로), 무선으로, 또는 제3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 다양한 실시예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함 할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부 가 될 수 있다. 예를 들면, 일실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형 태로 구현될 수 있다. 본 문서의 다양한 실시예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어 (예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것 을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형 태로 제공될 수 있다. 여기서, '비일시적'은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전자 기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경우 와 임시적으로 저장되는 경우를 구분하지 않는다.일실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: CD-ROM(compact disc read only memory))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치들(예: 스 마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체들을 포함할 수 있으며, 복수의 개체들 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요 소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따르면, 모듈, 프로그램 또는 다른 구성요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다."}
{"patent_id": "10-2023-0100109", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 2a는, 웨어러블 장치의 제1 면의 외관의 일 예를 도시한다. 도 2b는, 웨어러블 장치의 제2 면의 외관의 일 예를 도시한다. 도 2c는, 웨어러블 장치의 제1 면의 외관의 일 예를 도시한다. 도 2d는, 웨어러블 장치의 제2 면의 외관의 일 예를 도시한다. 도 3a는, 웨어러블 장치의 간략화된 블록도이다. 도 3b는, 웨어러블 장치의 카메라 이미지 처리를 위한 구성 요소들의 예를 도시한다. 도 4a는, 웨어러블 장치 주변의 환경에 대한 카메라 이미지에 기반하여 표시되는 프레임의 예를 도시한다. 도 4b는, 웨어러블 장치 주변의 환경에 대한 카메라 이미지에 기반하여 표시되는 프레임의 예를 도시한다. 도 4c는, 웨어러블 장치 주변의 환경에 대한 카메라 이미지에 기반하여 표시되는 프레임의 예를 도시한다. 도 4d는, 웨어러블 장치 주변의 환경에 대한 카메라 이미지에 기반하여 표시되는 프레임의 예를 도시한다. 도 5a는, 프레임 상의 관심 영역의 일 예를 도시한다. 도 5b는, 프레임 상의 관심 영역의 예를 도시한다. 도 5c는, 프레임 상의 관심 영역에 따라, 카메라 이미지를 처리하는 패스의 예를 도시한다. 도 6a는, 프레임 상의 관심 영역의 예를 도시한다. 도 6b는, 프레임 상의 관심 영역의 예를 도시한다. 도 7a는, 프레임 상의 관심 영역에 따른 해상도의 설정의 예를 도시한다. 도 7b는, 프레임 상의 관심 영역에 따른 해상도의 설정의 예를 도시한다. 도 7c는, 프레임 상의 관심 영역에 따른 해상도의 설정의 예를 도시한다. 도 8a는, 프레임 상의 관심 영역에 따른 해상도의 설정의 예를 도시한다. 도 8b는, 프레임 상의 관심 영역에 따른 해상도의 설정의 예를 도시한다. 도 8c는, 프레임 상의 관심 영역에 따른 해상도의 설정의 예를 도시한다. 도 8d는, 프레임 상의 관심 영역에 따른 해상도의 설정의 예를 도시한다. 도 9a는, 프레임 상의 관심 영역에 따른 해상도의 설정의 예를 도시한다. 도 9b는, 프레임 상의 관심 영역에 따른 해상도의 설정의 예를 도시한다. 도 10a는, 웨어러블 장치 주변의 환경에 존재하는 객체들의 예를 도시한다. 도 10b는, 카메라 이미지와 어플리케이션 이미지 간의 합성의 예를 도시한다. 도 11은, 웨어러블 장치에서 실행되는 방법의 흐름도이다. 도 12는, 웨어러블 장치에서 실행되는 방법의 흐름도이다."}
