{"patent_id": "10-2020-0112345", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0030700", "출원번호": "10-2020-0112345", "발명의 명칭": "스마트 쿼런틴 그리드 시스템 및 방법", "출원인": "(주)누리플렉스", "발명자": "남지원"}}
{"patent_id": "10-2020-0112345", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "주기 감시 모드로 대기 중의 부유물질 오염도를 센싱하여 센싱 데이터를 주기적으로 전송하는 바이오 노드; 상기 바이오 노드로부터 센싱 데이터를 수집하는 데이터 집중 장치; 및 상기 데이터 집중 장치로부터 수신된 센싱 데이터를 기반으로 대기 중의 부유물질 오염도를 분석하고 분석 결과를 기초로 방역 동작을 수행하는 관제 서버를 포함하고, 상기 바이오 노드는 상기 센싱된 오염도가 기설정된 임계치를 초과하면 상시 감시 모드로 전환하고 오염 초과알람과 센싱 데이터를 상기 데이터 집중 장치로 전송하고, 상기 데이터 집중 장치는 상기 바이오 노드로부터 오염 초과 알람을 수신하면 네트워크에 기할당된 다른 바이오노드에 상시 감시 모드로의 모드 전환 메시지를 브로드캐스팅하는, 스마트 쿼런틴 그리드 시스템."}
{"patent_id": "10-2020-0112345", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 바이오 노드는, 생화학 측정 방식의 바이오 센서 또는 광학 측정 방식의 바이오 센서를 포함하는, 스마트 쿼런틴 그리드시스템."}
{"patent_id": "10-2020-0112345", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 바이오 노드는, 대기 중의 부유물질의 입자 특성을 센싱하여 부유물질 오염도와, 부유물질의 종류 또는 비율을 측정하는, 스마트 쿼런틴 그리드 시스템."}
{"patent_id": "10-2020-0112345", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 바이오 노드는, 이동통신 모듈을 구비한 경우, 상기 바이오 노드는 상기 센싱된 오염도가 기설정된 임계치를 초과하면 상시 감시 모드로 전환하고 오염 초과 알람과 센싱 데이터를 상기 구비된 이동통신 모듈을 통해 상기 관제 서버로 전송하고, 상기 관제 서버는 상기 바이오 노드로부터 오염 초과 알람을 수신하면 상기 데이터 집중 장치 및 다른 바이오노드에 상시 감시 모드로의 모드 전환 메시지를 브로드캐스팅하는, 스마트 쿼런틴 그리드 시스템."}
{"patent_id": "10-2020-0112345", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 센싱된 오염도가 기설정된 임계치를 초과하면 프라이버시 데이터를 획득하고, 상기 획득된 프라이버시 데이터를 암호화하여 전송하는 데이터 암호화 장치를 더 포함하는, 스마트 쿼런틴 그리드 시스템."}
{"patent_id": "10-2020-0112345", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 관제 서버는, 공개특허 10-2022-0030700-3-상기 수신된 센싱 데이터를 기반으로 부유물질 오염도를 분석하고 클러스터 기법을 이용한 분석 결과에 따라 부유물질 오염 특성들을 특징별로 분류하는, 스마트 쿼런틴 그리드 시스템."}
{"patent_id": "10-2020-0112345", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 관제 서버는, 상기 수신된 센싱 데이터를 기반으로 부유물질 오염도를 분석하고 CNN 기반 상관관계 추출 기법을 이용한 분석결과에 따라 부유물질 오염 특성들을 단일 또는 하나 이상의 상관관계와 연동적으로 딥러닝하는, 스마트 쿼런틴그리드 시스템."}
{"patent_id": "10-2020-0112345", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 관제 서버는, 상기 수신된 센싱 데이터를 기반으로 부유물질 오염도를 분석하고 시간적 특성, 공간적 특성 및 인구적 특성 중에서 적어도 하나의 특성에 기반하여 미리 부유물질의 오염 예측치와 전염에 대한 예측 및 확률을 추출하는, 스마트 쿼런틴 그리드 시스템."}
{"patent_id": "10-2020-0112345", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "바이오 노드가 주기 감시 모드로 대기 중의 부유물질 오염도를 센싱하여 센싱 데이터를 주기적으로 전송하는 단계; 데이터 집중 장치가 상기 바이오 노드로부터 센싱 데이터를 수집하는 단계; 관제 서버가 상기 데이터 집중 장치로부터 수신된 센싱 데이터를 기반으로 대기 중의 부유물질 오염도를 분석하고 분석 결과를 기초로 방역 동작을 수행하는 단계; 상기 바이오 노드가 상기 센싱된 오염도가 기설정된 임계치를 초과하면 상시 감시 모드로 전환하고 오염 초과알람과 센싱 데이터를 상기 데이터 집중 장치로 전송하는 단계; 및 상기 데이터 집중 장치가 상기 바이오 노드로부터 오염 초과 알람을 수신하면 네트워크에 기할당된 다른 바이오노드에 상시 감시 모드로의 모드 전환 메시지를 브로드캐스팅하는 단계를 포함하는, 스마트 쿼런틴 그리드방법."}
{"patent_id": "10-2020-0112345", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 바이오 노드는, 생화학 측정 방식의 바이오 센서 또는 광학 측정 방식의 바이오 센서를 포함하는, 스마트 쿼런틴 그리드 방법."}
{"patent_id": "10-2020-0112345", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항에 있어서,상기 센싱 데이터를 주기적으로 전송하는 단계는, 대기 중의 부유물질의 입자 특성을 센싱하여 부유물질 오염도와, 부유물질의 종류 또는 비율을 측정하는, 스마트 쿼런틴 그리드 방법."}
{"patent_id": "10-2020-0112345", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제9항에 있어서,상기 바이오 노드에 이동통신 모듈이 구비된 경우, 상기 바이오 노드가 상기 센싱된 오염도가 기설정된 임계치를 초과하면 상시 감시 모드로 전환하고 오염 초과 알람과 센싱 데이터를 상기 구비된 이동통신 모듈을 통해 상공개특허 10-2022-0030700-4-기 관제 서버로 전송하는 단계; 및 상기 관제 서버가 상기 바이오 노드로부터 오염 초과 알람을 수신하면 상기 데이터 집중 장치 및 다른 바이오노드에 상시 감시 모드로의 모드 전환 메시지를 브로드캐스팅하는 단계를 더 포함하는, 스마트 쿼런틴 그리드방법."}
{"patent_id": "10-2020-0112345", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제9항에 있어서,상기 센싱된 오염도가 기설정된 임계치를 초과하면 프라이버시 데이터를 획득하고, 상기 획득된 프라이버시 데이터를 데이터 암호화 장치를 통해 암호화하여 전송하는 단계를 더 포함하는, 스마트 쿼런틴 그리드 방법."}
{"patent_id": "10-2020-0112345", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제9항에 있어서,상기 방역 동작을 수행하는 단계는, 상기 수신된 센싱 데이터를 기반으로 부유물질 오염도를 분석하고 클러스터 기법을 이용한 분석 결과에 따라 부유물질 오염 특성들을 특징별로 분류하는, 스마트 쿼런틴 그리드 방법."}
{"patent_id": "10-2020-0112345", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제9항에 있어서,상기 방역 동작을 수행하는 단계는, 상기 수신된 센싱 데이터를 기반으로 부유물질 오염도를 분석하고 CNN 기반 상관관계 추출 기법을 이용한 분석결과에 따라 부유물질 오염 특성들을 단일 또는 하나 이상의 상관관계와 연동적으로 딥러닝하는, 스마트 쿼런틴그리드 방법."}
{"patent_id": "10-2020-0112345", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제9항에 있어서, 상기 방역 동작을 수행하는 단계는, 상기 수신된 센싱 데이터를 기반으로 부유물질 오염도를 분석하고 시간적 특성, 공간적 특성 및 인구적 특성 중에서 적어도 하나의 특성에 기반하여 미리 부유물질의 오염 예측치와 전염에 대한 예측 및 확률을 추출하는, 스마트 쿼런틴 그리드 방법."}
{"patent_id": "10-2020-0112345", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 스마트 쿼런틴 그리드 시스템 및 방법에 관한 것으로, 본 발명의 일 실시예에 따른 스마트 쿼런틴 그 리드 시스템은, 주기 감시 모드로 대기 중의 부유물질 오염도를 센싱하여 센싱 데이터를 주기적으로 전송하는 바 이오 노드, 상기 바이오 노드로부터 센싱 데이터를 수집하는 데이터 집중 장치, 및 상기 데이터 집중 장치로부터 수신된 센싱 데이터를 기반으로 대기 중의 부유물질 오염도를 분석하고 분석 결과를 기초로 방역 동작을 수행하 는 관제 서버를 포함하고, 상기 바이오 노드는 상기 센싱된 오염도가 기설정된 임계치를 초과하면 상시 감시 모 드로 전환하고 오염 초과 알람과 센싱 데이터를 상기 데이터 집중 장치로 전송하고, 상기 데이터 집중 장치는 상 기 바이오 노드로부터 오염 초과 알람을 수신하면 네트워크에 기할당된 다른 바이오 노드에 상시 감시 모드로의 모드 전환 메시지를 브로드캐스팅한다."}
{"patent_id": "10-2020-0112345", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 스마트 쿼런틴 그리드 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2020-0112345", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "포스트 코로나19 시대로 인해 방역의 중요성이 영구적으로 대두되고 있다. 한국은 물론 전 세계는 대부분 확진 자가 발견되면 그제야 동선 파악, 접촉자 파악, 후속 조치, 격리 및 치료 등에 들어간다. 이는 코로나가 무증상 감염 전염병이기 때문이고, 앞으로도 이러한 전염병의 위험이 도사리고 있다. 확진자를 파악한 뒤에야 검사키트, 음압병동, 동선파악, 접촉자 관리, 의료 인력 및 보호장비 투입, 치료 자원 투입을 진행하는데, 이는 천문학적인 비용이 들뿐더러 이미 확진자가 발생하고 활동한 뒤라 방역에 매우 비효율적이고 리스크가 많다."}
{"patent_id": "10-2020-0112345", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 실시예들은 후속 조치 방식이 아닌, 사전에 예방하고 예지보전하는 방식에 관한 것으로, 자동으로 전 국의 유동인구가 많은 지역에 대해 종합적인 오염 수치를 감지함으로써, 즉각적인 방역이 가능하게 하는 것은물론 빅데이터 연동을 통해 오염과 관련된 딥러닝 예측으로 정책 결정 또는 방역 운영에 도움이 되고 전국적인 방역 자원 및 수행을 원활하게 하기 위한, 스마트 쿼런틴 그리드 시스템 및 방법을 제공하고자 한다. 다만, 본 발명의 해결하고자 하는 과제는 이에 한정되는 것이 아니며, 본 발명의 사상 및 영역으로부터 벗어나 지 않는 범위의 환경에서도 다양하게 확장될 수 있을 것이다."}
{"patent_id": "10-2020-0112345", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따르면, 주기 감시 모드로 대기 중의 부유물질 오염도를 센싱하여 센싱 데이터를 주기적 으로 전송하는 바이오 노드; 상기 바이오 노드로부터 센싱 데이터를 수집하는 데이터 집중 장치; 및 상기 데이 터 집중 장치로부터 수신된 센싱 데이터를 기반으로 대기 중의 부유물질 오염도를 분석하고 분석 결과를 기초로 방역 동작을 수행하는 관제 서버를 포함하고, 상기 바이오 노드는 상기 센싱된 오염도가 기설정된 임계치를 초 과하면 상시 감시 모드로 전환하고 오염 초과 알람과 센싱 데이터를 상기 데이터 집중 장치로 전송하고, 상기 데이터 집중 장치는 상기 바이오 노드로부터 오염 초과 알람을 수신하면 네트워크에 기할당된 다른 바이오 노드 에 상시 감시 모드로의 모드 전환 메시지를 브로드캐스팅하는, 스마트 쿼런틴 그리드 시스템이 제공될 수 있다. 상기 바이오 노드는, 생화학 측정 방식의 바이오 센서 또는 광학 측정 방식의 바이오 센서를 포함할 수 있다. 상기 바이오 노드는, 대기 중의 부유물질의 입자 특성을 센싱하여 부유물질 오염도와, 부유물질의 종류 또는 비 율을 측정할 수 있다. 상기 바이오 노드는, 이동통신 모듈을 구비한 경우, 상기 바이오 노드는 상기 센싱된 오염도가 기설정된 임계치 를 초과하면 상시 감시 모드로 전환하고 오염 초과 알람과 센싱 데이터를 상기 구비된 이동통신 모듈을 통해 상 기 관제 서버로 전송하고, 상기 관제 서버는 상기 바이오 노드로부터 오염 초과 알람을 수신하면 상기 데이터 집중 장치 및 다른 바이오 노드에 상시 감시 모드로의 모드 전환 메시지를 브로드캐스팅할 수 있다. 상기 시스템은, 상기 센싱된 오염도가 기설정된 임계치를 초과하면 프라이버시 데이터를 획득하고, 상기 획득된 프라이버시 데이터를 암호화하여 전송하는 데이터 암호화 장치를 더 포함할 수 있다. 상기 관제 서버는, 상기 수신된 센싱 데이터를 기반으로 부유물질 오염도를 분석하고 클러스터 기법을 이용한 분석 결과에 따라 부유물질 오염 특성들을 특징별로 분류할 수 있다. 상기 관제 서버는, 상기 수신된 센싱 데이터를 기반으로 부유물질 오염도를 분석하고 CNN 기반 상관관계 추출 기법을 이용한 분석 결과에 따라 부유물질 오염 특성들을 단일 또는 하나 이상의 상관관계와 연동적으로 딥러닝 할 수 있다. 상기 관제 서버는, 상기 수신된 센싱 데이터를 기반으로 부유물질 오염도를 분석하고 시간적 특성, 공간적 특성 및 인구적 특성 중에서 적어도 하나의 특성에 기반하여 미리 부유물질의 오염 예측치와 전염에 대한 예측 및 확 률을 추출할 수 있다. 한편, 본 발명의 다른 실시예에 따르면, 바이오 노드가 주기 감시 모드로 대기 중의 부유물질 오염도를 센싱하 여 센싱 데이터를 주기적으로 전송하는 단계; 데이터 집중 장치가 상기 바이오 노드로부터 센싱 데이터를 수집 하는 단계; 관제 서버가 상기 데이터 집중 장치로부터 수신된 센싱 데이터를 기반으로 대기 중의 부유물질 오염 도를 분석하고 분석 결과를 기초로 방역 동작을 수행하는 단계; 상기 바이오 노드가 상기 센싱된 오염도가 기설 정된 임계치를 초과하면 상시 감시 모드로 전환하고 오염 초과 알람과 센싱 데이터를 상기 데이터 집중 장치로 전송하는 단계; 및 상기 데이터 집중 장치가 상기 바이오 노드로부터 오염 초과 알람을 수신하면 네트워크에 기 할당된 다른 바이오 노드에 상시 감시 모드로의 모드 전환 메시지를 브로드캐스팅하는 단계를 포함하는, 스마트 쿼런틴 그리드 방법이 제공될 수 있다. 상기 바이오 노드는, 생화학 측정 방식의 바이오 센서 또는 광학 측정 방식의 바이오 센서를 포함할 수 있다. 상기 센싱 데이터를 주기적으로 전송하는 단계는, 대기 중의 부유물질의 입자 특성을 센싱하여 부유물질 오염도 와, 부유물질의 종류 또는 비율을 측정할 수 있다. 상기 방법은, 상기 바이오 노드에 이동통신 모듈이 구비된 경우, 상기 바이오 노드가 상기 센싱된 오염도가 기 설정된 임계치를 초과하면 상시 감시 모드로 전환하고 오염 초과 알람과 센싱 데이터를 상기 구비된 이동통신 모듈을 통해 상기 관제 서버로 전송하는 단계; 및 상기 관제 서버가 상기 바이오 노드로부터 오염 초과 알람을 수신하면 상기 데이터 집중 장치 및 다른 바이오 노드에 상시 감시 모드로의 모드 전환 메시지를 브로드캐스팅하는 단계를 더 포함할 수 있다. 상기 방법은, 상기 센싱된 오염도가 기설정된 임계치를 초과하면 프라이버시 데이터를 획득하고, 상기 획득된 프라이버시 데이터를 데이터 암호화 장치를 통해 암호화하여 전송하는 단계를 더 포함할 수 있다. 상기 방역 동작을 수행하는 단계는, 상기 수신된 센싱 데이터를 기반으로 부유물질 오염도를 분석하고 클러스터 기법을 이용한 분석 결과에 따라 부유물질 오염 특성들을 특징별로 분류할 수 있다. 상기 방역 동작을 수행하는 단계는, 상기 수신된 센싱 데이터를 기반으로 부유물질 오염도를 분석하고 CNN 기반 상관관계 추출 기법을 이용한 분석 결과에 따라 부유물질 오염 특성들을 단일 또는 하나 이상의 상관관계와 연 동적으로 딥러닝할 수 있다. 상기 방역 동작을 수행하는 단계는, 상기 수신된 센싱 데이터를 기반으로 부유물질 오염도를 분석하고 시간적 특성, 공간적 특성 및 인구적 특성 중에서 적어도 하나의 특성에 기반하여 미리 부유물질의 오염 예측치와 전염 에 대한 예측 및 확률을 추출할 수 있다."}
{"patent_id": "10-2020-0112345", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "개시된 기술은 다음의 효과를 가질 수 있다. 다만, 특정 실시예가 다음의 효과를 전부 포함하여야 한다거나 다 음의 효과만을 포함하여야 한다는 의미는 아니므로, 개시된 기술의 권리범위는 이에 의하여 제한되는 것으로 이 해되어서는 아니 될 것이다. 본 발명의 실시예들은 동시성 측면에서, 전국에 설치된 스마트 쿼런틴 그리드 영역을 통해 모두 동일하게 오염 수치를 감지하고 즉각 방역 조치를 할 수 있다. 본 발명의 실시예들은 선제 대응 측면에서, 확진자 발생 후 후속 조치하는 현재의 접근 방식에서 훨씬 진보된 선제적 예방 및 즉각 대응 방식을 수행할 수 있다. 진보된 선제적 예방 및 즉각 대응 방식은 마스크, 사회적 거 리두기처럼 수치에 기반하지 않은 일반 예방보다 훨씬 효과적이다. 본 발명의 실시예들은 항시성 측면에서, 언제 어떻게 감염이 될지 모르는 상황에서, 항시성을 가질 수 있는 접 근 방식이며, 관리와 운영이 손쉬운 무인 센서가 24시간 설치된 곳을 인터벌 간격으로 감지할 수 있다. 본 발명의 실시예들은 자동성 측면에서, 별도 인력 투입 없이 스마트 쿼런틴 그리드 시스템이 설치된 후에는 전 국의 세균 또는 바이러스 오염 상황을 신속하고 용이하게 파악할 수 있다. 본 발명의 실시예들은 데이터 분석 잠재성 측면에서, 전국의 오염도 데이터를 수집하고, 수집된 오염도 데이터 와 GPS 위치, 날씨, 시간, 키워드, 행사 정보, 시민 정보 등 수많은 정보들을 연동해 방역 선진화 및 정책 수립 을 가능하게 해줄 수 있는 빅데이터의 중심 축(바이러스 센서) 역할을 할 수 있다. 아무리 행정적으로 중앙 정부가 통제하더라도, 결국 전국의 방역과 위생 관리는 모두 분할되어 있을 수밖에 없 다. 본 발명의 실시예들은 통합/중앙화 방역 측면에서, 스마트 쿼런틴 그리드를 통하면 효과적이고 통합적인 중 앙화 관리로 인해 자원이나 비용을 아끼는 걸 물론 효율이나 효과에서도 파격적인 격차를 만들 수 있다. 확진자가 발생하면 무조건 검사키트, 음압병동, 동선 추적, 접촉자 관리, 잠재적 추가 확진자, 의료 인원과 의 료 보호 장비, 치료제 등에 대해 방대하고 천문학적인 비용이 들어간다. 본 발명의 실시예들은 경제성 측면에서, 이러한 수천억 내지 조 단위 예산보다는 아예 선제적으로 예방함으로써, 경제적일 뿐더러 추가 전염 병 확산을 막을 수 있다."}
{"patent_id": "10-2020-0112345", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변환을 가할 수 있고 여러가지 실시예를 가질 수 있는 바, 특정 실시예들을 도면에 예시하고 상세한 설명에 구체적으로 설명하고자 한다. 그러나 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 기술적 사상 및 기술 범위에 포함되는 모든 변환, 균등물 내지 대체물을 포함하는 것으로 이 해될 수 있다. 본 발명을 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 제1, 제2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 구성요소들이 용어들에 의해 한정되 는 것은 아니다. 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 본 발명에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 아니다. 본 발명에서 사용한 용어는 본 발명에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용 어들을 선택하였으나 이는 당 분야에 종사하는 기술자의 의도, 판례, 또는 새로운 기술의 출현 등에 따라 달라 질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 발명의 설명 부분 에서 상세히 그 의미를 기재할 것이다. 따라서 본 발명에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용 어가 가지는 의미와 본 발명의 전반에 걸친 내용을 토대로 정의되어야 한다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 발명에서, \"포함하다\" 또 는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이 들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 이하, 본 발명의 실시예들을 첨부 도면을 참조하여 상세히 설명하기로 하며, 첨부 도면을 참조하여 설명함에 있 어, 동일하거나 대응하는 구성요소는 동일한 도면번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 도 1은 본 발명의 일 실시예에 따른 스마트 쿼런틴 그리드 시스템의 구성도이다. 도 1에 도시된 바와 같이, 본 발명의 일 실시예에 따른 스마트 쿼런틴 그리드 시스템은 바이오 노드, 데이터 집중 장치 및 관제 서버를 포함한다. 그러나 도시된 구성요소 모두가 필수 구성요소인 것은 아니다. 도시된 구성요소보다 많은 구성요소에 의해 스마트 쿼런틴 그리드 시스템이 구현될 수도 있고, 그 보다 적은 구성요소에 의해서도 스마트 쿼런틴 그리드 시스템이 구현될 수 있다. 이하, 도 1의 스마트 쿼런틴 그리드 시스템의 각 구성요소들의 구체적인 구성 및 동작을 설명한다. 바이오 노드는 주기 감시 모드로 대기 중의 부유물질 오염도를 센싱하여 센싱 데이터를 주기적으로 데이터 집중 장치에 전송한다. 바이오 노드는 센싱된 오염도가 기설정된 임계치를 초과하면 상시 감시 모드 로 전환하고 오염 초과 알람과 센싱 데이터를 데이터 집중 장치로 전송한다. 실시예들에 따르면, 바이오 노드는 생화학 측정 방식의 바이오 센서 또는 광학 측정 방식의 바이오 센서를 포함할 수 있다. 실시예들에 따르면, 바이오 노드는 대기 중의 부유물질의 입자 특성을 센싱하여 부유물질 오염도와, 부유 물질의 종류 또는 비율을 측정할 수 있다. 실시예들에 따르면, 바이오 노드는 이동통신 모듈을 구비한 경우, 센싱된 오염도가 기설정된 임계치를 초 과하면 감시 모드로 전환하고 오염 초과 알람과 센싱 데이터를 구비된 이동통신 모듈을 통해 관제 서버로 전송한다. 관제 서버는 바이오 노드로부터 오염 초과 알람을 수신하면 데이터 집중 장치 및 다 른 바이오 노드에 상시 감시 모드로의 모드 전환 메시지를 브로드캐스팅할 수 있다. 데이터 집중 장치는 바이오 노드로부터 센싱 데이터를 수집한다. 데이터 집중 장치는 바이오 노 드로부터 오염 초과 알람을 수신하면 네트워크에 기할당된 다른 바이오 노드에 감시 모드로의 모드 전환 메시지를 브로드캐스팅한다. 본 발명의 일 실시예에는 바이오 노드와 데이터 집중 장치를 주요 구성으로 하는 센서 네트워크가 포 함된다. 센서 네트워크는 ATP 생화학 방식 혹은 광학 측정 (laser particle counting) 방식의 바이러스 센서와 다음 중 하나인 방식의 네트워크가 합쳐진 광역 측정망을 나타낸다. 첫째, 모뎀과 데이터 집중 장치가 포함된 센서 네트워크가 있다. 둘째, 지그비(zigbee), LTE, 그 외 주요 무선 통신망과 연결된 방식이 있다. 셋째, 무선 또는 유선으로 게이트웨이에 연결된 방식이 있다. 한편, 관제 서버는 데이터 집중 장치로부터 수신된 센싱 데이터를 기반으로 대기 중의 부유물질 오염 도를 분석하고 분석 결과를 기초로 방역 동작을 수행한다. 실시예들에 따르면, 스마트 쿼런틴 그리드 시스템은 센싱된 오염도가 기설정된 임계치를 초과하면 프라이 버시 데이터를 획득하고, 획득된 프라이버시 데이터를 암호화하여 전송하는 데이터 암호화 장치를 더 포함할 수 있다. 실시예들에 따르면, 관제 서버는 수신된 센싱 데이터를 기반으로 부유물질 오염도를 분석하고 클러스터 기 법을 이용한 분석 결과에 따라 부유물질 오염 특성들을 특징별로 분류할 수 있다. 실시예들에 따르면, 관제 서버는 수신된 센싱 데이터를 기반으로 부유물질 오염도를 분석하고 CNN 기반 상 관관계 추출 기법을 이용한 분석 결과에 따라 부유물질 오염 특성들을 단일 또는 하나 이상의 상관관계와 연동 적으로 딥러닝할 수 있다. 실시예들에 따르면, 관제 서버는 수신된 센싱 데이터를 기반으로 부유물질 오염도를 분석하고 시간적 특성, 공간적 특성 및 인구적 특성 중에서 적어도 하나의 특성에 기반하여 미리 부유물질의 오염 예측치와 전염 에 대한 예측 및 확률을 추출할 수 있다. 관제 서버는 DB 및 운영 서버로 동작할 수 있고, 중앙 관제 소프트웨어를 통해 중앙 관제를 수행할 수 있 고, 빅데이터/인공지능 모듈을 통해 예측 알고리즘을 수행할 수 있고, 방역 자원 관리(QRMS, Qurantine Resource Management System) 등을 수행할 수 있다. 관제 서버는 DB 및 운영 서버로 동작함으로써, 전국에서 수집된 실시간(예컨대, 5~15분 인터벌) 종합 오염 수치 데이터(세균, 바이러스 등의 부유물질)를 누적하는 것은 물론 계층(동, 구, 시, 도 단위 등)별로 레이블링 을 하여 분석에 용이하게 저장한다. 관제 서버는 전국의 센서 시스템을 양방향으로 통제 및 상태관리, 형 상관리, 유지보전, 원격 운용할 수 있는 서버를 포함한다. 또한, 중앙 관제 소프트웨어가 작동하는 기반 공간 (디지털)이기도 하다. 관제 서버는 중앙 소프트웨어를 통해, 전국의 부유물질 오염 수치를 상기 계층(동, 구, 시, 도 단위 등)으 로 조회하고 목적에 맞게 편집, 정렬하여 표기할 수 있다. 관제 서버는 중앙 소프트웨어를 통해, 중앙 소 프트웨어는 동시에 연동된 방역 자원(물적, 인적)을 조회하고 즉시 투입할 수 있으며 현장의 상황을 양방향으로 교류할 수 있다(현장 요원과 소통 모듈 및 로컬 CCTV 정보 취득, 현지 지자체와 협업하여 날씨나 관련 시민 정 보를 암호화하여 취득하여 질본청 등 유관부서에 즉시 전달). 관제 서버는 중앙 소프트웨어를 통해, 실시 간 전국 오염 수치 관리 외에도 방역 직후의 개선 사항에 대해서도 실시간 업데이트 한다. 또한, 관제 서버 는 빅데이터 운용 모듈을 포함한다. 관제 서버는 방역 자원 관리(QRMS)를 통해, 각 지역에 어느 정도의 방역 자원이 있는지 모두 파악한 물적, 인적 자원에 대한 실시간 정보 표기 및 직접 통제/소통 등을 통해 즉각적으로 오염 지역에 대한 투입 및 격리 관리를 할 수 있게 한다. 관제 서버는 빅데이터 및 인공지능 모듈을 통해, 날씨, 행사, 관련 키워드 등 지역별 오염 수치와 연동하 여 상관관계 빅데이터를 운용하고, 시계열로 오염 수치 자체에 대한 예측 알고리즘 역시 수행한다(로컬, 글로벌 규모 포함). 도 2는 본 발명의 일 실시예에 따른 스마트 쿼런틴 그리드 시스템에서의 바이오 노드의 구성도이다. 본 발명의 일 실시예에 따른 스마트 쿼런틴 그리드 시스템은 바이러스 또는 세균의 오염도를 측정하기 위 한 바이오 센서와 통신 모듈을 기반으로 하는 바이오 노드로 구성되며, 네트워크의 구성은 도 1 과 같이 2가지 타입으로 형성된다. 첫 번째, 바이오 노드들은 무선 또는 유선을 통해 메쉬 혹은 스타 네트워크 구성하게 되고, 해당 네트워크를 컨 트롤하는 DCU(데이터 집중 장치)를 기반으로 네트워크를 구성하여 관제 서버와 데이터를 송수신한다. 이때, 데이터 집중 장치는 관제 서버와 노드 간의 데이터를 송, 수신하는 GW 역할뿐 아니라 데이터를 수집하고 오염도를 분석하여 바이러스 차단을 할 수 있도록 방역에 대한 알람 송신 등의 역할도 수행 할 수 있 다(자체 판별). 두 번째, 바이오 노드는 바이오 노드 간의 네트워크 구성이 아닌 이동통신 모듈(예컨대, 3G, 4G, 5 G)을 이용해 관제 서버와 다이렉트로 데이터를 송수신하여 현재의 오염도를 측정할 수 있는 P2P 형태의 네 트워크 구성이 된다. 이 경우 수집된 데이터를 기반으로 분석하고 방역에 대한 정보를 제공하는 역할은 관제 서 버가 담당하게 된다. 바이러스 및 세균 특성상 발생을 하게 되면 같은 공간 안에 모두 퍼져 나갈 특성이 있기 때문에 이를 빠르게 파 악하기 위해서는 같은 공간에 있는 바이오 노드 들 간의 정보 교류를 통해 센싱 프로세서가 빠르게 유기적 으로 운영되어야 한다. 본 발명의 일 실시예에 따른 스마트 쿼런틴 그리드 시스템은 바이오 노드가 오염도 수치가 넘어가게 되면, 이를 기반으로 같은 공간에 있는 모든 바이오 노드가 센싱을 빠르게 진행한다. 그러므로 본 발명의 일 실 시예는 바이러스의 전파 및 오염도의 상황을 실시간으로 측정할 수 있는 네트워크 프로세서를 포함한다. 한편, 바이오 노드는 전기 바이오 노드, 배터리 바이오 노드, 이동통신 기반 바이오 노드 로 구분될 수 있다. 이에 따라, 바이오 노드는 도 2에 도시된 바이오 센서 및 통신 모듈 이외에, 바이오 노드의 동작을 제어하는 프로세서와 상시 전원과 연결된 전원부 또는 배터리가 포함된 전 원 모듈을 더 포함할 수 있다. 또한, 통신 모듈은 데이터 집중 장치와 통신 가능한 통신 모듈을 포함하거나, 관제 서버가 직접 통신이 가능한 이동통신 모듈을 더 포함할 수 있다. 전기 바이오 노드는 전기를 활용하는 바이오 노드로서, 상시로 전원이 들어오기 때문에 오염도를 상시로 측정하여 프로파일 데이터를 저장한다. 전기 바이오 노드는 저장된 프로파일 데이터를 관제 역할을 하는 상위로 시간에 맞추어 주기적으로 데이터 를 송신한다. 전기 바이오 노드는 배터리 바이오 노드의 네트워크 부모(마스터) 역할을 하며 배터리 바이오 노드 의 데이터를 수집을 대행한다. 전기 바이오 노드는 메쉬 노드(Mesh Node)일 수 있고, 배터리 바이오 노드는 스타 노드(Star Node)일 수 있다. 전기 바이오 노드는 배터리 바이오 노드의 센싱 데이터를 수집을 위해 배터리 바이오 노드가 웨 이크업(Wakeup) 시 수집 명령어를 전달하고, 이를 전달받은 배터리 바이오 노드는 센싱 측정 후에 센싱 데 이터를 전기 바이오 노드에게 전달 한다. 전기 바이오 노드는 자신에게 구성되어 있는 자식(슬레이브) 바이오 노드(배터리)들을 모두 수집 후에 이 를 상위로 전송한다. 다음으로, 배터리 바이오 노드는 배터리를 이용하는 바이오 노드로서, 평상시는 슬립 상태로 전력 소모를 최소화하고 주기적 웨이크업을 통해 부모 노드에 상위로부터 수신된 데이터 여부를 체크한다. 배터리 바이오 노 드는 이와 별도로 센싱 시간이 되면 스스로 오염도에 대한 센싱을 측정 한다. 배터리 바이오 노드는 웨이크업 시 부모 노드로부터 센싱 데이터를 수집 요청을 받게 되면 오염도 센싱을 진행하고 이전 미송신 센싱 데이터와 같이 데이터를 송신하게 된다. 다음으로, 이동통신 기반 바이오 노드는 이동통신 기반으로 통신을 수행하는 바이오 노드로서, 관제서버와 다이렉트로 통신하는 바이오 노드이기 때문에 오염도를 상시로 측정하여 프로파일 데이터를 저장한다. 이동통신 기반 바이오 노드는 저장된 프로파일 데이터를 관제 역할을 위해 주기 전송에 맞추어 시간이 되 면 주기적으로 데이터를 송신한다. 다음으로, 바이러스 센서에 의해 수행되는 ATP 생화학 방식과, 광학 측정 방식에 대해 살펴보기로 한다. ATP 생화학 방식을 갖는 바이오 센서는 대기 중의 부유물질을 포함하는 기체를 포집하여, 위생수와 한 가지 종 류 이상으로 다양한 특수 용액을 통해 포집된 기체를 액화하거나 고정화한다. 이후에 열을 가하거나(생략하는 경우도 있음) 가하지 않아서 세균, 바이러스, 곰팡이 등의 부유물질이 가지는 고유한 ATP/아데노신 산인산 (Adenosine triphosphate)의 생화학 발광 정도를 측정한다. 광학 측정 방식을 갖는 바이오 센서는 레이저나 UV 라이트 혹은 다른 종류의 특정한 빛을 쏘아서 해당하는 입자 의 레이 산란, 미 산란에 의해 발생하는 빛의 산란 정도나 탄성산란 조명으로 인한 입자 농도, 광 펄스 개체 수, 광 펄스의 진폭을 기반으로 부유물질 종합 수치를 파악한다. 또한, 광학 측정 방식을 갖는 바이오 센서는 부가적으로 두 번째 광학 검출기로 형광 방출 관련 정보도 추출하여 활용할 수 있다. 바이오 센서는 광학 방식으로 바이러스를 측정할 수 있다. 일례로, 바이오 센서는 레일리 및 미(Rayleigh & Mie) 산란의 원리에 기반하여 입자를 탐지할 수 있다. 바이오 센서는 레이저 자극을 통해 입자를 탐지하는데, 에어로졸 입자는 UV 레이저 빔을 투과하고 산란 광은 광학 검출기에 의해 수집된다. 탄성 산란 조명이 측정되는 데, 입자 농도와 광 펄스 개체 수로 측정한다. 입자 크기는 광 펄스의 진폭에서 결정된다. 바이오 센서는 형광 방출을 측정하는데, 생물학적 입자는 자외선을 흡수하고 여기 소스(source)보다 더 긴 파장에서 빛을 방출 할 수 있다. 형광등은 두 번째 광학 검출기로 수집된다. 한편, 바이오 노드는 바이러스 센서 기술을 네트워크 시스템과 융합하되, 네트워크 자체는 전염병 관리에 특화된 새로운 방식으로 구성된다. 본 발명의 일 실시예에 따른 스마트 쿼런틴 그리드 시스템은 중앙화 통제가 가능하도록 단일 객체나 소수 객체 가 아니라 1개부터 X개까지 능동적으로 바이오 센서를 시스템에 연동하여 클라우드 방식으로 센서 정보를 모집 할 수 있다. 본 발명의 일 실시예는 전염병 상황에 능동적이고 유연하게 대응할 수 있는 방역 특화 네트워크 관 리 시스템을 가진 바이오 노드와 네트워크의 종합된 IoT 시스템으로 구성된다. 일례로, 스마트 쿼런틴 그리드 시스템은 ATP 생화학 측정 방식을 갖는 바이오 노드와 스마트 쿼런틴 그리 드에 특화된 DCU/모뎀 기반 네트워크 시스템으로 구성될 수 있다. 여기서, 게이트웨이가 더 포함될 수 있다. 다른 예로, 스마트 쿼런틴 그리드 시스템은 ATP 생화학 측정 방식을 갖는 바이오 노드와 스마트 쿼런틴 그 리드에 특화된 무선 LTE 기반 네트워크 시스템으로 구성될 수 있다. 다른 예로, 스마트 쿼런틴 그리드 시스템은 광학 측정 방식을 갖는 바이오 노드와 스마트 쿼런틴 그리드에 특화된 DCU/모뎀 기반 네트워크 시스템으로 구성될 수 있다. 여기서, 게이트웨이가 더 포함될 수 있다. 다른 예로, 스마트 쿼런틴 그리드 시스템은 광학 측정 방식을 갖는 바이오 노드와 스마트 쿼런틴 그리드에 특화된 무선 LTE 기반 네트워크 시스템으로 구성될 수 있다. 또한, 바이오 노드는 광학 측정 방식과 열감지 카메라 측정 방식을 조합하여 감염 수치를 파악하는 2 팩터 (factor) 조합의 방법으로 구성될 수 있다. 여기서, 스마트 쿼런틴 그리드 시스템은 바이러스 센서만으로 확인 하는 것보다, 열감지 카메라를 이용하면 자동으로 고온 감염 의심자를 직접 구체적으로 파악 가능하다. 스마트 쿼런틴 그리드 시스템은 단순히 2중적인 구성뿐만 아니라, 데이터 누적 시 특징 추출 및 상관 관계를 확보할 수 있다. 이때, 스마트 쿼런틴 그리드 시스템은 다음과 같이 여러 가지 옵션 중 하나 혹은 하나 이상의 네트워크 시스템 을 결합하여 사용한다. 스마트 쿼런틴 그리드 시스템은 전염병 관리에 특화되어, 로드 밸런싱(Load Balancing) 기능을 가지고 있어 오 염 수치가 특정 기준 이상으로 트리거(Trigger)되면 네트워크 리소스를 해당 구간에 자동으로 더 투입할 수 있 다. 또한, 스마트 쿼런틴 그리드 시스템은 빅데이터 및 인공지능 예측이나 상관 관계 등으로 오염 리스크가 높 은 지역에 대해서도 미리 네트워크 자원을 투입할 수 있다. 또한, 스마트 쿼런틴 그리드 시스템은 오염 수치가 트리거되면 공기 중 전파라는 특성 상 트리거된 주변 네트워 크 및 센서에도 추가 리소스를 추가할 수 있다. 리소스 추가로 인해 공통적으로 인터벌 수치가 짧아지고 (자주 모음), 배당 대역폭(bandwidth)이 커진다. 관제 서버에서 바이오 센서의 로드를 우선시하고 별도 태깅(tagging)을 통해 실제 데이터 상에서도 우선순위로 보관하고 표기한다(multi-thread scheduling function). 네트워크 상태(state)가 상시 감시 모드로 전환된다. 도 3 및 도 4는 본 발명의 일 실시예에 따른 스마트 쿼런틴 그리드 시스템에서 주기 감시 모드의 동작을 나타낸 도면이다. 스마트 쿼런틴 그리드 시스템에서 메쉬(Mesh) 또는 스타(Star) 네트워크 기반의 통신 플로우를 설명하기로 한다. 통신 플로우는 바이오 노드에 포함된 바이오 센서의 주기 감시 모드 프로세서에 의해 수행될 수 있 다. 도 3에 도시된 바와 같이, 단계 S101 및 S102에서, 관제 서버 및 데이터 집중 장치는 바이오 노드 로부터 주기적인 센싱 데이터를 수집하기 위해, 주기 설정 및 시간 동기가 포함된 시간 정보, 스케줄링 정 보 및 임계치를 바이오 노드에 전송한다. 단계 S103에서, 전기 바이오 노드들은 오염도를 상시 측정한다. 단계 S104 및 S105에서, 전기 바이오 노드들은 주기에 맞추어 측정된 오염도가 포함된 센싱 데이터를 상위 의 데이터 집중 장치로 전송하고, 이에 대한 응답(Response)을 데이터 집중 장치로부터 수신한다. 단계 S106 및 S107에서, 데이터 집중 장치는 전기 바이오 노드들로부터 수신된 센싱 데이터를 상위의 관제 서버로 전송하고, 이에 대한 응답(Response)을 관제 서버로부터 수신한다. 이후, 단계 S108 및 S109에서, 전기 바이오 노드들은 배터리 바이오 노드에 센싱 데이터의 수집 명령 (Gathering CMD)을 전송하고, 이에 대한 응답(Response)을 배터리 바이오 노드로부터 수신한다. 단계 S110에서, 배터리 바이오 노드는 오염도를 측정한다. 단계 S111 및 S112에서, 배터리 바이오 노드는 측정된 오염가 포함된 센싱 데이터를 전기 바이오 노드 로 전송하고, 이에 대한 응답(Response)을 전기 바이오 노드로부터 수신한다. 단계 S113에서, 전기 바이오 노드는 수집된 센싱 데이터를 저장한다. 단계 S114 및 S115에서, 전기 바이오 노드들은 수집된 센싱 데이터를 상위의 데이터 집중 장치로 전 송하고, 이에 대한 응답(Response)을 데이터 집중 장치로부터 수신한다. 단계 S116 및 S117에서, 데이터 집중 장치는 전기 바이오 노드들로부터 수신된 센싱 데이터를 상위의 관제 서버로 전송하고, 이에 대한 응답(Response)을 관제 서버로부터 수신한다. 한편, 이동통신 기반의 통신 플로우를 설명하기로 한다. 도 4에 도시된 바와 같이, 단계 S201 및 S202에서, 관제 서버는 이동통신 기반으로 바이오 노드로부 터 주기적인 센싱 데이터를 수집하기 위해, 주기 설정 및 시간 동기가 포함된 시간 정보, 스케줄링 정보 및 임 계치를 이동통신 기반 바이오 노드에 전송한다. 단계 S203에서, 이동통신 기반 바이오 노드들은 오염도를 상시 측정한다. 단계 S204 및 S205에서, 이동통신 기반 바이오 노드들은 주기에 맞추어 측정된 오염도가 포함된 센싱 데이 터를 상위의 관제 서버로 전송하고, 이에 대한 응답(Response)을 관제 서버로부터 수신한다. 도 5 내지 도 8은 본 발명의 일 실시예에 따른 스마트 쿼런틴 그리드 시스템에서 상시 감시 모드의 동작을 나타 낸 도면이다. 도 5에 도시된 바와 같이, 전기 바이오 노드가 주기적으로 오염도를 센싱을 한다. 그런데, 설정된 임계치 값을 초과하여 오염도가 센싱이 되게 되면, 특정 전기 바이오 노드는 주기 보고와 상관없이 그 즉시 데이 터 집중 장치로 알람을 전송하고 상시 감시 모드로 전환을 한다. 이와 같이, 만약, 전기 바이오 노드(31 0)가 주기적인 센싱 측정시 임계치 값이 초과하면, 전기 바이오 노드는 그 즉시 데이터 집중 장치에 알람을 전송하고 상시 감시 모드로 전환한다. 특정 전기 바이오 노드가 상시 감시 모드로 전환 후에는 센싱되는 센싱 데이터는 그 즉시 바로 데이터 집 중 장치로 실시간으로 보낸다. 효과적인 전염병 특화 관리를 위해, 이러한 메쉬 또는 스타 네트워크 구성에서, 바이오 노드들은 구체적으로, 혹은 함축적으로 마스터 및 슬레이브 등 계층 서열 구조를 가질 수 있다. 도 6에 도시된 바와 같이, 상시 감시 모드로의 전환 후에 전기 바이오 노드는 자신과 연결된 배터리 바이 오 노드 및 주변 바이오 노드에 유니 캐스트로 상시 감시 모드 전환 메시지를 보낸다. 이는 공기 중 오염 물질이 확산되며 주변에도 퍼진다는 점에 따라, 주변 바이오 노드를 상시 감시 모드로 신속히 전환시키기 위함이다. 이와 같이, 전기 바이오 노드는 알람 전송 후에 자신 주변에 있는 배터리 바이오 노드 및 주변 전기 바이오 노드에 유니캐스트 메시지를 전송한다. 데이터 집중 장치는 특정 전기 바이오 노드로부터 알람 수신 후에는 자신에게 할당된 모든 바이오 노 드로 상시 감시 모드로의 전환을 위한 브로드 캐스트 명령어를 전달한다. 도 7에 도시된 바와 같이, 전기 바이오 노드는 데이터 집중 장치로부터 브로드 캐스트 명령어를 전달 받은 후, 상시 감시 모드로 전환한다. 그리고 전기 바이오 노드는 자신에게 속해 있는 다른 전기 바이오 노드들 또는 배터리 바이오 노드들에 상시 감시 모드 전환을 위한 브로드 캐스트 메시지를 송신한다. 이를 통해 스마트 쿼런틴 그리드 시스템에서 상시 감시 모드로의 전환 동작이 확산된다. 도 8에 도시된 바와 같이, 스마트 쿼런틴 그리드 네트워크에 속해 있는 모든 바이오 노드들은 상시 감시 모드로 의 전환 메시지를 받으면, 그 즉시 상시 감시 모드로 전환한다. 그리고 상시 감시 모드로 전환된 바이오 노드들 은 오염도를 센싱한 즉시 상위로 센싱 데이터를 송신한다. 또한 전기 바이오 노드의 경우 자신에게 속한 배터리 바이오 노드에게 메시지를 전파하여 배터리 바이오 노드의 모드를 상시 감시 모드로 전환시킨 다. 그리고 배터리 바이오 노드도 상시 감시 모드로 동작한다. 그러면, 스마트 쿼런틴 그리드 네트워크에 속해 있는 모든 바이오 노드들이 상시 감시 모드로 동작하게 된다. 도 9 내지 도 11은 본 발명의 일 실시예에 따른 스마트 쿼런틴 그리드 시스템에서 이동통신 모듈을 갖는 바이오 노드에 의한 상시 감시 모드의 동작을 나타낸 도면이다. 도 9에 도시된 바와 같이, 이동통신 기반 바이오 노드가 주기적으로 센싱을 하는데, 설정된 임계치 값을 초과하여 오염도를 센싱하면 주기 보고와 상관없이 그 즉시 관제 서버로 알람을 전송하고, 상시 감시 모드 로 전환을 한다. 도 10에 도시된 바와 같이, 이동통신 기반 바이오 노드는 상시 감시 모드로 전환 후에는 센싱되는 센싱 데 이터를 그 즉시 바로 관제 서버로 실시간으로 보낸다. 관제 서버는 특정 이동통신 기반 바이오 노드로부터 알람을 수신하게 되면, 해당 이동통신 기반 바이 오 노드와 같은 공간에 있는 모든 이동통신 기반 바이오 노드에 상시 감시 모드로 전환하는 명령어를 이동통신(예컨대, LTE) 기반으로 전달한다. 이와 같이, 관제 서버는 특정 노드로부터 알람을 송신하게 되 면, 해당 노드와 같은 공간에 있는 노드들을 모두 파악 후에 상시 감시 모드로 전환하는 메시지를 모두 전송한 다. 도 11에 도시된 바와 같이, 스마트 쿼런틴 그리드 시스템에 포함된 모든 이동통신 기반 바이오 노드는 상 시 감시 모드로 동작하고, 오염도 센싱 즉시 관제 서버로 센싱 데이터를 전송한다. 도 12 및 도 13은 본 발명의 일 실시예에 따른 스마트 쿼런틴 그리드 시스템에서 스타 네트워크 기반의 바이오 노드의 동작을 나타낸 도면이다. 도 12 및 도 13을 참조하여 스타 네트워크 기반의 바이오 노드의 동작을 설명하기로 한다. 도 12에 도시된 바와 같이, 단계 S301에서, 바이오 노드는 부팅된다. 단계 S302에서, 바이오 노드는 주기 감시 모드로 동작한다. 단계 S303 및 S304에서, 바이오 노드는 센싱 타임 아웃이 되면, 오염도 측정을 위한 바이오 센싱 동작을 수행한다. 단계 S305 및 S306에서, 바이오 노드는 센싱 값이 임계치 값을 초과하지 않으면, 센싱 데이터를 저장한다. 한편, 단계 S307 및 S308에서, 바이오 노드는 주기 전송 타임 아웃이 되면, 센싱 프로파일 데이터를 데이 터 집중 장치에 전송한다. 단계 S309 및 S310에서, 바이오 노드는 배터리 바이오 노드에 센싱 데이터 수집을 요청하고, 센싱 프 로파일 데이터를 수신한다. 단계 S311에서, 바이오 노드는 배터리 바이오 노드로부터 수신된 센싱 프로파일 데이터를 수집한다. 단계 S312에서, 바이오 노드는 수집된 센싱 프로파일 데이터를 데이터 집중 장치에 전송한다. 한편, 단계 S313 및 단계 S314에서, 바이오 노드는 센싱 값이 임계치 값을 초과하면 임계치 초과 알람을 데이터 집중 장치에 송신하고, 상시 감시 모드로 모드를 전환한다. 단계 S315 및 단계 S316에서, 바이오 노드는 상시 감시 모드 전환을 요청받으면, 상시 감시 모드 전환 요 청에 대해 응답하고 상시 감시 모드로 동작한다. 도 13에 도시된 바와 같이, 단계 S314에서, 바이오 노드는 상시 감시 모드로 동작한다. 단계 S317 및 S318에서, 바이오 노드는 센싱 타임 아웃이 되면, 오염도 측정을 위한 바이오 센싱 동작을 수행한다. 단계 S319에서, 바이오 노드는 센싱 데이터를 저장한다. 단계 S320 및 S321에서, 바이오 노드는 센싱 값이 임계치 미만인 카운터가 기설정된 값(예컨대, 10)을 초 과하지 않으면, 센싱 데이터를 실시간으로 데이터 집중 장치에 전송한다. 단계 S322에서, 바이오 노드 는 센싱 값이 임계치 미만인 카운터가 기설정된 값(예컨대, 10)을 초과하면 주기 감시 모드로 전환한다. 한편, 단계 S323에서, 바이오 노드는 주변 바이오 노드에 상시 감시 모드로의 전환 메시지를 송신한 다. 단계 S324 및 S325에서, 바이오 노드는 배터리 바이오 노드로부터 센싱 데이터를 실시간으로 수신하 고, 실시간으로 수신된 센싱 데이터를 데이터 집중 장치에 전송한다. 한편, 단계 S326 및 단계 S327에서, 바이오 노드는 상시 감시 모드의 종료를 요청받으면, 상시 감시 모드 의 종료 요청에 대해 응답하고 주기 감시 모드로 동작한다. 도 14 및 도 15는 본 발명의 일 실시예에 따른 스마트 쿼런틴 그리드 시스템에서 메쉬 네트워크 기반의 바이오 노드의 동작을 나타낸 도면이다. 도 14 및 도 15를 참조하여 메쉬(Mesh) 네트워크 기반의 바이오 노드의 동작을 설명하기로 한다. 도 14에 도시된 바와 같이, 단계 S401에서, 바이오 노드는 부팅된다. 단계 S402 및 S403에서, 바이오 노드는 슬립(Sleep) 이후에 웨이크업 타임 아웃이 되면, 오염도 측정을 위 한 바이오 센싱 동작을 수행한다. 단계 S404 및 S405에서, 바이오 노드는 센싱 값이 임계치 값을 초과하면, 임계치 초과 알람을 메쉬 네트워 크를 통해 송신한다. 단계 S404 및 S406에서, 바이오 노드는 센싱 값이 임계치 값을 초과하지 않으면, 센싱 데이터를 저장한다. 단계 S407에서, 바이오 노드는 상시 감시 모드로 전환한다. 한편, 단계 S408 내지 S410에서, 바이오 노드는 메시지를 체크하고, 메쉬 네트워크를 통해 센싱 데이터를 요청받으면, 메쉬 네트워크를 통해 센싱 데이터 요청에 대해 응답한다. 단계 S411 및 S412에서, 바이오 노드는 상시 감시 모드로의 전환을 메쉬 네트워크를 통해 요청받으면, 메 쉬 네트워크를 통해 상시 감시 모드로의 전환 요청에 대해 응답한다. 한편, 단계 S413 내지 S415에서, 바이오 노드는 웨이크업 타임 아웃이 되면, 오염도 측정을 위한 바이오 센싱 동작을 수행하고, 센싱 데이터를 저장한다. 단계 S416 및 S417에서, 바이오 노드는 센싱 값이 임계치 미만인 카운터가 기설정된 값(예컨대, 10)을 초 과하지 않으면, 센싱 데이터를 실시간으로 메쉬 네트워크를 통해 전송한다.한편, 단계 S418에서, 바이오 노드는 메시지를 체크한다. 단계 S419 내지 S421에서, 바이오 노드는 메쉬 네트워크를 통해 상시 감시 모드의 종료를 요청받으면, 메 쉬 네트워크를 통해 상시 감시 모드의 종료 요청에 대해 응답하고 슬립 모드로 전환한다. 도 16 및 도 17은 본 발명의 일 실시예에 따른 스마트 쿼런틴 그리드 시스템에서 이동통신 네트워크 기반의 바 이오 노드의 동작을 나타낸 도면이다. 도 16 및 도 17을 참조하여 이동통신 네트워크 기반의 바이오 노드의 동작을 설명하기로 한다. 도 16에 도시된 바와 같이, 단계 S501에서, 바이오 노드는 부팅된다. 단계 S502에서, 바이오 노드는 주기 감시 모드로 동작한다. 단계 S503 및 S504에서, 바이오 노드는 센싱 타임 아웃이 되면, 오염도 측정을 위한 바이오 센싱 동작을 수행한 다. 단계 S505 및 S506에서, 바이오 노드는 센싱 값이 임계치 값을 초과하지 않으면, 센싱 데이터를 저장한다. 한편, 단계 S507 및 S508에서, 바이오 노드는 주기 전송 타임 아웃이 되면, 센싱 프로파일 데이터를 관제 서버 에 전송한다. 단계 S509 및 S510에서, 바이오 노드는 관제 서버로부터 상시 감시 모드 전환을 요청받으면, 관제 서버 로 상시 감시 모드 전환 요청에 대해 응답한다. 한편, 단계 S511 및 단계 S512에서, 바이오 노드는 센싱 값이 임계치 값을 초과하면 임계치 초과 알람을 관제 서버에 송신하고, 상시 감시 모드로 모드를 전환한다. 도 17에 도시된 바와 같이, 단계 S512에서, 바이오 노드는 상시 감시 모드로 동작한다. 단계 S513 및 S514에서, 바이오 노드는 센싱 타임 아웃이 되면, 오염도 측정을 위한 바이오 센싱 동작을 수행한 다. 단계 S515에서, 바이오 노드는 센싱 데이터를 저장한다. 단계 S516 및 S517에서, 바이오 노드는 센싱 값이 임계치 미만인 카운터가 기설정된 값(예컨대, 10)을 초과하지 않으면, 센싱 데이터를 실시간으로 관제 서버에 전송한다. 한편, 단계 S518 내지 단계 S520에서, 바이오 노드는 상시 감시 모드의 종료를 요청받으면, 상시 감시 모드의 종료 요청에 대해 응답하고 주기 감시 모드로 동작한다. 단계 S516에서, 바이오 노드는 센싱 값이 임계치 미만인 카운터가 기설정된 값(예컨대, 10)을 초과하면 주기 감 시 모드로 전환한다. 도 18 및 도 19는 본 발명의 일 실시예에 따른 스마트 쿼런틴 그리드 시스템에서 데이터 집중 장치의 동작을 나 타낸 도면이다. 도 18에 도시된 바와 같이, 단계 S601에서, 데이터 집중 장치는 부팅된다. 단계 S602에서, 데이터 집중 장치는 주기 감시 모드로 동작한다. 단계 S603 및 S604에서, 데이터 집중 장치는 메쉬 네트워크를 통해 센싱 프로파일 데이터를 수신하고, 메 쉬 네트워크를 통해 수신된 센싱 프로파일 데이터에 대해 응답한다. 단계 S605 및 S606에서, 데이터 집중 장치는 센싱 데이터를 수집하고, 수집된 센싱 데이터를 분석한다. 단계 S607에서, 데이터 집중 장치는 센싱 프로파일 데이터를 관제 서버에 전송하고, 주기 감시 모드 로 동작한다. 한편, 단계 S608 및 S609에서, 데이터 집중 장치는 메쉬 네트워크를 통해 임계치 초과 알람을 수신하면, 상시 감시 모드로 동작한다. 단계 S610 내지 S611에서, 데이터 집중 장치는 관제 서버로부터 상시 감시 모드 전환을 요청받으면, 관제 서버로 상시 감시 모드 전환 요청에 대해 응답하고, 상시 감시 모드로 동작한다. 한편, 도 19에 도시된 바와 같이, 단계 S612에서, 데이터 집중 장치는 모든 노드에 상시 감시 모드로의 전 환을 위한 브로드 캐스팅 메시지를 송신한다. 단계 S613에서, 데이터 집중 장치는 메쉬 네트워크를 통해 센싱 데이터를 실시간으로 수신한다. 단계 S614에서, 데이터 집중 장치는 관제 서버에 센싱 데이터를 실시간으로 전송하고, 단계 S609와 같이 상시 감시 모드로 동작한다. 이후, 단계 S615에서, 데이터 집중 장치는 실시간 감시 메시지를 미송신 하면 일정 시간(예컨대, 10분)을 유지한 후, 단계 S618과 같이 주기 감시 모드로 전환하여 동작한다. 단계 S616 내지 S618에서, 데이터 집중 장치는 관제 서버로부터 상시 감시 모드의 종료를 요청받으면, 상시 감시 모드의 종료 요청에 대해 응답하고 주기 감시 모드로 동작한다. 한편, 본 발명의 일 실시예에 따른 스마트 쿼런틴 그리드 시스템은 부유물질 오염 내역을 파악할 수 있다. 바이 오 노드는 센서 자체 기능 고도화를 통해, 광학 입자 방식 감지 시에 각 감지되는 입자의 특성에 따라 종 합 오염 수치뿐만 아니라 구체적으로 해당 오염 수치의 구성과 비율(예: 코로나 바이러스 19%, 감기 바이러스 30%, 혹은 ㎛단위의 입자 크기와 mol 단위의 입자 개수 등)을 센싱할 수 있다. 광학 측정의 경우에는 환경 변수에 크게 영향을 받지 않고, 입자에 대한 광학 반응의 여러 가지 요소를 추릴 수 있다. 바이오 노드는 측정의 결과로 UV 라이트 혹은 다른 종류의 특정한 빛을 쏘아서 해당하는 입자의 레 이 산란, 미 산란에 의해 발생하는 빛의 산란 정도나 탄성산란 조명으로 인한 입자 농도, 광 펄스 개체 수, 광 펄스의 진폭, 형광 방출 수치를 감지할 수 있다. 관제 서버는 바이오 노드와 연동하여, 이러한 각각 입자의 특성을 각각 파악하고 누적하여 통합적인 데이터 테이블로 구성하며, 시스템 상에서 종합 바이러스/세균 수치뿐만 아니라 해당 부유 물질의 구성과 비율도 정확히 파악할 수 있다. 이러한 구체적인 파악을 기반으로, 관제 서버는 분류된 감측 정보를 DB와 중앙 관리 소프트웨어로 전송하 며, DB는 바이러스 별로 별도 데이터 수치 값을 추가로 기록해, 필요한 바이러스만 선별해서 올릴 수도 있다. 관제 서버는 이를 기반으로 중앙 관리 소프트웨어를 통해 특정 바이러스에 대한 구체적인 접근과 우선순위 배정을 통한 각기 다른 방역 자원 투입을 수행할 수 있다. 또한, 관제 서버는 빅데이터 및 인공지능 영역 에서도 각각 구체적인 바이러스에 대한 직접적인 딥러닝과 빅데이터 분석이 가능하다. 하기의 [표 1]을 기반으로, 관제 서버는 ㎛단위의 입자 크기와 mol 단위의 입자 개수로 표현하여 구체적인 구성을 파악하고 비율을 추산할 수 있다. 표 1"}
{"patent_id": "10-2020-0112345", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "한편, QRMS(Quarantine Resource Management)에 대해 설명하기로 한다. 관제 서버는 QRMS(Quarantine Resource Management) 동작을 수행한다. 관제 서버는 실시간으로 바이 러스 센서의 센싱 데이터를 기반으로 즉각적인 방역 조치 및 조치 후의 효과 등을 즉시 검증 가능하다. 관제 서버는 전국의 각 지역 별로 구성돼 있는 방역 인적, 물적 자원에 대한 실시간 연동 및 업데이트, 조 회 기능을 수행할 수 있다. 관제 서버는 빅데이터 학습을 통해 오염 수치 별로 투입되어야 하는 방역 물적, 인적 자원 총량 및 구체적 인 구성에 대한 자동 추산(mapping data, simulation)을 수행할 수 있다. 관제 서버는 전국의 오염 수치와 연동하여 자동으로 무인 방역 시스템(로봇, IoT) 등을 투입할 수 있는 API 시스템 (Java, Python, Javascript 등에 기반한)을 제공할 수 있다. 관제 서버는 방역 원격 통제를 위해 각 지역의 담당 방역 업체, 기관, 공무원, 업자들에게 직접 방역 대상 으로 해당하는 내용의 오염 지역에 대한 정보, 관련 참고 정보, 방역 오염 수치 등을 방역 완료 때까지 임시적 으로 열어주는 시스템(Local Management)을 제공할 수 있다. 관제 서버는 현장의 방역 업체, 기관, 공무원, 업자들에게 실시간으로 오염 수치 관련 협업 정보를 표기할 뿐 아니라, 양방향 방식으로써 방역에 특화된 규격으로 소통하며 지속적으로 상황을 파악할 수 있는 내부 장착 소통 모듈(Communication Module)을 제공할 수 있다. 관제 서버는 현장 방역 혹은 자동 방역 처리 직후의 오염 수치 감지를 통해 방역의 효과 및 효율, 적정 투 입 규모나 방법 등에 대해 근실시간으로 중앙 시스템에 반영하여 추후 현장 방역 물적, 인적 자원 투입에 대한 통합적인 지표를 고도화시킬 수 있다. 정보의 동기화로 스마트 쿼런틴 그리드의 산업표준 기반이 될 데이터가 축적될 수 있다. 관제 서버는 바이러스/세균 오염 수치에 실시간으로 즉각 대응 가능한 방역 리소스 투입, 관리 시스템(센 서 정보 연동 + 실시간성)을 제공할 수 있다. 방역 시스템 데이터 규격을 살펴보면, 방역 시스템 데이터에는 물적 자원의 종류와 개수, 안전 등급(레벨), API 연동 여부, 직접 통신 가능 여부(+직접 통신 루트 및 포트): 장비, 소모제 등이 포함될 수 있다. 방역 시스템 데이터에는 인적 자원의 인원 수, 인원 별 등급, 인원 별 특화 분야(훈련, 자격증 정보), 투입 여 부, 작업 내역이 포함될 수 있다. 도 20은 본 발명의 일 실시예에 따른 스마트 쿼런틴 그리드 시스템에서 암호화 기반 송수신 장치의 동작을 나타 낸 도면이다. 도 20에 도시된 바와 같이, 데이터 암호화 장치는 프라이버시 데이터를 외부에서 전달 받고, 전달받은 프라이버 시 데이터를 암호화하여 관제 서버에 전송한다. 프라이버시 데이터에는 CCTV, 방문자 정보, 방문자의 시민 정보 등이 포함될 수 있다. 프라이버시 데이터는 평소엔 원래의 각 담당 보안관리자, 경비실, 보안실 등이 관리 한다. 이때, 데이터 암호화 장치는 바이오 센서의 센싱 데이터에서 오염 수치가 기준 이상인 경우 이에 대한 트 리거 기반으로 프라이버시 데이터를 전송한다. 일례로, 데이터 암호화 장치는 PGP, SHA256, AES 또는 SHA-1 등 의 방식으로 프라이버시 데이터를 암호화 진행하여 관제 서버에 전달할 수 있다. 데이터 암호화 장치는 이 더넷, 와이파이 등으로 API 연동하여 연결하거나, SMS를 통해 요청받아 웹 포털에 직접 업로드할 수 있다. 이는 정부나 지자체, 공기관, 인증 받은 대행 운영 업체(민간화 경우)를 위하여 오염 수치가 높은 지역에 대한 조치를 더욱 쉽게 하기 위함이다. 현장의 CCTV 정보나 방문자 정보를 자동으로 오염 수치가 특정 기준 이상으로 트리거(trigger)된 경우, 데이터 암호화 장치는 프라이버시 데이터를 암호화하여 관제 서버로 전송한다. 관제 서버는 중앙 관리 소프트웨어를 통해 관련 부처 서버(예컨대, 질본청, 공무원, 담당자, 보건복지부 등)로 전달한다. 관제 서버는 바이오 노드로부터 바이러스 센서의 센싱 데이터와 열감지 카메라에서 촬영된 수치 데이 터를 수신할 수 있다. 이러한 데이터는 태깅(Tagging) 여부만 다르지, 항상 전송하는 데이터이다. 바이오 노드 는 위 관련 데이터와 연계하여 별도 태깅(Tagging)하여 직접 데이터를 전달한다. 여기서, 태깅은 Tagging = \"polluted\" 등으로 별도 표기될 수 있다. 관제 서버는 암호화된 감염 의심 사례, 정보들과 함께 태깅된 직접 오염 수치 등을 관련 부처 서버에 전송 한다. 관제 서버는 관련하여 투입된 방역 정보와 방역 직후 정보를 전송할 수 있다. 관련 부처 서버는 프 라이빗 키(Private Key), 복호화 툴 등을 직접 보유할 수 있다. 관련 부처 서버는 별도로 감염 의심자, 접촉자 등 검사 및 관리 동작을 수행할 수 있다. 한편, 인공지능 및 빅데이터에서 구체적으로 바이러스 센서 및 그 기법을 적용하는 방법을 살펴보기로 한다. 크게 바이러스 센서의 센싱 데이터를 중심으로 인공지능 및 빅데이터는 클러스터 기법, CNN 기반 상관관계 추출 기법, 또는 LSTM 등 알고리즘을 통한 예측 기법에 의해 분석될 수 있다. 첫째, 클러스터 기법의 구체적 예를 살펴보기로 한다. 관제 서버는 바이러스 오염 특성들을 특징 별로 카테고리화하고, 분류화하여 이론화 및 정책수립 참고 등 에 활용할 수 있다. 여기서, 입력 데이터에는 바이러스 센서 정보(+열감지 수치 정보), 날짜/시간, 지역(위치 정보), 방문자 인구 통계(Demographic) 정보, 행사/휴일 등 특이 일정 정보, 날씨 관련 정보, 주변 교통량 정보, 및 유동 인구 관련 우회 확인 지표(결제량, 방문량, 특정 구간 입장 수치 등) 중에서 적어도 하나가 포함될 수 있다. 관제 서버는 클러스터 기법을 통해 어떤 특징을 가진 시간적, 공간적, 또는 인구적 그룹 클러스터에 대한 특징을 추출할 수 있다. 이를 위해, 관제 서버는 클러스터 기법과 하기의 기법들을 연동시킬 수 있다. 연동될 수 있는 기법들에는 SVM(Support Vector Machine) 분류법, KNN(K-nearest Neighbors) 분류법, 또는 GAN(Generative Adversarial Network) 기반 딥 클러스터링(Deep Clustering) 기법이 포함될 수 있다. 관제 서버에 의해 수행되는 하기 의 인공지능 알고리즘(예컨대, SVM, KNN, GAN 등)에 대해 설명하기로 한다. 서포트 벡터 머신(SVM, Support Vector Machine) 알고리즘은 지도학습기법으로 비-중첩(non-overlapping) 분할 을 제공하며 모든 속성(attributes)을 활용하는 전역적(global) 분류 모형이다. SVM은 최대 마진을 가지는 선형 판별에 기초하며, 속성들 간의 의존성은 고려하지 않는 방법이다. 최대 마진을 가지는 선형판별에 기초하며, 속 성들 간의 의존성은 고려하지 않는 방법이다. 선형분류 뿐 아니라, 커널 트릭(kernel trick)이라 불리는 (입력 자료의) 다차원 공간상으로의 맵핑(mapping) 기법을 사용하여 비선형분류도 효율적으로 수행한다. n개의 특성(feature)을 가진 데이터는 n차원의 공간에 점으로 개념화할 수 있다. 유사한 특성을 가진 데이터들 끼리는 거리가 가깝다. 그리고 거리 공식을 사용하여 데이터 사이의 거리를 구할 수 있다. K-최근접 이웃(KNN, K-Nearest Neighbor) 알고리즘은 분류를 알 수 없는 데이터에 대해 가장 가까운 이웃 k개의 분류를 확인하여 다 수결을 할 수 있다. 분류기의 효과를 높이기 위해 파라미터를 조정할 수 있다. K-최근접 이웃(KNN, K-Nearest Neighbor)의 경우 k 값을 변경할 수 있다. 분류기가 부적절하게 학습되면 오버피팅(overfitting) 또는 언더피팅 (underfitting)이 나타날 수 있다. 여기서, K-최근접 이웃(KNN, K-Nearest Neighbor)의 경우 너무 작은 k는 오 버피팅(overfitting), 너무 큰 k는 언더피팅(underfitting)을 야기한다. GAN은 생성적 적대 신경망(Generative Adversarial Network)의 약자로, 차세대 딥러닝 알고리즘으로 주목받고 있다. 진짜 같은 가짜를 생성하는 모델과 이에 대한 진위를 판별하는 모델의 경쟁을 통해 진짜 같은 가짜 이미 지를 만들 수 있다. 기존에 인간이 정제한 데이터를 바탕으로 학습하는 지도 학습 방식에서 벗어나 스스로 답을 찾는 비지도학습 방식을 사용해 인공지능(AI) 연구의 새로운 장을 열었다는 평가를 받는다. 둘째, CNN 기반 상관관계 추출 기법의 구체적 예를 살펴보기로 한다. 관제 서버는 CNN 기반 상관관계 추출 기법을 통해, 바이러스 오염 특성들을 특정 단일 혹은 하나 이상의 상관관계와 연동 딥러닝하여 해당 상관관계에 대한 인사이트를 추출할 수 있다. 입력 데이터에는 바이러스 센서 정보(+열감지 수치 정보), 날짜/시간, 지역(위치 정보), 방문자 인구 통계 (Demographic) 정보, 행사/휴일 등 특이 일정 정보, 날씨 관련 정보, 주변 교통량 정보, 및 유동 인구 관련 우 회 확인 지표(결제량, 방문량, 특정 구간 입장 수치 등) 중에서 적어도 하나가 포함될 수 있다. 관제 서버는 바이러스 센서 정보/오염 수치 정보와 위 입력 데이터 중에서 하나 혹은 그 이상의 그룹이 가 지는 상관 관계를 유추하고, 이를 기반으로 사전에 해당 수치에 기반하여 우회적인 예측이나 활용, 정책 수립 등이 가능해진다. CNN에 대해 살펴보면, 먼저 랜덤 포레스트(Random Forest) 알고리즘은 결정 트리(Decision Tree)의 분류보다 정 확도를 개선시키기 위해, 여러개의 나무를 생성하여 각각 나무의 예측을 총 조합하여 결론을 내리는 구조이다. 관제 서버는 CNN 기반 상관관계 추출 기법과 하기의 기법들을 연동시킬 수 있다. 연동될 수 있는 기법에는 선형 회귀(Linear Regression) 기법이 포함될 수 있다. 선형 회귀(Linear Regression)는 종속 변수 y와 한 개 이상의 독립 변수 (또는 설명 변수) X와의 선형 상관 관 계를 모델링하는 회귀분석 기법이다. 대표적으로 잔차를 활용하는데, 잔차란 관측값의 y와 예측값의 y 간의 차 이를 말한다. 셋째, LSTM 등 예측 중심 기법의 구체적 예를 살펴보기로 한다. 관제 서버는 시간적, 공간적, 또는 인구적 특성에 기반하여 미리 오염 수치, 전염에 대한 예측 및 확률을 추출할 수 있다. 입력 데이터에는 바이러스 센서 정보(+열감지 수치 정보), 날짜/시간, 지역(위치 정보), 방문자 인구 통계 (Demographic) 정보, 행사/휴일 등 특이 일정 정보, 날씨 관련 정보, 주변 교통량 정보, 및 유동 인구 관련 우 회 확인 지표(결제량, 방문량, 특정 구간 입장 수치 등) 중에서 적어도 하나가 포함될 수 있다. 관제 서버는 미리 오염 수치, 전염 확률이 높을 것으로 예측되는 시간적, 공간적, 또는 인구적 타겟에 방 역을 투입하거나 예비, 예방 대처를 하여 오염, 전염 등을 원천 차단할 수 있다. 이를 위해, 관제 서버는 LSTM 등 예측 중심 기법과 하기의 기법들을 연동시킬 수 있다. 연동될 수 있는 기 법들에는 CNN+RF(Random Forest) 기법, CNN+LSTM 기법 또는 멀티 스케일 덴스넷(Multi-Scale DenseNET)+CNN 기 법이 포함될 수 있다. LSTM은 RNN의 특별한 한 종류로, 긴 의존 기간을 필요로 하는 학습을 수행할 능력을 갖고 있다. LSTM은 긴 의존 기간의 문제를 피하기 위해 명시적으로(explicitly) 설계되었다. 셀 스테이트(Cell state)는 컨베이어 벨트와 같아서, 작은 선형 반복(linear interaction)만을 적용시키면서 전체 체인을 계속 구동시킨다. 정보가 전혀 바 뀌지 않고 그대로 흐르게만 하는 것은 매우 쉽게 할 수 있다. 멀티 스케일 덴스넷(Multi-Scale DenseNET)에 대해 살펴보면, 덴스넷(DenseNet) 아키텍처는 네트워크에 추가되 는 정보와 보존되는 정보를 명시적으로 구분한다. 은닉 신경망을 거쳐가며 중기, 장기 데이터에 관해서는 패턴 취득 소실이 있으므로, 이에 대해서 보완하기 위해 각자 규격과 길이가 다른 레이어를 더하여 딥러닝을 수행한 다. 도 21은 본 발명의 일 실시예에 사용되는 인공지능 및 딥러닝 파이프라인 구조를 나타낸 도면이다. 본 발명의 일 실시예에 따른 스마트 쿼런틴 그리드 시스템에서의 관제 서버에 의해 수행되는 인공지능 및 딥러닝 파이프라인 구조를 살펴보기로 한다. 인공지능 및 딥러닝 파이프라인 구조는 비록 접근법이나 적용 기법이 다르더라도, 기본적으로 다음과 같이 기본 적인 구조를 갖추고 있다. 즉, 전반적인 구조는 비슷하되, 각각 적용하는 인공지능 및 빅데이터 기법만 달라진 다. 관제 서버는 항상 적용하는 데이터는 무조건 모두 사용하는 게 아니라, 바이러스 센서의 센싱 데이터 를 중심으로 하되, x1, x1+x2, x1+x2+x3… 등의 방식으로 각기 다른 데이터 조합을 통해 사용할 수 있다. 관제 서버는 인공지능 및 딥러닝 파이프라인 구조에서 바이러스 센서의 직접적인 센싱 데이터와 그 외 외 부 입력 데이터를 연동(직접 업로드, API 등)한다. 그리고 관제 서버는 획득된 센싱 데이터와 외부 입력 데이터에 대해 데이터 전처리(Data Preprocessing)를 수행한다. 이어서, 관제 서버는 트레이닝 데이터(Train Data)에 직접 사용 기법 및 특화된 강화 방법을 적용한다. 여 기서, 직접 사용 기법에는 클러스터 기법, CNN 기반 상관관계 추출 기법, 또는 LSTM 등 알고리즘을 통한 예측 기법 등의 알고리즘이 각각 적용될 수 있다. 특화된 강화 기법에는 의사 결정을 위한 강화 학습 기법이 오염 수 치 딥러닝 기반 판별 여부에서 사용될 수 있다. 여기서, 그레디언트 부스팅 알고리즘 기반의 LightGBM(Light Gradient Boosted Machine) 기법이 사용될 수 있다. 그리고 관제 서버는 테스트 데이터(Test Data)에 적용할 인공지능 직접 기법을 적용한다. 여기서, 클러스 터 기법, CNN 기반 상관관계 추출 기법, 또는 LSTM 등 알고리즘을 통한 예측 기법 등의 알고리즘으로 각각 성능 테스트가 수행될 수 있다. 이후, 관제 서버는 성능 평가를 수행한다. 관제 서버는 선택적으로 회귀 모델로 결과를 검증할 수 있 고, 라벨링 된 실시간 데이터에 시뮬레이션 테스트를 수행할 수 있다. 그리고 관제 서버는 평가된 성능을 QRMS에 반영하고, 정책 수립 컨설팅에 이용할 수 있다. 한편, 프로세서에 의해 실행될 때, 상기 프로세서로 하여금 방법을 실행하게 하는 명령어들을 저장하기 위한 비 일시적 컴퓨터 판독가능 저장 매체로서, 상기 방법은: 바이오 노드가 주기 감시 모드로 대기 중의 부유물질 오 염도를 센싱하여 센싱 데이터를 주기적으로 전송하는 단계; 데이터 집중 장치가 상기 바이오 노드로부터 센싱 데이터를 수집하는 단계; 관제 서버가 상기 데이터 집중 장치로부터 수신된 센싱 데이터를 기반으로 대기 중의 부유물질 오염도를 분석하고 분석 결과를 기초로 방역 동작을 수행하는 단계; 상기 바이오 노드가 상기 센싱된 오염도가 기설정된 임계치를 초과하면 상시 감시 모드로 전환하고 오염 초과 알람과 센싱 데이터를 상기 데이터 집중 장치로 전송하는 단계; 및 상기 데이터 집중 장치가 상기 바이오 노드로부터 오염 초과 알람을 수신하면네트워크에 기할당된 다른 바이오 노드에 상시 감시 모드로의 모드 전환 메시지를 브로드캐스팅하는 단계를 포 함하는, 비일시적 컴퓨터 판독 가능한 저장 매체가 제공될 수 있다. 한편, 본 발명의 일 실시예에 따르면, 이상에서 설명된 다양한 실시예들은 기기(machine)(예: 컴퓨터)로 읽을 수 있는 저장 매체(machine-readable storage media)에 저장된 명령어를 포함하는 소프트웨어로 구현될 수 있다. 기기는, 저장 매체로부터 저장된 명령어를 호출하고, 호출된 명령어에 따라 동작이 가능한 장치로서, 개 시된 실시예들에 따른 전자 장치(예: 전자 장치(A))를 포함할 수 있다. 명령이 프로세서에 의해 실행될 경우, 프로세서가 직접, 또는 프로세서의 제어 하에 다른 구성요소들을 이용하여 명령에 해당하는 기능을 수행할 수 있다. 명령은 컴파일러 또는 인터프리터에 의해 생성 또는 실행되는 코드를 포함할 수 있다. 기기로 읽을 수 있 는 저장매체는, 비일시적(non-transitory) 저장매체의 형태로 제공될 수 있다. 여기서, '비일시적'은 저장매체 가 신호(signal)를 포함하지 않으며 실재(tangible)한다는 것을 의미할 뿐 데이터가 저장매체에 반영구적 또는 임시적으로 저장됨을 구분하지 않는다. 또한, 본 발명의 일 실시예에 따르면, 이상에서 설명된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품 (computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD-ROM))의 형태로, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 온라인으로 배포될 수 있 다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 또한, 본 발명의 일 실시예에 따르면, 이상에서 설명된 다양한 실시예들은 소프트웨어(software), 하드웨어 (hardware) 또는 이들의 조합을 이용하여 컴퓨터(computer) 또는 이와 유사한 장치로 읽을 수 있는 기록 매체 내에서 구현될 수 있다. 일부 경우에 있어 본 명세서에서 설명되는 실시예들이 프로세서 자체로 구현될 수 있다. 소프트웨어적인 구현에 의하면, 본 명세서에서 설명되는 절차 및 기능과 같은 실시예들은 별도의 소프트 웨어 모듈들로 구현될 수 있다. 소프트웨어 모듈들 각각은 본 명세서에서 설명되는 하나 이상의 기능 및 동작을 수행할 수 있다. 한편, 상술한 다양한 실시예들에 따른 기기의 프로세싱 동작을 수행하기 위한 컴퓨터 명령어(computer instructions)는 비일시적 컴퓨터 판독 가능 매체(non-transitory computer-readable medium)에 저장될 수 있 다. 이러한 비일시적 컴퓨터 판독 가능 매체에 저장된 컴퓨터 명령어는 특정 기기의 프로세서에 의해 실행되었 을 때 상술한 다양한 실시예에 따른 기기에서의 처리 동작을 특정 기기가 수행하도록 한다. 비일시적 컴퓨터 판 독 가능 매체란 레지스터, 캐쉬, 메모리 등과 같이 짧은 순간 동안 데이터를 저장하는 매체가 아니라 반영구적 으로 데이터를 저장하며, 기기에 의해 판독(reading)이 가능한 매체를 의미한다. 비일시적 컴퓨터 판독 가능 매 체의 구체적인 예로는, CD, DVD, 하드 디스크, 블루레이 디스크, USB, 메모리카드, ROM 등이 있을 수 있다. 또한, 상술한 다양한 실시예들에 따른 구성 요소(예: 모듈 또는 프로그램) 각각은 단수 또는 복수의 개체로 구 성될 수 있으며, 전술한 해당 서브 구성 요소들 중 일부 서브 구성 요소가 생략되거나, 또는 다른 서브 구성 요 소가 다양한 실시예에 더 포함될 수 있다. 대체적으로 또는 추가적으로, 일부 구성 요소들(예: 모듈 또는 프로 그램)은 하나의 개체로 통합되어, 통합되기 이전의 각각의 해당 구성 요소에 의해 수행되는 기능을 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따른, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작 들은 순차적, 병렬적, 반복적 또는 휴리스틱하게 실행되거나, 적어도 일부 동작이 다른 순서로 실행되거나, 생 략되거나, 또는 다른 동작이 추가될 수 있다. 이상에서는 본 발명의 바람직한 실시예에 대하여 도시하고 설명하였지만, 본 발명은 상술한 특정의 실시예에 한"}
{"patent_id": "10-2020-0112345", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "정되지 아니하며, 청구범위에서 청구하는 본 발명의 요지를 벗어남이 없이 당해 개시에 속하는 기술분야에서 통 상의 지식을 가진 자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 발명의 기술적 사상이나 전망으로부터 개별적으로 이해되어져서는 안될 것이다."}
{"patent_id": "10-2020-0112345", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 스마트 쿼런틴 그리드 시스템의 구성도이다. 도 2는 본 발명의 일 실시예에 따른 스마트 쿼런틴 그리드 시스템에서의 바이오 노드의 구성도이다. 도 3 및 도 4는 본 발명의 일 실시예에 따른 스마트 쿼런틴 그리드 시스템에서 주기 감시 모드의 동작을 나타낸 도면이다. 도 5 내지 도 8은 본 발명의 일 실시예에 따른 스마트 쿼런틴 그리드 시스템에서 상시 감시 모드의 동작을 나타 낸 도면이다. 도 9 내지 도 11은 본 발명의 일 실시예에 따른 스마트 쿼런틴 그리드 시스템에서 이동통신 모듈을 갖는 바이오노드에 의한 상시 감시 모드의 동작을 나타낸 도면이다. 도 12 및 도 13은 본 발명의 일 실시예에 따른 스마트 쿼런틴 그리드 시스템에서 스타 네트워크 기반의 바이오 노드의 동작을 나타낸 도면이다. 도 14 및 도 15는 본 발명의 일 실시예에 따른 스마트 쿼런틴 그리드 시스템에서 메쉬 네트워크 기반의 바이오 노드의 동작을 나타낸 도면이다. 도 16 및 도 17은 본 발명의 일 실시예에 따른 스마트 쿼런틴 그리드 시스템에서 이동통신 네트워크 기반의 바 이오 노드의 동작을 나타낸 도면이다. 도 18 및 도 19는 본 발명의 일 실시예에 따른 스마트 쿼런틴 그리드 시스템에서 데이터 집중 장치의 동작을 나 타낸 도면이다. 도 20은 본 발명의 일 실시예에 따른 스마트 쿼런틴 그리드 시스템에서 암호화 기반 송수신 장치의 동작을 나타 낸 도면이다. 도 21은 본 발명의 일 실시예에 사용되는 인공지능 및 딥러닝 파이프라인 구조를 나타낸 도면이다."}
