{"patent_id": "10-2023-0086204", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0006436", "출원번호": "10-2023-0086204", "발명의 명칭": "격리자 관리 대시보드 시스템 및 방법", "출원인": "주식회사 소프트넷", "발명자": "이상수"}}
{"patent_id": "10-2023-0086204", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "격리자 관리 대시보드 시스템에 있어서,운영 시스템과 연동하여 격리자의 격리 정보를 수신하는 격리 정보 수신부;상기 수신한 격리자의 격리 정보를 격리자별로 매칭하여 수집하는 개별 정보 수집부;상기 수집한 개별 정보를 기초로 격리자 상태 변화 여부 분석 데이터 또는 통계 분석 데이터를 생성하는 격리자정보 분석부;상기 격리자 상태 변화 여부 분석 데이터를 기초로 격리자 상태 변화가 발생되면 담당자에게 알림을 전송하는알림부;상기 격리자 상태 변화 여부 분석 데이터 및 통계 분석 데이터를 대시보드 상에 시각화 하는 대시보드시각화부;를 포함하는 격리자 관리 대시보드 시스템."}
{"patent_id": "10-2023-0086204", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 대시보드 시각화부는 격리자의 격리치료시설 내 로봇과 연동하여 비대면 화상을 제공하는 비대면 화상 제공부;를 더 포함하는 것을 특징으로 하는 격리자 관리 대시보드 시스템."}
{"patent_id": "10-2023-0086204", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 격리 정보는 격리자의 호출 정보 및 상담 정보를 포함하며,상기 비대면 화상 제공부는 상기 격리자의 호출 정보 및 상담 정보를 기초로 비대면 화상을 제공하는 것을 특징으로 하는 격리자 관리 대시보드 시스템."}
{"patent_id": "10-2023-0086204", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 격리 정보는 격리자의 체온, 맥박, 호흡수 및 산소포화도인 격리자의 생체 정보를 포함하며,상기 격리자 정보 분석부는 상기 생체 정보를 이용하여 체온, 맥박, 호흡수 및 산소포화도의 상태에 따른 점수를 각각 산출하여 격리자 상태 변화 여부 분석 데이터를 생성하는 것을 특징으로 하는 격리자 관리 대시보드 시스템."}
{"patent_id": "10-2023-0086204", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 격리 정보는 격리자의 격리 치료 입소 및 퇴소 정보를 포함하며,상기 대시보드 시각화부는 격리자의 격리 입소 또는 퇴소 여부를 대시보드 상에 시각화하는 것을 특징으로 하는 격리자 관리 대시보드 시스템."}
{"patent_id": "10-2023-0086204", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2025-0006436-3-중앙처리장치 및 메모리를 구비하는 격리자 관리 대시보드 시스템의 격리자 관리 대시보드 방법에 있어서,운영 시스템과 연동하여 격리자의 격리 정보를 수신하는 격리 정보 수신 단계;상기 수신한 격리자의 격리 정보를 격리자별로 매칭하여 수집하는 개별 정보 수집 단계;상기 수집한 개별 정보를 기초로 격리자 상태 변화 여부 분석 데이터 또는 통계 분석 데이터를 생성하는 격리자정보 분석 단계;상기 격리자 상태 변화 여부 분석 데이터를 기초로 격리자 상태 변화가 발생되면 담당자에게 알림을 전송하는알림 단계;상기 격리자 상태 변화 여부 분석 데이터 및 통계 분석 데이터를 대시보드 상에 시각화 하는 대시보드 시각화단계;를 포함하는 격리자 관리 대시보드 방법."}
{"patent_id": "10-2023-0086204", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 대시보드 시각화 단계는 격리자의 격리치료시설 내 로봇과 연동하여 비대면 화상을 제공하는 비대면 화상제공 단계;를 더 포함하는 것을 특징으로 하는 격리자 관리 대시보드 방법."}
{"patent_id": "10-2023-0086204", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 격리 정보는 격리자의 호출 정보 및 상담 정보를 포함하며,상기 비대면 화상 제공 단계는 상기 격리자의 호출 정보 및 상담 정보를 기초로 비대면 화상을 제공하는 것을특징으로 하는 격리자 관리 대시보드 방법."}
{"patent_id": "10-2023-0086204", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제6항에 있어서,상기 격리 정보는 격리자의 체온, 맥박, 호흡수 및 산소포화도인 격리자의 생체 정보를 포함하며,상기 격리자 정보 분석 단계는 상기 생체 정보를 이용하여 체온, 맥박, 호흡수 및 산소포화도의 상태에 따른 점수를 각각 산출하여 격리자 상태 변화 여부 분석 데이터를 생성하는 것을 특징으로 하는 격리자 관리 대시보드방법."}
{"patent_id": "10-2023-0086204", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제6항에 있어서,상기 격리 정보는 격리자의 격리 치료 입소 및 퇴소 정보를 포함하며,상기 대시보드 시각화 단계는 격리자의 격리 입소 또는 퇴소 여부를 대시보드 상에 시각화하는 것을 특징으로 하는 격리자 관리 대시보드 방법."}
{"patent_id": "10-2023-0086204", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제6항 내지 제10항 중 어느 한 항의 방법을 컴퓨터가 실행하도록 기능시키기 위한 프로그램이 기록된 컴퓨터로읽을 수 있는 기록매체."}
{"patent_id": "10-2023-0086204", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 격리자 관리 대시보드 시스템 및 방법에 관한 것으로, 격리자 관리 대시보드 시스템에 있어서, 운영 시스템과 연동하여 격리자의 격리 정보를 수신하는 격리 정보 수신부, 수신한 격리자의 격리 정보를 격리자별로 매칭하여 수집하는 개별 정보 수집부, 수집한 개별 정보를 기초로 격리자 상태 변화 여부 분석 데이터 또는 통계 분석 데이터를 생성하는 격리자 정보 분석부, 격리자 상태 변화 여부 분석 데이터를 기초로 격리자 상태 변화가 발생되면 담당자에게 알림을 전송하는 알림부, 격리자 상태 변화 여부 분석 데이터 및 통계 분석 데이터를 대시 보드 상에 시각화 하는 대시보드 시각화부를 포함 격리자 관리 대시보드 시스템 및 방법이 제공된다."}
{"patent_id": "10-2023-0086204", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 격리자 관리 대시보드 시스템 및 방법에 관한 것으로, 보다 상세하게는 격리자의 격리 정보를 기초로 격리자들을 한번에 모니터링 할 수 있도록 하는 격리자 관리 대시보드 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2023-0086204", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "환자의 사망률을 줄이기 위해 병원 및 헬스케어 센터에서의 모바일 로봇의 수요가 늘어나고 있으며, 코로나19 감염자 확산을 방지하기 위해 로봇을 활용하고 있다. 또한, 인공지능 기술, 전자의무기록 등과 같은 기술의 발 달로 인해 병원에서의 환자 질환 상태 판단뿐만 아니라 웨어러블 기기를 활용하여 환자의 상태를 더욱 쉽게 기 록할 수 있게 되었으며, 인터넷의 발달로 인해 기존의 물리적으로 방문하여 받는 의료서비스와 달리 의료진과 환자들 사이의 정보 교환의 형태가 확장되고 있다. 클라우드 컴퓨팅 또는 인터넷으로 연결된 형태로의 의료 정 보 활용의 기회가 높아짐에 따라 정확한 환자 상태 파악이 가능할 것이며 의료진의 더욱 정확한 질병 진단이 가 능해질 수 있으며, 스마트 병실에서는 질병 상태를 실시간으로 모니터링할 수 있으므로 보다 효과적인 질병 관 리가 가능함에 따라 격라자를 한번에 모니터링 할 수 있는 기술이 요구된다."}
{"patent_id": "10-2023-0086204", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 격리자의 격리 정보를 기초로 격리자들의 상태를 분석함으로써 격리자들을 한번에 모니터링 할 수 있 도록 하는 것을 목적으로 한다."}
{"patent_id": "10-2023-0086204", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이러한 목적을 달성하기 위하여 본 발명의 일실시예에 따른 격리자 관리 대시보드 시스템은 격리자 관리 대시보드 시스템에 있어서, 운영 시스템과 연동하여 격리자의 격리 정보를 수신하는 격리 정보 수 신부, 상기 수신한 격리자의 격리 정보를 격리자별로 매칭하여 수집하는 개별 정보 수집부, 상기 수집한 개별 정보를 기초로 격리자 상태 변화 여부 분석 데이터 또는 통계 분석 데이터를 생성하는 격리자 정보 분석부, 상 기 격리자 상태 변화 여부 분석 데이터를 기초로 격리자 상태 변화가 발생되면 담당자에게 알림을 전송하는 알 림부, 상기 격리자 상태 변화 여부 분석 데이터 및 통계 분석 데이터를 대시보드 상에 시각화 하는 대시보드 시 각화부를 포함하여 구성될 수 있다. 또한, 상기 대시보드 시각화부는 격리자의 격리치료시설 내 로봇과 연동하여 비대면 화상을 제공하는 비대면 화상 제공부를 더 포함하여 구성될 수 있다. 또한, 상기 격리 정보는 격리자의 호출 정보 및 상담 정보를 포함하며, 상기 비대면 화상 제공부는 상기 격리자 의 호출 정보 및 상담 정보를 기초로 비대면 화상을 제공하는 것을 특징으로 하여 구성될 수 있다. 또한, 상기 격리 정보는 격리자의 체온, 맥박, 호흡수 및 산소포화도인 격리자의 생체 정보를 포함하며, 상기 격리자 정보 분석부는 상기 생체 정보를 이용하여 체온, 맥박, 호흡수 및 산소포화도의 상태에 따른 점수를 각 각 산출하여 격리자 상태 변화 여부 분석 데이터를 생성하는 것을 특징으로 하여 구성될 수 있다. 또한, 상기 격리 정보는 격리자의 격리 치료 입소 및 퇴소 정보를 포함하며, 상기 대시보드 시각화부는 격리자 의 격리 입소 또는 퇴소 여부를 대시보드 상에 시각화하는 것을 특징으로 하여 구성될 수 있다."}
{"patent_id": "10-2023-0086204", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 격리자의 격리 정보를 기초로 격리자들의 상태를 분석함으로써 격리자들을 한번에 모니터링 할 수 있 도록 한다."}
{"patent_id": "10-2023-0086204", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 바람직한 실시예를 첨부된 도면들을 참조하여 상세히 설명한다. 본 발명을 설명함에 있어, 관 련된 공지 구성 또는 기능에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되는 경우에는 그 상 세한 설명은 생략하기로 한다. 또한 본 발명의 실시예들을 설명함에 있어 구체적인 수치는 실시예에 불과하며 이에 의하여 발명의 범위가 제한되지 아니한다. 본 발명에 따른 격리자 관리 대시보드 시스템은 중앙처리장치(CPU) 및 메모리(Memory, 기억장치)를 구비하 고 인터넷 등의 통신망을 통하여 다른 단말기와 연결 가능한 서버의 형태로 구성될 수 있다. 그러나 본 발명이 중앙처리장치 및 메모리 등의 구성에 의해 한정되지는 아니한다. 또한, 본 발명에 따른 격리자 관리 대시보드 시스템은 물리적으로 하나의 장치로 구성될 수도 있으며, 복수의 장치에 분산된 형태로 구현될 수도 있어, 본 발명은 이와 같은 물리적인 장치의 구성에 의하여 한정되지 아니한다. 도 1은 본 발명의 일실시예에 따른 격리자 관리 대시보드 시스템의 구성도를 도시한 도면이다. 격리 정보 수신부는 운영 시스템과 연동하여 격리자의 격리 정보를 수신할 수 있다. 격리 정보는 격리자의 체온, 맥박, 호흡수 및 산소포화도인 격리자의 생체 정보를 포함할 수 있다. 격리 정보는 격리자의 호출 정보 및 상담 정보를 포함할 수 있다. 격리 정보는 격리자의 격리 치료 입소 및 퇴소 정보를 포함할 수 있다. 격리자는 격리에서 치료받고 있는 환자일 수 있으며, 격리 정보 수신부는 격리자의 격리치료 입소 및 퇴소 와 생체정보데이터를 수신할 수 있다. 생체정보는 웨어러블 디바이스로의 센서장치로부터 측정된 값이며, 체온, 맥박, 호흡수 및 산소포화도 등 일 수 있다. 개별 정보 수집부는 수신한 격리자의 격리 정보를 격리자별로 매칭하여 수집할 수 있다. 개별 정보 수집부는 격리 정보 수신부에서 수신한 격리자의 격리 정보를 각각 매칭하여 저장할 수 있 으며, 격리자의 격리 정보를 각각 매칭하여 격리자의 정보를 수집할 수 있다. 예를 들면, 격리자 A의 체온, 맥박, 호흡수, 격리자 B의 체온, 입소 날짜 및 퇴소 날짜를 매칭하여 개별 정보 수집부에 저장할 수 있다. 격리자 정보 분석부는 수집한 개별 정보를 기초로 격리자 상태 변화 여부 분석 데이터 또는 통계 분석 데 이터를 생성할 수 있다. 격리자 정보 분석부는 시설에 입소한 환자의 기존 정보를 리스트로 확인할 수 있는 환자 목록조회 기능을 제공할 수 있으며, 격리자 정보 분석부는 개별 환자의 상세정보 및 생체정보 통합 관리 조회 기능을 제공 할 수 있으며, 격리자 정보 분석부는 전실, 퇴원 등 상태변경 값을 제공할 수 있다. 알림부는 격리자 상태 변화 여부 분석 데이터를 기초로 격리자 상태 변화가 발생되면 담당자에게 알림을 전송할 수 있다. 알림부는 환자 또는 격리자의 상태값 변동 시 간호부 또는 의료인에게 알림을 전송할 수 있으며, 알림은 푸시알림일 수 있다. 대시보드 시각화부는 격리자 상태 변화 여부 분석 데이터 및 통계 분석 데이터를 대시보드 상에 시각화 할 수 있다. 대시보드 시각화부는 격리자의 격리치료시설 내 로봇과 연동하여 비대면 화상을 제공하는 비대면 화상 제 공부를 더 포함할 수 있다.비대면 화상 제공부는 격리자의 호출 정보 및 상담 정보를 기초로 비대면 화상을 제공할 수 있다. 대시보드 시각화부는 격리자의 호출 정보 및 상담 정보를 기초로 비대면 화면을 제공할 수 있다. 대시보드 시각화부는 시스템의 사용성 향상을 위하여 상기 기능 또는 추가 기능 등은 격리치료시설 내 메시지센터 화면에 노출되며, 환자 관리를 위해 환자 대시보드 S/W 모니터링을 통해 관리할 수 있는 페이지로 구성 제공할 수 있다. 비대면 화상 제공부는 시스템의 사용성 향상을 위하여 상기 기능 또는 추가 기능 등은 격리치료 시설 내 메시지센터 화면에 노출되며, 환자 관리를 위해 환자 대시보드 S/W 모니터링을 통해 관리할 수 있는 페 이지로 구성 제공할 수 있다. 격리자 정보 분석부는 생체 정보를 이용하여 체온, 맥박, 호흡수 및 산소포화도의 상태에 따른 점수를 각 각 산출하여 격리자 상태 변화 여부 분석 데이터를 생성할 수 있다. 대시보드 시각화부는 격리자의 격리 입소 또는 퇴소 여부를 대시보드 상에 시각화할 수 있다. 격리치료시설 내 대상자 관리를 위한 S/W 개발을 목표로하며, 격리치료시설내 대상자관리를 위한 S/W 개발 및 격리자용 메시지센터 APP에 S/W 기능 탑재 진행 메세지센터 APP의 생체정보와 연계하여 대시보드 활용할 수 있 다. 또한, 실질적인 환자관리단계에서의 필요한 항목 관리 기능, 기존 생활치료센터 운영경험을 기반으로 간호 부, 원무팀과의 기능 연계가 가능한 범위를 지정할 수 있으며, 향후 통계자료 및 기타 리포트 생산에 적합한 데 이터 표현할 수 있다. 격리자 관리 대시보드 시스템은 주관기관의 통합 운영시스템과 연동하여 운영자 가입 및 인증할 수 있으며, - 격리치료 입소 및 퇴소와 생체정보데이터 현광 관리하는 시설상황 보드를 제공하며, 간호부 원무팀과 협의하여 시설관리 기능을 제공하며, 시설 입소 환자 정보를 등록하고 가능한 범위내에서 EMR 연동하여 환자를 관리할 수 있다. 또한, 주관기관의 통합 운영시스템과 연동하여 로봇을 관리할 수 있으며, 환자 서비스 사용량 및 생체정보데이 터의 향후 활용을 관리하여 통계관리할 수 있으며, Open API를 관리할 수 있다. 또한, 메뉴 및 권한, 화면테마 등 시스템 사용의 관리성을 강화하여 시스템을 관리할 수 있으며, 연계된 웨어러블 디바이스를 관리 영역으로 지정하여 의료기기 및 디바이스를 관리할 수 있다. 격리자 관리 대시보드 시스템은 시설에 입소한 환자의 기존 정보를 리스트로 확인할 수 있는 환자목록 조 회를 할 수 있으며, 개별환자의 상세정보 및 생체정보 통합 관리 조회를 하는 환자상세조회 기능을 제공하며, 전실 및 퇴원등 상태변경 값을 제공하는 환자상태 변경 기능을 제공하며, 병원정보시스템과 연동가능한 범위를 타진하는 의료진 소견을 등록할 수 있다. 또한, 환자의 상태값 변동시 간호부 또는 의료인에게 전송하는 푸시알 림전송 기능을 구비하고 있으며, 격리치료시설 내 로봇 메시지센터와 연동 비대면 화상 기능을 제공할 수 있다. 또한, 물품배송 의료진 호출 또는 상담 등 1대1 문의 기능을 제공할 수 있으며, 시스템의 사용성 향상을 위하여 기능 또는 추가 기능 등은 격리치료시설 내 메시지센터 화면에 노출되며, 환자 관리를 위해 환자 대시보드 S/W 모니터링을 통해 관찰할 수 있는 페이지로 구성을 제공할 수 있다. 그밖에 의료진의 사용 불편함을 감소시킬 수 있는 방법을 모색할 수 있으며, 이는 의료진과의 회의 및 시연을 통하여 극복할 수 있다. 격리자 관리 대시보드 시스템은 격리치료시설 연락처 등 기관관리를 위한 기능을 제공하는 센터정보관리 기능을 제공할 수 있으며, 센터 운영자의 가입승인 및 권한관리를 제공하는 센터 운영자 관리 기능, 로봇 운영 S/W와의 연계를 통해 센터 서비스 관리를 구성하는 센터 서비스 관리 기능을 제공할 수 있다. 또한, 최고 관리 자가 설정한 생체 측정 항목 관리 기능인 생체측정항목 기준관리 기능을 제공할 수 있으며, 타 기관연동 시 승 인민 관리하는 Open API 관리 기능, 주관기관의 통합관리시스템과 연동을 통해 시스템 관리 기능을 제공할 수 있다. 도 2는 본 발명의 일실시예에 따른 격리자 관리 대시보드 시스템을 구현하기 위한 격리치료시설 설치 및 운영 첨단화를 위한 통합 시스템 실환경 적용 시스템의 구성도를 도시한 도면이다. 격리자 관리 대시보드 시스템은 격리치료시설 설치 및 운영 첨단화를 위한 통합 시스템 실환경 적용 시스 템에 포함되는 기술이다. 격리치료시설 설치 및 운영 첨단화를 위한 통합 시스템 실환경 적용 시스템은 로봇 활 용 및 생체 신호 모니터링을 위한 단위 기술 개발, 통합 시스템 적용을 위한 단위 기술 고도화 및 통합 시스템 개발, 통합 시스템 실환경 적용 테스트, 격리치료시설에서의 개발 시스템 실증 시스템 기술을 포함하며, 격리자 관리 대시보드 시스템은 통합 시스템 실환경 적용 테스트 시스템에 포함될 수 있다. 통합 시스템 실환경 적용 테스트 시스템은 격리치료시설 보조를 위한 로봇 및 운영 매뉴얼 개발, 격리자 안면 검출 및 행동 인식 모듈 개발, 활동 센서 시스템 기반 격리자 위치 및 행동 추정 알고리즘 개발, 격리치료시설 관리 통합 시스템 개발, 격리치료시설 내 운영이 가능한 물류로봇 개발, 로봇 운영을 위한 실내환경 Map 모델링 기술 개발, 로봇 임무 생성 및 수행 알고리즘 개발, 격리치료시설 현장평가 기반 보조로봇개발 가이드라인 제시, 격리치료시설 대상자 관리 SW 개발을 포함할 수 있다. 격리치료시설 보조를 위한 로봇 및 운영 매뉴얼 개발은 격리치료시설 보조로봇 서비스 디자인 개발, 격리치료시 설 보조로봇 운영을 위한 매뉴얼 작성, 격리치료시설 보조로봇 사용성 평가, 격리치료시설 보조로봇 HW/SW개발 을 포함하며, 격리자 안면 검출 및 행동 인식 모듈 개발은 모니터링이 필요한 격리자 행동 10종 선정 및 DB 구 축, 엣지 컴퓨팅 환경 구축, 격리자 안면 검출 기술 개발, 격리자 행동 인식 기술 개발을 포함하며, 활동 센서 시스템 기반 격리자 위치 및 행동 추정 알고리즘 개발은 활동 센서 시스템 구축, 격리자 위치 및 행동 추정 알 고리즘 개발을 포함한다. 또한, 격리치료시설 관리 통합 시스템 개발은 격리치료시설 관리 통합 시스템 설계 및 적용, 격리치료시설 내 운영이 가능한 물류로봇 개발은 식사 및 물품 배송 플랫폼 개발, 로봇 위치 인식 및 주 행 기술 개발, 생체정보 기기 및 방역기기 연계 기술 개발, Semantic map 기반 자율 주행 알고리즘 개발, 5G 기 반 로봇 제어 App 인터페이스 개발, 자동 충전 기술 개발을 포함하며, 로봇 운영을 위한 실내환경 Map 모델링 기술 개발은 다중 마커 인식 및 관리 기술 개발, Grid map 융합 지도 생성 기술 개발, Semantic map 생성 기술 개발을 포함한다. 또한, 로봇 임무 생성 및 수행 알고리즘 개발은 음성 기반 임무 생성 및 수행 기술 개발, 모호한 명령에 대한 행간 추론 기술 개발, 이종 로봇 임무 수행 기술 개발, 격리치료시설 현장평가 기반 보조로봇개발 가이드라인 제시은 격리치료시설 보조로봇 가이드라인 제시, 격리치료시설 형태별 보조로봇 운영지침 개발, 격리치료시설 대상자 관리 SW 개발은 격리치료시설 생체정보기기 연동 및 데이터 저장 기술 개발, 모바일 App 2종 개발 (격리 자, 의료진), 생체정보 모니터링을 위한 상호연동 대시보드 개발, 격리시설 로봇 데이터 연동 모듈 개발 한다. 도 3은 본 발명의 일실시예에 따른 격리자의 생체 정보를 시각화하는 일례를 도시한 도면이다. 격리 정보 수신부는 운영 시스템과 연동하여 격리자의 격리 정보를 수신할 수 있다. 격리 정보는 격리자의 체온, 맥박, 호흡수 및 산소포화도인 격리자의 생체 정보를 포함할 수 있다. 격리자 정보 분석부는 생체 정보를 이용하여 체온, 맥박, 호흡수 및 산소포화도의 상태에 따른 점수를 각각 산출하여 격리자 상태 변화 여부 분석 데이터를 생성할 수 있다. 도 4는 본 발명의 일실시예에 따른 개별 정보를 기초로 통계 분석 데이터를 생성한 일례를 도시한 도면이다. 격리 정보는 격리자의 체온, 맥박, 호흡수 및 산소포화도인 격리자의 생체 정보를 포함할 수 있다. 격리자 정보 분석부는 수집한 개별 정보를 기초로 격리자 상태 변화 여부 분석 데이터 또는 통계 분석 데이터를 생성할 수 있다. 도 5는 본 발명의 일실시예에 따른 격리자의 호출 정보를 시각화하는 일례를 도시한 도면이다. 격리 정보 수신부는 운영 시스템과 연동하여 격리자의 격리 정보를 수신할 수 있다. 격리 정보는 격리자의 호출 정보 및 상담 정보를 포함할 수 있다. 격리자 정보 분석부는 수집한 개별 정보를 기초로 격리자 상태 변화 여부 분석 데이터 또는 통계 분석 데이터를 생성할 수 있다. 예를 들면, 격리자가 요청한 물품에 대한 통계 데이터 또는 리스트를 제공할 수 있으며, 격리자가 요청한 물품 에 대한 물품 상태(물품 요청, 수령 완료, 배송중 등)를 생성할 수 있다. 도 6은 본 발명의 일실시예에 따른 격리자가 호출 정보를 입력하는 일례를 도시한 도면이다. 격리 정보 수신부는 운영 시스템과 연동하여 격리자의 격리 정보를 수신할 수 있다. 격리 정보는 격리자의 호출 정보 및 상담 정보를 포함할 수 있다. 예를 들면, 격리자는 '타이레놀을 받을 수 있을까요?'와 같은 호출 정보를 입력하면, 격리 정보 수신부에 서 수신할 수 있다. 도 7은 본 발명의 일실시예에 따른 격리치료시설 내 로봇과 연동하여 비대면 화상을 제공하기 위한 일례를 도시 한 도면이다. 대시보드 시각화부는 격리자 상태 변화 여부 분석 데이터 및 통계 분석 데이터를 대시보드 상에 시각화 할 수 있다. 대시보드 시각화부는 격리자의 격리치료시설 내 로봇과 연동하여 비대면 화상을 제공하는 비대면화상 제공부를 더 포함할 수 있다. 비대면 화상 제공부는 격리자의 호출 정보 및 상담 정보를 기초로 비대면 화상을 제공할 수 있다. 도 8은 본 발명의 일실시예에 따른 격리자 관리 대시보드 방법의 순서도를 도시한 도면이다. 본 발명의 일실시예에 따른 격리자 관리 대시보드 방법은 중앙처리장치(CPU) 및 메모리(Memory)를 구비하는 격 리자 관리 대시보드 시스템에서 동작하는 방법으로, 상술한 격리자 관리 대시보드 시스템에 대한 설 명이 그대로 적용될 수 있다. 따라서 아래에 별도의 설명이 없더라도, 격리자 관리 대시보드 시스템을 설 명하기 위해 기재한 처리 방법을 구현하는데 그대로 적용할 수 있음은 자명하다. 격리 정보 수신 단계(S801)는 운영 시스템과 연동하여 격리자의 격리 정보를 수신할 수 있다. 격리 정보는 격리자의 체온, 맥박, 호흡수 및 산소포화도인 격리자의 생체 정보를 포함할 수 있다. 격리 정보는 격리자의 호출 정보 및 상담 정보를 포함할 수 있다. 격리 정보는 격리자의 격리 치료 입소 및 퇴소 정보를 포함할 수 있다. 격리자는 격리에서 치료받고 있는 환자일 수 있으며, 격리 정보 수신 단계(S801)는 격리자의 격리치료 입소 및 퇴소와 생체정보데이터를 수신할 수 있다. 생체정보는 웨어러블 디바이스로의 센서장치로부터 측정된 값이며, 체온, 맥박, 호흡수 및 산소포화도 등 일 수 있다. 개별 정보 수집 단계(S802)는 수신한 격리자의 격리 정보를 격리자별로 매칭하여 수집할 수 있다. 개별 정보 수집 단계(S802)는 격리 정보 수신 단계(S801)에서 수신한 격리자의 격리 정보를 각각 매칭하여 저장 할 수 있으며, 격리자의 격리 정보를 각각 매칭하여 격리자의 정보를 수집할 수 있다. 격리자 정보 분석 단계(S803)는 수집한 개별 정보를 기초로 격리자 상태 변화 여부 분석 데이터 또는 통계 분석 데이터를 생성할 수 있다. 격리자 정보 분석 단계(S803)는 시설에 입소한 환자의 기존 정보를 리스트로 확인할 수 있는 환자 목록조회 기 능을 제공할 수 있으며, 격리자 정보 분석 단계(S803)는 개별 환자의 상세정보 및 생체정보 통합 관리 조회 기 능을 제공할 수 있으며, 격리자 정보 분석 단계(S803)는 전실, 퇴원 등 상태변경 값을 제공할 수 있다. 알림 단계(S804)는 격리자 상태 변화 여부 분석 데이터를 기초로 격리자 상태 변화가 발생되면 담당자에게 알림 을 전송할 수 있다. 알림 단계(S804)는 환자 또는 격리자의 상태값 변동 시 간호부 또는 의료인에게 알림을 전송할 수 있으며, 알림 은 푸시알림일 수 있다. 대시보드 시각화 단계(S805)는 격리자 상태 변화 여부 분석 데이터 및 통계 분석 데이터를 대시보드 상에 시각 화 할 수 있다. 대시보드 시각화 단계(S805)는 격리자의 격리치료시설 내 로봇과 연동하여 비대면 화상을 제공하는 비대면 화상 제공부를 더 포함할 수 있다. 비대면 화상 제공부는 격리자의 호출 정보 및 상담 정보를 기초로 비대면 화상을 제공할 수 있다. 격리자 정보 분석 단계(S803)는 생체 정보를 이용하여 체온, 맥박, 호흡수 및 산소포화도의 상태에 따른 점수를 각각 산출하여 격리자 상태 변화 여부 분석 데이터를 생성할 수 있다. 대시보드 시각화 단계(S805)는 격리자의 격리 입소 또는 퇴소 여부를 대시보드 상에 시각화할 수 있다. 본 발명에 따른 격리자 관리 대시보드 방법은 컴퓨터가 실행하도록 기능시키기 위한 프로그램으로 제작되어 컴 퓨터로 읽을 수 있는 기록매체에 기록될 수 있다. 컴퓨터로 읽을 수 있는 기록 매체의 예에는, 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체, CDROM, DVD 와 같은 광기록 매체, 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical media), 및 ROM, RAM, 플래시 메모리 등과 같은 프로그램 명령어를 저장하고 수행하도록 특별히 구성된 하드웨 어 장치가 포함된다. 프로그램 명령어의 예에는, 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사 용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드도 포함된다. 상기 하드웨어 장치는 본 발명에 따른 처리를 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지이다. 이상에서는 실시예들을 참조하여 설명하였지만, 해당 기술 분야의 숙련된 당업자는 하기의 특허 청구범위에 기 재된 본 발명의 사상 및 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수정 및 변경시킬 수 있 다."}
{"patent_id": "10-2023-0086204", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시예에 따른 격리자 관리 대시보드 시스템의 구성도를 도시한 도면이다. 도 2는 본 발명의 일실시예에 따른 격리자 관리 대시보드 시스템을 구현하기 위한 격리치료시설 설치 및 운영 첨단화를 위한 통합 시스템 실환경 적용 시스템의 구성도를 도시한 도면이다. 도 3은 본 발명의 일실시예에 따른 격리자의 생체 정보를 시각화하는 일례를 도시한 도면이다. 도 4는 본 발명의 일실시예에 따른 개별 정보를 기초로 통계 분석 데이터를 생성한 일례를 도시한 도면이다.도 5는 본 발명의 일실시예에 따른 격리자의 호출 정보를 시각화하는 일례를 도시한 도면이다. 도 6은 본 발명의 일실시예에 따른 격리자가 호출 정보를 입력하는 일례를 도시한 도면이다. 도 7은 본 발명의 일실시예에 따른 격리치료시설 내 로봇과 연동하여 비대면 화상을 제공하기 위한 일례를 도시 한 도면이다. 도 8은 본 발명의 일실시예에 따른 격리자 관리 대시보드 방법의 순서도를 도시한 도면이다."}
