{"patent_id": "10-2019-0053287", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0128989", "출원번호": "10-2019-0053287", "발명의 명칭": "이산 웨이브릿 변환을 이용한 영상신호의 노이즈 제거 장치 및 이를 포함하는 원격 의료 진단", "출원인": "주식회사 힐세리온", "발명자": "유재천"}}
{"patent_id": "10-2019-0053287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "측정된 영상 신호를 입력 받기 위한 영상 신호 입력 센서부;상기 영상신호 입력 센서부로부터 입력 받은 영상 신호에 대해 이산 웨이블릿 변환을 수행하여, 저주파수 성분으로 구성된 저주파 이미지와 고주파수 성분으로 구성된 고주파 이미지로 분리하는 웨이블릿 변환부;상기 고주파 이미지에 포함된 노이즈 성분과 유사한 노이즈를 포함하는 복수개의 노이즈 이미지들을 생성하는노이즈 발생기;상기 고주파 이미지를 상기 노이즈 발생기에 의해 생성된 복수개의 노이즈 이미지들과 합산 평균하여 노이즈 감쇄된 고주파 이미지를 생성하는 고주파 이미지 합산기; 및상기 저주파 이미지와 상기 노이즈 감쇄된 고주파 이미지를 합성하여 노이즈가 제거된 영상을 생성하는 역 이산웨이블릿 변환부를 포함하는 노이즈 제거장치."}
{"patent_id": "10-2019-0053287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "측정된 동영상 이미지들을 입력하는 영상신호 입력 센서부; 상기 영상신호 입력 센서부로부터 입력 받은 복수개의 연속된 프레임으로 구성된 원본 동영상 이미지들에 대해이산 웨이블릿 변환을 수행하여, 저주파수 성분으로 구성된 저주파 동영상 이미지들과 고주파수 성분으로 구성된 고주파 동영상 이미지들로 분리하는 웨이블릿 변환부;상기 복수개의 연속된 프레임으로 구성된 원본 동영상 이미지들로부터 얻어진 고주파 이미지들을 합산 평균하여노이즈 감쇄된 고주파 이미지를 생성하는 고주파 동영상 이미지 합산기; 및상기 저주파 동영상 이미지들 중 중간 프레임에 속한 저주파 이미지와 상기 노이즈 감쇄된 고주파 이미지를 합성하여 노이즈가 제거된 영상을 생성하는 역 이산 웨이블릿 변환부를 포함하는 노이즈 제거장치."}
{"patent_id": "10-2019-0053287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항 또는 제2항에 있어서,상기 저주파 이미지 또는 저주파 동영상 이미지는 서브밴드 LL 이미지, 서브밴드 HL 이미지 및 서브밴드 LH 이미지를 포함하고, 상기 고주파 이미지 또는 고주파 동영상 이미지는 서브밴드 HH 이미지를 포함하는 것인, 노이즈 제거장치."}
{"patent_id": "10-2019-0053287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항 또는 제2항에 있어서,상기 고주파 이미지는 이산 웨이블릿 변환 또는 이산 웨이블릿 패킷 변환을 2 레벨 이상 수행하여 얻은 고주파대역내의 서브밴드 이미지를 포함하는, 노이즈 제거장치."}
{"patent_id": "10-2019-0053287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 노이즈 제거장치는 상기 영상신호 입력 센서부로부터의 입력 신호 유무를 판단하기 위한 무신호 감지기;상기 서브밴드 HH 이미지에 포함된 노이즈와 실제 이미지 정보를 구분하기 위한 문턱치를 생성하는 문턱치 생성부; 및상기 문턱치보다 작은 크기의 픽셀 값을 가지는 서브밴드 HH 이미지 상의 픽셀은 노이즈 픽셀로 간주하여, 상기공개특허 10-2020-0128989-3-노이즈 픽셀을 주변 픽셀을 이용하여 보간하고, 상기 문턱치보다 큰 크기의 픽셀 값을 가지는 서브밴드 HH 이미지상의 픽셀은 그대로 살려두어, 노이즈 프리 서브밴드 HH 이미지를 생성하기 위한 HH 쓰레쇼울더를 추가 구비한 것인, 노이즈 제거장치."}
{"patent_id": "10-2019-0053287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4항에 있어서,상기 노이즈 제거장치는스펙클 노이즈 제거를 위해 상기 서브밴드 HH 이미지들을 로그 변환하기 위한 로그 변환부와 상기 로그 변환된서브밴드 HH 이미지를 다시 원래대로 역변환하기 위한 지수 변환부를 더 구비한 것인, 노이즈 제거장치."}
{"patent_id": "10-2019-0053287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 노이즈 제거장치는,상기 스펙클 노이즈 제거 여부를 결정하는 스펙클 노이즈 제거 명령부, 로그 변환 선택 스위치 및 지수 변환 선택 스위치를 추가 포함하고,상기 스펙클 노이즈 제거 명령부에 의해 상기 로그 변환 선택 스위치 및 상기 지수 변환 선택 스위치가 활성화또는 비활성화 되는 것인, 노이즈 제거장치."}
{"patent_id": "10-2019-0053287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항 또는 제2항에 있어서,상기 노이즈 제거장치는 심장 맥박센서를 추가 포함하며,상기 영상 신호 입력 센서부는 심장의 맥박 신호에 동기화된 영상 신호 또는 동영상 이미지를 입력받는 것인,노이즈 제거장치."}
{"patent_id": "10-2019-0053287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제2항에 있어서,상기 노이즈 제거장치는상기 원본 동영상 이미지들의 프레임들간에 영상 정합 또는 영상 정렬을 수행하는 이미지 얼라이너; 및상기 이미지 얼라이너가 영상 정합을 수행할 때 참조 영상과 맞출 영상간의 이동벡터가 소정의 크기보다 큰 특징 점들을 포함하는 맞출 영상을 상기 고주파 동영상 이미지 합산기의 합산평균 과정에서 배제시키는 아웃라이어 감지부를 추가 포함하는 것인, 노이즈 제거장치."}
{"patent_id": "10-2019-0053287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 이미지 얼라이너는 시맨틱 분할 기반의 영상 정합 기법, 제어점 매핑에 의한 영상 정합 기법 또는 웨이블릿 프레임 기반의 영상 정합 기법을 사용하여 두 개의 이웃한 프레임간의 영상 정렬 또는 영상 정합을 수행하는것인, 노이즈 제거장치."}
{"patent_id": "10-2019-0053287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "원격 의료 진단 시스템에 있어서, 바이오 분석장치, 사용자 단말기 및 의료 전문가 단말기를 포함하고,상기 바이오 분석장치는 생물학적, 화학적 또는 생화학적 반응을 수행하는 바이오 디스크; 상기 바이오 디스크를 구동하는 중앙제어부, 및 제1항 또는 제2항에 따른 노이즈 제거장치, 및 상기 바이오 디스크 상에서 수행된바이오 반응 결과를 이미지 데이터로 캡쳐하는 이미지 센서를 포함하고,공개특허 10-2020-0128989-4-상기 사용자 단말기는 상기 바이오 분석장치의 사용 상황을 모니터링하는 카메라, 상기 바이오 디스크의 제품ID를 인증하는 제1인증부, 상기 노이즈 제거 장치에 의해 상기 캡쳐된 이미지 데이터에 포함된 노이즈가 제거된이미지 데이터를 저장하는 기록부, 통신 네트워크를 통해 상기 노이즈가 제거된 이미지 데이터 및 상기 바이오 디스크의 제품 ID를 원격 진단 서버로 송신하고, 원격 상담 서비스를 위한 통신 채널을 제공하는 인터넷 연결부, 의료 전문가와의 상담 서비스를 제공하는 제1 상담 서비스부; 상기 사용자 단말기상에 소프트웨어 형태로상주하여 상기 바이오 분석장치에 의해 축적된 이미지 데이터베이스를 사용하여 딥런닝 학습된 인공 지능 신경망; 및 상기 사용자 단말기상에 소프트웨어 형태로 상주하여 상기 바이오 분석장치의 사용방법을 안내하거나 상기 바이오 분석장치의 사용을 지시하는 안내부 및 상기 노이즈 제거장치에 의해 노이즈가 제거된 이미지 데이터를 상기 인공지능 신경망에 의해 자동 분석하여 진단결과를 출력하는 진단부를 구비한 가상 의사를 구비하고,상기 노이즈 제거장치와 상기 사용자 단말기는 통신 인터페이스를 통해 연결되고;상기 의료 전문가 단말기는 상기 통신 네트워크를 통해 상기 이미지 데이터를 수신하는 수신부, 및 사용자와 의료 전문가와의 상담 서비스를 제공하는 제2 상담 서비스부를 포함하는 것인,원격 의료 진단 시스템."}
{"patent_id": "10-2019-0053287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "원격 의료 진단 시스템에 있어서,의료장비, 제1항 또는 제2항에 따른 노이즈 제거장치, 사용자 단말기 및 의료 전문가 단말기를 포함하고,상기 의료 장비는 X-레이 검사, 초음파 검사, CT 검사, 또는 MRI 검사를 수행하고, 상기 의료 장비에 의해 측정된 환자의 의료 영상 데이터를 무선 송신하는 무선 송출부를 포함하고,상기 사용자 단말기는 상기 의료장비의 사용 상황을 모니터링하는 카메라, 상기 의료 장비의 제품ID를 무선으로인증하는 제2인증부, 상기 노이즈 제거 장치에 의해 상기 무선 송출부로부터 송출된 환자의 의료 영상 데이터에포함된 노이즈가 제거된 환자의 의료 영상 데이터를 저장하는 기록부; 통신 네트워크를 통해 상기 노이즈가 제거된 환자의 의료 영상 데이터와 의료 장비의 제품 ID를 원격 진단 서버로 송신하고, 원격 상담 서비스를 위한통신 채널을 제공하는 인터넷 연결부, 의료 전문가와의 상담 서비스를 제공하는 제3상담 서비스부; 상기 사용자 단말기상에 소프트웨어 형태로 상주하여 상기 의료장비에 의해 축적된 의료 영상 데이터베이스를 사용하여딥런닝 학습된 인공지능 신경망; 및 상기 사용자 단말기상에 소프트웨어 형태로 상주하여 상기 의료장비의 사용방법을 안내하거나 상기 의료장비의 사용을 지시하는 안내부 및 상기 노이즈 제거장치에 의해 노이즈가 제거된의료 영상 데이터를 상기 인공지능 신경망에 의해 자동 분석하여 진단결과를 출력하는 진단부를 구비한 가상 의사, 를 포함하고,상기 노이즈 제거장치와 상기 사용자 단말기는 통신 인터페이스를 통해 연결되고;상기 의료 전문가 단말기는 상기 통신 네트워크를 통해 상기 의료 영상 데이터를 수신하는 수신부, 및 사용자와의료 전문가와 의 상담 서비스를 제공하는 제4상담 서비스부를 포함하는,원격 의료 진단 시스템."}
{"patent_id": "10-2019-0053287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "의료장비로부터 얻어진 환자의 의료 영상 데이터에 포함된 노이즈를 제1항 또는 제2항에 따른 노이즈 제거 장치에 의해 제거하는 단계;상기 의료장비에 의해 축적된 의료 영상 데이터베이스를 사용하여 인공지능 신경망을 딥런닝에 의해 학습시키는단계;상기 노이즈 제거 장치에 의해 노이즈가 제거된 의료 영상 데이터를 상기 딥런닝 학습 완료된 인공지능 신경망에 의해 자동 분석하여 진단결과를 출력하는 단계; 및통신 네트워크를 통해 상기 노이즈가 제거된 의료 영상 데이터를 원격 진단 서버로 송신하고, 의료전문가와의원격 상담 서비스를 진행하는 단계를 포함하는, 공개특허 10-2020-0128989-5-원격 의료 진단 방법."}
{"patent_id": "10-2019-0053287", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 초음파 영상을 포함하는 각종 의료 영상, 바이오 디스크 상의 생물학적 화학 반응 결과에 대한 이미지 데이터, 의료장비의 영상 및 원격 의료 영상 속에 포함된 노이즈를 효과적으로 제거하기 위한 이산 웨이브릿 변 환을 이용한 노이즈 제거 장치 및 이를 이용한 원격 의료 진단 시스템을 제공한다."}
{"patent_id": "10-2019-0053287", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 초음파 영상을 포함하는 각종 의료 영상, 바이오 디스크 상의 생물학적 화학 반응 결과에 대한 영상, 의료기기 영상 및 원격 의료 영상 속에 포함된 노이즈(noise)를 효과적으로 제거하기 위한 이산 웨이브릿 변환 (Discrete Wavelet Transform)를 이용한 노이즈 제거 장치 및 이를 이용한 원격 의료 진단 시스템, 방법에 관한 것이다. 보다 상세하게는, 영상에 포함된 노이즈를 제거하기 위해 잡음 영상(noisy image)을 이산 웨이브릿 변환에 의해 노이즈를 많이 포함하는 고주파 이미지와 노이즈가 적은 저주파 이미지로 분리하고, 상기 고주파 이미지를 노이 즈 발생기에 의해 생성된 복수개의 노이즈 이미지와 합산 평균하는 노이즈 상쇄 제거과정을 통해 노이즈 감쇄된 고주파 이미지를 얻고, 상기 노이즈 감쇄된 고주파 이미지와 상기 저주파 이미지를 합성(synthesis)하여 노이즈 가 제거된 영상을 얻기 위한 노이즈 제거 장치 및 이를 이용한 원격 의료 진단 시스템, 방법을 제공한다. 본 발명에 따른 노이즈 제거 장치 및 이를 이용한 원격 의료 진단 시스템은 바이오 디스크 내지 랩온어 디스크 (Lab on a Disc) 상의 생물학적 화학 반응 결과에 대한 영상 분석, 원격 의료 영상과 초음파 영상에 흔하게 나 타나는 스펙클(speckle) 노이즈를 비롯한 각종 노이즈 제거하는데 유리할 뿐 만 아니라 의료 분야에서는 X-레이 · 초음파 · CT · MRI 등의 메디컬 이미지를 인공지능 신경망 (또는 인공 신경망이라 부름)을 이용해 환자의 상태를 자동 분석하여 그 결과를 환자나 의사에게 알려주는 가상의사(virtual doctor) 구현 시 매우 유리하다. 특히, 초음파 의료영상 같이 다량의 노이즈를 포함한 의료 영상을 이용한 가상 의사 구현 시, 좋은 성능을 갖춘 인공 지능형 가상 의사를 얻기 위해서는 품질 좋은 다량의 의료 영상에 의해 주어진 인공 신경망을 사전에 딥런 닝(deep learning) 과정을 통해 학습시켜야 한다. 본 발명의 이산 웨이블렛 변환를 이용한 노이즈 제거 장치 및 이를 이용한 원격 의료 진단 시스템은 의료 영상 속에 포함된 노이즈를 딥런닝 시작전에 미리 제거할 수 있어, 효율적 딥런닝(Deep Learning)이 가능할 뿐만 아니라, 가상의사에 있어 커다란 성능 향상에 가져다 줄 수 있다."}
{"patent_id": "10-2019-0053287", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "본 특허 출원은 선 등록된 유럽 특허 \"REMOTE MEDICAL-DIAGNOSIS SYSTEM AND METHOD\"(등록일자:2018.12.12,특 허 번호: 02140412)의 연속이다. 또한 본 특허 출원은 선 출원된 미국 특허 \"Nucleic Acid Amplification Disc Device Using Heat-Sensitive Polymer Composite, and Analysis Method Using Same\" (출원번호:14/758,444)의 연속이다. 또한 본 특허 출원은 선 출원된 한국 특허 \"검정색 열가소성 수지 밸브 및 비접촉 온도 센서를 이용한 랩온어 디스크 장치\" (출원번호:10-2017-0176306) 및 미국 특허 \" Thin Film Valve Device Using Fluid Hole Closing Membrane\" (출원번호:14/732,664)의 연속이다. 상기 선 출원된 발명은, 샘플을 수용하여 생물학적, 화학적 또는 생화학적 반응을 수행하는 바이오 디스크 또는 랩온어디스크(Lab on a Disc)를 포함하는 바이오 분석장치; 의료진료에 사용될 수 있는 체온계, 혈압계, 카메 라, 청진기, 체지방 측정기, 동맥경화 진단기, 초음파 영상진단기, 소변검사 장치, 맥박기, 채혈장치, 심전도계, X-Ray 장치, 산소 포화도 검사장치, 치매 검사장치, CAT(Computerized Axial Tomography) 장치, MRI(Magnetic Resonance Imaging) 장치, 캡슐내시경, 확대경, 카메라 일체형 확대경, 의료계측기기, 생체 신호 감지장치, 및 생체신호(당뇨, 비만, 혈압, 맥박, 심전도, 체온 등)를 측정할 수 있는 기능을 가진 바이오 셔츠 를 포함하는 진료 장치를 구비하여 사용자 단말기상에 소프트웨어 형태로 상주하여 상기 바이오 분석 장치 와 진료장치의 사용 방법을 안내하거나 지시하고 사용자와의 상담 서비스를 제공하는 가상 의사; 의료 전문가 또는 가상 의사와의 상담 서비스를 제공하는 사용자 단말기; 사용자와의 상담 서비스를 제공하는 의료 전문가 단말기; 및 상담 전문가로서 정기 검진 기간 동안에는 의료 전문가를 사용자에게 연결하고 그 외 기간 동안 에 는 가상 의사를 사용자에게 연결하고 사용자가 의료 전문가와 상담해야 하는 정기 검진 기간을 경과한 경우 사 용자와 가상 의사와의 상담 서비스 연결을 차단하는 원격 진단 서버를 포함하는 원격 의료 진단 시스템, 및 이 를 이용한 원격 의료 진단 방법을 제공한다.또한 상기 선 출원된 발명은, 상기 원격 의료 진단에 사용될 수 있는 온도 민감 폴리머 합성체를 이용한 핵산 증폭 디스크 및 이를 이용한 분석 방법; 과 상기 핵산 증폭 디스크 와 바이오 디스크상의 유체의 흐름을 제어하 기 위한 유공의 박막밸브 장치를 제공한다 최근 영상 처리 기술은 현대 생활에 있어서 매우 양질의 영상 정보를 우리에게 제공할 수 있도록 돕고 있다. 특 히 이러한 영상 처리 기술은 디지털 카메라 영상, 바이오 디스크상의 바이오 반응 결과에 대한 영상, 원격 의료 진료 영상, 우주 탐사 영상 및 초음파 의료 영상 등의 다양한 분야의 영상 품질 개선에 응용되고 있다. 그러나, 바이오 반응 결과에 대한 영상 분석, 원격 의료 영상, 우주 탐사 영상 및 초음파 의료 영상 데이터에는 원하는 영상 신호뿐 만 아니라 많은 다양한 노이즈 성분이 포함되어 있어 고품질의 영상을 획득하기 어렵다. 최근 이러 한 노이즈를 줄여 영상의 화질을 개선하기 위하여 여러 가지 영상 처리 방식들이 연구 수행되어 왔다. 일반적으로, 영상을 획득하거나 전송하는 과정 등에서 주변의 환경이나 채널 간섭 등에 의해 스펙클 노이즈 (speckle noise)를 비롯한 다양한 종류의 노이즈가 발생된다. 그러나 원격 영상 진료, 우주 탐사 영상 및 의료 영상 데이터상의 노이즈는 일반적인 노이즈 제거 알고리즘으로는 쉽게 제거되지 않고, 제거되더라도 신호의 고 주파 대역의 정보가 심하게 훼손되어 전문가가 아니면 영상의 정확한 해석이 어려운 경우가 많다. 이러한 노이 즈 제거 알고리즘은 복원(restoration) 개념을 사용한 기법과 Median 필터나 Weiner 필터 같은 필터링 기법을 이용한 방법 등으로 나누어 볼 수 있다. 복원 기법은 노이즈에 대한 정확한 모델링을 전제조건으로 하고 있기 때문에, 노이즈에 대한 정확한 모델링이 어려운 실제 상황에서 노이즈 제거에 많은 어려움을 겪는다. 이에 반해, 필터링 기법들은 잡음뿐 아니라 영상에 필요한 고주파 성분도 제거되어 영상의 세밀 한 부분이 제 거되어 에지(edge) 성분 같은 고주파 영역이 훼손되는 블러링(blurring) 현상이 발생하게 된다. 영상의 고주파 성분에는 영상에 포함된 객체의 경계선을 나타내는 성분이 노이즈 성분과 함께 포함되어 있으므 로, 기존의 방법에서와 같이 고주파 성분을 억제하는 방법으로 노이즈를 제거하게 되면 원치 않는 노이즈뿐만 아니라 원 신호의 특징까지 감소 시키는 블러링 문제를 일으킨다. 따라서 영상의 특징을 보존하면서도 노이즈를 효과적으로 제거할 수 있는 방법이 필요하다. 특히, 의료 영상신호의 대표적인 초음파 이미지는 초음파 신호간의 간섭에 의해 발생하는 스펙클 노이즈로 인해 초음파 이미지가 손상되어 초음파 영상의 질 저하를 가져오고, 전문 의료인조차도 영상을 인지하고 진단하는데 큰 어려움을 겪는다. 그러므로 초음파 영상에서 스펙클 노이즈를 줄임으로써, 진단에 유용한 영상을 만드는 것 이 필요하다."}
{"patent_id": "10-2019-0053287", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기 종래기술의 문제점들을 해결하기 위하여 안출된 것으로, 유용한 정보를 담고 있는 상세한 (detail) 정보를 보존하면서 노이즈를 효과적으로 제거하기 위해, 잡음 영상(noisy image)을 웨이브릿 변환에 의해 고주파 이미지 와 저주파 이미지를 분리하고, 상기 고주파 이미지를 노이즈 발생기에 의해 생성된 복수개 의 노이즈 이미지와 합산 평균하는 노이즈 상쇄 제거과정을 통해 노이즈 감쇄된 고주파 이미지를 얻고, 상기 노 이즈가 감쇄된 고주파 이미지와 상기 저주파 이미지를 합성하여 노이즈가 제거된 영상을 얻는 이산 웨이브릿 변 환(Discrete Wavelet tansform)을 이용한 노이즈 제거 장치 및 이를 이용한 원격 의료 진단 시스템, 방법을 제 공한다. 본 발명의 또 다른 측면은 인공지능 신경망(또는 인공 신경망)을 더 구비하여 X-레이 · 초음파 · CT · MRI 등 메디컬 장비의 이미지 데이터베이스를 사용하여 상기 인공지능 신경망을 딥런닝(Deep learning)시켜, 환자의 상태를 자동 분석하는 인공지능형 가상의사를 구비한 노이즈 제거 장치 및 이를 이용한 원격 의료 진단 시스템, 방법을 제공한다. 다만, 본원의 실시예가 이루고자 하는 기술적 과제는 상기된 바와 같은 기술적 과제들로 한정되지 않으며, 또 다른 기술적 과제들이 존재할 수 있다."}
{"patent_id": "10-2019-0053287", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본원의 일 실시예에 따른 노이즈 제거 장치는, 측정된 영상 신호를 입력 받기 위한 영상 신호 입력 센서부; 상기 영상신호 입력 센서부로부터 입력 받은 영상 신호에 대해 이산 웨이블릿 변환을 수행하여, 저주파수 성분으로 구성된 저주파 이미지와 고주파수 성분으로 구성된 고주파 이미지로 분리하는 웨이블릿 변환부; 상기 고주파 이미지에 포함된 노이즈 성분과 유사한 노이즈를 포함하 는 복수개의 노이즈 이미지들을 생성하는 노이즈 발생기; 상기 고주파 이미지를 상기 노이즈 발생기에 의해 생 성된 복수개의 노이즈 이미지들과 합산 평균하여 노이즈 감쇄된 고주파 이미지를 생성하는 고주파 이미지 합산 기; 및 상기 저주파 이미지와 상기 노이즈 감쇄된 고주파 이미지를 합성하여 노이즈가 제거된 영상을 생성하는 역 이산 웨이블릿 변환부를 포함할 수 있다. 또한, 본원의 일 실시예에 따른 노이즈 제거 장치는, 측정된 동영상 이미지들을 입력하는 영상신호 입력 센서부; 상기 영상신호 입력 센서부로부터 입력 받은 복수개의 연속된 프레임으로 구성된 원본 동영상 이미지들 에 대해 이산 웨이블릿 변환을 수행하여, 저주파수 성분으로 구성된 저주파 동영상 이미지들과 고주파수 성분으 로 구성된 고주파 동영상 이미지들로 분리하는 웨이블릿 변환부; 상기 복수개의 연속된 프레임으로 구성된 원본 동영상 이미지들로부터 얻어진 고주파 이미지들을 합산 평균하여 노이즈 감쇄된 고주파 이미지를 생성하는 고주 파 동영상 이미지 합산기; 및 상기 저주파 동영상 이미지들 중 중간 프레임에 속한 저주파 이미지와 상기 노이 즈 감쇄된 고주파 이미지를 합성하여 노이즈가 제거된 영상을 생성하는 역 이산 웨이블릿 변환부를 포함할 수 있다. 본 발명에 있어서, 상기 저주파 이미지 또는 저주파 동영상 이미지는 서브밴드 LL 이미지, 서브밴드 HL 이미지 및 서브밴드 LH 이미지를 포함하고, 상기 고주파 이미지 또는 고주파 동영상 이미지는 서브밴드 HH 이미지를 포 함할 수 있다. 본 발명에 있어서, 상기 고주파 이미지는 이산 웨이블릿 변환 또는 이산 웨이블릿 패킷 변환을 2 레벨 이상 수 행하여 얻은 고주파 대역내의 서브밴드 이미지를 포함할 수 있다. 또한, 본원의 일 실시예에 따른 노이즈 제거 장치는, 상기 영상신호 입력 센서부로부터의 입력 신호 유무를 판 단하기 위한 무신호 감지기; 상기 서브밴드 HH 이미지에 포함된 노이즈와 실제 이미지 정보를 구분하기 위한 문 턱치를 생성하는 문턱치 생성부; 및 상기 문턱치보다 작은 크기의 픽셀 값을 가지는 서브밴드 HH 이미지 상의 픽셀은 노이즈 픽셀로 간주하여, 상기 노이즈 픽셀을 주변 픽셀을 이용하여 보간하고, 상기 문턱치보다 큰 크기 의 픽셀 값을 가지는 서브밴드 HH 이미지상의 픽셀은 그대로 살려두어, 노이즈 프리 서브밴드 HH 이미지를 생성 하기 위한 HH 쓰레쇼울더를 추가 구비할 수 있다. 또한, 본원의 일 실시예에 따른 노이즈 제거 장치는, 스펙클 노이즈 제거를 위해 상기 서브밴드 HH 이미지들을 로그 변환하기 위한 로그 변환부와 상기 로그 변환된 서브밴드 HH 이미지를 다시 원래대로 역변환하기 위한 지 수 변환부를 더 구비할 수 있다. 또한, 본원의 일 실시예에 따른 노이즈 제거 장치는, 상기 스펙클 노이즈 제거 여부를 결정하는 스펙클 노이즈 제거 명령부, 로그 변환 선택 스위치 및 지수 변환 선택 스위치를 추가 포함하고, 상기 스펙클 노이즈 제거 명 령부에 의해 상기 로그 변환 선택 스위치 및 상기 지수 변환 선택 스위치가 활성화 또는 비활성화 될 수 있다. 또한, 본원의 일 실시예에 따른 노이즈 제거 장치는, 심장 맥박센서를 추가 포함하며, 상기 영상 신호 입력 센 서부는 심장의 맥박 신호에 동기화된 영상 신호 또는 동영상 이미지를 입력받을 수 있다. 또한, 본원의 일 실시예에 따른 노이즈 제거 장치는, 상기 원본 동영상 이미지들의 프레임들간에 영상 정합 또 는 영상 정렬을 수행하는 이미지 얼라이너; 및 상기 이미지 얼라이너가 영상 정합을 수행할 때 참조 영상과 맞 출 영상간의 이동벡터가 소정의 크기보다 큰 특징 점들을 포함하는 맞출 영상을 상기 고주파 동영상 이미지 합 산기의 합산평균 과정에서 배제시키는 아웃라이어 감지부를 추가 포함할 수 있다. 본 발명에 있어서, 상기 이미지 얼라이너는 시맨틱 분할 기반의 영상 정합 기법, 제어점 매핑에 의한 영상 정합 기법 또는 웨이블릿 프레임 기반의 영상 정합 기법을 사용하여 두 개의 이웃한 프레임간의 영상 정렬 또는 영상 정합을 수행할 수 있다. 한편, 본원의 일 실시예에 따른 원격 의료 진단 시스템은, 바이오 분석장치, 사용자 단말기 및 의료 전문가 단 말기를 포함하고, 상기 바이오 분석장치는 생물학적, 화학적 또는 생화학적 반응을 수행하는 바이오 디스크; 상 기 바이오 디스크를 구동하는 중앙제어부, 및 제1항 또는 제2항에 따른 노이즈 제거장치, 및 상기 바이오 디스 크 상에서 수행된 바이오 반응 결과를 이미지 데이터로 캡쳐하는 이미지 센서를 포함하고, 상기 사용자 단말기 는 상기 바이오 분석장치의 사용 상황을 모니터링하는 카메라, 상기 바이오 디스크의 제품ID를 인증하는 제1인 증부, 상기 노이즈 제거 장치에 의해 상기 캡쳐된 이미지 데이터에 포함된 노이즈가 제거된 이미지 데이터를 저 장하는 기록부, 통신 네트워크를 통해 상기 노이즈가 제거된 이미지 데이터 및 상기 바이오 디스크의 제품 ID 를 원격 진단 서버로 송신하고, 원격 상담 서비스를 위한 통신 채널을 제공하는 인터넷 연결부, 의료 전문가와의 상담 서비스를 제공하는 제1 상담 서비스부; 상기 사용자 단말기상에 소프트웨어 형태로 상주하여 상기 바이 오 분석장치에 의해 축적된 이미지 데이터베이스를 사용하여 딥런닝 학습된 인공 지능 신경망; 및 상기 사용자 단말기상에 소프트웨어 형태로 상주하여 상기 바이오 분석장치의 사용방법을 안내하거나 상기 바이오 분석장치 의 사용을 지시하는 안내부 및 상기 노이즈 제거장치에 의해 노이즈가 제거된 이미지 데이터를 상기 인공지능 신경망에 의해 자동 분석하여 진단결과를 출력하는 진단부를 구비한 가상 의사를 구비하고, 상기 노이즈 제거장 치와 상기 사용자 단말기는 통신 인터페이스를 통해 연결되고; 상기 의료 전문가 단말기는 상기 통신 네트워크 를 통해 상기 이미지 데이터를 수신하는 수신부, 및 사용자와 의료 전문가와의 상담 서비스를 제공하는 제2 상 담 서비스부를 포함할 수 있다. 또한, 본원의 일 실시예에 따른 원격 의료 진단 시스템은, 의료장비, 제1항 또는 제2항에 따른 노이즈 제거장치, 사용자 단말기 및 의료 전문가 단말기를 포함하고, 상기 의료 장비는 X-레이 검사, 초음파 검사, CT 검사, 또는 MRI 검사를 수행하고, 상기 의료 장비에 의해 측정된 환자의 의료 영상 데이터를 무선 송신하는 무 선 송출부를 포함하고, 상기 사용자 단말기는 상기 의료장비의 사용 상황을 모니터링하는 카메라, 상기 의료 장 비의 제품ID를 무선으로 인증하는 제2인증부, 상기 노이즈 제거 장치에 의해 상기 무선 송출부로부터 송출된 환 자의 의료 영상 데이터에 포함된 노이즈가 제거된 환자의 의료 영상 데이터를 저장하는 기록부; 통신 네트워크 를 통해 상기 노이즈가 제거된 환자의 의료 영상 데이터와 의료 장비의 제품 ID를 원격 진단 서버로 송신하고, 원격 상담 서비스를 위한 통신 채널을 제공하는 인터넷 연결부, 의료 전문가와의 상담 서비스를 제공하는 제3상 담 서비스부; 상기 사용자 단말기상에 소프트웨어 형태로 상주하여 상기 의료장비에 의해 축적된 의료 영상 데 이터베이스를 사용하여 딥런닝 학습된 인공지능 신경망; 및 상기 사용자 단말기상에 소프트웨어 형태로 상주하 여 상기 의료장비의 사용방법을 안내하거나 상기 의료장비의 사용을 지시하는 안내부 및 상기 노이즈 제거장치 에 의해 노이즈가 제거된 의료 영상 데이터를 상기 인공지능 신경망에 의해 자동 분석하여 진단결과를 출력하는 진단부를 구비한 가상 의사, 를 포함하고, 상기 노이즈 제거장치와 상기 사용자 단말기는 통신 인터페이스를 통 해 연결되고; 상기 의료 전문가 단말기는 상기 통신 네트워크를 통해 상기 의료 영상 데이터를 수신하는 수신부, 및 사용자와 의료 전문가와 의 상담 서비스를 제공하는 제4상담 서비스부를 포함할 수 있다. 한편, 본원의 일 실시예에 따른 원격 의료 진단 방법은, 의료장비로부터 얻어진 환자의 의료 영상 데이터에 포 함된 노이즈를 제1항 또는 제2항에 따른 노이즈 제거 장치에 의해 제거하는 단계; 상기 의료장비에 의해 축적된 의료 영상 데이터베이스를 사용하여 인공지능 신경망을 딥런닝에 의해 학습시키는 단계; 상기 노이즈 제거 장치 에 의해 노이즈가 제거된 의료 영상 데이터를 상기 딥런닝 학습 완료된 인공지능 신경망에 의해 자동 분석하여 진단결과를 출력하는 단계; 및 통신 네트워크를 통해 상기 노이즈가 제거된 의료 영상 데이터를 원격 진단 서버 로 송신하고, 의료전문가와의 원격 상담 서비스를 진행하는 단계를 포함할 수 있다. 상기한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본원의 일 실시예에 따른 노이즈 제거 장치는, 측정된 영상신호를 입력 받는 영상 신호 입력 센서부; 상기 입력 받은 영상 신호에 대해 이산 웨이브릿 변환을 수행하 여, 저주파수 성분으로 구성된 저주파 이미지와 고주파수 성분으로 구성된 고주파 이미지로 분리하는 웨이브릿 변환부; 상기 고주파 이미지에 포함된 노이즈 성분과 유사한 노이즈를 포함하는 복수개의 노이즈 이미지를 생성 하는 노이즈 발생기; 상기 고주파 이미지와 상기 노이즈 이미지에 기초하여 노이즈가 감쇄된 고주파 이미지를 생성하는 고주파 이미지 합산기; 및 상기 저주파 이미지와 상기 노이즈가 감쇄된 고주파 이미지를 합성하여 노 이즈가 제거된 영상을 생성하는 역 이산 웨이브릿 변환부를 포함할 수 있다. 본 발명에 있어서, 상기 웨이브릿 변환부는 이산 웨이브릿 변환을 수행하여 원본영상을 LL 이미지, HL 이미지, LH 이미지 및 HH 이미지를 포함하는 4개의 서브밴드 이미지로 분해할 수 있다. 본 발명에 있어서, 상기 저주파 이미지는 서브밴드 LL 이미지, HL 이미지 및 LH 이미지를 포함하고, 상기 고주 파 이미지는 서브밴드 HH 이미지를 포함할 수 있다. 본 발명에 있어서, 상기 웨이브릿 변환부는 이산 웨이브릿 변환을 2레벨 이상 수행하고, 상기 고주파 이미지는 서브밴드 HHHH 이미지를 포함할 수 있다. 또한, 본원의 일 실시예에 따른 노이즈 제거 장치는, 상기 영상 신호 입력 센서부로부터의 입력 신호 유무를 판 단하는 무신호 감지기; 무신호 감지기가 무신호 감지 시, 상기 고주파 이미지 합산기에 의해 얻어진 노이즈가 감쇄된 고주파 이미지에 포함된 노이즈와 실제 이미지 정보를 구분하기 위한 문턱치를 생성하는 문턱치 생성부; 및 상기 생성된 문턱치와 상기 노이즈가 감쇄된 고주파 이미지상의 픽셀값의 크기를 비교하여 노이즈가 감쇄된 고주파 이미지로부터 노이즈를 제거하는 문턱치 판단부를 더 포함할 수 있다.또한, 본원의 일 실시예에 따른 노이즈 제거 장치는, 상기 웨이브릿 변환 후 분리된 고주파 이미지를 로그 형태 로 변환하는 로그함수 변환부; 상기 고주파 이미지 합산기로부터 생성된 노이즈가 감쇄된 고주파 이미지를 지수 형태로 변환하는 지수함수 변환부; 및 상기 로그함수 변환부와 지수함수 변환부의 활성여부를 제어하는 승법 노 이즈 제거 명령부를 더 포함할 수 있다. 또한, 본원의 일 실시예에 따른 노이즈 제거 장치는, 상기 입력된 영상 신호가 심장 맥박 센서에서 측정되는 심 장의 맥박 신호에 동기화되는 것을 특징으로 할 수 있다. 또한, 본원의 일 실시예에 따른 노이즈 제거 장치는, 측정된 복수개의 동영상 이미지로 구성된 동영상을 입력 받는 영상 신호 입력 센서부; 상기 입력 받은 동영상에 포함된 복수개의 동영상 이미지에 대해 이산 웨이브릿 변환을 수행하여, 저주파수 성분으로 구성된 저주파 동영상 이미지와 고주파수 성분으로 구성된 고주파 동영상 이미지로 분리하는 웨이브릿 변환부; 상기 고주파 동영상 이미지에 기초하여 노이즈가 감쇄된 고주파 동영상 이 미지를 생성하는 고주파 동영상 이미지 합산기; 및 상기 복수개의 동영상 이미지 중 어느 하나의 동영상 이미지 의 저주파 동영상 이미지와 상기 노이즈가 감쇄된 고주파 동영상 이미지를 합성하여 노이즈가 제거된 동영상 이 미지를 생성하는 역 이산 웨이브릿 변환부를 포함할 수 있다. 본 발명에 있어서, 상기 역 이산 웨이브릿 변환부는 상기 복수개의 동영상 이미지 중 중간의 동영상 이미지의 저주파 동영상 이미지와 상기 노이즈가 감쇄된 고주파 동영상 이미지를 합성하여 상기 노이즈가 제거된 동영상 이미지를 생성할 수 있다. 본 발명에 있어서, 상기 웨이브릿 변환부는 이산 웨이브릿 변환을 수행하여 복수개의 동영상 이미지 각각을 LL 이미지, HL 이미지, LH 이미지 및 HH 이미지를 포함하는 4개의 서브밴드 이미지로 분해할 수 있다. 본 발명에 있어서, 상기 저주파 동영상 이미지는 서브밴드 LL 이미지, HL 이미지 및 LH 이미지를 포함하고, 상 기 고주파 동영상 이미지는 서브밴드 HH 이미지를 포함할 수 있다. 본 발명에 있어서, 상기 저주파 동영상 이미지는 서브밴드 LL 이미지, HL 이미지 및 LH 이미지를 포함하고, 상 기 고주파 동영상 이미지는 서브밴드 HH 이미지를 포함할 수 있다. 또한, 본원의 일 실시예에 따른 노이즈 제거 장치는, 상기 영상 신호 입력 센서부로부터의 입력 신호 유무를 판 단하는 무신호 감지기; 상기 무신호 감지기가 무신호 감지 시, 상기 고주파 동영상 이미지 합산기에 의해 얻어 진 노이즈가 감쇄된 고주파 동영상 이미지에 포함된 노이즈와 실제 이미지 정보를 구분하기 위한 문턱치를 생성 하는 문턱치 생성부; 및 상기 생성된 문턱치와 상기 노이즈가 감쇄된 고주파 동영상 이미지상의 픽셀값의 크기 를 비교하여 노이즈가 감쇄된 고주파 동영상 이미지로부터 노이즈를 제거하는 문턱치 판단부를 더 포함할 수 있 다. 또한, 본원의 일 실시예에 따른 노이즈 제거 장치는, 상기 웨이브릿 변환 후 분리된 고주파 동영상 이미지 각각 을 로그 형태로 변환하는 로그함수 변환부; 상기 고주파 동영상 이미지 합산기로부터 생성된 노이즈가 감쇄된 고주파 동영상 이미지 각각을 지수 형태로 변환하는 지수함수 변환부; 및 상기 로그함수 변환부와 지수함수 변 환부의 활성여부를 제어하는 승법 노이즈 제거 명령부를 더 포함할 수 있다. 또한, 본원의 일 실시예에 따른 노이즈 제거 장치는, 상기 입력 받은 복수개의 동영상 이미지의 영상 정합을 수 행하는 이미지 얼라이너; 및 상기 이미지 얼라이너가 영상 정합을 수행할 때 참조 영상과 비교하여 영상 정렬이 크게 어긋난 맞출 영상을 제거하는 아웃라이어 감지부를 더 포함할 수 있다. 본 발명에 있어서, 상기 이미지 얼라이너는 시맨틱 분할 기반의 영상 정합, 제어점 매핑에 의한 영상 정합 또는 웨이브릿 프레임 기반의 영상 정합을 하는 것을 특징으로 할 수 있다. 한편, 본원의 일 실시예에 따른 노이즈 제거 방법은, (a) 측정된 영상신호를 입력 받는 단계; (b) 상기 입력 받 은 영상 신호에 대해 이산 웨이브릿 변환을 수행하여, 저주파수 성분으로 구성된 저주파 이미지와 고주파수 성 분으로 구성된 고주파 이미지로 분리하는 단계; (c) 상기 고주파 이미지에 포함된 노이즈 성분과 유사한 노이즈 를 포함하는 복수개의 노이즈 이미지를 생성하는 단계; (d) 상기 고주파 이미지와 상기 노이즈 이미지에 기초하 여 노이즈가 감쇄된 고주파 이미지를 생성하는 단계; 및 (e)상기 저주파 이미지와 상기 노이즈가 감쇄된 고주파 이미지를 합성하여 역 이산 웨이브릿 변환을 수행함으로써 노이즈가 제거된 영상을 생성하는 단계를 포함할 수 있다. 본 발명에 있어서, 상기 (b) 단계는, 이산 웨이브릿 변환을 수행하여 원본영상을 LL 이미지, HL 이미지, LH 이 미지 및 HH 이미지를 포함하는 4개의 서브밴드 이미지로 분해할 수 있다. 본 발명에 있어서, 상기 저주파 이미지는 서브밴드 LL 이미지, HL 이미지 및 LH 이미지를 포함하고, 상기 고주 파 동영상 이미지는 서브밴드 HH 이미지를 포함할 수 있다. 본 발명에 있어서. 상기 (b) 단계는, 이산 웨이브릿 변환을 2레벨 이상 수행하고, 상기 고주파 이미지는 서브밴 드 HHHH 이미지를 포함할 수 있다. 또한, 본원의 일 실시예에 따른 노이즈 제거 방법은, (f) 상기 (a) 단계에서 입력 신호 유무를 판단하는 단계; (g) 입력 신호가 없다고 판단되는 경우, 상기 고주파 이미지 합산기에 의해 얻어진 노이즈가 감쇄된 고주파 이 미지에 포함된 노이즈와 실제 이미지 정보를 구분하기 위한 문턱치를 생성하는 단계; 및 (h) 상기 생성된 문턱 치와 상기 노이즈가 감쇄된 고주파 이미지상의 픽셀값의 크기를 비교하여 노이즈가 감쇄된 고주파 이미지로부터 노이즈를 제거하는 단계를 더 포함할 수 있다. 또한, 본원의 일 실시예에 따른 노이즈 제거 방법은, (i) 상기 입력 받은 영상신호에 승법 노이즈 특성을 갖는 노이즈가 존재하는 경우, 웨이브릿 변환 후 분리된 고주파 이미지를 로그 형태로 변환하는 단계; 및 (j) 상기 고주파 이미지 합산기로부터 생성된 노이즈가 감쇄된 고주파 이미지를 지수 형태로 변환하는 단계를 더 포함할 수 있다. 또한, 본원의 일 실시예에 따른 노이즈 제거 방법은, (a) 측정된 복수개의 동영상 이미지로 구성된 동영상을 입 력 받는 단계; (b) 상기 입력 받은 동영상에 포함된 복수개의 동영상 이미지에 대해 이산 웨이브릿 변환을 수행 하여, 저주파수 성분으로 구성된 저주파 동영상 이미지와 고주파수 성분으로 구성된 고주파 동영상 이미지로 분 리하는 단계; (c) 상기 고주파 동영상 이미지에 기초하여 노이즈가 감쇄된 고주파 동영상 이미지를 생성하는 단 계; 및 (d) 상기 복수개의 동영상 이미지 중 어느 하나의 동영상 이미지의 저주파 동영상 이미지와 상기 노이즈 가 감쇄된 고주파 동영상 이미지를 합성하여 역 이산 웨이브릿 변환을 수행함으로써 노이즈가 제거된 동영상 이 미지를 생성하는 단계를 포함할 수 있다. 본 발명에 있어서, 상기 (d) 단계는, 상기 복수개의 동영상 이미지 중 중간의 동영상 이미지의 저주파 동영상 이미지와 상기 노이즈가 감쇄된 고주파 동영상 이미지를 합성하여 상기 노이즈가 제거된 동영상 이미지를 생성 할 수 있다. 본 발명에 있어서, 상기 (b) 단계는, 이산 웨이브릿 변환을 수행하여 복수개의 동영상 이미지 각각을 LL 이미지, HL 이미지, LH 이미지 및 HH 이미지를 포함하는 4개의 서브밴드 이미지로 분해할 수 있다. 본 발명에 있어서, 상기 저주파 동영상 이미지는 서브밴드 LL 이미지, HL 이미지 및 LH 이미지를 포함하고, 상 기 고주파 동영상 이미지는 서브밴드 HH 이미지를 포함할 수 있다. 본 발명에 있어서, 상기 (b) 단계는, 이산 웨이브릿 변환을 2레벨 이상 수행하고, 상기 고주파 동영상 이미지는 서브밴드 HHHH 이미지를 포함할 수 있다. 또한, 본원의 일 실시예에 따른 노이즈 제거 방법은, (e) 상기 (a) 단계에서 입력 신호 유무를 판단하는 단계; (f) 입력 신호가 없다고 판단되는 경우, 상기 고주파 동영상 이미지 합산기에 의해 얻어진 노이즈가 감쇄된 고 주파 동영상 이미지에 포함된 노이즈와 실제 이미지 정보를 구분하기 위한 문턱치를 생성하는 단계; 및 (g) 상 기 생성된 문턱치와 상기 노이즈가 감쇄된 고주파 동영상 이미지상의 픽셀값의 크기를 비교하여 노이즈가 감쇄 된 고주파 동영상 이미지로부터 노이즈를 제거하는 단계를 더 포함할 수 있다. 또한, 본원의 일 실시예에 따른 노이즈 제거 방법은, (h) 상기 입력 받은 복수개의 동영상 이미지에 승법 노이 즈 특성을 갖는 노이즈가 존재하는 경우, 웨이브릿 변환 후 분리된 고주파 동영상 이미지 각각을 로그 형태로 변환하는 단계; 및 (i) 상기 고주파 동영상 이미지 합산기로부터 생성된 노이즈가 감쇄된 고주파 동영상 이미지 를 지수 형태로 변환하는 단계를 더 포함할 수 있다. 또한, 본원의 일 실시예에 따른 노이즈 제거 방법은, (j) 상기 입력 받은 복수개의 동영상 이미지의 영상 정합 을 수행하는 단계; 및 (k) 상기 영상 정합을 수행할 때 참조 영상과 비교하여 영상 정렬이 크게 어긋난 맞출 영 상을 제거하는 단계를 더 포함할 수 있다. 본 발명에 있어서, 상기 이미지 얼라이너는 시맨틱 분할 기반의 영상 정합, 제어점 매핑에 의한 영상 정합 또는 웨이브릿 프레임 기반의 영상 정합을 하는 것을 특징으로 할 수 있다. 상기한 다른 기술적 과제를 달성하기 위한 기술적 수단으로서, 본원의 일 실시예에 따른 원격 의료 진단 시스템 은, 상기한 실시예 중 어느 하나의 노이즈 제거 장치; 상기 노이즈 제거장치와 통신 인터페이스를 통해 연결되 어 있으며, 노이즈가 제거된 영상을 이용하여 사용자에게 의료 전문가와의 상담 서비스를 제공하는 사용자 단말 기; 상기 사용자 단말기와 의료 전문가 단말기의 사이에서 데이터를 송수신하는 원격 진단 서버; 및 상기 원격 진단 서버로부터 이미지 데이터를 수신하고 사용자에게 의료 전문가의 상담 서비스를 제공하는 의료 전문가 단 말기를 포함할 수 있다. 본 발명에 있어서, 상기 사용자 단말기는 상기 노이즈 제거 장치로부터 노이즈가 제거된 영상 또는 동영상 데이 터를 저장하는 기록부; 영상신호를 측정하는 제품 ID를 인증하는 제 1 인증부; 상기 영상신호 측정 제품의 사용 상황을 모니터링하는 카메라; 상기 영상신호 측정 제품에 의해 축적된 영상 또는 동영상 데이터베이스를 사용하 여 딥러닝 학습된 인공지능신경망; 소프트웨어 형태로 상주하여 상기 제품의 사용방법을 안내하는 안내부; 상기 노이즈 제거 장치에 의해 얻어진 영상 또는 동영상 데이터를 상기 딥러닝 학습 완료된 인공지능신경망에 의해 자동 분석하여 진단결과를 출력하는 진단부; 통신 네트워크를 통해 상기 노이즈가 제거된 영상 또는 동영상 데 이터와 제품 ID를 원격 진단 서버로 송신하고, 원격 상담 서비스를 위한 통신 채널을 제공하는 인터넷 연결부; 및 사용자와 의료 전문가와의 상담 서비스를 제공하는 제 1 상담 서비스부를 포함하고, 상기 의료 전문가 단말 기는 상기 통신 네트워크를 통해 상기 노이즈가 제거된 영상 또는 동영상 데이터를 수신하는 수신부; 및 사용자 와 의료 전문가와의 상담서비스를 제공하는 제 2 상담 서비스부를 포함하는 것을 특징으로 할 수 있다. 상술한 과제 해결 수단은 단지 예시적인 것으로서, 본원을 제한하려는 의도로 해석되지 않아야 한다. 상술한 예 시적인 실시예 외에도, 도면 및 발명의 상세한 설명에 추가적인 실시예가 존재할 수 있다."}
{"patent_id": "10-2019-0053287", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본원의 과제 해결 수단에 의하면, 초음파 영상을 포함하는 각종 의료 영상, 바이오 디스크 상의 생물학 적 화학 반응 결과에 대한 이미지 데이터, 의료장비의 영상 및 원격 의료 영상 속에 포함된 노이즈(noise)를 효 과적으로 제거하는 이산 웨이브릿 변환(Discrete Wavelet Transform)를 이용한 노이즈 제거 장치 및 이를 이용 한 원격 의료 진단 시스템을 제공할 수 있다. 다만, 본원에서 얻을 수 있는 효과는 상기된 바와 같은 효과들로 한정되지 않으며, 또 다른 효과들이 존재할 수 있다."}
{"patent_id": "10-2019-0053287", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본원이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본원의 실시예를 상세히 설명한다. 그러나 본원은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본원을 명확하게 설명하기 위해서 설명과 관계없는 부분 은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다.본원 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\" 또는 \"간접적으로 연결\"되어 있는 경우 도 포함한다. 본원 명세서 전체에서, 어떤 부재가 다른 부재 \"상에\", \"상부에\", \"상단에\", \"하에\", \"하부에\", \"하단에\" 위치 하고 있다고 할 때, 이는 어떤 부재가 다른 부재에 접해 있는 경우뿐 아니라 두 부재 사이에 또 다른 부재가 존 재하는 경우도 포함한다. 본원 명세서 전체에서, 어떤 부분이 어떤 구성 요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성 요소를 제외하는 것이 아니라 다른 구성 요소를 더 포함할 수 있는 것을 의미한다. 이하 첨부된 도면을 사용하여 본 발명의 바람직한 실시예에 대하여 상세하게 설명한다. 도 1 은 이산 웨이브릿 변환(Discrete Wavelet transform)을 이용한 영상신호의 노이즈 제거 장치의 일 실시예로, 이미지 센서, 초음파 어레이 센서, 또는 메디컬 센서 등으로부터 생성된 영상 신호를 입력 받는 영상 신호 입력 센서부; 상기 영상 신호 입력 센서부로부터 입력받은 2차원 원본영상에 대해 이산 웨이브릿 변환을 수행하여, 4개의 서브밴드(sub band) 이미지, 즉 서브밴드 LL 이미지, 서브밴드 LH이미지, 서브밴드 HL 이미지, 서브밴드 HH 이미지로 분해(Decomposition)하는 웨이브릿 변환부; 상기 서브밴드 HH 이미지에 포함 된 노이즈 성분과 유사한 노이즈를 포함하는 복수개의 노이즈 이미지를 생성하는 노이즈 발생기; 상기 서브 밴드 HH 이미지를 상기 노이즈 발생기에 의해 생성된 복수개의 노이즈 이미지와 합산 평균하여 상기 서브밴 드 HH 이미지상의 노이즈를 상쇄하여 노이즈가 감쇄된 서브밴드 HH 이미지를 얻는 고주파 이미지 합산기(34a); 및 상기 서브밴드 LL 이미지, 서브밴드 LH이미지, 서브밴드 HL 이미지와 상기 노이즈가 감쇄된 서브밴드 HH 이 미지를 합성(synthesis)하는 역 이산 웨이브릿 변환부(IDWT:Inverse Wavelet Transform, 39)를 포함할 수 있다. 서브밴드 HH 이미지에 포함된 노이즈 성분과 유사한 노이즈를 포함하는 노이즈 이미지라고 함은, 예를 들 어, 고주파 이미지에 포함된 노이즈 신호(성분)의 크기, 주파수, 픽셀의 양, 픽셀의 RGB 성분 값 중 적어도 어 느 하나에 대하여, 미리 설정된 오차 범위 이내의 오차를 가지는 노이즈 성분을 포함하는 이미지를 의미할 수 있다. 영상 신호 입력 센서부는 측정된 영상신호를 입력 받을 수 있다. 웨이브릿 변환부는 입력 받은 영상 신 호에 대해 이산 웨이브릿 변환을 수행하여, 저주파수 성분으로 구성된 저주파 이미지와 고주파수 성분으로 구성 된 고주파 이미지로 분리할 수 있다. 또한, 노이즈 발생기는 고주파 이미지에 포함된 노이즈 성분과 유사한 노이즈를 포함하는 복수개의 노이즈 이미지를 생성할 수 있다. 또한, 고주파 이미지 합산기(34a)는 상기 고주파 이미지와 상기 노이즈 이미지에 기초하여 노이즈가 감쇄된 고주파 이미지를 생성할 수 있다. 또한, 역 이산 웨 이브릿 변환부는 상기 저주파 이미지와 상기 노이즈가 감쇄된 고주파 이미지를 합성하여 노이즈가 제거된 영상을 생성할 수 있다. 본 발명에서, 상기 웨이브릿 변환부는 이산 웨이브릿 변환을 수행하여 원본영상을 LL 이미지, HL 이미지, LH 이미지 및 HH 이미지를 포함하는 4개의 서브밴드 이미지로 분해할 수 있다. 상기 웨이브릿 변환부가 수 행하는 상기 이산 웨이브릿 변환은 2차원 이미지의 수평 내지 수직 방향에 대해 저역 통과 필터(low pass filter)와 고역 통과 필터(high pass filter)를 적용시키고 2로 다운 샘플링(down sampling)을 수행하여 4개의 서브 밴드(sub band) 이미지, 즉 서브밴드 LL 이미지, 서브밴드 LH 이미지, 서브밴드 HL 이미지, 서브밴드 HH 이미지로 분해(Decomposition)하는 것을 특징으로 한다. 상기 서브밴드 LL 이미지는 원본 이미지에 수평과 수직방향으로 저역 통과 필터를 적용하고, 수평, 수직 각 방 향에 대해 1/2로 서브 샘플링(sub sampling)된 것을 의미할 수 있다. 상기 서브밴드 HL 이미지는 원본 이미지에 수평방향으로 저역 통과 필터를 적용하고 수직방향으로 고역 통과 필터를 적용하고, 수평, 수직 각 방향에 대해 1/2로 서브 샘플링 된 것을 의미할 수 있다. 상기 서브밴드 LH 이미지는 원본 이미지에 수평 방향으로 고역 통 과 필터를 적용하고 수직방향으로 저역 통과 필터를 적용하고, 수평, 수직 각 방향에 대해 1/2로 서브 샘플링 된 것을 의미할 수 있다. 상기 서브밴드 HH 이미지는 원본 이미지에 수평과 수직 두 방향 모두에 고역 통과 필 터를 적용하고, 수평, 수직 각 방향에 대해 1/2로 서브 샘플링 된 것을 의미할 수 있다. 본 발명에서, 상기 저주파 이미지는 서브밴드 LL 이미지, 서브밴드 HL 이미지 및 서브밴드 LH 이미지를 포함하 고, 상기 고주파 이미지는 서브밴드 HH 이미지를 포함하도록 구성된 것이 바람직하다. 웨이브릿 변환부가 이산 웨이블릿 패킷 변환(Wavelet packet transform)을 한 레벨(one level)수행하면, 4 개의 서브밴드 LL 이미지, LH 이미지, HL 이미지, HH 이미지로 분해되고, 이 4개의 서브밴드 이미지를 가지고한번 더 이산 웨이브릿 패킷 변환을 수행하면, 16개의 서브밴드 LLLL, LLLH, LLHL, LLHH, LHLL, LHLH, LHHL, LHHH, HLLL, HLLH, HLHL, HLHH, HHLL, HHLH, HHHL, HHHH 이미지가 얻어진다. 본 발명의 또 다른 측면에서, 상기 웨이브릿 변환부는 이산 웨이브릿 변환을 2레벨 이상 수행하고, 상기 고 주파 이미지는 서브밴드 HHHH 이미지를 포함할 수 있다. 상기 고주파 이미지는 이산 웨이블릿 패킷 변환을 2 레 벨 수행하여 얻은 서브밴드 HHHH 이미지 내지 이산 웨이블릿 패킷 변환을 2 레벨(level) 이상 수행하여 얻은 고 주파 대역내의 서브밴드 이미지를 사용하는 것이 바람직하다. 노이즈 발생기는 상기 고주파 이미지에 포함된 노이즈 성분과 유사한 노이즈를 포함하는 복수개의 노이즈 이미지를 생성한다. 상기 노이즈 발생기는 기 설정된 평균값과 분산을 따르는 난수를 발생시켜 상기 복수개 의 노이즈 이미지를 생성한다. 고주파 이미지 합산기(34a)는 상기 고주파 이미지와 상기 노이즈 이미지에 기초 하여 노이즈가 감쇄된 고주파 이미지를 생성한다. 본 발명에서, 상기 고주파 이미지 합산기(34a)는 고주파 이미지와 상기 복수개의 노이즈 이미지를 합산 평균하 여 노이즈가 감쇄된 고주파 이미지를 얻을 수 있다. 상기 고주파 이미지 합산기(34a)가 수행하는 합산 평균이란 복수개의 2차원 이미지에 대해 덧셈 연산을 수행하여 단일 2차원 이미지를 얻은 후, 상기 단일 2차원 이미지의 각 픽셀값들을 덧셈 연산 시 사용된 총 이미지 개수로 나누어 형성된 단일 2차원 이미지를 얻기 위한 연산을 의 미할 수 있다. 도 1에서 노이즈 발생기로부터 발생되는 노이즈의 평균값과 분산은, 상기 영상신호 입력 센서부로부터 의 입력 신호가 없을 시, 고주파 이미지 합산기(34a)가 서브밴드 HH 이미지와 노이즈 발생기에 의해 생성된 복수개의 노이즈 이미지를 합산 평균하여 얻은 이미지의 평균 파워(average power)가 최소화되도록 하거나, 서 브밴드 LL 이미지의 DC값(평균값)과 같도록 결정하는 것이 바람직하다. 이상적으로 노이즈의 평균값과 분산이 설정된 경우는 무신호 입력 시이므로 상기 고주파 이미지 합산기(34a)에 의해 얻어진 이미지의 평균 파워가 제로(zero) 이거나 서브밴드 LL 이미지의 DC값(평균값) 과 같다. 역 이산 웨이브릿 변환부는 상기 저주파 이미지와 상기 노이즈가 감쇄된 고주파 이미지를 합성하여 노이즈 가 제거된 영상을 생성할 수 있다. 본 발명에서, 상기 저주파 이미지는 상기 서브밴드 LL 이미지, 서브밴드 LH 이미지, 서브밴드 HL 이미지를 의미할 수 있고, 상기 역 이산 웨이브릿 변환부는 상기 서브밴드 LL 이미지, 서브밴드 LH이미지, 서브밴드 HL 이미지와 상기 노이즈가 감쇄된 서브밴드 HH 이미지를 합성하는 것일 수 있다. 도 2 는 이산 웨이브릿 변환을 이용한 영상신호의 노이즈 제거 장치의 또 다른 실시예로, 이미지 센서, 초음파 어레이 센서, 또는 메디컬 이미지 센서 등으로부터 생성된 동영상 신호를 받는 영상신호 입력 센서부 ; 상기 영상신호 입력 센서부로부터 입력받은 복수개의 연속된 N개의 프레임(frame)(N개의 동영상 이미 지)으로 구성된 2차원 원본 동영상 이미지에 대해 이산 웨이브릿 변환을 수행하여, 4개의 서브 밴드 이미지, 즉 서브밴드 LL 이미지, 서브밴드 LH이미지, 서브밴드 HL 이미지, 서브밴드 HH 이미지로 분해하는 웨이브릿 변환부 ; 상기 N개의 프레임으로 구성된 2차원 원본 동영상 이미지로부터 얻어진 서브밴드 HH 이미지들을 합산 평 균하여 상기 서브밴드 HH 이미지상의 노이즈를 상쇄하여 노이즈가 감쇄된 서브밴드 HH 이미지를 얻는 고주파 동 영상 이미지 합산기(34b); 및 상기 서브밴드 LL 이미지, 서브밴드 LH이미지, 서브밴드 HL 이미지와 상기 노이즈 가 감쇄된 서브밴드 HH 이미지를 합성하는 역 이산 웨이브릿 변환부를 포함하는 것을 특징으로 한다. 상기 프레임(a frame)이란, 한 장의 동영상 이미지를 의미할 수 있다. 상기 원본 동영상 이미지는 5초 이하의 연속된 프레임이 100개 이하로 구성되는 것이 바람직하다. 상기 영상신호 입력 센서부는 측정된 복수개의 동영상 이미지로 구성된 동영상을 수신할 수 있다. 상기 웨 이브릿 변환부는 상기 입력 받은 동영상에 포함된 복수개의 동영상 이미지에 대해 이산 웨이브릿 변환을 수 행하여, 저주파수 성분으로 구성된 저주파 동영상 이미지와 고주파수 성분으로 구성된 고주파 동영상 이미지로 분리할 수 있다. 본 발명에서, 상기 웨이브릿 변환부는 이산 웨이브릿 변환을 수행하여 복수개의 동영상 이미지 각각을 LL 이미지, HL 이미지, LH 이미지 및 HH 이미지를 포함하는 4개의 서브밴드 이미지로 분해할 수 있다. 본 발명에서, 상기 저주파 동영상 이미지는 서브밴드 LL 이미지, HL 이미지 및 LH 이미지를 포함하고, 상기 고 주파 동영상 이미지는 서브밴드 HH 이미지를 포함하도록 구성된 것이 바람직하다. 본 발명의 또 다른 측면에서, 상기 웨이브릿 변환부는 이산 웨이브릿 변환을 2레벨 이상 수행하고, 상기 고 주파 동영상 이미지는 서브밴드 HHHH 이미지를 포함할 수 있다. 상기 웨이브릿 변환부는 복수개의 연속된 N개의 프레임(frame) 중 중간 프레임에 해당하는 N/2번째 프레임 에 대해 이산 웨이브릿 변환을 수행하여, 4개의 서브 밴드 이미지, 즉 서브밴드 LL 이미지, 서브밴드 LH이미지, 서브밴드 HL 이미지, HH 이미지로 분해하는 제 1 웨이브릿 변환부(32b) 와 그 외의 프레임들에 대해 이산 웨이 브릿 변환을 수행하는 제 2의 웨이브릿 변환부(32a, 32c)를 포함할 수 있다. 상기 고주파 동영상 이미지 합산기(34b)는 상기 고주파 동영상 이미지에 기초하여 노이즈가 감쇄된 고주파 동영 상 이미지를 생성할 수 있다. 상기 고주파 동영상 이미지 합산기(34b)는 상기 N개의 프레임으로 구성된 2차원 원본 동영상 이미지로부터 얻어진 서브밴드 HH 이미지들을 합산 평균하여 상기 서브밴드 HH 이미지상의 노이즈 를 상쇄하여 노이즈가 감쇄된 서브밴드 HH 이미지를 얻을 수 있다. 상기 역 이산 웨이브릿 변환부는 상기 복수개의 동영상 이미지 중 어느 하나의 동영상 이미지의 저주파 동 영상 이미지와 상기 노이즈가 감쇄된 고주파 동영상 이미지를 합성하여 노이즈가 제거된 동영상 이미지를 생성 할 수 있다. 바람직하게는, 상기 역 이산 웨이브릿 변환부는 상기 복수개의 동영상 이미지 중 중간의 동영상 이미지의 저주파 동영상 이미지와 상기 노이즈가 감쇄된 고주파 동영상 이미지를 합성하여 상기 노이즈가 제거된 동영상 이미지를 생성한다. 또한, 도 1 내지 도2의 상기 영상 신호 입력 센서부는 특정 주파수 밴드 영역의 이미지만 받기 위한 필터 가 부착된 이미지 센서, 형광 이미지센서, 적외선 이미지 센서, 초음파 이미지를 생성하기 위한 초음파 센서 어 레이 및 초음파 프로브 센서(probe sensor), 자기 공명에 의해 원자핵이 고유하게 방출하는 고주파를 컴퓨터로 영상화하여 MRI(magnetic resonance imaging, 자기공명 영상) 이미지를 얻기 위한 안테나, X-RAY 영상 및 CT (Computer Tomography) 영상을 얻기 위한 X-Ray 디텍터(detector) 중 어느 하나의 센서로 구성될 수 있다. 상 기 영상신호 입력 센서부는 환자의 몸으로부터 측정된 의료 영상 신호를 입력 받거나, 피사체로부터 측정된 이 미지데이터를 입력 받는 센서로 구성되는 것이 바람직하다. 또한, 도 1 내지 도2는 영상신호 입력 센서부로부터의 입력 신호 유무를 판단하기 위한 무(無)신호 감지기 ; 서브밴드 HH 이미지에 포함된 노이즈와 실제 이미지 정보를 구분하기 위한 문턱치(threshold value)를 생 성하는 문턱치 생성부; 및 상기 생성된 문턱치보다 작은 크기의 픽셀값을 갖는 서브밴드 HH 이미지상의 픽 셀(pixel)은 노이즈 픽셀로 간주하여, 해당 픽셀을 주변 픽셀을 이용하여 보간(interpolation)하고, 반면에 상 기 생성된 문턱치보다 큰 크기의 픽셀값을 갖는 서브밴드 HH 이미지상의 픽셀은 그대로 살려두어, 노이즈 프리 (noise free) 서브밴드 HH 이미지를 생성하는 HH Thresholder를 더 포함하는 예시를 보인다. 이하에서 HH Thresholder는 문턱치 판단부와 같다. 또한, HH Thresholder는 HH 쓰레쇼울더와 같다. 상기 무신호 감지기는 상기 영상 신호 입력 센서부로부터의 입력 신호 유무를 판단할 수 있다. 상기 HH Thresholder가 수행하는 보간은 nearest neighbor 보간법, bilinear 보간법, bicubic 보간법 중 어느 하나의 보간법에 의해 노이즈 픽셀을 채우는 것이 바람직하다. 상기 문턱치 생성부는 상기 무신호 감지기가 무신호 감지 시, 상기 고주파 이미지 합산기(34a) 또는 고 주파 동영상 이미지 합산기(34b)에 의해 얻어진 노이즈가 감쇄된 고주파 이미지 또는 노이즈가 감쇄된 고주파 동영상 이미지에 포함된 노이즈와 실제 이미지 정보를 구분하기 위한 문턱치를 생성할 수 있다. 상기 문턱치 생 성부는 상기 영상 신호 입력 센서부로부터의 입력 신호가 없을 시, 고주파 이미지 합산기(34a) 내지 고 주파 동영상 이미지 합산기(34b)에 의해 합산 평균하여 얻은 이미지의 평균 파워(power)가 최소화되거나, 서브 밴드 LL 이미지의 DC값(평균값)에 가깝도록 문턱치를 생성하는 것을 특징으로 한다. 상기 문턱치 판단부는 상기 생성된 문턱치와 상기 노이즈가 감쇄된 고주파 이미지 또는 고주파 동영상 이미 지상의 픽셀값의 크기를 비교하여 노이즈가 감쇄된 고주파 이미지 또는 고주파 동영상 이미지로부터 노이즈를 제거할 수 있다. 또한, 도 1 내지 도2는 Speckle(스펙클) 노이즈 제거를 위해서, 서브밴드 HH 이미지를 로그 형태로 변환하는 Log-transform부와 고주파 이미지 합산기(34a) 내지 고주파 동영상 이미지 합산기(34b)에 의해 얻은 노이즈 가 감쇄된 서브밴드 HH 이미지를 지수 형태로 변환하는 Exponential-transform부를 더 포함하는 예시를 보 인다. 이하 Log-transform 부는 로그함수 변환부, Exponential-transform 부는 지수함수 변환부와 같 다. 또한, Log-transform 부는 로그 변환부, Exponential-transform 부는 지수 변환부와 같다.상기 로그함수 변환부는 상기 웨이브릿 변환 후 분리된 고주파 이미지 또는 고주파 동영상 이미지 각각을 로그 형태로 변환할 수 있다. 상기 로그 변환부는 스펙클 노이즈 제거를 위해 서브밴드 HH 이미지들을 로그 변환할 수 있다. 상기 지수함수 변환부는 상기 고주파 이미지 합산기(34a)로부터 생성된 노이즈가 감쇄된 고주파 이미지 또는 상기 고주파 동영상 이미지 합산기(34b)로부터 생성된 노이즈가 감쇄된 고주파 동영상 이미 지를 지수 형태로 변환할 수 있다. 상기 지수 변환부는 로그 변환된 서브밴드 HH 이미지를 다시 원래대로 역변환할 수 있다. 상기 로그함수 변환부 와 지수함수 변환부는 스펙클 노이즈 제거 여부를 결정하는 스펙클 노이즈 제거 명령부에 의해 활성화 또는 비활성화되는 것을 특징으로 한다. 스펙클 노이즈는 승법 노이즈(multiplicative noise) 특성을 갖는 노이즈의 일반적인 유형이고, 상기 스펙클 노 이즈 제거 명령부는 승법 노이즈 제거 명령부의 한 예이다. 상기 승법 노이즈 제거 명령부는 상기 로그함수 변환부와 지수함수 변환부의 활성여부를 제어할 수 있다. 본원의 일 실시예에 따른 노이즈 제거장치는, 스펙클 노이즈 제거 여부를 결정하는 스펙클 노이즈 제거 명령부 , 로그 변환 선택 스위치(46a) 및 지수 변환 선택 스위치(46b)를 추가 포함할 수 있다. 스펙클 노이즈 제거 명령부에 의해 상기 로그 변환 선택 스위치(46a) 및 상기 지수 변환 선택 스위치(46b) 가 활성화 또는 비활성화 될 수 있다. 상기 스펙클 노이즈 제거 명령부에 의해 스펙클 노이즈 같은 승법 노 이즈(multiplicative noise) 특성을 갖는 노이즈를 제거하기를 원하는 경우, Log-transform 선택 스위치(46a) 와 Exponential-transform 선택 스위치(46b)가 개방되어 상기 Log-transform부 와 Exponential 변환부(3 6)가 활성화된다. 이 경우 상기 Speckle 노이즈는, 승법 노이즈 (multiplicative noise)특성을 가지고 있기 때 문에 상기 Log-transform부에 의해 로그형태로 변환되면 가법 노이즈(additive noise) 특성으로 바뀌게 되 어, 상기 고주파 이미지 합산기(34a) 또는 고주파 동영상 이미지 합산기(34b)에 의한 합산평균 과정에서 노이즈 성분에 대한 Temperal averaging 효과에 의해 speckle 노이즈가 줄어드는 반면, 실제 영상정보는 그대로 유지될 수 있다. 상기 스펙클 노이즈 제거 명령부에 의해 스펙클 노이즈가 아닌, 가우시안 노이즈(Gaussian noise) 같은 가 법 노이즈(additive noise) 특성을 갖는 노이즈를 제거하기를 원하는 경우, Log-transform 선택 스위치(46a) 와 Exponential-Transform 선택 스위치(46b)를 연결하여 비활성화함으로써, 상기 Log-transform부 과 Exponential-transform부를 거치지 않고 스킵(skip)하게 된다. 이 경우 가법 노이즈(additive noise) 특성 을 갖는 노이즈는 상기 고주파 이미지 합산기(34a) 또는 고주파 동영상 이미지 합산기(34b)에 의한 합산평균 과 정에서 노이즈 성분에 대한 Temperal averaging 효과에 의해 노이즈가 줄어드는 반면, 실제 영상정보는 그대로 유지될 수 있다. 또한, 도 1 내지 도 2는 심장의 맥박 신호에 동기화된(synchronized) 의료 영상 신호나 복수개의 연속된 프레임 으로 구성된 동영상 이미지를 영상 신호 입력 센서부로 입력 받을 수 있도록 심장 맥박센서(ECG센서)를 더 포함하는 예시를 보인다. 본원의 일 실시예에 따른 노이즈 제거장치는, 심장 맥박센서를 추가 포함할 수 있다. 상기 영상 신호 입력센서부로부터 입력된 영상 신호는 상기 심장 맥박 센서에서 측정되는 심장의 맥박 신호에 동기화될 수 있다. 즉, 영상 신호 입력 센서부는 심장의 맥박 신호에 동기화된 영상 신호 또는 동영 상 이미지를 입력받을 수 있다. 이 때, 심장의 움직임을 알기 위해 심장 맥박 센서에 의해 ECG (Electrocardiogram)신호를 측정하면 매 박 동마다 P wave, QRS complex, T wave 신호가 규칙적인 모양의 파형이 나타난다. 상기 심장의 맥박 신호에 동기 화된(synchronized) 의료 영상 신호 입력은 상기 ECG (Electrocardiogram) 신호의 QRS complex 신호의 피크값 (peak value)을 기준으로 동기화(synchronization)되는 것이 바람직하다. 도 2에서 상기 복수개의 연속된 프레임으로 구성된 원본 동영상 이미지는 동일한 이미지인 것이 바람직하다. 그 러나 실제로는 상기 복수개의 연속된 프레임으로 구성된 원본 동영상 이미지는 노이즈 성분 때문에 프레임간에 동일하지 않다. 더욱이 의사가 초음파 기기를 사용할 때 환자의 환부의 위치에서 움직이지 않았음에도 불구하고, 의사자신의 손떨림과 환자의 몸의 작은 움직임, 환자의 심장 박동 때문에 프레임간 이미지는 완벽히 동일하지 않다. 따라서 이 경우 상기 복수개의 연속된 프레임으로 구성된 원본 동영상 이미지로부터 얻은 고주 파 이미지들을 단순히 합산 평균만 취해서 노이즈가 감쇄된 고주파 이미지를 얻기는 것은 매우 어렵다. 따라서, 고주파 이미지의 합산 평균을 통해 상기 고주파 동영상 이미지상의 노이즈를 상쇄하는 Temporal averaging 효과를 극대화 하려면, 상기 원본 동영상 이미지의 프레임간에는 노이즈 성분을 제외하고는 동일해야 한다. 도2는 이러한 문제를 해결하기 위해, 영상 신호 입력 센서부로부터 입력 받은 복수개의 연속된 N개의 프레 임으로 구성된 2차원 원본 동영상 이미지간에 영상 정합(image registration, image matching) 내지 영상 정렬 (image alignment)을 하는 이미지 얼라이너(image aligner) 를 더 포함하는 예시를 보인다. 상기 이미지 얼라이너는 상기 입력 받은 복수개의 동영상 이미지의 영상 정합을 수행한다. 상기 이미지 얼 라이너는 시맨틱 분할 기반의 영상 정합, 제어점 매핑에 의한 영상 정합 또는 웨이브릿 프레임 기반의 영상 정합을 하는 것이 바람직하다. 본 발명에서, 이미지간의 영상 정렬이 어긋나는 경우 이를 보정하기 위해 기준이 되는 고정된 영상을 참조영상 (reference image)이라고 하고, 맞추어질 영상을 맞출 영상이라고 칭한다. 상기 영상 정합은 환부의 영상을 시간에 따라 탄성 정합(비강체변환, non_Rigid Transformation) 또는 변위 (translation), 회전, 확대·축소, 어파인 변환(affine transformation) 등을 포함한 선형 변환(linear transformation, Rigid Transformation)으로 분류할 수 있다. 다른 측면으로 상기 영상 정합은, 세기 기반의 영상 정합(intensity-based image registration) 또는 특징 기 반의 영상 정합(Feature-based image registration)이 있다. 상기 세기 기반의 영상 정합은 명암세기 같은 영 상의 세기(intensity) 패턴을 그림 통째로 비교하여 정합하는 방식이다. 상기 특징 기반의 영상 정합은 특징점 들과 같이 선택된 픽셀들만을 이용해서 정합을 수행하며, 둘 이상의 영상 속의 점, 선, 테두리, 엣지(edge) 성 분 등을 찾아 서로 맞추는 방식이다. 이에는 두 영상 속에서 몇 개의 특징점의 대응관계를 파악하여 두 영상간 의 기하학적 변환 관계를 결정한 후, 그로부터 영상 속의 다른 점들의 대응관계를 계산하여 정합하는 제어점 매 핑(Control Point mapping)이 있다. 본 발명에서, 상기 특징 기반의 영상 정합(Feature-based image registration)은 코너점(Corner point)를 이용 하는 것이 바람직하다. 상기 코너점은 물체의 형태나 크기, 위치가 변해도 쉽게 식별이 가능하고, 카메라의 조 명이 변해도 영상에서 해당 지점을 쉽게 찾아낼 수 있는 픽셀들로 선정하되, 미리 설정된 상하좌우 이동이 가능 한 작은 윈도우를 참조영상 위에서 조금씩 스캔(scan)하면서 이동(shift)시켰을 때, 모든 방향(수직, 수평, 대 각선 방향)으로 큰 영상 변화를 일으키는 픽셀로 선정하는 것이 바람직하다. 코너점을 발견하는 알고리즘으로는 대표적으로 해리스 코너 검출(Harris Corner Detection), SIFTScale-Invariant Feature Transform, SURF(Speeded-Up Robust Features) 및 FAST (Features from Accelerated Segment Test) 코너 검출 방법이 있 다. 또 다른 측면으로 상기 영상 정합은, 공간 영역(Spatial domain) 방식 또는 주파수 영역(frequency domain) 방 식이 있다. 상기 공간 영역 방식은 이미지의 픽셀 세기 패턴(intensity pattern)이나 특징(feature)을 기반으로, 시간적 공간(Temperal space)상에서 참조영상과 맞출 영상간의 상호상관계수(cross correlation coefficient)가 최대값을 갖는 부분을 이용하여 두 영상 간의 기하 변환에 필요한 매개변수를 찾고, 두 이미지 사이의 상대적인 이동 벡터로 선정하는 것이다. 상기 주파수 영역 방식은 먼저 참조영상 과 맞출 영상을 푸리에 변환(Fourier Transform) 한 후, 푸리에 공간(Fourier space)에서 두 영상간의 위상(phase)의 상호상관계수가 최대값을 갖는 부분을 이용하여 두 영상 간의 기하 변환에 필요한 매개변수를 찾고, 두 이미지 사이의 상대적인 이동 벡터로 선정하는 것이다. 또 다른 측면으로 상기 영상 정합은, 시맨틱 분할 기반의 영상 정합(Semantic Segmentation-based image registration)이 있다. 상기 시맨틱 분할(Sematic Segmenttion)은 주어진 이미지 안에 특정 클래스(class)에 해당하는 사물이 있는 경 우, 그 사물을 포함하는 위치의 픽셀 단위를 사물 별로 분류하여, 다른 사물로부터 분할하는 인공지능 신경망을 사용한다. 상기 인공지능 신경망은 딥러닝을 허여하는 뉴럴 네트웍(neural network)으로 컨볼루션 레이어 (convolution layer), 풀링 레이어(Pooling layer), ReLu 레이어, Transpose 컨볼루션 레이어, 언 풀링레이어 (Unpooling layer), 1x1 컨볼루션 레이어, 스킵 연결(Skip connection), Global Average Pooling(GAP) 레이어, Fully Connected 레이어 중 어느 하나 이상의 레이어로 조합된 것을 특징으로 하며 상기 ReLu레이어 앞단에 Batch normalization 연산을 위한 연산부를 더 포함할 수 있다. 상기 인공지능 신경망은 CNN(Convolutional Neural Network) 내지 RNN(Recurrent Neural Network)을 사용하는 것이 바람직하다. 본 발명의 상기 시맨틱 분할 기반의 영상 정합은 의료영상에서 장기를 구별하여 서로 다른색으로 라벨링 (labeling)하여 얻어진, 시맨틱 분할된(semantic segmented) 참조영상과 시맨틱 분할된 맞출 영상을 사용할 수있다. 상기 시맨틱 분할된 참조영상과 맞출 영상을 시간적 공간상에서 두 영상간의 상호상관계수가 최대값을 갖 는 부분을 이용하여 두 영상 간의 기하 변환에 필요한 매개변수를 찾고, 두 이미지 사이의 상대적인 이동 벡터 로 선정한다. 또 다른 측면으로 상기 영상 정합은, 웨이브릿 프레임(Wavelet frame) 또는 Redundant(Over-Complete) 웨이브 릿 기반의 영상 정합이 있다. 상기 웨이브릿 프레임(Wavelet frame) 또는 Redundant(Over- Complete) 웨이브릿 기반의 영상 정합은 먼저 참조영상과 맞출 영상의 웨이브릿 프레임 변환을 수행하고, 서브밴드 HL 프레임 이미 지, 서브밴드 LH 프레임 이미지, 서브밴드 HH 프레임 이미지 중 어느 하나 이상의 서브밴드 프레임 이미지를 사 용하여 두 영상의 서브밴드 프레임 이미지간의 상호상관계수를 구하고, 상기 두 영상의 서브밴드 프레임 이미지 간의 상호상환계수가 최대값을 갖는 부분을 이용하여 두 영상 간의 기하 변환에 필요한 매개변수를 찾고, 두 이 미지 사이의 상대적인 이동 벡터로 선정한다. 상기 웨이브릿 프레임 또는 Redundant 웨이브릿 변환 시, 1/2 서 브 샘플링을 수행하지 않기 때문에 상기 서브밴드 프레임 이미지의 영상 크기가 보존되는 것을 특징으로 한다. 상기 서브밴드 HL 프레임 이미지는 이미지에 포함된 수평 에지(edge) 성분, 그리고 상기 서브밴드 LH 프레임 이 미지는 수직 에지 성분을 강조하여 나타내므로, 영상 정합에 편리하게 이용할 수 있는 에지 특징점을 풍부하게 제공한다. 다른 측면으로 상기 웨이브릿 프레임 또는 Redundant(Over- Complete) 웨이브릿 기반의 영상 정합은, 상기 서브 밴드 HL 프레임 이미지, 서브밴드 LH 프레임 이미지, 서브밴드 HH 프레임 이미지간의 중복 픽셀들을 코너점 (Corner point)으로 선정하여, 두 영상간의 영상 정합을 수행할 수 있다. 상기 중복 픽셀들은 서브밴드 HL 프레 임 이미지, 서브밴드 LH 프레임 이미지, 서브밴드 HH 프레임 이미지간의 픽셀별 곱셈을 수행하고, 곱셈 결과에 대해 정해진 코너점 판정 문턱치를 픽셀별로 적용하여, 상기 코너점 판정 문턱치보다 큰 픽셀들로 구성하거나; 상기 서브밴드 HL 프레임 이미지, 서브밴드 LH 프레임 이미지, 서브밴드 HH 프레임 이미지 각각에 대해 픽셀별 로 코너점 판정 문턱치를 적용한 후, 상기 코너점 판정 문턱치보다 큰 픽셀들로 구성된 이미지에 대해 픽셀별로 곱셈을 수행하여 얻을 수 있다. 본 발명에서, 상기 특징점 주변의 픽셀들을 모아서 얻은 작은 영상을 패치(patch)라 칭한다. 본 발명에서, 상기 상호 상관 계수는 상기 참조영상과 맞출 영상간의 패치를 비교하여 구하는 것이 바람직하다. 본 발명의 상기 이미지 얼라이너는 유사도가 높은 패치들을 통해 특징점간의 대응관계를 파악하여 두 영상 의 변환 관계를 결정하고, 그로부터 영상 속의 다른 점들의 대응관계를 계산하여 정합하는 제어점 매핑에 의한 영상 정합을 수행할 수 있다. 상기 상호 상관 계수는 SSD(Sum of Squared Difference), SAD(Sum of Absolute Difference), NCC(Normalized Cross Correlation) 중 어느 하나를 사용하는 것이 바람직하다. 또한, 도 2는 영상 정합 시 필요한 이동벡터가 비정상적으로 큰 특징점을 많이 포함하는 프레임(맞출 영상 이미 지)을 버리는 아웃라이어(image outlier) 감지부를 더 포함하고 있다. 상기 아웃라이어 감지부는 상기 이미지 얼라이너가 영상 정합을 수행할 때 참조영상과 비교하여 영상 정렬 이 크게 어긋난 맞출 영상을 제거할 수 있다. 상기 아웃라이어 감지부는 참조 영상과 맞출 영상간의 이동벡 터가 소정의 크기보다 큰 특징점들을 포함하는 맞출 영상을 고주파 동영상 이미지의 합산평균 과정에서 배제시 킬 수 있다. 상기 아웃라이어 감지부에 의해 배제된 이미지(맞출 영상)는 고주파 동영상 이미지 합산기 (34b)의 합산 평균 과정에 참여 할 수 없다. 본 발명에서 상기 아웃라이어 감지부는 참조영상과 맞출 영상간의 이동벡터가 수평, 수직 각각 100 픽셀 이 상인 맞출 영상을 버리는 것이 바람직하다. 도 3은 Parasagittal scan plane의 초음파 이미지에 대해 시맨틱 분할 기반의 영상 정합(Semantic Segmentation-based image registration)을 하기 위해, 초음파 이미지에 대해 시맨틱 분할(Sematic Segmenttion) 한 일 실시예를 보인다. 상기 Parasagittal scan plane의 초음파 이미지는 초음파 프로브 센 서를 환부에 대해 Parasagittal scan plan으로 취해서 얻은 초음파 이미지로, 장기들을 대부분 잘 관찰할 수 있 다. 도면 부호 26은 간(liver), 도면부호 25는 비장(spleen), 도면부호 24는 신장(Kidney), 도면부호 23은 횡격막 (diaphragm)을 나타낸다. 본 발명의 상기 시맨틱 분할 기반의 영상 정합은 상기 참조영상에 장기 별로 할당된 칼라맵(color map)을 기준 으로 한다. 도 3에서 상기 칼라맵은 간은 초록색, 신장은 노란색, 비장은 파란색, 횡격막은 오렌지색으로 구성 되어 있다. 도 4는 특징 기반의 영상 정합을 하기 위해, Parasagittal scan plane의 초음파 이미지상에 표시된 코너점들의 일 실시예로, 이들 코너점들(‘+’ 로 표시)은 제어점 매핑에 의한 영상 정합에 사용된다. 도5는 웨이브릿 프레임 또는 Redundant(Over- Complete) 웨이브릿 기반의 영상 정합을 하기 위해, 초음파 이미 지에 대해 웨이브릿 프레임 변환하여 얻은 서브밴드 LL 프레임 이미지, 서브밴드 HL 프레임 이미지 , 서브밴드 LH 프레임 이미지, 서브밴드 HH 프레임 이미지를 보인다. 본 발명에서는, 상기 서브밴드 프레임 이미지 중 에지 특징점이 풍부한 서브밴드 HL 이미지 와 서브밴드 LH 이미지를 사용하여 영상 정합하는 것이 바람직하다. 도 6은 바이오 분석장치로부터 얻은 이미지 데이터를 영상 신호로 입력 받는 도 1의 노이즈 제거 장치 와 연결되어 바이오 반응 결과를 자동 분석하여 진단하고, 사용자에게 의료 전문가와의 상담 서비스를 제 공하는 원격 의료 진단 시스템의 일 실시예이다. 상기 바이오 분석장치는 생물학적, 화학적 또는 생화학적 반응을 수행하는 바이오 디스크 또는 랩온어디스 크(Lab on a Disc)를 구동하고, 바이오 디스크상에서 이루어진 바이오 반응 결과를 이미지 데이터로 캡쳐하기 위한 형광 이미지 센서 내지 이미지 센서 및 상기 캡쳐된 이미지 데이터의 노이즈를 제거하는 도 1의 노이즈 제거 장치를 포함한다. 또한, 상기 바이오 분석 장치는 상기 랩온어 디스크를 올려놓기 위한 턴 테이블, 상기 턴 테이 블상의 랩온어 디스크를 회전시키기 위한 모터 및 중앙제어부를 포함한다. 도면 부호 350 은 상기 바이오 분석 장치를 지지하고 있는 몸체이다. 상기 바이오 분석 장치의 밑면에는 회로 기판 이 상기 몸체에 이음 체결되어 있고, 상기 회로 기판 위에는 중앙 제어부와 노이즈 제거장 치가 배치 설계되어 있다. 상기 중앙 제어부는 상기 랩온어 디스크의 회전 또는 정지를 위해 상 기 모터를 제어하고, 상기 형광 이미지 센서 내지 이미지 센서를 제어한다. 도면 부호 104는 상기 디 스크 공극에 로딩된 디스크의 압착 수단으로, 턴 테이블과의 자력 인력에 의해 압착하는 것으로 수직 이동과 공회전을 허여하도록 설계되는 것이 바람직하다. 상기 원격 의료 진단 시스템은 사용자 단말기, 원격 진단 서버 및 의료 전문가 단말기를 포 함한다. 또한, 상기 원격 의료 진단 시스템은 바이오 분석장치을 포함할 수 있다. 상기 사용자 단말기는 상기 노이즈 제거 장치와 통신 인터페이스를 통해 연결되어 있으며, 노이즈가 제거된 영상을 이용하여 사용자에게 의료 전문가와의 상담 서비스를 제공할 수 있다. 상기 원격 진단 서버 는 상기 사용자 단말기와 의료 전문가 단말기의 사이에서 데이터를 송수신할 수 있다. 상기 의료 전 문가 단말기는 상기 원격 진단 서버로부터 이미지 데이터를 수신하고 사용자에게 의료 전문가와의 상 담 서비스를 제공할 수 있다. 상기 사용자 단말기는 상기 바이오 분석장치의 사용 상황을 모니터링하기 위한 카메라, 상기 랩 온어디스크의 제품ID를 인증하는 제1 인증부 , 상기 노이즈 제거 장치 로부터 얻어진 노이즈 제 거된 이미지 데이터를 저장하는 기록부, 통신 네트워크를 통해 상기 이미지 데이터와 상기 랩온어디스 크의 제품 ID를 상기 원격 진단 서버로 송신하고, 원격 상담 서비스를 위한 통신 채널을 제공하는 인 터넷 연결부 및 의료 전문가와의 상담 서비스를 제공하는 제1 상담 서비스부를 포함한다. 또한, 상기 사용자 단말기는 소프트웨어 형태로 상주하여 상기 바이오 분석 장치에 의해 축적된 이미 지 데이터베이스를 사용하여 딥러닝(Deep learning) 학습된 인공 지능 신경망, 소프트웨어 형태로 상주하여 상기 바이오 분석 장치의 사용방법을 안내하거나 지시하는 안내부, 및 상기 노이즈 제거 장치에 의해 얻어진 이미지 데이터를 상기 딥런닝 학습 완료된 인공지능 신경망에 의해 자동 분석하여 진단결과를 출력하는 진단부를 더 포함한다. 이하에서 상기 안내부 및 상기 진단부를 합쳐 가상 의사라고 칭한다. 또한, 상기 사용자 단말기는 통신 인터페이스를 통해 노이즈 제거 장치와 연결되어 있다. 한편, 도6은 바이오 분석장치에 로딩된 랩온어디스크는 랩온어디스크의 단면 a-a’ 에 대한 단 면을 나타내며, DNA 증폭(amplification)을 수행하는 DNA 증폭 챔버를 포함하는 실시예를 보인다. 바이오 분석장치는 생물학적, 화학적 또는 생화학적 반응을 수행하는 바이오 디스크, 바이오 디스크를 구 동하는 중앙제어부, 본원의 일 실시예에 따른 노이즈 제거장치 및 바이오 디스크상에서 수행된 바이오 반응 결 과를 이미지 데이터로 캡쳐하는 이미지 센서를 포함할 수 있다. 상기 가상의사는 DNA 증폭 챔버의 DNA 증폭 산출물(product)을 정량적 내지 정성적으로 분석할 수 있다. 상기 의료 전문가 단말기는 상기 통신 네트워크를 통해 상기 이미지 데이터를 수신하는 수신부 및 사 용자에게 의료 전문가와의 상담 서비스를 제공하는 제2 상담 서비스부를 포함한다. 도 7은 X-레이 · 초음파 · CT · MRI 중 어느 한 의료장비로부터 얻은 환자의 의료 영상 데이터를 영상 신호로 입력 받는 도 1 내지 도 2의 노이즈 제거 장치와 연결되어 환자의 의료 영상 데이터를 자동 분석하 여 진단하고, 사용자에게 의료 전문가와의 상담 서비스를 제공하는 원격 의료 진단 시스템의 일 실시예이 다. 상기 의료 장비는 측정된 환자의 의료 영상 데이터를 무선 송신하는 무선 송출부(60a)를 포함한다. 상기 노이즈 제거 장치는 무선 송출부(60a)로부터 송출된 환자의 의료 영상 데이터를 수신하여 노이즈를 제거한다. 상기 원격 의료 진단 시스템의 사용자 단말기는 상기 의료장비의 사용 상황을 모니터링하기 위한 카메 라, 상기 의료장비의 제품ID를 무선으로 인증하는 제2 인증부 , 상기 의료 장비로부터 얻어진 환자에 대한 의료 영상 데이터를 저장하는 기록부, 통신 네트워크를 통해 상기 의료 영상 데이터와 의 료 장비의 제품 ID를 원격 진단 서버로 송신하고, 원격 상담 서비스를 위한 통신 채널을 제공하는 인터넷 연결부. 및 의료 전문가와의 상담 서비스를 제공하는 제3 상담 서비스부를 포함하고, 상기 사용자 단말 기은 상기 노이즈 제거 장치와 통신 인터페이스를 통해 연결되어 있다. 여기에서, 제2인증부 는 제1인증부와 대응되는 기능을 수행할 수 있다. 또한, 제3상담 서비스부는 제1상담 서비스부(6 5)와 대응되는 기능을 수행할 수 있다. 또한, 상기 사용자 단말기는 소프트웨어 형태로 상주하여 상기 의료 장비에 의해 축적된 의료 영상 데 이터베이스를 사용하여 딥러닝(Deep learning) 학습된 인공 지능 신경망, 소프트웨어 형태로 상주하여 상기 의료 장비의 사용방법을 안내하거나 지시하는 안내부, 상기 의료장비에 의해 환자로부터 얻어진 의 료 영상 데이터를 바탕으로 상기 딥러닝 학습 완료된 인공지능 신경망에 의해 자동 분석하여 진단결과를 출 력하는 진단부를 더 포함한다. 상기 안내부는 상기 카메라에 의해 상기 의료장비의 사용상황을 실시간 모니터링하여 사용자에게 의료장비의 사용방법을 안내하거나 지시하는 것을 특징으로 한다. 상기 원격 의료 진단 시스템의 의료 전문가 단말기는 상기 통신 네트워크를 통해 상기 의료 영상 데이터를 수신하는 수신부 및 사용자에게 의료 전문가와의 상담 서비스를 제공하는 제4 상담 서비스부를 포함한 다. 여기에서, 제4상담 서비스부는 제2상담 서비스부와 대응되는 기능을 수행할 수 있다. 상기 의료 전문가 단말기는 카메라, 마이크 및 마우스를 포함할 수 있다. 또한, 본원의 일 실시예에 따른 원격 의료 진단 시스템에 의한 원격 의료 진단 방법은, 랩온어 디스크상의 이미 지 데이터 내지 의료장비로부터 얻어진 환자의 의료 영상 데이터에 포함된 노이즈를 노이즈 제거 장치에 의해 제거하는 단계, 인공 지능 신경망을 데이터베이스를 사용하여 딥런닝(Deep learning)에 의해 학습시키는 단계, 사용자 단말에 포함된 가상의사에 의해 노이즈 제거된 이미지 데이터 내지 의료 영상 데이터를 상기 딥런닝 학 습 완료된 인공지능 신경망에 의해 자동 분석하여 진단결과를 출력하는 단계, 및 통신 네트워크를 통해 상기 노 이즈 제거된 환자의 의료 영상 데이터 내지 이미지 데이터를 원격 진단 서버로 송신하고, 의료전문가와 원격 상 담 서비스를 진행하는 단계를 포함할 수 있다. 본원의 일 실시예에 따른, 원격 의료 진단 방법은, 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이 터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 본 발명을 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매 체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같 은 자기-광 매체(magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어 지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 상기된 하드웨어 장치는 본 발명의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지이다."}
{"patent_id": "10-2019-0053287", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "전술한 본원의 설명은 예시를 위한 것이며, 본원이 속하는 기술분야의 통상의 지식을 가진 자는 본원의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본원의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본원의 범위에 포함되는 것으로 해 석되어야 한다."}
{"patent_id": "10-2019-0053287", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1 내지 도 2는 이산 웨이브릿 변환(Discrete Wavelet transform)을 이용한 영상신호의 노이즈 제거 장치의 여러 실시예이다. 도 1은 이미지 1개에 대한 이산 웨이브릿 변환을 이용한 노이즈 제거 장치의 개략적인 블록도 이다. 도 2는 복수개의 동영상 이미지로 구성된 동영상에 대한 이산 웨이브릿 변환을 이용한 노이즈 제거 장치 의 개략적인 블록도이다. 도 3은 시맨틱 분할 기반의 영상 정합을 하기 위해, 초음파 이미지에 대해 시맨틱 분할을 한 일 실시예이다. 도 4는 특징 기반의 영상 정합을 하기 위해, 초음파 이미지상에 코너점들을 표시한 일 실시예이다. 도5는 웨이브릿 프레임(Wavelet frame) 기반의 영상 정합을 하기 위해, 초음파 이미지에 대해 웨이브릿 프레임 변환을 수행하여 얻은 서브밴드 프레임 이미지들의 일 실시예이다. 도 6은 랩온어디스크를 구동하는 바이오 분석장치 및 그로부터 얻은 이미지 데이터의 노이즈를 제거하는 노이즈 제거 장치와 연결되어 바이오 반응 결과를 자동 분석하여 진단하고, 사용자에게 의료 전문가와의 상담 서비스를 제공하는 원격 의료 진단 시스템의 일 실시예의 개략적인 구성도이다. 도 7은 의료장비로부터 얻은 환자의 의료 영상 데이터의 노이즈를 제거하는 노이즈 제거 장치와 연결되어 환자 의 의료 영상 데이터를 자동 분석하여 진단하고, 사용자에게 의료 전문가와의 상담 서비스를 제공하는 원격 의 료 진단 시스템의 일 실시예의 개략적인 구성도이다."}
