{"patent_id": "10-2022-0008279", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0112248", "출원번호": "10-2022-0008279", "발명의 명칭": "영상 기반 이동 객체 계측 시스템", "출원인": "오큐브 주식회사", "발명자": "정우성"}}
{"patent_id": "10-2022-0008279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "영상데이터를 수집하는 영상 수집부;상기 영상데이터의 영상인식을 통해 이동 객체의 위치 및 차종을 검출하고, 상기 영상데이터에 이동 객체의 이동 경로를 검출하기 위한 검출 존(zone)을 지정하고, 하나의 이동 객체가 복수 개의 검출 존에서 검출되면 상기하나의 이동 객체가 검출된 각 검출 존의 위치를 파악하여 상기 하나의 이동 객체의 진행방향을 검출하고, 상기진행방향으로 주행하는 이동 객체 수를 상기 이동 객체의 차종별로 구별하여 집계하는 프로세서; 및진행방향 각각에 대한 이동 객체의 차종별 이동 객체 수를 집계한 결과를 출력하는 디스플레이부;를 포함하는영상 기반 이동 객체 계측 시스템."}
{"patent_id": "10-2022-0008279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 프로세서는, 상기 영상데이터에서 서로 다른 진행방향을 갖는 도로 각각에 검출 존을 지정하되, 상기 영상데이터의 촬영 화각에 의해 보여지는 도로의 도로윤곽선을 따라 선 또는 다각형(polygon) 중 하나의 도형으로 검출 존을 지정하고, 상기 검출 존의 일측이 인도 측으로 확장되는 것을 특징으로 하는 영상 기반 이동 객체 계측 시스템."}
{"patent_id": "10-2022-0008279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 프로세서는, 복수의 검출 존 중 하나를 기준영역으로서 검출 존_1로 지정하고, 상기 검출 존_1로부터 반시계 방향으로 도로수만큼 검출 존_N(1<N, N은 자연수)을 지정하고, 하나의 이동 객체가 복수 개의 검출 존에서 검출되면 상기 하나의 이동 객체의 진입이 검출된 검출 존부터 최종적으로 진출이 검출된 검출 존까지 이동 객체의 이동 경로를검출함으로써 진행방향을 추적하는 것을 특징으로 하는 영상 기반 이동 객체 계측 시스템."}
{"patent_id": "10-2022-0008279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 프로세서는,상기 하나의 이동 객체의 진출입이 판단된 검출 존들의 위치를 확인하여 이동 객체의 진행방향을 추적하고, 추적된 진행방향에 대한 이동 객체의 차종별 이동 객체 수를 계수하여 집계하는 것을 특징으로 하는 영상 기반 이동 객체 계측 시스템."}
{"patent_id": "10-2022-0008279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 프로세서는,상기 검출 존을 다각형 중 하나의 도형으로 지정하기 위해, 상기 도로의 도로윤곽선을 경계선으로 갖도록 검출존을 지정하고, 지정된 검출 존의 경계선이 이동 객체의 특징점을 모두 검출하는지 샘플영상을 통해 시뮬레이션하고, 시뮬레이션 결과, 상기 이동 객체의 특징점이 모두 검출되지 않으면, 특징점이 검출되지 않는 방향의 해당 경계선을 도로의 도로윤곽선보다 확장하는 것을 특징으로 하는 영상 기반 이동 객체 계측 시스템.공개특허 10-2023-0112248-3-청구항 6 제5항에 있어서, 상기 프로세서는,이동 객체의 위치를 검출하기 위한 특징점을 상, 하, 전, 후 및 중앙을 포함하는 그룹 중 적어도 하나의 위치로미리 설정하고, 상기 검출 존에 진입한 이동 객체의 특징점을 검출함으로써 상기 이동 객체의 진입을 확인하여 상기 이동 객체를 식별하기 위한 ID를 부여하고, 상기 이동 객체를 직사각형 좌표 정보와 함께 상기 ID를 표시하는 것을 특징으로 하는 영상 기반 이동 객체 계측 시스템."}
{"patent_id": "10-2022-0008279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 상기 프로세서는, 이동 객체를 미리 설정된 차종에 따라 분류하고, 분류된 차종별로 해당 진행방향의 이동 객체 수를 계수하여 집계하는 것을 특징으로 하는 영상 기반 이동 객체 계측 시스템."}
{"patent_id": "10-2022-0008279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 프로세서는,수집된 영상데이터에서 이동 객체의 이동이 없는 경우, 처리 속도를 높이기 위해 상기 수집된 영상데이터의 입력 프레임을 스킵하는 기능을 수행하는 것을 특징으로 하는 영상 기반 이동 객체 계측 시스템."}
{"patent_id": "10-2022-0008279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서, 상기 프로세서는,수집된 영상데이터에서 일정시간 동안 이동 객체의 위치를 검출하고, 검출된 이동 객체의 위치를 좌표화한 후좌표화된 이동 객체의 위치 정보를 저장하고, 상기 좌표화된 이동 객체의 위치 정보에 기반하여 교차로를 인식하고 인식된 교차로에 대한 검출 존을 자동으로 지정하는 것을 특징으로 하는 영상 기반 이동 객체 계측시스템."}
{"patent_id": "10-2022-0008279", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 AI 영상 인식 기술을 기반으로 한 이동 객체 계측 시스템에 관한 것으로, 상기 이동 객체 계측 시스템 은, 복잡한 형태의 교차로 등에서 이동 객체의 진행방향별 계수를 자동화하기 위해, 각 교차로의 접점에 촬영 화 각에 맞춰 검출 존들을 커스터마이징(customizing)하여 지정하고, 각 검출 존에서 동일하게 검출되는 이동 객체 의 이동 궤적을 추적함으로써 진행방향별 이동 객체 개수를 조사할 수 있도록 구성된 것을 특징으로 한다."}
{"patent_id": "10-2022-0008279", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 교통량 측정 기술에 관한 것으로, 더욱 상세하게는, AI 영상 인식 기술을 기반으로 복잡한 교차로의 검출 존을 통과하는 이동 객체의 차종 및 진행 방향을 검출하고, 검출된 진행방향에 대한 이동 객체의 차종별 이동량 계수가 가능한 영상 기반 이동 객체 계측 시스템 및 그 방법에 관한 것이다."}
{"patent_id": "10-2022-0008279", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 AI 영상 인식 기술을 이용한 이동 객체의 이동량 검출은 신호등, 톨 게이트 등에 고정식으로 설치되 어 객체 검출이 수월한 카메라의 화각에서 수행되나, 도심의 시내도로에서는 적은 수의 카메라로 다양한 형태의 교차로에 대한 화각을 확보하기 어려워 이동 객체의 이동량 검출에 어려움이 있다. 이에 다양한 형태의 교차로에서 각 진행방향별로 교통량 조사를 정확하게 수행하기 위한 시스템 개발이 요구되 고 있으며, 특히, 다양한 카메라 화각에서 촬영되는 영상에서 교차로의 진행방향별 교통량을 수월하고 정확하게계수(counting)하기 위한 기술 개발이 필요하게 되었다."}
{"patent_id": "10-2022-0008279", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기의 문제점들을 해결하기 위하여 안출된 것으로서, 다양한 형태의 교차로에서 각 교차로의 인접한 도로의 일부 영역에 검출 존들을 도로 형태에 맞춰 지정하고, 각 검출 존에서 동일하게 검출되는 이동 객체를 확인하고, 동일한 이동 객체가 확인된 검출 존의 위치를 파악함으로써 진행방향을 판단하고, 이를 통해 진행방 향별 이동 객체 수의 계수를 자동화할 수 있는 영상 기반 이동 객체 계측 시스템을 제공하는 데 그 목적이 있다. 또한, 본 발명은 영상데이터의 카메라 화각에 따라 이동 객체의 검출이 용이하도록 이동 객체의 특징점을 상, 하, 전, 후 및 중앙 중 하나로 지정함으로써 이동 객체 검출의 정확도를 향상시킬 수 있는 영상 기반 이동 객체 계측 시스템을 제공하는 데 그 목적이 있다. 또한, 본 발명은 최소한의 카메라로 다양한 형태의 교차로에서 교통영상을 획득하고, 획득된 교통영상의 영상데 이터 내 촬영 화각에 따른 교차로 특성에 맞춰 검출 존을 지정함으로써 정확한 교통량 조사를 위한 이동 객체의 검출을 최적화할 수 있는 영상 기반 이동 객체 계측 시스템을 제공하는 데 그 목적이 있다."}
{"patent_id": "10-2022-0008279", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위하여, 본 발명의 일 실시 형태에 따른 영상 기반 이동 객체 계측 시스템은, 영상데이터 를 수집하는 영상 수집부; 상기 영상데이터의 영상인식을 통해 이동 객체의 위치 및 차종을 검출하고, 상기 영 상데이터에 이동 객체의 이동 경로를 검출하기 위한 검출 존(zone)을 지정하고, 하나의 이동 객체가 복수 개의 검출 존에서 검출되면 상기 하나의 이동 객체가 검출된 각 검출 존의 위치를 파악하여 상기 하나의 이동 객체의 진행방향을 검출하고, 상기 진행방향으로 주행하는 이동 객체 수를 상기 이동 객체의 차종별로 구별하여 집계하 는 프로세서; 및 진행방향 각각에 대한 이동 객체의 차종별 이동 객체 수를 집계한 결과를 출력하는 디스플레이 부;를 포함한다. 또한, 상기 프로세서는, 상기 영상데이터에서 서로 다른 진행방향을 갖는 도로 각각에 검출 존을 지정하되, 상 기 영상데이터의 촬영 화각에 의해 보여지는 도로의 도로윤곽선을 따라 선 또는 다각형(polygon) 중 하나의 도 형으로 검출 존을 지정하고, 상기 검출 존의 일측이 인도 측으로 확장되는 것을 특징으로 한다. 또한, 상기 프로세서는, 복수의 검출 존 중 하나를 기준영역으로서 검출 존_1로 지정하고, 상기 검출 존_1로부 터 반시계 방향으로 도로수만큼 검출 존_N(1<N, N은 자연수)을 지정하고, 하나의 이동 객체가 복수 개의 검출 존에서 검출되면 상기 하나의 이동 객체의 진입이 검출된 검출 존부터 최종적으로 진출이 검출된 검출 존까지 이동 객체의 이동 경로를 검출함으로써 진행방향을 추적하는 것을 특징으로 한다. 또한, 상기 프로세서는, 상기 하나의 이동 객체의 진출입이 판단된 검출 존들의 위치를 확인하여 이동 객체의 진행방향을 추적하고, 추적된 진행방향에 대한 이동 객체의 차종별 이동 객체 수를 계수하여 집계하는 것을 특 징으로 한다. 또한, 상기 프로세서는, 상기 검출 존을 다각형 중 하나의 도형으로 지정하기 위해, 상기 도로의 도로윤곽선을 경계선으로 갖도록 검출 존을 지정하고, 지정된 검출 존의 경계선이 이동 객체의 특징점을 모두 검출하는지 샘 플영상을 통해 시뮬레이션하고, 시뮬레이션 결과, 상기 이동 객체의 특징점이 모두 검출되지 않으면, 특징점이 검출되지 않는 방향의 해당 경계선을 도로의 도로윤곽선보다 확장하는 것을 특징으로 한다. 또한, 상기 프로세서는, 이동 객체의 위치를 검출하기 위한 특징점을 상, 하, 전, 후 및 중앙을 포함하는 그룹 중 적어도 하나의 위치로 미리 설정하고, 상기 검출 존에 진입한 이동 객체의 특징점을 검출함으로써 상기 이동 객체의 진입을 확인하여 상기 이동 객체를 식별하기 위한 ID를 부여하고, 상기 이동 객체를 직사각형 좌표 정보 와 함께 상기 ID를 표시하는 것을 특징으로 한다. 또한, 상기 프로세서는, 이동 객체를 미리 설정된 차종에 따라 분류하고, 분류된 차종별로 해당 진행방향의 이 동 객체 수를 계수하여 집계하는 것을 특징으로 한다. 또한, 상기 프로세서는, 수집된 영상데이터에서 이동 객체의 이동이 없는 경우, 처리 속도를 높이기 위해 상기 수집된 영상데이터의 입력 프레임을 스킵하는 기능을 수행하는 것을 특징으로 한다. 또한, 상기 프로세서는, 수집된 영상데이터에서 일정시간 동안 이동 객체의 위치를 검출하고, 검출된 이동 객체 의 위치를 좌표화한 후 좌표화된 이동 객체의 위치 정보를 저장하고, 상기 좌표화된 이동 객체의 위치 정보에 기반하여 교차로를 인식하고 인식된 교차로에 대한 검출 존을 자동으로 지정하는 것을 특징으로 한다."}
{"patent_id": "10-2022-0008279", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 고정되지 않은 촬영 화각으로 획득된 영상데이터의 도로 형태에 맞춰 다각형 모양으로 검출 존을 커스터마이징 함으로써 촬영 화각에 상관없이 검출 존을 적용할 수 있어 이동 객체의 검출 및 교통량을 정 확하게 측정 가능하게 하는 효과가 있다. 또한, 본 발명에 따르면, 다양한 촬영 화각을 가지는 영상데이터에서 이동 객체의 검출이 용이하도록 이동 객체 의 특징점을 조정함으로써 이동 객체의 검출 정확도를 향상시키는 효과가 있다. 또한, 본 발명에 따르면, 다양한 형태의 교차로를 촬영한 영상데이터에서 도로윤곽선을 검출하여 도로 형태에 맞춰 검출 존을 자동으로 지정하고, 각 검출 존에 대한 이동 객체의 진출입을 판단함으로써 진행방향별 이동 객 체 계측의 자동화가 가능한 효과가 있다. 또한, 본 발명에 따르면, AI 영상 인식 기술(학습된 AI 모델)을 이용하여 이동 객체의 차종을 분류함으로써 차 종별 이동 객체 수를 정확하게 조사할 수 있고, 이를 통해 이동 객체의 차종별 도로 이용 현황을 알 수 있는 효 과가 있다. 또한, 본 발명에 따르면, 다각형 모양의 검출 존을 화각에 맞도록 지정함으로써 최소한의 카메라를 통해 촬영됨 에 따라 촬영영상의 화각이 좋지 않은 경우에도 이동 객체의 정확한 검출이 가능하게 하는 효과가 있고, 비용 절감을 가능하게 하는 효과가 있다."}
{"patent_id": "10-2022-0008279", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 첨부된 도면들을 참조하여 본 발명에 대해서 자세히 설명한다. 이때, 각각의 도면에서 동일한 구성 요소는 가능한 동일한 부호로 나타낸다. 또한, 이미 공지된 기능 및/또는 구성에 대한 상세한 설명은 생략한다. 이하에 개시된 내용은, 다양한 실시 예에 따른 동작을 이해하는데 필요한 부분을 중점적으로 설명하며, 그 설명 의 요지를 흐릴 수 있는 요소들에 대한 설명은 생략한다. 또한, 도면의 일부 구성요소는 과장되거나 생략되거나 또는 개략적으로 도시될 수 있다. 각 구성요소의 크기는 실제 크기를 전적으로 반영하는 것이 아니며, 따라서 각각의 도면에 그려진 구성요소들의 상대적인 크기나 간격에 의해 여기에 기재되는 내용들이 제한되는 것은 아 니다. 본 발명의 실시예들을 설명함에 있어서, 본 발명과 관련된 공지기술에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명을 생략하기로 한다. 그리고 후술되는 용어들은 본 발명에서의 기능을 고려하여 정의된 용어들로서 이는 사용자, 운용자의 의도 또는 관례 등에 따라 달라질 수 있다. 그러므로 그 정의는 본 명세서 전반에 걸친 내용을 토대로 내려져야 할 것이다. 상세한 설명에서 사용되 는 용어는 단지 본 발명의 실시 예들을 기술하기 위한 것이며, 결코 제한적이어서는 안 된다. 명확하게 달리 사 용되지 않는 한, 단수 형태의 표현은 복수 형태의 의미를 포함한다. 본 설명에서, \"포함\" 또는 \"구비\"와 같은 표현은 어떤 특성들, 숫자들, 단계들, 동작들, 요소들, 이들의 일부 또는 조합을 가리키기 위한 것이며, 기술된 것 이외에 하나 또는 그 이상의 다른 특성, 숫자, 단계, 동작, 요소, 이들의 일부 또는 조합의 존재 또는 가능 성을 배제하도록 해석되어서는 안 된다. 또한, 제1, 제2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소들은 상기 용어 들에 의해 한정되는 것은 아니며, 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 이하, 첨부된 도면을 참조하여 본 발명의 일 실시예에 대하여 보다 상세하게 설명하고자 한다. 도 1은 본 발명의 일실시 형태에 따른 영상 기반 이동 객체 계측 시스템의 전체 구성을 개략적으로 도시한 블럭 도이다. 도 2는 본 발명의 일실시 형태에 따른 영상 기반 이동 객체 계측 시스템의 이동 객체 계측의 예를 나타 낸 예시도이다. 본 예시도에서는 사거리 교차로를 도시하였지만, 이에 한정되는 것은 아니며 2차로, 3차로 등 다양한 형태의 교차로에 적용될 수 있다. 도 1에 도시된 바와 같이, 본 발명의 일실시 형태에 따른 영상 기반 이동 객체 계측 시스템은, CCTV 시스템 및 영상 DB로부터 영상데이터를 획득하고, 획득된 영상데이터 내 각 진행방향에 대한 차종별 이동 객 체 수를 계수할 수 있다. 여기서, CCTV 시스템은 도로를 촬영하고 촬영된 영상데이터를 메모리(미도시)에 저장하거나 실시간으로 교 통 정보 센터(미도시)로 송신하여 저장되도록 할 수 있다. 영상 DB는 각 지방자치단체, 교통 정보 센터 등 에서 제공될 수 있으며, 각 도로에 설치된 CCTV 시스템으로부터 송신된 영상데이터가 저장되어 구축될 수 있다. 본 발명의 실시예에 있어서, 이동 객체 계수 시스템은 CCTV 시스템 및 영상DB와 유/무선 네트워크 를 통해 연결되어 저장된 영상데이터를 수신하거나 전기적 연결을 통해 직접 영상데이터를 획득할 수 있도 있다. 이러한 이동 객체 계수 시스템은, 영상 수집부, 프로세서 및 디스플레이부를 적어도 포함하여 구성될 수 있다. 구체적으로 설명하면, 영상 수집부는 CCTV 시스템 및/또는 영상 DB로부터 영상데이터를 수집한다. 여기서, 영상데이터는 다양한 형태의 도로를 촬영한 동영상으로, 교차로를 통행하는 차량보다 높은 위치에 설치 된 적어도 하나의 카메라를 통해 촬영되며, 카메라의 촬영 화각이 정해지진 않고 촬영 각도, 위치에 따라 다양 한 화각을 가질 수 있다. 그리고, 프로세서는, 영상데이터 기반 이동 객체에 대한 교통량을 계측할 수 있는 프로그램을 구비하며, 구 비된 프로그램을 실행하여 수집된 영상데이터로부터 이동 객체의 교통량을 계측한다. 여기서, 도시하지는 않았 지만, 프로세서는 프로그램이 내장되는 메모리를 구비할 수 있다. 도 2에 도시된 바와 같이, 프로세서는 영상 수집부로부터 수집된 영상데이터에서 도로가 교차하는 지점과 인접한 도로 각각에 검출 존(101, 102, 103, 104)을 지정하고, 지정된 각 검출 존에 진출입하는 이동 객 체를 검출하여 이동 궤적을 추적함으로써 이동 객체의 주행방향(121, 122, 123, 124)별 교통량을 계측할 수 있다. 여기서, 프로세서는 각 검출 존(101, 102, 103, 104)을 통과하는 이동 객체의 차종 및 주행 방향(121, 122, 123, 124)을 검출한다. 또한, 프로세서는 영상데이터 내 도로의 일부 영역에 대한 영상인식을 통해 이동 객체를 인식하 거나, 영상데이터 내 모든 이동 객체를 인식하여 직사각형 좌표로 표시하고, 인식된 이동 객체 에 이동 객체를 식별하기 위한 ID를 부여하고 부여된 ID를 직사각형 좌표에 표시(미도시)할 수 있다. 이때, 프로세서는 영상데이터의 영상 인식시, 이동 객체에 대한 차종의 판단을 미리 학습된 AI(인공지 능) 모델을 통해 수행할 수 있으며 6종 내지 12종의 차종을 분류할 수 있는데, 예를 들어, 6종의 차종은 세단 (sedan), 버스1(1B2, 25인승), 버스2(1B2, 25인승 이상), 트럭1(1T(~2.5t), 트럭2(1T(2.5t 이상), 대형화물차 를 포함할 수 있다. 이러한 AI 모델은 통상의 규칙 기반 모델 또는, 기계학습, 신경망 또는 딥러닝 알고리즘 중 적어도 하나에 따라 학습된 인공지능 모델을 이용해 수집된 다양한 영상데이터(빅데이터)를 기반으로 훈련된 모 델일 수 있다. 또한, 프로세서는 미리 학습된 AI 모델을 통해 이동 객체의 인식시, 영상데이터에서 각 도로에 지정된 검출 존마다 이동 객체를 인식하기에 적합한 위치의 특징점을 특정하여 추적함으로써 이동 객체를 더욱 정확하게 검 출할 수 있고 이로 인해 이동 객체의 주행방향을 더욱 정확하게 판단할 수 있다. 여기서, 특징점은 이동 객체의 상, 하, 전(앞), 후(뒤) 및 중앙을 포함한 5 지점의 위치를 이동 객체가 검출 존 내에 진출입 하였음을 인식하기 위한 검출 포인트로 설정한 것이며, 예를 들어, 영상을 촬영하는 카메라의 각도 에 따라 이동 객체의 진출입 검출이 용이한 특징점이 있는데, 카메라의 위치가 낮아 촬영 각도가 측면 방향일 경우, 상(top) 지점보다는 전(앞), 후(뒤) 및 중앙 지점을 인식하고, 카메라의 위치가 높아 촬영 각도가 하측 방향일 경우, 상(top) 지점을 검출하는 것이 이동 객체의 검출 정확도를 높일 수 있다. 또한, 프로세서는 영상데이터의 연속된 프레임에서 이동 객체를 검출하여 추적함으로써 이동 객체 의 주행방향(121, 122, 123, 124)을 검출할 수 있다. 이때, 프로세서는 이동 객체가 순차적으로 진입 및 진출하는, 즉, 통과하는 검출 존을 판단함으로써 이동 객체의 주행방향을 추적할 수 있다. 예를 들어, 프로세서는 도 2에 도시된 바와 같이 사거리 교차로의 경우, 4개의 방향이 존재하며, 4개의 서 로 다른 진행방향을 갖는 도로에 각각 검출 존을 지정하되, 검출 존_1에 대해 반시계방향으로 검출 존 _2, 검출 존_3 및 검출 존_4를 각각 지정할 수 있다. 이때, 프로세서는 이동 객체가 검출 존_1의 진출입이 검출된 후, 검출 존_2에서 이동 객체 의 진출입이 검출되면 우회전으로 주행방향을 판단한다. 또한, 프로세서는 이동 객체가 검출 존 _1의 진출입이 검출된 후, 검출 존_3에서 이동 객체의 진출입이 검출되면 직진으로 주행방향을 판단한다. 또한, 프로세서는 이동 객체가 검출 존_1의 진출입이 검출된 후, 검출 존_4에서 이동 객체의 진출입이 검출되면 좌회전으로 주행방향을 판단한다. 한편, 프로세서는 검출 존_1에 대한 유턴을 확인하기 위해서는 검출 존_1을 진행방향에 따른 두 개의 검출 존으로 구분하고, 구분된 각 검출 존의 이동 객체 진출입을 검출함으로써 유턴에 대한 주행방향을 판단할 수 있다. 이로써 프로세서는 각 주행방향에 대한 이동 객체의 수를 계측하여 집계하되, 이동 객체의 차종별로 분류하 여 이동 객체 수를 집계할 수 있다. 예를 들어, 프로세서는 검출 존_1에서 검출 존_2로의 진행방 향을 제1 방향, 검출 존_1에서 검출 존_3으로의 진행방향을 제2 방향, 검출 존_1에서 검출 존 _4로의 진행방향을 제3 방향으로 각각 정의하면, 제1 방향, 제2 방향, 제3 방향으로 각각 이동하는 이동 객체의 차종별 이동량을 계측할 수 있다. 이러한 이동 객체의 이동량 계측은 해당 방향으로의 교통 흐름을 분석 하는 데 활용될 수 있다. 예를 들어, 진행방향 중 제1 방향, 제2 방향, 제3 방향으로 각각 이동하는 이동 객체 의 이동량에 따라 원활, 지체, 정체 중 하나로 교통 흐름을 분석할 수 있다. 여기서, 주행방향은 이동 객체 기준으로 이동 궤적에 따라 이동 객체가 이동하는 방향이며, 진행방향은 각 도로 의 검출 존 기준으로 해당 검출 존을 통과하여 이동하는 방향으로, 주행방향은 각 검출 존에서 이동 객체마다 상이할 수 있으나, 진행방향은 해당 검출 존을 통과하는 방향이므로 각 검출 존에서 이동 객체 모두에게 동일한방향으로 인식된다. 한편, 프로세서는 프린터(미도시)와 연결되어 계측결과를 종이매체로 출력할 수도 있다. 이러한 프로세서는 유/무선 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터 시스템으로 구현될 수 있다. 여기서, 컴퓨터 시스템은 예를 들어, 내비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 그리고, 디스플레이부는 프로세서로부터 계측된 결과를 표, 히스토그램 등으로 작성되어 표시될 수 있 다. 상술한 바와 같이 본 발명은, 영상데이터의 도로 형태에 맞춰 다각형 모양으로 검출 존을 커스터마이징 함으로 써 촬영 화각에 상관없이 검출 존을 적용할 수 있고, 이를 통해 검출 존을 통과하는 이동 객체의 검출 및 진행 방향별 교통량을 정확하게 측정 가능하게 한다. 이러한 본 발명에 따르면, 교차로 내 방향별, 차종별 이동 객체의 이동량을 집계하여 교차로의 교통량에 대한 빅데이터를 구축할 수 있고, 구축된 빅데이터는 신도시 등 택지개발을 비롯한 산업단지 조성 등 다양한 분야에 서 활용될 수 있으며, 또한, 구축된 빅데이터를 기반으로 최적 신호를 산출해 신호 주기를 실시간 반영함으로써 교통량이 많은 시간대와 그렇지 않은 시간대가 큰 주요 도로의 교통 흐름 개선에도 활용될 수 있다. 도 3은 본 발명의 일실시 형태에 따른 영상 기반 이동 객체 계측 시스템의 프로세서에서 동작하는 프로세스를 나타낸 기능 블럭도이다. 도 4 및 도 6은 본 발명의 일실시 형태에 따른 영상 기반 이동 객체 계측 시스템의 프로세서에서 수행하는 검출 존 지정(S122)에 대한 동작을 설명하기 위한 예시도이다. 도 7은 본 발명의 일실시 형태에 따른 영상 기반 이동 객체 계측 시스템의 프로세서에서 수행하는 이동객체 검 출(S123)에 대한 동작을 설명하기 위한 예시도이다. 도 8은 본 발명의 일실시 형태에 따른 영상 기반 이동 객체 계측 시스템의 프로세서에서 수행하는 진행방향 추 적(S124)에 대한 동작을 설명하기 위한 예시도이다. 이하, 도 3 내지 8을 참조하여 본 발명의 프로세서의 동작을 설명하도록 한다. 먼저, 도 3에 도시된 바와 같이, 본 발명의 실시예에 따른 프로세서는 영상 기반의 이동 객체 계측을 위한 프로세스로, 영상인식(S121), 검출 존 지정(S122), 이동객체 검출(S123), 진행방향 추적(S124) 및 이동객체 계 수(S125)를 포함하도록 구현될 수 있다. 구체적으로 설명하면, 영상인식(S121)은, 프로세서가 영상 수집부로부터 수집된 영상데이터를 전달받고, 전달된 영상데이터로부터 영상에 포함된 정보를 인식하는 영상 인식 기능을 수행하는 것에 의해 수행 된다. 이때, 프로세서는 영상데이터로부터 일부 영역을 지정하여 이동 객체의 위치, 도로 등을 인식할 수 있다. 또는, 프로세서는 영상데이터 전체 영역에 대한 이동 객체의 위치를 인식할 수 있다. 이러한 영상인식은 차종의 판단에 대한 미리 학습된 AI 모델을 통해 구현될 수 있으며, 이를 통해 이동 객체의 차종이 판단될 수 있다. 또한, 프로세서는, 수집된 영상데이터의 입력 해상도를 실시간으로 변경가능하게 하여 최적의 성능으로 이 동 객체의 인식을 가능하게 하는 기능을 구비할 수 있다. 또한, 프로세서는 이동 객체의 이동이 없는 경우, 처리 속도를 높이기 위해 수집된 영상데이터의 입력 프레임을 스킵할 수 있게 설정하여 처리 시간을 단축시킬 수 있는 기능을 구비할 수 있다. 다음으로, 검출 존 지정(S122)은, 프로세서가 영상데이터 내 각 도로의 교차지점에 인접한 도로 영역에 검 출 존을 지정하는 것에 의해 수행된다. 여기서, 프로세서는 프로그램 실행에 따라 영상데이터가 디스플레이부에 표시되면, 검출 존 지정 기능 을 통해 마우스 드래그 온 드랍 방식, 좌표 입력 방식 등을 통해 관리자가 직접 검출 존을 지정하도록 지원할 수 있다. 이러한 검출 존은 도로의 도로윤곽선을 따라 선 또는 다각형(polygon) 중 하나의 도형으로 지정될 수있다. 즉, 검출 존(201, 202, 203, 204)은 도 4의 (a)에 도시된 바와 같이, 도로의 가로 양단의 끝 도로윤곽선을 따라 형성될 수 있으나, 이 경우, 버스, 트럭 등의 차체가 높고 큰 이동 객체의 경우 해당 검출 존을 벗어나서 검출 이 되지 않는 경우가 발생한다. 따라서, 도 4의 (b)에 도시된 바와 같이, 도로 가로 양단의 끝 도로윤곽선보다 더 크게 검출 존(205, 206, 207, 208)을 지정하는 것이 바람직하며, 예를 들면, 인도 측으로 검출 존 영역이 확장될 수 있다. 도 4의 (b)를 참조하면, 검출 존_1은 도로 양 끝단보다 일정영역(205a, 205b)만큼 인도측으로 확장되어 지 정되고, 검출 존_2는 도로 양 끝단보다 일정영역(206a, 206b)만큼 인도측으로 확장되어 지정되고, 검출 존 _3은 도로 양 끝단보다 일정영역(207a, 207b)만큼 인도측으로 확장되어 지정되고, 검출 존_4은 도로 양 끝단보다 일정영역(208a, 208b)만큼 인도측으로 확장되어 지정될 수 있다. 이때, 각 검출 존은 서로 중첩되 지 않도록 지정함으로써 이동 객체가 동일 영역에 있다고 판단하여 해당 검출 존으로의 진출입 여부가 검출되지 않는 오류를 방지할 수 있다. 한편, 본 실시예에 있어서, 검출 존을 프로세서의 지원하에 관리자 조작을 통해 지정되는 것으로 설명하였 지만, 이에 한정되는 것은 아니며, 검출 존이 자동으로 지정되도록 구현될 수 있다. 이에 대한 상세한 설명은 도 5 내지 도 6을 참조하여 설명한다. 일 예로, 프로세서가 영상데이터의 촬영 화각에 따라 보여지는 도로의 도로윤곽선을 따라 선 또는 다각형 (polygon) 중 하나의 도형으로 검출 존을 지정할 수 있다. 이를 위해, 프로세서는 영상데이터에서 라인 검 출을 통해 도로윤곽선을 구하고, 구한 도로윤곽선을 이용하여 도로를 먼저 검출할 수 있다. 또는, 프로세서가 이동 객체의 움직이는 경로를 추적하여 선으로 연결하고, 이를 통해 도로 윤곽선을 검출 함으로써 도로를 검출할 수 있다. 그런 다음, 프로세서가 도 4의 (a)와 같이 검출 존을 다각형 중 하나의 도형으로 지정하기 위해, 도로의 도로윤곽선을 경계선으로 갖는 검출 존(201, 202, 203, 204)을 지정할 수 있다. 여기서, 검출 존의 세로 폭(도로윤곽선과 평행한 방향의 폭)은 미리 설정되거나 교차 지점에 인접한 일정 영역까지 지정되도록 미리 설정될 수 있다. 이때, 프로세서는 지정된 검출 존의 경계선이 이동 객체의 특징점을 모두 검출하는지 샘플영상을 통해 시뮬 레이션하고, 시뮬레이션 결과, 이동 객체의 특징점이 모두 검출되지 않으면, 특징점이 검출되지 않는 방향의 해 당 경계선을 도로의 도로윤곽선보다 인도측으로 확장하여 도 4의 (b)와 같이 검출 존(205, 206, 207, 208)을 지 정할 수 있다. 이와 같은 방식으로 본 발명의 프로세서는 검출 존을 자동으로 지정할 수 있다. 다른 일 예로, 도 5에 도시된 바와 같이, 영상데이터의 촬영 화각이 좋지 않을 경우, 프로세서는, 도 로윤곽선이 검출가능한 도로에 대해서는 검출 존(501, 504, 505)을 자동으로 지정하고, 지정된 검출 존(501, 504, 505)이 표시된 화면을 디스플레이부에 출력함으로써 관리자로하여금 검출 존(502, 503)을 인도측으로 확장하여 조정하거나 추가할 수 있도록 할 수 있다. 또한, 프로세서는 도 5와 같이, 검출 존을 삼각형, 사각형 등 다양한 모양의 다각형으로 구현할 수 있으며, 이에 한정되지 않고 선으로 구현할 수도 있다. 또 다른 예로, 일정 시간동안 촬영된 영상에서 이동하는 차량의 위치를 추적함으로써 도로 및 교차로를 인지하 고, 검출 존 영역을 자동으로 지정할 수 있다. 즉, 본 발명의 실시예에 있어서 프로세서는, 수집된 영상데이터 에서 일정시간 동안 다수의 이동 객체의 위치를 검출하고, 검출된 다수의 이동 객체의 위치를 좌표화한 후 좌표 화된 이동 객체의 위치 정보(좌표값을 가지며 영상 내 점으로 표시됨)를 저장하고, 상기 좌표화된 이동 객체의 위치 정보에 기반하여 교차로를 인식하고 인식된 교차로에 인접한 영역을 검출 존으로써 자동으로 지정할 수 있 다. 이에 대해 도 6의 (a) 및 (b)를 참조하여 구체적으로 설명하면, 카메라(미도시)를 이용하여 일정 시간동안 촬영 된 영상에서 차량의 위치를 검출하고, 검출된 차량의 위치를 좌표화(x, y 좌표)한 후, 해당 좌표값을 저장하며, 검출된 차량의 위치를 영상에 점으로 표시할 수 있다. 여기서, 동일한 이동방향을 가지는 차량을 구분하여 표시 할 수 있으며, 예를 들어 서로 다른 색으로 구분하거나 서로 다른 도형으로 표시할 수 있다. 또한, 차량 위치의 좌표화는 미리 설정된 이동 객체의 특징점(검출 포인트)을 기준으로 수행될 수 있다. 영상에 표시된 점들 중 최외곽에 표시된 점들을 연결하고 연결된 선을 도로윤곽선으로서 검출할 수 있다(도 6의 (a) 참조). 이후, 도 6의 (b)에 도시된 같이, 저장된 점의 x, y 좌표값을 이용해 검출 존을 지정하는데, 우선, Y축의 0 위 치부터 값을 증가하면서 점들의 좌표값 중 x좌표의 가장 작은 좌표값과 가장 큰 좌표값을 추출하여 표시하고, x 좌표가 넓게 분포하는 영역이 나타나면 교차로로 인식하고(C-1, C_2), 넓게 분포하기 전 y좌표값을 저장하고, x 좌표가 넓게 분포하는 해당 x좌표값에서부터 일정 영역을 검출 존의 시작점으로 지정하고, 이후에 다시 x좌표의 좌표값이 좁게 검출되면 검출 존의 상단 끝지점으로 판단하여 검출 존 영역(Zone_A)을 완성한다. 이때, 검출 존 (Zone_A)의 좌우폭은 검출된 이동 객체가 수 개 이상 들어 있는 영역으로 미리 설정된 값으로 임의 지정할 수 있다. 이렇게 완성된 검출 존 영역을 Zone_A라 하며 Zone_B의 경우는 Zone_A의 검출 방식에서 X와 Y좌표를 바꾸 어서 진행함으로써 지정할 수 있다. 다음으로, 이동객체 검출(S123)은, 프로세서가 검출 존에 대한 이동객체의 진출입, 즉, 이동 객체가 검출 존을 통과하는지를 검출하는 것에 의해 구현될 수 있다. 프로세서가, 도 7에 도시된 바와 같이, 이동 객체를 인식하여 직사각 좌표(B)를 표시하고, 직사각 좌 표(B)에 이동 객체를 검출하기 위한 특징점(P1, P2, P3, P4, P5)을 설정한다. 여기서, 특징점(P1, P2, P3, P4, P5)은 상(P1), 하(P2), 전(P3), 후(P4) 및 중앙(P5)을 포함하는 5 군데의 위치로 설정될 수 있다. 예를 들면, 프로세서가 검출 존에 대한 이동 객체의 진출입을 검출함에 있어서, 세단의 경우는 차체가 낮고 길이가 짧으므로 앞 또는 중앙에 특징점을 설정하는 것이 바람직하고, 버스나 트럭의 경우 차체가 높으므로 카 메라가 측면 시야각일 경우는 상(top) 지점보다는 중앙 또는 하단부에 특징점(검출 포인트)을 설정하는 것이 바 람직할 수 있다. 다음으로, 진행방향 추적(S124)은, 프로세서가 동일한 이동 객체의 주행방향에 따른 복수 개의 검출 존의 진출입을 검출하는 것에 의해 구현될 수 있다. 여기서, 이동 객체의 주행방향은 좌회전 방향, 직진 방향, 우회 전 방향 및 유턴 방향이 있을 수 있다. 즉, 프로세서는 이동 객체가 최초 진입한 검출 존을 시작으로, 이동 객체의 진출이 최종적으로 검출된 검출 존의 위치를 확인함으로써 이동 객체의 주행방향을 판단할 수 있다. 이때, 프로세서는 검출 존의 지정된 위치에 대한 정보가 저장되어 있으며, 이를 통해 이동 객체의 주행방향 에 따른 진출입이 검출된 검출 존의 위치를 추적함으로써 진행방향을 판단할 수 있다. 예를 들어, 도 8의 (a)에 도시된 바와 같이, 프로세서는 이동 객체가 Zone_1(빨간 색 빗금 영역)에 대한 진 출입이 검출된 후, Zone_3(노란 색 빗금 영역)에 대한 진출입이 검출되면, 이동 객체의 주행방향이 직진 방향이 고, 진행방향은 Zone_3을 통과하는 방향임을 판단할 수 있다. 또 다른 예를 들어, 도 8의 (b)에 도시된 바와 같이, 프로세서는 이동 객체가 Zone_1(빨간 색 빗금 영역)에 대한 진출입이 검출된 후, Zone_2(노란 색 빗금 영역)에 대한 진출입이 검출되면, 이동 객체의 주행방향이 우회 전 방향이고, 진행방향은 Zone_2을 통과하는 방향임을 판단할 수 있다. 또 다른 예를 들어, 도 8의 (c)에 도시된 바와 같이, 프로세서는 이동 객체가 Zone_1(빨간 색 빗금 영역)에 대한 진출입이 검출된 후, Zone_4(노란 색 빗금 영역)에 대한 진출입이 검출되면, 이동 객체의 진행방향이 좌회 전 방향이고, 진행방향은 Zone_4를 통과하는 방향임을 판단할 수 있다. 또 다른 예를 들어, 도 8의 (d)에 도시된 바와 같이, 프로세서는 Zone_1(빨간 색 빗금 영역)에 대한 이동 객체의 유턴 여부를 판단하기 위해, Zone_1을 중앙선을 경계로 진행방향에 따라 두 영역으로 구분하고, 구분된 두 영역에 대한 이동 객체의 진출입을 각각 검출함으로써 이동 객체의 주행방향이 유턴 방향임을 판단하고, 진 행방향은 Zone_1을 통과하는 방향임을 판단할 수 있다. 이처럼 프로세서는 다른 검출 존(Zone_2, Zone_3, Zone_4) 각각에 대한 유턴 여부도 동일하게 판단할 수 있다. 이러한 진행방향 추적은 이동 객체가 주행하는 동안, 영상데이터의 매 프레임마다 이동 객체의 위치를 검출하는 것에 의해 각 검출 존에 대한 진출입, 즉, 검출 존을 통과 여부를 판단함으로써 가능할 수 있다. 다음으로, 이동객체 계수(S125)는, 프로세서가 진행방향별로 이동 객체를 계수(counting)하는 것에 의해 수 행될 수 있다. 즉, 프로세서는 이동 객체의 주행에 따라 이동 객체가 2개의 검출 존을 순차적으로 진출입(통과)할 경우, 뒤에 검출되는 검출 존의 진행방향으로 이동 객체를 집계한다. 예를 들어, 도 8의 (a) 내지 (d)에 도시된 바와같이, Zone_1 -> Zone_3의 진행방향을 A, Zone_1 -> Zone_2의 진행방향을 B, Zone_1 -> Zone_4의 진행방향을 C, Zone_1 -> Zone_1의 진행방향을 D로 설정할 경우, 각 진행방향 A, B, C, D별로 이동 객체를 집계한다. 즉, 어느 검출 존에서 시작하더라도 최종적으로 진출입이 검출되는 검출 존에 따라 진행방향은 각각 A, B, C, D 임은 동일하며 변동되지 않는다. 다만, 시작 검출 존에 따라 직진, 좌회전, 우회전으로 주행방향은 달라질 수 있다. 따라서, 프로세서는 이동 객체의 진행방향(A, B, C, D)별 이동 객체 수를 계측하여 집계하고, 집계된 진행 방향별 이동량 정보를 표, 히스토그램 등으로 시각화하여 디스플레이부를 통해 출력할 수 있다. 이때, 진행방향별 이동량 정보는 이동 객체의 차종 및 이동 객체 수를 포함할 수 있으며, 이를 위해, 프로세서 는 미리 학습된 AI 모델을 통해 이동 객체의 형태를 추출하여 차종을 구별하여 분류할 수 있으며, 차종별로 이동 객체 수를 집계할 수 있다. 도 9는 본 발명의 일실시 형태에 따른 영상 기반 이동 객체 계측 시스템을 삼거리 교차로에 적용하여 이동 객체 를 계측하는 예를 나타낸 예시도이다. 도 9의 (a) 및 (b)에 도시된 바와 같이, 본 발명의 실시예에 따른 영상 기반 이동 객체 계측 시스템에 따르면, 삼거리 교차로 중 어느 하나의 도로에 검출 존을 Zone_1로 지정하고, Zone_1을 기준으로 반시계 방향으로 Zone_2, Zone_3을 각각 검출 존으로 지정한다. 그리고, Zone_1을 지나가는 진행방향은 제1 방향, Zone_2를 지나 가는 진행방향은 제2 방향, Zone_3을 지나가는 진행방향은 제3 방향으로 각각 설정할 수 있다. 그러면, 본 발명의 영상 기반 이동 객체 계측 시스템은, 이동 객체가 주행하는 위치를 영상데이터의 매 프레임 마다 추적함으로써 Zone_1에서 Zone_2로의 진출입이 검출되면, 이동 객체의 주행방향은 우회전이고, 진행방향은 제2 방향임을 추적할 수 있고, 제2 방향에 대한 이동 객체 수를 집계할 수 있다. 예를 들어, 도 9의 (a)의 경우, Zone_1에서 Zone_2로의 이동객체 진출입이 검출될 경우, 이동객체의 주행방향은 우회전이고, Zone_3에서 Zone_2로의 이동객체 진출입이 검출될 경우, 이동객체의 주행방향은 좌회전이지만, 두 이동 객체 모두 Zone_2을 지나는 진행방향이므로 제2 방향으로 이동 객체 수가 집계된다. 마찬가지로, 도 9의 (b)의 경우, Zone_1에서 Zone_2로의 이동객체 진출입이 검출될 경우, 이동객체의 주행방향 은 직진이고, Zone_3에서 Zone_2로의 이동객체 진출입이 검출될 경우, 이동객체의 주행방향은 좌회전이지만, 두 이동객체 모두 Zone_2을 지나는 진행방향이므로 제2 방향으로 이동 객체 수가 집계된다. 이때, 본 발명은 제2 진행방향으로 진입한 각 이동 객체의 차종을 구별하여 분류하고, 차종별로 이동 객체 수를 집계할 수 있다. 도 10은 본 발명의 일실시 형태에 따른 영상 기반 이동 객체 계측 시스템을 회전 교차로에 적용하여 이동 객체 를 계측하는 예를 나타낸 예시도이다. 도 10의 (a)에 도시된 바와 같이, 본 발명의 실시예에 따른 영상 기반 이동 객체 계측 시스템에 따르면, 회전 교차로 중 어느 하나의 도로에 검출 존을 Zone_1로 지정하고, Zone_1을 기준으로 반시계 방향으로 Zone_2, Zone_3, Zone_4를 각각 검출 존으로 지정한다. 그리고, Zone_1을 지나가는 진행방향은 제1 방향, Zone_2를 지나 가는 진행방향은 제2 방향, Zone_3을 지나가는 진행방향은 제3 방향, Zone_4를 지나가는 진행방향을 제4 방향으 로 각각 설정할 수 있다. 그러면, 본 발명의 영상 기반 이동 객체 계측 시스템은, 이동 객체(A)가 주행하는 위치를 영상데이터의 매 프레 임마다 추적함으로써 Zone_1에서 Zone_2로의 진출입이 검출되면, 이동 객체(A)의 진행방향은 제2 방향임을 추적 할 수 있고, 제2 방향에 대한 이동 객체 수를 집계할 수 있다. 회전 교차로의 경우, 도 10의 (b)에 도시된 바와 같이, 본 발명에 따른 시스템은, 이동 객체(A)가 우회전을 통 해 Zone_2, Zone_3 및 Zone_4으로 각각 진행함을 추적할 수 있다. 이처럼 Zone_1에서 Zone_2로의 진출입일 경우, Zone_3에서 Zone_2로의 진출입일 경우, Zone_4서 Zone_2로의 진 출입일 경우, 이동 객체의 주행방향은 모두 우회전이며, 세 이동 객체 모두 Zone_2을 지나는 진행방향이므로 제 2 방향으로 이동 객체 수가 집계된다. 이때, 본 발명은 제2 진행방향으로 진입한 각 이동 객체의 차종을 구별하여 분류하고, 차종별로 이동 객체 수를 집계할 수 있다."}
{"patent_id": "10-2022-0008279", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이상의 설명은 본 발명의 기술 사상을 예시적으로 설명한 것에 불과한 것으로서, 본 발명이 속하는 기술분야에 서 통상의 지식을 가진 자라면 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 다양한 수정 및 변형이 가 능할 것이다. 따라서, 본 발명에 개시된 실시예들은 본 발명의 기술 사상을 한정하기 위한 것이 아니라 설명하 기 위한 것이고, 이러한 실시예에 의하여 본 발명의 기술 사상의 범위가 한정되는 것은 아니다. 본 발명의 보호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술 사상은 본 발명의 권리범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2022-0008279", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시 형태에 따른 영상 기반 이동 객체 계측 시스템의 전체 구성을 개략적으로 도시한 블럭 도이다. 도 2는 본 발명의 일실시 형태에 따른 영상 기반 이동 객체 계측 시스템의 이동 객체 계측의 예를 나타낸 예시 도이다. 도 3은 본 발명의 일실시 형태에 따른 영상 기반 이동 객체 계측 시스템의 프로세서에서 동작하는 프로세스를 나타낸 기능 블럭도이다. 도 4 및 도 5는 본 발명의 일실시 형태에 따른 영상 기반 이동 객체 계측 시스템의 프로세서에서 수행하는 검출 존 지정(S122)에 대한 동작을 설명하기 위한 예시도이다. 도 6은 본 발명의 일실시 형태에 따른 영상 기반 이동 객체 계측 시스템의 프로세서에서 도로 검출 및 검출 존 지정을 수행하는 다른 실시예를 설명하기 위한 예시도이다. 도 7은 본 발명의 일실시 형태에 따른 영상 기반 이동 객체 계측 시스템의 프로세서에서 수행하는 이동객체 검 출(S123)에 대한 동작을 설명하기 위한 예시도이다. 도 8은 본 발명의 일실시 형태에 따른 영상 기반 이동 객체 계측 시스템의 프로세서에서 수행하는 진행방향 추 적(S124)에 대한 동작을 설명하기 위한 예시도이다. 도 9는 본 발명의 일실시 형태에 따른 영상 기반 이동 객체 계측 시스템을 삼거리 교차로에 적용하여 이동 객체 를 계측하는 예를 나타낸 예시도이다. 도 10은 본 발명의 일실시 형태에 따른 영상 기반 이동 객체 계측 시스템을 회전 교차로에 적용하여 이동 객체를 계측하는 예를 나타낸 예시도이다."}
