{"patent_id": "10-2022-0043131", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0144178", "출원번호": "10-2022-0043131", "발명의 명칭": "웹 기반 3차원 객체 편집 시스템 및 방법", "출원인": "주식회사 컬러버스", "발명자": "진세형"}}
{"patent_id": "10-2022-0043131", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "3차원 객체에 대한 모델 데이터를 저장하는 서비스 서버 및상기 서비스 서버로부터 상기 모델 데이터를 수신하고, 상기 수신한 모델 데이터를 렌더링하여 2차원 영상을 생성하고, 상기 생성된 2차원 영상을 스트리밍하는 렌더링 모듈을 포함하고,상기 서비스 서버는화면 중 적어도 일부에 상기 렌더링 서버로부터 스트리밍 되는 상기 2차원 영상을 표시하고, 상기 화면 중 적어도 일부에 상기 3차원 객체에 대한 편집 화면을 출력하고, 상기 편집 화면에 대한 사용자 조작에 따라 생성되는상기 3차원 객체에 대한 편집 명령을 상기 서비스 서버에 전송하는 기능을 포함하는 웹 페이지를 생성하여 사용자 단말기에 전송하는 것을 특징으로 하는 3차원 객체 편집 시스템."}
{"patent_id": "10-2022-0043131", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 서비스 서버는상기 3차원 객체의 편집 권한에 대한 정보를 저장하고, 상기 사용자 단말기로부터 수신되는 사용자 인증 정보를확인하여 상기 3차원 객체에 대한 편집 권한을 보유한 사용자의 편집 명령인지 확인하는 것을 특징으로 하는 3차원 객체 편집 시스템."}
{"patent_id": "10-2022-0043131", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 서비스 서버는복수의 사용자 단말기에 상기 웹 페이지를 전송하고, 상기 웹 페이지로부터 상기 3차원 객체에 대한 편집 명령을 수신하여 각각의 편집 명령을 상기 모델 데이터에 반영하는 것을 특징으로 하는 3차원 객체 편집 시스템."}
{"patent_id": "10-2022-0043131", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 서비스 서버는상기 편집 화면에 포함될 복수의 편집 모듈을 저장하고,상기 복수의 편집 모듈 중 사용자가 선택한 하나 이상의 편집 모듈과 상기 2차원 영상을 표시하는 모듈을 포함하도록 웹 페이지를 생성하는 것을 특징으로 하는 3차원 객체 편집 시스템."}
{"patent_id": "10-2022-0043131", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 서비스 서버는공개특허 10-2023-0144178-3-사용자 단말기로부터 웹 페이지에 포함될 편집 모듈을 수신하여 저장하고,상기 수신한 편집 모듈을 사용자가 선택하면, 상기 수신한 편집 모듈을 포함하도록 웹 페이지를 생성하는 것을 특징으로 하는 3차원 객체 편집 시스템."}
{"patent_id": "10-2022-0043131", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 사용자 서버는상기 사용자 단말기로부터 상기 편집 모듈을 수신하여 비인증 상태 정보와 함께 저장하고,상기 수신한 편집 모듈에 대한 인증 정보를 수신하면 상기 수신한 편집 모듈에 대한 비인증 상태 정보를 인증상태 정보로 변경하고,인증 상태 정보와 함께 저장된 편집 모듈만 사용자가 선택할 수 있도록 제공하는 것을 특징으로 하는 3차원 객체 편집 시스템."}
{"patent_id": "10-2022-0043131", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "서비스 서버 및 렌더링 모듈을 포함하는 3차원 객체 편집 시스템에서 동작하는 3차원 객체 편집 방법에 있어서,상기 서비스 서버에 3차원 객체에 대한 모델 데이터를 저장하는 모델 데이터 저장 단계;렌더링 모듈에서 상기 서비스 서버로부터 상기 모델 데이터를 수신하고, 상기 수신한 모델 데이터를 렌더링하여2차원 영상을 생성하고, 상기 생성된 2차원 영상을 스트리밍하는 렌더링 단계 및상기 서비스 서버에서 화면 중 적어도 일부에 상기 렌더링 서버로부터 스트리밍 되는 상기 2차원 영상을 표시하고, 상기 화면 중 적어도 일부에 상기 3차원 객체에 대한 편집 화면을 출력하고, 상기 편집 화면에 대한 사용자조작에 따라 생성되는 상기 3차원 객체에 대한 편집 명령을 상기 서비스 서버에 전송하는 기능을 포함하는 웹페이지를 생성하여 사용자 단말기에 전송하는 웹 페이지 전송 단계를 포함하는 3차원 객체 편집 방법."}
{"patent_id": "10-2022-0043131", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 서비스 서버에서 상기 3차원 객체의 편집 권한에 대한 정보를 저장하고, 상기 사용자 단말기로부터 수신되는 사용자 인증 정보를 확인하여 상기 3차원 객체에 대한 편집 권한을 보유한 사용자의 편집 명령인지 확인하는권한 확인 단계를 더 포함하는 것을 특징으로 하는 3차원 객체 편집 방법."}
{"patent_id": "10-2022-0043131", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 서비스 서버에서 복수의 사용자 단말기에 상기 웹 페이지를 전송하고, 상기 웹 페이지로부터 상기 3차원객체에 대한 편집 명령을 수신하여 각각의 편집 명령을 상기 모델 데이터에 반영하는 모델 데이터 편집 단계를 더 포함하는 것을 특징으로 하는 3차원 객체 편집 방법."}
{"patent_id": "10-2022-0043131", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 서비스 서버에서 상기 편집 화면에 포함될 복수의 편집 모듈을 저장하는 편집 모듈 저장 단계를 더 포함하고,상기 웹 페이지 전송 단계는 공개특허 10-2023-0144178-4-상기 복수의 편집 모듈 중 사용자가 선택한 하나 이상의 편집 모듈과 상기 2차원 영상을 표시하는 모듈을 포함하도록 웹 페이지를 생성하는 것을 특징으로 하는 3차원 객체 편집 방법."}
{"patent_id": "10-2022-0043131", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 편집 모듈 저장 단계는 상기 서비스 서버에서 사용자 단말기로부터 웹 페이지에 포함될 편집 모듈을 수신하여 저장하고,상기 웹 페이지 전송 단계는상기 수신한 편집 모듈을 사용자가 선택하면, 상기 수신한 편집 모듈을 포함하도록 웹 페이지를 생성하는 것을 특징으로 하는 3차원 객체 편집 방법."}
{"patent_id": "10-2022-0043131", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 편집 모듈 저장 단계는상기 사용자 단말기로부터 상기 편집 모듈을 수신하여 비인증 상태 정보와 함께 저장하고, 상기 수신한 편집 모듈에 대한 인증 정보를 수신하면 상기 수신한 편집 모듈에 대한 비인증 상태 정보를 인증 상태 정보로변경하고,상기 웹 페이지 전송 단계는 인증 상태 정보와 함께 저장된 편집 모듈만 사용자가 선택할 수 있도록 제공하는것을 특징으로 하는 3차원 객체 편집 방법."}
{"patent_id": "10-2022-0043131", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제7항 내지 제12항 중 어느 한 항의 방법을 컴퓨터가 실행하도록 기능시키기 위한 프로그램이 기록된 컴퓨터로읽을 수 있는 기록매체."}
{"patent_id": "10-2022-0043131", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 웹 기반의 3차원 객체 편집 시스템 및 방법에 관한 것으로, 3차원 객체에 대한 모델 데이터를 저장하 는 서비스 서버 및 상기 서비스 서버로부터 상기 모델 데이터를 수신하고, 상기 수신한 모델 데이터를 렌더링하 여 2차원 영상을 생성하고, 상기 생성된 2차원 영상을 스트리밍하는 렌더링 모듈을 포함하고, 상기 서비스 서버 는 화면 중 적어도 일부에 상기 렌더링 서버로부터 스트리밍 되는 상기 2차원 영상을 표시하고, 상기 화면 중 적 어도 일부에 상기 3차원 객체에 대한 편집 화면을 출력하고, 상기 편집 화면에 대한 사용자 조작에 따라 생성되 는 상기 3차원 객체에 대한 편집 명령을 상기 서비스 서버에 전송하는 기능을 포함하는 웹 페이지를 생성하여 사 용자 단말기에 전송하는 것을 특징으로 하는 3차원 객체 편집 시스템 및 그 시스템의 동작 방법을 제공한다."}
{"patent_id": "10-2022-0043131", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 3차원 객체 편집 시스템 및 방법에 관한 것으로, 웹 기반으로 3창차원 객체를 편집할 수 있는 편집 툴을 제공함으로써, 복수의 사용자가 동시에 3차원 객체를 편집할 수 있도록 하고, 편집 툴을 사용자가 자유롭 게 변경시키고, 필요한 기능을 추가하여 편집을 용이하게 할 수 있도록 하는 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2022-0043131", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "실세계와 가까운 3차원 그래픽 기술을 이용한 서비스가 늘어나서, 사용자가 3차원 아이템, 아바타 등 다양한 3 차원 객체를 직접 편집하고자 하는 요구가 늘어나고 있다. 그러나, 3차원 객체를 편집할 수 있도록 하는 편집 도구는 3차원 모델을 렌더링하여 실시간으로 편집자가 볼 수 있도록 제공해야 하기 때문에, 렌더링 모듈이 포함된 편집 프로그램을 단말기에 설치하여 해당 프로그램에서 제 공하는 기능만을 이용해 편집하는 것만이 가능하였다. 종래기술인 한국공개특허공보 제10-2015-0057100호, \"3D 객체 편집을 위한 전자 장치 및 방법\"에서도 3차원 객 체에 대한 편집 방법을 제공하고 있으나, 단말기 상에서 3차원 객체를 렌더링하여 제공하고, 정해진 편집 기능 을 이용한 편집만이 가능하기 때문에, 사용자가 원하는 편집 기능을 추가하거나, 복수의 사용자가 공동으로 편 집하는 것이 불가능하다. 따라서, 자유로운 3차원 객체 편집이 가능하도록 하는 기술이 요구된다.선행기술문헌 특허문헌 (특허문헌 0001) 한국공개특허공보 제10-2015-0057100호"}
{"patent_id": "10-2022-0043131", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 단말기에 별도의 프로그램을 설치하지 않고도 웹 기반으로 3차원 객체를 편집할 수 있도록 하는 것을 목적으로 한다. 본 발명은 단말기에서 3차원 모델을 렌더링하지 않고도 실시간으로 편집할 수 있도록 하여, 경량 단말기에서도 3차원 모델에 대한 편집이 가능하도록 하는 것을 목적으로 한다. 본 발명은 복수의 사용자가 하나의 3차원 객체 모델을 동시에 편집할 수 있도록 하는 것을 목적으로 한다. 본 발명은 3차원 객체 편집을 위한 편집 도구를 사용자의 필요에 따라 자유롭게 추가할 수 있도록 하는 것을 목 적으로 한다. 본 발명은 3차원 객체 편집을 위한 화면의 레이아웃을 사용자의 편의에 따라 자유롭게 조정할 수 있도록 하는 것을 목적으로 한다."}
{"patent_id": "10-2022-0043131", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이러한 목적을 달성하기 위하여 본 발명의 일실시예에 따른 3차원 객체 편집 시스템은 3차원 객체에 대한 모델 데이터를 저장하는 서비스 서버 및 상기 서비스 서버로부터 상기 모델 데이터를 수신하고, 상기 수신한 모델 데 이터를 렌더링하여 2차원 영상을 생성하고, 상기 생성된 2차원 영상을 스트리밍하는 렌더링 모듈을 포함하고, 상기 서비스 서버는 화면 중 적어도 일부에 상기 렌더링 서버로부터 스트리밍 되는 상기 2차원 영상을 표시하고, 상기 화면 중 적어도 일부에 상기 3차원 객체에 대한 편집 화면을 출력하고, 상기 편집 화면에 대한 사용자 조작에 따라 생성되는 상기 3차원 객체에 대한 편집 명령을 상기 서비스 서버에 전송하는 기능을 포함하 는 웹 페이지를 생성하여 사용자 단말기에 전송하도록 구성될 수 있다. 이 때, 상기 서비스 서버는 상기 3차원 객체의 편집 권한에 대한 정보를 저장하고, 상기 사용자 단말기로부터 수신되는 사용자 인증 정보를 확인하여 상기 3차원 객체에 대한 편집 권한을 보유한 사용자의 편집 명령인지 확 인할 수 있다. 또한, 상기 서비스 서버는 복수의 사용자 단말기에 상기 웹 페이지를 전송하고, 상기 웹 페이지로부터 상기 3차 원 객체에 대한 편집 명령을 수신하여 각각의 편집 명령을 상기 모델 데이터에 반영하도록 구성될 수 있다. 또한, 상기 서비스 서버는 상기 편집 화면에 포함될 복수의 편집 모듈을 저장하고, 상기 복수의 편집 모듈 중 사용자가 선택한 하나 이상의 편집 모듈과 상기 2차원 영상을 표시하는 모듈을 포함하도록 웹 페이지를 생성할 수 있다. 이 때, 상기 서비스 서버는 사용자 단말기로부터 웹 페이지에 포함될 편집 모듈을 수신하여 저장하고, 상기 수 신한 편집 모듈을 사용자가 선택하면, 상기 수신한 편집 모듈을 포함하도록 웹 페이지를 생성할 수 있다. 또한, 상기 사용자 서버는 상기 사용자 단말기로부터 상기 편집 모듈을 수신하여 비인증 상태 정보와 함께 저장 하고, 상기 수신한 편집 모듈에 대한 인증 정보를 수신하면 상기 수신한 편집 모듈에 대한 비인증 상태 정보를 인증 상태 정보로 변경하고, 인증 상태 정보와 함께 저장된 편집 모듈만 사용자가 선택할 수 있도록 제공할 수 있다."}
{"patent_id": "10-2022-0043131", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 단말기에 별도의 프로그램을 설치하지 않고도 웹 기반으로 3차원 객체를 편집할 수 있도록 하는 효과 를 얻을 수 있다.본 발명은 단말기에서 3차원 모델을 렌더링하지 않고도 실시간으로 편집할 수 있도록 하여, 경량 단말기에서도 3차원 모델에 대한 편집이 가능하도록 하는 효과를 얻을 수 있다. 본 발명은 복수의 사용자가 하나의 3차원 객체 모델을 동시에 편집할 수 있도록 하는 효과를 얻을 수 있다. 본 발명은 3차원 객체 편집을 위한 편집 도구를 사용자의 필요에 따라 자유롭게 추가할 수 있도록 하는 효과를 얻을 수 있다. 본 발명은 3차원 객체 편집을 위한 화면의 레이아웃을 사용자의 편의에 따라 자유롭게 조정할 수 있도록 하는 효과를 얻을 수 있다."}
{"patent_id": "10-2022-0043131", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 바람직한 실시예를 첨부된 도면들을 참조하여 상세히 설명한다. 본 발명을 설명함에 있어, 관 련된 공지 구성 또는 기능에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되는 경우에는 그 상 세한 설명은 생략하기로 한다. 또한 본 발명의 실시예들을 설명함에 있어 구체적인 수치는 실시예에 불과하며 이에 의하여 발명의 범위가 제한되지 아니한다. 본 발명에 따른 3차원 객체 편집 시스템은 중앙처리장치(CPU) 및 메모리(Memory, 기억장치)를 구비하고 인터넷 등의 통신망을 통하여 다른 단말기와 연결 가능한 서버 또는 단말의 형태로 구성될 수 있다. 그러나 본 발명이 중앙처리장치 및 메모리 등의 구성에 의해 한정되지는 아니한다. 또한, 본 발명에 따른 3차원 객체 편집 시스 템은 물리적으로 하나의 장치로 구성될 수도 있으며, 복수의 장치에 분산된 형태로 구현될 수도 있다. 도 1은 본 발명의 일실시예에 따른 3차원 객체 편집 시스템의 구성을 도시한 구성도이다. 본 발명의 일실시예에 따른 3차원 객체 편집 시스템은 서비스 서버 및 렌더링 모듈을 포함하여 구성될 수 있으며, 각각의 구성요소는 하나의 물리적인 장치 위에 설치되어 동작할 수도 있고, 물리적으로 별도 의 장치에 각각 설치되어 동작하는 것도 가능하다. 또한 각각 소프트웨어 모듈 또는 하드웨어 모듈을 이용하여 구성될 수 있으며, 이들의 결합된 형태로 구성되는 것도 가능하다. 서비스 서버는 3차원 객체에 대한 모델 데이터를 저장한다. 3차원 객체는 가상으로 설정된 3차원 공간 상 에서 존재하는 객체를 의미하는 것으로, 가상공간을 구성하는 지형, 아이템, 아바타 등 다양한 것들을 포함할 수 있다. 메타버스 등 가상공간을 활용한 서비스가 늘어나면서, 이와 같이 다양한 3차원 객체들을 가상공간에 서 사용하는 경우가 늘어나고 있으며, 사용자들이 자신의 개성 등을 표현하기 위하여, 지형, 아이템, 아바타 등 다양한 3차원 객체들을 직접 편집하고자 하는 경우가 늘어나고 있다. 서비스 서버에서 저장하는 3차원 객체에 대한 모델 데이터는 3차원 객체를 컴퓨터 시스템에서 이해할 수 있는 형태의 포맷으로 데이터화 한 것을 의미한다. 3차원 공간에 대한 서비스는 이와 같이 컴퓨터 시스템이 이 해할 수 있는 형태의 포맷으로 구성된 3차원 모델을 컴퓨터에서 읽어 이에 이를 특정 시점에서 바라보았을 때의 화면을 2차원 영상으로 생성하는 렌더링 작업을 거쳐 2차원 화면에 표시되게 된다. 3차원으로 영상을 표현하는 VR 기기 등에서는 동일한 모델에 대해서 두 개(양안)의 시점에서 2차원 영상을 생성하고, 이를 좌우의 눈을 통 해 확인하도록 함으로써, 입체적인 영상을 제공하게 된다. 서비스 서버는 이와 같이 저장한 3차원 객체를 사용자 단말기에서 편집할 수 있도록 하는 웹 페이지를 생 성하여 사용자 단말기에 전송할 수 있다. 웹 페이지는 HTML5 규격에 따라 구성될 수 있으며, HTML 태그와 함께자바스크립트(Javascript) 등의 로직을 처리할 수 있는 코드를 함께 포함시킴으로써, 사용자 단말기의 웹 브라 우저에서 이를 읽어 다양한 서비스를 제공하도록 할 수 있다. 서비스 서버에서 생성하여 사용자 단말기에 제공하는 웹 페이지는 웹 브라우저에 표시되는 화면에 대한 구 성을 포함할 수 있는데, 화면 중 적어도 일부에 렌더링 서버로부터 스트리밍되는 상기 저장된 3차원 객체 에 대해 렌더링된 2차원 영상을 표시할 수 있다. 렌더링 서버에서 2차원 영상을 실시간으로 스트리밍하고, 이에 대한 사용자의 편집 명령을 처리할 수 있도록 하기 위하여 웹 알티씨(Web-RTC; Web Real- Time Communication) 기술을 이용할 수 있다. 웹 알티씨 기술을 이용하면 실시간으로 화면을 표시하면서 이에 대한 사용자의 명령을 즉각적으로 반영하여 이 명령이 반영된 영상을 다시 실시간 스트리밍할 수 있기 때문에, 사용자 단말기에서 3차원 객체의 모델을 저장하고 직접 렌더링하여 화면에 표시할 필요 없이 웹 브라우저를 이 용하는 것만으로 3차원 객체의 영상을 확인하고 이에 대한 편집을 진행할 수 있게 된다. 또한, 서비스 서버에서 생성하여 사용자 단말기에 제공하는 웹 페이지는 화면 중 적어도 일부에 상기 3차 원 객체에 대한 편집 화면을 출력하고, 상기 편집 화면에 대한 사용자 조작에 따라 생성되는 상기 3차원 객체에 대한 편집 명령을 서비스 서버에 전송하는 기능을 포함할 수 있다. 상술한 바와 같이 웹 알티씨 기술 등 을 이용하면, 웹 페이지 상에서 사용자가 클릭, 드래그 등을 통해서 생성하는 편집 명령을 실시간으로 서비스 서버에 전송하여 3차원 객체에 대한 편집이 진행되도록 할 수 있다. 서비스 서버는 이와 같이 생성한 웹 페이지를 사용자 단말기로 전송하기 위하여 웹 서버를 포함하여 구성 될 수 있다. 웹 페이지 정보를 사용자 단말기에 전송하게 되면, 사용자 단말기는 이를 웹 브라우저를 통해 화 면에 표시하여 사용자가 이용하도록 할 수 있다. 이 때, 서비스 서버는 상기 3차원 객체의 편집 권한에 대한 정보를 저장하고, 상기 웹 페이지를 수신하는 사용자 단말기로부터 수신되는 사용자 인증 정보를 확인하여 상기 3차원 객체에 대한 편집 권한을 보유한 사용 자의 편집 명령인지 확인하고, 권한을 보유한 사용자의 편집 명령인 경우에만 이를 적용하도록 할 수 있다. 이 이전에 3차원 객체에 대한 편집 권한을 보유한 사용자의 사용자 단말기에 대해서만 상기 생성한 웹 페이지를 전 송하도록 구성함으로써, 3차원 객체에 대한 영상 조회 또는 편집 화면에 대한 확인부터 권한을 보유한 사용자만 가능하도록 할 수도 있다. 서비스 서버에 저장하는 3차원 객체에 대한 편집 권한에 대한 정보는 한 명의 사용자에 대한 정보만을 담 을 수도 있고, 복수의 사용자, 사용자 그룹에 대한 권한 정보를 담을 수도 있다. 상기 3차원 객체에 대한 소유 권한과 편집 권한은 구분될 수 있으며, 소유 권한을 가진 사용자가 다른 사용자 또는 다른 사용자 그룹에 편집 권한을 부여할 수 있도록 하는 것이 가능하고, 이와 같이 편집 권한을 부여받은 사용자가 상기 웹 페이지를 이 용하여 상기 3차원 객체를 편집하도록 할 수 있다. 사용자의 편집 권한은 세부적으로 구분될 수도 있는데, 특 정 편집 명령에 대해서 특정 사용자가 권한을 가지도록 할 수 있다. 예를 들어 3차원 객체에 대한 소유 권한을 가진 사용자는 모든 편집 권한을 가질 수 있으며, 이 사용자가 특정 사용자에게 3차원 객체의 형태 변경에 대한 권한을 부여하지 않고, 색상 변경에 대한 권한만 부여할 경우, 권한을 부여받은 사용자는 3차원 객체에 대한 색 상 변경만을 진행할 수 있다. 이와 같은 경우, 상기 권한을 부여받은 사용자의 사용자 단말기에 제공되는 웹 페이지에서는 색상 변경 이외의 편집 화면이 표시되지 않거나 비활성화되어 제공되도록 할 수 있다. 서비스 서버는 복수의 사용자 단말에 생성한 웹 페이지를 전송하고, 상기 웹 페이지로부터 상기 3차원 객 체에 대한 편집 명령을 수신하여 각각의 편집 명령을 상기 모델 데이터에 반영할 수 있다. 상술한 바와 같이 하나의 3차원 객체에 대한 편집 권한은 복수의 사용자 또는 사용자 그룹이 보유할 수 있으며, 이 경우, 권한을 가지는 복수의 사용자가 서비스 서버로부터 생성된 웹 페이지를 수신하여 편집에 참여할 수 있다. 이 경 우, 편집 명령에 따라 수정되는 3차원 객체에 대한 2차원 영상은 실시간으로 각 웹 페이지를 통해 사용자 단말 기의 웹 브라우저에 표시될 수 있으며, 이를 서로 확인하면서 실시간으로 3차원 객체를 동시에 편집하는 것이 가능하다. 이 때, 상술한 바와 같이, 사용자별로 부여받은 권한 등에 따라서 웹 페이지의 구성이 달라질 수 있으며, 동일 한 권한이라고 하더라도, 각각의 사용자가 자신의 편의에 따라 설정한 화면의 구성에 따라서 서로 다른 웹 페이 지를 수신하여 이용할 수 있다. 또한, 렌더링 모듈에서는 하나의 3차원 객체에 대해서 각각의 사용자의 사용자 단말에 스트리밍할 2차원 영상을 별도로 생성할 수 있으며, 이를 통해 사용자별로 서로 다른 각도에서 3 차원 객체를 확인하면서 편집할 수 있어, 공동 작업의 효율성을 극대화할 수 있다. 서비스 서버는 상기 웹 페이지의 편집 화면에 포함될 복수의 편집 모듈을 저장하고, 상기 복수의 편집 모 듈 중 사용자가 선택한 하나 이상의 편집 모듈과 상기 2차원 영상을 표시하는 모듈을 포함하도록 웹 페이지를 생성할 수 있다. 3차원 객체를 편집하는데 사용할 수 있는 도구는 매우 다양하게 구성될 수 있는데, 종래에는 사용자가 자신이 원하는 도구를 자유롭게 사용하기 어려웠고, 불필요한 도구들이 나열되어 있어, 효율적인 편집 이 어려웠다. 그러나 이와 같이 사용자가 각자 원하는 편집 모듈을 선택하여 웹 페이지를 구성하도록 하고, 이 를 통해 편집을 진행함으로써, 효율적인 편집이 가능할 수 있다. 웹 페이지를 구성하는 레이아웃 또한 사용자 가 자유롭게 선택할 수 있으며, 스트리밍되는 2차원 영상을 작게 표시하고 편집 화면을 크게 설정할 수도 있고, 2차원 영상을 대부분의 전체 화면에 표시하여 이를 확인하는 역할만을 수행하도록 할 수도 있다. 편집화면에 포 함되는 편집 모듈들도 원하는 만큼 자유롭게 설정할 수 있어, 편집 효율성을 최대한 높일 수 있다. 예를 들어, 사용자 A는 3차원 객체의 형태를 수정하기 위한 세부적인 편집 기능들을 포함하는 편집 모듈을 웹 페이지 화면에 포함시켜 편집을 진행하고, 사용자 B는 객체의 각 면에 대한 색상을 설정할 수 있는 색상 편집 모듈을 웹 페이지에 포함시켜 편집을 진행할 수 있다. 각각이 하나의 3차원 객체에 대해서 다른 역할로 편집을 진행하면서도 이 정보를 실시간으로 서로 확인할 수 있도록 하여 공동 편집의 효율성을 극대화하는 것이 가능하 다. 서비스 서버는 사용자 단말기로부터 웹 페이지에 포함될 편집 모듈을 수신하여 저장하고, 상기 수신한 편 집 모듈을 사용자가 선택하면 상기 수신한 편집 모듈을 포함하도록 웹 페이지를 생성할 수 있다. 웹 페이지에 포함되는 모듈은 표준 규격인 HTML5를 이용하여 구성되기 때문에, 서비스 서버에서 모든 편집 모듈을 준비 하여 제공하는 것이 아니라, 사용자가 스스로 자신에게 편리한 편집 모듈을 제작하여 사용할 수 있다. 이 경우 사용자가 제작한 편집 모듈을 서비스 서버에서 수신하고, 이를 해당 사용자의 웹 페이지에 반영하도록 할 수 있다. 이 때, 서비스 서버에서는 상기 사용자가 제작한 편집 모듈을 다른 사용자가 이용하도록 제공할 수도 있으 며, 이 경우 해당 편집 모듈을 제작한 사용자의 허락을 얻도록 구성할 수 있고, 해당 편집 모듈을 이용하여 발 생되는 비용의 전부 또는 일부를 상기 편집 모듈을 제작한 사용자에게 지급하도록 구성할 수 있다. 이를 통해 사용자들은 3차원 객체의 편집에 용이하게 사용될 수 있는 다양한 편집 모듈을 생성하여 공유함으로써, 편집의 효율성을 높이도록 할 수 있다. 서비스 서버는 사용자 단말기로부터 상기 편집 모듈을 수신하여 비인증 상태 정보와 함께 저장하고, 상기 수신한 편집 모듈에 대한 인증 정보를 수신하면 상기 수신한 편집 모듈에 대한 비인증 상태 정보를 인증 상태 정보로 변경하고, 인증 상태 정보와 함께 저장된 편집 모듈만 사용자가 선택할 수 있도록 제공할 수 있다. 사용자가 직접 제작한 편집 모듈의 경우 사용자의 고의 또는 실수로 인해 3차원 객체 편집 시스템에 악성 코드와 같이 작용할 수도 있다. 따라서 이와 같은 불필요한 반복문 등이 존재하는지 여부에 대한 인증 과정을 통과한 편집 모듈만을 웹 페이지에 포함시키도록 구성할 수 있다. 이 때, 인증 과정은 관리자가 지정한 룰 기 반(Rule-based) 알고리즘, 인공지능(AI) 등을 이용할 수도 있고, 관리자가 직접 편집 모듈을 구성하는 코드를 확인하여 문제될 부분이 없는지 체크하고 인증하도록 할 수도 있다. 렌더링 모듈은 서비스 서버로부터 상기 모델 데이터를 수신하고, 상기 수신한 모델 데이터를 렌더링 하여 2차원 영상을 생성하고, 상기 생성된 2차원 영상을 스트리밍한다. 모델 데이터는 이처럼 3차원 객체 편집 시스템 내에 존재하는 서비스 서버에서 렌더링 모듈로만 전달되고 사용자 단말에 전달되지 않도 록 구성될 수 있기 ?문에, 모델 데이터에 대한 보안을 더욱 강화할 수 있다. 렌더링 모듈은 경우에 따라서 사용자 단말에 프로그램 형태로 설치되어 동작하도록 할 수 있는데, 이 경우 서버에서 모델 데이터를 렌더링하기 위한 리소스를 별도로 할당하지 않아도, 사용자 단말에서 렌더링이 진행되 도록 할 수 있으며, 이와 같은 변형을 통해 서버 리소스를 사용하는 경우와 그렇지 않은 경우의 서비스 이용 비 용을 차별화하는 등 다양한 서비스 구성이 가능하다. 이처럼 사용자 단말기에 렌더링 모듈이 설치되더라 도, 동일하게 스트리밍 기술을 이용하여 웹 브라우저에 영상을 제공하기 때문에, 사용자는 웹 브라우저만으로 동일하게 서비스를 이용하는 것이 가능하게 된다. 렌더링 모듈은 상술한 바와 같이 웹 알티씨 기술을 이용하여 모델 데이터에 대한 렌더링을 통해 생성된 2 차원 영상을 스트리밍할 수 있는데, 이 때, 사용자 단말기가 VR 디바이스와 같이 양안 시차를 이용하여 3차원 영상을 제공할 수 있는 단말기인 경우 복수의 시점에 대한 렌더링 영상을 생성하여 이를 각각 스트리밍하도록 구성될 수 있다. 도 2는 본 발명의 일실시예에 따른 3차원 객체 편집 시스템에서 사용자 단말기에 표시되는 웹 페이지 화면의 레 이아웃을 도시한 도면이다. 도면에 도시한 바와 같이, 사용자 단말기의 웹 페이지 상에 서비스 서버에서 전송하는 웹 페이지를 표시할 수 있는데, 웹 페이지는 영상 표시 영역과 편집 화면 영역을 포함하여 구성될 수 있다. 도면부호 (a)에 표시된 것처럼, 영상 표시 영역이 좌측 상단에 표시되고 우측 및 하단부분에 다양한 편집 모듈들을 적용하여 넓은 편집 화면 영역을 사용하도록 구성할 수 있다. 또한 도면부호 (b)에 표시된 것처럼 좌측을 영상 표시 영역으로 사용하고, 우측을 편집 화면 영역으 로 구성하여 사용하는 것도 가능하고, 좌우를 서로 바꿔 화면을 구성하는 것도 가능하다. 앞서 설명한 바와 같이, 경우에 따라서는 공동 편집을 하면서 전체 화면을 이용하여 편집 과정에 대한 조회만이 가능하도록 전체 화면을 영상 표시 영역으로 구성할 수도 있다. 도 3은 본 발명의 일실시예에 따른 3차원 객체 편집 시스템에서 사용자 단말기에 표시되는 웹 페이지의 편집 모 듈 구성을 도시한 도면이다. 도면에 도시한 바와 같이, 사용자는 자신이 3차원 객체를 편집하기 위해 사용할 웹 페이지의 화면 구성을 자유 롭게 설정할 수 있을뿐 아니라, 사용할 편집 모듈도 다양하게 설정할 수 있다. 도면부호 (a)의 경우 사용자가 편집 모듈 1, 2 및 3(310 내지 330)을 사용하도록 설정한 경우로, 화면에 표시한 것과 같이 편집 모듈 1 및 2를 우측에, 편집 모듈 3을 하단에 표시할 수 있다. 또한 도면부호 (b)에 표시한 것 처럼 편집 모듈 4, 5 및 6(340 내지 360)을 사용하도록 구성하면서, 이를 모두 하단에 위치하도록 하는 것도 가 능하다. 이처럼 사용자가 다양한 화면 구성과 다양한 편집 모듈을 선택하여 사용할 수 있도록 하면서도, 각자 자신에게 맞는 편집 화면을 이용하여 3차원 객체를 동시에 편집할 수 있도록 하는 것이 가능하여, 3차원 객체에 대한 공 동 편집이 용이하도록 할 수 있다. 도 4는 본 발명의 일실시예에 따른 3차원 객체 편집 시스템에서 복수의 사용자 단말기에서 동시에 3차원 객체를 편집하는 경우의 일례를 도시한 도면이다. 도면에 도시한 바와 같이, 본 발명의 3차원 객체 편집 시스템은 복수의 사용자 단말에 연결되어 하나의 3 차원 객체에 대한 편집이 동시에 진행되도록 하는 것이 가능하다. 이 때, 도면에서와 같이 하나의 렌더링 모듈을 이용하여 각각의 사용자 단말에 3차원 객체에 대한 영상을 스트리밍할 수도 있고, 사용자 단말기 별로 서로 다른 렌더링 모듈을 적용하여 스트리밍하도록 할 수도 있 다. 또한, 앞서 설명한 바와 같이, 렌더링 모듈이 각각의 사용자 단말기에 설치되어 동작하도록 구성하는 것도 가능하고, 하나의 사용자 단말에 렌더링 모듈이 설치되고 이를 통해 다른 사용자 단말에도 영상을 스 트리밍 하는 구성도 가능하다. 또한, 화면에서와 같이 동일한 3차원 객체를 편집하는 여러 사용자 단말기에 표시되는 웹 페이지 화면은 각각의 사용자의 설정에 따라 서로 다른 화면 구성을 가질 수 있으며, 이를 통해 각자가 편한 방식으로 편집을 진행할 수 있어, 편집 효율을 극대화할 수 있다. 도 5는 본 발명의 일실시예에 따른 3차원 객체 편집 방법의 흐름을 도시한 흐름도이다. 본 발명에 따른 3차원 객체 편집 방법은 중앙처리장치(CPU) 및 메모리를 구비하는 3차원 객체 편집 시스템(10 1)에서 동작하는 방법에 관한 것으로, 이와 같은 컴퓨팅 시스템에서 동작하도록 소프트웨어 등을 이용하여 구현 될 수 있다. 따라서, 상술한 3차원 객체 편집 시스템에 대하여 설명된 특징적인 구성을 모두 포함하고 있으며, 아래의 설명에서 생략되어 설명되지 않은 내용도 상술한 메시지 전달 시스템에 대한 설명을 참조하여 구현될 수 있다. 단계 S501에서는 서비스 서버에 3차원 객체에 대한 모델 데이터를 저장한다. 3차원 객체는 가상으로 설정 된 3차원 공간 상에서 존재하는 객체를 의미하는 것으로, 가상공간을 구성하는 지형, 아이템, 아바타 등 다양한 것들을 포함할 수 있다. 메타버스 등 가상공간을 활용한 서비스가 늘어나면서, 이와 같이 다양한 3차원 객체들 을 가상공간에서 사용하는 경우가 늘어나고 있으며, 사용자들이 자신의 개성 등을 표현하기 위하여, 지형, 아이 템, 아바타 등 다양한 3차원 객체들을 직접 편집하고자 하는 경우가 늘어나고 있다.단계 S501에서 저장하는 3차원 객체에 대한 모델 데이터는 3차원 객체를 컴퓨터 시스템에서 이해할 수 있는 형 태의 포맷으로 데이터화 한 것을 의미한다. 3차원 공간에 대한 서비스는 이와 같이 컴퓨터 시스템이 이해할 수 있는 형태의 포맷으로 구성된 3차원 모델을 컴퓨터에서 읽어 이에 이를 특정 시점에서 바라보았을 때의 화면을 2차원 영상으로 생성하는 렌더링 작업을 거쳐 2차원 화면에 표시되게 된다. 3차원으로 영상을 표현하는 VR 기 기 등에서는 동일한 모델에 대해서 두 개(양안)의 시점에서 2차원 영상을 생성하고, 이를 좌우의 눈을 통해 확 인하도록 함으로써, 입체적인 영상을 제공하게 된다. 단계 S502에서는 서비스 서버로부터 상기 모델 데이터를 수신하고, 상기 수신한 모델 데이터를 렌더링하여 2차원 영상을 생성하고, 상기 생성된 2차원 영상을 스트리밍한다. 경우에 따라서 단계 S502는 사용자 단말에 프로그램 형태로 설치된 모듈을 통해 동작하도록 할 수 있는데, 이 경우 서버에서 모델 데이터를 렌더링하기 위 한 리소스를 별도로 할당하지 않아도, 사용자 단말에서 렌더링이 진행되도록 할 수 있으며, 이와 같은 변형을 통해 서버 리소스를 사용하는 경우와 그렇지 않은 경우의 서비스 이용 비용을 차별화하는 등 다양한 서비스 구 성이 가능하다. 이처럼 사용자 단말기에 렌더링 모듈이 설치되더라도, 동일하게 스트리밍 기술을 이용하 여 웹 브라우저에 영상을 제공하기 때문에, 사용자는 웹 브라우저만으로 동일하게 서비스를 이용하는 것이 가능 하게 된다. 단계 S503에서는 상기 3차원 객체의 편집 권한에 대한 정보를 서비스 서버에 저장하고, 상기 3차원 객체의 편집을 위한 웹 페이지를 수신하는 사용자 단말기로부터 수신되는 사용자 인증 정보를 확인하여 상기 3차원 객 체에 대한 편집 권한을 보유한 사용자의 편집 명령인지 확인하고, 권한을 보유한 사용자의 편집 명령인 경우에 만 이를 적용하도록 할 수 있다. 이 이전에 3차원 객체에 대한 편집 권한을 보유한 사용자의 사용자 단말기에 대해서만 상기 생성한 웹 페이지를 전송하도록 구성함으로써, 3차원 객체에 대한 영상 조회 또는 편집 화면에 대한 확인부터 권한을 보유한 사용자만 가능하도록 할 수도 있다. 단계 S503에서 서비스 서버에 저장하는 3차원 객체에 대한 편집 권한에 대한 정보는 한 명의 사용자에 대 한 정보만을 담을 수도 있고, 복수의 사용자, 사용자 그룹에 대한 권한 정보를 담을 수도 있다. 상기 3차원 객 체에 대한 소유 권한과 편집 권한은 구분될 수 있으며, 소유 권한을 가진 사용자가 다른 사용자 또는 다른 사용 자 그룹에 편집 권한을 부여할 수 있도록 하는 것이 가능하고, 이와 같이 편집 권한을 부여받은 사용자가 상기 웹 페이지를 이용하여 상기 3차원 객체를 편집하도록 할 수 있다. 사용자의 편집 권한은 세부적으로 구분될 수 도 있는데, 특정 편집 명령에 대해서 특정 사용자가 권한을 가지도록 할 수 있다. 예를 들어 3차원 객체에 대 한 소유 권한을 가진 사용자는 모든 편집 권한을 가질 수 있으며, 이 사용자가 특정 사용자에게 3차원 객체의 형태 변경에 대한 권한을 부여하지 않고, 색상 변경에 대한 권한만 부여할 경우, 권한을 부여받은 사용자는 3차 원 객체에 대한 색상 변경만을 진행할 수 있다. 이와 같은 경우, 상기 권한을 부여받은 사용자의 사용자 단말 기에 제공되는 웹 페이지에서는 색상 변경 이외의 편집 화면이 표시되지 않거나 비활성화되어 제공되도록 할 수 있다. 단계 S504에서는 상기 웹 페이지의 편집 화면에 포함될 복수의 편집 모듈을 저장하고, 상기 복수의 편집 모듈 중 사용자가 선택한 하나 이상의 편집 모듈과 상기 2차원 영상을 표시하는 모듈을 포함하도록 웹 페이지를 생성 할 수 있다. 3차원 객체를 편집하는데 사용할 수 있는 도구는 매우 다양하게 구성될 수 있는데, 종래에는 사용 자가 자신이 원하는 도구를 자유롭게 사용하기 어려웠고, 불필요한 도구들이 나열되어 있어, 효율적인 편집이 어려웠다. 그러나 이와 같이 사용자가 각자 원하는 편집 모듈을 선택하여 웹 페이지를 구성하도록 하고, 이를 통해 편집을 진행함으로써, 효율적인 편집이 가능할 수 있다. 웹 페이지를 구성하는 레이아웃 또한 사용자가 자유롭게 선택할 수 있으며, 스트리밍되는 2차원 영상을 작게 표시하고 편집 화면을 크게 설정할 수도 있고, 2 차원 영상을 대부분의 전체 화면에 표시하여 이를 확인하는 역할만을 수행하도록 할 수도 있다. 편집화면에 포 함되는 편집 모듈들도 원하는 만큼 자유롭게 설정할 수 있어, 편집 효율성을 최대한 높일 수 있다. 예를 들어, 사용자 A는 3차원 객체의 형태를 수정하기 위한 세부적인 편집 기능들을 포함하는 편집 모듈을 웹 페이지 화면에 포함시켜 편집을 진행하고, 사용자 B는 객체의 각 면에 대한 색상을 설정할 수 있는 색상 편집 모듈을 웹 페이지에 포함시켜 편집을 진행할 수 있다. 각각이 하나의 3차원 객체에 대해서 다른 역할로 편집을 진행하면서도 이 정보를 실시간으로 서로 확인할 수 있도록 하여 공동 편집의 효율성을 극대화하는 것이 가능하 다. 단계 S504에서는 사용자 단말기로부터 웹 페이지에 포함될 편집 모듈을 수신하여 저장하고, 상기 수신한 편집 모듈을 사용자가 선택하면 상기 수신한 편집 모듈을 포함하도록 웹 페이지를 생성할 수 있다. 웹 페이지에 포 함되는 모듈은 표준 규격인 HTML5를 이용하여 구성되기 때문에, 서비스 서버에서 모든 편집 모듈을 준비하여 제공하는 것이 아니라, 사용자가 스스로 자신에게 편리한 편집 모듈을 제작하여 사용할 수 있다. 이 경우 사용자가 제작한 편집 모듈을 서비스 서버에서 수신하고, 이를 해당 사용자의 웹 페이지에 반영하도록 할 수 있다. 이 때, 단계 S504에서는 상기 사용자가 제작한 편집 모듈을 다른 사용자가 이용하도록 제공할 수도 있으며, 이 경우 해당 편집 모듈을 제작한 사용자의 허락을 얻도록 구성할 수 있고, 해당 편집 모듈을 이용하여 발생되는 비용의 전부 또는 일부를 상기 편집 모듈을 제작한 사용자에게 지급하도록 구성할 수 있다. 이를 통해 사용자 들은 3차원 객체의 편집에 용이하게 사용될 수 있는 다양한 편집 모듈을 생성하여 공유함으로써, 편집의 효율성 을 높이도록 할 수 있다. 단계 S504에서는 사용자 단말기로부터 상기 편집 모듈을 수신하여 비인증 상태 정보와 함께 저장하고, 상기 수 신한 편집 모듈에 대한 인증 정보를 수신하면 상기 수신한 편집 모듈에 대한 비인증 상태 정보를 인증 상태 정 보로 변경하고, 인증 상태 정보와 함께 저장된 편집 모듈만 사용자가 선택할 수 있도록 제공할 수 있다. 사용자가 직접 제작한 편집 모듈의 경우 사용자의 고의 또는 실수로 인해 3차원 객체 편집 시스템에 악성 코드와 같이 작용할 수도 있다. 따라서 이와 같은 불필요한 반복문 등이 존재하는지 여부에 대한 인증 과정을 통과한 편집 모듈만을 웹 페이지에 포함시키도록 구성할 수 있다. 이 때, 인증 과정은 관리자가 지정한 룰 기 반(Rule-based) 알고리즘, 인공지능(AI) 등을 이용할 수도 있고, 관리자가 직접 편집 모듈을 구성하는 코드를 확인하여 문제될 부분이 없는지 체크하고 인증하도록 할 수도 있다. 단계 S505에서는 이와 같이 저장한 3차원 객체를 사용자 단말기에서 편집할 수 있도록 하는 웹 페이지를 생성하 여 사용자 단말기에 전송할 수 있다. 웹 페이지는 HTML5 규격에 따라 구성될 수 있으며, HTML 태그와 함께 자 바스크립트(Javascript) 등의 로직을 처리할 수 있는 코드를 함께 포함시킴으로써, 사용자 단말기의 웹 브라우 저에서 이를 읽어 다양한 서비스를 제공하도록 할 수 있다. 단계 S505에서 생성하여 사용자 단말기에 제공하는 웹 페이지는 웹 브라우저에 표시되는 화면에 대한 구성을 포 함할 수 있는데, 화면 중 적어도 일부에 렌더링 서버로부터 스트리밍되는 상기 저장된 3차원 객체에 대해 렌더링된 2차원 영상을 표시할 수 있다. 렌더링 서버에서 2차원 영상을 실시간으로 스트리밍하고, 이에 대한 사용자의 편집 명령을 처리할 수 있도록 하기 위하여 웹 알티씨(Web-RTC; Web Real-Time Communication) 기술을 이용할 수 있다. 웹 알티씨 기술을 이용하면 실시간으로 화면을 표시하면서 이에 대한 사용자의 명령을 즉각적으로 반영하여 이 명령이 반영된 영상을 다시 실시간 스트리밍할 수 있기 때문에, 사용자 단말기에서 3차 원 객체의 모델을 저장하고 직접 렌더링하여 화면에 표시할 필요 없이 웹 브라우저를 이용하는 것만으로 3차원 객체의 영상을 확인하고 이에 대한 편집을 진행할 수 있게 된다. 또한, 단계 S505에서 생성하여 사용자 단말기에 제공하는 웹 페이지는 화면 중 적어도 일부에 상기 3차원 객체 에 대한 편집 화면을 출력하고, 상기 편집 화면에 대한 사용자 조작에 따라 생성되는 상기 3차원 객체에 대한 편집 명령을 서비스 서버에 전송하는 기능을 포함할 수 있다. 상술한 바와 같이 웹 알티씨 기술 등을 이 용하면, 웹 페이지 상에서 사용자가 클릭, 드래그 등을 통해서 생성하는 편집 명령을 실시간으로 서비스 서버 에 전송하여 3차원 객체에 대한 편집이 진행되도록 할 수 있다. 단계 S505에서는 이와 같이 생성한 웹 페이지를 사용자 단말기로 전송하기 위하여 서비스 서버에 웹 서버 를 포함하여 구성될 수 있다. 웹 페이지 정보를 사용자 단말기에 전송하게 되면, 사용자 단말기는 이를 웹 브 라우저를 통해 화면에 표시하여 사용자가 이용하도록 할 수 있다. 단계 S506에서는 복수의 사용자 단말에 생성한 웹 페이지를 전송하고, 상기 웹 페이지로부터 상기 3차원 객체에 대한 편집 명령을 수신하여 각각의 편집 명령을 상기 모델 데이터에 반영할 수 있다. 상술한 바와 같이 하나의 3차원 객체에 대한 편집 권한은 복수의 사용자 또는 사용자 그룹이 보유할 수 있으며, 이 경우, 권한을 가지는 복수의 사용자가 서비스 서버로부터 생성된 웹 페이지를 수신하여 편집에 참여할 수 있다. 이 경우, 편집 명령에 따라 수정되는 3차원 객체에 대한 2차원 영상은 실시간으로 각 웹 페이지를 통해 사용자 단말기의 웹 브 라우저에 표시될 수 있으며, 이를 서로 확인하면서 실시간으로 3차원 객체를 동시에 편집하는 것이 가능하다. 이 때, 상술한 바와 같이, 사용자별로 부여받은 권한 등에 따라서 웹 페이지의 구성이 달라질 수 있으며, 동일 한 권한이라고 하더라도, 각각의 사용자가 자신의 편의에 따라 설정한 화면의 구성에 따라서 서로 다른 웹 페이 지를 수신하여 이용할 수 있다. 또한, 렌더링 모듈에서는 하나의 3차원 객체에 대해서 각각의 사용자의 사용자 단말에 스트리밍할 2차원 영상을 별도로 생성할 수 있으며, 이를 통해 사용자별로 서로 다른 각도에서 3 차원 객체를 확인하면서 편집할 수 있어, 공동 작업의 효율성을 극대화할 수 있다.본 발명에 따른 3차원 객체 편집 방법은 컴퓨터가 실행하도록 기능시키기 위한 프로그램으로 제작되어 컴퓨터로 읽을 수 있는 기록매체에 기록될 수 있다. 컴퓨터로 읽을 수 있는 기록 매체의 예에는, 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체, CDROM, DVD 와 같은 광기록 매체, 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical media), 및 ROM, RAM, 플래시 메모리 등과 같은 프로그램 명령어를 저장하고 수행하도록 특별히 구성된 하드웨 어 장치가 포함된다. 프로그램 명령어의 예에는, 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사 용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드도 포함된다. 상기 하드웨어 장치는 본 발명에 따른 처 리를 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지이다. 이상에서는 실시예들을 참조하여 설명하였지만, 해당 기술 분야의 숙련된 당업자는 하기의 특허 청구범위에 기 재된 본 발명의 사상 및 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수정 및 변경시킬 수 있 다."}
{"patent_id": "10-2022-0043131", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시예에 따른 3차원 객체 편집 시스템의 구성을 도시한 구성도이다. 도 2는 본 발명의 일실시예에 따른 3차원 객체 편집 시스템에서 사용자 단말기에 표시되는 웹 페이지 화면의 레 이아웃을 도시한 도면이다. 도 3은 본 발명의 일실시예에 따른 3차원 객체 편집 시스템에서 사용자 단말기에 표시되는 웹 페이지의 편집 모 듈 구성을 도시한 도면이다. 도 4는 본 발명의 일실시예에 따른 3차원 객체 편집 시스템에서 복수의 사용자 단말기에서 동시에 3차원 객체를 편집하는 경우의 일례를 도시한 도면이다. 도 5는 본 발명의 일실시예에 따른 3차원 객체 편집 방법의 흐름을 도시한 흐름도이다."}
