{"patent_id": "10-2024-7017387", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0110811", "출원번호": "10-2024-7017387", "발명의 명칭": "무선 통신 시스템에서 제1 장치가 제1 메시지를 전송하는 방법 및 이를 위한 장치", "출원인": "엘지전자 주식회사", "발명자": "김명섭"}}
{"patent_id": "10-2024-7017387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "무선 통신 시스템에서 제1 장치가 제1 메시지를 전송하는 방법에 있어서,센싱 정보를 획득하는 단계;설정 정보에 기반하여 제2 장치로부터 제1 위치 정보 및 제1 타입 정보가 포함된 제2 메시지를 수신하는 단계; 상기 제2 메시지를 전달하기 위한 상기 제1 메시지를 전송하는 단계를 포함하고,상기 설정 정보는 사이드링크 신호에 대한 제1 설정 정보 또는 업링크 신호에 대한 제2 설정 정보를 포함하고,상기 제1 설정 정보는 상기 사이드링크 신호의 송수신을 위한 자원 풀에 대한 정보, 전송 전력 제어 파라미터및 서브 채널들에 대한 정보를 포함하고, 상기 제2 설정 정보는 서브캐리어 스페이싱, 자원 블록 크기, 전송 전력 제어 파라미터, 및 주파수 대역에 대한정보를 포함하고,상기 제2 메시지는 상기 설정 정보가 상기 제2 설정 정보인 것에 기초하여 PSCCH (Physical Sidelink ControlChannel) 및 PSSCH (Physical Sidelink Shared Channel) 중 적어도 하나에 기반하여 전송되고,상기 제1 장치는 상기 센싱 정보에 포함된 영상 및 상기 제2 메시지를 인공 신경망에 기반한 검출 모델에 입력하여 객체 정보를 획득하고, 상기 객체 정보 및 제2 메시지에 기초하여 상기 제1 메시지를 전송하며,상기 검출 모델은 상기 영상에 대해 추출된 특징들 및 상기 제1 위치 정보에 기반하여 적어도 하나의 검출 영역을 예측하고, 상기 적어도 하나의 검출 영역에 대해 상기 제1 타입 정보와 대응한 객체 정보가 출력되도록 미리학습된, 방법."}
{"patent_id": "10-2024-7017387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,상기 적어도 하나의 검출 영역은 상기 제1 위치 정보 및 미리 설정된 범위에 기반하여 예측되는 것을 특징으로하는, 방법."}
{"patent_id": "10-2024-7017387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 적어도 하나의 검출 영역은 상기 영상으로부터 추출된 상기 특징들에 기반하여 결정된 복수의 검출 영역들중에서 상기 제2 메시지에 포함된 위치 정보로부터 미리 설정됨 범위 내에 있는 검출 영역인 것을 특징으로 하는, 방법."}
{"patent_id": "10-2024-7017387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 적어도 하나의 검출 영역에 기반하여 추정된 객체 높이가 상기 타입 정보에 기반한 객체 높이로부터 미리설정된 범위를 벗어난 것에 기초하여, 상기 적어도 하나의 검출 영역은 상기 검출 모델의 학습을 위한 데이터로이용되지 않는 것을 특징으로 하는, 방법."}
{"patent_id": "10-2024-7017387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 객체 높이는 다른 검출 영역과 오버랩된 상기 적어도 하나의 검출 영역에 대해서만 추정되는 것을 특징으로 하는, 방법.공개특허 10-2024-0110811-3-청구항 6 제1항에 있어서,상기 객체 정보는 검출된 객체의 제2 타입 정보 및 제2 위치 정보를 포함하는 것을 특징으로 하는, 방법."}
{"patent_id": "10-2024-7017387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 제1 타입 정보와 상기 제2 타입 정보가 상이한 것에 기초하여 상기 제1 메시지는 상기 제2 타입 정보에 기반하여 보정된 상기 제1 타입 정보를 포함하는 것을 특징으로 하는, 방법."}
{"patent_id": "10-2024-7017387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 제1 위치 정보가 상기 제2 위치 정보와 상이한 것에 기초하여, 상기 제1 메시지는 상기 제2 위치 정보에기반하여 보정된 상기 제1 위치 정보를 포함하는 것을 특징으로 하는, 방법."}
{"patent_id": "10-2024-7017387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 제1 장치는 상기 제2 메시지에 포함된 타입 정보를 상기 검출 모델의 학습을 위한 라벨 정보로 이용하는것을 특징으로 하는, 방법."}
{"patent_id": "10-2024-7017387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 검출 모델은 R-CNN (Regions with Convolutional Neuron Network)에 기반하여 상기 객체 정보를 출력하는것을 특징으로 하는, 방법."}
{"patent_id": "10-2024-7017387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1 항에 있어서,상기 제2 메시지는 V2X (Vehicle To Everything) 메시지인 것을 특징으로 하는, 방법."}
{"patent_id": "10-2024-7017387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "무선 통신 시스템에서 제1 메시지를 전송하는 제1 장치에 있어서,RF(Radio Frequency) 송수신기; 및상기 RF 송수신기와 연결되는 프로세서를 포함하고,상기 프로세서는 센싱 정보를 획득하고, 상기 RF 송수신기를 제어하여 설정 정보에 기반하여 제2 장치로부터 제1 위치 정보 및 제1 타입 정보가 포함된 제2 메시지를 수신하고, 상기 센싱 정보에 포함된 영상 및 상기 제2 메시지를 인공 신경망에 기반한 검출 모델에 입력하여 객체 정보를 획득하고, 상기 객체 정보 및 제2 메시지에 기초하여 상기 제2 메시지를 전달하기 위한 상기 제1 메시지를 전송하며,상기 설정 정보는 사이드링크 신호에 대한 제1 설정 정보 또는 업링크 신호에 대한 제2 설정 정보를 포함하고,상기 제1 설정 정보는 상기 사이드링크 신호의 송수신을 위한 자원 풀에 대한 정보, 전송 전력 제어 파라미터및 서브 채널들에 대한 정보를 포함하고, 상기 제2 설정 정보는 서브캐리어 스페이싱, 자원 블록 크기, 전송 전력 제어 파라미터, 및 주파수 대역에 대한정보를 포함하고,상기 제2 메시지는 상기 설정 정보가 상기 제2 설정 정보인 것에 기초하여 PSCCH (Physical Sidelink ControlChannel) 및 PSSCH (Physical Sidelink Shared Channel) 중 적어도 하나에 기반하여 전송되고,공개특허 10-2024-0110811-4-상기 검출 모델은 상기 영상에 대해 추출된 특징들 및 상기 제1 위치 정보에 기반하여 적어도 하나의 검출 영역을 예측하고, 상기 적어도 하나의 검출 영역에 대해 상기 제1 타입 정보와 대응한 객체 정보가 출력되도록 미리학습된, 제1 장치."}
{"patent_id": "10-2024-7017387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 적어도 하나의 검출 영역은 상기 제2 메시지에 포함된 위치 정보 및 미리 설정된 범위에 기반하여 예측되는 것을 특징으로 하는, 제1 장치."}
{"patent_id": "10-2024-7017387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "무선통신시스템에서 제1 메시지를 전송하는 칩 셋에 있어서,적어도 하나의 프로세서; 및상기 적어도 하나의 프로세서와 동작 가능하게 연결되고, 실행될 때, 상기 적어도 하나의 프로세서가 동작을 수행하도록 하는 적어도 하나의 메모리를 포함하며, 상기 동작은:센싱 정보를 획득하고, 상기 RF 송수신기를 제어하여 설정 정보에 기반하여 제2 장치로부터 제1 위치 정보 및제1 타입 정보가 포함된 제2 메시지를 수신하고, 상기 센싱 정보에 포함된 영상 및 상기 제2 메시지를 인공 신경망에 기반한 검출 모델에 입력하여 객체 정보를 획득하고, 상기 객체 정보 및 제2 메시지에 기초하여 상기 제2 메시지를 전달하기 위한 상기 제1 메시지를 전송하며,상기 설정 정보는 사이드링크 신호에 대한 제1 설정 정보 또는 업링크 신호에 대한 제2 설정 정보를 포함하고,상기 제1 설정 정보는 상기 사이드링크 신호의 송수신을 위한 자원 풀에 대한 정보, 전송 전력 제어 파라미터및 서브 채널들에 대한 정보를 포함하고, 상기 제2 설정 정보는 서브캐리어 스페이싱, 자원 블록 크기, 전송 전력 제어 파라미터, 및 주파수 대역에 대한정보를 포함하고,상기 제2 메시지는 상기 설정 정보가 상기 제2 설정 정보인 것에 기초하여 PSCCH (Physical Sidelink ControlChannel) 및 PSSCH (Physical Sidelink Shared Channel) 중 적어도 하나에 기반하여 전송되고,상기 검출 모델은 상기 영상에 대해 추출된 특징들 및 상기 제1 위치 정보에 기반하여 적어도 하나의 검출 영역을 예측하고, 상기 적어도 하나의 검출 영역에 대해 상기 제1 타입 정보와 대응한 객체 정보가 출력되도록 미리학습된, 칩셋."}
{"patent_id": "10-2024-7017387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "무선통신시스템에서 적어도 하나의 컴퓨터 프로그램을 포함하는 컴퓨터 판독 가능한 저장 매체에 있어서,적어도 하나의 프로세서가 제1 메시지를 전송하는 동작을 수행하도록 하는 적어도 하나의 컴퓨터 프로그램; 및상기 적어도 하나의 컴퓨터 프로그램이 저장된 컴퓨터 판독 가능한 저장 매체를 포함하고,상기 동작은 센싱 정보를 획득하고, 상기 RF 송수신기를 제어하여 설정 정보에 기반하여 제2 장치로부터 제1 위치 정보 및 제1 타입 정보가 포함된 제2 메시지를 수신하고, 상기 센싱 정보에 포함된 영상 및 상기 제2 메시지를 인공 신경망에 기반한 검출 모델에 입력하여 객체 정보를 획득하고, 상기 객체 정보 및 제2 메시지에 기초하여 상기 제2 메시지를 전달하기 위한 상기 제1 메시지를 전송하며,상기 설정 정보는 사이드링크 신호에 대한 제1 설정 정보 또는 업링크 신호에 대한 제2 설정 정보를 포함하고,상기 제1 설정 정보는 상기 사이드링크 신호의 송수신을 위한 자원 풀에 대한 정보, 전송 전력 제어 파라미터및 서브 채널들에 대한 정보를 포함하고, 상기 제2 설정 정보는 서브캐리어 스페이싱, 자원 블록 크기, 전송 전력 제어 파라미터, 및 주파수 대역에 대한정보를 포함하고,상기 제2 메시지는 상기 설정 정보가 상기 제2 설정 정보인 것에 기초하여 PSCCH (Physical Sidelink Control공개특허 10-2024-0110811-5-Channel) 및 PSSCH (Physical Sidelink Shared Channel) 중 적어도 하나에 기반하여 전송되고,상기 검출 모델은 상기 영상에 대해 추출된 특징들 및 상기 제1 위치 정보에 기반하여 적어도 하나의 검출 영역을 예측하고, 상기 적어도 하나의 검출 영역에 대해 상기 제1 타입 정보와 대응한 객체 정보가 출력되도록 미리학습된, 컴퓨터 판독 가능한 저장 매체."}
{"patent_id": "10-2024-7017387", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "다양한 실시예에 따른 제1 장치가 제1 메시지를 전송하는 방법 및 이를 위한 장치를 개시한다. 상기 영상에 대해 추출된 특징들 및 상기 제1 위치 정보에 기반하여 적어도 하나의 검출 영역을 예측하고, 상기 적어도 하나의 검 출 영역에 대해 상기 제1 타입 정보와 대응한 객체 정보가 출력되도록 미리 학습된 검출 모델로부터 획득한 객체 정보 및 수신된 제2 메시지에 기반하여 제1 메시지를 전송하는 방법 및 이를 위한 장치가 개시된다."}
{"patent_id": "10-2024-7017387", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "무선통신시스템에서 제1 장치가 학습된 검출 모델에 기반하여 획득한 객체 정보 및 수신된 제2 메시지에 기반하 여 제1 메시지를 전송하는 방법 및 이를 위한 장치에 대한 것이다."}
{"patent_id": "10-2024-7017387", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "무선 통신 시스템은 가용한 시스템 자원(예를 들어, 대역폭, 전송 전력 등)을 공유하여 다중 사용자와의 통신을 지원하는 다중 접속(multiple access) 시스템이다. 다중 접속 시스템의 예로는 CDMA(code division multiple access) 시스템, FDMA(frequency division multiple access) 시스템, TDMA(time division multiple access) 시스템, OFDMA(orthogonal frequency division multiple access) 시스템, SC-FDMA(single carrier frequency division multiple access) 시스템, MC-FDMA(multi carrier frequency division multiple access) 시스템 등 이 있다. 사이드링크(sidelink, SL)란 단말(User Equipment, UE)들 간에 직접적인 링크를 설정하여, 기지국(Base Station, BS)을 거치지 않고, 단말 간에 음성 또는 데이터 등을 직접 주고 받는 통신 방식을 말한다. SL는 급속 도로 증가하는 데이터 트래픽에 따른 기지국의 부담을 해결할 수 있는 하나의 방안으로서 고려되고 있다. V2X(vehicle-to-everything)는 유/무선 통신을 통해 다른 차량, 보행자, 인프라가 구축된 사물 등과 정보를 교 환하는 통신 기술을 의미한다. V2X는 V2V(vehicle-to-vehicle), V2I(vehicle-to-infrastructure), V2N(vehicle-to- network) 및 V2P(vehicle-to-pedestrian)와 같은 4 가지 유형으로 구분될 수 있다. V2X 통신 은 PC5 인터페이스 및/또는 Uu 인터페이스를 통해 제공될 수 있다. 한편, 더욱 많은 통신 기기들이 더욱 큰 통신 용량을 요구하게 됨에 따라, 기존의 무선 액세스 기술(Radio Access Technology, RAT)에 비해 향상된 모바일 광대역 (mobile broadband) 통신에 대한 필요성이 대두되고 있 다. 이에 따라, 신뢰도(reliability) 및 지연(latency)에 민감한 서비스 또는 단말을 고려한 통신 시스템이 논 의되고 있는데, 개선된 이동 광대역 통신, 매시브 MTC(Machine Type Communication), URLLC(Ultra-Reliable and Low Latency Communication) 등을 고려한 차세대 무선 접속 기술을 새로운 RAT(new radio access technology) 또는 NR(new radio)이라 칭할 수 있다. NR에서도 V2X(vehicle-to-everything) 통신이 지원될 수 있다. 도 1은 NR 이전의 RAT에 기반한 V2X 통신과 NR에 기반한 V2X 통신을 비교하여 설명하기 위한 도면이다 V2X 통신과 관련하여, NR 이전의 RAT에서는 BSM(Basic Safety Message), CAM(Cooperative Awareness Message), DENM(Decentralized Environmental Notification Message)과 같은 V2X 메시지를 기반으로, 안전 서비스(safety service)를 제공하는 방안이 주로 논의되었다. V2X 메시지는, 위치 정보, 동적 정보, 속성 정보 등을 포함할 수 있다. 예를 들어, 단말은 주기적인 메시지(periodic message) 타입의 CAM, 및/또는 이벤트 트리거 메시지(event triggered message) 타입의 DENM을 다른 단말에게 전송할 수 있다. 예를 들어, CAM은 방향 및 속도와 같은 차량의 동적 상태 정보, 치수와 같은 차량 정적 데이터, 외부 조명 상태, 경로 내역 등 기본 차량 정보를 포함할 수 있다. 예를 들어, 단말은 CAM을 방송할 수 있으며, CAM의 지연 (latency)은 100ms보다 작을 수 있다. 예를 들어, 차량의 고장, 사고 등의 돌발적인 상황이 발행하는 경우, 단 말은 DENM을 생성하여 다른 단말에게 전송할 수 있다. 예를 들어, 단말의 전송 범위 내에 있는 모든 차량은 CAM 및/또는 DENM을 수신할 수 있다. 이 경우, DENM은 CAM 보다 높은 우선 순위를 가질 수 있다. 이후, V2X 통신과 관련하여, 다양한 V2X 시나리오들이 NR에서 제시되고 있다. 예를 들어, 다양한 V2X 시나리오 들은, 차량 플라투닝(vehicle platooning), 향상된 드라이빙(advanced driving), 확장된 센서들(extended sensors), 리모트 드라이빙(remote driving) 등을 포함할 수 있다. 예를 들어, 차량 플라투닝을 기반으로, 차량들은 동적으로 그룹을 형성하여 함께 이동할 수 있다. 예를 들어, 차량 플라투닝에 기반한 플라툰 동작들(platoon operations)을 수행하기 위해, 상기 그룹에 속하는 차량들은 선 두 차량으로부터 주기적인 데이터를 수신할 수 있다. 예를 들어, 상기 그룹에 속하는 차량들은 주기적인 데이터 를 이용하여, 차량들 사이의 간격을 줄이거나 넓힐 수 있다. 예를 들어, 향상된 드라이빙을 기반으로, 차량은 반자동화 또는 완전 자동화될 수 있다. 예를 들어, 각 차량은 근접 차량 및/또는 근접 로지컬 엔티티(logical entity)의 로컬 센서(local sensor)에서 획득된 데이터를 기반 으로, 궤도(trajectories) 또는 기동(maneuvers)을 조정할 수 있다. 또한, 예를 들어, 각 차량은 근접한 차량들 과 드라이빙 인텐션(driving intention)을 상호 공유할 수 있다. 예를 들어, 확장 센서들을 기반으로, 로컬 센서들을 통해 획득된 로 데이터(raw data) 또는 처리된 데이터 (processed data), 또는 라이브 비디오 데이터(live video data)는 차량, 로지컬 엔티티, 보행자들의 단말 및/ 또는 V2X 응용 서버 간에 상호 교환될 수 있다. 따라서, 예를 들어, 차량은 자체 센서를 이용하여 감지할 수 있 는 환경 보다 향상된 환경을 인식할 수 있다. 예를 들어, 리모트 드라이빙을 기반으로, 운전을 하지 못하는 사람 또는 위험한 환경에 위치한 리모트 차량을 위해, 리모트 드라이버 또는 V2X 애플리케이션은 상기 리모트 차량을 동작 또는 제어할 수 있다. 예를 들어, 대 중 교통과 같이 경로를 예측할 수 있는 경우, 클라우드 컴퓨팅 기반의 드라이빙이 상기 리모트 차량의 동작 또 는 제어에 이용될 수 있다. 또한, 예를 들어, 클라우드 기반의 백엔드 서비스 플랫폼(cloud-based back-end service platform)에 대한 액세스가 리모트 드라이빙을 위해 고려될 수 있다. 한편, 차량 플라투닝, 향상된 드라이빙, 확장된 센서들, 리모트 드라이빙 등 다양한 V2X 시나리오들에 대한 서 비스 요구사항(service requirements)들을 구체화하는 방안이 NR에 기반한 V2X 통신에서 논의되고 있다."}
{"patent_id": "10-2024-7017387", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "해결하고자 하는 과제는 영상 및 상기 영상과 연관 메시지에 포함된 정보를 이용하여 상기 영상에 객체 검출과 관련된 검출 영역을 신속하게 예측하고, 상기 메시지에 포함된 정보 및 상기 예측된 검출 영역에 대한 분류 정 보 간의 비교를 통해 보다 정확하고 신속하게 상기 영상에서 객체를 검출하는 검출 모델을 학습시키는 방법 및 장치를 제공하는 것이다. 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급하지 않은 또 다른 기술적 과제들은"}
{"patent_id": "10-2024-7017387", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2024-7017387", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 측면에 따른 무선 통신 시스템에서 제1 장치가 제1 메시지를 전송하는 방법은 센싱 정보를 획득하고, 설정 정보에 기반하여 제2 장치로부터 제1 위치 정보 및 제1 타입 정보가 포함된 제2 메시지를 수신하며, 상기 제2 메시지를 전달하기 위한 상기 제1 메시지를 전송하고, 상기 설정 정보는 사이드링크 신호에 대한 제1 설정 정보 또는 업링크 신호에 대한 제2 설정 정보를 포함하고, 상기 제1 설정 정보는 상기 사이드링크 신호의 송수신을 위한 자원 풀에 대한 정보, 전송 전력 제어 파라미터 및 서브 채널들에 대한 정보를 포함하고, 상기 제2 설정 정보는 서브캐리어 스페이싱, 자원 블록 크기, 전송 전력 제어 파라미터, 및 주파수 대역에 대한 정보를 포함하 며, 상기 제2 메시지는 상기 설정 정보가 상기 제2 설정 정보인 것에 기초하여 PSSCH 및 PSCCH 중 적어도 하나 에 기반하여 전송되고, 상기 제1 장치는 상기 센싱 정보에 포함된 영상 및 상기 제2 메시지를 인공 신경망에 기 반한 검출 모델에 입력하여 객체 정보를 획득하고, 상기 객체 정보 및 제2 메시지에 기초하여 상기 제1 메시지 를 전송하며, 상기 검출 모델은 상기 영상에 대해 추출된 특징들 및 상기 제1 위치 정보에 기반하여 적어도 하 나의 검출 영역을 예측하고, 상기 적어도 하나의 검출 영역에 대해 상기 제1 타입 정보와 대응한 객체 정보가 출력되도록 미리 학습될 수 있다. 또는, 상기 적어도 하나의 검출 영역은 상기 제1 위치 정보 및 미리 설정된 범위에 기반하여 예측되는 것을 특 징으로 한다. 또는, 상기 적어도 하나의 검출 영역은 상기 영상으로부터 추출된 상기 특징들에 기반하여 결정된 복수의 검출 영역들 중에서 상기 제2 메시지에 포함된 위치 정보로부터 미리 설정됨 범위 내에 있는 검출 영역인 것을 특징으로 한다. 또는, 상기 적어도 하나의 검출 영역에 기반하여 추정된 객체 높이가 상기 타입 정보에 기반한 객체 높이로부터 미리 설정된 범위를 벗어난 것에 기초하여, 상기 적어도 하나의 검출 영역은 상기 검출 모델의 학습을 위한 데 이터로 이용되지 않는 것을 특징으로 한다. 또는, 상기 객체 높이는 다른 검출 영역과 오버랩된 상기 적어도 하나의 검출 영역에 대해서만 추정되는 것을 특징으로 한다. 또는, 상기 객체 정보는 검출된 객체의 제2 타입 정보 및 제2 위치 정보를 포함하는 것을 특징으로 한다. 또는, 상기 제1 타입 정보와 상기 제2 타입 정보가 상이한 것에 기초하여 상기 제1 메시지는 상기 제2 타입 정 보에 기반하여 보정된 상기 제1 타입 정보를 포함하는 것을 특징으로 한다. 또는, 상기 제1 위치 정보가 상기 제2 위치 정보와 상이한 것에 기초하여, 상기 제1 메시지는 상기 제2 위치 정 보에 기반하여 보정된 상기 제1 위치 정보를 포함하는 것을 특징으로 한다. 또는, 상기 제1 장치는 상기 메시지에 포함된 타입 정보를 상기 검출 모델의 학습을 위한 라벨 정보로 이용하는 것을 특징으로 한다. 또는, 상기 검출 모델은 R-CNN (Regions with Convolutional Neuron Network)에 기반하여 상기 객체 정보를 출 력하는 것을 특징으로 한다. 또는, 상기 제2 메시지는 V2X (Vehicle To Everything) 메시지인 것을 특징으로 한다. 다른 측면에 따르면, 무선 통신 시스템에서 제1 메시지를 전송하는 제1 장치는, RF(Radio Frequency) 송수신기, 및 상기 RF 송수신기와 연결되는 프로세서를 포함하고, 상기 프로세서는 센싱 정보를 획득하고, 상기 RF 송수신 기를 제어하여 설정 정보에 기반하여 제2 장치로부터 제1 위치 정보 및 제1 타입 정보가 포함된 제2 메시지를 수신하고, 상기 센싱 정보에 포함된 영상 및 상기 제2 메시지를 인공 신경망에 기반한 검출 모델에 입력하여 객 체 정보를 획득하고, 상기 객체 정보 및 제2 메시지에 기초하여 상기 제2 메시지를 전달하기 위한 상기 제1 메 시지를 전송하며, 상기 설정 정보는 사이드링크 신호에 대한 제1 설정 정보 또는 업링크 신호에 대한 제2 설정 정보를 포함하고, 상기 제1 설정 정보는 상기 사이드링크 신호의 송수신을 위한 자원 풀에 대한 정보, 전송 전 력 제어 파라미터 및 서브 채널들에 대한 정보를 포함하며, 상기 제2 설정 정보는 서브캐리어 스페이싱, 자원 블록 크기, 전송 전력 제어 파라미터, 및 주파수 대역에 대한 정보를 포함하고, 상기 제2 메시지는 상기 설정 정보가 상기 제2 설정 정보인 것에 기초하여 PSSCH 및 PSCCH 중 적어도 하나에 기반하여 전송되고, 상기 검출 모델은 상기 영상에 대해 추출된 특징들 및 상기 제1 위치 정보에 기반하여 적어도 하나의 검출 영역을 예측하 고, 상기 적어도 하나의 검출 영역에 대해 상기 제1 타입 정보와 대응한 객체 정보가 출력되도록 미리 학습될 수 있다. 또는, 상기 적어도 하나의 검출 영역은 상기 제2 메시지에 포함된 위치 정보 및 미리 설정된 범위에 기반하여 예측되는 것을 특징으로 한다. 다른 측면에 따르면, 무선통신시스템에서 제1 메시지를 전송하는 칩 셋은 적어도 하나의 프로세서, 및 상기 적 어도 하나의 프로세서와 동작 가능하게 연결되고, 실행될 때, 상기 적어도 하나의 프로세서가 동작을 수행하도 록 하는 적어도 하나의 메모리를 포함하며, 상기 동작은 센싱 정보를 획득하고, 상기 RF 송수신기를 제어하여 설정 정보에 기반하여 제2 장치로부터 제1 위치 정보 및 제1 타입 정보가 포함된 제2 메시지를 수신하고, 상기 센싱 정보에 포함된 영상 및 상기 제2 메시지를 인공 신경망에 기반한 검출 모델에 입력하여 객체 정보를 획득 하고, 상기 객체 정보 및 제2 메시지에 기초하여 상기 제2 메시지를 전달하기 위한 상기 제1 메시지를 전송하며, 상기 설정 정보는 사이드링크 신호에 대한 제1 설정 정보 또는 업링크 신호에 대한 제2 설정 정보를 포함하고, 상기 제1 설정 정보는 상기 사이드링크 신호의 송수신을 위한 자원 풀에 대한 정보, 전송 전력 제어 파라미터 및 서브 채널들에 대한 정보를 포함하며, 상기 제2 설정 정보는 서브캐리어 스페이싱, 자원 블록 크기, 전송 전력 제어 파라미터, 및 주파수 대역에 대한 정보를 포함하고, 상기 제2 메시지는 상기 설정 정보가 상기 제2 설정 정보인 것에 기초하여 PSSCH 및 PSCCH 중 적어도 하나에 기반하여 전송되고, 상기 검출 모델은 상기 영상에 대해 추출된 특징들 및 상기 제1 위치 정보에 기반하여 적어도 하나의 검출 영역을 예측하고, 상기 적어도 하나의 검출 영역에 대해 상기 제1 타입 정보와 대응한 객체 정보가 출력되도록 미리 학습될 수 있다. 다른 측면에 따르면, 무선통신시스템에서 적어도 하나의 컴퓨터 프로그램을 포함하는 컴퓨터 판독 가능한 저장 매체는, 적어도 하나의 프로세서가 제1 메시지를 전송하는 동작을 수행하도록 하는 적어도 하나의 컴퓨터 프로그램, 및 상기 적어도 하나의 컴퓨터 프로그램이 저장된 컴퓨터 판독 가능한 저장 매체를 포함하고, 상기 동작 은 센싱 정보를 획득하고, 상기 RF 송수신기를 제어하여 설정 정보에 기반하여 제2 장치로부터 제1 위치 정보 및 제1 타입 정보가 포함된 제2 메시지를 수신하고, 상기 센싱 정보에 포함된 영상 및 상기 제2 메시지를 인공 신경망에 기반한 검출 모델에 입력하여 객체 정보를 획득하고, 상기 객체 정보 및 제2 메시지에 기초하여 상기 제2 메시지를 전달하기 위한 상기 제1 메시지를 전송하며, 상기 설정 정보는 사이드링크 신호에 대한 제1 설정 정보 또는 업링크 신호에 대한 제2 설정 정보를 포함하고, 상기 제1 설정 정보는 상기 사이드링크 신호의 송수 신을 위한 자원 풀에 대한 정보, 전송 전력 제어 파라미터 및 서브 채널들에 대한 정보를 포함하고, 상기 제2 설정 정보는 서브캐리어 스페이싱, 자원 블록 크기, 전송 전력 제어 파라미터, 및 주파수 대역에 대한 정보를 포함하고, 상기 제2 메시지는 상기 설정 정보가 상기 제2 설정 정보인 것에 기초하여 PSSCH 및 PSCCH 중 적어도 하나에 기반하여 전송되고, 상기 검출 모델은 상기 영상에 대해 추출된 특징들 및 상기 제1 위치 정보에 기반하 여 적어도 하나의 검출 영역을 예측하고, 상기 적어도 하나의 검출 영역에 대해 상기 제1 타입 정보와 대응한 객체 정보가 출력되도록 미리 학습될 수 있다."}
{"patent_id": "10-2024-7017387", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "다양한 실시예들은 영상 및 상기 영상과 연관 메시지에 포함된 정보를 이용하여 상기 영상에 객체 검출과 관련 된 검출 영역을 신속하게 예측하고, 상기 메시지에 포함된 정보 및 상기 예측된 검출 영역에 대한 분류 정보 간 의 비교를 통해 보다 정확하고 신속하게 검출 모델을 학습시킬 수 있다. 또한, 상기 메시지에 포함된 객체 정보에 기반한 상기 검출 역의 크기 및 모양의 조정을 통해 보다 정확한 검출 영역을 상기 객체 검출을 위한 영역으로 제공할 수 있다. 또한, 상기 메시지에 포함된 객체 정보에 기반하여 다른 검출 영역과 오버랩된 검출 영역의 학습 유효성을 결정 하여 상기 검출 모델을 보다 정확하고 신속하게 학습시킬 수 있다. 또한, 상기 학습된 검출 모델을 통해 획득한 객체 정보에 기반하여 수신된 제2 메시지에 포함된 정보를 보다 정 확하게 보정하여 주변 단말들에게 제공할 수 있는. 다양한 실시예에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효"}
{"patent_id": "10-2024-7017387", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "과들은 아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2024-7017387", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "무선 통신 시스템은 가용한 시스템 자원(예를 들어, 대역폭, 전송 파워 등)을 공유하여 다중 사용자와의 통신을 지원하는 다중 접속(multiple access) 시스템이다. 다중 접속 시스템의 예로는 CDMA(code division multiple access) 시스템, FDMA(frequency division multiple access) 시스템, TDMA(time division multiple access) 시스템, OFDMA(orthogonal frequency division multiple access) 시스템, SC-FDMA(single carrier frequency division multiple access) 시스템, MC-FDMA(multi carrier frequency division multiple access) 시스템 등 이 있다. 사이드링크(sidelink)란 단말(User Equipment, UE)들 간에 직접적인 링크를 설정하여, 기지국(Base Station, BS)을 거치지 않고, 단말 간에 음성 또는 데이터 등을 직접 주고 받는 통신 방식을 말한다. 사이드링크는 급속 도로 증가하는 데이터 트래픽에 따른 기지국의 부담을 해결할 수 있는 하나의 방안으로서 고려되고 있다. V2X(vehicle-to-everything)는 유/무선 통신을 통해 다른 차량, 보행자, 인프라가 구축된 사물 등과 정보를 교 환하는 통신 기술을 의미한다. V2X는 V2V(vehicle-to-vehicle), V2I(vehicle-to-infrastructure), V2N(vehicle-to- network) 및 V2P(vehicle-to-pedestrian)와 같은 4 가지 유형으로 구분될 수 있다. V2X 통신 은 PC5 인터페이스 및/또는 Uu 인터페이스를 통해 제공될 수 있다. 한편, 더욱 많은 통신 기기들이 더욱 큰 통신 용량을 요구하게 됨에 따라, 기존의 무선 액세스 기술(Radio Access Technology, RAT)에 비해 향상된 모바일 광대역 (mobile broadband) 통신에 대한 필요성이 대두되고 있 다. 이에 따라, 신뢰도(reliability) 및 지연(latency)에 민감한 서비스 또는 단말을 고려한 통신 시스템이 논 의되고 있는데, 개선된 이동 광대역 통신, 매시브 MTC, URLLC(Ultra-Reliable and Low Latency Communication) 등을 고려한 차세대 무선 접속 기술을 새로운 RAT(new radio access technology) 또는 NR(new radio)이라 칭할 수 있다. NR에서도 V2X(vehicle-to-everything) 통신이 지원될 수 있다. 이하의 기술은 CDMA(code division multiple access), FDMA(frequency division multiple access), TDMA(time division multiple access), OFDMA(orthogonal frequency division multiple access), SC-FDMA(single carrier frequency division multiple access) 등과 같은 다양한 무선 통신 시스템에 사용될 수 있다. CDMA는 UTRA(universal terrestrial radio access)나 CDMA2000과 같은 무선 기술로 구현될 수 있다. TDMA는 GSM(global system for mobile communications)/GPRS(general packet radio service)/EDGE(enhanced data rates for GSM evolution)와 같은 무선 기술로 구현될 수 있다. OFDMA는 IEEE(institute of electrical and electronics engineers) 802.11(Wi-Fi), IEEE 802.16(WiMAX), IEEE 802-20, E-UTRA(evolved UTRA) 등과 같은 무선 기술로 구현될 수 있다. IEEE 802.16m은 IEEE 802.16e의 진화로, IEEE 802.16e에 기반한 시스템과의 하위 호환성(backward compatibility)를 제공한다. UTRA는 UMTS(universal mobile telecommunications system)의 일 부이다. 3GPP(3rd generation partnership project) LTE(long term evolution)은 E-UTRA(evolved-UMTS terrestrial radio access)를 사용하는 E-UMTS(evolved UMTS)의 일부로써, 하향링크에서 OFDMA를 채용하고 상 향링크에서 SC-FDMA를 채용한다. LTE-A(advanced)는 3GPP LTE의 진화이다. 5G NR은 LTE-A의 후속 기술로서, 고성능, 저지연, 고가용성 등의 특성을 가지는 새로운 Clean-slate 형태의 이 동 통신 시스템이다. 5G NR은 1GHz 미만의 저주파 대역에서부터 1GHz~10GHz의 중간 주파 대역, 24GHz 이상의 고 주파(밀리미터파) 대역 등 사용 가능한 모든 스펙트럼 자원을 활용할 수 있다.설명을 명확하게 하기 위해, LTE-A 또는 5G NR을 위주로 기술하지만 실시예(들)의 기술적 사상이 이에 제한되는 것은 아니다. 도 2은 적용될 수 있는 LTE 시스템의 구조를 나타낸다. 이는 E-UTRAN(Evolved-UMTS Terrestrial Radio Access Network), 또는 LTE(Long Term Evolution)/LTE-A 시스템이라고 불릴 수 있다. 도 2을 참조하면, E-UTRAN은 단말에게 제어 평면(control plane)과 사용자 평면(user plane)을 제공하는 기지국(20; Base Station, BS)을 포함한다. 단말은 고정되거나 이동성을 가질 수 있으며, MS(Mobile Station), UT(User Terminal), SS(Subscriber Station), MT(Mobile Terminal), 무선기기(Wireless Device) 등 다른 용어로 불릴 수 있다. 기지국은 단말과 통신하는 고정된 지점(fixed station)을 말하며, eNB(evolved-NodeB), BTS(Base Transceiver System), 액세스 포인트(Access Point) 등 다른 용어로 불릴 수 있 다. 기지국들은 X2 인터페이스를 통하여 서로 연결될 수 있다. 기지국은 S1 인터페이스를 통해 EPC(Evolved Packet Core, 30), 보다 상세하게는 S1-MME를 통해 MME(Mobility Management Entity)와 S1-U를 통해 S- GW(Serving Gateway)와 연결된다. EPC는 MME, S-GW 및 P-GW(Packet Data Network-Gateway)로 구성된다. MME는 단말의 접속 정보나 단말의 능 력에 관한 정보를 가지고 있으며, 이러한 정보는 단말의 이동성 관리에 주로 사용된다. S-GW는 E-UTRAN을 종단 점으로 갖는 게이트웨이이며, P-GW는 PDN을 종단점으로 갖는 게이트웨이이다. 단말과 네트워크 사이의 무선인터페이스 프로토콜(Radio Interface Protocol)의 계층들은 통신시스템에서 널리 알려진 개방형 시스템간 상호접속(Open System Interconnection, OSI) 기준 모델의 하위 3개 계층을 바탕으로 L1 (제 1 계층), L2 (제 2 계층), L3(제 3 계층)로 구분될 수 있다. 이 중에서 제 1 계층에 속하는 물리 계층은 물리 채널(Physical Channel)을 이용한 정보전송서비스(Information Transfer Service)를 제공하며, 제 3 계층 에 위치하는 RRC(Radio Resource Control) 계층은 단말과 네트워크 간에 무선 자원을 제어하는 역할을 수행한다. 이를 위해 RRC 계층은 단말과 기지국간 RRC 메시지를 교환한다. 도 3은 NR 시스템의 구조를 나타낸다. 도 3을 참조하면, NG-RAN은 단말에게 사용자 평면 및 제어 평면 프로토콜 종단(termination)을 제공하는 gNB 및 /또는 eNB를 포함할 수 있다. 도 7에서는 gNB만을 포함하는 경우를 예시한다. gNB 및 eNB는 상호 간에 Xn 인터 페이스로 연결되어 있다. gNB 및 eNB는 5세대 코어 네트워크(5G Core Network: 5GC)와 NG 인터페이스를 통해 연 결되어 있다. 보다 구체적으로, AMF(access and mobility management function)과는 NG-C 인터페이스를 통해 연결되고, UPF(user plane function)과는 NG-U 인터페이스를 통해 연결된다. 도 4은 NR의 무선 프레임의 구조를 나타낸다. 도 4을 참조하면, NR에서 상향링크 및 하향링크 전송에서 무선 프레임을 사용할 수 있다. 무선 프레임은 10ms의 길이를 가지며, 2개의 5ms 하프-프레임(Half-Frame, HF)으로 정의될 수 있다. 하프-프레임은 5개의 1ms 서브프 레임(Subframe, SF)을 포함할 수 있다. 서브프레임은 하나 이상의 슬롯으로 분할될 수 있으며, 서브프레임 내 슬롯 개수는 부반송파 간격(Subcarrier Spacing, SCS)에 따라 결정될 수 있다. 각 슬롯은 CP(cyclic prefix)에 따라 12개 또는 14개의 OFDM(A) 심볼을 포함할 수 있다. 노멀 CP(normal CP)가 사용되는 경우, 각 슬롯은 14개의 심볼을 포함할 수 있다. 확장 CP가 사용되는 경우, 각 슬롯은 12개의 심볼을 포함할 수 있다. 여기서, 심볼은 OFDM 심볼 (또는, CP-OFDM 심볼), SC-FDMA(Single Carrier - FDMA) 심볼 (또는, DFT-s-OFDM(Discrete Fourier Transform-spread-OFDM) 심볼)을 포함할 수 있다. 다음 표 1은 노멀 CP가 사용되는 경우, SCS 설정(u)에 따라 슬롯 별 심볼의 개수((Nslot symb), 프레임 별 슬롯의 개수((Nframe,u slot)와 서브프레임 별 슬롯의 개수((Nsubframe,u slot)를 예시한다. 표 1 SCS (15*2u) Nslot symb Nframe,u slot Nsubframe,u slot 15KHz (u=0) 14 10 1 30KHz (u=1) 14 20 260KHz (u=2) 14 40 4 120KHz (u=3) 14 80 8 240KHz (u=4) 14 160 16 표 2는 확장 CP가 사용되는 경우, SCS에 따라 슬롯 별 심볼의 개수, 프레임 별 슬롯의 개수와 서브프레임 별 슬 롯의 개수를 예시한다. 표 2 SCS (15*2u) Nslot symb Nframe,u slot Nsubframe,u slot 60KHz (u=2) 12 40 4 NR 시스템에서는 하나의 단말에게 병합되는 복수의 셀들 간에 OFDM(A) 뉴머놀로지(numerology)(예, SCS, CP 길 이 등)가 상이하게 설정될 수 있다. 이에 따라, 동일한 개수의 심볼로 구성된 시간 자원(예, 서브프레임, 슬롯 또는 TTI)(편의상, TU(Time Unit)로 통칭)의 (절대 시간) 구간이 병합된 셀들 간에 상이하게 설정될 수 있다. NR에서, 다양한 5G 서비스들을 지원하기 위한 다수의 뉴머놀로지(numerology) 또는 SCS가 지원될 수 있다. 예를 들어, SCS가 15kHz인 경우, 전통적인 셀룰러 밴드들에서의 넓은 영역(wide area)이 지원될 수 있고, SCS가 30kHz/60kHz인 경우, 밀집한-도시(dense-urban), 더 낮은 지연(lower latency) 및 더 넓은 캐리어 대역폭 (wider carrier bandwidth)이 지원될 수 있다. SCS가 60kHz 또는 그보다 높은 경우, 위상 잡음(phase noise)을 극복하기 위해 24.25GHz보다 큰 대역폭이 지원될 수 있다. NR 주파수 밴드(frequency band)는 두 가지 타입의 주파수 범위(frequency range)로 정의될 수 있다. 상기 두 가지 타입의 주파수 범위는 FR1 및 FR2일 수 있다. 주파수 범위의 수치는 변경될 수 있으며, 예를 들어, 상기 두 가지 타입의 주파수 범위는 하기 표 3과 같을 수 있다. NR 시스템에서 사용되는 주파수 범위 중 FR1은 \"sub 6GHz range\"를 의미할 수 있고, FR2는 \"above 6GHz range\"를 의미할 수 있고 밀리미터 웨이브(millimeter wave, mmW)로 불릴 수 있다. 표 3 Frequency Range designationCorresponding frequency range Subcarrier Spacing (SCS) FR1 450MHz - 6000MHz 15, 30, 60kHz FR2 24250MHz - 52600MHz 60, 120, 240kHz 상술한 바와 같이, NR 시스템의 주파수 범위의 수치는 변경될 수 있다. 예를 들어, FR1은 하기 표 4와 같이 410MHz 내지 7125MHz의 대역을 포함할 수 있다. 즉, FR1은 6GHz (또는 5850, 5900, 5925 MHz 등) 이상의 주파 수 대역을 포함할 수 있다. 예를 들어, FR1 내에서 포함되는 6GHz (또는 5850, 5900, 5925 MHz 등) 이상의 주 파수 대역은 비면허 대역(unlicensed band)을 포함할 수 있다. 비면허 대역은 다양한 용도로 사용될 수 있고, 예를 들어 차량을 위한 통신(예를 들어, 자율주행)을 위해 사용될 수 있다. 표 4 Frequency Range designationCorresponding frequency range Subcarrier Spacing (SCS) FR1 410MHz - 7125MHz 15, 30, 60kHz FR2 24250MHz - 52600MHz 60, 120, 240kHz 도 5은 NR 프레임의 슬롯 구조를 나타낸다. 도 5을 참조하면, 슬롯은 시간 영역에서 복수의 심볼들을 포함한다. 예를 들어, 노멀 CP의 경우 하나의 슬롯이 14개의 심볼을 포함하나, 확장 CP의 경우 하나의 슬롯이 12개의 심볼을 포함할 수 있다. 또는 노멀 CP의 경우 하나의 슬롯이 7개의 심볼을 포함하나, 확장 CP의 경우 하나의 슬롯이 6개의 심볼을 포함할 수 있다.반송파는 주파수 영역에서 복수의 부반송파들을 포함한다. RB(Resource Block)는 주파수 영역에서 복수(예를 들 어, 12)의 연속한 부반송파로 정의될 수 있다. BWP(Bandwidth Part)는 주파수 영역에서 복수의 연속한 (P)RB((Physical) Resource Block)로 정의될 수 있으며, 하나의 뉴머놀로지(numerology)(예, SCS, CP 길이 등)에 대응될 수 있다. 반송파는 최대 N개(예를 들어, 5개)의 BWP를 포함할 수 있다. 데이터 통신은 활성화된 BWP를 통해서 수행될 수 있다. 각각의 요소는 자원 그리드에서 자원요소(Resource Element, RE)로 지칭될 수 있 고, 하나의 복소 심볼이 맵핑될 수 있다. 한편, 단말과 단말 간 무선 인터페이스 또는 단말과 네트워크 간 무선 인터페이스는 L1 계층, L2 계층 및 L3 계 층으로 구성될 수 있다. 본 개시의 다양한 실시 예에서, L1 계층은 물리(physical) 계층을 의미할 수 있다. 또 한, 예를 들어, L2 계층은 MAC 계층, RLC 계층, PDCP 계층 및 SDAP 계층 중 적어도 하나를 의미할 수 있다. 또 한, 예를 들어, L3 계층은 RRC 계층을 의미할 수 있다. 이하, V2X 또는 SL(sidelink) 통신에 대하여 설명한다. 도 6는 SL 통신을 위한 무선 프로토콜 구조(radio protocol architecture)를 나타낸다. 구체적으로, 도 6의 (a)는 NR의 사용자 평면 프로토콜 스택을 나타내고, 도 6의 (b)는 NR의 제어 평면 프로토콜 스택을 나타낸다. 이하, SL 동기 신호(Sidelink Synchronization Signal, SLSS) 및 동기화 정보에 대해 설명한다. SLSS는 SL 특정적인 시퀀스(sequence)로, PSSS(Primary Sidelink Synchronization Signal)와 SSSS(Secondary Sidelink Synchronization Signal)를 포함할 수 있다. 상기 PSSS는 S-PSS(Sidelink Primary Synchronization Signal)라고 칭할 수 있고, 상기 SSSS는 S-SSS(Sidelink Secondary Synchronization Signal)라고 칭할 수 있다. 예를 들어, 길이-127 M-시퀀스(length-127 M-sequences)가 S-PSS에 대하여 사용될 수 있고, 길이-127 골 드-시퀀스(length-127 Gold sequences)가 S-SSS에 대하여 사용될 수 있다. 예를 들어, 단말은 S-PSS를 이용하 여 최초 신호를 검출(signal detection)할 수 있고, 동기를 획득할 수 있다. 예를 들어, 단말은 S-PSS 및 S- SSS를 이용하여 세부 동기를 획득할 수 있고, 동기 신호 ID를 검출할 수 있다. PSBCH(Physical Sidelink Broadcast Channel)는 SL 신호 송수신 전에 단말이 가장 먼저 알아야 하는 기본이 되 는 (시스템) 정보가 전송되는 (방송) 채널일 수 있다. 예를 들어, 상기 기본이 되는 정보는 SLSS에 관련된 정보, 듀플렉스 모드(Duplex Mode, DM), TDD UL/DL(Time Division Duplex Uplink/Downlink) 구성, 리소스 풀 관련 정보, SLSS에 관련된 어플리케이션의 종류, 서브프레임 오프셋, 방송 정보 등일 수 있다. 예를 들어, PSBCH 성능의 평가를 위해, NR V2X에서, PSBCH의 페이로드 크기는 24 비트의 CRC를 포함하여 56 비트일 수 있다. S-PSS, S-SSS 및 PSBCH는 주기적 전송을 지원하는 블록 포맷(예를 들어, SL SS(Synchronization Signal)/PSBCH 블록, 이하 S-SSB(Sidelink-Synchronization Signal Block))에 포함될 수 있다. 상기 S-SSB는 캐리어 내의 PSCCH(Physical Sidelink Control Channel)/PSSCH(Physical Sidelink Shared Channel)와 동일한 뉴머놀로지 (즉, SCS 및 CP 길이)를 가질 수 있고, 전송 대역폭은 (미리) 설정된 SL BWP(Sidelink BWP) 내에 있을 수 있다. 예를 들어, S-SSB의 대역폭은 11 RB(Resource Block)일 수 있다. 예를 들어, PSBCH는 11 RB에 걸쳐있을 수 있다. 그리고, S-SSB의 주파수 위치는 (미리) 설정될 수 있다. 따라서, 단말은 캐리어에서 S-SSB를 발견하기 위해 주파수에서 가설 검출(hypothesis detection)을 수행할 필요가 없다. 한편, NR SL 시스템에서, 서로 다른 SCS 및/또는 CP 길이를 가지는 복수의 뉴머놀로지가 지원될 수 있다. 이 때, SCS가 증가함에 따라서, 전송 단말이 S-SSB를 전송하는 시간 자원의 길이가 짧아질 수 있다. 이에 따라, S- SSB의 커버리지(coverage)가 감소할 수 있다. 따라서, S-SSB의 커버리지를 보장하기 위하여, 전송 단말은 SCS에 따라 하나의 S-SSB 전송 주기 내에서 하나 이상의 S-SSB를 수신 단말에게 전송할 수 있다. 예를 들어, 전송 단 말이 하나의 S-SSB 전송 주기 내에서 수신 단말에게 전송하는 S-SSB의 개수는 전송 단말에게 사전에 설정되거나 (pre-configured), 설정(configured)될 수 있다. 예를 들어, S-SSB 전송 주기는 160ms 일 수 있다. 예를 들어, 모든 SCS에 대하여, 160ms의 S-SSB 전송 주기가 지원될 수 있다. 예를 들어, SCS가 FR1에서 15kHz인 경우, 전송 단말은 하나의 S-SSB 전송 주기 내에서 수신 단말에게 1개 또는 2개의 S-SSB를 전송할 수 있다. 예를 들어, SCS가 FR1에서 30kHz인 경우, 전송 단말은 하나의 S-SSB 전송 주기 내에서 수신 단말에게 1개 또는 2개의 S-SSB를 전송할 수 있다. 예를 들어, SCS가 FR1에서 60kHz인 경우, 전송 단말은 하나의 S-SSB 전송 주기 내에서 수신 단말에게 1개, 2개 또는 4개의 S-SSB를 전송할 수 있다. 예를 들어, SCS가 FR2에서 60kHz인 경우, 전송 단말은 하나의 S-SSB 전송 주기 내에서 수신 단말에게 1개, 2개, 4개, 8개, 16개 또는 32개의 S-SSB를 전송할 수 있다. 예를 들어, SCS가 FR2에서 120kHz인 경우, 전송 단말은 하나의 S-SSB 전송 주기 내에서 수신 단말에게 1개, 2개, 4개, 8개, 16개, 32개 또는 64개의 S-SSB를 전송할 수 있다. 한편, SCS가 60kHz인 경우, 두 가지 타입의 CP가 지원될 수 있다. 또한, CP 타입에 따라서 전송 단말이 수신 단 말에게 전송하는 S-SSB의 구조가 상이할 수 있다. 예를 들어, 상기 CP 타입은 Normal CP(NCP) 또는 Extended CP(ECP)일 수 있다. 구체적으로, 예를 들어, CP 타입이 NCP인 경우, 전송 단말이 전송하는 S-SSB 내에서 PSBCH 를 맵핑하는 심볼의 개수는 9 개 또는 8 개일 수 있다. 반면, 예를 들어, CP 타입이 ECP인 경우, 전송 단말이 전송하는 S-SSB 내에서 PSBCH를 맵핑하는 심볼의 개수는 7 개 또는 6 개일 수 있다. 예를 들어, 전송 단말이 전 송하는 S-SSB 내의 첫 번째 심볼에는, PSBCH가 맵핑될 수 있다. 예를 들어, S-SSB를 수신하는 수신 단말은 S- SSB의 첫 번째 심볼 구간에서 AGC(Automatic Gain Control) 동작을 수행할 수 있다. 도 7은 V2X 또는 SL 통신을 수행하는 단말을 나타낸다. 도 7을 참조하면, V2X 또는 SL 통신에서 단말이라는 용어는 주로 사용자의 단말을 의미할 수 있다. 하지만, 기 지국과 같은 네트워크 장비가 단말 사이의 통신 방식에 따라 신호를 송수신하는 경우, 기지국 또한 일종의 단말 로 간주될 수도 있다. 예를 들어, 단말 1은 제 1 장치일 수 있고, 단말 2 는 제 2 장치일 수 있다. 예를 들어, 단말 1은 일련의 자원의 집합을 의미하는 자원 풀(resource pool) 내에서 특정한 자원에 해당하는 자원 단위(resource unit)를 선택할 수 있다. 그리고, 단말 1은 상기 자원 단위를 사용하여 SL 신호를 전송할 수 있다. 예를 들어, 수신 단말인 단말 2는 단말 1이 신호를 전송할 수 있는 자원 풀을 설정 받을 수 있고, 상 기 자원 풀 내에서 단말 1의 신호를 검출할 수 있다. 여기서, 단말 1이 기지국의 연결 범위 내에 있는 경우, 기지국이 자원 풀을 단말 1에게 알려줄 수 있다. 반면, 단말 1이 기지국의 연결 범위 밖에 있는 경우, 다른 단말이 단말 1에게 자원 풀을 알려주거나, 또는 단말 1은 사전에 설정된 자원 풀을 사용할 수 있다. 일반적으로 자원 풀은 복수의 자원 단위로 구성될 수 있고, 각 단말은 하나 또는 복수의 자원 단위를 선택하여 자신의 SL 신호 전송에 사용할 수 있다. 도 8는 V2X 또는 SL 통신을 위한 자원 단위를 나타낸다. 도 8를 참조하면, 자원 풀의 전체 주파수 자원이 NF개로 분할될 수 있고, 자원 풀의 전체 시간 자원이 NT개로 분할될 수 있다. 따라서, 총 NF * NT 개의 자원 단위가 자원 풀 내에서 정의될 수 있다. 도 8는 해당 자원 풀이 NT 개의 서브프레임의 주기로 반복되는 경우의 예를 나타낸다. 도 8에 나타난 바와 같이, 하나의 자원 단위(예를 들어, Unit #0)는 주기적으로 반복하여 나타날 수 있다. 또는, 시간 또는 주파수 차원에서의 다이버시티(diversity) 효과를 얻기 위해서, 하나의 논리적인 자원 단위가 맵핑되는 물리적 자원 단위의 인덱스가 시간에 따라 사전에 정해진 패턴으로 변화할 수도 있다. 이러한 자원 단 위의 구조에 있어서, 자원 풀이란 SL 신호를 전송하고자 하는 단말이 전송에 사용할 수 있는 자원 단위들의 집 합을 의미할 수 있다. 자원 풀은 여러 종류로 세분화될 수 있다. 예를 들어, 각 자원 풀에서 전송되는 SL 신호의 컨텐츠(content)에 따라, 자원 풀은 아래와 같이 구분될 수 있다. 스케쥴링 할당(Scheduling Assignment, SA)은 전송 단말이 SL 데이터 채널의 전송으로 사용하는 자원의 위 치, 그 외 데이터 채널의 복조를 위해서 필요한 MCS(Modulation and Coding Scheme) 또는 MIMO(Multiple Input Multiple Output) 전송 방식, TA(Timing Advance)등의 정보를 포함하는 신호일 수 있다. SA는 동일 자원 단위 상에서 SL 데이터와 함께 멀티플렉싱되어 전송되는 것도 가능하며, 이 경우 SA 자원 풀이란 SA가 SL 데이터와 멀티플렉싱되어 전송되는 자원 풀을 의미할 수 있다. SA는 SL 제어 채널(control channel)로 불릴 수도 있다. SL 데이터 채널(Physical Sidelink Shared Channel, PSSCH)은 전송 단말이 사용자 데이터를 전송하는데 사 용하는 자원 풀일 수 있다. 만약 동일 자원 단위 상에서 SL 데이터와 함께 SA가 멀티플렉싱되어 전송되는 경우, SA 정보를 제외한 형태의 SL 데이터 채널만이 SL 데이터 채널을 위한 자원 풀에서 전송 될 수 있다. 다시 말해, SA 자원 풀 내의 개별 자원 단위 상에서 SA 정보를 전송하는데 사용되었던 REs(Resource Elements)는 SL 데이터 채널의 자원 풀에서 여전히 SL 데이터를 전송하기 위해 사용될 수 있다. 예를 들어, 전송 단말은 연속적인 PRB 에 PSSCH를 맵핑시켜서 전송할 수 있다. 디스커버리 채널은 전송 단말이 자신의 ID 등의 정보를 전송하기 위한 자원 풀일 수 있다. 이를 통해, 전송 단말은 인접 단말이 자신을 발견하도록 할 수 있다. 이상에서 설명한 SL 신호의 컨텐츠가 동일한 경우에도, SL 신호의 송수신 속성에 따라서 상이한 자원 풀을 사용 할 수 있다. 일 예로, 동일한 SL 데이터 채널이나 디스커버리 메시지라 하더라도, SL 신호의 전송 타이밍 결정 방식(예를 들어, 동기 기준 신호의 수신 시점에서 전송되는지 아니면 상기 수신 시점에서 일정한 타이밍 어드밴 스를 적용하여 전송되는지), 자원 할당 방식(예를 들어, 개별 신호의 전송 자원을 기지국이 개별 전송 단말에게 지정해주는지 아니면 개별 전송 단말이 자원 풀 내에서 자체적으로 개별 신호 전송 자원을 선택하는지), 신호 포맷(예를 들어, 각 SL 신호가 한 서브프레임에서 차지하는 심볼의 개수, 또는 하나의 SL 신호의 전송에 사용되 는 서브프레임의 개수), 기지국으로부터의 신호 세기, SL 단말의 송신 전력 세기 등에 따라서 다시 상이한 자원 풀로 구분될 수도 있다. Vehicular Communications for ITS V2X (Vehicle-to-Everything, 차량 통신)을 활용하는 ITS (Intelligent Transport System)는 주요하게 Access layer (접속 계층), Network & Transport layer (네트워킹 및 트랜스포트 계층), Facilities layer (퍼실리티 계층), Application layer (어플리케이션 계층), Security (보안)와 Management (관리) Entity (엔터티) 등으 로 구성될 수 있다. 차량 통신은, 차량 간 통신 (V2V), 차량과 기지국 간 통신 (V2N, N2V), 차량과 RSU (Road- Side Unit) 간 통신(V2I, I2V), RSU 간 통신 (I2I), 차량과 사람 간 통신 (V2P, P2V), RSU와 사람 간 통신 (I2P, P2I) 등 다양한 시나리에 적용될 수 있다. 차량 통신의 주체가 되는 차량, 기지국, RSU, 사람 등은 ITS station이라고 지칭된다. 도 9은 ITS 스테이션 참조 구조 (ITS station reference architecture)를 설명하기 위한 도면이다. ITS 스테이션 참조 구조 (ITS station reference architecture)는, 액세스 계층 (Access layer), 네트워크&운 송 계층 (Network & Transport layer), Facilities layer과 보안 (Security)과 관리 (Management)를 위한 엔티 티 (Entity) 및 최상위에는 어플리케이션 계층 (Application layer)으로 구성되어 있으며, 기본적으로 layered OSI (계층 OSI) 모델을 따른다. 구체적으로, 도 9를 참조하면, OSI 모델을 기반한 ITS station 참조 구조 특징이 나타나 있다. ITS 스테이션 (station)의 액세스 (access) 계층은 OSI 계층 1 (physical 계층)과 계층 2 (data link 계층)에 상응하며, ITS 스테이션 (station)의 네트워크&운송 (network & transport) 계층은 OSI 계층 3 (network 계층)과 계층 4 (transport 계층)에 상응하고, ITS 스테이션 (station)의 facilities 계층은 OSI 계층 5 (session 계층), 계층 6 (presentation 계층) 및 계층 7 (application 계층)에 상응한다. ITS 스테이션 (station)의 최상위에 위치한 어플리케이션 (application) 계층은 사용 케이스 (use-case)를 실 제 구현하여 지원하는 기능을 수행하며 사용 케이스 (use-case)에 따라 선택적으로 사용될 수 있다. 관리 엔티 티 (Management entity)는 ITS 스테이션 (station)의 통신 (communication) 및 동작을 비롯한 모든 계층을 관 리하는 역할을 수행한다. 보안 엔티티 (Security entity)는 모든 계층에 대한 보안 서비스 (security servic e)를 제공한다. ITS 스테이션 (station)의 각 계층은 상호 간 interface (인터페이스)를 통해 차량 통신을 통해 전송할 혹은 수신한 데이터 및 다양한 목적의 부가 정보들을 교환한다. 다음은 다양한 인터페이스에 대한 약어 설명이다. MA: Interface between management entity and application layer MF: Interface between management entity and facilities layer MN: Interface between management entity and networking & transport layer MI: Interface between management entity and access layer FA: Interface between facilities layer and ITS-S applications NF: Interface between networking & transport layer and facilities layer IN: Interface between access layer and networking & transport layer SA: Interface between security entity and ITS-S applications SF: Interface between security entity and facilities layer SN: Interface between security entity and networking & transport layer SI: Interface between security entity and access layer 도 10은 참조 구조에 기초하여 설계 및 적용 가능한 ITS 스테이션 (station)의 예시 구조이다. ITS 스테이션 (station)의 참조 구조의 주된 개념은 통신 네트워크로 구성된 두 개의 종단 차량/이용자 사이에 서, 통신 처리를 각 계층이 가지고 있는 특별한 기능을 가지고 계층별로 나눌 수 있도록 하는 것이다. 즉, 차량 간 메시지가 생성되면, 차량 및 ITS 시스템 (또는 기타 ITS 관련 단말기/시스템)에서 한 계층씩 아래로 각 층을 통과하여 데이터가 전달되고, 다른 쪽에서는 메시지가 도착할 때 메시지를 받는 차량 또는 ITS (또는 기타 ITS 관련 단말기/시스템)는 한 계층씩 위로 통과하여 전달된다. 차량 통신 및 네트워크를 통한 ITS 시스템은, 다양한 use-case 지원을 위해 다양한 접속 기술, 네트워크 프로토 콜, 통신 인터페이스 등을 고려하여 유기적으로 설계되며, 하기 기술된 각 계층의 역할 및 기능은 상황에 따라 변경될 수 있다. 다음은 각 계층별 주요 기능에 간략히 기술한다. 어플리케이션 계층 (Application layer)는 다양한 use-case를 실제 구현하여 지원하는 역할을 수행하며, 예로서 안전 및 효율적 교통정보, 기타 오락 정보 등을 제공한다. 어플리케이션 (Application) 계층은 application이 속한 ITS Station을 다양한 형태로 제어하거나, 하위의 access 계층, network & transport 계층, facilities 계층을 통해 서비스 메시지를 차량 통신을 통해 종단 차 량/이용자/인프라 등에 전달하여 서비스를 제공한다. 이때 ITS 어플리케이션은 다양한 use case를 지원할 수 있 으며, 일반적으로 이러한 use-case들은 road-safety, traffic efficiency, local services, 그리고 infotainment 등 other application으로 grouping 되어 지원될 수 있다. application classification, use- case등은 새로운 application 시나리오가 정의되면 업데이트 (update) 될 수 있다. 계층 관리 (layer management)는 어플리케이션 계층의 운영 및 보안과 관련된 정보를 관리 및 서비스해 주는 역할을 수행하며, 관 련 정보는 MA (interface between management entity and application 계층) 와 SA (interface between security entity and ITS-S applications) (또는 SAP: Service Access Point, 예 MA-SAP, SA-SAP)를 통해 양 방향으로 전달 및 공유된다. Application 계층에서 facilities 계층으로의 request 또는 facilities 계층에서 application 계층으로의 서비스 메시지 및 관련정보의 전달은 FA (interface between facilities layer and ITS-S applications 또는 FA-SAP)를 통해 수행된다. 퍼실리티 계층 (Facilities layer)는 상위 어플리케이션 계층에서 정의된 다양한 use-case를 효과적으로 실현할 수 있도록 지원하는 역할을 수행하며, 예컨대, application support, information support, session/communication support를 수행할 수 있다. 퍼실리티 계층 (Facilities layer)은 기본적으로 OSI 모델의 상위 3개 계층, 예) session 계층, presentation 계층, application 계층, 기능을 지원한다. 구체적으로는, ITS를 위해 어플리케이션 지원 (Application support), 인포메이션 지원 (Information support), 세션/통신 지원 (Session/communication support) 등과 같 은 퍼실리티 (facilities)를 제공한다. 여기서, 퍼실리티 (facilities)는 기능 (functionality), 정보 (information), 데이터 (data)를 제공하는 컴포넌트 (component)를 의미한다. 어플리케이션 지원 퍼실리티 (Application support facilities)는 ITS application의 동작을 (주로 ITS 용 메 시지 생성 및 하위계층과의 송수신, 및 그에 대한 관리) 지원하는 퍼실리티이다. 상기 어플리케이션 지원 퍼실 리티는 CA (Cooperative Awareness) basic service, DEN (Decentralized Environmental Notification) basic service 등이 있다. 향후에는 CACC (Cooperative Adaptive Cruise Control), Platooning, VRU (Vulnerable Roadside User), CPS (Collective Perception Service) 등 새로운 서비스를 위한 퍼실리티 엔티티 (facilities entity) 및 관련된 메시지가 추가 정의될 수 있다. 정보 지원 퍼실리티 (Information support facilities)는 다양한 ITS application에 의해 사용될 공통된 데이 터 정보나 데이터베이스를 제공하는 퍼실리티 (facilities)로 Local Dynamic Map (LDM) 등이 있다. 세션/통신 지원 퍼실리티 (Session/communication support facilities)는 communications and session management를 위한 서비스를 제공하는 facilities로서 addressing mode와 session support 등이 있다. 또한, 퍼실리티 (facilities)는 공통 퍼실리티 (common facilities)와 도메인 퍼실리티 (domain facilities)로 나뉠 수 있다. 공통 퍼실리티 (common facilities)는 다양한 ITS application과 ITS station 동작에 필요한 공통적 서비스나 기능을 제공하는 facilities이며, 예로서 time management, position management, 그리고 services managements등이 있다. 도메인 퍼실리티 (domain facilities)는 일부 (하나 또는 복수의) ITS application에만 필요한 특별한 서비스 나 기능을 제공하는 facilities이며, 예로서 Road Hazard Warning applications (RHW)를 위한 DEN basic service 등이 있다. Domain facilities는 optional 기능으로서 ITS station에 의해 지원되지 않으면 사용되지 않는다. 계층 관리 (layer management)는 facilities 계층의 운영 및 보안과 관련된 정보를 관리 및 서비스해 주는 역할 을 수행하며, 관련정보는 MF (interface between management entity and facilities 계층) 와 SF (interface between security entity and facilities 계층) (또는 MF-SAP, SF-SAP)를 통해 양방향으로 전달 및 공유된다. Application 계층에서 facilities 계층으로의 request 또는 facilities 계층에서 application 계층으로의 서비 스 메시지 및 관련정보의 전달은 FA (또는 FA-SAP)를 통해 이루어지며, facilities 계층과 하위 networking & transport 계층 간의 양방향 서비스 메시지 및 관련정보의 전달은 NF (interface between networking & transport 계층 and facilities 계층, 또는 NF-SAP)에 의해 이루어진다. 다양한 트랜스포트 프로토콜과 네트워크 프로토콜의 지원을 통해 동종 (Homogenous) 또는 이종 (Heterogeneous) 네트워크 간 차량 통신을 위한 네트워크를 구성하는 역할을 수행한다. 예로서 TCP/UDP+IPv6 등 인터넷 프로토콜 을 이용한 인터넷 접속, 라우팅 및 차량 네트워크를 제공하며, BTP (Basic Transport Protocol)와 GeoNetworking 기반 프로토콜을 이용하여 차량 네트워크를 형성할 수 있다. 이때 지리적 위치 정보 (Geographical position)를 활용한 네트워킹도 지원될 수 있다. 차량 네트워크 계층은 access layer에 사용되 는 기술에 의존적으로 (access layer technology-dependent) 설계되거나 구성될 수 있으며, access layer에 사 용되는 기술에 상관없이 (access layer technology-independent, access layer technology agnostic) 설계되거 나 구성될 수 있다. 유럽 ITS 네트워크 & 트랜스포트 (network & transport) 계층 기능은 하기와 같다. 기본적으로 ITS 네트워크 & 트랜스포트 (network & transport) 계층의 기능은 OSI 3 계층 (network 계층)와 4 계층 (transport 계층)과 유 사 또는 동일하며 다음과 같은 특징을 지닌다. 트랜스포트 계층 (transport layer)은 상위 계층 (session 계층, presentation 계층, application 계층)과 하 위 계층 (network 계층, data link 계층, physical 계층)에서 제공받은 서비스 메시지와 관련정보를 전달하는 연결 계층으로서, 송신 ITS station의 application이 보낸 데이터가 목적지로 하는 ITS station의 application process에 정확하게 도착하도록 관리하는 역할을 한다. 유럽 ITS에서 고려될 수 있는 transport 프로토콜은 예 로서 그림 OP5.1에서 보이듯 기존의 인터넷 프로토콜로 사용되는 TCP, UDP 등이 있으며, BTS 등 ITS 만을 위한 transport 프로토콜 등이 있다. 네트워크 계층은 논리적인 주소 및 패킷의 전달 방식/경로 등을 결정하고, transport 계층에서 제공받은 패킷에 목적지의 논리적인 주소 및 전달 경로/방식 등의 정보를 네트워크 계층의 헤더에 추가하는 역할을 한다. 패킷 방식의 예로서 ITS station 간 unicast (유니캐스트), broadcast (브로드캐스트), multicast (멀티캐스트) 등 이 고려될 수 있다. ITS를 위한 networking 프로토콜은 GeoNetworking, IPv6 networking with mobility support, IPv6 over GeoNetworking 등 다양하게 고려될 수 있다. GeoNetworking 프로토콜은 단순한 패킷 전송 뿐만 아니라, 차량을 포함한 station의 위치정보를 이용한 forwarding (포워딩) 혹은 forwarding hop 개수 등 을 이용한 forwarding 등의 다양한 전달 경로 혹은 전달 범위를 적용할 수 있다. 네트워크 & 트랜스포트 (network & transport) 계층과 관련된 계층 관리 (layer management)는 network & transport 계층의 운영 및 보안과 관련된 정보를 관리 및 서비스해 주는 역할을 수행하며, 관련정보는 MN (interface between management entity and networking & transport 계층, 또는 MN-SAP) 와 SN (interface between security entity and networking & transport 계층, 또는 SN-SAP)를 통해 양방향으로 전달 및 공유된 다. Facilities 계층과 networking & transport 계층 간의 양방향 서비스메시지 및 관련정보의 전달은 NF (또 는 NF-SAP)에 의해 이루어지며, networking & transport 계층과 access 계층 간의 서비스메시지 및 관련정보의 교환은 IN (interface between access layer and networking & transport 계층, 또는 IN-SAP)에 의해 이루어진 다. 북미 ITS network & transport 계층은, 유럽과 마찬가지로 기존의 IP 데이터를 지원하기 위해 IPv6 와 TCP/UDP 를 지원하고 있으며, ITS만을 위한 프로토콜로는 WSMP (WAVE Short Message Protocol)를 정의하고 있다. WSMP에 따라 생성되는 WSM (WAVE Short Message)의 packet 구조은 WSMP Header 와 Message가 전송되는 WSM data로 구성된다. WSMP header는 version, PSID, WSMP header extension field, WSM WAVE element ID, length 로 구성된다. Version 은 4bits의 실제 WSMP 버전을 나타내는 WsmpVersion 필드와 4bits의 reserved 필드로 정의된다. PSID 는 provider service identifier 로 상위 레이어에서 application에 따라 할당되며, 수신기 측에서 적절한 상 위 계층을 결정하는데 도움을 준다. Extension fields는 WSMP header를 확장하기 위한 필드로 channel number, data-rate, transmit power used 와 같은 정보들이 삽입된다. WSMP WAVE element ID는 전송되는 WAVE short message의 타입을 지정하게 된다. Lenth는 12bits의 WSMLemgth 필드를 통해 전송되는 WSM data 의 길이를 octets 단위로 지정해주게 되며, 나머지 4bits는 reserved 되어 있다. LLC Header는 IP data 와 WSMP data를 구별하여 전송할 수 있게 해주는 기능을 하며, SNAP의 Ethertype을 통해 구별된다. LLC header 와 SNAP header 의 구조는 IEEE802.2에서 정의되어 있다. IP data를 전송하는 경우 Ethertype 은 0x86DD 로 설정하여 LLC header를 구성한다. WSMP를 전송하는 경우 Ethertype 은 0x88DC 로 설정하여 LLC header를 구성한다. 수신기의 경우, Ethertype을 확인하고 0x86DD 인 경우 IP data path 로 packet을 올려 보내고, Ethertype 이 0x88DC 인 경우 WSMP path로 올려 보내게 된다. 액세스 계층 (Access layer)은 상위 계층으로부터 받은 메시지나 데이터를 물리적 채널을 통해 전송하는 역할을 수행한다. 액세스 계층 (Access layer) 기술로서, IEEE 802.11p를 기반한 ITS-G5 차량 통신 기술, 위성/광대역 무선 이동 통신 기술, 2G/3G/4G (LTE (Long-Term Evolution)등)/5G 등 무선 셀룰러 (cellular) 통신 기술, LTE-V2X와 NR-V2X (New Radio)와 같은 cellular-V2X 차량 전용 통신 기술, DVB-T/T2/ATSC3.0등 광대역 지상파 디지털 방송 기술, GPS 기술 등이 적용될 수 있다 데이터 링크 계층 (Data link layer)은 일반적으로 잡음이 있는 인접 노드 간 (또는 차량 간) 물리적인 회선을 상위 네트워크계층이 사용할 수 있도록 전송 에러가 없는 통신 채널로 변환시키는 계층으로 3계층 프로토콜을 전송/운반/전달하는 기능, 전송할 데이터를 전송 단위로서의 패킷(또는 프레임)으로 나누어 그룹화하는 프레이 밍 (Framing) 기능, 보내는 측과 받는 측 간의 속도차를 보상하는 흐름제어 (Flow Control) 기능, (물리 전송 매체의 특징상 오류와 잡음이 랜덤하게 발생할 확률이 높으므로) 전송 오류를 검출하고 이것을 수정 또는 ARQ (Automatic Repeat Request)등의 방식으로 송신측에서 타이머와 ACK 신호를 통해 전송에 러를 검출하고 정확하 게 수신되지 않은 패킷들을 재전송하는 기능 등을 수행한다. 또한 패킷이나 ACK 신호를 혼동하는 것을 피하기 위해 패킷과 ACK 신호에 일련번호 (Sequence number)를 부여하는 기능, 그리고 네트워크 Entity 간 데이터 링크 의 설정, 유지, 단락 및 데이터 전송 등을 제어하는 기능 등도 수행한다. 그림 OP6.1의 data link layer를 구성 하는 LLC (Logical Link Control), RRC (Radio Resource Control), PDCP (Packet Data Convergence Protocol), RLC (Radio Link Control), MAC (Medium Access Control), MCO (Multi-channel Operation) 부계층 (sub-layer)에 대한 주요 기능은 다음과 같다. LLC sub-layer는 여러 상이한 하위 MAC 부계층 프로토콜을 사용할 수 있게 하여 망의 토폴로지에 관계없는 통신 이 가능토록 한다. RRC sub-layer는 셀 내 모든 단말에게 필요한 셀 시스템 정보 방송, 페이징 메시지의 전달 관리, 단말과 E-UTRAN 간의 RRC 연결 관리 (설정/유지/해제), 이동성 관리 (핸드오버), 핸드오버 시의 eNodeB 간의 UE 컨텍스트 전송, 단말 (UE) 측정 보고와 이에 대한 제어, 단말 (UE) 능력 관리, UE로의 셀 ID의 일시적 부여, 키 관리를 포함한 보안 관리, RRC 메시지 암호화 등의 기능을 수행한다. PDCP sub-layer는 ROHC (Robust Header Compression) 등의 압축 방식을 통한 IP 패킷 헤더 압축 수행할 수 있고, 제어 메시지 및 사용자 데이터 의 암호화 (Ciphering), 데이터 무결성 (Data Integrity), 핸드오버 동안에 데이터 손실 방지 등의 기능을 수행 한다. RLC sub-layer는 패킷의 분할(Segmentation)/병합(Concatenation)을 통해, 상위 PDCP 계층으로부터의 패 킷을 MAC 계층의 허용 크기로 맞추어 데이터 전달하고, 전송 오류 및 재전송 관리를 통한 데이터 전송 신뢰성 향상, 수신 데이터들의 순서 확인, 재정렬, 중복확인 등을 수행한다. MAC sub-layer는 여러 노드들의 공유 매체 사용을 위해, 노드 간 충돌/경합 발생 제어 및 상위계층에서 전달된 패킷을 Physical layer 프레임 포맷에 맞추 는 기능, 송신단/수신단 주소의 부여 및 식별 기능, 반송파 검출, 충돌 감지, 물리매체 상의 장해를 검출하는 등의 역할을 수행한다. MCO sub-layer는 복수개의 주파수 채널을 이용하여 다양한 서비스를 효과적으로 제공할 수 있도록 하며, 주요 기능은 특정 주파수 채널에서의 트래픽 가중 (traffic load)를 다른 채널로 효과적으로 분산하여 각 주파수 채널에서의 차량 간 통신 정보의 충돌/경합을 최소화한다. 물리 계층은 ITS 계층 구조상의 최하위 계층으로 노드와 전송매체 사이의 인터페이스를 정의하고, data link 계 층 Entity 간의 비트 전송을 위해 변조, 코딩, 전송채널을 물리 채널로의 매핑 등을 수행하며, 반송파 감지 (Carrier Sense), 빈 채널 평가 (CCA: Clear Channel Assessment) 등을 통해 무선매체가 사용 중인지 여부 (busy 또는 idle)를 MAC 부계층에게 알리는 기능을 수행한다. 한편, SoftV2X 시스템는 UU 인터페이스를 이용한 V2X 통신으로, SoftV2X 서버가 VRU (Vulnerable Road User) 또는 V2X 차량으로부터 VRU 메시지 또는 PSM (Personal Safety Message)을 수신하고, VRU 메시지 또는 PSM 메 시지에 기반하여 주변 VRU 또는 차량의 정보를 전달해주거나, 주변 VRU 또는 차량들이 이동하는 도로 상황 등을 분석하고, 분석된 정보에 기반하여 주변 VRU 또는 차량에게 충돌 경고 등을 알리는 메시지를 전송하는 시스템이 다. 여기서, VRU 메시지 또는 PSM 메시지는 UU 인터페이스로 상기 SoftV2X 서버에 전송되는 메시지로, VRU의 위 치, 이동 방향, 이동 경로, 속도 등 상기 VRU에 대한 이동성 정보를 포함할 수 있다. 즉, SoftV2X 시스템은 UU 인터페이스를 통해 V2X 통신과 관련된 VRU 및/또는 차량들의 이동성 정보를 수신하고, 네트워크 등 softV2X 서 버가 수신된 이동성 정보에 기초하여 VRU 등의 주행 경로, VRU 이동 흐름 등을 제어하는 방식이다. 또는, SoftV2X 시스템은 V2N 통신과 관련하여 구성될 수 있다. V2X 통신과 관련된 다이렉트 통신 (PC5, DSRC)의 수행하기 어려운 사용자 장비 또는 보행자 장비 (VRU 장치)는 UU 인터페이스에 기반한 SoftV2X 시스템을 통해 주변 차량 또는 VRU에 주행 정보, 이동성 정보를 제공하거나 제 공받을 수 있다. 이를 통해, 상기 다이렉트 통신 (PC5, DSRC)의 수행하기 어려운 사용자 장비 또는 보행자 장비 (VRU 장치)는 주변 차량들로부터 안전을 보호받을 수 있다. V2X message based region proposal for AI learning of image detection RSU (Road Side Unit) 등 장치는 카메라 센서 등을 통한 영상 검출을 통해 보행자 또는 차량 등의 움직임을 감 지할 수 있고, 감지된 움직임에 기반하여 이동방향 등을 예측하여 교통 안전을 위한 서비스를 제공할 수 있다. 이 경우, 상기의 검출된 영상이 보행자인지 자전거를 타고 가는 사람인지, 또는 그 외의 물체가 움직이는 것을 감지했는지 여부 등을 정확히 판별하는 것이 중요할 수 있다. 이를 위해, 상기 영상의 객체 검출 시 필요한 카 테고리 (category)와 그렇지 않은 카테고리를 잘 구분하여 학습하는 것이 필요할 수 있다. 예컨대, 상기 영상으 로부터 가장 정확하고 사람의 인식 기준과 가장 유사한 객체 검출하도록 인공 신경망을 학습시키기 위해, 학습 데이터로써 영상에 대한 분류 정보를 사용자가 직접 확인하거나 분류 정보와 대응하는 영상에서의 영역을 직접 확인할 필요가 있다. 이 경우, 사용자에 의해 확인된 검출 영역 및 분류 정보 (또는, 카테고리의 정보 (예컨대, label or annotation))를 상기 인공 신경망에 입력하여 상기 인공 신경망을 학습시킬 수 있다. 이와 같은 방식으로 학습된 인공 신경망 또는 인공 신경망에 기반한 검출 모델은 객체 인식률이 크게 향상될 수 있으나, 상기 모델의 학습이 완료되기 까지 상당히 많은 시간과 인력이 필요할 수 있다. 특히, 상기 카메라 또 는 CCTV 등이 설치되는 장소가 증가할수록 그만큼 더 많은 비용이 소요되며, 특히 설치 환경의 변동 (설치 높이, 카메라 각도 등)이 생길 때마다 상기의 수작업을 계속해서 수행해야 하는 단점이 있다. 상기의 도로 사용자들의 경우 단순히 아무런 장치를 지니지 않고 이동하는 경우도 있겠지만, 위치 인식이 가능 하고 또한 상기 인식된 위치에 대한 정보를 전송할 수 있는 (e.g. V2X) 단말을 지니는 경우에 상기 정보를 통해 상기 모델의 학습을 효과적이고 빠르게 수행할 수 있다. 이하에서는 상술한 모델의 학습에서 V2X 메시지를 추가 적으로 고려하여 상기 모델에 대한 학습을 수행하는 방식을 자세히 설명한다. 상술한 영상 검출은 단순히 한 개의 물체(single object)가 아닌 복수의 종류/개수의 객체(Multiple objects) 각각이 어떠한 객체인지 클래스를 분류하는 분류 (Classification) 문제와, 박스를 (Bounding box) 통해 그 객 체가 어디 있는지 위치 정보를 나타내는 지역화 (Localization) 문제를 모두 포함할 수 있다. 구체적으로, 상기 객체 검출은 방식에 따라 상기 분류 및 지역화를 한번에 검출하는 1-stage detector, 각각 순차적으로 수행하는 2-stage detector로 나뉠 수 있다. 1-stage detector의 경우 처리 속도가 빠르지만 정확도가 떨어지며, 2- stage detector의 경우 처리 속도는 느리지만 정확도가 높은 편이다. 후술할 바와 같이, R-CNN 및 그에 대한 후 속모델들은 상기 객체 검출과 관련하여 비교적 정확도가 높은 2-stage detector의 방식을 수행할 수 있다. 여기 서, 상기 R-CNN (Regions with CNN)은 영상에서의 특정 영역에 대해 CNN (Convolutional Neural Network)을 수 행하여 객체 검출 (object detection)을 하는 방식일 수 있다. 여기서, 상기 특정 영역 (region)이 실제 공간의 영상 영역에 대한 것이라면, 상기 모델의 학습 또는 영상 검출은 상기 특정 영역에 대한 실제 공간 좌표를 이용 하여 수행될 수 있다. 구체적으로 상기 영상 검출은 DNN (Deep Neural Network), CNN (Convolutional Neural Network), 또는 상기 R- CNN 중 적어도 하나에 기반하여 수행될 수 있다.- DNN: 기존의 DNN (Deep Neural Network) 방식의 경우 이미지를 1차원으로 flatten하여 사용하는데 이 과정에 서 이미지의 공간적/지역적 정보가 손실될 수 있다. 또한 추상화 과정 없이 바로 연산을 수행하기 때문에 학습 시간이 증가하고 효율성이 저하될 수 있다. - CNN: CNN은 DNN의 단점을 보완하기 위해 제안된 방식으로, 이미지의 raw data input을 그대로 받아들여 공간 적/지역적 정보를 유지한 채 이미지의 특성(feature)들을 추출해 낼 수 있다. CNN의 중요한 점은 이미지 전체보 다는 특징점이 있는 주요 부분에 집중할 수 있고, 이를 위해 이미지의 특정 픽셀과 그 주변 픽셀들의 연관성을 도출해 내는 것이다. - R-CNN (Regions with CNN): R-CNN은 상기 CNN을 객체 검출 (object detection) 분야에 최초로 적용시킨 모델 로서 CNN 방식이 분류뿐만 아니라 객체 검출 분야에서도 우수한 성능을 가질 수 있다. 상기 R-CNN의 기본적인 구조는 우선 객체의 위치를 찾는 영역 제안 (Region Proposal), 및 상기 제안된 영역에서의 물체의 종류를 분류 하는 영역 분류 (Region Classification)를 포함할 수 있다. 구체적으로, 상기 영역 제안을 위해서, 인공 신경 망 모델에 기반한 객체 검출을 수행하는 장치는 객체의 검출이 예상 가능한 영역들을 CPU 기반으로 탐색 (e.g. selective search algorithm)하여 복수 개 (예컨대, 2000개 이상)의 경계 박스 (bounding box)를 생성할 수 있 고, 상기 경계 박스 마다 CNN을 수행하여 분류 후 결과 값을 획득할 수 있다. 이하에서는, 장치가 V2X 메시지를 추가적으로 고려하여 인공 신경망에 기반한 검출 모델의 학습시키는 방법 및 상기 검출 모델을 이용하여 영상에서 객체 검출하는 방법을 자세히 설명한다. V2X 메시지 기반 영상검출 학습 보조 V2X 메시지는 상기 객체의 이동성 정보나 기타 다른 입력 정보 등 (시각적으로 직접 대상이 되는 객체를 인식 (perception)하는 부분을 제외한 나머지 부분)을 포함할 수 있다. 예컨대, 상기 V2X 메시지는 위치정보, 센서정 보 (속도, 가속도, 방향 등), 타입 정보 (예컨대. 수동 입력, 또는 자동 감지) 및/또는 장치의 타입 정보 등을 포함할 수 있다. 상기 검출 모델에 기반한 객체 검출 (또는, 영상 검출)은 상기 V2X 메시지에 포함된 정보가 추 가적으로 고려될 수 있다. 구체적으로, 상기 검출 모델 (상기 R-CNN 계열의 방식에 기반한 모델)은 상기 경계 박스 (또는, region) 설정에 서 상기 V2X 메시지에 포함된 위치 정보 및/또는 센싱 정보를 추가적으로 이용할 수 있다. 한편, 상기 검출 모 델은 사용자에 의해 미리 정의된 객체의 분류 정보 (레이블 정보) 및 대응하는 영상을 포함하는 학습 데이터를 통해 지도 학습으로 학습될 수 있다. 또는, 상기 검출 모델은 상기 분류 정보 없이 영상만으로 자동으로 분류 동작을 수행하도록 학습시키는 비지도 학습으로 학습될 수 있다. 후자의 경우는 영상에 대응하는 레이블 정보가 없는 영상도 학습 데이터로 사용할 수 있는 장점이 있긴 하나, 학습 모델의 분류 성능 및 분류 신뢰도에만 의존 해야 하는 단점이 있다. 이와 같은 단점은 상기 V2X 메시지에 포함된 센싱 정보, 위치 정보 및 타입 정보의 추 가적인 고려를 통해 해결될 수 있다. 예컨대, 상기 검출 모델은 상기 V2X 메시지에 포함된 위치 정보 등을 통해 객체의 검출이 필요한 영역에 대한 지역화 (localization)을 수행할 수 있고, 상기 V2X 메시지에 포함된 장치 타입에 대한 정보에 기반하여 검출된 객체에 대한 분류 동작을 수행할 수 있다. 이 경우, 상기 검출 모델은 상 기 V2X 메시지를 통해 간접적으로 객체 검출과 관련된 분류 정보를 간접적으로 획득할 수 있으므로 실질적으로 지도 학습 방식으로 학습될 수 있다. 이하, V2X 메시지에 포함된 정보를 더 고려하여 검출 모델을 학습시키는 방법을 자세히 설명한다. Region proposal 도 11 내지 도 13은 검출 모델 또는 제1 장치가 V2X 메시지에 기반하여 객체 검출을 위한 학습을 수행하는 방법 을 설명하기 위한 도면이다. 우선, 상기 검출 모델 또는 상기 제1 장치는 상기 V2X 메시지에 포함된 정보에 기반하여 객체 검출이 필요한 영 역들을 탐색하는 방법을 설명한다. 한편, 상기 객체 검출이 필요한 영역들은 상기 검출 모델을 통해 탐색되거나 상기 제1 장치에 의해서도 탐색될 수 있다. 이하에서는, 설명의 편의를 위해, 상기 검출 모델이 상기 객체 검출 이 필요한 영역들을 탐색하는 것으로 가정하여 설명한다. 상술한 바와 같이, 상기 검출 모델과 관련된 R-CNN 구조는 이미지 또는 영상 상에서 선택적 탐색 (selective search) 방식을 통해 객체의 발견이 예측되는 곳에 대한 영역들 (예컨대, 최대 2000개까지)을 제안할 수 있다. 이 경우, 상기 검출 모델은 상기 V2X 메시지에 포함된 위치 정보에 기반하여 대응하는 객체를 검출할 영역을 일 정 (오차) 범위 내에서 한정할 수 있다. 예컨대, 상기 검출 모델은 상술한 영역들 (예컨대, 2000개의 영역들)중에서 수신된 V2X 메시지를 통해 유효한 영역을 선별하거나, 상기 V2X 메시지에 의한 일정 영역 또는 그 주변 영역에서 상기 선택적 탐색을 수행할 수도 있다. 예컨대, 영상과 관련된 촬영 영역 내의 위치 정보를 포함하는 V2X 메시지가 10개 수신된 경우, 상기 검출 모델은 상기 촬영 영역 전체에 대해 선택적 탐색을 수행하지 않고, 상기 V2X 메시지의 위치 정보에 대응하는 10개 내외의 경계 박스들만을 탐색할 수 있다. 예컨대, 도 11 (a)을 참조하면, 상기 검출 모델 (또는, R-CNN)은 (검출해야 하는 대상이 되는 객체의 개수를 정 확히 알 수 없는 상태에서) 촬영 영역에서 상당히 많은 영역들 (경계 박스 후보군)을 객체의 검출이 필요한 검 출 영역들로 제안하게 된다. 이와 달리, 도 11 (b)를 참조하면, 상기 검출 모델은 수신된 V2X 메시지에 기반하 여 상기 경계 박스들 중에서 객체의 검출이 필요한 영역을 크게 줄일 수 있다. 예컨대, 상기 촬영 영역에 대응 하는 제1 메시지 내지 제5 메시지 (g1~g5)가 수신된 경우, 상기 검출 모델은 상기 경계 박스들 중에서 각 메시 지에 포함된 x, y 좌표 (latitude, longitude 좌표)에 기반하여 유효한 경계 박스 영역들을 결정 (또는, 필터링)할 수 있다. 이 경우, 상기 검출 모델은 상기 경계 박스 영역들을 객체 검출이 필요한 검출 영역으로 제 안할 수 있다. 또는, 도 11 (c)를 참조하면, 상기 검출 모델은 경계 박스들 (region proposals)과 V2X 메시지의 위치 정보 (또는, 상기 위치 정보를 중심으로 소정의 반지름을 갖는 원 영역)가 중첩되는 영역을 상기 검출 영 역으로 탐색 또는 결정할 수 있다. 또는, 도 11 (d)를 참조하면, 상기 검출 모델은 상기 경계 박스들 각각에 대 응하는 기준점 (대상이 되는 객체들이 모두 ground level에서 이동하고 있다고 가정하고 생성된 bounding box의 ground level (bounding box 하단의 중심점)에 대응하는 좌표)을 설정하고, 상기 경계 박스들 중에서 각 메시지 에 포함된 위치 정보와 소정의 거리 내에 있는 상기 기준점이 설정된 적어도 하나의 경계 박스를 상기 검출 영 역으로 결정할 수 있다. 예컨대, 도 11 (d)에 도시된 바와 같이, 상기 검출 모델은 경계 박스들 중에서 b1 내지 b4의 기준점을 갖는 경계 박스들을 상기 검출 영역들로 결정할 수 있다. 한편, 도 11 (d)에서의 제5 메시지 (g5)와 같이 커버리지 (위치 정보로부터 소정의 거리)에 포함되는 경계 박스 (bounding box)이 존재하지 않을 경우, 상기 검출 모델은 주변의 제5 내지 제 7 경계 박스들 (b5~b7, bounding box 후보군)을 제5 메시지 (g5)와 대응하는 검출 영역으로 결정할 수 있다. 예컨대, 순시적으로는 제5 경계 박스 (b5)가 제5 메시지 (g5)의 오차 범위 밖에 존재하더라도, 상기 검출 모델은 소정의 시간 동안 추적을 통해 상기 제5 경계 박스 (b5) 및 제5 메 시지 (g5)가 서로 대응하는 객체에 대한 것임을 확인할 수 있다. 또는, 상기 경계 박스에 대한 지상 레벨 (ground level)의 (또는, 영상 내에서의 픽셀의) 좌표를 통해 카메라와 의 상대 위치 또는 실제 좌표 변환이 가능할 수 있다. 이와 같은 실제 좌표 변환은 단지 영상 영역에서 실제 측 정을 통해 미리 결정된 것일 수 있다. 또는, 이와 같은 실제 좌표 변환은 카메라의 사양 및 설치 환경 등에 의 해 수식적으로 도출되는 것일 수 있다. 예컨대, 영상내의 특정 (픽셀) 좌표 (a,b)에 대응되는 피사체의 (ground level에 대한) 상대 위치 (x,y)를 GL(a, b) = (x, y)와 같이 나타낼 수 있다. 보다 구체적으로 특정 설치 환경 에서 GL(a, b) = f(h, θ, r, d, f0, a, b)와 같이 나타낼 수 있다. 여기서, h는 카메라의 설치 높이, θ는 카 메라의 설치 각도, r은 이미지센서의 가로 및 세로 비율, d는 이미지센서의 사이즈 (유효한 이미지센서의 영역 의 비율은 그것이 표출될 display 영역의 비율과 동일한 것이 적절하다.), f0는 센서로부터의 초점거리, a는 display 상에서의 수평좌표, b는 display 상에서의 수직 좌표일 수 있다. 상기 변환식 (GL(a, b) = f(h, θ, r, d, f0, a, b))을 통해 피사체까지의 상대거리가 산출될 수 있다. 또한, 피사체 (또는, 객체)에 대한 경계 박 스의 가로, 세로 높이에 따라서 피사체의 높이, 넓이 등이 예측할 수 있다. 다만, 피사체 (객체)의 넓이는 이동 방향 등에 따라 상당히 상이해질 수 있는바, 단순히 경계 박스의 크기만을 구하는 것이 부정확할 수 있다. 보행 자, 킥보드와 같이 피사체의 넓이의 영향을 크게 받지 않는 상태로 촬영이 되는 피사체 (객체)의 경우, 하기의 수학식 1을 통해 상기 피사체의 높이를 구하는 것이 보다 타당할 수 있다. 예컨대, 도 12 (a)를 참조하면, 제1 객체 (o1)에 대응하는 제1 경계 박스 (b1)가 설정될 수 있고, 상기 제1 경 계 박스의 ground level이 (p0, q0), top level (영상에서 최대 높이를 나타내는 픽셀의 좌표)이 (p1, q1)일 수 있다. 이 경우, 제1 경계 박스 (b1)에 대응하는 객체의 높이는 도 12 (b)와 같은 비례 관계에 기반하여 추정 될 수 있다. 즉, ground level (p0, q0)에 의해 상대적인 거리 r1 또는 상대위치에 대한 좌표 (x1, y1)가 도출 될 수 있고, ground level (p1, q1)에 의해 상대적인 거리 r2 또는 상대위치에 대한 좌표 (x2, y2)가 도출될 수 있다. 이 경우, 피사체의 높이 (h1)는 하기의 수학식 1에 기반하여 추정 또는 산출될 수 있다. 여기서, 상기 h0는 카메라의 설치 높이일 수 있다.수학식 1"}
{"patent_id": "10-2024-7017387", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이 때, r(GL(p, q))는 GL(p, q)의 결과값으로 도출된 좌표 (예컨대, GL(p, q) = (x, y))로부터 구해진 거리 ( )를 나타낸다. 즉, 제1 경계 박스의 크기를 통해 객체의 높이 (h1)를 구할 수 있다. 이 경우, 대응하는 V2X 메시지의 type 정보 및 이와 연관된 해당 type의 사이즈 정보, 제원 정보 (e.g. 어른 보행 자 = 평균 1.65 m, cyclist = 평균 1.5 m 등) 등을 통해 상기 제1 경계 박스에 대응하는 V2X 메시지의 적합성 여부가 결정될 수 있다. 이 때, 제1 경계 박스가 실제 객체 (o1)의 크기대로 정확히 세그먼테이션 (segmentation)된 것이 아닐 수 있다. 이 경우, 실제 객체 (o1)의 크기는 상기 수학식 1에 기반하여 도출된 값 보다 작을 수 있다 (bounding box를 얼마나 크게 잡았는지에 여부에 따라). 또한, 상기 타입 별로 사이즈 정보 가 객체 별로 상이한 경우 (e.g. 평균 x.yz m), 상기 도출된 값으로부터 수용할 수 있는 오차범위를 고려하여 (e.g. 50cm) 상기 제1 경계 박스 및 이에 대응하는 V2X 메시지의 적합성이 결정될 수 있다. 한편, V2X 메시 지에 해당 객체에 대한 보다 확정적이고 구체적인 정보 (e.g. 높이, 깊이, 너비 정도 등)가 들어 있는 경우에는 이와 같은 정보를 활용하여 상기 제1 경계 박스의 크기 등이 보다 상기 객체에 맞춰서 회귀 (regression)될 수 도 있다. 또한, 영상에서 제안된 경계 박스들이 중첩 (intersection)되는 경우, 대상 객체의 위치 또는 높이 등 주요 정 보들이 정확하게 획득되지 않을 수 있다. 예컨대, 객체 간의 가려짐 발생에 의해, 상기 영상에 대한 분류 (classification)가 명확하지 않을 수 있다. 이 경우, 상기 경계 박스에 대응하는 객체를 검출하기 위한 학습 (e.g. 가려진 객체, 부분 객체에 대한 학습)이 제대로 수행되지 않을 수 있다. 따라서, 경계 박스 간의 중첩이 발생하거나 가려짐이 예상되는 경계 박스들이 존재하는 경우, 상기 경계 박스의 위치, 사이즈 등은 주변 V2X 메 시지와의 비교를 통해 서로 대응하는 객체에 대한 것인지 여부에 대한 타당성이 확인될 수 있다. 예컨대, 도 13을 참조하면, 일정 부분에서 중첩된 두 개의 경계 박스 (b1, b2)가 존재하고, 각 경계 박스에 대 응하는 V2X 메시지들이 수신될 수 있다. 이 경우, 제1 객체 (o1)에 대한 제1 경계 박스 (b1)는 적절하게 생성된 것으로 판단될 수 있으나, 제2 객체 (o2)에 대한 제2 경계 박스 (b2)는 일부가 가려져 있을 수 있다 (또는, 제2 객체가 다른 더 큰 객체 (e.g. o1+o2)의 일부인 것으로 판단될 수 있음). 구체적으로, 제1 객체 (o1)가 자전거 (cycle)로 정확히 검출될 경우, 제2 객체 (o2)는 보행자 또는 사람의 부분적인 형태로서 분류될 수 있다. 예컨 대, 제2 객체 (o2)에 대응하는 영상은 상기 자전거 뒤에 가려진 사람의 형태이거나, 자전거 타는 사람 형태 (o1+o2 형태)인 것일 수 있다. 즉, 제2 경계 박스 (b2)가 가려진 영역에 기반하여 객체의 타입 또는 형태가 결 정될 수 있다. 예컨대, 제2 경계 박스 (b2)는 전혀 가려지지 않았거나 (b2의 ground level = (p2, q2)), 제1 경계 박스 (b1)에 의해 전체적으로 가려져 (b2의 ground level = (p2, q0)) 있거나, (p2, q2) 및 (p2, q0) 사 이의 특정 비율로 가려져 있을 수도 있다 (b2의 ground level의 y값 GL_y라고 할 때, q0 <= GL_y <= q2). 제2 경계 박스 (b2)가 전혀 가려져 있지 않은 경우, 제2 객체 (o2)의 예상 위치 (상대위치)는 제2 경계 박스 (b2)의 ground level인 (p2, q2)로부터 GL(p2, q2)로 도출될 수 있다. 이 경우, 제2 객체 (o2)의 크기 (h2)는 하기의 수학식 2에 의해 산출 또는 추정될 수 있다. 수학식 2"}
{"patent_id": "10-2024-7017387", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "한편, 제2 경계 박스 (b2)가 제1 객체 (o1)에 의해 완전히 가려져 있는 경우, 제2 객체 (o2)의 예상 위치 (상대 위치)는 제2 경계 박스 (b2)의 ground level인 (p2, q0)로부터 GL(p2, q0)가 도출될 수 있다. 이 경우, 제2 객체 (o2)의 크기는 하기의 수학식 3에 의해 산출 또는 추정될 수 있다. 수학식 3"}
{"patent_id": "10-2024-7017387", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "즉, 상기 GL(p2, q2) ~ GL(p2, q0)의 위치와 연관되어 있는 (즉, 오차범위 이내에 있는) V2X 메시지가 존재하는 경우, 상기 V2X 메시지가 가리키고 있는 타입 정보 (또는, 장치 타입에 대한 정보)에 따른 통상적인 (typical) 또는 미리 정의된 size의 값(의 범위)와 상기 h2 값의 범위가 일치하는지 비교하여 상기 산출된 h2 값이 타당한 지 검증될 수 있다. 이와 같은 방식을 통해, 상기 V2X 메시지와 상기 h2 값의 객체가 서로 연관된 것이 확인될 수 경우, 상기 검출 모델은 상기 연관 관계에 기반하여 일부가 가려진 객체에 대한 객체 검출을 위한 학습을 수 행할 수 있다. 상술한 바와 같이, 수신된 V2X 메시지의 위치 정보와 이에 대응하는 경계 박스가 1:1로 매칭되는 경우, 상기 경 계 박스에 대한 객체 검출 및 분류가 진행될 수 있고, 1:1 매칭되지 않은 경우에는 수신된 V2X 메시지의 위치 정보에 대응하는 경계 박스를 매칭시키는 동작이 선행될 필요가 있다. 이하에서는, 상기 매칭과 관련된 동작을 자세히 설명한다. Object-message matching 상기 검출 모델이 R-CNN 등에 기반하여 (지역화 동작을 통해) 제안하는 검출 영역들은 객체-메시지 매칭되기 전 까지는 객체에 대응하는 후보 제안 영역들일 뿐이고, 상기 제안 영역들은 상기 검출 모델의 학습의 수행에 적합 하지 않을 수 있다. 1개의 객체 주변에 복수의 메시지가 수신되거나, 1개의 메시지의 주변에 복수의 객체가 존재하는 경우, 각 객체 의 궤적과 각 메시지의 궤적 (예컨대, 일정 시간 동안 추적하여 획득된 궤적)을 비교하여, 궤적이 유사도가 가 장 높은 (e.g. pair사이의 상대적 거리/오차가 작은 것) 객체와 메시지를 매칭되는 페어로 결정할 수 있다. 한 편 복수의 객체들 주변에서 복수의 메시지가 수신된 경우, 상기 영상에서 검출되는 객체들과 상기 복수의 메시 지들 사이에 가능한 모든 페어 조합들에 기반하여 최적의 매칭 페어를 결정할 수도 있다. 한편, 인공지능 학습의 보조를 위한 객체-메시지 간의 매칭의 경우, 대상 객체를 원활 (seamless)하게 계속 추 적 (tracking)하면서 매칭을 유지하는 것이 반드시 필요한 것은 아니다. 예컨대, 전체 경로 중 특징 점이 될만 한 몇 가지 각도, 위치에서 촬영된 영상들에 대해서 충분한 조합의 (예컨대, 정면, 측면, 측면 45도 등) 영상이 검출되고, 상기 검출된 영상을 상기 검출 모델에 입력하는 것만으로 충분할 수 있다. 한편, 앞서 설명한 도 11 (b) 또는 도 11(d)를 참조하면, 제5 객체 (o5)에 대한 제5 경계 박스 (b5)는 제5 메시 지 (g5)의 위치 (GPS) 정보와 서로 어긋난 상태이다. 물론, 경계 박스가 대응하는 객체에 대한 세그먼테이션이 정확하지 않을 수 있고, 대상 객체의 주변에 생성된 것이므로 추가적인 오차가 고려될 수 있다. 또한, 메시지에 포함된 GPS 위치 정보가 상대적으로 긴 주기로 수신될 수도 있는바, 영상의 획득 주기와 맞추기 위해서 일부 구 간은 예측하거나 (linear prediction (or extrapolation), polynomial fitting 등) 또는 GPS 정보의 sample값 들 사이에서 적당한 방식으로 보간 (e.g. linear interpolation) 하여 상기 메시지와 관련된 위치정보를 획득 및 사용할 수도 있다. 이와 같은 가정을 통해, 시간의 경과에 따라 제5 경계 박스 (b5)와 제5 메시지의 위치 정 보 (g5)가 서로 오차 범위 내에서 위치할 수도 있다. 예컨대, 소정의 조건을 만족 시 (예컨대, t1초 동안 서로 오차범위 안에서 만나는 경우, 오차범위를 t2초 이상 벗어나지 않는 경우), 제5 경계 박스 (b5)와 제5 메시지 (g5)의 위치 정보는 서로 동일한 객체에 대한 것으로 매칭 페어로 결정될 수 있다. 도 14는 V2X 메시지에 기반하여 영상에서 객체를 검출하는 검출 모델을 학습시키는 방법을 설명하기 위한 흐름 도이다. 상술한 바와 같이, R-CNN에 기반한 검출 모델의 학습은 상기 V2X 메시지에 기반한 기반한 검출 영역의 제안 및 분류를 통해 보다 효율적이면서 자동적으로 수행될 수 있다. 이 때, 가급적 유효한 객체에 대한 학습 데이터에기반한 학습으로 상기 검출 모델의 검출 영역의 제안 및 분류의 정확도를 크게 향상시킬 수 있다. 도 14를 참조하면, 제1 장치는 V2X 메시지를 추가적으로 고려한 과정들을 통해 객체 검출을 위한 검출 모델을 학습시킬 수 있다. 구체적으로, 제1 장치는 카메라부터 획득한 입력 영상 (영상, 스냅 샷 등)이 학습 데이터로 검출 모델을 입력될 수 있다 (S111). 또한, 상기 학습 데이터는 상기 입력 영상과 연관 또는 관련되어 수신된 V2X 메시지들을 더 포 함할 수 있다. 상기 제1 장치는 상기 학습 데이터에 포함된 V2X 메시지들 각각에 기반하여 일정 범위 내에 있는 경계 박스 (또는, 경계 박스 영역)들을 탐색하도록 상기 검출 모델을 학습시킬 수 있다 (S112). 예컨대, 상기 검출 모델은 상기 영상에 대해 추출된 특징들에 기반하여 객체의 검출이 예측되는 모든 경계 박스들 (예컨대, 2000개의 영역들)을 모두 찾지 않고, 상기 V2X 메시지에 포함된 위치 정보로부터 일정 범위 (예컨대, 실제 좌표 기준 50m 이내의 범위, 또는 (상기 위치정보에 대해 mapping된) 영상좌표 기준으로 가로 ±n pixel, 세로 ±m pixel 이내의 범위 등) 내에서만 상기 객체의 검출이 예측되는 경계 박스들을 탐색할 수 있다 (S113). 다음으로, 상기 제1 장치는 상기 V2X 메시지들에 포함된 정보에 기반하여 상기 탐색된 경계 박스들 중 V2X 메시 지와 매칭되는 경계 박스를 추출하도록 상기 검출 모델을 학습시킬 수 있다 (S115). 다만, 경계 박스들이 중첩 되어 객체의 형상 일부가 가려져 객체 정보 (위치 정보, 객체 size 등)이 정확히 파악되기 어렵거나, V2X 메시 지와 대응하는 경계 박스가 복수 개일 수 있다. 이 경우, 상기 경계 박스에 대응하는 객체가 분류를 위해 유효 한 객체인지 판단하기 어려울 수 있다. 전자의 경우, 상기 제1 장치는 상기 경계 박스들의 배치 특성 (예컨대, 픽셀 상 배치 특징)에 기반하여 객체의 위치 및 크기를 추정하고, 추정된 객체의 위치 및 크기와 연관된 객체 타입 및 위치 정보를 포함하는 V2X 메시지가 있는지 확인하여 상기 경계 박스에 대응하는 객체가 유효한 객체인 지 판별할 수 있도록 상기 검출 모델을 학습시킬 수 있다. 후자의 경우, 상기 제1 장치는 미리 정의된 매칭 방 법을 통해 상기 V2X 메시지와 이에 대응한 경계 박스들 간에 조합 가능한 모든 페어들 중에서 불필요한 페어들 을 제거하도록 상기 검출 모델을 학습시킬 수 있다. 이와 같은 과정을 통해 상기 제1 장치는 상기 V2X 메시지를 통해 학습에 유효한 객체에 대한 경계 박스를 선별 또는 결정하도록 상기 검출 모델을 학습시킬 수 있다. 다음으로, 상기 제1 장치는 상기 선별된 경계 박스들에 대해 CNN 등의 방식으로 객체 검출을 수행하고 (S114), 상기 검출된 객체에 대한 객체 정보를 분류 정보를 출력하도록 상기 검출 모델을 학습시킬 수 있다 (S115). 또 한, 상기 제1 장치는 상기 V2X 메시지에 포함된 위치 및 타입 정보에 기반하여 상기 분류 정보가 유효한지 여부 를 추가적으로 확인하여 상기 분류 정보를 업데이트 또는 수정하도록 상기 검출 모델을 학습시킬 수 있다 (S116). 상기 제1 장치는 상술한 과정들을 통해 상기 검출 모델의 파라미터들을 조정하여 상기 검출 모델의 손 실 함수가 최소화되도록 (즉, 미리 결정된 정확도로 객체를 검출하도록) 상기 검출 모델을 학습시킬 수 있다. 이와 같은 학습 동작으로 학습된 검출 모델은 상기 영상으로부터 추출된 특징들뿐만 아니라, 상기 영상과 관련 되어 수신된 V2X 메시지들에 포함된 위치 정보 및 타입 정보들을 더 고려하여 보다 정확하고 신속하게 분류 정 보를 출력할 수 있다. 이하에서는 상술한 V2X 메시지 또는 제2 메시지에 기반하여 영상에 객체를 검출하는 검출 모델을 학습시키고, 상기 학습된 검출 모델에 기반하여 제1 메시지를 전송하는 방법을 자세히 설명한다. 도 15는 제1 장치가 영상 및 영상에 대응하여 수신된 메시지에 기반하여 검출 모델을 학습시키는 방법을 설명하 기 위한 도면이다. 상기 제1 장치는 상기 영상 및 상기 영상에 연관 또는 대응하여 수신된 V2X 메시지 (이하, 연관 메시지)를 포함 하는 학습 데이터에 기반하여 영상에서 객체를 검출하도록 검출 모델을 학습시킬 수 있다. 여기서, 후술할 검출 영역은 상술한 경계 박스와 대응한 구성이다. 한편, 상기 검출 모델에 대한 학습은 영상에서 객체 검출이 필요 한 검출 영역을 예측 또는 특정하는 지역화 동작 관련 학습 및/또는 상기 검출 영역에 대한 객체 정보를 출력하 는 분류 동작 관련 학습을 포함할 수 있다. 또는, 상기 검출 모델은 상기 지역화 동작 관련 학습에 따른 지역화 모델 및 분류 동작 관련 학습에 따른 분류 모델을 포함할 수 있다. 도 15를 참조하면, 상기 제1 장치는 영상에서의 객체 검출과 관련된 학습을 위한 상기 학습 데이터를 상기 검출 모델에 입력될 수 있다 (S201). 상술한 바와 같이, 상기 학습 데이터는 특정 지리적 영역들에서의 차량, 자전거 등 객체를 촬영한 영상 및 상기 영상이 획득된 시점과 대응하는 시점에서 상기 특정 지리적 영역과 관련하여 수 신된 연관 메시지들을 포함할 수 있다. 상기 제1 장치는 상기 학습 데이터에 포함된 영상 및 이에 대응하는 연관 메시지들에 기반하여 객체의 검출이 필요한 검출 영역들을 예측하도록 상기 검출 모델을 학습 (또는, 지역화 동작 관련 학습)시킬 수 있다 (S203).구체적으로, 상기 검출 모델은 상기 영상에 대해 특징들을 추출하고, 상기 추출된 특징들 및 상기 연관 메시지 에 포함된 제1 위치 정보에 기반하여 적어도 하나의 검출 영역을 예측할 수 있다. 즉, 상기 검출 모델은 상기 추출된 특징들 및 제1 위치 정보에 기반하여 상기 영상과 관련된 지역화 동작을 수행하여 상기 적어도 하나의 검출 영역을 예측할 수 있다. 예컨대, 상기 검출 모델은 상기 제1 위치 정보를 기준으로 미리 설정된 범위에 대 응하는 상기 영상에서의 영역을 상기 적어도 하나의 검출 영역으로 예측할 수 있다. 또는, 상기 검출 모델은 상 기 영상에 대한 특징들에 기반하여 객체가 검출될 수 있는 검출 영역들을 예측 또는 결정하고, 상기 결정된 검 출 영역들 중에서 상기 제1 위치 정보에 대응한 적어도 하나의 검출 영역 (예컨대, 상기 제1 위치 정보와 대응 한 픽셀을 포함하거나, 상기 픽셀로부터 미리 설정된 거리 이내의 픽셀을 포함하는 검출 영역)을 예측할 수 있 다. 또는, 상기 제1 장치는 상기 연관 메시지에 포함된 타입 정보에 기반하여 상기 적어도 하나의 검출 영역의 크기 및 모양을 조정할 수 있도록 상기 검출 모델을 학습시킬 수 있다. 예컨대, 상기 검출 모델은 상기 타입 정보가 자전거 타입인 경우에 상기 자전거 타입에 대해 미리 정의된 객체 크기와 대응하도록 상기 적어도 하나의 검출 영역의 크기 및 모양을 조정할 수 있다. 또는, 상기 검출 모델은 수학식 1에 기반하여 상기 적어도 하나의 검출 영역에서의 객체 높이를 추정할 수 있고, 추정된 객체 높이와 상기 타입 정보에 대응하여 미리 정의된 높이 (또 는, 크기, 너비, 모양)가 상이할 경우에 상기 적어도 하나의 검출 영역의 크기 또는 모양을 상기 타입 정보와 대응하도록 조정할 수 있다. 또는, 상기 적어도 하나의 검출 영역이 오버랩된 검출 영역을 포함하는 경우, 상기 제1 장치는 상기 오버랩된 검출 영역 및 이에 대응하는 연관 메시지에 포함된 타입 정보에 기반하여 상기 오버랩된 검출 영역을 상기 객체 정보의 검출과 관련된 학습에서 유효한 검출 영역인지 여부를 결정하도록 상기 검출 모델을 학습시킬 수 있다. 예컨대, 상기 검출 모델은 상기 오버랩된 검출 영역과 관련된 픽셀 좌표 정보에 기반하여 수학식 2 또는 수학식 3에 기반하여 상기 오버랩된 검출 영역에서의 객체 높이 또는 객체 크기를 추정할 수 있다. 상기 제1 장치 또는 상기 검출 모델은 상기 추정된 객체 높이 (또는, 객체 크기)가 상기 타입 정보에 따른 객체 높이로부터 미리 설 정된 범위를 벗어난 경우에 상기 오버랩된 검출 영역을 후술할 객체 정보의 검출을 위한 학습 대상으로 사용하 지 않을 수 있다. 이와 달리, 상기 제1 장치 또는 상기 검출 모델은 상기 추정된 객체 높이 (또는, 객체 크기) 가 상기 타입 정보에 따른 객체 높이로부터 미리 설정된 범위 내인 경우에 상기 오버랩된 검출 영역도 상기 객 체 정보의 검출과 관련된 학습 대상으로 사용 또는 결정할 수 있다. 또는, 상기 제1 장치는 상기 적어도 하나의 검출 영역을 상술한 방식에 따라 직접 결정하고, 상기 검출 영역을 상기 검출 모델에 입력할 수도 있다. 다음으로, 상기 제1 장치는 상기 예측된 적어도 하나의 검출 영역에 대해서 객체 검출 또는 분류 정보를 출력하 도록 상기 검출 모델을 학습 (예컨대, 상기 분류 동작 관련 학습)시킬 수 있다 (S205). 상술한 바와 같이, 상기 검출 모델은 CNN에 기반하여 상기 적어도 하나의 검출 영역에 대응하는 영상에서의 특징들을 이용하여 상기 적 어도 하나의 검출 영역에서 객체를 검출하고, 상기 검출된 객체에 대한 객체 정보 또는 분류 정보를 출력할 수 있다. 이 경우, 상기 제1 장치는 상기 연관 메시지에 포함된 정보 (타입 및 위치 정보)에 기반하여 상기 검출 모델을 학습시킬 수 있다. 구체적으로, 상기 제1 장치는 상기 검출 모델이 출력한 객체 정보 (또는, 이에 대응 한 출력 값)와 상기 연관 메시지에 포함된 정보 (또는 이에 대응한 출력 값) 간의 차이 값이 최소화 (즉, 상기 검출 모델과 관련된 손실 함수의 값이 최소화)되도록 상기 검출 모델과 관련된 파라미터들을 조정하여 상기 검 출 모델을 학습시킬 수 있다. 이 경우, 상기 검출 모델은 상기 영상에서 검출될 객체에 대한 별도의 레이블 정보 (타입 정보 등)를 입력 받지 않더라도 상기 연관 메시지를 통해 간접적으로 상기 검출될 객체에 레이블 정보를 획득할 수 있고, 상기 획득한 레이블 정보에 기반하여 정확하고 신속하게 상기 영상에서 객체를 검출할 수 있도록 학습될 수 있다. 또는, 상기 제1 장치는 상기 학습이 완료된 검출 모델이 출력한 객체 정보 및 적어도 하나의 주변 단말 또는 적 어도 하나의 제2 장치로부터 수신된 적어도 하나의 제2 메시지에 기반하여 적어도 하나의 제1 메시지를 전송할 수 있다. 이하에서는, 상술한 방식에 따라 학습이 완료된 검출 모델에 기반하여 획득한 객체 정보에 기반하여 상기 제2 메시지에 포함된 정보를 보정하고, 상기 제1 메시지를 전송하는 방법을 자세히 설명한다. 도 16은 제1 장치가 검출 모델을 이용하여 획득한 객체 정보 및 수신된 제2 메시지에 기반하여 제1 메시지를 전 송하는 방법을 설명하기 위한 도면이다. 상기 제1 장치는 도 11 내지 도 15에서 설명한 바와 같이 학습된 검출 모델을 이용하여 영상에서의 객체에 대한 객체 정보를 획득할 수 있다. 이 경우, 상기 검출 모델은 상기 영상과 관련된 수신된 제2 메시지에 기반하여 적 어도 하나의 검출 영역을 제안 또는 결정할 수 있다. 또는, 상기 적어도 하나의 검출 영역에 대한 객체 정보 또 는 분류 정보의 출력에서는 학습 방법과 달리 상기 제2 메시지에 포함된 정보를 이용하지 않을 수 있다. 예컨대, 상기 검출 모델은 학습 과정과 달리 상기 검출 영역에서 객체 정보를 예측할 경우에 상기 제2 메시지에 포함된 타입 정보를 고려하지 않을 수 있다. 또는, 상기 검출 모델은 상기 제2 메시지에 기반하여 상기 영상에 서의 적어도 하나의 검출 영역을 제안하면서 상기 객체 정보를 출력할 수도 있다. 도 16을 참조하면, 상기 제1 장치는 카메라 등을 이용하여 특정 지리적 영역에 대한 영상을 포함하는 센싱 정보 를 획득할 수 있다 (S301). 여기서, 상기 제1 장치는 복수의 카메라들을 통해 복수의 지리적 영역들에 대한 영 상 또는 영상 정보를 획득할 수도 있다. 다음으로, 상기 제1 장치는 상기 센싱 정보와 관련 또는 연관된 제2 메시지를 수신 받을 수 있다 (S303). 구체 적으로, 상기 제1 장치는 사이드링크 통신에 대한 설정 정보 (이하, 제1 설정 정보) 및/또는 업링크 통신에 대 한 설정 정보 (이하, 제2 설정 정보) 중 어느 하나에 기반하여 상기 제2 메시지를 수신 받을 수 있다. 여기서, 제1 설정 정보는 사이드링크 통신과 관련된 설정 정보로써, 상기 사이드링크 신호의 송수신을 위한 자원 풀에 대한 정보, 전송 전력 제어 파라미터, 서브 채널들, MCS (Modulation Coding Scheme) 레벨의 최대/최소 값, CBR (channel busy ratio) 범위, 상기 CBR 범위 별 전송 파라미터, 임계 속도 등의 정보를 포함할 수 있다. 상 기 제2 설정 정보는 업링크 신호의 송수신과 관련된 설정 정보로써, 업링크 신호와 관련된 서브캐리어 스페이싱, 자원 블록 크기, 전송 전력 제어 파라미터, 및 주파수 대역에 대한 정보 등을 포함할 수 있다. 예컨대, 상기 제2 메시지가 사이드링크에 기반한 경우, 상기 제1 장치는 상기 제1 설정 정보에 기반하여 상기 제2 메시지를 수신 받거나, 상기 제1 메시지를 전송할 수 있다. 이 경우, 상기 제2 메시지 또는 상기 제1 메시 지는 PSCCH (Physical Sidelink Control Channel) 및 PSSCH (Physical Sidelink Shared Channel) 중 적어도 하나에 기반하여 전송될 수 있다. 예컨대, 상기 제1 장치는 상기 제1 메시지의 전송을 스케쥴링하는 PSCCH (또 는, 제1 SCI)를 수신 받을 수 있고, 상기 수신된 PSCCH 및/또는 상기 제1 SCI에 기반하여 상기 PSSCH를 통해 전 달되는 상기 제1 메시지 (및/또는 제2 SCI)를 수신 받을 수 있다. 이 경우, 상기 제1 장치는 상기 제1 SCI 및/ 또는 상기 제2 SCI에 기반하여 상기 제2 메시지를 수신 및/또는 디코딩할 수 있다. 또는, 상기 제2 메시지는 CAM (Cooperative Awareness Message), VAM (Vulnerable road user awareness message), CPM (Collective Perception Message), BSM (Basic Safety Message) 및 PSM (Pedestrian Safety message) 중 어느 하나일 수 있다. 다음으로, 상기 제1 장치는 상기 영상을 상기 검출 모델 (학습이 완료된 검출 모델)에 입력하여 상기 영상에서 검출되는 적어도 하나의 객체 각각에 대한 객체 정보 (이하, 검출 객체 정보)를 획득할 수 있다 (S305). 또한, 상기 제1 장치는 상기 검출 모델에 상기 영상과 연관되어 수신된 제2 메시지도 함께 입력할 수 있다. 이 경우, 상기 검출 모델은 상기 제2 메시지에 포함된 정보 (예컨대, 위치 정보, 타입 정보, 이동성 정보)에 기반하여 상 기 영상에서의 대응되는 객체가 검출 가능한 영역인 적어도 하나의 검출 영역을 결정 또는 획득하고, 상기 적어 도 하나의 검출 영역에서 검출된 객체에 대한 객체 정보 (검출된 객체의 위치, 타입)를 출력할 수 있다. 또한, 상기 제1 장치는 상기 제2 메시지로부터 직접 객체 정보 (이하, 수신 객체 정보)를 획득할 수 있다. 다음으로, 상기 제1 장치는 상기 검출 객체 정보에 기반하여 상기 수신 객체 정보를 보정할 수 있고, 상기 보정 된 수신 객체 정보를 포함하는 제1 메시지를 전송할 수 있다 (S307). 예컨대, 상기 수신 객체 정보는 제1 위치 정보 및 제1 타입 정보를 포함하고, 상기 검출 객체 정보는 제2 위치 정보 및 제2 타입 정보를 포함할 수 있다. 상기 제1 위치 정보는 상기 제2 장치에 포함된 GPS 등을 통해 측정된 상기 제2 장치의 위치를 포함하고, 상기 제2 위치 정보는 상기 영상에 기반하여 상기 검출 모델이 예측한 상기 제2 장치의 위치를 포함할 수 있다. 또한, 상기 제1 타입 정보는 상기 제2 장치가 자동으로 감지 또는 미리 설정된 객체에 대한 장치 타입 (예컨대, 보행자, 자동차, 오토바이, 자전거 등)에 대한 정보를 포함하고, 상기 제2 타입 정보는 상기 영상에 기반하여 상기 검출 모델이 검출하는 상기 제2 장치의 객체 타입에 대한 정보를 포함할 수 있다. 이 경우, 상기 제1 장치 는 상기 제1 위치 정보와 상기 제2 위치 정보, 상기 제1 타입 정보와 상기 제2 타입 정보가 서로 상이한지 판단 할 수 있다. 예컨대, 상기 제1 위치 정보와 상기 제2 위치 정보가 서로 상이한 경우, 상기 제1 장치는 상기 제2 위치 정보에 대응하도록 상기 제1 위치 정보를 보정할 수 있고, 상기 제1 타입 정보와 상기 제2 타입 정보가 상 이한 경우에 상기 제1 장치는 상기 제2 타입 정보에 대응하도록 상기 제1 타입 정보를 보정할 수 있다. 상기 제 1 장치는 상기 보정된 제1 위치 정보 및/또는 상기 제1 타입 정보를 포함하는 제1 메시지를 통해 상기 제2 장치 의 제2 메시지를 주변 단말들에게 전달할 수 있다.이와 같이, 상기 제1 장치는 상기 획득 객체 정보를 이용하여 상기 수신된 제2 메시지에 포함된 수신 객체 정보 를 보정할 수 있고, 보정된 수신 객체 정보를 포함하는 제1 메시지를 통해 주변 단말들 또는 주변 장치들에게 상기 제2 메시지와 관련된 정보를 전달할 수 있다. 발명이 적용되는 통신 시스템 예 이로 제한되는 것은 아니지만, 본 문서에 개시된 본 발명의 다양한 설명, 기능, 절차, 제안, 방법 및/또는 동작 순서도들은 기기들간에 무선 통신/연결(예, 5G)을 필요로 하는 다양한 분야에 적용될 수 있다. 이하, 도면을 참조하여 보다 구체적으로 예시한다. 이하의 도면/설명에서 동일한 도면 부호는 다르게 기술하지 않는 한, 동일하거나 대응되는 하드웨어 블록, 소프트웨어 블록 또는 기능 블록을 예시할 수 있다. 도 17은 본 발명에 적용되는 통신 시스템을 예시한다. 도 17를 참조하면, 본 발명에 적용되는 통신 시스템은 무선 기기, 기지국 및 네트워크를 포함한다. 여기서, 무선 기기는 무선 접속 기술(예, 5G NR(New RAT), LTE(Long Term Evolution))을 이용하여 통신을 수행하는 기 기를 의미하며, 통신/무선/5G 기기로 지칭될 수 있다. 이로 제한되는 것은 아니지만, 무선 기기는 로봇(100a), 차량(100b-1, 100b-2), XR(eXtended Reality) 기기(100c), 휴대 기기(Hand-held device)(100d), 가전(100e), IoT(Internet of Thing) 기기(100f), AI기기/서버를 포함할 수 있다. 예를 들어, 차량은 무선 통신 기능 이 구비된 차량, 자율 주행 차량, 차량간 통신을 수행할 수 있는 차량 등을 포함할 수 있다. 여기서, 차량은 UAV(Unmanned Aerial Vehicle)(예, 드론)를 포함할 수 있다. XR 기기는 AR(Augmented Reality)/VR(Virtual Reality)/MR(Mixed Reality) 기기를 포함하며, HMD(Head-Mounted Device), 차량에 구비된 HUD(Head-Up Display), 텔레비전, 스마트폰, 컴퓨터, 웨어러블 디바이스, 가전 기기, 디지털 사이니지(signage), 차량, 로봇 등의 형태로 구현될 수 있다. 휴대 기기는 스마트폰, 스마트패드, 웨어러블 기기(예, 스마트워치, 스마트글래스), 컴퓨터(예, 노트북 등) 등을 포함할 수 있다. 가전은 TV, 냉장고, 세탁기 등을 포함할 수 있다. IoT 기기는 센서, 스마트미터 등을 포함할 수 있다. 예를 들어, 기지국, 네트워크는 무선 기기로도 구현될 수 있으며, 특정 무선 기기(200a)는 다른 무선 기기에게 기지국/네트워크 노드로 동작할 수도 있다. 무선 기기(100a~100f)는 기지국을 통해 네트워크와 연결될 수 있다. 무선 기기(100a~100f)에는 AI(Artificial Intelligence) 기술이 적용될 수 있으며, 무선 기기(100a~100f)는 네트워크를 통해 AI 서 버와 연결될 수 있다. 네트워크는 3G 네트워크, 4G(예, LTE) 네트워크 또는 5G(예, NR) 네트워크 등 을 이용하여 구성될 수 있다. 무선 기기(100a~100f)는 기지국/네트워크를 통해 서로 통신할 수도 있 지만, 기지국/네트워크를 통하지 않고 직접 통신(e.g. 사이드링크 통신(sidelink communication))할 수도 있다. 예를 들어, 차량들(100b-1, 100b-2)은 직접 통신(e.g. V2V(Vehicle to Vehicle)/V2X(Vehicle to everything) communication)을 할 수 있다. 또한, IoT 기기(예, 센서)는 다른 IoT 기기(예, 센서) 또는 다른 무선 기기 (100a~100f)와 직접 통신을 할 수 있다. 무선 기기(100a~100f)/기지국, 기지국/기지국 간에는 무선 통신/연결(150a, 150b, 150c)이 이 뤄질 수 있다. 여기서, 무선 통신/연결은 상향/하향링크 통신(150a)과 사이드링크 통신(150b)(또는, D2D 통신), 기지국간 통신(150c)(e.g. relay, IAB(Integrated Access Backhaul)과 같은 다양한 무선 접속 기술(예, 5G N R)을 통해 이뤄질 수 있다. 무선 통신/연결(150a, 150b, 150c)을 통해 무선 기기와 기지국/무선 기기, 기지국과 기지국은 서로 무선 신호를 송신/수신할 수 있다. 예를 들어, 무선 통신/연결(150a, 150b, 150c)은 다양한 물리 채널을 통해 신호를 송신/수신할 수 있다. 이를 위해, 본 발명의 다양한 제안들에 기반하여, 무선 신호의 송신/ 수신을 위한 다양한 구성정보 설정 과정, 다양한 신호 처리 과정(예, 채널 인코딩/디코딩, 변조/복조, 자원 매 핑/디매핑 등), 자원 할당 과정 등 중 적어도 일부가 수행될 수 있다. 본 발명이 적용되는 무선 기기 예 도 18은 본 발명에 적용될 수 있는 무선 기기를 예시한다. 도 18을 참조하면, 제1 무선 기기와 제2 무선 기기는 다양한 무선 접속 기술(예, LTE, NR)을 통해 무 선 신호를 송수신할 수 있다. 여기서, {제1 무선 기기, 제2 무선 기기}은 도 17의 {무선 기기(100x), 기지국} 및/또는 {무선 기기(100x), 무선 기기(100x)}에 대응할 수 있다. 제1 무선 기기는 하나 이상의 프로세서 및 하나 이상의 메모리를 포함하며, 추가적으로 하나 이 상의 송수신기 및/또는 하나 이상의 안테나을 더 포함할 수 있다. 프로세서는 메모리 및/ 또는 송수신기를 제어하며, 본 문서에 개시된 설명, 기능, 절차, 제안, 방법 및/또는 동작 순서도들을 구현하도록 구성될 수 있다. 예를 들어, 프로세서는 메모리 내의 정보를 처리하여 제1 정보/신호를 생 성한 뒤, 송수신기을 통해 제1 정보/신호를 포함하는 무선 신호를 전송할 수 있다. 또한, 프로세서는 송수신기를 통해 제2 정보/신호를 포함하는 무선 신호를 수신한 뒤, 제2 정보/신호의 신호 처리로부터 얻 은 정보를 메모리에 저장할 수 있다. 메모리는 프로세서와 연결될 수 있고, 프로세서의 동 작과 관련한 다양한 정보를 저장할 수 있다. 예를 들어, 메모리는 프로세서에 의해 제어되는 프로세 스들 중 일부 또는 전부를 수행하거나, 본 문서에 개시된 설명, 기능, 절차, 제안, 방법 및/또는 동작 순서도들 을 수행하기 위한 명령들을 포함하는 소프트웨어 코드를 저장할 수 있다. 여기서, 프로세서와 메모리(10 4)는 무선 통신 기술(예, LTE, NR)을 구현하도록 설계된 통신 모뎀/회로/칩셋의 일부일 수 있다. 송수신기(10 6)는 프로세서와 연결될 수 있고, 하나 이상의 안테나를 통해 무선 신호를 송신 및/또는 수신할 수 있다. 송수신기는 송신기 및/또는 수신기를 포함할 수 있다. 송수신기는 RF(Radio Frequency) 유닛과 혼용될 수 있다. 또는, 송수신기는 미리 설정된 거리로 분산된 제1 안테나 및 제2 안테나를 포함할 수 있 다. 본 발명에서 무선 기기는 통신 모뎀/회로/칩셋을 의미할 수도 있다. 구체적으로, 제1 무선 기기는 V2X 통신 모듈을 구비한 RSU (roadside unit)이거나 SoftV2X 서버인 제1 장 치일 수 있다. 제1 무선 기기는 상기 RF 송수신기와 연결되는 프로세서 와 메모리를 포함할 수 있다. 메모리는 도 11 내지 도 16에서 설명된 실시예들과 관련된 동작을 수행할 수 있는 적어도 하나의 프 로그램들이 포함될 수 있다. 프로세서는 센싱 정보를 획득하고, 송수신기를 제어하여 설정 정보에 기반하여 제2 장치로부터 제1 위치 정보 및 제1 타입 정보가 포함된 제2 메시지를 수신하고, 상기 센싱 정보에 포함된 영상 및 상기 제2 메시 지를 인공 신경망에 기반한 검출 모델에 입력하여 객체 정보를 획득하고, 상기 객체 정보 및 제2 메시지에 기초 하여 상기 제2 메시지를 전달하기 위한 상기 제1 메시지를 전송하며, 상기 설정 정보는 사이드링크 신호에 대한 제1 설정 정보 또는 업링크 신호에 대한 제2 설정 정보를 포함하고, 상기 제1 설정 정보는 상기 사이드링크 신 호의 송수신을 위한 자원 풀에 대한 정보, 전송 전력 제어 파라미터 및 서브 채널들에 대한 정보를 포함하며, 상기 제2 설정 정보는 서브캐리어 스페이싱, 자원 블록 크기, 전송 전력 제어 파라미터, 및 주파수 대역에 대한 정보를 포함하고, 상기 제2 메시지는 상기 설정 정보가 상기 제2 설정 정보인 것에 기초하여 PSSCH 및 PSCCH 중 적어도 하나에 기반하여 전송되고, 상기 검출 모델은 상기 영상에 대해 추출된 특징들 및 상기 제1 위치 정보에 기반하여 적어도 하나의 검출 영역을 예측하고, 상기 적어도 하나의 검출 영역에 대해 상기 제1 타입 정보와 대 응한 객체 정보가 출력되도록 미리 학습될 수 있다. 프로세서 는 메모리에 포함된 프로그램에 기초하 여 도 11 내지 도 16에서 설명한 영상 처리와 관련된 동작들을 수행할 수 있다. 또는, 프로세서 및 메모리는 칩 셋에 포함될 수 있다. 상기 칩 셋은 칩 셋은 적어도 하나의 프로세 서, 및 상기 적어도 하나의 프로세서와 동작 가능하게 연결되고, 실행될 때, 상기 적어도 하나의 프로세서가 동 작을 수행하도록 하는 적어도 하나의 메모리를 포함하며, 상기 동작은 센싱 정보를 획득하고, 상기 RF 송수신기 를 제어하여 설정 정보에 기반하여 제2 장치로부터 제1 위치 정보 및 제1 타입 정보가 포함된 제2 메시지를 수 신하고, 상기 센싱 정보에 포함된 영상 및 상기 제2 메시지를 인공 신경망에 기반한 검출 모델에 입력하여 객체 정보를 획득하고, 상기 객체 정보 및 제2 메시지에 기초하여 상기 제2 메시지를 전달하기 위한 상기 제1 메시지 를 전송하며, 상기 설정 정보는 사이드링크 신호에 대한 제1 설정 정보 또는 업링크 신호에 대한 제2 설정 정보 를 포함하고, 상기 제1 설정 정보는 상기 사이드링크 신호의 송수신을 위한 자원 풀에 대한 정보, 전송 전력 제 어 파라미터 및 서브 채널들에 대한 정보를 포함하며, 상기 제2 설정 정보는 서브캐리어 스페이싱, 자원 블록 크기, 전송 전력 제어 파라미터, 및 주파수 대역에 대한 정보를 포함하고, 상기 제2 메시지는 상기 설정 정보가 상기 제2 설정 정보인 것에 기초하여 PSSCH 및 PSCCH 중 적어도 하나에 기반하여 전송되고, 상기 검출 모델은 상기 영상에 대해 추출된 특징들 및 상기 제1 위치 정보에 기반하여 적어도 하나의 검출 영역을 예측하고, 상기 적어도 하나의 검출 영역에 대해 상기 제1 타입 정보와 대응한 객체 정보가 출력되도록 미리 학습될 수 있다. 프로세서 는 메모리에 포함된 프로그램에 기초하여 도 11 내지 도 16에서 설명한 상기 영상 처리와 관련된 동작들을 수행할 수 있다. 또는, 무선통신시스템에서 적어도 하나의 컴퓨터 프로그램을 포함하는 컴퓨터 판독 가능한 저장 매체는 적어도 하나의 프로세서가 제1 메시지를 전송하는 동작을 수행하도록 하는 적어도 하나의 컴퓨터 프로그램, 및 상기 적 어도 하나의 컴퓨터 프로그램이 저장된 컴퓨터 판독 가능한 저장 매체를 포함하고, 상기 동작은 센싱 정보를 획 득하고, 상기 RF 송수신기를 제어하여 설정 정보에 기반하여 제2 장치로부터 제1 위치 정보 및 제1 타입 정보가 포함된 제2 메시지를 수신하고, 상기 센싱 정보에 포함된 영상 및 상기 제2 메시지를 인공 신경망에 기반한 검 출 모델에 입력하여 객체 정보를 획득하고, 상기 객체 정보 및 제2 메시지에 기초하여 상기 제2 메시지를 전달하기 위한 상기 제1 메시지를 전송하며, 상기 설정 정보는 사이드링크 신호에 대한 제1 설정 정보 또는 업링크 신호에 대한 제2 설정 정보를 포함하고, 상기 제1 설정 정보는 상기 사이드링크 신호의 송수신을 위한 자원 풀 에 대한 정보, 전송 전력 제어 파라미터 및 서브 채널들에 대한 정보를 포함하고, 상기 제2 설정 정보는 서브캐 리어 스페이싱, 자원 블록 크기, 전송 전력 제어 파라미터, 및 주파수 대역에 대한 정보를 포함하고, 상기 제2 메시지는 상기 설정 정보가 상기 제2 설정 정보인 것에 기초하여 PSSCH 및 PSCCH 중 적어도 하나에 기반하여 전 송되고, 상기 검출 모델은 상기 영상에 대해 추출된 특징들 및 상기 제1 위치 정보에 기반하여 적어도 하나의 검출 영역을 예측하고, 상기 적어도 하나의 검출 영역에 대해 상기 제1 타입 정보와 대응한 객체 정보가 출력되 도록 미리 학습될 수 있다. 제2 무선 기기는 하나 이상의 프로세서, 하나 이상의 메모리를 포함하며, 추가적으로 하나 이상 의 송수신기 및/또는 하나 이상의 안테나를 더 포함할 수 있다. 프로세서는 메모리 및/또 는 송수신기를 제어하며, 본 문서에 개시된 설명, 기능, 절차, 제안, 방법 및/또는 동작 순서도들을 구현 하도록 구성될 수 있다. 예를 들어, 프로세서는 메모리 내의 정보를 처리하여 제3 정보/신호를 생성 한 뒤, 송수신기를 통해 제3 정보/신호를 포함하는 무선 신호를 전송할 수 있다. 또한, 프로세서는 송수신기를 통해 제4 정보/신호를 포함하는 무선 신호를 수신한 뒤, 제4 정보/신호의 신호 처리로부터 얻 은 정보를 메모리에 저장할 수 있다. 메모리는 프로세서와 연결될 수 있고, 프로세서의 동 작과 관련한 다양한 정보를 저장할 수 있다. 예를 들어, 메모리는 프로세서에 의해 제어되는 프로세 스들 중 일부 또는 전부를 수행하거나, 본 문서에 개시된 설명, 기능, 절차, 제안, 방법 및/또는 동작 순서도들 을 수행하기 위한 명령들을 포함하는 소프트웨어 코드를 저장할 수 있다. 여기서, 프로세서와 메모리(20 4)는 무선 통신 기술(예, LTE, NR)을 구현하도록 설계된 통신 모뎀/회로/칩의 일부일 수 있다. 송수신기는 프로세서와 연결될 수 있고, 하나 이상의 안테나를 통해 무선 신호를 송신 및/또는 수신할 수 있다. 송수신기는 송신기 및/또는 수신기를 포함할 수 있다 송수신기는 RF 유닛과 혼용될 수 있다. 본 발명 에서 무선 기기는 통신 모뎀/회로/칩을 의미할 수도 있다. 이하, 무선 기기(100, 200)의 하드웨어 요소에 대해 보다 구체적으로 설명한다. 이로 제한되는 것은 아니지만, 하나 이상의 프로토콜 계층이 하나 이상의 프로세서(102, 202)에 의해 구현될 수 있다. 예를 들어, 하나 이상의 프로세서(102, 202)는 하나 이상의 계층(예, PHY, MAC, RLC, PDCP, RRC, SDAP와 같은 기능적 계층)을 구현할 수 있다. 하나 이상의 프로세서(102, 202)는 본 문서에 개시된 설명, 기능, 절차, 제안, 방법 및/또는 동작 순 서도들에 따라 하나 이상의 PDU(Protocol Data Unit) 및/또는 하나 이상의 SDU(Service Data Unit)를 생성할 수 있다. 하나 이상의 프로세서(102, 202)는 본 문서에 개시된 설명, 기능, 절차, 제안, 방법 및/또는 동작 순 서도들에 따라 메시지, 제어정보, 데이터 또는 정보를 생성할 수 있다. 하나 이상의 프로세서(102, 202)는 본 문서에 개시된 기능, 절차, 제안 및/또는 방법에 따라 PDU, SDU, 메시지, 제어정보, 데이터 또는 정보를 포함하 는 신호(예, 베이스밴드 신호)를 생성하여, 하나 이상의 송수신기(106, 206)에게 제공할 수 있다. 하나 이상의 프로세서(102, 202)는 하나 이상의 송수신기(106, 206)로부터 신호(예, 베이스밴드 신호)를 수신할 수 있고, 본 문서에 개시된 설명, 기능, 절차, 제안, 방법 및/또는 동작 순서도들에 따라 PDU, SDU, 메시지, 제어정보, 데이 터 또는 정보를 획득할 수 있다. 하나 이상의 프로세서(102, 202)는 컨트롤러, 마이크로 컨트롤러, 마이크로 프로세서 또는 마이크로 컴퓨터로 지칭될 수 있다. 하나 이상의 프로세서(102, 202)는 하드웨어, 펌웨어, 소프트웨어, 또는 이들의 조합에 의해 구현될 수 있다. 일 예로, 하나 이상의 ASIC(Application Specific Integrated Circuit), 하나 이상의 DSP(Digital Signal Processor), 하나 이상의 DSPD(Digital Signal Processing Device), 하나 이상의 PLD(Programmable Logic Device) 또는 하나 이상의 FPGA(Field Programmable Gate Arrays)가 하나 이상의 프로 세서(102, 202)에 포함될 수 있다. 본 문서에 개시된 설명, 기능, 절차, 제안, 방법 및/또는 동작 순서도들은 펌웨어 또는 소프트웨어를 사용하여 구현될 수 있고, 펌웨어 또는 소프트웨어는 모듈, 절차, 기능 등을 포함하 도록 구현될 수 있다. 본 문서에 개시된 설명, 기능, 절차, 제안, 방법 및/또는 동작 순서도들은 수행하도록 설 정된 펌웨어 또는 소프트웨어는 하나 이상의 프로세서(102, 202)에 포함되거나, 하나 이상의 메모리(104, 204) 에 저장되어 하나 이상의 프로세서(102, 202)에 의해 구동될 수 있다. 본 문서에 개시된 설명, 기능, 절차, 제 안, 방법 및/또는 동작 순서도들은 코드, 명령어 및/또는 명령어의 집합 형태로 펌웨어 또는 소프트웨어를 사용 하여 구현될 수 있다. 하나 이상의 메모리(104, 204)는 하나 이상의 프로세서(102, 202)와 연결될 수 있고, 다양한 형태의 데이터, 신 호, 메시지, 정보, 프로그램, 코드, 지시 및/또는 명령을 저장할 수 있다. 하나 이상의 메모리(104, 204)는 ROM, RAM, EPROM, 플래시 메모리, 하드 드라이브, 레지스터, 캐쉬 메모리, 컴퓨터 판독 저장 매체 및/또는 이들의 조합으로 구성될 수 있다. 하나 이상의 메모리(104, 204)는 하나 이상의 프로세서(102, 202)의 내부 및/또는 외부에 위치할 수 있다. 또한, 하나 이상의 메모리(104, 204)는 유선 또는 무선 연결과 같은 다양한 기술을 통 해 하나 이상의 프로세서(102, 202)와 연결될 수 있다. 하나 이상의 송수신기(106, 206)는 하나 이상의 다른 장치에게 본 문서의 방법들 및/또는 동작 순서도 등에서 언급되는 사용자 데이터, 제어 정보, 무선 신호/채널 등을 전송할 수 있다. 하나 이상의 송수신기(106, 206)는 하나 이상의 다른 장치로부터 본 문서에 개시된 설명, 기능, 절차, 제안, 방법 및/또는 동작 순서도 등에서 언 급되는 사용자 데이터, 제어 정보, 무선 신호/채널 등을 수신할 수 있다. 예를 들어, 하나 이상의 송수신기 (106, 206)는 하나 이상의 프로세서(102, 202)와 연결될 수 있고, 무선 신호를 송수신할 수 있다. 예를 들어, 하나 이상의 프로세서(102, 202)는 하나 이상의 송수신기(106, 206)가 하나 이상의 다른 장치에게 사용자 데이 터, 제어 정보 또는 무선 신호를 전송하도록 제어할 수 있다. 또한, 하나 이상의 프로세서(102, 202)는 하나 이 상의 송수신기(106, 206)가 하나 이상의 다른 장치로부터 사용자 데이터, 제어 정보 또는 무선 신호를 수신하도 록 제어할 수 있다. 또한, 하나 이상의 송수신기(106, 206)는 하나 이상의 안테나(108, 208)와 연결될 수 있고, 하나 이상의 송수신기(106, 206)는 하나 이상의 안테나(108, 208)를 통해 본 문서에 개시된 설명, 기능, 절차, 제안, 방법 및/또는 동작 순서도 등에서 언급되는 사용자 데이터, 제어 정보, 무선 신호/채널 등을 송수신하도 록 설정될 수 있다. 본 문서에서, 하나 이상의 안테나는 복수의 물리 안테나이거나, 복수의 논리 안테나(예, 안 테나 포트)일 수 있다. 하나 이상의 송수신기(106, 206)는 수신된 사용자 데이터, 제어 정보, 무선 신호/채널 등을 하나 이상의 프로세서(102, 202)를 이용하여 처리하기 위해, 수신된 무선 신호/채널 등을 RF 밴드 신호에 서 베이스밴드 신호로 변환(Convert)할 수 있다. 하나 이상의 송수신기(106, 206)는 하나 이상의 프로세서(102, 202)를 이용하여 처리된 사용자 데이터, 제어 정보, 무선 신호/채널 등을 베이스밴드 신호에서 RF 밴드 신호로 변환할 수 있다. 이를 위하여, 하나 이상의 송수신기(106, 206)는 (아날로그) 오실레이터 및/또는 필터를 포함 할 수 있다. 본 발명이 적용되는 무선 기기 활용 예 도 19은 본 발명에 적용되는 무선 기기의 다른 예를 나타낸다. 무선 기기는 사용-예/서비스에 따라 다양한 형태 로 구현될 수 있다 (도 17 참조). 도 19을 참조하면, 무선 기기(100, 200)는 도 18의 무선 기기(100,200)에 대응하며, 다양한 요소(element), 성 분(component), 유닛/부(unit), 및/또는 모듈(module)로 구성될 수 있다. 예를 들어, 무선 기기(100, 200)는 통신부, 제어부, 메모리부 및 추가 요소를 포함할 수 있다. 통신부는 통신 회로 및 송수신기(들)을 포함할 수 있다. 예를 들어, 통신 회로는 도 19의 하나 이상의 프로세서(102,202) 및 /또는 하나 이상의 메모리(104,204) 를 포함할 수 있다. 예를 들어, 송수신기(들)는 도 18의 하나 이상의 송수신기(106,206) 및/또는 하나 이상의 안테나(108,208)을 포함할 수 있다. 제어부는 통신부, 메모 리부 및 추가 요소와 전기적으로 연결되며 무선 기기의 제반 동작을 제어한다. 예를 들어, 제어부 는 메모리부에 저장된 프로그램/코드/명령/정보에 기반하여 무선 기기의 전기적/기계적 동작을 제어 할 수 있다. 또한, 제어부는 메모리부에 저장된 정보를 통신부을 통해 외부(예, 다른 통신 기기)로 무선/유선 인터페이스를 통해 전송하거나, 통신부를 통해 외부(예, 다른 통신 기기)로부터 무선/ 유선 인터페이스를 통해 수신된 정보를 메모리부에 저장할 수 있다. 추가 요소는 무선 기기의 종류에 따라 다양하게 구성될 수 있다. 예를 들어, 추가 요소는 파워 유닛/ 배터리, 입출력부(I/O unit), 구동부 및 컴퓨팅부 중 적어도 하나를 포함할 수 있다. 이로 제한되는 것은 아니 지만, 무선 기기는 로봇(도 17, 100a), 차량(도 17, 100b-1, 100b-2), XR 기기(도 17, 100c), 휴대 기기(도 17, 100d), 가전(도 17, 100e), IoT 기기(도 17, 100f), 디지털 방송용 단말, 홀로그램 장치, 공공 안전 장치, MTC 장치, 의료 장치, 핀테크 장치(또는 금융 장치), 보안 장치, 기후/환경 장치, AI 서버/기기(도 17, 400), 기지국(도 17, 200), 네트워크 노드 등의 형태로 구현될 수 있다. 무선 기기는 사용-예/서비스에 따라 이동 가 능하거나 고정된 장소에서 사용될 수 있다. 도 19에서 무선 기기(100, 200) 내의 다양한 요소, 성분, 유닛/부, 및/또는 모듈은 전체가 유선 인터페이스를 통해 상호 연결되거나, 적어도 일부가 통신부를 통해 무선으로 연결될 수 있다. 예를 들어, 무선 기기 (100, 200) 내에서 제어부와 통신부는 유선으로 연결되며, 제어부와 제1 유닛(예, 130, 140)은 통신부를 통해 무선으로 연결될 수 있다. 또한, 무선 기기(100, 200) 내의 각 요소, 성분, 유닛/부, 및/또 는 모듈은 하나 이상의 요소를 더 포함할 수 있다. 예를 들어, 제어부는 하나 이상의 프로세서 집합으로 구성될 수 있다. 예를 들어, 제어부는 통신 제어 프로세서, 어플리케이션 프로세서(Applicationprocessor), ECU(Electronic Control Unit), 그래픽 처리 프로세서, 메모리 제어 프로세서 등의 집합으로 구성 될 수 있다. 다른 예로, 메모리부는 RAM(Random Access Memory), DRAM(Dynamic RAM), ROM(Read Only Memory), 플래시 메모리(flash memory), 휘발성 메모리(volatile memory), 비-휘발성 메모리(non-volatile memory) 및/또는 이들의 조합으로 구성될 수 있다. 본 발명이 적용되는 차량 또는 자율 주행 차량 예 도 20는 본 발명에 적용되는 차량 또는 자율 주행 차량을 예시한다. 차량 또는 자율 주행 차량은 이동형 로봇, 차량, 기차, 유/무인 비행체(Aerial Vehicle, AV), 선박 등으로 구현될 수 있다. 도 20를 참조하면, 차량 또는 자율 주행 차량은 안테나부, 통신부, 제어부, 구동부(140a), 전원공급부(140b), 센서부(140c) 및 자율 주행부(140d)를 포함할 수 있다. 안테나부는 통신부의 일부 로 구성될 수 있다. 블록 110/130/140a~140d는 각각 도 19의 블록 110/130/140에 대응한다. 통신부는 다른 차량, 기지국(e.g. 기지국, 노변 기지국(Road Side unit) 등), 서버 등의 외부 기기들과 신 호(예, 데이터, 제어 신호 등)를 송수신할 수 있다. 제어부는 차량 또는 자율 주행 차량의 요소들을 제어하여 다양한 동작을 수행할 수 있다. 제어부는 ECU(Electronic Control Unit)를 포함할 수 있다. 구 동부(140a)는 차량 또는 자율 주행 차량을 지상에서 주행하게 할 수 있다. 구동부(140a)는 엔진, 모터, 파 워 트레인, 바퀴, 브레이크, 조향 장치 등을 포함할 수 있다. 전원공급부(140b)는 차량 또는 자율 주행 차량 에게 전원을 공급하며, 유/무선 충전 회로, 배터리 등을 포함할 수 있다. 센서부(140c)는 차량 상태, 주변 환경 정보, 사용자 정보 등을 얻을 수 있다. 센서부(140c)는 IMU(inertial measurement unit) 센서, 충돌 센서, 휠 센서(wheel sensor), 속도 센서, 경사 센서, 중량 감지 센서, 헤딩 센서(heading sensor), 포지션 모 듈(position module), 차량 전진/후진 센서, 배터리 센서, 연료 센서, 타이어 센서, 스티어링 센서, 온도 센서, 습도 센서, 초음파 센서, 조도 센서, 페달 포지션 센서 등을 포함할 수 있다. 자율 주행부(140d)는 주행중인 차 선을 유지하는 기술, 어댑티브 크루즈 컨트롤과 같이 속도를 자동으로 조절하는 기술, 정해진 경로를 따라 자동 으로 주행하는 기술, 목적지가 설정되면 자동으로 경로를 설정하여 주행하는 기술 등을 구현할 수 있다. 일 예로, 통신부는 외부 서버로부터 지도 데이터, 교통 정보 데이터 등을 수신할 수 있다. 자율 주행부 (140d)는 획득된 데이터를 기반으로 자율 주행 경로와 드라이빙 플랜을 생성할 수 있다. 제어부는 드라이 빙 플랜에 따라 차량 또는 자율 주행 차량이 자율 주행 경로를 따라 이동하도록 구동부(140a)를 제어할 수 있다(예, 속도/방향 조절). 자율 주행 도중에 통신부는 외부 서버로부터 최신 교통 정보 데이터를 비/주기 적으로 획득하며, 주변 차량으로부터 주변 교통 정보 데이터를 획득할 수 있다. 또한, 자율 주행 도중에 센서부 (140c)는 차량 상태, 주변 환경 정보를 획득할 수 있다. 자율 주행부(140d)는 새로 획득된 데이터/정보에 기반 하여 자율 주행 경로와 드라이빙 플랜을 갱신할 수 있다. 통신부는 차량 위치, 자율 주행 경로, 드라이빙 플랜 등에 관한 정보를 외부 서버로 전달할 수 있다. 외부 서버는 차량 또는 자율 주행 차량들로부터 수집된 정 보에 기반하여, AI 기술 등을 이용하여 교통 정보 데이터를 미리 예측할 수 있고, 예측된 교통 정보 데이터를 차량 또는 자율 주행 차량들에게 제공할 수 있다. 여기서, 본 명세서의 무선 기기(XXX, YYY)에서 구현되는 무선 통신 기술은 LTE, NR 및 6G뿐만 아니라 저전력 통 신을 위한 Narrowband Internet of Things를 포함할 수 있다. 이때, 예를 들어 NB-IoT 기술은 LPWAN(Low Power Wide Area Network) 기술의 일례일 수 있고, LTE Cat NB1 및/또는 LTE Cat NB2 등의 규격으로 구현될 수 있으 며, 상술한 명칭에 한정되는 것은 아니다. 추가적으로 또는 대체적으로, 본 명세서의 무선 기기(XXX, YYY)에서 구현되는 무선 통신 기술은 LTE-M 기술을 기반으로 통신을 수행할 수 있다. 이때, 일 예로, LTE-M 기술은 LPWAN 기술의 일례일 수 있고, eMTC(enhanced Machine Type Communication) 등의 다양한 명칭으로 불릴 수 있다. 예 를 들어, LTE-M 기술은 1) LTE CAT 0, 2) LTE Cat M1, 3) LTE Cat M2, 4) LTE non-BL(non-Bandwidth Limited), 5) LTE-MTC, 6) LTE Machine Type Communication, 및/또는 7) LTE M 등의 다양한 규격 중 적어도 어 느 하나로 구현될 수 있으며 상술한 명칭에 한정되는 것은 아니다. 추가적으로 또는 대체적으로, 본 명세서의 무선 기기(XXX, YYY)에서 구현되는 무선 통신 기술은 저전력 통신을 고려한 지그비(ZigBee), 블루투스 (Bluetooth) 및 저전력 광역 통신망(Low Power Wide Area Network, LPWAN) 중 적어도 어느 하나를 포함할 수 있으며, 상술한 명칭에 한정되는 것은 아니다. 일 예로 ZigBee 기술은 IEEE 802.15.4 등의 다양한 규격을 기반 으로 소형/저-파워 디지털 통신에 관련된 PAN(personal area networks)을 생성할 수 있으며, 다양한 명칭으로 불릴 수 있다. 이상에서 설명된 실시예들은 본 발명의 구성요소들과 특징들이 소정 형태로 결합된 것들이다. 각 구성요소 또는 특징은 별도의 명시적 언급이 없는 한 선택적인 것으로 고려되어야 한다. 각 구성요소 또는 특징은 다른 구성요소나 특징과 결합되지 않은 형태로 실시될 수 있다. 또한, 일부 구성요소들 및/또는 특징들을 결합하여 본 발명 의 실시예를 구성하는 것도 가능하다. 본 발명의 실시예들에서 설명되는 동작들의 순서는 변경될 수 있다. 어느 실시예의 일부 구성이나 특징은 다른 실시예에 포함될 수 있고, 또는 다른 실시예의 대응하는 구성 또는 특징과 교체될 수 있다. 특허청구범위에서 명시적인 인용 관계가 있지 않은 청구항들을 결합하여 실시예를 구성하거나 출원 후의 보정에 의해 새로운 청구항으로 포함시킬 수 있음은 자명하다. 본 문서에서 본 발명의 실시예들은 주로 단말과 기지국 간의 신호 송수신 관계를 중심으로 설명되었다. 이러한 송수신 관계는 단말과 릴레이 또는 기지국과 릴레이간의 신호 송수신에도 동일/유사하게 확장된다. 본 문서에서 기지국에 의해 수행된다고 설명된 특정 동작은 경우에 따라서는 그 상위 노드(upper node)에 의해 수행될 수 있 다. 즉, 기지국을 포함하는 복수의 네트워크 노드들(network nodes)로 이루어지는 네트워크에서 단말과의 통신 을 위해 수행되는 다양한 동작들은 기지국 또는 기지국 이외의 다른 네트워크 노드들에 의해 수행될 수 있음은 자명하다. 기지국은 고정국(fixed station), Node B, eNode B(eNB), 억세스 포인트(access point) 등의 용어에 의해 대체될 수 있다. 또한, 단말은 UE(User Equipment), MS(Mobile Station), MSS(Mobile Subscriber Station) 등의 용어로 대체될 수 있다. 본 발명에 따른 실시예는 다양한 수단, 예를 들어, 하드웨어, 펌웨어(firmware), 소프트웨어 또는 그것들의 결 합 등에 의해 구현될 수 있다. 하드웨어에 의한 구현의 경우, 본 발명의 일 실시예는 하나 또는 그 이상의 ASICs(application specific integrated circuits), DSPs(digital signal processors), DSPDs(digital signal processing devices), PLDs(programmable logic devices), FPGAs(field programmable gate arrays), 프로세서, 콘트롤러, 마이크로 콘트롤러, 마이크로 프로세서 등에 의해 구현될 수 있다. 펌웨어나 소프트웨어에 의한 구현의 경우, 본 발명의 일 실시예는 이상에서 설명된 기능 또는 동작들을 수행하 는 모듈, 절차, 함수 등의 형태로 구현될 수 있다. 소프트웨어 코드는 메모리 유닛에 저장되어 프로세서에 의해 구동될 수 있다. 상기 메모리 유닛은 상기 프로세서 내부 또는 외부에 위치하여, 이미 공지된 다양한 수단에 의 해 상기 프로세서와 데이터를 주고 받을 수 있다. 본 발명은 본 발명의 특징을 벗어나지 않는 범위에서 다른 특정한 형태로 구체화될 수 있음은 당업자에게 자명 하다. 따라서, 상기의 상세한 설명은 모든 면에서 제한적으로 해석되어서는 아니되고 예시적인 것으로 고려되어 야 한다. 본 발명의 범위는 첨부된 청구항의 합리적 해석에 의해 결정되어야 하고, 본 발명의 등가적 범위 내에 서의 모든 변경은 본 발명의 범위에 포함된다. 산업상 이용가능성 상술한 바와 같은 본 발명의 실시형태들은 다양한 이동통신 시스템에 적용될 수 있다."}
{"patent_id": "10-2024-7017387", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 명세서에 첨부되는 도면은 본 발명에 대한 이해를 제공하기 위한 것으로서 본 발명의 다양한 실시형태들을 나타내고 명세서의 기재와 함께 본 발명의 원리를 설명하기 위한 것이다. 도 1은 NR 이전의 RAT에 기반한 V2X 통신과 NR에 기반한 V2X 통신을 비교하여 설명하기 위한 도면이다 도 2은 LTE 시스템의 구조를 나타낸다. 도 3은 NR 시스템의 구조를 나타낸다. 도 4은 NR의 무선 프레임의 구조를 나타낸다. 도 5은 NR 프레임의 슬롯 구조를 나타낸다. 도 6은 SL 통신을 위한 무선 프로토콜 구조(radio protocol architecture)를 나타낸다. 도 7은 V2X 또는 SL 통신을 수행하는 단말을 나타낸다. 도 8는 V2X 또는 SL 통신을 위한 자원 단위를 나타낸다. 도 9은 ITS 스테이션 참조 구조 (ITS station reference architecture)를 설명하기 위한 도면이다. 도 10은 참조 구조에 기초하여 설계 및 적용 가능한 ITS 스테이션 (station)의 예시 구조이다. 도 11 내지 도 13은 검출 모델 또는 제1 장치가 V2X 메시지에 기반하여 객체 검출을 위한 학습을 수행하는 방법 을 설명하기 위한 도면이다. 도 14는 V2X 메시지에 기반하여 영상에서 객체를 검출하는 검출 모델을 학습시키는 방법을 설명하기 위한 흐름도이다. 도 15는 제1 장치가 영상 및 영상에 대응하여 수신된 메시지에 기반하여 검출 모델을 학습시키는 방법을 설명하 기 위한 도면이다. 도 16은 제1 장치가 검출 모델을 이용하여 획득한 객체 정보 및 수신된 제2 메시지에 기반하여 제1 메시지를 전 송하는 방법을 설명하기 위한 도면이다. 도 17은 본 발명에 적용되는 통신 시스템을 예시한다. 도 18은 본 발명에 적용될 수 있는 무선 기기를 예시한다. 도 19는 본 발명에 적용되는 무선 기기의 다른 예를 나타낸다. 무선 기기는 사용-예/서비스에 따라 다양한 형태 로 구현될 수 있다 도 20은 본 발명에 적용되는 차량 또는 자율 주행 차량을 예시한다."}
