{"patent_id": "10-2022-0079613", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0002423", "출원번호": "10-2022-0079613", "발명의 명칭": "객체 동선 추적 시스템 및 그 방법", "출원인": "(주)트리플렛", "발명자": "신동화"}}
{"patent_id": "10-2022-0079613", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "출입구를 향해 마련되어 식별영역을 포함하는 제1 영상을 획득하는 제1 카메라와 천장에 마련되어 감지영역을포함하는 제2 영상을 획득하는 제2 카메라를 포함하는 카메라부;미리 마련된 인공지능을 이용하여 상기 제1 영상으로부터 객체 정보를 식별하는 객체인식부;상기 제2 영상에 기초하여 상기 객체의 동선정보를 생성하는 동선추적부;를 포함하는 객체 동선 추적 시스템."}
{"patent_id": "10-2022-0079613", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 동선추적부는,상기 제1 영상에서 미리 설정된 후보영역에서 미리 설정된 식별영역으로 진입한 객체에 새로운 ID를 부여하고,상기 객체 인식부에 상기 ID가 부여된 객체 정보의 식별을 요청하는 객체 동선 추적 시스템."}
{"patent_id": "10-2022-0079613", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 동선추적부는,미리 설정된 주기마다 제2 영상에서 객체의 좌표와 특징백터를 추출하고, ID, 객체정보, 타임스탬프, 특징벡터및 좌표를 포함하는 동선정보를 생성하는 객체 동선 추적 시스템."}
{"patent_id": "10-2022-0079613", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 동선추적부는,제2 영상으로부터 객체에 대한 머리영역의 중심 및 몸통 영역의 중심을 인식하고, 머리영역의 중심이 몸통 영역의 중심을 기준으로 대칭되는 곳을 발로 인식하여 상기 발에 대한 위치를 상기 좌표로 추출하는 객체 동선 추적시스템."}
{"patent_id": "10-2022-0079613", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 동선추적부는,상기 제2 영상에서 객체가 사라지면, 사라진 객체의 동선정보를 보류 정보로 관리하고, 제2 영상에서 새로운 객체가 나타나면 상기 보류 정보와 새로운 객체를 매핑하는 객체 동선 추적 시스템."}
{"patent_id": "10-2022-0079613", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,공개특허 10-2024-0002423-3-상기 동선추적부는,새로운 객체의 특징벡터와 보류 정보의 특징벡터의 유사도에 기초하여 새로운 객체와 매칭될 보류 정보를 결정하는 객체 동선 추적 시스템."}
{"patent_id": "10-2022-0079613", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5항에 있어서,상기 동선추적부는,새로운 객체의 타임스탬프와 보류 정보의 타임스탬프와의 차이 값을 기초하여 새로운 객체와 매칭될 보류 정보를 결정하는 객체 동선 추적 시스템."}
{"patent_id": "10-2022-0079613", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제5항에 있어서,상기 동선추적부는,새로운 객체의 좌표 정보와 보류 정보의 좌표 정보를 기초하여 새로운 객체와 매칭될 보류 정보를 결정하는 객체 동선 추적 시스템."}
{"patent_id": "10-2022-0079613", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "객체 동선 추적 시스템을 이용하여 수행하는 객체 동선 추적 방법에 있어서, 출입구를 향해 마련된 제1 카메라를 이용하여 식별영역을 포함하는 제1 영상을 획득하는 단계;천장에 마련된 제2 카메라를 이용하여 감지영역을 포함하는 제2 영상을 획득하는 단계;미리 마련된 인공지능을 이용하여 상기 제1 영상으로부터 객체 정보를 식별하는 단계; 및상기 제2 영상에 기초하여 상기 객체의 동선정보를 생성하는 단계;를 포함하며,상기 제1 영상으로부터 객체 정보를 식별하는 단계는, 상기 제1 영상에서 미리 설정된 후보영역에서 미리 설정된 식별영역으로 진입한 객체에 새로운 ID를 부여하고,상기 객체 인식부에 상기 ID가 부여된 객체 정보의 식별을 요청하는 객체 동선 추적 방법."}
{"patent_id": "10-2022-0079613", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 객체의 동선정보를 생성하는 단계는, 미리 설정된 주기마다 제2 영상에서 객체의 좌표와 특징백터를 추출하고, ID, 객체정보, 타임스탬프, 특징벡터및 좌표를 포함하는 동선정보를 생성하되, 제2 영상으로부터 객체에 대한 머리영역의 중심 및 몸통 영역의 중심을 인식하고, 머리영역의 중심이 몸통 영역의 중심을 기준으로 대칭되는 곳을 발로 인식하여 상기 발에 대한 위치를 상기 좌표로 추출하는 객체 동선 추적방법."}
{"patent_id": "10-2022-0079613", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항에 있어서,공개특허 10-2024-0002423-4-상기 제2 영상에서 객체가 사라지면, 사라진 객체의 동선정보를 보류 정보로 관리하고, 제2 영상에서 새로운 객체가 나타나면 상기 보류 정보와 새로운 객체를 매핑하는 단계를 더 포함하는 객체 동선 추적 방법."}
{"patent_id": "10-2022-0079613", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 기술적 측면에 따른 객체 동선 추적 시스템은 출입구를 향해 마련되어 식별영역을 포함하는 제1 영 상을 획득하는 제1 카메라와 천장에 마련되어 감지영역을 포함하는 제2 영상을 획득하는 제2 카메라를 포함하는 카메라부, 미리 마련된 인공지능을 이용하여 상기 제1 영상으로부터 객체 정보를 식별하는 객체인식부, 상기 제2 영상에 기초하여 상기 객체의 동선정보를 생성하는 동선추적부를 포함할 수 있다. 본 발명의 일 실시형태에 따르 면, 객체의 동선정보를 생성하여 객체가 제2 영상에서 사라지거나 나타난 경우에서의 객체의 동선 정보와 보류 정보를 비교함으로써, 객체의 동선을 추적할 수 있다."}
{"patent_id": "10-2022-0079613", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 객체 동선 추적 시스템 및 그 방법에 대한 것이다."}
{"patent_id": "10-2022-0079613", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로, 온라인 매장은 고객의 유입부터 재구매까지 이루어지는 전 과정에 대한 데이터를 수집하여 마케팅 을 위한 전략 수립 및 성과 분석이 가능한 반면, 오프라인 매장은 결제기록 이외의 데이터를 수동으로 수집해야 하므로, 고객이 매장 내에서 어떤 방식으로 쇼핑을 하는지에 대해서는 알 수 없다. 예를 들면, 고객별 매대별 체류시간, 관심매대, 관심상품 도출, 관련상품 정보 등을 포함하는 매장 내에서 고객 들의 행동, 이동경로에 따른 제품의 구매 상황 정보는 매장 내에서 돌아다니는 고객의 동선을 통해 알 수 있는 데, 매장 내에서의 고객의 동선은 따로 데이터로 저장하거나 분석하지 않아 매장 운영 효율성을 도모하지 못하 고 있다. 이러한 문제로 인해, 매장에 동선 추적 시스템을 도입한 매장이 늘고 있으나, 다양한 각도 및 방향에 따라 설치 되는 다수의 카메라를 이용하는 동선 추적 시스템은 실제 모니터에 나타나는 영상과 카메라로부터 촬영되지 않 은 영역 사이의 관계를 파악하기 어려운 문제점이 있다. 즉, 각각의 카메라로부터 획득된 영상을 통해 전체적인 영역을 모니터링해야 하는데, 모니터에 출력되는 영상만 을 이용하여 객체의 동선을 파악하는 것은 쉽지 않으며, 전체 영역에 대한 이미지를 쉽게 확인할 수 없으므로, 객체를 지속적으로 모니터링하는데 어려움이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허공보 특2001-0016639호"}
{"patent_id": "10-2022-0079613", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 출입구를 향해 촬영되는 제1 영상을 이용하여 객체를 인식하고, 천장에 마련되어 촬영되는 제2 영상 을 이용하여 객체의 동선을 추적하는 객체 동선 추적 시스템 및 그 방법을 제공하고자 한다."}
{"patent_id": "10-2022-0079613", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 기술적 측면은 출입구를 향해 마련되어 식별영역을 포함하는 제1 영상을 획득하는 제1 카메라와 천장에 마련되어 감지영역을 포함하는 제2 영상을 획득하는 제2 카메라를 포함하는 카메라부, 미리 마련된 인공 지능을 이용하여 상기 제1 영상으로부터 객체 정보를 식별하는 객체인식부, 상기 제2 영상에 기초하여 상기 객 체의 동선정보를 생성하는 동선추적부를 포함한다. 일 실시예에서, 상기 동선추적부는, 상기 제1 영상에서 미리 설정된 후보영역에서 미리 설정된 식별영역으로 진 입한 객체에 새로운 ID를 부여하고, 상기 객체 인식부에 상기 ID가 부여된 객체 정보의 식별을 요청할 수 있다. 일 실시예에서, 상기 동선추적부는, 미리 설정된 주기마다 제2 영상에서 객체의 좌표와 특징벡터를 추출하고, ID, 객체정보, 타임스탬프, 특징벡터 및 좌표를 포함하는 동선 정보를 생성할 수 있다. 일 실시예에서, 상기 동선추적부는, 제2 영상으로부터 객체에 대한 머리영역의 중심 및 몸통 영역의 중심을 인 식하고, 머리영역의 중심이 몸통 영역의 중심을 기준으로 대칭되는 곳을 발로 인식하여 상기 발에 대한 위치를 상기 좌표로 추출할 수 있다. 일 실시예에서, 상기 동선추적부는, 상기 제2 영상에서 객체가 사라지면, 사라진 객체의 동선 정보를 보류 정보 로 관리하고, 상기 제2 영상에서 새로운 객체가 나타나면 상기 보류 정보와 새로운 객체를 매핑할 수 있다. 일 실시예에서, 상기 동선추적부는, 새로운 객체의 특징벡터와 보류 정보의 특징벡터의 유사도에 기초하여 새로 운 객체와 매칭될 보류 정보를 결정할 수 있다. 일 실시예에서, 상기 동선추적부는, 새로운 객체의 타임스탬프와 보류 정보의 타임스탬프와의 차이 값을 기초하 여 새로운 객체와 매칭될 보류 정보를 결정할 수 있다. 일 실시예에서, 상기 동선추적부는, 새로운 객체의 좌표 정보와 보류 정보의 좌표 정보를 기초하여 새로운 객체 와 매칭될 보류 정보를 결정할 수 있다."}
{"patent_id": "10-2022-0079613", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시형태에 따르면, 객체의 동선정보를 생성하여 객체가 제2 영상에서 사라지거나 나타난 경우에 서의 객체의 동선 정보와 보류 정보를 비교함으로써, 객체의 동선을 추적할 수 있다. 나아가, 객체 동선 추적을 통해 고객 유입율을 파악하고, 매장내 특정 매대 앞에 머무는 고객의 행동을 분석할 수 있다."}
{"patent_id": "10-2022-0079613", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 후술되어 있는 실시예들을 참 조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서로 다른 다 양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하고, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구 항의 범주에 의해 정의될 뿐이다. 본 명세서에서 사용되는 용어에 대해 간략히 설명하고, 본 발명에 대해 구체적으로 설명하기로 한다. 본 발명에서 사용되는 용어는 본 발명에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수 있 다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 발명의 설명 부분에서 상 세히 그 의미를 기재할 것이다. 따라서 본 발명에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가 지는 의미와 본 발명의 전반에 걸친 내용을 토대로 정의되어야 한다. 명세서 전체에서 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있음을 의미한다. 또한, 명세서에서 사용되는 \"부\", \"모듈\", \"유닛\" 등의 용어는 적어도 하나의 기능 또는 동작을 처리하는 단위를 의미하며, 소프트웨어, FPGA 또는 ASIC과 같은 하드웨어 구성요소, 또는 소프트웨어와 하드웨어의 결합으로 구현될 수 있다. 그렇지만 \"부\", \"모듈\", \"유닛\" 등의 용어가 소프트웨어 또는 하드웨어에 한정되는 의미는 아니다. \"부\", \"모듈\", \"유닛\" 등은 어드레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키도 록 구성될 수도 있다. 따라서, 일 예로서 \"\"부\", \"모듈\", \"유닛\" 등의 용어는 소프트웨어 구성요소들, 객체지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로 코드, 회로, 데 이터, 데이터베이스, 데이터 구조들, 테이블들, 어레이들 및 변수들을 포함한다. 아래에서는 첨부한 도면을 참고하여 본 발명의 실시예에 대하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관계없는 부분은 생략한다. \"제1\", \"제2\" 등과 같이 서수를 포함하는 용어는 다양한 구성 요소들을 설명하는데 사용될 수 있지만, 구성 요 소들은 용어들에 의해 한정되지는 않는다. 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로 만 사용된다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. \"및/또는\" 이라는 용어는 복수의 관련된 항목 들의 조합 또는 복수의 관련된 항목들 중의 어느 하나의 항목을 포함한다. 이하에서는 도 1 내지 도 3을 참조하여 본 발명의 일 실시예에 따른 객체 동선 추적 시스템에 대해서 설명하도 록 한다. 도 1은 본 발명의 일 실시예에 따른 객체 동선 추적 시스템을 설명하기 위한 블록도이다. 도 1에서 도시한 바와 같이, 본 발명의 일 실시예에 따른 객체 동선 추적 시스템은 객체 추적 장치 및 동선 추적 관리 서버를 포함한다. 객체 추적 장치는 출입구를 향해 마련된 제1 카메라와 천장에 마련된 제2 카메라를 이용하여 객체 정보를 식별하고, 객체의 동선정보를 생성하여 동선 추적 관리 서버로 전송한다. 객체 정보는 출입하는 객체를 구분하여 분석하기 위한 정보로 객체의 나이 및 성별을 포함할 수 있으며, 한정하 지 않는다. 동선 추적 관리 서버는 객체 추적 장치로부터 전송받은 객체의 동선정보를 기초로 하여 객체의 동선을 관리한다. 동선정보는 ID, 객체정보, 타임스탬프, 특징벡터 및 좌표를 포함할 수 있다. 도 2는 도 1의 객체 추적 장치를 설명하기 위한 블록도이다. 도 2에서 도시한 바와 같이, 객체 추적 장치는 카메라부, 제어부, 저장부, 통신부를 포함한다. 카메라부는 출입구를 향해 마련되어 객체를 식별하기 위한 제1 영상을 획득하는 제1 카메라(100a)와 천장 에 마련되어 감지영역을 포함하는 제2 영상을 획득하는 제2 카메라(100b)를 포함할 수 있다. 제1 카메라(100a)는 후보영역과 식별영역이 포함된 제1 영상을 획득하며, 제2 카메라(100b)는 객체의 동선을 추 적할 감지영역을 포함하는 제2 영상을 획득한다. 제1 카메라(100a)는 출입하는 객체의 정보를 추출하기 위해 객체의 얼굴이 촬영되도록 마련될 수 있고, 제2 카 메라(100b)는 출입한 객체의 동선을 추적하기 위해 객체의 이동이 전체적으로 촬영되도록 마련될 수 있다. 일 실시예로 제1 카메라(100a)는 출입구를 정면으로 촬영되도록 하고, 불렛(Bullet) 카메라로 구현될 수 있고, 제2 카메라(100b)는 매장의 천장에 부착되어 감지영역을 전체적으로 촬영할 수 있는 3D 카메라로 구현될 수 있 다. 본 발명의 일 실시예에서는 불렛 카메라와 3D 카메라로 설명하였으나, 카메라의 종류는 한정하지 않는다. 불렛 카메라는 돔 형태가 아니라 돌출된 바 형태로 형성된 소형 및 경량의 카메라로서, 방범 및 질서 유지를 위 한 수요 증대로 광범위한 분야에 사용되어 있으며, 공공시설, 지하철 역사, 매장, 학교 등과 같은 실내뿐만 아니라, 공원, 주택가 골목, 건물 외벽 등 실외에서도 사용 가능한 기기로 구현되어 실내 천장이나 벽에 설치될 수 있다. 이와 같은, 제1 카메라(100a)는 매장의 출입구를 향하도록 설치되어 후보영역에 서 식별영역으로 진입하는 객체 의 얼굴을 촬영할 수 있는 기기로 구현된다. 3D 카메라는 다수개의 카메라를 통해 3D 좌표를 생성하고 이에 따라 촬영 대상 물체의 3차원 좌표 데이터를 획 득할 수 있는 장치이거나 2D 카메라와 대상물체와의 각 지점에서의 거리를 측정할 수 있는 광센서 또는 초음파 센서가 결합되어 3차원 좌표 데이터를 획득할 수 있는 장치로 구현될 수 있다. 3D 카메라는 카메라의 렌즈 앞에 아무런 도구를 설치하지 않고, 카메라의 렌즈가 360도 회전하여 촬영할 수 있 다. 이와 같은, 제2 카메라(100b)는 매장의 천장에 부착되어 360도 회전하면서 객체를 촬영할 수 있는 기기로 구현 된다. 도 3은 도 2의 카메라부를 설명하기 위한 도면이다. 도 3에서 도시한 바와 같이, 제1 카메라(100a)는 매장의 출입구 정면이 보이도록 설치될 수 있으며, 매장 입구 외측에 기 설정된 후보영역(Candidate area, CA)과 매장 입구 내측에 기 설정된 식별영역(Identification area, IA)을 촬영할 수 있다. 본 발명의 일 실시예에서는 매장에 진입하는 객체를 기준으로 설명하였으며, 매장으로부터 퇴장하는 객체일 경 우, 후보영역은 매장 입구의 내측으로 설정하고, 식별영역은 매장 입구의 외측으로 설정될 수 있다. 본 발명의 일 실시예에서, 매장 입구 외측에 기 설정된 후보영역과 매장 입구 내측에 기 설정된 식별영역을 설 정함으로써, 객체 추적 장치가 입구 주변에서 머물러 있는 방문객 및 직원을 매장에 입장하는 객체로 오인 식하는 비율을 감소시킬 수 있다. 제2 카메라(100b)는 매장의 천장에 설치될 수 있으며, 객체의 동선을 추적하기 위한 매장 내의 공간인 감지영역 (Detection area, DA)을 촬영한다. 저장부는 제어부로부터 생성된 객체의 동선정보를 저장한다. 저장부는 주기억장치 및 보조기억장치 중 적어도 하나를 포함할 수 있다. 주기억장치는 예를 들어, 롬 (ROM) 및/또는 램(RAM)과 같은 반도체 저장 매체를 이용하여 구현된 것일 수 있고, 보조기억장치는, 플래시 메 모리 장치(솔리드 스테이트 드라이브(SSD, Solid State Drive) 등), SD(Secure Digital) 카드, 하드 디스크 드 라이브(HDD, Hard Disc Drive), 콤팩트 디스크, 디브이디(DVD) 또는 레이저 디스크 등과 같이 데이터를 영구적 또는 반영구적으로 저장 가능한 장치를 기반으로 구현될 수 있다. 통신부는 저장된 객체의 동선정보를 객체 동선 관리 서버로 전송한다. 통신부는 유무선 통신망을 포함할 수 있고, 유선 통신망은 케이블망이나 공중 전화망(PSTN)과 같은 인터넷 망을 포함할 수 있으며, 무선 통신망은 CDMA, WCDMA, GSM, EPC(Evolved Packet Core), LTE(Long Term Evolution), 와이브로(Wibro) 망, 5G 통신망 등을 포함할 수 있다. 통신부는 이에 한정되는 것이 아니며, 향후 구현될 차세대 이동통신 시스템의 접속망으로서 가령 클라우드 컴퓨팅 환경하의 클라우드 컴퓨팅망, 5G망 등에 사용될 수 있고, 통신부가 유선 통신망인 경우 통신부 내의 액세스포인트는 전화국의 교환국 등에 접속할 수 있지만, 무선 통신망인 경우에는 통신사에서 운용 하는 SGSN 또는 GGSN(Gateway GPRS Support Node)에 접속하여 데이터를 처리하거나, BTS(Base Station Transmission), NodeB, e-NodeB 등의 다양한 중계기에 접속하여 데이터를 처리할 수 있다. 제어부는 제1 영상으로부터 객체 정보를 식별하고, 제2 영상으로부터 객체의 동선정보를 생성할 수 있다. 일 실시예에서, 제어부는 중앙 처리 장치(CPU: Central Processing Unit), 그래픽 처리 장치(GPU: Graphic Processing Unit), 마이크로 컨트롤러 유닛(MCU: Micro Controller Unit), 애플리케이션 프로세서(AP: Application Processor), 전자 제어 유닛(ECU: Electronic Controlling Unit) 및/또는 이외 각종 연산 및 제어 처리를 수행할 수 있는 적어도 하나의 전자 장치 등을 포함할 수 있다. 이들 장치는, 예를 들어, 하나 또는 둘 이상의 반도체 칩, 회로 또는 관련 부품 등을 단독으로 이용하거나 조합하여 구현된 것일 수도 있다. 제어부는 도 2에 도시된 바와 같이, 제1 영상에서 객체의 출입을 검출하고, 제2 영상을 이용하여 객체의 이동을 추적하는 동선추적부, 제1 영상으로부터 출입하는 객체에 대한 객체 정보를 인식하는 객체인식부 를 포함한다. 이하, 도 4 내지 도 5b를 참조하여 본 발명의 일 실시예에 제어부의 객체 인식 방법에 대하여 설명한다. 도 4는 본 발명의 일 실시예에 따른 객체를 인식하는 과정을 설명하기 위한 순서도이고, 도 5a 및 도 5b는 S400 내지 S404 단계를 설명하기 위한 예시도이다. 도 5a는 제1 카메라로부터 획득한 제1 영상을 나타낸 예시도이고, 도 5b는 도 5a의 입구 영역을 확대하여 나타 낸 도면이다. 도 5a에서 도시한 바와 같이, 동선추적부는 제1 영상에서 미리 설정된 후보영역에 진입한 객체를 감지한다 (S400). 동선추적부는 제1 영상에서 객체가 기 설정된 후보영역에서 기 설정된 식별영역으로 진입했는지 여부를 판 별하고(S402), 후보영역에서 식별영으로 진입한 것으로 판단되는 객체에 새로운 ID를 부여한다(S404). 일 실시예로, 동선추적부는 도 5b에서 도시한 바와 같이, 후보영역(CA)에서 위치한 객체인 '객체 1(Ob 1)' 및 '객체 2(Ob 2)'에 대하여 식별영역으로 진입했는지 여부를 판별한다. 식별영역(IA)의 진입의 일 실시예로, 동선추적부는 제1 영상에 인식된 '객체 1(Ob 1)', '객체 2(Ob 2)' 중 경계 박스의 크기가 일정 크기보다 작은 '객체 2(Ob 2)'를 후보영역(CA)에서 식별영역(IA)으로 진입하지 않은 것으로 판별한다. 식별영역(IA)의 진입의 일 실시예로, 동선추적부는 도 5b에서 네모 형태로 표시된 경계 박스의 크기가 일 정 크기이상인 '객체 1(Ob 1)'을 후보영역(CA)에서 식별영역(IA)으로 진입한 객체로 판별하여 '객체 1(Ob 1)에 새로운 ID를 부여한다. 일 실시예로, 동선추적부는 후보영역(CA)에서 식별영역(IA)으로 넘어오지 않고, 식별영역(IA)에서 지속적 으로 돌아다니는 '객체 3(Ob 3)'에 대하여 매장에 새롭게 진입한 객체로 판별하지 않으며, '객체 3(Ob 3)을 식 별영역(IA) 주변에 위치한 방문객 또는 직원으로 인식한다. 이와 같이, 후보영역과 식별영역을 설정함으로써, 동선추적부는 매장 입구 주변에서 머물러 있는 방문객 및 직원을 매장에 입장하는 객체로 오인식하는 비율을 감소시킬 수 있다. 이와 같이 새로운 ID가 부여되면, 동선추적부는 객체인식부에게 새로운 ID가 부여된 객체에 대한 객 체정보의 인식을 요청할 수 있다. 복수의 객체에 대한 객체 정보의 인식 요청이 있는 경우, 코드 핸들러는 객체를 식별하기 위해 객체인식부 에 전달하기 전, ID를 리스트 형태의 대기열에 추가할 수 있다. 동선추적부로부터 인식을 요청받은 객체인식부는 미리 마련된 인공지능을 이용하여 제1 영상으로부터 객체 정보를 식별하고(S406), 객체 정보를 동선추적부에 전달한다. 객체 정보는 객체의 나이 및 성별을 포함할 수 있으나, 한정하지 않는다. 객체인식부는 제1 영상으로부터 추출된 객체의 얼굴을 인공지능을 이용하여 객체의 나이 및 성별을 인식할 수 있다. 객체인식부는 인공신경망, 머신러닝, 딥러닝을 기반으로 하는 얼굴 인식 알고리즘, 얼굴 검출 알고리즘을 사용하여 객체의 얼굴로부터 객체의 나이 및 성별을 출력할 수 있다. 객체인식부는 제1 영상으로부터 추출된 객체의 얼굴을 얼굴 인식 알고리즘의 입력데이터로 설정하고, 객체 의 나이 및 성별을 얼굴 인식 알고리즘의 출력데이터로 설정하여 학습된 얼굴 인식 알고리즘을 사용할 수 있다. 객체인식부가 객체 정보에 대한 식별을 완료하면, 코드 핸들러는 다음 순서의 ID를 객체인식부 로 전달할 수 있다. 동선추적부는 제2 영상에 기초하여 객체의 동선을 추적한다(S408). 객체인식부에서 객체 정보가 인식되지 않은 경우에는 동선추적부는 해당 객체의 동선을 추적하지 않 아 신뢰도가 낮은 동선정보의 수집을 방지한다. 객체 정보가 인식되면 동선추적부는 미리 설정된 주기마다 제2 영상을 분석하여 객체의 동선을 추적하여 동선 정보를 생성한다. 이하에서는 도 6 및 도 7를 참조하여 본 발명의 일 실시예에 따른 객체의 동선정보를 생성하는 방법에 대하여 설명한다. 도 6은 객체의 동선정보를 생성하는 과정을 설명하기 위한 순서도이고, 도 7a 및 도 7b는 S600 내지 S604 단계 를 설명하기 위한 예시도이다. 도 7a는 발 위치에 대한 좌표를 추출하는 과정을 설명하기 위한 도면이다. 도 7b의 (a)는 세로 형태로 위치된 사람의 모습을 촬영한 예시도이고, 도 7의 (b)는 가로 형태로 위치된 사람의 모습을 촬영한 예시도이며, 도 7의 (c)는 다리가 가려진 사람의 모습을 촬영한 예시도이다. 도 7a에서 도시한 바와 같이, 동선추적부는 제2 영상으로부터 객체의 얼굴을 식별한다(S600). 동선추적부는 얼굴 인식 알고리즘을 통해 사람의 머리를 인식할 수 있도록 더 학습시킬 수 있다. 객체의 얼굴을 식별하면, 동선추적부는 머리에 대한 중심점(Head Point, HP)을 생성한다. 동선추적부는 객체의 몸통을 인식하여 몸통에 대한 중심점(Body Point, BP)을 생성한다. 동선추적부는 몸통에 대한 중심점을 기준으로 머리에 대한 중심점과 대칭되는 지점을 발의 위치(Feet Point, FP)로 인식한다(S602). 동선추적부는 인식된 발에 대한 위치를 발의 좌표로 추출한다(S604). 일 실시예로, 도 7b의 (a) 내지 도 7b의 (c)에서 도시한 바와 같이, 동선추적부는 제2 영상으로부터 객체 의 얼굴을 식별한다. 동선추적부는 도 7b의 (a) 내지 도 7b의 (c)과 같이, 몸통의 중심(노란색)과 머리의 위치(네모형 박스)를 이용하여 사람이 세로 형태로 위치되었는지, 가로 형태로 위치되었는지 판단할 수 있다. 동선추적부는 도 7b의 (c)와 같이, 평균적인 몸통 박스의 가로세로 비율을 이용하여 몸 중점의 위치를 보 정한다. 동선추적부는 머리 박스의 중점이 보정된 몸통 중점을 기준으로 대칭되는 위치를 발로 인식한다. 동선추적부는 인식된 발 위치를 좌표로 추출한다. 제2 영상은 천장에서 부착된 제2 카메라를 통해 촬영된 것으로, 객체의 발 위치를 정확하기 파악하기 어려우므 로, 발의 위치를 추정하여 정확한 좌표를 획득할 수 있다. 동선추적부는 식별된 얼굴로부터 특징벡터를 추출한다(S606). 동선추적부는 이미 개시된 특징벡터 알고리즘을 통해 객체의 얼굴에 대한 특징벡터를 추출할 수 있다. 동선추적부는 발 위치 좌표를 추출하는 단계와 특징벡터를 추출하는 단계를 동시에 진행하거나, 순서와 관 계없이 진행할 수 있다. 동선추적부는 발 위치 좌표 및 특징벡터를 이용하여 객체의 동선정보를 생성한다(S608). 동선추적부는 미리 설정된 주기마다 제2 영상에서 객체의 좌표 및 특징벡터를 추출하고, 객체의 ID, 객체 정보, 타임스탬프, 특징벡터 및 좌표를 포함하는 동선정보를 생성한다. 제2 카메라를 통한 제2 영상이 객체가 이동할 수 있는 모든 범위를 커버하지 못하는 경우, 동선을 검출할 수 없 는 사각영역이 존재한다. 예컨대, 객체가 카메라가 설치되지 않은 탈의실이나 계단 등을 통해 이동하는 경우 객체의 동선 추적이 중단되 므로, 객체의 동선 추적 오류가 발생할 수 있다. 이에 동선추적부는 감지영역에서 객체가 사라지면 객체의 동선정보를 보류정보로 저장하고, 식별영역이 아 닌 감지영역에서 새롭게 나타난 객체와 저장된 보류정보를 매칭하여 사각영역에 의해 중단된 객체의 동선 추적 에 대한 정확도를 향상시킬 수 있다. 이하에서는 도 8 내지 도 10을 참조하여 추적이 끊어진 ID를 다시 연결하는 방법에 대하여 설명하도록 한다. 도 8은 본 발명의 일 실시예에 따른 추적이 끊어진 ID를 다시 연결하는 과정을 설명하기 위한 순서도이고, 도 9a 및 도 9b는 도 8를 설명하기 위한 예시도이다. 도 9a는 사각영역에 대하여 설명하기 위한 예시도이고, 도 9b는 공간, 통로에 대하여 설명하기 위한 예시도이다. 동선추적부는 객체의 동선정보를 통해 객체의 동선을 추적한다(S800). 도 9a 및 도 9b에서 도시한 바와 같이, 동선추적부는 객체가 사각영역, 공간 또는 통로에 진입했는지 여부 를 판단한다(S802). 본 발명의 일 실시예에서는 사각영역, 탈의실 및 통로를 카메라로 촬영되는 않은 구역으로 정의하고, 통로는 계 단, 복도 등과 같은 공간일 수 있다. 본 발명의 일 실시예에서는 9b에서 탈의실로 기재하여 설명하였으나, 화장실, 휴게실 등과 같이 카메라로 촬영 할 수 없는 공간을 포함하며, 한정하지 않는다. 일 실시예에서, 객체가 도 9a의 '사각영역'에 진입했다고 가정한다. 동선추적부는 제2 영상에서 사라진 객체의 동선정보를 보류 정보로 저장하여 관리한다(S804). 일 실시예로, 사각 영역 간의 연결관계를 고려하여 보류 정보를 분류하여 관리할 수 있다. 구체적으로, 도 9b에서, 동선추적부는 복수의 사각영역의 연결 관계를 고려하여 사각영역을 그룹핑할 수 있다. 일 실시예에서, 도 9b에서 도시한 바와 같이, 탈의실의 입출구 영역을 사각영역 1(Dead zone, DZ 1)로 설정하고, 통로에 대한 2개의 입출구 영역을 사각영역 2(Dead zone, DZ 2)로 그룹핑하여 설정하는 것으로 가정 한다. 동선추적부는 사라진 객체의 마지막 좌표와 가장 인접한 사각영역으로 객체가 사라진 것으로 판단하고, 사 각영역별로 보류 정보를 관리할 수 있다. 일 실시예에서, 동선추적부는 사각영역 1(DZ 1)에 진입하여 감지영역(DA)으로부터 사라지는 객체는 사각영 역 1(DZ 1)에 대한 보류 정보 리스트에 저장하여 관리하고, 사각영역 2(DZ 2)에 진입하여 감지영역(DA)으로부터 사라지는 객체는 사각영역 2(DZ 2)에 대한 보류 정보 리스트에 저장하여 관리한다. 동선추적부는 제2 영상에서 감지영역으로 새롭게 진입한 신규 객체를 검출한다(S806). 일 실시예에서, 도 9a와 같이, 동선추적부는 사각영역에서 감지영역으로 새롭게 진입한 신규 객체를 감지 할 수 있다. 일 실시예에서, 도 9b와 같이, 동선추적부는 사각영역 1(DZ 1) 또는 사각영역 2(DZ 2)의 입출구에서 감지 영역으로 새롭게 진입한 신규 객체를 검출할 수 있다. 동선추적부는 신규 객체에 대하여 특징벡터를 추출하여 신규 객체와 보류 정보를 매칭한다(S808). 동선추적부는 특징벡터 알고리즘을 통해 객체의 얼굴에 대한 특징벡터를 추출할 수 있다. 신규 객체에 대한 동선정보에는 성별 및 나이 등과 같은 객체 정보를 포함하지 않을 수 있다. 동선추적부는 신규 객체에 대한 특징벡터와 기 저장된 보류 정보에서의 특징벡터 사이의 유사도를 기초하 여 새로운 객체와 매칭될 보류 정보를 결정할 수 있다. 일 실시예에서, 신규 객체에 대한 특징벡터와 보류 정보에 존재하는 특징벡터 사이의 유사도가 기준 값 이상이 면, 동선추적부는 신규 객체의 ID를 기존 객체의 ID와 매칭할 수 있다. 동선추적부는 유사도의 기준 값을 90% 이상으로 설정할 수 있으며, 기준 값은 한정하지 않고, 다르게 설정 될 수 있다. 이와 같은 방법으로, 도 9b에서, 동선추적부는 각각의 사각영역에서 감지영역으로 새롭게 나타나는 객체에 대하여 사각영역별로 저장된 보류 정보와 매칭할 수 있다. 한편, 도 9에서는 신규 객체의 특징 벡터에 기반하여 보류 정보를 매칭하는 것으로 설명하였으나, 신규 객체와 보류 정보를 매칭하는 방법이 이에 한정되는 것은 아니다. 동선추적부는 신규 객체에 대한 타임스탬프, 좌표를 더 추출할 수 있다. 동선추적부는 신규 객체에 대하여 타임스탬프, 좌표 및 특징벡터를 포함하는 동선정보를 생성할 수 있다. 구체적으로, 일 실시예에서, 신규 객체의 특징벡터와 기 저장된 보류 정보의 특징벡터 사이의 유사도가 기준 값 보다 낮은 경우, 동선추적부는 신규 객체의 타임스탬프와 기존 객체의 타임스탬프 사이의 차이 값을 기초 하여 신규 객체와 매칭될 보류 정보를 결정한다. 일 실시예에서, 신규 객체의 특징벡터와 기 저장된 보류 정보의 특징벡터 사이의 유사도가 기준 값 이상인 보류 정보가 복수 개인 경우, 동선추적부는 신규 객체의 타임스탬프와 기존 객체의 타임스탬프 사이의 차이 값 을 기초하여 신규 객체와 보류 정보를 매칭한다. 동선추적부는 신규 객체의 타임스탬프와 기존 객체의 타임스탬프 사이의 차이 값이 기준 값보다 낮은 경우 에 신규 객체와 기존 객체를 동일인으로 인식하여, 신규 객체의 ID를 해당 기존 객체의 ID로 교체할 수 있다. 일 실시예에서, 신규 객체의 특징벡터와 기 저장된 보류 정보의 특징벡터 사이의 유사도가 기준 값보다 낮은 경 우, 동선추적부는 신규 객체의 좌표 정보와 보류 정보의 좌표 정보를 기초하여 새로운 객체와 매칭될 보류 정보를 결정한다. 일 실시예에서, 신규 객체의 특징벡터와 기 저장된 보류 정보의 특징벡터 사이의 유사도가 기준 값 이상인 높은 보류 정보가 복수 개인 경우, 동선추적부는 신규 객체의 좌표 정보와 기존 객체의 좌표 정보를 기초하여 신규 객체와 보류 정보를 매칭한다. 동선추적부는 신규 객체의 좌표 정보가 기존 객체의 좌표 정보와의 차이 값이 기준 값보다 작은 경우에 신 규 객체와 기존 객체를 동일인으로 인식하여 신규 객체의 ID를 해당 기존 객체의 ID로 교체할 수 있다. 동선추적부는 신규 객체의 타임스탬프와 기존 객체의 타임스탬프 사이의 간격이 짧을수록, 신규 객체의 좌 표와 기존 객체의 좌표가 가까울수록 동일인으로 인식하여 신규 객체와 기존 객체를 매칭할 수 있다. 이하에서는 도 10을 이용하여 본 발명의 일 실시예에 따른 객체의 동선을 추적하는 방법에 대하여 설명한다. 도 10은 본 발명의 일 실시예에 따른 객체의 동선을 추적하는 방법을 설명하기 위한 순서도이다. 객체인식부는 제1 영상을 이용하여 매장에 진입한 객체를 인식한다(S1000). 객체를 인식하는 방법은 도 4 내지 도 5b를 이용하여 이미 설명하였는 바, 자세한 설명은 생략한다. 동선추적부는 제2 영상을 이용하여 S1000 단계에서 인식한 객체의 동선정보를 생성하여 해당 객체의 동선 을 추적한다(S1002). 동선추적부는 사각영역, 통로, 탈의실 등으로 진입하여 감지영역으로부터 사라지는 객체와 감지영역에 다 시 나타난 새로운 객체를 기준 객체와 매칭하여 해당 객체의 동선을 추적한다. 객체의 동선정보를 생성하여 객체의 동선을 추적하는 방법은 도 6 내지 도 9b를 이용하여 이미 설명하였는 바, 자세한 설명은 생략한다. 동선추적부는 생성된 객체의 동선정보를 객체 동선 관리 서버로 전송한다(S1004). 객체 동선 관리 서버는 객체의 동선정보를 저장하여 객체의 동선을 관리할 수 있다. 이상에서 설명한 바와 같이, 본 발명에 따르면, 객체의 동선정보를 생성하여 객체가 제2 영상에서 사라지거나 나타난 경우에서의 객체의 동선 정보와 보류 정보를 비교함으로써, 객체의 동선을 추적할 수 있다. 나아가, 객체 동선 추적을 통해 고객 유입율을 파악하고, 매장내 특정 매대 앞에 머무는 고객의 행동을 분석할 수 있다. 본원 발명의 실시예들과 관련된 기술 분야에서 통상의 지식을 가진 자는 상기 기재의 본질적인 특성에서 벗어나 지 않는 범위에서 변형된 형태로 구현될 수 있음을 이해할 수 있을 것이다. 그러므로, 개시된 방법들은 한정적 인 관점이 아닌 설명적 관점에서 고려되어야 한다. 본 발명의 범위는 발명의 상세한 설명이 아닌 특허청구 범위 에 나타나며, 그와 동등한 범위 내에 있는 모든 차이점은 본 발명의 범위에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2022-0079613", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 객체 동선 추적 시스템을 설명하기 위한 블록도이다. 도 2는 도 1의 객체 추적 장치를 설명하기 위한 블록도이다. 도 3은 도 2의 카메라부를 설명하기 위한 도면이다. 도 4는 본 발명의 일 실시예에 따른 객체를 인식하는 과정을 설명하기 위한 순서도이다. 도 5a 및 도 5b는 S400 및 S402 단계를 설명하기 위한 예시도이다. 도 6은 객체의 동선정보를 생성하는 과정을 설명하기 위한 순서도이다. 도 7a 및 도 7b는 S600 내지 S604 단계를 설명하기 위한 예시도이다. 도 8은 본 발명의 일 실시예에 따른 추적이 끊어진 ID를 다시 연결하는 과정을 설명하기 위한 순서도이다. 도 9a 및 도 9b는 도 8를 설명하기 위한 예시도이다. 도 10은 본 발명의 일 실시예에 따른 객체의 동선을 추적하는 방법을 설명하기 위한 순서도이다."}
