{"patent_id": "10-2019-0037253", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0114846", "출원번호": "10-2019-0037253", "발명의 명칭": "낙상 감지 장치", "출원인": "주식회사 에스비휴먼텍", "발명자": "정현우"}}
{"patent_id": "10-2019-0037253", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자 행동에 기반한 신호를 검출하기 위한 센서부; 및 상기 센서부로부터의 신호를 수신하고 수신된 신호에기반하여 사용자의 낙상 여부를 판단하는 프로세서; 및 외부의 스마트폰 어플리케이션과 통신하기 위한 통신부를 포함하는 낙상 감지 장치에 있어서,상기 센서부는, 사용자의 3축상(x,y,z)의 가속도 및 각속도를 포함하는 자세 검출하기 위한 적어도 하나의IMU(Inertial Measurement Unit)를 포함하고,상기 낙상 감지 장치의 프로세서는, 사용자의 움직임을 감별하기 위한 움직임 감지 알고리즘;사용자의 낙상을 판별하기 위한 낙상 감지 알고리즘; 및낙상 감지에 이용되는 랜덤 포레스트 코드를 자동으로 생성하는 랜덤 포레스트 코드 생성 프로그램을 수행하도록 구성된 것을 특징으로 하는 낙상 감지 장치."}
{"patent_id": "10-2019-0037253", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,랜덤 포레스트 코드 생성 프로그램은, 클래스 확율(class probability), 컷 포인트(cut point), 컷 프레딕터(cut predictor)의 정보로 구성되고, 여기서 컷 프레딕터(cut predictor)는 노드를 구분짓는 파라메터를 나타내고, 컷 포인트(cut point)는 임계치를 나타내며, 클래스 확율(class probability)는 각각의 노드에 해당하는 클래스(class)의 종류를 나타내는 것을 특징으로 하는 낙상 감지 장치."}
{"patent_id": "10-2019-0037253", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 낙상 감지 장치는, 사용자가 직접 입력하기 위한 입력 스위치; 및사용자의 위험 상황을 외부에 알리기 위한 소리 출력부;를 더 포함하는 것을 특징으로 하는 낙상 감지 장치."}
{"patent_id": "10-2019-0037253", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 낙상 감지 장치는, 상기 입력 스위치가 On될 때 사용자의 입력에 의해 낙상 여부를 판단하는 수동모드, 상기 입력 스위치가 Off될 때 상기 센서부로부터의 입력되는 가속도 및 각속도에 기반하여 사용자의 낙상 여부를 자동으로 판별하는 자동 모드; 및상기 입력 스위치가 Off될 때 상기 센서부로부터의 입력되는 가속도 및 각속도에 기반하여 상기 낙상 감지 장치의 전력 소모를 최소화하는 저전력 모드;공개특허 10-2020-0114846-3-사이에서 선택적으로 동작하도록 구성된 것을 특징으로 하는 낙상 감지 장치."}
{"patent_id": "10-2019-0037253", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 수동 모드에서 낙상 감지 장치는, 사용자가 미리 정해진 회수 이상 상기 스위치를 탭한 경우 사용자가 낙상인 것으로 판단하고, 상기 프로세서는 상기 어플리케이션에 사용자가 낙상 위험을 통보하고, 상기 어플리케이션에서 사용자의 낙상 위험을 수신하면 사용자의 낙상 위험을 외부에 전달하도록 구성된 것을 특징으로 하는 낙상 감지 장치."}
{"patent_id": "10-2019-0037253", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4항에 있어서,상기 자동 모드에서 낙상 감지 장치는 상기 IMU 센서로부터의 3축 가속도, 각속도 값을 이용하여 인공지능 알고리즘 입력에 맞는 특징점들을 계산하고 알고리즘 결과에 따라 낙상을 판단하도록 동작하는 것을 특징으로 하는낙상 감지 장치."}
{"patent_id": "10-2019-0037253", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제4항에 있어서,상기 자동 모드에서, 상기 프로세서는사용자 움직임이 발생될 때 입력되는 3축 가속도 값을 수집하여 전처리를 수행하고, 상기 전처리는, 수집된 값에서 중력 가속도 값을 제거하는 처리, 및중력 가속도가 제거된 값에서 노이즈를 제거하는 처리를 포함하는 것을 특징으로 하는 낙상 감지 장치."}
{"patent_id": "10-2019-0037253", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제4항에 있어서,상기 프로세서는 상기 낙상 감지 장치가 자동 모드에서 있고 미리정해진 기준의 움직임이 검출되지 않을 때 낙상 감지 장치를 저전력 모드로 전환하는 것을 특징으로 하는 낙상 감지 장치."}
{"patent_id": "10-2019-0037253", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 사용자의 낙상 여부를 판단하는 낙상 감지 장치에 관한 것으로, 본 발명에 따르면 사용자 행동에 기반 한 신호를 검출하기 위한 센서부; 및 상기 센서부로부터의 신호를 수신하고 수신된 신호에 기반하여 사용자의 낙 상 여부를 판단하는 프로세서; 및 외부의 스마트폰 어플리케이션과 통신하기 위한 통신부를 포함하는 낙상 감지 장치가 제공된다. 여기서 센서부는, 사용자의 3축상(x,y,z)의 가속도 및 각속도를 포함하는 자세 검출하기 위한 적어도 하나의 IMU(Inertial Measurement Unit)를 포함하고, 낙상 감지 장치의 프로세서는, 사용자의 움직임을 감별하기 위한 움직임 감지 알고리즘; 사용자의 낙상을 판별하기 위한 낙상 감지 알고리즘; 및 낙상감지에 이용 되는 랜덤 포레스트 코드를 자동으로 생성하는 프로그램을 수행하도록 구성된 것을 특징으로 하는 낙상 감지 장 치."}
{"patent_id": "10-2019-0037253", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 낙상 감지 장치에 관한 것으로, 낙상 사고 등에 의한 위험으로부터 신속하게 대처할 수 있는 낙상 감 지 장치에 관한 것이다."}
{"patent_id": "10-2019-0037253", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 스마트폰과 같은 이동 단말기 기술의 발전과 센서 기술을 이용한 사물 인터넷의 출현으로 인해 이동 단말 기와 센서를 조합한 다양한 기능이 구현되고 있다. 특히 사용자가 위험한 상황에 처했을 때 이동 단말기를 이용하여 자동으로 전화를 걸거나 자신의 위치를 알리는 구조 기술이 출현되고 있다. 일례로, 대한민국 공개특허 10-2011-0035420호는 감지 센서를 이용한 위험 알림 방 법에 대해 개시하고 있다. 이 특허문헌에서는 사용자의 신체 일부에 착용되어 사용자의 신체적 이상을 감지한 경우 위험 알림 신호를 발생 시키는 감시 센서와, 감지 센서를 착용한 사용자가 활동하는 특정 공간 내에 설치된 위험 알림 장치를 통하여 상기 사용자의 신체적 이상을 감지하여 위험을 알려주는 위험 알림 방법을 개시하고 있다. 구체적으로 이에 따른 방법에서는 감지 센서는 사용자의 목, 손 등에 목걸이, 시계 등의 형태로 착용될 수 있고, 감지 센서에는 알에프아이디(RFID), 지그비(Zigbee) 또는 블루투스등과 같은 근거리 통신 수단이 설치되 어 위험 알림 장치와 근거리 무선 통신을 수행하도록 구성되어, 감지 센서가 사용자의 심장박동, 혈압, 체온 등 에 일정 수치 이상의 변화가 생긴 경우 이상이 발생한 것으로 판단하여 위험 알림 신호를 근처의 위험알림장치 로 근거리 무선통신을 통해 전송하도록 구성되어 있다. 그러나 이와 같은 종래 기술에서는 사용자의 심장박동, 혈압, 체온 등의 수치에 기반하여 위험상황을 판단하고 대처하고 있기 때문에, 사용자가 그 이외의 위험한 상황에 처했을 때에는 대응할 수 없다는 문제가 있다. 또한 개개인의 신체적 조건, 움직이는 습관 등의 사용자 개인의 정보가 고려되지 않고 위험상황을 통계적으로 일반화 한 획일화된 기준으로 판단하기 때문에 위험상황 판단 정확도가 낮은 문제가 있다. 최근 고령화로 인한 노인 낙상사고가 증가함에 따라 노인 낙상이 사회적 문제로 부상하고 있는데, 노인 낙상 관 련 사회적 의료비용 1조 1,000억원/년으로 해가 지남에 따라 점점 더 증가하는 추세이며, 특히 독거노인의 경우 낙상 사고 발생 시 돌봐줄 사람이 없어 초동 대처가 미흡하거나 도움을 요청할 상황이 안되는 등 자칫 잘못하다 생명을 잃게 되는 위험한 상황을 초래하게 된다. 따라서 낙상을 스스로 감지하고 위험 상황을 외부에 자동으로 알릴 수 있는 낙상 감지 장치가 필요하다. 이러한 낙상 감지 장치는 사용자 개개인의 정보에 맞추어 낙상 감지 정확도를 높일 필요가 있다. 또한 사용자가 위험상황을 감지하는 장치와 휴대폰 앱을 연동하는데 있어서 블루투스를 키고 끄는 기능, 앱에서 제품군을 찾아 페어링하는 기능 등을 이용하기 위해서는 휴대폰을 일정 수준 이상으로 다룰 수 있을 필요가 있 다. 그러나 위험상황을 감지하는 낙상 감지 장치의 주요 사용자인 노인들에게 휴대폰 앱을 자유자재로 이용하는 것은 매우 어려운 일이다. 따라서 낙상 감지와 같은 기능을 구현하는 휴대폰 앱은 사용자가 따로 인지하지 않아 도 자동으로 작동될 필요가 있다. 또한 낙상의 경우 걸려 넘어짐, 미끄러짐, 앞으로 넘어짐, 주저 앉음 등과 같이 여러 종류를 포함하는데, 이와 같이 낙상의 종류에 대응하여 폭 넓고 정확하게 구분할 수 있는 낙상 감지 장치 및 이를 분별할 수 있는 방법이 필요하다. 이를 위해 여러 신호를 받아 낙상 감지르 유연하게 판단할 수 있는 학습 기반 인공지능 알고리즘이 개발되고 있 으나 장치 내 계산 부담 증가 문제, 장치 내 데이터 치리 속도 문제, 배터리 소모 문제 등으로 실용화되기에는 어려운 문제가 있다. 종래에 개발되고 있는 인공지능 알고리즘 기반 낙상 판별 장치들은 사용자가 착용한 낙상 감지 장치 내부에서 알고리즘이 계산되는 것이 아닌 장치와 유/무선 통신으로 연결된 컴퓨터, 휴대폰 등과 같은 고성능 데이터 처리 장치에서 알고리즘이 계산되기 때문에 고성능 데이터 처리 장치를 벗어나게 되면 낙상을 감 지할 수 없게되는 공간적인 제약 문제가 있다. 따라서 장치 내에서 다양한 낙상의 종류를 폭 넓고 정확하게 구 분할 수 있으며 개인의 정보 또한 학습할 수 있는, 데이터 처리 부담이 적어 배터리 소모 문제를 해결할 수 있 는 낙상 감지 장치의 개발이 요구된다.데이터 처리 부담이 적은 학습기반 인공지능 알고리즘 중 하나로 랜덤 포레스트를 예로 들 수 있다. 장치 내에 알고리즘을 삽입하는 과정에서 랜덤 포레스트 알고리즘에 해당하는 코드는 대부분 if, else문으로 구성된다. 이 때 구성되는 노드의 개수가 많으면 구현되는 코드의 길이 또한 길어진다. 예를 들어, 총 563개의 노드를 가진 랜덤 포레스트의 경우 1개의 노드 당 6~7개 줄의 코드가 필요하므로 약 3378~3941개 줄의 코드가 필요하게 된다. 이를 일일이 손으로 타이핑하기에는 많은 시간이 필요하며 타이핑 도중 파라메터의 순서가 혼동되거나 임 계치 값을 입력하는 과정에서 오탈자 등의 문제가 나올 수 있다. 또한 노드 특성 상 같은 if, else의 형태가 반 복되므로 코드를 입력해야하는 위치를 특정하기에 어려운 경우가 많다. 따라서 랜덤 포레스트 코드를 자동으로 생성하고 이를 학습할 수 있는 방식이 더 요구된다."}
{"patent_id": "10-2019-0037253", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술한 문제점에 기반하여, 낙상을 스스로 감지하고 위험 상황을 외부에 자동으로 알릴 수 있는 낙상 감지 장치를 제공하는 것을 목적으로 한다. 또한 본 발명은 낙상 감지 장치와 같은 소형의 독립된 장치에서 배터리 연속 사용시간을 증가시킬 수 있는 저전 력 하드웨어 및 소프트웨어 설계를 포함하는 낙상 감지 장치를 제공하는 것을 다른 목적으로 한다. 또한 본 발명은 노인과 같이 스마트폰의 앱에 익숙하지 않은 사용자들도 어려움없이 장치를 사용할 수 있는 낙 상 감지 장치를 제공하는 것을 목적으로 한다. 또한 본 발명은 낙상 감지 장치에 사용되는 랜덤 포레스트 코드를 자동으로 생성할 수 있는 학습 결과 코드화 알고리즘을 낙상 감지 장치에 제공하여 각 사용자 개개인의 정보를 고려함으로써 학습도 및 신뢰도가 향상된 낙 상 감지 장치를 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2019-0037253", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "전술한 목적을 달성하기 위해, 본 발명의 하나의 양태에 따르면, 사용자 행동에 기반한 신호를 검출하기 위한 센서부; 및 상기 센서부로부터의 신호를 수신하고 수신된 신호에 기반하여 사용자의 낙상 여부를 판단하는 프로 세서; 및 외부의 스마트폰 어플리케이션과 통신하기 위한 통신부를 포함하는 낙상 감지 장치가 제공된다. 전술한 양태에서 센서부는, 사용자의 3축상(x,y,z)의 가속도 및 각속도를 포함하는 자세 검출하기 위한 적어도 하나의 IMU(Inertial Measurement Unit)를 포함하고, 낙상 감지 장치의 프로세서는, 사용자의 움직임을 감별하 기 위한 움직임 감지 알고리즘; 사용자의 낙상을 판별하기 위한 낙상 감지 알고리즘; 및 낙상 감지에 이용되는 랜덤 포레스트 코드를 자동으로 생성하는 랜덤 포레스트 코드 생성 프로그램을 수행하도록 구성된다. 또한 전술한 양태에 있어서, 랜덤 포레스트 코드 생성 프로그램은, 클래스 확율(class probability), 컷 포인트 (cut point), 컷 프레딕터(cut predictor)의 정보로 구성되고, 여기서 컷 프레딕터(cut predictor)는 노드를 구분짓는 파라메터를 나타내고, 컷 포인트(cut point)는 임계치를 나타내며, 클래스 확율(class probability)는 각각의 노드에 해당하는 클래스(class)의 종류를 나타낸다. 또한 전술한 양태에서, 낙상 감지 장치는, 사용자가 직접 입력하기 위한 입력 스위치; 및 사용자의 위험 상황을 외부에 알리기 위한 소리 출력부;를 더 포함한다. 또한 전술한 양태에서 낙상 감지 장치는 입력 스위치가 On될 때 사용자의 입력에 의해 낙상 여부를 판단하는 수 동모드, 상기 입력 스위치가 Off될 때 상기 센서부로부터의 입력되는 가속도 및 각속도에 기반하여 사용자의 낙 상 여부를 자동으로 판별하는 자동 모드; 및 입력 스위치가 Off될 때 상기 센서부로부터의 입력되는 가속도 및 각속도에 기반하여 상기 낙상 감지 장치의 전력 소모를 최소화하는 저전력 모드; 사이에서 선택적으로 동작하도 록 구성될 수 있다. 또한 전술한 양태에서 수동 모드에서 낙상 감지 장치는, 사용자가 미리 정해진 회수 이상 상기 스위치를 탭한 경우 사용자가 낙상인 것으로 판단하고, 상기 프로세서는 상기 어플리케이션에 사용자가 낙상 위험을 통보하고, 상기 어플리케이션에서 사용자의 낙상 위험을 수신하면 사용자의 낙상 위험을 외부에 전달하도록 구성된다. 또한 전술한 양태에서 자동 모드에서 낙상 감지 장치는 상기 IMU 센서로부터의 3축 가속도, 각속도 값을 이용하 여 인공지능 알고리즘 입력에 맞는 특징점들을 계산하고 알고리즘 결과에 따라 낙상을 판단한다. 또한 전술한 양태에서 자동 모드에서, 상기 프로세서는 사용자 움직임이 발생될 때 입력되는 3축 가속도 값을 수집하여 전처리를 수행하고 상기 전처리는, 수집된 값에서 중력 가속도 값을 제거하는 처리, 및 중력 가속도 가 제거된 값에서 노이즈를 제거하는 처리를 포함한다. 또한 전술한 양태에서 프로세서는 상기 낙상 감지 장치가 자동 모드에서 있고 미리정해진 기준의 움직임이 검출 되지 않을 때 낙상 감지 장치를 저전력 모드로 전환하도록 구성될 수도 있다."}
{"patent_id": "10-2019-0037253", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면 저전력 하드웨어 및 소프트웨어 설계를 통하여 낙상 감지 장치의 배터리 소모량을 크게 줄임 으로써 배터리 연속 사용시간이 증가되고, 따라서 사용자가 장치를 자주 충전하지 않아도 되기 때문에 장치를 부착 후 크게 신경쓰지 않아도 되어 편의성이 증가된다. 또한 본 발명에 따르면 낙상 감지 장치 내에 학습 결과를 코드화할 수 있는 학습 결과 코드화 알고리즘을 제공 하여 각 사용자 개개인의 정보를 고려함으로써 낙상 감지 장치의 학습도 및 신뢰도를 향상시킬 수 있게 된다. 또한 본 발명의 정확한 낙상 자동 감지 시스템과 119 출동 시스템, 보안 업체 등과 연동 시 노인의 부상을 최소 화하고 위험 상황을 예방할 수 있는 효과가 얻어질 수 있다. 또한 본 발명에 따르면, 어플리케이션에서 블루투스 모니터링 기능(블루투스 버튼이 꺼져도 이를 모니터링하다 가 다시 킬 수 있는 기능), 앱이 꺼져도 백그라운드에서 블루투스 페어링을 유지하는 기능, 위험상황이 감지되 었다는 통신을 받으면 백그라운드에서 앱을 다시 켜고 위험상황을 주변에 알리는 기능, 및 다른 블루투스 제품 과의 이용 유연성을 위해서 낙상감지 장치와의 페어링 순위를 우선적으로 또는 최하위로 변환시킬 수 있는 기능 을 제공함으로써 스마트폰의 어플리케이션에 익숙하지 않은 노인들의 장치 사용 효율을 향상시킬 수 있다."}
{"patent_id": "10-2019-0037253", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되는 실시예를 참조하면 명확해질 것이다. 그러나, 본 발명은 이하에서 개시되는 실시예에 한정되는 것이 아니라 서로 다른 다 양한 형태로 구현될 것이다. 본 명세서에서 본 실시예는 본 발명의 개시가 완전하도록 하며, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이다. 그리고 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 따라서, 몇몇 실시예들에서, 잘 알려진 구성 요소, 잘 알려진 동작 및 잘 알려진 기술들은 본 발명이 모호하게 해석되는 것을 피하기 위하여 구체적으로 설명되지 않는다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성 요소를 지칭한다. 그리고, 본 명세서에서 사용된(언급된) 용어 들은 실시예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명세서에서, 단수형은 문구 에서 특별히 언급하지 않는 한 복수형도 포함한다. 또한, '포함(또는, 구비)한다'로 언급된 구성 요소 및 동작 은 하나 이상의 다른 구성요소 및 동작의 존재 또는 추가를 배제하지 않는다. 다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것이다. 또 일반적으로 사용되는 사전에 정의되어 있는 용어들은 정의되어 있지 않은 한 이상적으로 또는 과도하게 해석되지 않는다. 도 1은 본 발명에 따른 낙상 위험에 대처하기 위한 낙상 감지 장치 및 낙상 감지 장치와 통신가능한 스마트 폰을 나타낸다. 낙상 감지 장치는 스위치, 배터리 및 회로 기판으로 구성되며, 도 1에 도시된 바와 같이 사용자의 밸트 등에 탈부착가능한 형태로 구현된다. 도 1에 도시된 바에 따르면 낙상 감지 장치(20 0)는 대략 박스 형태로 구현되고, 케이스의 일측면 상에는 낙상 감지 장치의 동작 모드를 스위칭 하기 위 한 스위치가 형성되어 있다. 또한 스위치의 반대 측면에는 사용자의 밸트와 결합하기 위한 결합용 클립이 더 형 성되어 사용자는 낙상 감지 장치를 사용하기 전에 결합용 클립을 이용하여 자신의 밸트에 간단하게 고정부 착할 수 있게 된다. 스마트 폰에는 낙상 감지 장치와 통신을 전담하기 위한 어플리케이션이 설치되고, 어플리케이션(11 0)은 특정 상황에서 외부의 관리 서버 또는 119 등의 응급 센터와 통신을 수행하도록 동작한다.낙상 감지 장치와 스마트 폰 사이의 연결은 블루투스를 포함하는 근거리 무선 통신을 이용하여 서로 연결되고, 스마트 폰과 관리 서버 또는 응급 센터는 LTE, 3G 등과 같은 이동 통신망 또는 이더넷 망 과 같은 네트워크를 통해 서로 연결될 수 있다. 또한 낙상 감지 장치는 도시되지는 않았지만 그 내부에 물이 스며드는 것을 방지하기 위한 밀봉 수단(14 0)을 더 포함하여 등산과 같은 야외활동 중 비 또는 물로 인해 장치가 오동작하거나 고장나는 것을 방지하도록 구성되는 것이 바람직하다. 도 2는 도 1에서 설명한 낙상 감지 장치의 내부 구성을 나타낸 기능 블록도이다. 도 2에 도시한 바와 같이 본 발명에 따른 낙상 감지 장치는, 센서부(IMU), 프로세서(MCU), 위험상황 알림부, 통신부 , 및 전원부을 포함한다. 도 2에 도시된 실시예에서는 이해를 돕기 위해 그 기능별로 센서부, 프로세서, 통신부로 나누워 별개의 구성요 소로서 설명하고 있지만 센서부 및/또는 통신부 등의 성요소는 프로세서 내에 일체로 형성될 수 도 있다. 센서부는 사용자의 움직임을 감지하기 위한 적어도 하나의 IMU 센서를 포함한다. IMU 센서는 이 동관성을 측정할 수 있는 가속도계와 회전관성을 측정할 수 있는 자이로계와 방위각을 측정할 수 있는 자계로 이루어진 하나의 통합된 센서 유닛을 지칭한다. IMU 센서는 3차원 공간내에서의 자유로운 움직임을 측정하기 위하여 각 센서(가속도, 자이로, 지자계)를 3 축으로 구성되며, 낙상 감지 장치의 사용자의 자세 상태(3축(x축, y축, z축)상의 가속도 및 각속도)를 검출 한다. 프로세서는 IMU 센서로부터의 센서 데이터를 계산하고 처리하기 위해 펌웨어를 포함할 수 있다. 펌웨 어는 프로세서 내부 또는 외부의 메모리에 포함될 수 있으며, 센서부로부터의 데이터를 입력받고 통 신부를 통해 외부의 장치, 예를 들면 스마트폰의 어플리케이션과의 데이터 통신을 제어하고 또한 위험상황 알림부를 구동하도록 구성된다. 또한 프로세서는 케이스의 몸체에 형성된 스위치로부터의 입력을 수신하여 낙상 감지 장치의 동 작 모드를 결정한다. 동작 모드는 크게 수동 모드, 자동 모드, 저전력 모드로 구분되는데, 이에 대해서는 이후 에 설명하도록 한다. 위험상황 알림부는 센서들로부터의 입력 신호에 기반하여 프로세서가 위험 상황이라고 판단한 경우 이를 사용자에게 알려주기 위한 진동부, 위험 상황을 외부로 경고하기 위한 소리출력부(또는 부저 부), 및 외부에 위험 상황을 빛으로 알려주기 위한 LED를 포함한다. 소리출력부의 경우 바람직하게 120dB 이상의 소리를 출력하도록 설정되고, LED부은 120루멘 이상의 밝기를 갖도록 설정되어 위험 상황에 처했을 때 소리 또는 빛을 통해 외부에 손쉽게 이를 알릴 수 있다. 구체적으로 위험상황 알림부는 프로세서로부터의 명령에 의해 실행되도록 구성되는데, 진동부의 경우, 이하에 구체적으로 설명되는 바와 같이 프로세서가 센서들로부터의 신호를 판독한 후 위험상황인 것으로 판단한 경우 사용자에게 진동을 통해 위험상황에 대처하기 위한 프로세스가 실행되었음을 알려준다. 또한 프로세서는 사용자에게 대한 진동 알람을 실행한 후 일정 시간 동안 사용자로부터의 응답을 대기하고, 일정시간이 지나도록 사용자로부터의 미리 정해진 위험 상황 해제 응답(예를 들면 위험 상황 해제 스 위치로부터의 입력)이 오지 않는 경우 소리 출력부 또는 LED부를 구동시켜 알람 경보를 울리도록 동 작된다. 통신부는 와이파이, 블루투스, 근거리 통신, RFID, 블루투스 로우 에너지, 지그비, 또는 다른 무선 통신 기술, 또는 적외선용 인터페이스 또는 광 통신 기술과 같은 무선 또는 무접촉 통신 인터페이스를 포함할 수 있 는데, 바람직하게, 본 발명에서는 블루투스 통신 모듈를 채용하여 구현되었다. 블루투스통신 모듈이 이용된 경우 낙상 감지 장치는 블루투스 통신을 통해 스마트폰과 1:1 페어링이 이루어지고 스마트폰에 설치된 전용 어플리케이션을 통해 본 발명에 따른 추가의 서비스(지인 알림 또는 경찰서 등 알림)가 수행될 수 있다. 통신부는 전술한 바와 같이 위험 상황이 발생된 것을 외부로 알리기 위해 스마트 폰 내의 전용 어플 리케이션과의 통신을 수행하게 된다. 낙상 감지 장치는 충전부를 더 포함한다. 충전부는 낙상 감지 장치에 내장된 내장 배터리 를 충전하도록 기능하며 과충전을 방지하기 위한 보호 회로 등을 포함할 수도 있으며, 무선 충전 회로 또 는 유선 충전 회로로서 구현될 수도 있다. 다음으로 본 발명에 따른 프로세서의 동작에 대해 설명한다. 본 발명에 따른 프로세서는 메모리 등에 상주되는 움직임 감지 알고리즘 및 낙상 감지 알고리즘을 수행하도록 구성된다. 1. 움직임 감지 알고리즘 본 발명에 따른 낙상 감지 장치는 움직임 감지 알고리즘에 의해 낙상 감지 장치를 저전력 모드로 동작하게 한다. 낙상 감지 장치의 동작 모드는 도 3에 도시된 바와 같이, 수동 모드, 자동 모드, 저전력 모드를 포함한다. ① 수동 모드: 사용자가 낙상을 포함한 자신의 응급 상황을 스스로 판단하여 주위에 알리기 위한 모드로서, 스 위치를 푸쉬(스위치 on 상태)하면 수동 모드로 진입된다. 수동 모드 상태에서 사용자가 스위치를 다섯 번 이상 연속으로 누르면 프로세서가 이를 감지하고 응급 상황 경보를 작동시킨다. 이를 통해 사용자의 응급상황을 빠르게 대처할 수 있다. 추가적으로, 본 발명에서는 사용자가 낙상으로 인해 정신을 잃은 상태이거나 스위치를 이용하여 탭을 할 수 없 거나 정해진 탭 조건을 만족하지 못하는 경우를 대비하여, 이를 알리도록 구성된다.즉, 장치의 IMU 센서로부터 3축 상에서의 값(SMV값)이 3.85보다 크며, 50 프레임 안에 5번 이상 일 경우 그리고 5번의 간격의 표준편차가 0.1보다 낮을 경우 알람이 울리도록 개발되었다. 이는 3축 가속도 값 (x,y,z)를 기반으로 SMV 값을 계산하였을 때, 피크 값은 최소 3.85로 나타났고, 또한 50프레임 안에 5번 이상으 로 지정한 이유는 피크값 간의 간격이 약 10프레임으로 조사되었기 때문이다. ② 자동 모드: 스위치를 사용하지 않은 상태에서(스위치 off 상태, 디폴트) 사용자의 움직임이 있을 경우 자동 모드로 실행된다. 자동 모드에서는 프로세서는 본 발명에 따른 낙상 감지 알고리즘(또는 낙상 감지 모드)를 수 행하도록 구성되며, 센서부로부터 측정되는 센서 데이터(움직임의 패턴)에 따라 그 동작이 결정된다. ③ 저전력 모드: 저전력 모드는 자동 모드에서 일정 기준의 움직임이 검출되지 않으면 프로세서는 낙상 감 지 장치를 저전력 모드 또는 절전 모드로 전환한다. 각속도의 SMV의 경우 움직임이 없을 시 0에 가까운 양의 실수 값이 나타나며 움직임이 발생한 경우, 즉 장치의 회전이 발생한 경우 회전이 빠를수록 값이 커진다. 각속도의 SMV가 5.5 deg/s보다 크면 움직임이 있는 것으로 간주되고 반대로 작으면 움직임이 없는 것으로 간주한다. 그러나 실제 사용자가 움직일때 순간적으로 장치의 회 전이 적어 각속도의 SMV가 5.5 deg/s보다 적게 나와 움직임이 없다고 간주될 수 있기 때문에, 이를 방지하기 위 해 중간 카운터 변수를 추가한다. 각속도의 SMV가 5.5보다 크면 카운터 변수에 1을 추가하고 반대로 5.5보다 작 으면 카운터 변수를 1만큼 감소시킨다. 카운터 변수는 0에서 20까지의 범위를 가지며 카운터 변수가 3보다 작을 시 움직임이 없는 것으로 보고 저전력 모드로 진입한다."}
{"patent_id": "10-2019-0037253", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 2, "content": "도 4는 저전력모드에서의 실행 동작을 개략적으로 나타낸 흐름도이다. 도 3b에 도시된 바와 같이, 저전력 모드 에서, 프로세서는 전원이 인가되는 순간부터 블루투스 모듈을 항상 저전력 모드(sleep)로 전환하여 전력 소모를 최소화하며, MCU에서 낙상을 감지하면 블루투스 모듈을 정상 모드(wake up)로 전환하여 외부의 핸드폰 앱과 연 동시켜 위험상황을 전송한다. 프로세서는 센서부(각속도)에서 획득한 각속도 데이터의 크기에 대한 임계치를 기반으로 움직임을 감지하고 움 직임이 없으면 스스로 저전력 모드로 진입한다. 이후 가속도 센서 내부에서 움직임을 감지하여 가속도 센서와 연결된 프로세서의 인터럽트핀이 0에서 1로 체크되면 해당 엣지 신호를 프로세서의 핀에서 감지하여 프로세서가 정상 모드(wake up)로 전환된다. 한편 수동 모드에서 버튼을 누를 때 MCU가 저전력 모드이면 버튼의 엣지 신호를 이용하여 정상 모드(wake up)로 전환될 수 있다. 이와 같은 저전력 알고리즘이 적용된 되어 기존 개발된 모델들에 비교하여 다음과 같은 배터리 소모량이 측정되었다. [표 1] 배터리 사용시간 도 5는 SMV(signal magnitude vector)를 이용한 움직임 검출 신호를 설명하기 위한 도면이다. 도 5에서 1번 구 간에 해당하는 각속도 SMV는 움직임이 없는 경우로 5.5 값 이하로 나타난다. 그러나 움직임이 있는 경우에는, 2 번 구간과 같이 각속도 SVM 값이 5.5 값보다 크게 나타난다. 움직임이 없는 경우 카운터 변수의 값을 1씩 빼고 움직임이 있는 경우 카운터 변수의 값을 1씩 더한다. 카운터 변수의 범위는 0부터 20까지로 제한한다. 움직임이 없으면 카운터 변수의 값이 줄어들고 움직임이 발생하면 카운터 변수의 값이 증가한다. 카운터 변수를 통해 움 직이는 도중에 잠깐 회전이 작아 SMV가 5.5보다 일시적으로 작아지는 경우, 혹은 움직임이 없는 도중에도 숨쉬 기나 진동 등과 같이 약간의 회전이 발생하여 SMV가 5.5보다 일시적으로 커지는 경우 판단이 잘못되는 경우를 방지할 수 있다. 카운터 변수가 3보다 작으면 사용자가 앉거나 서거나 누워서 쉬고 있음을 의미하고 이 경우 모 드는 절전 모드로 변환되게 됨에 따라 불필요하게 전력이 낭비되는 것을 방지할 수 있다. 2. 낙상 감지 알고리즘 도 6은 본 발명에 따른 낙상 감지 알고리즘의 전체적인 흐름을 나타낸 흐름도이다. 도 6에 도시된 바와 같이 본 발명에 따른 낙상 감지 장치는 센서로부터 신호를 수신 및 수집하고, 수집된 신호에 대해 전처리를 수행하고 전 처리된 신호 데이터를 인공지능 기반 낙상 감지 알고리즘 입력으로 넣어 낙상인지 판단하고 낙상인 것으로 판별 되면 위험 상황 알림부를 통해 외부에 부저를 울리고 동시에 낙상으로 인해 위험 상황이 발생하였음을 서버에 알리거나 미리 지정한 연락처로 낙상으로 인한 위험 상황이 발생하였음을 알리도록 구성된다. 또한 낙상으로 판 별되면 전처리 데이터들을 기반으로 인공지능 알고리즘을 수정할 수 있는 학습을 진행한다. 새롭게 추가 및 수 정된 인공지능 알고리즘을 장치 내 다시 적용하기 위하여 장치 내 인공지능 알고리즘 코드를 자동으로 생성하여 기존 인공지능 알고리즘을 삭제하고 새로운 코드를 삽입함으로써 사용자 개인의 움직임 습관, 몸 상태 등이 고 려된 알고리즘으로 업데이트 된다. 도 7은 원본의 가속도, 각속도 데이터로부터 전처리 데이터를 계산하는 과정을 나타내는 도면이다. 도 7에 나타 낸 바와 같이, 먼저 움직임이 발생할 때 감지되는 3축 가속도 및 각속도 신호를 수집한 후 전처리 과정을 수행 한다. 해당 처리 과정의 경우 장치에서 데이터를 받아 실시간으로 처리되며 1초 단위의 데이터를 받아 1회의 계산을 수행한다. 예를 들어 1초에 40회의 가속도, 각속도 데이터를 받는다면, 40개의 데이터 (1초 단위)를 이용하여 전처리 과정을 진행하며 1초에 40번씩 계산한다. 전처리 과정에서 입력되는 신호로부터 중력 가속도 값을 제거하기 위해 실시간 고대역 통과 필터(high pass filter)를 적용한 후, 노이즈 제거를 위해 미디언 필터를 적용한다. 이후 1초(window size 40프레임) 단위로 인공지능 알고리즘의 입력으로 들어가는 특징점들을 계산하게 된다. 본 발명의 낙상 예측 모델에 이용되는 입력은 24개의 특징점을 가지며, 구체적으로는 아래의 표 2와 같다.[표 2]본 발명에 이용되는 24개 특징점"}
{"patent_id": "10-2019-0037253", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 3, "content": "도 7에 나타낸 바와 같이 미디언 필터를 통과한 후 1초 단위의 데이터(40개의 데이터)를 하나의 단위로보고 이 를 이용하여 표 2에 나타낸 1-7번, 12-24번의 특징점들을 계산하게 된다. 또 다른 특징점들 (8-11번)은 미디언 필터를 통과 후 각 데이터의 음수 값을 양수로 치환하는 절대값 과정을 거친 후 계산하게 된다. 도 8은 각 특징점들을 계산하는 방법을 나타낸다. 특징점 1 - 3번에 나타난 Accx 와 같이 오른쪽 아래 첨자에서 의미하는 것은 해당 축의 40개의 단위에서 가장 최근에 포함된 하나의 가속도 값을 나타내며, Average(...)는 평균값, Variance(...)는 분산값, Standard_deviation(...)은 표준편차 값, sqrt(...)는 제곱근 값을 나타낸다. 특징점 7-11번, 21-23번과 같이 Accx 뒤에 붙는 (t)에서 t는 1부터 40까지의 수를 가질 수 있으며 40 개 단위의 각 색인을 나타낸다. 계산된 24개의 특징점들은 인공지능 알고리즘의 입력값으로 들어간다. 인공지능 알고리즘의 경우 장치 내에 삽 입되기 위해서는 계산이 많이 필요하지 않아 부담이 적은 알고리즘을 택할 필요가 있으며 그 일 예로 랜덤 포레 스트를 들 수 있다. 도 9는 랜덤 포레스트를 설명하기 위한 설명도이다. 랜덤 포레스트는 가속도 데이터로부터 여러 특징점들을 계 산하고 하나의 특징점의 특정 크기의 임계치 값의 크기 비교를 통한 1개의 노드를 생성할 수 있다. 노드를 통해 뻗어나간 두 개의 가지에서 각각 또 다른 1개의 노드를 생성할 수 있으며 이를 여러번 반복하여 마지막에 도달 하는 노드가 나타내는 클래스를 확인함으로써 입력되는 가속도 데이터가 어떤 동작을 나타내는지 확인할 수 있 다. 3. 낙상감지 장치 내 인공지능코드(Random Forest Code) 본 발명에서는 24개의 특징점들에 대해 랜덤 포레스트 코드를 생성하게 된다. 도 10는 if ~ else 구문으로 형성 되는 랜덤 포레스트의 간단한 일례를 나타낸다. 랜덤 포레스트는 클래스 확율(class probability), 컷 포인트(cut point), 컷 프레딕터(cut predictor)의 정보 로 구성된다. 이들 각각은 랜덤 포레스트를 구성하는 노드의 순서대로 정보가 나열되며, 컷 프레딕터(cut predictor)는 노드를 구분짓는 파라메터를 나타내고, 컷 포인트(cut point)는 임계치를 나타내며, 클래스 확율 (class probability)는 각각의 노드에 해당하는 클래스(class)의 종류를 나타낸다. 이를 엑셀이나 텍스트 파일 형태로 저장할 수 있으며 본 발명에서는 이를 이용하여 랜덤 포레스트 코드를 자동으로 생성할 수 있는 인공지 능코드 자동생성 프로그램을 장치에 제공함으로써 장치에서의 학습 결과가 코드화되어 저장될 수 있다. 도 11은 전술한 바와 같은 랜덤 포레스트 코드를 자동으로 생성하는 프로그램의 플로우차트를 나타내고 도 12 는 도 11의 플로우차트에 따른 랜덤 포레스트 코드를 자동 생성하는 예시를 나타낸 도면이다. 도 10 및 도 11에 도시된 바와 같이, 먼저 단계 S100에서 제어부는 랜덤 포레스트의 클래스 확율, 컷 포인트, 컷 프레딕터의 데이 터를 읽어들인다. 이어진 단계 S105에서 첫 번째 원소 ｉ= 0 부터 시작하며, 단계 S110에서는 bi가 생성된다. 여기서 bi는 랜덤 포레트스 코드를 생성할 때 노드의 순서에 따른 코드의 위치를 잡기 위한 임의의 변수이다. 단계 S110에서 bi 가 생성된 후 이어진 단계 S120에서는, 컷 포인트의 자료형이 스트링(string)인지 여부를 판단한다. 자료형이 스트링인 것으로 판단된 경우에는 단계 S140으로, 스트링이 아닌 것으로 판단되면 단계 S130으로 진행된다. 단계 S120에서 컷 포인트의 자료형이 스트링이 아닌 경우 진행되는 단계 S130에서는 분할노드를 생성하게 되는 반면 단계 S140에서는 결정노드(또는 끝점노드)를 생성하게 된다. 이 때 분할노드는 도 10에서 세모부분에 해당 하는 노드이고 결정노드는 트리(tree)의 끝점에 해당하는 원으로 표시된 노드이다. 분할노드의 경우 컷 프레딕 터를 통해 분할 노드에 대응하는 특징점 파라메터가 몇 번째 변수인지(도 10의 경우 x1 혹은 x2) 결정하고 컷 포인트를 통해 기준이 되는 임계치가 얼마나 되는지 결정된다. 단계 S130에서 분할노드가 생성되고 나면, 이 정보를 이용하여 후속되는 단계 S132에서 컷 프레딕터와 컷 포인 트를 이용하여 문서내에 if ~ else 프레임을 생성하게 되고, 단계 S136에서는 생성된 if ~ else 프레임 내부에 i에 1을 더하여 다음 코드를 삽입하는 위치를 결정하기 위한 임의의 문자 bi+1을 삽입한다. 단계 S134에서 프레임 내부에 bi+1이 삽입된 후 프로세서는 단계 S136에서 가장 아래에 위치한 bi를 if ~ else 프레임으로 대체하게된다. bi를 if ~ else 프레임으로 대체한 후 단계 S150에서는 현재 프레임 중에 bi가 남아 있는지 여부가 판단되고 단계 S150에서 처리해야 할 bi가 남아 있는 경우에는 단계 S154로, 그렇지 않은 경우에 는 단계 S152로 진행하게 된다. 단계 S152로 진행된 경우에는 i에 1을 증가시킨 후 후속하는 단계 S154로 진행되는데, 단계 S154에서는 컷 포인 트, 컷 프레딕터, 클래스 확율의 배열의 조사가 끝났는지 여부를 판단하고, 자료조사가 남아 있는 경우에는 단 계 120으로 복귀하여 단계 S120 내지 단계 S150을 반복하여 수행하게 된다. 한편 단계 S120에서 컷 포인트의 자료형이 스트링인 경우 진행되는 단계 S140에서는 결정노드를 생성하게 되고, 이어진 단계 S142에서는 클래스 확율을 참고하여 해당 노드의 클래스가 결정된다. 해당 노드의 클래스가 결정된 뒤 단계 S144에서는 가장 아래에 위치한 bi를 클래스로 대체한다. 이후의 단계는 전술하여 설명한 것과 동일함으로 이에 대한 상세한 설명은 생략하도록 한다. 4. 어플리케이션의 기능 본 발명에서는 스마트폰 및 어플리케이션의 사용에 익숙하지 않은 노인 사용자들의 사용 편의성을 위해 다음과 같은 추가의 기능들이 더 제공된다. 구체적으로 본 발명에 따른 낙상 감지 장치에 이용되는 어플리케이션이 스마트폰에 설치되면 어플리케어션은 스마트폰의 메 모리에 상주하도록 기능한다. 스마트폰의 메모리에 상주한 어플리케이션은 다음의 기능을 수행하도록 구성된다. 1) 블루투스 모니터링 및 페어링 기능: 어플리케이션은 스마트폰의 메모리에 상주하고 있고 스마트폰의 블루투 스 통신이 온 되어 있는지 여부를 모니터링하고 블루투스 통신이 오프된 경우 자동으로 블루투스 통신을 온으로 설정하도록 동작되고 낙상 감지 장치와의 페어링을 유지하도록 구성된다. 2) 위험상황 알림 기능: 어플리케이션은 위험 상황이 감지되었다는 통신을 낙상감지장치로부터 수신하면 백그라 운드에서 앱을 다시 활성화시키고 위험상황을 주변에 알리도록 기능한다. 3) 페어링 우선 순위 변환 기능: 어플리케이션은 낙상 감지 장치가 아닌 다른 블루투스 통신 제품의 이용상의 편리함을 위해 스마트폰과 낙상감지장치의 페어링 순서를 설정하도록 기능할 수 있다. 이 기능을 통해 사용자는 스마트폰과 낙상감지 장치와의 페어링 순위를 최우선 순위로, 최하위 순위로 지정할 수 있고, 필요한 경우 특정 순위, 예를 들면로 블루투스 이어폰 - 낙상감지장치 - 블루투스 입력장치(키보드, 펜) 등의 순서로 지정할 수도 있다."}
{"patent_id": "10-2019-0037253", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "이상의 설명은 본 발명의 기술 사상을 예시적으로 설명한 것에 불과한 것으로, 본 발명이 속하는 기술분야에서 통상의 지식을 갖는 자라면 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 다양한 수정 및 변형이 가능 할 것이다. 따라서, 본 발명에 게시된 실시예는 본 발명의 기술 사상을 한정하기 위한 것이 아닌 설명을 위한 것이고, 이런 실시예에 의하여 본 발명의 기술 사상의 범위가 한정되는 것은 아니다. 따라서 본 발명의 보호 범위는 전술한 실시예에 의해 제한되기 보다는 아래의 청구범위에 의하여 해석되어야하 며, 그와 동등한 범위 내에 있는 모든 기술 사상은 본 발명의 권리범위에 포함되는 것으로 해석되어야 할 것이다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12"}
{"patent_id": "10-2019-0037253", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 낙상 감지 장치 및 스마트폰 어플리케이션, 서버 사이의 관계를 나타내는 설명도. 도 2는 본 발명에 따른 낙상 감지 장치의 내부 구조를 개략적으로 도시한 블록도. 도 3은 본 발명에 따른 낙상 감지 장치의 동작 모드를 설명하기 위한 흐름도. 도 4는 저전력모드에서의 실행 동작을 개략적으로 나타낸 흐름도이다. 도 5는 본 발명에 따른 SMV(signal magnitude vector)를 이용한 움직임 검출 신호를 설명하기 위한 도면. 도 6는 낙상 감지 알고리즘의 전체적인 흐름을 나타낸 흐름도. 도 7은 원본의 가속도 각속도 데이터를 전처리하는 과정을 나타내는 도면. 도 8은 24개의 특징점을 계산하는 방법을 나타내는 도면. 도 9은 랜덤 포레스트 코드의 트리 구조를 나타낸 도면. 도 10는 랜덤 포레스트 코드를 설명하기 위한 설명도. 도 11은 랜덤 포레스트 코드를 자동으로 생성하는 프로그램의 흐름도. 도 12는 도 11의 랜덤 포레스트 코드 자동 생성 프로그램에 의해 생성되는 코드의 일례를 순차적으로 나타낸 도 면."}
