{"patent_id": "10-2023-7003427", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0028552", "출원번호": "10-2023-7003427", "발명의 명칭": "적응형 슬러리 분배 시스템", "출원인": "어플라이드 머티어리얼스, 인코포레이티드", "발명자": "데슈판데, 사미르"}}
{"patent_id": "10-2023-7003427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "기판들을 연마하는 컴퓨터 구현 방법으로서,연마 시스템을 사용하여 기판을 연마하는 단계 - 상기 기판 연마 단계는:(a) 연마 레시피에 따라 연마 유체를 연마 패드의 표면 상으로 유동시키는 단계 - 상기 연마 레시피는 복수의연마 파라미터들 및 대응하는 복수의 목표 값들을 포함함 -;(b) 상기 연마 레시피에 따라 기판을 상기 연마 패드의 표면에 대하여 압박하는 단계;(c) 제1 제어 파라미터를 조정함으로써, 상기 복수의 연마 파라미터들 중 제1 연마 파라미터를 그 목표 값에 또는 그 근처에 유지하는 단계;(d) 상기 연마 레시피 및 상기 제1 제어 파라미터의 시계열 데이터를 포함하는 처리 시스템 데이터를 생성하는단계; 및(e) (a)-(d) 단계와 동시에, 인-시튜 기판 모니터링 시스템으로부터 획득된 측정치들을 사용하여 시계열 인-시튜 결과 데이터를 생성하는 단계를 포함함 -;대응하는 복수의 훈련 데이터 세트들을 획득하기 위해 복수의 기판들에 대해 (a)-(e) 단계를 반복하는 단계 -상기 훈련 데이터 세트들 각각은 연마된 기판에 대한 상기 인-시튜 결과 데이터 및 상기 처리 시스템 데이터를포함함 -;인공 지능(AI) 훈련 플랫폼에서, 상기 복수의 훈련 데이터 세트들을 포함하는 훈련 데이터를 수신하는 단계 -상기 복수의 훈련 데이터 세트들의 적어도 부분은 시간상 순차적으로 수신됨 -; 및기계 학습 AI 알고리즘에 의해 수행되는 상기 수신된 훈련 데이터의 분석에 기초하여 상기 복수의 연마 파라미터들 중 하나 이상을 변경하는 단계를 포함하는, 방법."}
{"patent_id": "10-2023-7003427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 목표 값들은, 상기 연마 파라미터들 각각에 대해, 원하는 설정점들, 원하는 하한 임계치 위의 값들, 원하는 하한 임계치 아래의 값들, 및/또는 원하는 하한 임계치와 상한 임계치 사이의 값들을 포함하는, 방법."}
{"patent_id": "10-2023-7003427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 인-시튜 결과 데이터는, 관찰하도록 위치되고 상기 연마 패드의 표면의 적어도 부분의 온도의 변동을 검출하도록 구성되는 카메라로부터 제공되는 신호로부터 도출되는 데이터를 포함하는, 방법."}
{"patent_id": "10-2023-7003427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 제1 연마 파라미터는 상기 연마 패드의 표면의 온도를 포함하고,상기 제1 제어 파라미터는 상기 연마 패드의 표면에 전달되는 냉각제의 유량, 또는 상기 연마 패드의 표면에 전달되는 연마 유체의 유량을 포함하는, 방법."}
{"patent_id": "10-2023-7003427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,공개특허 10-2023-0028552-3-상기 인-시튜 결과 데이터는:상기 연마 유체가 상기 연마 패드의 표면 상에 분배되는 위치를 검출하도록 위치된 카메라로부터 제공된 신호로부터 도출된 데이터, 또는연마 유체 전달 노즐로부터 상기 연마 패드의 표면 상에 분배되는 상기 연마 유체의 적용범위의 양을 검출하도록 위치된 카메라로부터 제공된 신호로부터 도출된 데이터를 포함하는, 방법."}
{"patent_id": "10-2023-7003427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 제1 제어 파라미터는:상기 연마 패드의 표면에 전달되는 연마 유체의 유량, 또는상기 연마 패드의 표면에 대한 상기 연마 유체 전달 노즐의 위치를 포함하는, 방법."}
{"patent_id": "10-2023-7003427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 인-시튜 결과 데이터는:상기 연마 패드의 표면의 적어도 부분의 온도를 검출하도록 위치된 카메라로부터 제공된 신호로부터 도출된 데이터, 및연마 유체의 조성을 검출하도록 구성된 센서로부터 제공된 신호로부터 도출된 데이터를 포함하는, 방법."}
{"patent_id": "10-2023-7003427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 제1 연마 파라미터는 상기 연마 패드의 표면의 온도를 포함하고,상기 제1 제어 파라미터는 상기 연마 패드의 표면에 전달되는 냉각제의 유량, 또는 상기 연마 패드의 표면에 전달되는 연마 유체의 유량을 포함하는, 방법."}
{"patent_id": "10-2023-7003427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 인-시튜 결과 데이터는 상기 연마 패드의 표면의 거칠기를 검출하도록 위치되거나 상기 연마 패드의 표면의 광학 특성을 검출하도록 위치되는 카메라로부터 제공된 신호로부터 도출된 데이터를 포함하고,상기 제1 연마 파라미터는 상기 연마 패드의 표면의 패드 컨디셔닝 파라미터를 포함하고,상기 제1 제어 파라미터는, 컨디셔닝 디스크의 회전 속도, 상기 연마 패드에 대하여 상기 컨디셔닝 디스크에 가해지는 하향력, 상기 연마 패드의 표면의 하나 이상의 부분 위에서의 상기 컨디셔닝 디스크의 체류 시간, 또는상기 연마 패드의 표면에 걸친 상기 컨디셔닝 디스크의 스위프 속도를 포함하는, 방법."}
{"patent_id": "10-2023-7003427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 제1 연마 파라미터를 그 목표 값에 또는 그 근처에 유지하는 단계는:i. 상기 제1 연마 파라미터의 실제 값과 그의 목표 값 간의 차이를 결정하는 단계;ii. 상기 결정된 차이에 기초하여, 제1 제어 시스템의 상기 제1 제어 파라미터를 변경하는 단계; 및iii. 상기 제1 연마 파라미터에 대한 폐루프 제어를 제공하기 위해 i. 및 ii. 단계를 연속적으로 반복하는 단계를 포함하는, 방법."}
{"patent_id": "10-2023-7003427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "공개특허 10-2023-0028552-4-제10항에 있어서,상기 제1 연마 파라미터는 상기 연마 패드의 표면의 온도를 포함하는, 방법."}
{"patent_id": "10-2023-7003427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 연마 유체는 슬러리 조성물을 포함하고,상기 제1 제어 파라미터는 상기 연마 패드의 표면에 전달되는 상기 슬러리 조성물의 유량 또는 양을 포함하는,방법."}
{"patent_id": "10-2023-7003427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 제1 제어 파라미터는 상기 연마 패드의 표면에 전달되는 냉각제의 유량을 포함하는, 방법."}
{"patent_id": "10-2023-7003427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제10항에 있어서,상기 기계 학습 AI 알고리즘에 의해 수행되는 상기 수신된 훈련 데이터의 분석에 기초하여 상기 복수의 연마 파라미터들 중 하나 이상을 변경하는 단계는 상기 훈련 데이터를 사용하여 기계 학습 AI 알고리즘을 훈련하는 단계를 더 포함하고,상기 훈련된 기계 학습 AI 알고리즘은 상기 제1 제어 파라미터에 대한 상기 시계열 데이터와 상기 시계열 인-시튜 결과 데이터 사이의 함수 관계를 식별하고,상기 복수의 연마 파라미터들 중 하나 이상을 변경하는 단계는, 상기 함수 관계에 기초하여 상기 연마 패드의표면 상에 배치된 상기 연마 유체의 조성을 변경하는 단계를 포함하는, 방법."}
{"patent_id": "10-2023-7003427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 연마 유체의 조성을 변경하는 단계는, 상기 연마 패드의 표면에 전달되는 개별 연마 유체 성분의 유량을시작, 정지, 또는 변경하는 단계를 포함하는, 방법."}
{"patent_id": "10-2023-7003427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제1항에 있어서,상기 기계 학습 AI 알고리즘을 훈련하는 데 사용되는 훈련 데이터는:상기 복수의 기판들 중 하나 이상의 기판의 처리 이력들 및/또는 기판 상에 형성된 디바이스들에 관련된 정보를포함하는 기판 추적 데이터;원격 연마 유체 분배 시스템으로부터 상기 연마 시스템에 전달되는 연마 유체들의 분석 정보를 포함하는, 하나이상의 설비 공급 시스템을 사용하여 생성된 정보를 포함하는 설비 시스템 데이터; 및연마 후 전기 시험 측정 작동에서 상기 복수의 기판들 중 하나 이상으로부터 생성된 전기 시험 정보를 포함하는전기 시험 데이터중 하나 또는 조합을 더 포함하는, 방법."}
{"patent_id": "10-2023-7003427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "연마 시스템들 간의 연마 성능을 매칭하는 컴퓨터 구현 방법으로서,인공 지능(AI) 훈련 플랫폼에서, 복수의 훈련 데이터 세트들을 포함하는 훈련 데이터를 수신하는 단계 -상기 훈련 데이터 세트들 각각은 제1 연마 시스템을 사용하여 연마된 제1의 복수의 기판들 중 개별 기판들에 상공개특허 10-2023-0028552-5-관된 처리 시스템 데이터를 포함하고,상기 제1 복수의 기판들 중 상이한 기판들은 상기 제1 연마 시스템의 복수의 연마 스테이션들로부터의 연마 스테이션들과 복수의 기판 캐리어 조립체들로부터의 기판 캐리어 조립체들의 상이한 조합들을 사용하여 연마되고,상기 훈련 데이터 세트들 각각에 대한 상기 처리 시스템 데이터는: 복수의 연마 파라미터들 및 대응하는 복수의 목표 값들을 포함하는 연마 레시피 - 상기 복수의 연마 파라미터들 중 하나 이상은 대응하는 폐루프 제어 시스템을 사용하여 그들의 목표 값에 또는 그 근처에 유지됨 -; 및 상기 폐루프 제어 시스템들의 제어 파라미터들의 시계열 데이터를 포함함 -; 및상기 훈련 데이터를 사용하여 기계 학습 AI 알고리즘을 훈련하는 단계 - 상기 훈련된 기계 학습 AI 알고리즘은상기 제1 연마 시스템의 상기 상이한 연마 스테이션들 또는 상기 상이한 기판 캐리어 조립체들 사이의 차이들을식별하도록 구성됨 -; 및상기 식별된 차이에 기초하여 하나 이상의 보정 작용을 구현하는 단계를 포함하는, 컴퓨터 구현 방법."}
{"patent_id": "10-2023-7003427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서,상기 복수의 훈련 데이터 세트들은 제2 연마 시스템을 사용하여 연마된 제2의 복수의 기판들 중 개별 기판들에상관된 처리 시스템 데이터를 더 포함하고,상기 제2 복수의 기판들 중 상이한 기판들은 상기 제2 연마 시스템의 복수의 연마 스테이션들로부터의 연마 스테이션들과 복수의 기판 캐리어 조립체들로부터의 기판 캐리어 조립체들의 상이한 조합들을 사용하여 연마되고,상기 훈련된 기계 학습 AL 알고리즘은 상기 제1 및 제2 연마 시스템의 상기 상이한 기판 캐리어 조립체들 및/또는 상기 상이한 연마 스테이션들 사이의 차이들을 식별하도록 구성되고;상기 식별된 차이에 기초하여 하나 이상의 보정 작용을 구현하는, 컴퓨터 구현 방법."}
{"patent_id": "10-2023-7003427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에 있어서,상기 복수의 훈련 데이터 세트들 중 각각의 훈련 데이터 세트들은 상기 제1 및 제2 연마 시스템들의 상기 복수의 연마 스테이션들에 대응하는 인-시튜 기판 모니터링 시스템들로부터 획득된 시계열 인-시튜 결과 데이터를더 포함하는, 컴퓨터 구현 방법."}
{"patent_id": "10-2023-7003427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서,상기 인-시튜 기판 모니터링 시스템들은, 관찰하도록 위치되고 상기 제1 연마 시스템 내에 배치된 연마 패드의표면의 적어도 부분의 온도 변동을 검출하도록 구성되는 카메라를 포함하는, 컴퓨터 구현 방법."}
{"patent_id": "10-2023-7003427", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "연마 프로세스의 하나 이상의 양상을 제어하기 위해, 기계 학습 인공 지능(AI) 알고리즘을 사용하는 진보된 기판 연마 방법들, 또는 AI를 사용하여 생성된 소프트웨어 애플리케이션이 본원에 제공된다. AI 알고리즘은, 연마 시 스템으로부터 취득된 기판 처리 데이터를 사용하여, 연마 프로세스를 시뮬레이션하고, 연마 프로세스 및 그로부 터 예측되는 프로세스 결과들에 관하여 예측하도록 훈련된다."}
{"patent_id": "10-2023-7003427", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본원에 설명된 실시예들은 일반적으로, 반도체 디바이스 제조, 특히, 반도체 디바이스 제조에 사용되는 화학적 기계적 연마(CMP) 시스템들 및 관련 방법들에 관한 것이다."}
{"patent_id": "10-2023-7003427", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "화학적 기계적 연마(CMP)는 일반적으로, 고밀도 집적 회로들을 제조하는 데에, 기판 상의 물질 층을 평탄화하기 위해, 아래놓인 물질 층 표면으로부터 과잉의 물질을 소거하기 위해, 또는 둘 다를 위해 사용된다. 전형적인 CMP 프로세스에서, 기판은, 연마 유체의 존재 하에 기판의 후면측을 회전 연마 패드 쪽으로 누르는 캐리어 헤드 에 유지된다. 연마 패드는, 기판의 물질 표면과 그 아래에 배치된 이동하는 연마 패드 사이의 계면으로의 연마유체의 수송을 용이하게 하는 표면 돌기들을 갖는 중합체 물질로 종종 형성된다. 연마 유체는 전형적으로, 하 나 이상의 화학 성분의 수용액, 및 종종 연마 슬러리로 지칭되는, 수용액에 현탁된 나노규모의 연마 입자들을 포함한다. 물질은, 연마 유체에 의해 제공되는 화학적 및 기계적 활동, 기판과 연마 패드의 상대 운동, 및 기 판과 연마 패드 사이의 접촉 압력의 조합을 통해, 기판의 물질 층 표면에 걸쳐 제거된다. 소모품들, 예컨대, 연마 패드 및 연마 유체는 원하는 CMP 응용에 기초하여 선택된다. 일반적인 CMP 응용들은 다마신 프로세스에서의 벌크 막 평탄화 및 과잉 물질의 제거를 포함한다. 벌크 막의 평 탄화, 예컨대, 층간 유전체(ILD) 연마는 전형적으로, 물질 층의 표면에서의, 그 아래에 배치된 2차원 또는 3차 원 피쳐들에 의해 야기되는 바람직하지 않은 리세스들 및 돌출부들을 평활화하는 데 사용된다. 전형적인 다마 신 CMP 응용들은 얕은 트렌치 격리(STI) 및 층간 금속 인터커넥트 형성을 포함하고, 여기서 CMP는 내부에 배치 된 STI 또는 금속 인터커넥트 피쳐들을 갖는 하나 이상의 아래놓인 층의 노출된 표면(필드)으로부터 트렌치, 콘 택, 비아, 또는 라인 충전 물질(오버버든)을 제거하는 데 사용된다. 응용에 따라, CMP 프로세스 결과들은 전형적으로, 전역적 연마 균일성, 국부화된 평탄화 성능, 및 CMP에 의해 유도된 표면 결함성에 관련된 상호관련된 메트릭들의 조합을 특징으로 한다. 그러한 프로세스 결과들은 기판 상에 형성된 결과적인 디바이스들의 성능, 신뢰성 및/또는 작동성을 결정할 수 있다. 프로세스 허용 한계들을 벗어난 프로세스 결과들은 디바이스 고장으로 이어질 수 있고, 따라서, 기판 상에 형성된 사용가능한 디바이스 들의 수율을 억제한다. 전형적으로, 프로세스 결과 허용오차들은, 회로 밀도가 증가되고 디바이스 피쳐 크기가 감소됨에 따라 감소된다. 축소되는 디바이스 기하형상들에 대한 산업 수요를 충족시키기 위해, 진보된 CMP 시스템들은, 프로세스 결과들 에 영향을 주는 것으로 알려진 사실상 모든 처리 변수(파라미터)에 대한 제어를 제공하기 위해 복잡성이 극적으 로 증가하였다. 그러한 진보된 CMP 시스템들은, 하나 이상의 처리 파라미터를 원하는 설정점으로 제어하도록 각각 구성되는 고도로 엔지니어링된 복잡한 개별 하위시스템들을 포함한다. 제어가능한 처리 파라미터들은 집 합적으로 기판 연마 레시피를 정의한다. 종종, 단일 기판 CMP 프로세스에 대한 연마 레시피는 다중 스테이지 연마 시퀀스를 포함하고, 여기서 시퀀스의 각각의 스테이지에 대해 하나 이상의 파라미터 설정점이 변경된다. 불행하게도, CMP 기술의 진보는 연마 계면에서의 표면들, 유체들, 및 연마재들 사이의 화학적 및 기계적 활동의 복잡한 상호작용들에 대한 과학적 이해를 훨씬 능가했다. 결과적으로, 기존의 CMP 모델들은 일반적으로, 프로 세스 개발에 사용하기에 부적합하다. 따라서, CMP 기판 프로세스들은 전형적으로, 종래의 프로세스 개발 및 개 선 기법들을 사용하여 결정되고/거나 개선된다. 그러한 기법들의 예들은 실험 설계(DOE) 및 시행착오를 포함한 다. 전형적으로, 표준 품질 제어 수단은 사용 또는 판매를 위해 의도된 디바이스들을 갖는 생산 기판들에 대한 실험을 금지한다. 결과적으로, DOE 실험들은 종종, 귀중한 CMP 처리 시스템 시간을 차지하면서 고가의 시험 기 판들을 사용하여 수행된다. 따라서, 그와 연관된 시간 및 비용으로 인해, 생산 설비에서 사용되는 많은 개별 연마 프로세스들에 대한 연마 파라미터들, 알고리즘들, 소모품들, 디바이스 피쳐들, 및 처리 결과들 사이의 복 잡한 관계들을 철저히 조사하는 것은 사실상 불가능하다. 따라서, 종래의 프로세스 개선 방법들은, 진보된 CMP 처리 시스템들의 장치 및 하위시스템들의 조합된 능력들의 이점을 취하기에 부적절하고, 그렇지 않으면 그를 통해 실현될 수 있는 더 넓은 프로세스 윈도우들 및 개선된 처리 결과들을 제공할 수 없다."}
{"patent_id": "10-2023-7003427", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "이에 따라, 관련 기술분야에서는 위에서 설명된 단점들을 겪지 않는 진보된 처리 방법들이 필요하다. 본 개시내용의 실시예들은 일반적으로, 전자 디바이스 제조에 사용되는 화학적 기계적 연마(CMP) 시스템들에 관 한 것이고, 더 구체적으로, 그와 함께 사용하기 위한 진보된 기판 처리 방법들에 관한 것이다. 일 실시예에서, 기판 연마 레시피를 생성하는 컴퓨터 구현 방법이 제공된다. 방법은, 연마 시스템을 사용하여 기판을 연마하는 단계를 포함하고, 연마 단계는 (a) 연마 레시피에 따라, 연마 패드의 표면 상으로 연마 유체를 유동시키는 단계 - 연마 레시피는 복수의 연마 파라미터들 및 대응하는 복수의 목표 값들을 포함함 -; (b) 연마 레시피에 따라 연마 패드의 표면에 대하여 기판을 압박하는 단계; (c) 제1 제어 파라미터를 조정함으로써, 복수 의 연마 파라미터들 중 제1 연마 파라미터를 그의 목표 값에 또는 그 근처에 유지하는 단계; (d) 연마 레시피 및 제1 제어 파라미터의 시계열 데이터를 포함하는 처리 시스템 데이터를 생성하는 단계; 및 (e) (a)-(d) 단계 와 동시에, 인-시튜 기판 모니터링 시스템으로부터 획득된 측정치들을 사용하여 시계열 인-시튜 결과 데이터를 생성하는 단계를 포함한다. 방법은, 대응하는 복수의 훈련 데이터 세트들을 획득하기 위해 복수의 기판들에 대해 (a)-(e) 단계를 반복하는 단계 - 훈련 데이터 세트들 각각은 연마된 기판에 대한 인-시튜 결과 데이터 및 처 리 시스템 데이터를 포함함 -; 인공 지능(AI) 훈련 플랫폼에서, 복수의 훈련 데이터 세트들을 포함하는 훈련 데 이터를 수신하는 단계; 훈련 데이터를 사용하여 기계 학습 AI 알고리즘을 훈련하는 단계; 및 훈련된 기계 학습 AI 알고리즘을 사용하여 복수의 연마 파라미터들 중 하나 이상을 변경하는 단계를 더 포함한다. 일 실시예에서, 컴퓨터 판독가능 매체는 연마 레시피를 결정하기 위한 방법을 실행하기 위한 명령어들을 포함한 다. 방법은, 인공 지능(AI) 훈련 플랫폼에서, 복수의 훈련 데이터 세트들을 포함하는 훈련 데이터를 수신하는 단계를 포함하고, 훈련 데이터 세트들 각각은 연마 시스템 상에서 연마된 기판에 상관된 인-시튜 결과 데이터 및 처리 시스템 데이터를 포함한다. 훈련 데이터 세트들 각각에 대한 처리 시스템 데이터는: 복수의 연마 파라 미터들 및 대응하는 복수의 목표 값들을 포함하는 연마 레시피; 및 복수의 연마 파라미터 중 제1 연마 파라미터 를 목표 값에 또는 그 근처에 유지하기 위해 폐루프 제어 시스템에 의해 사용되는 제1 제어 파라미터의 시계열 데이터를 포함하고, 훈련 데이터 세트들 각각에 대한 인-시튜 결과 데이터는 인-시튜 기판 모니터링 시스템을 사용하여 생성된 시계열 데이터를 포함한다. 방법은 훈련 데이터를 사용하여 기계 학습 AI 알고리즘을 훈련하 는 단계; 및 훈련된 기계 학습 AI 알고리즘을 사용하여, 제1 제어 파라미터에 대한 시계열 데이터와 인-시튜 결 과 데이터 사이의 함수 관계를 결정하는 단계를 더 포함한다. 일 실시예에서, 연마 시스템들 간의 연마 성능을 매칭하는 컴퓨터 구현 방법이 제공된다. 컴퓨터 구현 방법은, 인공 지능(AI) 훈련 플랫폼에서, 복수의 훈련 데이터 세트들을 포함하는 훈련 데이터를 수신하는 단계를 포함한 다. 훈련 데이터 세트들 각각은 제1 연마 시스템을 사용하여 연마된 제1 복수의 기판들 중 개별 기판들에 상관 된 처리 시스템 데이터를 포함하고, 제1 복수의 기판들 중 상이한 기판들은 제1 연마 시스템의 복수의 연마 스 테이션들로부터의 연마 스테이션들과 복수의 기판 캐리어 조립체들로부터의 기판 캐리어 조립체들의 상이한 조 합들을 사용하여 연마된다. 훈련 데이터 세트들 각각에 대한 처리 시스템 데이터는: 복수의 연마 파라미터들 및 대응하는 복수의 목표 값들을 포함하는 연마 레시피 - 복수의 연마 파라미터들 중 하나 이상은 대응하는 폐 루프 제어 시스템을 사용하여 그들의 목표 값에 또는 그 근처에 유지됨 -; 및 폐루프 제어 시스템들의 제어 파 라미터들의 시계열 데이터를 포함한다. 방법은 훈련 데이터를 사용하여 기계 학습 AI 알고리즘을 훈련하는 단 계를 더 포함한다. 훈련된 기계 학습 AI 알고리즘은 제1 연마 시스템의 상이한 연마 스테이션들 및/또는 상이 한 기판 캐리어 조립체들 사이의 차이들을 식별하도록 구성된다. 방법은 식별된 차이들에 기초하여 하나 이상 의 보정 작용을 구현하는 단계를 더 포함한다. 본 개시내용의 실시예들은 또한, 작동 시에 시스템으로 하여금 작용들을 수행하게 하거나 수행하게 하는 소프트 웨어, 펌웨어, 하드웨어, 또는 이들의 조합이 시스템 상에 설치되게 함으로써 특정 작동들 또는 작용들을 수행 하도록 구성될 수 있는 하나 이상의 컴퓨터의 시스템을 제공할 것이다. 하나 이상의 컴퓨터 프로그램은, 프로 세서에 의해 실행될 때, 장치로 하여금 작용들을 수행하게 하는 명령어들을 포함함으로써 특정 작동들 또는 작 용들을 수행하도록 구성될 수 있다. 하나의 일반적인 양상은 하나 이상의 연마 시스템 내에서 기판을 연마하기 위한 컴퓨터 구현 방법을 포함한다. 컴퓨터 구현 방법은: (a) 연마 레시피에 따라, 연마 유체를 연마 패드의 표면 상으로 유동시키는 단계 - 연마 레시피는 복수의 연마 파라미터들 및 대응하는 복수의 목표 값들을 포함할 수 있음 -; (b) 연마 레시피에 따라 연마 패드의 표면에 대하여 기판을 압박하는 단계; (c) 제1 제어 파라미터 를 조정함으로써, 복수의 연마 파라미터들 중 제1 연마 파라미터를 그 목표 값에 또는 그 근처에 유지하는 단계; (d) 연마 레시피 및 제1 제어 파라미터의 시계열 데이터를 포함할 수 있는 처리 시스템 데이터를 생성하 는 단계; 및 (e) (a)-(d) 단계와 동시에, 인-시튜 기판 모니터링 시스템으로부터 획득된 측정치들을 사용하여 시계열 인-시튜 결과 데이터를 생성하는 단계; 대응하는 복수의 훈련 데이터 세트들을 획득하기 위해 복수의 기 판들에 대해 (a)-(e) 단계를 반복하는 단계 - 훈련 데이터 세트들 각각은 연마된 기판에 대한 인-시튜 결과 데 이터 및 처리 시스템 데이터를 포함할 수 있음 -; 인공 지능(AI) 훈련 플랫폼에서, 복수의 훈련 데이터 세트들 을 포함할 수 있는 훈련 데이터를 수신하는 단계 - 복수의 훈련 데이터 세트들 각각은 시간상 순차적으로 수신 됨 -; 및 훈련된 기계 학습 AI 알고리즘에 의해 수행되는 분석에 기초하여 복수의 연마 파라미터들 중 하나 이 상을 변경하는 단계를 포함할 수 있다. 이러한 양상의 다른 실시예들은 대응하는 컴퓨터 시스템들, 장치, 및 하나 이상의 컴퓨터 저장 디바이스 상에 기록된 컴퓨터 프로그램들을 포함하고, 각각은 방법들의 작용들을 수행 하도록 구성된다. 본 개시내용의 실시예들은 또한, 하나 이상의 연마 시스템 내에서 기판을 연마하기 위한 컴퓨터 구현 방법을 제 공할 것이다. 컴퓨터 구현 방법은: (a) 연마 레시피에 따라, 연마 유체를 연마 패드의 표면 상으로 유동시키는 단계 - 연마 레시피는 복수의 연마 파라미터들 및 대응하는 복수의 목표 값들을 포함할 수 있음 -; (b) 연마 레 시피에 따라 연마 패드의 표면에 대하여 기판을 압박하는 단계; (c) 제1 제어 파라미터를 조정함으로써, 복수의연마 파라미터들 중 제1 연마 파라미터를 그 목표 값에 또는 그 근처에 유지하는 단계; (d) 연마 레시피 및 제1 제어 파라미터의 시계열 데이터를 포함할 수 있는 처리 시스템 데이터를 생성하는 단계; 및 (e) (a)-(d) 단계와 동시에, 인-시튜 기판 모니터링 시스템으로부터 획득된 측정치들을 사용하여 시계열 인-시튜 결과 데이터를 생 성하는 단계; 대응하는 복수의 훈련 데이터 세트들을 획득하기 위해 복수의 기판들에 대해 (a)-(e) 단계를 반복 하는 단계 - 훈련 데이터 세트들 각각은 연마된 기판에 대한 인-시튜 결과 데이터 및 처리 시스템 데이터를 포 함할 수 있음 -; 인공 지능(AI) 훈련 플랫폼에서, 복수의 훈련 데이터 세트들을 포함할 수 있는 훈련 데이터를 수신하는 단계 - 복수의 훈련 데이터 세트들 중 적어도 일부는 시간상 순차적으로 수신됨 -; 및 기계 학습 AI 알고리즘에 의해 수행되는 분석에 기초하여 복수의 연마 파라미터들 중 하나 이상을 변경하는 단계를 포함할 수 있다. 본 개시내용의 실시예들은 또한, 연마 시스템들 간의 연마 성능을 매칭하는 컴퓨터 구현 방법을 제공할 것이고, 방법은, 인공 지능(AI) 훈련 플랫폼에서, 복수의 훈련 데이터 세트들을 포함하는 훈련 데이터를 수신하는 단계 - 훈련 데이터 세트들 각각은 제1 연마 시스템을 사용하여 연마된 제1 복수의 기판들 중 개별 기판들에 상관된 처리 시스템 데이터를 포함하고, 제1 복수의 기판들 중 상이한 기판들은 제1 연마 시스템의 복수의 연마 스테이 션들로부터의 연마 스테이션들과 복수의 기판 캐리어 조립체들로부터의 기판 캐리어 조립체들의 상이한 조합들 을 사용하여 연마되고, 훈련 데이터 세트들 각각에 대한 처리 시스템 데이터는: 복수의 연마 파라미터들 및 대 응하는 복수의 목표 값들을 포함하는 연마 레시피 - 복수의 연마 파라미터들 중 하나 이상은 대응하는 폐루프 제어 시스템을 사용하여 그들의 목표 값에서 또는 그 근처에서 유지됨 -; 및 폐루프 제어 시스템들의 제어 파라 미터들의 시계열 데이터를 포함함 -; 및 훈련 데이터를 사용하여 기계 학습 AI 알고리즘을 훈련하는 단계 - 훈 련된 기계 학습 AI 알고리즘은 제1 연마 시스템의 상이한 연마 스테이션들 또는 상이한 기판 캐리어 조립체들 사이의 차이들을 식별하도록 구성됨 -; 및 식별된 차이들에 기초하여 하나 이상의 정정 작용을 구현하는 단계를 포함한다."}
{"patent_id": "10-2023-7003427", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시내용의 실시예들은 일반적으로, 전자 디바이스 제조에 사용되는 화학적 기계적 연마(CMP) 시스템들에 관 한 것이고, 더 구체적으로, 그와 함께 사용하기 위한 진보된 기판 처리 방법들에 관한 것이다. 일반적으로, 본원의 진보된 기판 처리 방법들은 연마 프로세스의 하나 이상의 양상을 제어하기 위해 알고리즘, 예컨대, 기계 학습 인공 지능(AI) 알고리즘, 또는 AI 알고리즘을 사용하여 생성된 소프트웨어 애플리케이션을 사용한다. 일반적으로, AI 시스템들은 그들이 분석하는 데이터 내의 패턴들 및 특징들로부터 학습하기 위해 지 능적이고 반복적인 처리 알고리즘들을 이용하여 데이터의 큰 세트들을 활용한다. AI 시스템이 한 차례의 데이 터 처리를 수행함으로써 데이터를 분석할 때마다, AI 시스템은 일반적으로 그 자신의 성능을 시험하고 측정할 것이며, 수행된 분석에 기초하여 추가적인 전문지식을 개발한다. 본원에서, AI 알고리즘은, 연마 시스템으로부 터 취득된 기판 처리 데이터를 사용하여, 연마 프로세스를 시뮬레이션하고, 연마 프로세스 및 그로부터 예측되 는 프로세스 결과들에 관하여 예측하도록 훈련된다. 일부 실시예들에서, AI 알고리즘, 또는 AI 알고리즘을 사용하여 생성된 소프트웨어 애플리케이션은, 원하는 연 마 종료점의 시간대를 예측하고, 그 때의 연마 유체의 조성을, 예를 들어, 하나 이상의 연마 유체 성분의 유량 을 시작하거나, 정지시키거나, 변경함으로써 조정하는 데 사용된다. 본원에서 사용되는 바와 같이, \"연마 종료 점\"은 하나 이상의 기판 연마 파라미터, 예컨대, 슬러리 조성을 변경하는 것이 바람직할 수 있는, 연마 프로세 스에서의 시점을 나타내며, 반드시 연마 프로세스의 종료를 나타내는 것은 아니다. 다마신 응용들의 경우, 원 하는 연마 종료점을 정확하게 예측하고, 예측에 기초하여 연마 유체 조성(예를 들어, 슬러리 조성)을 선제적으 로 조정하는 능력은, 종래의 반응성 종료점 검출 방식들과 비교할 때 개선된 국부적 평탄화 성능을 용이하게 한 다. 국부적 평탄화 성능에 대한 개선들은, 결과적인 디바이스들의 성능, 신뢰성 및 수율에서의 바람직한 개선 들을 초래한다. 본원에서 제공되는 방법들을 사용하여 개선될 수 있는 열악한 국부적 평탄화의 예가 도 1a에 예시된다. 아래에 더 논의되는 바와 같이, 연마 유체 조성물(예를 들어, 슬러리 조성물)은 일반적으로, 물과 같은 액체에 현탁되는 하나 이상의 유형의 고체 입자들의 혼합물을 포함할 것이다. 고체 입자들은 종종, 연마재로 지칭되고, 액체에 현탁되는 금속 산화물 미세 분말들, 예컨대, CeO2, Fe2O3, Al2O3 및 SiO2를 포함할 수 있다. 액체는, 종종 물 내에 배치되는, 산, 염기 및 다양한 첨가제들(예를 들어, 부식 억제제들, pH 조정제들) 중 하 나 이상을 포함할 수 있다. 도 1a는 필드, 즉, 기판의 상부 또는 외측 표면으로부터 금속 충전 물질의 오버버든을 제거하기 위한 연마 프로세스에 후속하는, 열악한 국부적 평탄화, 예를 들어, 거리(e)까지의 침식 및 거리(d)까지의 디싱(dishing) 을 예시하는 개략적인 단면도이다. 여기서, 기판은 유전체 층, 유전체 층에 형성된 제1 금속 인터커 넥트 피쳐(3a), 및 유전체 층에 형성된 복수의 제2 금속 인터커넥트 피쳐들(3b)을 특징으로 한다. 복수의 제2 금속 인터커넥트 피쳐들(3b)은 비교적 높은 피쳐 밀도의 영역을 형성하도록 밀접하게 배열된다. 전형적 으로, 금속 인터커넥트 피쳐들(3a, b)은 유전체 층 상에 그리고 그 안에 형성된 대응하는 개구부들 내에 금 속 충전 물질을 퇴적시킴으로써 형성된다. 그 다음, 기판의 물질 표면은 유전체 층의 필드 표면으로 부터 충전 물질의 오버버든을 제거하기 위해 CMP 프로세스를 사용하여 평탄화된다. 도시된 바와 같이, 열악한 국부적 평탄화 성능은 유전체 층의 주변 표면들로부터 금속 인터커넥트 피쳐(3a) 의 상부 표면의 거리(d)만큼의 함몰을 초래하였는데, 이는 달리, 디싱으로 알려져 있다. 열악한 국부적 평탄화 성능은 또한, 높은 피쳐 밀도 영역에서의 유전체 층의, 예를 들어, 거리(e)만큼의 바람직하지 않은 함몰 을 초래하였고, 여기서, 영역에서의 유전체 층의 상부 표면들은 필드 표면의 평면으로부터 함몰되고, 이는 달리, 침식으로 알려져 있다. 디싱 및/또는 침식으로부터 초래되는 금속 손실은 그로부터 형성된 금속 인 터커넥트 피쳐들(3a, b)의 유효 저항의 바람직하지 않은 변동을 야기할 수 있고 따라서 디바이스 성능 및 신뢰 성에 영향을 미친다. 일부 실시예들에서, AI 알고리즘은 생산 능력에서, 즉, 반도체 디바이스 제조 설비에서 작동하는 하나 이상의 연마 시스템으로부터의 데이터를 사용하여 훈련된다. 생산 연마 시스템들을 사용하여 AI 알고리즘을 훈련하는 것은, 특정 연마 응용의 많은 변수들 사이의 복잡한 관계들을 더 잘 이해하기 위해 AI 알고리즘에 의해 사용될 수 있는 풍부한 데이터를 유리하게 제공한다. 예시적인 제조 설비(Fab)가 도 1b에 개략적으로 예시된다. 여기서, Fab은 복수의 연마 시스템들, 하나 이상의 기계 학습 인공 지능(AI) 알고리즘(이하, \"AI\") 훈 련 플랫폼, Fab 생산 제어 시스템, 하나 이상의 독립형 기판 검사 및/또는 계측 스테이션, 및 다른처리 시스템들을 포함한다. 다른 처리 시스템들은 기판 프로세스 흐름에서 연마 프로세스의 상류 및 하류 양쪽 모두에서 발견되는 반도체 디바이스의 제조에 사용되는 기판 처리 시스템들, 예컨대, 에피택시 시스 템들, 열 처리 시스템들, 비-에피택시 증착 시스템들, 리소그래피 시스템들, 식각 시스템들, 주입 시스템들, 및 다른 연마 시스템들을 포함한다. 일부 실시예들에서, Fab은 Fab 생산 제어 시스템과 통신하는 하나 이 상의 전기 시험 시스템, 예컨대, 파라메트릭 시험 및/또는 디바이스 수율 시험 시스템을 더 포함한다. 전형적으로, 연마 시스템들 각각은 복수의 연마 스테이션들, 복수의 기판 캐리어 조립체들, 기판들 을 캐리어 조립체들로 그리고 캐리어 조립체들로부터 이송하기 위한 캐리어 로딩 스테이션, 및 기판 캐 리어 조립체들을 캐리어 로딩 스테이션과 상이한 연마 스테이션들 사이에서 이동시키기 위한 캐리 어 수송 시스템을 포함한다. 여기서, 연마 시스템들 각각은, 거기에서 연마된 기판들의 연마 전 및/또 는 후 (인-라인) 검사들, 측정들, 및 세정을 각각 수행하기 위해 연마 시스템들과 통합되는, 하나 이상의 기판 검사 시스템, 하나 이상의 계측 시스템, 및 세정 시스템을 더 포함한다. 연마 시스템들 각각은 다양한 구성요소들 및 그의 하위시스템들의 작동을 지시하고 조정하는 시스템 제어기를 포함한다. 도시된 바와 같이, AI 훈련 플랫폼들 각각은 통신 링크, 예컨대, 이더넷 또는 USB 연결을 사용하여, 대 응하는 시스템 제어기에 통신가능하게 결합된다. 다른 실시예들에서, AI 훈련 플랫폼들 중 하나 이상 은 시스템 제어기의 부분을 형성하기 위해 시스템 제어기와 통합될 수 있다. 일부 실시예들에서, AI 훈련 플랫폼들은 연마 시스템의 하나 이상의 구성요소 또는 하위시스템과 직접 통신한다. 일부 실시예들에 서, 개별 AI 훈련 플랫폼은 본원에 제시된 방법들을 수행하기 위해 하나 초과의 연마 시스템과 함께 사 용될 수 있고/거나, 개별 AI 훈련 플랫폼들은 그들 사이에서 훈련 데이터(도 1c)를 공유하기 위해 서 로 통신가능하게 결합된다. 훈련 데이터는 다수의 상이한 시간들에서 개별 AI 훈련 플랫폼들 사이에 공유될 수 있다. 일 예에서, 훈련 데이터는 시간상 순차적으로 공유될 수 있고, 이는 규칙적인 시간 간격 들로, 또는 하나 이상의 순차적으로 수행되는 프로세스가 연마 시스템 내에서 실행되고/거나 하나 이상의 비동기 프로세스가 다수의 연마 시스템들에서 실행되는 동안 또는 그 이후에 공유되는 것을 포함할 수 있다. 다른 실시예들에서, AI 훈련 플랫폼들 중 하나 이상은 Fab에 물리적으로 배치되지 않고, 본원에 설명된 방법들은 클라우드 컴퓨팅 기법들을 사용하여 구현된다. Fab 생산 제어 시스템은 기판들이 생산 라인을 통해 이동할 때 기판들의 흐름 및 처리를 지시하고, 기판들 및 처리 시스템들 양쪽 모두에 관련된 데이터를 수집하고 관리한다. 전형적으로, 시스템 제어기들은 시스 템 제어기들에 명령어들을 제공하고 그로부터 정보를 수신하는 Fab 생산 제어 시스템과 통신한다. 여 기서, Fab 생산 제어 시스템은 하나 이상의 독립형 기판 검사 및/또는 계측 스테이션, 다른 처리 시스 템들, 및 하나 이상의 전기 시험 시스템과 더 통신한다. 일부 실시예들에서, Fab 생산 제어 시스템 은 독립형 기판 검사 및/또는 계측 스테이션들, 다른 처리 시스템들, 및 하나 이상의 전기 시험 시 스템으로부터 수신된 정보를 AI 훈련 플랫폼들에 의해 훈련 데이터(도 1c)로서 사용되도록 시스템 제어기들에 전달한다. 일부 실시예들에서, Fab 생산 제어 시스템은 대응하는 통신 링크들을 통해 AI 훈련 플랫폼들과 직접 통신한다. 통신 링크들은 종래의 유선 또는 무선 유형의 통신 링크들을 포함 할 수 있다. 도 1c는 본원에 제시된 방법들과 함께 사용될 수 있는 프로세스 개선 방식의 개략도이다. 프로세스 개선 방식은 기계 학습 AI 알고리즘, 본원에서 AI 알고리즘을 실행하기 위해 지원 회로들과 함께 작동 가능한 프로세서 및 메모리 블록(PMB)을 포함하는 AI 훈련 플랫폼을 사용한다. PMB의 프로세서 (별도로 도시되지 않음)는, 프로그램 가능 중앙 처리 유닛(CPU), 그래픽 처리 유닛(GPU), 필드 프로그램 가능 게이트 어레이(FPGA), 기계 학습 주문형 집적 회로(ASIC), 또는 다른 적합한 하드웨어 구현(들) 중 하나 이상과 같은, AI 알고리즘을 실행하기에 적합한 컴퓨터 프로세서들 중 하나 또는 이들의 조합이다. PMB의 메모리(별도로 도시되지 않음)는 프로세서에 작동가능하게 결합되고, 비일시적이며, AI 알고리즘, 그와 함 께 사용될 훈련 데이터, 및 AI 알고리즘을 사용하여 생성되는 하나 이상의 기계 학습 AI 모델을 저장하기에 적합한 크기의 임의의 비휘발성 유형의 메모리를 나타낸다. 지원 회로들은 통상적으로 처리 유 닛에 결합되고, 캐시, 클럭 회로들, 입력/출력 하위시스템들, 전력 공급부들 등, 및 이들의 조합들을 포함한다. 여기서, AI 알고리즘은 지도 및 비지도 학습 모델들(supervised and unsupervised learning models) 중 하나 또는 이들의 조합을 사용하여, PMB의 메모리에 저장된 훈련 데이터를 이용하여 훈련된다. 지도 학습 모델의 일 예에서, AI 알고리즘은 사용자에 의해 제공되는 예시적인 입력-출력 쌍에 기초하여, 입력 데이터, 예컨대, 개별 제어 파라미터의 시계열 데이터를 출력 데이터, 예컨대, 개별 처리 결과에 맵핑하도록 훈 련될 수 있다. 예시적인 비지도 학습 모델에서, AI 알고리즘은 최소의 사용자 입력으로 시간에 걸쳐 수신되는 훈련 데이터에서의 패턴들 및 관계들을 찾도록 훈련될 수 있다. 훈련 프로세스는 연장된 기간에 걸 쳐 다양한 인-시튜 또는 엑스-시튜 센서들로부터 수신된 다수의 데이터 세트들에 기초하여 발생할 수 있다. AI 알고리즘이 지도 모델을 포함하는 실시예들에서, 서포트 벡터 머신(SVM), 회귀 모델, 또는 훈련 데이터 를 수신하고 처리 결과를 나타내거나 예측하는 연속 출력을 제공할 수 있는 임의의 지도 학습 모델이 사용 될 수 있다. AI 알고리즘이 비지도 모델을 포함하는 실시예들에서, 신경망, 또는 하나 이상의 처리 결과 를 표시하고/거나 예측하는 클러스터링되고 분류된 출력을 제공하기 위해 AI 알고리즘을 훈련하기 위해 훈 련 데이터를 수신할 수 있는 임의의 비지도 학습 모델이 사용될 수 있다. 일부 실시예들에서, 예컨대, 훈 련 데이터가 연마 시스템의 상이한 구성요소들 및/또는 연마 시스템에서 처리된 기판들의 이미지들을 포함 하는 실시예들에서, AI 알고리즘은 콘볼루션 신경망을 사용할 수 있다. 본원에서, 훈련 데이터는 연마 시스템 또는 그의 하위시스템들에 의해 생성된 처리 시스템 데이터 , 및 연마 시스템 상에서 처리된 하나 이상의 기판에 대한 대응하는 처리 결과 데이터를 포함한 다. 여기서, AI 알고리즘을 훈련하는 데 사용되는 처리 시스템 데이터는: 연마 레시피 파라미터 데 이터, 예를 들어, 개별 연마 파라미터들 및 그에 대응하는 목표 값들; 도 2a-2c에서 설명된 것과 같은 하 나 이상의 파라미터 제어 시스템(201a-n)에 의해 제공되는 제어 파라미터 데이터; 및, 예를 들어, 연마 시 스템에 배치된 추가적인 센서들 또는 측정 디바이스들에 의해 생성되는, 하위시스템 및/또는 그의 소모품들 의 작동 및 처리 성능에 관련된 프로세스 모니터링 데이터를 포함한다. 연마 시스템 또는 그의 하위 시스템들에 의해 생성된 처리 시스템 데이터는 연마 레시피에서 제공되는 것들과 같은 이산 값들에 의해 표현될 수 있거나, 시계열 데이터, 예를 들어, 시간 순서로 배열된 일련의 데이터 포인트들(또는 이미지들)을 포함할 수 있다. 일부 실시예들에서, AI 훈련 플랫폼은 연마 시스템의 하나 이상의 구성요소에 통신가능하게 결합되고, 처리 시스템 데이터의 적어도 부분들이 그로부터 수신된다. 일부 실시예들에서, 처리 시스템 데이터(11 4)의 적어도 부분들은 연마 시스템 제어기의 메모리에 저장되고, AI 훈련 플랫폼은 그로부터 처리 시스 템 데이터를 수신한다. 처리 결과 데이터는, 기판의 측정들 또는 검사를 통해 획득되는, 연마 프로세스 동안의 기판으로부터의 물 질 층의 평탄화 및/또는 제거에 관련된 정보 - 기판의 측정들 또는 검사로부터 도출되는 정보를 포함함 - 를 포 함한다. 일부 실시예들에서, 처리 결과 데이터는, 예를 들어, 카메라 디바이스의 사용에 의해 기판의 표 면에서 취해진 이미지들을 포함한다. 여기서, 처리 결과 데이터는, 예를 들어, 아래에서 도 2a에서 설명되는 것과 같은 와전류 센서 또는 광학 센서의 사용에 의해, 연마 프로세스와 동시에 획득된 기판 측정치들(인-시튜 결과 데이터), 및 연마 프로 세스에 후속하여 취해진 기판 측정치들(엑스-시튜 결과 데이터)을 포함한다. 일부 실시예들에서, 인-시튜 결과 데이터는 시계열 데이터를 포함한다. 일부 실시예들에서, 처리 결과 데이터는 연마 프로세스 이전에 획득된 측정치들과 그 이후에 획득된 측정치들 사이의 차이들, 예컨대, 물질 제거 속도 또는 물질 제거 균일성을 포함한다. 여기서, 인-시튜 결과 데이터는 도 2a에 설명된 인-시튜 기판 모니터링 시스템을 사용하여 획득된 시 계열 와전류 정보 및/또는 시계열 광 신호 정보를 포함한다. 인-시튜 결과 데이터는 전형적으로, 신호 정 보를 포함하고, 신호 정보로부터 도출된 정보, 예컨대, 물질 층 두께 및 물질 층 균일성 정보를 포함할 수 있다. 엑스-시튜 결과 데이터는 반도체 디바이스 제조 설비에서 전형적으로 발견되는 임의의 적합한 계측 또는 검사 시스템들을 사용하여 생성될 수 있다. 일부 실시예들에서, 엑스-시튜 결과 데이터의 적어도 부분들 은 연마 시스템의 하나 이상의 인-라인 검사 시스템 및/또는 계측 시스템을 사용하여 생성되고, 엑 스-시튜 결과 데이터의 부분들은 그로부터 AI 훈련 플랫폼에서 수신된다. 일부 실시예들에서, 엑스- 시튜 결과 데이터의 적어도 부분들은 인-라인 시스템들(25, 26)에 통신가능하게 결합되는 연마 시스템 제 어기의 메모리에 저장되고, AI 훈련 플랫폼은 처리 시스템 제어기로부터 엑스-시튜 결과 데이터 의 부분들을 수신한다. 일부 실시예들에서, 엑스-시튜 결과 데이터의 적어도 부분은 연마 시스템으로부터 분리된 하나 이상의 독립형 검사 및/또는 계측 스테이션을 사용하여 생성된다. 전형적으로, 그러한 실시예들에서, 엑스-시튜 결과 데이터는 독립형 검사 및/또는 계측 스테이션들 각각에 통신가능하게 결합된 Fab 생산 제어 시스템으로부터 수신되고/거나 수집된다. 엑스-시튜 결과 데이터의 부분을 형성할 수 있는 정보의 예들은: 물질 제거 속도(MRR); 물질 층 평탄화(전 역적 평탄도); 기판들 사이의 균일성, 즉, 웨이퍼간 불균일성(WTWNU); 기판의 표면에 걸친 물질 제거 속도의 균 일성 및/또는 평탄화된 물질 층의 두께의 균일성, 집합적으로 웨이퍼내 불균일성(WIWNU) 메트릭들; 평탄화 효율; 국부적 평탄도, 예를 들어, 다이내(WID) 평탄도; 아래놓인 물질 층의 원치 않는 제거, 예를 들어, 산화물 손실; 높은 피쳐 밀도의 영역들에서의 아래놓인 물질 층의 침식; 트렌치, 콘택, 비아 및/또는 라인 피쳐들에서 의 물질의 함몰(디싱); 및 기판 표면 및/또는 기판 표면에 형성된 노출된 피쳐들에서의 또는 내에서의 연마로 유도된 결함들을 포함한다. CMP로 유도된 결함들은 기계적 관련 결함들, 예컨대, 스크래치들, 및 화학적 관련 결함들, 예컨대, 금속 피쳐의 부식을 포함한다. 일부 실시예들에서, 엑스-시튜 결과 데이터는 인-라인 및/또는 독립형 계측 및/또는 검사 시스템들로부터 획득된 이미지들, 예컨대, 카메라 디바이스 또는 다른 광학 센서로 취득된 기판의 이미지들을 포함한다. 일부 실시예들에서, 엑스-시튜 결과 데이터는 기판으로부터 획득된 정보, 예를 들어, 기판 및/또는 기판 표면의 물질 층 두께, 평탄도, 결함성, 및/또는 응력 맵들을 표현하는, 계측 또는 검사 시스템들에 의해 생성된 이미지들을 포함한다. 일부 실시예들에서, 훈련 데이터는 기판 추적 데이터, 설비 시스템 데이터 및 전기 시험 데이터 중 하나 이상을 포함한다. 여기서, 기판 추적 데이터는 기판에 대한 식별 정보, 기판 상에 형성된 디바이스들에 관련된 정보, 및 기판의 처리 이력을 포함한다. 디바이스 정보의 예들은 디바이스 크기, 디바이 스 기하형상들, 피쳐 크기, 및 패턴 밀도를 포함한다. 처리 이력은 전형적으로, 상류 처리 시스템들의 식별 및 대응하는 처리 정보, 예컨대, 그와 함께 사용되는 요일/시간 정보 및 처리 레시피들을 포함한다. 처리 이력은 또한, 상류 계측 및/또는 검사 시스템들로부터 획득된 정보를 포함할 수 있다. 설비 시스템 데이터는 연마 시스템에 결합된 설비 공급 시스템들 및/또는 연마 시스템을 둘러싸는 환경 조건들, 예를 들어, 온도, 입자 개수 및 공기 유동에 관련된 정보를 포함한다. 설비 공급 시스템들에 관 련된 정보의 예들은 탈이온(DI)수 공급 시스템들, 청정 건조 공기(CDA) 공급 시스템들, 화학물질 전달 시스템들, 및 원격 연마 유체 분배 시스템들로부터 획득된 정보를 포함한다. 전형적으로, 원격 연마 분배 시스 템들은 사용 지점에서 설비 라인들에 유체 결합된 복수의 연마 시스템들로의 전달을 위해 설비 라인들을 통 해 연마 유체들을 순환시킨다. 그러한 연마 유체 분배 시스템들은 종종, 연마 유체들의 벌크 혼합을 위해 구성 되고, 혼합 프로세스를 용이하게 하고/거나 연마 유체 건전 상태의 연속 모니터링을 위해 하나 이상의 분석기를 포함할 수 있다. 연마 유체 건전 상태의 모니터링은, 연마 유체들의 화학적 특성들(예를 들어, pH 및 산화제 및 첨가제 수준들 및 그들의 붕괴 거동)뿐만 아니라, 큰 입자 개수(LPC), 평균 입자 크기 분포(PSD), 밀도, 고 체들의 중량 백분율 및 점도를 포함하는, 연마 유체의 연마재 특성들을 결정하고 모니터링하기 위해 분석기들을 사용하는 것을 포함한다. 연마 유체 건전 상태를 포함하여, 설비 시스템들에 관련된 정보는 복수의 연마 시스 템들의 개별 시스템 제어기들 및/또는 fab 생산 제어 시스템에 전달될 수 있고, 그로부터 AI 훈련 플랫폼들에 의해 수신될 수 있다. 전기 시험 데이터는, 예를 들어, 디바이스들 사이의 다이들 라인들에 배치된 전용 시험 구조들을 사용하여, 후속 파라메트릭 시험 작동에서 생성된 파라메트릭 시험 정보, 및/또는 하나 이상의 후속 디바이스 시험 작동에서 생성된 디바이스 시험 정보를 포함할 수 있다. 일부 실시예들에서, 전기 시험 데이터는 파 라메트릭 및/또는 디바이스 시험 작동들 동안 획득된 정보를 나타내는 이미지들, 예컨대, 작동가능 및 고장 디 바이스들의 기판 상의 위치를 나타내는 디바이스 수율 맵들을 포함한다. 여기서, 훈련 데이터는 위에서 설명된 데이터 공급원들 각각으로부터 수신된 정보를, 그에 대응하는 훈련 데이터의 세트를 형성하는 특정 기판, 연마 시스템, 연마 스테이션 및 기판 캐리어 조합에 상관시키기 위해 사 용될 수 있는 식별 정보, 예컨대, 기판 추적 정보, 시스템 정보 및 타임스탬프 정보를 포함한다. 일부 실시예들에서, 훈련된 AI 알고리즘은 연마 시스템의 작동을 지시하기 위한 명령어들로서 사용되 도록 시스템 제어기에 전달되는 AI 모델, 예를 들어, 소프트웨어 알고리즘을 생성하는 데 사용된다. 도 1d는 제어 파라미터 데이터를 생성하는 데 사용될 수 있는 제어 시스템의 개략도이다. 제어 파라 미터 데이터는 연마 파라미터를 목표 값에 또는 그 근처에 유지하기 위해 제어 시스템에 의해 사용되는 하나 이상의 제어 파라미터의 시계열 데이터를 포함한다. 본원에서 사용되는 바와 같이, \"목표 값\"은 원하는 설정점, 원하는 하한 임계치 위의 값들, 원하는 상한 임계치 아래의 값들, 및 원하는 하한 임계치와 상한 임계치 사이의 값들을 포함한다. 도 1d에서, 프로세스 제어 시스템은 연마 파라미터를 목표 값에 또는 그 근처에 유지하기 위한 폐쇄 피드백 제어 루프를 제공한다. 도시된 바와 같이, 프로세스 제어 시스템은 센서, 제어기, 및 제어기에 작동가능하게 결합된 파라미터 제어 디바이스, 예컨대, 액추에이터를 포함한다. 여기서, 센서, 제어기, 및 제어 디바이스는 폐루프 피드백 제어 시스템을 제공하기 위해 피드백 루프 내에서 흐르는 정보와 함께 배열된다. 연마 프로세스 동안, 센서는 연마 파라미터(예를 들어, 플래튼 회전 속도, 연마 유체 유량 등)의 실제 값 을 측정하고, 제어기는 실제 값과 목표 값 사이의 오차를 결정한다. 오차를 보정하기 위 해, 제어기는 파라미터 제어 디바이스(예를 들어, 플래튼에 결합된 액추에이터(모터), 슬러리 전달 시스템에 연결된 슬러리 분배 펌프 등)에, 제어 파라미터(예를 들어, 모터 전류, 펌프 압력, 펌프 속도 등)를 변경하도록 지시하고, 이는 연마 파라미터 출력(예를 들어, 플래튼 회전 속도, 슬러리 유량 등)에서의 대 응하는 변경을 야기한다. 일반적으로, 파라미터 제어 시스템은, 일단 연마 파라미터가 목표 값에 도달하도록 상승되고 나면, 제어기에 의한 제어 파라미터에 대한 변경들이 연마 프로세스의 변경에 대한 응답을 나타내도록 반응 성이다. 유사하게, 실질적으로 유사한 연마 프로세스들에 대한 기판간 제어 파라미터의 변경들은 바람직 하지 않은 프로세스 드리프트를 나타낼 수 있다. 따라서, 본원의 실시예들에서, AI 알고리즘이 특정 연마 프로세스에 대한 하위시스템들, 처리 파라미터들, 소모품들, 및 기판들 사이의 복잡한 관계들을 더 잘 이해할 수 있게 하기 위해 처리 시스템 데이터에 시계열 제어 파라미터 데이터가 포함된다. 도 2a는 본원에 제시된 방법들과 함께 사용될 수 있는, 일 실시예에 따른, 연마 스테이션 및 캐리어 조립체 의 개략적인 측단면도이다. 여기서, 연마 스테이션은 파라미터 제어 시스템들(201a-n) 중 하나 또는 이들의 조합과 함께 각각 작동가능한 복수의 하위시스템들을 포함한다. 본원에서, 파라미터 제어 시스템들 (201a-n) 각각은 폐쇄 피드백 제어 루프를 포함하도록 구성되고, 도 1d에 설명된 프로세스 제어 시스템의 요소들 중 임의의 요소 또는 이들의 조합을 포함할 수 있다. 전형적으로, 제어 시스템들(201a-n) 각각은 하나 이상의 대응하는 액추에이터(202a-n), 처리 파라미터 센서 (203a-n), 제어기(204a-n), 및 제어 파라미터 센서(205a-n)를 포함한다. 액추에이터들(202a-n)은 제어기 (204a-n)로부터 수신된 신호, 예컨대, 전기, 공압, 또는 디지털 신호에 응답하여 제어 파라미터를 변경하도록 작동가능한 임의의 디바이스 또는 프로세스 시스템을 포함한다. 공통 액추에이터들(202a-n)의 예들은 전기기계 디바이스들, 전자기 디바이스들, 공압 디바이스들, 유압 디바이스들, 및 이들의 조합들, 예컨대, 모터들, 서보 들, 솔레노이드들, 밸브들, 펌프들, 피스톤들, 및 조절기들을 포함하지만, 이에 제한되지 않는다. 처리 파라미터 센서들(203a-n)은 처리 파라미터의 값을 측정하는 데 사용될 수 있거나 원하는 처리 파라미터의 실제 값이 결정될 수 있는 하나 이상의 측정치를 제공하는 데 사용될 수 있는 임의의 디바이스들 또는 디바이스 들의 조합을 포함한다. 적합한 처리 파라미터 센서들(203a-n)의 예들은 온도 센서들, 예를 들어, IR 센서들, 고온계들 및 열전대들, 압력 센서들, 힘 센서들, 위치 센서들, 가속도 센서들, 회전 속도 센서들, 회전 인코더 들, 전기 신호 검출 센서들, 전기화학 센서들, pH 센서들, 농도 센서들, 광학 센서들, 유도 센서들, 유동 센서 들(질량 및/또는 체적), 및 이들의 조합들을 포함한다. 제어기들(204a-n)은 처리 파라미터의 실제 값과 처리 파라미터의 목표 값 사이의 차이, 즉, 오차를 결정하고, 대응하는 액추에이터(202a-n) 또는 처리 시스템에 그의 출력, 예를 들어, 본원에 설명된 제어 파라미터들을 변 경하도록 지시하도록 작동가능한 디바이스들 또는 시스템들을 포함한다. 적합한 제어기들(204a-n)의 예들은 비 례-적분(PI) 제어기들, 비례-적분-미분(PID) 제어기들, 및/또는 로직 제어기들, 예컨대, 로직 애플리케이션을 포함하는 소프트웨어를 실행하도록 프로그래밍된 프로그램 가능 로직 제어기(PLC)들을 포함한다. 일부 실시예 들에서, 예컨대, 제어 파라미터가 처리 시스템의 출력을 포함할 때, 시스템 제어기 또는 소프트웨어 알고리 즘을 실행하도록 작동가능한 다른 컴퓨팅 디바이스가 제어기(204a-n)로서 사용될 수 있다. 일부 실시예들에서, 제어기들(204a-n)의 조합 또는 개별 제어기의 기능들 중 하나 이상은 시스템 제어기에 의해 수행될 수 있다. 제어 파라미터 센서들(205a-n)은 액추에이터(202a-n) 또는 프로세스 시스템의 출력을 측정하기에 적합한 임의의 센서를 포함하며, 이는 처리 파라미터를 목표 값에 유지하는 데 사용된다. 제어 파라미터 센서들(205a-n)로서 사용될 수 있는 적합한 센서들의 예들은 처리 파라미터 센서들(203a-n)과 관련하여 위에서 설명된 예시적인 센서들 중 임의의 센서 또는 조합을 포함한다. 일부 실시예들에서, 예컨대, 제어 파라미터를 측정하는 것이 실현 가능하지 않은 제어 시스템들의 경우, 제어 파라미터 또는 그의 근사치는 대응하는 액추에이터(202a-n) 또는 처 리 시스템에 제어기(204a-n)에 의해 제공되는 신호 및/또는 명령어들을 사용하여 결정될 수 있다. 다른 실시예들에서, 아래에 설명되는 개별 하위시스템들 중 임의의 하위시스템 또는 조합은 개루프 제어 시스템, 즉, 비피드백 시스템을 사용하여 작동할 수 있다. 본원에서, 복수의 하위시스템들은 플래튼 조립체, 캐리어 조립체, 패드 컨디셔너 조립체 및 패드 냉각 조립체를 포함한다. 연마 스테이션은 유체 전달 시스템 및 인-시튜 기판 모니터링 시스템 을 더 포함한다. 연마 스테이션 및 캐리어 조립체의 작동은 시스템 제어기에 의해 조정된다. 플래튼 조립체는 플래튼 및 회전 속도 제어 시스템(201a)을 포함한다. 제어 시스템(201a)은 플래튼 에 결합되고 플래튼 축(A)을 중심으로 플래튼을 회전시키는 데 사용되는 플래튼 액추에이터(202a), 예를 들어, 모터, 플래튼의 회전 속도 및/또는 회전 배향을 측정하는 데 사용되는 프로세스 파라미터 센서 (203a), 제어기(204a), 및 제어 파라미터 센서(205a)를 포함한다. 여기서, 제어기(204a)는, 센서(203a)와 조합하여, 플래튼 액추에이터(202a)에 제공되는 제어 파라미터, 예컨대, 모터 전류를 조정함으로써 플래튼의 회전 속도를 목표 값에 또는 그 근처에 유지한다. 제어 파라미터 센 서(205a)는 제어 파라미터를 측정하는 데 사용되고, 그로부터 시계열 제어 파라미터 데이터가 생성된다. 일부 실시예들에서, 모터 전류의 제어 파라미터에서의 변경들은 연마 계면에 대해 압박되는 기판(도 2b)의 필드 표면으로부터 물질의 오버버든이 소거됨에 따라 연마 계면에서의 표면들 사이의 마찰에서의 변경들에 의해 야기 된다. 따라서, 일부 실시예들에서, 모터 전류의 변경들은 연마 프로세스의 원하는 연마 종료점을 검출하는 데 사용될 수 있다. 다른 실시예들에서, 모터 전류는 연마 동안의 임의의 순간에서 기판의 표면 및 연마 패 드에 전달되는 슬러리의 양의 변동들을 검출하는 데 사용될 수 있다. 예를 들어, 모터 전류에 의해 감지되는 더 높은 마찰은 슬러리 유동의 강하 또는 슬러리 조성물의 조성의 변경에 의해 야기될 수 있다. 플래튼 조립체는 유체 공급원(202b), 예를 들어, 물 또는 냉매 공급원을 포함하는 플래튼 온도 제어 시스 템(201b), 플래튼의 온도를 측정하기 위한 센서(203b), 및 제어기(204b)를 더 포함한다. 플래튼의 온도는 연마 패드에 전달되는 슬러리의 양의 변동들, 연마 패드 특성들의 변동들(예를 들어, 글레이징의 양), 또는 연 마 동안 임의의 순간에 기판에 인가되는 하향력의 변동들을 검출하는 데 사용될 수 있다. 플래튼은 내부에 형성된 하나 이상의 채널을 갖는 원통형 금속 몸체로 형성된다. 하나 이상의 채널은 유체 공 급원(202b)에 유체 결합된다. 제어기(204b)는, 센서(203b)와 조합하여, 유체 공급원(202b)으로부터 하나 이상 의 채널을 통해 냉각제의 유량을 조정함으로써 플래튼의 온도를 목표 값에 유지하는 데 사용된다. 일부 실시예들에서, 연마 플래튼의 온도를 제어하기 위한 제어 파라미터(들)는 유량계, 예를 들어, 제어 파라미터 센서(205b)에 의해 측정된 냉각제 유량을 포함한다. 일부 연마 프로세스들의 경우, 플래튼을 가 열하는 것이 바람직할 수 있고, 그러한 실시예들에서, 유체 공급원(202b)은 가열된 유체, 예를 들어, 가열된 물 및/또는 수증기를 포함할 수 있고, 목표 값은 더 낮은 임계치 위의 온도들을 포함할 수 있다. 일부 실시예들에 서, 플래튼은 가열기(도시되지 않음), 예컨대, 원통형 금속 몸체에 배치되고/거나 매립된 저항성 가열 요 소를 사용하여 가열된다. 캐리어 조립체는 기판 캐리어, 캐리어 샤프트, 및 제어 시스템들(201c,d)을 포함한다. 기판 캐 리어는 아래에서 도 2b에서 설명된다. 제어 시스템(201c)은 제1 액추에이터(202c), 제어기(204c), 회전 속도 센서(203c), 및 제어 파라미터 센서(205c)를 포함한다. 제1 액추에이터(202c)는 캐리어 샤프트에 결 합되고, 캐리어 샤프트, 그리고 따라서 기판 캐리어 및 기판 캐리어에 배치된 기판을 캐리어 축 (B)을 중심으로 회전시키는 데 사용된다. 제어기(204c)는, 센서(205c)와 조합하여, 제1 액추에이터(202c)에 제 공되는 제어 파라미터, 예컨대, 모터 전류를 조정함으로써 기판 캐리어의 회전 속도를 목표 값에 또는 그 근처에 유지하는 데 사용된다. 제어 파라미터 센서(205c)는 제1 액추에이터(202c)에 제공되는 제어 파라미터를 측정하는 데 사용된다. 제어 시스템(201d)은 캐리어 샤프트 및/또는 제1 액추에이터(202c)에 결합된 제2 액추에이터(202d), 제어 기(204d), 스위프 속도 센서(203d) 및 제어 파라미터 센서(205d)를 포함한다. 제어기(204d)는, 센서(203d)와 조합하여, 제2 액추에이터(202d)에 제공되는 제어 파라미터, 예컨대, 모터 전류를 조정함으로써 기판 캐리어 의 스위프 속도를 목표 값에 또는 그 근처에 유지하는 데 사용된다. 제어 파라미터 센서(205d)는 제2 액 추에이터(202d)에 제공되는 제어 파라미터를 측정하는 데 사용된다.도 2b에 도시된 바와 같이, 기판 캐리어는 하우징, 베이스 조립체, 기판 하향력 제어 시스템 (201f), 및 캐리어 로드 제어 시스템(201g)을 포함한다. 하우징은 베이스 조립체에 이동가능하게 그 리고 밀봉 결합되어 그와 함께 로딩 챔버를 한정한다. 베이스 조립체는 캐리어 베이스, 캐리어 베이스에 결합된 환형 유지 링, 및 캐리어 베이스에 결합되어 그와 함께 복수의 플레넘들 을 한정하는 가요성 멤브레인을 포함한다. 기판 연마 동안, 복수의 플레넘들이 가압되고, 가요성 멤브레인으로 하여금 그 아래의 기판의 비활성(후면측) 표면에 대해 힘을 가하게 한다. 복수의 플레넘들은 그들의 압력들의 차이들을 허용함으로 써 기판의 후면측 표면에 걸쳐 가해지는 힘들의 분포에 대한 조정들을 용이하게 한다. 상이한 플레넘들 에서의 압력들 및 이들 사이의 압력들의 차이는, 복수의 액추에이터들(202f)(예를 들어, 후면측 압력 조절 기들, 밸브들 등), 복수의 센서들(203f), 하나 이상의 제어기(204f), 및 하나 이상의 제어 파라미터 센서(205 f)를 포함하는 제어 시스템(201f)에 의해 유지된다. 제어 시스템(201f)은 플레넘들 각각에서의 목표 압력 들을 유지하는 데 사용되고, 기판에 대하여 가요성 멤브레인에 의해 가해지는 힘의 분포에 대한 미세 제어를 허용한다. 하나 이상의 제어기(204f)는, 복수의 센서들(203f)과 조합하여, 플레넘들의 압력들을 그들의 대응하는 액 추에이터들(202f)에 대한 각각의 제어 파라미터들을 조정함으로써 그들의 목표 값들에 유지한다. 상이한 제어 파라미터 값들은 그에 대응하는 제어 파라미터 센서들(205f)에 의해 측정된다. 처리 동안, 로딩 챔버는 또한, 캐리어 베이스, 그리고 따라서, 기판을 둘러싸는 유지 링에 대해 하향력을 가하기 위해 가압된다. 유지 링에 대한 하향력은 연마 패드(도 2a)가 아래에서 이동 할 때 기판이 기판 캐리어로부터 미끄러지는 것을 방지한다. 유지 링과 연마 패드 사이의 접촉 압력은 유지 링에 대한 목표 하향력을 변경함으로써 조정된다. 목표 하향력은, 액추에이터(202g), 예를 들어, 후면측 압력 조절기, 로드 챔버에서의 압력 및/또는 유지 링과 연마 패드 사이의 접 촉 부하를 측정하기 위한 센서(203g), 로딩 챔버에서의 목표 압력들을 유지하기 위한 제어기(204g), 및 제 어 파라미터 센서(205g)를 포함하는 제어 시스템(201g)에 의해 유지된다. 제어기(204g)는, 센서(203g)와 조합 하여, 액추에이터(202g)에 제공되는 제어 파라미터를 조정함으로써 로드 챔버에서의 압력을 그의 목표 값 에 또는 그 근처에 유지한다. 여기서, 제어 시스템들(201g,h)의 다양한 구성요소들은 상부 공압 조립체, 여기 서는 UPA를 집합적으로 형성하고, 이는 가압된 가스, 예를 들어, 청정 건조 공기(CDA) 및/또는 진공을 복 수의 플레넘들 및 로딩 챔버에 제공하는 데 사용되는, 조절기들, 밸브들, 및 펌프들(도시되지 않음) 을 더 포함할 수 있다. 다른 실시예들에서, 전기기계 디바이스들은 기판 및 유지 링 중 하나 또는 둘 모두에 대해 하향력들을 가하는 데 사용될 수 있다. 패드 컨디셔너 조립체(도 2a)는 기판의 연마 전에, 연마 후에, 또는 연마 동안 연마 패드의 표 면에 대하여 컨디셔닝 디스크를 압박함으로써 연마 패드를 컨디셔닝하는 데 사용된다. 여기서, 패드 컨디셔너 조립체는 컨디셔닝 디스크, 연마 패드의 내측 반경과 외측 반경 사이에서 회전 컨디셔 닝 디스크를 스위핑하기 위한 컨디셔너 암, 및 패드 컨디셔닝 프로세스의 다양한 양상들을 제어하기 위한 복수의 제어 시스템들(201j-m)을 포함한다. 전형적으로, 컨디셔닝 디스크는 고정된 연마재 컨디셔닝 표면, 예컨대, 금속 합금에 매립된 다이아몬드들 을 포함하고, 연마 패드의 표면을 연마하고 회생시키고, 그로부터 연마 부산물들 또는 다른 잔해물을 제거 하는 데 사용된다. 컨디셔닝 디스크는 일반적으로, 컨디셔닝 디스크의 연마성이 사용에 따라 자연스 럽게 무뎌질 것이기 때문에, 규칙적인 교체를 요구하는 처리 소모품으로 간주된다. 제어 시스템들(201j,k)은 컨디셔닝 디스크가 연마 패드의 내측 반경과 외측 반경 사이에서 진동할 때 컨디셔닝 디스크의 회전 속도 및 스위프 속도를 각각의 목표 값들에 유지하는 데 사용된다. 제어 시스템 (201l)은 컨디셔닝 디스크에 가해지는 하향력을 목표 값에 유지하는 데 사용된다. 일부 실시예들에서, 패 드 컨디셔너 조립체는 연마 패드의 표면에 걸쳐 원하는 연마 패드 두께 프로파일을 제공하고/거나 유 지하는 데 사용될 수 있는 제어 시스템(201m)을 더 포함한다. 그러한 실시예들에서, 원하는 연마 패드 두께 프 로파일은 시스템 제어기에 의해 실행되는 소프트웨어 알고리즘에 의해 제공되는 명령어들에 따라 회전 속도, 스위프 속도 및 하향력 중 하나 또는 그들의 조합을 조정함으로써 유지된다. 여기서, 제어 시스템(201j)은 컨디셔너 암의 단부에 결합된 제1 액추에이터(202j) - 제1 액추에이터(202 j)는 축(C)을 중심으로 컨디셔닝 디스크를 회전시키는 데 사용됨 -, 및 회전 속도를 결정하기 위한 센서(203j), 및 제어기(204j)를 포함한다. 제어 시스템(201k)은 제1 액추에이터(202j)로부터 원위에 있는 컨디셔너 암의 단부에 결합된 제2 액추에이 터(202k), 연마 패드 상의 컨디셔닝 디스크의 방사상 위치 및/또는 스위프 속도를 결정하기 위한 하나 이 상의 센서(203k), 제어기(204k), 및 제어 파라미터 센서(205k)를 포함한다. 제어 시스템(201g)은 컨디셔너 암 에 하향력을 가하기 위한 제3 액추에이터(202l), 하향력을 측정하기 위한 센서(203l), 제어기(204l), 및 제어 파라미터 센서(205l)를 포함한다. 여기서, 제3 액추에이터(202l)는 제2 액추에이터(202l)에 근접하고 컨 디셔닝 디스크로부터 원위에 있는 위치에서 컨디셔너 암의 단부에 결합된다. 제어기들(204j-l) 각각 은, 대응하는 센서들(203j-l)과 조합하여, 대응하는 액추에이터들(202j-l)의 제어 파라미터를 조정함으로써 각 각의 처리 파라미터들을 그들의 목표 값들에 또는 그 근처에 유지한다. 일부 실시예들에서, 제어 시스템(201m)은 컨디셔닝 디스크의 회전 속도, 스위프 속도, 및 하향력 중 하나 또는 이들의 조합을 조정함으로써 원하는 연마 패드 두께 프로파일을 유지하는 데 사용된다. 여기서, 제어 시 스템(201m)은 액추에이터들(202j-l), 컨디셔너 암에 결합된 변위 센서(203m), 및 시스템 제어기를 포 함한다. 변위 센서(203m)는 연마 패드의 두께, 및 연마 패드에 걸친 반경 방향의 패드 두께의 프로파일을 결정하는 데 사용된다. 여기서, 변위 센서(203m)는 센서(203m)의 단부와 그 아래에 배치된 금속 플래튼의 표면 사이의 거리를 결정하기 위해 와전류들을 측정하는 유도성 센서이다. 연마 패드의 두께는, 패드 컨 디셔닝 디스크가 플래튼과 접촉할 때의 알려진 변위와, 패드 컨디셔닝 디스크가, 플래튼 상에 장착된 연마 패드와 접촉할 때의 변위 사이의 차이를 사용하여 결정된다. 시스템 제어기는 변위 센서(203m)를 사용하여 결정된 연마 패드의 두께 프로파일과 목표 두께 프로파 일의 차이를 결정하기 위해 그들을 비교한다. 차이들에 기초하여, 시스템 제어기는 연마 패드의 실제 두께 프로파일을 목표 두께 프로파일로 유도하는 데 사용될 수 있는 컨디셔닝 레시피, 즉, 컨디셔닝 파라미터들 의 세트를 생성한다. 일부 실시예들에서, 생성된 컨디셔닝 레시피는 하나 이상의 방사상 위치에서의 컨디셔닝 디스크에 대한 하향력 및/또는 컨디셔닝 디스크의 체류 시간을 변경한다. 체류 시간은, 컨디셔닝 디스크 가 연마 패드의 내측 반경으로부터 외측 반경까지 스위핑될 때 플래튼이 그 아래에서 연마 패드 를 이동시키기 위해 회전할 때, 컨디셔닝 디스크가 방사상 위치에서 소비하는 시간의 평균 지속기간 을 지칭한다. 패드 냉각 조립체(도 2c)는 연마 패드의 연마 표면을 온도들의 원하는 범위 내에 또는 원하는 온도 설정점으로 유지하는 데 사용된다. 전형적인 연마 프로세스에서, 연마 계면에서의 화학적 및 기계적 활동은 열 을 생성하고, 이는 차례로, 기판 및 연마 패드의 온도를 증가시킨다. 비교적 높고/거나 불안정한 온 도들은 기판의 표면에 걸친(웨이퍼내 불균일성) 또는 기판간의(웨이퍼간 불균일성) 바람직하지 않은 제거 속도 변동들을 초래할 수 있다. 많은 다마신 프로세스들에 있어서, 비교적 높은 온도들은 국부적 평탄화를 열 화시키고, 불량한 국부적 평탄도, 아래놓인 층의 침식, 및/또는 아래놓인 층에 형성된 트렌치, 콘택, 비아, 또 는 라인 피쳐들의 디싱을 초래한다. 그러므로, 본원에서 패드 냉각 조립체는 비반응성 냉각제, 예를 들어, 고체상 이산화탄소의 플레이크들(이산화탄소 눈)을 연마 패드의 표면에 전달함으로써 연마 패드의 표면을 냉각하도록 구성된다. 이산화탄소 눈이 승화할 때(중간 액체상을 통과하지 않고 고체상으로부터 기체상 으로 전이함), 연마 패드의 표면으로부터 열이 제거되고, 바람직하게는 연마 프로세스의 전체 온도를 감소 시킨다. 유리하게, 이산화탄소 눈의 승화는 연마 패드 상의 연마 유체의 바람직하지 않은 희석을 방지한다. 다른 실시예들에서, 냉각제는 극저온 유체, 즉, 120 켈빈의 임계치 이하의 비점을 갖는 유체를 포함하고, 이는 액체 형태, 예컨대, 액체 산소(LOX), 액체 수소, 액체 질소(LIN), 액체 헬륨, 액체 아르곤(LAR), 액체 네온, 액 체 크립톤, 액체 크세논, 액체 메탄, 또는 그들의 조합으로 저장되고 연마 패드의 표면에 전달된다. 패드 냉각 조립체는 연마 패드 위에 위치된 냉각제 전달 암, 냉각제 전달 암 상에 배치된 복수의 노즐들, 및 제어 시스템(201n)을 포함한다. 여기서, 제어 시스템(201n)은 냉각제 공급원(202n), 하나 이상의 센서(203n), 제어기(204n) 및 제어 파라미터 센서(205n)를 포함한다. 하나 이상의 센서(203n), 예 를 들어, IR 센서 또는 고온계들은 연마 패드의 표면을 향하도록 위치되고, 연마 패드의 표면의 온도를 측 정하는 데 사용된다. 일부 실시예들에서, 센서들(203n) 중 하나 이상은 연마 패드의 표면의 열 이미지들 을 생성하는 열 이미징 시스템을 포함한다. 복수의 노즐들은 증기 및 고체 이산화탄소를 제공하는 냉각제 공급원(202n)에 유체 결합된다. 복수의 노 즐들은 이산화탄소 증기가 그를 통해 팽창할 때 이산화탄소 눈을 생성하고, 이산화탄소 눈을 연마 패드 의 표면에 전달한다. 제어기(204n)는, 센서들(203n)과 조합하여, 냉각제 공급원(202n)으로부터 노즐들에 제공되는 이산화탄소의 질량 유량을 조정함으로써 연마 패드의 온도를 목표 값에 유지한다. 여기 서, 연마 패드의 표면의 온도를 제어하기 위한 제어 파라미터(들)는 제어 파라미터 센서(205n)에 의해 측 정되는 바와 같은 질량 유량을 포함한다. 일부 실시예들에서, 복수의 노즐들 중 개별 노즐들로의 냉각제 의 전달 및/또는 유량은 독립적으로 제어된다. 그러한 실시예들에서, 패드 냉각 조립체는 연마 패드(23 1)의 표면의 영역들에 걸친 온도들의 원하는 균일성 또는 온도들의 분포를 유지하기 위해 연마 패드의 표면의 영역들의 온도를 조정하는 데 사용될 수 있다. 위에서 설명된 연마 시스템의 제어 시스템들(201a-n) 각각은, 하나 이상의 연마 파라미터를 그에 관련된 각 각의 제어 파라미터들을 조정함으로써 각각의 목표 값들에 또는 그 근처에 유지하기 위해, 폐루프 피드백 제어 방법을 사용한다. 위에서 논의된 바와 같이, 기판들 사이의(예를 들어, 웨이퍼간(WTW)), 개별 기판의 연마 동 안의(예를 들어, 웨이퍼내(WIW)), 또는 둘 다에서의 제어 파라미터들의 차이들은 연마 프로세스에서의 교란 또 는 변경을 나타낼 가능성이 있다. 연마 프로세스에서의 그러한 교란들 또는 변경들은, 제어 시스템들(201a- 1)을 사용하여 목표 값들에 또는 그 근처에 유지되는 연마 파라미터들의 변경들에 의해 야기될 가능성은 없다. 대신에, 그러한 교란들 또는 프로세스 변경들은, 연마 계면에서 발생할 가능성이 있고, 기판의 표면에서의 변경들, 연마 패드의 표면에서의 변경들, 연마 유체들의 조성, 특성들 및/또는 체적에서의 변경들, 및 이 들의 조합들을 포함한다. 따라서, 일부 실시예들에서, 비지도 학습 모델을 사용하는 AI 알고리즘은 연마 계면에서의 표면들, 유체들, 및 연마재들 사이의 복잡한 화학적 및 기계적 상호작용들을 더 잘 이해하기 위해 제어 파라미터 데이터의 패턴들을 식별하고 이해하는 데 사용될 수 있다. 아래의 방법들에서 논의되는 바와 같이, 일부 실시예들에서, AI 알고리즘은 하나 이상의 제어 파라미터와 인-시튜 기판 측정 데이터 사이의 함수 관계를 결정하고, 그에 기초하여 연마 계면에서의 연마 유체 조성을 조 정하도록 훈련된다. 따라서, 본원의 유체 전달 시스템은, 시스템 제어기로부터 수신된 명령어들에 기 초하여, 연마 패드의 표면으로의, 그리고 따라서 연마 계면으로의 개별 연마 유체 성분들의 유동을 정지시 키고, 유동을 시작하고, 그리고/또는 그 유량을 조정하도록 구성된다. 일부 실시예들에서, 명령어들은 훈련된 AI 알고리즘을 사용하여 생성된 소프트웨어 알고리즘, 예를 들어, 하나 이상의 기계 학습 AI 모델의 형태이다. 유체 전달 시스템(도 2c)은 개별 유체 성분들을 포함하는 연마 유체들을 연마 패드의 표면에 전달하는 데 사용된다. 유체 전달 시스템은 유체 분배 시스템, 복수의 노즐들을 포함하는 전달 암, 및 유체 전달 암에 결합된 액추에이터를 포함한다. 유체 분배 시스템은 연마 유체들 및/또는 유체 성분들을 전달하는 복수의 연마 유체 공급원들(287a, 287b)에 유체 결합된다. 액추에이터는 복수의 노즐 들을 연마 패드 위의 원하는 방사상 분배 위치에 위치시키기 위해 연마 패드 위에서 전달 암을 스윙 하도록 작동가능하다. 여기서, 유체 분배 시스템은, 연마 유체들 및/또는 개별 연마 유체 성분들을 제어하고, 측정하고, 연마 패 드의 표면에 전달하는 데 사용될 수 있는, 복수의 밸브들(285a), 펌프들(285b), 및 유동 제어기들(285c) 중 하나 또는 이들의 조합, 및 연마 유체 혼합 장치(285d)를 포함한다. 일부 실시예들에서, 유체 분배 시스템 은, 유체 및/또는 성분을 연마 패드의 표면에 전달하기 전에 그리고/또는 전달과 동시에, 개별 연마 유체 및/또는 하나 이상의 개별 연마 유체 성분을 가열하는 데 사용되는 하나 이상의 가열기(도시되지 않음)를 더 포함한다. 여기서, 하나 이상의 연마 유체 및 개별 연마 성분은, 유체 분배 시스템으로부터 복수의 노즐들 중 대응하는 노즐로, 그들 사이에 유체 결합된 복수의 전달 라인들을 사용하여 전달된다. 일부 실시예들에서, 유체 분배 시스템은 하나 이상의 상이한 연마 유체 및/또는 유체 성분을 복수의 노즐들 중 상이한 노즐들에 독립적으로 전달하고/거나, 그들로의 상이한 연마 유체들 또는 유체 성분들의 유량들 을 독립적으로 제어하도록 구성된다. 따라서, 유체 분배 시스템은 연마 패드의 표면에 걸쳐 원하는 연마 유체 조성 구배를 제공하기 위해 연마 패드의 표면 상에 분배되는 연마 유체 및/또는 개별 연마 유체 성분들의 원하는 분배를 제공하는 데 사용될 수 있다. 일부 실시예들에서, 유체 분배 시스템은, 결과적인 혼합물을 연마 패드의 표면에 전달하기 전에 연마 유체에 하나 이상의 연마 유체 성분을 추가함으로써 연마 유체의 조성을 조정하는 데 사용될 수 있는 혼합 장치 (285d)를 더 포함한다. 일부 실시예들(도시되지 않음)에서, 혼합 스테이션은 유체 전달 암 상에 배치된다. 연마 패드의 표면에, 연마 패드의 표면 상의 원하는 위치들에 독립적으로 전달될 수 있고/있거나 혼합 장 치(285d)를 사용하여 연마 유체에 추가될 수 있는 개별 연마 유체 성분들의 예들은: 나노규모의 실리카 또는 금 속 산화물 입자들이 내부에 현탁된 연마재 용액들; 착물화제들; 부식 억제제들; 산화제들; pH 조정제들 및/또는 완충제들, 중합체 첨가제들, 부동화제들, 촉진제들, 계면활성제들, 또는 이들의 조합들을 포함한다. 일부 실시예들에서, 유체 전달 시스템은 연마 패드 위에 위치되고 연마 패드 쪽으로 향하는 광학 센 서, 예컨대, 카메라를 더 포함한다. 일부 실시예들에서, 카메라는 관찰하도록 위치된 물체의 디지털 이미지 또는 디지털 이미지들의 스트림을 생성하도록 구성되는 디지털 카메라(예를 들어, CCD 카메라)이다. 광 학 센서는 연마 패드의 표면에 걸친 연마 유체 및/또는 연마 유체 성분들의 분배를 결정하는 데 사용될 수 있다. 일부 실시예들에서, 개별 연마 유체들 및/또는 개별 연마 유체 성분들 중 하나 이상은 광학 마커, 예컨 대, 종래의 수용성 염료 또는 형광단을 포함한다. 그러한 실시예들에서, 광학 센서를 사용하여 캡처된 이미지 들은 연마 패드의 표면에 걸친 연마 유체의 분포를 결정하고/거나 연마 패드의 표면에 걸친 개별 연 마 유체 성분들의 조성 구배를 결정하기 위해 분석될 수 있다. 일부 실시예들에서, 연마 패드의 표면에서의 연마 유체 분배 및/또는 조성은, 이미지들의 분석에 기초하여, 개별 노즐들 중 하나 이상에 대한 하나 이상의 개별 연마 유체 성분의 유량을 시작, 정지 또는 변경함으로써 조정된다. 일부 실시예들에서, 연마 패드의 표면에서의 연마 유체 분배 및/또는 조성은 폐 루프 피드백 제어 시스템을 사용하여 목표 분배 및/또는 조성으로 연속적으로 조정된다. 예를 들어, 여기 서 제어 시스템은 시스템 제어기, 연마 패드의 표면에서의 연마 유체 분배 및/또는 조성을 결정 하는 데 사용되는 광학 센서(예를 들어, 카메라), 및 유체 분배 시스템을 포함한다. 다른 예에서, 여기서 제어 시스템은 시스템 제어기, 연마 패드의 표면에서의 그리고/또는 유체 분배 시스템 내에서의 연마 유체 조성을 결정하는 데 사용되는 전기화학 센서(도시되지 않음) 또는 pH 센서(도시되지 않음)를 포함한다. 광학 센서로부터 취득된 이미지들의 분석에 기초하여, 시스템 제어기는 유체 분배 시스 템에게 연마 패드의 표면으로의 연마 유체들 및/또는 연마 유체 성분들의 전달에 관련된 하나 이상의 제어 파라미터를 변경하도록 지시한다. 예를 들어, 제어 파라미터들은 집합적인 복수의 노즐들에 또는 복 수의 노즐들 중 개별적인 노즐들에 제공되는 개별 연마 유체 및/또는 연마 유체 성분의 유량을 시작, 정지, 또 는 변경하는 것을 포함할 수 있다. 일부 실시예들에서, 광학 센서를 사용하여 캡처된 이미지들 중 하나 이상, 예컨대, 복수의 캡처된 이미지들의 시계열은 본원에 제공되는 AI 알고리즘 훈련 방법들을 위한 훈련 데이터로서 사용될 수 있는 프로세 스 모니터링 인-시튜 측정 데이터를 포함한다. 인-시튜 기판 모니터링 시스템(도 2a)은, 기판 표면 상의 물질 층의 두께를 모니터링하고/거나 그로부터 물질이 제거될 때 기판 표면의 변경들을 검출하는 데 사용된다. 인-시튜 기판 모니터링 시스템을 사용하 여 수집된 정보는 인-시튜 결과 데이터로서 사용될 수 있다. 여기서, 인-시튜 기판 모니터링 시스템(22 2)은 광학 시스템 및 와전류 모니터링 시스템 중 하나 또는 둘 모두에 대한 제어기를 포함한다. 광학 시스템은 연마 패드에 형성된 윈도우(도시되지 않음)를 통해 기판을 향해 광을 지향시키고 그로부터의 반사된 광을 수신하도록 각각 위치된 광원(도시되지 않음) 및 광학 센서를 포함한다. 제어기 는 그로부터 기판 표면의 하나 이상의 특성을 결정하기 위해 반사된 광을 분석한다. 예를 들어, 광학 시 스템은 기판 표면의 반사율의 변경들을 검출하는 데, 예를 들어, 기판 표면으로부터의 금속 층의 소거를 결정하는 데, 기판 표면으로부터 반사된 광의 산란을 검출하는 데, 예를 들어, 기판 표면의 평탄도의 변경들을 결정하는 데, 그리고/또는 기판 표면 상에 배치된 투명 막, 예를 들어, 유전체 층의 두께를 결정하기 위해 간섭 측정 기법들을 사용하는 데 사용될 수 있다. 와전류 모니터링 시스템은 플래튼의 표면에 배치된 센서 및 와전류 생성기를 포함하는 와전류 조립체 를 포함한다. 와전류 모니터링 시스템은 와전류 조립체를 사용하여 기판 상의 전도성 물질 층, 예를 들어, 금속 층에 와전류를 유도하고 측정하며, 전류 모니터링 시스템은 그로부터 전도성 물질 층의 두께를 결정한다. 일부 실시예들에서, 와전류 모니터링 시스템은 그 위에서 기판이 스위핑될 때 기판의 반 경에 걸친 두께 프로파일을 결정하는 데 사용된다. 일부 실시예들에서, 광학 시스템 및 와전류 모니터링 시스템 중 하나 또는 둘 모두는, 물질 층의 두 께 및/또는 아래놓인 층의 필드 표면으로부터의 오버버든 물질의 소거에 기초하여 연마 조건들에서의 변경을 촉 발하기 위해, 연마 시스템의 제어기, 예컨대, 시스템 제어기 상에서 실행되는 종료점 알고리즘과 조합하여 사용된다. 시스템 제어기는 연마 시스템 및 그의 다양한 구성요소들 및 하위시스템들의 작동을 지시하는 데 사용 된다. 일부 실시예들에서, 제어기들(204a-n) 중 각각의 제어기의 기능들 중 하나 이상 또는 전부는 시스템 제 어기에 의해 수행될 수 있다. 본원에서, 시스템 제어기는 AI 훈련 플랫폼과 조합하여 본원에 제시 되는 방법들을 구현하도록 작동가능하다. 시스템 제어기는 메모리(예를 들어, 비휘발성 메모리) 및 지원 회로들과 함께 작동가능한 프로그램 가능 중앙 처리 유닛(CPU)을 포함한다. 예를 들어, 일부 실시예들에서, CPU는 다양한 연마 시스템 구성요소들 및 하위 프로세서들을 제어하기 위해서 산업 현장에 서 사용되는 임의의 형태의 범용 컴퓨터 프로세서 중 하나, 예컨대, 프로그램 가능 로직 제어기(PLC)일 수 있다. CPU에 결합된 메모리는 비일시적이며, 전형적으로, 쉽게 입수가능한 메모리, 예컨대, 랜덤 액 세스 메모리(RAM), 판독 전용 메모리(ROM), 플로피 디스크 드라이브, 하드 디스크, 또는 임의의 다른 형태의 로 컬 또는 원격 디지털 저장소 중 하나 이상이다. 지원 회로들은 CPU에 통상적으로 결합되고, 기판 연 마 프로세스의 제어를 용이하게 하기 위해 연마 시스템의 다양한 구성요소들에 결합된, 캐시, 클럭 회로들, 입력/출력 하위시스템들, 전력 공급부들 등, 및 이들의 조합들을 포함한다. 본원에서, 메모리는 CPU에 의해 실행될 때 연마 시스템의 작동을 용이하게 하는 명령어들을 포 함하는 컴퓨터 판독가능 저장 매체(예를 들어, 비휘발성 메모리)의 형태이다. 예시적인 컴퓨터 판독가능 저장 매체는: (i) 정보가 영구적으로 저장되는 기입 불가능한 저장 매체(예를 들어, 컴퓨터 내의 판독 전용 메모리 디바이스들, 예컨대, CD-ROM 드라이브에 의해 판독가능한 CD-ROM 디스크들, 플래시 메모리, ROM 칩들, 또는 임 의의 유형의 고체 상태 비휘발성 반도체 메모리); 및 (ii) 변경가능한 정보가 저장되는 기입가능한 저장 매체 (예를 들어, 디스켓 드라이브 내의 플로피 디스크들 또는 하드 디스크 드라이브 또는 임의의 유형의 고체 상태 랜덤 액세스 반도체 메모리)를 포함하지만, 이에 제한되지는 않는다. 메모리에 있는 명령어들은, 본 개시 내용의 방법들을 구현하는 프로그램과 같은 프로그램 제품(예를 들어, 미들웨어 어플리케이션, 장비 소프트웨어 어플리케이션 등)의 형태로 되어 있다. 일부 실시예들에서, 본 개시내용은 컴퓨터 시스템과 함께 사용하기 위 한 비일시적 컴퓨터 판독가능 저장 매체 상에 저장된 프로그램 제품으로서 구현될 수 있다. 따라서, 프로그램 제품의 프로그램(들)은 (본원에 설명된 방법들을 포함하는) 실시예들의 기능들을 정의한다. 도 3은 도 1c에 설명된 프로세스 개선 방식을 사용하는 기판 처리 방법을 예시하는 도면이다. 방법 의 적어도 부분들은 연마 시스템 상에서 수행될 수 있고, 그와 함께 사용되는 개별 제어 시스템들을 포함하여, 그의 특징들 및 기능들 중 임의의 것을 통합할 수 있다는 것이 고려된다. 방법의 응용들은, 벌 크 물질 평탄화 응용들, 예컨대, 층간 유전체(ILD) 응용들, 및 다마신 연마 응용들, 예컨대, 얕은 트렌치 격리 응용들(STI) 및 금속 인터커넥트 연마 응용들을 포함하지만, 이에 제한되지 않는다. 활동에서, 방법은 위에서 설명된 연마 시스템과 같은 연마 시스템을 사용하여 기판을 연마하는 단계를 포함한다. 활동은 활동들(304-312)을 포함하는 복수의 활동들을 포함할 것이다. 활동에서, 방법은 연마 레시피에 따라 연마 시스템의 연마 패드의 표면 상으로 연마 유체 조성물 (예를 들어, 슬러리)을 유동시키는 단계를 포함한다. 연마 패드의 표면 상의 정의된 방사상 위치에 제공 되는 연마 유체 조성물의 양 및/또는 유량은 시스템 제어기로부터 액추에이터 및/또는 유체 분배 시스 템에 전송되는 명령들의 사용에 의해 제어될 수 있다. 활동에서, 방법은 연마 레시피에 따라, 연마 유체의 존재 하에서 기판을 연마 패드의 표면에 대하여 압박하는 단계를 포함한다. 여기서, 연마 레시피는 기판 캐리어 회전 속도, 기판 캐리어 병진 속도, 플래튼 회 전 속도, 기판 하향력, 유지 링 하향력, 연마 조성물 유량(들), 헹굼 용액 유량(들) 및 패드 컨디셔닝 파라미터 들을 포함하는 복수의 연마 파라미터들, 및 그들의 대응하는 목표 값들에 의해 정의된다. 목표 값들은 원하는 설정점들, 원하는 하한 임계치들 위의 값들, 원하는 상한 임계치들 아래의 값들, 및 원하는 하한 임계치와 상한 임계치 사이의 값들을 포함한다. 활동은 정면측 표면을 연마 패드에 대하여 압박하기 위해 기판 캐 리어의 가요성 멤브레인으로 하여금 기판의 비활성(후면측) 표면에 대해 힘을 가하게 하도록 복수의 플레넘 중 하나 이상을 가압하는 단계를 포함할 것이다. 목표 값들은 고정된 값들, 예를 들어, 미리 결정된 설정점들 또는 임계치들과, 연마 프로세스 전에, 후에, 그리 고/또는 연마 프로세스와 동시에 연마 시스템의 제어기 상에서 실행되고 있는 하나 이상의 소프트웨어 알고리즘 에 의해 결정된 값들의 조합을 포함할 수 있다. 예를 들어, 일부 실시예들에서, 연마 시퀀스의 스테이지의 지 속기간은 연마 시스템의 제어기 상에서 실행되는 종료점 알고리즘을 사용하여 결정된다. 일부 실시예들에서, 목표 값들 중 하나 이상은 훈련된 AI 알고리즘에 의해, 예를 들어, 반복적 연속 개선 프로세스의 일부로서 결정된다. 일부 실시예들에서, 목표 값들 중 하나 이상은 훈련된 AI 알고리즘에 의해 생성된 기계 학습 AI 모델을 사용하여 결정된다. 그러한 실시예들에서, 기계 학습 AI 모델은 연마 시스템의 시스템 제어기에 의해 실행되는 소프트웨어 알고리즘을 포함할 수 있다. 전형적인 연마 프로세스에서, 단일 기판에 대한 연마 레시피는 다중 스테이지 연마 시퀀스를 포함하고, 여기서 시퀀스의 각각의 스테이지에 대해 하나 이상의 연마 파라미터 목표 값이 변경된다. 일부 실시예에서, 다중 스 테이지 연마 시퀀스의 하나 이상의 스테이지는 기판이 제2 연마 스테이션으로 이동되기 전에 제1 연마 스테이션 에서 수행되고, 연마 시퀀스의 나머지의 수행을 위해, 때때로 제3 연마 스테이션으로 다시 이동된다. 연마 레시피를 정의하는 데 사용될 수 있는 연마 파라미터들의 예들은: 플래튼 회전 속도; 플래튼 온도; 기판 캐리어 회전 속도; 기판 캐리어 스위프 속도; 기판 캐리어 스위프 시작 및 정지 위치들(연마 패드 상의 내측 및 외측 방사상 위치들); 기판 하향력(기판의 후면측에 대하여 가해지는 하향 압력); 기판에 걸친 하향력들의 분포; 유지 링 하향력(유지 링에 대하여 가해지는 하향 압력); 기판 하향력과 유지 링 하향력 간의 차이; 연마 패드 표면 온도; 연마 패드 표면 온도 균일성 및/또는 분포; 연마 유체 또는 성분의 유동의 시작 및 정지를 포 함하는, 연마 유체 및/또는 개별 연마 유체 유량들; 연마 유체 및/또는 개별 연마 유체 성분 온도들; 예를 들어, 연마 유체 혼합 시스템으로부터의 출력으로서, 연마 패드로의 전달 이전에, 또는, 예를 들어, 개별 연마 유체 성분들의 분배의 결과로서, 연마 패드의 표면 상에서의 연마 유체 조성; 및 연마 패드의 표면에 걸친 연마 유체 분배 및/또는 조성 구배, 및 지속기간(시간)을 포함하지만, 이에 제한되지 않는다. 전형적으로, 연마 레시피는 연마 프로세스 전에, 후에, 및/또는 연마 프로세스와 동시에 연마 패드의 컨디셔닝 에 관련된 처리 파라미터들, 본원에서는 패드 컨디셔닝 파라미터들을 더 포함한다. 패드 컨디셔닝 파라미터들 의 예들은: 컨디셔닝 디스크의 회전 속도, 연마 패드에 대하여 컨디셔닝 디스크에 가해지는 하향력, 연마 패드 의 하나 이상의 부분 위에서의 컨디셔닝 디스크의 체류 시간, 및 연마 패드의 표면에 걸친 컨디셔닝 디스크의 스위프 속도를 포함한다. 위에서 간략히 논의된 바와 같이, 패드 컨디셔닝 파라미터들 중 하나 이상은 컨디셔 닝 디스크 체류 시간을 결정하기 위해 컨디셔너 조립체의 위치 센서와 함께 사용될 수 있다. 일부 실시예들에 서, 패드 컨디셔닝 파라미터들은 또한, 연마 패드의 중심에 근접한 위치로부터, 그로부터 방사상 외측의 위치까 지 측정된 바와 같은 연마 패드 두께 및/또는 연마 패드 두께의 프로파일을 포함할 수 있다. 활동에서, 방법은 하나 이상의 연마 파라미터에 대응하는 각각의 제어 파라미터들을 조정함으로써 하 나 이상의 연마 파라미터를 그들의 목표 값들에 또는 그 근처에 유지하는 단계를 포함한다. 여기서, 하나 이상 의 연마 파라미터는 폐루프 제어 시스템을 사용하여 그들의 목표 값들에 또는 그 근처에 유지된다. 따라서, 일 부 실시예들에서, 연마 파라미터를 그의 목표 값에 또는 그 근처에 유지하는 단계는: 연마 파라미터의 실제 값과 그의 목표 값 사이의 차이를 결정하는 단계; 결정된 차이에 기초하여, 연마 파라미터에 대응하는, 제 어 시스템의 제어 파라미터를 변경하는 단계; 및 연마 파라미터에 대한 폐루프 제어를 제공하기 위해 및 단계를 연속적으로 반복하는 단계를 포함한다. 제어 파라미터들은, 본원에서 사용되는 바와 같이, 연마 파라미터의 실제 값의 대응하는 변경을 야기하는 액추 에이터들 및/또는 시스템들로부터의 출력들을 포함한다. 특정 제어 시스템에 대한 제어 파라미터들은 그 시스 템에 대한 연마 파라미터와 상이하다. 그럼에도 불구하고, 본원의 제어 시스템들 중 적어도 일부의 설명으로부 터 알 수 있는 바와 같이, 예시적인 연마 파라미터들로서 위에서 설명된 파라미터들 중 적어도 일부는 상이한 제어 시스템에서 제어 파라미터들의 역할을 할 수 있다. 예를 들어, 연마 패드 두께 프로파일이 폐루프 시스템 에서 연마 파라미터로서 사용되는 실시예들에서, 컨디셔너 하향력, 회전 속도, 및 체류 시간들의 개별 파라미터 들 중 하나 이상은 제어 파라미터들로서 사용될 수 있고, 원하는 패드 두께 프로파일을 제공하도록 조정될 수 있다. 일부 실시예들에서, 활동의 처리 파라미터들 중 적어도 하나는 패드 표면 온도를 포함하고, 대응하는 제어 파라미터는 연마 패드의 표면에 전달되는 냉각제, 예를 들어, 이산화탄소 눈의 질량 유량을 포함한다. 일부 실 시예들에서, 제어기(204b)는, 센서(203b)와 조합하여, 유체 공급원(202b)으로부터 연마 플래튼의 하나 이 상의 채널을 통해 냉각제의 유량을 조정함으로써 플래튼의 온도를 목표 값으로 제어하는 데 사용된다. 일부 실시예들에서, 연마 플래튼의 온도를 제어하기 위한 제어 파라미터(들)는 유량계, 예를 들어, 제어 파라미터 센서(205b)에 의해 측정된 냉각제 유량을 포함한다. 활동에서, 방법은 처리 시스템 데이터를 생성하는 단계를 포함한다. 여기서, 처리 시스템 데이 터는 연마 레시피 및 제1 제어 파라미터의 시계열 데이터를 포함한다. 활동에서, 방법은, 활동들(304 내지 310)과 동시에, 인-시튜 기판 모니터링 시스템, 예컨대, 본원에 설명된 인-시튜 기판 모니터링 시스템으로부터 획득된 측정치들을 사용하여 시계열 인-시튜 결과 데이터를생성하는 단계를 포함한다. 일부 실시예들에서, 활동에서, 연마 패드의 연마 표면(예를 들어, 최상부 표면)을 관찰하도록 위치되 는 카메라(도 2a)는, 연마 패드의 표면 및/또는 연마 패드의 표면 상에 배치된 연마 유체 조성물의 광학 특성의 변경 또는 변동을 검출하기 위해, 카메라 또는 시스템 제어기 내에서 실행되는 하나 이상의 소프트 웨어 알고리즘에 의해 모니터링 및 분석되는 신호(예를 들어, 비디오 신호 스트림)를 제공하도록 구성된다. 일 예에서, 카메라는 연마 패드 표면에 걸친 온도의 구배들 및/또는 시간에 따른 온도 변동들을 검출하도록 구성된 IR 카메라이다. 소프트웨어 알고리즘은 연마 패드의 표면의 및/또는 연마 패드의 표면 상에 배치된 연마 유체 조성물의 온도 및/또는 온도의 변동을 실시간으로 검출하는 데 사용될 수 있다. 그 다음, 알고리즘이 실행되고 있는 시스템 및/또는 카메라는, 시계열 인-시튜 결과 데이터를 포함하는 신호를 시스템 제어기에 제공 하고/거나 훈련 데이터를 포함하는 신호를 인공 지능(AI) 훈련 플랫폼에 제공하도록 적응된다. 추가적으로, 유체 분배 시스템 내의 구성요소들에 결합되는 유량 감지 디바이스 및/또는 연마 유체 조성 검출 디바이스(예를 들어, pH 센서, 연마 입자 농도 센서 등)는 또한, 카메라가 연마 패드의 표면을 모니터링하 고 있는 동안 연마 패드의 표면 상에 분배되고 있는 하나 이상의 연마 유체 조성물의 양 및/또는 조성에 관한 신호를 전달하도록 구성될 수 있다. 카메라 및 유량 감지 디바이스 및/또는 연마 유체 조성 검출 디바이 스(들)에 의해 제공되는 신호에서 제공되는 시계열 인-시튜 결과 데이터는, 이러한 상이한 유형들의 데이터 사 이의 상호작용을 검출하기 위해 후속 활동들 동안 인공 지능(AI) 훈련 플랫폼(30A)에 의해 분석된 다음, 후속 활동에서, 시간에 걸쳐 수신된 데이터에 기초하여 연마 유체 조성물의 조성 및/또는 패드 냉각 조립체에서 발견되는 구성요소들을 사용하여 연마 패드의 온도의 변경을 야기한다. 다른 예에서, 활동에서, 카메라(도 2a)는 연마 패드 표면의 상태, 예컨대, 연마 패드 표면이 원하는 양의 \"패드 컨디셔닝\"을 갖는지 여부를 검출하도록 구성된다. 이 경우, 카메라는 연마 패드 표면의 상태 를 결정하기 위해 연마 패드의 연마 표면 상에서 발견되는 거칠기 및/또는 돌기들의 양을 검출하도록 위치되고 구성된다. 일부 실시예들에서, 카메라는 표면 거칠기의 정도를 검출하고 측정하도록 구성되는 프로필로미 터 또는 다른 디바이스로 대체된다. 표면 거칠기는 Ra, Rrms, RSk, 또는 Rp 값을 특징으로 할 수 있다. 카메라 또는 유사한 디바이스에 의해 검출되는 표면 거칠기는, 크기가 최대 약 10-50 미크론인, 연마 패드의 연마 표면 상의 패드 물질에서의 불규칙성들을 포함할 수 있다. 추가적으로, 유량 감지 디바이스 및/또는 연마 유체 조성 검출 디바이스(예를 들어, pH 센서, 연마 입자 농도 센서 등)는 또한, 카메라가 연마 패드 표면의 상태를 모니 터링하고 있는 동안 연마 패드의 표면 상에 분배되고 있는 연마 유체 조성물의 양 및/또는 조성에 관한 신호를 전달하도록 구성될 수 있다. 카메라, 또는 유사한 디바이스, 및 유량 감지 디바이스 및/또는 연마 유체 조성 검출 디바이스에 의해 제공되는 신호에서 제공되는 시계열 인-시튜 결과 데이터는, 컨디셔닝 프로세스가 발생하게 하고, 패드 냉각 조립체를 사용하여 연마 패드의 온도의 변경을 야기하고, 그리고/또는 상이한 유형들의 데이터의 검출된 상호작용에 기초하여 연마 유체 조성물의 조성의 변경을 야기하기 위해, 인공 지능 (AI) 훈련 플랫폼(30A) 및 시스템 제어기에 의해 사용될 수 있다. 이러한 디바이스들로부터의 신호들은 시 스템 제어기에 제공될 수 있고/거나 훈련 데이터를 포함하는 신호는 인공 지능(AI) 훈련 플랫폼에 전달 될 수 있다. 다른 예에서, 활동에서, 카메라(도 2a)는 연마 유체가 연마 패드 상에 분배되고 있을 때 연마 패드 표면의 하나 이상의 영역에 걸쳐 연마 유체의 유동 및/또는 적용범위를 검출하도록 구성된다. 이 경우, 카메라 는, 유체 분배 시스템의 구성요소들 중 하나 이상의 구성요소의 상태를 결정하기 위해 연마 패드의 연마 표면에 걸친 연마 유체의 확산량을 검출하도록, 예컨대, 노즐들 중 하나 이상의 노즐에서의 장애물들 을 검출하도록, 유체 펌프의 출력의 변동들을 검출하도록, 그리고/또는 연마 패드 표면 위의 원하는 위치에 대 한 그리고/또는 연마 패드 위의 기판 캐리어의 위치에 대한 유체 전달 암 위치의 변동들을 검출하도 록 위치되고 구성된다. 연마 패드의 연마 표면에 걸친 연마 유체의 확산량은 연마 패드의 수평 영역의 적용범 위 또는 카메라의 시야(FOV)의 백분율에 의해 측정되거나 결정될 수 있다. 일부 경우들에서, 카메라는 또 한, 연마 패드 표면에 걸친 온도의 구배들 및/또는 시간에 따른 온도 변동들을 검출하도록 구성된다. 추가적으 로, 유량 감지 디바이스 및/또는 연마 유체 조성 검출 디바이스(예를 들어, pH 센서, 연마 입자 농도 센서)는 또한, 카메라가 연마 패드 표면의 하나 이상의 영역에 걸친 연마 유체의 유동 및/또는 적용범위를 모니터링하고 있는 동안 연마 패드의 표면 상에 분배되고 있는 연마 유체 조성물의 양 및/또는 조성에 관한 신호를 전달하도 록 구성될 수 있다. 카메라 및 유량 감지 디바이스 및/또는 연마 유체 조성 검출 디바이스(들)로부터 제 공되는 신호들에서 제공되는 시계열 인-시튜 결과 데이터는, 연마 유체가 연마 패드의 표면에 전달되는 위치를 조정하기 위해 후속 활동에서 유체 전달 암의 위치의 조정을 야기하고, 노즐들 중 하나 이상의 노즐로부터의 연마 유체의 유동의 증가를 야기하고, 패드 냉각 조립체를 사용하여 연마 패드의 온도의 변경을 야기하고, 그리고/또는 후속 활동들 동안 상이한 유형들의 데이터의 검출된 상호작용에 기초하여 연마 유체 조 성물의 조성의 변경을 야기하기 위해, 인공 지능(AI) 훈련 플랫폼(30A) 및 시스템 제어기에 의해 사용될 수 있다. 활동에서, 방법은 대응하는 복수의 훈련 데이터 세트들을 획득하기 위해 복수의 기판들에 대해 활동 들(304 내지 312)을 반복하는 단계를 포함한다. 여기서, 훈련 데이터 세트들 각각은 대응하는 연마된 기판에 상관될 수 있는 인-시튜 결과 데이터 및 처리 시스템 데이터를 포함한다. 활동에서, 방법은, 인공 지능(AI) 훈련 플랫폼에서, 복수의 훈련 데이터 세트들을 포함하는 훈련 데이터를 수신하는 단계를 포함한다. 일부 실시예들에서, 복수의 훈련 데이터 세트들은, 상이한 데이터 세트들 사이의 상호작용을 검출하기 위해 하나 이상의 연마 시스템으로부터 시간에 걸쳐 수신되는, 연마 프 로세스 동안의 슬러리 조성물의 분배된 양, 연마 프로세스 동안의 분배된 슬러리 조성물의 농도, 연마 프로세스 동안 슬러리 조성물이 분배된 이후의 연마 패드의 온도, 연마 프로세스의 부분 동안의 연마 패드 특징들, 및 패 드 컨디셔닝 프로세스들 사이의 시간에 관한 데이터를 포함한다. 일 예에서, 인공 지능(AI) 훈련 플랫폼에 의해 수집되고 후속하여 분석되는 복수의 훈련 데이터 세트들은, 연마 프로세스 결과 데이터에서의 경향들의 검출, 예컨대, 디싱, 웨이퍼간 불균일성(WTWNU), 평탄화 효율 및 국 부적 평탄도, 하나 이상의 연마 유체 조성물 조성의 검출을 포함하는 훈련 데이터 세트들에서 발견되는 데이터 간의 검출된 상호작용에 기초함, 상이한 연마 유체 조성물 조성들 사이의 차이들의 검출(예를 들어, 상이한 연 마재들 또는 소정의 양의 하나의 유형의 연마재의 사용), 특정 유형의 기판의 검출(예를 들어, 산화물 연마 프 로세스 또는 금속 연마 프로세스), 연마 유체 유량의 검출, 및/또는 하나 이상의 연마 시스템에서 수행되는 복수의 연마 프로세스들 동안 연마 패드의 온도에서의 검출된 경향을 포함한다. 다른 예에서, 활동에서, 인공 지능(AI) 훈련 플랫폼에 의해 수집되고 후속하여 분석되는 복수의 훈련 데이터 세트들은, 연마 패드의 표면 및/또는 연마 패드의 표면 상에 배치된 연마 유체 조성물의 광학 특성에서 의 경향들, 및 하나 이상의 연마 유체 조성물 조성에서의 변동에서의 경향, 또는 특정 유형의 기판(예를 들어, 산화물 연마 프로세스 또는 금속 연마 프로세스) 상에서의 상이한 연마 유체 조성물 조성들 사이의 차이들(예를 들어, 상이한 연마재들 또는 소정의 양의 하나의 유형의 연마재의 사용)의 검출을 포함한다. 다른 예에서, 활동에서, 인공 지능(AI) 훈련 플랫폼에 의해 수집되고 후속하여 분석되는 복수의 훈련 데이터 세트들은, 연마 패드 표면의 하나 이상의 영역에 걸친 연마 유체의 유동 및/또는 적용범위에서의 검출, 연마 유체 유량의 검출, 및/또는 하나 이상의 연마 시스템에서 수행되는 복수의 연마 프로세스들 동안 연마 패드의 온도에서의 검출된 경향을 포함한다. 활동에서, 방법은 훈련 데이터를 사용하여 기계 학습 AI 알고리즘을 훈련함으로써 기계 학 습 AI 모델을 생성하는 단계를 포함한다. 활동에서, 인공 지능(AI) 훈련 플랫폼은 기계 학습 AI 모델을 사용하여 다양한 공급원들로부터 현재 수신된 데이터의 분석을 수행할 수 있다. 일 예에서, 활동에서, 인공 지능(AI) 훈련 플랫폼은, 카메라 및 하나 이상의 연마 유체 조성 검 출 디바이스에 의해 생성된 데이터의 수신 및 기계 학습 AI 모델의 사용에 기초하여, 증가하는 패드 연마 패드 표면 온도의 검출된 경향이, 연마 유체 조성물에서의 연마 입자들의 농도의 증가 또는 분배된 연마 유체의 감소에 의해 야기될 수 있다는 것을 결정할 수 있다. 인공 지능(AI) 훈련 플랫폼에 의해 수행되는 이전의 및 현재의 분석들에 기초하여, 인공 지능(AI) 훈련 플랫폼은, 증가하는 패드 연마 패드 표면 온도의 검출된 경향이, 연마 시스템들 중 하나 이상에서 발생한 유사한 이전의 검출된 편위들에 기초하여, 연마 유체 조성 물의 배치(batch)의 부적절한 혼합, 또는 처리 용액의 조성을 제어하면서 작업되는 투여 메커니즘에서의 드리프 트에 의해 야기된다는 것을 결정할 수 있다. 다른 예에서, 인공 지능(AI) 훈련 플랫폼은, 카메라 및 하나 이상의 연마 유체 조성 검출 디바이스에 의해 생성된 데이터의 수신 및 기계 학습 AI 모델의 사용에 기초하여, 연마 패드의 표면의 광학 특성에서 의 검출된 드리프트가, 연마 시스템 중 하나 이상에서의 유사한 이전의 검출된 경향들에 기초하여, 패드 컨 디셔닝 디스크의 감소된 유효성(예를 들어, 디스크가 마모되고 있음)에 의해 야기될 수 있다는 것을 결정할 수 있다. 위에서 논의된 바와 같이, 다른 예에서, 인공 지능(AI) 훈련 플랫폼은, 카메라 및 다른 관련 센서들에 의해 생성된 데이터의 수신 및 기계 학습 AI 모델의 사용에 기초하여, 연마 패드의 표면의 하나 이상의 영역에 걸친 유체 적용범위의 검출된 변경이, 연마 시스템들 중 하나 이상에서의 유사한 이전의 검출된 경향 들에 기초하여, 노즐들 중 하나 이상에서의 장애물들, 유체 펌프의 출력의 변동, 및/또는 연마 패드 표면 위의 원하는 위치에 대한 유체 전달 암 위치의 변동에 의해 야기될 수 있다는 것을 결정할 수 있다. 활동에서, 방법은 활동 동안 기계 학습 AI 모델을 사용하여 수행되는 분석에 기초하여 처 리 레시피의 복수의 연마 파라미터들 중 하나 이상을 변경하는 단계를 포함한다. 일 예에서, AI 알고리즘에 의 해 수행되는 분석에 기초하여 변경되는 하나 이상의 연마 파라미터는, 현재의 연마 프로세스 또는 미래의 연마 프로세스 동안 슬러리 조성물의 분배된 양을 조정하는 것, 현재의 연마 프로세스 또는 미래의 연마 프로세스 동 안 분배된 슬러리 조성물의 농도를 조정하는 것, 현재의 연마 프로세스 또는 미래의 연마 프로세스 동안 슬러리 조성물이 분배된 후에 연마 패드의 온도를 조정하는 것, 및/또는 패드 컨디셔닝 프로세스가 시작되거나 정지되 게 하는 것을 포함할 수 있다. 변경되는 복수의 연마 파라미터들 중 하나 이상은 또한, 각각 시스템 제어기 또는 Fab 생산 제어 시스템을 사용하여 AI 알고리즘에 의해 수행되는 분석에 기초하여 하나의 연마 시 스템 또는 복수의 연마 시스템들 상에서 구현될 수 있다. 일 예에서, 증가하는 패드 연마 패드 표면 온도에서의 검출된 경향이, 연마 유체 조성물의 배치의 부적절한 혼 합, 또는 처리 용액의 조성을 제어하면서 작업되는 연마 유체 성분 투여 메커니즘에서의 드리프트에 의해 야기 되는 경우에, 인공 지능(AI) 훈련 플랫폼은 시스템 제어기에게, 또는 시스템 제어기에 연결된 그래 픽 사용자 인터페이스(GUI)의 사용에 의해 사용자에게, 연마 시스템에서 처리되는 현재의 또는 미래의 기판 들에 대해 실행되고 있는 연마 프로세스 레시피에서 하나 이상의 처리 변수를 조정하고/거나 연마 유체 조성물 또는 투여 메커니즘을 교체할 것을 지시할 수 있다. 다른 예에서, 연마 패드의 표면의 광학 특성에서의 검출된 드리프트가, 패드 컨디셔닝 디스크의 감소된 유효성 에 의해 야기되는 경우에, 인공 지능(AI) 훈련 플랫폼은, 시스템 제어기에게, 또는 시스템 제어기 에 연결된 GUI의 사용에 의해 사용자에게, 패드 컨디셔닝 디스크를 교체하고, 연마 패드의 특정 부분들 상에서 의 컨디셔닝 디스크 체류 시간을 조정하고, 그리고/또는 연마 시스템에서 처리되는 현재의 또는 미래의 기 판들에 대해 실행되고 있는 연마 프로세스 레시피에서 하나 이상의 처리 변수를 조정할 것을 지시할 수 있다. 위에서 논의된 바와 같이, 다른 예에서, 연마 패드 표면의 하나 이상의 영역에 걸친 연마 유체의 유동 및/또는 적용범위에서의 검출된 드리프트가 존재하는 경우, 인공 지능(AI) 훈련 플랫폼은, 연마 유체가 연마 패드의 표면에 전달되는 위치를 조정하기 위해 유체 전달 암의 위치를 조정하고, 노즐들 중 하나 이상으로부 터의 연마 유체의 유동의 증가를 야기하고, 패드 냉각 조립체를 사용하여 연마 패드의 온도의 변경을 야기 하고, 노즐들 중 하나 이상으로부터 전달되는 연마 유체 조성물의 조성의 변경을 야기하고, 그리고/또는 연마 시스템에서 처리되는 현재의 또는 미래의 기판들에 대해 실행되고 있는 연마 프로세스 레시피에서 하 나 이상의 처리 변수를 조정하도록 시스템 제어기에 지시할 수 있다. 일부 실시예들에서, 방법은 도 4a-4c에 개략적으로 예시된 바와 같이, 기판의 표면으로부터 물질의 오버버 든을 제거하는 단계를 포함한다. 도 4a는 연마 프로세스 이전의 기판을 예시하고, 기판은 기판 상에 배치된, 하나 이상의 물질 층(401, 402), 예를 들어, 에피택셜(Si) 층 및 질화규소(SiN) 층을 포함한다. 패터 닝된 표면을 형성하기 위해 하나 이상의 물질 층(401, 402)에 복수의 개구부들이 형성된다. 복수의 개구부들을 충전하기 위해, 충전 물질 층, 예를 들어, 산화물 층(SiO2)이, 패터닝된 표면 상에 퇴적된다. 개구부들에 배치된 충전 물질은 복수의 피쳐들(403a), 예컨대, 얕은 트렌치 격리 피쳐들을 형성하고, 충전 물질 층의 오버버든 층(403b)은 연마 프로세스를 이용하여 제거되도록 남아있다. 도 4b는 연마 프로세스를 사용한, 오버버든 층(403b)의 부분적 제거를 예시하고, 도 4c는 오버버든 층(403b)의 완전한 제거 및 패터닝된 표면에 남아 있는 바람직하게 평면인 피쳐들(403a)을 예시한다. 전형적으로, 충전 물질의 오버버든 층(403b)이 기판으로부터 제거(소거)될 때의 기판의 표면에서의 변경들 은 인-시튜 기판 모니터링 시스템을 사용하여 생성된 시계열 데이터에서 검출가능하다. 일부 실시예들에 서, 그러한 변경들은 연마 시스템의 제어기 상에서 실행되고 있는 종료점 알고리즘을 사용하여 검출된다. 종료 점 알고리즘은 STI 또는 금속 다마신 프로세스들에서 기판의 필드 표면으로부터 물질의 오버버든이 소거될 때 연마 프로세스에서의 변경들을 촉발한다. 불행하게도, 그러한 반응성 종료점 검출 방식들은 기판 표면의 과다 연마를 초래할 수 있고, 이는 기판 표면의 피쳐들의 원치 않는 디싱 및 침식을 야기한다. 일부 실시예들에서, AI 알고리즘은 시계열 인-시튜 결과 데이터와 처리 시스템 데이터, 예컨대, 하나 이상의 제어 파라미터에 대한 개별 또는 조합된 시계열 데이터 사이의 함수 관계를 인지하도록 훈련된다.함수 관계는, 물질의 오버버든이 기판 표면과 동시에 대신에 기판 표면으로부터 소거되기 시작하기 전에 연마 종료점의 시간대를 예측하기 위해, 훈련된 AI 알고리즘 및/또는 생성된 기계 학습 AI 모델에 의해 사 용될 수 있다. 예측된 시간대에 기초하여, 더 양호한 국부적 평탄화 성능을 제공하기 위해 연마 패드의 표면에 서의 연마 유체 조성이 변경될 수 있다. 일부 실시예들에서, 활동에서 기계 학습 AI 모델에 기초하여 복수의 연마 파라미터 중 하나 이상을 변경하는 단계는 함수 관계에 기초하여 연마 패드의 표면 상에 배치된 연마 유체의 조성을 변경하는 단계를 포 함한다. 일부 실시예들에서, 연마 유체의 조성을 변경하는 단계는 연마 패드의 표면에 전달되는 개별 연마 유 체 성분의 유량을 시작, 정지, 또는 변경하는 단계를 포함한다. 일부 실시예들에서, 기계 학습 AI 알고리즘을 훈련하는 데 사용되는 훈련 데이터는 도 1b 및 1c에서 이전에 설명된 바와 같이 기판 추적 데이터, 설비 시스템 데이터 및 전기 시험 데이터의 임의의 부분들 또는 조합들을 더 포함한다. 도 5는 연마 시스템들 간의 연마 성능을 매칭하는 방법을 예시하는 도면이다. 활동에서, 방법은, 인공 지능(AI) 훈련 플랫폼에서, 복수의 훈련 데이터 세트들을 포함하는 훈련 데이터를 수신하는 단계를 포함한다. 여기서, 복수의 훈련 데이터 세트들 중 상이한 훈련 데이터 세트들은 연 마 시스템의 연마 스테이션들과 기판 캐리어 조립체들의 상이한 조합들을 사용하여 연마된 기판들에 대응한다. 훈련 데이터 세트들 각각은 연마 시스템을 사용하여 연마된 기판들 각각에 상관된 처리 시스템 데이터를 포함한 다. 여기서, 훈련 데이터 세트들 각각은 연마 레시피 데이터 및 제어 파라미터 데이터를 포함하는 처리 시스템 데이터를 포함한다. 연마 레시피 데이터는 복수의 연마 파라미터들 및 그에 대응하는 복수의 목표 값들을 포함한다. 제어 파라미터 데이터는 하나 이상의 폐루프 제어 시스템의 제어 파라미터들의 시 계열 데이터를 포함한다. 하나 이상의 폐루프 제어 시스템은 대응하는 연마 파라미터들을 그들의 목표 값들에 또는 그 근처에 유지하는 데 사용된다. 활동에서, 방법은 훈련 데이터를 사용하여 기계 학습 AI 알고리즘을 훈련하는 단계를 포함한다. 여 기서, 훈련된 기계 학습 AI 알고리즘은 연마 시스템의 상이한 연마 스테이션들 및/또는 상이한 기판 캐리어 조 립체들 사이의 차이들을 식별하도록 구성된다. 활동에서, 방법은 식별된 차이들에 기초하여 하나 이상의 보정 작용을 구현하는 단계를 포함한다. 일부 실시예에서, 방법은 복수의 연마 시스템에 걸쳐 상이한 기판 캐리어 조립체들 및/또는 상이한 연마 스테이션들 사이의 차이들을 식별하고, 그에 기초하여 하나 이상의 보정 작용을 구현하는 데 사용된다. 유익하게, 본원에 제시된 기계 학습 AI 시스템들 및 AI 알고리즘 훈련 방법들은 진보된 CMP 처리 시스템들의 장 치 및 하위시스템들의 조합된 능력들을 더 잘 이해하고 그 이점을 취하는 데 사용될 수 있고, 개선된 연마 결과 들, 바람직하게 더 넓은 프로세스 윈도우들, 및 개선된 연마 시스템 처리 균일성을 초래한다. 전술한 내용은 본 개시내용의 실시예들에 관한 것이지만, 본 개시내용의 다른 그리고 추가적인 실시예들은 그의 기본 범위로부터 벗어나지 않고 안출될 수 있으며, 그의 범위는 후속하는 청구항들에 의해 결정된다.도면 도면1a 도면1b 도면1c 도면1d 도면2a 도면2b 도면2c 도면3 도면4a 도면4b 도면4c 도면5"}
{"patent_id": "10-2023-7003427", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 개시내용의 위에서 언급된 특징들이 상세히 이해될 수 있도록, 위에 간략히 요약된 본 개시내용의 더 구체적 인 설명이 실시예들을 참조하여 이루어질 수 있으며, 이들 중 일부는 첨부 도면들에 예시되어 있다. 그러나, 본 개시내용은 동등한 효과의 다른 실시예들을 허용할 수 있기 때문에, 첨부 도면들은 본 개시내용의 전형적인 실시예들만을 예시하고 그러므로 본 개시내용의 범위를 제한하는 것으로 간주되어서는 안 된다는 점에 주목해야 한다. 도 1a는 바람직하지 않게 열악한 국부적 평탄화 성능을 나타내는 기판의 부분의 개략적인 단면도이다. 도 1b는 반도체 디바이스 제조 설비(Fab)의 개략도이다. 도 1c는 본원에 제시된 방법들과 함께 사용될 수 있는, 일 실시예에 따른, 기계 학습 인공 지능(AI) 훈련 시스 템의 개략도이다. 도 1d는 본원에 설명된 연마 시스템들과 함께 사용될 수 있는 예시적인 폐루프 피드백 제어 시스템의 개략도이 다. 도 2a는 본원에 제시된 방법들을 수행하는 데 사용될 수 있는, 일 실시예에 따른, 예시적인 연마 시스템의 개략 적인 측단면도이다. 도 2b는 예시적인 기판 캐리어의 개략적인 측단면도이다. 도 2c는 상이한 시점에서 도시된, 도 2a의 연마 시스템의 개략적인 측단면도이다. 도 3은, 일 실시예에 따른, 기판을 연마하는 방법을 예시하는 도면이다. 도 4a-4c는 본원에 제시된 방법들에 따라 수행되는 연마 프로세스의 상이한 스테이지들을 예시하는 기판의 개략 적인 단면도들이다. 도 5는 일 실시예에 따른, 상이한 연마 시스템들 간의 성능을 매칭하기 위한 방법을 예시하는 도면이다. 이해를 용이하게 하기 위해, 가능한 경우, 도면들에 공통된 동일한 요소들을 지시하는 데에 동일한 참조 번호들 이 사용되었다. 일 구현의 요소들 및 특징들이 추가의 언급 없이 다른 구현들에 유익하게 통합될 수 있다는 것 이 고려된다."}
