{"patent_id": "10-2022-0175112", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0091063", "출원번호": "10-2022-0175112", "발명의 명칭": "스마트 기저귀 시스템", "출원인": "주식회사 메디로지스", "발명자": "장금용"}}
{"patent_id": "10-2022-0175112", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "스마트 기저귀(2)와; 스마트 기저귀(2)로부터 전송된 데이터를 인공지능에 의하여 분석하여 배변 및 배뇨여부, 자세에 따른분출방향, 흡수면적을 연산하여 전송하는 중계기(3)와; 중계기(3)에서 전송된 데이터를 저장하고, 기저귀(2) 교체 알람을 전송하고, 실시간 정보를 모니터에 표출하는관리부(7)와;중계기(3)에서 전송된 데이터를 분석하여 개인별 배뇨 및 배변 패턴을 정의하는 서버(5)를 포함하며,스마트 기저귀(2)는, 기저귀 본체(17)와; 기저귀 본체(17)에 X축 및 Y축 방향으로 배치되어 배뇨 및 배변시 전류량이 변화되는 패턴센서(20,21,22,23)와; 자세를 감지하는 자이로 센서(16)와; 그리고패턴센서(20,21,22,23) 및 자이로 센서(16)로부터 배변 및 배뇨신호를 접수하고 중계기(3)에 전송하는 단말기(4)를 포함하며,패턴센서(20,21,22,23)는 기저귀 본체(17)의 표면에 편평한 형상으로 배치되며 서로 일정 간격 떨어지도록 배치되는 제 1 및 제 2센서(20,21)와;기저귀 본체(17)의 저면에 편평한 형상으로 배치되며 서로 일정 간격 떨어지도록 배치되는 제 3 및 제 4센서(22,23)를 포함하는 스마트 기저귀 시스템."}
{"patent_id": "10-2022-0175112", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,단말기(4)는 제 1 내지 제 4센서(20,21,22,23)의 복수개 단부(32,34,36,38,40,42,44,46)로 부터 전류값이 입력되는 입력모듈(50)과; 입력된 복수개의 전류값을 정상값과 비교하여 변화량을 산출하는 산출모듈(52)과; 산출된변화량이 수평방향으로 배치된 센서(20,21)들의 변화량인지, 혹은 깊이 방향으로 배치된 센서(22,23)들의 변화량인지 여부를 판단하여 중계기로 전송하는 판단모듈(54)을 포함하는 스마트 기저귀 시스템."}
{"patent_id": "10-2022-0175112", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "항에 있어서,연산모듈(25)은 배뇨 혹은 배변량이 소량으로 판단되면, 배변 혹은 배변이 있는 구역으로 연결된 전도성 와이어에 소정의 전류를 인가함으로써 해당 부분을 건조시키는 스마트 기저귀 시스템(1)."}
{"patent_id": "10-2022-0175112", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1항에 있어서,제 1 및 제 2센서(20,21)와 제 3 및 제 4센서(22,23)의 사이에 제 1 및 제 2센서(20,21)와 동일한 형상의 센서를 제 1 및 제 2센서(20,21)에 대하여 90도 각도로 전환하여 배치하고, 그 단부를 단말기(4)에 연결함으로써 기저귀를 Z축 방향으로 복수개 구역으로 감지하여 배뇨 혹은 배변을 감지하는 스마트 기저귀 시스템(1).공개특허 10-2023-0091063-3-청구항 5"}
{"patent_id": "10-2022-0175112", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 스마트 기저귀 시스템에 관한 것이다. 그러한 스마트 기저귀 시스템은, 스마트 기저귀와; 스 마트 기저귀로부터 전송된 데이터를 인공지능에 의하여 분석하여 배변 및 배뇨 여부, 악취여부, 측정값 보정 을 실시하여 전송하는 중계기와; 중계기에서 전송된 데이터를 저장하고, 판단한 후 데이터를 서버에 전 송하는 관리부와; 관리부와 연동하여 데이터를 분석하는 서버와; 서버 및 관리부와 네트워크망을 통하여 연결됨으로써 데이터를 송수신할 수 있는 모바일 기기(M)를 포함한다."}
{"patent_id": "10-2022-0175112", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 스마트 기저귀 시스템에 관한 것으로서, 보다 상세하게는 기저귀에 배변 및 배뇨를 감지할 수 있는 센서를 기저귀 표면 및 저면에 복수개를 입체적으로 배치하여 배변 및 배뇨 데이터를 측정하고, 측정된 데이터 를 인공지능에 의하여 분석함으로써 배변 및 배뇨의 인식도를 높일 수 있는 기술에 관한 것이다."}
{"patent_id": "10-2022-0175112", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 기저귀는 배변 혹은 배뇨를 받아 내기 위하여 다리 사이에 채우는 물건을 의미한다. 이러한 기저귀 는 유아, 고령자, 환자, 신체 장애자 등이 주로 사용하며, 일회용 기저귀, 실금용 기저귀, 트레이닝 기저귀 등 이 있다. 그리고, 이러한 기저귀는 환자와 같이 자력으로의 배설 행위가 곤란한 사람에 대해 그 배설 물을 누설하지 않고 유지 흡수함으로써, 배설 등을 위한 보조구로서 또는 간호용 위생품으로서 사용되고 있다. 따라서, 배변 혹은 배뇨는 사용자의 건강 상태를 파악하는 중요한 자료가 될 수 있는 바, 배변 혹은 배뇨를 자 동으로 감지할 수 있는 기저귀가 제안되고 있다. 그 일예로서 특허출원 10-2016-0021391호에 스마트 기저귀가 제시되는 바, 본 기술에서는 기저귀에 필름형 감지 케이블을 배치하여 대소변을 감지한다. 이러한 종래 스마트 기저귀는 필름형 감지 케이블이 편평하게 배치됨으로써 배뇨 혹은 배변여부를 기저귀 표면 에서만 감지할 수 있고, 기저귀 내부로 스며든 배뇨 혹은 배변은 감지할 수 없어서 감지 정확도가 떨어지는 문 제점이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 특허출원 제10-2016-0021391호(명칭: 스마트 기저귀)"}
{"patent_id": "10-2022-0175112", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 본 발명은 이와 같은 문제점을 해결하기 위하여 안출된 것으로서, 본 발명의 목적은, 기저귀에 배변 및 배뇨를 감지할 수 있는 센서를 기저귀 표면 및 저면에 복수개를 입체적으로 배치하여 배변 및 배뇨 데이터를 측 정하고, 측정된 데이터를 인공지능에 의하여 분석함으로써 배변 및 배뇨의 인식도를 높일 수 있는 스마트 기저 귀 시스템을 제공하는 것이다."}
{"patent_id": "10-2022-0175112", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 목적을 달성하기 위하여, 본 발명의 일 실시예에 따른 스마트 기저귀 시스템은, 스마트 기저귀와; 스마트 기저귀로부터 전송된 데이터를 인공지능에 의하여 분석하여 배변 및 배뇨여부, 자세에 따른 분출방향, 흡수면적을 연산하여 전송하는 중계기와; 중계기에서 전송된 데이터를 저장하고, 기저귀 교체 알람을 전송하고, 실시간 정보를 모니터에 표출하는 관리부와; 중계기에서 전송된 데이터를 분석하여 개인별 배뇨 및 배변 패턴을 정의하는 서버를 포함하며, 스마트 기저귀는, 기저귀 본체와; 기저귀 본체에 X축 및 Y축 방향으로 배치되어 배뇨 및 배변시 전류량이 변화되는 패턴센서(20,21,22,23)와; 자세를 감지하는 자이로 센서와; 그리고 패턴센서(20,21,22,23) 및 자이로 센서로부터 배변 및 배뇨신호를 접수하고 중계기에 전송하는 단말기 를 포함하며, 패턴센서(20,21,22,23)는 기저귀 본체의 표면에 편평한 형상으로 배치되며 서로 일정 간격 떨어지도록 배치 되는 제 1 및 제 2센서(20,21)와; 기저귀 본체의 저면에 편평한 형상으로 배치되며 서로 일정 간격 떨어지도록 배치되는 제 3 및 제 4센서 (22,23)를 포함한다. 본 발명의 다른 실시예는, 기저귀 본체와; 기저귀 본체에 입체적으로 배치되어 배뇨 및 배변시 전류량이 변화되는 패턴센서(20,21,22,23)와; 자세를 감지하는 자이로 센서와; 그리고 패턴센서(20,21,22,23) 및 자이로 센서로부터 배변 및 배뇨신호를 접수하고 전송하는 단말기를 포함하며, 패턴센서(20,21,22,23)는 기저귀 본체의 표면에 편평한 형상으로 배치되며 서로 일정 간격 떨어지도록 배치 되는 제 1 및 제 2센서(20,21)와; 기저귀 본체의 저면에 편평한 형상으로 배치되며 서로 일정 간격 떨어지도록 배치되는 제 3 및 제 4센서 (22,23)를 포함한다"}
{"patent_id": "10-2022-0175112", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기한 바와 같이 본 발명의 일 실시예에 따른 스마트 기저귀 시스템은 다음과 같은 효과가 있다. 첫째, 기저귀에 구비되는 지그재그 형상의 패턴센서를 기저귀 표면 및 저면에 X,Y축 방향으로 복수개를 입체적 으로 배치하여 배변 혹은 배뇨를 감지함으로써 기저귀 표면 뿐만 아니라 깊이방향으로도 감지하고, 이를 단말기 에 의하여 배뇨의 자세, 분출방향에 따라 정확한 배변 및 배뇨 여부를 판단할 수 있다. 둘째, 기저귀에 배변 및 배뇨를 감지할 수 있는 온습도 및 가스(Gas) 등의 센서를 배치하여 배변 및 배뇨 데이 터를 실시간으로 측정하고, 측정된 데이터를 인공지능에 의하여 분석함으로써 배변 및 배뇨의 인식도를 높일 수 있다. 셋째, 기저귀 내의 온도와 가스를 감지한 측정값을 일정 시간 동안 저장하고, 저장된 값의 산술평균값과 이동평 균값을 구한 후 그래프를 작성하며, 이 그래프를 실험을 통해 얻어진 표준분포 특성 곡선과 비교하여 변화요인 을 특정함으로써 실제 배변 및 배뇨를 파악할 수 있다. 넷째, 착용자의 기저귀 교체 직전의 실시간 그래프를 저장하여 오류 요인별 특성곡선을 보정하여 개인별 편차를 최소화 할 수 있다. 다섯째, 배변 시 일정 시간 동안 배뇨가 감지되는지 여부를 판단한 후, 배뇨가 감지되면 센서의 측정값이 배변 범위 이내인 경우 외부에 알림으로써 정확도를 높일 수 있다."}
{"patent_id": "10-2022-0175112", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명에 따른 스마트 기저귀 시스템을 첨부된 도면을 참조하여 상세하게 설명한다. 도 1 내지 도 9에 도시된 바와 같이, 본 발명이 제안하는 스마트 기저귀 시스템은, 배뇨 및 배변을 감지할 수 있는 패턴센서가 입체적으로 구비되는 스마트 기저귀와; 스마트 기저귀로부터 전송된 데이터에 의하여 배변 및 배뇨여부, 자세에 따른 분출방향, 흡수면적을 연산하여 전송하는 중계기와; 중계기에서 전송된 데이터를 저장하고, 기저귀 교체 알람을 전송하고, 실시간 정보를 모니터에 표출하는 관리부와; 중계기 에서 전송된 데이터를 분석하여 개인별 배뇨 및 배변 패턴을 정의하는 서버와; 서버 및 관리부와 네트워크망을 통하여 연결됨으로써 데이터를 송수신할 수 있는 모바일 기기(M)를 포함한다. 이러한 스마트 기저귀는 입체적으로 배치되어 배변 혹은 배뇨를 감지할 수 있는 패턴센서(20,21,22,23)와, 온도, 습도, 수소, 가스, 전류를 감지할 수 있는 센서를 구비함으로써 전류 및 온습도의 변화량을 측정하고, 중계기에 탑재된 인공지능에 의하여 분석함으로써 배뇨 및 배변의 감지 정확도를 향상시킬 수 있 다. 보다 상세하게 설명하면, 스마트 기저귀는, 기저귀 본체와; 기저귀 본체에 입체적으로 배치되어 배뇨 및 배변시 전류량이 변 화되는 패턴센서(20,21,22,23)와; 온도, 습도, 수소, 가스를 감지하는 센서와, 자세를 감지하는 자이로 센 서를 구비하고, 센서, 자이로 센서, 패턴센서(20,21,22,23)로부터 배변 및 배뇨신호를 접수하고 연 산한 후 그 결과를 중계기로 송수신하는 단말기를 포함한다. 이러한 구조를 갖는 스마트 기저귀에 있어서, 패턴센서(20,21,22,23)는 좌우로 한 쌍이 배치되고, 상하로 한 쌍이 배치됨으로써 입체적으로 배치된다. 즉, 패턴센서(20,21,22,23)는 기저귀 본체의 표면에 편평한 형상으로 배치되며 서로 일정 간격 떨어지도록 배치되는 제 1 및 제 2센서(20,21)와, 기저귀 본체의 저면에 편평한 형상으로 배치되며 서로 일정 간격 떨 어지도록 배치되는 제 3 및 제 4센서(22,23)를 포함한다. 이러한 제 1 내지 제 4센서(20,21,22,23)는 동일한 형상을 갖는 바, 전도성 패턴이 지그재그 형상으로 배치된 구조를 갖는다. 이때, 전도성 패턴은 다양한 방식으로 구현될 수 있는 바, 예를 들면 전도성 와이어를 기저귀 본체의 표면 에 배치하거나, 전도성 카본잉크를 기저귀 본체의 표면에 인쇄방식에 의하여 구현할 수 있다. 그리고, 제 1 및 제 2센서(20,21)는 한 쌍의 전도성 와이어(24,26)로 구성되었으며, 단부(32,34,36,38)는 단말 기에 연결됨으로써 전류를 인가하거나 변화량을 감지할 수 있다. 따라서, 스마트 기저귀를 착용한 상태에서 배변 혹은 배뇨시 패턴센서(20,21,22,23)에 대소변이 접촉하게 되 고, 대소변은 전해질이므로 제 1 및 제 2패턴(20,21)을 흐르는 전류량이 변동하게 된다. 그리고 전류량은 단말기로 전송됨으로써 전류량 감지센서에 의하여 변화량이 측정될 수 있다. 이때, 제 1 및 제 2센서(20,21)는 복수개가 배치됨으로써 기저귀를 X축 방향으로 복수 구역으로 구분할 수 있어 서 배변 및 배뇨 지점을 보다 명확히 특정할 수 있다. 그리고, 제 3 및 제 4센서(22,23)도 한 쌍의 전도성 와이어(28,30)로 구성되며, 단부(40,42,44,46)가 제 1 및 제 2센서(20,21)와 동일하게 단말기에 연결됨으로써 전류를 인가하거나 변화량을 감지할 수 있다. 즉, 스마트 기저귀를 착용한 상태에서 배변 혹은 배뇨시 기저귀 본체에 침입하여 저면에 도달한 배변 혹 은 배뇨가 제 3 및 제 4센서(22,23)에 접촉하게 되고, 대소변은 전해질이므로 제 3 및 제 4패턴(22,23)을 흐르 는 전류량이 변동하게 된다. 그리고 전류량은 단말기로 전송됨으로써 변화량이 연산될 수 있다. 이때, 제 3 및 제 4센서(22,23)는 복수개가 배치됨으로써 기저귀를 Y축 방향으로 복수 구역으로 구분할 수 있어 서 배변 및 배뇨 지점을 보다 명확히 특정할 수 있다. 상기에서는 제 1 내지 제 4센서(20,21,22,23)를 4개의 구역으로 구분하였지만, 본 발명은 이에 한정되는 것은 아니고 제품 설계 환경에 따라 임의 구역으로 구분할 수 있다. 또한, 제 1 및 제 2센서(20,21)와 제 3 및 제 4센서(22,23)의 사이에 제 1 및 제 2센서(20,21)와 동일한 형상 의 센서를 제 1 및 제 2센서(20,21)에 대하여 90도 각도로 전환하여 배치하고, 그 단부를 단말기에 연결할 수도 있다. 이 경우, 기저귀를 Z축 방향으로 복수개 구역으로 감지하여 배뇨 혹은 배변을 감지할 수 있다. 결과적으로, 기저귀를 X,Y,Z축 방향으로 구획화함으로써 배뇨 혹은 배변을 입체적으로 감지할 수 있다. 상기에서는 전도성 와이어로 설명하였지만, 전류가 인가되고, 변동량을 감지할 수 있는 형태라면 모두 포함가능 하다. 한편, 단말기는 제 1 내지 제 4센서(20,21,22,23)의 복수개 단부(32,34,36,38,40,42,44,46)로 부터 전류값 이 입력되는 입력모듈과; 입력된 복수개의 전류값을 정상값과 비교하여 변화량을 산출하는 산출모듈과; 산출된 변화량이 수평방향으로 배치된 센서(20,21)들의 변화량인지, 혹은 깊이 방향으로 배치된 센서(22,23)들 의 변화량인지 여부를 판단하여 중계기로 전송하는 판단모듈과, 전원 공급부(도시안됨)를 포함한다. 이러한 단말기에 있어서, 제 1 내지 제 2센서(20,21,22,23)를 좌우 상하로 배치하여 기저귀를 복수 구역으로 구분한 이유는, 기저귀 표면 의 배변 혹은 배뇨량과 기저귀 내부에 스며든 배변 혹은 배변량을 정확하게 파악하기 위함이다. 또한, 기저귀 착용자의 성별과 자세에 따라 소변의 분산 방향과 확산방향에 있어서 차이가 있고, 또한 기저귀 의 흡수제가 젖어있을 때와 젖지 않았을 때의 배뇨량별 흡수면적이 다르기 때문에 이를 반영하여 배뇨량을 정확하게 산출하기 위하여 상하좌우의 복수개 구역으로 구분하여 감지한다. 이와 같이 단말기에 의하여 연산된 전류의 변동량값과, 감지된 센서의 식별 데이터가 디지털값으로 변환된 후 중계기로 전송되어 분석된다. 그리고, 배뇨는 착용자의 자세에 따라 확산면적에 있어서 전류량이 차이가 있는 바, 이를 적용할 필요가 있다. 즉, 본 발명에서는 착용자의 자세를 아래와 같이 8가지로 구분하였다. 표 1"}
{"patent_id": "10-2022-0175112", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "상기 표에서 사각형 모형은 착용자를 의미하고, 화살표는 소변이 분사되는 방향을 의미한다. 즉, 180도인 경우에는 착용자가 기저귀를 착용한 상태에서 바닥을 향하여 엎드린 상태를 의미하고, 0도 인 경우에는 천정을 향하여 누운 상태를 의미하며, 90도 인 경우에는 모로 누운 상태를 의미한다. 이때, 누운 각도 는 자이로 센서에 의하여 감지될 수 있다. 이와 같이 자세에 따라 소변의 분출방향이 다르고, 이에 따라 패턴센서(20,21,22,23)의 감지구역 및 흡수면적이 차이가 있다. 각 자세별로 전류량을 측정한 결과 아래와 같이 측정되었다. 표 2 자세 1 2 3 4 5 6 7 8 전류량(mA)10.312 12.7 12 15 12.71211.7 상기 측정값에 있어서, 흡수 단위면적은 0.1㎠이고 최대 전류측정값은 15㎃로 설정하였다. 전자인식 패턴센서 (20,21,22,23)의 두 전극 사이에 흐르는 전류량은 흡수면적에 비례한다.측정결과 자세 180도 일때 최대 전류측 정값이 15mA로 측정되었다. 그리고, 기저귀의 패턴센서(20,21,22,23)는 소변이 패턴에 접촉하는 면적에 비례하여 전류량이 증가하므로 측정된 실시간 전류의 변화량을 저장하고 적산값을 산출하여 배뇨량을 검출한다. 그리고, 본 발명에서는 성별에 따른 패턴의 감지구역 차이와 시간이 지연됨에 따라 배뇨량별 흡수면적이 변화하 는 차이를 아래 표3과 같이 데이터베이스로 만들어 보정값을 적용시켰다. 표 3"}
{"patent_id": "10-2022-0175112", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "데이터베이스의 크기는 배뇨량(10cc 단위) 60 x 성별 2 x 자세 8 x 지연시간 6 x 흡수회차 5 = 28,800 cell 이 다. 그리고, 각 cell에는 소변과 유사한 염도의 염수를 100회에 걸쳐 시험한 전류 측정값의 평균치를 저장하고 실시 간 측정되는 전류값을 데이터베이스와 비교하여 배뇨량을 추출한다. 또한 기저귀의 흡수제가 젖어있지 않을 때와 젖어 있을 때의 배뇨량별 흡수면적의 차이도 보정 요소로 적용하였다. 배뇨량은 10cc 단위로 실험을 진행하였고 흡수회차는 5회 배뇨시 기저귀를 교체한다고 가정했다. 그리고, 기저귀는 밀폐상태를 유지하고 소변 흡수제는 흡수된 소변이 밖으로 배출되지 않는 다공물질로 만들 어지기 때문에 소변량에 따라 흡수제가 젖는 면적은 항상 일정하며 확산 속도도 일정하다. 한편, 본 발명에서는 즉, 패턴센서(20,21,22,23)를 기저귀 본체의 표면에 편평한 형상으로 배치되는 제 1 및 제 2센서(20,21)와, 기저귀 본체의 저면에 배치되는 제 3 및 제 4센서(22,23)로 구성함으로써 배변 혹은 배뇨를 기저귀 표면에서 저면 사이 공간에서 효과적으로 감지할 수 있다. 즉, 기저귀 본체에만 패턴센서가 배치되는 경우, 기저귀 표면의 배변 혹은 배뇨만을 감지할 수 있고, 기저 귀 내부에 침투한 배변 혹은 배뇨는 감지하기 어려운 바, 본 발명에서는 제 1 및 제 2센서(20,21)는 기저귀 표 면에 배치하여 표면의 배변 혹은 배뇨를 감지할 수 있고, 제 3 및 제 4센서(22,23)는 기저귀 저면에 배치함으로 써 기저귀에 스며든 배변 혹은 배뇨도 감지할 수 있다. 그리고, 산출모듈에 의하여 감지된 전류량과 기준 전류량을 비교함으로써 변화량을 산출할 수 있다. 그리고, 판단모듈은 전류의 변동이 감지된 센서가 기저귀 표면의 제 1 및 제 2센서(20,21)인지, 혹은 기저 귀 저면의 제 3 및 제 4센서(22,23)인지를 판단한다.한편, 여름철이나 고열 환자의 경우 기초 체온이 높아 땀으로 인한 편차가 발생할 수 있어 측정된 기저귀 내 의 온도와 습도를 기준으로 보정값을 적용하여 편차를 최소화 한다. 이러한 보정값 보정은 중계기의 연산모 듈에 의하여 연산될 수 있다. 그리고 상기한 바와 같은 자세별 소변의 분출방향, 감지구역 및 흡수면적의 차이, 성별에 따른 패턴의 감지구역 차이와 시간이 지연됨에 따라 배뇨량별 흡수면적이 변화하는 차이, 흡수제에 따른 보정값 적용은 후술하는 중계 기의 연산모듈에 의하여 연산될 수 있다. 한편, 기저귀에 구비된 센서는 다양한 종류의 성분을 감지하여 단말기로 전송하는 바, 예를 들면 온도, 습도, 가스, 암모니아, 수소를 감지함으로써 대변, 방귀, 생리, 악취, 방향제의 냄새를 감지한다. 그리고, 측정된 값은 단말기로 전송되어 디지털값으로 변환된다. 온도 센서는 소자가 온도에 따라 전기 특성이 변하는 성질을 이용하여 온도를 감지하는 방식이다. 이러한 온도 센서는 열전쌍, 온도측정 저항체, 서미스터(NTC), 금속식 온도계, 서미스터(NTC, PTC, CTR, PIR, TIR) 감온 페 라이트 방식 등 다양한 방식의 온도센서가 사용될 수 있다. 습도센서는 다공질 세라믹스나 고분자막으로 흡수됨으로써 일어나는 전기저항이나 정전용량의 변화를 이용하는 방식과, 진동자에 설치한 흡수 물질의 중량변화에 의한 진동자의 공진주파수의 변화를 이용하는 방식 등 다양한 종류의 습도센서가 사용될 수 있다. 가스 센서는 암모니아 농도를 측정하는 센서로서, 암모늄 이온 선택성막 혹은 암모니아 가스 투과성막과 복합형 수소 이온 전극으로 구성된다. 막을 확산해 오는 암모늄 이온 혹은 암모니아 가스에 의하여 생기는 수소 이온 농도의 변화를 수소 이온 전극으로 측정함으로써 암모니아 농도를 측정할 수 있다. 그리고, 자이로 센서(Gyro Sensor;16)는 각속도를 측정함으로써 체위를 감지할 수 있다. 이러한 센서에 의하여 측정된 결과값들은 단말기에서 디지털값으로 변환된 후 중계기로 전송되어 분 석된다. 즉, 중계기는 센서의 측정값들을 수신한 후 인공지능에 의하여 배변 및 배뇨 여부, 악취여부, 자세에 따 른 분출방향, 흡수면적 등을 판단하게 되고, 또한 필요에 따라 측정값의 보정을 실시한다. 예를 들면, 측정된 온도, 습도, 암모니아의 농도가 미리 설정된 테이블값과 비교하여 정상 범위를 벗어난 경우, 배변, 배뇨, 악취 상태로 판단하게 된다. 보다 상세하게 설명하면, 중계기는 단말기로부터 센서의 측정값들을 수신하는 수신모듈과; 수신된 측 정값들을 인공지능에 의하여 분석하여 배변, 배뇨, 악취여부를 입체적으로 판단하는 연산모듈과; 연산된 결 과에 의하여 그래프를 도시하는 그래픽 모듈과; 연산된 결과를 서버 및 관리부에 전송하는 출력모듈 을 포함한다. 이러한 중계기에 있어서, 수신모듈은 단말기, 온도센서, 습도센서, 암모니아 센서, 전류센서, 가스센서로부터 전송된 측정값들을 수신하게 되며, 자이로 센서로부터는 착용자의 자세에 대한 각도 데이터를 수신한다. 그리고, 연산모듈은 단말기로부터 수신된 각각의 데이터를 분석하여 기저귀 표면의 제 1 및 제 2센서 (20,21)에 의하여 감지된 배뇨 혹은 배변의 면적과, 기저귀 저면의 제 3 및 제 4센서(22,23)에 의하여 감지된 배뇨 혹은 배변의 면적을 비교하여 연산하고, 이를 착용자의 자세에 따라 구분하여 적용함으로써 기저귀에 스며 든 배뇨 혹은 배변량을 파악할 수 있다. 예를 들면, 제 1 및 제 2센서(20,21)에만 전류값이 변동되고, 제 3 및 제 4센서(22,23)에는 전류값이 변동되지 않은 경우 배뇨 혹은 배변이 기저귀의 표면에만 잔류하는 것으로 판단할 수 있다. 반면, 제 1 및 제 2센서(20,21)와, 제 3 및 제 4센서(22,23)의 전류값이 모두 변동된 경우 배뇨 혹은 배변이 기 저귀의 표면 뿐만 아니라 내부에도 침입한 것으로 판단할 수 있다. 이러한 연산과정은 딥러닝 프로그램 등의 프로그램에 의하여 진행되는 바, 딥러닝은 컴퓨터가 여러 데이터를 이 용해 인간처럼 스스로 학습할 수 있게 하기 위해 인공 신경망(ANN: artificial neural network)을 기반으로 구 축한 한 기계 학습방법이다.인공 신경망을 이용하면 온도, 습도, 가스, 자세, 전류량과 같은 배변, 배뇨 관련 데이터의 분류 (classification) 및 군집화(clustering)가 가능한 바, 분류나 군집화를 원하는 데이터 위에 여러 가지 층 (layer)을 얹어서 판단을 실시할 수 있다. 즉, 인공 신경망은 입력층, 다수의 노드, 출력층으로 구성된다. 이러한 인공 신경망은 온도, 습도, 가스, 자세 각도, 전류량, 소변 분출방향 데이터의 형상 특징을 추출하고 그 특징을 다시 다른 기계학습 알고리즘의 입력값 으로 사용하여 형상 별로 분류나 군집화를 함으로써 배뇨, 배변 여부를 입체적으로 판단할 수 있다. 이러한 인공 신경망은 심층 신경망을 포함하는 바, 심층 신경망은 신경망 알고리즘 중에서 여러 개의 층으로 이 루어진 신경망을 의미한다. 즉, 인공 신경망은 다층으로 구성되는 바, 각각의 층은 여러 개의 노드로 구성되고, 각 노드에서는 실제로 형상 을 분류하는 연산이 일어나며, 이 연산 과정은 인간의 신경망을 구성하는 뉴런에서 일어나는 과정을 모사하도록 설계된다. 노드는 일정 크기 이상의 자극을 받으면 반응을 하는데, 그 반응의 크기는 입력 값과 노드의 계수(또는 가중치, weights)를 곱한 값과 대략 비례한다. 일반적으로 노드는 여러 개의 입력을 받으며 입력 갯수만큼의 계수를 갖는다. 따라서, 이 계수를 조절함으로써 여러 입력에 서로 다른 가중치를 부여할 수 있다. 최종적으로 곱한 값들은 전부 더해지고 그 합은 활성 함수(activation function)의 입력으로 들어가게 된다. 활 성 함수의 결과가 노드의 출력에 해당하며 이 출력값이 궁극적으로 분류나 회귀 분석에 쓰인다. 각 층은 여러 개의 노드로 이루어지며 입력값에 따라 각 노드의 활성화/비활성화 여부가 결정된다. 이때, 입력 데이터는 첫 번째 층의 입력이 되며, 그 이후엔 각 층의 출력이 다시 다음 층의 입력이 되는 방식이다. 모든 계수는 데이터의 형상 학습 과정에서 계속 조금씩 변하는데, 결과적으로 각 노드가 어떤 입력을 중요하게 여기는지를 반영한다. 그리고 신경망의 학습(training)은 이 계수를 업데이트하는 과정이다. 중계기의 연산모듈은 이러한 과정을 통하여 온도, 습도, 가스, 자세 각도, 전류량, 소변 분출각도 데이 터를 연산함으로써 배변 혹은 배뇨 여부를 기저귀의 표면과 저면 사이 공간에서 입체적으로 판단할 수 있다. 즉, 연산모듈은 제 1 및 제 2센서(20,21)의 전류 변동량에 의하여 X축 방향으로 배변 및 배뇨 지점을 보다 명확히 특정할 수 있고, 제 3 및 제 4센서(22,23)의 전류 변동량에 의하여 Y축 방향으로 배변 및 배뇨 지점을 보다 명확히 특정할 수 있고, 이러한 데이터에 자세 데이터를 적용함으로써 변뇨 혹은 배변량을 입체적으로 연 산할 수 있다. 이와 같이, 기저귀의 배변 혹은 배뇨량을 입체적으로 정확하게 파악할 수 있어서, 기저귀의 교체를 적기에 실시 하고, 불필요한 교체를 방지할 수 있다. 그리고, 연산모듈은 기저귀 내의 온도와 가스를 감지한 측정값을 일정 시간 동안 저장하는 바, 예를 들 면 10초 간격으로 60개의 측정값을 데이터 테이블에 저장한다. 그리고, 저장된 값의 산술평균값과 이동평균값을 구한 다음 그래픽 모듈에 의하여 도 8에 도시된 바와 같이 그래프를 작성한다. 즉, 순시 측정값과 산술평균값의 차이인 Δx가 산술평균값의 20%를 초과하면 기저귀 내에 변화가 발생한 것 이므로 측정주기를 1초 간격으로 조정하여 측정 데이터를 저장하고, 산술평균값과 이동평균값을 구한 다음 실시 간 그래프를 작성한다. 그리고, 실험을 통해 얻어진 대변, 방귀, 생리, 악취, 방향제의 표준분포 특성 곡선과 실시간 그래프를 비교하 여 변화요인을 특정한다. 따라서, 이와 같은 변화요인을 특정함으로써 실제로 배변 및 배뇨가 이루어졌는지 여부를 보다 정확하게 파악할 수 있다. 그리고, 스마트 기저귀 착용자의 기저귀 교체 직전의 실시간 그래프를 데이터 베이스에 저장하여 오류 요인 별 특성곡선을 보정하여 개인별 편차를 최소화 할 수 있다. 그리고, 용변 특성상 배변 시 배뇨를 동반하기 때문에 배변이 특정되어도 배뇨가 감지되지 않으면 30초간 데이 터를 재확인하여 배변을 특정하도록 한다. 배변이 특정되면 즉시 출력모듈을 통하여 알림 신호를 출력하고, 배뇨량은 개인별 설정치에 도달했을때 알 람을 출력한다. 그리고, 상기 수신모듈과, 연산모듈과, 그래픽 모듈과, 출력모듈은 CPU(Central Processing Unit)와 같이 명령어를 해독하고 실행하는 장치로 제어장치, 연산장치, 레지스터들로 구성된다. 한편, 연산모듈은 배뇨 혹은 배변량이 소량으로 판단되면, 즉 기저귀 교체가 필요하지 않은 정도라고 판단 되면 배변 혹은 배변이 있는 구역으로 연결된 전도성 와이어에 소정의 전류를 인가함으로써 해당 부분을 건조시 킬 수도 있다. 이때, 전도성 와이어와 별도로 열선을 배치할 수도 있다. 한편, 서버는 중계기 및 관리부로부터 전송된 데이터를 분석하여 개인별 배뇨 및 배변 패턴을 정의하 고, 간호사, 보호자에 전송한다. 이러한 서버는 통상적인 서버를 의미하는 바, 서버 프로그램이 실행되고 있는 컴퓨터 하드웨어로서, 프린터 제어나 파일 관리 등 네트워크 전체를 감시, 제어하거나, 메인프레임이나 공중망을 통한 다른 네트워크와의 연 결, 데이터, 프로그램, 파일 같은 소프트웨어 자원이나 모뎀, 팩스, 프린터 공유. 기타 장비 등 하드웨어 자원 을 공유할 수 있도록 지원한다. 상기에서는 중계기에서 데이터를 인공지능에 의하여 분석하여 배변 및 배뇨 여부, 악취여부, 측정값 보정을 실시하여 전송하는 기능을 수행하는 것으로 설명하였지만, 본 발명은 이에 한정되는 것은 아니고 서버에서도 이러한 기능을 수행할 수 있다. 관리부는 중계기로부터 수신된 측정값을 저장하고, 판단정보에 따라 요양사에게 기저귀 교체 알람을 모바일로 전송하고, 간호사가 인지할 수 있도록 실시간 정보를 모니터에 표출하며, 모든 자료를 서버로 전송 한다. 한편, 도 8에는 이러한 배변 인식 알고리즘에 대한 그래프가 도시된다. 도시된 바와 같이, 본 그래프에는 표준인식곡선과, 환산 체온 곡선과, 배변 특성곡선이 도시되며, 이러한 곡선 에 의하여 배변 여부를 인식하게 된다. 먼저, 연산모듈은 배변 감지후 일정 시간 동안 배뇨가 감지되는지 여부를 판단한다. 즉, 약 30초 이내에 배뇨가 감지되면 배변 상태로 감지하여 표준 인식곡선과 배변 특성 곡선의 궤적을 비교한다. 측정값이 배변 범위 이내인 경우 실제로 배변이 이루어졌음을 외부에 알리게 된다. 그리고, 간호사 및 보호자는 이러한 알림에 의하여 배뇨여부를 실시간으로 파악할 수 있게 되며 필요 조치를 취 할 수 있다. 한편, 상기에서는 패턴센서(20,21,22,23)를 상하 좌우로 입체적으로 배치된 경우에 의하여 설명하였지만, 본 발 명은 이에 한정되는 것은 아니고 도 9에 도시된 바와 같이, 패턴센서가 기저귀 본체의 표면에만 배치될 수도 있다. 또한, 본 발명에서는 단말기에서는 산출모듈에 의하여 전류의 변화량을 산출하고, 판단모듈에 의하 여 전류의 변동이 감지된 센서가 기저귀 표면의 제 1 및 제 2센서(20,21)인지, 혹은 기저귀 저면의 제 3 및 제 4센서(22,23)인지를 판단하는 것으로 설명하였지만, 본 발명은 이에 한정되는 것은 아니고 중계기의 연산모 듈에서도 이러한 기능을 수행할 수 있다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9"}
{"patent_id": "10-2022-0175112", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 스마트 기저귀의 구조를 개략하게 보여주는 도면이다. 도 2는 도 1에 도시된 패턴센서가 입체적으로 배치된 상태를 보여주는 도면이다. 도 3은 도 2에 도시된 패턴센서가 기저귀의 표면 및 저면에 각각 배치된 상태를 보여주는 측면도이다. 도 4는 도 1에 도시된 스마트 기저귀의 구조를 개략적으로 보여주는 도면이다. 도 5는 도 2에 도시된 단말기의 구조를 개략적으로 보여주는 도면이다. 도 6은 도 1에 도시된 패턴센서가 구비된 스마트 기저귀와 네트워크에 의하여 배변 및 배뇨를 감지하는 시스템 을 보여주는 도면이다. 도 7은 도 7에 도시된 중계기의 구조를 개략적으로 보여주는 블록도이다. 도 8은 도 1에 도시된 스마트 기저귀 시스템의 배변 인식 알고리즘을 보여주는 그래프이다. 도 9은 도 1에 도시된 스마트 기저귀의 다른 실시예로서 패턴센서가 기저귀의 표면에만 배치된 상태를 보여주는 사시도이다."}
