{"patent_id": "10-2022-0176733", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0094452", "출원번호": "10-2022-0176733", "발명의 명칭": "자율주행 보안성 평가 방법 및 시스템", "출원인": "주식회사 시옷", "발명자": "박한나"}}
{"patent_id": "10-2022-0176733", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "자율 운송수단 안전성(autonomous vehicle safety)을 평가하기 위한 컴퓨터 구현 방법에 있어서, 상기 방법은:테스트 공간에서 자율 운송수단들의 안전성 기준을 정의하는 단계;상기 테스트 공간을 의도된 테스트 공간과 의도되지-않은 테스트 공간으로 나누는 단계 - 상기 의도된 테스트공간은 상기 안전성 기준에 대해 정량화 될 수 있는 자율 운송수단에 대한 특성들을 포함하고, 상기 의도되지않은 테스트 공간은 상기 안전성 기준에 대해 정량화 할 수 없는 특성들을 포함함-;상기 의도된 테스트 공간에서 상기 자율 운송수단들의 안전성을 측정하는 단계;상기 의도되지-않은 테스트 공간을 피드백으로서 상기 의도된 테스트 공간에 적용하는 단계; 및자율 운송수단 안전성의 평가를 제공하기 위해 주변 운송수단들과 자율 운송수단들의 조합된 시뮬레이션을 사용하여 상기 의도되지-않은 테스트 공간으로부터 피드백을 포함하는 상기 의도된 테스트 공간을 평가하는 단계를포함하는, 자율주행 보안성 평가 방법."}
{"patent_id": "10-2022-0176733", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "자율 운송수단 안전성(autonomous vehicle safety)을 평가하기 위한 컴퓨터 구현 방법이 제공되고, 상기 방법은 테스트 공간에서 자율 운송수단들의 안전성 기준을 정의하는 단계, 및 상기 테스트 공간을 의도된 테스트 공간과 의도되지-않은 테스트 공간으로 나누는 단계를 포함한다. 상기 의도된 테스트 공간은 상기 안전성 기준에 대해 (뒷면에 계속)"}
{"patent_id": "10-2022-0176733", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 일반적으로 자율 운송수단들(autonomous vehicles)에 관한 것으로, 보다 상세하게는 시장에서 자율 운송수단들의 안전성(the safety)을 결정하기 위한 평가 방법들에 관한 것이다."}
{"patent_id": "10-2022-0176733", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "자동차 OEM(Original Equipment Manufacturer) 및 공급업체들에 있어서, 자율 주행 운송수단들의 개발은 더 이 상 피할 수 없다. 인공지능(AI), 딥러닝, 센서융합, 고화질 지도들 등과 같은 솔루션들을 각 기업들에서 도입함 으로써 자율-주행 운송수단들에 대한 연구개발이 가속화되고 있음에도 불구하고, 개발된 운송수단들을 시장에 출시하기 위한 '평가 기술들'에는 여전히 많은 문제들이 남아 있다."}
{"patent_id": "10-2022-0176733", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "다음과 같은 문제들이 일반적으로 인식된다: 자율-주행 운송수단의 안전성 평가는 주변 운송수단들 및 기타 운송수단들과의 상호 작용에 크게 의존한다; 자율 운송수단과 주변 운송수단들 간의 상호 의존성은 상당히 많은 조합들을 가지고 있다; 그리고 상호의존성을 기반으로 안전성 평가를 위한 테스트 케이스들을 생성하 려고 해도, 조합 폭발이 발생할 수 있다. 그러므로, 자율-주행 운송수단의 안전성을 정량적으로 평가하는 것은 적어도 기존의 평가 기술들로는 유한한 테 스트-공간(a finite test-space)을 설정하는 것이 가능하지 않기 때문에 불가능하다고 여겨진다."}
{"patent_id": "10-2022-0176733", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시 예에 따라, 컴퓨터 구현 방법이 자율 운송수단 안전성(autonomous vehicle safety)을 평가하 기 위해 제공된다. 일부 실시 예들에서, 상기 컴퓨터 구현 방법은 테스트 공간에서 자율 운송수단들의 안전성 기준을 정의하는 단계, 및 상기 테스트 공간을 의도된 테스트 공간과 상기 의도되지-않은 테스트 공간으로 나누 는 단계를 포함할 수 있다. 상기 의도된 테스트 공간은 상기 안전성 기준에 대해 정량화 될 수 있는 자율 운송 수단에 대한 특성들을 포함하고, 의도되지-않은 테스트 공간은 상기 안전성 기준에 대해 정량화 할 수 없는 특 성들을 포함한다. 일부 실시 예들에서, 상기 컴퓨터 구현 방법은 상기 의도된 테스트 공간에서 상기 자율 운송 수단들의 안전성을 측정하는 단계, 및 상기 의도되지-않은 테스트 공간을 피드백으로서 상기 의도된 테스트 공간에 적용하는 단계를 더 포함한다. 일부 실시 예들에서, 상기 방법은 자율 운송수단 안전성의 평가를 제공하기 위해 주변 운송수단들과 자율 운송수단들의 조합된 시뮬레이션을 사용 하여 상기 의도되지-않은 테스트 공간으로부터 피드백을 포함하는 상기 의도된 테스트 공간을 평가하는 단계를 더 포함한다."}
{"patent_id": "10-2022-0176733", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "일부 실시예들에서, 자율 운송수단들을 시장에 도입하기 위한 \"평가 기술들(evaluation techniques)\"을제공하는 데 있어서 현재의 어려움들은 여기에 설명된 방법들, 시스템들 및 컴퓨터 프로그램 제품들에 의해 극복될 수 있 다. \"자율 운송수단(autonomous vehicle)\"란 용어는 사람의 개입 없이 자신의 환경을 감지하고 운행할수 있는 운송 수단을 의미한다. 운행 중에 사람이 운송수단을 제어할 필요가 없으며, 사람이 운송수단에 탑승할필요도 전혀 없다. 예를 들어, 본 발명의 일부 실시예들의 장점은 유한 테스트 공간(a finite test space)을 정의하지 못하는 이전 평가 방법들의 어려움들을 해결할 수 있는 평가 기술을 제공하는 것이다. 여기에 설명된 평가 기술들은적어도 두 가지 특징들을 제공한다:1) \"의도된 테스트-공간(intended test- space)\"과 \"의도되지 않은 테스트-공간(unintended test-space)\"에서평가를 위해 구역(region)을 나눈다; 그리 고2) 자율-주행 운송수단을 위한 \"의도된 테스트-공간\"은 \"교통의 복잡성 정도(degree of traffic complexity)\"와 \"교통의 안전성 정도(degree of traffic safety)\"의 조합으로 구성된 \"자율-주행 운송수단의 안전성\" 관점에서 정의되며, 따라서 정량화된다(quantified). 마찬가지로, 자율-주행 운송수단 외에 평가 대상의 경계가 명확하지 않은 애플리케이션의 경우, 결과들에 바람 직하지 않는 현상들(behaviors that are unfavorable forresults)에 대해서는 \"의도된 테스트-공간\"이 적용될 수 있다. 상기 방법들, 시스템들 및 컴퓨터 프로그램 제품들에서, \"자율주행 평가의 충분성(sufficiency ofevaluation of autonomous driving)\"은 다음에 의해서 정의된다: \"정량적으로 측정 가능 구역(quantitativelymeasurable region)\"과 \"측정 불가 구역(unmeasurable region)\"으로 채워질 테스트-공간을 (의도된 테스트 공간과 의도되지 않은 테스트 공간으로의 분할에 따라) 나누는 단계(dividing)와, 측정 불가 구역에서 측정 가능구역으로의 피드 백을 위한 수단을 명확하게 정의하는 단계(defining). 상기 방법들, 시스템들 및 컴퓨터 프로그램 제품들은 또한 상기 피드백의 완료 기준을 제공할 수 있다. 일부 실시 예들에서, 여기서 제공된 상기방법들, 시스템들 및 컴퓨터 프로그램 제품들은, \"자율 주행\"의 특정 개발 주제에 특정한 요소들을 사용하여,예를 들어, 교통 복잡성 및 교통 안전성의 정도에 따라, 구체적이고 현 실적인 측정 수단(specific andrealistic measurement means)을 정의할 수 있다. 본 발명의 방법들,시스템들 및 컴퓨터 프로그램 제품들은 \"정량적으로 측정 가능 구역\" 및 \"측정 불가구역\"으로 채워질 테스트-공간을 나누는 것과 같은, 이점들을 갖는 기술을 제공하며, 여기서 객관적인 결정을가능하게 하 는 다른 완료 기준이 둘 모두에 대해 정의된다. 정량적으로 측정 가능 구역은 의도된 테스트 공간(the intended test space)이고, 측정 불가 구역은 의도되지 않은 테스트 공간(the unintended test space)이다. 이는 명확하지 않은(not definite) 테스트-공간(의도되지 않은 테스트-공간)을 시간을 투자하고 총 주행거리를 증가시킴으로써 가능한 한 전체 커버리지에 가깝게 만들려는 테스트 기술들과는 구별된다. 또한, 본 발명의 방법들, 시스템들 및 컴퓨터 프로그램 제품들에서는 추가로 의도되지 않은 테스트 공간전체가 의도된 테스트-공간으로 변환되고, 여기에서는 각각이 특정 기준을 충족하는 구역들만 피드백 되며, 피드백 양 의 수렴이 완료 기준으로서 설정되지만, 이전 테스트 기술에서는 측정 불가한 것을 측정하는 것은 불가능하다는전제에 기초하여, 유한하지 않은 의도되지 않는 테스트-공간에 대해 100% 커버리지를 달성하는 것을목표로 한다. 테스트 대상(the test subject), 예를 들어, 자율-주행 운송수단에 특정한 요소들의 조합을 사용하는 함수에 테 스트-공간을 입력함으로써 테스트 공간이 유한함을 증명한 후, 자율-주행 운송수단의 안전성 평가를 위한 의도 된 테스트-공간은 측정 가능한 방식으로 명확하게 정의된다. 상기 대상은, 자율-주행 운송수단의 모든함수들과 전체 주변 교통 흐름 범위가 아니라, \"안전성 평가\"의 관점으 로부터 평가가 필요한 구역, 요소들 및가능한 값들의 범위에 포크스 되는데, 이 것은 상기 접근 방식을 효과적 이 되게 한다. 본 발명의 방법들, 시스템들 및 컴퓨터 프로그램 제품들은 이제 도 1-10을 참조하여 보다 상세하게 논의된다. 도 1은 자율-주행 운송수단 안전성에 대한 정량적 평가 방법을 보여주는 블록/플로차트이다. 도 2는 자율-주행 운송수단의 안전성에 대한 정량적 평가 방법을 제공하기 위한 시스템의 블록도이다. 도면들의 플로차트 및 블록도는 본 발명의 다양한 실시예들에 따른 시스템들, 방법들, 및 컴퓨터 프로그램 제품 들의 가능한 구현들의 아키텍처, 기능, 및 동작을 예시한다. 이와 관련하여, 플로차트 또는 블록도들의각 블록은, 특정 논리 기능(들)을 구현하기 위한 하나 혹은 그 이상의 실행 가능한 명령들을 포함하는, 모듈,세그먼트, 또는 명령들의 일부를 나타낼 수 있다. 일부 대안적인 구현들에서, 블록들에 언급된 기능들은 도면들에 언급된 순서와 다르게 발생할 수 있다. 예를 들어, 연속적으로 도시된 2개의 블록들은, 실제로, 실질적으로동시에 실행될 수 있거나, 관련된 기능에 따 라, 블록들이 때때로 역순으로 실행될 수 있다. 또한 블록도들 및/또는 플로차트의 각 블록, 및 블록도들 및/또는 플로차트 그림의 블록들의 조합들은, 특정 기 능들을 수행하거나특수 목적 하드웨어와 컴퓨터 명령들의 조합들을 수행하거나 수행하는 특수 목적 하드웨어-기 반 시스템들에 의해 구현될 수 있다. 도 1을 참조하면, 일부 실시 예들에서 자율-주행 운송수단의 안전성에 대한 정량적 평가 방법은 블록 1에서 \"교 통 복잡성\" 및 \"교통 안전성\"에 대한 공식을 사용하여 \"자율 운송수단의 안전성\"에 대한 기준을 정의하는 단계 를 포함할 수 있다. 도 2를 참조하면, 자율 주행 운송수단 안전성을 평가하기 위한 시스템은 데이터 입력을 포함할 수 있 는데, 예를 들어, 운전 환경에서 대상 자율-주행 운송수단(a subjectautonomous-driving vehicle)으로부터 데이터를 수신하기 위한, 송수신기(transceiver)를 포함할 수 있다. 운전 환경에서 대상 자율-주행 운송수단은 시뮬레이션 되고 있거나, 실시간으로 교통 상호 작용을 기록하고 있거나, 또는 실제 세계 내비게이션 테스트에 따라 데이터를 제공하고 있을 수 있다. 주행 환경에서 대상자율-주행 운송수단은 인터넷을 통해 자율 주행 운송수단 안전성을 평가하기 위한 시스템의 데이터 입력과 통신할 수 있다. 주행 기준(The driving criteria)은 시스템의 메모리에, 예를 들어, 자율 운송수단의 안전성 기준 데 이터베이스에 저장될 수 있다. 일부 실시예들에서, 교통 복잡성(traffic complexity)을 정의하는 단계는(defining) 낮은 복잡성의 레벨들에서 높은 복잡성의 레벨들까지 정도들의 범위로(in degrees ranging) 정의된다. 일부 예들에서, 교통의 복잡성 정도는, 예를 들어, 교통 통로 상의 경로들 수(the number of pathways on a traffic passageway) (예를들어, 도로의 차선들의 수), 교통 통로 상의 이동하는 요소들의 수(number of moving elements on atraffic passageway), 교통 통로 상의 이동하는 요소들의 크기, 교통 통로 상의 이동 하는 요소들 사이의거리들, 교통 통로 상의 이동하는 요소들의 가속/감속, 교통 통로 상의 다른 경로들 사이의 변화들의 수, 시간단위의 도로 모양의 복잡성의 함수(a function)표현될 수 있다. 하나의 예에서, 이동하는 요소들은 운송수단들이고, 교통 통로는 도로이며, 경로들의 수는 차선들 이다. 도 1을 참조하면, 상기 방법은 블록 2에서 \"의도되지 않은 테스트 공간\"을 평가하는 단계를 포함할 수있으며, 상기 평가하는 단계는 무작위로 드문드문(randomly and sparsely), 그리고 편향 없이(without bias)제품들을 평가할 수 있는 프로세스/도구들을 사용하여 수행될 수 있다. 일부 실시예들에서, 평가될 구역(theregion to be evaluated)은, 도 5에 도시된 바와 같이, \"의도된 테스트-공 간\" 및 \"의도되지 않은 테스트-공간\"으로 나누어진다. \"의도된 테스트-공간\"은 설계 요건들의 조합(a combination of design requirements)에 의해서 전체 커버리지 (full coverage)를 달성할 수 있는 테스트-공간이다. 상기 설계 요건들은 의도된 것일 수 있으며 기존의 평가 기술들로 정량화될 수 있으며, 커버리지의 요구된 정도 가 정량적으로 측정할 때 \"충분한\" 것으로 결정된다. 반면에, 의도되지 않은 테스트-공간은 전체 커버리지를 달성할 수 없다고 가정되는데, 그 것은 사전에 설계 요 건으로서 정의하는 것이 어렵거나 불가능한데 평가는 필요한 구역이고 \"경계를 찾을 수 없는\" 공간이기 때문이 다. 도 5는 의도된 테스트 공간과 의도되지 않은 테스트 공간 사이의 명확한 경계를 도시한다. 이를 통해 완료율(a completion rate)이 수치로 측정될 수 있고, 전체 커버리지도 제공될 수 있다. 의도되지 않은 테스트는 평가를 특정 공간에 치우치지 않고 산발적으로 어느 정도 분산하여 무작위로 수행하는 수단을 사용하여 수행될 수 있다. 이 평가를 제공하기 위한 일 실시예는 시뮬레이션된 운송수단 동작(behavior)의 3개 층들을 채용한다. 상기 층들은 주행 경로(a driving route)를 생성하는 구간(a section), 운송수단의 특정 동작(a specific behavior)을 생성하는 구간, 운전자의 성격(personality)에서 오는 특정 동작(a particular behavior)을 생성 하는 구간을 포함할 수 있다. 의사 난수 값들(Pseudo random values)은 평가의모든 변형을 제공하는 데 사용되며 시뮬레이션에서 층들 각각의 값에 가중치를 부여하는 데 사용된다. 예를 들어, 운송수단들 각각의 위치, 운송수단들의 초기 속도, 운송수단들이 이동해야 하는 경로의 종류에 대하 여 의사난수 값들이 사용될 수 있다. 일부 실시 예들에서, 이들 파라미터들 또는 선택들은 시스템이 운송수단 동작의다양한 패턴들을 생성할 수 있도 록 \"무작위로\" 설정될 수 있다. 순수한 무작위 값들이 아닌, 의사 난수 값들도채용될 수 있는데, 이는 본 발명의 방법들, 시스템들 및 컴퓨터 프로그램 제품들에서 생성된 동작들은 재현 가능하기 때문이다. 평가를 수행하기 위한 수단의 구체적인 예들이 \"자율 주행을 위한 컴퓨터를 사용하는 자동 시나리오 생성기\"라 는 명칭의 미국 특허 출원 번호 16/804,737에서 제공된다. \"자율 주행을 위한 컴퓨터를 사용하는 자동 시나리오 생성기\"라는 명칭의 미국 특허 출원 번호 16/804,737 전체 가 여기에, 참조로 포함된다. 평가결과, 만일 의도된 테스트-공간에 포함되어야 하는 새로운 테스트 공간(즉, 정량적으로 측정되고 커버되어 야 하는 테스트 공간)이 발견된다면, 그러한 테스트-공간은 동적으로 피드백 된다. 평가의 결과로서 발생되지 않아야하는 버그로서 취급되어야 하는 이벤트의 발생 여부가 피드백의 기준을 위해 채용된다. 일부 실시 예들에서, 평가의 결과로서, 만일 의도된 테스트-공간(즉, 정량적으로 측정되고 커버되어야 하는 테 스트 공간)에 포함되어야하는 새로운 테스트 공간이 발견된다면, 그러한 테스트-공간은 동적으로 피드백된다. 일부 실시예들에서, 의도되지 않은 테스트 공간으로부터 의도된 테스크 공간으로의 피드백이 미리 결정된 특정 값과 동일하거나 또는 그아래로 수렴하는 경우 \"평가가 충분하다\"고 결정된다. 자율 운송수단 안전을 평가하기 위한 시스템 및 방법의 바람직한 실시예들(이들은 예시적이며 제한하려고 의도 된 것이 아님)을 설명했지만, 상기 기술적 사상들에 비추어 당업자에 의해 수정들 및 변화들이 이루어질수 있음 에 유의해야 한다.따라서, 첨부된 청구범위에 의해 기술된 바와 같이 본 발명의 범위 내에 있는 개시된특정 실시 예들에서 변화들 이 이루어질 수 있음을 이해해야 한다. 특허법에 의해 요구되는 세부 사항들 및 구체성과 함께 본 발명의 실시 예들을 설명하고 관련 특허법령에 의해 청구되고 보호되는 내용이 첨부된 청구범위에기재되어 있다."}
{"patent_id": "10-2022-0176733", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른, 자율 운송수단의 안전성을 위한 정량적 평가 방법을 나타내는 블록/플로차 트이다."}
