{"patent_id": "10-2024-7032063", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0005076", "출원번호": "10-2024-7032063", "발명의 명칭": "사용자 단말에 의해 수행되는 방법, 기지국에 의해 수행되는 방법, 및 그에 대응하는 장치들", "출원인": "삼성전자주식회사", "발명자": "푸 징싱"}}
{"patent_id": "10-2024-7032063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "무선 통신 시스템에서의 단말(user equipment, UE)은,송수신부(transceiver); 및상기 송수신부와 결합되는 컨트롤러를 포함하며,상기 컨트롤러는,기지국으로부터, 제1 UL Tx 체인과 제2 UL Tx 체인을 포함하는 듀얼 UL Tx 체인들에 대한 상향링크(uplink, UL)송신(transmission, Tx) 스위칭과 연관된 제1 정보를 수신하고, 상기 제1 정보는:상기 제1 UL Tx 체인 및 상기 제2 UL Tx 체인 모두를 제1 UL 캐리어로 스위칭할지, 또는상기 제1 UL Tx 체인 또는 상기 제2 UL Tx 체인 중 하나를 상기 제1 UL 캐리어로 스위칭할지 여부를 지시하고,및상기 제1 정보에 따라, 상기 제1 UL Tx 체인을 기반으로, 또는 상기 제1 UL Tx 체인 및 상기 제2 UL Tx 체인 모두를 기반으로, 상기 제1 UL 캐리어 상에서 UL 신호를 상기 기지국에게 송신하도록 구성되는 단말."}
{"patent_id": "10-2024-7032063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 상기 컨트롤러는,상기 기지국으로부터, 상기 제1 UL 캐리어에 대한 페어링 UL 캐리어와 연관된 제2 정보를 수신하고,상기 제1 정보가 상기 제1 UL TX 체인 또는 상기 제2 UL TX 체인 중 하나를 상기 제1 UL 캐리어로 스위칭하도록지시하는 경우, 상기 제1 정보에 따라, 상기 제1 UL Tx 체인 또는 상기 제2 UL Tx 체인 중 하나를 기반으로 상기 제1 UL 캐리어 상에서 제1 UL 신호를 상기 기지국에게 송신하고, 및상기 제1 정보 및 상기 제2 정보에 따라, 상기 제1 UL Tx 체인 또는 상기 제2 UL Tx 체인 중 다른 하나를 기반으로 상기 페어링 UL 캐리어 상에서 제2 UL 신호를 상기 기지국에게 송신하도록 더 구성되는 단말."}
{"patent_id": "10-2024-7032063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서, 상기 제1 UL 신호 및 상기 제2 UL 신호 각각은 하나의 포트에서 송신되는 단말."}
{"patent_id": "10-2024-7032063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서, 상기 제1 정보 및 상기 제2 정보는 RRC(radio resource control) 시그널링을 통해 수신되는단말."}
{"patent_id": "10-2024-7032063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "무선 통신 시스템에서의 기지국은,송수신부(transceiver); 및상기 송수신부와 결합되는 컨트롤러를 포함하며,공개특허 10-2025-0005076-3-상기 컨트롤러는,단말(user equipment, UE)에게, 제1 UL Tx 체인과 제2 UL Tx 체인을 포함하는 듀얼 UL Tx 체인에 대한 상향링크(uplink, UL) 송신(transmission, Tx) 스위칭과 연관된 제1 정보를 송신하고, 상기 제1 정보는,상기 제1 UL Tx 체인 및 상기 제2 UL Tx 체인 모두를 제1 UL 캐리어로 스위칭할지, 또는상기 제1 UL Tx 체인 또는 상기 제2 UL Tx 체인 중 하나를 상기 제1 UL 캐리어로 스위칭할지 여부를 지시하고,및상기 제1 정보에 따라, 상기 제1 UL Tx 체인을 기반으로, 또는 상기 제1 UL Tx 체인 및 상기 제2 UL Tx 체인 모두를 기반으로, 상기 단말로부터, 상기 제1 UL 캐리어 상에서 UL 신호를 수신하도록 구성되는 기지국."}
{"patent_id": "10-2024-7032063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 5에 있어서, 상기 컨트롤러는,상기 제1 UL 캐리어에 대한 페어링 UL 캐리어와 연관된 제2 정보를 상기 단말에게 송신하고,상기 제1 정보가 상기 제1 UL TX 체인 또는 상기 제2 UL TX 체인 중 하나를 상기 제1 UL 캐리어로 스위칭하도록지시하는 경우, 상기 제1 정보에 따라, 상기 제1 UL Tx 체인 또는 상기 제2 UL Tx 체인 중 하나를 기반으로 상기 제1 UL 캐리어 상에서 제1 UL 신호를 상기 단말로부터 수신하고, 및상기 제1 정보 및 상기 제2 정보에 따라, 상기 제1 UL Tx 체인 또는 상기 제2 UL Tx 체인 중 다른 하나를 기반으로 상기 페어링 UL 캐리어 상에서 제2 UL 신호를 상기 단말로부터 수신하도록 더 구성되는 기지국."}
{"patent_id": "10-2024-7032063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 5에 있어서, 상기 제1 UL 신호 및 상기 제2 UL 신호 각각은 하나의 포트에서 송신되는 기지국."}
{"patent_id": "10-2024-7032063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 5에 있어서, 상기 제1 정보 및 상기 제2 정보는 RRC(radio resource control) 시그널링을 통해 송신되는기지국."}
{"patent_id": "10-2024-7032063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "무선 통신 시스템에서 단말(user equipment, UE)에 의해 수행되는 방법은,기지국으로부터, 제1 UL Tx 체인과 제2 UL Tx 체인을 포함하는 듀얼 UL Tx 체인들에 대한 상향링크(uplink, UL)송신(transmission, Tx) 스위칭과 연관된 제1 정보를 수신하는 단계, 상기 제1 정보는,상기 제1 UL Tx 체인 및 상기 제2 UL Tx 체인 모두를 제1 UL 캐리어로 스위칭할지, 또는상기 제1 UL Tx 체인 또는 상기 제2 UL Tx 체인 중 하나를 상기 제1 UL 캐리어로 스위칭할지 여부를 지시하고;및상기 제1 정보에 따라, 상기 제1 UL Tx 체인을 기반으로, 또는 상기 제1 UL Tx 체인 및 상기 제2 UL Tx 체인 모두를 기반으로, 상기 제1 UL 캐리어 상에서 UL 신호를 상기 기지국에게 송신하는 단계를 포함하는 방법."}
{"patent_id": "10-2024-7032063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 9에 있어서,상기 기지국으로부터, 상기 제1 UL 캐리어에 대한 페어링 UL 캐리어와 연관된 제2 정보를 수신하는 단계;공개특허 10-2025-0005076-4-상기 제1 정보가 상기 제1 UL TX 체인 또는 상기 제2 UL TX 체인 중 하나를 상기 제1 UL 캐리어로 스위칭하도록지시하는 경우, 상기 제1 정보에 따라, 상기 제1 UL Tx 체인 또는 상기 제2 UL Tx 체인 중 하나를 기반으로 상기 제1 UL 캐리어 상에서 제1 UL 신호를 상기 기지국에게 송신하는 단계; 및상기 제1 정보 및 상기 제2 정보에 따라, 상기 제1 UL Tx 체인 또는 상기 제2 UL Tx 체인 중 다른 하나를 기반으로 상기 페어링 UL 캐리어 상에서 제2 UL 신호를 상기 기지국에게 송신하는 단계를 더 포함하는 방법."}
{"patent_id": "10-2024-7032063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 9에 있어서, 상기 제1 UL 신호 및 상기 제2 UL 신호 각각은 하나의 포트에서 송신되는 방법."}
{"patent_id": "10-2024-7032063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 9에 있어서, 상기 제1 정보 및 상기 제2 정보는 RRC(radio resource control) 시그널링을 통해 수신되는방법."}
{"patent_id": "10-2024-7032063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "무선 통신 시스템에서 기지국에 의해 수행되는 방법은,단말(user equipment, UE)에게, 제1 UL Tx 체인과 제2 UL Tx 체인을 포함하는 듀얼 UL Tx 체인에 대한 상향링크(uplink, UL) 송신(transmission, Tx) 스위칭과 연관된 제1 정보를 송신하는 단계, 상기 제1 정보는,상기 제1 UL Tx 체인 및 상기 제2 UL Tx 체인 모두를 제1 UL 캐리어로 스위칭할지, 또는상기 제1 UL Tx 체인 또는 상기 제2 UL Tx 체인 중 하나를 상기 제1 UL 캐리어로 스위칭할지 여부를 지시하고;및상기 제1 정보에 따라, 상기 제1 UL Tx 체인을 기반으로, 또는 상기 제1 UL Tx 체인 및 상기 제2 UL Tx 체인 모두를 기반으로, 상기 단말로부터, 상기 제1 UL 캐리어 상에서 UL 신호를 수신하는 단계를 포함하는 방법."}
{"patent_id": "10-2024-7032063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 13에 있어서,상기 제1 UL 캐리어에 대한 페어링 UL 캐리어와 연관된 제2 정보를 상기 단말에게 송신하는 단계;상기 제1 정보가 상기 제1 UL TX 체인 또는 상기 제2 UL TX 체인 중 하나를 상기 제1 UL 캐리어로 스위칭하도록지시하는 경우, 상기 제1 정보에 따라, 상기 제1 UL Tx 체인 또는 상기 제2 UL Tx 체인 중 하나를 기반으로 상기 제1 UL 캐리어 상에서 제1 UL 신호를 상기 단말로부터 수신하는 단계; 및상기 제1 정보 및 상기 제2 정보에 따라, 상기 제1 UL Tx 체인 또는 상기 제2 UL Tx 체인 중 다른 하나를 기반으로 상기 페어링 UL 캐리어 상에서 제2 UL 신호를 상기 단말로부터 수신하는 단계를 더 포함하는 방법"}
{"patent_id": "10-2024-7032063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "청구항 13에 있어서,상기 제1 UL 신호 및 상기 제2 UL 신호 각각은 하나의 포트에서 송신되고, 및상기 제1 정보 및 상기 제2 정보는 RRC(radio resource control) 시그널링을 통해 송신되는 방법.공개특허 10-2025-0005076-5-"}
{"patent_id": "10-2024-7032063", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 더 높은 데이터 전송률을 지원하기 위한 5G 또는 6G 통신 시스템에 관한 것이다. 본 개시는 무선 통신 시스템에서 사용자 단말에 의해 수행되는 방법, 기지국에 의해 수행되는 방법 및 이에 대응하는 장치들을 제공하 며, 본 개시는 통신"}
{"patent_id": "10-2024-7032063", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "에 속한다. 사용자 단말에 의해 수행되는 방법은 기지국(BS)으로부터, 제1 UL Tx (뒷면에 계속) 대 표 도 - 도4"}
{"patent_id": "10-2024-7032063", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 2, "content": "공개특허10-2025-0005076 체인과 제2 UL Tx 체인을 포함하는 듀얼 UL Tx 체인들에 대한 상향링크(UL) 송신(Tx) 스위칭과 연관된 제1 정보 를 수신하는 단계 - 제1 정보는 제1 UL Tx 체인 및 제2 UL Tx 체인 모두를 제1 UL 캐리어로 스위칭할지, 또는 제 1 UL Tx 체인 또는 제2 UL Tx 체인 중 하나를 제1 UL 캐리어로 스위칭할지 여부를 지시함 -; 및 제1 정보에 따라, 제1 UL Tx 체인을 기반으로, 또는 제1 UL Tx 체인 및 제2 UL Tx 체인 모두를 기반으로, 제1 UL 캐리어에 서 UL 신호를 송신하는 단계를 포함한다. 본 개시의 실시예들에 의해 제공되는 방법들에 기반하여, 기지국은 사 용자 단말을 보다 유연하게 스케줄링할 수 있으며, 이를 통해 시스템 자원의 효과적인 활용을 개선하고 통신 성 능을 향상시킬 수 있다. CPC특허분류 H04L 5/0023 (2013.01) H04L 5/0098 (2013.01) H04W 72/0453 (2023.01) H04W 72/1268 (2023.01)명 세 서 청구범위 청구항 1 무선 통신 시스템에서의 단말(user equipment, UE)은, 송수신부(transceiver); 및 상기 송수신부와 결합되는 컨트롤러를 포함하며, 상기 컨트롤러는, 기지국으로부터, 제1 UL Tx 체인과 제2 UL Tx 체인을 포함하는 듀얼 UL Tx 체인들에 대한 상향링크(uplink, UL) 송신(transmission, Tx) 스위칭과 연관된 제1 정보를 수신하고, 상기 제1 정보는: 상기 제1 UL Tx 체인 및 상기 제2 UL Tx 체인 모두를 제1 UL 캐리어로 스위칭할지, 또는 상기 제1 UL Tx 체인 또는 상기 제2 UL Tx 체인 중 하나를 상기 제1 UL 캐리어로 스위칭할지 여부를 지시하고, 및 상기 제1 정보에 따라, 상기 제1 UL Tx 체인을 기반으로, 또는 상기 제1 UL Tx 체인 및 상기 제2 UL Tx 체인 모 두를 기반으로, 상기 제1 UL 캐리어 상에서 UL 신호를 상기 기지국에게 송신하도록 구성되는 단말. 청구항 2 청구항 1에 있어서, 상기 컨트롤러는, 상기 기지국으로부터, 상기 제1 UL 캐리어에 대한 페어링 UL 캐리어와 연관된 제2 정보를 수신하고, 상기 제1 정보가 상기 제1 UL TX 체인 또는 상기 제2 UL TX 체인 중 하나를 상기 제1 UL 캐리어로 스위칭하도록 지시하는 경우, 상기 제1 정보에 따라, 상기 제1 UL Tx 체인 또는 상기 제2 UL Tx 체인 중 하나를 기반으로 상 기 제1 UL 캐리어 상에서 제1 UL 신호를 상기 기지국에게 송신하고, 및 상기 제1 정보 및 상기 제2 정보에 따라, 상기 제1 UL Tx 체인 또는 상기 제2 UL Tx 체인 중 다른 하나를 기반 으로 상기 페어링 UL 캐리어 상에서 제2 UL 신호를 상기 기지국에게 송신하도록 더 구성되는 단말. 청구항 3 청구항 1에 있어서, 상기 제1 UL 신호 및 상기 제2 UL 신호 각각은 하나의 포트에서 송신되는 단말. 청구항 4 청구항 1에 있어서, 상기 제1 정보 및 상기 제2 정보는 RRC(radio resource control) 시그널링을 통해 수신되는 단말. 청구항 5 무선 통신 시스템에서의 기지국은, 송수신부(transceiver); 및 상기 송수신부와 결합되는 컨트롤러를 포함하며,상기 컨트롤러는, 단말(user equipment, UE)에게, 제1 UL Tx 체인과 제2 UL Tx 체인을 포함하는 듀얼 UL Tx 체인에 대한 상향링 크(uplink, UL) 송신(transmission, Tx) 스위칭과 연관된 제1 정보를 송신하고, 상기 제1 정보는, 상기 제1 UL Tx 체인 및 상기 제2 UL Tx 체인 모두를 제1 UL 캐리어로 스위칭할지, 또는 상기 제1 UL Tx 체인 또는 상기 제2 UL Tx 체인 중 하나를 상기 제1 UL 캐리어로 스위칭할지 여부를 지시하고, 및 상기 제1 정보에 따라, 상기 제1 UL Tx 체인을 기반으로, 또는 상기 제1 UL Tx 체인 및 상기 제2 UL Tx 체인 모 두를 기반으로, 상기 단말로부터, 상기 제1 UL 캐리어 상에서 UL 신호를 수신하도록 구성되는 기지국. 청구항 6 청구항 5에 있어서, 상기 컨트롤러는, 상기 제1 UL 캐리어에 대한 페어링 UL 캐리어와 연관된 제2 정보를 상기 단말에게 송신하고, 상기 제1 정보가 상기 제1 UL TX 체인 또는 상기 제2 UL TX 체인 중 하나를 상기 제1 UL 캐리어로 스위칭하도록 지시하는 경우, 상기 제1 정보에 따라, 상기 제1 UL Tx 체인 또는 상기 제2 UL Tx 체인 중 하나를 기반으로 상 기 제1 UL 캐리어 상에서 제1 UL 신호를 상기 단말로부터 수신하고, 및 상기 제1 정보 및 상기 제2 정보에 따라, 상기 제1 UL Tx 체인 또는 상기 제2 UL Tx 체인 중 다른 하나를 기반 으로 상기 페어링 UL 캐리어 상에서 제2 UL 신호를 상기 단말로부터 수신하도록 더 구성되는 기지국. 청구항 7 청구항 5에 있어서, 상기 제1 UL 신호 및 상기 제2 UL 신호 각각은 하나의 포트에서 송신되는 기지국. 청구항 8 청구항 5에 있어서, 상기 제1 정보 및 상기 제2 정보는 RRC(radio resource control) 시그널링을 통해 송신되는 기지국. 청구항 9 무선 통신 시스템에서 단말(user equipment, UE)에 의해 수행되는 방법은, 기지국으로부터, 제1 UL Tx 체인과 제2 UL Tx 체인을 포함하는 듀얼 UL Tx 체인들에 대한 상향링크(uplink, UL) 송신(transmission, Tx) 스위칭과 연관된 제1 정보를 수신하는 단계, 상기 제1 정보는, 상기 제1 UL Tx 체인 및 상기 제2 UL Tx 체인 모두를 제1 UL 캐리어로 스위칭할지, 또는 상기 제1 UL Tx 체인 또는 상기 제2 UL Tx 체인 중 하나를 상기 제1 UL 캐리어로 스위칭할지 여부를 지시하고; 및 상기 제1 정보에 따라, 상기 제1 UL Tx 체인을 기반으로, 또는 상기 제1 UL Tx 체인 및 상기 제2 UL Tx 체인 모 두를 기반으로, 상기 제1 UL 캐리어 상에서 UL 신호를 상기 기지국에게 송신하는 단계를 포함하는 방법. 청구항 10 청구항 9에 있어서, 상기 기지국으로부터, 상기 제1 UL 캐리어에 대한 페어링 UL 캐리어와 연관된 제2 정보를 수신하는 단계;상기 제1 정보가 상기 제1 UL TX 체인 또는 상기 제2 UL TX 체인 중 하나를 상기 제1 UL 캐리어로 스위칭하도록 지시하는 경우, 상기 제1 정보에 따라, 상기 제1 UL Tx 체인 또는 상기 제2 UL Tx 체인 중 하나를 기반으로 상 기 제1 UL 캐리어 상에서 제1 UL 신호를 상기 기지국에게 송신하는 단계; 및 상기 제1 정보 및 상기 제2 정보에 따라, 상기 제1 UL Tx 체인 또는 상기 제2 UL Tx 체인 중 다른 하나를 기반 으로 상기 페어링 UL 캐리어 상에서 제2 UL 신호를 상기 기지국에게 송신하는 단계를 더 포함하는 방법. 청구항 11 청구항 9에 있어서, 상기 제1 UL 신호 및 상기 제2 UL 신호 각각은 하나의 포트에서 송신되는 방법. 청구항 12 청구항 9에 있어서, 상기 제1 정보 및 상기 제2 정보는 RRC(radio resource control) 시그널링을 통해 수신되는 방법. 청구항 13 무선 통신 시스템에서 기지국에 의해 수행되는 방법은, 단말(user equipment, UE)에게, 제1 UL Tx 체인과 제2 UL Tx 체인을 포함하는 듀얼 UL Tx 체인에 대한 상향링 크(uplink, UL) 송신(transmission, Tx) 스위칭과 연관된 제1 정보를 송신하는 단계, 상기 제1 정보는, 상기 제1 UL Tx 체인 및 상기 제2 UL Tx 체인 모두를 제1 UL 캐리어로 스위칭할지, 또는 상기 제1 UL Tx 체인 또는 상기 제2 UL Tx 체인 중 하나를 상기 제1 UL 캐리어로 스위칭할지 여부를 지시하고; 및 상기 제1 정보에 따라, 상기 제1 UL Tx 체인을 기반으로, 또는 상기 제1 UL Tx 체인 및 상기 제2 UL Tx 체인 모 두를 기반으로, 상기 단말로부터, 상기 제1 UL 캐리어 상에서 UL 신호를 수신하는 단계를 포함하는 방법. 청구항 14 청구항 13에 있어서, 상기 제1 UL 캐리어에 대한 페어링 UL 캐리어와 연관된 제2 정보를 상기 단말에게 송신하는 단계; 상기 제1 정보가 상기 제1 UL TX 체인 또는 상기 제2 UL TX 체인 중 하나를 상기 제1 UL 캐리어로 스위칭하도록 지시하는 경우, 상기 제1 정보에 따라, 상기 제1 UL Tx 체인 또는 상기 제2 UL Tx 체인 중 하나를 기반으로 상 기 제1 UL 캐리어 상에서 제1 UL 신호를 상기 단말로부터 수신하는 단계; 및 상기 제1 정보 및 상기 제2 정보에 따라, 상기 제1 UL Tx 체인 또는 상기 제2 UL Tx 체인 중 다른 하나를 기반 으로 상기 페어링 UL 캐리어 상에서 제2 UL 신호를 상기 단말로부터 수신하는 단계를 더 포함하는 방법 청구항 15 청구항 13에 있어서, 상기 제1 UL 신호 및 상기 제2 UL 신호 각각은 하나의 포트에서 송신되고, 및 상기 제1 정보 및 상기 제2 정보는 RRC(radio resource control) 시그널링을 통해 송신되는 방법.발명의 설명 기 술 분 야 본 개시는 통신의 기술 분야에 관한 것이며, 보다 구체적으로는 무선 통신 시스템에서 사용자 단말에 의해 수행 되는 방법, 기지국에 의해 수행되는 방법, 사용자 단말, 기지국 및 컴퓨터 판독 가능 저장 매체에 관한 것이다."}
{"patent_id": "10-2024-7032063", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "5G 이동통신 기술은 빠른 전송 속도와 새로운 서비스가 가능하도록 넓은 주파수 대역을 정의하고 있으며, 3.5 기가헤르츠(3.5GHz) 등 6GHz 이하 주파수('Sub 6GHz') 대역은 물론 28GHz와 39GHz 등 밀리미터파(㎜Wave)로 불 리는 초고주파 대역('Above 6GHz')에서도 구현이 가능하다. 또한, 5G 통신 이후(Beyond 5G)의 시스템이라 불리 어지는 6G 이동통신 기술의 경우, 5G 이동통신 기술 대비 50배 빨라진 전송 속도와 10분의 1로 줄어든 초저 (Ultra Low) 지연시간을 달성하기 위해 테라헤르츠(Terahertz, THz) 대역(예를 들어, 95GHz에서 3 테라헤르츠 대역과 같은)에서의 구현이 고려되고 있다. 5G 이동통신 기술의 초기에는, 초광대역 서비스(enhanced Mobile BroadBand, eMBB), 고신뢰/초저지연 통신 (Ultra-Reliable Low-Latency Communications, URLLC), 대규모 기계식 통신 (massive Machine-Type Communications, mMTC)에 대한 서비스 지원과 성능 요구사항 만족을 목표로, 초고주파 대역에서의 전파의 경로 손실 완화 및 전파의 전달 거리를 증가시키기 위한 빔포밍(Beamforming) 및 거대 배열 다중 입출력(Massive MIMO), 초고주파수 자원의 효율적 활용을 위한 다양한 뉴머롤로지 지원(복수 개의 서브캐리어 간격 운용 등)와 슬롯 포맷에 대한 동적 운영, 다중 빔 전송 및 광대역을 지원하기 위한 초기 접속 기술, BWP(Band-Width Part) 의 정의 및 운영, 대용량 데이터 전송을 위한 LDPC(Low Density Parity Check) 부호와 제어 정보의 신뢰성 높은 전송을 위한 폴라 코드(Polar Code)와 같은 새로운 채널 코딩 방법, L2 선-처리(L2 pre-processing), 특정 서 비스에 특화된 전용 네트워크를 제공하는 네트워크 슬라이싱(Network Slicing) 등에 대한 표준화가 진행되었다. 현재, 5G 이동통신 기술이 지원하고자 했던 서비스들을 고려하여 초기의 5G 이동통신 기술 개선(improvement) 및 성능 향상(enhancement)을 위한 논의가 진행 중에 있으며, 차량이 전송하는 자신의 위치 및 상태 정보에 기 반하여 자율주행 차량의 주행 판단을 돕고 사용자의 편의를 증대하기 위한 V2X(Vehicle-to-Everything), 비면허 대역에서 각종 규제 상 요구사항들에 부합하는 시스템 동작을 목적으로 하는 NR-U(New Radio Unlicensed), NR 단말 저전력 소모 기술(UE Power Saving), 지상 망과의 통신이 불가능한 지역에서 커버리지 확보를 위한 단말- 위성 직접 통신인 비 지상 네트워크(Non-Terrestrial Network, NTN), 위치 측위(Positioning) 등의 기술에 대 한 물리계층 표준화가 진행 중이다. 뿐만 아니라, 타 산업과의 연계 및 융합을 통한 새로운 서비스 지원을 위한 지능형 공장 (Industrial Internet of Things, IIoT), 무선 백홀 링크와 액세스 링크를 통합 지원하여 네트워크 서비스 지역 확장을 위한 노드를 제공하는 IAB(Integrated Access and Backhaul), 조건부 핸드오버(Conditional Handover) 및 DAPS(Dual Active Protocol Stack) 핸드오버를 포함하는 이동성 향상 기술(Mobility Enhancement), 랜덤액세스 절차를 간소화하 는 2 단계 랜덤액세스(2-step RACH for NR) 등의 기술에 대한 무선 인터페이스 아키텍쳐/프로토콜 분야의 표준 화 역시 진행 중에 있으며, 네트워크 기능 가상화(Network Functions Virtualization, NFV) 및 소프트웨어 정 의 네트워킹(Software-Defined Networking, SDN) 기술의 접목을 위한 5G 베이스라인 아키텍쳐(예를 들어, Service based Architecture, Service based Interface), 단말의 위치에 기반하여 서비스를 제공받는 모바일 엣지 컴퓨팅(Mobile Edge Computing, MEC) 등에 대한 시스템 아키텍쳐/서비스 분야의 표준화도 진행 중이다. 이와 같은 5G 이동통신 시스템이 상용화되면, 폭발적인 증가 추세에 있는 커넥티드 기기들이 통신 네트워크에 연결될 것이며, 이에 따라 5G 이동통신 시스템의 기능 및 성능 강화와 커넥티드 기기들의 통합 운용이 필요할 것으로 예상된다. 이를 위해, 증강현실(Augmented Reality, AR), 가상현실(Virtual Reality, VR), 혼합 현실 (Mixed Reality, MR) 등을 효율적으로 지원하기 위한 확장 현실(eXtended Reality, XR), 인공지능(Artificial Intelligence, AI) 및 머신러닝(Machine Learning, ML)을 활용한 5G 성능 개선 및 복잡도 감소, AI 서비스 지 원, 메타버스 서비스 지원, 드론 통신 등에 대한 새로운 연구가 진행될 예정이다. 또한, 이러한 5G 이동통신 시스템의 발전은 6G 이동통신 기술의 테라헤르츠 대역에서의 커버리지 보장을 위한 신규 파형(Waveform), 전차원 다중입출력(Full Dimensional MIMO, FD-MIMO), 어레이 안테나(Array Antenna), 대규모 안테나(Large Scale Antenna)와 같은 다중 안테나 전송 기술, 테라헤르츠 대역 신호의 커버리지를 개선 하기 위해 메타물질(Metamaterial) 기반 렌즈 및 안테나, OAM(Orbital Angular Momentum)을 이용한 고차원 공간 다중화 기술, RIS(Reconfigurable Intelligent Surface) 기술 뿐만 아니라, 6G 이동통신 기술의 주파수 효 율 향상 및 시스템 네트워크 개선을 위한 전이중화(Full Duplex) 기술, 위성(Satellite), AI(Artificial Intelligence)를 설계 단계에서부터 활용하고 종단간(End-to-End) AI 지원 기능을 내재화하여 시스템 최적화를 실현하는 AI 기반 통신 기술, 단말 연산 능력의 한계를 넘어서는 복잡도의 서비스를 초고성능 통신과 컴퓨팅 자 원을 활용하여 실현하는 차세대 분산 컴퓨팅 기술 등의 개발에 기반이 될 수 있을 것이다. 기존 무선 통신 모드를 어떻게 개선하고 통신 요구 사항을 더 잘 충족시킬 것인지는 당업자들에 의해 연구되고 있는 기술적 문제점이다. 본 개시의 목적은 기존 통신 모드들의 기술적 결함들 중 적어도 하나를 해결하여 통신 요구 사항들을 더 잘 충 족시키는 것이다. 이러한 목적을 위해, 본 개시는 다음과 같은 기술적 솔루션들을 제공한다. 일 양태에서, 본 개시의 실시예는 무선 통신 시스템에서 사용자 단말에 의해 수행되는 방법을 제공하며, 이 방 법은, 기지국에 의해 송신된 제1 정보를 수신하는 단계, 제1 정보는 스케줄링된 상향링크 자원 및 송신 모드의 관련 정보를 포함하고; 및 제1 정보에 따라 사용자 단말의 상향링크 송신 체인 상태를 결정하는 단계를 포함한다. 다른 양태에서, 본 개시의 실시예는 무선 통신 시스템에서 기지국에 의해 수행되는 방법을 제공하며, 이 방법은, 사용자 단말에게 제1 정보를 송신하는 단계를 포함하며, 여기서 제1 정보는 사용자 단말의 상향링크 송신 체인 상태를 결정하도록 구성되고, 제1 정보는 스케줄링된 상향링크 자원 및 송신 모드의 관련 정보를 포함한다. 또 다른 양태에서, 본 개시의 실시예는 트랜시버와 프로세서를 포함하는 사용자 단말을 추가로 제공하며, 이 프 로세서는 트랜시버에 결합되어 있으며 본 개시의 선택적 실시예들 중 어느 것에 따라 사용자 단말에 의해 수행 되는 방법을 실행하도록 구성된다. 또 다른 양태에서, 본 개시의 실시예는 트랜시버와 프로세서를 포함하는 기지국을 추가로 제공하며, 이 프로세 서는 트랜시버에 결합되어 있으며 본 개시의 선택적 실시예들 중 어느 것에 따라 기지국에 의해 수행되는 방법 을 구현하도록 구성된다. 또 다른 양태에서, 본 개시의 실시예는 프로세서에 의해 실행될 때, 본 개시의 선택적 실시예들 중 어느 것에 따른 방법을 구현하는 컴퓨터 프로그램들이 저장된 컴퓨터 판독 가능 저장 매체를 추가로 제공한다. 또 다른 양태에서, 본 개시의 실시예는 프로세서에 의해 실행될 때, 본 개시의 선택적 실시예들 중 어느 것에 따른 방법을 구현하는 컴퓨터 프로그램들을 포함하는 컴퓨터 프로그램 제품을 추가로 제공한다. 본 개시의 실시예에서 제공하는 기술적 솔루션이 가져오는 유익한 효과는 구체적인 선택적 실시예들을 참조하여 이하에서 설명되거나, 실시예들의 설명으로부터 이해될 수 있거나, 실시예들을 실시함으로써 인식될 수 있다."}
{"patent_id": "10-2024-7032063", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시의 실시예들이 본 개시의 첨부 도면들과 함께 아래에서 설명된다. 첨부 도면들과 함께 아래에 제시된 실 시예들은 본 개시의 실시예들의 기술적 솔루션들을 설명하는데 사용되는 예시적인 설명들이며, 본 개시의 실시 예들의 기술적 솔루션들에 대한 제한을 구성하지 않는다는 점을 이해해야 한다. 당업자는 달리 언급되지 않는 한, 단수 형태 및 \"상기\"가 복수 형태도 포함하는 것으로 의도될 수 있음을 이해 해야 한다. 또한 본원의 실시예에서 사용되는 \"포함하다\" 및 \"구성한다\"라는 용어는 해당 특징이 제시된 특징, 정보, 데이터, 단계, 동작, 구성 요소 및/또는 어셈블리로서 구현될 수 있지만 해당 분야에서 지원되는 다른 특 징들, 정보, 데이터, 단계들, 동작들, 구성 요소들, 어셈블리들 및/또는 이들의 조합들 등의 구현을 배제하지 않음을 의미한다는 것을 이해해야 한다. 구성 요소가 다른 구성 요소에 \"연결\"되거나 \"결합\"되었다고 언급할 때, 해당 구성 요소가 다른 구성 요소에 직접 연결되거나 결합될 수도 있고, 구성 요소와 다른 구성 요소가 중 간 구성 요소를 통해 연결된 것을 의미할 수도 있음을 이해해야 한다. 또한, 본 명세서에서 사용되는 \"연결\" 또 는 \"결합\"된다는 것은 무선으로 연결되거나 무선으로 결합되는 것을 포함할 수 있다. 본 명세서에서 사용되는 \"및/또는\"이라는 용어는 그 용어에 의해 정의된 항목들 중 적어도 하나를 나타내며, 예를 들어, \"A 및/또는 B\"는 \"A\" 또는 \"B\" 또는 \"A 및 B\"로 구현될 수 있다. 다수의(두 개 이상) 항목을 설명할 때, 다수의 항목들 간 의 관계들이 명확하게 정의되지 않은 경우, 다수의 항목들은 다수의 항목들 중 하나, 여러 개 또는 전부를 의미 할 수 있다. 예를 들어, \"파라미터 A가 A1, A2 및 A3을 포함한다\"라는 설명은 파라미터 A가 A1, A2 또는 A3을 포함한다거나, 파라미터 A가 세 개의 파라미터 A1, A2 및 A3 중 적어도 두 개를 포함한다는 것으로 구현될 수 있다. 도 1은 본 개시의 다양한 실시예들에 따른 예시적 무선 네트워크를 도시한다. 도 1에 도시된 무선 네트워 크의 실시예는 단지 설명을 위한 것이다. 무선 네트워크의 다른 실시예는 본 개시의 범위를 벗어나지 않고 사용될 수 있다. 무선 네트워크는 gNB(gNodeB, 101), gNB 및 gNB를 포함한다. gNB는 gNB 및 gNB(10 3)와 통신한다. gNB는 또한 인터넷, 사설 IP 네트워크, 또는 다른 데이터 네트워크와 같은 적어도 하나의 인터넷 프로토콜(IP) 네트워크와 통신한다. 네트워크 타입에 따라, \"gNodeB\" 또는 \"gNB\" 대신에, \"기지국\"이나 \"액세스 포인트\"와 같이 다른 잘 알려진 용 어들이 사용될 수 있다. 편의상 \"gNodeB\" 및 \"gNB\"라는 용어는 본 명세서에서 원격 단말기에 대한 무선 액세스 를 제공하는 네트워크 인프라스트럭처 구성 요소를 지칭하는 것으로 사용된다. 또한, 네트워크 타입에 따라, \" 사용자 단말\" 또는 \"UE(user equipment)\" 대신에, \"이동국\", \"사용자국\", \"원격 단말\", \"무선 단말\" 또는 \"사 용자 장치\"와 같은 다른 잘 알려진 용어들이 사용될 수 있다. 편의를 위해, \"사용자 단말\" 및 \"UE\"라는 용어는 이 특허 명세서에서, UE가 (모바일 전화나 스마트폰과 같은) 모바일 장치이든 (데스크탑 컴퓨터나 벤딩 머신과 같이) 일반적으로 고정 장치로서 간주되든, 무선으로 gNB에 액세스하는 원격 무선 장치를 일컫기 위해 사용된다. gNB는 gNB의 커버리지 영역 내에 있는 제1 복수의 사용자 단말(UE)들에게 네트워크에 대한 무선 광대역 액세스를 제공한다. 제1 복수의 UE들은 작은 사업장(SB) 안에 위치할 수 있는 UE; 기업체(E) 내에 위치할 수 있는 UE, WiFi 핫스팟(HS) 안에 위치할 수 있는 UE; 제1 주거지(R) 안에 위치할 수 있는 UE; 제2 주거지(R) 안에 위치할 수 있는 UE; 및 셀 폰, 무선 랩탑, 무선 PDA 등과 같은 모바일장치(M)일 수 있는 UE를 포함한다. gNB는 gNB의 커버리지 영역 내에 있는 복수의 제2 UE 들에게 네트워크에 대한 무선 광대역 액세스를 제공한다. 복수의 제2 UE들은 UE 및 UE를 포함한 다. 일부 실시예들에서 gNB들(101-103) 중 하나 이상은 5G, LTE(Long Term Evolution), LTE-A, WiMAX, 또는 다 른 진보한 무선 통신 기술들을 이용하여 서로 간에, 및 UE들(111-116)과 통신할 수 있다. 점선들은 다만 예시와 설명을 목적으로 대략적인 원 모양으로 그려진 커버리지 영역들(120 및 125)의 대략적인 정도를 보여준다. 커버리지 영역들(120 및 125)과 같이 gNB들과 관련된 커버리지 영역들은 자연적이고 인위적인 장애물들과 관련된 무선 환경 내 변동들 및 gNB들의 구성에 따라, 불규칙적 모양들을 포함하는 다른 모양들을 가질 수 있다는 것을 명확히 이해할 수 있다. 아래에서 더 상세히 설명되는 바와 같이, gNB, gNB, 및 gNB 중 하나 이상은 본 개시의 실시예들 에서 설명된 바와 같이 2D 안테나 어레이를 포함한다. 일부 실시예들에서, gNB, gNB, 및 gNB 중 하나 이상은 2D 안테나 어레이를 갖는 시스템을 위한 코드북 설계 및 구조를 지원한다. 도 1이 무선 네트워크의 일 예를 도시하고 있지만, 도 1에 대한 다양한 변경이 이루어질 수 있다. 예를 들 어, 무선 네트워크는 임의 개의 gNB들 및 임의 개의 UE들을 어떤 적절한 배치를 통해 포함할 수 있다. 또 한 gNB는 임의 개의 UE들과 직접 통신하여 그 UE들에게 네트워크에 대한 무선 광대역 액세스를 제공 할 수 있다. 마찬가지로, 각각의 gNB(102-103)는 네트워크와 직접 통신하여 UE들에게 네트워크에 대 한 직접 무선 광대역 액세스를 제공할 수 있다. 또한, gNB(101, 102, 및/또는 103)는 외부 전화 네트워크나 다 른 타입의 데이터 네트워크와 같은 다른, 혹은 부가적 외부 네트워크들로의 액세스를 제공할 수 있다. 도 2a 및 도 2b는 본 개시에 따른 예시적인 무선 송수신 경로들을 도시한다. 이하의 설명에서, 송신 경로 는 (gNB와 같은) gNB에서 구현되는 것으로 기술될 수 있고, 수신 경로는 (UE과 같은) UE에서 구 현되는 것으로 기술될 수 있다. 그러나, 수신 경로가 gNB에서 구현될 수도 있다는 것과 송신 경로가 UE에서 구현될 수 있다는 것도 이해할 수 있을 것이다. 일부 실시예들에서, 수신 경로는 본 개시의 실시예 들에서 설명된 바와 같이 2D 안테나 어레이를 갖는 시스템에 대한 구조 및 코드북 설계를 지원하도록 구성된다. 송신 경로는 채널 코딩 및 변조 블록, 직렬-병렬(S-to-P) 블록, 크기 N 역 고속 푸리에 변환 (IFFT) 블록, 병렬-직렬(P-to-S) 블록, 사이클 프리픽스 부가 블록, 및 상향 변환기(up- converter, UC)를 포함한다. 수신 경로는 하향 변환기(down-converter, DC), 사이클 프리픽스 제거 블록, 직렬-병렬(S-to-P) 블록, 크기 N 고속 푸리에 변환(FFT) 블록, 병렬-직렬(P-to-S) 블록, 및 채널 디코딩 및 복조 블록을 포함한다. 송신 경로에서, 채널 코딩 및 변조 블록은 정보 비트들의 집합을 수신하고, (컨볼루션 또는 터보 (turbo) 또는 저밀도 패리티 체크(LDPC) 코딩과 같은) 코딩을 적용하며, 입력 비트들을 변조하여 (QPSK(Quadrature Phase Shift Keying)나 QAM(Quadrature Amplitude Modulation)을 이용), 주파수 도메인 변조 심볼들의 시퀀스를 생성한다. 직렬-병렬 블록은 N이 gNB 및 UE에 사용되는 IFFT/FFT 사이즈일 때, N 개의 병렬 심볼 스트림들을 생성하기 위해, 직렬 변조된 심볼들을 병렬 데이터로 (디멀티플렉싱과 같이) 변환한다. 크기 N IFFT 블록은 N 개의 병렬 심볼 스트림들에 IFFT 연산을 수행하여, 시간 도메인 출력 신 호들을 생성한다. 병렬-직렬 블록은 직렬 시간 도메인 신호를 생성하기 위해, 크기 N IFFT 블록으로 부터 병렬 시간 도메인 출력 심볼들을 (멀티플렉싱과 같이) 변환한다. 사이클 프리픽스 부가 블록은 시간 도메인 신호에 사이클 프리픽스를 삽입한다. 상향 변환기는 사이클 프리픽스 부가 블록의 출력을, 무 선 채널을 통한 송신을 위한 RF 주파수로 (상향 변환하는 것과 같이) 변조한다. 이 신호는 RF 주파수로 변환하 기 전에 기저대역에서 필터링될 수도 있다. gNB로부터 송신된 RF 신호는 무선 채널을 통과한 후 UE에 도달하며, gNB에서의 동작들과는 반대 의 동작들이 UE에서 수행된다. 하향 변환기는 수신된 신호를 기저대역 주파수로 하향 변환하고, 사이 클릭 프리픽스 제거 블록은 사이클릭 프리픽스를 제거하여 직렬 시간 도메인 기저대역 신호를 생성한다. 직렬-병렬 블록은 시간 도메인 기저대역 신호를 병렬 시간 도메인 신호들로 변환한다. 크기 N FFT 블록 은 N개의 병렬 주파수 도메인 신호를 생성하기 위해 FFT 알고리즘을 수행한다. 병렬-직렬 블록은 병 렬 주파수 도메인 신호들을 변조된 데이터 심볼들의 시퀀스로 변환한다. 채널 디코딩 및 복조 블록은 변조 된 심볼들을 복조 및 디코딩하여, 원래의 입력 데이터 스트림을 복구한다. gNB들(101-103) 각각은 UE(111-116)로 하향링크 송신과 유사한 송신 경로를 구현할 수 있고, UE(111-116)로부 터의 상향링크 수신과 유사한 수신 경로를 구현할 수 있다. 마찬가지로, UE들(111-116) 각각이 gNB들(101-103)로의 상향링크 전송을 위한 송신 경로를 구현할 수 있고, gNB들(101-103)로부터의 하향링크 수신을 위한 수 신 경로를 구현할 수 있다. 도 2a 및 도 2b의 각각의 구성 요소는 하드웨어만을 사용하거나 하드웨어와 소프트웨어/펌웨어의 조합을 사용하 여 구현될 수 있다. 특정 예로서, 도 2a 및 도 2b의 구성 요소들 중 적어도 일부는 소프트웨어를 통해 구현될 수 있고, 다른 구성 요소들은 설정 가능한 하드웨어나, 소프트웨어 및 설정 가능 하드웨어의 혼합을 통해 구현 될 수 있다. 예를 들어, FFT 블록 및 IFFT 블록은 설정 가능 소프트웨어 알고리즘들로서 구현될 수 있으며, 여기서 크기 N의 값은 구현예에 따라 변경될 수 있다. 또한, FFT 및 IFFT를 사용하여 설명했지만, 이것은 단지 예시에 불과하며 본 개시의 범위를 한정하는 것으로 해 석되어서는 안 된다. 이산 푸리에 변환(DFT) 및 역 이산 푸리에 변환(IDFT)함수들과 같은 다른 종류의 변환들이 사용될 수도 있다. DFT 및 IDFT 함수들에 있어서 변수 N의 값은 임의의 정수(예를 들면, 1, 2, 3, 4 등)일 수 있고, FFT 및 IFFT 함수들에 있어서 변수 N의 값은 2의 거듭제곱인 임의의 정수(예를 들면, 1, 2, 4, 8, 16 등)일 수 있다. 도 2a 및 도 2b가 무선 송수신 경로의 예를 도시하지만, 도 2a 및 도 2b에 대한 다양한 변경이 이루어질 수 있 다. 또한, 도 2a 및 도 2b 안의 여러 구성 요소들이 결합되거나, 더 세부 분할되거나, 생략될 수 있고, 특정 요 구 사항에 따라 추가 구성 요소들이 추가될 수 있다. 또한 도 2a 및 도 2b는 무선 네트워크에서 사용될 수 있는 송신 및 수신 경로들의 유형들의 예들을 도시하기 위한 것이다. 무선 네트워크 내의 무선 통신을 지원하기 위해 다른 적절한 아키텍처들이 사용될 수도 있다. 도 3a는 본 개시에 따른 예시적인 UE를 도시한다. 도 3a에 도시된 UE의 실시예는 단지 설명을 위한 것이며, 도 1의 UE(111-115)는 동일하거나 유사한 구성을 가질 수 있다. 그러나, UE는 다양한 구성들을 가지며, 도 3a는 본 개시의 범위를 UE의 임의의 특정 구현으로 제한하지 않는다. UE는 안테나, 무선 주파수(RF) 트랜시버, 송신(TX) 처리 회로, 마이크로폰, 및 수신 (RX) 처리 회로를 포함한다. UE는 또한 스피커, 프로세서/컨트롤러, 입/출력(I/O) 인터페 이스(IF), 입력 장치(들), 디스플레이, 및 메모리를 포함한다. 메모리는 운영 체제 (OS) 및 하나 이상의 애플리케이션들을 포함한다. RF 트랜시버는 안테나로부터, 무선 네트워크의 gNB에 의해 송신되는 수신 RF 신호를 수신한다. RF 트랜시버는 수신 RF 신호를 하향 변환하여 중간 주파수(IF)나 기저대역 신호를 생성한다. IF 또는 기저 대역 신호는 RX 처리 회로로 보내지고, RX 처리 회로는 기저대역 또는 IF 신호를 필터링, 디코딩 및/ 또는 이진화함으로써, 처리된 기저대역 신호를 생성한다. RX 처리 회로는 처리된 기저대역 신호를 스피커 (음성 데이터 등의 경우)로, 혹은 추가 처리를 위해 프로세서/컨트롤러(웹 브라우징 데이터와 같은 경우)로 송신한다. TX 처리 회로는 마이크로폰으로부터 아날로그나 디지털 음성 데이터를, 또는 프로세서/컨트롤러(34 0)로부터 외향(outgoing) 기저대역 데이터(웹 데이터, 이메일 또는 인터랙티브 비디오 게임 데이터)를 수신한다. TX 처리 회로는 외향 기저대역 데이터를 인코딩, 멀티플렉싱 및/또는 이진화하여, 처리된 기저 대역 또는 IF 신호를 생성한다. RF 트랜시버는 처리된 외향 기저대역 또는 IF 신호를 TX 처리 회로로 부터 수신하고, 안테나를 통해 송신되는 기저대역 또는 IF 신호를 RF 신호로 상향 변환한다. 프로세서/컨트롤러는 하나 이상의 프로세서들 또는 다른 프로세싱 장치들을 포함할 수 있고, UE의 전 반적 동작을 제어하기 위해 메모리에 저장된 OS를 실행한다. 예를 들어, 프로세서/컨트롤러는 잘 알 려진 원리들에 따라 RF 트랜시버, RX 처리 회로, 및 TX 처리 회로에 의해 순방향 채널 신호들의 수신 및 역방향 채널 신호들의 송신을 제어할 수 있다. 일부 실시예들에서, 프로세서/컨트롤러는 적어도 하나의 마이크로프로세서나 마이크로컨트롤러를 포함한다. 프로세서/컨트롤러는 또한 본 개시의 실시예들에서 설명된 바와 같이 2D 안테나 어레이를 갖는 시스템에 대한 채널 품질 측정 및 보고를 위한 동작과 같은 메모리에 상주하는 다른 프로세스 및 프로그램을 실행할 수 있다. 프로세서/컨트롤러는 실행 프로세스에 의해 요구될 때, 메모리 안이나 밖으로 데이터를 옮 길 수 있다. 일부 실시예들에서, 프로세서/컨트롤러는 OS에 기반하거나 gNB들이나 운영자로부터 수신 된 신호들에 응하여 애플리케이션들을 실행하도록 구성된다. 프로세서/컨트롤러는 또한, UE에 랩탑 컴퓨터들 및 핸드헬드 컴퓨터들과 같은 다른 장치들로의 연결 기능을 제공하는 I/O 인터페이스와 결 합된다. I/O 인터페이스는 이러한 액세서리들 및 프로세서/컨트롤러 사이의 통신 경로이다. 프로세서/컨트롤러는 또한 입력 장치(들) 및 디스플레이와 결합된다. UE의 운영자는 입력 장치(들)를 사용하여 UE로 데이터를 입력할 수 있다. 디스플레이는 액정 디스플레이, 또는 (예 를 들면, 웹 사이트로부터의) 텍스트 및/또는 적어도 제한된 그래픽을 렌더링할 수 있는 다른 디스플레이일 수 있다. 메모리는 프로세서/컨트롤러와 결합된다. 메모리의 일부는 RAM(random access memory)을 포함할 수 있고, 메모리의 다른 일부는 플래쉬 메모리나 다른 ROM(read-only memory)을 포함할 수 있다. 도 3a가 UE의 일 예를 도시하고 있지만, 도 3a에 다양한 변경들이 이루어질 수 있다. 예를 들어, 도 3a의 여러 구성 요소들이 결합되거나, 더 세부 분할되거나, 생략될 수 있고, 특정 요구에 따라 추가 구성 요소들이 추가될 수 있다. 특정예로서, 프로세서/컨트롤러는 하나 이상의 중앙 처리 유닛(CPU)들 및 하나 이상의 그 래픽 처리 유닛(GPU)들과 같은 여러 프로세서들로 분할될 수 있다. 또한, 도 3a는 모바일 전화기나 스마트폰으 로서 구성된 UE를 도시하고 있지만, UE들은 다른 타입의 모바일 또는 고정 장치들로서 동작하도록 구성될 수도 있다. 도 3b는 본 개시에 따른 예시적인 gNB를 도시한다. 도 3b에 도시된 gNB의 실시예는 단지 예시를 위한 것이며, 도 1의 다른 gNB는 동일하거나 유사한 구성을 가질 수 있다. 그러나, gNB는 다양한 구성들을 가지며, 도 3b는 본 개시의 범위를 gNB의 임의의 특정 구현으로 제한하지 않는다. gNB 및 gNB는 gNB와 동일하거나 유사한 구조를 포함할 수 있다는 것을 유의해야 한다. 도 3b에 도시된 바와 같이, gNB는 복수의 안테나들(370a-370n), 복수의 RF 트랜시버들(372a-372n), 송신 (TX) 처리 회로, 및 수신(RX) 처리 회로를 포함한다. 특정 실시예에서, 복수의 안테나들(370a-370n) 중 하나 이상은 2D 안테나 어레이를 포함한다. gNB는 또한 컨트롤러/프로세서, 메모리, 및 백홀 또는 네트워크 인터페이스를 포함한다. RF 트랜시버들(372a-372n)은 안테나들(370a-370n)로부터 UE들이나 다른 gNB들에 의해 송신된 신호와 같은 내향 (incoming) RF 신호들을 수신한다. RF 트랜시버들(372a-372n)은 내향 RF 신호들을 하향 변환하여 IF나 기저대역 신호들을 생성한다. IF 또는 기저대역 신호들은 RX 처리 회로로 송신되고, RX 처리 회로는 기저대역 또는 IF 신호들을 필터링, 디코딩 및/또는 이진화함으로써, 처리된 기저대역 신호들을 생성한다. RX 처리 회로 는 처리된 기저대역 신호들을 추가 처리하기 위해 컨트롤러/프로세서로 송신한다. TX 처리 회로는 컨트롤러/프로세서로부터 아날로그나 디지털 데이터(음성 데이터, 웹 데이터, 이메일, 또는 인터랙티브 비디오 게임 데이터 등)를 수신한다. TX 처리 회로는 외향 기저대역 데이터를 인 코딩, 다중화 및/또는 이진화하여 처리된 기저대역 또는 IF 신호를 생성한다. RF 트랜시버들(372a-372n)은 처리 된 외향 기저대역 또는 IF 신호를 TX 처리 회로로부터 수신하고, 안테나들(370a-370n)을 통해 송신되는 기 저대역 또는 IF 신호들을 RF 신호들로 상향 변환한다. 컨트롤러/프로세서는 gNB의 전반적 동작을 제어하는 하나 이상의 프로세서들 또는 다른 처리 장치들 을 포함할 수 있다. 예를 들어, 컨트롤러/프로세서는 잘 알려진 원리들에 따라 RF 트랜시버들(372a-372n), RX 처리 회로, 및 TX 처리 회로에 의해 순방향 채널 신호들의 수신 및 역방향 채널 신호들의 송신을 제어할 수 있다. 컨트롤러/프로세서는 또한 상위 레벨 무선 통신 기능과 같은 추가 기능을 지원할 수 있다. 예를 들어, 컨트롤러/프로세서는 BIS 알고리즘을 통해 수행되는 것과 같은 BIS(Blind Interference Sensing) 프로세스를 수행하고 간섭 신호가 감산된 수신 신호를 디코딩할 수 있다. 컨트롤러/프로세서는 gNB에서 다양한 다른 기능들 중 임의의 것을 지원할 수 있다. 일부 실시예들에서, 컨트롤러/프로세서(37 8)는 적어도 하나의 마이크로프로세서 또는 마이크로컨트롤러를 포함한다. 컨트롤러/프로세서는 또한 기본 OS와 같은 메모리에 상주하는 프로그램 및 다른 프로세스를 실행할 수 있다. 컨트롤러/프로세서는 또한 본 개시의 실시예에서 설명된 바와 같이 2D 안테나 어레이를 갖는 시 스템에 대한 채널 품질 측정 및 보고를 지원할 수 있다. 일부 실시예들에서, 컨트롤러/프로세서는 웹 RTC 와 같은 엔티티 간의 통신을 지원한다. 컨트롤러/프로세서는 실행 프로세스에 의해 요구되는 대로 메모리 로 또는 메모리 밖으로 데이터를 이동할 수 있다. 컨트롤러/프로세서는 백홀 또는 네트워크 인터페이스에도 결합된다. 백홀 또는 네트워크 인터페이스 는 gNB가 백홀 접속이나 네트워크를 통해 다른 장치들 또는 시스템들과 통신할 수 있게 한다. 백홀 또는 네트워크 인터페이스는 어떤 적절한 유선 또는 무선 연결(들)을 통해 통신을 지원할 수 있다. 예를 들어, gNB가 셀룰러 통신 시스템(5G나 새로운 무선 액세스 기술이나 NR, LTE, 또는 LTE-A를 지원하는 것과 같은 시스템)의 일부로서 구현될 때, 백홀 또는 네트워크 인터페이스는 gNB가 유선 또는 무선 백홀연결을 통해 gNB들과 통신할 수 있게 한다. gNB가 액세스 포인트로서 구현될 때, 백홀 또는 네트워크 인터 페이스는 gNB가 유선 또는 무선 로컬 영역 네트워크를 통하거나 (인터넷과 같은) 보다 큰 네트워크로 의 유선 또는 무선 연결을 통해 통신하게 할 수 있다. 백홀 또는 네트워크 인터페이스는 이더넷이나 RF 트 랜시버와 같이 유선 또는 무선 연결을 통한 통신을 지원하는 어떤 적절한 구조들을 포함한다. 메모리는 컨트롤러/프로세서와 결합된다. 메모리의 일부는 RAM을 포함할 수 있고, 메모리 의 다른 일부는 플래쉬 메모리나 다른 ROM을 포함할 수 있다. 특정 실시예들에서, BIS 알고리즘과 같은 복수의 명령어들이 메모리에 저장된다. 복수의 명령어들은 컨트롤러/프로세서가 BIS 프로세스를 수행하고, BIS 알 고리즘에 의해 결정된 적어도 하나의 간섭 신호를 제거한 후 수신 신호를 디코딩하도록 구성된다. 이하에서 보다 상세히 설명되는 바와 같이, gNB의 송수신 경로들(RF 트랜시버들(372a-372n), TX 처리 회로 , 및/또는 RX 처리 회로를 이용하여 구현됨)은 FDD 셀들 및 TDD 셀들과의 어그리게이션 통신을 지원 한다. 도 3b가 gNB의 일 예를 도시하고 있지만, 도 3b에 대한 다양한 변경이 이루어질 수 있다. 예를 들어, gNB는 도 3a에 도시된 소정 개수의 각각의 구성 요소를 포함할 수 있다. 특정 예로서, 액세스 포인트는 다 수의 백홀 또는 네트워크 인터페이스들를 포함할 수 있고, 컨트롤러/프로세서는 서로 다른 네트워크 어드레스들 사이에 데이터를 라우팅 하는 라우팅 기능들을 지원할 수 있다. 다른 특정 예로서, TX 처리 회로 의 단일 경우와 RX 처리 회로의 단일 경우를 포함하는 것으로 도시되어 있지만, gNB는 각각에 대해 여러 경우들을 포함할 수 있다(각각의 RF 트랜시버 당 하나 등). 본 개시의 실시예들에서 제공되는 솔루션들은 상기 무선 네트워크에 적용될 수 있으며, 이에 한정되지 않는다는 점을 이해해야 한다. 무선 통신 시스템들에서, 기지국에서 사용자 단말(UE)로의 송신을 하향링크라고 하며, UE에서 기지국으로의 송 신을 상향링크라고 한다. 상향링크는 상향링크 송신(상향링크 전송, 업링크 송신 등으로도 지칭됨)에 대응하고, 상향링크 송신은 상향링크 채널들의 송신 및 상향링크 신호들의 송신 중 적어도 하나를 포함하며, 여기서 상향 링크 채널들은 PUSCH(physical uplink shared channel)들, PUCCH(physical uplink control channel)들 및 PRACH(physical random access channel)들을 포함하고, 상향링크 신호들은 상향링크 기준 신호들을 포함하고, 이에 한정되지 않는다. 기존의 상향링크 송신들에서, UE는 하나 또는 두 개의 송신 체인들을 지원할 수 있으며, UE는 두 개의 상향링크 캐리어들로 설정될 수 있다. UE가 두 개의 송신 체인들을 지원하는 경우, 상향링크 송신은 하나의 상향링크 캐 리어의 두 포트들(안테나 포트들)에서 이루어질 수도 있고, 하나의 캐리어의 한 포트와 다른 상향링크 캐리어의 한 포트에서 이루어질 수도 있다. UE가 두 개의 캐리어들에서 상향링크 송신을 수행할 경우 어느 정도까지는 상 향링크 자원들을 충분히 활용할 수 있지만, 그 구현이 비교적 고정되어 있고, 자원 활용이 유연하지 않으므로, 여전히 개선이 필요하다. 따라서, 본 개시의 실시예들은 상향링크 자원들을 보다 충분하고 유연하게 활용하고 통신 성능을 향상시키기 위 한 통신 방법을 제공한다. 본 개시의 기술적 솔루션들 및 본 개시의 기술적 솔루션들에 의한 상술한 기술적 문제점들의 해결 방법에 대하 여 구체적인 실시예들을 통해 아래에서 자세히 설명될 것이다. 다음의 구체적인 실시예들은 서로 결합될 수 있 으며, 동일하거나 유사한 개념들 또는 프로세스들은 일부 실시예들에서 반복되지 않을 수 있다. 본 개시의 실시 예들이 첨부된 도면들을 참조하여 아래에서 설명될 것이다. 다음 설명의 텍스트 및 첨부된 도면들은 단지 독자 들이 본 개시를 이해하도록 돕기 위한 예들로서 제공된 것이다. 이들은 어떤 식으로든 본 개시의 범위를 제한하 고자 하는 것이 아니다. 일부 실시예들 및 예들이 본 명세서에 개시된 내용들을 기반으로 제공되었지만, 예시된 실시예들 및 예들이 본 개시의 범위를 벗어나지 않고 변경될 수 있음은 당업자에게 명백할 것이다. 도 4는 본 개시의 실시예에 따라 통신 시스템에서 사용자 단말에 의해 수행되는 방법의 흐름도를 도시한다. 도 4에 도시된 바와 같이, 이 방법은 다음의 동작들을 포함할 수 있다. 단계 S410에서, 기지국에 의해 송신된 제1 정보가 수신되며, 이 제1 정보에는 스케줄링된 자원 및 송신 모드의 관련 정보가 포함된다. 단계 S420에서, 사용자 단말의 상향링크 송신 체인 상태가 제1 정보에 따라 결정된다. 본 개시의 실시예에서, 상향링크 자원은 상향링크 캐리어, 상향링크 서빙 셀, 또는 상향링크 대역폭 부분 (bandwidth part, BWP)일 수 있다. 이에 따라, 제1 정보는 적어도 하나의 상향링크 송신 체인에 대응하는 상향 링크 캐리어, 상향링크 서빙 셀, 또는 상향링크 BWP의 스케줄링 정보를 포함할 수 있다. 설명의 편의를 위해, 아래의 일부 실시예들 또는 예들에서, 상향링크 자원은 상향링크 캐리어를 예로 들어 설명될 것이다. 제1 정보는 상향링크 자원의 스케줄링 정보, 즉 상향링크 자원 스케줄링 정보를 포함한다. 기지국은 UE의 상향 링크 자원의 스케줄링을 구현하기 위한 스케줄링 정보를 UE에게 송신한다. 기지국이 UE를 스케줄링하는 방식은 본 개시의 실시예에 한정되지 않으며, 주기적 스케줄링, 비주기적 스케줄링, 동적 스케줄링, 동적 스케줄링 또 는 반지속적 스케줄링일 수 있다. 실제 구현들에서, 스케줄링 모드는 특정 통신 시나리오에 대응할 수 있다. 제1 정보의 정보 명칭은 본 개시의 실시예들에서 제한되지 않으며, 정보 명칭은 스케줄링 정보 또는 다른 정보 명칭들 또는 메시지 명칭들, 예를 들어 DCI(downlink control information) 또는 지시 정보(예를 들어, 반정적 지시 정보)일 수 있음에 유의해야 한다. 제1 정보는 시간 유닛의 상향링크 송신 정보(예를 들어, 상향링크 채널 들, 상향링크 기준 신호들)가 원-포트 또는 투-포트 송신 모드에서 동시에 송신되는 상향링크 자원의 수를 구체 적으로 지시할 수 있다. 시간 유닛의 그래뉼래러티(granularity)는 본 개시의 실시예에서 제한되지 않는다. 예 를 들어, 시간 유닛은 시간 슬롯 또는 다른 시간 듀레이션(duration)을 갖는 기간을 포함할 수 있으며, 이에 한 정되지 않는다. 선택적으로, 제1 정보는 적어도 하나의 상향링크 자원 및 상향링크 자원에 대응하는 송신 모드를 스케줄링할 수 있다. 즉, 적어도 하나의 상향링크 송신 체인에 대응하는 상향링크 자원 및 해당 송신 모드가 제1 정보에 따라 알려질 수 있다. 송신 모드는 1-포트/원-포트 송신 또는 듀얼-포트 송신(즉, 2-포트/투-포트 송신)이다. UE가 두 개의 상향링크 송신 체인들(dualUL)을 지원하도록 설정되고 UE가 하나의 상향링크 자원에서 투-포트 송 신을 지원하는 경우, UE는, 제1 정보를 기반으로, 적어도 하나의 상향링크 송신 체인이 위치되는 상향링크 자원 과, 상향링크 자원이 상향링크 송신에 사용될 때의 해당 송신 모드, 즉 적어도 하나의 포트 송신이 어느 상향링 크 자원에서 수행되는지를 알 수 있다. 이 지시를 구현하는 구체적인 형태는 본 개시의 실시예에 한정되지 않으 며, 명시적 지시 정보이거나 또는 암시적 지시 정보일 수도 있다. 선택적으로, 제1 정보는 상향링크 자원의 식 별 정보 및 송신 모드 지시자를 포함할 수 있다. 식별 정보 및 송신 모드 지시자의 구체적인 형태도 또한 본 개 시에 한정되지 않는다. 예를 들어, 상향링크 자원의 식별 정보는 상향링크 자원의 인덱스를 포함할 수 있으며, 이에 한정되지 않는다. 송신 모드 지시자 0은 원-포트 송신을 나타내고, 지시자 1은 투-포트 송신을 나타낸다. 일 예로서, UE가 3개의 상향링크 캐리어로 설정되어 있고, 3개의 상향링크 캐리어의 인덱스가 각각 1, 2, 3이고, 제1 정보가 캐리어 인덱스 1과 송신 모드 지시자 0을 포함하는 경우, UE는 제1 정보를 기반으로 하나의 상향링크 송신 체인이 인덱스가 1인 상향링크 캐리어에 있고 이 캐리어의 송신 모드가 원-포트 송신인 것으로 결정할 수 있다. 제1 정보에 의해 스케줄링된 상향링크 자원과 송신 모드는 UE의 상향링크 자원의 실제 송신 모 드이며, 즉, UE는 제1 정보의 스케줄링된 상향링크 자원과 해당 송신 모드에 따라 실제 상향링크 송신을 수행한 다는 점에 유의해야 한다. 본 개시의 실시예들에서, UE의 상향링크 송신 체인 상태는 UE에 의해 고려되는 UE의 상향링크 자원의 송신 모드 이며, 이 모드가 반드시 UE의 상향링크 자원의 실제 송신 모드와 동일하지는 않다. 예를 들어, 제1 정보에 따라 UE에 의해 결정된 실제 상향링크 송신 모드는 제1 상향링크 캐리어에서의 원-포트 송신일 수 있고, UE에 의해 고려되는 상향링크 송신 체인 상태는 제1 캐리어에서의 원-포트 송신 또는 제2 캐리어에서의 원-포트 송신일 수 있다. 기지국이 UE에게 제1 정보를 송신하는 구체적인 구현은 본 개시의 실시예들에 한정되지 않을 것이다. 선택적으 로, UE는 기지국에 의해 송신된 DCI를 수신하여 제1 정보를 획득할 수 있다. 제1 정보는 하나의 상향링크 자원 에 대한 스케줄링 정보 또는 두 개의 상향링크 자원에 대한 스케줄링 정보를 포함한다. 제1 정보가 두 개의 상 향링크 자원에 대한 스케줄링 정보를 포함하는 경우, 두 개의 스케줄링 정보는 각각 다른 DCI를 통해 기지국에 의해서 UE에게 송신될 수 있다. 본 개시의 실시예들에서, 사용자 단말의 상향링크 송신 체인 상태는 사용자 단말에 의해 채택된 상향링크 송신 모드 또는 케이스, 즉, 사용자 단말의 L개의 설정된 상향링크 자원들 중 UE에 의해 고려된, 포트 송신이 위치되 는 상향링크 자원, 즉, 사용자 단말에 의해 고려된, 두 개의 상향링크 송신 체인들이 위치되는 상향링크 자원으 로 해석될 수 있다. 상향링크 송신 체인이 위치되는 상향링크 자원의 송신 모드, 즉, 사용자 단말의 복수의 설 정된 상향링크 자원들 중 각 상향링크 자원의 송신 모드, 예를 들어, 원-포트 송신, 투-포트 송신 또는 무-포트 송신을 포함하는 것도 가능하다. 예를 들어, UE에 의해 고려된 지원되는 투-포트 송신이 하나의 상향링크 자원또는 두 개의 상향링크 자원에서 이루어진다(즉, 두 개의 상향링크 자원이 각각 원-포트 송신에 대응한다). 상향링크 송신을 수행할 필요가 있는 경우, UE는 제1 정보에 의해 스케줄링된 상향링크 자원 및 해당 송신 모드 를 기반으로, 해당 송신 모드에서 해당 상향링크 자원을 통해 기지국에게 상향링크 정보를 송신할 수 있다. 상 향링크 정보는 상향링크 채널 및 상향링크 신호 중 적어도 하나를 포함한다. 상향링크 신호는 상향링크 기준 신 호, 예를 들어 SRS(sounding reference signal)를 포함할 수 있다. 선택적으로, 본 개시의 실시예들에서 제공되는 방법은 두 개의 상향링크 송신 체인들(TX 체인들)을 지원하는 사 용자 단말에 적용될 수 있으며, 사용자 단말은 L개의 상향링크 자원들로 설정될 수 있다(여기서 ). 선택적 구현으로서, L개의 상향링크 자원은 적어도 3개의 상향링크 자원일 수 있다. 선택적으로, 본 개시의 실시예들에서의 방법은 추가로 다음을 포함한다: 설정 정보를 수신하는 단계, 이 설정 정보는 사용자 단말의 상향링크 자원들과 관련된 설정을 포함하며, 즉 사 용자 단말의 상향링크 자원들을 결정하는데 사용된다. 선택적으로, 설정 정보는 상향링크 자원의 수와 식별 정보(예를 들어, 상향링크 자원의 인덱스들, 상향링크 자 원에 대응하는 시간 도메인 또는 주파수 도메인 위치 등 중 적어도 하나)를 포함한다. 선택적으로, 설정 정보는 추가로 사용자 단말의 초기 상향링크 송신 체인 상태를 포함할 수 있다(예를 들어, 사용자 단말에 의해 지원되 는 두 개의 상향링크 송신 체인들이 어느 상향링크 자원(들)에 있는지). 일 예로서, 상위 계층 시그널링을 통해 UE에 대해 3개의 상향링크 캐리어가 설정되어 있고 각각 1, 2, 3의 인덱스를 가지며, UE의 2개의 상향링크 송신 체인이 인덱스가 1인 상향링크 캐리어에 있거나, 하나의 상향링크 송신 체인이 인덱스가 1인 상향링크 캐리어에 있고 다른 상향링크 송신 체인이 인덱스가 2인 상향링크 캐리어에 있다고 지시되어 있는 것으로 가정한다. 상술 한 설정에 따라, UE는 상향링크 자원의 초기 송신 모드(UE에 의해 고려되는 초기 송신 체인 상태)를 알 수 있다. UE가 초기 상향링크 송신 체인 상태로 설정되어 있는 경우, UE가 설정 정보 수신 시에 처음으로 제1 정보를 수 신하고 UE가 제1 정보에 따라 사용자 단말의 상향링크 송신 체인 상태를 결정할 때, 초기 상향링크 송신 체인 상태는 UE의 이전 상향링크 송신 체인 상태(이전 상향링크 송신 체인 상태는 다음 설명을 참조할 수 있음)이며; UE가 그 후에 두 번째로 제1 정보를 수신할 때, UE의 이전 상향링크 송신 체인 상태는 UE가 마지막으로 결정한 상향링크 송신 체인 상태임을 이해해야 한다. 이때, UE의 이전 상향링크 송신 체인 상태는 초기 상향링크 송신 체인 상태일 수도 있고(UE의 상향링크 송신 체인 상태가 스위칭되지 않음), 초기 상향링크 송신 체인 상태가 아 닐 수도 있다. 선택적으로, 상향링크 자원이 상향링크 캐리어인 경우를 예로 들면, 본 개시에 의해 제공되는 방법은 구현 중에 다음의 단계들을 포함할 수 있다. 단계 S410에서, UE는 기지국에 의해 송신된 제1 정보를 수신하며, 제1 정보에는 스케줄링된 자원들 및 송신 모 드의 관련 정보가 포함된다. 단계 S420에서, UE는, 수신된 제1 정보를 기반으로, UE에 의해 고려되는 상향링크 송신 체인 상태, 즉, UE에 의 해 고려되는 두 개의 상향링크 송신 체인들 또는 상향링크 송신 포트들이 존재하는 상향링크 캐리어를 결정한다. 선택적으로, 본 방법은 UE에 의해서, 제1 정보에 의해 스케줄링된 상향링크 자원 및 송신 모드에 따라, 상향링 크 채널 및 상향링크 기준 신호 중 적어도 하나를 기지국으로 송신하는 단계를 추가로 포함한다. 즉, 본 개시의 실시예들에서, 제1 정보에 의해 스케줄링된 상향링크 자원 및 송신 모드는 UE가 상향링크 송신을 수행하는 실제 송신 모드이고, UE의 상향링크 송신 체인 상태는 UE에 의해 고려되는 상향링크 자원의 송신 모드 이다. 예를 들어, UE가 인덱스 1, 2 및 3을 갖는 3개의 상향링크 캐리어로 설정되어 있고 제1 정보가 원-포트 송신을 위해 인덱스 1을 가진 캐리어를 스케줄링한 경우, UE의 실제 상향링크 자원 송신 모드는 1P+0P+0P로 표 시될 수 있으며, 즉, 원-포트 송신이 인덱스 1을 가진 캐리어에서 수행된다. 본 개시의 실시예들에서 제공되는 방법에 따라 UE의 다른 상향링크 송신 체인이 인덱스 2를 가진 캐리어에 있다고 결정되는 경우, UE의 상향링크 송신 체인 상태는 1T+1T+0T로 표시될 수 있으며, 즉, UE는 UE의 원-포트 송신이 인덱스 1을 가진 캐리어와 인덱 스 2를 가진 캐리어에서 이루어지는 것으로 간주해야 한다. 본 개시의 실시예들에서 제공되는 방법에 따라 UE의 다른 상향링크 송신 체인이 인덱스 1을 가진 캐리어에 존재하는 것으로 결정되는 경우, UE의 상향링크 송신 체 인 상태는 2T+0T+0T로 표시될 수 있으며, 즉, UE는 UE의 투-포트 송신이 인덱스 1을 가진 상향링크 캐리어에서이루어지는 것으로 간주해야 한다. 단계 S410 이전에, 이 방법은 상향링크 자원들에 대한 설정 정보를 수신하는 단계를 추가로 포함하며, 여기서 설정 정보는 상향링크 자원들의 수 및 인덱스들을 포함할 수 있다. 선택적으로, 설정 정보는 사용자 단말의 초 기 상향링크 송신 체인 상태를 또한 나타낼 수 있다. UE가 두 개의 상향링크 송신 체인들을 지원하는 경우, UE는 두 개의 상향링크 송신 체인들을 사용하여 최대 두 개의 상향링크 캐리어들에서 상향링크 채널들 또는 신호들을 송신할 수 있다. 기지국이 UE에 대해 두 개보다 많 은 상향링크 캐리어를 설정하는 경우, UE는 더욱 가능한 상향링크 송신 체인 상태들을 가질 수 있으며, UE는 기 지국의 스케줄링에 따라 UE의 현재 상향링크 송신 체인 상태를 결정하고 스케줄링 정보를 기반으로 상향링크 송 신을 수행할 수 있다. 본 개시의 실시예들에서 제공되는 방법에서, 기지국이 UE가 최대 2개의 상향링크 캐리어에서 상향링크 채널들 또는 신호들을 송신하기 위해 2개의 상향링크 송신 체인들을 사용할 수 있도록 설정할 때 UE의 상향링크 송신 체인 상태를 결정하는 것도 가능하다. 예를 들어, UE는 상위 계층 시그널링을 수신하여 3개의 상향링크 캐리어 들로 설정되며(즉, 상위 계층 설정을 통해 UE에 대해 3개의 상향링크 자원들이 설정됨), 상향링크 상태는 제1 상향링크 캐리어에 상향링크가 하나 있고, 제2 상향링크 캐리어에 상향링크가 하나 있고, 제3 상향링크 캐리어 에 상향링크가 없으므로, UE의 상향링크 상태는 1T+1T+0T(상위 계층 시그널링에 의해 설정된 초기 상향링크 송 신 체인 상태)이다. 상향링크 자원 스케줄링을 수행해야 하는 경우, UE는 기지국에 의해 송신된 제1 정보에 따 라 UE의 현재 상향링크 송신 체인 상태를 결정할 수 있다. 선택적으로, 적어도 하나의 상향링크 자원의 송신 모 드가 제1 정보에 따라 결정될 수 있으며, 적어도 하나의 상향링크 자원의 결정된 송신 모드와 UE의 상향링크 자 원의 이전 송신 모드에 따라, 상향링크 송신 체인 상태를 스위칭할지 여부가 결정될 수 있다. 상향링크 송신 체 인 상태를 스위칭해야 하는 경우, 현재 송신 체인 상태는 제1 정보에 따라 결정될 수 있다. 상술한 설명으로부 터, 상향링크 자원 스케줄링이 상위 계층 시그널링 설정을 수신한 이후 UE의 첫 번째 스케줄링인 경우, UE의 이 전 상향링크 송신 체인 상태는 상위 계층 설정의 1T+1T+0T이고; 상향링크 자원 스케줄링이 첫 번째 스케줄링이 아닌 경우, UE의 이전 송신 체인 상태는 마지막 스케줄링 동안 UE에 의해 결정된 상향링크 송신 체인 상태임을 알 수 있다. 다른 선택적 구현으로서, 상위 계층 시그널링을 통해 초기 송신 체인 상태를 설정하지 않는 것도 가능하다. 첫 번째 스케줄링 동안, UE는 상향링크 송신 모드가 스위칭될 것으로 간주할 수 있으며, UE의 송신 체인 상태는 제 1 정보에 따라 결정될 수 있다. 본 개시의 실시예들에서 제공되는 방법에서, UE가 두 개의 상향링크 송신 체인 들을 지원하고, 기지국이 UE에 대해 두 개보다 많은 상향링크 자원들을 설정할 수 있는 경우, UE는 본 개시의 실시예들에서 제공되는 방법을 수행하여, 기지국으로부터 수신된 제1 정보에 따라, 두 개의 상향링크 송신 체인 들이 위치되는 상향링크 자원을 UE가 고려해야 하는지 또는 UE의 각 상향링크 자원에 대응하는 링크 상태, 예를 들어, 각 상향링크 자원이 상향링크 송신 체인 또는 송신 포트를 갖고 있는지 여부를 결정할 수 있다. 본 개시의 실시예들에서 제공되는 방법에 따라, 기지국은 UE에 대해 복수의 상향링크 자원들을 설정할 수 있으 므로, UE의 자원 스케줄링이 보다 유연하게 구현될 수 있다. UE가 두 개의 상향링크 송신 체인들을 지원하는 경 우, UE는 스케줄링을 통해 복수의 상향링크 자원들 중 더 나은 상향링크 자원에서 상향링크 송신을 수행할 수 있으므로, 상향링크 송신의 통신 효과가 보다 양호하게 보장될 수 있다. 실제 구현 프로세스 동안, 기지국에 의해 UE에 대해 설정되는 상향링크 자원의 수도 2개일 수 있음을 이해해야 한다. 예를 들어, 상향링크 캐리어가 2개 존재한다. 즉, 실제 응용들에서 L의 값은 2일 수도 있다. UE의 제한된 상향링크 송신 용량으로 인해, UE는 원-포트 송신 모드에서는 최대 N(N은 2일 수 있음)개의 상향링크 캐리어를 통해 동시적 송신을 수행할 수 있고, UE는 투-포트 송신 모드에서는 최대 M(M은 1일 수 있음)개의 상향링크 캐 리어를 통해 동시적 송신을 수행할 수 있으며, 기지국에 의해 UE에 대해 설정되는 상향링크 캐리어의 수는 L(L 은 양의 정수; 예를 들어, L은 2, 3, 4 등일 수 있음)이고, 여기서 L은 N보다 크고 M보다 클 수 있다. 본 개시 의 실시예들에서 제공되는 방법이 기존 통신 모드들과 모순 또는 충돌하지 않는 경우, 본 개시에 의해 제공되는 방법은 기존 통신 모드들과 함께 사용될 수 있다. 본 개시의 선택적 실시예에서, 제1 정보에 따라 사용자 단말의 상향링크 송신 체인 상태를 결정하는 단계 S420 은 다음을 포함할 수 있다: 제1 정보 및 이전 상향링크 송신 체인 상태(상향링크 자원의 이전 송신 모드)에 따라 사용자 단말의 상향링크 송신 체인 상태가 스위칭된 것으로 결정되는 경우, 사용자 단말의 상향링크 송신 체인 상태를 결정하는 단계.사용자 단말의 상향링크 송신 체인 상태가 스위칭되지 않은 것으로 결정되는 경우, 사용자 단말의 이전 상향링 크 송신 체인 상태가 사용자 단말의 상향링크 송신 체인 상태로서 사용된다. 사용자 단말의 이전 상향링크 송신 체인 상태란 UE의 이전 상향링크 송신에 대응하는 상향링크 자원 및 송신 모 드를 의미한다. 기지국에 의해 송신된 제1 정보 수신 시에, UE는, 이 정보에 따라, UE의 하나 또는 두 개의 상향링크 송신 체인 들에 대응하는 상향링크 자원 및 송신 모드를 결정할 수 있다. 결정된 상향링크 자원 및 송신 모드와 이전 상향 링크 송신 체인 상태를 기반으로, UE는 상향링크 송신 체인 상태를 스위칭할지 여부를 결정할 수 있다. 상향링 크 송신 체인 상태를 스위칭하지 않기로 결정된 경우, UE의 현재 상향링크 송신 체인 상태는 이전 상향링크 송 신 체인 상태이고(즉, 이전 상향링크 송신 체인 상태가 유지되고); 상향링크 송신 체인 상태를 스위칭하기로 결 정된 경우, UE의 현재 상향링크 송신 체인 상태는 제1 정보에 따라 결정될 수 있다. 제1 정보에 따라 UE의 두 개의 상향링크 송신 체인들에 대응하는 상향링크 자원 및 송신 모드가 결정될 수 있는 경우, UE의 현재 상향링크 송신 체인 상태는 제1 정보에 따라 결정된 두 개의 상향링크 송신 체인들에 대응하는 상향링크 자원이고; 제1 정보에 따라 하나의 상향링크 송신 체인에 대응하는 상향링크 자원이 결정되고, 상향링 크 송신 체인 상태를 스위칭하기로 결정된 경우, UE는 다른 상향링크 송신 체인이 위치되는 상향링크 자원을 추 가로 결정해야 한다. 구체적으로, 제1 정보에 따라 하나의 상향링크 송신 체인에 대응하는 상향링크 자원이 결 정될 수 있고(즉, 스케줄링된 상향링크 자원에서 원 포트 송신이 있음), 상위 계층 설정 또는 프로토콜 사전 결 정에 따라 다른 상향링크 송신 체인에 대응하는 상향링크 자원이 결정될 수 있다. 두 개의 상향링크 송신 체인 들에 대응하는 상향링크 자원들은 동일한 상향링크 자원일 수 있거나(두 개의 상향링크 송신 체인들에 대응하는 상향링크 자원들이 동일한 상향링크 자원인 경우, 상향링크 송신 체인 상태는 UE가 스케줄링된 상향링크 캐리어 에서 투-포트 송신이 이루어지는 것으로 간주하는 상태임), 또는 서로 다른 상향링크 자원들일 수 있다(즉, UE 는 제1 정보에 의해 스케줄링된 캐리어와 결정된 다른 캐리어에서 원-포트 송신이 이루어지는 것으로 간주해야 함). 사용자 단말의 상향링크 송신 체인 상태가 스위칭되어야 하는 상황들과 사용자 단말의 상향링크 송신 체인 상태 가 스위칭될 필요가 없는 상황들은 프로토콜을 통해 사전 결정될 수 있다. 선택적으로는, 기존 통신 표준 프로 토콜들의 규칙들이 채택될 수 있다. 예를 들어, 시간 슬롯 t2에서, 사용자 단말은 제1 정보에 따라 하나의 상향 링크 송신 체인이 인덱스 1을 가진 상향링크 캐리어에 있고, 송신 모드가 원-포트 송신이며, 시간 슬롯 t1(시간 슬롯 t1은 시간 슬롯 t2보다 앞선 이전 시간 슬롯임)에서 UE 장비의 상향링크 송신 체인 상태가 인덱스 1을 가 진 상향링크 캐리어에 두 개의 상향링크 송신 체인들이 있는 상태인 것으로 결정한다. 즉, 인덱스 1을 가진 상 향링크 캐리어는 투-포트 송신이다. 이때, 사용자 단말의 상향링크 송신 체인 상태를 스위칭할 필요가 없다. 본 개시의 선택적 실시예에서, 제1 정보가 원-포트 송신을 위해 2개의 상향링크 자원을 스케줄링하거나, 투-포 트 송신을 위해 1개의 상향링크 자원을 스케줄링하는 경우, UE는 제1 정보에 따라 UE의 현재 상향링크 송신 체 인 상태를 직접 결정할 수 있으며; 그리고, 제1 정보가 제1 상향링크 자원을 스케줄링하고 송신 모드가 원-포트 송신인 경우, 상향링크 송신을 스위칭해야 할 때, UE는 제1 정보와 제2 정보의 적어도 하나의 항목에 따라 사용 자 단말의 상향링크 자원의 송신 모드를 결정해야 한다. 선택적으로, 본 개시의 실시예들에서, 제1 정보에 따라 사용자 단말의 상향링크 송신 체인 상태를 결정하는 단 계는 다음을 포함할 수 있다: 제1 정보 및 다음 중 적어도 하나에 따라 사용자 단말의 상향링크 송신 체인 상태를 결정하는 단계: 상위 계층 설정; 프로토콜 사전 결정; 사용자 단말의 능력; 및 사용자 단말의 이전 상향링크 송신 체인 상태; 여기서 상위 계층 설정에는 상향링크 송신 체인에 대응하는 상향링크 자원을 결정하는데 사용되는 정보가 포함 된다. 실제 구현 프로세스 동안에, 기지국에 의해 송신된 제1 정보가 단 하나의 상향링크 자원(즉, 제1 상향링크 자원)만을 지시하고 송신 모드가 원-포트 송신인 경우, UE는, 제1 정보에 따라, 하나의 상향링크 송신 체인이 위치된 상향링크 자원을 알 수 있다. 이 경우, UE는 다른 상향링크 송신 체인에 대응하는 상향링크 자원을 추가 로 결정해야 한다. 제1 상향링크 자원이 결정되었으므로, 다른 상향링크 송신 체인에 대응하는 상향링크 자원이 결정되면, 다른 상향링크 송신 체인에 대한 상향링크 자원에 해당하는 송신 모드는 자연적으로 알 수 있다. 예 를 들어, 다른 상향링크 송신 체인에 대응하는 상향링크 자원이 제1 상향링크 자원인 경우, UE의 상향링크 송신체인 상태는 제1 상향링크 자원에서 투-포트 송신을 수행하는 것이며; 그리고, 다른 상향링크 송신 체인에 대응 하는 상향링크 자원이 제1 상향링크 자원이 아닌 경우, UE의 상향링크 송신 체인 상태는 두 개의 상향링크 자원 들에서 원-포트 송신을 수행하는 것이다(즉, 두 개의 상향링크 자원에서 원-포트 송신이 전송된다). 선택적으로, UE는, 상위 계층 설정들 중 하나 이상에 따라, 프로토콜 사전 결정, 사용자 단말의 능력 및 사용자 단말의 이전 상향링크 송신 체인 상태, 다른 상향링크 송신 체인에 대응하는 상향링크 자원을 결정할 수 있다. 상위 계층 설정에는 UE의 상향링크 송신 체인에 대응하는 상향링크 자원을 결정하는데 사용되는 정보가 포함된 다. 이 정보는 다른 상향링크 송신 체인에 대응하는 상향링크 자원을 직접 결정할 수 있는 정보일 수도 있고, 다른 상향링크 송신 체인에 대응하는 상향링크 자원을 결정하기 위해 다른 정보와 조합되어야 하는 정보일 수도 있다. 예를 들어, 상위 계층 설정에는 다른 상향링크 송신 체인에 대응하는 상향링크 자원이 제1 상향링크 자원 인지 여부를 결정하는데 사용되는 정보가 포함될 수 있다. 따라서, UE는, 상위 계층 설정에 따라, 두 개의 상향 링크 송신 체인들이 동일한 상향링크 자원에 있는지 여부를 알 수 있다. 두 개의 상향링크 송신 체인들이 동일 한 상향링크 자원에 있는 것으로 결정되는 경우, UE는 상위 계층 설정에 따라 다른 상향링크 송신 체인에 대응 하는 상향링크 자원을 알 수 있으며; 그리고, 두 개의 상향링크 송신 체인들이 동일한 상향링크 자원에 있지 않 은 것으로 결정되는 경우, UE는 다른 정보와 조합하여, 다른 상향링크 송신 체인에 대응하는 상향링크 자원을 추가로 결정해야 한다. 프로토콜 사전 결정이란 통신 시스템에서 사전 설정되거나 사전 결정된 상향링크 자원 결정/선택 규칙을 의미한 다. UE는, 프로토콜 사전 결정 또는 프로토콜 사전 결정과 다른 정보의 조합에 따라, 다른 상향링크 송신 체인 에 대응하는 상향링크 자원을 결정할 수 있다. 예를 들어, 서로 다른 상향링크 자원들 간의 페어링 관계가 프로 토콜을 통해 사전 결정된다. UE가 제1 정보에 따라 하나의 상향링크 송신 체인에 대응하는 제1 상향링크 자원을 결정한 후, UE는, 사전 결정된 페어링 관계에 따라, 제1 상향링크 자원과 페어링된 상향링크 자원을, 다른 상향 링크 송신 체인에 대응하는 상향링크 자원으로 결정할 수 있다. 선택적으로, 실제 응용들에서, 상향링크 자원을 결정/선택하는 방식은 UE의 능력에 따라 사전 결정되거나 설정 될 수도 있다. 예를 들어, 서로 다른 방식들이 UE의 서로 다른 능력들에 따라 사전 결정되거나 설정될 수 있으 므로, UE는 자신의 능력에 따라 해당 방식을 채택하여 다른 상향링크 송신 체인에 대응하는 상향링크 자원을 결 정할 수 있다. 또한, 사용자 단말의 이전 송신 체인 상태와 사용자 단말이 스위칭될 송신 체인 상태 사이에서 만족되어야 하는 규칙 또는 요구 사항도 사전 결정되거나 설정될 수 있다(예를 들어, 어떤 상태들 사이에서 스위칭이 허용되는지, 어떤 상태들 사이에서 스위칭이 허용되지 않는지). 따라서, UE가 제1 정보에 따라 상태 스위칭을 수행하기로 결정한 경우, UE는 해당 규칙 또는 요구 사항을 만족한다는 전제 하에 다른 상향링크 송신 체인에 대응하는 상향링크 자원을 결정할 수 있다. 실제 응용들에서, 상위 계층 설정에 따라 다른 상향링크 송신 체인에 대응하는 상향링크 자원을 결정하는 것이 필요한 경우, 본 개시의 방법은 상위 계층 설정을 획득하는 단계를 추가로 포함한다는 것을 이해해야 한다. 본 개시의 선택적 실시예에서, 제1 정보에 따라 사용자 단말의 상향링크 송신 체인 상태를 결정하는 단계는 다 음을 포함할 수 있다: 제1 정보와 제2 정보의 적어도 하나의 항목에 따라 사용자 단말의 상향링크 송신 체인 상태를 결정하는 단계; 여기서 제2 정보는 다음을 포함한다: 사용자 단말의 각 상향링크 자원의 인덱스; 사용자 단말의 각 상향링크 자원의 우선 순위 정보; 사용자 단말의 상향링크 자원들 중 가장 최근에 상향링크 송신을 수행한 상향링크 자원; 사용자 단말의 상향링크 자원들 간의 페어링 관계; 사용자 단말의 이전 상향링크 송신 체인 상태; 서로 다른 상향링크 송신 체인 상태들 간의 스위칭이 허용되지 않음; 서로 다른 상향링크 송신 체인 상태들 간의 스위칭이 허용됨; 사용자 단말의 두 개의 상향링크 송신 체인들이 동일한 상향링크 자원에 위치되는지 여부를 지시하는 제1 설정; 사용자 단말의 각 상향링크 자원에 두 개의 상향링크 송신 체인들이 있는지 여부를 지시하는 제2 설정; 및 사용자 단말의 능력 정보. 선택적으로, 상기 정보의 하나 이상의 항목은 상위 계층 시그널링을 통해 설정(즉, 상위 계층을 통해 설정)되거 나 프로토콜을 통해 사전 결정될 수 있다. 실제 응용들에서, 사용자 단말의 상향링크 송신 체인 상태를 결정하 는 단계는 제1 정보와 제2 정보의 하나 이상의 항목에 따라 구현될 수 있다. 즉, 여러 개의 정보가 단독으로 또 는 조합하여 사용될 수 있다. 예를 들어, 제1 정보에 따라 원-포트 송신에 대응하는 제1 상향링크 자원이 결정될 수 있는 경우, 다른 송신 포 트(즉, 다른 상향링크 송신 체인)가 위치되는 상향링크 자원은 UE에 대해 설정된 각 상향링크 자원의 인덱스 크 기에 따라 결정될 수 있다. 예를 들어, 프로토콜 사전 결정 또는 상위 계층 설정을 통해, 상향링크 송신을 위한 상향링크 자원들이 상향링크 자원들의 가장 큰 인덱스로부터 가장 작은 인덱스로의(또는 가장 작은 인덱스로부 터 가장 큰 인덱스로의) 순서로 결정될 수 있다. 예를 들어, UE의 상향링크 자원들(또는 제1 상향링크 자원을 제외한 상향링크 자원들) 중 가장 큰 인덱스를 가진 상향링크 자원이 다른 송신 포트에 대응하는 상향링크 자원 으로서 결정된다. 또는, UE의 L개 상향링크 자원들 간의 각 소스의 우선 순위는 상위 계층 시그널링을 통해 설 정될 수 있다. L개 상향링크 자원들 중에는 동일한 우선 순위를 갖는 상향링크 자원들이 있을 수도 있고, L개 상향링크 자원들이 서로 다른 우선 순위들을 가질 수도 있다. 프로토콜이 더 높은 우선 순위를 가진 상향링크 자원을 상향링크 송신 체인이 위치되는 자원으로 우선적으로 사용하도록 규정하는 것으로 가정하는 경우, UE는 각 상향링크 자원의 우선 순위에 따라, 가장 높은 우선 순위를 가진 상향링크 자원을, 원-포트 송신이 위치되는 상향링크 자원으로 결정할 수 있거나; 또는, UE가 상위 계층 시그널링에 따라 다른 상향링크 송신 체인에 대응 하는 자원이 제1 상향링크 자원이 아니라고 결정하는 경우, UE는 제2 상향링크 자원들 중 가장 높은 우선 순위 를 가진 상향링크 자원을, 다른 상향링크 송신 체인이 위치되는 상향링크 자원으로 결정할 수 있다. 즉, UE에 의해 고려되는 다른 상향링크 송신 체인이 위치되는 상향링크 자원은 가장 높은 우선 순위로부터 가장 낮은 우 선 순위로의(또는 가장 낮은 우선 순위로부터 가장 높은 우선 순위로의) 순서로 결정될 수 있다. 예를 들어, UE 의 상향링크 자원들(또는 제1 상향링크 자원을 제외한 상향링크 자원들) 중 가장 높거나 가장 낮은 우선 순위를 가진 상향링크 자원을, 다른 송신 포트에 대응하는 상향링크 자원으로 결정한다. 선택적으로, 사용자 단말의 상향링크 자원들 중 최근에 상향링크 송신을 수행한 상향링크 자원이 프로토콜을 통 해 사전 결정되거나 상위 계층 시그널링을 통해 설정될 수 있다. 사용자 단말의 상향링크 자원들(또는 제1 상향 링크 자원을 제외한 상향링크 자원들) 중 최근에 상향링크 송신을 수행한 상향링크 자원 또는 상향링크 신호 송 신을 위한 상향링크 자원은 다른 상향링크 송신 체인에 대응하는 상향링크 자원으로서 사용된다. 선택적으로, 사용자 단말의 상향링크 자원들 간의 페어링 관계와 관련하여, UE의 상향링크 자원들 간의 페어링 관계가 프로토콜을 통해 사전 결정되거나 상위 계층 시그널링을 통해 설정될 수 있다. 제1 정보에 따라 제1 상 향링크 자원에서 원-포트 송신이 이루어지는 것으로 결정되는 경우, 제1 상향링크 자원과 페어링된 상향링크 자 원은 다른 상향링크 송신 체인에 대응하는 상향링크 자원으로서 결정될 수 있다. 페어링 관계는 두 개의 상향링크 자원들 간의 바인딩 관계일 수도 있고, 하나의 상향링크 자원의 바인딩 관계일 수도 있다. 하나의 상향링크 자원의 바인딩 관계는 UE의 두 개의 상향링크 송신 체인들이 이 상향링크 자원에 위치된다는 사실, 즉 UE에 의해 고려되는 투-포트 송신들이 이 상향링크 자원에서 이루어진다는 사실로 해석될 수 있다. 즉, 이 상향링크 자원에 대응하는 송신 모드는 투-포트 송신이다. L개 상향링크 자원들 중 제1 상향링 크 자원(임의의 상향링크 자원일 수 있음)에 대응하는 페어링 관계가 제1 상향링크 자원인 것으로 가정하면, 제 1 상향링크 자원이 제1 정보에 따라 결정되고 송신 모드가 원-포트 송신인 경우, 제1 상향링크 자원에 대응하는 페어링 관계에 따라 다른 상향링크 송신 체인에 대응하는 상향링크 자원이 제1 상향링크 자원이고, 제1 상향링 크 자원이 투-포트 송신이며, 다른 상향링크 자원들에서는 송신이 존재하지 않는 것으로 결정할 수 있다. 선택적으로, 페어링 관계는 또한 상위 계층 시그널링 설정을 통해 직접 설정된 두 개의 상향링크 송신 체인들에 대응하는 상향링크 송신 자원들 간의 대응 관계일 수 있다. 따라서, 원-포트 송신을 위한 제1 상향링크 자원이 제1 정보에 따라 결정된 후, 제1 상향링크 자원에 대응하는 다른 상향링크 송신 체인에 대응하는 상향링크 자원 (제1 상향링크 자원 또는 다른 상향링크 자원들일 수 있음)은 상위 계층 시그널링 설정에 따라 알 수 있다. 예 를 들어, 기지국은 UE에 대해 3개의 상향링크 캐리어(설명의 편의상 캐리어 1, 캐리어 2 및 캐리어 3이라고 함)를 설정한다. 상위 계층 시그널링을 통해 캐리어 1이 원-포트 송신인 것으로 설정된 경우, 다른 상향링크 송신 체인은 캐리어 2에 있고; 캐리어 2가 원-포트 송신인 경우, 다른 상향링크 송신 체인은 캐리어 3에 있고; 그 리고, 캐리어 3이 원-포트 송신인 경우, 다른 상향링크 송신 체인은 캐리어 1에 있다. 따라서, UE가 제1 정보에 따라 하나의 상향링크 송신 체인에 대응하는 상향링크 캐리어가 캐리어 1인 것으로 결정한 후(즉, 제1 정보가 원-포트 송신을 위해 캐리어 1을 스케줄링함), 다른 상향링크 송신 체인에 대응하는 상향링크 캐리어가 캐리어 2인 것으로 결정될 수 있다. 본 개시의 실시예들에서는, 서로 다른 상향링크 송신 체인 상태들 간의 허용 또는 허용되지 않는 스위칭과 관련 하여, 서로 다른 UE들이 서로 다른 능력들을 가질 수 있거나 일부 상태들 간의 스위칭 구현/설정이 너무 복잡할 수 있다는 점을 고려하여, UE에 의해 허용되지 않는 상향링크 송신 체인 상태들 간의 스위칭 또는 UE에 의해 허 용되는 상향링크 송신 체인 상태들 간의 스위칭이 프로토콜을 통해 사전 결정되거나 상위 계층 시그널링을 통해 설정될 수도 있다. 따라서, 현재 상향링크 송신 체인 상태를 결정하는 동안에, UE는 송신 체인 상태들 간의 허 용 및/또는 허용되지 않는 스위칭에 대한 규칙들에 따라 결정을 행할 필요가 있다. 즉, 다른 상향링크 송신 체인에 대응하는 상향링크 자원은 사용자 단말의 이전 상향링크 송신 체인 상태, 제1 정보에 따라 이미 결정된 원-포트 송신을 위한 제1 상향링크 자원, 서로 다른 상향링크 송신 체인 상태들 간에 허용되지 않는 스위칭에 따라 결정될 수 있거나; 또는. 서로 다른 능력들을 가진 사용자 단말에 의해 허용되는 서로 다른 상향링크 송신 체인 상태들 간의 스위칭은 상위 계층을 통해 사전 결정되거나 설정될 수 있으며, UE 는 자신의 능력과 이전 상향링크 송신 체인 상태에 따라, 사용자 단말에 의해 현재 스위칭될 수 있는 상향링크 송신 체인 상태를 결정할 수 있다. 스위칭될 수 있는 상태가 하나뿐인 경우, 스위칭될 수 있는 상태는 사용자 단말의 현재 상향링크 송신 체인 상태이며; 스위칭될 수 있는 상태가 두 개 이상인 경우, 다른 상향링크 송신 체인에 대응하는 상향링크 자원은 프로토콜 사전 결정 또는 상위 계층 설정에 따라 추가로 결정될 수 있다. 예 를 들어, 스위칭될 수 있는 적어도 두 개의 상태에 있어서, 더 높은 우선 순위를 가진 제2 상향링크 자원이 속 하는 상태가, 사용자 단말의 현재 상향링크 송신 체인 상태로 결정될 수 있다. 선택적으로, 제1 설정 또는 제2 설정은 상위 계층 시그널링을 통해 설정될 수 있다. 제1 설정 및 제2 설정의 명 칭은 본 개시의 실시예들에 한정되지 않는다. 제1 설정과 관련하여, UE에 대해 설정된 L개 상향링크 자원들 중 각 상향링크 자원에 대해, 하나의 포트에서 상향링크 채널들 또는 상향링크 신호들을 송신하는 상향링크 캐리어 가 두 개의 상향링크 송신 체인들에 있는지, 또는 하나의 포트에서 상향링크 채널들 또는 상향링크 신호들을 송 신하는 상향링크 캐리어가 하나의 상향링크 송신 체인에 있으며 다른 상향링크 캐리어들은 다른 상향링크 체인 에 있는지, 즉, 두 개의 상향링크 송신 체인들이 동일한 상향링크 자원에 있는지 여부가 균일하게 설정될 수 있 다. 선택적으로, 실제 구현 동안에, 상위 계층 시그널링을 통해 설정이 수행될 수 있다. 이 설정 정보에 따라, UE는 다른 상향링크 송신 체인에 대응하는 상향링크 자원이 제1 정보에 의해 지시된 제1 상향링크 자원인지 여 부, 즉 두 개의 상향링크 송신 체인들이 동일한 상향링크 자원에 있는지 여부를 알 수 있다. 제2 설정과 관련하여, UE에 대해 설정된 L개 상향링크 자원들 중 각 상향링크 자원에 대해, 하나의 포트에서 상 향링크 채널들 또는 상향링크 신호들을 송신하는 상향링크 캐리어가 두 개의 상향링크 송신 체인들에 있는지, 또는 하나의 포트에서 상향링크 채널들 또는 상향링크 신호들을 송신하는 상향링크 캐리어가 하나의 상향링크 송신 체인에 있으며 다른 상향링크 캐리어는 다른 상향링크 송신 체인에 있는지, 즉 하나의 상향링크 캐리어가 하나의 상향링크 송신 체인에 대응하는지 또는 두 개의 상향링크 송신 체인들에 대응하는지 여부가 개별적으로 설정될 수 있다. 선택적으로, 제2 설정과 관련하여, 실제 구현 동안에, L개의 개별 상위 계층 시그널링을 통해 L개 상향링크 자원들에 대한 설정들이 개별적으로 구현되며, 여기서 서로 다른 상향링크 자원들은 동일하거나 상이한 설정들을 가질 수 있다. 제2 설정이 채택되는 경우, UE가 제1 상향링크 자원을 결정한 후, UE는 제1 상 향링크 자원에 대응하는 상위 계층 설정에 따라, 다른 상향링크 송신 체인에 대응하는 상향링크가 제1 정보에 의해 지시된 제1 상향링크 자원인지 여부를 알 수 있다. 선택적으로, 제1 설정 또는 제2 설정은 사용자 단말의 상향링크 스위칭의 송신 상태(TxState)의 설정일 수 있다. 선택적으로, 이 설정은 기존 표준 프로토콜들의 uplinkTxSwitching-DualUL-TxState 상위 계층 시그널링을 채택하여 설정될 수 있다. 선택적으로, 이 설정은 UE의 두 개의 상향링크 송신 체인들이 동일한 상향링크 캐리 어에 있는지 여부를 지시하는데 사용될 수 있다. 예를 들어, UE가 원-포트/원-체인 송신(OneT)으로 설정되고, UE가 하나의 주파수 대역의 하나의 상향링크 자원(예를 들면, 캐리어)에서 2-포트 송신이 지원될 수 있는 동작 상태에 있고, 동일한 주파수 대역의 어떤 캐리어에서도 송신이 존재하지 않으며, 다른 주파수 대역의 다른 캐리 어에서 1-포트 송신이 지원되는 경우, UE는 원-포트 송신이 두 개의 상향링크 캐리어들에서 이루어지는 것으로 (즉, 1-포트 송신이 두 상향링크 체인들에서 전송되는 것으로) 간주해야 하며; 그렇지 않으면, UE는 송신 캐리 어에서 2-포트 송신이 이루어지는 것으로(즉, 투 포트 송신들이 하나의 상향링크 캐리어에서 이루어지는것으로) 간주해야 한다. 본 개시의 선택적 실시예에서, UE가 OneT로 설정되고 원-포트 송신을 위한 제1 상향링 크 자원이 제1 정보(상향링크 자원 스케줄링 정보)에 따라 결정되는 경우, 다른 송신 포트가 제1 상향링크 자원 이 아닌 다른 상향링크 자원에서 이루어지는 것으로 결정되며; 그렇지 않으면, 두 개의 송신 포트가 모두 제1 상향링크 자원에 존재하는 것으로 결정된다. 선택적으로, UE가 2개보다 많은(예를 들어, 3개) 상향링크 자원들로 설정되고 제1 상향링크 자원이 제1 정보에 따라 원-포트 송신으로 결정된 때에, UE가 OneT로 설정되어 있으면, 열거된 상향링크 자원들의 인덱스들 및 우 선 순위들 중 하나 이상에 따라, UE의 다른 상향링크 체인이 제1 상향링크 자원을 제외한 상향링크 자원에 있는 것으로 추가로 결정될 수 있다. 예를 들어, UE에 대해 설정된 3개의 상향링크 캐리어의 인덱스들이 각각 1, 2, 3이라고 가정하면, 제1 정보에 따라, 인덱스가 1인 상향링크 캐리어가 원-포트 송신인 것으로 결정되고, OneT가 상위 계층 시그널링을 통해 설정되며, 다른 상향링크 송신 체인이 위치되는 캐리어가 가장 큰 인덱스로부터 가 장 작은 인덱스로의 순서로 결정되도록 프로토콜이 사전 결정한다. 따라서, UE의 다른 상향링크 송신 체인은 인 덱스가 3인 상향링크 캐리어에 존재한다. 본 개시의 선택적 실시예에서, 사용자 단말의 상향링크 스위칭의 송신 상태(TxState)의 설정은, UE의 두 개의 상향링크 송신 체인들이 동일한 상향링크 캐리어에 있는지 여부 및, UE의 두 개의 상향링크 송신 체인들이 동일 한 상향링크 캐리어에 없을 경우 다른 상향링크 송신 체인이 어느 캐리어에 있는지를 지시하는데 사용될 수 있 다. 즉, 하나의 상향링크 송신 체인이 위치되는 제1 상향링크 자원이 결정된 경우, UE는, 설정에 따라, 다른 상 향링크 송신 체인이 어느 상향링크 캐리어에 있는지를 직접 결정할 수 있다. 예를 들어, UE가 세 개의 상향링크 캐리어로 설정되고, 세 개의 상향링크 캐리어의 인덱스들이 각각 1, 2, 3이며, 제1 정보에 따라 인덱스가 1인 상향링크 자원이 원-포트 송신인 것으로 결정된다. UE가 OneT2의 설정을 수신한 경우, 설정에 따라 인덱스가 2 인 상향링크 자원이 원-포트 송신인 것으로 결정될 수 있으며; 그리고, UE가 OneT3의 설정을 수신한 경우, 설정 에 따라 인덱스가 3인 상향링크 자원이 원-포트 송신인 것으로 결정될 수 있다. 선택적으로, UE가 TxState의 설 정을 수신하지 않은 경우, 인덱스거 1인 상향링크 자원이 투-포트 송신인 것으로 결정될 수 있다. 선택적으로, 사용자 단말의 능력 정보와 관련하여, UE들의 서로 다른 능력들에 따라, 서로 다른 능력들을 가진 UE들에 대응하는 상향링크 송신 체인들이 있는 상향링크 자원을 결정하기 위한 규칙이 프로토콜을 통해 사전 결 정되거나 상위 계층 시그널링을 통해 설정될 수 있다. 예를 들어, 서로 다른 능력들을 가진 UE들의 경우, 스위 칭이 허용되는 서로 다른 상향링크 송신 체인 상태들 또는 스위칭이 허용되지 않는 상향링크 송신 체인 상태들 이 설정될 수 있다. 따라서, UE는 스위칭을 허용 또는 허용하지 않는 해당 규칙 하에서 자신의 능력에 따라 상 향링크 송신 체인 상태를 결정할 수 있다. 실제 구현 동안에, 상위 계층 설정은 상술한 사항들 중 적어도 하나를 지시할 수 있다는 점에 유의해야 한다. 특정 지시 모드는 명시적 지시 또는 암시적 지시일 수 있다. 페어링 관계를 예로 들면, 상위 계층 시그널링은 각 상향링크 자원에 대응하는 다른 상향링크 송신 체인에 대응하는 상향링크 자원의 명시적 지시를 포함할 수 있거나(예를 들어, 캐리어 1이 캐리어 2에 대응함), 또는 각 상향링크 자원과, 이 상향링크 자원에 대응하는 다 른 상향링크 송신 체인에 대응하는 상향링크 자원 간의 규칙일 수 있다. 예를 들어, 각 상향링크 자원에 대해, 상향링크 자원이 원-포트 송신인 경우, 다른 상향링크 송신 체인에 대응하는 상향링크 자원은 이 상향링크 자원 의 인덱스에 가까우면서 이 상향링크 자원의 인덱스보다 큰 인덱스를 갖는 상향링크 자원이다. 상술한 3개의 상 향링크 캐리어를 예로 들어, 3개의 상향링크 캐리어의 인덱스들을 각각 1, 2, 3이라 가정할 경우, 제1 정보에 따라 결정되는 상향링크 자원은 인덱스가 1인 상향링크 자원이고, 송신 모드는 원-포트 송신이며, 인덱스가 2인 상향링크 자원은 다른 상향링크 송신 체인에 대응하는 상향링크 자원이다. 상위 계층 시그널링을 통한 UE의 상술한 설정들 중 하나 이상의 설정 동안에, L개의 상향링크 자원들에 대해, 상향링크 소스들이 복수의 상위 계층 시그널링을 통해 개별적으로 설정될 수 있거나, 또는 L개의 상향링크 자원 들이 상위 계층 시그널링을 통해 공동으로 설정된다. 본 개시의 선택적 실시예에서, 제1 정보에 따라 사용자 단말의 상향링크 송신 체인 상태를 결정하는 단계는 다 음을 포함한다: 제1 정보에 따라, 원-포트 송신을 위한 제1 상향링크 자원을 결정하는 단계; 그리고 상위 계층 시그널링 설정에 따라 사용자 단말의 다른 상향링크 송신 체인이 제1 상향링크 자원에 위치되지 않는 것으로 결정되는 경우, 제2 정보의 적어도 하나의 항목에 따라, 다른 상향링크 송신 체인이 위치되는 상향링크 자원을 결정한다.즉, 제1 정보에 따라 하나의 상향링크 송신 체인이 제1 상향링크 자원에 위치되는 것을 알 수 있는 경우, 상위 계층 시그널링 설정을 통해 두 개의 상향링크 송신 체인들이 동일한 상향링크 자원에 대응하는지 여부를 알 수 있다. 제1 상향링크 자원인 것으로 결정되는 경우, 사용자 단말의 상향링크 송신 체인 상태는 제1 상향링크 자 원의 투-포트 송신이고; 제1 상향링크 자원이 아닌 것으로 결정되는 경우, 제2 정보의 적어도 하나의 항목에 기 반하여, 사용자 단말의 상향링크 자원들에서 제1 상향링크 자원을 제외한 제2 상향링크 자원들 중에서 다른 상 향링크 송신 체인에 대응하는 상향링크 자원이 결정된다. 이 선택적 실시예에서는, 상위 계층 시그널링 설정에 기반하여, 다른 상향링크 송신 체인에 대응하는 상향링크 자원이 제1 상향링크 자원인지 여부가 결정될 수 있다. 즉, 상위 계층 시그널링 설정은 UE의 두 개의 상향링크 송신 체인들이 동일한 상향링크 자원에 위치되는지 여부를 지시할 수 있다. 상위 계층 시그널링 설정에 따라 다 른 상향링크 송신 체인에 대응하는 상향링크 자원이 제1 상향링크 자원이 아닌 것으로 결정되는 경우, 제2 정보 의 적어도 하나의 항목에 따라 다른 상향링크 송신 체인에 대응하는 상향링크 자원이 구체적으로 L-1 상향링크 자원들 중 어느 것인지가 추가로 결정될 수 있다. 예를 들어, L개 상향링크 자원들의 우선 순위들에 따라, 제1 상향링크 자원을 제외한 상향링크 캐리어들 중 가장 높은 우선 순위를 가진 캐리어가, 다른 상향링크 송신 체인 이 위치되는 캐리어로서 사용될 수 있거나; 또는, L개 상향링크 캐리어들의 인덱스들에 따라, 제1 상향링크 자 원을 제외한 상향링크 캐리어들 중 인덱스가 가장 크거나 가장 작은 상향링크 캐리어가, 다른 상향링크 송신 체 인이 위치되는 캐리어로서 사용될 수 있다. 실제 구현 동안에, 상술한 항목들 중 적어도 하나에 따라 다른 상향링크 송신 체인에 대응하는 상향링크 자원을 결정하는 구체적인 구현은 상위 계층 시그널링을 통해 설정될 수도 있고, 프로토콜을 통해 사전 결정될 수도 있 으며, 상위 계층 시그널링 설정 및 프로토콜 사전 결정에 따라 구현될 수도 있다. 예를 들어, 프로토콜이 두 개의 상향링크 송신 체인들에 대응하는 상향링크 자원들이 서로 다른 상향링크 자원 들이라고 사전 결정한 경우, 각 제2 상향링크 자원의 인덱스 크기에 따라, 가장 큰 인덱스를 가진 제2 상향링크 소스가, 다른 상향링크 송신 체인이 위치되는 상향링크 자원으로 선택될 수 있거나; 또는, 프로토콜이 두 개의 상향링크 송신 체인들에 대응하는 상향링크 자원들이 서로 다른 상향링크 자원들이라고 사전 결정한 경우, 각 제2 상향링크 자원의 우선 순위에 따라, 가장 높은 우선 순위를 가진 제2 상향링크 자원이, 다른 상향링크 송신 체인이 위치되는 상향링크 자원으로 사용될 수 있다. 선택적으로, 가장 높은 우선 순위를 가진 상향링크 자원이 적어도 두 개 존재하는 경우, 프로토콜 사전 결정에 따라, 적어도 두 개의 상향링크 자원들에서 가장 큰 인덱스 를 가진 제2 상향링크 자원이, 다른 상향링크 송신 체인이 위치되는 상향링크 자원으로 결정될 수 있다. 본 개시의 선택적 실시예에서, 제1 정보에 따라 사용자 단말의 상향링크 송신 체인 상태를 결정하는 단계는 다 음을 포함할 수 있다: 제1 정보에 따라, 원-포트 송신을 위한 제1 상향링크 자원을 결정하는 단계; 사용자 단말의 제1 상향링크 자원과 각 상향링크 자원 간의 페어링 관계에 따라, 다른 상향링크 송신 체인이 위 치되는 상향링크 자원을 결정하는 단계. 설정 관계는 프로토콜을 통해 사전 결정되거나 상위 계층 시그널링을 통해 설정된 UE의 각 상향링크 자원과 매 칭되는 상향링크 자원일 수 있거나, 또는 각 상향링크 자원이 원-포트 송신인 경우 사용자 단말의 상향링크 스 위칭 송신 상태의 설정에 의해 지시되는 다른 상향링크 송신 체인이 존재하는 상향링크 소스일 수 있다. 즉, 각 상향링크 자원이 원-포트 송신인 경우 각 상향링크 자원과 매칭되는 상향링크 자원은 상위 계층 시그널 링을 통해 설정되거나 프로토콜을 통해 사전 결정될 수 있다. 즉, 제1 정보에 따라 제1 상향링크 자원이 원-포 트 송신인 것으로 결정된 경우, 설정 또는 사전 결정에 따라 제1 상향링크 자원과 매칭되는 상향링크 자원은, 다른 상향링크 체인이 위치되는 상향링크 자원인 것으로 결정될 수 있다. 하나의 상향링크 자원과 매칭되는 상향링크 자원은 상향링크 소스 자체이거나 다른 상향링크 자원일 수 있다는 점에 유의해야 한다. 예를 들어, 인덱스가 1인 상향링크 캐리어의 경우, 이 캐리어와 매칭되는 상향링크 자원은 1개의 캐리어를 가진 상향링크 자원일 수도 있고 아닐 수도 있다. 이 선택적 솔루션에서, UE의 L개 상향링크 자원들 각각에 대해, 상향링크 자원이, UE의 하나의 상향링크 송신 체인이 위치되는 자원이고 해당 송신 모드가 원-포트 송신인 경우, 다른 상향링크 송신 체인이 위치되는 상향링 크 자원이 어느 상향링크 자원인지가 상위 계층 시그널링을 통해 설정되거나 또는 프로토콜을 통해 사전 결정/ 사전 설정될 수 있다. UE가 기지국에 의해 송신된 제1 정보에 따라 하나의 상향링크 송신 체인이 제1 상향링크자원에 대응하고 송신 모드가 원-포트 송신인 것으로 결정한 경우, 프로토콜 사전 결정 또는 상위 계층 시그널 링 설정에 따라 다른 상향링크 체인이 L개 상향링크 자원들 중 어느 자원에 위치되는지가 결정될 수 있다. 다른 선택적 솔루션으로서, UE는, 사용자 단말의 상향링크 스위칭 송신 상태(TxState)의 설정에 따라, 다른 상 향링크 송신 체인이 위치되는 상향링크 자원을 결정할 수 있다. 이 설정은 상위 계층 시그널링을 통해 설정될 수 있다. 선택적으로, UE가 설정을 수신한 경우, UE는 이 설정에 따라, 다른 상향링크 송신 체인이 위치되는 자 원을 결정할 수 있으며; UE가 설정을 수신하지 않은 경우, UE는 사용자 단말의 두 개의 상향링크 송신 체인들이 제1 상향링크 자원에 위치되는 것으로(즉, 제1 상향링크 자원은 투-포트 송신인 것으로) 결정할 수 있다. 즉, UE가 이 설정을 수신한 경우, UE는 두 개의 상향링크 자원들에서 원-포트 송신이 이루어지는 것으로 간주해야 하며; UE가 이 설정을 수신하지 않은 경우, UE는 두 개의 상향링크 자원들에서 투-포트 송신이 이루어지는 것으 로 간주해야 한다. 본 개시에 의해 제공되는 선택적 솔루션들에 기반하여, 기지국은 UE에 대해 상향링크 송신에 사용될 수 있는 복 수의 상향링크 자원들을 설정할 수 있으므로, UE는 더욱 가능한 상향링크 송신 체인 상태들을 가질 수 있다. UE 의 자원들을 스케줄링하는 동안에, 기지국은 통신 시스템에서의 통신 자원들의 사용에 따라 UE의 상향링크 자원 들을 보다 유연하게 스케줄링할 수 있다. 예를 들어, 기지국은 네트워크의 현재 통신 조건(예를 들어, 복수의 UE들의 통신 자원들 사용)에 따라 UE를 스케줄링할 수 있으므로, 서로 다른 UE들이 동일한 상향링크 자원을 차 지하는 상황이 최소화된다. 따라서, UE의 상향링크 송신 실패 및 높은 송신 지연과 같은 문제들이 줄어들 수 있 고, UE의 통신 효과가 보다 양호하게 보장될 수 있으며, 네트워크 자원들의 활용성도 개선될 수 있다. 상술한 선택적 실시예들은 본 개시에 의해 제공되는 방법의 실행 주체로서 UE를 취하여 설명된 것이다. 도 4에 도시된 바와 같이, UE가 기지국으로부터 제1 정보를 수신하며, UE의 상향링크 송신 체인 상태가 제1 정보에 따 라 결정된다. 대응적으로, 본 개시에 의해 제공되는 방법은 또한 기지국을 실행 주체로서 취하여 설명될 수 있 다. 즉, 본 개시의 실시예는 통신 시스템에서 기지국에 의해 수행되는 방법을 추가로 제공한다. 이 방법은 다음 의 동작들을 포함할 수 있다: 사용자 단말에게 제1 정보를 송신하는 단계 - 제1 정보는 사용자 단말의 상향링크 송신 체인 상태를 결정하도록 설정됨 -; 여기서 제1 정보는 스케줄링된 상향링크 자원 및 송신 모드의 관련 정보를 포함한다. 선택적으로, 사용자 단말은 두 개의 상향링크 송신 체인들을 지원하며, 사용자 단말은 L개의 상향링크 자원들로 설정된다(여기서 ). 이 방법은 기지국을 실행 주체로서 취하여 설명되어 있고 본질적으로 도 4에 도시된 방법과 동일하며; 그리고, 제1 정보 및 UE가 제1 정보에 따라 UE의 상향링크 자원의 송신 모드를 결정하는 선택적 구현들에 대해서는, 전 술한 실시예들의 설명을 참조할 수 있으며, 여기서는 세부 사항을 반복하지 않는다. 선택적으로, 이 방법은 추가로 다음을 포함할 수 있다: 사용자 단말에게 상향링크 자원 설정 정보를 송신하는 단계, 이 설정 정보는 UE의 각 상향링크 자원을 설정하며, 예를 들어 상향링크 자원의 수, 각 상향링크 자원의 인덱스, 각 상향링크 자원의 시간 도메인 위치 또는 주파수 도메인 위치 등을 설정한다. UE는 이 설정 정보에 따라 각 설정된 상향링크 자원을 결정할 수 있다. 선택적으로, 이 방법은 추가로 다음을 포함할 수 있다: 제1 정보에 기반하여 사용자 단말에 의해 스케줄링된 상 향링크 자원 및 송신 모드에 의해 송신되는 상향링크 채널 및 상향링크 신호 중 적어도 하나를 수신하는 단계. 즉, UE가 기지국에 의해 송신된 제1 정보에 따라, 상향링크 채널 또는 상향링크 신호 및 해당 송신 모드를 송신 할 상향링크 캐리어를 결정한 후에, UE가 제1 정보에 의해 스케줄링된 상향링크 캐리어에 따라 해당 송신 모드 에서 기지국에게 상향링크 채널 또는 상향링크 신호(예를 들어, 상향링크 데이터, 상향링크 제어 정보, 상향링 크 기준 신호 등)를 송신할 수 있다. 선택적으로, 이 방법은 추가로 다음을 포함할 수 있다: 상위 계층 설정을 사용자 단말에 송신하는 단계, 여기서 상위 계층 설정에는 상향링크 송신 체인에 대응하는 상향링크 자원을 결정하는데 사용되는 정보가 포함된다. 상 위 계층 설정에 대한 설명은 또한 전술한 실시예들의 해당 설명을 참조할 수 있다. 상이한 정보를 지시하거나 설정하는데 사용되는 상위 계층 설정의 경우, 기지국은 하나의 정보/메시지/시그널링 을 통해 설정될 수도 있고, 여러 개의 정보/메시지/시그널링을 통해 설정될 수도 있다. 예를 들어, UE의 상향링 크 송신 상태는 uplinkTxSwitching-DualUL-TxState를 통해 설정될 수 있고, UE의 상향링크 자원은 다른 상위계층 시그널링을 통해 설정될 수 있다. 본 개시의 목적, 기술적 솔루션 및 이점을 보다 명확하게 하기 위해, 본 개시가 몇 가지 구체적인 선택적인 실 시예들에 의해 아래에서 보다 자세히 설명될 것이다. 아래에 설명된 선택적 실시예들에서, 상향링크 자원은 상향링크 캐리어이고; 상향링크 송신 체인은 상향링크 체 인이고; 상향링크 채널 또는 상향링크 기준 신호는 상향링크 캐리어에서 송신될 수 있고; 상향링크 채널은 PUSCH, PUCCH 또는 PRACH 중 적어도 하나를 포함할 수 있으며; 그리고, 상향링크 기준 신호는 SRS를 포함하지만 이에 한정되지 않는다. 다음의 선택적 실시예들에서는, 시간 도메인에서의 시간 유닛의 그래뉼래러티가 시간 슬 롯을 예로 들어 설명될 것이다. 시간 구현 동안에, 시간 유닛은 마이크로 시간 슬롯이거나 다른 시간 그래뉼래 러티들을 갖는 시간 유닛일 수도 있음을 이해해야 한다. 본 개시에 의해 제공되는 방법은 상향링크 채널들 및 상향링크 기준 신호들을 송신하는데 사용될 수 있으며, 상 향링크 채널들 또는 상향링크 기준 신호들에 대한 송신 모드는 원-포트 송신 또는 투-포트 송신일 수 있다. 이 방법은 UE 측에서 구현될 수도 있다. UE는 두 개의 상향링크 송신 체인들(TX 체인들)을 지원하고, 기지국은 L개 의 상향링크 캐리어로 설정될 수 있다. UE는 원-포트 송신 모드에서 L개의 설정된 상향링크 캐리어들 중 최대 N개의 상향링크 캐리어들을 통해 서로 다 른 시간에 동시적 송신을 수행할 수 있으며, 여기서 N은 2일 수 있다. 예를 들어, L은 3이고, 상향링크 캐리어 들은 각각 C1, C2 및 C3이며, N은 2이다. 시간 슬롯 t1에서, UE는 원-포트 송신 모드에서 상향링크 캐리어 C1 및 C2를 통해 상향링크 채널을 송신할 수 있고; 시간 슬롯 t2에서, UE는 원-포트 송신 모드에서 상향링크 캐리 어 C2 및 C3를 통해 상향링크 채널을 송신하며; 그리고, 시간 슬롯 t3에서, UE는 원-포트 송신 모드에서 상향링 크 캐리어 C3를 통해 상향링크 채널을 송신한다(도 5 참조). UE는 또한 투-포트 송신 모드에서 서로 다른 시간에 L개의 설정된 상향링크 캐리어들 중 최대 M개의 상향링크 캐리어를 통해 동시적 송신을 수행할 수 있다. 예를 들어, L은 3이고, 상향링크 캐리어들은 각각 C1, C2 및 C3 이며, M은 1이다. 시간 슬롯 t1에서, UE는 투-포트 송신 모드에서 상향링크 캐리어 C1를 통해 상향링크 채널을 송신하며; 그리고, 시간 슬롯 t2에서, UE는 투-포트 송신 모드에서 상향링크 캐리어 C2를 통해 상향링크 채널을 송신한다(도 6 참조). UE가 두 개의 상향링크 캐리어들로 설정되고 UE가 두 개의 상향링크 송신 체인들을 갖는 경우, 세 개의 상향링 크 송신 체인 상태들이 있을 수 있다. 아래의 표 1에 나와 있는 바와 같이, 제1 상향링크 송신 체인 상태는 제1 상향링크 캐리어가 단일 송신 체인의 송신 모드에 있고, 제2 상향링크 캐리어가 단일 송신 체인의 송신 모드에 있는 상태이다(1T+1T). 제2 상향링크 송신 체인 상태는 제1 상향링크 캐리어가 두 개의 송신 체인들의 송신 모 드에 있고, 제2 상향링크 캐리어가 제로 송신 체인의 송신 모드에 있는 상태이다(0T+2T). 제3 상향링크 송신 체 인 상태는 제1 상향링크 캐리어가 제로 송신 체인의 송신 모드에 있고, 제2 상향링크 캐리어가 두 개의 송신 체 인들의 송신 모드에 있는 상태이다(2T+0T). 각 상향링크 송신 체인 상태에서, 두 개의 상향링크 캐리어를 통해 상향링크 채널 또는 상향링크 기준 신호를 송신하기 위한 안테나 포트들의 조합이 표 1의 가장 오른쪽 열에 나 와 있다. 단일 송신 체인의 송신 모드에서 상향링크 캐리어는 원-포트 송신(1P) 또는 제로-포트 송신(0P)일 수 있으며, 두 개의 송신 체인의 송신 모드에서 상향링크 캐리어는 투-포트 송신(2P) 또는 원-포트 송신(1P)일 수 있다. 상술한 설명으로부터 본 개시의 실시예들에서 상향링크 송신 상태란 UE에 의해 고려되는 두 개의 포트가 위치되 는 상향링크 자원을 의미한다는 것을 알 수 있다. 예를 들어, 표 1의 1T+1T의 체인 상태의 경우, UE는 원-포트 송신/전송이 제1 상향링크 캐리어와 제2 상향링크 캐리어에서 이루어지는 것으로 간주하며; 그리고, 0T+2T의 경 우, UE는 투-포트 송신이 제2 상향링크 캐리어에서 이루어지는 것으로 간주해야 한다. 마찬가지로, 아래의 표 2 의 두 번째 열은 유사한 의미를 갖는다. 예를 들어, 1T+1T+0T의 체인 상태의 경우, UE는 원-포트 송신/전송이 제1 상향링크 캐리어와 제2 상향링크 캐리어에서 이루어지는 것으로 간주하고, 2T+0T+0T의 경우, UE는 투-포트 송신/전송이 제1 상향링크 캐리어에서 이루어지는 것으로 간주한다.[표 1]"}
{"patent_id": "10-2024-7032063", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "상기 표 1은 상향링크 송신 체인 상태들, 송신 체인들의 수 및 송신 안테나 포트들 간의 대응 관계를 나타낸 것 이다. 하나의 상향링크 송신 체인 상태에서 다른 상향링크 송신 체인 상태로 스위칭하기 위해서는 스위칭 갭이 필요하 다. 이 스위칭 갭에서는, UE가 상향링크 채널과 상향링크 기준 신호를 송신하지 않을 수 있다. 예를 들어, UE가 제1 상향링크 송신 체인 상태(1T+1T)에서 제2 상향링크 송신 체인 상태(0T+2T)로 스위칭될 때에는, 듀레이션 T 의 스위칭 갭이 필요하다(도 7 참조). 시간 T의 기간에는, UE가 상향링크 채널과 상향링크 기준 신호를 송신하 지 않을 수 있다. 상향링크 송신 체인 상태의 스위칭은 스케줄링되거나 설정된 상향링크 채널/상향링크 기준 신호의 송신에 의해 구동될 수 있다. 예를 들어, UE는 두 개의 상향링크 캐리어로 설정된다. UE는 시간 유닛 t1에서 제1 상향링크 송신 체인 상태(1T+1T)에 있고, 기지국은 시간 유닛 t2에서 UE를 스케줄링하여 제2 상향링크 캐리어의 두 포트 들에서 PUSCH를 송신하며, 두 개의 상향링크 송신 체인들이 제2 상향링크 캐리어에 있다. 이때, UE는 제2 상향 링크 송신 체인 상태(0T+2T)로 스위칭될 것이다(도 8 참조). 상술한 설명은 UE가 두 개의 상향링크 캐리어로 설정된 경우 상향링크 송신 체인 상태들 및 상향링크 송신 체인 들에 대한 스위칭 방법을 보여준다. UE가 두 개의 상향링크 송신 체인들을 지원하는 경우, 기지국은 두 개보다 많은 상향링크 캐리어를 설정할 수 있다(예를 들어, 기지국은 세 개 또는 네 개의 상향링크 캐리어를 설정할 수 있다). 동일한 시점에서, UE는 두 개의 상향링크 송신 체인들을 사용하여 최대 두 개의 상향링크 캐리어를 통해 상향링크 채널 또는 상향링크 기준 신호를 송신할 수 있다. 서로 다른 시점들에서, UE는 최대 두 개의 서로 다 른 상향링크 캐리어를 통해 상향링크 채널 또는 상향링크 기준 신호를 송신할 수 있다. UE가 두 개보다 많은 상향링크 캐리어로 설정된 때에, UE가 두 개의 상향링크 송신 체인들을 사용하여 동일한 시점에 최대 두 개의 상향링크 캐리어를 통해 상향링크 채널 또는 상향링크 기준 신호를 송신할 수 있는 경우, 상향링크 송신 체인 상태가 스위칭될 때에 서로 다른 상향링크 송신 체인 상태들에 대한 스위칭 방법이 몇 가지 선택적 실시예들에 의해서 아래에서 설명된다. UE가 기지국으로부터 설정 정보를 수신하고 기지국이 UE에 대해 L개의 상향링크 캐리어를 설정한 경우, UE는 원 -포트 송신 모드에서 L개의 설정된 캐리어들 중 최대 N개의 상향링크 캐리어를 통해 상향링크 채널 또는 상향링 크 기준 신호를 서로 다른 시점들에서 동시적 송신할 수 있거나, 또는 투-포트 송신 모드에서 L개의 설정된 캐 리어들 중 최대 M개의 상향링크 캐리어를 통해 상향링크 채널 또는 상향링크 기준 신호를 서로 다른 시점들에서 동시적 송신할 수 있다. 서로 다른 시점들에서, UE는 서로 다른 상향링크 송신 체인 상태들 간에 스위칭될 수 있다. 스위칭 후에 상향링크 송신 체인 상태를 결정하는 방법이 아래에서 설명될 것이다. 제1 예시(Example 1) UE가 3개의 상향링크 캐리어로 설정되고 UE가 2개의 상향링크 송신 체인을 갖는 경우, 최대 6개의 상향링크 송 신 체인 상태가 있을 수 있다. 6개의 상향링크 송신 체인 상태는 2개의 카테고리로 분류될 수 있다. 하나의 카 테고리는 2개의 상향링크 송신 체인이 3개의 상향링크 캐리어 중 2개의 상향링크 캐리어에 위치되고 2개의 상향 링크 캐리어가 원-포트 송신에 대응하는 것이다. 즉, 3개의 상향링크 캐리어 중 2개의 상향링크 캐리어가 단일 송신 체인의 송신 모드에 있는 한편, 다른 상향링크 캐리어는 제로 송신 체인의 송신 모드에 있다. 다른 카테고 리는 2개의 상향링크 송신 체인이 3개의 상향링크 캐리어 중 1개의 상향링크 캐리어에 위치되는 것이다. 즉, 3 개의 상향링크 캐리어 중 1개의 상향링크 캐리어가 단일 송신 체인의 송신 모드에 있는 한편, 다른 2개의 상향 링크 캐리어는 제로 송신 체인의 송신 모드에 있다. 6개의 상향링크 송신 체인 상태가 아래에서 설명될 것이다.제1 상향링크 송신 체인 상태는 제1 상향링크 캐리어가 단일 송신 체인의 송신 모드에 있고, 제2 상향링크 캐리 어가 단일 송신 체인의 송신 모드에 있으며, 제3 상향링크 캐리어가 제로 송신 체인의 송신 모드에 있는 것이다. 제2 상향링크 송신 체인 상태는 제1 상향링크 캐리어가 단일 송신 체인의 송신 모드에 있고, 제2 상향링크 캐리 어가 제로 송신 체인의 송신 모드에 있으며, 제3 상향링크 캐리어가 단일 송신 체인의 송신 모드에 있는 것이다. 제3 상향링크 송신 체인 상태는 제1 상향링크 캐리어가 제로 송신 체인의 송신 모드에 있고, 제2 상향링크 캐리 어가 단일 송신 체인의 송신 모드에 있으며, 제3 상향링크 캐리어가 단일 송신 체인의 송신 모드에 있는 것이다. 제4 상향링크 송신 체인 상태는 제1 상향링크 캐리어가 제로 송신 체인의 송신 모드에 있고, 제2 상향링크 캐리 어가 두 송신 체인들의 송신 모드에 있으며, 제3 상향링크 캐리어가 제로 송신 체인의 송신 모드에 있는 것이다. 제5 상향링크 송신 체인 상태는 제1 상향링크 캐리어가 2 송신 체인의 송신 모드에 있고, 제2 상향링크 캐리어 가 제로 송신 체인의 송신 모드에 있으며, 제3 상향링크 캐리어가 제로 송신 체인의 송신 모드에 있는 것이다. 제6 상향링크 송신 체인 상태는 제1 상향링크 캐리어가 제로 송신 체인의 송신 모드에 있고, 제2 상향링크 캐리 어가 제로 송신 체인의 송신 모드에 있으며, 제3 상향링크 캐리어가 두 송신 체인들의 송신 모드에 있는 것이다. 송신 체인 상태들에 대한 상술한 설명에서, 제1 상향링크 캐리어, 제2 상향링크 캐리어 및 제3 상향링크 캐리어 의 \"제1\", \"제2\" 및 \"제3\"은 단순히 세 개의 상향링크 캐리어를 구별함으로써 본 솔루션들에 대한 설명 및 이해 를 용이하게 하기 위해 사용된 것이며, 세 개의 캐리어에 대한 다른 제한으로 해석되어서는 안 된다. 각 상향링크 송신 체인 상태에서, 세 개의 설정된 상향링크 캐리어를 통해 상향링크 채널 또는 상향링크 기준 신호를 송신하기 위한 안테나 포트들의 조합은 표 2를 참조할 수 있다. 단일 송신 체인의 송신 모드에서 상향링 크 캐리어는 원-포트 송신(1P) 또는 제로-포트 송신(0P)일 수 있으며, 두 개의 송신 체인의 송신 모드에서 상향 링크 캐리어는 투-포트 송신(2P) 또는 원-포트 송신(1P)일 수 있다. [표 2]"}
{"patent_id": "10-2024-7032063", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "상기 표 2는 상향링크 송신 체인 상태들, 송신 체인들의 수 및 송신 안테나 포트들 간의 대응 관계를 나타낸 것 이다. 표 2로부터 알 수 있는 바와 같이, 서로 다른 상향링크 송신 체인 상태들에는, 동일한 송신 안테나 포트에서의 상향링크 채널들 또는 상향링크 기준 신호들의 송신 조합들이 존재한다. 하나의 상향링크 캐리어에서의 원-포트 송신 및 다른 두 상향링크 캐리어들에서의 무-포트 송신의 조합이 여러 개의 서로 다른 상향링크 송신 체인 상 태들 중 하나일 수 있다. 예를 들어, 굵은 직사각형 박스로 표시된 송신 안테나 포트에서 상향링크 채널들 또는 상향링크 기준 신호들의 송신 조합 1P+0P+0P를 참조하면, 제1 상향링크 캐리어에서는 상향링크 채널 또는 상향 링크 기준 신호의 원-포트 송신이 있고, 제2 상향링크 캐리어와 제3 상향링크 캐리어에서는 상향링크 채널 또는 상향링크 기준 신호의 송신이 없다. 이 조합의 경우, 이때, 상향링크 송신 체인 상태는 제1 상향링크 송신 체인 상태, 제2 상향링크 송신 체인 상태, 및 제5 상향링크 송신 체인 상태 중 하나일 수 있다. 또는, 타원으로 표시 된 송신 안테나 포트에서의 상향링크 채널들 또는 상향링크 기준 신호들의 송신 조합 0P+1P+0P를 참조하면, 제2 상향링크 캐리어에서는 상향링크 채널 또는 상향링크 기준 신호의 원-포트 송신이 있고, 제1 상향링크 캐리어와 제3 상향링크 캐리어에서는 상향링크 채널 또는 상향링크 기준 신호의 송신이 없다. 이때, 상향링크 송신 체인 상태는 제1 상향링크 송신 체인 상태, 제3 상향링크 송신 체인 상태, 및 제4 상향링크 송신 체인 상태 중 하나 일 수 있다. 또는, 얇은 직사각형 박스로 표시된 송신 안테나 포트에서의 상향링크 채널들 또는 상향링크 기준 신호들의 송신 조합 0P+0P+1P를 참조하면, 제3 상향링크 캐리어에서는 상향링크 채널 또는 상향링크 기준 신호 의 원-포트 송신이 있고, 제1 상향링크 캐리어와 제2 상향링크 캐리어에서는 상향링크 채널 또는 상향링크 기준 신호의 송신이 없다. 이때, 상향링크 송신 체인 상태는 제2 상향링크 송신 체인 상태, 제3 상향링크 송신 체인 상태 및 제6 상향링크 송신 체인 상태 중 하나일 수 있다. 알 수 있는 바와 같이, UE가, 기지국으로부터 수신된 제1 정보에 따라, 하나의 상향링크 송신 체인이 위치되고 송신 모드가 원-포트 송신인 상향링크 캐리어를 결정할 때, UE가 복수의 상향링크 캐리어로 설정된 경우, 일부 포트 조합들이 다수의 상향링크 송신 체인 상태들에 대응하기 때문에(표 2 참조) 구체적인 상향링크 송신 체인 상태가 다음의 방법에 의해 결정될 수 있다. 선택적인 실시예 1 다수의 상향링크 송신 체인 상태들에 대응하는 송신 포트들의 조합들, 예를 들어, 상기 포트 조합들 \"1P+0P+0P\", \"0P+1P+0P\" 및 \"0P+0P+1P\"의 경우, 3개의 상향링크 캐리어들 중 하나의 상향링크 캐리어가 원-포 트 송신(즉, 하나의 상향링크 송신 체인이 이 상향링크 캐리어에 위치됨)이기 때문에, 이 상향링크 캐리어가 투 -포트 송신 모드를 지원하는 경우, UE는, 시그널링(예를 들어, 상위 계층 시그널링 설정)을 수신하여, 다른 상 향링크 송신 체인도 이 상향링크 캐리어에 위치되는지 또는 다른 상향링크 캐리어들에 위치되는지 여부를 결정 할 수 있다. 시그널링 설정에 따라 다른 상향링크 송신 체인도 이 상향링크 캐리어에 위치되는 것으로 결정될 수 있는 경우, 2개의 상향링크 송신 체인이 이 상향링크 캐리어에 위치되는 것으로(즉, 이 캐리어가 투-포트 송 신 모드에 있는 것으로) 결정될 수 있다. 예를 들어, 포트 조합 1P+0P+0P의 경우, 제1 상향링크 캐리어가 하나의 포트에서 상향링크 채널 또는 상향링크 기준 신호를 송신하기 때문에, 하나의 상향링크 송신 체인이 제1 상향링크 캐리어에 위치된다. 제1 상향링크 캐 리어가 투-포트 송신 모드를 지원하는 경우, UE는, 시그널링(예를 들면, 상위 계층 시그널링 설정)을 수신하여, 다른 상향링크 체인이 제1 상향링크 캐리어에 위치되는지 또는 다른 상향링크 캐리어들에 위치되는지 여부를 결 정할 수 있다. UE가, 시그널링을 수신하여, 다른 상향링크 체인이 제1 상향링크 캐리어에 위치되는 것으로 결정 한 경우, UE는 제1 상향링크 캐리어에서 투-포트 송신 모드에 있으며, UE는 제5 상향링크 송신 체인 상태에 있 다. 포트 조합 0P+1P+0P의 경우, 제2 상향링크 캐리어가 하나의 포트에서 상향링크 채널 또는 상향링크 기준 신호를 송신하기 때문에, 하나의 상향링크 송신 체인이 제2 상향링크 캐리어에 위치된다. 제2 상향링크 캐리어가 투-포 트 송신 모드를 지원하는 경우, UE는, 시그널링(예를 들면, 상위 계층 시그널링 설정)을 수신하여, 다른 상향링 크 체인이 제2 상향링크 캐리어 또는 다른 상향링크 캐리어들에 위치되는지 여부를 결정할 수 있다. UE가, 시그 널링(예를 들면, 상위 계층 시그널링 설정)을 수신하여, 다른 상향링크 체인이 제2 상향링크 캐리어에 위치되는 것으로 결정한 경우, UE는 제2 상향링크 캐리어에서 투-포트 송신 모드에 있으며, UE는 제4 상향링크 송신 체인 상태에 있다. 포트 조합 0P+0P+1P의 경우, 제3 상향링크 캐리어가 하나의 포트에서 상향링크 채널 또는 상향링크 기준 신호를 송신하기 때문에, 하나의 상향링크 송신 체인이 제3 상향링크 캐리어에 위치된다. 제3 상향링크 캐리어가 투-포 트 송신 모드를 지원하는 경우, UE는, 시그널링(예를 들면, 상위 계층 시그널링 설정)을 수신하여, 다른 상향링크 체인이 제3 상향링크 캐리어 또는 다른 상향링크 캐리어들에 위치되는지 여부를 결정할 수 있다. UE가, 시그 널링(예를 들면, 상위 계층 시그널링 설정)을 수신하여, 다른 상향링크 체인이 제3 상향링크 캐리어에 위치된다 고 결정하는 경우, UE는 제3 상향링크 캐리어에서 투-포트 송신 모드에 있으며, UE는 제6 상향링크 송신 체인 상태에 있다. 하나의 포트에서 상향링크 채널 또는 상향링크 기준 신호를 송신하는 상향링크 캐리어들의 경우, 예를 들어, UE 가 3개의 상향링크 캐리어로 설정된 때에, 포트 조합들 \"1P+0P+0P\", \"0P+1P+0P\" 및 \"0P+0P+1P\"는 각각 다음 세 가지 상황들에 대응한다: 제1 상향링크 캐리어가 원-포트 송신에 대응하고, 제2 상향링크 캐리어가 원-포트 송 신에 대응하며, 제3 상향링크 캐리어가 원-포트 송신에 대응한다. 선택적으로, 상위 계층 시그널링을 통해, 하 나의 포트에서 상향링크 채널 또는 상향링크 기준 신호를 송신하는 상향링크 캐리어가 두 개의 상향링크 체인에 위치되거나, 또는 하나의 포트에서 상향링크 채널 또는 상향링크 기준 신호를 송신하는 상향링크 캐리어가 하나 의 상향링크 캐리어에 위치하는 한편 다른 상향링크 캐리어들은 다른 상향링크 체인에 위치되도록 공동으로 설 정하는 것이 가능하다. 선택적으로, 세 개의 개별 상위 계층 시그널링을 통해, 하나의 포트에서 상향링크 채널 또는 상향링크 기준 신호를 송신하는 상향링크 캐리어가 두 개의 상향링크 체인에 위치되거나, 하나의 포트에서 상향링크 채널 또는 상향링크 기준 신호를 송신하는 상향링크 캐리어가 하나의 상향링크 캐리어에 위치되는 한 편 다른 상향링크 캐리어들은 다른 상향링크 체인에 위치되도록 개별적으로 설정하는 것도 가능하다. 즉, 각 상 향링크 캐리어에 대해, 이 상향링크 캐리어가 원-포트 송신 모드에 대응하는 경우, 이 상향링크 캐리어가 두 개 의 상향링크 송신 체인들에 위치되거나, 또는 이 상향링크 캐리어가 하나의 상향링크 송신 체인에 위치되는 한 편 다른 캐리어들은 다른 상향링크 송신 체인에 위치되도록 설정될 수 있다. 일 대안으로서, uplinkTxSwitching-DualUL-TxState를 통해 UE의 두 개의 상향링크 송신 체인들이 동일한 상향 링크 캐리어에 위치되는지 여부를 지시하는 것이 가능하다. 예를 들어, UE가 OneT로 설정된 경우, 두 개의 상향 링크 송신 체인들이 두 개의 서로 다른 상향링크 캐리어들에 위치된다는 것을 지시하고, UE가 OneT로 설정되지 않은 경우, 두 개의 상향링크 송신 체인들이 동일한 상향링크 캐리어에 위치되는 것으로 간주될 수 있다. 하나의 상향링크 송신 체인이 하나의 상향링크 캐리어에 위치되는 것으로 결정한 경우에, UE가 수신된 시그널링 에 따라 다른 상향링크 송신 체인도 동일한 상향링크 캐리어에 위치되는 것으로 결정하면, UE의 상향링크 송신 체인 상태가 결정될 수 있으며; 그리고, UE가 수신된 시그널링에 따라 다른 상향링크 체인이 다른 상향링크 캐 리어들에 위치되는 것으로 결정하면, 상향링크 송신 체인 상태가 다음과 같은 방식들로 결정될 수 있다. 방식 1: 다른 상향링크 송신 체인이 위치되는 캐리어가 상향링크 캐리어들의 인덱스들에 따라 선택되는 것으로 사전 결 정되거나 사전 설정된다(예를 들어, 상위 계층 시그널링 설정에 의해). 선택적으로, 상향링크 캐리어들의 가장 큰 인덱스로부터 가장 작은 인덱스로의(또는 가장 작은 인덱스로부터 가장 큰 인덱스로의) 순서로, 원-포트에서 상향링크 채널을 송신하는 상향링크 캐리어를 제외한 상향링크 캐리어가 다른 상향링크 체인에서 송신하기 위한 상향링크 캐리어로서 선택된다. 캐리어의 인덱스는 캐리어의 식별자 형태임을 이해해야 한다. 실제 구현 동안에, 캐리어가 다른 식별자 형태들 을 갖는 경우, 다른 상향링크 송신 체인에 대응하는 상향링크 캐리어를 선택하는 방식은 캐리어의 다른 식별자 형태들에 따라 프로토콜을 통해 사전 결정되거나 사전 설정될 수 있다. 대응적으로, UE는, 기지국에 의해 설정 된 각 상향링크 캐리어의 해당 형태의 식별자에 따라, 다른 상향링크 송신 체인이 위치되는 캐리어를 결정할 수 있다. 예를 들어, 더 큰 인덱스를 가진 캐리어가 상향링크 캐리어로 선택되며 여기서 다른 상향링크 송신 체인은 상향 링크 캐리어들의 인덱스가 가장 큰 것으로부터 가장 작은 것으로의 순서로 위치되는 것으로 사전 결정/사전 정 의된다. 도 9에 도시된 바와 같이, UE가 인덱스 1, 2, 3을 갖는 3개의 상향링크 캐리어로 설정된 경우, 시간 슬 롯 t1에서, UE는 기지국에 의해 송신된 스케줄링 정보에 따라 상향링크 캐리어 인덱스 1을 가진 상향링크 캐리 어에서 상향링크 채널의 원-포트 송신이 있고 인덱스 2 및 3을 가진 상향링크 캐리어에서 송신이 없는 것으로 결정한다. 하나의 포트에서 상향링크 채널을 송신하고 인덱스 1을 갖는 상향링크 캐리어를 제외한 상향링크 캐 리어 인덱스 3을 가진 상향링크 캐리어가 사전 결정에 따라 캐리어들의 인덱스가 가장 큰 것으로부터 가장 작은 것으로의 순서로 다른 상향링크 체인에서 송신하기 위한 상향링크 캐리어로서 선택된 경우, UE의 두 개의 상향 링크 체인들은 인덱스 1을 가진 상향링크 캐리어와 인덱스 3을 가진 상향링크 캐리어에 각각 위치되며, UE는 제 2 상향링크 송신 체인 상태에 있다.방식 2: 다른 상향링크 송신 체인이 있는 캐리어가 상향링크 캐리어들의 우선 순위들에 따라 선택되는 것으로 사전 결정 되거나 사전 설정된다(예를 들면, 상위 계층 시그널링 설정). 선택적으로, 상향링크 캐리어들의 가장 높은 우선 순위로부터 가장 낮은 우선 순위로의 순서로, 하나의 포트에서 상향링크 채널을 송신하는 상향링크 캐리어를 제 외한 상향링크 캐리어가 다른 상향링크 체인에서 송신하기 위한 상향링크 캐리어로서 선택된다. 즉, 더 높은 우 선 순위를 가진 상향링크 캐리어가, 다른 송신 체인이 위치되는 상향링크 캐리어로서 우선적으로 선택된다. 각 상향링크 캐리어의 우선 순위는 시그널링(예를 들면, 상위 계층 시그널링)을 통해 설정될 수 있다. 예를 들어, UE는 3개의 상향링크 캐리어로 설정되며, 상향링크 캐리어들의 우선 순위는 다음과 같이 정렬된다: 제1 상향링크 캐리어의 우선 순위가 가장 높고, 제2 상향링크 캐리어의 우선 순위가 두 번째로 높고, 제3 상향 링크 캐리어의 우선 순위가 가장 낮다. 도 10에 도시된 바와 같이, 시간 슬롯 t1에서, 제1 상향링크 캐리어에서 는 상향링크 채널의 원-포트 송신이 있다. 하나의 포트에서 상향링크 채널을 송신하는 제1 상향링크 캐리어를 제외한 제3 상향링크 캐리어가 상향링크 캐리어들의 우선 순위가 가장 높은 것으로부터 가장 작은 것으로의 순 서로 다른 상향링크 체인에서 송신하기 위한 상향링크 캐리어로서 선택되는 경우, UE의 두 개의 상향링크 체인 들은 각각 제1 상향링크 캐리어와 제3 상향링크 캐리어에 위치되며, UE는 제2 상향링크 송신 체인 상태에 있다. 방식 3: 다른 상향링크 송신 체인에 대응하는 상향링크 캐리어가 상향링크 캐리어에서의 상향링크 송신 시간에 따라 선 택되는 것으로 사전 결정되거나 사전 설정된다(예를 들어, 상위 계층 시그널링 설정). 선택적으로, 하나의 포트 에서 상향링크 채널을 송신하는 상향링크 캐리어를 제외한 상향링크 캐리어가 상향링크 캐리어에서의 상향링크 채널 또는 상향링크 기준 신호의 송신의 가장 작은 거리부터 가장 큰 거리로의(현재 시간과 가장 작은 시간 차 로부터 가장 큰 시간 차로의) 순서로 다른 상향링크 체인에서 송신하기 위한 상향링크 캐리어로서 선택될 수 있 다. 예를 들어, 가장 최근 시간에 상향링크 채널 또는 상향링크 기준 신호를 송신한 상향링크 캐리어가, 다른 상향링크 송신 체인이 위치되는 상향링크 캐리어로서 사용된다. 예를 들어, UE는 3개의 상향링크 캐리어로 설정된다. 도 11에 도시된 바와 같이, 시간 슬롯 t2에서, 제1 상향링 크 송신에서는 상향링크 채널의 원-포트 송신이 있으며, 제1 상향링크 캐리어를 제외한 다른 두 개의 상향링크 캐리어에서 시간 슬롯 t2에 가장 가까운 상향링크 송신이 시간 슬롯 t1에서 제2 상향링크 캐리어를 통한 상향링 크 채널의 송신이다. 즉, 제2 상향링크 캐리어와 제3 상향링크 캐리어의 경우, 시간 슬롯 t1 이전의 두 개의 상 향링크 캐리어에서 가장 최근 시간(시간 슬롯 t1에 가장 가까운 시간)에 상향링크 송신을 수행한 상향링크 캐리 어가 제2 상향링크 캐리어이다. 하나의 포트에서 상향링크 채널을 송신하는 제1 상향링크 캐리어를 제외한 제2 상향링크 캐리어가 상향링크 캐리어에서 상향링크 채널 또는 상향링크 기준 신호의 송신 거리가 가장 짧은 것으 로부터 가장 긴 것으로의 순서로 다른 상향링크 체인에서 송신을 위한 상향링크 캐리어로서 선택되는 경우, UE 의 두 개의 상향링크 체인들은 각각 제1 상향링크 캐리어와 제2 상향링크 캐리어에 위치되며, UE는 제1 상향링 크 송신 체인 상태에 있다. 방식 4: 다른 상향링크 송신 체인에 대응하는 상향링크 캐리어가 상술한 방식 1, 2 및 3 중 두 개 또는 세 개를 조합하 여 결정될 수 있다. 선택적으로, 이 결정은 세 가지 방식 중 하나를 통해 먼저 수행될 수 있다. 적어도 두 개의 상향링크 캐리어가 하나의 방식을 통해 결정되는 경우(UE가 세 개의 상향링크 캐리어로 설정된 경우, 최대 두 개의 상향링크 캐리어가 결정되고; UE가 네 개 이상의 캐리어로 설정된 경우, 두 개보다 많은 상향링크 캐리어 가 결정될 수 있음), 다른 상향링크 송신 체인이 위치되는 상향링크 캐리어가 다른 두 가지 방식 중 하나 이상 을 통해 추가로 결정될 수 있다. 예를 들어, 이 결정은 방식 3을 통해 먼저 수행된다. 적어도 두 개의 상향링크 캐리어가 방식 3을 통해 결정되는 경우, 다른 상향링크 송신 체인이 위치되는 상향링크 캐리어는 방식 1 또는 방식 2 중 적어도 하나를 통해 캐리어들의 인덱스 또는 우선 순위에 따라 결정된 적어도 두 개의 상향링크 캐리 어로부터 추가로 결정될 수 있다. 선택적 구현으로서, 하나의 포트에서 상향링크 채널을 송신하는 상향링크 캐리어를 제외한 상향링크 캐리어가 상향링크 캐리어에서 상향링크 채널 또는 상향링크 기준 신호의 송신 거리가 가장 짧은 것으로부터 가장 긴 것으로의 순서로 다른 상향링크 체인에서 송신하기 위한 상향링크 캐리어로서 먼저 선택될 수 있다. 하나의 포트 에서 상향링크 채널을 송신하는 상향링크 캐리어를 제외한 다른 상향링크 캐리어를, 상향링크 캐리어에서 상향 링크 채널 또는 상향링크 기준 신호의 송신 거리가 가장 작은 것으로부터 가장 큰 것으로의 순서로 다른 상향링크 체인에서 송신하기 위한 상향링크 캐리어로 선택하는 것이 가능하지 않은 경우, 하나의 포트에서 상향링크 채널을 송신하는 상향링크 캐리어를 제외한 다른 상향링크 캐리어가 상향링크 캐리어의 우선 순위가 가장 높은 것으로부터 가장 낮은 것으로의 순서로 다른 상향링크 체인에서 송신하기 위한 상향링크 캐리어로서 선택될 수 있거나, 또는 하나의 포트에서 상향링크 채널을 송신하는 상향링크 캐리어를 제외한 다른 상향링크 캐리어가 상 향링크 캐리어의 인덱스가 가장 큰 것으로부터 가장 작은 것으로의(또는 가장 작은 것으로부터 가장 큰 것으로 의) 순서로 다른 상향링크 체인에서 송신하기 위한 상향링크 캐리어로서 선택될 수 있다. 예를 들어, UE는 3개의 상향링크 캐리어로 설정된다. 시간 슬롯 t2에서, 제1 상향링크 캐리어에서는 상향링크 채널의 원-포트 송신이 있으며, 제1 상향링크 캐리어를 제외한 다른 두 상향링크 캐리어에서 시간 슬롯 t1에 가 장 가까운 상향링크 송신은, 시간 슬롯 t1에서의 제2 상향링크 캐리어의 상향링크 채널의 송신과 제3 상향링크 캐리어의 상향링크 채널의 송신이다. 이때, 하나의 포트에서 상향링크 채널을 송신하는 상향링크 캐리어를 제외 한 제2 또는 제3 상향링크 캐리어를, 상향링크 캐리어에서 상향링크 채널 또는 상향링크 기준 신호의 송신 거리 가 가장 짧은 것으로부터 가장 큰 것으로의 순서로 다른 상향링크 체인에서 송신하기 위한 상향링크 캐리어로서 선택하는 것이 가능하지 않다. 이 경우, 하나의 포트에서 상향링크 채널을 송신하고 인덱스 1을 갖는 상향링크 캐리어를 제외한 상향링크 캐리어 인덱스 3을 가진 상향링크 캐리어가 캐리어의 가장 큰 인덱스로부터 가장 작 은 인덱스로의 순서로 다른 상향링크 체인에서 송신하기 위한 상향링크 캐리어로서 선택될 수 있다. UE의 두 개 의 상향링크 체인들은 각각 제1 상향링크 캐리어와 제3 상향링크 캐리어에 위치되며, UE는 제2 상향링크 송신 체인 상태에 있다. 방식 5: 하나의 포트에서 상향링크 채널을 송신하는 상향링크 캐리어와 페어링된 다른 상향링크 캐리어가 상위 계층 시 그널링 설정 또는 프로토콜 사전 결정에 따라 다른 상향링크 체인에서 송신하기 위한 상향링크 캐리어로서 결정 될 수 있다. 즉, 상향링크 캐리어들 간의 페어링 관계가 상위 계층 시그널링을 통해 설정(또는 프로토콜을 통해 사전 결정)될 수 있다. UE가 수신된 스케줄링 정보에 따라 하나의 상향링크 캐리어 체인에 대응하는 상향링크 캐리어를 결정한 경우, UE는 상위 계층을 통해 설정되거나 프로토콜을 통해 사전 결정된 페어링 관계에 따라 다 른 상향링크 송신 체인에 대응하는 상향링크 캐리어를 결정할 수 있다. 예를 들어, UE는 3개의 상향링크 캐리어로 설정된다. UE는 상위 계층 시그널링 설정을 수신하며, 이 설정에 따 라 하나의 포트에서 상향링크 채널을 송신하는 제1 상향링크 캐리어와 페어링된 다른 상향링크 캐리어가 제2 상 향링크 캐리어이고, 하나의 포트에서 상향링크 채널을 송신하는 제2 상향링크 캐리어와 페어링된 다른 상향링크 캐리어가 제1 상향링크 캐리어이며, 또한 하나의 포트에서 상향링크 채널을 송신하는 제3 상향링크 캐리어와 페 어링된 다른 상향링크 캐리어가 제1 상향링크 캐리어임을 알게 된다. 즉, 상위 계층 시그널링을 통해 UE의 각 상향링크 캐리어가 원-포트 송신의 시간 도메인에서 이 상향링크 캐리어와 페어링된 하나의 캐리어에 대응하는 것으로 설정된다(이 캐리어는 이 상향링크 캐리어일 수도 있고, 이 상향링크 캐리어를 제외한 두 개의 상향링크 캐리어 중 하나일 수도 있음). 따라서, 시간 슬롯 t1에서, UE가 스케줄링 정보에 따라 제1 상향링크 캐리어에서 상향링크 채널의 원-포트 송신이 있다고 결정한 경우, 페어링 관계에 따라, 하나의 포트에서 상향링크 채널을 송신하는 제1 상향링크 캐리어와 페어링된 다른 상향링크 캐리어가 제2 상향링크 캐리어이며, UE는 제1 상향링 크 송신 체인 상태에 있다. 시간 슬롯 t2에서, UE가 스케줄링 정보에 따라 제3 상향링크 캐리어에서 상향링크 채널의 원-포트 송신이 있다고 결정한 경우, 하나의 포트에서 상향링크 채널을 송신하는 제3 상향링크 캐리어와 페어링된 다른 상향링크 캐리어가 제1 상향링크 캐리어이며, UE는 제2 상향링크 송신 체인 상태에 있다. 다른 예에서, UE는 3개의 상향링크 캐리어로 설정되며, 3개의 상향링크 캐리어들 간의 페어링 관계는 프로토콜 에 의해 사전 결정된다. 예를 들어, 페어링 관계는 인덱스의 크기에 따라 사전 결정된다. 하나의 포트에서 상향 링크 채널을 송신하는 하나의 상향링크 캐리어와 페어링된 다른 상향링크 캐리어는, 상향링크 캐리어들의 인덱 스가 가장 큰 것으로부터 가장 작은 것으로(또는 가장 작은 것으로부터 가장 큰 것으로) 정렬된 후의 첫 번째 인덱스보다 작은, 하나의 포트에서 상향링크 채널을 송신하는 상향링크 캐리어의 첫 번째 인덱스에 가까운 인덱 스를 갖는 상향링크 캐리어이다. 첫 번째 인덱스가 3개의 캐리어의 인덱스 중 가장 작은 인덱스인 경우, 하나의 포트에서 상향링크 채널을 송신하는 상향링크 캐리어는, 3개의 상향링크 캐리어의 인덱스 중 가장 큰 인덱스에 대응하는 상향링크 캐리어이다. UE의 3개의 상향링크 캐리어의 인덱스가 각각 1, 2, 3이며, 인덱스가 1인 캐리어를 제1 캐리어, 인덱스가 2인 캐리어를 제2 캐리어, 인덱스가 3인 캐리어를 제3 캐리어라고 하는 것으로 가정한다. 따라서, 시간 슬롯 1에서, UE가 스케줄링 정보에 따라 인덱스가 2인 상향링크 캐리어에서 상향링크 채널의 원-포트 송신이 있다고 결정한경우, 페어링 관계에 따라, 인덱스가 2인 상향링크 캐리어와 페어링된 다른 상향링크 캐리어는 인덱스가 1인 상 향링크 캐리어이며, UE는 제1 상향링크 송신 체인 상태에 있다. 시간 슬롯 1에서, UE가 스케줄링 정보에 따라 인덱스가 1인 상향링크 캐리어에서 상향링크 채널의 원-포트 송신이 있다고 결정한 경우, 인덱스가 1인 상향링 크 캐리어와 페어링된 다른 상향링크 캐리어는 인덱스가 3인 상향링크 캐리어이며, UE는 제2 상향링크 송신 체 인 상태에 있다. 방식 6: 프로토콜 또는 상위 계층 시그널링 설정 또는 UE의 능력에 따라, 일부 상향링크 송신 체인 상태들 간의 스위칭 이 허용되지 않는 것으로 결정될 수 있다. 다른 상향링크 송신 체인이 위치되는 상향링크 캐리어의 결정 동안에, 스위칭될 수 없는 상향링크 송신 체인 상태들이 먼저 제외된 다음, 스위칭될 수 있는 상향링크 송신 체 인 상태들 중에서 스위칭될 상향링크 송신 체인 상태가 결정된다. 예를 들어, 시간 슬롯 t1에서, UE는 제4 상향링크 송신 체인 상태(0T+2T+0T)에 있다. 이 상태는 시간 슬롯 t2에 대응하는 이전 상향링크 송신 체인 상태이다. 시간 슬롯 t2에서, UE는 스케줄링 정보에 따라 제1 상향링크 캐리 어에서 상향링크 채널의 원-포트 송신이 있고 다른 두 개의 상향링크 캐리어에서 송신이 없다고 결정한다. 즉, 포트 조합은 1P+0P+0P이다. UE의 상향링크 송신 체인 상태를 스위칭하기로 결정된 경우, 1P+0P+0P의 포트 조합 이 스위칭될 수 있는 가능한 상향링크 송신 체인 상태는 제1 상향링크 송신 체인 상태(1T+1T+0T), 제2 상향링크 송신 체인 상태(1T+0T+1T) 및 제5 상향링크 송신 체인 상태(2T+0T+0T)이다. 제4 상향링크 송신 체인 상태에서 제2 상향링크 송신 체인 상태로의 스위칭이 허용되지 않는 상향링크 체인 상태 스위칭인 경우, 스위칭될 상향링 크 송신 체인 상태는 제1 상향링크 송신 체인 상태(1T+1T+0T) 또는 제5 상향링크 송신 상태(2T+0T+0T)이다. 구 체적으로 스위칭되는 상향링크 송신 체인 상태가 제1 상향링크 송신 체인 상태(1T+1T+0T) 또는 제5 상향링크 송 신 상태(2T+0T+0T)인 것이 상술한 방식을 통해 추가로 결정될 수 있다. 방식 7: 프로토콜 또는 상위 계층 시그널링 설정 또는 UE의 능력에 따라, 일부 상향링크 송신 체인 상태들 간의 스위칭 이 허용되는지 여부가 결정될 수 있다. 선택적으로, 하나의 포트에서 상향링크 채널 또는 상향링크 기준 신호를 송신하는 상향링크 캐리어가, 스위칭될 수 있는 적어도 하나의 상향링크 송신 체인 상태에 대응할 수 있는 경우, 다른 상향링크 송신 체인이 위치되는 상향링크 캐리어의 결정 동안에, 현재 스위칭될 수 있는 상향링크 송신 체인 상태가, 스위칭이 허용되는 것으로 규정된 상향링크 송신 체인 상태들 중에서 결정될 수 있다. 체인 상태가 하나만 결정된 경우, 결정된 체인 상태가 현재 스위칭될 상향링크 송신 체인 상태이며; 적어도 두 개의 상향링크 송신 체인 상태가 결정된 경우, 상향링크 송신 체인 상태는 위에서 설명된 다른 방식들을 통해 결정될 수 있다. 선택적인 실시예 2 다수의 상향링크 송신 체인 상태들에 대응하는 송신 포트들의 조합들, 예를 들어, 포트 조합 \"1P+0P+0P\", \"0P+1P+0P\" 및 \"0P+0P+1P\"의 경우, 3개의 상향링크 캐리어 중 하나의 상향링크 캐리어가 원-포트 송신(즉, 하나 의 상향링크 송신 체인이 이 상향링크 캐리어에 위치됨)이기 때문에, 이 상향링크 캐리어가 투-포트 송신 모드 를 지원하는 경우, UE는 시그널링(예를 들어, 상위 계층 시그널링 설정)을 수신하거나 프로토콜 사전 결정에 따 라, 다른 상향링크 송신 체인이 어느 상향링크 캐리어에 위치되는지를 결정할 수 있다. 선택적으로, UE의 3개의 상향링크 캐리어 중 각 캐리어가 하나의 포트에서 상향링크 채널 또는 신호를 송신할 때 다른 상향링크 송신 체인이 위치되는 상향링크 캐리어는 상위 계층 시그널링을 통해 설정될 수 있다. 예를 들어, UE는 인덱스 1, 2 및 3을 갖는 3개의 상향링크 캐리어로 설정된다. 3개의 캐리어의 경우, 상위 계층 시그 널링 uplinkTxSwitching-DualUL-TxState를 통해, 인덱스가 1인 상향링크 캐리어에 대해 OneT2의 지시가 설정되 고, 인덱스가 2인 상향링크 캐리어에 대해 OneT3의 지시가 설정되고, 인덱스가 2인 상향링크 캐리어에 대해 OneT1의 지시가 설정되며, 여기서 OneT2는 인덱스가 1인 캐리어가 원-포트 송신에 있을 때 인덱스가 2인 캐리어 에 다른 상향링크 송신 체인이 위치됨을 나타내고, OneT3은 인덱스가 2인 캐리어가 원-포트 송신에 있을 때 인 덱스가 3인 캐리어에 다른 상향링크 송신 체인이 위치됨을 나타내고, OneT1은 인덱스가 3인 캐리어가 원-포트 송신에 있을 때 인덱스가 1인 캐리어에 다른 상향링크 송신 체인이 위치됨을 나타낸다. 선택적으로, 이 상향링크 캐리어가 원-포트 송신일 때 각 상향링크 캐리어와 매칭되는 상향링크 캐리어가 상위 계층 시그널링을 통해 설정될 수 있으며, UE는, 이 매칭 관계에 따라, 다른 상향링크 송신 체인이 위치되는 캐 리어를 결정할 수 있다.선택적으로, 각 상향링크 캐리어가 하나의 포트에서 상향링크 채널 또는 신호를 송신할 때, 다른 상향링크 체인 이 있는 상향링크 캐리어와 이 캐리어 간의 페어링 관계 또는 만족되어야 할 조건이 프로토콜을 통해 사전 결정 될 수 있다. 예를 들어, 하나의 상향링크 캐리어가 하나의 포트에서 상향링크 채널 또는 신호를 송신할 때, 다 른 상향링크 캐리어 체인이 위치되는 상향링크 캐리어는 이 캐리어의 인덱스보다 큰(또는 작은) 인덱스들 중 이 캐리어의 인덱스에 인접한(가장 가까운) 인덱스를 갖는 상향링크 캐리어일 수 있다는 것이 프로토콜을 통해 사 전 결정될 수 있다. 이 캐리어의 인덱스가 세 개의 상향링크 캐리어의 인덱스들 중 가장 큰 인덱스인 경우, 이 캐리어에 대응하는 다른 상향링크 캐리어는 가장 작은 인덱스를 가진 캐리어이다. 예를 들어, 세 개의 상향링크 캐리어의 인덱스는 각각 1, 2, 3이다. 시간 슬롯 t1에서, UE는 스케줄링 정보에 따라 인덱스가 1인 상향링크 캐 리어가 원-포트 송신인 것으로 결정하며, 프로토콜 사전 결정에 따라, 인덱스 2가 인덱스 1보다 큰 인덱스들 중 인덱스 1에 가장 가까운 인덱스이다. 따라서, 인덱스가 2인 상향링크 캐리어가 다른 상향링크 송신 체인이 위치 되는 캐리어이다. 시간 슬롯 t2에서, UE는 스케줄링 정보에 따라 인덱스가 3인 상향링크 캐리어가 원-포트 송신 인 것으로 결정하며, 프로토콜 사전 결정에 따라, 인덱스가 1인 캐리어가 다른 상향링크 송신 체인에 대응하는 캐리어이다. 일 예로서, 표 2에서 굵은 직사각형 박스로 표시된 송신 포트 조합 1P+0P+0P의 경우, 제1 상향링크 캐리어가 하 나의 포트에서 상향링크 채널 또는 상향링크 기준 신호를 송신하기 때문에, 하나의 상향링크 송신 체인이 제1 상향링크 캐리어에 위치된다. 제1 상향링크 캐리어가 투-포트 송신 모드를 지원하는 경우, UE는, 시그널링(예를 들면, 상위 계층 시그널링 설정)을 수신하여, 다른 상향링크 체인이 제1 상향링크 캐리어, 제2 상향링크 캐리어 또는 제3 상향링크 캐리어에 위치되는지 여부를 결정할 수 있다. UE가, 시그널링(예를 들면, 상위 계층 시그널 링 설정)을 수신하여, 다른 상향링크 체인이 제1 상향링크 캐리어에 위치되는 것으로 결정한 경우, UE의 두 개 의 상향링크 송신 체인들은 제1 상향링크 캐리어에 위치되며, UE는 제5 상향링크 송신 체인 상태에 있다. UE가, 시그널링(예를 들어, 상위 계층 시그널링 설정)을 수신하여, 다른 상향링크 체인이 제2 상향링크 캐리어에 위치 되는 것으로 결정한 경우, UE의 두 개의 상향링크 송신 체인들은 각각 제1 상향링크 캐리어와 제2 상향링크 캐 리어에 위치되며, UE는 제1 상향링크 송신 체인 상태에 있다. UE가, 시그널링(예를 들어, 상위 계층 시그널링 설정)을 수신하여, 다른 상향링크 체인이 제3 상향링크 캐리어에 위치되는 것으로 결정한 경우, UE의 두 개의 상향링크 송신 체인들은 각각 제1 상향링크 캐리어와 제3 상향링크 캐리어에 위치되며, UE는 제2 상향링크 송신 체인 상태에 있다. 표 2에서 타원으로 표시된 송신 안테나 포트에서 상향링크 채널들 또는 상향링크 기준 신호들을 송신하는 조합 0P+1P+0P의 경우, 제2 상향링크 캐리어가 하나의 포트에서 상향링크 채널 또는 상향링크 기준 신호를 송신하기 때문에, 하나의 상향링크 송신 체인이 제2 상향링크 캐리어에 위치된다. 제2 상향링크 캐리어가 투-포트 송신 모드를 지원하는 경우, UE는, 시그널링(예를 들면, 상위 계층 시그널링 설정)을 수신하여, 다른 상향링크 체인 이 제1 상향링크 캐리어, 제2 상향링크 캐리어 또는 제3 상향링크 캐리어에 위치되는지 여부를 결정할 수 있다. UE가, 시그널링(예를 들면, 상위 계층 시그널링 설정)을 수신하여, 다른 상향링크 체인이 제2 상향링크 캐리어 에 위치되는 것으로 결정한 경우, UE의 두 개의 상향링크 송신 체인들은 제2 상향링크 캐리어에 위치되며, UE는 제4 상향링크 송신 체인 상태에 있다. UE가, 시그널링(예를 들어, 상위 계층 시그널링 설정)을 수신하여, 다른 상향링크 체인이 제1 상향링크 캐리어에 위치되는 것으로 결정한 경우, UE의 두 개의 상향링크 송신 체인들은 각각 제1 상향링크 캐리어와 제2 상향링크 캐리어에 위치되며, UE는 제1 상향링크 송신 체인 상태에 있다. UE가, 시그널링(예를 들어, 상위 계층 시그널링 설정)을 수신하여, 다른 상향링크 체인이 제3 상향링크 캐리어 에 위치되는 것으로 결정한 경우, UE의 두 개의 상향링크 송신 체인들은 각각 제2 상향링크 캐리어와 제3 상향 링크 캐리어에 위치되며, UE는 제3 상향링크 송신 체인 상태에 있다. 표 2에서 얇은 직사각형 박스로 표시된 송신 안테나 포트에서 상향링크 채널들 또는 상향링크 기준 신호들을 송 신하는 조합 0P+0P+1P의 경우, 제3 상향링크 캐리어가 하나의 포트에서 상향링크 채널 또는 상향링크 기준 신호 를 송신하기 때문에, 하나의 상향링크 송신 체인이 제3 상향링크 캐리어에 위치된다. 제3 상향링크 캐리어가 투 -포트 송신 모드를 지원하는 경우, UE는, 시그널링(예를 들면, 상위 계층 시그널링 설정)을 수신하여, 다른 상 향링크 체인이 제1 상향링크 캐리어, 제2 상향링크 캐리어 또는 제3 상향링크 캐리어에 위치되는지 여부를 결정 할 수 있다. UE가, 시그널링(예를 들면, 상위 계층 시그널링 설정)을 수신하여, 다른 상향링크 체인이 제3 상향 링크 캐리어에 위치되는 것으로 결정한 경우, UE의 두 개의 상향링크 송신 체인들은 제3 상향링크 캐리어에 위 치되며, UE는 제6 상향링크 송신 체인 상태에 있다. UE가, 시그널링(예를 들어, 상위 계층 시그널링 설정)을 수 신하여, 다른 상향링크 체인이 제1 상향링크 캐리어에 위치되는 것으로 결정한 경우, UE의 두 개의 상향링크 송 신 체인들은 각각 제1 상향링크 캐리어와 제3 상향링크 캐리어에 위치되며, UE는 제2 상향링크 송신 체인 상태에 있다. UE가, 시그널링(예를 들어, 상위 계층 시그널링 설정)을 수신하여, 다른 상향링크 체인이 제2 상향링 크 캐리어에 위치되는 것으로 결정한 경우, UE의 두 개의 상향링크 송신 체인들은 각각 제2 상향링크 캐리어와 제3 상향링크 캐리어에 위치되며, UE는 제3 상향링크 송신 체인 상태에 있다. 제2 예시(Example 2) UE가 4개의 상향링크 캐리어로 설정되고 UE가 2개의 상향링크 송신 체인을 갖는 경우, 최대 10개의 상향링크 송 신 체인 상태가 있을 수 있다. 10개의 상향링크 송신 체인 상태는 2개의 카테고리로 분류될 수 있다. 하나의 카 테고리는 2개의 상향링크 송신 체인이 2개의 상향링크 캐리어에 위치되고 2개의 상향링크 캐리어에 대응하는 송 신 모드가 원-포트 송신인 것이다. 다른 카테고리는 2개의 상향링크 송신 체인이 1개의 상향링크 캐리어에 위치 되고 이 상향링크 캐리어에 대응하는 송신 모드가 투-포트 송신인 것이다. 10개의 상향링크 송신 체인 상태가 아래에서 구체적으로 설명될 것이다. 제1 상향링크 송신 체인 상태는 제1 상향링크 캐리어가 단일 송신 체인의 송신 모드에 있고, 제2 상향링크 캐리 어가 단일 송신 체인의 송신 모드에 있고, 제3 상향링크 캐리어가 제로 송신 체인의 송신 모드에 있으며, 제4 상향링크 캐리어가 제로 송신 체인의 송신 모드에 있는 것이다. 제2 상향링크 송신 체인 상태는 제1 상향링크 캐리어가 단일 송신 체인의 송신 모드에 있고, 제2 상향링크 캐리 어가 제로 송신 체인의 송신 모드에 있고, 제3 상향링크 캐리어가 단일 송신 체인의 송신 모드에 있으며, 제4 상향링크 캐리어가 제로 송신 체인의 송신 모드에 있는 것이다. 제3 상향링크 송신 체인 상태는 제1 상향링크 캐리어가 제로 송신 체인의 송신 모드에 있고, 제2 상향링크 캐리 어가 단일 송신 체인의 송신 모드에 있고, 제3 상향링크 캐리어가 단일 송신 체인의 송신 모드에 있으며, 제4 상향링크 캐리어가 제로 송신 체인의 송신 모드에 있는 것이다. 제4 상향링크 송신 체인 상태는 제1 상향링크 캐리어가 두 송신 체인들의 송신 모드에 있고, 제2 상향링크 캐리 어가 제로 송신 체인의 송신 모드에 있고, 제3 상향링크 캐리어가 제로 송신 체인의 송신 모드에 있으며, 제4 상향링크 캐리어가 제로 송신 체인의 송신 모드에 있는 것이다. 제5 상향링크 송신 체인 상태는 제1 상향링크 캐리어가 제로 송신 체인의 송신 모드에 있고, 제2 상향링크 캐리 어가 2 송신 체인의 송신 모드에 있고, 제3 상향링크 캐리어가 제로 송신 체인의 송신 모드에 있으며, 제4 상향 링크 캐리어가 제로 송신 체인의 송신 모드에 있는 것이다. 제6 상향링크 송신 체인 상태는 제1 상향링크 캐리어가 제로 송신 체인의 송신 모드에 있고, 제2 상향링크 캐리 어가 제로 송신 체인의 송신 모드에 있고, 제3 상향링크 캐리어가 두 송신 체인들의 송신 모드에 있으며, 제4 상향링크 캐리어가 제로 송신 체인의 송신 모드에 있는 것이다. 제7 상향링크 송신 체인 상태는 제1 상향링크 캐리어가 단일 송신 체인의 송신 모드에 있고, 제2 상향링크 캐리 어가 제로 송신 체인의 송신 모드에 있고, 제3 상향링크 캐리어가 제로 송신 체인의 송신 모드에 있으며, 제4 상향링크 캐리어가 단일 송신 체인의 송신 모드에 있는 것이다. 제8 상향링크 송신 체인 상태는 제1 상향링크 캐리어가 제로 송신 체인의 송신 모드에 있고, 제2 상향링크 캐리 어가 단일 송신 체인의 송신 모드에 있고, 제3 상향링크 캐리어가 제로 송신 체인의 송신 모드에 있으며, 제4 상향링크 캐리어가 단일 송신 체인의 송신 모드에 있는 것이다. 제9 상향링크 송신 체인 상태는 제1 상향링크 캐리어가 제로 송신 체인의 송신 모드에 있고, 제2 상향링크 캐리 어가 제로 송신 체인의 송신 모드에 있고, 제3 상향링크 캐리어가 단일 송신 체인의 송신 모드에 있으며, 제4 상향링크 캐리어가 단일 송신 체인의 송신 모드에 있는 것이다. 제10 상향링크 송신 체인 상태는 제1 상향링크 캐리어가 제로 송신 체인의 송신 모드에 있고, 제2 상향링크 캐 리어가 제로 송신 체인의 송신 모드에 있고, 제3 상향링크 캐리어가 제로 송신 체인의 송신 모드에 있으며, 제4 상향링크 캐리어가 두 송신 체인들의 송신 모드에 있는 것이다. 표 3에 나와 있는 바와 같이, 각 상향링크 송신 체인 상태에서, 4개의 설정된 상향링크 캐리어에서 상향링크 채 널의 송신을 위한 안테나 포트들의 조합들이 표 3에 나타나 있다. 단일 송신 체인의 송신 모드에서 상향링크 캐 리어는 원-포트 송신(1P) 또는 0포트 송신(0P)일 수 있고, 2개의 송신 체인의 송신 모드에서 상향링크 캐리어는 투-포트 송신(2P) 또는 원-포트 송신(1P)일 수 있다.[표 3]"}
{"patent_id": "10-2024-7032063", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "상기 표 3은 상향링크 송신 체인 상태들, 송신 체인들의 수 및 송신 안테나 포트들 간의 대응 관계를 나타낸 것 이다. 표 3으로부터 알 수 있는 바와 같이, 서로 다른 상향링크 송신 체인 상태들에는, 동일한 송신 안테나 포트에서 의 상향링크 채널들 또는 상향링크 기준 신호들의 송신 조합들이 존재한다. 예를 들어, 굵은 직사각형 박스로 표시된 송신 안테나 포트에서 상향링크 채널들 또는 상향링크 기준 신호들의 송신 조합 1P+0P+0P+0P를 참조하면, 제1 상향링크 캐리어에서는 상향링크 채널 또는 상향링크 기준 신호의 원-포트 송신이 있고, 제2 상 향링크 캐리어, 제3 상향링크 캐리어, 제4 상향링크 캐리어에서는 상향링크 채널 또는 상향링크 기준 신호의 송 신이 없다. 이때, 상향링크 송신 체인 상태는 제1 상향링크 송신 체인 상태, 제2 상향링크 송신 체인 상태, 제4 상향링크 송신 체인 상태, 제7 상향링크 송신 체인 상태 중 하나일 수 있다. 또는, 얇은 타원형 박스로 표시된 송신 안테나 포트에서 상향링크 채널들 또는 상향링크 기준 신호들의 송신 조합 0P+1P+0P+0P를 참조하면, 제2 상향링크 캐리어에서는 상향링크 채널 또는 상향링크 기준 신호의 원-포트 송신이 있고, 제1 상향링크 캐리어, 제3 상향링크 캐리어 및 제4 상향링크 캐리어에서는 상향링크 채널 또는 상향링크 기준 신호의 송신이 없다. 이 때, 상향링크 송신 체인 상태는 제1 상향링크 송신 체인 상태, 제3 상향링크 송신 체인 상태, 제5 상향링크 송 신 체인 상태 및 제8 상향링크 송신 체인 상태 중 하나일 수 있다. 또는, 얇은 직사각형 박스로 표시된 송신 안 테나 포트에서 상향링크 채널들 또는 상향링크 기준 신호들의 송신의 조합 0P+0P+1P+0P를 참조하면, 제3 상향링 크 캐리어에서는 상향링크 채널 또는 상향링크 기준 신호의 원-포트 송신이 있고, 제1 상향링크 캐리어, 제2 상 향링크 캐리어 및 제4 상향링크 캐리어에서는 상향링크 채널 또는 상향링크 기준 신호의 송신이 없다. 이때, 상 향링크 송신 체인 상태는 제2 상향링크 송신 체인 상태, 제3 상향링크 송신 체인 상태, 제6 상향링크 송신 체인 상태 및 제9 상향링크 송신 체인 상태 중 하나일 수 있다. 또는, 굵은 타원 박스로 표시된 송신 안테나 포트에 서 상향링크 채널들 또는 상향링크 기준 신호들의 송신 조합 0P+0P+0P+1P를 참조하면, 제4 상향링크 캐리어에서 는 상향링크 채널 또는 상향링크 기준 신호의 원-포트 송신이 있고, 제1 상향링크 캐리어, 제2 상향링크 캐리어및 제3 상향링크 캐리어에서는 상향링크 채널 또는 상향링크 기준 신호의 송신이 없다. 이때, 상향링크 송신 체 인 상태는 제7 상향링크 송신 체인 상태, 제8 상향링크 송신 체인 상태, 제9 상향링크 송신 체인 상태 및 제10 상향링크 송신 체인 상태 중 하나일 수 있다. 따라서, UE는 기지국으로부터 수신된 스케줄링 정보에 따라 4개의 상향링크 캐리어들 중 하나가 원-포트 송신 (즉, 하나의 상향링크 송신 체인이 상향링크 캐리어들 중 하나에 위치됨)인 것으로 결정하지만, UE의 구체적인 상향링크 송신 체인 상태가 추가로 결정되어야 한다. 이 결정 방법은 제1 예시에서 상술한 방식들 중 하나 이상 에서 다른 상향링크 송신 체인이 위치되는 캐리어를 결정하는 것을 참조할 수 있다. 예를 들어, 상위 계층 설정 을 통해 다른 상향링크 송신 체인이 위치되는 캐리어와 결정된 하나의 상향링크 캐리어가 동일한 캐리어인지 여 부가 결정될 수 있다. 다른 상향링크 송신 체인이 위치되는 캐리어와 결정된 하나의 상향링크 캐리어가 동일한 캐리어가 아닌 경우, 다른 상향링크 송신 체인이 위치되는 캐리어는 상술한 방식들 1 내지 7 중 하나를 통해 추 가로 결정될 수 있다. 또는, 상향링크 캐리어들 간의 페어링 관계 또는 페어링 규칙이 상위 계층을 통해 설정되 거나 프로토콜을 통해 사전 결정된다. 하나의 포트에서 상향링크 채널이나 신호를 송신하는 하나의 상향링크 캐 리어가 결정된 후에, 페어링 관계 또는 페어링 규칙에 따라 다른 상향링크 송신 체인이 위치되는 상향링크 캐리 어가 결정될 수 있다. 마찬가지로, UE가 4개보다 많은 상향링크 캐리어로 설정된 경우, 이러한 결정은 제1 예시에서 상술한 방식들을 참조하여 수행될 수 있다. 본 개시에 의해 제공되는 솔루션들을 기반으로, 기지국은 통신 시스템의 자원들을 보다 유연하게 스케줄링할 수 있으며, UE의 통신 효과를 보다 더 향상시킬 수 있다. 본 개시의 실시예들에서 제공된 방법들을 기반으로, 본 개시의 실시예는 사용자 단말을 추가로 제공한다. 사용 자 단말은 트랜시버 모듈과 자원 결정 모듈을 포함할 수 있으며, 여기서 트랜시버 모듈은 기지국에 의해 송신된 제1 정보를 수신하도록 구성될 수 있고, 제1 정보는 스케줄링된 상향링크 자원 및 송신 모드의 관련 정보를 포 함하고; 자원 결정 모듈은 제1 정보에 따라 사용자 단말의 상향링크 송신 체인 상태를 결정하도록 구성될 수 있 다. 본 개시의 실시예들에서 제공된 방법들을 기반으로, 본 개시의 실시예는 기지국을 추가로 제공한다. 기지국은 트랜시버 모듈을 포함할 수 있으며, 여기서 트랜시버 모듈은 사용자 단말에게 제1 정보를 송신하도록 구성될 수 있고, 제1 정보는 사용자 단말의 상향링크 송신 체인 상태를 결정하도록 구성되고; 여기서 제1 정보는 스케줄링된 상향링크 자원과 해당 송신 모드를 포함한다. 선택적으로, 사용자 단말은 두 개의 상향링크 송신 체인들을 지원하고, 사용자 단말은 L개의 상향링크 자원들로 설정되며, 여기서 이다. 본 개시의 실시예들에서의 장치는 본 개시의 실시예들에서 제공된 방법을 실행할 수 있으며, 그 구현 원리들은 유사하다는 것을 이해해야 한다. 본 개시의 실시예들에서의 장치의 모듈들에 의해 수행되는 동작들은 본 개시의 실시예들에서의 방법들의 단계들에 대응한다. 모듈들은 소프트웨어 및/또는 하드웨어에 의해 구현될 수 있다. 장치의 모듈들에 대한 자세한 기능 설명은 전술한 대응 방법들에 대한 설명을 참조할 수 있으며, 여기서는 자세 한 내용을 반복하지 않는다. 본 개시의 실시예는 사용자 단말을 추가로 제공한다. 사용자 단말은 트랜시버와 프로세서를 포함할 수 있으며, 여기서 프로세서는 트랜시버에 결합되어 본 개시의 선택적 실시예들 중 어느 것에 따라 사용자 단말에 의해 수 행되는 방법을 구현하도록 구성된다. 본 개시의 실시예는 기지국을 추가로 제공한다. 기지국은 트랜시버와 프로세서를 포함할 수 있으며, 여기서 프 로세서는 트랜시버에 결합되어 본 개시의 선택적 실시예들 중 어느 것에 따라 기지국에 의해 수행되는 방법을 구현하도록 구성된다. 본 개시의 실시예는 프로세서에 의해 실행될 때, 본 개시의 선택적 실시예들 중 어느 것에 따라 사용자 단말에 의해 수행되는 방법 또는 본 개시의 선택적 실시예들 중 어느 것에 따라 기지국에 의해 수행되는 방법을 구현할 수 있는 컴퓨터 프로그램들이 저장된 컴퓨터 판독 가능 저장 매체를 추가로 제공한다. 선택적 구현으로서, 도 12는 본 개시의 실시예가 적용 가능한 전자 장치의 개략적인 구조도를 도시하고 있으며, 여기서 전자 장치는 사용자 단말 또는 기지국, 또는 사용자 단말 또는 기지국의 일부로서 구현될 수 있고, 전자장치는 본 개시의 임의의 실시예들에서 제공되는 방법을 구현하는데 사용될 수 있다. 도 12에 도시된 바와 같이, 전자 장치는 프로세서 및 메모리, 및 트랜시버를 포함할 수 있다. 여기서, 프로세서는 예를 들어 버스를 통해 메모리와 통신한다. 트랜시버는 이 전자 장치와 다른 전자 장치들 간의 데이터 상호 작용, 예를 들어 데이터 송신 및/또는 데이터 수신에 사용 될 수 있다. 예를 들어, 전자 장치는 사용자 단말일 수 있고, 전자 장치는 트랜시버를 통해 기지국과 통 신하고, 기지국에 의해 전송된 신호를 수신하고, 기지국으로 신호를 전송할 수 있다. 트랜시버는 실제 응 용들에서 하나로 제한되지 않으며, 전자 장치의 구조는 이 응용 실시예의 제한을 구성하지 않는다는 점에 유의해야 한다. 프로세서는 CPU(central processing unit), 범용 프로세서, DSP(digital signal processor), ASIC(application specific integrated circuit), FPGA(field programmable gate array), 또는 다른 프로그래 밍 가능 논리 장치, 트랜지스터 논리 장치, 하드웨어 구성 요소 또는 이들의 임의의 조합일 수 있다. 본 개시의 내용들과 함께 설명된 다양한 예시적인 논리 블록, 모듈 및 회로를 구현하거나 실행하는 것이 가능하다. 프로세 서는 또한 하나 이상의 마이크로프로세서의 조합, DSP와 마이크로프로세서의 조합 등과 같은 컴퓨팅 기능 들의 조합일 수 있다. 버스는 상기 구성 요소들 사이에서 정보를 전달하기 위한 경로를 포함할 수 있다. 버스는 PCI(Peripheral Component Interconnect) 버스 또는 EISA(Extended Industry Standard Architecture) 버스일 수 있다. 버스는 어드레스 버스, 데이터 버스, 제어 버스 등으로 구분될 수 있다. 설명의 용이성을 위해, 도 12에는 굵은 선 하나만 표시되어 있지만, 버스나 버스 타입이 하나만 있다는 것을 나타내지는 않는다. 메모리는 정적 정보와 명령어들을 저장할 수 있는 ROM(read only memory) 또는 다른 타입들의 정적 저장 장치, 정보와 명령어들을 저장할 수 있는 RAM(random access memory) 또는 다른 타입들의 저장 장치일 수 있다. 메모리는 또한 EEPROM(electrically erasable programmable read only memory), CD-ROM(compact disc read only memory) 또는 다른 광 디스크 저장 장치, 광 디스크 저장 장치(압축된 콤팩트 디스크, 레이저 디스크, 콤팩트 디스크, 디지털 다용도 디스크, 블루레이 디스크 등 포함), 자기 디스크 저장 매체 또는 다른 자기 저장 장치, 또는 컴퓨터 프로그램을 전달하거나 저장할 수 있고 컴퓨터가 액세스할 수 있는 다른 매체일 수 있으며, 이에 한정되지 않는다. 메모리는 본 개시의 실시예들을 실행하기 위한 컴퓨터 프로그램들을 저장하는데 사용되며 프로세서(400 1)에 의한 실행을 위해 제어된다. 프로세서는 메모리에 저장된 컴퓨터 프로그램을 실행하여 이전 방법 실시예에 표시된 단계들을 구현하는데 사용된다. 도 13은 본 개시의 일 실시예에 따른 UE의 구조를 나타내는 블록도이다. 도 13은 도 3a의 UE의 예시에 대응한다. 도 13에 도시된 바와 같이, 일 실시예에 따른 UE는 트랜시버, 메모리 및 프로세서를 포함할 수 있다. UE의 트랜시버, 메모리 및 프로세서는 전술한 UE의 통신 방식에 따라 동작할 수 있 다. 그러나 UE의 컴포넌트들은 이에 한정되지 않는다. 예를 들어, UE는 전술한 것보다 더 많거나 더 적은 컴포 넌트들을 포함할 수 있다. 또한, 프로세서, 트랜시버 및 메모리는 하나의 칩으로 구현될 수 있다. 또한, 프로세서는 적어도 하나의 프로세서를 포함할 수 있다. 트랜시버는 UE 수신기 및 UE 송신기를 총칭하는 것이며, 기지국 또는 네트워크 엔티티로/부터 신호를 송/ 수신할 수 있다. 기지국 또는 네트워크 엔티티로 또는 기지국 또는 네트워크 엔티티로부터 송수신되는 신호는 제어 정보 및 데이터를 포함할 수 있다. 트랜시버는 송신 신호의 주파수를 상향 변환 및 증폭하는 RF 송 신기 및 수신 신호의 주파수를 저잡음 증폭 및 하향 변환하는 RF 수신기를 포함할 수 있다. 그러나, 이것은 트 랜시버의 일 예일 뿐이며, 트랜시버의 구성 요소가 RF 송신기 및 RF 수신기에 한정되는 것은 아니 다 또한, 트랜시버는 무선 채널을 통해 신호를 수신하여 프로세서로 출력하고, 프로세서에서 출 력되는 신호를 무선 채널을 통해 송신할 수 있다. 메모리는 UE의 동작들에 필요한 프로그램 및 데이터를 저장할 수 있다. 또한, 메모리는 UE에 의해 획득된 신호에 포함된 제어 정보 또는 데이터를 저장할 수 있다. 메모리는 ROM(Read-Only Memory), RAM(Random Access Memory), 하드 디스크, CD-ROM, DVD 등과 같은 저장 매체 또는 저장 매체의 조합일 수있다. 프로세서는 UE가 상술한 바와 같이 동작하도록 하는 일련의 프로세스들을 제어할 수 있다. 예를 들어, 트 랜시버는 기지국 또는 네트워크 엔티티가 전송한 제어 신호를 포함하는 데이터 신호를 수신할 수 있고, 프로세서는 기지국 또는 네트워크 엔티티가 전송한 제어 신호 및 데이터 신호를 수신한 결과를 결정할 수 있다. 도 14는 본 개시의 일 실시예에 따른 기지국의 구조를 나타내는 블록도이다. 도 14는 도 3b의 기지국의 예에 대 응한다. 도 14에 도시된 바와 같이, 일 실시예에 따른 기지국은 트랜시버, 메모리 및 프로세서를 포 함할 수 있다. 기지국의 트랜시버, 메모리 및 프로세서는 전술한 기지국의 통신 방법에 따라 동작할 수 있다. 그러나, 기지국의 컴포넌트들이 이에 한정되는 것은 아니다. 예를 들어, 기지국은 위에서 설명 된 것보다 더 많거나 더 적은 컴포넌트들을 포함할 수도 있다. 또한, 프로세서, 트랜시버 및 메모 리는 하나의 칩으로 구현될 수 있다. 또한, 프로세서는 적어도 하나의 프로세서를 포함할 수 있다. 트랜시버는 기지국 수신기 및 기지국 송신기를 총칭하는 것이며 단말과 신호를 송수신할 수 있다. 단말과 송수신하는 신호에는 제어 정보 및 데이터가 포함될 수 있다. 트랜시버는 송신 신호의 주파수를 상향 변 환 및 증폭하는 RF 송신기 및 수신 신호의 주파수를 저잡음 증폭 및 하향 변환하는 RF 수신기를 포함할 수 있다. 그러나, 이것은 트랜시버의 일 예일 뿐이며, 트랜시버의 컴포넌트들이 RF 송신기 및 RF 수신 기에 한정되는 것은 아니다. 또한, 트랜시버는 무선 채널을 통해 신호를 수신하여 프로세서로 출력하고, 프로세서에서 출 력되는 신호를 무선 채널을 통해 송신할 수 있다. 메모리는 기지국의 동작들에 필요한 프로그램 및 데이터를 저장할 수 있다. 또한, 메모리는 기지국 이 획득한 신호에 포함된 제어 정보 또는 데이터를 저장할 수 있다. 메모리는 ROM(Read-Only Memory), RAM(Random Access Memory), 하드 디스크, CD-ROM, DVD 등과 같은 저장 매체 또는 저장 매체의 조합일 수 있다. 프로세서는 기지국이 상술한 바와 같이 동작하도록 하는 일련의 프로세스들을 제어할 수 있다. 예를 들어, 트랜시버는 UE가 송신한 제어 신호를 포함하는 데이터 신호를 수신하고, 프로세서는 단말이 송신한 제어 신호 및 데이터 신호의 수신 결과를 결정할 수 있다. 본 개시의 명세서 및 청구항과 상기 첨부 도면에서 \"제1\", \"제2\", \"제3\", \"제4\", \"1\", \"2\" 등의 용어는(존재하 는 경우) 유사한 대상을 구별하는데 사용되며 특정 순서나 시퀀스를 설명하는데 사용될 필요가 없음을 이해해야 한다. 이렇게 사용된 데이터는 적절한 경우 상호 교환 가능하므로 여기에 설명된 본 개시의 실시예는 텍스트에 도시되거나 설명된 순서와 다른 순서로 구현될 수 있음을 이해해야 한다. 본 개시의 실시예들의 흐름도가 화살표로 개별적인 동작 단계들을 나타내지만, 이러한 단계들이 수행되는 순서 는 화살표로 표시된 순서에 제한되지 않는다는 것을 이해해야 한다. 본 명세서에서 명시적으로 언급되지 않는 한, 본 개시의 실시예의 일부 구현 시나리오에서, 각각의 흐름도의 구현 단계들은 필요에 따라 다른 순서들로 수행될 수도 있다. 또한, 각 흐름도의 일부 또는 모든 단계는 실제 구현 시나리오에 따라 다수의 하위 단계 또 는 다수의 페이즈를 포함할 수 있다. 이러한 하위 단계 또는 스테이지의 일부 또는 전부는 동시에 실행될 수 있 으며, 이러한 하위 단계 또는 스테이지 각각은 또한 서로 다른 시점들에서 개별적으로 실행될 수도 있다. 이러 한 하위 단계 또는 스테이지의 실행 순서는 실행 시간의 다른 시나리오에서의 요구 사항에 따라 유연하게 구성 될 수 있으며, 본 개시의 실시예는 이에 제한되지 않는다. 상술한 설명은 본 개시의 일부 구현 시나리오에 대한 단지 대안적인 실시예일 뿐이며, 본 개시의 기술적 개념에 서 벗어나지 않고 본 개시의 기술적 사상에 기초한 다른 유사한 구현 수단을 채택하는 것도 본 개시의 실시예의 보호 범위 내에 있음을 알아야 한다.도면 도면1 도면2a 도면2b 도면3a 도면3b 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13 도면14"}
{"patent_id": "10-2024-7032063", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 개시의 실시예들의 기술적 솔루션들을 보다 명확하게 설명하기 위해, 본 개시의 실시예들을 설명하는데 사용 되는 첨부 도면들에 대해 아래에서 간략하게 설명한다. 도 1은 본 개시의 실시예에 따른 예시적인 무선 네트워크를 도시한다. 도 2a는 본 개시의 실시예에 따른 예시적인 무선 송신 경로를 도시한다. 도 2b는 본 개시의 실시예에 따른 예시적 무선 수신 경로를 도시한다. 도 3a는 본 개시의 실시예에 따른 예시적 사용자 단말을 도시한다. 도 3b는 본 개시의 실시예에 따른 예시적 기지국을 도시한다. 도 4는 본 개시의 실시예에 따른 통신 방법의 흐름도를 도시한다. 도 5 및 도 6은 본 개시의 실시예에 따른 두 개의 상향링크 송신 체인들을 지원하는 사용자 단말에 의한 상향링크 송신을 수행하는 두 개의 개략도들을 각각 도시한다. 도 7 및 도 8은 사용자 단말이 상향링크 송신 체인 상태들을 스위칭할 수 있는 경우의 두 개의 개략도들을 각각 도시한다. 도 9, 도 10 및 도 11은 사용자 단말의 상향링크 송신 체인 상태를 결정하기 위한 세 가지 솔루션들의 개략도들 을 각각 도시한다. 도 12는 본 개시의 실시예가 적용되는 전자 장치의 개략적인 구조도를 도시한다. 도 13은 본 개시의 실시예에 따른 UE의 구조를 나타내는 블록도를 도시한다. 도 14는 본 명세서에 개시된 바와 같은 실시예들에 따른, 본 개시의 실시예에 따른 기지국의 구조를 나타내는 블록도를 도시한다."}
