{"patent_id": "10-2020-0155299", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0069145", "출원번호": "10-2020-0155299", "발명의 명칭": "데이터 결합을 통한 3차원 문화재의 데이터베이스 구축방법 및 시스템", "출원인": "주식회사 공간정보", "발명자": "김현진"}}
{"patent_id": "10-2020-0155299", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "상기 드론(100)으로부터 촬영된 문화재 대상물의 항공영상이미지인 항공데이터와 상기 지상카메라(200)로부터촬영된 문화재 대상물의 지상영상이미지인 지상데이터가 획득되는 드론과 지상카메라를 이용한 문화재의 영상데이터 취득단계(10);상기 단계(10)에서 취득되어 테스트베드로 선정된 문화재 대상물의 항공데이터와 지상데이터를 바탕으로 이미지의 객체를 객체인식알고리즘(310)이 윤곽선으로 인식 처리하는 취득 데이터를 기반으로 한 윤곽선의 처리단계(20);상기 단계(20)에서 이미지 객체가 윤곽선으로 인식 처리된 항공데이터와 지상데이터를 기반으로 인공지능서버(300)에서 연동되는 3차원 복원 프로그램(410)을 통해 3D 이미지를 복원하는 인공지능을 활용한 3D 이미지 복원단계(30); 및상기 단계(30)에서 복원된 3D 문화재가 웹사이트상에에 시현 가능하면서 호환 가능한 3차원 실감 콘텐츠 형식으로 웹서버(500)에 설치된 웹뷰어프로그램(510)을 통해 구축 제공되는 3D DB 활용 웹서비스 환경 구축단계(40);를 포함하는 구성으로 이루어지는 것을 특징으로 하는 데이터 결합을 통한 3차원 문화재의 데이터베이스 구축방법."}
{"patent_id": "10-2020-0155299", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 단계(10)에서의 상기 지상카메라(200)로부터 촬영되는 지상데이터는 동일한 거리에서 촬영되는 방식으로실시되되, 점진적인 촬영거리가 확보되며 다른 방향에서 360°로 촬영되면서 최소 70% 이상의 중복으로 촬영되는 한편,상기 단계(10)에서의 상기 드론(100)으로부터 촬영되는 항공데이터는 크로스패스 촬영 기법을 활용한 종횡 최소80% 이상의 중복도를 유지하며 촬영되는 것을 특징으로 하는 데이터 결합을 통한 3차원 문화재의 데이터베이스구축방법."}
{"patent_id": "10-2020-0155299", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 단계(20)에서의 객체인식알고리즘(310)으로부터 인식 처리된 항공데이터와 지상데이터는 이미지 세그멘테이션 알고리즘(311)을 통해 카테고리별 세그메틱 라벨링 방식으로 처리 가공되는 한편,상기 카테고리별 세그메틱 라벨링 방식으로 처리 가공된 항공데이터와 지상데이터에 대한 이미지 매칭의 검증은이미지매칭알고리즘(320)을 통해 이루어지는 것을 특징으로 하는 데이터 결합을 통한 3차원 문화재의 데이터베이스 구축방법."}
{"patent_id": "10-2020-0155299", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기의 단계(10)와 단계(20) 사이에는 취득된 항공데이터와 지상데이터를 삼차원 공간에 투영하여 3D 스캔데이터로부터 발생되는 에러나 불필요한 데이터를 클라우드서버(1000)에서 정리하는 방식으로 최적화 처리하며 저용량 클라우드를 생성하도록 하는 저용량 클라우드 생성 단계(15)가 더 수행되는 것을 특징으로 하는 데이터 결합을 통한 3차원 문화재의 데이터베이스 구축방법."}
{"patent_id": "10-2020-0155299", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2022-0069145-3-제1항에 있어서,상기의 단계(30)와 단계(40) 사이에는 상기 단계(30)에서 복원된 3D 문화재를 웹사이트상에서 호환될 수 있게클라우드서버(1000)에 설치된 3D 편집툴(1100)을 통해 시현하기에 적합한 3D 뷰어 및 VR과 AR 실감 콘텐츠의 형식으로 제작하는 호환성 3D 뷰어 제작단계(35)가 더 수행되는 것을 특징으로 하는 데이터 결합을 통한 3차원 문화재의 데이터베이스 구축방법."}
{"patent_id": "10-2020-0155299", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 3D 편집툴(1100)은 웹사이트상에 생성된 캔버스 상에 3D 뷰어를 삽입하고 저용량 클라우드를 연결하면서가상의 카메라 생성에 따라 사용자의 입력을 통한 자유로운 시점을 제공하면서, 상기 저용량 클라우드를 활용한주변 환경과 반응할 수 있는 실시간 합성되는 3차원의 실감 콘텐츠를 제작하는 것을 특징으로 하는 데이터 결합을 통한 3차원 문화재의 데이터베이스 구축방법."}
{"patent_id": "10-2020-0155299", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "문화재의 대상물을 항공에서 촬영하기 위한 영상카메라(110)가 탑재된 드론(100); 문화재의 대상물을 지상에서 촬영하기 위한 지상카메라(200);드론 및 지상카메라로부터 취득된 항공데이터와 지상데이터에 대한 이미지의 객체 인식 처리가 이루어지는 인공지능서버(300);인공지능서버와 연동되며 상기의 데이터(항공데이터와 지상데이터)의 이미지들을 3차원의 3D 이미지로 복원하는처리하는 3차원 복원 프로그램(410); 및3차원으로 복원된 3D 문화재를 웹사이트상에서 시현 가능하면서도 호환 가능한 3차원 실감 콘텐츠 형식으로 제공하는 웹서버(500);를 포함하는 구성으로 이루어지는 것을 특징으로 하는 데이터 결합을 통한 3차원 문화재의 데이터베이스 구축시스템."}
{"patent_id": "10-2020-0155299", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 데이터 결합을 통한 3차원 문화재의 데이터베이스 구축방법 및 시스템에 대한 것으로, 상기의 구축방 법은 상기 드론으로부터 촬영된 문화재의 항공영상이미지인 항공데이터와 상기 지상카메라로부터 촬영된 문화재 의 지상영상이미지인 지상데이터가 획득되는 드론과 지상카메라를 이용한 문화재의 영상 데이터 취득단계, 상기 (뒷면에 계속)"}
{"patent_id": "10-2020-0155299", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 데이터 결합을 통한 3차원 문화재의 데이터베이스의 구축방법 및 시스템에 대한 것으로, 문화재 대상 물에 대한 촬영된 항공데이터와 지상에서 촬영된 지상데이터의 정합에 따른 포인트 클라우드 처리 방식의 병합 을 통해 3차원의 가상 현실에서 문화재의 방대한 테라바이트급 DB로 보유 가능하고, 이들 DB의 처리 속도 개선 과 DB의 효율적인 관리뿐만 아니라 가상 현실에서의 문화재의 실감있는 시현성을 확보하고자 하는 데이터 결합 을 통한 3차원 문화재의 데이터베이스의 구축방법 및 시스템에 관한 것이다."}
{"patent_id": "10-2020-0155299", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "문화재를 관리하는 문화재청에 고시된‘문화유산 3차원 스캔데이터 구축 가이드 라인’이라는 고시 내용에는 라 이다를 이용한 방법으로만 3차원 스캔데이터 구축하는 것으로 고시하고 있다. 이처럼, 라이다를 이용한 방법을 이용한 3차원 스캔데이터 구축은 장비 및 시간과 인력 투입이 많이 소모되며 데이터의 용량 또한 방대하여 쉽게 활용하지 못한다. 물론, 이러한 라이다를 이용한 방법 이외에도 드론에 탑재된 영상카메라와 고도측정기를 이용하여 피사체인 문 화재의 대상물(문화유산, 건조물과 대형조각물, 유적지와 발굴지)들을 적정한 고도에서 항공 촬영 방식으로 3차 원 스캔 데이터들을 취득하여 확보할 수도 있다. 하지만, 이렇게 드론으로부터 취득된 문화재 대상물의 항공데이터들은 그 데이터의 양이 방대하고, 더욱이 이러 한 항공데이터들에 문화재 대상물의 지상데이터들까지 병합될 수 있으나, 병합된 데이터들의 방대한 DB로 인하 여 DB 처리 속도가 지연되는 관계로, DB가 제대로 활용되지 못하고 방치되고 있다. 또한, 이러한 방대한 DB를 활용한 3차원 현실에서의 문화재 대상물에 대한 가상 체험 기술도 보급되고 있으나, 현실성 있는 실감성에까지는 이르지 못하고 있는 수준이며, DB의 방대함으로 인한 처리 속도의 지연에 따라 이 마저도 상시 활용되지 못하고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 특허문헌 001 : 등록특허 제10-1863188호(등록일자 2018. 05. 25)"}
{"patent_id": "10-2020-0155299", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "전술된 문제점들을 해소하기 위한 본 발명은, 문화재 대상물을 가상의 3차원 현실에서 구축하며 관리할 수 있는 방법 및 시스템의 제공에 있어서, 방대한 DB 보유에 따른 시스템 부하로 인한 DB의 처리 속도 개선과 함께, 시 스템의 효율적인 메모리 사용과 분산처리기술을 통한 테라바이트급의 방대한 영상처리 DB 보유 및 구축을 구현 하고자 하는 데이터 결합을 통한 3차원 문화재의 데이터베이스 구축방법 및 시스템을 제공하고자 함에 그 목적 을 두고 있다."}
{"patent_id": "10-2020-0155299", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "전술된 목적들을 달성하기 위한 본 발명은, 상기 드론으로부터 촬영된 문화재의 항공영상이미지인 항공데 이터와 상기 지상카메라로부터 촬영된 문화재의 지상영상이미지인 지상데이터가 획득되는 드론과 지상카메 라를 이용한 문화재의 영상 데이터 취득단계, 상기 단계에서 취득되어 테스트베드로 선정된 문화재의 항공데이터와 지상데이터를 바탕으로 이미지의 객체를 객체인식알고리즘이 윤곽선으로 인식 처리하는 취득 데이터를 기반으로 한 윤곽선의 처리단계, 상기 단계에서 이미지 객체가 윤곽선으로 인식 처리된 항공 데이터와 지상데이터를 기반으로 인공지능서버에서 연동되는 3차원 복원 프로그램을 통해 3D 이미지 를 복원하는 인공지능을 활용한 3D 이미지 복원단계, 및 상기 단계에서 복원된 3D 문화재가 웹사이트상 에에 시현 가능하면서 호환 가능한 3차원 실감 콘텐츠 형식으로 웹서버에 설치된 웹뷰어프로그램을 통해 구축 제공되는 3D DB 활용 웹서비스 환경 구축단계를 포함하는 구성으로 이루어지는 데이터 결합을 통 한 3차원 문화재의 데이터베이스 구축방법에 일례의 특징이 있다. 상기 단계에서의 상기 지상카메라로부터 촬영되는 지상데이터는 동일한 거리에서 촬영되는 방식으로 실시되되, 점진적인 촬영거리가 확보되며 다른 방향에서 360°로 촬영되면서 최소 70% 이상의 중복으로 촬영되 는 한편, 상기 단계에서의 상기 드론으로부터 촬영되는 항공데이터는 크로스패스 촬영 기법을 활용한 종횡 최소 80% 이상의 중복도를 유지하며 촬영되는 데이터 결합을 통한 3차원 문화재의 데이터베이스 구축방법 에 일례의 특징이 있다. 상기 단계에서의 객체인식알고리즘으로부터 인식 처리된 항공데이터와 지상데이터는 이미지 세그멘테 이션 알고리즘을 통해 카테고리별 세그메틱 라벨링 방식으로 처리 가공되는 한편, 상기 카테고리별 세그메 틱 라벨링 방식으로 처리 가공된 항공데이터와 지상데이터에 대한 이미지 매칭의 검증은 이미지매칭알고리즘 을 통해 이루어지는 데이터 결합을 통한 3차원 문화재의 데이터베이스 구축방법에 일례의 특징이 있다. 상기의 단계와 단계 사이에는 취득된 항공데이터와 지상데이터를 삼차원 공간에 투영하여 3D 스캔데이 터로부터 발생되는 에러나 불필요한 데이터를 클라우드서버에서 정리하는 방식으로 최적화 처리하며 저용 량 클라우드를 생성하도록 하는 저용량 클라우드 생성 단계가 더 수행되는 데이터 결합을 통한 3차원 문화 재의 데이터베이스 구축방법에 일례의 특징이 있다. 상기의 단계와 단계 사이에는 상기 단계에서 복원된 3D 문화재를 웹사이트상에서 호환될 수 있게 클라우드서버에 설치된 3D 편집툴을 통해 시현하기에 적합한 3D 뷰어 및 VR과 AR 실감 콘텐츠의 형식으로 제작하는 호환성 3D 뷰어 제작단계가 더 수행되는 데이터 결합을 통한 3차원 문화재의 데이터베이스 구축방법에 일례의 특징이 있다. 상기 3D 편집툴은 웹사이트상에 생성된 캔버스 상에 3D 뷰어를 삽입하고 저용량 클라우드를 연결하면서 가상의 카메라 생성에 따라 사용자의 입력을 통한 자유로운 시점을 제공하면서, 상기 저용량 클라우드를 활용한 주변 환경과 반응할 수 있는 실시간 합성되는 3차원의 실감 콘텐츠를 제작하는 데이터 결합을 통한 3차원 문화 재의 데이터베이스 구축방법에 일례의 특징이 있다. 한편, 전술된 목적들을 달성하기 위한 본 발명은 문화재의 대상물을 항공에서 촬영하기 위한 영상카메라가 탑재된 드론, 문화재의 대상물을 지상에서 촬영하기 위한 지상카메라, 드론 및 지상카메라로부터 취 득된 항공데이터와 지상데이터에 대한 이미지의 객체 인식 처리가 이루어지는 인공지능서버, 인공지능서버 와 연동되며 상기의 데이터(항공데이터와 지상데이터)의 이미지들을 3차원의 3D 이미지로 복원하는 처리하는 3 차원 복원 프로그램, 및 3차원으로 복원된 3D 문화재를 웹사이트상에서 시현 가능하면서도 호환 가능한 3 차원 실감 콘텐츠 형식으로 제공하는 웹서버를 포함하는 구성으로 이루어지는 데이터 결합을 통한 3차원 문화재의 데이터베이스 구축시스템에 다른 일례의 특징이 있다."}
{"patent_id": "10-2020-0155299", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상술된 바에 따른 본 발명에 의하면, 드론으로부터 촬영된 문화재 대상물들에 대한 항공데이터들과 지상카메라 로부터 촬영된 지상데이터들의 결합 처리와 함께 항공데이터와 지상데이터에서 획득된 포인트 클라우드를 병합 하여 하나의 3D 모델로 결과물 산출이 가능하고, 이러한 3D 모델이 웹사이트상에서 시현되기 위한 구축 방식을 제공함에 따라, 시스템의 효율적인 메모리 사용과 분산처리기술을 통한 테라바이트급의 영상처리 DB 보유뿐만 아니라, 고품질의 3차원 문화재 공간정보 구축도 구현되는 효과를 기대할 수 있다."}
{"patent_id": "10-2020-0155299", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변형 실시 예들을 통한 기술적 사상에 이르는 권리 범위까지 포함하는 방식으로 해석되어야"}
{"patent_id": "10-2020-0155299", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "할 것이며, 단지 본 실시예들은 본 발명의 게시가 완전하도록 하고, 본 발명이 속하는 기술분야에서 통상의 지 식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정 의될 뿐이다. 더욱이, 본 발명에 유첨된 도면들은 어디까지나 본 발명에 대한 설명의 이해를 돕기 위한 방안으로 첨부된 관계 로, 본 발명에 유첨된 도면들이 본 발명의 기술적 사상을 대표하지도 않을뿐더러, 본 발명의 기술적 사상이 유 첨된 도면들에 의해 한정적인 해석으로 이해되지도 말아야 할 것이다. 본 발명에 따른 일 실시예의 데이터 결합을 통한 3차원 문화재의 데이터베이스 구축방법은, 도 1에 도시된 바와 같이, 드론과 지상카메라를 이용한 문화재의 영상 데이터 취득단계, 취득 데이터를 기반으로 한 윤곽선의 처리단계, 인공지능을 활용한 3D 이미지 복원단계, 및 3D DB 활용 웹서비스 환경 구축단계를 포함 하는 과정으로 수행될 수 있다. 드론과 지상카메라를 이용한 문화재의 영상 데이터 취득단계 상기 단계에서는 문화재에 대한 고품질의 3차원 데이터 취득을 위해 드론으로부터 문화재의 항공촬영데이터 획득에 필요한 사전조사(데이터 획득을 위한 대상물의 사전조사), 대상물의 촬영에 요구되는 장비 투입 및 촬영 방식 결정(드론 기종 및 촬영 계획수립), 본조사(드론을 이용한 기준점 측량 및 촬영)와 같은 사전의 구축 절차 들이 수행될 수 있고, 이뿐만 아니라 문화재의 지상촬영데이터 획득에 필요한 사전조사(지상사진데이터 획득을 위한 대상물의 사전조사), 대상물의 촬영에 요구되는 장비 투입 및 촬영방식 결정(DLSR 촬영계획 수립), 본조사 (지상카메라를 이용한 기준점 측량 및 촬영)와 같은 사전의 구축 절차들이 수행될 수 있다. 상기 드론의 기체 본체에는 문화재의 항공촬영을 위한 영상카메라가 장착되어 설치될 수 있다. 이렇 게 상기 드론의 기체 본체에 설치된 상기의 영상카메라를 통해 항공에서의 문화재에 대한 항공 영상 촬영이 수행될 수 있는 것이다. 물론, 지상에서는 지상카메라가 활용되는 방식으로 문화재에 대한 지상 영 상 촬영이 수행될 수 있는 것이다. 특히, 상기 지상카메라로 촬영되는 문화재의 대상물과 촬영된 지상데이터는 예컨대 도면 2에서와 같이 동 일한 거리에서 촬영을 실시하되, 점진적인 촬영거리를 확보하며 다른 방향에서 360°로 촬영하고 최소 70% 이상 의 중복 촬영 방식을 이용할 수 있다. 또한, 상기 드론을 이용한 문화재의 대상물 촬영은 3차원 DB 구축에 필요한 POI(Point of Interest) 촬영 기법에 착안하여 예컨대 도면 3에서와 같이 서로 다른 높이에서 촬영할 수 있으며 건물 외벽의 촬영은 포지션 이동을 통한 고중복 촬영 방식으로 실시할 수 있는 관계로 고품질의 포인트 클라우드 획득이 가능하다. 더욱이, 상기 드론을 이용한 문화재의 대상물 촬영시 3차원 DB 구축에 필요하도록 예컨대 도면 4에서와 같 이 건물의 모서리 부분은 3개의 벽면이 동시에 촬영될 수 있게 고중복 촬영 방식으로 실시할 수 있고, 실내 촬 영의 경우 벽에서 맞은편을 촬영하며 부피가 큰 객체물은 높이에 따른 촬영 박식으로 실시할 수 있다. 이처럼, 3차원 DB 구축의 필요에 따라 문화재의 대상물 촬영 중복도를 70% 이상으로 실시하고 폐쇄지역이 발생 되지 않도록 촬영하며, 싱글패스에 의한 촬영보다는 예컨대 도면 5에서와 같이 크로스패스 촬영 기법으로 종횡최소 80% 이상의 중복도를 유지하며 촬영을 실시할 수 있다. 물론, 이러한 상기의 항공데이터와 지상데이터는 후술되는 단계들을 거치는 과정에서 취득된 원시사진을 기반으 로 예컨대 특징점(key points) 및 영상정합(image matching), 광속조정(Bundle Adjustment), 포인트 클라우드 (Point Cloud), 와이어 프레임(Wire Frame), 텍스트화된 프레임(Textured Frame), 3D 모델(3D 모델) 순으로 처 리될 수 있다. 이렇게 드론으로부터 취득된 항공데이터와 지상카메라로부터 취득된 지상데이터는 도 면 6에서와 같이 병합될 수 있다. 취득 데이터를 기반으로 한 윤곽선의 처리단계 상기 단계에서는 상기의 드론으로부터 취득된 항공데이터와 지상카메라로부터 취득된 지상데이터 를 바탕으로 한 개체의 윤곽선을 인식하는 방식의 처리가 이루어지는 과정이다. 즉, 테스트베드로 선정된 문화재의 항공데이터와 지상데이터에 대한 정확도 검증과 개선은 객체인식알고리즘 을 통해 이루어질 수 있으며, 이러한 상기의 객체인식알고리즘은 테스트베드로 선정된 문화재의 항공 데이터와 지상데이터를 바탕으로 이미지의 객체를 윤곽선으로 인식하는 테스트 검증을 수행할 수 있다. 특히, 상기 객체인식알고리즘은 항공데이터와 지상데이터에 대해 모든 선이 아닌 물체를 구별해 주는 윤곽 선만을 인식하는 방식으로 처리할 수 있으며, 이는 도면 7을 참고할 수 있다. 물론, 상기 객체인식알고리즘 은 LSD, AFM, Wireframe, L-CNN, Ground Truth 등과 같은 다양하고도 고성능의 윤곽선을 인식하는 방식으 로 처리할 수도 있다. 이러한 다양한 윤곽선 인식의 처리에 있어 상기 객체인식알고리즘에는 다양한 threshold와 parameter와 같 은 기법들이 최적화된 상태로 적용될 수 있고, 최적화된 기법들을 통한 실제의 분류 선(line)들은 예컨대 LSD, AFM, Wireframe, L-CNN, Ground Truth 등과 같은 방식들로 처리될 수 있는 것이다. 예컨대 L-CNN에서는 필터를 이용한 컨볼루션(Convolution) 연산을 반복적으로 진행하며 이미지의 특징을 검출할 수 있고 그 구조는 예컨대 Convolution layer(특징추출; feature extractio), Pooling layer(특징추출; feature extraction), Fully-connected layer(분류; classification) 로 이루어질 수 있다. 물론 이러한 L-CNN 에서는 예컨대 필터(커널), 패딩, 스트라이드, Pooling, ReLu 활성화 함수, Drop-Out, Fully-Connected layer 등과 같은 처리 방식들로 수행될 수 있다. 특히, 상기의 객체인식알고리즘으로부터 인식 처리된 항공데이터와 지상데이터는 이미지 세그멘테이션 알 고리즘을 통해 카테고리별 세그메틱 라벨링 방식으로 처리 가공될 수 있으며, 이러한 카테고리별 세그메틱 라벨링 방식으로 처리는 도면 8을 참고할 수 있다. 이러한 상기의 이미지 세그멘테이션 알고리즘은 고성능 의 윤곽선 인식으로 처리된 항공데이터와 지상데이터를 바탕으로 예컨대 도면에서와 같이 입력(input)된 사진에 서 풀과 같은 노이즈를 제거하는 카테고리별 세그메틱 라벨링 방식으로 처리할 수 있다. 이렇게 입력(input)된 사진에서 세그메틱 라벨(Segmetic Labels) 처리 과정시에 예컨대 1(Person), 2(Purse), 3(Plants/Grass), 4(Sidewalk), 5(Building/Structures) 등으로 카테도리별 세그메틱 라벨링 처리될 수 있으며, 이때의 세그메틱 라벨링 처리시 색별로 식별될 수 있게 예컨대 1(Person)은 빨강색, 2(Purse)는 자주색, 3(Plants/Grass)은 초록색, 4(Sidewalk)는 회색, 5(Building/Structures)는 노랑색의 색상으로 뚜렷하 게 식별처리될 수 있다. 따라서, 이렇게 색상별로 식별 처리된 1(Person), 2(Purse), 3(Plants/Grass), 4(Sidewalk), 5(Building/Structures)들 중에서 예컨대 풀[3(Plants/Grass)]과 같은 노이즈가 용이하게 제거 처리될 수 있는 것이다. 더욱이, 이렇게 노이즈가 제거될 수 있는 항공데이터와 지상데이터에 대한 이미지 매칭의 검증은 이미지매칭알 고리즘을 통해 이루어질 수 있으며, 이러한 상기의 이미지매칭알고리즘은 테스트 검증된 항공데이터 와 지상데이터를 바탕으로 수학적 알고리즘이 적용된 SIFT와 AI 기법이 적용된 알고리즘의 성능을 비교하는 방 식으로 이미지 매칭 검증을 수행할 수 있다. 물론, 이러한 상기의 객체인식알고리즘 및 이미지매칭알고리즘은 인공지능서버에 설치되어 운용 될 수 있으며, 상기 이미지매칭알고리즘은 상기의 테이터들의 특징을 파악하여 각각의 장점을 조합하는 앙상블 기법의 매칭 방식으로 처리할 수 있으며, 이는 예컨대 도면 9에서와 같이 Image Couple, Non-rigid registration method, SIFT 와 같은 매칭력의 시각화 기법 방식으로 매칭시킬수도 있다. 더욱이, 이러한 상기의 이미지매칭알고리즘은 상기와 같은 기법들의 처리에 있어서 예컨대 도면 10에서와 같이 상기의 데이터들에 대한 인코더(encoder) 과정에서 콘불루션(convolution)과 풀링(Pooling) 처리가 이루어 질 수 있고, 압축 표현 레이어(compressed representation)을 거치며 디코더(decorder)되는 과정에서 transpose 함수의 콘불루션(convolution) 처리가 이루어질 수 있다."}
{"patent_id": "10-2020-0155299", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "인공지능을 활용한 3D 이미지 복원단계 상기 단계에서는 상기의 객체인식알고리즘으로부터 인식 처리되며 상기의 이미지매칭알고리즘으 로부터 매칭 처리된 항공데이터와 지상데이터를 기반으로 이미지 처리에 따른 3D 이미지를 복원하는 방식의 처 리가 이루어지는 과정이다. 즉, 항공데이터와 지상데이터의 이미지 처리에 따른 3D 이미지 복원은 상기의 인공지능서버에서 연동되는 3차원 복원 프로그램을 통해 이루어질 수 있으며, 이러한 상기의 3차원 복원 프로그램은 매칭 처리된 항공데이터와 지상데이터를 바탕으로 이미지를 3차원의 3D 이미지로 복원하는 처리 과정을 수행할 수 있다. 이러한 상기의 3차원 복원 프로그램은 문화재에 대한 3d 복원 알고리즘의 적용을 통한 테스트에서 GAN을 기반으로 한 2D 이미지 복원 알고리즘과 3D 알고리즘의 조합으로 예컨대 도면 11에서와 같이 3D 문화재를 실감 콘텐츠로 복원할 수 있다. 3D DB 활용 웹서비스 환경 구축단계 상기 단계에서는 상기 단계에서 복원된 3D 문화재를 웹사이트에서 시현하기에 적합한 웹사이트의 구조 적 환경 설계를 구축하는 과정으로, 예컨대 복원된 3D 문화재가 웹사이트상에서 호환될 수 있는 3D 뷰어 및 VR 과 AR 실감 콘텐츠형식으로 제작될 수 있다. 즉, Webgl를 활용하여 웹상에 생성된 캔버스 상에 3D 뷰어를 삽입하고 저용량 클라우드를 연결하면서 가상의 카 메라 생성에 따라 사용자의 입력을 통해 자유로운 시점을 제공할 수 있으며, 저용량 클라우드를 활용하여 주변 환경과 반응할 수 있는 실시간 합성되는 AR콘텐츠를 제작할 수 있고, ARcore를 활용한 안드로이드 환경에서도 구현 가능한데, 이는 웹서버에서 설치된 웹뷰어프로그램을 통해 시현될 수 있다. 물론, 상기 3D 뷰어 및 VR과 AR 콘텐츠들은 상기 웹사이트의 구조적 환경 설계에 적합한 디자인으로 제작될 수 있으며, CSS 및 HTML을 이용한 웹 퍼블리싱 형식으로 등록 게시될 수 있다. 따라서, 특정 문화재에 대한 3D 뷰어 및 VR과 AR 실감 콘텐츠는 웹사이트상에서 도면 12에서와 같이 구현될 수 있으며 들어가기(입장)를 통해 생성한 가상의 현실 체험이 가능할 수 있다. 더욱이, 이러한 상기의 웹사이트는 동시접속자수 요구사항에 부합한 웹서버의 환경 구축 및 검증을 통해 사용자들에게 제공될 수 있다. 이러한 상기의 3D 뷰어 및 VR과 AR 실감 콘텐츠는 상기 단계와 상기 단계 사이에는 호환성 3D 뷰어 제 작단계를 통해 이루어질 수 있으며, 물론, 상기의 저용량 클라우드는 상기 단계 와 상기 단계 사이 에서 수행될 수 있는 저용량 클라우드 생성 단계를 통해 이루어질 수도 있되, 경우에 따라 호환성 3D 뷰어 제작단계에서도 이루어질 수 있다. 물론, 이러한 저용량 클라우드 생성 단계에서의 저용량 클라우드 처 리와, 3D 뷰어 및 VR과 AR 실감 콘텐츠 제작은 후술되는 상세한 설명을 통해 참고할 수 있다."}
{"patent_id": "10-2020-0155299", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "상기의 저용량 클라우드 생성 단계는 상기 단계에서 취득된 항공데이터와 지상데이터를 삼차원 공간에 투영하여 3D 스캔데이터로부터 발생되는 에러나 불필요한 데이터를 정리하여 데이터를 최적화로 처리하는 과정 이다. 물론, 이러한 상기의 데이터 최적화 처리시에 수반되는 처리내용으로는 이미지의 왜곡 제거, 이미지의 매칭 및 삼차원 카메라 좌표 도출, 카메라 좌표 데이터 Export, 카메라 좌표 데이터 Import 및 이미지 연결, 축 정렬 및 작업뷰 생성, Mesh 생성, UV 생성, 맵핑, 텍스처 생성 및 압축 등이 있다. 물론, 이러한 테이터의 최적화 처리는 클라우드서버에서 이루어질 수 있으며, 예컨대 도면 13에서와 같이 이미지 투영 기법을 통한 최적의 텍스처 퀄리티를 산출할 수 있다. 즉, 저용량 클라우드 메쉬(Mesh) 생성시 발생되는 텍스처의 늘어남이나 겹침 현상을 개선하기 위하여 사용자의 선택에 따라 하나 혹은 그 이상의 원본이미지를 선택하고 투영하여 품질이 저하된 부분을 개선할 수 있는 것이다. 또한, 하나의 메쉬(Mesh)로 정합된 결과물은 예컨대 도면 14에서와 같이 저용량 클라우드로 생성될 수 있으며, 각각의 속성에 맞춰 단위 객체별로 사물이 객관화되며 저장될 수 있다. 상기 호환성 3D 뷰어 제작단계는 상기 단계에서 복원된 3D 문화재가 웹사이트에서 호환될 수 있게 시현 하기에 적합한 3D 뷰어 및 VR과 AR 실감 콘텐츠의 형식으로 제작될 수 있게 하는 과정으로서, 이러한 3D 뷰어 및 VR과 AR 실감 콘텐츠는 상기의 클라우드서버에 설치된 3D 편집툴을 통해 제작될 수 있다. 즉, 상기 3D 편집툴은 웹사이트상에 생성된 캔버스 상에 3D 뷰어를 삽입하고 상기의 저용량 클라우드를 연결하면서 가상의 카메라 생성에 따라 사용자의 입력을 통한 자유로운 시점을 제공할 수 있으며, 상기 저용량 클라우드를 활용한 주변 환경과 반응할 수 있는 실시간 합성되는 AR콘텐츠를 제작할 수 있다. 물론, 상기 3D 뷰어 및 VR과 AR 콘텐츠들은 상기 웹사이트의 구조적 환경 설계에 적합한 디자인으로 제작될 수 있으며, CSS 및 HTML을 이용한 웹 퍼블리싱 형식으로 등록게시될 수 있다. 이러한 상기 3D 편집툴은 커스터마이징이 용이한 콘텐츠도 제작 가능하며, 저용량 클라우드 외에 사용자 가 원하는 별도의 3D 모델을 업로드할 수 있어 예컨대 도면 15에서와 같이 보다 폭넓은 3D 콘텐츠를 제작할 수 있으며, 클라우드서버의 플랫폼과 연동될 수 있다. 한편, 본 발명의 일 실시예에 따른 데이터 결합을 통한 3차원 문화재의 데이터베이스 구축시스템은, 도 16에서 와 같이 문화재의 대상물을 항공에서 촬영하기 위한 영상카메라가 탑재된 드론 및 지상에서 촬영하기 위한 지상카메라와, 드론 및 지상카메라로부터 취득된 항공데이터와 지상데이터에 대한 이미지의 객체 인 식 처리가 이루어지는 인공지능서버와, 인공지능서버와 연동되며 상기의 데이터(항공데이터와 지상데이 터)의 이미지들을 3차원의 3D 이미지로 복원하는 처리하는 3차원 복원 프로그램과, 3차원으로 복원된 3D 문화재를 웹사이트상에서 시현 가능하면서도 호환 가능한 3차원 실감 콘텐츠 형식으로 제공하는웹서버를 포함하는 구성으로 이루어질 수 있다. 특히, 상기의 인공지능서버는 지상카메라로부터 취득된 항공데이터와 지상데이터에 대한 이미지의 객체 인 식 처리에 필요한 객체인식알고리즘, 객체 인식 처리된 항공데이터와 지상데이터에 대한 카테고리별 세그 메틱 라벨링 처리 가공에 필요한 이미지 세스멘테이션 알고리즘, 및 세그메틱 라벨링 처리된 항공데이터와 지상데이터에 대한 이미지 매칭 검증 처리에 필요한 이미지매칭알고리즘을 더 포함하는 구성일 수 있다. 그리고, 상기의 3차원 복원 프로그램은 상기 인공지능서버에서 연동되는 방식으로 데이터(항공데이터 와 지상데이터)의 이미지들을 3차원의 3D 이미지로 복원하는 처리할 수 있다. 클라우드서버는 복원된 3D 문화재가 웹사이트에서 호환되면서 시현 가능한 3D 뷰어 및 VR과 AR 실감 콘텐 츠를 제작할 수 있는 3D 편집툴을 더 포함하는 구성일 수 있다. 상술된 이와 같이, 드론으로부터 촬영된 문화재 대상물들에 대한 항공데이터들과 지상카메라로부터 촬영된 지상 데이터들의 결합 처리와 함께 항공데이터와 지상데이터에서 획득된 포인트 클라우드를 병합하여 하나의 3D 모델 로 결과물 산출이 가능하고, 이러한 3D 모델이 웹사이트상에서 시현되기 위한 구축 방식을 제공함에 따라, 시스 템의 효율적인 메모리 사용과 분산처리기술을 통한 테라바이트급의 영상처리 DB 보유뿐만 아니라, 고품질의 3차 원 문화재 공간정보 구축도 구현될 수 있는 것이다."}
{"patent_id": "10-2020-0155299", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 데이터 결합을 통한 3차원 문화재의 데이터베이스 구축방법에 대한 처리 순 서를 블록으로 도시한 도면이다. 도 2는 지상카메라를 이용한 대상물(문화재)의 촬영 방식을 일례의 개념으로 도시한 도면이다. 도 3은 드론를 이용한 대상물(문화재)의 촬영 방식을 일례의 개념으로 도시한 도면이다. 도 4는 드론를 이용한 대상물(문화재)의 촬영 방식을 다른 일례의 개념으로 도시한 도면이다. 도 5는 드론를 이용한 대상물(문화재)의 촬영 방식을 또 다른 일례의 개념으로 도시한 도면이다. 도 6은 드론으로부터 취득된 항공데이터와 지상카메라로부터 취득된 지상데이터의 병합 과정을 개념 적으로 도시한 도면이다. 도 7은 항공데이터와 지상데이터의 처리에 대한 객체인식알고리즘의 윤곽선 인식 처리 방식을 개념적으로 도시한 도면이다. 도 8은 객체인식알고리즘으로부터 인식 처리된 항공데이터와 지상데이터 처리에 대한 이미지 세그멘테이션 알고리즘의 카테고리별 세그메틱 라벨링 처리 방식을 개념적으로 도시한 도면이다. 도 9는 객체인식알고리즘으로부터 인식 처리된 항공데이터와 지상데이터의 처리에 대한 이미지매칭알고리 즘의 테이터 특징 파악에 따른 Image Couple, Non-rigid registration method, SIFT 와 같은 매칭 기법을 개념적으로 도시한 도면이다. 도 10은 항공데이터와 지상데이터의 처리에 대한 이미지매칭알고리즘의 인코더 및 디코더 처리 과정을 개 념적으로 도시한 도면이다. 도 11은 문화재의 항공데이터와 지상데이트를 기반으로 3차원 복원 프로그램을 통해 복원된 3D 문화재를 캡처한 도면이다.도 12는 웹서버에 설치된 웹뷰어프로그램을 통해 시현될 수 있는 3차원 실감 콘텐츠에 대한 가상 현 실 체험을 위해 들어가기(입장) 초기 화면을 캡처한 도면이다. 도 13은 클라우드서버에서 이루어지는 데이터의 최적화 처리에 대한 일례로서 이미지 투영 기법을 통한 최적의 텍스처 퀄리티를 산출하는 상태를 캡처한 도면이다. 도 14는 하나의 메쉬(Mesh)로 정합된 결과물이 저용량 클라우드의 방식으로 생성되며 각 속성에 맞춰 단위 객체 별 사물이 객체화되는 상태를 캡처한 도면이다. 도 15는 3D 편집툴을 통해 보다 폭넓은 3D 콘텐츠 제작이 수행되는 상태를 캡처한 도면이다. 도 16은 본 발명의 일 실시예에 따른 데이터 결합을 통한 3차원 문화재의 데이터베이스 구축시스템에 대한 구성"}
{"patent_id": "10-2020-0155299", "section": "도면", "subsection": "도면설명", "item": 2, "content": "을 간략한 블록으로 요약하여 도시한 도면이다."}
