{"patent_id": "10-2022-0148030", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0066802", "출원번호": "10-2022-0148030", "발명의 명칭": "신생항원 에피토프의 면역원성을 예측하는 방법 및 이를 이용한 장치", "출원인": "주식회사 제로믹스", "발명자": "조윤성"}}
{"patent_id": "10-2022-0148030", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "돌연변이 에피토프에 대한 생물학적 프로세스에 관여하는 요소와 에피토프의 특성 각각이 상기 돌연변이 에피토프의 면역원성에 영향을 주는 정도를 계산하는 단계;상기 돌연변이 에피토프에 대응하는 원시의 에피토프에 대한 생물학적 프로세스에 관여하는 요소와 에피토프의특성 각각이 상기 원시의 에피토프의 면역원성에 영향을 주는 정도를 계산하는 단계;상기 돌연변이 에피토프에 대해 계산한 값과 상기 원시의 에피토프에 대해 계산한 값을 기초로 differentialindex를 계산하는 단계;상기 돌연변이 에피토프에 대해 계산한 값과 상기 계산한 differential index를 이용해 사전에 학습된 인공 지능 모델에 입력하여, 상기 돌연변이 에피토프의 면역원성을 예측하는 단계;를 포함하는 돌연변이 에피토프의 면역원성을 예측하는 방법."}
{"patent_id": "10-2022-0148030", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 학습된 인공 지능 모델에 계산한 값을 입력하기 전, 상기 돌연변이 에피토프에 대해 계산한 값과 상기 계산한 differential index에 대해 표준화 및 정규화 중 적어도 하나를 수행하는 단계를 더 포함하는 돌연변이 에피토프의 면역원성을 예측하는 방법."}
{"patent_id": "10-2022-0148030", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 differential index는,상기 돌연변이 에피토프에 대해 계산한 값과 상기 원시의 에피토프에 대해 계산한 값의 비율(RATIO), 상기 돌연변이 에피토프에 대해 계산한 값과 상기 원시의 에피토프에 대해 계산한 값의 차이(DIFFERENCE) 중 적어도 하나를 포함하는, 돌연변이 에피토프의 면역원성을 예측하는 방법."}
{"patent_id": "10-2022-0148030", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 differential index는,인산화, 소수성, 알려진 에피토프와의 유사성, 자기-단백체와의 비유사성, 에피토프 안정도, 항원 처리, MHC I결합 친화도, pMHC 안정도, 면역, 염증 반응, B-세포 선형 에피토프, B-세포 형태 이상 에피토프 중 적어도 하나에 대한 differential index인, 돌연변이 에피토프의 면역원성을 예측하는 방법."}
{"patent_id": "10-2022-0148030", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 돌연변이 에피토프와 상기 원시의 에피토프에 대한 생물학적 프로세스에 관여하는 요소와에피토프의 특성 각각이 면역원성에 영향을 주는 정도를 계산하는 단계는,알고리즘, 프로그램, 또는 툴을 이용해 계산하는 단계인, 돌연변이 에피토프의 면역원성을 예측하는 방법."}
{"patent_id": "10-2022-0148030", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 생물학적 프로세스는,항원 처리 단계, 항원 제시 단계, 면역 단계, 및 종양 미세 환경으로 구성되고, 상기 종양 미세 환경에 관여하는 요소는 염증 반응, B-세포 선형 에피토프, B-세포 형태 이상 에피토프 중 적어도 하나인, 돌연변이 에피토프의 면역원성을 예측하는 방법."}
{"patent_id": "10-2022-0148030", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2024-0066802-3-제1항 내지 제6항 중 어느 한 항에 따른 방법을 실행하기 위한 컴퓨터 프로그램을 기록하는 컴퓨터 판독 가능한기록 매체."}
{"patent_id": "10-2022-0148030", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "돌연변이 에피토프를 입력받거나, 상기 돌연변이 에피토프의 면역원성을 예측한 결과를 출력하는 입출력 장치;돌연변이 에피토프와 원시의 에피토프에 대한 생물학적 프로세스에 관여하는 요소와 에피토프의 특성을 기초로계산된 differential index와 돌연변이 에피토프에 대해 생물학적 프로세스에 관여하는 요소와 에피토프의 특성을 기초로 계산된 값을 이용하여 돌연변이 에피토프의 면역원성 예측하도록 학습된 인공 지능 모델을 저장하는저장 장치; 및돌연변이 에피토프에 대한 생물학적 프로세스에 관여하는 요소와 에피토프의 특성 각각이 상기 돌연변이 에피토프의 면역원성에 영향을 주는 정도를 계산하고, 상기 돌연변이 에피토프에 대응하는 원시의 에피토프에 대한 생물학적 프로세스에 관여하는 요소와 에피토프의 특성 각각이 상기 원시의 에피토프의 면역원성에 영향을 주는정도를 계산하고, 상기 돌연변이 에피토프에 대해 계산한 값과 상기 원시의 에피토프에 대해 계산한 값을 기초로 differential index를 계산하고, 상기 돌연변이 에피토프에 대해 계산한 값과 상기 계산한 differentialindex를 이용해 사전에 학습된 인공 지능 모델에 입력하여, 상기 돌연변이 에피토프의 면역원성을 예측하는 연산 장치를 포함하는, 돌연변이 에피토프의 면역원성을 예측하는 장치."}
{"patent_id": "10-2022-0148030", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 신생항원 에피토프의 면역원성을 예측하는 방법 및 이를 이용한 장치에 관한 것으로, 본 발명에 따른 돌연변이 에피토프의 면역원성을 예측하는 방법은 돌연변이 에피토프에 대한 생물학적 프로세스에 관여하는 요소 와 에피토프의 특성 각각이 상기 돌연변이 에피토프의 면역원성에 영향을 주는 정도를 계산하는 단계, 상기 돌연 변이 에피토프에 대응하는 원시의 에피토프에 대한 생물학적 프로세스에 관여하는 요소와 에피토프의 특성 각각 이 상기 원시의 에피토프의 면역원성에 영향을 주는 정도를 계산하는 단계, 상기 돌연변이 에피토프에 대해 계산 한 값과 상기 원시의 에피토프에 대해 계산한 값을 기초로 differential index를 계산하는 단계, 상기 돌연변이 에피토프에 대해 계산한 값과 상기 계산한 differential index를 이용해 사전에 학습된 인공 지능 모델에 입력하 여, 상기 돌연변이 에피토프의 면역원성을 예측하는 단계를 포함할 수 있다."}
{"patent_id": "10-2022-0148030", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 신생항원 에피토프의 면역원성을 예측하는 방법 및 이를 이용한 장치에 관한 것으로, 보다 구체적으 로는 돌연변이가 발생한 신생항원 에피토프와 원시의 에피토프를 비교하여 신생항원 에피토프의 면역원성을 예 측하는 방법 및 이를 이용한 장치에 관한 것이다."}
{"patent_id": "10-2022-0148030", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "신생항원(neoantigen)은 돌연변이(mutation)가 일어난 항원(antigen)으로, 종양(tumor) 세포/조직(tissue)에서 발현되고, 정상 세포에서는 발현되지 않는 특징을 갖는다. 돌연변이에 의해 정상 서열이 변형되면, 면역 세포는 변형된 서열을 새로운 항원/에피토프로 인식해 면역반응을 일으킨다. 이러한 신생항원은 치료용 백신으로 활용 되고 있으며, 면역치료 및 반응성 예측 등에 사용되고 있다. MHC 결합 친화성(MHC binding affinity), 프로테아 좀 분절(proteasomal cleavage), TAP 수송체 효율(TAP transporter efficiency), pMHC 안정도(pMHC stability), T-세포 수용체 상호작용(T-cell receptor interaction) 등 다수의 생물학적 프로세스에 관여하는 여러가지 요소 및 소수성(hydrophobicity), 알려진 에피토프와의 유사성(similarity to known epitopes), 자기 -단백체와의 비유사성(dissimilarity to self-proteome) 등 신생항원 에피토프가 가지는 특성들은 인실리코(in silico) 방식으로 CD8+ T-세포 면역원성(immunogenicity)을 보이는 신생항원 에피토프를 예측하는데 영향을 미 칠 수 있다. 이에 돌연변이에 의해 발생되는 생물학적 프로세스에 관여하는 여러가지 요소 및/또는 신생항원 에 피토프의 특성을 이용해 신생항원 에피토프의 면역원성을 예측했다."}
{"patent_id": "10-2022-0148030", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "현재까지 다수의 생물학적 프로세스에 관여하는 여러가지 요소 및/또는 에피토프 특성 각각을 개별적으로 이용 하거나, 소수개의 요소 및/또는 특성을 결합하여 면역 반응을 유발하는 에피토프를 예측하는 방법이 개발되어 왔다. DAI(differential agretopicity index, 이하 DAI)도 에피토프의 면역원성을 예측하기 위해 이용된 요소 중 하나이다. DAI는 돌연변이 에피토프(또는, '펩티드'로 칭해질 수 있다.)의 MHC 친화성과 돌연변이 되지 않은 원시의(non- mutated or wild-type) 에피토프의 MHC 친화성의 비율(ratio)로 정의된다. 돌연변이 에피토프(neoepitope or mutant epitope)의 MHC 친화성만을 이용해 면역원성을 예측하기보다는 DAI를 이용해 면역원성을 예측하는 것이 더 효과적일 수 있다. 그 이유는, 돌연변이 에피토프가 MHC 결합 친화도 등 특정 요소가 선호된다고 해서 모두 면역원성을 보이는 것은 아니다. 원시의 에피토프 자체가 원래 MHC 결합이 잘 되는 성향을 가졌다고 하더라도,면역 시스템의 음성 선택(negative selection)/중심 관용(central tolerance) 과정 등을 통해 자기 에피토프에 대해 면역반응을 일으키지 않도록, 즉 정상 세포들이 면역 세포에 의해 공격당하지 않도록 작용할 수 있다. 따 라서, 정상인 원시의 에피토프 대비 돌연변이에 의해 특성이 어떻게 변화된 것인지 그 변화의 차이를 측정하는 것이 에피토프의 면역원성을 예측하는데 매우 중요할 수 있다. 돌연변이 에피토프와 원시의 에피토프의 차이는 결합 친화도에만 영향을 미치는 것이 아니라, 에피토프가 면역 반응을 일으키는데까지 관여하는 다양한 생물학적 프로세스에 영향을 미칠 수 있다. 예를 들어, 원시의 에피토 프와 돌연변이 에피토프의 MHC 결합 친화도는 유사한 반면, 돌연변이에 의해 프로테아좀 분절, TAP 수송체 효율, pMHC 안정도, T-세포 수용체 상호작용 등의 효율/반응 등이 달라질 수 있다. 이에, 본 발명에서는 다수의 생물학적 프로세스 및 에피토프/네오에피토프 특성에 대해 differential index(즉, 돌연변이 에피토프와 원시의 에피토프의 측정값의 비율 혹은 차이)를 이용하여 돌연변이 에피토프의 면역원성을 예측하는 방법 및 이를 이용하는 장치에 대해 제안한다."}
{"patent_id": "10-2022-0148030", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 따른 돌연변이 에피토프의 면역원성을 예측하는 방법은 돌연변이 에피토프에 대한 생물학적 프로세스 에 관여하는 요소와 에피토프의 특성 각각이 상기 돌연변이 에피토프의 면역원성에 영향을 주는 정도를 계산하 는 단계, 상기 돌연변이 에피토프에 대응하는 원시의 에피토프에 대한 생물학적 프로세스에 관여하는 요소와 에 피토프의 특성 각각이 상기 원시의 에피토프의 면역원성에 영향을 주는 정도를 계산하는 단계, 상기 돌연변이 에피토프에 대해 계산한 값과 상기 원시의 에피토프에 대해 계산한 값을 기초로 differential index를 계산하는 단계, 상기 돌연변이 에피토프에 대해 계산한 값과 상기 계산한 differential index를 이용해 사전에 학습된 인 공 지능 모델에 입력하여, 상기 돌연변이 에피토프의 면역원성을 예측하는 단계를 포함할 수 있다. 본 발명에 따른 돌연변이 에피토프의 면역원성을 예측하는 방법은 상기 학습된 인공 지능 모델에 계산한 값을 입력하기 전, 상기 돌연변이 에피토프에 대해 계산한 값과 상기 계산한 differential index에 대해 표준화 및 정규화 중 적어도 하나를 수행하는 단계를 더 포함할 수 있다. 본 발명에 따른 돌연변이 에피토프의 면역원성을 예측하는 방법에서 상기 differential index는, 상기 돌연변이 에피토프에 대해 계산한 값과 상기 원시의 에피토프에 대해 계산한 값의 비율(RATIO), 상기 돌연변이 에피토프 에 대해 계산한 값과 상기 원시의 에피토프에 대해 계산한 값의 차이(DIFFERENCE) 중 적어도 하나를 포함할 수 있다. 본 발명에 따른 돌연변이 에피토프의 면역원성을 예측하는 방법에서 상기 differential index는, 인산화, 소수 성, 알려진 에피토프와의 유사성, 자기-단백체와의 비유사성, 에피토프 안정도, 항원 처리, MHC I 결합 친화도, pMHC 안정도, 면역, 염증 반응, B-세포 선형 에피토프, B-세포 형태 이상 에피토프 중 적어도 하나에 대한 differential index일 수 있다. 본 발명에 따른 돌연변이 에피토프의 면역원성을 예측하는 방법에서 상기 돌연변이 에피토프와 상기 원시의 에 피토프에 대한 생물학적 프로세스에 관여하는 요소와 에피토프의 특성 각각이 면역원성에 영향을 주는 정도를 계산하는 단계는, 알고리즘, 프로그램, 또는 툴을 이용해 계산하는 단계일 수 있다. 본 발명에 따른 돌연변이 에피토프의 면역원성을 예측하는 방법에서 상기 생물학적 프로세스는, 항원 처리 단계, 항원 제시 단계, 면역 단계, 및 종양 미세 환경으로 구성되고, 상기 종양 미세 환경에 관여하는 요소는 염증 반응, B-세포 선형 에피토프, B-세포 형태 이상 에피토프 중 적어도 하나일 수 있다. 본 발명에 따른 돌연변이 에피토프의 면역원성을 예측하는 컴퓨터 판독 가능한 기록 매체는 앞서 설명한 방법 중 적어도 하나를 실행하기 위한 컴퓨터 프로그램을 기록한 것일 수 있다. 본 발명에 따른 돌연변이 에피토프의 면역원성을 예측하는 장치는, 돌연변이 에피토프를 입력받거나, 상기 돌연 변이 에피토프의 면역원성을 예측한 결과를 출력하는 입출력 장치, 돌연변이 에피토프와 원시의 에피토프에 대 한 생물학적 프로세스에 관여하는 요소와 에피토프의 특성을 기초로 계산된 differential index와 돌연변이 에 피토프에 대해 생물학적 프로세스에 관여하는 요소와 에피토프의 특성을 기초로 계산된 값을 이용하여 돌연변이 에피토프의 면역원성 예측하도록 학습된 인공 지능 모델을 저장하는 저장 장치, 및 돌연변이 에피토프에 대한 생물학적 프로세스에 관여하는 요소와 에피토프의 특성 각각이 상기 돌연변이 에피토프의 면역원성에 영향을 주 는 정도를 계산하고, 상기 돌연변이 에피토프에 대응하는 원시의 에피토프에 대한 생물학적 프로세스에 관여하 는 요소와 에피토프의 특성 각각이 상기 원시의 에피토프의 면역원성에 영향을 주는 정도를 계산하고, 상기 돌연변이 에피토프에 대해 계산한 값과 상기 원시의 에피토프에 대해 계산한 값을 기초로 differential index를 계산하고, 상기 돌연변이 에피토프에 대해 계산한 값과 상기 계산한 differential index를 이용해 사전에 학습 된 인공 지능 모델에 입력하여, 상기 돌연변이 에피토프의 면역원성을 예측하는 연산 장치를 포함할 수 있다."}
{"patent_id": "10-2022-0148030", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 돌연변이에 의해 발생하는 다수의 생물학적 프로세스와 에피토프/네오에피토프 특성을 다양 한 측면을 고려할 수 있어 돌연변이 에피토프만을 단독으로 사용하여 면역원성을 예측했을 때보다 더 높은 정확 도로 돌연변이 에피토프의 면역원성을 예측할 수 있다. 높은 정확도로 예측된 면역원성 에피토프는 신생항원 기 반의 백신 개발시 더 높은 효용성과 낮은 부작용 등을 기대할 수 있다."}
{"patent_id": "10-2022-0148030", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 실시예는 오로지 본 발명을 보다 구체적으로 설명하기 위한 것으로서, 본 발명의 요지에 따라 본 발명의"}
{"patent_id": "10-2022-0148030", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "범위가 이들 실시예에 의해 제한되지 않는다는 것은 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 있어서 자명할 것이다. 이하 설명하는 기술의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 본 명세서에서 사용되는 용어에서 단수의 표현은 문맥상 명백하게 다르게 해석되지 않는 한 복수의 표현을 포함 하는 것으로 이해되어야 하고, &quot;포함한다&quot; 등의 용어는 설명된 특징, 개수, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것이 존재함을 의미하는 것이지, 하나 또는 그 이상의 다른 특징들이나 개수, 단계 동작 구성요소, 부분품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 배제하지 않는 것으로 이해되어야 한다. 및/또는 이라는 용어는 복수의 관련된 기재된 항목들의 조합 또는 복수의 관련된 기재된 항목들 중의 어 느 항목을 포함한다. 방법 또는 동작 방법을 수행함에 있어서, 상기 방법을 이루는 각 과정/단계들은 문맥상 명백하게 특정 순서를 기재하지 않은 이상 명기된 순서와 다르게 일어날 수 있다. 즉, 각 과정/단계들은 명기된 순서와 동일하게 일어 날 수도 있고 실질적으로 동시에 수행될 수도 있으며 반대의 순서대로 수행될 수도 있다. 도 1은 종양 세포의 생물학적 프로세스의 일 예를 나타낸 것이다. 도 1을 참조하면, 종양 세포의 생물학적 프로세스는 항원 처리(antigen processing) 단계, 항원 제시(antigen presentation) 단계, 및 면역원성(Immunogenicity) 단계로 구성될 수 있다. 종양 세포를 둘러싼 종양 미세 환경 (tumor microenvironment, TME)도 생물학적 프로세스에 영향을 미칠 수 있어 종양 세포의 생물학적 프로세스의 일부로 볼 수 있다. 종양 세포의 생물학적 프로세스는 일반 세포의 생물학적 프로세스와 동일 또는 유사하나, 각 단계에서 다양한 요소들이 에피토프 생성 및/또는 특성에 영향을 미칠 수 있다. 항원 처리 단계는 종양 세포의 핵 내의 DNA가 mRNA가 전사되어 세포질로 나오면, 전사된 mRNA가 펩티드로 변형 되어 MHC 클래스 I 과 결합하는 단계이다. 종양 세포의 DNA는 돌연변이 등의 원인으로 변형된 상태일 수 있다. mRNA는 번역되어 단백질로 합성된 후, 프로테아좀에 의해 펩티드로 분절될 수 있다. 분절된 펩티드는 TAP 수송 체에 의해 조면소포체 내부로 수송되어 MHC 클래스 I 과 결합한다. 항원 제시 단계는 항원 처리 단계에서 생성된 펩티드가 MHC 클래스 I 과 결합하여 펩티드-MHC 복합체로서 세포 표면에 제시되는 단계이다. 면역원성 단계는 세포 표면에 제시된 펩티드-MHC 복합체가 T 세포에 의해 인지되는 단계이다. 종양 미세 환경(TME)은 세포를 둘러싼 환경으로, 세포는 혈관, 면역 세포, 섬유아세포, 골수 유래 염증 세포, 림프구, 신호 전달 분자, 및 세포외 기질 등에 의해 둘러싸일 수 있다. 종양 세포는 세포외 신호 방출, 종양 세 포 신생혈관 촉진, 및 말초 면역 관용 등을 유도하여 종양 미세 환경에 영향을 줄 수 있고, 종양 미세 환경도 종양 세포의 성장 또는/및 전이에 영향을 줄 수 있다. 예를 들어, 면역 반응을 유도하는 질환이 암인 경우, 시 료의 클론성이 에피토프의 면역원성에 영향을 줄 수 있으며, 면역 세포의 분포/비율, 종양 침윤 림프구(tumor infiltrating lymphocyte), RNA 발현(expression) 등도 생성되는 에피토프의 면역원성에 영향을 줄 수 있다. 도 2는 에피토프의 면역원성에 영향을 미칠 수 있는 다수의 생물학적 프로세스의 요소 및 에피토프 특성을 나타 낸 것이다. 에피토프의 면역원성에는 도 1에서 설명한 생물학적 프로세스 외에 에피토프의 특성(properties)도 영향을 줄 수 있다. 예를 들어, 에피토프의 독성(toxicity) 및 알러지원성(allegenicity) 등 인체에 미치는 부정적인 요소 들은 에피토프의 면역원성에 영향을 줄 수 있다. 에피토프의 면역원성에 영향을 미치는 요소들은 한 번에 하나 씩 영향을 미칠 수도 있지만 여러가지가 동시에 또는/및 순차적으로 영향을 미칠 수도 있다. 이하에서는 에피토프 특성 및 생물학적 프로세스에서 에피토프의 면역원성에 영향을 줄 수 있는 여러가지 요소 들에 대해 자세히 설명한다. 에피토프 특성 중 면역원성에 영향을 줄 수 있는 요소로는 돌연변이에 의한 기능적 영향(functional impact by mutations), 인산화(phosphorylation, PTM), 소수성(hydrophobicity or physicochemical hydrophobicity), 알 려진 에피토프와의 유사성(Similarity to known epitopes), 사람을 참조로 한 자기-단백체와의 비유사성 (Dissimilarity to self (human reference)-proteome), 펩티드 안정성(Peptide stability) 등이 있다. 이하에서는 각 요소가 에피토프의 면역원성에 영향을 주는 정도를 확인하기 위해 특정 프로그램/알고리즘/툴 등 을 예로 설명하나, 이에 한정되는 것은 아니다. 돌연변이에 의한 기능적 영향은 종양의 원인이 되는 체세포 돌연변이에 의해 단백질의 기능에 미치는 영향을 나 타내는 요소이다. 기능적 영향이 큰 돌연변이를 포함한 에피토프는 기존 면역 세포에 의해 자연스럽게 제거되나, 기능적 영향이 상대적으로 적은 돌연변이를 포함한 에피토프는 더 높은 빈도로 면역원성을 보일 수 있다. 돌연변이에 의한 기능적 영향이 에피토프의 면역원성에 영향을 주는 정도를 확인하기 위해 예를 들어, PROVEAN 또는/및 PolyPhen-2라는 프로그램을 이용할 수 있다. 인산화는 면역원성을 예측하려는 에피토프의 MHC 클래스 I 리간드가 인산화된 정도를 나타내는 요소이다. 인산 화가 에피토프의 면역원성에 영향을 주는 정도를 확인하기 위해 예를 들어, NetMHCphosPan 프로그램을 이용할 수 있다. 소수성은 면역원성을 예측하려는 에피토프가 소수성인지를 나타내는 요소이다. 소수성이 에피토프의 면역원성에 영향을 주는 정도를 확인하기 위해 ProtFP라는 프로그램을 이용할 수 있다. 알려진 에피토프와의 유사성은 면역원성을 예측하려는 에피토프와 면역원성(또는 비면역원성)으로 알려진 에피 토프와 유사한지를 나타내는 요소이다. 알려진 에피토프와의 유사성이 에피토프의 면역원성에 영향을 주는 정도 를 확인하기 위해 예를 들어, blastP 프로그램을 이용할 수 있다. 사람을 참조로 한 자기-단백체와의 비유사성은 면역원성을 예측하려는 에피토프가 자기-단백체와의 비유사한지 를 나타내는 요소이다. 여기서 자기-단백체는 사람을 참조로 한 자기-단백체일 수 있다. 사람을 참조로 한 자기 -단백체와의 비유사성이 에피토프의 면역원성에 영향을 주는 정도를 확인하기 위해 예를 들어, 파이썬 바이오 패키지(Python Bio package)의 pairwise2 모듈을 이용할 수 있다. 에피토프 안정성(또는 펩티드 안정성)은 에피토프 자체의 안정성을 나타내는 요소이다. 기존에는 펩티드-MHC의 결합 안정성이 사용되고 있었으나, 에피토프 자체의 안정성이 사용되지는 않았다. 에피토프의 안정성이 낮을 경 우, MHC 분자에 결합/상호 작용할 기회가 줄어들어 면역원성을 가질 가능성이 낮을 수 있다. 에피토프 안정성이 에피토프의 면역원성에 영향을 주는 정도를 확인하기 위해 예를 들어, ProtParam을 이용할 수 있다.생물학적 프로세스 중 항원 처리 단계에서는 프로테아좀 분절(Proteasomal cleavage) 및/또는 TAP 수송체 효율 (TAP transporter efficiency)을 에피토프의 면역원성을 예측하는데 이용할 수 있다. 프로테아좀 분절과 TAP 수 송체 효율이 에피토프의 면역원성에 영향을 주는 정도를 확인하기 위해 예를 들어, NetCTLpan 프로그램을 이용 할 수 있다. 생물학적 프로세스 중 항원 제시 단계에서는 MHC I 결합 친화도 및/또는 pMHC 안정도 중 적어도 일부가 면역 반 응을 일으키는 에피토프를 예측하는데 이용될 수 있다. MHC 클래스 I 결합 친화도는 면역원성을 예측하려는 에피토프가 MHC 클래스 I와 결합하려는 정도를 나타내는 요 소이다. MHC 클래스 I 결합 친화도가 에피토프의 면역원성에 영향을 주는 정도를 확인하기 위해 예를 들어, 프 로그램 NetMHCpan 또는/및 MHCflurry을 이용할 수 있다. pMHC 안정도는 에피토프의 펩티드-MHC 안정도를 나타내는 요소이다. pMHC 안정도가 에피토프의 면역원성에 영향 을 주는 정도를 확인하기 위해 예를 들어, NetMHCstabpan 프로그램을 이용할 수 있다. 생물학적 프로세스 중 면역원성 단계에서는 면역원성이 면역 반응을 일으키는 에피토프를 예측하는데 이용될 수 있다. 면역원성이 에피토프의 면역원성에 영향을 주는 정도를 확인하기 위해 예를 들어, IEDB, PRIME, DeepHLApan, DeepImmuno 중 적어도 하나를 이용할 수 있다. 종양 미세 환경에서는 염증 반응(inflammatory response), B-세포 선형(linear) 에피토프, B-세포 형태 이상 (conformational) 에피토프 중 적어도 하나가 면역 반응을 유발하는 에피토프를 예측하는 요소로 고려될 수 있 다. 면역 세포는 사이토카인(cytokine) 등 염증 물질을 분비해 면역 반응을 조절할 수 있다. 에피토프가 이러한 사 이토카인을 유도할 수 있는 성질을 계산해, 에피토프가 사이토카인을 과다하게/과소하게 유도할 경우, 면역 반 응이 억제될 수 있다. 염증 반응이 에피토프의 면역원성에 영향을 주는 정도를 확인하기 위해 예를 들어, PIP- EL, AIPpred, IFNepitope 중 적어도 하나를 이용할 수 있다. 종양의 원인이 되는 체세포 돌연변이(somatic mutation)는 B-세포에 의해 인식될 수 있다. B-세포는 펩티드 형 태의 선형 에피토프와 단백질 구조적인 형태 이상 에피토프를 모두 인식할 수 있다. B-세포 선형 에피토프는 선 형 에피토프 가능성을 나타낸 요소이고, B-세포 형태 이상 에피토프는 형태 이상 에피토프 가능성을 나타낸 요 소이다. B-세포 선형 에피토프가 에피토프의 면역원성에 영향을 주는 정도를 확인하기 위해 예를 들어, Bepipred 프로그램을 이용할 수 있고, B-세포 형태 이상 에피토프가 에피토프의 면역원성에 영향을 주는 정도를 확인하기 위해 예를 들어, Discotope를 이용할 수 있다. 도 3은 인공 지능 모델을 이용해 돌연변이 에피토프의 면역원성을 학습하는 과정의 일 예를 나타낸 것이다. 신생항원의 CD8+ T-세포 면역원성을 학습하고 평가하기 위해, 면역원성 돌연변이 에피토프와 비면역원성 돌연변 이 에피토프가 이용될 수 있다. 면역원성 돌연변이 에피토프와 비면역원성 돌연변이 에피토프는 기 공개된 데이 터 및/또는 자체 보유/생산한 데이터일 수 있다. 기 공개된 데이터는 대표적으로, dbPepNeo, NEPdb 등을 이용해 획득할 수 있으며, 돌연변이 에피토프와 원시의 에피토프의 차이(differential index)를 계산해야 하기 때문에, 데이터는 종양 신생항원 에피토프로 한정하여 수집할 수 있다. 즉, 돌연변이 에피토프와 원시의 에피토프의 정 보를 직간접적으로 추출할 수 없는 병원체(pathogen) 유래 에피토프는 differential index를 계산할 수 없기 때 문에 제외할 수 있다. 돌연변이 에피토프의 면역원성에 영향을 미치는 다수의 생물학적 프로세스에 관여하는 요소 및 돌연변이 에피토 프의 특성 등은 크게 돌연변이 에피토프의 특성, 항원 처리, 항원 제시, 면역(또는 T-세포 인식), 종양 미세 환 경(TME) 등이 있으며, 자세하게는 돌연변이에 의한 기능적 영향, PTM(인산화 반응, 유비퀴틴화, 글리코실화반응 등), 알려진 에피토프와 유사한 서열, 자기-단백체와의 비유사성, 에피토프(펩티드) 안정도, 프로테아좀 분절, TAP 수송체 효율, MHC 클래스 I/II 결합 친화도, pMHC 안정도, 면역(T-세포 수용체 인식), 염증 반응, B-세포 선형 에피토프, B-세포 형태 이상 에피토프 등이 있다. 만약, 다루려는 질환이 암인 경우, 시료의 클론성 (clonality)이 더 포함될 수 있으며, 염증 외의 TME 요소(면역세포의 분포/비율, 종양 침윤성 림프구, RNA 발현 등)도 더 포함될 수 있다. 또한, 에피토프의 독성(toxicity) 및/또는 알러지원성(allegenicity) 등 인체에 미치 는 부정적인 요소들도 더 포함될 수 있다. 일 실시예에 따르면, 다수의 생물학적 프로세스 및 에피토프 특성들 중에 부분적으로 선택되어 활용되어 질 수 있다.돌연변이 에피토프의 면역원성에 관여하는 상세 요소들 중, differential index를 계산할 수 있는 요소는 인산 화, 소수성, 알려진 에피토프와의 유사성, 자기-단백체와의 비유사성, 에피토프 안정도, 항원 처리, MHC I 결합 친화도, pMHC 안정도, 면역, 염증 반응, B-세포 선형 에피토프, B-세포 형태 이상 에피토프 중 적어도 하나일 수 있다. 돌연변이에 의한 기능적 영향은 differential index를 계산할 수 있는 요소에서 제외되는데 그 이유는 돌연변이에 의한 기능적 영향을 측정한 값 자체가 원시의 에피토프 대비 돌연변이 에피토프가 단백질에 미치는 영향을 측정하고 있기 때문이다. 일 실시예에 따르면, 항원 처리는 하나의 요소가 될 수도 있지만, 프로테아좀 분절과 TAP 수송체 효율 두 개의 요소로 나뉠 수도 있다. 학습은 모든 요소를 동시에 통합하여 수행될 수도 있지만 각 요소별로 따로 학습될 수도 있다. 예를 들어, 모든 요소가 매칭된 데이터가 부족한 경우, 데이터가 존재하는 요소에 대해서만 학습이 수행될 수도 있다. 학습에 입 력될 데이터는 각 요소를 프로그램/알고리즘/툴을 이용해 측정한 값이 될 수 있다. 프로그램/알고리즘/툴은 도 2에서 설명한 것 중 적어도 하나일 수 있고, 또는 별도로 개발된 것일 수도 있다. 만약, 복수의 프로그램/알고 리즘/툴로 하나의 요소를 측정하는 경우에는 각각을 입력으로 할 수도 있다. 또 다른 예에서는 하나의 프로그램 /알고리즘/툴로 복수의 요소를 측정하여 입력할 수도 있다. 학습에 이용할 면역원성/비면역원성 에피토프는 돌연변이 에피토프와 원시의 에피토프 쌍으로 구성되어 있으며, 수집 또는 개발한 알고리즘/툴을 활용하여 각 요소별 돌연변이 에피토프와 원시의 에피토프에 대해 도출한 값을 이용하여 돌연변이 에피토프의 면역원성을 예측할 수 있다. 본 발명에서는, 각 요소에 대한 돌연변이 에피토프와 원시의 에피토프의 differential index를 RATIO(비율), DIFFERENCE(차이)로 계산하여 학습에 입력으로 할 수 있으며, 하나를 이용하거나 두가지를 모두 이용할 수 있다. 아래의 [수학식 1]과 [수학식 2]는 RATIO와 DIFFERENCE를 수식으로 나타낸 것이다. [수학식 1]"}
{"patent_id": "10-2022-0148030", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "[수학식 2] DIFFERENCE = 돌연변이 에피토프에 대해 프로그램/알고리즘/툴로 측정한 값 - 원시의 에피토프에 대해 프로그램 /알고리즘/툴로 측정한 값 다른 실시예에서는, [수학식 1]과 [수학식 2] 외에 기본 수식의 파생형인 LOG를 적용한 값을 이용할 수도 있다. 돌연변이 에피토프의 면역원성에 영향을 미치는 다수의 생물학적 프로세스에 관여하는 여러가지 요소 및 돌연변 이 에피토프의 특성 등에 대한 differential index는 아래와 같이 명명할 수 있으나, 이에 제한되는 것은 아니 다. - Phosphorylation (one of PTM)(인산화) : Differential phosphorylation index (DPI) - Hydrophobicity(소수성) : Differential hydrophobicity index (DHI) - Similarity to known epitopes(알려진 에피토프와의 유사성) : Differential sequence similarity index (DSSI) - Dissimilarity to self-proteome(자기-단백체와의 비유사성) : Differential dissimilarity index (DDI) - Peptide (epitope) stability(에피토프 안정도) : Differential peptide stability index (DPSI) - Proteasomal cleavage(프로테아좀 분절) : Differential cleavage index (DCI) - TAP transport efficiency(TAP 수송체 효율) : Differential TAP index (DTI) - Antigen processing(항원 처리) : Differential antigen processing index (DAPI) - MHC I binding affinity(MHC I 결합 친화도) : Differential agretopicity index (DAI) - pMHC stability(pMHC 안정도) : Differential stability index (DSI) - Immunogenicity(T-cell receptor interaction)(면역) : Differential immunogenicity index (DII) - Inflammatory response(염증 반응) : Differential inflammatory response index (DIRI) - B-cell linear epitope(B-세포 선형 에피토프) : Differential B-cell linear epitope index (DBLI) - B-cell conformationl epitope(B-세포 형태 이상 에피토프) : Differential B-cell conformationl epitope index (DBCI) 돌연변이 에피토프에 대해 프로그램/알고리즘/툴을 이용하여 다양한 생물학적 프로세스에 관여하는 요소 및 에 피토프의 특성을 측정한 값, [수학식 1] 및 [수학식 2]로 계산된 값 중 통계적으로 유의한 요소들을 선별하고 인코딩하여 기계 학습 또는 통계 방식으로 학습시킨다. 인코딩 전에 각 요소들, [수학식 1] 및 [수학식 2]로 계 산된 값에 대해 표준화(standardization) 및/또는 정규화(normalization)를 수행할 수 있다. 프로그램/알고리즘 /툴을 이용해 도출한 값은 각 요소들 또는 적용한 프로그램/알고리즘/툴에 따라 값의 범위나 분해능 (resolution)이 다를 수 있어 표준화 또는/및 정규화하여 이용할 수 있다. 각 요소들에 대한 RATIO 및/또는 DIFFERENCE는 모두 또는 통계 평가를 통해 부분적으로 선택되어 활용될 수 있 다. 예를 들어, 모든 요소들에 대한 RATIO와 DIFFERENCE를 동시에 사용하여 학습할 수도 있고, 또는/및 그 중 통계적 유의성을 검토/평가하여, 부분적으로 유의한 값들만 사용하여 학습할 수도 있다. 일 실시예에 따르면, 프로그램/알고리즘/툴 또는/및 개별 요소를 가감하는 것은 대상으로 하는 질환에 따라 달라질 수 있다. 예를 들 어, 암 종에 따라 서로 다른 요소 및/또는 프로그램/알고리즘/툴의 조합을 형성할 수 있다. 학습에 이용될 수 있는 인공 지능 모델은 neural network나 deep learning, logistic regression, AdaBoost, LogitBoost, XgBoost, Support vector machine, random forest 등이 활용될 수 있으며, 특정 기계 학습 알고리 즘이나 통계 방법으로 한정하지 않는다. 또한, 여러 기계 학습 알고리즘이나 통계 방법으로 통합하는 앙상블 기 계 학습 방식(e.g., bagging, stacking, voting, boosting 등)도 활용될 수 있다. 이렇게 기계 학습 방식으로 통합 학습시킴으로써, 최종 목적인 면역원성 돌연변이 에피토프를 예측하는 요소들의 가중치(weight)가 결정되 고, 모든 생물학적 프로세스에 관여하는 요소들, 에피토프의 특징과 더불어 돌연변이 에피토프와 원시의 에피토 프의 차이를 이용하여 학습할 수 있게 된다. 이상의 학습을 통해 생성된 인공 지능 모델은, 기존 알려진 cross validation, leave-one-out validation 또는 독립 데이터를 활용한 검증(validation)을 통해 성능 평가를 할 수 있으며, 예측된 돌연변이 에피토프를 대상으 로 in vitro, in vivo, 임상 등 실험적 방식으로 성능을 평가할 수 있다. 인공 지능 모델의 결과는 돌연변이 에피토프에 대한 면역원성의 예측치이다. 돌연변이 에피토프에 대한 면역원 성의 예측치는 에피토프가 면역원성인지 또는 비면역원성인지를 확률로 나타낸 것으로 0에서 1 사이의 값일 수 있다. 예를 들어, 돌연변이 에피토프에 대한 면역원성의 예측치가 1에 가까우면 면역원성으로 판단할 수 있고, 0에 가까우면 비면역원성으로 판단할 수 있다. 다른 일 실시예에 따르면, 인공 지능 모델의 결과는 돌연변이 에피토프가 면역원성인지에 대해 판단된 결과일 수 있다. 인공 지능 모델은 돌연변이 에피토프에 대한 면역원성의 예측치를 기준값과 비교하여 면역원성 또는 비면역원성으로 판단할 수 있다. 기준값은 종양의 종류, 목적, 상황 중 어느 하나 또는 조합에 따라 달라질 수 있다. 도 4는 인공 지능 모델을 이용해 돌연변이 에피토프의 면역원성을 예측하는 과정의 일 예를 나타낸 것이다. 도 4를 참조하면, 본 발명의 일 실시예에 따른 돌연변이 에피토프의 면역원성을 예측하는 방법은 돌연변이 에피 토프에 대한 생물학적 프로세스에 관여하는 요소와 에피토프의 특성 각각이 상기 돌연변이 에피토프의 면역원성 에 영향을 주는 정도를 계산하는 단계/과정(S410)을 포함할 수 있다. 돌연변이 에피토프의 면역원성을 예측하는 방법은 상기 돌연변이 에피토프에 대응하는 원시의 에피토프에 대한 생물학적 프로세스에 관여하는 요소와 에피토프의 특성 각각이 상기 원시의 에피토프의 면역원성에 영향을 주는 정도를 계산하는 단계/과정(S420)을 포함할 수 있다. 돌연변이 에피토프의 면역원성을 예측하는 방법은 상기 돌연변이 에피토프에 대해 계산한 값과 상기 원시의 에 피토프에 대해 계산한 값을 기초로 differential index를 계산하는 단계/과정(S430)을 포함할 수 있다. differential index는, 상기 돌연변이 에피토프에 대해 계산한 값과 상기 원시의 에피토프에 대해 계산한 값의 비율(RATIO), 상기 돌연변이 에피토프에 대해 계산한 값과 상기 원시의 에피토프에 대해 계산한 값의 차이(DIFFERENCE) 중 적어도 하나를 포함할 수 있고, 인산화, 소수성, 알려진 에피토프와의 유사성, 자기-단백체와 의 비유사성, 에피토프 안정도, 항원 처리, MHC I 결합 친화도, pMHC 안정도, 면역, 염증 반응, B-세포 선형 에 피토프, B-세포 형태 이상 에피토프 중 적어도 하나에 대한 differential index일 수 있다. 돌연변이 에피토프의 면역원성을 예측하는 방법은 상기 돌연변이 에피토프에 대해 계산한 값과 상기 계산한 differential index를 이용해 사전에 학습된 인공 지능 모델에 입력하여, 상기 돌연변이 에피토프의 면역원성을 예측하는 단계/과정(S440)을 포함할 수 있다. 돌연변이 에피토프의 면역원성을 예측하는 방법은 상기 학습된 인 공 지능 모델에 계산한 값을 입력하기 전, 상기 돌연변이 에피토프에 대해 계산한 값과 상기 계산한 differential index에 대해 표준화 및 정규화 중 적어도 하나를 더 수행할 수 있다. 도 5는 인공 지능 모델을 이용해 돌연변이 에피토프의 면역원성을 예측하는 장치의 구성도의 일 예를 나타낸 것 이다. 도 5를 참조하면, 인공 지능 모델을 이용해 돌연변이 에피토프의 면역원성을 예측하는 장치는 입력/출력 장치 , 저장 장치 및 연산 장치로 구성될 수 있다. 입력/출력 장치(또는, 입출력 장치)는 돌연변이 에피토프를 입력받거나 돌연변이 에피토프의 면역원성을 예측한 결과를 출력하기 위한 구성일 수 있다. 입력/출력 장치는 사용자로부터 또는 다른 장치로부터 돌연 변이 에피토프를 입력받기 위한 구성일 수 있다. 여기서는 입력/출력 장치를 하나로 표시하나 별도의 장치 로 구성될 수 있다. 예를 들어, 입력 장치는 마우스 또는/및 키보드가 될 수 있고, 출력 장치는 모니터와 같은 디스플레이 또는 스피커가 될 수 있다. 저장 장치는 돌연변이 에피토프와 원시의 에피토프에 대한 생물학적 프로세스에 관여하는 요소와 에피토프 의 특성을 기초로 계산된 differential index와 돌연변이 에피토프에 대해 생물학적 프로세스에 관여하는 요소 와 에피토프의 특성을 기초로 계산된 값을 이용하여 돌연변이 에피토프의 면역원성 예측하도록 학습된 인공 지 능 모델을 저장을 저장할 수 있다. 저장 장치는 인공 지능 학습 모델 외에 데이터 처리에 필요한 프로그램 /알고리즘/툴을 저장할 수 있다. 연산 장치는 돌연변이 에피토프에 대한 생물학적 프로세스에 관여하는 요소와 에피토프의 특성 각각이 상 기 돌연변이 에피토프의 면역원성에 영향을 주는 정도를 계산하고, 상기 돌연변이 에피토프에 대응하는 원시의 에피토프에 대한 생물학적 프로세스에 관여하는 요소와 에피토프의 특성 각각이 상기 원시의 에피토프의 면역원 성에 영향을 주는 정도를 계산하고, 상기 돌연변이 에피토프에 대해 계산한 값과 상기 원시의 에피토프에 대해 계산한 값을 기초로 differential index를 계산하고, 상기 돌연변이 에피토프에 대해 계산한 값과 상기 계산한 differential index를 이용해 사전에 학습된 인공 지능 모델에 입력하여, 상기 돌연변이 에피토프의 면역원성을 예측할 수 있다. 연산 장치는 학습된 인공 지능 모델에 계산한 값을 입력하기 전, 상기 돌연변이 에피토프에 대해 계산한 값과 상기 계산한 differential index에 대해 표준화 및 정규화 중 적어도 하나를 더 수행할 수 있다. 여기서는 인공 지능 모델을 이용해 돌연변이 에피토프의 면역원성을 예측하는 장치가 입력/출력 장치, 저 장 장치 및 연산 장치로 구성된 것으로 설명하나, 복수의 구성이 하나의 구성으로 될 수도 있고, 하 나의 구성이 복수의 구성으로 될 수도 있다. 그 외에도, 인공 지능 모델을 이용해 돌연변이 에피토프의 면역원 성을 예측하는 장치는 통신 장치 등을 더 포함할 수 있다. differential index는, 상기 돌연변이 에피토프에 대해 계산한 값과 상기 원시의 에피토프에 대해 계산한 값의 비율(RATIO), 상기 돌연변이 에피토프에 대해 계산한 값과 상기 원시의 에피토프에 대해 계산한 값의 차이 (DIFFERENCE) 중 적어도 하나를 포함할 수 있고, 인산화, 소수성, 알려진 에피토프와의 유사성, 자기-단백체와 의 비유사성, 에피토프 안정도, 항원 처리, MHC I 결합 친화도, pMHC 안정도, 면역, 염증 반응, B-세포 선형 에 피토프, B-세포 형태 이상 에피토프 중 적어도 하나에 대한 differential index일 수 있다. 이하는 앞서 설명한 방법에 따라 돌연변이 에피토프의 면역원성을 예측하는 일 실시예를 나타낸 것이다. 에피토프의 면역원성을 학습하고 평가하기 위해, 공개된 데이터베이스 및/또는 논문 등으로부터 종양에서 발생 한 네오에피토프에 대한 면역원성 에피토프와 비면역원성 에피토프에 관한 데이터를 수집하였다. 아래의 [표 1]은 학습 데이터 세트(학습 데이터 세트)와 평가 데이터 세트(평가용 데이터 세트)의 개수를 나타 낸 것이다. 표 1 구분 CD8+ T-세포 면역원성 에피토프 (positive)CD8+ T-세포 비면역원성 에피토프 (negative) 학습 데이터 세트 315 4067 평가 데이터 세트 79 3125 본 실시예에서는, [표 1]과 같이 dbPepNeo, NEPdb, PRIME 데이터, INeo-Epp 데이터로부터 수집한 총 315개의 면역원성 에피토프(positive)와, 4067개의 비면역원성 에피토프(negative)(즉, 에피토프 및 에피토프와 결합하 는 MHC I 대립 형질)를 학습 데이터 세트(training set)로 사용하였고, McPAS-TCR, VDJdb, IEDB t-cell db, TESLA consortium 데이터로부터 수집한 79개의 면역원성 에피토프(positive)와, 3125개의 비면역원성 에피토프 (negative)를 평가 데이터 세트(independent set)로 사용하였다. 에피토프의 면역원성을 예측하기 위해, 돌연변이 에피토프와 원시의 에피토프에 대해 [표 2]에서 제시한 프로그 램 및 방법으로 각 생물학적 프로세스에 관여하는 요소 및 에피토프 특성을 계산하였다. 표 2 생물학적 프로세스/ 에피토프 특성 프로그램 / 알고리즘 / 툴 참고문헌 돌연변이에 의한 기능적 영향(Functional impact by the mutation)PROVEAN PMID: 23056405 인산화(Phosphorylation (phosphorylated MHC class I ligands))NetMHCphosPan 10.1016/j.immuno.202 1.100005 소수성(Hydrophobicity) ProtFP PMID: 24059694 알려진 에피토프와의 유사성 (Similarity to known epitopes)blastP - Dissimilarity to self (human reference)- proteome“pairwise2”module in Python Bio package- 펩티드 안정성(Peptide stability) ProtParam PMID: 2075190 프로테아좀 분절(Proteasomal cleavage)NetCTLpan PMID: 20379710 TAP transporter efficiency NetCTLpan PMID: 20379710 Antigen processing(Proteasomal cleavage + TAP transporter efficiency)MHCflurry (antigen processing score)PMID: 32711842 MHC I binding affinity NetMHCpan PMID: 32406916 MHCflurry (antigen presentation score)PMID: 32711842 pMHC 안정(pMHC stability) NetMHCstabpan PMID: 27402703 Immunogenicity (T-cell interaction) IEDB tools PMID: 24204222 PRIME PMID: 33665637 Inflammatory response PIP-EL PMID: 30108593 B-cell linear epitope Bepipred PMID: 16635264 B-cell conformational epitope Discotope PMID: 17001032 이후, 돌연변이 에피토프와 원시의 에피토프에 대해 [표 2]에서 제시한 프로그램 및 방법으로 각각 계산한 값을 기초로 앞서 설명한 DIFFERENCE과 RATIO를 계산한다. 돌연변이 에피토프에 대해 [표 2]에서 제시한 프로그램 및 방법으로 계산된 값, DIFFERENCE, 및 RATIO 중 적어 도 하나를 이용해 면역원성 에피토프와 비면역원성 에피토프를 구별할 수 있는 구분능을 AUC와 prAUC, P-value (Wilcoxon rank-sum test, P&lt;0.05)를 기준으로 확인하였다. 이 중 통계적으로 의미있는 요소들만을 인공 지 능 학습 모델에 입력하였다. 표 3 Methods/Programs Epitope DIFFERENCE RATIO AUCprAUCP-valueAUCprAUCP-valueAUCprAUCP-value Similarity to known epitopes0.56105 20.142872.91E- 040.51899 30.08211 90.26126 50.52386 20.07950 10.15808 3 Dissimilarity to self-proteome0.45906 70.06693 60.01534 90.45852 10.06599 80.01403 20.54106 70.08189 50.01500 3 Hydrophobicity (ProtFP)0.55006 50.07836 20.00302 80.53834 80.08668 90.02247 80.53144 30.07876 70.06256 NetCTLpan (Cleavage)0.53525 40.08307 30.03678 80.48989 50.07299 20.55285 60.49299 90.07191 60.68219 4 NetCTLpan (TAP efficiency)0.52604 80.07918 00.12275 20.50161 90.07575 90.80628 60.48982 90.07146 30.65006 9 NetCTLpan (Comb) 0.561760.12613 32.55E- 040.51749 50.07911 20.30015 40.51323 30.07289 70.43322 NetMHCpan (%Rank_EL)0.65225 50.16753 51.90E- 190.50696 90.06915 70.67965 20.54435 60.10532 20.00862 4 NetMHCpan (%Rank_BA)0.65773 60.14892 69.41E- 210.499050.06836 80.95522 60.56248 60.09948 82.15E- 04 MHCflurry (processing score)0.65028 40.14585 75.56E- 190.55895 70.10327 64.80E- 040.536880.07646 40.02893 4 MHCflurry (presentation score)0.67338 70.17737 89.75E- 250.55688 90.09780 47.54E- 040.52161 40.07322 90.20052 7 NetMHCStabPan (%Rank_Stab)0.583870.12251 75.40E- 070.51821 30.07170 10.28028 80.563740.093541.61E- 04 PRIME (%Rank) 0.67861 40.16294 72.20E- 260.55819 20.08327 84.00E- 040.60032 60.096531.55E- 09 DeepHLApan (immunogenic score)0.55255 30.08678 30.00185 50.52228 70.07685 20.18662 10.51050 50.07425 70.53378 4 NetMHCphosPan (Rnk_EL)0.62582 80.14228 39.12E- 140.52009 70.07530 70.23368 40.56161 70.09636 72.62E- 04 PIP-EL (inflammatory response)0.46092 60.06563 60.02072 80.47441 90.06636 30.12979 30.47370 80.06657 90.11948 5 PROVEAN (functional impact by the mutation0.43199 50.05967 75.64E- 05- - - - - - B-cell linear epitope (BcellPred)0.451410.06250 80.00400 60.46808 30.06980 90.05881 70.49382 40.07508 10.71466 3 Peptide stability 0.45559 40.06555 50.00878 50.48604 70.07068 50.49479 20.47905 60.06924 20.27263 7 B-cell conformational epitope (Discotope)0.44595 90.061710.00137 40.48158 70.07285 60.27643 40.51470 60.07123 80.38363 [표 3]을 참조하면, 돌연변이 에피토프에 대한 생물학적 프로세스에 관여하는 요소 및 에피토프 특성 중 TAP 효 율을 제외한 모든 요소들이 면역원성 에피토프인지를 판단하는데 있어 통계적으로 의미있는 요소이다. DIFFERENCE에 대해서는 생물학적 프로세스에 관여하는 요소 및 에피토프 특성 중 자기-단백체와의 비유사성, 소 수성, MHCflurry (processing score), MHCflurry (presentation score), PRIME (%Rank)가 면역원성 에피토프인 지를 판단하는데 있어 통계적으로 의미있는 요소이다. 또한, RATIO에 대해서는 생물학적 프로세스에 관여하는 요소 및 에피토프 특성 중 자기-단백체와의 비유사성, NetMHCpan (%Rank_EL), NetMHCpan (%Rank_BA), MHCflurry (processing score), NetMHCStabPan (%Rank_Stab), PRIME (%Rank), NetMHCphosPan (Rnk_EL)이 면역 원성 에피토프인지를 판단하는데 있어 통계적으로 의미있는 요소이다. 학습 데이터 세트/평가 데이터 세트의 에피토프에 대해 통계적으로 유의한 총 30개의 요소(면역원성 관련 생물 학적 프로세스 및 에피토프 특성)을 2차원 매트릭스화하여, 기계 학습 분석(인공 지능 학습 모델을 이용한 분석)을 수행하였다. 본 실시예에서는 Weka 프로그램을 이용하여, 여러 기계 학습 알고리즘 분석을 수행하였고, 최종적으로 여러 기계 학습 알고리즘을 통합하여 선택하는 방식으로 최종 모델을 생성하였다. 본 실시예에서 최 종 모델은 LogitBoost, BayesNet, CSForest, AdaBoost, Logistic, PART, NaiveBayes, RandomForest, SMO의 9개 기계 학습 알고리즘에 의한 모델 결과를 평균 확률을 기준으로 선택하였고, 본 발명의 성능 향상 정도를 비 교 평가하기 위해, 동일한 데이터에 대해, 공개된 면역원성 관련 프로그램들을 수행하고 성능을 비교하였다. 아래의 [표 4]는 학습 데이터 세트에 대한 에피토프 면역원성 예측 성능 평가 결과를 나타낸 것이고, [표 5]는 평가 데이터 세트에 대한 에피토프 면역원성 예측 성능 평가 결과를 나타낸 것이다. 표 4 알고리즘 ThresholdTraining DB (P:315, N:4067) F-MeasurePrecisionRecallAccuracyROC Area (=AUC)PRC Area (=prAUC) NetMHCpan (%Rank_EL)&lt; 0.50.1930.1160.5650.6600.6520.168 MhcFlurry-2.0 (presentation_score)&gt; 0.50.179 0.1030.6890.5460.6730.177 PRIME (%Rank) &lt; 0.50.210 0.1310.5240.7160.6790.163 DeepHLApan (Immunogenic_score)&gt; 0.50.145 0.0830.5900.4990.5530.087 IEDB tool &gt; 0.00.137 0.0780.5780.4780.5320.080 DeepImmuno &gt; 0.50.1580.0870.9340.1870.5480.091 TESLA 컨소시움 기준 - 0.1940.1640.2380.8580.5720.228 본 발명 (NeoPro-Onco)&gt; 0.50.3020.2590.3620.8800.7240.234 표 5 알고리즘 Threshold Independent test DB (P:79, N:3125) F-MeasurePrecisionRecallAccuracyROC Area (=AUC)PRC Area (=prAUC) NetMHCpan (%Rank_EL)&lt; 0.50.2850.1760.7470.9080.9420.317 MhcFlurry-2.0 (presentation_score)&gt; 0.50.2890.1750.8350.8990.9490.325 PRIME (%Rank) &lt; 0.50.3230.2080.7220.9250.9190.328 DeepHLApan (Immunogenic_score)&gt; 0.50.0590.0310.4680.6290.5380.032 IEDB tool &gt; 0.00.0610.0320.6330.5190.5980.032 DeepImmuno &gt; 0.50.1100.0580.8920.1390.6080.099 TESLA 컨소시움 기준 - 0.3820.3850.3800.9700.6820.390 본 발명 (NeoPro-Onco)&gt; 0.50.4150.3580.4940.9660.9550.429 본 발명의 경우, 10-fold cross-validation 수행 결과이며, 기존 공개된 프로그램 및 알고리즘의 경우, 전체 데 이터를 대상으로 평가 수행한 결과이다. [표 4]를 참조하면, 본 발명에 따른 방법이 기존 공개된 프로그램 및 알고리즘 방법 대비, AUC 및 prAUC, F-measure 등에서 더 좋은 예측 정확도를 보임을 확인할 수 있다. [표 5]를 참조하면, 학습에 사용되지 않은 평가 데이터 세트에 대해서도 본 발명에 따른 방법이 기존 공개된 프로그램 및 알고리즘 방법 대비, AUC 및 prAUC, F-measure 등에서 더 좋은 예측 정확도를 보임을 확인할 수 있다. [표 6]은 모든 요소를 포함하는 모델과 DIFFERENCE와 RATIO를 제외한 모델의 성능을 비교한 결과를 나타낸 것이다. 표 6 Algorithm ThresholdTraining DB (P:315, N:4067)Independent test DB (P:79, N:3125) ROC Area (=AUC)PRC Area (=prAUC)ROC Area (=AUC)PRC Area (=prAUC) 모든 요소를 고려한 모델&gt; 0.50.724 0.234 0.955 0.429 12개의 differential index를 제외한 모델&gt; 0.50.730 0.226 0.954 0.408면역원성/비면역원성 에피토프의 샘플수가 동일하지 않기 때문에, 더 적합한 성능 비교방법인 prAUC 기준으로 비교하였다. [표 6]을 참조하면, DIFFERENCE와 RATIO를 포함한 모델이 DIFFERENCE와 RATIO가 제외된 모델보다 더 높은 성능을 보여 Differential index(DIFFERENCE와 RATIO)가 면역원성 에피토프를 예측하는데 기여함을 확 인할 수 있다. 이상, 본 발명내용의 특정한 부분을 상세히 기술하였는 바, 당업계의 통상의 지식을 가진 자에게 있어서, 이러 한 구체적인 기술은 단지 바람직한 실시양태일 뿐이며, 이에 의해 본 발명의 범위가 제한되는 것이 아닌 점은 명백할 것이다. 따라서 본 발명의 실질적인 범위는 첨부된 청구항들과 그것들의 등가물에 의해 정의된다고 할 것이다."}
{"patent_id": "10-2022-0148030", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 종양 세포의 생물학적 프로세스의 일 예를 나타낸 것이다. 도 2는 신생항원의 면역원성에 영향을 미칠 수 있는 다수의 생물학적 프로세스의 요소 및 신생항원의 특성을 나 타낸 것이다. 도 3은 인공 지능 모델을 이용해 돌연변이 에피토프의 면역원성을 학습하는 과정의 일 예를 나타낸 것이다. 도 4는 인공 지능 모델을 이용해 돌연변이 에피토프의 면역원성을 예측하는 과정의 일 예를 나타낸 것이다. 도 5는 인공 지능 모델을 이용해 돌연변이 에피토프의 면역원성을 예측하는 장치의 구성도의 일 예를 나타낸 것 이다."}
