{"patent_id": "10-2019-0075021", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0000128", "출원번호": "10-2019-0075021", "발명의 명칭": "배터리 모듈 연결 장치 및 이를 이용하는 배터리 시스템", "출원인": "김주호", "발명자": "김주호"}}
{"patent_id": "10-2019-0075021", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "배터리 시스템의 케이스 또는 상기 배터리 시스템을 덮는 상부 구조물의 내측 하부면에 일단부가 고정되고 상기일단부를 중심으로 회전하는 회전부를 구비하는 회전 몸체;상기 회전 몸체의 회전 운동에 따라 서로 인접하게 배치되는 복수의 배터리 모듈들의 접속 단자들에 공통으로착탈가능하게 결합하는 접속 단자 셋;상기 회전 몸체에 구동력을 제공하는 액추에이터; 및상기 액추에이터의 동작을 제어하기 위한 신호 또는 데이터의 입출력을 위한 통신 인터페이스를 포함하는 배터리 모듈 연결 장치."}
{"patent_id": "10-2019-0075021", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 회전 몸체는 상기 액추에이터의 구동력에 의해 상하 운동하면서 회전 운동하며,상기 접속 단자 셋은 상기 회전 몸체의 상하 회전 운동에 따라 상기 복수의 배터리 모듈들의 접속 단자들에 회전하며 결합하며,상기 접속 단자 셋과 상기 통신 인터페이스를 통해 연결되는 접속제어유닛의 동작에 따라 상기 복수의 배터리모듈들 중 적어도 어느 하나와 외부의 부하 또는 전원공급장치를 연결하는, 배터리 모듈 연결 장치."}
{"patent_id": "10-2019-0075021", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1 또는 2의 배터리 모듈 연결 장치; 및상기 배터리 모듈 연결 장치와 일정 간격 이격되어 배치되는 복수의 배터리 모듈들;을 포함하며,복수의 배터리 모듈들의 제1 접속 단자들은 상기 배터리 모듈 연결 장치의 접속 단자 셋에 상기 복수의 배터리모듈들이 동시에 연결가능하도록 서로 인접하게 배치되는, 배터리 시스템."}
{"patent_id": "10-2019-0075021", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 3에 있어서,상기 복수의 배터리 모듈들에 대응하는 상기 접속 단자 셋의 제2 접속 단자들과 상기 외부의 전원공급장치를 선택적으로 연결하는 복수의 스위치들과 상기 복수의 스위치들의 동작을 제어하는 스위칭 제어부를 구비하며, 상기 접속 단자 셋과 외부의 전원공급장치 사이에 배치되는, 접속제어유닛을 더 포함하는, 배터리 시스템."}
{"patent_id": "10-2019-0075021", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "배터리 모듈 연결 장치 및 이를 이용하는 배터리 시스템이 개시된다. 배터리 시스템은, 배터리 모듈 연결 장치, 및 배터리 모듈 연결 장치와 일정 간격 이격되어 배치되는 복수의 배터리 모듈들을 포함하며, 배터리 모듈 연결 장치는, 배터리 시스템의 케이스의 내측 하부면에 일단부가 고정되고 일단부를 중심으로 회전하는 회전부를 구비 하는 회전 몸체와, 회전 몸체의 회전 운동에 따라 서로 인접하게 배치되는 복수의 배터리 모듈들의 접속 단자들 에 공통으로 착탈가능하게 결합하는 접속 단자 셋과, 회전 몸체에 구동력을 제공하는 액추에이터와, 액추에이터 의 동작을 제어하기 위한 신호 또는 데이터의 입출력을 위한 통신 인터페이스를 구비하며, 복수의 배터리 모듈들 의 제1 접속 단자들은 배터리 모듈 연결 장치의 접속 단자 셋에 복수의 배터리 모듈들이 동시에 연결가능하도록 서로 인접하게 배치된다."}
{"patent_id": "10-2019-0075021", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 배터리 모듈 연결 장치 및 이를 이용하는 배터리 시스템에 관한 것이다."}
{"patent_id": "10-2019-0075021", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전기차 등에 사용되는 배터리 팩은 통상 복수의 배터리 모듈들과 각 배터리 모듈의 온도, 전압 등을 관리하는 배터리 관리 시스템 등으로 구성된다. 배터리 모듈은 복수의 배터리 유닛들을 하나로 묶어 구성된다. 배터리 모듈은 진동 등의 외부 충격에서 좀 더 보호할 수 있도록 여러 개의 배터리 유닛들을 하나로 묶어 프레임에 넣은 구조를 가진다. 배터리 모듈은, 자동차용의 경우 자동차 내 제한된 공간에서 최대한의 성능을 발현할 수 있도록 단위 부피당 높 은 용량을 갖는 것이 좋고, 모바일 기기용 배터리에 비해 휠씬 긴 수명이 필요하며, 주행 중에 전달되는 충격을 견디고, 저온 및 고온 환경에서도 높은 신뢰성과 내구성을 지니도록 연구 개발되고 있다. 여러 개의 배터리 유닛들은 하나로 묶여 배터리 모듈에 사용되고, 여러 개의 배터리 모듈들은 하나로 묶여 배터 리 팩에 사용되며, 이러한 배터리 팩은 전기차 등에 사용된다. 한편, 배터리는 방전과 충전을 반복하여 사용되는데, 각 배터리 팩이나 각 배터리 모듈의 물리적인 특성 차이, 성능 차이 등에 의해 배터리 관리 시스템의 성능에 따라 배터리 시스템의 효율과 수명에 큰 차이를 가진다. 특 히, 배터리 모듈은 충전 시 과전압에 의해 열화가 심화될 수 있으므로, 이에 대한 제어가 필요하다. 또한, 차량 의 전자제어시스템의 오류로 인한 오작동시 외부적인 차단이 필요하나, 현재 대부분의 배터리 모듈들의 연결 구 조가 전자적으로 구성되어 있어 기계적인 차단이 쉽지 않고, 그에 의해 오류 발생 시 배터리 시스템의 손상 우 려가 상대적으로 높은 문제가 있다. 또한, 자동차나 산업용으로 충방전을 반복하는 리튬 2차 전지의 사용이 많이 증가하고 있다. 이런 충전 배터리 의 문제는 충전에 많은 시간이 필요한 점이다. 특히, 자동차 배터리의 경우 완충시 고속충전을 하더라도 한 시 간 이상 소요되기 때문에 상용화에 한계가 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 공개특허공보 제10-2000-0018888호(2000.04.06)"}
{"patent_id": "10-2019-0075021", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술한 종래 기술의 문제점을 해결하기 위해 도출된 것으로, 본 발명의 목적은 복수의 배터리 모듈들 이나 적어도 하나의 배터리 모듈을 각각 수납한 복수의 배터리 팩들 간의 회로와 전원을 기계적인 단순 동작으 로 간편하게 연결하거나 분리할 수 있는 배터리 모듈 연결 장치를 제공하는데 있다. 본 발명의 다른 목적은 복수의 배터리 모듈들로 이루어지며, 충전시에는 각각의 배터리 모듈별로 분리하여 충전 하고, 방전시에는 배터리 모듈들을 동작 상황에 맞게 적절하게 직렬, 병렬 또는 직병렬로 연결하여 사용하는 배 터리 시스템을 위한 배터리 모듈 연결 장치를 제공하는데 있다."}
{"patent_id": "10-2019-0075021", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 기술적 과제를 해결하기 위한 본 발명의 일 측면에 따른 배터리 모듈 연결 장치는, 배터리 시스템의 케이 스 또는 상기 배터리 시스템을 덮는 상부 구조물의 내측 하부면에 일단부가 고정되고 상기 일단부를 중심으로 회전하는 회전부를 구비하는 회전 몸체; 상기 회전 몸체의 회전 운동에 따라 서로 인접하게 배치되는 복수의 배 터리 모듈들의 접속 단자들에 공통으로 착탈가능하게 결합하는 접속 단자 셋(set); 상기 회전 몸체에 구동력을 제공하는 액추에이터; 및 상기 액추에이터의 동작을 제어하기 위한 신호 또는 데이터의 입출력을 위한 통신 인 터페이스를 포함한다. 일실시예에서, 상기 회전 몸체는 상기 액추에이터의 구동력에 의해 상하 운동하면서 회전 운동한다. 상기 접속 단자 셋은 상기 회전 몸체의 상하 회전 운동에 따라 상기 복수의 배터리 모듈들의 접속 단자들에 회전하며 결합 한다. 그리고, 상기 접속 단자 셋과 상기 통신 인터페이스를 통해 연결되는 접속제어유닛의 동작에 따라 상기 복수의 배터리 모듈들 중 적어도 어느 하나의 배터리 모듈은 외부의 부하 또는 전원공급장치와 연결될 수 있다. 또한, 차량에 사용되는 경우, 배터리 시스템은 별도의 시동용 배터리를 더 구비할 수 있다. 상기 기술적 과제를 해결하기 위한 본 발명의 다른 측면에 따른 배터리 시스템은, 전술한 실시예들 중 어느 하 나의 배터리 모듈 연결 장치; 및 상기 배터리 모듈 연결 장치와 일정 간격 이격되어 배치되는 복수의 배터리 모 듈들;을 포함하며, 복수의 배터리 모듈들의 제1 접속 단자들은 상기 배터리 모듈 연결 장치의 접속 단자 셋에 상기 복수의 배터리 모듈들이 동시에 연결가능하도록 서로 인접하게 배치된다. 일실시예에서, 배터리 시스템은, 상기 복수의 배터리 모듈들에 대응하는 상기 접속 단자 셋의 제2 접속 단자들 과 상기 외부의 전원공급장치를 선택적으로 연결하는 복수의 스위치들과 상기 복수의 스위치들의 동작을 제어하 는 스위칭 제어부를 구비하며, 상기 접속 단자 셋과 외부의 전원공급장치 사이에 배치되는, 접속제어유닛을 더 포함할 수 있다."}
{"patent_id": "10-2019-0075021", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 배터리 모듈 연결 장치 및 이를 이용하는 배터리 시스템을 사용하는 경우에는, 1개의 배터리가 다수의 셀이 나눠진 것이 아닌 N개의 배터리를 동시에 연결하여 사용할 수 있는 장점이 있다. 또한, 충전시에는 N개의 배터리를 각각 분리한 뒤 각각의 포트를 통해 충전하는 방식으로 충전속도를 1/N으로 단축시키는 효과가 있다. 더욱이, 배터리 모듈 연결 장치를 회전시켜 복수의 배터리 모듈의 단자들에 결합하도록 함으로써 단자와 배터리 모듈 연결 장치의 연결을 견고하게 하여 차량 등에서 접속 단자의 신뢰성과 안정성을 높일 수 있는 효과가 있다. 또한, 본 발명에 의하면, 각각의 배터리의 전압이 다르거나 일부가 더 많이 방전되어도 배터리 모듈들의 직류 연결이나 교류 연결을 통해 배터리 시스템의 충방전을 가능하게 할 수 있다. 또한, 이러한 구성을 통해 긴급 시 보조 배터리를 장착하여 배터리 시스템의 충방전을 가능하게 할 수 있다. 또한, 본 발명에 의하면, 차량에서 단일 배터리를 N개로 분리 탈착할 수 있게 구성할 수 있으며, 그에 의하여 추후 배터리 교체 시스템의 효율적 운영을 가능하게 할 수 있다. 또한, 본 발명에 의하면, N개의 배터리들 각각이 충전포트를 가지도록 구성하고, 배터리 시스템의 충전 동작시 에서 N개의 배터리 모듈들을 분리 사용하고, 방전시에는 N개의 배터리 모듈들을 연결 사용함으로써, 즉 기계적 으로 별도의 회로와 전원을 활용하여 N개의 배터리 모듈들을 동시에 연결 및 분리할 수 있게 구성함으로써, 충 전 시 각각의 배터리에 대한 과전압 등의 문제를 예방할 수 있다. 또한, 제어장치나 인공지능(AI) 등의 제어장 치의 오류나 그것으로 인한 차량의 급발진 등의 오작동시 외부적으로 전원공급의 차단을 용이하게 만들어 비상 상황에서 즉각적이고 효과적으로 대처할 수 있는 환경을 제공할 수 있다."}
{"patent_id": "10-2019-0075021", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 본 발명의 바람직한 실시예를 도면을 참조하여 설명하기로 한다. 본 명세서에 사용된 용어나 단어는 통상적이거나 사전적인 의미로 한정해서 해석되어서는 아니되며, 발명자는 그 자신의 발명을 가장 최선의 방법으로 설명하기 위해 용어의 개념을 적절하게 정의할 수 있다는 원칙에 입각 하여 본 발명의 기술적 사상에 부합하는 의미와 개념으로 해석되어야만 한다. 또한, 본 명세서에 기재된 실시예 와 도면에 도시된 구성은 본 발명의 가장 바람직한 일 실시예에 불과할 뿐이고 본 발명의 기술적 사상을 모두 대변하는 것은 아니므로, 본 출원시점에 있어서 이들을 대체할 수 있는 다양한 균등물과 변형예들이 있을 수 있 음을 이해하여야 한다. 이하의 설명에서 배터리 모듈은 별도의 케이스에 수납되는 복수의 배터리 유닛을 구비하는 것으로 지칭하기로 한다. 배터리 팩은 적어도 하나의 배터리 모듈에 대응하고, 배터리 유닛은 배터리 셀에 대응될 수 있다. 도 1은 본 발명의 일 실시예에 따른 배터리 시스템의 개략적인 구성도이고, 도 2는 도 1의 배터리 시스템의 스 위치 플레이트에 대한 부분 확대도이다. 본 실시예의 배터리 시스템은, 각각 충전단자와 출력단자가 결합된 복수의 배터리 모듈과; 복 수의 배터리 모듈에 결합된 출력단자를 직병렬 연결하거나 해제할 수 있는 스위치 모듈과; 충전단자로 전력이 충전될 경우 스위치 모듈을 출력단자와 해제하고, 충전단자로 전력이 충전되지 않 을 경우 스위치 모듈을 작동하여 출력단자를 연결하여 복수의 배터리 모듈을 동작 상황에 맞게 적 절하게 직렬, 병렬 또는 직병렬로 연결하도록 하는 제어부를 포함한다. 이러한 구성에 의하면, 충전시간을 최대 \"1/ 배터리 모듈\"로 줄일 수 있다. 또한, 배터리 모듈은 하나의 단위 유닛으로서, 축전과 방전이 가능하다. 배터리 모듈에는 충전단자(1 1)와 출력단자가 결합되어 있다. 충전단자로 직류 전원이 들어오면, 배터리 모듈에서 충전이 된다. 배터리 모듈은 하나의 중심점을 두고, 서로 인접하여 위치하는 것이 좋다. 배터리 모듈에는 출력단자가 각각 결합되어 있다. 출력단자들의 상부에는 스위치 모듈이 결합 된다. 스위치 모듈은 복수의 배터리 모듈에 결합된 출력단자를 연결하거나 해제할 수 있다. 스위치 모듈은, 출력단자와 대응되는 위치에 접촉단자가 결합된 스위치 플레이트와; 스위치 플레이트를 상하부로 이동시키거나 회전시킬 수 있는 실린더를 포함한다. 출력단자와 접촉단자가 접촉되어 연결될 경우, 복수의 배터리 모듈은 동작 상황에 맞게 적절하게 직렬, 병렬 또는 직병렬로 연결된다. 본 실시예의 배터리 시스템을 사용하고자 할 경우, 출력단자와 접촉단자를 직렬 연결함으로써 배터리의 출력을 높일 수 있다. 또한 배터리를 병렬 혹은 직병렬로 연결함 으로써 정격전압을 유지하고, 사용시간을 연장할 수 있다. 한편, 충전단자에 전력이 공급될 경우, 각각의 배터리 모듈 별로 충전이 이루어진다. 이 경우, 출력단 자와 접촉단자의 접촉을 해제하여야 한다. 실린더는 스위치 플레이트를 상하로 이동시키거나 회전시킨다. 그 결과, 출력단자와 접촉단자(21 1)의 연결을 유지시키거나 해제시킨다. 제어부는 충전단자에 전력이 공급되고 있음을 감지하면, 출력단자와 접촉단자가 떨어지도록 스위치 모듈을 제어한다. 한편, 충전이 끝나고, 출력을 하고자 할 경우, 제어부는 스위치 모듈을 작동하여 접촉단자와 출력단자를 연결한다. 그 결과, 배터리 모듈이 동작 상황에 맞게 적절하게 직렬, 병렬 또는 직병렬로 연결된다. 아울러, 본 발명의 배터리 시스템은 배터리 충전시간을 줄일 수 있다. 특히, 전기 자동차의 경우 배터리 충전시간 때문에, 대중화에 어려움을 가지고 있다. 본 발명에서와 같이, 배터리 모듈을 분할하여 충전함으 로써, 충전시간을 획기적으로 줄일 수 있다. 도 3은 본 발명의 다른 실시예에 따른 배터리 시스템의 사시도이고, 도 4는 도 3의 배터리 시스템의 회전 몸체 를 설명하기 위한 부분 분해 사시도이다. 도 5는 본 발명의 또 다른 실시예에 따른 배터리 시스템의 회전 몸체 를 설명하기 위한 부분 사시도이다. 그리고 도 6은 본 발명의 배터리 시스템에 채용할 수 있는 접속제어유닛의 개략적인 구성도이다. 도 3 및 도 4를 참조하면, 본 실시예에 따른 배터리 시스템(100A)은, 배터리 모듈 연결 장치과, 배터리 모 듈 연결 장치와 일정 간격 이격되어 배치되는 복수의 배터리 모듈들을 포함한다. 복수의 배터리 모듈들의 제1 접속 단자들은 배터리 모듈 연결 장치의 접속 단자 셋에 복수의 배터리 모듈들의 제1 접속 단자들이 동시에 연결가능하도록 서로 인접하게 배치된다. 즉, 다면체 혹은 육면체 형태의 배터리 모듈들은 제1 접속 단자들이 각각 배치된 모서리 부분들이 서로 접하거나 인접하 게 위치하도록 배치될 수 있다. 배터리 모듈 연결 장치는 회전 몸체, 접속 단자 셋 및 액추에이터를 구비한다. 접속 단자 셋 은 접속 단자 셋의 상부측에 구비되어 회전 몸체에 탑재된 액추에이터의 동작에 의해 회전하는 나사구조부에 의해 상하 회전 운동할 수 있다. 또한, 접속 단자 셋은 적어도 그 하부에 노출되며, 제1 접속 단자들과 맞물리거나 밀착되는 제2 접속 단자들을 구비할 수 있다. 또한, 배터리 모듈 연결 장치은 배터리 시스템의 하우징이나 케이스의 내측 상부면(50a)에 설치될 수 있다. 그 경우, 회전 몸체는 케이스 내측 상부면(50a)에 회전 가능하게 설치되고, 접속 단자 셋은 회전 몸체 내부의 액추에이터의 동작에 따라 하방의 복수의 배터리 모듈들의 제1 접속 단자들을 향 하여 상하 회전 왕복 운동을 수행할 수 있다. 회전 몸체는 배터리 시스템의 케이스 또는 배터리 시스템을 덮는 상부 구조물의 내측 하부면(50a)에 일 단부가 고정되고 일단부를 중심으로 회전하는 회전부를 구비하도록 구현될 수 있다. 접속 단자 셋은 회전 몸체에서의 회전 왕복 운동에 따라 서로 인접하게 배치되는 복수의 배터리 모듈들 의 접속 단자들에 공통으로 혹은 동시에 착탈가능하게 결합하도록 설치된다. 여기서, 복수의 접속 단자 들은 회전하면서 상하 왕복 운동하는 접속 단자 셋의 단자 접속 홀에 결합하기 위해 그 돌출 단자 돌기 들이 나선형 방향에서 약간 경사진 원통 형태를 가지고, 그 상부는 곡면 모서리를 구비하도록 형성될 수 있다. 또한, 접속 단자 셋의 복수의 단자 접속 홀은 복수의 접속 단자들에 대응하는 형태를 구비할 수 있 다. 액추에이터는 회전 몸체에 구동력을 제공하도록 설치될 수 있다. 액추에이터는 액추에이터의 동작 을 제어하기 위한 신호 또는 데이터의 입출력을 위한 통신 인터페이스를 구비할 수 있다. 통신 인터페이스는 유 선 또는 무선 네트워크를 지원할 수 있다. 전술한 접속 단자 셋은 회전 왕복 운동을 기본 동작으로 하여 움직이는 스크루방식, 기어방식, 피스톤방식, 자동 스위치방식 등으로 구현될 수 있다. 스크루 방식은 나사산이 있는 나사구조부를 이용하여 회전 왕복 운동하는 방식이고, 기어 방식은 회전 몸체와 접속 단자 셋이 기어 형태의 액추에이터에 의해 일체로 회전 왕복 운동하는 방식이고, 피스톤 방식은 피스톤 방식의 액추에이터에 의해 회전 왕복 운동하는 방식이고, 자동 스위치방식은 모터에 의해 접속 단자 셋을 회전 왕복 운동하는 방식이다. 또한, 도 6을 참조하면, 배터리 시스템(100A)은, 복수의 배터리 모듈들(B1 내지 B4; 10)에 대응하여 위치하는 접속 단자 셋의 제2 접속 단자들과 외부의 전원공급장치(P1 내지 P4)를 선택적으로 연결하는 복수의 스 위치들, 좀더 명확하게는 4개의 스위치들(S1 내지 S4)과, 4개의 스위치들(S1 내지 S4)의 동작을 제어하는 제어 부(30a)를 구비할 수 있다. 제어부(30a)는 액추에이터의 동작을 제어하는 제1 제어모듈과 4개의 스위치들(S1 내 지 S4)의 동작을 제어하는 제2 제어모듈을 구비한 스위칭 제어부를 포함할 수 있다. 여기서, 복수의 스위치들(S1 내지 S4)은 접속제어유닛의 일부(90a)로 지칭되고, 복수의 스위치들(S1 내지 S4)와 스위칭 제어부는 접속제어유닛으로 지칭될 수 있으며, 그 구성의 적어도 일부(90a)는 전기적인 배선을 기준으로 고려할 때 접속 단자 셋과 외부의 전원공급장치(S1 내지 S4) 사이에 배치될 수 있다. 각 배터리 모듈은 포지티브(P) 단자와 네거티브 단자(N)을 구비한 접속 단자를 구비한다. 전술한 구성에 의하면, 본 실시예에 따른 배터리 시스템(100A)은 방전 동작 모드에서 4개의 스위치들(S1, S2, S3, S4) 모두가 노멀 모드로 제1 배터리 모듈(B1) 내지 제4 배터리 모듈(B4)가 기재된 순서대로 직렬 연결되어 외부의 부하(L1)에 연결되도록 설치될 수 있다. 또한, 본 실시예에 따른 배터리 시스템(100A)은 충전 동작 모드에서 4개의 스위치들(S1, S2, S3, S4) 모두가 각 각 스위칭 모드로 전환되어 제1 배터리 모듈(B1)은 제1 전원공급장치(P1)에, 제2 배터리 모듈(B2)은 제2 전원공 급장치(P2)에, 제3 배터리 모듈(B3)은 제3 전원공급장치(P3)에, 그리고 제4 배터리 모듈(B4)은 제4 전원공급장 치(P4)에 각각 전기적으로 분리되어 연결될 수 있다. 전술한 구성에 의하면, 쿼터 배터리에 적용하여 충전시간 문제를 해결할 수 있는 배터리 시스템을 제공할 수 있 다. 또한, 일반 자동차에 사용되는 기존의 1개 배터리를 작은 크기/용량의 배터리 4개로 나눠서 별도의 배터리 모듈을 준비하여 배열하고 배터리 모듈 연결 장치를 배치함으로써 충전시에는 복수의 배터리 모듈들을 전기 적으로 병렬 혹은 부분 직렬로 연결하여 각각 충전하고, 사용(방전)시에는 복수의 배터리 모듈들을 동작 상황에 맞게 전기적으로 적절하게 직렬, 병렬 또는 직병렬로 연결하여 사용할 수 있다. 이와 같이, 본 실시예에 의하면, 예컨대, 충전 용량이 10만(단위 생략)인 자동차용 단일 배터리가 있고 그 충전 시간이 8시간이라고 가정할 때, 이러한 단일 배터리에 본 실시예를 적용하여 4개의 배터리 모듈들로 구성하고 배터리 모듈 연결 장치를 사용함으로써 배터리 충전 시간을 2시간으로 단축할 수 있다. 또한, 자동차에 배터리를 연결하여 사용할 때, 진동 등으로 인하여 배터리의 전기적인 접속에 악영향이 미치는 것을 방지하기 위하여, 회전 왕복 운동하는 접속 단자 셋을 사용하여 복수의 배터리 모듈들의 제1 접속 단자들 을 신뢰성 있게 연결함으로써, 배터리 연결 시 동시에 접속 단자들이 정확하게 연결이 이루어질 수 있고, 그에 의해 접속 불량 등을 방지하고 접속 불량 등에 따른 배터리로의 악영향을 방지할 수 있다. 리튬이온배터리의 경 우, 배터리에 악영향이 미치면 전압문제 등으로 폭발의 위험이 있으나, 본 실시예의 구성을 사용하면 이를 효과 적으로 방지하는 효과를 얻을 수 있습니다. 더욱이, 본 발명에 의하면, 접속 단자 셋을 포함한 연결하는 부분이 돌아 내려가면서 4개의 배터리 모듈들의 접 속 단자들(전극)에 동시에 접촉되면서 하나의 배터리와 같은 역할을 할 수 있어, 배터리 시스템의 신뢰성과 안 정성을 확보할 수 있다. 아울러, 본 발명에 의하면, 전술한 배터리 시스템에 사용되는 배터리 모듈과 동일한 배터리 모듈을 보조 배터리 로 준비하여 활용할 수 있다. 즉, 비상시를 위해 하나의 배터리 모듈을 보조 배터리로 가지고 다니다 배터리 시 스템 내 어느 하나의 배터리 모듈이 방전하게 되면 보조 배터리로 교체 장착하여 배터리 시스템을 다시 정상 운 영할 수 있다. 그 경우, 부피 혹은 용량이 작은 배터리 모듈을 보조 배터리로 차량 등에 탑재하여 다닐 수 있으 므로, 기존의 단일 배터리와 동일한 보조 배터리에 비해 사용자 편의성을 크게 향상시킬 수 있는 장점이 있다."}
{"patent_id": "10-2019-0075021", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "위와 같은 본 발명의 상세한 설명에서는 바람직한 실시예들에 대하여 설명하였지만, 본 발명의 기술분야에서 통 상의 지식을 가진 사람이라면 하기의 청구범위에 기재된 본 발명의 사상 및 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수정 및 변경시킬 수 있음을 이해할 수 있을 것이다."}
{"patent_id": "10-2019-0075021", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 배터리 시스템의 개략적인 구성도. 도 2는 도 1의 배터리 시스템의 스위치 플레이트에 대한 부분 확대도. 도 3은 본 발명의 다른 실시예에 따른 배터리 시스템의 사시도. 도 4는 도 3의 배터리 시스템의 회전 몸체를 설명하기 위한 부분 분해 사시도. 도 5는 본 발명의 또 다른 실시예에 따른 배터리 시스템의 회전 몸체를 설명하기 위한 부분 사시도. 도 6은 본 발명의 배터리 시스템에 채용할 수 있는 접속제어유닛의 개략적인 구성도."}
