{"patent_id": "10-2021-0022180", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0105840", "출원번호": "10-2021-0022180", "발명의 명칭": "무선통신망을 기반으로 하는 레저차량의 컨트롤시스템", "출원인": "에이스캠퍼", "발명자": "김민성"}}
{"patent_id": "10-2021-0022180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "레저를 즐기고자 하는 일반 사용자(20: 유저); 사물인터넷(IOT) 및 협대역 사물 인터넷(NB-Iot: NarrowBand-Internet of Things, 狹帶域事物-인터넷)같은 무선통신망을 이용하여 캠핑카(RV)를 제어하는 스마트 RV 컨트롤(30), 호텔ㆍ리조트ㆍ펜션의 숙박관리자(40), 축제ㆍ리조트ㆍ레저업체ㆍ관광지ㆍ맛집과 제휴하는 정박지(50),개인 소유주 또는 렌트카 업체 등의 캠핑카(RV) 소유주(60)를 사물인터넷(Internet of Things)을 기반으로 하여연계하는 알브이 허그 앱(RV HUG APP)에 의해 이용에 대한 정보를 포괄적으로 관리하는 것: 을 특징으로 하는무선통신망을 기반으로 하는 캠핑카의 관제시스템."}
{"patent_id": "10-2021-0022180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "무선통신망을 이용하여 사용자(유저)ㆍ스마트 RV 컨트롤ㆍ숙박관리자ㆍ정박지ㆍ캠핑카(RV)소유주 등의 이용에대한 정보를 포괄적으로 관리하는 알브이 허그 앱(10: RV HUG APP)을 기반으로 한 것과;상기 알브이 허그 앱(10: RV HUG APP)을 기반으로 하여 캠핑카의 기기들을 통합관리하고, 각 기기들의 작동환경설정 및 작동을 컨트롤하며, 각 기기들을 무선통신망에 의해 통신하는 통합Iot콘트롤시스템(100)과; 응용프로그램이 실행될 수 있는 기초를 이루는 컴퓨터시스템에 근거리통신(LAN)에서 응용프로그램의 집약적인 처리기능을서비스하는 플랫폼 서비스용 서비스구축시스템(200); 및 사용자(유저)의 공유경제를 실행 및 활성화하는 서버구축시스템, 및 캠핑ㆍ여행을 관장하고 구축된 캠핑카와 캠핑포인트(캠핑장소)에 대한 정보를 공유 및 제공하는서버구축장치로 구성된 공유플랫폼시스템(300); 캠핑포인트(캠핑장소)의 이용에 대한 정보를 유무선통신망으로실행하는 온라인캠핑예약 및 이용시스템(400)을 통합 관리하는 것: 을 특징으로 하는 무선통신망을 기반으로 하는 캠핑카의 관제시스템."}
{"patent_id": "10-2021-0022180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서, 레저를 즐기고자 하는 일반 사용자(20: 유저)는:레저ㆍ문화의 포괄적인 정보를 제공하고 분야별로 회원가입ㆍ이용액할인ㆍ쿠폰제공ㆍ우선사용권의 혜택을 부여받는 것과;휴대폰이나 스마트폰에 다운받아 사용할 수 있는 앱(APP: application)을 활성화 시키는 것: 을 특징으로 하는무선통신망을 기반으로 하는 캠핑카의 관제시스템."}
{"patent_id": "10-2021-0022180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서, 무선통신망을 이용하여 RV(캠핑카)를 제어하는 스마트 RV 컨트롤(30)은:사물에 센서를 부착하여 실시간으로 데이터를 주고받을 수 있도록 하는 위치기반 사물인터넷(IOT: Internet ofthings)컨트롤 제어기능을 알브이 허그 앱(10: RV HUG APP)에서 제공받는 것과;레저의 이용에 따른 빅 데이터를 알브이 허그 앱(10: RV HUG APP)에 축적 받는 것: 을 특징으로 하는 무선통신망을 기반으로 하는 캠핑카의 관제시스템."}
{"patent_id": "10-2021-0022180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서, 호텔ㆍ리조트ㆍ펜션 등의 숙박관리자(40)는; 공개특허 10-2021-0105840-3-RV(캠핑카) 차량 이용자(소유자, 공유자)와 연계시켜 RV(캠핑카) 차량 이용자(소유자, 공유자)가 숙박시설을 이용할 수 있도록 하는 것과;알브이 허그 앱(10: RV HUG APP)으로 부터 RV(캠핑카) 존에 따른 숙박활용도에 대한 점수를 받는 것과;알브이 허그 앱(10: RV HUG APP)에서 제공하는 사용자(유저)ㆍ스마트 RV 컨트롤ㆍ숙박관리자ㆍ정박지ㆍ캠핑카(RV)소유주들의 이용 정보를 획득할 수 있는 각종 시스템을 이용할 수 있고, 알브이 허그 앱(10: RV HUG APP)으로 부터 할인권을 받는 것: 을 특징으로 하는 무선통신망을 기반으로 하는 캠핑카의 관제시스템."}
{"patent_id": "10-2021-0022180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 1에 있어서, 축제ㆍ리조트ㆍ레저업체ㆍ관광지ㆍ맛집과 제휴하는 제휴 정박지(50)는;관광지의 홍보, 레저업체에 의한 이용률을 증가, RV(캠핑카) 존에 따른 포인트를 제공 받는 것과;알브이 허그 앱(10: RV HUG APP)에서 제공하는 사용자(유저)ㆍ스마트 RV 컨트롤ㆍ숙박관리자ㆍ정박지ㆍ캠핑카(RV)소유주 들의 이용 정보를 획득할 수 있는 각종 시스템을 이용할 수 있고, 알브이 허그 앱(10: RV HUG APP)으로 부터 할인권을 받는 것: 을 특징으로 하는 무선통신망을 기반으로 하는 캠핑카의 관제시스템."}
{"patent_id": "10-2021-0022180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 1에 있어서, 개인 소유주 또는 렌트카 업체의 RV(캠핑카) 소유주(60)는;RV(캠핑카)를 이용하여 즐기면서 갈 수 있는 곳의 RV존(위치포인트)의 정보를 알브이 허그 앱(10: RV HUG APP)으로 부터 제공 및 공유 받는 것과;RV존(위치포인트)의 활용에 대한 수익의 창출 및, RV(캠핑카)의 정보를 공유하는 것: 을 특징으로 하는 무선통신망을 기반으로 하는 캠핑카의 관제시스템."}
{"patent_id": "10-2021-0022180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 1 또는 청구항 2 에 있어서, 알브이 허그 앱(10: RV HUG APP)은;포괄적인 레저ㆍ문화축제를 RV(캠핑카)와 연계되는 플랫폼과;상기 플랫폼은 레저자동차를 기반으로 하여 초기 활성화 시키는 것: 을 특징으로 하는 무선통신망을 기반으로하는 캠핑카의 관제시스템."}
{"patent_id": "10-2021-0022180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 2에 있어서, 통합Iot콘트롤시스템(100)은;캠핑카(2)의 내부에 장착되어 기기집단(140:140-1 ~ 140-n))의 각 기기를 통합 관리하는 메인콘트롤러(110)와;상기 메인콘트롤러(110)와 기기집단(140:140-1 ~ 140-n)의 각 기기에 장착되어 있는 표준센서데이터칩(130:130-1 ~ 130-n) 간의 작동환경을 설정하여 주는 스마트폰앱(120)과;상기 기기집단(140:140-1 ~ 140-n)의 각 기기에 장착되어 스마트폰앱(120)의 지시에 의해 기기집단(140:140-1 ~140-n)의 각 기기의 작동을 컨트롤하는 표준센서데이터칩(130:130-1 ~ 130-n)과;상기 메인콘트롤러(110)와 스마트폰앱(120) 및 스마트폰앱(120)과 표준센서데이터칩(130:130-1 ~ 130-n)간의 통신은 사물인터넷(Iot) 및 협대역 사물 인터넷(NB-Iot: NarrowBand-Internet of Things, 狹帶域事物-인터넷)과같은 무선통신망으로 이루어지는 것: 을 특징으로 하는 무선통신망을 기반으로 하는 캠핑카의 관제시스템."}
{"patent_id": "10-2021-0022180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "공개특허 10-2021-0105840-4-청구항 2에 있어서, 플랫폼 서비스용 서버구축시스템(200)은;응용프로그램이 실행될 수 있는 기초를 이루는 컴퓨터시스템에 근거리통신(LAN)에서 응용프로그램의 집약적인처리기능을 서비스하는 서브시스템을 구축하기 위한 플랫폼서비스를 위한 서버(210)를 구비한 것: 을 특징으로하는 무선통신망을 기반으로 하는 캠핑카의 관제시스템."}
{"patent_id": "10-2021-0022180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 10에 있어서, 서브시스템을 구축하기 위한 플랫폼서비스를 위한 서버(210)는;엘티이(LTE) 기술을 기반으로 무선통신망을 효율적으로 제공하는 저전력 광역 통신 표준 기술인 협대역 사물 인터넷(NB-Iot: NarrowBand-Internet of Things, 狹帶域事物-인터넷) 또는 상기 협대역 사물 인터넷(NB-Iot)과병행하여 라이센스대역 LPWA를 기반으로 하는 무선기술인 Cat-M1, 및 4G 이동통신기술인 LTE(Long TermEvolution)로 이루어진 사물인터넷 및 이동통신기술단계(220); 문자-영상-음향-비디오정보를 동시에 제공하는 멀티미디어 서비스인 웹(Web), 공유되어 사용될 목적으로 통합하여 관리되는 데이터의 집합인 데이터베이스(data base), 운영서버(Server)를 구축하는 Web, DB, 운영Server 구축단계(230); 이용자의 이용상태에 따라 부여되는 포인트(Point)를 제작하고 설치하는 포인트제작, 포인트설치 단계(240);스마트폰(또는 휴대폰)에 다운(Down) 받아 사용할 수 있는 응용프로그램인 앱(APP:application)을 업그레이드(Upgrade) 시키기 위한 컴퓨터 시스템인 플랫폼(Platform)으로 구성된 앱 업그레이드 플랫폼(APP UpgradePlatform)단계(250); 시범지역을 설정하고, 그 시범지역에서 초기에 사업을 운영하기 위한 시범지역 및 초기사업 운영단계(260)로 된것: 을 특징으로 하는 무선통신망을 기반으로 하는 캠핑카의 관제시스템."}
{"patent_id": "10-2021-0022180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 10에 있어서, 플랫폼 서비스용 서버구축시스템(200)은; 캠핑카(2)의 내부에 메인콘트롤러(110)와 스마트폰앱(120)에 의해 조작에 의해 작동되는 IP카메라(160)를 설치하여, 캠핑카(2)의 내부의 각종 장치들을 점검 및 컨트롤하는 홈 네트워크를 구현할 수 있도록 한 것: 을 특징으로 하는 무선통신망을 기반으로 하는 캠핑카의 관제시스템."}
{"patent_id": "10-2021-0022180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 2에 있어서, 공유플랫폼시스템(300)의 서버구축시스템은;호텔ㆍ컨텐츠(Contents)ㆍ렌트카(Rent-car)ㆍ부동산ㆍ음식점의 다양한 편의시설과 연동하고, 캠핑카 공유(렌터카), 개인크루(캠핑카 소유자)ㆍ캠핑포인트공유에 의해 공유경제의 비지니스를 실행하는 공유경제 비지니스 연동단계(320); 상기 공유경제 비지니스 연동단계(320)를 더욱 활성화 및 실현하기 위하여 웹(Web)을 확장하고 구축하는 웹(Web)확장구축단계(330); 상기 공유경제 비지니스와, 웹(Web)의 확장 및 구축에서 얻어지는 데이터(Dater)의 정보를 수집하고 공유하기위한 빅 데이터기반 정보수집과 공유하는 단계(340)로 이루지는 것: 을 특징으로 무선통신망을 기반으로 하는캠핑카의 관제시스템."}
{"patent_id": "10-2021-0022180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 2에 있어서, 공유플랫폼시스템(300)의 서버구축장치는; 공유플랫폼시스템(300)의 전체 시스템을 보여주는 홈(301);조작에 의해 완성된 플랫폼(Platform)에 의해 구축된 RV(레저차량: 캠핑카) 생태계를 실현할 수 있도록 하는 모공개특허 10-2021-0105840-5-터홈 스마트컨트롤러(302); 공유플랫폼시스템(300)의 사이트를 관장하는 사이트소개부(303-1), 캠핑 및 여행을 관장하는 캠핑 커뮤니티부(303-2), 캠핑카의 종류 및 구매 방법 등을 관장하는 캠핑카부(303-3)로 구성된 컨텐츠 플랫폼(303);중고캠핑카를 검색하고 이용 및 매물에 대한정보를 제공하는 중고캠핑카부(304-1)로 구성된 중고캠핑카 플랫폼(304); 캠핑포인트(장소)와 관련하는 각종 정보를 제공하고 공유하는 캠핑포인트부(305-1)와, 개인캠핑카 및 렌트캠핑카의 공유에 대한 정보와 숙박시설 및 특정지역의 패키지에 대한 정보를 제공 및 공유하도록 하는 캠핑카 공유부(305-2)로 구성된 공유플랫폼(305)으로 형성한 것: 을 특징으로 하는 무선통신망을 기반으로 하는 캠핑카의관제시스템."}
{"patent_id": "10-2021-0022180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "청구항 14에 있어서, 컨텐츠 플랫폼(303)에서, 사이트소개부(303-1)는;컨텐츠 플랫폼(303)의 사이트를 소개하는 기능;사이트를 이용하고 안내하는 기능;캠핑카를 이용하는 각종사업의 제휴를 소개 및 안내하는 사업제휴 기능을 구비한 것: 을 특징으로 하는 무선통신망을 기반으로 하는 캠핑카의 관제시스템."}
{"patent_id": "10-2021-0022180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "청구항 14에 있어서, 컨텐츠 플랫폼(303)에서 캠핑 및 여행을 관장하는 캠핑 커뮤니티부(303-2)는; 캠핑을 한 후에 그 캠핑에 대한 느낌과 감상 및 감정을 기록하는 캠핑칼럼;캠핑에 대한 재능을 기부하고 나누는 재능기부 및 나눔;여행지의 맛집을 소개하는 여행지 맛집;해외 캠핑에 대하여 안내 및 소개하는 해외캠핑;재난 시에 캠핑카의 참여 기부를 제공하는 팀 RVHUG;캠핑에 대한 글을 자유롭게 게시하여 공유하도록 하는 자유게시판으로 형성된 것: 을 특징으로 하는 무선통신망을 기반으로 하는 캠핑카의 관제시스템."}
{"patent_id": "10-2021-0022180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "청구항 14에 있어서, 컨텐츠 플랫폼(303)에서 캠핑 및 여행을 관장하는 캠핑 커뮤니티부(303-2)는;캠핑을 한 후에 그 캠핑에 대한 느낌과 감상 및 감정을 기록하는 캠핑칼럼;캠핑에 대한 재능을 기부하고 나누는 재능기부 및 나눔;여행지의 맛집을 소개하는 여행지 맛집, 해외 캠핑에 대하여 안내 및 소개하는 해외캠핑;재난 시에 캠핑카의 참여 기부를 제공하는 팀 RVHUG; 캠핑에 대한 글을 자유롭게 게시하여 공유하도록 하는 자유게시판으로 형성한 것: 을 특징으로 하는 무선통신망을 기반으로 하는 캠핑카의 관제시스템."}
{"patent_id": "10-2021-0022180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "청구항 14에 있어서, 컨텐츠 플랫폼(303)에서 캠핑카의 종류 및 구매 방법 등을 관장하는 캠핑카부(303-3)는;공개특허 10-2021-0105840-6-보유 또는 보유예정인 캠핑카(2)들에 대하여 소개하는 캠핑카소개;캠핑카의 제작을 의뢰에 대하여 소개 및 안내하는 맞춤형 캠핑카;캠핑카를 구매하고자 할 때에 필요한 자료 및 방법을 소개하는 구매방법;캠핑카에 대한 각종 정보를 얻고자 하는 고객에게 정보를 제공하는 고객센터로 구성한 것: 을 특징으로 하는 무선통신망을 기반으로 하는 캠핑카의 관제시스템."}
{"patent_id": "10-2021-0022180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "청구항 14에 있어서, 중고캠핑카 플랫폼(304)에서 중고캠핑카를 검색하고 이용 및 매물에 대한정보를 제공하는중고캠핑카부(304-1)는;매물로 나와 있는 각종 중고캠핑카를 검색하는 중고캠핑카 검색기능;중고캠핑카의 이용에 대한 정보를 제공 및 안내하는 중고캠핑카 안내기능;매물로 나와 있는 각종 중고캠핑카에 대하여 추천하고 기능을 인증하는 추천인증기능;중고캠핑카에 대한 각종 정보를 얻고자 하는 고객에게 정보를 제공하는 고객센터로 형성한 것: 을 특징으로 하는 무선통신망을 기반으로 하는 캠핑카의 관제시스템."}
{"patent_id": "10-2021-0022180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "청구항 14에 있어서, 공유 플랫폼(305)의 캠핑포인트 공유부(305-1)는;캠핑장소에 대하여 설명 및 안내하는 캠핑포인트안내기능;캠핑장소를 검색하고 공유하도록 안내하는 캠핑포인트검색기능;검색된 캠핑장소를 예약하는 캠핑포인트검색기능;사용한 캠핑장소를 이용한 후에 느낌과 특징을 기록하고 안내하는 이용후기기능;캠핑점수를 적립하고 적립된 캠핑점수를 적용하여 사용하도록 안내하는 적용분야기능으로 형성한 것: 을 특징으로 하는 무선통신망을 기반으로 하는 캠핑카의 관제시스템."}
{"patent_id": "10-2021-0022180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "청구항 14에 있어서, 공유 플랫폼(305)의 캠핑카 공유부(305-2)는;개인이 소유한 캠핑카를 공유할 수 있도록 정보를 제공하고 안내하는 개인캠핑카공유기능;캠핑카를 렌트하여 주는 렌트 업체의 종류와 각 렌트 업체가 소유하고 있는 각 캠핑카에 대하여 공유할 수 있도록 정보를 제공하고 공유하는 렌트캠핑카공유기능;호텔을 포함하는 숙박시설과 야놀자를 포함하는 놀이시설을 캠핑카를 이용하는 패키지와 연계시킬 수 있도록 소개하고 정보를 제공하여 주는 숙박시설 패키지연계기능;특화된 관광지역을 소개하고 안내하는 특정지역특화기능;캠핑카(개인 및 렌트)의 공유와 숙박시설 및 특정지역에 대한 각종 정보를 얻고자 하는 고객에게 정보를 제공하는 고객센터로 형성한 것: 을 특징으로 하는 무선통신망을 기반으로 하는 캠핑카의 관제시스템."}
{"patent_id": "10-2021-0022180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "청구항 2에 있어서, 온라인캠핑예약 및 이용시스템(400)은; 캠핑카(2)가 캠핑카의 주차구역인 캠핑포인트(410:410-1 ~ 410-n)로 진입하는 단계;공개특허 10-2021-0105840-7-캠핑포인트(410:410-1 ~ 410-n)의 특정(예약)된 캠핑포인트로 진입한 캠핑카(2)를 캠핑카인식센서(420)에 의해감지하여 인식하는 캠핑카인식단계;인식된 캠핑카(2)의 정보를 무선통신단말기(430)에 의해 중개수단(150)인 기지국(151) 및 인공위성(152)의 GPS에 의한 협대역 사물 인터넷(NB-Iot: NarrowBand-Internet of Things, 狹帶域事物-인터넷)과 같은 무선통신망을 통해 전송하는 정보전송단계;중개수단(150)인 협대역 사물 인터넷(NB-Iot)과 같은 무선통신망에 의해 전송되는 캠핑카(2)의 정보를 서버(170)에 저장하는 정보저장단계;서버(170)에 저장된 특정 캠핑포인트의 정보를 사용자의 스마트폰앱(120)에 포인트영상(121)으로 보여주는 디스플레이단계;캠핑카(2)가 캠핑포인트(410:410-1 ~ 410-n)에 진입하고 입회 및 퇴실하는 과정은 캠핑카입퇴실 실행상태의 계통도(500)에 의해 이루어진 것: 을 특징으로 하는 무선통신망을 기반으로 하는 캠핑카의 관제시스템."}
{"patent_id": "10-2021-0022180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "청구항 22에 있어서, 캠핑카(2)가 캠핑포인트(410:410-1 ~ 410-n)에 진입하고 입회 및 퇴실하는 과정을 보여주는 캠핑카입퇴실 실행상태의 계통도(500)는;캠핑카(2)가 캠핑포인트(410:410-1 ~ 410-n)중에서 예약 가능한 특정한 캠핑포인트를 특정한 표시등의 색상으로표시하여 주는 예약가능단계(510); 상기 예약가능단계(510)에 의해 검색된 특정의 캠핑포인트에 대하여 예약을 진행하게 되면 그 캠핑포인트를 표시하는 표시등의 색상을 특정한 색상으로 변경하여 표시하여 예약중임을 표시하여 주는 예약중 단계(520);상기 예약중 단계(520)에서 결제가 완료되면 그 캠핑포인트를 표시하는 표시등의 색상을 특정한 색상으로 변경시켜 사용중임을 표시하여 주는 사용중 단계(530); 상기 사용중 단계(530)에 의해 예약된 특정의 캠핑포인트에 캠핑카(2)가 진입하면 캠핑카진입감지센서가 캠핑카를 감지하는 RV 또는 오토캠핑진입단계(540);예약된 캠핑포인트의 입구측 개별바리게이트가 열려 캠핑카(2)를 진입시키면 그 캠핑포인트를 표시하는 표시등의 색상을 특정한 색상으로 변경시켜 캠핑카(2)인 차량이 진입되었음을 표시하는 차량진입단계(550); 예약된 캠핑포인트를 사용한 후에 이용시간 동안 배출된 쓰레기를 처리하여 인증하고 주변을 깨끗하게 정리하였음을 인증하는 사진을 전송하게 되는 이용시간 내 쓰레기배출인증/주변정리인증사진 전송단계(560);이용시간 내 쓰레기배출인증/주변정리인증사진 전송단계(560)에 의해 주차개별바리게이트가 열리게 되면 예약된캠핑포인트에서 캠핑카(2)를 빼낼 수 있는 퇴실단계(570); 상기 퇴실단계(570)에서 예약된 캠핑포인트에서 캠핑카(2)를 완전히 빼내게 되면 그 예약된 캠핑포인트의 입구에 설치된 캠핑카진입감지센서가 배출되는 캠핑카를 감지하게 되면 그 포인트를 표시하는 표시등의 색상을 특정한 색상으로 변경시켜 주는 포인트색상변경단계(580);상기 포인트색상변경단계(580)에서 예약된 캠핑포인트에서 캠핑카(2)를 완전히 빠져나가 표시등의 색상이 변경되면 사용자(캠핑카의 번호를 특정)의 성실 사용 여부를 평가하여 패널티를 부가하거나 또는 보너스를 제공할것인지의 여부를 판단하여 사용자에게 알리는 상호평가단계(590)로 이루어지는 것: 을 특징으로 하는 무선통신망을 기반으로 하는 캠핑카의 관제시스템."}
{"patent_id": "10-2021-0022180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "청구항 23에 있어서, 예약가능단계(510), 예약중 단계(520), 사용중 단계(530), 차량진입단계(550), 포인트색상변경단계(580)를 특정한 다른 색상으로 표시하여 주는 표시등의 색상은;예약가능단계(510)에서 표시등의 색상은 녹색인 것과; 공개특허 10-2021-0105840-8-예약중 단계(520)에서 표시등의 색상은 회색인 것과;사용중 단계(530)에서 표시등의 색상은 노란색인 것과;차량진입단계(550)에서 표시등의 색상이 하늘색인 것과;포인트색상변경단계(580)에서 표시등의 색상이 청색인 것: 을 특징으로 하는 무선통신망을 기반으로 하는 캠핑카의 관제시스템."}
{"patent_id": "10-2021-0022180", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명에 따른 포괄적인 레저와 문화 축제를 캠핑카(RV)와 연계하여 활성화할 수 있도록 된 무선통신망을 기반 으로 하는 캠핑카의 컨트롤시스템은, 사물인터넷(Internet of Things)을 기반으로 하여, 레저를 즐기고자 하는 일반 사용자(유저), 사물인터넷(IOT)을 이용하여 캠핑카(RV)를 제어하는 스마트 RV 컨트롤, 호텔ㆍ리조트ㆍ펜션 (뒷면에 계속)"}
{"patent_id": "10-2021-0022180", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 포괄적인 레저와 문화 축제를 캠핑카(RV)와 연계하여 활성화할 수 있도록 된 무선통신망을 기반으로 하는 캠핑카의 컨트롤시스템에 관한 것이다. 이를 좀 더 상세히 설명하면, 본 발명은, 사물인터넷(Internet of Things)을 기반으로하여, 레저를 즐기고자 하 는 일반 사용자(유저), 사물인터넷(IOT)를 이용하여 캠핑카(RV)를 제어하는 스마트 RV 컨트롤, 호텔ㆍ리조트ㆍ 펜션 등의 숙박관리자, 축제ㆍ리조트ㆍ레저업체ㆍ관광지ㆍ맛집 등과 제휴하는 정박지, 개인 소유주 또는 렌트카 업체 등의 캠핑카(RV) 소유주를 사물인터넷(Internet of Things)을 기반으로 하여 연계하는 알브이 허그 앱(RV HUG APP)으로 포괄적으로 관리하는 것을 특징으로 하는 무선통신망을 기반으로 하는 캠핑카의 관제시스템을 제 공하려는 것이다."}
{"patent_id": "10-2021-0022180", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "근자에 우리나라도 생활 및 여가 환경(여건) 등이 좋아지면서 여행을 많이 하고 있으며, 특히 캠핑카를 이용하 여 여행을 하는 캠핑 인구도 꾸준히 증가하고 있다. 캠핑카 및 RV 레저 자동차(이하 '캠핑카'로 통칭함)는 차량을 구입하는 구입비용과 유지 보수하는 유지보수비용 이 매우 높으며, 그로 인하여 캠핑카의 활용도(활용빈도)도 매우 제한적이며, 사용 및 활용의 편리함에도 개인 이 구입하여 사용하기에는 많은 부담과 제약이 따른다. 근자에는 캠핑카를 구입하여 대여하는 사업이 생겨 운영되고 있으나, 피 대여자(대여받는 사람)가 오프라인상의 영업점(대여자)을 직접 방문하여 캠핑카를 선택하고 대여받아 운행하도록 하는 방문 대여방법을 실행하고 있다. 그러나, 상기와 같은 방문 대여방법은 피 대여자(대여받는 사람)가 오프라인상의 대여자(영업점)를 직접 방문하 여야 하는 번거로움이 있고, 영업점(대여자)에서 자신이 여행하고자 하는 목적지까지 직접 운행하여야 하고, 그 에 따른 비용과 시간을 낭비하게 되는 폐단이 있으며, 반환시에는 대여받은 캠핑카를 영업점(대여자)까지 이동 시켜 반납하여야 하는 번거로움과 폐단이 있다. 또한, 영업점(대여자)은 다수의 캠핑카를 보유하고 있어야 대여를 다소 원활하게 실행할 수 있으나, 캠핑카의 특성상 캠핑카를 주차 시키기 위한 주차공간을 마련(확보)하여야 하는데 주차공간을 시내에 마련하는 데에는 경 제적 어려움이 있으며, 이러한 경제적 어려움을 극복하기 위하여 주차공간을 근교에 마련하게 되면 접근성이 현 저히 떨어지고 영업적으로 손실을 감수하여야한다. 상기와 같은 문제와 폐단을 해소할 수 있도록 하기 위한 여러 가지의 방법이 제안되고 있는데, 그 대표적인 것으로는 국내의 등록특허 제10-1074328호(캠핑카의 무인관리장치 및 이를 이용한 이동숙박서비스제공방법), 등록 특허 제10-1168081호(캠핑카의 위탁관리시스템 및 방법), 등록특허 제10-1593133호(여행콘텐츠 제공시스템 및 방법과 이를 지원하는 장치), 등록특허 제10-1918744호(캠핑차량 공유서비스제공시스템), 등록특허 제10- 2038012호(스마트 사물인터넷을 적용한 카라반 운영시스템) 등이 알려져있다. 또, 오토 캠핑을 위한 예약시스템으로는 국내의 등록특허 제10-1124477호(오토캠핑예약시스템)이 알려져있다. 등록특허 제10-1074328호(캠핑카의 무인관리장치 및 이를 이용한 이동숙박서비스제공방법)는, 캠핑카 대여를 위 한 대여비용의 현장결제를 수행하는 결제인터페이스 및 정산부, 외부로부터의 예약 및 대여결제 정보를 수집하 는 외부통신부로 이루어진 것이다. 그러나, 이는 무인으로 관리되는 무인관리장치를 캠핑카에 설치하여 대여 및 숙박 서비스를 관리인력 없이 실행 할 수 있도록 된 것으로서, 통상의 인터넷망을 이용하여 캠핑카에 설치된 무인관리장치에 의존하여 캠핑카의 대여 및 관리를 단순하게 실행이 이루어지도록 된 것에 불과하다. 등록특허 제10-1168081호(캠핑카의 위탁관리시스템 및 방법)는, 구입된 캠핑카를 위탁하는 소유자의 신상정보, 결제정보, 캠핑카의 차량정보, 위탁정보 데이터를 입력하는 위탁소유자 단말기와; 캠핑카를 임대받을 캠핑카의 차량정보, 신상정보, 결제정보 데이터를 입력하는 일반인 단말기와; 상기 위탁소유자 단말기 및 일반단말기로부 터 데이터를 입력받도록 인터넷망으로 연결되고, 이미 저장되어 있는 판매용 캠핑카 차량정보, 위탁중인 차량상 태정보, 위탁상황정보를 디스플레이하는 관리서버;를 포함하여 구성된 것이다. 그러나 이는, 캠핑카의 보관에서부터 임대를 통한 수익창출까지를 위탁에 의해 실시할 수 있도록 하여 캠핑카를 보관하여야 하는 넓은 주차공간을 필요하지 않도록 하여 누구나 손쉽게 캠핑카를 구입할 수 있도록 된 것으로서, 통상의 인터넷망을 이용하여 캠핑카 소유자의 정보와 위탁된 캠핑카의 각종 정보 및 임대받을 일반인 의 신상정보와 결제정보 등을 실행 처리하도록 된 것이다. 등록특허 제10-1593133호(여행콘텐츠 제공시스템 및 방법과 이를 지원하는 장치)는, 단말장치의 접속을 지원하 는 통신부; 일정지역에 포함된 복수의 여행지 정보에 해당하는 여행조각콘텐츠, 적어도 하나의 여행조각콘텐츠 로 구성된 여행경로콘텐츠, 상기 여행조각콘텐츠 및 여행경로콘텐츠를 테마별 또는 카테고리별로 포함하는 여행 콘텐츠 중에서 적어도 하나를 저장하는 저장부; 상기 여행조각콘텐츠 중에서 적어도 하나를 포함하는 웹페이지 를 단말기장치에 제공하는 제어부; 를 포함하는 것이다. 그러나, 이는 여행정보를 좀 용이하게 검색하고, 검색된 정보를 이용하여 적절한 형태의 여행을 좀 더 쉽게 간 편하게 설계할 수 있도록 된 것이다. 등록특허 제10-1918744호(캠핑차량 공유서비스제공시스템)는, 캠핑차량 소유자가 소유한 캠핑차량의 내외부사진, 차량모델명, 년식, 고유가능지역을 포함한 공유차량의 정보로서, 캠핑차량 공유중개서버에 등록하 는 소유자단말기; 캠핑차량소유자로부터 등록되는 공유캠핑차량정보들의 리스트인 공유캠핑차량리스트를 생성하 여 사용자단말기에 제공하며, 사용자로부터 캠핑에 이용하기로 결정한 선택된 캠핑차량을 등록한 캠핑차량소유 자에게 사용자 예약정보를 제공하는 캠핑차량공유중개서버; 및 상기 캠핑차량공유중개서버로부터 제공되는 공유 캠핑차량리스트 중에서 사용자로부터 선택된 고유정보차량정보, 캠핑카 사용일정이 포함된 사용자 예약정보를 캠핑차량공유중개서버로 제공하는 사용자단말기; 로 구성된 것이다. 그러나, 이는 캠핑차량을 공유하는 수단을 제공하려는 것으로서, 단지 캠핑을 즐기는 사용자의 편의성을 증대시 키고 캠핑카 소유자의 경제적 이익을 도모할 수 있도록 된 것이다. 등록특허 제10-2038012호(스마트 사물인터넷을 적용한 카라반 운영시스템)는, 조명과 조명센서, 도어락과 도어 락센서, GPS 및 실내외 촬영카메라가 내외측에 각각 설치되며, 카메라가 탑재된 드론, 드론충전겸용 드론착육장 및 접근감지센서가 루프에 각각 설치되고, 사물을 연동제어하는 제어부가 내측에 설치된 카라반; 사물정보를 수 신하여 모니터링하고, 상기 제어부로부터 제어정보를 수신하여 실시간 모니터링하고, 제어부로부터 사물정보에 상응하는 제어정보를 수집하여 분석하며 실시간 모니터링하고, 제어부에는 사물정보에 대한 제어정보를 송신하 여 사물을 원격통합관리하는 통합관리서버; 로 구성된 것이다. 그러나, 이는 스마트 사물인터넷을 적용하여 카라반에 설치된 사물을 사용자 단말기를 통해 통합제어 관리하고, 오작동 또는 위험요소를 감지하였을 때에 사용자 단말기로 통지하여 신속히 대처할 수 있도록 된 것으로서, 카 라반의 내외부에 설치된 각종 장치를 관리하도록 하는 것에 불과하다. 한편, 등록특허 제10-1124477호(오토 캠핑 예약시스템)는, 구획되지 않은 오토캠핑장을 예약할 수 있도록 하되, 캠핑장의 갯수정보 및 캠핑장 면적 정보 중에서 적어도 하나를 포함하는 캠핑 기본정보를 이용하여 오토캠핑장 의 형태를 설정해서 캠핑장 형태정보를 생성하는 생성부; 캠핑장 형태정보를 이용자 통신단말기로 전송하며, 예 약요청정보를 이용자 통신단말기로 수신하는 송수신부; 캠핑 기본 정보에 포함된 캠핑허용횟수의 정보 및 예약 요청정보에 포함된 예약횟수정보를 이용하여 예약처리횟수정보를 설정하며, 예약처리횟수정보를 이용하여 캠핑 허용횟수정보를 재설정하고, 예약요청정보를 이용하여 예약완료정보를 설정하는 예약관리부;로 구성된 것이다. 그러나, 이는 오토캠핑장의 구획되지 않은 캠핑장(면적) 중에서 자신이 필요로 하는 캠핑장의 면적을 설정하여 예약할 수 있도록 하는 것에 불과하다."}
{"patent_id": "10-2021-0022180", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 포괄적인 레저와 문화 축제를 캠핑카(RV)와 연계하여 활성화할 수 있도록 된 사물인터넷을 기반으로 하는 캠핑카의 컨트롤시스템을 제공하려는 것이다. 본 발명은, 사물인터넷(Internet of Things)과 을 기반으로 하여, 레저를 즐기고자 하는 일반 사용자(유저), 사 물인터넷(Iot)을 이용하여 캠핑카(RV)를 제어하는 스마트 RV 컨트롤, 호텔ㆍ리조트ㆍ펜션 등의 숙박관리자, 축 제ㆍ리조트ㆍ레저업체ㆍ관광지ㆍ맛집 등과 제휴하는 정박지, 개인 소유주 또는 렌트카 업체 등의 캠핑카(RV) 소 유주를 사물인터넷(Internet of Things)을 기반으로 하여 연계하는 알브이 허그 앱(RV HUG APP)으로 포괄적으로 관리하는 것을 특징으로 하는 사물인터넷을 기반으로 하는 캠핑카의 관제시스템을 제공하려는데 그 목적이 있다. 본 발명의 다른 목적은, 사물에 센서를 부착하여 일반 사용자(유저)ㆍ숙박관리자ㆍ정박지ㆍ캠핑카(RV) 소유주들 의 각종 데이터를 자율적이면서 실시간으로 주고받고 원격조정하는 등의 총괄적인 운영을 사물인터넷(Internet of Things)을 기반으로 하는 비대면 서비스에 의해 일괄적이면서 포괄적으로 실행할 수 있고, 스마트 컨트롤러 의 위치 확인 및 동의를 통한 빅데이터구축ㆍ캠핑장소와 레저 서비스ㆍ숙박 연계상품 등의 추천서비스와 할인제 도 등의 통합관리를 AI(인공지능: Artificial Intelligence)에 의해 자동으로 연계하여 실시할 수 있으며, 고객 이 캠핑카를 빌리기 전부터 반납 등의 일련의 모든 과정을 사물인터넷(Internet of Things)을 기반으로 하는 AI(인공지능: Artificial Intelligence)에 의해 일괄적으로 실시할 수 있도록 된 사물인터넷을 기반으로 하는 캠핑카의 관제시스템을 제공하려는데 있다."}
{"patent_id": "10-2021-0022180", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 상기 및 기타 목적은, 레저를 즐기고자 하는 일반 사용자(유저); 사물인터넷(IOT)을 이용하여 캠핑카(RV)를 제어하는 스마트 RV 컨트롤, 호텔ㆍ리조트ㆍ펜션 등의 숙박관리자; 축제ㆍ리조트ㆍ레저업체ㆍ관광지ㆍ맛집 등과 제휴하는 정박지; 개인 소유주 또는 렌트카 업체 등의 캠핑카(RV) 소유주; 를 사물인터넷(Internet of Things)을 기반으로 하여 연계하는 알브이 허그 앱(RV HUG APP)에 의해 이용에 대한 예약 및 정보를 포괄적으로 관리하는 것을 특징으로 하는 사물인터넷을 기반으로 하는 캠핑카의 관제시스템에 의해 달성된다."}
{"patent_id": "10-2021-0022180", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 포괄적인 레저와 문화 축제를 캠핑카(RV)와 연계하여 활성화할 수 있도록 된 무선통신망을 기반 으로 하는 캠핑카의 컨트롤시스템은, 사물인터넷(Internet of Things) 및 협대역 사물 인터넷(NB-Iot: NarrowBand-Internet of Things, 狹帶域事物- 인터넷)같은 무선통신망을 기반으로 하여, 레저를 즐기고자 하는 일반 사용자(유저), 사물인터넷(IOT)을 이용하 여 캠핑카(RV)를 제어하는 스마트 RV 컨트롤, 호텔ㆍ리조트ㆍ펜션 등의 숙박관리자, 축제ㆍ리조트ㆍ레저업체ㆍ 관광지ㆍ맛집 등과 제휴하는 정박지, 개인 소유주 또는 렌트카 업체 등의 캠핑카(RV) 소유주를 사물인터넷(Io t)을 기반으로 하여 연계하는 알브이 허그 앱(RV HUG APP)으로 포괄적으로 관리하는 것을 특징으로 한다. 본 발명은, 사물에 센서를 부착하여 일반 사용자(유저)ㆍ숙박관리자ㆍ정박지ㆍ캠핑카(RV) 소유주들의 각종 데이 터를 자율적이면서 실시간으로 주고받고 원격조정하는 등의 총괄적인 운영을 사물인터넷(Iot)을 기반으로 하는 비대면 서비스에 의해 일괄적이면서 포괄적으로 실행할 수 있고, 스마트 컨트롤러의 위치 확인 및 동의를 통한 빅데이터구축ㆍ캠핑장소와 레저 서비스ㆍ숙박 연계상품 등의 추천서비스와 할인제도 등의 통합관리를 AI(인공지 능: Artificial Intelligence)에 의해 자동으로 연계하여 실시할 수 있으며, 고객이 캠핑카를 빌리기 전부터 반 납 등의 일련의 모든 과정을 사물인터넷(Iot) 및 협대역 사물 인터넷(NB-Iot: NarrowBand-Internet of Things, 狹帶域事物-인터넷)같은 무선통신망을 기반으로 하는 AI(인공지능)에 의해 일괄적으로 실시할 수 있다."}
{"patent_id": "10-2021-0022180", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 상기 및 기타 목적과 특징은 첨부된 도면에 의거한 다음의 상세한 설명에 의해 더욱 명확하게 이해할 수 있을 것이다. 도 1 내지 도 10은 본 발명에 따른 무선통신망을 기반으로 하는 알브이 허그 앱의 컨트롤시스템의 구체적인 실현 예를 보인 예시도이다. 도 1a 및 도 1 b는 본 발명에 따른 무선통신망을 기반으로 하는 알브이 허그 앱의 컨트롤시스템을 각각 보인 계통도이고, 도 2와 도 3a 및 도 3b는 본 발명에 따른 무선통신망을 기반으로 하는 알브이 허그 앱의 컨트롤시 스템에서 통합 사물인터넷 컨트롤시스템을 보인 계통도와 작동관계 예시도 및 캠핑카의 내부에 설치되 고 표준센서데이터칩이 각각 설치되는 기기집단을 발췌하여 보인 예시도이다. 도 4와 도 5a 내지 도 5c는 본 발명에 따른 무선통신망을 기반으로 하는 알브이 허그 앱의 컨트롤시스템의 통합 사물 인터넷 컨트롤 시스템에서 플랫폼 서비스용 서버구축시스템을 발췌하여 보인 블록도와, 플랫폼 서 비스용 서버구축시스의 각기 다른 실시 예를 보인 계통도 및 운용상태를 보인 작동관계 예시도이다. 도 6과 도 7은 본 발명에 따른 무선통신망을 기반으로 하는 알브이 허그 앱의 컨트롤시스템의 통합사물 인터넷 컨트롤 시스템에서 공유플랫폼시스템을 발췌하여 보인 블록도와 구조 예시도이다. 도 8a 내지 도 8c와 도 9a 및 도 9b는 본 발명에 따른 무선통신망을 기반으로 하는 알브이 허그 앱의 컨트롤시 스템의 통합사물 인터넷 컨트롤 시스템에서 온라인 캠핑 예약 및 이용시스템을 보인 예시도와, 캠핑카 의 입실 및 퇴실 실행상태를 보인 계통도 및 실행 예시도이다. 도 10은 본 발명에 따른 무선통신망을 기반으로 하는 알브이 허그 앱의 컨트롤시스템의 통합사물 인터넷 컨트롤 시스템의 온라인 캠핑 예약 및 이용시스템에서 알브이허그앱에 따른 캠핑카의 입퇴실 실행상태를 보인 계통도이다. 본 발명에 따른 무선통신망을 기반으로 하는 알브이 허그 앱의 컨트롤시스템의 구성 및 작동관계를 설명한다. 도 1a는 본 발명에 따른 무선통신망을 기반으로 하는 알브이 허그 앱(RV HUG APP)의 컨트롤시스템을 보인 계 통도이다. 레저를 즐기고자 하는 일반 사용자(20: 유저); 사물인터넷(IOT)을 이용하여 캠핑카(RV)를 제어하는 스마트 RV 컨트롤, 회텔ㆍ리조트ㆍ펜션 등의 숙박관리자, 축제ㆍ리조트ㆍ레저업체ㆍ관광지ㆍ맛집 등과 제휴하는 제휴 정박지, 개인 소유주 또는 렌트카 업체 등의 RV(캠핑카) 소유주:를 사물인터넷(Internet of Things)을 기반으로 하여 연계하는 알브이 허그 앱(10: RV HUG APP)에 의해 포괄적으로 관리하도록 하는 것이 특징이다. 상기에서 레저를 즐기고자 하는 일반 사용자(20: 유저)에게는 레저ㆍ문화 등 포괄적으로 정보를 제공하고 분야 별로 회원가입ㆍ이용액 할인ㆍ쿠폰제공ㆍ우선 사용권 등의 각종 혜택을 부여하며, 휴대폰이나 스마트폰 등에 다 운받아서 사용할 수 있는 운영서비(Server)의 앱(APP: application)을 활성화 시키게 된다. 사물인터넷(IOT) 및 협대역 사물 인터넷(NB-Iot: NarrowBand-Internet of Things, 狹帶域事物-인터넷)같은 무 선통신망을 이용하여 RV(캠핑카)를 제어하는 스마트 RV 컨트롤에는 사물에 센서를 부착하여 실시간으로 데 이터를 주고받을 수 있도록 하는 위치기반 사물인터넷(IOT: Internet of things)컨트롤 제어기능을 제공하고, 레저의 이용에 따른 빅 데이터를 축적받게 된다. 호텔ㆍ리조트ㆍ펜션 등의 숙박관리자에게는, RV(캠핑카) 차량 이용자(소유자, 공유자)와 연계하여 RV(캠핑 카) 차량 이용자(소유자, 공유자)가 숙박시설을 이용할 수 있도록 하고, RV(캠핑카)존에 따른 위치포인트를 제 공하게 되며, 알브이 허그 앱(10: RV HUG APP)에서 제공하는 각종 시스템을 이용할 수 있도록 하며 뿐만 아니라 할인권도 제공하게 된다. 축제ㆍ리조트ㆍ레저업체ㆍ관광지ㆍ맛집 등과 제휴하는 제휴 정박지에는, 관광지를 홍보시켜 주고, 레저업체 에 의해 이용률을 증가시키게 되며, RV(캠핑카) 존에 따른 위치포인트를 제공하게 되며, 알브이 허그 앱(10: RV HUG APP)에서 제공하는 사용자(유저)ㆍ스마트 RV 컨트롤ㆍ숙박관리자ㆍ정박지ㆍ캠핑카(RV)소유주들의 이용 정보 를 획득할 수 있는 각종 시스템을 이용할 수 있고, 알브이 허그 앱(10: RV HUG APP)로 부터 할인권도 제공하게 된다. 개인 소유주 또는 렌트카 업체 등의 RV(캠핑카) 소유주에게는, RV(캠핑카)를 이용하여 즐기면서 갈 수 있는 곳의 RV존(위치포인트)의 정보를 제공 및 공유하고, 수익을 창출시켜 주며, RV(캠핑카)의 공유 정보 등을 게시 하여 준다. 상기에서 RV존(위치포인트)은 알브이 허그 앱(10: RV HUG APP)에서 제공하는 무선단말기를 통하여 실시간 예약 상황과 이용상황 및 결제정보 등 일괄적으로 관리할 수 있게 된다. 단, 부가서비스 포인트 제공자는 관리할 필 요가 없으며, 그에 따른 결제금액은 수수료 외에 캠핑장에 입금된다. 알브이 허그 앱(10: RV HUG APP)은, 포괄적인 레저ㆍ문화축제 등 RV(캠핑카)와 연계되는 플랫폼으로서, 상기 플 랫폼은 레저자동차를 기반으로 하여 초기 활성화 및 기폭제 역할을 하게 된다. 도 1 b는 본 발명에 따른 무선통신망을 기반으로 하는 알브이 허그 앱의 컨트롤시스템의 다른 실시 예를 보 인 계통도이다. 무선통신망을 이용하여 사용자(유저)ㆍ스마트 RV 컨트롤ㆍ숙박관리자ㆍ정박지ㆍ캠핑카(RV)소유주 등의 이용에 대한 정보를 포괄적으로 관리하는 알브이 허그 앱(10: RV HUG APP)을 기반으로 한다. 상기 알브이 허그 앱(10: RV HUG APP)을 기반으로 하여 캠핑카의 기기들을 통합관리하고, 각 기기들의 작동환경 설정 및 작동을 컨트롤하며, 각 기기들을 무선통신망에 의해 통신하는 통합Iot콘트롤시스템과; 응용프로그 램이 실행될 수 있는 기초를 이루는 컴퓨터시스템에 근거리통신(LAN)에서 응용프로그램의 집약적인 처리기능을 서비스하는 플랫폼 서비스용 서비스구축시스템; 및 사용자(유저)의 공유경제를 실행 및 활성화하는 서버구 축시스템, 및 캠핑ㆍ여행을 관장하고 구축된 캠핑카와 캠핑포인트(캠핑장소)에 대한 정보를 공유 및 제공하는 서버구축장치로 구성된 공유플랫폼시스템; 캠핑포인트(캠핑장소)의 이용에 대한 정보를 유무선통신망으로 실행하는 온라인 캠핑 예약 및 이용시스템을 통합 관리하는 것을 특징으로 한다. 상기에서 통합Iot콘트롤시스템은 도 2에 예시된 바와 같이, 캠핑카의 내부에 장착되어 기기집단 (140:140-1 ~ 140-n))의 각 기기를 통합 관리하는 메인콘트롤러와, 상기 메인콘트롤러와 기기집단 의 각 기기(140-1 ~ 140-n)에 장착되어 있는 표준센서데이터칩(130:130-1 ~ 130-n) 간의 작동환경을 설정 하여 주는 스마트폰앱과, 상기 기기집단의 각 기기(140-1 ~ 140-n)에 장착되어 스마트폰앱의 지 시에 의해 기기집단의 각 기기(140-1 ~ 140-n)의 작동을 컨트롤하는 표준센서데이터칩(130:130-1 ~ 130-n)과, 상기 메인콘트롤러와 스마트폰앱 및 스마트폰앱과 표준센서데이터칩(130:130-1 ~ 130- n)간의 통신은 사물인터넷(Iot)으로 이루어지는 것을 특징으로 한다. 상기에서 스마트폰앱을 통한 메인콘트롤러와 표준센서데이터칩(130:130-1 ~ 130-n)간의 작동은 작동 환경을 설정한 후에 사용하는 것을 원칙으로 하며, 제조회사가 다른 기기집단의 각 기기(140-1 ~ 140-n)라 할지라도 각 기기(140-1 ~ 140-n)에 표준센서데이터칩(130::130-1 ~ 130-n)을 장착한 후에 앱(APP:aplicatio n)을 통해 환경을 설정한 후에 사용하여야 한다. 도 3a와 도 3b는 본 발명에 따른 무선통신망을 기반으로 하는 알브이 허그 앱의 컨트롤시스템에서 도 2에 예 시된 통합Iot컨트롤시스템을 캠핑카의 내부에 설치한 상태를 보인 예시도이다. 캠핑카의 내부에서 일 측(바람직하게는 출입문 옆)에 메인콘트롤러를 설치하였고, 스마트폰앱의 조작에 의해 표준센서데이터칩(130:130-1 ~ 130-n)이 각각 장착되어 있는 기기집단의 유형 사물인 각 기기 (140-1 ~ 140-n) 즉, 메인등(140-1)ㆍ무드등(140-2)ㆍ주방등(140-3)ㆍ물펌프ㆍ텔레비전ㆍ배터리ㆍ냉장고(140- (n-2))ㆍ위성안테나(140-(n-1))ㆍ어닝등(140-n)을 상기 메인콘트롤러를 통한 무선통신에 의해 컨트롤할 수 있는 상태를 보인 것이다. 가령, 캠핑카의 내부에 설치된 기기집단의 유형 사물인 각 기기(140-1 ~ 140-n) 즉, 메인등(140-1)ㆍ무 드등(140-2)ㆍ주방등(140-3)ㆍ물펌프ㆍ텔레비전ㆍ배터리ㆍ냉장고(140-(n-2))ㆍ위성안테나(140-(n-1))ㆍ어닝등(1 40-n)을 스마트폰앱의 조작에 의해 컨트롤하는 것; 외부전원과 발전기가동 및 인버터 중에서 어느 하나를 ON 시키는 것에 의해 기기집단의 유형 사물인 각 기기(140-1 ~ 140-n)를 작동시키는 것; 그리고 캠핑카 의 차량상태를 점검 및 확인하는 것; 수위센서에 의해 수위를 감지하고, 저 수위일 경우에는 알람과 같은 알 림 수단이 자동으로 작동하여 외부에 알리도록 하는 것; 배터리의 충전 상태를 확인하여 설정 값 이하의 저(낮 은) 충전상태일 때에 알람과 같은 알림 수단이 자동으로 작동하여 외부에 알리는 것과, 동시에 발전기를 자동으 로 가동시켜 배터리를 충전시키도록 하는 것; 실내의 환경(온도와 습도 및 공기 청정도 등)을 감지(체크)하여 기기집단의 유형 사물인 각 기기(140-1 ~ 140-n)에서 에어컨ㆍ공기청정기 등을 선택적으로 가동시켜 준다. 도 4는 도 1b에 예시된 본 발명에 따른 무선통신망을 기반으로 하는 알브이 허그 앱의 컨트롤시스템에서 플 랫폼 서비스용 서버구축시스템을 보인 것이다. 상기 플랫폼 서비스용 서버구축시스템은 응용프로그램이 실행될 수 있는 기초를 이루는 컴퓨터시스템에 근 거리통신(LAN)에서 응용프로그램의 집약적인 처리기능을 서비스하는 서브시스템을 구축하기 위한 플랫폼서비스 를 위한 서버로 구비하였다. 서브시스템을 구축하기 위한 플랫폼서비스를 위한 서버는, 엘티이(LTE) 기술을 기반으로 사물 인터넷(Iot) 및 협대역 사물 인터넷(NB-Iot: NarrowBand-Internet of Things, 狹帶域事物-인터넷)같은 무선통신망을 효율적 으로 제공하는 저전력 광역 통신 표준 기술인 협대역 사물 인터넷(NB-Iot: NarrowBand-Internet of Things, 狹 帶域事物-인터넷) 또는 상기 협대역 사물 인터넷(NB-Iot)과 병행하여 라이센스대역 LPWA를 기반으로 하는 무선 기술인 Cat-M1, 및 4G 이동통신기술인 LTE(Long Term Evolution)로 이루어진 사물인터넷 및 이동통신기술단계 ; 문자-영상-음향-비디오정보를 동시에 제공하는 멀티미디어 서비스인 웹(Web), 공유되어 사용될 목적으로 통합하 여 관리되는 데이터의 집합인 데이터베이스(data base), 운영 서버(Server)를 구축하는 Web, DB, 운영Server 구 축단계; 이용자의 이용상태에 따라 부여되는 포인트(Point)를 제작하고 설치하는 Point제작, Point설치 단계; 스마트폰(또는 휴대폰) 등에 다운(Down) 받아 사용할 수 있는 응용프로그램인 앱(APP: application)을 업그레이 드(Upgrade) 시키기 위한 컴퓨터 시스템인 플랫폼(Platform)으로 구성된 APP Upgrade Platform 단계; 시범지역을 설정하고, 그 시범지역에서 초기에 사업을 운영하기 위한 시범지역 및 초기사업 운영단계;로 구성하였다. 5a 내지 도 5c는 본 발명에 따른 무선통신망을 기반으로 하는 알브이 허그 앱의 컨트롤시스템의 통합사물 인터 넷 컨트롤 시스템에서 도 4에 예시된 플랫폼 서비스용 서버구축시스템을 구체적으로 실현하기 위한 플 랫폼 서비스용 서버구축시스의 각기 다른 실시 예의 운용상태를 보인 작동관계 예시도이다. 캠핑카의 내부에는 메인콘트롤러를 장착하여 기기집단(140:140-1 ~ 140-n)의 각 기기를 통합 관리할 수 있도록 하였고, 스마트폰앱에 의해서는 상기 메인콘트롤러와 기기집단의 각 기기(140-1 ~ 140- n)에 장착되어 있는 표준센서데이터칩(130:130-1 ~ 130-n) 간의 작동환경을 설정하여 주도록 하였다. 상기 메인콘트롤러와 스마트폰앱 및 스마트폰앱과 표준센서데이터칩(130:130-1 ~ 130-n)간의 통 신은 중개수단인 기지국과 인공위성의 GPS에 의한 협대역 사물 인터넷(NB-Iot: NarrowBand- Internet of Things, 狹帶域事物-인터넷)과 같은 무선통신망에 의해 이루어지도록 하였다. 상기에서 스마트폰앱을 통한 메인콘트롤러와 표준센서데이터칩(130:130-1 ~ 130-n)간의 작동은 작동 환경을 설정한 후에 사용하는 것을 원칙으로 하며, 제조회사가 다른 기기집단의 각 기기(140-1 ~ 140-n)라 할지라도 각 기기(140-1 ~ 140-n)에 표준센서데이터칩(130::130-1 ~ 130-n)을 장착한 후에 앱(APP:aplicatio n)을 통해 환경을 설정한 후에 사용하여야 함은 당연하다. 특히, 캠핑카의 내부에는 메인콘트롤러와 스마트폰앱에 의해 조작에 의해 작동되는 IP카메라(16 0)를 설치하여 캠핑카의 내부의 각종 장치들을 점검하고 컨트롤하는 홈 네트워크를 구현할 수 있도록 하였다. 상기 IP카메라로 포착되는 모니터링영상은 스마트폰앱의 제1모니터링영상(121-1)과 제2모니터링 영상(121-2)으로 디스플레이되어 확인할 수 있도록 하였다. 도 6은 본 발명에 따른 무선통신망을 기반으로 하는 알브이 허그 앱의 컨트롤시스템의 통합사물 인터넷 컨트롤 시스템에서 공유플랫폼시스템의 서버구축시스템을 발췌하여 보인 블록도이다. 상기 공유플랫폼시스템은, 호텔ㆍ컨텐츠(Contents)ㆍ렌트카(Rent-car)ㆍ부동산ㆍ음식점 등의 다양한 편의 시설과 연동하고, 캠핑카 공유(렌터카, 개인크루(캠핑카 소유자)ㆍ캠핑포인트공유에 의해 공유경제의 비지니스 를 실행하는 공유경제 비지니스 연동단계; 상기 공유경제 비지니스 연동단계를 더욱 활성화 및 실현하기 위하여 웹(Web)을 확장하고 구축하는 웹 (Web)확장구축단계; 상기 공유경제 비지니스와, 웹(Web)의 확장 및 구축에서 얻어지는 데이터(Dater) 등의 정보를 수집하고 공유하 기 위한 빅데이터기반 정보수집과 공유하는 단계로 이루지는 것:을 특징으로 한다. 도 7은 본 발명에 따른 무선통신망을 기반으로 하는 알브이 허그 앱의 컨트롤시스템의 통합사물 인터넷 컨트롤 시스템에서 공유플랫폼시스템의 서버구축장치(구조)를 보인 예시도이다. 상기 공유플랫폼시스템에 의해 플랫폼(Platform)이 완성되면 RV(레저차량: 캠핑카) 생태계를 구축하고 실 현하게 된다. 공유플랫폼시스템은, 공유플랫폼시스템의 전체 시스템을 보여주는 홈; 조작에 의해 완성된 플랫폼(Platform)에 의해 구축된 RV(레저차량: 캠핑카) 생태계를 실현할 수 있도록 하는 모 터홈 스마트컨트롤러; 공유플랫폼시스템의 사이트를 관장하는 사이트소개부(303-1), 캠핑 및 여행을 관장하는 캠핑 커뮤니티부 (303-2), 캠핑카의 종류 및 구매 방법 등을 관장하는 캠핑카부(303-3)로 구성된 컨텐츠 플랫폼; 중고캠핑카를 검색하고 이용 및 매물에 대한정보를 제공하는 중고캠핑카부(304-1)로 구성된 중고캠핑카 플랫폼 ; 캠핑포인트(장소)와 관련하는 각종 정보를 제공하고 공유하는 캠핑포인트부(305-1)와, 개인캠핑카 및 렌트캠핑 카의 공유에 대한 정보와 숙박시설 및 특정지역의 패키지에 대한 정조를 제공 및 공유하도록 하는 캠핑카 공유 부(305-2)로 구성된 공유플랫폼으로 구성한 것을 특징으로 한다. 상기 공유플랫폼시스템의 컨텐츠 플랫폼에서, 사이트소개부(303-1)는, 컨텐츠 플랫폼의 사이트 를 소개하는 기능과 사이트를 이용 안내하는 기능 및 캠핑카를 이용하는 각종사업의 제휴를 소개 및 안내하는 사업제휴 기능을 구비하였다. 상기 공유플랫폼시스템의 컨텐츠 플랫폼에서 캠핑 및 여행을 관장하는 캠핑 커뮤니티부(303-2)는, 캠 핑을 한 후에 그 캠핑에 대한 느낌과 감상 및 감정을 기록하는 캠핑칼럼, 캠핑에 대한 재능을 기부하고 나누는 재능기부 및 나눔, 여행지의 맛집을 소개하는 여행지 맛집, 해외 캠핑에 대하여 안내 및 소개하는 해외캠핑, 재 난 시에 캠핑카의 참여 기부를 제공하는 팀 RVHUG, 캠핑에 대한 글을 자유롭게 게시하여 공유하도록 하는 자유게시판으로 형성하였다. 상기 공유플랫폼시스템의 컨텐츠 플랫폼에서 캠핑카의 종류 및 구매 방법 등을 관장하는 캠핑카부 (303-3)는, 보유 또는 보유예정인 캠핑카들에 대하여 소개하는 캠핑카소개, 캠핑카의 제작을 의뢰에 대하여 소개 및 안내하는 맞춤형 캠핑카, 캠핑카를 구매하고자 할 때에 필요한 자료 및 방법을 소개하는 구매방법, 캠 핑카에 대한 각종 정보를 얻고자 하는 고객에게 정보를 제공하는 고객센터로 형성하였다. 상기 공유플랫폼시스템의 중고캠핑카 플랫폼에서 중고캠핑카를 검색하고 이용 및 매물에 대한정보를 제공하는 중고캠핑카부(304-1)는, 매물로 나와 있는 각종 중고캠핑카를 검색하는 중고캠핑카 검색기능, 중고캠 핑카의 이용에 대한 정보를 제공 및 안내하는 중고캠핑카 안내기능, 매물로 나와 있는 각종 중고캠핑카에 대하 여 추천하고 기능을 인증하는 추천인증기능, 중고캠핑카에 대한 각종 정보를 얻고자 하는 고객에게 정보를 제공 하는 고객센터로 형성하였다. 상기 공유플랫폼시스템의 공유 플랫폼에서 캠핑포인트 공유부(305-1)와 캠핑카 공유(305-2)는 다음과 같이 형성하였다. 캠핑포인트공유부(305-1)는, 캠핑포인트에 대하여 설명하는 캠핑포인트안내기능, 캠핑포인트(캠핑장소)를 검색 하고 공유하도록 안내하는 캠핑포인트검색기능, 검색된 캠핑포인트(캠핑장소)를 예약하는 캠핑포인트검색기능, 사용한 캠핑포인트(캠핑장소)를 이용한 후에 느낌과 특징을 기록하고 안내하는 이용후기기능, 캠핑점수를 적립 하고 적립된 캠핑점수를 적용하여 사용하도록 안내하는 적용분야기능으로 형성하였다. 캠핑카 공유부(305-2)는, 개인이 소유한 캠핑카를 공유할 수 있도록 정보를 제공하고 안내하는 개인캠핑카공유 기능, 캠핑카를 렌트하여 주는 렌트 업체의 종류와 각 렌트 업체가 소유하고 있는 각 캠핑카에 대하여 공유할 수 있도록 정보를 제공하고 공유하는 렌트캠핑카공유기능, 호텔을 포함하는 숙박시설과 야놀자를 포함하는 놀이 시설 등을 캠핑카를 이용하는 패키지와 연계시킬 수 있도록 소개하고 정보를 제공하여 주는 숙박시설 패키지연 계기능, 제주도와 같이 특화된 관광지역을 소개하고 안내하는 특정지역특화기능, 캠핑카(개인 및 렌트)의 공유 와 숙박시설 및 특정지역에 대한 각종 정보를 얻고자 하는 고객에게 정보를 제공하는 고객센터로 형성하였다. 도 8a 내지 도 8c는 본 발명에 따른 무선통신망을 기반으로 하는 알브이 허그 앱의 컨트롤시스템의 통합사물 인 터넷 컨트롤 시스템에서 온라인 캠핑 예약 및 이용시스템을 보인 예시도이다. 상기 온라인 캠핑 예약 및 이용시스템에 대하여 설명한다. 캠핑카가 캠핑카의 주차구역인 캠핑포인트(410:410-1 ~ 410-n)로 진입하는 단계, 캠핑포인트(410:410-1 ~ 410-n)의 특정(예약)된 캠핑포인트로 진입한 캠핑카를 캠핑카인식센서에 의해 감지하여 인식하는 캠핑 카인식단계, 인식된 캠핑카의 정보를 무선통신단말기에서 중개수단인 기지국 및 인공위성 의 GPS에 의한 협대역 사물 인터넷(NB-Iot: NarrowBand-Internet of Things, 狹帶域事物-인터넷)과 같은 무선통신망에 의해 전송하는 정보전송단계, 중개수단인 협대역 사물 인터넷(NB-Iot)과 같은 무선통신망에 의해 전송되는 캠핑카의 정보를 서버에 저장하는 단계, 서버에 저장된 특정된 캠핑포인트의 정보 를 사용자의 스마트폰앱에 포인트영상으로 보여주는 디스플레이단계와, 캠핑카가 캠핑포인트 (410:410-1 ~ 410-n)에 진입하고 입회 및 퇴실하는 과정은 캠핑카입퇴실 실행계통도에 의해 이루지도록 하 였다. 도 9a 및 도 9b는 본 발명에 따른 무선통신망을 기반으로 하는 알브이 허그 앱의 컨트롤시스템의 통합사물 인터 넷 컨트롤 시스템의 온라인 캠핑 예약 및 이용시스템에서 캠핑카의 입실 및 퇴실 실행상태를 보여주 는 캠핑카입퇴실 실행계통도이다. 캠핑카가 캠핑포인트(410:410-1 ~ 410-n)에 진입하고 입회 및 퇴실하는 과정의 캠핑카입퇴실 실행계통도 는 다음과 같이 실행된다. 캠핑카가 캠핑포인트(410:410-1 ~ 410-n)중에서 예약 가능한 특정한 캠핑포인트를 표시등의 색상(예컨대 녹 색)으로 표시하여 주는 예약가능단계; 상기 예약가능단계에 의해 검색된 특정의 캠핑포인트에 대하여 예약을 진행하게 되면 그 캠핑포인트를 표 시하는 표시등의 색상이 특정한 색상(회색)으로 변경되어 예약중임을 표시하여 주는 예약중 단계; 상기 예약중 단계에서 결제가 완료되면 그 캠핑포인트를 표시하는 표시등의 색상이 특정한 색상(예컨대 노 란색)으로 변경되어 사용중임을 표시하여 주는 사용중 단계; 상기 사용중 단계에 의해 예약된 특정의 캠핑포인트에 캠핑카가 진입하면 캠핑카진입감지센서(구체적으 로 도시하지 아니함)가 캠핑카를 감지하는 RV 또는 오토캠핑진입단계; 상기 RV 또는 오토캠핑진입단계에서 특정(예약)된 캠핑포인트의 캠핑카진입감지센서(구체적으로 도시하지 아니함)가 캠핑카를 감지하면 캠핑카의 도착을 인증하고, 그 캠핑포인트(캠핑장소)의 입구측 개별바리게이트가 열리게 되면 캠핑카를 특정(예약)된 캠핑포인트로 진입시킨다. 예약하여 특정된 캠핑포인트(캠핑장소)의 입구측 개별바리게이트가 열려 캠핑카를 진입시키면 그 캠핑포인트 (캠핑장소)를 표시하는 표시등의 색상이 특정한 색상(예컨대 하늘색)으로 변경되어 캠핑카인 차량이 진입되 었음을 표시하는 차량진입단계; 상기 차량진입단계에서 캠핑카가 완전히 진입되면 캠핑카인식센서가 캠핑카를 인식하게 되고, 캠핑카인식센서에 캠핑카가 인식되면 열려있던 주차개별바리게이트가 닫히게 되며, 동시에 전기와 수도 의 사용이 가능하도록 셋팅 되는데, 이때에 주차개별바리게이트가 완전히 닫혀야만 전기/수도 사용 가능으로 셋 팅 된다. 상기 차량진입단계에서 캠핑카가 완전히 진입되면 캠핑카인식센서가 캠핑카를 인식한 후에 특 정(예약)된 캠핑포인트(캠핑장소)의 사용은 시작된다. 특정(예약)된 캠핑포인트(캠핑장소)를 사용한 후에 이용시간 동안 배출된 쓰레기를 처리하여 인증하고 주변을 깨끗하게 정리하였음을 인증하는 사진을 전송하게 되는 이용시간 내 쓰레기배출인증/주변정리인증사진 전송단계 ; 상기 이용시간 내 쓰레기배출인증/주변정리인증사진 전송단계에서 쓰레기배출상태 및 주변정리상태가 인증 되어야만 주차개별바리게이트가 열리게 된다. 이용시간 내 쓰레기배출인증/주변정리인증사진 전송단계에 의해 주차개별바리게이트가 열리게 되면 특정 (예약)된 캠핑포인트에서 캠핑카를 빼낼 수 있는 퇴실단계; 퇴실단계에 의해 특정(예약)된 캠핑포인트(캠핑장소)에서 캠핑카를 빼내게 되면 열려 있던 주차개별바 리게이트는 닫아지게 된다. 상기 퇴실단계에서 특정(예약)된 캠핑포인트(캠핑장소)에서 캠핑카를 완전히 빼내게 되면 그 특정(예약)된 캠핑포인트(캠핑장소)의 입구에 설치된 캠핑카진입감지센서(구체적으로 도시하지 아니함)가 배출 되는 캠핑카를 감지하게 되면 그 포인트를 표시하는 표시등의 색상(청색)이 변경되는 포인트색상변경단계; 상기 포인트색상변경단계에서 특정(예약)된 캠핑포인트(캠핑장소)에서 캠핑카를 완전히 빠져나가 표시 등의 색상(예컨대 청색)이 변경되면 사용자(캠핑카의 번호를 특정)의 성실 사용 여부를 평가하여 패널티를 부가 하거나 또는 보너스를 제공할 것인지의 여부를 판단하여 사용자에게 알리는 상호평가단계로 실시된다. 도 10은 본 발명에 따른 무선통신망을 기반으로 하는 알브이 허그 앱의 컨트롤시스템의 구체적인 실현 예를 보인 알브이 허그 앱의 컨트롤시스템 구현계통도이다. 본 발명에 따른 무선통신망을 기반으로 하는 알브이 허그 앱의 컨트롤시스템을 이용하게 되면, 알브이 허그 앱은 사물인터넷(Iot)의 전문업체와 제휴할 수 있으며, 알브이 허그 앱(610: RV HUG APP)을 사물인터넷 (Iot) 및 협대역 사물 인터넷(NB-Iot: NarrowBand-Internet of Things, 狹帶域事物-인터넷)같은 무선통신망의 전문업체와 제휴하게 되면, RV(레저자동차 즉, 캠핑카)의 예약을 비롯하여 휴가를 즐기는 RVER(캠핑카족)들 의 구매력(파워)을 기반으로 하여 레저업체와 축제, 지역사회, 유휴지, 식당, 온천, 문화 등의 캠핑카 정박지 를 이용하는 공유경제를 실현할 수 있다. 특히 관광지(맛집 등)는 레저업체 유휴지 등에 의해 안전한 캠핑카 정박지를 제공할 수 있고, 알브이 허그 앱(610: RV HUG APP)은 해당 관광지의 관광 및 특산물 등의 정보를 실시간으로 홍보할 수 있고, 캠핑카 정박지 에 설치된 무선통신단말기(구체적으로 도시하지 아니함)를 이용하여 알브이 허그 앱의 사용자(630: RV HUG APP USER)들에게 캠핑카에 대한 정보를 실시간으로 제공할 수 있게 된다. 또한, 해가 거듭될수록 RV산업이 급속도로 성장해 감에 따라 전기, 화재, 일산화탄소 등으로 인한 안전사고의 발생빈도가 증가함에 따라 알브이 허그 앱(610: RV HUG APP)을 통해 올바른 안전사고 예방법 알림을 제공하고, 안전사고 발생 즉시 선제적으로 대응할 수 있도록 캠핑카 정박지에 설치된 무선통신단말기(구체적으로 도 시하지 아니함)를 이용하여 알브이 허그 앱의 사용자(630: RV HUG APP USER)들에게 캠핑카에 대한 정보를 실시간으로 제공할 수 있게 된다. 본 발명은 기재된 구체적인 실시 예에 대하여서만 상세히 설명하였지만 본 발명의 기술사상범위 내에서 다양하 게 변형 및 수정할 수 있음은 당업자에게 있어 당연한 것이며, 이러한 변형 및 수정은 첨부된 특허청구범위에 속함은 당연하다 할 것이다."}
{"patent_id": "10-2021-0022180", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1a 및 도 1 b는 본 발명에 따른 무선통신망을 기반으로 하는 알브이 허그 앱의 컨트롤시스템을 각각 보인 계 통도. 도 2는 본 발명에 따른 무선통신망을 기반으로 하는 알브이 허그 앱의 컨트롤시스템에서 통합 사물인터넷 컨트롤 시스템을 보인 계통도. 도 3a 및 도 3b는 본 발명에 따른 무선통신망을 기반으로 하는 알브이 허그 앱의 컨트롤시스템에서 캠핑카의 내 부에 탑재된 통합사물 인터넷 컨트롤 시스템의 작동관계 예시도 및 캠핑카의 내부에 설치되고 표준센서데이터칩 이 각각 설치되는 기기집단을 발췌하여 보인 예시도. 도 4는 본 발명에 따른 무선통신망을 기반으로 하는 알브이 허그 앱의 컨트롤시스템의 통합사물 인터넷 컨트롤 시스템에서 플랫폼 서비스용 서버구축시스템을 발췌하여 보인 블록도. 도 5a와 도 5b 및 도 5c는 본 발명에 따른 무선통신망을 기반으로 하는 알브이 허그 앱의 컨트롤시스템의 통합 사물 인터넷 컨트롤 시스템에서 플랫폼 서비스용 서버구축시스의 각기 다른 실시 예를 보인 계통도 및 운용상태 를 보인 작동관계 예시도. 도 6은 본 발명에 따른 무선통신망을 기반으로 하는 알브이 허그 앱의 컨트롤시스템의 통합사물 인터넷 컨트롤 시스템에서 공유플랫폼시스템을 발췌하여 보인 블록도. 도 7은 본 발명에 따른 무선통신망을 기반으로 하는 알브이 허그 앱의 컨트롤시스템의 통합사물 인터넷 컨트롤 시스템에서 공유플랫폼시스템의 구조 예시도. 도 8a와 도 8b 및 도 8c는 본 발명에 따른 무선통신망을 기반으로 하는 알브이 허그 앱의 컨트롤시스템의 통합 사물 인터넷 컨트롤 시스템에서 온라인 캠핑 예약 및 이용시스템을 보인 예시도. 도 9a 및 도 9b는 본 발명에 따른 무선통신망을 기반으로 하는 알브이 허그 앱의 컨트롤시스템의 통합사물 인터 넷 컨트롤 시스템의 온라인 캠핑 예약 및 이용시스템에서 캠핑카의 입실 및 퇴실 실행상태를 보인 계통도 및 실 행 예시도. 도 10은 본 발명에 따른 무선통신망을 기반으로 하는 알브이 허그 앱의 컨트롤시스템의 구체적인 실현 예를 보 인 계통도."}
