{"patent_id": "10-2022-0096826", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0109072", "출원번호": "10-2022-0096826", "발명의 명칭": "CB　사 신용 평가 모델 생성 및 관리 자동화 방법 및 이러한 방법을 수행하는 장치", "출원인": "주식회사 에이젠글로벌", "발명자": "강정석"}}
{"patent_id": "10-2022-0096826", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "CB(credit bureau)사 신용 평가 모델 생성 및 관리 자동화 방법은, 인공 지능 엔진 생성부가 신용 평가를 위한 복수의 인공 지능 엔진을 생성하는 단계;신용 평가 모델 생성부가 상기 복수의 인공 지능 엔진을 기반으로 신용 평가 모델의 생성하는 단계;신용 평가부가 상기 신용 평가 모델을 기반으로 판매자에 대한 신용 평가 데이터를 생성하는 단계; 및신용 평가 모델 관리부가 상기 신용 평가 모델의 관리를 수행하는 단계를 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2022-0096826", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 신용 평가 모델 생성부는 후보 신용 평가 모델 생성부 및 신용 평가 모델 결정부를 포함하고, 상기 후보 신용 평가 모델 생성부는 상기 복수의 인공 지능 모델을 기반으로 한 인공 지능 모델의 조합을 기반으로 후보 신용 평가 모델을 생성하고,상기 신용 평가 모델 결정부는 상기 후보 신용 평가 모델이 상기 신용 평가부에서 사용 가능한 신용 평가 모델인지 여부를 결정하는 것을 특징을 하는 방법."}
{"patent_id": "10-2022-0096826", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서,상기 후보 신용 평가 모델 생성부는 인공 지능 엔진 결정부, 인공 지능 엔진 배치부, 신용 평가 데이터 생성부를 포함하고,상기 인공 지능 엔진 결정부는 상기 후보 신용 평가 모델에 포함될 적어도 하나의 인공 지능 엔진을 결정하고,상기 인공 지능 엔진 배치부는 상기 인공 지능 모델 결정부에 의해 결정된 상기 적어도 하나의 인공 지능 엔진을 배치하여 상기 후보 신용 평가 모델을 생성하고,상기 신용 평가 데이터 생성부는 상기 인공 지능 엔진 배치부에 의해 결정된 상기 후보 신용 평가 모델을 기반으로 신용 평가 데이터를 생성하고, 상기 복수의 인공 지능 엔진은 인공 지능 엔진(제1 타입) 및 인공 지능 엔진(제2 타입)을 포함하고,상기 인공 지능 엔진(제1 타입)은 전처리된 신용 평가 기초 데이터를 기반으로 하위 신용 평가 데이터를 결정하고, 상기 인공 지능 엔진(제2 타입)은 적어도 하나의 상기 인공 지능 엔진(제1 타입) 에 의해 생성된 상기 하위 신용 평가 데이터를 입력받고, 또 다른 하위 신용 평가 데이터를 결정하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2022-0096826", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "신용 평가 모델 생성 및 관리 자동화를 수행하는 CB(credit bureau)사 신용 평가 장치는, 신용 평가를 위한 복수의 인공 지능 엔진을 생성하도록 구현되는 인공 지능 엔진 생성부;상기 복수의 인공 지능 엔진을 기반으로 신용 평가 모델의 생성하도록 구현되는 신용 평가 모델 생성부;평가부가 상기 신용 평가 모델을 기반으로 판매자에 대한 신용 평가 데이터를 생성하도록 구현되는 신용평가부; 및상기 신용 평가 모델의 관리를 수행하도록 구현되는 신용 평가 모델 관리부를 포함하는 것을 특징으로 하는 CB공개특허 10-2023-0109072-3-사 신용 평가 장치."}
{"patent_id": "10-2022-0096826", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 신용 평가 모델 생성부는 후보 신용 평가 모델 생성부 및 신용 평가 모델 결정부를 포함하고, 상기 후보 신용 평가 모델 생성부는 상기 복수의 인공 지능 모델을 기반으로 한 인공 지능 모델의 조합을 기반으로 후보 신용 평가 모델을 생성하고,상기 신용 평가 모델 결정부는 상기 후보 신용 평가 모델이 상기 신용 평가부에서 사용 가능한 신용 평가 모델인지 여부를 결정하는 것을 특징을 하는 CB사 신용 평가 장치."}
{"patent_id": "10-2022-0096826", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5 항에 있어서,상기 후보 신용 평가 모델 생성부는 인공 지능 엔진 결정부, 인공 지능 엔진 배치부, 신용 평가 데이터 생성부를 포함하고,상기 인공 지능 엔진 결정부는 상기 후보 신용 평가 모델에 포함될 적어도 하나의 인공 지능 엔진을 결정하고,상기 인공 지능 엔진 배치부는 상기 인공 지능 모델 결정부에 의해 결정된 상기 적어도 하나의 인공 지능 엔진을 배치하여 상기 후보 신용 평가 모델을 생성하고,상기 신용 평가 데이터 생성부는 상기 인공 지능 엔진 배치부에 의해 결정된 상기 후보 신용 평가 모델을 기반으로 신용 평가 데이터를 생성하고, 상기 복수의 인공 지능 엔진은 인공 지능 엔진(제1 타입) 및 인공 지능 엔진(제2 타입)을 포함하고,상기 인공 지능 엔진(제1 타입)은 전처리된 신용 평가 기초 데이터를 기반으로 하위 신용 평가 데이터를 결정하고, 상기 인공 지능 엔진(제2 타입)은 적어도 하나의 상기 인공 지능 엔진(제1 타입) 에 의해 생성된 상기 하위 신용 평가 데이터를 입력받고, 또 다른 하위 신용 평가 데이터를 결정하는 것을 특징으로 하는 CB사 신용 평가 장치."}
{"patent_id": "10-2022-0096826", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 CB 사 신용 평가 모델 생성 및 관리 자동화 방법 및 이러한 방법을 수행하는 장치에 관한 것이다. CB(credit bureau)사 신용 평가 모델 생성 및 관리 자동화 방법은 인공 지능 엔진 생성부가 신용 평가를 위한 복 수의 인공 지능 엔진을 생성하는 단계, 신용 평가 모델 생성부가 복수의 인공 지능 엔진을 기반으로 신용 평가 모델의 생성하는 단계, 신용 평가부가 신용 평가 모델을 기반으로 판매자에 대한 신용 평가 데이터를 생성하는 단계와 신용 평가 모델 관리부가 신용 평가 모델의 관리를 수행하는 단계를 포함할 수 있다."}
{"patent_id": "10-2022-0096826", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 CB 사 신용 평가 모델 생성 및 관리 자동화 방법 및 이러한 방법을 수행하는 장치에 관한 것이다. 보다 상세하게는 신용 평가사들에서 신용 평가 모델을 생성하고, 생성된 신용 평가 모델에 대한 관리를 수행하 기 위한 CB 사 신용 평가 모델 생성 및 관리 자동화 방법 및 이러한 방법을 수행하는 장치에 관한 것이다."}
{"patent_id": "10-2022-0096826", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "4차 산업혁명에 의해 촉발된 지능 정보 사회로 진입하면서 데이터의 무한한 활용 가능성이 데이터 산업의 변화 를 초래하고 있다. 데이터 시대가 도래함에 따라 향후 데이터 산업의 수준이 국가 사이에 경쟁력의 차이를 결정 하게 될 것이다. 특히, 금융 시장에서의 빅데이터 인프라 구축은 매우 시급할 뿐만 아니라, 머지 않아 국가의 데이터 산업의 향 방을 좌우할만큼 중요한 자산이 되었다. 금융 빅데이터 인프라는 빅데이터 개방 시스템, 데이터 거래소, 데이터 전문기관 등으로 구성된다. 이러한 빅데이터 기반의 사용자 금융 데이터를 기반으로 한 새로운 금융 상품에 대한 연구가 필요하다. 사용자 금융 상품에 대한 인공 지능 기반의 학습을 통해 다양한 리스크 분석이 가능하고, 리스크 분석을 기반으로 현재 까지 없었던 새로운 금융 서비스를 사용자들에게 제공할 수 있다. 따라서, 사용자의 금융 데이터를 활용하고 사용자의 금융 데이터를 기반으로 다양한 금융 서비스를 제공하기 위"}
{"patent_id": "10-2022-0096826", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "한 구체적인 방법에 대한 연구가 필요하다.발명의 내용"}
{"patent_id": "10-2022-0096826", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상술한 문제점을 모두 해결하는 것을 그 목적으로 한다. 또한, 본 발명은, 신용 평가사에서 판매자의 신용 평가를 위한 신용 평가 모델을 생성하여 판매자마다 적응적인 신용 평가를 통해 금융 서비스를 제공하는 것을 목적으로 한다. 또한, 본 발명은, 생성된 신용 평가 모델에 대한 지속적인 평가를 통해 신용 평가 모델의 쉬프팅 또는 교체를 수행하여 시간에 따라 변화되는 신용 평가 결과를 적응적으로 반영하여 금융 서비스를 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2022-0096826", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위한 본 발명의 대표적인 구성은 다음과 같다. 본 발명의 일 실시예에 따르면, CB(credit bureau)사 신용 평가 모델 생성 및 관리 자동화 방법은 인공 지능 엔 진 생성부가 신용 평가를 위한 복수의 인공 지능 엔진을 생성하는 단계, 신용 평가 모델 생성부가 상기 복수의 인공 지능 엔진을 기반으로 신용 평가 모델의 생성하는 단계, 신용 평가부가 상기 신용 평가 모델을 기반으로 판매자에 대한 신용 평가 데이터를 생성하는 단계와 신용 평가 모델 관리부가 상기 신용 평가 모델의 관리를 수 행하는 단계를 포함할 수 있다. 한편, 상기 신용 평가 모델 생성부는 후보 신용 평가 모델 생성부 및 신용 평가 모델 결정부를 포함하고, 상기 후보 신용 평가 모델 생성부는 상기 복수의 인공 지능 모델을 기반으로 한 인공 지능 모델의 조합을 기반으로 후보 신용 평가 모델을 생성하고, 상기 신용 평가 모델 결정부는 상기 후보 신용 평가 모델이 상기 신용 평가부 에서 사용 가능한 신용 평가 모델인지 여부를 결정할 수 있다. 또한, 상기 후보 신용 평가 모델 생성부는 인공 지능 엔진 결정부, 인공 지능 엔진 배치부, 신용 평가 데이터 생성부를 포함하고, 상기 인공 지능 엔진 결정부는 상기 후보 신용 평가 모델에 포함될 적어도 하나의 인공 지 능 엔진을 결정하고, 상기 인공 지능 엔진 배치부는 상기 인공 지능 모델 결정부에 의해 결정된 상기 적어도 하 나의 인공 지능 엔진을 배치하여 상기 후보 신용 평가 모델을 생성하고, 상기 신용 평가 데이터 생성부는 상기 인공 지능 엔진 배치부에 의해 결정된 상기 후보 신용 평가 모델을 기반으로 신용 평가 데이터를 생성하고, 상 기 복수의 인공 지능 엔진은 인공 지능 엔진(제1 타입) 및 인공 지능 엔진(제2 타입)을 포함하고, 상기 인공 지 능 엔진(제1 타입)은 전처리된 신용 평가 기초 데이터를 기반으로 하위 신용 평가 데이터를 결정하고, 상기 인 공 지능 엔진(제2 타입)은 적어도 하나의 상기 인공 지능 엔진(제1 타입) 에 의해 생성된 상기 하위 신용 평가 데이터를 입력받고, 또 다른 하위 신용 평가 데이터를 결정할 수 있다. 본 발명의 다른 실시예에 따르면, 신용 평가 모델 생성 및 관리 자동화를 수행하는 CB(credit bureau)사 신용 평가 장치는 신용 평가를 위한 복수의 인공 지능 엔진을 생성하도록 구현되는 인공 지능 엔진 생성부, 상기 복 수의 인공 지능 엔진을 기반으로 신용 평가 모델의 생성하도록 구현되는 신용 평가 모델 생성부, 평가부가 상기 신용 평가 모델을 기반으로 판매자에 대한 신용 평가 데이터를 생성하도록 구현되는 신용 평가부와 상기 신용 평가 모델의 관리를 수행하도록 구현되는 신용 평가 모델 관리부를 포함할 수 있다. 한편, 상기 신용 평가 모델 생성부는 후보 신용 평가 모델 생성부 및 신용 평가 모델 결정부를 포함하고, 상기 후보 신용 평가 모델 생성부는 상기 복수의 인공 지능 모델을 기반으로 한 인공 지능 모델의 조합을 기반으로 후보 신용 평가 모델을 생성하고, 상기 신용 평가 모델 결정부는 상기 후보 신용 평가 모델이 상기 신용 평가부 에서 사용 가능한 신용 평가 모델인지 여부를 결정할 수 있다. 또한, 상기 후보 신용 평가 모델 생성부는 인공 지능 엔진 결정부, 인공 지능 엔진 배치부, 신용 평가 데이터 생성부를 포함하고, 상기 인공 지능 엔진 결정부는 상기 후보 신용 평가 모델에 포함될 적어도 하나의 인공 지 능 엔진을 결정하고, 상기 인공 지능 엔진 배치부는 상기 인공 지능 모델 결정부에 의해 결정된 상기 적어도 하 나의 인공 지능 엔진을 배치하여 상기 후보 신용 평가 모델을 생성하고, 상기 신용 평가 데이터 생성부는 상기 인공 지능 엔진 배치부에 의해 결정된 상기 후보 신용 평가 모델을 기반으로 신용 평가 데이터를 생성하고, 상 기 복수의 인공 지능 엔진은 인공 지능 엔진(제1 타입) 및 인공 지능 엔진(제2 타입)을 포함하고, 상기 인공 지 능 엔진(제1 타입)은 전처리된 신용 평가 기초 데이터를 기반으로 하위 신용 평가 데이터를 결정하고, 상기 인 공 지능 엔진(제2 타입)은 적어도 하나의 상기 인공 지능 엔진(제1 타입) 에 의해 생성된 상기 하위 신용 평가데이터를 입력받고, 또 다른 하위 신용 평가 데이터를 결정할 수 있다."}
{"patent_id": "10-2022-0096826", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하면, 신용 평가사에서 판매자의 신용 평가를 위한 신용 평가 모델을 생성하여 판매자마다 적응적 인 신용 평가를 통해 금융 서비스가 제공될 수 있다. 또한, 본 발명에 의하면, 생성된 신용 평가 모델에 대한 지속적인 평가를 통해 신용 평가 모델의 쉬프팅 또는 교체를 수행하여 시간에 따라 변화되는 신용 평가 결과를 적응적으로 반영하여 금융 서비스가 제공될 수 있다."}
{"patent_id": "10-2022-0096826", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "후술하는 본 발명에 대한 상세한 설명은, 본 발명이 실시될 수 있는 특정 실시예를 예시로서 도시하는 첨부 도 면을 참조한다. 이러한 실시예는 당업자가 본 발명을 실시할 수 있기에 충분하도록 상세히 설명된다. 본 발명의 다양한 실시예는 서로 다르지만 상호 배타적일 필요는 없음이 이해되어야 한다. 예를 들어, 본 명세서에 기재되 어 있는 특정 형상, 구조 및 특성은 본 발명의 정신과 범위를 벗어나지 않으면서 일 실시예로부터 다른 실시예 로 변경되어 구현될 수 있다. 또한, 각각의 실시예 내의 개별 구성요소의 위치 또는 배치도 본 발명의 정신과 범위를 벗어나지 않으면서 변경될 수 있음이 이해되어야 한다. 따라서, 후술하는 상세한 설명은 한정적인 의미 로서 행하여 지는 것이 아니며, 본 발명의 범위는 특허청구범위의 청구항들이 청구하는 범위 및 그와 균등한 모 든 범위를 포괄하는 것으로 받아들여져야 한다. 도면에서 유사한 참조부호는 여러 측면에 걸쳐서 동일하거나 유 사한 구성요소를 나타낸다."}
{"patent_id": "10-2022-0096826", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이하에서는, 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자가 본 발명을 용이하게 실시할 수 있도록 하 기 위하여, 본 발명의 여러 바람직한 실시예에 관하여 첨부된 도면을 참조하여 상세히 설명하기로 한다. 도 1은 본 발명의 실시예에 따른 CB(credit bureau)사 신용 평가 장치를 나타낸 개념도이다. 도 1에서는 신용 평가사인 CB사가 판매자의 신용 평가를 수행하기 위한 신용 평가 모델을 생성하고 신용 평가 모델의 관리를 자동화하기 위한 신용 평가 장치가 개시된다. 도 1을 참조하면, CB사 신용 평가 장치는 인공 지능 엔진 생성부, 신용 평가 모델 생성부, 신용 평가 부 및 신용 평가 모델 관리부 및 프로세서를 포함할 수 있다. 인공 지능 엔진 생성부는 신용 평가를 위한 다양한 인공 지능 엔진을 생성하기 위해 구현될 수 있다. 신용 평가 데이터를 결정하기 위해서는 다양한 하위 신용 평가 데이터를 생성하는 개별적인 인공 지능 엔진이 활용될 수 있다. 인공 지능 엔진 생성부는 신용 평가 데이터를 결정하기 위해 기초가 되는 다양한 하위 신용 평가 데이터를 생성할 수 있는 인공 지능 엔진을 생성할 수 있다. 인공 지능 엔진 생성부에 의해 생성된 인공 지능 엔진은 신용 평가 모델 생성부로 전달되어 신용 평 가 모델의 생성을 위해 활용될 수 있다. 신용 평가 모델 생성부는 신용 평가 모델의 생성을 위해 구현될 수 있다. 신용 평가 모델은 판매자의 신용 평가 데이터를 생성하기 위한 모델일 수 있다. 신용 평가 모델은 복수의 인공 지능 엔진과 복수의 신용 평가를 위한 알고리즘을 기반으로 구현될 수 있다. 신 용 평가 모델은 신용 평가를 위한 전처리 신용 평가 기초 데이터를 수신하여 판매자에 대한 신용 평가 데이터를생성할 수 있다. 신용 평가 모델 생성부는 후보 신용 평가 모델 생성부 및 신용 평가 모델 결정부를 포함할 수 있다. 후보 신용 평가 모델 생성부는 인공 지능 엔진 결정부, 인공 지능 엔진 배치부, 신용 평가 데이 터 생성부를 포함할 수 있다. 인공 지능 엔진 결정부는 후보 신용 평가 모델에 포함될 적어도 하나의 인공 지능 엔진을 결정하기 위해 구현될 수 있다. 후보 신용 평가 모델은 복수의 인공 지능 엔진을 기반으로 신용 평가 데이터를 생성할 수 있고, 인공 지능 엔진 결정부는 후보 신용 평가 모델을 생성하기 위한 적어도 하나의 인공 지능 엔진을 결 정할 수 있다. 인공 지능 모델 배치부는 인공 지능 모델 결정부에 의해 결정된 인공 지능 엔진을 배치하여 후보 신 용 평가 모델을 생성하기 위해 구현될 수 있다. 복수의 인공 지능 엔진 각각은 순차적 또는 병렬적으로 배치되 어 복수의 하위 신용 평가 데이터를 생성하고, 복수의 하위 신용 평가 데이터가 종합되어 신용 평가 데이터가 결정될 수 있다. 예를 들어, 복수의 인공 지능 엔진 각각은 병렬적으로 배치되어 하위 신용 평가 데이터를 생성하고, 하위 신용 평가 데이터를 기반으로 판매자의 신용 평가 데이터가 결정될 수 있다. 또는 복수의 인공 지능 엔진이 계층적 (또는 순차적)으로 배치되어 하위 신용 평가 데이터를 생성하고, 계층적으로 생성되는 n차 하위 신용 평가 데이 터를 기반으로 판매자의 신용 평가 데이터가 결정될 수 있다. 또는 특정 인공 지능 엔진에서 생성된 결과가 다 른 인공 지능 엔진으로 입력되는 구조의 신용 평가 데이터를 생성하기 위한 후보 신용 평가 모델이 결정될 수도 있다. 따라서, 인공 지능 모델 배치부는 신용 평가 데이터를 생성하기 위해 적절한 인공 지능 엔진의 배치 를 기반으로 후보 신용 평가 모델을 결정할 수 있다. 신용 평가 데이터 생성부는 인공 지능 엔진 배치부에 의해 결정된 후보 신용 평가 모델을 기반으로 신용 평가 데이터를 생성하기 위해 구현될 수 있다. 신용 평가 모델 결정부는 후보 신용 평가 모델 생성부에 의해 생성된 복수의 후보 신용 평가 모델 중 신용 평가에 임계 신뢰도를 가지는 모델을 신용 평가 모델로서 결정하기 위해 구현될 수 있다. 신용 평가 모델 생성부에 의해 생성된 후보 신용 평가 모델 중 신용 평가를 위해 사용될 신용 평가 모델은 신용 평가부 로 전송될 수 있다. 신뢰도는 기존의 신용 평가 기초 데이터를 기반으로 한 후보 신용 평가 모델의 신용 평가 결과와 실제 금융 서비스 결과의 비교를 통해 판단될 수 있다. 후보 신용 평가 모델의 신용 평가 결과와 실제 금융 서비스 결과가 상대적으로 유사할수록 후보 신용 평가 모델이 상대적으로 더 높은 신뢰도를 가지는 것으로 결정될 수 있다. 신용 평가부는 신용 평가 모델 생성부에 의해 생성된 신용 평가 모델을 기반으로 판매자에 대한 신용 평가 데이터를 생성하기 위해 수행할 수 있다. 신용 평가부는 적어도 하나의 신용 평가 모델을 사용하여 판매자에 대한 신용 평가를 통해 신용 평가 데이 터를 생성할 수 있다. 신용 평가부에 위치한 적어도 하나의 신용 평가 모델은 평가에 의해 교체되거나 조 합되어 판매자의 신용 평가 데이터를 결정하기 위해 활용될 수 있다. 또한, 신용 평가부는 신용 평가 대상에 따라 적응적으로 적용 가능한 다양한 신용 평가 모델을 포함할 수 있고, 이러한 다양한 신용 평가 모델을 기반으로 판매자 특성을 고려한 신용 평가 데이터가 생성될 수 있다. 신용 평가 모델 관리부는 신용 평가 모델의 관리를 위해 구현될 수 있다. 신용 평가부의 신용 평가 모델은 주기적/비주기적 평가에 의해 교체될 수 있다. 신용 평가 모델 관리부는 현재 신용 평가부에 서 사용되는 신용 평가 모델을 판단하고, 신용 평가 모델의 교체 여부를 결정할 수 있다. 또는 신용 평가 모델 관리부는 신용 평가부의 신용 평가 모델의 교체가 아닌 결과값의 일부 보정(또 는 쉬프팅)을 수행할지 여부에 대해서도 결정하고 보정값(또는 쉬프팅값)을 신용 평가부에 전송할 수도 있 다. 예를 들어, 신용 평가부의 신용 평가 모델의 예측 결과와 실제 금융 서비스 결과의 오차가 보정값을 기반으로 좁혀질 수 있는 경우, 신용 평가 모델 관리부는 신용 평가 모델의 예측 결과를 보정할 보정값을 결정하여 신용 평가부로 전달할 수 있다. 프로세서는 인공 지능 엔진 생성부, 신용 평가 모델 생성부, 신용 평가부 및 신용 평가 모 델 관리부의 동작을 제어하기 위해 구현될 수 있다. 도 2는 본 발명의 실시예에 따른 인공 지능 엔진 생성부의 동작을 나타낸 개념도이다. 도 2에서는 인공 지능 엔진 생성부에서 신용 평가를 위한 인공 지능 엔진을 생성하는 방법이 개시된다. 도 2를 참조하면, 인공 지능 엔진 생성부는 신용 평가 모델에 포함되는 인공 지능 엔진을 생성하기 위해 구현될 수 있다. 인공 지능 엔진은 전처리 신용 평가 기초 데이터를 입력값으로 수신하고, 판매자의 신용 평가 데이터를 결정하 기 위한 하위 신용 평가 데이터를 생성하기 위해 구현될 수 있다. 인공 지능 엔진 생성부는 후보 인공 지능 엔진 생성부, 신뢰도 판단부, 인공 지능 엔진 결정부 를 포함할 수 있다. 후보 인공 지능 엔진 생성부는 후보 신용 평가 모델에 포함될 후보 인공 지능 엔진을 생성하기 위해 구현 될 수 있다. 후보 인공 지능 엔진 생성부는 업데이트 인공 지능 엔진 생성부와 신규 인공 지능 엔진 생성부를 포함할 수 있다. 업데이트 인공 지능 엔진 생성부는 기존의 사용되던 인공 지능 엔진에 새로운 학습 데이터 또는 새로운 피 드백 데이터를 기반으로 인공 지능 학습을 재수행하여 업데이트된 인공 지능 엔진을 후보 인공 지능 엔진으로서 생성하기 위해 구현될 수 있다 업데이트 인공 지능 엔진 생성부는 신규 데이터 데이터베이스, 피드백 데이터 데이터베이스, 업 데이트 주기 결정부를 포함할 수 있다. 신규 데이터 데이터베이스는 새롭게 입력되는 신용 평가 기초 데이터를 저장하는 데이터베이스일 수 있다. 피드백 데이터 데이터베이스는 기존에 생성된 인공 지능 엔진과 관련된 피드백 데이터를 저장하는 데이터 베이스일 수 있다. 업데이트 주기 결정부는 인공 지능 엔진에 대한 업데이트 주기를 결정하기 위해 구현될 수 있다. 업데이트 주기 결정부는 미리 설정된 주기를 기준으로 추가적인 학습 데이터를 통해 업데이트를 결정할 수 있다. 또 한, 업데이트 주기 결정부는 신규로 입력된 신용 평가 기초 데이터, 피드백 데이터의 특성을 고려하여 업 데이트 주기를 결정할 수도 있다. 예를 들어, 데이터베이스에 저장된 신용 평가 기초 데이터, 피드백 데이터가 기존의 학습에 사용된 데이터와 상대적으로 유사도가 높은 경우, 업데이트 주기는 상대적으로 길게 설정될 수 있다. 반대로, 데이터베이스에 저장된 신용 평가 기초 데이터, 피드백 데이터가 기존의 학습에 사용된 데이터와 상대적으로 유사도가 낮은 경우, 업데이트 주기는 상대적으로 짧게 설정될 수 있다. 신규 인공 지능 엔진 생성부는 새로운 인공 지능 엔진으로서 인공 지능 학습을 통해 후보 인공 지능 엔진 을 생성하기 위해 구현될 수 있다. 새로운 인공 지능 엔진은 기존 인공 지능 엔진과 다른 학습 레이어, 인공 지 능 학습 알고리즘, 학습 전처리 등을 수행하는 학습 모델일 수 있다. 신규 인공 지능 엔진 생성부는 타겟 데이터 결정부, 학습 데이터 결정부를 포함할 수 있다. 타겟 데이터 결정부는 새롭게 생성되는 인공 지능 엔진에 의해 출력되는 하위 신용 평가 데이터를 결정하 기 위해 구현될 수 있다. 학습 데이터 결정부는 하위 신용 평가 데이터에 따라 인공 지능 엔진의 학습을 위한 학습 데이터를 결정하 기 위해 구현될 수 있다. 본 발명에서 업데이트 인공 지능 엔진 생성부에 의해 생성된 후보 인공 지능 엔진은 후보 인공 지능 엔진 (업데이트), 신규 인공 지능 엔진 생성부에 의해 생성된 인공 지능 엔진은 후보 인공 지능 엔진(신규)라는 용어로 구분하여 표현될 수 있다. 신뢰도 판단부는 후보 인공 지능 엔진(업데이트), 후보 인공 지능 엔진(신규)의 신뢰도를 판단 하기 위해 구현될 수 있다. 후보 인공 지능 엔진(업데이트)와 후보 인공 지능 엔진(신규)의 예측값과 기존의 금융 서비스 결과값을 비교하여 후보 인공 지능 엔진(업데이트)와 후보 인공 지능 엔진(신규) 각각의 신뢰도가 결정될 수 있다.인공 지능 엔진 결정부는 후보 인공 지능 엔진 중 신용 평가 모델에서 사용될 인공 지능 엔진을 결정하기 위해 구현될 수 있다. 후보 인공 지능 엔진의 신뢰도가 기준 인공 지능 엔진보다 높은 신뢰도를 가지는 경우, 후보 인공 지능 엔진은 인공 지능 엔진으로서 결정되어 신용 평가 모델에서 사용될 수 있다. 후보 인공 지능 엔진(업데이트)의 기준 인공 지능 엔진과 후보 인공 지능 엔진(신규)의 기준 인공 지 능 엔진은 서로 다를 수 있다. 후보 인공 지능 엔진(업데이트)의 기준 인공 지능 엔진은 후보 인공 지능 엔진(업데이트)에 대응되는 업데이트 전 인공 지능 엔진일 수 있다. 후보 인공 지능 엔진(신규)의 기 준 인공 지능 엔진은 후보 인공 지능 엔진(신규)와 동일한 하위 신용 평가 데이터를 생성하는 인공 지능 엔진 중 가장 높은 신뢰도를 가지는 인공 지능 엔진일 수 있다. 또는 후보 인공 지능 엔진(신규)의 기준 인공 지능 엔진은 후보 인공 지능 엔진(신규)와 동일한 하위 신용 평가 데이터를 생성하는 인공 지능 엔진 의 신뢰도의 중간값에 대응되는 인공 지능 엔진일 수 있다. 도 3은 본 발명의 실시예에 따른 후보 신용 평가 모델 생성부의 동작을 나타낸 개념도이다. 도 3에서는 후보 신용 평가 모델 생성부가 인공 지능 엔진을 조합하여 후보 신용 평가 모델을 생성하는 방법이 개시된다. 도 3을 참조하면, 후보 신용 평가 모델 생성부는 신용 평가 모델 생성부에 포함되어 후보 신용 평가 모델 을 생성하기 위해 구현될 수 있다. 후보 신용 평가 모델 생성부는 인공 지능 엔진 결정부, 인공 지능 엔진 배치부 및 신용 평가 데 이터 생성부를 포함할 수 있다. 인공 지능 엔진 결정부는 후보 신용 평가 모델의 생성시 사용할 인공 지능 엔진을 결정할 수 있다. 후보 신용 평가 모델은 특정 섹터의 판매자에 특화된 모델일 수도 있고, 일반적으로 모든 판매자에게 적용 가능한 모 델일 수도 있다. 따라서, 인공 지능 엔진 결정부는 신용 평가 모델 특성을 고려하여 인공 지능 엔진을 생 성할 수도 있다. 인공 지능 엔진 결정부는 인공 지능 엔진을 결정하기 위해 신용 평가 데이터 생성에 사용할 하위 신용 평 가 데이터를 결정할 수 있다. 하위 신용 평가 데이터의 결정 이후, 결정된 하위 신용 평가 데이터에 대응되는 인공 지능 엔진이 결정될 수 있다. 인공 지능 엔진은 2가지 타입으로 정의될 수 있다. 인공 지능 엔진(제1 타입)은 전처리된 신용 평가 기초 데이터를 기반으로 하위 신용 평가 데이터를 결정할 수 있다. 인공 지능 엔진(제2 타입)은 입력되는 하위 신용 평가 데이터를 기반으로 다른 하위 신용 평가 데이터를 결정할 수 있다. 인공 지능 엔진(제1 타입)은 신용 평가 기초 데이터(예를 들어, 신용 평가 요소a(매출), 신용 평가 요소 b(순이익), 신용 평가 요소c(반품율))를 입력 받고, 하위 신용 평가 데이터를 결정할 수 있다. 인공 지능 엔진(제2 타입)은 적어도 하나의 인공 지능 엔진(제1 타입)에 의해 생성된 하위 신용 평가 데이터를 입력받고, 또 다른 하위 신용 평가 데이터를 생성할 수 있다. 예를 들어, 인공 지능 엔진(제2 타 입)은 하위 신용 평가 데이터1(연체 가능성), 하위 신용 평가 데이터2(디폴트 가능성), 하위 신용 평가 데 이터3(시장 변화 가능성)을 입력받고, 또 다른 하위 신용 평가 데이터인 신용 등급을 결정할 수 있다. 인공 지능 모델 결정부는 인공 지능 엔진의 신뢰도, 인공 지능 엔진(제1 타입)과 인공 지능 엔진(제2 타입) 간의 연결 관계, 인공 지능 엔진 배치 구조, 인공 지능 엔진 특징 등을 고려하여 인공 지능 엔진을 결정할 수 있다. 인공 지능 엔진(제1 타입)과 인공 지능 엔진(제2 타입) 간의 연결 관계는 인공 지능 엔진(제2 타 입)의 입력값을 고려한 인공 지능 엔진(제1 타입)의 연결 가능성에 대한 정보를 포함할 수 있다. 인공 지능 엔진 배치 구조는 인공 지능 엔진(제1 타입)과 인공 지능 엔진(제2 타입) 간의 계층적 배 치 및 동일한 계층의 인공 지능 엔진의 배치, 동일/유사 하위 신용 평가 데이터를 생성하는 인공 지능 엔진의 중복 배치 여부, 인공 진능 엔진에 입력되는 신용 평가 기초 데이터의 생성 빈도 등을 고려하여 결정될 수 있다.인공 지능 엔진 특징은 동일/유사한 입력 데이터에 대한 출력 데이터 특성을 고려한 것으로서 출력 데이터의 값 이 유사할수록 상대적으로 유사한 인공 지능 엔진 특징을 가지는 것으로 결정될 수 있다. 인공 지능 엔진 배치부는 인공 지능 엔진을 배치하여 후보 신용 평가 모델을 생성하기 위해 구현될 수 있 다. 신뢰도 높은 신용 평가 데이터를 생성하기 위하여 인공 지능 엔진의 배치가 수행될 수 있다. 인공 지능 엔 진 배치부는 인공 지능 엔진의 신뢰도, 인공 지능 엔진(제1 타입)과 인공 지능 엔진(제2 타입) 간의 연결 관계, 인공 지능 엔진 배치 구조, 인공 지능 엔진 특징, 신용 평가 기초 데이터의 생성 빈도를 고려 하여 다양하게 인공 지능 엔진을 배치할 수 있다. 신용 평가 데이터 생성부는 후보 신용 평가 모델에서 신용 평가 데이터를 생성하기 위해 구현될 수 있다. 신용 평가 데이터 생성부는 인공 지능 엔진 배치부에 의해 생성된 후보 신용 평가 모델에 신용 평가 기초 데이터를 입력하고, 출력값으로 신용 평가 데이터를 생성할 수 있다. 도 4는 본 발명의 실시예에 따른 신용 평가 모델 결정부의 동작을 나타낸 개념도이다. 도 4에서는 신용 평가 모델 결정부에서 후보 신용 평가 모델 중 신용 평가부로 신용 평가 모델로서 전송할 모델 을 결정하는 방법이 개시된다. 도 4를 참조하면, 신용 평가 모델 결정부는 제1 평가 요소로서 후보 신용 평가 모델의 신뢰도를 결정하고, 제2 평가 요소로서 후보 신용 평가 모델과 기준 신용 평가 모델과의 비교를 통해 후보 신용 평가 모델을 신용 평가 모델로 결정하고, 신용 평가부로 전송할 수 있다. 신뢰도 결정(S400) 신용 평가 모델 결정부는 후보 신용 평가 모델에서 출력한 결과값을 기반으로 후보 신용 평가 모델의 신뢰도를 결정할 수 있다. 전술한 바와 같이 신용 평가 모델 결정부는 후보 신용 평가 모델 생성부에 의해 생성된 복수의 후보 신용 평가 모델 중 신용 평가에 임계 신뢰도를 가지는 모델을 신용 평가 모델로서 결정하기 위해 구현될 수 있다. 신용 평 가 모델 생성부에 의해 생성된 후보 신용 평가 모델 중 신용 평가를 위해 사용될 신용 평가 모델은 신용 평가부 로 전송될 수 있다. 신뢰도는 기존의 신용 평가 기초 데이터를 기반으로 한 후보 신용 평가 모델의 신용 평가 결과와 실제 금융 서비스 결과의 비교를 통해 판단될 수 있다. 후보 신용 평가 모델의 신용 평가 결과와 실제 금융 서비스 결과가 상대적으로 유사할수록 상대적으로 더 높은 신뢰도를 가지는 것으로 결정될 수 있다. 기준 신용 평가 모델과의 비교(S410) 신용 평가부에서는 상황에 따라 서로 다른 신용 평가 모델이 적응적으로 사용될 수 있도록 다양한 신용 평가 모 델이 존재할 수 있다. 신용 평가 모델 결정부는 후보 신용 평가 모델과 가장 유사한 특성을 가지는 신용 평가부 의 신용 평가 모델을 기준 신용 평가 모델로 결정할 수 있다. 신용 평가 모델 간 특성의 유사도는 입력되는 신용 평가 기초 데이터의 유사도, 출력되는 신용 평가 데이터의 유사도, 인공 지능 모델 유사도를 기반으로 결정될 수 있다. 신용 평가 모델 결정부는 기준 신용 평가 모델과 후보 신용 평가 모델 간의 신뢰도 비교, 동일한 입력값을 입력 시 기준 신용 평가 모델과 후보 신용 평가 모델의 출력값 간의 차이값 및 차이값에 대한 오류 검출을 통해 후보 신용 평가 모델을 신용 평가 모델로 결정할지 여부를 결정할 수 있다. 도 5는 본 발명의 실시예에 따른 신용 평가부의 동작을 나타낸 개념도이다. 도 5에서는 신용 평가부에서 신용 평가 모델을 기반으로 신용 평가 데이터를 생성하는 방법이 개시된다. 도 5를 참조하면, 신용 평가부는 적어도 하나의 신용 평가 모델을 기반으로 판매자의 신용 평가를 통해 신용 평 가 데이터를 생성할 수 있다. 신용 평가부는 하나의 신용 평가 모델을 기반으로 판매자의 신용 평가 데이터를 생성할 수도 있으나, 신용 평가 부는 판매자 특성 정보를 기반으로 적응적으로 판매자에게 적용 가능한 타겟 신용 평가 모델을 결정 하고, 결정된 타겟 신용 평가 모델을 기반으로 신용 평가 데이터를 생성할 수 있다.예를 들어, 판매자의 판매 상품, 판매자의 상품 판매 플랫폼, 판매자의 매출, 판매자의 순이익 등과 같은 판매 자 정보를 기반으로 판매자 특성 정보에 가장 적합한 신용 평가를 위한 타겟 신용 평가 모델이 결정 될 수 있다. 신용 평가부는 복수의 신용 평가 모델 각각에 피드백 정보를 기반으로 판매자 특성 정보에 따른 신용 평가 모델 의 신뢰도를 결정할 수 있다. 또한, 신용 평가부는 복수의 신용 평가 모델 각각에 대해 판매자 특성 정보별 신 뢰도 등급을 결정할 수 있다. 구체적으로 판매자 특성 정보는 하위 판매자 특성 정보 각각을 기반으로 벡 터화되고 공간 상에 표현될 수 있고, 공간 간의 거리 정보를 통해 판매자 특성 정보를 기반으로 판매자 그룹이 형성될 수 있고, 판매자 그룹별 신용 평가 데이터와 금융 서비스 결과 데이터를 비교하여 신용 평가 모델의 판 매자 그룹별 신뢰도가 결정될 수 있다. 신뢰도 등급은 신용 평가 모델별 판매자 그룹에 대한 신뢰도의 통계적 특성을 고려하여 결정될 수 있다. 신용 평가부는 판매자 특성 정보를 기초로 상대적으로 높은 신뢰도 등급을 가지는 신용 평가 모델을 타겟 신용 평가 모델로서 결정하여 판매자에 대한 신용 평가 데이터를 생성할 수 있다. 도 6은 본 발명의 실시예에 따른 신용 평가 모델 관리부의 동작을 나타낸 개념도이다. 도 6에서는 신용 평가 모델 관리부에서 신용 평가 모델의 쉬프팅(또는 보정) 또는 신용 평가 모델의 교체를 결 정하는 방법이 개시된다. 도 6을 참조하면, 신용 평가 모델에 의해 생성된 신용 평가 데이터가 금융 서비스 결과 데이터와 차이가 있는 경우, 신용 평가 모델 관리부는 신용 평가 모델의 쉬프팅 또는 신용 평가 모델의 교체를 수행할 수 있다. 신용 평가 모델 관리부는 신용 평가 모델의 신용 평가 데이터와 금융 서비스 결과 데이터의 비교를 통해 신용 평가 모델의 예측 정확도를 결정할 수 있다. 신용 평가 모델의 예측 정확도가 임계 정확도 이하인 경우, 신용 평가 모델 관리부는 신용 평가 모델을 관리 대상 신용 평가 모델로 결정할 수 있다. 신용 평가 모델 관리부는 관리 대상 신용 평가 모델에 대한 쉬프팅 또는 교체를 결정할 수 있다. 신용 평가 모델 쉬프팅은 관리 대상 신용 평가 모델의 신용 평가 데이터와 금융 서비스 결과 데이터 간의 차이 는 존재하나, 그 차이가 음의 방향 또는 양의 방향으로 경향성을 가지고 임계 범위 내에서 존재하는 경우에 수 행될 수 있다. 신용 평가 모델 교체는 관리 대상 신용 평가 모델의 신용 평가 데이터와 금융 서비스 결과 데이터 간의 차이는 존재하고, 그 차이가 음의 방향 또는 양의 방향으로 경향성을 가지지 않고, 임계 범위를 벋어나는 경우에 수행 될 수 있다. 신용 평가 모델 쉬프팅 1) 관리 대상 신용 평가 모델의 신용 평가 데이터보다 금융 서비스 결과 데이터가 금융 서비스 측면에서 긍정적 인 경우 신용 평가 모델 쉬프팅이 되지 않는 경우, 관리 대상 신용 평가 모델의 신용 평가 데이터를 기반으로 보수 적인 금융 서비스(낮은 대출금, 높은 금리)가 제공될 수 있다. 따라서, 신용 평가 모델 쉬프팅을 통해 신 용 평가 데이터를 쉬프팅하여 신용 평가 데이터가 실제 금융 서비스 데이터에 가깝도록 설정할 수 있다. 2) 신용 평가 데이터보다 금융 서비스 결과 데이터가 금융 서비스 측면에서 부정적인 경우 신용 평가 모델 쉬프팅이 되지 않는 경우, 관리 대상 신용 평가 모델의 신용 평가 데이터를 기반으로 리스 크가 높은 금융 서비스(높은 대출금, 낮은 금리)가 제공될 수 있다. 따라서, 신용 평가 모델 쉬프팅을 통 해 신용 평가 데이터를 쉬프팅하여 신용 평가 데이터가 실제 금융 서비스 데이터에 가깝도록 설정할 수 있다. 신용 평가 모델 교체 1) 신규 신용 평가 모델 생성 관리 대상 신용 평가 모델의 교체를 위해 신용 평가 데이터와 금융 서비스 결과 데이터가 피드백 데이터로서 신 용 평가 모델 생성부로 전달되고, 신용 평가 모델 생성부에 의해 새롭게 생성된 신용 평가 모델로 교체가 진행 될 수 있다.2) 기존 신용 평가 모델 이용 기존 신용 평가 모델 중 교체 가능한 신용 평가 모델을 탐색하여 해당 신용 평가 모델로의 교체가 수행될 수 있 다. 신용 평가 모델 중 관리 대상 신용 평가 모델로의 기존 입력값을 넣었을 때 실제 금융 서비스 결과와 비교하여 높은 예측 정확도를 가지거나, 신용 평가 모델 쉬프팅을 하는 경우, 실제 금융 서비스 결과를 높은 정확도로 예 측 가능한 신용 평가 모델이 존재하는 경우, 해당 신용 평가 모델을 모델을 쉬프팅하여 교체할 수 있다. 이상 설명된 본 발명에 따른 실시예는 다양한 컴퓨터 구성요소를 통하여 실행될 수 있는 프로그램 명령어의 형 태로 구현되어 컴퓨터 판독 가능한 기록 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능한 기록 매체는 프로그 램 명령어, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 컴퓨터 판독 가능한 기록 매체에 기록되는 프로그램 명령어는 본 발명을 위하여 특별히 설계되고 구성된 것이거나 컴퓨터 소프트웨 어 분야의 당업자에게 공지되어 사용 가능한 것일 수 있다. 컴퓨터 판독 가능한 기록 매체의 예에는, 하드 디스 크, 플로피 디스크 및 자기 테이프와 같은 자기 매체, CD-ROM 및 DVD와 같은 광기록 매체, 플롭티컬 디스크 (floptical disk)와 같은 자기-광 매체(magneto-optical medium), 및 ROM, RAM, 플래시 메모리 등과 같은, 프 로그램 명령어를 저장하고 실행하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령어의 예에는, 컴 파일러에 의하여 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용하여 컴퓨터에 의해서 실 행될 수 있는 고급 언어 코드도 포함된다. 하드웨어 장치는 본 발명에 따른 처리를 수행하기 위하여 하나 이상 의 소프트웨어 모듈로 변경될 수 있으며, 그 역도 마찬가지이다. 이상에서 본 발명이 구체적인 구성요소 등과 같은 특정 사항과 한정된 실시예 및 도면에 의하여 설명되었으나, 이는 본 발명의 보다 전반적인 이해를 돕기 위하여 제공된 것일 뿐, 본 발명이 상기 실시예에 한정되는 것은 아"}
{"patent_id": "10-2022-0096826", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "니며, 본 발명이 속하는 기술분야에서 통상적인 지식을 가진 자라면 이러한 기재로부터 다양한 수정과 변경을 꾀할 수 있다. 따라서, 본 발명의 사상은 상기 설명된 실시예에 국한되어 정해져서는 아니 되며, 후술하는 특허청구범위뿐만 아니라 이 특허청구범위와 균등한 또는 이로부터 등가적으로 변경된 모든 범위는 본 발명의 사상의 범주에 속한 다고 할 것이다.도면 도면1 도면2 도면3 도면4 도면5 도면6"}
{"patent_id": "10-2022-0096826", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 CB(credit bureau)사 신용 평가 장치를 나타낸 개념도이다. 도 2는 본 발명의 실시예에 따른 인공 지능 엔진 생성부의 동작을 나타낸 개념도이다. 도 3은 본 발명의 실시예에 따른 후보 신용 평가 모델 생성부의 동작을 나타낸 개념도이다. 도 4는 본 발명의 실시예에 따른 신용 평가 모델 결정부의 동작을 나타낸 개념도이다. 도 5는 본 발명의 실시예에 따른 신용 평가부의 동작을 나타낸 개념도이다. 도 6은 본 발명의 실시예에 따른 신용 평가 모델 관리부의 동작을 나타낸 개념도이다."}
