{"patent_id": "10-2021-7014781", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0077735", "출원번호": "10-2021-7014781", "발명의 명칭": "기판 상의 유동 물체를 자동으로 매핑하기 위한 방법 및 시스템", "출원인": "나노트로닉스 이미징, 인코포레이티드", "발명자": "풋맨, 매튜, 씨."}}
{"patent_id": "10-2021-7014781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "현미경 검사 시스템을 사용하여 기판 상의 유동 물체를 매핑하기 위한 방법으로서, 방법은:현미경 시스템과 컴퓨터 분석 시스템을 포함하는 현미경 검사 시스템을 제공하는 단계로서,현미경 시스템은 광원과, 이미징 장치와, 스테이지 상에 배치된 기판을 이동시키기 위한 스테이지, 및 제어 모듈을 포함하고, 및컴퓨터 분석 시스템은 물체 식별 모듈을 포함하는, 단계와;현미경 검사 시스템을 사용하여 기판 스캔을 수행하는 단계와;기판 상의 각각의 물체에 대해, 알고리즘, 네트워크, 인공 지능과 이미지 처리 알고리즘을 포함하는 기계 및 시스템을 사용하여, X, Y 및 θ 좌표 세트를 포함하는, 기판 상의 물체 위치를 식별하는 단계로서, 물체 중 적어도 하나는 유동적이며 이전 위치에서 이동했거나 이전 크기에서 변형된, 단계; 및각각의 물체의 위치 및 각각의 물체에 대한 이동 또는 변형량을 반영하는 물체 매핑 정보를 생성하는 단계를 포함하고,물체 매핑 정보를 생성하는 단계는 알고리즘, 네트워크, 인공 지능과 이미지 처리 알고리즘을 포함하는 기계 및시스템을 사용하여 자동으로 수행되는, 방법."}
{"patent_id": "10-2021-7014781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,스테이지, 이미징 장치 및 물체를 정렬하여, 적어도 하나의 물체의 이동한 위치를 반영하는 단계를 더 포함하는방법."}
{"patent_id": "10-2021-7014781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,물체 매핑 정보를 생성하는 단계는 물체 레이아웃 맵을 생성하는 단계를 포함하는, 방법."}
{"patent_id": "10-2021-7014781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,물체는 기판 상의 전자 물체 또는 슬라이드 상에 장착된 생물학적 표본에서 발견되는 세포, 조직 등과 같은 생물학적 물체를 포함하는, 방법."}
{"patent_id": "10-2021-7014781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,컴퓨터 분석 시스템은 물체 레이아웃 예측 모듈을 더 포함하는, 방법.공개특허 10-2021-0077735-3-청구항 6 제 1 항에 있어서,현미경 시스템은 저해상도 대물렌즈와, 고해상도 대물렌즈를 더 포함하는, 방법."}
{"patent_id": "10-2021-7014781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서,물체 식별 모듈은 현미경 시스템으로부터 기판의 저해상도 또는 고해상도 스캔을 수신하도록 구성되는, 방법."}
{"patent_id": "10-2021-7014781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서,물체 식별 모듈은 컴퓨터 비전, 하나 이상의 인공 지능 알고리즘 및/또는 컴퓨터 알고리즘을 사용하여, 수신된저해상도 또는 고해상도 스캔에서 하나 이상의 물체를 검출하도록 구성되는, 방법."}
{"patent_id": "10-2021-7014781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 7 항에 있어서,물체 식별 모듈은 수신된 기판 스캔에 이미지 처리 알고리즘을 적용하고, 기판 상의 각각의 물체에 대해: i) 물체를 검출하고; ii) 물체 유형을 결정하고; iii) 방향을 결정하고; iv) 이미징 정렬 위치를 식별하고; 및/또는v) 시작 스캔 위치를 식별할 수 있고, 및물체 식별 모듈은 기판 상의 기준점과 관련하여 물체 매핑 정보를 사용하여, i) 기판 상의 각각의 물체와: ii)기판 상의 각각의 물체에 대한 이미징 정렬 위치; 및/또는 iii) 기판 상의 각각의 물체에 대한 시작 스캔 위치의 X, Y, θ 좌표를 결정할 수 있는, 방법."}
{"patent_id": "10-2021-7014781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "현미경 검사 시스템을 사용하여 기판 상의 유동 물체를 매핑하기 위한 방법으로서, 방법은:현미경 시스템과 컴퓨터 분석 시스템을 포함하는 현미경 검사 시스템을 제공하는 단계로서,현미경 시스템은 광원과, 이미징 장치와, 스테이지 상에 배치된 기판을 이동시키기 위한 스테이지, 및 제어 모듈을 포함하고, 및컴퓨터 분석 시스템은 물체 식별 모듈과 물체 레이아웃 예측 모듈을 포함하는, 단계와;현미경 검사 시스템을 사용하여 기판 스캔을 수행하는 단계와;기판 상의 각각의 물체에 대해, 알고리즘, 네트워크, 인공 지능과 이미지 처리 알고리즘을 포함하는 기계 및 시스템을 사용하여, X, Y 및 θ 좌표 세트를 포함하는, 기판 상의 물체 위치를 식별하는 단계로서, 물체 중 적어도 하나는 유동적이며 이전 위치에서 이동했거나 이전 크기에서 변형된, 단계; 및각각의 물체의 위치 및 각각의 물체에 대한 이동 또는 변형량을 반영하는 물체 매핑 정보를 생성하는 단계를 포함하고,물체 매핑 정보를 생성하는 단계는 알고리즘, 네트워크, 인공 지능과 이미지 처리 알고리즘을 포함하는 기계 및시스템을 사용하여 자동으로 수행되는, 방법.공개특허 10-2021-0077735-4-청구항 11 제 10 항에 있어서,현미경 시스템은 저해상도 대물렌즈와, 고해상도 대물렌즈를 더 포함하는, 방법."}
{"patent_id": "10-2021-7014781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 10 항에 있어서,물체 식별 모듈은 현미경 시스템으로부터 기판의 저해상도 또는 고해상도 스캔을 수신하도록 구성되는, 방법."}
{"patent_id": "10-2021-7014781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 12 항에 있어서,물체 식별 모듈은 컴퓨터 비전, 하나 이상의 인공 지능 알고리즘 및/또는 컴퓨터 알고리즘을 사용하여, 수신된저해상도 또는 고해상도 스캔에서 하나 이상의 물체를 검출하도록 구성되는, 방법."}
{"patent_id": "10-2021-7014781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 12 항에 있어서,물체 식별 모듈은 수신된 기판 스캔에 이미지 처리 알고리즘을 적용하고, 기판 상의 각각의 물체에 대해: i) 물체를 검출하고; ii) 물체 유형을 결정하고; iii) 방향을 결정하고; iv) 이미징 정렬 위치를 식별하고; 및/또는v) 시작 스캔 위치를 식별할 수 있고, 및물체 식별 모듈은 기판 상의 기준점과 관련하여 물체 매핑 정보를 사용하여, i) 기판 상의 각각의 물체와: ii)기판 상의 각각의 물체에 대한 이미징 정렬 위치; 및/또는 iii) 기판 상의 각각의 물체에 대한 시작 스캔 위치의 X, Y, θ 좌표를 결정할 수 있는, 방법."}
{"patent_id": "10-2021-7014781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 10 항에 있어서,물체 레이아웃 예측 모듈은 물체 식별 모듈로부터 피드백 데이터 및/또는 물체 매핑 정보를 수신하는, 방법."}
{"patent_id": "10-2021-7014781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 15 항에 있어서,피드백 데이터는 제조 또는 검사 공정의 특정 단계에서의 기판 상의 각각의 물체에 대한 X, Y, θ 좌표, 및 제조 또는 검사 공정 동안 기판 상의 각각의 물체가 변형되고, 이동하고 및/또는 방향을 변경한 양을 포함하는,방법."}
{"patent_id": "10-2021-7014781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 16 항에 있어서,물체 레이아웃 예측 모듈은 기판의 초기 물체 레이아웃을 수신할 수 있고, 인공 지능을 사용하는 레이아웃 예측알고리즘을 적용하여, 제조 및/또는 검사 공정의 특정 단계에서 기판의 새로운 물체 레이아웃을 결정할 수 있는방법.공개특허 10-2021-0077735-5-청구항 18 제 10 항에 있어서,물체 레이아웃 예측 모듈은 선형 회귀 모델 또는 다중 선형 회귀 모델을 사용하여 구현되는, 방법."}
{"patent_id": "10-2021-7014781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 10 항에 있어서,물체 레이아웃 예측 모듈은 물체의 X, Y, θ 좌표가 검사 중인 유형의 물체 및/또는 기판에 대한 미리 정의된허용 오차를 초과하는 경우, 경보를 생성하는, 방법."}
{"patent_id": "10-2021-7014781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "기판 상의 유동 물체를 매핑하기 위한 시스템으로서, 시스템은:현미경 시스템을 포함하는 현미경 검사 시스템으로서, 현미경 시스템은 광원과, 이미징 장치와, 스테이지 상에배치된 기판을 이동시키기 위한 스테이지, 및 제어 모듈을 포함하고,이미징 장치는 기판을 스캔하는, 현미경 검사 시스템과;기판 상의 각각의 물체에 대해, 알고리즘, 네트워크, 인공 지능과 이미지 처리 알고리즘을 포함하는 기계 및 시스템을 사용하여, X, Y 및 θ 좌표 세트를 포함하는, 기판 상의 물체 위치를 식별하기 위한 물체 레이아웃 식별모듈을 포함하고,물체 중 적어도 하나는 유동적이며 물체 중 적어도 하나는 이전 위치에서 이동했거나 이전 크기에서변형되었고,물체 레이아웃 식별 모듈은 각각의 물체의 위치 및 각각의 물체에 대한 이동 또는 변형량을 반영하는 물체 매핑정보를 생성하는, 시스템."}
{"patent_id": "10-2021-7014781", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "광원과, 이미징 장치와, 스테이지 상에 배치된 기판을 이동시키기 위한 스테이지, 및 제어 모듈을 포함하는 현미 경 검사 시스템을 사용하여 기판 상의 유동 물체를 매핑하기 위한 방법 및 시스템이 개시된다. 컴퓨터 분석 시스 템은, 기판 상의 각각의 물체에 대해, 알고리즘, 네트워크, 인공 지능과 이미지 처리 알고리즘을 포함하는 기계 및 시스템을 사용하여, X, Y 및 θ 좌표 세트를 포함하는, 기판 상의 물체 위치를 식별하는 물체 식별 모듈을 포 함한다. 물체 중 적어도 하나는 유동적이며 이전 위치에서 이동했거나 이전 크기에서 변형되었다."}
{"patent_id": "10-2021-7014781", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "관련 출원에 대한 교차 참조 본 출원은 2018 년 10월 19일 출원된 미국 특허 출원 제16/164,990호의 우선권을 주장하며, 그 전체 내용이 본 원에 참조로 포함된다. 본 개시의 실시형태는 기판 상의 유동 물체를 자동으로 매핑하는 것에 관한 것이다."}
{"patent_id": "10-2021-7014781", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "재료의 균일성 검사 및 이상 검출은 제조에서 과학, 생물학에 이르는 분야에서 중요하다. 검사는 종종 현미경 검사 시스템을 사용하여 기판(예를 들어, 웨이퍼) 상의 전자 물체(electronic object) 또는 슬라이드 상에 장착 된 생물학적 표본의 특징을 검사하고 측정한다. 본 기술 분야의 숙련자가 인식하는 바와 같이 표본은 검사 물품 (예를 들어, 웨이퍼 또는 생물학적 슬라이드)을 의미한다. 기판 상의 전자 물체는 트랜지스터, 저항기, 커패시 터, 집적 회로, 마이크로 칩 등과 같은 장치를 포함할 수 있다. 생물학적 표본은 일반적으로 현미경 검사를 위 해 슬라이드 상에 장착된다. 본 기술 분야의 숙련자가 인식하는 바와 같이 물체는, 명세서에 제공되고 청구 범 위에 기재된 바와 같이 광범위한 의미를 가지며, 기판 상의 전자 물체 또는 특히 슬라이드 상에 장착된 생물학 적 표본에서 발견되는 세포, 조직 등과 같은 생물학적 물체를 의미할 수 있다. 다음 설명은 전기적 특성인 기판 상의 물체를 검사하는 것과 관련이 있지만, 본원에서 설명되는 자동 매핑은 생물학적 표본과 슬라이드 상에 장착된 물체를 검사하기 위해 사용될 수 있다. 현미경 검사 시스템은 추후 분석을 위해 기판 상의 물체를 촬영하기 위해 사용될 수 있다. 정확한 분석을 위해, 유사한 물체의 일관된 이미지를 캡처하거나, 물체와 참조 템플릿(reference template)(종종 골든 템플릿(golden template)이라고도 함)의 일관된 이미지를 캡처하는 것이 유용하다. 예를 들어, 물체가 이미징 장치의 시야보다 작은 경우, 유사한 물체는 이미징 장치와 관련하여 동일한 방식으로 정렬될 수 있고, 따라서 유사한 물체의 캡 처된 이미지는 모두 촬영된 물체의 유사한 정렬을 보여준다(본원에서 \"이미징 정렬 위치(imaging alignment position)\"라고 함). 일 실시형태에서, 예를 들어 도 1A 및 도 1B에 도시된 바와 같이, 물체(120, 120)의 왼쪽 상단 모서리(115, 115)는 각각 단일 정사각형(110, 110)으로 나타낸 이미징 장치의 시야의 왼쪽 상단 모서리에 표시된다. 물체의 방향은 회전했지만, 시야도 회전하여, 캡처된 이미지에서 물체(120 및 120)의 동일 한 정렬을 유지한다. 본 기술 분야의 숙련자가 이해하는 시야(field of view)라는 용어는 디지털 현미경과 관련되고, 이미지 센서에 의해 한꺼번에 캡처되는 검사 영역을 의미한다는 점에 유의한다. 또한, 본 기술 분야의 숙련자는 시야, 이미지 및 타일(tile)이라는 용어들이 본원에서 상호 교환 가능하게 사용된다는 것을 쉽게 알 것이다. 또 다른 예에서, 도 2에 도시된 바와 같이, 기판 상의 물체가 각각의 타일로 나타낸 이미징 장 치의 시야를 초과할 때, 전체 물체를 캡처하기 위해 이미지 시퀀스(예를 들어, 타일(1-18))가 필요할 수 있다. 시야와 타일은 본원에서 상호 교환 가능하게 사용된다는 점에 유의한다. 정확한 분석을 가능하게 하기 위해, 유 사한 물체에 걸쳐 또는 참조 템플릿과 비교하여, 유사한 이미징 정렬 위치에서, 일관된 방식으로 이미지 시퀀스 를 캡처하는 것이 유용하다. 하나의 예에서, 첫 번째 이미지는 물체 상의 특정 특징에서 시작하거나 물체 상의 특정 위치(예를 들어, 왼쪽 상단 모서리)(본원에서 \"시작 스캔 위치\"라 하고, *로 표시됨)에서 캡처될 수 있고. 후속 이미지는 예를 들어 미리 정의된 시퀀싱 경로에서(예를 들어, 도 2에 도시된 시퀀싱 경로로 나 타낸 바와 같은 구불구불한 방식으로) 캡처될 수 있다. 시퀀스 내의 각각의 이미지에는 번호(예를 들어, 1 내지 18)가 할당될 수 있으며, 동일한 번호를 갖는 이미지는 유사한 물체에 걸쳐 또는 참조 템플릿과 비교될 수 있다. 각각의 물체의 정확한 위치와 방향 및/또는 기판 상의 물체의 특징을 아는 것은, 스테이지, 이미징 장치 및 물 체의 올바른 정렬을 용이하게 하여, 유사한 물체가 시야 내에 일관되게 정렬되거나, 유사한 이미지 시퀀스가 유 사한 물체에 대해 캡처되는 이미지 캡처를 수행할 수 있다. 이미지 캡처 외에도, 물체의 위치와 방향 및/또는 기판 상의 물체의 특징을 아는 것은, 제조 또는 검사 공정의 다양한 단계 및/또는 이상 분석에 유용할 수 있다. 일부 실시형태에서, 물체는 물체의 방향을 결정하는 것을 돕기 위해 물체 자체 상에 표시를 가질 수 있다(예를 들어, 표본의 왼쪽 상단 모서리에 나타나는 별표(*)(225a) 및 오른쪽 하단 모서리에 표시되는 플러스 기호 (+)(225b)). 초기 물체 레이아웃 맵(layout map)은 기판 상의 각각의 물체의 X, Y, θ 좌표(\"예상 위치\" 또는 \"원래 위치\") 를 지정할 수 있다. 예를 들어, 본원에 추가로 설명되는 바와 같이, X, Y는 기판 상의 공통 기준점(예를 들어, 원점)에 대한 각각의 물체의 좌표 위치를 나타낼 수 있고, θ는 알려진 좌표계와 관련된 원점에 대한 각각 의 물체 또는 생물학적 표본의 방향을 나타낼 수 있다. 그러나 초기 물체 레이아웃 맵은 일반적으로 초기 X, Y, θ 좌표로부터의 검사 및/또는 제조 공정 동안의 물체의 이동을 반영하지는 않는다(즉, 이동은 명세서 및 청구 범위에서 \"유동\"이라 하며, 물체가 원래 위치로부터 추후 위치로 이동할 수 있음을 의미한다). 구부릴 수 있는 또는 탄성(\"유연한\") 기판(예를 들어, 폴리이미드, PEEK 또는 투명 전도성 폴리에스테르 필름) 상에 물체 를 인쇄하고, 유연한 물체(예를 들어, 유연한 OLED)를 인쇄하고, 슬라이드 상에 장착된 유동적인 생물학적 표본 을 검사하고 및/또는 다이싱-후(post-dicing) (예를 들어, 후프 링(hoop ring), Gel-Pak®, 와플 팩(waffle pack) 상의) 물체를 검사할 때, 물체는 (예를 들어, 초기 물체 레이아웃 맵에 지정된) 원래 또는 예상 X, Y, θ 좌표로부터 이동할 수 있다. 유연한 기판 및/또는 유연한 물체의 변형도 발생할 수 있으며, 이는 기판 상의 물 체 또는 슬라이드 상의 생물학적 표본의 예상 X, Y, θ 좌표를 변경할 수도 있다. 변형(본 기술 분야의 숙련자 에 의해 모핑(morphing)이라고도 알려짐)은 물체의 전체 치수 및/또는 개별 특징에서 물체와 참조 물체 사이의 편차를 의미할 수 있다. 참조 물체는 해당 물체 유형 및/또는 물체의 이전 버전에 대한 참조 템플릿 이미지를 의미할 수 있다."}
{"patent_id": "10-2021-7014781", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, (예를 들어, 초기 물체 레이아웃 맵과 비교해서) 기판 상의 예상 좌표로부터 이동한 물체를 찾을 뿐만 아니라, 검사 또는 제조 공정의 다양한 단계에서 기판 상의 물체의 X, Y, θ 좌표를 예측하기 위해, (예를 들어, 기판 상의 각각의 물체의 X, Y, θ 좌표를 결정함으로써) 기판 상의 유동 물체를 자동으로 매핑하기 위한 새로운 메커니즘을 제공하는 것이 바람직하다."}
{"patent_id": "10-2021-7014781", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시형태는 현미경 시스템과 컴퓨터 분석 시스템을 포함하는 현미경 검사 시스템을 사용하여 기판 상의 유동 물체를 매핑하기 위한 방법에 관한 것이다. 현미경 시스템은 광원과, 이미징 장치와, 스테이지 상에 배치된 기판을 이동시키기 위한 스테이지, 및 제어 모듈을 포함한다. 컴퓨터 분석 시스템은 물체 식별 모듈을 포함한다. 방법은 현미경 검사 시스템을 사용하여 기판 스캔을 수행하는 단계 및 기판 상의 각각의 물체에 대해, 알고리즘, 네트워크, 인공 지능과 이미지 처리 알고리즘을 포함하는 기계 및 시스템을 사용하여, X, Y 및 θ 좌표 세트를 포함하는, 기판 상의 물체 위치를 식별하는 단계를 포함한다. 물체 중 적어도 하나는 유동적이 며 이전 위치에서 이동했거나 이전 크기에서 변형되었다. 방법은 또한 각각의 물체의 위치 및 각각의 물체에 대 한 이동(shift) 또는 변형량(deformity amount)을 반영하는 물체 매핑 정보를 생성하는 단계를 포함한다. 물체 매핑 정보를 생성하는 단계는 알고리즘, 네트워크, 인공 지능과 이미지 처리 알고리즘을 포함하는 기계 및 시스 템을 사용하여 자동으로 수행된다. 본 개시의 또 다른 실시형태는 현미경 시스템과 컴퓨터 분석 시스템을 포함하는 현미경 검사 시스템을 사용하여 기판 상의 유동 물체를 매핑하기 위한 방법에 관한 것이다. 현미경 시스템은 광원과, 이미징 장치와, 스테이지 상에 배치된 기판을 이동시키기 위한 스테이지, 및 제어 모듈을 포함한다. 컴퓨터 분석 시스템은 물체 식별 모 듈과 물체 레이아웃 예측 모듈을 포함한다. 방법은 현미경 검사 시스템을 사용하여 기판 스캔을 수행하는 단계 및 기판 상의 각각의 물체에 대해, 알고리즘, 네트워크, 인공 지능과 이미지 처리 알고리즘을 포함하는 기계 및 시스템을 사용하여, X, Y 및 θ 좌표 세트를 포함하는, 기판 상의 물체 위치를 식별하는 단계를 포함한다. 물체 중 적어도 하나는 유동적이며 이전 위치에서 이동했거나 이전 크기에서 변형되었다. 방법은 또한 각각의 물체의 위치 및 각각의 물체에 대한 이동 또는 변형량을 반영하는 물체 매핑 정보를 생성하는 단계를 포함한다. 물체 매핑 정보를 생성하는 단계는 알고리즘, 네트워크, 인공 지능과 이미지 처리 알고리즘을 포함하는 기계 및 시스 템을 사용하여 자동으로 수행된다. 본 개시의 또 다른 실시형태는 광원과, 이미징 장치와, 스테이지 상에 배치된 기판을 이동시키기 위한 스테이지, 및 제어 모듈을 갖는 현미경 시스템을 포함하는, 기판 상의 유동 물체를 매핑하기 위한 시스템에 관 한 것이다. 이미징 장치는 기판을 스캔한다. 시스템은 또한 기판 상의 각각의 물체에 대해, 알고리즘, 네트워크, 인공 지능과 이미지 처리 알고리즘을 포함하는 기계 및 시스템을 사용하여, X, Y 및 θ 좌표 세트를 포함하는, 기판 상의 물체 위치를 식별하기 위한 물체 레이아웃 식별 모듈을 포함한다. 물체 중 적어도 하나는 유동적이며 물체 중 적어도 하나는 이전 위치에서 이동했거나 이전 크기에서 변형되었다. 물체 레이아웃 식별 모듈은 각각의 물체의 위치 및 각각의 물체에 대한 이동 또는 변형량을 반영하는 물체 매핑 정보를 생성한다."}
{"patent_id": "10-2021-7014781", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "개시된 주제의 일부 실시형태에 따르면, (예를 들어, 초기 물체 레이아웃 맵과 비교해서) 기판 상의 초기 또는 예상 위치로부터 이동한 물체를 찾기 위해, (예를 들어, 기판 상의 각각의 물체의 X, Y, θ 좌표를 결정함으로 써) 기판 상의 유동 물체를 자동으로 매핑하기 위한 메커니즘이 메커니즘이 제공된다. 이는 스테이지, 이미징 장치 및 물체의 정렬을 용이하게 하여 물체의 적절한 이미지(들)를 캡처하는 데 유리하고, 검사 또는 제조 공정 의 추후 단계를 보정하여 물체의 이동을 처리하는 데 유리하고 및/또는 이상 분석에 유용할 수 있다. 이는 또한 물체가 전혀 이동하지 않은 경우에도, 기판에 대한 초기 물체 레이아웃 맵이 제공되지 않은 경우 물체의 위치를 찾는 데 유용할 수 있다. 일부 실시형태에서, 자동 매핑은 기판 상의 물체의 실제 X, Y, θ 좌표가 아니라, 기 판 상의 물체의 X, Y, θ 좌표가 검사 또는 제조 공정의 다양한 단계 동안 있을 위치를 예측하는 것을 포함한다. 이는 기판 상에 물체를 적절하게 배치하거나, 제조 또는 검사 공정에서의 단계 및/또는 구성요소를 보정하여 물체 및/또는 기판의 예상 이동 및/또는 변형을 수용하는 데 유용할 수 있다. 도 3A(초기 물체 레이아웃) 및 도 3B(추후 물체 레이아웃)는, 개시된 주제의 일부 실시형태에 따라, 제조 공정 의 다양한 단계에서의 또는 검사 공정의 다양한 시간에 발생하는 기판 상의 물체(A-F)의 예시적인 레이아 웃을 도시하고 있다. 각각의 타일은 이미지 또는 시야를 나타낸다. 도 3A 및 도 3B에 도시된 바와 같이, 기판 상의 각각의 물체(A-F)의 X, Y 위치를 정의하기 위해 직교 XY 좌표계가 사용될 수 있다. 각각의 물체 (A-F)의 XY 좌표 위치는 원점(O)에서 만나는 좌표축(312A 및 312B)으로부터의 거리를 나타낸다. 일부 실시형태 에서, 좌표축은 기판에서 발견되는 두 개의 참조 인덱스(313A 및 313B)로부터 연장되는 한 쌍의 수직선일 수 있다. 좌표축(312A 및 312B)과 원점(O)은 단지 예일 뿐이며, 물체(A-F)의 좌표 위치는 다른 좌표축과 원점 (O) 및/또는 다른 기준점(들)에서 측정될 수 있다는 점에 유의한다. 다른 실시형태에서, 물체는 원점 및/또는 임의의 다른 적합한 위치에 대한 극좌표에 의해 찾을 수 있다. XY 위치는 물체의 특정 부분(예를 들어, 왼쪽 상 단 모서리) 및/또는 물체의 특정 특징의 위치를 나타낼 수 있다. 각각의 물체(A-F)는 원점(O)에 대한 물체의 방향을 결정하기 위해 사용될 수 있는 방향 표시(314A(예를 들어, 별표(*)) 및 314B(예를 들어, 플러스 기호(+))를 포함한다. 예를 들어, 도 3A에 도시된 바와 같은 물체의 초기 레이아웃에서, 별표는 각각의 물체의 왼쪽 상단 모서리에 표시되고 플러스 기호는 각각의 물체의 오른쪽 하단모서리에 표시된다. 도 3A는 물체(A-F)에 대한 모델 위치를 나타낸다. 모델 위치는 또한 물체(A-F)에 대한 참조 템플릿과 동일한 위치일 수 있으며, 도 3B에 도시된 바와 같이 물체(A-F)의 임의의 이동을 분석하기 위해 사용 될 수 있다. 도 3B에서, 원점(O)에 대해 별표와 플러스 기호의 새로운 위치로 보여주는 바와 같이, 많은 물체가 이들의 초기 XY 위치로부터 이동했으며, 물체의 방향도 변경되었다. 방향 마크(314B, 314B)는 단지 예일 뿐이며, 예상 또는 초기 방향으로부터의 방향 및 회전 정도를 결정하기 위해 다른 방향 마크도 사용될 수 있다. 일부 실시형태에서, 물체의 특징은 물체의 방향을 결정하기 위해 사용될 수 있다. 기판 상의 물체는 동일한 유 형의 물체이거나 다른 유형의 물체일 수 있다는 점에 유의한다. 본원에 개시된 바와 같이, 일부 실시형태에서, 물체를 검출하고, 물체 유형을 분류하고, 물체에 대한 이미징 정 렬 위치를 식별하고, 시작 스캔 위치를 식별하고, 물체의 X, Y 및 θ 좌표를 결정하고 및/또는 기판 상의 각각 의 물체의 X, Y, θ 좌표를 예측하기 위해 인공 지능이 사용될 수 있다. 인공 지능 알고리즘은 다음 중 하나 이 상을 단독 또는 조합으로 포함할 수 있다: 기계 학습, 은닉 마르코프 모델(hidden Markov model); 순환 신경망 (recurrent neural network); 합성곱 신경망(convolutional neural network); 베이지안 기호법(Bayesian symbolic method); 생성적 적대 신경망(general adversarial network); 서포트 벡터 머신(support vector machine); 이미지 정합 방법(image registration method); 적용 가능한 기계 학습 기술; 적용 가능한 규칙 기 반 시스템; 및/또는 다른 적합한 인공 지능 알고리즘. 이러한 알고리즘, 네트워크, 기계 및 시스템은 \"인공 지 능을 사용하여 물체를 자동으로 검출하는 수단\"과 관련하여 사용되는 구조의 예를 제공한다. 도 4는 개시된 주제의 일부 실시형태에 따라 기판 상의 유동 물체를 자동으로 매핑하는 것을 구현할 수 있는 예 시적인 자동 매핑 현미경 검사 시스템을 도시하고 있다. 기판 상의 유동 물체를 자동으로 매핑하는 것은, 기판 상의 각각의 물체(또는 물체의 부분집합)에 대해, i) 물체를 식별하고 분류하는 단계와; ii) 기판 상의 물 체의 X, Y, θ 좌표를 결정하는 단계와; iii) 물체 변형을 결정하는 단계와; iv) 물체 이동을 결정하는 단계와; v) 물체 시작 스캔 위치를 결정하는 단계와; vi) 물체 이미징 정렬 위치를 결정하는 단계; 및/또는 vii) 물체 시퀀싱 경로를 결정하는 단계를 포함할 수 있다. 높은 수준에서, 일부 실시형태에 따른 자동 매핑 현미경 검사 시스템의 기본 구성요소는 현미경 시스템 과 컴퓨터 분석 시스템을 포함한다. 컴퓨터 분석 시스템의 기능은 (예를 들어, 도 5A 및 도 5B 에 도시된 바와 같이) 현미경 시스템에 통합될 수 있거나 (예를 들어 도 4에 도시된 바와 같이) 별도의 구 성요소일 수 있다. 현미경 시스템은 물체에 광을 제공하는 조명원과, 이미징 장치와, 스테이지 와, 저해상도 대물렌즈와, 고해상도 대물렌즈, 및 하드웨어, 소프트웨어 및/또는 펌웨어를 포함 하는 제어 모듈을 포함할 수 있다. 현미경 시스템은 임의의 적합한 유형의 현미경의 일부로서 구현될 수 있다. 예를 들어, 일부 실시형태에서, 시스템은 투과광 또는 반사광을 사용하는 광학 현미경의 일부로서 구현될 수 있다. 보다 구 체적으로, 시스템은 오하이오주 카이어호가 폴스(Cuyahoga Falls)의 Nanotronics Imaging, Inc.사로부터 입수 가능한 nSpec® 광학 현미경의 일부로서 구현될 수 있다. 현미경 시스템은 또한 공초점 또는 2광자 여기 현미경의 일부로서 구현될 수 있다. 도 5A(측면도) 및 도 5B(정면도)는 개시된 주제의 일부 실시형태에 따른 현미경 시스템의 실시형태의 일반 적인 구성을 도시하고 있다. 일부 실시형태에 따르면, 현미경 시스템은 저해상도 대물렌즈와 고해상 도 대물렌즈를 포함할 수 있다. 저해상도 대물렌즈와 고해상도 대물렌즈는 서로 다른 분해능을 갖는다. 저해상도 대물렌즈와 고해상도 대물렌즈는 또한 서로 다른 배율을 가질 수 있고 및/또는 명 시야/암시야 현미경법, 차등 간섭 대비(differential interference contrast, DIC) 현미경법 및/또는 형광을 포함하는 임의의 다른 적합한 형태의 현미경법으로 작동하도록 구성될 수 있다. 일부 실시형태에서, 물체의 고 해상도 스캐닝은 주사 전자 현미경(scanning electron microscope, SEM), 투과 전자 현미경(transmission electron microscope, TEM) 및/또는 원자간력 현미경(atomic force microscope, AFM)과 같은 고해상도 현미경 을 사용하여 수행될 수 있다. 일부 실시형태에서, 고해상도 현미경은 저해상도 현미경(예를 들어, 5x)보다 큰 배율(예를 들어, 100x)을 갖는 현미경일 수 있다. 물체를 검사하기 위해 사용되는 대물렌즈 및/또는 현미경 기 술은 일부 실시형태에서 소프트웨어, 하드웨어 및/또는 펌웨어에 의해 제어될 수 있다. 일부 실시형태에서, XY 변환 스테이지가 스테이지에 사용될 수 있다. XY 변환 스테이지는 스테퍼 모터, 서 버 모터, 선형 모터, 피에조 모터 및/또는 임의의 다른 적합한 메커니즘에 의해 구동될 수 있다. 일부 실시형태 에서, XY 변환 스테이지는 임의의 적합한 제어기의 제어 하에 X축 및/또는 Y축 방향으로 물체를 이동시키도록 구성될 수 있다. 예를 들어 0 내지 5 mm, 0 내지 10 mm, 0 내지 30 mm 및/또는 기타 적합한 거리 범위(들)의 대략적인 초점 조정을 하기 위해 (도면에 도시되지는 않았지만 본 기술 분야에 공지된) 액추에이터가 사용될 수 있다. 일부 실시형태에서, 액추에이터는 또한 예를 들어 0 내지 50 μm, 0 내지 100 μm, 0 내지 200 μm, 및/ 또는 임의의 다른 적합한 거리 범위의 미세 초점을 제공하기 위해 사용될 수 있다. 일부 실시형태에서, 현미경 시스템은 대물렌즈(430 및 435)를 향하고 이로부터 멀어지도록 Z방향으로 스테이지를 조정하고 및/또 는 스테이지를 향하고 이로부터 멀어지도록 저해상도 대물렌즈와 고해상도 대물렌즈를 조정하는 초점 메커니즘을 포함할 수 있다. 광원은 사용된 광원의 강도, 개수 및/또는 조명의 위치와 각도에 따라 변할 수 있다. 광원은 반사광 조명기를 통해 광을 전달할 수 있고 표본의 일부를 조명하기 위해 사용될 수 있으며, 따라서 광은 튜브 렌 즈를 통해 이미징 장치(예를 들어, 카메라)로 반사되고 이미징 장치는 물체의 이미지 및/또는 비디오를 캡처할 수 있다. 일부 실시형태에서, 사용된 광원은 백색광 시준 발광 다이오드(LED), 자외선 시 준 LED, 레이저 또는 형광등일 수 있다. 일부 실시형태에서, 이미징 장치는 이미지 센서를 포함하는 회전 가능한 카메라일 수 있다. 이미지 센서는 예를 들어 CCD, CMOS 이미지 센서 및/또는 광을 하나 이상의 전기 신호로 변환하는 임의의 다른 적합한 전자 장 치일 수 있다. 이러한 전기 신호는 물체의 이미지 및/또는 비디오를 형성하기 위해 사용될 수 있다. 현미경 시 스템에 의해 사용될 수 있는 카메라를 회전시키기 위한 일부 예시적인 방법은 \"현미경 검사에서 대면적 이 미징을 용이하게 하기 위한 카메라 및 물체 정렬(Camera and Object Alignment to Facilitate Large Area Imaging in Microscopy)\"이라는 제목의 미국 특허 제10,048,477호에 개시되어 있으며, 이 전체가 본원에 참조로 포함된다. 물체의 하나 이상의 3차원 지형 이미지를 생성하기 위해, 미리 정의된 크기, 개수 및 위치의 조명광과 함께 다 양한 지형 이미징 기술(초점 결상 알고리즘(shape-from-focus algorithm), 음영 결상 알고리즘(shape-from- shading algorithm), 광도측정 스테레오 알고리즘(photometric stereo algorithm) 및 푸리에 타이코그래피 변 조 알고리즘(Fourier ptychography modulation algorithm)을 포함하지만 이에 한정되지 않음)이 사용될 수 있 다. 일부 실시형태에서, 도 5A에 도시된 제어 모듈은 제어기와 제어기 인터페이스를 포함하고, 자동 매핑 현미 경 검사 시스템(예를 들어, 광원, 저해상도 대물렌즈와 고해상도 대물렌즈, 스테이지 및 이미징 장치)의 모든 설정뿐만 아니라 통신, 동작(예를 들어, 이미지 촬영, 광원 켜기 및 끄기, 스테이지 및/또는 대물렌즈(430, 435) 이동 및/또는 이미징 장치 회전)을 제어할 수 있다. 본원에 설 명된 제어 모듈 및 적용 가능한 컴퓨팅 시스템 및 구성요소는 예를 들어 컴퓨터, 마이크로프로세서, 마이 크로컨트롤러, 주문형 집적 회로(ASIC), 필드 프로그래머블 게이트 어레이(FGPA) 및 디지털 신호 프로세서 (DSP)(하드웨어 프로세서라고도 함), 인코더, 인코더를 읽기 위한 회로, 메모리 장치(하나 이상의 EPROMS, 하나 이상의 EEPROM, 동적 랜덤 액세스 메모리(\"DRAM\"), 정적 랜덤 액세스 메모리(\"SRAM\") 및/또는 플래시 메모리를 포함함) 및/또는 기타 적합한 하드웨어 요소와 같은 임의의 적합한 하드웨어(일부 실시형태에서 소프트웨어를 실행할 수 있음)를 포함할 수 있다. 일부 실시형태에서, 자동 매핑 현미경 검사 시스템 내의 개별 구성요 소는, 개별 구성요소를 제어하고 자동 매핑 현미경 검사 시스템 내의 다른 구성요소와 통신하기 위해 자체 의 소프트웨어, 펌웨어 및/또는 하드웨어를 포함할 수 있다. 일부 실시형태에서, 제어 모듈(예를 들어, 제어기와 제어기 인터페이스)과 자동 매핑 현미경 검사 시스템 의 구성요소 사이의 통신은 아날로그 기술(예를 들어, 릴레이 로직), 디지털 기술(예를 들어, RS232, 이더넷 또 는 무선), 네트워크 기술(예를 들어, 근거리 통신망(LAN), 광역 통신망(WAN), 인터넷), 블루투스 기술, 근거리 통신 기술, 보안 RF 기술, 및/다른 적합한 통신 기술과 같은 임의의 적합한 통신 기술을 사용할 수 있다. 일부 실시형태에서, 조작자 입력은 임의의 적합한 입력 장치(예를 들어, 키보드, 마우스, 조이스틱, 터치)를 사 용하여 제어 모듈에 전달될 수 있다. 다시 도 4를 참조하면, 자동 매핑 현미경 검사 시스템의 컴퓨터 분석 시스템은 아날로그 기술(예를 들어, 릴레이 로직), 디지털 기술(예를 들어, RS232, 이더넷 또는 무선), 네트워크 기술(예를 들어, 근거리 통 신망(LAN), 광역 통신망(WAN), 인터넷), 블루투스 기술, 근거리 통신 기술, 보안 RF 기술, 및/또는 다른 적합한 통신 기술을 사용하여 임의의 적합한 방식으로 현미경 시스템에 결합되거나 이에 포함될 수 있다. 컴퓨터 분석 시스템 및 컴퓨터 분석 시스템 내의 모듈은 현미경 시스템에 의해 출력되고 및/또는 컴퓨 터 판독 가능 매체에 의해 저장된 이미지를 사용하여 본원에 추가로 설명되는 다수의 기능을 수행하도록 구성될 수 있다.컴퓨터 분석 시스템은 예를 들어 컴퓨터, 마이크로프로세서, 마이크로컨트롤러, 주문형 집적 회로(ASIC), 필드 프로그래머블 게이트 어레이(FGPA) 및 디지털 신호 프로세서(DSP)(하드웨어 프로세서라고도 함), 인코더, 인코더를 읽기 위한 회로, 메모리 장치(하나 이상의 EPROMS, 하나 이상의 EEPROM, 동적 랜덤 액세스 메모리 (\"DRAM\"), 정적 랜덤 액세스 메모리(\"SRAM\") 및/또는 플래시 메모리를 포함함) 및/또는 기타 적합한 하드웨어 요소와 같은 임의의 적합한 하드웨어(일부 실시형태에서 소프트웨어를 실행할 수 있음)를 포함할 수 있다. 컴퓨터 판독 가능 매체는 컴퓨터에 의해 액세스될 수 있는 임의의 이용 가능한 매체일 수 있으며, 휘발성 및 비 휘발성 매체, 이동식 및 비이동식 매체를 모두 포함한다. 제한이 아닌 예로서, 컴퓨터 판독 가능 매체는 컴퓨터 저장 매체 및 통신 매체를 포함할 수 있다. 컴퓨터 저장 매체는 컴퓨터 판독 가능 명령어, 데이터 구조, 프로그 램 모듈 또는 기타 데이터와 같은 정보의 저장을 위한 임의의 방법 또는 기술로 구현된 휘발성 및 비휘발성, 이 동식 및 비이동식 매체를 모두 포함한다. 컴퓨터 저장 매체는 RAM, ROM, EEPROM, 플래시 메모리 또는 다른 메모 리 기술, CD-ROM, 디지털 비디오 디스크(DVD) 또는 다른 광 디스크 스토리지, 자기 카세트, 자기 테이프, 자기 디스크 스토리지 또는 다른 자기 저장 장치, 또는 원하는 정보를 저장하기 위해 사용될 수 있고 컴퓨터에 의해 액세스될 수 있는 다른 매체를 포함하지만 이에 한정되지 않는다. 일부 실시형태에 따르면, 컴퓨터 분석 시스템은 물체 식별 모듈(나중에 설명되고 도 8에 도시됨)과 물체 레이아웃 예측 모듈(나중에 설명되고 도 8에 도시됨)을 포함할 수 있다. 도 6A 및 도 6B는 개시된 주제의 일부 실시형태에 따라 인공 지능을 사용하여 기판 상의 유동 물체를 자동으로 매핑하기 위한 예시적인 방법(600A 및 600B)을 높은 수준으로 도시하고 있다. 일부 실시형태에서, 자동 매핑 동 작(600A 및 600B)은 자동 매핑 현미경 검사 시스템을 사용할 수 있다. 개시된 주제의 일부 실시형태에 따 라 컴퓨터 분석 시스템의 각각의 모듈이 구성될 수 있는 방법을 설명하는 추가 세부 사항은 도 8과 관련하 여 설명될 것이다. 단계 610A에서, 현미경 시스템은 예를 들어 저해상도 대물렌즈 또는 고해상도 대물렌즈를 사용 하여 기판을 스캔할 수 있다. 일부 실시형태에서, 기판은 기판의 전체 표면 또는 원하는 영역(\"관심 영역\")이 스캔될 때까지 X/Y 방향으로 이미징 장치 및/또는 스테이지를 이동시킴으로써 스캔될 수 있다. 저해 상도 스캔은 저해상도 대물렌즈를 사용하여 이미징 장치에 의해 캡처되고 생성된 기판 또는 기판 일 부의 일련의 저해상도 이미지를 의미할 수 있다. 고해상도 스캔은 고해상도 대물렌즈를 사용하여 이미징 장치에 의해 캡처되고 생성된 기판 또는 기판 일부의 일련의 고해상도 이미지를 의미할 수 있다. 일부 실시형태에서, 기판의 각각의 이미지는 (도 2에 도시된 바와 같이) 타일이라고 하며, 각각의 타일 은 기판 공간에서 XY 좌표 위치에 의해 찾을 수 있다. 타일은 이들의 XY 좌표 위치 및/또는 특징 기 반 정합 방법을 기반으로 함께 스티치(stitch)되어, 기판의 하나의 간섭 스캔(coherent scan)을 형성할 수 있다. 일부 실시형태에서, 기판의 하나 이상의 영역은, 서로 다른 초점 레벨을 사용하고 Z방향으로 스테이 지 및/또는 저해상도 대물렌즈를 이동시켜 스캔될 수 있다. 다시 도 6A를 참조하면, 단계 620A에서, (도 8에 도시된) 물체 식별 모듈은 스캔된 기판의 저해상도 또는 고해상도 이미지를 수신하고, 인공 지능 알고리즘, 컴퓨터 비전 및/또는 다른 적합한 컴퓨터 프로그램(본원에 추가로 설명됨)을 사용하여, i) 기판 상의 물체를 검출하고; ii) 물체 유형을 식별하고; iii) 물체의 X, Y, θ 좌표를 결정하고; iv) 이미징 정렬 위치를 식별하고 이러한 위치의 X, Y, θ 좌표를 결정하고; v) 시작 스캔 위치를 식별하고 이러한 위치의 X, Y, θ 좌 표를 결정하고; vi) 기판 상의 각각의 물체 또는 임의의 수의 물체에 대한 이미징 시퀀스(imaging sequence)를 결정하고; vii) (예를 들어, 이전 또는 원래 크기와 비교해서) 물체 및/또는 기판 변형 및/또는 (예를 들어, 초 기 물체 레이아웃 맵과 비교해서) 원래 위치로부터의 물체 이동을 계산하기 위해 사용되는 물체 매핑 정보를 결 정하고 생성할 수 있다. 일부 실시형태에서, 물체 매핑 정보는, 물체 및/또는 기판 유연성으로 인해 기판의 초 기 물체 레이아웃 맵과는 다를 수 있는, 기판 상의 물체의 현재 레이아웃을 나타내는 기판의 물체 레이아웃 맵 을 생성하기 위해 물체 식별 모듈에 의해 사용될 수 있다. 다시 도 6A를 참조하면, 단계 630A에서, 물체 식별 모듈은 물체 매핑 정보를 제어 모듈에 전송할 수 있다. 일부 실시형태에서(예를 들어, 물체가 시야보다 작은 실시형태의 경우), 제어 모듈은 스테이지, 이 미징 장치 및 물체를 정렬하여, 물체의 새로운 X, Y, θ 좌표 및/또는 변형을 처리할 수 있다. 예를 들어, 물체 가 시야보다 작은 경우, 제어 모듈은 기판에 대한 물체 매핑 정보에 따라 스테이지 및/또는 이미징 장치를 기판 상의 각각의 물체(또는 임의의 수의 물체)에 대한 이미징 정렬 위치로 이동시킬 수 있다. 이 미징 정렬 위치는 스캔 중인 물체와 유사한 물체의 대표 위치 또는 스캔 중인 물체에 대한 참조 템플릿을 기반 으로 할 수 있다. 다른 실시형태에서(예를 들어, 물체가 시야보다 큰 경우), 제어 모듈은 스테이지및/또는 이미징 장치를 기판 상의 각각의 물체(또는 임의의 수의 물체)에 대한 시작 스캔 위치로 이동시켜, 해당 물체 유형에 대한 이미징 시퀀스 및 물체에 대한 물체 매핑 정보에 따라 이미지 시퀀스를 촬영 한다. 시작 스캔 위치와 이미징 시퀀스는 스캔 중인 물체와 유사한 물체의 대표 위치와 시퀀스 또는 스캔 중인 물체에 대한 참조 템플릿을 기반으로 할 수 있다. 일부 실시형태에서, 촬영 중인 물체의 유형은 시작 스캔 위치, 이미징 정렬 위치 및/또는 이미징 시퀀스를 결정할 것이다. 추가 실시형태에서, 물체에 대한 이미지 시퀀 스는 하나의 더 큰 이미지로 전처리될 수 있고 분석을 위해 참조 물체와 비교될 수 있다. 추가 실시형태에서, 물체의 X, Y, θ 좌표 및/또는 변형을 기반으로, 물체의 치수를 둘러싸는 가상 타일 (도 7A에 도시됨)이 생성될 수 있다. 동일한 유형의 모든 물체는 분석을 용이하게 하기 위해 동일한 방식으로 가상 타일 내에서 정렬될 수 있다. 물체는 해당 물체에 대한 참조 템플릿의 정렬과 유사하게 가상 타일 내에서 정렬될 수 있다. 가상 타일은 하나의 큰 스캔으로 전처리되는 여러 개의 작은 스캔이다. 도 7A는 물체(Q)가 가 상 타일의 왼쪽 상단부에 정렬된, 제 1 사례에서의 물체(Q)를 도시하고 있다. 도 7B는 제 1 위치로부터 이 동한 후의 제 2 사례에서의 물체(Q)를 도시하고 있다. 가상 타일은 물체(Q)가 타일의 왼쪽 상단부에서 유 사하게 정렬되도록 새로운 위치에서 이를 둘러싸도록 유사하게 이동된다. 가상 타일은 스캔의 픽셀 수준 또는 타일 수준(즉, 시야)으로 그려질 수 있다. 본 기술 분야의 숙련자는 스테이지, 이미징 장치 또는 표본의 임의의 예비 정렬이 수행되었는지 여부에 관계없이 가상 타일이 생성될 수 있음을 쉽게 이해할 것이다. 도 6B에서의 단계 610B 및 단계 620B는 도 6A와 관련하여 설명한 단계 610A 및 단계 620A와 각각 동일할 수 있 다. 또한, 단계 620B에서, 물체 식별 모듈은 기판 상의 물체의 생성된 물체 레이아웃 맵을 기판 상의 물체 의 초기 또는 이전 물체 레이아웃 맵과 비교하고 피드백 데이터를 생성할 수 있다. 피드백 데이터는 물체의 참 조 이미지의 치수와 비교하여 물체의 치수가 변경된 양을 포함할 수 있지만 이에 한정되지 않는다. 참조 이미지 는 해당 유형의 물체 및/또는 이전 버전의 물체 자체에 대한 참조 템플릿을 포함할 수 있다. 피드백 데이터는 또한 물체가 초기 또는 이전 위치로부터 이동한 양 및/또는 기판 상의 물체의 방향 변화를 포함할 수 있다. 도 6B의 단계 630B에서, 물체 식별 모듈은 물체 매핑 정보와 피드백 데이터를 물체 레이아웃 예측 모듈 에 전송할 수 있다. 물체 레이아웃 예측 모듈은 기판 및 기판 상의 물체에 대한 다른 정보와 함께 물 체 식별 모듈로부터의 물체 매핑 정보와 피드백 데이터를 사용하여, 제조 및/또는 검사 공정의 특정 단계 동안의 기판 상의 물체의 X, Y, θ 좌표(예를 들어, 방향 및 이동)를 예측하고 및/또는 물체 변형을 예측할 수 있다. 일부 실시형태에서, 물체 레이아웃 예측 모듈은 예측된 위치를 물체 식별 모듈에 의해 생성된 실제 위치 정보와 비교할 수 있다. 물체의 실제 X, Y, θ 좌표가 검사 중인 유형의 물체 및/또는 기판에 대한 미리 정의된 허용 오차를 초과하는 경우(예를 들어, 물체 위치의 이동이 예상된 것보다 훨씬 크거나, 기판에 대 한 물체 위치의 평균 이동이 예상된 것보다 훨씬 큰 경우), 물체 레이아웃 예측 모듈은 경보를 생성할 수 있다. 유사하게, 물체 레이아웃 예측 모듈은 예측된 물체 변형을 물체 식별 모듈에 의해 생성된 실제 물체 변형 정보와 비교할 수 있다. 실제 물체 변형이 검사 중인 유형의 물체 및/또는 표본에 대한 미리 정의된 허용 오차를 초과하는 경우(예를 들어, 물체에 대한 변형 또는 기판 상의 평균 물체 변형이 예측된 것보다 훨씬 큰 경우), 물체 레이아웃 예측 모듈은 경보를 생성할 수 있다. 일부 실시형태에서, 물체 레이아웃 예측 모듈은 예측된 물체 위치를 물체 식별 모듈에 의해 생성된 실제 위치 정보와 비교하고 및/또는 예측된 물체 변형을 물체 식별 모듈에 의해 생성된 실제 물체 변형 정 보와 비교하여, 물체 레이아웃 예측 모듈의 예측 정확도를 평가할 수 있다. 일부 실시형태에서, 물체 레이 아웃 예측 모듈의 예측 정확도가 미리 정의된 시간(예를 들어, 물체 레이아웃 예측 모듈이 충분히 훈 련되는 시간) 동안 미리 정의된 허용 오차를 충족하면, 단계 610B 및 단계 620B는 생략될 수 있다. 물체 레이아 웃 예측 모듈에 의해 생성된 정보는 제어 모듈로 직접 전송될 수 있으며, 제어 모듈은 도 6A의 단계 630A와 관련하여 논의되는 바와 같이 스테이지, 이미징 장치 및 표본을 정렬하여, 물체의 새로 운 X, Y, θ 좌표 및/또는 변형을 처리할 수 있다. 자동 매핑 동작(600A 및 600B)의 특정 부분이 수행되는 시기의 구분은 다양할 수 있으며, 본원에 개시된 주제의 범위 내는 구분이 없거나 다른 구분이 있다. 일부 실시형태에서, 자동 매핑 동작(600A 및 600B)의 블록은 임의 의 적합한 시간에 수행될 수 있다는 점에 유의한다. 본원에 설명된 자동 매핑 동작(600A 및 600B)의 적어도 일 부는, 일부 실시형태에서, 도 6A 및 도 6B와 관련하여 도시되고 설명된 순서와 차례로 제한되지 않는 임의의 순 서 또는 차례로 수행될 수 있음을 알아야 한다. 또한, 본원에 설명된 프로세스(600A 및 600B)의 일부 부분은 적 합한 경우 실질적으로 동시에 또는 일부 실시형태에서 병렬로 수행될 수 있다. 추가적으로 또는 대안적으로, 프 로세스(600A 및 600B)의 일부 부분은 일부 실시형태에서 생략될 수 있다. 자동 매핑 동작(600A 및 600B)은 임의 의 적합한 하드웨어 및/또는 소프트웨어에서 구현될 수 있다. 예를 들어, 일부 실시형태에서, 자동 매핑 동작(600A 및 600B)은 자동 매핑 현미경 검사 시스템에서 구현될 수 있다. 도 8은 개시된 주제의 일부 실시형태에 따른 컴퓨터 분석 시스템의 실시형태의 일반적인 구성을 도시하고 있다. 일부 실시형태에서, 물체 식별 모듈은 현미경 시스템 및/또는 임의의 적합한 컴퓨터 판독 가능 매체 로부터 기판 또는 기판 일부의 저해상도 또는 고해상도 스캔을 수신하도록 구성될 수 있다. 물체 식별 모듈은, 일부 실시형태에서, 컴퓨터 비전, 하나 이상의 인공 지능 알고리즘(들) 및/또는 컴퓨터 알고리즘을 포함할 수 있는 이미지 처리 알고리즘을 사용하여, 수신된 저해상도 또는 고해상도 스캔에서 하나 이상의 물체를 검출하도록 구성될 수 있다. 물체의 검출은 예를 들어 물체의 컴퓨터 지원 설계(CAD) 파일, 검사 중인 기판의 초기 또는 이전 물체 레이아웃 맵, 알려진 물체의 이미지, 알려진 물체에 대한 참조 템플릿 및/또 는 알려진 물체에 대한 정보(예를 들어, 물체의 치수, 물체의 기계적 및/또는 물리적 특성)를 기반으로 할 수 있다. 일부 실시형태에서, 물체 식별 모듈은 수신된 기판 스캔에 도 9에 도시된 바와 같은 이미지 처리 알고리즘 을 적용하고, 기판 상의 각각의 물체 또는 관심 영역에 대해: i) 물체를 검출하고; ii) 물체 유형을 결정하고; iii) 방향을 결정하고; iv) 이미징 정렬 위치를 식별하고; 및/또는 v) 시작 스캔 위치를 식별할 수 있다. 물체 식별 모듈은 기판 상의 기준점과 관련하여 이러한 정보를 더 사용하여, i) 기판 상의 각각의 물체와: ii) 기판 상의 각각의 물체에 대한 이미징 정렬 위치; 및/또는 iii) 기판 상의 각각의 물체에 대한 시작 스캔 위치 의 X, Y, θ 좌표를 결정할 수 있다. 물체 식별 모듈은 또한 물체 및/또는 기판 변형을 계산하고 및/또는 (예를 들어, 초기 물체 레이아웃 맵과 비교해서) 원래 위치로부터의 물체 이동을 계산하기 위해 사용될 수 있다. 검출은, 인쇄된 기판 스캔의 경우 인쇄물에서 또는 디스플레이 화면에 디스플레이되는 기판의 경우 시각적으로, 기판 스캔 상의 물체를 (예를 들어, 검출된 물체 주위에 점선 박스(dashed box)를 그려서) 시각적으로 식별하는 것을 의미할 수 있다. 물체 식별 모듈은 또한 각각의 검출된 물체에 대해, i) 물체 유형과; ii) 물체 방향 과: iii) 이미지 정렬 위치; 및 iv) 시작 스캔 위치를 포함하지만 이에 한정되지 않는 추가 정보를 결정하도록 구성될 수 있다. 이 정보는 디스플레이 화면에 기판 스캔이 디스플레이될 때 시각적으로도 디스플레이될 수 있 다. 대안적으로, 이 정보를 제공하는 텍스트 파일이 생성될 수 있다. 물체 식별 모듈은 기판 상의 참조 마커와 관련하여 기판 공간의 X, Y, θ 위치에 검출된 물체, 이미징 정 렬 위치 및/또는 시작 스캔 위치를 매핑하도록 더 구성될 수 있다. 또한, 물체 식별 모듈은 각각의 물체를 해당 물체 유형에 대한 참조 이미지와 비교하여 물체/특징 변형을 계산할 수 있다. 물체 식별 모듈은 또한, 일 부 실시형태에서, 물체의 현재 X, Y, θ 좌표를 이전 X, Y, θ 위치 또는 해당 물체에 대한 예상 X, Y, θ 위치 와 비교하여 물체 이동량을 계산할 수 있다. θ 또는 방향은, 도 10A 및 도 10B와 관련하여 논의되는 바와 같이, 물체의 이전 θ 위치 또는 기판의 원점에 대한 물체의 예상 θ 위치와 비교하여 고정된 지점을 중심으로 회전한 양을 나타낸다는 점에 유의한다. 일부 실시형태에서, 기판의 수신된 저해상도 또는 고해상도 스캔에서 물체를 검출하기 위해, 하나 이상의 이미 지 처리 인공 지능 알고리즘(들)을 기반으로 하는 이미지 처리 알고리즘이 사용될 수 있다. 각각의 검출된 물체 에 대해, i) 물체 유형과; ii) 물체 회전과; iii) 이미지 정렬 위치; 및/또는 iv) 시작 스캔 위치를 포함하지만 이에 한정되지 않는 추가 정보를 결정하기 위해, 인공 지능을 기반으로 하는 이미지 처리 알고리즘이 또한 물체 식별 모듈에 의해 사용될 수 있다. 일부 실시형태에서, 물체 식별 모듈에 의해 사용되는 알고리즘(들)은 물체를 더 잘 검출하고 인식할 뿐만 아니라 물체 유형, 물체 회전, 이미지 정렬 위치 및/또는 시작 스캔 위치를 결정하기 위해, 기판 상의 물체의 위치, 검사 중인 물체의 유형, 물체가 위치하는 기판의 유 형, 검사 중인 물체/기판의 물리적 및 기계적 특성, 동일하거나 유사한 유형의 기판 상의 유사한 물체, 검사 물 체에 대한 참조 템플릿, 검사 기판에 대한 초기 물체 레이아웃 맵과 같은 상황 데이터(context data)를 고려할 수 있다. 물체 식별 모듈에 의해 사용될 수 있는 인공 지능 기반 이미지 처리 알고리즘의 예는 문헌(Barbara Zitova, \"Image Registration Methods: A Survey,\" Image and Vision Computing, October 11, 2003, Volume 21, Issue 11, pp. 977-1000)에 개시되어 있으며, 이 전체가 본원에 참조로 포함된다. 개시된 방법은 단지 예일 뿐이며 제한하려는 것은 아니다. 또한, 물체 식별 모듈은 수신된 기판 스캔을 처리하기 위해 합성곱 신경 망, 순환 신경망 및/또는 다른 인공 신경망을 사용할 수 있다. 일부 실시형태에서, 도 9에 도시된 바와 같이,이미지 처리 알고리즘은 물체 식별 모듈이 기판 상의 물체를 검출하고 인식할 수 있도록 훈련 데이터 로 먼저 훈련된다. 훈련 데이터는 알려진 유형의 물체(예를 들어, 특정 자동 매핑 현미경 검사 시스 템에서 검사될 가능성이 있는 다양한 유형의 물체)의 라벨링된 예를 포함할 수 있다. 각각의 유형의 물체 에 대해, 훈련 데이터는 실제 변형된 물체(예를 들어, 제조 공정의 결과로 변형된 물체)의 라벨링된 이미 지를 더 포함할 수 있다. 추가 실시형태에서, 물체는 미리 정의된 파라미터에 따라 인위적으로 변형될 수 있으 며, 훈련 데이터는 이러한 변형된 물체의 라벨링된 이미지를 포함할 수 있다. 훈련 데이터는 또한 0- 360도에서 회전된 각각의 물체 유형의 라벨링된 이미지를 포함할 수 있다. 또한, 훈련 데이터는 이미지 내 의 시작 스캔 위치 및/또는 이미징 정렬 위치를 식별하는 검사될 각각의 유형의 물체의 라벨링된 이미지를 포함 할 수 있다. 일부 실시형태에서, 훈련 데이터는 물체의 크기, 모양, 구성, 기판 상의 위치, 물체의 물리적 /기계적 특성 및/또는 임의의 다른 적합한 특성과 관련된 데이터를 포함할 수 있다. 일부 실시형태에서, 훈련 데이터는 또한 라벨링이 되지 않은 데이터를 포함할 수 있다. 이미지 처리 알고리즘이 훈련되고 나면, 이는 수신된 기판 스캔에 물체 식별 모듈에 의해 적용되어, 물체 를 검출하고, 물체 유형을 분류하고, 물체 방향을 결정하고, 이미지 정렬 위치 및/또는 시작 스캔 위치를 식별 할 수 있다(개별적으로 그리고 집합적으로, 출력 데이터). 물체 식별 모듈은 또한 물체 변형을 계산하고, 물체 이동량을 결정하고, 검출된 물체를 기판 상의 X, Y, θ 좌표에 매핑하고, 물체에 대해 식별된 이미지 정렬 위치를 X, Y, θ 좌표에 매핑하고, 물체에 대해 식별된 시작 스캔 위치를 기판 상의 X, Y, θ 위치에 매핑하며, 물체 유형 및 방향에 따라 이미징 시퀀스를 정의하도록 구성될 수 있다. 이러한 기능 각각은 인공 지능을 사용하거나 사용하지 않고 수행될 수 있으며, 다음 단락에서 더 상세히 설명될 것이다. 일부 실시형태에서, 물체 식별 모듈은 검출된 물체와 참조 이미지 사이 또는 물체의 특정 특징과 참조 이 미지 사이의 전체 치수의 편차를 비교하여 물체 변형을 계산할 수 있다. 참조 이미지는 해당 물체 유형에 대한 참조 템플릿 및/또는 검출된 물체의 이전 이미지일 수 있다. 물체가 검출되고 나면, 물체 식별 모듈은 도 3A 및 도 3B와 관련하여 논의된 바와 같이, 검출된 물체를 알 려진 좌표계의 특정 X, Y 위치에 매핑할 수 있다. 유사하게, 물체 식별 모듈은 물체의 이미징 정렬 위치 및/또는 물체의 시작 스캔 위치를 도 3A 및 도 3B와 관련하여 논의된 바와 같이, 알려진 좌표계의 특정 X, Y 위 치에 매핑할 수 있다. 일부 실시형태에서, 기판 상의 물체의 θ 위치는 이미지 처리 알고리즘에 의해 출력된 θ 위치 정보를 사용하여 계산될 수 있다. 예를 들어, 유사한 방향을 가진 유사한 물체의 훈련 데이터를 기반으로, 이미지 처리 알고리즘 은 물체의 θ 위치를 결정할 수 있다. 다른 실시형태에서, 이미지 처리 알고리즘은 물체를 참조 이미지와 비교 하고 θ 위치를 결정하기 위해 이미지 정합 방법을 적용할 수 있다. 회전을 결정하기 위한 이미지 예시적인 정 합 방법은 문헌(Barbara Zitova, \"Image Registration Methods: A Survey,\" Image and Vision Computing, October 11, 2003, Volume 21, Issue 11, pp. 977-1000)에 개시되어 있으며, 이 전체가 본원에 참조로 포함된 다. 추가 실시형태에서, 물체 식별 모듈은 참조 물체 내에서, 특정 특징 또는 기준점을 사용하여 각각의 물체 유형에 대한 기준 방향을 결정할 수 있다. 방향은 기판의 원점을 기준으로 한다. 물체의 방향이 얼마나 변 경되었는지 계산하기 위해, 물체 식별 모듈은 검출된 물체에 대한 특징 또는 기준점을 아핀 변환(affine transformation)을 사용하여 참조 물체 내의 유사한 특징과 비교할 수 있다. 아핀 변환은 예를 들어 문헌 (Donald H. House et al., Foundations of Physically Based Modeling and Animation, 335-341, 2017)에 개시 되어 있으며, 이 전체가 본원에 참조로 포함된다. 도 10A 및 도 10B는 물체(A) 상의 동일한 두 개의 기준점(A1 및 A2)을 사용하여 제 1 시점(도 10A에 제시됨)에 서부터 제 2 시점(도 10B에 제시됨)까지의 물체(A)의 회전을 기반으로 방향이 계산되는 예시적인 실시형태를 도 시하고 있다. A1 및 A2는 단지 예일 뿐이며 물체(A) 상의 다른 기준점 또는 특징이 사용될 수 있다. 보다 구체적 으로, 도 10A에 도시된 바와 같이, 물체(A)에 대한 제 1 기준점(A1)은 알려진 좌표계를 사용하여 제 1 시점에 XY에 위치할 수 있다. 기준선(R1)은 기준점(A1)과 제 2 기준점(A2)을 통해 그릴 수 있다. 제 1 각도(θ1)는 X축 과 R1의 교차점을 기준으로 측정될 수 있다. 도 10B에 도시된 바와 같이. 물체(A)에 대한 동일한 기준점(A1)은 제 2 시점에 X2Y2에 위치할 수 있다. 기준선(R2)은 새로운 위치에서 기준점(A1)과 기준점(A2)을 통해 그릴 수 있 다. 제 2 각도(θ2)는 X축과 R2의 교차점을 기준으로 측정될 수 있다. θ2는 θ1에서 차감되어, 도 10B에서 물체(A)의 방향을 결정할 수 있다. 일부 실시형태에서, 물체 식별 모듈은 각각의 알려진 물체 유형에 대해 미리 정의된 이미징 시퀀스를 연관 시키도록 프로그래밍될 수 있다. 검출된 물체가 분류될 때, 물체 식별 모듈은 검출된 물체를 해당 물체 유 형에 대해 미리 정의된 이미징 시퀀스와 연관시킬 수 있다. 또한, 물체 식별 모듈은 미리 정의된 이미징 시퀀스를 적용하여, 검출된 물체에 대한 이미지를 캡처하기 위해 이 정보를 제어 모듈 또는 이미징 장치 로 전송할 수 있다. 일부 실시형태에서, 물체 식별 모듈은 (예를 들어, 초기 또는 이전 물체 레이아웃 맵을 기반으로) 기판 상 의 물체의 현재 XY 위치를 물체의 초기 또는 이전 XY 위치와 비교하여, 물체 이동량을 계산할 수 있다. 물체 식 별 모듈은 이 정보를 물체 레이아웃 맵 생성 모듈 및/또는 물체 레이아웃 예측 모듈로 전송할 수 있다. 일부 실시형태에서, 물체 레이아웃 예측 모듈은, 검사 중인 물체의 유형, 물체가 위치하는 기판의 유형, 검사 중인 물체/기판의 물리적 및 기계적 특성, 동일하거나 유사한 유형의 기판 상의 유사한 물체, 검사 물체에 대한 참조 템플릿, 검사 기판에 대한 초기 물체 레이아웃 맵 등과 같은 다른 상황 데이터와 함께, 물체 식별 모 듈로부터 피드백 데이터 및/또는 물체 매핑 정보를 수신할 수 있다. 피드백 데이터는 제조 또는 검사 공정 의 특정 단계에서의 기판 상의 각각의 물체에 대한 X, Y, θ 위치, 및 제조 또는 검사 공정 동안 기판 상의 각 각의 물체가 변형되고, 이동하고 및/또는 방향을 변경한 양을 포함할 수 있지만 이에 한정되지 않는다. 물체 레 이아웃 예측 모듈은 이 정보를 사용하여 제조 또는 검사 공정 동안 다양한 단계에서 물체의 X, Y, θ 위치 및/또는 물체가 변형될 가능성이 있는 양에 대한 예측을 할 수 있다. 이 정보는 기판 상에 물체를 적절하게 배 치하고 및/또는 제조 또는 검사 공정에서 단계 및/또는 구성요소를 보정하여 물체 및/또는 기판의 예상 이동 및 /또는 변형을 수용하기 위해 사용할 수 있다. 이 정보는 또한 기판 상의 물체가 예측된 양을 초과하여 위치를 이동했는지 또는 물체 및/또는 기판이 예측된 양을 초과하여 변형되었는지를 결정하기 위해 사용될 수 있다. 일부 실시형태에서, 물체 레이아웃 예측 모듈은 기판의 초기 물체 레이아웃을 수신할 수 있고, 인공 지능을 사 용하는 레이아웃 예측 알고리즘을 적용하여, 도 11에 도시된 바와 같이 제조 및/또는 검사 공정의 특정 단계에 서 기판의 새로운 물체 레이아웃을 결정할 수 있다. 새로운 물체 레이아웃 맵은 초기 물체 레이아웃(또는 관심 영역) 상의 각각의 물체에 대해 X, Y, θ 위치 및/또는 제조 및/또는 검사 과정의 특정 단계 동안 물체 및/또는 기판이 변형될 가능성이 있는 양을 포함할 수 있다. 물체 레이아웃 예측 모듈은, 일부 실시형태에서, 선형 회귀 모델 또는 다중 선형 회귀 모델을 사용하여 구현될 수 있다. 선형 회귀 모델링은 종속 변수와 하나 이상의 독립 변수 간의 선형 관계를 모델링하기 위한 기계 학습 기술이다. 단일 스칼라 예측을 사용하는 간단한 선형 회귀 모델이 본원에 설명된 물체 레이아웃 예측을 수행하 기 위해 사용될 수 있다. 대안적으로, 다수의 예측자를 이용하는 다중 선형 회귀 모델이 본원에 설명된 물체 레 이아웃 예측을 수행하기 위해 사용될 수 있다. 일부 실시형태에서, 물체 레이아웃 예측 알고리즘은 먼저 훈련 데이터로 훈련된다. 훈련 데이터는 회귀 학습 알 고리즘이 예측하려는 입력 특성(X)과 출력 또는 목표 변수(Y)의 쌍(훈련 예제라고도 함)을 포함할 수 있다. 훈 련 예제는 함수: 가설(H): X → Y를 학습하기 위해 사용될 수 있고, 따라서 H(X)는 Y의 상응하는 값에 대 한 합리적인 예측자가 된다. 도 11은 개시된 주제의 일부 실시형태에 따른 예시적인 훈련 모델을 도시하고 있다. 훈련 예제의 입력은 기판 상의 각각의 물체에 대해: 제조 공정의 제 1 단계(예를 들어, 초기 레이 아웃 맵, 포토레지스트 단계, 세정 단계, 사전 다이싱 단계)에서의 현재 X, Y, θ 위치 및 물체/기판 유형을 포 함할 수 있다. 훈련 예제의 출력은 기판 상의 각각의 물체에 대해, 제조 공정의 제 2 단계에서의 X, Y, θ 위치, 변형 및/또는 이동량을 포함할 수 있다. 훈련되고 나면, 물체 레이아웃 알고리즘은 제 1 제조 및/또는 검사 사례에서 기판에 대한 물체 레이아웃 맵뿐만 아니라 물체/기판 유형에 대한 기타 정보를 수신하고, 제조 또는 검사 공정의 제 2 사례에서 기판 상의 물체의 X, Y, θ 위치 및/또는 물체 및/또는 기판에 대해 예상되는 변형의 양을 예측할 수 있다. 물체 레이아웃 알고리즘은 물체 식별 모듈로부터 피드 백 데이터를 지속적으로 또는 주기적으로 수신하고, 가설(H)을 수정할 수 있다. 도 6B의 단계 630B와 관련하여 설명된 바와 같이, 물체 레이아웃 예측 모듈은 기판 상의 물체의 예측된 위 치를 물체 식별 모듈에 의해 생성된 실제 위치 정보와 비교하고, 경보를 생성할지 여부를 결정할 수 있다. 또한, 물체 레이아웃 예측 모듈은 예측된 물체 위치를 물체 식별 모듈에 의해 생성된 실제 위치 정보 와 비교하고 및/또는 예측된 물체 변형을 물체 식별 모듈에 의해 생성된 실제 물체 변형 정보와 비교하여, 물체 레이아웃 예측 모듈의 예측 정확도를 평가할 수 있다.자동 매핑 현미경 검사 시스템을 위한 구성요소의 기능은 단일 구성요소로 결합되거나 여러 구성요소에 걸 쳐 분산될 수 있다. 일부 실시형태에서, 일부 구성요소의 기능(예를 들어, 컴퓨터 분석 시스템에 의한 컴 퓨터 처리)은 현미경 시스템으로부터 원격으로 수행될 수 있다. 일부 실시형태에서, 제어 분석 시스템은 현미경 시스템으로 결합될 수 있다. 자동 매핑 현미경 검사 시스템은 도시되지 않은 다른 적합한 구성요소를 포함할 수 있다는 점에 유의한다. 추가적으로 또는 대안적으로, 자동 매핑 현미경 검사 시스템에 포함된 일부 구성요소는 생략될 수 있다. 일부 실시형태에서, 본원에 설명된 기능 및/또는 프로세스를 수행하기 위한 명령을 저장하기 위해 임의의 적합 한 컴퓨터 판독 가능 매체가 사용될 수 있다. 예를 들어, 일부 실시형태에서, 컴퓨터 판독 가능 매체는 일시적 이거나 비일시적일 수 있다. 예를 들어, 비일시적 컴퓨터 판독 가능 매체에는 비일시적 자기 매체(예를 들어, 하드 디스크, 플로피 디스크 등), 비일시적 광학 매체(예를 들어, 콤팩트 디스크, 디지털 비디오 디스크, 블루 레이 디스크 등), 비일시적 반도체 매체(예를 들어, 플래시 메모리, 전기적 프로그램 가능 판독 전용 메모리 (electrically programmable read only memory, EPROM), 전기적 소거 및 프로그램 가능 판독 전용 메모리 (electrically erasable programmable read only memory, EEPROM) 등), 전송 동안 일시적이지 않거나 또는 영 속성의 외관이 전혀 없지는 않은 임의의 적합한 매체 및/또는 적합한 유형의 매체와 같은 매체를 포함할 수 있 다. 또 다른 예로서, 일시적 컴퓨터 판독 가능 매체는 네트워크, 와이어, 전도체, 광섬유, 회로, 및 전송 동안 일시적이고 영속성의 외관이 전혀 없는 임의의 적합한 매체 및/또는 임의의 적합한 무형 매체 상의 신호를 포함 할 수 있다. 본원에 설명된 다양한 시스템, 방법 및 컴퓨터 판독 가능 매체는 클라우드 네트워크 환경의 일부로서 구현될 수 있다. 본 문서에서 사용된 클라우드 기반 컴퓨팅 시스템은 가상화된 컴퓨팅 리소스, 소프트웨어 및/또는 정보를 클라이언트 장치에 제공하는 시스템이다. 컴퓨팅 리소스, 소프트웨어 및/또는 정보는 종단 장치가 네트워크와 같은 통신 인터페이스를 통해 액세스할 수 있는 중앙 집중식 서비스 및 리소스를 유지함으로써 가상화될 수 있 다. 클라우드는, 서비스형 소프트웨어(Software as a Service, SaaS)(예를 들어, 협업 서비스, 이메일 서비스, 전사적 자원관리 계획 서비스, 콘텐츠 서비스, 통신 서비스 등), 서비스형 인프라(Infrastructure as a Service, IaaS)(예를 들어, 보안 서비스, 네트워킹 서비스, 시스템 관리 서비스 등), 서비스형 플랫폼(Platform as a Service, PaaS)(예를 들어, 웹 서비스, 스트리밍 서비스, 애플리케이션 개발 서비스 등), 및 서비스형 데 스크톱(desktop as a service, DaaS), 서비스형 정보 기술 관리(information technology management as a service, ITaaS), 서비스형 관리 소프트웨어(managed software as a service, MSaaS), 서비스형 모바일 백엔드 (mobile backend as a service, MBaaS) 등과 같은 다른 유형의 서비스와 같은 클라우드 요소를 통해 다양한 클 라우드 서비스를 제공할 수 있다. 본원에 설명된 예의 제공(및 \"~와 같은,\" \"예를 들어\", \"포함하는\" 등으로 표현되는 절)은 청구된 주제를 특정 예로 제한하는 것으로 해석되어서는 안 되고; 오히려, 예는 가능한 많은 양태 중 일부만을 설명하기 위한 것이다. 본 기술 분야의 숙련자는 메커니즘이라는 용어가 하드웨어, 소프트웨어, 펌웨어 또는 이들의 임의의 적합한 조합을 포함할 수 있다는 것을 인식할 것이다. 상기 논의로부터 명백한 바와 같이 달리 구체적으로 언급되지 않는 한, 설명 전반에 걸쳐 \"결정하는\", \"제공하 는\", \"식별하는\", \"비교하는\" 등과 같은 용어를 사용하는 논의는, 컴퓨터 시스템 메모리 또는 레지스터 또는 다 른 이러한 정보 저장, 전송 또는 디스플레이 장치 내에서 물리적(전자) 양으로 표현된 데이터를 조작하고 변환 하는 컴퓨터 시스템 또는 유사한 전자 컴퓨팅 장치의 동작과 프로세스를 의미하는 것으로 이해해야 한다. 본 개시의 특정 양태는 알고리즘의 형태로 본원에 설명된 공정 단계 및 명령을 포함한다. 본 개시의 공정 단계 및 명령은 소프트웨어, 펌웨어 또는 하드웨어로 구현될 수 있고, 소프트웨어로 구현될 때 실시간 네트워크 운영 체제에 의해 사용되는 다양한 플랫폼에 상주하고 이로부터 작동하도록 다운로드될 수 있다는 점에 유의해야 한 다. 본 개시는 또한 본원에서의 동작을 수행하기 위한 장치에 관한 것이다. 이 장치는 필요한 목적을 위해 특별히 구성될 수 있거나, 컴퓨터에 의해 액세스될 수 있는 컴퓨터 판독 가능 매체에 저장된 컴퓨터 프로그램에 의해 선택적으로 작동되거나 재구성되는 범용 컴퓨터를 포함할 수 있다. 이러한 컴퓨터 프로그램은, 플로피 디스크, 광 디스크, CD-ROM, 자기 광 디스크, 판독 전용 메모리(ROM), 랜덤 액세스 메모리(RAM), EPROM, EEPROM, 자기 또는 광 카드, 주문형 집적 회로(ASIC), 또는 전자 명령을 저장하는 데 적합한 모든 유형의 비일시적 컴퓨터 판 독 가능 저장 매체를 포함하지만 이에 한정되지 않는 컴퓨터 판독 가능 저장 매체에 저장될 수 있다. 또한, 명 세서에서 언급된 컴퓨터는 단일 프로세서를 포함할 수 있거나 증가된 컴퓨팅 성능을 위해 다중 프로세서 설계를사용하는 아키텍처일 수 있다. 본원에 제시된 알고리즘 및 동작은 본질적으로 임의의 특정 컴퓨터 또는 다른 장치와는 관련이 없다. 다양한 범 용 시스템이 또한 본원의 교시에 따라 프로그램과 함께 사용될 수 있거나, 필요한 방법 단계 및 시스템-관련 동 작을 수행하기 위해 보다 전문화된 장치를 구성하는 것이 편리함을 증명할 수 있다. 다양한 이들 시스템에 필요 한 구조는 등가 변형과 함께 본 기술 분야의 숙련자에게 명백할 것이다. 또한, 본 개시는 임의의 특정 프로그래 밍 언어를 참조하여 설명되지 않는다. 다양한 프로그래밍 언어가 본원에 설명된 본 개시의 교시를 구현하기 위 해 사용될 수 있고, 특정 언어에 대한 모든 언급은 본 개시의 실시 가능성 및 최상의 모드의 개시를 위해 제공 된다는 것으로 이해해야 한다. 기판 메커니즘 상의 유동 물체의 자동 매핑, 방법 및 시스템은 이러한 예시된 실시형태를 구체적으로 참조하여 상세하게 설명되었다. 그러나, 상기한 명세서에서 설명된 본 개시의 사상 및 범위 내에서 다양한 수정 및 변경 이 이루어질 수 있으며, 이러한 수정 및 변경은 본 개시의 등가물 및 일부로 간주되어야 한다는 것이 명백할 것 이다. 본 개시의 범위는 다음의 청구 범위에 의해서만 제한된다."}
{"patent_id": "10-2021-7014781", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 개시의 위에서 설명한 그리고 다른 장점 및 특징이 달성될 수 있는 방식을 설명하기 위해, 위에서 간략하게 설명한 원리에 대한 보다 구체적인 설명이 첨부된 도면에 도시된 이들의 특정 실시형태를 참조하여 제공될 것이다. 이들 도면은 본 개시의 예시적인 실시형태만을 도시하고 따라서 이들의 범위를 제한하는 것으로 간주되지 않는다는 것을 이해하면, 본원의 원리는 첨부된 도면의 사용을 통해 더 구체적이고 상세하게 기술되고 설명된다, 도면에서: 도 1A는 이미징 타일 상의 물체의 시야의 상면도를 도시한다. 도 1B는 이미징 타일 상의 물체의 시야의 상면도를 도시하며, 여기서 시야와 물체는 도 1A와 비교할 때 회전하 였다. 도 2는 각각의 타일에 의해 나타낸 이미징 장치의 시야를 초과하고, 전체 물체를 캡처하기 위해 이미지 시퀀스 (예를 들어, 타일(1-18))가 필요한, 기판 상의 물체를 도시한다. 도 3A는 제조 공정의 다양한 단계에서의 또는 검사 공정의 다양한 시간에 발생하는 기판 상의 물체(A-F)의 예시 적인 레이아웃을 포함하는 초기 물체 레이아웃을 도시한다.도 3B는 도 3A에 도시된 것과 다른 위치에서, 제조 공정의 다양한 단계에서의 또는 검사 공정의 다양한 시간에 발생하는 기판 상의 물체(A-F)의 예시적인 레이아웃을 포함하는 추후 물체 레이아웃을 도시한다. 도 4는 현미경 시스템과 컴퓨터 분석 모듈을 포함하는 자동 매핑 현미경 검사 시스템의 예를 도시한다. 도 5A는 이미징 장치, 광원, 대물렌즈, 표본, 스테이지, 제어 모듈 및 컴퓨터 분석 모듈을 보여주는 현미경 시 스템의 일 실시형태의 측면도를 도시한다. 도 5B는 이미징 장치, 광원, 대물렌즈, 표본, 스테이지, 제어 모듈 및 컴퓨터 분석 시스템을 보여주는 현미경 시스템의 일 실시형태의 정면도를 도시한다. 도 6A는 기판 상의 유동 물체를 자동으로 매핑하기 위한 예시적인 방법 단계를 도시한다. 도 6B는 예측 단계를 포함하는, 기판 상의 유동 물체를 자동으로 매핑하기 위한 예시적인 방법 단계를 도시한다. 도 7A는 물체(Q)가 가상 타일의 왼쪽 상단부에 정렬된, 제 1 사례에서의 물체(Q)를 도시한다. 도 7B는 도 7A에 도시된 제 1 위치로부터 이동한 후의 제 2 사례에서의 물체(Q)를 도시한다. 도 8은 컴퓨터 분석 시스템의 일 실시형태의 일반적인 구성을 도시한다. 도 9는 물체 식별 모듈이 특정 출력을 제공하기 위해 기판 상의 물체를 검출하고 인식할 수 있도록 훈련 데이터 로 먼저 훈련된 이미지 처리 알고리즘을 도시한다. 도 10A 및 도 10B는 물체(A) 상의 동일한 두 개의 기준점(A1 및 A2)을 사용하여 제 1 시점(도 10A에 제시됨)에 서부터 제 2 시점(도 10B에 제시됨)까지의 물체(A)의 회전을 기반으로 방향이 계산되는 예시적인 실시형태를 도 시한다. 도 11은 특정 가설을 얻기 위해 표본 레이아웃 알고리즘에 입력되는 특정 입력 및 출력을 사용하는 예시적인 훈 련 모델을 도시한다."}
