{"patent_id": "10-2019-0150746", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0062477", "출원번호": "10-2019-0150746", "발명의 명칭": "전자 장치 및 그 제어 방법", "출원인": "삼성전자주식회사", "발명자": "태용민"}}
{"patent_id": "10-2019-0150746", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,상이한 영상 처리를 수행하도록 학습된 복수의 제1 인공 지능 모델에 대한 정보 및 상기 복수의 제1 인공 지능모델 각각에 의한 이미지의 처리 결과를 예측하여 상기 이미지의 타입을 식별하도록 학습된 제2 인공 지능 모델에 대한 정보가 저장된 메모리; 및상기 메모리와 연결되어 상기 전자 장치를 제어하는 프로세서;를 포함하고,상기 프로세서는,입력 이미지를 상기 제2 인공 지능 모델에 입력하여 상기 입력 이미지의 타입을 식별하고,상기 식별된 타입에 기초하여 상기 입력 이미지를 상기 복수의 제1 인공 지능 모델 중 하나에 입력하여 상기 입력 이미지를 처리하는, 전자 장치."}
{"patent_id": "10-2019-0150746", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 프로세서는,상기 입력 이미지의 해상도를 다운 스케일링한 후, 상기 다운 스케일링된 이미지를 상기 제2 인공 지능 모델에입력하여 상기 입력 이미지의 타입을 식별하는, 전자 장치."}
{"patent_id": "10-2019-0150746", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 프로세서는,상기 입력 이미지의 크기가 기설정된 크기 이상이면 상기 입력 이미지를 다운 스케일링한 후, 상기 다운 스케일링된 이미지를 상기 제1 인공 지능 모델에 입력하여 상기 입력 이미지의 타입을 식별하는, 전자 장치."}
{"patent_id": "10-2019-0150746", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 제2 인공 지능 모델은,복수의 샘플 이미지 및 상기 각 샘플 이미지에 대응되는 타입의 관계를 인공 지능 알고리즘을 통해 학습하여 획득된 인공 지능 모델이고,상기 복수의 제1 인공 지능 모델 각각은,상기 복수의 샘플 이미지 중 상기 복수의 제1 인공 지능 모델 각각에 대응되는 타입의 샘플 이미지 및 상기 샘플 이미지에 대응되는 원본 이미지의 관계를 인공 지능 알고리즘을 통해 학습하여 획득된 인공 지능 모델인, 전자 장치."}
{"patent_id": "10-2019-0150746", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 각 샘플 이미지에 대응되는 타입은,상기 복수의 샘플 이미지 각각을 상기 복수의 제1 인공 지능 모델 중 하나에 입력하여 상기 복수의 샘플 이미지각각을 처리하고, 상기 처리된 복수의 샘플 이미지 각각의 부작용(side effect)의 타입에 기초하여 획득되는,공개특허 10-2021-0062477-3-전자 장치."}
{"patent_id": "10-2019-0150746", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 부작용의 타입은,부작용 없음(none), 재깅(jagging), 블러링(blurring), 에일리어싱(aliasing) 또는 노이즈 부스팅(noiseboosting) 중 적어도 하나를 포함하는, 전자 장치."}
{"patent_id": "10-2019-0150746", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 처리는,업 스케일링 처리, 노이즈 제거 처리 또는 디테일 향상 처리 중 적어도 하나를 포함하는, 전자 장치."}
{"patent_id": "10-2019-0150746", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 프로세서는,상기 입력 이미지를 상기 제2 인공 지능 모델에 입력하여 상기 입력 이미지와 관련된 복수의 타입에 대한 가중치를 획득하고,상기 복수의 타입 중 가중치가 가장 큰 타입을 상기 입력 이미지의 타입으로 식별하는, 전자 장치."}
{"patent_id": "10-2019-0150746", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 프로세서는,상기 복수의 타입에 대한 가중치 중 적어도 하나가 임계 값 이상이면, 상기 입력 이미지 및 상기 적어도 하나의가중치를 상기 메모리에 저장하는, 전자 장치."}
{"patent_id": "10-2019-0150746", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 프로세서는,운영 체제(Operating System)에 기초하여 동작하는 프로세싱 유닛 및 NPU(Neural Processing Unit)를포함하며,상기 프로세싱 유닛은,상기 입력 이미지를 상기 제2 인공 지능 모델에 입력하여 상기 입력 이미지의 타입을 식별하고,상기 NPU는,상기 식별된 타입에 기초하여 상기 입력 이미지를 상기 복수의 제1 인공 지능 모델 중 하나에 입력하여 상기 입력 이미지를 처리하는, 전자 장치."}
{"patent_id": "10-2019-0150746", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "전자 장치의 제어 방법에 있어서,상이한 영상 처리를 수행하도록 학습된 복수의 제1 인공 지능 모델 각각에 의한 이미지의 처리 결과를 예측하여상기 이미지의 타입을 식별하도록 학습된 제2 인공 지능 모델에 입력 이미지를 입력하여 상기 입력 이미지의 타입을 식별하는 단계; 및상기 식별된 타입에 기초하여 상기 입력 이미지를 상기 복수의 제1 인공 지능 모델 중 하나에 입력하여 상기 입공개특허 10-2021-0062477-4-력 이미지를 처리하는 단계;를 포함하는 제어 방법."}
{"patent_id": "10-2019-0150746", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 입력 이미지의 해상도를 다운 스케일링하는 단계;를 더 포함하고,상기 식별하는 단계는,상기 다운 스케일링된 이미지를 상기 제2 인공 지능 모델에 입력하여 상기 입력 이미지의 타입을 식별하는, 제어 방법."}
{"patent_id": "10-2019-0150746", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 다운 스케일링하는 단계는,상기 입력 이미지의 크기가 기설정된 크기 이상이면 상기 입력 이미지를 다운 스케일링하는, 제어 방법."}
{"patent_id": "10-2019-0150746", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서,상기 제2 인공 지능 모델은,복수의 샘플 이미지 및 상기 각 샘플 이미지에 대응되는 타입의 관계를 인공 지능 알고리즘을 통해 학습하여 획득된 인공 지능 모델이고,상기 복수의 제1 인공 지능 모델 각각은,상기 복수의 샘플 이미지 중 상기 복수의 제1 인공 지능 모델 각각에 대응되는 타입의 샘플 이미지 및 상기 샘플 이미지에 대응되는 원본 이미지의 관계를 인공 지능 알고리즘을 통해 학습하여 획득된 인공 지능 모델인, 제어 방법."}
{"patent_id": "10-2019-0150746", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 각 샘플 이미지에 대응되는 타입은,상기 복수의 샘플 이미지 각각을 상기 복수의 제1 인공 지능 모델 중 하나에 입력하여 상기 복수의 샘플 이미지각각을 처리하고, 상기 처리된 복수의 샘플 이미지 각각의 부작용(side effect)의 타입에 기초하여 획득되는,제어 방법."}
{"patent_id": "10-2019-0150746", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 부작용의 타입은,부작용 없음(none), 재깅(jagging), 블러링(blurring), 에일리어싱(aliasing) 또는 노이즈 부스팅(noiseboosting) 중 적어도 하나를 포함하는, 제어 방법."}
{"patent_id": "10-2019-0150746", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제11항에 있어서,상기 처리하는 단계는,상기 입력 이미지의 업 스케일링 처리, 노이즈 제거 처리 또는 디테일 향상 처리 중 적어도 하나를 포함하는,제어 방법."}
{"patent_id": "10-2019-0150746", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "공개특허 10-2021-0062477-5-제11항에 있어서,상기 처리하는 단계는,상기 입력 이미지를 상기 제2 인공 지능 모델에 입력하여 상기 입력 이미지와 관련된 복수의 타입에 대한 가중치를 획득하는 단계; 및상기 복수의 타입 중 가중치가 가장 큰 타입을 상기 입력 이미지의 타입으로 식별하는 단계;를 포함하는, 제어방법."}
{"patent_id": "10-2019-0150746", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에 있어서,상기 복수의 타입에 대한 가중치 중 적어도 하나가 임계 값 이상이면, 상기 입력 이미지 및 상기 적어도 하나의가중치를 저장하는 단계;를 더 포함하는, 제어 방법."}
{"patent_id": "10-2019-0150746", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제11항에 있어서,상기 식별하는 단계는,운영 체제(Operating System)에 기초하여 동작하는 상기 전자 장치의 프로세싱 유닛에 의해, 상기 입력 이미지를 상기 제2 인공 지능 모델에 입력하여 상기 입력 이미지의 타입을 식별하고,상기 처리하는 단계는,상기 전자 장치의 NPU(Neural Processing Unit)에 의해, 상기 식별된 타입에 기초하여 상기 입력 이미지를 상기복수의 제1 인공 지능 모델 중 하나에 입력하여 상기 입력 이미지를 처리하는, 제어 방법."}
{"patent_id": "10-2019-0150746", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "전자 장치가 개시된다. 본 전자 장치는 상이한 영상 처리를 수행하도록 학습된 복수의 제1 인공 지능 모델에 대 한 정보 및 복수의 제1 인공 지능 모델 각각에 의한 이미지의 처리 결과를 예측하여 이미지의 타입을 식별하도록 학습된 제2 인공 지능 모델에 대한 정보가 저장된 메모리 및 메모리와 연결되어 전자 장치를 제어하는 프로세서 를 포함하고, 프로세서는 입력 이미지를 제2 인공 지능 모델에 입력하여 입력 이미지의 타입을 식별하고, 식별된 타입에 기초하여 입력 이미지를 복수의 제1 인공 지능 모델 중 하나에 입력하여 입력 이미지를 처리할 수 있다."}
{"patent_id": "10-2019-0150746", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 전자 장치 및 그 제어 방법에 대한 것으로, 더욱 상세하게는 입력 이미지를 인공 지능 모델을 통해 처리하는 전자 장치 및 그 제어 방법에 대한 것이다."}
{"patent_id": "10-2019-0150746", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 전자 장치는 급격히 발전한 Deep Learning으로 대변되는 Neural Network 기술을 이용하여 영상 처리를 수 행하고 있다. 예를 들어, Segmentation, Super-Resolution, HDR 등에 Neural Network 기술이 적용되고 있다. 이러한 Neural Network 기술은 지연 시간 등을 고려하여 도 1a와 같은 임베디드 시스템의 형태로 구현되고 있 다. 다만, Computing Resource가 제한적이므로, Neural Network 알고리즘의 최적화가 이루어지고 있으나, 입력 의 특징을 모두 반영하지는 못하고 있다. 구체적으로, 단일 Neural Network 모델을 모든 입력에 적용하게 되면, 모든 입력에 대해서 원하는 결과가 나오지 않을 수 있다. 즉, 입력 이미지의 특징에 따라 원하는 화질 향상과 함께 부작용(Side Effect)이 같이 발생할 수 있다. 예를 들어, 도 1a에 도시된 바와 같이, 일반적인 영상으로 트레이닝(Learning)된 Neural Network 기반 Super Resolution 모델인 경우에 일반적인 영상에는 부작용 없는 결과가 도출될 수 있다. 다만, 도 1c에 도시된 바와 같이, 글자(Text)가 있는 영상에서는 재깅(jagging) 또는 블러링(blurring)이 발생 할 수 있다. 이러한 부작용 발생으로 인해서 모든 입력에 대해서 동일한 Neural Network 모델을 적용하는 것은 문제가 된다. 이러한 문제를 해결하기 위해서 Neural Network 처리 이후, 부작용을 감지하고 개선하는 모듈을 뒤에 추가하는 방법이 있을 수 있다. 또는, 다양한 입력 영상에 사용할 Neural Network 모델 정보를 저장하여 임베디드 시스템 에 제공하는 방법이 있을 수 있다. 다만, 전자의 경우, 가령 업 스케일링된 이후의 이미지의 부작용을 감지하고, 부작용을 제거해야 하기 때문에 Computing Resource가 제한적인 환경에서는 부적합하다. 그리고, 후자의 경우, 입력 이미지에 아무런 정보가 없 는 경우에는 처리할 수 있는 방법이 없다는 문제가 있다."}
{"patent_id": "10-2019-0150746", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 상술한 필요성에 따른 것으로, 본 개시의 목적은 입력 이미지의 타입에 따라 처리 방식을 변경하여 입력 이미지의 처리 성능을 향상시키기 위한 전자 장치 및 그 제어 방법을 제공함에 있다."}
{"patent_id": "10-2019-0150746", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이상과 같은 목적을 달성하기 위한 본 개시의 일 실시 예에 따르면, 전자 장치는 상이한 영상 처리를 수행하도 록 학습된 복수의 제1 인공 지능 모델에 대한 정보 및 상기 복수의 제1 인공 지능 모델 각각에 의한 이미지의 처리 결과를 예측하여 상기 이미지의 타입을 식별하도록 학습된 제2 인공 지능 모델에 대한 정보가 저장된 메모 리 및 상기 메모리와 연결되어 상기 전자 장치를 제어하는 프로세서를 포함하고, 상기 프로세서는 입력 이미지 를 상기 제2 인공 지능 모델에 입력하여 상기 입력 이미지의 타입을 식별하고, 상기 식별된 타입에 기초하여 상 기 입력 이미지를 상기 복수의 제1 인공 지능 모델 중 하나에 입력하여 상기 입력 이미지를 처리할 수 있다. 여기서, 상기 프로세서는 상기 입력 이미지의 해상도를 다운 스케일링한 후, 상기 다운 스케일링된 이미지를 상 기 제2 인공 지능 모델에 입력하여 상기 입력 이미지의 타입을 식별할 수 있다. 그리고, 상기 프로세서는 상기 입력 이미지의 크기가 기설정된 크기 이상이면 상기 입력 이미지를 다운 스케일 링한 후, 상기 다운 스케일링된 이미지를 상기 제1 인공 지능 모델에 입력하여 상기 입력 이미지의 타입을 식별 할 수 있다. 한편, 상기 제2 인공 지능 모델은 복수의 샘플 이미지 및 상기 각 샘플 이미지에 대응되는 타입의 관계를 인공 지능 알고리즘을 통해 학습하여 획득된 인공 지능 모델이고, 상기 복수의 제1 인공 지능 모델 각각은 상기 복수 의 샘플 이미지 중 상기 복수의 제1 인공 지능 모델 각각에 대응되는 타입의 샘플 이미지 및 상기 샘플 이미지 에 대응되는 원본 이미지의 관계를 인공 지능 알고리즘을 통해 학습하여 획득된 인공 지능 모델일 수 있다. 여기서, 상기 각 샘플 이미지에 대응되는 타입은 상기 복수의 샘플 이미지 각각을 상기 복수의 제1 인공 지능 모델 중 하나에 입력하여 상기 복수의 샘플 이미지 각각을 처리하고, 상기 처리된 복수의 샘플 이미지 각각의 부작용(side effect)의 타입에 기초하여 획득될 수 있다. 그리고, 상기 부작용의 타입은 부작용 없음(none), 재깅(jagging), 블러링(blurring), 에일리어싱(aliasing) 또는 노이즈 부스팅(noise boosting) 중 적어도 하나를 포함할 수 있다. 다만, 이에 한정되는 것은 아니며, 부 작용의 타입은 다양한 신호 처리 과정에서 발생하는 부작용을 모두 포함할 수도 있다. 한편, 상기 처리는 업 스케일링 처리, 노이즈 제거 처리 또는 디테일 향상 처리 중 적어도 하나를 포함할 수 있 다. 또한, 상기 프로세서는 상기 입력 이미지를 상기 제2 인공 지능 모델에 입력하여 상기 입력 이미지와 관련된 복 수의 타입에 대한 가중치를 획득하고, 상기 복수의 타입 중 가중치가 가장 큰 타입을 상기 입력 이미지의 타입 으로 식별할 수 있다. 여기서, 상기 프로세서는 상기 복수의 타입에 대한 가중치 중 적어도 하나가 임계 값 이상이면, 상기 입력 이미 지 및 상기 적어도 하나의 가중치를 상기 메모리에 저장할 수 있다. 한편, 상기 프로세서는 운영 체제(Operating System)에 기초하여 동작하는 프로세싱 유닛 및 NPU(Neural Processing Unit)를 포함하며, 상기 프로세싱 유닛은 상기 입력 이미지를 상기 제2 인공 지능 모델에 입력하여 상기 입력 이미지의 타입을 식별하고, 상기 NPU는 상기 식별된 타입에 기초하여 상기 입력 이미지를 상기 복수 의 제1 인공 지능 모델 중 하나에 입력하여 상기 입력 이미지를 처리할 수 있다. 한편, 본 개시의 일 실시 예에 따르면, 전자 장치의 제어 방법은 상이한 영상 처리를 수행하도록 학습된 복수의 제1 인공 지능 모델 각각에 의한 이미지의 처리 결과를 예측하여 상기 이미지의 타입을 식별하도록 학습된 제2 인공 지능 모델에 입력 이미지를 입력하여 상기 입력 이미지의 타입을 식별하는 단계 및 상기 식별된 타입에 기 초하여 상기 입력 이미지를 상기 복수의 제1 인공 지능 모델 중 하나에 입력하여 상기 입력 이미지를 처리하는단계를 포함한다. 여기서, 상기 입력 이미지의 해상도를 다운 스케일링하는 단계를 더 포함하고, 상기 식별하는 단계는 상기 다운 스케일링된 이미지를 상기 제2 인공 지능 모델에 입력하여 상기 입력 이미지의 타입을 식별할 수 있다. 그리고, 상기 다운 스케일링하는 단계는 상기 입력 이미지의 크기가 기설정된 크기 이상이면 상기 입력 이미지 를 다운 스케일링할 수 있다. 한편, 상기 제2 인공 지능 모델은 복수의 샘플 이미지 및 상기 각 샘플 이미지에 대응되는 타입의 관계를 인공 지능 알고리즘을 통해 학습하여 획득된 인공 지능 모델이고, 상기 복수의 제1 인공 지능 모델 각각은 상기 복수 의 샘플 이미지 중 상기 복수의 제1 인공 지능 모델 각각에 대응되는 타입의 샘플 이미지 및 상기 샘플 이미지 에 대응되는 원본 이미지의 관계를 인공 지능 알고리즘을 통해 학습하여 획득된 인공 지능 모델일 수 있다. 여기서, 상기 각 샘플 이미지에 대응되는 타입은 상기 복수의 샘플 이미지 각각을 상기 복수의 제1 인공 지능 모델 중 하나에 입력하여 상기 복수의 샘플 이미지 각각을 처리하고, 상기 처리된 복수의 샘플 이미지 각각의 부작용(side effect)의 타입에 기초하여 획득될 수 있다. 그리고, 상기 부작용의 타입은 부작용 없음(none), 재깅(jagging), 블러링(blurring), 에일리어싱(aliasing) 또는 노이즈 부스팅(noise boosting) 중 적어도 하나를 포함할 수 있다. 한편, 상기 처리하는 단계는 상기 입력 이미지의 업 스케일링 처리, 노이즈 제거 처리 또는 디테일 향상 처리 중 적어도 하나를 포함할 수 있다. 또한, 상기 처리하는 단계는 상기 입력 이미지를 상기 제2 인공 지능 모델에 입력하여 상기 입력 이미지와 관련 된 복수의 타입에 대한 가중치를 획득하는 단계 및 상기 복수의 타입 중 가중치가 가장 큰 타입을 상기 입력 이 미지의 타입으로 식별하는 단계를 포함할 수 있다. 여기서, 상기 복수의 타입에 대한 가중치 중 적어도 하나가 임계 값 이상이면, 상기 입력 이미지 및 상기 적어 도 하나의 가중치를 저장하는 단계를 더 포함할 수 있다. 한편, 상기 식별하는 단계는 운영 체제(Operating System)에 기초하여 동작하는 상기 전자 장치의 프로세싱 유 닛에 의해, 상기 입력 이미지를 상기 제2 인공 지능 모델에 입력하여 상기 입력 이미지의 타입을 식별하고, 상 기 처리하는 단계는 상기 전자 장치의 NPU(Neural Processing Unit)에 의해, 상기 식별된 타입에 기초하여 상기 입력 이미지를 상기 복수의 제1 인공 지능 모델 중 하나에 입력하여 상기 입력 이미지를 처리할 수 있다."}
{"patent_id": "10-2019-0150746", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상과 같은 본 개시의 다양한 실시 예에 따르면, 전자 장치는 인공 지능 모델을 이용하여 입력 이미지의 타입 을 식별하고, 식별된 타입에 대응되는 타 인공 지능 모델을 이용하여 입력 이미지를 처리하여 입력 이미지의 처 리 성능을 향상시킬 수 있다."}
{"patent_id": "10-2019-0150746", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 첨부 도면을 참조하여 본 개시를 상세히 설명한다. 본 개시의 실시 예에서 사용되는 용어는 본 개시에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달 라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 개시의 설명 부 분에서 상세히 그 의미를 기재할 것이다. 따라서 본 개시에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가지는 의미와 본 개시의 전반에 걸친 내용을 토대로 정의되어야 한다. 본 명세서에서, \"가진다,\" \"가질 수 있다,\" \"포함한다,\" 또는 \"포함할 수 있다\" 등의 표현은 해당 특징(예: 수 치, 기능, 동작, 또는 부품 등의 구성요소)의 존재를 가리키며, 추가적인 특징의 존재를 배제하지 않는다. A 또는/및 B 중 적어도 하나라는 표현은 \"A\" 또는 \"B\" 또는 \"A 및 B\" 중 어느 하나를 나타내는 것으로 이해되어 야 한다. 본 명세서에서 사용된 \"제1,\" \"제2,\" \"첫째,\" 또는 \"둘째,\"등의 표현들은 다양한 구성요소들을, 순서 및/또는 중요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구성요소들 을 한정하지 않는다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함하다\" 또 는 \"구성되다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것 이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 명세서에서, 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공 지능 전자 장치)를 지칭할 수 있다. 이하 첨부된 도면들을 참조하여 본 개시의 일 실시 예를 보다 상세하게 설명한다. 도 2는 본 개시의 일 실시 예에 따른 전자 장치의 구성을 나타내는 블럭도이다. 전자 장치는 입력 이미지를 처리하는 장치로서, TV, 데스크탑 PC, 노트북, DVD(digital video disk) 플레 이어, 스마트폰, 태블릿 PC, 모니터, 스마트 안경, 스마트 워치 등과 같이 디스플레이를 구비하고, 처리된 이미 지를 직접 디스플레이하는 장치일 수 있다. 또는, 전자 장치는 셋탑박스(STB), 스피커, 컴퓨터 본체 등과 같이 디스플레이가 구비되지 않은 장치로서, 처리된 이미지를 디스플레이 장치로 제공하는 장치일 수도 있다. 다만, 이에 한정되는 것은 아니며, 전자 장치는 입력 이미지를 처리할 수 있는 장치라면 어떠한 장치라도 무방하다. 도 2에 따르면, 전자 장치는 메모리 및 프로세서를 포함한다. 다만, 이에 한정되는 것은 아니며, 전자 장치는 일부 구성이 제외된 형태로 구현될 수도 있다. 메모리는 다양한 인공 지능 모델(Artificial Intelligence Model)을 저장할 수 있다. 예를 들어, 메모리 는 상이한 영상 처리를 수행하도록 학습된 복수의 제1 인공 지능 모델에 대한 정보 및 복수의 제1 인공 지 능 모델 각각에 의한 이미지의 처리 결과를 예측하여 이미지의 타입을 식별하도록 학습된 제2 인공 지능 모델에 대한 정보를 저장할 수 있다. 여기서, 복수의 제1 인공 지능 모델은 동일한 타입의 영상 처리를 수행하기 위한 인공 지능 모델들로서, 가령 이미지의 업 스케일링을 수행하기 위한 인공 지능 모델들일 수 있다. 다만, 복수의 제1 인공 지능 모델은 상이 한 영상 처리를 수행하는 인공 지능 모델들로서, 가령 복수의 제1 인공 지능 모델은 이미지의 업 스케일링을 수 행하는 방식이 서로 상이할 수 있다. 또한, 복수의 제1 인공 지능 모델의 영상 처리 방식은 이미지의 타입에 따 라 다를 수 있다. 가령, 제1 타입의 이미지는 제1 인공 지능 모델 1로 영상 처리할 때 최적의 영상 처리가 수행 되고, 제2 타입의 이미지는 제1 인공 지능 모델 2로 영상 처리할 때 최적의 영상 처리가 수행될 수 있다. 제2 인공 지능 모델은 이미지의 타입을 식별하기 위한 인공 지능 모델일 수 있다. 이미지의 타입의 개수는 기설 정된 상태일 수 있고, 제2 인공 지능 모델은 입력 이미지를 기설정된 개수의 이미지의 타입 중 하나로 결정하도 록 학습될 수 있다. 예를 들어, 제2 인공 지능 모델은 Fast classification을 하는 Mobilenet 모델이나 Inception 모델로 구현될 수 있다. 또한, 제2 인공 지능 모델은 복수의 제1 인공 지능 모델과 비교하여 간단한구조로 구현되어 연산 수행 속도를 향상시킬 수 있다. 한편, 메모리는 복수의 입력 이미지 및 복수의 제1 인공 지능 모델 중 하나에 의해 처리된 입력 이미지를 저장할 수 있다. 또한, 메모리는 복수의 제1 인공 지능 모델 또는 제2 인공 지능 모델 중 적어도 하나의 학습에 이용될 입력 이미지를 저장할 수 있다. 메모리는 비휘발성 메모리 및 휘발성 메모리 등으로 구현될 수 있으나, 이에 한정되는 것은 아니다. 예를 들어, 메모리 대신 하드디스크가 이용될 수도 있으며, 데이터를 저장할 수 있는 구성이라면 어떠한 구성이 라도 가능하다. 프로세서는 전자 장치의 동작을 전반적으로 제어한다. 구체적으로, 프로세서는 전자 장치 의 각 구성과 연결되어 전자 장치의 동작을 전반적으로 제어할 수 있다. 예를 들어, 프로세서는 메모 리, 디스플레이(미도시), 통신 인터페이스(미도시) 등과 같은 구성과 연결되어 전자 장치의 동작을 제어할 수 있다. 일 실시 예에 따라 프로세서는 디지털 시그널 프로세서(digital signal processor(DSP), 마이크로 프로세 서(microprocessor), TCON(Time controller)으로 구현될 수 있다. 다만, 이에 한정되는 것은 아니며, 중앙처리 장치(central processing unit(CPU)), MCU(Micro Controller Unit), MPU(micro processing unit), 컨트롤러 (controller), 어플리케이션 프로세서(application processor(AP)), 또는 커뮤니케이션 프로세서 (communication processor(CP)), ARM 프로세서 중 하나 또는 그 이상을 포함하거나, 해당 용어로 정의될 수 있 다. 또한, 프로세서는 프로세싱 알고리즘이 내장된 SoC(System on Chip), LSI(large scale integration) 로 구현될 수도 있고, FPGA(Field Programmable gate array) 형태로 구현될 수도 있다. 프로세서는 입력 이미지를 제2 인공 지능 모델에 입력하여 입력 이미지의 타입을 식별할 수 있다. 입력 이 미지의 타입은 기설정된 상태일 수 있다. 예를 들어, 입력 이미지의 타입은 제1 타입 내지 제5 타입까지 다섯 타입으로 구분된 상태이고, 프로세서는 입력 이미지를 제2 인공 지능 모델에 입력하여 입력 이미지를 제1 타입 내지 제5 타입 중 하나로 분류할 수 있다. 여기서, 입력 이미지의 타입의 개수는 복수의 제1 인공 지능 모 델의 개수와 동일할 수 있다. 프로세서는 식별된 타입에 기초하여 입력 이미지를 복수의 제1 인공 지능 모델 중 하나에 입력하여 입력 이미지를 처리할 수 있다. 예를 들어, 프로세서는 입력 이미지의 타입이 제3 타입이면, 입력 이미지를 복 수의 제1 인공 지능 모델 중 제3 타입에 대응되는 제1 인공 지능 모델 3에 입력하여 입력 이미지를 처리할 수 있다. 프로세서는 입력 이미지의 해상도를 다운 스케일링한 후, 다운 스케일링된 이미지를 제2 인공 지능 모델에 입력하여 입력 이미지의 타입을 식별할 수 있다. 예를 들어, 프로세서는 UHD 해상도의 입력 이미지를 SD 해상도의 이미지로 변환하고, 변환된 이미지를 제2 인공 지능 모델에 입력하여 입력 이미지의 타입을 식별할 수 있다. 이러한 동작을 통해, 제2 인공 지능 모델의 용량 및 입력 이미지의 타입을 식별하기 위한 연산 시간을 줄 일 수 있다. 여기서, 프로세서는 입력 이미지의 크기가 기설정된 크기 이상이면 입력 이미지를 다운 스케일링한 후, 다 운 스케일링된 이미지를 제1 인공 지능 모델에 입력하여 입력 이미지의 타입을 식별할 수도 있다. 예를 들어, 프로세서는 입력 이미지가 UHD 해상도인 경우 입력 이미지를 SD 해상도의 이미지로 변환하고, 변환된 이미 지를 제2 인공 지능 모델에 입력하여 입력 이미지의 타입을 식별하나, 입력 이미지가 HD 해상도인 경우 입력 이 미지의 해상도를 변환하지 않고, 입력 이미지를 제2 인공 지능 모델에 입력하여 입력 이미지의 타입을 식별할 수도 있다. 한편, 제2 인공 지능 모델은 복수의 샘플 이미지 및 각 샘플 이미지에 대응되는 타입의 관계를 인공 지능 알고 리즘을 통해 학습하여 획득된 인공 지능 모델일 수 있다. 여기서, 복수의 샘플 이미지는 각각 복수의 원본 이미 지로부터 획득될 수 있다. 예를 들어, 복수의 샘플 이미지는 각각 복수의 원본 이미지를 다운 스케일링하여 획 득될 수 있다. 그리고, 각 샘플 이미지에 대응되는 타입은 복수의 샘플 이미지 각각을 복수의 제1 인공 지능 모 델 중 하나에 입력하여 획득될 수 있다. 예를 들어, 각 샘플 이미지에 대응되는 타입은 복수의 샘플 이미지 각 각을 복수의 제1 인공 지능 모델 중 하나에 입력하여 복수의 샘플 이미지 각각을 처리하고, 처리된 복수의 샘플 이미지 각각의 부작용(side effect)의 타입에 기초하여 획득될 수 있다. 여기서, 부작용의 타입은 부작용 없음 (none), 재깅(jagging), 블러링(blurring), 에일리어싱(aliasing) 또는 노이즈 부스팅(noise boosting) 중 적 어도 하나를 포함할 수 있다.한편, 복수의 제1 인공 지능 모델 각각은 복수의 샘플 이미지 중 복수의 제1 인공 지능 모델 각각에 대응되는 타입의 샘플 이미지 및 샘플 이미지에 대응되는 원본 이미지의 관계를 인공 지능 알고리즘을 통해 학습하여 획 득된 인공 지능 모델일 수 있다. 예를 들어, 제1 인공 지능 모델 1은 제1 타입의 샘플 이미지 및 대응되는 원본 이미지의 관계를 인공 지능 알고리즘을 통해 학습하여 획득된 인공 지능 모델이고, 제1 인공 지능 모델 2는 제2 타입의 샘플 이미지 및 대응되는 원본 이미지의 관계를 인공 지능 알고리즘을 통해 학습하여 획득된 인공 지능 모델일 수 있다. 한편, 동일한 타입의 영상 처리는 업 스케일링 처리, 노이즈 제거 처리 또는 디테일 향상 처리 중 적어도 하나 를 포함할 수 있다. 예를 들어, 프로세서는 입력 이미지에 대한 업 스케일링 처리를 수행하기 위해 복수의 제1 인공 지능 모델 중 하나를 이용할 수 있다. 여기서, 복수의 제1 인공 지능 모델은 업 스케일링을 수행하기 위한 인공 지능 모델이나, 이미지의 타입에 따라 영상 처리 방식이 상이할 수 있다. 다만, 이에 한정되는 것은 아니며, 동일한 타입의 영상 처리는 얼마든지 다른 영상 처리를 포함할 수 있다. 한편, 프로세서는 입력 이미지를 제2 인공 지능 모델에 입력하여 입력 이미지와 관련된 복수의 타입에 대 한 가중치를 획득하고, 복수의 타입 중 가중치가 가장 큰 타입을 입력 이미지의 타입으로 식별할 수 있다. 예를 들어, 프로세서는 입력 이미지를 제2 인공 지능 모델에 입력하여 제1 타입이 가중치 80, 제2 타입이 가중 치 20, 제3 타입이 가중치 40의 결과를 획득하고, 가중치가 80으로 가장 높은 제1 타입을 입력 이미지의 타입으 로 식별할 수 있다. 이상에서는 가중치의 값이 스코어로서 표현되었으나, 이는 일 실시 예에 불과하다. 가령, 가중치의 값은 확률 값으로 표현될 수도 있다. 프로세서는 복수의 타입에 대한 가중치 중 적어도 하나가 임계 값 이상이면, 입력 이미지 및 적어도 하나 의 가중치를 메모리에 저장할 수 있다. 상술한 예에서 임계 값이 70이라고 가정하면, 프로세서는 입 력 이미지와 입력 이미지가 제1 타입이라는 정보를 메모리에 저장할 수 있다. 이후, 프로세서는 입력 이미지와 입력 이미지가 제1 타입이라는 정보를 서버에 전송할 수 있다. 서버는 수신된 정보에 기초하여 복수의 제1 인공 지능 모델 및 제2 인공 지능 모델을 업데이트할 수 있으며, 이에 대한 구체적인 설명은 후술한다. 한편, 프로세서는 이종의 프로세싱 유닛을 포함할 수 있다. 예를 들어, 프로세서는 CPU(Central Processing Unit) 등과 같이 운영 체제(Operating System)에 기초하여 동작하는 프로세싱 유닛 및 NPU(Neural Processing Unit)를 포함할 수 있다. NPU(Neural Processing Unit)는 신경망 연산 전용 프로세서로서, 복수의 연산 소자(Processing Element)를 포 함할 수 있다. 인접한 연산 소자 간에는 데이터의 일방향 시프트 또는 양방향 시프트가 가능하다. 연산 소자 각각은 기본적으로 곱셈기(multiplier) 및 산술 논리 연산 장치(Arithmetic Logic Unit, ALU)를 포 함하며, ALU는 적어도 하나 이상의 가산기(adder)를 포함할 수 있다. 연산 소자는 곱셈기 및 ALU를 이용하여 사 칙 연산을 수행할 수 있다. 다만, 이에 한정되는 것은 아니며, 사칙 연산 및 시프트 등과 같은 기능을 수행할 수 있다면 얼마든지 다른 구조로 형성될 수도 있다. 또한, 연산 소자 각각은 데이터를 저장하기 위한 레지스터 를 포함할 수 있다. 프로세서는 운영 체제에 기초하여 동작하는 프로세싱 유닛 및 NPU를 포함하는 경우, 프로세싱 유닛은 입력 이미지를 제2 인공 지능 모델에 입력하여 입력 이미지의 타입을 식별하고, NPU는 식별된 타입에 기초하여 입력 이미지를 복수의 제1 인공 지능 모델 중 하나에 입력하여 입력 이미지를 처리할 수 있다. 다만, 이에 한정되는 것은 아니며, 프로세서는 DSP(Digital Signal Processor), GPU(Graphics Processing Unit) 등과 같은 신호 처리 전용 프로세싱 유닛을 더 포함할 수도 있다. 이 경우, DSP 등과 같은 신호 처리 전 용 프로세싱 유닛이 입력 이미지를 제2 인공 지능 모델에 입력하여 입력 이미지의 타입을 식별하고, NPU가 식별 된 타입에 기초하여 입력 이미지를 복수의 제1 인공 지능 모델 중 하나에 입력하여 입력 이미지를 처리할 수도 있다. 한편, 본 개시에 따른 인공 지능과 관련된 기능은 프로세서와 메모리를 통해 동작된다. 프로세서는 하나 또는 복수의 프로세서로 구성될 수 있다. 이때, 하나 또는 복수의 프로세서는 CPU, AP, DSP 등과 같은 범용 프로세서, GPU, VPU(Vision Processing Unit)와 같은 그래픽 전용 프로세서 또는 NPU와 같 은 인공 지능 전용 프로세서일 수 있다. 하나 또는 복수의 프로세서는, 메모리에 저장된 기 정의된 동작 규칙 또는 인공 지능 모델에 따라, 입력 데이터를 처리하도록 제어한다. 또는, 하나 또는 복수의 프로세서가 인공 지능 전용 프로세서인 경우, 인공 지능 전용 프로세서는 특정 인공 지능 모델의 처리에 특화된 하드웨어 구조로 설계될 수 있다. 기 정의된 동작 규 칙 또는 인공 지능 모델은 학습을 통해 만들어진 것을 특징으로 한다. 여기서, 학습을 통해 만들어진다는 것은, 기본 인공 지능 모델이 학습 알고리즘에 의하여 다수의 학습 데이터들 을 이용하여 학습됨으로써, 원하는 특성(또는, 목적)을 수행하도록 설정된 기 정의된 동작 규칙 또는 인공 지능 모델이 만들어짐을 의미한다. 이러한 학습은 본 개시에 따른 인공 지능이 수행되는 기기 자체에서 이루어질 수 도 있고, 별도의 서버 및/또는 시스템을 통해 이루어 질 수도 있다. 학습 알고리즘의 예로는, 지도형 학습 (supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi-supervised learning) 또 는 강화 학습(reinforcement learning)이 있으나, 전술한 예에 한정되지 않는다. 인공 지능 모델은 복수의 신경망 레이어들로 구성될 수 있다. 복수의 신경망 레이어들 각각은 복수의 가중치들 (weight values)을 갖고 있으며, 이전(previous) 레이어의 연산 결과와 복수의 가중치들 간의 연산을 통해 신경 망 연산을 수행한다. 복수의 신경망 레이어들이 갖고 있는 복수의 가중치들은 인공 지능 모델의 학습 결과에 의 해 최적화될 수 있다. 예를 들어, 학습 과정 동안 인공 지능 모델에서 획득한 로스(loss) 값 또는 코스트(cost) 값이 감소 또는 최소화되도록 복수의 가중치들이 갱신될 수 있다. 인공 신경망은 심층 신경망(DNN:Deep Neural Network)를 포함할 수 있으며, 예를 들어, CNN(Convolutional Neural Network), DNN (Deep Neural Network), RNN(Recurrent Neural Network), RBM(Restricted Boltzmann Machine), DBN(Deep Belief Network), BRDNN(Bidirectional Recurrent Deep Neural Network), GAN(Generative Adversarial Network) 또는 심층 Q-네트워크(Deep Q-Networks) 등이 있으나, 이에 한정되는 것은 아니다. 한편, 전자 장치는 디스플레이, 통신 인터페이스를 더 포함할 수도 있다. 디스플레이는 LCD(Liquid Crystal Display), OLED(Organic Light Emitting Diodes) 디스플레이, PDP(Plasma Display Panel), micro LED, Laser Display, VR, Glass 등과 같은 다양한 형태의 디스플레이로 구현될 수 있다. 디스플레이 내에는 a-si TFT, LTPS(low temperature poly silicon) TFT, OTFT(organic TFT) 등과 같은 형태로 구현될 수 있는 구동 회로, 백라이트 유닛 등도 함께 포함될 수 있다. 한편, 디스플레이는 터치 센서와 결합된 터치 스크린, 플렉시블 디스플레이(flexible display), 3차원 디스플레이(3D display) 등으로 구현될 수 있다. 통신 인터페이스는 다양한 유형의 통신방식에 따라 다양한 유형의 외부 장치와 통신을 수행하는 구성이다. 통신 인터페이스는 와이파이 모듈, 블루투스 모듈, 적외선 통신 모듈 및 무선 통신 모듈 등을 포함한다. 여기서, 각 통신 모듈은 적어도 하나의 하드웨어 칩 형태로 구현될 수 있다. 프로세서는 통신 인터페이스를 이용하여 각종 외부 장치와 통신을 수행할 수 있다. 여기서, 외부 장치는 서버, 블루투스 이어폰, 디스플레이 장치 등을 포함할 수 있다. 와이파이 모듈, 블루투스 모듈은 각각 WiFi 방식, 블루투스 방식으로 통신을 수행한다. 와이파이 모듈이나 블루 투스 모듈을 이용하는 경우에는 SSID 및 세션 키 등과 같은 각종 연결 정보를 먼저 송수신하여, 이를 이용하여 통신 연결한 후 각종 정보들을 송수신할 수 있다. 적외선 통신 모듈은 시 광선과 밀리미터파 사이에 있는 적외선을 이용하여 근거리에 무선으로 데이터를 전송하 는 적외선 통신(IrDA, infrared Data Association)기술에 따라 통신을 수행한다. 무선 통신 모듈은 상술한 통신 방식 이외에 지그비(zigbee), 3G(3rd Generation), 3GPP(3rd Generation Partnership Project), LTE(Long Term Evolution), LTE-A(LTE Advanced), 4G(4th Generation), 5G(5th Generation)등과 같은 다양한 무선 통신 규격에 따라 통신을 수행하는 적어도 하나의 통신 칩을 포함할 수 있다. 그 밖에 통신 인터페이스는 LAN(Local Area Network) 모듈, 이더넷 모듈, 또는 페어 케이블, 동축 케이블 또는 광섬유 케이블 등을 이용하여 통신을 수행하는 유선 통신 모듈 중 적어도 하나를 포함할 수 있다. 통신 인터페이스는 입출력 인터페이스를 더 포함할 수 있다. 입출력 인터페이스는 HDMI(High Definition Multimedia Interface), MHL (Mobile High-Definition Link), USB (Universal Serial Bus), DP(Display Port), 썬더볼트(Thunderbolt), VGA(Video Graphics Array)포트, RGB 포트, D-SUB(D-subminiature), DVI(Digital Visual Interface) 중 어느 하나의 인터페이스일 수 있다. 입출력 인터페이스는 오디오 및 비디오 신호 중 적어도 하나를 입출력 할 수 있다. 구현 예에 따라, 입출력 인터페이스는 오디오 신호만을 입출력하는 포트와 비디오 신호만을 입출력하는 포트를 별개의 포트로 포함하거나, 오디오 신호 및 비디오 신호를 모두 입출력하는 하나의 포트로 구현될 수 있다. 이상과 같이 전자 장치는 인공 지능 모델을 이용하여 입력 이미지의 타입을 식별하고, 식별된 타입에 대응되는 타 인공 지능 모델을 이용하여 입력 이미지를 적응적으로 처리하여 입력 이미지의 처리 성능을 향상시킬 수 있 다. 이하에서는 다양한 도면을 통해 프로세서의 동작을 좀더 구체적으로 설명한다. 도 3은 본 개시의 일 실시 예에 따른 프로세서의 동작을 설명하기 위한 도면이다. 영상 처리 모듈(Image Enhance(Processing) Module, 310)은 CPU 또는 DSP에 의해 수행될 수 있다. 예측 모듈 (Prediction Module, 320)은 CPU, DSP 및 NPU 중 하나에 의해 수행될 수 있다. 먼저, 예측 모듈은 입력 이미지를 제2 인공 지능 모델에 입력하여 입력 이미지의 타입을 식별할 수 있다. 이때, 예측 모듈은 입력 이미지를 다운 스케일링하고, 다운 스케일링된 이미지를 제2 인공 지능 모델에 입 력하여 타입을 식별할 수 있다. 예측 모듈은 입력 이미지의 해상도, 용량, 확장자 중 적어도 하나에 기초 하여 다운 스케일링 여부를 결정할 수도 있다. 여기서, 입력 이미지 및 제2 인공 지능 모델은 메모리로부 터 제공될 수 있다. NPU는 입력 이미지를 제2 인공 지능 모델에 입력하여 신경망 연산을 수행하고, 이미지 타입을 결과로서 출 력할 수 있다. 영상 처리 모듈은 입력 이미지를 전처리(Pre-processing)할 수 있다. 예를 들어, 영상 처리 모듈은 입력 이미지의 해상도를 복수의 제1 인공 지능 모델에 대응되도록 스케일링할 수 있다. 또는, 영상 처리 모듈 은 NPU의 입력 포맷에 대응되도록 입력 이미지의 데이터 타입을 변경할 수도 있다. 영상 처리 모듈은 식별된 타입에 기초하여 입력 이미지를 복수의 제1 인공 지능 모델 중 하나에 입력하여 입력 이미지를 처리할 수 있다. 여기서, 입력 이미지 및 복수의 제1 인공 지능 모델 중 하나는 메모리로부 터 제공될 수 있다. NPU는 입력 이미지를 복수의 제1 인공 지능 모델 중 하나에 입력하여 신경망 연산(NN-Processing)을 수행 하고, 이미지 처리된 입력 이미지를 결과로서 출력할 수 있다. 영상 처리 모듈은 이미지 처리된 입력 이미지를 후처리(Post-processing)할 수 있다. 예를 들어, 영상 처 리 모듈은 이미지 처리된 입력 이미지를 필터 처리하여 출력할 수 있다. 또는, 영상 처리 모듈은 이 미지 처리된 입력 이미지를 영상 처리 모듈 이후의 모듈의 입력 포맷에 대응되도록 데이터 타입을 변경할 수도 있다. 메모리는 입력 이미지의 타입에 대한 정보가 수신되면, 복수의 제1 인공 지능 모델 중 입력 이미지의 타입 에 대응되는 제1 인공 지능 모델을 NPU로 제공할 수 있다. 한편, 도 3에서는 NPU를 이용하여 소프트웨어적으로 신경망 연산을 수행하는 임베디드 시스템을 도시하였 으나, 이에 한정되는 것은 아니다. 예를 들어, 임베디드 시스템은 RTL(Register-Transfer Level)과 같이 디지털 회로 설계를 통해 하드웨어적으로 구현될 수도 있다. 단일 인공 지능 모델을 사용할 경우, RTL로 구현하는 것이 전력이나 속도 측면에서 유리하다. 다만, 본 개시에 따르면 복수의 제1 인공 지능 모델 및 제2 인공 지능 모델이 필요하며, 복수의 제1 인공 지능 모델 및 제2 인공 지능 모델은 서로 구조가 다르거나 구조가 동일하더라도 웨이트(weight)가 다를 수 있다. 즉, 다양한 인공 지능 모델을 교체 사용하는 경우에는 NPU를 이용하여 소프트웨어적으로 연산을 수행하는 것이 RTL을 이용하는 것보다 유리할 수 있다. 특히, NPU는 신경망 연산에 특화된 가속기로 인해 다른 프로세싱 유닛보다 performance와 efficiency가 뛰어날 수 있다. 도 4a 및 도 4b는 본 개시의 일 실시 예에 따른 이미지 타입에 따른 프로세서의 동작을 설명하기 위한 도 면들이다. 도 4a 및 도 4b에서는 설명의 편의를 위하여, 입력 이미지의 업 스케일링을 수행하며, 이미지의 타입 이 부작용 없음(none) 및 블러링(blurring) 중 하나로 구분되는 것으로 설명한다. 프로세서는 도 4a에 도시된 바와 같이, 입력 이미지의 타입이 부작용 없음(none)으로 식별되면, 입력 이미 지를 제1 인공 지능 모델 A(NN A)에 입력하여 입력 이미지를 처리할 수 있다.또는, 프로세서는 도 4b에 도시된 바와 같이, 입력 이미지의 타입이 블러링(blurring)으로 식별되면, 입력 이미지를 제1 인공 지능 모델 B(NN B)에 입력하여 입력 이미지를 처리할 수 있다. 이 경우, 제1 인공 지능 모델 B(NN B)에 의해 출력되는 결과물은 블러링이 최소화된 상태일 수 있다. 예를 들어, 입력 이미지를 제1 인공 지 능 모델 A(NN A)에 입력하는 경우보다 제1 인공 지능 모델 B(NN B)에 입력하는 경우가 블러링이 더 적을 수 있 다. 도 5a 내지 도 5c는 본 개시의 일 실시 예에 따른 복수의 제1 인공 지능 모델 및 제2 인공 지능 모델의 학습 방 법을 설명하기 위한 도면들이다. 도 5a 내지 도 5c에서는 설명의 편의를 위하여 입력 이미지에 대한 업 스케일 링을 수행하고, 서버가 복수의 제1 인공 지능 모델 및 제2 인공 지능 모델을 학습하며, 입력 이미지가 두 종류 의 타입 중 하나로 구분되는 것으로 설명한다. 먼저, 도 5a는 복수의 샘플 이미지를 복수의 제1 인공 지능 모델 중 하나에 입력하여 복수의 업 스케일링 된 샘플 이미지를 획득하고, 복수의 업 스케일링된 샘플 이미지 각각의 타입을 식별하는 도면이다. 여기서, 복 수의 제1 인공 지능 모델 중 하나는 타입과는 무관하게 업 스케일링을 수행하기 위해 인공 지능 알고리즘 을 통해 학습하여 획득된 인공 지능 모델일 수 있으며, 이하에서는 설명의 편의를 위해 복수의 제1 인공 지능 모델 중 하나를 기본 인공 지능 모델이라고 설명한다. 예를 들어, 기본 인공 지능 모델은 복수의 샘플 이미지 및 각 샘플 이미지에 대응되는 원본 이미지의 관계 를 인공 지능 알고리즘을 통해 학습하여 획득될 수 있다. 여기서, 복수의 샘플 이미지는 타입의 구분이 없는 상 태일 수 있다. 서버는 복수의 샘플 이미지에 대한 기본 인공 지능 모델의 출력과 대응되는 원본 이미지를 비교하여 입력 이미지의 타입을 식별할 수 있다. 예를 들어, 서버는 제1 샘플 이미지와 대응되는 원본 이미지를 비교하여 블러 링이 발생했음을 식별할 수 있다. 서버는 복수의 샘플 이미지 및 각 샘플 이미지에 대응되는 이미지 타입을 저장할 수 있다. 서버는 도 5b에 도시된 바와 같이, 타입 별로 구분된 샘플 이미지들을 이용하여 제2 인공 지능 모델을 학 습할 수 있다. 예를 들어, 서버는 제1 타입(type 1)과 제2 타입(type 2)에 속하는 샘플 이미지들을 제2 인공 지 능 모델에 입력하고, 각각의 타입에 대응되는 식별자가 출력되도록 제2 인공 지능 모델을 학습할 수 있다. 다만, 이에 한정되는 것은 아니며, 서버는 제1 타입(type 1)에 속하는 샘플 이미지들을 제2 인공 지능 모 델에 입력하고, 제1 타입에 대응되는 식별자가 출력되도록 제2 인공 지능 모델을 학습하고, 제2 타입 (type 2)에 속하는 샘플 이미지들을 제2 인공 지능 모델에 입력하고, 제2 타입에 대응되는 식별자가 출력 되도록 제2 인공 지능 모델을 학습할 수도 있다. 제2 인공 지능 모델의 학습이 완료된 후, 입력 이미지를 제2 인공 지능 모델에 입력하면, 제2 인공 지능 모델은 입력 이미지의 타입에 대응되는 식별자를 출력할 수 있다. 서버는 도 5c에 도시된 바와 같이, 타입별로 제1 인공 지능 모델을 학습할 수 있다. 예를 들어, 제1 타입에 대 응되는 제1 인공 지능 모델 A(NN A)는 제1 타입에 속하는 샘플 이미지들 및 각 샘플 이미지에 대응되는 원본 이 미지의 관계를 인공 지능 알고리즘을 통해 학습하여 획득되고, 제2 타입에 대응되는 제1 인공 지능 모델 B(NN B)는 제2 타입에 속하는 샘플 이미지들 및 각 샘플 이미지에 대응되는 원본 이미지의 관계를 인공 지능 알고리 즘을 통해 학습하여 획득될 수 있다. 도 5c에서는 제1 인공 지능 모델 A(NN A) 및 제1 인공 지능 모델 B(NN B)를 모두 학습하는 것으로 설명하였으나, 이에 한정되는 것은 아니다. 예를 들어, 제1 타입이 부작용 없음(none)인 경우, 제1 인공 지능 모델 A(NN A)의 학습을 생략하고, 기본 인공 지능 모델을 이용할 수도 있다. 이 경우, 제2 타입에 대한 제 1 인공 지능 모델 B(NN B)만이 학습될 수 있다. 또는, 제1 타입이 부작용 없음(none)인 경우, 기본 인공 지능 모델을 제1 타입에 속하는 샘플 이미지들 및 각 샘플 이미지에 대응되는 원본 이미지의 관계를 인공 지능 알고리즘을 통해 학습하여 업데이트할 수도 있다. 제1 인공 지능 모델 B(NN B)의 학습은 동일하게 수행될 수 있 다. 이상과 같은 방법을 통해 복수의 제1 인공 지능 모델 및 제2 인공 지능 모델이 획득될 수 있다. 도 6은 본 개시의 일 실시 예에 따른 실시간 연산을 설명하기 위한 도면이다. 상술한 바와 같이, 제2 인공 지능 모델은 복수의 제1 인공 지능 모델보다 간단한 구조로 구현될 수 있고, 입력 이미지 역시 다운 스케일링되어 제2 인공 지능 모델에 입력될 수 있다. 특히, 도 6에는 제2 인공 지능 모델이 Inception 모델 또는 Mobilenet 모델인 경우의 처리 속도가 도시되었다. 예를 들어, 제2 인공 지능 모델이 Inception 모델로 구현되고, 840MHz로 동작하는 특정 구조의 NPU가 이용된 경 우, 154fps 이상의 속도로 입력 이미지에 대한 타입의 식별이 가능하다. 일반적으로 전자 장치, 특히 디스플레이가 구비된 전자 장치의 경우, 영상이 최종 디스플레이 모듈의 메모 리에 여러 프레임이 저장될 수 있다. 이는, 디코더 또는 내부 화질 처리 모듈들이 특정 주기(30Hz, 60Hz, 120Hz) 내에 한 프레임을 처리하지 못하는 상황이 발생할 수도 있기 때문이다. 즉, 화면의 연속성을 보장하기 위해 미리 영상 처리된 수 프레임 정도가 버퍼에 저장된 상태이고, 전자 장치는 이를 특정 주기에 맞춰서 디스 플레이하게 된다. 따라서, 도 6과 같은 속도로 입력 이미지에 대한 타입의 식별이 이루어지는 경우, 실시간성의 확보가 가능할 수 있다. 도 7은 본 개시의 일 실시 예에 따른 복수의 제1 인공 지능 모델 및 제2 인공 지능 모델의 업데이트를 설명하기 위한 도면이다. 먼저, 서버는 복수의 제1 인공 지능 모델 및 제2 인공 지능 모델을 학습하는 장치일 수 있다. 서버는 도 5a 내지 도 5c와 같은 방법으로 복수의 제1 인공 지능 모델 및 제2 인공 지능 모델을 학습할 수 있다. 서버는 학습이 완료된 복수의 제1 인공 지능 모델 및 제2 인공 지능 모델을 전자 장치로 제공할 수 있다. 전자 장치는 도 2에서 설명한 바와 같이, 입력 이미지에 대한 영상 처리를 수행할 수 있다. 전자 장치 는 입력 이미지에 타입을 식별하는 과정에서 입력 이미지에 관련된 복수의 타입에 대한 가중치를 획득할 수 있다. 그리고, 전자 장치는 복수의 타입에 대한 가중치 중 적어도 하나가 임계 값 이상이면, 입력 이미 지 및 적어도 하나의 가중치를 저장할 수 있다. 전자 장치는 이상과 같이 순차적으로 입력되는 입력 이미지 중 가중치 값이 임계 값 이상인 입력 이미지 및 가중치에 대한 정보를 누적하여 저장할 수 있다. 전자 장치는 기설정된 시간 간격 또는 전자 장치가 턴 온되는 경우에 누적하여 저장한 입력 이미지들 및 각각에 대응되는 가중치에 대한 정보를 서버로 제공할 수 있다. 서버는 전자 장치로부터 수신된 정보에 기초하여 복수의 제1 인공 지능 모델 및 제2 인공 지능 모델 을 업데이트하고, 업데이트된 복수의 제1 인공 지능 모델 및 제2 인공 지능 모델을 전자 장치로 제공할 수 있다. 이상과 같이 가중치가 임계 값 이상인 입력 이미지로 추가 학습이 수행됨에 따라 제2 인공 지능 모델은 각 타입 을 좀더 명확하게 구분하며, 복수의 제1 인공 지능 모델은 각 타입별 영상 처리에 좀더 특화될 수 있다. 도 8은 본 개시의 일 실시 예에 따른 전자 장치의 제어 방법을 설명하기 위한 흐름도이다. 먼저, 상이한 영상 처리를 수행하도록 학습된 복수의 제1 인공 지능 모델 각각에 의한 이미지의 처리 결과를 예 측하여 상기 이미지의 타입을 식별하도록 학습된 제2 인공 지능 모델에 입력 이미지를 입력하여 입력 이미지의 타입을 식별한다(S810). 그리고, 식별된 타입에 기초하여 입력 이미지를 복수의 제1 인공 지능 모델 중 하나에 입력하여 입력 이미지를 처리한다(S820). 여기서, 입력 이미지의 해상도를 다운 스케일링하는 단계를 더 포함하고, 식별하는 단계(S810)는 다운 스케일링 된 이미지를 제2 인공 지능 모델에 입력하여 입력 이미지의 타입을 식별할 수 있다. 그리고, 다운 스케일링하는 단계는 입력 이미지의 크기가 기설정된 크기 이상이면 입력 이미지를 다운 스케일링 할 수 있다. 한편, 제2 인공 지능 모델은 복수의 샘플 이미지 및 각 샘플 이미지에 대응되는 타입의 관계를 인공 지능 알고 리즘을 통해 학습하여 획득된 인공 지능 모델이고, 복수의 제1 인공 지능 모델 각각은 복수의 샘플 이미지 중 복수의 제1 인공 지능 모델 각각에 대응되는 타입의 샘플 이미지 및 샘플 이미지에 대응되는 원본 이미지의 관 계를 인공 지능 알고리즘을 통해 학습하여 획득된 인공 지능 모델일 수 있다. 여기서, 각 샘플 이미지에 대응되는 타입은 복수의 샘플 이미지 각각을 복수의 제1 인공 지능 모델 중 하나에 입력하여 복수의 샘플 이미지 각각을 처리하고, 처리된 복수의 샘플 이미지 각각의 부작용(side effect)의 타입에 기초하여 획득될 수 있다. 그리고, 부작용의 타입은 부작용 없음(none), 재깅(jagging), 블러링(blurring), 에일리어싱(aliasing) 또는 노이즈 부스팅(noise boosting) 중 적어도 하나를 포함할 수 있다. 한편, 처리하는 단계는 입력 이미지의 업 스케일링 처리, 노이즈 제거 처리 또는 디테일 향상 처리 중 적어도 하나를 포함할 수 있다. 또한, 처리하는 단계(S820)는 입력 이미지를 제2 인공 지능 모델에 입력하여 입력 이미지와 관련된 복수의 타입 에 대한 가중치를 획득하는 단계 및 복수의 타입 중 가중치가 가장 큰 타입을 입력 이미지의 타입으로 식별하는 단계를 포함할 수 있다. 여기서, 복수의 타입에 대한 가중치 중 적어도 하나가 임계 값 이상이면, 입력 이미지 및 적어도 하나의 가중치 를 저장하는 단계를 더 포함할 수 있다. 한편, 식별하는 단계(S810)는 운영 체제(Operating System)에 기초하여 동작하는 전자 장치의 프로세싱 유닛에 의해, 입력 이미지를 제2 인공 지능 모델에 입력하여 입력 이미지의 타입을 식별하고, 처리하는 단계(S820)는 전자 장치의 NPU(Neural Processing Unit)에 의해, 식별된 타입에 기초하여 입력 이미지를 복수의 제1 인공 지 능 모델 중 하나에 입력하여 입력 이미지를 처리할 수 있다. 이상과 같이 전자 장치는 인공 지능 모델을 이용하여 입력 이미지의 타입을 식별하고, 식별된 타입에 대응되는 타 인공 지능 모델을 이용하여 입력 이미지를 처리하여 입력 이미지의 처리 성능을 향상시킬 수 있다. 한편, 본 개시의 일시 예에 따르면, 이상에서 설명된 다양한 실시 예들은 기기(machine)(예: 컴퓨터)로 읽을 수 있는 저장 매체(machine-readable storage media)에 저장된 명령어를 포함하는 소프트웨어로 구현될 수 있다. 기기는, 저장 매체로부터 저장된 명령어를 호출하고, 호출된 명령어에 따라 동작이 가능한 장치로서, 개시된 실 시 예들에 따른 전자 장치(예: 전자 장치(A))를 포함할 수 있다. 명령이 프로세서에 의해 실행될 경우, 프로세 서가 직접, 또는 프로세서의 제어 하에 다른 구성요소들을 이용하여 명령에 해당하는 기능을 수행할 수 있다. 명령은 컴파일러 또는 인터프리터에 의해 생성 또는 실행되는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저 장매체는, 비일시적(non-transitory) 저장매체의 형태로 제공될 수 있다. 여기서, '비일시적'은 저장매체가 신 호(signal)를 포함하지 않으며 실재(tangible)한다는 것을 의미할 뿐 데이터가 저장매체에 반영구적 또는 임시 적으로 저장됨을 구분하지 않는다. 또한, 본 개시의 일 실시 예에 따르면, 이상에서 설명된 다양한 실시 예들에 따른 방법은 컴퓨터 프로그램 제품 (computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD-ROM))의 형태로, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 온라인으로 배포될 수 있 다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 또한, 본 개시의 일 실시 예에 따르면, 이상에서 설명된 다양한 실시 예들은 소프트웨어(software), 하드웨어 (hardware) 또는 이들의 조합을 이용하여 컴퓨터(computer) 또는 이와 유사한 장치로 읽을 수 있는 기록 매체 내에서 구현될 수 있다. 일부 경우에 있어 본 명세서에서 설명되는 실시 예들이 프로세서 자체로 구현될 수 있 다. 소프트웨어적인 구현에 의하면, 본 명세서에서 설명되는 절차 및 기능과 같은 실시 예들은 별도의 소프트웨 어 모듈들로 구현될 수 있다. 소프트웨어 모듈들 각각은 본 명세서에서 설명되는 하나 이상의 기능 및 동작을 수행할 수 있다. 한편, 상술한 다양한 실시 예들에 따른 기기의 프로세싱 동작을 수행하기 위한 컴퓨터 명령어(computer instructions)는 비일시적 컴퓨터 판독 가능 매체(non-transitory computer-readable medium)에 저장될 수 있 다. 이러한 비일시적 컴퓨터 판독 가능 매체에 저장된 컴퓨터 명령어는 특정 기기의 프로세서에 의해 실행되었 을 때 상술한 다양한 실시 예에 따른 기기에서의 처리 동작을 특정 기기가 수행하도록 한다. 비일시적 컴퓨터 판독 가능 매체란 레지스터, 캐쉬, 메모리 등과 같이 짧은 순간 동안 데이터를 저장하는 매체가 아니라 반영구 적으로 데이터를 저장하며, 기기에 의해 판독(reading)이 가능한 매체를 의미한다. 비일시적 컴퓨터 판독 가능 매체의 구체적인 예로는, CD, DVD, 하드 디스크, 블루레이 디스크, USB, 메모리카드, ROM 등이 있을 수 있다. 또한, 상술한 다양한 실시 예들에 따른 구성 요소(예: 모듈 또는 프로그램) 각각은 단수 또는 복수의 개체로 구 성될 수 있으며, 전술한 해당 서브 구성 요소들 중 일부 서브 구성 요소가 생략되거나, 또는 다른 서브 구성 요소가 다양한 실시 예에 더 포함될 수 있다. 대체적으로 또는 추가적으로, 일부 구성 요소들(예: 모듈 또는 프로 그램)은 하나의 개체로 통합되어, 통합되기 이전의 각각의 해당 구성 요소에 의해 수행되는 기능을 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따른, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작 들은 순차적, 병렬적, 반복적 또는 휴리스틱하게 실행되거나, 적어도 일부 동작이 다른 순서로 실행되거나, 생 략되거나, 또는 다른 동작이 추가될 수 있다. 이상에서는 본 개시의 바람직한 실시 예에 대하여 도시하고 설명하였지만, 본 개시는 상술한 특정의 실시 예에"}
{"patent_id": "10-2019-0150746", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "한정되지 아니하며, 청구범위에서 청구하는 본 개시의 요지를 벗어남이 없이 당해 개시에 속하는 기술분야에서 통상의 지식을 가진 자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 개시의 기술 적 사상이나 전망으로부터 개별적으로 이해되어져서는 안될 것이다."}
{"patent_id": "10-2019-0150746", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1a 내지 도 1c는 종래 기술의 문제점을 설명하기 위한 도면들이다. 도 2는 본 개시의 일 실시 예에 따른 전자 장치의 구성을 나타내는 블럭도이다. 도 3은 본 개시의 일 실시 예에 따른 프로세서의 동작을 설명하기 위한 도면이다. 도 4a 및 도 4b는 본 개시의 일 실시 예에 따른 이미지 타입에 따른 프로세서의 동작을 설명하기 위한 도면들이 다. 도 5a 내지 도 5c는 본 개시의 일 실시 예에 따른 복수의 제1 인공 지능 모델 및 제2 인공 지능 모델의 학습 방 법을 설명하기 위한 도면들이다. 도 6은 본 개시의 일 실시 예에 따른 실시간 연산을 설명하기 위한 도면이다. 도 7은 본 개시의 일 실시 예에 따른 복수의 제1 인공 지능 모델 및 제2 인공 지능 모델의 업데이트를 설명하기 위한 도면이다. 도 8은 본 개시의 일 실시 예에 따른 전자 장치의 제어 방법을 설명하기 위한 흐름도이다."}
