{"patent_id": "10-2018-0130577", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0049972", "출원번호": "10-2018-0130577", "발명의 명칭": "사료 영양성분의 유사도 분석 장치 및 방법", "출원인": "우송대학교 산학협력단", "발명자": "김삼택"}}
{"patent_id": "10-2018-0130577", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "또는 청구항 4에 있어서, 상기 유사도 분석부에서 분석되는 유사도 분석시 주요 영양소와 특이 영양소에 부여되는 가중치를 설정하는 분석 환경설정부;를 더 포함하는 것을 특징으로 하는 사료 영양성분의 유사도 분석 장치."}
{"patent_id": "10-2018-0130577", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 상기 사료별 성분정보는 주요 영양소 및 특이 영양소의 종류 및 함유비율 정보를 포함하는 것을 특징으로 하는사료 영양성분의 유사도 분석 장치."}
{"patent_id": "10-2018-0130577", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서, 상기 주요 영양소는 조단백질, 조지방, 조섬유, 조회분, 칼슘, 인, 수분, 및 함유량 정보가 수치화된 영양소을모두 포함하고, 상기 특이 영양소는 비타민, 오메가-3, 오메가-6, DHA, EPA, 및 함유 여부를 표시하는 영양소를모두 포함하는 것을 특징으로 하는 사료 영양성분의 유사도 분석 장치."}
{"patent_id": "10-2018-0130577", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서, 상기 유사도 분석은 하기의 수학식에 의해 계산되는 것을 특징으로 하는 사료 영양성분의 유사도 분석 장치. [수학식]이때, 비교 대상 사료 Ai 와 Bi에 해당되며, i는 사료 A, B의 특징 번호이고, r은 Ai가 true이고 Bi가 true일경우의 값이며, p는 Ai가 false, Bi가 true일 경우 값이며, q는 Ai가 true, Bi가 false일 경우의 값에 해당되고, wi는 가중치 행렬의 값을 나타냄. 공개특허 10-2020-0049972-3-청구항 5"}
{"patent_id": "10-2018-0130577", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "사료 영양성분의 유사도 분석 방법에 있어서, (a) 주요 영양소 및 특이 영양소의 데이터 특성간 범위를 일치시키기 위해 데이터를 정규화하는 단계;(b) 상기 (a) 단계에서 정규화된 데이터 중 기설정된 기준에 벗어난 데이터를 정제하여 전처리하는 단계; 및 (c) 상기 (b) 단계에서 전처리된 데이터을 이용하여 사료의 성분 정보에 대한 유사도를 분석하는 단계;로 이루어지되, 상기 유사도는 하기와 같은 수학식으로 계산되는 것을 특징으로 하는 사료 영양성분의 유사도 분석 방법. [수학식]이때, 비교 대상 사료 Ai 와 Bi에 해당되며, i는 사료 A, B의 특징 번호이고, r은 Ai가 true이고 Bi가 true일경우의 값이며, p는 Ai가 false, Bi가 true일 경우 값이며, q는 Ai가 true, Bi가 false일 경우의 값에 해당되고, wi는 가중치 행렬의 값을 나타냄."}
{"patent_id": "10-2018-0130577", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 6에 있어서, 상기 주요 영양소는 조단백질, 조지방, 조섬유, 조회분, 칼슘, 인, 수분, 및 함유량 정보가 수치화된 영양소을모두 포함하고, 상기 특이 영양소는 비타민, 오메가-3, 오메가-6, DHA, EPA, 및 함유여부를 표시하는 영양소를모두 포함하는 것을 특징으로 하는 사료 영양성분의 유사도 분석 방법."}
{"patent_id": "10-2018-0130577", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 6에 있어서, 상기 (b) 단계의 데이터를 전처리하는 방법은 하기와 같은 수학식으로 이루어지는 것을 특징으로 사료 영양성분의 유사도 분석 방법. [수학식]공개특허 10-2020-0049972-4-이때, 는 정규화 결과이며, 는 I번째 특성데이터, 는 x특성의 평균값, 는 x의 표준편차를 나타냄."}
{"patent_id": "10-2018-0130577", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 6에 있어서, 상기 (a)단계 이전에 임의의 사료별 성분 정보를 저장하는 단계가 선행되는 것을 특징으로 하는 사료 영양성분의 유사도 분석 방법."}
{"patent_id": "10-2018-0130577", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 6에 있어서, 상기 (C)단계 전에 유사도 분석법에 적용하는 가중치를 결정하거나 설정하는 단계를 더 포함하는 것을 특징으로하는 사료 영양성분의 유사도 분석 방법."}
{"patent_id": "10-2018-0130577", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 본 발명은 시중에서 유통되고 있는 펫푸드의 유사도를 분석하는 사료 영양성분의 유사도 분석 장치 및 방법에 관한 것으로, 임의의 사료별 성분 정보가 저장된 사료 성분정보DB, 신규 입력된 사료의 성분을 상기 사료 성분정보DB에 저장된 사료의 성분과 비교하여 각 영양소의 속성별로 값의 정규화를 진행하는 전처리부, 상기 전 처리부를 통해 정규화된 사료의 성분 정보를 바탕으로 각 사료들간의 유사도를 분석하는 유사도 분석부, 및 상기 유사도 분석부에서 분석된 사료들간의 유사도 정보를 저장하는 유사도 정보DB를 포함한다."}
{"patent_id": "10-2018-0130577", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 시중에서 유통되고 있는 사료(펫푸드)의 유사도를 분석하는 사료 영양성분의 유사도 분석 장치 및 방 법에 관한 것이다."}
{"patent_id": "10-2018-0130577", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "오늘날 반려동물은 1인가구, 노인가구, 핵가족화 등에 의해 반드시 필요한 가족의 일원으로 자리매김하고 있다. 과거 집에서 기르는 개나 고양이를 애완동물(Pet)이라 하였으며, 최근에 들어 사람과 더불어 사는 동물로써, 사 람과 정서적으로 의지하는 가족의 일원으로 대우하는 차원에서의 동물을 반려동물이라 한다. 오늘날의 사회에서 반려동물은 재미로 혹은 예뻐서 키우는 동물적 동반이 아닌, 가족구성원의 일원으로써, 1인 가족 혹은 고령화에 매우 적절한 동반자 역할을 하고 있다. 이러한 반려동물은 현시점에서 약 1천 마리 이상이 반려동물로써 등록되어 있으며, 등록되지 않은 반려동물 수까지 고려하면 어마어마한 실정이다. 이와 같이, 반려동물에 대한 인식이 달라지면서 반려동물에게 먹이는 반려동물 사료시장이 함께 성장하여 증가 하고 있는 추세이다. 또한, 최근 4차산업혁명의 핵심기술인 빅데이터, 사물인터넷, 인공지능 등의 기술을 활용하여 인간의 삶을 바꾸 려는 노력과 더불어 반려동물에게도 적용하려는 시도가 늘고 있다. 특히, 빅데이터 기술을 활용하여 반려동물에게 맞춤형 추천서비스 등의 헬스케어 서비스에 대한 연구가 늘어나 고 있으며, 반려동물에 대한 맞춤형 헬스케어 서비스를 구현하기 위해서는 우선적으로 반려동물이 매일 섭취하 는 사료에 대한 성분을 통계적 모델을 기반으로 분석할 필요성이 있다. 해외의 경우, 반려동물 사료에 대하여 국제적인 표준 기관인 미국사료협회(AAFCO)에서 펫푸드에 대한 라벨링(표 기법), 원재료 명칭 정의, 영양성분에 대한 가이드라인을 제시하고 있으며, 라벨링의 경우 7대 영양소외의 특이 영양소까지 g당 용량을 기입하도록 하고 있다. 미국사료협회에서는 제시된 가이드라인을 충족해야만 'AAFCO'인증을 받을수 있으며, 대부분의 사료가 'AAFCO'인 증마크를 받아 사료를 생산하여 유통하고 잇다. 그러나, 국내의 경우, 'AAFCO'의 국제 표준에 따른 라벨링, 원재료 명칭 및 정의하는 것이 아닌 국내 사료 표기 법에 따른 제한적인 라벨링을 하고 있다. 국내 사료 표기법은 7대 주요 영양소의 경우, 국내의 법률 「농림축산식품부 고시, 사료 등의 기준 및 규격 제9 조 제1항」에 의해 식품의약품안전처에 사료에 함유된 성분량을 정확히 등록해야 하므로 성분표에는 7대 주요 영양소가 정확히 기재되어 있다. 하지만, 기타 영양소의 경우 정확한 첨부량의 등록의무가 없기 때문에 첨부 여부만 간단히 표기되어 있거나, 미 표기 되어있는 경우가 많다. 이에 따라, 수많은 사료들에 대한 성분이나 성분의 함유율을 파악하기 위해 하나 하나 반려동물의 사료에 기재 되어 있는 정보를 찾아야 하므로 비슷한 성분이 함유된 사료를 파악하고, 대체할 수 있는 사료를 찾고, 어떤 종 류의 사료가 있는지 쉽게 파악할 수 있는 방법이 없었다. 대부분 사용자(반려동물을 키우는 주인)가 주로 다니는 펫샵이나 주변 마트에서 판매하고 있는 제품에 한해서 반려동물의 사료를 구입하여 반려동물에게 제공하고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국공개특허공보 제10-2015-0131190호"}
{"patent_id": "10-2018-0130577", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 반려동물의 사료의 성분별 유사도를 분석하는 사료 영양성분의 유사도 분석 장치 및 방법을 제공하는 것이다. 특히, 본 발명은 사료에 함유비율이 표시되는 주요 영양소 및 포함여부로 표시되는 특이 영양소를 구분하여 표 시되는 정보에 대해 적합한 특성을 고려하여 사료의 성분별 유사도를 분석하는 사료 영양성분의 유사도 분석 장 치 및 방법을 제공하는 것이다. 본 발명이 이루고자 하는 기술적 과제들은 이상에서 언급한 기술적 과제들로제한되지 않으며, 언급되지 않은 또 다른 기술적 과제들은 아래의 기재로부터 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2018-0130577", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 과제를 달성하기 위한 본 발명의 사료 영양성분의 유사도 분석 장치는 임의의 사료별 성분 정보가 저장된 사료성분 정보DB; 신규 입력된 사료의 성분을 상기 사료성분 정보DB에 저장된 사료의 성분과 비교하여 각 영양 소의 속성별로 값의 정규화를 진행하는 전처리부; 상기 전처리부를 통해 정규화된 사료의 성분 정보를 바탕으로 각 사료들간의 유사도를 분석하는 유사도 분석부; 및 상기 유사도 분석부에서 분석된 사료들간의 유사도 정보를 저장하는 유사도 정보DB;를 포함하되, 상기 유사도 분석부는 코사인 유사도 분석법과 자카드 유사도 분석법을 조합한 알고리즘에 의해 사료들간의 유사도를 분석하는 것을 특징으로 한다. 또한, 상기 사료별 성분정보는 주요 영양소 및 특이 영양소의 종류 및 함량 정보를 포함하는 것을 특징으로 한 다. 또한, 상기 주요 영양소는 조단백질, 조지방, 조섬유, 조회분, 칼슘, 인, 수분, 및 함유량 정보가 수치화된 영 양소을 모두 포함하고, 상기 특이 영양소는 비타민, 오메가-3, 오메가-6, DHA, EPA, 및 함유 여부를 표시하는 영양소를 모두 포함하는 것을 특징으로 한다. 또한, 상기 유사도 분석은 하기의 수학식에 의해 계산되는 것을 특징으로 한다. [수학식]"}
{"patent_id": "10-2018-0130577", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "이때, 비교 대상 사료 Ai 와 Bi에 해당되며, i는 사료 A, B의 특징 번호이고, r은 Ai가 true이고 Bi가 true일 경우의 값이며, p는 Ai가 false, Bi가 true일 경우 값이며, q는 Ai가 true, Bi가 false일 경우의 값에 해당되 고, wi는 가중치 행렬의 값을 나타낸다. 또한, 상기 유사도 분석부에서 분석되는 유사도 분석시 주요 영양소와 특이 영양소에 부여되는 가중치를 설정하 는 분석 환경설정부;를 더 포함하는 것을 특징으로 한다. 상기 과제를 달성하기 위한 또 다른 본 발명의 사료 영양성분의 유사도 분석 방법은 사료 영양성분의 유사도 분 석 방법에 있어서, (a) 주요 영양소 및 특이 영양소의 데이터 특성간 범위를 일치시키기 위해 데이터를 정규화 하는 단계; (b) 상기 (a) 단계에서 정규화된 데이터 중 기설정된 기준에 벗어난 데이터를 정제하여 전처리하는 단계; 및 (c) 상기 (b) 단계에서 전처리된 데이터을 이용하여 사료의 성분 정보에 대한 유사도를 분석하는 단계;로 이루어지되, 상기 유사도는 하기와 같은 수학식으로 계산되는 것을 특징으로 한다. [수학식]"}
{"patent_id": "10-2018-0130577", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 3, "content": "이때, 비교 대상 사료 Ai 와 Bi에 해당되며, i는 사료 A, B의 특징 번호이고, r은 Ai가 true이고 Bi가 true일 경우의 값이며, p는 Ai가 false, Bi가 true일 경우 값이며, q는 Ai가 true, Bi가 false일 경우의 값에 해당되 고, wi는 가중치 행렬의 값을 나타낸다. 또한, 상기 주요 영양소는 조단백질, 조지방, 조섬유, 조회분, 칼슘, 인, 수분, 및 함유량 정보가 수치화된 영 양소을 모두 포함하고, 상기 특이 영양소는 비타민, 오메가-3, 오메가-6, DHA, EPA, 및 함유여부를 표시하는 영 양소를 모두 포함하는 것을 특징으로 한다. 또한, 상기 (b) 단계의 데이터를 전처리하는 방법은 하기와 같은 수학식으로 이루어지는 것을 특징으로 한다. [수학식]"}
{"patent_id": "10-2018-0130577", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 4, "content": "이때, 는 정규화 결과값이며, 는 I번째 특성데이터, 는 x특성의 평균값, 는 x의 표준편차를 나타낸다. 또한, 상기 (a)단계 이전에 임의의 사료별 성분 정보를 저장하는 단계가 선행되는 것을 특징으로 한다. 또한, 상기 (C)단계 전에 유사도 분석법에 적용하는 가중치를 결정하거나 설정하는 단계를 더 포함하는 것을 특 징으로 한다."}
{"patent_id": "10-2018-0130577", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상에서 설명한 바와 같이, 본 발명은 영양소에 따라 적합한 유사도 알고리즘을 이용하여 유사도를 분석함으로써, 사용자가 원하는 성분이 함유된 사료와 유사한 사료의 리스트를 높은 정확도의 유사도로 검색할 수 있는 효과가 있다. 또한, 본 발명은 사료의 종류의 수가 많아지고, 요청이 많아지면 트래픽이 발생함으로 반려동물의 사료 영양소 에 따른 속성들에 대한 유사도를 데이터베이스화(DB)하여 검색속도를 상승시키는 효과가 있다."}
{"patent_id": "10-2018-0130577", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명에 따른 실시예를 상세히 설명한다. 또한, 도면에 도시된 구성요소의 크기나 형상 등은 설명의 명료성과 편의상 과장되게 도시될 수 있으며, 본 발 명의 구성 및 작용을 고려하여 특별히 정의된 용어들은 사용자, 운용자의 의도 또는 관례에 따라 달라질 수 있 고, 이러한 용어들에 대한 정의는 본 명세서 전반에 걸친 내용을 토대로 내려져야 한다. 도 1은 본 발명의 실시예에 따른 사료 영양성분의 유사도 분석장치를 나타낸 블록도로서, 유사도 분석장치는 사 료성분 정보DB, 전처리부, 유사도 분석부, 유사도 정보DB, 및 분석 환경설정부를 포 함한다. 사료성분 정보DB는 임의의 사료별 성분 정보가 저장되어 있으며, 이는 사료의 성분 데이터를 반려동물별로 분류하고, 각 사료의 주요 영양소 및 특이 영양소의 종류 및 함유비율 정보별로 저장한다. 여기서, 주요 영양소는 조단백질, 조지방, 조섬유, 조회분, 칼슘, 인, 수분, 및 함유량 정보가 수치화된 영양소 을 모두 포함하고, 특이 영양소는 비타민, 오메가-3, 오메가-6, DHA, EPA, 및 함유 여부를 표시하는 영양소를 모두 포함한다. 이때, 특이 영양소의 경우 상황 또는 정책에 따라 함유 여부에서 수치화된 함유비율 정보로 변경될 수 있으므로, 여기서, 수치화된 특이 영양소는 주요 영양소로 전환되어 구분될 수 있다. 전처리부는 신규 입력된 사료의 성분을 사료성분 저장DB에 저장된 사료의 성분과 비교하여 각 영양소 의 속성별로 값을 정규화한다. 이는 분석 에러율을 낮추기 위한 것으로, 값의 분포가 비슷한 상황에서 1이 차이나는 것과 값의 분포가 매우 큰 경우에 1이 차이 나는 것은 분명 다른 경우이므로 분산으로 나눔으로써 원래 분포의 퍼짐에 의한 효과를 상쇄하 고자 하는 것이다. 유사도 분석부는 전처리부를 통해 정규화된 사료의 성분 정보를 바탕으로 각 사료들간의 유사도를 분 석한다. 이때, 유사도 분석부는 각 영양소에 적합한 유사도 분석법을 적용하여 분석하는데, 유사도 분석부는 코사인 유사도 분석법과 자카드 유사도 분석법을 조합한 알고리즘에 의해 사료들간의 유사도를 분석한다. 더욱 바람직하게는, 주요 영양소의 유사도는 코사인 유사도 분석법을 사용하여 분석하고, 상기 특이 영양소는 자카드 유사도 분석법으로 분석한다. 유사도 분석부의 분석 방법에 대한 설명은 하기의 사료 영양성분의 유사도 분석방법에서 다시 설명하기로 한다. 유사도 정보DB는 유사도 분석부에서 분석된 사료들간의 유사도 정보를 저장 및 관리한다. 이때, 유사 도 정보DB는 유사도 분석부에서 분석된 정보를 누적하여 저장하며, 새로운 사료에 대한 정보가 입력될 때마다 기 저장된 유사도와 비교하여 저장되고, 관리되는 것이 바람직하다. 분석 환경설정부는 유사도 분석부에서 주요 영양소 및 특이 영양소에 따라 유사도 분석 방법에 차이 가 있고, 유사도 분석시 함유비율에 현저한 차이가 있어, 정확한 유사도를 분석하기 위해 분석되는 주요 영양소 및 특이 영양소에 부여되는 가중치가 차이가 있으므로, 이를 설정 또는 결정한다. 즉, 외부 입력에 의해 가중치를 설정하거나, 기 저장된 기준에 의해 가중치가 결정될 수 있다. 도 2는 본 발명의 실시예에 따른 사료 영양성분의 유사도 분석방법을 나타낸 흐름도로, 먼저, 주요 영양소 및 특이 영양소의 데이터 특성간 범위를 일치시키기 위해 데이터를 정규화한다(S100). 이때, 사료 성분 특성들의 데이터 범위를 동일한 범주에 맞추는 과정이 선행되어야 함에 따라 넓게 퍼져있는 사 료의 주요 영양소 및 특이 영양소의 로우 데이터(raw data)들에 대한 정규화를 수행한다. 여기서, 주요 영양소는 조단백질, 조지방, 조섬유, 조회분, 칼슘, 인, 및 수분을 포함하고, 특이 영양소는 비타 민, 오메가-3, 오메가-6, DHA, EPA, 및, 함유여부를 표시하는 영양소를 모두 포함할 수 있다. [표 1]"}
{"patent_id": "10-2018-0130577", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "표 1 나타낸 바와 같이, 국내외 유통되고 있는 반려동물의 사료의 등록성분표를 보면, 주요 영양소는 함유비율 이 표기되고, 특이 영양소는 포함여부를 나타내는 것이 일반적이므로 이를 이용한다. 주요 영양소의 총합은 1이며, 표 1에 나타낸 주요 영양소의 성분 함유비율에서 나타낸 수치 외에 나머지는 탄수 화물로 계산한다. 반려동물의 사료에서 주요 영양소에 인과 칼슘이 포함되는 이유는 반려동물은 사람과 달리 인과 칼슘을 체내에 서 생성할 수 없어, 인과 칼슘이 적당한 비율로 섞여 있지 않으면, 영양학적으로 오히려 반려동물에 독이 되어 반려동물의 체내에 영양을 미치기 때문이다. 그래서, 인과 칼슘의 경우는 반려동물 대부분의 사료 종류에 포함되어 있다. 또한, 특이 영양소의 경우, 사료 전체 영양소에서 주요 영양소와 같이 백분율로 표시되지 않고, 용량으로 기재 되어 있거나 포함여부로 나타내어 주요 영양소의 총합에 포함되지 않는다. 특이 영양소는 표 1에 도시되지 않았으나, 비타민 A, 비타민 C, 비타민 D3, 비타민 E, 오메가-3, 오메가-6, DHA, EPA, L-카르니틴, 글루코사민, 나이아신, 나트륨, 아연, 타우린, 황산, 콘드로이틴, 구리(황산동), 바이오 틴, 철(Fe), 망간(Mn), 마그네슘, 및 유산균 등이 더 포함될 수 있다. 이어, 정규화된 데이터 중 기설정된 기준에 벗어난 데이터를 정제하여 전처리한다(S200). 여기서, 기설정된 기준은 정규화된 데이터의 정상범주에서 크게 벗어난 이상치 및 결측치 데이터로 분석된 항목 이며, 분석 결과가 왜곡되기 때문에 분석에 앞서 이상치를 제거하는 작업을 진행해야 한다. 전처리하는 방법은 다음과 같다. 먼저, 정규화된 데이터 분포의 1사분위수, 3사분위수, IQR(중앙값) 등으로 이상치를 제외한 최대값, 최소값을 구한다. IQR(중앙값) = Q3(3사분위수)-Q1(1사분위수) 최소값 = Q1(1사분위수) - (1.5 * IQR) 최대값 = Q3(3사분위수) + (1.5 * IQR) 그리고, 최대값 이상, 최소값 이하의 데이터들은 이상치(Out lier)로 분류하며, 이상치값은 유사도 분석 대상에 서 제외한다. 그러나, 본 발명의 실시예에서 예외적으로, 데이터가 이상치임에도, 사용자의 설정에 의해 하기와 같이 보정할 수 있음이 바람직하다. 예컨대, 최소값 이하의 '이상치' 데이터의 경우, '최소값'으로 보정하고, 최대값 이하의 '이상치' 데이터의 경 우, '최대값'으로 보정한다. 도 3에 도시한 바와 같이, 수치값으로 표현된 주요 영양소(도단백, 조지방, 조섬유, 조회분, 인, 칼슘, 수분 등)의 이상치값을 보여주기 위해 Box-Plot을 사용한다. X축은 주요 영양소의 각 주요 성분을 의미하고, Y축은 정규화된 데이터 수치값을 나타내는 것으로, 이상치를 제 거하기 위해, 사분위수를 이용하여 제거한다. 주요 영양소의 각 데이터의 최소값, 1사분위수, 중위수(2사분위수), 평균, 3사분위수, 최대값을 구하여 표현할 수 있다. 즉, 값의 분포가 비슷한 상황에서 1이 차이나는 것과, 값의 분포가 매우 큰 경우에 1 차이나는 것은 분명 다른 경우이므로 분산으로 나눔으로써 원래 분포의 퍼짐에 의한 효과를 상쇄시킨다. 이 단계에서 데이터를 전처리하는 방법은 하기와 같은 수학식 1에 의해 계산된다. 수학식 1"}
{"patent_id": "10-2018-0130577", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이때, 는 정규화 결과값이며, 는 I번째 특성데이터, 는 x특성의 평균값, 는 x의 표준편차를 나타낸다. 이 과정에서 주요 영양소를 분석하면 분산값이 크게 측정되는 데이터들이 존재하나 이와 같은 데이터들은 오류 율을 높이므로 전처리과정에서 삭제하는 것이 바람직하다. 이어, 주요 영양소 및 특이 영양소별 가중치를 설정 또는 결정한다(S300). 이때, 주요 영양소와 특이 영양소에 각기 다른 가중치를 부여함으로써, 영양소의 함유비율이 적은 특이 영양소에 의해 유사도에 큰 영향을 주지 않 는다. 본 발명의 실시예에서 주요 영양소와 특이 영양소의 중요도의 차이에 따라 주요 영양소의 유사도를 분석할 수 있는 코사인 유사도 분석의 가중치를 70~90%(0.7~0.9)로 부여하고, 특이 영양소의 유사도를 분석할 수 잇는 자 카드 유사도 분석의 가중치를 10~30%(0.1~0.3)로 부여할 수 있으며, 가중치는 설정되거나 기 설정된 기준에 따 라 결정될 수 있다. 마지막으로, 전처리된 데이터을 통해 사료의 특징간 유사도를 측정한다(S400). 본 발명의 실시예에서 사료 데이터의 특성은 주요 영양소와 특이 영양소로 구분되는데, 주요 영양소는 성분의 양보다는 비율로 표기되어 있어 데이터의 크기보다는 벡터의 기울기값에 적합한 코사인 유사도(Cosine Similarity) 분석법을 적용하고, 특이 영양소의 경우 성분 포함 여부만 표기되어 있어 바이너리 데이터에 적합 한 자카드 유사도(Jaccard Similarity) 분석법을 사용한다. 또한, 사료의 특성은 특이 영양소보다는 주요 영양소에 결정적인 성분이 많이 함유되어 있으므로, 코사인 유사 도 분석법의 경우 분석시에 가중치를 적용하며, 사료의 주요 영양소 및 특이 영양소에 대한 유사도 측정은 다음 과 같은 수학식 2로 계산한다. 수학식 2"}
{"patent_id": "10-2018-0130577", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "이때, 비교 대상 사료 Ai 와 Bi에 해당되며, i는 사료 A, B의 특징 번호이고, r은 Ai가 true이고 Bi가 true일 경우의 값이며, p는 Ai가 false, Bi가 true일 경우 값이며, q는 Ai가 true, Bi가 false일 경우의 값에 해당되 고, wi는 가중치 행렬의 값을 나타낸다. 이와 같이, 하나의 유사도 분석법을 이용한 것이 아니라 제공되는 정보에 따라 각기 다른 유사도 분석법을 이용 하고 이에 대한 평균을 통해 높은 정확도의 유사도를 분석할 수 있다. 따라서, 본 발명은 영양소에 따라 적합한 유사도 알고리즘을 이용하여 유사도를 분석함으로써, 사용자가 원하는 성분이 함유된 사료와 유사한 사료의 리스트를 높은 정확도의 유사도로 검색할 수 있는 효과가 있다. 또한, 본 발명은 사료의 종류의 수가 많아지고, 요청이 많아지면 트래픽이 발생함으로 반려동물의 사료 영양소 에 따른 속성들에 대한 유사도를 DB화하여 검색속도를 상승시키는 효과가 있다. 이상에서 본 발명에 따른 실시예들이 설명되었으나, 이는 예시적인 것에 불과하며, 당해 분야에서 통상적 지식 을 가진 자라면 이로부터 다양한 변형 및 균등한 범위의 실시예가 가능하다는 점을 이해할 것이다. 따라서, 본 발명의 진정한 기술적 보호 범위는 다음의 특허청구범위에 의해서 정해져야 할 것이다."}
{"patent_id": "10-2018-0130577", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 사료 영양성분의 유사도 분석 장치를 나타낸 블록도이다. 도 2는 본 발명의 실시예에 따른 사료 영양성분의 유사도 분석 방법을 나타낸 블록도이다. 도 3은 본 발명의 실시예에 따른 사료 영양성분의 유사도 분석 방법의 전처리 단계에서 주요 영양소의 이상치값 을 나타낸 그래프이다."}
