{"patent_id": "10-2023-0009069", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0116297", "출원번호": "10-2023-0009069", "발명의 명칭": "개인화 모델을 이용하여 사용자 맞춤 상품을 결정하는 방법 및 이를 수행하는 온라인 쇼핑몰", "출원인": "주식회사 아이클레이브", "발명자": "최윤내"}}
{"patent_id": "10-2023-0009069", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "프로세서를 포함하며, 개인화 모델을 이용하여 사용자 맞춤 상품을 결정하기 위한 쇼핑몰 관리 장치에 있어서, 쇼핑몰 사이트에 접속한 복수의 사용자의 쇼핑몰 내역을 수집하여 복수의 사용자의 개인 데이터를 생성하도록구성된 데이터 수집부; 상기 복수의 사용자의 개인 데이터를 이용하여 상기 복수의 사용자 각각에 대한 개인화 모델을 생성하도록 구성된 모델 생성부; 및 상기 복수의 사용자의 개인 데이터를 각각의 개인화 모델에 입력하여 상기 복수의 사용자의 맞춤 상품군을 각각결정하도록 구성된 상품 추천부를 포함하는, 쇼핑몰 관리 장치."}
{"patent_id": "10-2023-0009069", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1항에 있어서, 상기 데이터 수집부는, 상기 사용자 단말의 접속 내역을 수집하기 위해, 상기 쇼핑몰 사이트에 접속한 사용자 단말에서 사용자 로그인 동작을 수행하고 상기 사용자 단말의 쿠키 데이터를 상기 쇼핑몰 관리 장치로 제공하는 것을 허용하는 경우 상기 사용자 단말의 쿠키 데이터 내 쿠키 아이디에로그인된 사용자 아이디를 결합하고 상기 사용자 아이디가 결합된 쿠키 데이터를 상기 사용자의 접속 내역으로수집하는 것을 특징으로 하는, 쇼핑몰 관리 장치."}
{"patent_id": "10-2023-0009069", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1항에 있어서, 상기 데이터 수집부는, 상기 사용자 단말의 쇼핑몰 내역을 수집하기 위해,상기 쇼핑몰 사이트에 접속한 사용자 단말에서 사용자 로그인 동작을 수행하지 않고 상기 쇼핑몰 사이트에 대한상기 사용자 단말의 쿠키 데이터를 상기 쇼핑몰 관리 장치로 제공하는 것을 허용하지 않는 경우 상기 쇼핑몰 사이트에 대한 상기 사용자 단말의 세션 데이터 내 세션 아이디를 사용자 아이디로 설정하고 상기 사용자 단말의세션 데이터를 상기 사용자의 쇼핑몰 내역으로 수집하고, 그리고 상기 쇼핑몰 사이트에 접속한 사용자 단말에서 사용자 로그인 동작을 수행하거나 접속 이전에 상기 사용자 단말의 쿠키 데이터가 제공된 것이 확인되는 경우, 상기 사용자 단말의 사용자 아이디를 검색하여 상기 사용자 아이디에 연관된 상기 사용자의 과거 쇼핑몰 내역을 상기 사용자의 쇼핑몰 내역으로 수집하는 것을 특징으로 하는, 쇼핑몰 관리 장치."}
{"patent_id": "10-2023-0009069", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1항에 있어서, 상기 데이터 수집부에서는 사용자의 주문 이벤트 데이터, 사용자의 주문 상품 데이터, 사용자의 관심 상품 데이터, 및 사용자의 접속 데이터 중 적어도 둘 이상의 데이터가 사용자의 개인 데이터로서 획득되고, 상기 주문 이벤트 데이터는 사용자의 주문 이벤트 아이디, 사용자 아이디, 주문 채널 정보, 주문 상태 정보, 주문 일자 정보, 주문 상품 정보, 주문 수량 정보, 주문 금액 정보 중 적어도 일부를 포함하고, 공개특허 10-2024-0116297-3-상기 사용자의 주문 상품 데이터는 상품 아이디, 제공 브랜드, 상품 가격 정보, 상품군 정보, 상품 명칭 정보,판매 상태 정보, 진열 상태 정보, 출시 일자 정보, 상품 속성 정보 중 적어도 일부를 포함하고, 상기 사용자의주문 상품 데이터 중 일부가 상기 주문 이벤트 데이터 내 주문 상품 정보로 이용되고, 상기 판매 상태 정보 및진열 상태 정보는 해당 상품의 유통 결과에 따라 실시간으로 업데이트되는 것이고, 상기 사용자의 관심 상품 데이터는 관심 상품 아이디, 관심 상품의 리뷰 평점 정보, 관심 상품에 대한 사용자의상품 클릭 정보, 관심 상품에 대한 사용자의 상품 페이지 체류 시간 중 하나 이상을 포함하고, 상기 관심 상품아이디는 장바구니에 포함되거나 원하는 목록(wish list)에 포함된 상품 아이디이고, 상기 사용자의 접속 데이터는 기준 기간 동안의 사용자의 쇼핑몰 사이트에 대한 접속 빈도, 기준 기간 동안의사용자의 쇼핑몰 사이트에 대한 최근 접속일 정보, 기준 기간 동안의 사용자의 쇼핑몰 사이트에 대한 접속 지속시간 정보 중 하나 이상을 포함하는 것을 특징으로 하는,쇼핑몰 관리 장치."}
{"patent_id": "10-2023-0009069", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 4항에 있어서, 상기 사용자의 접속 데이터는 상기 사용자를 쇼핑몰 사이트에 접속하게 한 유입 채널 정보, 유입 채널 상세 정보를 더 포함하고, 상기 유입 채널 정보는 상기 사용자의 쿠키 데이터 내 유입 URL을 분석하여 산출되며, 상기 사용자의 유입 채널 정보를 더 포함할 경우 각각의 유입 채널별 기준 기간 동안의 사용자의 쇼핑몰 사이트에 대한 접속 빈도, 각각의 유입 채널별 기준 기간 동안의 사용자의 쇼핑몰 사이트에 대한 최근 접속일 정보,각각의 유입 채널별 기준 기간 동안의 사용자의 쇼핑몰 사이트에 대한 접속 지속 시간 중 하나 이상을 더 포함하는 것을 특징으로 하는, 쇼핑몰 관리 장치."}
{"patent_id": "10-2023-0009069", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 1항에 있어서, 상기 개인화 모델은 입력 레이어, 하나 이상의 은닉 레이어 및 출력 레이어를 포함한 인공신경망으로 구성되고,상기 모델 생성부는, 개인 데이터에 포함된 각각의 항목을 입력 레이어에 입력될 파라미터로 설정하고, 개인화 모델을 생성할 당시에상기 쇼핑몰에 등록된 상품군을 출력 레이어에서 출력될 파라미터로 설정하는 것을 특징으로 하는, 쇼핑몰 관리 장치."}
{"patent_id": "10-2023-0009069", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 6항에 있어서, 상기 모델 생성부는, 사용자가 선택한 내역이 있는 상품이 속하는 상품군을 가리키는 레이블 데이터를 사용자의 개인 데이터로부터추출하고, 상기 사용자가 선택한 내역에 기록된 상품 선택 시점을 기준으로 미리 설정된 기준 기간 동안 수집되었던 사용자의 개인 데이터를 트래이닝 데이터로 추출하며, 동일한 선택 내역에 기초한 레이블 데이터를 상기 트래이닝 데이터에 연관시켜 복수의 선택에 따른 복수의 트래이닝 샘플을 생성하고, 공개특허 10-2024-0116297-4-상기 복수의 트래이닝 샘플을 상기 인공신경망에 순차적으로 입력하여, 개인 데이터와 사용자의 선택 상품 간의상관 관계를 추론해 입력된 개인 데이터의 사용자가 상기 쇼핑몰의 판매 가능한 상품군 중에서 선택할 상품군을예측하도록 상기 인공신경망의 모델 파라미터를 학습하도록 구성되며, 상기 상품 추천부는, 예측 시점을 기준으로 과거의 기준 기간 동안의 사용자의 개인 데이터를 상기 사용자의 개인화 모델에 입력하여출력된 상품군을 사용자 맞춤 상품군으로 결정하는 것을 특징으로 하는, 쇼핑몰 관리 장치."}
{"patent_id": "10-2023-0009069", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 6항에 있어서, 상기 데이터 수집부는 상기 사용자가 선택한 내역에 기록된 사용자의 상품 선택 시점을 미리 설정된 복수의 단위 시간으로 분석하도록 더 구성되고, 상기 개인화 모델은 입력 레이어, 하나 이상의 은닉 레이어 및 출력 레이어를 포함한 인공신경망을 복수의 서브모델로 포함하고, 각각의 서브 모델은 대응하는 단위 시간에 상기 사용자가 선택할 상품군을 예측하도록 구성된 것이고, 상기 복수의 서브 모델을 포함한 상기 개인화 모델은 단위 시간별 상품군 예측 결과에 단위 시간별 가중치를 적용하여사용자 맞춤 상품군을 결정하도록 구성되며, 상기 모델 생성부는, 상기 사용자가 선택한 내역이 있는 상품이 속하는 상품군을 가리키는 레이블 데이터를 사용자의 개인 데이터로부터 추출하고, 상기 상품 선택 시점을 기준으로 미리 설정된 과거의 기준 기간 동안 수집되었던 사용자의 개인 데이터를 트래이닝 데이터로 추출하며, 동일한 선택 내역에 기초한 레이블 데이터를 상기 트래이닝 데이터에 연관시켜 복수의 트래이닝 샘플을 생성하고 - 상기 하나의 선택 내역으로부터 복수의 단위 시간에 대응하는 다중 트래이닝 샘플(multiple trainingsample)이 생성되고, 복수의 트래이닝 샘플은 단위 시간으로 서브 세트화됨, 단위 시간별 서브 세트를 대응하는 각각의 서브 모델에 순차적으로 입력하여, 상기 단위 시간에 따른 개인 데이터와 사용자의 선택 상품 간의 상관 관계를 추론해 입력된 개인 데이터의 사용자가 입력된 서브 모델의 단위 시간에서 상기 쇼핑몰의 판매 가능한 상품군 중에서 선택할 상품군을 예측하도록 상기 서브 모델의 모델 파라미터및 단위 시간별 가중치를 학습하도록 구성되는 것을 특징으로 하는, 쇼핑몰 관리 장치."}
{"patent_id": "10-2023-0009069", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 1항에 있어서, 상기 쇼핑몰 관리 장치는, 사용자 맞춤 상품군에 속하는 상품 중 적어도 하나의 상품에 대한 상품 페이지로 접속할 수 있는 배너 광고 컨텐츠를 생성하도록 구성된 배너 생성부; 및 컨텐츠 구성요소의 위치, 배치 구조를 정의한 배너 광고 템플릿, 쇼핑몰 사이트에 판매 가능한 상품으로 등록된상품의 상품 속성을 구조화한 속성 사전, 상품 이미지의 메인 색상, 및 상품, 배경, 텍스트의 색상 조합을 기록한 색상 테이블을 저장하는 배너 DB(database)를 더 포함하고, 상기 상품 이미지의 메인 색상은 상품 페이지에 출력되는 상품 이미지 내 객체 부분에 나타난 색상 분포에 기초하여 선정된 것을 특징으로 하는, 공개특허 10-2024-0116297-5-쇼핑몰 관리 장치."}
{"patent_id": "10-2023-0009069", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 9항에 있어서, 상기 배너 생성부는, 상기 배너 DB에서 사용자 입력에 따라서 사용자의 맞춤 배너 광고 컨텐츠를 생성하기 위한 배너 광고 템플릿을선택하고, 결정된 사용자의 맞춤 상품군에 대응하는 상품 속성 값을 상기 속성 사전에서 추출하며,선택된 배너 광고 템플릿 상에 배치할 배너 광고 텍스트를 상기 사용자의 맞춤 상품군에 대응한 상품 속성 값에기초하여 생성하고, 선택된 배너 광고 템플릿 상에 배치할 배너 광고 이미지를 생성하며 - 상기 배너 광고 이미지는 상기 사용자의맞춤 상품군에 대응한 상품 속성 값을 가지는 상품의 상품 이미지로부터 추출됨, 그리고 상기 색상 테이블에서 상기 사용자의 맞춤 상품군에 대응한 상품 속성 중 색상 값과 매칭되는 색상 조합을 검색하고, 검색된 색상 조합 내 배경 색상 및 텍스트 색상을 상기 배너 광고 템플릿의 배경 색상 및 상기 배너 광고텍스트 색상으로 적용하도록 구성되는 것을 특징으로 하는, 쇼핑몰 관리 장치."}
{"patent_id": "10-2023-0009069", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 10항에 있어서, 상기 배너 생성부는, 결정된 사용자의 맞춤 상품군에 대응하는 상품 속성 값을 상기 속성 사전에서 추출하기 위해, 결정된 사용자의 맞춤 상품군에 속하는 상품 각각의 상품 속성 값에 기초하여 상기 사용자의 맞춤 상품군의상품 속성 값을 산출하고, 상품의 속성 사전에서 상기 사용자의 맞춤 상품군의 상품 속성 값에 매칭하거나 가장가까운 적어도 하나의 상품 속성 값을 사용자의 맞춤 상품군에 대응하는 상품 속성 값으로 결정하고, 그리고 배너 광고 텍스트를 생성하기 위해, 검색하고, 상기 속성 사전에서 추출된 상품 속성 값에 대응한 상품 속성을서술하는 속성 텍스트를 획득하며, 상기 맞춤 상품군의 상품 속성 값을 가지는 상품의 상품 페이지 내 상품명필드 텍스트를 검색하고, 검색된 상품명 필드 텍스트에서 상기 속성 텍스트를 추출하며, 그리고 추출된 속성 텍스트를 상품명 필드 텍스트 상의 순서에 따라 배치해 배너 광고 텍스트를 생성하도록 구성되는 것을 특징으로하는, 쇼핑몰 관리 장치."}
{"patent_id": "10-2023-0009069", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 8항에 있어서, 상기 배너 생성부는, 배너 광고 텍스트 영역이 배너 광고 이미지 영역을 커버하는 것이 최소화되도록 배너 광고 템플릿 상에서 배너광고 텍스트 또는 배너 광고 이미지의 위치 및 크기 중 적어더 하나를 조정하도록 더 구성되는 것을 특징으로하는, 쇼핑몰 관리 장치."}
{"patent_id": "10-2023-0009069", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 출원의 실시 예들은 쇼핑몰 사이트에 접속한 복수의 사용자의 쇼핑몰 내역을 수집하여 복수의 사용자의 개인 데이터를 생성하도록 구성된 데이터 수집부, 상기 복수의 사용자의 개인 데이터를 이용하여 상기 복수의 사용자 각각에 대한 개인화 모델을 생성하도록 구성된 모델 생성부; 및 상기 복수의 사용자의 개인 데이터를 각각의 개 인화 모델에 입력하여 상기 복수의 사용자의 맞춤 상품군을 각각 결정하도록 구성된 상품 추천부를 포함하는, 쇼 핑몰 관리 장치에 관련된다."}
{"patent_id": "10-2023-0009069", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 출원의 실시 예들은 쇼핑몰 관리에 관한 것으로서, 보다 상세하게는 쇼핑몰 사용자의 개인 데이터에 기반한 사용자 맞춤 상품을 추천하고, 이러한 추천 상품에 대한 배너 광고를 생성해 사용자 맞춤 상품을 효율적으로 제공하는 방법 및 이를 수행하는 온라인 쇼핑몰 관리 시스템에 관한 것이다."}
{"patent_id": "10-2023-0009069", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로, 인터넷 등의 통신망을 이용하여 전자상거래가 수행되는 온라인 쇼핑몰에서 소비자가 구매를 원하는 상품을 진열하고 소개하는 것은 매출 상승을 위한 가장 기본이면서도 중요한 마케팅 기법이다. 이때 주로 사용되는 방법으로, 상품을 추천할 대상 사용자와 구매 이력이 유사한 사용자들을 선별하고 유사 사 용자들은 구매하였는데 추천 대상 사용자가 구매하지 않은 상품을 추천해주는 협업 필터링(Collaborative Filtering)이 있다. 그러나, 인터넷 쇼핑몰에서 관리하는 상품과 고객의 수가 급속히 증가하면서 협업 필터링에 기반한 상품 추천 관리시스템은 입력 데이터의 희박성(Sparsity) 문제와 시스템 확장성(Scalability) 문제에 노 출되고 있다. 최근 빅데이터 분석 기술이 발전하면서 소비자의 구매 이력에 기반하여 해당 소비자가 구매할 가능성이 높은 상 품을 예상하여 추천하려는 시도가 있다. 예를 들어, 뉴럴 네트워크 구조를 가지는 딥러닝 모델을 활용하여 개인 화 상품을 추천하려는 시도가 있다. 온라인 쇼핑몰의 상품은 개인의 취향과 성향, 물품이 활용되는 상황에 있어 매우 많은 요소로 다양하게 정의될 수 있는 복잡한 정보 집합에 해당하므로, 간편하게 개인 데이터를 분석해서 소비자가 원하는 상품을 정확하게 제공할 수 있는 방법에 대한 수요가 있다. 나아가, 분석된 사용자 맞춤 상품을 컴퓨터 디스플레이 또는 스마트폰 디스플레이와 같은 화면을 통해 제공함에 있어 사용자의 관심을 유도할 수 없다면 어렵게 분석한 결과가 상품 구매라는 궁극적 목표를 달성할 수 없는 한 계가 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 특허공개공보 제10-2018-0121466호 (2018.11.07.공개)"}
{"patent_id": "10-2023-0009069", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상술한 문제를 해결하기 위해, 본 출원의 실시 예들은 쇼핑몰 사용자의 개인 데이터에 기반한 사용자 맞춤 상품 을 추천하고, 이러한 추천 상품에 대한 배너 광고를 생성해 사용자 맞춤 상품을 효율적으로 제공하는 방법 및 이를 수행하는 온라인 쇼핑몰 관리 시스템을 제공하고자 한다."}
{"patent_id": "10-2023-0009069", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 출원의 일 측면에 따른 쇼핑몰 관리 장치는 프로세서를 포함한다. 상기 쇼핑몰 관리 장치는 개인화 모델을 이용하여 사용자 맞춤 상품을 결정하기 위해, 쇼핑몰 사이트에 접속한 복수의 사용자의 쇼핑몰 내역을 수집하여 복수의 사용자의 개인 데이터를 생성하도록 구성된 데이터 수집부; 상기 복수의 사용자의 개인 데이터를 이용 하여 상기 복수의 사용자 각각에 대한 개인화 모델을 생성하도록 구성된 모델 생성부; 및 상기 복수의 사용자의 개인 데이터를 각각의 개인화 모델에 입력하여 상기 복수의 사용자의 맞춤 상품군을 각각 결정하도록 구성된 상 품 추천부를 포함할 수 있다. 일 실시 예에서, 상기 데이터 수집부는, 상기 사용자 단말의 접속 내역을 수집하기 위해, 상기 쇼핑몰 사이트에 접속한 사용자 단말에서 사용자 로그인 동작을 수행하고 상기 사용자 단말의 쿠키 데이터를 상기 쇼핑몰 관리 장치로 제공하는 것을 허용하는 경우 상기 사용자 단말의 쿠키 데이터 내 쿠키 아이디에 로그인된 사용자 아이 디를 결합하고 상기 사용자 아이디가 결합된 쿠키 데이터를 상기 사용자의 접속 내역으로 수집할 수 있다. 일 실시 예에서, 상기 데이터 수집부는, 상기 사용자 단말의 쇼핑몰 내역을 수집하기 위해, 상기 쇼핑몰 사이트 에 접속한 사용자 단말에서 사용자 로그인 동작을 수행하지 않고 상기 쇼핑몰 사이트에 대한 상기 사용자 단말 의 쿠키 데이터를 상기 쇼핑몰 관리 장치로 제공하는 것을 허용하지 않는 경우 상기 쇼핑몰 사이트에 대한 상기사용자 단말의 세션 데이터 내 세션 아이디를 사용자 아이디로 설정하고 상기 사용자 단말의 세션 데이터를 상 기 사용자의 쇼핑몰 내역으로 수집하고, 그리고 상기 쇼핑몰 사이트에 접속한 사용자 단말에서 사용자 로그인 동작을 수행하거나 접속 이전에 상기 사용자 단말의 쿠키 데이터가 제공된 것이 확인되는 경우, 상기 사용자 단 말의 사용자 아이디를 검색하여 상기 사용자 아이디에 연관된 상기 사용자의 과거 쇼핑몰 내역을 상기 사용자의 쇼핑몰 내역으로 수집할 수 있다. 일 실시 예에서, 상기 데이터 수집부에서는 사용자의 주문 이벤트 데이터, 사용자의 주문 상품 데이터, 사용자 의 관심 상품 데이터, 및 사용자의 접속 데이터 중 적어도 둘 이상의 데이터가 사용자의 개인 데이터로서 획득 된다. 상기 주문 이벤트 데이터는 사용자의 주문 이벤트 아이디, 사용자 아이디, 주문 채널 정보, 주문 상태 정 보, 주문 일자 정보, 주문 상품 정보, 주문 수량 정보, 주문 금액 정보 중 적어도 일부를 포함한다. 상기 사용 자의 주문 상품 데이터는 상품 아이디, 제공 브랜드, 상품 가격 정보, 상품군 정보, 상품 명칭 정보, 판매 상태 정보, 진열 상태 정보, 출시 일자 정보, 상품 속성 정보 중 적어도 일부를 포함한다. 상기 사용자의 주문 상품 데이터 중 일부가 상기 주문 이벤트 데이터 내 주문 상품 정보로 이용되고, 상기 판매 상태 정보 및 진열 상태 정보는 해당 상품의 유통 결과에 따라 실시간으로 업데이트되는 것이다. 상기 사용자의 관심 상품 데이터는 관 심 상품 아이디, 관심 상품의 리뷰 평점 정보, 관심 상품에 대한 사용자의 상품 클릭 정보, 관심 상품에 대한 사용자의 상품 페이지 체류 시간 중 하나 이상을 포함한다. 상기 관심 상품 아이디는 장바구니에 포함되거나 원 하는 목록(wish list)에 포함된 상품 아이디이다. 상기 사용자의 접속 데이터는 기준 기간 동안의 사용자의 쇼 핑몰 사이트에 대한 접속 빈도, 기준 기간 동안의 사용자의 쇼핑몰 사이트에 대한 최근 접속일 정보, 기준 기간 동안의 사용자의 쇼핑몰 사이트에 대한 접속 지속 시간 정보 중 하나 이상을 포함한다. 일 실시 예에서, 상기 사용자의 접속 데이터는 상기 사용자를 쇼핑몰 사이트에 접속하게 한 유입 채널 정보, 유 입 채널 상세 정보를 더 포함할 수 있다. 상기 유입 채널 정보는 상기 사용자의 쿠키 데이터 내 유입 URL을 분 석하여 산출되며, 상기 사용자의 유입 채널 정보를 더 포함할 경우 각각의 유입 채널별 기준 기간 동안의 사용 자의 쇼핑몰 사이트에 대한 접속 빈도, 각각의 유입 채널별 기준 기간 동안의 사용자의 쇼핑몰 사이트에 대한 최근 접속일 정보, 각각의 유입 채널별 기준 기간 동안의 사용자의 쇼핑몰 사이트에 대한 접속 지속 시간 중 하 나 이상을 더 포함할 수 있다. 일 실시 예에서, 상기 개인화 모델은 입력 레이어, 하나 이상의 은닉 레이어 및 출력 레이어를 포함한 인공신경 망으로 구성될 수 있다. 상기 모델 생성부는, 개인 데이터에 포함된 각각의 항목을 입력 레이어에 입력될 파라 미터로 설정하고, 개인화 모델을 생성할 당시에 상기 쇼핑몰에 등록된 상품군을 출력 레이어에서 출력될 파라미 터로 설정할 수 있다. 일 실시 예에서, 상기 모델 생성부는, 사용자가 선택한 내역이 있는 상품이 속하는 상품군을 가리키는 레이블 데이터를 사용자의 개인 데이터로부터 추출하고, 상기 사용자가 선택한 내역에 기록된 상품 선택 시점을 기준으 로 미리 설정된 기준 기간 동안 수집되었던 사용자의 개인 데이터를 트래이닝 데이터로 추출하며, 동일한 선택 내역에 기초한 레이블 데이터를 상기 트래이닝 데이터에 연관시켜 복수의 선택에 따른 복수의 트래이닝 샘플을 생성하고, 상기 복수의 트래이닝 샘플을 상기 인공신경망에 순차적으로 입력하여, 개인 데이터와 사용자의 선택 상품 간의 상관 관계를 추론해 입력된 개인 데이터의 사용자가 상기 쇼핑몰의 판매 가능한 상품군 중에서 선택 할 상품군을 예측하도록 상기 인공신경망의 모델 파라미터를 학습하도록 구성될 수 있다. 상기 상품 추천부는, 예측 시점을 기준으로 과거의 기준 기간 동안의 사용자의 개인 데이터를 상기 사용자의 개인화 모델에 입력하여 출력된 상품군을 사용자 맞춤 상품군으로 결정할 수 있다. 일 실시 예에서, 상기 데이터 수집부는 상기 사용자가 선택한 내역에 기록된 사용자의 상품 선택 시점을 미리 설정된 복수의 단위 시간으로 분석하도록 더 구성될 수 있다. 상기 개인화 모델은 입력 레이어, 하나 이상의 은닉 레이어 및 출력 레이어를 포함한 인공신경망을 복수의 서브 모델로 포함할 수 있다. 각각의 서브 모델은 대응하는 단위 시간에 상기 사용자가 선택할 상품군을 예측하도록 구성된 것이고, 상기 복수의 서브 모델을 포함한 상기 개인화 모델은 단위 시간별 상품군 예측 결과에 단위 시 간별 가중치를 적용하여 사용자 맞춤 상품군을 결정하도록 구성될 수 있다. 그러면, 상기 모델 생성부는, 상기 사용자가 선택한 내역이 있는 상품이 속하는 상품군을 가리키는 레이블 데이터를 사용자의 개인 데이터로부터 추출하고, 상기 상품 선택 시점을 기준으로 미리 설정된 과거의 기준 기간 동안 수집되었던 사용자의 개인 데이 터를 트래이닝 데이터로 추출하며, 동일한 선택 내역에 기초한 레이블 데이터를 상기 트래이닝 데이터에 연관시 켜 복수의 트래이닝 샘플을 생성하고 - 상기 하나의 선택 내역으로부터 복수의 단위 시간에 대응하는 다중 트래 이닝 샘플(multiple training sample)이 생성되고, 복수의 트래이닝 샘플은 단위 시간으로 서브 세트화됨, 단위시간별 서브 세트를 대응하는 각각의 서브 모델에 순차적으로 입력하여, 상기 단위 시간에 따른 개인 데이터와 사용자의 선택 상품 간의 상관 관계를 추론해 입력된 개인 데이터의 사용자가 입력된 서브 모델의 단위 시간에 서 상기 쇼핑몰의 판매 가능한 상품군 중에서 선택할 상품군을 예측하도록 상기 서브 모델의 모델 파라미터 및 단위 시간별 가중치를 학습하도록 구성된다. 일 실시 예에서, 상기 쇼핑몰 관리 장치는, 사용자 맞춤 상품군에 속하는 상품 중 적어도 하나의 상품에 대한 상품 페이지로 접속할 수 있는 배너 광고 컨텐츠를 생성하도록 구성된 배너 생성부; 및 컨텐츠 구성요소의 위치, 배치 구조를 정의한 배너 광고 템플릿, 쇼핑몰 사이트에 판매 가능한 상품으로 등록된 상품의 상품 속성 을 구조화한 속성 사전, 상품 이미지의 메인 색상, 및 상품, 배경, 텍스트의 색상 조합을 기록한 색상 테이블을 저장하는 배너 DB(database)를 더 포함할 수 있다. 상기 상품 이미지의 메인 색상은 상품 페이지에 출력되는 상 품 이미지 내 객체 부분에 나타난 색상 분포에 기초하여 선정된다. 일 실시 예에서, 상기 배너 생성부는, 상기 배너 DB에서 사용자 입력에 따라서 사용자의 맞춤 배너 광고 컨텐츠 를 생성하기 위한 배너 광고 템플릿을 선택하고, 결정된 사용자의 맞춤 상품군에 대응하는 상품 속성 값을 상기 속성 사전에서 추출하며, 선택된 배너 광고 템플릿 상에 배치할 배너 광고 텍스트를 상기 사용자의 맞춤 상품군 에 대응한 상품 속성 값에 기초하여 생성하고, 선택된 배너 광고 템플릿 상에 배치할 배너 광고 이미지를 생성 하며 - 상기 배너 광고 이미지는 상기 사용자의 맞춤 상품군에 대응한 상품 속성 값을 가지는 상품의 상품 이미 지로부터 추출됨, 그리고 상기 색상 테이블에서 상기 사용자의 맞춤 상품군에 대응한 상품 속성 중 색상 값과 매칭되는 색상 조합을 검색하고, 검색된 색상 조합 내 배경 색상 및 텍스트 색상을 상기 배너 광고 템플릿의 배 경 색상 및 상기 배너 광고 텍스트 색상으로 적용하도록 구성될 수 있다. 일 실시 예에서, 상기 배너 생성부는, 결정된 사용자의 맞춤 상품군에 대응하는 상품 속성 값을 상기 속성 사전 에서 추출하기 위해, 결정된 사용자의 맞춤 상품군에 속하는 상품 각각의 상품 속성 값에 기초하여 상기 사용자 의 맞춤 상품군의 상품 속성 값을 산출하고, 상품의 속성 사전에서 상기 사용자의 맞춤 상품군의 상품 속성 값 에 매칭하거나 가장 가까운 적어도 하나의 상품 속성 값을 사용자의 맞춤 상품군에 대응하는 상품 속성 값으로 결정하고, 그리고 배너 광고 텍스트를 생성하기 위해, 검색하고, 상기 속성 사전에서 추출된 상품 속성 값에 대 응한 상품 속성을 서술하는 속성 텍스트를 획득하며, 상기 맞춤 상품군의 상품 속성 값을 가지는 상품의 상품 페이지 내 상품명 필드 텍스트를 검색하고, 검색된 상품명 필드 텍스트에서 상기 속성 텍스트를 추출하며, 그리 고 추출된 속성 텍스트를 상품명 필드 텍스트 상의 순서에 따라 배치해 배너 광고 텍스트를 생성하도록 구성될 수 있다. 일 실시 예에서, 상기 배너 생성부는, 배너 광고 텍스트 영역이 배너 광고 이미지 영역을 커버하는 것이 최소화 되도록 배너 광고 템플릿 상에서 배너 광고 텍스트 또는 배너 광고 이미지의 위치 및 크기 중 적어더 하나를 조 정하도록 더 구성될 수 있다."}
{"patent_id": "10-2023-0009069", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 출원의 실시 예들에 따르면, 인공신경망 모델을 이용하여 쇼핑몰을 무인으로 정교한 데이터를 통해 신뢰성있 는 정보로 관리할 수 있으며 이를 통해 데이터를 통한 기계적인 반복업무는 줄이고 보다 창의적인 상품소싱과 디자인업무을 수행할 수 있어, 신뢰성 있고 편리한 쇼핑몰 관리 서비스를 제공할 수 있다. 본 발명에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효과들은 아래의 기재로부터 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0009069", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서, 도면을 참조하여 본 출원의 실시 예들에 대하여 상세히 살펴본다. 그러나, 이는 본 개시(disclosure)를 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 개시의 실시 예의 다양한 변경(modification), 균등물(equivalent), 및/또는 대체물(alternative)을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 본 명세서에서, \"가진다,\" \"가질 수 있다,\"\"포함한다,\" 또는 \"포함할 수 있다\" 등의 표현은 해당 특징(예: 수치, 기능, 동작, 단계, 부품, 요소 및/또는 성분 등의 구성요소)의 존재를 가리키며, 추가적인 특징의 존재나 부가를 제외시키는 것이 아니다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수 있다고 이해 되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다 고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 다양한 실시 예에서 사용된 \"제 1\", \"제 2\", \"첫째\" 또는 \"둘째\" 등의 표현들은 다양한 구성요소들을, 순서 및/ 또는 중요도에 상관없이 수식할 수 있고, 해당 구성요소들을 한정하지 않는다. 상기 표현들은 한 구성요소를 다 른 구성요소와 구분하기 위해 사용될 수 있다. 예를 들면, 제1 구성요소와 제2 구성요소는, 순서 또는 중요도와 무관하게, 서로 다른 구성요소를 나타낼 수 있다. 본 명세서에서 사용되는 단수 표현의 구성의 실시 예들은 상기 단수 표현과 관련된 문구들이 이와 명백히 반대 의 의미를 나타내지 않는 한 복수 표현의 구성 들의 실시 예들도 포함한다. 본 명세서에서 사용된 표현 \"~하도록 구성된(또는 설정된)(configured to)\"은 상황에 따라, 예를 들면, \"~에 적 합한(suitable for),\" \"~하는 능력을 가지는(having the capacity to),\" \"~하도록 설계된(designed to),\" \"~하 도록 변경된(adapted to),\" \"~하도록 만들어진(made to),\"또는 \"~를 할 수 있는(capable of)\"과 바꾸어 사용될 수 있다. 용어 \"~하도록 구성(또는 설정)된\"은 하드웨어적으로 \"특별히 설계된(specifically designed to)\"것만 을 반드시 의미하지 않을 수 있다. 대신, 어떤 상황에서는, \"~하도록 구성된 장치\"라는 표현은, 그 장치가 다른 장치 또는 부품들과 함께 \"~할 수 있는\" 것을 의미할 수 있다. 예를 들면, 문구 \"A, B, 및 C를 수행하도록 구성 (또는 설정)된 프로세서\"는 해당 동작을 수행하기 위한 전용 프로세서(예: 임베디드 프로세서), 또는 메모리 장 치에 저장된 하나 이상의 소프트웨어 프로그램들을 실행함으로써, 해당 동작들을 수행할 수 있는 범용 프로세서 (generic-purpose processor)(예: CPU 또는 application processor)를 의미할 수 있다. 도 1은 본 출원의 일 측면에 따른 따른 쇼핑몰 관리 장치를 포함한 온라인 쇼핑몰 관리 시스템의 개략도다. 실시 예들에 따른 온라인 쇼핑몰 관리 시스템은 전적으로 하드웨어이거나, 또는 부분적으로 하드웨어이고 부분 적으로 소프트웨어인 측면을 가질 수 있다. 예컨대, 시스템 또는 장치는 데이터 처리 능력이 구비된 하드웨어 및 이를 구동시키기 위한 운용 소프트웨어를 통칭할 수 있다. 본 명세서에서 \"부(unit)\", \"시스템\" 및 \"장치\" 등의 용어는 하드웨어 및 해당 하드웨어에 의해 구동되는 소프트웨어의 조합을 지칭하는 것으로 의도된다. 예를 들어, 하드웨어는 CPU(Central Processing Unit), GPU(Graphic Processing Unit) 또는 다른 프로세서 (processor)를 포함하는 데이터 처리 기기일 수 있다. 또한, 소프트웨어는 실행중인 프로세스, 객체(object), 실행파일(executable), 실행 스레드(thread of execution), 프로그램(program) 등을 지칭할 수 있다. 도 1을 참조하면, 상기 온라인 쇼핑몰 관리 시스템은 쇼핑몰 관리 장치 및 복수의 사용자 단말을 포함한다. 사용자 단말과 쇼핑몰 관리 장치는 통신 네트워크를 통해 정보를 송수신하여, 쇼핑몰을 효율적으로 관리할 수 있다. 예를 들어, 통신 네트워크는 LAN(local area network), WAN(wide area network), 가상 네트워크, 3G, 4G, 5G와 같은 모바일 네트워크, 원격 통신 등의 유무선 통신망 네트워크일 수 있으나, 이에 제한되진 않는다. 상기 쇼핑몰 관리 장치는 적어도 하나의 쇼핑몰을 관리하도록 구성된, 프로세서, 메모리 및 송수신부를 포 함한 컴퓨팅 장치이다. 상기 쇼핑몰 관리 장치는 서버로 구현될 수도 있으나, 이에 제한되지는 않으며 다 른 컴퓨팅 장치로 구현될 수 있다. 이하, 설명의 명료성을 위해, 상기 쇼핑몰 관리 장치가 서버 형태로 구 현된 실시 예들로 상기 온라인 쇼핑몰 관리 시스템을 보다 상세히 서술한다. 상기 쇼핑몰 관리 장치는 일체형 서버(unitary server)일 수 있거나, 다수의 컴퓨터 또는 다수의 데이터센 터에 걸쳐 있는 분산형 서버로 구현될 수 있다. 본 출원의 다양한 실시 예들에서, 상기 쇼핑몰 관리 장치 는 네트워크 서버로 구현되는 다수의 컴퓨터 시스템 또는 컴퓨터 소프트웨어이다. 여기서, 네트워크 서버란, 사 설 인트라넷 또는 인터넷과 같은 컴퓨터 네트워크를 통해 다른 네트워크 서버와 통신할 수 있는 하위 장치와 연 결되어 작업 수행 요청을 접수하고 그에 대한 작업을 수행하여 수행 결과를 제공하는 컴퓨터 시스템 및 컴퓨터 소프트웨어(네트워크 서버 프로그램)를 의미한다. 그러나 이러한 네트워크 서버 프로그램 이외에도, 네트워크 서버 상에서 동작하는 일련의 응용 프로그램과 경우에 따라서는 내부에 구축되어 있는 각종 데이터베이스를 포 함하는 넓은 개념으로 이해되어야 할 것이다. 상기 쇼핑몰 관리 장치는 네트워크 서버, 웹 서버, 파일 서 버, 슈퍼컴퓨터, 데스크탑 컴퓨터 등과 같은 컴퓨팅 장치들의 임의의 유형 또는 유형들의 조합으로 구현될 수 있다. 이를 위해, 쇼핑몰 관리 장치는 데이터를 처리할 수 있는 적어도 하나의 프로세서, 데이터를 저장하 는 메모리, 데이터를 송/수신하는 통신부를 포함한다. 상기 쇼핑몰 관리 장치는 온라인 쇼핑몰 관리 시스템에 가입한 사용자가 선택할 가능성이 상대적으로 높은 상품군(또는 상품)을 사용자 맞춤 상품군으로 예측하도록 구성된다. 또한, 상기 쇼핑몰 관리 장치는 사용자 단말이 예측된 사용자 맞춤 상품군에 속하는 상품 중 적어도 일부에 대한 정보에 대해서 예측 동작 을 하지 않는 경우 보다 상대적으로 쉽게 접속 가능하도록 구성된다. 본 출원의 다양한 실시 예들에서, 상기 쇼핑몰 관리 장치는 사용자 맞춤 상품에 보다 쉽게 접속하도록 쇼 핑몰 사이트 상에 사용자 맞춤 상품군과 관련된 사용자 맞춤 배너 광고 컨텐츠를 제공하도록 구성된다. 또한, 상기 쇼핑몰 관리 장치는 사용자 맞춤 상품군의 상위 상품군을 소개하는 쇼핑몰 페이지 주소에 접속한 사 용자 단말에게는, 상기 쇼핑몰 페이지 주소에 접속할 경우 사용자 맞춤 상품군이 보다 우선적으로 노출되 도록 구성된 쇼핑몰 페이지 화면을 제공하도록 더 구성될 수 있다. 이러한 장치의 동작에 대해서는 아래의 도 2 등을 참조해 보다 상세히 서술한다. 또한, 쇼핑몰 관리 장치는 하나 이상의 데이터베이스 저장소(이하, DB)를 이용하도록 구성된다. 상기 쇼핑 몰 관리 장치는 사용자 DB, 상품 DB를 이용하도록 구성된다. 또한, 본 출원의 다양한 실시 예들 에서, 상기 쇼핑몰 관리 장치는 배너 DB를 추가로 이용하도록 구성될 수 있다. 각각의 DB(101, 103, 105)에 대해선 아래의 도 3, 도 5 등을 참조해 보다 상세히 서술한다. 이러한 DB(101, 103, 105)는 쇼핑몰 관리 장치 내부에 집적되거나 외부에 DB 서버로 구현되어 쇼핑몰 관리 장치와 연결된다. 일부 실시 예들에서, DB에 저장된 정보는 특정한 데이터 구조에 따라 구조화될 수 있다. 각 DB(101, 103, 105)는 관계형, 컬럼형, 상관형 또는 다른 적절한 데이터베이스일 수 있다. 비록 본 명세서는 특정 타입의 데이터베이스를 기술하거나 도시하지만, 본 명세서는 임의의 적절한 타입의 데이터베이스를 고려한 다. 일부 실시 예들에서, 온라인 쇼핑몰 관리 시스템은 장치 또는 단말을 통해 DB(101, 103, 10 5)에 저장된 정보를 관리, 검색, 변경, 추가 또는 삭제할 수 있게 하는 인터페이스를 제공할 수 있다. 이하, 설명의 명료성을 위해 DB(101, 103, 105)는 쇼핑몰 관리 장치 내부에 집적된 실시 예들로 쇼핑몰 관 리 장치의 동작을 설명하나, 이는 단지 예시적으로 이해되어야 할 것이 통상의 기술자들에게 명백할 것이다. 상기 사용자 단말은 하드웨어, 소프트웨어 또는 임베디드 로직 컴포넌트나 이들의 2 이상의 컴포넌트의 조 합을 포함하고 사용자 단말에 의해 구현되거나 지원되는 적절한 기능을 수행할 수 있는 컴퓨팅 시스템일 수 있다. 상기 사용자 단말은, 예를 들어, 데스크톱 컴퓨터, 랩탑 컴퓨터, 넷북, 태블릿 컴퓨터, e-북 리 더, GPS 장치, 카메라, 개인용 정보 단말기(PDA), 휴대용 전자 장치, 셀룰러 전화, 스마트폰, 기타 컴퓨팅장치, 기타 모바일 장치, 기타 웨어러블 장치, 프로세서, 메모리 및 송수신부를 포함한 다른 적절한 전자 장치 또는 이들의 임의의 적절한 조합과 같은 컴퓨터 시스템일 수 있다. 상기 온라인 쇼핑몰 관리 시스템의 사용자 단말은 개인화 모델을 이용하여 사용자 맞춤 상품을 결정하 는 방법을 수행하도록 프로그래밍된 애플리케이션을 설치한 것으로서, 사용자 유형에 따라 쇼핑객 단말(200_1), 운영자 단말(200_2)로 분류되며, 허용되는 기능이 각각 상이할 수 있다. 쇼핑객 단말(200_1)은 쇼핑몰 사이트에서 상품을 주문하는 쇼핑객의 사용자 단말이다. 상기 쇼핑객 단말 (200_1)을 통해서는 상품 쇼핑, 주문 등의 동작이 허용된다. 운영자 단말(200_2)은 쇼핑몰 관리 장치를 운영하는 시스템 운영자의 사용자 단말이다. 상기 운영자 단말(200_3)을 통해서는 자신의 쇼핑몰 사이트를 마케팅 측면에서 관리해줄 것을 요청한, 쇼핑몰 관리 서비스에 가입한 쇼핑몰 사이트에 대해 사용자 맞춤 상품군을 결정하는 것을 지원하는 동작, 및 온라인 쇼핑몰 관리 시스 템의 전반적인 관리 동작이 허용된다. 상기 쇼핑객 단말(200_1) 및 운영자 단말(200_2)은 반드시 쇼핑객을 위한 기능 및 운영자를 위한 기능만을 독립 적으로 수행하도록 구성된 것으로 이해되지 않는다. 상기 사용자 단말을 상기 쇼핑객 단말(200_1) 및 운영 자 단말(200_2)로 구분한 것은 단지 쇼핑객을 위한 기능 및 운영자를 위한 기능에 대한 설명을 위한 것으로서, 스마트 폰에 동일한 애플리케이션을 설치한 것과 같이 동일한 사용자 단말 상에서 쇼핑객을 위한 기능 및 운영자를 위한 기능 모두를 구현 가능하며, 사용자 단말을 이용하는 사용자에 따라 운영자를 위한 기능 및 쇼핑객을 위한 기능이 선택적으로 허용되도록 구성될 수도 있음이 통상의 기술자들에게 명백할 것이다. 이하, 특별한 언급이 없는 한, 쇼핑객 단말(200_1)을 사용자 단말로 지칭하되, 사용자 단말의 동작에 대해서는 아래의 도 5 등을 참조해 보다 상세히 서술한다. 도 2는 본 출원의 다양한 실시 예들에 따른 쇼핑몰 관리 장치의 블럭도이다. 도 2를 참조하면, 상기 쇼핑몰 관리 장치는 사용자 DB, 상품 DB, 제어부, 데이터 수집부 , 모델 생성부 및 상품 추천부를 포함한다. 본 출원의 다양한 실시 예들에서, 상기 쇼핑몰 관리 장치는 배너 생성부를 더 포함할 수 있다. 제어부는 적어도 하나의 프로세서로 구현되며, 쇼핑몰 관리 장치의 전반적인 동작을 제어한다. 상기 제어부는 사용자 DB, 상품 DB, 제어부, 데이터 수집부, 모델 생성부, 상품 추 천부, 배너 생성부 각각의 동작을 제어할 수 있다. 이를 위해, 제어부는 개인화 모델을 이용하 여 사용자 맞춤 상품을 결정하는 방법을 수행하도록 프로그래밍된 애플리케이션의 관리자 화면을 실행하도록 구 성될 수 있다. 쇼핑몰 관리 장치는 쇼핑몰 사이트에 접속한 사용자 중에서 회원 가입한 사용자에 관련된 정보를 사용자 DB에 저장한다. 회원 가입된 사용자는 사용자 DB에서 다수의 정보 집합인 엔티티 형태로 구현될 수 있다. 사용자 DB는 회원으로 가입한 사용자 각각의 신원정보를 저장한다. 상기 사용자의 신원정보는 복수의 사용 자 단말로부터 각각 제공된다. 상기 신원정보는 사용자의 쇼핑몰 아이디(이하, 사용자 아이디), 사용자 성명, 주소, 전화번호, 및/또는 이메일 정보를 포함한다. 또한, 본 출원의 다양한 실시 예들에서, 상기 쇼핑몰 관리 장치는 사용자의 쇼핑몰 내역 및/또는 개인 데 이터를 사용자의 신원정보 중 적어도 하나와 맵핑하여 사용자 DB에 저장한다. 일부 실시 예들에서, 상기 쇼핑몰 내역, 개인 데이터는 사용자 아이디와 맵핑될 수 있다. 상기 데이터 수집부는 사용자의 쇼핑몰 내역을 획득한다. 쇼핑몰 내역은 사용자 단말이 쇼핑몰 사이 트에 접속하는 동안 사용자의 쇼핑 활동, 주문 활동 등을 기록한 것이다. 예를 들어, 사용자가 선택한 상품에 관련된 정보, 사용자가 수행한 주문에 관련된 정보가 쇼핑몰 내역으로 기록된다. 상기 쇼핑몰 내역은 사용자 단말에 보관되는 쿠키 데이터 및/또는 쇼핑몰 관리 장치에 보관되는 세션 데이터 형태로 획득된다. 상기 쇼핑몰 관리 장치는 사용자 단말에서 보관 중인 쿠키 데이터를 사용자의 쇼핑몰 내역으로 획득 하고 상기 사용자의 쿠키 데이터를 해당 사용자의 적어도 하나의 개인정보에 맵핑하여 사용자 DB에 저장할 수 있다. 쇼핑몰 관리 장치는 접속한 사용자 단말에 세션 아이디를 할당하여 사용자의 세션 데이터를 사용자의 쇼핑몰 내역으로 획득하고 상기 사용자의 세션 데이터를 해당 사용자의 적어도 하나의 개인정보(예컨대, 사용자 아이디)에 맵핑하여 사용자 DB에 저장할 수 있다. 본 출원의 다양한 실시 예들에서, 상기 쇼핑몰 관리 장치에서 데이터 수집부는 사용자 단말의 로그인 여부, 쿠키 데이터의 제공 허용 여부에 기초하여 사용자의 쇼핑몰 내역을 쿠키 데이터 또는 세션 데이터 로 획득하도록 구성된다. 일 실시 예에서, 상기 쇼핑몰 관리 장치는 (예컨대, 데이터 수집부에 의해), 사용자 단말의 쇼핑몰 내역을 수집하기 위해, 상기 쇼핑몰 사이트에 접속한 사용자 단말에서 사용자 로그인 동작을 수행하고 상기 사 용자 단말의 쿠키 데이터를 상기 쇼핑몰 관리 장치로 제공하는 것을 허용하는 경우 쿠키 데이터를 사용자의 쇼 핑몰 내역으로 획득하도록 구성된다. 구체적으로, 상기 쇼핑몰 관리 장치는 상기 쇼핑몰 사이트에 접속한 사용자 단말에서 사용자 로그인 동작을 수행하고 상기 사용자 단말의 쿠키 데이터를 상기 쇼핑몰 관리 장치로 제공하는 것을 허용하는 경우, 상기 사용자 단말의 쿠키 데이터 내 쿠키 아이디에 로그인된 사용자 아이디를 결 합하고 상기 사용자 아이디가 결합된 쿠키 데이터를 상기 사용자의 쇼핑몰 내역으로 수집한다. 여기서 사용자 단말의 쿠키 데이터는 쇼핑몰 사이트에 접속한 동안 생성된 것이다. 다른 일 실시 예에서, 상기 쇼핑몰 관리 장치는, (예컨대, 데이터 수집부에 의해), 사용자 단말의 쇼 핑몰 내역을 수집하기 위해, 상기 쇼핑몰 사이트에 접속한 사용자 단말에서 사용자 로그인 동작을 수행하지 않 고 상기 쇼핑몰 사이트에 대한 상기 사용자 단말의 쿠키 데이터를 상기 쇼핑몰 관리 장치로 제공하는 것을 허용 하지 않는 경우 세션 데이터를 사용자의 쇼핑몰 내역으로 회득하도록 구성된다. 구체적으로, 상기 쇼핑몰 관리 장치는 상기 쇼핑몰 사이트에 대한 상기 사용자 단말의 세션 데이터 내 세션 아이디를 사용자 아이디로 설 정하고 상기 사용자 단말의 세션 데이터를 상기 사용자의 쇼핑몰 내역으로 수집한다. 여기서, 상기 세션 데이터 는 쿠키 데이터 내 상품 클릭 결과에 대응하는 정보를 포함한다. 또한, 상기 쇼핑몰 관리 장치는 상기 쇼핑몰 사이트에 접속한 사용자 단말에서 사용자 로그인 동작을 수행 하거나 접속 이전에 상기 사용자 단말의 쿠키 데이터가 제공된 것이 확인되는 경우, 사용자의 과거 쇼핑몰 내역 을 쇼핑몰 사이트에 실시간 접속 중인 사용자의 현재 쇼핑몰 내역으로 획득하도록 더 구성된다. 이 경우, 상기 쇼핑몰 관리 장치는 상기 사용자 단말의 사용자 아이디를 검색하여 상기 사용자 아이디에 연관된 상기 사 용자의 과거 쇼핑몰 내역을 상기 사용자의 쇼핑몰 내역으로 수집한다. 이와 같이 상기 쇼핑몰 관리 장치는 로그인 상태, 쿠키 데이터의 제공 허용 여부에 따라 다중화된 수집 채 널이 혼합되는, 하이브리드 수집 구조를 가진다. 상기 개인 데이터는 쇼핑몰 내역에 기초하여 생성된 것으로서, 개인화 모델을 생성하는데 이용된다. 상기 쇼핑몰 관리 장치는 사용자의 쇼핑몰 내역으로부터 사용자의 주문 이벤트 데이터, 사용자의 주문 상 품 데이터, 사용자의 관심 상품 데이터, 및 사용자의 접속 데이터 중 적어도 둘 이상의 데이터를 사용자의 개인 데이터로서 생성한다. 이러한 개인 데이터에 대해서는 아래의 도 3, 도 5 를 참조해 보다 상세히 서술한다. 또한, 쇼핑몰 관리 장치는 쇼핑몰 사이트에 접속한 사용자에게 판매 가능한 상품으로 등록된 상품에 관련 된 정보를 상품 DB에 저장한다. 본 출원의 다양한 실시 예들에서, 상기 상품 DB는 상품 관련 정보를 저장한다. 상기 상품 관련 정보는 상 품 아이디, 제공 브랜드, 상품 가격 정보, 상품군 정보, 상품 명칭 정보, 출시 일자 정보, 상품 속성 정보 중 일부 또는 전부의 정보를 포함한다. 상기 상품군 정보는 상위 상품군 정보, 하위 상품군 정보와 같이 계층적으 로 표현될 수 있다. 상기 상품 속성 정보는 상품 스타일, 판매자(예컨대, 쇼핑몰 관리자)가 입력한 추천 소비자, 소재, 형상, 상품 상세 종류(예컨대, 품목), 색상, 패턴, 기타 속성을 포함한다. 상기 속성 항목에 대한 정보는 텍스트 및/또는 숫자로 표현된다. 상기 숫자는 해당 텍스트를 임베딩 처리한 값 또는 해당 텍스트가 가리키는 대상에 대해 미리 설정된 값(예컨대, 색상 코드)일 수 있다. 상기 속성 정보가 텍스트로 표현된 경우, 각각의 속성을 주관적으로 서술하는 텍스트 및/또는 객관적으로 서술 하는 텍스트로 표현될 수 있다. 예를 들어, 소재는 \"시크한 레더\", \"따뜻한 스웨이드\"로 표현될 수 있다. 형상 은 \"모던\"으로 표현될 수 있다. 상세 종류는 \"백\" 또는 \"클래식 데일리 백\"로 표현될 수 있다. 또한, 일부 실시 예들에서, 상기 상품 관련 정보는 판매 상태 정보, 진열 상태 정보를 더 포함할 수 있다. 판매 상태 정보는 특정 기간 동안 판매 수량으로 표현된다. 상기 특정 기간은 일간, 주간, 월간, 또는 년간으로 설정 될 수도 있으나, 이에 제한되진 않는다. 진열 상태 정보는 재고 있음, 재고 없음으로 표현된다. 또한, 일부 실 시 예들에서, 상기 판매 상태 정보, 진열 상태 정보는 해당 상품의 유통 내역(예컨대, 판매, 환불 등)에 따라 실시간으로 업데이트될 수 있다. 이러한 DB(101, 103)에 저장된 정보는 아래에서 설명할 인공신경망 모델의 학습을 위해 모델 생성부에 제 공된다. 학습 완료 이전까지 제공되는 정보는 실제 또는 샘플 정보로 이용될 수 있다. 모델 생성부는 사용자 각각의 개인 데이터를 생성하고, 상기 개인 데이터를 이용하여 사용자 맞춤 상품군 을 결정하기 위한 개인화 모델을 생성하도록 구성된다. 상기 모델 생성부는 각각의 사용자에 대해 개인화 모델을 생성하여 상품 추천부로 제공한다. 상품 추천부는 복수의 사용자 각각의 개인화 모델을 이용하여 사용자 맞춤형 상품군을 결정하도록 구성된 다. 상기 배너 생성부는 사용자 맞춤 상품군에 속하는 상품 중 적어도 하나의 상품에 대한 상품 페이지로 접속 할 수 있는 배너 광고 컨텐츠를 생성한다. 도 3은 도 2에 도시된 데이터 수집부와 모델 생성부의 동작에 대한 상세 구성도이다. 도 3을 참조하면, 데이터 수집부는 사용자의 주문 이벤트 데이터 수집부, 주문 상품 데이터 수집부 , 관심 상품 데이터 수집부, 접속 데이터 수집부를 포함할 수 있다. 각각의 수집부(1121 내 지 1124)로부터 사용자의 개인 데이터가 생성되어 모델 생성부로 공급된다. 주문 이벤트 데이터 수집부는 사용자의 쇼핑몰 내역으로부터 주문 이벤트 데이터를 생성하여 수집한다. 주문 상품 데이터 수집부는 사용자의 쇼핑몰 내역으로부터 주문 상품 데이터를 생성한다. 관심 상품 데이터 수집부는 사용자의 쇼핑몰 내역으로부터 관심 상품 데이터를 생성한다. 접속 데이터 수집부는 사용자의 쇼핑몰 내역으로부터 사용자의 접속 데이터를 생성한다. 전술한 바와 같 이, 모델 생성부는 수집된 개인 데이터를 고려해서 해당 사용자가 선택할 가능성이 높은 상품군을 예측하도록 소정의 머신러닝 알고리즘을 통해 인공신경망 모델을 학습한다. 학습된 인공신경망 모델은 상품 추천부로 제공된다. 도 2, 도 3에 도시된 구성요소(112 내지 118)의 동작에 대해서는 아래의 도 4 등을 참조해 보다 상세히 서술한 다. 도 4는, 본 출원의 다른 일 측면에 따른, 개인화 모델을 이용하여 사용자 맞춤 상품을 결정하는 방법의 흐름도 이다. 도 4의 방법은 쇼핑몰 관리 장치에 의해 수행된다. 도 4를 참조하면, 상기 개인화 모델을 이용하여 사용자 맞춤 상품을 결정하는 방법은 복수의 사용자 각각에 대 해, 사용자의 개인 데이터를 생성하는 단계(S10)를 포함한다. 상기 사용자는 쇼핑몰 사이트에 접속한 사용자로서, 회원 가입한 사용자가 아닐 수 있다. 모델 생성부의 구성요소(1121 내지 1124)에 의해 사용자가 쇼핑몰 사이트에 접속하여 생성되는 쇼핑몰 내 역으로부터 사용자의 개인화 데이터가 생성된다(S10). 전술한 바와 같이, 주문 이벤트 데이터, 주문 상품 데이 터, 관심 상품 데이터, 접속 데이터 중 둘 이상의 데이터가 사용자의 개인 데이터로 생성된다. 상기 주문 이벤트 데이터는 미리 설정된 주문 이벤트 관련 항목 및 그에 대해 쇼핑몰 내역으로 추출된 값을 가 진다. 상기 주문 이벤트 정보는, 예를 들어 사용자의 주문 이벤트 아이디, 주문한 사용자의 사용자 아이디, 주문 채널 정보, 주문 상태 정보, 주문 일자 정보, 주문 상품 정보, 주문 수량 정보, 주문 금액 정보 중 적어도 일부를 포함할 수도 있으나, 이에 제한되진 않는다. 상기 주문 이벤트 아이디는 주문 이벤트를 식별하기 위해 주문 이벤트가 발생 시 할당되는 아이디이다. 상기 주문 채널은 주문 이벤트를 요청한 사용자 단말을 나타내는 것으로서, 예를 들어, 모바일 장치, PC 등으로 표현될 수 있다. 주문 상태는 배송 완료, 취소 완료, 반품 신청, 또는 구매 완료로 표현될 수 있다. 상기 사용자의 주문 상품 데이터 중 일부가 상기 주문 이벤트 데이터 내 주문 상품 정보로 이용된다. 예를 들어, 상기 주문 상품 정보는 상품 아이디일 수도 있으나, 이에 제한되지 않으며, 주문 상품을 가리키는 다양한 정보일 수 있다. 상기 주문 상품 데이터 수집부는 주문 이벤트 데이터 내 주문 상품 정보에 기초하여 상품 DB에서 주 문 상품에 대한 상품 관련 정보를 검색해 사용자의 주문 상품 데이터를 생성한다. 상기 사용자의 주문 상품 데이터는 상품 아이디, 제공 브랜드, 상품 가격 정보, 상품군 정보, 상품 명칭 정보, 판매 상태 정보, 진열 상태 정보, 출시 일자 정보, 상품 속성 정보 중 적어도 일부를 포함할 수 있다. 상기 판 매 상태 정보 및 진열 상태 정보의 값은 해당 상품의 유통 결과에 따라 실시간으로 업데이트된 값이 주문 상품 데이터로 이용된다. 사용자의 관심 상품 데이터는 관심 상품 아이디, 관심 상품의 리뷰 평점 정보, 관심 상품에 대한 사용자의 상품 클릭 정보, 관심 상품에 대한 사용자의 상품 페이지 체류 시간 중 하나 이상을 포함한다. 상기 관심 상품 아이 디는 장바구니에 포함되거나 관심 목록에 포함된 상품 아이디이다. 상기 관심 상품 데이터 수집부는 사용 자 DB에서 사용자가 등록한 장바구니 상품 목록, 원하는 목록(wish list)에 포함된 상품 아이디를 관심 상 품 아이디로 검색하여 상기 관심 상품 데이터를 생성한다. 상기 상품 클릭 정보는 해당 관심 상품을 클릭한 빈 도를 나타낸다. 상품 페이지 체류 시간은 상품 상세 정보를 출력하고 주문 가능한 상품 페이지에 체류한 시간을 나타낸다. 상기 리뷰 평점 정보는 실시간으로 업데이트되는 것이다. 상기 사용자의 접속 데이터는 기준 기간 동안의 사용자의 쇼핑몰 사이트에 대한 접속 빈도, 사용자의 쇼핑몰에 대한 접속 타이밍, 기준 기간 동안의 사용자의 상기 쇼핑몰 사이트에 대한 최근 접속일 정보, 기준 기간 동안의 사용자의 상기 쇼핑몰 사이트에 대한 접속 지속 시간 정보 중 하나 이상을 포함한다. 이러한 접속 빈도, 최근 접속일 정보, 접속 지속 시간은 아래에서 서술할 유입 채널에 관계 없이 사용자의 총 접속 빈도, 가장 최근 접 속일 정보, 총 접속 지속 시간이다. 상기 접속 데이터는 쇼핑몰 전체의 접속 데이터에 국한되지 않는다. 상기 접속 데이터는 개별 상품별 접속 데이터를 포함하는 개념이다. 예를 들어, 상기 접속 데이터는 상품 페이지의 접속 빈도, 접속 타이밍, 기준 기간 등을 포함할 수 있다. 또한, 일부 실시 예들에서, 상기 사용자의 접속 데이터는 상기 사용자를 쇼핑몰 사이트에 접속하게 한 유입 채 널 정보, 유입 채널 상세 정보를 더 포함할 수 있다. 유입 채널 정보는 쇼핑몰 사이트에 사용자를 유입하게 한 유입 채널을 지칭하는 것으로서, 예를 들어 인스타그 램, 구글, 상기 사용자가 쇼핑몰 사이트에 접속하는데 이용된 기타 유입 채널을 나타낸다. 사용자가 인스타그램 에 등록되어 있던 쇼핑몰 사이트의 광고 컨텐츠를 통해 상기 쇼핑몰 사이트에 접속한 경우, 쇼핑몰 시스템은 인스타그램을 가리키는 값을 해당 사용자에 대한 유입 채널 정보로 기록할 수 있다. 상기 유입 채널 정보는 상기 사용자의 유입 URL에 기초하여 획득된다. 구체적으로, 상기 접속 데이터 수집부 는 사용자 개인별 쿠키 데이터에 포함된 상기 쇼핑몰 사이트에 대한 유입 URL 값을 분석해서 상기 유입 채널 정보를 획득한다. 상기 유입 채널 상세 정보는 유입 채널 정보에 나타난 유입 채널에서 사용자의 설정 상태(예컨대, 광고 설정 여 부), 기타 상세 정보를 나타낸다. 또한, 일부 실시 예들에서, 상기 모델 생성부가 접속 데이터로서 상기 유입 채널 정보를 생성하는 경우, 상기 접속 데이터 수집부는 기준 기간 동안의 사용자의 쇼핑몰 사이트에 대한 접속 빈도, 상기 쇼핑몰 사 이트에 대한 최근 접속일 정보, 상기 쇼핑몰 사이트에 대한 접속 지속 시간 정보를 상기 유입 채널별로 분류할 수 있다. 그러면, 상기 접속 데이터 수집부는 유입 채널 전체 및 유입 채널별로 분석해서 유입 채널 전체 에 대한 값과 각 유입 채널별 값의 조합을 이러한 접속 데이터 항목의 각각의 값으로서 분석한다. 따라서, 상기사용자의 접속 데이터는 상기 사용자의 유입 채널 정보를 더 포함할 경우 각각의 유입 채널별 기준 기간 동안의 사용자의 쇼핑몰 사이트에 대한 접속 빈도, 각각의 유입 채널별 기준 기간 동안의 사용자의 쇼핑몰 사이트에 대 한 최근 접속일 정보, 각각의 유입 채널별 기준 기간 동안의 사용자의 쇼핑몰 사이트에 대한 접속 지속 시간 중 하나 이상을 더 포함할 수 있다. 일 예에서, 상기 사용자가 인스타그램과 네이버 사이트를 통해 각각 20번, 총 40번 접속하고 인스타그램, 네이 버 사이트를 통한 접속 지속 시간이 30시간, 10시간 총 40시간이며, 그리고 인스타그램을 통해 상기 쇼핑몰 사 이트에 접속한 사용자의 최근 접속일이 2023.01.09이고 네이버 사이트를 통해 상기 쇼핑몰 사이트에 접속한 사 용자의 최근 접속일이 2022.12.22.이라고 가정해보자. 그러면, 상기 접속 데이터 수집부는 상기 유입 채 널 정보로서 인스타그램을 나타낸 값, 네이버 사이트를 나타낸 값을 획득한다. 또한, 상기 접속 데이터 수집부 는 사용자의 쇼핑몰 사이트에 대한 접속 빈도 및 유입 채널 각각을 통한 접속 빈도를 {40, 20, 20}로 분 석하고, 사용자의 쇼핑몰 사이트에 대한 최근 접속일, 유입 채널 각각을 통한 최근 접속일을 {20230109, 20230109, 20221222}로 분석하며, 사용자의 쇼핑몰 사이트에 대한 접속 지속 시간, 유입 채널 각각을 통한 접속 지속 시간을 {40, 30, 10}으로 분석할 수 있다. 이와 같이 유입 채널에 대한 보다 상세한 정보를 포함한 개인 데이터가 모델 학습에 이용되면, 학습된 개인화 모델은 유입 채널에 따른 사용자 맞춤 상품군을 보다 정확하게 예측할 수 있다. 이러한 유입 채널과 관련된 정보는 사용자의 쿠키 데이터 내 쿠키 아이디를 기반으로 사용자 개인별로 분석될 수 있다. 상기 기준 기간은 미리 설정된 기간으로서, 예를 들어 1주일일 수도 있으나, 이에 제한되진 않는다. 상기 기준 기간은 아래의 인공신경망 모델의 하이퍼 파라미터로 기능한다. 이러한 데이터는 사용자 DB, 상품 DB에 저장된 정보가 검색되어 생성된 것일 수 있다. 상기 도 4의 방법은, (예컨대, 모델 생성부에 의해) 사용자의 개인 데이터를 이용하여 개인화 모델을 생성 하는 단계(S20)를 포함한다. 상기 개인화 모델은 인공신경망 구조를 가진다. 상기 단계(S20)에서 상기 모델 생성부는 수집된 개인 데이터를 고려해서 해당 사용자가 선택할 가능성이 높은 상품군을 예측하기 위해 개인화 모델이 개인 데이터와 상품군 간의 상관 관계를 추론하도록 소정의 머신러 닝 알고리즘을 통해 개인화 모델을 학습한다. 머신 러닝(machine learning)은 인공지능의 한 분야로, 컴퓨터에 명시적인 프로그램 없이 배울 수 있는 능력을 부여하는 연구 분야이다. 구체적으로 머신 러닝은, 경험적 데이터를 기반으로 학습을 하고 예측을 수행하고 스 스로의 성능을 향상시키는 시스템과 이를 위한 알고리즘을 연구하고 구축하는 기술이라 할 수 있다. 머신 러닝 의 알고리즘들은 엄격하게 정해진 정적인 프로그램 명령들을 수행하는 것이라기보다, 입력 데이터를 기반으로 예측이나 결정을 이끌어내기 위해 특정한 모델을 구축하는 방식을 취한다 인공신경망(ANN: Artificial Neural Network)은 시냅스의 결합으로 네트워크를 형성한 인공 뉴런(노드)들로 구 성되는, 모델 네트워크 구조를 가진다. 인공신경망을 구성하는 구조는, 예를 들어 DNN(Deep Neural Network), RNN(Recurrent Neural Network), BRDNN(Bidirectional Recurrent Deep Neural Network), MLP(Multilayer Perceptron), CNN(Convolutional Neural Network) 또는 기타 NN(neural network) 구조일 수도 있으나, 이에 제한되진 않는다. 인공신경망 모델은 상기 인공신경망 구조를 기반으로 머신러닝에서 사용되는 모델로서, 시냅스의 결합으로 네트 워크를 형성한 인공 뉴런(노드)들로 구성되는, 문제 해결 능력을 가지는 모델 전반을 의미할 수 있다. 인공신경 망 모델은 다른 레이어의 뉴런들 사이의 연결 패턴, 모델 파라미터를 갱신하는 학습 과정, 출력값을 생성하는 활성화 함수(Activation Function)에 의해 정의될 수 있다. 도 5는, 본 출원의 다양한 실시 예들에 따른, 인공신경망 모델의 네트워크 구조도이다. 도 5를 참조하면, 인공신경망은 입력층(Input Layer), 출력층(Output Layer), 그리고 선택적으로 하나 이상의 은닉층(Hidden Layer)를 포함할 수 있다. 각 층은 하나 이상의 뉴런을 포함하고, 인공신경망은 뉴런과 뉴런을 연결하는 시냅스를 포함할 수 있다. 인공신경망에서 각 뉴런은 시냅스를 통해 입력되는 입력 신호들, 가중치, 편향에 대한 활성 함수의 함수값을 출력할 수 있다. 모델 파라미터는 학습을 통해 결정되는 파라미터를 의미하며, 시냅스 연결의 가중치(weights)와 뉴런의 편향 (bais) 등이 포함된다. 그리고, 하이퍼파라미터는 머신러닝 알고리즘에서 학습 전에 설정되어야 하는 파라미터 를 의미하며, 학습률(Learning Rate), 반복 횟수, 미니 배치 크기, 초기화 함수 등이 포함된다. 인공신경망의 학습의 목적은 손실 함수를 최소화하는 모델 파라미터를 결정하는 것으로 볼 수 있다. 손실 함수 는 인공신경망의 학습 과정에서 최적의 모델 파라미터를 결정하기 위한 지표로 이용될 수 있다. 머신러닝은 학습 방식에 따라 지도 학습(Supervised Learning), 비지도 학습(Unsupervised Learning), 강화 학 습(Reinforcement Learning)으로 분류할 수 있다. 지도 학습은 학습 데이터에 대한 레이블(label)이 주어진 상태에서 인공신경망을 학습시키는 방법을 의미하며, 레이블이란 학습 데이터가 인공신경망에 입력되는 경우 인공신경망이 추론해 내야 하는 정답(또는 결과 값)을 의미할 수 있다. 비지도 학습은 학습 데이터에 대한 레이블이 주어지지 않는 상태에서 인공신경망을 학습시키는 방법을 의미할 수 있다. 강화 학습은 어떤 환경 안에서 정의된 에이전트가 각 상태에서 누적 보상을 최대화하는 행동 혹은 행동 순서를 선택하도록 학습시키는 학습 방법을 의미할 수 있다. 손실 함수는 인공 신경망의 학습 과정에서 최적의 모델 파라미터를 결정하기 위한 지표(기준)로 이용될 수 있다. 인공 신경망에서 학습은 손실 함수를 줄이기 위하여 모델 파라미터들을 조작하는 과정을 의미하며, 학습 의 목적은 손실 함수를 최소화하는 모델 파라미터를 결정하는 것으로 볼 수 있다. 손실 함수는 주로 평균 제곱 오차(MSE: Mean Squared Error) 또는 교차 엔트로피 오차(CEE, Cross Entropy Error)를 사용할 수 있으며, 본 발명이 이에 한정되지는 않는다. 교차 엔트로피 오차는 정답 레이블이 원 핫 인코딩(one-hot encoding)된 경우에 사용될 수 있다. 원 핫 인코딩 은 정답에 해당하는 뉴런에 대하여만 정답 레이블 값을 1로, 정답이 아닌 뉴런은 정답 레이블 값이 0으로 설정 하는 인코딩 방법이다. 머신 러닝 또는 딥 러닝에서는 손실 함수를 최소화하기 위하여 학습 최적화 알고리즘을 이용할 수 있으며, 학습 최적화 알고리즘에는 경사 하강법(GD: Gradient Descent), 확률적 경사 하강법(SGD: Stochastic Gradient Descent), 모멘텀(Momentum), NAG(Nesterov Accelerate Gradient), Adagrad, AdaDelta, RMSProp, Adam, Nadam 등이 있다. 경사 하강법은 현재 상태에서 손실 함수의 기울기를 고려하여 손실 함수값을 줄이는 방향으로 모델 파라미터를 조정하는 기법이다. 경사 하강법은 손실 함수를 각 모델 파라미터들로 편미분하여 기울기를 획득하고, 모델 파 라미터들을 획득한 기울기 방향으로 학습률만큼 변경하여 갱신할 수 있다. 모델 파라미터를 조정하는 방향은 스 텝(step) 방향, 조정하는 크기는 스텝 사이즈(size)라고 칭한다. 이때, 스텝 사이즈는 학습률을 의미할 수 있다. 확률적 경사 하강법은 학습 데이터를 미니 배치로 나누고, 각 미니 배치마다 경사 하강법을 수행하여 경사 하강 의 빈도를 높인 기법이다. Adagrad, AdaDelta 및 RMSProp는 SGD(Stochastic Gradient Descent)에서 스텝 사이즈를 조절하여 최적화 정확 도를 높이는 기법이다. Adam은 모멘텀과 RMSProp를 조합하여 스텝 사이즈와 스텝 방향을 조절하여 최적화 정확도를 높이는 기법이다. Nadam은 NAG(Nesterov accelerated gradient)와 RMSProp를 조합하여 스텝 사이즈와 스텝 방향을 조절하여 최적 화 정확도를 높이는 기법이다. 인공신경망 중에서 복수의 은닉층을 포함하는 심층 신경망(DNN: Deep Neural Network)으로 구현되는 머신러닝을 딥러닝(심층 학습, Deep Learning)이라 부르기도 하며, 딥러닝은 머신러닝의 일부이다. 이하에서, 머신러닝은 딥러닝을 포함하는 의미로 사용될 수 있다. 도 5에 도시된 것처럼, 모델 생성부는 일 실시예에 따라 머신러닝 알고리즘 중 딥러닝 알고리즘을 이용하 여 인공신경망 모델을 학습시킬 수 있고, 일 실시예에 따른 인공신경망 모델은 입력 레이어, 하나 이상의 은닉 레이어 및 출력 레이어를 포함하는 신경망으로 구성될 수 있다. 모델 생성부는 개인 데이터에 포함된 각각의 항목을 입력 레이어에 입력될 파라미터로 설정하고, 개인화 모델을 생성할 당시에 상기 쇼핑몰 사이트에 등록된 상품군을 출력 레이어에서 출력될 파라미터로 설정한다. 예 를 들어, 상기 입력 레이어는 개인화 데이터의 주문 이벤트 데이터, 주문 상품 데이터, 접속 데이터 내 항목들을 입력 레이어의 파라미터로 설정할 수 있다. 인공신경망 모델에서 등록된 상품군 중 사용자가 선택할 가능성이 상대적으로 높은 적어도 일부의 상품군이 출 력되면, 출력된 상품군은 사용자 맞춤 상품군으로 취급된다. 하나 이상의 은닉층은 입력 레이어의 파라미터를 연산 처리하여 쇼핑몰 사이트에 등록된 각각의 상품군에 대해 사용자가 선택할 확률을 산출한다. 또한, 일부 실시 예들에서, 상기 출력 레이어는 임계 확률 보다 높은 확률을 가지는 상품군을 사용자 맞춤 상품군으로 출력하도록 구성될 수 있다. 상기 임계 확률 값은, 예를 들어 50% 이 상일 수도 있으나, 이에 제한되진 않으며, 50% 보다 높은 확륙 값(예컨대, 70%, 80%, 또는 90%)일 수 있다. 모델 생성부는 트래이닝 데이터 세트를 이용하여 상기 인공신경망 모델을 학습한다. 상기 트래이닝 데이터 세트는 복수의 트래이닝 샘플로 이루어진다. 본 출원의 다양한 실시 예들에서, 각각의 트래이닝 샘플은 상품 선택 결과에 기초하여 형성된다. 각각의 트래이 닝 샘플은 트래이닝 데이터, 및 레이블 데이터를 각각 포함한다. 상기 레이블 데이터는 사용자의 주문 상품을 가리키는 것으로서, 예를 들어, 주문 상품 아이디일 수 있다. 상기 트래이닝 데이터는 사용자의 주문 당시의 개 인 데이터이다. 일부 실시 예들에서, 상기 모델 생성부는, 상기 트래이닝 데이터 세트를 생성하기 위해, 사용자가 선택한 내역이 있는 상품이 속하는 상품군을 가리키는 레이블 데이터를 사용자의 개인 데이터로부터 추출하고, 그리고 상기 사용자가 선택한 내역에 기록된 상품 선택 시점으로부터 과거의 기준 기간 동안 수집되었던 사용자의 개인 데이터를 트래이닝 데이터로 추출하며, 그리고 동일한 선택 내역에 기초한 레이블 데이터를 상기 트래이닝 데이 터에 연관시켜 트래이닝 샘플을 생성하도록 구성될 수 있다. 상기 일부 실시 예들에서, 이 경우, 트래이닝 샘플의 수는 선택 결과만큼 생성될 수 있다. 예를 들어, 사용자 단말이 제1 상품을 선 택한 내역이 있으면 제1 트래이닝 샘플을 형성하고, 사용자 단말이 제2 상품을 선택한 내역이 있으면 제2 트래이닝 샘플을 형성한다. 여기서, 사용자가 선택한 내역에 기록된 상품은 사용자의 쇼핑몰 내역으로부터 검색된 것으로서, 상품 페이지 체류 시간이 0이 아닌 양수를 가지는 상품이다. 일부 실시 예들에서, 트래이닝 데이터의 시간 범위를 정의하는 미리 설정된 시간은 상품 클릭 빈도가 산출되는 기간과 동일할 수 있다. 예를 들어, 상기 미리 설정된 시간은 7일일 수도 있으나, 이에 제한되진 않는다. 제1 선택 시점으로부터 과거 7일 동안의 개인 데이터가 트래이닝 데이터로 이용되고, 상기 제1 선택 시점에서 선택된 상품은 상기 트래이닝 데이터에 연관되어 레이블 데이터로 이용된다. 7일 이내 2번 이상의 선택이 있는 경우 생성된 트래이닝 데이터는 부분적으로 동일한 데이터를 공유한다. 예를 들어, 12월 7일에 상품 A를 선택하고 8일에 상품 B를 선택하면, 상품 B의 선택에 따라 생성된 트래이닝 데이터 는 상품 A의 선택에 따라 생성된 트레이닝 데이터 중 6일 동안의 개인 데이터를 공유한다. 이와 같이 생성된 트래이닝 데이터 세트는 모델 생성부에 의해 상기 인공신경망 모델이 개인 데이터와 상 품군 간의 상관 관계를 추론하여 해당 사용자가 선택할 가능성이 높은 상품군을 예측하도록 상기 인공신경망 모 델을 학습하는데 이용된다. 구체적으로, 복수의 트래이닝 샘플을 순차적으로 입력하는 동안, 트래이닝 데이터를 상기 인공신경망 모델의 입 력 레이어에 입력하여 상기 쇼핑몰에서 판매 가능한 상품군 각각에 대해 사용자가 선택할 확률을 산출하고 산출 된 확률에 따라서 선택할 것으로 예측된 상품군과 실제로 선택된 상품군, 즉 레이블 데이터 간의 오차를 산출한 뒤에, 상기 오차가 감소하도록 인공신경망 모델의 모델 파라미터를 갱신한다. 이러한 학습 과정이 진행되면 인 공신경망 모델을 구성하는 뉴런 간의 가중치나 및 뉴런의 편향은 손실 함수를 최소화하는 방향으로 갱신됨에 따 라, 인공신경망 모델 내 은닉층 간의 연결 정보(ex. 가중치, 편향)에는 개인 데이터로부터 선택할 것으로 예측 되는 사용자 맞춤 상품군을 도출하도록 하는 상관 관계가 반영되게 된다. 예를 들어, 상기 트래이닝 데이터로 이용된 샘플 개인 데이터가 유입 채널 정보, 상기 유입 채널 정보가 가리키 는 유입 채널을 통해 상기 사용자가 접속한 접속 빈도, 최근 접속일 정보, 접속 지속 시간을 가짐으로써 유입 채널과 관련된 다양한 정보를 고려해서 사용자 맞춤 상품군을 예측하도록 학습된 상기 인공신경망 모델은 예측 대상 사용자의 개인 데이터가 입력되면, 어떤 유입 채널로 쇼핑몰에 접속했는지, 최근 접속일이 언제인지, 접속 지속 시간이 얼마 동안인지에 따라서 동일한 예측 대상 사용자임에도 불구하고 서로 다른 상품군을 사용자 맞춤상품군으로 예측할 수 있다. 전술한 개인화 모델에서는 접속 타이밍이 입력 레이어의 파라미터로 이용된다. 다만, 사람들은 쇼핑몰의 접속 타이밍이 집중될 수 있다. 따라서, 타임 라인 전체의 관접에서 접속 데이터의 분포가 넓어 경향성이 뚜렷하지 않은 사용자의 경우라도 특정 시간대에는 데이터의 분포가 밀집되어 보다 뚜렷한 경향성을 도출할 수 있어, 입 력 레이어의 파라미터로 이용하는 것 보다는 하이퍼 파라미터로 이용하는 것이 추천의 정확성을 향상시키는데 유리할 수 있다. 상기 개인화 모델은 예측 동작을 수행하는 시점을 고려하여 보다 정확하게 사용자 맞춤 상품군을 예측하도록 학 습될 수 있다. 다른 일부 실시들 예에서, 상기 개인화 모델은 입력 레이어, 하나 이상의 은닉 레이어 및 출력 레이어를 포함한 인공신경망을 서브 모델로 포함한다. 상기 개인화 모델은 복수의 서브 모델을 가진다. 각각의 서브 모델은 상품 선택 시간을 구성하는 단위 시간에 대응한다. 상기 서브 모델은 해당 단위 시간에서 상기 사용자가 선택할 상품 군을 예측하도록 학습된다. 즉, 단위 시간을 통해 접속 타이밍이 서브 모델의 하이퍼 파라미터로 설정된다. 상기 단위 시간은 하나의 시간 표현을 구성하는 단위로서, 년, 월, 일, 요일, 시, 분, 초, 또는 사용자가 설정 한 시간대를 나타낸다. 예를 들어, 상기 복수의 서브 그룹은 월에 대응한 서브 모델, 일에 대응한 서브 모델, 요일에 대응한 서브 모델, 시에 대응한 서브 모델, 시간대에 대응한 서브 모델 및/또는 분에 대응한 서브 모델 로 이루어질 수 있다. 상기 단위 시간에 대응한 서브 모델을 학습하기 위해, 모델 생성부는 사용자의 과거 쇼핑몰 내역에서 상품 선택 시점을 전술한 예시 중 둘 이상의 단위 시간으로 분석한다. 일 예에서, 상기 모델 생성부는 요일과 시간대로 상품 선택 시점을 분석할 수 있다. 또한, 상기 사용자가 선택한 내역에 기록된 상품 선택 시점을 미리 설정된 복수의 단위 시간으로 분석한 이후에, 상기 모델 생성부는 상기 사용자가 선택한 내역이 있는 상품이 속하는 상품군을 가리키는 레이블 데이터를 사용자의 개인 데이터로부터 추출하며, 상기 상품 선택 시점을 미리 설정된 과거의 기준 기간 동안 수 집되었던 사용자의 개인 데이터를 트래이닝 데이터로 추출하고, 그리고 동일한 선택 내역에 기초한 레이블 데이 터를 상기 트래이닝 데이터에 연관시켜 복수의 트래이닝 샘플을 생성한다. 복수의 상품 선택에 따라서 복수의 트래이닝 샘플이 형성된다. 트래이닝 샘플은 선택 결과 및 분석되는 단위 시 간를 곱한 수를 최대 범위로 생성된다. 즉, 복수의 트래이닝 샘플은 단위 시간별로 서브 세트화되고, 상기 단위 시간별 서브 세트 각각은 단위 시간을 가리키는 값, 및 개인 데이터를 가진다. 상기 하나의 선택 내역으로부터 복수의 단위 시간에 대응하는 다중 트래이닝 샘플(multiple training sample)이 생성되기 때문이다. 예를 들어, 사용자 단말이 월요일 오전에 제1 상품을 선택한 내역이 있으면 월요일에 연관된 제1-1 트래이닝 샘플, 오 전 시간대에 연관된 제1-2 트래이닝 샘플을 형성하고, 사용자 단말이 화요일 오후에 제2 상품을 선택한 내 역이 있으면 화요일에 연관된 제2-1 트래이닝 샘플, 오후 시간대에 연관된 제2-2 트래이닝 샘플을 형성한다. 이러한 복수의 트래이닝 샘플은 트래이닝 데이터 세트로 이용된다. 상기 모델 생성부는 단위 시간별 서브 세트를 대응하는 각각의 서브 모델에 순차적으로 입력하여, 개인 데이터와 단위 시간의 조합과 사용자의 선택 상품 간의 상관 관계를 추론해 입력된 서브 모델의 단위 시간에서 입력된 개인 데이터의 사용자가 상기 쇼핑몰 의 판매 가능한 상품군 중에서 선택할 상품군을 예측하도록 상기 서브 모델의 모델 파라미터, 및 단위 시간별 가중치를 학습할 수 있다. 이렇게 학습된 서브 모델은 단위 시간에서 사용자가 상품군을 선택할 확률을 산출할 수 있다. 상기 일 예에서, 요일에 대응한 서브 모델은, 입력되는 개인 데이터 내 요일 값이 월요일이라면 월요일에 사용자가 상품군을 선 택할 확률을 산출하고 그리고 입력되는 개인 데이터 내 요일 값이 화요일이라면 화요일에 사용자가 상품군을 선 택할 확률을 산출하도록 학습된다. 또한, 시간대에 대응한 서브 모델은 입력되는 개인 데이터 내 시간대가 제1 시간대(예컨대, 오전 9시- 정오 12시)라면 상기 제1 시간 대에 사용자가 상품군을 선택할 확률을 산출하고 그리 고 입력되는 개인 데이터 내 시간대 값이 제2 시간대(예컨대, 정오 12시-오후6시)라면 상기 제2 시간대에 사용 자가 상품군을 선택할 확률을 산출하도록 학습된다. 상기 개인화 모델은 포함된 서브 모델별로 산출되는, 단위 시간에서 사용자가 상품군을 선택할 확률에 단위 시 간별 가중치를 적용한 결과 중에서 가장 높은 상품군을 사용자 맞춤 상품군으로 결정할 수 있다. 상기 단위 시간별 가중치 또한 학습 과정에서 학습되는 모델 파라미터이다. 추가적으로, 만약 특정 단위 시간에 쇼핑몰 사이트 접속, 상품 선택이 전혀 없는 경우 해당 단위 시간에 대한 트레이닝 데이터 세트의 서브 세트는 형성되지 않을 수 있기 때문에, 상기 특정 단위 시간에 대응한 서브 모델 은 학습되지 않을 수 있다. 그러면, 상기 시스템은, 학습 완료 이후에 특정 단위 시간 대에 사용자가 쇼핑몰 사이트에 접속하여 상기 사용자에 대한 예측이 필요할 경우, 상기 접속 타이밍이 입력 레이어의 파라미터로 설 정된 일부 실시 예들에 따른 예측 모델을 이용하여 상기 쇼핑몰에 대한 추천 상품군을 제공하도록 더 구성될 수 있다. 즉, 시스템은 실시 예드에 따라서, 접속 타이밍이 입력 레이어의 파라미터로 설정된 단일 예측 모델 및 접속 타이밍이 모델의 하이퍼 파라미터로 설정된 서브 모델 세트를 구비한 뒤에, 접속 타이밍에 따른 예측 시간에 대해 미리 학습된 서브 모델이 존재하면 상기 서브 모델을 이용하여 상품군을 추천하고 예측 시간에 대 해 서브 모델이 학습되지 않았으면 상기 단일 예측 모델을 이용하여 상품군을 추천하는, 선택적 구조를 갖도록 더 구성될 수 있다. 한편, 도 5의 학습에 사용된 파라미터 수나 은닉 레이어의 수는 예시일 뿐으로 이에 한정되는 것이 아니며, 딥 러닝 알고리즘 외에 decision tree(DT), k-nearest neighbor(KNN), logistic regression(LR), random forest(RF), support vector machine(SVM) 및 lasso 등 사용할 파라미터의 종류나 수에 따라 적합한 알고리즘 을 선택하여 사용할 수 있다. 다시 도 4를 참조하면, 상기 도 4의 방법은, (예컨대, 상품 추천부에 의해) 사용자의 맞춤 상품군을 결정 하는 단계(S30)를 포함한다. 상품 추천부는, 상기 복수의 사용자의 개인 데이터를 각각의 개인화 모델에 입력하여 상기 복수의 사용자 의 맞춤 상품군을 각각 결정하도록 구성된다. 선택 결과만큼의 트래이닝 샘플이 생성되는 실시 예들에 따라서 개인화 모델이 학습되면, 상기 상품 추천부 는 예측 시점을 기준으로 과거의 기준 기간 동안의 사용자의 개인 데이터를 획득하고 상기 예측 시점을 기 준으로 과거의 기준 기간 동안의 사용자의 개인 데이터를 획득하며, 획득된 사용자의 개인 데이터를 개인화 모 델에 입력하여 사용자가 선택할 것으로 예측되는 상품군을 출력한다. 상기 상품 추천부는 출력된 상품군을 사용자 맞춤 상품군으로 결정한다. 즉, 시스템은 사용자의 실시간 접속 타이밍에 반응하여 입력 데이터의 시 간 범위를 변경해 입력 데이터를 구축할 수 있다. 일부 실시 예들에서, 상기 상품 추천부는 사용자의 로그인 완료에 반응하여 사용자 맞춤 상품군을 결정하 는 동작을 개시한다. 상기 온라인 쇼핑몰 관리 시스템에서 사용자 단말이 로그인 화면에 접속하여 로그 인을 완료하면 다른 화면(예컨대, 쇼핑몰 사이트의 기본 페이지 화면)으로 전환될 수 있다. 그러면, 상기 쇼핑 몰 관리 장치는 로그인 완료 시점으로부터 과거의 기준 기간 동안의 사용자의 개인 데이터를 상기 사용자 의 개인화 모델에 입력하여 출력된 상품군을 사용자 맞춤 상품군을 결정하고, 전환되는 상기 다른 화면에는 사 용자 맞춤 상품군의 결정 결과를 반영한 화면으로 재-구성되어 제공될 수 있다. 상기 온라인 쇼핑몰 관리 시스템에서 사용자 단말이 로그인 화면에 접속하여 로그인을 완료하면 다른 화면으로 전환되기 전에 사용자 맞춤 상품군이 출력되지 않을 수도 있다. 그러면, 상기 시스템은 사용자가 로그인 이후 쇼핑몰 사이트 내에서 접속하다가 맞춤 상품군이 출력된 뒤에 다시 상기 다른 화면으로 전환될 경 우, 상기 사용자 맞춤 상품군의 결정 결과를 반영하여 제공할 수 있다. 선택 결과와 미리 설정된 시간 단위의 곱만큼의 트래이닝 샘플이 생성되는 실시 예들에 따라서 개인화 모델이 학습되면, 상기 상품 추천부는 예측 시점을 복수의 시간 단위로 분석하고, 예측 시점을 기준으로 과거의 기준 기간 동안의 사용자의 개인 데이터를 획득하며, 예측 시점을 분석한 시간 단위에 대응하는 서브 모델에 상 기 사용자의 개인 데이터를 각각 입력한다. 그러면, 상기 개인화 모델은 시간 단위별로 상품군을 선택할 확률을 산출하고, 산출된 확률에 시간 단위별 가중치를 적용하며, 적용 결과가 가장 높은 값을 가지는 상품군을 출력한 다. 상기 상품 추천부는 출력된 상품군을 사용자 맞춤 상품군으로 결정한다. 이와 같이 결정된 사용자 맞춤 상품군은 사용자의 상품 선택을 유도하는데 이용된다. 또한, 도 4의 방법은 (예컨대, 배너 생성부에 의해) 사용자의 맞춤 상품군에 기초해 사용자의 맞춤 배너 광고 컨텐츠를 생성하는 단계(S40) 및 사용자 단말의 화면에서 사용자의 맞춤 배너 광고 컨텐츠가 출력되 도록 사용자의 맞춤 배너 광고 컨텐츠를 상기 사용자 단말로 전송하는 단계(S50)를 포함한다. 상기 배너 생성부는 배너 DB에 미리 저장된 정보를 이용하여 배너 광고 컨텐츠를 생성한다. 상기 배너 DB는 배너 광고 템플릿, 상품의 속성 사전, 상품 이미지의 메인 색상, 및 색상 테이블을 저장한 다. 배너 광고 템플릿은 사용자의 맞춤 배너 광고 컨텐츠를 생성하는데 이용할 수 있는 템플릿이다. 상기 배너 광고 템플릿은 배너 광고 객체, 텍스트와 같은 컨텐츠 구성요소의 위치, 배치 구조를 정의한 템플릿이다. 예를 들어, 배너 광고 템플릿은 특정 위치에 텍스트가 배치되어야 하는지 또는 객체가 배치되어야 하는지 정의한다. 상기 컨텐츠 구성요소로서 객체는 상품 자체로서 사물, 또는 상품을 장착한 모델(예컨대, 사람)이다. 다양한 사이즈 의 배너 광고 템플릿이 배너 DB에 저장된다. 상기 제어부는 상기 단계(S40) 이전에 상기 쇼핑몰에 판매 가능한 등록된 상품의 상품 속성 정보에 기초하 여 상품의 속성 사전을 생성하고, 그리고 상기 쇼핑몰에 등록된 복수의 상품 각각의 상품 이미지 내 객체 부분 에 나타난 색상 분포에 기초하여 상품 이미지의 메인 색상을 선정하도록 구성된다. 생성된 속성 사전은 배너 DB에 저장된다. 상품의 속성 사전은 쇼핑몰에 등록된 상품의 상품 속성 항목 정보로부터 동일한 상품 속성 항목을 가지는 상품 속성을 서술하는 속성 값을 서로 연관시킨 구조화 결과이다. 소재 항목은 다양한 상품들이 가지는 다양한 소재 값, 예를 들어 {면, 벨벳, 기타 소재 정보}와 같은 형태로 구조화되고, 색상 항목은 다양한 상품들이 가지는 다 양한 색상 값, 예를 들어 {화이트, 블루, 기타 색상}와 같은 형태로 구조화되고, 품목 항목은 다양한 상품들이 가지는 다양한 품목 값, 예를 들어 {드레스, 백, 기타 품목}와 같은 형태로 구조화될 수 있다. 상기 상품 속성 정보를 서술하는 값은 해당 상품 속성을 서술하는 텍스트에 대응한다. 일부 실시 예들에서, 상 기 상품 속성 값은 해당 텍스트를 임베딩한 결과(예컨대, 임베딩 벡터) 또는 해당 속성에 대한 사전 정의 값(예 컨대, 색상 코드)로 표현된다. 상기 상품 이미지는 상품 페이지 상에 출력되는 이미지이다. 하나의 상품 페이지에 다수의 상품 이미지가 출력 될 경우, 하나의 상품에 대해 다수의 상품 이미지의 메인 색상이 선정된다. 상기 제어부는 미리 저장된 이미지 분석을 위한 인공신경망 모델을 이용하여 상품 이미지의 색상 분포를 산출하여 상품 이미지에서 메인 색상을 선정한다. 상기 색상 분포는 상품 이미지의 픽셀별 색상의 분포를 나타 낸다. 일부 실시 예들에서, 상기 제어부는 상품 이미지에서 사람이 검출되는 지 여부에 따라서 다수의 색상 선정 파이프라인을 수행하도록 구성된다. 일 예에서, 상기 제어부는 제1 인공신경망 모델을 이용하여 상품 이미지에서 사람의 수를 판단한다. 상기 제어부는, 상품 이미지에 사람이 있는 것으로 판단되면 사람 영역에서 사람에 장착된 객체(예컨대, 옷, 액 세서리 등)를 제2 인공신경망 모델을 이용하여 분할하고, 분할 영역에서 RGB 색상 값을 추출하여 상품 이미지의 색상 분포를 산출한다. 상기 제1 인공신경망 모델은 사람을 검출하기 위한 모델로서, 예를 들어 RetinaNet 구조를 포함할 수도 있으나, 이에 제한되진 않는다. 상기 제2 인공신경망 모델은 객체를 분할하기 위한 모델로서, 예를 들어 MaskRCNN 구조를 가지며 객체별로 시맨 틱 분할 동작을 수행하도록 구성된 모델일 수도 있으나, 이에 제한되진 않는다. 또한, 상기 일 예에서, 상기 제어부는, 상품 이미지에 사람이 없는 것으로 판단되면 제3 인공신경망 모델 을 이용하여 상품 이미지의 프레임에서 중심적인 객체를 분할하고, 분할 영역에서 RGB 색상 값을 추출하여 상품 이미지의 색상 분포를 산출한다. 상기 제3 인공신경망 모델은 사람이 아닌 사물을 분할하기 위한 모델로서, 예를 들어 MaskRCNN 구조를 가지며 Salient Object Detection 알고리즘으로 학습된 모델일 수도 있으나, 이에 제한되진 않는다. 상기 제어부는 색상 분포에서 각각의 색상 영역의 면적 및/또는 상품 이미지 상의 위치에 기초하여 특정 색상 영역의 색상을 메인 색상으로 선정한다. 예를 들어, 면적이 넓을수록, 그리고 상품 이미지의 중심에 위치 할수록 메인 색상으로 선정된다. 하나의 상품 페이지에 다수의 상품 이미지가 출력될 경우, 동일한 상품임에도 불구하고 다수의 상품 이미지 중 일부 이미지의 메인 색상이 다른 일부 이미지의 메인 색상과 상이할 수 있다. 일 예에서, 상품이 흰색 셔츠이고, 상기 상품의 상품 페이지에 흰색 셔츠를 착용한 모델의 상반신을 촬영한 제1 이미지와 동일한 흰색 셔츠 위에 검은색 코트를 착용한 모델의 전신을 촬영한 제2 이미지가 업로드된 경우, 제1 이미지의 메인 색상은 흰색으로 선정되고 제2 이미지의 메인 색상은 검은색으로 선정될 수 있다. 상기 제어부는 상품 이미지의 메인 색상을 해당 상품 관련 정보(예컨대, 상품 아이디)에 맵핑해서 배너 DB에 저장한다. 상기 색상 테이블은 상품, 배경, 텍스트의 색상 조합을 기록한 것이다. 상기 색상 조합은 상품, 배경, 텍스트 중 어느 하나의 컨텐츠 구성요소의 색상이 선정되면 나머지 컨텐츠 구성요소의 색상으로 적합한 색상 관계를 정 의한 것이다. 도 6은, 본 출원의 다양한 실시 예들에 따른, 색상 조합을 설명하는 도면이다. 도 6을 참조하면, RGB 색상 계에서 배경 색상과 객체 색상 간의 색상 관계는 객체 색상과 텍스트 색상의 색상 관계 보다 유사한 색상으로 정의된다. 색상의 유사성은 RGB 색상 계의 색상 코드가 가까운지 여부로 결정된다. 일 예에서, 보라색 계열로부터 하늘색 계열까지 5개의 색상을 이용하여 색상 조합을 정의할 경우, 상품 색상이 가장 왼쪽의 보라색으로 선택된 경우를 가정해보자. 그러면 배경 색상은 왼쪽으로부터 두번 째의 짙은 파란색으 로 선정되고, 배너 텍스트의 색상은 가장 오른쪽의 하늘색으로 선정된다. 도 7은, 본 출원의 다양한 실시 예들에 따른, 배너 광고 컨텐츠를 생성하는 과정의 상세 흐름도이다. 도 7을 참조하면, 배너 생성부는 상기 배너 DB에서 사용자 입력에 따라서 사용자의 맞춤 배너 광고 컨텐츠 를 생성하기 위한 배너 광고 템플릿을 선택하고(S41), 결정된 사용자의 맞춤 상품군에 대응하는 상품 속성 값을 상기 속성 사전에서 추출하며(S43), 선택된 배너 광고 템플릿 상에 배치할 배너 광고 텍스트를 상기 사용자의 맞춤 상품군에 대응한 상품 속성 값에 기초하여 생성하고(S45), 선택된 배너 광고 템플릿 상에 배치할 배너 광 고 이미지를 생성하며(S47), 그리고 상기 색상 테이블에서 상기 사용자의 맞춤 상품군에 대응한 상품 속성 중 색상 값과 매칭되는 색상 조합을 검색하고, 검색된 색상 조합 내 배경 색상 및 텍스트 색상을 상기 배너 광고 템플릿의 배경 색상 및 상기 배너 광고 텍스트 색상으로 적용(S49)하도록 구성될 수 있다. 배너 생성부는 사용자가 원하는 배너 광고 템플릿을 선택하도록 배너 DB에 미리 저장된 다수의 배너 광고 템플릿을 사용자 단말로 제공할 수 있다(S41). 상기 단계(S41)에서 사용자의 맞춤 상품군에 대응한 상품 속성 정보는 사용자의 맞춤 상품군에 속하는 상품의 상품 속성 정보에 기초한다. 일 실시 예에서, 상기 배너 생성부는, 결정된 사용자의 맞춤 상품군에 대응하는 상품 속성 값을 상기 속성 사전에서 추출하기 위해, 결정된 사용자의 맞춤 상품군에 속하는 상품 각각의 상품 속성 값에 기초하여 상기 사 용자의 맞춤 상품군의 상품 속성 값을 산출하고, 상품의 속성 사전에서 상기 사용자의 맞춤 상품군의 상품 속성 값에 매칭하거나 가장 가까운 적어도 하나의 상품 속성 값을 사용자의 맞춤 상품군에 대응하는 상품 속성 값으 로 결정하도록 구성될 수 있다(S43). 또한, 배너 생성부는 배너 광고 텍스트를 생성하기 위해, 검색하고, 상기 속성 사전에서 추출된 상품 속성 값에 대응한 상품 속성을 서술하는 속성 텍스트를 획득하며, 상기 맞춤 상품군의 상품 속성 값을 가지는 상품의 상품 페이지 내 상품명 필드 텍스트를 검색하고, 검색된 상품명 필드 텍스트에서 상기 속성 텍스트를 추출하며, 그리고 추출된 속성 텍스트를 상품명 필드 텍스트 상의 순서에 따라 배치해 배너 광고 텍스트를 생성하도록 구 성될 수 있다(S45). 상기 단계(S45)에서 상품군에 대응한 속성 값이 결정되고 속성 값이 텍스트 형태인 경우 속성 값 자체가 속성 값에 대응한 속성 텍스트로 결정된다. 상품군에 대응한 속성 값이 숫자인 경우 속성 사전에서 속성 값이 가리키는 항목 텍스트가 상기 속성 값에 대응하는 속성 텍스트로 획득된다. 일 예에서, 배너 생성부는 검색된 상품 속성 값에 대응한 상품 속성 텍스트로서 소재 속성을 서술하는 텍 스트 \"벨벳\", 색상 속성을 서술하는 \"블루\", 품목 속성을 서술하는 텍스트 \"드레스\"를 획득할 수 있다. 그러면, 배너 생성부는 상품 DB에서 \"벨벳\", \"블루\", \"드레스\"를 가지는 상품을 검색하여 검색된 상품의 상품 페이지 내 상품명 필드에 접근해 필드 텍스트를 획득한다. 상품명 필드에는 보통 '무료배송', '매진임박'과 같 은 상품 속성과 관련 없는 텍스트가 삽입될 가능성이 높다. 예를 들어, 상품명 필드 텍스트가 \"[무료배송] 벨벳 으로 구성된 블루 드레스\"일수 있다. 이러한 상품 속성과 관련 없는 텍스트가 배너 광고 컨텐츠에 삽입되지 않 도록 검색된 상품명 필드 텍스트에서, 이미 획득된 속성 텍스트 \"벨벳\", \"블루\", \"드레스\"를 추출한다. 배너 생 성부는 추출된, 속성 텍스트를 상품명 필드에 기록된 순서에 따라 \"벨벳 블루 드레스\"로 배치해 배너 광고 텍스트를 생성한다. 일부 실시 예들에서, 속성 텍스트는 상기 속성 텍스트에 인접한 텍스트와 함께 추출될 수 있다. 예를 들어, 속 성 텍스트가 단어일 경우 그 단어에 인접한 조사가 함께 추출될 수 있다. 또한, 일부 실시 예들에서, 상기 배너 DB는 다수의 품목 텍스트가 추출되는 경우, 다수의 품목 텍스트가 추출된 경우에 삽입 가능한 보조 텍스트 목록을 더 저장할 수 있다. 상기 보조 텍스트 목록은 품목 조합에 적절 한 텍스트를 미리 기록한다. 예를 들어, \"조끼\"와 \"점퍼\"의 경우 \"한번에\"가 보조 텍스트 목록에 기록될 수 있 다. 그러면, 상기 배너 생성부는 상기 보조 텍스트 목록에서 다수의 품목에 매칭하는 텍스트를 검색해 배너 광 고 텍스트로 이용할 수 있다. 상기 단계(S47)에서 상기 배너 생성부는 미리 저장된 객체 탐지 모델을 이용하여 상기 사용자의 맞춤 상품 군에 대응한 상품 속성 값을 가지는 상품의 상품 이미지에서 상품이 나타난 서브 영역을 결정하고, 상품이 나타 난 서브 영역을 크롭핑과 같은 이미지 처리를 통해 추출하여 상기 배너 광고 이미지를 생성한다. 상기 객체 탐 지 모델은, 예를 들어 MTCNN 구조를 가질 수도 있으나, 이에 제한되진 않는다. 배너 광고 이미지가 생성되면, 상품의 색상은 자동으로 결정된다. 그러면, 상기 배너 생성부는 상기 색상 테이블에서 상기 사용자의 맞춤 상품군에 대응한 상품 속성 중 색상 값과 매칭되는 색상 조합을 검색하고, 검색 된 색상 조합 내 배경 색상 및 텍스트 색상을 상기 배너 광고 템플릿의 배경 색상 및 상기 배너 광고 텍스트 색 상으로 적용함으로써, 배너 광고 컨텐츠를 완성한다(S49). 일부 실시 예들에서, 상기 배너 생성부는 배너 광고 텍스트 영역이 배너 광고 이미지 영역을 커버하는 것 이 최소화되도록 배너 광고 템플릿 상에서 배너 광고 텍스트 또는 배너 광고 이미지의 위치 및 크기 중 적어더 하나를 조정(S48)하도록 더 구성될 수 있다. 도 7에서 상기 위치 조정 단계(S48)는 단계(S49) 이전에 수행되는 것으로 도시되었으나, 이는 단지 예시적인 것 이다. 상기 위치 조정 단계(S48)는 상기 단계(S49) 이후에도 수행될 수 있다. 상기 배너 생성부는 상기 객체 탐지 모델을 이용하여 객체(예컨대, 모델, 사물)의 위치를 템플릿 상의 좌 표로 획득하고, 배너 광고 텍스트 영역이 배너 광고 객체가 나타난 배너 광고 이미지 영역을 커버하는 것을 최 소화하도록 배너 광고 텍스트 또는 배너 광고 이미지의 위치 및 크기 중 적어도 하나를 조정할 수 있다(S48). 일부 실시 예들에서, 위치의 조정은 배너 광고 템플릿에 의해 정의된 배치 구조가 유지되면서 수행될 수 있다. 일부 실시 예들에서, 크기의 조정은 미리 설정된 상한 크기, 하한 크기를 초과하지 않으면서 수행될 수 있다. 도 8은, 도 7의 과정을 통해 생성된 배너 광고 컨텐츠를 도시한다. 도 8을 참조하면, 브랜드 속성 \"PETIT JM\", 품목 속성 \"패딩조끼\", \"점퍼\", 그리고 보조 텍스트 목록에서 품목 조합에 매칭하는 텍스트 \"한번에\"를 포함한 배너 광고 텍스트, 그리고 \"점퍼\"의 상품 이미지에서 추출한 배너 광고 이미지를 가지는 배너 광고 컨텐츠가 생성된다. 이와 같이 쇼핑몰 관리 장치는 사용자의 맞춤 상품군을 사용자 각각에 대해 결정하고 사용자별로 쇼핑몰 사이트에 표시되는 배너 광고 컨텐츠를 개별적으로 구성해 제공함으로써, 쇼핑몰 사이트의 판매를 촉진한다. 상기 온라인 쇼핑몰 관리 시스템이 다른 구성요소를 포함할 수 있다는 것이 통상의 기술자에게 명백할 것이다. 예를 들어, 상기 온라인 쇼핑몰 관리 시스템은 데이터 엔트리를 위한 입력 장치, 및 인쇄 또는 다른 데 이터 표시를 위한 출력 장치를 포함하는, 본 명세서에 서술된 동작에 필요한 다른 하드웨어 요소를 포함할 수 있다. 하드웨어를 이용하여 본 발명의 실시 예를 구현하는 경우에는, 본 발명을 수행하도록 구성된 ASICs(application specific integrated circuits) 또는 DSPs(digital signal processors), DSPDs(digital signal processing devices), PLDs(programmable logic devices), FPGAs(field programmable gate arrays) 등이 본 발명의 프로 세서에 구비될 수 있다. 한편, 상술한 방법은, 컴퓨터에서 실행될 수 있는 프로그램으로 작성 가능하고, 컴퓨터 판독 가능 매체를 이용 하여 상기 프로그램을 동작시키는 범용 디지털 컴퓨터에서 구현될 수 있다. 또한, 상술한 방법에서 사용된 데이 터의 구조는 컴퓨터 판독 가능한 저장 매체에 여러 수단을 통하여 기록될 수 있다. 본 발명의 다양한 방법들을 수행하기 위한 실행 가능한 컴퓨터 코드를 포함하는 저장 디바이스를 설명하기 위해 사용될 수 있는 프로그램 저장 디바이스들은, 반송파(carrier waves)나 신호들과 같이 일시적인 대상들은 포함하는 것으로 이해되지는 않 아야 한다. 상기 컴퓨터 판독 가능한 저장 매체는 마그네틱 저장매체(예를 들면, 롬, 플로피 디스크, 하드 디스 크 등), 광학적 판독 매체(예를 들면, 시디롬, DVD 등)와 같은 저장 매체를 포함한다. 이상에서 설명된 실시 예들은 본 발명의 구성요소들과 특징들이 소정 형태로 결합된 것들이다. 각 구성요소 또 는 특징은 별도의 명시적 언급이 없는 한 선택적인 것으로 고려되어야 한다. 각 구성요소 또는 특징은 다른 구 성요소나 특징과 결합되지 않은 형태로 실시될 수 있다. 또한, 일부 구성요소들 및/또는 특징들을 결합하여 본 발명의 실시 예를 구성하는 것도 가능하다. 발명의 실시 예들에서 설명되는 동작들의 순서는 변경될 수 있다. 어느 실시 예의 일부 구성이나 특징은 다른 실시 예에 포함될 수 있고, 또는 다른 실시 예의 대응하는 구성 또 는 특징과 교체될 수 있다. 특허청구범위에서 명시적인 인용 관계가 있지 않은 청구항들을 결합하여 실시 예를 구성하거나 출원 후의 보정에 의해 새로운 청구항으로 포함시킬 수 있음은 자명하다. 본 발명이 본 발명의 기술적 사상 및 본질적인 특징을 벗어나지 않고 다른 형태로 구체화될 수 있음은 본 발명 이 속한 분야 통상의 기술자에게 명백할 것이다. 따라서, 상기 실시 예는 제한적인 것이 아니라 예시적인 모든 관점에서 고려되어야 한다. 본 발명의 권리범위는 첨부된 청구항의 합리적 해석 및 본 발명의 균등한 범위 내 가능한 모든 변화에 의하여 결정되어야 한다."}
{"patent_id": "10-2023-0009069", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 발명 또는 종래 기술의 실시 예의 기술적 해결책을 보다 명확하게 설명하기 위해, 실시 예에 대한 설명에서 필요한 도면이 아래에서 간단히 소개된다. 아래의 도면들은 본 명세서의 실시 예를 설명하기 목적일 뿐 한정의 목적이 아니라는 것으로 이해되어야 한다. 또한, 설명의 명료성을 위해 아래의 도면들에서 과장, 생략 등 다양 한 변형이 적용된 일부 요소들이 도시될 수 있다. 도 1은 본 출원의 일 측면에 따른 따른 쇼핑몰 관리 장치를 포함한 온라인 쇼핑몰 관리 시스템의 개략도다. 도 2는 본 출원의 다양한 실시 예들에 따른 쇼핑몰 관리 장치의 블럭도이다. 도 3은 도 2에 도시된 데이터 수집부와 모델 생성부의 동작에 대한 상세 구성도이다. 도 4는, 본 출원의 다른 일 측면에 따른, 개인화 모델을 이용하여 사용자 맞춤 상품을 결정하는 방법의 흐름도 이다. 도 5는, 본 출원의 다양한 실시 예들에 따른, 인공신경망의 네트워크 구조도이다. 도 6은, 본 출원의 다양한 실시 예들에 따른, 색상 조합을 설명하는 도면이다. 도 7은, 본 출원의 다양한 실시 예들에 따른, 배너 광고 컨텐츠를 생성하는 과정의 상세 흐름도이다. 도 8은, 도 7의 과정을 통해 생성된 배너 광고 컨텐츠를 도시한다."}
