{"patent_id": "unknown_patent", "section": "특허_기본정보", "subsection": "특허정보", "content": {"출원인": "가부시키가이샤 히타치세이사쿠쇼    가니이 쓰토무", "발명자": "고모리야 스스무"}}
{"patent_id": "unknown_patent", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "레티클상에 형성된 패턴의 상을 반도체 웨이퍼상에 투영하는 투영노광시스템과, 광원의 조명광을 상기 반도체 웨이퍼상에 조사해서 그 반사광을 검지하는 것에 의해 상기 반도체 웨이퍼상에 형성된 패턴의 상을 화상신호로 변환하는 웨이퍼 위치검출 시스템과, 상기 화상신호를 처리하는 것에 의해 상기 반도체 웨이퍼상 상기패턴 위치를 측정하는 위치측정 연산시스템을 가지는 노광장치를 사용하는 반도체 집적회로패턴의 위치맞춤방법에 있어서, 상기 반도체 웨이퍼상에 형성된 패턴상의 화상신호를 처리해서 상기 패턴의 위치를 측정할 때, 상기 패턴의 중심확률을 나타내는 상기 화상신호의 대칭성에 관한 제1의 평가함수와 미리 준비된 템플레이트와의 매칭에 관한 제2평가 함수를 구하는 스텝과, 제1 및 제2평가함수를 합쳐서 복합한 평가함수를 산출하는 스텝과, 상기 복합한 평가함수의 극치를 검출하는 스텝을 포함하는 반도체 집적회로 패턴의 위치맞춤방법."}
{"patent_id": "unknown_patent", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 반도체 웨이퍼 상에 형성된 패턴상의 화상신호를 처리해서 상기 패턴의 위치를 측정할 때, 상기 패턴의 중심확률을 나타내는 상기 화상신호의 대칭성에 관한 제1의 평가함수와 상기 템플레이트와의 매칭에 관한 제2의 평가함수를 구하는 스텝과, 반도체 제조프로세스의 변동에 따라서 변화하는 상기 화상신호의 변화의 정도에 따라서 제1 및 제2의 평가함수의 각각에 가중치계수를 곱하는 스텝과, 제1 및 제2평가함수를 합쳐서 복합한 평가함수를 산출하는 스텝 및 상기 복합한 평가함수의 극치를 검출하는 스텝을 포함하는 반도체 집적회로 패턴의 위치맞춤방법."}
{"patent_id": "unknown_patent", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 반도체 웨이퍼상에 형성된 패턴상의 화상신호를 처리해서 상기 패턴의 위치를 측정할 때, 상기 패턴의 중심확률을 나타내는 미리 준비된 복수의 템플레이트와의 메칭에 관한 평가함수를 구하는 스텝과, 반도체 제조프로세스의 변동에 따라서 변화하는 상기 화상신호의 변화의 정도에 따라서 상기 평가함수의 각각에 가중치계수를 곱하는 스텝과, 상기 평가함수들을 합쳐서 복합한 평가함수를 산출하는 스텝과, 상기 평가함수들의 극치를 검출하는 스텝을 구비하는 반도체 집적회로 패턴의 위치맞춤방법."}
{"patent_id": "unknown_patent", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 반도체 웨이퍼 상에 형성된 패턴의 상의 화상신호를 처리해서 상기 패턴의 위치를 측정할 때, 상기 패턴의 중심확률을 나타내는 평가함수로서, 미리 복수의 템플레이트를 입력으로 하고, 반도체 제조프로세스의 변동에 따라서 변화하는 상기 화상신호의 변화의 정도에 따른 가중치계수를 출력으로 하여 학습시켰던 뉴럴네트워크를 사용하는 스텝과, 상기 화상신호를 입력한 때에 출력되는 가중치계수를 상기 복수의 템플레이트와의 매칭에 관한 평가함수의 각각에 곱하는 스텝과 상기 평가함수들을 합쳐서 복합한 평가함수를 산출하는 스텝과, 상기 평가함수들의 극치를 검출하는 스텝을 구비하는 반도체 집적회로 패턴의 위치맞춤방법."}
{"patent_id": "unknown_patent", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2항에 있어서, 상기 화상신호의 대칭성에 관한 평가함수와 상기 템플레이트와의 매칭에 관한 평가함수를 각각 구할 때, 그의 적분범위를 상기 화상신호의 대역적인 구간과 국소적인 구간으로 나뉘고, 각각의 구간에서 평가함수를 구하게 한 반도체 집적회로 패턴의 위치맞춤방법."}
{"patent_id": "unknown_patent", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 화상신호의 파형의 극대치, 극소치 또는 변곡점을 특징점으로 검출하는 스텝과, 상기 패턴의 중심의 양측에서 상기 특징점의 레벨과 간격을 비교하는 것에 의해 파형이 비대칭적으로 되어 있는 영역을 구하는 스텝과, 이 영역을 제외한 영역을 국소적인 구간으로 설정하는 스텝을 포함하는 반도체 집적회로 패턴의 위치맞춤방법."}
{"patent_id": "unknown_patent", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제2항에 있어서, 상기 화상신호의 대칭성에 관한 평가함수와 상기 템플레이트와의 매칭에 관한 평가함수들을 각각 구할 때, 상기 화상신호가 미분, 2차 미분 또는 주파수 필터링 처리되게 한 반도체 집적회로 패턴의 위치맞춤방법."}
{"patent_id": "unknown_patent", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "광원의 조명광을 반도체 웨이퍼상에 조사해서 그 반사광을 검지하는 것에 의해 상기 반도체 웨이퍼상의 복수의 층에 형성된 패턴의 상을 각각 화상신호로 변환하는 검지수단과, 상기 각각의 화상신호를 처리하는 것에 의해 복수층간의 패턴위치의 상대오차를 산출하는 화상처리 수단을 가지는 포개진 정도측정장치를 사용하는 반도체 집적회로 패턴의 위치맞춤방법에 있어서, 상기 복수층에 형성된 패턴의 상의 화상신호를 처리해서 상기 패턴의 위치를 측정할 때, 상기 패턴의 중심확률을 나타내는 청구항 7기재의 평가함수를 산출해서 그의 극치를 검출하게한 반도체 집적회로 패턴의 위치맞춤방법."}
{"patent_id": "unknown_patent", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "5-2공개특허특1994-0012494제8항의 반도체 집적회로 패턴의 위치맞춤방법에 사용하는 장치에 있어서, 반도체 웨이퍼상에 형성된 패턴의 화상신호가 입력된 입력메모리와, 상기 화상신호를 처리해서 미리 지정된 평가함수를 산출하는 평가함수 산출부와, 상기 평가함수를 출력하는 출력 메모리들을 각각 가지는 복수의 요수평가함수 연산유니트를 구비하고, 상기 복수의 요소평가함수 연산유니트의 각각의 입력메모리에 화상신호를 입력하는 제1의 동작과, 상기 복수의 요소평가함수 연산유니트의 각각의 평가함수 산출부에 의해 미리 지정된 평가함수를 산출하는 제2의 동작과, 상기 복수의 요소평가함수 연산유니트의 각각의 출력 메모리에서 출력된 상기 평가함수에 반도체 제조프로세스의 변동에 따라서 변화하는 상기 화상신호의 변화의 정도에 따른 소정의 가중치계수를 곱하고, 이들을 합쳐서 복합한 평가함수를 산출하여 그 극치를 검출하는 제3의 동작이 병렬처리에 의해 행해지도록 구성한 반도체 집적회로 패턴의 위치맞춤장치."}
{"patent_id": "unknown_patent", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "반도체장치 또는 집적회로장치의 제조시에 반도체장치 웨이퍼, 집적회로장치 웨이퍼, 반도체장치칩, 집적회로장치칩 및 이들 웨이퍼 및 칩의 제조에 사용되는 광학마스크내의 어느 하나를 대상기관으로 하는 소정의 처리 또는 검사에 있어서, 상기 대상기판상의 소정패턴위치를 검출할 때에 상기 소정의 패턴의 위치로부터의 광학신호나 또는 상기 광학신호로부터 얻어진 전기신호에 대하여, 뉴럴 네트워크(Neural Network) 또는 인공지능소자를 사용하여 소정의 연산처리를 시행함으로써 위치데이터를 얻는 것을 특징으로 하는 반도체장치 및 집적회로장치의 제조방법."}
{"patent_id": "unknown_patent", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "반도체 장치 또는 집적회로장치 제조시에 반도체장치 웨이퍼, 집적회로장치 웨이퍼, 반도체장치 칩, 집적회로장치 칩 및 이들 웨이퍼 및 칩의 제조에 사용하는 광학 마스크 내의 어느 하나를 대상기판으로 하는 소정의 처리 또는 검사에 있어서, 상기 대상기판상의 소정의 패턴의 위치를 검출할 때에 상기 소정의 패턴의 위치로부터의 광학신호나 또는 상기 광학신호로부터 얻어진 전기신호에 대해서, 복수의 위치검출 알고리즘을 조합해서 소정의 연산처리를 시행함으로써 위치데이터를 얻는 반도체장치 및 집적회로장치의 제조방법.※ 참고사항 : 최초출원 내용에 의하여 공개하는 것임.도면 도면1 도면2a5-3공개특허특1994-0012494 도면2b 도면3 도면4 도면55-4공개특허특1994-00124945-5공개특허특1994-0012494"}
{"patent_id": "unknown_patent", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "반도체 웨이퍼상에 형성된 패턴의 위치를 고정도로 측정하는 기술을 제공하기 위해 반도체 웨이퍼상에 형성된 패턴의 상의 화상신호를 처리해서 상기 패턴위치를 측정하는 때, 상기 패턴중심같음을 나타내는 평가함수로 해서 대칭성 매칭법에 의한 평가함수와 템플레이트 매칭법에 의한 평가함수들을 각각 구하여 이들을 합쳐서 복합평가 함수를 산출해서 그 극치를 검출한다."}
