{"patent_id": "10-2022-0025463", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0127772", "출원번호": "10-2022-0025463", "발명의 명칭": "딥러닝 기반 소형 선박 조난 상황 인지 시스템 및 이의 실행 방법", "출원인": "군산대학교산학협력단", "발명자": "노재규"}}
{"patent_id": "10-2022-0025463", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "복수의 소형 선박 각각에 형성되어 있는 영상촬영기기로부터 미리 결정된 영상 시료 시나리오에 해당하는 영상시료 데이터를 수신하는 영상 시료 제작부;영상 공유 서버 또는 사용자 단말로부터 영상 데이터를 수신하고 상기 영상 데이터 중 승선자 관련된 인공 지능전이 학습용 이미지를 추출하고, 인공 지능 전이 학습용 이미지의 내부의 위치 정보를 라벨링하여 커스텀 데이터 셋을 생성하는 데이터 구축부;상기 커스텀 데이터 셋을 이용하여 객체 추적 검출 모델을 전이 학습시키는 객체 추적 모델 학습부;상기 전이 학습된 객체 추적 검출 모델에 상기 영상 시료 데이터를 적용하여 객체 위치 정보를 추출하는 객체검출 추적부; 및상기 객체 위치 정보를 이용하여 미리 정의된 승선자 선내 영역 탈피 조건을 벗어났는지 여부를 판단하고, 상기판단 결과에 따라 조난상황 알림을 발생시키는 소형 선박 조난 상황 인지부를 포함하는 것을 특징으로 하는 소형 선박 조난 상황 인지 시스템."}
{"patent_id": "10-2022-0025463", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 객체 검출 추적부는상기 영상 시료 데이터를 구성하는 복수의 프레임 각각에 대해서 승선자에 해당하는 객체가 인식되면 상기 객체에 식별자를 부여하고 상기 객체가 소실될 때까지 해당 객체의 객체 인식 영역 정보를 이용하여 다음 프레임에서의 객체 속도를 칼만 필터로 추적하는 것을 특징으로 하는 소형 선박 조난 상황 인지 시스템."}
{"patent_id": "10-2022-0025463", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 소형 선박 조난 상황 인지부는 상기 소형 선박의 영상촬영기기로부터 수신된 영상 데이터를 분석하여 획득된 탑승 인원수 및 상기 객체 검출추적부에서 승선자를 추적 시 생성된 식별자의 수를 비교하여 일치하는지 여부를 확인하고, 상기 확인 결과 탑승 인원수 및 상기 식별자의 수가 일치하지 않은 시간이 특정 시간을 경과하면 승선자 선내 영역 탈피 조건을만족하였다고 판단하여 조난 상황 알림을 발생하는 것을 특징으로 하는 소형 선박 조난 상황 인지 시스템."}
{"patent_id": "10-2022-0025463", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 소형 선박 조난 상황 인지부는 상기 소형 선박의 영상촬영기기로부터 수신된 영상 데이터를 분석하여 승선자의 객체 인식 영역에 대해서 중심값을 중심으로 한 면이 특정 픽셀인 정사각형의 네 꼭짓점이 미리 정의된 선내 영역을 벗어나는지 여부를 확인공개특허 10-2023-0127772-3-하고, 상기 확인 결과 상기 정사각형의 네 꼭짓점이 미리 정의된 선내 영역을 벗어나는 시간이 특정 시간을 경과하면 승선자 선내 영역 탈피 조건을 만족하였다고 판단하여 조난 상황 알림을 발생하는 것을 특징으로 하는 소형 선박 조난 상황 인지 시스템."}
{"patent_id": "10-2022-0025463", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "소형 선박 조난 상황 인지 시스템에서 실행되는 소형 선박 조난 상황 인지 방법에 있어서,복수의 소형 선박 각각에 형성되어 있는 영상촬영기기로부터 미리 결정된 영상 시료 시나리오에 해당하는 영상시료 데이터를 생성하는 단계;영상 공유 서버 또는 사용자 단말로부터 영상 데이터를 수신하고 상기 영상 데이터 중 승선자 관련된 인공 지능전이 학습용 이미지를 추출하고, 인공 지능 전이 학습용 이미지의 내부의 위치 정보를 라벨링하여 커스텀 데이터 셋을 생성하는 단계;상기 커스텀 데이터 셋을 이용하여 객체 검출 모델을 학습시켜 전이 학습 모델을 생성하는 단계; 상기 전이 학습된 객체 추적 검출 모델에 상기 영상 시료 데이터를 적용하여 객체 위치 정보를 추출하는 단계;및상기 객체 위치 정보를 이용하여 미리 정의된 승선자 선내 영역 탈피 조건을 벗어났는지 여부를 판단하고, 상기판단 결과에 따라 조난상황 알림을 발생시키는 단계를 포함하는 것을 특징으로 하는 소형 선박 조난 상황 인지 방법."}
{"patent_id": "10-2022-0025463", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 전이 학습된 객체 추적 검출 모델에 상기 영상 시료 데이터를 적용하여 객체 위치 정보를 추출하는 단계는상기 영상 시료 데이터를 구성하는 복수의 프레임 각각에 대해서 승선자에 해당하는 객체가 인식되면 상기 객체에 식별자를 부여하고 상기 객체가 소실될 때까지 해당 객체의 객체 인식 영역 정보를 이용하여 다음 프레임에서의 객체 속도를 칼만 필터로 추적하는 단계를 포함하는 것을 특징으로 하는 소형 선박 조난 상황 인지 방법."}
{"patent_id": "10-2022-0025463", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5항에 있어서,상기 판단 결과에 따라 조난상황 알림을 발생시키는 단계는상기 소형 선박의 영상촬영기기로부터 수신된 영상 데이터를 분석하여 획득된 탑승 인원수 및 상기 객체 검출추적부에서 승선자를 추적 시 생성된 식별자의 수를 비교하여 일치하는지 여부를 확인하는 단계; 및상기 확인 결과 탑승 인원수 및 상기 식별자의 수가 일치하지 않은 시간이 특정 시간을 경과하면 승선자 선내영역 탈피 조건을 만족하였다고 판단하여 조난 상황 알림을 발생하는 단계를 포함하는 것을 특징으로 하는 소형 선박 조난 상황 인지 방법."}
{"patent_id": "10-2022-0025463", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제5항에 있어서,공개특허 10-2023-0127772-4-상기 판단 결과에 따라 조난상황 알림을 발생시키는 단계는상기 소형 선박의 영상촬영기기로부터 수신된 영상 데이터를 분석하여 승선자의 객체 인식 영역에 대해서 중심값을 중심으로 한 면이 특정 픽셀인 정사각형의 네 꼭짓점이 미리 정의된 선내 영역을 벗어나는지 여부를 확인하는 단계; 및상기 확인 결과 상기 정사각형의 네 꼭짓점이 미리 정의된 선내 영역을 벗어나는 시간이 특정 시간을 경과하면승선자 선내 영역 탈피 조건을 만족하였다고 판단하여 조난 상황 알림을 발생하는 단계를 포함하는 것을 특징으로 하는 소형 선박 조난 상황 인지 방법."}
{"patent_id": "10-2022-0025463", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 소형 선박 조난 상황 인지 시스템은 복수의 소형 선박 각각에 형성되어 있는 영상촬 영기기로부터 미리 결정된 영상 시료 시나리오에 해당하는 영상 시료 데이터를 수신하는 영상 시료 제작부, 영상 공유 서버 또는 사용자 단말로부터 영상 데이터를 수신하고 상기 영상 데이터 중 승선자 관련된 인공 지능 전이 (뒷면에 계속)"}
{"patent_id": "10-2022-0025463", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 딥러닝 기반 소형 선박 조난 상황 인지 시스템 및 이의 실행 방법에 관한 것으로, 보다 구체적으로 소형 선박에 설치되어 있는 영상촬영기기를 통해 획득한 영상 이미지를 기초로 승선자의 상황을 인지하여 조난 상황을 인지할 수 있도록 하는 딥러닝 기반 소형 선박 조난 상황 인지 시스템 및 이의 실행 방법에 관한 것이다."}
{"patent_id": "10-2022-0025463", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "소형선박은 어망 및 양식장의 어업 활동을 하기 위한 어선, 바다 레포츠 산업의 발달로 바다낚시, 여행 등 해양 문화 콘텐츠의 증가됨에 따라 경험이 미숙한 레저 선박 종사자의 증가로 최근에 국내외로 연해안 근처에서 출동 사고, 침수 사고 등으로 많은 인명피해를 가져왔다. 소형 선박의 사고 분석을 위한 선박항해 기록장치의 탑재 의무화는 되어 있지 않는 실정으로 사고시 사고원인을 규명하는 객관적인 자료의 필요성이 꾸준히 제기되고 있다. 소형 선박의 기관실은 밀폐되어 있어 수시로 확인이 어려워 CCTV를 설치하지만, 자세히 영상을 관찰하고 있지 않으면, 직관적으로 사고 파악이 어려운 실정이다. 종래에는 소형 선박의 실내 및 콘솔에 비치된 초단파대 무선설비(VHF-DSC: Very High Frequency Digital Selective Calling) 조난신호 발생장치를 원격으로 작동시킬 수 있는 인체부착형 원격장비가 개발되었다. 그러나, 개인이 해당 원격장비를 반드시 소지하고 승선해야 하며 원격장비의 배터리 방전시 작동이 불가능하고 일반 시계와 중복해서 착용을 해야 하는 등 편의성에서 다소 부족하여 보급이 잘 되지 못하고 있는 상황이다. 따라서, 승선한 소형선박 승선자가 아무런 장비를 소지 장착하지 않더라도 선박 자체 전원만 있다면 항상 승선 자의 상황을 인지하여 조난 상황을 인지할 수 있는 시스템의 개발이 필요하다."}
{"patent_id": "10-2022-0025463", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 소형 선박에 설치되어 있는 영상촬영기기를 통해 획득한 영상 이미지를 기초로 승선자의 상황을 인지 하여 조난 상황을 인지할 수 있도록 하는 딥러닝 기반 소형 선박 조난 상황 인지 시스템 및 이의 실행 방법을 제공하는 것을 목적으로 한다. 또한, 본 발명은 커스텀 데이터 셋을 이용하여 객체 검출 모델을 학습시킴으로써 승선자 인지 성능을 향상시키 고 추적 중인 객체가 겹쳐지는 겹쳐짐 문제를 회피할 수 있도록 하는 딥러닝 기반 소형 선박 조난 상황 인지 시 스템 및 이의 실행 방법을 제공하는 것을 목적으로 한다. 발명의 목적들은 이상에서 언급한 목적으로 제한되지 않으며, 언급되지 않은 본 발명의 다른 목적 및 장점들은 하기의 설명에 의해서 이해될 수 있고, 본 발명의 실시예에 의해 보다 분명하게 이해될 것이다. 또한, 본 발명 의 목적 및 장점들은 특허 청구 범위에 나타낸 수단 및 그 조합에 의해 실현될 수 있음을 쉽게 알 수 있을 것이다."}
{"patent_id": "10-2022-0025463", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이러한 목적을 달성하기 위한 소형 선박 조난 상황 인지 시스템은 복수의 소형 선박 각각에 형성되어 있는 영상 촬영기기로부터 미리 결정된 영상 시료 시나리오에 해당하는 영상 시료 데이터를 수신하는 영상 시료 제작부, 영상 공유 서버 또는 사용자 단말로부터 영상 데이터를 수신하고 상기 영상 데이터 중 승선자 관련된 인공 지능 전이 학습용 이미지를 추출하고, 인공 지능 전이 학습용 이미지의 내부의 위치 정보를 라벨링하여 커스텀 데이 터 셋을 생성하는 데이터 구축부, 상기 커스텀 데이터 셋을 이용하여 객체 추적 검출 모델을 전이 학습시키는 객체 추적 모델 학습부, 상기 전이 학습된 객체 추적 검출 모델에 상기 영상 시료 데이터를 적용하여 객체 위치 정보를 추출하는 객체 검출 추적부 및 상기 객체 위치 정보를 이용하여 미리 정의된 승선자 선내 영역 탈피 조 건을 벗어났는지 여부를 판단하고, 상기 판단 결과에 따라 조난상황 알림을 발생시키는 소형 선박 조난 상황 인 지부를 포함한다. 또한, 이러한 목적을 달성하기 위한 소형 선박 조난 상황 인지 시스템에서 실행되는 소형 선박 조난 상황 인지 방법은 복수의 소형 선박 각각에 형성되어 있는 영상촬영기기로부터 미리 결정된 영상 시료 시나리오에 해당하 는 영상 시료 데이터를 생성하는 단계, 영상 공유 서버 또는 사용자 단말로부터 영상 데이터를 수신하고 상기 영상 데이터 중 승선자 관련된 인공 지능 전이 학습용 이미지를 추출하고, 인공 지능 전이 학습용 이미지의 내 부의 위치 정보를 라벨링하여 커스텀 데이터 셋을 생성하는 단계, 상기 커스텀 데이터 셋을 이용하여 객체 검출 모델을 학습시켜 전이 학습 모델을 생성하는 단계, 상기 전이 학습된 객체 추적 검출 모델에 상기 영상 시료 데 이터를 적용하여 객체 위치 정보를 추출하는 단계 및 상기 객체 위치 정보를 이용하여 미리 정의된 승선자 선내 영역 탈피 조건을 벗어났는지 여부를 판단하고, 상기 판단 결과에 따라 조난상황 알림을 발생시키는 단계를 포 함한다."}
{"patent_id": "10-2022-0025463", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 바와 같은 본 발명에 의하면, 소형 선박에 설치되어 있는 영상촬영기기를 통해 획득한 영상 이미지를 기 초로 승선자의 상황을 인지하여 조난 상황을 인지할 수 있다는 장점이 있다. 또한 본 발명에 의하면, 커스텀 데이터 셋을 이용하여 객체 검출 모델을 학습시킴으로써 승선자 인지 성능을 향 상시키고 추적 중인 객체가 겹쳐지는 겹쳐짐 문제를 회피할 수 있다는 장점이 있다."}
{"patent_id": "10-2022-0025463", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "전술한 목적, 특징 및 장점은 첨부된 도면을 참조하여 상세하게 후술되며, 이에 따라 본 발명이 속하는 기술분 야에서 통상의 지식을 가진 자가 본 발명의 기술적 사상을 용이하게 실시할 수 있을 것이다. 본 발명을 설명함 에 있어서 본 발명과 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에는 상세한 설명을 생략한다. 이하, 첨부된 도면을 참조하여 본 발명에 따른 바람직한 실시예를 상세히 설명하기로 한다. 도면에서 동일한 참조부호는 동일 또는 유사한 구성요소를 가리키는 것으로 사용된다. 도 1은 본 발명의 일 실시예에 따른 딥러닝 기반 소형 선박 조난 상황 인지 시스템을 설명하기 위한 네트워크 구성도이다. 도 2는 본 발명의 일 실시예에 따른 소형 선박 조난 상황 인지 장치의 내부 구조를 설명하기 위한 블록도이다. 도 1 및 도 2를 참조하면, 소형 선박 조난 상황 인지 장치는 영상 시료 제작부, 데이터 구축부, 객체 추적 검출 모델 학습부, 객체 검출 추적부 및 소형 선박 조난 상황 인지부를 포함한다. 영상 시료 제작부는 복수의 시료 제작용 소형 선박 각각에 형성되어 있는 영상촬영기기로부터 미리 결정된 영상 시료 시나리오에 해당하는 영상 시료 데이터를 수신할 수 있다. 이때, 영상 시료 시나리오는 복수의 소형 선박 중 일반 보트에서 계측 보트로 이동하면서 배에 탑승하는 동작 및 조난되는 상황을 포함할 수 있다. 이때, 일반 보트는 소형 선박 조난 상황 인지 장치가 장착되지 않은 보트이며, 계측 보트는 소형 선 박 조난 상황 인지 장치가 장칙되어 승선자를 추적하는 성능을 가지는 보트이다. 일 실시예에서, 영상 시료 제작부는 승선자가 일반 보트에서 계측 보트로 이동한 후 특정 시간(예를 들어, 10분)이 경과하면 계측 보트에서 일반 보토로 이동하는 영상 시료 시나리오에 해당하는 영상 시료 데이터를 수 신할 수 있다. 다른 일 실시예에서, 영상 시료 제작부는 승선자가 일반 보트에서 계측 보트로 이동한 후 좌측 방향 및 우 측 방향으로 위치를 이동하고, 특정 시간이 경과된 후 승선자가 계측 보트에서 일반 보트로 이동하는 영상 시료 시나리오에 해당하는 영상 시료 데이터를 수신할 수 있다. 또 다른 일 실시예에서, 영상 시료 제작부는 승선자가 일반보트에서 계측보트로 이동한 후 앉는 행동을 취 하며, 특정 시간이 경과한 후 승전자가 계측보트에서 일반 보트로 이동하는 영상 시료 시나리오에 해당하는 영 상 시료 데이터를 수신할 수 있다. 또 다른 일 실시예에서, 영상 시료 제작부는 제1 승선자와 제2 승선자가 일반보트에서 계측보트로 이동한 후 특정 시간이 경과 하면 제1 승선자가 계측 보트에서 일반 보트로 이동하는 영상 시료 시나리오에 해당하는 영상 시료 데이터를 수신할 수 있다. 또 다른 일 실시예에서, 영상 시료 제작부는 제1 승선자 및 제2 승선자가 일반 보트에서 계측 보트로 이동 한 후 제2 승선자가 제1 승선자의 뒤로 이동하며 특정 시간이 경과한 후 제2 승선자가 계측 보트에서 일반 보트 로 이동하는 영상 시료 시나리오에 해당하는 영상 시료 데이터를 수신할 수 있다. 이러한 영상 시료 시나리오에 서 제1 승선자 및 제2 승선자가 일반 보트에서 계측 보트로 이동한 후 제2 승선자가 제1 승선자의 뒤로 이동하 기 때문에 영상 시료 데이터에서 제1 및 제2 승선자가 겹쳐보이게 된다. 또 다른 일 실시예에서, 영상 시료 제작부는 제1 승선자 및 제2 승선자가 일반 보트에서 계측 보트로 이동 한 후 서로 교차하며 특정 시간 동안 주기적으로 위치를 이동하며, 특정 시간 이후 제1 승선자가 계측 보트에서 일반 보트로 이동하는 영상 시료 시나리오에 해당하는 영상 시료 데이터를 수신할 수 있다. 또 다른 일 실시예에서, 영상 시료 제작부는 제1 승선자 및 제2 승선자가 일반 보트에서 계측 보트로 이동 한 후 제1 승선자가 계측 보트에서 좌측 방향 및 우측 방향으로 위치를 이동하며, 특정 시간 경과 후(예를 들어, 10분) 제2 승선자가 계측 보트에서 일반 보트로 이동하는 영상 시료 시나리오에 해당하는 영상 시료 데이 터를 수신할 수 있다. 또 다른 일 실시예에서, 영상 시료 제작부는 제1 승선자, 제2 승선자 및 제3 승선자가 일반 보트에서 계측 보트로 이동하며, 특정 시간 경과 후(예를 들어, 10분) 제1 승선자가 계측 보트에서 일반 보트로 이동하는 영상 시료 시나리오에 해당하는 영상 시료 데이터를 수신할 수 있다. 또 다른 일 실시예에서, 영상 시료 제작부는 제1 승선자, 제2 승선자 및 제3 승선자가 일반 보트에서 계측 보트로 이동하며, 주기적으로 서로 교차하며 위치를 이동하다가 특정 시간(예를 들어, 10분) 이후에 제1 승선자 가 계측 보트에서 일반 보트로 이동하는 영상 시료 시나리오에 해당하는 영상 시료 데이터를 수신할 수 있다. 또 다른 일 실시예에서, 영상 시료 제작부는 제1 승선자, 제2 승선자 및 제3 승선자가 일반 보트에서 계측 보트로 이동하며, 제3 승선자가 좌측 방향 및 우측 방향으로 위치를 이동하다가 특정 시간(예를 들어, 10분) 이 후 제3 승선자가 계측 보트에서 일반 보트로 이동하는 영상 시료 시나리오에 해당하는 영상 시료 데이터를 수신 할 수 있다. 상기와 같이 제작된 영상 시료 데이터는 딥러닝 기반 소형 선박 조난 상황 인지 시스템의 정량적 측정에 이용된 다. 데이터 구축부는 영상 공유 서버 또는 사용자 단말로부터 영상 데이터를 수신하면, 영상 데이터 에서 승선자와 관련된 인공 지능 전이 학습용 이미지를 추출한다. 그 후, 데이터 구축부는 영상 데이터 내부의 객체의 위치 정보를 생성해주는 라벨링 프로그램을 이용하여 인공 지능 전이 학습용 이미지에 각자의 .xml형식의 커스텀 데이터 셋을 생성한다. 객체 추적 검출 모델 학습부는 데이터 구축부에서 생성된 커스텀 데이터 셋을 이용하여 객체 추적 검 출 모델(이하, ‘YOLO V3 딥러닝 모델’이라 칭함)을 전이 학습시킨다. 객체 검출 추적부는 영상 시료 제작부로부터 영상 시료 데이터를 수신하면, 영상 시료 데이터를 객체 추적 검출 모델에 적용하여 객체 위치 정보를 추출한다. 먼저, 객체 검출 추적부는 영상 시료 데이터의 각각의 프레임에 대해서 객체를 인지하고 객체가 무엇인지 인지한 후 정확한 위치를 확인하는 과정을 수행하여 객체 검출을 실행하여 객체 인식 영역을 생성한다. 만일, 객체 검출 추적부는 현재 프레임에서 검출된 객체 인식 영역 및 이전 프레임에서 검출된 객체 인식 영역을 비교하여 겹쳐지면 객체 인식 과정을 중단한 후 겹쳐지는 상황이 종료되면 객체 인식 과정을 계속 실행 한다. 본 발명에서는 상기와 같은 현재 프레임에서 검출된 객체 인식 영역 및 이전 프레임에서 검출된 객체 인식 영역 이 겹쳐지는 겹쳐짐(Occluding) 문제를 해결하기 위해 YOLO V3 딥러닝 모델에 Deep SORT 스테이지를 추가해 인 지 성능을 기반으로 객체 추적을 실행한다. YOLO V3 딥러닝 모델을 이용한 객체 인식은 영상 데이터 속 인지되는 모든 사용자 클래스에 대해서 인지하는 반 면 Deep SORT를 이용한 객체 추적은 같은 객체라고 추적되면 중복으로 추적되지 않는 차이점을 가진다. 이는 각 프레임마다 객체를 인지하기 때문에 각각의 프레임이 영향을 주지 않는 독립적인 작동 방식을 가진 YOLO V3 딥러닝 모델과 다르게 Deep SORT기법은 하나의 프레임에서 인지된 객체에 식별자를 부여하고 해당 객체 인식 영역 정보를 이용해 다음 프레임에서의 객체 속도를 칼만 필터(Kalman Filter)로 추정하여 위치를 예측하 면서 각 프레임이 상호작용하는 방식으로 작동하기 때문이다. 만일, 객체 검출 추적부는 Deep SORT에 따라 칼만 필터를 이용해 추적 중인 객체가 영상 속에서 소실될 경 우, 해당 객체의 식별자에 대한 객체 인식 영역 정보는 대기 상태로 추적이 보류되어있다가 대기 상태가 지속 되면 완전 소실로 판단되어 사용자의 식별자와 관련 정보가 삭제된다. 상기와 같이, 객체 검출 추적부는 추적되는 객체에 식별자가 부여되고 소실될 때까지 칼만 필터를 이용하 여 위치 예측 과정이 재귀적으로 반복되며 객체를 추적한다. 소형 선박 조난 상황 인지부는 소형 선박의 영상촬영기기로부터 수신된 영상 데이터를 분석하여 조난 상황 이 발생하였는지 여부를 인지한다. 이를 위해, 소형 선박 조난 상황 인지부는 소형 선박의 선내 영역, 승 선자 선내 영역 탈피 조건을 미리 정의해야 한다. 일 실시예에서, 소형 선박 조난 상황 인지부는 소형 선박의 선내 영역을 정의한다. 예를 들어, 소형 선박 조난 상황 인지부는 YOLACT 모델의 인스턴스 세그멘테이션 기법을 통해 소형 선박의 선내 영역을 정의한다. 이는 딥러닝 기반 소형 선박 조난 상황 인지 시스템이 다양한 선박에서 사용될 변수를 고려할 때 영상 데이터를 획득하는 각도와 선내 영역의 형태가 개발 환경과 다르더라도 작동할 수 있도록 하기 위해서이다. 다른 일 실시예에서, 소형 선박 조난 상황 인지부는 승선자 선내 영역 탈피 조건을 정의한다. 먼저, 소형 선박 조난 상황 인지부는 딥러닝 기반 소형 선박 조난 상황 인지 시스템의 작동 시 입력하는 탑승 인원수보다 객체 검출 추적부에서 승선자를 추적할 때 생성되는 객체의 식별자의 수가 특정 시간(예 를 들어, 100 프레임(즉, 약 3초)) 동안 일치하지 않으면 탈피로 결정하도록 승선자 선내 영역 탈피 조건을 정 의한다. 또한, 소형 선박 조난 상황 인지부는 선내 영역에 있는 승선자의 객체 인식 영역에 대해서 중심값을 중심 으로 한 명이 특정 픽셀(예를 들어, 20 pixel)인 정사각형의 네 꼭짓점이 미리 정의된 선내 영역을 벗어난 후 특정 시간(예를 들어, 100 프레임(즉, 약 3초))이 경과하면 탈피로 결정하도록 승선자 선내 영역 탈피 조건을 정의한다. 그 후, 소형 선박 조난 상황 인지부는 소형 선박의 영상촬영기기로부터 수신된 영상 데이터를 분석하여 미리 정의된 승선자 선내 영역 탈피 조건을 벗어났는지 여부를 판단하고, 판단 결과에 따라 조난 상황 이 발생하였는지 여부를 판단한다. 일 실시예에서, 소형 선박 조난 상황 인지부는 소형 선박의 영상촬영기기로부터 수신된 영상 데이터를 분 석하여 탑승 인원수 및 Deep SORT에서 승선자를 추적할 때 생성되는 식별자의 수를 비교하여 일치하는지 여부를 확인하고, 확인 결과에 따라 탑승 인원수 및 객체 검출 추적부에서 승선자를 추적할 때 생성되는 식별자의 수가 상이한 시간을 측정하여 특정 시간을 경과하면 승선자 선내 영역 탈피 조건을 만족하였다고 판단한다. 다른 일 실시예에서, 소형 선박 조난 상황 인지부는 소형 선박의 영상촬영기기로부터 수신된 영상 데이터 를 분석하여 승선자의 객체 인식 영역에 대해서 중심값을 중심으로 한 면이 특정 픽셀인 정사각형의 네 꼭짓점 이 미리 정의된 선내 영역을 벗어나는지 여부를 확인한다. 상기의 실시예에서, 소형 선박 조난 상황 인지부는 승선자의 객체 인식 영역에 대해서 중심값을 중심으로 한 면이 특정 픽셀인 정사각형의 네 꼭짓점이 미리 정의된 선내 영역을 벗어나면 정사각형의 네 꼭짓점이 미리 정의된 선내 영역을 벗어나면 정사각형의 네 꼭짓점이 미리 정의된 선내 영역을 벗어나는 시간을 측정하여 특정 시간을 경과하면 승선자 선내 영역 탈피 조건을 만족하였다고 판단한다. 예를 들어, 소형 선박 조난 상황 인지부는 소형 선박의 영상촬영기기로부터 수신된 영상 데이터를 분석하 여 승선자의 객체 인식 영역의 x1, x2, y1, y2에 대해서 중심값 xmid, ymid를 중심으로 한 면이 20 픽셀인 정사 각형의 네 꼭짓점이 미리 정의된 소형 선박 선내 영역에서 탈피되었다고 판단할 수 있다. 도 3 내지 도 10은 본 발명의 일 실시예에 따른 영상 시료 데이터의 제작 과정을 설명하기 위한 도면이다. 도 3 내지 도 10을 참조하면, 소형 선박 조난 상황 인지 장치는 복수의 소형 선박 각각에 형성되어 있는 영상촬영기기로부터 미리 결정된 영상 시료 시나리오에 해당하는 영상 시료 데이터를 수신할 수 있다. 이때, 영상 시료 시나리오는 도 3의 복수의 소형 선박 중 일반 보트에서 계측 보트로 이동하면서 배에 탑승하는 동작 및 조난되는 상황을 포함할 수 있다. 도 4(a)와 같이 소형 선박 조난 상황 인지 장치는 승선자가 일반 보트에서 계측 보트로 이동한 후 특정 시 간(예를 들어, 10분)이 경과하면 계측 보트에서 일반 보트로 이동하는 영상 시료 시나리오에 해당하는 영상 시 료 데이터를 수신할 수 있다. 또한, 도 4(b)와 같이 소형 선박 조난 상황 인지 장치는 승선자가 일반 보트에서 계측 보트로 이동한 후 좌측 방향 및 우측 방향으로 위치를 이동하고, 특정 시간이 경과된 후 승선자가 계측 보트에서 일반 보트로 이 동하는 영상 시료 시나리오에 해당하는 영상 시료 데이터를 수신할 수 있다. 또한, 도 5(a)와 같이 소형 선박 조난 상황 인지 장치는 승선자가 일반보트에서 계측보트로 이동한 후 앉 는 행동을 취하며, 특정 시간이 경과한 후 승전자가 계측보트에서 일반 보트로 이동하는 영상 시료 시나리오에 해당하는 영상 시료 데이터를 수신할 수 있다. 또한, 도 5(b)와 같이 소형 선박 조난 상황 인지 장치는 제1 승선자와 제2 승선자가 일반보트에서 계측보 트로 이동한 후 특정 시간이 경과 하면 제1 승선자가 계측 보트에서 일반 보트로 이동하는 영상 시료 시나리오 에 해당하는 영상 시료 데이터를 수신할 수 있다. 또한, 도 6과 같이 소형 선박 조난 상황 인지 장치는 제1 승선자 및 제2 승선자가 일반 보트에서 계측 보 트로 이동한 후 제2 승선자가 제1 승선자의 뒤로 이동하며 특정 시간이 경과한 후 제2 승선자가 계측 보트에서 일반 보트로 이동하는 영상 시료 시나리오에 해당하는 영상 시료 데이터를 수신할 수 있다. 이러한 영상 시료 시나리오에서 제1 승선자 및 제2 승선자가 일반 보트에서 계측 보트로 이동한 후 제2 승선자가 제1 승선자의 뒤 로 이동하기 때문에 영상 시료 데이터에서 제1 및 제2 승선자가 겹쳐보이게 된다. 또한, 도 7(a)와 같이 소형 선박 조난 상황 인지 장치는 영상 시료 제작부는 제1 승선자 및 제2 승선 자가 일반 보트에서 계측 보트로 이동한 후 서로 교차하며 특정 시간 동안 주기적으로 위치를 이동하며, 특정 시간 이후 제1 승선자가 계측 보트에서 일반 보트로 이동하는 영상 시료 시나리오에 해당하는 영상 시료 데이터 를 수신할 수 있다. 또한, 도 7(b)와 같이 소형 선박 조난 상황 인지 장치는 제1 승선자 및 제2 승선자가 일반 보트에서 계측 보트로 이동한 후 제1 승선자가 계측 보트에서 좌측 방향 및 우측 방향으로 위치를 이동하며, 특정 시간 경과 후(예를 들어, 10분) 제2 승선자가 계측 보트에서 일반 보트로 이동하는 영상 시료 시나리오에 해당하는 영상 시료 데이터를 수신할 수 있다. 또한, 도 8(a)와 같이 소형 선박 조난 상황 인지 장치는 제1 승선자, 제2 승선자 및 제3 승선자가 일반 보 트에서 계측 보트로 이동하며, 특정 시간 경과 후(예를 들어, 10분) 제1 승선자가 계측 보트에서 일반 보트로 이동하는 영상 시료 시나리오에 해당하는 영상 시료 데이터를 수신할 수 있다. 또한, 도 8(b)와 같이 소형 선박 조난 상황 인지 장치는 제1 승선자, 제2 승선자 및 제3 승선자가 일반 보 트에서 계측 보트로 이동하며, 주기적으로 서로 교차하며 위치를 이동하다가 특정 시간(예를 들어, 10분) 이후 에 제1 승선자가 계측 보트에서 일반 보트로 이동하는 영상 시료 시나리오에 해당하는 영상 시료 데이터를 수신 할 수 있다. 또한, 도 9와 같이 소형 선박 조난 상황 인지 장치는 제1 승선자, 제2 승선자 및 제3 승선자가 일반 보트 에서 계측 보트로 이동하며, 제3 승선자가 좌측 방향 및 우측 방향으로 위치를 이동하다가 특정 시간(예를 들어, 10분) 이후 제3 승선자가 계측 보트에서 일반 보트로 이동하는 영상 시료 시나리오에 해당하는 영상 시료 데이터를 수신할 수 있다. 도 10은 상기와 같은 도 4 내지 도 9의 영상 시료 시나리오에 해당하는 영상 시료 데이터를 나타낸다. 도 11 및 도 12는 본 발명의 일 실시예에 따른 데이터 구축 과정을 설명하기 위한 도면이다. 도 11 및 도 12를 참조하면, 승선자의 영상 데이터로부터 배경과 사람의 구분을 통한 분류와 함께 승선자의 동 선을 지속적으로 추적하여 조난상황 발생 시 인지할 수 있는 딥러닝 기반 알고리즘의 제작을 위해서는 대량의 이미지 데이터셋의 구축이 필요하다. 이를 위해, 소형 선박 조난 상황 인지 장치는 영상 공유 서버 또는 사용자 단말로부터 영상 데이터를 수신 하면, 도 11과 같이 영상 데이터에서 승선자와 관련된 인공 지능 전이 학습용 이미지를 추출한다. 그 후, 소형 선박 조난 상황 인지 장치는 YOLO-V3에 적용할 수 있도록영상 데이터 내부의 객체의 위치 정 보를 생성해주는 라벨링 프로그램을 이용하여 인공 지능 전이 학습용 이미지에 각각의 .xml형식의 커스텀 데이 터 셋을 생성한다. 이때, 인공 지능 전이 학습용 이미지에 각각의 .xml형식의 커스텀 데이터 셋은 도 12와 같다. 도 13 내지 도 16은 본 발명의 일 실시예에 따른 객체 검출 추적 과정을 설명하기 위한 도면이다. 도 13 내지 도 16을 참조하면, 본 발명은 소형 선박에 설치되는 영상촬영기기를 이용해 선박 승선자의 추가적인 장치의 장비를 필요 없이 실시간으로 수상 안전사고 발생 상황을 인지할 수 있게 하도록 기존 비전 알고리즘보 다 영상 인식과 관련된 문제에서 좋은 성능을 보여주는 딥러닝을 사용하였다. 특히, 객체 탐지 딥러닝 기법은 크게 1-stage detector와 2-stage detector로 나뉘는데, 각 기법은 [표 1]와 같이 장단점을 보유하고 있다. 따라서, 2-stage detector인 Fast-RCNN과 1-stage detector인 YOLO V3 딥러닝 모델 중 실시간으로 영상에서 객체를 탐지하는 능력이 우수한 YOLO V3 딥러닝 모델을 채택하여 사용하였다.[표 1]"}
{"patent_id": "10-2022-0025463", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "객체 추적 검출 모델의 성능은 mAP(mean Average Precision)로 측정되는데, 이는 ms당 객체 추적 정확도를 의미 함. 따라서 mAP가 높을수록 실시간 객체 추적 성능이 좋다고 평가할 수 있으며 채택한 YOLO V3 딥러닝 모델은 도 13과 같이 1-stage detector 중 가장 높은 mAP 성능을 보여준다. 탐색 및 추적 알고리즘의 기능은 다음과 같은 세 가지 기능 조건들을 충족해야 한다. 첫째, 최대 3명의 승선자 를 인지해야 한다. 둘째, 최소 10분의 시간 동안 승선자의 지속적인 추적이 가능해야 한다. 셋째, 승선자가 이 동하면서 다른 승선자와 겹쳐지는 겹쳐짐(Occluding) 문제 상황이 발생하여도 지속해서 추적헤애 한다. 따라서, 각 기능 조건들을 충족하기 위해 YOLO V3 딥러닝 모델에 커스텀 데이터셋을 이용한 전이학습을 통해 승 선자 인지 성능을 향상시키고, 추적 중인 객체가 겹쳐지는 겹쳐짐 문제를 회피할 수 있는 방법을 사용하였다. 본 발명은 YOLO V3 딥러닝 모델에 커스텀 데이터 셋을 학습에 8(4,560장), 시험에 2(1,140장)의 비율로 전이 학 습하여 승선자 인지 성능을 향상시킨다. 이때, 학습에 사용된 데이터셋(4,560장)이 학습에 이용될 때에는 반전, 크롭(Crop), 회전의 Data augmentation이 랜덤으로 적용되어 두 배로 증가되어 사용된다(총 9,120장). 도 14의 에포크(epoch) 당 loss 그래프와 같이 전이 학습은 에포크가 1469회였을 때까지 학습되었다. 학습 결과 loss 값이 0.2953에 수렴하였으며 시험(validation) 정확도가 99.79%임을 확인할 수 있었다. 이는 오버피팅 (Over fitting)이 발생할 위험성이 생기면 학습이 중단되는 Early Stopping 기법을 이용한 학습 결과이다. 전이학습 없이 오픈소스로 제공되는 YOLO V3 딥러닝 모델의 영상 시료 데이터에 대한 정확도(mAP)는 77.38%이며, 커스텀 데이터셋으로 전이 학습 시킨 YOLO V3 딥러닝 모델의 영상 시료에 대한 정확도는 99.79%로 정확도가 22.41% 향상되었다. 커스텀 데이터 셋에 대한 추가 전이학습 없이 오픈소스로 제공되는 YOLO V3 딥러닝 모델로 객체 추적을 임시 시 험 영상으로 시험해본 결과 중 일부는 도 15(a)와 같다. 구축한 커스텀 데이터 셋으로 전이학습 시킨 YOLO V3 딥러닝 모델의 객체 추적을 임시 시험 영상으로 시험해본 시험결과 중 일부는 도 15(b)와 같다. 이때, 전이학습 과정에서 인식하도록 설정한 클래스를 사용자만으로 지정했기 때문에 사용자에 대한 클래스만 인식할 수 있다. 본 발명의 일 실시예에 따른 소형 선박 조난 상황 인지 장치는 영상 시료 데이터의 각각의 프레임에 대해 서 객체를 인지하고 객체가 무엇인지 인지한 후 정확한 위치를 확인하는 과정을 수행하여 객체 검출을 실행하여 객체 인지 영역을 생성한다. 만일, 소형 선박 조난 상황 인지 장치는 현재 프레임에서 검출된 객체 인지 영역 및 이전 프레임에서 검출된 객체 인지 영역을 비교하여 겹쳐지면 객체 인지 과정을 중단한 후 겹쳐지는 상 황이 종료되면 객체 인지 과정을 계속 실행한다. 본 발명에서는 상기와 같은 현재 프레임에서 검출된 객체 인지 영역 및 이전 프레임에서 검출된 객체 인지 영역 이 겹쳐지는 겹쳐짐(Occluding) 문제를 해결하기 위해 YOLO V3 딥러닝 모델에 Deep SORT 스테이지를 추가해 인 지 성능을 기반으로 객체 추적을 실행한다. 도 16(a)와 같이 YOLO V3 딥러닝 모델을 이용한 객체 인지는 영상 데이터 속 인지되는 모든 사용자 클래스에 대 해서 인지하는 반면 도 16(b)와 같이 Deep SORT를 이용한 객체 추적은 같은 객체라고 추적되면 중복으로 추적되 지 않는 차이점을 가진다. 이는 각 프레임마다 객체를 인지하기 때문에 각각의 프레임이 영향을 주지 않는 독립적인 작동 방식을 가진 YOLO V3 딥러닝 모델과 다르게 Deep SORT기법은 하나의 프레임에서 인지된 객체에 식별자를 부여하고 해당 객체 인식 영역 정보를 이용해 다음 프레임에서의 객체 속도를 칼만 필터(Kalman Filter)로 추정하여 위치를 예측하면서 각 프레임이 상호작용하는 방식으로 작동하기 때문이다. 만일, 소형 선박 조난 상황 인지 장치는 Deep SORT에 따라 칼만 필터를 이용해 추적 중인 객체가 영상 속 에서 소실될 경우, 해당 객체의 식별자에 대한 객체 인식 영역 정보는 대기 상태로 추적이 보류되어있다가 대기 상태가 지속 되면 완전 소실로 판단되어 사용자의 식별자와 관련 정보가 삭제된다. 상기와 같이, 소형 선박 조난 상황 인지 장치는 추적되는 객체에 식별자가 부여되고 소실될 때까지 칼만 필터를 이용하여 위치 예측 과정이 재귀적으로 반복되며 객체를 추적한다. 도 17 내지 도 19는 본 발명의 일 실시예에 따른 소형 선박 조난 상황 인지 과정을 설명하기 위한 도면이다. 도 17 내지 도 19를 참조하면, 소형 선박 조난 상황 인지 장치는 소형 선박의 영상촬영기기로부터 수신된 영상 데이터를 분석하여 조난 상황이 발생하였는지 여부를 인지한다. 이를 위해, 소형 선박 조난 상황 인지 장 치는 소형 선박의 선내 영역, 승선자 선내 영역 탈피 조건을 미리 정의해야 한다. 일 실시예에서, 소형 선박 조난 상황 인지 장치는 소형 선박의 선내 영역을 정의한다. 예를 들어, 소형 선 박 조난 상황 인지 장치는 도 17과 같이 YOLACT 모델의 인스턴스 세그멘테이션 기법을 통해 소형 선박의 선내 영역을 정의한다. 이는 딥러닝 기반 소형 선박 조난 상황 인지 시스템이 다양한 선박에서 사용될 변수를 고려할 때 영상 데이터를 획득하는 각도와 선내 영역의 형태가 개발 환경과 다르더라도 작동할 수 있도록 하기 위해서이다. 다른 일 실시예에서, 소형 선박 조난 상황 인지 장치는 승선자 선내 영역 탈피 조건을 정의한다. 먼저, 소형 선박 조난 상황 인지 장치는 딥러닝 기반 소형 선박 조난 상황 인지 시스템의 작동 시 입력하 는 탑승 인원수보다 Deep SORT에서 승선자를 추적할 때 생성되는 객체의 식별자의 수가 특정 시간(예를 들어, 100 프레임(즉, 약 3초)) 동안 일치하지 않으면 탈피로 결정하도록 승선자 선내 영역 탈피 조건을 정의한다. 또한, 도 18과 같이 소형 선박 조난 상황 인지 장치는 선내 영역에 있는 승선자의 객체 인지 영역에 대해 서 중심값을 중심으로 한 명이 특정 픽셀(예를 들어, 20 pixel)인 정사각형의 네 꼭짓점이 미리 정의된 선내 영 역을 벗어난 후 특정 시간(예를 들어, 100 프레임(즉, 약 3초)) 이 경과하면 탈피로 결정하도록 승선자 선내 영 역 탈피 조건을 정의한다. 그 후, 소형 선박 조난 상황 인지 장치는 소형 선박의 영상촬영기기로부터 수신된 영상 데이터를 분석하여 미리 정의된 승선자 선내 영역 탈피 조건을 벗어났는지 여부를 판단하고, 판단 결과에 따라 조난 상황이 발생하 였는지 여부를 판단한다. 일 실시예에서, 소형 선박 조난 상황 인지 장치는 소형 선박의 영상촬영기기로부터 수신된 영상 데이터를 분석하여 탑승 인원수 및 Deep SORT에서 승선자를 추적할 때 생성되는 식별자의 수를 비교하여 일치하는지 여부 를 확인하고, 확인 결과에 따라 탑승 인원수 및 Deep SORT에서 승선자를 추적할 때 생성되는 식별자의 수가 상 이한 시간을 측정하여 특정 시간을 경과하면 승선자 선내 영역 탈피 조건을 만족하였다고 판단한다. 다른 일 실시예에서, 소형 선박 조난 상황 인지 장치는 소형 선박의 영상촬영기기로부터 수신된 영상 데이 터를 분석하여 승선자의 객체 인지 영역에 대해서 중심값을 중심으로 한 면이 특정 픽셀인 정사각형의 네 꼭짓 점이 미리 정의된 선내 영역을 벗어나는지 여부를 확인한다. 상기의 실시예에서, 소형 선박 조난 상황 인지 장치는 승선자의 객체 인지 영역에 대해서 중심값을 중심으 로 한 면이 특정 픽셀인 정사각형의 네 꼭짓점이 미리 정의된 선내 영역을 벗어나면 정사각형의 네 꼭짓점이 미 리 정의된 선내 영역을 벗어나면 정사각형의 네 꼭짓점이 미리 정의된 선내 영역을 벗어나는 시간을 측정하여 특정 시간을 경과하면 승선자 선내 영역 탈피 조건을 만족하였다고 판단한다. 예를 들어, 소형 선박 조난 상황 인지 장치는 소형 선박의 영상촬영기기로부터 수신된 영상 데이터를 분석 하여 승선자의 객체 인지 영역의 x1, x2, y1, y2에 대해서 중심값 xmid, ymid를 중심으로 한 면이 20 픽셀인 정 사각형의 네 꼭짓점이 미리 정의된 소형 선박 선내 영역에서 탈피되었다고 판단할 수 있다. 상기와 같이, 미리 정의된 승선자 선내 영역 탈피 조건을 기초로 승선자 객체를 선내 영역 탈피 상태로 인식 시 조난상황 알림을 발생한다. 조난상황 알림은 도 19와 같이 딥러닝 기반 소형 선박 조난 상황 인지 시스템의 화 면 우측 상단에 표시된다. 이때, 도 19(a)는 조난 상황 발생 전에 해당하는 딥러닝 기반 소형 선박 조난 상황 인지 시스템의 화면이고, 도 19(b)는 조난 상황 발생 후에 해당하는 딥러닝 기반 소형 선박 조난 상황 인지 시스템의 화면이다. 조난상황 알 림은 도 19(b)와 같이 딥러닝 기반 소형 선박 조난 상황 인지 시스템의 화면 우측 상단에 표시된다. 도 20 및 도 21은 본 발명의 일 실시예에 따른 딥러닝 기반 소형 선박 조난 상황 인지 시스템의 계측 화면을 설 명하기 위한 도면이다. 도 20 및 도 21을 참조하면, 딥러닝 기반 소형 선박 조난 상황 인지 시스템의 계측 화면은 계측 시스템이 영상 데이터의 승선 인원수를 추적한 값이 표시되는 영역(A), 조난상황이 발생하였을 때, 조난상황 발생 알림을 확인 할 수 있는 영역(B), 영상 데이터(C) 및 Ground Truth, 계측 시스템이 영상데이터 속 승선자를 인식하는 영역 (D)를 포함한다. 소형 선박 조난 상황 인지 장치는 영상 데이터에 대해서 제1 프레임을 기준으로 로우 데이터에 대한 로그 를 {frame}, {label}, {x1}, {x2}, {y1}, {y2}, {alert}의 형식으로 기록하며 시스템 구동 완료 후 .csv 형식 으로 저장한다. 이때, 시스템 로그 파일의 구성은 도 21과 같다. 도 21과 같은 시스템 로그 파일은 frame, label, x1, x2, y1, y2 및 alert를 포함한다. 이때, frame은 로그 정렬의 기준(영상데이터의 시간 흐름 순으로 정렬됨)을 의미하고, label은 추적되는 승선자가 해당 프레임에서 식별되는 식별자를 의미한다. 예를 들어, 1번 프레임에서는 식별자가 1로 지정된 1명의 승선자가 인식되었고, 4번 프레임에서는 식별자가 1과 2로 각각 지정 된 2명의 승선자가 인식되었다. x1, x2, y1, y2은 인식된 승선자의 해당 프레임에서 승선자의 객체 인식 영역의 좌표를 의미하고, alert는 조난 상황 알림 발생 여부를 의미한다. 예를 들어, 도 21에서는 9번 프레임에서 식별자가 3인 승선자가 조난되어 알 림이 발생한 것을 의미한다. 도 22 내지 도 24는 본 발명의 일 실시예에 따른 딥러닝 기반 소형 선박 조난 상황 인지 시스템의 시험 및 평가 과정을 설명하기 위한 도면이다. 도 22 내지 도 24를 참조하면, 딥러닝 기반 소형선박 조난 상황 인지 시스템에 대한 시험 및 평가는 정량 목표 인 ‘탐색정확도’와 ‘탐색유지시간’그리고 ‘인지정확도’의 도달수준을 달성하는지 평가할 수 있는 영상 시 료 데이터를 이용하여 평가하였다. 탐색정확도는 계측 화면 상단에 표시되는 ‘추적 인원수’ 변수가 영상데이터 속 실제 승선 인원수(1인~3인)와 일치하는지를 기준으로 평가하였으며, 탐색정확도는 아래의 [수학식 1]에 따라 산출되며 탐색정확도의 적합 여 부 판단을 위한 계측 화면은 도 22와 같다. 도 22(a)는 추적 인원수가 2명이고 실제 승선 인원수가 2명으로 동 일하여 탐색 정확도가 적합한 화면이고, 도 22(b)는 추적 인원수가 2명이고 실제 승선 인원수가 3명으로 상이하 여 탐색 정확도가 비적합한 화면이다. [수학식 1]"}
{"patent_id": "10-2022-0025463", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "탐색 유지 시간은 계측 화면의 영상데이터에서 확인할 수 있는 모든 승선자의 예측된 객체 인식 영역으로 추적 될 때 지속해서 추적되는지를 기준으로 평가하였다. 탐색 유지 시간은 추적이 시작되었을 때부터 추적이 중단되 는 시점까지를 측정하였다. 예를 들어, 10min 재생 길이의 시료에서 제1 승선자의 추적이 0min~3min 동안 지속 후 1min 동안 중단되었다가 4min~10min까지 재추적되었다면 탐색유지시간은 3min으로 평가하였다. 각 측정 시료에 대해 시험 평가에 사용되 는 탐색유지시간은 하기의 [수학식 2]과 같이 계산된다. [수학식 2]"}
{"patent_id": "10-2022-0025463", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 4, "content": "도 23은 탐색유지시간의 적합 여부 판단을 위한 도면이다. 도 23(a)에서 #1 프레임 내지 #3 프레임의 경우 추적 인원수와 승선 인원수가 일치하기 때문에 탐색 유지 시간이 적합하고, 도 23(b)에서 #1 프레임 및 #3 프레임의 경우 추적 인원수와 승선 인원수가 일치하지만 #2 프레임의 경우 추적 인원수와 승선 인원수가 상이하여 탐색 유지 시간이 빚 적합하다. 인지정확도는 계측 화면에서 추적하던 대상이 계측 선박 영역 밖으로 나가게 되는 조난상황이 발생하였을 때, 이를 인지하고 응답하는 생성하는 여부를 기준으로 평가하였다. 인지정확도는 하기의 [수학식 3]과 같이 계산된 다. [수학식 3]"}
{"patent_id": "10-2022-0025463", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 5, "content": "도 24는 인지 정확도의 적합 여부 판단을 위한 도면이다. 도 24(a)에서 #1 및 #2는 조난 상황 발생 후 조난 상 황 발생 알림이 생성되어 인지정확도가 적합하고, 도 24(b)에서 #1 및 #2는 조난 상황이 발생하지 않았는데 조 난 상황 발생 알림이 생성되어 인지정확도가 적합하지 않고, 도 24(c)에서 조난 상황이 발생하였지만 조난 상황 발생 알림이 생성되지 않아 인지정확도가 적합하지 않다. 한정된 실시예와 도면에 의해 설명되었으나, 본 발명은 상기의 실시예에 한정되는 것은 아니며, 이는 본 발명이 속하는 분야에서 통상의 지식을 가진 자라면 이러한 기재로부터 다양한 수정 및 변형이 가능하다. 따라서, 본 발명 사상은 아래에 기재된 특허청구범위에 의해서만 파악되어야 하고, 이의 균등 또는 등가적 변형 모두는 본 발명 사상의 범주에 속한다고 할 것이다."}
{"patent_id": "10-2022-0025463", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 딥러닝 기반 소형 선박 조난 상황 인지 시스템을 설명하기 위한 네트워크 구성도이다. 도 2는 본 발명의 일 실시예에 따른 소형 선박 조난 상황 인지 장치의 내부 구조를 설명하기 위한 블록도이다. 도 3 내지 도 10은 본 발명의 일 실시예에 따른 영상 시료 데이터의 제작 과정을 설명하기 위한 도면이다. 도 11 및 도 12는 본 발명의 일 실시예에 따른 데이터 구축 과정을 설명하기 위한 도면이다. 도 13 내지 도 16은 본 발명의 일 실시예에 따른 객체 검출 추적 과정을 설명하기 위한 도면이다. 도 17 내지 도 19는 본 발명의 일 실시예에 따른 소형 선박 조난 상황 인지 과정을 설명하기 위한 도면이다. 도 20 및 도 21은 본 발명의 일 실시예에 따른 딥러닝 기반 소형 선박 조난 상황 인지 시스템의 계측 화면을 설 명하기 위한 도면이다. 도 22 내지 도 24는 본 발명의 일 실시예에 따른 딥러닝 기반 소형 선박 조난 상황 인지 시스템의 시험 및 평가 과정을 설명하기 위한 도면이다."}
