{"patent_id": "10-2021-0111736", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0029351", "출원번호": "10-2021-0111736", "발명의 명칭": "농작물 재배 면적 및 생육 상태 관측을 위한 항공 영상 촬영 및 분석 방법", "출원인": "농업회사법인 주식회사 제주천지", "발명자": "송진영"}}
{"patent_id": "10-2021-0111736", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "항공영상 수집 단계;상기 수집된 영상에 벡터레이어를 추가하는 단계;상기 벡터레이어가 추가된 이미지에서 샘플이미지를 추출하는 단계; 및 상기 추출된 이미지를 라벨링 하는 단계를 포함하는 항공영상을 통한 농작물의 관측조사 방법."}
{"patent_id": "10-2021-0111736", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서, 상기 항공영상 수집 단계는 유무인기나 인공위성영상을 가로-세로의 중첩도를 30 % 이하 범위에서 영상을 확보하는 것을 특징으로 하는 항공영상을 통한 농작물의 관측조사 방법."}
{"patent_id": "10-2021-0111736", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항 또는 제2항에 있어서, 상기 항공영상 수집 단계는 유무인기나 인공위성영상을 가로-세로의 중첩도를 10-20 % 범위에서 영상을 확보하는 것을 특징으로 하는 항공영상을 통한 농작물의 관측조사 방법."}
{"patent_id": "10-2021-0111736", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 방법은 샘플데이터를 생성하는 중, 필지내에 포함되게 하고, 필지내 농작물 외의 장애물을 회피하기 위해, 작위적으로 샘플데이터 추출 위치를 이동시키는 방법."}
{"patent_id": "10-2021-0111736", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 수집된 항공영상에 벡터레이어를 추가하는 단계는 필지별 정보를 이미지상 병합하는 단계이고, 필지별 정보 수집의 기본 단위로서 활용되는 방법."}
{"patent_id": "10-2021-0111736", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 벡터레이어가 추가된 이미지에서 샘플이미지를 추출하는 단계는 지적도 내에서 가로-세로길이가 가장 긴 내변의 직선이 교차하는 부분에서 원하는 크기로 샘플이미지를 추출하는 단계인 방법."}
{"patent_id": "10-2021-0111736", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 상기 방법은 항공이미지를 획득하는 단계에서, 확보된 영상이 2장이상의 영상이 확보되는경우, 즉 필지 면적이 넓은 경우에 샘플이미지가 다수 발생하는 특징을 갖고 있어서 필지당 샘플이미지가 다수발생하여, 유의성 및 정확도를 향상하는 방법."}
{"patent_id": "10-2021-0111736", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 방법은 샘플이미지를 통한 농작물의 분석을 위해, 농작물 표준 재배 데이터와 현장데이터를 학습데이터로 사용하여 머신러닝을 수행하는 단계를 더욱 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2021-0111736", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 항공영상 수집 단계;상기 수집된 영상에 벡터레이어를 추가하는 단계;상기 벡터레이어가 추가된 이미 지에서 샘플이미지를 추출하는 단계; 및 상기 추출된 이미지를 라벨링 하는 단계를 포함하는 항공영상을 통한 농 작물의 관측조사 방법에 관한 것으로, 기존의 다양한 방법들에 비해 상대적으로 신속하고, 유의적인 수준의 농작 물재배면적 산출 및 생육상태, 출하량 등의 농산물 정보를 예측할 수 있다."}
{"patent_id": "10-2021-0111736", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 농작물 재배 면적 및 생육 상태 관측을 위한 항공 영상 촬영 및 분석 방법에 관한 것이다."}
{"patent_id": "10-2021-0111736", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인류는 지표상의 다양한 정보를 수집하기 위해, 유무인기와 인공위성을 통해.다양한 영상을 촬영하고 있으며, 이러한 영상 중에는 가시광선 영역을 촬영하는 RGB영상, 특정반사파장을 측정하는 다분광 영상, 지상의 열온도값을 나타내는 열화상, 다양한 파장의 반사값을 가지는 초분광 영상 등을 있다. 유무인기와 인공위성으로부터 수집되는 영상은 최근 기술 개발로 높은 해상도를 바탕으로 보다 정확한 정보를 수집할 수 있게 되었으며, 여기서 해상도는 영상의 정밀도, 혹은 식별과 직접적으로 관련되며, 해상도의 수준은 수십미터(인공위성)에서부터 1센티미터미만(무인기)까지 영상확보 도구에 따라 다다르다. 무인기로부터 확보되는 고해상도(1센티미터이하 혹은 수센티미터)로서 촬영된 농작물은 지상에서 직접 조사한 수준의 해상도로서 경작지에 개체수나 생육단계(정식기, 성장기, 수확기 등)의 생육 상태를 확인할 수 있다. 현재 분광영상을 통해, 식물의 건강도, 병해충에 대한 원격탐사를 수행하고 있고, 인공지능기술을 도입하여, 재 배면적 산출이나 생산량 예측에 대한 기술이 개발되고 있다. 작물은 생육단계 즉, 유묘기, 생육기, 수확기로 나눌수 있으며, 그에 따라 작물의 잎의 두께, 수분함량, 엽록소 양 등 물리적 특성이 변화된다. [선행특허 문헌] 대한민국 특허공개번호 제10-2017-0138225호"}
{"patent_id": "10-2021-0111736", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기의 필요성에 의하여 안출된 것으로서 본 발명의 목적은 신규한 농작물의 관측조사 방법을 제공하 는 것이다."}
{"patent_id": "10-2021-0111736", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기의 목적을 달성하기 위하여 본 발명은 항공영상 수집 단계; 상기 수집된 영상에 벡터레이어를 추가하는 단계; 상기 벡터레이어가 추가된 이미지에서 샘플이미지를 추출하는 단계; 및 상기 추출된 이미지를 라벨링 하는 단계를 포함하는 항공영상을 통한 농작물의 관측조사 방법을 제공한다. 본 발명의 일 구현예에 있어서, 상기 항공영상 수집 단계는 유무인기나 인공위성영상을 가로-세로의 중첩도를 30 % 이하 범위에서 영상을 확보하는 것이 바람직하고, 상기 항공영상 수집 단계는 유무인기나 인공위성영상을 가로-세로의 중첩도를 10-20 % 범위에서 영상을 확보하는 것이 더욱 바람직하나 이에 한정되지 아니한다. 본 발명의 다른 구현예에 있어서, 상기 방법은 샘플데이터를 생성하는 중, 필지내에 포함되게 하고, 필지내 농 작물 외의 장애물을 회피하기 위해, 작위적으로 샘플데이터 추출 위치를 이동시키는 것이 바람직하나 이에 한정 되지 아니한다. 본 발명의 또 다른 구현예에 있어서, 상기 수집된 항공영상에 벡터레이어를 추가하는 단계는 필지별 정보를 이 미지상 병합하는 단계이고, 필지별 정보 수집의 기본 단위로서 활용되는 것이 바람직하나 이에 한정되지 아니한 다. 본 발명의 또 다른 구현예에 있어서, 상기 벡터레이어가 추가된 이미지에서 샘플이미지를 추출하는 단계는 지적 도 내에서 가로-세로 길이가 가장 긴 내변의 직선이 교차하는 부분에서 원하는 크기로 샘플이미지를 추출하는 것이 바람직하나 이에 한정되지 아니한다. 본 발명의 또 다른 구현예에 있어서, 상기 방법은 항공이미지를 획득하는 단계에서, 확보된 영상이 2장이상의 영상이 확보되는 경우, 즉 필지 면적이 넓은 경우에 샘플이미지가 다수 발생하는 특징을 갖고 있어서 필지당 샘 플이미지가 다수 발생하여, 유의성 및 정확도를 향상하는 것을 특징으로 하나 이에 한정되지 아니한다. 본 발명의 일 구헌예에 있어서, 상기 방법은 샘플이미지를 통한 농작물의 분석을 위해, 농작물 표준 재배 데이 터와 현장데이터를 학습데이터로 사용하여 머신러닝을 수행하는 단계를 더욱 포함하는 것이 바람직하나 이에 한 정되지 아니한다.이하 본 발명을 설명한다. 본 발명은 농작물 재배면적 및 작물 생육 조사를 신속히 완료할 수 있는기술을 제시한다. 즉 필지별(전, 답, 과 수원 등)으로 구별되어 있는 필지상에 실시간(한달내외)으로, 재배되고 있는 농작물을 조사함으로서, 생산량 예 측과 농작물 생육 정보 제공이 가능하다. 기존 방법들은 목표지역 전체 촬영이후 정사영상을 제작하고, 각 필지 에 대한 샘플링 이미지를 통해 작물을 식별하였으나, 본 발명은 정사영상의 제작없이 이미지 샘플링을 자동으로 수행함으로서 이미지 촬영시간을 줄이고, 전체 분석시간이 단축된다. 본 발명은 유무인기나 인공위성으로 부터 농작물의 이미지를 얻고자 할때, 낮은 수준의 가로, 세로 중첩율 (10~20%)로서 확보하고, 정사영상을 제작하지 않고, 필지별 농작물 이미지 수집이 자동으로 수행한다. 본 발명은 필지별 농작물 이미지 수집을 위해, 얻어진 이미지에 필지의 수치지도를 적용하고, 필지내에서 원하 는 크기의 이미지 샘플을 획득하는 단계를 포함한다. 즉 촬영된 이미지내 포함되는 필지에서 중심위치에서 지정 하는 이미지를 잘라내는 기능이고, 또한 얻어진 이미지를 본 발명의 방법으로 처리하는 경우, 동일한 필지내 최 소 2개이상의 샘플 이미지를 확보할 수 있다. 본 발명은 수집된 필지별 농작물 샘플 이미지를 학습데이터로서 활용하기 위해, 목표 작물의 표준 재배하고 필 요한 해상도별로 항공영상을 확보하고, 작물을 식별할 수 있는 분류키를 포함한 학습데이터 어노테이션용 자료 를 구축하여 사용한다."}
{"patent_id": "10-2021-0111736", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명을 통하여 알 수 있는 바와 같이, 본 발명은 지상에 재배되는 농작물을 유무인기나 인공위성으로부터, 발명이 제시하는 방법으로 RGB영상과 다분 광영상, 열화상영상을 수집하고, 이를 발명이 제시하는 방법으로 분석함으로서 기존의 다양한 방법들에 비해 상 대적으로 신속하고, 유의적인 수준의 농작물재배면적 산출 및 생육상태, 출하량 등의 농산물 정보를 예측할 수 있다."}
{"patent_id": "10-2021-0111736", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 비한정적인 실시예를 통하여 본 발명을 더욱 상세하게 설명한다. 단 하기 실시예는 본 발명을 예시하기 위 한 의도로 기재된 것으로서 본 발명의 범위는 하기 실시예에 의하여 제한되는 것으로 해석되지 아니한다. 본 발명에서는 항공영상을 통한 농작물의 관측조사 방법에 관한것이고, 농작물의 생육기간이 짧고, 실시간적 정 보수집이 가능한 경우 다양한 목적으로서 적용가능함으로 효율적인 관측 방법을 제시하며, 주요한 단계는 도 1과 같이 항공영상 수집 단계, 수집된 영상에 벡터레이어(지적정보 등)을 추가하는 단계, 벡 터레이어가 추가된 이미지에서 샘플이미지를 추출하는 단계, 추출된 이미지를 라벨링 하는 단계로 나뉜다. 본 발명에서 항공영상을 획득하는 단계는 도3과 같으며, 유무인기나 인공위성영상을 가로-세로의 중첩도를 10- 20%범위에서 영상을 확보한다. 이는 기존 정사영상제작을 위해서 가로, 세로 70%이상의 중첩도의 항공영상을 수 집하는 것과 차별되며, 촬영시간과 정사영상을 제작하는 시간을 단축할수 있다. 따라서 이러한 항고영상 획득 방법에서, 정사영상을 제작하지 않고 농작물 재배정보를 수집하는 효율적 방안이 된다. 본 발명에서 수집된 항공영상에 벡터레이어(지적정보 등)을 추가하는 단계에서는 도 4의 필지별 정보를 이미지 상 병합하는 단계이며, 다음단계의 필지별 정보 수집의 기본 단위로서 활용된다.본 발명에서 벡터레이어가 추가된 이미지에서 샘플이미지를 추출하는 단계는 도 5와 같이, 지적도내에서 가로- 세로 길이가 가장 긴 내변의 직선이 교차하는 부분에서 원하는 크기(약 실제공간길이 3미터 X 3미터)로서 샘플 이미지를 추출하는 단계이다. 도5에서 \"가\",\"다\" 의 경우는 필지가 장방형인 경우의 실행 예이며, \"나\"의 경우 는 다각형 형태의 필지에 대한 예로서, 극단적으로 모서리를 포함하는 경우, 모서리 안쪽으로 작위적으로 샘플 이미지가 필지내부로 이동하는 알고리즘을 포함되며, \"라\"의 예는 해당 위치에 장애물(농작물이 아닌 인공물 등)이 존재하는 경우 회피하는 기능이며, 지적상의 전, 답, 과수원이 아닌 경우와 농작물이 아닌 경우를 모두 포함한다. 본 발명에서 항공이미지를 획득하는 단계에서, 확보된 영상이 2장이상의 영상이 확보되는 경우, 즉 필지 면적이 넓은 경우, 샘플이미지가 다수 발생하는 특징을 갖고 있어, 단일 필지에 수개의 샘플 이미지가 생성되어, 유의 성이 향상된다. 본 발명에서 샘플이미지를 분석하는 단계에서 농작물의 표준재배 데이터와샘플이미지 자체를 어노테이션 함으로 서 학습데이터로 사용하는 단계를 통해, 머신러닝등을 통한 분석 정확도를 향상하는 것을 포함한다."}
{"patent_id": "10-2021-0111736", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 농작물 정보수집 및 제공 기술 개요도 도 2는 머신러닝을 통한 샘플이미지의 분석 기술 개요도 도 3은 농작물 촬영 방법 (중첩율 포함) 도 4는 획득이미지내 샘플이미지 확인 작업을 나타낸 그림, 도 5는 획득이미지내 샘플이미지 추출 방법 (예 : 가~라)"}
