{"patent_id": "10-2018-0009547", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0090621", "출원번호": "10-2018-0009547", "발명의 명칭": "하천 방사능 측정용 수공양용 드론 및 그 제어방법", "출원인": "한국건설기술연구원", "발명자": "강성원"}}
{"patent_id": "10-2018-0009547", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "원격제어 또는 프로그램 또는 인공지능에 따라 공중과 수상을 선택적으로 주행하도록, 양력을 발생시키는 비행용 프로펠러 및 수면에 부유하는 부유체가 구비되는 자율운행체;상기 자율운행체에 구비되어 수상 주행중 수중 방사능을 측정하는 방사선 센서;상기 자율운행체에 구비되어 수상 주행 중 샘플수를 채취하는 샘플 채취부를 포함하는 하천 방사능 측정용 수공양용 드론을 포함하며,상기 샘플 채취부에서 채취된 샘플수는 상기 부유체 내부에 저장되는 하천 방사능 측정용 수공양용 드론."}
{"patent_id": "10-2018-0009547", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 부유체는,상기 몸체의 하부에 양 측으로 이격되어 한 쌍이 구비되는 하천 방사능 측정용 수공양용 드론."}
{"patent_id": "10-2018-0009547", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 자율운행체는 수면 주행을 위한 수면 주행용 스크류를 더 포함하고, 상기 수면 주행용 스크류는, 상기 부유체의 후측에 수면에 착수시 수중으로 잠기는 부분에 구비되는 하천 방사능 측정용 수공양용 드론."}
{"patent_id": "10-2018-0009547", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 샘플 채취부는,상기 부유체의 내측에 물이 입수되도록 형성되는 하나 이상의 저수조;상기 저수조의 입구를 개페하는 밸브;를 포함하는 하천 방사능 측정용 수공양용 드론."}
{"patent_id": "10-2018-0009547", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 샘플 채취부의 상기 저수조는,착수시 물에 잠기는 상기 부유체의 흘수선 아래측에 형성되는 하천 방사능 측정용 수공양용 드론."}
{"patent_id": "10-2018-0009547", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 샘플 채취부는,상기 몸체에 찰탁 가능하게 구비되며,상기 몸체가 수면에 안착되었을 때 수면 아래에 위치되도록 흘수선 아래까지 연장되는 샘플채취통을 더 포함하며,공개특허 10-2019-0090621-3-상기 샘플채취통은 그 저면과 상기 흘수선의 사이에 물이 입수되도록 형성되는 입수공이 형성되는 하천 방사능측정용 수공양용 드론."}
{"patent_id": "10-2018-0009547", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "착륙지에서 이륙하여 검사목적지인 하천까지 비행하는 비행단계;검사목적지에서 하천의 수면에 착수하는 착수단계;하천의 착수한 지점에서 사전 계획된 경로를 따라 수면위를 항행하는 항행단계;상기 항행단계 중에 설정된 위치 또는 정해진 시간 또는 정해진 간격마다 방사선 센서를 통해 방사능을 측정하는 방사능 측정단계;상기 방사능 측정단계에서 설정치 이상의 측정치가 검출되거나, 또는, 외부에서 신호가 입력되었을 때 하천수의샘플을 채취하는 샘플 채취단계;상기 항행단계 후에 이수하여 착륙지로 복귀하는 복귀비행단계;를 포함하는 하천 방사능 측정용 수공양용 드론의 제어방법."}
{"patent_id": "10-2018-0009547", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 샘플 채취단계에서 샘플을 채취할 때에는, 채취 일시 및 채취 장소의 좌표가 함께 저장되는 하천 방사능측정용 수공양용 드론의 제어방법."}
{"patent_id": "10-2018-0009547", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서,상기 방사능 측정단계에서 측정된 방사능 측정치는 실시간으로 외부로 전송되는 하천 방사능 측정용 수공양용드론의 제어방법."}
{"patent_id": "10-2018-0009547", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 형태에 따르면, 본 발명의 일 형태에 따르면, 원격제어 또는 프로그램 또는 인공지능에 따라 공중 과 수상을 선택적으로 주행하도록, 양력을 발생시키는 비행용 프로펠러 및 수면에 부유하는 부유체가 구비되는 자율운행체, 상기 자율운행체에 구비되어 수상 주행중 수중 방사능을 측정하는 방사선 센서, 상기 자율운행체에 구비되어 수상 주행 중 샘플수를 채취하는 샘플 채취부를 포함하는 하천 방사능 측정용 수공양용 드론을 포함하 며, 상기 샘플 채취부에서 채취된 샘플수는 상기 부유체 내부에 저장되는 하천 방사능 측정용 수공양용 드론이 개시된다."}
{"patent_id": "10-2018-0009547", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 하천 방사능 측정용 수공양용 드론 및 그 제어방법에 관한 것으로서, 보다 상세하게는 실시간으로 하 천의 방사능을 효율적으로 측정하기 위한 하천 방사능 측정용 수공양용 드론 및 그 제어방법에 관한 것이다."}
{"patent_id": "10-2018-0009547", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "우리나라는 하천에서 물을 취수하는 비율이 36.1%로 다른 국가들에 비해 높은 수준이며, 특히 좁은 국토에 많은 인구가 모여 살며 강우의 변동성이 큰 어려운 물관리 조건에서 재난 및 유사시에 대비하여 물안보를 확보하는 것이 절대적으로 필요하다. 한편, 우리나라는 매장 자원이 부족하여 에너지 생산에 소요되는 원료의 대부분을 수입에 의존하고 있으며, 이 또한 대기오염의 우려로 인해 화석연료의 사용을 늘리기에 한계가 있어서, 원자력 발전의 비중이 높다. 체르노빌이나 후쿠시마 사고에서 알 수 있듯이, 중국이나 일본 등의 인근 국가 및 국내 원자력 발전소 등에서 사고가 발생되어 방사능 낙진이 대량으로 발생되는 경우, 계절풍 등에 의한 기류를 타고 우리나라 상공의 대기 가 오염되고, 이러한 낙진이 중력 또는 강우 등에 의해 수원으로 낙하하거나 토양에 낙하한 뒤 수원으로 유입되 어 수계가 오염될 수 있다. 또한, 국내 원자력 발전소에서 사고로 인해 방사성 오염수가 누출되었을 경우, 지하수를 등을 통해 주변 수원으 로 방사능 오염물질이 유입되어 수계오염상황이 초래될 수도 있다. 또한, 남북이 군사적으로 첨예하게 대치하고 있는 대한민국의 특성상 간첩 등에 의한 수계 방사능 오염 테러의 위험이 상존하며, 이러한 테러의 경우, 낙진이 발생되나 폭발이 발생하는 것이 아니므로, 기존의 대기 방사능오염 센서로는 경보 및 대처가 어려운 문제점이 있다. 따라서, 수계 방사능 오염 상황이 발생하였을 때 초기에 초동 대응 조치가 필요하며, 신속한 초동 대응 조치를 위해서 수계 방사능 오염 상황이 발생하였을 때 이를 즉각 인지하고 대처할 수 있는 수중 방사능 측정장치 및 이를 이용한 방사능 오염 대응 시스템의 필요성이 대두된다. 그런데, 하천에서 방사능 측정을 실시간으로 하기 위하여, 하천에 방사능 측정장치를 설치하게 되면, 장마나 폭 우 등에 의해 유실될 수도 있으며, 우기와 건기 등 하천의 유량의 차이가 큰 지역에서는 적절한 수심과 위치에 고정설치하기 어렵다는 문제점이 있다. 또한 수중에서 방사능의 감지는 반경 50cm 내외에 불과하여, 고정된 수중 방사능 감지 센서 만에 의존하여 대규 모 하천이나 저수지, 댐 등에서 방사능의 유입을 초기에 감지하는데 역부족이다. 또한, 수중에 고정 설치된 일 부 센서로부터 수신된 이상신호에 대하여 그 원인을 정확히 파악하고 그 주변의 물을 시료로 채취하여 실험실에 서 보다 정밀한 방사능 준위를 정확히 측정하게 할 수 있는 보완 수단의 필요성이 대두된다."}
{"patent_id": "10-2018-0009547", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점을 해결하기 위한 것으로서, 장마나 폭우 등에 유실될 우려가 없으며, 하천에 고 정설치할 필요가 없는 하천 방사능 측정용 수공양용 드론 및 그 제어방법을 제공하는 것이 과제이다. 본 발명의 과제들은 이상에서 언급한 과제들로 제한되지 않으며, 언급되지 않는 또 다른 과제들은 아래의 기재 로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2018-0009547", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 과제를 해결하기 위하여, 본 발명의 일 형태에 따르면, 원격제어 또는 프로그램 또는 인공지능에 따라 공중과 수상을 선택적으로 주행하도록, 양력을 발생시키는 비행용 프로펠러 및 수면에 부유하는 부유체가 구비되는 자율운행체, 상기 자율운행체에 구비되어 수상 주행중 수중 방사능을 측정하는 방사선 센서, 상기 자 율운행체에 구비되어 수상 주행 중 샘플수를 채취하는 샘플 채취부를 포함하는 하천 방사능 측정용 수공양용 드 론을 포함하며, 상기 샘플 채취부에서 채취된 샘플수는 상기 부유체 내부에 저장되는 하천 방사능 측정용 수공 양용 드론이 개시된다. 상기 부유체는, 상기 몸체의 하부에 양 측으로 이격되어 한 쌍이 구비될 수 있다. 상기 자율운행체는 수면 주행을 위한 수면 주행용 스크류를 더 포함하고, 상기 수면 주행용 스크류는, 상기 부 유체의 후측에 수면에 착수시 수중으로 잠기는 부분에 구비될 수 있다. 상기 샘플 채취부는, 상기 부유체의 내측에 물이 입수되도록 형성되는 하나 이상의 저수조 및 상기 저수조의 입 구를 개페하는 밸브를 포함할 수 있다. 상기 샘플 채취부의 상기 저수조는, 착수시 물에 잠기는 상기 부유체의 흘수선 아래측에 형성될 수 있다. 상기 샘플 채취부는, 상기 몸체에 찰탁 가능하게 구비되며 상기 몸체가 수면에 안착되었을 때 수면 아래애 위치 되도록 흘수선 아래까지 연장되는 샘플채취통을 포함하며, 상기 샘플채취통은 그 저면과 상기 흘수선의 사이에 물이 입수되도록 형성되는 입수공이 형성될 수 있다. 한편, 본 발명의 다른 형태에 따르면, 착륙지에서 이륙하여 검사목적지인 하천까지 비행하는 비행단계, 검사목 적지에서 하천의 수면에 착수하는 착수단계, 하천의 착수한 지점에서 사전 계획된 경로를 따라 수면위를 항행하 는 항행단계, 상기 항행단계 중에 설정된 위치 또는 정해진 시간 또는 정해진 간격마다 방사선 센서를 통해 방 사능을 측정하는 방사능 측정단계, 상기 방사능 측정단계에서 설정치 이상의 측정치가 검출되거나, 또는, 외부 에서 신호가 입력되었을 때 하천수의 샘플을 채취하는 샘플 채취단계, 상기 항행단계 후에 이수하여 착륙지로 복귀하는 복귀비행단계를 포함하는 하천 방사능 측정용 수공양용 드론의 제어방법이 제공된다. 상기 샘플 채취단계에서 샘플을 채취할 때에는, 채취 일시 및 채취 장소의 좌표가 함께 저장될 수 있다. 상기 방사능 측정단계에서 측정된 방사능 측정치는 실시간으로 외부로 전송될 수 있다."}
{"patent_id": "10-2018-0009547", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 하천 방사능 측정용 수공양용 드론의 제어방법에 따르면, 첫째, 드론을 사용하므로, 폭우나 장마철 등을 회피하여 유량이 안정되어 있을 때만 사용할 수 있어 유실의 우려가 적다. 둘째, 수상주행중 수중 방사능 측정을 실시하며, 수상 주행경로를 설정할 수 있어, 건기나 우기 등에 따라 수상 주행경로를 다르게 설정할 수 있어 보다 효과적으로 방사능을 측정할 수 있다. 셋째, 드론으로 샘플을 채취할 수 있어, 보다 편리하고 즉각적인 샘플 채취가 가능한 장점이 있다. 뿐만 아니라, 채취된 샘플수를 실험실등의 지상에서 운용하는 고정밀 방사능 검측 시스템을 이용하여, 보다 정밀하게 분석할 수도 있다."}
{"patent_id": "10-2018-0009547", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과들은 이상에서 언급한 효과들로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 청구범위의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2018-0009547", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 본 발명의 목적이 구체적으로 실현될 수 있는 본 발명의 바람직한 실시예를 첨부된 도면을 참조하여 설명 한다. 본 실시예를 설명함에 있어서, 동일 구성에 대해서는 동일 명칭 및 동일 부호가 사용되며 이에 따른 부가 적인 설명은 생략하기로 한다. 본 실시예에 따른 하천 방사능 측정용 수공양용 드론(이하, 설명의 편의를 위하여 '드론'이라 칭하기로 한다)는 자율운행체와, 방사선 센서, 샘플 채취부를 포함할 수 있다. 상기 자율운행체는 원격제어 또는 기 입력된 프로그램 또는 탑재된 인공지능에 따라 공중을 비행하거나 착수하 여 수면을 주행하는 구성요소로서, 도 1에 도시된 바와 같이, 몸체와 제1암, 비행용 프로펠러, 부유체 및 수상 주행용 스크류를 포함할 수 있다. 상기 몸체는 내부에 배터리(미도시) 및 전자회로기판(미도시) 등 비행을 위한 다수의 부품을 수용하는 구 성요소이다. 그리고, 상기 제1암은 상기 몸체로부터 복수개가 연장되도록 형성될 수 있다. 본 실시예에서는 대각선 방 향으로 4방향으로 연장되는 것을 예로 들어 설명하기로 하며, 본 발명은 상기 제1암의 개수에 의해 한정되 지 아니한다. 그리고, 상기 각 제1암의 말단에는 비행용 프로펠러가 구비될 수 있다. 상기 비행용 프로펠러는 상기 드론이 비행할 때 사용되는 것으로서, 수직방향으로 양력을 발생시키도록 그 회전축이 상하방향으로 설치될 수 있다. 따라서, 상기 비행용 프로펠러의 양력으로서 드론이 이륙할 수 있으며, 각 비행용 프로펠러의 양력의 차이로서 드론의 이동 및 회전 등의 자세제어가 가능하다. 물론, 이러한 부분은 종래의 드론과 유사하므로 자세한 설명은 생략하기로 한다. 상기 부유체는, 상기 몸체의 하측에 구비되며, 착수시 물에 뜨는 재질 또는 부력을 가질 수 있는 형 상과 구조로 이루어질 수 있다. 본 실시예에서는 상기 부유체가 상기 몸체의 하측으로 이격된 위치에 구비되어, 상기 드론이 수면에 착수하였을 때 상기 몸체가 수면에 이격된 위치에서 떠 있도록 지지할 수 있다. 또한, 본 실시예에서 상기 부유체는 상기 몸체를 안정되게 지지하기 위하여, 상기 몸체의 하측 에서 한 쌍이 서로 수평방향으로 이격되어 설치될 수 있다. 또한, 상기 부유체는 드론의 어느 일방향을 길이방향으로 길게 형성될 수도 있다. 물론, 본 발명은 이에 한정된 것은 아니며, 상기 몸체의 하측 일부가 변형되어 부유체를 형성할 수도 있으 며, 상기 부유체가 한 쌍이 아닌 하나 또는 세개 이상의 복수개로 이루어질 수도 있다. 한편, 상기 수상 주행용 스크류는, 상기 드론이 수면에 착수하여 수면 항행을 할 때 추진력을 발생시 키는 것으로서, 상기 부유체의 후측에, 상기 드론이 착수하였을 때 수중에 잠기는 위치에 설치될 수 있다. 물론, 이에 한정된 것은 아니며, 상기 부유체의 물에 잠기지 않는 부분에 설치되더라도 상기 비행용 프로 펠러와 유사하게 공기중에서 회전되어 추진력을 발생시킬 수도 있다. 그리고, 상기 부유체의 하측에는 지면 착륙을 위한 스키드가 구비될 수 있다. 물론, 상기 스키드 외에도 바퀴(미도시) 등이 설치될 수도 있다. 또는 도 2에 도시된 바와 같이, 상기 몸체로부터 별도의 한쌍의 암이 수평방향으로 대칭적으로 연장 되며, 그 말단에 수상 주행용 프로펠러가 설치될 수도 있다. 상기 수상 주행용 프로펠러는 반드시 물 에 잠길 필요는 없으며, 물에 잠기지 않더라도 공기중에서 회전되어 추진력을 발생시킬 수 있다. 상기 수상 주행용 스크류 또는 수상 주행용 프로펠러는 각각 독립적으로 회전되며, 정역회전이 가능 하게 구비되어 상기 수상 주행용 스크류 또는 수상 주행용 프로펠러 한 쌍의 회전력으로서 상기 드론 이 수면에서 항행할 수 있으며, 그 회전력의 차이로서 상기 드론이 회전할 수 있다. 한편, 도 3에 도시된 바와 같이, 상기 몸체에는 방사선 센서 및 GPS 센서, 통신 안테나 및 카메 라가 구비될 수 있다. 상기 방사선 센서는 상기 몸체의 하측에 구비되어 상기 드론이 수면에 착수하였을 때 수중에 잠 기도록 하측으로 연장되어 수중의 방사선을 측정하도록 구비될 수 있다. 상기 방사선 센서는 드론에 탑재되는 특성상 경량화에 유리하도록 CsI 또는 NaI 등의 방사능 센서와 SiPM 또는 PIN diode 등의 광센서를 결 합시킨 센서를 사용할 수 있다. 그리고, GPS 센서는 상기 몸체에 구비되어 상기 몸체가 위치된, 즉 드론이 위치된 지점의 좌표를 인식하도록 구비될 수 있다. 상기 카메라는 상기 드론의 주위를 촬영하도록 구비될 수 있고, 상기 통신안테나는 외부의 제어 신호 및 상기 GPS 센서로 획득한 드론의 위치, 카메라로 촬영한 영상, 방사선 센서로 측정 한 방사능 수치 등을 외부로 전송할 수 있다. 상기 통신 안테나는 외부로부터 신호를 수신하거나, 상기 드론의 신호를 외부로 송신하는 구성요소이 다. 한편, 상기 드론에는 샘플채취부가 구비될 수 있다. 상기 샘플채취부는 상기 드론이 수면 에 착수하여 항행할 때에 샘플목적으로 상기 드론 주변의 소량의 물을 채취하는 구성요소이다. 그리고, 상기 제어부는 기 입력된 프로그램 또는 외부로부터 수신된 제어신호에 따라 상기 드론을 이 륙, 비행, 착수, 수면항행 시키며, 상기 비행용 프로펠러 및 수상 주행용 스크류, 방사선 센서 및 샘플채취부와 통신 안테나 등을 제어하도록 구비될 수 있다. 한편, 상기 샘플채취부는 도 4에 도시된 바와 같이, 상기 부유체의 내부의 흘수선 아래에 위치되어 상기 드론이 수면에 착수하였을 때 물에 잠기는 높이에 형성되는 저수조 및 상기 저수조의 입구를 개폐하는 밸브를 포함할 수 있다. 따라서, 상기 드론이 수면에 착수하였을 때, 상기 제어부의 제어에 의해 밸브가 개방되면 상기 저수조에 샘플수가 유입될 수 있다. 상기 샘플수가 유입되면 상기 밸브를 다시 닫음으로써 상기 샘플수를 보관할 수 있다. 이러한 저수조는 상기 부유체 내에 하나 또는 복수개가 형성될 수 있다. 또한, 도면에 개시되지는 아니하였지만, 상기 저수조내로 샘플수의 유입이 원할하도록, 상기 저수조 내부의 공기를 배출시키는 펌프나 공기배출을 위한 홀 및 홀을 개패하는 밸브가 구비될 수도 있다. 또한, 상기 저수조는 반드시 상기 부유체의 흘수선 하측에 위치되어야 하는 것은 아니며, 흘수선보다 상측에 위치될 수도 있다. 또는, 상기 샘플채취부는 도 3에 도시된 바와 같이, 상기 몸체의 하측에 착탈가능하게 구비되며, 상 기 몸체가 수면에 안착되었을 때 수면 아래에 위치되어 샘플수가 자연스럽게 유입되어 담기는 샘플 채취통 을 더 포함할 수 있다. 또한, 상기 샘플 채취통은 그 저면과 흘수선의 사이에, 물이 상기 샘플 채취통 내부로 유입되도록 채 집공이 형성될 수 있다. 그리고, 상기 채집공은 상기 제어부의 제어를 받아 여닫을 수 있도록 구비되어 채취를 원하는 지점에서 채 취를 수행할 수 있다. 또는, 상기 샘플 채취통을 하부로 승하강 가능하게 구비되어, 샘플 채취를 원하는 지점에서 상기 샘플 채취통을 하강시켜 샘플 채취를 수행할 수 있다. 한편, 이하에서는 전술한 하천 방사능 측정용 수공양용 드론의 제어방법의 일 실시예에 대해서 설명하기로 한다. 본 실시예에 따른 하천 방사능 측정용 수공양용 드론의 제어방법은, 도 5 및 도 6에 도시된 바와 같이, 비행단 계(S110), 착수단계(S120), 항행단계(S130), 방사능 측정단계(S140), 샘플 채취단계(S150) 및 복귀비행단계 (S160)를 포함할 수 있다. 상기 비행단계(S110)는 드론의 착륙지(H)에서 이륙하여 검사 목적지인 하천까지 비행하는 단계이다. 상기 하천이란 사전적 의미 그대로, 육지 표면에서 대체로 일정한 유로를 가지는 유수의 계통을 의미할 수 있으 며, 또는, 호수나 저수지를 포함할 수도 있다. 물론, 해양도 포함할 수 있는 등, 물이 존재하는 곳을 모두 통칭 하는 뜻을 가질 수 있다. 여기서, 상기 드론의 착륙지(H)에는 상기 드론의 충전 및 드론과 통신하면서 드론으로부터 각종 계측치를 전송 받거나 드론을 제어하는 무선 제어시설 등이 구비될 수 있으며, 기지의 외부와 통신할 수 있는 통신시설등 및 상기 드론에서 채취한 샘플수를 정밀 검측할 수 있는 정밀 검측시설등이 구비될 수 있다. 상기 비행단계(S110)는, 착륙지(H)에서 이륙하여 검사목적지인 하천까지 비행하는 단계이다. 이때, 이륙신호는 상기 착륙지(H)에 구비된 무선 제어시설로부터 수신받을 수 있거나 또는 드론의 제어부 에 기 프로그래밍 된 바 대로 정해진 시간에 이륙할 수 있다. 또한, 상기 검사목적지 또한, 상기 무선 제어시설로부터 검사목적지의 좌표를 전송받을수 있거나 또는 상기 드 론의 제어부에 기프로그래밍되어 있을 수도 있다. 상기 비행단계(S110)를 통해 검사목적지까지 비행한 후에는 착수단계(S120)가 수행될 수 있다. 상기 착수단계 (S120)는 비행하던 드론이 하강하여 검사목적지인 하천의 수면에 착수하는 단계이다. 상기 드론이 수면에 착수한 후에는 상기 드론이 수면위를 항행하는 항행단계(S130)가 수행될 수 있다. 상기 항행단계(S130)는 상기 드론이 하천에 착수한 지점에서 사전 계획되어 상기 드론의 제어부(18 0)에 기 프로그래밍된 경로를 따라 수면위를 항행하는 단계일 수 있다. 물론, 기 프로그래밍된 경로 이외에도 상기 착륙지(H)의 무선 제어시설로부터 경로를 전송받아 항행할 수 있다.상기 항행단계(S130)중에 방사능 측정단계(S140)가 수행될 수 있다. 상기 방사능 측정단계(S140)는, 상기 항행단계(S130) 중에 설정된 위치 또는 정해진 시간 또는 정해진 간격마다 드론에 설치된 방사선 센서를 통해 수중 방사능을 측정하는 단계이다. 이렇게 측정된 방사능 측정 정보는 실시간으로 착륙지(H)의 무선 제어시설로 전송되거나 또는 제어부에 기 록될 수 있다. 그리고, 샘플 채취단계(S150)가 수행될 수 있다. 상기 샘플 채취단계(S150)에서는 상기 드론의 샘플채취부 를 통해 하천수를 일부 채취하여 저장하는 단계로서, 저장된 샘플은 착륙지로 되돌아간 뒤에 회수되어 정 밀 계측될 수 있다. 이러한 샘플 채취단계(S150)는, 상기 방사능 측정단계(S140)에서 측정된 결과 설정치 이상의 방사능이 계측되었 거나 또는 외부로부터 신호가 입력되었을 때 수행(S152)될 수 있다. 외부로부터의 신호란, 착륙지(H)의 무선 제어시설 또는 착륙지 외부의 시설 등에서 방사능 노출 경고 등이 전파 되었을 때, 또는 굳이 방사능 노출 경고 등이 전파되지 아니한 평시에도 평시 점검 목적으로 샘플의 필요가 있 어서 송신하는 샘플채취신호일 수 있다. 물론, 이에 한정되지 아니하며, 상기 드론에 샘플채취명령이 기 프로그래밍 되어있는 경우 방사능 측정단 계(S140)에서 설정치 이상의 측정치가 검출되지 않았거나 외부로부터의 신호가 없었어도 샘플을 채취할 수 있다. 상기 샘플 채취단계(S150)에서 샘플을 채취할 때에는, 도 7에 도시된 바와 같이, GPS 센서를 통해 획득한 채취 일시 및 채취장소에 대한 정보가 함께 상기 제어부 저장되거나 상기 착륙지(H)로 전송될 수 있다. 물론, 상기 샘플채취부의 저수조가 복수개일 때에는 각 저수조의 일련번호 별로 채취 일시 및 채취장소에 대한 정보가 입력될 수 있다. 상기와 같은 과정이 종료되어 항행단계(S130)가 끝나면, 상기 드론은 수면으로부터 이수하여 착륙지로 복 귀하는 복귀비행단계(S160)를 수행할 수 있다. 이상과 같이 본 발명에 따른 바람직한 실시예를 살펴보았으며, 앞서 설명된 실시예 이외에도 본 발명이 그 취지 나 범주에서 벗어남이 없이 다른 특정 형태로 구체화 될 수 있다는 사실은 해당 기술에 통상의 지식을 가진 이 들에게는 자명한 것이다. 그러므로, 상술된 실시예는 제한적인 것이 아니라 예시적인 것으로 여겨져야 하고, 이 에 따라 본 발명은 상술한 설명에 한정되지 않고 첨부된 청구항의 범주 및 그 동등 범위 내에서 변경될 수도 있 다."}
{"patent_id": "10-2018-0009547", "section": "도면", "subsection": "도면설명", "item": 1, "content": "아래에서 설명하는 본 출원의 바람직한 실시예의 상세한 설명뿐만 아니라 위에서 설명한 요약은 첨부된 도면과 관련해서 읽을 때에 더 잘 이해될 수 있을 것이다. 본 발명을 예시하기 위한 목적으로 도면에는 바람직한 실시 예들이 도시되어 있다. 그러나, 본 출원은 도시된 정확한 배치와 수단에 한정되는 것이 아님을 이해해야 한다. 도 1은 본 발명의 하천 방사능 측정용 수공양용 드론의 일 실시예를 도시한 사시도; 도 2는 도 1의 다른 실시예를 도시한 사시도; 도 3은 도 1의 몸체를 도시한 측면도; 도 4는 도 1의 부유체를 도시한 측면도; 도 5는 본 발명의 하천 방사능 측정용 수공양용 드론의 제어방법의 일 실시예를 도시한 순서도; 도 6은 도 5에 따라 비행 및 항행하는 드론의 경로를 도시한 도면; 도 7은 드론에 저장되는 측정 데이터 및 샘플채집 데이터의 일 예를 도시한 표 이다."}
