{"patent_id": "10-2019-0130947", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0047434", "출원번호": "10-2019-0130947", "발명의 명칭": "로봇 청소기 및 그의 동작 방법", "출원인": "엘지전자 주식회사", "발명자": "이가민"}}
{"patent_id": "10-2019-0130947", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인공 지능을 통해 구속 상황을 회피하는 로봇 청소기에 있어서,센싱 정보를 획득하는 하나 이상의 센서;상기 로봇 청소기를 주행시키는 주행 모터;학습용 주변 맵으로부터 탈출 경로 팩터들을 추론하는 보상 모델을 저장하는 메모리; 및상기 센싱 정보에 기반하여, 주변 맵을 획득하고, 상기 로봇 청소기의 구속 상황이 인지된 경우, 상기 보상 모델을 이용하여, 상기 주변 맵으로부터, 탈출 경로 팩터들을 결정하고, 결정된 탈출 경로 팩터들에 기반하여, 상기 로봇 청소기를 주행하도록 상기 주행 모터를 제어하는 하나 이상의 프로세서를 포함하는로봇 청소기."}
{"patent_id": "10-2019-0130947", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 탈출 경로 팩터들은 상기 로봇 청소기의 회전 각도, 회전 방향, 전진 거리, 후진 거리 중 하나 이상을 포함하는로봇 청소기."}
{"patent_id": "10-2019-0130947", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 하나 이상의 센서는범퍼 이벤트를 감지하는 범퍼 센서, 3D 데이터를 획득하는 깊이 센서를 포함하고,상기 주변 맵은상기 범퍼 이벤트 및 상기 3D 데이터에 의해 생성되는로봇 청소기."}
{"patent_id": "10-2019-0130947", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 보상 모델은딥 러닝 알고리즘 또는 머신 러닝 알고리즘을 통해 강화 학습된 인공 신경만 기반의 모델이고,상기 강화 학습은 마르코프 결정 과정에 의해 수행되는로봇 청소기."}
{"patent_id": "10-2019-0130947", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 하나 이상의 프로세서는상기 학습용 주변 맵으로부터 상기 보상 모델의 출력 결과로, 탈출 경로 팩터들을 획득하고,획득된 탈출 경로 팩터들에 의해, 상기 로봇 청소기가 구속 상황의 탈출을 성공했는지 여부 및 상기 구속 상황공개특허 10-2021-0047434-3-의 탈출까지 걸리는 탈출 시간을 획득하고,상기 구속 상황의 탈출을 성공했는지 여부 및 상기 탈출 시간 중 하나 이상에 따라 상기 보상 모델에 리워드 또는 패널티를 부여하는로봇 청소기."}
{"patent_id": "10-2019-0130947", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 하나 이상의 프로세서는상기 로봇 청소기가 구속 상황의 탈출에 성공한 경우, 상기 보상 모델에 리워드를 부여하고,상기 로봇 청소기가 구속 상황의 탈출에 실패한 경우, 상기 보상 모델에 패널티를 부여하는로봇 청소기."}
{"patent_id": "10-2019-0130947", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 하나 이상의 프로세서는기 설정된 시간 내에 상기 로봇 청소기가 구속 상황의 탈출에 성공한 경우, 상기 보상 모델에 제1 값의 리워드를 부여하고,상기 기 설정된 시간을 초과하여, 상기 로봇 청소기가 구속 상황의 탈출에 성공한 경우, 상기 보상 모델에 상기제1 값보다 작은 제2 값의 리워드를 부여하는로봇 청소기."}
{"patent_id": "10-2019-0130947", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제2항에 있어서,상기 범퍼 센서는상기 로봇 청소기에 구비된 범퍼에 가해지는 충격량을 측정하고, 충격량이 기 설정된 충격량 이상인 경우, 상기범퍼 이벤트를 생성하고,상기 하나 이상의 프로세서는 상기 범퍼 이벤트의 발생 횟수가 기 설정된 횟수 이상인 경우, 상기 로봇 청소기가 상기 구속 상황이 있는 것으로 판단하는로봇 청소기."}
{"patent_id": "10-2019-0130947", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제2항에 있어서,상기 주행 모터는좌륜을 구동시키는 좌륜 모터 및 우륜을 구동시키는 우륜 모터를 포함하고,상기 하나 이상의 프로세서는상기 회전 각도 및 상기 회전 방향으로 회전하도록, 상기 좌륜 모터 및 상기 우륜 모터를 제어하고,상기 전진 거리 또는 상기 후진 거리만큼 주행하도록 상기 상기 좌륜 모터 및 상기 우륜 모터를 제어하는로봇 청소기."}
{"patent_id": "10-2019-0130947", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "공개특허 10-2021-0047434-4-제3항에 있어서,상기 주변 맵은하나 이상의 장애물을 포함하는로봇 청소기."}
{"patent_id": "10-2019-0130947", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "인공 지능을 통해 구속 상황을 회피하는 로봇 청소기의 동작 방법은하나 이상의 센서를 통해 얻어진 센싱 정보에 기반하여, 주변 맵을 획득하는 단계;상기 로봇 청소기의 구속 상황이 인지된 경우, 학습용 주변 맵으로부터 탈출 경로 팩터들을 추론하는 보상 모델을 이용하여, 상기 주변 맵으로부터, 탈출 경로 팩터들을 결정하는 단계; 및결정된 탈출 경로 팩터들에 기반하여, 상기 로봇 청소기를 주행하도록 상기 로봇 청소기의 주행 모터를 제어하는 단계를 포함하는로봇 청소기의 동작 방법."}
{"patent_id": "10-2019-0130947", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 탈출 경로 팩터들은 상기 로봇 청소기의 회전 각도, 회전 방향, 전진 거리, 후진 거리 중 하나 이상을 포함하는로봇 청소기의 동작 방법."}
{"patent_id": "10-2019-0130947", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 하나 이상의 센서는범퍼 이벤트를 감지하는 범퍼 센서, 3D 데이터를 획득하는 깊이 센서를 포함하고,상기 주변 맵은상기 범퍼 이벤트 및 상기 3D 데이터에 의해 생성되는로봇 청소기의 동작 방법."}
{"patent_id": "10-2019-0130947", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 보상 모델은딥 러닝 알고리즘 또는 머신 러닝 알고리즘을 통해 강화 학습된 인공 신경만 기반의 모델이고,상기 강화 학습은 마르코프 결정 과정에 의해 수행되는로봇 청소기의 동작 방법."}
{"patent_id": "10-2019-0130947", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 학습용 주변 맵으로부터 상기 보상 모델의 출력 결과로, 탈출 경로 팩터들을 획득하는 단계;획득된 탈출 경로 팩터들에 의해, 상기 로봇 청소기가 구속 상황의 탈출을 성공했는지 여부 및 상기 구속 상황의 탈출까지 걸리는 탈출 시간을 획득하는 단계; 및상기 구속 상황의 탈출을 성공했는지 여부 및 상기 탈출 시간 중 하나 이상에 따라 상기 보상 모델에 리워드 또공개특허 10-2021-0047434-5-는 패널티를 부여하는 단계를 더 포함하는로봇 청소기의 동작 방법."}
{"patent_id": "10-2019-0130947", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 로봇 청소기가 구속 상황의 탈출에 성공한 경우, 상기 보상 모델에 리워드를 부여하는 단계; 및상기 로봇 청소기가 구속 상황의 탈출에 실패한 경우, 상기 보상 모델에 패널티를 부여하는 단계를 더 포함하는로봇 청소기의 동작 방법."}
{"patent_id": "10-2019-0130947", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서,상기 리워드를 부여하는 단계는기 설정된 시간 내에 상기 로봇 청소기가 구속 상황의 탈출에 성공한 경우, 상기 보상 모델에 제1 값의 리워드를 부여하는 단계 및상기 기 설정된 시간을 초과하여, 상기 로봇 청소기가 구속 상황의 탈출에 성공한 경우, 상기 보상 모델에 상기제1 값보다 작은 제2 값의 리워드를 부여하는 단계를 포함하는로봇 청소기의 동작 방법."}
{"patent_id": "10-2019-0130947", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제12항에 있어서,상기 범퍼 센서는상기 로봇 청소기에 구비된 범퍼에 가해지는 충격량을 측정하고, 충격량이 기 설정된 충격량 이상인 경우, 상기범퍼 이벤트를 생성하고,상기 동작 방법은상기 범퍼 이벤트의 발생 횟수가 기 설정된 횟수 이상인 경우, 상기 로봇 청소기가 상기 구속 상황이 있는 것으로 판단하는 단계를 더 포함하는로봇 청소기의 동작 방법."}
{"patent_id": "10-2019-0130947", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제12항에 있어서,상기 주행 모터는좌륜을 구동시키는 좌륜 모터 및 우륜을 구동시키는 우륜 모터를 포함하고,상기 주행 모터를 제어하는 단계는상기 회전 각도 및 상기 회전 방향으로 회전하도록, 상기 좌륜 모터 및 상기 우륜 모터를 제어하는 단계 및상기 전진 거리 또는 상기 후진 거리만큼 주행하도록 상기 상기 좌륜 모터 및 상기 우륜 모터를 제어하는 단계를 포함하는로봇 청소기의 동작 방법."}
{"patent_id": "10-2019-0130947", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제13항에 있어서,상기 주변 맵은공개특허 10-2021-0047434-6-하나 이상의 장애물을 포함하는로봇 청소기의 동작 방법."}
{"patent_id": "10-2019-0130947", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 실시 예에 따른 인공 지능을 통해 구속 상황을 회피하는 로봇 청소기는 센싱 정보에 기반하여, 주변 맵을 획득하고, 상기 로봇 청소기의 구속 상황이 인지된 경우, 보상 모델을 이용하여, 상기 주변 맵으로부터, 탈 출 경로 팩터들을 결정하고, 결정된 탈출 경로 팩터들에 기반하여, 상기 로봇 청소기를 주행하도록 주행 모터를 제어할 수 있다."}
{"patent_id": "10-2019-0130947", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 인공 지능을 이용하여, 구속 상황을 회피하는 로봇 청소기에 관한 것이다."}
{"patent_id": "10-2019-0130947", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "로봇 청소기는 사용자의 조작 없이도 청소하고자 하는 구역 내를 스스로 주행하면서 바닥 면으로부터 먼지 등의 이물질을 흡입하여 자동으로 청소하는 인공 지능 장치이다. 이러한 로봇 청소기는 공간의 구조를 인식하여 청소 경로를 설정하고, 설정된 청소 경로를 따라 주행하면서 청 소 동작을 수행한다. 그리고, 로봇 청소기는 정해진 스케줄에 따라 또는 사용자의 명령에 기초하여 청소를 수행 한다. 통상 이러한 로봇 청소기는 청소구역 내에 설치된 가구나 사무용품, 벽 등의 장애물까지의 거리를 감지하고, 그 에 따라 청소구역을 매핑(mapping)하거나, 좌륜과 우륜의 구동을 제어하여 장애물 회피 동작을 수행한다. 그러나, 로봇 청소기는 새로운 구속 상황에 대해서는 능동적으로 대응하지 못하고, 구속되는 상황이 발생한다. 이에 따라, 로봇 청소기가 구속 상황을 감지한 경우, 효과적으로 회피할 수 있는 방법이 필요하다."}
{"patent_id": "10-2019-0130947", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 구속 상황을 감지한 경우, 구속 상황을 회피하기 위해 회피 주행을 수행하는 로봇 청소기의 제공을 목적으로 한다. 본 개시는 구속 상황을 감지한 경우, 최적의 탈출 경로로 회피 주행을 수행하는 로봇 청소기의 제공을 목적으로 한다."}
{"patent_id": "10-2019-0130947", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시 예에 따른 본 개시의 실시 예에 따른 인공 지능을 통해 구속 상황을 회피하는 로봇 청소기는 센싱 정보에 기반하여, 주변 맵을 획득하고, 상기 로봇 청소기의 구속 상황이 인지된 경우, 보상 모델을 이용하 여, 상기 주변 맵으로부터, 탈출 경로 팩터들을 결정하고, 결정된 탈출 경로 팩터들에 기반하여, 상기 로봇 청 소기를 주행하도록 주행 모터를 제어할 수 있다."}
{"patent_id": "10-2019-0130947", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 실시 예에 따르면, 로봇 청소기는 새로운 구속 상황이 감지된 경우라도, 구속 상황을 빠르게 회피하 도록 주행할 수 있다. 본 개시의 실시 예에 따르면, 로봇 청소기는 구속 상황 하에서, 최적의 탈출 경로로 주행함에 따라, 불필요한 전력 소모가 방지되고, 구속 상황에 능동적으로 대처할 수 있다."}
{"patent_id": "10-2019-0130947", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 명세서에 개시된 실시 예를 상세히 설명하되, 도면 부호에 관계없이 동일하거 나 유사한 구성요소는 동일한 참조 번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 이하의 설명 에서 사용되는 구성요소에 대한 접미사 '모듈' 및 '부'는 명세서 작성의 용이함만이 고려되어 부여되거나 혼용 되는 것으로서, 그 자체로 서로 구별되는 의미 또는 역할을 갖는 것은 아니다. 또한, 본 명세서에 개시된 실시 예를 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 명세서에 개시된 실시 예의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 또한, 첨부된 도면은 본 명세서에 개시된 실시 예를 쉽게 이 해할 수 있도록 하기 위한 것일 뿐, 첨부된 도면에 의해 본 명세서에 개시된 기술적 사상이 제한되지 않으며, 본 개시의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소 들은 상기 용어들에 의해 한정되지는 않는다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 어떤 구성요소가 다른 구성요소에 '연결되어' 있다거나 '접속되어' 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 '직접 연결되어' 있다거나 '직접 접속되어' 있 다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. <인공 지능(AI: Artificial Intelligence)> 인공 지능은 인공적인 지능 또는 이를 만들 수 있는 방법론을 연구하는 분야를 의미하며, 머신 러닝(기계 학습, Machine Learning)은 인공 지능 분야에서 다루는 다양한 문제를 정의하고 그것을 해결하는 방법론을 연구하는 분야를 의미한다. 머신 러닝은 어떠한 작업에 대하여 꾸준한 경험을 통해 그 작업에 대한 성능을 높이는 알고리 즘으로 정의하기도 한다. 인공 신경망(ANN: Artificial Neural Network)은 머신 러닝에서 사용되는 모델로써, 시냅스의 결합으로 네트워 크를 형성한 인공 뉴런(노드)들로 구성되는, 문제 해결 능력을 가지는 모델 전반을 의미할 수 있다. 인공 신경 망은 다른 레이어의 뉴런들 사이의 연결 패턴, 모델 파라미터를 갱신하는 학습 과정, 출력값을 생성하는 활성화 함수(Activation Function)에 의해 정의될 수 있다. 인공 신경망은 입력층(Input Layer), 출력층(Output Layer), 그리고 선택적으로 하나 이상의 은닉층(Hidden Layer)를 포함할 수 있다. 각 층은 하나 이상의 뉴런을 포함하고, 인공 신경망은 뉴런과 뉴런을 연결하는 시냅 스를 포함할 수 있다. 인공 신경망에서 각 뉴런은 시냅스를 통해 입력되는 입력 신호들, 가중치, 편향에 대한 활성 함수의 함숫값을 출력할 수 있다. 모델 파라미터는 학습을 통해 결정되는 파라미터를 의미하며, 시냅스 연결의 가중치와 뉴런의 편향 등이 포함된 다. 그리고, 하이퍼파라미터는 머신 러닝 알고리즘에서 학습 전에 설정되어야 하는 파라미터를 의미하며, 학습 률(Learning Rate), 반복 횟수, 미니 배치 크기, 초기화 함수 등이 포함된다. 인공 신경망의 학습의 목적은 손실 함수를 최소화하는 모델 파라미터를 결정하는 것으로 볼 수 있다. 손실 함수 는 인공 신경망의 학습 과정에서 최적의 모델 파라미터를 결정하기 위한 지표로 이용될 수 있다. 머신 러닝은 학습 방식에 따라 지도 학습(Supervised Learning), 비지도 학습(Unsupervised Learning), 강화 학습(Reinforcement Learning)으로 분류할 수 있다.지도 학습은 학습 데이터에 대한 레이블(label)이 주어진 상태에서 인공 신경망을 학습시키는 방법을 의미하며, 레이블이란 학습 데이터가 인공 신경망에 입력되는 경우 인공 신경망이 추론해 내야 하는 정답(또는 결과 값)을 의미할 수 있다. 비지도 학습은 학습 데이터에 대한 레이블이 주어지지 않는 상태에서 인공 신경망을 학습시키 는 방법을 의미할 수 있다. 강화 학습은 어떤 환경 안에서 정의된 에이전트가 각 상태에서 누적 보상을 최대화 하는 행동 혹은 행동 순서를 선택하도록 학습시키는 학습 방법을 의미할 수 있다. 인공 신경망 중에서 복수의 은닉층을 포함하는 심층 신경망(DNN: Deep Neural Network)으로 구현되는 머신 러닝 을 딥 러닝(심층 학습, Deep Learning)이라 부르기도 하며, 딥 러닝은 머신 러닝의 일부이다. 이하에서, 머신 러닝은 딥 러닝을 포함하는 의미로 사용된다. <로봇(Robot)> 로봇은 스스로 보유한 능력에 의해 주어진 일을 자동으로 처리하거나 작동하는 기계를 의미할 수 있다. 특히, 환경을 인식하고 스스로 판단하여 동작을 수행하는 기능을 갖는 로봇을 지능형 로봇이라 칭할 수 있다. 로봇은 사용 목적이나 분야에 따라 산업용, 의료용, 가정용, 군사용 등으로 분류할 수 있다. 로봇은 액츄에이터 또는 모터를 포함하는 구동부를 구비하여 로봇 관절을 움직이는 등의 다양한 물리적 동작을 수행할 수 있다. 또한, 이동 가능한 로봇은 구동부에 휠, 브레이크, 프로펠러 등이 포함되어, 구동부를 통해 지 상에서 주행하거나 공중에서 비행할 수 있다. <자율 주행(Self-Driving)> 자율 주행은 스스로 주행하는 기술을 의미하며, 자율 주행 차량은 사용자의 조작 없이 또는 사용자의 최소한의 조작으로 주행하는 차량(Vehicle)을 의미한다. 예컨대, 자율 주행에는 주행중인 차선을 유지하는 기술, 어댑티브 크루즈 컨트롤과 같이 속도를 자동으로 조절 하는 기술, 정해진 경로를 따라 자동으로 주행하는 기술, 목적지가 설정되면 자동으로 경로를 설정하여 주행하 는 기술 등이 모두 포함될 수 있다. 차량은 내연 기관만을 구비하는 차량, 내연 기관과 전기 모터를 함께 구비하는 하이브리드 차량, 그리고 전기 모터만을 구비하는 전기 차량을 모두 포괄하며, 자동차뿐만 아니라 기차, 오토바이 등을 포함할 수 있다. 이때, 자율 주행 차량은 자율 주행 기능을 가진 로봇으로 볼 수 있다. <확장 현실(XR: eXtended Reality)> 확장 현실은 가상 현실(VR: Virtual Reality), 증강 현실(AR: Augmented Reality), 혼합 현실(MR: Mixed Reality)을 총칭한다. VR 기술은 현실 세계의 객체나 배경 등을 CG 영상으로만 제공하고, AR 기술은 실제 사물 영상 위에 가상으로 만들어진 CG 영상을 함께 제공하며, MR 기술은 현실 세계에 가상 객체들을 섞고 결합시켜서 제공하는 컴퓨터 그래픽 기술이다. MR 기술은 현실 객체와 가상 객체를 함께 보여준다는 점에서 AR 기술과 유사하다. 그러나, AR 기술에서는 가상 객체가 현실 객체를 보완하는 형태로 사용되는 반면, MR 기술에서는 가상 객체와 현실 객체가 동등한 성격으로 사용된다는 점에서 차이점이 있다. XR 기술은 HMD(Head-Mount Display), HUD(Head-Up Display), 휴대폰, 태블릿 PC, 랩탑, 데스크탑, TV, 디지털 사이니지 등에 적용될 수 있고, XR 기술이 적용된 장치를 XR 장치(XR Device)라 칭할 수 있다. 도 1은 본 개시의 일 실시 예에 따른 AI 장치를 나타낸다. AI 장치는 TV, 프로젝터, 휴대폰, 스마트폰, 데스크탑 컴퓨터, 노트북, 디지털방송용 단말기, PDA(personal digital assistants), PMP(portable multimedia player), 네비게이션, 태블릿 PC, 웨어러블 장치, 셋톱박스(STB), DMB 수신기, 라디오, 세탁기, 냉장고, 데스크탑 컴퓨터, 디지털 사이니지, 로봇, 차량 등 과 같은, 고정형 기기 또는 이동 가능한 기기 등으로 구현될 수 있다. 도 1을 참조하면, 단말기는 통신부, 입력부, 러닝 프로세서, 센싱부, 출력부, 메모리 및 프로세서 등을 포함할 수 있다. 통신부는 유무선 통신 기술을 이용하여 다른 AI 장치(100a 내지 100e)나 AI 서버 등의 외부 장치들과 데이터를 송수신할 수 있다. 예컨대, 통신부는 외부 장치들과 센서 정보, 사용자 입력, 학습 모델, 제어신호 등을 송수신할 수 있다. 이때, 통신부가 이용하는 통신 기술에는 GSM(Global System for Mobile communication), CDMA(Code Division Multi Access), LTE(Long Term Evolution), 5G, WLAN(Wireless LAN), Wi-Fi(Wireless-Fidelity), 블 루투스(Bluetooth™), RFID(Radio Frequency Identification), 적외선 통신(Infrared Data Association; IrDA), ZigBee, NFC(Near Field Communication) 등이 있다. 입력부는 다양한 종류의 데이터를 획득할 수 있다. 이때, 입력부는 영상 신호 입력을 위한 카메라, 오디오 신호를 수신하기 위한 마이크로폰, 사용자로부터 정보를 입력 받기 위한 사용자 입력부 등을 포함할 수 있다. 여기서, 카메라나 마이크로폰을 센서로 취급하여, 카메라나 마이크로폰으로부터 획득한 신호를 센싱 데이터 또는 센서 정보라고 할 수도 있다. 입력부는 모델 학습을 위한 학습 데이터 및 학습 모델을 이용하여 출력을 획득할 때 사용될 입력 데이터 등을 획득할 수 있다. 입력부는 가공되지 않은 입력 데이터를 획득할 수도 있으며, 이 경우 프로세서 또는 러닝 프로세서는 입력 데이터에 대하여 전처리로써 입력 특징점(input feature)을 추출할 수 있다. 러닝 프로세서는 학습 데이터를 이용하여 인공 신경망으로 구성된 모델을 학습시킬 수 있다. 여기서, 학습 된 인공 신경망을 학습 모델이라 칭할 수 있다. 학습 모델은 학습 데이터가 아닌 새로운 입력 데이터에 대하여 결과 값을 추론해 내는데 사용될 수 있고, 추론된 값은 어떠한 동작을 수행하기 위한 판단의 기초로 이용될 수 있다. 이때, 러닝 프로세서는 AI 서버의 러닝 프로세서과 함께 AI 프로세싱을 수행할 수 있다. 이때, 러닝 프로세서는 AI 장치에 통합되거나 구현된 메모리를 포함할 수 있다. 또는, 러닝 프로세서 는 메모리, AI 장치에 직접 결합된 외부 메모리 또는 외부 장치에서 유지되는 메모리를 사용하 여 구현될 수도 있다. 센싱부는 다양한 센서들을 이용하여 AI 장치 내부 정보, AI 장치의 주변 환경 정보 및 사용자 정보 중 적어도 하나를 획득할 수 있다. 이때, 센싱부에 포함되는 센서에는 근접 센서, 조도 센서, 가속도 센서, 자기 센서, 자이로 센서, 관성 센 서, RGB 센서, IR 센서, 지문 인식 센서, 초음파 센서, 광 센서, 마이크로폰, 라이다, 레이더 등이 있다. 출력부는 시각, 청각 또는 촉각 등과 관련된 출력을 발생시킬 수 있다. 이때, 출력부에는 시각 정보를 출력하는 디스플레이부, 청각 정보를 출력하는 스피커, 촉각 정보를 출력하 는 햅틱 모듈 등이 포함될 수 있다. 메모리는 AI 장치의 다양한 기능을 지원하는 데이터를 저장할 수 있다. 예컨대, 메모리는 입력 부에서 획득한 입력 데이터, 학습 데이터, 학습 모델, 학습 히스토리 등을 저장할 수 있다. 프로세서는 데이터 분석 알고리즘 또는 머신 러닝 알고리즘을 사용하여 결정되거나 생성된 정보에 기초하 여, AI 장치의 적어도 하나의 실행 가능한 동작을 결정할 수 있다. 그리고, 프로세서는 AI 장치(10 0)의 구성 요소들을 제어하여 결정된 동작을 수행할 수 있다. 이를 위해, 프로세서는 러닝 프로세서 또는 메모리의 데이터를 요청, 검색, 수신 또는 활용할 수 있고, 상기 적어도 하나의 실행 가능한 동작 중 예측되는 동작이나, 바람직한 것으로 판단되는 동작을 실행 하도록 AI 장치의 구성 요소들을 제어할 수 있다. 이때, 프로세서는 결정된 동작을 수행하기 위하여 외부 장치의 연계가 필요한 경우, 해당 외부 장치를 제 어하기 위한 제어 신호를 생성하고, 생성한 제어 신호를 해당 외부 장치에 전송할 수 있다. 프로세서는 사용자 입력에 대하여 의도 정보를 획득하고, 획득한 의도 정보에 기초하여 사용자의 요구 사 항을 결정할 수 있다. 이때, 프로세서는 음성 입력을 문자열로 변환하기 위한 STT(Speech To Text) 엔진 또는 자연어의 의도 정 보를 획득하기 위한 자연어 처리(NLP: Natural Language Processing) 엔진 중에서 적어도 하나 이상을 이용하여, 사용자 입력에 상응하는 의도 정보를 획득할 수 있다. 이때, STT 엔진 또는 NLP 엔진 중에서 적어도 하나 이상은 적어도 일부가 머신 러닝 알고리즘에 따라 학습된 인 공 신경망으로 구성될 수 있다. 그리고, STT 엔진 또는 NLP 엔진 중에서 적어도 하나 이상은 러닝 프로세서 에 의해 학습된 것이나, AI 서버의 러닝 프로세서에 의해 학습된 것이거나, 또는 이들의 분산 처리에 의해 학습된 것일 수 있다. 프로세서는 AI 장치의 동작 내용이나 동작에 대한 사용자의 피드백 등을 포함하는 이력 정보를 수집 하여 메모리 또는 러닝 프로세서에 저장하거나, AI 서버 등의 외부 장치에 전송할 수 있다. 수 집된 이력 정보는 학습 모델을 갱신하는데 이용될 수 있다. 프로세서는 메모리에 저장된 응용 프로그램을 구동하기 위하여, AI 장치의 구성 요소들 중 적어 도 일부를 제어할 수 있다. 나아가, 프로세서는 상기 응용 프로그램의 구동을 위하여, AI 장치에 포 함된 구성 요소들 중 둘 이상을 서로 조합하여 동작시킬 수 있다. 도 2는 본 개시의 일 실시 예에 따른 AI 서버를 나타낸다. 도 2를 참조하면, AI 서버는 머신 러닝 알고리즘을 이용하여 인공 신경망을 학습시키거나 학습된 인공 신 경망을 이용하는 장치를 의미할 수 있다. 여기서, AI 서버는 복수의 서버들로 구성되어 분산 처리를 수행 할 수도 있고, 5G 네트워크로 정의될 수 있다. 이때, AI 서버는 AI 장치의 일부의 구성으로 포함되어, AI 프로세싱 중 적어도 일부를 함께 수행할 수도 있다. AI 서버는 통신부, 메모리, 러닝 프로세서 및 프로세서 등을 포함할 수 있다. 통신부는 AI 장치 등의 외부 장치와 데이터를 송수신할 수 있다. 메모리는 모델 저장부를 포함할 수 있다. 모델 저장부는 러닝 프로세서을 통하여 학습 중 인 또는 학습된 모델(또는 인공 신경망, 231a)을 저장할 수 있다. 러닝 프로세서는 학습 데이터를 이용하여 인공 신경망(231a)을 학습시킬 수 있다. 학습 모델은 인공 신경 망의 AI 서버에 탑재된 상태에서 이용되거나, AI 장치 등의 외부 장치에 탑재되어 이용될 수도 있다. 학습 모델은 하드웨어, 소프트웨어 또는 하드웨어와 소프트웨어의 조합으로 구현될 수 있다. 학습 모델의 일부 또는 전부가 소프트웨어로 구현되는 경우 학습 모델을 구성하는 하나 이상의 명령어(instruction)는 메모리 에 저장될 수 있다. 프로세서는 학습 모델을 이용하여 새로운 입력 데이터에 대하여 결과 값을 추론하고, 추론한 결과 값에 기 초한 응답이나 제어 명령을 생성할 수 있다. 도 3은 본 개시의 일 실시 예에 따른 AI 시스템을 나타낸다. 도 3을 참조하면, AI 시스템은 AI 서버, 로봇(100a), 자율 주행 차량(100b), XR 장치(100c), 스마트폰 (100d) 또는 가전(100e) 중에서 적어도 하나 이상이 클라우드 네트워크와 연결된다. 여기서, AI 기술이 적 용된 로봇(100a), 자율 주행 차량(100b), XR 장치(100c), 스마트폰(100d) 또는 가전(100e) 등을 AI 장치(100a 내지 100e)라 칭할 수 있다. 클라우드 네트워크는 클라우드 컴퓨팅 인프라의 일부를 구성하거나 클라우드 컴퓨팅 인프라 안에 존재하는 네트워크를 의미할 수 있다. 여기서, 클라우드 네트워크는 3G 네트워크, 4G 또는 LTE(Long Term Evolution) 네트워크 또는 5G 네트워크 등을 이용하여 구성될 수 있다. 즉, AI 시스템을 구성하는 각 장치들(100a 내지 100e, 200)은 클라우드 네트워크를 통해 서로 연결될 수 있다. 특히, 각 장치들(100a 내지 100e, 200)은 기지국을 통해서 서로 통신할 수도 있지만, 기지국을 통하지 않 고 직접 서로 통신할 수도 있다. AI 서버는 AI 프로세싱을 수행하는 서버와 빅 데이터에 대한 연산을 수행하는 서버를 포함할 수 있다. AI 서버는 AI 시스템을 구성하는 AI 장치들인 로봇(100a), 자율 주행 차량(100b), XR 장치(100c), 스 마트폰(100d) 또는 가전(100e) 중에서 적어도 하나 이상과 클라우드 네트워크을 통하여 연결되고, 연결된 AI 장치들(100a 내지 100e)의 AI 프로세싱을 적어도 일부를 도울 수 있다. 이때, AI 서버는 AI 장치(100a 내지 100e)를 대신하여 머신 러닝 알고리즘에 따라 인공 신경망을 학습시킬 수 있고, 학습 모델을 직접 저장하거나 AI 장치(100a 내지 100e)에 전송할 수 있다. 이때, AI 서버는 AI 장치(100a 내지 100e)로부터 입력 데이터를 수신하고, 학습 모델을 이용하여 수신한 입력 데이터에 대하여 결과 값을 추론하고, 추론한 결과 값에 기초한 응답이나 제어 명령을 생성하여 AI 장치 (100a 내지 100e)로 전송할 수 있다. 또는, AI 장치(100a 내지 100e)는 직접 학습 모델을 이용하여 입력 데이터에 대하여 결과 값을 추론하고, 추론 한 결과 값에 기초한 응답이나 제어 명령을 생성할 수도 있다. 이하에서는, 상술한 기술이 적용되는 AI 장치(100a 내지 100e)의 다양한 실시 예들을 설명한다. 여기서, 도 3에 도시된 AI 장치(100a 내지 100e)는 도 1에 도시된 AI 장치의 구체적인 실시 예로 볼 수 있다. <AI+로봇> 로봇(100a)은 AI 기술이 적용되어, 안내 로봇, 운반 로봇, 청소 로봇, 웨어러블 로봇, 엔터테인먼트 로봇, 펫 로봇, 무인 비행 로봇 등으로 구현될 수 있다. 로봇(100a)은 동작을 제어하기 위한 로봇 제어 모듈을 포함할 수 있고, 로봇 제어 모듈은 소프트웨어 모듈 또는 이를 하드웨어로 구현한 칩을 의미할 수 있다. 로봇(100a)은 다양한 종류의 센서들로부터 획득한 센서 정보를 이용하여 로봇(100a)의 상태 정보를 획득하거나, 주변 환경 및 객체를 검출(인식)하거나, 맵 데이터를 생성하거나, 이동 경로 및 주행 계획을 결정하거나, 사용 자 상호작용에 대한 응답을 결정하거나, 동작을 결정할 수 있다. 여기서, 로봇(100a)은 이동 경로 및 주행 계획을 결정하기 위하여, 라이다, 레이더, 카메라 중에서 적어도 하나 이상의 센서에서 획득한 센서 정보를 이용할 수 있다. 로봇(100a)은 적어도 하나 이상의 인공 신경망으로 구성된 학습 모델을 이용하여 상기한 동작들을 수행할 수 있 다. 예컨대, 로봇(100a)은 학습 모델을 이용하여 주변 환경 및 객체를 인식할 수 있고, 인식된 주변 환경 정보 또는 객체 정보를 이용하여 동작을 결정할 수 있다. 여기서, 학습 모델은 로봇(100a)에서 직접 학습되거나, AI 서버 등의 외부 장치에서 학습된 것일 수 있다. 이때, 로봇(100a)은 직접 학습 모델을 이용하여 결과를 생성하여 동작을 수행할 수도 있지만, AI 서버 등 의 외부 장치에 센서 정보를 전송하고 그에 따라 생성된 결과를 수신하여 동작을 수행할 수도 있다. 로봇(100a)은 맵 데이터, 센서 정보로부터 검출한 객체 정보 또는 외부 장치로부터 획득한 객체 정보 중에서 적 어도 하나 이상을 이용하여 이동 경로와 주행 계획을 결정하고, 구동부를 제어하여 결정된 이동 경로와 주행 계 획에 따라 로봇(100a)을 주행시킬 수 있다. 맵 데이터에는 로봇(100a)이 이동하는 공간에 배치된 다양한 객체들에 대한 객체 식별 정보가 포함될 수 있다. 예컨대, 맵 데이터에는 벽, 문 등의 고정 객체들과 화분, 책상 등의 이동 가능한 객체들에 대한 객체 식별 정보 가 포함될 수 있다. 그리고, 객체 식별 정보에는 명칭, 종류, 거리, 위치 등이 포함될 수 있다. 또한, 로봇(100a)은 사용자의 제어/상호작용에 기초하여 구동부를 제어함으로써, 동작을 수행하거나 주행할 수 있다. 이때, 로봇(100a)은 사용자의 동작이나 음성 발화에 따른 상호작용의 의도 정보를 획득하고, 획득한 의도 정보에 기초하여 응답을 결정하여 동작을 수행할 수 있다. <AI+자율주행> 자율 주행 차량(100b)은 AI 기술이 적용되어, 이동형 로봇, 차량, 무인 비행체 등으로 구현될 수 있다. 자율 주행 차량(100b)은 자율 주행 기능을 제어하기 위한 자율 주행 제어 모듈을 포함할 수 있고, 자율 주행 제 어 모듈은 소프트웨어 모듈 또는 이를 하드웨어로 구현한 칩을 의미할 수 있다. 자율 주행 제어 모듈은 자율 주 행 차량(100b)의 구성으로써 내부에 포함될 수도 있지만, 자율 주행 차량(100b)의 외부에 별도의 하드웨어로 구 성되어 연결될 수도 있다. 자율 주행 차량(100b)은 다양한 종류의 센서들로부터 획득한 센서 정보를 이용하여 자율 주행 차량(100b)의 상 태 정보를 획득하거나, 주변 환경 및 객체를 검출(인식)하거나, 맵 데이터를 생성하거나, 이동 경로 및 주행 계 획을 결정하거나, 동작을 결정할 수 있다. 여기서, 자율 주행 차량(100b)은 이동 경로 및 주행 계획을 결정하기 위하여, 로봇(100a)과 마찬가지로, 라이다, 레이더, 카메라 중에서 적어도 하나 이상의 센서에서 획득한 센서 정보를 이용할 수 있다. 특히, 자율 주행 차량(100b)은 시야가 가려지는 영역이나 일정 거리 이상의 영역에 대한 환경이나 객체는 외부 장치들로부터 센서 정보를 수신하여 인식하거나, 외부 장치들로부터 직접 인식된 정보를 수신할 수 있다. 자율 주행 차량(100b)은 적어도 하나 이상의 인공 신경망으로 구성된 학습 모델을 이용하여 상기한 동작들을 수 행할 수 있다. 예컨대, 자율 주행 차량(100b)은 학습 모델을 이용하여 주변 환경 및 객체를 인식할 수 있고, 인 식된 주변 환경 정보 또는 객체 정보를 이용하여 주행 동선을 결정할 수 있다. 여기서, 학습 모델은 자율 주행 차량(100b)에서 직접 학습되거나, AI 서버 등의 외부 장치에서 학습된 것일 수 있다. 이때, 자율 주행 차량(100b)은 직접 학습 모델을 이용하여 결과를 생성하여 동작을 수행할 수도 있지만, AI 서 버 등의 외부 장치에 센서 정보를 전송하고 그에 따라 생성된 결과를 수신하여 동작을 수행할 수도 있다. 자율 주행 차량(100b)은 맵 데이터, 센서 정보로부터 검출한 객체 정보 또는 외부 장치로부터 획득한 객체 정보 중에서 적어도 하나 이상을 이용하여 이동 경로와 주행 계획을 결정하고, 구동부를 제어하여 결정된 이동 경로 와 주행 계획에 따라 자율 주행 차량(100b)을 주행시킬 수 있다. 맵 데이터에는 자율 주행 차량(100b)이 주행하는 공간(예컨대, 도로)에 배치된 다양한 객체들에 대한 객체 식별 정보가 포함될 수 있다. 예컨대, 맵 데이터에는 가로등, 바위, 건물 등의 고정 객체들과 차량, 보행자 등의 이 동 가능한 객체들에 대한 객체 식별 정보가 포함될 수 있다. 그리고, 객체 식별 정보에는 명칭, 종류, 거리, 위 치 등이 포함될 수 있다. 또한, 자율 주행 차량(100b)은 사용자의 제어/상호작용에 기초하여 구동부를 제어함으로써, 동작을 수행하거나 주행할 수 있다. 이때, 자율 주행 차량(100b)은 사용자의 동작이나 음성 발화에 따른 상호작용의 의도 정보를 획득하고, 획득한 의도 정보에 기초하여 응답을 결정하여 동작을 수행할 수 있다. <AI+XR> XR 장치(100c)는 AI 기술이 적용되어, HMD(Head-Mount Display), 차량에 구비된 HUD(Head-Up Display), 텔레비 전, 휴대폰, 스마트 폰, 컴퓨터, 웨어러블 디바이스, 가전 기기, 디지털 사이니지, 차량, 고정형 로봇이나 이동 형 로봇 등으로 구현될 수 있다. XR 장치(100c)는 다양한 센서들을 통해 또는 외부 장치로부터 획득한 3차원 포인트 클라우드 데이터 또는 이미 지 데이터를 분석하여 3차원 포인트들에 대한 위치 데이터 및 속성 데이터를 생성함으로써 주변 공간 또는 현실 객체에 대한 정보를 획득하고, 출력할 XR 객체를 렌더링하여 출력할 수 있다. 예컨대, XR 장치(100c)는 인식된 물체에 대한 추가 정보를 포함하는 XR 객체를 해당 인식된 물체에 대응시켜 출력할 수 있다. XR 장치(100c)는 적어도 하나 이상의 인공 신경망으로 구성된 학습 모델을 이용하여 상기한 동작들을 수행할 수 있다. 예컨대, XR 장치(100c)는 학습 모델을 이용하여 3차원 포인트 클라우드 데이터 또는 이미지 데이터에서 현실 객체를 인식할 수 있고, 인식한 현실 객체에 상응하는 정보를 제공할 수 있다. 여기서, 학습 모델은 XR 장 치(100c)에서 직접 학습되거나, AI 서버 등의 외부 장치에서 학습된 것일 수 있다. 이때, XR 장치(100c)는 직접 학습 모델을 이용하여 결과를 생성하여 동작을 수행할 수도 있지만, AI 서버 등의 외부 장치에 센서 정보를 전송하고 그에 따라 생성된 결과를 수신하여 동작을 수행할 수도 있다. <AI+로봇+자율주행> 로봇(100a)은 AI 기술 및 자율 주행 기술이 적용되어, 안내 로봇, 운반 로봇, 청소 로봇, 웨어러블 로봇, 엔터 테인먼트 로봇, 펫 로봇, 무인 비행 로봇 등으로 구현될 수 있다. AI 기술과 자율 주행 기술이 적용된 로봇(100a)은 자율 주행 기능을 가진 로봇 자체나, 자율 주행 차량(100b)과 상호작용하는 로봇(100a) 등을 의미할 수 있다. 자율 주행 기능을 가진 로봇(100a)은 사용자의 제어 없이도 주어진 동선에 따라 스스로 움직이거나, 동선을 스 스로 결정하여 움직이는 장치들을 통칭할 수 있다. 자율 주행 기능을 가진 로봇(100a) 및 자율 주행 차량(100b)은 이동 경로 또는 주행 계획 중 하나 이상을 결정 하기 위해 공통적인 센싱 방법을 사용할 수 있다. 예컨대, 자율 주행 기능을 가진 로봇(100a) 및 자율 주행 차 량(100b)은 라이다, 레이더, 카메라를 통해 센싱된 정보를 이용하여, 이동 경로 또는 주행 계획 중 하나 이상을 결정할 수 있다. 자율 주행 차량(100b)과 상호작용하는 로봇(100a)은 자율 주행 차량(100b)과 별개로 존재하면서, 자율 주행 차 량(100b)의 내부에서 자율 주행 기능에 연계되거나, 자율 주행 차량(100b)에 탑승한 사용자와 연계된 동작을 수행할 수 있다. 이때, 자율 주행 차량(100b)과 상호작용하는 로봇(100a)은 자율 주행 차량(100b)을 대신하여 센서 정보를 획득 하여 자율 주행 차량(100b)에 제공하거나, 센서 정보를 획득하고 주변 환경 정보 또는 객체 정보를 생성하여 자 율 주행 차량(100b)에 제공함으로써, 자율 주행 차량(100b)의 자율 주행 기능을 제어하거나 보조할 수 있다. 또는, 자율 주행 차량(100b)과 상호작용하는 로봇(100a)은 자율 주행 차량(100b)에 탑승한 사용자를 모니터링하 거나 사용자와의 상호작용을 통해 자율 주행 차량(100b)의 기능을 제어할 수 있다. 예컨대, 로봇(100a)은 운전 자가 졸음 상태인 경우로 판단되는 경우, 자율 주행 차량(100b)의 자율 주행 기능을 활성화하거나 자율 주행 차 량(100b)의 구동부의 제어를 보조할 수 있다. 여기서, 로봇(100a)이 제어하는 자율 주행 차량(100b)의 기능에는 단순히 자율 주행 기능뿐만 아니라, 자율 주행 차량(100b)의 내부에 구비된 네비게이션 시스템이나 오디오 시스 템에서 제공하는 기능도 포함될 수 있다. 또는, 자율 주행 차량(100b)과 상호작용하는 로봇(100a)은 자율 주행 차량(100b)의 외부에서 자율 주행 차량 (100b)에 정보를 제공하거나 기능을 보조할 수 있다. 예컨대, 로봇(100a)은 스마트 신호등과 같이 자율 주행 차 량(100b)에 신호 정보 등을 포함하는 교통 정보를 제공할 수도 있고, 전기 차량의 자동 전기 충전기와 같이 자 율 주행 차량(100b)과 상호작용하여 충전구에 전기 충전기를 자동으로 연결할 수도 있다. <AI+로봇+XR> 로봇(100a)은 AI 기술 및 XR 기술이 적용되어, 안내 로봇, 운반 로봇, 청소 로봇, 웨어러블 로봇, 엔터테인먼트 로봇, 펫 로봇, 무인 비행 로봇, 드론 등으로 구현될 수 있다. XR 기술이 적용된 로봇(100a)은 XR 영상 내에서의 제어/상호작용의 대상이 되는 로봇을 의미할 수 있다. 이 경 우, 로봇(100a)은 XR 장치(100c)와 구분되며 서로 연동될 수 있다. XR 영상 내에서의 제어/상호작용의 대상이 되는 로봇(100a)은 카메라를 포함하는 센서들로부터 센서 정보를 획 득하면, 로봇(100a) 또는 XR 장치(100c)는 센서 정보에 기초한 XR 영상을 생성하고, XR 장치(100c)는 생성된 XR 영상을 출력할 수 있다. 그리고, 이러한 로봇(100a)은 XR 장치(100c)를 통해 입력되는 제어 신호 또는 사용자의 상호작용에 기초하여 동작할 수 있다. 예컨대, 사용자는 XR 장치(100c) 등의 외부 장치를 통해 원격으로 연동된 로봇(100a)의 시점에 상응하는 XR 영 상을 확인할 수 있고, 상호작용을 통하여 로봇(100a)의 자율 주행 경로를 조정하거나, 동작 또는 주행을 제어하 거나, 주변 객체의 정보를 확인할 수 있다. <AI+자율주행+XR> 자율 주행 차량(100b)은 AI 기술 및 XR 기술이 적용되어, 이동형 로봇, 차량, 무인 비행체 등으로 구현될 수 있 다. XR 기술이 적용된 자율 주행 차량(100b)은 XR 영상을 제공하는 수단을 구비한 자율 주행 차량이나, XR 영상 내 에서의 제어/상호작용의 대상이 되는 자율 주행 차량 등을 의미할 수 있다. 특히, XR 영상 내에서의 제어/상호 작용의 대상이 되는 자율 주행 차량(100b)은 XR 장치(100c)와 구분되며 서로 연동될 수 있다. XR 영상을 제공하는 수단을 구비한 자율 주행 차량(100b)은 카메라를 포함하는 센서들로부터 센서 정보를 획득 하고, 획득한 센서 정보에 기초하여 생성된 XR 영상을 출력할 수 있다. 예컨대, 자율 주행 차량(100b)은 HUD를 구비하여 XR 영상을 출력함으로써, 탑승자에게 현실 객체 또는 화면 속의 객체에 대응되는 XR 객체를 제공할 수 있다. 이때, XR 객체가 HUD에 출력되는 경우에는 XR 객체의 적어도 일부가 탑승자의 시선이 향하는 실제 객체에 오버 랩되도록 출력될 수 있다. 반면, XR 객체가 자율 주행 차량(100b)의 내부에 구비되는 디스플레이에 출력되는 경 우에는 XR 객체의 적어도 일부가 화면 속의 객체에 오버랩되도록 출력될 수 있다. 예컨대, 자율 주행 차량 (100b)은 차로, 타 차량, 신호등, 교통 표지판, 이륜차, 보행자, 건물 등과 같은 객체와 대응되는 XR 객체들을 출력할 수 있다. XR 영상 내에서의 제어/상호작용의 대상이 되는 자율 주행 차량(100b)은 카메라를 포함하는 센서들로부터 센서 정보를 획득하면, 자율 주행 차량(100b) 또는 XR 장치(100c)는 센서 정보에 기초한 XR 영상을 생성하고, XR 장 치(100c)는 생성된 XR 영상을 출력할 수 있다. 그리고, 이러한 자율 주행 차량(100b)은 XR 장치(100c) 등의 외 부 장치를 통해 입력되는 제어 신호 또는 사용자의 상호작용에 기초하여 동작할 수 있다. 도 4는 본 개시의 일 실시 예에 따른 AI 장치를 나타낸다. 도 1과 중복되는 설명은 생략한다. 도 4를 참조하면, AI 장치은 주행 구동부과 청소부를 더 포함할 수 있다. 입력부는 영상 신호 입력을 위한 카메라(Camera, 121), 오디오 신호를 수신하기 위한 마이크로폰 (Microphone, 122), 사용자로부터 정보를 입력 받기 위한 사용자 입력부(User Input Unit, 123)를 포함할 수 있다. 입력부에서 수집한 음성 데이터나 이미지 데이터는 분석되어 사용자의 제어 명령으로 처리될 수 있다. 입력부는 영상 정보(또는 신호), 오디오 정보(또는 신호), 데이터, 또는 사용자로부터 입력되는 정보의 입 력을 위한 것으로서, 영상 정보의 입력을 위하여, AI 장치는 하나 또는 복수의 카메라들을 구비할 수 있다. 카메라는 화상 통화모드 또는 촬영 모드에서 이미지 센서에 의해 얻어지는 정지영상 또는 동영상 등의 화 상 프레임을 처리한다. 처리된 화상 프레임은 디스플레이부(Display Unit, 151)에 표시되거나 메모리에 저 장될 수 있다. 마이크로폰은 외부의 음향 신호를 전기적인 음성 데이터로 처리한다. 처리된 음성 데이터는 AI 장치 에서 수행 중인 기능(또는 실행 중인 응용 프로그램)에 따라 다양하게 활용될 수 있다. 한편, 마이크로폰 에는 외부의 음향 신호를 입력 받는 과정에서 발생되는 잡음(noise)을 제거하기 위한 다양한 잡음 제거 알고리 즘이 적용될 수 있다. 사용자 입력부는 사용자로부터 정보를 입력 받기 위한 것으로서, 사용자 입력부를 통해 정보가 입력 되면, 프로세서는 입력된 정보에 대응되도록 AI 장치의 동작을 제어할 수 있다. 사용자 입력부는 기계식 (mechanical) 입력수단(또는, 메커니컬 키, 예컨대, 단말기의 전/후면 또는 측면에 위치하는 버튼, 돔 스위치 (dome switch), 조그 휠, 조그 스위치 등) 및 터치식 입력수단을 포함할 수 있다. 일 예로서, 터치식 입력수단은, 소프트웨어적인 처리를 통해 터치스크린에 표시되는 가상 키(virtual key), 소프트 키(soft key) 또는 비주얼 키(visual key)로 이루어지거나, 상기 터치스크린 이외의 부분에 배치 되는 터치 키(touch key)로 이루어질 수 있다. 센싱부는 센서부라고 칭할 수 있다. 센싱부는 깊이 센서(미도시) 또는 RGB 센서(미도시) 중 하나 이상을 포함하여, 인공 지능 장치의 주 변에 대한 영상 데이터를 획득할 수 있다. 깊이 센서는 발광부(미도시)로부터 조사된 빛이 사물에 반사되어 돌아옴을 감지할 수 있다. 깊이 센서는 돌아온 빛을 감지한 시간 차이, 돌아온 빛의 양 등에 기초하여, 사물과의 거리를 측정할 수 있다. 깊이 센서는 측정된 사물 간의 거리에 기초하여, 인공 지능 장치 주위에 대한 2차원 영상 정보 또는 3차원 영상 정보를 획득할 수 있다. RGB 센서는 인공 지능 장치 주위의 사물 또는 사용자에 대한 컬러 영상 정보를 획득할 수 있다. 컬러 영상 정보는 사물의 촬영 영상일 수 있다. RGB 센서는 RGB 카메라로 명명될 수 있다. 이때, 카메라가 RGB 센서를 의미할 수도 있다. 출력부는 디스플레이부(Display Unit, 151), 음향 출력부(Sound Output Unit, 152), 햅틱 모듈(Haptic Module, 153), 광 출력부(Optical Output Unit, 154) 중 적어도 하나를 포함할 수 있다. 디스플레이부는 AI 장치에서 처리되는 정보를 표시(출력)한다. 예컨대, 디스플레이부는 AI 장치 에서 구동되는 응용 프로그램의 실행화면 정보, 또는 이러한 실행화면 정보에 따른 UI(User Interface), GUI(Graphic User Interface) 정보를 표시할 수 있다. 디스플레이부는 터치 센서와 상호 레이어 구조를 이루거나 일체형으로 형성됨으로써, 터치 스크린을 구현 할 수 있다. 이러한 터치 스크린은, AI 장치와 사용자 사이의 입력 인터페이스를 제공하는 사용자 입력부 로써 기능함과 동시에, 단말기와 사용자 사이의 출력 인터페이스를 제공할 수 있다. 음향 출력부는 호신호 수신, 통화모드 또는 녹음 모드, 음성인식 모드, 방송수신 모드 등에서 통신부(11 0)로부터 수신되거나 메모리에 저장된 오디오 데이터를 출력할 수 있다. 음향 출력부는 리시버(receiver), 스피커(speaker), 버저(buzzer) 중 적어도 하나 이상을 포함할 수 있다. 햅틱 모듈(haptic module)은 사용자가 느낄 수 있는 다양한 촉각 효과를 발생시킨다. 햅틱 모듈이 발 생시키는 촉각 효과의 대표적인 예로는 진동이 될 수 있다. 광출력부는 AI 장치의 광원의 빛을 이용하여 이벤트 발생을 알리기 위한 신호를 출력한다. AI 장치 에서 발생 되는 이벤트의 예로는 메시지 수신, 호 신호 수신, 부재중 전화, 알람, 일정 알림, 이메일 수신, 애플리케이션을 통한 정보 수신 등이 될 수 있다. 주행 구동부는 인공 지능 장치를 특정 방향으로 또는 특정 거리만큼 이동시킬 수 있다. 주행 구동부는 인공 지능 장치의 좌륜을 구동시키는 좌륜 구동부 및 우륜을 구동시키는 우륜 구 동부를 포함할 수 있다. 좌륜 구동부는 좌륜을 구동시키기 위한 모터를 포함할 수 있고, 우륜 구동부는 우륜을 구동시키기 위 한 모터를 포함할 수 있다. 도 4에서는 주행 구동부가 좌륜 구동부 및 우륜 구동부를 포함하는 것을 예로 들어 설명하였으 나, 본 개시가 이에 한정되지 않는다. 즉, 일 실시 예에서 주행 구동부는 하나의 휠 만으로 구성될 수도 있다. 청소부는 흡입부 또는 걸레질부 중에서 적어도 하나 이상을 포함하여, 인공 지능 장치 인 근의 바닥 면을 청소할 수 있다. 흡입부는 진공 청소부라 부를 수도 있다. 흡입부는 공기를 흡입하여 인공 지능 장치 주변의 먼지나 쓰레기 등의 이물질을 흡입할 수 있다. 이때, 흡입부는 이물질을 모아주는 수단으로써 브러쉬 등을 포함할 수 있다. 걸레질부는 걸레를 인공 지능 장치의 바닥 면에 적어도 일부 접촉시킨 상태에서 바닥을 닦을 수 있다. 이때, 걸레질부는 걸레와 걸레를 움직이는 걸레 구동부 등을 포함할 수 있다. 이때, 걸레질부의 걸레는 걸레 구동부를 통해 지면으로부터의 거리가 조절될 수 있다. 즉, 걸레 구동부는 걸레질이 필요한 경우에 걸레가 지면에 접촉되도록 동작할 수 있다. 도 5는 본 개시의 일 실시 예에 따른 인공 지능 장치의 사시도이다. 도 5를 참조하면, 인공 지능 장치는 청소기 본체와 카메라 또는 센싱부를 포함할 수 있다. 카메라 또는 센싱부는 전방에 빛을 조사하고, 반사된 빛을 수신할 수 있다. 카메라 또는 센싱부는 수신된 빛이 돌아오는 시간 차이를 이용하여 깊이 정보를 획득할 수 있다. 청소기 본체는 도 4에서 설명된 구성 요소들 중 카메라와 센싱부를 제외한 다른 구성 요소들을 포함할 수 있다. 도 6은 본 개시의 일 실시 예에 따른 인공 지능 장치의 저면도이다. 도 6을 참조하면, 인공 지능 장치는 도 4의 구성에 더해, 청소기 본체, 좌륜(61a), 우륜(61b) 및 흡입 부를 더 포함할 수 있다. 좌륜(61a) 및 우륜(61b)은 청소기 본체를 주행시킬 수 있다. 좌륜 구동부는 좌륜(61a)을 구동시킬 수 있고, 우륜 구동부는 우륜(61b)을 구동시킬 수 있다. 좌륜(61a) 및 우륜(61b)이 주행 구동부에 의해 회전됨에 따라, 인공 지능 장치는 흡입부를 통해 먼지나 쓰레기 등의 이물질을 흡입할 수 있다. 흡입부는 청소기 본체에 구비되어 바닥 면의 먼지를 흡입할 수 있다. 흡입부는 흡입된 기류 중에서 이물질을 채집하는 필터(미도시)와, 상기 필터에 의해 채집된 이물질들이 축 적되는 이물질 수용기(미도시)를 더 포함할 수 있다. 또한, 인공 지능 장치는 도 4의 구성에 더해, 걸레질부(미도시)를 더 포함할 수 있다. 걸레질부(미도시)는 걸레(미도시)와, 걸레를 바닥 면에 접촉시킨 상태에서 회전시키거나 설정된 패턴에 따라 움 직이는 모터(미도시)를 포함할 수 있다. 인공 지능 장치는 걸레질부(미도시)를 통해 바닥 면을 닦을 수 있다. 도 7a는 개시의 또 다른 실시 예에 따른 인공 지능 장치의 측면도이고, 도 7b는 인공 지능 장치의 저면도이다. 이하에서, 인공 지능 장치는 로봇 청소기로 명명한다. 도 7a 및 도 7b를 참조하면, 로봇 청소기는 도 4의 구성 이외에 범퍼를 더 구비할 수 있다. 범퍼는 로봇 청소기의 본체 하단에 구비될 수 있다. 범퍼에는 도 4에 도시된 흡입부 및 걸 레질부를 포함하는 청소부가 구비될 수 있다. 범퍼는 로봇 청소기의 주행 중, 장애물이나, 기타 물체와의 부딪힘으로 인해, 본체에 가해지는 충격 을 완화시킬 수 있다. 범퍼에는 하나 이상의 범퍼 센서(미도시)가 구비될 수 있다. 범퍼 센서는 범퍼에 가해지는 충격량을 측정할 수 있다. 범퍼 센서는 기 설정된 충격량 이상이 감지되면, 범퍼 이벤트를 생성할 수 있다. 범퍼 이벤트는 추후, 로봇 청 소기의 구속 상황을 감지하는데 사용될 수 있다. 또한, 좌륜(61a) 및 우륜(61b) 각각에는 휠 센서가 구비될 수 있다. 휠 센서는 좌륜 또는 우륜의 회전량을 측정 하는 광 센서일 수 있다. 휠 센서를 통해 측정된 좌륜 또는 우륜의 회전량은 로봇 청소기의 이동 거리를 계산하는데 사용될 수 있다. 범퍼의 저면에는 하나 이상의 절벽 센서가 구비될 수 있다. 절벽 센서는 송출된 적외선 신호를 반사된 적외선 신호를 이용하여, 바닥과, 절변 센서 간의 거리를 측정한다. 프로세서는 측정된 거리가 일정 거리 이상인 경우, 또는 반사된 적외선 신호를 일정 시간 동안 감지되지 않은 경우, 로봇 청소기가 계단이나, 절벽에 도달한 것으로 판단할 수 있다. 도 8은 본 개시의 실시 예에 따라 로봇 청소기의 동작 방법을 설명하는 흐름도이다. 로봇 청소기의 프로세서는 주행 중 센싱부를 통해 센싱 정보를 획득한다(S801). 센싱 정보는 범퍼 이벤트 및 3차원(Three Dimensional) 영상 데이터(이하, 3D 영상 데이터) 중 하나 이상을 포 함할 수 있다. 센싱부는 도 4에서 설명된 깊이 센서, 범퍼 센서 중 하나 이상을 포함할 수 있다. 3D 센서는 로봇 청소기의 본체 전면에 구비될 수 있다. 3D 센서가 깊이 센서인 경우, 발광부(미도시)로부터 조사된 빛이 사물에 반사되어 돌아옴을 감지할 수 있다. 깊 이 센서는 돌아온 빛을 감지한 시간 차이, 돌아온 빛의 양 등에 기초하여, 사물과의 거리를 측정할 수 있다. 깊이 센서는 측정된 사물 간의 거리에 기초하여, 로봇 청소기의 주위에 대한 2차원 영상 데이터 또는 3차 원 영상 데이터를 획득할 수 있다. 로봇 청소기의 본체 전면에 복수의 3D 센서들이 배치될 수 있다. 한편, 로봇 청소기는 범퍼에 구비된 범퍼 센서를 통해 범퍼 이벤트를 획득할 수 있다. 범퍼 센서는 범퍼에 가해지는 충격량을 측정하고, 측정된 충격량이 기 설정된 충격량 이상이 되면, 범퍼 이벤트를 생성할 수 있다. 프로세서는 범퍼 센서가 감지된 충격량이 기 설정된 충격량 이상인 경우, 범퍼 이벤트가 감지된 것으로 결 정할 수 있다. 로봇 청소기는 기 설정된 청소 경로를 따라 주행 중, 센싱 정보를 실시간으로 수집할 수 있다. 기 설정된 청소 경로는 동시적 위치 인식 및 지도 작성 방법(SLAM: Simultaneous Localization And Mapping)에 의해 작성 된 청소 지도 상에서, 로봇 청소기가 주행해야 하는 경로일 수 있다. 프로세서는 획득된 센싱 정보에 기반하여, 주변 맵을 획득한다(S803). 프로세서는 획득된 3D 데이터 및 범퍼 이벤트를 주변 맵 데이터로 변환하여, 주변 맵을 생성할 수 있다. 주변 맵 데이터는 청소 지도 상에, 로봇 청소기의 현재 위치를 기준으로, 로봇 청소기의 주변 맵을 작성하기 위해 사용되는 데이터일 수 있다. 주변 맵은 로봇 청소기의 현재 위치를 기준으로, 일정 거리 내의 주변 상황을 나타낼 수 있다. 프로세서는 변환된 주변 맵 데이터 및 주변 맵을 메모리에 저장할 수 있다. 프로세서는 실시간으로 획득된 주변 맵 정보를 메모리에 저장할 수 있다. 주변 맵 대해서는, 도 9를 참조하여 설명한다. 도 9는 본 개시의 일 실시 예에 따라 주변 맵 데이터를 이용하여, 생성된 주변 맵을 설명하는 도면이다. 도 9는 주변 맵 데이터에 의해 생성된 주변 맵이 도시되어 있다. 주변 맵은 청소 지도 상에서, 현재 로봇 청소기의 위치를 기준으로, 주변 맵 데이터에 의해 작성된 맵일 수 있다. 프로세서는 3D 영상 데이터를 오브젝트를 나타내는 제1 컬러의 점들(901, 903)로 변환할 수 있다. 프로세서는 범퍼 이벤트를 장애물을 나타내는 제2 컬러의 점들로 변환할 수 있다. 각 컬러의 점들은 하나의 장애물을 나타낼 수 있다. 프로세서는 변환된 제1 컬러의 점들(901, 903) 및 제2 컬러의 점들을 포함하는 주변 맵을 생성 할 수 있다. 또 다른 예로, 주변 맵은 범퍼 이벤트들에 의해서만 생성되거나, 3D 영상 데이터에 의해서만 생성될 수도 있다. 이 경우, 하나의 컬러의 점들에 의해 주변 맵이 생성될 수 있다. 다시, 도 8을 설명한다. 프로세서는 획득된 주변 맵에 기초하여, 구속 상황이 인지되었는지를 판단한다(S805). 프로세서는 도 9에 도시된 주변 맵 상에서, 범퍼 이벤트가 기 설정된 횟수 이상 존재하는 경우, 구속 상황을 경험한 것으로 판단할 수 있다. 또 다른 예로, 프로세서는 주변 맵 상에, 기 설정된 시간 이상 로봇 청소기가 위치하고, 범퍼 이벤트가 기 설정된 횟수 이상 존재하는 경우, 로봇 청소기가 구속 상황을 경험한 것으로 판단할 수 있다. 또 다른 예로, 프로세서는 일정 시간 동안 발생한 범퍼 이벤트의 횟수가 기 설정된 횟수 이상인 경우, 로 봇 청소기가 구속 상황을 경험한 것으로 판단할 수 있다. 프로세서는 구속 상황을 경험한 시점의 주변 맵을 영상 데이터로 메모리에 저장할 수 있다. 또 다른 예로, 프로세서는 구속 상황 인지 모델을 이용하여, 주변 맵으로부터 로봇 청소기의 현재 상 황이 구속 상황인지 아닌지를 결정할 수 있다. 구속 상황 인지 모델은 주변 맵 데이터로부터 구속 상황을 결정할 수 있는 인공 신경망 기반의 모델일 수 있다. 구속 상황 인지 모델은 딥 러닝 알고리즘 또는 머신 러닝 알고리즘에 의해 지도 학습된 모델일 수 있다. 이에 대해서는, 도 10을 참조하여 설명한다. 도 10은 본 개시의 실시 예에 따른 구속 상황 인지 모델을 설명하기 위한 도면이다. 도 10을 참조하면, 인공 신경망 기반의 구속 상황 인지 모델이 도시되어 있다. 로봇 청소기가 획득한 주변 맵 데이터에는 구속 상황을 나타내는 레이블링 데이터가 라벨링될 수 있다. 주변 맵 데이터 및 이에 라벨링된 구속 상황(또는 구속 상황 여부)은 트레이닝 세트를 구성하고, 구속 상황 인 지 모델의 지도 학습에 사용될 수 있다. 프로세서는 주변 맵 데이터로부터, 입력 특징 벡터를 추출할 수 있다. 추출된 입력 특징 벡터는 구속 상황 인지 모델에 입력될 수 있다. 프로세서는 구속 상황 인지 모델의 추론 결과인 대상 특징 벡터(또는 대상 특징점)와 레이블링 데이 터인 구속 상황 간의 차이를 나타내는 비용 함수를 최소화하도록 학습될 수 있다. 구속 상황 인지 모델의 비용 함수는 학습 데이터에 상응하는 로봇 청소기의 구속 상황에 대한 라벨 과, 각 학습 데이터로부터 추론된 상황 간의 차이의 제곱 평균으로 표현될 수 있다. 구속 상황 인지 모델은 학습을 통해 비용 함수를 최소화하도록 인공 신경망에 포함된 모델 파라미터들이 결정될 수 있다. 구속 상황 인지 모델의 대상 특징점은 로봇 청소기의 구속 상황 여부를 나타내는 단일한 노드의 출 력 층으로 구성될 수 있다. 대상 특징점은 구속 상황을 나타낼 때, 그 값으로 1, 그리고, 불구속 상황을 나타낼 때 그 값으로, 0을 가질 수 있다. 이 경우, 구속 상황 인지 모델의 출력층은 활성 함수로 시그모이드, 하 이퍼볼릭 탄젠트(tanh) 등을 이용할 수 있다. 또 다른 예로, 구속 상황 인지 모델의 대상 특징점은 로봇 청소기의 구속 또는 불구속 상황을 나타 내는 두 개의 출력 노드의 출력층으로 구성될 수 있다. 즉, 대상 특징점(대상 특징 벡터)는 구속 상황, 불구속 상황으로 구성될 수 있으며, 대상 특징점이 구속 상황을 나타낼 때에 그 값으로 \"(1, 0)\", 그리고, 불구속 상황을 나타낼 때에 그 값으로 \"(0, 1)\"을 가질 수 있다. 이 경우, 구속 상황 인지 모델의 출력층은 활성 함수로 소프트맥스를 이용할 수 있다. 다시, 도 8을 설명한다. 프로세서는 구속 상황이 인지된 것으로 판단한 경우, 보상 모델을 이용하여, 주변 맵으로부터, 탈출 경로 팩터들을 결정한다(S807). 일 실시 예에서, 보상 모델은 강화 학습을 통해 학습되고, 로봇 청소기의 탈출 경로를 위한 하나 이상의 팩터들을 결정하는 모델일 수 있다. 보상 모델은 딥 러닝 알고리즘 또는 머신 러닝 알고리즘에 의해 강화 학습된 인공 신경망 기반의 모델일 수 있 다. 보상 모델은 로봇 청소기의 러닝 프로세서, 또는 로봇 청소기의 프로세서 또는 AI 서버 의 러닝 프로세서에 의해 강화 학습된 모델일 수 있다. 보상 모델은 학습용 주변 맵으로부터, 최적의 탈출 경로 팩터들을 추론하는 모델일 수 있다. 프로세서는 기 학습된 보상 모델을 이용하여, 주변 맵으로부터, 탈출 경로 팩터들을 결정할 수 있다. 탈출 경로 팩터들은 로봇 청소기의 회전 각도, 회전 방향, 전진 거리, 후진 거리 중 하나 이상을 포함할 수 있다. 탈출 경로 팩터들 각각은 로봇 청소기가 구속 상황을 인지한 경우, 구속 상황을 회피 또는 탈출하기 위해 취해야 하는 액션을 나타내는 팩터일 수 있다. 도 11 내지 도 13은 본 개시의 실시 예에 따라 보상 모델을 강화 학습하는 과정을 설명하는 도면들이다. 먼저, 도 11은 본 개시의 실시 예에 따라 보상 모델을 학습하는 과정을 설명하는 흐름도이다. 이하에서, 보상 모델의 학습 방법은 로봇 청소기의 러닝 프로세서에 의해 수행됨을 가정하여 하나, 이는 예시에 불과하고, AI 서버의 러닝 프로세서에 의해서도 수행될 수도 있다. AI 서버의 러닝 프로세서에 의해 보상 모델이 학습되는 경우, 로봇 청소기는 AI 서버로부 터 보상 모델을 수신할 수 있고, 수신된 보상 모델을 메모리에 저장할 수 있다. 도 11을 참조하면, 로봇 청소기의 러닝 프로세서는 3D 영상 데이터 및 범퍼 이벤트에 기초하여, 주변 맵을 획득한다(S1101). 러닝 프로세서는 학습용 3D 영상 데이터 및 범퍼 이벤트를 조합하여, 주변 맵 데이터를 생성하고, 주변 맵 데이터를 이용하여, 주변 맵을 획득할 수 있다. 러닝 프로세서는 보상 모델을 이용하여, 주변 맵으로부터 탈출 경로 팩터들을 결정한다(S1103). 보상 모델은 강화 학습을 통해 학습된 인공 신경망 기반의 모델일 수 있다. 보상 모델은 공지된 DQN(Deep Q-Network) 알고리즘에 의해 강화 학습될 수 있다. 러닝 프로세서는 결정된 탈출 경로 팩터들에 기초하여, 로봇 청소기가 구속 상황을 탈출하는지 여부 및 구속 상황의 탈출까지 걸리는 탈출 시간을 포함하는 탈출 정보를 획득한다(S1105). 러닝 프로세서는 로봇 청소기가 구속 상황에 놓여 있는 경우, 구속 상황을 탈출하는지 여부를 판단할 수 있다. 러닝 프로세서는 범퍼 센서를 통해 감지된 범퍼 이벤트에 기초하여, 구속 상황을 탈출하는지 여부를 판단 할 수 있다. 일 예로, 러닝 프로세서는 범퍼 이벤트가 기 설정된 횟수 미만 감지된 경우, 구속 상황을 탈출한 것으로 판단할 수 있다. 러닝 프로세서는 로봇 청소기가 구속 상황에 놓여 있는 것으로 판단한 후, 구속 상황을 벗어날 때까 지 걸리는 시간인 탈출 시간을 측정할 수 있다. 러닝 프로세서는 탈출 시간을 측정하기 위해, 타이머를 구비할 수도 있다. 러닝 프로세서는 탈출 정보에 기초하여, 로봇 청소기가 구속 상황의 탈출에 성공했는지를 판단한다 (S1107). 러닝 프로세서는 로봇 청소기가 구속 상황의 탈출에 실패한 경우, 보상 모델에 패널티를 부여한다 . 러닝 프로세서는 탈출에 성공한 경우, 로봇 청소기가 기 설정된 시간 이내에 구속 상황의 탈출에 성 공했는지를 판단한다(S1111). 러닝 프로세서는 로봇 청소기가 기 설정된 시간을 초과하여, 구속 상황의 탈출에 성공한 경우, 보상 모델에 제1 값의 리워드를 부여하고(S1113), 기 설정된 시간 이내에 구속 상황의 탈출에 성공한 경우, 보상 모 델에 제2 값의 리워드를 부여한다(S1115). 강화 학습(Reinforcement Learning)은 주로 마르코프 결정 과정(, MDP)에 의하여 수행될 수 있다. 마르코프 결정 과정(Markov Decision Process, MDP)을 설명하면, 첫번째로 에이전트가 다음 행동을 하기 위해 필요한 정보들이 구성된 환경(environment) 이 주어진다. 두번째로, 그 환경에서 에이전트가 환경을 기반으로 어떻게 행동(action)할지 정의한다. 세번째로, 에이전트가 무엇을 잘하면 보상(reward)를 주고 무엇을 못하면 벌점(penalty)을 줄지 정의한다. 네번째로, 미래의 보상이 최고점에 이를 때까지 반복 경험하여 최적의 정책(policy)을 도출하게 된다. 마르코프 결정 과정을 본 발명에 적용하면, 에이전트는 로봇 청소기 또는 보상 모델일 수 있다. 첫번째로, 본 발명에서는 도 12 및 도 13에 도시된 보상 모델(1200, 1300)이 다음 행동을 하기 위해 필요한 정 보가 구성된 환경인, 주변 맵 정보가 주어질 수 있다. 두번째로, 본 발명에서는 보상 모델(1200, 1300)이 주어진 환경을 기반으로, 어떻게 행동(action)을 정의할 지, 즉, 로봇 청소기의 탈출 경로 팩터들이 결정될 수 있다. 세번째로, 보상 모델(1200, 1300)이 결정한, 로봇 청소기의 탈출 경로 팩터들에 따라, 구속 상황의 탈출한 경우, 보상 모델(1200, 1300)에 보상을 부여하고, 구속 상황을 탈출하지 못한 경우, 보상 모델(1200, 1300)에 패널티를 부여할 수 있다. 즉, 도 12에 도시된 바와 같이, 로봇 청소기가 구속 상황의 탈출에 성공한 경우, +1 점의 보상이 보상 모 델에 부여되고, 그렇지 않을 경우, -1점의 벌점이 보상 모델에 부여될 수 있다.또 다른 예로, 도 13과 같이, 보상 및 벌점이 더 구체화될 수 있다. 즉, 도 13에 도시된 바와 같이, 로봇 청소기가 기 설정된 시간 이내에 구속 상황의 탈출에 성공한 경우, +2점의 리워드가 보상 모델에 부여될 수 있다. 또한, 로봇 청소기가 기 설정된 시간을 초과하여, 구속 상황의 탈출에 성공한 경우, +1 점의 리워드가 보 상 모델에 부여될 수 있다. 청소 시간이 임계 시간 미만이고, 청결도가 기준 청결도 미만인 경우, -1 점 의 패널티가 보상 모델에 부여될 수 있다. 네번째로, 보상 모델(1200, 1300)은 미래의 보상이 최고점에 이를 때까지, 최고점에 이를 때까지, 반복적으로 학습되어, 최적의 정책, 즉, 구속 상황의 탈출 및 탈출 시간을 최소화시키기 위한, 탈출 경로 팩터들을 획득할 수 있다. 인공 신경망으로 구성된 보상 모델(1200, 1300)의 파라미터들은 미래의 보상의 최고점을 나타내는 피드백을 이 용하여, 업데이트될 수 있다. 또한, 인공 신경망이 트레이닝됨에 따라, 보상 모델(1200, 1300)의 행동 및 행동에 따른 피드백을 이용하여, 획 득된 학습 결과가 메모리에 저장될 수 있다. 학습 결과는 청소 시간, 청결도와 같은 피드백을 이용하여 업데이트 되는 보상 모델(1200, 1300)의 파라미터를 의미할 수 있다. 그리고, 학습 결과는 보상 모델(1200, 1300)을 구성하는 인공 신경망의 일부를 구성할 수 있다. 또 다른 예로, 보상 모델(1200, 1300)은 AI 서버에서 인공 신경망을 트레이닝 함으로써 생성될 수 있다. 그리고 트레이닝이 완료되면, 보상 모델(1200, 1300)은 로봇 청소기에 탑재될 수 있다. 한편, 보상 모델(1200, 1300)은 하드웨어, 소프트웨어 또는 하드웨어와 소프트웨어의 조합으로 구현될 수 있다. 보상 모델(1200, 1300)의 일부 또는 전부가 소프트웨어로 구현되는 경우, 보상 모델(1200, 1300)을 구성하는 하 나 이상의 명령어는 메모리에 저장될 수 있다. 보상 모델(1200, 1300)의 학습에 사용되는 환경 또는 상태는 훈련용 입력 파라미터로 명명될 수 있다. 훈련용 입력 파라미터는 청소 환경 정보에 상응할 수 있다. 보상 모델(1200, 1300)은 입력된 훈련용 파라미터를 이용하여, 탈출 경로팩터들의 값들을 결과 값으로 출력할 수 있다. 다시, 도 8을 설명한다. 프로세서는 결정된 탈출 경로 팩터들에 따라 주행하도록 주행 구동부를 제어한다(S809). 즉, 프로세서는 결정된 로봇 청소기의 회전 각도, 회전 방향, 전진 거리, 후진 거리에 따라 주행하도 록 주행 구동부를 제어할 수 있다. 이와 같이, 본 개시의 실시 예에 따르면, 로봇 청소기의 구속 상황이 감지된 경우, 로봇 청소기는 구 속 상황을 빠르게 탈출할 수 있다. 이에 따라, 로봇 청소기의 불필요한 전력 소모의 낭비가 방지될 수 있고, 구속 상황 대처 능력이 크게 향 상될 수 있다. 도 14 내지 도 16은 주변 맵의 상황에 따라 로봇 청소기가 구속 영역을 회피하는 예를 설명하는 도면들이다. 먼저, 도 14를 설명한다. 도 14를 참조하면, 전체 맵, 주변 맵 및 실시간 센싱 정보가 도시되어 있다. 로봇 청소기는 기 학습된 보상 모델을 이용하여, 주변 맵으로부터 최적의 탈출 경로 팩터들을 결정 할 수 있다. 주변 맵은 3D 데이터 및 범퍼 이벤트를 통해 생성된 좌측 장애물 및 정면 장애물을 포함할 수 있다. 로봇 청소기는 주변 맵을 통해 구속 상황을 인지하고, 주변 맵의 장애물 상태로부터, 탈출 경 로 팩터들을 결정할 수 있다. 구체적으로, 로봇 청소기는 정면 장애물을 회피하기 위해 제1 거리(d1)만큼 후진한 후, 좌측 장애물 을 회피하기 위해, 제1 각도(a도)만큼 우측으로 회전한 후, 주행하도록 주행 구동부를 제어할 수 있 다. 즉, 탈출 경로 팩터들은 제1 거리(d1)만큼의 후진 후, 제1 각도(a도)만큼의 우회전이 될 수 있다. 다음으로, 도 15를 설명한다. 도 15를 참조하면, 전체 맵, 주변 맵 및 실시간 센싱 정보가 도시되어 있다. 로봇 청소기는 기 학습된 보상 모델을 이용하여, 주변 맵으로부터 최적의 탈출 경로 팩터들을 결정 할 수 있다. 주변 맵은 3D 데이터 및 범퍼 이벤트를 통해 생성된 우측 장애물, 정면 장애물 및 좌측 장애 물을 포함할 수 있다. 로봇 청소기는 주변 맵을 통해 구속 상황을 인지하고, 주변 맵의 장애물 상태로부터, 탈출 경 로 팩터들을 결정할 수 있다. 구체적으로, 로봇 청소기는 정면 장애물 및 좌측 장애물을 회피하기 위해 제2 거리(d2)만큼 후진한 후, 우측 장애물을 회피하기 위해, 제2 각도(b도)만큼 좌측으로 회전한 후, 주행하도록 주행 구동 부를 제어할 수 있다. 즉, 탈출 경로 팩터들은 제2 거리(d2)만큼의 후진 거리 및 제2 각도(b도)만큼의 좌회전이 될 수 있다. 다음으로, 도 16을 설명한다. 도 16을 참조하면, 전체 맵, 주변 맵 및 실시간 센싱 정보가 도시되어 있다. 로봇 청소기는 기 학습된 보상 모델을 이용하여, 주변 맵으로부터 최적의 탈출 경로 팩터들을 결정 할 수 있다. 주변 맵은 3D 데이터 및 범퍼 이벤트를 통해 생성된 좌측 장애물, 제1 우측 장애물 및 제2 우측 장애물을 포함할 수 있다. 로봇 청소기는 주변 맵을 통해 구속 상황을 인지하고, 주변 맵의 장애물 상태로부터, 탈출 경 로 팩터들을 결정할 수 있다. 구체적으로, 로봇 청소기는 좌측 장애물, 제1 우측 장애물 및 제2 우측 장애물을 회피 하기 위해 우측으로 제3 각도(c도)만큼 회전한 후, 제3 거리(d3)만큼 후진하도록 주행 구동부를 제어할 수 있다. 그 후, 로봇 청소기는 제2 우측 장애물을 회피하기 위해 제4 각도(d도)만큼 우회전 한 후, 직진으로 주행하도록 주행 구동부를 제어할 수 있다. 이와 같이, 본 개시의 실시 예에 따르면, 강화 학습 기반의 보상 모델을통해 주변 맵으로터, 최적의 탈출 경로 팩터들에 따라 로봇 청소기가 구속 영역을 효율적으로 회피할 수 있다. 이에 따라, 로봇 청소기의 구속 상황에 대한 대처가 빠르게 이루어질 수 있고, 로봇 청소기가 소모하 는 전력이 절약되고, 로봇 청소기에 가해지는 물리적인 충격이 감소될 수 있다. 전술한 본 개시는, 프로그램이 기록된 매체에 컴퓨터가 읽을 수 있는 코드로서 구현하는 것이 가능하다. 컴퓨터 가 읽을 수 있는 매체는, 컴퓨터 시스템에 의하여 읽혀질 수 있는 데이터가 저장되는 모든 종류의 기록장치를 포함한다. 컴퓨터가 읽을 수 있는 매체의 예로는, HDD(Hard Disk Drive), SSD(Solid State Disk), SDD(Silicon Disk Drive), ROM, RAM, CD-ROM, 자기 테이프, 플로피 디스크, 광 데이터 저장 장치 등이 있다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7a 도면7b 도면8 도면9 도면10 도면11 도면12 도면13 도면14 도면15 도면16"}
{"patent_id": "10-2019-0130947", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시 예에 따른 AI 장치를 나타낸다. 도 2는 본 개시의 일 실시 예에 따른 AI 서버를 나타낸다. 도 3은 본 개시의 일 실시 예에 따른 AI 시스템을 나타낸다. 도 4는 본 개시의 일 실시 예에 따른 AI 장치를 나타낸다. 도 5는 본 개시의 일 실시 예에 따른 인공 지능 장치의 사시도이다.도 6은 본 개시의 일 실시 예에 따른 인공 지능 장치의 저면도이다. 도 7a는 개시의 또 다른 실시 예에 따른 인공 지능 장치의 측면도이고, 도 7b는 인공 지능 장치의 저면도이다. 도 8은 본 개시의 일 실시 예에 따라 구속 상황을 회피하는 로봇 청소기의 동작 방법을 설명하는 흐름도이다. 도 9는 본 개시의 일 실시 예에 따라 주변 맵 데이터를 이용하여, 생성된 주변 맵을 설명하는 도면이다. 도 10은 본 개시의 실시 예에 따른 구속 상황 인지 모델을 설명하기 위한 도면이다. 도 11 내지 도 13은 본 개시의 실시 예에 따라 보상 모델을 강화 학습하는 과정을 설명하는 도면들이다. 도 14 내지 도 16은 주변 맵의 상황에 따라 로봇 청소기가 구속 영역을 회피하는 예를 설명하는 도면들이다."}
