{"patent_id": "10-2022-0139618", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0058661", "출원번호": "10-2022-0139618", "발명의 명칭": "재구성 가능한 지능형 반사 평면을 지원하는 무선 통신 시스템에서 채널 상태 정보 보고를 위", "출원인": "삼성전자주식회사", "발명자": "정건웅"}}
{"patent_id": "10-2022-0139618", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "재구성 가능한 지능형 반사 평면(reconfigurable intelligent surface : RIS)을 지원하는 무선 통신 시스템에서 기지국에서 수행되는 방법에 있어서, RIS 장치에 적용될 RIS 반사 패턴과 상기 기지국의 송신 빔 중 적어도 하나를 근거로, 적어도 하나의 CSI-RS(Channel State Information-Reference Signal) 그룹을 설정하는 과정;상기 설정된 CSI-RS 그룹을 근거로, 상기 기지국이 단말에게 CSI-RS를 송신하는 적어도 하나의 송신 빔과 관련된 CSI(channel state information) 보고를 위한 설정 정보를 상기 단말에게 송신하는 과정; 및상기 CSI-RS 그룹별로 상기 CSI-RS를 수신한 상기 단말로부터 상기 적어도 하나의 송신 빔과 관련된 CSI 보고를수신하는 과정을 포함하는 방법."}
{"patent_id": "10-2022-0139618", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 적어도 하나의 송신 빔은 상기 CSI-RS의 RSRP(reference signal received power)가 상대적으로 큰 적어도하나의 베스트 송신 빔과 상기 CSI-RS의 RSRP가 상대적으로 작은 적어도 하나의 워스트 송신 빔 중 적어도 하나를 포함하는 방법."}
{"patent_id": "10-2022-0139618", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 적어도 하나의 CSI-RS 그룹은 상기 RIS 장치에 의한 대역간 광대역 반사 영향을 배제한 제1 CSI 보고를 위한 제1 CSI-RS들을 포함하는 제1 CSI-RS 그룹과,상기 RIS 장치에 의한 상기 대역간 광대역 반사 영향을 고려한 제2 CSI 보고를 위한 제2 CSI-RS들을 포함하는제2 CSI-RS 그룹를 포함하는 방법."}
{"patent_id": "10-2022-0139618", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 기지국은 상기 제1 CSI-RS 그룹에 속하는 상기 제1 CSI-RS들의 송신 시 상기 RIS 장치를 오프 상태로 제어하고, 상기 제2 CSI-RS 그룹에 속하는 상기 제2 CSI-RS들의 송신 시 상기 RIS 장치를 온 상태로 제어하는 과정을 더 포함하는 방법."}
{"patent_id": "10-2022-0139618", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 3 항에 있어서,상기 제1 CSI-RS 그룹의 상기 제1 CSI-RS들은 해당 송신 빔의 빔포밍 벡터를 적용하여 송신되고, 상기 제2 CSI-RS 그룹의 상기 제2 CSI-RS들은 해당 송신 빔의 빔포밍 벡터와 RIS 반사 패턴의 조합을 적용하여 송신되는방법.공개특허 10-2024-0058661-3-청구항 6 제 5 항에 있어서,상기 제2 CSI-RS 그룹은 다수의 CSI-RS 서브 셋들을 포함하며, 상기 다수의 CSI-RS 서브 셋들의 각 CSI-RSsubset 내 CSI-RS들에는 동일한 RIS 반사 패턴이 적용되고, 서로 다른 CSI-RS subset 간에는 서로 다른 RIS 반사 패턴이 적용되는 방법."}
{"patent_id": "10-2022-0139618", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 5 항에 있어서,상기 제2 CSI-RS 그룹은 다수의 CSI-RS 서브 셋들을 포함하며, 상기 다수의 CSI-RS 서브 셋들의 각 CSI-RSsubset 내 CSI-RS들에는 동일한 빔포밍 벡터가 적용되고, 서로 다른 CSI-RS subset 간에는 서로 다른 빔포밍 벡터가 적용되는 방법."}
{"patent_id": "10-2022-0139618", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 3 항에 있어서,상기 제1 CSI-RS 그룹의 상기 제1 CSI-RS들의 제1 송신 주기와 상기 제2 CSI-RS 그룹의 상기 제2 CSI-RS들의송신 주기는 다르게 설정되는 방법."}
{"patent_id": "10-2022-0139618", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "재구성 가능한 지능형 반사 평면(reconfigurable intelligent surface : RIS)을 지원하는 무선 통신 시스템에서 기지국에 있어서,송수신기; 및RIS 장치에 적용될 RIS 반사 패턴과 상기 기지국의 송신 빔 중 적어도 하나를 근거로, 적어도 하나의 CSI-RS(Channel State Information-Reference Signal) 그룹을 설정하고,상기 설정된 CSI-RS 그룹을 근거로, 상기 송수신기를 통해 상기 기지국이 단말에게 CSI-RS를 송신하는 적어도하나의 송신 빔과 관련된 CSI(channel state information) 보고를 위한 설정 정보를 상기 단말에게 송신하고,상기 송수신기를 통해, 상기 CSI-RS 그룹별로 상기 CSI-RS를 수신한 상기 단말로부터 상기 적어도 하나의 송신빔과 관련된 CSI 보고를 수신하도록 구성된 프로세서를 포함하는 기지국."}
{"patent_id": "10-2022-0139618", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9 항에 있어서,상기 적어도 하나의 송신 빔은 상기 CSI-RS의 RSRP(reference signal received power)가 상대적으로 큰 적어도하나의 베스트 송신 빔과 상기 CSI-RS의 RSRP가 상대적으로 작은 적어도 하나의 워스트 송신 빔 중 적어도 하나에 대한 빔 정보를 포함하는 기지국."}
{"patent_id": "10-2022-0139618", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 9 항에 있어서,상기 적어도 하나의 CSI-RS 그룹은 상기 RIS 장치에 의한 대역간 광대역 반사 영향을 배제한 제1 CSI 보고를 위한 제1 CSI-RS들을 포함하는 제1 CSI-RS 그룹과,공개특허 10-2024-0058661-4-상기 RIS 장치에 의한 상기 대역간 광대역 반사 영향을 고려한 제2 CSI 보고를 위한 제2 CSI-RS들을 포함하는제2 CSI-RS 그룹를 포함하는 기지국."}
{"patent_id": "10-2022-0139618", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11 항에 있어서,상기 프로세서는, 상기 제1 CSI-RS 그룹에 속하는 상기 제1 CSI-RS들의 송신 시 상기 RIS 장치를 오프 상태로제어하고, 상기 제2 CSI-RS 그룹에 속하는 상기 제2 CSI-RS들의 송신 시 상기 RIS 장치를 온 상태로 제어하도록더 구성된 기지국."}
{"patent_id": "10-2022-0139618", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 11 항에 있어서,상기 프로세서는, 상기 송수신기를 통해, 상기 제1 CSI-RS 그룹의 상기 제1 CSI-RS들을 해당 송신 빔의 빔포밍벡터를 적용하여 송신하고, 상기 제2 CSI-RS 그룹의 상기 제2 CSI-RS들을 해당 송신 빔의 빔포밍 벡터와 RIS 반사 패턴의 조합을 적용하여 송신하도록 구성된 기지국."}
{"patent_id": "10-2022-0139618", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13 항에 있어서,상기 제2 CSI-RS 그룹은 다수의 CSI-RS 서브 셋들을 포함하며, 상기 다수의 CSI-RS 서브 셋들의 각 CSI-RSsubset 내 CSI-RS들에는 동일한 RIS 반사 패턴이 적용되고, 서로 다른 CSI-RS subset 간에는 서로 다른 RIS 반사 패턴이 적용되는 기지국."}
{"patent_id": "10-2022-0139618", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 13 항에 있어서,상기 제2 CSI-RS 그룹은 다수의 CSI-RS 서브 셋들을 포함하며, 상기 다수의 CSI-RS 서브 셋들의 각 CSI-RSsubset 내 CSI-RS들에는 동일한 빔포밍 벡터가 적용되고, 서로 다른 CSI-RS subset 간에는 서로 다른 빔포밍 벡터가 적용되는 기지국."}
{"patent_id": "10-2022-0139618", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 11 항에 있어서,상기 제1 CSI-RS 그룹의 상기 제1 CSI-RS들의 제1 송신 주기와 상기 제2 CSI-RS 그룹의 상기 제2 CSI-RS들의송신 주기는 다르게 설정되는 기지국."}
{"patent_id": "10-2022-0139618", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "재구성 가능한 지능형 반사 평면(reconfigurable intelligent surface : RIS)을 지원하는 무선 통신 시스템에서 단말에서 수행되는 방법에 있어서,기지국이 상기 단말에게 CSI-RS(Channel State Information-Reference Signal) 그룹별 CSI-RS들을 송신하는 적어도 하나의 송신 빔과 관련된 상기 단말의 CSI(channel state information) 보고를 위한 설정 정보를 상기 기지국으로부터 수신하는 과정;공개특허 10-2024-0058661-5-상기 기지국으로부터 상기 CSI-RS들을 수신하여 수신 신호 세기를 측정하는 과정; 및상기 설정 정보와 상기 수신 신호 세기를 근거로, 상기 적어도 하나의 송신 빔과 관련된 빔 정보를 포함하는CSI 보고를 상기 기지국으로 송신하는 과정을 포함하는 방법."}
{"patent_id": "10-2022-0139618", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 17 항에 있어서,상기 CSI 보고는 상기 CSI-RS의 RSRP가 상대적으로 큰 적어도 하나의 베스트 송신 빔과 상기 CSI-RS의 RSRP가상대적으로 작은 적어도 하나의 워스트 송신 빔 중 적어도 하나에 대한 빔 인덱스 정보를 포함하는 방법."}
{"patent_id": "10-2022-0139618", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "재구성 가능한 지능형 반사 평면(reconfigurable intelligent surface : RIS)을 지원하는 무선 통신 시스템에서 단말에 있어서,송수신기; 및기지국이 상기 단말에게 CSI-RS(Channel State Information-Reference Signal) 그룹별 CSI-RS들을 송신하는 적어도 하나의 송신 빔과 관련된 상기 단말의 CSI(channel state information) 보고를 위한 설정 정보를 상기 송수신기를 통해 상기 기지국으로부터 수신하고,상기 기지국으로부터 상기 CSI-RS들을 수신하여 수신 신호 세기를 측정하는 과정; 및상기 설정 정보와 상기 수신 신호 세기를 근거로, 상기 적어도 하나의 송신 빔과 관련된 빔 정보를 포함하는CSI 보고를 상기 송수신기를 통해 상기 기지국으로 송신하도록 구성된 프로세서를 포함하는 단말."}
{"patent_id": "10-2022-0139618", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 19 항에 있어서,상기 CSI 보고는 상기 CSI-RS의 RSRP(reference signal received power)가 상대적으로 큰 적어도 하나의 베스트 송신 빔과 상기 CSI-RS의 RSRP가 상대적으로 작은 적어도 하나의 워스트 송신 빔 중 적어도 하나에 대한 빔인덱스 정보를 포함하는 단말."}
{"patent_id": "10-2022-0139618", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 RIS(reconfigurable intelligent surface)를 지원하는 지원하는 무선 통신 시스템에서 빔 정보를 포 함하는 채널 상태 정보(CSI) 보고를 위한 방법 및 장치에 대한 것으로서, 본 개시의 실시 예에 따라 RIS를 지원 하는 무선 통신 시스템에서 기지국에서 수행되는 방법은, RIS 장치에 적용될 RIS 반사 패턴과 상기 기지국의 송 신 빔 중 적어도 하나를 근거로, 적어도 하나의 CSI-RS 그룹을 설정하는 과정과, 상기 설정된 CSI-RS 그룹을 근 거로, 상기 기지국이 단말에게 CSI-RS를 송신하는 적어도 하나의 송신 빔과 관련된 CSI 보고를 위한 설정 정보를 상기 단말에게 송신하는 과정과, 상기 CSI-RS 그룹별로 상기 CSI-RS를 수신한 상기 단말로부터 상기 적어도 하나 의 송신 빔과 관련된 CSI 보고를 수신하는 과정을 포함한다."}
{"patent_id": "10-2022-0139618", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 무선 통신 시스템에서 재구성 가능한 지능형 반사 평면(reconfigurable intelligent surface : RIS) 기술을 이용하는 통신 방법 및 장치에 대한 것이다."}
{"patent_id": "10-2022-0139618", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "5G 이동통신 기술은 빠른 전송 속도와 새로운 서비스가 가능하도록 넓은 주파수 대역을 정의하고 있으며, 3.5 기가헤르츠(3.5GHz) 등 6GHz 이하 주파수('Sub 6GHz') 대역은 물론 28GHz와 39GHz 등 밀리미터파(㎜Wave)로 불 리는 초고주파 대역('Above 6GHz')에서도 구현이 가능하다. 또한, 5G 통신 이후(Beyond 5G)의 시스템이라 불리 어지는 6G 이동통신 기술의 경우, 5G 이동통신 기술 대비 50배 빨라진 전송 속도와 10분의 1로 줄어든 초저 (Ultra Low) 지연시간을 달성하기 위해 테라헤르츠(Terahertz) 대역(예를 들어, 95GHz에서 3 테라헤르츠(3THz) 대역과 같은)에서의 구현이 고려되고 있다. 5G 이동통신 기술의 초기에는, 초광대역 서비스(enhanced Mobile BroadBand, eMBB), 고신뢰/초저지연 통신 (Ultra-Reliable Low-Latency Communications, URLLC), 대규모 기계식 통신 (massive Machine-Type Communications, mMTC)에 대한 서비스 지원과 성능 요구사항 만족을 목표로, 초고주파 대역에서의 전파의 경로손실 완화 및 전파의 전달 거리를 증가시키기 위한 빔포밍(Beamforming) 및 거대 배열 다중 입출력(Massive MIMO), 초고주파수 자원의 효율적 활용을 위한 다양한 뉴머롤로지 지원(복수 개의 서브캐리어 간격 운용 등)와 슬롯 포맷에 대한 동적 운영, 다중 빔 전송 및 광대역을 지원하기 위한 초기 접속 기술, BWP(Band-Width Part) 의 정의 및 운영, 대용량 데이터 전송을 위한 LDPC(Low Density Parity Check) 부호와 제어 정보의 신뢰성 높은 전송을 위한 폴라 코드(Polar Code)와 같은 새로운 채널 코딩 방법, L2 선-처리(L2 pre-processing), 특정 서 비스에 특화된 전용 네트워크를 제공하는 네트워크 슬라이싱(Network Slicing) 등에 대한 표준화가 진행되었다. 현재, 5G 이동통신 기술이 지원하고자 했던 서비스들을 고려하여 초기의 5G 이동통신 기술 개선(improvement) 및 성능 향상(enhancement)을 위한 논의가 진행 중에 있으며, 차량이 전송하는 자신의 위치 및 상태 정보에 기 반하여 자율주행 차량의 주행 판단을 돕고 사용자의 편의를 증대하기 위한 V2X(Vehicle-to-Everything), 비면허 대역에서 각종 규제 상 요구사항들에 부합하는 시스템 동작을 목적으로 하는 NR-U(New Radio Unlicensed), NR 단말 저전력 소모 기술(UE Power Saving), 지상 망과의 통신이 불가능한 지역에서 커버리지 확보를 위한 단말- 위성 직접 통신인 비 지상 네트워크(Non-Terrestrial Network, NTN), 위치 측위(Positioning) 등의 기술에 대 한 물리계층 표준화가 진행 중이다. 뿐만 아니라, 타 산업과의 연계 및 융합을 통한 새로운 서비스 지원을 위한 지능형 공장 (Industrial Internet of Things, IIoT), 무선 백홀 링크와 액세스 링크를 통합 지원하여 네트워크 서비스 지역 확장을 위한 노드를 제공하는 IAB(Integrated Access and Backhaul), 조건부 핸드오버(Conditional Handover) 및 DAPS(Dual Active Protocol Stack) 핸드오버를 포함하는 이동성 향상 기술(Mobility Enhancement), 랜덤액세스 절차를 간소화하 는 2 동작 랜덤액세스(2-step RACH for NR) 등의 기술에 대한 무선 인터페이스 아키텍쳐/프로토콜 분야의 표준 화 역시 진행 중에 있으며, 네트워크 기능 가상화(Network Functions Virtualization, NFV) 및 소프트웨어 정 의 네트워킹(Software-Defined Networking, SDN) 기술의 접목을 위한 5G 베이스라인 아키텍쳐(예를 들어, Service based Architecture, Service based Interface), 단말의 위치에 기반하여 서비스를 제공받는 모바일 엣지 컴퓨팅(Mobile Edge Computing, MEC) 등에 대한 시스템 아키텍쳐/서비스 분야의 표준화도 진행 중이다. 이와 같은 5G 이동통신 시스템이 상용화되면, 폭발적인 증가 추세에 있는 커넥티드 기기들이 통신 네트워크에 연결될 것이며, 이에 따라 5G 이동통신 시스템의 기능 및 성능 강화와 커넥티드 기기들의 통합 운용이 필요할 것으로 예상된다. 이를 위해, 증강현실(Augmented Reality, AR), 가상현실(Virtual Reality, VR), 혼합 현실 (Mixed Reality, MR) 등을 효율적으로 지원하기 위한 확장 현실(eXtended Reality, XR), 인공지능(Artificial Intelligence, AI) 및 머신러닝(Machine Learning, ML)을 활용한 5G 성능 개선 및 복잡도 감소, AI 서비스 지 원, 메타버스 서비스 지원, 드론 통신 등에 대한 새로운 연구가 진행될 예정이다. 또한, 이러한 5G 이동통신 시스템의 발전은 6G 이동통신 기술의 테라헤르츠 대역에서의 커버리지 보장을 위한 신규 파형(Waveform), 전차원 다중입출력(Full Dimensional MIMO, FD-MIMO), 어레이 안테나(Array Antenna), 대규모 안테나(Large Scale Antenna)와 같은 다중 안테나 전송 기술, 테라헤르츠 대역 신호의 커버리지를 개선 하기 위해 메타물질(Metamaterial) 기반 렌즈 및 안테나, OAM(Orbital Angular Momentum)을 이용한 고차원 공 간 다중화 기술, RIS(Reconfigurable Intelligent Surface) 기술 뿐만 아니라, 6G 이동통신 기술의 주파수 효 율 향상 및 시스템 네트워크 개선을 위한 전이중화(Full Duplex) 기술, 위성(Satellite), AI(Artificial Intelligence)를 설계 동작에서부터 활용하고 종단간(End-to-End) AI 지원 기능을 내재화하여 시스템 최적화를 실현하는 AI 기반 통신 기술, 단말 연산 능력의 한계를 넘어서는 복잡도의 서비스를 초고성능 통신과 컴퓨팅 자 원을 활용하여 실현하는 차세대 분산 컴퓨팅 기술 등의 개발에 기반이 될 수 있을 것이다."}
{"patent_id": "10-2022-0139618", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 RIS을 지원하는 지원하는 무선 통신 시스템에서 빔 정보를 포함하는 채널 상태 정보(channel state information : CSI) 보고(report)를 위한 방법 및 장치를 제공한다. 또한 본 개시는 RIS을 지원하는 지원하는 무선 통신 시스템에서 빔 정보를 포함하는 CSI 보고를 위한 CSI-RS 그 룹을 설정하는 방법 및 장치를 제공한다. 또한 본 개시는 RIS을 지원하는 지원하는 무선 통신 시스템에서 기지국의 best 송신 빔과 worst 송신 빔 중 적 어도 하나에 대한 빔 정보를 포함하는 CSI 보고를 송수신 하기 위한 방법 및 장치를 제공한다.또한 본 개시는 RIS을 지원하는 지원하는 무선 통신 시스템에서 빔 정보를 포함하는 CSI 보고를 이용하여 cross-band에서 RIS에 의한 영향을 감소시키는 최적 스케줄링을 위한 방법 및 장치를 제공한다."}
{"patent_id": "10-2022-0139618", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 실시 예에 따라, 재구성 가능한 지능형 반사 평면(reconfigurable intelligent surface : RIS)을 지 원하는 무선 통신 시스템에서 기지국에서 수행되는 방법은, RIS 장치에 적용될 RIS 반사 패턴과 상기 기지국의 송신 빔 중 적어도 하나를 근거로, 적어도 하나의 CSI-RS(Channel State Information-Reference Signal) 그룹 을 설정하는 과정과, 상기 설정된 CSI-RS 그룹을 근거로, 상기 기지국이 단말에게 CSI-RS를 송신하는 적어도 하 나의 송신 빔과 관련된 CSI(channel state information) 보고를 위한 설정 정보를 상기 단말에게 송신하는 과정 과, 상기 CSI-RS 그룹별로 상기 CSI-RS를 수신한 상기 단말로부터 상기 적어도 하나의 송신 빔과 관련된 CSI 보 고를 수신하는 과정을 포함한다. 또한 본 개시의 실시 예에 따라, 재구성 가능한 지능형 반사 평면(reconfigurable intelligent surface : RI S)을 지원하는 무선 통신 시스템에서 기지국은, 송수신기와, RIS 장치에 적용될 RIS 반사 패턴과 상기 기지국의 송신 빔 중 적어도 하나를 근거로, 적어도 하나의 CSI-RS(Channel State Information-Reference Signal) 그룹 을 설정하고, 상기 설정된 CSI-RS 그룹을 근거로, 상기 송수신기를 통해 상기 기지국이 단말에게 CSI-RS를 송신 하는 적어도 하나의 송신 빔과 관련된 CSI(channel state information) 보고를 위한 설정 정보를 상기 단말에게 송신하고, 상기 송수신기를 통해, 상기 CSI-RS 그룹별로 상기 CSI-RS를 수신한 상기 단말로부터 상기 적어도 하 나의 송신 빔과 관련된 CSI 보고를 수신하도록 구성된 프로세서를 포함한다. 또한 본 개시의 실시 예에 따라, 재구성 가능한 지능형 반사 평면(reconfigurable intelligent surface : RI S)을 지원하는 무선 통신 시스템에서 단말에서 수행되는 방법은, 기지국이 상기 단말에게 CSI-RS(Channel State Information-Reference Signal) 그룹별 CSI-RS들을 송신하는 적어도 하나의 송신 빔과 관련된 상기 단말의 CSI(channel state information) 보고를 위한 설정 정보를 상기 기지국으로부터 수신하는 과정과, 상기 기지국 으로부터 상기 CSI-RS들을 수신하여 수신 신호 세기를 측정하는 과정과, 상기 설정 정보와 상기 수신 신호 세기 를 근거로, 상기 적어도 하나의 송신 빔과 관련된 빔 정보를 포함하는 CSI 보고를 상기 기지국으로 송신하는 과 정을 포함한다. 또한 본 개시의 실시 예에 따라, 재구성 가능한 지능형 반사 평면(reconfigurable intelligent surface : RI S)을 지원하는 무선 통신 시스템에서 단말은, 송수신기와, 기지국이 상기 단말에게 CSI-RS(Channel State Information-Reference Signal) 그룹별 CSI-RS들을 송신하는 적어도 하나의 송신 빔과 관련된 상기 단말의 CSI(channel state information) 보고를 위한 설정 정보를 상기 송수신기를 통해 상기 기지국으로부터 수신하고, 상기 기지국으로부터 상기 CSI-RS들을 수신하여 수신 신호 세기를 측정하는 과정과, 상기 설정 정보 와 상기 수신 신호 세기를 근거로, 상기 적어도 하나의 송신 빔과 관련된 빔 정보를 포함하는 CSI 보고를 상기 송수신기를 통해 상기 기지국으로 송신하도록 구성된 프로세서를 포함한다."}
{"patent_id": "10-2022-0139618", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 첨부된 도면을 참조하여 본 개시의 동작 원리를 상세히 설명한다. 하기에서 본 개시를 설명하기에 있어 관 련된 공지 기능 또는 구성에 대한 구체적인 설명이 본 개시의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우 에는 그 상세한 설명을 생략할 것이다. 그리고 후술되는 용어들은 본 개시에서의 기능을 고려하여 정의된 용어 들로서 이는 사용자, 운용자의 의도 또는 관례 등에 따라 달라질 수 있다. 그러므로 그 정의는 본 명세서 전반 에 걸친 내용을 토대로 내려져야 할 것이다. 본 개시의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나 본 개시는 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 개시의 개시가 완전하도록 하고, 본 개시가 속하"}
{"patent_id": "10-2022-0139618", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 개시 는 청구항의 범주에 의해 정의될 뿐이다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성 요소를 지칭한다. 이때, 처리 흐름도 도면들의 각 블록과 흐름도 도면들의 조합들은 컴퓨터 프로그램 인스트럭션들에 의해 수행될 수 있음을 이해할 수 있을 것이다. 또한, 각 블록은 특정된 논리적 기능(들)을 실행하기 위한 하나 이상의 실행 가능한 인스트럭션들을 포함하는 모듈, 세그먼트 또는 코드의 일부를 나타낼 수 있다. 또, 몇 가지 대체 실행 예들에서는 블록들에서 언급된 기 능들이 순서를 벗어나서 발생하는 것도 가능함을 주목해야 한다. 예컨대, 잇달아 도시되어 있는 두 개의 블록들 은 사실 실질적으로 동시에 수행되는 것도 가능하고 또는 그 블록들이 때때로 해당하는 기능에 따라 역순으로 수행되는 것도 가능하다. 이때, 본 실시예에서 사용되는 '~부'라는 용어는 소프트웨어 또는 FPGA(Field Programmable Gate Array) 또는 ASIC(Application Specific Integrated Circuit)과 같은 하드웨어 구성요소를 의미하며, '~부'는 어떤 역할들 을 수행한다. 그렇지만 '~부'는 소프트웨어 또는 하드웨어에 한정되는 의미는 아니다. '~부'는 어드레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 '~부'는 소프트웨어 구성요소들, 객체지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태 스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로코드, 회로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레 이들, 및 변수들을 포함한다. 구성요소들과 '~부'들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 '~부'들로 결합되거나 추가적인 구성요소들과 '~부'들로 더 분리될 수 있다. 뿐만 아니라, 구성요소들 및 '~부'들 은 디바이스 또는 보안 멀티미디어카드 내의 하나 또는 그 이상의 CPU들을 재생시키도록 구현될 수도 있다. 또 한 실시예에서 '~부'는 하나 이상의 프로세서를 포함할 수 있다. 본 개시에서, \"A/B\", \"A 또는 B\", \"A 및/또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\" 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제1\", \"제2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성 요소를 다른 해당 구성 요소와 구분하기 위해 사용될 수 있으며, 해당 구성 요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 이하 설명에서 사용되는 접속 노드(node)를 식별하기 위한 용어, 망 객체(network entity)들을 지칭하는 용어, 메시지들을 지칭하는 용어, 망 객체들 간 인터페이스를 지칭하는 용어, 다양한 식별 정보들을 지칭하는 용어 등 은 설명의 편의를 위해 예시된 것이다. 따라서, 본 개시가 후술되는 용어들에 한정되는 것은 아니며, 동등한 기 술적 의미를 가지는 대상을 지칭하는 다른 용어가 사용될 수 있다. 본 개시에서 기지국(base station : BS)은 단말의 자원 할당을 수행하며 단말과 무선 네트워크를 통해 통신을 수행할 수 있는 네트워크 엔터티로서, eNode B, Node B, gNB, RAN(Radio Access Network), AN(Access Network), RAN node, IAB(Integrated Access/Backhaul) node, 무선 접속 유닛, 기지국 제어기, 네트워크 상의 노드, 또는 TRP(transmission reception point) 중 적어도 하나일 수 있다. 단말(user equipment : UE)은 terminal, MS(Mobile Station), 셀룰러폰, 스마트폰, 컴퓨터, 또는 통신기능을 수행할 수 있는 멀티미디어시스 템 중 적어도 하나일 수 있다. 일반적인 LTE 시스템, 5G 시스템와 같은, 무선 통신 시스템에서 기지국은 단말 특정 기준 신호인 CSI- RS(Channel State Information-Reference Signal)를 송신할 수 있으며, 단말은 CSI-RS의 수신 신호 세기를 측 정하여 기지국에게 채널 상태 정보(CSI)를 송신할 수 있다. 상기 CSI는 다운링크에서 채널 상태와 관련된 CQI(Channel Quality Indicator), PMI(Precoding Matrix Indicator) 및 RI(Rank Indication) 중 적어도 하 나를 포함할 수 있다. 본 개시와 관련하여, 차세대 통신 기술 중 하나로 RIS 기술이 연구되고 있다. RIS 기술에서는 RIS 장치에 포함 된 다수의 반사 소자(reflecting element : RE)들의 반사 패턴을 위상 및/또는 진폭의 조합으로 형성하고 반사 패턴에 따라 RIS 장치에 입사되는 기지국의 송신 빔을 원하는 방향으로 반사시킬 수 있다. 상기 RIS 장치를 이 용하면, 기지국으로부터 송신 빔이 도달할 수 없는 음영 지역에 단말이 위치하는 경우, RIS 장치에 입사된 기지 국의 송신 빔을 반사시켜 음영 지역 내 단말에게 전달할 수 있다. 또한 상기 RIS 장치를 이용하면, 음영 지역에 위치한 단말로부터 RIS 장치에 입사된 단말의 송신 빔을 반사시켜 기지국에게 전달할 수 있다. 도 1은 RIS를 지원하는 무선 통신 시스템의 일 예를 나타낸 도면이다. 도 1의 시스템은 기지국(BS)의 주변에 RIS 장치가 설치되고, 단말들(130a, 130b)의 주변에 음영 지역 을 형성하는 건물, 숲 등의 장애물이 존재하는 통신 환경을 가정한 것이다. 이와 같은 통신 환경에서 기지 국으로부터 LoS(Line of sight)에 위치하는 단말(130a)은 기지국으로부터 직접 경로에서 송신 빔을 통해 신호를 수신할 수 있다. 그러나 음영 지역에 위치하는 단말(130b)는 기지국으로부터 직접 경로에서 신호를 수신할 수 없다. 기지국은 RIS 장치와 유선 혹은 무선 백홀 링크를 통해 연결되며, RIS 장치 에게 제어 정보를 제공할 수 있다. 기지국에 의해 제어되는 RIS 장치는 RE들의 반사 패턴을 반 사 위상 및/또는 진폭의 조합으로 형성하고, 그 반사 패턴에 따라 RIS 장치에 입사되는 기지국의 송 신 빔을 음영 지역 내 단말(130b)에게 반사시킬 수 있다. 기지국은 기지국의 송신 빔을 음역 지역의 방향으로 반사시킬 수 있는 RIS 장치에게 백홀 링크를 통해 RIS 빔북(beambook) 정보(혹은 RIS 코드북 (codebook) 정보라 칭할 수 있다.)를 제공할 수 있다. 상기 RIS 빔북 정보는 RIS 장치가 기지국의 송 신 빔의 반사를 위한 반사 패턴들을 생성하는데 이용되는 위상 변이 행렬들을 포함하며, 각 반사 패턴에 해당되 는 위상 변이 행렬 은 미리 정의된 아래 [수학식 1]과 같이, 상기 RIS 빔북 정보에서 선택될 수 있다. 기지 국은 RIS 장치에서 적용될 반사 패턴을 선택할 수 있다. [수학식 1] 도 2는 RIS를 지원하는 무선 통신 시스템에서 다수의 대역들을 이용하는 경우, 서로 다른 대역 간 채널로 인한 성능 영향을 설명하기 위한 도면이다. 도 2의 예에서 기지국의 주변에 RIS 장치가 설치되고, RIS 장치은 RIS 빔북 정보에서 선택된 반 사 패턴 에 따라 각 RIS 장치에 입사되는 기지국의 송신 빔을 음영 지역(R1) 내 단말(130b) 방향으로 반사시킬 수 있다. 도 2의 예에서 단말(130a)은 제1 대역을 이용하고, 단말(130b)은 제2 대역을 이용 함을 가정한다. 제1 대역을 이용하는 단말(130a)의 다운링크 채널은 아래 [수학식 2]와 같이 나타낼 수 있 으며, 제2 대역을 이용하는 단말(130b)의 다운링크 채널은 아래 [수학식 3]와 같이 나타낼 수 있다. [수학식 2]"}
{"patent_id": "10-2022-0139618", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "[수학식 3]"}
{"patent_id": "10-2022-0139618", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "상기 [수학식 2]에서 Hd,1은 기지국과 단말(130a) 간의 직접 경로의 채널(즉 BS-UE 채널), Hr는 기지국과 RIS 장치 간의 채널(즉 BS-RIS 채널), G1는 RIS 장치와 단말 (130a) 간의 반사 경로의 채널(즉 RIS-UE 채널), 그리고 은 반사 패턴을 나타낸 것이다. 상기 [수학식 3]에 서 Hr는 기지국과 RIS 장치 간의 채널(즉 BS-RIS 채널) 그리고 G2는 RIS 장치와 단 말(130b) 간의 반사 경로의 채널(즉 RIS-UE 채널)을 나타낸 것이다. 도 2에서 RIS 장치는 음영 지역(R1) 내, 제2 대역을 이용하는, 단말(130b)에게 송신되는 기지국(11 0)의 다운링크 신호를 잘 반사하여 단말(130b)에서 수신 신호 세기를 높일 수 있지만, RIS 장치에서 광대 역 반사 특성( )으로 인해 제1 대역을 이용하는 단말(130b)에게는 다른 대역 간(cross-band)(혹은 다른 캐리어 간(cross-carrier))에 예를 들어, [수학식 2]에서 의 채널에 의한 성능 열화가 발생 될 수 있다. 따라서 RIS 장치의 광대역 반사 특성을 고려하여, 특정 단말(도 2의 예의 경우 단말(130b))에 대한 전송 성능만을 향상시키는 것이 아니라 cross-band(혹은 cross-carrier)에서 반사 패턴 최적화를 통해 네 트워크에서 전체 성능을 향상시킬 필요가 있다. 도 3은 RIS를 지원하는 무선 통신 시스템에서 다수의 단말들이 다수의 대역들을 이용하는 통신 환경에서 각 단 말의 RIS 반사 패턴별 수신 신호 세기의 일 예를 나타낸 도면이다. 도 3의 예에서 UE1과 UE2는 제1 대역(Band 1)을 이용하고, UE3은 제2 대역(Band2)을 이용하여 통신을 수행함을 가정한다. 도 3의 (a), (b) 및 (c)는 각각 RIS 장치에서 내지 의 반사 패턴들이 이용되는 경우, UE1, UE2 및 UE3에서 수신 신호 세기(reference signal received power : RSRP)들의 일 예를 나타낸 것이다. 도 3의 (a), (b) 및 (c)에서 가로 축에 도시된 \"0\" 내지 \"4\"는 각각 RIS 장치의 각 반사 패턴을 통해 반사되어 단말에서 수 신된 기준 신호인 CSI-RS의 ID를 나타낸 것이다. 그리고 도 3에서 참조 번호 301은 UE1, UE2 및 UE3에서 RSRP가 양호한(상대적으로 큰) 기지국의 best 송신 빔(들)을 나타낸 것이고, 참조 번호 302는 UE1, UE2 및 UE3에서 RSRP가 좋지 않은(상대적으로 작은) 기지국의 worst 송신 빔(들)을 나타낸 것이다. 도 3의 (a)를 참조하면, UE1은 반사 패턴 과 에서 RSRP가 양호한 신호를 수신하고, 반사 패턴 에서 RSRP가 좋지 않은 신호를 수신한다. 도 3의 (b)를 참조하면, UE2는 반사 패턴 와 에서 RSRP가 양호한 신 호를 수신하고, 반사 패턴 에서 RSRP가 좋지 않은 신호를 수신한다. 그리고 도 3의 (c)를 참조하면, UE3은 반사 패턴 과 에서 RSRP가 양호한 신호를 수신하고, 반사 패턴 에서 RSRP가 좋지 않은 신호를 수신한 다. 도 4a는 도 3의 RIS 기반의 통신 환경에서 대역 간(cross-band) 광대역 반사로 인한 성능 열화를 설명하기 위한 도면이다.도 3의 통신 환경에서 만약 기지국이 각 단말로부터 내지 의 반사 패턴들에 대해 RSRP가 가장 큰 예컨 대, 2 개의 best 송신 빔들에 대한 정보(예를 들어 해당 송신 빔의 인덱스)를 보고 받는다면, 기지국은 단말에 게 다운링크 송신을 위한 스케줄링 시 예를 들어 슬롯(여기서 slot은 3GPP NR 표준에서 slot을 의미함) 마다 그 2 개의 best 송신 빔들에 상응하는 반사 패턴들을 적용하게 된다. 이 경우 기지국이 도 4a의 참조 번호 401과 같은 스케줄링을 통해 제1 대역(Band1)을 이용하는 UE1 및 UE2와, 제2 대역(Band2)을 이용하는 UE3에게 각각 t1 시점에서 반사 패턴 을 적용하고, t2 시점에서 반사 패턴 을 적용하면, t1 시점에서 반사 패턴 (도 3 의 (a)를 참조하면, 반사 패턴 의 적용 시 UE1의 RSRP는 좋지 않다.)의 적용으로 인해 UE1에서 다른 대역 간 (cross-band)(혹은 cross-carrier)(이하, \"대역간\") 광대역 반사의 영향으로 인한 성능 열화가 발생된다. 따라 서 대역간 광대역 반사로 인한 성능 열화를 방지하기 위한 방안이 요구된다. 도 4b는 본 개시의 실시 예에 따라 RIS 기반의 통신 환경에서 대역 간 광대역 반사로 인한 성능 열화를 방지하 기 위한 방법을 설명하기 위한 도면이다. 도 4b의 예에서 본 개시의 실시 예에 따른 기지국은 도 3와 같은 통신 환경에서 각 단말로부터 내지"}
{"patent_id": "10-2022-0139618", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "의 반사 패턴들에 대해 RSRP가 가장 큰 예컨대, 적어도 하나의 best 송신 빔과 RSRP가 가장 작은 적어도 하나의 worst 송신 빔 중 적어도 하나에 대한 정보(예를 들어 해당 송신 빔의 인덱스)를 보고 받을 수 있다. 도 4b의 (a)는 기지국이 단말로부터 예를 들어 RSRP의 세기가 가장 큰 하나의 best 송신 빔의 정보와 RSRP의 세 기가 가장 작은 하나의 worst 송신 빔의 정보를 보고 받은 경우 기지국의 다운링크 스케줄링 방식을 예시한 것 이다. 도 4b의 (b)는 예를 들어 기지국이 단말로부터 예를 들어 RSRP의 세기가 가장 큰 순서로 2 개의 best 송 신 빔들의 정보와 RSRP의 세기가 가장 작은 하나의 worst 송신 빔의 정보를 보고 받은 경우 기지국의 다운링크 스케줄링 방식을 예시한 것이다. 도 4b의 (a)에서 참조 번호 411과 같은 스케줄링을 통해 제1 대역을 이용하는 UE2와 제2 대역을 이용하는 UE3에 게 t1 시점에서 반사 패턴 을 적용하고, t2 시점에서 UE1과 UE3에게 반사 패턴 을 적용하면, t1 시점에서 UE1에게 반사 패턴 을 적용하지 않게 되므로, 다른 대역간 광대역 반사의 영향으로 도 3의 예와 같이 UE1에 게 발생되는 성능 열화를 방지할 수 있다. 또한 도 4b의 (b)에서 참조 번호 412과 같은 스케줄링을 통해 제1 대 역을 이용하는 UE2와 제2 대역을 이용하는 UE3에게 t1 시점에서 상대적으로 RSRP가 양호한 반사 패턴 을 적 용하고, t2 시점에서 UE1과 UE3에게 상대적으로 RSRP가 양호한 반사 패턴 을 적용하면, 대역간 광대역 반사 의 영향으로 인한 영향을 방지할 수 있다. 도 4b의 예와 같이, 본 개시에서는 광대역 반사 특성을 갖는 RIS 장치를 사용하는 통신 환경에서, 대역간 광대 역 반사의 영향을 방지할 수 있는 최적 스케줄링을 수행할 수 있다. 이를 위해 본 개시에서 기지국은 각 단말로 부터 RSRP가 가장 큰 예컨대, 적어도 하나의 best 송신 빔과 RSRP가 가장 작은 적어도 하나의 worst 송신 빔 중 적어도 하나에 대한 정보(예를 들어 해당 송신 빔의 인덱스)를 포함하는 CSI를 보고 받을 수 있다. 여기서 상기 CSI는 CQI, PMI 및 RI를 제외하고 상기 best 송신 빔 및/또는 worst 송신 빔에 대한 정보를 포함할 수 있다. 다 른 실시 예로 상기 CSI는 CQI, PMI 및 RI 중 적어도 하나와, 상기 best 송신 빔 및/또는 worst 송신 빔에 대한 정보를 포함할 수 있다. 본 개시에서는 단말로부터 CSI 보고에 상기와 같이 적어도 하나의 worst 송신 빔에 대 한 정보를 포함하여 대역간 광대역 반사로 인해 발생되는 채널 간 상쇄 간섭에 의한 성능 열화를 방지할 수 있 다. 또한 본 개시에서 단말은 기지국의 각 송신 빔을 통해 수신되는 CSI-RS를 측정하여 각 송신 빔의 RSRP를 확인할 수 있다. 본 개시에서 기지국은 상기 best 송신 빔 및/또는 worst 송신 빔의 보고를 받기 위한 CSI-RS들을 적어 도 하나의 그룹(이하 \"CSI-RS 그룹\"으로 칭할 수 있다.)으로 구분하고, CSI-RS 그룹(들)에 대한 자원들을 설정 할 수 있다. 본 개시에서 기지국이 단말(들)로부터 상기 best 송신 빔 및/또는 worst 송신 빔의 보고를 받기 위한 설정 정보 및/또는 제어 정보는 상위 계층 시그널링 및/또는 L1 시그널링을 통해 단말(들)에게 제공될 수 있다.이하 본 개시를 설명함에 있어서, 상위 계층 시그널링이라 함은 하기의 시그널링 중에서 적어도 하나 또는 하나 이상의 조합에 해당하는 시그널링일 수 있다. - MIB (Master Information Block) - SIB (System Information Block) 또는 SIB X (X=1, 2, …) - RRC (Radio Resource Control) - MAC (Medium Access Control) CE (Control Element) 또한, L1 시그널링이라 함은 하기의 물리 계층 채널 또는 시그널링 방법 중에서 적어도 하나 또는 하나 이상의 조합에 해당하는 시그널링일 수 있다. - PDCCH (Physical Downlink Control Channel) - DCI (Downlink Control Information) - 단말-특정 (UE-specific) DCI - 그룹 공통 (Group common) DCI - 공통 (Common) DCI - 스케쥴링 DCI (예를 들어 하향링크 또는 상향링크 데이터를 스케쥴링하는 목적으로 사용되는 DCI) - 비스케쥴링 DCI (예를 들어 하향링크 또는 상향링크 데이터를 스케쥴링하는 목적이 아닌 DCI) 도 5a 및 도 5b는 본 개시의 실시 예에 따라 RIS를 지원하는 무선 통신 시스템에서 CSI-RS 그룹별 CSI 보고 방 법을 설명하기 위한 도면이다. 도 5a 및 도 5b의 시스템에서 기지국의 주변에 RIS 장치가 설치되고, RIS 장치는 기지국의 제어 정보에 따라 선택적으로 On 또는 Off 상태로 동작 제어되며, On 동작 시 RIS 장치는 도 2에서 설명한 것처럼, RIS 빔북 정보에서 선택된 반사 패턴에 따라 RIS 장치에 입사되는 기지국의 송신 빔을 단말 들(530a, 530b)에게 반사시킬 수 있다. RIS 장치는 Off 상태에서 기지국의 송신 빔을 반사시키지 않 는다. 도 5a 및 도 5b에서 단말(530a)은 제1 대역을 이용하고, 단말(530b)은 제2 대역을 이용함을 가 정한다. 편의상 도 5a 및 도 5b에서 음영 지역의 도시는 생략하였다. 도 5a 및 도 5b의 예서는 단말들이 이용하 는 주파주 대역은 두 개의 주파수 대역들을 예시하였으나, 둘 이상의 대역들을 이용하는 경우에도 본 개시는 동 일한 방식으로 적용될 수 있다. 본 개시에서 기지국은 best 송신 빔 및/또는 worst 송신 빔에 대한 정보를 포함하는 CSI를 보고받기 위한 적어 도 하나의 CSI-RS 그룹을 설정할 수 있다. 도 5의 (a)에서 기지국은, 단말들(530a, 530b)이 기지국으로 적어도 하나의 best 송신 빔에 대한 정 보(예를 들어, 해당 best 송신 빔의 인덱스 정보)를 포함하는 제1 CSI를 보고하기 위한 제1 CSI-RS들을 제1 CSI-RS 그룹(예를 들어, \"group 0\")으로 설정할 수 있다. 기지국은 단말들(530a, 530b)에게 제1 CSI-RS 그룹에 속하는 제1 CSI-RS들의 자원들을 할당하고, 제1 CSI-RS들을 수신한 단말들(530a, 530b)은 각각 해당 CSI-RS 자원(들)에서 RSRP 측정을 수행하여 해당 CSI-RS(들)을 송신한 기지국의 적어도 하나의 best 송신 빔에 대한 정보를 포함하는 제1 CSI를 기지국으로 송신한다(501, 502). 상기 제1 CSI-RS 그룹에 대한 상기 제1 CSI 보고 동작에서 RIS 장치는 Off 상태로 제어될 수 있다. 도 5의 (b)에서 기지국은, 단말들(530a, 530b)이 기지국으로 적어도 하나의 best 송신 빔과 적어도 하나의 worst 송신 빔에 대한 정보(예를 들어, 해당 best 송신 빔과 worst 송신의 인덱스 정보)를 포함하는 제2 CSI를 보고하기 위한 제2 CSI-RS들을 제2 CSI-RS 그룹(예를 들어, \"group 1\")으로 설정할 수 있다. 기지국 은 단말들(530a, 530b)에게 제2 CSI-RS 그룹에 속하는 제2 CSI-RS들의 자원들을 할당하고, 제2 CSI-RS들 을 수신한 단말들(530a, 530b)은 각각 해당 CSI-RS 자원(들)에서 RSRP 측정을 수행하여 해당 CSI-RS(들)을 송신 한 기지국의 적어도 하나의 best 송신 빔과 적어도 하나의 worst 송신 빔에 대한 정보를 포함하는 제2 CSI 를 기지국으로 송신한다(503, 504). 상기 제2 CSI-RS 그룹에 대한 상기 제2 CSI 보고 동작에서 RIS 장치 는 On 상태로 제어될 수 있다. 한편 본 개시에서 상기 제1 및 제2 CSI-RS 그룹은 기지국에서만 구분될 수 있으며, 단말들(530a, 530b)에 게 상기 제1 및 제2 CSI-RS 그룹을 나타내는 설정 정보의 제공은 생략될 수 있다. 즉 본 개시에서 기지국은 각 CSI-RS 그룹을 구분할 수 있으며, 단말이 각 CSI-RS 그룹 자체를 구분할 필요는 없 으며, 기지국은 각 단말에게 각 CSI-RS 그룹에서 CSI 보고를 위한 CSI-RS 자원(들) 및 best/worst 송신 빔 몇 개에 대한 정보를 CSI로 보고할지에 대한 설정 정보를 제공할 수 있다(예를 들어, 그 설정 정보는 각 CSI-RS 그 룹 중에서 단말에게 할당된 CSI-RS 자원(들)에 대해 best beam 몇 개 및/또는 worst beam 몇 개에 대한 CSI 보 고를 할 지에 대한 설정을 포함할 수 있다). 상기 제1 CSI-RS 그룹(\"group 0\")에서 RIS 장치는 Off 상태로 되므로, 제1 CSI 보고는 각 대역에서 RIS 장치에 의한 대역간 광대역 반사 영향을 제외하고 기지국의 송신 빔의 영향을 고려한 것이다. 상기 제2 CSI-RS 그룹(\"group 1\")에서 RIS 장치는 On 상태로 되므로, 제2 CSI 보고는 각 대역에서 기지국(51 0)의 송신 빔의 영향은 물론 RIS 장치의 반사 동작으로 인한 대역간 광대역 반사 영향을 함께 고려한 것이다. 도 6은 본 개시의 실시 예에 따라 RIS를 지원하는 무선 통신 시스템에서 CSI-RS 그룹을 설정하는 방법을 나타낸 도면이다. 도 6을 참조하면, 본 개시에서 CSI-RS 그룹은, RIS 장치의 반사 특성으로 인한 대역간 광대역 반사 영향을 고려 하지 않는 제1 CSI(즉 artificially non-modified CSI)를 보고하기 위한 제1 CSI-RS들(CSI-RS 0,..., CSI-RS N1-1)을 제1 CSI-RS 그룹(\"group 0\")으로 설정하고, RIS 장치의 반사 특성으로 인한 대역간 광대역 반사 영향을 고려한 제2 CSI(즉 artificially modified CSI)를 보고하기 위한 제2 CSI-RS들(CSI-RS N1,..., CSI-RS N1+N2-1)을 제2 CSI-RS 그룹(\"group 1\")으로 설정할 수 있다. 기지국은 단말(들)에게 상기 제1 및 제2 CSI-RS 그룹들에 대한(에 상응하는) CSI-RS 자원 정보를 제공할 수 있다. 도 6의 예에서 CSI-RS 그룹는 두 개의 그룹으로 구분하였으나, 하나 또는 둘 이상의 CSI-RS 그룹들을 설정하는 것도 가능하다. 도 7은 본 개시의 실시 예에 따라 RIS를 지원하는 무선 통신 시스템에서 CSI-RS 그룹의 자원들을 설정하는 방법 의 일 예를 나타낸 도면이다. 도 7에서 CSI-RS #0 내지 CSI-RS #7은 기지국이 설정할 수 있는 다수의 CSI-RS들이고, wo과 w1은 기지국의 서로 다른 송신 빔들의 빔포밍 벡터들이고, , 및 는 기지국의 제어에 따라 RIS 장치에서 적용될 수 있는 서로 다른 RIS 반사 패턴들이다. 기지국은 빔포밍 벡터와 RIS 반사 패턴의 다양한 조합으로 단말로의 직접 경로 혹은 RIS 장치를 경유한 반사 경로에서 단말에게 송신 빔을 통해 CSI-RS을 송신할 수 있다. 도 7에서 기지국은 예를 들어, 대역간 광대역 반사 영향을 고려하지 않는 제1 CSI를 보고하기 위한 제1 CSI- RS들(CSI-RS #0, CSI-RS #1)을 포함하는 제1 CSI-RS 그룹(\"group 0\")과, 대역간 광대역 반사 영향을 고려 한 제2 CSI를 보고하기 위한 제2 CSI-RS들(CSI-RS #2 내지 CSI-RS #7)을 제2 CSI-RS 그룹(\"group 1\")으로 설정할 수 있다. 제1 CSI-RS 그룹 내 제1 CSI-RS들(CSI-RS #0, CSI-RS #1)의 송신 시 RIS 장치는 기지국 에 의해 Off 상태로 제어된다. 제2 CSI-RS 그룹 내 제2 CSI-RS들(CSI-RS #2 내지 CSI-RS #7)의 송신 시 RIS 장치는 기지국에 의해 On 상태로 제어된다. 도 7의 예에서 제1 CSI-RS 그룹의 제1 CSI-RS들(CSI-RS #0, CSI-RS #1)은 빔포밍 벡터만을 적용하여 송신 되고, 제2 CSI-RS 그룹은 제2 CSI-RS들(CSI-RS #2 내지 CSI-RS #7)은 빔포밍 벡터와 RIS 반사 패턴의 조 합을 적용하여 송신된다. 도 7의 예에서 제2 CSI-RS 그룹은 다수의 CSI-RS subset 들(subset 0, subset 1, subset 2)(720a, 720b, 720c)을 포함한다. 다수의 CSI-RS subset 들(720a, 720b, 720c)의 각 CSI-RS subset 내 CSI-RS들에는 예를 들어 동일한 RIS 반사 패턴이 적용되고, 서로 다른 CSI-RS subset 간에는 서로 다른 RIS 반사 패턴이 적용될 수 있다. 동일한 CSI-RS subset 내 CSI-RS들 간에는 서로 다른 혹은 동일한 빔포밍 벡터가 적용될 수 있다. 도 7의 예에서 다수의 CSI-RS subset 들(720a, 720b, 720c)은 편의상 3 개의 subset들을 예시 하였으나, 제2 CSI-RS 그룹은 둘 이상의 CSI-RS subset 들을 포함할 수 있다. 기지국은 각 단말에게 제2 CSI-RS 그룹 내 일부 CSI-RS subset(들)을 설정해 줄 수 있다. 본 개시에서 기 지국은 단말에게 CSI-RS 그룹 및/또는 CSI-RS subset 자체를 구분하기 위한 정보를 제공하지 않고, 단말에게 설 정된 CSI-RS들에 대한 자원 정보를 상기한 상위 계층 시그널링(RRC 정보, DCI 등)을 통해 단말에게 제공할 수 있다.도 8은 본 개시의 실시 예에 따라 RIS를 지원하는 무선 통신 시스템에서 CSI-RS 그룹의 자원들을 설정하는 방법 의 다른 예를 나타낸 도면이다. 도 8에서 CSI-RS #0 내지 CSI-RS #7은 기지국이 설정할 수 있는 다수의 CSI-RS들이고, wo과 w1은 기지국의 서로 다른 송신 빔들의 빔포밍 벡터들이고, , 및 는 기지국의 제어에 따라 RIS 장치에서 적용될 수 있는 서로 다른 RIS 반사 패턴들이다. 기지국은 빔포밍 벡터와 RIS 반사 패턴의 다양한 조합으로 단말로의 직접 경로 혹은 RIS 장치를 경유한 반사 경로에서 단말에게 송신 빔을 통해 CSI-RS을 송신할 수 있다. 도 8에서 기지국은 예를 들어, 대역간 광대역 반사 영향을 고려하지 않는 제1 CSI를 보고하기 위한 제1 CSI- RS들(CSI-RS #0, CSI-RS #1)을 포함하는 제1 CSI-RS 그룹(\"group 0\")과, 대역간 광대역 반사 영향을 고려 한 제2 CSI를 보고하기 위한 제2 CSI-RS들(CSI-RS #2 내지 CSI-RS #7)을 제2 CSI-RS 그룹(\"group 1\")으로 설정할 수 있다. 제1 CSI-RS 그룹 내 제1 CSI-RS들(CSI-RS #0, CSI-RS #1)의 송신 시 RIS 장치는 기지국 에 의해 Off 상태로 제어된다. 제2 CSI-RS 그룹 내 제2 CSI-RS들(CSI-RS #2 내지 CSI-RS #7)의 송신 시 RIS 장치는 기지국에 의해 On 상태로 제어된다. 도 8의 예에서 제1 CSI-RS 그룹의 제1 CSI-RS들(CSI-RS #0, CSI-RS #1)은 빔포밍 벡터만을 적용하여 송신 되고, 제2 CSI-RS 그룹의 제2 CSI-RS들(CSI-RS #2 내지 CSI-RS #7)은 빔포밍 벡터와 RIS 반사 패턴의 조 합을 적용하여 송신된다. 도 8의 예에서 제2 CSI-RS 그룹은 다수의 CSI-RS subset 들(subset 0, subset 1)(820a, 820b)을 포함한다. 다수의 CSI-RS subset 들(820a, 820b)의 각 CSI-RS subset 내 CSI-RS들에는 예를 들어 동일한 빔포밍 벡터가 적용되고, 서로 다른 CSI-RS subset 간에는 서로 다른 빔포밍 벡터가 적용될 수 있 다. 동일한 CSI-RS subset 내 CSI-RS들 간에는 서로 다른 혹은 동일한 RIS 반사 패턴이 적용될 수 있다. 도 8의 예에서 다수의 CSI-RS subset 들(820a, 820b)은 편의상 2 개의 subset들을 예시하였으나, 제2 CSI-RS 그룹 은 둘 이상의 CSI-RS subset 들을 포함할 수 있다. 기지국은 각 단말에게 제2 CSI-RS 그룹 내 일부 CSI-RS subset(들)을 설정해 줄 수 있다. 본 개시에서 기 지국은 단말에게 CSI-RS 그룹 및/또는 CSI-RS subset 자체를 구분하기 위한 정보를 제공하지 않고, 단말에게 설 정된 CSI-RS들에 대한 자원 정보를 상기한 상위 계층 시그널링(SIB, RRC 정보, DCI 등)을 통해 단말에게 제공할 수 있다. 도 9는 본 개시의 실시 예에 따라 RIS를 지원하는 무선 통신 시스템에서 CSI-RS 그룹별 CSI-RS 송신 주기를 설 정하는 방법의 예를 나타낸 도면이다. 도 9의 예에서 기지국(BS)은 도 7 또는 도 8의 예와 같이, 제1 CSI-RS 그룹(710 or 810)과 제2 CSI-RS 그룹 (720 or 820)을 설정할 수 있다. 도 9에서 wo과 w1은 각 CSI-RS 그룹(혹은 각 CSI-RS subset)에 적용되는 기지 국의 송신 빔들의 빔포밍 벡터들이고, \"Off\"는 해당 구간에서 RIS 장치가 기지국에 의해 Off 상태로 제어됨을 의미하고, \" \" or \" \"은 해당 구간에서 기지국의 제어에 따라 RIS 장치에서 적용되는 RIS 반사 패턴을 의 미한다. 도 9의 예에서 기지국(BS)은 각 CSI-RS 그룹(\"group 0\", \"group 1)\" 마다 CSI-RS 송신 주기를 다르게 설정할 수 있다. 예를 들어 제1 CSI-RS 그룹(\"group 0\")에는 제1 송신 주기(T0, 910)을 설정하고, 제2 CSI-RS 그룹 (\"group 1\")에는 제2 송신 주기(T1, 920)을 설정할 수 있다. 예를 들어 기지국과 RIS 장치 간의 시그널링 오버 헤드를 감소시키기 위해, RIS 반사 패턴의 스위칭 주기를 길게 운용하는 경우, 상기 제2 송신 주기(T1, 920)는 상기 제1 송신 주기(T0, 910) 보다 상대적으로 긴 주기로 설정할 수 있다. 상기 제1 송신 주기(T0, 910)와 제2 송신 주기(T1, 920)는 예컨대, 5G 시스템에서 슬롯 단위로 설정하거나 혹은 심볼/서브프레임/프레임 단위와 같 이 다양한 단위로 설정될 수 있다. CSI-RS 그룹별 CSI-RS 송신 주기에 대한 설정 정보는 기지국이 단말에게 상 위 계층 시그널링(SIB, RRC 정보, DCI 등)을 통해 제공할 수 있다. 도 10은 본 개시의 실시 예에 따라 RIS를 지원하는 무선 통신 시스템에서 CSI-RS 그룹의 CSI 보고를 위한 설정 방법의 일 예를 설명하기 위한 도면이다. 도 10의 예는 CSI-RS 그룹 내 CSI-RS subset별 CSI 보고를 위한 설정 방법을 나타낸 것이다. 도 10의 예에서 기지국은 전술한 제1 CSI의 보고를 위한 제1 CSI-RS들(CSI-RS #0 내지 CSI-RS #3)을 포함하는 제1 CSI-RS 그룹(\"group 0\")과 전술한 제2 CSI의 보고를 위한 제2 CSI-RS들(CSI-RS #4 내지 CSI-RS #11)을 제2CSI-RS 그룹(\"group 1\")으로 설정할 수 있다. 도 10의 예에서 제2 CSI-RS 그룹(\"group 1\")은 CSI-RS #4 내지 CSI-RS #7을 포함하는 제1 CSI-RS subset(\"subset 0\")과, CSI-RS #8 내지 CSI-RS #11을 포함하는 제2 CSI-RS subset(\"subset 1\")을 포함하는 상황을 가정한다. 만약 기지국이 제1 CSI-RS 그룹(\"group 0\") 내에서 RSRP가 상대적으로 큰 M 개의 CSI-RS(들)에 대한 제1 CSI 보고와, 제2 CSI-RS 그룹(\"group 1\")의 각 CSI-RS subset 내에서 RSRP가 상대적으로 큰 N 개의 CSI-RS(들) 및 RSRP가 상대적으로 작은 K 개의 제2 CSI 보고를 설정하면, 기지국은 단말에게 상기 M, N 및 K의 값들을 포함하 는 설정 정보를 제공할 수 있다. 도 10의 예는 M=1, N=1 및 K=1로 설정된 경우를 예시한 것이다. 기지국은 상기 설정 정보를 단말에게 제공하고, 단말로부터 제1 CSI-RS 그룹(\"group 0\")에서 RSRP가 큰 CSI-RS #2를 송 신한 1 개의 best 송신 빔의 인덱스 정보를 제1 CSI 보고로 수신할 수 있으며, 제2 CSI-RS 그룹(\"group 1\")의 CSI-RS subset 0과 CSI-RS subset 1에서 각각 RSRP가 큰 CSI-RS #7과 CSI-RS #9를 송신한 CSI-RS subset 별로 1 개의 best 송신 빔의 인덱스 정보를 제2 CSI 보고로 수신할 수 있으며, 또한 제2 CSI-RS 그룹 (\"group 1\")의 CSI-RS subset 0과 CSI-RS subset 1에서 각각 RSRP가 작은 CSI-RS #5와 CSI-RS #11를 송신한 CSI-RS subset별로 1 개의 worst 송신 빔의 인덱스 정보를 제2 CSI 보고로 수신할 수 있다. 도 10의 예 에서 상기 제2 CSI 보고(1020, 1030)는 제2 CSI-RS 그룹(\"group 1\")의 CSI-RS subset별로 1 개의 best 송신 빔 과 1 개의 worst 송신 빔의 정보를 포함할 수 있다. 도 11은 본 개시의 실시 예에 따라 RIS를 지원하는 무선 통신 시스템에서 CSI-RS 그룹별 CSI 보고를 위한 설정 방법의 다른 예를 설명하기 위한 도면이다. 도 11의 예는 CSI-RS 그룹별 CSI 보고를 위한 설정 방법을 나타낸 것이다. 도 11의 예에서 기지국은 전술한 제1 CSI의 보고를 위한 제1 CSI-RS들(CSI-RS #0 내지 CSI-RS #3)을 포함하는 제1 CSI-RS 그룹(\"group 0\")과 전술한 제2 CSI의 보고를 위한 제2 CSI-RS들(CSI-RS #4 내지 CSI-RS #11)을 제2 CSI-RS 그룹(\"group 1\")으로 설정할 수 있다. 도 11의 예에서 제2 CSI-RS 그룹(\"group 1\")은 CSI-RS #4 내지 CSI-RS #7을 포함하는 제1 CSI-RS subset(\"subset 0\")과, CSI-RS #8 내지 CSI-RS #11을 포함하는 제2 CSI-RS subset(\"subset 1\")을 포함하는 상황을 가정한다. 만약 기지국이 제1 CSI-RS 그룹(\"group 0\") 내에서 RSRP가 상대적으로 큰 M 개의 CSI-RS(들)에 대한 제1 CSI 보고와, 제2 CSI-RS 그룹(\"group 1\") 내에서 RSRP가 상대적으로 큰 P 개의 CSI-RS(들) 및 RSRP가 상대적으로 작은 Q 개의 제2 CSI 보고를 설정하면, 기지국은 단말에게 상기 M, P 및 Q의 값들을 포함하는 설정 정보를 제공 할 수 있다. 도 11의 예는 M=1, P=2 및 Q=2로 설정된 경우를 예시한 것이다. 기지국은 상기 설정 정보를 단말에 게 제공하고, 단말로부터 제1 CSI-RS 그룹(\"group 0\")에서 RSRP가 큰 CSI-RS #2를 송신한 1 개의 best 송신 빔의 인덱스 정보를 제1 CSI 보고로 수신할 수 있으며, 제2 CSI-RS 그룹(\"group 1\") 내에서 RSRP가 상대적으로 큰 CSI-RS #4와 CSI-RS #7을 송신한 2 개의 best 송신 빔의 인덱스 정보를 제2 CSI 보고로 수신할 수 있으며, 또한 제2 CSI-RS 그룹(\"group 1\") 내에서 RSRP가 상대저으로 작은 CSI-RS #10과 CSI-RS #11 를 송신한 2 개의 worst 송신 빔의 인덱스 정보를 제2 CSI 보고로 수신할 수 있다. 도 11의 예에서 상기 제2 CSI 보고(1120, 1130)는 제2 CSI-RS 그룹(\"group 1\")에 대해 2 개의 best 송신 빔과 2 개의 worst 송신 빔 의 정보를 포함할 수 있다. 상기한 실시 예들과 같이, 기지국은 CSI-RS 그룹별(혹은 CSI-RS 그룹내 subset별)로 단말의 CSI 보고를 위한 설 정 정보를 다양한 형태로 설정할 수 있다. 선택적인 실시 예로 기지국은 단말에게 CSI 보고를 위한 worst case CSI 보고 지시자를 설정하여 제공할 수 있다. CSI 보고를 위한 설정 정보에 상기 worst case CSI 보고 지시자가 포함된 경우, 단말은 상기 worst case CSI 보고 지시자에서 값을 근거로, CSI 보고에 포함되는 worst 송신 빔 정보의 개수를 확인할 수 있다. 예를 들어 worst case CSI 보고 지시자 = V (여기서 V>0)인 경우, 단말은 CSI- RS 그룹별(혹은 CSI-RS 그룹내 subset별)로 RSRP가 상대적으로 작은 V 개의 worst 송신 빔 정보를 CSI 보고에 포함하여 기지국으로 송신할 수 있다. worst case CSI 보고 지시자 = 0인 경우, 단말은 worst 송신 빔 정보를 CSI 보고에 포함하지 않게 된다. 또한 상기한 실시 예와 같이, 기지국은 CSI-RS 그룹별 CSI-RS 송신 주기를 다르게 설정하고, 그 CSI-RS 송신 주 기를 포함하는 설정 정보를 단말에게 제공할 수 있다. 이 경우 상기 CSI-RS 송신 주기는 CSI-RS 그룹별 주기를 나타내는 파라미터(Tr)를 포함할 수 있다. 상기 파라미터(Tr)는 일 예로 슬롯 단위로 설정될 수 있으며, 파라미 터(Tr) 값이 \"0\"으로 설정되는 경우 CSI-RS 그룹별 CSI-RS 송신 주기는 비주기적으로 설정될 수 있다. 선택적인 실시 예로 best 송신 빔에 대한 best CSI 보고와 worst 송신 빔에 대한 worst CSI 보고를 개별적으로 설정할 수도 있다. 이 경우 best case CSI 보고 주기를 나타내는 파라미터(Tb)와 worst case CSI 보고 주기를 나타내는 파라미터(Tw)가 단말로 제공되는 설정 정보에 포함될 수 있다. 이 경우 제1 CSI-RS 그룹(\"group 0\")에 대해, 0 보다 큰 파라미터(Tb)가 설정된 경우, 단말은 best case CSI 보고를 Tb 주기로 수행할 수 있다. 그리고 제2 CSI-RS 그룹(\"group 1\")에 대해, 0 보다 큰 파라미터(Tw)가 설정된 경우, 단말은 worst case CSI 보고를 Tw 주기로 수행할 수 있다. 파라미터(Tw)가 0으로 설정된 경우, 단말의 worst case CSI 보고는 DCI와 같은 제어 정 보에 의해 비주기적으로 수행될 수 있다. 도 12은 본 개시의 실시 예에 따라 RIS를 지원하는 무선 통신 시스템에서 기지국에 의해 수행되는 방법을 나타 낸 도면이다. 동작 1201에서 기지국은 RIS 반사패턴과 기지국의 송신 빔(송신 빔의 빔포밍 벡터) 중 적어도 하나를 근거로, 적어도 하나의 CSI-RS 그룹을 설정할 수 있다. 동작 1202에서 기지국은 설정된 CSI-RS 그룹을 근거로, 기지국에 서 CSI-RS를 송신하는 best beam과 worst beam 중 적어도 하나와 관련된 단말의 CSI 보고를 위한 설정 정보를 단말에게 송신할 수 있다. 동작 1203에서 기지국은 설정 정보를 수신한 단말로부터, 기지국이 CSI-RS를 송신한 best beam과 worst beam 중 적어도 하나에 대한 빔 정보(예를 들어, 해당 송신 빔의 인덱스 정보)를 포함하는 CSI 보고를 수신할 수 있다. 이후 동작 1204에서 기지국은 해당 단말로부터 수신한 CSI 보고를 근거로 RIS 장치 의 반사 특성으로 인한 대역간 광대역 반사 영향을 감소시키는 최적 스케줄링을 수행할 수 있다. 도 13은 본 개시의 실시 예에 따라 RIS를 지원하는 무선 통신 시스템에서 단말에 의해 수행되는 방법을 나타낸 도면이다. 동작 1301에서 단말은, 기지국이 단말에게 CSI-RS를 송신하는 best beam과 worst beam 중 적어도 하나와 관련된 빔 정보(예를 들어, 해당 송신 빔의 인덱스 정보)를 포함하는 CSI 보고를 위한 설정 정보를 전술한 상위 계층 시그널링을 통해 기지국으로부터 수신할 수 있다. 동작 1302에서 단말은 수신한 설정 정보를 근거로, 단말에게 설정된 CSI-RS 자원에서 RSRP 측정을 수행하여 기지국이 CSI-RS를 송신하는 best beam과 worst beam 중 적어도 하나를 확인할 수 있다. 동작 1303에서 단말은 기지국의 best beam과 worst beam 중 적어도 하나에 대한 상기 빔 정보를 포함하는 CSI 보고를 기지국으로 송신할 수 있다. 상기 CSI 보고는 전술한 것처럼 CSI-RS 그룹별(혹 은 CSI-RS 그룹내 subset별)로 수행될 수 있다. 이후 동작 1304에서 단말은 상기 CSI 보고를 근거로 기지국으로 부터 스케줄링된 자원을 이용하여 통신을 수행할 수 있다. 도 14는 본 개시의 실시 예에 따라 RIS를 지원하는 무선 통신 시스템에서 네트워크 엔티티의 구성을 나타내는 도면이다. 도 14의 구성은 도 1 내지 도 13의 실시 예에서 기술된 기지국, 단말, RIS 장치 중 하나에 해당될 수 있다. 도 14의 네트워크 엔티티는 프로세서, 송수신기, 메모리를 포함할 수 있다. 도 1 내지 도 13 의 실시 예들에서 전술한 네트워크 엔티티의 통신 방법에 따라 상기 네트워크 엔티티의 프로세서, 송수신 기, 메모리가 동작할 수 있다. 다만, 네트워크 엔티티의 구성 요소가 전술한 예에 한정되는 것은 아니다. 예를 들어, 네트워크 엔티티는 전술한 구성 요소들 보다 더 많은 구성 요소를 포함하거나 더 적은 구성 요소를 포함할 수도 있다. 뿐만 아니라 프로세서, 송수신기, 메모리가 하나의 칩(chip) 형태 로 구현될 수도 있다. 송수신기는 네트워크 엔티티의 수신기와 네트워크 엔티티의 송신기를 통칭한 것으 로 단말 또는 다른 네트워크 엔티티와 신호를 송수신할 수 있다. 이때, 송수신하는 신호는 제어 정보와 데이터 중 적어도 하나를 포함할 수 있다. 이를 위해, 송수신기는 유선 혹은 무선 송수신부를 포함할 수 있으며, 신호를 송수신하기 위한 다양한 구성을 포함할 수 있다. 송수신기는 신호를 수신하여 프로세서로 출력하고, 프로세서로부터 출력된 신호를 전송할 수 있다. 또한, 송수신기는 통신 신호를 수신하여 프로세서로 출력하고, 프로세서로부터 출력된 신호를 네트워크를 통해 다른 네트워크 엔티티로 전 송할 수 있다. 메모리는 도 1 내지 도 13의 실시 예들 중 적어도 하나에 따른 네트워크 엔티티의 동작에 필요한 프로그램 및 데이터를 저장할 수 있다. 또한, 메모리는 네트워크 엔티티에서 획득되는 신호에 포 함된 제어 정보 또는 데이터를 저장할 수 있다. 메모리는 롬(ROM), 램(RAM), 하드디스크, CD-ROM 및 DVD 등과 같은 저장 매체 또는 저장 매체들의 조합으로 구성될 수 있다. 또한 프로세서는 도 1 내지 도 13의 실시 예들 중 적어도 하나에 따라 네트워크 엔티티가 동작할 수 있도록 일련의 과정을 제어할 수 있다. 예를 들 어 프로세서는 적어도 하나 이상의 프로세서를 포함할 수 있다. 본 개시의 청구항 또는 명세서에 기재된 실시 예들에 따른 방법들은 하드웨어, 소프트웨어, 또는 하드웨어와 소 프트웨어의 조합의 형태로 구현될(implemented) 수 있다. 소프트웨어로 구현하는 경우, 하나 이상의 프로그램(소프트웨어 모듈)을 저장하는 컴퓨터 판독 가능 저장 매체 가 제공될 수 있다. 컴퓨터 판독 가능 저장 매체에 저장되는 하나 이상의 프로그램은, 전자 장치(device) 내의 하나 이상의 프로세서에 의해 실행 가능하도록 구성된다(configured for execution). 하나 이상의 프로그램은, 전자 장치로 하여금 본 개시의 청구항 또는 명세서에 기재된 실시 예들에 따른 방법들을 실행하게 하는 명령어 (instructions)를 포함한다. 이러한 프로그램(소프트웨어 모듈, 소프트웨어)은 랜덤 액세스 메모리 (random access memory), 플래시(flash) 메모리를 포함하는 불휘발성(non-volatile) 메모리, 롬(ROM: Read Only Memory), 전기적 삭제가능 프로그램가 능 롬(EEPROM: Electrically Erasable Programmable Read Only Memory), 자기 디스크 저장 장치(magnetic disc storage device), 컴팩트 디스크 롬(CD-ROM: Compact Disc-ROM), 디지털 다목적 디스크(DVDs: Digital Versatile Discs) 또는 다른 형태의 광학 저장 장치, 마그네틱 카세트(magnetic cassette)에 저장될 수 있다. 또는, 이들의 일부 또는 전부의 조합으로 구성된 메모리에 저장될 수 있다. 또한, 각각의 구성 메모리는 다수 개 포함될 수도 있다. 또한, 상기 프로그램은 인터넷(Internet), 인트라넷(Intranet), LAN(Local Area Network), WLAN(Wide LAN), 또 는 SAN(Storage Area Network)과 같은 통신 네트워크, 또는 이들의 조합으로 구성된 통신 네트워크를 통하여 접 근(access)할 수 있는 부착 가능한(attachable) 저장 장치(storage device)에 저장될 수 있다. 이러한 저장 장 치는 외부 포트를 통하여 본 개시의 실시 예를 수행하는 장치에 접속할 수 있다. 또한, 통신 네트워크상의 별도 의 저장장치가 본 개시의 실시 예를 수행하는 장치에 접속할 수도 있다. 상술한 본 개시의 구체적인 실시 예들에서, 발명에 포함되는 구성 요소는 제시된 구체적인 실시 예에 따라 단수 또는 복수로 표현되었다. 그러나, 단수 또는 복수의 표현은 설명의 편의를 위해 제시한 상황에 적합하게 선택된 것으로서, 본 개시가 단수 또는 복수의 구성 요소에 제한되는 것은 아니며, 복수로 표현된 구성 요소라하더라도 단수로 구성되거나, 단수로 표현된 구성 요소라 하더라도 복수로 구성될 수 있다. 한편 본 개시의 상세한 설명에서는 구체적인 실시 예에 관해 설명하였으나, 본 개시의 범위에서 벗어나지 않는 한도 내에서 여러 가지 변형이 가능함은 물론이다. 그러므로 본 개시의 범위는 설명된 실시 예에 국한되어 정해 져서는 아니 되며 후술하는 특허청구의 범위뿐만 아니라 이 특허청구의 범위와 균등한 것들에 의해 정해져야 한 다."}
{"patent_id": "10-2022-0139618", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 RIS를 지원하는 무선 통신 시스템의 일 예를 나타낸 도면, 도 2는 RIS를 지원하는 무선 통신 시스템에서 다수의 대역들을 이용하는 경우, 서로 다른 대역 간 채널로 인한 성능 영향을 설명하기 위한 도면, 도 3은 RIS를 지원하는 무선 통신 시스템에서 다수의 단말들이 다수의 대역들을 이용하는 통신 환경에서 각 단 말의 RIS 반사 패턴별 수신 신호 세기의 일 예를 나타낸 도면, 도 4a는 도 3의 RIS 기반의 통신 환경에서 대역 간(cross-band) 광대역 반사로 인한 성능 열화를 설명하기 위한 도면, 도 4b는 본 개시의 실시 예에 따라 RIS 기반의 통신 환경에서 대역 간 광대역 반사로 인한 성능 열화를 방지하 기 위한 방법을 설명하기 위한 도면, 도 5a 및 도 5b는 본 개시의 실시 예에 따라 RIS를 지원하는 무선 통신 시스템에서 CSI-RS 그룹별 CSI 보고 방 법을 설명하기 위한 도면,도 6은 본 개시의 실시 예에 따라 RIS를 지원하는 무선 통신 시스템에서 CSI-RS 그룹을 설정하는 방법을 나타낸 도면, 도 7은 본 개시의 실시 예에 따라 RIS를 지원하는 무선 통신 시스템에서 CSI-RS 그룹의 자원들을 설정하는 방법 의 일 예를 나타낸 도면, 도 8은 본 개시의 실시 예에 따라 RIS를 지원하는 무선 통신 시스템에서 CSI-RS 그룹의 자원들을 설정하는 방법 의 다른 예를 나타낸 도면, 도 9는 본 개시의 실시 예에 따라 RIS를 지원하는 무선 통신 시스템에서 CSI-RS 그룹별 CSI-RS 송신 주기를 설 정하는 방법의 예를 나타낸 도면, 도 10은 본 개시의 실시 예에 따라 RIS를 지원하는 무선 통신 시스템에서 CSI-RS 그룹의 CSI 보고를 위한 설정 방법의 일 예를 설명하기 위한 도면, 도 11은 본 개시의 실시 예에 따라 RIS를 지원하는 무선 통신 시스템에서 CSI-RS 그룹별 CSI 보고를 위한 설정 방법의 다른 예를 설명하기 위한 도면, 도 12은 본 개시의 실시 예에 따라 RIS를 지원하는 무선 통신 시스템에서 기지국에 의해 수행되는 방법을 나타 낸 도면, 도 13은 본 개시의 실시 예에 따라 RIS를 지원하는 무선 통신 시스템에서 단말에 의해 수행되는 방법을 나타낸 도면, 및 도 14는 본 개시의 실시 예에 따라 RIS를 지원하는 무선 통신 시스템에서 네트워크 엔티티의 구성을 나타내는 도면."}
