{"patent_id": "10-2013-0026217", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2014-0111825", "출원번호": "10-2013-0026217", "발명의 명칭": "추계학적 태풍모의를 적용한 전지구 기후모델의 보완방법", "출원인": "세종대학교산학협력단", "발명자": "강부식"}}
{"patent_id": "10-2013-0026217", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "과거 기간에 대해서 태풍모의를 위한 강우자료를 구축하는 단계;유역에 영향을 미친 태풍사상에 대한 강우량을 검토하는 단계;태풍사상에 대한 통계적 특성을 분석하는 단계;예측기간의 태풍의 발생 횟수를 모의하기 위해 포아송 분포를 적용하는 단계;예측기간의 태풍의 발생 강우량을 모의하기 위해 검벨 분포를 적용하는 단계; 및태풍의 발생 횟수와 발생 강우량을 구하는 단계;를 포함하는, 추계학적 태풍모의를 적용한 전지구 기후모델의 보완방법."}
{"patent_id": "10-2013-0026217", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 태풍사상에 대한 통계적 특성을 분석하는 단계는 월별 평균 태풍빈도, 평균강우량 또는 최대 강우량을 분석하는 것을 특징으로 하는 추계학적 태풍모의를 적용한 전지구 기후모델의 보완방법."}
{"patent_id": "10-2013-0026217", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 포아송 분포를 적용하는 단계에서는 예측기간의 태풍의 발생횟수는 특정 범위 안에서 발생되는 사건의 수를 설명하는 포아송(Poisson) 분포를 적용하며, 포아송 분포에 대한 수식은 이고, 여기서 λ는 태풍의 평균 발생횟수, β는 축척변수인 것을 특징으로 하는 추계학적 태풍모의를 적용한 전지구 기후모델의 보완방법."}
{"patent_id": "10-2013-0026217", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 검벨(Gumbel) 분포를 적용하는 단계에서 검벨 분포에 대한 수식은이고,여기서 축척변수 , 위치변수 이며,는 과거 태풍 발생강우량에 대한 평균, σ는 과거 태풍 발생강우량에 대한 표준편차인 것을 특징으로 하는 추계학적 태풍모의를 적용한 전지구 기후모델의 보완방법.공개특허 10-2014-0111825-3-청구항 5 제4항에 있어서,상기 태풍의 발생 횟수와 발생 강우량을 구하는 단계에서는 태풍의 발생 횟수와 태풍의 발생 강우량을 서로 곱하여 과거의 통계적 특성을 따르는 태풍강우를 예측하거나 산정하는 것을 특징으로 하는 추계학적 태풍모의를적용한 전지구 기후모델의 보완방법."}
{"patent_id": "10-2013-0026217", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 태풍의 발생 횟수와 발생 강우량을 구하는 단계에서 과거의 통계적 특성은 태풍의 월평균 발생빈도, 최대태풍강우량, 최소 태풍강우량 또는 평균 태풍강우량을 포함하는 것을 특징으로 하는 추계학적 태풍모의를 적용한 전지구 기후모델의 보완방법."}
{"patent_id": "10-2013-0026217", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제4항에 있어서,상기 태풍의 발생 횟수와 발생 강우량을 구하는 단계는 극치강우사상을 산정하는 것을 특징으로 하는 추계학적태풍모의를 적용한 전지구 기후모델의 보완방법."}
{"patent_id": "10-2013-0026217", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항 내지 제7항 중 어느 한 항에 있어서,상기 예측기간의 태풍의 발생 횟수를 모의하기 위해 포아송 분포를 적용하는 단계와 상기 예측기간의 태풍의 발생 강우량을 모의하기 위해 검벨 분포를 적용하는 단계는 혼합 적용되는 것을 특징으로 하는 추계학적 태풍모의를 적용한 전지구 기후모델의 보완방법.명 세 서기 술 분 야본 발명은 전지구 기후모델(GCM: Global Climate Model)과 같은 대규모 대기모형 격자스케일의 수문값으로부터 [0001]고해상도의 기후 또는 기후변화정보를 획득하는 스케일상세화(downscaling)을 적용하는 과정에 있어서 태풍과같은 극치 강우를 반영하거나 모의하지 못하는 단점을 해소할 수 있는 추계학적 태풍모의를 적용한 전지구 기후모델의 보완방법에 관한 것이다.배 경 기 술기후변화로 인한 연구를 위해서 많은 기반자료로 전지구 기후모델(GCM, Global Climate Model)이 활용되고 [0002]있다. 전지구 기후모델은 자연대기중의 온실가스를 이산화탄소에 대한 등가치로 환산하여 2001년부터 2100년까지 100년간 온실가스 증가추세와 환경정책의 추진에 따른 감축량을 고려하여 기후인자(기온, 강수, 습도, 바람등)들의 미래기후정보를 수치 모의한 자료로써, 기후변화 영향이 어디서, 어떻게 미치질 전망하여, 그 피해를최소화하기 위한 대응책을 마련할 수 있게 하는 기반자료로 할 수 있다.그러나, 하천의 유출과 관련된 강우, 토양수분, 증발, 기저유출 등의 수문학적 성분은 전지구 기후모델(GCM)과 [0003]같은 대규모 대기모형의 격자 보다 작은 아격자규모의 스케일에서 유의한 변동성을 가지는 경우가 많다.따라서, GCM 모의를 바탕으로 신뢰성 있는 수문학적 전망을 수행하기 위해서는 적절한 상세화(downscaling) 과정을 거쳐 아격자 규모에서의 변동성분을 재현시키는 과정이 필요하다.기후변화연구에서 스케일상세화란 상대적으로 거친 GCM 격자스케일의 수문값으로부터 고해상도의 기후 또는 기 [0004]후변화정보를 획득하는 기법을 의미하며, 스케일상세화가 의미를 가지기 위해서는 몇 가지 전제조건이 형성되어공개특허 10-2014-0111825-4-야 한다.첫째는 평가모형(impact model)이 GCM 모형의 스케일이 비하여 현격히 상세한 스케일의 정보를 요구하는 상황이 [0005]어야 한다. 둘째는 반복 계산에 유리하도록 상세화 모형의 계산부하가 작아야 한다. 셋째는 원 스케일(originalscale)과 목표스케일(target scale)을 감안하여 최적의 상세화 기법을 선택해야 한다.상세화 기법에는 통계적 상세화 기법과 역학적 상세화 기법이 있다. 역학적 상세화 기법은 GCM의 모의값과 유역 [0006]에서의 관측값 사이의 중규모(meso-) 혹은 미소(micro-)규모에 대한 스케일 특성에 따른 물리적 관계를 이용시키는 기법으로 GCM의 큰 격자(100km∼300km)에서 작은 boundary를 주어 지역의 상세한 분석을 실시한다. 하지만계산부하나 방대한 요구자료, 모형의 검보정 등이 문제가 되고 있으며, 흔히 전지구 기후모델에서 사용하는 매개변수들은 지역에서의 실험에 의하여 결정되고, 이것이 지구모의를 수행하는데 사용됨으로 인하여 변수의 지역값을 모의하는데 신뢰성을 의심받기도 한다. 더욱이 역학적 과정에 대한 이해의 부족, 아격자 단위의 매개변수화의 필요성, 초기조건이나 경계조건에 대한 정확한 정보의 부족 등으로 말미암아 현재의 물리적 기반의 대기모형은 스케일에 따른 관측강우의 통계적 특성을 충분히 모의하는데는 문제점을 보이고 있다. 통계적 상세화 기법은 과거 관측자료로부터 GCM 기후변수들간의 상관관계를 추정하여 미래전망을 모의하는 기법 [0007]으로 낮은 계산부하와 수문시나리오 앙상블 생산을 통해 불확실성에 대한 분석이 가능하다는 장점을 가지고 있다. 최근에는 인공신경망(ANN; Artificial Neural Network)이나 퍼지이론 등의 인공지능기법을 이용한 비선형적합모형도 활발히 적용되고 있으며, ±25km수준까지는 역학적 모형을, 그 이하는 확률모형을 적용하는 혼합모형(Hybrid model)이 시도되고 있다.상기에서 언급한 바와 같이, 하천의 유출과 관련된 강우, 토양수분, 증발, 기저유출 등의 수문학적 성분은 GCM [0008]과 같은 대규모 대기모형의 격자에서는 작은 유역규모에서의 스케일에서 큰 변동성을 갖는 경우가 많다. 따라서GCM 모의를 바탕으로 신뢰성 있는 수문학적 전망을 수행하기 위해서는 적절한 스케일 상세화(downscaling)과정을 거쳐 활용해야 한다. 하지만, 원시자료 GCM 자체가 태풍사상과 같은 극치강우를 모의하고 있지 못하기 때문에 상세화에 한계점을 보 [0009]인다.발명의 내용해결하려는 과제본 발명은 한반도에 영향을 미치는 태풍 사상에 대한 통계적 특징을 반영하는 태풍사상을 생성할 수 있는 추계 [0010]학적 태풍모의를 적용한 전지구 기후모델의 보완방법을 제공한다.과제의 해결 수단상기한 과제를 달성하기 위한 본 발명의 일 실시예에 따른 추계학적 태풍모의를 적용한 전지구 기후모델의 보완 [0011]방법은 과거 기간에 대해서 태풍모의를 위한 강우자료를 구축하는 단계; 유역에 영향을 미친 태풍사상에 대한강우량을 검토하는 단계; 태풍사상에 대한 통계적 특성을 분석하는 단계; 예측기간의 태풍의 발생 횟수를 모의하기 위해 포아송 분포를 적용하는 단계; 예측기간의 태풍의 발생 강우량을 모의하기 위해 검벨 분포를 적용하는 단계; 및 태풍의 발생 횟수와 발생 강우량을 구하는 단계;를 포함할 수 있다.상기와 같이 구성함으로써, 기존의 전지구 기후모델(GCM)에서 태풍과 같은 극치 강우를 반영하지 못하는 것을 [0012]해결하여 지역상세화 과정을 수행할 수 있다.상기 태풍사상에 대한 통계적 특성을 분석하는 단계는 월별 평균 태풍빈도, 평균강우량 또는 최대 강우량을 분 [0013]석할 수 있다.상기 포아송 분포를 적용하는 단계에서는 예측기간의 태풍의 발생횟수는 특정 범위 안에서 발생되는 사건의 수 [0014]를 설명하는 포아송(Poisson) 분포를 적용하며, 포아송 분포에 대한 수식은 [0015]이고, 여기서 λ는 태풍의 평균 발생횟수, β는 축척변수이다. [0016]공개특허 10-2014-0111825-5-상기 검벨(Gumbel) 분포를 적용하는 단계에서 검벨 분포에 대한 수식은 [0017]이고, [0018]여기서 축척변수 , 위치변수 이며, [0019]는 과거 태풍 발생강우량에 대한 평균, σ는 과거 태풍 발생강우량에 대한 표준편차이다. [0020]상기 태풍의 발생 횟수와 발생 강우량을 구하는 단계에서는 태풍의 발생 횟수와 태풍의 발생 강우량을 서로 곱 [0021]하여 과거의 통계적 특성을 따르는 태풍강우를 예측하거나 산정할 수 있다.상기 태풍의 발생 횟수와 발생 강우량을 구하는 단계에서 과거의 통계적 특성은 태풍의 월평균 발생빈도, 최대 [0022]태풍강우량, 최소 태풍강우량 또는 평균 태풍강우량을 포함할 수 있다.상기 태풍의 발생 횟수와 발생 강우량을 구하는 단계는 극치강우사상을 산정할 수 있다. [0023]상기 예측기간의 태풍의 발생 횟수를 모의하기 위해 포아송 분포를 적용하는 단계와 상기 예측기간의 태풍의 발 [0024]생 강우량을 모의하기 위해 검벨 분포를 적용하는 단계는 혼합 적용될 수 있다.발명의 효과본 발명에 따른 추계학적 태풍모의를 적용한 전지구 기후모델의 보완방법은 태풍과 같은 극치 강우를 모의할 수 [0025]있기 때문에 작은 유역규모로 스케일 상세화를 하더라도 정확한 수문학적 성분을 얻을 수 있다.본 발명에 따른 추계학적 태풍모의를 적용한 전지구 기후모델의 보완방법은 과거의 통계적 특성과 큰 오차가 발 [0026]생하지 않는 범위 내에 존재하는 태풍 강우를 생성할 수 있다.도면의 간단한 설명도 1은 본 발명의 일 실시예에 따른 추계학적 태풍모의를 적용한 전지구 기후모델의 보완방법을 설명하는 순서 [0027]도이다.도 2 내지 도 4는 본 발명의 일 실시예에 따른 전지구 기후모델의 보완방법을 수행하기 위한 프로그램된 화면을나타내는 예시도이다.도 5는 본 발명에 따른 추계학적 태풍모의를 적용한 전지구 기후모델의 보완 방법을 적용한 결과의 일례를 보여주는 도면이다.발명을 실시하기 위한 구체적인 내용이하에서, 첨부된 도면을 참조하여 본 발명에 따른 실시예들을 상세하게 설명한다. 그러나, 본 발명이 실시예들 [0028]에 의해 제한되거나 한정되는 것은 아니다. 각 도면에 제시된 동일한 참조 부호는 동일한 부재를 나타낸다. 도 1은 본 발명의 일 실시예에 따른 추계학적 태풍모의를 적용한 전지구 기후모델의 보완방법을 설명하는 순서 [0029]도, 도 2 내지 도 4는 본 발명의 일 실시예에 따른 전지구 기후모델의 보완방법을 수행하기 위한 프로그램된 화면을 나타내는 예시도, 도 5는 본 발명에 따른 추계학적 태풍모의를 적용한 전지구 기후모델의 보완방법을 적용한 결과의 일례를 보여주는 도면이다.본 발명의 일 실시예에 따른 추계학적 태풍모의를 적용한 전지구 기후모델의 보완방법은 통계적 상세화 기법 중 [0030]지역 상세화에 관한 것으로서, 한반도와 같은 작은 유역규모에 대해서 태풍과 같은 극치강우를 사상하거나 모의할 수 있는 보완 방법에 관한 것이다.도 1을 참조하면, 본 발명의 일 실시예에 따른 추계학적 태풍모의를 적용한 전지구 기후모델의 보완방법은 과거 [0031]기간에 대해서 태풍모의를 위한 강우자료를 구축하는 단계(1100), 유역에 영향을 미친 태풍사상에 대한 강우량을 검토하는 단계(1200), 태풍사상에 대한 통계적 특성을 분석하는 단계(1300), 예측기간의 태풍의 발생 횟수를모의하기 위해 포아송 분포를 적용하는 단계(1400), 예측기간의 태풍의 발생 강우량을 모의하기 위해 검벨 분포를 적용하는 단계(1500) 및 태풍의 발생 횟수와 발생 강우량을 구하는 단계(1600)를 포함할 수 있다.공개특허 10-2014-0111825-6-상기와 같은 과정에 의해 전지구 기후모델을 보완함으로써, 기존의 전지구 기후모델(GCM)에서 태풍과 같은 극치 [0032]강우를 반영하지 못하는 것을 해결하여 작은 유역규모에도 정확하게 적용될 수 있는 지역상세화 과정을 제시할수 있다.한편, 도 2를 참조하면, 본 발명의 일 실시예에 따른 전지구 기후모델의 보완방법은 우선 관측강우를 입력하고 [0033]태풍강우를 제거하는 상세화 입력자료를 구축한다. 이와 함께 GCM 기후변수의 주성분분석을 수행하는 상세화 입력자료를 구축한다. 이와 같이 구축된 상세화 입력자료를 기반으로 인공신경망 구조를 결정하고, 인공신경망(ANN: Artificial Neural Network)을 이용하여 예측기간의 강우를 모의한다.그 다음에는 비정상성 분위 사상 내지 동적 분위 사상을 적용하여 인공신경망 모의 결과의 강우량을 보정한다. [0034]이와 함께, 과거의 통계적 특성을 갖는 태풍강우를 선정하는 추계학적 태풍모의 과정을 수행하게 된다.이러한 모의 과정을 거쳐 최종 예측강우를 선정하고, 확률축차모형(Random Cascade)을 이용하여 격자상세화를 [0035]수행하게 된다.상기에서 설명한 본 발명의 일 실시예에 따른 전지구 기후모델의 보완방법은 추계학적 태풍모의 과정에 관련되 [0036]어 있다.과거 기간에 대해서 태풍모의를 위한 강우자료를 구축하는 단계(1100)에서는 GCM 모델의 과거기간(Baseline, [0037]1976년~2000년)을 대상으로 태풍의 발생횟수, 태풍의 발생 강우량 등 관측데이터를 수집한다. 즉, 관측값이 존재하는 과거 기간에 대해서 태풍의 월 평균 발생 횟수, 최대 태풍 강우량, 최소 태풍 강우량 또는 평균 태풍 강우량 등의 통계적 모수를 구축하거나 수집하는 단계이다.도 3에는 추계학적 태풍모의를 수행하기 위한 프로그램된 초기 화면이 예시적으로 도시되어 있고, 도 4에는 최 [0038]종 예측강우를 산정하기 위한 프로그램된 초기 화면이 예시적으로 도시되어 있다. 단계 1100은 도 3에 도시된프로그램을 통해서 과거 기간에 대한 강우자료를 구축하거나 수집할 수 있다. 유역에 영향을 미친 태풍사상에 대한 강우량을 검토하는 단계(1200)에서는 단계 1100에서 구축된 과거 태풍 관 [0039]측값을 바탕으로 하여 작은 유역규모(예를 들면, 한반도)에 영향을 미친 태풍사상 별 강우량을 검토하게 된다.태풍사상 별 강우량을 검토한 후에는 태풍사상에 대한 통계적 특성을 분석하는 단계(1300)를 수행하게 되는데, [0040]통계적 특성을 분석하는 단계(1300)에서는 과거 기간에 대해서 태풍의 월 평균 발생 횟수, 최대 태풍 강우량,최소 태풍 강우량 또는 평균 태풍 강우량 등의 통계적 모수를 분석할 수 있다. 통계적 특성을 분석한 이후에는 포아송 분포를 적용하고(1400) 검벨 분포를 적용한다(1500). 본 발명의 일 실시 [0041]예에 따른 추계학적 태풍모의를 적용한 전지구 기후모델의 보완방법은 주어진 누적확률분포(CDF: CumulativeDistribution Function)에 무작위 표본을 적용하여 값을 생성시키는 방법으로 [수학식 1]과 같이 역변환법(Inverse Transform Method)를 적용한 기법이다.수학식 1[0042]예측기간(미래기간)의 태풍의 발생횟수는 특정 범위 안에서 발생되는 사건(event)의 수를 설명하는 포아송 [0043](Poisson) 분포를 이용하며, 태풍 발생강우량에 대해서는 극치강우의 빈도해석에 사용되는 검벨(Gumbel) 분포를사용한다. 이와 같이, 태풍의 발생빈도와 총 강우량에 대하여 각각 포아송 분포와 검벨 분포의 혼합분포를 통해과거 30년 동안의 태풍강우의 통계적 특성(월평균 횟수 및 최대/최소/평균 강우량)을 반영하는 모의기간에 대한월별 태풍 모의값을 생성하는 프로세스를 구축할 수 있다. 즉, 예측기간의 태풍의 발생 횟수를 모의하기 위해포아송 분포를 적용하는 단계(1400)와 예측기간의 태풍의 발생 강우량을 모의하기 위해 검벨 분포를 적용하는단계(1500)는 혼합 적용될 수 있다.입력자료로 사용되는 제거된 태풍강우의 통계자료 경우에는 도 3과 같은 입력화면을 통해서 상세화 입력자료 구 [0044]축(관측강우)단계에서 사용자가 쉽게 구성할 수 있고 각 월별 모의된 태풍강우 사상에 대한 결과를 확인할 수있다.공개특허 10-2014-0111825-7-예측기간의 태풍의 발생 횟수를 모의하기 위해 포아송 분포를 적용하는 단계 (1400)에서는 예측기간의 태풍의 [0045]발생횟수는 특정 범위 안에서 발생되는 사건의 수를 설명하는 포아송(Poisson) 분포를 적용하며, 포아송 분포에대한 수식은 [수학식 2]와 같다.수학식 2[0046]이고, 여기서 χ는 태풍의 발생 횟수, λ는 태풍의 평균 발생횟수, β는 축척변수이다. [0047]예측기간의 태풍의 발생 강우량을 모의하기 위해 검벨(Gumbel) 분포를 적용하는 단계 (1500)에서 검벨 분포에 [0048]대한 수식은 [수학식 3]과 같다.수학식 3[0049]여기서 축척변수 , 위치변수 이며, [0050]는 과거 태풍 발생강우량에 대한 평균, σ는 과거 태풍 발생강우량에 대한 표준편차이다. 검벨(Gumbel) 분포 [0051]의 매개변수인 축척변수(β)와 위치변수(μ)는 모멘트법을 사용하여 추정할 수 있다.본 발명에 따른 추계학적 태풍모의를 적용한 전지구 기후모델의 보완방법은 태풍의 발생 횟수와 총 강우량에 대 [0052]해서 포아송 분포와 검벨 분포의 혼합 분포를 통해 과거 기간 동안의 태풍강우의 통계적 특성을 반영하는 모의기간에 대한 월별 태풍 모의값을 생성할 수 있다.상기 태풍의 발생 횟수와 발생 강우량을 구하는 단계(1600)에서는 태풍의 발생 횟수와 태풍의 발생 강우량을 서 [0053]로 곱하여 과거기간의 통계적 특성을 따르는 태풍강우를 예측하거나 산정할 수 있다. 즉, 최종적으로 구한 태풍발생 횟수와 발생 강우량의 곱을 통해서 과거 기간 동안의 태풍강우의 통계적 특성(월평균 발생 횟수 및 최대/최소/평균강우량)을 반영하는 월별 태풍 모의값을 생성할 수 있다.한편, 상기 태풍의 발생 횟수와 발생 강우량을 구하는 단계(1600)에서 과거의 통계적 특성은 태풍의 월평균 발 [0054]생빈도, 최대 태풍강우량, 최소 태풍강우량 또는 평균 태풍강우량을 포함할 수 있다.본 출원인은 본 발명에 따른 추계학적 태풍모의를 적용한 전지구 기후모델의보완방법을 검증하기 위해 양평관측소에 적용하여 [표 1]과같은 결과를 얻었다.공개특허 10-2014-0111825-8-표 1[0055][표 1]에서 *는 [표 1]에 있는 관측값에 대한 오차율을 나타낸다. [0056][표 1]에서 알 수 있듯이, 양평관측소에 본 발명에 따른 추계학적 태풍모의를 적용한 전지구 기후모델의 보완방 [0057]법을 적용한 결과 과거기간의 통계적 특성(월평균 횟수 및 최대 태풍강우량/평균 태풍강우량)의 오차범위 ±15%이내의 오차율을 보이는 태풍강우를 생성할 수 있었다. 따라서, 본 발명의 일 실시예에 따른 전지구 기후모델의보완방법을 적용할 경우, 태풍강우를 모의하지 못하는 GCM의 단점을 극복할 수 있고, 보다 정확하게 지역 상세화를 수행할 수 있음을 확인하였다.한편, 상기 태풍의 발생 횟수와 발생 강우량을 구하는 단계(1600)는 극치강우사상을 산정할 수 있다. 도 5에 도 [0058]시된 바와 같이, 본 발명의 일 실시예에 따른 추계학적 태풍모의를 적용한 전지구 기후모델의 보완방법에 의하면 기존의 GCM에서 볼 수 없었던 400mm 이상의 극치강우사상도 만들어 낼 수 있다. 도 5를 참조하면, 굵은 점선으로 표시된 GCM은 400mm를 넘는 강우사상이 없는 반면에, 가는 점선으로 표시된 본 발명에 따른 추계학적 태풍모의를 적용한 전지구 기후모델의 보완방법(도 5의 상세화+STS 참조)은 400mm 이상의 강우사상을 만들어 냄을알 수 있다.이상과 같이 본 발명의 일 실시예에서는 구체적인 구성 요소 등과 같은 특정 사항들과 한정된 실시예 및 도면에 [0059]의해 설명되었으나 이는 본 발명의 보다 전반적인 이해를 돕기 위해서 제공된 것일 뿐, 본 발명은 상기의 실시예에 한정되는 것은 아니며, 본 발명이 속하는 분야에서 통상적인 지식을 가진 자라면 이러한 기재로부터 다양한 수정 및 변형이 가능하다. 따라서, 본 발명의 사상은 설명된 실시예에 국한되어 정해져서는 아니 되며, 후술하는 특허청구범위뿐 아니라 이 특허청구범위와 균등하거나 등가적 변형이 있는 모든 것들은 본 발명 사상의 범주에 속한다고 할 것이다. 공개특허 10-2014-0111825-9-도면도면1도면2공개특허 10-2014-0111825-10-도면3공개특허 10-2014-0111825-11-도면4도면5공개특허 10-2014-0111825-12-"}
{"patent_id": "10-2013-0026217", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 추계학적 태풍모의를 적용한 전지구 기후모델의 보완방법은 과거 기간에 대해서 태 풍모의를 위한 강우자료를 구축하는 단계; 유역에 영향을 미친 태풍사상에 대한 강우량을 검토하는 단계; 태풍사 상에 대한 통계적 특성을 분석하는 단계; 예측기간의 태풍의 발생 횟수를 모의하기 위해 포아송 분포를 적용하는 단계; 예측기간의 태풍의 발생 강우량을 모의하기 위해 검벨 분포를 적용하는 단계; 및 태풍의 발생 횟수와 발생 강우량을 구하는 단계;를 포함하여, 기존의 전지구 기후모델(GCM)에서 태풍과 같은 극치 강우를 반영하지 못하는 것을 극복할 수 있다."}
{"patent_id": "10-2013-0026217", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 전지구 기후모델(GCM: Global Climate Model)과 같은 대규모 대기모형 격자스케일의 수문값으로부터 고해상도의 기후 또는 기후변화정보를 획득하는 스케일상세화(downscaling)을 적용하는 과정에 있어서 태풍과 같은 극치 강우를 반영하거나 모의하지 못하는 단점을 해소할 수 있는 추계학적 태풍모의를 적용한 전지구 기후 모델의 보완방법에 관한 것이다."}
{"patent_id": "10-2013-0026217", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "기후변화로 인한 연구를 위해서 많은 기반자료로 전지구 기후모델(GCM, Global Climate Model)이 활용되고 있다. 전지구 기후모델은 자연대기중의 온실가스를 이산화탄소에 대한 등가치로 환산하여 2001년부터 2100년까 지 100년간 온실가스 증가추세와 환경정책의 추진에 따른 감축량을 고려하여 기후인자(기온, 강수, 습도, 바람 등)들의 미래기후정보를 수치 모의한 자료로써, 기후변화 영향이 어디서, 어떻게 미치질 전망하여, 그 피해를 최소화하기 위한 대응책을 마련할 수 있게 하는 기반자료로 할 수 있다. 그러나, 하천의 유출과 관련된 강우, 토양수분, 증발, 기저유출 등의 수문학적 성분은 전지구 기후모델(GCM)과 같은 대규모 대기모형의 격자 보다 작은 아격자규모의 스케일에서 유의한 변동성을 가지는 경우가 많다. 따라서, GCM 모의를 바탕으로 신뢰성 있는 수문학적 전망을 수행하기 위해서는 적절한 상세화(downscaling) 과 정을 거쳐 아격자 규모에서의 변동성분을 재현시키는 과정이 필요하다. 기후변화연구에서 스케일상세화란 상대적으로 거친 GCM 격자스케일의 수문값으로부터 고해상도의 기후 또는 기 후변화정보를 획득하는 기법을 의미하며, 스케일상세화가 의미를 가지기 위해서는 몇 가지 전제조건이 형성되어야 한다. 첫째는 평가모형(impact model)이 GCM 모형의 스케일이 비하여 현격히 상세한 스케일의 정보를 요구하는 상황이 어야 한다. 둘째는 반복 계산에 유리하도록 상세화 모형의 계산부하가 작아야 한다. 셋째는 원 스케일(original scale)과 목표스케일(target scale)을 감안하여 최적의 상세화 기법을 선택해야 한다. 상세화 기법에는 통계적 상세화 기법과 역학적 상세화 기법이 있다. 역학적 상세화 기법은 GCM의 모의값과 유역 에서의 관측값 사이의 중규모(meso-) 혹은 미소(micro-)규모에 대한 스케일 특성에 따른 물리적 관계를 이용시 키는 기법으로 GCM의 큰 격자(100km∼300km)에서 작은 boundary를 주어 지역의 상세한 분석을 실시한다. 하지만 계산부하나 방대한 요구자료, 모형의 검보정 등이 문제가 되고 있으며, 흔히 전지구 기후모델에서 사용하는 매 개변수들은 지역에서의 실험에 의하여 결정되고, 이것이 지구모의를 수행하는데 사용됨으로 인하여 변수의 지역 값을 모의하는데 신뢰성을 의심받기도 한다. 더욱이 역학적 과정에 대한 이해의 부족, 아격자 단위의 매개변수 화의 필요성, 초기조건이나 경계조건에 대한 정확한 정보의 부족 등으로 말미암아 현재의 물리적 기반의 대기모 형은 스케일에 따른 관측강우의 통계적 특성을 충분히 모의하는데는 문제점을 보이고 있다. 통계적 상세화 기법은 과거 관측자료로부터 GCM 기후변수들간의 상관관계를 추정하여 미래전망을 모의하는 기법 으로 낮은 계산부하와 수문시나리오 앙상블 생산을 통해 불확실성에 대한 분석이 가능하다는 장점을 가지고 있 다. 최근에는 인공신경망(ANN; Artificial Neural Network)이나 퍼지이론 등의 인공지능기법을 이용한 비선형적 합모형도 활발히 적용되고 있으며, ±25km수준까지는 역학적 모형을, 그 이하는 확률모형을 적용하는 혼합모형 (Hybrid model)이 시도되고 있다. 상기에서 언급한 바와 같이, 하천의 유출과 관련된 강우, 토양수분, 증발, 기저유출 등의 수문학적 성분은 GCM 과 같은 대규모 대기모형의 격자에서는 작은 유역규모에서의 스케일에서 큰 변동성을 갖는 경우가 많다. 따라서 GCM 모의를 바탕으로 신뢰성 있는 수문학적 전망을 수행하기 위해서는 적절한 스케일 상세화(downscaling)과정 을 거쳐 활용해야 한다. 하지만, 원시자료 GCM 자체가 태풍사상과 같은 극치강우를 모의하고 있지 못하기 때문에 상세화에 한계점을 보 인다."}
{"patent_id": "10-2013-0026217", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 한반도에 영향을 미치는 태풍 사상에 대한 통계적 특징을 반영하는 태풍사상을 생성할 수 있는 추계 학적 태풍모의를 적용한 전지구 기후모델의 보완방법을 제공한다."}
{"patent_id": "10-2013-0026217", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 과제를 달성하기 위한 본 발명의 일 실시예에 따른 추계학적 태풍모의를 적용한 전지구 기후모델의 보완 방법은 과거 기간에 대해서 태풍모의를 위한 강우자료를 구축하는 단계; 유역에 영향을 미친 태풍사상에 대한 강우량을 검토하는 단계; 태풍사상에 대한 통계적 특성을 분석하는 단계; 예측기간의 태풍의 발생 횟수를 모의 하기 위해 포아송 분포를 적용하는 단계; 예측기간의 태풍의 발생 강우량을 모의하기 위해 검벨 분포를 적용하 는 단계; 및 태풍의 발생 횟수와 발생 강우량을 구하는 단계;를 포함할 수 있다. 상기와 같이 구성함으로써, 기존의 전지구 기후모델(GCM)에서 태풍과 같은 극치 강우를 반영하지 못하는 것을 해결하여 지역상세화 과정을 수행할 수 있다. 상기 태풍사상에 대한 통계적 특성을 분석하는 단계는 월별 평균 태풍빈도, 평균강우량 또는 최대 강우량을 분 석할 수 있다. 상기 포아송 분포를 적용하는 단계에서는 예측기간의 태풍의 발생횟수는 특정 범위 안에서 발생되는 사건의 수 를 설명하는 포아송(Poisson) 분포를 적용하며, 포아송 분포에 대한 수식은"}
{"patent_id": "10-2013-0026217", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "이고, 여기서 λ는 태풍의 평균 발생횟수, β는 축척변수이다. 상기 검벨(Gumbel) 분포를 적용하는 단계에서 검벨 분포에 대한 수식은 이고, 여기서 축척변수 , 위치변수 이며, 는 과거 태풍 발생강우량에 대한 평균, σ는 과거 태풍 발생강우량에 대한 표준편차이다. 상기 태풍의 발생 횟수와 발생 강우량을 구하는 단계에서는 태풍의 발생 횟수와 태풍의 발생 강우량을 서로 곱 하여 과거의 통계적 특성을 따르는 태풍강우를 예측하거나 산정할 수 있다. 상기 태풍의 발생 횟수와 발생 강우량을 구하는 단계에서 과거의 통계적 특성은 태풍의 월평균 발생빈도, 최대 태풍강우량, 최소 태풍강우량 또는 평균 태풍강우량을 포함할 수 있다. 상기 태풍의 발생 횟수와 발생 강우량을 구하는 단계는 극치강우사상을 산정할 수 있다. 상기 예측기간의 태풍의 발생 횟수를 모의하기 위해 포아송 분포를 적용하는 단계와 상기 예측기간의 태풍의 발 생 강우량을 모의하기 위해 검벨 분포를 적용하는 단계는 혼합 적용될 수 있다."}
{"patent_id": "10-2013-0026217", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 추계학적 태풍모의를 적용한 전지구 기후모델의 보완방법은 태풍과 같은 극치 강우를 모의할 수 있기 때문에 작은 유역규모로 스케일 상세화를 하더라도 정확한 수문학적 성분을 얻을 수 있다. 본 발명에 따른 추계학적 태풍모의를 적용한 전지구 기후모델의 보완방법은 과거의 통계적 특성과 큰 오차가 발 생하지 않는 범위 내에 존재하는 태풍 강우를 생성할 수 있다."}
{"patent_id": "10-2013-0026217", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서, 첨부된 도면을 참조하여 본 발명에 따른 실시예들을 상세하게 설명한다. 그러나, 본 발명이 실시예들 에 의해 제한되거나 한정되는 것은 아니다. 각 도면에 제시된 동일한 참조 부호는 동일한 부재를 나타낸다. 도 1은 본 발명의 일 실시예에 따른 추계학적 태풍모의를 적용한 전지구 기후모델의 보완방법을 설명하는 순서 도, 도 2 내지 도 4는 본 발명의 일 실시예에 따른 전지구 기후모델의 보완방법을 수행하기 위한 프로그램된 화 면을 나타내는 예시도, 도 5는 본 발명에 따른 추계학적 태풍모의를 적용한 전지구 기후모델의 보완방법을 적용 한 결과의 일례를 보여주는 도면이다. 본 발명의 일 실시예에 따른 추계학적 태풍모의를 적용한 전지구 기후모델의 보완방법은 통계적 상세화 기법 중 지역 상세화에 관한 것으로서, 한반도와 같은 작은 유역규모에 대해서 태풍과 같은 극치강우를 사상하거나 모의 할 수 있는 보완 방법에 관한 것이다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 추계학적 태풍모의를 적용한 전지구 기후모델의 보완방법은 과거 기간에 대해서 태풍모의를 위한 강우자료를 구축하는 단계, 유역에 영향을 미친 태풍사상에 대한 강우량 을 검토하는 단계, 태풍사상에 대한 통계적 특성을 분석하는 단계, 예측기간의 태풍의 발생 횟수를 모의하기 위해 포아송 분포를 적용하는 단계, 예측기간의 태풍의 발생 강우량을 모의하기 위해 검벨 분포 를 적용하는 단계 및 태풍의 발생 횟수와 발생 강우량을 구하는 단계를 포함할 수 있다.상기와 같은 과정에 의해 전지구 기후모델을 보완함으로써, 기존의 전지구 기후모델(GCM)에서 태풍과 같은 극치 강우를 반영하지 못하는 것을 해결하여 작은 유역규모에도 정확하게 적용될 수 있는 지역상세화 과정을 제시할 수 있다. 한편, 도 2를 참조하면, 본 발명의 일 실시예에 따른 전지구 기후모델의 보완방법은 우선 관측강우를 입력하고 태풍강우를 제거하는 상세화 입력자료를 구축한다. 이와 함께 GCM 기후변수의 주성분분석을 수행하는 상세화 입 력자료를 구축한다. 이와 같이 구축된 상세화 입력자료를 기반으로 인공신경망 구조를 결정하고, 인공신경망 (ANN: Artificial Neural Network)을 이용하여 예측기간의 강우를 모의한다. 그 다음에는 비정상성 분위 사상 내지 동적 분위 사상을 적용하여 인공신경망 모의 결과의 강우량을 보정한다. 이와 함께, 과거의 통계적 특성을 갖는 태풍강우를 선정하는 추계학적 태풍모의 과정을 수행하게 된다. 이러한 모의 과정을 거쳐 최종 예측강우를 선정하고, 확률축차모형(Random Cascade)을 이용하여 격자상세화를 수행하게 된다. 상기에서 설명한 본 발명의 일 실시예에 따른 전지구 기후모델의 보완방법은 추계학적 태풍모의 과정에 관련되 어 있다. 과거 기간에 대해서 태풍모의를 위한 강우자료를 구축하는 단계에서는 GCM 모델의 과거기간(Baseline, 1976년~2000년)을 대상으로 태풍의 발생횟수, 태풍의 발생 강우량 등 관측데이터를 수집한다. 즉, 관측값이 존 재하는 과거 기간에 대해서 태풍의 월 평균 발생 횟수, 최대 태풍 강우량, 최소 태풍 강우량 또는 평균 태풍 강 우량 등의 통계적 모수를 구축하거나 수집하는 단계이다. 도 3에는 추계학적 태풍모의를 수행하기 위한 프로그램된 초기 화면이 예시적으로 도시되어 있고, 도 4에는 최 종 예측강우를 산정하기 위한 프로그램된 초기 화면이 예시적으로 도시되어 있다. 단계 1100은 도 3에 도시된 프로그램을 통해서 과거 기간에 대한 강우자료를 구축하거나 수집할 수 있다. 유역에 영향을 미친 태풍사상에 대한 강우량을 검토하는 단계에서는 단계 1100에서 구축된 과거 태풍 관 측값을 바탕으로 하여 작은 유역규모(예를 들면, 한반도)에 영향을 미친 태풍사상 별 강우량을 검토하게 된다. 태풍사상 별 강우량을 검토한 후에는 태풍사상에 대한 통계적 특성을 분석하는 단계를 수행하게 되는데, 통계적 특성을 분석하는 단계에서는 과거 기간에 대해서 태풍의 월 평균 발생 횟수, 최대 태풍 강우량, 최소 태풍 강우량 또는 평균 태풍 강우량 등의 통계적 모수를 분석할 수 있다. 통계적 특성을 분석한 이후에는 포아송 분포를 적용하고 검벨 분포를 적용한다. 본 발명의 일 실시 예에 따른 추계학적 태풍모의를 적용한 전지구 기후모델의 보완방법은 주어진 누적확률분포(CDF: Cumulative Distribution Function)에 무작위 표본을 적용하여 값을 생성시키는 방법으로 [수학식 1]과 같이 역변환법 (Inverse Transform Method)를 적용한 기법이다. 수학식 1"}
{"patent_id": "10-2013-0026217", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "예측기간(미래기간)의 태풍의 발생횟수는 특정 범위 안에서 발생되는 사건(event)의 수를 설명하는 포아송 (Poisson) 분포를 이용하며, 태풍 발생강우량에 대해서는 극치강우의 빈도해석에 사용되는 검벨(Gumbel) 분포를 사용한다. 이와 같이, 태풍의 발생빈도와 총 강우량에 대하여 각각 포아송 분포와 검벨 분포의 혼합분포를 통해 과거 30년 동안의 태풍강우의 통계적 특성(월평균 횟수 및 최대/최소/평균 강우량)을 반영하는 모의기간에 대한 월별 태풍 모의값을 생성하는 프로세스를 구축할 수 있다. 즉, 예측기간의 태풍의 발생 횟수를 모의하기 위해 포아송 분포를 적용하는 단계와 예측기간의 태풍의 발생 강우량을 모의하기 위해 검벨 분포를 적용하는 단계는 혼합 적용될 수 있다. 입력자료로 사용되는 제거된 태풍강우의 통계자료 경우에는 도 3과 같은 입력화면을 통해서 상세화 입력자료 구 축(관측강우)단계에서 사용자가 쉽게 구성할 수 있고 각 월별 모의된 태풍강우 사상에 대한 결과를 확인할 수 있다.예측기간의 태풍의 발생 횟수를 모의하기 위해 포아송 분포를 적용하는 단계 에서는 예측기간의 태풍의 발생횟수는 특정 범위 안에서 발생되는 사건의 수를 설명하는 포아송(Poisson) 분포를 적용하며, 포아송 분포에 대한 수식은 [수학식 2]와 같다. 수학식 2"}
{"patent_id": "10-2013-0026217", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이고, 여기서 χ는 태풍의 발생 횟수, λ는 태풍의 평균 발생횟수, β는 축척변수이다. 예측기간의 태풍의 발생 강우량을 모의하기 위해 검벨(Gumbel) 분포를 적용하는 단계 에서 검벨 분포에 대한 수식은 [수학식 3]과 같다. 수학식 3"}
{"patent_id": "10-2013-0026217", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "여기서 축척변수 , 위치변수 이며, 는 과거 태풍 발생강우량에 대한 평균, σ는 과거 태풍 발생강우량에 대한 표준편차이다. 검벨(Gumbel) 분포 의 매개변수인 축척변수(β)와 위치변수(μ)는 모멘트법을 사용하여 추정할 수 있다. 본 발명에 따른 추계학적 태풍모의를 적용한 전지구 기후모델의 보완방법은 태풍의 발생 횟수와 총 강우량에 대 해서 포아송 분포와 검벨 분포의 혼합 분포를 통해 과거 기간 동안의 태풍강우의 통계적 특성을 반영하는 모의 기간에 대한 월별 태풍 모의값을 생성할 수 있다. 상기 태풍의 발생 횟수와 발생 강우량을 구하는 단계에서는 태풍의 발생 횟수와 태풍의 발생 강우량을 서 로 곱하여 과거기간의 통계적 특성을 따르는 태풍강우를 예측하거나 산정할 수 있다. 즉, 최종적으로 구한 태풍 발생 횟수와 발생 강우량의 곱을 통해서 과거 기간 동안의 태풍강우의 통계적 특성(월평균 발생 횟수 및 최대/ 최소/평균강우량)을 반영하는 월별 태풍 모의값을 생성할 수 있다. 한편, 상기 태풍의 발생 횟수와 발생 강우량을 구하는 단계에서 과거의 통계적 특성은 태풍의 월평균 발 생빈도, 최대 태풍강우량, 최소 태풍강우량 또는 평균 태풍강우량을 포함할 수 있다.본 출원인은 본 발명에 따 른 추계학적 태풍모의를 적용한 전지구 기후모델의보완방법을 검증하기 위해 양평관측소에 적용하여 [표 1]과 같은 결과를 얻었다.표 1"}
{"patent_id": "10-2013-0026217", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "[표 1]에서 *는 [표 1]에 있는 관측값에 대한 오차율을 나타낸다. [표 1]에서 알 수 있듯이, 양평관측소에 본 발명에 따른 추계학적 태풍모의를 적용한 전지구 기후모델의 보완방 법을 적용한 결과 과거기간의 통계적 특성(월평균 횟수 및 최대 태풍강우량/평균 태풍강우량)의 오차범위 ±15% 이내의 오차율을 보이는 태풍강우를 생성할 수 있었다. 따라서, 본 발명의 일 실시예에 따른 전지구 기후모델의 보완방법을 적용할 경우, 태풍강우를 모의하지 못하는 GCM의 단점을 극복할 수 있고, 보다 정확하게 지역 상세 화를 수행할 수 있음을 확인하였다. 한편, 상기 태풍의 발생 횟수와 발생 강우량을 구하는 단계는 극치강우사상을 산정할 수 있다. 도 5에 도 시된 바와 같이, 본 발명의 일 실시예에 따른 추계학적 태풍모의를 적용한 전지구 기후모델의 보완방법에 의하 면 기존의 GCM에서 볼 수 없었던 400mm 이상의 극치강우사상도 만들어 낼 수 있다. 도 5를 참조하면, 굵은 점선 으로 표시된 GCM은 400mm를 넘는 강우사상이 없는 반면에, 가는 점선으로 표시된 본 발명에 따른 추계학적 태풍 모의를 적용한 전지구 기후모델의 보완방법(도 5의 상세화+STS 참조)은 400mm 이상의 강우사상을 만들어 냄을 알 수 있다. 이상과 같이 본 발명의 일 실시예에서는 구체적인 구성 요소 등과 같은 특정 사항들과 한정된 실시예 및 도면에 의해 설명되었으나 이는 본 발명의 보다 전반적인 이해를 돕기 위해서 제공된 것일 뿐, 본 발명은 상기의 실시 예에 한정되는 것은 아니며, 본 발명이 속하는 분야에서 통상적인 지식을 가진 자라면 이러한 기재로부터 다양 한 수정 및 변형이 가능하다. 따라서, 본 발명의 사상은 설명된 실시예에 국한되어 정해져서는 아니 되며, 후술 하는 특허청구범위뿐 아니라 이 특허청구범위와 균등하거나 등가적 변형이 있는 모든 것들은 본 발명 사상의 범 주에 속한다고 할 것이다. 도면 도면1 도면2 도면3 도면4 도면5"}
{"patent_id": "10-2013-0026217", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 추계학적 태풍모의를 적용한 전지구 기후모델의 보완방법을 설명하는 순서 도이다. 도 2 내지 도 4는 본 발명의 일 실시예에 따른 전지구 기후모델의 보완방법을 수행하기 위한 프로그램된 화면을 나타내는 예시도이다. 도 5는 본 발명에 따른 추계학적 태풍모의를 적용한 전지구 기후모델의 보완 방법을 적용한 결과의 일례를 보여 주는 도면이다."}
