{"patent_id": "10-2021-0038089", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0132918", "출원번호": "10-2021-0038089", "발명의 명칭": "선박의 카메라 위치 조절 장치 및 방법", "출원인": "한국해양과학기술원", "발명자": "윤상웅"}}
{"patent_id": "10-2021-0038089", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "선박에 장착되어 전방 수평면을 촬영하는 카메라(C)가 선박의 롤링 및 피칭에 의해 시야가 틀어지는 것을 방지할 수 있는 선박의 카메라 위치 조절 장치로서,상기 카메라가 일측면에 장착될 수 있는 공간을 제공하도록 구성된 헤드부(110);상기 헤드부에 장착되어 상기 카메라의 전방 주시 각도를 조절할 수 있도록 하는 카메라 틸팅부(410); 상기 헤드부의 하부에 부착되어 텔레스코프 방식으로 수직 이동 가능함과 아울러, 수직선을 기준으로 360도 회전가능한 지지대(120);상기 지지대를 수용하여 상기 수직 이동 및 회전 운동을 조절할 수 있도록 구성된 수용부(130);상기 선박의 롤링 각도 및 피칭 각도를 감지하도록 구성된 선박 운동 감지부(210); 및감지된 상기 선박의 롤링 각도 및 피칭 각도를 기초로 상기 수용부 및 카메라 틸팅부를 제어하여 상기 카메라가전방 수평면을 주시하게 하는 제어부(300);를 포함하는 선박의 카메라 위치 조절 장치."}
{"patent_id": "10-2021-0038089", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 카메라, 헤드부, 지지대 및 수용부의 전체면을 일정 거리만큼 이격되어 커버하도록 구성된 투명한 재질의카메라 보호커버(140); 및상기 카메라 보호커버의 외벽에 세정액을 분사시켜 세정하도록 구성된 둘 이상의 세정 노즐(150);을 더 포함하는 선박의 카메라 위치 조절 장치."}
{"patent_id": "10-2021-0038089", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 세정 노즐을 구동시키도록 구성된 세정 노즐 구동부(420); 및상기 카메라 보호커버의 투명도를 감지하도록 구성된 카메라 보호커버 투명도 감지부(220);를 더 포함하며,상기 제어부는 상기 카메라 보호커버 투명도가 설정값 미만이면 이에 상응하는 제어신호를 상기 세정 노즐 구동부에 출력하여서 설정시간 동안 상기 세정 노즐을 구동시켜 세정액을 분사하게 하는 선박의 카메라 위치 조절장치."}
{"patent_id": "10-2021-0038089", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "선박에 장착되어 전방 수평면을 촬영하는 카메라(C)가 선박의 롤링 및 피칭에 의해 시야가 틀어지는 것을 방지할 수 있는 선박의 카메라 위치 조절 방법으로서,선박 운동 감지부(210)에 의해 선박의 롤링 각도 및 피칭 각도를 감지하는 단계; 및제어부(300)가 감지된 상기 선박의 롤링 각도 및 피칭 각도를 기초로 수용부(130) 및 카메라 틸팅부(410)를 제어하여 상기 카메라가 전방 수평면을 주시하게 하는 단계;를 포함하는 선박의 카메라 위치 조절 방법.공개특허 10-2022-0132918-3-청구항 5 제 4 항에 있어서,카메라 보호커버 투명도 감지부(220)에 의해 카메라 보호커버(140)의 투명도를 감지하는 단계; 및상기 제어부는 상기 카메라 보호커버 투명도가 설정값 미만이면 이에 상응하는 제어신호를 세정 노즐 구동부(420)에 출력하여서 설정시간 동안 세정 노즐(150)을 구동시켜 세정액을 분사하게 하는 단계;를 더 포함하는 선박의 카메라 위치 조절 방법."}
{"patent_id": "10-2021-0038089", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 선박의 카메라 위치 조절 장치 및 방법에 관한 것으로서, 특히 선박에서 주변 상황을 모니터링하기 위 해 사용되는 카메라가 선박의 롤링(rolling)이나 피칭(pitching) 동작에 의해 시야가 틀어질 경우, 감지된 선박 의 롤링각도 및 피칭각도를 기초로 카메라의 시야를 보정하여 카메라가 전방 수평면을 촬영하도록 하는 선박의 카메라 위치 조절 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2021-0038089", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 선박의 카메라 위치 조절 장치 및 방법에 관한 것으로서, 특히 선박에서 주변 상황을 모니터링하기 위해 사용되는 카메라가 선박의 롤링(rolling)이나 피칭(pitching) 동작에 의해 시야가 틀어질 경우, 감지된 선 박의 롤링각도 및 피칭각도를 기초로 카메라의 시야를 보정하여 카메라가 전방 수평면을 촬영하도록 하는 선박 의 카메라 위치 조절 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2021-0038089", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근, 선원이 승선하지 않아도 완전 자율 운항하는 무인선이 현실화되고 있다. 무인선은 선박의 완전 자동화 기 능으로 선원이 승선하지 않아도 장시간 자율운항할 수 있는 선박이다. 이에 따른 무인선의 최대 장점으로는 안 전성과 경제성이다. 무인선은 빅데이터와 인공지능을 기반으로 최적화된 대응 메뉴얼과 판단을 통해 사고에 신 속히 대응하며, 잠재적인 해상사고를 저감시킬 수 있을 것으로 예상된다. 무인선의 자율 운항을 위해서는 센서, 레이더, 라이더, 적외선 카메라, 위성항법장치 등이 구축되어야 한다. 국내 특허 등록 제1973529호 공보(이하, 선행기술이라 함)에는 무인선박의 스테레오 카메라를 이용하여 해안선 조사에 대한 정밀도를 향상시켜 측량이 정확하게 이루어질 수 있도록 하는 한편, 스테레오 카메라의 높낮이를 적절하게 조절할 수 있도록 하기 위한 무인선박의 스테레오 카메라를 이용한 해안선 측량시스템이 개시되어 있 다. 그러나 선행기술은 해안선 측량에 대한 정밀성을 향상시키기 위해 스테레오 카메라의 높낮이를 조절할 수 있는 구성을 가지고 있으나, 이와 같은 카메라의 높낮이 조절 기능만으로는, 파도가 심한 바다 환경에서 선박의 롤링 및 피칭으로 인해 카메라의 시야가 틀어져 전방 수평면을 정확히 촬영하기가 어렵다는 문제점이 있었다. 선행기술문헌 특허문헌 (특허문헌 0001) 국내 특허 등록 제1973529호 공보(발명의 명칭 : 무인선박의 스테레오카메라를 이용한 해안선 측량시스템)"}
{"patent_id": "10-2021-0038089", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서 본 발명은 상기와 같은 문제점을 해결하기 위해 이루어진 것으로서, 본 발명의 목적은 파도가 심한 바다 환경에서도 카메라가 전방 수평면을 정확히 주시하도록 하여 촬영 정밀도를 향상시킬 수 있는 선박의 카메라 위 치 조절 장치 및 방법을 제공하는 데에 있다."}
{"patent_id": "10-2021-0038089", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기의 목적을 달성하기 위해, 본 발명의 실시형태에 의한 선박의 카메라 위치 조절 장치는 선박에 장착되어 전 방 수평면을 촬영하는 카메라가 선박의 롤링 및 피칭에 의해 시야가 틀어지는 것을 방지할 수 있는 선박의 카메라 위치 조절 장치로서, 상기 카메라가 일측면에 장착될 수 있는 공간을 제공하도록 구성된 헤드부; 상기 헤드 부에 장착되어 상기 카메라의 전방 주시 각도를 조절할 수 있도록 하는 카메라 틸팅부; 상기 헤드부의 하부에 부착되어 텔레스코프 방식으로 수직 이동 가능함과 아울러, 수직선을 기준으로 360도 회전가능한 지지대; 상기 지지대를 수용하여 상기 수직 이동 및 회전 운동을 조절할 수 있도록 구성된 수용부; 상기 선박의 롤링 각도 및 피칭 각도를 감지하도록 구성된 선박 운동 감지부; 및 감지된 상기 선박의 롤링 각도 및 피칭 각도를 기초로 상 기 수용부 및 카메라 틸팅부를 제어하여 상기 카메라가 전방 수평면을 주시하게 하는 제어부;를 포함하는 것을 특징으로 한다. 상기 실시형태에 의한 선박의 카메라 위치 조절 장치는 상기 카메라, 헤드부, 지지대 및 수용부의 전체면을 일 정 거리만큼 이격되어 커버하도록 구성된 투명한 재질의 카메라 보호커버; 및 상기 카메라 보호커버의 외벽에 세정액을 분사시켜 세정하도록 구성된 둘 이상의 세정 노즐;을 더 포함할 수 있다. 상기 실시형태에 의한 선박의 카메라 위치 조절 장치에 있어서, 상기 세정 노즐을 구동시키도록 구성된 세정 노 즐 구동부; 및 상기 카메라 보호커버의 투명도를 감지하도록 구성된 카메라 보호커버 투명도 감지부;를 더 포함 하며, 상기 제어부는 상기 카메라 보호커버 투명도가 설정값 미만이면 이에 상응하는 제어신호를 상기 세정 노 즐 구동부에 출력하여서 설정시간 동안 상기 세정 노즐을 구동시켜 세정액을 분사하게 할 수 있다. 상기의 목적을 달성하기 위해, 본 발명의 다른 실시형태에 의한 선박의 카메라 위치 조절 방법은 선박에 장착되 어 전방 수평면을 촬영하는 카메라가 선박의 롤링 및 피칭에 의해 시야가 틀어지는 것을 방지할 수 있는 선박의 카메라 위치 조절 방법으로서, 선박 운동 감지부에 의해 선박의 롤링 각도 및 피칭 각도를 감지하는 단계; 및 제어부가 감지된 상기 선박의 롤링 각도 및 피칭 각도를 기초로 수용부 및 카메라 틸팅부를 제어하여 상기 카메 라가 전방 수평면을 주시하게 하는 단계;를 포함하는 것을 특징으로 한다. 상기 실시형태들에 의한 선박의 카메라 위치 조절 방법은 카메라 보호커버 투명도 감지부에 의해 카메라 보호커 버의 투명도를 감지하는 단계; 및 상기 제어부는 상기 카메라 보호커버 투명도가 설정값 미만이면 이에 상응하 는 제어신호를 세정 노즐 구동부에 출력하여서 설정시간 동안 세정 노즐을 구동시켜 세정액을 분사하게 하는 단 계;를 더 포함할 수 있다."}
{"patent_id": "10-2021-0038089", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시형태에 의한 선박의 카메라 위치 조절 장치 및 방법에 의하면, 선박 운동 감지부에 의해 선박의 롤링 각도 및 피칭 각도를 감지하고, 제어부가 감지된 상기 선박의 롤링 각도 및 피칭 각도를 기초로 수용부 및 카메라 틸팅부를 제어하여 상기 카메라가 전방 수평면을 주시하게 하도록 구성됨으로써, 파도가 심한 바다 환경 에서도 카메라가 전방 수평면을 정확히 주시하도록 하여 촬영 정밀도를 향상시킬 수 있다는 뛰어난 효과가 있다. 또한, 본 발명의 실시형태에 의한 선박의 카메라 위치 조절 장치 및 방법에 의하면, 카메라 보호커버 투명도 감 지부에 의해 카메라 보호커버의 투명도를 감지하고, 상기 제어부는 상기 카메라 보호커버 투명도가 설정값 미만 이면 이에 상응하는 제어신호를 세정 노즐 구동부에 출력하여서 설정시간 동안 세정 노즐을 구동시켜 세정액을 분사하도록 구성됨으로써, 가혹한 바다 환경에서 카메라를 보호하면서 선명한 촬영을 가능하게 한다는 뛰어난 효과가 있다."}
{"patent_id": "10-2021-0038089", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 실시예를 설명함에 있어서, 본 발명과 관련된 공지기술에 대한 구체적인 설명이 본 발명의 요지를 불 필요하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명을 생략하기로 한다. 그리고 후술되는 용어들은 본 발명에서의 기능을 고려하여 정의된 용어들로서 이는 사용자, 운용자의 의도 또는 관례 등에 따라 달라질 수 있다. 그러므로 그 정의는 본 명세서 전반에 걸친 내용을 토대로 내려져야 할 것이다. 상세한 설명에서 사용되는 용어는 단지 본 발명의 실시예를 기술하기 위한 것이며, 결코 제한적으로 해석되어서는 안 된다. 명확하게 달리 사용되지 않는 한, 단수 형태의 표현은 복수 형태의 의미를 포함한다. 본 설명에서, \"포함\" 또는 \"구비\"와 같은 표현은 어떤 특성들, 숫자들, 단계들, 동작들, 요소들, 이들의 일부 또는 조합을 가리키기 위한 것이며, 기술된 것 이외에 하나 또는 그 이상의 다른 특성, 숫자, 단계, 동작, 요소, 이들의 일부 또는 조합의 존재 또는 가능 성을 배제하는 것으로 해석되어서는 안 된다. 도면에서 도시된 각 시스템에서, 몇몇 경우에서의 요소는 각각 동일한 참조 번호 또는 상이한 참조 번호를 가져 서 표현된 요소가 상이하거나 유사할 수가 있음을 시사할 수 있다. 그러나 요소는 상이한 구현을 가지고 본 명 세서에서 보여지거나 기술된 시스템 중 몇몇 또는 전부와 작동할 수 있다. 도면에서 도시된 다양한 요소는 동일 하거나 상이할 수 있다. 어느 것이 제1 요소로 지칭되는지 및 어느 것이 제2 요소로 불리는지는 임의적이다. 본 명세서에서 어느 하나의 구성요소가 다른 구성요소로 자료 또는 신호를 '전송', '전달' 또는 '제공'한다 함 은 어느 한 구성요소가 다른 구성요소로 직접 자료 또는 신호를 전송하는 것은 물론, 적어도 하나의 또 다른 구 성요소를 통하여 자료 또는 신호를 다른 구성요소로 전송하는 것을 포함한다. 이하, 본 발명의 실시예를 도면을 참조하여 상세히 설명하기로 한다. 도 1은 본 발명의 실시예에 의한 선박의 카메라 위치 조절 장치를 나타낸 도면이고, 도 3은 본 발명의 실시예에 의한 선박의 카메라 위치 조절 장치의 제어블록도이다. 본 발명의 실시예에 의한 선박의 카메라 위치 조절 장치는, 도 1, 3에 도시된 바와 같이, 헤드부, 카메라 틸팅부, 지지대, 수용부, 선박 운동 감지부, 카메라 보호 커버, 보호 커버 투명도 감 지부, 세정 노즐, 세정 노즐 구동부, 및 제어부를 포함한다. 카메라(C)는 선박의 운항 시 운전자의 시야를 확보하기 위한 위치에 설치되어 선박의 전방 수평면에 존재하는 타 선박, 해상 구조물, 암초 등의 영상을 획득하는 역할을 한다. 헤드부는 카메라(C)가 일측면에 장착될 수 있는 공간을 제공하며, 지지대에 힌지결합되어 전방 수평 축에 대해 ㅁ90도 회전가능하여 카메라(C)의 틸팅 동작을 가능하게 한다. 카메라(C)의 틸팅 각도는 카메라 틸팅 부에 의해 조절된다. 카메라 틸팅부는 헤드부에 장착되고 제어부에서 제어신호를 입력받아 카메라(C)의 틸팅 각도(즉, 카메라의 전방 주시 각도)를 조절하는 역할을 한다. 카메라 틸팅부는 힌지축과 결합된 기어들 및 기어에 동력을 제공하는 구동 모터로 이루어져 있다. 지지대는 헤드부의 하부에 부착되어 텔레스코프(telescope) 방식으로 수직 이동 가능하며 원하는 위 치에 고정될 수 있고, 수직선을 기준으로 360도 회전 가능하며 원하는 각도의 위치에 고정될 수 있다. 지지대 의 이러한 동작에 의해 카메라(C)의 수직 이동 및 수직축을 중심으로 한 회전을 가능하게 한다. 수용부는 지지대를 하부에서 수용하여 위의 수직 이동 및 수직선을 기준으로 한 회전을 가능하게 한 다. 수용부는 지지대를 유압식 또는 모터구동식으로 수직 이동 및 회전 운동시킬 수 있으며, 유압 펌 프, 액츄에이터, 모터, 기어 등을 포함할 수 있다. 선박 운동 감지부는 선박의 롤링 각도 및 피칭 각도를 감지하여 제어부에 감지신호를 제공하는 역할 을 한다. 선박 운동 감지부에는 기울기 센서, 자이로센서, 가속도센서 등이 사용될 수 있다. 카메라 보호 커버는 카메라(C), 헤드부, 지지대 및 수용부의 전체면을 일정 거리만큼 이격 되어 커버함으로써 가혹한 해양 환경에서 카메라(C) 및 그와 관련된 장비들을 보호하는 역할을 한다. 카메라 보 호 커버는 투명한 재질이므로 카메라(C)의 촬영에 방해되지 않는다. 보호커버 투명도 감지부는 카메라 보호커버의 투명도를 감지하여 이에 상응하는 감지신호를 제어부 에 출력하는 역할을 한다. 세정 노즐은 카메라 보호커버의 외벽에 세정액을 분사시켜 이물질을 제거하는 즉, 카메라 보호커버 의 세정기능을 가지고 있으며 카메라 보호 커버의 주변에 둘 이상 설치되어 있다. 세정 노즐 구동부는 제어부에 의해 제어되어 세정 노즐을 구동시키는 역할을 한다. 즉, 세정 노 즐을 개폐하여 세정액을 분사 또는 차단시키는 역할을 한다. 한편, 세정 노즐 구동부는 제어부에 의해 제어되어 세정 노즐의 분사 세기나 분사 각도도 조절 할 수도 있다. 제어부는 선박 운동 감지부를 통해 감지된 선박의 롤링 각도 및 피칭 각도를 기초로 수용부 및 카메라 틸팅부를 제어하여 카메라(C)의 시야를 조절함으로써 전방 수평면을 주시하게 할 수 있다. 더욱이, 제어부는 카메라 보호 커버 투명도 감지부를 통해 감지된 카메라 보호커버 투명도가 설정값 미만이면 이에 상응하는 제어신호를 세정 노즐 구동부에 출력하여서 설정시간 동안 세정 노즐을 구동 시켜 세정액을 분사하게 하는 역할을 한다. 한편, 제어부는 이물질 감지 센서(미도시됨)를 통해 카메라 보호 커버에 부착된 이물질을 감지하여 세정 노즐의 분사 속도 및 분사 각도를 조절할 수도 있다. 한편, 제어부는 선박의 롤링 각도 및 피칭 각도와, 지지대의 수직 이동 길이 및 회전 각도와, 카메라 (C)의 틸팅 각도를 데이터 세트로 하여 인공신경망을 딥러닝 학습시킨 후, 선박 운동 감지부로부터 선박의 롤링 각도 및 피칭 각도 감지 신호가 입력되었을 때, 이 감지 신호를 딥러닝 학습된 인공신경망에 입력시켜 지 지대의 수직 이동 길이 및 회전 각도와, 카메라(C)의 틸딩 각도를 획득하고 이에 상응하는 제어신호를 수 용부 및 카메라 틸팅부에 입력시켜 제어함으로써 보다 정밀한 카메라 동작 제어가 가능하다. 위에 설명한 본 발명의 실시예에 의한 선박의 카메라 위치 조절 방법에 대해 도면을 참조하여 설명하기로 한다. 도 4는 본 발명의 실시예에 의한 선박의 카메라 위치 조절 방법을 설명하기 위한 플로우챠트로서, 여기서 S는 스텝(step)을 의미한다. 우선, 선박 운동 감지부에 의해 선박의 롤링 각도 및 피칭 각도가 감지된다(S10). 다음, 제어부가 스텝(S10)에서 감지된 선박의 롤링 각도 및 피칭 각도를 기초로 수용부 및 카메라 틸 팅부를 제어하여 카메라(C)의 시야를 보정함으로써 카메라(C)가 선박의 전방 수평면을 주시할 수 있게 한 다(S20). 다음, 카메라 보호커버 투명도 감지부에 의해 카메라 보호커버의 투명도가 감지되고, 제어부는 감지된 카메라 보호커버의 투명도가 설정값 이상 인지의 여부를 결정한다(S30). 만약, 상기 스텝(S30)에서 보호커버의 투명도가 설정값 이상이며(Y), 제어부는 동작을 종료한다. 한편, 상기 스텝(S30)에서 보호커버의 투명도가 설정값 미만이면(N), 제어부는 이에 상응하는 제어신 호를 세정 노즐 구동부에 출력하여서 설정시간 동안 세정 노즐을 구동시켜 세정액을 분사시킴으로써, 카메라 보호 커버를 세정하게 된다(S35). 위와 같이 구성된, 본 발명의 실시예에 의한 선박의 카메라 위치 조절 장치 및 방법에 의하면, 선박 운동 감지 부에 의해 선박의 롤링 각도 및 피칭 각도를 감지하고, 제어부가 감지된 상기 선박의 롤링 각도 및 피칭 각도를 기초로 수용부 및 카메라 틸팅부를 제어하여 상기 카메라가 전방 수평면을 주시하게 하도록 구성됨으로써, 파도 가 심한 바다 환경에서도 카메라가 전방 수평면을 정확히 주시하도록 하여 촬영 정밀도를 향상시킬 수 있다. 또한, 본 발명의 실시예에 의한 선박의 카메라 위치 조절 장치 및 방법에 의하면, 카메라 보호커버 투명도 감지 부에 의해 카메라 보호커버의 투명도를 감지하고, 상기 제어부는 상기 카메라 보호커버 투명도가 설정값 미만이 면 이에 상응하는 제어신호를 세정 노즐 구동부에 출력하여서 설정시간 동안 세정 노즐을 구동시켜 세정액을 분 사하도록 구성됨으로써, 가혹한 바다 환경에서 카메라를 보호하면서 선명한 촬영을 가능하게 한다. 도면과 명세서에는 최적의 실시예가 개시되었으며, 특정한 용어들이 사용되었으나 이는 단지 본 발명의 실시형 태를 설명하기 위한 목적으로 사용된 것이지 의미를 한정하거나 특허 청구범위에 기재된 본 발명의 범위를 제한 하기 위하여 사용된 것은 아니다. 그러므로 본 기술 분야의 통상의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 타 실시예가 가능하다는 점을 이해할 수 있을 것이다. 따라서 본 발명의 진정한 기술적 보호범위는 첨부된 특허청구범위의 기술적 사상에 의해 정해져야 할 것이다."}
{"patent_id": "10-2021-0038089", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 의한 선박의 카메라 위치 조절 장치를 나타낸 도면이다. 도 2는 선박이 파도에 의해 들어 올려졌을 때, 도 1의 선박의 카메라 위치 조절 장치에 의해 카메라의 위치가 조절되어 카메라가 전방 수평면을 주시하는 도면이다. 도 3은 본 발명의 실시예에 의한 선박의 카메라 위치 조절 장치의 제어블록도이다. 도 4는 본 발명의 실시예에 의한 선박의 카메라 위치 조절 방법을 설명하기 위한 플로우챠트이다."}
