{"patent_id": "10-2023-0119145", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0001827", "출원번호": "10-2023-0119145", "발명의 명칭": "카메라 모듈 및 그를 포함하는 전자 장치", "출원인": "삼성전자주식회사", "발명자": "원종훈"}}
{"patent_id": "10-2023-0119145", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "카메라 모듈(205, 212, 213; 500; 900)에 있어서,일면에 형성된 수용 홈(611)과, 상기 수용 홈이 제공하는 영역 내에 제공된 제1 광학 면(OS1)을 포함하는 제1반사 부재(601; 701); 일면에서 돌출되어 적어도 부분적으로 상기 수용 홈에 수용되는 돌출부(621)와, 상기 돌출부의 한 표면에 제공되어 상기 제1 광학 면에 마주보게 배치되는 제2 광학 면(OS2)을 포함하는 제2 반사 부재(602; 702); 및상기 제1 광학 면과 상기 제2 광학 면을 경유하여 안내된 광의 적어도 일부를 검출하도록 구성된 이미지 센서(411; 925)를 포함하고, 상기 수용 홈은 상기 제1 광학 면 또는 상기 제2 광학 면에 평행한 평면에서, 상기 돌출부가 제1 연장 방향(C1)으로 이동하는 것을 허용하도록 구성되고, 상기 돌출부가 상기 제1 연장 방향에 교차하는 제2 연장 방향(C2)으로 이동하는 것을 제한하도록 구성된 카메라 모듈."}
{"patent_id": "10-2023-0119145", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서, 상기 제1 반사 부재는 상기 제1 광학 면에 대하여 경사진 제1 표면(TS1, RS1)을 포함하고, 상기 제2 반사 부재는 상기 제2 광학 면에 대하여 경사진 제2 표면(TS2, RS2)을 포함하며, 상기 제2 표면은 상기 제1 광학 면 또는 상기 제2 광학 면을 사이에 두고 상기 제1 표면과 적어도 부분적으로반대 방향을 지향하도록 배치되고, 상기 수용 홈과 상기 돌출부는, 상기 제1 표면과 상기 제2 표면 사이의 거리를 지정된 범위 내에서 유지시키도록 구성된 카메라 모듈."}
{"patent_id": "10-2023-0119145", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서, 상기 제1 표면 또는 상기 제2 표면은 상기 이미지 센서로 안내되는 광을 투과 또는 반사시키도록 구성된 카메라 모듈."}
{"patent_id": "10-2023-0119145", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1 항 내지 제3 항 중 어느 한 항에 있어서, 상기 돌출부는, 상기 제2 광학 면의 가장자리로부터 수직하게 또는 경사지게 연장된 복수의 측면(621a, 621b, 621c, 621d)을 포함하고, 상기 복수의 측면 중 적어도 하나가 상기 제1 연장 방향에 나란하게 정렬되고, 상기 제1 연장 방향에 교차하는방향에서 상기 수용 홈의 내벽에 마주보게 배치된 카메라 모듈."}
{"patent_id": "10-2023-0119145", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4 항에 있어서, 상기 복수의 측면 중 다른 적어도 하나가 상기 제1 연장 방향을 지향하게 배치되면서 상기 수용 홈의 외부 공간으로 노출된 카메라 모듈.공개특허 10-2025-0001827-3-청구항 6 제5 항에 있어서, 상기 복수의 측면 중 상기 수용 홈의 외부 공간으로 노출된 측면은, 상기 제1 반사 부재의 표면 중 적어도 일부와 연속된 평면 또는 연속된 곡면을 이루게 배치된 카메라 모듈."}
{"patent_id": "10-2023-0119145", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6 항에 있어서, 상기 복수의 측면 중 상기 수용 홈의 외부 공간으로 노출된 측면과, 상기 제1 반사 부재의 표면 중 적어도 일부사이의 경계에 제공된 더미 홈(699, 799); 및상기 더미 홈의 적어도 일부에 충진된 접착제(799a)를 더 포함하는 카메라 모듈."}
{"patent_id": "10-2023-0119145", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1 항 내지 제7 항 중 어느 한 항에 있어서, 상기 제1 반사 부재 또는 상기 제2 반사 부재의 한 표면에 수직하게 입사된 광이 상기 제1 광학 면 또는 상기 제2 광학 면을 수직하게 투과하도록 구성된 카메라 모듈."}
{"patent_id": "10-2023-0119145", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1 항 내지 제8 항 중 어느 한 항에 있어서, 상기 제1 반사 부재는 제1 투과면(first transmissive surface)(TS1)과, 상기 제1 투과면에 대하여 경사지게배치된 제1 반사면(first reflective surface)(RS1)을 포함하고,상기 제2 반사 부재는 상기 제1 투과면의 반대 방향을 향하도록 배치된 제2 투과면(TS2)과, 상기 제1 반사면의반대 방향을 향하도록 배치된 제2 반사면(RS2)을 포함하며,상기 제1 투과면과 상기 제2 투과면 중 어느 하나가 상기 이미지 센서와 마주보게 배치된 카메라 모듈."}
{"patent_id": "10-2023-0119145", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9 항에 있어서, 상기 제1 투과면과 상기 제2 투과면 중 다른 하나에 수직하게 입사된 광이 상기 제1 광학 면또는 상기 제2 광학 면을 수직하게 투과하도록 구성된 카메라 모듈."}
{"patent_id": "10-2023-0119145", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9 항 내지 제10 항 중 어느 한 항에 있어서, 외부의 광을 입사받아 상기 제1 투과면과 상기 제2 투과면 중 다른 하나로 안내하는 적어도 하나의 렌즈(421a,421b; 921)를 더 포함하는 카메라 모듈."}
{"patent_id": "10-2023-0119145", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1 항 내지 제11 항 중 어느 한 항에 있어서, 상기 제1 반사 부재의 표면 중 일부인 제1 경사면(713)으로서, 상기 제1 반사 부재의 상기 일면에 대하여 경사지게 형성된 상기 제1 경사면; 및상기 제2 반사 부재의 표면 중 일부인 제2 경사면(723)으로서, 상기 제2 반사 부재의 상기 일면에 대하여 경사지게 형성된 상기 제2 경사면을 더 포함하고, 공개특허 10-2025-0001827-4-상기 돌출부가 상기 수용 홈에 수용된 때, 상기 제1 경사면과 상기 제2 경사면이 인접하게 배치되어 더미 홈(699; 799)을 형성하도록 구성된 카메라 모듈."}
{"patent_id": "10-2023-0119145", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12 항에 있어서, 상기 더미 홈의 적어도 일부에 충진된 접착제를 더 포함하는 카메라 모듈."}
{"patent_id": "10-2023-0119145", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제1 항 내지 제12 항 중 어느 한 항에 있어서,상기 제1 광학 면 가장자리의 적어도 일부, 또는 상기 제2 광학 면 가장자리의 적어도 일부에 제공된 차광 부재(629)를 더 포함하는 카메라 모듈."}
{"patent_id": "10-2023-0119145", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14 항에 있어서, 상기 차광 부재는, 인쇄층, 코팅층, 증착층, 도금층, 차광 필름 또는 차광 시트 중 적어도하나를 포함하는 카메라 모듈."}
{"patent_id": "10-2023-0119145", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제14 항 내지 제15 항 중 어느 한 항에 있어서,상기 이미지 센서로부터 연장된 가요성 인쇄회로 기판(903)을 더 포함하고, 상기 가요성 인쇄회로 기판은, 적어도 부분적으로 상기 이미지 센서와 동일 평면에 배치된 제1 연장부(931);상기 제1 연장부로부터 연장되며 상기 제1 연장부에 대하여 경사지게 배치된 제2 연장부(932); 및상기 제2 연장부로부터 연장되며 상기 제1 연장부와 상기 제2 연장부에 대하여 경사지게 배치된 제3 연장부(933)를 포함하는 카메라 모듈."}
{"patent_id": "10-2023-0119145", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16 항에 있어서, 상기 제1 연장부는, 상기 이미지 센서로 광이 입사되는 방향을 따라 상기 이미지 센서가 왕복 운동하는 것을 허용하도록 구성된 카메라 모듈."}
{"patent_id": "10-2023-0119145", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제16 항 내지 제17 항 중 어느 한 항에 있어서, 상기 제2 연장부 또는 상기 제3 연장부는 상기 이미지 센서로광이 입사되는 방향에 교차하는 평면에서 상기 이미지 센서가 수평 이동하는 것을 허용하도록 구성된 카메라 모듈."}
{"patent_id": "10-2023-0119145", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "전자 장치(101; 200; 300; 400; 1000)에 있어서, 공개특허 10-2025-0001827-5-적어도 하나의 제1 카메라 모듈(991); 상기 적어도 하나의 제1 카메라 모듈과 인접하게 배치되며 상기 적어도 하나의 제1 카메라 모듈보다 작은 화각(field of view; FOV)을 가진 제2 카메라 모듈(205; 212; 213; 500; 900)로서, 제1 항 내지 제18 항 중 어느한 항에 따른 상기 제2 카메라 모듈; 및상기 적어도 하나의 제1 카메라 모듈 또는 상기 제2 카메라 모듈 중 적어도 하나를 이용하여 피사체 이미지를획득하도록 구성된 프로세서(120)를 포함하는 전자 장치."}
{"patent_id": "10-2023-0119145", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19 항에 있어서, 상기 적어도 하나의 제1 카메라 모듈은 상기 전자 장치의 한 측면에 인접하면서, 상기 전자장치의 한 측면과 상기 제2 카메라 모듈 사이의 영역에 배치된 전자 장치."}
{"patent_id": "10-2023-0119145", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 일 실시예에 따르면, 카메라 모듈 및/또는 그를 포함하는 전자 장치는, 일면에 형성된 수용 홈과, 상 기 수용 홈이 제공하는 영역 내에 제공된 제1 광학 면을 포함하는 제1 반사 부재, 일면에서 돌출되어 적어도 부 분적으로 상기 수용 홈에 수용되는 돌출부와, 상기 돌출부의 한 표면에 제공되어 상기 제1 광학 면에 마주보게 배치되는 제2 광학 면을 포함하는 제2 반사 부재, 및 상기 제1 광학 면과 상기 제2 광학 면을 경유하여 안내된 광의 적어도 일부를 검출하도록 구성된 이미지 센서를 포함할 수 있다. 일 실시예에서, 상기 수용 홈은 상기 제1 광학 면 또는 상기 제2 광학 면에 평행한 평면에서, 상기 돌출부가 제1 연장 방향으로 이동하는 것을 허용하도록 구성되고, 상기 돌출부가 상기 제1 연장 방향에 교차하는 제2 연장 방향으로 이동하는 것을 제한하도록 구성될 수 있다. 이외에도 일 실시예가 가능할 수 있다."}
{"patent_id": "10-2023-0119145", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시의 실시예는 전자 장치에 관한 것으로서, 예를 들면, 카메라 모듈 및/또는 그를 포함하는 전자 장치에 관한 것이다."}
{"patent_id": "10-2023-0119145", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전자 장치라 함은, 가전제품으로부터, 전자 수첩, 휴대용 멀티미디어 재생기, 이동통신 단말기, 태블릿 PC, 영 상/음향 장치, 데스크톱/랩톱 컴퓨터 및/또는 차량용 내비게이션과 같이 탑재된 프로그램에 따라 지정된 기능을 수행하는 장치를 의미할 수 있다. 예를 들면, 이러한 전자 장치들은 저장된 정보를 음향이나 영상으로 출력할 수 있다. 전자 장치의 집적도가 높아지고, 초고속, 대용량 무선통신이 보편화되면서, 최근에는, 이동통신 단말 기와 같은 하나의 전자 장치에 다양한 기능이 탑재될 수 있다. 예를 들면, 통신 기능뿐만 아니라, 게임과 같은 엔터테인먼트 기능, 음악/동영상 재생과 같은 멀티미디어 기능, 모바일 뱅킹 등을 위한 통신 및 보안 기능, 및/ 또는 일정 관리나 전자 지갑의 기능이 하나의 전자 장치에 집약되고 있다. 디지털 카메라의 제작 기술이 발달하면서, 소형, 경량화된 카메라 모듈을 장착한 전자 장치가 상용화되었다. 항 상 휴대하는 것이 일반적인 전자 장치(예: 이동통신 단말기)에 카메라 모듈, 예를 들어, 촬상 장치가 탑재되면 서, 사용자는 사진이나 동영상 촬영은 물론, 영상 통화 및/또는 증강 현실과 같은 다양한 기능을 간편하게 활용 할 수 있게 되었다. 상술한 정보는 본 개시에 대한 이해를 돕기 위한 목적으로 하는 배경 기술(related art)로 제공될 수 있다. 상 술한 내용 중 어느 것도 본 개시와 관련하여 종래 기술(prior art)로서 적용될 수 있는지에 관해서는 어떠한 주 장이나 결정이 제기되지 않는다."}
{"patent_id": "10-2023-0119145", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시예에 따르면, 카메라 모듈은, 일면에 형성된 수용 홈과, 상기 수용 홈이 제공하는 영역 내에 제공된 제1 광학 면을 포함하는 제1 반사 부재, 일면에서 돌출되어 적어도 부분적으로 상기 수용 홈에 수용되는 돌출부와, 상기 돌출부의 한 표면에 제공되어 상기 제1 광학 면에 마주보게 배치되는 제2 광학 면을 포함하는 제2 반사 부재, 및 상기 제1 광학 면과 상기 제2 광학 면을 경유하여 안내된 광의 적어도 일부를 검출하도록 구 성된 이미지 센서를 포함할 수 있다. 일 실시예에서, 상기 수용 홈은 상기 제1 광학 면 또는 상기 제2 광학 면 에 평행한 평면에서, 상기 돌출부가 제1 연장 방향으로 이동하는 것을 허용하도록 구성되고, 상기 돌출부가 상 기 제1 연장 방향에 교차하는 제2 연장 방향으로 이동하는 것을 제한하도록 구성될 수 있다. 본 개시의 일 실시예에 따르면, 전자 장치는, 적어도 하나의 제1 카메라 모듈, 상기 적어도 하나의 제1 카메라 모듈과 인접하게 배치되며 상기 적어도 하나의 제1 카메라 모듈보다 작은 화각(field of view; FOV)을 가진 제2 카메라 모듈로서, 후술되는 실시예(들)를 통해 개시된 상기 제2 카메라 모듈, 및 상기 적어도 하나의 제1 카메 라 모듈 또는 상기 제2 카메라 모듈 중 적어도 하나를 이용하여 피사체 이미지를 획득하도록 구성된 프로세서를포함할 수 있다."}
{"patent_id": "10-2023-0119145", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "전자 장치가 소형화, 경량화됨으로써, 휴대와 사용이 더욱 편리할 수 있다. 휴대용 전자 장치에서도 더 큰 화면 을 즐길 수 있도록 디스플레이가 대형화되는 환경에서는, 두께를 줄임으로써 전자 장치가 소형화, 경량화될 수 있다. 소형화된 전자 장치에서는 양호한 광학적 성능을 가진 촬상 장치의 탑재에 어려움이 있을 수 있다. 예를 들어, 렌즈의 수나 크기가 클수록 촬상 장치의 광학적 성능의 확보가 용이할 수 있지만, 소형화된 전자 장치에 서는 렌즈(들)나 이미지 센서의 배열에 있어 설계 자유도가 낮아질 수 있다. 따라서 망원 카메라, 광각 카메라, 초광각 카메라 및/또는 접사 카메라와 같이 지정된 화각 범위에서 양호한 광학 성능을 제공하는 복수의 카메라 모듈이 하나의 전자 장치에 탑재될 수 있다. 다른 카메라 모듈보다 좁은 화각과 긴 초점 거리를 가진 망원 카메 라는 광 경로를 변환하는 광학 부재(예: 프리즘 또는 미러)를 포함함으로써, 소형화된 전자 장치에 탑재되기 용 이할 수 있다. 예를 들어, 미러나 프리즘과 같은 광학 부재를 배치한 때, 렌즈(들)나 이미지 센서의 배열이 용 이해질 수 있다. 하지만, 추가의 광학 부재가 배치될 때 이미지 센서에 이르는 경로에서 반사 또는 굴절의 횟수 가 증가될 수 있으며, 이는 설계 경로가 아닌 다른 경로를 통해 이미지 센서에 도달하는 광을 증가시키는 원인 이 될 수 있다. 설계되지 않은 경로를 통해 입사된 광, 또는 그로 인해 이미지 품질이 저하되는 것을 '미광 (stray light)' 또는 '플레어(flare)'라 언급될 수 있다. 본 개시의 일 실시예는, 상술한 문제점 및/또는 단점을 적어도 해소하고 후술하는 장점을 적어도 제공하기 위한 것으로서, 이미지 센서로 안내되는 광을 적어도 1회 반사 또는 굴절시키는 광학 부재를 포함하는 카메라 모듈및/또는 그를 포함하는 전자 장치를 제공할 수 있다. 본 개시의 일 실시예는, 광 경로의 설계 자유도가 향상됨으로써 망원 성능을 제공하면서 소형화가 용이한 카메 라 모듈 및/또는 그를 포함하는 전자 장치를 제공할 수 있다. 본 개시의 일 실시예는, 광학 부재를 포함하면서 이미지 센서로 안내되는 광의 반사 또는 굴절에 의한 미광 또 는 플레어를 억제할 수 있는 카메라 모듈 및/또는 그를 포함하는 전자 장치를 제공할 수 있다. 본 문서에서 이루고자 하는 기술적 과제는 이상에서 언급한 기술적 과제로 제한되지 않으며, 언급되지 않은 또"}
{"patent_id": "10-2023-0119145", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "다른 기술적 과제들은 아래의 기재로부터 본 개시가 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다. 첨부된 도면에 관한 다음 설명은 청구항 및 이에 상응하는 내용을 포함하는 본 개시의 다양한 예시적인 구현에 대한 이해를 제공할 수 있다. 다음의 설명에서 개시된 예시적인 실시예는 이해를 돕기 위한 다양한 구체적인 세 부사항들을 포함하고 있지만 이는 다양한 예시적인 실시예 중 하나인 것으로 간주된다. 따라서, 일반 기술자는 본 문서에 기술된 다양한 구현의 다양한 변경과 수정이 공개의 범위와 기술적 사상에서 벗어나지 않고 이루어질 수 있음을 이해할 것이다. 또한 명확성과 간결성을 위해 잘 알려진 기능 및 구성의 설명은 생략될 수 있다. 다음 설명과 청구에 사용된 용어와 단어는 참고 문헌적 의미에 국한되지 않고, 본 개시의 일 실시예를 명확하고"}
{"patent_id": "10-2023-0119145", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "일관되게 설명하기 위해 사용될 수 있다. 따라서, 기술분야에 통상의 기술자에게, 공시의 다양한 구현에 대한 다음의 설명이 권리범위 및 이에 준하는 것으로 규정하는 공시를 제한하기 위한 목적이 아니라 설명을 위한 목 적으로 제공된다는 것은 명백하다 할 것이다. 문맥이 다르게 명확하게 지시하지 않는 한, \"a\", \"an\", 그리고 \"the\"의 단수형식은 복수의 의미를 포함한다는 것을 이해해야 한다. 따라서 예를 들어 \"구성 요소 표면\"이라 함은 구성 요소의 표면 중 하나 또는 그 이상을 포함하는 것으로 이해될 수 있다. 도 1은, 본 개시의 일 실시예에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네트워크 환경에서 전자 장치는 제1 네트워크(예: 근거리 무선 통신 네트워크)를 통 하여 전자 장치와 통신하거나, 또는 제2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장 치 또는 서버 중 적어도 하나와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 서버를 통하여 전자 장치와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈, 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스 , 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈 , 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 일 실시예에서는, 전자 장치에 는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성 요소가 추가될 수 있다. 일 실시예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모듈 )은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세서 는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메 모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메 모리에 저장할 수 있다. 일실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또 는 어플리케이션 프로세서), 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처 리 장치, 신경망 처리 장치(NPU; neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서 를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능에 특 화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있 다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구 성 요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일실시예에 따르면, 보조 프 로세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지 능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능 모델이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi- supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않 는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있 다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼) 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상 기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일실시예 에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부의 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰))를 통 해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부의 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위 해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일실시예에 따르면, 인터페이스는, 예를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인 터페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부의 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일실시예에 따르면, 카메라 모듈은 하나 이상 의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일실시예에 따르면, 전력 관리 모듈 은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성 요소에 전력을 공급할 수 있다. 일실시예에 따르면, 배터 리는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부의 전자 장치(예: 전자 장치, 전자 장치, 또는 서버)간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일실시예에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제1 네트워크(예: 블 루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워크) 또는 제2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성 요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복 수의 구성 요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제1 네트워크 또는 제2 네트워크와 같은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부의 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이 상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링 크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이루어 진 방사체를 포함하는 안테나를 포함할 수 있다. 일실시예에 따르면, 안테나 모듈은 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제1 네트워크 또는 제2 네트워크와 같은 통신 네트워 크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수 의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모듈 과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 일 실시예에 따르면, 방사체 이외에 다른 부품(예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 일 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일실시예에 따르면, mmWave 안 테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제1 면(예: 아래 면)에 또는 그에 인접하여 배치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제2 면(예: 윗면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있는 복수의 안테 나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들 간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))를 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일실시예에 따르면, 명령 또는 데이터는 제2 네트워크에 연결된 서버를 통해서 전자 장치와 외 부의 전자 장치 간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(102, 104 또는 108) 중 하나 이상의 외부 장치들에서 실행될 수 있다. 예를 들 면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 하 나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치 는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC; mobile edge computing) 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 일 실시예에 있어서, 외부의 전자 장 치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일실시예에 따르면, 외부의 전자 장치 또는 서버는 제2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 본 개시의 실시예(들)에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되지 않는다. 본 개시의 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설 명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템에 대응하 는 명사의 단수형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함 할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\",“A 또는 B 중 적어도 하나”, \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나”, 및 “A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하 는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제1\", \"제2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제1) 구성요소 가 다른(예: 제2) 구성요소에, “기능적으로” 또는 “통신적으로”라는 용어와 함께 또는 이런 용어없이, “커 플드” 또는 “커넥티드”라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로(예: 유선으로), 무선으로, 또는 제3 구성요소를 통하여 연결될 수 있다는 것으로 이해될 수 있다. 본 개시의 실시예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로 등의 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부가 될 수 있다. 예를 들면, 일실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형태로 구현 될 수 있다. 본 개시의 실시예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어(예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서)는, 저장 매체로부터 저장된 하나 이상의 명령 어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것을 가능하게 한다. 상기 하나 이상의 명령어들은 컴 파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있 는 저장매체는, 비일시적(non-transitory) 저장매체의 형태로 제공될 수 있다. 여기서, ‘비일시적’은 저장매 체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전자기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장매체에 반영구적으로 저장되는 경우와 임시적으로 저장되는 경우를 구분하지 않는다. 일실시예에 따르면, 본 개시의 실시예(들)에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD-ROM))의 형태로 배포 되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치들(예: 스마트폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제 품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 일 실시예에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수 있다. 일 실시예에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상의 다른 구성요 소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그 램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성 요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것 과 동일 또는 유사하게 수행할 수 있다. 일 실시예에 따르면, 모듈, 프로그램 또는 다른 구성요소에 의해 수행 되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동작들 중 하나 이상 이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다. 이하의 상세한 설명에서, 전자 장치의 길이 방향, 폭 방향 및/또는 두께 방향이 언급될 수 있으며, 길이 방향은 'Y축 방향'으로, 폭 방향은 'X축 방향'으로, 및/또는 두께 방향은 'Z축 방향'으로 정의될 수 있다. 일 실시예에 서, 구성요소가 지향하는 방향에 관해서는 도면에 예시된 직교 좌표계와 아울러, '음/양(-/+)'이 함께 언급될 수 있다. 예를 들어, 전자 장치 및/또는 하우징의 전면은 '+Z 방향을 향하는 면'으로, 후면은 '-Z 방향을 향하 는 면'으로 정의될 수 있다. 일 실시예에서, 전자 장치 및/또는 하우징 측면은, +X 방향을 향하는 영역, +Y 방 향을 향하는 영역, -X 방향을 향하는 영역 및/또는 -Y 방향을 향하는 영역을 포함할 수 있다. 일 실시예에서, 'X축 방향'은 '-X 방향'과 '+X 방향'을 모두 포함하는 의미일 수 있다. 이는 설명의 간결함을 위해 도면에 기재 된 직교 좌표계를 기준으로 한 것으로, 이러한 방향이나 구성요소들에 대한 설명이 본 개시의 실시예(들)를 한 정하지 않음에 유의한다. 예를 들어, 전자 장치의 설계 사양이나 사용자의 사용 습관에 따라 직교 좌표계는 본 개시와는 다르게 정의될 수 있다. 도 2는 본 개시의 일 실시예에 따른 전자 장치(예: 도 1의 전자 장치)의 전면을 나타내는 사시도이다. 도 3은 본 개시의 일 실시예에 따른, 도 2에 도시된 전자 장치의 후면을 나타내는 사시도이다. 도 2 및 도 3을 참조하면, 일 실시예에 따른 전자 장치는, 제1 면(또는 전면)(210A), 제2 면(또는 후 면)(210B), 및 제1 면(210A) 및 제2 면(210B) 사이의 공간을 둘러싸는 측면(210C)을 포함하는 하우징을 포함할 수 있다. 일 실시예(미도시)에서는, 하우징은, 도 2의 제1 면(210A), 도 3의 제2 면(210B) 및 측면 (210C)들 중 일부를 형성하는 구조를 지칭할 수도 있다. 일 실시예에 따르면, 제1 면(210A)은 적어도 일부분이 실질적으로 투명한 전면 플레이트(예: 다양한 코팅 레이어들을 포함하는 글라스 플레이트, 또는 폴리머 플 레이트)에 의하여 형성될 수 있다. 제2 면(210B)은 실질적으로 불투명한 후면 플레이트에 의하여 형성될 수 있다. 상기 후면 플레이트는, 예를 들어, 코팅 또는 착색된 유리, 세라믹, 폴리머, 금속(예: 알루미늄, 스테인레스 스틸(STS), 또는 마그네슘), 또는 상기 물질들 중 적어도 둘의 조합에 의하여 형성될 수 있다. 상기 측면(210C)은, 전면 플레이트 및 후면 플레이트와 결합하며, 금속 및/또는 폴리머를 포함하는 측면 구조(또는 \"측면 베젤 구조\")에 의하여 형성될 수 있다. 일 실시예에서는, 후면 플레이트 및 측면 구 조는 일체로 형성되고 동일한 물질(예: 알루미늄과 같은 금속 물질)을 포함할 수 있다. 도시되지는 않지만, 상기 전면 플레이트는, 가장자리의 적어도 일부에서 상기 후면 플레이트 쪽으로 휘어져 심리스하게(seamless) 연장된 영역(들)을 포함할 수 있다. 일 실시예에서는, 상기 전면 플레이트(또는 상기 후면 플레이트)가 상기 후면 플레이트(또는 상기 전면 플레이트) 쪽으로 휘어져 연 장된 영역들 중 하나만을, 제1 면(210A)의 일측 가장자리에 포함할 수 있다. 실시예에 따라, 전면 플레이트 또는 후면 플레이트는 실질적으로 평판 형상일 수 있으며, 이 경우, 휘어져 연장된 영역을 포함하지 않을 수 있다. 휘어져 연장된 영역을 포함하는 경우, 휘어져 연장된 영역이 포함된 부분에서 전자 장치의 두께는 다른 부분의 두께보다 작을 수 있다. 일 실시예에 따르면, 전자 장치는, 디스플레이, 오디오 모듈(203, 207, 214), 센서 모듈(204, 219), 카메라 모듈(205, 212, 213), 키 입력 장치, 발광 소자, 및 커넥터 홀(208, 209) 중 적어도 하나 이 상을 포함할 수 있다. 일 실시예에서는, 전자 장치는, 구성요소들 중 적어도 하나(예: 키 입력 장치, 또는 발광 소자)를 생략하거나 다른 구성요소를 추가적으로 포함할 수 있다. 디스플레이는, 예를 들어, 전면 플레이트의 상당 부분을 통하여 노출될 수 있다. 일 실시예에서는, 상기 제1 면(210A)을 형성하는 전면 플레이트를 통하여 또는 측면(210C)의 일부를 통하여 상기 디스플레이 의 적어도 일부가 노출될 수 있다. 일 실시예에서는, 디스플레이의 모서리를 상기 전면 플레이트 의 인접한 외곽 형상과 대체로 동일하게 형성할 수 있다. 일 실시예(미도시)에서는, 디스플레이가 노 출되는 면적을 확장하기 위하여, 디스플레이의 외곽과 전면 플레이트의 외곽간의 간격이 대체로 동일 하게 형성될 수 있다. 일 실시예(미도시)에서는, 디스플레이의 화면 표시 영역의 일부에 리세스 또는 개구부(opening)를 형성하 고, 상기 리세스 또는 상기 개구부(opening)와 정렬되는 오디오 모듈, 센서 모듈, 카메라 모듈, 및 발광 소자 중 적어도 하나 이상을 포함할 수 있다. 일 실시예(미도시)에서는, 디스플레이의 화면 표시 영역의 배면에, 오디오 모듈, 센서 모듈, 카메라 모듈, 지문 센서(미도시), 및 발광 소자 중 적어도 하나 이상을 포함할 수 있다. 일 실시예(미도시)에서는, 디스플레이는, 터치 감지 회로, 터치의 세기(압력)를 측정할 수 있는 압력 센서, 및/또는 자기장 방식의 스타일러스 펜을 검출하는 디지타이저 와 결합되거나 인접하여 배치될 수 있다. 일 실시예에서는, 상기 센서 모듈(204, 219)의 적어도 일부, 및/또는 키 입력 장치의 적어도 일부가, 상기 제1 영역(210D)들, 및/또는 상기 제2 영역(210E)들에 배치될 수 있다. 오디오 모듈(203, 207, 214)은, 마이크 홀 및 스피커 홀(207, 214)을 포함할 수 있다. 마이크 홀은 외부의 소리를 획득하기 위한 마이크가 내부에 배치될 수 있고, 일 실시예에서는 소리의 방향을 감지할 수 있도 록 복수개의 마이크가 배치될 수 있다. 스피커 홀(207, 214)은, 외부 스피커 홀 및 통화용 리시버 홀(21 4)을 포함할 수 있다. 일 실시예에서는 스피커 홀(207, 214)과 마이크 홀이 하나의 홀로 구현 되거나, 스 피커 홀(207, 214) 없이 스피커가 포함될 수 있다(예: 피에조 스피커). 센서 모듈(204, 219)은, 전자 장치의 내부의 작동 상태, 또는 외부의 환경 상태에 대응하는 전기 신호 또 는 데이터 값을 생성할 수 있다. 센서 모듈(204, 219)은, 예를 들어, 하우징의 제1 면(210A)에 배치된 제1 센서 모듈(예: 근접 센서) 및/또는 제2 센서 모듈(미도시)(예: 지문 센서), 및/또는 상기 하우징의 제2 면(210B)에 배치된 제3 센서 모듈 및/또는 제4 센서 모듈(예: 지문 센서)을 포함할 수 있다. 상기 지 문 센서는 하우징의 제1면(210A)(예: 디스플레이)뿐만 아니라 제2면(210B) 또는 측면(210C)에 배치될 수 있다. 전자 장치는, 예를 들어, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서 중 적어도 하나를 더 포함할 수 있다. 카메라 모듈(205, 212, 213)은, 전자 장치의 제1 면(210A)에 배치된 제1 카메라 장치, 및 제2 면 (210B)에 배치된 제2 카메라 장치, 및/또는 플래시를 포함할 수 있다. 상기 카메라 장치들(205, 21 2)은, 하나 또는 복수의 렌즈들, 이미지 센서, 및/또는 이미지 시그널 프로세서를 포함할 수 있다. 플래시(21 3)는, 예를 들어, 발광 다이오드 또는 제논 램프(xenon lamp)를 포함할 수 있다. 일 실시예에서는, 2개 이상의 렌즈들(적외선 카메라, 광각 및 망원 렌즈) 및 이미지 센서들이 전자 장치의 한 면에 배치될 수 있다. 일 실시예에서, 플래시는 적외선을 방사할 수 있으며, 플래시에 의해 방사되어 피사체에 의해 반사된 적 외선은 제3 센서 모듈를 통해 수신될 수 있다. 전자 장치 또는 전자 장치의 프로세서는 제3 센 서 모듈에서 적외선이 수신된 시점에 기반하여 피사체의 심도 정보를 검출할 수 있다. 키 입력 장치는, 하우징의 측면(210C)에 배치될 수 있다. 일 실시예에서는, 전자 장치는 상기 언급된 키 입력 장치 중 일부 또는 전부를 포함하지 않을 수 있고 포함되지 않은 키 입력 장치는 디 스플레이 상에 소프트 키 등 다른 형태로 구현될 수 있다. 일 실시예에서, 키 입력 장치는 하우징의제2면(210B)에 배치된 센서 모듈을 포함할 수 있다. 발광 소자는, 예를 들어, 하우징의 제1 면(210A)에 배치될 수 있다. 발광 소자는, 예를 들어, 전자 장치의 상태 정보를 광 형태로 제공할 수 있다. 일 실시예에서는, 발광 소자는, 예를 들어, 카 메라 모듈의 동작과 연동되는 광원을 제공할 수 있다. 발광 소자는, 예를 들어, LED, IR LED 및 제논 램프를 포함할 수 있다. 커넥터 홀(208, 209)은, 외부 전자 장치와 전력 및/또는 데이터를 송수신하기 위한 커넥터(예를 들어, USB 커넥 터)를 수용할 수 있는 제1 커넥터 홀, 및/또는 외부 전자 장치와 오디오 신호를 송수신하기 위한 커넥터를 수용할 수 있는 제2 커넥터 홀(예를 들어, 이어폰 잭)을 포함할 수 있다. 도 4는 본 개시의 일 실시예에 따른, 도 2에 도시된 전자 장치를 나타내는 분리 사시도로서 전면을 나타내 는 도면이다. 도 5는 본 개시의 일 실시예에 따른, 도 2에 도시된 전자 장치를 나타내는 분리 사시도로서 후면을 나타내는 도면이다. 도 4와 도 5를 참조하면, 전자 장치(예: 도 2 또는 도 3의 전자 장치)는, 측면 구조, 제1 지지 부재(예: 브라켓), 전면 플레이트(예: 도 2의 전면 플레이트), 디스플레이(예: 도 2의 디 스플레이), 인쇄 회로 기판(또는 기판 조립체), 배터리, 제2 지지 부재(예: 리어 케이스), 안테나, 카메라 조립체 및 후면 플레이트(예: 도 3의 후면 플레이트)를 포함할 수 있다. 일 실 시예에서는, 전자 장치는, 구성요소들 중 적어도 하나(예: 제1 지지 부재, 또는 제2 지지 부재(36 0))를 생략하거나 다른 구성요소를 추가적으로 포함할 수 있다. 전자 장치의 구성요소들 중 적어도 하나는, 도 2 또는 도 3의 전자 장치의 구성요소들 중 적어도 하나와 동일 또는 유사할 수 있으며, 중복되 는 설명은 이하 생략한다. 제1 지지 부재는, 전자 장치 내부에 배치되어 측면 구조와 연결될 수 있거나, 측면 구조와 일체로 형성될 수 있다. 제1 지지 부재는, 예를 들어, 금속 재질 및/또는 비금속 (예: 폴리머) 재질로 형 성될 수 있다. 적어도 부분적으로 금속 재질로 형성된 때, 측면 구조 또는 제1 지지 부재의 일부는 안테나로서 기능할 수 있다. 제1 지지 부재는, 일면에 디스플레이가 결합되고 타면에 인쇄 회로 기판 이 결합될 수 있다. 인쇄 회로 기판에는, 프로세서, 메모리, 및/또는 인터페이스가 장착될 수 있다. 프로세서는, 예를 들어, 중앙처리장치, 어플리케이션 프로세서, 그래픽 처리 장치, 이미지 시그널 프로세서, 센 서 허브 프로세서, 또는 커뮤니케이션 프로세서 중 하나 또는 그 이상을 포함할 수 있다. 일 실시예에 따르면, 제1 지지 부재와 측면 구조가 조합되어 전면 케이스(front case) 또는 하우징 으로 칭해질 수 있다. 한 실시예에 따르면, 하우징은 대체로 인쇄 회로 기판이나 배터리을 수용, 보호 또는 배치하기 위한 구조물로서 이해될 수 있다. 일 실시예에서, 하우징은 전자 장치의 외관에서 사용자가 시각적으로 또는 촉각적으로 인지할 수 있는 구조물, 예를 들면, 측면 구조, 전면 플레 이트 및/또는 후면 플레이트를 포함하는 것으로 이해될 수 있다. 일 실시예에서, '하우징의 전 면 또는 후면'이라 함은, 도 2의 제1 면(210A) 또는 도 3의 제2 면(210B)을 의미할 수 있다. 일 실시예에서, 제 1 지지 부재는 전면 플레이트(예: 도 2의 제1 면(210A))와 후면 플레이트(예: 도 3의 제2 면 (210B)) 사이에 배치되며, 인쇄 회로 기판 또는 카메라 조립체와 같은 전기/전자 부품을 배치하기 위 한 구조물로서 기능할 수 있다. 메모리는, 예를 들어, 휘발성 메모리 또는 비휘발성 메모리를 포함할 수 있다. 인터페이스는, 예를 들어, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이 스, SD카드 인터페이스, 및/또는 오디오 인터페이스를 포함할 수 있다. 인터페이스는, 예를 들어, 전자 장치 를 외부 전자 장치와 전기적 또는 물리적으로 연결시킬 수 있으며, USB 커넥터, SD 카드/MMC 커넥터, 또는 오디오 커넥터를 포함할 수 있다. 제2 지지 부재는, 예를 들어, 상측 지지 부재(360a)와 하측 지지 부재(360b)를 포함할 수 있다. 한 실시예 에서, 상측 지지 부재(360a)는 제1 지지 부재의 일부와 함께 인쇄 회로 기판을 감싸게 배치될 수 있 다. 집적회로 칩 형태로 구현된 회로 장치(예: 프로세서, 통신 모듈 또는 메모리)나 각종 전기/전자 부품이 인 쇄 회로 기판에 배치될 수 있으며, 실시예에 따라, 인쇄 회로 기판은 상측 지지 부재(360a)로부터 전 자기 차폐 환경을 제공받을 수 있다. 일 실시예에서, 하측 지지 부재(360b)는 스피커 모듈, 인터페이스(예: USB 커넥터, SD 카드/MMC 커넥터, 또는 오디오 커넥터)와 같은 전기/전자 부품을 배치할 수 있는 구조물로서 활용될 수 있다. 일 실시예에서는, 도시되지 않은 추가의 인쇄 회로 기판에 스피커 모듈, 인터페이스(예: USB 커넥터,SD 카드/MMC 커넥터, 또는 오디오 커넥터)와 같은 전기/전자 부품이 배치될 수 있다. 이 경우, 하측 지지 부재 (360b)는 제1 지지 부재의 다른 일부와 함께 추가의 인쇄 회로 기판을 감싸게 배치될 수 있다. 도시되지 않은 추가의 인쇄 회로 기판 또는 하측 지지 부재(360b)에 배치된 스피커 모듈이나 인터페이스는 도 2의 오디오 모듈 또는 커넥터 홀(208, 209)에 상응하게 배치될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성 요소에 전력을 공급하기 위한 장치로서, 예를 들면, 재충 전 불가능한 1차 전지, 또는 재충전 가능한 2차 전지, 또는 연료 전지를 포함할 수 있다. 배터리의 적어도 일부는, 예를 들어, 인쇄 회로 기판과 실질적으로 동일 평면 상에 배치될 수 있다. 배터리는 전자 장 치 내부에 일체로 배치될 수 있고, 전자 장치와 탈부착 가능하게 배치될 수도 있다. 도시되지는 않지만, 안테나는, 예를 들면, 레이저 다이렉트 스트럭처링(laser direct structuring) 공법을 통해 제2 지지 부재의 표면에 구현된 도전체 패턴을 포함할 수 있다. 일 실시예에서, 안테나는 박막 필름의 표 면에 형성된 인쇄 회로 패턴을 포함할 수 있으며, 박막 필름 형태의 안테나는 후면 플레이트와 배터리 사이에 배치될 수 있다. 안테나는, 예를 들어, NFC(near field communication) 안테나, 무선 충전 안테 나, 및/또는 MST(magnetic secure transmission) 안테나를 포함할 수 있다. 안테나는, 예를 들어, 외부 장치와 근거리 통신을 하거나, 충전에 필요한 전력을 무선으로 송수신 할 수 있다. 일 실시예에서는, 측면 구조 및/또는 상기 제1 지지 부재의 일부 또는 그 조합에 의하여 다른 안테나 구조가 형성될 수 있다. 카메라 조립체는 적어도 하나의 카메라 모듈, 예를 들어, 도 5의 카메라 모듈(371, 372, 373, 374)들 중 적어도 하나를 포함할 수 있다. 전자 장치의 내부에서 카메라 조립체는 광학 홀 또는 카메라 윈도우 (312, 313, 319)를 통해 입사된 빛의 적어도 일부를 수신할 수 있다. 일 실시예에서, 카메라 조립체는 인 쇄 회로 기판에 인접하는 위치에서, 제1 지지 부재에 배치될 수 있다. 한 실시예에서, 카메라 조립체 의 카메라 모듈(들)은 대체로 카메라 윈도우(312, 313, 319)들 중 어느 하나와 정렬될 수 있으며, 적어도 부분적으로 제2 지지 부재(예: 상측 지지 부재(360a))에 감싸질 수 있다. 카메라 조립체 또는 카메라 모듈(371, 372, 373, 374)을 배치함에 있어, 전자 장치 또는 제1 지지 부재는 적어도 하나의 지지 벽 또는 탄성 부재와 같은 구조물을 포함함으로써, 카메라 조립체를 장착 또는 고정시킬 수 있다. 이하의 상세한 설명에서는, 선행 실시예의 전자 장치(200, 300)가 참조될 수 있으며, 선행 실시예를 통해 용이 하게 이해될 수 있는 구성에 대해서는 도면의 참조번호를 동일하게 부여하거나 생략하고, 그 상세한 설명 또한 생략될 수 있음에 유의한다. 도 6은 본 개시의 일 실시예에 따른 전자 장치(예: 도 1 내지 도 5의 전자 장치(101, 200, 300))의 일부분 을, 도 3의 A-A'를 따라 절개하여 나타내는 단면도이다. 도 7은 본 개시의 일 실시예에 따른 전자 장치에 서, 카메라 모듈의 광학 경로를 예시하는 구성도이다. 도 3과 도 6을 참조하면, 본 개시의 일 실시예에 따른 전자 장치(예: 도 1 내지 도 5의 전자 장치(101, 200, 300))는, 일면(예: 도 3의 제2 면(210B))에 배치된 커버 플레이트를 포함할 수 있다. 일 실시예에서, 커버 플레이트는 후면 플레이트의 일부일 수 있다. 한 실시예에서, 커버 플레이트는 장식 부재 를 통해 후면 플레이트에 결합될 수 있으며, 외부에서 바라볼 때, 장식 부재는 커버 플레이트 의 둘레를 감싸는 형태로 노출될 수 있다. 한 실시예에 따르면, 커버 플레이트는 복수의 투명 영역을 제공할 수 있으며, 전자 장치는 투명 영역들 중 적어도 하나를 통해 외부의 빛을 수신하거나 외부로 빛을 방사할 수 있다. 예를 들어, 전자 장치는 투명 영역들 중 적어도 일부에 대응하게 배치된 적어도 하나의 카메라 모듈(예: 도 1 내지 도 3의 카메라 모듈(180, 205, 212, 213))과, 투명 영역들 중 다른 일부에 대 응하게 배치된 적어도 하나의 광원(예: 플래시 또는 적외선 광원)을 포함할 수 있다. 일 실시예에서, 카메라 모 듈 및/또는 광원은 외부의 빛을 수신하거나 전자 장치의 외부로 빛을 방사할 수 있다. 한 실시예에서, 전자 장치 및/또는 카메라 모듈은 카메라 지지 부재를 더 포함할 수 있다. 카메라 지지 부재는 카메라 모듈 및/또는 그에 인접하는 다른 카메라 모듈(예: 광각 카메라, 초광각 카메라 및/또는 접사 카메라) 중 적어도 하나를, 후면 플레이트 및/또는 커버 플레이트의 내측에 배치 또는 고정할 수 있다. 일 실시예에서, 카메라 지지 부재는 실질적으로 도 4의 제1 지지 부재 및/또는 제2 지지 부재의 일부일 수 있다. 일 실시예에 따르면, 전자 장치는 카메라 모듈 및/또는 수광 소자로서의 광각 카메라, 초광각 카메라, 접사 카메라, 망원 카메라 또는 적외선 포토 다이오드 중 적어도 하나를 포함할 수 있으며, 광원 및/또 는 발광 소자로서의 플래시(예: 도 3의 플래시)나 적외선 레이저 다이오드를 포함할 수 있다. 일 실시예에 서, 전자 장치는 적외선 레이저 다이오드와 적외선 포토 다이오드를 이용하여, 피사체를 향해 적외선 레이저를 방사하고, 피사체에 의해 반사된 적외선 레이저를 수신함으로써 피사체까지의 거리 및/또는 심도를 검출할 수 있다. 일 실시예에서, 전자 장치는 카메라들 중 어느 하나 또는 둘 이상을 조합하여 피사체를 촬영할 수 있으며, 필요에 따라 플래시를 이용하여 피사체를 향해 조명을 제공할 수 있다. 일 실시예에 따르면, 카메라들 중, 광각 카메라, 초광각 카메라 및/또는 접사 카메라는 망원 카메라(예: 카메라 모듈)와 대비할 때, 렌즈(들)의 광축 방향에서 더 작은 길이를 가질 수 있다. 예컨대, 화각이 상대적으로 작으면서 초점 거리가 상대적으로 큰 망원 카메라(예: 카메라 모듈)는 렌즈 전장이 다른 카메라(예: 광각 카메라, 초광각 카메라 및/또는 접사 카메라)보다 클 수 있다. '렌즈 전장'이라 함은, 물체측 첫번째 렌즈의 물 체측 면으로부터 이미지 센서의 결상면까지의 거리일 수 있다. 도 6의 카메라 모듈에서와 같이, 렌즈 (들)와 이미지 센서 사이에 다른 광학 부재(예: 미러 및/또는 프리즘)(들)이 배치된 경우, '렌즈 전장'은 물체 측 첫번째 렌즈의 물체측 면으로부터 이미지 센서측 첫번째 렌즈의 센서측 면까지의 거리일 수 있다. 한 실시예 에서, 광각 카메라, 초광각 카메라 및/또는 접사 카메라는 전자 장치의 두께(예: 도 2 내지 도 6의 Z축 방 향으로 측정되는 두께) 방향을 따라 렌즈(들)를 배열하더라도 실질적으로 전자 장치의 두께에 미치는 영향 이 작을 수 있다. 예컨대, 외부에서 전자 장치로 빛이 입사되는 방향과 렌즈(들)의 광축 방향이 실질적으 로 동일한 상태로 광각 카메라, 초광각 카메라 및/또는 접사 카메라가 전자 장치에 배치될 수 있다. 일 실 시예에서, 광각 카메라, 초광각 카메라 및/또는 접사 카메라와 비교할 때, 카메라 모듈(예: 망원 카메라) 은 작은 화각을 가지지만, 더 먼 거리의 피사체 촬영에 유용할 수 있다. 본 개시의 일 실시예에서, 카메라 모듈 은 입사된 광(IL)을 다른 방향으로 반사 및/또는 굴절시키는 적어도 하나의 광학 부재(R)를 포함할 수 있 다. 적어도 하나의 광학 부재(R)를 포함으로써, 카메라 모듈은 전자 장치의 두께가 증가하는 것을 억 제하면서 망원 기능을 용이하게 구현할 수 있다. 도 6과 도 7을 참조하면, 폴디드 카메라(예: 카메라 모듈)는 렌즈 어셈블리(예: 렌즈들(421a, 421b)), 적어도 하나의 광학 부재(R)(예: 굴절 부재 또는 반사 부재), 및/또는 이미지 센서를 포함할 수 있다. 일 실시예에서, 적어도 하나의 광학 부재(R)는 렌즈 어셈블리에 의해 집속 또는 안내된 빛(예: 입사 광(IL))을 적어도 1회 반사 또는 굴절시켜 이미지 센서로 안내할 수 있다. 일 실시예에서, 광학 부재(R)는, 예를 들면, 프리즘 및/또는 미러를 포함할 수 있다. 예를 들어, 광학 부재(R)는 적어도 하나의 미러 를 포함하는 프리즘으로 형성될 수 있다. 일 실시예에서, 광학 부재(R)는 제1 방향(D1)에서 입사된 광(IL)을 제 1 방향(D1)에 교차하는 제2 방향(D2)으로 반사 및/또는 굴절시킬 수 있다. 제1 방향(D1)이라 함은, 예를 들면, 피사체를 촬영할 때 전자 장치 및/또는 카메라 모듈로 외부에서 광(IL)이 입사되는 방향을 의미할 수 있다. 일 실시예에서, 제1 방향(D1)은, 촬영 방향, 피사체 방향, 카메라 모듈의 지향 방향 및/또는 그와 평행한 방향을 언급한 것일 수 있다. 일 실시예에서, 제1 방향(D1)은 전자 장치의 두께 방향 및/또는 Z축 방향에 평행할 수 있다. 일 실시예에 따르면, 광학 부재(R)의 내부에서 반사 또는 굴절되어 제2 방향(D2)으로 진행하는 광(RL1)은 광학 부재(R) 내부의 다른 영역에 의해 반사 및/또는 굴절되어 제2 방향(D2)에 교차하는 제3 방향(D3)으로 진행할 수 있다. 일 실시예에서, 제3 방향(D3)은 실질적으로 제2 방향(D2)에 수직할 수 있다. 예를 들어, 제3 방향(D3)은 Z축 방향과 평행한 방향을 의미할 수 있다. 하지만 본 개시의 실시예(들)가 이에 한정되지 않으며, 전자 장치 내에서 카메라 모듈 및/또는 광학 부재(R)의 배치와 그 사양에 따라 제3 방향(D3)은 제2 방향(D2) 및/또는 X-Y 평면에 대하여 경사진 방향일 수 있다. 일 실시예에서, 제3 방향(D3)은 제1 방향(D1)과 실질적으로 평행할 수 있다. 일 실시예에 따르면, 이미지 센서는 광학 부재(R)의 내부에서 적어도 1회 반사 및/또는 굴절된 후 제3 방 향(D3)을 따라 진행하는 광(RL2)을 검출하도록 설정될 수 있다. 예컨대, 외부에서 입사된 광(IL)은 광학 부재 (R)의 내부에서 적어도 1회(예: 도시된 실시예에서는 2회) 반사 또는 굴절된 후 이미지 센서에서 검출될 수 있으며, 전자 장치, 도 1의 프로세서 및/또는 카메라 모듈은 이미지 센서를 통해 검출 된 신호 및/또는 정보에 기반하여 피사체 이미지를 획득할 수 있다. 일 실시예에서, 이미지 센서는 실질적 으로 XY 평면에 평행한 상태로 배치될 수 있다. 예를 들어, 카메라 모듈이 이미지 센서를 쉬프트시키 는 구조의 손떨림 보정 기능을 가질 때, 이미지 센서는 제1 방향(D1) 및/또는 제3 방향(D3)에 실질적으로 수직인 평면에서 수평이동할 수 있다. 일 실시예에 따르면, 손떨림 보정 동작을 수행함에 있어, 이미지 센서는 전자 장치의 길이 방향(예: Y축 방향) 및/또는 폭 방향(예: X축 방향)으로 쉬프트될 수 있다. 예컨대, 이미지 센서는 제1 방향(D1) 및 /또는 제3 방향(D3)에 실질적으로 수직인 평면에 배치됨으로써, 두께가 작은(예: 대략 10mm 이내의 두께) 전자 장치에서, 이미지 센서의 크기를 확장하기 용이할 수 있고, 및/또는 손떨림 보정 동작을 위한 공간의 확보가 용이할 수 있다. 일 실시예에서, 카메라 모듈가 망원 카메라로서 활용될 때, 손떨림 보정 기능이 탑재 됨으로써 촬영 이미지의 품질이 더욱 고도화될 수 있다. 일 실시예에서, 이미지 센서가 대형화될 때, 카메 라 모듈의 성능이 더욱 높아질 수 있다. 일 실시예에 따르면, 렌즈 어셈블리는, 제1 방향(D1)에서 입사되는 광(IL)을 광학 부재(R)로 안내 및/또는 집속할 수 있다. 일 실시예에서, 렌즈 어셈블리 및/또는, 카메라 모듈에서 물체측에 배치된 첫 번째 렌즈(예: 제1 렌즈(421a))는 정의 굴절력을 가질 수 있다. 예를 들어, 제1 렌즈(421a)가 외부에서 입사되는 광 (IL)을 광학 부재(R)로 집속 및/또는 정렬하도록 구성됨으로써, 제1 렌즈(421a)로부터 이미지 센서에 이르 는 광학계가 소형화될 수 있다. 일 실시예에서, 렌즈 어셈블리는 외부에서 입사되는 광의 집속 및/또는 정 렬을 위해 추가의 렌즈(예: 제2 렌즈(421b)(들))를 더 포함할 수 있다. 일 실시예에 따르면, 제1 렌즈(421a) 및/또는 제2 렌즈(421b)(들) 중 적어도 하나는, 광이 입사되는 방향(예: 도 6의 제1 방향(D1))으로 진퇴운동할 수 있다. 예를 들어, 전자 장치 및/또는 카메라 모듈은 제1 렌 즈(421a) 및/또는 제2 렌즈(421b)(들) 중 적어도 하나를 진퇴운동시킴으로써, 초점 거리 조절 및/또는 초점 조 절을 수행할 수 있다. 일 실시예에서는, ‘RL2’로 지시된 광이 입사되는 방향(예: 도 6의 제3 방향(D3))을 따 라 이미지 센서가 진퇴운동함으로써 초점 거리 조절 및/또는 초점 조절을 수행할 수 있다. 일 실시예에 따르면, 전자 장치 및/또는 카메라 모듈은 적외선 차단 필터를 더 포함할 수 있다. 일 실시예에서, 적외선 차단 필터는 적외선 및/또는 근적외선 파장 대역의 빛이 이미지 센서로 입사 되는 것을 억제하거나 실질적으로 차단할 수 있으며, 제1 렌즈(421a)로부터 이미지 센서 사이의 광학 경로 에서 임의의 위치에 배치될 수 있다. 일 실시예에서, 적외선 차단 필터는 이미지 센서와 가까운 위치 (예: 이미지 센서와 광학 부재(R) 사이)에 배치됨으로써, 적외선 차단 필터가 외부에 시각적으로 노 출되는 것을 억제 및/또는 방지할 수 있다. 일 실시예에서, 광학 부재(R)가 적외선 차단 코팅층을 포함할 수 있 으며, 이 경우, 적외선 차단 필터는 생략될 수 있다. 이로써, 이미지 센서는 실질적으로 적외선 차단 필터(또는 적외선 차단 코팅층)을 투과한 광을 검출할 수 있다. 본 개시의 실시예(들)에 따른 광학 부재(R)는 카메라 모듈의 구조에 따라 선택적으로 설계될 수 있다. 예 를 들어, 일 실시예에서 광학 부재(R)는 삼각 기둥 형상일 수 있다. 일 실시예에서, 광학 부재(R)는 사다리꼴 기둥 형상일 수 있다. 광학 부재(R)의 형상은 본 개시에 도시된 구조에 한정되지 않는다. 예를 들어, 광학 부재 (R)가 광을 반사, 굴절 또는 투과시킨다면, 광학 부재(R)는 삼각 기둥 또는 사다리꼴 기둥 외 다른 구조(예: 평 행사변형 기둥 형상)를 가질 수 있다. 일 실시예에서, 광학 부재(R)의 종류는 다양하게 배치될 수 있다. 예를 들면 광학 부재(R)는 프리즘으로 배치될 수 있다. 예를 들면, 광학 부재(R)는 적어도 하나의 미러로 배치될 수 있다. 일 실시예에서, 광학 부재(R)는 실질적으로 투명한 재료를 포함할 수 있다. 예를 들면, 광학 부재(R)는 글라스를 이용하여 제작될 수 있다. 일 실시예에 따르면, 광학 부재(R)는 복수의 프리즘(또는 미러)이 결합되어 구현될 수 있다. 예를 들어, 삼각 기둥 형상의 프리즘 및/또는 사각 기둥 형상의 프리즘이 결합됨으로써, 평행사변형 기둥이나 사다리꼴 기둥 형 상의 광학 부재(R)가 구현될 수 있다. 이와 같이, 본 개시의 실시예(들)에 따른 광학 부재(R)를 구현함에 있어, 반사 부재, 프리즘 및/또는 미러와 같은 다양한 광학 요소가 선택적으로 조합될 수 있으며, 광학 요소의 형상이 나 광학 요소의 수가 도면에 예시된 실시예에 한정되지 않음에 유의한다. 일 실시예에서, 복수의 광학 요소가 조합되어 광학 부재(R)가 구현될 때, 차광 구조를 배치하기 용이할 수 있다. '차광 구조'라 함은, 예를 들면, 설계되지 않은 경로를 통해 광학 부재(R)로 입사된 광, 또는 광학 부재(R)의 내부에서 설계되지 않은 경로를 진 행하는 광이 이미지 센서에 도달하는 것을 억제, 완화 또는 차단하는 구조를 언급한 것일 수 있다. 광학 부재(R)의 구성에 관해서는 후술되는 실시예를 통해 더욱 용이하게 이해될 수 있을 것이다. 도 8은 본 개시의 일 실시예에 따른 카메라 모듈의 광학 부재(예: 도 6 또는 도 7의 광학 부재(R))를 나타 내는 도면이다. 도 9는 본 개시의 일 실시예에 따른, 도 8의 광학 부재 중 제1 반사 부재를 나타내는 사시도이다. 도 10은 본 개시의 일 실시예에 따른, 도 8의 광학 부재 중 제2 반사 부재를 나타내는 사시도이다. 앞서 언급한 바와 같이, 본 개시의 실시예(들)에 따른 광학 부재는 복수의 광학 요소(예: 제1 반사 부재 와 제2 반사 부재)가 결합되어 구현될 수 있으며, 도시된 실시예에서는 2개의 광학 요소가 결합되어 구현된 광학 부재가 개시될 수 있다. 일 실시예에서는, 도 8의 광학 부재 중, 제1 반사 부재(또는 제2 반사 부재)는 삼각 기둥 형상의 프리즘 1개와, 사각 기둥 형상의 프리즘 1개가 결합하여 구현된 것 일 수 있다. 도시된 실시예에서, 외부에서 입사되는 광(OL)은, 광학 부재의 내부에서 4회 반사된 후 광학 부재로부터 출사되는 것으로 예시되지만, 본 개시의 실시예가 이에 한정되지 않음에 유의한다. 예를 들어, 투과면(TS1, TS2)(들)과 반사면(RS1, RS2)이 이루는 각도에 따라 광학 부재의 내부에서의 반사 횟수나 광 경로는 도면에 예시된 것과 다를 수 있음에 유의한다. 도 8 내지 도 10을 더 참조하면, 광학 부재는, 서로 마주보게 배치된 복수의 반사 부재(601, 602)를 포함 할 수 있으며, 서로 마주보는 면에서 복수의 반사 부재(601, 602) 중 어느 하나는 복수의 반사 부재(601, 602) 중 다른 하나의 적어도 일부를 수용할 수 있다. 여기서, '일부를 수용한다'라 함은, 한 반사 부재의 제1 면의 일부분과, 제1 면에 접하면서 제1 면에 경사지게(또는 수직하게) 배치된 면의 일부분을 감싸는 배치 구조를 포 함하는 것으로 이해될 수 있다. 일 실시예에서, 복수의 반사 부재(601, 602) 중 제1 반사 부재는 복수의 반사 부재(601, 602) 중 제2 반사 부재를 향하는 면에 수용 홈을 포함할 수 있으며, 제2 반사 부재 의 일부분(예: 돌출부)이 수용 홈에 수용됨으로써, 제1 반사 부재에 대한 제2 반사 부재 의 정렬 방향(또는 정렬 위치)을 설정할 수 있다. 일 실시예에 따르면, 제1 반사 부재를 향하는 면에서 제2 반사 부재는 수용 홈에 상응하는 형상 의 돌출부를 포함할 수 있다. 일 실시예에서는, 제2 반사 부재를 향하는 면에서 제1 반사 부재 는 단차부(stepped portion)(들)를 포함할 수 있으며, 제2 반사 부재는 제1 반사 부재의 단차부에 의 해 구현된 낮은 영역(또는 깊은 영역)에 수용된 것으로 이해될 수 있다. 도시된 실시예에서는, 가이드 벽(611 a)의 상단 부분과 수용 홈의 바닥면 사이 높이 차이 또는 깊이의 차이에 의해 단차부가 구현된 것으로 이 해될 수 있다. 일 실시예에서는, 제2 반사 부재는 부분적으로 제1 반사 부재의 수용 홈에 수용 되되, 제2 반사 부재의 외측 표면(예: 제2 측면(SS2)(들))과 제1 반사 부재의 외측 표면(예: 제1 측 면(SS1)(들))은 실질적으로 연속된 곡면 또는 연속된 평면을 이루게 정렬될 수 있다. 도시된 실시예에서는 제1 반사 부재에 수용 홈이 형성된 것으로 예시되지만, 본 개시의 실시예(들)가 이에 한정되지 않음에 유의한다. 예를 들어, 제2 반사 부재에 홈 구조가 제공되고 제1 반사 부재에 돌출 구조가 제공될 수 있다. 도시된 실시예에서는, 외부 광(OL)이 제1 반사 부재로 입사되고, 제1 반사 부재와 제2 반사 부재를 순차적으로 진행한 광이 제2 반사 부재에서 출사되는 것으로 예시되지 만, 본 개시의 실시예(들)가 이에 한정되지 않음에 유의한다. 예를 들어, 외부 광(OL)은 제2 반사 부재로 입사될 수 있으며, 이 경우, 이미지 센서(예: 도 6의 이미지 센서)로 입사되는 광(DL)은 실질적으로 제1 반사 부재에서 출사될 수 있다. 일 실시예에 따르면, 제1 반사 부재는 제2 반사 부재를 향하는 제1 광학 면(OS1)을 포함할 수 있다. 일면(예: 제2 반사 부재를 향하는 면)에서 제1 반사 부재가 수용 홈을 포함할 때, 제1 광학 면 (OS1)은 수용 홈(또는 단차부)이 제공하는 영역의 적어도 일부분으로 이해될 수 있다. 예를 들어, 제1 반 사 부재가 수용 홈을 포함할 때, 제1 광학 면(OS1)은 수용 홈의 바닥면에 의해 구현된 것으로 이해될 수 있다. 일 실시예에 따르면, 수용 홈을 포함할 때, 제1 반사 부재는 수용 홈의 적어도 일측에 제공된 가이드 벽(611a)을 포함할 수 있다. 도시된 실시예에서, 제1 연장 방향(C1)을 따라 연장된 한 쌍의 가이드 벽 (611a)이 예시된다. 예를 들어, 한 쌍의 가이드 벽(611a)은 수용 홈을 사이에 두고 제1 연장 방향(C1)에 교차하는 방향(예: 제2 연장 방향(C2))을 따라 서로 마주보게 배치될 수 있다. 예를 들어, 돌출부가 수용 홈에 수용된 때, 제1 반사 부재에 대하여 제2 반사 부재(예: 돌출부)는 가이드 벽(611a)의 안내를 받으면서 제1 연장 방향(C1)으로 이동할 수 있지만, 제2 연장 방향(C2)으로 이동하는 것은 가이드 벽 (611a)에 의해 억제 또는 제한될 수 있다. 일 실시예에서, 제1 광학 면(OS1)은, 제1 반사 부재의 일면(예: 제2 반사 부재와 마주보는 면)중, 가이드 벽(611a)들 사이의 영역으로 이해될 수 있다. 후술되겠지만, 수용 홈 또는 돌출부의 구조는, 광학 부재를 경유하여 이미지 센서로 안내 되는 광 경로에서, 광을 투과, 반사 또는 굴절시키는 면들 사이의 거리를 지정된 범위 내에서 유지시킬 수 있다. 예를 들어, 수용 홈에 돌출부가 적어도 부분적으로 수용되고, 제2 연장 방향(C2)으로의 이동이 제한된 상태에서는, 제1 투과면(TS1)과 제2 투과면(TS2) 사이의 제1 거리(G1), 또는 제1 반사면(RS1)과 제2 반 사면(RS2) 사이의 제2 거리(G2)가 실질적으로 일정하게 유지될 수 있다. 일 실시예에서는, 앞서 언급된 제1 연 장 방향(C1)에서 제1 반사 부재와 제2 반사 부재가 서로에 대하여 이동하더라도, 반사 또는 굴절시키 는 면들 사이의 거리(G1, G2)는 실질적으로 변화되지 않을 수 있다. 일 실시예에서, 앞서 언급된 제2 연장 방향(C2)에서 제1 반사 부재와 제2 반사 부재가 서로에 대하여 이동할 때, 반사 또는 굴절시키는 면들 사 이의 거리(G1, G2)가 설계 사양과 달라질 수 있다. 예컨대, 본 개시의 실시예(들)에서, 반사 부재(601, 602)들 을 서로 결합시킴에 있어, 수용 홈 또는 돌출부의 구조는 광학적 성능이 왜곡되는 것을 억제하고 설 계 사양에 부합하는 광학 부재를 구현할 수 있다. 일 실시예에 따르면, 제1 반사 부재는, 광을 입사받거나 입사된 광을 반사하는 제1 투과면(TS1) 및/또는 제1 반사면(RS1)을 포함할 수 있다. 제1 투과면(TS1)은 제1 광학 면(OS1)에 대하여 경사지게 배치되며, 외부 광 (OL)이 광학 부재(예: 제1 반사 부재)로 입사되는 면을 언급한 것일 수 있다. 제1 반사면(RS1)은, 예 를 들어, 제1 광학 면(OS1) 및/또는 제1 투과면(TS1)에 대하여 경사진 면으로 이해될 수 있으며, 광학 부재 (예: 제1 반사 부재)의 내부에서 진행하는 광의 적어도 일부를 반사시킬 수 있다. 일 실시예에서, 광 학 부재(예: 제1 반사 부재)는 제1 반사면(RS1)에 배치된 반사 코팅 또는 미러를 포함할 수 있다. 일 실시예에 따르면, 도 8과 같은 측면도로 볼 때, 제1 광학 면(OS1), 제1 투과면(TS1) 및/또는 제1 반사면 (RS1)은 실질적으로 삼각형을 이루는 형상으로 배치될 수 있다. 예를 들어, 제1 광학 면(OS1), 제1 투과면(TS1) 및/또는 제1 반사면(RS1) 중 어느 한 면이 다른 두 면의 가장자리를 연결하는 것으로 이해될 수 있다. 다만, 도 시된 실시예에서는, 외부에서 입사되는 광(OL)이 이미지 센서에 이르는 경로에 영향을 미치지는 않는 부분 에서 일부가 제거되어 삼각형이 아닌 다른 다각형 형상으로 제1 반사 부재가 예시된 것임에 유의한다. 후 술되는 실시예에서, 제1 투과면(TS1) 및/또는 제1 반사면(RS1)은 '제1 표면'이라 언급될 수 있다. 후술되는 '제 2 표면'과 함께, 제1 표면은 이미지 센서로 안내되는 광을 투과, 반사 또는 굴절시키는 영역을 제공하는 면으로서 이해될 수 있다. 일 실시예에 따르면, 제1 반사 부재는, 제1 광학 면(OS1), 제1 투과면(TS1) 및/또는 제1 반사면(RS1)과 함 께, 외부 표면의 적어도 일부를 제공하는 제1 측면(SS1)(들)을 포함할 수 있다. 제1 측면(SS1)(들)은 예를 들면, 광학 부재의 내부에서 진행하는 광(예: 이미지 센서로 안내될 광 또는 제1 투과면(TS1)에 수직 하게 입사된 광)에 대하여 실질적으로 평행하게 배치될 수 있다. 광학 부재의 설계에 따라, 제1 측면 (SS1)(들)은 광학 부재의 내부에서 진행하는 광에 대하여 경사지게 배치될 수 있다. 일 실시예에서, 광학 부재의 내부에서의 광 진행 경로에 대하여 제1 측면(SS1)(들)이 경사지게 배치된 구조라 하더라도, 광학 부재의 내부에서는 광(예: 이미지 센서로 안내될 광 또는 제1 투과면(TS1)에 수직하게 입사된 광)이 제1 측면(SS1)(들)과는 실질적으로 교차하지 않을 수 있다. 도시되지는 않지만, 광이 투과하지 않는 영역, 광을 반사(또는 굴절)시키지 않는 영역, 및/또는 광과 교차하지 않는 영역의 적어도 일부에는 광을 투과시키지 않는 물질(이하, '차광 물질(light blocking material)')이 제공 될 수 있다. 예를 들어, 제1 투과면(TS1) 중 이미지 센서로 안내될 광이 투과하는 영역 외에는 광 반사 코 팅이나 광 흡수 코팅과 같은 차광층(또는 차광 부재)이 제공될 수 있다. 차광 물질은 예를 들면, 가이드 벽 (611a)이나 제1 측면(SS1)(들) 표면의 적어도 일부에 제공될 수 있다. 일 실시예에서, 차광층은, 인쇄, 도장, 코팅, 증착 도금에 의해 형성될 수 있으며, 차광 필름이나 차광 시트의 형태로 구현될 수 있다. 일 실시예에서, 제1 반사면(RS1) 또는 제1 광학 면(OS1) 중 이미지 센서로 안내될 광이 투과하는 영역 외에는 차광 부재가 제공될 수 있다. 이러한 차광 부재는 제2 반사 부재에도 유사하게 제공될 수 있으며, 도 11을 참조하여 다 시 살펴보게 될 것이다. 일 실시예에 따르면, 제2 반사 부재는 제1 반사 부재를 향하는 제2 광학 면(OS2)을 포함할 수 있다. 일면(예: 제1 반사 부재를 향하는 면)에서 제2 반사 부재가 돌출부를 포함할 때, 제2 광학 면 (OS2)은 실질적으로 돌출부의 표면에 제공된 것으로 이해될 수 있다. 예를 들어, 제2 반사 부재가 돌 출부를 포함할 때, 제2 광학 면(OS2)은 돌출부의 상단면 일부에 의해 구현된 것으로 이해될 수 있다. 일 실시예에서, 돌출부를 포함할 때, 제2 반사 부재 및/또는 돌출부는 제2 광학 면(OS2)의 가장 자리로부터 수직하게 또는 경사지게 연장된 복수의 측면(621a, 621b, 621c, 621d)을 포함할 수 있다. 일 실시예 에서, 복수의 측면(621a, 621b, 621c, 621d) 중 적어도 하나(예: 참조번호 '621b' 및/또는 '621d'로 지시된 측 면(들))는 제1 연장 방향(C1)에 나란하게 정렬되면서 제1 연장 방향(C1)에 교차하는 방향(예: 제2 연장 방향 (C2))에서 수용 홈의 내벽(예: 가이드 벽(611a)의 내측 면(611b))에 마주보게 배치될 수 있다. 예를 들어, 복수의 측면(621a, 621b, 621c, 621d) 중 일부는 제1 반사 부재와 제2 반사 부재가 제1 연장 방향 (C1)을 따라 서로에 대하여 이동하는 것을 허용 또는 안내할 수 있으며, 및/또는 제1 반사 부재와 제2 반 사 부재가 제2 연장 방향(C2)을 따라 서로에 대하여 이동하는 것을 억제할 수 있다. 예를 들어, 돌출부 와 수용 홈은 제1 반사 부재와 제2 반사 부재의 상대적인 위치를 설정함으로써, 제1 반사 부재와 제2 반사 부재를 결합함에 있어 설계 사양에 부합하는 광학 부재를 구현하는데 기여할수 있다. 일 실시예에 따르면, 복수의 측면(621a, 621b, 621c, 621d) 중 적어도 다른 하나(예: 참조번호 '621a' 및/또는 '621c'로 지시된 측면(들))는 제1 연장 방향(C1)을 지향하면서 수용 홈의 외부 공간으로 노출될 수 있다. 예를 들어, 돌출부는 참조번호 '621b' 및/또는 '621d'로 지시된 측면(들)(또는 가이드 벽(611a)의 내측 면 (611b)(들))의 안내를 받으면서 실질적으로 제1 방향(D1)을 따라 수용 홈으로 진입할 수 있다. 하지만 본 개시의 실시예(들)이 이에 한정되지 않으며, 제1 반사 부재와 제2 반사 부재가 가까워지거나 멀어지 는 방향(예: 도 8의 제2 반사광(RL2)이 진행하는 방향 또는 그 역방향)을 따라 돌출부가 수용 홈에 진입할 수 있다. 일 실시예에서, 복수의 측면(621a, 621b, 621c, 621d) 중 수용 홈의 외부 공간으로 노출 된 측면(예: 참조번호 '621a' 및/또는 '621c'로 지시된 측면(들))은 제1 반사 부재의 표면 중 적어도 일부 (예: 제1 측면(SS1)(들))와 연속된 곡면 또는 연속된 평면에 배치될 수 있다. 일 실시예에 따르면, 광학 부재는 제1 반사 부재와 제2 반사 부재 사이의 경계에 제공된 더미 홈(들)을 더 포함할 수 있다. 일 실시예에서는, 돌출부의 측면(621a, 621b, 621c, 621d)들 중 수용 홈의 외부 공간으로 노출된 측면과 제1 반사 부재의 표면 사이의 경계에는 더미 홈이 제공될 수 있다. 일 실시예에서, 광학 부재 및/또는 카메라 모듈은 더미 홈에 충진된 접착제(예: 도 12의 접착제(799a))를 더 포함할 수 있다. 예를 들어, 접착제(799a)는 제1 반사 부재와 제2 반사 부재를 접합시킴으로써, 광학 부재의 기계적인 안정성을 높일 수 있다. 이와 같이, 더미 홈 및/또는 접착제 (799a)는, 광학 부재의 외관에서 보여지는 경계(예: 제1 반사 부재와 제2 반사 부재 사이의 경 계) 중 임의의 부분에 제공될 수 있다. 일 실시예에서는, 돌출부의 측면(621a, 621b, 621c, 621d)(들)에 대하여 경사진 표면과, 제1 반사 부재의 한 표면에 대하여 경사진 표면이 서로 조합되어 더미 홈을 구현할 수 있다. 일 실시예에 따르면, 돌출부와 수용 홈은 실질적으로, 제1 반사 부재가 제2 반사 부재에 대하여 제1 연장 방향(C1)을 따라 이동하는 것을 허용하되, 제2 연장 방향(C2)에서는 제2 반사 부재에 구 속시킬 수 있다. 본 개시의 실시예(들)를 설명함에 있어, \"제1 연장 방향(C1)을 따라 이동하는 것을 허용한다\" 라 함은 조립 공정을 언급한 것일 수 있으며, 카메라 모듈(예: 도 6 또는 도 7의 카메라 모듈)의 내부에서 제1 반사 부재와 제2 반사 부재는 제1 연장 방향(C1)에서 서로 구속될 수 있음에 유의한다. 본 개시 의 실시예(들)를 설명함에 있어, \"제2 연장 방향(C2)에서는 서로에게 구속된다\"라 함은, 제2 연장 방향(C2)에서 제1 반사 부재와 제2 반사 부재가 서로에 대하여 실질적으로 고정된 상태를 언급한 것일 수 있다. 일 실시예에 따르면, 제2 반사 부재는, 그의 내부에서 진행하는 광을 반사하거나 외부로 출사시키는 제2 반사면(RS2) 및/또는 제2 투과면(TS2)을 포함할 수 있다. 제2 투과면(TS2)은 제2 광학 면(OS2)에 대하여 경사지 게 배치되며, 이미지 센서로 제공될 광을 투과시키는 면을 언급한 것일 수 있다. 외부 광(OL)이 제1 반사 부재를 경유하여 제2 반사 부재로 입사되는 구조에서, 제2 광학 면(OS2)는 제2 반사 부재의 입 사면으로 이해될 수 있다. 제2 반사면(RS2)은, 예를 들어, 제2 광학 면(OS2) 및/또는 제2 투과면(TS2)에 대하여 경사진 면으로 이해될 수 있으며, 광학 부재(예: 제2 반사 부재)의 내부에서 진행하는 광의 적어도 일부를 반사시킬 수 있다. 일 실시예에서, 광학 부재(예: 제2 반사 부재)는 제2 반사면(RS2)에 배치 된 반사 코팅 또는 미러를 포함할 수 있다. 일 실시예에 따르면, 도 8의 측면도로 볼 때, 제2 광학 면(OS2), 제2 투과면(TS2) 및/또는 제2 반사면(RS2)은 실질적으로 삼각형을 이루는 형상으로 배치될 수 있다. 예를 들어, 제2 광학 면(OS2), 제2 투과면(TS2) 및/또는 제2 반사면(RS2) 중 어느 한 면이 다른 두 면의 가장자리를 연결하는 것으로 이해될 수 있다. 다만, 도시된 실 시예에서는, 외부에서 입사되는 광(OL)이 이미지 센서에 이르는 경로에 영향을 미치지는 않는 부분에서 일 부가 제거되어 삼각형이 아닌 다른 다각형 형상으로 제2 반사 부재가 예시된 것임에 유의한다. 후술되는 실시예에서, 제2 투과면(TS2) 및/또는 제2 반사면(RS2)은 '제2 표면'이라 언급될 수 있다. 일 실시예에 따르면, 제2 반사 부재는, 제2 광학 면(OS), 제2 투과면(TS2) 및/또는 제2 반사면(RS2)과 함 께, 외부 표면의 적어도 일부를 제공하는 제2 측면(SS2)(들)을 포함할 수 있다. 제2 측면(SS2)(들)은 예를 들면, 광학 부재의 내부에서 진행하는 광에 대하여 실질적으로 평행하게 배치될 수 있다. 광학 부재 의 설계에 따라, 제2 측면(SS2)(들)은 광학 부재의 내부에서 진행하는 광에 대하여 경사지게 배치될 수 있 다. 일 실시예에서, 광학 부재의 내부에서의 광 진행 경로에 대하여 제2 측면(SS2)(들)이 경사지게 배치된 구조라 하더라도, 광학 부재의 내부에서는 광이 제2 측면(SS2)(들)과 교차하지 않을 수 있다. 도시되지는 않지만, 광이 투과하지 않는 영역, 광을 반사(또는 굴절)시키지 않는 영역, 및/또는 광과 교차하지 않는 영역의 적어도 일부에는 광을 투과시키지 않는 물질(이하, '차광 물질(light blocking material)')이 제공 될 수 있다. 예를 들어, 제2 투과면(TS2) 중 이미지 센서로 안내될 광이 투과하는 영역 외에는 광 반사 코 팅이나 광 흡수 코팅과 같은 차광층이 제공될 수 있다. 차광 물질은 예를 들면, 돌출부의 측면(621a, 621b, 621c, 621d)의 적어도 일부에 제공될 수 있다. 일 실시예에서, 차광층은, 인쇄, 도장, 코팅, 증착 도금에 의해 형성될 수 있으며, 차광 필름이나 차광 시트의 형태로 구현될 수 있다. 일 실시예에서, 제2 반사면(RS2) 또는 제2 광학 면(OS2) 중 이미지 센서로 안내될 광이 투과하는 영역 외에는 차광 부재가 제공될 수 있다. 일 실시예에 따르면, 제1 반사 부재와 제2 반사 부재가 서로 결합된 상태에서, 제2 연장 방향(C2)을 따라 이동하지 못하게 서로 구속될 수 있다. 예를 들어, 수용 홈은, 제1 광학 면(OS2) 또는 제2 광학 면 (OS2)에 평행한 평면에서, 돌출부가 제1 연장 방향(C1)으로 이동하는 것을 허용하되, 제1 연장 방향(C1)에 교차하는 방향으로 이동하는 것을 제한하도록 구성될 수 있다. 일 실시예에서는, 카메라 모듈 내에서 제1 반사 부재와 제2 반사 부재는 제1 연장 방향(C1)을 따라 이동하지 못하게 서로 구속될 수 있다. 일 실시예에서는, 제1 연장 방향(C1)을 따라 돌출부가 수용 홈에 진입하여 지정된 위치에 정렬된 상태에 서, 접착제(예: 도 12의 접착제(799a))에 의해 서로 접합됨으로써 제1 반사 부재와 제2 반사 부재는 제1 연장 방향(C1) 및/또는 제2 연장 방향(C2)을 따라 서로 이동하지 못하게 서로 구속될 수 있다. 일 실시예에 따르면, 제1 연장 방향(C1)에서 제1 반사 부재와 제2 반사 부재 사이에 상대적인 변위가 발생되더라도, 광학 부재는 설계 사양에 부합하는 광학적 성능을 제공할 수 있다. 예를 들어, 카메라 모듈 의 내부에 광학 부재가 배치된 상태에서, 제1 연장 방향(C1)에서 제1 반사 부재와 제2 반사 부 재 사이의 상대적인 변위는 광학 부재의 광학적 성능에 영향을 미치지 않을 수 있다. 여기서 \"상대적 인 변위가 광학적 성능에 영향을 미치지 않는다\"라 함은, 예를 들어, 제1 연장 방향(C1)에서 제1 반사 부재 와 제2 반사 부재 사이에 상대적인 변위가 발생되더라도 광학 부재를 통해 이미지 센서로 안내되는 광의 진행 경로는 변경 또는 왜곡되지 않는 것을 언급한 것일 수 있다. 일 실시예에 따르면, 수용 홈 및/또는 돌출부는, 제2 연장 방향(C2)에서 제1 반사 부재와 제2 반사 부재 사이의 상대적인 변위를 제한함으로써, 제1 표면(TS1, RS1)과 제2 표면(TS2, RS2) 사이의 상대 적인 거리가 지정된 범위 내에서 유지될 수 있다. 예를 들어, 제1 반사 부재와 제2 반사 부재를 결합 함에 있어, 제1 투과면(TS1)과 제2 투과면(TS2) 사이의 제1 거리(G1) 및/또는 제1 반사면(RS1)과 제2 반사면 (RS2) 사이의 제2 거리(G2)는 실질적으로 설계 사양을 만족할 수 있다. 수용 홈이나 돌출부 없이 제1 광학 면(OS1)과 제2 광학 면(OS2)을 마주보게 결합할 때, 제2 연장 방향(C2)에서 제1 반사 부재와 제2 반 사 부재의 위치가 설계 사양에 부합하지 못할 수 있다. 이 경우, 제2 반사광(RL2)의 경로가 설계 사양에서 벗어나게 왜곡될 수 있다. 본 개시의 실시예(들)는 수용 홈과 돌출부를 이용한 정렬 구조를 제공함으 로써, 제1 반사 부재와 제2 반사 부재를 결합하되 설계 사양에 부합하는 광 경로를 구현할 수 있다. 일 실시예에 따르면, 외부 광(OL)이 광학 부재를 경유하여 이미지 센서에 이르는 경로에서, 적어도 1 회 반사 또는 굴절됨에 따라 미광 현상 또는 플레어 현상이 증가될 수 있다. 본 개시의 실시예(들)에 따른 광학 부재는, 복수의 반사 부재(601, 602)를 결합함으로써 차광 구조의 배치가 용이할 수 있다. 일 실시예에서, 의도되지 않은 방향에서 광학 부재로 입사되는 광 또는 설계되지 않은 경로에서 광학 부재의 내부를 진행하는 광을 차광 구조가 실질적으로 차단함으로써 미광 현상 또는 플레어 현상을 억제할 수 있다. 일 실시예에 따르면, 제1 표면(TS1, RS1)의 하나인 제1 투과면(TS1)은 제2 표면(TS2, RS2)의 하나인 제2 투과면 (TS2)에 대하여 광학 면(OS1, OS2)들을 사이에 두고 적어도 부분적으로 반대 방향을 지향하도록 배치될 수 있다. 일 실시예에서, 제1 표면(TS1, RS1)의 하나인 제1 반사면(RS1)은 제2 표면(TS2, RS2)의 하나인 제2 반사 면(RS2)에 대하여 광학 면(OS1, OS2)들을 사이에 두고 적어도 부분적으로 반대 방향을 지향하도록 배치될 수 있 다. 여기서, \"적어도 부분적으로 반대 방향을 지향한다\"라 함은, 동일한 좌표계를 기준으로 할 때, 또는 제1 광 학 면(OS1)(또는 제2 광학 면(OS2))을 기준으로할 때, 제1 표면(TS1, RS1)의 지향 방향 벡터 성분과 제2 표면 (TS2, RS2)의 지향 방향 벡터 성분이 적어도 부분적으로 반대 방향을 향하는 것을 언급한 것일 수 있다. 제1 투 과면(TS1)과 제2 투과면(TS2)을 예로 들 때, 제1 광학 면(OS1)을 기준으로 수평 방향 벡터 성분이 서로 반대 방 향을 지향할 수 있으며, 수직 방향 벡터 성분이 서로 반대 방향을 지향할 수 있다. 일 실시예에서, 제1 반사면 (RS1)과 제2 반사면(RS2)이 제1 광학 면(OS1)에 수직하게 정렬된 것을 예로 들면, 제1 반사면(RS1)과 제2 반사 면(RS2)의 지향 방향은 제1 광학 면(OS1)에 평행한 방향의 벡터 성분만 가지면서 제1 반사면(RS1)과 제2 반사면 (RS2)이 서로 반대 방향을 지향하는 것으로 이해될 수 있다. 여기서, \"제1 반사면(RS1)과 제2 반사면(RS2)이 제 1 광학 면(OS1)에 수직하게 정렬된다\"라 함은, 반사면(RS1, RS2)들의 지향 방향을 설명하기 위해 예시적으로 언급된 것으로서 본 개시의 실시예(들)가 이에 한정되지 않음에 유의한다. 일 실시예에서, 제1 투과면(TS1)과 제2 투과면(TS2) 중 어느 하나를 통해 외부의 광(OL)이 광학 부재의 내 부로 입사되고, 제1 투과면(TS1)과 제2 투과면(TS2) 중 다른 하나는 이미지 센서와 실질적으로 마주보게 배치될 수 있다. 도시된 실시예에서는, 제1 투과면(TS1)을 통해 외부 광(OL)이 광학 부재로 입사되고, 제2 투과면(TS2)을 투과한 광(DL)이 이미지 센서로 안내될 수 있다. 도 6 또는 도 7을 참조하여 살펴본 바와 같이, 카메라 모듈은, 적어도 하나의 렌즈에 의해 집속 또는 안내된 광이 광학 부재(예: 도 6 또는 도 7의 광학 부재(R))를 경유하여 이미지 센서로 안내될 수 있다. 도시되지 않은 실시예에서는, 도 6 과 도 7의 렌즈(들)가 생략되거나, 광학 부재와 이미지 센서 사이에 배치된 추가의 렌즈(들)를 더 포함하는 카메라 모듈이 구현될 수 있다. 일 실시예에서는, 도 6과 도 7의 렌즈(들)는, 도시되지 않은 추가의 프리즘을 통해 안내된 광을 집속하여 광학 부재로 제공할 수 있다. 예컨대, 상술한 광학 부재(R, 600)를 포함하는 카메라 모듈에서, 추가의 프리즘(들) 및/또는 렌즈(들)가 제공될 수 있으며, 도시된 실시 예의 카메라 모듈이 본 개시를 한정하지 않음에 유의한다. 일 실시예에 따르면, 외부 광(OL)은 제1 투과면(TS1)을 투과하여 광학 부재(예: 제1 반사 부재)로 입 사될 수 있다. 제1 반사 부재의 내부로 입사된 광은 적어도 1회 반사된 후 제1 광학 면(OS1)을 통해 제1 반사 부재의 외부로 출사될 수 있다. 예를 들어, 외부 광(OL)은 제1 광학 부재의 내부에서 적어도 제 1 반사면(RS1)에 의해 반사되어 제1 투과면(TS1)을 향하는 방향으로 진행(예: 제1 반사광(RL1))할 수 있다. 일 실시예에서, 제1 반사광(RL1)은 제1 반사 부재의 내부에서 제1 투과면(TS1)에 의해 다시 반사되어 제1 광 학 면(OS1)과 제2 광학 면(OS2)을 순차적으로 투과하여 제2 반사 부재로 입사(예: 제2 반사광(RL2))될 수 있다. 일 실시예에서, 제1 반사 부재는, 제1 투과면(TS1)에 수직한 방향을 따라 제1 투과면(TS1)으로 입사 된 광을 제1 광학 면(OS1) 및/또는 제2 광학 면(OS2)에 수직한 방향으로 출사시키도록 구성될 수 있다. 예를 들 어, 외부 광(OL)이 제1 투과면(TS1)에 수직하게 입사한 때, 제2 반사광(RL2)은 실질적으로 제1 광학 면(OS1) 및 /또는 제2 광학 면(OS2)을 수직하게 투과할 수 있다. 이러한 광학 부재의 구성은, 서로 다른 가시광 굴절 률을 가진 매질 사이의 경계면(예: 투과면(TS1, TS2)(들) 및/또는 광학 면(OS1, OS2))에서 광의 반사, 굴절 및/ 또는 산란을 억제할 수 있다. 예를 들어, 카메라 모듈은 상기와 같은 광학 부재를 포함하면서도 미광 이나 플레어의 증가를 억제할 수 있다. 일 실시예에 따르면, 제2 반사광(RL2)은 제2 광학 면(OS2)을 통해 제2 반사 부재로 입사되어 적어도 1회 반사된 후 이미지 센서를 향해 제2 반사 부재로부터 출사될 수 있다. 일 실시예에서, 제2 반사광 (RL2)은 제2 반사 부재의 내부에서 제2 투과면(TS2)에 의해 1회 반사된 후 제2 반사면(RS2)을 향해 진행 (예: 제3 반사광(RL3))할 수 있다. 제3 반사광(RL3)은 예를 들면, 제2 반사 부재의 내부에서 제2 반사면 (RS2)에 의해 반사된 후 제2 투과면(TS2)을 투과하여 이미지 센서로 제공(예: 제4 반사광 또는 검출광 (DL))될 수 있다. 일 실시예에서, 제1 반사면(RS1) 또는 제2 반사면(RS2)에는 높은 반사율을 가진 반사층 또는 반사 코팅이 제공될 수 있으며, 광학 부재의 내부에서 제1 반사광(RL1)(또는 제2 반사광(RL2))은 전반사 조건을 만족하는 각도로 제1 투과면(TS1)(또는 제2 투과면(TS2))으로 입사될 수 있다. 도 11은 본 개시의 일 실시예에 따른 카메라 모듈(예: 도 6 또는 도 7의 카메라 모듈)의 광학 부재(예: 도 6 내지 도 8의 광학 부재(R, 600)) 중 제2 반사 부재(602a)(예: 도 10의 제2 반사 부재)를 나타내는 사시 도이다. 도 11은, 예를 들어, 상술한 차광 구조가 제공된 구성을 예시한 것으로서, 차광 구조는 인쇄층, 코팅 층, 증착층, 도금층, 차광 필름 및/또는 차광 시트에 의해 구현될 수 있다. 차광 구조는, 예를 들어, 제1 광학 면(OS1) 및/또는 제2 광학 면(OS2)에서 가장자리의 적어도 일부에 제공될 수 있다. 예컨대, 상술한 제1 광 학 면(OS1) 및/또는 제2 광학 면(OS2)은 이미지 센서로 안내될 광이 투과하는 영역으로서, 제1 반사 부재 나 제2 반사 부재(602, 602a) 상에서 광 경로를 제공하는 영역이 결정된 때 나머지 영역에 차광 구조(62 9)가 제공될 수 있다. 일 실시예에서, 수용 홈의 적어도 일부를 둘러싸는 가이드 벽(611a)은 실질적으로 광 경로를 제공하는 영역이 아닌 영역에서 제공될 수 있다. 예를 들어, 이미지 센서로 안내될 광은 수용 홈의 바닥면 중 일부분 또는 돌출부의 상단면 중 일부를 투과할 수 있다. 앞서 언급한 바와 같이, 이 러한 차광 구조는 제1 측면(SS1)(들), 제2 측면(SS2)(들), 및/또는 돌출부의 측면(621a, 621b, 621c, 621d)들에 더 제공될 수 있다. 일 실시예에서는, 투과면(TS1, TS2)들의 가장자리 및/또는 반사면(RS1, RS2)들의 가장자리 적어도 일부에 추가의 차광 구조가 제공될 수 있다. 일 실시예에 따르면, 차광 구조가 지정된 두께를 가진 층, 필름 및/또는 시트로 구현될 때, 제1 광학 면 (OS1)과 제2 광학 면(OS2) 사이에는 차광 구조의 두께에 상응하는 간격이 형성될 수 있다. 일 실시예에서 는, 제1 광학 면(OS1) 및/또는 제2 광학 면(OS2)에서 가장자리의 일부는 차광 구조의 두께에 상응하는 홈 (recess)을 포함할 수 있다. 예를 들어, 제2 광학 면(OS2)의 홈에 차광 구조가 배치된 때, 차광 구조(62 9)의 표면은 제2 광학 면(OS2)과 연속된 평면 또는 연속된 곡면을 이루게 배치될 수 있다. 이 경우, 제1 광학 면(OS1)과 제2 광학 면(OS2)은 실질적으로 접촉하게 배치될 수 있다. 도 12는 본 개시의 일 실시예에 따른 카메라 모듈(예: 도 6 또는 도 7의 카메라 모듈)의 광학 부재 (예: 도 6 내지 도 8의 광학 부재(R, 600))를 나타내는 도면이다. 도 12를 참조하면, 광학 부재는, 제1 반사 부재에 제공된 제1 가이드 벽(711b)과, 제2 반사 부재 에 제공된 제2 가이드 벽(721b)을 포함할 수 있다. 제1 가이드 벽(711b)은, 예를 들어, 제1 연장 방향(C 1)을 따라 연장되며 제2 연장 방향(C2)에서 제2 반사 부재의 한 측면과 마주보게 배치될 수 있다. 일 실시 예에서, 제2 가이드 벽(721b)은 제1 연장 방향(C1)을 따라 연장되며 제2 연장 방향(C2)에서 제1 반사 부재(70 1)의 한 측면과 마주보게 배치될 수 있다. 일 실시예에서, 제2 가이드 벽(721b)은 제2 연장 방향(C2)에서 제1 가이드 벽(711b)과 마주보는 방향으로 정렬될 수 있다. 예를 들어, 제1 가이드 벽(701b)과 제2 가이드 벽(721 b)은, 제1 반사 부재가 제2 반사 부재에 대하여 제2 연장 방향(C2) 중 양(positive)의 방향으로 이동 하는 것을 제한하고, 및/또는 제2 반사 부재가 제1 반사 부재에 대하여 제2 연장 방향(C2) 중 음 (negative)의 방향으로 이동하는 것을 제한할 수 있다. 일 실시예에 따르면, 광학 면(OS1, OS2)들이 서로 마주본 상태로 제1 반사 부재와 제2 반사 부재가 서로 결합된 때, 제1 가이드 벽(711b)이 제2 반사 부재의 한 측면에 밀착되고, 제2 가이드 벽(721b)이 제1 반사 부재의 한 측면에 밀착될 수 있다. 광학 부재의 외관에서 볼 때, 제1 반사 부재와 제2 반 사 부재 사이의 경계에는 경사면(713, 723)들(또는 곡면들)의 조합에 의해 더미 홈(예: 도 8의 더미 홈이 형성되고, 더미 홈의 적어도 일부에 접착제(799a)가 충진될 수 있다. 제1 반사 부재의 제1 경사면(또는 곡면)은 제1 반사 부재의 다른 표면에 대하여 경사지게 또는 곡면 형태로 배치되며, 제2 반사 부재의 제2 경사면은 제2 반사 부재 표면의 다른 부분(예: 제2 투과면(TS2))에 대하여 경 사지게 배치될 수 있다. 예를 들어, 제1 반사 부재와 제2 반사 부재가 결합된 때, 제1 경사면과 제2 경사면이 서로 인접하게 배치되며, 제1 경사면과 제2 경사면의 상대적인 경사각에 의해 더 미 홈을 구현할 수 있다. 일 실시예에서, 경사면(713, 723)들은 반사 부재(701, 702)들의 표면 중에서 광 학 면(OS1, OS2)을 제공하는 면에 대하여 경사지게 배치된 것으로 이해될 수 있다. 일 실시예에 따르면, 광학 부재(또는 도 6의 카메라 모듈)은 더미 홈의 적어도 일부에 충진된 접착제(799a)를 더 포함할 수 있다. 더미 홈에 충진된 접착제(799a)는, 예를 들어, 제1 반사 부재가 제2 반사 부재에 대하여 제2 연장 방향(C2) 중 음의 방향으로 이동하는 것을 제한하고, 및/또는, 제2 반사 부재가 제1 반사 부재에 대하여 제2 연장 방향(C2) 중 양의 방향으로 이동하는 것을 제한할 수 있다. 일 실시예에서, 더미 홈은 제1 반사 부재의 제1 측면(예: 도 9의 제1 측면(SS1))과 제2 반사 부재 의 제2 측면(예: 도 10의 제2 측면(SS2)) 사이의 경계에 더 제공될 수 있다. 예를 들어, 접착 구조는 광학 부재의 외부 표면에서 제1 반사 부재와 제2 반사 부재의 경계 중 적어도 일부에 제공될 수 있다. 도 13은 본 개시의 일 실시예에 따른 카메라 모듈(예: 도 6 또는 도 7의 카메라 모듈)의 광학 부재 (예: 도 6 내지 도 8의 광학 부재(R, 600))를 나타내는 도면이다. 상술한 실시예에서, 광학 부재(600, 700)는 2개의 반사 부재(601, 602, 701, 702)가 결합되어 구현된 것으로 예 시되고 있다. 하지만, 본 개시의 실시예(들)는 상술한 실시예에 한정되지 않고, 도 13에 예시된 바와 같이, 3개 이상의 반사 부재(801, 802, 803)가 조합되어 하나의 광학 부재를 구현할 수 있다. 3개 이상의 반사 부재 (801, 802, 803) 중, 서로 마주보게 결합되는 두 반사 부재 사이에는 상술한 수용 홈(예: 도 9의 수용 홈 )(및/또는 돌출부(예: 도 10의 돌출부))의 구조, 차광 구조(예: 도 11의 차광 구조) 및/또는 접 착 구조(예: 도 12의 접착제(799a))가 제공될 수 있으며, 이에 관한 상세한 설명은 생략하기로 한다. 도 13에 예시된 바와 같이, 아울러, 상술한 실시예에서와 같이, 복수의 반사 부재(801, 802, 803)를 포함하는 광학 부재에서, 반사 부재(801, 802, 803)들은 다각형 기둥 형상일 수 있다. 일 실시예에서, 다양한 형상 을 가진 반사 부재(801, 802, 803)들을 조합함으로써, 삼각형 기둥 형상이나 사각형(예: 직사각형, 정사각형, 평행사변형 및/또는 사다리꼴) 기둥 형상과 같은 다각형 기둥 형상의 광학 부재가 구현될 수 있다. 예를 들어, 본 개시의 실시예(들)는, 반사 부재(801, 802, 803)(들) 및/또는 광학 부재(600, 700, 800)의 형상이 상술한 실시예에 한정되지 않음에 유의한다. 일 실시예에 따르면, 광학 부재는 외부 광이 입사되는 제1 투과면(TS1)과, 이미지 센서(예: 도 6 또는 도 7의 이미지 센서)와 마주보게 배치되는 제2 투과면(TS2)을 포함할 수 있다. 광학 부재가 사다리꼴 기 둥 형상일 때, 제1 투과면(TS1)과 제2 투과면(TS2)은 실질적으로 하나의 평면에 배치된 것으로 이해될 수 있다. 일 실시예에서, 광학 부재가 평행사변형 기둥 형상 또는 사다리꼴 기둥 형상일 때, 제1 투과면(TS1)으로부 터 제2 투과면(TS2)에 이르는 광 경로에서 광이 반사되는 횟수는 다양하게 구현될 수 있다. 예를 들어, 투과면 (TS1, TS2)(들)과 반사면(RS1, RSn)(들)의 상대적인 배치 각도에 따라, 제1 투과면(TS1)을 통해 사다리꼴 기둥 형상의 광학 부재으로 입사된 광은 광학 부재의 내부에서 적어도 2회 반사된 후 제2 투과면(TS2)을 통해 이미지 센서로 제공될 수 있다. 일 실시예에서, 제1 투과면(TS1)에 수직하게 광학 부재로 입사 된 광은, 제1 반사 부재와 제2 반사 부재 사이 및/또는 제2 반사 부재와 제3 반사 부재 사 이에서 광학 면(예: 도 8 내지 도 10의 광학 면(OS1, OS2))들에 수직하게 진행할 수 있다. 도 14는 본 개시의 일 실시예에 따른 카메라 모듈(예: 도 6 또는 도 7의 카메라 모듈)을 나타내는 제 1 사시도이다. 도 15는 본 개시의 일 실시예에 따른 카메라 모듈을 나타내는 제2 사시도이다. 도면의 간결함을 위해, 도 14에서는 도 15의 일부 구성이 생략되고, 도 15에서는 도 14의 일부 구성이 생략되어 도시된다. 도 14와 도 15를 참조하면, 카메라 모듈은, 렌즈(들)(예: 도 6 또는 도 7의 렌즈 어셈블리), 광 학 부재(예: 도 6 내지 도 8의 광학 부재(R, 600)) 및/또는 이미지 센서(예: 도 6 또는 도 7의 이미 지 센서)를 포함할 수 있다. 일 실시예에서, 광학 부재 및/또는 이미지 센서는 실질적으로 케이 싱 내부로 수용되며, 렌즈(들)는 케이싱의 일측에 제공된 경통 구조물에 수용될 수 있다. 광학 부재는, 예를 들면, 렌즈(들)에 의해 집속 또는 안내된 광을 적어도 1회 반사시켜 이미지 센서 로 안내할 수 있다. 도시된 실시예의 직교좌표계는, 예를 들어, 도 2 내지 도 6의 직교좌표계를 참조한 것이나, 본 개시의 실시예가 이에 한정되지 않음에 유의한다. 예를 들어, 실제 제작될 전자 장치에서 카메라 모듈의 배치는 도시된 실 시예와 다를 수 있다. 일 실시예에서, 렌즈(들)의 정렬 방향 또는 광학 부재로 외부의 광이 입사되는 방향은 Z축에 실질적으로 평행한 것으로 이해될 수 있다. 일 실시예에서, 광학 부재로부터 광이 출사되는 방향 및/또는 이미지 센서로 광이 입사되는 방향은 Z축에 실질적으로 평행한 것으로 이해될 수 있다. 도시 된 실시예에서와 같이 광학 부재가 평행사변형인 때, +Z 방향을 따라 이미지 센서로 광이 입사될 수 있다. 도시된 실시예와 달리 광학 부재가 사다리꼴 형상일 때, 이미지 센서가 다른 위치에 배치될 수 있으며 이미지 센서로 입사되는 광은 -Z 방향을 따라 진행될 수 있다. 일 실시예에 따르면, 광학 부재를 구현함에 있어 도 8 내지 도 10의 제1 연장 방향(C1)은 도 14의 X축 방 향과 실질적으로 평행할 수 있다. 일 실시예에서, 광학 부재를 구현함에 있어 상술한 도 8 내지 도 10의 제2 연장 방향(C2)은 도 14의 XY 평면에 대하여 경사진 방향일 수 있다. 렌즈(들)에 의해 집속된 광 중에 서, 광학 부재의 표면(예: 도 8의 제1 투과면(TS1))에 수직하게 입사된 광은 광학 부재의 내부에서 광학 면(예: 도 8의 광학 면(OS1, OS2)(들))에 수직하게 진행할 수 있다. 일 실시예에 따르면, 카메라 모듈은 자동 초점 조절 기능을 제공하는 제1 캐리어와 손떨림 보정 기능 을 제공하는 제2 캐리어를 더 포함할 수 있으며, 이미지 센서는 제1 캐리어와 제2 캐리어 의 동작에 따라 광학 부재에 대하여 이동할 수 있다. 일 실시예에서, 제1 캐리어는 케이싱의 내 부에서 광학 부재에 가까워지거나 멀어지는 방향으로 왕복 운동 가능하게 배치될 수 있다. 예를 들어, 제1 캐리어는 Z축 방향을 따라 이미지 센서를 직선 왕복운동시킴으로써 초점 조절 기능을 구현할 수 있다. 일 실시예에서, 제1 캐리어와 케이싱의 내벽 사이에는 복수의 가이드 볼에 의한 안내 구 조가 구현될 수 있다. 예를 들어, 제1 캐리어가 케이싱의 내부에서 직선 왕복운동할 때, 복수의 가이 드 볼은 마찰 면적을 줄이면서 제1 캐리어의 직선 왕복운동을 안내할 수 있다. 일 실시예에 따르면, 제2 캐리어는 제1 캐리어 상에 배치되어 제1 캐리어와 함께 Z축 방향으로 직선 왕복운동할 수 있다. 일 실시예에서, 제2 캐리어는 제1 캐리어 상에서 수평 운동 가능하게 배치 될 수 있다. 예를 들어, 제2 캐리어는 Z축에 교차하는 평면에서 제1 캐리어에 대하여 적어도 2개의 방향을 따라 왕복운동할 수 있다. 일 실시예에서는, Z축 방향에 수직인 평면(예: XY 평면에 평행한 평면)에서 서로 직교하는 2개의 방향을 따라 제2 캐리어가 수평 운동하는 것으로 이해될 수 있다. 제2 캐리어의수평 운동은, 촬영 기능이 실행될 때 카메라 모듈에 가해지는 진동의 기반한 것으로서, 예를 들면, 광학적 손떨림 보정 기능을 수행하는 것으로 이해될 수 있다. 일 실시예에서는, 도시되지 않은 제2 가이드 볼(들)이 제 1 캐리어와 제2 캐리어 사이에 제공되어, 수평 운동에서의 마찰 면적을 줄이면서 제1 캐리어에 대한 제2 캐리어의 수평 운동을 안내할 수 있다. 일 실시예에 따르면, 이미지 센서는 제2 캐리어에 배치됨으로써, 제1 캐리어의 이동에 따라 초 점 조절 동작이 구현되고, 제1 캐리어에 대한 제2 캐리어의 수평 운동에 따라 손떨림 보정 동작이 구 현될 수 있다. 일 실시예에서, 제2 캐리어가 케이싱 내부에서 수평 이동 가능하게 배치되고, 제2 캐 리어 상에서 제1 캐리어가 Z축 방향으로 직선 왕복운동 가능하게 배치될 수 있다. 이 경우, 이미지 센서는 제1 캐리어에 배치될 수 있다. 일 실시예에 따르면, 카메라 모듈은, 초점 조절 기능 및/또는 손떨림 보정 기능의 구동력을 제공하는 구동 부재(904; 941, 942, 943)들을 더 포함할 수 있다. 구동 부재들은 코일과 자석을 포함하는 보이스 코일 모 터에 의해 구현될 수 있으며, 코일에 인가된 전기신호에 기반하여 초점 조절 기능 및/또는 손떨림 보정 기능의 구동력을 발생시킬 수 있다. 일 실시예에서, 구동 부재들 중 제1 구동 부재는 Y축 방향에서 광학 부 재 및/또는 캐리어(951, 953)들과 마주보는 영역에 배치되며, 구동 부재들 중 제2 구동 부재는 X축 방향에서 광학 부재 및/또는 캐리어(951, 953)들과 마주보는 영역에 배치되고, 및/또는 구동 부재 들 중 제3 구동 부재는 Y축 방향에서 광학 부재 및/또는 캐리어(951, 953)들과 마주보는 영역에 배치될 수 있다. 일 실시예에서, 광학 부재에 대하여 제1 구동 부재가 -Y 방향에 배치된 것으로 정의 할 때, 제3 구동 부재는 광학 부재에 대하여 +Y 방향에 배치된 것으로 이해될 수 있다. 예를 들어, 제1 구동 부재와 제3 구동 부재는 광학 부재를 사이에 두고 적어도 부분적으로 마주보게 배치될 수 있다. 일 실시예에 따르면, 제1 구동 부재와 제3 구동 부재 중 하나가 제1 캐리어를 Z축 방향으로 이 동시키는 구동력을 제공할 때, 제1 구동 부재와 제3 구동 부재 중 다른 하나는 제2 캐리어를 Y 축 방향(또는 X축 방향)으로 이동시키는 구동력을 제공할 수 있다. 이 경우, 제2 구동 부재는 제2 캐리어 를 X축 방향(또는 Y축 방향)으로 이동시키는 구동력을 제공할 수 있다. 하지만, 구동 부재들이 발생 시키는 구동력의 방향에 있어 본 개시의 실시예(들)는 위 언급된 것에 한정되지 않으며, 구동 부재에서 코 일을 구현하는 도선의 권선 방향이나 하나의 구동 부재 내에서 코일과 자석의 상대적인 배치에 따라 그 위 치와 구동력의 방향은 도시된 실시예와 다르게 구현될 수 있다. 일 실시예에 따르면, 카메라 모듈은 이미지 센서로부터 연장된 가요성 인쇄회로 기판을 더 포함 할 수 있다. 가요성 인쇄회로 기판은 예를 들면, 이미지 센서로 전원을 공급하거나, 이미지 센서 에서 획득된 데이터를 프로세서(예: 도 1의 프로세서)로 전송하는 배선을 제공할 수 있다. 일 실시예 에서, 가요성 인쇄회로 기판은, 일단이 이미지 센서에 연결된 제1 연장부, 제1 연장부의 타단으로부터 연장된 제2 연장부, 제2 연장부의 한 단(one end)으로부터 연장된 제3 연장부를 포함할 수 있다. 일 실시예에서, 제1 연장부은 적어도 부분적으로 이미지 센서와 동일 평면에 배치될 수 있다. 일 실시예에 따르면, 제2 연장부는 제1 연장부에 대하여 경사지게 또는 수직하게 배치된 것으로 이해 될 수 있다. 일 실시예에서, 제3 연장부는 제1 연장부에 대하여 경사지게 또는 수직하게 배치되며, 제2 연장부에 대하여 경사지게 또는 수직하게 배치된 것으로 이해될 수 있다. 예를 들어, 제1 연장부(93 1)는 XY 평면에 실질적으로 평행하면서 X축 방향을 따라 연장되고, 제2 연장부는 YZ 평면에 실질적으로 평 행하면서 Y축 방향을 따라 연장되며, 및/또는 제3 연장부는 XZ 평면에 실질적으로 평행하면서 X축 방향을 따라 연장될 수 있다. 일 실시예에서는, 제1 연장부가 광학 부재의 투과면(예: 도 8의 투과면(TS1, TS2))들 중 어느 하나와 적어도 부분적으로 마주보게 배치되고, 제2 연장부는 광학 부재의 반사면(예: 도 8의 반사면(RS1, RS2))들 중 어느 하나와 적어도 부분적으로 마주보게 배치되고, 및/또는 제3 연 장부는 광학 부재의 측면(예: 도 9의 제1 측면(SS1)(들) 및/또는 도 10의 제2 측면(SS2)(들))에 적 어도 부분적으로 마주보게 배치될 수 있다. 일 실시예에 따르면, 위와 같은 가요성 인쇄회로 기판의 배치는, 광학 부재에 대하여 이미지 센서 의 이동을 원활하게 할 수 있다. 여기서, '이미지 센서의 이동'이라 함은 예를 들어, 자동 초점 조절을 위 한 Z축 방향에서의 왕복운동, 또는 손떨림 보정을 위한 수평이동을 언급한 것일 수 있다. 일 실시예에서, 자동 초점 조절 동작에서 제2 연장부와 제3 연장부는 이미지 센서의 이동에 장애가 될 수 있지만, 제1 연장부가 평면 형태와 곡면 형태로 변형되면서 이미지 센서가 Z축 방향으로 왕복운동하는 것을 허 용할 수 있다. 이와 유사하게, 손떨림 보정 동작에서 제1 연장부는 이미지 센서의 수평이동에 장애가 될 수 있지만, 제2 연장부(또는 제3 연장부)가 평면 형태와 곡면 형태로 변형되면서 이미지 센서 가 X축 방향(또는 Y축 방향)으로 왕복운동하는 것을 허용할 수 있다. 이와 같이, 가요성 인쇄회로 기판 이 광학 부재의 3면의 주위로 배치된 구조는 자동 초점 조절 기능 또는 손떨림 보정 기능을 수행하는 동작에서 이미지 센서를 이동을 원활하게 할 수 있다. 일 실시예에서는, 렌즈(들)을 이동시킴으로써 자동 초점 조절 기능 또는 손떨림 보정 기능이 구현될 수 있으며, 이 경우 이미지 센서의 이동은 불필요할 수 있으므로 가요성 인쇄회로 기판의 배치는 도시된 실시예와 다르게 구현될 수 있다. 도 16은 본 개시의 일 실시예에 따른 전자 장치(예: 도 1 내지 도 6의 전자 장치(101, 200, 300, 400))에서, 카 메라 모듈(991, 900)(예: 도 3, 도 6, 도 7, 도 14 및/또는 도 15의 카메라 모듈(205, 212, 213, 500, 900)) (들)의 배치를 예시하는 도면이다. 도 17은 본 개시의 일 실시예에 따른, 카메라 모듈(991, 900)을 포함하는 전 자 장치(예: 도 1 내지 도 6의 전자 장치(101, 200, 300, 400))를 나타내는 도면이다. 앞서 언급한 바와 같이, 광학적 특성(예: 화각)이 서로 다른 복수의 카메라 모듈이 탑재됨으로써, 소형화된 전 자 장치를 이용하여 고품질의 촬상 이미지가 획득될 수 있다. 도 16과 도 17은 하나의 전자 장치에 복수 의 카메라 모듈(991, 900)이 탑재될 때의 배열을 예시한 것일 수 있다. 도 16 또는 도 17의 실시예를 설명함에 있어, 제2 카메라 모듈은 실질적으로 상술한 카메라 모듈(예: 도 3, 도 6, 도 7, 도 14 및/또는 도 15의 카메라 모듈(205, 212, 213, 500, 900))의 한 예로서, 도면의 참조번호는 도 14와 도 15의 카메라 모듈과 동일 하게 부여될 수 있다. 도 16과 도 17을 참조하면, 전자 장치는, 표준 카메라, 광각 카메라 및/또는 초광각 카메라로서 제공된 적어도 하나의 제1 카메라 모듈과, 제1 카메라 모듈(들)에 인접하게 배치된 제2 카메라 모듈을 포함할 수 있으며, 망원 기능에 있어 제2 카메라 모듈은 제1 카메라 모듈(들)보다 높은 성능을 제공 할 수 있다. 예를 들어, 제2 카메라 모듈은 제1 카메라 모듈보다 작은 화각(field of view; FOV) 또 는 긴 초점 거리를 가진 것으로 이해될 수 있다. 일 실시예에서는, 제2 카메라 모듈이 상술한 광학 부재 (예: 도 6 내지 도 8, 도 14 및/또는 도 15의 광학 부재(R, 600, 923))를 포함하는 카메라 모듈의 하나일 수 있 다. 일 실시예에서, 전자 장치(예: 도 1의 프로세서)는 제1 카메라 모듈(들)과 제2 카메라 모 듈 중 적어도 하나를 이용하여 피사체 이미지를 획득할 수 있으며, 제1 카메라 모듈(들)과 제2 카메 라 모듈에서 획득된 이미지를 합성하여 더욱 향상된 품질의 이미지를 생성할 수 있다. 일 실시예에 따르면, 전자 장치는 후면 플레이트, 커버 플레이트 및/또는 커버 플레이트 에 제공된 개구 영역들을 포함할 수 있다. 이러한 전자 장치의 실시예는 도 2 내지 도 6의 실시예와 유사할 수 있으므로, 그 상세한 설명은 생략하기로 한다. 제1 카메라 모듈(들) 및/또는 제2 카메 라 모듈은 개구 영역들 중 어느 하나에 상응하게 배치될 수 있다. 일 실시예에서, 개구 영역 들 중, 도 17의 좌측 1열에 배치된 2개의 개구 영역에는 제1 카메라 모듈(들)이 배치되고, 제2 카메 라 모듈은 도 17의 우측 개구 영역에 배치될 수 있다. 제2 카메라 모듈을 배치함에 있어, 도 14 또는 도 15의 렌즈(들)가 실질적으로 개구 영역들 중 어느 하나에 정렬된 상태로 배치되며, 도 14 또는 도 15의 광학 부재(또는 이미지 센서)는 렌즈(들)보다 우측에 배치된 것으로 이해될 수 있다. 일 실시예에서, 광학 부재를 포함함으로써 상대적으로 큰 길이를 가진 제2 카메라 모듈이 제1 카메라 모듈(들)보다 내측에 배치되고, 제1 카메라 모듈(들)이 하우징의 한 측면(예: 도 2의 측면(210C))에 인접하게 배치됨으로써, 제1 카메라 모듈(들)은 전자 장치의 가장자리와 제2 카메라 모듈 사이의 영역에 배치된 것으로 이해될 수 있다. 복수의 제1 카메라 모듈이 제공된 구조에서는, 제1 카메라 모듈들이 Y축 방향을 따라 배열된 것으로 이해될 수 있다. 이러한 카메라 모듈(991, 900)들의 배치는, 커버 플레이트가 제공하는 영역에서 추가의 전자 부품 (예: 플래시와 같은 조명, 거리나 심도 측정을 위한 적외선 센서, 및/또는 촬영 방향에서의 음향을 검출하기 위 한 마이크)을 위한 영역의 확보에 유용할 수 있다. 일 실시예에서, 제1 카메라 모듈이 복수로 제공되며 전 자 장치의 가장자리에 인접하게 배열된 때, 제2 카메라 모듈 상측이나 하측에서 추가의 전자 부품 을 위한 영역이 확보될 수 있다. 예를 들어, 제2 카메라 모듈 상측 영역 또는 하측 영역에 플래시나 적외선 레이더와 같은 추가의 전자 부품이 배치될 수 있다. 일 실시예에 따르면, 다른 카메라 모듈(예: 제1 카메라 모듈(들))과 비교할 때 상대적으로 긴 광학 부재 를 포함할 때 제2 카메라 모듈(및/또는 광학 부재)는 X축 방향에 실질적으로 평행하게 배치됨으로써, 전자 장치의 내부에서는 각종 전기/전자 부품의 배치 공간 또는 배터리(예: 도 4의배터리)의 용량 확보가 용이할 수 있다. 예를 들어, 배터리는 대체로 직사각형 형상으로 제작되므로, 광학 부재(92 3)가 Y축에 실질적으로 평행하게 배치될 때 직사각형 형상의 배터리 배치 공간이 광학 부재에 간섭될 수 있다. 따라서 광학 부재가 X축 방향에 실질적으로 평행하게 배치됨으로써, 배터리 배치 공간과의 간섭을 억제하거나 배터리 용량의 확장이 용이할 수 있다. 일 실시예에서는, 광학 부재가 X축 방향에 실질적으로 평행하게 배치하고 배터리 용량이 동일하게 유지될 때, 전기/전자 부품의 배치에 있어 설계자 유도가 높아질 수 있다. 상술한 바와 같이, 본 개시의 일 실시예의 카메라 모듈(예: 도 3, 도 6, 도 7, 도 14 및/또는 도 15의 카메라 모듈(205, 212, 213, 500, 900)) 및/또는 전자 장치(예: 도 1 내지 도 6 및/또는 도 17의 전자 장치(101, 200, 300, 400, 1000))는, 이미지 센서(예: 도 6, 도 7, 도 14 및/또는 도 15의 이미지 센서(411, 925))로 안내되는 광을 적어도 1회 반사 또는 굴절시키는 광학 부재(예: 도 6 내지 도 8, 도 14 및/또는 도 15의 광학 부재(R, 600, 923))를 포함함으로써 소형화되면서 망원 기능을 구현하기 용이할 수 있다. 예를 들어, 광 경로의 설계 자 유도가 향상됨으로써 망원 성능을 제공하면서 협소한 공간에서도 카메라 모듈이 용이하게 배치될 수 있다. 일 실시예에 따르면, 복수의 반사 부재(예: 도 8의 반사 부재(601, 602)들)가 결합되어 광학 부재가 구현됨으로써, 차광 구조(예: 도 11의 차광 구조)의 배치가 용이할 수 있다. 예를 들어, 광학 부재는 카메라 모듈에서의 미광 현상 또는 플레어 현상을 억제할 수 있다. 일 실시예에서는 복수의 반사 부재를 결합함에 있어, 결속 또는 안내 구조(예: 도 8 내지 도 10의 수용 홈과 돌출부)를 이용하여 정렬 위치가 결정되므로 광학 부재 는 설계 사양에 부합하는 성능을 제공할 수 있다. 본 개시에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효과들은 상술한 실시예(들)의 기재로부터 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다. 상술한 바와 같이, 본 개시의 일 실시예에 따르면, 카메라 모듈(예: 도 3, 도 6, 도 7, 도 14 및/또는 도 15의 카메라 모듈(205, 212, 213, 500, 900))은, 일면에 형성된 수용 홈(예: 도 9의 수용 홈)과, 상기 수용 홈 이 제공하는 영역 내에 제공된 제1 광학 면(예: 도 8의 제1 광학 면(OS1))을 포함하는 제1 반사 부재(예: 도 8 또는 도 9의 제1 반사 부재), 일면에서 돌출되어 적어도 부분적으로 상기 수용 홈에 수용되는 돌출부(예: 도 8 또는 도 10의 돌출부)와, 상기 돌출부의 한 표면에 제공되어 상기 제1 광학 면에 마주보게 배치되는 제2 광학 면(예: 도 8의 제2 광학 면(OS2))을 포함하는 제2 반사 부재(예: 도 8 또는 도 10의 제2 반사 부재 ), 및 상기 제1 광학 면과 상기 제2 광학 면을 경유하여 안내된 광의 적어도 일부를 검출하도록 구성된 이 미지 센서(예: 도 6, 도 7, 도 14 및/또는 도 15의 이미지 센서(411, 925))를 포함할 수 있다. 일 실시예에서, 상기 수용 홈은 상기 제1 광학 면 또는 상기 제2 광학 면에 평행한 평면에서, 상기 돌출부가 제1 연장 방향(예: 도 8의 제1 연장 방향(C1))으로 이동하는 것을 허용하도록 구성되고, 상기 돌출부가 상기 제1 연장 방향에 교차 하는 제2 연장 방향(예: 도 8의 제2 연장 방향(C2))으로 이동하는 것을 제한하도록 구성될 수 있다. 일 실시예에 따르면, 상기 제1 반사 부재는 상기 제1 광학 면에 대하여 경사진 제1 표면(예: 도 8의 제1 투과면 (TS1) 또는 제1 반사면(RS1))을 포함하고, 상기 제2 반사 부재는 상기 제2 광학 면에 대하여 경사진 제2 표면 (예: 도 8의 제2 투과면(TS2) 또는 제2 반사면(RS2))을 포함할 수 있다. 일 실시예에서, 상기 제2 표면은 상기 제1 광학 면 또는 상기 제2 광학 면을 사이에 두고 상기 제1 표면과 적어도 부분적으로 반대 방향을 지향하도록 배치될 수 있다. 일 실시예에서, 상기 수용 홈과 상기 돌출부는, 상기 제1 표면과 상기 제2 표면 사이의 거리 (예: 도 8의 제1 거리(G1) 및/또는 제2 거리(G2))를 지정된 범위 내에서 유지시키도록 구성될 수 있다. 일 실시예에 따르면, 상기 제1 표면 또는 상기 제2 표면은 상기 이미지 센서로 안내되는 광을 투과 또는 반사시 키도록 구성될 수 있다. 일 실시예에 따르면, 상기 돌출부는, 상기 제2 광학 면의 가장자리로부터 수직하게 또는 경사지게 연장된 복수 의 측면(예: 도 10의 측면(621a, 621b, 621c, 621d)들)을 포함할 수 있다. 일 실시예에서, 상기 복수의 측면 중 적어도 하나가 상기 제1 연장 방향에 나란하게 정렬되고, 상기 제1 연장 방향에 교차하는 방향에서 상기 수용 홈의 내벽에 마주보게 배치될 수 있다. 일 실시예에 따르면, 상기 복수의 측면 중 다른 적어도 하나가 상기 제1 연장 방향을 지향하게 배치되면서 상기 수용 홈의 외부 공간으로 노출될 수 있다. 일 실시예에 따르면, 상기 복수의 측면 중 상기 수용 홈의 외부 공간으로 노출된 측면은, 상기 제1 반사 부재의 표면 중 적어도 일부와 연속된 평면 또는 연속된 곡면을 이루게 배치될 수 있다. 일 실시예에 따르면, 상기와 같은 카메라 모듈은, 상기 복수의 측면 중 상기 수용 홈의 외부 공간으로 노출된 측면과, 상기 제1 반사 부재의 표면 중 적어도 일부 사이의 경계에 제공된 더미 홈(예: 도 8 또는 도 12의 더미 홈(699, 799)), 및 상기 더미 홈의 적어도 일부에 충진된 접착제(예: 도 12의 접착제(799a))를 더 포함할 수 있 다. 일 실시예에 따르면, 상기 제1 반사 부재 또는 상기 제2 반사 부재의 한 표면에 수직하게 입사된 광이 상기 제1 광학 면 또는 상기 제2 광학 면을 수직하게 투과하도록 구성될 수 있다. 일 실시예에 따르면, 상기 제1 반사 부재는 제1 투과면(first transmissive surface)(예: 도 8의 제1 투과면 (TS1))과, 상기 제1 투과면에 대하여 경사지게 배치된 제1 반사면(first reflective surface)(예: 도 8의 제1 반사면(RS1))을 포함할 수 있다. 일 실시예에서, 상기 제2 반사 부재는 상기 제1 투과면의 반대 방향을 향하도 록 배치된 제2 투과면(예: 도 8의 제2 투과면(TS2))과, 상기 제1 반사면의 반대 방향을 향하도록 배치된 제2 반 사면(예: 도 8의 제2 반사면(RS2))을 포함할 수 있다. 일 실시예에서, 상기 제1 투과면과 상기 제2 투과면 중 어느 하나가 상기 이미지 센서와 마주보게 배치될 수 있다. 일 실시예에 따르면, 상기 제1 투과면과 상기 제2 투과면 중 다른 하나에 수직하게 입사된 광이 상기 제1 광학 면 또는 상기 제2 광학 면을 수직하게 투과하도록 구성될 수 있다. 일 실시예에 따르면, 상기와 같은 카메라 모듈은, 외부의 광을 입사받아 상기 제1 투과면과 상기 제2 투과면 중 다른 하나로 안내하는 적어도 하나의 렌즈(예: 도 6의 렌즈 어셈블리 또는 도 14의 렌즈(들))를 더 포함할 수 있다. 일 실시예에 따르면, 상기와 같은 카메라 모듈은, 상기 제1 반사 부재의 표면 중 일부인 제1 경사면(예: 도 12 의 제1 경사면)으로서, 상기 제1 반사 부재의 상기 일면에 대하여 경사지게 형성된 상기 제1 경사면, 및 상기 제2 반사 부재의 표면 중 일부인 제2 경사면(예: 도 12의 제2 경사면)으로서, 상기 제2 반사 부재의 상기 일면에 대하여 경사지게 형성된 상기 제2 경사면을 더 포함할 수 있다. 일 실시예에서, 상기 돌출부가 상 기 수용 홈에 수용된 때, 상기 제1 경사면과 상기 제2 경사면이 인접하게 배치되어 더미 홈(예: 도 8 또는 도 12의 더미 홈(699, 799))을 형성하도록 구성될 수 있다. 일 실시예에 따르면, 상기와 같은 카메라 모듈은, 상기 더미 홈의 적어도 일부에 충진된 접착제(예: 도 12의 접 착제(799a))를 더 포함할 수 있다. 일 실시예에 따르면, 상기와 같은 카메라 모듈은, 상기 제1 광학 면 가장자리의 적어도 일부, 또는 상기 제2 광 학 면 가장자리의 적어도 일부에 제공된 차광 부재(예: 도 11의 차광 구조를 더 포함할 수 있다. 일 실시예에 따르면, 상기 차광 부재는, 인쇄층, 코팅층, 증착층, 도금층, 차광 필름 또는 차광 시트 중 적어도 하나를 포함할 수 있다. 일 실시예에 따르면, 상기와 같은 카메라 모듈은, 상기 이미지 센서로부터 연장된 가요성 인쇄회로 기판(예: 도 15의 가요성 인쇄회로 기판)을 더 포함할 수 있다. 일 실시예에서, 상기 가요성 인쇄회로 기판은, 적어도 부분적으로 상기 이미지 센서와 동일 평면에 배치된 제1 연장부(예: 도 15의 제1 연장부), 상기 제1 연장 부로부터 연장되며 상기 제1 연장부에 대하여 경사지게 배치된 제2 연장부(예: 도 15의 제2 연장부), 및 상기 제2 연장부로부터 연장되며 상기 제1 연장부와 상기 제2 연장부에 대하여 경사지게 배치된 제3 연장부(예: 도 15의 제3 연장부)를 포함할 수 있다. 일 실시예에 따르면, 상기 제1 연장부는, 상기 이미지 센서로 광이 입사되는 방향을 따라 상기 이미지 센서가 왕복 운동하는 것을 허용하도록 구성될 수 있다. 일 실시예에 따르면, 상기 제2 연장부 또는 상기 제3 연장부는 상기 이미지 센서로 광이 입사되는 방향에 교차 하는 평면에서 상기 이미지 센서가 수평 이동하는 것을 허용하도록 구성될 수 있다. 본 개시의 일 실시예에 따르면, 전자 장치(예: 도 1 내지 도 6 및/또는 도 17의 전자 장치(101, 200, 300, 400, 1000))는, 적어도 하나의 제1 카메라 모듈(예: 도 16 또는 도 17의 제1 카메라 모듈(들)), 상기 적어도 하 나의 제1 카메라 모듈과 인접하게 배치되며 상기 적어도 하나의 제1 카메라 모듈보다 작은 화각(field of view; FOV)을 가진 제2 카메라 모듈(예: 도 3, 도 6, 도 7, 도 14 내지 도 17의 카메라 모듈(205, 212, 213, 500,900))로서, 제1 항 내지 제18 항 중 어느 한 항에 따른 상기 제2 카메라 모듈, 및 상기 적어도 하나의 제1 카메 라 모듈 또는 상기 제2 카메라 모듈 중 적어도 하나를 이용하여 피사체 이미지를 획득하도록 구성된 프로세서 (예: 도 1의 프로세서)를 포함할 수 있다. 일 실시예에 따르면, 상기 적어도 하나의 제1 카메라 모듈은 상기 전자 장치의 한 측면에 인접하면서, 상기 전 자 장치의 한 측면과 상기 제2 카메라 모듈 사이의 영역에 배치될 수 있다. 본 개시는 일 실시예에 관해 예시하여 설명되었지만, 일 실시예가 본 개시를 한정하는 것이 아니라 예시를 위한 것으로 이해되어야 할 것이다. 첨부된 청구항과 그 균등물을 포함하여, 본 개시의 전체 관점에서 벗어나지 않는 범위에서 그 형식과 세부적인 구성에 다양한 변화가 이루어질 수 있음은 당업자에게 자명하다 할 것이다."}
{"patent_id": "10-2023-0119145", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 개시의 일 실시예에 관해 상술한 측면 또는 다른 측면, 구성 및/또는 장점은 첨부된 도면을 참조하는 다음의 상세한 설명을 통해 더욱 명확해질 수 있다. 도 1은 본 개시의 일 실시예에 따른, 네트워크 환경 내의 전자 장치를 나타내는 블록도이다. 도 2는 본 개시의 일 실시예에 따른 전자 장치의 전면을 나타내는 사시도이다. 도 3은 본 개시의 일 실시예에 따른, 도 2에 도시된 전자 장치의 후면을 나타내는 사시도이다. 도 4는 본 개시의 일 실시예에 따른, 도 2에 도시된 전자 장치를 나타내는 분리 사시도로서 전면을 나타내는 도 면이다. 도 5는 본 개시의 일 실시예에 따른, 도 2에 도시된 전자 장치를 나타내는 분리 사시도로서 후면을 나타내는 도 면이다. 도 6은 본 개시의 일 실시예에 따른 전자 장치의 일부분을, 도 3의 A-A'를 따라 절개하여 나타내는 단면도이다. 도 7은 본 개시의 일 실시예에 따른 전자 장치에서, 카메라 모듈의 광학 경로를 예시하는 구성도이다. 도 8은 본 개시의 일 실시예에 따른 카메라 모듈의 광학 부재를 나타내는 도면이다. 도 9는 본 개시의 일 실시예에 따른, 도 8의 광학 부재 중 제1 반사 부재를 나타내는 사시도이다. 도 10은 본 개시의 일 실시예에 따른, 도 8의 광학 부재 중 제2 반사 부재를 나타내는 사시도이다. 도 11은 본 개시의 일 실시예에 따른 카메라 모듈의 광학 부재 중 제2 반사 부재를 나타내는 사시도이다. 도 12는 본 개시의 일 실시예에 따른 카메라 모듈의 광학 부재를 나타내는 도면이다. 도 13은 본 개시의 일 실시예에 따른 카메라 모듈의 광학 부재를 나타내는 도면이다. 도 14는 본 개시의 일 실시예에 따른 카메라 모듈을 나타내는 제1 사시도이다. 도 15는 본 개시의 일 실시예에 따른 카메라 모듈을 나타내는 제2 사시도이다. 도 16은 본 개시의 일 실시예에 따른 전자 장치에서, 카메라 모듈(들)의 배치를 예시하는 도면이다. 도 17은 본 개시의 일 실시예에 따른, 카메라 모듈을 포함하는 전자 장치를 나타내는 도면이다. 첨부된 도면의 전반에서, 유사한 부품, 구성 및/또는 구조에 대해서는 유사한 참조 번호가 부여될 수 있다."}
