{"patent_id": "10-2023-7018044", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0111203", "출원번호": "10-2023-7018044", "발명의 명칭": "표시 시스템 및 전자 기기", "출원인": "가부시키가이샤 한도오따이 에네루기 켄큐쇼", "발명자": "야마자키 슌페이"}}
{"patent_id": "10-2023-7018044", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "표시 시스템으로서,제 1 층과 표시부를 포함하고,상기 표시부는 상기 제 1 층과 중첩하는 영역에 위치하고,상기 제 1 층은 실리콘을 재료로 한 반도체 기판을 포함하고,상기 제 1 층은 상기 실리콘을 채널 형성 영역에 포함하는 복수의 제 1 트랜지스터 및 복수의 제 2 트랜지스터를 포함하고,상기 제 1 층은 제 1 회로와 제 2 회로를 포함하고,상기 제 1 회로는 각각에 제 1 트랜지스터가 포함되는 소스 드라이버 회로 및 게이트 드라이버 회로를포함하고,상기 제 2 회로는 각각에 상기 제 2 트랜지스터가 포함되는 기억 장치와, CPU와, GPU와, EL 보정 회로와, 타이밍 컨트롤러와, 고주파 회로를 포함하고,상기 표시부는 화소를 포함하고,상기 화소는 유기 EL를 포함한 발광 디바이스를 포함하고,상기 화소는 상기 소스 드라이버 회로와 상기 게이트 드라이버 회로에 전기적으로 접속되고,상기 기억 장치는 화상 데이터를 유지하는 기능을 갖고,상기 CPU는 상기 기억 장치와, 상기 GPU와, 상기 EL 보정 회로와, 상기 타이밍 컨트롤러와, 상기 고주파 회로중에서 선택된 하나 또는 2개 이상에 제어 신호를 송신하는 기능을 갖고,상기 GPU는 상기 기억 장치로부터 판독된 상기 화상 데이터를 디코딩하는 기능을 갖고,상기 소스 드라이버 회로는 디코딩된 상기 화상 데이터를 상기 화소에 송신하는 기능을 갖고,상기 EL 보정 회로는 상기 발광 디바이스가 발광하는 광의 휘도를 보정하는 기능을 갖고,상기 타이밍 컨트롤러는 상기 표시부에 화상을 표시할 때의 프레임 레이트를 증감하는 기능을 갖고,상기 고주파 회로는 상기 CPU, 상기 GPU, 및 상기 기억 장치 중 어느 하나에서 생성된 전기 신호를 RF 신호로변환하여 외부로 송신하는 기능과, 외부로부터 취득한 RF 신호를 전기 신호로 변환하여 상기 CPU, 상기 GPU, 및상기 기억 장치 중 어느 하나로 송신하는 기능을 갖는, 표시 시스템."}
{"patent_id": "10-2023-7018044", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "표시 시스템으로서,제 1 층과 표시부를 포함하고,상기 표시부는 상기 제 1 층과 중첩하는 영역에 위치하고,상기 제 1 층은 실리콘을 재료로 한 반도체 기판을 포함하고,상기 제 1 층은 상기 실리콘을 채널 형성 영역에 포함하는 복수의 제 1 트랜지스터 및 복수의 제 2 트랜지스터를 포함하고,상기 제 1 층은 제 1 회로와 제 2 회로를 포함하고,상기 제 1 회로는 각각에 제 1 트랜지스터가 포함되는 소스 드라이버 회로 및 게이트 드라이버 회로를공개특허 10-2023-0111203-3-포함하고,상기 제 2 회로는 각각에 상기 제 2 트랜지스터가 포함되는 기억 장치와, GPU와, EL 보정 회로와, 타이밍 컨트롤러를 포함하고,상기 표시부는 화소를 포함하고,상기 화소는 유기 EL를 포함한 발광 디바이스를 포함하고,상기 화소는 상기 소스 드라이버 회로와 상기 게이트 드라이버 회로에 전기적으로 접속되고,상기 기억 장치는 화상 데이터를 유지하는 기능을 갖고,상기 GPU는 상기 기억 장치로부터 판독된 상기 화상 데이터를 디코딩하는 기능을 갖고,상기 소스 드라이버 회로는 디코딩된 상기 화상 데이터를 상기 화소에 송신하는 기능을 갖고,상기 EL 보정 회로는 상기 발광 디바이스가 발광하는 광의 휘도를 보정하는 기능을 갖고,상기 타이밍 컨트롤러는 상기 표시부에 화상을 표시할 때의 프레임 레이트를 증감하는 기능을 갖는, 표시 시스템."}
{"patent_id": "10-2023-7018044", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "표시 시스템으로서,제 1 층과, 제 2 층과, 표시부를 포함하고,상기 표시부는 상기 제 1 층과 중첩하는 영역에 위치하고,상기 제 2 층은 상기 제 1 층과 중첩하는 영역에 위치하고,상기 제 1 층은 실리콘을 재료로 한 반도체 기판을 포함하고,상기 제 1 층은 상기 실리콘을 채널 형성 영역에 포함하는 복수의 제 1 트랜지스터 및 복수의 제 2 트랜지스터를 포함하고,상기 제 2 층은 금속 산화물을 채널 형성 영역에 포함하는 복수의 제 3 트랜지스터를 포함하고,상기 제 1 층은 제 1 회로와 제 2 회로를 포함하고,상기 제 1 회로는 각각에 제 1 트랜지스터가 포함되는 소스 드라이버 회로 및 게이트 드라이버 회로를포함하고,상기 제 2 회로는 각각에 상기 제 2 트랜지스터가 포함되는 기억 장치와, GPU와, EL 보정 회로와, 타이밍 컨트롤러를 포함하고,상기 제 3 트랜지스터는 상기 제 1 층에 포함되는 상기 기억 장치가 포함한 트랜지스터로서 기능하고,상기 표시부는 화소를 포함하고,상기 화소는 유기 EL를 포함한 발광 디바이스를 포함하고,상기 화소는 상기 소스 드라이버 회로와 상기 게이트 드라이버 회로에 전기적으로 접속되고,상기 기억 장치는 화상 데이터를 유지하는 기능을 갖고,상기 GPU는 상기 기억 장치로부터 판독된 상기 화상 데이터를 디코딩하는 기능을 갖고,상기 소스 드라이버 회로는 디코딩된 상기 화상 데이터를 상기 화소에 송신하는 기능을 갖고,상기 EL 보정 회로는 상기 발광 디바이스가 발광하는 광의 휘도를 보정하는 기능을 갖고,상기 타이밍 컨트롤러는 상기 표시부에 화상을 표시할 때의 프레임 레이트를 증감하는 기능을 갖는, 표시 시스템."}
{"patent_id": "10-2023-7018044", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "공개특허 10-2023-0111203-4-제 3 항에 있어서,상기 제 2 층은 메모리 셀을 포함하는, 표시 시스템."}
{"patent_id": "10-2023-7018044", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 2 항 내지 제 4 항 중 어느 한 항에 있어서,상기 제 2 회로는 상기 제 2 트랜지스터가 포함된 CPU를 포함하고,상기 CPU는 상기 기억 장치와, 상기 GPU와, 상기 EL 보정 회로와, 상기 타이밍 컨트롤러 중에서 선택된 하나 또는 2개 이상에 제어 신호를 송신하는 기능을 갖는, 표시 시스템."}
{"patent_id": "10-2023-7018044", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항 내지 제 5 항 중 어느 한 항에 있어서,상기 GPU는 인공 뉴럴 네트워크의 연산을 수행하고, 상기 표시부에 표시된 화상을 상기 연산의 결과에 기초하여보정하는 기능을 갖는, 표시 시스템."}
{"patent_id": "10-2023-7018044", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "전자 기기로서,제 1 항 내지 제 6 항 중 어느 한 항에 기재된 표시 시스템과, 하우징을 포함하는, 전자 기기."}
{"patent_id": "10-2023-7018044", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "표시 품질이 높고 정세도가 높은 표시 시스템을 제공한다. 제 1 층과 표시부를 포함하는 표시 시스템이다. 표 시부는 제 1 층과 중첩하는 영역에 위치한다. 제 1 층은 실리콘을 재료로 한 반도체 기판을 포함하고, 반도체 기판 위에는 실리콘을 채널 형성 영역에 포함하는 복수의 제 1 트랜지스터 및 복수의 제 2 트랜지스터가 형성되 어 있다. 제 1 층은 제 1 회로와 제 2 회로를 포함하고, 제 1 회로는 표시부를 구동시키는 구동 회로를 포함하 고, 제 2 회로는 기억 장치, GPU, 및 EL 보정 회로를 포함한다. 표시부는 화소를 포함하고, 화소는 유기 EL를 포함한 발광 디바이스를 포함하고, 구동 회로에 전기적으로 접속되어 있다. 또한 기억 장치는 화상 데이터를 유 지하는 기능을 갖고, GPU는 기억 장치로부터 판독된 화상 데이터를 디코딩하는 기능을 갖고, EL 보정 회로는 발 광 디바이스가 발광하는 광을 보정하는 기능을 갖는다."}
{"patent_id": "10-2023-7018044", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 일 형태는 표시 시스템 및 전자 기기에 관한 것이다."}
{"patent_id": "10-2023-7018044", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 2, "content": "또한 본 발명의 일 형태는 상기 기술분야에 한정되지 않는다. 본 명세서 등에서 개시(開示)하는 발명의 기술분 야는 물건, 구동 방법, 또는 제조 방법에 관한 것이다. 또는 본 발명의 일 형태는 공정(process), 기계 (machine), 제품(manufacture), 또는 조성물(composition of matter)에 관한 것이다. 그러므로 더 구체적으로"}
{"patent_id": "10-2023-7018044", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 3, "content": "본 명세서에서 개시하는 본 발명의 일 형태의 기술분야로서는 반도체 장치, 표시 장치, 액정 표시 장치, 발광 장치, 축전 장치, 촬상 장치, 기억 장치, 신호 처리 장치, 프로세서, 전자 기기, 시스템, 이들의 구동 방법, 이 들의 제조 방법, 또는 이들의 검사 방법을 일례로서 들 수 있다."}
{"patent_id": "10-2023-7018044", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "VR(가상 현실), AR(증강 현실) 등의 XR(VR, AR 등의 총칭) 용도로 적용 가능한 표시 장치가 요구되고 있다. 구 체적으로는, 예를 들어 현실감 및 몰입감을 높이기 위하여 상기 표시 장치로서 정세도가 높은 것, 색 재현성이 높은 것 등이 요구되고 있다. 또한 상기 표시 장치에 적용 가능한 장치의 예로서는, 액정 표시 장치, 유기 EL(Electro Luminescence), 발광 다이오드(LED: Light Emitting Diode) 등의 발광 디바이스를 포함한 발광 장치 등이 있다. 또한 특허문헌 1에 는 유기 EL가 포함된 발광 디바이스를 포함하는, 고화소수 및 고정세(高精細)의 표시 장치가 개시되어 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 국제공개공보 WO2019/220278호"}
{"patent_id": "10-2023-7018044", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상술한 바와 같이, XR용 기기로서는 표시 품질이 높은 표시 장치가 요구되고 있다. 또한 XR용 표시 장치는 예 를 들어 안경형 하우징, 고글형 하우징에 제공할 필요가 있기 때문에, 표시 장치의 크기를 예를 들어 약 대각 2 인치 이하, 대각 1인치 이하까지 작게 하여야 한다. 또한 표시 장치에는, 드라이버 회로, 표시하는 화상을 미리 저장하는 기억 장치, 디지털 아날로그 변환 회로 (DAC), 인코딩된 화상을 복원하기 위한 디코더 등의 주변 회로가 필요하다. 또한 표시 품질을 높이기 위해서는 화상 데이터를 보정하는 회로가 포함되는 것이 바람직하다. 그러므로 이들 주변 회로를 제공하는 경우, 하우징 크기가 커져, 상기 하우징을 착용하는 사람의 부담이 커질 경우가 있다. 또한 주변 회로가 많아지면, 표시 장 치 내에서 화소와 주변 회로 간의 신호 액세스가 증가되기 때문에 액세스 시간 및 소비 전력도 증대되는 경우가 있다. 본 발명의 일 형태는 회로 면적이 축소된 표시 장치를 제공하는 것을 과제 중 하나로 한다. 또는 본 발명의 일 형태는 소비 전력이 저감된 표시 장치를 제공하는 것을 과제 중 하나로 한다. 또는 본 발명의 일 형태는 표시 품질이 높은 표시 장치를 제공하는 것을 과제 중 하나로 한다. 또는 본 발명의 일 형태는 신규 반도체 장치를 제공하는 것을 과제 중 하나로 한다. 또는 본 발명의 일 형태는 상술한 반도체 장치 중 어느 것을 포함한 시스 템을 제공하는 것을 과제 중 하나로 한다. 또한 본 발명의 일 형태의 과제는 위에서 열거한 과제에 한정되지 않는다. 위에서 열거한 과제는 다른 과제의 존재를 방해하는 것이 아니다. 또한 다른 과제는 이하에 기재되고 본 항목에서는 언급되지 않은 과제이다. 본 항목에서 언급되지 않은 과제는 통상의 기술자라면 명세서 또는 도면 등의 기재에서 도출할 수 있는 것이고, 이 들 기재에서 적절히 추출할 수 있다. 또한 본 발명의 일 형태는 위에서 열거한 과제 및 다른 과제 중 적어도 하나의 과제를 해결하는 것이다. 또한 본 발명의 일 형태는 위에서 열거한 과제 및 다른 과제 모두를 해결할 필요는 없다."}
{"patent_id": "10-2023-7018044", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 형태는 제 1 층과 표시부를 포함하는 표시 시스템이다. 또한 표시부는 제 1 층과 중첩하는 영역에 위치한다. 제 1 층은 실리콘을 재료로 한 반도체 기판을 포함하고, 제 1 층은 실리콘을 채널 형성 영역 에 포함하는 복수의 제 1 트랜지스터 및 복수의 제 2 트랜지스터를 포함한다. 제 1 층은 제 1 회로와 제 2 회 로를 포함하고, 제 1 회로는 각각에 제 1 트랜지스터가 포함되는 소스 드라이버 회로 및 게이트 드라이버 회로 를 포함하고, 제 2 회로는 각각에 제 2 트랜지스터가 포함되는 기억 장치와, CPU와, GPU와, EL 보정 회로와, 타 이밍 컨트롤러와, 고주파 회로를 포함한다. 표시부는 화소를 포함하고, 화소는 유기 EL를 포함한 발광 디바이 스를 포함한다. 또한 화소는 소스 드라이버 회로와 게이트 드라이버 회로에 전기적으로 접속되어 있다. 기억 장치는 화상 데이터를 유지하는 기능을 갖고, CPU는 기억 장치와, GPU와, EL 보정 회로와, 타이밍 컨트롤러와, 고주파 회로 중에서 선택된 하나 또는 2개 이상에 제어 신호를 송신하는 기능을 갖고, GPU는 기억 장치로부터 판독된 화상 데이터를 디코딩하는 기능을 갖고, 소스 드라이버 회로는 디코딩된 화상 데이터를 화소에 송신하는 기능을 갖고, EL 보정 회로는 발광 디바이스가 발광하는 광의 휘도를 보정하는 기능을 갖고, 타이밍 컨트롤러는 표시부에 화상을 표시할 때의 프레임 레이트를 증감하는 기능을 갖는다. 또한 고주파 회로는 CPU, GPU, 및 기 억 장치 중 어느 하나에서 생성된 전기 신호를 RF 신호로 변환하여 외부로 송신하는 기능과, 외부로부터 취득한 RF 신호를 전기 신호로 변환하여 CPU, GPU, 및 기억 장치 중 어느 하나로 송신하는 기능을 갖는다. 또는 본 발명의 일 형태는 제 1 층과 표시부를 포함하는 표시 시스템이다. 또한 표시부는 제 1 층과 중첩 하는 영역에 위치한다. 제 1 층은 실리콘을 재료로 한 반도체 기판을 포함하고, 제 1 층은 실리콘을 채널 형성 영역에 포함하는 복수의 제 1 트랜지스터 및 복수의 제 2 트랜지스터를 포함한다. 제 1 층은 제 1 회로와 제 2 회로를 포함하고, 제 1 회로는 각각에 제 1 트랜지스터가 포함되는 소스 드라이버 회로 및 게이트 드라이버 회 로를 포함하고, 제 2 회로는 각각에 제 2 트랜지스터가 포함되는 기억 장치와, GPU와, EL 보정 회로와, 타이밍 컨트롤러를 포함한다. 표시부는 화소를 포함하고, 화소는 유기 EL를 포함한 발광 디바이스를 포함한다. 또한 화소는 소스 드라이버 회로와 게이트 드라이버 회로에 전기적으로 접속되어 있다. 기억 장치는 화상 데이터를 유지하는 기능을 갖고, GPU는 기억 장치로부터 판독된 화상 데이터를 디코딩하는 기능을 갖고, 소스 드라이버 회로는 디코딩된 화상 데이터를 화소에 송신하는 기능을 갖고, EL 보정 회로는 발광 디바이스가 발광하는 광의 휘도를 보정하는 기능을 갖고, 타이밍 컨트롤러는 표시부에 화상을 표시할 때의 프레임 레이트를 증감하는 기능 을 갖는다. 또는 본 발명의 일 형태는 제 1 층과, 제 2 층과, 표시부를 포함하는 표시 시스템이다. 또한 표시부는 제 1 층과 중첩하는 영역에 위치하고, 제 2 층은 제 1 층과 중첩하는 영역에 위치한다. 제 1 층은 실리콘을 재료 로 한 반도체 기판을 포함하고, 제 1 층은 실리콘을 채널 형성 영역에 포함하는 복수의 제 1 트랜지스터 및 복수의 제 2 트랜지스터를 포함한다. 또한 제 2 층은 금속 산화물을 채널 형성 영역에 포함하는 복수의 제 3 트 랜지스터를 포함한다. 제 1 층은 제 1 회로와 제 2 회로를 포함하고, 제 1 회로는 각각에 제 1 트랜지스터가 포함되는 소스 드라이버 회로 및 게이트 드라이버 회로를 포함하고, 제 2 회로는 각각에 제 2 트랜지스터가 포 함되는 기억 장치와, GPU와, EL 보정 회로와, 타이밍 컨트롤러를 포함한다. 또한 제 3 트랜지스터는 제 1 층에 포함되는 기억 장치가 포함한 트랜지스터로서 기능한다. 표시부는 화소를 포함하고, 화소는 유기 EL를 포함한 발광 디바이스를 포함한다. 또한 화소는 소스 드라이버 회로와 게이트 드라이버 회로에 전기적으로 접속되어 있다. 기억 장치는 화상 데이터를 유지하는 기능을 갖고, GPU는 기억 장치로부터 판독된 화상 데이터를 디코딩 하는 기능을 갖고, 소스 드라이버 회로는 디코딩된 화상 데이터를 화소에 송신하는 기능을 갖고, EL 보정 회로 는 발광 디바이스가 발광하는 광의 휘도를 보정하는 기능을 갖고, 타이밍 컨트롤러는 표시부에 화상을 표시할 때의 프레임 레이트를 증감하는 기능을 갖는다. 또는 본 발명의 일 형태는, 상기 에서, 제 2 층이 메모리 셀을 포함하는 구성으로 하여도 좋다. 또는 본 발명의 일 형태는, 상기 내지 중 어느 하나에서, 제 2 회로가 제 2 트랜지스터를 포함한 CPU를 포함하는 구성으로 하여도 좋다. 또는 CPU는 기억 장치와, GPU와, EL 보정 회로와, 타이밍 컨트롤러 중 에서 선택된 하나 또는 2개 이상에 제어 신호를 송신하는 기능을 갖는 것이 바람직하다. 또는 본 발명의 일 형태는, 상기 내지 중 어느 하나에서, GPU가 인공 뉴럴 네트워크의 연산을 수행 하고, 표시부에 표시된 화상을 연산의 결과에 기초하여 보정하는 기능을 갖는 구성으로 하여도 좋다. 또는 본 발명의 일 형태는 상기 내지 중 어느 하나의 표시 시스템과, 하우징을 포함하는 전자 기기 이다. 또한 본 명세서 등에서 반도체 장치란, 반도체 특성을 이용한 장치이고, 반도체 소자(트랜지스터, 다이오드, 포 토다이오드 등)를 포함한 회로, 이 회로를 포함한 장치 등을 말한다. 또한 반도체 특성을 이용함으로써 기능할 수 있는 장치 전반을 말한다. 예를 들어 집적 회로, 집적 회로를 포함한 칩, 및 패키지에 칩을 수납한 전자 부 품은 반도체 장치의 일례이다. 또한 기억 장치, 표시 장치, 발광 장치, 조명 장치, 및 전자 기기 등은 그 자체 가 반도체 장치인 경우가 있고, 반도체 장치를 포함하는 경우가 있다. 또한 본 명세서 등에서 X와 Y가 접속된다고 기재되는 경우에는, X와 Y가 전기적으로 접속되는 경우와, X와 Y가 기능적으로 접속되는 경우와, X와 Y가 직접 접속되는 경우가 본 명세서 등에 개시되어 있는 것으로 한다. 따라 서 소정의 접속 관계, 예를 들어 도면 또는 문장에 나타낸 접속 관계에 한정되지 않고, 도면 또는 문장에 나타 낸 접속 관계 이외의 것도 도면 또는 문장에 개시되어 있는 것으로 한다. X, Y는 대상물(예를 들어 장치, 소자, 회로, 배선, 전극, 단자, 도전막, 층 등)인 것으로 한다. X와 Y가 전기적으로 접속되는 경우에는, 일례로서 X와 Y를 전기적으로 접속할 수 있는 소자(예를 들어 스위치, 트랜지스터, 용량 소자, 인덕터, 저항 소자, 다이오드, 표시 디바이스, 발광 디바이스, 부하 등)가 X와 Y 사이 에 하나 이상 접속될 수 있다. 또한 스위치는 온과 오프가 제어되는 기능을 갖는다. 즉 스위치는 도통 상태 (온 상태) 또는 비도통 상태(오프 상태)가 되어, 전류를 흘릴지 여부를 제어하는 기능을 갖는다. X와 Y가 기능적으로 접속되는 경우에는, 일례로서 X와 Y를 기능적으로 접속할 수 있는 회로(예를 들어 논리 회 로(인버터, NAND 회로, NOR 회로 등), 신호 변환 회로(디지털 아날로그 변환 회로, 아날로그 디지털 변환 회로, 감마 보정 회로 등), 전위 레벨 변환 회로(전원 회로(승압 회로, 강압 회로 등), 신호의 전위 레벨을 바꾸는 레 벨 시프터 회로 등), 전압원, 전류원, 전환 회로, 증폭 회로(신호 진폭 또는 전류량 등을 크게 할 수 있는 회로, 연산 증폭기, 차동 증폭 회로, 소스 폴로어 회로, 버퍼 회로 등), 신호 생성 회로, 기억 회로, 제어 회로 등)가 X와 Y 사이에 하나 이상 접속될 수 있다. 또한 일례로서, X와 Y 사이에 다른 회로를 끼워도 X로부터 출 력된 신호가 Y로 전달되는 경우에는, X와 Y는 기능적으로 접속되는 것으로 한다. 또한 X와 Y가 전기적으로 접속된다고 명시적으로 기재되는 경우에는, X와 Y가 전기적으로 접속되는 경우(즉 X와 Y가 사이에 다른 소자 또는 다른 회로를 끼워 접속되는 경우)와, X와 Y가 직접 접속되는 경우(즉 X와 Y가 사이 에 다른 소자 또는 다른 회로를 끼우지 않고 접속되는 경우)를 포함하는 것으로 한다. 또한 예를 들어 \"X와, Y와, 트랜지스터의 소스(또는 제 1 단자 등)와, 드레인(또는 제 2 단자 등)은 서로 전기 적으로 접속되고, X, 트랜지스터의 소스(또는 제 1 단자 등), 트랜지스터의 드레인(또는 제 2 단자 등), Y의 순 서로 전기적으로 접속된다\"라고 표현할 수 있다. 또는 \"트랜지스터의 소스(또는 제 1 단자 등)는 X에 전기적으 로 접속되고, 트랜지스터의 드레인(또는 제 2 단자 등)은 Y에 전기적으로 접속되고, X, 트랜지스터의 소스(또는 제 1 단자 등), 트랜지스터의 드레인(또는 제 2 단자 등), Y는 이 순서대로 전기적으로 접속된다\"라고 표현할수 있다. 또는 \"X는 트랜지스터의 소스(또는 제 1 단자 등)와 드레인(또는 제 2 단자 등)을 통하여 Y에 전기적 으로 접속되고, X, 트랜지스터의 소스(또는 제 1 단자 등), 트랜지스터의 드레인(또는 제 2 단자 등), Y는 이 접속 순서로 제공된다\"라고 표현할 수 있다. 이들 예와 같은 표현 방법을 사용하여 회로 구성에서의 접속 순서 에 대하여 규정함으로써, 트랜지스터의 소스(또는 제 1 단자 등)와 드레인(또는 제 2 단자 등)을 구별하여 기술 적 범위를 결정할 수 있다. 또한 이들 표현 방법은 일례이고, 이들 표현 방법에 한정되지 않는다. 여기서 X, Y는 대상물(예를 들어 장치, 소자, 회로, 배선, 전극, 단자, 도전막, 층 등)인 것으로 한다. 또한 회로도상 독립된 구성 요소들이 전기적으로 접속되는 것처럼 도시되어 있는 경우에도, 하나의 구성 요소가 복수의 구성 요소의 기능을 겸비하는 경우도 있다. 예를 들어 배선의 일부가 전극으로서도 기능하는 경우에는, 하나의 도전막이 배선의 기능 및 전극의 기능의 양쪽의 구성 요소의 기능을 겸비한다. 따라서 본 명세서에서의 전기적인 접속이란, 이와 같이 하나의 도전막이 복수의 구성 요소의 기능을 겸비하는 경우도 그 범주에 포함한 다. 또한 본 명세서 등에서 \"저항 소자\"란, 예를 들어 0Ω보다 저항값이 높은 회로 소자, 0Ω보다 저항값이 높은 배 선 등으로 할 수 있다. 그러므로 본 명세서 등에서 \"저항 소자\"는 저항값을 갖는 배선, 소스와 드레인 간을 전 류가 흐르는 트랜지스터, 다이오드, 코일 등을 포함하는 것으로 한다. 그러므로 \"저항 소자\"라는 용어는 \"저항\", \"부하\", \"저항값을 갖는 영역\" 등의 용어로 바꿔 말할 수 있는 경우가 있다. 반대로 \"저항\", \"부하\", \"저항값을 갖는 영역\"이라는 용어는 \"저항 소자\" 등의 용어로 바꿔 말할 수 있는 경우가 있다. 저항값은 예를 들어 바람직하게는 1mΩ 이상 10Ω 이하, 더 바람직하게는 5mΩ 이상 5Ω 이하, 더욱 바람직하게는 10mΩ 이상 1Ω 이하로 할 수 있다. 또한 예를 들어 1Ω 이상 1×109Ω 이하로 하여도 좋다. 또한 본 명세서 등에서 \"용량 소자\"는, 예를 들어 정전 용량이 0F보다 높은 회로 소자, 정전 용량이 0F보다 높 은 배선의 영역, 기생 용량, 트랜지스터의 게이트 용량 등으로 할 수 있다. 또한 \"용량 소자\", \"기생 용량\", \"게이트 용량\" 등이라는 용어는 \"용량\" 등의 용어로 바꿔 말할 수 있는 경우가 있다. 반대로 \"용량\"이라는 용 어는 \"용량 소자\", \"기생 용량\", \"게이트 용량\" 등의 용어로 바꿔 말할 수 있는 경우가 있다. 또한 \"용량\"의 \"한 쌍의 전극\"이라는 용어는 \"한 쌍의 도전체\", \"한 쌍의 도전 영역\", \"한 쌍의 영역\" 등으로 바꿔 말할 수 있는 경우가 있다. 또한 정전 용량은 예를 들어 0.05fF 이상 10pF 이하로 할 수 있다. 또한 예를 들어 1pF 이 상 10μF 이하로 하여도 좋다. 또한 본 명세서 등에서 트랜지스터는 게이트, 소스, 및 드레인이라고 불리는 3개의 단자를 포함한다. 게이트는 트랜지스터의 도통 상태를 제어하는 제어 단자이다. 소스 또는 드레인으로서 기능하는 2개의 단자는 트랜지스 터의 입출력 단자이다. 2개의 입출력 단자는 트랜지스터의 도전형(n채널형, p채널형) 및 트랜지스터의 3개의 단자에 인가되는 전위의 높낮이에 따라, 한쪽이 소스가 되고 다른 쪽이 드레인이 된다. 그러므로 본 명세서 등 에서는, 소스 및 드레인이라는 용어는 서로 바꿔 말할 수 있는 경우가 있다. 또한 본 명세서 등에서는, 트랜지 스터의 접속 관계를 설명하는 경우, \"소스 및 드레인 중 한쪽\"(또는 제 1 전극 또는 제 1 단자), \"소스 및 드레 인 중 다른 쪽\"(또는 제 2 전극 또는 제 2 단자)이라는 표기를 사용한다. 또한 트랜지스터의 구조에 따라서는 상술한 3개의 단자에 더하여 백 게이트를 포함하는 경우가 있다. 이 경우, 본 명세서 등에서 트랜지스터의 게 이트 및 백 게이트 중 한쪽을 제 1 게이트라고 부르고, 트랜지스터의 게이트 및 백 게이트 중 다른 쪽을 제 2 게이트라고 부르는 경우가 있다. 또한 같은 트랜지스터에서 \"게이트\"와 \"백 게이트\"라는 용어는 서로 바꿀 수 있는 경우가 있다. 또한 트랜지스터가 3개 이상의 게이트를 포함하는 경우, 본 명세서 등에서는 각 게이트를 제 1 게이트, 제 2 게이트, 제 3 게이트 등이라고 부를 수 있다. 예를 들어 본 명세서 등에서 트랜지스터의 일례로서는, 2개 이상의 게이트 전극을 포함한 멀티 게이트 구조의 트랜지스터를 사용할 수 있다. 멀티 게이트 구조로 하면, 채널 형성 영역이 직렬로 접속되기 때문에, 복수의 트랜지스터가 직렬로 접속된다. 따라서 멀티 게이트 구조로 하면, 오프 전류의 감소, 트랜지스터의 내압 향상 (신뢰성 향상)을 도모할 수 있다. 또는 멀티 게이트 구조로 하면, 포화 영역에서 동작할 때, 드레인과 소스 사 이의 전압이 변화되어도 드레인과 소스 사이의 전류가 그다지 변화되지 않기 때문에, 기울기가 평평한 전압-전 류 특성을 얻을 수 있다. 기울기가 평평한 전압-전류 특성을 이용하면, 이상적인 전류원 회로 또는 저항값이 매우 높은 능동 부하를 실현할 수 있다. 그 결과, 특성이 좋은 차동 회로 또는 커런트 미러 회로 등을 실현할 수 있다. 또한 회로도에서 단일의 회로 소자가 도시되어 있는 경우에도 상기 회로 소자가 복수의 회로 소자를 포함하는 경우가 있다. 예를 들어 회로도에서 하나의 저항 소자가 도시되어 있는 경우에는 2개 이상의 저항 소자가 직렬 로 전기적으로 접속되어 있는 경우를 포함하는 것으로 한다. 또한 예를 들어 회로도에서 하나의 용량 소자가도시되어 있는 경우에는 2개 이상의 용량 소자가 병렬로 전기적으로 접속되어 있는 경우를 포함하는 것으로 한 다. 또한 예를 들어 회로도에서 하나의 트랜지스터가 도시되어 있는 경우에는 2개 이상의 트랜지스터가 직렬로 전기적으로 접속되고, 또한 각 트랜지스터의 게이트가 서로 전기적으로 접속되어 있는 경우를 포함하는 것으로 한다. 또한 이와 마찬가지로 예를 들어 회로도에서 하나의 스위치가 도시되어 있는 경우에는 상기 스위치가 2 개 이상의 트랜지스터를 포함하고, 2개 이상의 트랜지스터가 직렬 또는 병렬로 전기적으로 접속되고, 각 트랜지 스터의 게이트가 서로 전기적으로 접속되어 있는 경우를 포함하는 것으로 한다. 또한 본 명세서 등에서 노드는 회로 구성 또는 디바이스 구조에 따라 단자, 배선, 전극, 도전층, 도전체, 불순 물 영역 등으로 바꿔 말할 수 있다. 또한 단자, 배선 등을 노드로 바꿔 말할 수 있다. 또한 본 명세서 등에서 \"전압\"과 \"전위\"는 적절히 바꿔 말할 수 있다. \"전압\"은 기준이 되는 전위와의 전위차 를 말하고, 예를 들어 기준이 되는 전위를 그라운드 전위(접지 전위)로 하면, \"전압\"을 \"전위\"로 바꿔 말할 수 있다. 또한 그라운드 전위는 반드시 0V를 의미하는 것은 아니다. 또한 전위는 상대적인 것이고, 기준이 되는 전위가 변화됨으로써, 배선에 공급되는 전위, 회로 등에 인가되는 전위, 회로 등으로부터 출력되는 전위 등도 변화된다. 또한 본 명세서 등에서 \"고레벨 전위\", \"저레벨 전위\"라는 용어는 특정의 전위를 의미하는 것은 아니다. 예를 들어 2개의 배선의 양쪽이 \"고레벨 전위를 공급하는 배선으로서 기능한다\"라고 기재되는 경우, 양쪽의 배선이 공급하는 각 고레벨 전위는 서로 같지 않아도 된다. 또한 이와 마찬가지로 2개의 배선의 양쪽이 \"저레벨 전위 를 공급하는 배선으로서 기능한다\"라고 기재되는 경우, 양쪽의 배선이 공급하는 각 저레벨 전위는 서로 같지 않 아도 된다. \"전류\"란 전하의 이동 현상(전기 전도)을 말하고, 예를 들어 \"양의 하전체(荷電體)의 전기 전도가 발생하고 있 다\"라는 기재는, \"그 반대 방향으로 음의 하전체의 전기 전도가 발생하고 있다\"라고 바꿔 말할 수 있다. 그러 므로 본 명세서 등에서 \"전류\"란 별도의 설명이 없는 한, 캐리어의 이동에 따른 전하의 이동 현상(전기 전도)을 말하는 것으로 한다. 여기서 캐리어란 전자, 정공, 음이온, 양이온, 착이온 등이고, 전류가 흐르는 시스템(예 를 들어 반도체, 금속, 전해액, 진공 중 등)에 따라 캐리어가 다르다. 또한 배선 등에서의 \"전류의 방향\"은 양 전하를 띤 캐리어가 이동하는 방향이고, 양의 전류량으로 기재한다. 바꿔 말하면, 음전하를 띤 캐리어가 이동 하는 방향은 전류의 방향과 반대 방향이고, 음의 전류량으로 표현된다. 따라서 본 명세서 등에서 전류의 양과 음(또는 전류의 방향)에 대하여 별도의 설명이 없는 경우, \"소자 A로부터 소자 B로 전류가 흐른다\" 등의 기재는 \"소자 B로부터 소자 A로 전류가 흐른다\" 등으로 바꿔 말할 수 있는 것으로 한다. 또한 \"소자 A에 전류가 입력 된다\" 등의 기재는 \"소자 A로부터 전류가 출력된다\" 등으로 바꿔 말할 수 있는 것으로 한다. 또한 본 명세서 등에서 \"제 1\", \"제 2\", \"제 3\"이라는 서수사는 구성 요소의 혼동을 피하기 위하여 붙인 것이다. 따라서 구성 요소의 개수를 한정하는 것이 아니다. 또한 구성 요소의 순서를 한정하는 것이 아니다. 예를 들어 본 명세서 등의 실시형태 중 하나에서 \"제 1\"로 언급된 구성 요소가 다른 실시형태 또는 청구범위에 서 \"제 2\"로 언급된 구성 요소가 될 수도 있다. 또한 예를 들어 본 명세서 등의 실시형태 중 하나에서 \"제 1\" 로 언급된 구성 요소가 다른 실시형태 또는 청구범위에서 생략될 수도 있다. 또한 본 명세서 등에서 \"위에\", \"아래에\" 등의 배치를 나타내는 용어는 구성끼리의 위치 관계를 도면을 참조하 여 설명하기 위하여 편의상 사용하고 있는 경우가 있다. 또한 구성끼리의 위치 관계는 각 구성을 묘사하는 방 향에 따라 적절히 변화된다. 따라서 명세서 등에서 설명한 용어에 한정되지 않고, 상황에 따라 적절히 바꿔 말 할 수 있다. 예를 들어 \"도전체의 상면에 위치하는 절연체\"라는 표현은, 나타낸 도면의 방향을 180° 회전시킴 으로써, \"도전체의 하면에 위치하는 절연체\"라고 바꿔 말할 수 있다. 또한 \"위\" 또는 \"아래\"라는 용어는, 구성 요소의 위치 관계가 바로 위 또는 바로 아래이며 직접 접촉하는 것에 한정되지 않는다. 예를 들어 \"절연층(A) 위의 전극(B)\"이라는 표현이면, 절연층(A) 위에 전극(B)이 직접 접촉 되어 형성될 필요는 없고, 절연층(A)과 전극(B) 사이에 다른 구성 요소를 포함하는 것을 제외하지 않는다. 또한 본 명세서 등에서 \"막\", \"층\" 등의 용어는 상황에 따라 서로 바꿀 수 있다. 예를 들어 \"도전층\"이라는 용 어를 \"도전막\"이라는 용어로 변경할 수 있는 경우가 있다. 또는 예를 들어 \"절연막\"이라는 용어를 \"절연층\"이 라는 용어로 변경할 수 있는 경우가 있다. 또는 경우 또는 상황에 따라 \"막\", \"층\" 등의 용어를 사용하지 않고, 다른 용어로 바꿀 수 있다. 예를 들어 \"도전층\" 또는 \"도전막\"이라는 용어를 \"도전체\"라는 용어로 변경 할 수 있는 경우가 있다. 또는 예를 들어 \"절연층\", \"절연막\"이라는 용어를 \"절연체\"라는 용어로 변경할 수 있 는 경우가 있다.또한 본 명세서 등에서 \"전극\", \"배선\", \"단자\" 등의 용어는, 이들 구성 요소를 기능적으로 한정하는 것이 아니 다. 예를 들어 \"전극\"은 \"배선\"의 일부로서 사용되는 경우가 있고, 그 반대도 마찬가지이다. 또한 \"전극\" 또 는 \"배선\"이라는 용어는, 복수의 \"전극\" 또는 \"배선\"이 일체가 되어 형성되어 있는 경우 등도 포함한다. 또한 예를 들어 \"단자\"는 \"배선\" 또는 \"전극\"의 일부로서 사용되는 경우가 있고, 그 반대도 마찬가지이다. 또한 \"단 자\"라는 용어는, 복수의 \"전극\", \"배선\", \"단자\" 등이 일체가 되어 형성되어 있는 경우 등도 포함한다. 그러므 로 예를 들어 \"전극\"은 \"배선\" 또는 \"단자\"의 일부가 될 수 있고, 예를 들어 \"단자\"는 \"배선\" 또는 \"전극\"의 일 부가 될 수 있다. 또한 \"전극\", \"배선\", \"단자\" 등의 용어는 경우에 따라 \"영역\" 등의 용어로 치환되는 경우가 있다. 또한 본 명세서 등에서 \"배선\", \"신호선\", \"전원선\" 등의 용어는, 경우 또는 상황에 따라 서로 바꿀 수 있다. 예를 들어 \"배선\"이라는 용어를 \"신호선\"이라는 용어로 변경할 수 있는 경우가 있다. 또한 예를 들어 \"배선\"이 라는 용어를 \"전원선\" 등의 용어로 변경할 수 있는 경우가 있다. 또한 그 반대도 마찬가지로 \"신호선\", \"전원 선\" 등의 용어를 \"배선\"이라는 용어로 변경할 수 있는 경우가 있다. \"전원선\" 등의 용어는 \"신호선\" 등의 용어 로 변경할 수 있는 경우가 있다. 또한 그 반대도 마찬가지로 \"신호선\" 등의 용어는 \"전원선\" 등의 용어로 변경 할 수 있는 경우가 있다. 또한 배선에 인가되는 \"전위\"라는 용어를 경우 또는 상황에 따라 \"신호\" 등의 용어로 변경할 수 있는 경우가 있다. 또한 그 반대도 마찬가지로 \"신호\" 등의 용어는 \"전위\"라는 용어로 변경할 수 있 는 경우가 있다. 본 명세서 등에서 반도체의 불순물이란, 예를 들어 반도체층을 구성하는 주성분 이외의 것을 말한다. 예를 들 어 농도가 0.1atomic% 미만인 원소는 불순물이다. 불순물이 포함되면, 예를 들어 반도체의 결함 준위 밀도가 높아지거나, 캐리어 이동도가 저하되거나, 결정성이 저하되는 경우가 있다. 반도체가 산화물 반도체인 경우, 반도체의 특성을 변화시키는 불순물로서는, 예를 들어 1족 원소, 2족 원소, 13족 원소, 14족 원소, 15족 원소, 주성분 이외의 전이 금속 등이 있고, 특히 예를 들어 수소(물에도 포함됨), 리튬, 소듐, 실리콘, 붕소, 인, 탄 소, 질소 등이 있다. 구체적으로는, 반도체가 실리콘층인 경우, 반도체의 특성을 변화시키는 불순물로서는, 예 를 들어 1족 원소, 2족 원소, 13족 원소, 15족 원소 등(다만 산소, 수소는 제외함)이 있다. 본 명세서 등에서 스위치란, 도통 상태(온 상태) 또는 비도통 상태(오프 상태)가 되어 전류를 흘릴지 여부를 제 어하는 기능을 갖는 것을 말한다. 또는 스위치란, 전류를 흘리는 경로를 선택하고 전환하는 기능을 갖는 것을 말한다. 그러므로 스위치는 제어 단자와는 별도로 전류를 흘리는 단자를 2개 또는 3개 이상 포함하는 경우가 있다. 일례로서는, 전기적 스위치, 기계적 스위치 등을 사용할 수 있다. 즉 스위치는 전류를 제어할 수 있는 것이면 좋고, 특정의 것에 한정되지 않는다. 전기적 스위치의 일례로서는, 트랜지스터(예를 들어 바이폴러 트랜지스터, MOS 트랜지스터 등), 다이오드(예를 들어 PN 다이오드, PIN 다이오드, 쇼트키 다이오드, MIM(Metal Insulator Metal) 다이오드, MIS(Metal Insulator Semiconductor) 다이오드, 다이오드 접속의 트랜지스터 등), 또는 이들을 조합한 논리 회로 등이 있 다. 또한 스위치로서 트랜지스터를 사용하는 경우, 트랜지스터의 \"도통 상태\"란 예를 들어 트랜지스터의 소스 전극과 드레인 전극이 전기적으로 단락되어 있다고 간주할 수 있는 상태, 소스 전극과 드레인 전극 사이에 전류 를 흘릴 수 있는 상태를 말한다. 또한 트랜지스터의 \"비도통 상태\"란 트랜지스터의 소스 전극과 드레인 전극이 전기적으로 차단되어 있다고 간주할 수 있는 상태를 말한다. 또한 트랜지스터를 단순히 스위치로서 동작시키는 경우에는, 트랜지스터의 극성(도전형)은 특별히 한정되지 않는다. 기계적 스위치의 일례로서는, MEMS(micro electro mechanical systems) 기술을 사용한 스위치가 있다. 그 스 위치는 기계적으로 동작시킬 수 있는 전극을 포함하고, 그 전극의 움직임에 따라 도통과 비도통을 제어하여 동 작한다. 또한 본 명세서 등에서, 메탈 마스크 또는 FMM(파인 메탈 마스크, 고정세 메탈 마스크)을 사용하여 제작되는 디 바이스를 MM(메탈 마스크) 구조의 디바이스라고 부르는 경우가 있다. 또한 본 명세서 등에서, 메탈 마스크 또 는 FMM을 사용하지 않고 제작되는 디바이스를 MML(메탈 마스크리스) 구조의 디바이스라고 부르는 경우가 있다. 또한 본 명세서 등에서, 각 색의 발광 디바이스(여기서는 청색(B), 녹색(G), 및 적색(R))의 발광층을 구분하여 형성하거나 개별 도포하는 구조를 SBS(Side By Side) 구조라고 부르는 경우가 있다. 또한 본 명세서 등에서, 백색광을 방출할 수 있는 발광 디바이스를 백색 발광 디바이스라고 부르는 경우가 있다. 또한 백색 발광 디바 이스는 착색층(예를 들어 컬러 필터)과 조합함으로써, 풀 컬러 표시의 표시 장치로 할 수 있다. 또한 발광 디바이스는 싱글 구조와 탠덤 구조로 크게 나눌 수 있다. 싱글 구조의 디바이스는 한 쌍의 전극 사 이에 하나의 발광 유닛을 갖고, 상기 발광 유닛은 1개 이상의 발광층을 포함하는 구성으로 하는 것이 바람직하 다. 백색 발광을 얻기 위해서는, 2개 이상의 발광층의 각 발광이 보색의 관계가 되는 발광층을 선택하면 좋다. 예를 들어, 제 1 발광층의 발광색과 제 2 발광층의 발광색을 보색 관계가 되도록 함으로써, 발광 디바이스 전체 로서 백색을 발광하는 구성을 얻을 수 있다. 또한 발광층을 3개 이상 갖는 발광 디바이스의 경우도 마찬가지이 다. 탠덤 구조의 디바이스는 한 쌍의 전극 사이에 2개 이상의 복수의 발광 유닛을 갖고, 각 발광 유닛은 1개 이상의 발광층을 포함하는 구성으로 하는 것이 바람직하다. 백색 발광을 얻기 위해서는 복수의 발광 유닛의 발광층으 로부터의 광을 합성시켜 백색 발광이 얻어지는 구성으로 하면 좋다. 또한 백색 발광이 얻어지는 구성에 대해서 는, 싱글 구조의 구성과 마찬가지이다. 또한 탠덤 구조의 디바이스에서, 복수의 발광 유닛 사이에는 전하 발생 층 등의 중간층이 제공되는 것이 바람직하다. 또한 상술한 백색 발광 디바이스(싱글 구조 또는 탠덤 구조)와, SBS 구조의 발광 디바이스를 비교한 경우, SBS 구조의 발광 디바이스는 백색 발광 디바이스보다 소비 전력을 낮출 수 있다. 소비 전력을 낮게 하고자 하는 경 우에는 SBS 구조의 발광 디바이스를 사용하면 적합하다. 한편 백색 발광 디바이스는 제조 프로세스가 SBS 구조 의 발광 디바이스보다 간단하기 때문에 제조 비용을 낮게 할 수 있거나, 제조 수율을 높게 할 수 있어 적합하다. 본 명세서에서 \"평행\"이란 2개의 직선이 -10° 이상 10° 이하의 각도로 배치된 상태를 말한다. 따라서 -5° 이상 5° 이하의 경우도 포함된다. 또한 \"실질적으로 평행\" 또는 \"대략 평행\"이란 2개의 직선이 -30° 이상 30 ° 이하의 각도로 배치된 상태를 말한다. 또한 \"수직\"이란 2개의 직선이 80° 이상 100° 이하의 각도로 배치 된 상태를 말한다. 따라서 85° 이상 95° 이하의 경우도 포함된다. 또한 \"실질적으로 수직\" 또는 \"대략 수직\"이란 2개의 직선이 60° 이상 120° 이하의 각도로 배치된 상태를 말한다."}
{"patent_id": "10-2023-7018044", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 형태에 의하여, 회로 면적이 축소된 표시 장치를 제공할 수 있다. 또는 본 발명의 일 형태에 의 하여, 소비 전력이 저감된 표시 장치를 제공할 수 있다. 또는 본 발명의 일 형태에 의하여, 표시 품질이 높은 표시 장치를 제공할 수 있다. 또는 본 발명의 일 형태에 의하여, 신규 반도체 장치를 제공할 수 있다. 또는 본 발명의 일 형태에 의하여, 상술한 반도체 장치 중 어느 것을 포함한 시스템을 제공할 수 있다. 또한 본 발명의 일 형태의 효과는 위에서 열거한 효과에 한정되지 않는다. 위에서 열거한 효과는 다른 효과의 존재를 방해하는 것이 아니다. 또한 다른 효과는 이하에 기재되고 본 항목에서는 언급되지 않은 효과이다. 본 항목에서 언급되지 않은 효과는 통상의 기술자라면 명세서 또는 도면 등의 기재에서 도출할 수 있는 것이고, 이 들 기재에서 적절히 추출할 수 있다. 또한 본 발명의 일 형태는 위에서 열거한 효과 및 다른 효과 중 적어도 하나의 효과를 갖는 것이다. 따라서 본 발명의 일 형태는 경우에 따라서는 위에서 열거한 효과를 갖지 않는 경 우도 있다."}
{"patent_id": "10-2023-7018044", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서 등에서 금속 산화물(metal oxide)이란, 넓은 의미로의 금속의 산화물이다. 금속 산화물은 산화물 절 연체, 산화물 도전체(투명 산화물 도전체를 포함함), 산화물 반도체(Oxide Semiconductor 또는 단순히 OS라고도 함) 등으로 분류된다. 예를 들어 트랜지스터의 채널 형성 영역에 금속 산화물이 포함되는 경우, 상기 금속 산 화물을 산화물 반도체라고 하는 경우가 있다. 즉 금속 산화물이 증폭 작용, 정류 작용, 및 스위칭 작용 중 적 어도 하나를 갖는 트랜지스터의 채널 형성 영역을 구성할 수 있는 경우, 상기 금속 산화물을 금속 산화물 반도 체(metal oxide semiconductor)라고 할 수 있다. 또한 OS 트랜지스터라고 기재하는 경우에는, 금속 산화물 또 는 산화물 반도체를 포함하는 트랜지스터로 바꿔 말할 수 있다. 또한 본 명세서 등에서, 질소를 포함하는 금속 산화물도 금속 산화물(metal oxide)이라고 총칭하는 경우가 있다. 또한 질소를 포함하는 금속 산화물을 금속 산질화물(metal oxynitride)이라고 하여도 좋다. 또한 본 명세서 등에서 각 실시형태에 기재된 구성은 다른 실시형태에 기재된 구성과 적절히 조합하여 본 발명 의 일 형태로 할 수 있다. 또한 하나의 실시형태에 복수의 구성예가 기재되는 경우에는, 구성예를 서로 적절히 조합할 수 있다. 또한 어떤 하나의 실시형태에서 설명하는 내용(일부 내용이어도 좋음)은, 그 실시형태에서 설명하는 다른 내용 (일부 내용이어도 좋음)과, 하나 또는 복수의 다른 실시형태에서 설명하는 내용(일부 내용이어도 좋음) 중 적어 도 하나의 내용에 대하여 적용, 조합, 또는 치환 등을 할 수 있다. 또한 실시형태에서 설명하는 내용이란, 각 실시형태에서 다양한 도면을 사용하여 설명하는 내용, 또는 명세서에 기재되는 문장을 사용하여 설명하는 내용을 말한다. 또한 어떤 하나의 실시형태에서 제시하는 도면(일부이어도 좋음)은 그 도면의 다른 부분, 그 실시형태에서 제시 하는 다른 도면(일부이어도 좋음), 하나 또는 복수의 다른 실시형태에서 제시하는 도면(일부이어도 좋음) 중 적 어도 하나의 도면과 조합함으로써 더 많은 도면을 구성할 수 있다. 본 명세서에 기재되는 실시형태에 대하여 도면을 참조하여 설명한다. 다만 실시형태는 많은 상이한 형태로 실 시할 수 있고, 취지 및 그 범위에서 벗어남이 없이 그 형태 및 자세한 사항을 다양하게 변경할 수 있다는 것은 통상의 기술자라면 용이하게 이해할 수 있다. 따라서 본 발명은 실시형태의 기재 내용에 한정하여 해석되는 것은 아니다. 또한 실시형태의 발명의 구성에서 동일한 부분 또는 같은 기능을 갖는 부분에는 동일한 부호를 상 이한 도면 사이에서 공통적으로 사용하고, 이의 반복적인 설명은 생략하는 경우가 있다. 또한 사시도 등에서는, 도면의 명확성을 기하기 위하여 일부의 구성 요소의 기재를 생략하는 경우가 있다. 본 명세서 등에서 복수의 요소에 같은 부호를 사용하고, 이들을 특별히 구별할 필요가 있는 경우에는, 부호에 \"_1\", \"[n]\", \"[m, n]\" 등의 식별용 부호를 붙여서 기재하는 경우가 있다. 또한 도면 등에서 부호에 \"_1\", \"[n]\", \"[m, n]\" 등의 식별용 부호를 붙여서 기재하고, 본 명세서 등에서 이들을 구별할 필요가 없는 경우에는, 식별용 부호를 기재하지 않는 경우가 있다. 또한 본 명세서의 도면에서 크기, 층의 두께, 또는 영역은 명료화를 위하여 과장되어 있는 경우가 있다. 따라 서 그 스케일에 반드시 한정되는 것은 아니다. 또한 도면은 이상적인 예를 모식적으로 나타낸 것이고, 도면에 나타낸 형상 또는 값 등에 한정되지 않는다. 예를 들어 노이즈에 기인한 신호, 전압, 또는 전류의 편차, 혹은 타이밍의 어긋남으로 인한 신호, 전압, 또는 전류의 편차 등을 포함할 수 있다. (실시형태 1) 본 실시형태에서는, 본 발명의 일 형태의 표시 장치 및 표시 시스템에 대하여 설명한다. <표시 장치의 구성예> 도 1의 (A)는 본 발명의 일 형태의 표시 장치를 모식적으로 나타낸 도면이다. 도 1의 (A)에 나타낸 표시 장치 는 표시부(DSP)와 회로부(SIC)를 포함한다. 또한 표시 장치는 기판 위에 회로부(SIC)가 형성되고 회 로부(SIC) 위에 표시부(DSP)가 형성된 구성을 갖는다. 표시부(DSP)는 표시 장치에서 화상을 표시하는 영역을 포함하고, 회로부(SIC)로부터 송신되는 데이터 신호 에 기초하여 화상을 표시하는 기능을 갖는다. 또한 표시부(DSP)에서는 화소가 규칙적으로 배열되어 있다. 예 를 들어 표시부(DSP)의 화소는 매트릭스로 배열되어도 좋다. 또한 표시부(DSP)의 복수의 화소의 배열은 스트라 이프 배열로 하여도 좋고, 모자이크 배열로 하여도 좋고, 델타 배열로 하여도 좋다. 그러므로 본 실시형태에서 는 표시부(DSP)를 화소 어레이라고 부르는 경우가 있다. 또한 표시부(DSP)의 화면 비율(종횡비)에 특별한 한정 은 없다. 예를 들어 표시부(DSP)로서 1:1(정방형), 4:3, 16:9, 16:10 등 다양한 화면 비율에 대응할 수 있다. 회로부(SIC)는 표시 장치에서의 소스 드라이버 회로, 게이트 드라이버 회로, 디지털 아날로그 변환 회로, 및 레벨 시프터를 포함한 주변 회로(DRV)를 포함한다. 즉 주변 회로(DRV)는 표시부(DSP)에 화상을 표시하기 위 한 구동 회로로서 기능한다. 회로부(SIC)는 일례로서 기판 위에 트랜지스터, 용량 소자 등을 제공하여 구성할 수 있다. 상기 기판으로서는 실리콘, 저마늄 등을 재료로 한 반도체 기판(예를 들어 단결정 기판)을 사용할 수 있다. 또한 반도체 기판 외 에, 예를 들어 SOI(Silicon On Insulator) 기판, 유리 기판, 석영 기판, 플라스틱 기판, 사파이어 유리 기판, 금속 기판, 스테인리스·스틸 기판, 스테인리스·스틸·포일을 포함한 기판, 텅스텐 기판, 텅스텐·포일을 포함 한 기판, 가요성 기판, 접합 필름, 섬유상 재료를 포함한 종이, 또는 기재 필름 등을 사용할 수 있다. 유리 기 판의 일례로서는, 바륨보로실리케이트 유리, 알루미노보로실리케이트 유리, 또는 소다 석회 유리 등이 있다. 가요성 기판, 접합 필름, 기재 필름 등의 일례로서는 이하의 것을 들 수 있다. 예를 들어 폴리에틸렌테레프탈 레이트(PET), 폴리에틸렌나프탈레이트(PEN), 폴리에터설폰(PES), 폴리테트라플루오로에틸렌(PTFE)으로 대표되는 플라스틱이 있다. 또는 일례로서는, 아크릴 등의 합성 수지 등이 있다. 또는 일례로서는, 폴리프로필렌, 폴리 에스터, 폴리플루오린화 바이닐, 또는 폴리염화 바이닐 등이 있다. 또는 일례로서는, 폴리아마이드, 폴리이미 드, 아라미드, 에폭시 수지, 무기 증착 필름, 또는 종이류 등이 있다. 또한 표시 장치의 제작 공정에 가 열 처리가 포함되는 경우에는, 기판으로서 열에 대한 내성이 높은 재료를 선택하는 것이 바람직하다. 본 실시형태에서는, 회로부(SIC)에 포함되는 기판이 실리콘 등을 재료로서 포함한 반도체 기판인 것으로 가정하 여 설명을 한다. 회로부(SIC)에 포함되는 기판을 예를 들어 실리콘을 재료로서 포함한 반도체 기판으로 함으로써, 주변 회로 (DRV)에 포함되는 트랜지스터를 상기 반도체 기판에 형성할 수 있다. 이때 상기 트랜지스터는 채널 형성 영역 에 실리콘을 포함한 트랜지스터(이하 Si 트랜지스터라고 부름)이다. Si 트랜지스터는 전계 효과 이동도가 높기 때문에 큰 온 전류를 흘릴 수 있다. 이에 의하여, 주변 회로(DRV)의 구동 속도를 빠르게 하거나 신호의 레인지 를 넓힐 수 있다. 또한 회로부(SIC)로서 단결정 실리콘을 포함하는 재료를 사용하는 경우, 회로부(SIC)의 크기로서는 대각 0.1인 치 이상 5인치 이하, 바람직하게는 대각 0.5치 이상 3인치 이하, 더 바람직하게는 대각 1인치 이상 2인치 이하 로 할 수 있다. 또한 회로부(SIC) 상방에 표시부(DSP)가 제공되기 때문에 표시부(DSP)의 크기는 회로부(SIC)의 크기에 따라 결정할 수 있다. 또한 표시부(DSP)로부터 사출되는 광의 양은 표시부(DSP)의 크기에 의존한다. 예를 들어 회로부(SIC)의 크기를 대각 1인치로 한 경우, 대각 0.5인치 크기의 4배 정도의 광의 양을 표시부 (DSP)로부터 추출할 수 있어 바람직하다. <표시 시스템의 구성예> 다음으로 본 발명의 일 형태의 표시 시스템에 대하여 설명한다. 도 1의 (B)는 본 발명의 일 형태의 표시 시스템을 모식적으로 나타낸 도면이다. 도 1의 (B)에 나타낸 표시 시 스템은 도 1의 (A)의 표시 장치의 회로부(SIC)에 기능 회로(MFNC)가 제공된 점에서 표시 장치와 다르다. 그러므로 도 1의 (B)의 표시 시스템의 표시부(DSP)와 주변 회로(DRV)에 대해서는 도 1의 (A)의 표시 장치의 기재를 참조한다. 또한 본 명세서 등에서, 표시 시스템이란 표시 장치에 기능 회로가 제공된 구성을 말한다. 또한 표시 시스템은 화상을 표시하는 구성을 갖기 때문에 표시 시스템을 표시 장치로 바꿔 말할 수 있는 것으로 한다. 기능 회로(MFNC)에는 예를 들어 표시부(DSP)에 표시하기 위한 화상 데이터가 저장되는 기억 장치, 인코딩된 화 상을 복원하기 위한 디코더, 화상 데이터를 처리하기 위한 GPU(Graphics Processing Unit), 전원 회로, 보정 회 로, CPU(Central Processing Unit) 등을 제공할 수 있다. 구체적인 구성예로서, 도 2에 표시 시스템의 블록도를 나타내었다. 또한 도 2에서 굵은 배선(예를 들어 배선(GL), 배선(SL), 및 배선(BSL))은 복수의 배선 또는 버스 배선을 나타 낸 것이다. 도 2의 표시 시스템의 표시부(DSP)에서는, 일례로서 복수의 화소(PX)가 매트릭스로 배열되어 있다. 화소 (PX)로서는, 예를 들어 액정 표시 디바이스, 유기 EL를 포함한 발광 디바이스, 마이크로 LED 등의 발광 다이오 드를 포함한 발광 디바이스 중 적어도 하나가 적용된 화소로 할 수 있다. 또한 본 실시형태에서는, 표시부 (DSP)의 화소(PX)에는 유기 EL가 포함된 발광 디바이스가 적용된 것으로 가정하여 설명을 한다. 또한 복수의 화소(PX) 각각은 같은 색이 아니라 상이한 색을 발광하는 화소로 하여도 좋다. 예를 들어 복수의 화소(PX)는 적색, 녹색, 및 청색의 3색을 발광하는 화소로 하여도 좋다. 그러므로 본 명세서 등에서는, 화소를 부화소로서 설명할 수 있는 경우가 있다. 또한 도 2의 표시 시스템에서, 회로부(SIC)에 포함되는 주변 회로(DRV)는 일례로서 소스 드라이버 회로 , 디지털 아날로그 변환 회로, 게이트 드라이버 회로, 및 레벨 시프터를 포함한다. 또한 도 2의 표시 시스템에서, 회로부(SIC)에 포함되는 기능 회로(MFNC)는 일례로서 기억 장치, GPU(AI 액셀러레이터), EL 보정 회로, 타이밍 컨트롤러, CPU(NoffCPU(등록 상표)), 센서 컨트 롤러, 및 전원 회로를 포함한다. 또한 도 2의 표시 시스템에서, 주변 회로(DRV)에 포함되는 회로 및 기능 회로(MFNC)에 포함되는 회로 각각 에는 일례로서 버스 배선(BSL)이 전기적으로 접속되어 있다. 소스 드라이버 회로는 일례로서 표시부(DSP)에 포함되는 화소(PX)에 화상 데이터를 송신하는 기능을 갖는다. 그러므로 소스 드라이버 회로는 배선(SL)을 통하여 화소(PX)에 전기적으로 접속되어 있다. 디지털 아날로그 변환 회로는 일례로서 후술하는 GPU, 후술하는 EL 보정 회로 등에 의하여 디지털 처리된 화상 데이터를 아날로그 데이터로 변환하는 기능을 갖는다. 아날로그 데이터로 변환된 화상 데이터는 소스 드 라이버 회로를 통하여 표시부(DSP)에 송신된다. 또한 디지털 아날로그 변환 회로는 소스 드라이버 회 로에 포함되어도 좋고, 소스 드라이버 회로, 디지털 아날로그 변환 회로, 표시부(DSP)의 순으로 화 상 데이터가 송신되는 구성으로 하여도 좋다. 게이트 드라이버 회로는 일례로서 표시부(DSP)에서 화상 데이터를 송신할 화소(PX)를 선택하는 기능을 갖는 다. 그러므로 게이트 드라이버 회로는 배선(GL)을 통하여 화소(PX)에 전기적으로 접속되어 있다. 레벨 시프터는 일례로서 소스 드라이버 회로, 디지털 아날로그 변환 회로, 게이트 드라이버 회로 등에 입력되는 신호를 적절한 레벨로 변환하는 기능을 갖는다.기억 장치는 일례로서 표시부(DSP)에 표시하는 화상 데이터를 저장하는 기능을 갖는다. 또한 기억 장치 는 화상 데이터를 디지털 데이터 또는 아날로그 데이터로서 저장하는 구성으로 할 수 있다. 또한 기억 장치에 화상 데이터를 저장하는 경우, 기억 장치는 비휘발성 메모리인 것이 바람직하다. 이 경우, 기억 장치로서 예를 들어 NAND형 메모리 등을 적용할 수 있다. 또한 기억 장치에 GPU, EL 보정 회로, CPU 등에서 생성되는 일시적 데이터를 저장하는 경우, 기억 장치는 휘발성 메모리인 것이 바람직하다. 이 경우, 기억 장치로서 예를 들어 SRAM(Static Random Access Memory), DRAM(Dynamic Random Access Memory) 등을 적용할 수 있다. GPU는 일례로서 기억 장치로부터 판독된 화상 데이터를 표시부(DSP)에 묘화하기 위한 처리를 수행하는 기능을 갖는다. 특히 GPU는 병렬로 파이프라인 처리를 수행하는 구성을 갖기 때문에 표시부(DSP)에 표시하 는 화상 데이터를 고속으로 처리할 수 있다. 또한 GPU는 인코딩된 화상을 디코딩하기 위한 디코더로서의 기능도 가질 수 있다. 또한 기능 회로(MFNC)에는 표시부(DSP)의 표시 품질을 높일 수 있는 회로가 복수로 포함되어도 좋다. 상기 회 로로서는 예를 들어 표시부(DSP)에 표시된 화상의 색 불균일을 검지하여 상기 색 불균일을 보정하여 최적 화상 으로 하는 보정 회로(조색, 조광)를 제공하여도 좋다. 또한 표시부(DSP)의 화소에 액정 표시 디바이스가 적용 된 경우, 기능 회로(MFNC)에는 감마 보정 회로를 제공하여도 좋다. 또한 표시부(DSP)의 화소에 유기 EL가 사용 된 발광 디바이스가 적용된 경우, 기능 회로(MFNC)에는 EL 소자의 휘도 편차를 보정하는 EL 보정 회로를 제공하 여도 좋다. 또한 본 실시형태에서는, 표시부(DSP)의 화소(PX)에는 유기 EL가 포함된 발광 디바이스가 적용된 것으로 가정하여 설명을 하기 때문에, 기능 회로(MFNC)에는 일례로서 EL 보정 회로가 포함된다. 또한 표시 부(DSP)에 포함되는 유기 EL로서는, 적색(R), 녹색(G), 및 청색(B)이 각각 독립적으로 제공된 구조(SBS, Side By Side 구조) 또는 탠덤 구조(R, G, B 등의 복수의 색이 중간층(전하 발생층)을 통하여 직렬로 접속된 구조)와, 착색층(예를 들어 컬러 필터)이 조합된 구조 등을 사용할 수 있다. 또한 탠덤 구조로 함으로써, 고휘 도 발광이 가능한 발광 디바이스로 할 수 있다. 또한 표시부(DSP)로부터 발광되는 광의 휘도로서는, 예를 들어 500cd/m2 이상, 바람직하게는 1000cd/m2 이상 10000cd/m2 이하, 더 바람직하게는 2000cd/m2 이상 5000cd/m2 이하 로 할 수 있다. 또한 위에서 설명한 화상 보정에 인공 지능을 사용하여도 좋다. 예를 들어 화소에 포함되는 표시 디바이스를 흐르는 전류(또는 표시 디바이스에 인가되는 전압)를 모니터링하여 취득하고, 표시부(DSP)에 표시된 화상을 이 미지 센서 등에 의하여 취득하고, 전류(또는 전압)와 화상을 인공 지능의 연산(예를 들어 인공 뉴럴 네트워크 등)의 입력 데이터로서 취급하고, 그 출력 결과에 기초하여 상기 화상의 보정 여부가 판단되어도 좋다. 또한 인공 지능의 연산은 화상 보정뿐만 아니라 화상 데이터의 업컨버트 처리에도 응용할 수 있다. 이에 의하 여, 해상도가 낮은 화상 데이터를 표시부(DSP)의 해상도에 맞추어 업컨버트 처리를 수행함으로써, 표시 품질이 높은 화상을 표시부(DSP)에 표시할 수 있다. 또한 상술한 인공 지능의 연산은 기능 회로(MFNC)에 포함되는 GPU를 사용하여 수행할 수 있다. 즉 GPU(2 2)를 사용하여 각종 보정을 위한 연산을 수행할 수 있다. 각종 보정으로서는 예를 들어 색 불균일 보정 및 업 컨버트가 있다. 또한 GPU는, 도 2에 나타낸 바와 같이, 색 불균일을 보정하는 회로(22a) 및 업컨버트를 수 행하는 회로(22b)를 포함하는 구성으로 하여도 좋다. 또한 본 명세서 등에서, 인공 지능의 연산을 수행하는 GPU를 AI 액셀러레이터라고 부른다. 즉 본 명세서 등에 서는, 기능 회로(MFNC)에 포함되는 GPU를 AI 액셀러레이터로 바꾸어 설명하는 경우가 있다. 타이밍 컨트롤러는 일례로서 표시부(DSP)에 화상을 표시할 때의 프레임 레이트를 증감하는 기능을 갖는다. 예를 들어 표시부(DSP)에 정지 화상을 표시하는 경우, 표시 시스템은 타이밍 컨트롤러에 의하여 프레 임 레이트를 낮추어 구동시킬 수 있고, 또한 예를 들어 표시부(DSP)에 동영상을 표시하는 경우, 표시 시스템 은 타이밍 컨트롤러에 의하여 프레임 레이트를 올려 구동시킬 수 있다. 즉 표시 시스템에 타이 밍 컨트롤러를 제공함으로써 정지 화상 또는 동영상에 따라 프레임 레이트를 변경할 수 있다. 특히 표시부 (DSP)에 정지 화상을 표시하는 경우, 프레임 레이트를 낮추어 동작시킬 수 있기 때문에 표시 시스템의 소 비 전력의 저감을 도모할 수 있다. CPU는 일례로서 운영 체제(operating system)의 실행, 데이터의 제어, 각종 연산, 프로그램의 실행 등 범용 처리를 수행하는 기능을 갖는다. 표시 시스템에서, CPU는 예를 들어 기억 장치에서의 화상 데이터의 기록 동작 또는 판독 동작, 화상 데이터의 보정 동작, 후술하는 센서에 대한 동작 등의 명령을 수행하는 기능을 갖는다. 또한 예를 들어 CPU는 기억 장치와, GPU와, EL 보정 회로와, 타이밍 컨트롤러 와, 고주파 회로와, 기능 회로(MFNC)에 포함되는 회로 등 중에서 선택되는 하나 또는 2개 이상에 제어 신호 를 송신하는 기능을 가져도 좋다. 또한 CPU는 데이터를 일시적으로 백업하는 회로(이하 백업 회로라고 부름)를 포함하여도 좋다. 백업 회로 는 예를 들어 전원 전압의 공급이 정지되어도 상기 데이터를 유지할 수 있어 바람직하다. 예를 들어 표시부 (DSP)에서 정지 화상을 표시하는 경우, 현재의 정지 화상과 상이한 화상을 표시할 때까지 CPU의 기능을 정 지할 수 있다. 그러므로 CPU에서 처리하고 있는 데이터를 백업 회로에 일시적으로 백업하고, 그 후, CPU로의 전원 전압의 공급을 정지하여 CPU를 정지시킴으로써, CPU에서의 동적인 소비 전력을 저감 할 수 있다. 또한 본 명세서 등에서는, 백업 회로를 포함한 CPU를 NoffCPU라고 한다. 센서 컨트롤러는 일례로서 센서를 제어하는 기능을 갖는다. 또한 도 2에서는 상기 센서에 전기적으로 접속 하기 위한 배선으로서 배선(SNCL)을 나타내었다. 상기 센서로서는, 예를 들어 표시부(DSP)의 상방, 하방, 또는 표시부(DSP)의 내부에 제공될 수 있는 터치 센서 로 할 수 있다. 또한 상기 센서로서는 예를 들어 조도 센서로 할 수 있다. 특히 표시부(DSP)를 비추는 외광의 강도를 조도 센 서에 의하여 취득함으로써, 외광에 맞추어 표시부(DSP)에 표시하는 화상의 밝기(휘도)를 변경할 수 있다. 예를 들어 외광이 밝은 경우에는, 표시부(DSP)에 표시하는 화상의 휘도를 올려, 상기 화상의 시인성을 높일 수 있다. 이와 반대로, 외광이 어두운 경우에는, 표시부(DSP)에 표시하는 화상의 휘도를 낮추어, 소비 전력을 저감할 수 있다. 전원 회로는 일례로서 주변 회로(DRV)에 포함되는 회로, 기능 회로(MFNC)에 포함되는 회로, 표시부(DSP)에 포함되는 화소 등에 대하여 공급하는 전압을 생성하는 기능을 갖는다. 또한 전원 회로는 전압을 공급하는 회로를 선택하는 기능을 가져도 좋다. 예를 들어 전원 회로는 표시부(DSP)에 정지 화상을 표시하는 기간에 는, CPU, GPU 등으로의 전압 공급을 정지함으로써 표시 시스템 전체의 소비 전력을 저감할 수 있 다. <표시 장치 및 표시 시스템의 변형예 1> 또한 도 1의 (B)에서는, 주변 회로(DRV) 및 기능 회로(MFNC)에 포함되는 트랜지스터로서, 반도체 기판 위에 형 성된 트랜지스터가 사용된다. 본 실시형태에서는, 실리콘을 재료로 한 반도체 기판 위에 트랜지스터가 형성되 고, 주변 회로(DRV) 및 기능 회로(MFNC)에 Si 트랜지스터가 포함되는 예를 나타내었지만, 본 발명의 일 형태의 표시 장치 또는 표시 시스템은 Si 트랜지스터와는 특성이 다른 트랜지스터를 도 1의 (A) 및 (B)에 적용할 수 있 다. 예를 들어 본 발명의 일 형태의 표시 장치는, 도 3의 (A)에 나타낸 바와 같이, 회로부(SIC)와 표시부(DSP) 사이 에 층(OSC)이 형성된 구성(표시 장치(100A))으로 하여도 좋다. 또한 예를 들어, 도 3의 (B)에 나타낸 바와 같 이, 본 발명의 일 형태의 표시 시스템은 도 3의 (A)와 같이 회로부(SIC)와 표시부(DSP) 사이에 층(OSC)이 형성 된 구성(표시 시스템(200A))으로 하여도 좋다. 층(OSC)은 예를 들어 OS 트랜지스터를 포함한 구성으로 할 수 있다. OS 트랜지스터의 채널 형성 영역은 실시형 태 4에서 설명하는 금속 산화물을 포함한다. 상기 금속 산화물로서는 예를 들어 인듐, 원소 M(알루미늄, 갈륨, 이트륨, 주석, 구리, 바나듐, 베릴륨, 붕소, 타이타늄, 철, 니켈, 저마늄, 지르코늄, 몰리브데넘, 란타넘, 세륨, 네오디뮴, 하프늄, 탄탈럼, 텅스텐, 및 마그네슘 등 중에서 선택된 1종류 또는 복수 종류의 원소), 아연 중에서 선택되는 하나 또는 복수의 재료로 할 수 있다. 특히 인듐, 갈륨, 아연으로 이루어지는 금속 산화물이 OS 트랜지스터의 반도체층에 포함됨으로써, 상기 반도체층의 밴드 갭을 크게 할 수 있다. 그러므로 OS 트랜지 스터의 오프 전류를 작게 할 수 있다. OS 트랜지스터는 반도체 기판 위뿐만 아니라, 절연체 기판, 도전체 기판, 그리고 도전막, 절연막, 반도체막 위 에 형성할 수 있기 때문에, Si 트랜지스터가 형성된 반도체 기판 위(회로부(SIC) 위)에 용이하게 제공할 수 있 다. 또한 층(OSC)은 OS 트랜지스터뿐만 아니라 용량 소자 등의 회로 소자를 포함하여도 좋다. 또한 층(OSC)은 내부 에 회로를 포함하여도 좋다.회로부(SIC) 위에 층(OSC)을 제공함으로써, 회로부(SIC)에 형성된 회로에, 층(OSC)에 포함되는 OS 트랜지스터를 사용할 수 있기 때문에, 상기 회로에서 OS 트랜지스터의 오프 전류가 작은 특성을 이용할 수 있다. 층(OSC)에 포함되는 OS 트랜지스터는 예를 들어 파워 게이팅을 수행하기 위한 스위치로서 적용할 수 있다. 구 체적으로는 예를 들어 상기 스위치는 주변 회로(DRV) 및 기능 회로(MFNC)에 포함되는 회로에 포함될 수 있다. 상기 회로를 일시적으로 정지시킬 때 상기 스위치를 오프 상태로 함으로써 전원 회로 등으로부터 상기 회로 로의 전원 전압의 공급을 정지할 수 있다. 층(OSC)에 포함되는 OS 트랜지스터는 예를 들어 기억 장치의 메모리 셀에 포함되는 기록 트랜지스터로서 적 용할 수 있다. 메모리 셀에 포함되는 기록 트랜지스터에 OS 트랜지스터를 적용함으로써, 기록 트랜지스터의 소 스-드레인 간 누설 전류(오프 전류)를 작게 할 수 있기 때문에 상기 메모리 셀에 기록된 데이터를 장시간 유지 할 수 있다. 이에 의하여, 메모리 셀에 유지된 데이터의 리프레시 동작의 간격을 길게 할 수 있기 때문에, 표 시 시스템의 소비 전력을 저감할 수 있다. 또한 층(OSC)에는, 주변 회로(DRV)에 포함되는 회로, 기능 회로(MFNC)에 포함되는 회로 등에서 취급되는 데이터 를 일시적으로 저장하는 기억 장치를 제공하여도 좋다. 예를 들어 도 4에 나타낸 표시 시스템(200A)의 블록도 와 같이, 층(OSC)에 기억 장치(MDV)를 제공하여도 좋다. 또한 도 4에 나타낸 기억 장치(MDV)의 예에서는, 복수 의 메모리 셀(MC)이 매트릭스로 배열되어 있다. 또한 도 4의 표시 시스템(200A)의 기능 회로(MFNC)에는 일례로 서 메모리 셀(MC)에서의 데이터의 기록 동작, 판독 동작, 소거 동작 등을 수행하는 메모리 제어 회로가 제 공되어 있다. 메모리 제어 회로는 일례로서 기억 장치(MDV)에 포함되는 메모리 셀(MC)에 대한 워드선 드라이버 회로, 비 트선 드라이버 회로 등을 포함한다. 그러므로 메모리 제어 회로는 층(OSC)에 포함되는 메모리 셀(MC)에 배 선(ML)을 통하여 전기적으로 접속되어 있다. <<메모리 셀의 구성예 1>> 다음으로 메모리 셀(MC)에 적용할 수 있는 메모리 셀의 회로 구성예에 대하여 설명한다. 메모리 셀(MC)로서는, 예를 들어 DOSRAM(Dynamic Oxide Semiconductor Random Access Memory)(등록 상표) 또는 NOSRAM(Dynamic Oxide Semiconductor Random Access Memory)(등록 상표)이라고 불리는 기억 회로의 메모리 셀을 적용할 수 있 다. 도 5의 (A)에는 DOSRAM의 메모리 셀의 회로 구성의 예를 나타내었다. 메모리 셀(MC1)은 트랜지스터(M1)와 용량 소자(CA)를 포함한다. 또한 트랜지스터(M1)는 프런트 게이트(단순히 게이트라고 부르는 경우가 있음) 및 백 게 이트를 포함한다. 트랜지스터(M1)의 제 1 단자는 용량 소자(CA)의 제 1 단자에 전기적으로 접속되고, 트랜지스터(M1)의 제 2 단자 는 배선(BIL)에 전기적으로 접속되고, 트랜지스터(M1)의 게이트는 배선(WOL)에 전기적으로 접속되고, 트랜지스 터(M1)의 백 게이트는 배선(BGL)에 전기적으로 접속되어 있다. 용량 소자(CA)의 제 2 단자는 배선(CVL)에 전기 적으로 접속되어 있다. 트랜지스터(M1)는 메모리 셀(MC1)의 기록 트랜지스터로서 기능한다. 또한 상술한 바와 같이, 트랜지스터(M1)는 일례로서 OS 트랜지스터로 하였다. 또한 배선(BIL), 배선(WOL), 배선(CAL), 배선(BGL)은 도 4의 표시 시스템(200A)의 배선(ML)에 상당한다. 배선(BIL)은 일례로서 비트선으로서 기능하고, 배선(WOL)은 워드선으로서 기능한다. 배선(CAL)은 일례로서 용 량 소자(CA)의 제 2 단자에 소정의 전위를 인가하기 위한 배선으로서 기능한다. 또한 데이터의 기록 시 및 판 독 시, 배선(CVL)에는 저레벨 전위(기준 전위라고 하는 경우가 있음)를 인가하는 것이 바람직하다. 배선(BGL)은 트랜지스터(M1)의 백 게이트에 전위를 인가하기 위한 배선으로서 기능한다. 배선(BGL)에 임의의 전위를 인가함으로써 트랜지스터(M1)의 문턱 전압을 증감할 수 있다. 또한 도 5의 (A)의 메모리 셀(MC1)은 트랜지스터(M1)의 백 게이트가 배선(BGL)에 전기적으로 접속되어 있는 구 성으로 하였지만, 트랜지스터(M1)의 온 전류를 높이는 목적으로 메모리 셀(MC1)을 트랜지스터(M1)의 게이트와 백 게이트가 전기적으로 접속된 구성으로 하여도 좋다. 또한 도 5의 (A)의 메모리 셀(MC1)에서 트랜지스터(M 1)에는 백 게이트가 제공되지 않아도 된다. 데이터의 기록 및 판독은, 배선(WOL)에 고레벨 전위를 인가하여, 트랜지스터(M1)를 온 상태로 하여, 배선(BIL) 과 용량 소자(CA)의 제 1 단자 사이를 도통 상태로 함으로써 수행된다. 구체적으로는 데이터의 기록은, 배선(BIL)에 기록하는 데이터에 따른 전위를 인가하여, 트랜지스터(M1)를 통하 여 용량 소자(CA)의 제 1 단자에 상기 전위를 기록함으로써 수행된다. 데이터를 기록한 후에는, 배선(WOL)에 저레벨 전위를 인가하여, 트랜지스터(M1)를 오프 상태로 함으로써, 상기 전위를 메모리 셀(MC1)에 유지할 수 있 다. 또한 데이터의 판독은, 먼저 배선(BIL)을 적절한 전위, 예를 들어 저레벨 전위와 고레벨 전위의 중간의 전위가 되도록 프리차지하고, 다음으로 배선(BIL)을 전기적으로 부유 상태로 한다. 그 후, 배선(WOL)에 고레벨 전위를 인가하여 트랜지스터(M1)를 온 상태로 함으로써, 배선(BIL)의 전위를 변화시킨다. 배선(BIL)의 전위는 용량 소 자(CA)의 제 1 단자에 기록된 전위에 따라 변화되기 때문에, 변화된 배선(BIL)의 전위로부터 메모리 셀(MC1)에 유지된 데이터를 판독할 수 있다. 또한 상술한 메모리 셀(MC1)은 도 5의 (A)에 나타낸 회로 구성에 한정되지 않고, 메모리 셀(MC1)의 회로 구성을 적절히 변경하여도 좋다. 도 5의 (B)에는 NOSRAM의 메모리 셀의 회로 구성의 예를 나타내었다. 메모리 셀(MC2)은 트랜지스터(M2)와, 트 랜지스터(M3)와, 용량 소자(CB)를 포함한다. 또한 트랜지스터(M2)는 프런트 게이트(단순히 게이트라고 부르는 경우가 있음) 및 백 게이트를 포함한다. 트랜지스터(M2)는 메모리 셀(MC2)의 기록 트랜지스터로서 기능한다. 또한 상술한 바와 같이, 상기 기록 트랜지 스터는 일례로서 OS 트랜지스터로 하였다. 또한 트랜지스터(M3)는 메모리 셀(MC2)의 판독 트랜지스터로서 기능한다. 상술한 바와 같이, 상기 판독 트랜지 스터는 OS 트랜지스터로 하였다. 또한 본 동작예에서 트랜지스터(M3)는 특별히 언급이 없는 한, 포화 영역에서 동작하는 것으로 한다. 즉, 트랜지스터(M3)의 게이트 전압, 소스 전압, 및 드레인 전압은 포화 영역에서 동작 하는 범위의 전압으로 적절히 바이어스되어 있는 것으로 한다. 또한 트랜지스터(M2), 트랜지스터(M3) 중 적어도 하나는 Si 트랜지스터로 하여도 좋다. 즉, 메모리 셀(MC2)에 포함되는 트랜지스터 중 Si 트랜지스터를 회로부(SIC)에 형성하고, 메모리 셀(MC2)에 포함되는 나머지 트랜지스 터를 OS 트랜지스터로서 층(OSC)에 형성할 수 있다. 트랜지스터(M2)의 제 1 단자는 용량 소자(CB)의 제 1 단자에 전기적으로 접속되고, 트랜지스터(M2)의 제 2 단자 는 배선(WBL)에 전기적으로 접속되고, 트랜지스터(M2)의 게이트는 배선(WOL)에 전기적으로 접속되고, 트랜지스 터(M2)의 백 게이트는 배선(BGL)에 전기적으로 접속되어 있다. 용량 소자(CB)의 제 2 단자는 배선(CAL)에 전기 적으로 접속되어 있다. 트랜지스터(M3)의 제 1 단자는 배선(RBL)에 전기적으로 접속되고, 트랜지스터(M3)의 제 2 단자는 배선(SOL)에 전기적으로 접속되고, 트랜지스터(M3)의 게이트는 용량 소자(CB)의 제 1 단자에 전기적으 로 접속되어 있다. 또한 배선(RBL), 배선(WBL), 배선(WOL), 배선(CAL), 배선(BGL), 및 배선(SOL)은 도 4의 표시 시스템(200A)의 배선(ML)에 상당한다. 배선(WBL)은 기록 비트선으로서 기능하고, 배선(RBL)은 판독 비트선으로서 기능하고, 배선(WOL)은 워드선으로서 기능한다. 배선(CAL)은 용량 소자(CB)의 제 2 단자에 소정의 전위를 인가하기 위한 배선으로서 기능한다. 데 이터 유지 시에는, 배선(CAL)에 저레벨 전위(기준 전위라고 하는 경우가 있음)를 인가하는 것이 바람직하고, 데 이터 기록 시, 데이터의 판독 시에는, 배선(CAL)에 고레벨 전위를 인가하는 것이 바람직하다. 배선(BGL)은 트랜지스터(M2)의 백 게이트에 전위를 인가하기 위한 배선으로서 기능한다. 배선(BGL)에 임의의 전위를 인가함으로써 트랜지스터(M2)의 문턱 전압을 증감할 수 있다. 또한 도 5의 (A)의 트랜지스터(M1)와 같 이 트랜지스터(M2)는 트랜지스터(M2)의 게이트와 백 게이트를 전기적으로 접속시킨 구성으로 하여도 좋고, 백 게이트가 제공되지 않은 구성으로 하여도 좋다. 데이터의 기록은, 배선(WOL)에 고레벨 전위를 인가하여, 트랜지스터(M2)를 온 상태로 하여, 배선(WBL)과 용량 소자(CB)의 제 1 단자 사이를 도통 상태로 함으로써 수행된다. 구체적으로는, 트랜지스터(M2)가 온 상태일 때, 배선(WBL)에 기록하는 정보에 대응하는 전위를 인가하여, 용량 소자(CB)의 제 1 단자 및 트랜지스터(M3)의 게이 트에 상기 전위를 기록한다. 그 후, 배선(WOL)에 저레벨 전위를 인가하여 트랜지스터(M2)를 오프 상태로 함으 로써, 용량 소자(CB)의 제 1 단자의 전위 및 트랜지스터(M3)의 게이트의 전위가 유지된다.데이터의 판독은 배선(SOL)에 소정의 전위를 인가함으로써 수행된다. 트랜지스터(M3)의 소스-드레인 간을 흐르 는 전류 및 트랜지스터(M3)의 제 1 단자의 전위는 트랜지스터(M3)의 게이트의 전위 및 트랜지스터(M3)의 제 2 단자의 전위에 따라 결정되기 때문에, 트랜지스터(M3)의 제 1 단자에 전기적으로 접속되어 있는 배선(RBL)의 전 위를 판독함으로써, 용량 소자(CB)의 제 1 단자(또는 트랜지스터(M3)의 게이트)에 유지되어 있는 전위를 판독할 수 있다. 즉, 용량 소자(CB)의 제 1 단자(또는 트랜지스터(M3)의 게이트)에 유지되어 있는 전위로부터, 이 메 모리 셀에 기록되어 있는 정보를 판독할 수 있다. 또한 상술한 메모리 셀(MC2)은 도 5의 (B)에 나타낸 회로 구성에 한정되지 않고, 메모리 셀(MC2)의 회로의 구성 을 적절히 변경하여도 좋다. 예를 들어 배선(WBL)과 배선(RBL)을 하나의 배선(BIL)으로 합친 구성이어도 좋다. 그 메모리 셀의 회로 구성예를 도 5의 (C)에 나타내었다. 메모리 셀(MC2A)은 메모리 셀(MC2)의 배선(WBL)과 배 선(RBL)을 하나의 배선(BIL)으로 하고, 트랜지스터(M2)의 제 2 단자 및 트랜지스터(M3)의 제 1 단자가 배선 (BIL)과 접속되어 있는 구성을 갖는다. 즉 메모리 셀(MC2A)은 기록 비트선과 판독 비트선을 하나의 배선(BIL) 으로서 동작시키는 구성을 갖는다. <<메모리 셀의 구성예 2>> 또한 층(OSC)의 메모리 셀(MC)에 적용할 수 있는, DOSRAM, NOSRAM 이외의 기억 회로의 메모리 셀로서는, 예를 들어 MRAM(Magnetoresistive Random Access Memory), ReRAM(Resistive Random Access Memory), 상변화 메모리 (PCM, PRAM 등이라고 부르는 경우가 있음), 강유전 메모리가 있다. 이하에서, 이들의 회로 구성에 대하여 설명 한다. 도 5의 (D)에 나타낸 메모리 셀(MC3)은 STT-MRAM(Spin Transfer Torque-Magnetoresistive Random Access Memory)의 일례이다. 메모리 셀(MC3)은 트랜지스터(M10)와 MTJ(자기 터널 접합) 소자(ME)를 포함한다. 트랜지스터(M10)로서는 예를 들어 트랜지스터(M1) 및 트랜지스터(M2)와 마찬가지로 OS 트랜지스터를 적용할 수 있다. MTJ 소자(ME)는 자유층을 포함한 층(FL)과, 터널 절연체를 포함한 층(TIS)과, 고정층을 포함한 층(RL)을 포함하 고, 층(TIS)을 개재(介在)하여 층(FL)과 층(RL)이 중첩되어 있다. 트랜지스터(M10)의 제 1 단자는 MTJ 소자(ME)의 층(RL)에 전기적으로 접속되고, 트랜지스터(M10)의 제 2 단자는 배선(SL)에 전기적으로 접속되고, 트랜지스터(M10)의 게이트는 배선(WL)에 전기적으로 접속된다. MTJ 소자(M E)의 층(FL)은 배선(BL)에 전기적으로 접속되어 있다. 또한 배선(BL), 배선(WL), 및 배선(SL)은 도 4의 표시 시스템(200A)의 배선(ML)에 상당한다. 배선(BL)은 일례로서 메모리 셀(MC3)에 대한 기록 비트선 또는 판독 비트선으로서 기능한다. 배선(WL)은 일례로서 메모리 셀(MC3)에 대한 워드선으로서 기능한다. 배선(SL)은 일례로서 정전압을 공급하는 배선으로서 기능한다. 상기 정전압은 예를 들어 저레벨 전위로 할 수 있다. 또한 도면에는 도시하지 않았지만, 층(OSC)의 메모리 셀(MC)에는 STT-MRAM뿐만 아니라 SOT-MRAM(Spin Orbit Torque-Magnetoresistive Random Access Memory)을 적용할 수 있다. 도 5의 (E)에 나타낸 메모리 셀(MC4)은 ReRAM(Resistive Random Access Memory)의 일례이다. 메모리 셀(MC4)은 트랜지스터(M10)와 저항 변화 소자(RM)를 포함한다. 트랜지스터(M10)로서는 예를 들어 트랜지스터(M1) 및 트랜지스터(M2)와 마찬가지로 OS 트랜지스터를 적용할 수 있다. 도 5의 (E)에 나타낸 바와 같이, 메모리 셀(MC4)은 도 5의 (D)의 메모리 셀(MC3)의 MTJ 소자(ME)가 저항 변화 소자(RM)로 치환된 구성을 갖는다. 또한 도 5의 (E)의 메모리 셀(MC)에서 저항 변화 소자(RM)의 제 1 단자는 트랜지스터(M10)의 제 1 단자에 전기적으로 접속되고, 저항 변화 소자(RM)의 제 2 단자는 배선(BL)에 전기적으 로 접속되는 것으로 한다. 또한 배선(BL), 배선(WL), 및 배선(SL)은 도 4의 표시 시스템(200A)의 배선(ML)에 상당한다. 배선(BL)은 일례로서 메모리 셀(MC4)에 대한 기록 비트선 또는 판독 비트선으로서 기능한다. 배선(WL)은 일례로서 메모리 셀(MC4)에 대한 워드선으로서 기능한다. 배선(SL)은 일례로서 정전압을 공급하는 배선으로서 기능한다. 상기 정전압은 예를 들어 기준 전위로 할 수 있 다. 도 5의 (F)에 나타낸 메모리 셀(MC5)은 상변화 메모리를 포함하는 기억 회로의 일례이다. 메모리 셀(MC5)은 트랜지스터(M10)와 상변화 메모리(PCM1)를 포함한다. 트랜지스터(M10)로서는 예를 들어 트랜지스터(M1) 및 트랜지스터(M2)와 마찬가지로 OS 트랜지스터를 적용할 수 있다. 상변화 메모리(PCM1)는 일례로서 전극(TE)과, 상변화층(CHL)과, 전극(BE)을 포함하고, 전극(TE), 상변화층 (CHL), 전극(BE)의 순으로 전기적으로 접속되어 있다. 또한 상변화층(CHL)에는 예를 들어 칼코제나이드 유리를 적용할 수 있다. 또한 본 실시형태에서는, 상변화층 (CHL)에 칼코제나이드 유리가 적용된 것으로 가정하여 설명을 한다. 전극(TE)과 전극(BE)은 상변화층(CHL)과 접촉하는 면적이 서로 다른 것이 바람직하다. 예를 들어 도 5의 (F)에 서, 전극(TE)과 상변화층(CHL)의 접촉 면적은 전극(BE)과 상변화층(CHL)의 접촉 면적보다 크게 도시하였다. 전 극(BE)과 상변화층(CHL)의 접촉 면적을 작게 함으로써, 상변화층(CHL)에 대하여 국소적으로 열을 가할 수 있기 때문에, 전극(TE) 부근의 상변화층(CHL)보다 전극(BE) 부근의 상변화층(CHL)에서 상변화가 발생되기 쉬워진다. 도 5의 (F)에 나타낸 바와 같이, 메모리 셀(MC5)은 도 5의 (D)의 메모리 셀(MC3)의 MTJ 소자(ME)가 상변화 메모 리(PCM1)로 치환된 구성을 갖는다. 또한 도 5의 (F)의 메모리 셀(MC)에서 상변화 메모리(PCM1)의 전극(BE)은 트랜지스터(M10)의 제 1 단자에 전기적으로 접속되고, 상변화 메모리(PCM1)의 전극(TE)은 배선(BL)에 전기적으 로 접속되는 것으로 한다. 또한 배선(BL), 배선(WL), 및 배선(SL)은 도 4의 표시 시스템(200A)의 배선(ML)에 상당한다. 배선(BL)은 일례로서 메모리 셀(MC5)에 대한 기록 비트선 또는 판독 비트선으로서 기능한다. 배선(WL)은 일례로서 메모리 셀(MC5)에 대한 워드선으로서 기능한다. 배선(SL)은 일례로서 정전압을 공급하는 배선으로서 기능한다. 상기 정전압은 예를 들어 저레벨 전위로 할 수 있다. 도 5의 (G)에 나타낸 메모리 셀(MC6)은 FeRAM(Ferroelectric Random Access Memory)의 일례이다. 메모리 셀(MC6)은 트랜지스터(M11)와 강유전 커패시터(FEA)를 포함한다. 트랜지스터(M11)로서는 예를 들어 트랜지스터(M1) 및 트랜지스터(M2)와 마찬가지로 OS 트랜지스터를 적용할 수 있다. 트랜지스터(M11)의 제 1 단자는 배선(BL)에 전기적으로 접속되고, 트랜지스터(M11)의 제 2 단자는 강유전 커패 시터(FEA)의 제 1 단자에 전기적으로 접속되고, 트랜지스터(M11)의 게이트는 배선(WL)에 전기적으로 접속되어 있다. 또한 강유전 커패시터(FEA)의 제 2 단자는 배선(FCA)에 전기적으로 접속되어 있다. 또한 배선(BL), 배선(WL), 배선(FCA)은 도 4의 표시 시스템(200A)의 배선(ML)에 상당한다. 배선(BL)은 일례로서 메모리 셀(MC6)에 기록되는 데이터를 송신하는 배선으로서 기능한다. 배선(WL)은 일례로서 데이터의 기록처가 되는 메모리 셀(MC6)을 선택하기 위한 배선으로서 기능한다. 배선(FCA)은, 일례로서 메모리 셀(MC6)에 데이터를 기록할 때, 강유전 커패시터(FEA)에 포함되는 강유전성을 가 질 수 있는 재료에서 분극을 일으킬 정도의 가변 전위를 공급하는 배선으로서 기능한다. 여기서 강유전 커패시터(FEA)에 포함되는 강유전성을 가질 수 있는 재료에 대하여 설명한다. 강유전성을 가질 수 있는 재료로서는 예를 들어 산화 하프늄을 사용하는 것이 바람직하다. 또한 강유전 커패시 터(FEA)에 포함되는 유전체로서 산화 하프늄을 사용하는 경우, 산화 하프늄의 막 두께는 10nm 이하로 하는 것이 바람직하고, 5nm 이하로 하는 것이 더 바람직하고, 2nm 이하로 하는 것이 더욱 바람직하다.또는 강유전성을 가질 수 있는 재료로서는, 산화 하프늄 외에, 산화 지르코늄, 산화 하프늄 지르코늄(HfZrOX(X 는 0보다 큰 실수임)) 등의 금속 산화물이 있다. 또는 강유전성을 가질 수 있는 재료로서는, 산화 하프늄에 원 소 J1(여기서의 원소 J1은 지르코늄(Zr), 실리콘(Si), 알루미늄(Al), 가돌리늄(Gd), 이트륨(Y), 란타넘(La), 스 트론튬(Sr) 등 중에서 선택된 하나 또는 복수임)을 첨가한 재료가 있다. 여기서 하프늄 원자와 원소 J1의 원자 수의 비는 적절히 설정할 수 있고, 예를 들어 하프늄 원자와 원소 J1의 원자수를 1:1 또는 그 근방으로 하면 좋 다. 또는 강유전성을 가질 수 있는 재료로서는 산화 지르코늄에 원소 J2(여기서의 원소 J2는 하프늄(Hf), 실리 콘(Si), 알루미늄(Al), 가돌리늄(Gd), 이트륨(Y), 란타넘(La), 스트론튬(Sr) 등 중에서 선택된 하나 또는 복수 임)를 첨가한 재료 등이 있다. 또한 지르코늄 원자와 원소 J2의 원자수의 비는 적절히 설정할 수 있고, 예를 들어 지르코늄 원자와 원소 J2의 원자수를 1:1 또는 그 근방으로 하면 좋다. 또한 강유전성을 가질 수 있는 재 료로서, 타이타늄산 납(PbTiOX), 타이타늄산 바륨 스트론튬(BST), 타이타늄산 스트론튬, 타이타늄산 지르콘산 연(PZT), 탄탈럼산 비스무트산 스트론튬(SBT), 비스무트 페라이트(BFO), 타이타늄산 바륨 등의 페로브스카이트 구조를 갖는 압전성 세라믹을 사용하여도 좋다. 또한 강유전성을 가질 수 있는 재료로서는, 질화 알루미늄 스칸듐(Al1-aScaNb(a는 0보다 크고 0.5보다 작은 실수 이고, b는 1 또는 그 근방의 값임)), Al-Ga-Sc 질화물, Ga-Sc 질화물 등이 있다. 또한 강유전성을 가질 수 있 는 재료로서는, 원소 M1과, 원소 M2와, 질소를 갖는 금속 질화물을 들 수 있다. 여기서 원소 M1은 알루미늄 (Al), 갈륨(Ga), 인듐(In) 등 중에서 선택된 하나 또는 복수이다. 또한 원소 M2는 붕소(B), 스칸듐(Sc), 이트 륨(Y), 란타넘(La), 세륨(Ce), 네오디뮴(Nd), 유로퓸(Eu), 타이타늄(Ti), 지르코늄(Zr), 하프늄(Hf), 바나듐 (V), 나이오븀(Nb), 탄탈럼(Ta), 크로뮴(Cr) 등 중에서 선택된 하나 또는 복수이다. 또한 원소 M1의 원자수와 원소 M2의 원자수의 비는 적절히 설정할 수 있다. 또한 원소 M1과 질소를 갖는 금속 산화물은 원소 M2를 포함 하지 않아도 강유전성을 갖는 경우가 있다. 또한 강유전성을 가질 수 있는 재료로서는 상기 금속 질화물에 원 소 M3이 첨가된 재료를 들 수 있다. 또한 원소 M3은 마그네슘(Mg), 칼슘(Ca), 스트론튬(Sr), 아연(Zn), 카드뮴 (Cd) 등 중에서 선택된 하나 또는 복수이다. 여기서 원소 M1의 원자수, 원소 M2의 원자수, 및 원소 M3의 원자 수의 비는 적절히 설정할 수 있다. 또한 상기 금속 질화물은 적어도 13족 원소와, 15족 원소인 질소를 포함하 기 때문에 상기 금속 질화물을 III-V족의 강유전체, III족 질화물의 강유전체 등이라고 부르는 경우가 있다. 또한 강유전성을 가질 수 있는 재료로서는 SrTaO2N, BaTaO2N 등의 페로브스카이트형 산질화물, κ알루미나형 구 조의 GaFeO3 등을 들 수 있다. 또한 강유전성을 가질 수 있는 재료로서는 예를 들어, 위에서 열거한 재료 중에서 선택된 복수의 재료로 이루어 지는 혼합물 또는 화합물을 사용할 수 있다. 또는 강유전성을 가질 수 있는 재료는, 위에서 열거한 재료 중에 서 선택된 복수의 재료로 이루어진 적층 구조를 가질 수 있다. 또한 위에서 열거한 재료 등은 성막 조건뿐만 아니라 각종 공정 등에 의해서도 결정 구조(특성)가 변화될 가능성이 있기 때문에, 본 명세서 등에서는 강유전 성을 나타내는 재료를 강유전체라고 부를 뿐만 아니라, 강유전성을 가질 수 있는 재료 또는 강유전성을 가지게 하는 재료라고도 부른다. 또한 강유전체에는 강유전성을 발현하는 재료뿐만 아니라 강유전성을 가질 수 있는 재료도 포함되는 것으로 한다. 강유전성을 가질 수 있는 재료 중에서도, 산화 하프늄 또는 산화 하프늄 및 산화 지르코늄을 포함한 재료는 수 nm의 박막으로 가공하여도 강유전성을 가질 수 있기 때문에 바람직하다. 여기서 강유전성을 가질 수 있는 재료 의 막 두께는 100nm 이하로, 바람직하게는 50nm 이하로, 더 바람직하게는 20nm 이하로, 더욱 바람직하게는 10nm 이하(대표적으로는 2nm 이상 9nm 이하)로 할 수 있다. 예를 들어 막 두께를 8nm 이상 12nm 이하로 하는 것이 바람직하다. 박막화가 가능한 강유전체층으로 함으로써, 용량 소자의 한 쌍의 전극 사이에 상기 강유전체층을 끼울 수 있고, 또한 미세화된 트랜지스터 등의 반도체 소자와 상기 용량 소자를 조합하여 반도체 장치를 형성할 수 있다. 또한 본 명세서 등에서, 강유전성을 가질 수 있는 재료를 층상으로 한 것을 강유전체층, 금속 산화물 막, 또는 금속 질화물막이라고 부르는 경우가 있다. 또한 본 명세서 등에서, 이러한 강유전체층, 금속 산화물 막, 또는 금속 질화물막을 갖는 장치를 강유전체 디바이스라고 부르는 경우가 있다. 또한 강유전성을 가질 수 있는 재료로서 HfZrOX를 사용하는 경우, 원자층 퇴적(ALD: Atomic Layer Deposition) 법, 특히 열 ALD법을 사용하여 성막하는 것이 바람직하다. 또한 열 ALD법을 사용하여 강유전성을 가질 수 있는 재료를 성막하는 경우에는, 전구체로서 탄화수소(Hydro Carbon, HC라고도 함)를 포함하지 않는 재료를 사용하는 것이 적합하다. 강유전성을 가질 수 있는 재료 내에 수소 및 탄소 중 어느 한쪽 또는 양쪽이 포함되는 경우, 강유전성을 가질 수 있는 재료의 결정화가 저해되는 경우가 있다. 따라서 상술한 바와 같이, 탄화수소를 포함하지 않는 전구체를 사용함으로써, 강유전성을 가질 수 있는 재료 내의 수소 및 탄소 중 어느 한쪽 또는 양쪽의 농도를 감소시키는 것이 바람직하다. 탄화수소를 포함하지 않는 전구체로서는 예를 들어 염소계 재료가 있다. 또한 강유전성을 가질 수 있는 재료로서 산화 하프늄 및 산화 지르코늄을 갖는 재료(HfZrOx)를 사용하는 경우, 전구체로서는 HfCl4, ZrCl4 중 적어도 하나를 사용하면 좋다. 또한 강유전성을 가질 수 있는 재료를 사용한 막을 성막하는 경우, 막 내의 불순물, 여기서는 수소, 탄화수소, 및 탄소 중 적어도 하나 이상을 철저히 배제함으로써, 강유전성을 갖는 고순도 진성의 막을 형성할 수 있다. 또한 강유전성을 갖는 고순도 진성의 막과 후술하는 실시형태에 나타내는 고순도 진성의 산화물 반도체는 제조 공정의 정합성이 매우 높다. 따라서 생산성이 높은 반도체 장치의 제작 방법을 제공할 수 있다. 또한 강유전성을 가질 수 있는 재료로서 HfZrOX를 사용하는 경우, 열 ALD법을 사용하여 산화 하프늄과 산화 지 르코늄을 1:1의 조성이 되도록 번갈아 성막하는 것이 바람직하다. 또한 열 ALD법을 사용하여 강유전성을 가질 수 있는 재료를 성막하는 경우, 산화제로서는 H2O 또는 O3을 사용할 수 있다. 다만 열 ALD법의 산화제는 이에 한정되지 않는다. 예를 들어 열 ALD법의 산화제로서는, O2, O3, N2O, NO2, H2O, 및 H2O2 중에서 선택되는 어느 하나 또는 복수가 포함되어도 좋다. 또한 강유전성을 가질 수 있는 재료의 결정 구조는 특별히 한정되지 않는다. 예를 들어 강유전성을 가질 수 있 는 재료의 결정 구조로서는, 입방정계, 정방정계, 직방정계, 및 단사정계 중에서 선택되는 어느 하나 또는 복수 로 하면 좋다. 특히, 강유전성을 가질 수 있는 재료가 직방정계의 결정 구조를 가지면, 강유전성이 발현하기 때문에 바람직하다. 또는 강유전성을 가질 수 있는 재료는 비정질 구조와 결정 구조의 복합 구조를 가져도 좋 다. 또한 도 5의 (G)의 메모리 셀(MC6)은 강유전 커패시터(FEA)를 사용한 FeRAM의 일례로서 나타낸 것이지만, 층 (OSC)에 적용할 수 있는 메모리 셀(MC)로서는, FTJ(Ferroelectric Tunnel Junction 또는 Ferroelectric Transportation Junction) 소자 및/또는 FeFET(Ferroelectric FET)를 사용한 메모리 셀로 하여도 좋다(도시하 지 않았음). 상술한 바와 같이, 표시 장치를 구성함으로써, 즉 표시부(DSP)의 하부에 주변 회로(DRV)를 제공함으로써, 표시 부(DSP)와 주변 회로(DRV) 사이의 배선의 리드를 종래보다 짧게 할 수 있어, 화상 데이터 등의 송신에 걸리는 시간을 단축할 수 있다. 또한 배선의 길이를 종래보다 짧게 할 수 있으므로, 표시 장치의 소비 전력을 저감할 수 있다. 또한 표시부(DSP)와 회로부(SIC) 사이에 층(OSC)을 제공함으로써, 표시부(DSP)가 받는, 회로(SIC)에서 발생하는 열의 영향을 완화할 수 있다. 특히 표시부(DSP)에 포함되는 표시 소자가 열에 대한 내성이 낮은 경우에는, 도 3의 (A), (B), 도 4 등에 나타낸 구성으로 함으로써, 표시부(DSP)에 포함되는 표시 소자의 수명을 길게 할 수 있다. 또한 회로부(SIC) 아래쪽에 내각 기구를 제공함으로써, 회로부(SIC)에서 발생하는 열의 영향을 줄일 수 있다(도시하지 않았음). 상기 냉각 기구로서, 예를 들어 열전도가 높은 재료를 사용한 히트 싱크, 냉각수를 사 용한 수냉식 히트 싱크, 팬 등이 있다. <표시 장치 및 표시 시스템의 변형예 2> 또한 도 4에는, 회로부(SIC)와 표시부(DSP) 사이의 층(OSC)에 기억 장치(MDV)를 제공한 예를 나타내었지만, 층 (OSC)에는 기억 장치 이외의 회로, 장치 등이 제공되어도 좋다. 예를 들어 주변 회로(DRV) 및/또는 기능 회로 (MFNC)에 포함되는 회로의 일부를 층(OSC)에 형성하여도 좋다. 도 6의 표시 시스템(200B)은 도 4의 표시 시스템(200A)의 주변 회로(DRV)의 일부의 회로를 층(OSC)에 형성한 예 를 나타낸 것이다. 또한 도 6에서는, 배선(SL)과 배선(GL)이 교차된 부분이 있지만, 이들은 서로 직접적으로 접속되어 있지 않다. 도 6의 표시 시스템(200B)은 도 4의 표시 시스템(200A)의 주변 회로(DRV)의 일부를 회로(DRVa)로서 회로부(SI C)에 형성하고, 도 4의 표시 시스템(200A)의 나머지 주변 회로(DRV)를 회로(DRVb)로서 회로부(OSC)에 형성한 예 를 나타낸 것이다. 구체적으로, 표시 시스템(200B)은 회로(DRVa)가 소스 드라이버 회로와 디지털 아날로그 변환 회로를 포함하고 회로(DRVb)가 게이트 드라이버 회로와 레벨 시프터를 포함하는 구성을 갖는 다.OS 트랜지스터는 Si 트랜지스터보다 전기적 내성이 높다. 그러므로 층(OSC)에 형성하는 트랜지스터를 OS 트랜 지스터로 함으로써, 층(OSC)에 포함되는 회로(예를 들어 게이트 드라이버 회로, 레벨 시프터 등)는 전 압에 대한 높은 내성을 얻을 수 있다. 이에 의하여, 상기 회로를 층(OSC)에 형성함으로써, 상기 회로가 받는 전기적인 부하를 저감할 수 있다. <표시 장치 및 표시 시스템의 변형예 3> 도 1의 (B)에 나타낸 표시 시스템에서는 회로부(SIC)에 주변 회로(DRV)와 기능 회로(MFNC)가 포함되어 있 지만, 본 발명의 일 형태의 표시 시스템에서는 회로부(SIC)에 기능 회로(MFNC)가 제공되고 표시부(DSP)의 구동 이 표시 시스템의 외부 회로에 의하여 수행되어도 좋다. 예를 들어 본 발명의 일 형태의 표시 시스템은 도 7의 (A)에 나타낸 구성으로 할 수 있다. 표시 시스템(200C) 은 표시부(DSP)와 회로부(SIC)를 포함하고, 회로부(SIC)는 기능 회로(MFNC)를 포함한다. 또한 표시부(DSP)는 회로부(CHP)에 전기적으로 접속되어 있고, 회로부(CHP)는 주변 회로(DRV)를 포함한다. 회로부(CHP)는 예를 들 어 외장 드라이버 IC로 할 수 있다. 또한 회로부(CHP)를 표시 시스템(200C)에 실장하는 방법으로서는 예를 들어 COG(Chip On Glass) 방식, COF(Chip On Film) 방식 등이 있다. 또한 표시 시스템(200C)에서, 표시부(DSP)와 회로부(SIC)에 포함되는 트랜지스터는 예를 들어 Si 트랜지스터로 할 수 있다. 또한 Si 트랜지스터 이외에 OS 트랜지스터로 하여도 좋다. 또한 표시 시스템(200C)은 회로부(CHP)와 표시부(DSP)가 전기적으로 접속되는 구성이 아니라, 도 7의 (B)에 나 타낸 바와 같이, 회로부(CHP)와 회로부(SIC)가 전기적으로 접속되는 구성으로 하여도 좋다. 또한 도 7의 (A) 또는 (B)에 나타낸 표시 시스템(200C)의 구체적인 구성의 일례를 도 8에 나타내었다. 또한 도 8에서는, 표시 시스템(200C)에 포함되는 기능 회로(MFNC)의 버스 배선(BSL)과 회로부(CHP)의 버스 배선이 전기 적으로 접속되어 있다. 상술한 바와 같이, 도 1의 (B)의 표시 시스템에서, 표시부(DSP)를 구동시키는 주변 회로(DRV)를 회로부 (SIC)에 제공하지 않고, 드라이버 IC 등으로서 표시 시스템 외부에 제공하여도 좋다. 본 실시형태에 나타낸 바와 같이, 표시 장치 또는 표시 시스템을 구성함으로써, 즉 표시부(DSP) 하부에 주변 회 로(DRV) 및 기능 회로(MFNC)를 제공함으로써, 화상 데이터의 송신 시간의 저감, 소비 전력의 저감에 더하여, 회 로 면적을 증가시키지 않고 보정 회로, GPU 등도 제공할 수 있다. 이에 의하여, 표시부(DSP)의 표시 품질을 높 일 수 있다. 또한 회로 면적이 증가되지 않기 때문에, 이후의 실시형태에서 설명하는 전자 기기의 하우징의 크 기 등의 제약을 받기 어렵게 된다. 또한 종래의 표시 장치(예를 들어 Si 트랜지스터가 사용된 표시 장치)에서는, 화소 어레이와 주변 회로가 같은 평면 위에 제공되어 있지만, OS 트랜지스터를 표시 장치의 트랜지스터에 적용함으로써, 화소 회로, 주변 회로의 미세화가 가능하게 된다. 이에 의하여, 화소 회로 및 화소 회로의 주변 부분(베젤이라고 불리는 경우가 있음) 의 면적을 작게 할 수 있다. 예를 들어 종래의 XR용 표시 장치(예를 들어 Si 트랜지스터가 사용된 표시 장치) 는 해상도가 대략 3000ppi 이하이지만, OS 트랜지스터를 XR용 표시 장치에 적용함으로써 5000ppi 이상의 해상도 를 실현할 수 있다. 또한 유기 EL를 포함한 발광 디바이스를 표시 장치의 화소에 사용한 경우의 상기 발광 디바이스의 휘도에 대해 서도 생각한다. 정전류원이 Si 트랜지스터로 구성된 경우, Si 트랜지스터는 내압이 낮기 때문에, 현실적으로는 3000ppi의 표시 장치에서 1000cd/m2 이하의 휘도밖에 출력하지 못한다. 한편 정전류원이 OS 트랜지스터로 구성 된 경우, OS 트랜지스터는 내압이 높기 때문에, 예를 들어 5000ppi 이상 7000ppi 이하의 표시 장치에서 대략 10000cd/m2 전후의 휘도를 출력할 수 있다. 또한 예를 들어 도 1의 (B)의 표시 시스템 등에서, 회로부(SIC)의 반도체 기판을 실리콘으로 하였을 때, 시스템(인터페이스, 컨버터, 드라이버, 메모리, CPU, GPU)을 6nm 내지 7nm의 테크놀로지 노드로 실장할 수 있다. 이에 의하여, 표시 시스템을 구성하는 회로의 면적을 축소할 수 있다. 상술한 바와 같이 Si 트랜지스터 또는 OSLSI가 사용된 표시 시스템의 내용을 하기 표에 정리한다. 또한 본 명 세서 등에서, OSLSI란 반도체 기판 위에 형성된 Si 트랜지스터 상방에 OS 트랜지스터가 형성된 집적 회로를 말한다. [표 1]"}
{"patent_id": "10-2023-7018044", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "또한 본 실시형태는 본 명세서에서 설명하는 다른 실시형태와 적절히 조합할 수 있다. (실시형태 2) 본 실시형태에서는, 고주파(RF) 회로를 포함하는 표시 시스템의 구성에 대하여 설명한다. 도 9의 (A)는 본 발명의 일 형태의 표시 시스템을 모식적으로 나타낸 도면이다. 도 9의 (A)에 나타낸 표시 시 스템(200D)은 도 1의 (B)의 표시 시스템의 회로부(SIC)에 포함되는 기능 회로(MFNC)에 고주파 회로를 제공한 구성을 갖는다. 또한 도 9의 (A)에는 고주파 회로와 무선 통신을 하는 장치(EXDV)도 나타내었다. 또한 본 실시형태에서는, 표시 시스템(200D)과 장치(EXDV)를 따로따로 형성하지만, 본 발명의 일 형태의 표시 시스템에는 표시 시스템과 무선 통신을 수행하는 외부 장치도 포함될 수 있다. 즉 본 발명의 일 형태의 표시 시스템에는 장치(EXDV)가 포함되어도 좋다. 고주파 회로는 예를 들어 안테나, 송수신 전환기, 저잡음 증폭기, 전력 증폭기, 국부 발진기, 다운컨버전 믹서, 업컨버전 믹서, 대역 필터(band-pass filter), 아날로그 디지털 변환 회로 등을 포함한다. 특히 고주파 회로는 송수신 전환기를 가짐으로써 송신용 RF 신호 경로와 수신용 RF 신호 경로를 전기적으로 분리할 수 있다. 그러므로 고주파 회로에 포함되는 안테나를 송신용 안테나와 수신용 안테나를 겸하는 하 나의 안테나로 할 수 있다. 이에 의하여, 표시 시스템(200D)의 회로 면적을 더 저감할 수 있다. 또한 본 실시형태에서 고주파 회로는 제 1 층에 포함되는 회로(예를 들어 CPU, GPU, 기억 장치 등) 중 어느 하나에서 생성된 전기 신호를 RF 신호로 변환하여 표시 시스템(200D)의 외부로 송신하는 기능을 갖는다. 또한 고주파 회로는 외부로부터 취득한 RF 신호를 전기 신호로 변화하여 제 1 층에 포함되는 회로(예를 들어 CPU, GPU, 기억 장치 등) 중 어느 하나로 송신하는 기능을 갖는다. 또한 장치(EXDV)로서는, 다양한 전자 기기 등을 적용할 수 있다. 예를 들어 장치(EXDV)가 표시 시스템(200D)에 포함되는 하우징의 외부에 존재하는 경우, 장치(EXDV)로서는, 예를 들어 스피커(이어폰, 헤드폰 등도 포함함), 스마트폰 등의 휴대 정보 단말기, 웨어러블형 정보 단말기, 태블릿 정보 단말기, 데스크톱형 정보 단말기, 서버, IoT(Internet of Things)를 탑재한 장치 등의 전자 기기로 할 수 있다.예를 들어 도 10에 나타낸 바와 같이, 표시 시스템(200D)을 헤드 마운트 디스플레이인 전자 기기(HMD)의 표시부 로서 사용하고, 장치(EXDV)를 클라우드 컴퓨팅(CLD)상에 존재하는 서버인 장치(EXDV1)로서 사용하여도 좋다. 또한 장치(EXDV)를 휴대 정보 단말기(예를 들어 스마트폰)인 장치(EXDV2)로 하여도 좋다. 또한 장치(EXDV)를 웨어러블형 정보 단말기인 장치(EXDV3)로 하여도 좋다. 표시 시스템(200D)의 기능 회로(MFNC)에 고주파 회로를 제공함으로써, 도 10에 나타낸 바와 같이, 서버, 휴 대 정보 단말기, 웨어러블형 정보 단말기 등의 전자 기기와 무선 통신을 수행할 수 있다. 이에 의하여, 장치 (EXDV1), 장치(EXDV2) 등으로부터 송신되는 화상 데이터를 전자 기기(HMD)의 표시 시스템(200D)의 고주파 회로 에 의하여 수신할 수 있고, 상기 화상 데이터를 표시 시스템(200D)의 표시부(DSP)에 표시할 수 있다. 또한 표시 시스템(200D)과 장치(EXDV) 간에서 통신되는 정보는 화상 데이터에 한정되지 않는다. 예를 들어 도 11의 (A)에 나타낸 바와 같이, 전자 기기(HMD)를 착용한 사용자(전자 기기(HMD)를 착용하지 않은 사람이어도 좋 음)가 손가락(FG)을 사용하여, 장치(EXDV2) 또는 장치(EXDV3)를 입력 인터페이스로서 사용하여 장치(EXDV2) 또 는 장치(EXDV3)로부터 표시 시스템(200D)에 표시 시스템(200D)을 조작하기 위한 RF 신호를 송신하여도 좋다. 이때 장치(EXDV2) 또는 장치(EXDV3)의 표시부를 비표시 상태로 하고, 전자 기기(HMD)의 표시 시스템(200D)의 표 시부(DSP)에는 장치(EXDV2) 또는 장치(EXDV3)에 원래 표시하는 화상을 AR에 의하여 장치(EXDV2) 또는 장치 (EXDV3)의 표시부에 맞게 표시하여도 좋다. 구체적으로는, 일례로서 도 11의 (A)에 나타낸 바와 같이, 손가락 (FG)으로 실제로 조작되는 장치(EXDV2) 또는 장치(EXDV3)의 표시부는 비표시 상태에 있고, 전자 기기(HMD)의 표 시 시스템(200D)의 표시부(DSP)에는 장치(EXDV2) 또는 장치(EXDV3)에 조작 화면이 표시되어 있는 것처럼 표시 화상(DPC)을 표시하여도 좋다. 또한 예를 들어 도 11의 (B)에 나타낸 바와 같이, 전자 기기(HMD)를 착용한 사용자가 자신의 손(HND)을 움직임 으로써, 장치(EXDV2) 또는 장치(EXDV3)를 조작하기 위한 RF 신호를 전자 기기(HMD)로부터 장치(EXDV2) 또는 장 치(EXDV3)로 송신하여도 좋다. 이때 전자 기기(HMD)는 손(HND)의 동작을 인식하기 위한 촬상 장치, 적외선 센 서 등을 포함하는 것이 바람직하다. 또한 손(HND)(손가락(FG), 손목 등을 포함함)에는 동작을 인식하는 센서 기기를 착용하고, 전자 기기(HMD)가 상기 센서 기기로부터의 센싱 정보를 받음으로써 손(HND)의 동작을 인식하 여도 좋다. 이에 의하여, 장치(EXDV2) 또는 장치(EXDV3)가 전자 기기(HMD)를 착용한 사용자에게서 떨어져 있어 도, 상기 사용자가 장치(EXDV2) 또는 장치(EXDV3)를 조작할 수 있게 된다. 구체적으로는 예를 들어 도 11의 (B)에 나타낸 바와 같이, 전자 기기(HMD)의 표시 시스템(200D)의 표시부(DSP)에는 전자 기기(HMD)의 외계의 풍 경과, 조작 영역(OPA)과 조작 영역(OPA) 내의 아이콘(ICN)이 합성된 표시 화상(DPC)을 표시할 수 있다. 이때 손(HND)(도 11의 (B)에서는 손가락(FG))으로 아이콘(ICN)을 터치하는 등의 제스처에 의하여, 장치(EXDV2) 또는 장치(EXDV3)를 원격 조작할 수 있다. 또한 도 11의 (A) 또는 (B)의 경우, 전자 기기(HMD)의 표시 시스템(200D)의 표시부(DSP)에 표시하는 화상으로서 는, 전자 기기(HMD)의 외계의 풍경이 아니라 장치(EXDV2) 또는 장치(EXDV3)에 원래 표시하는 화상으로 하여도 좋다. 또한 상기 화상은 4K2K로 표시되는 것이 바람직하고, 8K4K로 표시되는 것이 더 바람직하고, 16K8K로 표 시되는 것이 더 바람직하다. 또한 표시 시스템(200D)과 장치(EXDV) 간의 통신은 무선 중계기를 통하여 수행되어도 좋다. 이에 의하여, 표시 시스템(200D)은 표시 시스템(200D) 가까이에 있는 전자 기기뿐만 아니라, 먼 곳에 있는 전자 기기와 통신을 수 행할 수 있다. 또한 이 경우, 용량이 큰 데이터를 송신하기 위하여, 지연 시간을 단축하기 위하여, 통신 속도 를 높이기 위하여, 5세대(5G)의 통신 규격이 사용되는 것이 바람직하다. 또한 5G(5세대 이동 통신 시스템)에서 는 예를 들어 3.7GHz대, 4.5GHz대, 28GHz대 등의 통신 주파수가 사용된다. 5G에 대응하는 반도체 장치는 실리콘 등 1종류의 원소를 주성분으로 사용하는 반도체를 사용하여 제작되는 경우 가 많으므로, 도 9의 (A)의 표시 시스템(200D)과 같이, 기능 회로(MFNC)에 포함되는 고주파 회로는 회로부 (SIC)의 반도체 기판(특히 재료로서 실리콘을 사용한 반도체 기판) 위에 제작할 수 있다. 또한 장치(EXDV)가 표시 시스템(200D)에 포함되는 하우징의 외부가 아니라 표시 시스템(200D)과 같은 하우징에 포함되는 경우, 장치(EXDV)로서는, 예를 들어 도 1의 (B)의 표시 시스템의 기능 회로(MFNC)에 포함되는 일 부의 회로로 하여도 좋다. 구체적으로는, 도 9의 (B)에 나타낸 바와 같이, 기능 회로(MFNC)의 일부의 회로를 기능 회로(MFNCa)로서 회로부 (SIC) 측에 제공하고, 기능 회로(MFNC)의 나머지 회로를 기능 회로(MFNCb)로서 장치(EXDV)에 제공하여도 좋다. 또한 도 9의 (B)의 예에서는, 기능 회로(MFNCa)에는 고주파 회로(41a)가 제공되고, 기능 회로(MFNCb)에는 고주파 회로(41b)가 제공되고, 고주파 회로(41a)와 고주파 회로(41b)가 무선 통신을 수행한다. 또한 도 9의 (B)에 서는, 기능 회로(MFNCa)와 기능 회로(MFNCb)를 통틀어 기능 회로(MFNC)라고 나타내었다. 즉 도 9의 (B)에 나타 낸 기능 회로(MFNC)의 내부에서 무선 통신을 수행하는 구성이다. 도 9의 (B)에 나타낸 표시 시스템(200D)의 구성을 적용함으로써, 기능 회로(MFNC)의 내부에서 무선 통신을 수행 할 수 있다. 이에 의하여, 기능 회로(MFNCa)와 기능 회로(MFNCb) 사이에 전기 신호를 송수신하기 위한 배선을 제공할 필요가 없어지기 때문에 하우징 내부의 회로 면적을 축소할 수 있다. 도 9의 (B)의 구성을 적용할 수 있는 예로서, 헤드 마운트 디스플레이와 이에 제공되는 헤드폰의 구성을 들 수 있다. 구체적으로는, 도 12에 나타낸 바와 같이, 표시 시스템(200D)을 헤드 마운트 디스플레이인 전자 기기 (HMD)의 표시부에 적용하고, 장치(EXDV)를 헤드폰부(HP)에 적용하고, 고주파 회로(41a)로부터 고주파 회로(41 b)에 무선 통신으로 음성 데이터를 송신함으로써, 상기 표시부에 표시된 화상에 맞추어 장치(EXDV)를 포함한 헤 드폰이 상기 음성 데이터를 재생할 수 있다. 또한 도 9의 (A) 또는 (B)에 나타낸 표시 시스템(200D)의 구체적인 구성의 일례를 도 13에 나타내었다. 도 13 에 나타낸 바와 같이, 고주파 회로는 버스 배선(BSL)에 전기적으로 접속되어 있고, 고주파 회로에 의하 여 RF 신호(RFS)를 전기 신호로 변환하여 CPU 등 소정의 회로로 송신하거나, CPU 등 소정의 회로로부터 의 전기 신호를 RF 신호(RFS)로 변환하여 장치(EXDV)로 송신할 수 있다. 또한 본 실시형태에서 설명한 도 9의 (A), (B), 도 13은 도 1의 표시 시스템의 회로부(SIC)의 기능 회로 (MFNC)에 고주파 회로를 제공한 예를 나타낸 것이지만, 본 발명의 일 형태는 이에 한정되지 않는다. 예를 들어 본 발명의 일 형태는 도 3의 표시 시스템(200A)의 회로부(SIC)의 기능 회로(MFNC)에 고주파 회로를 제 공한 구성으로 하여도 좋다(도시하지 않았음). 또한 본 실시형태는 본 명세서에서 설명하는 다른 실시형태와 적절히 조합할 수 있다. (실시형태 3) 본 실시형태에서는, 앞의 실시형태에서 설명한 표시 장치 또는 표시 시스템의 구성예에 대하여 설명한다. 도 14의 (A)는 도 1의 (A)에 나타낸 표시 장치 또는 도 1의 (B) 및 도 2에 나타낸 표시 시스템의 구성예를 나타 낸 단면도이다. 또한 도 14의 (A)에서의 표시 시스템에서는, 회로부(SIC)에 트랜지스터가 포함되고, 표시 부(DSP)에 트랜지스터와, 발광 디바이스(260R)와, 발광 디바이스(260G)와, 발광 디바이스(260B)가 포함되 어 있다. 또한 본 명세서에서는, 발광 디바이스(260R)와, 발광 디바이스(260G)와, 발광 디바이스(260B)를 통틀 어 발광 디바이스라고 부른다. 또한 도 14의 (A)에는 트랜지스터 및 트랜지스터의 채널 길이 방향의 단면도를 나타내었다. 트랜지스터는 기판 위에 제공되고, 소자 분리층, 도전체, 절연체, 기판의 일부 로 이루어지는 반도체 영역, 소스 영역 또는 드레인 영역으로서 기능하는 저저항 영역(172a) 및 저저항 영 역(172b)을 포함한다. 또한 트랜지스터는 예를 들어 앞의 실시형태에서 설명한 주변 회로(DRV)에 포함되 는 소스 드라이버 회로 또는 게이트 드라이버 회로에 적용할 수 있다. 또한 예를 들어 트랜지스터 는 기능 회로(MFNC)에 포함되는 기억 장치, GPU 등에 적용할 수 있다. 또한 기판으로서는 반도체 기판(예를 들어 단결정 기판 또는 실리콘 기판)을 사용하는 것이 바람직하다. 트랜지스터는 일례로서 반도체 영역의 상면 및 채널 폭 방향의 측면이 절연체를 개재하여 도전 체로 덮여 있다. 이와 같이, 트랜지스터를 Fin형으로 함으로써, 실효적인 채널 폭이 증대하여 트랜 지스터의 온 특성을 향상시킬 수 있다. 또한 게이트 전극의 전계의 기여를 높일 수 있기 때문에, 트랜지 스터의 오프 특성을 향상시킬 수 있다. 또한 트랜지스터는 p채널형 및 n채널형 중 어느 쪽이어도 좋다. 반도체 영역에서 채널이 형성되는 영역, 그 근방의 영역, 소스 영역 또는 드레인 영역이 되는 저저항 영역 (172a) 및 저저항 영역(172b) 등에서 실리콘계 반도체 등의 반도체를 포함하는 것이 바람직하고, 단결정 실리콘 을 포함하는 것이 바람직하다. 또는 Ge(저마늄), SiGe(실리콘 저마늄), GaAs(갈륨 비소), GaAlAs(갈륨 알루미 늄 비소), GaN(질화 갈륨) 등을 포함하는 재료로 형성하여도 좋다. 결정 격자에 응력을 가하여 격자 간격을 변 화시킴으로써 유효 질량을 제어한 실리콘을 사용한 구성으로 하여도 좋다. 또는 GaAs와 GaAlAs 등을 사용함으 로써, 트랜지스터를 HEMT(High Electron Mobility Transistor)로 하여도 좋다.게이트 전극으로서 기능하는 도전체에는 비소, 인 등의 n형 도전성을 부여하는 원소, 또는 붕소 등의 p형 도전성을 부여하는 원소를 포함한 실리콘 등의 반도체 재료, 금속 재료, 합금 재료, 또는 금속 산화물 재료 등 의 도전성 재료를 사용할 수 있다. 또한 도전체의 재료에 따라 일함수가 결정되기 때문에, 상기 도전체의 재료를 선택함으로써 트랜지스터의 문턱 전압을 조정할 수 있다. 구체적으로는, 도전체에 질화 타이타늄, 질화 탄탈럼 등의 재료를 사용하는 것이 바람 직하다. 또한 도전성과 매립성을 양립하기 위하여 도전체에 텅스텐, 알루미늄 등의 금속 재료를 적층하여 사용 하는 것이 바람직하고, 특히 텅스텐을 사용하는 것이 내열성의 관점에서 바람직하다. 소자 분리층은 기판 위에 형성된 복수의 트랜지스터들을 분리하기 위하여 제공되어 있다. 소자 분리 층은 예를 들어 LOCOS(Local Oxidation of Silicon)법, STI(Shallow Trench Isolation)법, 메사 분리 (mesa isolation)법 등을 사용하여 형성할 수 있다. 또한 도 14의 (A)에 나타낸 트랜지스터는 일례이고, 그 구조에 한정되지 않고, 회로 구성, 구동 방법 등에 따라 적절한 트랜지스터를 사용하면 좋다. 예를 들어 트랜지스터는 FIN형이 아니라 플레이너형 구조로 하 여도 좋다. 도 14의 (A)에 나타낸 트랜지스터에서는, 절연체, 절연체, 및 절연체가 순차적으로 적층되 어 있다. 절연체 및 절연체에는, 예를 들어 산화 실리콘, 산화질화 실리콘, 질화산화 실리콘, 질화 실리콘, 산 화 알루미늄, 산화질화 알루미늄, 질화산화 알루미늄, 질화 알루미늄 등을 사용하면 좋다. 또한 본 명세서에서 산화질화 실리콘이란 그 조성에서 질소보다 산소의 함유량이 많은 재료를 가리키고, 질화산 화 실리콘이란 그 조성에서 산소보다 질소의 함유량이 많은 재료를 가리킨다. 또한 본 명세서에서 산화질화 알 루미늄이란 그 조성에서 질소보다 산소의 함유량이 많은 재료를 가리키고, 질화산화 알루미늄이란 그 조성에서 산소보다 질소의 함유량이 많은 재료를 가리킨다. 절연체는 절연체 및 절연체로 덮여 있는 트랜지스터 등으로 인하여 생기는 단차를 평탄화 하는 평탄화막으로서의 기능을 가져도 좋다. 예를 들어 절연체의 상면은 평탄성을 높이기 위하여 화학 기 계 연마(CMP: Chemical Mechanical Polishing)법 등을 사용한 평탄화 처리에 의하여 평탄화되어도 좋다. 또한 절연체로서는, 기판 또는 트랜지스터 등으로부터 절연체 상방의 영역으로 수소, 불순 물 등이 확산되지 않도록 하는 배리어성을 갖는 막을 사용하는 것이 바람직하다. 수소에 대한 배리어성을 갖는 막에는, 예를 들어 CVD법으로 형성한 질화 실리콘을 사용할 수 있다. 여기서, 절 연체 상방에 제공된 회로 소자로 수소가 확산됨으로써 상기 회로 소자의 특성이 저하되는 경우가 있다. 따라서 상기 회로 소자와 트랜지스터 사이에 수소의 확산을 억제하는 막을 사용하는 것이 바람직하다. 수 소의 확산을 억제하는 막이란, 구체적으로는 수소의 이탈량이 적은 막이다. 수소의 이탈량은 예를 들어 승온 이탈 가스 분석법(TDS) 등을 사용하여 분석할 수 있다. 예를 들어 절연체 의 수소의 이탈량은, TDS 분석에서 막의 표면 온도가 50℃내지 500℃의 범위에서 수소 원자로 환산한 이탈 량이 절연체의 면적당으로 환산하여 10×1015atoms/cm2 이하, 바람직하게는 5×1015atoms/cm2 이하이면 좋다. 또한 절연체는 절연체보다 유전율이 낮은 것이 바람직하다. 예를 들어 절연체의 비유전율은 4 미만이 바람직하고, 3 미만이 더 바람직하다. 또한 예를 들어 절연체의 비유전율은 절연체의 비유전 율의 0.7배 이하가 바람직하고, 0.6배 이하가 더 바람직하다. 유전율이 낮은 재료를 층간막에 사용함으로써, 배선 사이에 발생하는 기생 용량을 저감할 수 있다. 또한 절연체, 절연체, 및 절연체에는, 절연체 상방에 제공된 회로 소자(예를 들어 표시부 (DSP)에 포함되는 트랜지스터, 발광 디바이스(260R) 내지 발광 디바이스(260B) 등)에 접속되는 도전체 등이 매립되어 있다. 또한 도전체는 플러그 또는 배선으로서의 기능을 갖는다. 또한 플러그 또는 배선으로서의 기능을 갖는 도전체에는, 복수의 구조를 합쳐서 동일한 부호를 부여하는 경우가 있다. 또한 본 명세서 등에서 배선과, 배선에 접속되는 플러그가 일체물이어도 좋다. 즉 도전체의 일부가 배선으로서 기능하 는 경우 및 도전체의 일부가 플러그로서 기능하는 경우도 있다. 각 플러그 및 배선(도전체, 후술하는 도전체, 도전체 등)의 재료로서는, 금속 재료, 합금 재료, 금속 질화물 재료, 또는 금속 산화물 재료 등의 도전성 재료를 단층으로 또는 적층하여 사용할 수 있다. 내열 성과 도전성을 양립하는 텅스텐, 몰리브데넘 등의 고융점 재료를 사용하는 것이 바람직하고, 텅스텐을 사용하는 것이 바람직하다. 또는 알루미늄, 구리 등의 저저항 도전성 재료로 형성하는 것이 바람직하다. 저저항 도전성 재료를 사용함으로써, 배선 저항을 감소시킬 수 있다. 또한 절연체 상층에는 배선층을 제공하여도 좋다(도시하지 않았음). 도 14의 (A)에서, 절연체 상방에 절연체가 적층되어 있다. 절연체는 트랜지스터의 하지막 으로서 기능한다. 또한 절연체 위에는, 트랜지스터의 게이트 전극 또는 배선으로서 기능하는 도전체가 형성되어 있다. 또한 절연체 위 및 도전체 위에는, 트랜지스터의 게이트 절연막으로서 기능하는 절연체가 형성되어 있다. 또한 절연체 및 절연체에는, 트랜지스터 및 회로부(SIC)에 포함되는 회로 소자 등에 접속되는 도전체 등이 매립되어 있다. 또한 도전체는 플러그 또는 배선으로서의 기능을 갖는다. 또한 절연체 위에는, 반도체가 형성되어 있다. 또한 도 14의 (A)에서, 반도체는 도전체와 중첩되는 영역을 포함하도록 형성되어 있다. 반도체로서는 예를 들어 실시형태 4에서 설명하는 금속 산화물을 적용할 수 있다. 또한 반도체로서 는 예를 들어 Si, Ge 등의 반도체 재료를 적용할 수 있다. 또한 반도체로서는 예를 들어 ZnSe, CdS, GaAs, InP, GaN, SiGe 등의 화합물 반도체를 사용할 수 있다. 또한 반도체로서는 예를 들어 카본 나노 튜 브, 유기 반도체를 사용할 수 있다. 또한 절연체 위, 도전체 위, 및 반도체 위에는, 도전체가 형성되어 있다. 또한 도전체 는 한 쌍의 도전체가 반도체를 사이에 끼우도록 형성되어 있다. 또한 한 쌍의 도전체 중 한쪽은 트랜지스터의 소스 및 드레인 중 한쪽으로서 기능하고, 한 쌍의 도전체 중 다른 쪽은 트랜지 스터의 소스 및 드레인 중 다른 쪽으로서 기능한다. 또한 도 14의 (A)에서, 한 쌍의 도전체 중 한쪽 은 도전체에 전기적으로 접속되도록 형성되어 있다. 또한 도 14의 (A)에서, 도전체가 트랜지스터의 소스 및 드레인 중 한쪽에 전기적으로 접속된 예를 나 타내었지만, 도전체는 트랜지스터의 소스 및 드레인 중 다른 쪽에 전기적으로 접속되어도 좋고, 트랜 지스터의 게이트에 전기적으로 접속되어도 좋다. 절연체 위, 도전체 위, 및 반도체 위에는 절연체 및 절연체가 순차적으로 형성되어 있다. 다음으로, 절연체 위에 제공될 수 있는 발광 디바이스(260R), 발광 디바이스(260G), 발광 디바이스(260B) 에 대하여 설명한다. 또한 각 발광 디바이스는 상이한 색의 광을 방출하는 것이 바람직하다. 본 실시형태에서 는, 일례로서, 발광 디바이스(260R)가 적색을 나타내고, 발광 디바이스(260G)가 녹색을 나타내고, 발광 디바이 스(260B)가 청색을 나타내는 구성으로 하고, 또한 각 발광 디바이스가 쉽게 구별되도록 각 발광 디바이스의 발 광 영역 내에 R, G, B의 부호를 붙였다. 절연체 위에는 절연체가 형성되어 있다. 또한 절연체 및 절연체에는 트랜지스터 및 회로부(SIC)에 포함되는 회로 소자 등에 접속되는 도 전체 등이 매립되어 있다. 또한 도전체는 플러그 또는 배선으로서의 기능을 갖는다. 절연체 위, 도전체 위에는, 발광 디바이스(260R), 발광 디바이스(260G), 및 발광 디바이스(260B) 각 각의 화소 전극이 형성되어 있다. 또한 화소 전극의 단부를 덮어 절연체가 제공되어 있다. 절연체의 단부는 테이퍼 형상인 것이 바람직하다. 화소 전극 상면과, 절연체의 일부 표면에는, EL층(262R), EL층(262G), 및 EL층(262B)이 형성되어 있 다. 또한 형성 시에는, EL층(262R), EL층(262G), 및 EL층(262B)의 단부는 절연체 위에 위치하는 것이 바 람직하다.또한 도 14의 (A)에서는, 복수의 화소 전극 위에, 적색(R)의 발광을 나타내는 EL층(262R), 적색(G)의 발광 을 나타내는 EL층(262G), 청색(B)의 발광을 나타내는 EL층(262B)이 각각 독립적으로 제공되어 있다. 이와 같이, 복수의 화소 전극 위에 색마다 상이한 발광층을 형성하는 구조를 본 명세서 등에서는 SBS(Side By Side) 구조라고 부른다. 또한 도 14의 (A)의 표시 장치(표시 시스템)는 SBS 구조를 갖지만, 상기 표시 장치(표시 시스템)는 복수의 화소 전극 위에 백색 발광을 나타내는 연속된 발광층을 형성하고, 상기 복수의 화소 전극 위에 적색(R), 녹색(G), 및 청색(B)의 착색층(예를 들어 컬러 필터)을 제공한 구조로 하여도 좋다. 특히 백색의 발광층을 후 술하는 탠덤 구조로 형성함으로써, 휘도가 높고 또한 수명이 긴 백색 발광 디바이스로 할 수 있다. EL층(262R), EL층(262G), 및 EL층(262B)은 각각 발광성 유기 화합물을 포함하는 층(발광층) 외에 전자 주입층, 전자 수송층, 정공 주입층, 및 정공 수송층 중 하나 이상을 포함하여도 좋다. 예를 들어 EL층(262R), EL층(262G), 및 EL층(262B)으로서는, 도 15의 (A)에 나타낸 바와 같이, 층, 발광 층, 층 등의 복수의 층으로 구성할 수 있다. 층은 예를 들어 전자 주입성이 높은 물질을 포 함하는 층(전자 주입층) 및 전자 수송성이 높은 물질을 포함하는 층(전자 수송층) 등을 포함할 수 있다. 발광 층은 예를 들어 발광성 화합물을 포함한다. 층은 예를 들어 정공 주입성이 높은 물질을 포함하는 층(정공 주입층) 및 정공 수송성이 높은 물질을 포함하는 층(정공 수송층)을 포함할 수 있다. 한 쌍의 전극 사이에 제공된 층, 발광층, 및 층을 갖는 구성은 하나의 발광 유닛으로서 기능 할 수 있고, 본 명세서 등에서는 도 15의 (A)의 구성을 싱글 구조라고 부른다. 또한 도 15의 (B)에 나타낸 바와 같이, 층과 층 사이에 복수의 발광층(발광층, 발광층 , 발광층)이 제공된 구성도 싱글 구조의 베리에이션이다. 또한 도 15의 (C)에 나타낸 바와 같이, 복수의 발광 유닛(EL층(262a), EL층(262b))이 중간층(전하 발생 층)을 개재하여 직렬로 접속된 구성을 본 명세서에서는 탠덤 구조라고 부른다. 또한 본 명세서 등에서는, 도 15의 (C)에 나타낸 구성을 탠덤 구조라고 부르지만, 이에 한정되지 않고, 예를 들어 탠덤 구조를 스택(stack) 구조라고 불러도 좋다. 또한 탠덤 구조로 함으로써, 고휘도 발광이 가능한 발광 디바이스로 할 수 있다. 발광 디바이스의 발광색은, EL층을 구성하는 재료에 따라 적색, 녹색, 청색, 시안, 마젠타, 황색, 또 는 백색 등으로 할 수 있다. 또한 발광 디바이스에 마이크로캐비티 구조를 부여함으로써 색 순도를 더 높 일 수 있다. 백색광을 방출하는 발광 디바이스는 발광층에 2종류 이상의 발광 물질을 포함하는 구성으로 하는 것이 바람직하 다. 백색 발광을 얻기 위해서는, 2개 이상의 발광 물질의 각 발광이 보색의 관계가 되는 발광 물질을 선택하면 좋다. 발광층에는, R(적색), G(녹색), B(청색), Y(황색), O(주황색) 등의 발광을 나타내는 발광 물질을 2개 이상 포함 하는 것이 바람직하다. 또는 발광 물질을 2개 이상 갖고, 각 발광 물질의 발광은 R, G, B 중 2개 이상의 색의 스펙트럼 성분을 포함하는 것이 바람직하다. 또한 도 14의 (A)에 나타낸 바와 같이, 상이한 색의 발광 디바이스 간에서 2개의 EL층 사이에 틈이 있다. 이와 같이 EL층(262R), EL층(262G), 및 EL층(262B)이 서로 접하지 않도록 제공되는 것이 바람직하다. 이로써 인접한 2개의 EL층을 통하여 전류가 흘러, 의도치 않은 발광이 발생되는 것(크로스토크라고도 함)을 적합하게 방지할 수 있다. 그러므로 콘트라스트를 높일 수 있고, 표시 품질이 높은 표시 장치를 실현할 수 있다. EL층(262R), EL층(262G), 및 EL층(262B)은 메탈 마스크 등의 섀도 마스크를 사용한 진공 증착법 등에 의하여 개 별적으로 형성할 수 있다. 또는 포토리소그래피법으로 이들을 개별적으로 제작하여도 좋다. 포토리소그래피법 을 사용함으로써, 메탈 마스크를 사용한 경우에는 실현이 어려운, 정세도가 높은 표시 장치를 실현할 수 있다. 절연체 위, EL층(262R) 위, EL층(262G) 위, 및 EL층(262G) 위에는, 공통 전극이 제공되어 있다. 공 통 전극은 각 발광 디바이스에 의하여 공유되는 연속된 층으로서 제공되어 있다. 이 경우, 발광 디바이스(260R), 발광 디바이스(260G), 및 발광 디바이스(260B)는 화소 전극과 공통 전극 사이에 각각 EL층(262R), EL층(262G), 및 EL층(262B)이 제공된 구성을 갖는다. EL층(262R)은 적어도 적 색의 파장 영역에 강도를 갖는 광을 방출하는 발광성 유기 화합물을 포함한다. 또한 발광 디바이스(260G)에 포함되는 EL층(262G)은 적어도 녹색의 파장 영역에 강도를 갖는 광을 방출하는 발광성 유기 화합물을 포함한다. 발광 디바이스(260B)에 포함되는 EL층(262B)은 적어도 청색의 파장 영역에 강도를 갖는 광을 방출하는 발광성 유기 화합물을 포함한다. 또한 도 14의 (A)에 나타낸 바와 같이, 화소 전극은 각 발광 디바이스에 제공되어 있다. 여기서, 예를 들 어, 상기와 반대로, 화소 전극으로서 반사성 도전체 재료를, 공통 전극으로서 투광성 도전체 재료를 선택함으로써, 상면 사출형(톱 이미션형) 표시 장치로 할 수 있다. 또한 공통 전극 위에는 발광 디바이스(260R), 발광 디바이스(260G), 및 발광 디바이스(260B)를 덮어 보호 층이 제공되어 있다. 보호층은 위쪽으로부터 각 발광 디바이스로 물 등의 불순물이 확산되는 것을 방지하는 기능을 갖는다. 보호층은 예를 들어 적어도 무기 절연막을 포함하는 단층 구조 또는 적층 구조를 가질 수 있다. 무기 절 연막으로서는 예를 들어 산화 실리콘막, 산화질화 실리콘막, 질화산화 실리콘막, 질화 실리콘막, 산화 알루미늄 막, 산화질화 알루미늄막, 산화 하프늄막 등의 산화물막 또는 질화물막이 있다. 또는 보호층에 인듐 갈륨 산화물, 인듐 갈륨 아연 산화물 등의 반도체 재료를 사용하여도 좋다. 또한 보호층은 ALD법, CVD법, 및 스퍼터링법을 사용하여 형성하면 좋다. 또한 보호층으로서, 무기 절연막을 포함하는 구성을 예시하였지만 이에 한정되지 않는다. 예를 들어, 보호층으로서 무기 절연막과 유기 절연막의 적층 구조로 하여도 좋다. 상술한 발광 디바이스(260R), 발광 디바이스(260G), 및 발광 디바이스(260B)는 일례로서 각각 매트릭스로 배열 될 수 있다. 또한 발광 디바이스의 배열 방법은 이에 한정되지 않고, 델타 배열, 지그재그 배열 등의 배열 방 법을 적용하여도 좋고, 펜타일 배열을 사용할 수도 있다. 또한 발광 디바이스(260R), 발광 디바이스(260G), 및 발광 디바이스(260B)로서는, OLED(Organic Light Emitting Diode) 또는 QLED(Quantum-dot Light Emitting Diode) 등의 EL 소자를 사용하는 것이 바람직하다. EL 소자가 갖는 발광 물질로서는 형광을 방출하는 물질(형광 재료), 인광을 방출하는 물질(인광 재료), 무기 화 합물(퀀텀닷(quantum dot) 재료 등), 열 활성화 지연 형광을 나타내는 물질(열 활성화 지연 형광(Thermally activated delayed fluorescence: TADF) 재료) 등을 들 수 있다. 또한 본 발명의 일 형태의 표시 장치 또는 표시 시스템은 도 14의 (A)의 구성에 한정되지 않는다. 도 14의 (A)에서는, 3가지 색깔의 발광 디바이스를 사용한 표시 장치 또는 표시 시스템에 대하여 설명하였지만, 본 발명 의 일 형태의 표시 장치 또는 표시 시스템은 예를 들어 백색 발광 디바이스와 각 색의 착색층을 사용한 표시 장 치 또는 표시 시스템으로 하여도 좋다. 또한 이 경우, 백색의 발광 디바이스로서 예를 들어 도 15의 (A) 또는 (B)에 나타낸 싱글 구조의 발광층을 사용하여도 좋고, 도 15의 (C)에 나타낸 탠덤 구조의 발광층을 사용하여도 좋다. 도 14의 (B)에서는, 백색의 광을 나타내는 발광 디바이스(260W)가 포함된다. 발광 디바이스(260W)는 화소 전극 과 공통 전극 사이에 백색의 광을 나타내는 EL층(262W)을 포함한다. EL층(262W)은 예를 들어 각각의 발광색이 보색의 관계가 되도록 선택된 2개 이상의 발광층이 적층된 구성으로 할 수 있다. 또한 발광층 사이에 전하 발생층이 끼워진 적층형 EL층을 사용하여도 좋다. 도 14의 (B)에는 나란히 배치된 3개의 발광 디바이스(260W)를 나타내었다. 왼쪽의 발광 디바이스(260W)의 상부 에는 착색층(264R)이 제공되어 있다. 착색층(264R)은 적색의 광을 투과시키는 대역 필터로서 기능한다. 이와 마찬가지로 중앙의 발광 디바이스(260W)의 상부에는 녹색의 광을 투과시키는 착색층(264G)이 제공되고, 오른쪽 의 발광 디바이스(260W)의 상부에는 청색의 광을 투과시키는 착색층(264B)이 제공되어 있다. 이에 의하여, 표 시 장치는 컬러 화상을 표시할 수 있다. 여기서, 인접한 2개의 발광 디바이스(260W) 간에서 EL층(262W) 및 공통 전극은 각각 분리되어 있다. 이로 써 인접한 2개의 발광 디바이스(260W) 간에서 EL층(262W)을 통하여 전류가 흘러, 의도치 않은 발광이 발생되는 것을 적합하게 방지할 수 있다. 특히 EL층(262W)으로서 2개의 발광층 사이에 전하 발생층이 제공되는 적층형 EL 소자를 사용한 경우에는, 정세도가 높을수록, 즉 인접 화소 간의 거리가 작을수록, 크로스토크의 영향이 현 저히 나타나고, 콘트라스트가 저하된다는 등의 문제가 생긴다. 그러므로 이와 같은 구성으로 함으로써, 높은 정세도와 높은 콘트라스트를 겸비하는 표시 장치를 실현할 수 있다. EL층(262W)과 공통 전극의 분리는 포토리소그래피법에 의하여 수행하는 것이 바람직하다. 이로써 발광 디 바이스 간의 간격을 좁힐 수 있기 때문에, 예를 들어 메탈 마스크 등의 섀도마스크를 사용한 경우와 비교하여,높은 개구율의 표시 장치를 실현할 수 있다. 도 16은 도 3의 (A)에 나타낸 표시 장치 또는 도 4 및 도 6에 나타낸 표시 시스템의 구성예를 나타낸 단면도이 다. 또한 도 16에서의 표시 시스템에서는, 회로부(SIC)에 트랜지스터가 포함되고, 층(OSC)에 트랜지스터 가 포함되고, 표시부(DSP)에 트랜지스터와, 발광 디바이스(260R)와, 발광 디바이스(260G)와, 발광 디 바이스(260B)가 포함되어 있다. 또한 도 16에는 트랜지스터, 트랜지스터, 트랜지스터의 채널 길이 방향의 단면도를 나타내었다. 또한 회로부(SIC)와 표시부(DSP)에 대해서는 도 14의 (A)의 설명을 원용할 수 있으므로, 이하에서는 층(OSC)에 포함되는 트랜지스터와 그 주변의 구성에 대하여 설명한다. 회로부(SIC)의 절연체 상방에는 절연체가 형성되어 있다. 절연체 에는 산소, 수소에 대하여 배 리어성이 있는 물질을 사용하는 것이 바람직하다. 또한 절연체로서는, 예를 들어 절연체와 같은 재료를 사용할 수 있다. 또한 도 17의 (A) 및 (B)에 나타낸 바와 같이, 절연체 위에는 절연체 및 절연체가 형성되어 있 다. 절연체로서는, 기판 또는 트랜지스터가 제공되는 영역 등으로부터 트랜지스터가 제공되는 영역으로 수소, 불순물이 확산되지 않도록 하는 배리어성을 갖는 막을 사용하는 것이 바람직하다. 따라서 절연 체에는 예를 들어 CVD법으로 형성한 질화 실리콘을 사용할 수 있다. 또한 절연체로서는 예를 들어 절연체와 같은 재료를 사용할 수 있다. 절연체 위쪽에는 트랜지스터가 제공되어 있다. 도 17의 (A) 및 (B)에 나타낸 바와 같이, 트랜지스터는 절연체 위의 절연체와, 절연체 또 는 절연체에 매립되도록 배치된 도전체(도전체(503a) 및 도전체(503b))와, 절연체 위 및 도전체 위의 절연체와, 절연체 위의 절연체와, 절연체 위의 산화물(530a)과, 산화물(530a) 위의 산화물(530b)과, 산화물(530b) 위의 도전체(542a)와, 도전체(542a) 위의 절연체(571a)와, 산화물(530b) 위의 도전체(542b)와, 도전체(542b) 위의 절연체(571b)와, 산화물(530b) 위의 절연체와, 절연체 위 의 절연체와, 절연체 위의 절연체와, 절연체 위에 위치하고 산화물(530b)의 일부와 중첩되 는 도전체(도전체(560a) 및 도전체(560b))와, 절연체, 절연체, 산화물(530a), 산화물(530b), 도전체(도전체(542a) 및 도전체(542b)), 절연체(절연체(571a) 및 절연체(571b)) 위에 배치되는 절연 체를 포함한다. 여기서 도 17의 (A) 및 (B)에 나타낸 바와 같이, 절연체는 절연체의 상면, 절 연체의 측면, 산화물(530a)의 측면, 산화물(530b)의 측면 및 상면, 도전체의 측면, 절연체의 측 면, 절연체의 측면, 절연체의 측면, 및 절연체의 하면과 접한다. 또한 도전체의 상면은 절연체의 상부, 절연체의 상부, 절연체의 상부, 및 절연체의 상면과 높이가 실질적으로 일 치하도록 배치된다. 또한 절연체는 도전체의 상면, 절연체의 상부, 절연체의 상부, 절연 체의 상부, 및 절연체의 상면 중 적어도 어느 것의 일부와 접한다. 절연체 및 절연체에는 산화물(530b)에 도달하는 개구가 제공된다. 상기 개구 내에 절연체, 절 연체, 절연체, 및 도전체가 배치되어 있다. 또한 트랜지스터의 채널 길이 방향에서, 절연 체(571a)와 절연체(571b) 사이 및 도전체(542a)와 도전체(542b) 사이에 도전체, 절연체, 절연체 , 및 절연체가 제공되어 있다. 절연체는 도전체의 측면과 접하는 영역과 도전체의 밑면과 접하는 영역을 포함한다. 산화물은 절연체 위에 배치된 산화물(530a)과, 산화물(530a) 위에 배치된 산화물(530b)을 포함하는 것이 바람직하다. 산화물(530b) 아래에 산화물(530a)을 포함함으로써, 산화물(530a)보다 아래쪽에 형성된 구조 물로부터 산화물(530b)로 불순물이 확산되는 것을 억제할 수 있다. 또한 트랜지스터에서 산화물은 산화물(530a)과 산화물(530b)의 2층이 적층된 구성을 갖지만, 본 발명 은 이에 한정되지 않는다. 예를 들어 트랜지스터는 산화물(530b)의 단층 구조 또는 3층 이상의 층의 적층 구조를 갖는 구성으로 할 수 있다. 또는 산화물(530a) 및 산화물(530b)이 각각 적층 구조를 갖는 구성으로 할 수 있다. 도전체는 제 1 게이트(톱 게이트라고도 함) 전극으로서 기능하고, 도전체는 제 2 게이트(백 게이트라 고도 함) 전극으로서 기능한다. 또한 절연체, 절연체, 및 절연체는 제 1 게이트 절연체로서 기 능하고, 절연체 및 절연체는 제 2 게이트 절연체로서 기능한다. 또한 게이트 절연체를 게이트 절연 층 또는 게이트 절연막이라고 부르는 경우도 있다. 또한 도전체(542a)는 소스 및 드레인 중 한쪽으로서 기능하 고, 도전체(542b)는 소스 및 드레인 중 다른 쪽으로서 기능한다. 또한 산화물에서 도전체와 중첩되 는 영역의 적어도 일부는 채널 형성 영역으로서 기능한다. 여기서, 도 17의 (A)에서의 채널 형성 영역 근방의 확대도를 도 18의 (A)에 나타내었다. 산화물(530b)에 산소 가 공급됨으로써, 도전체(542a)와 도전체(542b) 사이의 영역에 채널 형성 영역이 형성된다. 따라서 도 18의 (A)에 나타낸 바와 같이, 산화물(530b)은 트랜지스터의 채널 형성 영역으로서 기능하는 영역(530bc)과, 영 역(530bc)을 사이에 두고 제공되고 소스 영역 또는 드레인 영역으로서 기능하는 영역(530ba) 및 영역(530bb)을 포함한다. 영역(530bc)은 적어도 일부가 도전체와 중첩되어 있다. 바꿔 말하면, 영역(530bc)은 도전체 (542a)와 도전체(542b) 사이의 영역에 제공되어 있다. 영역(530ba)은 도전체(542a)와 중첩하여 제공되고, 영역 (530bb)은 도전체(542b)와 중첩하여 제공되어 있다. 채널 형성 영역으로서 기능하는 영역(530bc)은 영역(530ba) 및 영역(530bb)보다 산소 결손(본 명세서 등에서는 금속 산화물 내의 산소 결손을 VO(oxygen vacancy)라고 부르는 경우가 있음)이 적거나 불순물 농도가 낮기 때문 에, 캐리어 농도가 낮고 저항이 높은 영역이다. 따라서 영역(530bc)은 i형(진성) 또는 실질적으로 i형이라고 할 수 있다. 금속 산화물을 사용한 트랜지스터는 금속 산화물 내의 채널이 형성되는 영역에 불순물 또는 산소 결손(VO)이 존 재하면 전기 특성이 변동되기 쉬워 신뢰성이 떨어지는 경우가 있다. 또한 산소 결손(VO) 근방의 수소가 산소 결 손(VO)에 들어가 결함(이하, VOH라고 부르는 경우가 있음)을 형성하여, 캐리어가 되는 전자를 생성하는 경우가 있다. 그러므로 산화물 반도체 내의 채널이 형성되는 영역에 산소 결손이 포함되면, 트랜지스터는 노멀리 온 특성(게이트 전극에 전압을 인가하지 않아도 채널이 존재하고, 트랜지스터에 전류가 흐르는 특성)을 갖기 쉽다. 따라서 산화물 반도체 내의 채널이 형성되는 영역에서는 불순물, 산소 결손, 및 VOH는 가능한 한 저감되어 있는 것이 바람직하다. 또한 소스 영역 또는 드레인 영역으로서 기능하는 영역(530ba) 및 영역(530bb)은 산소 결손(VO)이 많거나, 수소, 질소, 금속 원소 등의 불순물의 농도가 높기 때문에, 캐리어 농도가 증가하여 저항이 감소된 영역이다. 즉 영역(530ba) 및 영역(530bb)은 영역(530bc)보다 캐리어 농도가 높고 저항이 낮은 n형 영역이다. 여기서, 채널 형성 영역으로서 기능하는 영역(530bc)의 캐리어 농도는 1×1018cm-3 이하인 것이 바람직하고, 1× 1017cm-3 미만인 것이 더 바람직하고, 1×1016cm-3 미만인 것이 더욱 바람직하고, 1×1013cm-3 미만인 것이 더욱더 바람직하고, 1×1012cm-3 미만인 것이 나아가 더욱더 바람직하다. 또한 채널 형성 영역으로서 기능하는 영역 (530bc)의 캐리어 농도의 하한값은 특별히 한정되지 않고, 예를 들어 1×10-9cm-3로 할 수 있다. 또한 캐리어 농도가 영역(530ba) 및 영역(530bb)의 캐리어 농도와 동등하거나 이보다 낮으며, 영역(530bc)의 캐 리어 농도와 동등하거나 이보다 높은 영역이 영역(530bc)과 영역(530ba) 또는 영역(530bb) 사이에 형성되어도 좋다. 즉 상기 영역은 영역(530bc)과 영역(530ba) 또는 영역(530bb)의 접합 영역으로서 기능한다. 상기 접합 영역에서는 수소 농도가 영역(530ba) 및 영역(530bb)의 수소 농도와 동등하거나 이보다 낮으며, 영역(530bc)의 수소 농도와 동등하거나 이보다 높은 경우가 있다. 또한 상기 접합 영역에서는 산소 결손이 영역(530ba) 및 영 역(530bb)의 산소 결손과 동등하거나 이보다 적으며, 영역(530bc)의 산소 결손과 동등하거나 이보다 많은 경우 가 있다. 또한 도 18의 (A)에는 영역(530ba), 영역(530bb), 및 영역(530bc)이 산화물(530b)에 형성되는 예를 나타내었지 만, 본 발명은 이에 한정되지 않는다. 예를 들어 상기 각 영역은 산화물(530b)뿐만 아니라 산화물(530a)에도 형성되어도 좋다. 또한 산화물에서는, 각 영역의 경계를 명확하게 검출하기가 어려운 경우가 있다. 각 영역 내에서 검출되 는 금속 원소, 그리고 수소 및 질소 등의 불순물 원소의 농도는 영역마다 단계적으로 변화되는 것에 한정되지 않고, 각 영역 내에서도 연속적으로 변화되어도 좋다. 즉 채널 형성 영역에 가까운 영역일수록 금속 원소, 그 리고 수소 및 질소 등의 불순물 원소의 농도가 감소되면 좋다.트랜지스터에서는, 채널 형성 영역을 포함한 산화물(산화물(530a) 및 산화물(530b))로서, 반도체로서 기능하는 금속 산화물(이하, 산화물 반도체라고도 함)을 사용하는 것이 바람직하다. 또한 반도체로서 기능하는 금속 산화물은 밴드 갭이 2eV 이상, 바람직하게는 2.5eV 이상인 것이 바람직하다. 이와 같이, 밴드 갭이 큰 금속 산화물을 사용함으로써, 트랜지스터의 오프 전류를 감소시킬 수 있다. 산화물로서는, 예를 들어 인듐, 원소 M, 및 아연을 포함한 In-M-Zn 산화물(원소 M은 알루미늄, 갈륨, 이트 륨, 주석, 구리, 바나듐, 베릴륨, 붕소, 타이타늄, 철, 니켈, 저마늄, 지르코늄, 몰리브데넘, 란타넘, 세륨, 네 오디뮴, 하프늄, 탄탈럼, 텅스텐, 및 마그네슘 등 중에서 선택된 1종류 또는 복수 종류) 등의 금속 산화물을 사 용하는 것이 좋다. 또한 산화물로서 In-Ga 산화물, In-Zn 산화물, 인듐 산화물을 사용하여도 좋다. 여기서, 산화물(530b)로서 사용하는 금속 산화물에서의 원소 M에 대한 In의 원자수비는 산화물(530a)로서 사용 하는 금속 산화물에서의 원소 M에 대한 In의 원자수비보다 높은 것이 바람직하다. 이와 같이, 산화물(530b) 아래에 산화물(530a)을 배치함으로써, 산화물(530a)보다 아래쪽에 형성된 구조물로부 터 산화물(530b)로 불순물 및 산소가 확산되는 것을 억제할 수 있다. 또한 산화물(530a) 및 산화물(530b)이 산소 이외에 공통의 원소를 포함함으로써(주성분으로 함으로써), 산화물 (530a)과 산화물(530b)의 계면에서의 결함 준위 밀도를 낮출 수 있다. 산화물(530a)과 산화물(530b)의 계면에 서의 결함 준위 밀도를 낮출 수 있기 때문에, 계면 산란으로 인한 캐리어 전도에 대한 영향이 작아 높은 온 전 류를 얻을 수 있다. 산화물(530b)은 결정성을 갖는 것이 바람직하다. 특히 산화물(530b)로서 CAAC-OS(c-axis aligned crystalline oxide semiconductor)를 사용하는 것이 바람직하다. CAAC-OS는 결정성이 높고 치밀한 구조를 갖고, 불순물 및 결함(예를 들어 산소 결손(VO) 등)이 적은 금속 산화 물이다. 특히 금속 산화물의 형성 후에, 금속 산화물이 다결정화되지 않을 정도의 온도(예를 들어 400℃이상 600℃이하)에서 가열 처리를 수행함으로써, 결정성이 더 높고 치밀한 구조를 갖는 CAAC-OS로 할 수 있다. 이러 한 식으로 CAAC-OS의 밀도를 더 높임으로써, 상기 CAAC-OS에서의 불순물 또는 산소의 확산을 더 저감할 수 있다. 한편 CAAC-OS에서는 명확한 결정립계를 확인하기 어렵기 때문에, 결정립계에 기인하는 전자 이동도의 저하가 일 어나기 어렵다고 할 수 있다. 따라서 CAAC-OS를 포함한 금속 산화물은 물리적 성질이 안정된다. 그러므로 CAAC-OS를 포함한 금속 산화물은 열에 강하고 신뢰성이 높다. 산화물 반도체를 사용한 트랜지스터는 산화물 반도체 내의 채널이 형성되는 영역에 불순물 및 산소 결손이 존재 하면 전기 특성이 변동되기 쉬워 신뢰성이 떨어지는 경우가 있다. 또한 산소 결손 근방의 수소가, 산소 결손에 수소가 들어간 결함(이하, VOH라고 부르는 경우가 있음)을 형성하여 캐리어가 되는 전자를 생성하는 경우가 있다. 그러므로 산화물 반도체 내의 채널이 형성되는 영역에 산소 결손이 포함되면, 트랜지스터는 노멀리 온 특성(게이트 전극에 전압을 인가하지 않아도 채널이 존재하고, 트랜지스터에 전류가 흐르는 특성)을 갖기 쉽다. 따라서 산화물 반도체 내의 채널이 형성되는 영역에서는 불순물, 산소 결손, 및 VOH는 가능한 한 저감되어 있는 것이 바람직하다. 바꿔 말하면, 산화물 반도체 내의 채널이 형성되는 영역은 캐리어 농도가 감소되고, i형(진 성화) 또는 실질적으로 i형인 것이 바람직하다. 한편 가열에 의하여 이탈되는 산소(이하, 과잉 산소라고 부르는 경우가 있음)를 포함한 절연체를 산화물 반도체 의 근방에 제공하고 가열 처리를 수행함으로써, 상기 절연체로부터 산화물 반도체에 산소가 공급되어 산소 결손 및 VOH를 저감할 수 있다. 다만 소스 영역 또는 드레인 영역에 과잉량의 산소가 공급되면, 트랜지스터의 온 전류의 저하 또는 전계 효과 이동도의 저하가 일어날 우려가 있다. 또한 소스 영역 또는 드레인 영역에 공 급되는 산소의 양의 편차가 기판면 내에서 생김으로써, 트랜지스터를 포함한 반도체 장치의 특성에 편차가 생긴 다. 따라서 산화물 반도체 내에서 채널 형성 영역으로서 기능하는 영역(530bc)은 캐리어 농도가 감소되고, i형 또는 실질적으로 i형인 것이 바람직하지만, 소스 영역 또는 드레인 영역으로서 기능하는 영역(530ba) 및 영역(530b b)은 캐리어 농도가 높고, n형인 것이 바람직하다. 즉 산화물 반도체의 영역(530bc)의 산소 결손 및 VOH를 저 감하고, 영역(530ba) 및 영역(530bb)에 과잉량의 산소가 공급되지 않도록 하는 것이 바람직하다.그러므로 본 실시형태에서는 산화물(530b) 위에 도전체(542a) 및 도전체(542b)를 제공한 상태로, 산소를 포함한 분위기에서 마이크로파 처리를 수행하여, 영역(530bc)의 산소 결손 및 VOH를 저감한다. 여기서, 마이크로파 처 리란, 예를 들어 마이크로파를 사용하여 고밀도 플라스마를 발생시키는 전원을 포함한 장치를 사용한 처리를 말 한다. 산소를 포함한 분위기에서 마이크로파 처리를 수행함으로써, 마이크로파 또는 RF 등의 고주파를 사용하여 산소 가스를 플라스마화하고, 상기 산소 플라스마를 작용시킬 수 있다. 이때 마이크로파 또는 RF 등의 고주파를 영 역(530bc)에 조사할 수도 있다. 플라스마, 마이크로파 등의 작용에 의하여, 영역(530bc)의 VOH를 분단하고, 수 소(H)를 영역(530bc)에서 제거하고, 산소 결손(VO)을 산소로 보상할 수 있다. 즉 영역(530bc)에서 'VOH→H+VO' 라는 반응이 일어나, 영역(530bc)의 수소 농도를 감소시킬 수 있다. 따라서 영역(530bc) 내의 산소 결손 및 VOH를 저감하여 캐리어 농도를 감소시킬 수 있다. 또한 산소를 포함한 분위기에서 마이크로파 처리를 수행하는 경우, 마이크로파 또는 RF 등의 고주파, 산소 플라 스마 등은 도전체(542a) 및 도전체(542b)에 의하여 차폐되므로, 영역(530ba) 및 영역(530bb)에는 작용되지 않는 다. 또한 산소 플라스마의 작용은 산화물(530b) 및 도전체를 덮어 제공된 절연체 및 절연체에 의하여 저감할 수 있다. 이에 의하여, 마이크로파 처리를 수행하는 경우에 영역(530ba) 및 영역(530bb)에서 VOH가 저감되지 않고 과잉량의 산소가 공급되지 않기 때문에, 캐리어 농도가 감소되는 것을 방지할 수 있다. 또한 절연체가 되는 절연막의 성막 후 또는 절연체가 되는 절연막의 성막 후에, 산소를 포함한 분위 기에서 마이크로파 처리를 수행하는 것이 바람직하다. 이와 같이 절연체 또는 절연체를 통하여 산소 를 포함한 분위기에서 마이크로파 처리를 수행함으로써, 영역(530bc) 내에 산소를 효율적으로 주입할 수 있다. 또한 절연체를 도전체의 측면 및 영역(530bc)의 표면과 접하도록 배치함으로써, 영역(530bc)에 필요 이상의 산소가 주입되는 것을 억제하여, 도전체의 측면이 산화되는 것을 억제할 수 있다. 또한 절연체 가 되는 절연막의 성막 시에 도전체의 측면이 산화되는 것을 억제할 수 있다. 또한 영역(530bc) 내에 주입되는 산소는 산소 원자, 산소 분자, 산소 라디칼(O 라디칼이라고도 하고, 홀전자 (unpaired electron)를 갖는 원자 또는 분자, 혹은 이온임) 등의 다양한 형태를 갖는다. 또한 영역(530bc) 내 에 주입되는 산소는 상술한 형태 중 어느 하나 또는 복수를 갖는 것이 바람직하고, 특히 산소 라디칼인 것이 적 합하다. 또한 절연체 및 절연체의 막질을 향상시킬 수 있기 때문에, 트랜지스터의 신뢰성이 향 상된다. 이러한 식으로, 산화물 반도체의 영역(530bc)에서 산소 결손 및 VOH를 선택적으로 제거하여, 영역(530bc)을 i형 또는 실질적으로 i형으로 할 수 있다. 또한 소스 영역 또는 드레인 영역으로서 기능하는 영역(530ba) 및 영역 (530bb)에 과잉량의 산소가 공급되는 것을 억제하고, 도전성을 유지할 수 있다. 이에 의하여, 트랜지스터(50 0)의 전기 특성의 변동이 억제되므로, 기판면 내에서의 트랜지스터의 전기 특성의 편차를 줄일 수 있다. 상기 구성으로 함으로써, 트랜지스터 특성의 편차가 적은 반도체 장치를 제공할 수 있다. 또한 신뢰성이 양호 한 반도체 장치를 제공할 수 있다. 또한 전기 특성이 양호한 반도체 장치를 제공할 수 있다. 또한 도 17의 (B)에 나타낸 바와 같이, 트랜지스터의 채널 폭 방향의 단면에서 보았을 때, 산화물(530b)의 측면과 산화물(530b)의 상면 사이에 만곡면을 가져도 좋다. 즉 상기 측면의 단부와 상기 상면의 단부는 만곡되 어도 좋다(이하, 라운드 형상이라고도 함). 상기 만곡면의 곡률 반경은 0nm보다 크고, 도전체와 중첩되는 영역에서의 산화물(530b)의 막 두께보다 작 거나 상기 만곡면을 갖지 않는 영역의 길이의 절반보다 작은 것이 바람직하다. 상기 만곡면의 곡률 반경은 구 체적으로 0nm보다 크고 20nm 이하, 바람직하게는 1nm 이상 15nm 이하, 더 바람직하게는 2nm 이상 10nm 이하로 한다. 이와 같은 형상으로 함으로써, 산화물(530b)에 대한 절연체, 절연체, 절연체, 및 도전체 의 피복성을 높일 수 있다. 산화물은 화학 조성이 다른 복수의 산화물층의 적층 구조를 갖는 것이 바람직하다. 구체적으로는, 산화물 (530a)로서 사용하는 금속 산화물에서의 주성분인 금속 원소에 대한 원소 M의 원자수비가 산화물(530b)로서 사 용하는 금속 산화물에서의 주성분인 금속 원소에 대한 원소 M의 원자수비보다 높은 것이 바람직하다. 또한 산 화물(530a)로서 사용하는 금속 산화물에서의 In에 대한 원소 M의 원자수비가 산화물(530b)로서 사용하는 금속 산화물에서의 In에 대한 원소 M의 원자수비보다 높은 것이 바람직하다. 또한 산화물(530b)로서 사용하는 금속산화물에서의 원소 M에 대한 In의 원자수비가 산화물(530a)로서 사용하는 금속 산화물에서의 원소 M에 대한 In 의 원자수비보다 높은 것이 바람직하다. 또한 산화물(530b)은 CAAC-OS 등 결정성을 갖는 산화물인 것이 바람직하다. CAAC-OS 등 결정성을 갖는 산화물 은 불순물 및 결함(산소 결손 등)이 적고 결정성이 높은 치밀한 구조를 갖는다. 따라서 소스 전극 또는 드레인 전극에 의한 산화물(530b)로부터의 산소 추출을 억제할 수 있다. 이에 의하여, 가열 처리를 수행한 경우에도 산화물(530b)로부터 산소가 추출되는 것을 저감할 수 있기 때문에, 트랜지스터는 제조 공정에서의 높은 온 도(소위 thermal budget)에 대하여 안정적이다. 여기서, 산화물(530a)과 산화물(530b)의 접합부에서 전도대 하단은 완만하게 변화된다. 바꿔 말하면, 산화물 (530a)과 산화물(530b)의 접합부에서의 전도대 하단은 연속적으로 변화 또는 연속 접합한다고도 할 수 있다. 이와 같이 하기 위해서는, 산화물(530a)과 산화물(530b)의 계면에 형성되는 혼합층의 결함 준위 밀도를 낮추는 것이 좋다. 구체적으로는, 산화물(530a)과 산화물(530b)이 산소 이외에 공통의 원소를 주성분으로서 포함함으로써, 결함 준 위 밀도가 낮은 혼합층을 형성할 수 있다. 예를 들어 산화물(530b)이 In-M-Zn 산화물인 경우, 산화물(530a)로 서 In-M-Zn 산화물, M-Zn 산화물, 원소 M의 산화물, In-Zn 산화물, 인듐 산화물 등을 사용하여도 좋다. 구체적으로는 산화물(530a)로서, In:M:Zn=1:3:4[원자수비] 또는 그 근방의 조성, 혹은 In:M:Zn=1:1:0.5[원자수 비] 또는 그 근방의 조성을 갖는 금속 산화물을 사용하면 좋다. 또한 산화물(530b)로서, In:M:Zn=1:1:1[원자수 비] 또는 그 근방의 조성, 혹은 In:M:Zn=4:2:3[원자수비] 또는 그 근방의 조성을 갖는 금속 산화물을 사용하면 좋다. 또한 근방의 조성이란, 원하는 원자수비의 ±30%의 범위를 포함한 것이다. 또한 원소 M으로서 갈륨을 사용하는 것이 바람직하다. 또한 금속 산화물을 스퍼터링법으로 성막하는 경우, 상기 원자수비는 성막된 금속 산화물의 원자수비에 한정되 지 않고, 금속 산화물의 성막에 사용하는 스퍼터링 타깃의 원자수비이어도 좋다. 또한 도 17의 (A) 등에 나타낸 바와 같이, 산화물의 상면 및 측면과 접하여 산화 알루미늄 등으로 형성되 는 절연체를 제공함으로써, 산화물과 절연체의 계면 및 그 근방에 산화물에 포함되는 인듐 이 편재되는 경우가 있다. 이 경우, 산화물의 표면 근방이 인듐 산화물 또는 In-Zn 산화물과 비슷한 원자 수비를 갖는다. 이와 같이 산화물, 특히 산화물(530b)의 표면 근방의 인듐의 원자수비가 높아짐으로써, 트랜지스터의 전계 효과 이동도를 향상시킬 수 있다. 산화물(530a) 및 산화물(530b)을 상술한 구성으로 함으로써, 산화물(530a)과 산화물(530b)의 계면에서의 결함 준위 밀도를 낮출 수 있다. 그러므로 계면 산란으로 인한 캐리어 전도에 대한 영향이 작아지고, 트랜지스터 는 높은 온 전류 및 높은 주파수 특성을 얻을 수 있다. 절연체, 절연체, 절연체, 절연체, 절연체, 절연체, 및 절연체 중 적어도 하나는 물, 수소 등의 불순물이 기판 측으로부터 또는 트랜지스터의 위쪽으로부터 트랜지스터로 확산 되는 것을 억제하는 배리어 절연막으로서 기능하는 것이 바람직하다. 따라서 절연체, 절연체, 절연 체, 절연체, 절연체, 절연체, 및 절연체 중 적어도 하나에는 수소 원자, 수소 분자, 물 분자, 질소 원자, 질소 분자, 산화 질소 분자(N2O, NO, NO2 등), 구리 원자 등의 불순물의 확산을 억제하는 기능을 갖는(상기 불순물이 투과하기 어려운) 절연성 재료를 사용하는 것이 바람직하다. 또는 산소(예를 들어 산소 원자, 산소 분자 등 중 적어도 하나)의 확산을 억제하는 기능을 갖는(상기 산소가 투과하기 어려운) 절연 성 재료를 사용하는 것이 바람직하다. 또한 본 명세서에서 배리어 절연막이란, 배리어성을 갖는 절연막을 가리킨다. 본 명세서에서 배리어성이란, 대 응하는 물질의 확산을 억제하는 기능(투과성이 낮다고도 함)을 말한다. 또는 대응하는 물질을 포획 및 고착하 는(게터링이라고도 함) 기능을 말한다. 절연체, 절연체, 절연체, 절연체, 절연체, 절연체, 및 절연체로서는 물, 수소 등의 불순물 및 산소의 확산을 억제하는 기능을 갖는 절연체를 사용하는 것이 바람직하고, 예를 들어 산화 알루미늄, 산화 마그네슘, 산화 하프늄, 산화 갈륨, 인듐 갈륨 아연 산화물, 질화 실리콘, 또는 질화산화 실리 콘 등을 사용할 수 있다. 예를 들어 절연체, 절연체, 및 절연체에, 보다 수소 배리어성이 높은 질화 실리콘 등을 사용하는 것이 바람직하다. 또한 예를 들어 절연체, 절연체, 절연체, 및 절 연체에, 수소를 포획 및 고착하는 기능이 높은 산화 알루미늄 또는 산화 마그네슘 등을 사용하는 것이 바람직하다. 이에 의하여, 물, 수소 등의 불순물이 절연체 및 절연체를 통하여 기판 측으로부터 트랜 지스터 측으로 확산되는 것을 억제할 수 있다. 또는 물, 수소 등의 불순물이 절연체보다 외측에 배 치되는 층간 절연막 등으로부터 트랜지스터 측으로 확산되는 것을 억제할 수 있다. 또는 절연체 등 에 포함되는 산소가 절연체 및 절연체를 통하여 기판 측으로 확산되는 것을 억제할 수 있다. 또는 절연체 등에 포함되는 산소가 절연체 등을 통하여 트랜지스터보다 위쪽으로 확산되는 것을 억제 할 수 있다. 이와 같이, 트랜지스터를 물, 수소 등의 불순물 및 산소의 확산을 억제하는 기능을 갖는 절 연체, 절연체, 절연체, 절연체, 절연체, 절연체, 및 절연체로 둘러싸는 구조로 하는 것이 바람직하다. 여기서 절연체, 절연체, 절연체, 절연체, 절연체, 절연체, 및 절연체에 비정질 구조를 갖는 산화물을 사용하는 것이 바람직하다. 예를 들어 AlOx(x는 0보다 큰 임의의 수) 또는 MgOy(y 는 0보다 큰 임의의 수) 등의 금속 산화물을 사용하는 것이 바람직하다. 이와 같은 비정질 구조를 갖는 금속 산화물에서는, 산소 원자가 댕글링 본드(dangling bond)를 갖고, 상기 댕글링 본드로 수소를 포획 또는 고착하 는 성질을 갖는 경우가 있다. 이와 같은 비정질 구조를 갖는 금속 산화물을 트랜지스터의 구성 요소로서 사용하거나 트랜지스터의 주위에 제공함으로써, 트랜지스터에 포함되는 수소 또는 트랜지스터의 주위에 존재하는 수소를 포획 또는 고착할 수 있다. 특히 트랜지스터의 채널 형성 영역에 포함되는 수소 를 포획 또는 고착하는 것이 바람직하다. 비정질 구조를 갖는 금속 산화물을 트랜지스터의 구성 요소로서 사용하거나 트랜지스터의 주위에 제공함으로써, 특성이 양호하고 신뢰성이 높은 트랜지스터 및 반도 체 장치를 제작할 수 있다. 또한 절연체, 절연체, 절연체, 절연체, 절연체, 절연체, 및 절연체는 비 정질 구조를 갖는 것이 바람직하지만, 일부에 다결정 구조의 영역이 형성되어도 좋다. 또한 절연체, 절연 체, 절연체, 절연체, 절연체, 절연체, 및 절연체는 비정질 구조의 층과 다결정 구조의 층이 적층된 다층 구조를 가져도 좋다. 예를 들어 비정질 구조의 층 위에 다결정 구조의 층이 형성된 적층 구조이어도 좋다. 절연체, 절연체, 절연체, 절연체, 절연체, 절연체, 및 절연체의 성막은 예를 들어 스퍼터링법을 사용하여 수행하면 좋다. 스퍼터링법은 수소를 포함한 분자를 성막 가스로서 사용하지 않아도 되기 때문에, 절연체, 절연체, 절연체, 절연체, 절연체, 절연체, 및 절 연체의 수소 농도를 감소시킬 수 있다. 또한 성막 방법은 스퍼터링법에 한정되지 않고, 화학 기상 성장 (CVD)법, 분자선 에피택시(MBE)법, 펄스 레이저 퇴적(PLD)법, 원자층 퇴적(ALD)법 등을 적절히 사용하여도 좋다. 또한 절연체, 절연체, 및 절연체의 저항률을 낮게 하는 것이 바람직한 경우가 있다. 예를 들어 절연체, 절연체, 및 절연체의 저항률을 대략 1×1013Ωcm로 함으로써, 반도체 장치 제작 공정의 플라스마 등을 사용하는 처리에서 절연체, 절연체, 및 절연체가 도전체, 도전체, 도 전체 등의 차지 업을 완화할 수 있는 경우가 있다. 절연체, 절연체, 및 절연체의 저항률 은 바람직하게는 1×1010Ωcm 이상 1×1015Ωcm 이하로 한다. 또한 절연체, 절연체, 절연체, 및 절연체는 절연체보다 유전율이 낮은 것이 바람직하 다. 유전율이 낮은 재료를 층간막에 사용함으로써, 배선 사이에 발생하는 기생 용량을 저감할 수 있다. 예를 들어 절연체, 절연체, 및 절연체에, 산화 실리콘, 산화질화 실리콘, 플루오린을 첨가한 산화 실 리콘, 탄소를 첨가한 산화 실리콘, 탄소 및 질소를 첨가한 산화 실리콘, 공공(空孔)을 갖는 산화 실리콘 등을 적절히 사용하면 좋다. 또한 절연체는 일례로서 층간막, 평탄화막 등으로서 기능하는 절연체인 것이 바람직하다. 도전체는 산화물 및 도전체와 중첩되도록 배치된다. 여기서 도전체는 절연체에 형성 된 개구에 매립되어 제공되는 것이 바람직하다. 또한 도전체의 일부가 절연체에 매립되는 경우가 있 다. 도전체는 도전체(503a) 및 도전체(503b)를 포함한다. 도전체(503a)는 상기 개구의 밑면 및 측벽과 접하여 제공된다. 도전체(503b)는 도전체(503a)에 형성된 오목부에 매립되도록 제공된다. 여기서 도전체(503b)의 상 부의 높이는 도전체(503a)의 상부의 높이 및 절연체의 상부의 높이와 실질적으로 일치한다.여기서 도전체(503a)에는 수소 원자, 수소 분자, 물 분자, 질소 원자, 질소 분자, 산화 질소 분자(N2O, NO, NO2 등), 구리 원자 등의 불순물의 확산을 억제하는 기능을 갖는 도전성 재료를 사용하는 것이 바람직하다. 또는 산소(예를 들어 산소 원자, 산소 분자 등 중 적어도 하나)의 확산을 억제하는 기능을 갖는 도전성 재료를 사용 하는 것이 바람직하다. 도전체(503a)에 수소의 확산을 저감하는 기능을 갖는 도전성 재료를 사용함으로써, 도전체(503b)에 포함되는 수 소 등의 불순물이 절연체 등을 통하여 산화물로 확산되는 것을 방지할 수 있다. 또한 도전체(503a) 에 산소의 확산을 억제하는 기능을 갖는 도전성 재료를 사용함으로써, 도전체(503b)가 산화되어 도전율이 저하 되는 것을 억제할 수 있다. 산소의 확산을 억제하는 기능을 갖는 도전성 재료로서는, 예를 들어 타이타늄, 질 화 타이타늄, 탄탈럼, 질화 탄탈럼, 루테늄, 산화 루테늄 등을 사용하는 것이 바람직하다. 따라서 도전체 (503a)는 상기 도전성 재료의 단층 또는 적층으로 하면 좋다. 예를 들어 도전체(503a)에는 질화 타이타늄을 사 용하면 좋다. 또한 도전체(503b)에는 텅스텐, 구리, 또는 알루미늄을 주성분으로 하는 도전성 재료를 사용하는 것이 바람직하 다. 예를 들어 도전체(503b)에는 텅스텐을 사용하면 좋다. 도전체는 제 2 게이트 전극으로서 기능하는 경우가 있다. 이 경우, 도전체에 인가하는 전위를 도전 체에 인가하는 전위와 연동시키지 않고 독립적으로 변화시킴으로써, 트랜지스터의 문턱 전압(Vth)을 제어할 수 있다. 특히 도전체에 음의 전위를 인가함으로써, 트랜지스터의 Vth를 더 크게 하고, 오프 전류를 감소시킬 수 있다. 따라서 도전체에 음의 전위를 인가하는 경우에는 인가하지 않는 경우보다 도전 체에 인가하는 전위가 0V일 때의 드레인 전류를 감소시킬 수 있다. 또한 산화물을 고순도 진성으로 하고 산화물에서 불순물이 가능한 한 배제된 상태로 한 경우, 도전체 및/또는 도전체에 전위를 공급하지 않고, 트랜지스터를 노멀리 오프로(트랜지스터의 문턱 전압을 0V보다 크게) 하는 것을 기대할 수 있는 경우가 있다. 이 경우에는 도전체와 도전체를 접속 하여 동일 전위가 공급되도록 하는 것이 적합하다. 또한 도전체의 전기 저항률은 상기 도전체에 인가하는 전위를 고려하여 설계되고, 도전체의 막 두께는 상기 전기 저항률에 따라 설정된다. 또한 절연체의 막 두께는 도전체와 거의 같다. 여기서, 도전체의 설계상 허용되는 범위에서 도전체 및 절연체의 막 두께를 얇게 하는 것이 바람직하다. 절연체의 막 두께를 얇게 함으로써, 절연체 내에 포함되는 수소 등의 불순물의 절대량을 감소시킬 수 있기 때문에, 상기 불순물이 산화물로 확산되는 것을 저감할 수 있다. 또한 도전체는 상면에서 보았을 때, 산화물에서 도전체(542a) 및 도전체(542b)와 중첩되지 않는 영역 의 크기보다 크게 제공되는 것이 좋다. 특히 도 17의 (B)에 나타낸 바와 같이, 도전체는 산화물(530a) 및 산화물(530b)의 채널 폭 방향의 단부보다 외측의 영역으로도 연장되어 있는 것이 바람직하다. 즉 산화물 의 채널 폭 방향에서의 측면의 외측에서 도전체와 도전체는 절연체를 개재하여 중첩되어 있는 것이 바람직하다. 상기 구성을 가짐으로써, 제 1 게이트 전극으로서 기능하는 도전체의 전계와 제 2 게이트 전 극으로서 기능하는 도전체의 전계에 의하여, 산화물의 채널 형성 영역을 전기적으로 둘러쌀 수 있다. 본 명세서에서는, 제 1 게이트 및 제 2 게이트의 전계에 의하여 채널 형성 영역을 전기적으로 둘러싸는 트랜지 스터의 구조를 surrounded channel(S-channel) 구조라고 부른다. 또한 본 명세서 등에서 S-channel 구조의 트랜지스터란, 한 쌍의 게이트 전극 중 한쪽 및 다른 쪽의 전계에 의 하여 채널 형성 영역을 전기적으로 둘러싸는 트랜지스터의 구조를 말한다. 또한 본 명세서 등에서 개시하는 S- channel 구조는 Fin형 구조 및 플레이너형 구조와는 다르다. S-channel 구조를 채용함으로써, 단채널 효과에 대한 내성을 높일 수 있고, 바꿔 말하면 단채널 효과가 발생하기 어려운 트랜지스터로 할 수 있다. 트랜지스터를 노멀리 오프로 하고, 또한 상기 S-Channel 구조로 함으로써, 채널 형성 영역을 전기적으로 둘러쌀 수 있다. 그러므로 트랜지스터를 GAA(Gate All Around) 구조 또는 LGAA(Lateral Gate All Around) 구조로 간주할 수도 있다. 트랜지스터를 S-Channel 구조, GAA 구조, 또는 LGAA 구조로 함으로써, 산화물과 게이트 절연막의 계면 또는 계면 근방에 형성되는 채널 형성 영역을 산화물의 벌 크 전체에 형성할 수 있다. 바꿔 말하면 트랜지스터를 S-Channel 구조, GAA 구조, 또는 LGAA 구조로 함으 로써, 캐리어 경로로서 벌크 전체를 사용하는 소위 Bulk-Flow형으로 할 수 있다. Bulk-Flow형의 트랜지스터 구 조로 함으로써, 트랜지스터에 흐르는 전류 밀도를 향상시킬 수 있기 때문에, 트랜지스터의 온 전류의 향상 또는 트랜지스터의 전계 효과 이동도의 향상을 기대할 수 있다.또한 도 17의 (B)에 나타낸 바와 같이, 도전체는 연장되어 배선으로서도 기능한다. 다만 이에 한정되지 않고, 도전체 아래에 배선으로서 기능하는 도전체를 제공하는 구성으로 하여도 좋다. 또한 도전체는 반드시 각 트랜지스터에 하나씩 제공될 필요는 없다. 예를 들어 도전체를 복수의 트랜지스터로 공유하는 구성으로 하여도 좋다. 또한 트랜지스터에서 도전체는 도전체(503a)와 도전체(503b)가 적층된 구성을 갖지만, 본 발명은 이 에 한정되지 않는다. 예를 들어 도전체를 단층 또는 3층 이상의 적층 구조로 하여도 좋다. 절연체 및 절연체는 게이트 절연체로서 기능한다. 절연체는 수소(예를 들어 수소 원자, 수소 분자 등 중 적어도 하나)의 확산을 억제하는 기능을 갖는 것이 바람직하다. 또한 절연체는 산소(예를 들어 산소 원자, 산소 분자 등 중 적어도 하나)의 확산을 억제하는 기능을 갖는 것이 바람직하다. 예를 들어 절연체는 절연체보다 수소 및 산소 중 한쪽 또는 양쪽의 확산을 억제하는 기능을 갖는 것이 바람직하다. 절연체로서는 절연성 재료인 알루미늄 및 하프늄 중 한쪽 또는 양쪽의 산화물을 포함한 절연체를 사용하는 것이 좋다. 상기 절연체로서는 산화 알루미늄, 산화 하프늄, 알루미늄 및 하프늄을 포함한 산화물(하프늄 알루 미네이트) 등을 사용하는 것이 바람직하다. 이와 같은 재료를 사용하여 절연체를 형성한 경우, 절연체 는 산화물로부터 기판 측으로의 산소의 방출과, 트랜지스터의 주변부로부터 산화물로의 수 소 등의 불순물의 확산을 억제하는 층으로서 기능한다. 따라서 절연체를 제공함으로써, 수소 등의 불순물 이 트랜지스터의 내측으로 확산되는 것을 억제하고, 산화물 내에 산소 결손이 생성되는 것을 억제할 수 있다. 또한 절연체 또는 산화물에 포함되는 산소와 도전체가 반응하는 것을 억제할 수 있다. 또는 상기 절연체에, 예를 들어 산화 알루미늄, 산화 비스무트, 산화 저마늄, 산화 나이오븀, 산화 실리콘, 산 화 타이타늄, 산화 텅스텐, 산화 이트륨, 산화 지르코늄을 첨가하여도 좋다. 또는 이들 절연체를 질화 처리하 여도 좋다. 또한 절연체로서는 이들 절연체에 산화 실리콘, 산화질화 실리콘, 또는 질화 실리콘을 적층시 킨 것을 사용하여도 좋다. 또한 절연체로서는 예를 들어 산화 알루미늄, 산화 하프늄, 산화 탄탈럼, 산화 지르코늄 등의 소위 high-k 재료를 포함한 절연체를 단층으로 또는 적층하여 사용하여도 좋다. 트랜지스터의 미세화 및 고집적화가 진행되 면, 게이트 절연체가 박막화됨으로써 누설 전류 등의 문제가 발생하는 경우가 있다. 게이트 절연체로서 기능하 는 절연체에 high-k 재료를 사용함으로써, 물리적 막 두께를 유지하면서 트랜지스터 동작 시의 게이트 전위를 저감할 수 있다. 또한 절연체에는 타이타늄산 지르콘산 연(PZT), 타이타늄산 스트론튬(SrTiO3), (Ba,Sr)TiO3(BST) 등의 유전율이 높은 물질을 사용할 수 있는 경우도 있다. 산화물과 접하는 절연체에는, 예를 들어 산화 실리콘, 산화질화 실리콘 등을 적절히 사용하면 좋다. 또한 트랜지스터의 제작 공정 중에서, 산화물의 표면이 노출된 상태에서 가열 처리를 수행하는 것이 적합하다. 상기 가열 처리는 예를 들어 100℃이상 600℃이하, 바람직하게는 350℃이상 550℃이하에서 수행하면 좋다. 또한 가열 처리는 질소 가스 또는 불활성 가스 분위기, 혹은 산화성 가스를 10ppm 이상, 1% 이상, 또는 10% 이상 포함한 분위기에서 수행한다. 예를 들어 가열 처리는 산소 분위기에서 수행하는 것이 바람직하다. 이로써, 산화물에 산소가 공급되므로 산소 결손(VO)을 저감할 수 있다. 또한 가열 처리는 감압 상태에서 수행하여도 좋다. 또는 가열 처리는 질소 가스 또는 불활성 가스 분위기에서 가열 처리를 수행한 후에, 이탈된 산소를 보충하기 위하여 산화성 가스를 10ppm 이상, 1% 이상, 또는 10% 이상 포함한 분위기에서 수행하여도 좋 다. 또는 산화성 가스를 10ppm 이상, 1% 이상, 또는 10% 이상 포함한 분위기에서 가열 처리를 수행한 후에, 연 속하여 질소 가스 또는 불활성 가스 분위기에서 가열 처리를 수행하여도 좋다. 또한 산화물에 대하여 가산소화 처리를 수행함으로써, 공급된 산소에 의하여 산화물 내의 산소 결손 을 수복(修復)할 수 있고, 바꿔 말하면 'VO+O→null'이라는 반응을 촉진할 수 있다. 또한 산화물 내에 잔 존한 수소와 공급된 산소가 반응함으로써, 상기 수소를 H2O로서 제거(탈수화)할 수 있다. 이에 의하여, 산화물 내에 잔존한 수소가 산소 결손과 재결합되어 VOH가 형성되는 것을 억제할 수 있다. 또한 절연체 및 절연체가 2층 이상의 적층 구조를 가져도 좋다. 이 경우, 같은 재료로 이루어지는 적층 구조에 한정되지 않고, 상이한 재료로 이루어지는 적층 구조이어도 좋다. 또한 절연체는 산화물(530a)과 중첩하여 섬 형상으로 형성되어도 좋다. 이 경우, 절연체가 절연체의 측면 및 절연체(52 2)의 상면과 접하는 구성이 된다. 도전체(542a) 및 도전체(542b)는 산화물(530b)의 상면과 접하여 제공된다. 도전체(542a) 및 도전체(542b)는 각 각 트랜지스터의 소스 전극 또는 드레인 전극으로서 기능한다. 도전체(도전체(542a) 및 도전체(542b))에는, 예를 들어 탄탈럼을 포함한 질화물, 타이타늄을 포함한 질화 물, 몰리브데넘을 포함한 질화물, 텅스텐을 포함한 질화물, 탄탈럼 및 알루미늄을 포함한 질화물, 타이타늄 및 알루미늄을 포함한 질화물 등을 사용하는 것이 바람직하다. 본 발명의 일 형태에서는 탄탈럼을 포함한 질화물 이 특히 바람직하다. 또한 예를 들어 산화 루테늄, 질화 루테늄, 스트론튬과 루테늄을 포함한 산화물, 란타넘 과 니켈을 포함한 산화물 등을 사용하여도 좋다. 이들 재료는 산화되기 어려운 도전성 재료 또는 산소를 흡수 하여도 도전성을 유지하는 재료이기 때문에 바람직하다. 또한 산화물(530b) 등에 포함되는 수소가 도전체(542a) 또는 도전체(542b)로 확산되는 경우가 있다. 특히 도전 체(542a) 및 도전체(542b)에 탄탈럼을 포함한 질화물을 사용함으로써, 산화물(530b) 등에 포함되는 수소는 도전 체(542a) 또는 도전체(542b)로 확산되기 쉽고, 확산된 수소는 도전체(542a) 또는 도전체(542b)에 포함되는 질소 와 결합되는 경우가 있다. 즉 산화물(530b) 등에 포함되는 수소는 도전체(542a) 또는 도전체(542b)에 흡수되는 경우가 있다. 또한 도전체의 측면과 도전체의 상면 사이에 만곡면이 형성되지 않는 것이 바람직하다. 상기 만곡면 이 형성되지 않는 도전체로 함으로써, 채널 폭 방향의 단면에서의 도전체의 단면적을 크게 할 수 있 다. 이에 의하여, 도전체의 도전율을 증가시켜, 트랜지스터의 온 전류를 높일 수 있다. 절연체(571a)는 도전체(542a)의 상면과 접하여 제공되고, 절연체(571b)는 도전체(542b)의 상면과 접하여 제공되 어 있다. 절연체는 적어도 산소에 대한 배리어 절연막으로서 기능하는 것이 바람직하다. 따라서 절연체 는 산소의 확산을 억제하는 기능을 갖는 것이 바람직하다. 예를 들어 절연체는 절연체보다 산 소의 확산을 억제하는 기능을 갖는 것이 바람직하다. 절연체에는 예를 들어 질화 실리콘 등의 실리콘을 포함한 질화물을 사용하면 좋다. 또한 절연체는 수소 등의 불순물을 포획하는 기능을 갖는 것이 바람직하 다. 그 경우, 절연체로서는, 비정질 구조를 갖는 금속 산화물, 예를 들어 산화 알루미늄 또는 산화 마그 네슘 등의 절연체를 사용하면 좋다. 특히, 절연체에 비정질 구조를 갖는 산화 알루미늄 또는 비정질 구조 의 산화 알루미늄을 사용함으로써, 수소를 더 효과적으로 포획 또는 고착할 수 있는 경우가 있기 때문에 바람직 하다. 이에 의하여, 특성이 양호하고 신뢰성이 높은 트랜지스터 및 반도체 장치를 제작할 수 있다. 절연체는 절연체, 산화물(530a), 산화물(530b), 도전체, 및 절연체를 덮도록 제공된다. 절연체는 수소를 포획 및 고착하는 기능을 갖는 것이 바람직하다. 그 경우, 절연체로서는, 질화 실 리콘, 또는 비정질 구조를 갖는 금속 산화물, 예를 들어 산화 알루미늄 또는 산화 마그네슘 등의 절연체를 포함 하는 것이 바람직하다. 또한 예를 들어 절연체로서, 산화 알루미늄과, 상기 산화 알루미늄 위의 질화 실 리콘의 적층막을 사용하여도 좋다. 상술한 바와 같은 절연체 및 절연체를 제공함으로써, 산소에 대한 배리어성을 갖는 절연체로 도전체 를 감쌀 수 있다. 즉 절연체 및 절연체에 포함되는 산소가 도전체로 확산되는 것을 방지 할 수 있다. 이에 의하여, 절연체 및 절연체에 포함되는 산소에 의하여 도전체가 직접 산화되 므로, 저항률이 증대되고 온 전류가 감소되는 것을 억제할 수 있다. 절연체는 게이트 절연체의 일부로서 기능한다. 절연체로서는 산소에 대한 배리어 절연막을 사용하는 것이 바람직하다. 절연체로서는, 상술한 절연체로서 사용할 수 있는 절연체를 사용하면 좋다. 절연 체로서는, 알루미늄 및 하프늄 중 한쪽 또는 양쪽의 산화물을 포함한 절연체를 사용하는 것이 좋다. 상기 절연체로서는, 산화 알루미늄, 산화 하프늄, 알루미늄 및 하프늄을 포함한 산화물(하프늄 알루미네이트), 하프 늄 및 실리콘을 포함한 산화물(하프늄 실리케이트) 등을 사용할 수 있다. 본 실시형태에서는 절연체에 산 화 알루미늄을 사용한다. 이 경우, 절연체는 적어도 산소와 알루미늄을 포함한다. 도 17의 (B)에 나타낸 바와 같이, 절연체는 산화물(530b)의 상면 및 측면, 산화물(530a)의 측면, 절연체 의 측면, 그리고 절연체의 상면과 접하여 제공된다. 즉 산화물(530a), 산화물(530b), 및 절연체 에서 도전체와 중첩되는 영역은 채널 폭 방향의 단면에서 절연체로 덮여 있다. 이에 의하여, 가열 처리 등을 수행하였을 때, 산화물(530a) 및 산화물(530b)로부터 산소가 이탈되는 것을, 산소에 대한 배리 어성을 갖는 절연체로 막을 수 있다. 따라서 산화물(530a) 및 산화물(530b)에 산소 결손(Vo)이 형성되는것을 저감할 수 있다. 이에 의하여, 영역(530bc)에 형성되는 산소 결손(Vo) 및 VOH를 저감할 수 있다. 따라서 트랜지스터의 전기 특성을 양호하게 하고 신뢰성을 향상시킬 수 있다. 또한 절연체 및 절연체 등에 과잉량의 산소가 포함되는 경우에도, 상기 산소가 산화물(530a) 및 산화 물(530b)에 과잉으로 공급되는 것을 억제할 수 있다. 따라서 영역(530bc)을 통한 산소에 의하여 영역(530ba) 및 영역(530bb)이 과잉으로 산화되어 트랜지스터의 온 전류가 감소되거나 전계 효과 이동도가 저하되는 것 을 억제할 수 있다. 또한 도 17의 (A)에 나타낸 바와 같이, 절연체는 도전체, 절연체, 절연체, 및 절연체 각각의 측면과 접하여 제공된다. 따라서 도전체의 측면이 산화되어 상기 측면에 산화막이 형성되는 것을 저감할 수 있다. 이에 의하여, 트랜지스터의 온 전류가 감소되거나 전계 효과 이동도가 저하되는 것 을 억제할 수 있다. 또한 절연체는 절연체, 절연체, 및 도전체와 함께, 절연체 등에 형성된 개구에 제공 될 필요가 있다. 트랜지스터를 미세화하기 위하여, 절연체의 막 두께는 얇은 것이 바람직하다. 절 연체의 막 두께는 0.1nm 이상, 0.5nm 이상, 또는 1.0nm 이상이며, 1.0nm 이하, 3.0nm 이하, 또는 5.0nm 이하로 하는 것이 바람직하다. 또한 상술한 하한값 및 상한값은 서로 조합할 수 있는 것으로 한다. 이 경우, 절연체는 적어도 일부에서 상기와 같은 막 두께의 영역을 가지면 좋다. 또한 절연체의 막 두께는 절 연체의 막 두께보다 얇은 것이 바람직하다. 이 경우, 절연체는 적어도 일부에서 절연체보다 막 두께가 얇은 영역을 가지면 좋다. 절연체를 상술한 바와 같이 얇은 막 두께로 성막하기 위해서는 ALD법을 사용하는 것이 바람직하다. ALD법 은, 전구체 및 반응제의 반응을 열 에너지만으로 수행하는 열 ALD법, 플라스마 여기된 반응제를 사용하는 PEALD(Plasma Enhanced ALD)법 등이 있다. PEALD법에서는 플라스마를 이용함으로써 더 낮은 온도에서 성막을 할 수 있기 때문에 바람직한 경우가 있다. ALD법에서는 원자의 성질인 자기 제어성을 이용하여 한 층씩 원자를 퇴적할 수 있기 때문에, 매우 얇게 성막이 가능하고, 종횡비가 높은 구조에 대한 성막이 가능하고, 핀홀 등의 결함이 적은 성막이 가능하고, 피복성이 우 수한 성막이 가능하고, 저온에서의 성막이 가능하다는 등의 효과가 있다. 따라서 절연체 등에 형성된 개 구의 측면 등에 절연체를 상술한 바와 같은 얇은 막 두께로 피복성 좋게 성막할 수 있다. 또한 ALD법에서 사용하는 전구체에는 탄소 등이 포함되는 경우가 있다. 그러므로 ALD법으로 제공된 막은 다른 성막법으로 제공된 막보다 탄소 등의 불순물을 많이 포함하는 경우가 있다. 또한 불순물의 정량은 이차 이온 질량 분석법(SIMS: Secondary Ion Mass Spectrometry) 또는 X선 광전자 분광법(XPS: X-ray Photoelectron Spectroscopy)을 사용하여 수행할 수 있다. 절연체는 게이트 절연체의 일부로서 기능한다. 절연체는 절연체의 상면과 접하여 배치되는 것 이 바람직하다. 절연체에는 산화 실리콘, 산화질화 실리콘, 질화산화 실리콘, 질화 실리콘, 플루오린을 첨가한 산화 실리콘, 탄소를 첨가한 산화 실리콘, 탄소 및 질소를 첨가한 산화 실리콘, 공공을 갖는 산화 실리 콘 등을 사용할 수 있다. 특히 산화 실리콘 및 산화질화 실리콘은 열에 대하여 안정적이므로 바람직하다. 이 경우, 절연체는 적어도 산소와 실리콘을 포함한다. 절연체에서는 절연체와 마찬가지로 물, 수소 등의 불순물의 농도가 감소되어 있는 것이 바람직하다. 절연체의 막 두께는 하한값으로서는 1nm 이상 또는 0.5nm 이상으로 하는 것이 바람직하고, 상한값으로서는 15nm 이하 또는 20nm 이하로 하는 것이 바람직하다. 또한 상술한 하한값 및 상한값은 서로 조합할 수 있는 것으로 한다. 이 경우, 절연체는 적어도 일부에서 상기와 같은 막 두께의 영역을 가지면 좋다. 도 17의 (A) 및 (B) 등에서는 절연체를 단층으로 한 구성을 나타내었지만, 본 발명은 이에 한정되지 않고, 2층 이상의 적층 구조로 하여도 좋다. 예를 들어 도 18의 (B)에 나타낸 바와 같이, 절연체를 절연체 (550a)와, 절연체(550a) 위의 절연체(550b)의 2층의 적층 구조로 하여도 좋다. 도 18의 (B)에 나타낸 바와 같이, 절연체를 2층의 적층 구조로 하는 경우, 아래층인 절연체(550a)는 산소 가 투과하기 쉬운 절연체를 사용하여 형성되고, 위층인 절연체(550b)는 산소의 확산을 억제하는 기능을 갖는 절 연체를 사용하여 형성되는 것이 바람직하다. 이와 같은 구성으로 함으로써, 절연체(550a)에 포함되는 산소가 도전체로 확산되는 것을 억제할 수 있다. 즉 산화물에 공급하는 산소량의 감소를 억제할 수 있다. 또한 절연체(550a)에 포함되는 산소로 인한 도전체의 산화를 억제할 수 있다. 예를 들어 절연체(550a)는상술한 절연체에 사용할 수 있는 재료를 사용하여 제공되고, 절연체(550b)로서는 알루미늄 및 하프늄 중 한쪽 또는 양쪽의 산화물을 포함한 절연체를 사용하는 것이 좋다. 상기 절연체로서는, 산화 알루미늄, 산화 하 프늄, 알루미늄 및 하프늄을 포함한 산화물(하프늄 알루미네이트), 하프늄 및 실리콘을 포함한 산화물(하프늄 실리케이트) 등을 사용할 수 있다. 본 실시형태에서는 절연체(550b)에 산화 하프늄을 사용한다. 이 경우, 절 연체(550b)는 적어도 산소와 하프늄을 포함한다. 또한 절연체(550b)의 막 두께는 하한값으로서는 0.5nm 이상 또는 1.0nm 이상으로 하는 것이 바람직하고, 상한값으로서는 3.0nm 이하 또는 5.0nm 이하로 하는 것이 바람직하 다. 또한 상술한 하한값 및 상한값은 서로 조합할 수 있는 것으로 한다. 이 경우, 절연체(550b)는 적어도 일 부에서 상기와 같은 막 두께의 영역을 가지면 좋다. 또한 절연체(550a)에 산화 실리콘, 산화질화 실리콘 등을 사용하는 경우, 절연체(550b)에는 비유전율이 높은 high-k 재료인 절연성 재료를 사용하여도 좋다. 게이트 절연체를 절연체(550a)와 절연체(550b)의 적층 구조로 함으로써, 열에 대하여 안정적이며 비유전율이 높은 적층 구조로 할 수 있다. 따라서 게이트 절연체의 물리적 막 두께를 유지하면서 트랜지스터 동작 시에 인가되는 게이트 전위를 저감할 수 있다. 또한 게이트 절연체로서 기능하는 절연체의 등가 산화막 두께(EOT)를 감소시킬 수 있다. 따라서 절연체의 절연 내압을 높일 수 있 다. 절연체는 게이트 절연체의 일부로서 기능한다. 절연체로서는 수소에 대한 배리어 절연막을 사용하는 것이 바람직하다. 이에 의하여, 도전체에 포함되는 수소 등의 불순물이 절연체 및 산화물(530b)로 확산되는 것을 방지할 수 있다. 절연체로서는, 상술한 절연체로서 사용할 수 있는 절연체를 사용하 면 좋다. 예를 들어 절연체에는 PEALD법으로 성막한 질화 실리콘을 사용하면 좋다. 이 경우, 절연체 는 적어도 질소와 실리콘을 포함한다. 또한 절연체는 산소에 대한 배리어성을 더 가져도 좋다. 이에 의하여, 절연체에 포함되는 산소가 도 전체로 확산되는 것을 억제할 수 있다. 또한 절연체는 절연체, 절연체, 및 도전체와 함께, 절연체 등에 형성된 개구에 제공 될 필요가 있다. 트랜지스터를 미세화하기 위하여, 절연체의 막 두께는 얇은 것이 바람직하다. 절 연체의 막 두께는 하한값으로서는 0.1nm 이상, 0.5nm 이상, 또는 1.0nm 이상으로 하는 것이 바람직하고, 상한값으로서는 3.0nm 이하 또는 5.0nm 이하로 하는 것이 바람직하다. 또한 상술한 하한값 및 상한값은 서로 조합할 수 있는 것으로 한다. 이 경우, 절연체는 적어도 일부에서 상기와 같은 막 두께의 영역을 가지면 좋다. 또한 절연체의 막 두께는 절연체의 막 두께보다 얇은 것이 바람직하다. 이 경우, 절연체 는 적어도 일부에서 절연체보다 막 두께가 얇은 영역을 가지면 좋다. 도전체는 트랜지스터의 제 1 게이트 전극으로서 기능한다. 도전체는 도전체(560a)와, 도전체 (560a) 위에 배치된 도전체(560b)를 포함하는 것이 바람직하다. 예를 들어 도전체(560a)는 도전체(560b)의 밑 면 및 측면을 감싸도록 배치되는 것이 바람직하다. 또한 도 17의 (A) 및 (B)에 나타낸 바와 같이, 도전체(56 0)의 상부의 높이의 위치는 절연체의 상부의 높이의 위치와 실질적으로 일치한다. 또한 도 17의 (A) 및 (B)에서는 도전체를 도전체(560a)와 도전체(560b)의 2층 구조로 나타내었지만, 도전체는 상기 2층 구 조 외에도 단층 구조 또는 3층 이상의 적층 구조로 할 수 있다. 도전체(560a)에는 수소 원자, 수소 분자, 물 분자, 질소 원자, 질소 분자, 산화 질소 분자, 구리 원자 등의 불 순물의 확산을 억제하는 기능을 갖는 도전성 재료를 사용하는 것이 바람직하다. 또는 산소(예를 들어 산소 원 자, 산소 분자 등 중 적어도 하나)의 확산을 억제하는 기능을 갖는 도전성 재료를 사용하는 것이 바람직하다. 또한 도전체(560a)가 산소의 확산을 억제하는 기능을 가짐으로써, 절연체에 포함되는 산소로 인하여 도전 체(560b)가 산화되어 도전율이 저하되는 것을 억제할 수 있다. 산소의 확산을 억제하는 기능을 갖는 도전성 재 료로서는, 예를 들어 타이타늄, 질화 타이타늄, 탄탈럼, 질화 탄탈럼, 루테늄, 산화 루테늄 등을 사용하는 것이 바람직하다. 또한 도전체는 배선으로서도 기능하기 때문에, 도전성이 높은 도전체를 사용하는 것이 바람직하다. 예를 들어 도전체(560b)에는 텅스텐, 구리, 또는 알루미늄을 주성분으로 하는 도전성 재료를 사용할 수 있다. 또한 도전체(560b)는 적층 구조로 할 수 있다. 구체적으로는, 예를 들어 도전체(560b)는 타이타늄 또는 질화 타이타 늄과 상기 도전성 재료의 적층 구조로 할 수 있다. 또한 트랜지스터에서 도전체는 절연체 등에 형성된 개구를 매립하도록 자기 정합(self- aligned)적으로 형성된다. 도전체를 이와 같이 형성함으로써, 도전체(542a)와 도전체(542b) 사이의 영역에 도전체를 위치 맞춤 없이 확실하게 배치할 수 있다. 또한 도 17의 (B)에 나타낸 바와 같이, 트랜지스터의 채널 폭 방향에서 절연체의 밑면을 기준으로 하 였을 때, 도전체와 산화물(530b)이 중첩되지 않는 영역에서의 도전체의 밑면의 높이는 산화물(530b) 의 밑면의 높이보다 낮은 것이 바람직하다. 게이트 전극으로서 기능하는 도전체가 절연체 등을 개재 하여 산화물(530b)의 채널 형성 영역의 측면 및 상면을 덮는 구성으로 함으로써, 도전체의 전계를 산화물 (530b)의 채널 형성 영역 전체에 작용시키기 쉬워진다. 따라서 트랜지스터의 온 전류를 증대시키고 주파 수 특성을 향상시킬 수 있다. 절연체의 밑면을 기준으로 하였을 때, 산화물(530a) 및 산화물(530b)과 도 전체가 중첩되지 않는 영역에서의 도전체의 밑면의 높이와 산화물(530b)의 밑면의 높이의 차이는 하 한값으로서는 0nm 이상, 3nm 이상, 또는 5nm 이상으로 하는 것이 바람직하고, 상한값으로서는 20nm 이하, 50nm 이하, 또는 100nm 이하로 하는 것이 바람직하다. 또한 상술한 하한값 및 상한값은 서로 조합할 수 있는 것으로 한다. 절연체는 절연체 위에 제공되고, 절연체 및 도전체가 제공되는 영역에 개구가 형성되어 있 다. 또한 절연체의 상면은 평탄화되어도 좋다. 층간막으로서 기능하는 절연체는 유전율이 낮은 것이 바람직하다. 유전율이 낮은 재료를 층간막에 사용함 으로써, 배선 사이에 발생하는 기생 용량을 저감할 수 있다. 절연체는 예를 들어 절연체와 같은 재 료를 사용하여 제공되는 것이 바람직하다. 특히 산화 실리콘 및 산화질화 실리콘은 열적으로 안정적이므로 바 람직하다. 특히 산화 실리콘, 산화질화 실리콘, 공공을 갖는 산화 실리콘 등의 재료는 가열에 의하여 이탈되는 산소를 포함한 영역을 용이하게 형성할 수 있기 때문에 바람직하다. 절연체에서는 물, 수소 등의 불순물의 농도가 감소되어 있는 것이 바람직하다. 예를 들어 절연체에 는 산화 실리콘, 산화질화 실리콘 등의 실리콘을 포함한 산화물을 적절히 사용하면 좋다. 절연체는 물, 수소 등의 불순물이 위쪽으로부터 절연체로 확산되는 것을 억제하는 배리어 절연막으로 서 기능하는 것이 바람직하고, 수소 등의 불순물을 포획하는 기능을 갖는 것이 바람직하다. 또한 절연체 는 산소의 투과를 억제하는 배리어 절연막으로서 기능하는 것이 바람직하다. 절연체로서는, 비정질 구조 를 갖는 금속 산화물, 예를 들어 산화 알루미늄 등의 절연체를 사용하면 좋다. 이 경우, 절연체는 적어도 산소와 알루미늄을 포함한다. 절연체와 절연체 사이에 끼워진 영역에, 수소 등의 불순물을 포획하는 기능을 갖는 절연체를 절연체와 접하여 제공함으로써, 절연체 등에 포함되는 수소 등의 불순물 을 포획하고, 상기 영역 내에서의 수소의 양을 일정하게 할 수 있다. 특히, 절연체에 비정질 구조를 갖는 산화 알루미늄을 사용함으로써, 수소를 더 효과적으로 포획 또는 고착할 수 있는 경우가 있기 때문에 바람직하 다. 이에 의하여, 특성이 양호하고 신뢰성이 높은 트랜지스터 및 반도체 장치를 제작할 수 있다. 절연체는 물, 수소 등의 불순물이 위쪽으로부터 절연체로 확산되는 것을 억제하는 배리어 절연막으로 서 기능한다. 절연체는 절연체 위에 배치된다. 절연체에는 질화 실리콘 또는 질화산화 실리콘 등의 실리콘을 포함한 질화물을 사용하는 것이 바람직하다. 예를 들어 절연체로서 스퍼터링법으로 성막된 질화 실리콘을 사용하면 좋다. 절연체를 스퍼터링법으로 성막함으로써, 밀도가 높은 질화 실리콘막을 형 성할 수 있다. 또한 절연체로서, 스퍼터링법으로 성막된 질화 실리콘 위에 PEALD법 또는 CVD법으로 성막 된 질화 실리콘을 더 적층하여도 좋다. 또한 트랜지스터의 제 1 단자 및 제 2 단자 중 한쪽은 플러그로서 기능하는 도전체(540a)에 전기적으로 접 속되고, 트랜지스터의 제 1 단자 및 제 2 단자 중 다른 쪽은 도전체(540b)에 전기적으로 접속되어 있다. 또한 도전체(540a), 도전체(540b) 등은 상방의 표시부(DSP) 또는 하방의 회로부(SIC)에 전기적으로 접속시키기 위한 배선으로서 기능하는 경우가 있다. 또한 본 명세서 등에서는 도전체(540a) 및 도전체(540b)를 통틀어 도 전체라고 부르기로 한다. 도전체(540a)는 일례로서 도전체(542a)와 중첩되는 영역에 제공되어 있다. 구체적으로는, 도전체(542a)와 중첩 되는 영역에서, 도 17의 (A)에 나타낸 절연체, 절연체, 절연체, 절연체, 절연체, 및 절연체에는 개구부가 형성되어 있고, 도전체(540a)는 상기 개구부의 내측에 제공되어 있다. 또한 도전체 (540b)는 일례로서 도전체(542b)와 중첩되는 영역에 제공되어 있다. 구체적으로는, 도전체(542b)와 중첩되는 영역에서, 도 17의 (A)에 나타낸 절연체, 절연체, 절연체, 절연체, 절연체, 및 절연 체에는 개구부가 형성되어 있고, 도전체(540b)는 상기 개구부의 내측에 제공되어 있다. 또한 도 17의 (A)에 나타낸 바와 같이, 도전체(542a)와 중첩되는 영역의 개구부의 측면과 도전체(540a) 사이에 는 불순물에 대한 배리어성을 갖는 절연체로서 절연체(541a)를 제공하여도 좋다. 이와 마찬가지로 도전체 (542b)와 중첩되는 영역의 개구부의 측면과 도전체(540b) 사이에는 불순물에 대한 배리어성을 갖는 절연체로서 절연체(541b)를 제공하여도 좋다. 또한 본 명세서 등에서는 절연체(541a) 및 절연체(541b)를 통틀어 절연체 라고 부르기로 한다. 도전체(540a) 및 도전체(540b)에는 텅스텐, 구리, 또는 알루미늄을 주성분으로 하는 도전성 재료를 사용하는 것 이 바람직하다. 또한 도전체(540a) 및 도전체(540b)는 적층 구조로 하여도 좋다. 또한 도전체를 적층 구조로 하는 경우, 절연체, 절연체, 절연체, 절연체, 절연체 , 및 절연체 근방에 배치되는 제 1 도전체에는 물, 수소 등의 불순물의 투과를 억제하는 기능을 갖는 도전성 재료를 사용하는 것이 바람직하다. 예를 들어 탄탈럼, 질화 탄탈럼, 타이타늄, 질화 타이타늄, 루테늄, 산화 루테늄 등을 사용하는 것이 바람직하다. 또한 물, 수소 등의 불순물의 투과를 억제하는 기능을 갖는 도전 성 재료를 단층으로 또는 적층하여 사용하여도 좋다. 또한 절연체보다 위층에 포함되는 물, 수소 등의 불 순물이 도전체(540a) 및 도전체(540b)를 통하여 산화물에 혼입되는 것을 억제할 수 있다. 절연체(541a) 및 절연체(541b)로서는 절연체 등으로서 사용할 수 있는 배리어 절연막을 사용하면 좋다. 예를 들어 절연체(541a) 및 절연체(541b)로서는 질화 실리콘, 산화 알루미늄, 질화산화 실리콘 등의 절연체를 사용하면 좋다. 절연체(541a) 및 절연체(541b)는 절연체, 절연체, 및 절연체와 접하여 제공되 기 때문에, 절연체 등에 포함되는 물, 수소 등의 불순물이 도전체(540a) 및 도전체(540b)를 통하여 산화물 에 혼입되는 것을 억제할 수 있다. 특히, 질화 실리콘은 수소에 대한 차단성이 높기 때문에 적합하다. 또한 절연체에 포함되는 산소가 도전체(540a) 및 도전체(540b)에 흡수되는 것을 방지할 수 있다. 도 17의 (A)에 나타낸 바와 같이 절연체(541a)와 절연체(541b)를 적층 구조로 하는 경우, 절연체 등의 개 구의 내벽과 접하는 제 1 절연체와, 그 내측의 제 2 절연체는, 산소에 대한 배리어 절연막과 수소에 대한 배리 어 절연막을 조합한 것을 사용하여 형성되는 것이 바람직하다. 예를 들어 제 1 절연체로서 ALD법으로 성막된 산화 알루미늄을 사용하고, 제 2 절연체로서 PEALD법으로 성막된 질화 실리콘을 사용하면 좋다. 이와 같은 구성으로 함으로써, 도전체의 산화를 억제하고, 도전체에 수소가 혼입되는 것을 저감할 수 있다. 또한 트랜지스터에서는 절연체의 제 1 절연체와 절연체의 제 2 도전체가 적층되어 있지만, 본 발명은 이에 한정되지 않는다. 예를 들어 절연체를 단층 또는 3층 이상의 적층 구조로 하여도 좋다. 또 한 트랜지스터에서는 도전체의 제 1 도전체와 도전체의 제 2 도전체가 적층되어 있지만, 본 발 명은 이에 한정되지 않는다. 예를 들어 도전체를 단층 또는 3층 이상의 적층 구조로 하여도 좋다. 또한 본 발명의 일 형태의 반도체 장치에 포함되는 트랜지스터의 구조는 도 16, 도 17의 (A), (B)에 나타낸 트 랜지스터의 구조에 한정되지 않는다. 본 발명의 일 형태의 반도체 장치에 포함되는 트랜지스터의 구조는 상황에 따라 변경하여도 좋다. 또한 본 실시형태에서, 표시부(DSP)에 포함되는 트랜지스터를 보텀 게이트 구조의 트랜지스터로 하였지만, 본 발명의 일 형태는 이에 한정되지 않는다. 예를 들어 도 14의 (A)에 나타낸 표시 장치(표시 시스템)는, 도 19에 나타낸 표시 장치(표시 시스템)와 같이, 표시부(DSP)에 포함되는 트랜지스터가, 층(OSC)에 적용할 수 있는 OS 트랜지스터와 같은 구성을 가져도 좋다. 또한 도 19에 나타낸 표시 장치(표시 시스템)는, 도 16에 나 타낸 표시 장치(표시 시스템)와 마찬가지로, 도 20에 나타낸 표시 장치(표시 시스템)와 같이, 층(OSC)을 포함하 여도 좋다. 즉 본 발명의 일 형태의 표시 시스템은 적층된 복수의 OS 트랜지스터를 포함할 수 있다. 상술한 바와 같이, 회로부(SIC)와, 회로부(SIC) 상방의 표시부(DSP)를 제공함으로써, 화상을 처리하는 기능, 화 상을 보정하는 기능, 프레임 레이트를 변경하는 기능, 인공 지능을 이용한 기능 등을 갖는 표시 장치 또는 표시 시스템(본 명세서에서는 상기 표시 장치 또는 상기 표시 시스템을 초고정세 OLED 시스템 디스플레이라고 부름) 을 구성할 수 있다. 또한 회로부(SIC)와 회로부(SIC) 사이에 층(OSC)을 제공함으로써, 회로부(SIC)에 포함되는 반도체 기판 위에 형성되는 트랜지스터와는 별도의 트랜지스터를 제공할 수 있기 때문에, 회로부(SIC)에 포함되 는 주변 회로(DRV) 및 기능 회로(MFNC)의 설계의 폭을 넓힐 수 있다. 또한 층(OSC)에 회로를 제공함으로써, 초 고정세 OLED 시스템 디스플레이의 회로 면적의 증가를 방지할 수 있다. 또한 본 실시형태는 본 명세서에서 설명하는 다른 실시형태와 적절히 조합할 수 있다. (실시형태 4) 본 실시형태에서는, 앞의 실시형태에서 설명한 OS 트랜지스터에 사용할 수 있는 금속 산화물(이하, 산화물 반도 체라고도 함)에 대하여 설명한다. 금속 산화물은 적어도 인듐 또는 아연을 포함하는 것이 바람직하다. 특히 인듐 및 아연을 포함하는 것이 바람 직하다. 또한 이들에 더하여 알루미늄, 갈륨, 이트륨, 주석 등이 포함되는 것이 바람직하다. 또한 붕소, 실리 콘, 타이타늄, 철, 니켈, 저마늄, 지르코늄, 몰리브데넘, 란타넘, 세륨, 네오디뮴, 하프늄, 탄탈럼, 텅스텐, 마 그네슘, 코발트 등 중에서 선택된 1종류 또는 복수 종류가 포함되어도 좋다. <결정 구조의 분류> 먼저, 산화물 반도체에서의 결정 구조의 분류에 대하여 도 21의 (A)를 사용하여 설명한다. 도 21의 (A)는 산화 물 반도체, 대표적으로는 IGZO(In과, Ga와, Zn을 포함한 금속 산화물)의 결정 구조의 분류를 설명하는 도면이다. 도 21의 (A)에 나타낸 바와 같이, 산화물 반도체는 \"Amorphous(무정형)\"와, \"Crystalline(결정성)\"과, \"Crystal(결정)\"로 크게 분류된다. 또한 \"Amorphous\"에는 completely amorphous가 포함된다. 또한 \"Crystalline\"에는 CAAC(c-axis-aligned crystalline), nc(nanocrystalline), 및 CAC(Cloud-Aligned Composite)가 포함된다(excluding single crystal and poly crystal). 또한 \"Crystalline\"의 분류에서 single crystal, poly crystal, 및 completely amorphous는 제외된다. 또한 \"Crystal\"에는 single crystal 및 poly crystal이 포함된다. 또한 도 21의 (A)에 나타낸 굵은 테두리 내의 구조는 \"Amorphous(무정형)\"와 \"Crystal(결정)\"의 중간 상태이고, 새로운 경계 영역(New crystalline phase)에 속하는 구조이다. 즉 상기 구조는 에너지적으로 불안정한 \"Amorphous(무정형)\", 및 \"Crystal(결정)\"과는 전혀 다른 구조라고 할 수 있다. 또한 막 또는 기판의 결정 구조는 X선 회절(XRD: X-Ray Diffraction) 스펙트럼을 사용하여 평가할 수 있다. 여 기서, \"Crystalline\"으로 분류되는 CAAC-IGZO막을 GIXD(Grazing-Incidence XRD) 측정하여 얻어지는 XRD 스펙트 럼을 도 21의 (B)에 나타내었다(세로축은 강도(Intensity)를 임의 단위(a.u.)로 나타냄). 또한 GIXD법은 박막 법 또는 Seemann-Bohlin법이라고도 한다. 이하에서는, 도 21의 (B)에 나타낸 GIXD 측정에 의하여 얻어지는 XRD 스펙트럼을 단순히 XRD 스펙트럼이라고 나타내는 경우가 있다. 또한 도 21의 (B)에 나타낸 CAAC-IGZO막의 조성 은 In:Ga:Zn=4:2:3[원자수비] 근방이다. 또한 도 21의 (B)에 나타낸 CAAC-IGZO막의 두께는 500nm이다. 도 21의 (B)에 나타낸 바와 같이, CAAC-IGZO막의 XRD 스펙트럼에서는 명확한 결정성을 나타내는 피크가 검출된 다. 구체적으로는, CAAC-IGZO막의 XRD 스펙트럼에서는 2θ=31° 근방에 c축 배향을 나타내는 피크가 검출된다. 또한 도 21의 (B)에 나타낸 바와 같이, 2θ=31° 근방의 피크는 피크 강도가 검출된 각도를 축으로 좌우 비대칭 이다. 또한 막 또는 기판의 결정 구조는, 나노빔 전자 회절법(NBED: Nano Beam Electron Diffraction)에 의하여 관찰 되는 회절 패턴(나노빔 전자 회절 패턴이라고도 함)으로 평가할 수 있다. CAAC-IGZO막의 회절 패턴을 도 21의 (C)에 나타내었다. 도 21의 (C)는 기판에 대하여 전자선을 평행하게 입사시키는 NBED에 의하여 관찰되는 회절 패턴을 나타낸 것이다. 또한 도 21의 (C)에 나타낸 CAAC-IGZO막의 조성은 In:Ga:Zn=4:2:3[원자수비] 근방이다. 또한 나노빔 전자 회절법에서는 프로브 직경을 1nm로 하여 전자 회절이 수행된다. 도 21의 (C)에 나타낸 바와 같이, CAAC-IGZO막의 회절 패턴에서는 c축 배향을 나타내는 복수의 스폿이 관찰된다. <<산화물 반도체의 구조>> 또한 산화물 반도체는 결정 구조에 주목한 경우, 도 21의 (A)와는 다른 식으로 분류되는 경우가 있다. 예를 들 어 산화물 반도체는 단결정 산화물 반도체와, 그 외의 비단결정 산화물 반도체로 분류된다. 비단결정 산화물 반도체로서는, 예를 들어 상술한 CAAC-OS 및 nc-OS가 있다. 또한 비단결정 산화물 반도체에는 다결정 산화물 반도체, a-like OS(amorphous-like oxide semiconductor), 비정질 산화물 반도체 등이 포함된다. 여기서, 상술한 CAAC-OS, nc-OS, 및 a-like OS에 대하여 자세히 설명한다. [CAAC-OS] CAAC-OS는 복수의 결정 영역을 갖고, 상기 복수의 결정 영역은 c축이 특정 방향으로 배향되는 산화물 반도체이 다. 또한 특정 방향이란, CAAC-OS막의 두께 방향, CAAC-OS막의 피형성면의 법선 방향, 또는 CAAC-OS막의 표면의 법선 방향을 말한다. 또한 결정 영역이란, 원자 배열에 주기성을 갖는 영역을 말한다. 또한 원자 배열을 격자 배열로 간주하면, 결정 영역은 격자 배열이 정렬된 영역이기도 하다. 또한 CAAC-OS는 a-b면 방향에서 복 수의 결정 영역이 연결되는 영역을 갖고, 상기 영역은 변형을 갖는 경우가 있다. 또한 변형이란, 복수의 결정 영역이 연결되는 영역에서, 격자 배열이 정렬된 영역과, 격자 배열이 정렬된 다른 영역 사이에서 격자 배열의 방향이 변화되는 부분을 가리킨다. 즉 CAAC-OS는 c축 배향을 갖고, a-b면 방향으로는 명확한 배향을 갖지 않는 산화물 반도체이다. 또한 상기 복수의 결정 영역은 각각 하나 또는 복수의 미소한 결정(최대 직경이 10nm 미만인 결정)으로 구성된 다. 결정 영역이 하나의 미소한 결정으로 구성되는 경우, 상기 결정 영역의 최대 직경은 10nm 미만이 된다. 또한 결정 영역이 다수의 미소한 결정으로 구성되는 경우, 상기 결정 영역의 크기는 수십nm 정도가 되는 경우가 있다. 또한 In-M-Zn 산화물(원소 M은 알루미늄, 갈륨, 이트륨, 주석, 타이타늄 등 중에서 선택된 1종류 또는 복수 종 류)에서, CAAC-OS는 인듐(In) 및 산소를 포함한 층(이하, In층)과, 원소 M, 아연(Zn), 및 산소를 포함한 층(이 하, (M,Zn)층)이 적층된 층상의 결정 구조(층상 구조라고도 함)를 갖는 경향이 있다. 또한 인듐과 원소 M은 서 로 치환될 수 있다. 따라서 (M,Zn)층에는 인듐이 포함되는 경우가 있다. 또한 In층에는 원소 M이 포함되는 경 우가 있다. 또한 In층에는 Zn이 포함되는 경우도 있다. 상기 층상 구조는 예를 들어 고분해능 TEM 이미지에서 격자상(格子像)으로 관찰된다. 예를 들어 XRD 장치를 사용하여 CAAC-OS막의 구조 해석을 수행할 때, θ/2θ 스캔을 사용한 Out-of-plane XRD 측정에서는, c축 배향을 나타내는 피크가 2θ=31° 또는 그 근방에서 검출된다. 또한 c축 배향을 나타내는 피 크의 위치(2θ의 값)는 CAAC-OS를 구성하는 금속 원소의 종류, 조성 등에 따라 변동되는 경우가 있다. 또한 예를 들어 CAAC-OS막의 전자 회절 패턴에서 복수의 휘점(스폿)이 관측된다. 또한 어떤 스폿과 다른 스폿 은 시료를 투과한 입사 전자선의 스폿(다이렉트 스폿이라고도 함)을 대칭 중심으로 하여 점대칭의 위치에서 관 측된다. 상기 특정 방향에서 결정 영역을 관찰한 경우, 상기 결정 영역 내의 격자 배열은 기본적으로 육방 격자이지만, 단위 격자는 정육각형에 한정되지 않고, 비정육각형인 경우가 있다. 또한 오각형, 칠각형 등의 격자 배열이 상 기 변형에 포함되는 경우가 있다. 또한 CAAC-OS에서는, 변형 근방에서도 명확한 결정립계(그레인 바운더리)를 확인할 수는 없다. 즉 격자 배열의 변형에 의하여 결정립계의 형성이 억제되는 것을 알 수 있다. 이는, a-b면 방향에서 산소 원자의 배열이 조밀하지 않은 것, 금속 원자가 치환됨으로써 원자 사이의 결합 거리가 변화되는 것 등에 의하여 CAAC-OS가 변형을 허용할 수 있기 때문이라고 생각된다. 또한 명확한 결정립계가 확인되는 결정 구조는 소위 다결정(polycrystal)이다. 결정립계는 재결합 중심이 되고, 캐리어가 포획되어 트랜지스터의 온 전류의 감소, 전계 효과 이동도의 저하 등을 일으킬 가능성이 높다. 따라서 명확한 결정립계가 확인되지 않는 CAAC-OS는 트랜지스터의 반도체층에 적합한 결정 구조를 갖는 결정성 의 산화물의 하나이다. 또한 CAAC-OS를 구성하기 위해서는, Zn을 포함하는 것이 바람직하다. 예를 들어 In-Zn 산화물 및 In-Ga-Zn 산화물은 In 산화물보다 결정립계의 발생을 더 억제할 수 있기 때문에 적합하다. CAAC-OS는 결정성이 높고, 명확한 결정립계가 확인되지 않는 산화물 반도체이다. 따라서 CAAC-OS는 결정립계에 기인하는 전자 이동도의 저하가 일어나기 어렵다고 할 수 있다. 또한 산화물 반도체의 결정성은 불순물의 혼입 및 결함의 생성 등으로 인하여 저하되는 경우가 있기 때문에, CAAC-OS는 불순물, 결함(산소 결손 등) 등이 적은 산화물 반도체라고 할 수도 있다. 따라서 CAAC-OS를 포함한 산화물 반도체는 물리적 성질이 안정된다. 그러므 로 CAAC-OS를 포함한 산화물 반도체는 열에 강하고 신뢰성이 높다. 또한 CAAC-OS는 제조 공정에서의 높은 온도 (소위 thermal budget)에 대해서도 안정적이다. 따라서 OS 트랜지스터에 CAAC-OS를 사용하면, 제조 공정의 자 유도를 높일 수 있다. [nc-OS] nc-OS는 미소한 영역(예를 들어 1nm 이상 10nm 이하의 영역, 특히 1nm 이상 3nm 이하의 영역)에서 원자 배열에 주기성을 갖는다. 바꿔 말하면, nc-OS는 미소한 결정을 갖는다. 또한 상기 미소한 결정은 크기가 예를 들어 1nm 이상 10nm 이하, 특히 1nm 이상 3nm 이하이기 때문에 나노 결정이라고도 한다. 또한 nc-OS에서는 상이한 나노 결정 간에서 결정 방위에 규칙성이 보이지 않는다. 그러므로 막 전체에서 배향성이 보이지 않는다. 따라 서 nc-OS는 분석 방법에 따라서는 a-like OS 및 비정질 산화물 반도체와 구별할 수 없는 경우가 있다. 예를 들 어 XRD 장치를 사용하여 nc-OS막의 구조 해석을 수행할 때, θ/2θ 스캔을 사용한 Out-of-plane XRD측정에서는, 결정성을 나타내는 피크가 검출되지 않는다. 또한 nc-OS막에 대하여 나노 결정보다 큰 프로브 직 경(예를 들어 50nm 이상)의 전자선을 사용하는 전자 회절(제한 시야 전자 회절이라고도 함)을 수행하면, 헤일로 패턴과 같은 회절 패턴이 관측된다. 한편 nc-OS막에 대하여 나노 결정의 크기와 가깝거나 나노 결정보다 작은 프로브 직경(예를 들어 1nm 이상 30nm 이하)의 전자선을 사용하는 전자 회절(나노빔 전자 회절이라고도 함)을 수행하면, 다이렉트 스폿을 중심으로 하는 링 형상의 영역 내에 복수의 스폿이 관측되는 전자 회절 패턴이 취득 되는 경우가 있다. [a-like OS] a-like OS는 nc-OS와 비정질 산화물 반도체의 중간의 구조를 갖는 산화물 반도체이다. a-like OS는 공동(void) 또는 저밀도 영역을 갖는다. 즉 a-like OS는 nc-OS 및 CAAC-OS보다 결정성이 낮다. 또한 a-like OS는 nc-OS 및 CAAC-OS보다 막 내의 수소 농도가 높다. <<산화물 반도체의 구성>> 다음으로, 상술한 CAC-OS에 대하여 자세히 설명한다. 또한 CAC-OS는 재료 구성에 관한 것이다. [CAC-OS] CAC-OS란, 예를 들어 금속 산화물을 구성하는 원소가 0.5nm 이상 10nm 이하, 바람직하게는 1nm 이상 3nm 이하, 또는 그 근방의 크기로 편재된 재료의 한 구성이다. 또한 이하에서는 금속 산화물에서 하나 또는 복수의 금속 원소가 편재되고, 상기 금속 원소를 포함하는 영역이 0.5nm 이상 10nm 이하, 바람직하게는 1nm 이상 3nm 이하, 또는 그 근방의 크기로 혼합된 상태를 모자이크 패턴 또는 패치 패턴이라고도 한다. 또한 CAC-OS란, 재료가 제 1 영역과 제 2 영역으로 분리되어 모자이크 패턴을 형성하고, 상기 제 1 영역이 막 내에 분포된 구성(이하, 클라우드상이라고도 함)이다. 즉 CAC-OS는 상기 제 1 영역과 상기 제 2 영역이 혼합된 구성을 갖는 복합 금속 산화물이다. 여기서, In-Ga-Zn 산화물에서의 CAC-OS를 구성하는 금속 원소에 대한 In, Ga, 및 Zn의 원자수비를 각각 [In], [Ga], 및 [Zn]이라고 표기한다. 예를 들어 In-Ga-Zn 산화물에서의 CAC-OS에서, 제 1 영역은 [In]이 CAC-OS막 의 조성에서의 [In]보다 높은 영역이다. 또한 제 2 영역은 [Ga]이 CAC-OS막의 조성에서의 [Ga]보다 높은 영역 이다. 또는 예를 들어 제 1 영역은 [In]이 제 2 영역에서의 [In]보다 높고, [Ga]이 제 2 영역에서의 [Ga]보다 낮은 영역이다. 또한 제 2 영역은 [Ga]이 제 1 영역에서의 [Ga]보다 높고, [In]이 제 1 영역에서의 [In]보다 낮은 영역이다. 구체적으로는, 상기 제 1 영역은 인듐 산화물, 인듐 아연 산화물 등이 주성분인 영역이다. 또한 상기 제 2 영 역은 갈륨 산화물, 갈륨 아연 산화물 등이 주성분인 영역이다. 즉 상기 제 1 영역을 In을 주성분으로 하는 영 역이라고 바꿔 말할 수 있다. 또한 상기 제 2 영역을 Ga를 주성분으로 하는 영역이라고 바꿔 말할 수 있다. 또한 상기 제 1 영역과 상기 제 2 영역 사이에서 명확한 경계를 관찰할 수 없는 경우가 있다. 예를 들어 In-Ga-Zn 산화물에서의 CAC-OS에서는, 에너지 분산형 X선 분광법(EDX: Energy Dispersive X-ray spectroscopy)을 사용하여 취득한 EDX 매핑으로부터, In을 주성분으로 하는 영역(제 1 영역)과 Ga를 주성분으로 하는 영역(제 2 영역)이 편재되고 혼합된 구조를 갖는 것을 확인할 수 있다. CAC-OS를 트랜지스터에 사용하는 경우에는, 제 1 영역에 기인하는 도전성과 제 2 영역에 기인하는 절연성이 상 보적으로 작용함으로써, 스위칭 기능(On/Off 기능)을 CAC-OS에 부여할 수 있다. 즉 CAC-OS는 재료의 일부에서 는 도전성의 기능을 갖고, 재료의 다른 일부에서는 절연성의 기능을 갖고, 재료의 전체에서는 반도체로서의 기 능을 갖는다. 도전성의 기능과 절연성의 기능을 분리함으로써, 양쪽의 기능을 최대한 높일 수 있다. 따라서 CAC-OS를 트랜지스터에 사용함으로써, 높은 온 전류(Ion), 높은 전계 효과 이동도(μ), 및 양호한 스위칭 동작을 실현할 수 있다. 산화물 반도체는 다양한 구조를 갖고, 각각이 다른 특성을 갖는다. 본 발명의 일 형태의 산화물 반도체에는 비 정질 산화물 반도체, 다결정 산화물 반도체, a-like OS, CAC-OS, nc-OS, CAAC-OS 중 2종류 이상이 포함되어도 좋다. <산화물 반도체를 포함하는 트랜지스터> 이어서, 상기 산화물 반도체를 트랜지스터에 사용하는 경우에 대하여 설명한다. 상기 산화물 반도체를 트랜지스터에 사용함으로써, 전계 효과 이동도가 높은 트랜지스터를 실현할 수 있다. 또 한 신뢰성이 높은 트랜지스터를 실현할 수 있다. 트랜지스터에는 캐리어 농도가 낮은 산화물 반도체를 사용하는 것이 바람직하다. 예를 들어 산화물 반도체의 캐리어 농도는 1×1017cm-3 이하, 바람직하게는 1×1015cm-3 이하, 더 바람직하게는 1×1013cm-3 이하, 더욱 바람직 하게는 1×1011cm-3 이하, 더욱더 바람직하게는 1×1010cm-3 미만이고, 1×10-9cm-3 이상이다. 또한 산화물 반도체 막의 캐리어 농도를 낮추는 경우에는, 산화물 반도체막 내의 불순물 농도를 낮추고, 결함 준위 밀도를 낮추면 좋다. 본 명세서 등에서, 불순물 농도가 낮고, 결함 준위 밀도가 낮은 것을 고순도 진성 또는 실질적으로 고순 도 진성이라고 한다. 또한 캐리어 농도가 낮은 산화물 반도체를 고순도 진성 또는 실질적으로 고순도 진성인 산화물 반도체라고 하는 경우가 있다. 또한 고순도 진성 또는 실질적으로 고순도 진성인 산화물 반도체막은 결함 준위 밀도가 낮기 때문에, 트랩 준위 밀도도 낮아지는 경우가 있다. 또한 산화물 반도체의 트랩 준위에 포획된 전하는 소실되는 데 걸리는 시간이 길고, 마치 고정 전하처럼 작용하 는 경우가 있다. 그러므로 트랩 준위 밀도가 높은 산화물 반도체에 채널 형성 영역이 형성되는 트랜지스터는 전기 특성이 불안정해지는 경우가 있다. 따라서 트랜지스터의 전기 특성을 안정적으로 하기 위해서는, 산화물 반도체 내의 불순물 농도를 감소시키는 것 이 유효하다. 또한 산화물 반도체 내의 불순물 농도를 감소시키기 위해서는, 근접한 막 내의 불순물 농도도 감 소시키는 것이 바람직하다. 불순물로서는 수소, 질소, 알칼리 금속, 알칼리 토금속, 철, 니켈, 실리콘 등이 있 다. <불순물> 여기서, 산화물 반도체 내에서의 각 불순물의 영향에 대하여 설명한다. 산화물 반도체에 14족 원소 중 하나인 실리콘, 탄소가 포함되면, 산화물 반도체에서 결함 준위가 형성된다. 그 러므로 산화물 반도체에서의 실리콘, 탄소의 농도와, 산화물 반도체와의 계면 근방의 실리콘, 탄소의 농도(이차 이온 질량 분석법(SIMS: Secondary Ion Mass Spectrometry)에 의하여 얻어지는 농도)를 2×1018atoms/cm3 이하, 바람직하게는 2×1017atoms/cm3 이하로 한다. 또한 산화물 반도체에 알칼리 금속 또는 알칼리 토금속이 포함되면, 결함 준위가 형성되고 캐리어가 생성되는 경우가 있다. 따라서 알칼리 금속 또는 알칼리 토금속이 포함되는 산화물 반도체를 사용한 트랜지스터는 노멀 리 온 특성을 갖기 쉽다. 그러므로 SIMS에 의하여 얻어지는 산화물 반도체 내의 알칼리 금속 또는 알칼리 토금 속의 농도를 1×1018atoms/cm3 이하, 바람직하게는 2×1016atoms/cm3 이하로 한다. 또한 산화물 반도체에 질소가 포함되면, 캐리어인 전자가 발생하고 캐리어 농도가 증가되어 n형화되기 쉽다. 그러므로 질소가 포함되는 산화물 반도체를 반도체로서 사용한 트랜지스터는 노멀리 온 특성을 갖기 쉽다. 또 는 산화물 반도체에 질소가 포함되면, 트랩 준위가 형성되는 경우가 있다. 이 결과, 트랜지스터의 전기 특성이 불안정해지는 경우가 있다. 그러므로 SIMS에 의하여 얻어지는 산화물 반도체 내의 질소 농도를 5× 1019atoms/cm3 미만, 바람직하게는 5×1018atoms/cm3 이하, 더 바람직하게는 1×1018atoms/cm3 이하, 더욱 바람직 하게는 5×1017atoms/cm3 이하로 한다. 또한 산화물 반도체에 포함되는 수소는 금속 원자와 결합하는 산소와 반응하여 물이 되기 때문에, 산소 결손을 형성하는 경우가 있다. 상기 산소 결손에 수소가 들어감으로써, 캐리어인 전자가 생성되는 경우가 있다. 또한 수소의 일부가 금속 원자와 결합하는 산소와 결합하여, 캐리어인 전자가 생성되는 경우가 있다. 따라서 수소가 포함되는 산화물 반도체를 사용한 트랜지스터는 노멀리 온 특성을 갖기 쉽다. 그러므로 산화물 반도체 내의 수 소는 가능한 한 저감되어 있는 것이 바람직하다. 구체적으로는, 산화물 반도체에서 SIMS에 의하여 얻어지는 수 소 농도를 1×1020atoms/cm3 미만, 바람직하게는 1×1019atoms/cm3 미만, 더 바람직하게는 5×1018atoms/cm3 미만, 더욱 바람직하게는 1×1018atoms/cm3 미만으로 한다. 불순물이 충분히 저감된 산화물 반도체를 트랜지스터의 채널 형성 영역에 사용함으로써, 안정된 전기 특성을 부 여할 수 있다. 또한 본 실시형태는 본 명세서의 다른 실시형태와 적절히 조합할 수 있다. (실시형태 5) 본 실시형태에서는, 본 발명의 일 형태의 전자 기기의 일례로서 표시 장치, 표시 시스템 중 적어도 하나가 적용 된 헤드 마운트 디스플레이에 대하여 설명한다. 도 22의 (A) 및 (B)에는 헤드 마운트 디스플레이의 외관을 도시하였다. 헤드 마운트 디스플레이는 하우징, 표시부, 조작 버튼, 및 밴드상 고정구를 갖 는다. 조작 버튼은 전원 버튼 등의 기능을 갖는다. 또한 조작 버튼 이외의 버튼을 가져도 좋다. 또한 도 22의 (C)에 도시된 바와 같이, 표시부와 사용자의 눈 위치 사이에 렌즈를 가져도 좋다. 렌즈에 의하여 사용자는 표시부를 확대하여 볼 수 있기 때문에 임장감이 더 높아진다. 이때 도 22 의 (C)에 도시된 바와 같이 시도(視度) 조절을 위하여 렌즈의 위치를 변화시키는 다이얼을 가져도 좋다. 표시부에 본 발명의 일 형태의 표시 장치, 표시 시스템 중 적어도 하나를 적용할 수 있다. 본 발명의 일 형태의 표시 장치, 표시 시스템 중 적어도 하나는 정세도가 매우 높기 때문에, 도 22의 (C)와 같이 렌즈 를 사용하여 확대한 경우에도 사용자에게 화소가 시인되지 않아 현실감이 더 높은 영상을 표시할 수 있다. 도 22의 (A) 내지 (C)에는 1장의 표시부를 갖는 경우의 예를 나타내었다. 이와 같은 구성으로 함으로써 부품 점수를 삭감할 수 있다. 표시부는 좌우 2개의 영역에 각각 오른쪽 눈용 화상과 왼쪽 눈용 화상의 2개의 화상을 나란히 표시할 수 있다. 이로써, 양안 시차를 사용한 입체 영상을 표시할 수 있다. 또한 표시부의 전역에 걸쳐, 양쪽 눈으로 시인 가능한 하나의 화상을 표시하여도 좋다. 이로써, 시야의 양단에 걸쳐 파노라마 영상을 표시할 수 있게 되어 현실감이 높아진다. 여기서, 헤드 마운트 디스플레이는 사용자의 머리 크기 또는 눈 위치 등에 따라 표시부의 곡률을 적절한 값으로 변화시키는 기구를 갖는 것이 바람직하다. 예를 들어, 표시부의 곡률을 조정하기 위한 다 이얼을 조작함으로써, 사용자가 스스로 표시부의 곡률을 조정하여도 좋다. 또는 사용자의 머리 크 기 또는 눈 위치 등을 검출하는 센서(예를 들어 카메라, 접촉식 센서, 비접촉식 센서 등)를 하우징에 제 공하고, 센서의 검출 데이터에 기초하여 표시부의 곡률을 조정하는 기구가 포함되어도 좋다. 또한 렌즈를 사용하는 경우에는, 표시부의 곡률과 동기하여 렌즈의 위치 및 각도를 조정하는 기구가 포함되는 것이 바람직하다. 또는 다이얼이 렌즈의 각도를 조정하는 기능을 가져도 좋다. 도 22의 (E) 및 (F)에는 표시부의 곡률을 제어하는 구동부가 포함되는 예를 나타내었다. 구동부 는 표시부의 적어도 일부에 고정되어 있다. 구동부는 표시부에 고정되는 부분이 변형 또는 이동함으로써, 표시부를 변형시키는 기능을 갖는다. 도 22의 (E)에는 머리가 비교적 큰 사용자가 하우징을 착용한 경우의 모식도를 도시하였다. 이때 표시부의 형상은 곡률이 비교적 작게(곡률 반경이 크게) 되도록 구동부에 의하여 조정된다. 한편 도 22의 (F)에는 사용자와 비교하여 머리가 작은 사용자가 하우징을 착용한 경우를 나 타내었다. 또한 사용자는 사용자와 비교하여 양쪽 눈의 간격이 좁다. 이때 표시부의 형상 은 표시부의 곡률이 크게(곡률 반경이 작게) 되도록 구동부에 의하여 조정된다. 도 22의 (F)에 있 어서는 도 22의 (E)에서의 표시부의 위치 및 형상을 파선으로 나타내었다. 이와 같이, 헤드 마운트 디스플레이는 표시부의 곡률을 조정하는 기구를 가짐으로써 남녀노소 다양 한 사용자에게 최적의 표시를 제공할 수 있다. 또한 표시부에 표시하는 콘텐츠에 따라 표시부의 곡률을 변화시킴으로써 사용자가 높은 임장감을 느끼게 할 수도 있다. 예를 들어 표시부의 곡률을 진동시킴으로써 흔들림을 표현할 수 있다. 이와 같이, 콘텐츠 내의 장면에 맞추어 다양한 연출을 할 수 있고, 사용자에게 새로운 체험을 제공할 수 있다. 또한 이때 하우징에 제공된 진동 모듈과 연동시킴으로써, 임장감이 더 높은 표시가 가능해진다.또한 헤드 마운트 디스플레이는 도 22의 (D)에 도시된 바와 같이 2개의 표시부를 가져도 좋다. 2개의 표시부를 가짐으로써, 사용자는 한쪽 눈마다 하나의 표시부를 볼 수 있다. 이로써, 시차를 사용한 3차원 표시 등을 수행하는 경우에도 높은 해상도의 영상을 표시할 수 있다. 또한 표시부는 사용자의 눈 을 대략 중심으로 한 원호 형상으로 만곡되어 있다. 이로써, 사용자의 눈으로부터 표시부의 표시면까지의 거리 가 일정하게 되므로, 사용자는 더 자연스러운 영상을 볼 수 있다. 또한 표시부로부터의 광의 휘도 및 색도가 보는 각도에 따라 변화되는 경우에도, 표시부의 표시면의 법선 방향으로 사용자의 눈이 위치하기 때문에 실질적 으로 그 영향을 무시할 수 있어, 더 현실감이 있는 영상을 표시할 수 있다. 또한 본 실시형태는 본 명세서에서 설명하는 다른 실시형태와 적절히 조합할 수 있다. (실시형태 6) 본 실시형태에서는, 본 발명의 일 형태의 표시 장치, 표시 시스템 중 적어도 하나를 사용하여 제작할 수 있는 표시 모듈에 대하여 설명한다. 도 23의 (A)에 도시된 표시 모듈은 상부 커버와 하부 커버 사이에 FPC가 접속된 표시 장치, 프레임, 인쇄 기판, 및 배터리를 갖는다. 예를 들어 본 발명의 일 형태를 사용하여 제작된 표시 장치, 표시 시스템 중 적어도 하나를 표시 장치에 사용할 수 있다. 표시 장치에 의하여 소비 전력이 매우 낮은 표시 모듈을 실현할 수 있다. 상부 커버 및 하부 커버는 표시 장치의 크기에 맞추어 형상 및 치수를 적절히 변경할 수 있 다. 표시 장치는 터치 패널로서의 기능을 가져도 좋다. 프레임은 표시 장치의 보호 기능, 인쇄 기판의 동작에 의하여 발생하는 전자기파를 차단하는 기능, 방열판으로서의 기능 등을 가져도 좋다. 인쇄 기판은 전원 회로, 비디오 신호 및 클록 신호를 출력하기 위한 신호 처리 회로, 배터리 제어 회로 등을 갖는다. 도 23의 (B)는 광학식 터치 센서를 구비하는 표시 모듈의 단면 개략도이다. 표시 모듈은 인쇄 기판에 제공된 발광부 및 수광부를 갖는다. 또한 상부 커버 와 하부 커버로 둘러싸인 영역에 한 쌍의 도광부(도광부(6017a), 도광부(6017b))를 갖는다. 표시 장치는 프레임을 개재하여 인쇄 기판 및 배터리와 중첩되어 제공된다. 표시 장 치와 프레임은 도광부(6017a), 도광부(6017b)에 고정되어 있다. 발광부로부터 방출된 광은 도광부(6017a)에 의하여 표시 장치 상부를 경유하고, 도광부 (6017b)를 통과하여 수광부에 도달한다. 예를 들어 손가락 또는 스타일러스 등의 피검지체에 의하여 광 이 차단됨으로써 터치 조작을 검출할 수 있다. 발광부는 예를 들어 표시 장치의 인접한 2변을 따라 복수로 제공된다. 수광부는 발광부 와 대향되는 위치에 복수로 제공된다. 이로써 터치 조작이 행해진 위치의 정보를 취득할 수 있다. 발광부에는 예를 들어 LED 소자 등의 광원을 사용할 수 있고, 특히 적외선을 발하는 광원을 사용하는 것 이 바람직하다. 수광부에는 발광부가 발하는 광을 수광하여 전기 신호로 변환하는 광전 소자를 사 용할 수 있다. 바람직하게는 적외선을 수광할 수 있는 포토다이오드를 사용할 수 있다. 광을 투과시키는 도광부(6017a), 도광부(6017b)를 사용함으로써, 발광부와 수광부를 표시 장 치 아래 측에 배치할 수 있고, 외광이 수광부에 도달하여 터치 센서가 오동작하는 것을 억제할 수 있다. 특히 가시광을 흡수하고 적외선을 투과시키는 수지를 사용하면 터치 센서의 오동작을 더 효과적으로 억 제할 수 있다. 또한 본 실시형태는 본 명세서에서 설명하는 다른 실시형태와 적절히 조합할 수 있다. (실시형태 7) 본 실시형태에서는, 본 발명의 일 형태의 표시 장치, 표시 시스템 중 적어도 하나를 적용할 수 있는 전자 기기 의 예에 대하여 설명한다. 도 24의 (A)에 도시된 전자 기기는 스마트폰으로서 사용할 수 있는 휴대 정보 단말기이다. 전자 기기는 하우징, 표시부, 전원 버튼, 버튼, 스피커, 마이크로폰 , 카메라, 및 광원을 갖는다. 표시부는 터치 패널 기능을 갖는다. 표시부에 본 발명의 일 형태의 표시 장치, 표시 시스템 중 적어도 하나를 적용할 수 있다. 도 24의 (B)는 하우징의 마이크로폰 측의 단부를 포함하는 단면 개략도이다. 하우징의 표시면 측에는 투광성을 갖는 보호 부재가 제공되고, 하우징과 보호 부재로 둘러싸인 공간 내에 표시 패널, 광학 부재, 터치 센서 패널, 인쇄 기판, 배터리 등이 배치되어 있다. 보호 부재에는 표시 패널, 광학 부재, 및 터치 센서 패널이 도시하지 않은 접착층에 의하여 고정되어 있다. 또한 표시부보다 외측의 영역에서 표시 패널의 일부가 접혀 있다. 또한 이 접힌 부분에 FPC(651 5)가 접속되어 있다. FPC에는 IC가 실장되어 있다. 또한 FPC는 인쇄 기판에 제공된 단자와 접속되어 있다. 표시 패널에는 예를 들어 플렉시블 디스플레이 패널을 적용할 수 있다. 그러므로 매우 가벼운 전자 기기 를 실현할 수 있다. 또한 표시 패널이 매우 얇기 때문에, 전자 기기의 두께를 늘리지 않고 대용량 배터 리를 탑재할 수도 있다. 또한 표시 패널의 일부를 접어 화소부의 이면에 FPC와의 접속부를 배치함으로써, 슬림 베젤의 전자 기기를 실현할 수 있다. 또한 본 실시형태는 본 명세서에서 설명하는 다른 실시형태와 적절히 조합할 수 있다. (실시형태 8) 본 실시형태에서는, 본 발명의 일 형태를 사용하여 제작된 표시 장치, 표시 시스템 중 적어도 하나를 포함하는 전자 기기에 대하여 설명한다. 이하에서 예시하는 전자 기기는 표시부에 본 발명의 일 형태의 표시 장치, 표시 시스템 중 적어도 하나를 포함 한다. 따라서, 높은 해상도가 실현된 전자 기기이다. 또한 높은 해상도와 큰 화면이 양립된 전자 기기로 할 수 있다. 본 발명의 일 형태는 표시 장치와, 안테나, 배터리, 하우징, 카메라, 스피커, 마이크로폰, 터치 센서, 및 조작 버튼 중 적어도 하나를 갖는다. 본 발명의 일 형태인 전자 기기는 이차 전지를 가져도 좋고, 비접촉 전력 전송(傳送)을 사용하여 이차 전지를 충전할 수 있는 것이 바람직하다. 이차 전지로서는 예를 들어 겔 형상의 전해질을 사용하는 리튬 폴리머 전지(리튬 이온 폴리머 전지) 등의 리튬 이온 이차 전지, 니켈 수소 전지, 니켈 카드뮴 전지, 유기 라디칼 전지, 납 축전지, 공기 이차 전지, 니켈 아연 전지, 은 아연 전지 등이 있다. 본 발명의 일 형태의 전자 기기는 안테나를 가져도 좋다. 안테나로 신호를 수신함으로써, 표시부에 영상, 정보 등을 표시할 수 있다. 또한 전자 기기가 안테나 및 이차 전지를 갖는 경우, 안테나를 비접촉 전력 전송에 사용 하여도 좋다. 본 발명의 일 형태의 전자 기기의 표시부에는 예를 들어 풀 하이비전, 4K2K, 8K4K, 16K8K, 또는 그 이상의 해상 도를 갖는 영상을 표시할 수 있다. 전자 기기로서는 예를 들어 텔레비전 장치, 노트북형 퍼스널 컴퓨터, 모니터 장치, 디지털 사이니지, 파칭코기, 게임기 등 비교적 큰 화면을 갖는 전자 기기 외에, 디지털 카메라, 디지털 비디오 카메라, 디지털 포토 프레임, 휴대 전화기, 휴대용 게임기, 휴대 정보 단말기, 음향 재생 장치 등이 있다. 본 발명의 일 형태가 적용된 전자 기기는 가옥, 또는 빌딩 등의 건물의 내벽 또는 외벽, 자동차 등의 내장 또는 외장 등이 갖는 평면 또는 곡면을 따라 제공할 수 있다.도 25의 (A)는 파인더가 장착된 상태의 카메라의 외관을 도시한 도면이다. 카메라는 하우징, 표시부, 조작 버튼, 셔터 버튼 등을 갖는다. 또한 카메라 에는 탈착 가능한 렌즈가 장착되어 있다. 또한 카메라는 렌즈와 하우징이 일체화되어도 좋다. 카메라는 셔터 버튼을 누르거나 터치 패널로서 기능하는 표시부를 터치함으로써 촬상할 수 있다. 하우징은 전극을 갖는 마운트를 갖고, 파인더 외에 스트로보 장치 등을 접속할 수 있다. 파인더는 하우징, 표시부, 버튼 등을 갖는다. 하우징은 카메라의 마운트와 결합하는 마운트에 의하여 카메라에 장착되어 있다. 파인더 는 카메라로부터 수신한 영상 등을 표시부에 표시할 수 있다. 버튼은 전원 버튼 등으로서의 기능을 갖는다. 카메라의 표시부 및 파인더의 표시부에 본 발명의 일 형태의 표시 장치, 표시 시스템 중 적어도 하나를 적용할 수 있다. 또한 파인더가 내장된 카메라이어도 좋다. 도 25의 (B)는 웨어러블 단말기의 일례인 정보 단말기의 외관을 나타낸 도면이다. 정보 단말기는 하우징, 표시부, 조작 버튼, 용두, 밴드 등을 포함한다. 웨어러블 단말기에 앞의 실시형태에서 설명한 표시 장치, 표시 시스템 중 적어도 하나를 적용함으로써, 표시부 에서 표시 품질이 높은 화상을 표시할 수 있다. 도 25의 (C)는 게임기의 일례인 휴대용 게임기의 외관을 나타낸 도면이다. 휴대용 게임기는 하우 징, 표시부, 버튼 등을 갖는다. 또한 휴대용 게임기의 영상은 텔레비전 장치, 퍼스널 컴퓨터용 디스플레이, 게임용 디스플레이, 헤드마운 트 디스플레이 등의 표시 장치에 의하여 출력할 수 있다. 휴대용 게임기에 앞의 실시형태에서 설명한 표시 장치, 표시 시스템 중 적어도 하나를 적용함으로써, 표 시부에서 표시 품질이 높은 화상을 표시할 수 있다. 또한 저소비 전력의 휴대용 게임기를 실현할 수 있다. 또한 소비 전력이 낮으면 회로로부터의 발열을 저감할 수 있기 때문에, 발열로 인한 그 회로 자체, 주변 회로, 및 모듈에 대한 영향을 줄일 수 있다. 도 26의 (A)는 헤드 마운트 디스플레이의 외관을 도시한 도면이다. 헤드 마운트 디스플레이는 장착부, 렌즈, 본체, 표시부, 케이블 등을 갖 는다. 또한 장착부에는 배터리가 내장되어 있다. 케이블은 배터리로부터 본체에 전력을 공급한다. 본체는 무선 수신기 등을 갖고, 수 신한 영상 정보를 표시부에 표시할 수 있다. 또한 본체는 카메라를 갖고, 사용자의 안구 또는 눈 꺼풀의 움직임의 정보를 입력 수단으로서 사용할 수 있다. 또한 장착부는 사용자와 접하는 위치에 사용자의 안구의 움직임에 따라 흐르는 전류를 검지할 수 있는 복 수의 전극이 제공되고, 시선을 인식하는 기능을 가져도 좋다. 또한 전극을 흐르는 전류에 의하여 사용자의 맥 박을 모니터링하는 기능을 가져도 좋다. 또한 장착부는 온도 센서, 압력 센서, 가속도 센서 등의 각종 센서를 가져도 좋고, 사용자의 생체 정보를 표시부에 표시하는 기능, 사용자의 머리 움직임에 맞추어 표 시부에 표시되는 영상을 변화시키는 기능 등을 가져도 좋다. 표시부에 본 발명의 일 형태의 표시 장치, 표시 시스템 중 적어도 하나를 적용할 수 있다. 도 26의 (B), (C), 및 (D)는 헤드 마운트 디스플레이의 외관을 도시한 도면이다. 헤드 마운트 디스플레 이는 하우징, 표시부, 밴드상의 고정구, 및 한 쌍의 렌즈를 포함한다. 사용자는 렌즈를 통하여 표시부의 표시를 시인할 수 있다. 또한 표시부를 만곡시켜 배치하 면, 사용자가 높은 임장감을 느낄 수 있어 바람직하다. 또한 표시부의 상이한 영역에 표시된 다른 화상 을 렌즈를 통하여 시인함으로써 시차를 사용한 3차원 표시 등을 할 수도 있다. 또한 하나의 표시부를 제공하는 구성에 한정되지 않고, 2개의 표시부를 제공하여 사용자의 한쪽 눈마다 하나의 표시부 를 배치하여도 좋다. 또한 표시부에 본 발명의 일 형태의 표시 장치, 표시 시스템 중 적어도 하나를 적용할 수 있다. 본 발명 의 일 형태의 반도체 장치를 갖는 표시 장치는 정세도가 매우 높기 때문에, 도 26의 (D)와 같이 렌즈를 사용하여 확대한 경우에도 사용자에게 화소가 시인되지 않고, 현실감이 더 높은 영상을 표시할 수 있다. 또한 본 실시형태는 본 명세서에서 설명하는 다른 실시형태와 적절히 조합할 수 있다."}
{"patent_id": "10-2023-7018044", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1의 (A)는 표시 장치의 구성예를 나타낸 도면이고, 도 1의 (B)는 표시 시스템의 구성예를 나타낸 도면이다. 도 2는 표시 시스템의 구성예를 나타낸 블록도이다. 도 3의 (A)는 표시 장치의 구성예를 나타낸 도면이고, 도 3의 (B)는 표시 시스템의 구성예를 나타낸 도면이다. 도 4는 표시 시스템의 구성예를 나타낸 블록도이다. 도 5의 (A) 내지 (G)는 메모리 셀의 구성예를 나타낸 회로도이다. 도 6은 표시 시스템의 구성예를 나타낸 블록도이다. 도 7의 (A) 및 (B)는 표시 시스템의 구성예를 나타낸 단면 모식도이다. 도 8은 표시 시스템의 구성예를 나타낸 블록도이다. 도 9의 (A) 및 (B)는 표시 시스템의 구성예를 나타낸 도면이다. 도 10은 표시 시스템의 구성예를 나타낸 도면이다.도 11의 (A) 및 (B)는 표시 시스템의 구성예를 나타낸 도면이다. 도 12는 표시 시스템의 구성예를 나타낸 도면이다. 도 13은 표시 시스템의 구성예를 나타낸 블록도이다. 도 14의 (A) 및 (B)는 표시 장치 또는 표시 시스템의 구성예를 나타낸 단면 모식도이다. 도 15의 (A) 내지 (C)는 발광 디바이스의 구성예를 나타낸 도면이다. 도 16은 표시 장치 또는 표시 시스템의 구성예를 나타낸 단면 모식도이다. 도 17의 (A) 및 (B)는 트랜지스터의 구성예를 나타낸 단면 모식도이다. 도 18의 (A) 및 (B)는 트랜지스터의 구성예를 나타낸 단면 모식도이다. 도 19는 표시 장치 또는 표시 시스템의 구성예를 나타낸 단면 모식도이다. 도 20은 표시 장치 또는 표시 시스템의 구성예를 나타낸 단면 모식도이다. 도 21의 (A)는 IGZO의 결정 구조의 분류를 설명하는 도면이고, 도 21의 (B)는 결정성 IGZO의 XRD 스펙트럼을 설 명하는 도면이고, 도 21의 (C)는 결정성 IGZO의 나노빔 전자 회절 패턴을 설명하는 도면이다. 도 22의 (A) 내지 (F)는 전자 기기의 구성예를 나타낸 도면이다. 도 23의 (A) 및 (B)는 표시 모듈의 구성예를 나타낸 도면이다. 도 24의 (A) 및 (B)는 전자 기기의 구성예를 나타낸 도면이다. 도 25의 (A) 내지 (C)는 전자 기기의 구성예를 나타낸 도면이다. 도 26의 (A) 내지 (D)는 전자 기기의 구성예를 나타낸 도면이다."}
