{"patent_id": "10-2016-0173749", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2018-0071031", "출원번호": "10-2016-0173749", "발명의 명칭": "공기조화기 및 그 제어방법", "출원인": "엘지전자 주식회사", "발명자": "송태엽"}}
{"patent_id": "10-2016-0173749", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "외부의 영상을 획득하는 카메라; 상기 카메라가 획득하는 영상에서, 복수의 영역으로 구분되는 실내 공간 내에 재실자가 위치하는 영역을 인식하고, 상기 재실자의 위치 인식 결과를 머신 러닝(machine learning)으로 기학습된 데이터의 입력으로 사용하여상기 복수의 영역에 대하여 생활 영역을 구분하는 영역 인식 모듈; 및상기 구분된 생활 영역에 기초하여 기류를 제어하는 기류 제어부;를 포함하는 공기조화기."}
{"patent_id": "10-2016-0173749", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 영역 인식 모듈은,상기 재실자의 위치 인식 결과를 누적하며, 상기 누적된 위치 인식 결과에 기초하여 상기 복수의 영역에 대하여 생활 영역을 구분하는 것을 특징으로 하는공기조화기."}
{"patent_id": "10-2016-0173749", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 영역 인식 모듈은,상기 카메라가 획득하는 영상에서 재실자의 존재 여부 및 위치를 인식하는 인체 인식기와상기 재실자의 위치 인식 결과에 기초하여 상기 복수의 영역에 대하여 생활 영역을 구분하는 영역 인식기를 포함하는 공기조화기."}
{"patent_id": "10-2016-0173749", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 영역 인식 모듈은,상기 구분된 생활 영역에 기초하여 기류 제어 신호를 생성하는 신호 생성부를 더 포함하는 것을 특징으로 하는공기조화기."}
{"patent_id": "10-2016-0173749", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 기류 제어부는, 상기 구분된 생활 영역에 기초하여 제어 신호를 생성하는 것을 특징으로 하는 공기조화기."}
{"patent_id": "10-2016-0173749", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 영역 인식 모듈은, 상기 복수의 영역을 생활 영역과 미생활 영역으로 구분하거나, 상기 복수의 영역을 상주 생활 영역, 이동 생활영역, 미생활 영역으로 구분하는 것을 특징으로 하는 공기조화기."}
{"patent_id": "10-2016-0173749", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2018-0071031-3-제1항에 있어서,상기 기류 제어부는, 상기 구분된 생활 영역에 기초하여 팬 모터 및 풍향 조절 수단을 제어하는 것을 특징으로하는 공기조화기."}
{"patent_id": "10-2016-0173749", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 영역 인식 모듈은, 머신러닝으로 기학습된 인공신경망(Artificial Neural Network)을 포함하고,상기 재실자의 위치 인식 결과를 누적하여 상기 복수의 영역별 히스토그램을 생성하며, 상기 생성된 히스토그램을 상기 인공신경망의 입력데이터로 사용하여 상기 생활 영역을 구분하는 것을 특징으로 하는 공기조화기."}
{"patent_id": "10-2016-0173749", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,소정 서버로부터 머신 러닝과 관련된 데이터를 수신하는 통신부;를 더 포함하고, 상기 소정 서버로부터 수신된머신 러닝과 관련된 데이터에 기초하여 상기 영역 인식 모듈을 업데이트(update)하는 것을 특징으로 하는 공기조화기."}
{"patent_id": "10-2016-0173749", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "카메라를 통하여, 외부의 영상을 획득하는 단계;상기 카메라가 획득하는 영상에서 복수의 영역으로 구분되는 실내 공간 내에 재실자가 위치하는 영역을 인식하는 단계;상기 재실자의 위치 인식 결과를 머신 러닝(machine learning)으로 기학습된 데이터의 입력으로 사용하여 상기복수의 영역에 대하여 생활 영역을 구분하는 단계; 및,상기 구분된 생활 영역에 기초하여 기류를 제어하는 단계;를 포함하는 공기조화기의 제어방법."}
{"patent_id": "10-2016-0173749", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 재실자의 위치 인식 결과를 누적하는 단계;를 더 포함하고, 상기 생활 영역 구분 단계는, 상기 누적된 위치 인식 결과에 기초하여 상기 복수의 영역에 대하여 생활 영역을구분하는 것을 특징으로 하는 공기조화기의 제어방법."}
{"patent_id": "10-2016-0173749", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항에 있어서,상기 기류 제어 단계는, 상기 구분된 생활 영역에 기초하여 팬 모터 및 풍향 조절 수단을 제어하는 것을 특징으로 하는 공기조화기의 제어방법."}
{"patent_id": "10-2016-0173749", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제10항에 있어서,상기 생활 영역 구분 단계는,상기 복수의 영역을 생활 영역과 미생활 영역으로 구분하거나, 상기 복수의 영역을 상주 생활 영역, 이동 생활영역, 미생활 영역으로 구분하는 것을 특징으로 하는 공기조화기의 제어방법."}
{"patent_id": "10-2016-0173749", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "공개특허 10-2018-0071031-4-제10항에 있어서,상기 재실자의 위치 인식 결과를 누적하여 상기 복수의 영역별 히스토그램을 생성하는 단계;를 더 포함하고, 상기 생활 영역 구분 단계는, 상기 생성된 히스토그램을 상기 머신러닝으로 기학습된 인공신경망(ArtificialNeural Network)의 입력데이터로 사용하여 상기 생활 영역을 구분하는 것을 특징으로 하는 공기조화기의 제어방법."}
{"patent_id": "10-2016-0173749", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제10항에 있어서,소정 서버로부터 머신 러닝과 관련된 데이터를 수신하는 단계;상기 소정 서버로부터 수신된 머신 러닝과 관련된 데이터에 기초하여 상기 기학습된 데이터를 업데이트(update)하는 단계;를 더 포함하는 공기조화기의 제어방법."}
{"patent_id": "10-2016-0173749", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 측면에 따른 공기조화기는, 외부의 영상을 획득하는 카메라, 카메라가 획득하는 영상에서, 복수의 영역으로 구분되는 실내 공간 내에 재실자가 위치하는 영역을 인식하고, 재실자의 위치 인식 결과를 머신 러닝 (machine learning)으로 기학습된 데이터의 입력으로 사용하여 복수의 영역에 대하여 생활 영역을 구분하는 영역 인식 모듈. 및 구분된 생활 영역에 기초하여 기류를 제어하는 기류 제어부를 포함함으로써, 실내 공간의 생활 영 역별로 최적화된 기류 제어가 가능하다."}
{"patent_id": "10-2016-0173749", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 공기조화기 및 그 제어방법에 관한 것으로, 재실자의 위치를 판별하여 기류를 제어하는 공기조화기 및 그 제어방법에 관한 것이다."}
{"patent_id": "10-2016-0173749", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "공기조화기는 쾌적한 실내 환경을 조성하기 위해 실내로 냉온의 공기를 토출하여, 실내 온도를 조절하고, 실내 공기를 정화하도록 함으로서 인간에게 보다 쾌적한 실내 환경을 제공하기 위해 설치된다. 일반적으로 공기조화기는 열교환기로 구성되어 실내에 설치되는 실내기와, 압축기 및 열교환기 등으로 구성되어 실내기로 냉매를 공급하는 실외기를 포함한다. 공기조화기는 열교환기로 구성된 실내기와, 압축기 및 열교환기 등으로 구성된 실외기로 분리되어 제어되며, 압 축기 또는 열교환기로 공급되는 전원을 제어함으로써 동작된다. 또한, 공기조화기는 실외기에 적어도 하나의 실 내기가 연결될 수 있으며, 요청되는 운전 상태에 따라, 실내기로 냉매를 공급하여, 냉방 또는 난방모드로 운전 된다. 이러한 공기조화기는, 실내로 토출되는 풍향을 조절할 수 있도록 토출구에 풍향조절수단이 구비되는 데, 리모컨 등에 구비된 풍향 설정 버튼을 조작함에 따라 풍향을 변경할 수 있다. 종래의 공기조화기는, 상기와 같이 수동 조작을 통하여 풍향을 조절하였으나, 사용자가 멀리 떨어져 있거나 이 동이 많은 경우 일일이 풍향을 조절하는 것이 쉽지 않으므로 사용자가 쾌적감을 느끼기 어려운 문제점이 있다. 이러한 풍향제어에는 한계가 있어, 최근에는 실내의 사용자(재실자) 위치에 따라 기류를 제어하는 기술이 개발 되고 있다. 종래 기술 1(공개특허공보 10-2008-0048864호)은 공기조화기 및 이의 기류제어방법에 관한 발명으로, 스테레오 비전 카메라를 이용하여 재실자의 위치를 판단하여 기류 방향을 제어한다. 종래 기술 2(공개특허공보 10-2010-0076559호)는 실내온도를 균일하게 한 후 재실자의 위치를 판별, 기류를 제 어하는 공기조화기 및 동작방법에 관한 발명으로, 카메라를 이용하여 재실자의 위치를 추정하고, 사용자 설정에 따라 직/간접풍 및 방향을 제어한다. 하지만, 종래 기술 1과 종래 기술 2는, 카메라를 이용한 인체감지의 부정확성에 취약하므로 인체감지의 정확성 향상이 매우 중요하다. 또한, 종래 기술 1과 종래 기술 2는, 실내 공간 및 재실자의 생활 패턴, 위치 등에 대한 정보를 추정할 수 없으 므로, 공간 정보 및 온도 정보를 정확히 추적하기 힘들고, 공기조화기 설치 환경에 따른 최적화된 기류 제어가 힘들며, 재실자 개개인이 느끼는 쾌적도에 차이가 발생할 수 있다.따라서, 인체감지를 이용한 기류제어시 설치 환경, 실내 공간을 고려하여, 더욱 효과적으로 기류를 제공할 수 있는 방안이 요구된다. 한편, 최근에는 인공지능과 딥러닝 등 머신 러닝에 관한 관심이 크게 증가하고 있다. 종래의 머신 러닝은 통계학 기반의 분류, 회귀, 군집 모델이 중심이었다. 특히, 분류, 회귀 모델의 지도 학습에 서는 학습 데이터의 특성과 이러한 특성을 기반으로 새로운 데이터를 구별하는 학습 모델을 사람이 사전에 정의 했다. 이와 달리, 딥러닝은 컴퓨터가 스스로 특성을 찾아내고 판별하는 것이다. 딥러닝의 발전을 가속화한 요인 중 하나로 오픈소스로 제공되는 딥러닝 프레임워크를 들 수 있다. 딥러닝 프레 임워크들의 공개에 따라, 효과적인 학습 및 인식을 위해, 딥러닝 알고리즘 외에 학습 과정, 학습 방법, 학습에 사용하는 데이터의 추출 및 선정이 더욱 중요해지고 있다. 또한, 인공지능과 머신 러닝을 다양한 제품, 서비스에 이용하기 위한 연구가 증가하고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 1. 공개특허공보 10-2008-0048864호 (공개일자 2008. 6. 3.) (특허문헌 0002) 2. 공개특허공보 10-2010-0076559호 (공개일자 2010. 7. 6.) 비특허문헌"}
{"patent_id": "10-2016-0173749", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은, 정확도가 향상된 재실자 인식을 통해, 냉방 효율 및 에너지 효율이 향상된 공기조화기 및 그 제어방법을 제공함에 있다. 본 발명의 목적은, 설치 환경 및 실내 공간에 따른 최적화된 기류 제어가 가능한 공기조화기 및 그 제어방법을 제공함에 있다. 본 발명의 목적은, 머신 러닝에 기반하여 실내 공간을 생활 영역별로 구분하고, 효율적으로 기류 제어 기능을 수행할 수 있는 공기조화기 및 그 제어방법을 제공함에 있다."}
{"patent_id": "10-2016-0173749", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 또는 다른 목적을 달성하기 위해 본 발명의 일 측면에 따른 공기조화기는, 외부의 영상을 획득하는 카메라, 카메라가 획득하는 영상에서, 복수의 영역으로 구분되는 실내 공간 내에 재실자가 위치하는 영역을 인 식하고, 재실자의 위치 인식 결과를 머신 러닝(machine learning)으로 기학습된 데이터의 입력으로 사용하여 복 수의 영역에 대하여 생활 영역을 구분하는 영역 인식 모듈. 및 구분된 생활 영역에 기초하여 기류를 제어하는 기류 제어부를 포함함으로써, 실내 공간의 생활 영역별로 최적화된 기류 제어가 가능하다. 상기 또는 다른 목적을 달성하기 위해 본 발명의 일 측면에 따른 공기조화기의 제어방법은, 카메라를 통하여, 외부의 영상을 획득하는 단계, 카메라가 획득하는 영상에서 복수의 영역으로 구분되는 실내 공간 내에 재실자가 위치하는 영역을 인식하는 단계, 재실자의 위치 인식 결과를 머신 러닝(machine learning)으로 기학습된 데이터 의 입력으로 사용하여 복수의 영역에 대하여 생활 영역을 구분하는 단계, 및, 구분된 생활 영역에 기초하여 기 류를 제어하는 단계를 포함할 수 있다."}
{"patent_id": "10-2016-0173749", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예들 중 적어도 하나에 의하면, 정확도가 향상된 재실자 인식을 통해, 냉방 효율 및 에너지 효율 이 향상된 공기조화기 및 그 제어방법을 제공할 수 있다. 본 발명의 실시예들 중 적어도 하나에 의하면, 설치 환경 및 실내 공간에 따른 최적화된 기류 제어가 가능하다. 또한, 본 발명의 실시예들 중 적어도 하나에 의하면, 머신 러닝에 기반하여 실내 공간을 생활 영역별로 구분하 고, 효율적으로 기류 제어 기능을 수행할 수 있다. 한편, 그 외의 다양한 효과는 후술될 본 발명의 실시예에 따른 상세한 설명에서 직접적 또는 암시적으로 개시될 것이다."}
{"patent_id": "10-2016-0173749", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 첨부한 도면을 참조하여 본 발명의 실시예를 상세하게 설명한다. 그러나 본 발명이 이러한 실시예에 한정되는 것은 아니며 다양한 형태로 변형될 수 있음은 물론이다. 도면에서는 본 발명을 명확하고 간략하게 설명하기 위하여 설명과 관계없는 부분의 도시를 생략하였으며, 명세 서 전체를 통하여 동일 또는 극히 유사한 부분에 대해서는 동일한 도면 참조부호를 사용한다. 한편, 이하의 설명에서 사용되는 구성요소에 대한 접미사 \"모듈\" 및 \"부\"는 단순히 본 명세서 작성의 용이함만 이 고려되어 부여되는 것으로서, 그 자체로 특별히 중요한 의미 또는 역할을 부여하는 것은 아니다. 따라서, 상 기 \"모듈\" 및 \"부\"는 서로 혼용되어 사용될 수도 있다. 도 1은 본 발명의 일 실시예에 따른 공기조화기의 간략한 개념도이고, 도 2는 본 발명의 일 실시예에 따른 공기 조화기의 주요 구성들 간의 제어관계를 도시한 블록도이다. 본 실시예에서, 공기조화기는 스탠드형 공기조화기인 것으로 예시된다. 그러나 본 발명은 이에 한정되는 것은 아니며, 스탠드형 공기조화기 외에도 벽걸이형 공기조화기나 천장형 공기조화기 등과 같은 공기조화기 또 한 본 발명의 공기조화기로서 적용될 수 있음은 물론이다. 도 1과 도 2를 참조하면, 본 발명의 일 실시예에 따른 공기조화기는, 외부의 영상을 획득하는 카메라 , 상기 카메라가 획득하는 영상에서 상기 카메라가 획득하는 영상에서, 복수의 영역으로 구분되는 실 내 공간 내에 재실자가 위치하는 영역을 인식하고, 상기 재실자의 위치 인식 결과를 머신 러닝(machine learning)으로 기학습된 데이터의 입력으로 사용하여 상기 복수의 영역에 대하여 생활 영역을 구분하는 영역 인 식 모듈, 및, 상기 구분된 생활 영역에 기초하여 기류를 제어하는 기류 제어부를 포함할 수 있다. 도 1을 참조하면, 공기조화기의 실내기에는 실내공기가 흡입되도록 흡입구(미도시)와 흡입구를 통해 흡입된 공 기가 다시 실내로 토출되도록 토출구가 형성될 수 있다. 또한, 토출구에는, 토출구를 개폐시키고, 토출되는 공기의 풍향을 조절하는 루버(미도시) 및/또는 베 인(미도시) 등 풍향 조절 수단이 배치되고, 기류 제어부의 제어에 따라 모터 등을 구동하여 풍향 조절 수단의 각도 및 방향을 전환할 수 있다. 이에 따라, 토출구를 통해 토출되는 공기의 풍향을 조절할 수 있다. 또한, 루버(미도시) 및/또는 베인(미도시) 등 풍향 조절 수단의 동작을 제어함으로써, 기류의 송풍방향, 송풍범 위 등을 조절할 수 있다. 예를 들어, 베인을 어느 한 방향을 향하도록 고정시켜 어느 한 방향으로의 송풍이 이루어지도록 할 수도 있고, 베인의 방향이 설정된 범위 내에서 계속해서 변화되는 동작(이하 \"스윙동작\"이라 한다)이 실시되도록 함으로써 설정된 범위 내에서 송풍방향을 계속해서 변화시키는 형태로 설정된 범위에 대한 송풍이 이루어지도록 할 수도 있다. 또한, 베인의 스윙동작이 이루어지는 각도 범위를 조절함으로써 송풍이 이루어지는 범위를 좀 더 좁히거 나 넓힐 수도 있다. 한편, 공기조화기 내부에는 흡입구로 흡입된 실내의 공기가 토출구를 통해 실내 공간으로 배출되는 흐름을 제어하기 위한 팬이 설치되어 있는데, 상기 팬은 팬 모터에 의해 회전이 조절되고, 상기 팬 모터의 작동은 기류 제어부에 의해 제어된다. 따라서, 기류 제어부는 루버, 베인 등 풍향 조절 수단 및 상기 팬 모터를 제어하여 공기조화기로부터 토출 되는 공기의 흐름(기류)의 방향을 제어할 수 있다. 기류 제어부는 팬 모터의 속도를 제어하여 기류의 양과 속도를 제어하고, 루버, 베인 등 풍향 조절 수단을 제어하여 기류의 방향을 제어할 수 있다. 또한, 기류 제어부는 특정 객체가 위치하는 영역을 빨리 냉방할 수 있도록 기류의 방향과 속도를 제어할 수 있다. 특히, 기류 제어부는 구분되는 생활 영역에 따라 냉방 속도를 조절할 수 있다. 예를 들어, 기류 제어부는, 공기조화기가 설치된 실내 공간 내에, 다수의 재실자가 위치하거나 많은 시간 동안 위치하는 생활 영역이 인식되면, 생활 영역에 대해 냉방 강도를 더 높일 수 있도록 기류를 제어할 수 있다. 또한, 기류 제어부는 생활 영역에 대하여 집중 냉방을 수행하도록 제어할 수 있다. 한편, 본 명세서에서는 본 발명에 따른 실시예를 냉방을 위주로 설명하지만 난방의 경우에도 동일 또는 유사하 게 실시될 수 있다. 본 발명의 일 실시예에 따른 공기조화기는, 복수의 영역으로 구분되는 실내 공간 내에서 상기 복수의 영역에 대 하여 머신 러닝(machine learning) 기반의 생활 영역 구분(인식)을 수행할 수 있다. 또한, 본 발명의 일 실시예에 따른 공기조화기는, 머신 러닝(machine learning) 기반의 재실자의 위치 인식을 수행할 수 있다. 여기서, 상기 영역 인식 모듈은, 카메라를 통하여 획득된 영상을 머신 러닝(machine learning)으로 기학습된 인공신경망(Artificial Neural Network)의 입력 데이터로 사용하여 영상 내에 포함되는 재실자 및 재 실자의 위치를 인식할 수 있다. 또한, 상기 영역 인식 모듈은, 카메라를 통하여 획득된 영상을 머신 러닝(machine learning)으로 기 학습된 인공신경망(Artificial Neural Network)의 입력 데이터로 사용하여 실내 공간을 복수의 영역으로 구분하 고 구분된 복수의 영역을 생활 영역과 미생활 영역으로 구분할 수 있다. 머신 러닝 및 딥러닝에 관해서는 도 5 내지 도 7을 참조하여 후술한다. 한편, 상기 영역 인식 모듈은, 재실자의 위치 인식 결과에 기초하여 상기 복수의 영역을 생활 영역과 미생 활 영역으로 구분할 수 있다. 상기 영역 인식 모듈은, 카메라가 감지하는 대상 실내 공간 내에서 재실자가 감지되는 위치에 대한 정보를 이용하여, 실내 공간을 사람이 생활하는 구분영역과 그렇지 않은 구분영역으로 구분할 수 있다. 또는, 상기 영역 인식 모듈은, 생활 영역을 더 세분화하여, 상기 복수의 영역을 상주 생활 영역, 이동 생 활 영역, 미생활 영역으로 구분할 수 있다. 상기 영역 인식 모듈은, 실내 공간 내에서 사람이 감지되는 빈도에 대한 정보를 이용하여, 사람이 생활하 는 구분영역 중에서도 사람이 주로 생활하는 구분영역과 사람이 잠시 지나다니는 구분영역으로 대상공간을 세분 화하여 구분할 수도 있다.또한, 상기 영역 인식 모듈은, 상기 재실자의 위치 인식 결과를 누적하며, 상기 누적된 위치 인식 결과에 기초하여 상기 복수의 영역에 대하여 생활 영역을 구분할 수 있다. 한편, 기류 제어부는 상기 영역 인식 모듈의 영역 구분 결과에 따라 기류를 제어할 수 있다. 예를 들 어, 기류 제어부는 인식된 재실자의 위치에 기초하여 복수의 영역 중 생활 영역과 미생활 영역을 구분하고, 생활 영역에 대응하는 영역을 빨리 냉방할 수 있도록 기류의 방향과 세기를 제어할 수 있다. 즉, 영역 인식 모듈은 머신 러닝에 기반하여 재실자의 위치 및 실내 공간의 특성을 인식하고, 기류 제어부 는 인식 결과에 따라 팬 모터 및 풍향 조절 수단을 제어하여 최적화된 기류제어를 수행할 수 있다. 또한, 기류 제어부는 상기 기류제어를 반복하여 수행하도록 제어할 수 있다. 한편, 영역 인식 모듈은 상기 카메라가 획득하는 영상에서 재실자의 존재 여부 및 위치를 인식하는 인체 인식기와 상기 카메라가 획득하는 영상에서 상기 재실자의 위치 인식 결과에 기초하여 상기 복 수의 영역에 대하여 생활 영역을 구분하는 영역 인식기를 포함할 수 있다. 여기서, 상기 인체 인식기 및/또는 영역 인식기는 머신 러닝(machine learning)으로 기학습된 데이터 에 기초하여 인식 과정을 수행할 수 있다. 즉, 인체 인식기는 재실자의 존재 여부 및 위치를 인식하고, 영역 인식기는 상기 재실자의 위치 인식 결과에 기초하여 상기 복수의 영역에 대하여 생활 영역을 구분함으로써, 실내 공간 내의 생활 영역을 구분할 수 있다. 또한, 기류 제어부는 상기 구분된 생활 영역에 기초하여 팬 모터의 구동 속도 및 루버, 베인 각도 등 풍향 조절 수단을 제어할 수 있다. 한편, 실시예에 따라서는, 상기 영역 인식 모듈은, 상기 구분된 생활 영역에 기초하여 제어 신호를 생성하 는 신호 생성부를 더 포함할 수 있고, 기류 제어부는 상기 신호 생성부에서 생성된 제어 신호에 따라 팬 모터 및 풍향 조절 수단을 제어할 수 있다. 실시예에 따라서는, 상기 영역 인식 모듈은 상기 기류 제어부와 별도로 구비되지 않고, 상기 기류 제 어부의 일부 볼록으로 구성될 수 있다. 도 3은 본 발명의 일 실시예에 따른 공기조화기의 주요 구성들 간의 제어관계를 도시한 블록도로, 제어부 내에 기류 제어부, 영역 인식 모듈이 구비되는 예를 도시한 것이다. 이 경우에도, 영역 인식 모듈은, 상기 카메라가 획득하는 영상에서 재실자의 존재 여부 및 위치를 인 식하는 인체 인식기와 상기 카메라가 획득하는 영상에서 상기 재실자의 위치 인식 결과에 기초하여 상기 복수의 영역에 대하여 생활 영역을 구분하는 영역 인식기를 포함할 수 있다. 또한, 영역 인식 모듈은 상기 구분된 생활 영역에 기초하여 제어 신호를 생성하는 신호 생성부를 더 포함 할 수 있다. 한편, 상기 영역 인식 모듈(150, 145)은, 상기 카메라가 획득하는 영상에서 머신 러닝(machine learning)으로 기학습된 데이터에 기초하여 재실자의 위치 및 생활 영역을 인식할 수 있다. 또한, 상기 기류 제어부는, 상기 인식된 생활 영역에 기초하여 제어 신호를 생성할 수 있고, 상기 구분된 생활 영역에 기초하여 팬 모터 및 풍향 조절 수단을 제어할 수 있다. 또는, 상기 영역 인식 모듈(150, 145)은, 상기 카메라가 획득하는 영상에서 머신 러닝(machine learnin g)으로 기학습된 데이터에 기초하여 재실자의 위치 및 생활 영역을 인식하고, 상기 인식된 생활 영역에 기초하 여 제어 신호를 생성할 수 있다. 상기 기류 제어부는, 생성된 제어 신호에 따라 팬 모터 및 풍향 조절 수 단을 제어할 수 있다. 한편, 상기 영역 인식 모듈(150, 145)은, 머신러닝으로 기학습된 인공신경망(Artificial Neural Network)을 포 함하고, 상기 재실자의 위치 인식 결과를 누적하여 상기 복수의 영역별 히스토그램을 생성하며, 상기 생성된 히 스토그램을 상기 인공신경망의 입력데이터로 사용하여 상기 생활 영역을 구분할 수 있다. 공기조화기를 가동시킬 때 루버, 베인 등의 각도 범위, 설치 위치 및 재실자 환경에 따라서 냉방 기류 손실이 발생할 수 있다. 본 발명은 공기조화기의 냉방효율 및 사용자 쾌적성을 증대를 위한 사용자 실생활 영역 인식에 관한 것으로, 미 리 학습된 인체 인식기 및 영역 인식기를 이용하여 재실자가 존재하는 영역을 카메라를 이용하여 인식하는 방법에 관한 것이다. 인체 감지 결과에 따라 일회성으로 풍량과 풍향을 제어하는 방식으로 공간을 파악하는 기능은 없는 종래 기술들 과는 달리, 본 발명에 따른 공기조화기는, 카메라가 획득한 영상정보를 이용하여 인체감지를 수행한 후 인체감 지 정보를 이용하여 생활(상주/이동)영역과 미생활 영역을 구분할 수 있다. 또한, 본 발명에 따른 공기조화기는 구분된 생활 영역에 대해 효율적으로 냉방을 수행할 수 있도록 기류를 제어 함으로써, 냉방 효율 및 에너지 효율을 향상시킬 수 있다. 즉, 본 발명에 따른 공기조화기는 추가 장치 및 전문가의 조작 없이 설치 및 동작 수행만으로 생활영역 인지를 수행하고, 쾌적제어와 연동할 수 있다. 본 발명에 따르면, 카메라를 통해 일정 주기로 입력되는 영상을 학습된 인체인식기를 이용하여 재실자 위치, 각 도를 탐색하고, 재실자 위치 정보를 누적하여 학습된 머신러닝 알고리즘을 이용하여 생활영역 분류를 수행하여, 실제 사용자가 주로 거주하는 영역을 추정할 수 있다. 또한, 생활영역 추정 결과를 이용하여 실제 사용자가 주로 거주하는 공간에 한정하여 기류를 제어하여, 벽면 등 의 불필요한 영역에 기류를 제한하고, 사용자 맞춤 운전이 가능하여, 냉방효율을 증대와 함께, 사용자에게 편의 성 및 쾌적감 제공이 기능하다. 또한, 본 발명에 따른 공기조화기는, 지속적인 업데이트를 통해 변경된 생활영역에 적응하여 최적의 기류 제어 가 가능하다. 한편, 도 2와 도 3을 참조하면, 본 발명의 일 실시예에 따른 공기조화기는 메모리(미도시), 통신부 등을 포함할 수 있다. 상기 메모리에는 공기조화기의 동작제어를 위한 데이터와, 통신부를 통해 수신되는 데이터가 저장될 수 있다. 한편, 공기조화기는 데이터를 임시 저장하는 버퍼를 포함할 수 있고, 상기 버퍼는 제어부 또는 메모리에 포함될 수 있다. 제어부 및/또는 기류 제어부는 통신부를 통해 수신된 각종 데이터를 처리하여 메모리를 갱신할 수 있다. 예를 들어, 통신부를 통해 입력된 데이터가 메모리에 기저장된 운전 프로그램에 대한 업데이트 데이터인 경우에는 이를 이용하여 메모리에 업데이트시키고, 입력된 데이터가 신규한 운전 프로그램인 경우에는 메모리에 이를 추가로 저장시킬 수 있다. 제어부는 공기조화기로 입력되거나 출력되는 데이터의 흐름을 제어하고, 제어명령을 생성하여 인가할 수 있다. 통신부는 하나 이상의 통신 모듈을 구비하여 외부의 기기와 통신 연결될 수 있다. 또한, 상기 통신부는, 소정 서버로부터 머신 러닝과 관련된 데이터를 수신할 수 있고, 상기 영역 인식 모 듈(150, 145)은, 상기 소정 서버로부터 수신된 머신 러닝과 관련된 데이터에 기초하여 업데이트(update)될 수 있다. 도 4는 본 발명의 일 실시예에 따른 공기조화기의 제어 방법을 도시한 순서도이다. 도 4를 참조하면, 먼저, 카메라를 통하여, 외부의 영상을 획득할 수 있다(S410). 영역 인식 모듈(150, 145)은, 상기 카메라가 획득하는 영상에서 재실자의 존재 여부 및 재실자의 위치를 인식할 수 있다(S420). 예를 들어, 영역 인식 모듈(150, 145)은 머신 러닝(machine learning)으로 기학습된 데 이터에 기초하여 재실자의 위치를 인식할 수 있다(S420). 상기 영역 인식 모듈(150, 145)은 상기 재실자의 위치 인식 결과를 머신 러닝(machine learning)으로 기학습된 데이터의 입력으로 사용하여 상기 복수의 영역에 대하여 생활 영역을 구분할 수 있다(S430). 기류 제어부는, 상기 구분된 생활 영역에 기초하여 기류를 제어할 수 있다(S450). 예를 들어, 복수의 영역 으로 구분되는 실내 공간 중 사용자가 실제 생활하는 생활 영역으로 구분된 영역을 급속냉방하거나 집중냉방하기 위해 상기 기류 제어부는, 팬 모터 및 풍향 조절 수단을 제어할 수 있다. 한편, 상기 영역 인식 모듈(150, 145)의 신호 생성부 또는 기류 제어부는 상기 생활 영역 인식 결과 에 기초한 제어 신호를 생성할 수 있다(S440). 실시예에 따라서는, 공기조화기는, 소정 서버로부터 머신 러닝과 관련된 데이터를 수신하면, 상기 소정 서버로 부터 수신된 머신 러닝과 관련된 데이터에 기초하여 상기 기학습된 데이터를 업데이트(update)할 수 있다. 도 5 내지 도 7은 딥러닝(Deep Learning)에 대한 설명에 참조되는 도면이다. 머신 러닝(Machine Learning)의 일종인 딥러닝(Deep Learning) 기술은 데이터를 기반으로 다단계로 깊은 수준까 지 내려가 학습하는 것이다. 딥러닝(Deep learning)은 단계를 높여갈수록 복수의 데이터들로부터 핵심적인 데이터를 추출하는 머신 러닝 (Machine Learning) 알고리즘의 집합을 나타낼 수 있다. 딥러닝 구조는 인공신경망(ANN)를 포함할 수 있으며, 예를 들어 딥러닝 구조는 CNN(Convolutional Neural Network), RNN(Recurrent Neural Network), DBN(Deep Belief Network) 등 심층신경망(DNN)으로 구성될 수 있다 도 5를 참조하면, 인공신경망(ANN)은 입력 레이어(Input Layer), 히든 레이어(Hiddent Layer), 및 출력 레이어 (Output Layer)를 포함할 수 있다. 각 레이어는 복수의 노드들을 포함하고, 각 레이어는 다음 레이어와 연결된 다. 인접한 레이어 사이의 노드들은 웨이트(weight)를 가지고 서로 연결될 수 있다. 도 6을 참조하면, 컴퓨터(머신)는 투입된 입력 데이터로부터 일정한 패턴을 발견해 특징맵(Feature Map)을 형성한다. 컴퓨터(머신)는 하위레벨 특징부터, 중간레벨 특징, 상위레벨 특징까지 추출하여, 대 상을 인식하고 그 결과를 출력할 수 있다. 인공신경망은 다음 순서의 레이어로 갈수록 더욱 상위레벨의 특징으로 추상화할 수 있다. 도 5와 도 6을 참조하면, 각 노드들은 활성화 모델에 기초하여 동작할 수 있고, 활성화 모델에 따라 입력값에 대응하는 출력값이 결정될 수 있다. 임의의 노드, 예를 들어, 하위레벨 특징의 출력값은 해당 노드와 연결된 다음 레이어, 예를 들어, 중간레 벨 특징의 노드로 입력될 수 있다. 다음 레이어의 노드, 예를 들어, 중간레벨 특징의 노드는 하위레 벨 특징의 복수의 노드로부터 출력되는 값들을 입력받을 수 있다. 이 때, 각 노드의 입력값은 이전 레이어의 노드의 출력값에 웨이트(weight)가 적용된 값일 수 있다. 웨이트 (weight)는 노드간의 연결 강도를 의미할 수 있다. 또한, 딥러닝 과정은 적절한 웨이트(weight)를 찾아내는 과정으로도 볼 수 있다. 한편, 임의의 노드, 예를 들어, 중간레벨 특징의 출력값은 해당 노드와 연결된 다음 레이어, 예를 들어, 상위레벨 특징의 노드로 입력될 수 있다. 다음 레이어의 노드, 예를 들어, 상위레벨 특징의 노드는 중간레벨 특징의 복수의 노드로부터 출력되는 값들을 입력받을 수 있다. 인공신경망은 각 레벨에 대응하는 학습된 레이어(layer)를 이용하여, 각 레벨에 대응하는 특징 정보를 추출할 수 있다. 인공신경망은 순차적으로 추상화하여, 가장 상위 레벨의 특징 정보를 활용하여 소정 대상을 인식할 수 있다. 예를 들어, 딥러닝에 의한 얼굴인식 과정을 살펴보면, 컴퓨터는 입력 영상으로부터, 픽셀의 밝기에 따라 밝은 픽셀과 어두운 픽셀을 구분하고, 테두리, 에지 등 단순한 형태를 구분한 후, 조금 더 복잡한 형태와 사물을 구 분할 수 있다. 최종적으로 컴퓨터는 인간의 얼굴을 규정하는 형태를 파악할 수 있다. 본 발명에 따른 딥러닝 구조는 공지된 다양한 구조를 이용할 수 있다. 예를 들어, 본 발명에 따른 딥러닝 구조 는 CNN(Convolutional Neural Network), RNN(Recurrent Neural Network), DBN(Deep Belief Network) 등일 수 있다. RNN(Recurrent Neural Network)은, 자연어 처리 등에 많이 이용되고 있으며, 시간의 흐름에 따라 변하는 시계열 데이터(Time-series data) 처리에 효과적인 구조로 매 순간마다 레이어를 쌓아올려 인공신경망 구조를 구성할 수 있다. DBN(Deep Belief Network)은 딥러닝 기법인 RBM(Restricted Boltzman Machine)을 다층으로 쌓아 구성되는 딥러 닝 구조이다. RBM(Restricted Boltzman Machine) 학습을 반복하여, 일정 수의 레이어가 되면 해당 개수의 레이 어를 가지는 DBN(Deep Belief Network)를 구성할 수 있다. CNN(Convolutional Neural Network)은, 특히 객체 인식 분야에서 많이 사용되는 구조로써, 도 7을 참조하여 설 명한다. CNN(Convolutional Neural Network)은 사람이 물체를 인식할 때 물체의 기본적인 특징들을 추출한 다음 뇌 속에 서 복잡한 계산을 거쳐 그 결과를 기반으로 물체를 인식한다는 가정을 기반으로 만들어진 사람의 뇌 기능을 모 사한 모델이다. 도 7은 CNN(Convolutional Neural Network) 구조를 도시한 도면이다. CNN(Convolutional Neural Network)도 입력 레이어(Input Layer), 히든 레이어(Hiddent Layer), 및 출력 레이 어(Output Layer)를 포함할 수 있다. 입력 레이어(Input Layer)에는 소정 이미지가 입력된다. 도 7을 참조하면, 히든 레이어(Hiddent Layer)는 복수의 레이어로 구성되고, 컨볼루션 레이어(convolution layer)와 서브-샘플링 레이어(sub-sampling layer)를 포함할 수 있다. CNN(Convolutional Neural Network)에서는 기본적으로 컨볼루션(convolution) 연산을 통해 영상의 특징을 추출 하기 위한 다양한 필터와 비선형적인 특성을 더하기 위한 풀링(pooling) 또는 비선형 활성화(non-linear activation) 함수 등이 함께 사용된다. 컨볼루션(convolution)은 영상 처리 분야에서 주로 필터 연산에 사용되며 영상으로부터 특징(feature)을 추출하 기 위한 필터를 구현하는데 사용된다. 예를 들어, 소정 크기의 윈도우를 이동하면서 영상 전체에 대해서 컨볼루션 연산을 반복적으로 수행하게 되면 윈도우의 가중치(weight) 값에 따라 적정한 결과를 얻을 수 있다. 컨볼루션 레이어(convolution layer)는 컨볼루션 필터를 이용하여 입력된 영상 데이터(710, 712)에 컨볼루션 연 산을 수행하고, 입력 이미지의 특징이 표현된 특징맵(711, 713)을 생성한다. 컨볼루션 필터링의 결과로서, 컨볼루션 레이어(convolution layer)에 포함된 필터의 개수에 따라 필터 개수만큼 의 필터링 영상들이 생성될 수 있다. 컨볼루션 레이어는 필터링 영상들에 포함된 노드들로 구성될 수 있다. 또한, 컨볼루션 레이어(convolution layer)와 쌍을 이루는 서브-샘플링 레이어(sub-sampling layer)는 쌍을 이 루는 컨볼루션 레이어(convolution layer)와 동일한 수의 특징맵들을 포함할 수 있다. 서브-샘플링 레이어(sub-sampling layer)는 샘플링 또는 풀링(pooling)을 통해 특징맵(711, 713)의 차원을 감 소시킨다. 출력 레이어(Output Layer)는 특징맵에 표현된 다양한 특징을 조합하여 입력 이미지를 인식한다. 본 발명에 따른 공기조화기의 영역 인식 모듈은 상술한 다양한 딥러닝 구조를 이용할 수 있다. 예를 들어, 본 발명이 한정되는 것은 아니나, 영상 내 객체 인식에서 많이 사용되고 있는 CNN(Convolutional Neural Network) 구조를 이용할 수 있다. 한편, 인공신경망의 학습은 주어진 입력에 대하여 원하는 출력이 나오도록 노드간 연결선의 웨이트(weight)를 조정함으로써 이루어질 수 있다. 또한, 인공신경망은 학습에 의해 웨이트(weight) 값을 지속적으로 업데이트시 킬 수 있다. 또한, 인공신경망의 학습에는 역전파(Back Propagation) 등의 방법이 사용될 수 있다. 본 발명의 일 실시예에 따른 영역 인식 모듈은, 카메라를 통하여 획득된 영상을 머신 러닝(machine learning)으로 기학습된 인공신경망(Artificial Neural Network)의 입력 데이터로 사용하여 실내 공간을 복수의 영역으로 구분하고 구분된 복수의 영역을 생활 영역과 미생활 영역으로 구분할 수 있다. 또는, 상기 영역 인식 모듈은, 생활 영역을 더 세분화하여, 상기 복수의 영역을 상주 생활 영역, 이동 생 활 영역, 미생활 영역으로 구분할 수 있다. 또한, 상기 영역 인식 모듈은, 상기 재실자의 위치 인식 결과를 누적하며, 상기 누적된 위치 인식 결과에 기초하여 상기 복수의 영역에 대하여 생활 영역을 구분할 수 있다.도 8은 본 발명의 일 실시예에 따른 생활 영역 인식 과정을 도시한 순서도이다. 도 8은 영역 인식 모듈(150, 145)이 실내 공간 중 생활 영역을 인식, 구분하는 과정을 도시한 도면으로, 더욱 상세하게는 본 발명의 일 실시 예에 따른 영역 인식기가 생활 영역을 구분하는 일예를 상세히 도시한 것이다. 도 8을 참조하면, 영역 인식기는, 인체인식기로부터 재실자의 위치 인식 결과를 포함하는 인체감지 데이터를 입력받고(S810), 입력받은 인체감지 데이터를 누적할 수 있다(S820). 영역 인식기는 인체감지 데이터를 누적하명서 카운팅(counting)하다가(S830), 일정수(M) 이상의 데이터가 누적되었다면, 히스토그램을 생성할 수 있다(S840). 한편, 영역 인식기는 상기 생성한 히스토그램을 입력데이터로 사용하여 머신러닝 기반으로 생활 영역과 미 생활 영역을 구분할 수 있다(S850). 상기 머신러닝은 SVM(Support Vector Machine), Adaboost와 같은 기법을 이용할 수 있고, 더욱 바람직하게는 딥러닝(Deep Learning) 기법을 이용할 수 있다. 영역 인식기는, 머신러닝으로 기학습된 인공신경망(Artificial Neural Network)을 포함하고, 복수의 영역 별 히스토그램을 생성하며, 상기 생성된 히스토그램을 상기 인공신경망의 입력데이터로 사용하여 생활 영역과 미생활 영역을 구분할 수 있다. 또한, 영역 인식기는, 상기 생활 영역을 더 세분화하여 상주 생활 영역과 이동 생활 영역을 구분할 수 있다. 한편, 실시예에 따라서는, 생활 영역 구분의 정확도를 더욱 높이기 위하여, 상기 생활 영역 구분(S850)을 반복 수행하면서(S860), 복수의 구분 결과를 취합하여 취합된 결과에 기초하여 최종적으로 실내 공간의 복수의 영역 을 생활 영역과 미생활 영역 등으로 분류할 수 있다(S870). 즉, 생활 영역 구분 결과가 일정 수 이상 누적되었을 때, 최종 결과를 도출함으로써, 생활영역 인식 결과의 신 뢰성을 확보하고, 인체감지 오류로 인해 발생한 미생활 영역의 일시적인 오류를 제거할 수 있다. 도 9는 본 발명의 일 실시예에 따른 영역 인식 모듈에 관한 설명에 참조되는 도면으로, 더욱 상세하게는 영역 인식기에 관한 설명에 참조되는 도면이다. 도 9를 참조하면, 인체감지 데이터 히스토그램을 수집하여 생활 영역/미생활 영역 데이터베이스(DB)를 구축하고, 특징을 추출한 후 영역 인식기의 인공 신경망 학습을 통해 신경망의 파라미터(parameter)들(가중치 (weight)와 편향(bias))을 추정하여 모델을 구할 수 있다(점선 흐름). 이러한 학습은 공기조화기가 설치되어 동작되면 소정 시간동안 자체적으로 이루어질 수 있다. 또한, 설정 된 수준 이상으로 학습된 이후에도 매번 인식 결과가 도출될 때마다 기존의 합습된 모델 파라미터에 반영하여 업데이트될 수 있다. 또는, 카메가가 촬영하는 영상들 중 적어도 일부를 소정 서버로 전송하고, 소정 서버를 통해 학습이 수행된 데 이터를 수신하여 인공 신경망을 업데이트할 수도 있다. 이후, 학습된 모델 파라미터를 이용하여 카메라가 획득하여 새로 입력되는 영상에 기초하여 생활 영역/미 생활 영역을 인식할 수 있다(실선 흐름). 도 10 내지 도 12는 본 발명의 일 실시예에 따른 공기조화기의 제어 방법에 관한 설명에 참조되는 도면으로, 도 10 내지 도 12를 참조하여 본 발명의 일 실시예에 따른 사용자 실 생활 영역 판단 알고리즘을 설명한다. 도 10을 참조하면 본 발명의 일 실시예에 따른 공기조화기는 카메라를 통하여 실내 공간을 촬영하여 영상 을 획득하고, 획득한 영상에서 재실자(1010, 1020)의 존재 여부 및 위치를 인식할 수 있다. 이 때, 인식된 재실자(1010, 1020)의 위치 정보는 각도 정보(ang1, ang2)를 포함할 수 있다. 또한, 실시예에 따라서는, 인식된 재실자(1010, 1020)의 위치 정보는 거리 정보(근, 중, 원)를 더 포함할 수 있다. 도 11은 카메라가 획득한 영상과 카메라가 획득한 영상으로부터 인식된 재실자의 위치(1011, 1012)를 반영하여 히스토그램을 생성하는 예를 도시한 것이다. 도 11에 예시된 히스토그램은 카메라가 획득하는 영상을 좌측에서 우측 방향으로 배열되는 복수의 영역에 대응하여 생성된 것이다. 예를 들어, 히스토그램은 전체 영역에 대응하는 0도 내지 105도의 각도를 소정 단위 각도로 나누고, 나누어진 각도별 재실자 감지 빈도를 누적하여 생성될 수 있다.또한, 거리 정보를 추가적으로 활용하는 경우, 거리 및 각도 별 감지 빈도를 복수의 행과 열을 가지는 매트릭스 (matrix) 타입으로 히스토그램을 생성할 수 있다. 히스토그램은 복수의 영역에 대응하는 복수의 셀(1121, 1122, 1123, 1124, 1125, 1126, 1127)을 포함하 고, 각 셀(1121, 1122, 1123, 1124, 1125, 1126, 1127)에는 대응하는 영역에 재실자가 인식된 경우에 인식 결 과가 합산되어 누적될 수 있다. 도 11은 카메라가 획득한 영상에서 인식된 재실자의 위치(1011, 1012)를 반영하여 두 셀(1123, 1126)의 값을 1씩 증가시키는 예를 도시한 것이다. 도 11과 같이 재실자 인식 결과를 누적하여 히스토그램을 생성하고, 재실자 인식 결과가 기준 횟수 이상 이 되었을 때 생활 영역 구분을 수행할 수 있다. 즉, 본 발명은 일정 시간 또는 일정 개수의 재실자 인식 결과 를 누적하여 영역 판단을 수행할 수 있다. 실시예에 따라서는, 1회의 인식 결과를 동등한 수준으로 반영하지 않고, 특정 인식 결과에 가중치를 반영할 수 있다. 예를 들어, 연속적으로 동일 위치에 재실자가 인식되거나 소정 기간 내에 인식 빈도가 높은 위치에 높은 가중치를 부여할 수 있다.한편, 정확도 향상을 위해 생활 영역 구분 결과가 일정 수 이상 누적되었을 때, 딥러 닝(Deep Learning) 기반 알고리즘으로 분석하여 생활(상주/이동) 영역과 미생활 영역을 최종적으로 구분할 수 있다. 딥러닝 알고리즘 적용함으로써 강인성 및 신뢰성을 획득할 수 있다. 이후, 도 12와 같이, 공기조화기는 구분된 생활 영역에 기초하여, 기류 제어를 수행할 수 있다. 예를 들어, 공기조화기는 상주 생활 영역, 이동 생활 영역, 미생활 영역, 영역별로 풍량을 다르게 기류를 제어 할 수 있다. 또한, 상주 생활 영역을 우선 냉방하도록 기류를 제어할 수 있다. 본 발명에 따른 공기조화기는 거주 환경, 공간별 맞춤형 기류 제어를 스스로 수행할 수 있다. 환경에 맞게 스스 로 알아서 동작하고, 생활 영역만 집중냉방함으로써, 기류 로스(loss) 제거로 에너지 소비를 절감하고, 실거주 공간에 대한 냉방 효율을 높일 수 있다. 또한, 본 발명에 따른 공기조화기는 딥러닝으로 기학습된 인공신경망을 이용하여 생활 영역을 구분함으로써, 생 활 영역 구분의 신뢰성을 높일 수 있다. 또한, 인공신경망을 소정 서버로부터 수신되는 데이터에 기초하여 업데이트함으로써, 제조사 또는 서비스 제공 자가 제공하는 더 높은 수준으로 학습된 최신 인공신경망을 이용할 수 있다. 도 13은 본 발명의 일 실시예에 따른 서버의 내부 블록도이다. 도 13을 참조하면, 서버는, 통신부, 저장부, 학습모듈, 및 프로세서를 구비할 수 있다. 프로세서는, 서버의 전반적인 동작을 제어할 수 있다. 한편, 서버는, 공기조화기 등 홈 어플라이언스 제조사가 운영하는 서버 또는 서비스 제공자가 운영하는 서버일 수 있고, 일종의 클라우드(Cloud) 서버일 수 있다. 통신부는, 휴대 단말기, 공기조화기 등 홈 어플라이언스, 게이트웨이 등으로부터 상태 정보, 동작 정보, 조작 정보 등 각종 데이터를 수신할 수 있다. 그리고 통신부는 수신되는 각종 정보에 대응하는 데이터를 휴대 단말기, 공기조화기 등 홈 어플라이언스, 게이트웨이 등으로 송신할 수 있다. 이를 위해, 통신부는 인터넷 모듈, 이동 통신 모듈 등 하나 이상의 통신 모듈을 구비할 수 있다. 저장부는, 수신되는 정보를 저장하고, 이에 대응하는 결과 정보 생성을 위한 데이터를 구비할 수 있다. 또한, 저장부는, 머신 러닝에 사용되는 데이터, 결과 데이터 등을 저장할 수 있다. 학습모듈은 상기 공기조화기 등 홈 어플라이언스의 학습기 역할을 수행할 수 있다. 상기 학습모듈에는 인공신경망, 예를 들어, CNN(Convolutional Neural Network), RNN(Recurrent Neural Network), DBN(Deep Belief Network) 등 심층신경망(Deep Neural Network: DNN)을 포함될 수 있고, 심층신경망 을 학습할 수 있다.상기 학습모듈의 학습 방법으로는 자율학습(unsupervised learning)과 지도학습(supervised learning)이 모두 사용될 수 있다. 한편, 상기 제어부는 설정에 따라 학습 후 상기 공기조화기 등 홈 어플라이언스의 인공신경망 구조를 학 습된 인공신경망 구조로 업데이트시키도록 제어할 수 있다. 도 14 내지 도 19는 본 발명의 실시예에 따른 공기조화기의 제어 방법에 관한 설명에 참조되는 도면으로, 스윙 동작을 위주로 구분된 영역에 대하여 기류를 제어하는 예들을 도시한 것이다. 도 14를 참조하면, 대상 실내 공간은 공기조화기를 중심점으로 하는 평면방향의 범위각에 의해 구분되는 위치를 X축으로 하고 공기조화기를 기준으로 하는 평면방향의 직선거리에 의해 구분되는 위치를 Y축으로 하는 좌표를 기준으로 복수 개의 영역으로 분할된 형태일 수 있다. 또는, 대상 실내 공간은 공기조화기를 중심점으로 하는 평면방향의 범위각에 의해서 복수 개의 영역으로 분할된 형태일 수 있다. 예를 들어, 대상 실내 공간은 5도 단위로 복수의 영역으로 구분될 수 있다. 본 발명의 일 실시예에 따른 공기조화기는 대상 실내 공간의 복수의 영역을 재실자가 인식되는 빈도, 즉 단위시간당 사람이 감지되는 횟수 또는 사람이 감지되는 시간에 따라 생활영역(A, B)과 미생활영역(C)으로 구분 할 수 있다. 예를 들어, 영역 인식 모듈(도 1의 150)은, 복수의 영역 중 재실자가 한 번이라도 감지된 분할구간과 사람이 전 혀 감지된 적이 없는 분할구간을 서로 구분하여 분류하고, 사람이 감지된 영역을 생활영역(A, B), 사람이 감지 되지 않은 영역을 미생활영역(C)으로 구분할 수 있다. 이때 생활영역(A, B)과 미생활영역(C)의 구분 기준이 해당 영역에서 재실자가 감지되었는지 여부만이 될 수 있 는 것은 아니며, 사람이 생활하는 영역이라고 인정되기 어려울 정도로 적은 정도의 인체 감지 횟수 또는 시간이 생활영역(A, B)과 미생활영역(C)의 기준이 될 수도 있음은 물론이다. 실시예에 따라서는, 생활영역(A, B)으로 구분된 각 영역을 재실자가 연속적으로 감지되는 횟수 또는 시간에 따 라 상주 생활 영역(A)과 이동 생활 영역(B)으로 구분할 수 있다. 예를 들어, 영역 인식 모듈은, 생활영역(A, B)으로 분류된 각 영역을 사람이 연속적으로 감지되는 횟수 또 는 시간에 따라 상주 생활 영역(A)과 이동 생활 영역(B) 중 어느 하나로 구분하여 분류하고, 이를 통해 생활영 역(A, B)을 다시 상주 생활 영역(A)과 이동 생활 영역(B), 즉 두 개의 세분화된 영역으로 구분할 수 있다. 한편, 공기조화기는 구분된 영역에 따라 기류를 제어할 수 있다. 기류 제어부(도 1의 141)는 공기조화기 에 구비되는 송풍기의 팬 모터를 제어하여 기류의 세기를 제어할 수 있고, 토출구(도 1의 190)에 구 비되는 베인, 루버 등 풍향 조절 수단을 제어하여 기류의 방향과 범위를 제어할 수 있다. 예를 들어, 상주 생활 영역(A)을 향해 집중적으로 기류를 전달하기 위한 집중 냉난방 모드에 따른 제어, 생활 영역(A, B)을 향해 기류를 전달하기 위한 직접 냉난방 모드에 따른 제어, 상주 생활 영역(A)에 대한 직접적인 기류 전달이 이루어지지 않도록 하기 위한 간접 냉난방 모드에 따른 제어 등 다양한 형태로 실시될 수 있다. 도 15를 참조하면, 집중 냉난방 모드에서는, 상주 생활 영역(A)을 향해서만 기류가 전달되도록 기류 방향의 제 어가 이루어질 수 있다. 이와 같은 집중 냉난방 모드에서는, 상주 생활 영역(A)을 제외한 다른 영역, 즉 미생활영역(C)과 이동 생활 영 역(B)에는 기류가 전달되지 않고 상주 생활 영역(A)을 향해서만 기류가 전달되는 송풍이 이루어지므로, 사람이 실제로 상주하는 영역에 대해서만 집중적인 냉방 또는 난방이 실시될 수 있다. 이로써 사람이 실제로 상주하는 상주 생활 영역(A)에 대한 집중적인 냉방 또는 난방을 실시하여 해당 영역의 온 도를 매우 신속하게 낮추거나 높일 수 있게 되므로, 실내의 온도가 매우 높거나 사용자가 귀가한 직후 더위를 심하게 느끼는 경우에도 사용자의 쾌적도를 빠르게 상승시킬 수 있고, 실내의 온도가 매우 낮거나 사용자가 귀 가한 직후 더위를 심하게 느끼는 경우에도 사용자가 느끼는 포근함을 빠르게 상승시킬 수 있게 된다. 또한 집중 냉난방 모드에서는, 미생활영역(C)에는 기류가 전달되지 않고 생활영역(A, B)을 향해서만 기류가 전 달되는 송풍이 이루어지므로, 사람이 실제로 상주하는 영역에 대한 냉방 또는 난방이 집중되게 이루어지도록 하 는 형태의 냉방 또는 난방이 실시될 수 있게 된다. 이로써 불필요한 에너지의 낭비를 줄이면서 신속한 냉방 또는 난방이 필요한 영역의 온도를 빠르게 낮추거나 올 려줄 수 있게 되므로, 에너지 효율을 항상시키면서도 사용자의 만족감을 상승시키는 효과를 제공할 수 있게 된 다. 도 16을 참조하면, 직접 냉난방 모드에서는 생활영역(A, B)을 향해서만 기류가 전달되도록 기류의 제어가 이루 어질 수 있다. 이러한 직접 냉난방 모드에서는, 미생활영역(C)에 대해서만 송풍이 이루어지지 않도록 하면서 상주 생활 영역 (A)과 이동 생활 영역(B)을 포함한 생활영역(A, B) 전체에 대한 송풍이 이루어지도록 한다. 집중 냉난방 모드에 의해 이루어지는 냉방 또는 난방의 경우, 송풍이 상주 생활 영역(A)을 향한 방향, 즉 사람 을 직접 향한 방향으로 집중되는 직접풍 형태로만 이루어지므로, 사람이 이러한 상태에 장기간 노출되면 추위만 을 느끼고 쾌적감은 오히려 낮아지는 결과가 발생될 우려가 있다. 이에 비해 직접 냉난방 모드에서는, 상주 생활 영역(A)과 이동 생활 영역(B)을 포함한 생활영역(A, B) 전체에 대한 송풍이 이루어지도록 하여 사람을 직접 향한 직접풍 형태의 송풍과 사람을 직접 향하지 않은 간접풍 형태 의 송풍이 번갈아가며 이루어지도록 함으로써, 사람이 냉기 또는 온기에 직접 노출되는 빈도를 감소시키면서 사 용자의 쾌적감을 상승시킬 수 있다. 또한 직접 냉난방 모드에서는, 미생활영역(C)에는 기류가 전달되지 않고 생활영역(A, B)을 향해서만 기류가 전 달되는 송풍이 이루어지므로, 사람이 생활하지 않는 영역에 대한 불필요한 냉방 또는 난방이 이루어지지 않도록 하면서 사람이 실제로 생활하는 영역에 대한 냉방 또는 난방이 집중되게 이루어지도록 하는 형태의 냉방 또는 난방이 실시될 수 있게 된다. 이로써 불필요한 에너지의 낭비를 줄이면서 사람이 실제로 생활하는 영역의 온도를 빠르게 낮춰줄 수 있게 되므 로, 에너지 효율을 항상시키면서도 사용자의 만족감을 상승시키는 효과를 제공할 수 있게 된다. 한편 직접 냉난방 모드의 다른 예로서, 기류 제어부는 생활영역(A, B) 전체에 기류가 전달되도록 하되, 상 주 생활 영역(A)에 좀 더 많은 기류가 전달되도록 베인의 스윙동작이 이루어지게 베인의 동작을 제어할 수도 있 다. 이에 따른 기류 제어의 일 예로서, 기류 제어부는, 도 17에 도시된 바와 같이, 상주 생활 영역(A)을 향해 서만 기류가 전달되도록 하는 상주 생활 영역 냉난방동작과 이동 생활 영역(B)을 향해서만 기류가 전달되도록 하는 이동 생활 영역 냉난방동작이 교번되게 실시되도록 기류를 제어할 수 있다. 이때 상주 생활 영역 냉난방동작은 상주 생활 영역(A)을 향해서만 기류가 전달되도록 베인의 스윙동작이 이루어 지게 베인의 동작을 제어함으로써 이루어질 수 있으며, 이동 생활 영역 냉난방동작은 이동 생활 영역(B)을 향해 서만 기류가 전달되도록 베인의 스윙동작이 이루어지게 베인의 동작을 제어함으로써 이루어질 수 있다. 상기와 같이 상주 생활 영역 냉난방동작과 이동 생활 영역 냉난방동작이 교번되게 실시되도록 기류를 제어하되, 상주 생활 영역(A)에 대한 냉방 또는 난방을 좀 더 집중적으로 실시하고자 하는 경우에는 이동 생활 영역 냉난 방동작 대비 상주 생활 영역 냉난방동작의 실시 횟수를 좀 더 증가시킨 형태로 베인의 동작을 제어할 수 있으며, 그 반대의 경우에는 이동 생활 영역 냉난방동작 대비 상주 생활 영역 냉난방동작의 실시 횟수를 좀 더 감소시킨 형태로 베인의 동작을 제어하는 방법으로 냉방 또는 난방 실시 형태를 변화시킬 수 있다. 또한 상기와 같은 기류 제어의 다른 예로서, 기류 제어부는, 도 18에 도시된 바와 같이, 생활영역 전체를 향해 기류가 전달되도록 하는 생활영역 냉난방동작과 상주 생활 영역(A)을 향해서만 기류가 전달되도록 하는 상 주 생활 영역 냉난방동작이 교번되게 실시되도록 기류를 제어한다. 이때 생활영역 냉난방동작은 생활영역(A, B) 전체에 고르게 기류가 전달되도록 베인의 스윙동작이 이루어지게 베인의 동작을 제어함으로써 이루어질 수 있으며, 상주 생활 영역 냉난방동작은 상주 생활 영역(A)을 향해서만 기류가 전달되도록 베인의 스윙동작이 이루어지게 베인의 동작을 제어함으로써 이루어질 수 있다. 상기와 같이 생활영역 냉난방동작과 상주 생활 영역 냉난방동작이 교번되게 실시되도록 기류를 제어하되, 상주 생활 영역(A)에 대한 냉방 또는 난방을 좀 더 집중적으로 실시하고자 하는 경우에는 생활영역 냉난방동작 대비 상주 생활 영역 냉난방동작의 실시 횟수를 좀 더 증가시킨 형태로 베인의 동작을 제어할 수 있으며, 그 반대의 경우에는 생활영역 냉난방동작 대비 상주 생활 영역 냉난방동작의 실시 횟수를 좀 더 감소시킨 형태로 베인의 동작을 제어하는 방법으로 냉방 또는 난방 실시 형태를 변화시킬 수 있다. 이처럼 생활영역 냉난방동작과 상주 생활 영역 냉난방동작이 교번되게 실시되는 형태에서는, 생활영역(A, B) 전 체에 대한 송풍이 이루어져 생활영역(A, B) 전체에 대한 냉방 또는 난방이 이루어지되, 상주 생활 영역(A)에 대 한 송풍이 좀 더 많이 이루어짐으로써, 사람이 실제로 상주하는 영역의 온도를 좀 더 신속하게 낮춰 사람이 실 제 느끼는 쾌적함을 좀 더 신속하게 향상시킬 수 있게 된다. 아울러 간접 냉난방 모드에서는, 도 19에 도시된 바와 같이, 상주 생활 영역(A)을 제외하고 미생활영역(C)과 이 동 생활 영역(B)을 향해서만 기류가 전달되도록 하는 간접냉난방동작이 실시되도록 기류의 제어가 이루어질 수 있다. 이때 간접냉난방동작은, 미생활영역(C)과 이동 생활 영역(B)을 향해서만 기류가 전달되도록 베인의 스윙동작이 이루어지게 베인의 동작을 제어함으로써 이루어질 수 있다. 이러한 간접냉난방동작이 실시되는 간접 냉난방 모드에서는, 상주 생활 영역(A)에 대한 송풍이 이루어지지 않도 록 하면서 미생활영역(C)과 이동 생활 영역(B)에 대한 송풍만이 이루어지도록 함으로써, 공기조화기에 의 해 토출되는 냉기 또는 온기의 기류가 사람에게 직접적으로 노출되지 않도록 하는 기류의 제어가 이루어지게 된 다. 본 발명의 실시예들 중 적어도 하나에 의하면, 정확도가 향상된 재실자 인식을 통해, 냉방 효율 및 에너지 효율 이 향상된 공기조화기 및 그 제어방법을 제공할 수 있다. 본 발명의 실시예들 중 적어도 하나에 의하면, 설치 환경 및 실내 공간에 따른 최적화된 기류 제어가 가능하다. 또한, 본 발명의 실시예들 중 적어도 하나에 의하면, 머신 러닝에 기반하여 실내 공간을 생활 영역별로 구분하 고, 효율적으로 기류 제어 기능을 수행할 수 있다. 본 발명에 따른 공기조화기는 상기한 바와 같이 설명된 실시예들의 구성과 방법이 한정되게 적용될 수 있는 것 이 아니라, 상기 실시예들은 다양한 변형이 이루어질 수 있도록 각 실시예들의 전부 또는 일부가 선택적으로 조 합되어 구성될 수도 있다. 한편, 본 발명의 실시예에 따른 공기조화기의 제어방법은, 프로세서가 읽을 수 있는 기록매체에 프로세서가 읽 을 수 있는 코드로서 구현하는 것이 가능하다. 프로세서가 읽을 수 있는 기록매체는 프로세서에 의해 읽혀질 수 있는 데이터가 저장되는 모든 종류의 기록장치를 포함한다. 프로세서가 읽을 수 있는 기록매체의 예로는 ROM, RAM, CD-ROM, 자기 테이프, 플로피디스크, 광 데이터 저장장치 등이 있으며, 또한, 인터넷을 통한 전송 등과 같 은 캐리어 웨이브의 형태로 구현되는 것도 포함한다. 또한, 프로세서가 읽을 수 있는 기록매체는 네트워크로 연 결된 컴퓨터 시스템에 분산되어, 분산방식으로 프로세서가 읽을 수 있는 코드가 저장되고 실행될 수 있다. 또한, 이상에서는 본 발명의 바람직한 실시예에 대하여 도시하고 설명하였지만, 본 발명은 상술한 특정의 실시"}
{"patent_id": "10-2016-0173749", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "예에 한정되지 아니하며, 청구범위에서 청구하는 본 발명의 요지를 벗어남이 없이 당해 발명이 속하는 기술분야 에서 통상의 지식을 가진자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 발명의 기술적 사상이나 전망으로부터 개별적으로 이해되어서는 안될 것이다."}
{"patent_id": "10-2016-0173749", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 공기조화기의 간략한 개념도이다. 도 2는 본 발명의 일 실시예에 따른 공기조화기의 주요 구성들 간의 제어관계를 도시한 블록도이다. 도 3은 본 발명의 일 실시예에 따른 공기조화기의 주요 구성들 간의 제어관계를 도시한 블록도이다. 도 4는 본 발명의 일 실시예에 따른 공기조화기의 제어 방법을 도시한 순서도이다. 도 5 내지 도 7은 딥러닝(Deep Learning)에 대한 설명에 참조되는 도면이다. 도 8은 본 발명의 일 실시예에 따른 생활 영역 인식 과정을 도시한 순서도이다. 도 9는 본 발명의 일 실시예에 따른 영역 인식 모듈에 관한 설명에 참조되는 도면이다. 도 10 내지 도 12는 본 발명의 일 실시예에 따른 공기조화기의 제어 방법에 관한 설명에 참조되는 도면이다. 도 13은 본 발명의 일 실시예에 따른 서버의 내부 블록도이다. 도 14 내지 도 19는 본 발명의 실시예에 따른 공기조화기의 제어 방법에 관한 설명에 참조되는 도면이다."}
