{"patent_id": "10-2022-0150837", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0069387", "출원번호": "10-2022-0150837", "발명의 명칭": "앱 실행에 따른 칩 온도 예측 및 온도 상승을 방지하기 위한 사전 조작을 수행하는 전자장치", "출원인": "에스케이하이닉스 주식회사", "발명자": "옥은재"}}
{"patent_id": "10-2022-0150837", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "앱(app) 시작 시에 상기 앱에 의한 장치의 온도 상승분을 예측하는 동작;상기 예측한 온도 상승분과 상기 장치의 현재 온도에 기초하여 상기 앱 실행 후의 상기 장치의 온도를 예측하는동작; 및예측한 상기 장치의 온도가 미리 설정된 임계 온도보다 높은 경우 상기 장치의 온도를 낮추기 위한 동작을 포함하는, 전자장치의 동작 방법."}
{"patent_id": "10-2022-0150837", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,앱 시작 시에 상기 앱에 의한 장치의 온도 상승분을 예측하는 동작은,학습된 인공신경망에 기초하여 상기 앱에 의한 장치의 온도 상승분을 예측하는 동작을 포함하는, 전자장치의 동작 방법."}
{"patent_id": "10-2022-0150837", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 학습된 인공신경망에 기초하여 상기 앱에 의한 장치의 온도 상승분을 예측하는 동작은,상기 앱 종료 시점에서의 온도 상승분 및 상기 앱 시작 시점에서의 상기 장치의 온도를 포함하는 복수의 입력파라미터들의 데이터를 획득하는 동작; 상기 복수의 입력 파라미터 각각과 상기 앱 종료 시점에서의 온도 상승분과의 상관관계를 판단하고, 상기 복수의 입력 파라미터 중 상관관계가 있다고 판단되는 입력 파라미터만 상기 인공신경망의 입력 데이터로 선택하는동작;상기 선택된 입력 데이터와 상기 온도 상승분에 기초한 지도 학습으로 상기 인공신경망을 학습시키는 동작;상기 학습된 인공신경망의 성능을 시험하는 동작; 및상기 학습된 인공신경망의 성능이 미리 설정된 제1 임계 값보다 크거나 같은 경우, 상기 인공신경망의 학습을완료하는 동작을 포함하는, 전자장치의 동작 방법."}
{"patent_id": "10-2022-0150837", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 복수의 입력 파라미터는 배터리 잔량, 현재 시각, 백그라운드(background)에서 동작 중인 앱들의 사용 메모리, 실행된 상기 앱의 사용 시간 및 충전 중 여부를 더 포함하는, 전자장치의 동작 방법."}
{"patent_id": "10-2022-0150837", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서, 상기 복수의 입력 파라미터의 데이터를 획득하는 동작은,공개특허 10-2024-0069387-3-데이터의 정규성을 확보하기 위하여 미리 설정된 개수 이상의 복수의 입력 파라미터의 데이터를 획득하는 동작을 포함하는, 전자장치의 동작 방법."}
{"patent_id": "10-2022-0150837", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 복수의 입력 파라미터 중 상관관계가 있다고 판단되는 입력 파라미터만 상기 인공신경망의 입력 데이터로선택하는 동작은,상기 복수의 입력 파라미터 각각과 상기 온도 상승분에 대해 선형회귀분석(linear regression analysis)을 수행하여 상관계수를 획득하고, 상기 복수의 입력 파라미터 중 획득한 상관계수가 미리 설정된 제2 임계 값보다 큰입력 파라미터는 상관관계가 있다고 판단하고 상기 인공신경망의 입력 데이터로 선택하는 동작을 포함하는, 전자장치의 동작 방법."}
{"patent_id": "10-2022-0150837", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 선택된 입력 데이터와 상기 온도 상승분에 기초한 지도 학습으로 상기 인공신경망을 학습시키는 동작은,상기 미리 설정된 개수 이상의 선택된 입력 데이터 중에서 일부만을 이용하여 상기 인공신경망을 학습시키는 동작을 포함하고,상기 학습된 인공신경망의 성능을 시험하는 동작은, 상기 미리 설정된 개수 이상의 선택된 입력 데이터 중에서나머지 일부를 이용하여 상기 학습된 인공신경망의 성능을 시험하는 동작을 포함하는, 전자장치의 동작 방법."}
{"patent_id": "10-2022-0150837", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서,상기 학습된 인공신경망의 성능이 미리 설정된 제1 임계 값보다 작은 경우에는 상기 복수의 입력 파라미터의 데이터를 획득하는 동작부터 시작하여 상기 인공신경망을 학습시키는 동작을 반복하는, 전자장치의 동작 방법."}
{"patent_id": "10-2022-0150837", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 인공신경망을 학습시키는 동작의 반복 횟수가 미리 설정된 제2 임계 값보다 큰지를 판단하는 동작을 더 포함하고,상기 인공신경망을 학습시키는 동작의 반복 횟수가 미리 설정된 제2 임계 값보다 크다면, 상기 학습된 인공신경망의 성능이 미리 설정된 제3 임계 값보다 크거나 같은 경우, 상기 인공신경망의 학습을완료하는 동작을 포함하는, 전자장치의 동작 방법."}
{"patent_id": "10-2022-0150837", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 인공신경망을 학습시키는 동작의 반복 횟수가 미리 설정된 제2 임계 값보다 크고, 상기 학습된 인공신경망의 성능이 미리 설정된 제3 임계 값보다 작은 경우, 상기 앱에 대한 인공신경망을 폐기하고, 상기 앱에 대해서는 온도상승분을 예측하는 동작을 수행하지 않도록 하는, 전자장치의 동작 방법. 공개특허 10-2024-0069387-4-청구항 11 제3항에 있어서, 상기 장치의 온도를 낮추기 위한 동작은,상기 장치의 제어를 관장하는 프로세서의 동작 주파수를 줄이는 동작; 또는상기 장치에 구비되는 메모리의 동작 주파수를 줄이는 동작을 포함하는, 전자장치의 동작 방법."}
{"patent_id": "10-2022-0150837", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1 외부와의 데이터 통신을 수행하는 제1 인터페이스;제2 외부의 동작을 제어하기 위한 신호를 생성하는 제2 인터페이스;앱(app) 시작 시에 학습된 인공신경망에 기초하여 상기 앱에 의한 장치의 온도 상승분을 예측하는 온도상승분예측부;복수의 입력 파라미터들의 데이터를 수신하고, 수신한 입력 파라미터들의 데이터에 기초하여 상기 인공신경망을위한 입력 데이터를 생성하고, 상기 인공신경망을 학습시키는 데이터 처리부; 및상기 온도상승분 예측부에 의하여 예측된 상기 온도 상승분과 상기 장치의 현재 온도에 기초하여 상기 앱 실행후의 상기 장치의 온도를 예측하고, 예측한 상기 장치의 온도가 미리 설정된 임계 온도보다 높은 경우 상기 장치의 온도는 낮추기 위한 동작을 실행하는 프로세서를 포함하는, 메모리 컨트롤러."}
{"patent_id": "10-2022-0150837", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서, 상기 데이터 처리부는,상기 앱 종료 시점에서의 온도 상승분 및 상기 앱 시작 시점에서의 상기 장치의 온도를 포함하는 복수의 입력파라미터들의 데이터를 획득하고,상기 복수의 입력 파라미터 각각과 상기 앱 종료 시점에서의 온도 상승분과의 상관관계를 판단하고, 상기 복수의 입력 파라미터 중 상관관계가 있다고 판단되는 입력 파라미터만 상기 인공신경망의 입력 데이터로 선택하고,상기 선택된 입력 데이터와 상기 온도 상승분에 기초한 지도 학습으로 상기 인공신경망을 학습시키고,상기 학습된 인공신경망의 성능을 시험하고,상기 학습된 인공신경망의 성능이 미리 설정된 제1 임계 값보다 크거나 같은 경우, 상기 인공신경망의 학습을완료하는, 메모리 컨트롤러."}
{"patent_id": "10-2022-0150837", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 데이터 처리부는,데이터의 정규성을 확보하기 위하여 미리 설정된 개수 이상의 복수의 입력 파라미터의 데이터를 획득하고,상기 복수의 입력 파라미터 각각과 상기 온도 상승분에 대해 선형회귀분석(linear regression analysis)을 수행하여 상관계수를 획득하고, 상기 복수의 입력 파라미터 중 획득한 상관계수가 미리 설정된 제2 임계 값보다 큰입력 파라미터는 상관관계가 있다고 판단하고 상기 인공신경망의 입력 데이터로 선택하고,공개특허 10-2024-0069387-5-상기 미리 설정된 개수 이상의 선택된 입력 데이터 중에서 일부만을 이용하여 상기 인공신경망을 학습시키고,상기 미리 설정된 개수 이상의 선택된 입력 데이터 중에서 나머지 일부를 이용하여 상기 학습된 인공신경망의성능을 시험하는, 메모리 컨트롤러."}
{"patent_id": "10-2022-0150837", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 데이터 처리부는,상기 학습된 인공신경망의 성능이 미리 설정된 제1 임계 값보다 작은 경우에는 상기 복수의 입력 파라미터의 데이터를 획득하는 동작부터 시작하여 상기 인공신경망을 학습시키는 동작을 반복하고,상기 인공신경망을 학습시키는 동작의 반복 횟수가 미리 설정된 제2 임계 값보다 크고, 상기 학습된 인공신경망의 성능이 미리 설정된 제3 임계 값보다 크거나 같은 경우, 상기 인공신경망의 학습을 완료하고,상기 인공신경망을 학습시키는 동작의 반복 횟수가 미리 설정된 제2 임계 값보다 크고, 상기 학습된 인공신경망의 성능이 미리 설정된 제3 임계 값보다 작은 경우, 상기 앱에 대한 인공신경망을 폐기하고, 상기 앱에 대해서는 온도상승분을 예측하는 동작을 수행하지 않도록 설정하는, 메모리 컨트롤러."}
{"patent_id": "10-2022-0150837", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제12항에 있어서,상기 프로세서는, 상기 장치의 온도를 낮추기 위하여,상기 프로세서의 동작 주파수를 줄이거나, 또는상기 제2 외부의 동작 주파수를 줄이거나, 또는상기 제2 외부에서 활성화되는 다이의 수를 줄이는, 메모리 컨트롤러."}
{"patent_id": "10-2022-0150837", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "앱(app) 시작 시에 학습된 인공신경망에 기초하여 상기 앱에 의한 장치의 온도 상승분을 예측하는 온도상승분예측부;복수의 입력 파라미터들의 데이터를 수신하고, 수신한 입력 파라미터들의 데이터에 기초하여 상기 인공신경망을위한 입력 데이터를 생성하고, 상기 인공신경망을 학습시키는 데이터 처리부; 및상기 온도상승분 예측부에 의하여 예측된 상기 온도 상승분과 상기 장치의 현재 온도에 기초하여 상기 앱 실행후의 상기 장치의 온도를 예측하고, 예측한 상기 장치의 온도가 미리 설정된 임계 온도보다 높은 경우 상기 장치의 온도는 낮추기 위한 동작을 실행하는 프로세서를 포함하는, 전자장치."}
{"patent_id": "10-2022-0150837", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서, 상기 데이터 처리부는,상기 앱 종료 시점에서의 온도 상승분 및 상기 앱 시작 시점에서의 상기 장치의 온도를 포함하는 복수의 입력파라미터들의 데이터를 획득하고,상기 복수의 입력 파라미터 각각과 상기 앱 종료 시점에서의 온도 상승분과의 상관관계를 판단하고, 상기 복수의 입력 파라미터 중 상관관계가 있다고 판단되는 입력 파라미터만 상기 인공신경망의 입력 데이터로 선택하고,공개특허 10-2024-0069387-6-상기 선택된 입력 데이터와 상기 온도 상승분에 기초한 지도 학습으로 상기 인공신경망을 학습시키고,상기 학습된 인공신경망의 성능을 시험하고,상기 학습된 인공신경망의 성능이 미리 설정된 제1 임계 값보다 크거나 같은 경우, 상기 인공신경망의 학습을완료하는, 전자장치."}
{"patent_id": "10-2022-0150837", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에 있어서,상기 데이터 처리부는,데이터의 정규성을 확보하기 위하여 미리 설정된 개수 이상의 복수의 입력 파라미터의 데이터를 획득하고,상기 복수의 입력 파라미터 각각과 상기 온도 상승분에 대해 선형회귀분석(linear regression analysis)을 수행하여 상관계수를 획득하고, 상기 복수의 입력 파라미터 중 획득한 상관계수가 미리 설정된 제2 임계 값보다 큰입력 파라미터는 상관관계가 있다고 판단하고 상기 인공신경망의 입력 데이터로 선택하고,상기 미리 설정된 개수 이상의 선택된 입력 데이터 중에서 일부만을 이용하여 상기 인공신경망을 학습시키고,상기 미리 설정된 개수 이상의 선택된 입력 데이터 중에서 나머지 일부를 이용하여 상기 학습된 인공신경망의성능을 시험하는, 전자장치."}
{"patent_id": "10-2022-0150837", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서,상기 데이터 처리부는,상기 학습된 인공신경망의 성능이 미리 설정된 제1 임계 값보다 작은 경우에는 상기 복수의 입력 파라미터의 데이터를 획득하는 동작부터 시작하여 상기 인공신경망을 학습시키는 동작을 반복하고,상기 인공신경망을 학습시키는 동작의 반복 횟수가 미리 설정된 제2 임계 값보다 크고, 상기 학습된 인공신경망의 성능이 미리 설정된 제3 임계 값보다 크거나 같은 경우, 상기 인공신경망의 학습을 완료하고,상기 인공신경망을 학습시키는 동작의 반복 횟수가 미리 설정된 제2 임계 값보다 크고, 상기 학습된 인공신경망의 성능이 미리 설정된 제3 임계 값보다 작은 경우, 상기 앱에 대한 인공신경망을 폐기하고, 상기 앱에 대해서는 온도상승분을 예측하는 동작을 수행하지 않도록 설정하는, 전자장치."}
{"patent_id": "10-2022-0150837", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 앱 또는 어플리케이션 실행에 따른 칩 온도 예측 및 온도 상승을 방지하기 위한 사전 조작을 수행하는 전자장 치 및 전자장치의 동작방법에 관한 것으로, 본 발명에서 제안하는 전자장치의 동작 방법은 앱(app) 시작 시에 상 기 앱에 의한 장치의 온도 상승분을 예측하는 동작, 상기 예측한 온도 상승분과 상기 장치의 현재 온도에 기초하 여 상기 앱 실행 후의 상기 장치의 온도를 예측하는 동작, 및 예측한 상기 장치의 온도가 미리 설정된 임계 온도 보다 높은 경우 상기 장치의 온도를 낮추기 위한 동작을 포함할 수 있다."}
{"patent_id": "10-2022-0150837", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "다양한 실시 예는 앱 또는 어플리케이션 실행에 따른 칩 온도 예측 및 온도 상승을 방지하기 위한 사전 조작을 수행하는 전자장치 및 전자장치의 동작방법에 관한 것이다."}
{"patent_id": "10-2022-0150837", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "스토리지 장치는 컴퓨터와, 스마트폰, 태블릿 등의 모바일 단말, 또는 각종 전자 기기와 같은 외부 장치 (external device)의 요청을 기초로 데이터를 저장할 수 있는 장치이다. 스토리지 장치는 메모리와 메모리를 제어하기 위한 메모리 컨트롤러를 포함할 수 있다. 메모리 컨트롤러는 외부 장치로부터 커맨드(command)를 입력 받아, 입력 받은 커맨드에 기초하여 메모리로부터 데이터를 리드(read)하거 나, 메모리에 데이터를 기록(write)/프로그램(program)하거나, 또는 메모리의 데이터를 소거(erase)하기 위한동작들을 실행하거나 제어할 수 있다. 차량용 스토리지 장치는 일반용 제품에 비하여 더욱 높은 수준의 신뢰성을 요구한다. 특히 온도 측면에서 살펴 보면 차량용 스토리지 장치는 일반 제품보다 더 높은 온도에서 동작을 보장하여야 한다. 차량용 스토리지 장치 가 높은 온도에서 동작하는 경우, 제품 온도를 낮추기 위해 클럭 주파수 감소와 같은 정책이 수행될 수 있으나, 이런 정책이 갑작스러운 전원 중단(sudden power off; SPO)과 같은 상황에서 발생할 수도 있고, 이는 장치 동작 측면에서 예기치 않은 치명적인 문제를 발생시킬 수 있다."}
{"patent_id": "10-2022-0150837", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상술한 문제를 해결하기 위하여는 언제 장치의 온도가 얼마나 올라갈 것인가를 미리 예측할 필요가 있다. 본 발명의 다양한 실시 예들은 머신 러닝의 지도 학습을 활용하는 인공지능에 기반하여 장치의 온도가 얼마나 올라갈 것인가를 미리 예측하는 방법을 제공할 수 있다. 본 문서에서 이루고자 하는 기술적 과제는 이상에서 언급한 기술적 과제로 제한되지 않으며, 언급되지 않은 또"}
{"patent_id": "10-2022-0150837", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "다른 기술적 과제들은 아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0150837", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 다양한 실시 예들에 따르면, 전자장치의 동작 방법은 앱(app) 시작 시에 상기 앱에 의한 장치의 온도 상승분을 예측하는 동작, 상기 예측한 온도 상승분과 상기 장치의 현재 온도에 기초하여 상기 앱 실행 후의 상 기 장치의 온도를 예측하는 동작 및 예측한 상기 장치의 온도가 미리 설정된 임계 온도보다 높은 경우 상기 장 치의 온도를 낮추기 위한 동작을 포함할 수 있다. 본 발명의 다양한 실시 예들에 따르면, 앱 시작 시에 상기 앱에 의한 장치의 온도 상승분을 예측하는 동작은, 학습된 인공신경망에 기초하여 상기 앱에 의한 장치의 온도 상승분을 예측하는 동작을 포함할 수 있다. 본 발명의 다양한 실시 예들에 따르면, 학습된 인공신경망에 기초하여 상기 앱에 의한 장치의 온도 상승분을 예 측하는 동작은 상기 앱 종료 시점에서의 온도 상승분 및 상기 앱 시작 시점에서의 상기 장치의 온도를 포함하는 복수의 입력 파라미터들의 데이터를 획득하는 동작, 상기 복수의 입력 파라미터 각각과 상기 앱 종료 시점에서 의 온도 상승분과의 상관관계를 판단하고, 상기 복수의 입력 파라미터 중 상관관계가 있다고 판단되는 입력 파 라미터만 상기 인공신경망의 입력 데이터로 선택하는 동작, 상기 선택된 입력 데이터와 상기 온도 상승분에 기 초한 지도 학습으로 상기 인공신경망을 학습시키는 동작, 상기 학습된 인공신경망의 성능을 시험하는 동작 및 상기 학습된 인공신경망의 성능이 미리 설정된 제1 임계 값보다 크거나 같은 경우, 상기 인공신경망의 학습을 완료하는 동작을 포함할 수 있다. 본 발명의 다양한 실시 예들에 따르면, 상기 복수의 입력 파라미터는 배터리 잔량, 현재 시각, 백그라운드 (background)에서 동작 중인 앱들의 사용 메모리, 실행된 상기 앱의 사용 시간 및 충전 중 여부를 더 포함할 수 있다. 본 발명의 다양한 실시 예들에 따르면, 상기 복수의 입력 파라미터의 데이터를 획득하는 동작은 데이터의 정규 성을 확보하기 위하여 미리 설정된 개수 이상의 복수의 입력 파라미터의 데이터를 획득하는 동작을 포함할 수 있다. 본 발명의 다양한 실시 예들에 따르면, 상기 복수의 입력 파라미터 중 상관관계가 있다고 판단되는 입력 파라미 터만 상기 인공신경망의 입력 데이터로 선택하는 동작은 상기 복수의 입력 파라미터 각각과 상기 온도 상승분에 대해 선형회귀분석(linear regression analysis)을 수행하여 상관계수를 획득하고, 상기 복수의 입력 파라미터 중 획득한 상관계수가 미리 설정된 제2 임계 값보다 큰 입력 파라미터는 상관관계가 있다고 판단하고 상기 인공 신경망의 입력 데이터로 선택하는 동작을 포함할 수 있다. 본 발명의 다양한 실시 예들에 따르면, 상기 선택된 입력 데이터와 상기 온도 상승분에 기초한 지도 학습으로 상기 인공신경망을 학습시키는 동작은 상기 미리 설정된 개수 이상의 선택된 입력 데이터 중에서 일부만을 이용 하여 상기 인공신경망을 학습시키는 동작을 포함하고, 상기 학습된 인공신경망의 성능을 시험하는 동작은 상기 미리 설정된 개수 이상의 선택된 입력 데이터 중에서 나머지 일부를 이용하여 상기 학습된 인공신경망의 성능을 시험하는 동작을 포함할 수 있다. 본 발명의 다양한 실시 예들에 따르면, 상기 학습된 인공신경망의 성능이 미리 설정된 제1 임계 값보다 작은 경 우에는 상기 복수의 입력 파라미터의 데이터를 획득하는 동작부터 시작하여 상기 인공신경망을 학습시키는 동작 을 반복할 수 있다. 본 발명의 다양한 실시 예들에 따르면, 상기 인공신경망을 학습시키는 동작의 반복 횟수가 미리 설정된 제2 임 계 값보다 큰지를 판단하는 동작을 더 포함하고, 상기 인공신경망을 학습시키는 동작의 반복 횟수가 미리 설정 된 제2 임계 값보다 크고 상기 학습된 인공신경망의 성능이 미리 설정된 제3 임계 값보다 크거나 같은 경우, 상 기 인공신경망의 학습을 완료하는 동작을 포함할 수 있다. 본 발명의 다양한 실시 예들에 따르면, 상기 인공신경망을 학습시키는 동작의 반복 횟수가 미리 설정된 제2 임 계 값보다 크고, 상기 학습된 인공신경망의 성능이 미리 설정된 제3 임계 값보다 작은 경우, 상기 앱에 대한 인 공신경망을 폐기하고, 상기 앱에 대해서는 온도상승분을 예측하는 동작을 수행하지 않도록 할 수 있다. 본 발명의 다양한 실시 예들에 따르면, 상기 장치의 온도를 낮추기 위한 동작은 상기 장치의 제어를 관장하는 프로세서의 동작 주파수를 줄이는 동작 또는 상기 장치에 구비되는 메모리의 동작 주파수를 줄이는 동작을 포함 할 수 있다. 본 발명의 다양한 실시 예들에 따르면, 메모리 컨트롤러는 제1 외부(예: 외부장치)와의 데이터 통신을 수 행하는 제1 인터페이스, 제2 외부(예: 메모리의 동작을 제어하기 위한 신호를 생성하는 제2 인터페이스, 앱(app) 시작 시에 학습된 인공신경망에 기초하여 상기 앱에 의한 장치의 온도 상승분을 예측하는 온도상승분 예측부, 복수의 입력 파라미터들의 데이터를 수신하고, 수신한 입력 파라미터들의 데이터에 기초하여 상기 인공 신경망을 위한 입력 데이터를 생성하고, 상기 인공신경망을 학습시키는 데이터 처리부 및 상기 온도상승분 예측 부에 의하여 예측된 상기 온도 상승분과 상기 장치의 현재 온도에 기초하여 상기 앱 실행 후의 상기 장치의 온 도를 예측하고, 예측한 상기 장치의 온도가 미리 설정된 임계 온도보다 높은 경우 상기 장치의 온도는 낮추기 위한 동작을 실행하는 프로세서를 포함할 수 있다. 본 발명의 다양한 실시 예들에 따르면, 전자장치는 앱(app) 시작 시에 학습된 인공신경망에 기초하여 상기 앱에 의한 장치의 온도 상승분을 예측하는 온도상승분 예측부, 복수의 입력 파라미터들의 데이터를 수신하고, 수신한 입력 파라미터들의 데이터에 기초하여 상기 인공신경망을 위한 입력 데이터를 생성하고, 상기 인공신경망을 학 습시키는 데이터 처리부 및 상기 온도상승분 예측부에 의하여 예측된 상기 온도 상승분과 상기 장치의 현재 온 도에 기초하여 상기 앱 실행 후의 상기 장치의 온도를 예측하고, 예측한 상기 장치의 온도가 미리 설정된 임계 온도보다 높은 경우 상기 장치의 온도는 낮추기 위한 동작을 실행하는 프로세서를 포함할 수 있다. 본 발명의 다양한 실시 예들에 따르면, 상기 데이터 처리부는 상기 앱 종료 시점에서의 온도 상승분 및 상기 앱 시작 시점에서의 상기 장치의 온도를 포함하는 복수의 입력 파라미터들의 데이터를 획득하고, 상기 복수의 입력 파라미터 각각과 상기 앱 종료 시점에서의 온도 상승분과의 상관관계를 판단하고, 상기 복수의 입력 파라미터 중 상관관계가 있다고 판단되는 입력 파라미터만 상기 인공신경망의 입력 데이터로 선택하고, 상기 선택된 입력 데이터와 상기 온도 상승분에 기초한 지도 학습으로 상기 인공신경망을 학습시키고, 상기 학습된 인공신경망의 성능을 시험하고, 상기 학습된 인공신경망의 성능이 미리 설정된 제1 임계 값보다 크거나 같은 경우, 상기 인공 신경망의 학습을 완료할 수 있다. 본 발명의 다양한 실시 예들에 따르면, 상기 데이터 처리부는 데이터의 정규성을 확보하기 위하여 미리 설정된 개수 이상의 복수의 입력 파라미터의 데이터를 획득하고, 상기 복수의 입력 파라미터 각각과 상기 온도 상승분 에 대해 선형회귀분석(linear regression analysis)을 수행하여 상관계수를 획득하고, 상기 복수의 입력 파라미 터 중 획득한 상관계수가 미리 설정된 제2 임계 값보다 큰 입력 파라미터는 상관관계가 있다고 판단하고 상기 인공신경망의 입력 데이터로 선택하고, 상기 미리 설정된 개수 이상의 선택된 입력 데이터 중에서 일부만을 이 용하여 상기 인공신경망을 학습시키고, 상기 미리 설정된 개수 이상의 선택된 입력 데이터 중에서 나머지 일부 를 이용하여 상기 학습된 인공신경망의 성능을 시험할 수 있다. 본 발명의 다양한 실시 예들에 따르면, 상기 데이터 처리부는 상기 학습된 인공신경망의 성능이 미리 설정된 제 1 임계 값보다 작은 경우에는 상기 복수의 입력 파라미터의 데이터를 획득하는 동작부터 시작하여 상기 인공신경망을 학습시키는 동작을 반복하고, 상기 인공신경망을 학습시키는 동작의 반복 횟수가 미리 설정된 제2 임계 값보다 크고, 상기 학습된 인공신경망의 성능이 미리 설정된 제3 임계 값보다 크거나 같은 경우, 상기 인공신경 망의 학습을 완료하고, 상기 인공신경망을 학습시키는 동작의 반복 횟수가 미리 설정된 제2 임계 값보다 크고, 상기 학습된 인공신경망의 성능이 미리 설정된 제3 임계 값보다 작은 경우, 상기 앱에 대한 인공신경망을 폐기 하고, 상기 앱에 대해서는 온도상승분을 예측하는 동작을 수행하지 않도록 설정할 수 있다. 본 발명의 다양한 실시 예들에 따르면, 상기 프로세서는, 상기 장치의 온도를 낮추기 위하여, 상기 프로세서의 동작 주파수를 줄이거나, 또는 상기 제2 외부의 동작 주파수를 줄이거나, 또는 상기 제2 외부에서 활성화되는 다이의 수를 줄일 수 있다."}
{"patent_id": "10-2022-0150837", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 다양한 실시 예들에 따르면, 앱 또는 어플리케이션 실행에 의한 장치의 온도 상승분을 미리 예측할 수 있다. 본 발명의 다양한 실시 예들에 따르면, 장치의 현재 내부 온도와 온도 상승분을 더한 것이 내부 온도 감소 정책 을 유발할 정도라면 미리 온도 감소 정책을 적용하여 동작 중 예기치 못한 순간에 온도 감소 정책이 실행되는 것을 방지할 수 있다."}
{"patent_id": "10-2022-0150837", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는, 본 발명의 실시예들을 첨부된 도면을 참조하여 상세히 설명한다. 도 1은 본 발명의 실시예들에 따른 스토리지 장치의 개략적인 구성도이다. 도 1을 참조하면, 본 발명의 실시예들에 따른 스토리지 장치는 데이터를 저장하는 메모리와, 메모리 를 제어하는 컨트롤러를 포함할 수 있다. 필요한 경우 이외 추가 구성요소가 스토리지 장치에 더 포함될 수 있다. 메모리는 다수의 메모리 블록(Memory Block)을 포함하며, 컨트롤러의 제어에 응답하여 동작한다. 여 기서, 메모리의 동작은 일 예로, 리드 동작(Read Operation), 프로그램 동작(Program Operation; \"Write Operation\" 이라고도 함) 및 소거 동작(Erasure Operation) 등을 포함할 수 있다. 예를 들어, 메모리는 낸드 플래시 메모리(NAND Flash Memory), 3차원 낸드 플래시 메모리(3D NAND Flash Memory), 노아 플래시 메모리(NOR Flash memory), 저항성 램(Resistive Random Access Memory: RRAM), 상변화 메모리(Phase-Change Memory: PRAM), 자기저항 메모리(Magnetoresistive Random Access Memory: MRAM), 강유전 체 메모리(Ferroelectric Random Access Memory: FRAM), 또는 스핀주입 자화반전 메모리(Spin Transfer Torque Random Access Memory: STT-RAM) 등과 같은 다양한 타입의 비휘발성 메모리일 수 있다. 한편, 메모리는 3차원 어레이 구조(three-Dimensional Array structure)로 구현될 수 있다. 본 발명의 실 시예들은 전하 저장층이 전도성 부유 게이트(Floating Gate)로 구성된 플래시 메모리는 물론, 전하 저장층이 절 연막으로 구성된 차지 트랩형 플래시(Charge Trap Flash; CTF)에도 적용될 수 있다. 메모리는 컨트롤러(메모리 컨트롤러로 칭할 수도 있다.)로부터 커맨드 및 어드레스 등을 수신하고, 메모리 셀 어레이 중 어드레스에 의해 선택된 영역을 액세스할 수 있다. 즉, 메모리는 어드레스에 의해 선 택된 영역에 대해 커맨드에 의해 지시되는 동작을 수행할 수 있다. 예를 들면, 메모리는 프로그램 동작, 리드 동작 및 소거 동작 등을 수행할 수 있다. 프로그램 동작 시, 메 모리는 어드레스에 의해 선택된 영역에 데이터를 프로그램 할 수 있다. 리드 동작 시, 메모리는 어드 레스에 의해 선택된 영역으로부터 데이터를 읽을 수 있다. 소거 동작 시, 메모리는 어드레스에 의해 선택 된 영역에 저장된 데이터를 소거할 수 있다. 컨트롤러는 메모리에 대한 프로그램(기록), 리드, 소거 및 백그라운드(background) 동작을 제어할 수 있다. 여기서, 백그라운드 동작은 가비지 컬렉션(Garbage Collection, GC), 웨어 레벨링(Wear Leveling, WL), 리드 리클레임(Read Reclaim, RR) 또는 배드 블록 관리(Bad Block Management, BBM) 동작 중 하나 이상을 포함 할 수 있다. 컨트롤러는 스토리지 장치의 외부에 위치하는 외부 장치(e.g. 호스트(HOST))의 요청에 따라 메모리 의 동작을 제어할 수 있다. 반면, 컨트롤러는 외부 장치의 요청과 무관하게 메모리의 동작을 제 어할 수도 있다. 외부 장치는 컴퓨터, UMPC(Ultra Mobile PC), 워크스테이션, , PDA(Personal Digital Assistants), 타블렛 (tablet), 모바일 폰(mobile phone), 스마트폰(smart phone), e-북(e-book), PMP(portable multimedia player), 휴대용 게임기, 네비게이션(navigation) 장치, 블랙박스(black box), 디지털 카메라(digital camera), DMB(Digital Multimedia Broadcasting) 재생기, 스마트 텔레비전(smart television), 디지털 음성 녹 음기(digital audio recorder), 디지털 음성 재생기(digital audio player), 디지털 영상 녹화기(digital picture recorder), 디지털 영상 재생기(digital picture player), 디지털 동영상 녹화기(digital video recorder), 디지털 동영상 재생기(digital video player), 데이터 센터를 구성하는 스토리지, 홈 네트워크를 구 성하는 다양한 전자 장치들 중 하나, 컴퓨터 네트워크를 구성하는 다양한 전자 장치들 중 하나, 텔레매틱스 네 트워크를 구성하는 다양한 전자 장치들 중 하나, RFID(radio frequency identification) 장치, 지상, 수상 또 는 공중을 인간의 제어에 따라 주행하거나 또는 자율 주행하는 이동 장치(e.g. 차량, 로봇, 드론) 등일 수 있다. 외부 장치는 적어도 하나의 운영 시스템(OS, operating system)을 포함할 수 있다. 운영 시스템은 외부 장치의 기능 및 동작을 전반적으로 관리 및 제어할 수 있고, 외부 장치와 스토리지 장치 간의 상호 동작을 제공할 수 있다. 운영 시스템은 외부 장치의 이동성(mobility)에 따라 일반 운영 시스템과 모바일 운영 시스템으로 구 분할 수 있다. 한편, 컨트롤러와 외부 장치는 서로 분리된 장치일 수도 있다. 경우에 따라서, 컨트롤러와 외부 장치 는 하나의 장치로 통합되어 구현될 수도 있다. 아래에서는, 설명의 편의를 위하여, 컨트롤러와 외부 장치 가 서로 분리된 장치인 것을 예로 들어 설명한다. 도 1을 참조하면, 컨트롤러는 호스트 인터페이스, 메모리 인터페이스 및 제어 회로 등을 포함할 수 있다. 호스트 인터페이스는 외부 장치와의 통신을 위한 인터페이스를 제공한다. 예시적으로 호스트 인터페이스 는 USB (Universal Serial Bus) 프로토콜, MMC (multimedia card) 프로토콜, PCI (peripheral component interconnection) 프로토콜, PCI-E (PCI-express) 프로토콜, ATA (Advanced Technology Attachment) 프로토콜, Serial-ATA 프로토콜, Parallel-ATA 프로토콜, SCSI (small computer small interface) 프로토콜, ESDI (enhanced small disk interface) 프로토콜, IDE (Integrated Drive Electronics) 프로토콜, 전용 (proprietary) 프로토콜 등과 같은 다양한 인터페이스 프로토콜들 중 적어도 하나를 사용하는 인터페이스를 제 공할 수 있다. 제어 회로는 호스트 인터페이스를 통해서 커맨드를 수신하여, 수신된 커맨드를 처리하는 동작을 수행 할 수 있다. 메모리 인터페이스는, 메모리와 연결되어 메모리와의 통신을 위한 인터페이스를 제공할 수 있다. 즉, 메모리 인터페이스는 제어 회로의 제어에 응답하여 메모리와 컨트롤러 사이의 인터페이스를 제공하도록 구성될 수 있다. 제어 회로는 컨트롤러의 전반적인 제어 동작을 수행하여 메모리의 동작을 제어할 수 있다. 이를 위해, 일 실시예에 따라, 제어 회로는 프로세서를 포함할 수 있으며, 추가적으로 워킹 메모리 및/또는 에러 검출 및 정정 회로(ECC Circuit)를 선택적으로 포함할 수 있다. 프로세서는 컨트롤러의 제반 동작을 제어할 수 있다. 프로세서는 호스트 인터페이스를 통해 외부 장치와 통신하고, 메모리 인터페이스를 통해 메모리 와 통신할 수 있다. 프로세서는 플래시 변환 계층(Flash Translation Layer, FTL)의 기능을 수행할 수 있다. 프로세서는 플래시 변환 계층(FTL)을 통해 외부 장치가 제공한 논리 블록 어드레스를 물리 블록 어드레스로 변환할 수 있다. 플래시 변환 계층은 매핑 테이블을 이용하여 논리 블록 어드레스를 입력 받아, 물리 블록 어드레스로 변 환시킬 수 있다. 플래시 변환 계층의 주소 맵핑 방법에는 맵핑 단위에 따라 여러 가지가 있다. 대표적인 어드레스 맵핑 방법에는 페이지 맵핑 방법(Page mapping method), 블록 맵핑 방법(Block mapping method), 그리고 혼합 맵핑 방법 (Hybrid mapping method)이 있다. 프로세서는 외부 장치로부터 수신된 데이터를 랜더마이즈(randomize)할 수 있다. 예를 들면, 프로세서 는 설정된 랜더마이징 시드(randomizing seed)를 이용하여 외부 장치로부터 수신된 데이터를 랜더마이즈할 수 있다. 랜더마이즈된 데이터는 메모리에 제공되고, 메모리에 프로그램될 수 있다. 프로세서는 리드 동작 시 메모리로부터 수신된 데이터를 디랜더마이즈(de-randomize)할 수 있다. 예 를 들면, 프로세서는 디랜더마이징 시드(de-randomizing seed)를 이용하여 메모리로부터 수신된 데이 터를 디랜더마이즈할 수 있다. 디랜더마이즈된 데이터는 외부 장치로 출력될 수 있다. 프로세서는 가비지 컬렉션(Garbage Collection, GC) 기능, 웨어 레벨링(Wear Leveling, WL) 기능, 배드 블록 관리(bad block management) 기능과 같은 메모리에 대한 백그라운드(background) 기능을 수행할 수 도 있다. 가비지 컬렉션 기능은 메모리에 데이터를 기록할 공간이 충분하지 않을 때, 데이터를 기록할 여유 공간을 확보하기 위하여, 기존에 메모리 블록 내에 부분적으로 기록되어 있던 데이터를 모아서 다른 메모리 블록으로 이동하여 기록하는 기능일 수 있다. 웨어-레벨링 기능은 메모리의 오류 및 데이터 손실을 사전에 방지하고 제품의 내구성과 안정성을 향상시키 기 위하여 메모리의 모든 메모리 블록에 데이터를 균등하게 기록함으로써 특정 블록의 과도한 사용을 방지 하는 기능일 수 있다. 배드 블록 관리 기능은 메모리 내에 있는 배드 블록을 검출하고, 예비 블록이 있는 경우, 배드 블록을 예 비 블록으로 대체함으로써 배드 블록에 데이터가 기록되는 것을 방지하는 기능일 수 있다. 프로세서는 펌웨어(firmware)를 실행하여 컨트롤러의 동작을 제어할 수 있다. 다시 말해, 프로세서 는, 컨트롤러의 제반 동작을 제어하고, 부팅 시 워킹 메모리에 저장되어 있던 펌웨어를 실행(구 동)할 수 있다. 이하, 본 발명의 실시예들에서 설명하는 스토리지 장치의 동작은 프로세서가 해당 동 작이 정의된 펌웨어를 실행하는 방식으로 구현될 수 있다. 펌웨어는 스토리지 장치를 구동하기 위해서 스토리지 장치 내에서 실행되는 프로그램으로서, 다양한 기능적 계층들을 포함할 수 있다. 일 예로, 펌웨어는 전술한 기능적 계층들 각각을 실행하기 위한 코드가 정의 된 바이너리 데이터를 포함할 수 있다. 예를 들어, 펌웨어는, 외부 장치에서 스토리지 장치로 전송하는 논리 블록 어드레스와 메모리의 물리 블록 어드레스 간의 변환 기능을 하는 플래시 변환 계층과, 호스트 인터페이스를 통해 외부 장치로부터 수 신한 커맨드를 해석하여 플래시 변환 계층에 전달하는 역할을 하는 호스트 인터페이스 계층(Host Interface Layer, HIL)과, 플래시 변환 계층에서 지시하는 커맨드를 메모리로 전달하는 플래시 인터페이스 계층 (Flash Interface Layer, FIL) 들을 포함할 수 있다. 또한, 펌웨어는 가비지 컬렉션 기능, 웨어 레벨링 기능, 배드 블록 관리 기능들을 포함할 수 있다. 이러한 펌웨어는, 일 예로, 메모리 또는 메모리 외부에 위치하는 별도의 비휘발성 메모리(e.g. ROM, NOR Flash)에서 워킹 메모리로 로드(load)될 수 있다. 프로세서는 파워 온 이후 부팅 동작을 실행할 때, 먼저 펌웨어의 전체 또는 일부를 워킹 메모리에 로드할 수 있다. 프로세서는 컨트롤러의 제반 동작을 제어하기 위해 워킹 메모리에 로딩된 펌웨어에 정의된 논리 연산을 수행할 수 있다. 프로세서는 펌웨어에 정의된 논리 연산을 수행한 결과를 워킹 메모리에 저장 할 수 있다. 프로세서는 펌웨어에 정의된 논리 연산을 수행한 결과에 따라서, 컨트롤러가 커맨드 또는 신호를 생성하도록 제어할 수 있다. 프로세서는 수행되어야 할 논리 연산이 정의된 펌웨어의 부분이 워 킹 메모리에 로드되어 있지 않은 경우에, 펌웨어의 해당 부분을 워킹 메모리에 로드하기 위한 이벤트 (e.g. 인터럽트)를 발생시킬 수 있다. 한편, 프로세서는 펌웨어를 구동하는데 필요한 메타 데이터를 메모리에서 로드할 수 있다. 메타 데이 터는 메모리를 관리하기 위한 데이터로서, 메모리에 저장되는 유저 데이터에 대한 관리 정보를 포함 할 수 있다. 한편, 펌웨어는 스토리지 장치가 생산되는 중 또는 스토리지 장치가 실행되는 중에 업데이트될 수 있 다. 컨트롤러는 스토리지 장치의 외부로부터 새로운 펌웨어를 다운로드하고, 기존 펌웨어를 새로운 펌웨어로 업데이트할 수 있다. 워킹 메모리는 컨트롤러를 구동하기 위해 필요한 펌웨어, 프로그램 코드, 커맨드 또는 데이터들을 저 장할 수 있다. 이러한 워킹 메모리는, 일 예로, 휘발성 메모리로서, SRAM (Static RAM), DRAM (Dynamic RAM) 및 SDRAM(Synchronous DRAM) 등 중 하나 이상을 포함할 수 있다. 에러 검출 및 정정 회로는 에러 정정 코드(Error Correction Code)를 이용하여 타겟 데이터의 에러 비트를 검출하고, 검출된 에러 비트를 정정할 수 있다. 여기서, 타겟 데이터는, 일 예로, 워킹 메모리에 저장된 데이터이거나, 메모리로부터 리드한 데이터 등일 수 있다. 에러 검출 및 정정 회로는 에러 정정 코드로 데이터를 디코딩하도록 구현될 수 있다. 에러 검출 및 정정 회로는 다양한 디코더(decoder)로 구현될 수 있다. 예를 들어, 비체계적 디코딩을 수행하는 디코더 또는 체계적 디코딩을 수행하는 디코더가 이용될 수 있다. 예를 들면, 에러 검출 및 정정 회로는 리드 데이터들 각각에 대해 설정된 섹터(Sector) 단위로 에러 비트 를 검출할 수 있다. 즉, 각각의 리드 데이터는 복수의 섹터(Sector)로 구성될 수 있다. 섹터(Sector)는 플래시 메모리의 읽기 단위인 페이지(Page)보다 더 작은 데이터 단위를 의미할 수 있다. 각각의 리드 데이터를 구성하 는 섹터들은 어드레스를 매개로 서로 대응될 수 있다. 에러 검출 및 정정 회로는 비트 에러율(Bit Error Rate, BER)을 산출하고, 섹터 단위로 정정 가능 여부를 판단할 수 있다. 에러 검출 및 정정 회로는 예를 들어, 비트 에러율(BER)이 설정된 기준값(reference value)보다 높은 경우 해당 섹터를 정정 불가능(Uncorrectable or Fail)으로 판단할 수 있다. 반면에, 비트 에 러율(BER)이 기준 값보다 낮은 경우 해당 섹터를 정정 가능(Correctable or Pass)으로 판단할 수 있다. 에러 검출 및 정정 회로는 모든 리드 데이터들에 대해 순차적으로 에러 검출 및 정정 동작을 수행할 수 있 다. 에러 검출 및 정정 회로는 리드 데이터에 포함된 섹터가 정정 가능한 경우 다음 리드 데이터에 대해서 는 해당 섹터에 대한 에러 검출 및 정정 동작을 생략할 수 있다. 이렇게 모든 리드 데이터들에 대한 에러 검출 및 정정 동작이 종료되면, 에러 검출 및 정정 회로는 마지막까지 정정 불가능으로 판단된 섹터를 검출할 수 있다. 정정 불가능한 것으로 판단된 섹터는 하나 또는 그 이상일 수 있다. 에러 검출 및 정정 회로는 정정 불가능으로 판단된 섹터에 대한 정보(ex. 어드레스 정보)를 프로세서로 전달할 수 있다. 버스는 컨트롤러의 구성 요소들(121, 122, 124, 125, 126) 사이의 채널(Channel)을 제공하도록 구성 될 수 있다. 이러한 버스는, 일 예로, 각종 제어 신호, 커맨드 등을 전달하기 위한 제어 버스와, 각종 데 이터를 전달하기 위한 데이터 버스 등을 포함할 수 있다. 한편, 컨트롤러의 전술한 구성 요소들(121, 122, 124, 125, 126) 중 일부의 구성 요소는 삭제되거나, 컨트 롤러의 전술한 구성 요소들(121, 122, 124, 125, 126) 중 몇몇 구성 요소들이 하나로 통합될 수 있다. 경 우에 따라, 컨트롤러의 전술한 구성 요소들 이외에 하나 이상의 다른 구성 요소가 추가될 수도 있다. 일 실시 예에 따라 본 발명에서는 앱(app) 또는 어플리케이션(application)의 실행에 따른 장치의 온도 상승분을 예측할 수 있는 온도 예측부가 더 추가될 수 있다. 도 2는 본 발명의 다양한 실시 예에 따라 컨트롤러에 추가적으로 구비되는 온도 예측부의 구성을 도시한 도면이 다. 일 실시 예에 따라, 온도 예측부는 소프트웨어 블록으로서 프로세서에 의하여 실행될 수 있고, 다른 일 실시 예에 따라, 프로세서와 별개의 코어 로직 또는 모듈로 구비될 수도 있다. 도 2를 참조하면 온도 예측부는 데이터 처리부 및 온도상승분 예측부를 포함할 수 있다. 온도상승분 예측부는 인공지능에 기반하여 앱 또는 어플리케이션을 실행시에 온도가 얼마나 상승할지를 예 측할 수 있다. 인공지능은 인공 신경망(artificial neural network, ANN) 모델을 기계 학습시켜 특정 일을 수행하도록 만든 시 스템이라 할 수 있다. 인공 신경망은 복수의 레이어로 구성되고 레이어와 레이어 사이의 노드 연결 패턴, 각 연 결에 적용되는 가중치 값들 및 출력 값을 생성하는 활성화 함수(activation function)에 의해 정의될 수 있다. 인공 신경망 구조로 입력 층, 출력 층, 그리고 하나 이상의 은닉 층을 포함하는 완전 연결된 인공 신경망(fully connected neural network, FCNN), 이미지, 동영상, 문자열과 같은 구조적 공간 데이터를 식별하는 데 효과적인 수 있는 합성 신경망(convolutional neural network, CNN) 등이 사용될 수 있고, 그 외에도 순환신경망 (recurrent neural network, RNN), LSTM(long short term memory network), GRU(gated recurrent units)등이 사용될 수 있다. 여기서 설명한 인공 신경망의 구조는 이미 공개되어 널리 알려진 것인 바 그 구체적인 구조에 대한 설명은 생략한다. 데이터 처리부는 온도상승분 예측부의 입력들을 생성하기 위하여 온도 예측부 외부로부터 수신 한 입력 파라미터들을 처리할 수 있다. 일 실시 예에 따라, 본 발명에서 제안하는 온도상승분 예측부의 인공신경망은 실시간 데이터를 이용하여 학습하도록 하였는 바, 데이터 처리부는 실제 동작하는 장치에서 수신한 입력 파라미터들을 처리하여 온도 상승분 예측부의 인공신경망의 학습을 위한 학습 데이터를 생성할 뿐만 아니라 또한, 온도상승분 예측부 의 인공신경망을 통해 온도 상승분을 예측하기 위한 입력들을 생성할 수도 있다. 실제 예측을 위한 입력 및 학습을 위한 입력은 동일하며, 다만, 학습 데이터는 지도 학습에 기인하는 바 실제 동작을 통해 획득한 온도상승분 데이터를 결과로써 함께 포함할 수 있다. 데이터 처리부에 입력되는 입력 파라미터들은, 현재 온도, 배터리 잔량, 현재 시각, 실행한 앱, 백그라운 드(background)에서 동작 중인 앱들의 사용 메모리, 실행한 앱의 사용 시간, 충전 중 여부를 포함할 수 있고, 추가적으로 온도상승분 예측부의 인공신경망의 학습 시의 출력으로 사용될 수 있는 해당 앱이 종료되었을 때의 온도 상승분을 포함할 수 있다. 일 실시 예에 따라, 상술 입력 파라미터들은 외부장치로부터 획득하거나 자체적으로 구비한 센서로부터 획 득할 수 있다. 도 3은 온도 예측부의 동작을 설명하는 흐름도이다. 도 3의 흐름도에 설명된 동작은 앱별로 독립적으로 수행될 수 있다. 이에 따라, 앱별로 별도의 인공신경망이 구 성되어 학습될 수 있다. 이하에서는 도 3을 설명함에 있어 하나의 앱에 대하여만 설명하나, 서로 상이한 앱에 대하여 동일하게 설명이 적용될 수 있다. 도 3을 참조하면 온도 예측부의 데이터 처리부는 동작 S310에서 학습을 위한 데이터를 수집할 수 있 다. 일 실시 예에 따라, 데이터 처리부는 앱의 사용 종료 시마다 학습을 위한 데이터를 수집할 수 있다. 예를 들면 데이터 처리부는 매 앱의 사용 종료 시마다 앱의 시작 시점에서의 장치의 온도, 배터리 잔량, 시각, 백그라운드(background)에서 동작 중인 앱들의 사용 메모리, 충전 중 여부에 대한 데이터를 수집할 수 있 고, 또한, 매 앱의 사용 종료 시 앱의 사용 시간 및 온도 상승분을 포함할 수 있다. 데이터 처리부가 수집 하는 데이터는 상술한 것에 한정되는 것은 아니며, 장치의 온도 상승에 영향을 미칠 수 있는 측정 가능한 어떤 파라미터도 입력 파라미터로 사용될 수 있다. 데이터 처리부는 데이터의 정규성을 확보하기 위하여 미리 설정된 개수 이상의 데이터가 확보되었을 때, 학습을 시작할 수 있다. 일 실시 예에 따라, 중심극한정리에 의하여 정규성을 만족시키기 위한 최소한의 데이터 세트의 개수는 30일 수 있다. 이에 따라, 데이터 처리부는 앱에 대해 30개 이상의 입력 파라미터 데이터 세트가 확보되었을 때, 해당 앱에 대한 온도 상승분 예측을 위한 인공신경망을 학습시킬 수 있다. 데이터 처리부는 30개 이상의 데이터가 확보되면, 동작 S320에서, 각 입력 파라미터와 온도 상승분 간의 상관관계 분석(예: 선형회귀분석)을 통해 상관계수를 확인하고, 상관계수의 절대값이 미리 설정된 값(예: 0.4) 보다 작은 입력 파라미터에 대하여는 온도 상승분과 상관관계가 없다고 판단하고, 예측을 위한 입력 데이터에서 배제하고, 온도 상승분과 상관관계가 있다고 판단되는 입력 파라미터만 예측을 위한 입력 데이터로 선택될 수있다. 본 발명에서는 인공 신경망의 입력을 미리 결정해 놓는 것이 아니라, 사용 가능한 다양한 파라미터 각각에 대하 여 온도 상승분과의 상관관계를 먼저 파악하여 상관관계가 있다고 판단되는 파라미터만 인공 신경망의 입력으로 사용하도록 할 수 있다. 데이터 처리부는, 동작 S330에서, 수집한 데이터를 이용하여 인공신경망을 학습시키고, 학습을 완료한 시 점에 학습된 인공신경망의 성능을 시험할 수 있다. 일 실시 예에 따라, 데이터 처리부는 수집한 데이터의 일부를 이용하여 인공신경망을 학습시키고, 수집한 데이터의 나머지를 이용하여 학습된 인공신경망을 시험할 수 있다. 예를 들면 수집한 데이터의 75%를 인공신경망 학습에 사용할 수 있고, 수집한 데이터의 나머지 25%를 학 습된 인공신경망을 시험하는데 사용할 수 있다. 데이터 처리부는, 동작 S340에서, 시험 결과, 학습된 인공신경망의 성능이 미리 설정된 제1 임계 값보다 크거나 같으면 학습된 인공신경망이 원하는 성능을 제공한다고 판단하여, 학습을 완료하고 동작 S370에서 온도 상승분 예측부는 학습된 인공신경망을 이용하여 온도 상승분을 예측할 수 있다. 이때 사용되는 입력은 데 이터 처리부로부터 수신할 수 있으며, 데이터 처리부는 수신한 입력 파라미터들 중에서 동작 S320에 서 배제된 입력 파라미터를 제외하고 나머지 온도 상승분과 상관관계가 있는 입력 파라미터를 온도상승분 예측 부로 전달할 수 있다. 데이터 처리부는, 동작 S340에서, 시험 결과 학습된 인공신경망의 성능이 미리 설정된 제1 임계 값보다 작 은 경우에는 동작 S350에서 학습 데이터 수집 횟수가 제2 임계 값보다 작은 지를 판단할 수 있다. 성능을 만족 하는 인공신경망을 획득하기 위하여 학습을 무한히 반복하는 것은 장치의 성능을 저하시킬 수 있기 때문에 학습 횟수를 미리 설정된 제2 임계 값(예: 10)으로 한정할 수 있다. 데이터 처리부는 동작 S350에서 학습 횟수가 미리 설정된 제2 임계 값보다 작으면 동작 S310에서 학습을 위한 데이터를 다시 수집할 수 있다. 이때 이전 학습에서 사용된 데이터는 폐기할 수도 있으나, 다른 일 실시 예에 따르면 이전 학습에서 사용된 데이터와 새로 수집한 데이터를 함께 사용하여 이후 학습을 수행할 수도 있 다. 데이터 처리부는 동작 S350에서 학습 횟수가 미리 설정된 제2 임계 값과 동일하거나 크다면 동작 S360에서 학습된 인공신경망의 성능이 제3 임계 값보다 크거나 같은지를 판단할 수 있다. 여기서 제3 임계 값은 제1 임계 값보다는 작은 값일 수 있다. 예를 들면 제1 임계 값은 0.9일수 있고, 제3 임계 값은 0.8일수 있다. 데이터 처리부는 동작 S360에서 학습된 인공신경망의 최종 성능이 제3 임계값보다 작다면, 성능을 만족하 는 학습된 인공신경망 확보에 실패하였다고 판단하여, 동작 S390에서, 해당 앱에 대한 인공신경망을 폐기하고 해당 앱에 대해서는 온도상승분 예측 동작을 수행하지 않도록 할 수 있다. 데이터 처리부는 동작 360에서 학습된 인공신경망의 최종 성능이 제3 임계값보다 크거나 같다면, 성능을 만족하는 학습된 인공신경망을 확보하였다고 판단하고, 동작 S370에서 온도상승분 예측부는 학습된 인공신 경망을 이용하여 온도 상승분을 예측할 수 있다. 즉, 온도상승분 예측부는 외부장치로부터 특정 앱이 시작됨을 수신하였을 때, 해당 앱에 대한 학습된 인공신경망을 이용하여 온도 상승분을 예측할 수 있다. 이후 동작 S380에서, 온도 예측부는 앱 시작 시에 온도상승분 예측부에 의해 예측된 온도 상승분과 장치의 현재 온도를 더하여 해당 앱이 실행되는 경우의 장치의 온도를 예측하고, 예측된 온도가 미리 설정된 온 도 이상이면 장치 온도를 낮추기 위한 정책을 실행할 수 있다. 장치 온도를 낮추기 위한 정책은 프로세서의 클럭 주기를 늘리거나 또는 메모리의 클럭 주기를 늘리 거나 또는 메모리에 포함되어 있는 복수의 다이 중에서 활성화된 다이의 개수를 줄이는 것일 수 있다. 상술한 바와 같이 도 3은 앱별로 수행될 수 있기 때문에, 앱별로 온도 상승분을 예측하기 위한 학습된 인공신경 망을 확보할 수 있고, 특정 앱 시작 시에 해당 앱에 대응하는 학습된 인공신경망을 이용하여 장치의 온도를 예 측하고, 예측 결과에 기초하여 장치의 온도를 낮추기 위한 정책을 실행할 수 있다. 이처럼 장치의 전체적인 성능을 줄이면서 장치 온도를 낮추는 것을 선제적으로 실행하여 SPO 발생 시와 같은 예 기치 못한 순간에 해당 정책이 실행되는 것을 방지하고, 장치 동작 측면에서 예기치 않은 치명적인 문제의 발생 을 억제할 수 있다. 또한, 본 발명은 스토리지 장치에서의 장치 온도 상승에 대한 선제적 대응을 위한 방안을 제안하였으나, 스토리 지 장치가 아닌 외부 장치, 특히 모바일 장치에 있어서도 동일한 개념이 적용되어 앱 시작 시 장치의 온도 상승 분을 예측하고, 장치의 현재 온도에 예측한 온도 상승분을 가산하여 앱이 실행될 때의 장치의 온도를 예측할 수 있다. 그리고 예측된 장치의 온도에 기초하여 장치의 온도를 낮추기 위한 선제적 대응을 할 수도 있다."}
{"patent_id": "10-2022-0150837", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예들에 따른 스토리지 장치의 개략적인 구성도이다. 도 2는 본 발명의 다양한 실시 예에 따라 컨트롤러에 추가적으로 구비되는 온도 예측부의 구성을 도시한 도면이 다. 도 3은 온도 예측부의 동작을 설명하는 흐름도이다."}
