{"patent_id": "10-2018-0079123", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0005765", "출원번호": "10-2018-0079123", "발명의 명칭": "차량 가속도 센서 측정을 통한 도로 상태 판별 방법 및 이를 이용한 도로 관리 시스템", "출원인": "박석준", "발명자": "박석준"}}
{"patent_id": "10-2018-0079123", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "차량 운행 중 발생한 가속도 센서 데이터를 위치 데이터와 연동하여 수집하는 단계, 수집된 가속도 센서 데이터 특성을 분석하여 해당 위치의 도로 상태를 판별하는 단계, 및판별된 도로 상태를 차량 또는 도로 관리 기관에 전송하는 단계를 포함하는, 도로 상태 판별을 통한 도로 관리방법."}
{"patent_id": "10-2018-0079123", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 상기 도로 상태를 판별하는 단계는, 가속도 센서 데이터의 패턴 학습을 통해 도로 노면 상태를 판별하는 것을포함하는, 도로 상태 판별을 통한 도로 관리 방법."}
{"patent_id": "10-2018-0079123", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 도로 상태를 판별하는 단계는, 가속도 센서 데이터의 xyz 가속도 패턴을 분석하여, 도로 노면 종류를 판별하는 것을 포함하는, 도로 상태 판별을 통한 도로 관리 방법."}
{"patent_id": "10-2018-0079123", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 판별된 도로 노면 종류는, 적어도 포트홀, 맨홀파손, 도로 요철, 노면 갈라짐, 비정상 과속방지턱, 및 곡선구간 도로 기울어짐 중 어느 하나로 판별되는 것을 특징으로 하는, 도로 상태 판별을 통한 도로 관리 방법."}
{"patent_id": "10-2018-0079123", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 3 항에 있어서,상기 판별된 도로 노면 상태를 자율 주행 차량의 보조 데이터로 제공하는, 도로 상태 판별을 통한 도로 관리 방법."}
{"patent_id": "10-2018-0079123", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 3 항에 있어서,상기 판별된 도로 노면 상태의 종류에 따라, 도로 시설물 관리 기관 또는 통제 기관에 선택적으로 제공하는, 도로 상태 판별을 통한 도로 관리 방법."}
{"patent_id": "10-2018-0079123", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2020-0005765-3-제 3 항에 있어서,상기 판별된 도로 노면 상태 및 도로 노면 종류를 연계된 지능형 교통형 시스템(C-ITS)에 제공하는, 도로 상태판별을 통한 도로 관리 방법."}
{"patent_id": "10-2018-0079123", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1 항에 있어서,상기 위치 데이터는 GPS로부터 수집하거나, 또는 차량내 모바일 기기의 지자기 센서로부터 수집하는 데이터 또는 이동통신 측위데이터 및 가상의 위치 포인트를 토대로 데이터 발생지점을 특정하고, 이 특정 좌표로 부터 발생하는 가속도의 패턴을 파악하는 것을 특징으로 하는, 도로 상태 판별을 통한 도로 관리 방법."}
{"patent_id": "10-2018-0079123", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "적어도 가속도 센서 데이터를 측정하는 센서, 차량 외부와 통신을 수행하는 통신수단,시각적 인식 가능한 화면을 제공하는 디스플레이, 및상기 동작을 제어하는 도로 상태 애플리케이션 프로그램을 포함하되, 상기 도로 상태 애플리케이션 프로그램의동작 실행에 의해, 상기 센서에서 측정된 가속도 센서 데이터를 주기적 또는 이벤트 발생시마다 외부 서버로 전송하고, 상기 외부 서버로부터 도로 노면 상태 정보를 수신하여, 상기 디스플레이 화면을 통해 시각적으로 제공하는, 도로 상태에 따른 운행 정보를 제공하는 모바일 기기."}
{"patent_id": "10-2018-0079123", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9 항에 있어서,상기 가속도 센서 데이터가 발생된 지점에 해당하는 위치 데이터를 확인하는 GPS 수단, 지자기 센서 데이터, 이동통신 측위데이터 및 가상의 위치 포인트를 더 포함하는, 도로 상태에 따른 운행 정보를 제공하는 모바일 기기."}
{"patent_id": "10-2018-0079123", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 9 항에 있어서,상기 가속도 센서 데이터가 발생된 지점에 해당하는 위치를 확인하기 위해 지자기 센서 데이터, 이동통신 측위데이터 및 가상의 위치포인트를 더 포함하는, 도로 상태에 따른 운행 정보를 제공하는 모바일 기기."}
{"patent_id": "10-2018-0079123", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 9 항에 있어서,상기 도로 상태 애플리케이션 프로그램은, 차량이 위험 도로 노면 상태에 접근하게 되면, 경고음을 발생하는 것을 특징으로 하는, 도로 상태에 따른 운행 정보를 제공하는 모바일 기기."}
{"patent_id": "10-2018-0079123", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 9 항에 있어서,상기 통신 수단은 상기 서버와 통신을 위해, 중계기를 통해 서버와 통신을 수행하는, 도로 상태에 따른 운행 정공개특허 10-2020-0005765-4-보를 제공하는 모바일 기기."}
{"patent_id": "10-2018-0079123", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "차량 운행 중 가속도 센서 데이터를 측정하고, 측정된 가속도 센서 데이터를 주기적 또는 이벤트 발생시마다 서버 장치로 전송하고, 상기 서버 장치로부터 도로 노면 상태 정보를 수신하여, 상기 디스플레이 화면을 통해 시각적으로 제공하는 차량 장치와, 상기 차량 장치로부터 가속도 센서 데이터를 위치 데이터와 연동하여 수집하고, 수집된 가속도 센서 데이터 특성을 분석하여 해당 위치의 도로 노면 상태를 판별하고, 판별된 도로 노면 상태를 해당 지역을 운행하는 불특정차량 또는 도로 관리 기관에 전송하는 서버 장치를 포함하는, 도로 상태 판별을 통한 도로 관리 시스템."}
{"patent_id": "10-2018-0079123", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 14 항에 있어서,상기 도로 관리 기관은, 적어도 지능형 교통 시스템(C-ITS) 센터, 경찰서 또는 소방서를 포함하는 도로 통제 기관, 및 도로 복구 센터 중 적어도 어느 하나를 포함하는 도로 상태 판별을 통한 도로 관리 시스템."}
{"patent_id": "10-2018-0079123", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 14 항에 있어서,상기 차량 장치는 자율 주행 차량을 포함하는, 도로 상태 판별을 통한 도로 관리 시스템."}
{"patent_id": "10-2018-0079123", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 차량 가속도 센서 측정을 통한 도로 상태 판별 방법 및 이를 이용한 도로 관리 시스템에 관한 것이다. 본 발명에 따른 도로 상태 판별을 통한 도로 관리 시스템은, 차량 운행 중 가속도 센서 데이터를 측정하고, 측정 된 가속도 센서 데이터를 주기적 또는 이벤트 발생시마다 서버 장치로 전송하고, 상기 서버 장치로부터 도로 노 면 상태 정보를 수신하여, 상기 디스플레이 화면을 통해 시각적으로 제공하는 차량 장치와, 상기 차량 장치로부 터 가속도 센서 데이터를 위치 데이터와 연동하여 수집하고, 수집된 가속도 센서 데이터 특성을 분석하여 해당 위치의 도로 노면 상태를 판별하고, 판별된 도로 노면 상태를 해당 지역을 운행하는 불특정 차량 또는 도로 관리 기관에 전송하는 서버 장치를 포함한다."}
{"patent_id": "10-2018-0079123", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 차량 가속도 센서 측정(VGM: VEHICLE G-SENSOR MEASURE)을 통한 도로 노면 상태 판별 방법 및 이를 이용한 도로 관리 시스템에 관한 것이다."}
{"patent_id": "10-2018-0079123", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "차량 운행 중 도로 이상 상태 또는 도로 노면 상태에 따라 위험에 노출되는 경우가 자주 발생한다. 이를 해결하 기 위해 예를 들어 도로 관리 센터(예, 한국도로공사 또는 지방 자치정부 도로정비과)는 주기적으로 도로 상태 를 확인하거나 또는 특정인의 신고 발생시 도로 이상 상태 또는 노면 상태를 확인하여, 이상 상태가 발생된 도 로를 정비하거나 위험 도로 노면을 긴급 복구하여 해당 위험을 제거하게 된다. 하지만, 상기와 같은 대응은 실 시간 도로 상태를 바로 반영하지 못하고 사후 후속 대응에 해당되어 효율적이지 못한 문제점이 있었다. 특히, 최근 자율 주행 차량이 개발되는 시점에서, 도로 노면 상태를 실시간으로 판별하여 자율 주행 차량에 제 공하는 것은 안전한 자율 주행을 위해 반드시 해결해야 되는 부분이기도 하다. 따라서, 최근 IT 및 통신 기술 발전을 차량에 접목하여, 실시간으로 도로 노면 상태를 판별하는 시스템이 무엇 보다 필요한 시점이라 할 것이다."}
{"patent_id": "10-2018-0079123", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 본 발명의 목적은, 전술한 종래 기술의 문제점을 해결하기 위해, 실시간 도로 관리 방법 및 도로 관리 시스템을 제공하는 데 있다. 또한, 본 발명의 목적은, 가속도 센서 데이터 측정을 통해 실시간 도로 노면 상태를 판별하는 도로 상태 판별 방법 및 장치를 제공하는 데 있다. 또한, 본 발명의 목적은, 차량 운행 중 가속도 센서 데이터를 센싱(sensing)한 후, 센싱된 가속도 데이터를 서 버에 전송하고, 서버로부터 도로 상태 정보를 수신하여 사용자에게 제공하는 차량 운행 보조용 모바일 기기를 제공하는 데 있다. 본 발명의 다른 목적 및 장점들은 하기의 설명에 의해서 이해될 수 있으며, 본 발명의 실시예에 의해 보다 분명 하게 알게 될 것이다. 또한, 본 발명의 목적 및 장점들은 특허청구범위에 나타낸 수단 및 그 조합에 의해 실현 될 수 있음을 쉽게 알 수 있을 것이다."}
{"patent_id": "10-2018-0079123", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위한, 도로 상태 판별을 통한 도로 관리 방법은, 차량 운행 중 발생한 가속도 센서 데이 터를 위치 데이터와 연동하여 수집하는 단계, 수집된 가속도 센서 데이터 특성을 분석하여 해당 위치의 도로 상 태를 판별하는 단계, 및 판별된 도로 상태를 차량 또는 도로 관리 기관에 전송하는 단계를 포함한다. 또한, 상기 도로 상태를 판별하는 단계는, 가속도 센서 데이터의 패턴 학습을 통해 도로 노면 상태를 판별하는 것을 포함할 수 있다. 또한, 상기 도로 상태를 판별하는 단계는, 가속도 센서 데이터의 xyz 가속도 패턴을 분석하여, 도로 노면 종류 를 판별하는 것을 포함할 수 있다. 또한, 상기 판별된 도로 노면 종류는, 적어도 포트 홀, 맨홀 파손, 도로 요철, 노면 갈라짐, 비정상 과속 방지 턱, 및 곡선구간 도로 기울어짐 중 어느 하나로 판별되는 것을 특징으로 한다. 또한, 상기 판별된 도로 노면 상태를 자율 주행 차량의 보조 데이터로 제공할 수 있다. 또한, 상기 판별된 도로 노면 상태의 종류에 따라, 도로 시설물 관리 기관 또는 통제 기관에 선택적으로 제공할 수 있다. 또한, 상기 판별된 도로 노면 상태 및 도로 노면 종류를 연계된 지능형 교통형 시스템(C-ITS)에 제공할 수 있다. 또한, 상기 위치 데이터는 GPS로부터 수집하거나, 또는 차량내 모바일 기기의 지자기 센서로부터 수집할 수 있 다. 특히, GPS가 동작되지 않는 구간에서는, 지자기 센서, 이동통신 기지국에서 측정된 위치(이하, 측위데이 터), 서버 또는 앱에서 연산된 가상의 위치 포인트를 보완적으로 활용할 수 있다. 또한, 본 발명에 따른, 도로 상태에 따른 운행 정보를 제공하는 모바일 기기는, 적어도 가속도 센서 데이터를 측정하는 센서, 차량 외부와 통신을 수행하는 통신수단, 시각적 인식 가능한 화면을 제공하는 디스플레이, 및 상기 동작을 제어하는 도로 상태 애플리케이션 프로그램을 포함하되, 상기 도로 상태 애플리케이션 프로그램의 동작 실행에 의해, 상기 센서에서 측정된 가속도 센서 데이터를 주기적 또는 이벤트 발생시마다 외부 서버로 전 송하고, 상기 외부 서버로부터 도로 노면 상태 정보를 수신하여, 상기 디스플레이 화면을 통해 시각적으로 제공 하는 것을 특징으로 한다. 또한, 상기 가속도 센서 데이터가 발생된 지점에 해당하는 위치 데이터를 확인하는 GPS 수단을 더 포함할 수 있 다. 또한, 상기 가속도 센서 데이터가 발생된 지점에 해당하는 위치를 확인하기 위해 지자기 센서로 측정된 데이터 와 이동통신 측위데이터 및 가상의 위치 포인트를 더 포함할 수 있다. 또한, 상기 도로 상태 애플리케이션 프로그램은, 차량이 위험 도로 노면 상태에 접근하게 되면, 경고음을 발생 하는 것을 특징으로 한다. 또한, 상기 통신 수단은 상기 서버와 통신을 위해, 중계기를 통해 서버와 통신을 수행할 수 있다. 또한, 도로 상태 판별을 통한 도로 관리 시스템은, 차량 운행 중 가속도 센서 데이터를 측정하고, 측정된 가속 도 센서 데이터를 주기적 또는 이벤트 발생시마다 서버 장치로 전송하고, 상기 서버 장치로부터 도로 노면 상태 정보를 수신하여, 상기 디스플레이 화면을 통해 시각적으로 제공하는 차량 장치와, 상기 차량 장치로부터 가속 도 센서 데이터를 위치 데이터와 연동하여 수집하고, 수집된 가속도 센서 데이터 특성을 분석하여 해당 위치의도로 노면 상태를 판별하고, 판별된 도로 노면 상태를 해당 지역을 운행하는 불특정 차량 또는 도로 관리 기관 에 전송하는 서버 장치를 포함한다. 또한, 상기 도로 관리 기관은, 적어도 지능형 교통 시스템(C-ITS) 센터, 경찰서 또는 소방서를 포함하는 도로 통제 기관, 및 도로 복구 센터 중 어느 하나를 포함할 수 있다. 또한, 상기 차량 장치는 자율 주행 차량을 포함 할 수 있다."}
{"patent_id": "10-2018-0079123", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따르면 실시간으로 도로 이상 상태 또는 도로 노면 상태를 판별하는 것이 가능하게 된다. 또한, 실시간 도로 노면 상태 정보를 C-ITS 센터, 경찰서 또는 도로 복구 센터에 제공하여 도로 노면 상태에 따 른 효율적 도로 관리가 가능하게 한다. 또한, 실시간 도로 노면 상태 정보를 운행 차량 또는 자율 주행 차량에 제공하여 위험 도로 노면 상태에도 안전 하게 차량 운행 또는 자율 주행을 가능하게 한다."}
{"patent_id": "10-2018-0079123", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 첨부한 도면을 참고로 하여 본 발명의 실시 예에 대하여 본 발명이 속하는 기술 분야에서 통상의 지 식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나, 본 발명은 여러 가지 상이한 형태로 구현 될 수 있으며 여기에서 설명하는 실시 예에 한정되지 않는다. 본 발명의 실시 예를 설명함에 있어서 공지 구성 또는 기능에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되는 경우에는 그에 대한 상세한 설명은 생략한다. 그리고, 도면에서 본 발명에 대한 설명과 관계없 는 부분은 생략하였으며, 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 본 발명에 있어서, 서로 구별되는 구성요소들은 각각의 특징을 명확하게 설명하기 위함이며, 구성요소들이 반드 시 분리되는 것을 의미하지는 않는다. 즉, 복수의 구성요소가 통합되어 하나의 하드웨어 또는 소프트웨어 단위 로 이루어질 수도 있고, 하나의 구성요소가 분산되어 복수의 하드웨어 또는 소프트웨어 단위로 이루어질 수도 있다. 따라서, 별도로 언급하지 않더라도 이와 같이 통합된 또는 분산된 실시 예도 본 발명의 범위에 포함된다. 본 발명에 있어서, 다양한 실시 예에서 설명하는 구성요소들이 반드시 필수적인 구성요소들은 의미하는 것은 아 니며, 일부는 선택적인 구성요소일 수 있다. 따라서, 일 실시 예에서 설명하는 구성요소들의 부분집합으로 구성 되는 실시 예도 본 발명의 범위에 포함된다. 또한, 다양한 실시 예에서 설명하는 구성요소들에 추가적으로 다른 구성요소를 포함하는 실시 예도 본 발명의 범위에 포함된다. 이하, 첨부한 도면을 참조하여 본 발명의 실시 예들에 대해서 설명한다. 도 1은 본 발명에 따른 도로 관리 전체 시스템을 도시한 것이다. 본 발명의 전체 시스템은, 도로 상을 운 행하는 차량들(101, 102) 및 상기 차량들과 통신하는 서버 및 중계기를 포함한다. 또한, 본 발명의전체 시스템은, 상기 서버로부터 비정상 도로 노면 상태(201, 202)에 따른 도로 관리 정보를 수신하는 지 능형 교통 시스템(C-ITS: Cooperative-Intelligent Transport System) 센터, 경찰서 또는 소방서를 포함 하는 정부 통제기간, 또는 도로 복구 센터를 포함한다. 상기 차량(101, 102)은 차량 운행 중 도로 노면 상태에 대한 데이터 측정이 가능한 센서(SENSOR) 및 외부와 통 신 가능한 통신 수단(GW)을 포함한다. 또한, 차량(101, 102)은 측정된 데이터 및 특정 프로그램을 저장하고 활 용하는 저장수단을 더 포함할 수 있다. 여기서, '차량 운행 중'의 의미는, 차량이 이동하고자 하거나, 이동 중 이거나, 정지하고자 하거나 정지된 상태로 차량 운행과 관련된 모든 상태를 포함한다. 또한, 상기 차량(101, 102)은 자율 주행차량이 될 수도 있으며, 이 경우 더욱 더 차량 운행에 대한 많은 정보를 필요로 하게 된다, 상 기 센서(SENSOR) 및 통신 수단(GW)은 차량(101, 102)내 일체로 구비된 기기이거나 또는 차량 운전자 또는 탑승 자가 소유한 모바일(mobile) 기기내의 구성일 수 있다. 관련하여, 본 발명에 따른 상기 차량(101, 102)내 장치 에 대한 상세한 설명은 도 3 및 도 4에서 상세히 후술하고자 한다. 상기 서버는 도로 교통 관리를 위한 어떠한 종류의 서버라도 모두 해당될 수 있다. 예를 들어, 차량 네비 게이션(navigation)을 지원하는 사설 운영 서버이거나, 또는 정부 관리 통제에 따른 중앙 관제 서버에 해당될 수 있으며, 본 발명은 특정 서버 운영 방식에 한정되지 않는다. 상기 서버는 차량(101, 102)으로부터 측정 된 데이터를 수집하여 분석하고, 분석된 결과를 해당 지역내의 모든 차량들 및/또는 관련 기관 (120, 130, 14 0)에 통보하여 도로 노면 상태에 따른 도로 관리를 가능하게 한다. 특히, 상기 서버는 수집된 데이터를 분 석함에 있어서, 인공 지능(AI)에 의한 빅데이터 학습이 가능하게 할 수 있으며, 이는 본 발명의 다양한 실시예 중 일 예에 해당된다. 상기 서버 동작에 대한 상세한 설명은 도 5에서 상세히 후술하고자 한다. 상기 중계기는 도로 측면에 구비될 수 있고, 상기 차량(101, 102)과 서버간의 데이터 통신을 중 계하는 기능을 수행한다. 단, 차량내 통신 기능에 따라서는 상기 중계기를 거치지 않고 서버와 직접 통신하는 것도 가능하다. 본 발명은 일 예로 광역 통신망(150, Wide Area Network)에 의한 통신 수행이 가능하 다. 상기 도로상에는 다양한 비정상 노면 상태(201, 202)가 존재하며, 예를 들어, 포트홀, 맨홀, 맨홀파손, 요 철, 과속방지턱 등이 이에 해당될 수 있다. 상기 비정상 노면 상태(201, 202)는 차량 운행에 치명적인 위험이 될 수 있으므로, 조기에 발견하여 제거하거나 또는 필요시 비위험 상태로 정비하는 것이 필요하다. 따라서, 본 발명은 상기 비정상 노면 상태(201, 202)의 발생을 감지함은 물론이거니와 비정상 노면 상태(201, 202)의 종류 (예, 포트홀, 맨홀, 맨홀파손, 요철, 과속방지턱 등)를 판별하고 후속 조치를 통해 도로 관리를 수행하는 도로 관리 방법 및 시스템을 제공하고자 한다. 도 2는 본 발명에 따른 도로 노면 상태 판별 및 도로 관리 방법에 대한 전체 흐름도를 개략적으로 도시한 것이다. 우선, 상기 차량(101, 102)들은 차량내 센서(SENSOR)로부터 차량 운행 중 가속도 센서 데이터를 측정하고, 측정된 가속도 센서 데이터를 서버로 전송한다. 또한, 상기 서버는, 상기 전송된 가속도 센서 데이터 특성을 분석하여 도로 상태를 판별하고, 판별된 도로 상태 정보를 차량 또는 관리 기관으로 전송한 다. 도 3은 본 발명에 따른 상기 차량내 장치 및 도로 상태 애플리케이션을 도시한 것이다. 예를 들어, 차량내 장치 및 도로 상태 애플리케이션은 차량 운전자 또는 탑승자의 모바일 기기에 해당될 수 있으나, 반드시 이에 한정되 는 것은 아니다. 도 3에 의한 본 발명에 따른 차량내 장치는, 위치데이터를 수신하고 확인하는 GPS, 적어도 가속도 센서 데 이터를 측정하는 센서, 상기 수신된 위치데이터 및 측정된 센서 데이터를 저장하는 메모리, 외부와 유무선 통신을 수행하는 통신수단, 사용자에게 시각적 화면을 제공하는 디스플레이 및 상기 동작을 처리하는 프로세서를 포함한다. 또한, 본 발명에 따른 차량내 장치는, 시스템OS와 별개로 상기 기기 의 동작을 제어하는 도로 상태 애플리케이션 프로그램을 포함한다. 여기서, 도 3에 의한 본 발명에 따른 차량내 장치는, 차량에 일체로 구비된 부속품이거나, 또는 차량 운전자 또 는 탑승자가 소지한 모바일 기기일 수 있다. 또는 상기 일부 구성 (예, GPS, 센서)은 차량내 구비된 장치이고, 일부 장치(예, 도로상태 애플리케이션, 통신수단, 디스플레이, 프로세서, 메모리)은 모바일 기기내의 구성일 수 있다. 즉, 도 3에 도시된 구성은 하나의 기기 내에 포함된 구성이거나, 또는 상이한 위치에 구성된 독립적 기기일 수 있다. 만약 도 3의 차량내 장치 구성 중 일부 또는 전부가 독립적 기기로 동작한다면, 상기 기기간에는 유선 통신 또는 근거리 무선통신망 (예를 들어, BlueTooth)에 의한 상호 통신이 가능한 상태로 연결됨을 의미한 다. 또한, 상기 도로 상태 애플리케이션은 상기 서버에서 제공하는 프로그램을 차량 운전자의 모바일 기 기 또는 차량내부 시스템에서 다운받아 저장한 상태로 동작하는 소프트웨어 기능일 수 있다. 예를 들어, 차량 운전자 또는 탑승자의 모바일 기기(예, 휴대폰)내 네비게이션(Navigation) 응용 프로그램이 상기 도로 상태 애 플리케이션으로 활용될 수 있다. 또한, 상기 센서는, 차량의 9축 센서 (가속도, 각속도, 지자기)를 센싱할 수 있다. 이하, 본 발명의 설명 의 편의를 위해, 상기 센서로부터 측정된 데이터를 'xyz 가속도 센서 데이터' 또는 '가속도 센서 데이터' 또는 '가속도 데이터'로 일반화하여 명명하고자 한다. 단, 이는 본 발명의 설명의 편의를 위한 것으로, 상기 명 명된 센서 데이터 외에도 차량의 움직임에 따라 발생하는 모든 센싱 데이터를 활용할 수 있음은 자명하다. 관련하여, 상기 센서는, 차량 운전자 또는 탑승자의 모바일 기기(예, 휴대폰)내 지자기 센서를 포함할 수 있다. 특히 지자기 센서를 통해, 지자기 센서 측정값을 수집하여, 상기 GPS 데이터 수집이 불가능한 구간 (예, 터널 구간 등)에서도, 상기 지자기 센서 측정값을 활용하여 도로상의 기준점을 설정하는 데 활용할 수 있 다. 또한, GPS가 도심 빌딩 밀집지역을 통과할 때 발생하는 오동작 상황 (예를 들어, 빌딩에 반사된 GPS 전파 로 인하여 실제 좌표가 아닌 좌표를 획득하게 됨) 에서도, 상기 지자기 센서 측정값을 활용하거나, 이동통신 측 위데이터 및 가상의 위치 포인트를 이용하여 도로상의 기준점을 설정하는 데 활용할 수 있다. 구체적으로, 예를 들어, 터널 구간에 진입하기 전인 터널 진입 구간에서는 상기 GPS와 지자기 센서에 의한 지자 기 좌표 또는 이동통신 측위데이터 및 가상의 위치 포인트를 모두 활용하여 위치를 설정한다. 또한, GPS 수신이 불가한 터널 구간에서는 상기 지자기 센서에 의한 지자기 좌표만을 활용하여 위치를 설정할 수 있다. 또한, 터 널 구간을 통과하여 터널 진출 구간에서는 상기 GPS와 지자기 센서에 의한 지자기 좌표를 모두 활용하여 위치를 설정하는 것이 가능하다. 관련하여, 상기 가상의 위치 포인트를 상세히 설명하면 다음과 같다. 상기 가상의 위치 포인트는 차량이 이동한 경로를 네비게이션 앱의 도로 좌표로부터 상기 가속도 센서에서 측정된 데이터를 토대로 유추하는 포인트를 의 미한다. 예를 들어, 상기 가속도 센서는 부착되어 있으나, 상기 지자기 센서 혹은 상기 GPS가 부착되지 않은 이 동통신 단말기 혹은 통신장치가 설치된 차량이 이동한 경로를 네비게이션 앱의 도로 좌표로부터 상기 가속도 센 서에서 측정된 데이터를 토대로 유추하여 가상의 위치 포인트를 설정하게 된다. 상기 가상의 위치 포인트는 상 기 차량내 센서 고장이나 데이터가 오염된 경우에도 적용 가능하다. 도 7은 상기 가상의 위치 포인트를 설명하기 위해 도시한 것이다. 예를 들어, 도로 시설물을 통과하는 차량이 진입 단계에서는 횡가속센서(Y방향)는 '0'의 값을 가진다. 이후, 핸들을 좌측으로 돌려 차선을 4차선에서 1차선 으로 변경하는 경우, Y(+) 방향의 가속도가 발생하고, 일정 목표(예를 들어, 1차선 혹은 3,2,1 차선 순차이동) 에 도달하면, 반대방향인 Y(-) 방향의 가속도가 발생하여 최종 Y로 진출하게 된다. 상기와 같은 상황에서 네 비게이션 도로 좌표와 측정된 가속도 변화값으로 차량의 이동 지점들을 연산하여 가상의 위치 포인트를 획득하 는 것이 가능하게 된다. 상기 가상의 위치 포인트는 모바일 기기에서 유추할 수도 있으며, 또는 서버에서 유추 할 수도 있다. 특히, 최근 지능형 교통 시스템(C-ITS)에서는, 도로를 분류하고 관리하는 대상을 링크(Link) 또는 노드(Node)로 구분하여 관리하고 있다. 따라서, 상기 본 발명의 가상의 위치 포인트는, 단순히 기준이 되는 지점을 관측하는 것에 그치지 않고, 상기 지능형 교통 시스템(C-ITS)의 링크(Link) 개념을 조금 더 세분화하여 관리하는 것을 가 능하게 한다. 예를 들어, 도 8을 참조하면, 도로내 각 차선과 위치 포인트의 조합에 의해 도로를 세분화하는 것이 가능하다. 구체적으로, 4차선 도로의 각 차선을 y축으로 하고, 기 결정된 특정 간격의 위치 포인트를 x 축으로 하여, 세분 할 수 있다. 예를 들어, (1, 0) 포인트는 1차선 0 포인트 위치를 의미하고, (2, 0) 포인트는 2차선 0 포인트 위 치를 의미하고, (4, N) 포인트는 4차선 N 포인트 위치를 의미하는 것으로 정의할 수 있다. 단, 도 8의 상기 좌 표는 설명의 편의를 위해 도시한 것일 뿐, 다른 좌표를 정의하는 것도 가능하다. 예를 들어, (0, 1) 포인트는 1 차선 0 포인트 위치를 의미하고, (0, 2) 포인트는 2차선 0 포인트 위치를 의미하고, (N, 4) 포인트는 4차선 N 포인트 위치를 의미하는 것으로 정의할 수 있다.도 4는 본 발명에 따른 상기 도로 상태 애플리케이션의 동작을 구체적으로 도시한 것이다. 상기 도로 상태 애플리케이션의 동작은 상기 센서 및 GPS로부터 측정된 데이터를 서버로 전송하 는 제1 과정들(411, 412, 413)과, 상기 서버로부터 도로 노면 상태 정보를 수신하여 사용자(또는 운전자) 에게 제공하는 제2 과정들(421, 422, 423)로 각각 구성된다. 우선, 상기 제1 과정들(411, 412, 413)에 의한 동작을 설명하면 다음과 같다. 도로 상태 애플리케이션의 동작이 시작되면, 상기 센서로부터 xyz 가속도 센서 데이터를 주기적(T1) 및/또는 이벤트 발생시마다 측정한 다 또한, 상기 GPS로부터 상기 가속도 센서 데이터 측정 위치에 해당하는 GPS 데이터를 확인한다 . 단, 상기 서버내에 차량과 연동되는 GPS가 구비되는 경우에는 별도의 위치 데이터를 상기 서버 로 전송하지 않아도 되며, 이 경우에는 상기 서버에서 가속도 데이터를 수신한 시점에 연동되는 GPS 위치를 자동으로 위치데이터로 활용하는 것이 가능하다. 이하 본 발명에서는 편의상 위치데이터를 별도로 전송 하는 경우에 대해 설명하지만 위치 데이터는 상기 서버에서도 발생될 수 있음을 밝혀둔다. 구체적으로, 상기 센서에 의한 가속도 데이터 수집 단계에 대해 도 6을 참조하여 설명하고자 한다. 우선 상기 속도 그래프 시작(Start) 지점으로부터 종료(Goal) 지점까지 이동함에 있어서 가속 구간 , 등속 구간, 감속 구간을 통과하며, 운전자의 운전습관 (예를 들어, 급출발, 급제동, 급차선 변경 등)을 포함한, 통과 지점 (GPS Point로 연결된 이동구간) 구간별 xyz 가속도 데이터를 수집한다. 도 6의 그래프를 참고하면, x-가속도 그래프는 차량 진행 방향에서 발생하는 가속도의 변화 패턴이며, y-가속도 그래프는 차량 진행 방향에서 좌우 진동 방향으로 발생하는 가속도의 변화 패턴이며, z-가속도 그래프는 차량 진행 방향에서 상하 진동 방향으로 발생하는 가속도의 변화 패턴을 의미한다. 여기서, 가속도 데이터는 기설정된 측정 주기(T1)마다 수집하거나 또는 특정 이상 상태 발생시(이를 '이벤트 (event) 발생시'로 명한다) 에 수집하게 된다. 따라서, 상기 센서는 항상 동작 가능한 상태로 유지되어 센 싱 동작을 수행하되, 상기 기결정된 측정 주기(T1)가 도래하거나 또는 이벤트 발생시에는 측정 데이터를 메모리 에 저장하게 된다. 상기 측정 주기(T1)는 예를 들어, 수 초(second) 간격으로 설정될 수 있으며, 이는 상기 도로 상태 애플리케이 션의 초기 동작 설정 과정에서 사용자에 의해 수동 설정되거나 또는 시스템에 의해 자동(default) 설정되 는 것이 가능하다. 구체적으로, 도로 노면 상태에 이상이 없다고 판정할 수 있을 정도의 통계적 정상 패턴이 확보된 상태에서, 특 정 지점을 통과하는 차량의 가속도 상태를 보면, 예를 들어 Z(상하) 방향의 가속도에서 (-)로 급격히 감소 한 후 안정화 패턴을 보이고 있음을 알 수 있다. 따라서, 이러한 특이 데이터 발생시를 '이벤트 발생시'로 정의하고 측정된 데이터를 저장하고, 이후 서버로 전송하게 된다. 또한, 상기 측정된 xyz 가속도 센서 데이터와 함께 해당 측정 시점의 GPS 위치데이터를 함께 확인하는 것이 필 요하다. 여기서 GPS 위치데이터는 가장 정밀한 수준으로 측정하는 것이 유용하며, 현재 다양한 GPS 기술에 의해 미터(m) 단위 이내의 위치 측정이 용이한 상태이다. 이후, 상기 411 단계에서 측정된 가속도 센서 데이터와 해당 위치의 GPS 데이터를 메모리에 저장할 수 있다 . 단 상기 412 저장 단계는, 상기 측정 주기(T1)와 후술할 전송 주기(T2)가 상이한 경우에만 적용하고, 그 외 경우에는 생략하는 것도 가능하다. 또한, 기결정된 전송 주기(T2) 또는 상기 이벤트 발생시마다 측정된 가속도 센서 데이터와 GPS 데이터를 서버 로 전송한다. 상기 전송 주기(T2)는 예를 들어, 수 초(second) 간격으로 설정될 수 있으며, 전술한 측정 주기(T1)보다는 긴 주기로 설정할 수 있다. 또한, 측정 주기(T1) 설정과 마찬가지로, 상기 전송 주기(T2) 는 상기 도로 상태 애플리케이션의 초기 동작 설정 과정에서 사용자에 의해 수동 설정되거나 또는 시스템 에 의해 자동(default) 설정되는 것이 가능하다. 다음으로, 상기 제2 과정들(421, 422, 423)에 의한 동작을 설명하면 다음과 같다. 도로 상태 애플리케이션의 동 작이 시작되면, 상기 서버 또는 상기 중계기로부터 차량 운행 지역의 도로 노면 상태 정보를 수 신한다. 이후 수신된 도로 노면 상태 정보를 이용하여 상기 디스플레이 화면에 도로 노면 상태를 시각적으로 표시 한다. 또한, 상기 수신된 도로 노면 상태 정보에 의해 전송된 위험 도로 노면 상태로 차량이 접근시 경고를 발생시킨 다. 여기서, 경고는 상기 디스플레이 화면에 시각적인 경고 문구로 표시하거나 또는 별도로 차량내 또는 모바일 기기의 오디오 장치를 통해 경고음 (또는 경고방송)을 송출하는 것도 가능하다. 따라서, 상기 차량 운전자는 차량 운행 중, 운행 지역의 도로 노면 상태에 대한 정보를 수시로 수신할 수 있게 되고, 이를 운전에 반영함에 따라, 더욱 안전한 운행이 가능하게 된다. 또한, 자율 운행 차량의 경우에도, 상기 421 단계를 통해 수신된 도로 노면 상태 정보를 자율 주행 시스템에 바로 반영하여 해당 노면 상태 통과시 속도 를 줄이거나 우회하는 등의 안전 운행을 수행하는 것이 가능하게 된다. 도 5는 본 발명에 따른 도로 노면 상태 판별 및 도로 관리 방법에 대한 서버의 동작을 흐름도로 도시한 것 이다. 우선, 상기 서버는 도로 주행중인 차량(201, 202) 또는 중계기로부터, 도로 노면 상태를 표시하는 xyz가속도 센서 데이터를 GPS 연동된 도로 구간별로 수집한다. 이후 특정 도로 지점에서 연속적 또는 다발적으로 발생하는 xyz 가속도 센서 데이터의 패턴을 학습하고, 데이터 패턴 학습을 통해 최종 도로 상태를 판별한다. 즉, 상기 520 학습 단계 및 상기 530 판별 단계를 반복적으로 수행함에 따라 더욱 신뢰성 있는 도로 노면 이상 유무 및 위험 노면 종류 등을 판별하는 것이 가능 하게 된다. 구체적으로, 상기 단계 520에서, 수집된 데이터 패턴을 학습하는 과정을 설명하면 다음과 같다. 예를 들어, 전 술한 도 6을 참조하면, 상기 특정 지점에서 발생한 xyz 가속도 데이터, 특히 z방향 가속도 데이터로 부터, 상기 서버는 차량을 지면 방향으로 낙하시키는 힘이 작용하였다가 통과한 후 차량의 가속도 위상이 복원되는 특성으로 부터, 도로 노면에 '홀(hole)'이 발생한 것으로 추정하며, 이 데이터의 패턴은 학습을 통해 규모가 작은 '포트홀'을 통과하는 차량의 가속 패턴으로 판단할 수 있게 된다. 즉, 상기 서버는 모든 차량 에서 수집되는 빅데이터를 인공지능에 의한 상기 520단계 패턴 학습을 반복하므로 신뢰성 있는 데이터 판별이 가능하게 된다. 또한, 구체적으로, 상기 단계 530에서, 데이터 패턴 학습을 통해 노면 상태 및 노면 종류를 판별하는 과정을 설 명하면 다음과 같다. 예를 들어, Z 가속도 하강(-)방향 발생하고, 통과 후 안정화 패턴이 발생하는 경우에는, '포트홀'로 판별할 수 있다. 또한, Z 가속도 하강(-)방향 발생하고, 안정화 패턴 중 반대로(+) 패턴 발생한 겨우, 맨홀 주변에 파손된 노면이 차량을 하강 시키지만, 금속 부위 통과시 차량을 상승시키는 경우로 '맨홀 파손' 상태로 판별할 수 있다. 여기서 '맨홀 파손'은 단순 '노면홀(구멍)' 보다 더욱 위험한 노면 상태를 의미하며, 즉각적인 도로 관리 응급 처치에 활용될 수 있다. 또한, 예를 들어, '도로 요철' 상태는, Y 방향(이동방향의 측면)으로 가장 크게 작용하고, Z(상하)방향 작용 패 턴을 주로 보인다. 따라서, 대형 차량이 자주 다니는 산업화 도로에 발생한 요철상태 (기차레일과 유사)에 승용 차와 같은 소형 차량의 타이어가 홈을 통과하며 발생하는 패턴 경우에 판별할 수 있다. 또한, 예를 들어, '노면 갈라짐 (거북등)' 상태는, 포장 도로임에도 불구하고, 특정 구간을 통과하는 차량에게 서 비포장도로 패턴이 발생되고, 시간이 경과할 수록 비포장도로 패턴이 커지게 되는 경우에 판별할 수 있다. 또한, 예를 들어, '비정상 과속방지턱' 상태는, 정상 과속 방지턱을 정상 속도로 통과하는 데이터를 수집하고 이 속도와 동일하지만, 다른 Z 방향 패턴으로 검출되는 경우에 판별할 수 있다. 또한, 예를 들어, '곡선구간 도로 기울어짐 과부족' 상태는, 곡선도로를 통과하는 속도에 맞추어 노면의 기울어 짐이 확보되어 있어야 하지만, 통과속도보다 기울어짐이 심하게 시공된 도로는 Y(횡방향) 이상 패턴이 발생하여 검출되는 경우에 판별할 수 있다. 또한, 상기 노면 종류외에도, 인력에 의하여 구분된 데이터를 AI의 이상 상태 검출용 학습데이터로 활용하여 다 양한 노면 상태를 판별하는 데 활용하는 것이 가능하다. 이후, 상기 단계 520 및 단계 530을 통해, 도로 노면 상태의 이상이 확인되면, 이를 본 발명에서 제시하는 다양한 목적에 따라 활용하는 것이 가능하다. 예를 들어, 상기 서버는 상기 판별된 노면 이상 상태 정보를 지능형 교통 시스템 (C-ITS) 센터에 제 공할 수 있다. 관련하여, 상기 C-ITS 연계시는 C-ITS 표준 프로토콜을 준수하여 실행한다. 따라서, C-ITS 센터에 의해, 노면 이상 상태 검지된 위치를 운행하는 자율 주행 차량에게 노면 상태 정보를 제공하는 것 도 가능하다. 또는 상기 서버는 상기 C-ITS 센터를 거치치 않고, 중계기를 통해 또는 직접 차량 내 통신 수단과 접속하여 상기 도로 노면 상태 및 노면 종류에 대한 정보를 제공하는 것도 가능하다. 전술 한 바와 같이, 상기 차량내 도로 상태 애플리케이션이 설치된 경우에는, 설치된 프로그램의 동작에 따라 상기 정보를 제공하는 것이 가능하다. 단, 본 발명은 이에 한정되지 않으며, 상기 도로 상태 애플리케이션(31 1)의 설치와 상관없이, 상기 서버는 통신 수단을 구비한 모든 차량에 차량 노면 상태 정보를 제공할 수도 있다. 또한, 상기 서버는, 상기 판별된 노면 이상 상태 정보를 C-ITS 센터뿐만 아니라 경찰서 또는 소방서 와 같은 정부 통제 기관에 제공할 수 있다. 예를 들어, 동일 구간을 통과하는 차량들의 이동 패턴 분 석으로 사고가 검출되면 (예, 중부고속도로 하행 45km 지점을 통과하는 10대의 차량이 첫번째 차량으로부터 10 번째 또는 그보다 적은 차량까지 X방향 감속 감지 후 가속 패턴이 없을 경우 사고 알람을 C-ITS 및 정부 통제 기관에 통지하여, 신속한 사고 발생 처리를 가능케 한다. 또한, 상기 판별된 노면 이상 상태 정보를 C-ITS 센터뿐만 아니라 도로 복구센터에 제공할 수 있다 . 예를 들어, 상기 서버는 도로 노면에 파손된 '맨홀'이 판별되면, 이를 즉각 해당 도로의 도로 정비 를 관리하는 정부 또는 지방 자치 단체에 통보하여 즉각적인 도로 복구 조치를 가능하게 할 수 있다. 또한 상기 서버는 도로기상정보 시스템 (RWIS)과 연계된 상태에서, 예를 들어 영상 4도 이하 (노면 결빙 가능 기온) 정보를 취득 후, 동일 지점을 통과하는 차량 5대중 2대 (40% 확률)가 Y방향(횡축)으로 비정상(Irregular) 데이 터 발생시 노면 결빙 의심 지점으로 판별하고, 이를 즉각 해당 도로의 도로 정비를 관리하는 정부 또는 지방 자 치 단체에 통보하여 즉각적인 도로 복구 조치를 가능하게 할 수 있다. 또한, 본 발명의 또 다른 활용 방안으로, 상습 안개지역 통과시 선행 차량의 감속 상황을 후행 차량에 알려 동 일 구간을 통과하는 차량들에게 통지하는 것이 가능하다. 예를 들어, 동일 구간을 통과하는 차량들의 군집성 이 동 상황에서 선행하는 차량의 감속 상태를 C-ITS 시스템을 거치지 않고, 즉시 통지함으로 사고를 미연에 방지 하는 효과가 있다. 본 개시의 다양한 실시 예는 모든 가능한 조합을 나열한 것이 아니고 본 개시의 대표적인 양상을 설명하기 위한 것이며, 다양한 실시 예에서 설명하는 사항들은 독립적으로 적용되거나 또는 둘 이상의 조합으로 적용될 수도 있다. 또한, 본 개시의 다양한 실시 예는 하드웨어, 펌웨어(firmware), 소프트웨어, 또는 그들의 결합 등에 의해 구현 될 수 있다. 하드웨어에 의한 구현의 경우, 하나 또는 그 이상의 ASICs(Application Specific Integrated Circuits), DSPs(Digital Signal Processors), DSPDs(Digital Signal Processing Devices), PLDs(Programmable Logic Devices), FPGAs(Field Programmable Gate Arrays), 범용 프로세서(general processor), 컨트롤러, 마이크로 컨트롤러, 마이크로 프로세서 등에 의해 구현될 수 있다. 본 개시의 범위는 다양한 실시 예의 방법에 따른 동작이 장치 또는 컴퓨터 상에서 실행되도록 하는 소프트웨어 또는 머신-실행 가능한 명령들(예를 들어, 운영체제, 애플리케이션, 펌웨어(firmware), 프로그램 등), 및 이러 한 소프트웨어 또는 명령 등이 저장되어 장치 또는 컴퓨터 상에서 실행 가능한 비-일시적 컴퓨터-판독가능 매체 (non-transitory computer-readable medium)를 포함한다."}
{"patent_id": "10-2018-0079123", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이상에서 설명한 본 발명은, 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 있어 본 발명의 기술적 사상을 벗어나지 않는 범위 내에서 여러 가지 치환, 변형 및 변경이 가능하므로, 본 발명의 범위는 전술한 실시 예 및 첨부된 도면에 의해 한정되는 것이 아니다. 부호의 설명도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8"}
{"patent_id": "10-2018-0079123", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 도로 관리 전체 시스템을 도시한 것이다. 도 2는 본 발명에 따른 도로 노면 상태 판별 및 도로 관리 방법에 대한 흐름도를 도시한 것이다. 도 3은 본 발명에 따른 차량내 장치 및 도로 상태 애플리케이션을 도시한 것이다. 도 4는 본 발명에 따른 도로 상태 애플리케이션의 동작을 구체적으로 도시한 것이다. 도 5는 본 발명에 따른 도로 노면 상태 판별 및 도로 관리 방법에 대한 서버의 동작을 흐름도로 도시한 것이다. 도 6은 본 발명에 따른 가속도 센서 데이터의 일 예를 도시한 것이다. 도 7 및 도 8은 본 발명에 따른 가상의 위치 포인트를 설명하기 위해 도시한 것이다."}
