{"patent_id": "10-2021-0117735", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0034685", "출원번호": "10-2021-0117735", "발명의 명칭": "항산화 활성을 위한 해죽순의 추출 조건 최적화 및 그로부터 유래된 항산화 물질", "출원인": "경북대학교 산학협력단", "발명자": "이상한"}}
{"patent_id": "10-2021-0117735", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "해죽순 추출물의 항산화 활성을 높이기 위해 추출 조건을 최적화하는 방법으로서, 반응표면분석법(RSM) 모델 및 인공신경망(ANN) 모델 중 하나 이상을 이용하여 추출 용매, 추출 시간, 및 추출온도의 조합에 따른 테스트 추출 조건에서 항산화 활성을 예측하는 단계, 및예측된 항산화 활성이 대조군이나 기준 항산화 활성보다 높은 추출 조건을 시료의 최적화된 추출 조건으로 선택하는 단계를 포함하는 것인 방법."}
{"patent_id": "10-2021-0117735", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 상기 최적화된 추출 조건으로 선택하는 단계는 예측된 항산화 활성이 대조군이나 기준 항산화 활성보다 높은 추출 조건에서 시료의 추출물을 수득하고, 수득된 추출물의 항산화 활성을 측정하여, 예측된항상화 활성과 비교하는 단계를 더 포함하는 것인 방법."}
{"patent_id": "10-2021-0117735", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서, 상기 항산화 활성을 예측하는 단계는 인공신경망(ANN) 모델에 의해 수행되고, 상기 인공신경망 모델은 추출 용매, 추출 시간 및 추출 온도를 입력층으로 하고, 항산화 활성을 나타내는DPPH(1,1-diphenyl-2-picrylhydrazyl) 라디칼 소거 활성, CUPRAC(cupric ion reducing antioxidantcapacity), FRAP(ferric reducing antioxidant power), TPC(total phenolic contents), 및 TFC(total flavoncontents)를 출력층으로 하는 것인 방법."}
{"patent_id": "10-2021-0117735", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서, 상기 항산화 활성은 DPPH, CUPRAC, FRAP, TPC, 및 TFC 중 하나 이상인 것인 방법."}
{"patent_id": "10-2021-0117735", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서, 상기 테스트 추출 조건은 추출 용매, 에탄올 0 내지 100%, 추출 시간 6 내지 24시간, 및 추출 온도 40 내지 60℃의 조합인 것인 방법."}
{"patent_id": "10-2021-0117735", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 5에 있어서, 해죽순의 최적화된 추출 조건은 에탄올 50% 내지 65%로 50℃ 내지 57℃에서 15시간 내지 22시간 동안 추출하는 것인 방법."}
{"patent_id": "10-2021-0117735", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 1 내지 6 중 어느 한 항에 방법에 의해 최적화된 추출 조건에서 해죽순 추출물을 제조하는 방법으로서,분쇄한 건조 해죽순에 50% 내지 65% 에탄올 수용액을 첨가하고, 50℃ 내지 57℃에서 15시간 내지 22시간 동안진탕시키면서 추출하는 단계를 포함하는 것인 방법."}
{"patent_id": "10-2021-0117735", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 7에 있어서, 상기 추출하는 단계는 65% 에탄올로 57℃에서 22시간 동안 진탕시키면서 수행되는 것인 방법."}
{"patent_id": "10-2021-0117735", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 7의 방법에 의해 수득된 해죽순 추출물로부터 분리된 화합물로서, 5-히드록시-코니페릴 알코올(5-hydroxy-conilferyl-alcohol), 카페오일티라민(caffeoyltyramine), 호페아놀 B(hopeanol B), 탁시폴린 7,4'-디메틸 에테르(taxifolin 7,4'-dimethyl ether), 3,7-디히드록시-3',4'-디메톡시플라본(3,7-dihydroxy-3',4'-공개특허 10-2023-0034685-3-dimethoxyflavone), 및 8-데메틸티모닌(8-Demethylthymonin)으로부터 선택되고, 항산화능이 높은 화합물."}
{"patent_id": "10-2021-0117735", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 9의 화합물을 포함하는 항산화용 조성물."}
{"patent_id": "10-2021-0117735", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 9의 화합물을 포함하는 항산화용 건강 보조 식품."}
{"patent_id": "10-2021-0117735", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "해죽순 추출물의 항산화능을 개선하기 위해 RSM(Response Surface Methodology) 및 ANN(Artificial Neural Network)을 이용하여 해죽순의 추출 조건을 최적화하는 방법 및 그로부터 유래된 항산화 물질에 관한 것이다. 구 체적으로, 항산화능이 높은 해죽순 추출물을 얻도록 최적화한 추출 조건에서 해죽순 추출물을 제조하는 방법, 그 에 의해 수득된 해죽순 추출물, 및 해죽순 추출물로부터 분리된 높은 항산화능을 갖는 물질 및 그의 용도에 관한 것이다."}
{"patent_id": "10-2021-0117735", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "해죽순 추출물의 항산화능을 개선하기 위해 RSM(Response Surface Methodology) 및 ANN(Artificial Neural Network)을 이용하여 해죽순의 추출 조건을 최적화하는 방법 및 그로부터 유래된 항산화 물질에 관한 것이다. 구체적으로, 항산화능이 높은 해죽순 추출물을 얻도록 최적화한 추출 조건에서 해죽순 추출물을 제조하는 방법, 그에 의해 수득된 해죽순 추출물, 및 해죽순 추출물로부터 분리된 높은 항산화능을 갖는 물질 및 그의 용도에 관한 것이다."}
{"patent_id": "10-2021-0117735", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "해죽순(Nypa fruticans Wurmb.: NF)은 인도, 말레이시아, 인도네시아, 필리핀, 미안마 등에 널리 분포되어 있는 식물로서, 상대적으로 이용 측면에서 덜 개발된 식물이다. 전통적으로 해죽순의 다양한 부분들이 천식, 결핵, 인후염, 간질환, 진통 등을 위해 사용되었다. 다수의 연구에서 해죽순은 항산화, 항통증, 항염증, 항암, 및 항 당뇨 등 다양한 생리 활성을 갖는 것으로 보고되었다(Nutrients 2020, 12, 135). 또한, 파이토케미칼 분석에서 해죽순에 포함된 프로토카테추산, 카테킨, 클로로겐산, 에피카테킨, 캠페롤, 등이 밝혀졌다. 추출은 식물체로부터 생활성 화합물의 단리, 정제 및 확인을 위한 필수적인 요소 중 하나이다. 추출용매, 온도 및 시간 등과 같은 추출 조건에 따라 그 효율 및 추출 성분 등이 영향을 받는다. 일반적으로 다양한 유기 용매 나 열수 등을 이용하여 추출이 이루어지나, 추출 대상 성분의 함유량이나 안정성 등을 고려하여 최적화를 통해 추출 수율을 증가시킬 수 있다. 추출 조건에 따른 추출 수율이나 조성의 차이가 크다. 따라서, 원하는 성분을 높은 수율로 효과적으로 얻기 위해 추출 원료에 따른 최적의 추출 조건을 확립하는 것이 요구된다. 추출 조건의 최적화는 추출 조건을 구성하는 다양한 인자들 또는 그들의 조합을 변화시키면서 그에 따른 추출 수율/성분의 변화를 확인하는 반복적 단계들을 포함한다. 그러나, 추출 원료가 풍부하지 않거나, 비싼 경우, 시간과 비용을 고려하여 효과적으로 추출 조건을 최적화할 수 있는 방법이 필요하다. 이에, 본 발명자들은 해죽순과 같은 식물체를 포함한 시료로부터 항산화능이 높은 추출물을 제조하기 위해 추출 조건을 최적화하는 방법에 대한 연구를 수행하여 본 발명을 완성하였다. 선행기술문헌 특허문헌 (특허문헌 0001) KR 102121944 B1"}
{"patent_id": "10-2021-0117735", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 해죽순 추출물의 항산화 활성을 높이기 위해 추출 조건을 최적화하는 방법을 제공하는 것을 목적으로 한다. 본 발명은 또한 최적화된 조건에서 해죽순 추출물을 제조하는 방법을 제공하는 것을 목적으로 한다. 본 발명은 또한, 최적화된 추출 조건에서 수득된 해죽순 추출물로부터 분리된, 항산화능이 높은 화합물을 제공 하는 것을 목적으로 한다. 본 발명은 또한, 항산화능이 높은 화합물을 포함하는, 항산화용 조성물을 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2021-0117735", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 양태는 해죽순 추출물의 항산화 활성을 높이기 위해 추출 조건을 최적화하는 방법으로서, 반응표면분석법(RSM) 모델 및 인공신경망(ANN) 모델 중 하나 이상을 이용하여 추출 용매, 추출 시간, 및 추출 온도의 조합에 따른 테스트 추출 조건에서 항산화 활성을 예측하는 단계, 및 예측된 항산화 활성이 대조군이나 기준 항산화 활성보다 높은 추출 조건을 시료의 최적화된 추출 조건으로 선택 하는 단계를 포함하는 것인 방법을 제공한다. 본 명세서에서 사용된, 용어 \"최적화\"는 목적 활성이나 효과를 최대화하는 조건을 선택하거나 정의하는 것을 의 미하며, 예를 들면, 추출물의 항산화 활성을 최대화하는 추출 조건을 선택하는 것일 수 있다. 일반적으로 최적 화는 목적 활성이나 효과에 영향을 미치는 인자 또는 인자들의 조합을 변화시키면서 그에 따른 활성이나 효과를 측정하여 원하는 수준의 활성이나 효과를 가져오는 인자 또는 인자들의 조합을 찾는 반복적인 실험을 포함하는 과정이다. 보다 효율적으로 최적화를 수행하기 위해 통계 분석에 기반한 모델링 또는 그와 인 실리코 실험을 조 합한 방법등이 활용되고 있다. 본 명세서에서 사용된, 용어 \"반응표면분석법(RSM)\" 모델은 임의의 변수의 범위를 설정하여 결과값을 예측하고, 이를 통해 원하는 결과값을 얻을 수 있도록 하는 변수의 수준을 최적화 하는 통계 분석법을 의미한다 본 명세서에서 사용된, 용어 \"인공신경망(ANN)\" 모델은 인간이나 동물이 가지고 있는 생물학적인 뇌의 신경세포 를 모델화하여 인공적인 지능을 만드는 것으로서 신경망을 구성하는 많은 변수들이 최적이 되도록 변수의 값을 조금씩 변경시켜가는 최적화 과정을 의미한다. 본 발명의 일 구체예에서, 상기 최적화된 추출 조건으로 선택하는 단계는 예측된 항산화 활성이 대조군이나 기 준 항산화 활성보다 높은 추출 조건에서 시료의 추출물을 수득하고, 수득된 추출물의 항산화 활성을 측정하여, 예측된 항상화 활성과 비교하는 단계를 더 포함할 수 있다. 본 명세서에서 사용된, 용어 \"대조군\"은 최적화되기 전의 추출 조건에서 수득된 추출물을 의미한다. 본 명세서에서 사용된, 용어 \"기준 항산화 활성\"은 항산화 활성의 증가나 개선 여부를 판단하기 위한 기준이 되 는 항산화 활성을 의미하며, 최적화의 목표를 고려하여 당업자에 의해 정의될 수 있다. 본 발명의 일 구체예에서, 상기 항산화 활성을 예측하는 단계는 인공신경망(ANN) 모델에 의해 수행되고, 상기 인공신경망 모델은 추출 용매, 추출 시간 및 추출 온도를 입력층으로 하고, 항산화 활성을 나타내는 DPPH(1,1-diphenyl-2-picrylhydrazyl) 라디칼 소거 활성, CUPRAC(cupric ion reducing antioxidant capacity), FRAP(ferric reducing antioxidant power), TPC(total phenolic contents), 및 TFC(total flavon contents)를 출력층으로 하는 것일 수 있다. 본 발명의 일 구체예에서, 상기 항산화 활성은 DPPH (1,1-Diphenyl-2-picrylhydrazyl) 라디칼 소거 활성, CUPRAC(Curpic Ion Reducing Antioxidant Capacity), FRAP (Ferric-Reducing Antioxidant Power), TPC(Total Phenolic Contents), 및 TFC (Total Flavonoid Contents) 중 하나 이상일 수 있다. 본 발명의 일 구체예에서, 상기 테스트 추출 조건은 추출 용매, 에탄올 0 내지 100%, 추출 시간 6 내지 24시간, 및 추출 온도 40 내지 60℃의 조합일 수 있다. 본 발명의 일 구체예에서, 해죽순의 최적화된 추출 조건은 에탄올 50% 내지 65%로 50℃ 내지 57℃에서 15시간 내지 22시간 동안 추출하는 것일 수 있다. 본 발명의 일 구체예에서, 최적화된 추출 조건은 에탄올 50%로 50℃에서 15시간 동안 추출하는 것일 수 있다. 본 발명의 일 구체예에서, 최적화된 추출 조건은 에탄올 65%로 57℃에서 22시간 동안 추출하는 것일 수 있다. 본 발명의 또 다른 양태는 본 발명의 일 구체예에 따른 추출물의 항산화 활성을 높이기 위해 시료의 추출 조건 을 최적화하는 방법에 의해 최적화된 추출 조건에서 해죽순 추출물을 제조하는 방법으로서, 50% 내지 65% 에탄 올 수용액을 첨가하고, 50℃ 내지 57℃에서 15시간 내지 22시간 동안 진탕시키면서 추출하는 단계를 포함하는 것인 방법을 제조한다. 본 발명의 일 구체예에서, 상기 추출하는 단계는 65% 에탄올로 57℃에서 22시간 동안 진탕시키면서 수행되는 것 일 수 있다. 본 발명의 일 구체예에서, 상기 방법은 해죽순 추출물을 여과지를 통해 여과시키고, 농축한 후 동결건조시키는 단계를 더 포함할 수 있다. 본 발명의 일 구체예에 따른, 항산화 활성을 높이기 위해 최적화된 추출 조건에서 수득된 해죽순 추출물에 포함 된 물질들을 분리하고 LC-MS/MS를 이용하여 동정하여, 피세아탄놀(Piceatannol), 오리엔탈론(Orientalone), 스 테레빈 A(Sterebin A), 캠페롤 7-글로코시드, 트릴로비논(Trilobinone), 펙톨리나리게닌(Pectolinarigenin), 움벨리페론(Umbelliferone), 및 벤조퀴논 아세트산(Benzoquinone acetic acid)의 함량이 높고, 5-히드록시-코 니페릴 알코올(5-hydroxy-conilferyl-alcohol), 카페오일티라민(caffeoyltyramine), 호페아놀 B(hopeanol B), 탁시폴린 7,4'-디메틸 에테르(taxifolin 7,4'-dimethyl ether), 3,7-디히드록시-3',4'-디메톡시플라본(3,7- dihydroxy-3',4'-dimethoxyflavone), 및 8-데메틸티모닌(8-Demethylthymonin)과 같은 신규한 화합물이 포함된 것으로 확인되었다. 본 발명의 또 다른 양태는, 항산화 활성에 대해 최적화된 추출 조건에서 수득된 해죽순 추출물로부터 분리된 화 합물로서, 5-히드록시-코니페릴 알코올(5-hydroxy-conilferyl-alcohol), 카페오일티라민(caffeoyltyramine), 호페아놀 B(hopeanol B), 탁시폴린 7,4'-디메틸 에테르(taxifolin 7,4'-dimethyl ether), 3,7-디히드록시- 3',4'-디메톡시플라본(3,7-dihydroxy-3',4'-dimethoxyflavone), 및 8-데메틸티모닌으로부터 선택되고, 항산화 능이 높은 화합물을 제공한다. 본 발명의 또 다른 양태는 항산화능에 대해 최적화된 조건에서 추출된 해죽순 추출물로부터 분리된, 항산화능이 높은 화합물을 포함하는, 항산화용 조성물을 제공한다. 본 발명의 일 구체예에서, 상기 항산화능이 높은 화합물은 피세아탄놀(Piceatannol), 오리엔탈론(Orientalone), 스테레빈 A(Sterebin A), 캠페롤 7-글로코시드, 트릴로비논(Trilobinone), 펙톨리나리게닌(Pectolinarigenin), 움벨리페론(Umbelliferone), 벤조퀴논 아세트산, 5-히드록시-코니페릴 알코올(5-hydroxy-conilferyl-alcohol), 카페오일티라민(caffeoyltyramine), 호페아놀 B(hopeanol B), 탁시폴린 7,4'-디메틸 에테르(taxifolin 7,4'- dimethyl ether), 3,7-디히드록시-3',4'-디메톡시플라본(3,7-dihydroxy-3',4'-dimethoxyflavone), 및 8-데메틸 티모닌로 구성된 군으로부터 선택된 하나 이상일 수 있다. 본 발명의 일 구체예에서, 상기 항산화용 조성물은 의약 용도, 미용 용도, 건강 기능성 식품으로 이용될 수 있 다. 본 발명의 일 구체예에서, 상기 항산화용 조성물은 항산화 효과에 의해 개선되거나 치료될 수 있는 질환의 치료 또는 예방용 약학적 조성물일 수 있고, 상기 화합물 외에, 항산화능을 갖는 다른 화합물이나 약제와 조합되어 사용될 수 있다. 본 발명의 일 구체예에서, 상기 항산화용 조성물은 피부 노화의 예방 또는 개선을 위한 미용 조성물일 수 있다. 본 발명의 일 구체예에서, 상기 항산화용 조성물은 대사증후군의 예방을 위한 건강 기능성 식품 또는 건강 보조 식품일 수 있다. 본 발명의 일 구체예에 따른 항산화용 조성물은 적합한 제형으로 제형화될 수 있고, 통상적으로 당해 기술 분야 에서 이용되는 부형제, 첨가제, 등을 포함할 수 있다."}
{"patent_id": "10-2021-0117735", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일구체예에 따른 해죽순 추출물의 항산화 활성을 높이기 위해 시료의 추출 조건을 최적화하는 방법을 이용하여 해죽순의 추출 조건을 효율적으로 최적화할 수 있고, 그에 의해 항산화 활성이 높은 추출물 및 그에 포함된 화합물을 고수율로 제조할 수 있다."}
{"patent_id": "10-2021-0117735", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 하기에 상세하게 기재되는 실시예를 참조하면 명확해질 것이다. 그러나, 본 발명은 실시예에 한정되 는 것이 아니라 다양한 형태로 구현될 것이며, 본 실시예는 단지 본 발명의 개시가 완전하도록 하며, 본 발명이"}
{"patent_id": "10-2021-0117735", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "속하는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항에 의해 정의된다. 실시예 1. 해죽순 추출물의 추출 조건의 최적화 항산화 활성을 갖는 것으로 알려진 해죽순 추출물의 항산화 활성을 높이기 위해 추출 조건을 최적화하였다. 추 출물의 수율/조성에 영향을 미치는 인자들, 예를 들면, 추출 용매의 종류 및 농도, 추출 시간 및 추출 온도를 변화시키면서 그에 따른 추출물의 항산화 활성 및/또는 수율을 측정하는 것에 의해 최적 추출 조건을 찾을 수 있다. 그러나, 본 실시예에서는 최소한의 실험을 통해 최대의 효과를 얻기 위해 실험계획법에 따라 에탄올을 추 출 용매로 사용하여 항산화 활성이 높은 추출물을 얻기 위한 실험을 계획하고, 통계적 분석을 통해 최적의 실험 조건을 찾는 최적화를 수행하였다. 해죽순 추출물을 에탄올을 이용하여 추출하는 방법에서 에탄올의 농도, 추출 시간 및 온도의 조합을 하기와 같 이 지정하고, 그에 반응표면분석법(RSM) 및 인공신경망(ANN)을 적용하였다. 1-1. RSM 모델링 반응표면분석법(Response Surface Methodology: RSM)은 임의의 변수의 범위를 설정하여 결과값을 예측하고, 이 를 통해 원하는 결과값을 얻을 수 있도록 하는 변수의 수준을 최적화 하는 통계 분석법이다. Design Expert 11 프로그램을 사용하여 해죽순의 추출에 영향을 미치는 추출 용매, 온도 및 시간의 조합으로 15가지의 추출조건을 잡고 서로 다른 변수의 수준에 따라 변화하는 반응값을 3차원 표면 형성을 통해 시각적으로 확인했다. 선별 시험을 통해 반응값에 영향을 줄 것이라고 생각되는 인자들 중 주요 인자들을 선별하고 반응표면분석에서 형성된 모델의 유의성을 확인하고, 최적화된 조건을 통하여 실제 실험 수행 후 예상되는 반응값과 실제 실험 결 과값을 비교하였다. 구체적으로, 추출 인자들의 최적 조건을 선정하기 위해, 에탄올 농도, 추출 시간 및 온도를 포함한 해죽순에 대한 다양한 추출 과정 파라미터를 BBD(Box-Behnken design) (Design Expert Software, version 11; Stat-Ease Inc., Minneapolis, MN, USA)를 이용하여 최적화하였다. 0 내지 100 %의 에탄올 농도 (X1), 6 내지 24 시간의 시간 (X2) 및 40 내지 60℃의 온도에서 추출 조건을 설정하였다. 독립 변수, 코드 (code) 및 수준(level)이 표 1에 표시된다. 3개의 독립 변수 및 DPPH (1,1-Diphenyl-2-picrylhydrazyl) 라디칼 소거 활성, CUPRAC(radical scavenging activity, cupric ion reducing antioxidant capacity), FRAP(ferric reducing antioxidant power), TPC(total phenolic contents), 및 TFC(total flavonoid contents)의 5개의 종 속 변수(반응)를 확립하는 본 연구의 효율성 및 적합성 때문에, CCD(Central composite design)가 아닌 BBD(Box-Behnken design)를 선택했다. 피팅 모델(fitting model)의 통계적 유의성 및 각 항을 분석하기 위해, ANOVA(analysis of variance)를 수행하였다. 도 1의 3D 표면 플롯에 반응값에 대한 각 변수의 교호(interaction) 효과가 도시된다. 최종적으로, 최적화된 추출 조건 및 각 반응값을 확립하였다. 2차 다항 모델이 하기 식에 의해 표현된다:"}
{"patent_id": "10-2021-0117735", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "식 중에서, Y는 독립적 반응(X1-X3)에 대한 종속 변수를 나타내고; b0, bi, bii, 및 bij는 절편, 선형, 이차 및 교 호 항에 대한 상수 계수(constant coefficient)이다. 1-2. ANN 모델링 인공신경망(Artificial Neuron Network: ANN)은 인간이나 동물이 가지고 있는 생물학적인 뇌의 신경세포를 모델 화하여 인공적인 지능을 만드는 것으로서 신경망을 구성하는 많은 변수들이 최적이 되도록 변수의 값을 조금씩 변경시켜가는 최적화 과정을 의미한다. 본 실시예에서는, ANN을 이용하여 하기 표 1에 기재된 바와 같은 입력 변수(X1, X2, X3) 와 출력 반응(Y1, Y2, Y3, Y4) 간의 비선형적 상관관계를 결정하였다. 독립변수와 종속변수의 예측을 위해, MLP(multilayer perceptron), BPFF(back propagation feed forward) 모델을 이용하여 비-선형적 분석을 수행하였다. 높은 정확 도를 달성하기 위해 ANN 아키텍쳐에서 층 중 뉴런의 개수와 층의 개수를 최적화하였다. ANN 모델의 3층 기본 아 키텍쳐(MPL)은 3개의 독립 변수, X1, X2, X3 (에탄올 농도, 추출 시간 및 추출 온도) 및 4개의 종속 변수 Y1, Y2, Y3, Y4, Y5 (DPPH, CUPRAC, FRAP, TPC, TFC)를 포함했고, 그 개략도가 도 2에 표시된다. RSM 모델 및 ANN 모델의 개발을 위해 실험 데이터를 이용하였다. ANN 모델링에서, 각 뉴런은 독립 변수의 가중 치 합(weight sum)에 의해 생성된 출력 신호를 이용하여 활성화되었다. 히트 앤 트라이얼(Hit and trial) 방법 을 이용하여 은닉층에서 예측 결과치와 실험 결과치 간의 오류를 최소화하였다. ANN 모델은 70% 네트워크 훈련 (11 포인트) 및 30% 네트워크 시험(4 포인트)을 이용하여 개발하였다. MATLAB의 Neural Network Toolbox™을 이용하여 Feed-forward ANN 모델의 MLP 아키텍쳐를 개발하였다 (Journal of hydrology 2013, 476, 433-441.). 최고 R2 및 최저 RMSE 값이 ANN 모델의 개발을 위한 최상의 훈련 성능을 나타냈다. 표 1"}
{"patent_id": "10-2021-0117735", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "1-3. 항산화 활성 측정 DPPH (1,1-Diphenyl-2-picrylhydrazyl) 라디칼 소거 활성 해죽순(NF)의 DPPH 라디칼 소거 활성을 이전에 보고된 방법(LWT-Food science and Technology 1995, 28, 25-"}
{"patent_id": "10-2021-0117735", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "30)을 이용하여 평가하였다. 요약하면, 2 ㎕의 각 시료와 198 ㎕의 DPPH 용액을 광이 차단된 암 조건에서 10분 동안 혼합하고 595 nm에서 흡과도를 측정하였다. CUPRAC(Curpic Ion Reducing Antioxidant Capacity) 통상적으로 사용되는 방법 (Analytical methods 2011, 3, 2439-2453)에 따라 CUPRAC 분석을 수행하였다. 24.5 mL의 DW를 10 mM CuCl2 (250 ㎕)와 혼합하고 75 mM 네오큐프로인 (250 ㎕)을 메탄올에 용해시켜 빛이 차단된 상 태로 CUPRAC 용액을 수득하였다. 2 ㎕의 시료와 198 ㎕의 CURPAC 용액을 반응시키고, 건조 오븐에서 20분 동안 인큐베이션한 후에 450 nm에서 흡광도를 측정하였다. FRAP (Ferric-Reducing Antioxidant Power) 이전에 보고된 방법(Food Chemistry 2005, 90, 133-139)에 따라, 각 시료에 대해 철 환원력을 측정했다. TPTZ(tripyridyltyrazine) (10 mM), FeCl3 (20 mM), 및 소디움 아세테이트 완충액을 혼합하여 FRAP 시약 (1:1:10, v/v/v)을 제조하였다. 시료 및 양성 대조군으로 사용된 아스코르브산 (2 ㎕)을 FRAP 스톡 용액과 혼합 하고, 520 nm의 파장에서 흡광도를 측정했다. TPC 및 TFC의 측정 총 페놀 함량(TPC)을 이전에 보고된 Folin-Ciocalteu 비색법(American journal of Enology and Viticulture"}
{"patent_id": "10-2021-0117735", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "1965, 16, 144-158)을 약간 변형하여 측정하였다. 요약하면, DW (20 ㎕) 중 NF와 갈산 (2 ㎕)을 2 M Folin- Ciocalteu 페놀 시약 (10 ㎕)과 혼합하였다. 6분의 인큐베이션 후에, 100 ㎕ 의 Na2Co3 용액과 70 ㎕의 증류수 를 첨가하여 90분 동안 인큐베이션시키고, 반응액을 595 nm에서 측정했다. 총 플라보노이드 함량 (TFC)은 이전에 보고된 방법(Food chemistry 1999, 64, 555-559)을 약간 변형하여 측 정하였다. 2 ㎕의 각 시료와 카테킨을 100 ㎕의 증류수와 혼합하고 5 ㎕의 5% NaNO2와 10분 동안 인큐베이션시 켰다. 10 ㎕의 10 % AlCl3 6H2O를 첨가하고 10분 동안 인큐베이션하고, 1M NaOH (40 ㎕) 및 증류수 (45 ㎕)를 실온에서 첨가하였다. 혼합물의 흡광도를 마이크로플레이트 판독기를 이용하여 405 nm에서 기록하였다. 갈산과 카테킨을 표준으로 이용하였고, TPC 및 TFC는 각각 시료의 그람 당 갈산 및 카테킨 등가물의 mg으로 표현하였다. PCA(Principal Component Analysis) 모든 항산화 분석 (DPPH, CUPRAC, FRAP, TPC, 및 TFC)에 대해 Minitab 18 소프트웨어를 이용하여 주성분 분석 (PCA)를 수행하였다. 1-4. 검증 해죽순의 열수 추출의 독립변수 영향에 따른 종속변수 (DPPH, CUPRAC, FRAP, TPC, TFC)의 변화를 반응표면분석 및 인공신경망의 두 가지 모델링 접근법으로 예측하였다. 두 가지 모델링 접근법의 비교 결과, ANN 모델은 통계 적 평가에 기초하여 RSM 모델보다 우위에 있는 것으로 확인되었다. ANN 모델은 R2가 높고 절대평균편차 및 평균 제곱근오차 값이 낮았다. RSM 모델에서, DPPH, CUPRAC, FRAP, TPC 및 TFC에 대한 적합결여(lack of fit) 값은 각각 유의하지 않음을 나 타내는 0.05보다 높은, 0.0694, 0.8829, 0.0551, 및 0.2015였고, 이에 의해 모델이 유효하고 적합했다. 또한, ANOVA에서 모든 반응 변수들에 대한 F값은 0.2096-35.76이었다. 결정 계수(coefficient of determination) R2 은 80% 이상이어서 우수한 피팅을 보였고, R2과 조정 R2이 DPPH, CUPRAC, FRAP, TPC, 및 TFC에 대해 각각, 0.9954 및 0.9871, 0.9829 및 0.9520, 0.9965 및 0.9901, 0.9954 및 0.9871, 및 0.9984 및 0.9955로 그 차이가 크지 않고, 모두 1에 가까워서, 예측값과 실험값 간의 우수한 상관관계를 나타냈다. DPPH와 CUPRAC의 경우는 50% 에탄올, 15시간의 추출 시간, 및 50℃의 추출 온도에서 가장 높은 활성을 보였고, FRAP의 경우는 50% 에탄올, 15시간의 추출 시간, 및 60℃의 추출 온도에서 가장 높은 활성을 보였다. 최고 TPC는 50% 에탄올, 24시간의 추출 시간, 및 40℃의 추출 온도의 추출 조건이었고, 최고 TFC는 50% 에탄올, 15시간의 추출 시간, 및 50℃의 추출 온도이었다. 이에 따른 RSM 모델은 하기와 같았다. Y1 (DPPH) = 7.88 + 0.6630X1 + 0.3557X2 + 0.0832X3 - 1.42X12 - 0.7604X22 - 0.5782X32 - 0.0895X1X2 + 0.0718X1X3 - 0.0480X2X3 Y2 (CUPRAC) = 6.38 + 0.4849X1 + 0.1587X2 + 0.1084X3 - 1.15X12 - 0.0474X22 - 0.0083X32 + 0.0050X1X2 + 0.0039X1X3 - 0.1646X2X3 Y3 (FRAP) = 6.77 + 0.7978X1 + 0.2067X2 + 0.2129X3 - 1.10X12 + 0.0835X22 - 0.2384X32 - 0.0106X1X2 - 0.1880X1X3 - 0.1497X2X3 Y4 (TPC) = 11.81 + 0.8137X1 + 0.4055X2 + 0.1318X3 -2.39X12 - 0.0845X22 - 0.2146X32 - 0.0994X1X2 - 0.1528X1X3 - 0.3407X2X3 Y5 (TFC) = 12.89 + 0.8682X1 + 0.2962X2 + 0.3362X3 - 2.37X12 - 0.6701X22 - 0.3704X32 + 0.4652X1X2 - 0.8018X1X3 + 0.0804X2X3 도 1은 각 변수의 반응과 실험 인자 간의 교호를 보여주는 3D 반응표면 플롯이다. 대부분의 결과가 타원형이어 서 모델의 적합성을 보여주었다. 하기 표 2는 RSM 모델에 대한 ANOVA의 결과를 보여준다. 표 2"}
{"patent_id": "10-2021-0117735", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "유의성 수준: a p < 0.001; b p < 0.01; c p < 0.05; d p > 0.05. X1 = 에탄올 농도 (%), X2 = 추출 시간 (hr), X3 = 추출 온도(℃) DPPH 분석 결과, 에탄올농도 (X1)와 추출시간 (X2) 은 DPPH 라디칼 소거능에 유의적이었으나, 추출온도 (X3)는 영향을 미치지 않았으며 2차(quadratic) 영향은 모든 변수에서 유의적으로 나타났다. CUPRAC 분석 결과, DPPH 분석 결과와 마찬가지로 에탄올농도 (X1)와 추출시간 (X2) 은 DPPH 라디칼 소거능에 유의적이었으나, 추출온도 (X3)는 영향을 미치지 않았으며 2차 영향에서는 에탄올농도 (X1)만 유의적이었다. 또한, FRAP 분석 결과, 모든 변수에서 유의적이였으나 각 변수들 간의 상호작용은 FRAP 분석에 영향을 주지 않았으며, TPC 결과, 에탄올농도 (X1)와 추출시간 (X2) 은 DPPH 라디칼 소거능에 유의적이었으나, 추출온도 (X3)는 유의적이지 않았으며 2차 함수 와 상호작용에서 모두 영향을 주지 않는 것으로 나타났다. TFC 결과, 선형과 2차 영향에 모두 유의적이였으며, 추출시간과 추출온도에서 두 변수간의 상호작용이 나타났다.적합 결여 검증 (lack of fit) 결과, 모든 실험에서 0.05보다 낮은 값을 나타내어 설계된 반응모형이 완전한 것으로 간주되며, 결정계수 (R2)가 각각 0.9954, 0.9829, 0.9965, 0.9954, 0.9984로 1에 가까운 값을 나타내었고, Adj.R2 값과 R2 값의 차이가 크지 않는 것으로 보아, 가정된 반응 모형이 적합한 것으로 판단된다. ANN 모델은 전달 함수(transfer function)를 입력층에서 이용하지 않았고, 출력층 및 은닉층에서 활성화 함수로 각각 purelin(pure line) 및 transig(tangent sigmoid transfer)을 이용하였다. 15개의 실험 조건 중 70%는 네 트워크 훈련에 이용하고 4개는 네트워크 시험에 이용하였다. 최적 위상(optimum topology)을 위해, 시험과 훈 련 간 최소 오차를 계산하고, 에포크의 개수도 오버-피팅 모델을 제거하기 위해 최소치로 한정하였다. 네트워크 훈련을 위해 Levenberg-Marquardt 알고리즘을 사용했고, 모든 종속 변수 DPPH Y1, CUPRAC Y2, FRAP Y3, TPC Y4, and TFC Y5 에 대해 최적 검증 성능을 달성했다. 도 3에 결과가 도시된다. 훈련된 ANN 모델에서 R2 값은 RSM에 비해 높았고, 이는 모든 4개의 종속 변수의 예측에 있어서, ANN 모델이 RSM 보다 탁월하다는 것을 나타낸다. ANN 모델의 훈련 후에 수득된 예측값이 표 1에 기재된다. 해죽순의 최적 추출 조건은 Design Expert Software를 이용하여 바람직성(desirability)을 최대화하는 것에 확 립하였다. 최고의 항산화 활성, TPC, 및 TFC는 57.6%의 에탄올 농도, 19시간의 추출 시간, 및 51.3℃의 추출 온 도에서 수득되었다. 이 최적 조건에서, 각각 62.5%의 DPPH 라디칼 소거 활성, 41.95 μM의 아스코르브산 당량의 CUPRAC, 48.39 μM의 아스코르브산 당량의 FRAP, 143.59 mg/GAE,및 166.84 mg/CAE가 예측되었다. 본 실시예의 결과는 RSM 및 ANN 모델을 이용하여 항산화 활성이 개선된 해죽순 추출물을 제조하는 추출 조건의 최적화를 효율적으로 수행할 수 있다는 것을 보여준다. 검증에서, DPPH, CUPRAC, FRAP, TPC, 및 TFC에 대해 높 은 R2 및 R2 Adj이 수득되어, 이 모델들이 정확하고 신뢰될 수 있다는 것을 시사했다. 또한, PCA 분석은 각 항산화 분석법 간에 높은 관련성(relevance)이 있다는 것을 보여주었다. 실시예 2. 해죽순 추출물의 프로파일링 실시예 1에서 최적화된 해죽순의 추출 방법을 이용하여 수득된 해죽순 추출물에 함유되어 있는 물질들을 LC- MS/MS를 이용하여 동정하였다. LC-MS/MS Q-Exactive Orbitrap 질량 분석기(Thermo Fisher Scientific INC., San Jose, CA, USA)를 이용하여 네거티브- 모드 ESI-MS 실험을 수행하였다. 15 ㎕/분으로 ESI 소스를 통과한 시료를 500 ㎕ 눈금 시린지 (Hamilton Company Inc., Reno, NV, USA) 및 시린지 펌프(Model 11, Harvard, Holliston, MA, USA)를 이용하여 침지시켰 다. 노말 네거티브-모드(normal negative-mode) ESI-MS 조건은 하기와 같았다: 140,000 (full width at half maximum, FWHM)의 질량 해상도(mass resolution), 5의 차단 가스 유속(sheath gas flow rate), 0의 스위프 가 스 유속(seep gas flow rate), 0의 보조 가스 유속(auxiliary gas flow rate), 4.20 kV의 스프레이 전압(spray voltage), 320℃의 캐필러리 온도(capillary temperature), S-lens Rf 수준, 및 5 E 6의 AGC(automatic gain control). ESI 인터페이스에서 Pierce Velos 용액(Thermo Fisher Scientific)을 이용하여 네거티브 모드에 대해 외부 교 정(external calibration)을 수행하였다. MS/MS 실험을 위해, 3개의 상이한 단계적 정규화 충돌 에너지 (10, 30, 및 40)를 동일한 장치로 적용하였다. 네거티브 모드의 운전 조건 및 MS/MS 실험을 위한 나머지 운전 파라미 터는 하기와 같았다: 차단 가스 유속 10, 부속 가스 유속 0 (arbitrary units), 스프레이 전압 3.50 kV, 캐필 러리 온도 320℃, 및 S-lens RF 수준 50 (Antioxidants 2020, 9, 1099). 데이터 처리 수득된 질량분석 데이터를 Xcalibur 3.1/Foundation 3.1 (Thermo Fisher Scientific Inc. Rockford, IL., US A)을 이용하여 처리했다. m/z 피크를 탈양성자화 (M-H) 부가체의 정확한(계산된) 질량을 자체 MS/MS 데이터베이 스 및 FooDB (https://foodb.ca/, accessed data 8 Junly 2021) 및 METLIN 데이터베이터(http:// metlin.scripps.edu/landing_page.php?pgcontent=mainPage, accessed data 8 July 2021)와 같은 온라인 데이 터베이스로부터의 ESI-MS/MS 단편화 패턴 및 m/z 값과 매칭시키는 것에 의해 잠정적으로 검출했다. ChemDraw Professional 15.0 (PerkinElmer, Waltham, MA, USA)을 이용하여 화합물 구조를 그렸다. 도 4 내지 도 7에 해죽순 추출물로부터 ESI-MS/MS에 의해 확인된 페놀 화합물, 플라보노이드 화합물, 프레닐플 라보노이드 화합물, 및 프로시아니딘 화합물의 구조가 각각 도시된다. 통계 분석 모든 실험은 3회 반복하고 실험 데이터는 평균 ± 표준편차로 표현한다. Design Expert 소프트웨어 (Stat-Ease Inc., Minneapolis, MN, USA)를 이용하여 실험 설계 및 RSM의 통계분석을 수행하고, MATLAB 소프트웨어의 Neural Network Toolbox™ (The Mathworks, Inc., Ver. 8.6.0.347, MA, USA)를 이용하여 통계 분석을 수행하였 다. 해죽순 추출물의 생물학적 활성에 관여된 페놀 화합물 프로파일을 동정하기 위해 LC/MS를 수행하여, 표 3에 기 재된 바와 같이 해죽순 추출물로부터 다양한 화합물을 검출하였다. 표 3"}
{"patent_id": "10-2021-0117735", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "검출된 화합물은 크게 페놀산류와 플라보노이드류로 분류되었다. 페놀산류에 살리실한, 프로토카테추산, 쿠마린 산, 등 19개의 화합물이 발견되었고, 플라보노이드 류에 나린게닌, 캠페롤 등 29개의 화합물이 발견되었다. 5-히드록시-코니페릴 알코올(5-hydroxy-conilferyl-alcohol), 카페오일티라민(caffeoyltyramine), 호페아놀 B(hopeanol B), 탁시폴린 7,4'-디메틸 에테르(taxifolin 7,4'-dimethyl ether), 3,7-디히드록시-3',4'-디메톡 시플라본(3,7-dihydroxy-3',4'-dimethoxyflavone), 및 8-데메틸티모닌(8-Demethylthymonin) 등은 이전에 알려 지지 않은 화합물이었고, 피세아탄놀(Piceatannol), 오리엔탈론(Orientalone), 스테레빈 A(Sterebin A), 캠페 롤 7-글로코시드, 트릴로비논(Trilobinone), 펙톨리나리게닌(Pectolinarigenin), 움벨리페론(Umbelliferone), 및 벤조퀴논 아세트산(Benzoquinone acetic acid)의 함량이 높은 것으로 확인되었다. 실시예 3. 해죽순 추출물로부터 분리된 화합물 및 그의 항산화능 실시예 2에서 해죽순 추출물로부터 분리된 화합물 중 이전에 공지된 바 없는 신규한 화합물, 5-히드록시-코니페 릴 알코올(5-hydroxy-conilferyl-alcohol), 카페오일티라민(caffeoyltyramine), 호페아놀 B(hopeanol B), 탁시 폴린 7,4'-디메틸 에테르(taxifolin 7,4'-dimethyl ether), 3,7-디히드록시-3',4'-디메톡시플라본(3,7- dihydroxy-3',4'-dimethoxyflavone), 및 8-데메틸티모닌(8-Demethylthymonin)의 항산화능을 테스트하였다. 항산화능은 실시예 1에 기재된 바와 같이, DPPH, CUPRAC, FRAP을 측정하였다. 항산화능이 높은 것으로 확인된 화합물을 대상으로 추가적인 활성을 테스트하였다."}
{"patent_id": "10-2021-0117735", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 구체예에 따른 최적화 방법에서 에탄올 농도, 시간, 및 온도 간의 3차원 반응 표면 플롯을 보여준다. 도 2는 본 발명의 일 구체예에 따른 ANN 모델의 구조를 보여준다. 도 3은 본 발명의 일 구체예에 따른 ANN 모델에서 DPPH(mg/g), CUPRAC (mg/g), FRAP (mg/g), 총 페놀 함량 (TPC) (mg/g) 및 총 플라보노이드 함량 (TFC) (mg/g)에 대한 훈련 서브세트의 에포크 개수에 따른 네트워크 훈 련 곡선을 보여준다. 도 4는 본 발명의 일 구체예에 따라 수득된 해죽순 추출물로부터 ESI-MS/MS에 의해 확인된 페놀 화합물의 구조 를 보여준다. 도 5는 본 발명의 일 구체예에 따라 수득된 해죽순 추출물로부터 ESI-MS/MS에 의해 확인된 플라보노이드 화합물 의 구조를 보여준다. 도 6은 본 발명의 일 구체예에 따라 수득된 해죽순 추출물로부터 ESI-MS/MS에 의해 확인된 프레닐플라보노이드 화합물의 구조를 보여준다. 도 7은 본 발명의 일 구체예에 따라 수득된 해죽순 추출물로부터 ESI-MS/MS에 의해 확인된 프로시아니딘 화합물 의 구조를 보여준다."}
