{"patent_id": "10-2022-7035674", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0154203", "출원번호": "10-2022-7035674", "발명의 명칭": "주차된 차량의 처리 능력을 통한 ANN 훈련", "출원인": "마이크론 테크놀로지, 인크.", "발명자": "골로브, 길"}}
{"patent_id": "10-2022-7035674", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "시스템(system)에 있어서,적어도 하나의 처리 디바이스(processing device); 및상기 적어도 하나의 처리 디바이스에: 인공 신경망(ANN)을 훈련하는 데 사용되는 컴퓨팅 작업(computing task)들을 처리하는 데 이용가능한 처리 리소스들을 포함하는 차량을 결정하고;상기 컴퓨팅 작업들을 분리하고;상기 분리된 작업들의 각각에 하나 이상의 차량들을 할당하고;통신 인터페이스(communication interface)에 의해 상기 할당된 작업들을 포함하는 통신들을 상기 차량들의 상기 처리 리소스에 발송하고-여기서, 상기 처리 리소스는 결과들을 제공하기 위해 상기 할당된 작업들을 처리하도록 구성됨-;상기 통신 인터페이스에 의해, 상기 결과들을 포함하는 상기 차량들의 상기 처리 리소스로부터 통신들을 수신하고; 및상기 결과들에 따라 상기 ANN을 훈련하도록 지시하도록 구성된 명령어를 포함하는 메모리(memory)를 포함하는,시스템."}
{"patent_id": "10-2022-7035674", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 이용가능한 처리 리소스들을 결정하는 것은 상기 처리 리소스들로부터 통신들을 수신하는것을 포함하고, 개별 처리 리소스로부터의 각각의 통신은 적어도 하나의 센서를 사용하여 개별 처리 리소스에의해 결정된 가용성의 표시를 포함하는, 시스템."}
{"patent_id": "10-2022-7035674", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 이용가능한 처리 리소스들을 결정하는 것은 상기 처리 리소스들로부터 통신들을 수신하는것을 포함하고, 개별 처리 리소스로부터의 각각의 통신은 GPS 데이터를 포함하는, 시스템."}
{"patent_id": "10-2022-7035674", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 ANN은 제1 ANN이고, 상기 이용가능한 처리 리소스들을 결정하는 것은 센서 데이터, GPS데이터, 또는 카메라 데이터 중 적어도 하나를 제2 ANN에 대한 입력으로서 제공하는 것, 및 상기 제2 ANN의 출력에 기초하여 상기 개별 처리 리소스의 가용성을 결정하는 것을 포함하는, 시스템."}
{"patent_id": "10-2022-7035674", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 분리된 작업들을 할당하는 것은 상기 처리 리소스들의 각각에 대한 처리 능력을 결정하는것, 및 상기 처리 능력에 기초하여 개별 처리 리소스에 상기 작업들의 각각을 할당하는 것을 포함하는, 시스템."}
{"patent_id": "10-2022-7035674", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 명령어는 메모리에 상기 처리 리소스들의 처리 능력들을 저장하도록 상기 적어도 하나의처리 디바이스에 지시하도록 더 구성되고, 상기 컴퓨팅 작업들을 분리하는 것은 상기 저장된 처리 능력들에 적어도 부분적으로 기초하는, 시스템."}
{"patent_id": "10-2022-7035674", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 상기 이용가능한 처리 리소스들을 결정하는 것은 상기 처리 리소스를 포함하는 차량이 주차되공개특허 10-2022-0154203-3-어 있음을 표시하는 각각의 처리 리소스로부터 수신된 통신을 평가하는 것을 포함하는, 시스템."}
{"patent_id": "10-2022-7035674", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 이용가능한 처리 리소스들을 결정하는 것은 상기 개별 차량의 적어도 하나의 센서로부터,상기 통신 인터페이스에 의해, 수신된 센서 데이터에 기초하여 상기 개별 처리 리소스와 연관된 차량이 주차되어 있음을 결정하는 것을 포함하는, 시스템."}
{"patent_id": "10-2022-7035674", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서, 상기 결과들에 따라 상기 ANN을 훈련하는 것은 상기 처리 리소스들로부터의 통신들에서 수신된상기 결과들을 조합하는 것을 포함하는, 시스템."}
{"patent_id": "10-2022-7035674", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "방법에 있어서,적어도 하나의 처리 디바이스에 의해, 인공 신경망(ANN)을 훈련하는 데 사용되는 컴퓨팅 작업들을 처리하는 데이용가능한 처리 리소스들을 결정하는 단계;상기 적어도 하나의 처리 디바이스에 의해, 상기 컴퓨팅 작업들의 각각을 상기 처리 리소스들 중 하나 이상에할당하는 단계;통신 인터페이스에 의해, 상기 할당된 작업들을 포함하는 통신들을 상기 처리 리소스들에 발송하는단계-여기서, 상기 처리 리소스들은 결과들을 제공하기 위해 상기 할당된 작업들을 처리하도록 구성됨-;상기 통신 인터페이스에 의해, 상기 결과들을 포함하는 상기 처리 리소스들로부터 통신들을 수신하는 단계; 및상기 적어도 하나의 처리 디바이스에 의해, 상기 결과들에 따라 상기 ANN을 훈련하는 단계를 포함하는, 방법."}
{"patent_id": "10-2022-7035674", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서, 상기 이용가능한 처리 리소스들을 결정하는 단계는 차량이 사람에 의해 점유되지 않은 지속시간, 차량이 정지해 있는 지속시간, 차량의 주차 브레이크가 적용된 지속시간 또는 차량의 송신이 주차하도록 설정된 시간의 지속시간 중 적어도 하나를 포함하는 각각의 처리 리소스에 대한 개별 데이터를 평가하는 단계를포함하는, 방법."}
{"patent_id": "10-2022-7035674", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항에 있어서,메모리에 저장된 대기열(queue)에서 상기 처리 리소스들에 대한 링크들을 유지하는 단계;제1 처리 리소스가 상기 ANN을 훈련하는 데 사용되는 컴퓨팅 작업들을 처리하는 데 이용불가능하거나 이용불가능하게 될 것인지 결정하는 단계; 및상기 제1 처리 리소스가 이용불가능하거나 이용불가능하게 될 것이라는 결정에 응답하여, 상기 제1 처리 리소스에 대한 제1 링크를 상기 저장된 큐로부터 제거하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2022-7035674", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서, 상기 제1 처리 리소스가 이용불가능하거나 이용불가능하게 될 것인지를 결정하는 단계는 차량에 진입하는 사람의 표시, 주차 브레이크 해제의 표시, 또는 주차에서 주행 모드 또는 기어로의 변속기 변경 표시 중 적어도 하나에 관해 상기 제1 처리 리소스로부터 수신된 데이터를 평가하는 단계를 포함하는, 방법."}
{"patent_id": "10-2022-7035674", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제10항에 있어서, 상기 컴퓨팅 작업들을 할당하는 단계는 상기 처리 리소스가 상기 ANN을 훈련하도록 승인되었음을 나타내는 통지를 각각의 처리 리소스로부터 수신하는 단계를 포함하는, 방법."}
{"patent_id": "10-2022-7035674", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "공개특허 10-2022-0154203-4-제10항에 있어서, 상기 컴퓨팅 작업들은 제1 처리 리소스에 할당된 제1 작업을 포함하고, 상기 방법은:상기 제1 처리 리소스를 포함하는 차량이 일정 기간 내에 운전될 가능성이 있음을 나타내는 제1 통신을 수신하는 단계; 및상기 제1 통신을 수신하는 것에 응답하여, 상기 제1 처리 리소스로부터 다른 처리 리소스로 상기 제1 작업을 재할당하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2022-7035674", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "명령어를 저장하는 비일시적 기계 판독가능 저장 매체로서, 상기 명령어는, 제1 컴퓨팅 디바이스 상에서 실행될때, 상기 제1 컴퓨팅 디바이스로 하여금 적어도:인공 신경망(ANN)을 훈련하는 데 사용되는 컴퓨팅 작업들을 처리하는 데 이용가능한 처리 리소스들을 결정하게하고;상기 컴퓨팅 작업들의 각각을 상기 처리 리소스들의 하나 이상에 할당하게 하고;상기 할당된 작업들을 포함하는 통신들을 상기 처리 리소스들에 발송하게 하고-여기서, 상기 처리 리소스들은결과들을 제공하기 위해 상기 할당된 작업들을 처리하도록 구성됨-;상기 결과들을 포함하는 상기 처리 리소스들로부터 통신들을 수신하게 하고; 및상기 결과들에 따라 상기 ANN을 훈련하게 하는, 비일시적 기계 판독가능 저장 매체."}
{"patent_id": "10-2022-7035674", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서, 제2 컴퓨팅 디바이스는 상기 제1 처리 리소스가 이용불가능하게 될 것이라고 결정하는 상기제2 컴퓨팅 디바이스에 응답하여 상기 할당된 작업들 중 적어도 하나의 실행을 금지하도록 구성되는, 비일시적기계 판독가능 저장 매체."}
{"patent_id": "10-2022-7035674", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제16항에 있어서, 제2 컴퓨팅 디바이스는 상기 할당된 태스크들 중 적어도 하나에 대한 ANN-입력 데이터를 생성하도록 구성되는, 비일시적 기계 판독가능 저장 매체."}
{"patent_id": "10-2022-7035674", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제16항에 있어서, 제2 컴퓨팅 디바이스는 상기 할당된 작업들 중 적어도 하나에 대한 ANN 입력 데이터를 상기제1 컴퓨팅 디바이스로부터 수신하도록 구성되는, 비일시적 기계 판독가능 저장 매체."}
{"patent_id": "10-2022-7035674", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제16항에 있어서, 상기 이용가능한 처리 리소스들을 결정하는 것은 상기 처리 리소스들로부터 통신들을 수신하는 것을 포함하고, 개별 처리 리소스로부터의 각각의 통신은 상기 개별 처리 리소스를 포함하는 차량의 적어도하나의 센서를 사용하여 결정된 가용성의 표시를 포함하는, 비일시적 기계 판독가능 저장 매체."}
{"patent_id": "10-2022-7035674", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "주차된 차량의 처리 능력을 통한 ANN 훈련을 위한 시스템. 시스템은 ANN의 훈련을 제어하도록 구성된 제어기를 갖는 마스터 컴퓨팅 디바이스를 포함할 수 있다. 훈련은 주차된 차량들의 컴퓨팅 디바이스들에 의해 적어도 부분 적으로 별도의 부분들에서 수행될 수 있다. 제어기는 ANN 훈련의 컴퓨팅 작업들을 별도의 작업들로 분리하도록 구성될 수 있다. 또한, 제어기는 분리된 작업들 중 적어도 일부를 주차된 차량들의 선택된 컴퓨팅 디바이스들에 할당하도록 구성될 수 있다. 제어기는 ANN을 훈련하기 위해 분리된 작업들의 결과들을 수신하고 조합하도록 구성 될 수도 있다. 제어기는 결과들에 따라 ANN을 훈련하도록 구성될 수도 있다. 마스터 컴퓨팅 디바이스는 할당된 작업들을 차량의 선택된 장치들에 발송할 뿐만 아니라 선택된 디바이스들로부터 할당된 작업들의 결과들을 수신 하도록 구성될 수 있다."}
{"patent_id": "10-2022-7035674", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "관련 출원 본 출원은 2020년 4월 16일에 출원되고 \"주차된 차량의 처리 능력을 통한 ANN 훈련\"이라는 명칭의 미국 특허 출 원 번호 제16/850,946호에 대한 우선권을 주장하며, 그 전체 개시 내용이 본 명세서에 참고로 포함된다. 기술 분야 본 명세서에 개시된 적어도 일부 실시예는 주차된 차량의 처리 능력을 통한 인공 신경망(ANN) 훈련에 관한 것이다."}
{"patent_id": "10-2022-7035674", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공 신경망(ANN)은 생물학적 신경망으로부터 대략(loosely) 모델링된 인공 지능(AI) 시스템이다. ANN은 그러한 시스템이 작업을 수행하는 방법을 인공적으로 학습할 수 있기 때문에 AI 시스템으로 간주될 수 있다. ANN은 다 양한 유형의 기계 학습 툴들 중 하나이다. ANN은 예시 입력을 통해 인공적으로 학습할 수 있으며 일반적으로 작 업별 규칙으로 프로그래밍되지 않는다. 예를 들어, ANN이 음성 인식에 사용되는 경우, 음성 단어 \"안녕\"을 포함 하는 것으로 알려진 예시 오디오 신호를 분석하여 음성 단어 \"안녕\"이 포함된 오디오 신호를 식별하는 방법을 학습할 수 있다. ANN의 계산 결과는 다른 오디오 신호에서 \"안녕\"이라는 말을 식별하는 데 사용할 수 있다. 이 미지 인식 예시에서 ANN은 사람을 포함하는 것으로 알려진 예시 이미지를 분석하여 사람이 포함된 이미지를 식 별하는 방법을 학습할 수 있다. 그런 다음 ANN의 출력을 사용하여 다른 이미지에서 사람을 식별할 수 있다. 음성 및 이미지 인식 외에, ANN은 지도 학습(supervised learning)을 포함하는 거의 모든 기계 학습 작업에 대 해 사용될 수 있다. 그리고 이러한 ANN은 의료 진단, 비즈니스 및 기술 문제 해결, 기계 번역, 네트워크 필터링, 빅 데이터 시스템 필터링, 비디오 게임 재생, 비디오 게임 및 멀티미디어의 새로운 부분의 실시간 생성 에 사용되었다. ANN은 차량 자동화 및 자율 주행 자동차의 의사 결정을 가이드하기 위해 개발되고 있다. ANN은 종종 인공 뉴런이라고 하는 연결된 노드들의 세트를 기반으로 한다. 연결된 노드들은 뇌의 생물학적 뉴런 을 대략 모델링한다. 노드들 간의 연결은 뇌의 시냅스와 유사하다. 그러나 연결(종종 에지라고 함)은 생물학적 뉴런과 신호를 주고받는 실제 물리적 요소와 반대되는 수학적 모델의 일부이다. 인공 뉴런들 또는 노드들은 또 한 수학적 모델의 일부이며 시냅스를 통해 신호를 수신한 다음 시냅스를 통해 신호를 처리하고 발송할 수 있는 생물학적 뉴런과 대략 유사하다. ANN에서 노드들 간의 연결은 숫자를 포함할 수 있다. 그리고 노드의 출력은 그의 입력들의 합 또는 도함수 (derivative), 더 구체적으로 그의 입력 연결들의 합 또는 도함수를 포함하는 함수(비선형 함수와 같은)로부터 계산될 수 있다. 또한 인공 뉴런들과 에지들은 러닝 프로세스에 따라 조정되는 가중치를 갖는 경우가 많다. 가 중치는 에지에서 숫자를 늘리거나 줄일 수 있다. 인공 뉴런은 또한 뉴런의 입력들의 집합(aggregate)이 임계치 를 초과하는 경우에만 뉴런에 대해 에지의 수가 입력되도록 임계치를 가질 수 있다. 또한 ANN에서 일반적으로 그의 노드들 또는 인공 뉴런들은 계층으로서 구성된다. 그리고 ANN의 다른 계층들은 그들의 입력들에 대해 다른 변환(transformation)을 수행할 수 있다. ANN은 입력 계층과 출력 계층을 포함할 수 있으며 입력 계층에서 출력 계층으로 변환이 발생한다. 또한, ANN은 입력 계층과 출력 계층 사이에 하나 이상의 중간 계층을 포함할 수 있 다."}
{"patent_id": "10-2022-7035674", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에 개시된 적어도 일부 실시예는 주차된 차량의 처리 능력을 통한 ANN 훈련에 관한 것이다. 적어도 일 부 실시예는 주차된 차량의 처리 능력을 통한 ANN 훈련을 위한 시스템에 관한 것이다. 일부 실시예에서, ANN을 적어도 부분적으로 훈련하는 차량은 주차될 필요가 없다. 시스템은 ANN의 훈련을 제어하도록 구성된 제어기를 갖는 마스터 컴퓨팅 디바이스를 포함할 수 있다. 훈련은 주차된 차량의 컴퓨팅 디바이스에 의해 적어도 부분적 으로 별도의 부분들에서 수행될 수 있다. 그러나 언급된 바와 같이 일부 실시예에서는 차량이 주차될 필요가 없 다. 제어기는 ANN 훈련의 컴퓨팅 작업을 별도의 작업으로 분리하도록 구성될 수 있다. 또한, 제어기는 분리된 작업 중 적어도 일부를 주차된 차량의 선택된 컴퓨팅 디바이스에 할당하도록 구성될 수 있다. 제어기는 ANN을 훈련하기 위해 분리된 작업의 결과를 수신하고 조합하도록 구성될 수도 있다. 제어기는 결과에 따라 ANN을 훈련 하도록 구성될 수도 있다. ANN의 훈련, ANN의 부분들의 훈련, 또는 ANN의 훈련의 적어도 일부 작업은 델타 규칙 (delta rule)에 따라 수행될 수 있다. 마스터 컴퓨팅 디바이스는 차량의 선택된 장치에 할당된 작업을 발송할뿐만 아니라 차량의 선택된 장치로부터 할당된 작업의 결과를 수신하도록 구성될 수 있다. 도 1 내지 도 3은 본 개시의 일부 실시예에 따른 차량들(예를 들어, 차량들(102, 202, 130 내지 132) 참조)뿐만 아니라 차량들의 컴퓨팅 시스템(예를 들어, 컴퓨팅 시스템들(104 및 204) 참조)을 통해 적어도 부분적으로 ANN 을 훈련하기 위한 하나 이상의 마스터 컴퓨팅 디바이스들(예를 들어, 하나 이상의 마스터 컴퓨팅 디바이스들 및 마스터 컴퓨팅 디바이스 참조)을 포함하는 예시적인 네트워크 시스템을 도시한다. 네트워크 시스템은 하나 이상의 통신 네트워크를 통해 네트워킹된다. 통신 네트워크(들)와 같은 본 명세서에 설명된 통신 네트워크는 적어도 로컬-투-디바이스 네트워크, 예를 들어 블루투스 등, 광역망(WAN), 근거리 통신망(LAN), 인트라넷, 4G 또는 5G와 같은 모바일 무선 네트워크, 엑스트라넷, 인터넷, 및/또는 이들의 임의의 조합을 포함할 수 있다. 네트워크 시스템의 노드들(예를 들어, 차량들(102, 202, 130 내지 132) 및 마스터 컴퓨팅 디바이스(들) 참조)은 각각 피어-투-피어 네트워크, 클라이언트-서버 네트워크, 클라우드 컴퓨팅 환경 등의 일부일 수 있다. 또한, 본 명세서에 기술된 장치, 컴퓨팅 디바이스, 차량, 센서 또는 카메라, 및/또는 사용자 인터페이스 중 임의의 것은 일종의 컴퓨터 시스템(예를 들어, 마스터 컴퓨팅 디바이스(들) 및 마스터 컴퓨팅 디바이스 뿐만 아니라 컴퓨팅 시스템(104 및 204) 참조)을 포함할 수 있다. 그리고, 그 러한 컴퓨터 시스템은 LAN, 인트라넷, 엑스트라넷 및/또는 인터넷의 다른 디바이스에 대한 네트워크 인터페이스 를 포함할 수 있다. 컴퓨터 시스템은 또한 클라이언트-서버 네트워크 환경에서 서버 또는 클라이언트 기계의 용 량으로 피어 투 피어(또는 분산) 네트워크 환경에서 피어 기계로, 또는 클라우드 컴퓨팅 인프라 또는 환경에서 서버 또는 클라이언트 시스템으로 동작할 수 있다. 도 1에 도시된 바와 같이, 네트워크 시스템은 ANN 훈련 시스템과 연관된 ANN 훈련 클라이언트 어플리케이 션(본 명세서에서 ANN 훈련 클라이언트라고도 함)을 포함하는 차량 컴퓨팅 시스템을 포함하는 차량을 적어도 포함할 수 있다. 차량은 또한 바디 및 바디의 제어 가능한 부분들(도시되지 않음), 파 워트레인 및 파워트레인의 제어 가능한 부분들(도시되지 않음), 바디 제어 모듈(ECU의 한 유형), 파워트레 인 제어 모듈(ECU의 한 유형), 및 파워 스티어링 제어 유닛(ECU의 한 유형)을 포함할 수 있다. 차량 은 또한 복수의 센서들(예를 들어, 센서들(114a 내지 114b) 참조), GPS 디바이스, 복수의 카메라들 (예를 들어, 카메라들(118a 내지 118b) 참조), 및 적어도 차량 컴퓨팅 시스템, 바디 제어 모듈, 파워 트레인 제어 모듈, 파워 스티어링 제어 유닛, 복수의 센서들, GPS 디바이스 및 복수의 카메라들 을 서로 연결하는 제어기 영역 네트워크(CAN) 버스를 포함한다. 또한, 도시된 바와 같이, 차량은 차량 컴퓨팅 시스템을 통해 네트워크(들)에 연결된다. 또한, 도시된 바와 같이, 차량들(130 내지 132) 및 마스터 컴퓨팅 디바이스(들)(마스터 컴퓨팅 디바이스를 포함함)는 네트워크(들)에 연결된다. 따라서, 차량에 통신 가능하게 결합된다. 컴퓨팅 시스템에 포함된 ANN 훈련 클라이언트는 마스터 컴퓨팅 디바이스(들) 뿐만 아니라 마스터 컴퓨팅 디바이스 와 통신할 수 있다. 일부 실시예에서, 네트워크 시스템은 마스터 컴퓨팅 디바이스(예를 들어, 마스터 컴퓨팅 디바이스 참 조)를 포함할 수 있다. 마스터 컴퓨팅 디바이스는 실시예에 따라 단일 컴퓨팅 디바이스 또는 다중 컴퓨팅 디바 이스들일 수 있다. 어느 쪽이든, 마스터 컴퓨팅 디바이스는 적어도 제어기(예를 들어, 제어기 참조) 및 제 어기에 통신 가능하게 결합된 통신 인터페이스(예를 들어, 통신 인터페이스 참조)를 포함할 수 있다. 도 1 에 도시된 바와 같이, 제어기는 ANN 트레이너를 포함할 수 있다. ANN 트레이너는 훈련 작업들의 적어도 일부가 ANN 훈련 클라이언트를 통해 다른 컴퓨팅 시스템 또는 디바이스(예를 들어, ANN 훈련 클라이언트 참조)에 위임된 경우 ANN을 훈련하고 ANN의 훈련을 제어하도록 구성된 컴퓨터 하드웨어 및/또는 소프트웨 어를 포함할 수 있다. 도 1과 관련하여, 마스터 컴퓨팅 디바이스의 제어기는 (예를 들어 ANN 트레이너를 통해) ANN의 훈련을 제어하도록 구성될 수 있다. 도 1에 도시되지 않았지만, 제어기는 ANN 트레이너가 다수의 네 트워크 컴퓨터들 사이에 분산될 수 있는 것처럼 다수의 네트워크 컴퓨터들 사이에 분산될 수 있다. ANN의 훈련 은 주차된 차량들의 개별 컴퓨팅 디바이스들(예를 들어, 개별 차량들(102 및 202)의 컴퓨팅 시스템들(104 및 204) 참조)에 의해 별도의 부분들에서 적어도 부분적으로 수행될 수 있다. 그러나, 일부 실시예에서, 제어기 에 의해 사용되는 차량들은 반드시 주차되어 있는 것은 아니다. 주차된 차량을 사용하는 것이 더 나을 수 있지만, 차량의 주행 모드에서는 컴퓨팅 리소스를 사용하지 않기 때문에 주차된 차량을 사용하는 것이 좋다; 따 라서 ANN 훈련을 위한 작업을 수행하기 위해 컴퓨팅 리소스를 해방한다(freeing up). 제어기는 또한 예를 들어 ANN 트레이너의 실행을 통해 분리된 작업들로 ANN을 훈련하는 컴퓨팅 작업 들을 분리하도록 구성될 수 있다. 제어기는 또한 예를 들어 ANN 트레이너의 실행을 통해 분리된 작업 들 중 적어도 일부를 주차된 차량들의 개별 선택된 컴퓨팅 디바이스들(예를 들어, 개별 차량들(102, 202)의 컴 퓨팅 시스템들(104, 204) 참조)에 할당하도록 구성될 수 있다. 제어기는 또한 예를 들어 ANN 트레이너 의 실행을 통해 ANN을 훈련하기 위해 분리된 작업들의 결과들을 수신하고 조합하도록 구성될 수 있다. 또 한, 제어기는 예를 들어 ANN 트레이너의 실행을 통해 분리된 작업들의 결과들에 따라 ANN을 훈련하도 록 구성될 수 있다. ANN의 훈련, ANN의 일부 훈련, 또는 ANN의 훈련의 적어도 일부 작업들은 델타 규칙에 따라 수행될 수 있다. 제어기에 통신 가능하게 결합된 마스터 컴퓨팅 디바이스의 통신 인터페이스는 할당된 작업들을 주차된 차량들의 개별 선택된 컴퓨팅 디바이스들에 발송하도록 구성될 수 있다. 통신 인터페이스는 또한 개별 선택된 컴퓨팅 디바이스들로부터 할당된 작업들의 결과들을 수신하도록 구성될 수 있다. 일부 실시예에서, 제어기는 차량이 주차되었음을 나타내는 주차된 차량으로부터 수신된 통지 (notification)에 따라 주차된 차량의 컴퓨팅 디바이스를 선택하도록 구성된다. 통지에 따른 선택은 ANN 트레이 너를 통해서도 가능하다. 또한 주차된 차량으로부터 수신된 통지는 차량이 ANN 훈련을 위해 승인되었음을 추가로 나타낼 수 있다. 일부 실시예들에서, 통지는 차량이 주차되었다는 표시(indication)를 포함하지 않고 차 량이 ANN의 훈련을 위해 승인되었다는 표시를 포함한다. 이러한 실시예 및 기타에서, 제어기는 예를 들어 ANN 트레이너를 통해 차량이 일정 기간 내에 운전될 가능성이 있음을 나타내는 주차된 차량으로부터 수신된 통지에 따라 주차된 차량의 컴퓨팅 디바이스를 선택 해 제하도록 구성될 수 있다. 차량이 일정 기간 내에 운전될 확률은 차량의 디바이스 또는 다른 컴퓨팅 디바이스에 의해 계산될 수 있고 규칙 기반 알고리즘, 인공 지능 기술(ANN 또는 의사 결정 트리 등) 또는 이들의 조합을 기 반으로 할 수 있다. 또한, 이러한 실시예 및 기타 실시예에서, 제어기는 제어기가 차량이 시간 기간 내에 운전될 가능성이 있 다는 통지를 수신하고 작업에 대한 결과가 시간 기간 전에 선택 해제된 컴퓨팅 디바이스로부터 수신되지 않은 경우 선택된 컴퓨팅 디바이스들 중 다른 하나에 선택 해제된 컴퓨팅 디바이스에 할당된 ANN을 훈련시키기 위한 작업을 재할당하도록 구성될 수 있다. 재할당은 ANN 트레이너를 통해 수행될 수 있다. 일부 실시예에서, 제어기는 주차된 차량들의 선택된 컴퓨팅 디바이스들에 대한 개별 링크들을 대기열 (queue)에 유지하도록 구성될 수 있다. 그리고, 제어기는 선택된 컴퓨팅 디바이스들 중 하나가 선택 해제 될 때 선택된 컴퓨팅 디바이스들 중 하나의 개별 링크를 대기열로부터 제거하도록 구성될 수 있다. 상기 링크들 의 유지 및 제거는 ANN 트레이너를 통해 수행될 수 있다. 이러한 실시예에서, 제어기는 차량이 주차되었음을 나타내는 주차된 차량으로부터 수신된 통지에 따라 주 차된 차량의 컴퓨팅 디바이스를 선택하도록 구성될 수 있다. 제어기는 또한 대기열에서 선택된 컴퓨팅 디 바이스를 유지하도록 구성될 수 있다. 또한 주차된 차량으로부터 수신된 통지는 차량이 ANN 훈련을 위해 승인되 었음을 추가로 나타낼 수 있다. 제어기는 또한 차량이 일정 기간 내에 운전될 가능성이 있음을 나타내는 주차된 차량으로부터 수신된 통지에 따라 주차된 차량의 컴퓨팅 디바이스를 선택 해제하고, 대기열에서 선택 해 제된 컴퓨팅 디바이스를 제거하도록 구성될 수 있다. 제어기는 또한 제어기가 차량이 시간 기간 내에 운전 될 가능성이 있다는 통지를 수신하고 작업에 대한 결과가 시간 기간 전에 선택 해제된 컴퓨팅 디바이스로부터 수신되지 않은 경우 선택 해제된 컴퓨팅 디바이스에 할당된 ANN을 훈련하기 위한 작업을 선택된 컴퓨팅 디바이 스들 중 다른 하나에 재할당하도록 구성될 수 있다. 전술한 선택, 유지, 선택 해제 및/또는 재할당은 ANN 트레 이너를 통해서도 수행될 수 있다. 도 1과 관련하여, 차량(102, 130 또는 132)과 같은 차량은 차량이 주차되었는지 여부와 관련된 제1 차량 정보를 생성 및 출력하도록 구성된 제1 전자 시스템을 포함할 수 있다. 제1 전자 시스템은 본 명세서에 기재된 차량 제 어 모듈 또는 ECU 중 임의의 하나 이상, 본 명세서에 기재된 카메라, GPS 디바이스 또는 센서 중 임의의 하나 이상, 또는 이들의 임의의 조합으로 구성될 수 있다(예를 들어, 바디 제어 모듈, 파워트레인 제어 모듈 , 파워 스티어링 제어 유닛, 센서들(114a 내지 114b), GPS 디바이스 및 카메라들(118a 내지 118b) 참조, 이들 중 임의의 것이 제1 전자 시스템의 일부일 수 있음). 이러한 실시예 및 다른 실시예에서, 차량은 차량 컴퓨팅 디바이스를 포함할 수 있다(예를 들어, 컴퓨팅 디바이 스일 수 있거나, 그 일부이거나 이를 포함할 수 있는 컴퓨팅 시스템 참조). 일부 실시예에서, 컴퓨팅 디바 이스는 본 명세서에 설명된 ECU들 중 어느 하나와 같은 ECU일 수 있거나, 그 일부이거나, 이를 포함할 수 있다.차량의 컴퓨팅 디바이스는 차량의 제1 전자 시스템으로부터 제1 차량 정보를 수신하도록 구성될 수 있다. 차량 의 컴퓨팅 디바이스는 또한 제1 전자 시스템으로부터 수신된 제1 차량 정보에 따라 차량이 주차되었는지 여부를 결정하도록 구성될 수 있다. 또한, 차량의 컴퓨팅 디바이스는, 적어도 하나의 마스터 컴퓨팅 디바이스(예를 들 어, 마스터 컴퓨팅 디바이스 참조)로, 차량이 주차되어 있고 ANN을 훈련하기 위한 적어도 하나의 작업을 실행하기 위해 적어도 하나의 마스터 컴퓨팅 디바이스에 의해 선택 가능하다는 통지를 발송하도록 구성될 수 있 다. 차량의 디바이스에 의한 발신은 차량이 주차된 것으로 결정될 때 발생할 수 있다. 차량의 컴퓨팅 디바이스 는 또한 적어도 하나의 마스터 컴퓨팅 디바이스에 의해 차량 컴퓨팅 디바이스에 할당된 ANN을 훈련하기 위한 적 어도 하나의 작업을 수신하고 실행하도록 구성될 수 있다. 차량의 디바이스에 의한 적어도 하나의 작업의 수신 및 실행은 차량이 주차된 동안에도 발생할 수 있다. 이러한 실시예 및 기타에서, 차량은 또한 차량이 일정 기간 내에 운전될 가능성이 있는지 여부와 관련된 제2 차 량 정보를 생성 및 출력하도록 구성된 제2 전자 시스템을 포함할 수 있다. 제2 전자 시스템은 본 명세서에 기술 된 차량 제어 모듈 또는 ECU 중 임의의 하나 이상, 본 명세서에 설명된 카메라, GPS 디바이스 또는 센서 중 하 나 이상, 또는 이들의 임의의 조합으로 구성될 수 있다(예를 들어, 바디 제어 모듈, 파워트레인 제어 모듈 , 파워 스티어링 제어 유닛, 센서들(114a 내지 114b), GPS 디바이스 및 카메라(118a 내지 118b) 참조, 이들 중 임의의 것은 제2 전자 시스템의 일부가 될 수 있음). 이러한 예들에서, 차량 컴퓨팅 디바이스는 차량의 제2 전자 시스템으로부터 제2 차량 정보를 수신하도록 구성될 수 있다. 차량 컴퓨팅 디바이스는 또한 제2 전자 시스템으로부터 수신된 제2 차량 정보에 따라 차량이 일정 기 간 내에 운전될 가능성이 있는지 여부를 결정하도록 구성될 수 있다. 그리고, 차량 컴퓨팅 디바이스는 차량이 기간 내에 운전될 가능성이 있다고 결정될 때 차량이 기간 내에 운전될 가능성이 있음을 나타내는 통지를 적어 도 하나의 마스터 컴퓨팅 디바이스에 발송하도록 구성될 수 있다. 또한, 이러한 예들에서, 차량 컴퓨팅 디바이 스는 차량이 기간 내에 운전될 가능성이 있다고 결정될 때 ANN을 훈련하기 위한 적어도 하나의 작업의 실행을 종료하도록 구성될 수 있다. 또한, 차량 컴퓨팅 디바이스는 차량이 기간 내에 운전될 가능성이 있다고 결정될 때 ANN을 훈련하기 위한 적어도 하나의 작업의 실행을 금지하도록 구성될 수 있다. 이러한 실시예 및 기타에서, 제1 차량 정보는 차량이 사람에 의해 점유되지 않은 지속시간, 차량이 정지해 있는 지속시간, 차량의 주차 브레이크가 적용된 지속시간 또는 차량의 변속기가 주차로 설정된 지속시간 또는 이들의 임의의 조합을 포함할 수 있다. 제2 차량 정보는 차량에 진입하는 사람의 표시, 주차 브레이크의 해제 표시, 또 는 주차에서 주행 모드 또는 기어로의 변속기 변경 표시, 또는 이들의 조합을 포함할 수 있다. 이러한 예에서, 제1 전자 시스템은 차량이 주차되었는지 여부와 관련된 제1 파라미터를 감지하도록 구성될 수 있는 적어도 하나의 센서, 카메라, GPS, 또는 이들의 조합을 포함할 수 있다. 제1 파라미터는 차량에 사람이 없 는 지속시간, 차량이 정지해 있는 지속시간, 차량의 주차 브레이크가 적용된 지속시간 또는 차량의 변속기가 주 차하도록 설정된 지속시간, 또는 이들의 임의의 조합을 포함할 수 있다. 적어도 하나의 센서, 카메라, GPS, 또 는 이들의 조합은 또한 감지된 제1 파라미터에 기초하여 제1 차량 정보를 생성하도록 구성될 수 있다. 또한, 이러한 예 및 기타에서, 제2 전자 시스템은 차량이 일정 기간 내에 운전될 가능성이 있는지 여부와 관련 된 제2 파라미터를 감지하도록 구성될 수 있는 적어도 하나의 센서, 카메라, GPS, 또는 이들의 조합을 포함할 수 있다. 제2 파라미터는 차량에 진입하는 사람, 주차 브레이크 해제, 주차에서 운전 모드 또는 기어로의 변속 기 변경, 또는 이들의 임의의 조합을 포함할 수 있다. 적어도 하나의 센서, 카메라, GPS, 또는 이들의 조합은 또한 감지된 제2 파라미터에 기초하여 제2 차량 정보를 생성하도록 구성될 수 있다. 또한, 차량 컴퓨팅 디바이스는 (예를 들어 차량이 주차된 경우) ANN을 훈련하기 위한 적어도 하나의 작업에 대 한 ANN-입력 데이터를 국부적으로 생성하도록 구성될 수 있다. 차량 컴퓨팅 디바이스는 또한 적어도 하나의 마 스터 컴퓨팅 디바이스로부터 ANN을 훈련하기 위한 적어도 하나의 작업(예를 들어, 차량이 주차되어 있을 때)에 대한 ANN-입력 데이터를 수신하도록 구성될 수 있다. 본 명세서에 설명된 차량의 컴포넌트들 중 임의의 하나는 마스터 컴퓨팅 디바이스(들)(예를 들어, 마스터 컴퓨팅 디바이스들(142, 302, 320 내지 322)도 참조)에 차량 컴퓨팅 시스템(예를 들어, 컴퓨팅 시스템(104 또는 204) 참조)이 ANN 훈련 작업을 수행하기 위해 선택될 준비 및/또는 승인되었다는 정보를 제공하기 위한 시스템 의 일부일 수 있다. 또한, 선택될 차량 컴퓨팅 시스템의 준비 상태는 호스트 차량이 주차되었을 때인 것으로 나타났지만, 차량의 다 른 상태 또는 차량의 일부의 다른 상태는 차량 컴퓨팅 시스템이 ANN을 훈련하는 작업을 수행할 준비가 되었다는표시일 수 있음을 이해해야 한다. 또한, 본 개시의 대부분은 차량이 ANN 훈련 작업을 수행하기 위한 컴퓨팅 시 스템을 선택 해제하는 결정 요인으로 운전을 하려고 하는 상태에 있는 것으로 설명된다. 그러나, 차량의 다른 상태 또는 차량의 일부의 다른 상태는 차량 컴퓨팅 시스템이 ANN 훈련 작업을 수행하기 위해 선택 해제될 준비 가 되었다는 표시일 수 있음을 이해해야 한다. 차량 컴퓨팅 디바이스 외에(예를 들어, 각각 차량들(102 및 202)의 컴퓨팅 시스템들(104 및 204) 참조), 본 명 세서에 개시된 차량들은 적어도 바디의 제어 가능한 부분, 파워트레인의 제어 가능한 부분, 및 파워 스티어링의 제어 가능한 부분을 위한 전자장치를 포함하는 차량 전자장치를 포함한다. 본 명세서에 개시된 차량들은 바디의 제어 가능한 부분들을 포함할 수 있으며 이러한 부분들 및 서브시스템은 바디 제어 모듈(예를 들어, 모듈 참조)에 연결될 수 있다. 바디는 파워트레인을 지지하기 위한 적어도 프레임을 포함할 수 있다. 차량의 섀시 (chassis)는 차량의 프레임에 부착될 수 있다. 바디는 또한 적어도 한 명의 운전자 또는 승객을 위한 내부를 포 함할 수 있다. 내부는 좌석들을 포함할 수 있다. 바디의 제어 가능한 부분들은 또한 하나 이상의 파워 도어들 및/또는 하나 이상의 파워 창문들을 포함할 수 있다. 바디는 또한 바디의 다른 알려진 부분들을 포함할 수 있다. 그리고, 바디의 제어 가능한 부분들은 또한 컨버터블 탑, 선루프, 파워 시트, 및/또는 차량 바디의 임의 의 다른 유형의 제어 가능한 부분들을 포함할 수 있다. 바디 제어 모듈은 바디의 제어 가능한 부분들을 제어할 수 있다. 또한, 본 명세서에 개시된 차량들은 파워트레인의 제어가능한 부분들을 포함할 수 있다. 파워트레인의 제어 가 능한 부분들과 그 부분들 및 서브시스템은 파워트레인 제어 모듈(예를 들어, 모듈 참조)에 연결된다. 파워 트레인의 제어 가능한 부분들은 적어도 엔진, 변속기, 구동축, 서스펜션 및 스티어링 시스템, 및 파워트레인 전 기 시스템을 포함할 수 있다. 파워트레인은 또한 차량 파워트레인의 임의의 다른 알려진 부분들을 포함할 수 있 고 파워트레인의 제어 가능한 부분은 파워트레인의 임의의 다른 알려진 제어 가능한 부분들을 포함할 수 있다. 또한, 제어 가능한 파워 스티어링 부분들은 파워 스티어링 제어 유닛(예를 들어, 제어 유닛 참조)을 통해 제어될 수 있다. 모바일 디바이스, 다른 유형의 컴퓨팅 디바이스 또는 차량의 UI 요소들과 같은 본 명세서에 설명된 UI 요소들은 임의의 유형의 UI를 포함할 수 있다. UI 요소들은 자동차 제어이거나, 그 일부이거나, 이를 포함할 수 있고, 전 자 시스템이거나, 그 일부이거나 이를 포함할 수 있다. 또한 UI는 가속 페달, 브레이크 페달 또는 스티어링 휠 이 될 수 있다. 또한 UI는 전자 디바이스 및/또는 전기-기계 디바이스의 일부이거나 이를 포함할 수 있고, 촉각 UI(터치), 시각 UI(시각), 청각 UI(소리), 후각 UI(후각), 평형 UI(균형) 또는 미각 UI(맛), 또는 이들의 임의 의 조합의 일부이거나 이를 포함할 수 있다. 본 명세서에 기재된 센서들(예를 들어, 센서들(114a 내지 114b) 참조) 및 본 명세서에 기재된 카메라들(예를 들 어, 카메라들(118a 내지 118b) 참조)은 복수의 UI 요소들 또는 그 출력 또는 차량 또는 그 주변의 임의의 다른 부분들의 하나 이상의 피쳐 또는 특징을 감지 및/또는 기록하도록 각각 구성된 임의의 유형의 센서 또는 카메라 를 포함할 수 있다. 차량의 센서 또는 카메라는 또한 감지 및/또는 기록된 피쳐(들) 또는 특징(들)에 따라 복수 의 UI 요소들 또는 그 출력 또는 차량 또는 그 주변의 임의의 다른 부분들의 하나 이상의 피쳐 또는 특징에 대 응하는 데이터를 생성하도록 구성될 수 있다. 차량의 센서 또는 카메라는 또한 하나 이상의 피쳐 또는 특징에 대응하는 생성된 데이터를 출력하도록 구성될 수 있다. 복수의 센서들 또는 카메라들 중 임의의 하나는 하나 이 상의 피쳐 또는 특징에 대응하는 생성된 데이터를 CAN 버스를 통해 컴퓨팅 시스템(컴퓨팅 시스템(104 또는 20 4)과 같은) 또는 차량의 다른 전자 회로부로 발송하도록 구성할 수도 있다. 본 명세서에 기술된 차량의 운전을 제어하기 위한 기계적 컴포넌트들의 세트는 다음을 포함할 수 있다: 차 량 바퀴의 브레이크 메커니즘(바퀴의 회전을 멈추기 위해), 구동축이 얼마나 빨리 회전할 수 있는지, 따라 서 차량이 얼마나 빨리 달릴 수 있는지를 결정하는 차량의 엔진 또는 모터의 스로틀 메커니즘(throttle mechanism)(엔진에 들어가는 가스의 양 또는 모터에 들어가는 전류의 양을 조절하기 위해), 차량의 앞바퀴 방향에 대한 스티어링 메커니즘(예를 들어, 차량이 바퀴가 가리키는 방향으로 이동하도록 함). 이러한 메커니즘 들은 차량의 제동(또는 감속), 가속(또는 스로틀링) 및 스티어링을 제어할 수 있다. 사용자는 일반적으로 브레 이크 페달, 가속 페달 및 스티어링 휠인 사용자가 조작할 수 있는 UI 요소들(예를 들어, 도 2에 도시된 차량 의 다른 컴포넌트들 참조)을 통해 이러한 메커니즘들을 간접적으로 제어한다. 페달들과 스티어링 휠 은 제동, 가속 및 스티어링을 위해 구동 메커니즘에 반드시 기계적으로 연결되어 있지는 않다. 이러한 부분들은 운전자가 페달을 얼마나 많이 밟았는지 및/또는 스티어링 휠을 돌렸는지 측정하는 센서들을 갖거나 그에 근접할 수 있다. 감지된 제어 입력은 배선을 통해 제어 유닛들로 송신된다(따라서 드라이브 바이 와이어(drive-by- wire)일 수 있음). 이러한 제어 유닛들은 바디 제어 모듈(108 또는 220), 파워트레인 제어 모듈(110 또는 222),파워 스티어링 제어 유닛(112 또는 224), 배터리 관리 시스템 등을 포함할 수 있다. 이러한 출력은 또한 본 명세서에 설명된 센서들 및 카메라들(예를 들어, 센서들(114a 내지 114b 또는 217a 내지 217b) 및 카메라들 (118a 들 118b 또는 219a 들 219b) 참조)에 의해 감지 및/또는 기록될 수 있다. 그리고, 센서들 및 카메라들의 출력은 ANN 훈련 클라이언트에 의해 추가로 처리될 수 있고, 그 다음 누적 데이터 처리(cumulative data processing)를 위해 외부 컴퓨팅 디바이스(마스터 컴퓨팅 디바이스(들)와 같은)에 보고될 수 있다. 차량(102 또는 202)과 같은 차량에서, 운전자는 기계적 연결 및 일부 전기-기계적 연결을 통해 구동 컴포넌트들 을 인터페이싱하는 물리적 제어 요소들(예를 들어, 핸들, 브레이크 페달, 가속 페달, 패들 기어 시프터 등)을 통해 차량을 제어할 수 있다. 그러나 현재 점점 더 많은 차량들이 전자 제어 요소들 또는 모듈들(예를 들어, 전 자 제어 유닛들 또는 ECU들)을 통해 기계식 파워트레인 요소들(예를 들어, 브레이크 시스템, 스티어링 메커니즘, 드라이브 트레인 등)과 인터페이싱하는 제어 요소들을 가지고 있다. 전자 제어 요소들 또는 모듈들은 드라이브 바이 와이어 기술의 일부가 될 수 있다. 드라이브 바이 와이어 기술은 기계적 연결에 의해 전통적으로 달성된 차량 기능들을 수행하기 위한 전기 또는 전기-기계 시스템을 포함할 수 있다. 이 기술은 기존의 기계식 제어 시스템을 전자기계식 액추에이터와 페달 및 스티어링 느낌 에뮬레이터(steering feel emulator)와 같은 인간-기계(human-machine) 인터페이스를 사용하는 전자 제어 시스템으로 대체할 수 있다. 스티어링 컬럼, 중간 샤프트, 펌프, 호스, 벨트, 냉각기, 진공 서보 및 마스터 실린더와 같은 컴포넌트들이 차량에서 제거될 수 있다. 드라이브 바이 와이어 기술의 정도와 유형은 다 양하다. 이러한 실시예 및 다른 실시예에서, 복수의 UI는 스티어링 제어(예를 들어, 스티어링 휠 또는 GUI 또는 스티어 링을 위한 음성 입력 UI와 같은 다른 유형의 UI 등가물)을 포함할 수 있다. 또한, 복수의 UI는 제동 제어(예를 들어, 브레이크 페달 또는 GUI 또는 제동을 위한 음성 입력 UI와 같은 다른 유형의 UI 등가물)을 포함할 수 있 다. 복수의 UI는 또한 스로틀링 제어(예를 들어, 가속 페달 또는 GUI 또는 차량을 가속하기 위한 음성 입력 UI 와 같은 다른 유형의 UI 등가물)을 포함할 수 있다. 또한, 복수의 UI는 변속기 제어(예를 들어, 수동 기어박스 및 운전자 작동 클러치 또는 GUI 또는 차량의 기어 변경을 위한 음성 입력 UI와 같은 다른 유형의 UI 등가물)를 포함할 수 있다. 일부 실시예에서, 차량의 컴퓨팅 시스템을 포함하거나 그 일부일 수 있는 차량(예를 들어, 차량들(102 및 202) 참조)의 전자 회로는 엔진 전자장치, 전송 전자장치, 섀시 전자장치, 승객 환경 및 안락한 전자장치, 차량내 엔 터테인먼트 전자장치, 차량내 안전 전자장치, 또는 내비게이션 시스템 전자장치, 또는 이들의 임의의 조합 중 적어도 하나를 포함할 수 있다(예를 들어, 도 1 및 도 2에 각각 도시된 바디 제어 모듈(108 및 220), 파워트레 인 제어 모듈(110 및 222), 파워 스티어링 제어 유닛(112, 224), 배터리 관리 시스템, 및 인포테인먼트 전 자장치 참조). 일부 실시예에서, 차량의 전자 회로부는 자동 운전 시스템을 위한 전자장치를 포함할 수 있다. 일부 실시예에서, 차량의 컴퓨팅 시스템(예를 들어, 컴퓨팅 시스템(104 또는 204))은 중앙 제어 모듈(CCM), 중 앙 타이밍 모듈(CTM), 및/또는 일반 전자 모듈(GEM)을 포함할 수 있다. 또한, 일부 실시예에서, 차량은 ECU를 포함할 수 있고, 이는 차량의 하나 이상의 전기 시스템 또는 서브시스템을 제어하는 자동차 전자장치의 모든 임 베디드 시스템이 될 수 있다. ECU의 유형은 엔진 제어 모듈(ECM), 파워트레인 제어 모듈(PCM), 변속기 제어 모 듈(TCM), 브레이크 제어 모듈(BCM 또는 EBCM), CCM, CTM, GEM, 바디 컨트롤 모듈(BCM), 서스펜션 제어 모듈 (SCM), 도어 제어 유닛(DCU) 등을 포함할 수 있다. ECU 유형은 또한 파워 스티어링 제어 유닛(PSCU), 하나 이상 의 인간-기계 인터페이스(HMI) 유닛, 파워트레인 제어 모듈(PCM)-이는 최소한 ECM 및 TCM으로 기능할 수 있음, 시트 제어 유닛, 속도 제어 유닛, 텔레매틱 제어 유닛, 변속기 제어 장치, 브레이크 제어 모듈 및 배터리 관리 시스템을 포함할 수 있다. 도 2에 도시된 바와 같이, 네트워크 시스템은 적어도 차량들(130 내지 132) 및 차량을 포함할 수 있 고, 이는 적어도 차량 컴퓨팅 시스템, 내부(도시되지 않음)를 갖는 바디(도시되지 않음), 파워트레인(도시 되지 않음), 기후 제어 시스템(도시되지 않음) 및 인포테인먼트 시스템(도시되지 않음)을 포함한다. 차량 은 다른 차량 부분들도 포함할 수 있다. 컴퓨팅 시스템과 유사한 구조 및/또는 기능을 가질 수 있는 컴퓨팅 시스템은 적어도 로컬 대 디바이 스 네트워크, 예를 들어, 블루투스 등, 광역 네트워크(WAN), 근거리 통신망(LAN), 인트라넷, 4G 또는 5G와 같은 모바일 무선 네트워크, 엑스트라넷, 인터넷, 및/또는 이들의 임의의 조합을 포함할 수 있는 통신 네트워크 (들)에 연결될 수 있다. 컴퓨팅 시스템은 그 기계에 의해 취해질 조치를 지정하는 명령어들의 세트를실행(순차적 또는 기타)할 수 있는 기계일 수 있다. 또한, 컴퓨팅 시스템에 대해 단일 기계가 예시되어 있 지만, \"기계\"라는 용어는 방법론 또는 동작을 수행하기 위해 명령어들의 세트(또는 여러 세트들)를 개별적으로 또는 공동으로 실행하는 기계들의 집합도 포함하는 것으로 간주된다. 그리고, 이는 적어도 버스(예를 들어, 버 스 참조) 및/또는 마더보드, 하나 이상의 제어기(예를 들어, 하나 이상의 CPU, 예를 들어 제어기 참 조), 임시 데이터 저장소를 포함할 수 있는 메인 메모리(예를 들어, 메모리 참조), 적어도 하나의 유형의 네트워크 인터페이스(예를 들어, 네트워크 인터페이스 참조), 영구적인 데이터 저장소를 포함할 수 있는 저장 시스템(예를 들어, 데이터 저장 시스템 참조), 및/또는 이들의 임의의 조합을 포함할 수 있다. 일부 멀티-디바이스 실시예에서, 하나의 디바이스는 본 명세서에 설명된 방법의 일부를 완료한 다음 다른 디바이스가 본 명세서에 설명된 방법의 다른 단계를 계속할 수 있도록 네트워크를 통해 다른 디바이스에 완료 결과를 발송 할 수 있다. 도 2는 또한 ANN 훈련 클라이언트를 포함하고 구현할 수 있는 컴퓨팅 시스템의 예시적인 부분을 도시 한다. 컴퓨팅 시스템은 도시된 바와 같이 네트워크(들)에 통신 가능하게 결합될 수 있다. 컴퓨팅 시 스템은 적어도 버스, ANN 훈련 클라이언트의 명령어를 실행할 수 있는 제어기(예를 들어, CPU), 실행을 위해 ANN 훈련 클라이언트의 명령어를 저장할 수 있는 메모리, 네트워크 인터페이스 , ANN 훈련 클라이언트에 대한 명령어를 저장할 수 있는 데이터 저장 시스템, 및 GPS 컴포넌트, 카메라와 같은 I/O 컴포넌트 및 다양한 유형의 사용자 인터페이스 컴포넌트들(본 명세서에 설명된 복수의 UI 요 소들 중 하나 이상을 포함할 수 있음) 및 센서들(본 명세서에 설명된 복수의 센서들 중 하나 이상을 포함할 수 있음)과 같은 모바일 또는 컴퓨팅 디바이스에서 발견되는 임의의 유형의 컴포넌트일 수 있는 기타 컴포넌트 를 포함한다. 다른 컴포넌트들은 하나 이상의 사용자 인터페이스(예를 들어, GUI, 청각적 사용자 인 터페이스, 촉각적 사용자 인터페이스, 자동차 제어 등), 디스플레이, 다양한 유형의 센서, 촉각, 오디오 및/또 는 시각적 입력/출력 디바이스, 추가 어플리케이션별 메모리, 하나 이상의 추가 제어기(예를 들어, GPU), 또는 이들의 임의의 조합을 포함할 수 있다. 컴퓨팅 시스템은 또한 본 명세서에서 설명된 센서들 또는 카메라들 중 하나 이상이 될 수 있는(예를 들어, 센서들(217a 내지 217b) 및 카메라들(219a 내지 219b) 참조) 차량 의 센서들 및 카메라들을 인터페이싱하도록 구성된 센서 및 카메라 인터페이스를 포함할 수 있다. 버스는 일부 실시예에서 제어기, 메모리, 네트워크 인터페이스, 데이터 저장 시스템, 다른 컴포넌 트, 센서 및 카메라 뿐만 아니라 센서 및 카메라 인터페이스를 통신적으로 결합한다. 컴퓨팅 시스템 은 적어도 제어기, 메모리, 및 데이터 저장 시스템(예를 들어, 판독 전용 메모리(ROM), 플래시 메모리, 동적 랜덤 액세스 메모리(DRAM), 예를 들어 동기식 DRAM(SDRAM) 또는 램버스 DRAM(RDRAM), 정적 랜덤 액세스 메모리(SRAM), 크로스 포인트 메모리, 크로스바 메모리 등)을 포함하는 컴퓨터 시스템을 포함하고, 이들 은 버스(여러 버스들을 포함할 수 있음)를 통해 서로 통신한다. 일부 실시예에서, 컴퓨팅 시스템은 실행될 때 기계가 본 명세서에서 논의된 방법론 중 임의의 하나 이상을 수행하게 하기 위한 명령어들의 세트를 포함할 수 있다. 이러한 실시예에서, 기계는 LAN, 인트라넷, 엑스트라넷, 및/또는 인터넷(예를 들어, 네트워크(들))의 다른 기계들에 연결(예를 들어, 네트워크 인터페 이스를 통해 네트워킹됨)될 수 있다. 기계는 클라이언트-서버 네트워크 환경에서 서버 또는 클라이언트 기 계의 용량으로서 피어 투 피어(또는 분산) 네트워크 환경에서 피어 기계로서, 또는 클라우드 컴퓨팅 인프라 또 는 환경에서 서버 또는 클라이언트 시스템으로서 동작할 수 있다. 제어기는 마이크로프로세서, 중앙 처리 장치 등과 같은 하나 이상의 범용 처리 디바이스를 나타낸다. 보다 구체적으로, 처리 디바이스는 CISC(complex instruction set computing) 마이크로프로세서, RISC(reduced instruction set computing) 마이크로프로세서, VLIW(very long instruction word) 마이크로프로세서, SIMD(single instruction multiple data), MIMD(multiple instructions multiple data) 또는 다른 명령어 세 트를 구현하는 프로세서, 또는 명령어 세트들의 조합을 구현하는 프로세서일 수 있다. 제어기는 또한 ASIC, FPGA와 같은 프로그램 가능 로직, 디지털 신호 프로세서(DSP), 네트워크 프로세서 등과 같은 하나 이상의 특수 목적 처리 디바이스일 수 있다. 제어기는 본 명세서에서 논의된 동작 및 단계를 수행하기 위한 명령 어를 실행하도록 구성된다. 제어기는 (네트워크(들)와 같은) 하나 이상의 통신 네트워크를 통해 통신 하기 위해 네트워크 인터페이스와 같은 네트워크 인터페이스 디바이스를 더 포함할 수 있다. 데이터 저장 시스템은 본 명세서에 설명된 방법론 또는 기능 중 임의의 하나 이상을 구현하는 하나 이상의 명령어 세트 또는 소프트웨어가 저장되어 있는 기계 판독가능 저장 매체(컴퓨터 판독 가능 매체라고도 함)를 포 함할 수 있다. 데이터 저장 시스템은 데이터 저장 시스템에 상주하는 명령어를 적어도 부분적으로 실행할 수 있는 것과 같은 실행 능력을 가질 수 있다. 명령어는 또한 컴퓨터 시스템에 의해 실행되는 동안 메모리및/또는 제어기 내에 완전히 또는 적어도 부분적으로 상주할 수 있으며, 메모리 및 제어기는 또 한 기계 판독가능 저장 매체를 구성한다. 메모리는 시스템의 메인 메모리이거나 이를 포함할 수 있다. 메모리는 메모리에 상주하는 명령어를 적어도 부분적으로 실행할 수 있는 것과 같은 실행 능력을 가 질 수 있다. 차량은 또한 바디의 바디 제어 모듈, 파워트레인의 파워트레인 제어 모듈, 파워 스티어링 제어 유닛, 배터리 관리 시스템, 인포테인먼트 시스템의 인포테인먼트 전자장치, 및 적어도 차량 컴 퓨팅 시스템, 바디 제어 모듈, 파워트레인 제어 모듈, 파워 스티어링 제어 유닛, 배터리 관리 시스템 및 인포테인먼트 전자장치를 연결하는 CAN 버스를 가질 수 있다. 또한, 도시된 바와 같이, 차량은 차량 컴퓨팅 시스템을 통해 네트워크(들)에 연결된다. 또한, 도시된 바와 같이, 차량들(130 내지 132) 및 마스터 컴퓨팅 디바이스(들)는 네트워크(들)에 연결된다. 따라서, 차량에 통신 가능하게 결합된 다. 차량은 또한 컴퓨팅 시스템의 일부일 수 있는 복수의 센서들(예를 들어, 센서들(217a 내지 217b) 참 조) 및 복수의 카메라들(예를 들어, 카메라들(219a 내지 219b) 참조)를 갖는 것으로 도시되어 있다. 일부 실시 예에서, CAN 버스는 복수의 센서들 및 복수의 카메라들, 차량 컴퓨팅 시스템, 바디 제어 모듈, 파워 트레인 제어 모듈, 파워 스티어링 제어 유닛, 배터리 관리 시스템 및 인포테인먼트 전자장치를 적어도 컴퓨팅 시스템에 연결할 수 있다. 복수의 센서들 및 복수의 카메라들은 컴퓨팅 시스템의 센서 및 카메라 인터페이 스를 통해 컴퓨팅 시스템에 연결될 수 있다. 본 명세서에 설명된 차량의 컴포넌트들 중 임의의 하나는 마스터 컴퓨팅 디바이스(들)(예를 들어, 마스터 컴퓨팅 디바이스들(142, 302, 320 내지 322)도 참조)에 차량 컴퓨팅 시스템(예를 들어, 컴퓨팅 시스템(104 또는 204) 참조)이 ANN 훈련 작업을 수행하기 위해 선택될 준비 및/또는 승인되었다는 정보를 제공하기 위한 시스템 의 일부일 수 있다. 또한, 선택될 차량 컴퓨팅 시스템의 준비가 호스트 차량이 주차될 때인 것으로 도시되었지만, 차량의 다른 상태 또는 차량의 일부의 다른 상태는 차량 컴퓨팅 시스템이 ANN을 훈련하는 작업을 수행할 준비가 되었다는 표시일 수 있음을 이해해야 한다. 또한, 본 개시의 대부분은 차량이 ANN 훈련 작업을 수행하기 위한 컴퓨팅 시스템의 선택을 해제하는 결정 요인으로 운전을 앞두고 있는 상태에 있는 것으로 설명된다. 그러나, 차량의 다른 상태 또는 차량의 일부의 다른 상태는 차량 컴퓨팅 시스템이 ANN 훈련 작업을 수행하기 위해 선택 해제될 준비가 되 었다는 표시일 수 있음을 이해해야 한다. 도 3에 도시된 바와 같이, 일부 실시예에서 네트워크 시스템은 다수의 마스터 컴퓨팅 디바이스들을 포함할 수 있다(예를 들어, 마스터 컴퓨팅 디바이스들(302, 320 내지 322) 참조). 마스터 컴퓨팅 디바이스와 다소 유사한 구조 및/또는 기능을 가질 수 있는 마스터 컴퓨팅 디바이스는 통신 네트워크(들)에 연결될 수 있다. 따라서, 차량들(102, 202, 130 내지 132)과 마스터 컴퓨팅 디바이스들(320 내지 322)에 연결될 수 있다. 도시되지는 않았지만, 마스터 컴퓨팅 디바이스(또는 마스터 컴퓨팅 디바이스(320 또는 322))는 하나 이상 의 센서들, 하나 이상의 UI 요소들, GPS 디바이스, 및/또는 하나 이상의 카메라들을 포함할 수 있다. 따라서, 마스터 컴퓨팅 디바이스(또는 마스터 컴퓨팅 디바이스(320 또는 322))는 컴퓨팅 시스템(104 또는 204)과 유사하게 동작할 수 있고 일부 실시예에서 ANN 훈련 클라이언트도 호스팅 및 운영할 수 있다. 마스터 컴퓨팅 디바이스는 하나 이상의 서버 컴퓨터들일 수 있거나, 그 일부이거나, 이를 포함할 수 있다. 또한, 마스터 컴퓨팅 디바이스는 실시예에 따라 모바일 디바이스, 스마트폰, 태블릿 컴퓨터, IoT 디바이스, 스마트 텔레비전, 스마트 워치, 안경 또는 기타 스마트 가전 제품, 차량내 정보시스템, 웨어러블 스 마트 디바이스, 게임 콘솔, PC 또는 디지털 카메라, 또는 이들의 임의의 조합일 수 있거나, 그 일부일 수 있거 나, 이를 포함할 수 있다. 도시된 바와 같이, 마스터 컴퓨팅 디바이스는 적어도 로컬 투 디바이스 네트워 크, 예를 들어 블루투스 등, 광역 네트워크(WAN), 근거리 통신망(LAN), 인트라넷, 4G 또는 5G와 같은 모바일 무 선 네트워크, 엑스트라넷, 인터넷 및/또는 이들의 조합을 포함하는 통신 네트워크(들)에 연결될 수 있다. 본 명세서에 설명된 마스터 컴퓨팅 디바이스들의 각각은 개인용 컴퓨터(PC), 태블릿PC, 셋톱박스(STB), 개인휴 대정보비서(PDA), 휴대폰, 웹 어플라이언스, 서버, 네트워크 라우터, 스위치나 브리지, 또는 해당 기계가 취해 야 할 조치를 지정하는 명령어들이 세트를 실행(순차적이든 아니든)할 수 있는 임의의 기계이거나 이로 대체될 수 있다. 본 명세서에 설명된 차량의 컴퓨팅 시스템은 해당 기계에 의해 취해질 조치를 지정하는 명령어들의 세 트를 실행(순차적 또는 기타)할 수 있는 기계일 수 있다.또한, 본 명세서에 설명된 컴퓨팅 시스템 및 모바일 디바이스에 대해 단일 기계가 예시되어 있지만, \"기계\"라는 용어는 또한 본 명세서에서 논의된 방법론 또는 동작 중 하나 이상을 수행하기 위해 명령어들의 세트(또는 여러 세트들)를 개별적으로 또는 공동으로 실행하는 기계들의 집합을 포함하는 것으로 간주되어야 한다. 그리고, 예 시된 모바일 디바이스들의 각각은 각각 적어도 버스 및/또는 마더보드, 하나 이상의 제어기(예를 들어, 하나 이 상의 CPU), 임시 데이터 저장소를 포함할 수 있는 메인 메모리, 하나 이상의 유형의 네트워크 인터페이스, 영구 데이터 저장소를 포함할 수 있는 저장 시스템, 및/또는 이들의 임의의 조합을 포함할 수 있다. 일부 멀티-디바 이스 실시예에서, 하나의 디바이스는 본 명세서에 설명된 방법의 일부를 완료한 다음 다른 디바이스가 본 명세 서에 설명된 방법의 다른 단계를 계속할 수 있도록 네트워크를 통해 다른 디바이스에 완료 결과를 발송할 수 있 다. 도 3은 또한 본 개시의 일부 실시예에 따른 마스터 컴퓨팅 디바이스의 예시적인 부분들을 도시한다. 마스 터 컴퓨팅 디바이스는 도시된 바와 같이 네트워크(들)에 통신 가능하게 결합될 수 있다. 마스터 컴퓨 팅 디바이스는 적어도 버스, 제어기(예를 들어, CPU), 메모리, 네트워크 인터페이스, 및 데이터 저장 시스템을 포함한다. 도시되지 않았지만, 마스터 컴퓨팅 디바이스는 컴퓨팅 디바이스 에서 발견되는 임의의 유형의 컴포넌트들-예를 들어, GPS 컴포넌트, 다양한 유형의 사용자 인터페이스 컴포넌트 와 같은 I/O 컴포넌트, 센서 및 하나 이상의 카메라와 같은 다른 컴포넌트들도 포함할 수 있다. 버스는 제 어기, 메모리, 네트워크 인터페이스, 데이터 저장 시스템 및 다른 컴포넌트를 통신적 으로 연결한다. 마스터 컴퓨팅 디바이스는 적어도 제어기, 메모리, 및 데이터 저장 시스템 (예를 들어, 판독 전용 메모리(ROM), 플래시 메모리, 동적 랜덤 액세스 메모리(DRAM), 예를 들어 동기식 DRAM(SDRAM) 또는 램버스 DRAM(RDRAM), 정적 랜덤 액세스 메모리(SRAM), 크로스 포인트 메모리, 크로스바 메모 리 등)을 포함하는 컴퓨터 시스템을 포함하고, 이들은 버스(여러 버스들을 포함할 수 있음)를 통해 서로 통신한다. 다시 말해서, 도 3은 본 개시의 실시예가 동작할 수 있는 컴퓨터 시스템을 갖는 마스터 컴퓨팅 디바이스의 블록도이다. 일부 실시예에서, 컴퓨터 시스템은 실행될 때 기계가 본 명세서에 논의된 방법론 중 일부를 수행하 게 하기 위한 명령어들의 세트를 포함할 수 있다. 이러한 실시예에서, 기계는 LAN, 인트라넷, 엑스트라넷, 및/ 또는 인터넷(예를 들어, 네트워크(들))의 다른 기계들에 연결(예를 들어, 네트워크 인터페이스를 통 해 네트워킹)될 수 있다. 기계는 클라이언트-서버 네트워크 환경에서 서버 또는 클라이언트 기계의 용량으로서 피어 투 피어(또는 분산) 네트워크 환경에서 피어 기계로서, 또는 클라우드 컴퓨팅 인프라 또는 환경에서 서버 또는 클라이언트 시스템으로서 동작할 수 있다. 제어기-제어기일 수 있거나, 이를 포함하거나, 그 일부일 수 있음-는 마이크로프로세서, 중앙 처리 유닛 등과 같은 하나 이상의 범용 처리 디바이스를 나타낸다. 보다 구체적으로, 처리 디바이스는 CISC(complex instruction set computing) 마이크로프로세서, RISC(reduced instruction set computing) 마이크로프로세서, VLIW(very long instruction word) 마이크로프로세서, SIMD(single instruction multiple data), MIMD(multiple instructions multiple data) 또는 다른 명령어 세트를 구현하는 프로세서, 또는 명령어 세트들 의 조합을 구현하는 프로세서일 수 있다. 제어기는 또한 ASIC, FPGA와 같은 프로그래밍 가능 로직, 디지털 신호 프로세서(DSP), 네트워크 프로세서 등과 같은 하나 이상의 특수 목적 처리 디바이스일 수 있다. 제어기 는 본 명세서에서 논의된 동작 및 단계를 수행하기 위한 명령어를 실행하도록 구성된다(예를 들어, 제어기 는 ANN 트레이너의 동작을 수행하기 위해 ANN 트레이너의 명령어를 실행하도록 구성될 수 있음). 제어기 는 (네트워크(들)과 같은) 하나 이상의 통신 네트워크를 통해 통신하기 위해 네트워크 인터페이스 와 같은 네트워크 인터페이스 디바이스를 더 포함할 수 있다. 데이터 저장 시스템은 본 명세서에 설명된 방법론 또는 기능 중 임의의 하나 이상을 구현하는 하나 이상의 명령어들의 세트 또는 소프트웨어(ANN 트레이너의 적어도 일부와 같은)가 저장되어 있는 기계 판독가능 저 장 매체(컴퓨터 판독 가능 매체라고도 함)를 포함할 수 있다. 데이터 저장 시스템은 데이터 저장 시스템에 상주하는 명령어를 적어도 부분적으로 실행할 수 있는 것과 같은 실행 능력을 가질 수 있다. 명령어는 또한 컴 퓨터 시스템에 의한 실행 동안 메모리 내 및/또는 제어기 내에 완전히 또는 적어도 부분적으로 상주 할 수 있으며, 메모리 및 제어기는 또한 기계 판독가능 저장 매체를 구성한다. 메모리는 디바이 스의 메인 메모리이거나 이를 포함할 수 있다. 메모리는 메모리에 상주하는 명령어를 적어도 부분적 으로 실행할 수 있는 것과 같은 실행 능력을 가질 수 있다. 예시적인 실시예에서는 메모리, 제어기 및 데이터 저장 부분들이 각각 단일 부분인 것으로 도시되었지만, 각각 의 부분은 명령어를 저장하고 그들의 개별 동작을 수행할 수 있는 단일 부분 또는 여러 부분들을 포함하는 것으로 간주되어야 한다. \"기계 판독 가능 저장 매체\"라는 용어는 기계에 의해 실행되는 명령어들의 세트를 저장하 거나 인코딩할 수 있고 기계가 본 개시의 방법론들 중 임의의 하나 이상을 수행하게 하는 임의의 매체를 포함하 는 것으로 간주된다. 따라서 \"기계 판독 가능 저장 매체\"라는 용어는 솔리드 스테이트 메모리, 광학 매체 및 자 기 매체를 포함하지만 이에 제한되지 않는 것으로 간주되어야 한다. 도 4는 본 개시의 일부 실시예에 따른, 도 1 내지 도 3에 도시된 네트워크 시스템의 양태에 의해 수행될 수 있 는 방법의 예시적인 동작의 흐름도를 도시한다. 예를 들어, 방법은 마스터 컴퓨팅 디바이스 (들), 마스터 컴퓨팅 디바이스, 마스터 컴퓨팅 디바이스, 및/또는 마스터 컴퓨팅 디바이스(320 내지 322)에 의해 수행될 수 있다. 도 4에서, 방법은 단계에서 제어기에 의해 ANN의 훈련의 컴퓨팅 작업들을 분리하는 것으로 시작한다. 단계는 ANN의 훈련을 위한 시스템(마스터 컴퓨팅 디바이스(들), 마스터 컴퓨팅 디바이스, 마스 터 컴퓨팅 디바이스, 및/또는 마스터 컴퓨팅 디바이스(320 내지 322)를 포함하는 시스템과 같은)의 제어기 에 의해 수행될 수 있다. 단계에서, 방법은 제어기에 의해, 차량이 주차되었음을 나타내는 주차된 차 량으로부터 수신된 통지에 따라 주차된 차량의 컴퓨팅 디바이스를 선택하는 것으로 계속된다. 차량은 일부 실시 예에서 반드시 주차될 필요는 없다. 그러한 실시예에서, 통지는 단지 차량의 컴퓨팅 디바이스가 제어기에 의해 사용되도록 승인되었음을 나타낼 수 있다. 단계에서, 방법은 선택된 컴퓨팅 디바이스에 분리된 작업들의 적어도 일부를 제어기에 의해 할당하는 것으로 계속된다. 단계에서, 방법은 제어기에 결합된 통신 인터페이스에 의해, 선택된 컴퓨팅 디바이 스에 할당된 작업들을 발송하는 것으로 계속된다. 단계에서, 방법은 통신 인터페이스에 의해, 선택된 컴퓨팅 디바이스로부터 할당된 작업들의 결과들을 수신하는 것으로 계속된다. 단계에서, 방법은 제어 기에 의해, ANN을 훈련하기 위해 할당된 작업들의 결과들을 조합하는 것으로 계속된다. 일부 예시적인 경우에 제어기는 ANN을 훈련시키기 위해 다른 차량들의 다른 컴퓨팅 디바이스들로부터 수행된 할당된 작업들의 다른 결 과들과 상기 결과들을 조합할 수 있다. 또한 이러한 결과들은 ANN 훈련을 지원하도록 모바일 디바이스를 승인한 사용자의 모바일 디바이스와 같이 차량의 일부가 아닌 다른 컴퓨팅 디바이스 또는 제어기에 의해 수행된 훈련 작업들의 결과들과 조합될 수 있다. 단계에서, 방법은 제어기에 의해, 결과에 따라 ANN을 훈련하는 것으로 계속된다. 단계에서, 방법은 차량이 일정 기간 내에 운전될 가능성이 있음을 나타내는 주차된 차량으로부터 수 신된 통지에 따라 주차된 차량의 컴퓨팅 디바이스를 제어기에 의해 선택 해제하는 것으로 계속된다. 단계 는 단계에서 ANN의 훈련 이후 또는 훈련 이전의 시간에 발생할 수 있다. 예를 들어, 단계는 통신 인 터페이스가 단계에서 선택된 컴퓨팅 디바이스로부터 할당된 작업들의 결과들을 수신하기 전에 발생할 수 있다. 그러한 예시적인 상황에서, 컴퓨팅 디바이스의 선택 해제 단계 후에, 다른 컴퓨팅 디바이스가 선택 될 수 있다. 예를 들어, 도 4에 도시된 바와 같이, 단계는 단계에서 컴퓨팅 디바이스의 선택 해제 후 에 다른 컴퓨팅 디바이스에 대해 반복될 수 있다. 그리고 나서, 단계에서, 처음에 컴퓨팅 디바이스에 할당 된 분리된 작업들 중 적어도 일부는 다른 컴퓨팅 디바이스(예를 들어, 최근에 주차된 것으로 발견된 다른 차량 의 다른 컴퓨팅 디바이스)에 재할당될 수 있다. 또한, 도 4에 도시된 바와 같이, 제어기가 단계에서 할당 된 작업들의 결과들을 조합할 준비가 될 때까지 단계들(406 내지 410)이 반복될 수 있다. 도 5는 본 개시의 일부 실시예에 따른, 도 1 내지 도 3에 도시된 네트워크 시스템의 양태에 의해 수행될 수 있 는 방법의 예시적인 동작의 흐름도를 도시한다. 예를 들어, 방법의 일부는 컴퓨팅 시스템(104 또는 204)과 같은 차량의 컴퓨팅 시스템에 의해 수행될 수 있다. 도 5에서, 방법은 차량의 제1 전자 시스템에 의해, 차량이 주차되었는지 여부와 관련된 제1 차량 정보를 생성 및 출력하는 단계에서 시작한다. 제1 전자 시스템은 본 명세서에 기재된 차량 제어 모듈 또는 ECU 중 임의의 하나 이상, 본 명세서에 기재된 카메라, GPS 디바이스 또는 센서 중 임의의 하나 이상, 또는 이들의 임 의의 조합으로 구성될 수 있다. 단계에서, 방법은 차량의 차량 컴퓨팅 디바이스(차량 컴퓨팅 시스템(104 또는 204)을 포함하거나 이 의 차량 컴퓨팅 디바이스와 같은)에 의해, 제1 전자 시스템으로부터 제1 차량 정보를 수신하는 것으로 계속된다. 단계에서, 방법은 차량 컴퓨팅 디바이스에 의해, 제1 전자 시스템으로부터 수신된 제1 차 량 정보에 따라 차량이 주차되었는지 여부를 결정하는 것으로 계속된다. 차량이 주차된 것으로 결정되면, 방법 은 단계에서 차량이 주차되어 있고 ANN을 훈련하기 위한 적어도 하나의 작업을 실행하기 위해 적어도 하나의 마스터 컴퓨팅 디바이스에 의해 선택 가능하다는 것을 나타내는 통지를 적어도 하나의 마스터 컴퓨팅 디바이스(예를 들어, 마스터 컴퓨팅 디바이스(들), 마스터 컴퓨팅 디바이스, 마스터 컴퓨팅 디바이스 , 및 마스터 컴퓨팅 디바이스(320 내지 322) 참조)로 발송하는 것으로 계속될 수 있다. 그렇지 않으면, 방 법은 단계에서 차량이 주차되었는지 여부와 관련된 차량 정보를 제1 전자 시스템에 의해 생성 및 출 력하는 것으로 계속된다. 단계에서, 방법은 차량이 주차되어 있는 동안 적어도 하나의 마스터 컴퓨팅 디바이스에 의해 차량 컴 퓨팅 디바이스에 할당된 ANN을 훈련하기 위한 적어도 하나의 작업을 차량 컴퓨팅 디바이스에 의해 수신 및 실행 하는 것으로 계속된다. 도 6은 본 개시의 일부 실시예에 따른, 도 1 내지 도 3에 도시된 네트워크 시스템의 양태에 의해 수행될 수 있 는 방법의 예시적인 동작의 흐름도를 도시한다. 예를 들어, 방법의 일부는 컴퓨팅 시스템(104 또는 204)과 같은 차량의 컴퓨팅 시스템에 의해 수행될 수 있다. 도시된 바와 같이, 방법은 방법 다음에 시작할 수 있고, 단계는 방법의 단계의 발생에 의존할 수 있다. 단계에서, 방법은 차량의 제2 전자 시스템에 의해 차량이 일정 기간 내에 운전될 가능성이 있는지 여 부와 관련된 제2 차량 정보를 생성 및 출력하는 것으로 계속된다. 제2 전자 시스템은 본 명세서에 기재된 차량 제어 모듈 또는 ECU 중 임의의 하나 이상, 본 명세서에 기재된 카메라, GPS 디바이스 또는 센서 중 임의의 하나 이상, 또는 이들의 임의의 조합으로 구성될 수 있다. 단계에서, 방법은 차량 컴퓨팅 디바이스에 의해 차량의 제2 전자 시스템으로부터 제2 차량 정보를 수 신하는 것으로 계속된다. 단계에서, 방법은 차량 컴퓨팅 디바이스에 의해, 제2 전자 시스템으로부터 수신된 제2 차량 정보에 따라 일정 기간 내에 차량이 운전될 가능성이 있는지 여부를 결정하는 것으로 계속된다. 차량이 일정 기간 내에 운전될 가능성이 있다고 결정되면, 방법은 단계에서 차량이 일정 기간 내에 운전될 가능성이 있음을 나타내는 통지를 적어도 하나의 마스터 컴퓨팅 디바이스에 발송하는 것으로 계속된다. 또한, 단계에서, 방법은 차량이 일정 기간 내에 운전될 가능성이 있다고 결정될 때 ANN을 훈련하기 위한 적어도 하나의 작업의 실행을 차량 컴퓨팅 디바이스에 의해 종료하는 것으로 계속된다. 그렇지 않으면, 도 6에 도시된 바와 같이, 방법은 차량이 일정 기간 내에 운전될 가능성이 있는지 여부와 관련된 차량 정보를 제2 전자 시스템에 의해 생성 및 출력하는 단계로 계속된다. 일부 실시예에서, 방법들(400, 500 또는 600)의 단계는 입력 데이터를 모니터링하고, 동작을 수행하고, 데이터 를 후속 단계로 출력함으로써 각 단계가 독립적으로 실행될 수 있는 것과 같은 연속 프로세스로 구현될 수 있음 을 이해해야 한다. 또한 각 방법에 대한 이러한 단계는 각 단계가 트리거하고 특정 출력을 생성해야 하는 이벤 트에서 트리거링될 수 있는 개별 이벤트 프로세스로 구현될 수 있다. 도 4 내지 6의 각각의 도면은 도 1 내지 3 에 부분적으로 제시된 것보다 더 복잡한 컴퓨터 시스템의 가능한 더 큰 방법 내의 최소 방법을 나타내는 것으로 또한 이해되어야 한다. 따라서, 도 4 내지 도 6의 각각의 도면에 도시된 단계는 더 복잡한 시스템의 더 큰 방법 과 관련된 다른 단계로부터 유입 및 유출되는 다른 단계와 결합될 수 있다. 본 명세서에 기술된 ANN은 차량의 드라이브 바이 와이어 프로세스, 또는 차량의 자동 운전 시스템, 또는 이들의 임의의 조합에 의해 사용될 수 있다. 또한, 본 명세서에 설명된 ANN은 차량 또는 다른 차량의 하나 이상의 카메 라에 의해 캡처된 기록된 환경 피쳐로부터 파생된 데이터를 처리하기 위해 차량의 시각적 데이터 처리 파이프라 인에 의해 사용될 수 있다. 또한 본 명세서에 설명된 ANN은 일반적으로 시각적 데이터 처리 파이프라인에 의해 사용될 수 있다. 본 명세서에 설명된 ANN은 또한 차량 또는 다른 차량의 하나 이상의 센서에 의해 캡처된 감지 된 환경 피쳐로부터 파생된 데이터를 처리하기 위해 차량의 비시각적 데이터 처리 파이프라인에 의해 사용될 수 있다. 또한, 본 명세서에 설명된 다른 ANN 뿐만 아니라 이러한 예의 ANN은 일반적으로 비시각적 데이터 처리 파 이프라인에 의해 사용될 수 있다. 또한, 본 명세서에 설명된 ANN은 차량 라우팅 어플리케이션, 비디오 게임 또는 의료 어플리케이션에 의해 사용 될 수 있다. 본 명세서에 설명된 ANN은 판매 예측, 고객 또는 시장 조사, 데이터 검증, 위험 관리 또는 이들의 조합 중 적어도 하나를 위한 비즈니스 어플리케이션에서도 사용될 수 있다. 또한, 본 명세서에서 설명된 ANN은 음성 인식 시스템 또는 이미지 인식 시스템에 의해 사용될 수 있다. 일반적으로 본 명세서에 설명된 ANN은 지도 학습을 포함하거나 포함하지 않는 임의의 기계 학습 작업에 대해 사용될 수 있다. 예를 들어, 본 명세서에 설명 된 ANN은 의학적 진단, 비즈니스 및/또는 기술 문제 해결, 기계 번역, 네트워크 필터링, 빅 데이터 시스템 필터 링, 비디오 게임, 비디오 게임과 멀티미디어의 새로운 부분의 실시간 생성에 사용될 수 있다. 또한 본 명세서에 설명된 ANN은 차량 자동화 및 자율 주행 자동차의 의사 결정을 가이드하는 데 사용될 수도 있다.본 명세서에 설명된 차량은 차량이 달리 지정되지 않는 한 모든 유형의 차량일 수 있음을 이해해야 한다. 차량 은 자동차, 트럭, 보트 및 비행기뿐만 아니라 군사, 건설, 농업 또는 레크리에이션 용도의 차량 또는 차량 장비 를 포함할 수 있다. 차량, 차량 부품 또는 차량의 운전자나 승객이 사용하는 전자 장치는 차량 전자 장치로 간 주될 수 있다. 차량 전자 장치는 엔진 관리, 점화, 라디오, 카푸터, 텔레매틱스, 차량 내 엔터테인먼트 시스템 및 기타 차량 부품용 전자 장치를 포함할 수 있다. 차량 전자 장치는 점화 및 엔진 및 변속기 제어와 함께 또는 그에 의해 사용될 수 있고, 이는 가스 동력 자동차, 트럭, 오토바이, 보트, 비행기, 군용 차량, 지게차, 트랙터 및 굴착기와 같은 내연 동력 기계가 장착된 차량에서 찾을 수 있다. 또한, 차량 전자 장치는 하이브리드 또는 전기 자동차와 같은 하이브리드 및 전기 자동차에서 발견되는 전기 시스템의 제어를 위해 관련 요소에 의해 또 는 관련 요소와 함께 사용될 수 있다. 예를 들어, 전기 자동차는 배터리 시스템 관리뿐만 아니라 주 추진 모터 제어를 위해 전력 전자 장치를 사용할 수 있다. 그리고 자율주행 차량은 거의 전적으로 차량 전자 장치에 의존 한다. 이전의 상세한 설명의 일부는 컴퓨터 메모리 내의 데이터 비트에 대한 동작의 알고리즘 및 기호 표현의 관점에 서 제시되었다. 이러한 알고리즘 설명 및 표현은 데이터 처리 기술 분야의 기술자가 자신의 작업 내용을 해당 기술 분야의 다른 사람에게 가장 효과적으로 전달하기 위해 사용하는 방법이다. 알고리즘은 여기서 일반적으로 원하는 결과로 이어지는 자체 일관된 동작들의 시퀀스로 간주된다. 동작들은 물리량의 물리적 조작이 필요한 동 작들이다. 일반적으로 반드시 그런 것은 아니지만 이러한 양은 저장, 결합, 비교 및 조작할 수 있는 전기 또는 자기 신호의 형태를 취한다. 주로 일반적인 사용을 위해 이러한 신호를 비트, 값, 요소, 기호, 문자, 용어, 숫 자 등으로 지칭하는 것이 때때로 편리한 것으로 입증되었다. 그러나 이러한 용어 및 유사한 용어 모두는 적절한 물리량과 관련되어야 하며 이러한 양에 적용되는 편리한 라 벨일 뿐이라는 점을 염두에 두어야 한다. 본 개시는 컴퓨터 시스템 또는 유사한 전자 컴퓨팅 디바이스의 동작 및 프로세스를 참조할 수 있으며, 이는 컴퓨터 시스템의 레지스터와 메모리 내에서 물리적(전자적) 수량으로 표 현된 데이터를 컴퓨터 시스템 메모리나 레지스터 또는 기타 정보 저장 시스템 내에서 물리적 수량으로 유사하게 표현된 다른 데이터로 조작하고 변환한다. 본 개시는 또한 본 명세서의 동작들을 수행하기 위한 장치에 관한 것이다. 이 장치는 의도된 목적을 위해 특별 히 제작될 수 있고 또는 컴퓨터에 저장된 컴퓨터 프로그램에 의해 선택적으로 활성화되거나 재구성되는 범용 컴 퓨터를 포함할 수 있다. 이와 같은 컴퓨터 프로그램은 컴퓨터 판독가능 저장 매체, 예를 들어, 플로피 디스크, 광 디스크, CD-ROM 및 광자기 디스크를 포함한 임의의 유형의 디스크, 판독 전용 메모리(ROM), 랜덤 액세스 메 모리(RAM), EPROM, EEPROM, 자기 또는 광학 카드, 또는 전자 명령어를 저장하는 데 적합한 임의의 유형의 미디 어에 저장될 수 있고, 이들 각각은 컴퓨터 시스템 버스에 연결된다. 본 명세서에 제시된 알고리즘과 디스플레이는 본질적으로 임의의 특정 컴퓨터나 다른 디바이스와도 관련이 없다. 다양한 범용 시스템이 본 명세서의 교시에 따라 프로그램과 함께 사용될 수 있거나, 방법을 수행하기 위 해 보다 전문화된 장치를 구성하는 것이 편리할 수 있다. 이러한 다양한 시스템의 구조는 아래 설명에 설명된 대로 나타난다. 또한, 본 개시는 임의의 특정 프로그래밍 언어를 참조하여 설명되지 않는다. 다양한 프로그래밍 언어가 본 명세서에 설명된 바와 같이 본 개시의 교시를 구현하기 위해 사용될 수 있다는 것이 이해될 것이다. 본 개시는 컴퓨터 프로그램 제품 또는 소프트웨어로서 제공될 수 있으며, 이는 본 개시에 따른 프로세스를 수행 하기 위해 컴퓨터 시스템(또는 다른 전자 디바이스)을 프로그래밍하는 데 사용될 수 있는 명령어가 저장된 기계 판독 가능 매체를 포함할 수 있다. 기계 판독 가능 매체는 기계(예를 들어, 컴퓨터)에 의해 판독 가능한 형태로 정보를 저장하기 위한 임의의 메커니즘을 포함한다. 일부 실시예에서, 기계 판독가능(예를 들어, 컴퓨터 판독가 능) 매체는 판독 전용 메모리(\"ROM\"), 랜덤 액세스 메모리(\"RAM\"), 자기 디스크 저장 매체, 광 저장 매체, 플래 시 메모리 컴포넌트 등과 같은 기계(예를 들어, 컴퓨터) 판독가능 저장 매체를 포함한다. 전술한 명세서에서, 본 개시의 실시예는 그 특정 예시적인 실시예를 참조하여 설명되었다. 다음의 청구범위에 기재된 바와 같이 본 개시의 실시형태의 보다 넓은 사상 및 범위를 벗어나지 않고 다양한 변형이 이루어질 수 있음이 명백할 것이다. 따라서, 본 명세서 및 도면은 제한적인 의미가 아니라 예시적인 의미로 간주되어야 한다.도면 도면1 도면2 도면3 도면4 도면5 도면6"}
{"patent_id": "10-2022-7035674", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 개시는 이하에 주어진 상세한 설명 및 본 개시의 다양한 실시예의 첨부 도면으로부터 보다 완전하게 이해될 것이다. 도 1 내지 도 3은 본 개시의 일부 실시예에 따른 차량 및 차량의 컴퓨팅 시스템을 통해 적어도 부분적으로 ANN 을 훈련하기 위한 하나 이상의 마스터 컴퓨팅 디바이스를 포함하는 예시적인 네트워크 시스템을 도시한다. 도 4 내지 도 6은 본 개시의 일부 실시예에 따른 도 1 내지 도 3에 도시된 네트워크 시스템의 양태에 의해 수행 될 수 있는 예시적인 동작의 흐름도를 도시한다."}
