{"patent_id": "10-2021-0189387", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0099935", "출원번호": "10-2021-0189387", "발명의 명칭": "AI 모델의 인간다움을 평가하는 AI 모델 평가 시스템 및 그 방법", "출원인": "(주)스마일게이트엔터테인먼트", "발명자": "송지현"}}
{"patent_id": "10-2021-0189387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "AI 모델을 구비하고, 채팅 어플리케이션과 연동하여 AI 모델 기반 채팅 서비스를 제공하는 적어도 하나 이상의인공지능 챗봇 시스템; 상기 인공지능 챗봇 시스템과 상기 채팅 어플리케이션의 연동을 통해 채팅을 수행하고, 상기 채팅 종료시, 상기채팅에 따른 대화내용을 텍스트로 변환하여 채팅 데이터를 생성하고, 상기 채팅 데이터의 평가지가 전달되면,전달된 채팅 데이터의 평가지에 포함된 평가 항목의 턴별로 평가자의 조작을 통해 점수가 입력되어 평가데이터를 생성하는 적어도 하나 이상의 평가자 단말; 및상기 평가자 단말로부터 채팅 데이터가 전달되면, 전달된 채팅 데이터의 평가지를 생성하여 상기 평가자 단말로전달하고, 상기 평가데이터가 수신되면, 수신된 평가데이터의 검증을 수행한 후 상기 평가데이터의 각 평가 항목의 평가점수를 산출하는 AI 모델 평가 서버;를 포함하는 AI 모델의 인간다움을 평가하는 AI 모델 평가시스템."}
{"patent_id": "10-2021-0189387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 평가 항목은, 일관성(consistency), 구체성(specificity), 인간 유사성(human likeness)(인간성) 및 전체 대화 패턴에 대한느낌을 포함하며, 상기 일관성은, 평가자가 이전 턴의 대화 내용과 현재 턴의 대화 내용이 일관성있게 대화가 이어지는지를 판단하여 0 또는 1을 부여하는 방식으로 평가되며,상기 구체성은 평가자가 단답 또는 성의 없는 답변으로 일관하지는 않는지 판단하여 O 또는 1을 부여하는 방식으로 평가되며,상기 인간 유사성(인간성)은 평가자가 AI 모델이 사람처럼 느껴졌는지를 판단하여 O 또는 1을 부여하는 방식으로 평가되며,상기 전체 대화 패턴에 대한 느낌은 평가자가 대화하는 동안 대화의 지속성, 집중도, 재미를 포함하는 매력이있는지를 판단하여 1 내지 5 사이의 점수를 부여하는 방식으로 평가되는 것을 특징으로 하는 AI 모델의 인간다움을 평가하는 AI 모델 평가 시스템."}
{"patent_id": "10-2021-0189387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 평가자 단말은, 정적평가(static evaluation)를 위해 미리 지정된 질문을 수행하는 1차 채팅과 역동적 평가(interactiveevaluation)를 위해 비지정된 질문을 통해 최소 20턴의 대화를 진행하는 2차 채팅을 각각 수행하고, 상기 1차 채팅에 관한 제1 채팅 데이터의 평가지가 전달되면, 미리 지정된 질문에 대한 AI 모델의 응답이 인간대화 스타일인지 여부를 평가하여 1차 평가데이터를 생성하고, 상기 2차 채팅에 관한 제2 채팅 데이터의 평가지가 전달되면, 평가 항목별 각 턴의 AI 모델의 응답을 평가하여 2차 평가데이터를 생성하는 것을 특징으로 하는AI 모델의 인간다움을 평가하는 AI 모델 평가 시스템."}
{"patent_id": "10-2021-0189387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 AI 모델 평가 서버는, 상기 평가자 단말로부터 전달된 2차 평가데이터의 평가오류를 검증하되, 상기 제2 채팅 데이터에 대한 평가를수행하여 비교데이터를 생성하고, 생성된 비교데이터와 상기 평가자 단말로부터 전달된 2차 평가데이터를 비교하여 상반된 점수가 입력된 경우 평가오류로 판단하고, 평가오류로 판단된 평가 항목의 해당 턴의 재평가를 관공개특허 10-2023-0099935-3-리자에게 요청하는 것을 특징으로 하는 AI 모델의 인간다움을 평가하는 AI 모델 평가 시스템."}
{"patent_id": "10-2021-0189387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 AI 모델 평가 서버는, 상기 비교데이터를 생성하기 위해, 상기 일관성의 평가는 이전 질의-응답 내용과 현재 질의-응답 내용의 연관도및 유사도에 기반하여 자연스러운 대화가 이어질 경우, 1을 부여하고, 그렇지 않으면 0을 부여하는 것에 의해이루어지며, 상기 구체성의 평가는 상기 AI 모델의 응답 내용을 형태소 분석하여 형태소가 아닌 문자로 구성된 응답 또는 단답으로 구성된 응답일 경우, 0을 부여하고, 그렇지 않으면 1을 부여하는 것에 의해 이루어지며,상기 인간 유사성(인간성)의 평가는 턴별로 응답이 인간 대화의 스타일이면 1을 부여하고, 그렇지 않으면 0을부여하되, 상기 인간 대화의 스타일은 문법 구조를 만족시키는 문장으로 응답하거나 질의의 문장 스타일과 문법구조가 유사하도록 응답하였는지를 판단하는 것에 의해 확인되는 것을 특징으로 하는 AI 모델의 인간다움을 평가하는 AI 모델 평가 시스템."}
{"patent_id": "10-2021-0189387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 AI 모델 평가 서버는, 평가오류로 판단된 해당 턴의 재평가가 완료되면, 각 평가 항목별 평가점수를 총합한 후 평균 및 표준편차를 산출하고, 각 평가 항목별로 X축은 평가 대상 AI 모델, Y축은 산출된 평균 또는 표준편차로 하는 그래프를 생성하여 평가 결과로서 제공하는 것을 특징으로 하는 AI 모델의 인간다움을 평가하는 AI 모델 평가 시스템."}
{"patent_id": "10-2021-0189387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "하나 이상의 AI 모델을 구비한 인공지능 채팅 시스템, 하나 이상의 평가자 단말 및 AI 모델 평가 서버를 구비한AI 모델 평가 시스템의 AI 모델의 인가다움을 평가하는 방법에 있어서,(a) 상기 평가자 단말에서 채팅 어플리케이션 연동을 통해 상기 인공지능 채팅 시스템과 채팅을 수행하는 단계;(b) 상기 채팅 완료시, 상기 평가자 단말로부터 상기 채팅에 따른 대화내용을 텍스트 변환하여 생성된 채팅 데이터가 전달되면, 상기 AI 모델 평가 서버가 전달된 채팅 데이터의 평가지를 생성하여 상기 평가자 단말로 전달하는 단계;(c) 상기 평가자 단말로부터 상기 평가지의 평가 항목별 각 턴에 대한 점수가 입력된 평가데이터가 전달되면,상기 AI 모델 평가 서버가 전달된 평가데이터에 대한 평가오류 검증을 수행하는 단계;(d) 평가오류 검증 결과, 상기 AI 모델 평가 서버가 평가오류가 확인된 평가 항목의 해당 턴에 대한 재평가를관리자에게 요청하는 단계; 및(e) 재평가 완료시, 상기 AI 모델 평가 서버가 각 평가 항목별로 평가점수를 산출하고, 산출된 평가점수의 평균및 표준편차를 구하는 단계;를 포함하는 AI 모델의 인간다움을 평가하는 AI 모델 평가 방법."}
{"patent_id": "10-2021-0189387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 평가 항목은,일관성(consistency), 구체성(specificity), 인간 유사성(human likeness)(인간성) 및 전체 대화 패턴에 대한느낌을 포함하며, 상기 일관성은, 평가자가 이전 턴의 대화 내용과 현재 턴의 대화 내용이 일관성있게 대화가 이어지는지를 판단하여 0 또는 1을 부여하는 방식으로 평가되며,상기 구체성은 평가자가 단답 또는 성의 없는 답변으로 일관하지는 않는지 판단하여 O 또는 1을 부여하는 방식으로 평가되며,상기 인간 유사성(인간성)은 평가자가 AI 모델이 사람처럼 느껴졌는지를 판단하여 O 또는 1을 부여하는 방식으로 평가되며,공개특허 10-2023-0099935-4-상기 전체 대화 패턴에 대한 느낌은 평가자가 대화하는 동안 대화의 지속성, 집중도, 재미를 포함하는 매력이있는지를 판단하여 1 내지 5 사이의 점수를 부여하는 방식으로 평가되는 것을 특징으로 하는 AI 모델의 인간다움을 평가하는 AI 모델 평가 방법."}
{"patent_id": "10-2021-0189387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서, 상기 (a) 단계는,상기 평가자 단말이, 정적 평가(static evaluation)를 위해 미리 지정된 질문을 입력하고, 입력된 질문에 대한응답을 상기 인공지능 채팅 시스템으로부터 입력받는 1차 채팅을 수행하는 단계; 및상기 평가자 단말이, 역동적 평가(interactive evaluation)를 위해 비지정된 질문을 입력한 후 20턴의 대화를진행하는 2차 채팅을 수행하는 단계;로 이루어지는 것을 특징으로 하는 AI 모델의 인간다움을 평가하는 AI 모델평가 방법."}
{"patent_id": "10-2021-0189387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 (b) 단계는, 상기 평가자 단말이, 상기 1차 채팅에 대한 제1 채팅 데이터의 평가지에서 상기 지정된 질문에 대한 응답이 인간 대화 스타일인지 평가하고 평가에 따른 점수가 입력된 1차 평가데이터를 생성하는 단계; 및 상기 2차 채팅에 대한 제2 채팅 데이터의 평가지에서 각 턴의 질의-응답을 상기 평가 항목별로 평가하고 평가에따른 점수가 입력된 2차 평가데이터를 생성하는 단계;를 더 포함하는 것을 특징으로 하는 AI 모델의 인간다움을평가하는 AI 모델 평가 방법."}
{"patent_id": "10-2021-0189387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서, 상기 (c) 단계는, 상기 AI 모델 평가 서버가, 상기 제2 채팅 데이터 중 이전 질의-응답 내용과 현재 질의-응답 내용의 연관도 및유사도에 기반하여 자연스러운 대화가 이어질 경우, 1을 부여하고, 그렇지 않으면 0을 부여하는 것에 의해 상기일관성의 평가를 수행하는 단계; 상기 제2 채팅 데이터 중 응답 내용을 형태소 분석하여 형태소가 아닌 문자로 구성된 응답 또는 단답으로 구성된 응답일 경우, 0을 부여하고, 그렇지 않으면 1을 부여하는 것에 의해 상기 구체성의 평가를 수행하는 단계;상기 제2 채팅 데이터 중 턴별로 응답이 인간 대화의 스타일이면 1을 부여하고, 그렇지 않으면 0을 부여하는 것에 의해 상기 인간 유사성(인간성)의 평가를 수행하는 단계;상기 일관성의 평가, 상기 구체성의 평가 및 상기 인간 유사성(인간성)의 평가에 따른 점수를 상기 제2 채팅 데이터의 평가지에 입력하여 비교데이터를 생성하는 단계; 및생성된 비교데이터와 상기 평가자 단말로부터 전달된 2차 평가데이터를 비교하여 상반된 점수가 입력된 경우 평가오류로 판단하는 단계;를 포함하여 이루어지며;상기 인간 대화의 스타일은 문법 구조를 만족시키는 문장으로 응답하거나 질의의 문장 스타일과 문법 구조가 유사하도록 응답하였는지를 판단하는 것에 의해 확인되는 것을 특징으로 하는 AI 모델의 인간다움을 평가하는 AI모델 평가 방법."}
{"patent_id": "10-2021-0189387", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 AI 모델과 대화를 진행하고, 진행된 대화로부터 AI 모델이 인간다운 대화를 수행하는지를 평가 항목을 기반으로 정량적으로 평가하여 점수화함으로써 해당 AI 모델의 인간다움을 수치적으로 평가할 수 있는 AI 모델 평가 시스템 및 그 방법에 관한 것이다."}
{"patent_id": "10-2021-0189387", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 AI 모델을 평가하는 기술에 관한 것으로, 더욱 상세하게는, AI 모델과 대화를 진행하고, 진행된 대화 로부터 AI 모델이 인간다운 대화를 수행하는지를 평가 항목을 기반으로 정량적으로 평가하여 점수화함으로써 해 당 AI 모델의 인간다움을 수치적으로 평가할 수 있는 AI 모델 평가 시스템 및 그 방법에 관한 것이다."}
{"patent_id": "10-2021-0189387", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근, 인공 지능 기술 발전으로 인간의 정신적인 영역으로 여겨지는 많은 분야가 인공 지능에 의해 대체될 수 있을 것으로 예상되고 있다. 특히, 인간의 언어를 인지하고 분석하여 인간과 구별이 어려울 정도로 적절한 대답 을 내어 놓는 인공 지능 대화 시스템에 대한 연구가 활발하게 진행되고 있다. 이에 따라 단답식 대화방식에서 벗어나 대화의 상황과 맥락에 기반하여 사용자 의도를 이해하고, 이전의 대화내 용을 기억하여 사용자의 선호도를 학습하고, 개인 기호에 맞는 맞춤형 서비스를 제공하는 등 이해 및 응답 성능 이 지능화되고 있다. 하지만, 이러한 노력에도 불구하고 종래의 인공 지능 대화 시스템은 질문과 동떨어진 응답 또는 평이한 응답을 생성하거나 반복적인 응답을 생성하고, 미리 학습하지 못한 질문에 대해서는 적절한 응답을 찾을 수 없는 경우 가 많다. 또한, 실제 대화하는 인공지능을 상품으로 이용하게 되면 답변의 타이밍(너무 늦거나 빨리 응답), 고저나 말하 는 속도, 중간에 더듬거나 상대방의 생각할 시간을 주는 것 등 무수한 상호작용과 관련한 내용들에 대해서는 아 무런 고려도 되지 않은 상품들이 대다수이다. 따라서 AI 모델이 인간과 대화를 진행하는 도중에 발생하는 상황, 개인 특성을 고려하여 얼마나 자연스러운 대 화를 진행하고 AI 인공지능 모델이 인간 대화의 스타일로 인간과 역동적(interactive) 대화를 하는지를 어떻게 평가할 지에 대한 연구가 필요하다. 선행기술문헌 특허문헌 (특허문헌 0001) 국내공개특허공보 10-2020-0092499(2020.08.04)"}
{"patent_id": "10-2021-0189387", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 본 발명은 인간과 대화를 수행함에 있어서 AI 모델이 기계적인 응답이 아닌 더 자연스러운 응답을 통해 인간다운 대화를 수행하는지를 평가 항목에 기반하여 평가하여 점수화함으로써 AI 모델의 인간다움을 수치적으 로 평가할 수 있는 AI 모델의 인간다움을 평가하는 AI 모델 평가 시스템 및 그 방법을 제공하는데 그 목적이 있 다."}
{"patent_id": "10-2021-0189387", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 목적을 달성하기 위해, 본 발명의 일실시 형태에 따른 AI 모델 평가 시스템은, AI 모델을 구비하고, 채 팅 어플리케이션과 연동하여 AI 모델 기반 채팅 서비스를 제공하는 적어도 하나 이상의 인공지능 챗봇 시스템; 상기 인공지능 챗봇 시스템과 상기 채팅 어플리케이션의 연동을 통해 채팅을 수행하고, 상기 채팅 종료시, 상기 채팅에 따른 대화내용을 텍스트로 변환하여 채팅 데이터를 생성하고, 상기 채팅 데이터의 평가지가 전달되면, 전달된 채팅 데이터의 평가지에 포함된 평가 항목의 턴별로 평가자의 조작을 통해 점수가 입력되어 평가데이터 를 생성하는 적어도 하나 이상의 평가자 단말; 및 상기 평가자 단말로부터 채팅 데이터가 전달되면, 전달된 채 팅 데이터의 평가지를 생성하여 상기 평가자 단말로 전달하고, 상기 평가데이터가 수신되면, 수신된 평가데이터 의 검증을 수행한 후 상기 평가데이터의 각 평가 항목의 평가점수를 산출하는 AI 모델 평가 서버;를 포함한다. 또한, 상기 평가 항목은, 일관성(consistency), 구체성(specificity), 인간 유사성(human likeness)(인간성) 및 전체 대화 패턴에 대한 느낌을 포함하며, 상기 일관성은, 평가자가 이전 턴의 대화 내용과 현재 턴의 대화 내용이 일관성있게 대화가 이어지는지를 판단하여 0 또는 1을 부여하는 방식으로 평가되며, 상기 구체성은 평가 자가 단답 또는 성의 없는 답변으로 일관하지는 않는지 판단하여 O 또는 1을 부여하는 방식으로 평가되며, 상기인간 유사성(인간성)은 평가자가 AI 모델이 사람처럼 느껴졌는지를 판단하여 O 또는 1을 부여하는 방식으로 평 가되며, 상기 전체 대화 패턴에 대한 느낌은 평가자가 대화하는 동안 대화의 지속성, 집중도, 재미를 포함하는 매력이 있는지를 판단하여 1 내지 5 사이의 점수를 부여하는 방식으로 평가되는 것을 특징으로 한다. 또한, 상기 평가자 단말은, 정적평가(static evaluation)를 위해 미리 지정된 질문을 수행하는 1차 채팅과 역동 적 평가(interactive evaluation)를 위해 비지정된 질문을 통해 최소 20턴의 대화를 진행하는 2차 채팅을 각각 수행하고, 상기 1차 채팅에 관한 제1 채팅 데이터의 평가지가 전달되면, 미리 지정된 질문에 대한 AI 모델의 응 답이 인간 대화 스타일인지 여부를 평가하여 1차 평가데이터를 생성하고, 상기 2차 채팅에 관한 제2 채팅 데이 터의 평가지가 전달되면, 평가 항목별 각 턴의 AI 모델의 응답을 평가하여 2차 평가데이터를 생성하는 것을 특 징으로 한다. 또한, 상기 AI 모델 평가 서버는, 상기 평가자 단말로부터 전달된 2차 평가데이터의 평가오류를 검증하되, 상기 제2 채팅 데이터에 대한 평가를 수행하여 비교데이터를 생성하고, 생성된 비교데이터와 상기 평가자 단말로부터 전달된 2차 평가데이터를 비교하여 상반된 점수가 입력된 경우 평가오류로 판단하고, 평가오류로 판단된 평가 항목의 해당 턴의 재평가를 관리자에게 요청하는 것을 특징으로 한다. 또한, 상기 AI 모델 평가 서버는, 상기 비교데이터를 생성하기 위해, 상기 일관성의 평가는 이전 질의-응답 내 용과 현재 질의-응답 내용의 연관도 및 유사도에 기반하여 자연스러운 대화가 이어질 경우, 1을 부여하고, 그렇 지 않으면 0을 부여하는 것에 의해 이루어지며, 상기 구체성의 평가는 상기 AI 모델의 응답 내용을 형태소 분석 하여 형태소가 아닌 문자로 구성된 응답 또는 단답으로 구성된 응답일 경우, 0을 부여하고, 그렇지 않으면 1을 부여하는 것에 의해 이루어지며, 상기 인간 유사성(인간성)의 평가는 턴별로 응답이 인간 대화의 스타일이면 1 을 부여하고, 그렇지 않으면 0을 부여하되, 상기 인간 대화의 스타일은 문법 구조를 만족시키는 문장으로 응답 하거나 질의의 문장 스타일과 문법 구조가 유사하도록 응답하였는지를 판단하는 것에 의해 확인되는 것을 특징 으로 한다. 또한, 상기 AI 모델 평가 서버는, 평가오류로 판단된 해당 턴의 재평가가 완료되면, 각 평가 항목별 평가점수를 총합한 후 평균 및 표준편차를 산출하고, 각 평가 항목별로 X축은 평가 대상 AI 모델, Y축은 산출된 평균 또는 표준편차로 하는 그래프를 생성하여 평가 결과로서 제공하는 것을 특징으로 한다. 한편, 본 발명의 다른 실시 형태에 따른 AI 모델의 인간다움을 평가하는 AI 모델 평가 방법은, 하나 이상의 AI 모델을 구비한 인공지능 채팅 시스템, 하나 이상의 평가자 단말 및 AI 모델 평가 서버를 구비한 AI 모델 평가 시스템의 AI 모델의 인가다움을 평가하는 방법에 있어서, (a) 상기 평가자 단말에서 채팅 어플리케이션 연동을 통해 상기 인공지능 채팅 시스템과 채팅을 수행하는 단계; (b) 상기 채팅 완료시, 상기 평가자 단말로부터 상기 채팅에 따른 대화내용을 텍스트 변환하여 생성된 채팅 데이터가 전달되면, 상기 AI 모델 평가 서버가 전달된 채 팅 데이터의 평가지를 생성하여 상기 평가자 단말로 전달하는 단계; (c) 상기 평가자 단말로부터 상기 평가지의 평가 항목별 각 턴에 대한 점수가 입력된 평가데이터가 전달되면, 상기 AI 모델 평가 서버가 전달된 평가데이터 에 대한 평가오류 검증을 수행하는 단계; (d) 평가오류 검증 결과, 상기 AI 모델 평가 서버가 평가오류가 확인 된 평가 항목의 해당 턴에 대한 재평가를 관리자에게 요청하는 단계; 및 (e) 재평가 완료시, 상기 AI 모델 평가 서버가 각 평가 항목별로 평가점수를 산출하고, 산출된 평가점수의 평균 및 표준편차를 구하는 단계;를 포함한 다. 또한, 상기 평가 항목은, 일관성(consistency), 구체성(specificity), 인간 유사성(human likeness)(인간성) 및 전체 대화 패턴에 대한 느낌을 포함하며, 상기 일관성은, 평가자가 이전 턴의 대화 내용과 현재 턴의 대화 내용이 일관성있게 대화가 이어지는지를 판단하여 0 또는 1을 부여하는 방식으로 평가되며, 상기 구체성은 평가 자가 단답 또는 성의 없는 답변으로 일관하지는 않는지 판단하여 O 또는 1을 부여하는 방식으로 평가되며, 상기 인간 유사성(인간성)은 평가자가 AI 모델이 사람처럼 느껴졌는지를 판단하여 O 또는 1을 부여하는 방식으로 평 가되며, 상기 전체 대화 패턴에 대한 느낌은 평가자가 대화하는 동안 대화의 지속성, 집중도, 재미를 포함하는 매력이 있는지를 판단하여 1 내지 5 사이의 점수를 부여하는 방식으로 평가되는 것을 특징으로 한다. 또한, 상기 (a) 단계는, 상기 평가자 단말이, 정적 평가(static evaluation)를 위해 미리 지정된 질문을 입력하 고, 입력된 질문에 대한 응답을 상기 인공지능 채팅 시스템으로부터 입력받는 1차 채팅을 수행하는 단계; 및 상 기 평가자 단말이, 역동적 평가(interactive evaluation)를 위해 비지정된 질문을 입력한 후 20턴의 대화를 진 행하는 2차 채팅을 수행하는 단계;로 이루어지는 것을 특징으로 한다. 또한, 상기 (b) 단계는, 상기 평가자 단말이, 상기 1차 채팅에 대한 제1 채팅 데이터의 평가지에서 상기 지정된 질문에 대한 응답이 인간 대화 스타일인지 평가하고 평가에 따른 점수가 입력된 1차 평가데이터를 생성하는 단 계; 및 상기 2차 채팅에 대한 제2 채팅 데이터의 평가지에서 각 턴의 질의-응답을 상기 평가 항목별로 평가하고 평가에 따른 점수가 입력된 2차 평가데이터를 생성하는 단계;를 더 포함하는 것을 특징으로 한다. 또한, 상기 (c) 단계는, 상기 AI 모델 평가 서버가, 상기 제2 채팅 데이터 중 이전 질의-응답 내용과 현재 질의 -응답 내용의 연관도 및 유사도에 기반하여 자연스러운 대화가 이어질 경우, 1을 부여하고, 그렇지 않으면 0을 부여하는 것에 의해 상기 일관성의 평가를 수행하는 단계; 상기 제2 채팅 데이터 중 응답 내용을 형태소 분석하 여 형태소가 아닌 문자로 구성된 응답 또는 단답으로 구성된 응답일 경우, 0을 부여하고, 그렇지 않으면 1을 부 여하는 것에 의해 상기 구체성의 평가를 수행하는 단계; 상기 제2 채팅 데이터 중 턴별로 응답이 인간 대화의 스타일이면 1을 부여하고, 그렇지 않으면 0을 부여하는 것에 의해 상기 인간 유사성(인간성)의 평가를 수행하는 단계; 상기 일관성의 평가, 상기 구체성의 평가 및 상기 인간 유사성(인간성)의 평가에 따른 점수를 상기 제2 채팅 데이터의 평가지에 입력하여 비교데이터를 생성하는 단계; 및 생성된 비교데이터와 상기 평가자 단말로부 터 전달된 2차 평가데이터를 비교하여 상반된 점수가 입력된 경우 평가오류로 판단하는 단계;를 포함하여 이루 어지며; 상기 인간 대화의 스타일은 문법 구조를 만족시키는 문장으로 응답하거나 질의의 문장 스타일과 문법 구조가 유사하도록 응답하였는지를 판단하는 것에 의해 확인되는 것을 특징으로 한다."}
{"patent_id": "10-2021-0189387", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, AI 모델과 사람 간 대화내용으로부터 AI 모델이 얼마나 자연스럽게 인간다운 대화를 수행하 는지를 평가 항목에 기반하여 정량적으로 평가하여 점수화함으로써 AI 모델의 인간다움을 수치적으로 평가할 수 있는 효과가 있다. 또한, 본 발명에 따르면, AI 모델의 인간다움을 평가 항목별로 수치화한 평가 결과를 제공함으로써 AI 모델의 부족한 항목을 파악하여 개발 및 연구 방향을 정하는 데 도움을 줄 수 있고, 또한, 평가 결과를 시각화하여 그 래프로 제공함으로써 개발자로하여금 자신의 AI 모델에 대한 평가 결과를 쉽게 파악할 수 있는 효과가 있다. 본 발명에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효과들은 아래의 기재로부터 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0189387", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 첨부된 도면을 참조하여 본 발명의 실시예를 본 발명이 속하는 분야에서 통상의 지식을 가진 자가 용이하 게 실시할 수 있도록 상세하게 설명한다. 이하 설명에서 동일한 구성 요소에는 설명의 편의상 동일 명칭 및 동 일 부호를 부여한다. 본 발명에서 사용되는 용어는 가능한 한 현재 널리 사용되는 일반적인 용어를 선택하였으나, 특정한 경우는 출 원인이 임의로 선정한 용어도 있으며, 이 경우는 해당되는 발명의 설명부분에서 상세히 그 의미를 기재하였으므 로, 단순한 용어의 명칭이 아닌 용어가 가지는 의미로서 본 발명을 파악하여야 한다. 본 발명의 설명에 있어서, \"인간다움\"의 평가 기준은 대화의 상하 문맥을 기억하여 일관성을 유지하는 문맥 기 반 대화(일관성, consistency), 주어진 텍스트나 구조화된 지식을 이용하여 상대방이 필요한 정보를 찾아 구체 적으로 제공하는 깊이 있는 대화를 진행하는 텍스트 이해기반 대화(구체성, specificity), 시스템이 특정 캐릭 터를 가지며, 나이, 직업, 취미 등 개인 특성을 고려한 페르소나(Persona) 대화(인간 유사성(인간성), Human_likeness), 대화하는 동안 얼마나 매력(지속성, 집중도, 재미, 상식 등)이 있는지 전체 대화의 평가(전체 대화 패턴의 느낌, Full conversation)를 포함한다. 이러한 \"인간다움\"의 평가 항목은 사람과 사람 간 대화, 챗봇과 사람 간 대화를 실시간으로 수집하고, 수집한 대화를 텍스트로 분석하여 질의-응답 데이터베이스를 구축하고, 질의-응답을 한 세트로 하는 턴 분석 및 평가, 전체 대화 분석 및 평가를 평가자들을 통해 수행하여 마련한 것이다.. 또한, 본 발명에 있어서, 턴(turn)은 평가자와 AI 모델 기반 챗봇이 한 번씩 대화를 주고 받은 것을 하나의 질 의와 그 질의에 대한 응답, 즉, 질의-응답의 한 세트로 정의한 것이며, 하지만, 이에 한정되는 것은 아니며, 질 의-응답은 반대로 응답-질의 형태일 수도 있다. 여기서, 질의는 평가자가 입력한 메시지로 평서문, 의문문, 명 령문, 감탄문, 기원문 등 질문 형태인 문장 또는 그렇지 않은 문장 모두를 포함하는 것으로 정의한다. 도 1은 본 발명의 일실시 형태에 따른 AI 모델의 인간다움을 평가하는 AI 모델 평가 시스템의 전체 구성을 개략 적으로 나타낸 구성도이다. 도 1에 도시된 바와 같이, 본 발명의 일실시 형태에 따른 AI 모델 평가 시스템은 적어도 하나 이상의 인공지 능 챗봇 시스템(AI 모델_A, AI 모델_B, ...), 적어도 하나 이상의 평가자 단말(평가자_a, 평가자_b, ...) 및 AI 모델 평가 서버를 포함하여 구성될 수 있다. 여기서, 인공지능 챗봇 시스템, 평가가 단 말 및 AI 모델 평가 서버는 유/무선 네트워크와 같은 인터넷 연결을 통해 상호 간 데이터 통신을 수행 할 수 있다. 구체적으로 설명하면, 적어도 하나 이상의 인공지능 챗봇 시스템(AI 모델_A, AI 모델_B, ...)은 오픈 API 형태로 플랫폼화하여 AI 모델(AI 모델_A, AI 모델_B, ...)을 구비하며, AI 모델을 기반으로 챗봇을 이용한 채팅 서비스를 제공할 수 있다. 여기서, AI 모델은 다양한 사람들의 대화 내용을 기반으로 훈련된 모델일 수 있다. 이러한 AI 모델은, 응답의 입력 여부 및 입력된 응답의 내용에 따라 질의를 출력하거나, 질의가 입력되면, 입력된 질의에 대한 응답을 출 력할 수 있다. 또한, AI 모델은 누군가의 질의에 해당하는 텍스트 및 해당 질의에 대한 다른 누군가의 응답에 해당하는 텍스트를 각각 질의-응답 훈련 데이터 셋으로 하여 훈련된 것일 수도 있다. 일 예로, RNN(Recurrent Neural Network)을 기반으로 훈련되어 순차적으로 이어지는 하나 이상의 질의-응답에 대하여 훈련된 모델일 수 있다. 이때, 훈련 데이터 셋은 웹 크롤링을 통해 수집된 다양한 대화 데이터에 따라 획득된 것일 수 있다. 또한, AI 모델은 순차적인 질의-응답 과정에서 각 질의 다음으로 이어지는 응답을 구성하는 개별적인 단어 또는 문구를 순차적으로 예측하도록 훈련될 수 있으나, 이에 한정되지 않는다.즉, 인공지능 챗봇 시스템은 AI 모델의 인간다움을 평가받기 위해 평가자 단말과 채팅 어플리케이션 연 동을 통해 채팅을 수행한다. 그리고, 평가자 단말은 인공지능 챗봇 시스템과 채팅 어플리케이션 연동을 통해 채팅을 수행하는데, AI 모델의 인간다움을 상세하게 평가하기 위해, 1차 채팅과 2차 채팅을 수행할 수 있다. 여기서, 1차 채팅은, 정적 평가(static evaluation) 방식으로, 평가자가 기지정된 질문을 입력하고, 인공지능 챗봇 시스템에서 입력된 질문에 대한 응답을 진행한다. 이때, 1차 채팅은 원-턴(one-turn) 또는 멀티-턴(multi-turn)의 대화 방식으로 진행될 수 있다. 2차 채팅은 역동적 평가(interactive evaluation) 방식으로, 평가자가 비지정된 질문을 시작으 로 인공지능 챗봇 시스템이 응답하고, 질의-응답을 다수 턴에 걸쳐 반복하여 진행한다. 2차 채팅은 질의-응 답을 한 턴으로 할 경우, 최소 20턴을 진행하도록 한다. 또한, 평가자 단말은 1차 및 2차 채팅 종료시, 각 채팅에 따른 대화내용을 AI 모델 평가 서버로 전달할 수 있다. 여기서, 평가자 단말은 1차 채팅에 따른 대화내용을 텍스트로 변환하여 제1 채팅 데이터를 생성하 고, 2차 채팅에 따른 대화내용을 텍스트로 변환하여 제2 채팅 데이터를 생성하고, 생성된 제1 채팅 데이터 및 제2 채팅 데이터를 AI 모델 평가 서버로 전달한다. 이후, 평가자 단말은 AI 모델 평가 서버로부터 제1 및 제2 채팅 데이터 각각의 평가지를 전달받고, 전 달된 평가지의 각 턴별로 사용자의 조작에 따라 점수를 기입하여 평가데이터를 생성한다. 여기서, 평가지는 제1 채팅 데이터의 평가지와 제2 채팅 데이터에 대한 평가지를 포함하며, 제1 채팅 데이터의 평가지는 AI 모델이 사람처럼 답변하는지를 평가자가 평가하여 점수를 기입하도록 구성되며, 제2 채팅 데이터의 평가지는 AI 모델의 인간다움을 다양한 측면에서 상세하게 평가하기 위해, 평가 항목으로 일관성, 구체성, 인간 유사성(인간성), 전체 대화 패턴의 느낌을 포함하는 평가 항목을 구비하고, 각 평가 항목의 턴별로 점수를 기입 하도록 구성될 수 있다. 그러면, 평가자는 AI 모델 평가 서버로부터 전달된 평가지의 각 평가 항목의 평가 기준에 맞춰 평가를 수행 한다. 예를 들어, 평가자는 제1 채팅 데이터의 평가지에서 해당 대화내용의 AI 모델 응답이 사람처럼 답변하였 다고 판단되면 1을, 아니면 O을 기입한다. 또한, 평가자는 2차 채팅에 대한 평가지에서 해당 대화내용의 일관성, 구체성, 인간 유사성(인간성) 각각에 대해 각 턴별로 평가를 통해 점수(O 또는 1)를 기입하고, 전체 대 화 패턴의 느낌에 대해 20턴마다 평가를 통해 1 ~ 5 사이의 점수를 기입한다. 이후, 평가지에 대한 평가가 완료되면, 평가자 단말은 각 평가지에 대한 평가데이터를 생성하여 AI 모델 평 가 서버로 전달한다. 즉, 평가자 단말은 제1 채팅 데이터의 평가지에 대한 평가가 수행된 평가데이터 (이하, 1차 평가데이터라 함)와 제2 채팅 데이터의 평가지에 대한 평가가 수행된 평가데이터(이하, 2차 평가데 이터라 함)를 각각 생성하고 이를 AI 모델 평가 서버로 전달한다. 그리고, AI 모델 평가 서버는, 인공지능 챗봇 시스템과 평가자 단말 간 채팅이 진행되면, 이후 인 공지능 챗봇 시스템 및 평가자 단말 간 대화내용이 텍스트로 변환된 채팅 데이터를 수신받고, 수신된 채팅 데이터에 대한 평가지를 생성하여 평가자 단말로 전달한다. 여기서, AI 모델 평가 서버는, 수신된 채팅 데이터가 1차 채팅에 관한 것이면 1차 채팅 데이터의 평가지를, 2차 채팅에 관한 것이면 2차 채팅 데이터 의 평가지를 생성하여 전달한다. 채팅에 따른 대화내용은 인공지능 챗봇 시스템 또는 평가자 단말 중 하나로부터 수신받을 수 있다. 또한, AI 모델 평가 서버는 평가자 단말로부터 전달되는 평가데이터에 대한 검증을 수행하고, 검증결과 평가오류가 없는 경우 전달된 평가데이터의 평가 항목별로 점수를 수치화하여 산출한다. 즉, AI 모델 평가 서버는 1차 평가데이터 및 2차 평가데이터의 평가 항목별로 점수를 산출하여 저장하고, 저장된 평가 항목별 점수의 평균 및 표준편차를 구하고, 구한 평균 및 표준편차를 다른 AI 모델과 함께 그래프 로 시각화한 평가 결과 보고서를 제공할 수 있다. 그리고, 본 발명의 실시예에 있어서, 평가자의 편향성을 최대한 줄이기 위해, 하나의 인공지능 챗봇 시스템마다 다수의 평가자들이 모두 평가를 진행하도록 한다. 예를 들어, 평가를 받고자 하는 인공지능 챗봇 시스템이 AI 모델_A 기반 챗봇, AI 모델_B 기반 챗봇, AI 모델_C 기반 챗봇으로 구성되고, 평가자가 평가자_a, 평가자_b, 평 가자_c, 평가자_d, 평가자_e로 구성된 경우, 각 챗봇별로 평가자_a, 평가자_b, 평가자_c, 평가자_d, 평가자_e가 모두 평가를 진행하도록 함으로써 평가자에 의한 편향성을 줄일 수 있다. 즉, AI 모델 평가 서버는, AI 모델별로 다수의 다른 평가자가 평가를 수행한 평가데이터를 수집하고, 이를 종합하여 평가 결과를 산출할 수 있다. 따라서 본원발명의 일실시 형태에 따른 AI 모델 평가 시스템은, AI 모델이 기계적인 응답이 아닌 얼마나 자연스 럽게 대화하는지, 인간과 같이 답변하는지를 다양한 평가 항목을 통해 정량적으로 평가하여 점수화함으로써 AI 모델의 인간다움을 수치적으로 평가할 수 있다. 도 2는 본 발명의 일실시 형태에 따른 AI 모델의 인간다움을 평가하는 AI 모델 평가 시스템에서 AI 모델 평가 서버의 상세 구성을 나타낸 구성도이다. 도 2에 도시된 바와 같이, 본 발명의 일실시 형태에 따른 AI 모델 평가 서버는 데이터 수집부, 데이터 처리부, 평가데이터 검증부, 평가점수 산출부 및 평가결과 제공부를 포함하여 구성될 수 있다. 구체적으로 설명하면, 데이터 수집부는, 인공지능 챗봇 시스템과 평가자 단말 간 채팅에 따른 대화 내용을 인공지능 챗봇 시스템 또는 평가자 단말로부터 수집한다. 여기서, 대화내용은 1차 채팅에 따른 대화내용을 텍스트로 변환한 제1 채팅 데이터, 2차 채팅에 따른 대화내용을 텍스트로 변환한 제2 채팅 데이터로 생성되고, 데이터 수집부는 제1 채팅 데이터 및 제2 채팅 데이터를 수집할 수 있다. 또한, 데이터 수집부는 평가자 단말로부터 1차 채팅 데이터의 평가지에 대한 1차 평가데이터와, 2차 채 팅 데이터의 평가지에 대한 2차 평가데이터를 각각 수집한다. 여기서, 1차 평가데이터 및 2차 평가데이터는 평 가지에 포함된 각 평가 항목별, 각 평가 항목의 턴별로 AI 모델의 응답을 평가자가 평가하여 점수(O 또는 1)를 기입함으로써 생성된다. 그리고, 데이터 처리부는 수집된 제1 채팅 데이터 및 제2 채팅 데이터의 턴별로 평가 항목 각각의 평가(예 를 들어, 점수)를 입력할 수 있도록 구성된 제1 채팅 평가지 및 제2 채팅 평가지를 각각 생성하고, 생성된 제1 채팅 평가지 및 제2 채팅 평가지를 평가자 단말로 전달한다. 그리고, 평가데이터 검증부는 평가자 단말로부터 전달된 1차 평가데이터 및 2차 평가데이터의 평가내용 에 대한 검증을 수행하고, 검증 결과, 평가오류가 확인되면, 평가오류가 확인된 평가 항목의 해당 턴에 대한 재 평가를 관리자에게 요청할 수 있다. 예를 들어, 평가데이터 검증부는, 평가 항목 중, 일관성의 경우, 이전 질의-응답 내용과 현재 질의-응답 내 용의 형태소 분석을 통한 키워드 검출 등을 통해 유사도를 판단하고, 유사도가 있을 경우, 1을 부여하고, 그렇 지 않으면 0을 부여함으로써 전달된 2차 평가데이터의 평가내용와 비교를 수행하고, 비교 결과, 일치하지 않는 평가를 가진 해당 턴을 별도로 표시하여 관리자 또는 평가자로하여금 재평가를 수행하도록 요청할 수 있다. 또 다른 예를 들어, 평가데이터 검증부는, 평가 항목 중, 구체성의 경우, AI 모델의 응답을 형태소 분석하 여 형태소가 아닌 문자로 구성된 응답 또는 단답으로 구성된 경우, 0을 부여하고, 그렇지 않으면 1을 부여함으 로써 전달된 2차 평가데이터의 평가내용과 비교를 수행하고, 비교 결과, 일치하지 않는 평가를 가진 해당 턴을 별도로 표시하여 관리자 또는 평가자로하여금 재평가를 수행하도록 요청한다. 또 다른 예를 들어, 평가데이터 검증부는, 평가 항목 중, 인간 유사성(인간성)의 경우, 턴별로 응답이 인간 대화의 스타일이면 1을 부여하고, 그렇지 않으면 0을 부여함으로써, 전달된 2차 평가데이터의 평가내용과 비교 를 수행하고, 비교 결과, 일치하지 않는 평가를 가진 해당 턴을 별도로 표시하여 관리자 또는 평가자로하여금 재평가를 수행하도록 요청한다. 여기서, 인간 대화의 스타일은 문법 구조를 만족시키는 문장으로 응답하거나 질 의의 문장 스타일과 문법 구조가 유사하도록 응답하였는지를 판단하는 것에 의해 확인될 수 있다. 한편, 본 발명의 실시예에 있어서, 평가 항목 중, 전체 대화 패턴에 대한 느낌은 20턴의 전체 대화내용으로부터 느껴지는 매력(예를 들어, 지속성, 집중도, 재미, 상식)을 평가자가 자신의 선호도에 기반하여 판단하므로 검증 을 수행하지 않는다. 그리고, 1차 평가데이터 및 2차 평가데이터에 대한 검증 및 재평가가 완료되면, 평가점수 산출부는, 1차 평 가데이터 및 2차 평가데이터의 각 평가 항목별로 점수를 수치화하여 평가점수를 산출하고, 산출된 각 평가항목 별 평가점수를 저장한다. 도시하지는 않았지만, 각 부에서 생성되는 데이터는 데이터베이스에 저장되도록 구현 될 수 있다. 또한, 평가점수 산출부는, 산출된 각 평가항목별 평가점수와, 기저장된 각 평가 항목별 평가점수(다른 평가 자에 의해 평가됨)를 총합하여 평균 및 표준편차를 구할 수 있다.그리고, 평가결과 제공부는, 평가점수 산출부에서 구한 AI 모델의 각 평가 항목별 평균 및 표준편차를 다른 AI 모델과의 비교표 및/또는 비교 그래프로 구현한 평가 결과를 제공할 수 있다. 도 3은 본 발명의 일실시 형태에 따른 AI 모델 평가 서버에서 평가자 단말로 제공하는 제2 채팅 평가지의 일 예 를 나타낸 예시도이다. 도 3에 도시된 바와 같이, 본 발명의 일실시 형태에 따른 제2 채팅 평가지는, 가로로 턴수, 평가자명, AI 모델명 및 평가 항목을 표기하고, 세로로 턴수와, 턴수에 따른 평가자와 AI 모델의 질의-응답 내용 을 텍스트로 표기하고 각 평가 항목의 평가를 기입하도록 입력란이 구비된다. 그리고, 평가 항목은 일관성, 구체성, 인가성 및 전체 대화 패턴의 느낌을 포함하며, 일관성, 구체성 및 인가성 (①)은 각 턴수별로 점수(0 또는 1)를 기입하도록 구현되고, 전체 대화 패턴의 느낌(②)은 20턴에서 점수(1 내 지 5)가 기입될 수 있도록 입력란(③)을 구현할 수 있다. 도 4는 본 발명의 일실시 형태에 따른 평가 항목 중 일관성에 대한 평가데이터의 검증을 수행한 일 예를 나타낸 예시도이다. 도 4에 도시된 바와 같이, 본 발명의 일실시 형태에 따른 평가 항목 중 일관성의 경우, AI 모델 평가 서버 의 평가데이터 검증부에서 수행한 검증결과, 평가오류(41, 42, 43)가 확인되고, 평가오류가 확인된 턴(41, 42, 43)을 다른 턴과 구별되도록 표시할 수 있다. 여기서, 평가오류(41, 42, 43)의 이유는, 이전 대화와 연관성 이 없고 본인이 아닌 상대방이 힘을 내야하는 상황에서 자신이 힘을 낸다고 말하는 것은 앞, 뒤 상황에 맞지 않 아 행위의 주체가 잘못되었고 판단했기 때문이다. 그러면, 관리자 또는 평가자는 평가오류 확인 턴(41, 42, 43)에 대한 재평가를 수행하고, 점수를 변경(1 -> 0) 하여 기입한다. 도 5는 본 발명의 일실시 형태에 따른 대화 평가 항목 중 구체성에 대한 평가데이터의 검증을 수행한 일 예를 나타낸 예시도이다. 도 5에 도시된 바와 같이, 본 발명의 일실시 형태에 따른 평가 항목 중 구체성의 경우, AI 모델 평가 서버 의 평가데이터 검증부에서 수행한 검증결과, 평가오류(51, 52)가 확인되고, 평가오류 확인 턴(51, 52)을 다 른 턴과 구별되도록 표시할 수 있다. 여기서, 평가오류(51, 52)의 이유는, 단답으로 응답하였지만 질의(Q)가 \" 어떤 영화 좋아해?\", \"어떤 배우 좋아해?\"이므로 그 대답으로서 \"캐스트어웨이\", \"브래드피트\"와 같은 고유 명 사의 경우 그렇게 답할 수 밖에 없으므로 구체성이 인정되어야 한다고 판단했기 때문이다. 그러면, 관리자 또는 평가자는 평가오류 확인 턴(51, 52)에 대한 재평가를 수행하고, 점수를 0 -> 1로 변경하여 기입한다. 도 6은 본 발명의 일실시 형태에 따른 대화 평가 항목 중 인간성에 대한 평가데이터의 검증을 수행한 일 예를 나타낸 예시도이다. 도 6에 도시된 바와 같이, 본 발명의 일실시 형태에 따른 평가 항목 중 인간 유사성(인간성)의 경우, AI 모델 평가 서버의 평가데이터 검증부에서 수행한 검증결과, 평가오류가 확인되고, 평가오류 확인 턴(6 1)을 다른 턴과 구별되도록 표시할 수 있다. 여기서, 평가오류의 이유는, 인간성의 경우는 질의와 무관하게 응답만을 놓고 판단하므로, \"ㅎㅎ 빵은 있는데 난\"은 말이 된다고 판단했기 때문이다. 그러면, 관리자 또는 평가자는 평가오류 확인 턴에 대한 재평가를 수행하고, 점수를 0 -> 1로 변경하여 기 입한다. 도 7은 본 발명의 일실시 형태에 따른 전체 대화 패턴에 대한 느낌에 대한 평가데이터의 일 예를 나타낸 예시도 이다.도 7에 도시된 바와 같이, 본 발명의 일실시 형태에 따른 평가 항목 중 전체 대화 패턴의 느낌에 대한 평가데이 터는 20턴마다 평가가 이루어져 1 ~ 5 사이의 점수가 기입될 수 있는데, 평가자가 20턴의 대화를 진행하면서 대 화내용이 얼마나 매력이 있었는지, 지루하지 않았는지, 상식적 대화를 했는지, 사람과 대화하는 느낌이 들었는 지 등을 종합적으로 평가하고, 이에 대한 점수를 기입할 수 있다. 도 8은 본 발명의 일실시 형태에 따른 평가 결과의 일 예를 나타낸 예시도이고, 도 9는 본 발명의 일실시 형태 에 따른 평가 결과 중 일관성의 평균 및 표준편차를 시각화한 일 예를 나타낸 예시도이다. 본 발명의 실시예에 따른 AI 모델 평가 서버는, AI 모델별로 저장된 다수의 평가데이터의 각 평가 항목별 평가점수를 총합하고, 총합점수에 대한 평균(AVG) 및 표준편차(STD)를 산출한다. 이때, 본 발명의 실시예에서는 평가 대상인 AI 모델의 인간다움에 대한 상대적 평가를 위한 비교 대상으로 Open-Domain Chatbot(예를 들어, GPT-3, Blender, Meena 등)으로 베이스라인을 구성하고, 이에 대한 평가를 사 전에 진행하여 각 평가 항목별 평가점수, 평균 및 표준편차를 저장할 수 있다. 그러면, 도 8에 도시된 바와 같이, 베이스라인 및 AI 모델별 각 평가 항목의 평균 및 표준편차를 비교표로서 표 시할 수 있다. 또한, 본 발명의 실시예에 따른 AI 모델 평가 서버는, 구한 베이스라인 및 AI 모델별 각 평가 항목의 평균 및 표준편차를 시각화 작업을 수행하여 비교 그래프로 제공할 수 있다. 예를 들어, 도 9의 (a)에 도시된 바와 같이, 평가 항목 중 일관성의 경우, 베이스라인 및 AI 모델을 X축으로, 평균값을 Y축으로 한 그래프로 시각화하여 제공할 수 있다. 또한, 도 9의 (b)에 도시된 바와 같이, 평가 항목 중 일관성의 경우, 베이스라인 및 AI 모델을 X축으로, 표준편 차를 Y축으로 한 그래프로 시각화하여 제공할 수 있다. 이를 통해 관리자 및 AI 모델 개발자는 AI 모델의 평가 결과 및 베이스라인과의 차이를 쉽게 파악할 수 있다. 한편, 본 실시예에서, 일관성에 대한 평가 결과의 시각화에 대해 설명하였지만, 이에 한정되지 않으며 다른 평 가 항목의 평가 결과도 동일하게 시각화하여 제공할 수 있다. 도 10은 본 발명의 일실시 형태에 따른 AI 모델의 인간다움을 평가하는 AI 모델 평가 방법을 설명하기 위한 흐 름도이고, 도 11은 도 8에 도시된 S101 단계 및 S102 단계를 설명하기 위한 흐름도이다. 본 실시예에 따른 방법 은 도 1 내지 도 9에 도시된 AI 모델의 인간다움을 평가하는 AI 모델 평가 시스템에 의해 구현될 수 있다. 도 10에 도시된 바와 같이, 본 발명의 일실시 형태에 따른 AI 모델의 인간다움을 평가하는 AI 모델 평가 방법은, AI 모델을 구비한 인공지능 챗봇 시스템과 평가자 단말 간 채팅 어플리케이션 연동을 통해 채팅을 수행 한다(S101). 여기서, S101 단계는, 도 11에 도시된 바와 같이, 채팅은 1차 채팅과 2차 채팅으로 구분되어 진행될 수 있으며, 1차 채팅은 평가자가 미리 지정된 질문을 입력하고 이에 대한 AI 모델의 응답을 수신하는 것이며, 2차 채팅은 평가자가 비지정된 질문을 시작으로 최소 20턴 이상의 질의-응답을 반복하면서 대화를 진행하는 것이다(S101-1, S101-2). 이후, S101 단계는, 1차 채팅에 따른 제1 채팅 데이터를 생성하고, 2차 채팅에 따른 제2 채팅 데이터를 생성한 후, 제1 및 제2 채팅 데이터를 AI 모델 평가 서버로 전달하는 과정(S101-3, S101-4)을 더 포함한다. 그러면, AI 모델 평가 서버가, 채팅에 따른 대화내용의 평가지를 생성하여 평가자 단말로 제공하고, 이후, 평가 자 단말로부터 평가지에 대한 평가데이터를 수신한다(S102). 구체적으로, S102 단계는, 도 11에 도시된 바와 같이, AI 모델 평가 서버는 1차 채팅 데이터 및 2차 채팅 데이 터가 전달되면(S101-3, S101-4), 각각에 대한 평가지를 생성하고, 생성된 제1 채팅 평가지 및 제2 채팅 평가지 를 평가자 단말로 전달한다(S102-1, S102-2). 이후, 평가자 단말은 전달된 제1 채팅 평가지 및 제2 채팅 평가지에 포함된 평가 항목에 대해 평가를 수행한 후, 제1 채팅 평가지에 대한 평가내용을 포함하는 1차 평가데이터를 생성하고(S102-3), 제2 채팅 평가지에 대한평가내용을 포함하는 2차 평가데이터를 생성한다(S102-4). 여기서, 평가 항목 중 일관성, 구체성 및 인간성은 평가자가 턴별 평가를 통해 점수를 산정하고, 전체 대화 패턴의 느낌은 20턴의 대화내용 전체 평가를 통해 점수 를 산정하도록 한다. 여기서, 2차 평가데이터 생성은, 평가 항목에 있어서 일관성 평가(S102-5), 구체성 평가(S102-6), 인간유사성 (인간성) 평가(S102-7) 및 전체 대화 패턴 느낌 평가(S102-8)를 순차적으로 수행하는 것에 의해 구현될 수 있으 나, 이에 한정되는 것은 아니다. 그런 다음, 평가자 단말은 생성된 1차 및 2차 평가데이터를 AI 모델 평가 서버로 전달하고(S102-9), AI 모델 평 가 서버는 평가자 단말로부터 1차 및 2차 평가데이터를 수신한다(S102-10). 이어서, AI 모델 평가 서버는 수신된 1차 및 2차 평가데이터 중 2차 평가데이터에 대한 검증을 수행한다(S103). 1차 평가데이터는 원-턴(one-turn)에 대한 평가로 평가자의 실수가 발생하기 어려우므로 별도의 검증을 수행하 지 않는다. 즉, 2차 평가데이터의 검증은, 평가 항목 중 일관성 검증(S104), 구체성 검증(S105) 및 인간유사성(인간성) 검 증(S106)을 진행하는 것에 의해 구현될 수 있다. 여기서, 전체 대화 패턴에 대한 느낌 항목은 평가자의 선호도 가 반영되어 평가되므로 이에 대한 검증을 수행하지 않는다. 그런 다음, 검증 결과, 평가 항목 중 평가오류가 확인된 턴에 대한 재평가를 관리자 또는 평가자에게 요청하고, 재평가가 수행되면 재평가가 반영된 평가데이터를 저장한다(S108). 이어서, AI 모델 평가 서버는, 재평가가 반영된 평가데이터의 각 평가 항목에 대한 평가점수를 산출하고 이를 저장한다(S108). 그리고, AI 모델 평가 서버는, AI 모델별로 저장된 각 평가 항목의 평가점수(다른 평가자에 의해 평가된 평가데 이터로부터 산출되어 저장)를 호출하고, 호출된 각 평가 항목의 평가점수들의 평균 및 표준편차를 산출하고, 산 출된 평균 및 표준편차에 기반한 평가 결과를 제공한다(S109). 이때, AI 모델 평가 서버는, 평가 결과를 도 8에 도시된 비교표와 같이 제공하거나, 도 9에 도시된 평균 및 표 준편차 비교 그래프와 같이 시각화하여 제공할 수 있다. 이와 같이 본 발명은, 평가자의 질의에 대한 AI 모델의 응답에 대한 인가다움을 일관성, 구체성, 인간 유사성 (인간성) 및 전체 대화 패턴의 느낌을 포함하는 평가 항목을 통해 구체적으로 평가하고, 이를 정량적으로 점수 화함으로써 AI 모델의 인가다움을 수치화하여 평가할 수 있다."}
{"patent_id": "10-2021-0189387", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이상에서 전술한 바와 같은 본 발명은 이를 구현하기 위한 프로그램 명령어로서 수행될 수 있으며, 이러한 프로 그램 명령어를 기록한 컴퓨터로 읽힐 수 있는 기록매체는, 일 예로, ROM, RAM, CD-ROM, 자기 테이프, 플로피디 스크, 광 미디어 저장장치 등이 있다. 또한 전술한 바와 같은 프로그램을 기록한 컴퓨터로 읽힐 수 있는 기록매체는 네트워크로 커넥션된 컴퓨터 장치 에 분산되어, 분산방식으로 컴퓨터가 읽을 수 있는 코드가 저장되고 실행될 수 있다. 이 경우, 다수의 분산된 컴퓨터 중 어느 하나 이상의 컴퓨터는 상기에 제시된 기능들 중 일부를 실행하고, 그 결과를 다른 분산된 컴퓨 터들 중 하나 이상에 그 실행 결과를 전송할 수 있으며, 그 결과를 전송받은 컴퓨터 역시 상기에 제시된 기능들 중 일부를 실행하여, 그 결과를 역시 다른 분산된 컴퓨터들에 제공할 수 있다. 이상에서, 본 발명의 실시예를 구성하는 모든 구성 요소들이 하나로 결합되거나 결합되어 동작하는 것으로 설명 되었다고 해서, 본 발 명이 반드시 이러한 실시예에 한정되는 것은 아니다. 즉, 본 발명의 목적 범위 안에서라 면, 그 모든 구성 요소들이 하나 이상으로 선택적으로 결합하여 동작할 수도 있다. 또한, 그 모든 구성 요소들 이 각각 하나의 독립적인 하드웨어로 구현될 수 있지만, 각 구성 요소들의 그 일부 또는 전부가 선택적으로 조 합되어 하나 또는 복수 개의 하드웨어에서 조합된 일부 또는 전부의 기능을 수행하는 프로그램 모듈을 갖는 컴 퓨터 프로그램으로서 구현될 수도 있다. 그 컴퓨터 프로그램을 구성하는 코드들 및 코드 세그먼트들은 본 발명 의 기술 분야의 당업자에 의해 용이하게 추론될 수 있을 것이다. 이러한 컴퓨터 프로그램은 컴퓨터가 읽을 수 있는 저장매체(Computer Readable Media)에 저장되어 컴퓨터에 의하여 읽혀지고 실행됨으로써, 본 발명의 실시 예를 구현할 수 있다. 컴퓨터 프로그램의 저장매체로서는 자기 기록매체, 광 기록매체, 등이 포함될 수 있다. 또한, 이상에서 기재된 \"포함하다\", \"구성하다\" 또는 \"가지다\" 등의 용어는, 특별히 반대되는 기재가 없는 한, 해당 구성 요소가 내재될 수 있음을 의미하는 것이므로, 다른 구성 요소를 제외하는 것이 아니라 다른 구성 요 소를 더 포함할 수 있는 것으로 해석되어야 한다. 기술적이거나 과학적인 용어를 포함한 모든 용어들은, 다르게 정의되지 않는 한, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가진다. 사전에 정의된 용어와 같이 일반적으로 사용되는 용어들은 관련 기술의 문맥 상의 의미 와 일치하는 것으로 해석되어야 하며, 본 발명에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적 인 의미로 해석되지 않는다. 이상의 설명은 본 발명의 기술 사상을 예시적으로 설명한 것에 불과한 것으로서, 본 발명이 속하는 기술 분야에 서 통상의 지식을 가진 자라면 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 다양한 수정 및 변형이 가 능할 것이다. 따라서, 본 발명에 개시된 실시예들은 본 발명의 기술 사상을 한정하기 위한 것이 아니라 설명하 기 위한 것이고, 이러한 실시예에 의하여 본 발명의 기술 사상의 범위가 한정되는 것은 아니다. 본 발명의 보호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술 사상은 본 발명의 권리범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2021-0189387", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시 형태에 따른 AI 모델의 인간다움을 평가하는 AI 모델 평가 시스템의 전체 구성을 개략 적으로 나타낸 구성도이다. 도 2는 본 발명의 일실시 형태에 따른 AI 모델의 인간다움을 평가하는 AI 모델 평가 시스템에서 AI 모델 평가 서버의 상세 구성을 나타낸 구성도이다. 도 3은 본 발명의 일실시 형태에 따른 AI 모델 평가 서버에서 평가자 단말로 제공하는 제2 채팅 평가지의 일 예 를 나타낸 예시도이다. 도 4는 본 발명의 일실시 형태에 따른 평가 항목 중 일관성에 대한 평가데이터의 검증을 수행한 일 예를 나타낸 예시도이다. 도 5는 본 발명의 일실시 형태에 따른 대화 평가 항목 중 구체성에 대한 평가데이터의 검증을 수행한 일 예를 나타낸 예시도이다. 도 6은 본 발명의 일실시 형태에 따른 대화 평가 항목 중 인간성에 대한 평가데이터의 검증을 수행한 일 예를 나타낸 예시도이다. 도 7은 본 발명의 일실시 형태에 따른 전체 대화 패턴에 대한 느낌에 대한 평가데이터의 일 예를 나타낸 예시도 이다. 도 8은 본 발명의 일실시 형태에 따른 평가 결과의 일 예를 나타낸 예시도이다. 도 9는 본 발명의 일실시 형태에 따른 평가 결과 중 일관성의 평균 및 표준편차를 시각화한 일 예를 나타낸 예시도이다. 도 10은 본 발명의 일실시 형태에 따른 AI 모델의 인간다움을 평가하는 AI 모델 평가 방법을 설명하기 위한 흐 름도이다. 도 11은 도 8에 도시된 S101 단계 및 S102 단계를 설명하기 위한 흐름도이다."}
