{"patent_id": "10-2023-0084327", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0001717", "출원번호": "10-2023-0084327", "발명의 명칭": "신경망 모델의 객체 검출 성능평가 장치, 이의 객체 검출 성능평가 방법, 및 이를 포함하는", "출원인": "현대모비스 주식회사", "발명자": "김석인"}}
{"patent_id": "10-2023-0084327", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "신경망 모델의 이미지 처리에 의해 검출된 객체별 정밀도 및 재현율을 판단하는 정밀도-재현율 판단부;상기 객체별로 경계 박스를 생성하는 경계박스 생성부;상기 경계 박스의 사이즈에 상응하는 가중치를 상기 객체별 정밀도에 적용하는 가중치 적용부;가중치 적용된 정밀도와 상기 재현율을 기반으로 정밀도-재현율 곡선 그래프를 생성하는 정밀도-재현율 곡선 생성부; 및상기 정밀도-재현율 곡선 그래프를 바탕으로 판단되는 AP(Average Precision) 값을 바탕으로 상기 신경망 모델의 신뢰도를 평가하는 AP 값 판단부를 포함하는, 신경망 모델의 객체 검출 성능평가 장치."}
{"patent_id": "10-2023-0084327", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 가중치 적용부는, 상기 객체의 사이즈가 작을수록 큰 가중치를 적용하는, 신경망 모델의 객체 검출 성능평가 장치."}
{"patent_id": "10-2023-0084327", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 가중치 적용부는, 이미지 전체에서 객체의 사이즈가 차지하는 비율에 따라 가중치를 적용하는, 신경망 모델의 객체 검출 성능평가 장치."}
{"patent_id": "10-2023-0084327", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 가중치 적용부는, 사이즈 비율과 가중치가 일대일로 매칭된 룩-업 테이블, 또는 일정 구간의 사이즈 비율과 하나의 가중치가 매칭된 룩-업 테이블을 참조하여 가중치를 적용하는, 신경망 모델의 객체 검출 성능평가 장치."}
{"patent_id": "10-2023-0084327", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 가중치 적용부는, 이미지 내 객체의 상대적인 사이즈에 따라 가중치를 적용하는, 신경망 모델의 객체 검출성능평가 장치."}
{"patent_id": "10-2023-0084327", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서,상기 가중치 적용부는, 객체를 사이즈별로 내림차순 또는 오름차순으로 정렬시키고, 정렬된 순서로 가중치를 적용하는, 신경망 모델의 객체 검출 성능평가 장치."}
{"patent_id": "10-2023-0084327", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "신경망 모델의 이미지 처리에 의해 검출된 객체별 정밀도 및 재현율을 판단하는 단계;상기 객체별로 경계 박스를 생성하는 단계;상기 경계 박스의 사이즈에 상응하는 가중치를 상기 객체별 정밀도에 적용하는 단계;공개특허 10-2025-0001717-3-가중치 적용된 정밀도와 상기 재현율을 기반으로 정밀도-재현율 곡선 그래프를 생성하는 단계; 및상기 정밀도-재현율 곡선 그래프를 바탕으로 판단되는 AP(Average Precision) 값을 바탕으로 상기 신경망 모델의 신뢰도를 평가하는 단계를 포함하는, 신경망 모델의 객체 검출 성능평가 방법."}
{"patent_id": "10-2023-0084327", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서,상기 가중치를 상기 객체별 정밀도에 적용하는 단계는, 상기 객체의 사이즈가 작을수록 큰 가중치를 적용하는것을 포함하는, 신경망 모델의 객체 검출 성능평가 방법."}
{"patent_id": "10-2023-0084327", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 7 항에 있어서,상기 가중치를 상기 객체별 정밀도에 적용하는 단계는, 이미지 전체에서 객체의 사이즈가 차지하는 비율에 따라가중치를 적용하거나, 이미지 내 객체의 상대적인 사이즈에 따라 가중치를 적용하는 것을 포함하는, 신경망 모델의 객체 검출 성능평가 방법."}
{"patent_id": "10-2023-0084327", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "평가 대상의 신경망 모델을 탑재하고, 입력되는 이미지를 상기 신경망 모델을 이용하여 처리하는 이미지처리부; 및제 1 항 내지 제 6 항 중 어느 하나의 항에 따른 객체 검출 성능평가 장치를 포함하는, 신경망 모델의 객체 검출 성능평가 시스템."}
{"patent_id": "10-2023-0084327", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 신경망 모델의 객체 검출 성능평가 기술에 관한 것으로, 상세하게는 신경망 모델의 객체 검출 성능평 가에 객체의 사이즈를 반영하여 객체 검출 성능평가의 정확성을 향상시킬 수 있는 신경망 모델의 객체 검출 성능 평가 장치, 이의 객체 검출 성능평가 방법, 및 이를 포함하는 시스템에 관한 것이다."}
{"patent_id": "10-2023-0084327", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 신경망 모델의 객체 검출 성능평가 기술에 관한 것으로, 상세하게는 신경망 모델의 객체 검출 성능평 가에 객체의 사이즈를 반영하여 객체 검출 성능평가의 정확성을 향상시킬 수 있는 신경망 모델의 객체 검출 성 능평가 장치, 이의 객체 검출 성능평가 방법, 및 이를 포함하는 시스템에 관한 것이다."}
{"patent_id": "10-2023-0084327", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근, 인공지능(AI: Artificial Intelligence)을 이용한 기술을 카메라가 장착된 장치에 접목시켜서 카메라로부 터 촬영된 이미지 내의 객체를 탐지하거나 검출하는 연구가 다양한 분야에서 이루어지고 있다. 예를 들어, 인공지능 기반의 객체 검출기는 자율 주행 자동차, 감시 카메라, 드론 등의 카메라를 구비한 장치들 에 적용될 수 있다. 이러한 인공지능 기반 객체 검출기가 미리 결정된 수준 이상의 인식률을 가졌을 때, 객체 검출기 기반 장치들이 객체 검출기에 의해 검출된 객체를 기초로 자율주행 등과 같은 서비스를 제공하는 것이 가능하다. 일례로, 자율주행 자동차는 어떠한 조건에서도 주변의 주행 환경을 높은 수준으로 이해하고 인식해야 운행의 안 전이 보장될 수 있다. 이에 따라, 전방 충돌 방지 등과 같은 지능형 주행 및 자율주행과 관련된 모든 기능을 구 현하기 위해서는 주행 환경을 정확하게 인식하는 것이 선행되어야 한다. 자율주행을 위한 객체 검출 기술은 다 양하고 신속하게 변하는 주행 환경 내 존재하는 다양한 종류의 객체를 높은 정확도로 실시간으로 인식해야 할 필요가 있다. 최근, 신경망 모델을 활용한 객체 검출 기술이 개발되고 있다. 앞서 설명하였듯이 자율주행 자동차와 같이 다양 하고 신속하게 변하는 환경 내 존재하는 다양한 종류의 객체를 높은 정확도로 실시간으로 인식하기 위해서는 이 미지에서 객체를 검출하는 신경망 모델의 인식률이 매우 중요하다. 따라서, 신경망 모델이 높은 인식률을 갖도록 하기 위해서는 신경망 모델의 객체 검출 성능을 정확하게 평가하 는 것이 선행되어야 한다. 종래의 객체 검출 성능 평가 기술로는 IoU(Intersection over Union) 기반의 객체 검출 성능 평가 방법, Precision-Recall 기반의 객체 검출 성능 평가 방법, AP/mAP 기반의 객체 검출 성능 평가 방법 등이 있다. 이미지에는 다양한 종류의 객체가 존재할 수 있을 뿐만 아니라, 각 객체의 사이즈도 다양하다. 객체 검출기가 우수한 검출 성능을 보유하기 위해서는 큰 사이즈의 객체 뿐만 아니라 작은 사이즈의 객체에 대해서도 정확하게 검출할 수 있어야 한다. 하지만, 종래의 객체 검출 성능 평가 기술들은 이미지 내 객체의 사이즈를 성능 평가에 반영하지 못하고 있어, 객체 검출 성능 평가에 한계를 가지고 있다. 이러한 객체 검출 성능 평가의 한계는 객체 검출기의 성능을 향상 시키는 데에 제약 조건으로 작용할 수 있다."}
{"patent_id": "10-2023-0084327", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "이러한 배경기술은 발명자가 본 발명의 도출을 위해 보유하고 있었거나, 본 발명의 도출 과정에서 습득한 기술 정보로서, 반드시 본 발명의 출원 전에 일반 공중에게 공개된 공지기술이라 할 수는 없다."}
{"patent_id": "10-2023-0084327", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명에서 개시되는 실시예는 전술한 요구에 따라 안출된 것으로, 신경망 모델의 객체 검출 성능평가의 정확 성을 향상시킬 수 있는 신경망 모델의 객체 검출 성능평가 장치, 이의 객체 검출 성능평가 방법, 및 이를 포함 하는 시스템을 제공하는 것을 기술적 과제로 한다. 또한, 실시예는 신경망 모델의 객체 검출 성능평가에 객체의 사이즈를 반영할 수 있는 신경망 모델의 객체 검출 성능평가 시스템 및 그 방법을 제공하는 것을 기술적 과제로 한다. 또한, 실시예는 객체의 사이즈에 따라 서로 다른 가중치를 적용하여 객체의 사이즈를 보다 정밀하게 성능평가에 반영할 수 있는 신경망 모델의 객체 검출 성능평가 장치, 이의 객체 검출 성능평가 방법, 및 이를 포함하는 시 스템을 제공하는 것을 기술적 과제로 한다. 또한, 실시예는 이미지 전체 크기 대비 객체 사이즈에 따라 가중치를 적용할 수 있는 신경망 모델의 객체 검출 성능평가 장치, 이의 객체 검출 성능평가 방법, 및 이를 포함하는 시스템을 제공하는 것을 기술적 과제로 한다. 또한, 실시예는 이미지 내 객체의 상대적인 사이즈에 따라 가중치를 적용할 수 있는 신경망 모델의 객체 검출 성능평가 장치, 이의 객체 검출 성능평가 방법, 및 이를 포함하는 시스템을 제공하는 것을 기술적 과제로 한다. 또한, 실시예는 작은 사이즈의 객체에 큰 사이즈의 객체보다 높은 가중치를 부여함으로써, 신경망 모델이 작은 사이즈의 객체를 검출하는 데에도 우수한 성능을 가지도록 할 수 있는 신경망 모델의 객체 검출 성능평가 장치, 이의 객체 검출 성능평가 방법, 및 이를 포함하는 시스템을 제공하는 것을 기술적 과제로 한다. 본 발명의 기술적 과제는 이상에서 언급한 사항에 제한되지 않으며, 이하의 기재로부터 본 발명이 속하는 기술 분야의 통상의 지식을 가진 자라면 본 발명이 의도하는 기타의 과제들 또한 명료하게 이해할 수 있을 것이다."}
{"patent_id": "10-2023-0084327", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 기술적 수단으로서, 신경망 모델의 객체 검출 성능평가의 정확성을 향상시 킬 수 있는 신경망 모델의 객체 검출 성능평가 장치, 이의 객체 검출 성능평가 방법, 및 이를 포함하는 시스템 이 제공될 수 있다. 특히, 신경망 모델의 객체 검출 성능평가에 객체의 사이즈를 반영할 수 있는 신경망 모델의 객체 검출 성능평가 시스템 및 그 방법이 제공될 수 있다. 본 발명의 실시예에 따른 신경망 모델의 객체 검출 성능평가 장치는, 신경망 모델의 이미지 처리에 의해 검출된 객체별 정밀도 및 재현율을 판단하는 정밀도-재현율 판단부, 객체별로 경계 박스를 생성하는 경계박스 생성부, 경계 박스의 사이즈에 상응하는 가중치를 상기 객체별 정밀도에 적용하는 가중치 적용부, 가중치 적용된 정밀도 와 재현율을 기반으로 정밀도-재현율 곡선 그래프를 생성하는 정밀도-재현율 곡선 생성부, 및 정밀도-재현율 곡선 그래프를 바탕으로 판단되는 AP(Average Precision) 값을 바탕으로 신경망 모델의 신뢰도를 평가하는 AP 값 판단부를 포함할 수 있다. 실시예에 따르면, 가중치 적용부는, 객체의 사이즈가 작을수록 큰 가중치를 적용할 수 있다. 실시예에 따르면, 가중치 적용부는, 이미지 전체에서 객체의 사이즈가 차지하는 비율에 따라 가중치를 적용할 수 있다. 실시예에 따르면, 가중치 적용부는, 사이즈 비율과 가중치가 일대일로 매칭된 룩-업 테이블, 또는 일정 구간의 사이즈 비율과 하나의 가중치가 매칭된 룩-업 테이블을 참조하여 가중치를 적용할 수 있다. 실시예에 따르면, 가중치 적용부는, 이미지 내 객체의 상대적인 사이즈에 따라 가중치를 적용할 수 있다. 실시예에 따르면, 가중치 적용부는, 객체를 사이즈별로 내림차순 또는 오름차순으로 정렬시키고, 정렬된 순서로 가중치를 적용할 수 있다. 본 발명의 실시예에 따른 신경망 모델의 객체 검출 성능평가 방법은, 신경망 모델의 이미지 처리에 의해 검출된 객체별 정밀도 및 재현율을 판단하는 단계, 객체별로 경계 박스를 생성하는 단계, 경계 박스의 사이즈에 상응하 는 가중치를 상기 객체별 정밀도에 적용하는 단계, 가중치 적용된 정밀도와 재현율을 기반으로 정밀도-재현율 곡선 그래프를 생성하는 단계, 및 정밀도-재현율 곡선 그래프를 바탕으로 판단되는 AP(Average Precision) 값을 바탕으로 신경망 모델의 신뢰도를 평가하는 단계를 포함할 수 있다. 실시예에 따르면, 가중치를 객체별 정밀도에 적용하는 단계는, 객체의 사이즈가 작을수록 큰 가중치를 적용하는 것을 포함할 수 있다. 실시예에 따르면, 가중치를 객체별 정밀도에 적용하는 단계는, 이미지 전체에서 객체의 사이즈가 차지하는 비율 에 따라 가중치를 적용하는 것을 포함할 수 있다. 실시예에 따르면, 가중치를 객체별 정밀도에 적용하는 단계는, 사이즈 비율과 가중치가 일대일로 매칭된 룩-업 테이블, 또는 일정 구간의 사이즈 비율과 하나의 가중치가 매칭된 룩-업 테이블을 참조하여 가중치를 적용하는 것을 포함할 수 있다. 실시예에 따르면, 가중치를 객체별 정밀도에 적용하는 단계는, 이미지 내 객체의 상대적인 사이즈에 따라 가중 치를 적용하는 것을 포함할 수 있다. 실시예에 따르면, 가중치를 객체별 정밀도에 적용하는 단계는, 객체를 사이즈별로 내림차순 또는 오름차순으로 정렬시키고, 정렬된 순서로 가중치를 적용하는 것을 포함할 수 있다. 본 발명의 실시예에 따른 신경망 모델의 객체 검출 성능평가 시스템은, 평가 대상의 신경망 모델을 탑재하고, 입력되는 이미지를 신경망 모델을 이용하여 처리하는 이미지 처리부, 및 본 발명의 실시예에 따른 객체 검출 성 능평가 장치를 포함할 수 있다. 실시예에 따르면, 신경망 모델의 객체 검출 성능평가 시스템은, 입력되는 이미지를 이미지 처리부로 출력하는 입력 받아 입력 인터페이스, 및 객체 검출 성능평가 장치로부터의 평가 결과를 출력하는 출력 인터페이스를 더 포함할 수 있다."}
{"patent_id": "10-2023-0084327", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "위에서 언급된 과제의 해결 수단 이외의 본 발명의 다양한 예에 따른 구체적인 사항들은 아래의 기재 내용 및 도면들에 포함되어 있다."}
{"patent_id": "10-2023-0084327", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따르면, 신경망 모델의 객체 검출 성능평가에 객체의 사이즈를 반영할 수 있는 신경망 모델 의 객체 검출 성능평가 장치, 이의 객체 검출 성능평가 방법, 및 이를 포함하는 시스템이 제공될 수 있다. 실시예에 따르면, 신경망 모델의 객체 검출 성능평가에 객체의 사이즈를 반영할 수 있기 때문에, 신경망 모델의 객체 검출 성능평가의 정확성을 향상시킬 수 있다. 또한, 객체의 사이즈에 따라 서로 다른 가중치를 적용하여 객체의 사이즈를 보다 정밀하게 성능평가에 반영할 수 있어, 신경망 모델의 객체 검출 성능평가의 정확성을 보다 향상시킬 수 있다.실시예에 따르면, 이미지 전체 크기 대비 객체 사이즈에 따라 가중치를 적용할 수 있는 신경망 모델의 객체 검 출 성능평가 장치, 이의 객체 검출 성능평가 방법, 및 이를 포함하는 시스템이 제공될 수 있다. 또한, 이미지 내 객체의 상대적인 사이즈에 따라 가중치를 적용할 수 있는 신경망 모델의 객체 검출 성능평가 장치, 이의 객체 검출 성능평가 방법, 및 이를 포함하는 시스템이 제공될 수 있다. 실시예에 따르면, 작은 사이즈의 객체에 큰 사이즈의 객체보다 높은 가중치를 부여하기 때문에, 신경망 모델이 작은 사이즈의 객체를 검출하는 데에도 우수한 성능을 가지도록 할 수 있다."}
{"patent_id": "10-2023-0084327", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과는 이상에서 언급한 효과에 제한되지 않으며, 언급되지 않은 또 다른 효과는 아래의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다. 위에서 언급된 해결하고자 하는 과제, 과제 해결 수단, 효과의 내용은 청구범위의 필수적인 특징을 특정하는 것"}
{"patent_id": "10-2023-0084327", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 3, "content": "은 아니므로, 청구범위의 권리 범위는 발명의 내용에 기재된 사항에 의하여 제한되지 않는다."}
{"patent_id": "10-2023-0084327", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나, 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서 로 다른 다양한 형태로 구현될 것이며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하며, 본 발명이 속하 는 기술 분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명 은 청구항의 범주에 의해 정의될 뿐이다. 본 발명의 실시예를 설명하기 위한 도면에 개시된 형상, 크기, 비율, 각도, 개수 등은 예시적인 것이므로 본 발 명이 도시된 사항에 한정되는 것은 아니다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성 요소를 지칭한다. 또한, 본 발명을 설명함에 있어서, 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐 릴 수 있다고 판단되는 경우 그 상세한 설명은 생략한다. 본 명세서 상에서 언급한 \"포함한다\", \"갖는다\", \"이 루어진다\" 등이 사용되는 경우 \"만\"이 사용되지 않는 이상 다른 부분이 추가될 수 있다. 구성 요소를 단수로 표 현한 경우에 특별히 명시적인 기재 사항이 없는 한 복수를 포함하는 경우를 포함한다. 구성 요소를 해석함에 있어서, 오차 범위에 대한 별도의 명시적 기재가 없더라도 오차 범위를 포함하는 것으로 해석한다. 시간 관계에 대한 설명일 경우, \"후에\", \"이어서\", \"다음에\", \"전에\" 등으로 시간적 선후 관계가 설명되는 경우, \"바로\" 또는 \"직접\"이 사용되지 않는 이상 연속적이지 않은 경우도 포함할 수 있다. 제1, 제2 등이 다양한 구성요소들을 서술하기 위해서 사용되나, 이들 구성요소들은 이들 용어에 의해 제한되지 않는다. 이들 용어들은 단지 하나의 구성 요소를 다른 구성요소와 구별하기 위하여 사용하는 것이다. 따라서, 이하에서 언급되는 제1 구성요소는 본 발명의 기술적 사상 내에서 제2 구성요소일 수도 있다. 본 발명의 구성 요소를 설명하는 데에 있어서, 제 1, 제 2, A, B, (a), (b) 등의 용어를 사용할 수 있다. 이러 한 용어는 그 구성 요소를 다른 구성 요소와 구별하기 위한 것일 뿐, 그 용어에 의해 해당 구성 요소의 본질, 차례, 순서 또는 개수 등이 한정되지 않는다. 어떤 구성 요소가 다른 구성요소에 \"연결\", \"결합\" 또는 \"접속\"된다고 기재된 경우, 그 구성 요소는 그 다른 구성요소에 직접적으로 연결되거나 또는 접속될 수 있지만, 특별히 명시적인 기재 사항이 없는 간접적으로 연결되거나 또는 접속될 수 있는 각 구성 요소 사이에 다른 구성 요소가 \"개재\"될 수도 있다고 이해되어야 할 것이다. \"적어도 하나\"는 연관된 구성요소의 하나 이상의 모든 조합을 포함하는 것으로 이해되어야 할 것이다. 예를 들 면, \"제1, 제2, 및 제3 구성요소의 적어도 하나\"의 의미는 제1, 제2, 또는 제3 구성요소뿐만 아니라, 제1, 제2, 및 제3 구성요소의 두 개 이상의 모든 구성요소의 조합을 포함한다고 할 수 있다. 본 명세서의 여러 실시예들의 각각 특징들이 부분적으로 또는 전체적으로 서로 결합 또는 조합 가능하고, 기술 적으로 다양한 연동 및 구동이 가능하며, 각 실시예들이 서로에 대하여 독립적으로 실시 가능할 수도 있고 연관 관계로 함께 실시할 수도 있다. 이하, 첨부된 도면 및 실시예를 통해 본 발명의 실시예를 살펴보면 다음과 같다. 도면에 도시된 구성요소들의 스케일은 설명의 편의를 위해 실제와 다른 스케일을 가지므로, 도면에 도시된 스케일에 한정되지 않는다. 이하, 첨부된 도면을 참조하여 본 발명의 실시예에 따른 신경망 모델의 객체 검출 성능평가 장치, 이의 객체 검 출 성능평가 방법, 및 이를 포함하는 시스템에 대해서 설명한다. 도 1은 본 발명의 실시예에 따른 신경망 모델의 객체 검출 성능평가 시스템의 구성을 나타낸 도면이다. 도 1을 참조하면, 본 발명의 실시예에 따른 신경망 모델의 객체 검출 성능평가 시스템(이하, 성능평가 시스 템 또는 시스템)은 신경망 모델의 객체 검출 성능평가에 객체의 사이즈를 반영할 수 있도록 구현될 수 있다. 실시예에 따르면, 성능평가 시스템은 입력 인터페이스, 이미지 처리부, 객체 검출 성능평가 장치 , 및 출력 인터페이스를 포함할 수 있으며, 성능평가 시스템의 구성이 이에 한정되는 것은 아니다. 실시예에 따른 입력 인터페이스는 이미지를 입력 받을 수 있다. 예를 들어, 이미지는 적어도 하나 이상의 객체를 포함하고 있으며, 객체의 종류는 차량, 자전거, 사람, 동물, 표지판 등 다양할 수 있다. 예를 들어, 이 미지는 차량에 탑재된 카메라에 의해 획득된 이미지일 수 있으며, 이에 한정되는 것은 아니다. 예를 들어, 실시예에 따른 이미지는 신경망 모델의 객체 검출 성능을 평가하기 위한 데이터 셋(data set)에서 선택될 수 있다. 입력 인터페이스는 입력 받은 이미지를 이미지 처리부로 출력하여, 이미지가 이미지 처리부의 입력이 되도록 할 수 있다. 실시예에 따른 이미지 처리부(또는 평가 대상 이미지 처리부)는 평가 대상이 되는 신경망(Neural Network) 모델(평가 대상 신경망 모델)을 탑재하고 있을 수 있다. 이미지 처리부는 탑재된 신경망 모델을 이용하여 이미지를 처리하고, 처리 결과(이미지 처리 결과)를 출력할 수 있다. 예를 들어, 이미지 처리부)(또는 신경망 모델)은 입력된 이미지로부터 객체를 검출 하여 출력할 수 있다. 신경망 모델의 종류는 한정되지 않으며, 예를 들어 심층 신경망(DNN: Deep Neural Network) 모델, 합성곱 신경망(CNN: Convolution Neural Network) 모델, 순환 신경망(RNN: Recurrent Neural Network) 모델 등일 수 있다. 실시예에 따른 객체 검출 성능평가 장치는 이미지 처리부로부터의 처리 결과를 수신하고, 처리 결과 를 바탕으로 이미지 처리부(또는 신경망 모델)의 객체 검출 성능 평가를 수행할 수 있다. 객체 검출 성능평가 장치는 이미지 처리부에 의해 검출된 객체의 사이즈를 반영하여 평가를 수행할 수 있다. 실시예에 따르면, 객체 검출 성능평가 장치는 이미지 처리부에 의해 검출된 객체에 대한 경계 박스 (BB: Bounding Box)를 생성하고, 생성된 경계 박스(BB)를 기반으로 각 객체별로 가중치(사이즈 가중치)를 적용 할 수 있다. 본 발명에서, 경계 박스의 사이즈(경계 박스 사이즈)는 객체의 사이즈(객체 사이즈)에 의해 결정되는 것으로, 경계 박스 사이즈와 객체 사이즈는 동일한 의미로 사용될 수 있다. 예를 들어, 객체 검출 성능평가 장치는 처리 결과를 이용하여 각 객체별 정밀도(Precision, P)-재현율 (Recall, R)를 판단하고, 판단된 객체별 정밀도 각각에 사이즈 가중치를 적용하여 각 객체별로 가중치 적용된 정밀도(Pw)를 판단할 수 있다. 그리고, 객체 검출 성능평가 장치는 가중치 적용된 정밀도(Pw) 및 재현율(R)을 기반으로 P-R(Precision- Recall) 곡선 그래프를 생성하고, P-R 곡선 그래프를 바탕으로 AP(Average Precision) 값을 판단할 수 있다. 이후, 객체 검출 성능평가 장치는 AP 값을 바탕으로 신경망 모델의 신뢰도를 평가할 수 있다. 예를 들면, 객체 검출 성능평가 장치는 AP 값이 기 설정된 기준값 이상이면 신경망 모델의 신뢰도가 높은 것으로 평가하고, AP 값이 기 설정된 기준값 미만이면 신경망 모델의 신뢰도가 낮은 것으로 평가할 수 있 다. 출력 인터페이스는 객체 검출 성능평가 장치에서 평가된 신경망 모델의 평가 결과를 디스플레이 장치를 통해 출력할 수 있다. 예를 들어, 출력 인터페이스는 신경망 모델과 관련한 PR 곡선 그래프, AP 값, 신뢰도 등을 출력할 수 있다. 도 2는 본 발명의 실시예에 따른 객체 검출 성능평가 장치의 구성을 나타낸 도면이다. 도 1 및 도 2를 참조하면, 본 발명의 실시예에 따른 객체 검출 성능평가 장치는 정밀도-재현율 판단부(P-R 판단부), 경계박스 생성부, 가중치 적용부, P-R 곡선 생성부, 및 AP 값 판단부를 포 함할 수 있으며, 평가부의 구성이 이에 한정되는 것은 아니다. 실시예에 따른 객체 검출 성능평가 장치는 적어도 하나의 프로세서(processer)로 구현될 수 있다. 또한, 객체 검출 성능평가 장치는 동작 수행에 필요한 정보, 알고리즘 등을 저장하고 있는 메모리를 포함할 수 있다. P-R 판단부는 처리 결과를 바탕으로 각 객체별 정밀도(Precision, P)-재현율(Recall, R)을 판단할 수 있다. 예를 들어, P-R 판단부는 하기의 수학식 1을 바탕으로 정밀도(Precision, P) 및 재현율(Recall, R)을 판 단할 수 있다. [수학식 1]"}
{"patent_id": "10-2023-0084327", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기서, TP(True Positive)는 True라는 입력값을 True로 예측한 것을 의미하고, FP(False Positive)는 False라 는 입력값을 True로 잘못 예측한 것을 의미하며, FN(False Negative)는 True라는 입력값을 Falsefh 잘못 예측 한 것을 의미한다. 정밀도(Precision)는 TP와 FP의 합에서 TP가 차지하는 비율이다. 즉, True로 예측한 건수들(TP+FP) 중에서 실제 값이 True인 건수(TP)의 비율이다. 재현율(Recall)은 TP와 FN의 합에서 TP가 차지하는 비율이다. 즉, 예측값을 불문하고 실제값이 True인 건수들 (TP+FN) 중에서 실제값 True를 정확히 True라고 예측한 건수(TP)의 비율이다. 경계박스 생성부는 처리 결과를 바탕으로 객체에 대한 경계 박스(BB: Bounding Box)를 생성할 수 있다. 가중치 적용부는 경계박스 생성부에 의해 생성된 객체별 경계 박스 사이즈에 상응하는 가중치를 P-R 판단부에 의해 판단된 정밀도(P)에 적용하여 가중치 적용된 정밀도(Pw)를 판단할 수 있다. 예를 들어, 가중치 적용부는 기 설정된 사이즈별 가중치 룩-업 테이블(LUT: Look-Up Table)을 참조하여 결 정된 가중치를 정밀도(P)에 적용할 수 있다. 예를 들어, 가중치 적용부는 객체 사이즈가 작을수록 큰 가중치를 적용할 수 있다. 실시예에 따르면, 가중치 적용부는 이미지 전체 크기 대비 객체 사이즈(또는 경계박스 사이즈)에 따라 가 중치를 적용할 수 있다. 즉, 가중치 적용부는 이미지 전체에서 객체가 차지하는 비율에 따라 가중치를 적 용할 수 있다. 예를 들어, 사이즈별 가중치 룩-업 테이블은 사이즈 비율과 가중치가 일대일로 매칭된 단일 사이즈별 가중치 룩 -업 테이블일 수 있다. 예를 들어, 사이즈별 가중치 룩-업 테이블은 일정 구간의 사이즈 비율과 하나의 가중치 가 매칭된 구간 사이즈별 가중지 룩-업 테이블일 수 있다. 설정에 따라, 가중치 적용부는 단일 사이즈별 가중치 룩-업 테이블을 참조하거나, 구간 사이즈별 가중치 룩-업 테이블을 참조하여 정밀도(P)에 가중치를 적용할 수 있다. 실시예에 따르면, 가중치 적용부는 이미지 내 객체의 상대적인 사이즈에 따라 가중치를 적용할 수 있다. 예를 들어, 가중치 적용부는 객체를 사이즈별로 내림차순으로 또는 오름차순으로 정렬시키고, 작은 사이즈 의 객체로부터 큰 사이즈의 객체로 갈수록 작은 가중치를 적용할 수 있다. 이를 위해, 가중치 적용부는 객체 사이즈와 가중치가 매칭되도록 기 설정된 룩-업 테이블을 참조할 수 있 다. P-R 곡선 생성부는 가중치 적용된 정밀도(Pw)와 재현율(R)을 기반으로 P-R(Precision-Recall) 곡선 그래 프를 생성할 수 있다. AP 값 판단부는 P-R 곡선 생성부에 의해 생성된 P-R 곡선 그래프를 바탕으로 AP(Average Precision) 값을 판단할 수 있다. 그리고, AP 값 판단부는 AP 값을 바탕으로 신경망 모델의 신뢰도를 평가할 수 있다. 예를 들어, AP 값 판단부는 AP 값이 기 설정된 기준값 이상이면 신경망 모델의 신뢰도가 높은 것으로 평가하고, AP 값이 기 설정된 기준값 미만이면 신경망 모델의 신뢰도가 낮은 것으로 평가할 수 있다. 도 3은 본 발명의 실시예에 따른 신경망 모델의 객체 검출 성능평가 방법을 설명하기 위한 순서도이고, 도 4는 본 발명의 실시예에 따른 신경망 모델의 객체 검출 성능평가 방법에 있어서 경계 박스를 생성한 예를 나타낸 도 면이다. 도 3에 도시된 신경망 모델의 객체 검출 성능평가 방법은 도 1 및 2를 참조하여 설명한 신경망 모델의 객체 검 출 성능평가 시스템에 의해 수행될 수 있다. 이하에서는 도 1 내지 도 4를 참조하여 본 발명의 실시예에 따른 신경망 모델의 객체 검출 성능평가 방법을 설 명하되, 객체 검출 성능평가 장치의 동작을 중심으로 설명한다. 먼저, 객체 검출 성능평가 장치는 이미지 처리부로부터 이미지 처리 결과를 입력 받을 수 있다 (S300). 예를 들어, 이미지 처리부는 평가 대상이 되는 신경망 모델을 탑재하고 있으며, 입력되는 이미지를 신경망 모델을 이용하여 처리한 후 이미지 처리 결과를 객체 검출 성능평가 장치로 입력할 수 있다. 여기서, 이미 지 처리 결과는 이미지로부터 검출한 객체를 포함할 수 있다. 이미지 처리 결과가 입력되면, 객체 검출 성능평가 장치는 이미지 처리 결과를 바탕으로 각 객체별 정밀도 (Precision, P)-재현율(Recall, R)을 판단할 수 있다(S310). 단계 S310에서, 객체 검출 성능평가 장치는 앞서 설명한 수학식 1을 바탕으로 각 객체별 정밀도 (Precision, P)-재현율(Recall, R)을 판단할 수 있다. 그리고, 객체 검출 성능평가 장치는 이미지 처리 결과를 바탕으로 각 객체별로 경계 박스(BB: Bounding Box)를 생성할 수 있다(S320). 예를 들어, 객체 검출 성능평가 장치는 도 4에 도시된 바와 같이 사람 객체에 대해 경계 박스를 생성할 수 있다. 이때, 객체 검출 성능평가 장치는 객체의 크기에 상응하여 경계 박스를 생성할 수 있다. 이에 따라, 본 발명에서 객체의 크기와 경계 박스의 크기는 비례하고, 객체의 크기는 경계 박스의 크기에 상응하는 것으로 볼 수 있다. 이후, 객체 검출 성능평가 장치는 객체별 경계 박스 사이즈에 상응하는 가중치를 P-R 판단부에 의해 판단된 정밀도(P)에 적용하여 가중치 적용된 정밀도(Pw)를 판단할 수 있다(S330). 단계 S330에서, 객체 검출 성능평가 장치는 기 설정된 사이즈별 가중치 룩-업 테이블(LUT: Look-Up Tabl e)을 참조하여 결정된 가중치를 정밀도(P)에 적용할 수 있다. 단계 S330에서, 객체 검출 성능평가 장치는 객체 사이즈가 작을수록 큰 가중치를 적용할 수 있다. 실시예에 따르면, 객체 검출 성능평가 장치는 이미지 전체에서 객체가 차지하는 비율에 따라 가중치를 적 용할 수 있다. 예를 들어, 객체 검출 성능평가 장치는 단일 사이즈별 가중치 룩-업 테이블을 참조하거나, 구간 사이즈별 가중치 룩-업 테이블을 참조하여 정밀도(P)에 가중치를 적용할 수 있다. 실시예에 따르면, 객체 검출 성능평가 장치는 이미지 내 객체의 상대적인 사이즈에 따라 가중치를 적용할 수 있다. 예를 들어, 객체 검출 성능평가 장치는 객체를 사이즈별로 내림 차순으로 또는 오름 차순으로 정렬시키고, 작은 사이즈의 객체로부터 큰 사이즈의 객체로 갈수록 작은 가중치를 적용할 수 있다. 단계 S330 이후, 객체 검출 성능평가 장치는 가중치 적용된 정밀도(Pw)와 재현율(R)을 기반으로 P- R(Precision-Recall) 곡선 그래프를 생성할 수 있다(S340). 단계 S340 이후, 객체 검출 성능평가 장치는 P-R 곡선 그래프를 바탕으로 AP(Average Precision) 값을 판 단할 수 있다(S350). 단계 S350 이후, 객체 검출 성능평가 장치는 AP 값을 바탕으로 신경망 모델의 신뢰도를 평가할 수 있 다(S360). 단계 S360에서, 객체 검출 성능평가 장치는 AP 값이 기 설정된 기준값 이상이면 신경망 모델의 신뢰 도가 높은 것으로 평가하고, AP 값이 기 설정된 기준값 미만이면 신경망 모델의 신뢰도가 낮은 것으로 평 가할 수 있다. 단계 S360 이후, 객체 검출 성능평가 장치는 평가 결과를 출력 인터페이스를 통해 출력할 수 있다. 이상 첨부된 도면을 참조하여 본 발명의 실시예들을 더욱 상세하게 설명하였으나, 본 발명이 반드시 이러한 실 시예로 국한되는 것은 아니고, 본 발명의 기술사상을 벗어나지 않는 범위 내에서 다양하게 변형 실시될 수 있다. 따라서, 본 명세서에 개시된 실시예들은 본 발명의 기술 사상을 한정하기 위한 것이 아니라 설명하기 위 한 것이고, 이러한 실시예에 의하여 본 발명의 기술 사상의 범위가 한정되는 것은 아니다. 그러므로, 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 본 발명의 보호 범위 는 청구 범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술 사상은 본 발명의 권리 범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2023-0084327", "section": "도면", "subsection": "도면설명", "item": 1, "content": "이하에 첨부되는 도면들은 본 발명의 실시예에 관한 이해를 돕기 위한 것으로, 상세한 설명과 함께 실시예들을 제공한다. 다만, 본 실시예의 기술적 특징이 특정 도면에 한정되는 것은 아니며, 각 도면에서 개시하는 특징들 은 서로 조합되어 새로운 실시예로 구성될 수 있다. 도 1은 본 발명의 실시예에 따른 신경망 모델의 객체 검출 성능평가 시스템의 구성을 나타낸 도면이다. 도 2는 본 발명의 실시예에 따른 객체 검출 성능평가 장치의 구성을 나타낸 도면이다. 도 3은 본 발명의 실시예에 따른 신경망 모델의 객체 검출 성능평가 방법을 설명하기 위한 순서도이다. 도 4는 본 발명의 실시예에 따른 신경망 모델의 객체 검출 성능평가 방법에 있어서 경계 박스를 생성한 예를 나 타낸 도면이다."}
