{"patent_id": "10-2021-0114915", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0135944", "출원번호": "10-2021-0114915", "발명의 명칭": "강판 콘크리트 구조물의 결함 측정 방법 및 강판 콘크리트 구조물의 결함 측정 장치", "출원인": "고려대학교 산학협력단", "발명자": "주영규"}}
{"patent_id": "10-2021-0114915", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "콘크리트에 강판이 피복된 강판 콘크리트 구조물(Steel plate concrete structure) 내부의 상기 콘크리트의 결함 측정 방법으로서,일면에 모사 결함이 모사된 콘크리트와 상기 콘크리트의 일면을 피복하는 강판으로 구성되는 결함 모사체의 상기 강판의 두께, 상기 모사 결함에 대응되는 모사 결함 정보, 상기 강판 측에서 촬영된 상기 결함 모사체의 열화상 영상으로부터 추출된 상기 모사 결함의 온도 분포 정보를 포함하는 훈련 데이터를 입력하는 단계와;상기 훈련 데이터를 이용하여 실제 결함 정보를 출력하도록 결함 정보 출력 학습 모델에 대해 기계 학습(Machine Learning)을 진행하는 단계와;상기 실제 강판 콘크리트 구조물의 강판의 두께, 상기 실제 강판 콘크리트 구조물의 열화상 영상으로부터 추출된 상기 콘크리트 결함 부분의 온도 분포 정보를 포함하는 실제 측정 데이터를 입력하는 단계와;상기 기계 학습된 상기 결함 정보 출력 학습 모델을 통해 상기 실제 측정 데이터로부터 실제 결함 정보를 출력하는 단계를 포함하며,상기 결함 모사체의 상기 강판에는 모사 용접부가 형성되는 것을 특징으로 하는, 강판 콘크리트 구조물의 결함측정 방법."}
{"patent_id": "10-2021-0114915", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 훈련 데이터를 입력하는 단계와;상기 기계 학습(Machine Learning)을 진행하는 단계는,서로 다른 두께의 강판 규격을 갖는 결함 모사체에 대해 반복적으로 수행하는 것을 특징으로 하는, 강판 콘크리트 구조물의 결함 측정 방법."}
{"patent_id": "10-2021-0114915", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 훈련 데이터는,상기 결함 모사체의 상기 열화상 영상 촬영 시 촬영 환경 정보를 포함하며,상기 실제 측정 데이터를 입력하는 단계는,상기 실제 강판 콘크리트 구조물의 열화상 영상 촬영 시 상기 촬영 환경 정보에 상응하는 실제 촬영 환경 정보를 측정하여 입력하는 단계를 포함하는 것을 특징으로 하는, 강판 콘크리트 구조물의 결함 측정 방법."}
{"patent_id": "10-2021-0114915", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 훈련 데이터는,상기 결함 모사체의 상기 열화상 영상으로부터 추출된 상기 모사 결함의 형상 정보를 포함하며,공개특허 10-2021-0135944-3-상기 실제 측정 데이터는,상기 실제 강판 콘크리트 구조물의 상기 열화상 영상으로부터 추출된 실제 결함의 형상 정보를 포함하는 것을특징으로 하는, 강판 콘크리트 구조물의 결함 측정 방법."}
{"patent_id": "10-2021-0114915", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 결함 정보 출력 학습 모델은,인공 신경망 모델(artificial neural network model)를 갖는 지도 학습 알고리즘을 포함하는 것을 특징으로 하는, 강판 콘크리트 구조물의 결함 측정 방법."}
{"patent_id": "10-2021-0114915", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "콘크리트에 강판이 피복된 강판 콘크리트 구조물(Steel plate concrete structure) 내부의 상기 콘크리트의 결함 측정 장치로서,일면에 모사 결함이 모사된 콘크리트와 상기 콘크리트의 일면을 피복하는 강판으로 구성되는 결함 모사체와 실제 강판 콘크리트 구조물의 열화상 영상을 촬영하는 열화상 카메라와;상기 열화상 영상으로부터 온도 분포 정보를 추출하는 온도 정보 추출부와;상기 결함 모사체의 상기 강판의 두께, 상기 모사 결함에 대응되는 모사 결함 정보, 상기 온도 분포 정보를 포함하는 훈련 데이터에 대해 기계 학습이 진행되는 결함 정보 출력 학습 모델을 포함하는 기계 학습부와;상기 실제 강판 콘크리트 구조물의 강판의 두께, 상기 실제 강판 콘크리트 구조물의 열화상 영상으로부터 추출된 상기 콘크리트 결함 부분의 온도 분포 정보를 포함하는 실제 측정 데이터를 입력받고 상기 기계 학습된 결함정보 출력 학습 모델을 통해 실제 결함 정보를 출력하는 결함 정보 출력부를 포함하며,상기 결함 모사체의 상기 강판에는 모사 용접부가 형성되는 것을 특징으로 하는, 강판 콘크리트 구조물의 결함측정 장치."}
{"patent_id": "10-2021-0114915", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 열화상 영상 촬영 시 촬영 환경 정보를 측정하는 환경 정보 측정부를 더 포함하는, 강판 콘크리트 구조물의 결함 측정 장치."}
{"patent_id": "10-2021-0114915", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서,상기 열화상 카메라와, 가시광 카메라가 탑재되어 상기 실제 강판 콘크리트 구조물 주위를 비행하는 촬영 드론을 더 포함하는, 강판 콘크리트 구조물의 결함 측정 장치."}
{"patent_id": "10-2021-0114915", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제6항에 있어서,상기 기계 학습부는,서로 다른 두께의 강판 규격을 갖는 결함 모사체에 대해 기계 학습이 반복적으로 수행되는 것을 특징으로 하는,공개특허 10-2021-0135944-4-강판 콘크리트 구조물의 결함 측정 장치."}
{"patent_id": "10-2021-0114915", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제6항에 있어서,상기 훈련 데이터는,상기 결함 모사체의 상기 열화상 영상으로부터 추출된 상기 모사 결함의 형상 정보를 포함하며,상기 실제 측정 데이터는,상기 실제 강판 콘크리트 구조물의 상기 열화상 영상으로부터 추출된 실제 결함의 형상 정보를 포함하는 것을특징으로 하는, 강판 콘크리트 구조물의 결함 측정 장치."}
{"patent_id": "10-2021-0114915", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제6항에 있어서,상기 결함 정보 출력 학습 모델은,인공 신경망 모델(artificial neural network model)를 갖는 지도 학습 알고리즘을 포함하는 것을 특징으로 하는, 강판 콘크리트 구조물의 결함 측정 장치."}
{"patent_id": "10-2021-0114915", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 측면에 따르면, 콘크리트에 강판이 피복된 강판 콘크리트 구조물(Steel plate concrete structure) 내부의 상기 콘크리트의 결함 측정 방법으로서, 일면에 모사 결함이 모사된 콘크리트와 상기 콘크리 트의 일면을 피복하는 강판으로 구성되는 결함 모사체의 상기 강판의 두께, 상기 모사 결함에 대응되는 모사 결 (뒷면에 계속)"}
{"patent_id": "10-2021-0114915", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 강판 콘크리트 구조물의 결함 측정 방법 및 강판 콘크리트 구조물의 결함 측정 장치에 관한 것이다."}
{"patent_id": "10-2021-0114915", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "강판 조립체를 거푸집으로 하여 강판 내부에 콘크리트를 타설하고 강판이 콘크리트를 구속하여 강성, 내력, 변 형성능, 시공 등의 측면에 우수한 특성을 발휘할 수 있는 강판 콘크리트 구조(Steel plate concrete structur e)가 알려져 있다. 이러한 강판 콘크리트 구조는 스터드, 타이 바(Tie bar)가 결합된 두 개의 강판 내측에 콘크리트를 타설하여 강 판과 콘크리트가 일체적으로 거동할 수 있도록 한 것으로서, 원자력 발전소 등의 대형 구조물에 시공되고 있다. 그런데, 이런 강판 콘크리트 구조물의 경우 표면에 강판으로 피복되어 있기 때문에 유지관리를 위한 안전 검사 시 내부의 콘크리트의 결함을 검사하기가 어려운 점이 있다. 구조물의 안전 검사는 육안 검사와 비파괴 검사로 나눌 수 있는데 육안 검사는 구조물의 결함을 육안으로 측정 하는 것이고, 비파괴 검사는 내부의 균열 등의 결함을 검사하기 위해 구조물에 손상이나 파괴하지 않고 외부에 서 검사하는 방법이다. 최근 비파괴 검사 중 열화상 카메라를 이용한 건축물의 균열 측정 방법이 개발되어 있다. 열화상 카메라를 이용 하면 사물의 표면으로부터 방출되는 복사열을 감지 및 측정하고 이를 통하여 사물의 표면 온도를 수치화 할 수 있는데, 이 때 건물의 균열부는 균열을 통하여 내부에서 열이 방출되어 주변온도보다 상대적으로 높게 측정되는 원리를 통하여 균열 여부를 판단하는 측정방법이다. 그런데, 강판 콘크리트 구조물의 경우 콘크리트의 외면에 강판이 피복되어 있어 표면에서 방출되는 복사열의 감 지가 용이하지 않아 표면 온도를 수치화하는데 어려움이 있고, 이로 인해 결함 정보를 명확히 검사하는 데 어려 움이 있다.선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허공보 제 10-2016-0031119호(2016.03.22 공개)"}
{"patent_id": "10-2021-0114915", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 강판 콘크리트 결함 모사체의 강판 두께, 모사 결함 정보, 열화상 영상을 통한 온도 분포 정보 등을 학습 데이터로 기계 학습을 진행함으로써 실제 강판 콘크리트 구조물의 실제 결함 정보를 산출할 수 있는 강판 콘크리트 구조물의 결함 측정 방법 및 강판 콘크리트 구조물의 결함 측정 장치를 제공하는 것이다."}
{"patent_id": "10-2021-0114915", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 측면에 따르면, 콘크리트에 강판이 피복된 강판 콘크리트 구조물(Steel plate concrete structure) 내부의 상기 콘크리트의 결함 측정 방법으로서, 일면에 모사 결함이 모사된 콘크리트와 상기 콘크리 트의 일면을 피복하는 강판으로 구성되는 결함 모사체의 상기 강판의 두께, 상기 모사 결함에 대응되는 모사 결 함 정보, 상기 강판 측에서 촬영된 상기 결함 모사체의 열화상 영상으로부터 추출된 상기 모사 결함의 온도 분 포 정보를 포함하는 훈련 데이터를 입력하는 단계와; 상기 훈련 데이터를 이용하여 실제 결함 정보를 출력하도 록 결함 정보 출력 학습 모델에 대해 기계 학습(Machine Learning)을 진행하는 단계와; 상기 실제 강판 콘크리 트 구조물의 강판의 두께, 상기 실제 강판 콘크리트 구조물의 열화상 영상으로부터 추출된 상기 콘크리트 결함 부분의 온도 분포 정보를 포함하는 실제 측정 데이터를 입력하는 단계와; 상기 기계 학습된 상기 결함 정보 출 력 학습 모델을 통해 상기 실제 측정 데이터로부터 실제 결함 정보를 출력하는 단계를 포함하는, 강판 콘크리트 구조물의 결함 측정 방법이 제공된다. 상기 훈련 데이터를 입력하는 단계와; 상기 기계 학습(Machine Learning)을 진행하는 단계는, 서로 다른 두께의 강판 규격을 갖는 결함 모사체에 대해 반복적으로 수행할 수 있다. 상기 결함 모사체의 상기 강판에는 모사 용접부가 형성될 수 있다. 상기 훈련 데이터는, 상기 결함 모사체의 상기 열화상 영상 촬영 시 촬영 환경 정보를 포함할 수 있으며, 이 경 우, 상기 실제 측정 데이터를 입력하는 단계는, 상기 실제 강판 콘크리트 구조물의 열화상 영상 촬영 시 상기 촬영 환경 정보에 상응하는 실제 촬영 환경 정보를 측정하여 입력하는 단계를 포함할 수 있다. 상기 훈련 데이터는, 상기 결함 모사체의 상기 열화상 영상으로부터 추출된 상기 모사 결함의 형상 정보를 포함 할 수 있으며, 이 경우, 상기 실제 측정 데이터는, 상기 실제 강판 콘크리트 구조물의 상기 열화상 영상으로부 터 추출된 실제 결함의 형상 정보를 포함할 수 있다. 상기 결함 정보 출력 학습 모델은, 인공 신경망 모델(artificial neural network model)를 갖는 지도 학습 알 고리즘을 포함할 수 있다. 본 발명의 다른 측면에 따르면, 콘크리트에 강판이 피복된 강판 콘크리트 구조물(Steel plate concrete structure) 내부의 상기 콘크리트의 결함 측정 장치로서, 일면에 모사 결함이 모사된 콘크리트와 상기 콘크리트 의 일면을 피복하는 강판으로 구성되는 결함 모사체와 실제 강판 콘크리트 구조물의 열화상 영상을 촬영하는 열 화상 카메라와; 상기 열화상 영상으로부터 온도 분포 정보를 추출하는 온도 정보 추출부와; 상기 결함 모사체의 상기 강판의 두께, 상기 모사 결함에 대응되는 모사 결함 정보, 상기 온도 분포 정보를 포함하는 훈련 데이터에 대해 기계 학습이 진행되는 결함 정보 출력 학습 모델을 포함하는 기계 학습부와; 상기 실제 강판 콘크리트 구 조물의 강판의 두께, 상기 실제 강판 콘크리트 구조물의 열화상 영상으로부터 추출된 상기 콘크리트 결함 부분 의 온도 분포 정보를 포함하는 실제 측정 데이터를 입력받고 상기 기계 학습된 결함 정보 출력 학습 모델을 통 해 실제 결함 정보를 출력하는 결함 정보 출력부를 포함하는, 강판 콘크리트 구조물의 결함 측정 장치가 제공된 다.상기 강판 콘크리트 구조물의 결함 측정 장치는, 상기 열화상 영상 촬영 시 촬영 환경 정보를 측정하는 환경 정 보 측정부를 더 포함할 수 있다. 그리고, 상기 열화상 카메라와, 가시광 카메라가 탑재되어 상기 실제 강판 콘크리트 구조물 주위를 비행하는 촬 영 드론을 더 포함할 수 있다. 상기 기계 학습부는, 서로 다른 두께의 강판 규격을 갖는 결함 모사체에 대해 기계 학습이 반복적으로 수행될 수 있다. 상기 결함 모사체의 상기 강판에는 모사 용접부가 형성될 수 있다. 상기 훈련 데이터는, 상기 결함 모사체의 상기 열화상 영상으로부터 추출된 상기 모사 결함의 형상 정보를 포함 할 수 있으며, 이 경우, 상기 실제 측정 데이터는, 상기 실제 강판 콘크리트 구조물의 상기 열화상 영상으로부 터 추출된 실제 결함의 형상 정보를 포함할 수 있다. 상기 결함 정보 출력 학습 모델은, 인공 신경망 모델(artificial neural network model)를 갖는 지도 학습 알 고리즘을 포함할 수 있다."}
{"patent_id": "10-2021-0114915", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따르면, 강판 콘크리트 결함 모사체의 강판 두께, 모사 결함 정보, 열화상 영상을 통한 온 도 분포 정보 등을 학습 데이터로 기계 학습을 진행함으로써 실제 강판 콘크리트 구조물의 실제 결함 정보를 산 출할 수 있다."}
{"patent_id": "10-2021-0114915", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변환을 가할 수 있고 여러 가지 실시예를 가질 수 있는 바, 특정 실시예들을 도면에 예시하고 상세한 설명에 상세하게 설명하고자 한다. 그러나, 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변환, 균등물 내지 대체물을 포함하는 것으로 이해되어 야 한다. 본 발명을 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다 고 판단되는 경우 그 상세한 설명을 생략한다. 이하, 본 발명에 따른 강판 콘크리트 구조물의 결함 측정 방법 및 강판 콘크리트 구조물의 결함 측정 장치를 첨 부한 도면을 참조하여 상세히 설명하기로 하며, 첨부한 도면을 참조하여 설명함에 있어서, 동일하거나 대응하는 구성 요소는 동일한 도면번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 도 1은 본 발명의 일 실시예에 따른 강판 콘크리트 구조물의 결함 측정 방법의 순서도이다. 그리고, 도 2는 본 발명의 일 실시예에 따른 강판 콘크리트 구조물의 결함 측정 방법의 결함 모사체의 분해 사시도이고, 도 3은 본 발명의 일 실시예에 따른 강판 콘크리트 구조물의 결함 측정 방법의 결함 모사체의 단면도이다. 그리고, 도 4는 본 발명의 일 실시예에 따른 강판 콘크리트 구조물의 결함 측정 방법에 따른 열화상 촬영 상황을 도시한 도면이 다. 도 1 내지 도 4에는, 결함 모사체, 콘크리트(14, 26), 모사 결함, 강판(18, 28), 모사 용접부, 열 화상 카메라, 강판 콘크리트 구조물, 촬영 드론, 가시광 카메라가 도시되어 있다. 본 실시예에 강판 콘크리트 구조물의 결함 측정 방법은, 프로세스 상에서 구현될 수 있으며, 콘크리트에 강 판이 피복된 강판 콘크리트 구조물(Steel plate concrete structure) 내부의 콘크리트의 결함 측 정 방법으로서, 일면에 모사 결함이 모사된 콘크리트와 콘크리트의 일면을 피복하는 강판으로 구성되는 결함 모사체의 강판의 두께(t), 모사 결함에 대응되는 모사 결함 정보, 강판 측에서 촬영 된 결함 모사체의 열화상 영상으로부터 추출된 모사 결함의 온도 분포 정보를 포함하는 훈련 데이터를 입력하는 단계와; 훈련 데이터를 이용하여 실제 결함 정보를 출력하도록 결함 정보 출력 학습 모델에 대해 기계 학습(Machine Learning)을 진행하는 단계와; 실제 강판 콘크리트 구조물의 강판의 두께, 실제 강판 콘크리 트 구조물의 열화상 영상으로부터 추출된 콘크리트 결함 부분의 온도 분포 정보를 포함하는 실제 측정 데이 터를 입력하는 단계와; 기계 학습된 결함 정보 출력 학습 모델을 통해 실제 측정 데이터로부터 실제 결함 정보 를 출력하는 단계를 포함한다. 본 실시예에 따른 강판 콘크리트 구조물의 결함 측정 방법은 컴퓨터를 포함한 프로세스상에서 구현될 수 있을 것이다. 도 1을 참조하여, 본 실시예에 따른 강판 콘크리트 구조물의 결함 측정 방법을 자세히 설명하면 다음과 같다. 먼저, 일면에 모사 결함이 모사(模寫)된 콘크리트와 콘크리트의 일면을 피복하는 강판으로 구 성되는 결함 모사체의 강판의 두께(t), 모사 결함에 대응되는 모사 결함 정보, 강판 측에서 촬영된 결함 모사체의 열화상 영상으로부터 추출된 모사 결함의 온도 분포 정보를 포함하는 훈련 데이터를 입 력한다(S100). 도 2 및 도 3을 참고하면, 결함 모사체는, 일면에 모사 결함이 모사된 일정 두께의 콘크리트와, 모 사 결함이 형성된 콘크리트의 일면을 피복하는 강판으로 구성된다. 모사 결함은 실제 콘크리트 의 타설 과정에서 발생할 수 있는 공극, 재료 분리, 양생 과정 또는 사용 과정에서 발생할 수 있는 균열을 모사한 것으로서 다양한 형태로 형성될 수 있다. 모사 결함을 형성할 때는 각 모사 결함의 크기, 폭, 길이, 깊이 등의 모사 결함 정보를 명확히 측정하여 둔다. 한편, 강판 콘크리트 구조물의 결함 측정 방법에 있어서, 실제 강판 콘크리트 구조물을 모사하는 결함 모사 체에 관한 정보로서 콘크리트를 피복하는 강판 두께가 매우 중요하다. 콘크리트의 열전도율은 강판의 열전도율에 비해 상대적으로 많이 낮은데, 강판 내부의 콘크리트의 결함에 따른 온도 변화가 강판의 두께에 의해 다른 양상을 보이게 되므로 결함 모사체의 강판의 두께(t)도 미리 측정하 여 훈련 데이터로 활용한다. 그리고, 실제 강판 콘크리트 구조물에 있어서 규격화된 강판은 용접에 의 해 서로 연결되어 콘크리트를 피복하기 때문에, 실제 강판 콘크리트 구조물을 모사하기 위해 결함 모사체 의 강판에 모사 용접부를 형성할 수 있다. 모사 용접부에 대한 정보도 훈련 데이터로 사용될 수 있다. 그리고, 열화상 카메라를 이용하여 강판 측에서 결함 모사체에 대해 촬영하여 열화상 영상을 얻고 이미지 프로세싱을 거쳐 열화상 영상으로부터 결함 모사체의 온도 분포 정보를 획득한다. 이때 열화상 영상 으로부터 모사 결함 부위의 온도 분포 정보를 획득할 수 있다. 상술한 결함 모사체의 강판 두께, 모사 결함의 크기, 폭, 길이, 깊이 등의 모사 결함 정보, 모사 결함의 온도 분포 정보는 후술할 결함 정보 출력 학습 모델의 훈련 데이터로 활용된다. 보다 정확한 결함 정보의 출력을 위해서는 다양한 형태의 모사 결함과, 서로 다른 강판의 두께를 갖는 강판 규격을 갖는 결함 모사체에 대해 훈련 데이터를 확보한다. 한편, 훈련 데이터로서 결함 모사체의 촬영 환경 정보가 포함될 수 있다. 실제 강판 콘크리트 구조물의 결함 정보를 얻기 위한 열화상 촬영 시 외부 환경에 따른 영향을 고려해야 하기 때문에, 결함 모사체의 열 화상 촬영 시 주변 온도, 풍속, 습도, 조도 등을 측정하는데, 이를 촬영 환경 정보라 한다. 열화상 영상을 촬영 시 하나의 결함 모사체에 대해 주변 온도, 풍속, 습도, 조도 등을 변경하면서 촬영 환 경 정보를 획득함으로써 많은 훈련 데이터를 확보할 수 있다. 또한, 훈련 데이터는, 결함 모사체의 열화상 영상으로부터 추출된 모사 결함의 형상 정보를 포함할 수 있다. 모사 결함의 형상 정보는 열화상 영상으로부터 이미지 프로세싱을 거쳐 생성될 수 있는데, 이에 대응 되어 실제 측정 데이터 또한 실제 강판 콘크리트 구조물의 열화상 영상으로부터 추출된 실제 결함의 형상정보를 포함하게 된다. 모사 결함의 형상 정보는 결함 정보 출력 학습 모델의 훈련 데이터로 함께 학습될 수 있다. 다음에, 훈련 데이터를 이용하여 실제 결함 정보를 출력하도록 결함 정보 출력 학습 모델에 대해 기계 학습 (Machine Learning)을 진행한다(S200). 위 단계에서 입력된 결함 모사체의 강판의 두께, 모사 결함의 크기, 폭, 길이, 깊이 등의 모사 결함 정보, 열화상 영상에 따른 모사 결함의 온도 분포 정보를 훈련 데이 터로 하여 기 등록된 결함 정보 출력 학습 모델에 기계 학습을 진행한다. 결함 정보 출력 학습 모델은 인공 지 능 알고리즘으로서 인공 신경망 모델(artificial neural network model)를 갖는 지도 학습 알고리즘을 포함하여 구성될 수 있다. 지도 학습 알고리즘(supervised learning algorithm)은 입력하는 훈련 데이터에, 입력과 이에 대응되는 미리 알 려진 출력값을 입력하여 학습하도록 하는 것으로서, 결함 모사체의 강판 두께, 모사 결함 부위의 온도 분포 정보에 따른 모사 결함 정보를 훈련 데이터로 학습하도록 함으로써 실제 강판 콘크리트 구조물의 실제 결함 정보를 산출하도록 구성할 수 있다. 더불어, 결함 모사체의 열화상 영상 획득 시 다양한 외부 환경에 따른 촬영 환경 정보를 변화시켜 학습시킴 으로써 실제 강판 콘크리트 구조물의 외부 환경에 따른 결함 정보를 산출할 수 있다. 다음에, 실제 강판 콘크리트 구조물의 강판의 두께, 실제 강판 콘크리트 구조물의 열화상 영상으로부터 추출된 콘크리트 결함 부분의 온도 분포 정보를 포함하는 실제 측정 데이터를 입력한다(S300). 결함 모사체(1 2)의 훈련 데이터로 학습된 결함 정보 출력 학습 모델에 실제 강판 콘크리트 구조물의 강판의 두께, 실제 강판 콘크리트 구조물의 열화상 영상으로부터 추출된 콘크리트 결함 부분의 온도 분포 정보를 입력한다. 실제 강판 콘크리트 구조물의 강판의 두께는 현장에서 실측하거나 설계도로부터 획득할 수 있다. 실제 강판 콘크리트 구조물의 강판 측에서 열화상 카메라를 이용하여 열화상 영상을 획득하고 이미 지 프로세싱을 거쳐 열화상 영상으로부터 실제 강판 콘크리트 구조물의 온도 분포 정보를 획득할 수 있다. 이때, 실제 강판 콘크리트 구조물의 열화상 영상 획득 시, 결함 모사체의 촬영 환경 정보에 상응하는 실제 촬영 환경 정보를 측정하여 입력할 수 있다. 실제 강판 콘크리트 구조물의 열화상 영상을 획득하기 위해 열화상 카메라와 가시광 카메라가 탑재 된 촬영 드론을 활용할 수 있다. 실제 강판 콘크리트 구조물은 관측자 보다 훨씬 큰 고층 구조물일 수 있으므로 촬영 드론을 활용함으로써 고층의 실제 강판 콘크리트 구조물의 열화상 영상을 용이하게 획득 할 수 있다. 도 4에 도시된 바와 같이, 가시광 카메라를 이용하여 실제 강판 콘크리트 구조물의 외관을 촬영하면서 측정하고자 하는 위치와 상응한 높이에 촬영 드론을 이동시키고 열화상 카메라로 측정 부위 의 열화상 영상을 획득할 수 있다. 다음에, 기계 학습된 결함 정보 출력 학습 모델을 통해 실제 측정 데이터로부터 실제 결함 정보를 출력한다 (S400). 실제 강판 콘크리트 구조물의 실제 결함 정보는 훈련 데이터의 모사 결함 정보에 상응하여 실제 결 함의 크기, 폭, 길이, 깊이 등이 될 수 있다. 다양한 형태를 갖는 모사 결함 및 강판 두께를 갖는 결함 모사체에 대해 결함 정보 출력 학습 모델에 대한 학습을 진행함으로써 보다 정밀한 실제 강판 콘크리트 구조물의 실제 결함 정보를 얻을 수 있을 것이다. 도 5는 본 발명의 일 실시예에 따른 강판 콘크리트 구조물의 결함 측정 방법을 수행하는 결함 측정 장치의 블록 도로서, 컴퓨터를 포함한 프로세스상에서 강판 콘크리트 구조물의 결함 측정 방법이 구현될 수 있을 것이다. 도 5에는, 촬영 드론, 열화상 카메라, 온도 정보 추출부, 환경 정보 측정부, 제어부, 기계 학습부, 송수신부, 결함 정보 출력부가 도시되어 있다. 본 실시예에 따른 강판 콘크리트 구조물의 결함 측정 장치는, 콘크리트에 강판이 피복된 강판 콘크리트 구조물 (Steel plate concrete structure) 내부의 콘크리트의 결함 측정 장치로서, 일면에 모사 결함이 모사된 콘크리 트와 콘크리트의 일면을 피복하는 강판으로 구성되는 결함 모사체와 실제 강판 콘크리트 구조물의 열화상 영상 을 촬영하는 열화상 카메라와; 열화상 영상으로부터 온도 분포 정보를 추출하는 온도 정보 추출부와; 결함 모사체의 강판의 두께, 모사 결함에 대응되는 모사 결함 정보, 온도 분포 정보를 포함하는 훈련 데이터에 대해 기계 학습이 진행되는 결함 정보 출력 학습 모델을 포함하는 기계 학습부와; 실제 강판 콘크리트 구조 물의 강판의 두께, 실제 강판 콘크리트 구조물의 열화상 영상으로부터 추출된 콘크리트 결함 부분의 온도 분포정보를 포함하는 실제 측정 데이터를 입력받고 기계 학습된 결함 정보 출력 학습 모델을 통해 실제 결함 정보를 출력하는 결함 정보 출력부를 포함한다. 열화상 카메라는, 도 2 및 도 3에 도시된 바와 같이, 일면에 모사 결함이 모사된 콘크리트와 콘크 리트의 일면을 피복하는 강판으로 구성되는 결함 모사체 및 실제 강판 콘크리트 구조물의 열화 상 영상을 촬영한다. 별개의 열화상 카메라가 결함 모사체와 실제 강판 콘크리트 구조물을 각각 촬 영할 수도 있고, 하나의 열화상 카메라가 결함 모사체와 실제 강판 콘크리트 구조물의 열화상 영상 을 촬영할 수 있다. 도 4에 도시된 바와 같이, 실제 강판 콘크리트 구조물의 열화상 영상을 획득하기 위해 열화상 카메라와 가시광 카메라가 탑재된 촬영 드론을 활용할 수 있다. 실제 강판 콘크리트 구조물은 관측자 보다 훨씬 큰 고층 구조물일 수 있으므로 촬영 드론을 활용함으로써 고층의 실제 강판 콘크리트 구조물의 열 화상 영상을 용이하게 획득할 수 있다. 가시광 카메라를 이용하여 실제 강판 콘크리트 구조물의 외관을 촬영하면서 측정하고자 하는 위치와 상응한 높이에 촬영 드론을 이동시키고 열화상 카메라로 측정부위 의 열화상 영상을 획득할 수 있다. 온도 정보 추출부는, 열화상 영상으로부터 온도 분포 정보를 추출한다. 열화상 카메라로 강판 측에서 결함 모사체 촬영하여 얻는 열화상 영상으로부터 이미지 프로세싱을 거쳐 모사 결함 부위의 온도 분포 정보를 추 출한다. 결함 모사체의 강판의 두께, 모사 결함에 대응되는 모사 결함 정보는 미리 측정하여 두고, 결함 모사체의 강판 측에서 열화상 카메라로 촬영하여 결함 모사체의 표면의 열화상 영상을 얻고 이로부터 모사 결함 부위의 온 도 분포 정보를 추출한다. 또한, 온도 정보 추출부는, 실제 강판 콘크리트 구조물의 표면을 강판 측에서 촬영하여 얻은 열화상 영상으 로부터 이미지 프로세싱을 거쳐 콘크리트 결함 부위의 온도 분포 정보를 추출할 수 있다. 기계 학습부는, 결함 모사체의 강판의 두께, 모사 결함에 대응되는 모사 결함 정보, 결함 모사체의 열화상 영상으로부터 추출된 온도 분포 정보를 포함하는 훈련 데이터에 대해 기계 학습이 진행되는 결함 정보 출력 학 습 모델을 포함한다. 결함 모사체의 강판 두께, 모사 결함의 크기, 폭, 길이, 깊이 등의 모사 결함 정보, 모사 결함의 온도 분포 정 보는 결함 정보 출력 학습 모델의 훈련 데이터로 활용된다. 보다 정확한 결함 정보의 출력을 위해서는 다양한 형태의 모사 결함과, 서로 다른 강판의 두께를 갖는 결함 모사체에 대해 훈련 데이터를 확보한다. 한편, 훈련 데이터로서 결함 모사체의 촬영 환경 정보가 포함될 수 있다. 실제 강판 콘크리트 구조물의 결함 정 보를 얻기 위한 열화상 촬영 시 외부 환경에 따른 영향을 고려해야 하기 때문에, 결함 모사체의 열화상 촬영 시 주변 온도, 풍속, 습도, 조도 등을 측정하여 이를 촬영 환경 정보로서 사용한다. 촬영 환경 정보를 획득하기 위해 본 실시예에 따른 강판 콘크리트 구조물의 결함 측정 장치는, 환경 정보 측정 부를 포함할 수 있다. 환경 정보 측정부에는 주변 온도를 측정하는 온도계, 풍속계, 습도계, 조도계 등 을 포함하여 열화상 촬영 시 주변 온도, 풍속, 습도, 조도 등을 측정하여 촬영 환경 정보를 얻을 수 있다. 또한, 훈련 데이터는, 결함 모사체의 열화상 영상으로부터 추출된 모사 결함의 형상 정보를 포함할 수 있다. 모 사 결함의 형상 정보는 열화상 영상으로부터 이미지 프로세싱을 거쳐 생성될 수 있다. 이에 대응되어 실제 측정 데이터 또한 실제 강판 콘크리트 구조물의 열화상 영상으로부터 추출된 실제 결함의 형상 정보를 포함하게 된다. 모사 결함의 형상 정보는 결함 정보 출력 학습 모델의 훈련 데이터로 함께 학습될 수 있다. 결함 정보 출력 학습 모델은 인공 지능 알고리즘으로서 인공 신경망 모델(artificial neural network model)를 갖는 지도 학습 알고리즘을 포함하여 구성될 수 있다. 상술한 훈련 데이터로 하여 기 등록된 결함 정보 출력 학 습 모델에 기계 학습을 진행한다. 결함 정보 출력부는, 실제 강판 콘크리트 구조물의 강판의 두께, 실제 강판 콘크리트 구조물의 열화상 영상 으로부터 추출된 콘크리트 결함 부분의 온도 분포 정보를 포함하는 실제 측정 데이터를 입력받고 기계 학습된 결함 정보 출력 학습 모델을 통해 실제 결함 정보를 출력한다. 실제 강판 콘크리트 구조물의 실제 결함 정 보는 훈련 데이터의 모사 결함 정보에 상응하여 실제 결함의 크기, 폭, 길이, 깊이 등이 될 수 있다. 제어부는, 열화상 영상이 입력되면 온도 정보 추출부를 통해 이미지 프로세싱을 거쳐 온도 분포 정보를 추출하도록 제어하고, 이러한 온도 분포 정보를 포함하는 훈련 데이터가 입력되면 이를 기계 학습부에서 기 계 학습되도록 기계 학습부를 제어한다. 또한, 제어부는, 실제 강판 콘크리트 구조물의 온도 정보 추출부를 통한 열화상 영상의 온도 분포 정보의 추출을 제어하며, 입력된 온도 분포 정보를 포함하는 실제 측정 데이터가 입력되면 학습된 결함 정보 출력 학습 모델을 통해 실제 결함 정보를 출력하도록 제어한다. 송수신부는 무선 통신망을 통해 촬영 드론과 연결되며, 제어부가 송수신부를 통해 무선으로 촬영 드론을 제어하도록 하거나, 열화상 카메라와 가시광 카메라에 무선으로 연결되어 제어부가 실제 강판 콘크리트 구조물의 열화상 영상을 촬영하도록 제어하도록 할 수 있다. 이상에서는 본 발명의 실시예를 참조하여 설명하였지만, 해당 기술 분야에서 통상의 지식을 가진 자라면 하기의 특허 청구의 범위에 기재된 본 발명의 사상 및 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수 정 및 변경시킬 수 있음을 쉽게 이해할 수 있을 것이다."}
{"patent_id": "10-2021-0114915", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 강판 콘크리트 구조물의 결함 측정 방법의 순서도. 도 2는 본 발명의 일 실시예에 따른 강판 콘크리트 구조물의 결함 측정 방법의 결함 모사체의 분해 사시도. 도 3은 본 발명의 일 실시예에 따른 강판 콘크리트 구조물의 결함 측정 방법의 결함 모사체의 단면도. 도 4는 본 발명의 일 실시예에 따른 강판 콘크리트 구조물의 결함 측정 방법에 따른 열화상 촬영 상황을 도시한 도면. 도 5는 본 발명의 일 실시예에 따른 강판 콘크리트 구조물의 결함 측정 방법을 수행하는 결함 측정 장치의 블록 도."}
