{"patent_id": "10-2023-0084795", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0002960", "출원번호": "10-2023-0084795", "발명의 명칭": "무선 통신 시스템에서 참조 신호 변환을 통한 송신 빔 탐색 방법", "출원인": "삼성전자주식회사", "발명자": "박경민"}}
{"patent_id": "10-2023-0084795", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "무선 통신 시스템에서 단말의 동작 방법에 있어서,기지국으로부터 상기 단말의 빔 탐색과 관련된 능력 정보에 기반한 빔 설정 정보를 수신하는 단계;상기 빔 설정 정보에 기반하여 빔 관리를 위한 참조 신호(reference signal)를 상기 기지국으로부터 수신하는단계;상기 참조 신호의 탐색을 통해 획득한 정보를 상기 기지국으로 송신하는 단계; 및상기 정보에 기반하여 갱신된 빔 설정 정보를 상기 기지국으로부터 수신하는 단계를 포함하며, 상기 정보는 상기 참조 신호가 전송된 빔 측정 정보 또는 상기 참조 신호의 적응(adaptation) 정보 중 적어도하나를 포함하는 방법."}
{"patent_id": "10-2023-0084795", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 보다 높은 데이터 전송률을 지원하기 위한 5G 또는 6G 통신 시스템에 관련된 것이다. 무선 통신 시스 템에서 단말의 동작 방법에 있어서, 기지국으로부터 상기 단말의 빔 탐색과 관련된 능력 정보에 기반한 빔 설정 정보를 수신하는 단계, 상기 빔 설정 정보에 기반하여 빔 관리를 위한 참조 신호를 상기 기지국으로부터 수신하 는 단계, 상기 참조 신호의 탐색을 통해 획득한 정보를 상기 기지국으로 송신하는 단계, 및 상기 정보에 기반하 여 갱신된 빔 설정 정보를 상기 기지국으로부터 수신하는 단계를 포함한다."}
{"patent_id": "10-2023-0084795", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 무선 통신 시스템 또는 이동 통신 시스템에 대한 것이다. 구체적으로, 본 개시는 참조 신호의 변환을 통해 송신 빔을 탐색하고, 측정하기 위한 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2023-0084795", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "5G 이동통신 기술은 빠른 전송 속도와 새로운 서비스가 가능하도록 넓은 주파수 대역을 정의하고 있으며, 3.5 기가헤르츠(3.5GHz) 등 6GHz 이하 주파수('Sub 6GHz') 대역은 물론 28GHz와 39GHz 등 밀리미터파(㎜Wave)로 불 리는 초고주파 대역('Above 6GHz')에서도 구현이 가능하다. 또한, 5G 통신 이후(Beyond 5G)의 시스템이라 불리 어지는 6G 이동통신 기술의 경우, 5G 이동통신 기술 대비 50배 빨라진 전송 속도와 10분의 1로 줄어든 초저 (Ultra Low) 지연시간을 달성하기 위해 테라헤르츠(Terahertz) 대역(예를 들어, 95GHz에서 3 테라헤르츠(3THz) 대역과 같은)에서의 구현이 고려되고 있다. 5G 이동통신 기술의 초기에는, 초광대역 서비스(enhanced Mobile BroadBand, eMBB), 고신뢰/초저지연 통신 (Ultra-Reliable Low-Latency Communications, URLLC), 대규모 기계식 통신 (massive Machine-Type Communications, mMTC)에 대한 서비스 지원과 성능 요구사항 만족을 목표로, 초고주파 대역에서의 전파의 경로 손실 완화 및 전파의 전달 거리를 증가시키기 위한 빔포밍(Beamforming) 및 거대 배열 다중 입출력(Massive MIMO), 초고주파수 자원의 효율적 활용을 위한 다양한 뉴머롤로지 지원(복수 개의 서브캐리어 간격 운용 등)와 슬롯 포맷에 대한 동적 운영, 다중 빔 전송 및 광대역을 지원하기 위한 초기 접속 기술, BWP(Band-Width Part) 의 정의 및 운영, 대용량 데이터 전송을 위한 LDPC(Low Density Parity Check) 부호와 제어 정보의 신뢰성 높은 전송을 위한 폴라 코드(Polar Code)와 같은 새로운 채널 코딩 방법, L2 선-처리(L2 pre-processing), 특정 서 비스에 특화된 전용 네트워크를 제공하는 네트워크 슬라이싱(Network Slicing) 등에 대한 표준화가 진행되었다. 현재, 5G 이동통신 기술이 지원하고자 했던 서비스들을 고려하여 초기의 5G 이동통신 기술 개선(improvement) 및 성능 향상(enhancement)을 위한 논의가 진행 중에 있으며, 차량이 전송하는 자신의 위치 및 상태 정보에 기 반하여 자율주행 차량의 주행 판단을 돕고 사용자의 편의를 증대하기 위한 V2X(Vehicle-to-Everything), 비면허 대역에서 각종 규제 상 요구사항들에 부합하는 시스템 동작을 목적으로 하는 NR-U(New Radio Unlicensed), NR 단말 저전력 소모 기술(UE Power Saving), 지상 망과의 통신이 불가능한 지역에서 커버리지 확보를 위한 단말- 위성 직접 통신인 비 지상 네트워크(Non-Terrestrial Network, NTN), 위치 측위(Positioning) 등의 기술에 대 한 물리계층 표준화가 진행 중이다. 뿐만 아니라, 타 산업과의 연계 및 융합을 통한 새로운 서비스 지원을 위한 지능형 공장 (Industrial Internet of Things, IIoT), 무선 백홀 링크와 액세스 링크를 통합 지원하여 네트워크 서비스 지역 확장을 위한 노드를 제공하는 IAB(Integrated Access and Backhaul), 조건부 핸드오버(Conditional Handover) 및 DAPS(Dual ActiveProtocol Stack) 핸드오버를 포함하는 이동성 향상 기술(Mobility Enhancement), 랜덤액세스 절차를 간소화하 는 2 단계 랜덤액세스(2-step RACH for NR) 등의 기술에 대한 무선 인터페이스 아키텍쳐/프로토콜 분야의 표준 화 역시 진행 중에 있으며, 네트워크 기능 가상화(Network Functions Virtualization, NFV) 및 소프트웨어 정 의 네트워킹(Software-Defined Networking, SDN) 기술의 접목을 위한 5G 베이스라인 아키텍쳐(예를 들어, Service based Architecture, Service based Interface), 단말의 위치에 기반하여 서비스를 제공받는 모바일 엣지 컴퓨팅(Mobile Edge Computing, MEC) 등에 대한 시스템 아키텍쳐/서비스 분야의 표준화도 진행 중이다. 이와 같은 5G 이동통신 시스템이 상용화되면, 폭발적인 증가 추세에 있는 커넥티드 기기들이 통신 네트워크에 연결될 것이며, 이에 따라 5G 이동통신 시스템의 기능 및 성능 강화와 커넥티드 기기들의 통합 운용이 필요할 것으로 예상된다. 이를 위해, 증강현실(Augmented Reality, AR), 가상현실(Virtual Reality, VR), 혼합 현실 (Mixed Reality, MR) 등을 효율적으로 지원하기 위한 확장 현실(eXtended Reality, XR), 인공지능(Artificial Intelligence, AI) 및 머신러닝(Machine Learning, ML)을 활용한 5G 성능 개선 및 복잡도 감소, AI 서비스 지 원, 메타버스 서비스 지원, 드론 통신 등에 대한 새로운 연구가 진행될 예정이다. 또한, 이러한 5G 이동통신 시스템의 발전은 6G 이동통신 기술의 테라헤르츠 대역에서의 커버리지 보장을 위한 신규 파형(Waveform), 전차원 다중입출력(Full Dimensional MIMO, FD-MIMO), 어레이 안테나(Array Antenna), 대규모 안테나(Large Scale Antenna)와 같은 다중 안테나 전송 기술, 테라헤르츠 대역 신호의 커버리지를 개선 하기 위해 메타물질(Metamaterial) 기반 렌즈 및 안테나, OAM(Orbital Angular Momentum)을 이용한 고차원 공 간 다중화 기술, RIS(Reconfigurable Intelligent Surface) 기술 뿐만 아니라, 6G 이동통신 기술의 주파수 효 율 향상 및 시스템 네트워크 개선을 위한 전이중화(Full Duplex) 기술, 위성(Satellite), AI(Artificial Intelligence)를 설계 단계에서부터 활용하고 종단간(End-to-End) AI 지원 기능을 내재화하여 시스템 최적화를 실현하는 AI 기반 통신 기술, 단말 연산 능력의 한계를 넘어서는 복잡도의 서비스를 초고성능 통신과 컴퓨팅 자 원을 활용하여 실현하는 차세대 분산 컴퓨팅 기술 등의 개발에 기반이 될 수 있을 것이다. 상술한 것과 이동통신 시스템의 발전에 따라 다양한 서비스를 제공할 수 있게 됨으로써, 이러한 서비스들을 효 과적으로 제공하기 위한 방안이 요구되고 있다."}
{"patent_id": "10-2023-0084795", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 무선 통신 시스템 또는 이동 통신 시스템에서 참조 신호의 변환을 통해 송신 빔을 탐색하고, 측정하 기 위한 방법을 제공하고자 한다. 특히, 본 개시는 빔 측정의 시간 지연을 감소시키는 참조 신호 전송 방법 및 수신단의 전송 빔 측정 방법을 제시할 수 있다. 또한, 본 개시는 상기 동작을 지원하기 위해 필요한 기지국과 단말 간 정보 공유 및 자원 제어 방법을 제시할 수 있다. 본 개시에서 이루고자 하는 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급하지 않은"}
{"patent_id": "10-2023-0084795", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "또 다른 기술적 과제들은 아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하 게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0084795", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 문제점을 해결하기 위한 본 개시는 무선 통신 시스템에서 단말의 동작 방법에 있어서, 기지국으로 부터 상기 단말의 빔 탐색과 관련된 능력 정보에 기반한 빔 설정 정보를 수신하는 단계, 상기 빔 설정 정보에 기반하여 빔 관리를 위한 참조 신호를 상기 기지국으로부터 수신하는 단계, 상기 참조 신호의 탐색을 통해 획득 한 정보를 상기 기지국으로 송신하는 단계, 및 상기 정보에 기반하여 갱신된 빔 설정 정보를 상기 기지국으로부 터 수신하는 단계를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2023-0084795", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 일 실시 예에 따르면, 빔 측정에 소모되는 무선 자원의 양을 줄일 수 있고, 빔 측정에 따른 시간 지 연을 감소시킬 수 있다. 본 개시의 일 실시 예에 따르면, 전송단이 제공 가능한 후보 빔 대비 적은 수의 참조신 호 자원 또는 적은 회수의 참조 신호 전송을 통해 전송단이 빔 선정 작업을 수행함으로써, 전송단의 참조신호 전송 부담을 줄일 수 있다.본 개시에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효과들은 아래의 기재로부터 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0084795", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 첨부된 도면을 참조하여 본 개시의 동작 원리를 상세히 설명한다. 하기에서 본 개시를 설명하기에 있어 관 련된 공지 기능 또는 구성에 대한 구체적인 설명이 본 개시의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우 에는 그 상세한 설명을 생략할 것이다. 그리고 후술되는 용어들은 본 개시에서의 기능을 고려하여 정의된 용어 들로서 이는 사용자, 운용자의 의도 또는 관례 등에 따라 달라질 수 있다. 그러므로 그 정의는 본 명세서 전반 에 걸친 내용을 토대로 내려져야 할 것이다. 하기에서 본 개시를 설명함에 있어 관련된 공지 기능 또는 구성에 대한 구체적인 설명이 본 개시의 요지를 불필 요하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명을 생략할 것이다. 이하 첨부된 도면을 참조하여 본 개시의 실시 예를 설명하기로 한다. 이하 설명에서 사용되는 접속 노드(node)를 식별하기 위한 용어, 망 객체(network entity)들을 지칭하는 용어, 메시지들을 지칭하는 용어, 망 객체들 간 인터페이스를 지칭하는 용어, 다양한 식별 정보들을 지칭하는 용어 등 은 설명의 편의를 위해 예시된 것이다. 따라서, 본 개시가 후술되는 용어들에 한정되는 것은 아니며, 동등한 기 술적 의미를 가지는 대상을 지칭하는 다른 용어가 사용될 수 있다. 이하, 기지국은 단말의 자원할당을 수행하는 주체로서, gNode B, eNode B, Node B, BS (Base Station), 무선 접속 유닛, 기지국 제어기, 또는 네트워크 상의 노드 중 적어도 하나일 수 있다. 단말은 UE (User Equipment), MS (Mobile Station), 셀룰러폰, 스마트폰, 컴퓨터, 또는 통신 기능을 수행할 수 있는 멀티미디어 시스템을 포 함할 수 있다. 본 개시에서 하향링크(Downlink; DL)는 기지국이 단말에게 전송하는 신호의 무선 전송 경로이고, 상향링크는(Uplink; UL)는 단말이 기국에게 전송하는 신호의 무선 전송경로를 의미한다. 또한, 이하에서 LTE 혹 은 LTE-A 시스템을 일 예로서 설명할 수도 있지만, 유사한 기술적 배경 또는 채널 형태를 갖는 다른 통신시스템 에도 본 개시의 실시예가 적용될 수 있다. 예를 들어 LTE-A 이후에 개발되는 5세대 이동통신 기술(5G, new radio, NR)이 본 개시의 실시예가 적용될 수 있는 시스템에 포함될 수 있으며, 이하의 5G는 기존의 LTE, LTE-A 및 유사한 다른 서비스를 포함하는 개념일 수도 있다. 또한, 본 개시는 숙련된 기술적 지식을 가진 자의 판단으 로써 본 개시의 범위를 크게 벗어나지 아니하는 범위에서 일부 변형을 통해 다른 통신시스템에도 적용될 수 있 다. 이 때, 처리 흐름도 도면들의 각 블록과 흐름도 도면들의 조합들은 컴퓨터 프로그램 인스트럭션들에 의해 수행될 수 있음을 이해할 수 있을 것이다. 이들 컴퓨터 프로그램 인스트럭션들은 범용 컴퓨터, 특수용 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비의 프로세서에 탑재될 수 있으므로, 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비의 프로세서를 통해 수행되는 그 인스트럭션들이 흐름도 블록(들)에서 설명된 기능들을 수행하는 수단을 생성하게 된다. 이들컴퓨터 프로그램 인스트럭션들은 특정 방식으로 기능을 구현하기 위해 컴퓨터 또는 기타 프로그램 가능한 데이 터 프로세싱 장비를 지향할 수 있는 컴퓨터 이용 가능 또는 컴퓨터 판독 가능 메모리에 저장되는 것도 가능하므 로, 그 컴퓨터 이용가능 또는 컴퓨터 판독 가능 메모리에 저장된 인스트럭션들은 흐름도 블록(들)에서 설명된 기능을 수행하는 인스트럭션 수단을 내포하는 제조 품목을 생산하는 것도 가능하다. 컴퓨터 프로그램 인스트럭 션들은 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에 탑재되는 것도 가능하므로, 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에서 일련의 동작 단계들이 수행되어 컴퓨터로 실행되는 프로세 스를 생성해서 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 수행하는 인스트럭션들은 흐름도 블 록(들)에서 설명된 기능들을 실행하기 위한 단계들을 제공하는 것도 가능하다. 또한, 각 블록은 특정된 논리적 기능(들)을 실행하기 위한 하나 이상의 실행 가능한 인스트럭션들을 포함하는 모듈, 세그먼트 또는 코드의 일부를 나타낼 수 있다. 또, 몇 가지 대체 실행 예들에서는 블록들에서 언급된 기 능들이 순서를 벗어나서 발생하는 것도 가능함을 주목해야 한다. 예를 들면, 잇달아 도시되어 있는 두 개의 블 록들은 사실 실질적으로 동시에 수행되는 것도 가능하고 또는 그 블록들이 때때로 해당하는 기능에 따라 역순으 로 수행되는 것도 가능하다. 이 때, 본 실시 예에서 사용되는 '~부'라는 용어는 소프트웨어 또는 FPGA(Field Programmable Gate Array) 또는 ASIC(Application Specific Integrated Circuit)과 같은 하드웨어 구성요소를 의미하며, '~부'는 어떤 역할들을 수행할 수 있다. 그렇지만 '~부'는 소프트웨어 또는 하드웨어에 한정되는 의 미는 아니다. '~부'는 어드레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서 들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 '~부'는 소프트웨어 구성요소들, 객체지향 소프트웨 어 구성요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로코드, 회로, 데이터, 데이 터베이스, 데이터 구조들, 테이블들, 어레이들, 및 변수들을 포함한다. 구성요소들과 '~부'들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 '~부'들로 결합되거나 추가적인 구성요소들과 '~부'들로 더 분리될 수 있다. 뿐만 아니라, 구성요소들 및 '~부'들은 디바이스 또는 보안 멀티미디어카드 내의 하나 또는 그 이상의 CPU들을 재생시키도록 구현될 수도 있다. 또한 실시예에서 '~부'는 하나 이상의 프로세서를 포함할 수 있다. 이하 설명의 편의를 위하여, 본 발명은 개시는 현재 존재하는 통신표준 가운데 3GPP (The 3rd Generation Partnership Project) 단체에서 정의하는 표준인 5GS 및 NR 규격에서 정의하고 있는 용어 및 명칭들을 사용한다. 하지만, 본 개시가 상기 용어 및 명칭들에 의해 한정되는 것은 아니며, 다른 규격에 따르는 무선 통 신망에도 동일하게 적용될 수 있다. 예를 들면, 본 개시는 3GPP 5GS/NR (5세대 이동통신 표준)에 적용할 수 있 다. 4G(4th generation) 통신 시스템 상용화 이후 증가 추세에 있는 무선 데이터 트래픽 수요를 충족시키기 위해, 개선된 5G(5th generation) 통신 시스템 또는 pre-5G 통신 시스템을 개발하기 위한 노력이 이루어지고 있다. 이 러한 이유로, 5G 통신 시스템 또는 pre-5G 통신 시스템은 4G 네트워크 이후 (Beyond 4G Network) 통신 시스템 또는 LTE(Long Term Evolution) 시스템 이후 (Post LTE) 이후의 시스템이라 불리어지고 있다. 높은 데이터 전송률을 달성하기 위해, 5G 통신 시스템은 초고주파 (mmWave) 대역 (예를 들어, 60기가 (60GHz) 대역과 같은)에서의 구현이 고려되고 있다. 초고주파 대역에서의 전파의 경로손실 완화 및 전파의 전달 거리를 증가시키기 위해, 5G 통신 시스템에서는 빔포밍 (beamforming), 거대 배열 다중 입출력 (massive MIMO), 전차원 다중입출력 (full dimensional MIMO, FD-MIMO), 어레이 안테나 (array antenna), 아날로그 빔형성 (analog beam-forming), 및 대규모 안테나 (large scale antenna) 기술들이 논의되고 있다. 또한 시스템의 네트워크 개선을 위해, 5G 통신 시스템에서는 진화된 소형 셀, 개선된 소형 셀 (advanced small cell), 클라우드 무선 액세스 네트워크 (cloud radio access network: cloud RAN), 초고밀도 네트워크 (ultra- dense network), 기기 간 통신 (Device to Device communication: D2D), 무선 백홀 (wireless backhaul), 이동 네트워크 (moving network), 협력 통신 (cooperative communication), CoMP (Coordinated Multi-Points), 및 수신 간섭제거 (interference cancellation) 등의 기술 개발이 이루어지고 있다. 이 밖에도, 5G 시스템에서는 진보된 코딩 변조(Advanced Coding Modulation: ACM) 방식인 FQAM (Hybrid FSK and QAM Modulation) 및 SWSC (Sliding Window Superposition Coding)과, 진보된 접속 기술인 FBMC (Filter Bank Multi Carrier), NOMA (non-orthogonal multiple access), 및 SCMA (sparse code multiple access) 등이 개발되고 있다. 5G 시스템에서는 기존 4G 시스템 대비 다양한 서비스에 대한 지원을 고려하고 있다. 예를 들어, 가장 대표적인 서비스들은 모바일 초광대역 통신 서비스(eMBB: enhanced mobile broad band), 초 고신뢰성/저지연 통신 서비스(URLLC: ultra-reliable and low latency communication), 대규모 기기간 통신 서비스(mMTC: massive machine type communication), 차세대 방송 서비스(eMBMS: evolved multimedia broadcast/multicast Service) 등이 있 을 수 있다. 그리고, 상기 URLLC 서비스를 제공하는 시스템을 URLLC 시스템, eMBB 서비스를 제공하는 시스템을 eMBB 시스템 등이라 칭할 수 있다. 또한, 서비스와 시스템이라는 용어는 혼용되어 사용될 수 있다. 이 중 URLLC 서비스는 기존 4G 시스템과 달리 5G 시스템에서 새롭게 고려하고 있는 서비스이며, 다른 서비스들 대비 초 고 신뢰성(예를 들면, 패킷 에러율 약 10-5)과 저 지연(latency)(예를 들면, 약 0.5msec) 조건 만족을 요구한다. 이러한 엄격한 요구 조건을 만족시키기 위하여 URLLC 서비스는 eMBB 서비스보다 짧은 전송 시간 간격 (TTI: transmission time interval)의 적용이 필요할 수 있고 이를 활용한 다양한 운용 방식들이 고려되고 있다. 한편, 인터넷은 인간이 정보를 생성하고 소비하는 인간 중심의 연결 망에서, 사물 등 분산된 구성 요소들 간에 정보를 주고받아 처리하는 IoT (Internet of Things, 사물인터넷) 망으로 진화하고 있다. 클라우드 서버 등과의 연결을 통한 빅데이터 (Big data) 처리 기술 등이 IoT 기술에 결합된 IoE (Internet of Everything) 기술도 대 두되고 있다. IoT를 구현하기 위해서, 센싱 기술, 유무선 통신 및 네트워크 인프라, 서비스 인터페이스 기술, 및 보안 기술과 같은 기술 요소 들이 요구되어, 최근에는 사물간의 연결을 위한 센서 네트워크 (sensor network), 사물 통신 (Machine to Machine, M2M), MTC (Machine Type Communication) 등의 기술이 연구되고 있 다. IoT 환경에서는 연결된 사물들에서 생성된 데이터를 수집, 분석하여 인간의 삶에 새로운 가치를 창출하는 지능 형 IT (Internet Technology) 서비스가 제공될 수 있다. IoT는 기존의 IT (information technology) 기술과 다 양한 산업 간의 융합 및 복합을 통하여 스마트홈, 스마트 빌딩, 스마트 시티, 스마트 카 혹은 커넥티드 카, 스 마트 그리드, 헬스 케어, 스마트 가전, 첨단의료서비스 등의 분야에 응용될 수 있다. 이에, 5G 통신 시스템을 IoT 망에 적용하기 위한 다양한 시도들이 이루어지고 있다. 예를 들어, 센서 네트워크 (sensor network), 사물 통신 (Machine to Machine, M2M), MTC (Machine Type Communication) 등의 기술이 5G 통신 기술이 빔 포밍, MIMO, 및 어레이 안테나 등의 기법에 의해 구현되고 있는 것이다. 앞서 설명한 빅데이터 처리 기술로써 클라우드 무선 액세스 네트워크 (cloud RAN)가 적용되는 것도 5G 기술과 IoT 기술 융합의 일 예 라고 할 수 있을 것이다. 한편, 5G 이동통신 네트워크는 5G UE(user equipment, 단말(terminal)), 5G RAN(radio access network, 기지국, base station, gNB(5g nodeB), eNB(evolved nodeB 등), 그리고 5G 코어망으로 구성된다. 5G 코어망은 UE의 이동성 관리 기능을 제공하는 AMF(access and mobility management function), 세션 관리 기능을 제공하 는 SMF(session management function), 데이터 전달 역할을 수행하는 UPF(user plane function), 정책 제어 기 능을 제공하는 PCF(policy control function), 가입자 데이터 및 정책 제어 데이터 등 데이터 관리 기능을 제공 하는 UDM(unified data management), UDM 등 다양한 네트워크 기능(network function)들의 데이터를 저장하는 UDR(unified data repository) 등의 네트워크 기능(network function)들로 구성된다. mmWave 통신의 핵심 기술인 빔 제어 기법을 수행함에 있어, 기지국이 후보 빔들을 미리 선정하고, 단말이 상기 후보 빔들에 대한 측정 결과를 보고하면, 기지국이 상기 보고를 기반으로 후보 빔 중 하나를 하향, 상향, 또는 양방향 전송에 사용할 수 있다. 본 개시는 보다 다양한 빔들을 대상으로 빔 선택을 수행할 수 있는 단말 주관 (UE oriented) 빔 제어 기법을 수행하기 위한 전체 절차(process)를 제시한다. 특히 본 개시는, 기지국이 단말 성능 요구사항을 선정하고 선정된 단말 성능 요구사항에 기반하여 각 단말에게 단말 주관(UE oriented) 빔 제어 기법의 사용을 허가하는 단계를 제시한다. 또한, 본 개시는 단말이 빔을 선정 하고 기지국에 요청 시 기지국이 단말의 요청을 어떻게 반영하는지에 대한 방법 및 절차를 제시한다. 빔 측정 및 설정 기법은 통신을 수행하는 각 노드 또는 단말이 미리 설정된 아날로그 빔 중 하나를 선택하여 통 신을 수행하는 것으로 가정할 수 있다. 특히, FR2 영역에서 통신을 수행하는 단말 또는 노드의 경우, sub-array 의 조합을 통해 전체 antenna array을 구현할 수 있으며, 각 sub-array을 구현하는 antenna element 간에는 digital beamforming 기능의 지원 없이 carrier phase shift을 통한 analogue beamforming을 수행하는 방법으 로 beamforming을 구현할 수 있다. Digital beamforming 또는 digital precoding은 각 sub-array 간 signaling processing을 수행하는 방식으로 구현될 수 있으며, 상기의 구조를 차용함으로 인해 array을 구성하는 antenna element 개수 대비 적은 수의 antenna port만을 지원할 수 있다. 또한, 미리 설정된 한정된 개수의 analoguebeam 중 하나를 선택하는 방식으로 각 sub-array의 빔이 결정됨으로, 전체 array을 통해 지원 가능한 beamforming resolution이 줄어들 수 있다. 또한, 감소한 resolution 지원이 가능한 최대 beamforming gain 또 한 감소될 수 있다. 도 1은 본 개시의 실시 예와 관련한 sub-array을 사용한 안테나 구조를 도시한다. 도 1을 참조하면, sub-array 기반의 analogue beamforming과 digital beamforming 혼합한 안테나 구조가 설명 될 수 있다. 상술한 기존의 analogue beam의 적용이 필수적인 통신 시스템에서 적절한 analogue beam의 선정을 수행하기 위하여, 전송단은 미리 설정된 각 analogue beam에 대하여 수신단의 해당 빔 측정을 위한 참조 신호를 설정할 수 있다. 그리고 전송단은 설정한 참조 신호를 수신단에 전송할 수 있다. 즉, 미리 설정된 analogue beam의 개수와 동일한 숫자 또는 더 많은 수의 빔 측정용 참조 신호가 설정 및/또는 전송될 수 있다. 전송단이 참조 신호를 설정 및/또는 전송함에 있어, 전송단의 다른 빔에 해당하는 참조 신호의 동시 전송을 수행하지 않 는 것을 기본 동작으로 할 수 있다. 또한, 전송단의 기본 동작에 따라 수신단은 매회 빔 측정용 참조 신호를 수 신함에 있어 하나의 후보 analogue 빔에 대한 측정을 수행함을 특징으로 할 수 있다. 도 1을 다시 참조하면, sub-array를 사용하여 analogue beamforming 및 digital beamforming을 모두 사용하는 안테나의 구조가 설명될 수 있다. 구체적으로, 전체 antenna array를 구성하는 sub-array들 각각은 analogue beamforming 또는 digital beamforming을 통해 구현될 수 있다. 예를 들어, analogue beamforming의 경우, sub-array를 구현하는 antenna element들은 carrier phase shift를 통한 analogue beamforming을 수행할 수 있 다. 또는, digital beamforming의 경우, sub-array 간 signaling processing을 수행하는 방식으로 digital beamforming이 수행될 수 있다. 도 1의 안테나는 analogue beamforming 및 digital beamforming 방식에 의해 구성된 antenna array들의 조합에 의해 구성될 수 있다. 도 2는 본 개시의 실시 예와 관련한 지원 가능한 analogue 빔을 설정하는 방법을 도시한다. 도 2를 참조하면, 각 후보 빔을 설정함에 있어, 안테나를 통해 지원할 수 있는 최대 beamforming gain 대비 3dB 이하의 열화를 보이는 beam을 생성하기 위하여, 3dB beam width을 beam 설정 resolution으로 하는 analogue beam 설정에 대한 예시가 설명될 수 있다. antenna array가 많아 짐에 따라 3dB beamwidth가 급격히 좁아질 수 있으며, 필요한 후보 빔의 개수 또한 급격히 증가할 수 있다. 도 3은 본 개시의 실시 예와 관련한 다단계 beam sweeping 기법을 도시한다. 도 3을 참조하면, 참조 신호들은 동일한 구조를 가지는 무선 자원들 상에서 각기 다른 전송 빔을 통해 복수의 RS들이 반복 전송되는 방식으로 전송될 수 있다. 이러한 방식은 전송 빔 스위핑(sweeping), 또는 Tx beam sweeping 절차로 정의될 수 있다. 예를 들어, Tx (analogue) beam sweeping을 통해 빔 측정 및 선정을 수행하 는 기법은 수신단의 단말이 각 빔에 상응하는 참조 신호들의 수신 전력 또는 수신 성능(예를 들어, RSRP(reference signal received power) 또는 SINR(signal-to-interference-plus-noise ratio))을 비교하는 동작을 통해 최적의 빔을 선택할 수 있으므로 통신 시스템에 폭넓게 사용되고 있다. 또한, Tx (analogue) beam sweeping 없이 각 antenna element 별로 참조 신호를 전송하는 경우, 참조 신호의 수신 전력이 너무 낮아 수신 단이 빔 정보 또는 채널 정보를 추정할 수 없다는 문제가 있다. 따라서, 빔 참조 신호의 경우 analogue beamforming을 통해 전송하게 되는 것이 일반적인 상황이다. 즉, 상술된 한정된 analogue 빔을 사용하는 기법은 수신단 동작의 단순화와 동시에 수신단의 빔 측정 정확도 증가를 가져온다는 이점이 있다. 그러나 위에서 설명 하였듯 한정된 수의 analogue beam만을 사용하도록 지원하거나 analogue beam의 resolution을 증가시킴에 따라 beam 측정에 소요되는 RS(reference signal) overhead 및 measurement overhead가 크게 증가할 수 있다. 예를 들어, 현실적으로 지원 가능한 빔 제어 정확도 또는 높은 정밀도(resolution)에 한계가 있을 수 있다. 상술된 한계를 해결하는 방안으로, 다단계 빔 측정 또는 beam sweeping 기법이 제시되었다. 그러나 다단계 동작을 수행 하는 것은 부가적인 latency을 야기할 수 있다. 또한, 최종 단계에서 전송단이 제공 가능한 beam sweeping의 폭 (예를 들어, angular coverage)이 매우 좁아 beam failure가 빈번히 발생하게 되는 문제가 있을 수 있다. 특히, 단말이 이동 중이거나 야외에서의 통신 등 주변 통신 환경에 변화가 있는 상황에서는 beam failure 빈도 가 증가할 수 있다. beam failure 발생 시, 전송단과 수신단은 410 단계(예를 들어, 아래 도 4의 410 단계)부터 다단계 beam sweeping을 다시 수행하게 됨으로 latency 및 overhead 감소를 위해 사용하는 다단계 beamsweeping의 이점이 크게 감소할 수 있다. 본 개시는 상술된 기존 beamforming 방식들의 단점을 극복하여 보다 적은 회수의 참조 신호 전송으로 높은 resolution의 빔 측정 또는 빔 제어를 지원하는 참조신호 전송 및 전송 빔 측정 기법을 제시한다. 본 개시를 통 해 수신단이 측정 또는 선택할 수 있는 전송단의 후보 빔의 개수는 전송단이 수신단에 빔 정보 측정을 위한 참 조 신호 전송에 사용한 시간 축 무선 자원의 수 보다 많을 수 있다. 예를 들어, 전송단이 시간 축에서 독립된 세 개의 무선 자원을 통해 참조 신호를 전송할 수 있고, 전송된 참조 신호를 통해 수신단이 추정 또는 성능을 예측할 수 있는 후보 빔의 개수는 3개 보다 많을 수 있다. 또한, 본 개시가 제시하는 기법은 digital beamforming에 준하는 resolution의 analogue beam 측정 및 선정을 지원할 수 있다. 예를 들어, 본 개시가 제 시하는 기법은 적어도 빔 측정의 resolution에서 digital beamforming과 동일한 수준의 beam resolution 확보 가 가능할 수 있다. 또는, 본 개시가 제시하는 기법을 적용 시, sub-array 및 analogue beam을 사용하지 않고 수신단이 전송단의 빔 정보를 측정하는 것이 가능 해짐으로써 full digital beamforming의 구현이 가능할 수 있 다. 도 4는 본 개시의 실시 예에 따른 단말 및 기지국 간 동작의 순서를 도시한다. 도 4를 참조하면, 전송단은 5G 통신 시스템의 기지국(예를 들어, gNB)일 수 있고, 수신단은 단말(예를 들어, UE)일 수 있다. 물론 상기 예시에 제한되는 것은 아니며, 전송단 및 수신단은 각각 단말 및 기지국이 될 수도 있다. 또한, 본 개시의 실시 예에서 5G 통신 시스템을 예로 들고 있으나, 다른 통신 시스템(예를 들어, 6G 통신 시스템)에도 적용될 수 있다. 410 단계에서, 단말은 본 개시가 제시하는 기법에 따른 기지국 빔 측정의 수행 가능 여부를 포함하는 정보를 기 지국에 전송할 수 있다. 구체적으로, 단말은 기지국 빔 탐색을 수행할 수 있는 단말 능력에 대한 구체적인 정보 를 기지국에 보고할 수 있다. 일 실시 예로, 단말은 기지국 빔 탐색을 지원하는지 여부에 대한 정보를 기지국에 보고할 수 있다. 일 실시 예로, 단말은 주어진 시간(예를 들어, beam scanning window) 내에 탐색을 수행할 수 있는 기지국 빔 개수에 대한 정보를 기지국에 보고할 수 있다. 일 실시 예로, 단말은 빔 탐색을 수행함에 소요 되는 시간 지연에 대한 정보를 기지국에 보고할 수 있다. 일 실시 예로, 단말은 기지국 빔 탐색을 위해 요구되 는 최소 link quality(예를 들어, 최소 BMRS(beam management reference signal) 수신 성능에 대한 정보) 등 본 개시에서 제시하는 동작을 수행함에 필요한 요구사항을 기지국에 보고할 수 있다. 일 실시 예로, 단말은 지 원 가능한 성능에 대한 정보(예를 들어, 탐색 동작을 수행 시 고려할 수 있는 빔 resolution에 대한 정보)를 기 지국에 보고할 수 있다. 일 실시 예로, 단말은 상술된 동작을 수행함에 소요되는 시간 지연(예를 들어, 빔 탐색 을 위한 참조 신호 수신 후 결과 보고까지 소요되는 시간 정보, 또는 빔 탐색을 지시받은 후 결과 보고까지 소 요되는 시간 정보 중 적어도 하나를 포함)에 대한 정보를 기지국에 보고할 수 있다. 다만, 단말이 기지국에 보 고하는 정보들은 상술된 실시 예들 중 적어도 하나를 포함할 수 있으며, 상기 예시들에 제한되는 것은 아니다. 420 단계에서, 기지국은 단말이 수행하여야 할 수신단 기반 전송 빔 탐색 동작을 위한 정보들을 단말에 설정할 수 있다. 구체적으로, 기지국은 단말의 동작 요구사항에 대한 구체적인 정보를 단말에 보고할 수 있다. 예를 들 어, 기지국은 단말이 각 BMRS 수신을 통해 측정하여야 하는 기지국 빔의 개수에 대한 정보를 단말에 설정할 수 있다. 또한, 기지국은 빔 탐색의 정밀도(예를 들어, 단말이 측정 및 보고하여야 하는 beam resolution)에 대한 요구사항을 단말에 설정할 수 있다. 물론 상기 예시에 제한되는 것은 아니다. 430 단계에서, 기지국은 단말이 본 개시가 제시하는 기법에 따라 측정하여야 하는 참조 신호를 설정할 수 있다. 또한, 기지국은 기지국 빔 측정 방법에 대한 세부 정보를 설정할 수 있고, 설정된 정보를 단말에 전송할 수 있 다. 구체적으로, 기지국은 참조 신호의 전송을 위해, 각 전송 기회(transmission occasion)를 통해 전송되는 참 조 신호를 위한 적어도 하나의 참조 신호 자원(reference signal resource)을 단말에 설정할 수 있다. 참조 신 호 자원에 관한 설정 정보는 하기와 같은 정보들 중 적어도 하나를 포함할 수 있다. 물론 하기 예시들에 제한되 는 것은 아니다. - 각 참조 신호 전송에 사용되는 무선 자원의 위치: 참조 신호 전송을 위한 무선 자원의 위치 정보는 무선 자원 전송에 사용되는 무선 자원의 시간 및 주파수 축에서의 위치에 관한 정보를 포함할 수 있다. 일 실시 예로, 무 선 자원의 위치 정보는 참조 신호 전송에 사용되는 무선 자원이 어느 resource block에 해당하며, 해당되는 resource block의 어느 resource element에 해당하는 지에 대한 정보를 포함할 수 있다. 일 실시 예로, 무선자원의 위치 정보는 전송이 수행되는 slot 내 몇 번째 symbol에 참조 신호가 할당되는지 또는 참조 신호 전송에 사용되는 무선 자원이 속한 resource block과 해당 slot 내 몇 번째 부반송파(sub-carrier)에 참조 신호가 할당 되는지에 대한 정보 중 적어도 하나를 포함할 수 있다. 일 실시 예로, 무선 자원의 위치 정보는 참조 신호가 복 수의 symbol에 걸쳐 반복 전송되는 경우, symbol의 개수에 대한 정보를 포함할 수 있다. 일 실시 예로, 참조 신 호가 복수의 port로 구성된 경우, 각 port 전송에 사용되는 무선 자원의 위치에 대한 정보를 포함할 수도 있다. 물론 상기 예시로 제한되는 것은 아니며, 무선 자원의 위치 정보는 상술된 정보들 중 적어도 하나를 포함할 수 있다. - 참조 신호의 반복 전송 회수 또는 단말이 참조 신호를 통해 빔 탐색 시 고려하여야 되는 참조 신호 resource 의 수: 단말은 참조 신호의 반복 전송 회수 및/또는 빔 탐색 시 고려해야 하는 참조 신호 자원의 수에 관한 정 보를 통해 몇 개의 독립된 참조 신호 수신을 고려하여 빔 정보를 획득하여야 하는지(또는 획득할 수 있는지)에 대한 정보를 알 수 있다. 예를 들어, 4개의 참조 신호 resources 또는 4개의 독립된 무선 자원들에 할당된 참조 신호를 통해 빔 탐색을 수행할 수 있음을 기지국으로부터 전달받은 경우, 단말은 기지국으로부터 전달받은 참조 신호 resource들 또는 독립된 무선 자원들에 관한 정보를 기반으로 독립적으로 수신된 4개의 참조 신호들을 구 분할 수 있다. 그리고 단말은 기지국으로부터 4개의 참조 신호들 중 일부 또는 모두를 사용한 빔 탐색 수행이 지시 또는 설정되었음을 인지할 수 있다. - 참조 신호에 포함된 RS port의 수 및 port 전송에 사용된 무선 자원에 대한 정보: 예를 들어, 단말이 4개의 RS port을 수신하여야 하는 경우, 기지국은 각 port가 동일한 BMRS resource을 통해 전송되는지, 또는 각기 다 른 resource을 통해 전송되는지, 또는 각 port 간 sub-group이 형성되어 각 sub-group이 각기 다른 resource를 통해 전송되는지에 대한 정보를 단말에 전송할 수 있다. - 그 외 참조 신호의 수신 및 측정에 필요한 기타 정보들(예를 들어, 참조 신호 시퀀스, 전송 전력, port mapping pattern, 또는 BMRS resource가 무선 자원에 mapping 되는 pattern에 관한 정보 중 적어도 하나)이 포 함될 수 있다. 440 단계에서, 기지국은 430 단계에서 단말에 설정한 정보들에 기반하여 참조 신호를 단말에 전송할 수 있다. 또한, 상술된 430 단계에서 복수의 참조 신호 설정이 수행된 경우, 기지국은 어느 설정 정보에 기반하여 참조 신호의 전송이 수행되는지에 대한 정보를 단말에 전송할 수 있다. 상술된 정보는 MAC(medium access control) CE(control element) 또는 DCI(downlink control information)를 통해 단말에 전송될 수 있다. 또한, 기지국은 복수의 BMRS에 대하여 동시에 둘 이상의 설정된 참조 신호 전송을 수행할 수 있다. 또한, 참조 신호의 전송은 참조 신호 설정, activation, triggering 중 적어도 하나의 단계를 통해 수행될 수 있다. 또는, 참조 신호의 전송은 BMRS 기반 정보 보고(예를 들어, CSI reporting)의 설정, activation, triggering 중 적어도 하나의 단 계를 통해 수행될 수 있다. 450 단계에서, 단말은 본 개시가 제시하는 기법에 따라 기지국 빔 또는 전송 방향 탐색을 수행할 수 있다. 구체 적으로, 단말은 기지국 빔 또는 전송 방향 탐색을 위해 하기 동작들 중 적어도 하나를 수행할 수 있다. 물론 하 기 예시들에 제한되는 것은 아니다. - 단말은 기지국으로부터 참조 신호를 수신함에 있어, 독립된 무선 자원을 통해 수신된 각 참조 신호를 따로 구 분하여 버퍼에 저장할 수 있다. 이때, 독립된 무선 자원은 시간 축 또는 주파수 축에서 구분되는 무선 자원일 수 있다. 또는, 독립된 무선 자원은 단말이 독립된 참조 신호임을 구분하도록 하는 모든 종류의 구분 가능한 무 선 자원(예를 들어, sequence와 같은 시간, 주파수, 및/또는 코드 축에서의 무선 자원)을 의미할 수도 있다. 또 한, 다른 전송 port를 통해 전송된 BMRS 또한 독립된 무선 자원을 통해 수신된 참조 신호의 일 예시일 수 있다. - 단말은 독립된 무선 자원을 통해 수신된 수신 참조 신호들에 대하여, 참조 신호 간 phased combining 또는 phase shifted combining 작업을 수행할 수 있다. 구체적으로, 단말은 참조 신호 간 phase shift를 적용한 후 combining을 수행할 수 있다. 예를 들어, 단말은 제1 수신 참조 신호 대비 제2 수신 참조 신호에 theta(θ)의 위상 변경을 수행할 수 있고, 제3 수신 참조 신호에는 제1 수신 참조 신호 대비 theta x 2(2θ)의 위상 변경을 수행할 수 있다. 그리고 단말은 위상 변경된 신호들(예를 들어, 제1 수신 참조 신호, 제1 수신 참조 신호에 각 각 θ 및 2θ 만큼 위상 변경된 신호)을 combine할 수 있으며, 위상 변경된 신호들의 combine은 phased combining 또는 phase shifted combining으로 정의될 수 있다. - 단말은 복수의 phase 값들에 대하여 각각 phased combining 작업을 수행할 수 있다. 그리고 단말은 phased combining 작업을 통해, 각 phase 값에 대한 신호들을 조합한 후, 수신 성능(예를 들어, combined RSRP 값)을 측정할 수 있다. 도 5는 본 개시의 실시 예에 관련한 빔 참조 신호의 전송과 단말의 버퍼 사용 방법을 도시한다. 도 5를 참조하 면, 기지국의 빔 별 참조 신호의 전송과 수신과 관련한 전송 신호 구성과 단말의 버퍼 동작에 대한 방법이 설명 될 수 있다. 예를 들어, 기지국은 4개의 참조 신호들(예를 들어, θ_1 내지 θ_4)을 각각 서로 다른 무선 자원들 (예를 들어, 시간 축에서 서로 다른 자원들)을 사용하여 단말로 전송할 수 있다. 단말은 각 수신 시간 (occasion)에서 기지국이 전송한 4개의 참조 신호들(예를 들어, θ_1 내지 θ_4)을 수신할 수 있다. 그리고 단말 은 참조 신호들을 버퍼에 저장할 수 있고, 버퍼에 저장된 참조 신호들의 수신 성능을 측정할 수 있다. 도 6은 본 개시의 실시 예에 따른 빔 참조 신호의 전송과 단말의 버퍼 사용 방법을 도시한다. 도 6을 참조하면, 본 개시가 제시하는 기법에 따른 기지국의 빔 별 참조 신호의 전송과 수신과 관련한 전송 신호 구성과 단말의 버퍼 동작에 대한 방법이 설명될 수 있다. 전송단(예를 들어, 기지국)은 참조 신호들의 전송 시 빔 형성의 구성 요소(예를 들어, antenna element 또는 sub-array) 별 독립된 수신이 가능하도록 참조 신호들의 전송을 수행할 수 있다. 단말은 독립된 수신이 가능한 참조 신호들의 일부 또는 전부를 구분이 가능한 형태로 버퍼에 저장할 수 있다. 단말은 버퍼에 저장된 참조 신호들 간에 phase shift를 적용할 수 있으며, phase shift를 적용한 참조 신호들을 조합하여 수신 성능 측정할 수 있다. 예를 들어, 단말은 복수의 위상 변동(phase shift) 값들(예를 들 어, theta1(θ_1), theta2(θ_2))을 미리 선정할 수 있고, 각 위상 변동 값에 대한 조합 후 수신 성능 측정을 수행할 수 있다. - 단말은 상술된 동작을 통해 수신 성능을 보장하는 위상 변동 값을 측정 및 추정할 수 있다. 추정된 위상 변동 값은 전송단(예를 들어, 기지국)이 다중 안테나 어레이를 사용하여 수신단(예를 들어, 단말)에 신호를 전송하고 자 할 경우, 기지국 다중 안테나 어레이를 구성하는 각 안테나 요소 간 발생하는 위상차에 대한 추정 값일 수 있다. 그리고 기지국이 추정 값을 통해 단말과 통신을 수행할 경우, 추정 값을 통해 기지국에 적용되어야 할 빔 에 대한 정보가 도출될 수 있다. 예를 들어, 적정 위상 변동 값이 30도로 측정된 경우, 단말과 통신하는 기지국 이 측정에 사용된 참조 신호 각각에 대응하는 안테나들 간에 30도의 위상차를 적용하여 빔포밍을 수행하는 것이 적절하다는 것을 의미할 수 있다. - 일 실시 예로, 상술된 phased combining을 수행함에 있어, 단말은 제한된 수의 위상차 후보 값을 대상으로 적 절한 위상 변동 값을 측정할 수 있고, 측정한 위상 변동 값을 기반으로 최종 값을 결정할 수 있다. 단말이 위상 차 후보 값을 결정함에 있어, 단말은 수신 동작(예를 들어, initial access 또는 동기화 작업)에서 획득한 빔 정보에 기반하여 위상 변동 값을 스스로 결정할 수 있다. - 일 실시 예로, 단말은 위상차 후보 값을 기지국으로부터 지시받을 수도 있다. 예를 들어, 기지국은 MAC CE 또 는 DCI를 통해 각 단말에게 위상차 후보 값에 대한 정보를 전달할 수 있다. 기지국이 단말에 위상차 후보 값을 직접 전달하는 경우, 기지국은 정확한 phase 값을 단말에 전달할 수 있다. 또는, 기지국은 임의의 기준 값을 단 말에 전달하여 단말이 임의의 기준 값 주변의 값들을 위상차 탐색에 사용하도록 할 수도 있다. - 일 실시 예로, 단말은 위상 변동 값을 설정함에 있어, 기지국이 제공한 사전 정보를 활용할 수 있다. 예를 들 어, 단말이 동기를 확보하기 위한 SSB(synchronization signal block)를 수신하는 경우, 기지국은 각 SSB 신호 에 대하여 SSB가 어떤 위상 값을 통해 전송되는지에 대한 정보를 SIB(system information block)를 통해 단말에 전달할 수 있다. 단말은 동기화를 위해 수신한 SSB에 기반하여 빔 탐색에 사용할 위상 값을 산출할 수 있다. SSB에 기반한 위상 추정 값 산출의 구체적인 예시는 이하 도 7에서 설명한다. - 일 실시 예로, 단말은 빔 탐색에 사용할 위상차에 대한 정보를 TCI(transmission configuration indicator) state를 통해 기지국으로부터 전달받을 수 있다. 예를 들어, 단말이 빔 탐색에 사용할 참조 신호의 설정을 기지 국으로부터 수신함에 있어, 참조 신호의 전송 설정 정보인 TCI state 설정에 위상차에 대한 정보가 포함될 수 있다. 또는, TCI state 각각에 대하여 위상차 정보가 매핑될 수도 있다. 도 7은 본 개시의 실시 예에 따른 SSB(synchronization signal block)에 기반한 위상 추정 값의 산출 방법을 도시한다. 도 7을 참조하면, 상술된 단말이 위상 변동 값을 설정하는데 있어, 기지국이 사전 정보를 활용하는 실시 예가 설명될 수 있다. SSB에 기반한 위상 추정 값 산출의 구체적인 예시로서, 위상차에 대한 정보가 중심 값의 형식 으로 system information을 통해 단말에 전달될 수 있다. 예를 들어, 단말은 위상차(예를 들어, 45)의 정보를 포함하는 SSB(예를 들어, SSB #1)를 기지국으로부터 수신하여 기지국과의 동기를 확보할 수 있다. 단말은 동기 확보 후, 빔 탐색 과정에서 기지국으로부터 수신한 SSB #0에 해당하는 위상차 45도를 중심 값으로 하여, 35, 40, 45, 50, 55도의 위상차를 대상으로 빔 탐색을 수행할 수 있다. 460 단계 동작으로, 단말은 기지국 빔 또는 전송 방향에 대한 탐색 결과를 기지국에 보고할 수 있다. 이때, 단 말이 기지국에 전달하는 보고에는 빔에 대한 정보 및/또는 빔 탐색용 참조 신호(예를 들어, BMRS)의 수정에 관 련한 정보가 포함될 수 있다. 구체적으로, 단말이 기지국에 전달하는 보고에는 아래 정보들 중 적어도 하나가 포함될 수 있다. - 단말은 측정된 위상차와 측정된 위상차를 통해 획득한 조합 후의 수신 성능에 대한 정보를 기지국에 전달할 수 있다. 예를 들어, 단말은 10개의 후보 위상차에 대하여 조합 후의 수신 성능을 측정할 수 있다. 그리고 10개 의 후보 위상차에 대한 조합 후의 수신 성능 중 가장 우수한 성능을 보이는 적어도 하나의 조합 후의 수신 성능 과 조합 후의 수신 성능에 해당하는 위상차에 대한 정보를 기지국에 보고할 수 있다. - 이때, 위상차에 대한 정보는 위상차에 대한 직접적인 정보일 수 있다. 또는, 위상차에 대한 정보는 codebook 에 기반한 정보일 수 있다. 물론, 그 외에도 위상차를 통지할 수 있는 다양한 방식의 정보일 수 있으며, 상기 예시로 제한되는 것은 아니다. 또한, 위상차 외에 추가 정보(예를 들어, 상술된 독립된 무선 자원을 통해 전송 되는 참조 신호 간 전력 차 또는 그 외의 제어와 관련된 정보)를 포함할 수도 있다. - 단말은 BMRS adaptation에 해당하는 정보를 기지국에 보고할 수 있다. 물론, 아래 예시에 제한되는 것은 아니 며, BMRS adaptation에 해당하는 정보는 아래 정보들 중 적어도 하나를 포함할 수 있다. - 일 실시 예로, 단말은 조합 후의 수신 성능이 단말이 원하는 수준 또는 기지국이 설정한 일정 수준 이상의 값 이 되기 위해 조합되어야 하는 참조 신호의 개수에 대한 정보를 기지국에 전달할 수 있다. 예를 들어, 설정된 수신 성능 수준이 -80dBm이고, 기지국이 8개의 참조 신호들을 전송하였으며, 단말이 8개의 참조 신호들 중 4개 의 참조 신호들을 phased combining을 수행하여 측정된 조합 후의 수신 성능이 -78dBm이며, 이때 사용된 위상차 가 40도인 경우, 단말은 위상차 40도를 적용하여 4개의 참조 신호들의 조합 시 목표 수신 성능이 달성 가능함을 기지국에 보고할 수 있다. 단말은 보고를 수행함에 있어 복수의 {위상차, 참조 신호 개수} 세트의 형식으로 보 고를 수행할 수 있다. - 일 실시 예로, BMRS의 수신 성능이 단말이 기지국 빔 탐색을 수행하기 위한 최소 요구 조건보다 낮은 경우, 단말은 BMRS의 수신 성능에 관련한 정보를 기지국에 전달할 수 있다. 예를 들어, 단말이 요구하는 최소 BMRS 수 신 RSRP가 -120dB이고, 실제 수신된 BMRS의 수신 RSRP가 -125dB인 경우, 단말은 참조 신호의 수신 전력이 증가 하여야 함을 기지국에 전달할 수 있다. 이때, 단말이 기지국에 전달하는 정보는 정확한 수신 성능에 대한 정보 또는 향상되어야 하는 수신 성능에 대한 정확한 값을 포함할 수 있다. 또는, 단말이 기지국에 전달하는 정보는 discrete한 값(예를 들어, {0 3 6}dB)에 대한 지시자, BMRS 전송에 사용되어야 하는 symbol의 수, BMRS 전송에 사용되어야 하는 bandwidth, 향상되어야 하는 각 port 별 beamforming gain에 관련된 정보(예를 들어, port grouping에 대한 정보), 또는 BMRS 전송시 적용되어야 하는 beam에 대한 직접적인 또는 간접적인 정보 중 적어 도 하나를 포함할 수 있다. - 일 실시 예로, 단말은 기지국에게 BMRS adaptation에 대한 보다 구체적인 요청을 포함하는 정보를 보고할 수 있다. 예를 들어, 단말은 기지국이 지원하는 BMRS adaption 기법 중 특정 기법을 적용하도록 기지국에 요청할 수 있다. - 상술된 두 가지의 정보(예를 들어, 측정된 위상차와 측정된 위상차를 통해 획득한 조합 후의 수신 성능에 대 한 정보 및 BMRS adaptation에 관한 정보)에 대한 보고는 동시 또는 독립적으로 수행될 수 있다. 470 단계에서, 기지국은 460 단계에서 단말이 보고한 정보에 따라 빔 제어를 수행할 수 있으며, 필요 시 BMRS adaptation을 수행할 수 있다. BMRS adaptation이 수행된 경우, 기지국이 BMRS adaptation에 따라 BMRS 설정 정보를 업데이트 하고 업데이트된 BMRS 설정 정보를 단말에 전송할 수 있다. 구체적으로, 기지국은 아래 정보들중 적어도 하나를 단말에 전송할 수 있으며, BMRS 설정 정보의 업데이트 방법은 다음과 같을 수 있다. 물론, 하 기 예시에 제한되는 것은 아니다. - 일 실시 예로, 기지국은 최종 결정된 빔에 대한 정보를 단말에 전달할 수 있다. 예를 들어, 기지국은 단말이 보고한 위상차 정보 중 하나를 지시하는 지시자 또는 정확한 위상 값을 단말에 전달할 수 있다. 예를 들어, 단 말이 {40, 45, 50}이라는 세 가지 위상 값을 적절한 위상 값으로 기지국에 보고한 경우, 기지국은 {0}이라는 index를 단말에 지시하는 방식으로, 위상 값이 {40}에 해당하는 빔의 사용이 결정되었음을 단말에 전달할 수 있 다. - 일 실시 예로, 기지국은 단말 보고(예를 들어, 460 단계의 보고)에 기반하여 beam index를 단말에 전달할 수 있다. beam index는 기지국 전송 빔을 지시하는 지시자 형태로 단말에 전달될 수 있다. - 일 실시 예로, 기지국은 빔 변경 시 변경된 빔에 대한 정보를 단말에 전달하지 않을 수 있다. 또는, 기지국은 빔 변경 여부만을 단말에 전달할 수 있다. 또는, 기지국은 구체적인 빔 정보의 전달 없이 단말이 이후 BMRS를 통해 탐색하여야 하는 빔의 범위(예를 들어, phase shift 값 또는 phase shift 값의 범위)에 대한 정보만을 단 말에 전달할 수도 있다. - 기지국은 단말이 상술된 보고(예를 들어, 460 단계)에 사용한 참조 신호의 기존 설정과 단말의 BMRS adaptation 정보를 비교하여 BMRS 설정의 변경 여부를 결정할 수 있다. 예를 들어, 단말이 BMRS의 coverage가 부족함을 나타내는 정보(예를 들어, 수신 RSRP가 낮다는 정보)를 보고하거나 BMRS 수신에 실패하였음을 기지국 에 보고하는 경우, 기지국은 BMRS 전송에 사용되는 무선 자원의 양을 늘려 BMRS 수신 정확도를 증가시킬 수 있 다. 또는, 단말이 BMRS의 수신 성능이 충분치 않음을 기지국에 보고하였으며, 단말과 통신하기 위해 사용하여야 하는 빔에 대한 대략적인 정보가 존재하는 경우, 기지국은 기존 설정 대비 BMRS port의 수를 줄일 수 있다. 다 만, 기지국은 기존에는 다른 port 전송에 사용된 antenna element 또는 antenna sub-array 별 port virtualization을 통해 각 port 별 전송 전력을 증가시킬 수 있고, beamforming gain을 부여하는 방식으로 BMRS 설정을 변경할 수 있다. 상술된 DMRS adaptation의 구체적인 예시는 이하 도 8에서 구체적으로 설명된다. 도 8은 본 개시의 실시 예에 따른 BMRS adaptation 방법을 도시한다. 도 8을 참조하면, 기지국이 460 단계에서 단말이 보고한 정보에 따라 BMRS adaptation을 수행할 수 있다. 기지 국의 BMRS adaptation 방법의 예시는 다음과 같다. 물론 하기 예시에 제한되는 것은 아니다. 일 실시 예로, 기지국은 각 BMRS를 시간 축으로 연장(extended duration)시켜 단말에 전송할 수 있다. 일 실시 예로, 기지국은 각 BMRS를 안테나 포트 또는 (물리) 안테나 별로 그룹화하여 단말에 전송할 수 있다. 예를 들어, 4개의 BMRS를 2개의 안테나 포트들 또는 2개의 물리적인 안테나들로 그룹화하여 서로 다른 주파수 자원을 통해 단말에 전송할 수도 있다. 일 실시 예로, 기지국은 각 BMRS를 sub-beam 별로 단말에 전송할 수 있다. 예를 들어, 4개의 BMRS를 2개의 sub- beam 별로 서로 다른 주파수 자원을 통해 단말에 전송할 수도 있다. 도 9는 본 개시의 실시 예에 따른 기지국의 구조를 설명하기 위한 도면이다. 도 9에 도시된 바와 같이, 본 개시의 기지국은 프로세서, 송수신부, 메모리를 포함할 수 있다. 다만 기지국의 구성 요소가 전술한 예에 한정되는 것은 아니다. 예를 들어, 기지국은 전술한 구성 요소보다 더 많은 구성 요소를 포함하거나 더 적은 구성 요소를 포함할 수 있다. 뿐만 아니라, 프로세서, 송수신부 및 메모리이 하나의 칩(Chip) 형태로 구현될 수도 있다. 본 개시의 일 실시예에 따르면, 프로세서는 상술한 본 개시의 실시예에 따라 기지국이 동작할 수 있는 일 련의 과정을 제어할 수 있다. 예를 들면, 프로세서는 전술한 실시예들에 따른 안테나 어레이 조절 방법을 수행하기 위해 기지국의 구성요소들을 제어할 수 있다. 프로세서는 메모리에 저장된 프로그램을 실행 함으로써 전술한 본 개시의 실시예들이 수행되도록 기지국의 구성요소들을 제어할 수 있다. 또한 프로세서(92 0)는 AP(Application Processor), CP(Communication Processor), 회로(circuit), 어플리케이션 특정 (application-specific) 회로, 또는 적어도 하나의 프로세서(processor)일 수 있다.본 개시의 일 실시예에 따르면 송수신부는 네트워크 엔티티, 다른 기지국 또는 단말과 신호를 송수신할 수 있다. 네트워크 엔티티, 다른 기지국 또는 단말과 송수신하는 신호는 제어 정보와, 데이터를 포함할 수 있다. 송수신부는 송신되는 신호의 주파수를 상승 변환 및 증폭하는 RF 송신기와, 수신되는 신호를 저 잡음 증폭 하고 주파수를 하강 변환하는 RF 수신기 등으로 구성될 수 있다. 다만, 이는 송수신부는 일 실시예일 뿐이 며, 송수신부의 구성요소가 RF 송신기 및 RF 수신기에 한정되는 것은 아니다. 또한, 송수신부는 무선 채널을 통해 신호를 수신하여 프로세서로 출력하고, 프로세서로부터 출력된 신호를 무선 채널을 통해 전송할 수 있다. 본 개시의 일 실시예에 따르면, 메모리는 기지국의 동작에 필요한 프로그램 및 데이터를 저장할 수 있다. 또한, 메모리는 기지국이 송수신하는 신호에 포함된 제어 정보 또는 데이터를 저장할 수 있다. 메모리 는 롬(ROM), 램(RAM), 하드디스크, CD-ROM 및 DVD 등과 같은 저장 매체 또는 저장 매체들의 조합으로 구성 될 수 있다. 또한, 메모리는 복수 개일 수 있다. 또한 일 실시예에 따르면, 메모리는 전술한 안테나 어레이 조절 방법을 수행하기 위한 프로그램을 저장할 수 있다. 도 10은 본 개시의 실시 예에 따른 단말의 구조를 설명하기 위한 도면이다. 도 10에 도시된 바와 같이, 본 개시의 단말은 프로세서, 송수신부, 메모리를 포함할 수 있다. 다만 단말의 구성 요소가 전술한 예에 한정되는 것은 아니다. 예를 들어, 단말은 전술한 구성 요소보다 더 많은 구성 요소를 포함하거나 더 적은 구성 요소를 포함할 수 있다. 뿐만 아니라, 프로세서, 송수신부 및 메모리이 하나의 칩(Chip) 형태로 구현될 수도 있다. 본 개시의 일 실시예에 따르면, 프로세서는 상술한 본 개시의 실시예에 따라 단말이 동작할 수 있는 일련 의 과정을 제어할 수 있다. 예를 들면, 프로세서는 전술한 실시예들에 따른 안테나 어레이 조절 방법을 제공하기 위한 방법을 수행하기 위해 단말의 구성요소들을 제어할 수 있다. 프로세서는 메모리에 저장된 프로그램을 실행함으로써 전술한 본 개시의 실시예들이 수행되도록 단말의 구성요소들을 제어할 수 있다. 또한 프로세서는 AP(Application Processor), CP(Communication Processor), 회로(circuit), 어플 리케이션 특정(application-specific) 회로, 또는 적어도 하나의 프로세서(processor)일 수 있다. 본 개시의 일 실시예에 따르면 송수신부는 네트워크 엔티티, 다른 단말 또는 기지국과 신호를 송수신할 수 있다. 네트워크 엔티티, 다른 단말 또는 기지국과 송수신하는 신호는 제어 정보와, 데이터를 포함할 수 있다. 송수신부는 송신되는 신호의 주파수를 상승 변환 및 증폭하는 RF 송신기와, 수신되는 신호를 저 잡 음 증폭하고 주파수를 하강 변환하는 RF 수신기 등으로 구성될 수 있다. 다만, 이는 송수신부는 일 실시 예일 뿐이며, 송수신부의 구성요소가 RF 송신기 및 RF 수신기에 한정되는 것은 아니다. 또한, 송수신부 는 무선 채널을 통해 신호를 수신하여 프로세서로 출력하고, 프로세서로부터 출력된 신호를 무선 채널을 통해 전송할 수 있다. 본 개시의 일 실시예에 따르면, 메모리는 단말의 동작에 필요한 프로그램 및 데이터를 저장할 수 있다. 또한, 메모리는 단말이 송수신하는 신호에 포함된 제어 정보 또는 데이터를 저장할 수 있다. 메모리 는 롬(ROM), 램(RAM), 하드디스크, CD-ROM 및 DVD 등과 같은 저장 매체 또는 저장 매체들의 조합으로 구 성될 수 있다. 또한, 메모리는 복수 개일 수 있다. 또한 일 실시예에 따르면, 메모리는 전술한 안 테나 어레이 조절 방법을 수행하기 위한 프로그램을 저장할 수도 있다. 본 발명의 청구항 또는 명세서에 기재된 실시 예들에 따른 방법들은 하드웨어, 소프트웨어, 또는 하드웨어와 소 프트웨어의 조합의 형태로 구현될(implemented) 수 있다. 소프트웨어로 구현하는 경우, 하나 이상의 프로그램(소프트웨어 모듈)을 저장하는 컴퓨터 판독 가능 저장 매체 가 제공될 수 있다. 컴퓨터 판독 가능 저장 매체에 저장되는 하나 이상의 프로그램은, 전자 장치(device) 내의 하나 이상의 프로세서에 의해 실행 가능하도록 구성된다(configured for execution). 하나 이상의 프로그램은, 전자 장치로 하여금 본 발명의 청구항 또는 명세서에 기재된 실시 예들에 따른 방법들을 실행하게 하는 명령어 (instructions)를 포함한다. 이러한 프로그램(소프트웨어 모듈, 소프트웨어)은 랜덤 액세스 메모리 (random access memory), 플래시(flash) 메모리를 포함하는 불휘발성(non-volatile) 메모리, 롬(ROM: Read Only Memory), 전기적 삭제가능 프로그램가능 롬(EEPROM: Electrically Erasable Programmable Read Only Memory), 자기 디스크 저장 장치(magnetic disc storage device), 컴팩트 디스크 롬(CD-ROM: Compact Disc-ROM), 디지털 다목적 디스크(DVDs: Digital Versatile Discs) 또는 다른 형태의 광학 저장 장치, 마그네틱 카세트(magnetic cassette)에 저장될 수 있다. 또는, 이들의 일부 또는 전부의 조합으로 구성된 메모리에 저장될 수 있다. 또한, 각각의 구성 메모리는 다수 개 포함될 수도 있다. 또한, 상기 프로그램은 인터넷(Internet), 인트라넷(Intranet), LAN(Local Area Network), WLAN(Wide LAN), 또 는 SAN(Storage Area Network)과 같은 통신 네트워크, 또는 이들의 조합으로 구성된 통신 네트워크를 통하여 접 근(access)할 수 있는 부착 가능한(attachable) 저장 장치(storage device)에 저장될 수 있다. 이러한 저장 장 치는 외부 포트를 통하여 본 발명의 실시 예를 수행하는 장치에 접속할 수 있다. 또한, 통신 네트워크상의 별도 의 저장장치가 본 발명의 실시 예를 수행하는 장치에 접속할 수도 있다. 상술한 본 발명의 구체적인 실시 예들에서, 발명에 포함되는 구성 요소는 제시된 구체적인 실시 예에 따라 단수 또는 복수로 표현되었다. 그러나, 단수 또는 복수의 표현은 설명의 편의를 위해 제시한 상황에 적합하게 선택된 것으로서, 본 발명이 단수 또는 복수의 구성 요소에 제한되는 것은 아니며, 복수로 표현된 구성 요소라하더라도 단수로 구성되거나, 단수로 표현된 구성 요소라 하더라도 복수로 구성될 수 있다. 한편 본 발명의 상세한 설명에서는 구체적인 실시 예에 관해 설명하였으나, 본 발명의 범위에서 벗어나지 않는 한도 내에서 여러 가지 변형이 가능함은 물론이다. 그러므로 본 발명의 범위는 설명된 실시 예에 국한되어 정해 져서는 아니 되며 후술하는 특허청구의 범위뿐만 아니라 이 특허청구의 범위와 균등한 것들에 의해 정해져야 한 다."}
{"patent_id": "10-2023-0084795", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 실시 예와 관련한 Sub-array를 사용한 안테나 구조를 도시한다. 도 2는 본 개시의 실시 예와 관련한 지원 가능한 analogue beam을 설정하는 방법을 도시한다. 도 3은 본 개시의 실시 예와 관련한 다단계 beam sweeping 기법을 도시한다. 도 4는 본 개시의 실시 예에 따른 단말 및 기지국 간 동작의 순서를 도시한다. 도 5는 본 개시의 실시 예에 관련한 빔 참조 신호의 전송과 단말의 버퍼 사용 방법을 도시한다. 도 6은 본 개시의 실시 예에 따른 빔 참조 신호 전송과 단말의 버퍼 사용 방법을 도시한다. 도 7은 본 개시의 실시 예에 따른 SSB(synchronization signal block)에 기반한 위상 추정 값의 산출 방법을 도시한다. 도 8은 본 개시의 실시 예에 따른 BMRS(beam management reference signal) adaptation 방법을 도시한다. 도 9는 본 개시의 실시 예에 따른 기지국의 구성을 도시하는 도면이다. 도 10은 본 개시의 실시 예에 따른 단말의 구성을 도시하는 도면이다."}
