{"patent_id": "10-2021-0117632", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0030914", "출원번호": "10-2021-0117632", "발명의 명칭": "적응 가능한 다기능 로봇 손", "출원인": "바이럴린트 피티이 엘티디", "발명자": "웡 순 웨이"}}
{"patent_id": "10-2021-0117632", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "툴러블(toolable) 다기능 로봇 손으로서,교환가능하고, 표준화된 분극 인터페이스를 통해 외부 명령 인터페이스에 작동적으로 연결되는 기부 구조 또는지지부;기밀하게 시일링되고 스냅-온 분극 커넥터를 통해 로봇 손의 상기 지지부에 작동적으로 연결되는 적어도 5개의교환가능한 손가락 유닛;상기 손가락의 기계적 운동을 조작하기 위해 복수의 명령을 사용하여 소통 인터페이스를 통해 상기 다기능 로봇손을 지능적으로 제어함;실행될 임무에 따라, 로봇 손가락 유닛의 선단에 선택적으로 통합되어 있는 압력 센서, 온도 센서 또는 변위 센서와 같은 일 세트의 센서;대상물을 잡는 것을 도와 주기 위해 지지부에 작동적으로 연결되어 있는 엄지 손가락 유닛;수직 축선을 중심으로 지지부에 대해 선택적으로 회전 가능하도록 지지부에 작동적으로 연결되는 제 1 또는 집게 손가락 유닛;청결화 유닛으로서 기능하도록 상기 지지부에 작동적으로 연결되는 제 2 또는 중간 손가락 유닛;대상물을 이동시키는 픽-앤드-플레이스(pick-and-place) 기구로서 기능하도록 상기 지지부에 작동적으로 연결되는 제 3 또는 약 손가락 유닛;양방향 회전 공구로서 기능하도록 상기 지지부에 작동적으로 연결되는 제 4 또는 새끼 손가락 유닛;인코더가 통합되어 있고, 회전 운동을 필요로 하는 특정한 임무가 수행될 수 있게 하기 위해 로봇 손의 손바닥또는 지지부에 작동적으로 장착되는 양방향 모터; 및선택적으로 작동하여 복수의 임무를 실행하기 위해 상기 지지부에 작동적으로 연결되는 적어도 5개의 교환가능한 손가락 유닛을 포함하고,상기 손가락 유닛은, 각 손가락 유닛에 할당되어 있는 임무가 표준화된 인터페이스로부터 받은 복수의 명령을통해 독립적으로 제어 가능하도록 구성되어 있는, 툴러블 다기능 로봇 손."}
{"patent_id": "10-2021-0117632", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 엄지 손가락 유닛은, 대상물이 파지력의 피드백 및 제어를 가능하게 하기 위해 고무 패드 내부에서 압력센서가 적절히 통합되어 있는, 툴러블 다기능 로봇 손."}
{"patent_id": "10-2021-0117632", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 집게 손가락 유닛은, 손가락 선단의 일측에서 청결화 브러시, 및 손가락 선단의 반대측에서는 용액 분배구멍을 갖는 고무 패드가 장착되어 있는, 툴러블 다기능 로봇 손."}
{"patent_id": "10-2021-0117632", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 중간 손가락 유닛은, 탈이온화된 공기 분배기와 함께 손가락 선단에 고무 패드가 기능적으로 장착되어 있는, 툴러블 다기능 로봇 손.공개특허 10-2022-0030914-3-청구항 5 제 4 항에 있어서,고무 패드는, 분배되는 공기의 온도를 제어하기 위해 온도 센서가 적절히 통합되어 있는, 툴러블 다기능 로봇손."}
{"patent_id": "10-2021-0117632", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서,상기 약 손가락 유닛은, 미리 결정된 위치로부터 대상물을 픽업하여 다른 위치에 두기 위해 흡인 컵이 기능적으로 장착되어 있는, 툴러블 다기능 로봇 손."}
{"patent_id": "10-2021-0117632", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서,상기 새끼 손가락 유닛은, 내부의 대상물을 노출시키기 위해 시일링된 포장물의 포일 커버를 제거하는 것을 돕기 위해 인코더 결합 양방향 모터가 기능적으로 통합되어 있는, 툴러블 다기능 로봇 손."}
{"patent_id": "10-2021-0117632", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서,상기 양방향 모터에 통합되어 있는 인코더로부터의 위치 정보가 이용되어, 작업물과 결합해 있으면서, 양방향회전을 포함하는 미리 결정된 작동을 시작하고 종료하는, 툴러블 다기능 로봇 손."}
{"patent_id": "10-2021-0117632", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1 항에 있어서,로봇 손의 지지부에 작동적으로 장착되는 양방향 모터는 회전 그립퍼가 작동적으로 통합되어 있고, 이 회전 그립퍼는, 미리 결정된 회전 임무를 실행하기 위해 대상물의 직경 또는 프로파일에 무관하게 그 대상물 주위에 파지력을 동적으로 가하도록 프로그램되어 있는, 툴러블 다기능 로봇 손."}
{"patent_id": "10-2021-0117632", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "툴러블 다기능 로봇 손으로서,교환가능하고, 표준화된 분극 인터페이스를 통해 외부 명령 인터페이스에 작동적으로 연결되는 기부 구조 또는지지부;기밀하게 시일링되고 스냅-온 분극 커넥터를 통해 로봇 손의 상기 지지부에 작동적으로 연결되는 적어도 5개의교환가능한 손가락 유닛;상기 손가락의 기계적 운동을 조작하기 위해 복수의 명령을 사용하여 소통 인터페이스를 통해 상기 다기능 로봇손을 지능적으로 제어함;실행될 임무에 따라, 로봇 손가락 유닛의 선단에 선택적으로 통합되어 있는 압력 센서, 온도 센서 또는 변위 센서와 같은 일 세트의 센서;대상물을 잡는 것을 도와 주기 위해 지지부에 작동적으로 연결되어 있는 엄지 손가락 유닛;대상물을 잡는 것을 도와 주기 위해 상기 지지부에 작동적으로 연결되는 제 1 또는 집게 손가락 유닛;대상물을 잡는 것을 도와 주기 위해 지지부에 작동적으로 연결되는 제 2 또는 중간 손가락 유닛;대상물을 잡는 것을 도와 주기 위해 지지부에 작동적으로 연결되는 제 3 또는 약 손가락 유닛;대상물을 잡는 것을 도와 주기 위해 지지부에 작동적으로 연결되는 제 4 또는 새끼 손가락 유닛; 및대상물의 위치 찾기, 정렬 및 검사가 수행될 수 있게 하기 위해 로봇 손의 손바닥 또는 지지부에 작동적으로 장착되는 고해상도 카메라를 포함하는, 툴러블 다기능 로봇 손.공개특허 10-2022-0030914-4-청구항 11 제 10 항에 있어서,상기 로봇 손의 지지부는 대상물을 검사를 위해 위치 유지시킬 수 있게 하기 위해 진공이 작동적으로 통합되어있는 받침부를 포함하는, 툴러블 다기능 로봇 손."}
{"patent_id": "10-2021-0117632", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "다기능 로봇 손의 적어도 2개의 손가락에 의해 유지되는 용기의 시일링된 커버를 제거하기 위한 방법으로서,로봇 손의 지지부에 장착되어 있는 지능형 카메라를 사용하여, 상기 용기를 덮고 잇는 블리스터 포일(blisterfoil)의 위치를 찾는 단계;모터가 통합되어 있는 손가락 유닛을 이동시켜 상기 블리스터 포일과 적절히 결합하게 하는 단계;모터에 동시에 에너지를 주어 상기 용기로부터 블리스터 포일을 벗기는 방향으로 회전되게 하면서 상기 손가락유닛을 미리 결정된 위치로 이동시키는 단계;상기 손가락 유닛이 미리 결정된 위치에 도착하면 그 손가락 유닛의 이동을 멈추는 단계 - 블리스터 포일이 완전히 제거되어, 상기 용기에 유지되어 있는 대상물이 노출됨 -; 및상기 블리스터 포일을 처리하기 위해 상기 손가락 유닛을 다른 위치로 이동시키는 단계를 포함하는, 용기의 시일링된 커버를 제거하기 위한 방법."}
{"patent_id": "10-2021-0117632", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 12 항에 있어서,상기 용기는 손가락 선단에 위치되는 고무 패드에 통합되어 있는 압력 센서의 도움으로 최적의 파지력을 갖는로봇 손의 손가락 유닛에 의해 적절히 위치되는, 방법."}
{"patent_id": "10-2021-0117632", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "다기능 로봇 손의 적어도 2개의 손가락에 의해 유지되는 용기와 결합하여 용기의 마개를 풀거나 조이는 방법으로서,로봇 손의 지지부에 장착되어 있는 지능형 카메라를 사용하여 용기 마개의 위치를 찾는 단계;다른 다기능 로봇 손을 이동시켜, 지지부에 적절히 장착되어 있는 그 로봇 손의 회전 그립퍼를 정렬시켜 용기마개와 결합하게 하는 단계;용기 마개를 풀거나 조이는 방향으로 상기 회전 그립퍼 및 양방향 모터에 에너지를 주는 단계; 및다음 공정 단계를 시작하기 위해 상기 용기를 재위치시키는 단계를 포함하는, 용기의 마개를 풀거나 조이는 방법."}
{"patent_id": "10-2021-0117632", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 14 항에 있어서,상기 회전 그립퍼는 위치 피드백을 위한 인코더가 적절히 통합되어 있는 양방향 모터와 연결되어 있는, 방법."}
{"patent_id": "10-2021-0117632", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "툴러블(toolable) 모듈이 개시되며, 각 툴러블 모듈은 일 세트의 로봇 팔을 생성하기 위해 상호 협력적으로 기능 하도록 구성 가능한 일 세트의 기능 및 능력을 갖는다. 모듈의 각 핑거는 특정 임무의 수행을 가능하게 해주며, 복수의 운동도를 제공하고, 고정밀 용례에서 로봇 팔이 전개될 수 있게 하며 또한 복잡한 임무에 반응할 수 있다. 촬영 시스템 및 제어 시스템과 협동하여, 로봇 팔의 기능은, 미리 결정된 프로토콜로 외부 인터페이스와 연통할 수 있다는 것에 추가로, 프로그램 가능하고 규모 조정 가능하며 또한 구성 가능하고, 그리하여 \"플러그 앤드 플레이(Plug and Play)\" 기능을 제공한다."}
{"patent_id": "10-2021-0117632", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 상호 연결되는 일 세트의 다기능 로봇 손을 사용하여 대상물을 취급하기 위한 장치 및 방법에 관한 것으로, 로봇 손은, 각기 특정한 임무를 취급하고 실행할 수 있는 교환 가능한 공구로서 설계되어 있는 손가락 유닛을 갖는다. 로봇 손은, 장치가 반복되는 임무를 실행하는 과정시에 학습하고 개선할 수 있게 해주는 내장 형 인공 지능을 갖는 컴퓨터 제어 시스템을 사용하여 작동된다. 본 발명은, 특히, 다기능 로봇 손의 손가락 유 닛 및 손바닥을 조작하여 섬세한 임무(예컨대, 용기 뚜껑 또는 마개를 개방하는 것, 컨택트 렌즈 포장물의 정상커버를 벗겨내는 것, 이미징 시스템이 렌즈를 검사하고 그 렌즈의 특성을 결정하도록 안과 렌즈 또는 컨택트 렌 즈를 픽업하여 받침부 상에 두는 것, 및 검사된 렌즈를 언로딩하고 특성화된 결과에 근거하여 분류하는 것)를 수행하는 시스템과 방법에 관한 것이다. 고온 또는 저온의 탈이온화된 공기로 렌즈 용기를 청결하게 하고, 대 상물 또는 그의 용기를 브러싱하고, 함염(saline) 액체 또는 다른 종류의 용액을 제어된 속도로 분배하는 것에 대한 선택적인 옵션으로, 로봇 손은 안과 렌즈 제조 산업을 위한 전형적인 품질 제어 공정에서 사용되는 다용도 시스템을 제공한다."}
{"patent_id": "10-2021-0117632", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "어떤 자동화된 임무, 특히, 섬세하고 민감한 대상물 사이의 상호 작용이 있는 임무는, 엔드-이펙터(end- effector) 그립퍼를 구비하는 로봇 손에 있는 복수의 손가락 유닛의 협력적인 작업을 필요로 한다. 운동의 유 연도 및 대상물의 청결화, 픽업 및 배치, 액체 분배, 그립핑과 회전 및 살균 특징부를 위한 내장형 특징부로, 로봇 손은 다양한 임무를 수행하기 위한 인간의 배치에 적합하지 않은 환경에서 작동하는 데에 특히 적합하다. 그러한 임무를 시도하는 현재 개시된 기술의 대부분은, 에러가 공정 동안에 생길 가능성이 높은 임무를 수행하 기 위해 복수의 단계의 수동 검사 또는 인간 개입 및 복수의 기계적 매니퓰레이터의 사용을 필요로 한다. 종래 기술의 한계는, 별도의 플랫폼에 장착되는 전용 매니퓰레이터, 매니퓰레이터가 제조 또는 품질 제어 공정에 사 용되기 전의 시간 소비적인 재구성 공정을 포함한다. 휴머노이드 로봇은, 로컬 또는 공통적인 언어로의 소통 능력으로 인간 상호 작용을 위해 특별히 만들어진 장치 또는 시스템으로 직접적인 상호 작용이 요구될 때 바람직할 수 있다. 오디오 명령 및 오디오 지시의 이해가 필 요치 않은 경우에, 휴머노이드는 불필요하게 강력한 방식이고 또한 많은 양의 공간을 차지한다. 더욱이, 로봇 이 복수의 위치로 물리적으로 움직이는 것이 요구되지 않으면, 휴머노이드는 공간 제약 및 관련된 안전 문제로 인해 바람직하지 않다. 다기능 로봇 손의 구현은 소프트 컨택트 렌즈 또는 안과 렌즈와 같은 대상물을 취급하기 위한 공간 절약적이고 효율적인 시스템을 위한 중요한 단계이다. 본 발명에서, 관심 사항은, 비능숙 그립퍼를 사용하는 제조된 대상 물의 수동 조작으로부터 고 능숙 로봇 손 조작으로의 전환이고, 능숙도는 수행될 임무의 종류에 따라 선택된다. 특히, 품질 제어 관리 동안에 수행되는 일 세트의 임무를 위한 손의 설계는, 지능형 AI 기반 이미징 시스템으로 도움으로 컨택트 렌즈를 검사하고 이어서 그의 특성화된 카테고리에 따라 컨택트 렌즈를 사전에 할당된 병 또는 용기에 분류하기 위한 적어도 5개의 손가락 유닛을 갖는 2개의 로봇 손을 설계함으로써 연구된다. 본 발명에서, 이미징 시스템과 협력하는 한쌍의 아주 능숙한 다손가락 로봇 손이 제안되는데, 이 로봇 손은 블 리스터(blister) 포장물에 있는 함염(saline) 용액 중에 현탁되는 컨택트 렌즈를 언로딩하는 임무를 수행하고, 또한 컨택트 렌즈 홀더 또는 블리스터 팩을 덮고 있는 포일을 부드럽게 벗겨 내고 이어서 이미징 시스템에 의해 결정된 특성에 근거하여 렌즈를 상이한 용기 안으로 분류한 후에, 컨택트 렌즈에 대한 품질 검사를 수행할 수 있다. 한쌍의 로봇 손에 있는 각 손가락 유닛은, 모터를 사용하여 커버 포일을 벗겨 내는 것, 렌즈 홀더로부터 컨택트 렌즈를 검사 스테이션에 언로딩하는 것, 렌즈 홀더의 내용물을 비우고 청결하게 하는 것, (필요시에) 함 염 액체 또는 다른 액체를 분배하는 것, 피검사 렌즈 및 용기 마개를 풀거나 조이기 위해 로봇 손의 손바닥 영 역에 장착되는 추가적인 공구, 대상물 또는 공구의 미세한 정렬을 위한 소형 카메라 및 대상물을 검사를 위해 위치시키는 받침부를 언로딩하고 분류하는 것을 포함하되 이에 한정되지 않는 적어도 단일 임무에 전용된다. 본 발명의 제 1 양태에 따르면, 다기능 로봇 손 어셈블리는 적어도 5개의 손가락이 장착되어 있는 손 구조에 연 결되는 기부 구조를 포함한다. 손가락은 상이한 임무를 수행하기 위한 로봇 손의 교환성을 지원하기 위해 알려 져 있는 조합으로 기부 구조 및 액체 분배 관에 전기적으로 또는 공압적으로 작동적으로 연결된다. 본 발명의 다른 양태는, 손가락 유닛을 포함하는 한쌍의 다기능 로봇 손에 대한 것이고, 그 손가락 유닛은, 컨 택트 렌즈 블리스터 포장물과 같은 작은 대상물을 잡기 위해 엄지 손가락과 집게 손가락을 조합하여, 회전 모터 가 장착되는 있는 다른 로봇 손이 포장물을 덮고 있는 블리스터 포일의 가장자리와 모터의 축을 결합시켜 회전 운동을 사용하여 포일을 벗겨낼 수 있다. 이들 로봇 손가락 각각은, 이미징 시스템에 의해 검사될 대상물을 검 출하고 찾고 이동시키는 것을 돕기 위해 이미징 시스템에 네트워킹되어 있는 제어 시스템에 의해 제어된다. 이 미징 시스템의 상세점 및 그의 관련된 조명 모듈과 제어 시스템은 본 발명의 범위 밖에 있으므로 논의되지 않는 다.본 발명의 다른 양태는, 정전기 방지 흡인 패드가 적절히 통합되어 있는 손가락을 포함하는 다기능 로봇 우측 손에 대한 것이며, 그 손가락은 렌즈 홀더로부터 컨택트 렌즈를 픽업하고 그 컨택트 렌즈를 검사를 위해 플랫폼 또는 받침부에 이동시킨다. 다른 로봇 손가락은, 대상물 및 대상물 홀더를 청결하게 하고 살균하기 위해 고온 또는 저온의 공기 또는 다른 종류의 비독성 가스를 송풍하기 위해 공기 젯트 밸브가 적절히 통합되어 있다. 정 전기 방지 브러시가 적절히 통합되어 있는 다른 손가락은 청결화를 도와주고, 용액 분배기가 포함되어 있는 다 음 손가락은 액체를 분배하는 임무를 수행한다. 다른 손가락은, 회전 운동을 포함하는 임무를 수행하는 소형 모터가 통합되어 있고, 필요시에, 예컨대 모터 축을 블리스터 포일에 결합시켜 렌즈 홀더 또는 용기로부터 블리 스터 포일을 벗겨낸다. 본 발명의 다른 양태는, 특정한 임무에 할당되어 있는 모든 손가락을 가지며 교환 가능한 일 세트의 로봇 손에 대한 것이다. 본 발명의 다른 양태는, 손가락의 일부분이 복수의 배향을 얻기 위한 특정 각도로 회전될 수 있게 하기 위해 인 코더를 통해 위치 피드백을 갖는 모터가 통합되어 있는 로봇 손의 적어도 하나의 손가락에 대한 것이다. 본 발명의 다른 양태는, 섬세하고 정적인 민감한 대상물이 공정 흐름의 상이한 단계에서 안전하게 취급될 수 있 게 하기 위해 정전기 방지 압력 센서가 포함되어 있는 로봇 손의 적어도 하나의 손가락에 대한 것이다. 본 발명의 다른 양태는, 위치 피드백으로 대상물의 미세한 위치 결정을 가능하게 하기 위해 로봇 손의 적어도 하나의 손가락에 장착되고 내장형 인코더를 갖는 동력화된 또는 공압식 X-Y 변위 기구에 대한 것이다. 본 발명의 다른 양태는, 용기의 너트, 볼트. 마개 및 뚜껑을 풀거나 조일 수 있도록 그립핑 매니퓰레이터와 조 합되는 로봇 손의 손바닥에 적절히 통합되어 있고 내장형 인코더를 갖는 회전 모터를 포함하는 로봇 장치에 대 한 것이다. 본 발명의 다른 양태는 한쌍의 로봇 손에 대한 것으로, 이 로봇 손은 다양한 임무의 수행시에 충돌 회피를 위해 근접 센서 및 적절히 위치되는 적외선(IR) 센서가 장착된다. 본 발명은, 특히 작업장이 유독성이고 더럽고 기름이 있고 또한 정전하에 민감할 때 섬세한 임무를 수행하기 위 해 셋업에 대한 비싸고 시간 소비적인 수정 없이 개별 손가락과 손의 임무를 쉽게 변경할 수 있는 추가된 능력 을 가지고 다양한 운동도로 대상물을 조작하는 다기능 로봇 손의 구현을 가능하게 한다. 본 발명이 사용될 수 있는 다른 제조 용례는, 결함에 대한 휴대폰 유리 검사, 수술 동안에 수술실에서 관상 동 맥 우회 그래프팅(grafting) 및 혈관형성 부속물의 제조, 창고 보관 및 우편 사업에서의 분류 및 상자 보관을 포함한다. 당업자는, 본 발명의 다른 구성도 가능하고, 따라서 첨부 도면의 특수성은 본 발명에 대한 앞의 설명의 일반성 을 대체하는 것으로 이해되어서는 안 됨을 알 것이다."}
{"patent_id": "10-2021-0117632", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 예시적인 실시 형태에 따른 다기능 로봇 손, 교환가능한 로봇 손가락 유닛 및 로봇 장치를 첨 부 도면을 참조하여 설명할 것이다. 상이한 도면에서 동일하거나 유사한 부재 및 부분에는 동일한 참조 번호가 주어져 있음을 유의하는 것이 중요하다. 도 1에 나타나 있는 바와 같이, 제 1 실시 형태에 따른 다기능 로봇 손(20, 40)은 각 손에서 5개의 손가락 유닛 을 포함한다. 소형 모터가 교환 가능한 축을 갖는 로봇 우측 손의 새끼 손가락 유닛에 통합되어 있다. 제 2 다기능 로봇 손은 대상물을 찾아 이미징 시스템 아래에 위치시키는 매니퓰레이터로서 기능 하고, 이미징 시스템은 카메라, 광학 렌즈 및 조명 모듈을 포함한다. 로봇 손은 로봇 좌측 손(4 0)을 위한 도 1에 나타나 있는 바와 같은 스냅-온 분극 커넥터를 통해 신속하게 교환 가능하도록 설계되어 있다. 이중 다기능 로봇 손은 이미징 시스템과 함께 동기적으로 작동하여 상이한 환경에서 복잡한 임무를 수행한다. 그의 기밀하게 시일링된 설계로 인해, 다기능 로봇 손은, 예컨대, 클린룸, 유독성의 고온 또는 습한 작업장소, 수술실, 휴머노이드, 식품 포장 산업, 제약 및 유리 산업에서 사용될 수 있다. 도 1에 도시되어 있는 시스템 및 방법은 인간의 개입 없이 컨텍트 렌즈 홀더로부터 블리스터 포일를 벗 겨내는 것에 관한 것이고, 로봇 좌측 손은 대상물(예컨대, 컨택트 렌즈 용기)을 잡고 이를 이미징 시스 템 카메라 아래에 위치시키기 위해 사용된다. 이미징 시스템은 블리스터 포일의 가장자리를 검출 하고 그 위치를 로봇 우측 손에 전달하고, 그 우측 손은 모터 축을 움직여, 다기능 로봇 좌측 손에 의해 유지되는 블리스터 팩의 블리스터 포일과 결합하게 한다. 도 2는 포장물을 덮는 블리스터 포일이 없는 빈 블리스터 쉘이다. 도 3은 모터의 모터 축이 위치에서 블리스터 포일의 가장자리와 결합하는 등각도이다. 앞에서 설명한 바와 같이, 모터는 다기능 로봇 우측 손의 새끼 손가락에 적절히 통합되며, 또한 다기능 로봇 우측 손을 방향으로 동기적으로 이동시키면서 도 3의 축이 에너지를 받아 시계 방향 또는 벗김 방향으로 회전하고 그 과정에서 블리스터 팩 또는 쉘의 정상 표면으로부터 블리스터 포일을 벗겨내기 전에, 도 1의 이미징 시 스템의 도움으로 블리스터 포일 가장자리와 정확하게 결합하게 된다. 도 4는 컨텍트 렌즈가 노출된 상태에서 부분적으로 완료된 블리스터 포일의 벗겨내기 과정을 나타내며, 모 터는 블리스터 팩의 반대편 단부에 위치되어 있다. 다음 단계(나타나 있지 않음)에서, 블리스터 포일이 블리스터 팩으로부터 완전히 분리되어 버려질 때까지 모터는 축을 계속 회전시킨다. 도 5 및 5a는 본 발명의 제 1 실시 형태에 따른 다기능 로봇 우측 손을 뒤와 앞에서 각각 본 사시도를 나타내고, 기밀하게 시일링되는 5개의 손가락 유닛, 엄지, 제 1 또는 집게 손가락 유닛, 제 2 또는 중 간 손가락 유닛, 제 3 약 손가락 유닛 및 제 4 또는 새끼 손가락 유닛을 포함한다. 지지부가 5 개의 손가락 유닛을 구동시키고 구동 부분을 통해 외부 인터페이스에 연결된다. 외부 인터페이스는 예컨대 휴머노이드 팔 또는 자동화된 매니퓰레이터를 포함할 수 있다. 인터페이스에서 받은 명령은 이어서 지지부 에 전달되어, 5개의 손가락 유닛 및 그의 각각의 특징부(예컨대, 모터, 공기 젯트, 브러시, 용액 분배기, X & Y 변위 구동기, 병 오프너)를 조작하고 또한 압력, 온도, 위치 데이터를 판독하기 위해 손가락에 포함되어 있는 일군의 센서를 모니터링한다. 부분은 외부 제어 시스템에 대한 고유의 인터로킹 인터페이스를 통해, 로봇 우측 손의 연통을 위한 공압, 전기적 및 양방향 컴퓨터 인터페이스를 안내하는 데에 도움을 준다. 그 부분은 쉬운 교환 가능성, 적응성 및 스케일 조정성을 위해 설계되어 있다. 본 발명의 제 1 실시형태에서 5개의 손가락 유닛은, 이들 손가락 유닛을 상이한 임무에 이용하기 위해 특정한 특징부, 예컨대, 촉각 센서, 홀 효과 센서, 압력 센서 및 온도 게이지를 가지도록 설계된다. 로봇 손가락 유닛 은 또한 로봇 손이 상이한 용례를 위해 신속하게 재구성될 수 있게 하기 위해 기계적, 전기적 및 공압적 제어를 위한 표준화된 인터페이스를 가지도록 모듈식으로 설계된다.본 발명의 제 1 실시 형태에 따르면 그리고 도 5a를 참조하면, 엄지 손가락은 고무 어댑터를 가지도록 설계되며, 표면은 대상물을 잡을 수 있도록 거칠지만 부드럽다. 로봇 우측 손 집게 손가락 유닛은, 고무 그립퍼 및 일측에 있는 전기 제어식 밸브(나타나 있지 않음)를 통해 용액을 분배하기 위한 개구에 추가 로, 다른 측에서 브러시(도 5)를 가지고 있는데, 이 브러시는 대상물을 청결하게 하고 브러싱하는 데에 도 움을 준다. 중간 손가락 유닛은 고무 그립퍼 및 대상물의 청결화 및 건조를 가능하게 하기 위해 전기 제어식 공압 밸브(나타나 있지 않음)를 통해 깨끗한 탈이온화 공기를 송풍하기 위한 개구로 이루어진다. 로봇 우측 손의 약 손가락 유닛은, 미리 결정된 위치로부터 대상물을 집어 올려 복수의 위치에 두는 데에 적합한 흡인 컵을 갖는다. 새끼 손가락 유닛은 복수의 임무를 수행하기 위해 교환 가능한 축 또는 공 구를 갖는 소형 모터를 갖는다. 회전 그립퍼가 로봇 우측 손의 손바닥 영역에 통합되어 있는 데, 이 회전 그립퍼는 병으로부터 나사, 너트 및 마개를 풀거나 조이기 위해 또는 파지 및 회전 운동을 필요로 하는 다른 임무에 이용될 수 있다. 도 6은 로봇 우측 손의 집게 손가락 유닛의 측면도이다. 도시되어 있는 바와 같이, 그 집게 손가락 유닛의 선단은, 가요성 수지로 만들어지는 고무 패드, 청결화의 목적으로 용액의 미세 젯트를 관을 통해 분사 하기 위한 작은 개구 및 대상물을 문지르기 위한 브러시를 갖는다. 젯트는 컴퓨터 촉발 밸브(나타나 있지 않음)에 의해 제어된다. 집게 손가락 유닛의 손가락 선단은, 브러시가 그의 원래 위치로부터 180 도 만큼 회전할 수 있도록 축선(A1)을 따라 조인트 주위로 회전 가능하도록 설계된다. 도 7은 로봇 우측 손의 중간 손가락 유닛의 측면도이다. 나타나 있는 바와 같이, 그 중간 손가락 유닛의 선단은 또한 가요성 수지로 만들어지는 고무 패드 및 공압 관을 통해 공기 젯트 밸브(나타나 있지 않음)에 연결되는 작은 개구를 갖는다. 공기 젯트는 정전하를 제거하기 위해 탈이온화된 고온 또는 저온의 공기를 대상물에 전달하고 또한 다음 공정 단계 전에 대상물을 청결하게 하고 건조시키도록 제어될 수 있다. 도 8은 로봇 우측 손의 약 손가락 유닛의 측면도이다. 이 손가락 유닛은 대상물이 다른 위치로 이동될 필 요가 있을 때 마다 흡인 패드를 사용하여 대상물을 픽업하기 위해 사용된다. 예컨대, 도 11의 로봇 좌측 손이 컨택트 렌즈 검사를 위해 도 1의 이미징 시스템 아래에 위치되고 이어서 컨택트 렌즈가 도 11의 받침부로부터 픽업되도록 도 8의 로봇 우측 손의 손가락 유닛에 주어지며 그리고 그것을 용기 또는 트 레이와 같은 다른 위치에 두기 전에, 약 손가락 유닛은 도 8에 있는 흡인 컵을 사용하여 도 4의 컨택트 렌즈를 픽업하여 도 11의 받침부 상에 둘 수 있다. 흠인 압력은 컴퓨터 제어 밸브(나타나 있지 않음) 를 경유해 관을 통해 도 8의 \"92\"에서 생성된다. 도 9에서, 로봇 우측 손의 새끼 손가락 유닛의 측면도는 기부에 적절히 통합되어 있는 소형 모터를 나 타낸다. 교환 가능한 회전자 또는 공구 비트가 복수의 임무가 수행될 수 있게 해준다. 본 발명의 제 2 실시 형태에서, 도 5a는 다기능 로봇 우측 손의 손바닥 영역에 적절히 통합되어 있는 구성 가능 한 병 오프너를 도시하며, 이 병 오프너는 병 마개가 풀리거나 조이게 할 수 있게 해주는 힘 및 토크 제어 와 조합되는, 시계 방향 및 반시계 방향 모두의 회전 작용을 제공한다. 병 오프너의 설계는, 병 오프너가 상이한 복수 형태의 병 마개 프로파일에 응하도록 되어 있다. 병 마개 개방 방법이 도 10에 도시되어 있는데, 여기서 병의 병 마개는 로봇 우측 손 영역에 장착되는 도 5a의 회전 고정구와 결합된다. 이 특징부는 대상물을 잡아 회전시키는 그립퍼와 조합되는 회전 운동을 필요로 하는 임무에 이용될 수 있다. 다른 용례는 너트 또는 볼트 풀기 또는 조임 등을 포함할 수 있다. 도 11에는 본 발명의 제 3 실시 형태가 나타나 있다. 도 11은 도 1에서 \"40\"으로 나타나 있는 바와 같은 대상 물을 잡아 위치시키는 데에 주로 사용되는 다기능 로봇 좌측 손의 구성을 도시한다. 손바닥은 필요한 경우에 미세 정렬 및 추적을 가능하게 하는 선택적인 카메라를 갖는다. 손바닥은 또한 손바닥 영역에서 받침부 (도 11)를 수용할 수 있고, 이 받침부는, 도 1의 이미징 시스템이 도 5a의 로봇 우측 손의 약 손가락 유닛의 흡인 컵(도 5a)에 의해 배치되는 컨택트 렌즈를 검사하도록 그 컨택트 렌즈를 유지하고 준다. 품질 검사 특징부는 찢어짐, 기포 및 오염과 같은 결함, 직경, 렌즈 두께와 같은 치수 측정 및 굴절력 검출을 포함하지만 이에 한정되지 않는다. 손가락 유닛(41, 46, 47,48, 49)의 선단에 있는 고무 패드는 특정 공정에서 요구되는 홀 효과 센서, 생물 측정 센서 및 다른 선택적인 센서를 포함할 수 있다. 서로의 능력과 밀접한 조화 를 이루어 작동하는 로봇 우측 손과 로봇 좌측 손은 상이한 공정들을 자동화함에 있어 매우 중요한 능력을 추가 하는데, 이는 관련 기술에서는 실현 불가능하다. 본 발명의 제 4 실시 형태에서, 유리 검사 산업에서 실시될 수 있는 구성이 설명된다. 로봇 우측 손의 도 1의 이미징 시스템 유닛과 조화를 이루는 도 11의 로봇 좌측 손 카메라이 이용되어 유리 대상물(예컨대, 휴대폰 스크린 또는 베젤(bezel) 유리)을 결함에 대해 검사하여 그 유리의 결함 유무를 결정할 수 있다 본 발명의 제 5 실시 형태에서, 정확성과 위생이 특히 중요하고 의무적인 수술 부속물 제조 산업에서 구성이 실 시될 수 있다. 부속물은 심흉 기구, 섬세한 미세수술 심장 판막 등을 포함할 수 있지만 이에 한정되지 않는다. 동일한 세트의 로봇의 후제조를 사용하여 품질 보증 공정을 실행하여, 고객에게 보내지기 전에 제조된 제품을 검사할 수 있다. 본 발명의 제 6 실시 형태에서, 로봇 손이 겉봉투, 박스 및 용기와 같은 포장물을 미리 결정된 세트의 규칙에 따라 분류하고 상자에 보관하기 위해 그 포장물 상의 정보를 판독하고 해석하도록 되어 있는 구성이 구현될 수 있다. 예컨대, 다기능 로봇 손은 포장물을 그의 ZIP 코드에 따라 분류하고 상자에 보관하기 위해 우체국 및 창 고 보관 산업에서 적합하게 될 수 있다. 내장형 인공 지능을 갖는 다기능 로봇 손은, 인간의 개입이 없이, 전체 로봇 손을 상이하게 구성된 로봇 손으로 교체하거나 특정 세트의 로봇 손가락 유닛을 교체하여 스스로 재구성될 수 있다. 이러한 특징에 의해, 로봇 손 이 새로운 용례를 위해 작동할 필요가 있을 때마다 또는 수정된 공정이 동일한 용례에서 실시될 필요가 있으면, 그 로봇 손은 스스로를 스케일링하고 적합하게 할 수 있다. 표준화된 인터페이스(도 5 및 5a의 \"22\" 및 도 11 의 \"42\")를 통해 얻어지는 교환성 및 상호 작동가능한 기능은, 로봇 손의 재구성 가능성을 간단하게 해주어, 동 일하거나 상이한 작동 조건 하에서 새로운 공정에서의 신속하고 용이한 전개를 가능하게 해주는데, 이는 종래 기술에서는 가능하지 않다. 도 12를 참조하면, 공정의 흐름은, 블리스터 팩 내부의 컨택트 렌즈가 제거되고 검사되는 단계 100에서 시작한 다. 단계 102에서, 도 1의 블리스터 팩은 도 1의 이미징 시스템 아래에 주어져 있어, 포장물 윤곽을 확인하고 도 1의 블리스터 포일의 가장자리를 찾는다. 도 12의 단계 104에서 결정된 위치 정보는 도 106의 컴퓨터 시스템(나타나 있지 않음)에 전달되며, 이 컴퓨터 시스템은 도 1의 로봇 우측 손에 명령하여 도 1의 모터 축을 도 1의 블리스터 포일과 결합시킨다. 단계 108에서 포일 결합이 완료된다. 완료되지 않으 면, 공정은 단계 106에서 재시작하여, 포일 결합 공정을 재시도한다. 단계 110에서, 도 1의 모터는 시계 방향으로 회전하기 시작하고, 동시에, 블리스터 포일이 도 1의 블리스터 팩의 정상측으로부터 완전히 분리 될 때까지, 모터 어셈블리는 블리스터의 후방 단부 쪽으로 이동하고 그 과정에서 도 1의 블리스터 포일이 벗겨진다. 로봇 우측 손의 다음 단계 112에서, 블리스터 포일은 버려지고 로봇 우측 손은 다음 단계 114로 가 게 된다. 이 단계 114에서, 이미징 시스템이 로봇 우측 손에 명령하여 컨택트 렌즈를 도 1의 블리스터 팩 으로부터 픽업하고, 도 1의 이미징 시스템이 컨택트 렌즈를 검사할 수 있도록 그 렌즈를 도 11의 받침부 에 상에 둔다. 이미징 시스템은 일세트의 규칙에 따라 컨택트 렌즈를 특성화하고 단계 115에서의 결과를 로봇 우측 손에 전달하며, 그러면 이 우측 손은 컨택트 렌즈를 받침부로부터 픽업할 것이다. 결과는 단계 115 에서 통합되고 단계 116에서 전달되고, 그 후에 단계 117에서 분류가 일어난다. 컨택트 렌즈가 도 11의 받침부 로부터 픽업되고 단계 118에서의 판단에 근거하여 상이한 용기(120 - 124) 안으로 배치된다. 용기의 카테 고리의 수는 품질 보증 시스템의 구성에 근거하여 변할 수 있음을 유의하는 것이 중요하다. 단계 119에서 로봇 좌측 손에 있는 빈 블리스터를 버린 후에 공정이 단계 126에서 종료된다. 다기능 로봇 손의 특유한 설계 및 그의 관련된 손가락 유닛은, 대상물의 그립핑, 유지, 청결화, 브러싱, 도싱 (dosing), 픽업 및 배치, 다양한 용기의 마개의 개방 및 폐쇄를 포함한 모든 가능한 행위 및 운동을 실현할 수 있고, 품질 검사 공정에서 뿐만 아니라 정확성, 신뢰성, 일관성 및 위생이 아주 중요한 제조 공정에의 사용을 위해 그것들을 가능하게 한다. 이상으로, 본 발명의 실시 형태에 따른 다기능 로봇 손이 설명되었지만, 본발명은 위의 실시 형태에 한정되지 않으며, 본 발명의 정신에서 벗어남이 없이 일정 범위에서 적절히 만들어지는 다양한 수정을 포함할 수 있다.도면 도면1 도면2 도면3 도면4 도면5 도면5a 도면6 도면7 도면8 도면9 도면10 도면11 도면12"}
{"patent_id": "10-2021-0117632", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 발명의 위의 특징 및 이점은, 첨부 도면과 함께 본"}
