{"patent_id": "10-2022-0007092", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0111356", "출원번호": "10-2022-0007092", "발명의 명칭": "인덕션 장치 및 인덕션 장치에서 외부 장치 감지 방법", "출원인": "삼성전자주식회사", "발명자": "이경민"}}
{"patent_id": "10-2022-0007092", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인덕션 장치에 있어서,무선 전력 송신 회로;전류 센서; 및상기 무선 전력 송신 회로 및 상기 전류 센서와 연결된 프로세서를 포함하고, 상기 프로세서는 상기 무선 전력 송신 회로를 통해 외부 장치의 감지를 위한 제1 전력을 출력하고, 상기 제1 전력 출력 중 상기 전류 센서를 이용하여 상기 무선 전력 송신 회로의 송신 코일에 흐르는 제1 전류를 측정하여상기 제1 전류의 제1 위상을 식별하고, 상기 제1 전류의 제1 위상과 외부 장치가 근접하지 않은 상태에서의 제2전류의 제2 위상 간의 위상 딜레이 값을 식별하고, 상기 식별된 위상 딜레이 값이 지정된 임계값 이상인 경우외부 장치가 근접한 상태를 식별하도록 설정된 인덕션 장치."}
{"patent_id": "10-2022-0007092", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 프로세서는 상기 식별된 위상 딜레이 값이 지정된 임계값 이상인 상태에서 상기 식별된 위상 딜레이 값이제1 위상 딜레이 값인 경우 상기 제1 위상 딜레이 값에 대응된 제1 외부 장치를 식별하고, 상기 식별된 위상 딜레이 값이 제2 위상 딜레이 값인 경우 상기 제2 위상 딜레이 값에 대응된 제2 외부 장치를 식별하도록 설정된인덕션 장치."}
{"patent_id": "10-2022-0007092", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 복수의 외부 장치들 각각에 대응된 복수의 위상 딜레이 값들을 저장하는 메모리를 더 포함하는 인덕션 장치."}
{"patent_id": "10-2022-0007092", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 프로세서는 상기 복수의 외부 장치들 각각에 대응된 상기 복수의 위상 딜레이 값들을 이용하여 상기 복수의 외부 장치들 중 상기 식별된 위상 딜레이 값에 대응된 외부 장치를 식별하도록 설정된 인덕션 장치."}
{"patent_id": "10-2022-0007092", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 프로세서는 상기 외부 장치가 근접하지 않은 상태에서의 제2 전류의 제2 크로싱 포인트 값과 상기 측정된상기 제1 전류의 제1 크로싱 포인트 값 사이의 차이를 기반으로 상기 위상 딜레이를 식별하도록 설정된 인덕션장치."}
{"patent_id": "10-2022-0007092", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2023-0111356-3-제1항에 있어서, 상기 프로세서는 지정된 공진 주파수에 기반하여 상기 무선 전력 송신 회로를 통해 외부 장치의 감지를 위한 제1 전력을 출력하도록 설정된 인덕션 장치."}
{"patent_id": "10-2022-0007092", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 통신 모듈을 더 포함하는 인덕션 장치."}
{"patent_id": "10-2022-0007092", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 통신 모듈은 인밴드 방식 또는 아웃밴드 방식으로 상기 외부 장치와 통신하도록 설정된 인덕션 장치."}
{"patent_id": "10-2022-0007092", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서, 인덕현 히팅부를 더 포함하고, 상기 프로세서는 상기 인덕션 히팅부와 상기 무선 전력 송신 회로를 각각 제어하도록 설정된 인덕션 장치."}
{"patent_id": "10-2022-0007092", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 입력 모듈을 더 포함하고,상기 프로세서는 상기 입력 모듈을 통해 인덕션 히팅을 위한 입력이 수신되면 상기 인덕션 히팅부를 통해 전자기 유도 가열을 수행하도록 설정된 인덕션 장치."}
{"patent_id": "10-2022-0007092", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "인덕션 장치에서 외부 장치 감지 방법에 있어서,무선 전력 송신 회로를 통해 외부 장치의 감지를 위한 제1 전력을 출력하는 동작;상기 제1 전력 출력 중 전류 센서를 이용하여 상기 무선 전력 송신 회로의 송신 코일에 흐르는 제1 전류를 측정하는 동작;상기 측정된 제1 전류의 제1 위상을 식별하는 동작; 상기 제1 전류의 제1 위상과 외부 장치가 근접하지 않은 상태에서의 제2 전류의 제2 위상 간의 위상 딜레이 값을 식별하는 동작; 및 상기 식별된 위상 딜레이 값이 지정된 임계값 이상인 경우 외부 장치가 근접한 상태를 식별하는 동작을 포함하는 방법."}
{"patent_id": "10-2022-0007092", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 공개특허 10-2023-0111356-4-상기 식별된 위상 딜레이 값이 지정된 임계값 이상인 상태에서 상기 식별된 위상 딜레이 값이 제1 위상 딜레이값인 경우 상기 제1 위상 딜레이 값에 대응된 제1 외부 장치를 식별하는 동작; 및 상기 식별된 위상 딜레이 값이 제2 위상 딜레이 값인 경우 상기 제2 위상 딜레이 값에 대응된 제2 외부 장치를식별하는 동작을 더 포함하는 방법."}
{"patent_id": "10-2022-0007092", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서, 복수의 외부 장치들 각각에 대응된 복수의 위상 딜레이 값들을 획득하는 동작을 더 포함하는 방법."}
{"patent_id": "10-2022-0007092", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서, 상기 복수의 외부 장치들 각각에 대응된 상기 복수의 위상 딜레이 값들을 이용하여 상기 복수의 외부 장치들 중상기 식별된 위상 딜레이 값에 대응된 외부 장치를 식별하는 동작을 더 포함하는 방법."}
{"patent_id": "10-2022-0007092", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11항에 있어서, 상기 외부 장치가 근접하지 않은 상태에서의 제2 전류의 제2 크로싱 포인트 값과 상기 측정된 상기 제1 전류의제1 크로싱 포인트 값 사이의 차이를 기반으로 상기 위상 딜레이를 식별하는 동작을 더 포함하는 방법."}
{"patent_id": "10-2022-0007092", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제11항에 있어서, 지정된 공진 주파수에 기반하여 상기 무선 전력 송신 회로를 통해 외부 장치의 감지를 위한 제1 전력을 출력하는 방법."}
{"patent_id": "10-2022-0007092", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제11항에 있어서,인밴드 방식 또는 아웃밴드 방식으로 상기 외부 장치와 통신하는 동작을 더 포함하는 방법."}
{"patent_id": "10-2022-0007092", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제11항에 있어서, 인덕션 히팅부를 제어하는 동작을 더 포함하는 방법."}
{"patent_id": "10-2022-0007092", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에 있어서, 입력 모듈을 통해 인덕션 히팅을 위한 입력이 수신되면 상기 인덕션 히팅부를 통해 전자기 유도 가열을 수행하는 동작을 더 포함하는 방법.공개특허 10-2023-0111356-5-청구항 20 명령들을 저장하고 있는 비휘발성 저장 매체에 있어서, 상기 명령들은 적어도 하나의 프로세서에 의하여 실행될때에 상기 적어도 하나의 프로세서로 하여금 적어도 하나의 동작을 수행하도록 설정된 것으로서, 상기 적어도하나의 동작은,무선 전력 송신 회로를 통해 외부 장치의 감지를 위한 제1 전력을 출력하는 동작;상기 제1 전력 출력 중 전류 센서를 이용하여 상기 무선 전력 송신 회로의 송신 코일에 흐르는 제1 전류를 측정하는 동작;상기 측정된 제1 전류의 제1 위상을 식별하는 동작; 상기 제1 전류의 제1 위상과 외부 장치가 근접하지 않은 상태에서의 제2 전류의 제2 위상 간의 위상 딜레이 값을 식별하는 동작; 및 상기 식별된 위상 딜레이 값이 지정된 임계값 이상인 경우 외부 장치가 근접한 상태를 식별하는 동작을 포함하는 저장 매체."}
{"patent_id": "10-2022-0007092", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 문서의 다양한 실시 예에 따른 인덕션 장치는 무선 전력 송신 회로, 전류 센서, 및 상기 무선 전력 송신 회로 및 상기 전류 센서와 연결된 프로세서를 포함하고, 상기 프로세서는 상기 무선 전력 송신 회로를 통해 외부 장치 의 감지를 위한 제1 전력을 출력하고, 상기 제1 전력 출력 중 상기 전류 센서를 이용하여 상기 무선 전력 송신 회로의 송신 코일에 흐르는 제1 전류를 측정하여 상기 제1 전류의 제1 위상을 식별하고, 상기 제1 전류의 제1 위 상과 외부 장치가 근접하지 않은 상태에서의 제2 전류의 제2 위상 간의 위상 딜레이 값을 식별하고, 상기 식별된 위상 딜레이 값이 지정된 임계값 이상인 경우 외부 장치가 근접한 상태를 식별하도록 설정될 수 있으며, 다른 실 시예도 가능할 수 있다."}
{"patent_id": "10-2022-0007092", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 문서의 다양한 실시 예들은 인덕션 장치에 관한 것이다."}
{"patent_id": "10-2022-0007092", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근에는 전자 장치가 사용자의 편의를 위해 다양한 형태로 발전하고 있으며, 가정에서 사용하는 가전 기기들도 안전하고 사용이 편리한 형태로 발전하고 있다. 가전 기기들 중 가열 조리 기기로서 인덕션 히팅이 가능한 인덕션 장치(이하 '전자 장치'또는'인덕션 전자 장치'라고도 함)가 있으며, 인덕션 장치는 코일에 고주파 교류 전류를 흐르게 하여 코일에서 자기장이 발생되도 록 함으로써, 유도 코일 위에 올려진 자성 물체를 가열하는 전자기 유도 방식으로 작동할 수 있다. 인덕션 장치 는 외부 장치 내의 자성 물체에 열이 발생하도록 하면서도 열효율이 높아서 조리 시간을 단축할 수 있고, 최근 에는 안전성, 열효율, 가열속도 등이 가스레인지, 하이라이트 방식보다 좋기 때문에 널리 사용되고 있다."}
{"patent_id": "10-2022-0007092", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "인덕션 장치가 인덕션 히팅 기능뿐만 아니라 전자기 유도 방식의 무선 전력 송신도 가능하도록 한다면 편리할 수 있다. 예를 들면, 인덕션 장치에 무선 전력 송신 장치를 포함하여 인덕션 장치의 일부(인덕션 히팅 장치(또 는 인덕션 히팅부 또는 인덕션 히팅 모듈 또는 인덕션 히팅 파트))를 통해서는 용기를 가열하고, 인덕션 장치의 다른 일부(무선 전력 송신 장치(또는 무선 전력 송신부 또는 무선 전력 송신 모듈)을 통해서는 외부 무선 전력 수신 장치에 무선으로 전력을 수신하도록 한다면 편리할 수 있다. 인덕션 장치에 포함된 무선 전력 송신 장치를 통해 무선 전력을 수신할 수 있는 외부 장치는 다양할 수 있다. 예를 들면, 인덕션의 무선 전력 송신 장치를 통해 무선 전력을 수신할 수 있는 외부 장치는 토스터, 블렌더, 및 /또는 케틀 등의 다양한 소형(또는 소물) 가전을 포함할 수 있다. 외부 장치들은 각각 서로 다른 무선 전력 수 신 파워를 요구할 수 있다. 인덕션 장치는 외부 장치들 각각에서 요구되는 무선 전력 수신 파워를 식별하고 외부 장치들 각각에 맞는 무선 전력을 송신할 필요가 있을 수 있다. 다양한 실시예에 따르면 외부 장치 감지 시 외부 장치의 타입을 식별하고, 식별된 외부 장치에 대응된 동작 모 드로 무선 전력을 송신하도록 할 수 있는 인덕션 장치 및 인덕션 장치에서 외부 장치 감지 방법을 제공할 수 있다. 다양한 실시예에 따르면 외부 장치 감지 시 식별된 외부 장치의 타입에 대응된 무선 전력 송신 방식 및 무선 전 력 송신 크기로 무선 전력을 송신하도록 할 수 있는 인덕션 장치 및 인덕션 장치에서 외부 장치 감지 방법을 제 공할 수 있다."}
{"patent_id": "10-2022-0007092", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 문서의 일 실시예에 따르면, 인덕션 장치는 무선 전력 송신 회로, 전류 센서, 및 상기 무선 전력 송신 회로 및 상기 전류 센서와 연결된 프로세서를 포함하고, 상기 프로세서는 상기 무선 전력 송신 회로를 통해 외부 장 치의 감지를 위한 제1 전력을 출력하고, 상기 제1 전력 출력 중 상기 전류 센서를 이용하여 상기 무선 전력 송 신 회로의 송신 코일에 흐르는 제1 전류를 측정하여 상기 제1 전류의 제1 위상을 식별하고, 상기 제1 전류의 제 1 위상과 외부 장치가 근접하지 않은 상태에서의 제2 전류의 제2 위상 간의 위상 딜레이 값을 식별하고, 상기 식별된 위상 딜레이 값이 지정된 임계값 이상인 경우 외부 장치가 근접한 상태를 식별하도록 설정될 수 있다. 일 실시예에 따르면, 인덕션 장치에서 외부 장치 감지 방법은 무선 전력 송신 회로를 통해 외부 장치의 감지를 위한 제1 전력을 출력하는 동작, 상기 제1 전력 출력 중 전류 센서를 이용하여 상기 무선 전력 송신 회로의 송 신 코일에 흐르는 제1 전류를 측정하는 동작, 상기 측정된 제1 전류의 제1 위상을 식별하는 동작, 상기 제1 전 류의 제1 위상과 외부 장치가 근접하지 않은 상태에서의 제2 전류의 제2 위상 간의 위상 딜레이 값을 식별하는 동작, 및 상기 식별된 위상 딜레이 값이 지정된 임계값 이상인 경우 외부 장치가 근접한 상태를 식별하는 동작 을 포함할 수 있다. 일 실시예에 따르면, 명령들을 저장하고 있는 비휘발성 저장 매체에 있어서, 상기 명령들은 적어도 하나의 프로 세서에 의하여 실행될 때에 상기 적어도 하나의 프로세서로 하여금 적어도 하나의 동작을 수행하도록 설정된 것으로서, 상기 적어도 하나의 동작은, 무선 전력 송신 회로를 통해 외부 장치의 감지를 위한 제1 전력을 출력하 는 동작, 상기 제1 전력 출력 중 전류 센서를 이용하여 상기 무선 전력 송신 회로의 송신 코일에 흐르는 제1 전 류를 측정하는 동작, 상기 측정된 제1 전류의 제1 위상을 식별하는 동작, 상기 제1 전류의 제1 위상과 외부 장 치가 근접하지 않은 상태에서의 제2 전류의 제2 위상 간의 위상 딜레이 값을 식별하는 동작, 및 상기 식별된 위 상 딜레이 값이 지정된 임계값 이상인 경우 외부 장치가 근접한 상태를 식별하는 동작을 포함할 수 있다."}
{"patent_id": "10-2022-0007092", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "다양한 실시예에 따르면 인덕션 장치에서 송신 코일에 흐르는 전류의 위상차를 이용하여 보다 용이하게 외부 장 치의 타입을 식별하고, 식별된 외부 장치에 대응된 동작 모드로 무선 전력을 송신하도록 할 수 있다. 다양한 실시예에 따르면 인덕션 장치에서 외부 장치가 존재하지 않을 때 송신 코일에 흐르는 전류의 위상과 외 부 장치가 존재할 때 송신 코일에 흐르는 전류의 위상의 차이가 얼마인지에 따라 외부 장치가 복수의 타입들 중 어느 타입인지 식별하고, 식별된 타입의 외부 장치에 대응된 무선 전력 송신 방식 및 무선 전력 송신 크기로 무 선 전력을 송신하도록 할 수 있다. 본 개시에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효과들은 아래의 기재로부터 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0007092", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면들을 참조하여 다양한 실시예에 따른 전자 장치에 대해서 살펴본다. 다양한 실시예에서 이용 되는 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예를 들어, 인공지능 전자 장치)를 지칭할 수 있다. 본 문서에서 사용된 용어들은 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 다른 실시예의 범위를 한정 하려는 의도가 아닐 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명의 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가질 수 있다. 일반적으로 사용되는 사전에 정 의된 용어들은 관련 기술의 문맥상 가지는 의미와 동일 또는 유사한 의미를 가지는 것으로 해석될 수 있으며, 본 문서에서 명백하게 정의되지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 경우에 따 라서, 본 문서에서 정의된 용어일지라도 본 발명의 실시예들을 배제하도록 해석될 수 없다. 도 1은 일 실시예에 따른 인덕션 장치와 외부 장치들을 나타낸 도면이다. 도 1을 참조하면, 일 실시예 따른 인덕션 장치(또는 인덕션 전자 장치 또는 전자 장치 또는 무선 전력 송신 장 치)는 외부 장치들(또는 무선 전력 수신 장치들)(110-1 내지 110-n) 중 적어도 하나에 무선으로 각각 전력 (1-1,1-2,1-n)을 제공할 수 있다. 예를 들면, 인덕션 장치는 무선 전력 송수신을 위한 지정된 인증 절차를 수행한 인증된 외부 장치에 대하여 무선으로 전력을 제공할 수 있다. 일 실시예에 따른 인덕션 장치는 외부 장치들(110-1 내지 110-n) 각각과 통신을 수행할 수 있다. 예를 들 면, 인덕션 장치 및 외부 장치들(110-1 내지 110-n) 각각은 지정된 프레임으로 구성된 패킷들(2-1 내지 2- n) 각각을 처리하거나 송수신할 수 있다. 예를 들면, 인덕션 장치는 무선 전력 송신이 가능한 장치(무선 전력 송신 장치)를 포함할 수 있고, 외부 장치들(110-1 내지 110-n)은 인덕션 장치에 포함된 무선 전력 송신 장 치를 통해 무선 전력을 수신할 수 있는 외부 무선 전력 수신 장치를 포함할 수 있다. 예를 들면, 외부 장치들 (110-1 내지 110-n)은 제1 외부 장치(예: 블렌더), 제2 외부 장치(예: 케틀), 제3 외부 장치(예: 토스터), 및/ 또는 이외 다른 다양한 소형(또는 소물) 가전을 포함할 수 있다. 일 실시예에 따른 인덕션 장치는 공진 방식으로 외부 장치들(110-1 내지 110-n) 중 적어도 하나에 무선으 로 전력을 전송할 수 있다. 일 실시예에 따른 외부 장치들(110-1 내지 110-n) 각각은 인덕션 장치로부터 전송되는 전력을 이용하여 지정된 동작(또는 기능)(예: 토스터 기능, 블렌더 기능, 또는 케틀 기능)을 수행할 수 있다. 예를 들면, 인덕션 장치들(110-1 내지 110-n) 각각은 외부 장치로부터 전송되는 전력을 축적할 수 있는 축전지(또는 배터리)를 구비하고, 축적된 전력을 이용하여 지정된 동작(또는 기능)을 수행할 수 있다. 일 실시예에 따른 인덕션 장치는 외부 장치 감지를 위한 제1 전력(예: ping power)를 출력할 수 있다. 일 실시예에 따른 인덕션 장치는 제1 전력 출력 중 송신 코일의 전류(예: 제1 전류)를 측정할 수 있다. 일 실 시예에 따른 인덕션 장치는 상기 측정된 제1 전류의 제1 위상과 제1 전력 출력 중 외부 장치가 근접하지 않은 상태에서의 제2 전류의 제2 위상 간의 위상 딜레이를 식별할 수 있다. 일 실시예에 따른 인덕션 장치(10 0)는 상기 측정된 제1 전류의 제1 위상과 외부 장치가 근접하지 않은 상태에서의 제2 전류의 제2 위상간의 위상 딜레이 값이 지정된 임계값(threshold) 이상(또는 초과)인 경우 외부 장치가 근접된 상태인 것을 식별할 수 있 다. 일 실시예에 따른 인덕션 장치는 상기 측정된 제1 전류의 제1 위상과 외부 장치가 근접하지 않은 상태 에서의 제2 전류의 제2 위상간의 위상 딜레이 값이 지정된 임계값(threshold) 이상인 상태에서 제1 위상과 제2 위상간의 위상 딜레이 값에 기반하여 외부 장치의 타입을 식별할 수 있다. 일 실시예에 따른 인덕션 장치는 외부 장치들(110-1 내지 110-n) 각각에 대응된 위상 딜레이 값들을 저장하고, 제1 위상과 제2 위상 간의 딜 레이 값이 외부 장치들(110-1 내지 110-n) 각각의 위상 딜레이 값들 중 어느 외부 장치의 위상 딜레이 값에 대 응되는지를 식별(확인 또는 판단)할 수 있다. 예를 들면, 인덕션 장치는 제1 위상과 제2 위상 간의 딜레이 값이 외부 장치들(110-1 내지 110-n) 각각의 위상 딜레이 값들 중 제1 위상 딜레이 값과 동일하거나 지정된 범 위 내에서 유사한 경우 제1 위상 딜레이 값에 대응된 제1 외부 장치 또는 제1 외부 장치 타입을 식별할 수 있다. 예를 들면, 인덕션 장치는 제1 위상과 제2 위상 간의 딜레이 값이 외부 장치들(110-1 내지 110-n) 각각의 위상 딜레이 값들 중 제2 위상 딜레이 값과 동일하거나 지정된 범위 내에서 유사한 경우 제2 위상 딜레 이 값에 대응된 제2 외부 장치 또는 제2 외부 장치 타입을 식별할 수 있다. 일 실시예에 따른 인덕션 장치(10 0)는 식별된 외부 장치 또는 외부 장치 타입에 기반하여 무선 전력 송신을 수행할 수 있다. 일 실시예에 따른 외부 장치들(110-1 내지 110-n)은 인덕션 장치와의 사이에서 서로 다른 인덕턴스가 유도 될 수 있는 서로 다른 인덕터(예: 코일 또는 수신 코일)를 포함할 수 있다. 예를 들면, 수신 코일은 자성체(예: ferrite)와 와이어(wire)를 포함할 수 있다. 예를 들면, 제1 외부 장치(110-1)는 제1 자성체(제1 ferrite)를 포함할 수 있고, 제2 외부 장치(110-2)는 제2 자성체(제2 ferrite)를 포함할 수 있다. 제1 ferrite의 제1 단면 (예: 제1 cross-section)과 제2 ferrite 의 제2 단면(예: 제2 cross-section)의 차이(또는 반지름 차이)에 따 라 인덕션 장치로부터 제공되는 제1 전력에 의해 제1 외부 장치(110-1)의 제1 수신 코일에 유도되는 제1 인덕턴스와 제2 외부 장치(110-2)의 제2 수신 코일에 유도되는 제2 인덕턴스가 다를 수 있다. 예를 들면, 외부 장치들(110-1 내지 110-n)은 각각 또는 타입(또는 종류)에 따라 자기장 노출 시 서로 다른 각 ferrite의 단면의 반지름에 따라 유도되는 값(예: 인덕턴스)이 다를 수 있다. 다시 말해, 외부 장치들(110-1 내지 110-n)은 각각 또는 타입(또는 종류)에 따라 서로 다른 각 ferrite의 단면의 반지름을 가질 수 있고, 서로 다른 각 ferrite의 단면의 반지름에 따라 인덕션 장치로부터의 제1 전력(예: ping power)에 의해 유도되는 인덕턴스 값이 서 로 다를 수 있다. 외부 장치들(110-1 내지 110-n)마다 인덕션 장치로부터의 제1 전력(예: ping power)에 의해 유도되는 인덕턴스 값이 서로 다름에 따라 공진 주파수가 달라지고 이에 따라 인덕션 장치의 송신 코 일에 흐르는 전류의 위상의 딜레이 값이 달라질 수 있다. 도 2는 일 실시예에 따른 인덕션 장치에 외부 장치가 근접하지 않은 경우와 인덕션 장치에 외부 장치가 근접한 경우를 나타낸 도면이다. 도 2를 참조하면, 일 실시예에 따른 인덕션 장치는 외부 장치 감지를 위한 제1 전력(예: ping power)을 송 신 코일(114-1)을 통해 출력할 수 있다. 일 실시예에 따른 인덕션 장치가 송신 코일(114-1)을 통해 ping power 출력 시 외부 장치(예: 제1 외부 장 치(110-1))가 근접하지 않은 상태인 <201>에서는 송신 코일(114-1)에 포함된 자성체의 제1 cross-section에 따 른 제1 인덕턴스가 유도될 수 있다. 일 실시예에 따른 인덕션 장치가 송신 코일(114-1)을 통해 ping power 출력 시 외부 장치(예: 제1 외부 장 치(110-1))가 근접한 상태 <202>에서는 송신 코일(114-1)에 포함된 자성체의 제1 cross-section과 제1 외부 장 치(110-1)의 수신 코일(154-1)에 포함된 자성체의 제2 cross-section에 대응된(증가된 cross-section에 대응된) 제2 인덕턴스가 유도될 수 있다. 하기 수학식 1은 코일의 인덕턴스를 계산하기 위한 수학식일 수 있다. 수학식 1"}
{"patent_id": "10-2022-0007092", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "상기 수학식 1에서 만일 N = nl이면, = = 이고, L은 원통 코일의 인덕 턴스이고, 는 자유공간의 투과성이고, l은 코일에 사용된 와이어의 길이이고, N은 코일의 턴 수이고, r 은 코 일 단면(cross section)의 반지름이고, A는 코일의 단면 영역을 나타낼 수 있다. 상기한 바와 같은 수학식 1을 참조하면, 코일 단면(cross section)의 반지름의 증가에 따라 인덕턴스가 증가될 수 있으며, 송신 코일(114-1)을 통해 ping power 출력 시 외부 장치(예: 제1 외부 장치(110-1))가 근접한 상태 <202>에서는 외부 장치가 근접하지 않은 상태 <201>일 때보다 송신 코일(114-1)외에 추가적인 수신 코일(154- 1)로 인해 실질적으로 cross-section이 증가되는 효과가 나타날 수 있고, cross-section의 증가에 따라 인덕턴 스가 증가하고 증가된 인덕턴스는 송신 코일(114-1)와 수신 코일(154-1) 사이의 공진 주파수를 감소시킬 수 있 다. 다시 말해, 인덕션 장치가 송신 코일(114-1)을 통해 ping power 출력 시 외부 장치(예: 제1 외부 장치 (110-1))가 근접한 상태 <202>에서는 인덕턴스가 증가하고, 공진 주파수가 감소함에 따라 인덕션 장치의 송신 코일(114-1)에 흐르는 전류의 위상이 외부 장치가 근접하지 않은 상태 <201>일 때보다 딜레이될 수 있다. 도 3은 일 실시예에 따른 인덕션 장치에서 송신 코일을 통해 ping power 출력 시 외부 장치가 근접하지 않은 상 태와 근접한 상태 각각에서 송신 코일에 흐르는 전류를 나타낸 그래프이다. 도 3을 참조하면, 일 실시예에 따른 그래프에서 가로축은 시간을 나타내고, 세로축은 전압 및 전류를 나타 낼 수 있다. 일 실시예에 따르면 인덕션 장치는 외부 장치 감지를 위해 제1 전압(예: Vgs)의 제1 전력(예: ping power)을 제1 전압 파형과 같이 출력할 수 있다. 예를 들면, 제1 전압 파형은 지정된 시간 동안 주기적으로 출력될 수 있다. 일 실시예에 따른 인덕션 장치는 제1 전압(예: Vgs)의 제1 전력(예: ping power)을 출력하면서 송신 코일 (114-1)에 흐르는 전류를 측정할 수 있다. 예를 들면, 인덕션 장치는 제1 전압(예: Vgs)의 제1 전력(예: ping power) 출력 시 외부 장치가 근접하지 않은 상태에서 송신 코일(114-1)에 흐르는 전류를 제1 전류 파형 과 같이 측정할 수 있다. 예를 들면, 인덕션 장치는 제1 전압(예: Vgs)의 제1 전력(예: ping power) 출력 시 외부 장치가 근접한 상태에서 송신 코일(114-1)에 흐르는 전류를 제2 전류 파형과 같이 측정할 수 있다. 일 실시예에 따른 인덕션 장치는 핑 파워 인가 후 제1 전류 파형의 제1 제로 크로싱 포인트 (zero crossing point)와 제2 전류 파형의 제2 제로 크로싱 포인트 사이의 시간차를 기반 으로 위상 딜레이 값을 식별(또는 확인 또는 판단)할 수 있다. 일 실시예에 따른 인덕션 장치는 미리 저장된(또는 획득된 또는 실험에 의해 설정된) 외부 장치들 각각에 대응된 복수의 위상 딜레이 값들을 저장하고, 복수의 위상 딜레이 값들을 이용하여 식별된 위상 딜레이 값에 대응된 외부 장치를 식별할 수 있다. 예를 들면, 인덕션 장치는 복수의 위상 딜레이 값들 중 식별된 위상 딜레이 값을 비교하여, 복 수의 위상 딜레이 값들 중 식별된 위상 딜레이 값과 동일하거나 일정 범위 내에서 유사한 위상 딜레이 값 에 대응된 외부 장치를 식별할 수 있다. 예를 들면, 인덕션 장치는 제1 위상 딜레이 값이 식별된 경우, 복 수의 위상 딜레이 값들 중 제1 위상 딜레이 값과 동일하거나 지정된 범위 내에서 유사한 위상 딜레이 값에 대응 된 제1 외부 장치를 식별하거나, 제2 위상 딜레이 값이 식별된 경우, 복수의 위상 딜레이 값들 중 제2 위상 딜 레이 값과 동일하거나 지정된 범위 내에서 유사한 위상 딜레이 값에 대응된 제2 외부 장치를 식별할 수 있다. 도 4는 일 실시예에 따른 인덕션 장치와 외부 장치의 구성을 나타낸 도면이다. 도 4를 참조하면, 일 실시예에 따른 인덕션 장치(예: 도 1의 인덕션 장치)는 프로세서, 전력 송 신 회로, 전류 센서, 통신 모듈을 포함할 수 있다. 일 실시예에 따른 프로세서는 적어도 하나의 MCU(micro processing unit)을 포함할 수 있다. 일 실시예에 따른 프로세서는 무선 전력 송신 전 전력 송신 회로가 송신 코일(414-1)을 통해 외부 장치의 감 지를 위한 제1 전력(예: ping power)을 출력하도록 제어할 수 있다. 일 실시예에 따른 프로세서는 전력 송 신 회로를 통한 제1 전력 출력 중 전류 센서를 이용하여 측정된 송신 코일(414-1)에 흐르는 전류(예: 제1 전류)의 값을 획득할 수 있다. 일 실시예에 따른 프로세서는 상기 측정된 제1 전류의 제1 위상을 식별 할 수 있다. 일 실시예에 따른 프로세서는 상기 측정된 제1 전류의 제1 위상과 제1 전력 출력 중 외부 장 치가 근접하지 않은 상태에서의 제2 전류의 제2 위상을 비교하여 제1 위상과 제2 위상간의 위상 딜레이를 식별 할 수 있다. 하기 표 1은 외부 장치가 근접하지 않은 상태에서 측정된 제1 전류의 제1 위상과 제1 전력 출력 중 외부 장치가 근접하지 않은 상태에서의 제2 전류의 제2 위상 간의 위상 딜레이의 예를 나타낸 테이블이다. 표 1 Phase delay @70kHz ( )Phase delay @50kHz( )Phase delay @45kHz( ) 외부 장치가 근접한 상태2.6 3.5 3.8외부 장치가 근접하지 않 은 상태2.4 3.3 3.5 상기 표 1을 참조하면, 일 실시예에 따른 프로세서는 송신 코일(414-1)의 공진 주파수가 약 70kHz인 경우 외부 장치가 근접한 상태에서 측정된 제1 전류의 제1 제로 크로싱 포인트 값이 약 2.6 이고, 외부 장치가 근접 하지 않은 상태에서 측정된 제2 전류의 제2 제로 크로싱 포인트 값이 약 2.4 인 경우, 제1 제로 크로싱 포인트 값과 제2 제로 크로싱 포인트 값 사이의 시간차(예: 약 0.2 )를 위상 딜레이 값으로 식별하고, 식별된 위상 딜레이 값에 대응된 외부 장치를 식별할 수 있다. 일 실시예에 따른 프로세서는 송신 코일(414-1)의 공진 주파수가 약 50kHz인 경우 외부 장치가 근접한 상태에서 측정된 제1 전류의 제1 제로 크로싱 포인트 값이 약 3.5 이고, 외부 장치가 근접하지 않은 상태에서 측정된 제2 전류의 제2 제로 크로싱 포인트 값이 약 3.3 인 경우, 제1 제로 크로싱 포인트 값과 제2 제로 크로싱 포인트 값 사이의 시간차(예: 약 0.2 )를 위상 딜레이 값으로 식별하고, 식별된 위상 딜레이 값에 대응된 외부 장치를 식별할 수 있다. 일 실시예에 따른 프로세서 는 송신 코일(414-1)의 공진 주파수가 약 45kHz인 경우 외부 장치가 근접한 상태에서 측정된 제1 전류의 제1 제로 크로싱 포인트 값이 약 3.8 이고, 외부 장치가 근접하지 않은 상태에서 측정된 제2 전류의 제2 제로 크로싱 포인트 값이 약 3.5 인 경우, 제1 제로 크로싱 포인트 값과 제2 제로 크로싱 포인트 값 사이의 시간차 (예: 약 0.5 )를 위상 딜레이 값으로 식별하고, 식별된 위상 딜레이 값에 대응된 외부 장치를 식별할 수 있다. 일 실시예에 따른 프로세서는 상기 측정된 제1 전류의 제1 위상과 외부 장치가 근접하지 않은 상태 에서의 제2 전류의 제2 위상 간의 위상 딜레이 값이 지정된 임계값(threshold) 이상(또는 초과)인 경우 외부 장 치가 근접된 상태인 것을 식별할 수 있다. 일 실시예에 따른 프로세서는 상기 측정된 제1 전류의 제1 위상 과 외부 장치가 근접하지 않은 상태에서의 제2 전류의 제2 위상간의 위상 딜레이 값이 지정된 임계값 (threshold) 이상인 상태에서 제1 위상과 제2 위상간의 위상 딜레이 값에 기반하여 외부 장치의 타입을 식별할 수 있다. 일 실시예에 따른 프로세서는 외부 장치들(110-1 내지 110-n) 각각에 대응된 위상 딜레이 값들을 저장하고, 제1 위상과 제2 위상 간의 딜레이 값이 외부 장치들(110-1 내지 110-n) 각각의 위상 딜레이 값들 중 어느 외부 장치의 위상 딜레이 값에 대응되는지를 식별(확인 또는 판단)할 수 있다. 예를 들면, 프로세서 는 제1 위상과 제2 위상 간의 딜레이 값이 외부 장치들(110-1 내지 110-n) 각각에 대한 복수의 위상 딜레이 값 들 중 제1 위상 딜레이 값과 동일하거나 지정된 범위 내에서 유사한 경우 제1 위상 딜레이 값에 대응된 제1 외 부 장치 또는 제1 외부 장치 타입을 식별할 수 있다. 예를 들면, 프로세서는 제1 위상과 제2 위상 간의 딜 레이 값이 외부 장치들(110-1 내지 110-n) 각각의 위상 딜레이 값들 중 제2 위상 딜레이 값과 동일하거나 지정 된 범위 내에서 유사한 경우 제2 위상 딜레이 값에 대응된 제2 외부 장치 또는 제2 외부 장치 타입을 식별할 수 있다. 일 실시예에 따른 인덕션 장치는 식별된 외부 장치 또는 외부 장치 타입에 기반하여 무선 전력 송신 을 수행할 수 있다. 일 실시예에 따른 전력 송신 회로는 프로세서의 제어에 기반하여 무선 전력 송신 전 제1 전력(ping power)을 출력하고, 제1 전력에 의해 감지된 외부 장치에 무선 전력 송신 시 제2 전력을 출력할 수 있다. 일 실시예에 따른 전력 송신 회로는 송신 코일(414-1), 캐패시터(414-3), 인버터(414-5), 정류기(414-7), 교류 전력 생성기(414-9)를 포함할 수 있다. 일 실시예에 따른 교류 전력 생성기(414-9)는 교류 전력을 생성할 수 있다. 일 실시예에 따른 정류기(414-7) 및 인버터(414-5)는 교류 전력을 직류 전력으로 변환할 수 있다. 일 실시예에 따른 송신 코일(414-1) 및 캐패시터(414-3)는 직류 전력을 고주파(RF) 형태로 출력할 수 있다. 일 실시예에 따른 전류 센서는 송신 코일(414-1)에 흐르는 전류를 측정(또는 센싱)할 수 있다. 예를 들면, 전류 센서는 인덕션 장치의 출력 신호의 상태 예를 들면, 제1 전력 출력 중 전류 크기(또는 전압 크 기 또는 전력 크기)를 감지할 수 있다. 예를 들면, 전류 센서는 전력 전송 회로에서 신호를 측정할 수 있다. 예를 들면, 전류 센서는 송신 코일(414-1), 캐패시터(414-3), 인버터(414-5), 정류기(414-7), 및 교 류 전력 생성기(414-9) 중 적어도 일부 영역에서 신호를 측정할 수 있다. 예를 들면 전류 센서는 송신 코 일(414-1) 앞 단에서 신호를 측정하는 회로를 포함할 수 있다. 다양한 실시예에 따르면 인덕션 장치는 전 류 센서 대신 전압 세서 또는 전력 센서를 이용하여 인덕션 장치의 출력 신호의 상태 예를 들면, 제1 전력 출력 중 전류 크기(또는 전압 크기 또는 전력 크기)를 감지할 수도 있다.일 실시예에 따른 통신 모듈(또는 통신 회로)은 외부 장치와 통신할 수 있다. 예를 들면, 통신 모듈 은 무선 전력 송신 시 송신 코일(414-1)에서 전력 전달을 위해 사용하는 주파수와 동일한 주파수를 이용하 여 외부 장치의 통신 모듈과 통신할 수 있다(예: inband 방식). 또는 통신 모듈은 송신 코일 (414-1)에서 전력 전달을 위해 사용하는 주파수와 다른 주파수를 이용하여 외부 장치의 통신 모듈과 통신할 수 있다(예: outband 방식). 예를 들면, 통신 모듈은 outband 방식을 이용하는 경우 Bluetooth, BLE(bluetooth low energy), WI-Fi, NFC(near field communication)와 같은 다양한 근거리 통신 방식 중 어느 하나를 이용하여 외부 장치로부터 외부 장치의 무선 전력 수신 상태와 관련된 정보(예: 전압 정보, 전류 정보, 각종 패킷, 메시지 등)를 획득할 수 있다. 일 실시예에 따르면 외부 장치(예: 도 1의 외부 장치들(110-1 내지 110-n) 중 하나)는 프로세서, 전 력 수신 회로, 통신 모듈을 포함할 수 있다. 일 실시예에 따른 프로세서는 전력 수신 회로 및 통신 모듈을 제어할 수 있다. 일 실시예에 따 른 프로세서는 전력 수신 회로의 스위치(454-7)가 무선 전력 수신 전 오프되고 무선 전력 수신 시(예: 핑 파워 검출에 기반하여 무선 전력 수신 시작 시) 온되도록 제어할 수 있다. 예를 들면, 프로세서(45 2)는 사용자의 전원 온 또는 오프 입력 또는 동작 시작 또는 종료 입력에 기반하여 스위치(454-7)의 온 또는 오 프를 제어하거나 지정된 조건(예: 전원 오프 상태에서 인덕션 장치와의 공진 발생에 의해 측정되는 전압 또는 전류가 지정된 전압 또는 전류 이상이거나 미만인 것) 발생에 기반하여 스위치(454-7)의 온 또는 오프를 제어할 수 있다. 일 실시예에 따른 프로세서는 스위치(454-7)가 온 된 상태에서 전력 수신 회로를 통 한 무선 전력 수신에 따라 수신된 전력을 이용하여 지정된 동작(또는 기능)(예: 블렌더 기능, 케틀 기능, 토스 터 기능)을 수행하도록 제어할 수 있다. 일 실시예에 따른 전력 수신 회로는 수신 코일(454-1), 제1 캐패시터(C1)(454-3), 제2 캐패시터(C2)(454- 5), 스위치(454-7), 로드(454-9)를 포함할 수 있다. 일 실시예에 따른 전력 수신 회로는 프로세서의 제어에 기반하여 무선 전력 수신을 위한 동작 전(또는 무선 전력 수신 전) 스위치(454-7)를 오프하여 수신 코일 (454-1), 제1 캐패시터(C1)(454-3), 및 제2 캐패시터(C2)(454-5)가 로드(454-9)와 연결되지 않도록 할 수 있다. 일 실시예에 따른 전력 수신 회로는 핑 파워가 검출됨에 따라 프로세서의 제어에 기반하여 무 선 전력 수신을 위한 동작 시(또는 무선 전력 수신 시) 스위치(454-7)를 온하여 수신 코일(454-1), 제1 캐패시 터(C1)(454-3), 및 제2 캐패시터(C2)(454-5)가 로드(454-9)와 연결되도록 할 수 있다. 예를 들면, 스위치(454- 7)가 오프된 상태에서는 수신 코일(454-1), 제1 캐패시터(C1)(454-3), 및 제2 캐패시터(C2)(454-5)가 인덕션 장치와의 공진에 참여할 수 있고, 스위치(454-7)가 온된 상태에서는 수신 코일(454-1), 제1 캐패시터 (C1)(454-3), 제2 캐패시터(C2)(454-5), 및 로드(454-9)가 인덕션 장치와의 공진에 참여할 수 있다. 일 실시예에 따른 통신 모듈(또는 통신 회로)는 인덕션 장치의 통신 모듈와 통신할 수 있다. 예 를 들면, 통신 모듈은 무선 전력 송신 시 송신 코일(414-1)에서 전력 전달을 위해 사용하는 주파수와 동일 한 주파수를 이용하여 인덕션 장치의 통신 모듈과 통신할 수 있다(예: inband 방식). 또는 통신 모듈 은 송신 코일(414-1)에서 전력 전달을 위해 사용하는 주파수와 다른 주파수를 이용하여 인덕션 장치 의 통신 모듈과 통신할 수 있다(예: outband 방식). 예를 들면, 통신 모듈은 outband 방식을 이용하 는 경우 Bluetooth, BLE(bluetooth low energy), WI-Fi, NFC(near field communication)와 같은 다양한 근거리 통신 방식 중 어느 하나를 이용하여 인덕션 장치에 무선 전력 수신 상태와 관련된 정보(예: 전압 정보, 전 류 정보, 각종 패킷, 메시지 등)를 전송할 수 있다. 일 실시예에 따르면 인덕션 장치는 메모리(미도시)를 더 포함할 수 있으며, 메모리(미도시)는 프로세서 의 동작을 위한 프로그램(또는 인스트럭션들) 및 데이터들을 저장하고, 외부 장치들(110-1 내지 110-n) 각 각에 대응된 위상 딜레이 값들을 저장할 수 있다. 다양한 실시예에 따르면, 인덕션 장치(예: 도 1의 무선 전력 송신 장치 또는 도 4의 인덕션 장치)는 무선 전력 송신 회로(예: 도 4의 무선 전력 송신 회로, 전류 센서(예: 도 4의 전류 센서, 및 상기 무 선 전력 송신 회로 및 상기 전류 센서와 연결된 프로세서(예: 도 4의 프로세서를 포함하고, 상기 프로세서 는 상기 무선 전력 송신 회로를 통해 외부 장치의 감지를 위한 제1 전력을 출력하고, 상기 제1 전력 출력 중 상 기 전류 센서를 이용하여 상기 무선 전력 송신 회로의 송신 코일에 흐르는 제1 전류를 측정하여 상기 제1 전류 의 제1 위상을 식별하고, 상기 제1 전류의 제1 위상과 외부 장치가 근접하지 않은 상태에서의 제2 전류의 제2 위상 간의 위상 딜레이 값을 식별하고, 상기 식별된 위상 딜레이 값이 지정된 임계값 이상인 경우 외부 장치가 근접한 상태를 식별하도록 설정될 수 있다.다양한 실시예에 따르면, 상기 프로세서는 상기 식별된 위상 딜레이 값이 지정된 임계값 이상인 상태에서 상기 식별된 위상 딜레이 값이 제1 위상 딜레이 값인 경우 상기 제1 위상 딜레이 값에 대응된 제1 외부 장치를 식별 하고, 상기 식별된 위상 딜레이 값이 제2 위상 딜레이 값인 경우 상기 제2 위상 딜레이 값에 대응된 제2 외부 장치를 식별하도록 설정될 수 있다. 다양한 실시예에 따르면, 상기 인덕션 장치는 복수의 외부 장치들 각각에 대응된 복수의 위상 딜레이 값들을 저 장하는 메모리를 더 포함할 수 있다. 다양한 실시예에 따르면, 상기 프로세서는 상기 복수의 외부 장치들 각각에 대응된 상기 복수의 위상 딜레이 값 들을 이용하여 상기 복수의 외부 장치들 중 상기 식별된 위상 딜레이 값에 대응된 외부 장치를 식별하도록 설정 될 수 있다. 다양한 실시예에 따르면, 상기 프로세서는 상기 외부 장치가 근접하지 않은 상태에서의 제2 전류의 제2 크로싱 포인트 값과 상기 측정된 상기 제1 전류의 제1 크로싱 포인트 값 사이의 차이를 기반으로 상기 위상 딜레이를 식별하도록 설정될 수 있다. 다양한 실시예에 따르면, 상기 프로세서는 지정된 공진 주파수에 기반하여 상기 무선 전력 송신 회로를 통해 외 부 장치의 감지를 위한 제1 전력을 출력하도록 설정될 수 있다. 다양한 실시예에 따르면, 상기 인덕션 장치는 통신 모듈을 더 포함할 수 있다. 다양한 실시예에 따르면, 상기 통신 모듈은 인밴드 방식 또는 아웃밴드 방식으로 상기 외부 장치와 통신하도록 설정될 수 있다. 다양한 실시예에 따르면, 상기 인덕션 장치는 인덕현 히팅부를 더 포함하고, 상기 프로세서는 상기 인덕션 히팅 부와 상기 무선 전력 송신 회로를 각각 제어하도록 설정될 수 있다. 다양한 실시예에 따르면, 상기 인덕션 장치는 입력 모듈을 더 포함하고, 상기 프로세서는 상기 입력 모듈을 통 해 인덕션 히팅을 위한 입력이 수신되면 상기 인덕션 히팅부를 통해 전자기 유도 가열을 수행하도록 설정될 수 있다. 도 5는 일 실시예에 따른 복수의 외부 장치들 각각에 대응된 위상 딜레이의 예를 설명하기 위한 도면이다. 도 5를 참조하면, 일 실시예에 따른 위상 그래프에서 가로축은 시간을 나타내고, 세로축은 위상(phase)을 나타낼 수 있다. 일 실시예에 따르면 인덕션 장치에서 무선 전력 송신 전 제1 전력(예: ping power) 출력 시 외부 장치가 근접하지 않은 상태(기준(stby:stanby))에서 위상이 제1 위상값인 경우 외부 장치 근접 시 외부 장치 타입에 따라 서로 다른 위상 딜레이(phase delay)가 발생할 수 있다. 일 실시예에 따르면 프로세서 는 전력 송신 회로를 통해 제1 전력 출력 중 송신 코일(214-1)로부터 측정된 제1 전류의 제1 위상과 제2 전류의 제2 위상의 차이(위상 딜레이)가 임계값(threshold)을 초과한 상태에서 제1 위상 딜레이를 가 지는 경우 제1 위상값과 제2 위상값간의 제1 위상 딜레이 값에 대응된 제1 외부 장치를 식별할 수 있 다. 일 실시예에 따르면 프로세서는 전력 송신 회로를 통해 제1 전력 출력 중 송신 코일(214-1)로부 터 측정된 제1 전류의 제1 위상과 제2 전류의 제2 위상의 차이(위상 딜레이)가 임계값(threshold)을 초과한 상 태에서 제2 위상 딜레이를 가지는 경우 제2 위상 딜레이 값에 대응된 제2 외부 장치를 식별할 수 있다. 일 실시예에 따르면 프로세서는 제1 전력 출력 중 송신 코일(214-1)로부터 측정된 제1 전류의 제1 위상과 제2 전류의 제2 위상의 차이(위상 딜레이)가 임계값(threshold)을 초과한 상태에서 제3 위상 딜레이를 가지는 경우 제3 위상 딜레이 값에 대응된 제3 외부 장치를 식별할 수 있다. 상기 설명에서는 제1 내지 제3 위상 딜레이 값에 기반하여 제1 내지 제3 외부 장치를 식별하는 예를 들어 설명 하였으나, 다양한 실시예에 따른 프로세서는 더 적은 서로 다른 위상 딜레이값에 기반하여 더 적은 서로 다른 외부 장치를 식별하거나 더 많은 서로 다른 위상 딜레이 값에 기반하여 더 많은 서로 다른 외부 장치의 식 별이 가능할 수 있다. 도 6은 일 실시예에 따른 인덕션 장치에서 외부 장치 감지 동작을 나타낸 흐름도이다. 도 6을 참조하면, 일 실시예에 따른 인덕션 장치(예: 도 1의 인덕션 장치, 또는 도 4의 인덕션 장치(40 0))의 프로세서(예: 도 4의 프로세서)는 610 내지 670 동작 중 적어도 하나의 동작을 수행할 수 있다. 610 동작에서, 일 실시예에 따른 프로세서는는 무선 전력 송신 회로를 통해 외부 장치의 감지를 위한 제1 전력(예: ping power)을 출력할 수 있다. 620 동작에서, 일 실시예에 따른 프로세서는는 전력 송신 회로를 통한 제1 전력 출력 중 전류 센서 를 이용하여 측정된 송신 코일(414-1)에 흐르는 전류(예: 제1 전류)의 제1 위상을 식별할 수 있다. 630 동작에서, 일 실시예에 따른 프로세서는는 측정된 제1 전류의 제1 위상과 제1 전력 출력 중 외부 장치 가 근접하지 않은 상태에서의 제2 전류의 제2 위상을 비교하여 제1 위상과 제2 위상간의 위상 딜레이를 식별할 수 있다. 640 동작에서, 일 실시예에 따른 프로세서는는 상기 측정된 제1 전류의 제1 위상과 외부 장치가 근접하지 않은 상태에서의 제2 전류의 제2 위상 간의 위상 딜레이 값이 지정된 임계값(threshold) 이상(또는 초과)인지 식별할 수 있다. 650 동작에서, 일 실시예에 따른 프로세서는는 제1 위상과 제2 위상 간의 위상 딜레이 값이 지정된 임계값 (threshold) 미만(또는 이하)인 것에 기반하여 외부 장치가 근접되지 않은 상태로 식별하고 종료하거나 620 단 계로 되돌아갈 수 있다. 660 동작에서, 일 실시예에 따른 프로세서는는 제1 위상과 제2 위상 간의 위상 딜레이가 임계값 이상인 것 에 기반하여 외부 장치가 외부 장치가 근접된 상태인 것을 식별할 수 있다. 670 동작에서, 일 실시예에 따른 프로세서는는 외부 장치가 근접한 상태에서 제1 위상과 제2 위상간의 위 상 딜레이 값에 기반하여 외부 장치의 타입을 식별할 수 있다. 일 실시예에 따른 프로세서는 메모리(미도 시)에 저장된 외부 장치들(110-1 내지 110-n) 각각에 대응된 위상 딜레이 값들을 이용하여 제1 위상과 제2 위상 간의 딜레이 값이 외부 장치들(110-1 내지 110-n) 각각의 위상 딜레이 값들 중 어느 외부 장치의 위상 딜레이 값에 대응되는지를 식별(확인 또는 판단)할 수 있다. 예를 들면, 프로세서는 제1 위상과 제2 위상 간의 딜 레이 값이 외부 장치들(110-1 내지 110-n) 각각에 대한 복수의 위상 딜레이 값들 중 제1 위상 딜레이 값과 동일 하거나 지정된 범위 내에서 유사한 경우 제1 위상 딜레이 값에 대응된 제1 외부 장치 또는 제1 외부 장치 타입 을 식별할 수 있다. 예를 들면, 프로세서는 제1 위상과 제2 위상 간의 딜레이 값이 외부 장치들(110-1 내 지 110-n) 각각의 위상 딜레이 값들 중 제2 위상 딜레이 값과 동일하거나 지정된 범위 내에서 유사한 경우 제2 위상 딜레이 값에 대응된 제2 외부 장치 또는 제2 외부 장치 타입을 식별할 수 있다. 일 실시예에 따른 프로세 서는는 식별된 외부 장치 또는 외부 장치 타입에 기반하여 외부 장치에 무선 전력 송신을 수행할 수 있다. 다양한 실시예에 따르면, 인덕션 장치(예: 도 1의 인덕션 장치 또는 도 4의 인덕션 장치)에서 외부 장치 감지 방법은 무선 전력 송신 회로를 통해 외부 장치의 감지를 위한 제1 전력을 출력하는 동작, 상기 제1 전력 출력 중 전류 센서를 이용하여 상기 무선 전력 송신 회로의 송신 코일에 흐르는 제1 전류를 측정하는 동작, 상기 측정된 제1 전류의 제1 위상을 식별하는 동작, 상기 제1 전류의 제1 위상과 외부 장치가 근접하지 않은 상태에서의 제2 전류의 제2 위상 간의 위상 딜레이 값을 식별하는 동작, 및 상기 식별된 위상 딜레이 값이 지정된 임계값 이상인 경우 외부 장치가 근접한 상태를 식별하는 동작을 포함할 수 있다. 다양한 실시예에 따르면, 상기 방법은 상기 식별된 위상 딜레이 값이 지정된 임계값 이상인 상태에서 상기 식별 된 위상 딜레이 값이 제1 위상 딜레이 값인 경우 상기 제1 위상 딜레이 값에 대응된 제1 외부 장치를 식별하는 동작, 및 상기 식별된 위상 딜레이 값이 제2 위상 딜레이 값인 경우 상기 제2 위상 딜레이 값에 대응된 제2 외 부 장치를 식별하는 동작을 더 포함할 수 있다. 다양한 실시예에 따르면, 상기 방법은 복수의 외부 장치들 각각에 대응된 복수의 위상 딜레이 값들을 획득하는 동작을 더 포함할 수 있다. 다양한 실시예에 따르면, 상기 방법은 상기 복수의 외부 장치들 각각에 대응된 상기 복수의 위상 딜레이 값들을 이용하여 상기 복수의 외부 장치들 중 상기 식별된 위상 딜레이 값에 대응된 외부 장치를 식별하는 동작을 더 포함할 수 있다. 다양한 실시예에 따르면, 상기 방법은 상기 외부 장치가 근접하지 않은 상태에서의 제2 전류의 제2 크로싱 포 인트 값과 상기 측정된 상기 제1 전류의 제1 크로싱 포인트 값 사이의 차이를 기반으로 상기 위상 딜레이를 식 별하는 동작을 더 포함할 수 있다. 다양한 실시예에 따르면, 상기 방법에서 지정된 공진 주파수에 기반하여 상기 무선 전력 송신 회로를 통해 외부 장치의 감지를 위한 제1 전력을 출력할 수 있다.다양한 실시예에 따르면, 상기 방법은 인밴드 방식 또는 아웃밴드 방식으로 상기 외부 장치와 통신하는 동작을 더 포함할 수 있다. 다양한 실시예에 따르면, 상기 방법은 인덕션 히팅부를 제어하는 동작을 더 포함할 수 있다. 다양한 실시예에 따르면, 입력 모듈을 통해 인덕션 히팅을 위한 입력이 수신되면 상기 인덕션 히팅부를 통해 전 자기 유도 가열을 수행하는 동작을 더 포함할 수 있다. 도 7은 일 실시예에 따른 송신 코일의 공진 주파수가 45kHz인 경우 외부 장치가 근접하지 않은 상태에서 측정된 전류의 파형과 외부 장치가 근접한 상태에서 측정된 전류의 파형을 나타낸 도면이다. 도 7을 참조하면, 일 실시예에 따른 인덕션 장치(예: 도 1의 인덕션 장치 또는 도 4의 인덕션 장치) 의 프로세서(예: 도 4의 프로세서)는 공진 주파수가 45kHz이고 제1 전력(예: ping power) 출력 중 외부 장치가 근접하지 않은 상태에서 송신 코일(예: 도 4의 송신 코일(414-1))에 흐르는 제2 전류를 측정 하여 제2 전류 파형을 획득할 수 있다. 일 실시예에 따른 제2 전류 파형에 따르면, 공진 주파수가 45kHz이고 제1 전력(예: ping power) 출력 중 외부 장치가 근접하지 않은 상태에서 측정된 제2 전류 의 제2 제로 크로싱 포인트 값이 약 3.5 일 수 있다. 일 실시예에 따른 프로세서는 공진 주파수가 45kHz이고 제1 전력(예: ping power) 출력 중 외부 장치가 근접한 상태에서 송신 코일(예: 도 4의 송신 코일(414-1))에 흐르는 제1 전류를 측정하여 제1 전류 파형을 획득할 수 있다. 일 실시예에 따른 제1 전류 파형에 따르면, 공진 주파수가 45kHz이고 제1 전력(예: ping power) 출력 중 외부 장치가 근접 한 상태에서 측정된 제1 전류의 제1 제로 크로싱 포인트 값이 약 3.8 일 수 있다. 일 실시예에 따른 프로세서는 외부 장치가 근접하지 않은 상태에서 송신 코일(예: 도 4의 송신 코일(414-1))에 흐르는 제2 전류와 외부 장치가 근접한 상태에서 송신 코일(예: 도 4의 송신 코일(414-1))에 흐르는 제1 전류간의 위상 딜레이 값이 0.3 인 것을 식별할 수 있다. 일 실시예에 따른 프로세서는 위상 딜레이 값에 대응된 외부 장치를 식별할 수 있다. 일 실시예에 따르면, 상기 도 7에서는 공진 주파수가 45kHz인 경우의 외부 장치가 근접하지 않은 상태에서 송신 코일 (414-1)에 흐르는 제2 전류와 외부 장치가 근접한 상태에서 송신 코일(414-1)에 흐르는 제1 전류간의 위상 딜레이 값을 예를 들어 설명하였지만, 당업자는 다른 공진 주파수(예: 70kHz 또는 50kHz 또는 이외 다른 공진 주파수)를 이용하는 경우에도 상기 45kHz인 경우와 동일한 원리로 위상 딜레이 값을 식별할 수 있음을 알 수 있을 것이다. 도 8은 일 실시예에 따른 하이브리드 인덕션 장치의 구성도이다. 도 8을 참조하면, 일 실시예에 따른 인덕션 장치(예: 도 1의 인덕션 장치 또는 도 4의 인덕션 장치) 의 일부 또는 전부 구성은 하이브리드(hybrid) 인덕션 장치에 포함되어 구현될 수 있다. 예를 들면, 하이 브리드 인덕션 장치는 외부 장치를 인덕션 히팅하는 동작 및/또는 외부 장치에 무선 전력을 송신하는 동작 을 수행할 수 있는 인덕션 장치일 수 있다. 일 실시예에 따른 하이브리드 인덕션 장치는 전원 회로, 제어 회로(또는 프로세서), 인덕션 히 팅부, 무선 전력 송신부, 통신 모듈, 입력 모듈 및 디스플레이 모듈을 포함하여 구성 될 수 있다. 이에 한정되지 않고, 하이브리드 인덕션 전자 장치는 음향 출력 모듈(미도시), 센서 모듈(미 도시) 및/또는 메모리(미도시)를 더 포함하여 구성될 수 있다. 일 실시예에 따르면, 전원 회로는 외부 전원 공급 장치(미도시)로부터 전원을 공급받고, 각 구성 요소들 (예: 도 8의 전원 회로, 제어 회로(또는 프로세서), 인덕션 히팅부, 무선 전력 송신부, 통 신 모듈, 입력 모듈, 디스플레이 모듈 또는 이외 다른 구성 요소)에서 필요 전압으로 변환하여 각 구성 요소들로 변환된 필요 전압을 인가하도록 구성될 수 있다. 일 실시예에 따르면, 제어 회로는 적어도 하나의 프로세서(예: 도 4의 프로세서)를 포함할 수 있다. 예를 들어, 제어 회로는 마이크로프로세서와 입출력 모듈을 하나의 칩으로 만들어 프로그래밍을 통해 다양 한 '제어' 또는 '연산 작업'이 가능한 MCU(microcontroller unit)를 포함할 있다. 제어 회로는 적어도 하나의 프로세서에 연결된 신호 변환 회로를 포함할 수 있다. 일 실시예에 따르면, 하이브리드 인덕션 장치의 제어 회로는 인덕션 히팅부 및/또는 무선 전력 송신부를 각각 제어할 수 있다. 일 실시예에 따르면, 제어 회로는 인덕션 히팅부 및 무선 전력 송신부가 각각 동시에 동작하도록 제어하거나, 인덕션 히팅부 및 무선 전력 송신부 중 어느 하나가 동작 시 다른 하나가 동작되지 않도록 제어할 수 있다. 일 실시예에 따르면, 제어 회로는 입력 모듈을 통해 사용자 입력 인터페이스에 의해 인덕션 온(가열 시작)(또는 인덕션 히팅 동작)을 위한 입력이 수신되면, 인덕션 히팅부에 전원을 인가하여 동작 상태로 전 환하고, 인덕션 히팅부를 통해 전자기 유도 가열 동작을 수행할 수 있다. 제어 회로는 부하 변화를 검출함에 따라 노출면의 일부 영역에 유도 가열 가능한 조리 기기가 존재하는 것을 식별할 수 있다. 일 실시예에 따르면, 제어 회로는 입력 모듈을 통해 사용자 입력 인터페이스에 의해 무선 전력 전송 을 위한 입력이 수신되거나 외부 장치 감지 이벤트가 수신되면, 무선 전력 송신 전 무선 전력 송신부가 송 신 코일(835-1)을 통해 무선 전력 수신이 가능한 외부 장치의 감지를 위한 제1 전력(예: ping power)를 출력하 도록 제어할 수 있다. 일 실시예에 따른 제어 회로는 전력 송신 회로를 통한 제1 전력 출력 중 전류 센서를 이용하여 측정된 송신 코일(835-1)에 흐르는 전류(예: 제1 전류)의 제1 위상을 식별할 수 있다. 일 실시예에 따른 제어 회로는 측정된 제1 전류의 제1 위상과 제1 전력 출력 중 외부 장치가 근접하지 않은 상태에서의 제2 전류의 제2 위상을 비교하여 제1 위상과 제2 위상간의 위상 딜레이를 식별할 수 있다. 일 실시 예에 따른 제어 회로는 상기 측정된 제1 전류의 제1 위상과 외부 장치가 근접하지 않은 상태에서의 제2 전 류의 제2 위상 간의 위상 딜레이 값이 지정된 임계값(threshold) 이상(또는 초과)인지 식별할 수 있다. 일 실시 예에 따른 제어 회로는 제1 위상과 제2 위상 간의 위상 딜레이 값이 지정된 임계값(threshold) 미만(또는 이하)인 것에 기반하여 외부 장치가 근접되지 않은 상태로 식별할 수 있다. 일 실시예에 따른 제어 회로는 제1 위상과 제2 위상 간의 위상 딜레이가 임계값 이상인 것에 기반하여 외부 장치가 외부 장치가 근접된 상태인 것을 식별할 수 있다. 일 실시예에 따른 제어 회로는 외부 장치가 근접한 상태에서 제1 위상과 제2 위상간 의 위상 딜레이 값에 기반하여 외부 장치의 타입을 식별할 수 있다. 일 실시예에 따른 제어 회로는 외부 장치들(예: 110-1 내지 110-n) 각각에 대응된 위상 딜레이 값들을 저장하고, 제1 위상과 제2 위상 간의 딜레이 값이 외부 장치들(110-1 내지 110-n) 각각의 위상 딜레이 값들 중 어느 외부 장치의 위상 딜레이 값에 대응되는 지를 식별(확인 또는 판단)할 수 있다. 예를 들면, 제어 회로는 제1 위상과 제2 위상 간의 딜레이 값이 외 부 장치들(110-1 내지 110-n) 각각에 대한 복수의 위상 딜레이 값들 중 제1 위상 딜레이 값과 동일하거나 지정 된 범위 내에서 유사한 경우 제1 위상 딜레이 값에 대응된 제1 외부 장치 또는 제1 외부 장치 타입을 식별할 수 있다. 예를 들면, 제어 회로는 제1 위상과 제2 위상 간의 딜레이 값이 외부 장치들(110-1 내지 110-n) 각 각의 위상 딜레이 값들 중 제2 위상 딜레이 값과 동일하거나 지정된 범위 내에서 유사한 경우 제2 위상 딜레이 값에 대응된 제2 외부 장치 또는 제2 외부 장치 타입을 식별할 수 있다. 일 실시예에 따른 제어 회로는 식 별된 외부 장치 또는 외부 장치 타입에 기반하여 외부 장치에 무선 전력 송신을 수행할 수 있다. 일 실시예에 따른 인덕션 히팅부는 인버터 및 코일(예: 유도 코일)을 포함하는 공진 회로를 포 함할 수 있다. 인버터는 제어 회로의 신호 변환 회로에 연결되고, 직류 전압을 교류 전압으로 변환할 수 있다. 인버터는 제어 회로의 제어에 의해 출력 전력 제어를 위해 설정 또는 변경된 주파수(f)에 대응하는 고주파 전류를 공진 회로에 인가할 수 있다. 고주파 전류가 공진 회로의 코일에 인가되고, 하이브리드 인덕션 장치의 노출면의 일부 영역에 유도 가열 가능한 조리 기기가 존재하면, 전자기 유도 가 열 동작을 수행할 수 있다. 일 실시예에 따른 무선 전력 송신부는 제어 회로의 제어에 기반하여 무선 전력 송신 전 제1 전력 (ping power)을 출력하고, 제1 전력에 의해 감지된 무선 전력 수신 장치에 무선 전력 송신 시 제2 전력을 출력 할 수 있다. 일 실시예에 따른 전력 송신부는 송신 코일(835-1), 캐패시터(835-3), 인버터(835-5), 정류기 (835-7), 교류 전력 생성기(835-9)를 포함할 수 있다. 일 실시예에 따른 교류 전력 생성기(835-9)는 교류 전력 을 생성할 수 있다. 일 실시예에 따른 정류기(835-7) 및 인버터(835-5)는 교류 전력을 직류 전력으로 변환할 수 있다. 일 실시예에 따른 송신 코일(835-1) 및 캐패시터(835-3)는 직류 전력을 고주파(RF) 형태로 출력할 수 있 다. 일 실시예에 따른 전류 센서는 송신 코일(835-1)에 흐르는 전류를 측정(또는 센싱)할 수 있다. 예를 들면, 전류 센서는 하이브리드 인덕션 장치의 출력 신호의 상태 예를 들면, 제1 전력 출력 중 전류 크기(또 는 전압 크기 또는 전력 크기)를 감지할 수 있다. 예를 들면, 전류 센서는 전력 전송 회로에서 신호 를 측정할 수 있다. 예를 들면, 전류 센서는 송신 코일(835-1), 캐패시터(835-3), 인버터(835-5), 정류기 (835-7), 및 교류 전력 생성기(835-9) 중 적어도 일부 영역에서 신호를 측정할 수 있다. 예를 들면 전류 센서 는 송신 코일(835-1) 앞 단에서 신호를 측정하는 회로를 포함할 수 있다. 다양한 실시예에 따르면 하이브 리드 인덕션 장치는 전류 센서 대신 전압 세서 또는 전력 센서를 이용하여 하이브리드 인덕션 장치 의 출력 신호의 상태 예를 들면, 제1 전력 출력 중 전류 크기(또는 전압 크기 또는 전력 크기)를 감지할수도 있다. 일 실시예에 따른 통신 모듈은 외부 장치와 통신할 수 있다. 예를 들면, 통신 모듈은 무선 전력 송신 시 송신 코일(835-1)에서 전력 전달을 위해 사용하는 주파수와 동일한 주파수를 이용하여 무선 전력 수신 장치 의 통신 모듈과 통신할 수 있다(예: inband 방식). 또는 통신 모듈은 송신 코일(835-1)에서 전력 전달을 위해 사용하는 주파수와 다른 주파수를 이용하여 무선 전력 수신 장치의 통신 모듈과 통신할 수 있다(예: outband 방식). 예를 들면, 통신 모듈은 outband 방식을 이용하는 경우 Bluetooth, BLE(bluetooth low energy), WI-Fi, NFC(near field communication)와 같은 다양한 근거리 통신 방식 중 어느 하나를 이용하여 무 선 전력 수신 장치로부터 무선 전력 수신 장치의 무선 전력 수신 상태와 관련된 정보(예: 전압 정보, 전류 정보, 각종 패킷, 메시지 등)를 획득할 수 있다. 일 실시예에 따르면, 입력 모듈(또는 사용자 인터페이스)은 하이브리드 인덕션 장치의 기능 조작에 관련된 사용자 입력을 수신하고, 수신된 사용자 입력을 제어 회로로 전달할 수 있다. 입력 모듈은 제 공되는 기능들에 관련된 메뉴(예: 버튼 또는 입력 인터페이스)들을 포함할 수 있다. 하이브리드 인덕션 장치 의 구성요소(예: 제어 회로)에 사용될 명령 또는 데이터를 하이브리드 인덕션 장치의 외부(예: 사용자)로부터 수신할 수 있다. 일 실시예에 따르면, 디스플레이 모듈은 제공되는 기능들에 관련된 메뉴(예: 버튼 또는 입력 인터페이스) 들을 나타내는 객체를 표시할 수 있다. 디스플레이 모듈은 하이브리드 인덕션 장치의 노출면의 일부 영역에 배치될 수 있다. 여기서, 일부 영역은 공진 회로가 배치된 영역과 상이한 영역이다. 디스플레이 모 듈은 인덕션 히팅 기능 및/또는 무선 전력 송신 기능의 수행 및/또는 중단과 관련된 알림 정보를 표시할 수 있다. 디스플레이 모듈은 하이브리드 인덕션 장치에서 제공되는 기능들의 동작 수행에 따른 정보 를 표시할 수 있다. 디스플레이 모듈은 인덕션 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치 를 제어하기 위한 제어 회로를 포함할 수 있다. 일실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있 다. 일 실시예에 따르면, 하이브리드 인덕션 장치의 음향 출력 모듈(미도시)은 음향 신호를 인덕션 전자 장치 의 외부로 출력할 수 있다. 음향 출력 모듈은 제어 회로에 인덕션 히팅 기능 및/또는 무선 전력 송신 기능의 수행 및/또는 중단과 관련된 알림 정보를 음향 신호로 출력할 수 있다. 음향 출력 모듈은 하이브리드 인 덕션 장치에서 제공되는 기능들의 동작 수행에 따른 정보를 음향 신호로 출력할 수 있다. 음향 출력 모듈 은, 예를 들면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반 적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일실시예에 따르면, 리시버 는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 일 실시예에 따르면, 하이브리드 인덕션 장치의 오디오 모듈(미도시)은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일실시예에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리 를 획득하거나, 음향 출력 모듈, 또는 하이브리드 인덕션 장치와 직접 또는 무선으로 연결된 외부 전자 장 치(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다. 일 실시예에 따르면, 하이브리드 인덕션 장치의 센서 모듈(미도시)은 하이브리드 인덕션 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태)를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센 서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 일 실시예에 따르면, 하이브리드 인덕션 장치의 햅틱 모듈(미도시)은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 일 실시예에 따르면, 하이브리드 인덕션 장치의 메모리는, 하이브리드 인덕션 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들 어, 소프트웨어(예: 프로그램 및, 이와 관련된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 일 실시예에 따르면, 제어 회로에 포함된 적어도 하나의 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트 웨어 구성요소)를 제어할 수 있고, 다양한 데이터 처리 또는 연산을 수행할 수 있다. 일실시예에 따르면, 데이 터 처리 또는 연산의 적어도 일부로서, 프로세서는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메모리에 저장할 수 있다. 일실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처 리 장치 또는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래 픽 처리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 인덕션 전자 장치가 메인 프로세서 및 보조 프로세서를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능에 특화되도 록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있다. 이와 같이, 일 실시 예에서는 도 1 의 인덕션 장치, 도 4의 인덕션 장치와 도 8의 하이브리드 인덕션 장치를 통해 인덕션 장치의 주요 구성 요소에 대해 설명하였다. 그러나 다양한 실시 예에서는 도 1, 4, 및 8을 통해 도시된 구성 요소가 모두 필수 구성 요소인 것은 아니며, 도시된 구성 요소보다 많은 구성 요소에 의 해 인덕션 장치가 구현될 수도 있고, 그 보다 적은 구성 요소에 의해 인덕션 장치가 구현될 수도 있다. 또한, 도 1, 4, 및 8을 통해 상술한 인덕션 장치의 주요 구성 요소의 위치는 다양한 실시 예에 따라 변경 가능할 수 있다. 도 9a는 일 실시예에 따른 하이브리드 인덕션 장치의 예를 나타낸 도면이고, 도 9b는 일 실시예에 따른 하이브 리드 인덕션 장치의 노출면에 외부 장치가 놓여진 예를 나타낸 도면이고, 도 9c는 일 실시예에 따른 하이브리드 인덕션 장치의 노출면에 조리 기기가 놓여진 예를 나타낸 도면이다. 도 9a를 참조하면, 일 실시예에 따른 하이브리드 인덕션 장치는 노출면의 적어도 하나의 영역(921 및 /또는 922)을 포함할 수 있으며, 적어도 하나의 영역(921 및/또는 922)은 조리 기기 가열 영역(이하 922를 조리 기기 가열 영역이라고 가정하여 예를 들어 설명함) 및/또는 무선 전력 송신 영역(이하 921을 무선 전력 전송 영 역이라고 가정하여 예를 들어 설명함)을 포함할 수 있다. 일 실시예에 따른 하이브리드 인덕션 장치는 노 출면의 다른 영역에 디스플레이 모듈 및/또는 입력 모듈을 더 포함할 수 있다. 도 9b를 참조하면, 일 실시예에 따른 하이브리드 인덕션 장치의 제어 회로는 무선 전력 송신부 를 이용하여 무선 전력 송신 영역을 통해 외부 장치(예: 무선 전력 수신 장치)의 감지를 위한 제1 전력(예: ping power)를 출력하도록 제어할 수 있다. 일 실시예에 따르면, 제어 회로는 입력 모듈을 통해 사용자 입력 인터페이스에 의해 무선 전력 전송을 위한 입력이 수신되거나 외부 장치 감지 이벤트가 수신 되면, 무선 전력 송신 전 무선 전력 송신부가 송신 코일(835-1)을 통해 무선 전력 수신이 가능한 외부 장 치의 감지를 위한 제1 전력(예: ping power)를 출력하도록 제어할 수 있다. 일 실시예에 따른 제어 회로는 전력 송신 회로를 통한 제1 전력 출력 중 전류 센서를 이용하여 측정된 송신 코일(835-1)에 흐르는 전류(예: 제1 전류)의 제1 위상을 식별할 수 있다. 일 실시예에 따른 제어 회로는 측정된 제1 전류의 제1 위상과 제1 전력 출력 중 외부 장치가 근접하지 않은 상태에서의 제2 전류의 제2 위상을 비교하여 제1 위상과 제2 위상간의 위상 딜레이를 식별할 수 있다. 일 실시예에 따른 제어 회로는 상기 측정된 제1 전류의 제1 위상과 외부 장치가 근접하지 않은 상태에서의 제2 전류의 제2 위상 간의 위상 딜레이 값이 지정된 임계값 (threshold) 이상(또는 초과)인지 식별할 수 있다. 일 실시예에 따른 제어 회로는 제1 위상과 제2 위상 간 의 위상 딜레이 값이 지정된 임계값(threshold) 미만(또는 이하)인 것에 기반하여 외부 장치가 근접되지 않은 상태로 식별할 수 있다. 일 실시예에 따른 제어 회로는 제1 위상과 제2 위상 간의 위상 딜레이가 임계값 이상인 것에 기반하여 외부 장치가 외부 장치가 근접된 상태인 것을 식별할 수 있다. 일 실시예에 따른 제어 회 로는 외부 장치가 근접한 상태에서 제1 위상과 제2 위상간의 위상 딜레이 값에 기반하여 외부 장치의 타입 을 식별할 수 있다. 일 실시예에 따른 제어 회로는 외부 장치들(예: 110-1 내지 110-n) 각각에 대응된 위 상 딜레이 값들을 저장하고, 제1 위상과 제2 위상 간의 딜레이 값이 외부 장치들(110-1 내지 110-n) 각각의 위 상 딜레이 값들 중 어느 외부 장치의 위상 딜레이 값에 대응되는지를 식별(확인 또는 판단)할 수 있다. 예를 들 면, 제어 회로는 제1 위상과 제2 위상 간의 딜레이 값이 외부 장치들(110-1 내지 110-n) 각각에 대한 복수 의 위상 딜레이 값들 중 제1 위상 딜레이 값과 동일하거나 지정된 범위 내에서 유사한 경우 제1 위상 딜레이 값 에 대응된 제1 외부 장치 또는 제1 외부 장치 타입을 식별할 수 있다. 예를 들면, 제어 회로는 제1 위상과 제2 위상 간의 딜레이 값이 외부 장치들(110-1 내지 110-n) 각각의 위상 딜레이 값들 중 제2 위상 딜레이 값과동일하거나 지정된 범위 내에서 유사한 경우 제2 위상 딜레이 값에 대응된 제2 외부 장치 또는 제2 외부 장치 타입을 식별할 수 있다. 일 실시예에 따른 제어 회로는 식별된 외부 장치(예: 무선 전력 수신 장치) (예: 토스터) 또는 외부 장치의 타입에 기반하여 하이브리드 인덕션 장치에 무선 전력(예: 제2 전 력)을 송신하도록 무선 전력 송신부를 제어할 수 있다. 도 9c를 참조하면, 일 실시예에 따른 하이브리드 인덕션 장치의 제어 회로는 입력 모듈을 통해 사용자 입력 인터페이스에 의해 인덕션 온(가열 시작)을 위한 입력이 수신되면, 인덕션 히팅부에 전원을 인가하여 동작 상태로 전환하고, 인덕션 히팅부를 통해 조리 기기 가열 영역에 대한 인덕션 히팅 동 작을 수행하여 외부 장치(예: 조리 기기)를 유도 가열 시킬 수 있다. 본 문서의 다양한 실시예 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한정 하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도 면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개 를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\",\"A 또는 B 중 적어도 하나,\"\"A, B 또는 C,\" \"A, B 및 C 중 적어도 하나,\"및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하 는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위해 사 용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구 성요소가 다른(예: 제 2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로 등의 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부가 될 수 있다. 예를 들 면, 일 실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형태로 구현될 수 있다. 본 문서의 다양한 실시예는 기기(machine)(예: 인덕션 장치(100 또는 400) 또는 하이브리드 인덕션 장치) 에 의해 읽을 수 있는 저장 매체(storage medium)(예: 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프 트웨어(예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 인덕션 장치(100 또는 400) 또는 하이브리드 인덕션 장치)의 프로세서(예: 프로세서 또는 제어회로)는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나 의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것을 가능하게 한다. 상기 하나 이상의 명령어들 은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장매체 는, 비일시적(non-transitory) 저장매체의 형태로 제공될 수 있다. 여기서, ‘비일시적’은 저장매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전자기파)를 포함하지 않는다는 것을 의미할 뿐이 며, 이 용어는 데이터가 저장매체에 반영구적으로 저장되는 경우와 임시적으로 저장되는 경우를 구분하지 않는 다. 일 실시예에 따르면, 본 문서에 개시된 다양한 실시예에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치들(예: 스 마트폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시예에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복 수의 개체를 포함할 수 있다. 다양한 실시예에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또 는 동작들이 생략되거나, 또는 하나 이상의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통 합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수 의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시예에따르면, 모듈, 프로그램 또는 다른 구성요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다. 다양한 실시예에 따르면, 명령들을 저장하고 있는 비휘발성 저장 매체에 있어서, 상기 명령들은 적어도 하나의 프로세서에 의하여 실행될 때에 상기 적어도 하나의 프로세서로 하여금 적어도 하나의 동작을 수행하도록 설정 된 것으로서, 상기 적어도 하나의 동작은, 무선 전력 송신 회로를 통해 외부 장치의 감지를 위한 제1 전력을 출 력하는 동작, 상기 제1 전력 출력 중 전류 센서를 이용하여 상기 무선 전력 송신 회로의 송신 코일에 흐르는 제 1 전류를 측정하는 동작, 상기 측정된 제1 전류의 제1 위상을 식별하는 동작, 상기 제1 전류의 제1 위상과 외부 장치가 근접하지 않은 상태에서의 제2 전류의 제2 위상 간의 위상 딜레이 값을 식별하는 동작, 및 상기 식별된 위상 딜레이 값이 지정된 임계값 이상인 경우 외부 장치가 근접한 상태를 식별하는 동작을 포함할 수 있다. 그리고 본 명세서와 도면에 발명된 본 발명의 실시예들은 본 발명의 실시예에 따른 기술 내용을 쉽게 설명하고 본 발명의 실시예의 이해를 돕기 위해 특정 예를 제시한 것일 뿐이며, 본 발명의 실시예의 범위를 한정하고자 하는 것은 아니다. 따라서 본 발명의 다양한 실시예의 범위는 여기에 발명된 실시예들 이외에도 본 발명의 다양 한 실시예의 기술적 사상을 바탕으로 도출되는 모든 변경 또는 변형된 형태가 본 발명의 다양한 실시예의 범위 에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2022-0007092", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 따른 인덕션 장치와 외부 장치들을 나타낸 도면이다. 도 2는 일 실시예에 따른 인덕션 장치에 외부 장치가 근접하지 않은 경우와 인덕션 장치에 외부 장치가 근접한 경우를 나타낸 도면이다. 도 3은 일 실시예에 따른 인덕션 장치에서 송신 코일을 통해 ping power 출력 시 외부 장치가 근접하지 않은 상 태와 근접한 상태 각각에서 송신 코일에 흐르는 전류를 나타낸 그래프이다. 도 4는 일 실시예에 따른 인덕션 장치와 외부 장치의 구성을 나타낸 도면이다. 도 5는 일 실시예에 따른 복수의 외부 장치들 각각에 대응된 위상 딜레이의 예를 설명하기 위한 도면이다. 도 6은 일 실시예에 따른 인덕션 장치에서 외부 장치 감지 동작을 나타낸 흐름도이다.도 7은 일 실시예에 따른 송신 코일의 공진 주파수가 45kHz인 경우 외부 장치가 근접하지 않은 상태에서 측정된 전류의 파형과 외부 장치가 근접한 상태에서 측정된 전류의 파형을 나타낸 도면이다. 도 8은 일 실시예에 따른 하이브리드 인덕션 장치의 구성도이다. 도 9a는 일 실시예에 따른 하이브리드 인덕션 장치의 예를 나타낸 도면이다. 도 9b는 일 실시예에 따른 하이브리드 인덕션 장치의 노출면에 외부 장치가 놓여진 예를 나타낸 도면이다. 도 9c는 일 실시예에 따른 하이브리드 인덕션 장치의 노출면에 조리 기기가 놓여진 예를 나타낸 도면이다. 도면의 설명과 관련하여, 동일 또는 유사한 구성요소에 대해서는 동일 또는 유사한 참조 부호가 사용될 수 있다."}
