{"patent_id": "10-2024-7034627", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0160223", "출원번호": "10-2024-7034627", "발명의 명칭": "O-CLOUD 노드 언커든", "출원인": "라쿠텐 모바일 가부시키가이샤", "발명자": "루트라 모히트"}}
{"patent_id": "10-2024-7034627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "방법으로서,개방형 무선 액세스 네트워크(open radio access network)(O-RAN) 클라우드(O-Cloud) 노드의 배치가능 상태를변경하라는 요청을 수신하는 단계;상기 요청을 수신하는 것에 응답하여 상기 O-Cloud 노드의 배치가능 상태를 변경하는 단계; 및상기 배치가능 상태를 변경하는 것에 응답하여 상기 O-Cloud 노드의 배치가능 상태가 수정되었다는 표시를 송신하는 단계를 포함하는, 방법."}
{"patent_id": "10-2024-7034627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 O-Cloud 노드의 배치가능 상태를 변경하는 단계는 상기 배치가능 상태를 커든된 상태(cordoned state)로부터 언커든된 상태(uncordoned state)로 변경하는 단계를 포함하는, 방법."}
{"patent_id": "10-2024-7034627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 O-Cloud 노드는 애플리케이션, 워크로드, 또는 네트워크 기능 중 적어도 하나를 상기 커든된 상태로 배치할 수 없고,상기 O-Cloud 노드는 상기 애플리케이션, 상기 워크로드, 또는 상기 네트워크 기능 중 적어도 하나를 상기 언커든된 상태로 배치할 수 있는, 방법."}
{"patent_id": "10-2024-7034627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 O-Cloud 노드의 배치가능 상태를 변경하는 단계는 상기 O-Cloud 노드의 배치가능 상태를표시하는 플래그 또는 마커에 관련된 정보를 변경하는 단계를 포함하는, 방법."}
{"patent_id": "10-2024-7034627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 수신하는 단계, 상기 변경하는 단계, 및 상기 송신하는 단계는 O-Cloud 플랫폼의 인프라스트럭처 관리 서비스들(infrastructure management services)(IMS)에 의해 수행되는, 방법."}
{"patent_id": "10-2024-7034627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 O-Cloud 노드의 배치가능 상태를 변경하라는 요청을 수신하는 단계는 사용자 단말 또는비실시간 무선 액세스 네트워크 지능형 제어기(non-real-time radio access network intelligentcontroller)(NRT-RIC) 중 적어도 하나로부터 상기 요청을 수신하는 단계를 포함하는, 방법."}
{"patent_id": "10-2024-7034627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 상기 요청은 계산 부하의 증가의 결정에 응답하여 수신되는, 방법."}
{"patent_id": "10-2024-7034627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "방법으로서,개방형 무선 액세스 네트워크(O-RAN) 클라우드(O-Cloud) 노드의 배치가능 상태를 변경하라는 요청을 송신하는단계를 포함하고, 상기 요청은, 상기 O-Cloud 노드의 배치가능 상태가, 상기 O-Cloud 노드가 애플리케이션, 워크로드, 또는 네트워크 기능 중 적어도 하나를 배치할 수 없는 커든된 상태로부터, 상기 O-Cloud 노드가 상기공개특허 10-2024-0160223-3-애플리케이션, 상기 워크로드, 또는 상기 네트워크 기능 중 적어도 하나를 배치할 수 있는 언커든된 상태로 변경되게 하는, 방법."}
{"patent_id": "10-2024-7034627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서, 상기 배치가능 상태가 상기 언커든된 상태로 변경되었다는 표시를 수신하는 단계를 추가로 포함하는, 방법."}
{"patent_id": "10-2024-7034627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 표시를 수신하는 단계는 상기 O-Cloud 노드의 배치가능 상태가 상기 언커든된 상태에 있음을 표시하는 업데이트된 플래그 또는 마커에 관련된 정보를 수신하는 단계를 포함하는, 방법."}
{"patent_id": "10-2024-7034627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항에 있어서,배치가능 상태 변경 표시들을 수신하기 위한 가입을 완료하는 단계, 및상기 배치가능 상태 변경 표시들을 수신하기 위한 상기 가입을 완료한 것에 기초하여 상기 배치가능 상태가 상기 언커든된 상태로 변경되었다는 표시를 수신하는 단계를 추가로 포함하는, 방법."}
{"patent_id": "10-2024-7034627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제8항에 있어서, 상기 요청을 송신하는 단계는 사용자 단말 또는 비실시간 무선 액세스 네트워크 지능형 제어기(NRT-RIC) 중 적어도 하나로부터 상기 요청을 송신하는 단계를 추가로 포함하는, 방법."}
{"patent_id": "10-2024-7034627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제8항에 있어서, 상기 요청을 송신하는 단계는 SMO(service management and orchestration) 프레임워크의FOCOM(federated O-Cloud orchestration and management) 컴포넌트에 상기 요청을 송신하는 단계를 추가로 포함하는, 방법."}
{"patent_id": "10-2024-7034627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제8항에 있어서, 상기 FOCOM은 상기 커든된 상태로부터 상기 언커든된 상태로의 변경을 수행하는 O-Cloud 플랫폼의 인프라스트럭처 관리 서비스(IMS)와 통신하는, 방법."}
{"patent_id": "10-2024-7034627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "장치로서,컴퓨터 프로그램 코드를 저장하도록 구성된 적어도 하나의 메모리; 및상기 적어도 하나의 메모리에 액세스하고 상기 컴퓨터 프로그램 코드에 의해 명령된 대로 동작하도록 구성된 적어도 하나의 프로세서를 포함하고, 상기 컴퓨터 프로그램 코드는:상기 적어도 하나의 프로세서 중 적어도 하나로 하여금 개방형 무선 액세스 네트워크(O-RAN) 클라우드(O-Cloud)노드의 배치가능 상태를 변경하라는 요청을 수신하게 하도록 구성된 수신 코드;상기 적어도 하나의 프로세서 중 적어도 하나로 하여금 상기 요청을 수신하는 것에 응답하여 상기 O-Cloud 노드의 배치가능 상태를 변경하게 하도록 구성된 변경 코드; 및상기 적어도 하나의 프로세서 중 적어도 하나로 하여금 상기 배치가능 상태를 변경하는 것에 응답하여 상기 O-Cloud 노드의 배치가능 상태가 수정되었다는 표시를 송신하게 하도록 구성된 송신 코드를 포함하는, 장치."}
{"patent_id": "10-2024-7034627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서, 상기 변경 코드는 상기 적어도 하나의 프로세서 중 적어도 하나로 하여금 상기 배치가능 상태를 커든된 상태로부터 언커든된 상태로 변경하게 하도록 추가로 구성되는, 장치.공개특허 10-2024-0160223-4-청구항 17 제16항에 있어서,상기 O-Cloud 노드는 애플리케이션, 워크로드, 또는 네트워크 기능 중 적어도 하나를 상기 커든된 상태로 배치할 수 없고,상기 O-Cloud 노드는 상기 애플리케이션, 상기 워크로드, 또는 상기 네트워크 기능 중 적어도 하나를 상기 언커든된 상태로 배치할 수 있는, 장치."}
{"patent_id": "10-2024-7034627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제15항에 있어서,상기 수신 코드는 상기 적어도 하나의 프로세서 중 적어도 하나로 하여금 O-Cloud 플랫폼의 인프라스트럭처 관리 서비스(IMS) 컴포넌트에 의해 상기 요청을 수신하게 하도록 추가로 구성되고,상기 변경 코드는 상기 적어도 하나의 프로세서 중 적어도 하나로 하여금 상기 IMS를 사용하여 상기 배치가능상태를 변경하게 하도록 추가로 구성되고,상기 송신 코드는 상기 적어도 하나의 프로세서 중 적어도 하나로 하여금 상기 IMS로부터 상기 표시를 송신하게하도록 추가로 구성되는, 장치."}
{"patent_id": "10-2024-7034627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제15항에 있어서, 상기 변경 코드는 상기 적어도 하나의 프로세서 중 적어도 하나로 하여금 상기 O-Cloud 노드의 배치가능 상태를 표시하는 플래그 또는 마커에 관련된 정보를 변경하게 하도록 추가로 구성되는, 장치."}
{"patent_id": "10-2024-7034627", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제15항에 있어서, 상기 요청은 계산 부하의 증가의 결정에 응답하여 수신되는, 장치."}
{"patent_id": "10-2024-7034627", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "방법은 개방형 무선 액세스 네트워크(O-RAN) 클라우드(O-Cloud) 노드의 배치가능 상태를 변경하라는 요청을 수신 하는 단계, 요청을 수신하는 것에 응답하여 O-Cloud 노드의 배치가능 상태를 변경하는 단계, 및 배치가능 상태를 변경하는 것에 응답하여 O-Cloud 노드의 배치가능 상태가 수정되었다는 표시를 송신하는 단계를 포함한다."}
{"patent_id": "10-2024-7034627", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "관련 출원(들)에 대한 교차 참조 본 출원은 2022년 8월 25일자로 싱가포르 특허청에 출원된 싱가포르 가특허 출원 제10202250829N호에 기초하며 그로부터의 우선권을 주장하고, 그 개시내용 전체가 본 명세서에 참조로 통합된다."}
{"patent_id": "10-2024-7034627", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 2, "content": "기술분야 본 개시내용의 예시적인 실시예들에 따른 시스템들, 방법들, 및 장치들은 개방형 무선 액세스 네트워크들(Open Radio Access Networks)(O-RAN)에 관한 것이고, 더 구체적으로는, 하나 이상의 O-RAN 클라우드(O-Cloud) 노드 를 언커든(uncordon)하는 데 사용되는 시스템들, 방법들, 및 장치들에 관한 것이다."}
{"patent_id": "10-2024-7034627", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "O-RAN 기술의 개발 전에, 무선 액세스 네트워크(radio access network)(RAN)는 무선(radio) 및 기저대역 유닛 들 사이의 독점적 인터페이스들에 의존하는 \"폐쇄형\" 시스템들을 사용하였으며, 이는 서비스 제공자가 무선 및 기저대역 유닛 벤더들을 다양화하는 능력을 제한하였다. 고객들에게 무선 서비스를 제공하기 위해, 서비스 제 공자는 특정 벤더를 선택하고 그 벤더의 장비에 상당한 투자를 하도록 요구되었다. 한 벤더로부터 다른 벤더로 변경하는 것은 서비스 제공자들에게 부담스럽고 종종 비용이 많이 드는 옵션이었다. 이러한 저해 요소들은 새 로운 벤더들에 대한 진입 장벽들을 생성하였고, 그에 의해, 기존 벤더들이 높은 가격을 유지할 수 있게 하였으 며, 이는 궁극적으로 서비스 제공자의 고객들이 흡수하게 되었다. 추가적으로, 단일 공급자에 크게 의존하는 서비스 제공자들은 그 공급자의 소프트웨어에 대한 잠재적인 보안 위반들과 연관된 사이버보안 위험들에 노출될 수 있다. O-RAN 기술은 이러한 이전의 독점 인터페이스들 및 프로토콜들을 \"개방\"함으로써, 서비스 제공자들에게 더 많은 벤더 선택권, 배치 옵션들의 증가된 유연성, 및 자동화, 분석, 및 네트워크 슬라이싱과 같은 새로운 능력들을제공한다. O-RAN 기술은 진입 장벽들을 제거하고, 공급자 경쟁을 증가시키고, 혁신을 촉진하고, 민첩한 다중 벤더 배치를 가능하게 하고, 서비스 공급자들에 대한 장비 비용을 낮추고(따라서 서비스 공급자의 고객들을 위 한 비용을 감소시키고), 사이버보안 위험들을 감소시킨다. O-RAN 기술의 이러한 이점들에도 불구하고, 관련 기술의 O-RAN 기술은 여전히 문제들을 겪고 있다. 특히, 현재 의 O-RAN 기술은 O-Cloud 노드들을 언커든(uncordon)하기 위한 효율적인 방식을 제공하지 못했다. 그러한 부적절함들을 해결하기 위한 개선들이 본 명세서에 제시된다. 이러한 개선들은 또한, 다른 기술들 및 이러한 기술들을 채용하는 전기통신 표준들에 적용가능할 수 있다. 다음은 본 개시내용의 하나 이상의 실시예의 간략화된 개요를 제시하여, 그러한 실시예들의 기본적인 이해를 제 공한다. 본 개요는 모든 고려되는 실시예들의 철저한 개관은 아니고, 모든 실시예들의 핵심적인 또는 중요한 요소들을 식별하는 것도, 임의의 또는 모든 실시예들의 범위를 묘사하는 것도 의도하지 않는다. 그것의 유일한 목적은, 본 개시내용의 하나 이상의 실시예의 일부 개념들을 나중에 제시되는 더 상세한 설명에 대한 서두로서 단순화된 형태로 제시하는 것이다. 예시적인 실시예에 따르면, 방법은 O-Cloud 노드의 배치가능 상태를 변경하라는 요청을 수신하는 단계를 포함한 다. 방법은 요청을 수신하는 것에 응답하여 O-Cloud 노드의 배치가능 상태를 변경하는 단계를 포함한다. 방법 은 배치가능 상태를 변경하는 것에 응답하여 O-Cloud 노드의 배치가능 상태가 수정되었다는 표시를 송신하는 단 계를 추가로 포함한다. 예시적인 실시예에 따르면, 방법은 O-Cloud 노드의 배치가능 상태를 변경하라는 요청을 송신하는 단계를 포함하 고, 요청은, O-Cloud 노드의 배치가능 상태가, O-Cloud 노드가 애플리케이션, 워크로드, 또는 네트워크 기능 중 적어도 하나를 배치할 수 없는 커든된 상태로부터, O-Cloud 노드가 애플리케이션, 워크로드, 또는 네트워크 기 능 중 적어도 하나를 배치할 수 있는 언커든된 상태로 변경되게 한다. 예시적인 실시예에 따르면, 개방형 무선 액세스 네트워크(O-RAN) 내의 장치가 제공되며, 장치는 컴퓨터 프로그 램 코드를 저장하도록 구성되는 적어도 하나의 메모리, 및 적어도 하나의 메모리에 액세스하고 컴퓨터 프로그램 코드에 의해 명령된 바와 같이 동작하도록 구성되는 적어도 하나의 프로세서를 포함한다. 컴퓨터 프로그램 코 드는 적어도 하나의 프로세서 중 적어도 하나로 하여금 O-Cloud 노드의 배치가능 상태를 변경하라는 요청을 수 신하게 하도록 구성되는 수신 코드를 포함한다. 컴퓨터 프로그램 코드는 적어도 하나의 프로세서 중 적어도 하 나로 하여금 요청을 수신하는 것에 응답하여 O-Cloud 노드의 배치가능 상태를 변경하게 하도록 구성되는 변경 코드를 포함한다. 컴퓨터 프로그램 코드는 적어도 하나의 프로세서 중 적어도 하나로 하여금 배치가능 상태를 변경하는 것에 응답하여 O-Cloud 노드의 배치가능 상태가 수정되었다는 표시를 송신하게 하도록 구성되는 송신 코드를 추가로 포함한다. 추가적인 실시예들은 뒤따르는 설명에 제시될 것이고, 부분적으로, 설명으로부터 명백할 것이고/거나, 본 개시 내용의 제시된 실시예들의 실시에 의해 학습될 수 있다."}
{"patent_id": "10-2024-7034627", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "예시적인 실시예들의 이하의 상세한 설명은 첨부 도면들을 참조한다. 상이한 도면들에서의 동일한 참조 번호들 은 동일하거나 유사한 요소들을 식별할 수 있다. 전술한 개시내용은 예시 및 설명을 제공하지만, 포괄적이거나 구현들을 개시된 정확한 형태로 제한하도록 의도 되지 않는다. 수정들 및 변형들이 위의 개시내용에 비추어 가능하거나 구현들의 실시로부터 획득될 수 있다. 또한, 일 실시예의 하나 이상의 특징 또는 컴포넌트는 다른 실시예(또는 다른 실시예의 하나 이상의 특징)에 통 합되거나 이와 조합될 수 있다. 추가적으로, 아래에 제공되는 동작들의 흐름도들 및 설명들에서, 하나 이상의 동작이 생략될 수 있고, 하나 이상의 동작이 추가될 수 있고, 하나 이상의 동작이 (적어도 부분적으로) 동시에 수행될 수 있고, 하나 이상의 동작의 순서가 전환될 수 있다는 것이 이해된다. 본 명세서에 설명된 시스템들 및/또는 방법들은 하드웨어, 펌웨어, 또는 하드웨어와 소프트웨어의 조합의 상이 한 형태들로 구현될 수 있다는 것이 명백할 것이다. 이러한 시스템들 및/또는 방법들을 구현하는 데 사용되는 실제 특수화된 제어 하드웨어 또는 소프트웨어 코드는 구현들을 제한하지 않는다. 따라서, 시스템들 및/또는 방법들의 동작 및 거동은 특정 소프트웨어 코드에 대한 참조 없이 본 명세서에 설명되었다-소프트웨어 및 하드 웨어가 본 명세서에서의 설명에 기초하여 시스템들 및/또는 방법들을 구현하도록 설계될 수 있다는 점이 이해된 다. 특징들의 특정 조합들이 청구항들에 나열되고/되거나 명세서에 개시될지라도, 이러한 조합들은 가능한 구현들의 개시를 제한하도록 의도되지 않는다. 실제로, 이러한 특징들 중 다수는 청구항들에 구체적으로 나열되지 않고/ 않거나 명세서에 개시되지 않은 방식들로 조합될 수 있다. 아래에 나열된 각각의 종속 청구항은 단지 하나의 청구항에 직접 의존할 수 있지만, 가능한 구현들의 개시는 청구항 세트 내의 모든 다른 청구항과 조합하여 각각 의 종속 청구항을 포함한다. 본 명세서에서 사용되는 어떠한 요소, 동작, 또는 명령어도 그와 같이 명시적으로 설명되지 않는 한 중요하거나 필수적인 것으로 해석되지 않아야 한다. 또한, 본 명세서에서 사용되는 바와 같이, 관사들(\"a\" 및 \"an\")은 하 나 이상의 항목을 포함하도록 의도되고, \"하나 이상\"과 상호교환가능하게 사용될 수 있다. 하나의 항목만이 의 도되는 경우, 용어 \"하나\" 또는 유사한 언어가 사용된다. 또한, 본 명세서에서 사용되는 바와 같이, \"갖는다 (has)\", \"갖는다(have)\", \"갖는(having)\", \"포함한다(include)\", \"포함하는(including)\" 등의 용어들은 개방형 용어들인 것으로 의도된다. 또한, \"기초하여(based on)\"라는 구절은 명백히 달리 언급되지 않는 한, \"적어도 부분적으로 기초하여\"를 의미하도록 의도된다. 게다가, [A] 및 [B] 중 적어도 하나\" 또는 \"[A] 또는 [B] 중 적 어도 하나\"와 같은 표현은, A만, B만, 또는 A와 B 둘 다를 포함하는 것으로 이해되어야 한다. 본 명세서 전체에 걸쳐 \"일 실시예\", \"실시예\", 또는 유사한 언어에 대한 언급은 표시된 실시예와 관련하여 설 명된 특정 특징, 구조, 또는 특성이 본 해결책의 적어도 하나의 실시예에 포함된다는 것을 의미한다. 따라서, 본 명세서 전체에 걸쳐 문구들 \"일 실시예에서\", \"실시예에서\" 및 유사한 언어는 모두 동일한 실시예를 지칭할 수 있지만, 반드시 그런 것은 아니다. 또한, 본 개시내용의 설명된 특징들, 이점들, 및 특성들은 하나 이상의 실시예에서 임의의 적합한 방식으로 조"}
{"patent_id": "10-2024-7034627", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "합될 수 있다. 관련 기술분야의 통상의 기술자는, 본 명세서에서의 설명에 비추어, 본 개시내용이 특정 실시예 의 특정 특징들 또는 이점들 중 하나 이상 없이 실시될 수 있다는 것을 인식할 것이다. 다른 경우들에서, 본 개시내용의 모든 실시예들에서 존재하지는 않을 수 있는 추가적인 특징들 및 이점들이 특정 실시예들에서 인식 될 수 있다. 본 개시내용의 실시예들은 하나 이상의 O-Cloud 노드들을 언커든하는 데 사용되는 시스템들, 방법들, 및 장치들 에 관한 것이다. 도 1은 본 개시내용의 시스템들, 방법들, 및 장치들을 구현하기 위한 예시적인 디바이스(10 0)의 도면이다. 디바이스는 본 명세서에 개시된 응용들 중 임의의 응용뿐만 아니라, 임의의 O-RAN RIC, 및 임의의 인공 지능/머신 학습(Artificial Intelligence/Machine Learning)(AI/ML) 프레임워크를 구현할 수 있다. 디바이스는 임의의 타입의 알려진 컴퓨터, 서버, 또는 데이터 처리 디바이스에 대응할 수 있다. 예를 들어, 디바이스는 프로세서, 개인용 컴퓨터(PC), 컴퓨팅 디바이스를 포함하는 인쇄 회로 보드(PCB), 미니-컴퓨터, 메인프레임 컴퓨터, 마이크로컴퓨터, 전화 컴퓨팅 디바이스(telephonic computing device), 유선/ 무선 컴퓨팅 디바이스(예를 들어, 스마트폰, PDA(personal digital assistant)), 랩톱, 태블릿, 스마트 디바이 스, 또는 임의의 다른 유사한 기능을 하는 디바이스를 포함할 수 있다. 일부 실시예들에서, 도 1에 도시된 바와 같이, 디바이스는 프로세서, 메모리, 저장 컴포넌트 , 입력 컴포넌트, 출력 컴포넌트, 및 통신 인터페이스와 같은 컴포넌트들의 세트를 포함할 수 있다.버스는 디바이스의 컴포넌트들의 세트 사이의 통신을 허가하는 하나 이상의 컴포넌트를 포함할 수 있 다. 예를 들어, 버스는 통신 버스, 크로스-오버 바(cross-over bar), 네트워크 등일 수 있다. 버스 가 도 1에서 단일 라인으로서 묘사되지만, 버스는 디바이스의 컴포넌트들의 세트 사이의 다수의 (2개 이상의) 연결들을 사용하여 구현될 수 있다. 본 개시내용은 이와 관련하여 제한되지 않는다. 디바이스는 프로세서와 같은 하나 이상의 프로세서를 포함할 수 있다. 프로세서는 하드웨어, 펌웨어, 또는 하드웨어와 소프트웨어의 조합으로 구현될 수 있다. 예를 들어, 프로세서는 중앙 처리 유닛 (CPU), 그래픽 처리 유닛(GPU), 가속 처리 유닛(APU), 마이크로프로세서, 마이크로제어기, 디지털 신호 프로세 서(DSP), 필드 프로그램가능 게이트 어레이(FPGA), 주문형 집적 회로(ASIC), 범용 단일 칩 또는 다중 칩 프로세 서, 또는 다른 프로그램가능 로직 디바이스, 이산 게이트 또는 트랜지스터 로직, 이산 하드웨어 컴포넌트들, 또 는 본 명세서에 설명된 기능들을 수행하도록 설계된 이들의 임의의 조합을 포함할 수 있다. 범용 프로세서는 마이크로프로세서, 또는 임의의 종래의 프로세서, 제어기, 마이크로제어기, 또는 상태 머신일 수 있다. 프로세 서는 또한 DSP와 마이크로프로세서의 조합, 복수의 마이크로프로세서, DSP 코어와 결합된 하나 이상의 마 이크로프로세서, 또는 임의의 다른 그러한 구성과 같은 컴퓨팅 디바이스들의 조합으로서 구현될 수 있다. 일부 실시예들에서, 특정 프로세스들 및 방법들은 주어진 기능에 특정한 회로에 의해 수행될 수 있다. 프로세서는 디바이스 및/또는 디바이스의 컴포넌트들의 세트(예를 들어, 메모리, 저장 컴 포넌트, 입력 컴포넌트, 출력 컴포넌트, 및 통신 인터페이스)의 전반적인 동작을 제어할 수 있다. 디바이스는 메모리를 추가로 포함할 수 있다. 일부 실시예들에서, 메모리는 랜덤 액세스 메모 리(RAM), 판독 전용 메모리(ROM), 전기적 소거가능 프로그램가능 ROM(EEPROM), 플래시 메모리, 자기 메모리, 광 학 메모리, 및/또는 다른 타입의 동적 또는 정적 저장 디바이스를 포함할 수 있다. 메모리는 프로세서 에 의한 사용(예를 들어, 실행)을 위한 정보 및/또는 명령어들을 저장할 수 있다. 디바이스의 저장 컴포넌트는 디바이스의 동작 및 사용에 관련된 정보 및/또는 컴퓨터 판독가능 명령어들 및/또는 코드를 저장할 수 있다. 예를 들어, 저장 컴포넌트는, 대응하는 드라이브와 함께, 하드 디스크(예를 들어, 자기 디스크, 광학 디스크, 광자기 디스크(magneto-optic disk), 및/또는 고체 상태 디스크 (solid state disk)), CD(compact disc), DVD(digital versatile disc), USB(universal serial bus) 플래시 드라이브, PCMCIA(Personal Computer Memory Card International Association) 카드, 플로피 디스크, 카트리지, 자기 테이프, 및/또는 다른 타입의 비일시적 컴퓨터 판독가능 매체를 포함할 수 있다. 디바이스는 입력 컴포넌트를 추가로 포함할 수 있다. 입력 컴포넌트는 디바이스가 예컨대 사용자 입력을 통해 정보를 수신하는 것을 허용하는 하나 이상의 컴포넌트(예를 들어, 터치 스크린, 키보드, 키 패드, 마우스, 스타일러스, 버튼, 스위치, 마이크로폰, 카메라 등)를 포함할 수 있다. 대안적으로 또는 추가적 으로, 입력 컴포넌트는 정보를 감지하기 위한 센서(예를 들어, GPS(global positioning system) 컴포넌트, 가속도계, 자이로스코프, 액추에이터 등)를 포함할 수 있다. 디바이스의 출력 컴포넌트는 디바이스로부터의 출력 정보를 제공할 수 있는 하나 이상의 컴포넌 트(예를 들어, 디스플레이, LCD(liquid crystal display), LED(light-emitting diode)들, OLED(organic light emitting diode)들, 햅틱 피드백 디바이스, 스피커 등)를 포함할 수 있다. 디바이스는 통신 인터페이스를 추가로 포함할 수 있다. 통신 인터페이스는 수신기 컴포넌트, 송신기 컴포넌트, 및/또는 송수신기 컴포넌트를 포함할 수 있다. 통신 인터페이스는 디바이스가 다 른 디바이스들(예를 들어, 서버, 또 다른 디바이스)과의 연결들을 확립하고/하거나 통신들을 전달하는 것을 가 능하게 할 수 있다. 통신들은 유선 연결, 무선 연결, 또는 유선 및 무선 연결들의 조합을 통해 실시될 수 있다. 통신 인터페이스는 디바이스가 다른 디바이스로부터 정보를 수신하고/하거나 다른 디바이스에 정보를 제공하는 것을 허용할 수 있다. 일부 실시예들에서, 일부 실시예들에서, 통신 인터페이스는 LAN(local area network), WAN(wide area network), MAN(metropolitan area network), 사설 네트워크, 애드 혹 네트워크, 인트라넷, 인터넷, 광섬유 기반 네트워크, 셀룰러 네트워크(예를 들어, 5세대(5G) 네트워크, 롱 텀 에볼루션(LTE) 네트워크, 3세대(3G) 네트워크, CDMA(code division multiple access) 네트워크 등), PLMN(public land mobile network), 전화 네트워크(예를 들어, PSTN(Public Switched Telephone Network)), 또 는 이와 유사한 것, 및/또는 이러한 또는 다른 타입들의 네트워크들의 조합과 같은 네트워크를 통해 다른 디바 이스와의 통신들을 제공할 수 있다. 대안적으로 또는 추가적으로, 통신 인터페이스는 FlashLinQ, WiMedia, Bluetooth, ZigBee, Wi-Fi, LTE, 5G 등과 같은 디바이스-대-디바이스(D2D) 통신 링크를 통해 다른 디바이스와의 통신들을 제공할 수 있다. 다른 실시예들에서, 통신 인터페이스는 이더넷 인터페이스, 광학 인터페이스, 동축 인터페이스, 적외선 인터페이스, RF(radio frequency) 인터페이스 등을 포함할 수 있다. 디바이스는 코어 네트워크에 포함될 수 있고, 본 명세서에 설명된 하나 이상의 프로세스를 수행할 수 있다. 디바이스는 프로세서가 메모리 및/또는 저장 컴포넌트와 같은 비일시적 컴퓨터 판 독가능 매체에 의해 저장될 수 있는 컴퓨터 판독가능 명령어들 및/또는 코드를 실행하는 것에 기초하여 동작들 을 수행할 수 있다. 컴퓨터 판독가능 매체는 비일시적 메모리 디바이스를 지칭할 수 있다. 메모리 디바이스는 단일 물리적 저장 디바이스 내의 메모리 공간 및/또는 다수의 물리적 저장 디바이스들에 걸쳐 확산된 메모리 공 간을 포함할 수 있다. 컴퓨터 판독가능 명령어들 및/또는 코드는 통신 인터페이스를 통해 다른 컴퓨터 판독가능 매체로부터 또는 다른 디바이스로부터 메모리 및/또는 저장 컴포넌트 내로 판독될 수 있다. 메모리 및/또는 저 장 컴포넌트에 저장된 컴퓨터 판독가능 명령어들 및/또는 코드는, 프로세서에 의해 실행되는 경우 또 는 실행될 때, 디바이스로 하여금 본 명세서에 설명된 하나 이상의 프로세스를 수행하게 할 수 있다. 대안적으로 또는 추가적으로, 하드와이어드 회로가 본 명세서에서 설명되는 하나 이상의 프로세스를 수행하기 위해 소프트웨어 명령어들 대신에 또는 이와 조합하여 사용될 수 있다. 따라서, 본 명세서에 설명된 실시예들 은 하드웨어 회로와 소프트웨어의 임의의 특정 조합으로 제한되지 않는다. 도 1에 도시된 컴포넌트들의 수 및 배열은 예로서 제공된다. 실제로, 도 1에 도시된 것들에 추가적인 컴포넌트 들, 그보다 더 적은 컴포넌트들, 그와 상이한 컴포넌트들, 또는 그와 상이하게 배열된 컴포넌트들이 있을 수 있 다. 또한, 도 1에 도시된 둘 이상의 컴포넌트가 단일 컴포넌트 내에 구현될 수 있거나, 도 1에 도시된 단일 컴 포넌트가 다수의 분산형 컴포넌트들로서 구현될 수 있다. 추가적으로 또는 대안적으로, 도 1에 도시된 (하나 이상의) 컴포넌트의 세트는 도 1에 도시된 컴포넌트들의 다른 세트에 의해 수행되는 것으로서 설명된 하나 이상 의 기능을 수행할 수 있다. 도 2는 본 개시내용의 다양한 실시예들에 따른 예시적인 O-RAN 통신 시스템을 예시하는 도면이다. O-RAN 통신 시스템은 하나 이상의 사용자 장비(UE), 하나 이상의 기지국(220a)을 포함하는 하나 이상의 O- RAN 무선 유닛(O-RAN Radio Unit)(O-RU), 하나 이상의 O-RAN 분배 유닛(O-RAN Distribution Unit)(O- DU), 및 하나 이상의 O-RAN 중앙집중형 유닛(O-RAN Centralized Unit)(O-CU)을 포함할 수 있다. UE들의 예들은 셀룰러폰, 스마트폰, SIP(session initiation protocol) 폰, 랩톱, PDA(personal digital assistant), 위성 라디오(satellite radio), GPS(global positioning system), 멀티미디어 디바이스, 비디오 디바이스, 디지털 오디오 플레이어(예를 들어, MP3 플레이어), 카메라, 게임 콘솔, 태블릿, 스마트 디바이스, 웨어러블 디바이스, 차량, 전기 계량기(electric meter), 가스 펌프, 대형 또는 소형 주방 기기, 헬스케어 디바 이스, 임플란트, 센서/액추에이터, 디스플레이, 또는 임의의 다른 유사하게 기능하는 디바이스를 포함할 수 있 다. 하나 이상의 UE 중 일부는 사물 인터넷(IoT) 디바이스들(예를 들어, 파킹 미터, 가스 펌프, 토스터, 차량, 심장 모니터 등)로 지칭될 수 있다. 하나 이상의 UE는 또한 스테이션, 이동국, 가입자국, 이동 유 닛, 가입자 유닛, 무선 유닛, 원격 유닛, 이동 디바이스, 무선 디바이스, 무선 통신 디바이스, 원격 디바이스, 이동 가입자국, 액세스 단말, 이동 단말, 무선 단말, 원격 단말, 핸드셋, 사용자 에이전트, 이동 에이전트, 클 라이언트, 또는 일부 다른 적합한 용어로 지칭될 수 있다. O-RU의 하나 이상의 기지국(220A)은 하나 이상의 UE와 무선으로 통신할 수 있다. 하나 이상의 기지 국(220A)의 각각의 기지국은 그 기지국(220A)의 지리적 커버리지 영역 내에 위치된 하나 이상의 UE에 통신 커버리지를 제공할 수 있다. 일부 실시예들에서, 도 2에 도시된 바와 같이, 기지국(220A)은 하나 이상의 빔형 성된 신호를 하나 이상의 송신 방향으로 하나 이상의 UE에 송신할 수 있다. 하나 이상의 UE는 하나 이상의 수신 방향으로 기지국(220A)으로부터 빔형성된 신호들을 수신할 수 있다. 대안적으로 또는 추가적으로, 하나 이상의 UE는 빔형성된 신호들을 하나 이상의 송신 방향으로 기지국에 송신할 수 있다. 기지국 (220A)은 하나 이상의 수신 방향으로 하나 이상의 UE로부터 빔형성된 신호들을 수신할 수 있다. 하나 이상의 기지국(220A)은 매크로셀들(예를 들어, 고전력 셀룰러 기지국들) 및/또는 소형 셀들(예를 들어, 저 전력 셀룰러 기지국들)을 포함할 수 있다. 소형 셀들은 펨토셀들, 피코셀들, 및 마이크로셀들을 포함할 수 있 다. 매크로셀이든 대형 셀이든, 기지국(220A)은 액세스 포인트(AP), 진화된(또는 진화된 범용 지상 무선 액세"}
{"patent_id": "10-2024-7034627", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "스 네트워크(E-UTRAN)) 노드 B(eNB), 차세대 노드 B(gNB), 또는 본 기술분야의 통상의 기술자에게 알려진 임의 의 다른 타입의 기지국을 포함할 수 있고/있거나 그것으로 지칭될 수 있다.일부 실시예들에서, O-RU는 FH 링크를 통해 O-DU에 연결될 수 있다. FH 링크는, 사용자 평면(User Plane)(U-평면) 및 제어 평면(Control Plane)(C-평면) 패킷들이 O-DU로부터 O-RU로 다운 로드되는 25 Gbps 라인일 수 있다. 일부 실시예들에서, O-DU는 미드홀(midhaul) 링크를 통해 O- CU에 연결될 수 있다. O-CU는 O-CU 제어 평면(O-CU-CP) 패킷 생성기(240A) 및 O-CU 사용자 평면(O- CU-UP) 패킷 생성기(240B)를 포함할 수 있다. C-평면 및 U-평면 패킷들은 각각 O-CU-CP 패킷 생성기(240A) 및 O-CU-UP 패킷 생성기(240B)로부터 유래할 수 있다. 이러한 컴포넌트들은 전기통신 시스템의 무선 액세스 네트 워크(RAN)가 하나 이상의 UE를 네트워크의 다른 부분들에 연결할 수 있게 한다. O-RAN 통신 시스템은 O-CU, O-DU, 및 O-RU를 통해 RAN 기능들을 분해(disaggregate)할 수 있다. O-CU는 RAN의 RRC(Radio Resource Control), SDAP(Service Data Adaptation Protocol), 및/또는 PDCP(Packet Data Convergence Protocol) 부계층들을 호스팅하기 위한 논리적 노드일 수 있다. O-DU는 RAN의 RLC(Radio Link Control), MAC(Media Access Control), 및 PHY(Physical) 부계층들을 호스팅하는 논리적 노드일 수 있다. O-RU는, 안테나들로부터의 무선 신호들을, 프론트홀(FrontHaul)을 통해 O-DU에 송 신될 수 있는 디지털 신호들로 변환하는 물리적 노드일 수 있다. 도 3은 본 명세서에 설명된 기법들의 구현에서 사용될 수 있는 예시적인 네트워크 아키텍처를 예시한다. 네트워크 아키텍처는, 예를 들어, O-RU, O-DU, O-CU-CP(340A), O-CU-UP(340B), 및 서비스 관리 및 오케스트레이션(service management and orchestration)(SMO)을 포함할 수 있다. O-RAN 아키텍처 에서의 RAN 기능들은 하나 이상의 무선 액세스 네트워크 지능형 제어기(RIC)에 의해 제어되고 최적화될 수 있다. RIC는, O-RAN 시스템에서 요구되는 멀티벤더 동작성을 용이하게 하도록 모듈식 애플리케이션들을 구현하고, RAN 동작들을 자동화하고 최적화하는 소프트웨어-정의된 컴포넌트(software-defined component)이다. RIC는 2가지 타입: 비실시간 RIC(non-real-time RIC)(NRT-RIC) 및 근실시간 RIC(near-real-time RIC)(nRT-RIC)로 나뉜다. NRT-RIC는 비실시간 제어 루프의 제어점이며, 서비스 관리 및 오케스트레이션(Service Management and Orchestration)(SMO) 프레임워크 내에서 1초보다 큰 시간 척도에서 동작한다. 그것의 기능성들은 rApp들이라고 불리는 모듈식 애플리케이션들을 통해 구현된다. 기능성들은: NRT-RIC와 nRT-RIC 사이의 통신을 가 능하게 하는 인터페이스인 A1 인터페이스에 걸친 지침 및 풍부화(enrichment)에 기초하여 정책(즉, 하나 이상의 관리되는 객체의 상태의 변경 및/또는 유지를 관리하고 제어하는 데 사용되는 규칙들의 세트)을 제공하는 것 (A1 정책은 SMO 내의 NRT-RIC가 nRT-RIC, 그리고 따라서 RAN을 RAN 의도의 더 나은 충족을 향 해 안내할 수 있게 하는 공식적 스테이트먼트를 사용하여 표현되는 선언적 정책들의 타입일 수 있음); 데이터 분석을 수행하는 것; RAN 최적화를 위한 인공 지능/머신 학습(Artificial Intelligence/Machine Learning)(AI/ML) 훈련 및 추론; 및/또는 SMO를 RAN 관리 요소들(예를 들어, nRT-RIC, O-CU- CP(340A), O-CU-UP(340B), O-DU 등)에 연결하는 인터페이스인, 운영 및 유지보수(operation and maintenance)(OAM)를 관리하기 위한 O1 인터페이스를 통해 구성 관리 액션들을 추천하는 것을 포함한다. nRT-RIC는 RAN의 에지에 위치되고, 10 밀리초 내지 1 초의 시간 척도에서 동작한다. nRT-RIC는 E2 인터페이스를 통해 O-DU, O-CU-CP(340A), O-CU-UP(340B), 및 개방형 진화된 NodeB(open evolved NodeB)(O-eNB)(도시되지 않음)에 연결된다. nRT-RIC는 근실시간 제어 루프를 통해 기저의 RAN 요소들(E2 노드들/네트워크 기능들(NF들))을 제어하기 위해 E2 인터페이스를 사용한다. nRT-RIC는 정책들을 통해 E2 노드들(O-CU-CP, O-CU-UP, O-DU, 및 O-eNB)을 모니터링, 중단/정지, 오버라이드, 및 제어하며, O-DU는, 제어 사용자 동기화(Control User Synchronization)(CUS) 평면 및 관리(Management)(M) 평면을 포함하는 프론트홀 (FrontHaul)을 통해 O-RU에 연결된다. 예를 들어, nRT는 E2 노드들의 활성화된 기능들에 대한 정책 파라 미터들을 설정한다. 또한, nRT-RIC는 서비스 품질(QoS) 최적화, 이동성 최적화, 슬라이싱 최적화, 간섭 완화, 부하 균형화, 보안 등과 같은 기능들을 구현하기 위해 xApp들을 호스팅한다. 2가지 타입의 RIC는 O- RAN을 최적화하기 위해 함께 작동한다. 예를 들어, NRT-RIC는, A1 인터페이스를 통해, RAN 최적화를 위해 nRT-RIC에 의해 시행되고 사용되는 정책들, 데이터, 및 AI/ML 모델들을 제공하고, nRT는 정책 피드백(즉, NRT-RIC에 의해 설정된 정책이 어떻게 작동하는지)을 반환한다. SMO 프레임워크는 RAN 요소들을 관리하고 오케스트레이션한다. 구체적으로, SMO는 FOCOM(Federated O-Cloud Orchestration and Management), 가상 머신(VM) 기반 VNF(Virtual Network Function)(도시되지 않음)와 컨테이너(즉, 인스턴스)(도시되지 않음) 기반 VNF를 관리하는 NFO(Network Function Orchestrator), 및 O-Ran 클라우드(O-Cloud)로 지칭되는 것을 관리하고 오케스트레이션하 는 SMO의 일부로서의 OAM을 포함한다. O-Cloud는 RIC들, O-CU들, 및 O-DU들을 호스팅하는 물리적 RAN 노드들, 지원 소프트웨어 컴포넌트들(예를 들어, 운영 체제들 및 런타임 환경들), 및 SMO 자체의 컬렉션이다. 다시 말해서, SMO는 내부로부터의 O-Cloud를 관리한다. O2 인터페이스는 SMO와 그것이 상주하는 O-Cloud 사이의 인터페이스이다. O2 인터페이스를 통해, SMO는 인프라스트럭처 관 리 서비스(IMS) 및 배치 관리 서비스(DMS)를 제공한다. NRT-RIC는 RAN 최적화 정책(즉, RAN 의도를 충족시키기 위한 RAN 최적화를 위한 A1 정책)을 생성할 수 있 다. 다음으로, NRT-RIC는 그 정책을 A1 인터페이스를 통해 nRT-RIC에 전달할 수 있다(즉, A1 정 책). A1 정책을 수신하면, nRT-RIC는 정책의 구현을 위한 제어들을 수행하고 그 정책에 따라 제어 루프에 서 수행할 수 있다. 언급된 바와 같이, 도 3은 본 명세서에 설명된 기법들의 구현에서 사용될 수 있는 예시적인 시스템 아키텍처 를 제공한다. 특히, 예를 들어, O-Cloud의 노드가 일부 종류의 유지보수를 요구할 때, 드레인 (drain) 커맨드 및/또는 커든(cordon) 커맨드가 실행될 수 있다. 드레인 커맨드는 노드에 대해 유지보수가 수 행되기 전에 노드로부터 포드들(pods) 또는 인스턴스들을 안전하게 제거, 축출, 또는 이송할 수 있다. 예를 들 어, 드레인은 노드의 모든 포드들을 삭제할 수 있다(그러나, \"미러 포드들(mirror pods)\"을 삭제하지 않는 예외 가 있을 수 있다). 드레인 커맨드가 특정 노드에 대해 실행된 후에, 노드는 \"커든된\" 것으로 말할 수 있다. 노드가 드레인된 또는 커든된 상태에 있을 때, 노드는 라이브(live) 상태일 수 있지만, 프로세스들 또는 포드들 의 스케줄링, 배치들, 인스턴스화들 등에 이용가능하지 않을 수 있다. 노드가 커든되면, 커든된 노드에 대해 새로운 인스턴스들 또는 포드들이 생성될 수 없지만, 유지보수(예를 들어, 네트워크 인터페이스 카드를 변경하 거나 물리적 메모리 하드웨어를 추가하는 것과 같은 하드웨어 유지보수)는 여전히 그 노드에 대해 수행될 수 있 다. 일부 실시예들에서, 노드가 커든되면, 그러한 노드와 연관된 \"테인트(taint)\"가 있을 수 있다. 일부 실시예들에서, 커든 커맨드는 관심 노드에 새로운 포드들 또는 인스턴스들이 스케줄링되지 않는 것을 보장 할 수 있다. 즉, 커든 커맨드의 실행은 노드를 계획불가능 또는 스케줄링불가능 상태에 둘 수 있다. 커든 커 맨드는 관심 노드에 새로운 포드들 또는 인스턴스들이 스케줄링되지 않는 것을 보장하는 데 사용될 수 있다. 관심 노드는, 노드가 유지보수를 위해 준비 중일 때, 계획불가능 또는 스케줄링불가능 상태에 놓일 수 있다. 노드가 계획불가능 상태에 있을 때, 노드에 대해 유지보수가 수행될 수 있도록 포드들 또는 인스턴스들을 관심 노드에서 벗어나게 이동시키기 위해 다른 커맨드들이 사용될 수 있다. 일부 실시예들에서, 커든 커맨드를 실행 하는 것은 관심 노드 상에 배열된 모든 포드들을 제거한다. 이와 같이, 스케줄러는 제거된 포드들/인스턴스들 을 새로운 및/또는 대안적인 노드들 상에 나열할 수 있다. 일부 실시예들에서, 복수의 노드들(예를 들어, 노드 클러스터)은 순차적으로 또는 동시에 드레인 또는 커든될 수 있다. 일부 실시예들에서, 노드는 노드가 드레인/ 드레인된 또는 커든/커든된 상태에 있다고 마킹되거나, 플래깅되거나, 또는 그렇지 않으면 일부 표시자를 부여 받을 수 있다. 노드에 대한 유지보수가 완료된 후에, 언커든 커맨드는 다시 노드의 스케줄링을 허용할 수 있다. 일부 실시예 들에서, 노드의 유지보수가 수행된 후에, 노드가 노드 상의 워크로드 배치들을 재개할 수 있도록 노드는 언커든 되어야 한다. 하나 이상의 노드에 대한 언커든 커맨드의 실행 후에, 포드들 또는 인스턴스들이 그러한 노드들 에 대해 스케줄링될 수 있고, 포드들 또는 인스턴스들이 그러한 노드들에 추가되거나 그러한 노드들 상에 배열 될 수 있다. 도 3을 참조하면, SMO는 하나 이상의 O-Cloud 노드를 언커든하는 데 사용될 수 있다. SMO를 사용하여 하나 이상의 O-Cloud 노드를 언커든하는 프로세스는 수동 프로세스 또는 자동 프로세스 중 어느 하나에 의해 트리거되거나, 활성화되거나, 발생하도록 야기될 수 있다. O-Cloud 노드가 언커든된 후에, 네트워크 기능(NF) 배치들 또는 애플리케이션 배치들이 그 노드 상에서 재개될 수 있다. 예를 들어, 하나 이상 의 및/또는 하나 이상의 VNF 배치(및/또는 물리적 네트워크 기능(PNF))는 언커든된 노드 상에서 재개될 수 있다. 일부 실시예들에서, 복수의 노드들(예를 들어, 노드 클러스터)은 순차적으로 또는 동시에 언커든될 수 있다. 일부 실시예들에서, 노드가 언커든 또는 언커든된 상태에 있음을 표시하기 위해 일부 종류의 마크, 플래 그, 또는 다른 표시자가 추가되거나 제거될 수 있다. 도 4a 및 도 4b는 각각 예시적인 O-Cloud 결정 프로세스에 수반되는 동작들 및 예시적인 O-Cloud 노드 언 커든 프로세스에 수반되는 동작들을 예시한다. 도 4a 및 도 4b에 도시된 바와 같이, 한 명 이상의 담당자 (예를 들어, 클라우드 유지관리자), SMO, 및 O-Cloud 플랫폼이 있을 수 있다. SMO 는 NRT-RIC 및 FOCOM을 가질 수 있고, O-Cloud 플랫폼은 IMS를 가질 수 있다. O-Cloud 결정 프로세스 및/또는 O-Cloud 노드 언커든 프로세스 전에, 시스템은 하나 이상의 예비 프 로세스를 수행할 수 있다. 예를 들어, 시스템은 SMO 및/또는 O-Cloud 플랫폼이 이용가능한지를 결정하는 예비 프로세스를 수행할 수 있다. 일부 실시예들에서, SMO 및 O-Cloud 플랫폼이 이용가능하다 고(예를 들어, 액세스가능한 충분한 계산 자원들을 가짐) 결정이 되면, 시스템은 O-Cloud 결정 프로세스 및 O-Cloud 노드 언커든 프로세스로 진행한다. 대안적으로, 이 프로세스는 생략될 수 있고, SMO 및 O-Cloud 플랫폼이 이용가능하다고 가정될 수 있다. 추가적으로 또는 대안적으로, 시스템은 O1 및 O2 이벤 트들이 클라우드 유지관리자, NRT-RIC, 또는 둘 다에 의해 가입되었는지를 결정하는 예비 프로세스를 수행할 수 있다. 일부 실시예들에서, O1 및/또는 O2 이벤트 가입들이 있다고 결정이 되면, 시스템은 O-Cloud 결정 프로세스 및 O-Cloud 노드 언커든 프로세스로 진행한다. 도 4a의 O-Cloud 노드 결정 프로세스는 동작 또는 동작 중 어느 하나 또는 둘 다를 포함할 수 있다. 동작에서, 클라우드 유지관리자는 하나 이상의 O-Cloud 노드를 언커든하기로 결정할 수 있다. 일부 실시예들에서, 클라우드 유지관리자가 하나 이상의 O-Cloud 노드를 언커든하기로 결정하는 것은 사람 또는 사람들의 그룹에 의해 수행되는 수동 프로세스이다. 또한, 클라우드 유지관리자는 SMO로부터 통지들을 수신할 수 있고, 클라우드 유지관리자는 통지들을 수신하기 위해 가입된 결과로서 그러한 통지들 을 수신할 수 있다. 클라우드 유지관리자는 수신된 통지들(예를 들어, O1 데이터, O2 원격측정 데이터 등)에 기초하여 결정을 할 수 있다. 동작에서, NRT-RIC는, 예를 들어, rApp 사용 사례에 기초하여, O-Cloud 노드들을 언커든하기로 결정 할 수 있다. 일부 실시예들에서, NRT-RIC가 O-Cloud 노드들을 언커든하기로 결정하는 것은 인간 상호작용 이 거의 내지 전혀 수반되지 않는 자동화된 프로세스이다. 일부 실시예들에서, SMO는, 언커든될 O-Cloud 노드(들)의 하나 이상의 식별자(또는 식별 데이터)를 포함할 수 있는 서비스 요청을 수신할 수 있다. SMO(42 0)는 수신된 식별 데이터를 사용하여 하나 이상의 O-Cloud 노드 중 어느 것을 언커든할지를 식별할 수 있다. 추가적으로 또는 대안적으로, 프로세스는 어느 O-Cloud 노드(들)가 언커든될지는 물론, 그러한 O-Cloud 노드(들)가 언커든될 때에 관한 결정을 하는 데에 있어서 다른 기준들 또는 사전프로그래밍 조건들을 사용할 수 있다. 예를 들어, 결정 프로세스는, 훈련 데이터를 사용하여 훈련될 수 있는 하나 이상의 AI/ML 알고리즘을 사 용할 수 있고; 결정 프로세스는 (예를 들어, O1 데이터, O2 원격측정 데이터 등과 같은 입력 데이터에 기초하여) O-Cloud 노드(들)가 언제 언커든될지 그리고 어느 O-Cloud 노드(들)가 언커든될지에 관한 결정을 하 기 위해 훈련된 AI/ML 알고리즘들을 사용할 수 있다. 클라우드 유지관리자 및/또는 NRT-RIC가 하나 이상의 O-Cloud 노드가 언커든되어야 한다고 결정하는 경우 및 결정할 때, O-Cloud 노드 언커든 프로세스 가 수행될 수 있다. 일부 실시예들에서, NRT-RIC는 시스템 상에 증가된 계산 부하가 존재한다고 결정할 때 하나 이상의 O- Cloud 노드를 언커든하라고 요청할 수 있고, 따라서 증가된 계산 부하를 다루기 위해 추가적인 애플리케이션들 의 배치들이 필요할 수 있다. NRT-RIC는, 예를 들어, 현재 네트워크 트래픽, 네트워크 트래픽 패턴들을 분석함으로써, 또는 이력 네트워크 트래픽 데이터를 통해, 증가된 계산 부하(또는 증가된 CPU 사용량 또는 증가 된 CPU 수요)의 그러한 결정을 할 수 있다. 일부 실시예들에서, NRT-RIC는 증가된 계산 수요들에 신속하 게 응답하기 위해 계산 부하들을 주기적으로 평가한다. 하나 이상의 O-Cloud 노드가 언커든될 것을 요청함으로 써, 후속하여 언커든된 O-Cloud 노드들은 증가된 계산 부하를 다루기 위해 추가적인 애플리케이션들을 배치하는 데 사용될 수 있다. 일부 실시예들에서, O-Cloud 노드들이 유지보수를 완료했더라도, O-Cloud 노드들은, 시스템이, 그러한 O-Cloud 노드들이 계산 수요의 실제 또는 예상된 증가를 다루는 데 필요하다는 결정을 내릴 때까지, 언커든된 상태로 유 지될 수 있다. O-Cloud 노드들을 언커든된 상태로 유지함으로써, 시스템은 에너지 및 계산 자원들을 보존할 수 있어, 실제 또는 예상되는 네트워크 트래픽에 기초하여 적절한 개수의 O-Cloud 노드들을 사용하도록 시스템 성 능을 최적화할 수 있다. O-Cloud 노드들의 이러한 동적 할당은, 시스템이 네트워크 트래픽이 낮을 때는 에너지 를 보존하고, 네트워크 트래픽이 높을 때는 자원 할당을 늘릴 수 있게 하여, 최적의 에너지 절약으로 고품질 네 트워크 성능을 가능하게 하는 시스템을 제공한다. 도 4b의 O-Cloud 노드 결정 프로세스는 요청 동작으로 시작할 수 있다. 요청 동작에서, 클라우 드 유지관리자, NRT-RIC, 또는 둘 다로부터의 요청이 있을 수 있다. 특히, 동작에서, 클라우드 유지관리자는 하나 이상의 O-Cloud 노드를 언커든하라는 요청을 용이하게 할 수 있다. 동작의 요청 은 클라우드 유지관리자에 의해 동작되는 단말(도시되지 않음)로부터 FOCOM으로 전송될 수 있다. 추 가적으로 또는 대안적으로, 동작에서, NRT-RIC는 하나 이상의 O-Cloud 노드를 언커든하라는 요청을 용이하게 할 수 있다. 일부 실시예들에서, 하나 이상의 rApp는 하나 이상의 O-Cloud 노드를 언커든하라는 요청 을 송신하기 위해 NRT-RIC를 사용할 수 있다. 동작의 요청은 RT-RIC로부터 FOCOM으로 전송될 수 있다. 일부 실시예들에서, NRT-RIC 및/또는 클라우드 유지관리자는 하나 이상의 O-Cloud 노드가 커든 상태 에 있는 동안 원격측정 데이터를 수신할 수 있다. 수신된 원격측정 데이터는, O-Cloud 노드들이 유지보수를 완 료하여 O-Cloud 노드들이 언커든되도록 이용가능한지 여부를 결정하기 위해 NRT-RIC 및/또는 클라우드 유 지관리자에 의해 사용될 수 있다. 추가적으로 또는 대안적으로, NRT-RIC 및/또는 클라우드 유지관리 자는 하나 이상의 O-Cloud 노드가 유지보수를 완료하여 O-Cloud 노드들이 언커든되도록 이용가능한지 여부 를 결정하기 위해 사용될 수 있는 문제해결 데이터(troubleshooting data)를 수신할 수 있다. 일부 실시예들에 서, NRT-RIC 및/또는 클라우드 유지관리자는, O-Cloud 노드가 유지보수를 완료했고 언커든되도록 이 용가능하다는 결정을 내리거나 그러한 표시를 수신한 후에야 그러한 O-Cloud 노드를 언커든하라는 요청이 이루 어지도록 요구될 수 있다. 하나 이상의 기존 O-Cloud 노드가 (클라우드 유지관리자에 의해 또는 NRT-RIC를 통한 rApp들에 의해) 언커든되어야 한다는 결정이 이루어지면, FOCOM이 O-Cloud 노드(들)의 특정된 세트를 언커든하도록 트리거 할 수 있다. FOCOM이 하나 이상의 O-Cloud 노드를 언커든하라는 하나 이상의 요청을 수신하는 것에 응답 하여, 시스템은 FOCOM이 수신된 요청(들)에서 식별된 하나 이상의 O-Cloud 노드를 언커든하기 위한 프로세 스를 용이하게 하는 동작을 수행할 수 있다. SMO는 자체적으로 O-Cloud 노드를 언커든하기 위한 프 로세스를 수행할 수 없을 수 있으므로, SMO는 O-Cloud 노드를 언커든하기 위해 IMS와 상호작용할 필 요가 있을 수 있다. FOCOM은 구체적으로 O2 인터페이스를 사용해서 O-Cloud 플랫폼의 IMS와 통신하여 하나 이상의 O-Cloud 노드를 언커든할 수 있다. 예를 들어, FOCOM은 O2 IMS 서비스들을 사용하 여 하나 이상의 O-Cloud 노드를 언커든할 수 있다. 동작은 클라우드 유지관리자 또는 NRT-RIC 중 어느 하나 또는 둘 다로부터의 다수의 요청에 대해 반복될 수 있다. FOCOM이 IMS와 통신하는 것에 응답하여, 시스템은 IMS가 O-Cloud 노드(들)를 언커든하라는 하 나 이상의 요청을 처리하는 동작을 수행할 수 있다. 프로세스는 루프로 진행한다. 루프는 IMS가 요청(들)에 포함된 각각의 O-Cloud 노드를 동시에 또는 순차적으로 언커든하는 동작을 수행하 는 것을 포함한다. 루프는 IMS가 동작을 통해 언커든된 각각의 O-Cloud 노드를 하나 이상의 새 로운 워크로드 배치를 위해 스케줄링가능한 것으로 마킹하는 동작을 추가로 포함한다. 일부 실시예들에서, 동작은 플래그를 토글링하고, 이는 O-Cloud 노드가 언커든된 것으로서 표시되게 한다. 요 청(들)에 포함된 모든 O-Cloud 노드가 루프에 의해 처리된(즉, 동작에 의해 언커든되고 동작에 의해 새로운 워크로드 배치들을 위해 스케줄링가능한 것으로 마킹된) 후에, 프로세스는 동작 또는 동작 중 어느 하나 또는 둘 다로 진행한다. 동작에서, IMS는 하나 이상의 O-Cloud 상태 업데이트 통지를, 예를 들어, O2 인터페이스를 통해 FOCOM에 송신한다. 동작에서, IMS는 하나 이상의 O- Cloud 상태 업데이트 통지를, 예를 들어, O2 인터페이스를 통해 NRT-RIC에 송신한다. 일부 실시예들에서, 동작에서의 통지(들)는 NRT-RIC가 IMS로부터 통지들의 수신을 가입한 경우에만 발생한다. 동작 들(462 또는 464) 중 어느 하나 또는 둘 다는 SMO가 O-Cloud 노드 언커든 완료에 대해 통지받거나 O- Cloud 노드 언커든 완료의 통지를 수신하는 통지 동작에 포함될 수 있다. 동작 후에, 언커든된 O- Cloud 노드들은 유리하게, 하나 이상의 새로운 워크로드 배치를 위해 준비되는데, 즉, 언커든된 O-Cloud 노드들 은 이용가능하다. O-Cloud 결정 프로세스 및 O-Cloud 노드 언커든 프로세스는 유지보수를 요구하는 하나 이상의 O- Cloud 노드에 대한 유지보수를 효과적으로 수행하는 데 사용될 수 있다. 구체적으로, O-Cloud 결정 프로세스 및 O-Cloud 노드 언커든 프로세스는 O-Cloud 노드들이 NF 배치들을 재개할 수 있도록 O-Cloud 노드 들을 신속하고 효율적으로 언커든하는 능력을 제공할 수 있다. O-Cloud 노드들을 신속하고 효율적으로 언커든 하는 이러한 능력을 제공하기 위해 사용되는 시스템들, 방법들, 및 장치들은 O-Cloud 노드들이 계획불가능 또는 스케줄링불가능 상태에 있는 시간을 감소시키고, 그에 의해 O-Cloud 노드들이 최대 효율로 동작하는 것을 보장 하고, 생산성을 증가시키고, 네트워크의 최적의 성능을 제공한다. 이와 같이, 네트워크 서비스 제공자들은 O- Cloud 노드들에 대한 업데이트들 또는 유지보수를 신속하고 효율적으로 수행할 수 있어, 추가된 보안 및 더 높 은 품질의 네트워크들을 제공할 수 있다. 도 5는 O-Cloud 노드 언커든 프로세스의 실시예의 흐름도를 예시한다. 프로세스는 O-Cloud 노드의 배치가 능 상태를 변경하라는 요청을 수신하는 동작에서 시작할 수 있다. 다음으로, 프로세스는 요청을 수신하는 것에 응답하여 O-Cloud 노드의 배치가능 상태를 변경하는 동작으로 진행할 수 있다. 마지막으로, 프로세 스는 배치가능 상태를 변경하는 것에 응답하여 O-Cloud 노드의 배치가능 상태가 수정되었다는 표시를 송신하는동작으로 진행할 수 있다. 전술한 개시내용은 예시 및 설명을 제공하지만, 포괄적이거나 구현들을 개시된 정확한 형태로 제한하도록 의도 되지 않는다. 수정들 및 변형들이 위의 개시내용에 비추어 가능하거나 구현들의 실시로부터 획득될 수 있다. 본 명세서에 개시된 프로세스들/흐름도들에서의 블록들의 특정 순서 또는 계층구조는 예시적인 접근법들의 예시 라는 점이 이해된다. 설계 선호도들에 기초하여, 프로세스들/흐름도들에서의 블록들의 특정 순서 또는 계층구 조가 재배열될 수 있다는 점이 이해된다. 또한, 일부 블록들은 조합되거나 생략될 수 있다. 첨부된 방법 청구 항들은 다양한 블록들의 요소들을 샘플 순서로 제시하며, 제시된 특정 순서 또는 계층구조로 제한되는 것을 의 미하지 않는다. 일부 실시예들은, 임의의 가능한 기술적 세부 통합 레벨에서 시스템, 방법, 및/또는 컴퓨터 판독가능 매체와 관 련될 수 있다. 또한, 위에서 설명한 위의 컴포넌트들 중 하나 이상은 컴퓨터 판독가능 매체 상에 저장되고 적 어도 하나의 프로세서에 의해 실행가능한 명령어들로서 구현될 수 있다(및/또는 적어도 하나의 프로세서를 포함 할 수 있다). 컴퓨터 판독가능 매체는 프로세서로 하여금 동작들을 수행하게 하기 위한 컴퓨터 판독가능 프로 그램 명령어들을 갖는 컴퓨터 판독가능 비일시적 저장 매체(또는 매체들)를 포함할 수 있다. 컴퓨터 판독가능 저장 매체는 명령어 실행 디바이스에 의해 사용하기 위한 명령어들을 보유하고 저장할 수 있는 유형의 디바이스(tangible device)일 수 있다. 컴퓨터 판독가능 저장 매체는, 예를 들어, 전자 저장 디바이스, 자기 저장 디바이스, 광학 저장 디바이스, 전자기 저장 디바이스, 반도체 저장 디바이스, 또는 이들의 임의의 적합한 조합일 수 있으며, 이에 제한되지 않는다. 컴퓨터 판독가능 저장 매체의 더 구체적인 예들에 대한 비포 괄적인 리스트는, 휴대용 컴퓨터 디스켓, 하드 디스크, 랜덤 액세스 메모리(RAM), 판독 전용 메모리(ROM), 소거 가능한 프로그램가능 판독 전용 메모리(EPROM 또는 플래시 메모리), SRAM(static random access memory), 휴대 형 콤팩트 디스크 판독 전용 메모리(CD-ROM), DVD(digital versatile disk), 메모리 스틱, 플로피 디스크, 펀 치-카드(punch-card) 또는 명령어들이 기록된 홈 내의 융기 구조(raised structure)와 같은 기계적 인코딩형 디 바이스(mechanically encoded device), 및 이들의 임의의 적합한 조합을 포함한다. 컴퓨터 판독가능 저장 매체 는, 본 명세서에서 사용될 때, 전파들 또는 다른 자유롭게 전파하는 전자기파들, 도파관 또는 다른 송신 매체를 통해 전파하는 전자기파들(예를 들어, 광섬유 케이블을 통과하는 광 펄스들), 또는 와이어를 통해 송신되는 전 기 신호들과 같은, 일시적 신호들 자체인 것으로 해석되어서는 안된다. 본 명세서에 설명된 컴퓨터 판독가능 프로그램 명령어들은 네트워크, 예를 들어, 인터넷, 근거리 네트워크, 광 역 네트워크 및/또는 무선 네트워크를 통해 외부 컴퓨터 또는 외부 저장 디바이스에 또는 컴퓨터 판독가능 저장 매체로부터 각자의 컴퓨팅/처리 디바이스들에 다운로드될 수 있다. 네트워크는 구리 송신 케이블, 광 송신 섬 유, 무선 송신, 라우터, 방화벽, 스위치, 게이트웨이 컴퓨터 및/또는 에지 서버(edge server)를 포함할 수 있다. 각각의 컴퓨팅/처리 디바이스 내의 네트워크 어댑터 카드 또는 네트워크 인터페이스는 네트워크로부터 컴퓨터 판독가능 프로그램 명령어들을 수신하고, 각자의 컴퓨팅/처리 디바이스 내의 컴퓨터 판독가능 저장 매체 에 저장하기 위해 컴퓨터 판독가능 프로그램 명령어들을 포워딩한다. 동작들을 수행하기 위한 컴퓨터 판독가능 프로그램 코드/명령어들은 어셈블러 명령어들, 명령어 세트 아키텍처 (ISA) 명령어들, 머신 명령어들, 머신 종속 명령어들, 마이크로코드, 펌웨어 명령어들, 상태 설정 데이터, 집적 회로를 위한 구성 데이터, 또는 Smalltalk, C++, 또는 이와 유사한 것과 같은 객체 지향 프로그래밍 언어를 포 함하는 하나 이상의 프로그래밍 언어와, \"C\" 프로그래밍 언어 또는 유사한 프로그래밍 언어들과 같은 절차적 프 로그래밍 언어들의 임의의 조합으로 기입된 소스 코드 또는 객체 코드 중 어느 하나일 수 있다. 컴퓨터 판독가 능 프로그램 명령어들은 사용자의 컴퓨터 상에서 전적으로 실행될 수 있거나, 독립형 소프트웨어 패키지로서 사 용자의 컴퓨터 상에서 부분적으로 실행될 수 있거나, 사용자의 컴퓨터 상에서 부분적으로 그리고 원격 컴퓨터 상에서 부분적으로 실행될 수 있거나, 또는 원격 컴퓨터 또는 서버 상에서 전적으로 실행될 수 있다. 후자의 시나리오에서, 원격 컴퓨터는 근거리 네트워크(LAN) 또는 광역 네트워크(WAN)를 포함하는 임의의 타입의 네트워 크를 통해 사용자의 컴퓨터에 연결될 수 있거나, (예를 들어, 인터넷 서비스 제공자를 사용하여 인터넷을 통해) 외부 컴퓨터에 대해 연결이 이루어질 수 있다. 일부 실시예들에서, 예를 들어, 프로그램가능 로직 회로, 필드 프로그램가능 게이트 어레이(FPGA), 또는 프로그램가능 로직 어레이(PLA)를 포함하는 전자 회로는, 양태들 또는 동작들을 수행하기 위해, 컴퓨터 판독가능 프로그램 명령어들의 상태 정보를 활용하여 전자 회로를 개인화함으 로써 컴퓨터 판독가능 프로그램 명령어들을 실행할 수 있다. 이러한 컴퓨터 판독가능 프로그램 명령어들은 범용 컴퓨터, 특수 목적 컴퓨터, 또는 다른 프로그램가능 데이터 처리 장치의 프로세서에 제공되어 머신을 생성할 수 있고, 그에 따라, 컴퓨터 또는 다른 프로그램가능 데이터처리 장치의 프로세서를 통해 실행되는 명령어들은 흐름도 및/또는 블록도 블록 또는 블록들에서 명시된 기능들 /동작들을 구현하기 위한 수단을 생성한다. 이러한 컴퓨터 판독가능 프로그램 명령어들은 또한 컴퓨터, 프로그 램가능 데이터 처리 장치, 및/또는 다른 디바이스들에게 특정 방식으로 기능하도록 지시할 수 있는 컴퓨터 판독 가능 저장 매체에 저장될 수 있어, 명령어들이 저장된 컴퓨터 판독가능 저장 매체는 흐름도 및/또는 블록도 블 록 또는 블록들에 명시된 기능/동작의 양태들을 구현하는 명령어들을 포함하는 제조 물품을 포함한다. 컴퓨터 판독가능 프로그램 명령어들은 또한 컴퓨터, 다른 프로그램가능 데이터 처리 장치, 또는 다른 디바이스 상에 로딩되어, 일련의 동작 단계들이 컴퓨터, 다른 프로그램가능 장치 또는 다른 디바이스 상에서 수행되어 컴 퓨터 구현 프로세스(computer implemented process)를 생성하게 할 수 있어서, 컴퓨터, 다른 프로그램가능 장치, 또는 다른 디바이스 상에서 실행되는 명령어들이 흐름도 및/또는 블록도의 블록 또는 블록들에 명시된 기 능들/동작들을 구현하게 한다. 도면들의 흐름도 및 블록도들은 다양한 실시예들에 따른 시스템들, 방법들, 및 컴퓨터 판독가능 매체의 가능한 구현들의 아키텍처, 기능성, 및 동작을 예시한다. 이와 관련하여, 흐름도 또는 블록도들 내의 각각의 블록은 명시된 논리 기능(들)을 구현하기 위한 하나 이상의 실행가능 명령어를 포함하는 모듈, 세그먼트, 또는 명령어 들의 일부를 나타낼 수 있다. 방법, 컴퓨터 시스템, 및 컴퓨터 판독가능 매체는 도면들에 묘사된 것들에 추가 적인 블록들, 그보다 더 적은 블록들, 그와 상이한 블록들, 또는 그와 상이하게 배열된 블록들을 포함할 수 있 다. 일부 대안적인 구현들에서, 블록들에서 언급된 기능들은 도면들에서 언급된 순서를 벗어나 발생할 수 있다. 예를 들어, 연속하여 도시된 2개의 블록은, 사실상, 동시에 또는 실질적으로 동시에 실행될 수 있거나, 수반된 기능성에 따라 블록들이 때때로 역순으로 실행될 수 있다. 블록도들 및/또는 흐름도의 각각의 블록, 및 블록도들 및/또는 흐름도 내의 블록들의 조합들은 명시된 기능들 또는 동작들을 수행하거나 특수 목적 하드웨어 와 컴퓨터 명령어들의 조합들을 수행하는 특수 목적 하드웨어 기반 시스템들에 의해 구현될 수 있다는 점에도 유의할 것이다. 본 명세서에 설명된 시스템들 및/또는 방법들은 하드웨어, 펌웨어, 또는 하드웨어와 소프트웨어의 조합의 상이 한 형태들로 구현될 수 있다는 것이 명백할 것이다. 이러한 시스템들 및/또는 방법들을 구현하는 데 사용되는 실제 특수화된 제어 하드웨어 또는 소프트웨어 코드는 구현들을 제한하지 않는다. 따라서, 시스템들 및/또는 방법들의 동작 및 거동은 특정 소프트웨어 코드에 대한 참조 없이 본 명세서에 설명되었다-소프트웨어 및 하드 웨어가 본 명세서에서의 설명에 기초하여 시스템들 및/또는 방법들을 구현하도록 설계될 수 있다는 점이 이해된 다. 위의 개시내용은 또한 아래에 열거된 실시예들을 포함한다: 방법은 O-Cloud 노드의 배치가능 상태를 변경하라는 요청을 수신하는 단계, 요청을 수신하는 것에 응답하여 O-Cloud 노드의 배치가능 상태를 변경하는 단계, 및 배치가능 상태를 변경하는 것에 응답하여 O-Cloud 노드의 배치가능 상태가 수정되었다는 표시를 송신하는 단계를 포함할 수 있다. 특징 의 방법에 있어서, O-Cloud 노드의 배치가능 상태를 변경하는 단계는 배치가능 상태를 커든된 상태 (cordoned state)로부터 언커든된 상태(uncordoned state)로 변경하는 단계를 포함한다. 특징 또는 특징 에 따른 방법에 있어서, O-Cloud 노드는 애플리케이션, 워크로드, 또는 네트워크 기 능 중 적어도 하나를 커든된 상태로 배치할 수 없고, O-Cloud 노드는 애플리케이션, 워크로드, 또는 네트워크 기능 중 적어도 하나를 언커든된 상태로 배치할 수 있다. 특징 내지 특징 중 어느 하나에 따른 방법에 있어서, O-Cloud 노드의 배치가능 상태를 변경하는 단 계는 O-Cloud 노드의 배치가능 상태를 표시하는 플래그 또는 마커에 관련된 정보를 변경하는 단계를 포함한다. 특징 내지 특징 중 어느 하나에 따른 방법에 있어서, 수신하는 단계, 변경하는 단계, 및 송신하는 단계는 O-Cloud 플랫폼의 인프라스트럭처 관리 서비스들(IMS)에 의해 수행된다. 특징 내지 특징 중 어느 하나에 따른 방법에 있어서, O-Cloud 노드의 배치가능 상태를 변경하라는 요청을 수신하는 단계는 사용자 단말 또는 비실시간 무선 액세스 네트워크 지능형 제어기(NRT-RIC) 중 적어도 하나로부터 요청을 수신하는 단계를 포함한다. 특징 내지 특징 중 어느 하나에 따른 방법에 있어서, 요청은 계산 부하의 증가의 결정에 응답하여 수신된다. 방법은 O-Cloud 노드의 배치가능 상태를 변경하라는 요청을 송신하는 단계를 포함할 수 있고, 요청은, O- Cloud 노드의 배치가능 상태가, O-Cloud 노드가 애플리케이션, 워크로드, 또는 네트워크 기능 중 적어도 하나를 배치할 수 없는 커든된 상태로부터, O-Cloud 노드가 애플리케이션, 워크로드, 또는 네트워크 기능 중 적어도 하 나를 배치할 수 있는 언커든된 상태로 변경되게 한다. 특징 의 방법에 있어서, 배치가능 상태가 언커든된 상태로 변경되었다는 표시를 수신하는 단계를 추가로 포함한다. 특징 또는 특징 의 방법에 있어서, 표시를 수신하는 단계는 O-Cloud 노드의 배치가능 상태가 언커 든된 상태에 있음을 표시하는 업데이트된 플래그 또는 마커에 관련된 정보를 수신하는 단계를 포함한다. 특징 내지 특징 중 어느 하나에 따른 방법에 있어서, 배치가능 상태 변경 표시들을 수신하기 위 한 가입을 완료하는 단계, 및 배치가능 상태 변경 표시들을 수신하기 위한 가입을 완료한 것에 기초하여 배치가 능 상태가 언커든된 상태로 변경되었다는 표시를 수신하는 단계를 추가로 포함한다. 특징 내지 특징 중 어느 하나에 따른 방법에 있어서, 요청을 송신하는 단계는 사용자 단말 또는 비실시간 무선 액세스 네트워크 지능형 제어기(NRT-RIC) 중 적어도 하나로부터 요청을 송신하는 단계를 추가로 포함한다. 특징 내지 특징 중 어느 하나에 따른 방법에 있어서, 요청을 송신하는 단계는 SMO(service management and orchestration) 프레임워크의 FOCOM(federated O-Cloud orchestration and management) 컴포 넌트에 요청을 송신하는 단계를 추가로 포함한다. 특징 내지 특징 중 어느 하나에 따른 방법에 있어서, FOCOM은 커든된 상태로부터 언커든된 상태 로의 변경을 수행하는 O-Cloud 플랫폼의 인프라스트럭처 관리 서비스(IMS)와 통신한다. 장치는 컴퓨터 프로그램 코드를 저장하도록 구성되는 적어도 하나의 메모리; 및 적어도 하나의 메모리에 액세스하고 컴퓨터 프로그램 코드에 의해 명령된 바와 같이 동작하도록 구성되는 적어도 하나의 프로세서를 포 함하고, 컴퓨터 프로그램 코드는: 적어도 하나의 프로세서 중 적어도 하나로 하여금 개방형 무선 액세스 네트워 크(O-RAN) 클라우드(O-Cloud) 노드의 배치가능 상태를 변경하라는 요청을 수신하게 하도록 구성되는 수신 코드; 적어도 하나의 프로세서 중 적어도 하나로 하여금 요청을 수신하는 것에 응답하여 O-Cloud 노드의 배치가능 상 태를 변경하게 하도록 구성되는 변경 코드; 및 적어도 하나의 프로세서 중 적어도 하나로 하여금 배치가능 상태 를 변경하는 것에 응답하여 O-Cloud 노드의 배치가능 상태가 수정되었다는 표시를 송신하게 하도록 구성되는 송 신 코드를 포함한다. 특징 의 장치에 있어서, 변경 코드는 적어도 하나의 프로세서 중 적어도 하나로 하여금 배치가능 상태 를 커든된 상태로부터 언커든된 상태로 변경하게 하도록 추가로 구성된다. 특징 또는 특징 의 장치에 있어서, O-Cloud 노드는 애플리케이션, 워크로드, 또는 네트워크 기능 중 적어도 하나를 커든된 상태로 배치할 수 없고, O-Cloud 노드는 애플리케이션, 워크로드, 또는 네트워크 기능 중 적어도 하나를 언커든된 상태로 배치할 수 있다. 특징 내지 특징 중 어느 하나에 따른 장치에 있어서, 수신 코드는 적어도 하나의 프로세서 중 적어도 하나로 하여금 O-Cloud 플랫폼의 인프라스트럭처 관리 서비스(IMS) 컴포넌트에 의해 요청을 수신하게 하 도록 추가로 구성되고, 변경 코드는 적어도 하나의 프로세서 중 적어도 하나로 하여금 IMS를 사용하여 배치가능 상태를 변경하게 하도록 추가로 구성되고, 송신 코드는 적어도 하나의 프로세서 중 적어도 하나로 하여금 IMS로 부터 표시를 송신하게 하도록 추가로 구성된다. 특징 내지 특징 중 어느 하나에 따른 장치에 있어서, 변경 코드는 적어도 하나의 프로세서 중 적어도 하나로 하여금 O-Cloud 노드의 배치가능 상태를 표시하는 플래그 또는 마커에 관련된 정보를 변경하게 하도록 추가로 구성된다. 특징 내지 특징 중 어느 하나에 따른 장치에 있어서, 요청은 계산 부하의 증가의 결정에 응답하 여 수신된다.도면 도면1 도면2 도면3 도면4a 도면4b 도면5"}
{"patent_id": "10-2024-7034627", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 개시내용의 실시예들의 상기의 및 다른 양태들, 특징들, 및 양태들은 첨부 도면들과 함께 취해진 다음의 설 명으로부터 명백할 것이다. 도 1은 본 개시내용의 다양한 실시예에 따른 예시적인 네트워크 디바이스의 도면이다. 도 2는 본 개시내용의 다양한 실시예들에 따른 예시적인 O-RAN 통신 시스템의 개략도이다. 도 3은 본 개시내용의 다양한 실시예들에 따른 O-RAN 아키텍처를 예시한다. 도 4a 및 도 4b는 각각 본 개시내용의 다양한 실시예들에 따른 O-Cloud 식별 프로세스 및 O-Cloud 노드 언커든 프로세스를 예시한다. 도 5는 본 개시내용의 다양한 실시예들에 따른 O-Cloud 노드 언커든 프로세스의 예시적인 흐름도를 예시한다."}
