{"patent_id": "10-2023-0099497", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0003245", "출원번호": "10-2023-0099497", "발명의 명칭": "플렉서블 디스플레이를 구비한 전자 장치", "출원인": "삼성전자주식회사", "발명자": "조현문"}}
{"patent_id": "10-2023-0099497", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치(200)에 있어서,제1 하우징(210); 힌지 모듈(240)을 통해 상기 제1 하우징(210)과 폴딩 가능하게 연결되는 제2 하우징(220); 및 상기 제1 하우징(210) 및 상기 제2 하우징(220)에 의해 지지되는 플렉서블 디스플레이(300)를 포함하고,상기 플렉서블 디스플레이(300)는,제1 면(3111) 및 상기 제1 면(3111)에 대향하는 제2 면(3112)을 가지며, 상기 제1 면(3111)으로부터 함몰된 복수의 제1 패턴(3113)과, 상기 제2 면(3112)으로부터 함몰된 복수의 제2 패턴(3114)을 포함하는 글래스층(311);상기 복수의 제1 패턴(3113)에 충진되는 제1 충진 부재(312); 및상기 복수의 제2 패턴(3114)에 충진되며, 상기 제1 충진 부재(312)보다 낮은 경도를 갖는 제2 충진 부재(313)를포함하는, 장치."}
{"patent_id": "10-2023-0099497", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 복수의 제1 패턴(3113)의 함몰 깊이(d1)는, 상기 복수의 제2 패턴(3114)의 함몰 깊이(d2)와 실질적으로 동일한, 장치."}
{"patent_id": "10-2023-0099497", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 복수의 제1 패턴(3113)의 함몰 깊이(d1)는, 상기 복수의 제2 패턴(3114)의 함몰 깊이(d2)보다 얕은, 장치"}
{"patent_id": "10-2023-0099497", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 플렉서블 디스플레이(300)는,상기 글래스층(311)의 상기 제1 면(3111)에 적층되며, 하드 코팅 또는 내지문(anti-finger) 코팅된 코팅층(314)을 포함하는, 장치"}
{"patent_id": "10-2023-0099497", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 제1 충진 부재(312)의 경도는 20 내지 400MPa이며, 상기 제2 충진 부재(313)의 경도는 0.005 내지 10 MPa인, 장치.공개특허 10-2025-0003245-3-청구항 6 제1항에 있어서, 상기 복수의 제1 패턴(3113)의 함몰 깊이(d1)는 20um 이상인, 장치."}
{"patent_id": "10-2023-0099497", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 글래스층(311)은, 표면이 알칼리 이온의 교환에 따른 화학 강화 처리된, 장치."}
{"patent_id": "10-2023-0099497", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 복수의 제1 패턴(3113)의 패턴 간격(Ta), 상기 복수의 제2 패턴(3114)의 패턴 간격(Tb), 및 상기 복수의제1 패턴(3113)과 상기 복수의 제2 패턴(3114) 사이의 이격 거리(Tc)는, 30um 이상인, 장치"}
{"patent_id": "10-2023-0099497", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 플렉서블 디스플레이(300)는,상기 글래스층(311)의 상기 제 1면(3111) 및/또는 상기 제2 면(3112)에 적층되는 적어도 하나의 평탄화층(3121,3131)을 포함하는, 장치."}
{"patent_id": "10-2023-0099497", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 적어도 하나의 평탄화층(3121, 3131)은,상기 제1 면(3111)에 적층되는 제1 평탄화층(3121)과, 상기 제2 면(3112)에 적층되는 제2 평탄화층(3131)을 포함하며, 상기 제1 평탄화층(3121)은 상기 제1 충진 부재(312)와 동일한 물질로 형성되며,상기 제2 평탄화층(3131)은 상기 제2 충진 부재(313)와 동일한 물질로 형성되는, 장치."}
{"patent_id": "10-2023-0099497", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항에 있어서,상기 제1 면(3111)에 적층되는 평탄화층(3121)은, 10 내지 30um 범위의 두께로 형성되는, 장치."}
{"patent_id": "10-2023-0099497", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1항에 있어서,상기 플렉서블 디스플레이(300)는,상기 제1 하우징(210)과 대면하는 제1 평면부(230a), 상기 제2 하우징(220)과 대면하는 제2 평면부(230b), 상기제1 평면부(230a)와 상기 제2 평면부(230b)를 연결하며, 상기 힌지 모듈(240)과 대면하며 벤딩 가능한 굴곡 가공개특허 10-2025-0003245-4-능부(230c)를 포함하는, 장치."}
{"patent_id": "10-2023-0099497", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 복수의 제1 패턴(3113) 및 상기 복수의 제2 패턴(3114)은, 상기 플렉서블 디스플레이(300)의 상기 굴곡 가능부(230c)에 대응하는 일 영역에 위치하는, 장치."}
{"patent_id": "10-2023-0099497", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13에 있어서,상기 일 영역의 굴곡성은, 상기 복수의 패턴들(3113, 3114)의 형상, 배치 및/또는 경도에 의해 결정되는, 장치."}
{"patent_id": "10-2023-0099497", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제1항에 있어서,상기 복수의 제1 패턴(3113) 및 상기 복수의 제2 패턴(3114)은, 지그재그(zigzag) 형태로 형성된, 장치."}
{"patent_id": "10-2023-0099497", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "전자 장치(400, 500)에 있어서,적어도 하나의 하우징(410, 420, 430, 510); 및상기 적어도 하나의 하우징(410, 420, 430, 510)의 지지를 통해 적어도 부분적으로 벤딩 가능한 벤딩 영역(F1,F2, 530b)을 포함하는 플렉서블 디스플레이(440, 530)를 포함하고,상기 플렉서블 디스플레이(440, 530)는,제1 면(4411, 5311)으로부터 함몰된 복수의 제1 패턴(4413, 5313)과, 상기 제1 면(4411, 5311)에 대향하는 제2면(4412, 5312)으로부터 함몰된 복수의 제2 패턴(4414, 5314)을 포함하는 글래스층(441, 531);상기 복수의 제1 패턴(4413, 5313)에 충진되는 제1 충진 부재(442, 532); 및상기 복수의 제2 패턴(4414, 5314)에 충진되며, 상기 제1 충진 부재(442, 532)보다 낮은 경도를 갖는 제2 충진부재(443, 533)를 포함하는, 장치."}
{"patent_id": "10-2023-0099497", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서,상기 복수의 제1 패턴(4413, 5313) 및 상기 복수의 제2 패턴(4414, 5314)은 상기 벤딩 영역(F1, F2, 530b)에대응하는 일 영역에 위치하는, 장치."}
{"patent_id": "10-2023-0099497", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제16항에 있어서,상기 복수의 제1 패턴(4413, 5313)의 함몰 깊이는, 상기 복수의 제2 패턴(4414, 5314)의 함몰 깊이와 실질적으로 동일한, 장치.공개특허 10-2025-0003245-5-청구항 19 제16항에 있어서,상기 복수의 제1 패턴(4413, 5313)의 함몰 깊이는, 상기 복수의 제2 패턴(4414, 5314)의 함몰 깊이보다 얕은,장치"}
{"patent_id": "10-2023-0099497", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "평면부(230a, 230b)와 굴곡 가능부(230c)를 포함하는 플렉서블 디스플레이(300)에 있어서,상기 플렉서블 디스플레이(300)는,제1 면(3111)으로부터 함몰된 복수의 제1 패턴(3113)과, 상기 제1 면(3111)에 대향하는 제2 면(3112)으로부터함몰된 복수의 제2 패턴(3114)을 포함하는 글래스층(311);상기 복수의 제1 패턴(3113)에 충진되는 제1 충진 부재(312); 및상기 복수의 제2 패턴(3114)에 충진되며, 상기 제1 충진 부재(312)보다 낮은 경도를 갖는 제2 충진 부재(313)를포함하며,상기 복수의 제1 패턴(3113) 및 상기 복수의 제2 패턴(3114)은, 상기 플렉서블 디스플레이(300)의 상기 굴곡 가능부(230c)에 대응하는 상기 글래스층(311)의 일 영역에 위치하는, 디스플레이."}
{"patent_id": "10-2023-0099497", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 일 실시예에 따른 전자 장치는, 제1 하우징을 포함할 수 있다. 상기 전자 장치는 힌지 모듈을 통해 상기 제1 하우징과 폴딩 가능하게 연결되는 제2 하우징을 포함할 수 있다. 상기 전자 장치는 상기 제1 하우징 및 상기 제2 하우징에 의해 지지되는 플렉서블 디스플레이를 포함할 수 있다. 상기 플렉서블 디스플레이는 제1 면, 상기 제1 면에 대향하는 제2 면을 가지며, 상기 제1 면으로부터 함몰된 복수의 제1 패턴과, 상기 제2 면으로 부터 함몰된 복수의 제2 패턴을 포함하는 글래스층을 포함할 수 있다. 상기 플렉서블 디스플레이는 상기 복수의 제1 패턴에 충진되는 제1 충진 부재를 포함할 수 있다. 상기 복수의 제2 패턴에 충진되며, 상기 제1 충진 부재 보다 낮은 경도를 갖는 제2 충진 부재를 포함할 수 있다."}
{"patent_id": "10-2023-0099497", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시의 다양한 실시예들은, 플렉서블 디스플레이를 구비한 전자 장치에 관한 것이다."}
{"patent_id": "10-2023-0099497", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전자, 정보, 통신 기술이 발달하면서, 하나의 휴대용 통신 장치 또는 전자 장치에 다양한 기능이 통합되고 있다. 예를 들어, 스마트 폰은 통신 기능과 아울러, 음향 재생 기기, 촬상 기기 또는 전자 수첩의 기능을 포함 하고 있으며, 어플리케이션의 추가 설치를 통해 더욱 다양한 기능이 스마트 폰에서 구현될 수 있다. 스마트 폰과 같은 개인용 또는 휴대용 통신 장치의 사용이 보편화되면서, 휴대성과 사용의 편의성에 대한 사용 자 요구가 증가하고 있다. 예를 들어, 터치스크린 디스플레이는 화면, 예를 들면, 시각적 정보를 출력하는 출력 장치이면서, 기계적인 입력 장치(예: 버튼식 입력 장치)를 대체하는 가상의 키패드를 제공할 수 있다. 이로써, 휴대용 통신 장치 또는 전자 장치는 소형화되면서도 동일한 또는 더욱 향상된 활용성(예: 더 큰 화면)을 제공할 수 있게 되었다. 다른 한편으로, 유연성을 가진(flexible), 예를 들어, 접혀질 수 있는(foldable) 또는 말아질 수 있는(rollable) 디스플레이가 상용화되면서, 전자 장치의 휴대성과 사용의 편의성은 더욱 향상될 것으로 예 상된다. 본 개시의 다양한 실시예들은, 벤딩 영역에 복수의 패턴들이 마련되며, 상기 복수의 패턴들에 다른 경도를 갖는 충진 부재가 충진된 플렉서블 디스플레이를 제공할 수 있다. 본 개시의 일 실시예에 따른 전자 장치는, 제1 하우징을 포함할 수 있다. 상기 전자 장치는 힌지 모듈을 통해 상기 제1 하우징과 폴딩 가능하게 연결되는 제2 하우징을 포함할 수 있다. 상기 전자 장치는 상기 제1 하우징 및 상기 제2 하우징에 의해 지지되는 플렉서블 디스플레이를 포함할 수 있다. 상기 플렉서블 디스플레이는 제1 면, 상기 제1 면에 대향하는 제2 면을 가지며, 상기 제1 면으로부터 함몰된 복수의 제1 패턴과, 상기 제2 면으로부터 함몰된 복수의 제2 패턴을 포함하는 글래스층을 포함할 수 있다. 상기 플렉서블 디스플레이는 상기 복 수의 제1 패턴에 충진되는 제1 충진 부재를 포함할 수 있다. 상기 복수의 제2 패턴에 충진되며, 상기 제1 충진 부재보다 낮은 경도를 갖는 제2 충진 부재를 포함할 수 있다. 본 개시의 다양한 실시예들은, 플렉서블 디스플레이의 벤딩 영역에 대응하는 일 영역에 복수의 패턴들이 형성된 글래스층에 있어서, 외부에 노출되는 상기 복수의 제1 패턴에 글래스층과 실질적으로 동일한 경도를 갖는 제1 충진 부재를 충진함으로써 글래스층과 충진 부재 간의 터치감 차이를 감소시킬 수 있다. 또한, 복수의 제1 패턴에 대향하는 복수의 제2 패턴에 제1 충진 부재보다 낮은 경도를 갖는 제2 충진 부재를 충 진함으로써 플렉서블 디스플레이의 굴곡성을 향상시킬 수 있다. 본 개시의 예시적 실시예들에서 얻을 수 있는 효과는 이하의 기재로부터 본 개시의 예시적 실시예들이 속하는"}
{"patent_id": "10-2023-0099497", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "기술분야에서 통상의 지식을 가진 자에게 명확하게 도출되고 이해될 수 있다. 즉, 본 개시의 예시적 실시예들을"}
{"patent_id": "10-2023-0099497", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 3, "content": "실시함에 따른 의도하지 아니한 효과들 역시 본 개시의 예시적 실시예들로부터 당해 기술분야의 통상의 지식을 가진 자에 의해 도출될 수 있다."}
{"patent_id": "10-2023-0099497", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 아이템 한 개 또는 복 수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제1\", \"제2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하 기 위해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제1) 구성요소가 다른(예: 제2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 어떤 구성요소가 다른 구성요소에 직접적 으로(예: 유선으로), 무선으로, 또는 제3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. “포함하다” 또는 “가지다”등의 용어는 본 문서에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이 들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성 요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는다. 어떤 구성요소가 다른 구성요소와 “연결”, “결합”, “지지” 또는 “접촉”되어 있다고 할 때, 이는 구성요 소들이 직접적으로 연결, 결합, 지지 또는 접촉되는 경우뿐 아니라, 제3 구성요소를 통하여 간접적으로 연결, 결합, 지지 또는 접촉되는 경우를 포함한다. 어떤 구성요소가 다른 구성요소 “상에” 위치하고 있다고 할 때, 이는 어떤 구성요소가 다른 구성요소에 접해 있는 경우뿐 아니라 두 구성요소 사이에 또 다른 구성요소가 존재하는 경우도 포함한다. “및/또는”이라는 용어는 복수의 관련된 기재된 구성요소들의 조합 또는 복수의 관련된 기재된 구성요소들 중 의 어느 구성요소를 포함한다. 이하 첨부된 도면들을 참고하여 본 발명의 작용 원리 및 실시예에 대해 설명한다. 도 1은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워 크)를 통하여 전자 장치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하 여 전자 장치 또는 서버 중 적어도 하나와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 서 버를 통하여 전자 장치와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 프로세서, 메 모리, 입력 모듈, 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스, 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통 신 모듈, 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장 치에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어떤 실시예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안 테나 모듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세서는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메 모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메 모리에 저장할 수 있다. 일실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또 는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처 리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서 를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능에 특 화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있 다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구 성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일실시예에 따르면, 보조 프로 세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능 모델이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi- supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않 는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있 다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상 기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일실시예 에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다.센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일실시예에 따르면, 인터페이스는, 예 를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터 페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일실시예에 따르면, 카메라 모듈은 하나 이상 의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일실시예에 따르면, 전력 관리 모듈 은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일실시예에 따르면, 배터리 는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일실시예에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워 크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수 의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입 자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같 은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이 상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링 크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다.안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이 루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일실시예에 따르면, 안테나 모듈은 복수의 안테나들 (예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모 듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품 (예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요 청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일실시예에 따르면, 외부의 전자 장치 또는 서버는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 본 문서에 개시된 다양한 실시예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되 지 않는다. 도 2a는 본 개시의 일 실시예에 따른 펼침 상태(flat stage 또는 unfolding state)를 도시한 전자 장치의 사시 도이다. 도 2b는 본 개시의 일 실시예에 따른 펼침 상태에서, 전자 장치의 전면을 도시한 평면도이다. 도 2c는 본 개시의 일 실시예에 따른 펼침 상태에서, 전자 장치의 후면을 도시한 평면도이다. 도 3a는 본 개시의 일 실 시예에 따른 접힘 상태(folding state)를 도시한 전자 장치의 사시도이다. 도 3b는 본 개시의 일 실시예에 따른 중간 상태(intermediate state)를 도시한 전자 장치의 사시도이다. 도 4은 본 개시의 일 실시예에 따른 전자 장 치의 분리 사시도이다. 도 2a 내지 도 4를 참고하면, 전자 장치는 힌지 모듈을 기준으로 서로에 대하여 마주보며 접히도록 회동 가능하게 결합되는 한 쌍의 하우징(210, 220)(예: 폴더블 하우징)를 포함할 수 있다. 일 실시예에 따르면, 전자 장치는 한 쌍의 하우징(210, 220)에 의해 형성된 영역에 배치되는 플렉서블 디스플레이(예: 도 1의 디스플레이)를 포함할 수 있다. 일 실시예에 따르면, 제1 하우징과 제2 하우징은 폴딩 축 (축 F)을 중심으로 양측에 배치되고, 폴딩 축(예: 축 F)에 대하여 실질적으로 대칭인 형상을 가질 수 있다. 일실시예에 따르면, 제1 하우징 및 제2 하우징은 전자 장치의 상태가 펼침 상태(flat stage 또는 unfolding state)인지, 접힘 상태(folding state)인지, 또는 중간 상태(intermediate state)인지의 여부에 따 라 서로 이루는 각도나 거리가 달라질 수 있다. 한 쌍의 하우징(210, 220)은 힌지 모듈과 결합되는 제1 하우징(예: 제1 하우징 구조) 및 힌지 모듈 과 결합되는 제2 하우징(예: 제2 하우징 구조)을 포함할 수 있다. 일 실시예에 따르면, 제1 하우징 은, 펼침 상태에서, 제1 방향(예: 전면 방향)(z 축 방향)을 향하는 제1 면 및 제1 면과 대향되 는 제2 방향(예: 후면 방향)(-z 축 방향)을 향하는 제2 면을 포함할 수 있다. 일 실시예에 따르면, 제2 하우징은 펼침 상태에서, 제1 방향(z 축 방향)을 향하는 제3 면 및 제2 방 향(-z 축 방향)을 향하는 제4 면을 포함할 수 있다. 일 실시예에 따르면, 전자 장치는, 펼침 상태에 서, 제1 하우징의 제1 면과 제2 하우징의 제3 면이 실질적으로 동일한 제1 방향(z 축 방향)을 향하고, 접힘 상태에서 제1 면과 제3 면이 서로 마주보는 방식으로 동작될 수 있다. 일 실시예에 따르면, 전자 장치는, 펼침 상태에서, 제1 하우징의 제2 면과 제2 하우징의 제4 면이 실질적으로 동일한 제2 방향(- z 축 방향)을 향하고, 접힘 상태에서 제2 면과 제4 면 이 서로 반대 방향을 향하도록 동작될 수 있다. 예를 들면, 접힘 상태에서 제2 면은 제1 방향(z 축 방향) 을 향할 수 있고, 제4 면은 제2 방향(-z 축 방향)을 향할 수 있다. 일 실시예에 따르면, 제1 하우징은 적어도 부분적으로 전자 장치의 외관을 형성하는 제1 측면 프레임 및 제1 측면 프레임과 결합되고, 전자 장치의 제2 면의 적어도 일부를 형성하는 제1 후면 커버를 포함할 수 있다. 일 실시예에 따르면, 제1 측면 프레임은 제1 측면(213a), 제1 측면(213a)의 일단으로부터 연장되는 제2 측면(213b) 및 제1 측면(213a)의 타단으로부터 연장되는 제3 측면(213c)을 포함할 수 있다. 일 실시예에 따르면, 제1 측면 프레임은 제1 측면(213a), 제2 측면(213b) 및 제3 측면(213c)을 통해 장방형(예: 정사각형 또는 직사각형) 형상으로 형성될 수 있다. 일 실시예에 따르면, 제2 하우징은 적어도 부분적으로 전자 장치의 외관을 형성하는 제2 측면 프레임 및 제2 측면 프레임과 결합되고, 전자 장치의 제4 면의 적어도 일부를 형성하는 제2 후면 커버를 포함할 수 있다. 일 실시예에 따르면, 제2 측면 프레임은 제4 측면(223a), 제4 측면(223a)의 일단으로부터 연장되는 제5 측면(223b) 및 제4 측면(223b)의 타단으로부터 연장되는 제6 측면(223c)을 포함할 수 있다. 일 실시예에 따르면, 제2 측면 프레임은 제4 측면(223a), 제5 측면(223b) 및 제6 측면(223c)을 통해 장방형 형상으로 형성될 수 있다. 일 실시예에 따르면, 한 쌍의 하우징(210, 220)은 도시된 형태 및 결합으로 제한되지 않으며, 다른 형상이나 부 품의 조합 및/또는 결합에 의해 구현될 수 있다. 예를 들어, 어떤 실시예에서는, 제1 측면 프레임은 제1 후면 커버와 일체로 형성될 수 있고, 제2 측면 프레임은 제2 후면 커버와 일체로 형성될 수 있 다. 일 실시예에 따르면, 전자 장치는, 펼침 상태에서, 제1 측면 프레임의 제2 측면(213b)과 제2 측면 프 레임의 제5 측면(223b)이 갭(gap) 없이 연결될 수 있다. 일 실시예에 따르면, 전자 장치는, 펼침 상 태에서, 제1 측면 프레임의 제3 측면(213c)과 제2 측면 프레임의 제6 측면(223c)이 갭(gap) 없이 연 결될 수 있다. 일 실시예에 따르면, 전자 장치는, 펼침 상태에서, 제2 측면(213b)과 제5 측면(223b)의 합 한 길이가 제1 측면(213a) 및/또는 제4 측면(223a)의 길이보다 길도록 구성될 수 있다. 또한, 제3 측면(213c)과 제6 측면(223c)의 합한 길이가 제1 측면(213a) 및/또는 제4 측면(223a)의 길이보다 길도록 구성될 수 있다. 일 실시예에 따르면, 제1 측면 프레임 및/또는 제2 측면 프레임은 금속으로 형성되거나, 금속에 사출 되는 폴리머를 더 포함할 수 있다. 일 실시예에 따르면, 제1 측면 프레임 및/또는 제2 측면 프레임은 폴리머로 형성된 적어도 하나의 분절부(2161, 2162 및/또는 2261, 2262)를 통해 전기적으로 분절된 적어도 하나 의 도전성 부분(216 및/또는 226)을 포함할 수도 있다. 이러한 경우, 적어도 하나의 도전성 부분은 전자 장치 에 포함된 무선 통신 회로와 전기적으로 연결됨으로서 지정된 적어도 하나의 대역(예: legacy 대역)에서 동작하는 안테나로 사용될 수 있다. 일 실시예에 따르면, 제1 후면 커버 및/또는 제2 후면 커버는, 예를 들어, 코팅 또는 착색된 유리, 세라믹, 폴리머 또는 금속(예: 알루미늄, 스테인레스 스틸(STS), 또는 마그네슘) 중 적어도 하나 또는 적어도 둘의 조합에 의하여 형성될 수 있다. 일 실시예에 따르면, 플렉서블 디스플레이는 제1 하우징의 제1 면으로부터 힌지 모듈을 가 로질러 제2 하우징의 제3 면의 적어도 일부까지 연장되도록 배치될 수 있다. 예를 들어, 플렉서블 디 스플레이는 실질적으로 제1 면과 대응하는 제1 평면부(230a), 제3 면과 대응하는 제2 평면부 (230b) 및 제1 평면부(230a)와 제2 평면부(230b)를 연결하고, 힌지 모듈과 대응하는 굴곡 가능부(230c)를 포함할 수 있다. 일 실시예에 따르면, 전자 장치는 제1 하우징의 가장자리를 따라 결합되는 제1 보호 커버(예: 제1 보호 프레임 또는 제1 장식 부재)를 포함할 수 있다. 일 실시예에 따르면, 전자 장치는 제2 하우징의 가장자리를 따라 결합되는 제2 보호 커버(예: 제2 보호 프레임 또는 제2 장식 부재)를 포함할 수 있다. 일 실시예에 따르면, 제1 보호 커버 및/또는 제2 보호 커버는 금속 또는 폴리머 재 질로 형성될수 있다. 일 실시예에 따르면, 제1 보호 커버 및/또는 제2 보호 커버는 장식 부재 (decoration member)로 사용될 수 있다. 일 실시예에 따르면, 플렉서블 디스플레이는 제1 평면부(230a)의 가장자리가 제1 하우징과 제1 보호 커버 사이에 개재되도록 위치될 수 있다. 일 실시예에 따르면, 플 렉서블 디스플레이는 제2 평면부(230b)의 가장자리가 제2 하우징과 제2 보호 커버 사이에 개재 되도록 위치될 수 있다. 일 실시예에 따르면, 플렉서블 디스플레이는 힌지 모듈과 대응되는 영역에 배치되는 보호 캡을 통해, 보호 캡에 대응되는 플렉서블 디스플레이의 가장자리가 보호되도록 위치될 수 있다. 따라서, 플렉서블 디스플레이는 실질적으로 가장자리가 외부로부터 보호될 수 있다. 일 실시예에 따르면, 전자 장치는 힌지 모듈을 지지하고, 전자 장치가 접힘 상태일 때, 외부로 노출되고, 펼힘 상태일 때, 제1 공간 및 제2 공간으로 인입됨으로서 외부로부터 보이지 않게 배치되는 힌지 하 우징(예: 힌지 커버)을 포함할 수 있다. 일 실시예에 따르면, 전자 장치는 플렉서블 디스플레이(예: 제1 디스플레이)와 별도로 배치되는 서브 디스플레이(예: 제2 디스플레이)를 포함할 수 있다. 일 실시예에 따르면, 서브 디스플레이는 제1 하 우징의 제2 면에 적어도 부분적으로 노출되도록 배치됨으로서, 접힘 상태일 경우, 플렉서블 디스플레 이의 표시 기능을 대체하는, 전자 장치의 상태 정보를 표시할 수 있다. 일 실시예에 따르면, 서브 디 스플레이는 제1 후면 커버의 적어도 일부 영역을 통해 외부로부터 보일 수 있게 배치될 수 있다. 어 떤 실시예에서, 서브 디스플레이는 제2 하우징의 제4 면에 배치될 수도 있다. 이러한 경우, 서 브 디스플레이는 제2 후면 커버의 적어도 일부 영역을 통해 외부로부터 보일 수 있게 배치될 수 있다. 일 실시예에 따르면, 전자 장치는 입력 장치(예: 마이크), 음향 출력 장치(201, 202), 센서 모듈, 카 메라 장치(예: 제1 카메라 장치, 및/또는 제2 카메라 장치), 키 입력 장치 또는 커넥터 포트 중 적어도 하나를 포함할 수 있다. 도시된 실시예에서, 입력 장치(예: 마이크), 음향 출력 장치(201, 202), 센서 모듈, 카메라 장치(예: 제1 카메라 장치, 및/또는 제2 카메라 장치), 키 입력 장치 또는 커넥터 포트는 제1 하우징 또는 제2 하우징에 형성된 홀 또는 형상을 지칭하고 있으 나, 전자 장치의 내부에 배치되고, 홀 또는 형상을 통해 동작하는 실질적인 전자 부품(예: 입력 장치, 음 향 출력 장치, 센서 모듈 또는 카메라 장치)을 포함하도록 정의될 수 있다. 일 실시예에 따르면, 입력 장치는 제2 하우징에 배치되는 적어도 하나의 마이크를 포함할 수 있다. 어떤 실시예에서, 입력 장치는 소리의 방향을 감지할 수 있도록 배치되는 복수 개의 마이크를 포함할 수 있다. 어떤 실시예에서, 복수 개의 마이크는 제1 하우징 및/또는 제2 하우징에서 적절한 위치에 배치될 수 있다. 일 실시예에 따르면, 음향 출력 장치(201, 202)는 스피커들을 포함할 수 있다. 일 실시예에 따 르면, 스피커들은, 제1 하우징에 배치되는 통화용 리시버와 제2 하우징에 배치되는 스피커(20 2)를 포함할 수 있다. 어떤 실시예에서, 입력 장치, 음향 출력 장치(201, 202) 및 커넥터 포트는 전자 장 치의 제1 하우징 및/또는 제2 하우징에 마련된 공간에 배치되고, 제1 하우징 및/또는 제2 하우징에 형성된 적어도 하나의 홀을 통하여 외부 환경에 노출될 수 있다. 일 실시예에 따르면, 적어도 하 나의 커넥터 포트는, 외부 전자 장치와 전력 및/또는 데이터를 송수신하기 위하여 사용될 수 있다. 어떤 실시예에서, 적어도 하나의 커넥터 포트(예: 이어잭 홀)는 외부 전자 장치와 오디오 신호를 송수신하기 위한 커 넥터(예: 이어잭)를 수용할 수도 있다. 어떤 실시예에서, 제1 하우징 및/또는 제2 하우징에 형성된 홀은 입력 장치 및 음향 출력 장치(201, 202)를 위하여 공용으로 사용될 수 있다. 어떤 실시예에서는 음향 출력 장치(201, 202)는 제1 하우징 및/또는 제2 하우징에 형성된 홀이 배제된 채, 동작되는 스피커(예: 피 에조 스피커)를 포함할 수도 있다. 일 실시예에 따르면, 센서 모듈은, 전자 장치의 내부의 작동 상태, 또는 외부의 환경 상태에 대응하 는 전기 신호 또는 데이터 값을 생성할 수 있다. 센서 모듈은, 예를 들어, 제1 하우징의 제1 면(21 1)을 통해 외부 환경을 검출할 수 있다. 어떤 실시예에서, 전자 장치는 제1 하우징의 제2 면을통해 외부 환경을 검출하도록 배치되는 적어도 하나의 센서 모듈을 더 포함할 수도 있다. 일 실시예에 따르면, 센서 모듈(예: 조도 센서)은 플렉서블 디스플레이 아래에서, 플렉서블 디스플레이를 통해 외부 환경을 검출하도록 배치될 수 있다. 일 실시예에 따르면, 센서 모듈은 제스처 센서, 자이로 센서, 기압 센 서, 마그네틱 센서, 가속도 센서, 그립 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 조도 센서, 근접 센서, 생체 센서, 초음파 센서 또는 조도 센서 중 적어도 하나를 포함할 수 있다. 일 실시예에 따르면, 카메라 장치(예: 제1 카메라 장치, 및/또는 제2 카메라 장치)는, 제1 하우징 의 제1 면에 배치되는 제1 카메라 장치(예: 전면 카메라 장치) 및 제1 하우징의 제2 면 에 배치되는 제2 카메라 장치를 포함할 수 있다. 전자 장치는 제2 카메라 장치 근처에 배 치되는 플래시를 더 포함할 수 있다. 일 실시예에 따르면, 카메라 장치(예: 제1 카메라 장치, 및/또 는 제2 카메라 장치)는 하나 또는 복수의 렌즈들, 이미지 센서, 및/또는 이미지 시그널 프로세서를 포함할 수 있다. 플래시는, 예를 들어, 발광 다이오드 또는 제논 램프(xenon lamp)를 포함할 수 있다. 일 실시예 에 따르면, 카메라 장치(예: 제1 카메라 장치, 및/또는 제2 카메라 장치)는 2개 이상의 렌즈들(광각 렌즈, 초광각 렌즈 또는 망원 렌즈) 및 이미지 센서들이 전자 장치의 한 면(예: 제1 면, 제2 면 , 제3 면, 또는 제4 면)에 위치하도록 배치될 수 있다. 어떤 실시예에서, 카메라 장치(예: 제1 카메라 장치, 및/또는 제2 카메라 장치)는 TOF(time of flight)용 렌즈들 및 이미지 센서를 포함할 수도 있다. 일 실시예에 따르면, 키 입력 장치(예: 키 버튼)는, 제1 하우징의 제1 측면 프레임의 제3 측면 (213c)에 배치될 수 있다. 어떤 실시예에서, 키 입력 장치는 제1 하우징의 다른 측면들(213a, 213b) 및/또는 제2 하우징의 측면들(223a, 223b, 223c) 중 적어도 하나의 측면에 배치될 수도 있다. 어떤 실시예 에서, 전자 장치는 키 입력 장치들 중 일부 또는 전부를 포함하지 않을 수 있고 포함되지 않은 키 입 력 장치는 플렉서블 디스플레이 상에 소프트 키 등 다른 형태로 구현될 수도 있다. 어떤 실시예에서, 키 입력 장치는 플렉서블 디스플레이에 포함된 압력 센서를 이용하여 구현될 수도 있다. 일 실시예에 따르면, 카메라 장치들(예: 제1 카메라 장치, 및/또는 제2 카메라 장치) 중 일부 카메라 장치 또는 센서 모듈은 플렉서블 디스플레이를 통해 노출되도록 배치될 수 있다. 예컨대, 제1 카메라 장치 또는 센서 모듈은 전자 장치의 내부 공간에서, 플렉서블 디스플레이에 적어도 부분적으로 형성된 오프닝(예: 관통홀)을 통해 외부 환경과 접할 수 있도록 배치될 수 있다. 일 실시예에 따르 면, 일부 센서 모듈은 전자 장치의 내부 공간에서 플렉서블 디스플레이를 통해 시각적으로 노출 되지 않고 그 기능을 수행하도록 배치될 수도 있다. 예컨대, 이러한 경우, 플렉서블 디스플레이의, 센서 모듈과 대면하는 영역은 오프닝이 불필요할 수도 있다. 도 3b를 참고하면, 전자 장치는 힌지 모듈을 통해 중간 상태(intermediate state)를 유지하도록 동작 될 수도 있다. 이러한 경우, 전자 장치는 제1 면과 대응하는 디스플레이 영역과, 제3 면과 대응 하는 디스플레이 영역에 서로 다른 컨텐츠가 표시되도록 플렉서블 디스플레이를 제어할 수도 있다. 일 실 시예에 따르면, 전자 장치는 힌지 모듈을 통해 일정 변곡 각도(예: 중간 상태일 때, 제1 하우징(21 0)과 제2 하우징 사이의 각도)를 기준으로 실질적으로 펼침 상태(예: 도 2a의 펼침 상태) 및/또는 실질적 으로 접힘 상태(예: 도 3a의 접힘 상태)로 동작될 수 있다. 예를 들어, 전자 장치는, 힌지 모듈을 통 해, 일정 변곡 각도로 펼쳐진 상태에서, 펼쳐지는 방향(B 방향)으로 가압력이 제공될 경우, 펼침 상태(예: 도 2a의 펼침 상태)로 천이되도록 동작될 수 있다. 예를 들어, 전자 장치는, 힌지 모듈을 통해, 일정 변 곡 각도로 펼쳐진 상태에서, 접히려는 방향(C 방향)으로 가압력이 제공될 경우, 닫힘 상태(예: 도 3a의 접힘 상 태)로 천이되도록 동작될 수 있다. 일 실시예에서, 전자 장치는, 힌지 모듈을 통해 다양한 각도에서 펼쳐진 상태를 유지하도록 동작될 수도 있다. 도 4을 참고하면, 전자 장치는 제1 측면 프레임, 제2 측면 프레임, 제1 측면 프레임과 제2 측면 프레임을 회동가능하게 연결하는 힌지 모듈을 포함할 수 있다. 일 실시예에 따르면, 전자 장치 는 제1 측면 프레임으로부터 적어도 부분적으로 연장되는 제1 지지 플레이트, 제2 측면 프레임 으로부터 적어도 부분적으로 연장되는 제2 지지 플레이트를 포함할 수 있다. 일 실시예에 따르면, 제1 지지 플레이트는 제1 측면 프레임과 일체로 형성되거나, 제1 측면 프레임과 구조적으로 결 합될 수 있다. 마찬가지로, 제2 지지 플레이트는 제2 측면 프레임과 일체로 형성되거나, 제2 측면 프레임과 구조적으로 결합될 수 있다. 일 실시예에 따르면, 전자 장치는 제1 지지 플레이트 및 제2 지지 플레이트의 지지를 받도록 배치되는 플렉서블 디스플레이를 포함할 수 있다. 일 실시예에 따르면, 전자 장치는 제1 측면 프레임 과 결합되고, 제1 지지 플레이트와의 사이에 제1 공간을 제공하는 제1 후면 커버 및 제2 측면 프레임과 결합되고, 제2 지지 플레이트와의 사이에 제2 공간을 제공하는 제2 후면 커버를 포함 할 수 있다. 어떤 실시예에서, 제1 측면 프레임과 제1 후면 커버는 일체로 형성될 수도 있다. 어떤 실시예에서, 제2 측면 프레임과 제2 후면 커버는 일체로 형성될 수 있다. 일 실시예에 따르면, 전자 장치는 제1 측면 프레임, 제1 지지 플레이트 및 제1 후면 커버를 통해 제공되는 제1 하우 징(예: 제1 하우징 구조)을 포함할 수 있다. 일 실시예에 따르면, 전자 장치는 제2 측면 프레임 , 제2 지지 플레이트 및 제2 후면 커버를 통해 제공되는 제2 하우징(예: 제2 하우징 구조)을 포함할 수 있다. 일 실시예에 따르면, 전자 장치는 제1 후면 커버의 적어도 일부 영역을 통 해 외부로부터 보일 수 있게 배치되는 서브 디스플레이를 포함할 수 있다. 일 실시예에 따르면, 전자 장치는 제1 측면 프레임과 제1 후면 커버 사이의 제1 공간에 배치되 는 제1 기판 어셈블리(예: 메인 인쇄 회로 기판), 카메라 어셈블리, 제1 배터리 또는 제1 브라 켓을 포함할 수 있다. 일 실시예에 따르면, 카메라 어셈블리는 복수의 카메라 장치들(예: 도 2a 및 도 3a의 카메라 장치들(예: 제1 카메라 장치, 및/또는 제2 카메라 장치)을 포함할 수 있으며, 제1 기판 어셈블리와 전기적 으로 연결될 수 있다. 일 실시예에 따르면, 제1 브라켓은 제1 기판 어셈블리 및/또는 카메라 어셈블리를 지지하기 위 한 지지 구조 및 향상된 강성을 제공할 수 있다. 일 실시예에 따르면, 전자 장치는 제2 측면 프레임과 제2 후면 커버 사이의 제2 공간에 배치되 는 제2 기판 어셈블리(예: 서브 인쇄 회로 기판), 안테나(예: 코일 부재), 제2 배터리 또는 제2 브라켓을 포함할 수 있다. 일 실시예에 따르면, 전자 장치는 배선 부재(예: 연성 회로(FPCB(flexible printed circuit boar d))를 포함할 수 있다. 일 실시예에 따른 배선 부재는 제1 기판 어셈블리로부터 힌지 모듈을 가 로질러, 제2 측면 프레임과 제2 후면 커버 사이에 배치되는 복수의 전자 부품들(예: 제2 기판 어셈블 리, 제2 배터리 또는 안테나)까지 연장되도록 배치될 수 있다. 일 실시예에 따르면, 제1 기판 어셈블리 및 제2 기판 어셈블리 및 배선 부재는 서로에 대해 전 기적으로 연결되거나, 작동적으로 연결되거나, 또는 일체로 형성될 수 있다. 일 실시예에 따르면, 제1 기판 어 셈블리와 상기 제2 기판 어셈블리가 일체로 형성되고 전기적인 신호 또는 파장을 송수신할 수 있게 됨에 따라, 상기 배선 부재는 생략될 수도 있다. 일 실시예에 따르면, 전자 장치는 하나 또는 둘 이상의 배터리들(예: 제1 배터리 및/또는 제2 배터리 )를 포함할 수 있다. 예를 들어, 하나 또는 둘 이상의 배터리는, 제1 하우징에 대응하는 영역에 배치 되는 제1 배터리, 및 제2 하우징에 대응하는 영역에 배치되는 제2 배터리 중 적어도 하나를 포 함할 수 있다. 일 실시예에 따른 전자 장치는 제1 배터리 및/또는 제2 배터리 중 어느 하나의 배터리를 포함하거나, 또는 제1 배터리 및/또는 제2 배터리 둘 모두를 포함할 수 있다. 일 실시예에 따르면, 전자 장치는 플렉서블 배터리를 포함할 수 있다. 플렉서블 배터리는 제1 하우징 및 제2 하우징 각각의 적어도 일부에 걸쳐 배치될 수 있다. 플렉서블 배터리는 제1 하우징에 대응하 는 영역의 일부, 제2 하우징에 대응하는 영역의 일부와 중첩되도록 배치될 수 있다. 플렉서블 배터리는, 제1 하우징과 제2 하우징이 서로에 대해 분리되는 경계에, 배터리 힌지부를 포함할 수 있다. 배터리 힌지부는 물리적으로 얇은 두께로 형성될 수 있다. 배터리 힌지부는, 폴딩 축(예: 축 F)과 대응되는 위치에 마 련되어, 플렉서블 배터리는 전자 장치가 폴딩되는 것에 따라 폴딩될 수 있다. 일 실시예에 따르면 플렉서블 배터리의 배터리 힌지부는 물리적인, 또는 전기적인 커넥터일 수 있다. 플렉서블 배터리는 제1 배터리 섹션, 제2 배터리 섹션 및 상기 제1 배터리 섹션과 상기 제2 배터리 섹션을 전기적으로 또 는 작동적으로 연결시키는 커넥터를 포함할 수 있다. 상기 제1 배터리 섹션과 상기 제2 배터리 섹션은 커넥터를 통해 서로에 대해 전기적으로 또는 작동적으로 연결될 수 있다. 상기 커넥터는 상기 플렉서블 배터리를 구성하 는 부품으로서, 상기 플렉서블 배터리의 외부 또는 내부에 마련될 수 있다. 단, 일 실시예에 따르면, 상기 커넥 터는 비전도선 커넥터로서 상기 제1 배터리 섹션과 상기 제2 배터리 섹션을 물리적으로 연결할 수도 있다. 일 실시예에 따르면, 안테나는 NFC(near field communication) 안테나, 무선 충전 안테나, 및/또는 MST(magnetic secure transmission) 안테나를 포함할 수 있다. 안테나는, 예를 들어, 외부 장치와 근거리 통신을 하거나, 충전에 필요한 전력을 무선으로 송수신할 수 있다. 일 실시예에 따르면, 전자 장치는 힌지 모듈을 지지하고, 전자 장치가 접힘 상태(예: 도 3a의 접힘 상태)일 때, 외부로 노출되고, 펼침 상태(예: 도 2a의 펼침 상태)일 때, 제1 공간 및/또는 제2 공간으로 인입됨으로서 외부로부터 보이지 않게 배치되는 힌지 하우징(예: 힌지 커버)을 포함할 수 있다. 일 실시예에 따르면, 전자 장치는 제1 측면 프레임의 가장자리를 따라 결합되는 제1 보호 커버 를 포함할 수 있다. 일 실시예에 따르면, 전자 장치는 제2 측면 프레임의 가장자리를 따라 결합되는 제2 보호 커버를 포함할 수 있다. 일 실시예에 따르면, 플렉서블 디스플레이는 제1 평면부(예: 도 2b 의 제1 평면부(230a))의 가장자리가 제1 보호 커버에 의해 보호될 수 있다. 일 실시예에 따르면, 플렉서블 디스플레이는 제2 평면부(예: 도 2b의 제2 평면부(230b))의 가장자리가 제2 보호 커버에 의해 보호될 수 있다. 일 실시예에 따르면, 전자 장치는 플렉서블 디스플레이의 힌지 모듈과 대응되는 굴곡 가능부(예: 도 2b의 굴곡 가능부(230c))의 가장자리를 보호하기 위하여 배치되는 보호 캡을 포함할 수 있 다. 도 5는, 본 개시의 다양한 실시예에 따른 플렉서블 디스플레이의 분리 사시도이다. 도 5를 참조하면, 다양한 실시예에 따른 플렉서블 디스플레이는, 윈도우층, 윈도우층의 배면에 순차적으로 배치되는 편광층(polarizer), 디스플레이 패널, 폴리머층, 금속 시트층 및 보 강 플레이트를 포함할 수 있다. 일 실시예에 따르면, 윈도우층, 편광층, 디스플레이 패널, 폴리머층 및 금속 시트층 은 제1 하우징(예: 도 2a의 제1하우징)의 제1 면(예: 도 2a의 제1 면)과 제2 하우징(예: 도 2a의 제 2 하우징)의 제3 면(예: 도 2a의 제3면)의 적어도 일부를 가로지르도록 배치될 수 있다. 일 실시예에 따르면, 보강 플레이트는 제1 하우징과 대면하는 제1 보강 플레이트 및 제2 하우징 과 대면하는 제 2보강 플레이트를 포함할 수 있다. 일 실시예에 따르면, 윈도우층, 편광층, 디스플레이 패널, 폴리머층, 금속 시트층 및 보강 플레이트는 점착제(P)(또는 접착제)를 통해 서로에 대하여 부착될 수 있다. 예컨대, 점착제(P)는 OCA(optical clear adhesive), PSA(pressure sensitive adhesive), 열반응 접착제, 일반 접착제 또는 양면 테 이프 중 적어도 하나를 포함할 수 있다. 일 실시예에 따르면, 디스플레이 패널은 복수의 픽셀들 및 배선 구조(예: 전극 패턴)를 포함할 수 있다. 일 실시예에 따르면, 편광층은 디스플레이 패널의 광원으로부터 발생되고 일정한 방향으로 진동하는 빛을 선택적으로 통과시킬 수 있다. 일 실시예에 따르면, 디스플레이 패널과 편광층은 일체로 형성 될 수도 있다. 일 실시예에 따르면, 플렉서블 디스플레이는 터치 패널(미도시)을 포함할 수도 있다. 일 실시예에 따르면, 폴리머층은 디스플레이 패널 아래(예: -z축방향)에 배치될 수 있다. 예를 들어, 폴리머층은 디스플레이 패널의 시인성 확보를 위한 어두운 배경을 제공할 수 있다. 또한, 폴 리머층은 완충 작용을 위한 완충 소재로 형성될 수 있다. 일 실시예에서, 플렉서블 디스플레이의 방 수를 위하여, 폴리머층은 제거되거나, 금속 시트층 아래에 배치될 수도 있다. 일 실시예에 따르면, 금속 시트층은 플렉서블 디스플레이에 굴곡성을 제공하는 형상으로 형성될 수 있다. 일 실시예에 따르면, 금속 시트층은 스테인리스강(STS, stainless steel), Cu, Al 또는 금속 CLAD(예: STS와 Al이 교번하여 배치된 적층 부재) 중 적어도 하나를 포함할 수 있다. 일 실시예에 따르면, 금속 시트층은 제1 하우징과 대응되는 제1 평면부, 제2 하우징과 대 응되는 제2 평면부 및 제1 평면부와 제2 평면부를 연결하는 벤딩부를 포함할 수 있다. 일 실시예에 따르면, 벤딩부는 지정된 간격으로 배치된 복수의 오프닝들을 포함할 수 있다. 일 실 시예에 따르면, 벤딩부는 복수의 오프닝들 중 적어도 일부 오프닝들의 크기, 형상 또는 배치 밀도 중 적어도 하나를 통해, 굴곡 특성이 결정될 수 있다. 일 실시예에서, 금속 시트층은 기타 다른 합금 소 재를 포함할 수도 있다. 일 실시예에서, 금속 시트층은 전자 장치(예: 도 2a의 전자 장치)의 강성 보강에 도움을 줄 수 있고, 주변 노이즈를 차폐하며, 주변의 열 방출 부품으로부터 방출되는 열을 분산시키기 위하여 사용될 수 있다. 일 실시예에서, 금속 시트층은 디스플레이 패널을 지지하기 위한 리지드 (rigid)한 특성을 갖는 FRP(fiber reinforced plastics)(예: CFRP(carbon fiber reinforced plastics) 또는GFRP(glass fiber reinforced plastics))와 같은, 비금속 박판형 소재로 대체될 수도 있다. 일 실시예에 따르면, 플렉서블 디스플레이는 금속 시트층 아래(예: -z축 방향)에 배치되고, 전자 펜 (예: 스타일러스)의 입력을 수용 받는 검출 부재로써, 디지타이저를 포함할 수 있다. 디지타이저는, 예를 들어, 전자 펜으로부터 인가된 전자기 유도 방식의 공진 주파수를 검출할 수 있도록 유전체 기판상에 배치 되는 코일 부재를 포함할 수 있다. 일 실시예에서, 디지타이저는 폴리머층과 금속 시트층 사이에 배치될 수 있으나, 본 개시가 이 에 제한되는 것은 아니다. 일 례로, 디지타이저는 금속 시트층과 보강 플레이트 사이에 배치될 수도 있다. 일 실시예에 따르면, 플렉서블 디스플레이는 폴리머층과 금속 시트층 사이, 또는 금속 시트층 아래에 배치되는 적어도 하나의 기능성 부재(미도시)를 포함할 수도 있다. 기능성 부재는, 예를 들어, 방열을 위한 그라파이트 시트, added 디스플레이, 포스터치 FPCB, 지문 센서 FPCB, 통신용 안테나 방사체 또는 도전/비도전 테이프를 포함할 수 있다. 일 실시예에서, 기능성 부재는 벤딩이 불가능할 경우, 제1 하우징(21 0)과 제2 하우징에 개별적으로 배치될 수도 있다. 일 실시예에서, 기능성 부재는 벤딩이 가능할 경우, 제 1 하우징으로부터 힌지 모듈(예: 도 4의 힌지 모듈)을 통해 제2 하우징)의 적어도 일부까지 배 치될 수 있다. 일 실시예에 따르면, 전자 장치)는 플렉서블 디스플레이 아래에 배치되고, 플렉서블 디스플레이(30 0)를 통해 외부 환경을 검출하는 카메라 장치(예: 도 2a의 제1 카메라 장치)를 포함할 수 있다. 일 실시예에 따르면, 전자 장치는 플렉서블 디스플레이 아래에 배치되는 적어도 하나의 센서 모듈(예: 도 2a의 센서 모듈)(예: 조도 센서, 근접 센서, 또는 TOF 센서)를 포함할 수 있다. 일 실시예에 따르면, 편광층, 디스플레이 패널, 폴리머층, 금속 시트층, 디지타이저 및 보강 플레이트는 관통홀(3201, 3301, 3401, 3501, 3601, 3701)을 포함할 수 있다. 일 실시예에서, 디 스플레이 패널 및/또는 편광층은 해당 영역의 투과율 조절을 통해 관통홀(3201, 3301)이 불필요할 수 도 있다. 일 실시예에서, 관통홀들(3201, 3301, 3401, 3501, 3601, 3701)의 크기는 카메라 장치의 크기, 및/또는 카메라 장치의 화각에 기반하여 형성될 수 있으며, 각각의 관통홀들(3201, 3301, 3401, 3501, 3601, 3701)의 크기는 서로 상이할 수 있다. 일 실시예에 따르면, 윈도우층은 글래스층(예: 도 7의 글래스층)을 포함할 수 있다. 일 실시예에 따 르면, 글래스층은 플렉서블 디스플레이의 벤딩 가능한 부분(예: 도 2b의 굴곡 가능부(230c))과 대응 하는 영역에 배치되고, 글래스층의 표면보다 낮게 형성된 복수의 패턴들(예: 도 7의 복수의 제1 패턴 및 복수의 제2 패턴)을 포함함으로써, 플렉서블 디스플레이의 터치감 및/또는 굴곡성 개선에 도움을 줄 수 있다. 일 실시예에 따르면, 복수의 패턴들(3113, 3114)은 패턴 별로 내부에 다른 모듈러스, 경도 또는 분자량을 갖는 충진 부재(예: 도 7의 제1 충진 부재 및 제2 충진 부재)가 충진됨으로써, 플렉서블 디스플레이 의 터치감 및/또는 굴곡성을 향상시킬 수 있다. 이하, 윈도우층에 대하여 상세히 기술하도록 한다. 도 6은, 본 개시의 다양한 실시예에 따른 윈도우층의 평면도이다. 도 7은, 도 6에 도시된 선 I-I'를 따라 절개 한 단면도이다. 도 8은, 도 6에 도시된 A 부분의 확대도이다. 도 6 내지 도 8을 참조하면, 일 실시예에 따른 윈도우층은 전자 장치(예: 도 2a의 전자 장치)의 제1 하우징(예: 도 2a의 제1 하우징)에 대응하는 제1영역(310a)과, 제2 하우징(예: 도 2a의 제2 하우징) 에 대응하는 제2 영역(310b) 및 힌지 모듈 (예: 도 7의 힌지 모듈 )와 대응하는 제3 영역(310c)을 포함할 수 있다. 일 실시예에 따르면, 제3 영역(310c)은 폴딩축(F)을 기준으로, 전자 장치의 접힘 동작에 따라 디스플레이 패널(예: 도 5의 디스플레이 패널)과 함께 벤딩 가능하게 변형될 수 있다. 일 실시예에 따르면, 윈도우층은 전자 장치의 외부 방향을 향하는 제1 면 및 제1 면과 반대인 디스플레이 패널 방향을 향하는 제2 면을 포함하는 글래스층을 포함할 수 있다.일 실시예에 따르면, 글래스층의 하측(예: -z축 방향)에는 편광층 및/또는 디스플레이 패널이 적층 될 수 있다. 일 실시예에서, 글래스층(구체적으로, 제2 평탄화층)과 편광층 및/또는 디스플레 이 패널은 점착제(P)를 통해 서로에 대해 부착될 수 있다. 일 실시예에 따르면, 글래스층의 제1 면에는 코팅층이 적층될 수 있다. 일 실시예에 따르면, 코팅층은 하드 코팅층(hard coating layer) 및/또는 지문 방지층(anti fingerprint layer)을 포함할 수 있다. 일 실시예에서, 코팅층은 글래스층 및/또는 후술하는 제1 충진 부재보다 높은 경도 값을 갖는 물질로 형성될 수 있다. 예를 들어, 코팅층은 H(hardness) 이상의 표면 경도를 가질 수 있다. 일 실시예서, 코팅층은 표면에는 지문 방지를 위한 화합물이 코팅될 수 있다. 일 실시예에서, 코팅층은 물 접촉각이 95도 이상인 소수성을 가질 수 있다. 일 실시예에 따르면, 글래스층은 제1 면에서 상기 제1 면보다 낮게 형성되고, 소정 간격으로 이격 배치된 복수의 제1 패턴을 포함할 수 있다. 일 실시예에 따르면, 글래스층은 제2 면에 서 상기 제2 면보다 낮게 형성되고, 소정 간격으로 이격 배치된 복수의 제2 패턴을 포함할 수 있다. 일 실시예에서, 복수의 제1 패턴과 복수의 제2 패턴은 글래스층의 박육부(예: 도 15의 제3 스페이서)를 사이에 두고 서로 이격되게 배치될 수 있다. 일 실시예에 따르면, 복수의 제1 패턴 및 복수의 제2 패턴은 윈도우층의 제3 영역(310c)에 위치할 수 있다. 예컨대, 복수의 제1 패턴 및 복수의 제2 패턴은 플렉서블 디스플레이(예: 도 2b 의 플렉서블 디스플레이)의 굴곡 가능부(예: 도 2b의 굴곡 가능부(230c)에 대응하는 글래스층의 일 영역에 위치할 수 있다. 일 실시예에 따르면, 복수의 제1 패턴 및 복수의 제2 패턴은 다양한 형상을 가질 수 있다. 일 예 로, 복수의 제1 패턴 및 복수의 제2 패턴은, 도 8의 (a)에 도시된 바와 같이, 전체적으로 물결 형 상을 갖도록 폴딩 축(F)을 따라 연장 형성될 수 있다. 일 예에서, 복수의 제1 패턴 및 복수의 제2 패턴 은, 도 8의 (b)에 도시된 바와 같이, 일 직선(예: 수평선) 형상을 갖도록 폴딩 축(F)을 따라 연장 형성될 수 있다. 일 예에서, 복수의 제1 패턴 및 복수의 제2 패턴은, 도 8의 (c)에 도시된 바와 같이, 지 그 재그(또는, 셰브론) 형상을 갖도록 폴딩 축(F)을 따라 연장 형성될 수 있다. 일 실시예에 따르면, 윈도우층은 복수의 제1 패턴에 충진되는 제1 충진 부재를 포함할 수 있다. 일 실시예에 따르면, 윈도우층은 복수의 제2 패턴에 충진되는 제2 충진 부재를 포함할 수 있다. 일 실시예에 따르면, 제1 충진 부재 및 제2 충진 부재는 탄성을 갖는 물질을 포함할 수 있다. 일 실 시예에서, 제1 충진 부재 및 제2 충진 부재는 실질적으로 투명한 물질로써, 최초 액상 또는 반 고상 형태로 패턴들(3113, 3114)에 충진된 후, 시간이 경과하거나 광을 조사하거나 화학적 처리를 통해 경화되는 물 질을 포함할 수 있다. 제1 충진 부재 및 제2 충진 부재는, 예를 들어, 실리콘(silicon), 우레탄 (urethane) 또는 아크릴(acrylic)과 같은 레진(resin)을 포함할 수 있다. 구체적으로, 제1 충진 부재 및 제2 충진 부재는 광 접착 레진(OCR, optically clear resin)에 해당할 수 있다. 일 실시예에 따르면, 제1 충진 부재는, 글래스층과 충진 부재 간의 터치감의 차이를 감소시키도 록, 글래스층의 모듈러스, 경도 또는 분자량과 실질적으로 동일한 모듈러스, 경도 또는 분자량을 가질 수 있다. 일 실시예서, 제1 충진 부재는 20MPA 내지 400MPA의 모듈러스를 가질 수 있다. 이 경우, 사용자의 디스플레이 터치(또는, 스와이프) 시, 충진 부재의 변형/미세 이동이 감소되어 글래스층과 충진 부재 사이의 터치감 차이가 감소될 수 있다. 일 실시예에 따르면, 제2 충진 부재는 제1 충진 부재와 다른 모듈러스, 경도 또는 분자량을 가질 수 있다. 일 실시예서, 제2 충진 부재는 제1 충진 부재의 모듈러스, 경도 또는 분자량보다 낮은 모듈러 스, 경도 또는 분자량을 가질 수 있다. 일 실시예에서, 제1 충진 부재는 20 내지 400MPA의 모듈러스를 가 지며, 제2 충진 부재는 0.005 내지 10MPA의 모듈러스를 갖도록 설계될 수 있다. 예를 들어, 제1 충진 부재와 제2 충진 부재가 400MPA의 동일한 모듈러스를 갖는 경우, 플렉서블 디스 플레이의 굴곡 가능부(230c)에 1.1532e [N·mm]의 폴딩 저항력(또는, 반발력)이 인가될 수 있다. 예를 들 어, 제1 충진 부재가 400MPA의 모듈러스를 가지며, 제2 충진 부재가 0.03MPA의 모듈러스를 갖는 경우, 플렉서블 디스플레이의 굴곡 가능부(230c)에 1.1532e [N·mm]의 폴딩 저항력(또는, 반발력)이 인가 될 수 있다. 이 경우, 제1 충진 부재와 제2 충진 부재가 400MPA의 동일한 모듈러스를 갖는 경우와대비하여, 폴딩 저항력이 24% 개선(감소) 될 수 있다. 결과적으로, 제2 충진 부재의 모듈러스, 경도 또는 분자량을 제1 충진 부재보다 낮게 설계함으로써, 제1 충진 부재의 모듈러스, 경도 또는 분자량이 증가함에 따라 상승하는 폴딩 저항력(또는, 반발력)을 상 쇄시킬 수 있다. 일 실시예에 따르면, 복수의 제1 패턴은 제1 면으로부터 소정 깊이(d1)를 갖도록 함몰 형성될 수 있다. 일 실시예에 따르면, 복수의 제2 패턴은 제2 면으로부터 소정 깊이(d2)를 갖도록 함몰 형성 될 수 있다. 일 실시예에 따르면, 복수의 제1 패턴의 깊이(d1)와 복수의 제2 패턴의 깊이(d2)는 실질적으로 동 일할 수 있다. 일 실시예에 따르면, 복수의 제1 패턴의 깊이(d1)와 복수의 제2 패턴의 깊이(d2)는 다를 수 있다. 일 실시예에서, 복수의 제1 패턴의 깊이(d1)는 복수의 제2 패턴의 깊이(d2)보다 얕을 수 있다(도 7 참조). 예를 들어, 제1 충진 부재가 400MPA의 모듈러스를 가지며, 제2 충진 부재가 0.03MPA의 모듈러스를 가 지며, 복수의 패턴들(3113, 3114)의 깊이가 동일한 경우(d1=d2), 플렉서블 디스플레이의 굴곡 가능부 (230c)에 1.1532e [N·mm]의 폴딩 저항력(또는, 반발력)이 인가될 수 있다. 예를 들어, 제1 충진 부재가 400MPA의 모듈러스를 가지며, 제2 충진 부재가 0.03MPA의 모듈러스를 가지며 복수의 패턴들(3113, 3114)의 깊이가 다른 경우(d1≠d2), 예컨대 복수의 제1 패턴의 깊이(d1)와 복수의 제2 패턴의 깊이(d2)가 1:2.2인 경우, 플렉서블 디스플레이의 굴곡 가능부(230c)에 6.4054e-1 [N·mm]의 폴딩 저항력(또는, 반발력)이 인가될 수 있다. 이 경우, 제1 충진 부재가 400MPA의 모듈러스를 가지며, 제2 충진 부재 가 0.03MPA의 모듈러스를 가지며, 복수의 패턴들(3113, 3114)의 깊이가 동일한 경우와 대비하여, 폴딩 저항력이 27% 개선(감소) 될 수 있다. 또한, 제1 충진 부재와 제2 충진 부재가 400MPA의 모듈러스를 가지며, 복수의 패턴들(3113, 3114)의 깊이가 동일한 경우와 대비하여, 폴딩 저항력이 44% 개선(감소) 될 수 있다. 일 실시예에 따르면, 글래스층의 제1 면에는 제1 평탄화층(예: 도 14의 제1 평탄화층이 적층 될 수 있다. 도 7에 도시된 바와 같이, 제1 평탄화층은 생략될 수도 있다. 이하, 제1 평탄화층이 윈도우층 에 적층된 실시예에 대해서는 도 14를 참조하여 후술하도록 한다. 일 실시예에 따르면, 글래스층의 제2 면에는 제2 평탄화층이 적층될 수 있다. 일 실시예에서, 제2 평탄화층은 복수의 제2 패턴에 충진된 제2 충진 부재에 의해 거칠어진 제2 면을 실질적으로 평편한 면을 갖도록 유도할 수 있다. 일 실시예에서, 제2 평탄화층은 제2 충진 부재와 실질적으로 동일한 물질로 구성될 수 있다. 이러한 경우, 제2 평탄화층은 복수의 제2 패턴 에 제2 충진 부재가 충진 시, 함께 형성될 수 있다. 도 9는, 본 개시의 일 실시예에 따른 글래스층의 두께 별 강도 시뮬레이션 결과를 나타내는 그래프이다. 도 9의 X축은 글래스층의 두께(H)를 나타내며, 도 9의 Y1축(도면 상 좌측에 해당하는 Y축)은 펜 낙하(pen drop) 높이(cm)를 나타내며, 도 9의 Y2축(도면 상 우측에 해당하는 Y축)은 펜 가압력(kgf)을 나타낸다. 이 때, 시뮬레이션에서 사용되는 펜의 스펙(spec)은 5.8g과 0.3pi를 만족할 수 있다. 도 9를 참조하면, 일 실시예에 따른 글래스층(예: 도 7의 글래스층의 두께(H)는 100um 이상으로 설계될 수 있다. 이 경우, 글래스층은 펜 낙하 높이 100cm와 2.7kgf 이상의 내충격성을 만족할 수 있다. 도 10은, 본 개시의 일 실시예에 따른 제1 충진 부재의 두께 별 펜 가압 시뮬레이션 결과를 나타내는 그래프이 다. 도 10의 X축은 제1 충진 부재(예: 도 7의 제1 충진 부재)의 두께(um)를 나타내며, 도 10의 Y축은 글래스층 (예: 도 7의 글래스층)의 최대 응력(또는, 파손 강도)(MPa)를 나타낸다. 도 10을 참조하면, 본 개시의 일 실시예에 따른 제1 충진 부재의 두께는 20um 이상으로 설계될 수 있다. 여기서, 제1 충진 부재의 두께는 복수의 제1 패턴(예: 도 7의 복수의 제1 패턴의 깊이(d1))와 실질 적으로 동일한 값을 의미할 수 있다. 이 경우, 글래스층의 최대 응력(또는, 파손 강도)는 3000MPA를 만족 하며, 0.3kgf 이상의 펜 가압(5.8g, 0.3pi) 강도를 유지할 수 있다. 도 11은, 본 개시의 일 실시예에 따른 윈도우층의 제조 공정도이다. 도 12는, 본 개시의 일 실시예에 따른 글 래스층에 복수의 패턴들을 성형하는 공정을 나타내는 도면이다. 도 13은, 본 개시의 일 실시예에 따른 복수의 패턴들에 충진 부재를 충진하는 공정을 나타내는 도면이다. 도 11을 참조하면, 윈도우층(예: 도 5의 윈도우층) 제조를 위해, 글래스 모재(311a)가 마련될 수 있다 . 일 실시예에 따르면, 글래스 모재(311a)는 디스플레이를 보호하고, 외부 전자 장치(예: 전자 펜)의 접 촉에 따른 내압 특성을 갖는 두께로 마련될 수 있다. 예컨대, 글래스 모재(311a)는 전술한 바와 같이 100um 이 상의 두께를 갖도록 설계될 수 있다. 일 실시예에 따르면, 윈도우층 제조 공정은, 글래스층에 복수의 패턴들(예: 도 7의 복수의 제1 패턴 및 복수의 제2 패턴)을 성형하는 공정을 포함할 수 있다. 일 실시예에 따르면, 글래스층에 복수의 패턴들(3113, 3114)을 성형하는 공정은 글래스 모재(311a)의 패턴부(L1, L2)에 레이저를 통해 패 턴 라인을 성형하는 공정을 포함할 수 있다. 일 실시예에 따르면, 글래스층에 복수의 패턴들(3113, 3114)을 성형하는 공정은 패턴 라인을 에칭(etching)하는 공정을 포함할 수 있다. 이하, 도 12의 (a) 내지 (e)를 참조하여, 글래스층에 복수의 패턴들(3113, 3114)을 형성하기 위한 제조 공 정을 설명한다. 일 실시예에 따르면, 글래스 모재(311a)의 제2 면은, 에칭(etching)을 막기 위해, 마스킹 부재(M)를 부착 할 수 있다(도 12의 (a)). 일 실시예에 따르면, 글래스 모재(311a)의 제1 면에 위치하는 패턴부(L1)에 소정 간격으로 레이저 또는 베셀 빔(bessel beam)을 조사하여 복수의 패턴 라인을 형성할 수 있다(도 12의 (b)). 구체적으로, 레이저 또는 베셀 빔에 의해 글래스 모재(311a)의 패턴부(L1)에 복수의 패턴 라인이 수직으로 상 변화될 수 있다. 여기서, 상기 패턴부(L1)는 윈도우층의 제3 영역(예: 도 6의 제3 영역(310c))에 대응하는 일 영역을 의미할 수 있 다. 일 실시예에 따르면, 제1 면에 패턴 라인이 형성된 글래스 모재(311b)를 에칭 용액에 디핑(dipping)하여 복수의 제1 패턴을 형성할 수 있다(도 12의 (c)). 여기서, 상기 에칭 용액은 다양한 산/염기성 용액을 포함할 수 있다. 예를 들어, 상기 에칭 용액은 플루오린화 암모늄(NH4F), 황산(H2SO4), 질산(HNO3), 플루오린 화 규소산(H2SiF6), 수산화나트륨(NaOH), 및/또는 플루오린화 수소산(HF)을 포함할 수 있다. 이 경우, 레이저 또는 베셀 빔에 의해 상 변화된 복수의 패턴 라인에 에칭 용액이 침투하며 소정 깊이를 갖는 복수의 제1 패턴 이 형성될 수 있다. 일 실시예에 따르면, 글래스 모재(311c)의 제2 면에 부착된 마스킹 부재(M)를 탈막 시킨 뒤, 글래스 모재 (311c)의 제2 면에 위치하는 패턴부(L2)에 소정 간격으로 레이저 또는 베셀 빔(bessel beam)을 조사하여 복수의 패턴 라인을 형성할 수 있다(도 12의 (d)). 일 실시예에 따르면, 제2 면에 패턴 라인이 형성된 글래스 모재(311d)를 에칭 용액에 디핑(dipping)하여 복수의 제2 패턴을 형성할 수 있다(도 12의 (e)). 일 실시예에 따르면, 윈도우층 제조 공정은, 글래스층에 마련된 복수의 패턴들(3113, 3114)에 충진 부재들 (312, 313)을 충진하는 공정을 포함할 수 있다. 이하, 도 13의 (a) 내지 (f)를 참조하여, 글래스층에 충진 부재들(312, 313)을 충진하기 위한 제조 공정을 설명한다. 일 실시예에 따르면, 글래스층의 제2 면에 마스킹 부재(M)를 부착한 뒤(도 13의 (a)), 제1 면(311 1)에 걸쳐 제1 충진 부재를 도포할 수 있다(도 13의 (b)). 이 경우, 제1 면에 마련된 복수의 제1 패턴에 제1 충진 부재가 충진 될 수 있다. 일 실시예에 따르면, 글래스층의 재질감을 극대화하기 위해, 기포와 함께 여분의 제1 충진 부재를 제거할 수 있다(도 13의 (c)). 일 실시예에 따르면, 글래스층의 제1 면에 마스킹 부재(M)를 부착한 뒤, 제1 충진 부재를 소정 시간동안 경화 시킬 수 있다(도 13의 (d)). 일 실시예에 따르면, 글래스층의 제2 면에 부착된 마스킹 부재(M)를 분리한 뒤, 글래스층을 상 하로 뒤집어 제2 면에 걸쳐 제2 충진 부재를 도포할 수 있다(도 13의 (e)).일 실시예에 따르면, 기포를 제거와 함께 제1 면에 부착된 마스킹 부재(M)를 분리한 뒤, 제2 충진 부재 를 소정 시간동안 경화 시킬 수 있다. 이후, 글래스층의 양면(3111, 3112)에 보호 비닐(PF)을 부착 시킬 수 있다(도 13의 (f)). 도 14는, 본 개시의 일 실시예에 따른 플렉서블 디스플레이의 단면도이다. 도 14를 참조하면, 일 실시예에 따른 글래스층의 제1 면에는 제1 평탄화층이 적층될 수 있다. 일 실시예에 따르면, 제1 평탄화층은 복수의 제1 패턴에 충진된 제1 충진 부재에 의해 거칠어 진 제1 면을 실질적으로 평평한 면을 갖도록 유도할 수 있다. 일 실시예에서, 제1 평탄화층은 제1 충진 부재와 실질적으로 동일한 물질로 구성될 수 있다. 이러한 경우, 제1 평탄화층은 복수의 제1 패턴에 제1 충진 부재가 충진 시, 함께 형성될 수 있다. 이 경우, 글래스층의 제1 면 전체가 동일한 소재로 노출됨에 따라 윈도우층(예: 도 6의 윈도우층 )의 모든 영역(예: 도 6의 제1 영역(310a) 내지 제3 영역(310c)) 간의 터치감 차이가 완화될 수 있다. 또한, 윈도우층 제조 공정에 있어, 도 13의 (c)에 도시된 바와 달리, 여분의 제1 충진 부재를 제거하는 공정이 삭제됨에 따라 공정 비용이 감소될 수 있다. 일 실시예에 따르면, 제1 평탄화층의 두께는, 10 내지 30um 범위를 가질 수 있다. 이 경우, 글래스층 의 재질감에 따른 터치감 손실을 완화할 수 있다. 도 15는, 본 개시의 일 실시예에 따른 글래스층의 단면도이다. 도 15를 참조하면, 일 실시예에서, 복수의 제1 패턴들 사이에는 제1 스페이서가 형성될 수 있다. 일 실시예에서, 제1 스페이서는 복수의 제1 패턴 형성 시, 함께 형성될 수 있다. 일 실시예에서, 제1 스페이서의 두께(Ta)는 복수의 제1 패턴들 사이의 간격을 의미할 수 있다. 일 실시예에 따르면, 복수의 제2 패턴들 사이에는 제2 스페이서가 형성될 수 있다. 일 실시예에서, 제2 스페이서는 복수의 제2 패턴 형성 시, 함께 형성될 수 있다. 일 실시예에서, 제2 스페이서의 두께(Tb)는 복수의 제2 패턴들 사이의 간격을 의미할 수 있다. 일 실시예에서, 제1 스 페이서와 제2 스페이서의 두께(Ta, Tb)는 실질적으로 동일할 수 있으나, 본 개시가 이에 제한되는 것은 아니다. 일 실시예에 따르면, 복수의 제1 패턴과 복수의 제2 패턴 사이에는 제3 스페이서가 형성될 수 있다. 일 실시예에서, 복수의 제1 패턴과 복수의 제2 패턴은 제3 스페이서를 사이에 두 고 서로에 대해 소정 간격(Tc) 이격 배치될 수 있다. 일 실시예에 따르면, 복수의 제1 패턴과 복수의 제2 패턴 사이의 제3 스페이서는 글래스층에 실질적으로 평행한 면으로 형성될 수 있다. 예를 들 어, 제1 스페이서는 제3 스페이서에 대해 실질적으로 수직하게 형성될 수 있다. 예를 들어, 제2 스 페이서는 제3 스페이서에 대해 실질적으로 수직하게 형성될 수 있다. 이 경우, 제1 스페이서 와 제2 스페이서는 제3 스페이서를 기준으로 서로 반대 방향으로 연장될 수 있다. 일 실시예에 따르면, 글래스층은, 디스플레이 보호를 위해 표면을 알칼리 이온의 교환에 의한 화학 강화 처리할 수 있다. 여기서, 상기 알칼리 이온은 K+ 이온을 포함할 수 있다. 이 경우, 글래스층 내부의 Na+ 이온과 K+ 이온이 치환됨으로써 글래스층의 표면에 압축 응력이 형성되어 글래스층의 내충격 강도가 향상될 수 있다. 이 때, 글래스층의 화학 강화 처리는 글래스층의 구성 중 가장 얇은 부분(박육부), 예컨대 전술한 스페이서들(3115, 3116, 3117)을 기준으로 진행될 수 있다. 표 1 두께 (um)압축 응력 (MPa) 15 175 20 350 25 525 30 700 35 875 40 1050 45 122550 1400 상기 [표 1]은 스페이서들(3115, 3116, 3117)의 두께 별 글래스층의 후육부에 부여되는 압축 응력을 나타 내는 표이다. 일 실시예에 따르면, 제1 스페이서, 제2 스페이서 및 제3 스페이서는, 화학 강화 처리를 위 해 소정의 두께를 갖도록 형성될 수 있다. 일 실시예서, 제1 스페이서, 제2 스페이서 및 제3 스페 이서의 두께는 30um 이상으로 설계될 수 있다. 이 경우, 상기 [표 1]에 기재된 바와 같이, 글래스층 의 후육부에 600MPa 이상의 압축 응력인 700MPa의 압축 응력이 부여될 수 있다. 이에 따라, 화학 강화 처 리 시, 글래스층의 내부에서 발생하는 인장 응력에 의해, 글래스층이 스스로 깨지는 자파 현상이 방 지될 수 있다. 도 16은, 본 개시의 일 실시예에 따른 펼침 상태를 개략적으로 나타낸 전자 장치의 도면이다. 도 17은, 본 개 시의 일 실시예에 따른 도 16의 접힘 상태를 개략적으로 나타낸 전자 장치의 도면이다. 도 16 및 도 17을 참고하면, 일 실시예에 따른 전자 장치는 서로에 대하여 회동 가능하게 배치되는 제1 하 우징, 제2 하우징 및 제3 하우징을 포함할 수 있다. 일 실시예에 따르면, 전자 장치는 제1 하우징, 제2 하우징 및 제3 하우징의 지지를 받도록 배치되는 플렉서블 디스플레이를 포함할 수 있다. 일 실시예에 따르면, 제1 하우징 및 제2 하우징은 제1 힌지 모듈을 통해 제1 폴딩축(X1)을 기준 으로 서로에 대하여 회전 가능하게 연결될 수 있다. 일 실시예에 따르면, 제2 하우징 및 제3 하우징은 제2 힌지 모듈을 통해 제2 폴딩축(X2)을 기준 으로 서로에 대하여 회전 가능하게 연결될 수 있다. 일 실시예에 따르면, 제1 하우징 및 제2 하우징은 제1 힌지 모듈을 통해 제1 폴딩 방식(예: 아 웃 폴딩 방식)으로 동작될 수 있다. 예컨대, 제1 하우징과 제2 하우징은 접힌 상태에서, 각 하우징 (410, 420)에 대면하는 디스플레이 영역들이 외부에서 보일 수 있도록 서로 반대 방향을 향하게 배치될 수 있다. 일 실시예에 따르면, 제2 하우징 및 제3 하우징은 제2 힌지 모듈을 통해 제2 폴딩 방식(예: 인 폴딩 방식)으로 동작될 수 있다. 예컨대, 제2 하우징과 제3 하우징은 접힌 상태에서, 각 하우징 (420, 430)과 대면하는 디스플레이 영역들이 서로 마주보도록 배치될 수 있다. 일 실시예에 따르면, 전자 장치는, 제1 하우징, 제2 하우징 및 제3 하우징이 완전히 펼쳐 진 상태에서 동작될 수 있다. 일 실시예에 따르면, 전자 장치는, 제1 하우징과 제2 하우징만이 접힌 상태로 동작될 수도 있다. 일 실시예에 따르면, 전자 장치는, 제1 하우징, 제2 하우징 및 제3 하우징이 모두 접힌 상태에서 동작될 수도 있다. 일 실시예에 따르면, 제1 하우징과 대면하는 디스플레이 영역은, 완전히 접힌 상태에서, 사용자에게 보일 수 있도록 전자 장치의 외부를 향하여 배치될 수 있다. 이러한 경우, 카메라 모듈 및 센서 모듈 은 제1 하우징과 대응하는 디스플레이 영역을 통해 외부 환경을 검출하도록 배치될 수 있다. 일 실 시예에서, 카메라 모듈 및/또는 센서 모듈은 플렉서블 디스플레이 아래에서, 외부로부터 보이지 않게 배치될 수 있다. 일 실시예에 따르면, 플렉서블 디스플레이는 디스플레이 패널(예: 도 7의 디스플레이 패널)을 보호하 고, 굴곡성 제공을 위하여 그 상부에 적층되는 글래스층(예: 도 7의 글래스층)을 포함할 수 있다. 일 실시예에 따르면, 글래스층은 제1 하우징과 대면하는 제1 영역(DA1), 제2 하우징과 대면하는 제2 영역(DA2) 및 제3 하우징과 대면하는 제3 영역(DA3)을 포함할 수 있다. 일 실시예에 따르면, 글래스층은 제1 영역(DA1)과 제2 영역(DA2) 사이에서, 제1 힌지 모듈과 대면하 는 제1 폴딩 영역(F1) 및 제2 영역(DA2)과 제3 영역(DA3) 사이에서, 제2 힌지 모듈과 대면하는 제2 폴딩 영역(F2)을 포함할 수 있다. 일 실시예에 따르면, 글래스층은, 적어도 제1 폴딩 영역(F1) 및 제2 폴딩 영역(F2)에서, 영역별 터치감 차 이 감소 및/또는 굴곡성을 제공하기 위한 복수의 패턴들(예: 도 18의 복수의 제1 패턴 및 복수의 제2 패 턴)을 포함할 수 있다. 도 18은, 본 개시의 일 실시예에 따른 도 16의 플렉서블 디스플레이의 밴딩 방향에 따른 복수의 패턴들의 형상 및 배치 구성을 나타낸 도면이다. 도 18을 참조하면, 일 실시예에 따른 글래스층(예: 도 7의 글래스층)은 제1 면 및 제1 면 과 반대 방향을 향하고, 디스플레이 패널과 대응하는 제2 면을 포함할 수 있다. 일 실시예에 따르면, 글래스층은 제1 면에서, 지정된 간격으로 제1 면보다 낮게 형성된 복수 의 제1 패턴을 포함할 수 있다. 일 실시예에 따르면, 글래스층은 제2 면에서, 지정된 간격으 로 제2 면보다 낮게 형성된 복수의 제2 패턴을 포함할 수 있다. 일 실시예에 따르면, 복수의 제1 패턴에는 제1 충진 부재가 충진될 수 있다. 일 실시예에 따르면, 복수의 제2 패턴에는 제2 충진 부재가 충진될 수 있다. 일 실시예에 따르면, 제1 충진 부재는 글래스층과 충진 부재 간의 터치감의 차이를 감소시키도록, 글 래스층의 모듈러스, 경도 또는 분자량과 실질적으로 동일한 모듈러스, 경도 또는 분자량을 가질 수 있다. 일 실시예에 따르면, 제1 충진 부재와 제2 충진 부재는, 폴딩 영역(F1, F2)에서의 굴곡성을 고려하여, 서로 다른 모듈러스, 경도 또는 분자량을 갖도록 설계될 수 있다. 일 실시예에서, 제1 충진 부재 의 모듈러스, 경도 또는 분자량은 제2 충진 부재의 모듈러스, 경도 또는 분자량보다 작도록 마련될 수 있다. 예를 들면, 제1 충진 부재는 20 내지 400MPA의 모듈러스를 가지며, 제2 충진 부재는 0.005 내지 10MPA의 모듈러스를 갖도록 설계될 수 있다. 일 실시예에 따르면, 글래스층은, 적어도 제1폴딩 영역(F1)에서, 제1 면에 배치된 복수의 제1 패턴 의 깊이가 제2 면에 배치된 복수의 제2 패턴의 깊이보다 얕도록 설정됨으로써 굴곡성 향상에 도움을 줄 수 있다. 또한, 글래스층은, 적어도 제2폴딩 영역(F2)에서, 제1면에 배치된 복수의 제1 패턴의 깊이가 제2면에 배치된 복수의 제2 패턴들의 깊이보다 얕도록 설정됨으로써 굴곡성 향상에 도움을 줄 수 있다. 예컨대, 하나의 전자 장치에서, 디스플레이 패널의 서로 다른 밴딩 방식되는 방식에 따라, 글래스층 의 제1 면에 배치된 복수의 제1 패턴 및 제2 면에 배치된 복수의 제2 패턴의 깊 이를 적절히 설정함으로써, 굴곡성 향상에 도움을 줄 수 있다. 도 19는, 본 개시의 일 실시예에 따른 전자 장치의 인출 상태를 나타낸 도면이다. 도 20은, 본 개시의 일 실시 예에 따른 전자 장치의 인입 상태를 나타낸 도면이다. 도 19 및 도 20을 참고하면, 전자 장치는 하우징(예: 제1 하우징 또는 베이스 하우징) 및 하우징 으로부터 적어도 부분적으로 이동 가능하게 결합되고, 플렉서블 디스플레이의 적어도 일부를 지지하 는 슬라이드 구조물(예: 제2 하우징 또는 슬라이드 하우징)를 포함할 수 있다. 일 실시예에 따르면, 슬라이드 구조물은 일단에 결합되고, 플렉서블 디스플레이의 적어도 일부를 지 지하는 벤딩 가능 부재 (미도시 됨)(예: 다관절 힌지 또는 멀티바 조립체)를 포함할 수 있다. 슬라이드 구조물 이 하우징에서 슬라이딩 동작을 수행할 경우, 벤딩 가능 부재는 플렉서블 디스플레이를 지지하 면서 하우징의 내부 공간으로 적어도 부분적으로 인입될 수 있다. 일 실시예에 따르면, 전자 장치는 제1 방향(예: +z축 방향)을 향하는 전면(510a), 제1 방향과 반대인 제2 방향(예: -z축 방향)을 향하는 후면(510b) 및 전면(510a)과 후면(510b) 사이의 공간을 둘러싸고, 적어도 부분적 으로 외부로 노출되는 측면(510c)을 포함하는 측면 부재를 포함할 수 있다. 일 실시예에 따르면, 후면(510b)은 하우징에 결합되는 후면 커버를 통해 형성될 수 있다. 일 실시예 에 따르면, 후면 커버는 폴리머, 코팅 또는 착색된 유리, 세라믹, 금속(예: 알루미늄, 스테인레스 스틸, 또는 마그네슘), 또는 상기 물질들 중 적어도 둘의 조합에 의하여 형성될 수 있다. 일 실시예에서, 후면 커버 는 하우징과 일체로 형성될 수도 있다. 일 실시예에 따르면, 측면(510c)의 적어도 일부는 하우징을 통해 외부로 노출되도록 배치될 수 있다. 일 실시예에 따르면, 측면 부재는 제1 길이를 갖는 제1 측면, 제1 측면으로부터 수직한 방향으 로 제1 길이보다 긴 제2 길이를 갖도록 연장되는 제2 측면, 제2 측면으로부터 제1 측면과 평행 하게 연장되고 제1 길이를 갖는 제5 측면 및 제3 측면으로부터 제2 측면과 평행하게 연장되고 제2 길이를 갖는 제4 측면을 포함할 수 있다. 일 실시예에 따르면, 슬라이드 구조물은 플렉서블 디스플레이를 지지하고, 제2 측면으로부터 제 4 측면 방향(예: +x축 방향)으로 인출됨으로써(slide-out), 플렉서블 디스플레이의 표시 면적을 확장 시키거나, 제4 측면으로부터 제2 측면 방향(예: -x축 방향)으로 인입됨으로써(slide-in), 플렉서블 디스플레이의 표시 면적을 축소시킬 수 있다. 일 실시예에 따르면, 전자 장치는 제1 측면 및 제3 측면을 커버하기 위한 제1 측면 커버(540a) 및 제2 측면 커버(540b)를 포함할 수 있다. 일 실시예에 따르면, 제1 측면 및 제3 측면은 제1 측면 커버(540a) 및 제2 측면 커버(540b)를 통해 외부로 노출되지 않도록 배치될 수 있다. 일 실시예에 따르면, 전자 장치는 슬라이드 구조물의 지지를 받도록 배치되는 플렉서블 디스플레이 를 포함할 수 있다. 일 실시예에 따르면, 플렉서블 디스플레이는 슬라이드 구조물의 지지를 받는 제1 부분(530a)(예: 평 면부) 및 제1 부분(530a)으로부터 연장되고, 벤딩 가능 부재를 통해 적어도 부분적으로 지지를 받는 제2 부분 (530b)(예: 벤딩부 또는 굴곡 가능부)를 포함할 수 있다. 일 실시예에 따르면, 제2 부분(530b)의 적어도 일부는, 전자 장치의 인입 상태(예: 슬라이드 구조물 의 적어도 일부가 하우징으로 인입된 상태)에서, 하우징의 내부 공간으로 인입되고, 외부로 노출되지 않도록 배치될 수 있다. 또한, 제2 부분(530b)의 적어도 일부는, 전자 장치의 인출 상태(예: 슬라이드 구조물의 적어도 일부가 하우징으로부터 인출된 상태)에서, 벤딩 가능 부재의 적어도 일부의 지지를 받으면서 제1 부분(530a)으로부터 연장되도록 적어도 부분적으로 외부로 노출될 수 있다. 따라서, 전자 장치 는 하우징으로부터 슬라이드 구조물의 이동에 따라 플렉서블 디스플레이의 표시 면적이 변 경되는 롤러블 타입(rollable type) 또는 슬라이더블 타입(slidable type) 전자 장치를 포함할 수 있다. 일 실시예에 따르면, 슬라이드 구조물은 하우징으로부터 적어도 부분적으로 인입되거나 인출되도록 슬라이딩 방식으로 이동 가능하게 결합될 수 있다. 예컨대, 플렉서블 디스플레이는, 인입 상태에서, 제2 측면으로부터 제4 측면까지의 제1 폭(W1)에 대응하는 표시 면적을 갖도록 구성될 수 있다. 일 실시예에 따르면, 플렉서블 디스플레이는 슬라이드 구조물의 인출 상태에서, 하우징의 내부 에 인입된 벤딩 가능 부재의 적어도 일부가, 추가적으로 제2 폭(w2)을 갖도록 전자 장치의 외부로 이동됨으로써, 제1 폭(w1)보다 큰 제3 폭(w3)에 대응하는 표시 면적을 갖도록 변형될 수 있다. 따라서, 플렉서 블 디스플레이는 슬라이드 구조물의 슬라이딩 동작에 따라, 가변되는 전자 장치의 폭에 대응하여 표 시 면적이 가변될 수 있다. 일 실시예에 따르면, 전자 장치는, 입력 장치, 음향 출력 장치(506, 507), 센서 모듈(504, 517), 카 메라 모듈(505, 516), 커넥터 포트, 키 입력 장치(미도시 또는 인디케이터(미도시) 중 적어도 하나를 포함 할 수 있다. 일 실시예에서, 상기 전자 장치는, 상술한 구성 요소들 중 적어도 하나를 생략하거나 다른 구성 요소들이 추가적으로 포함될 수도 있다. 일 실시예에 따르면, 입력 장치는, 마이크를 포함할 수 있다. 일 실시예에서, 입력 장치는 소리의 방향을 감지할 수 있도록 배치되는 복수의 마이크를 포함할 수도 있다. 일 실시예에 따르면, 음향 출력 장치(506, 507)는 스피커들을 포함할 수 있다. 음향 출력 장치(506, 507)은, 외부 스피커 및 통화용 리시버를 포함할 수 있다. 일 실시예에서, 음향 출력 장치(506, 507)는 별도 의 스피커 홀이 배제된 채, 동작되는 스피커(예: 피에조 스피커)를 포함할 수도 있다. 일 실시예에 따르면, 센서 모듈(504, 517)은, 전자 장치의 내부의 작동 상태, 또는 외부의 환경 상태에 대 응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 센서 모듈(504, 517)은, 예를 들어, 전자 장치의 전면에 배치된 제1 센서 모듈(예: 근접 센서 또는 조도 센서) 및/또는 후면에 배치된 제2 센서 모듈(예: HRM센서)를 포함할 수 있다. 일 실시예에 따르면, 제1 센서 모듈은 전자 장치의 전면(510a)에서, 플렉서블 디스플레이 아래 에 배치될 수 있다. 제1센서 모듈은 근접 센서, 조도 센서, ToF(time of flight) 센서, 초음파 센서, 지 문 인식 센서, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서 또는 습도 센서 중 적어도 하나를 더 포함할 수 있다. 일 실시예에 따르면, 카메라 장치(505, 516)는, 전자 장치의 전면(510a)에 배치된 제1 카메라 장치, 및 후면(510b)에 배치된 제2 카메라 장치를 포함할 수 있다. 일 실시예에 따르면, 전자 장치는 제2 카메라 장치 근처에 위치되는 플래시를 포함할 수 있다. 일 실시예에 따르면, 카메라 장치들(505, 516)은, 하나 또는 복수의 렌즈들, 이미지 센서, 및/또는 이미지 시그널 프로세서를 포함할 수 있다. 일 실시 예에 따르면, 제1 카메라 장치는 플렉서블 디스플레이 아래에 배치되고, 플렉서블 디스플레이의 활성화 영역 중 일부를 통해 피사체를 촬영하도록 구성될 수도 있다. 일 실시예에 따르면, 플래시는, 예 를 들어, 발광 다이오드 또는 제논 램프(xenon lamp)를 포함할 수 있다. 일 실시예에서, 2개 이상의 렌즈들(광 각 및 망원 렌즈) 및 이미지 센서들이 상기 전자 장치의 한 면에 배치될 수 있다. 일 실시예에 따르면, 전자 장치는 적어도 하나의 안테나(미도시)를 포함할 수 있다. 일 실시예에 따르면, 적어도 하나의 안테나는, 예를 들어, 외부 전자 장치와 무선으로 통신을 하거나, 충전에 필요한 전력을 무선으 로 송수신할 수 있다. 일 실시예에서, 안테나는 legacy antenna, mmWave antenna, NFC(near field communication) 안테나, 무선 충전 안테나, 및/또는 MST(magnetic secure transmission) 안테나를 포함할 수 있다. 일 실시예에 따르면, 플렉서블 디스플레이는 디스플레이 패널(예: 도 5의 디스플레이 패널)에 적층되 는 글래스층을 포함할 수 있다. 한 실시예에 따르면, 글래스층은 슬라이드 구조물이 지정된 방향(① 방향)으로의 슬라이딩 동작 시, 적어도 부분적으로 벤딩 가능하게 변형되는 제2 부분(530b)과 대응하는 영역에 형성된 복수의 패턴들(예: 도 20c의 복수의 패턴들(5313, 5314)을 포함함으로써, 플렉서블 디스플레이의 강성 및 굴곡성 확보에 도움을 줄 수 있다. 도 21은, 본 개시의 일 실시예에 따른 벤딩 가능 영역에서, 플렉서블 디스플레이의 벤딩에 따른 복수의 패턴들 의 형상 및 배치 구성을 나타낸 도면이다. 도 21을 참조하면, 일 실시예에 따른 글래스층(예: 도 7의 글래스층)은 제1 면 및 제1 면 과 반대 방향을 향하고, 디스플레이 패널과 대응하는 제2 면을 포함할 수 있다. 일 실시예에 따르면, 글래스층은 제1 면에서, 지정된 간격으로 제1 면보다 낮게 형성된 복수 의 제1 패턴을 포함할 수 있다. 일 실시예에 따르면, 글래스층은 제2 면에서, 지정된 간격으 로 제2 면보다 낮게 형성된 복수의 제2 패턴을 포함할 수 있다. 일 실시예에 따르면, 복수의 제1 패턴에는 제1 충진 부재가 충진될 수 있다. 일 실시예에 따르면, 복수의 제2 패턴에는 제2 충진 부재가 충진될 수 있다. 일 실시예에 따르면, 제1 충진 부재는 글래스층과 충진 부재 간의 터치감의 차이를 감소시키도록, 글 래스층의 모듈러스, 경도 또는 분자량과 실질적으로 동일한 모듈러스, 경도 또는 분자량을 가질 수 있다. 일 실시예에 따르면, 제1 충진 부재와 제2 충진 부재는, 플렉서블 디스플레이의 제2 부분(530b) 중 적어도 일부에 대응되는 영역에서의 굴곡성을 고려하여, 서로 다른 모듈러스, 경도 또는 분자량을 갖도록 설 계될 수 있다. 일 실시예에서, 제2 충진 부재의 모듈러스, 경도 또는 분자량은 제1 충진 부재의 모 듈러스, 경도 또는 분자량보다 작도록 마련될 수 있다. 예를 들면, 제1 충진 부재는 20 내지 400MPA의 모듈러스를 가지며, 제2 충진 부재는 0.005 내지 10MPA의 모듈러스를 갖도록 설계될 수 있다. 일 실시예에 따르면, 글래스층은, 플렉서블 디스플레이의 제2 부분(530b) 중 적어도 일부에 대응되는 영역에서, 제1 면에 배치된 복수의 제1 패턴의 깊이가 제2 면에 배치된 복수의 제2 패턴 의 깊이보다 얕도록 설정됨으로써 굴곡성 향상에 도움을 줄 수 있다. 본 개시의 일 실시예에 따른 전자 장치는 제1 하우징을 포함할 수 있다. 상기 전자 장치는 힌 지 모듈을 통해 상기 제1 하우징과 폴딩 가능하게 연결되는 제2 하우징을 포함할 수 있다. 전 자 장치는 상기 제1 하우징 및 상기 제2 하우징에 의해 지지되는 플렉서블 디스플레이를 포함할 수 있다. 상기 플렉서블 디스플레이는 제1 면 및 상기 제1 면에 대향하는 제2 면 을 가지며, 상기 제1 면으로부터 함몰된 복수의 제1 패턴과, 상기 제2 면으로부터 함 몰된 복수의 제2 패턴을 포함하는 글래스층을 포함할 수 있다. 상기 플렉서블 디스플레이는 상기 복수의 제1 패턴에 충진되는 제1 충진 부재를 포함할 수 있다. 상기 플렉서블 디스플레이 는 상기 복수의 제2 패턴에 충진되며, 상기 제1 충진 부재보다 낮은 경도를 갖는 제2 충진 부 재를 포함할 수 있다. 일 실시예에 따르면, 상기 복수의 제1 패턴의 함몰 깊이(d1)는, 상기 복수의 제2 패턴의 함몰 깊이 (d2)와 실질적으로 동일할 수 있다. 일 실시예에 따르면, 상기 복수의 제1 패턴의 함몰 깊이(d1)는, 상기 복수의 제2 패턴의 함몰 깊이 (d2)보다 얕을 수 있다. 일 실시예에 따르면, 상기 플렉서블 디스플레이는, 상기 글래스층의 상기 제1 면에 적층되며, 하드 코팅 또는 내지문(anti-finger) 코팅된 코팅층을 포함할 수 있다. 일 실시예에 따르면, 상기 제1 충진 부재의 경도는 20 내지 400MPa이며, 상기 제2 충진 부재의 경도 는 0.005 내지 10 MPa일 수 있다. 일 실시예에 따르면, 상기 복수의 제1 패턴의 함몰 깊이(d1)는 20um 이상일 수 있다. 일 실시예에 따르면, 상기 글래스층은, 표면이 알칼리 이온의 교환에 따른 화학 강화 처리될 수 있다. 일 실시예에 따르면, 상기 복수의 제1 패턴의 패턴 간격(Ta), 상기 복수의 제2 패턴의 패턴 간격 (Tb), 및 상기 복수의 제1 패턴과 상기 복수의 제2 패턴 사이의 이격 거리(Tc)는, 30um 이상일 수 있다. 일 실시예에 따르면, 상기 플렉서블 디스플레이는, 상기 글래스층의 상기 제 1면 및/또는 상기 제2 면에 적층되는 적어도 하나의 평탄화층(3121, 3131)을 포함할 수 있다. 일 실시예에 따르면, 상기 적어도 하나의 평탄화층(3121, 3131)은, 상기 제1 면에 적층되는 제1 평탄화층 과, 상기 제2 면에 적층되는 제2 평탄화층을 포함할 수 있다. 상기 제1 평탄화층은 상기 제1 충진 부재와 동일한 물질로 형성되며, 상기 제2 평탄화층은 상기 제2 충진 부재와 동 일한 물질로 형성될 수 있다. 일 실시예에 따르면, 상기 제1 면에 적층되는 평탄화층은, 10 내지 30um 범위의 두께로 형성될 수 있다. 일 실시예에 따르면, 상기 플렉서블 디스플레이는, 상기 제1 하우징과 대면하는 제1 평면부(230a), 상기 제2 하우징과 대면하는 제2 평면부(230b), 상기 제1 평면부(230a)와 상기 제2 평면부(230b)를 연결하 며, 상기 힌지 모듈과 대면하며 벤딩 가능한 굴곡 가능부(230c)를 포함할 수 있다. 일 실시예에 따르면, 상기 복수의 제1 패턴 및 상기 복수의 제2 패턴은, 상기 플렉서블 디스플레이 의 상기 굴곡 가능부(230c)에 대응하는 일 영역에 위치할 수 있다. 일 실시예에 따르면, 상기 일 영역의 굴곡성은, 상기 복수의 패턴들(3113, 3114)의 형상, 배치 및/또는 경도에 의해 결정될 수 있다. 일 실시예에 따르면, 상기 복수의 제1 패턴 및 상기 복수의 제2 패턴은, 지그재그(zigzag) 형태로 형성될 수 있다. 본 개시의 일 실시예에 따른 전자 장치(400, 500)는 적어도 하나의 하우징(410, 420, 430, 510)을 포함할 수 있 다. 상기 전자 장치(400, 500)는 상기 적어도 하나의 하우징(410, 420, 430, 510)의 지지를 통해 적어도 부분 적으로 벤딩 가능한 벤딩 영역(F1, F2, 530b)을 포함하는 플렉서블 디스플레이(440, 530)를 포함할 수 있다. 상기 플렉서블 디스플레이(440, 530)는, 제1 면(4411, 5311)으로부터 함몰된 복수의 제1 패턴(4413, 5313)과, 상기 제1 면(4411, 5311)에 대향하는 제2 면(4412, 5312)으로부터 함몰된 복수의 제2 패턴(4414, 5314)을 포함 하는 글래스층(441, 531)을 포함할 수 있다. 상기 플렉서블 디스플레이(440, 530)는, 상기 복수의 제1 패턴(4413, 5313)에 충진되는 제1 충진 부재(442, 532)를 포함할 수 있다. 상기 플렉서블 디스플레이(440, 530)는, 상기 복수의 제2 패턴(4414, 5314)에 충진되며, 상기 제1 충진 부재(442, 532)보다 낮은 경도를 갖는 제2 충진 부재(443, 533)를 포함할 수 있다. 일 실시예에 따르면, 상기 복수의 제1 패턴(4413, 5313) 및 상기 복수의 제2 패턴(4414, 5314)은 상기 벤딩 영 역(F1, F2, 530b)에 대응하는 일 영역에 위치할 수 있다. 일 실시예에 따르면, 상기 복수의 제1 패턴(4413, 5313)의 함몰 깊이는, 상기 복수의 제2 패턴(4414, 5314)의 함몰 깊이와 실질적으로 동일할 수 있다. 일 실시예에 따르면, 상기 복수의 제1 패턴(4413, 5313)의 함몰 깊이는, 상기 복수의 제2 패턴(4414, 5314)의 함몰 깊이보다 얕을 수 있다. 본 개시의 일 실시예에 따른 평면부(230a, 230b)와 굴곡 가능부(230c)를 포함하는 플렉서블 디스플레이는 제1 면으로부터 함몰된 복수의 제1 패턴과, 상기 제1 면에 대향하는 제2 면으로부터 함몰된 복수의 제2 패턴을 포함하는 글래스층을 포함할 수 있다. 상기 플렉서블 디스플레이는, 상기 복수의 제1 패턴에 충진되는 제1 충진 부재를 포함할 수 있다. 상기 플렉 서블 디스플레이는, 상기 복수의 제2 패턴에 충진되며, 상기 제1 충진 부재보다 낮은 경도를 갖는 제2 충진 부재를 포함할 수 있다. 상기 복수의 제1 패턴 및 상기 복수의 제2 패턴은, 상기 플렉서블 디스플레이의 상기 굴곡 가능부(230c)에 대응하는 상기 글래스층의 일 영역에 위치할 수 있다.도면 도면1 도면2a 도면2b 도면2c 도면3a 도면3b 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13 도면14 도면15 도면16 도면17 도면18 도면19 도면20 도면21"}
{"patent_id": "10-2023-0099497", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도면의 설명과 관련하여, 동일 또는 유사한 구성요소에 대해서는 동일 또는 유사한 참조 부호가 사용될 수 있다. 도 1은 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 2a는 본 개시의 일 실시예에 따른 펼침 상태(flat stage 또는 unfolding state)를 도시한 전자 장치의 사시 도이다. 도 2b는 본 개시의 일 실시예에 따른 펼침 상태에서, 전자 장치의 전면을 도시한 평면도이다. 도 2c는 본 개시의 일 실시예에 따른 펼침 상태에서, 전자 장치의 후면을 도시한 평면도이다. 도 3a는 본 개시의 일 실시예에 따른 접힘 상태(folding state)를 도시한 전자 장치의 사시도이다. 도 3b는 본 개시의 일 실시예에 따른 중간 상태(intermediate state)를 도시한 전자 장치의 사시도이다. 도 4은 본 개시의 일 실시예에 따른 전자 장치의 분리 사시도이다. 도 5는, 본 개시의 다양한 실시예에 따른 플렉서블 디스플레이의 분리 사시도이다. 도 6은, 본 개시의 다양한 실시예에 따른 윈도우층의 평면도이다. 도 7은, 도 6에 도시된 선 I-I’를 따라 절개한 단면도이다. 도 8은, 도 6에 도시된 A 부분의 확대도이다. 도 9는, 본 개시의 일 실시예에 따른 글래스층의 두께 별 강도 시뮬레이션 결과를 나타내는 그래프이다. 도 10은, 본 개시의 일 실시예에 따른 제1 충진 부재의 두께 별 펜 가압 시뮬레이션 결과를 나타내는 그래프이 다. 도 11은, 본 개시의 일 실시예에 따른 윈도우층의 제조 공정도이다. 도 12는, 본 개시의 일 실시예에 따른 글래스층에 복수의 패턴들을 성형하는 공정을 나타내는 도면이다. 도 13은, 본 개시의 일 실시예에 따른 복수의 패턴들에 충진 부재를 충진하는 공정을 나타내는 도면이다. 도 14는, 본 개시의 일 실시예에 따른 플렉서블 디스플레이의 단면도이다. 도 15는, 본 개시의 일 실시예에 따른 글래스층의 단면도이다. 도 16은, 본 개시의 일 실시예에 따른 펼침 상태를 개략적으로 나타낸 전자 장치의 도면이다. 도 17은, 본 개시의 일 실시예에 따른 도 16의 접힘 상태를 개략적으로 나타낸 전자 장치의 도면이다. 도 18은, 본 개시의 일 실시예에 따른 도 16의 플렉서블 디스플레이의 밴딩 방향에 따른 복수의 패턴들의 형상 및 배치 구성을 나타낸 도면이다.도 19는, 본 개시의 일 실시예에 따른 전자 장치의 인출 상태를 나타낸 도면이다. 도 20은, 본 개시의 일 실시예에 따른 전자 장치의 인입 상태를 나타낸 도면이다. 도 21은, 본 개시의 일 실시예에 따른 벤딩 가능 영역에서, 플렉서블 디스플레이의 벤딩에 따른 복수의 패턴들 의 형상 및 배치 구성을 나타낸 도면이다."}
