{"patent_id": "10-2024-7026560", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0141868", "출원번호": "10-2024-7026560", "발명의 명칭": "사전-지정된 속성을 가진 생체분자 서열 변이체 설계", "출원인": "에이비에스씨아이 코포레이션", "발명자": "스프레아피코 로베르토"}}
{"patent_id": "10-2024-7026560", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "관심 생체분자 서열 변이체를 식별하기 위한 컴퓨팅 시스템으로서, 상기 컴퓨팅 시스템은:하나 이상의 프로세서; 및하나 이상의 비일시적 컴퓨터 판독가능 매체이되, 상기 하나 이상의 비일시적 컴퓨터 판독가능 매체에는:학습 데이터를 사용하여 학습된 머신 러닝된 모델로서,상기 학습 데이터는, 상응하는 각각의 결합 파트너에 결합하는 각각의 능력을 나타내는 각각의 측정된 결합 특성을 각각 갖는 하나 이상의 학습 생체분자 서열 변이체를 포함하고,상기 머신 러닝된 모델은 입력 생체분자 서열 변이체의 예측 생체분자 결합 특성을 출력하도록 구성되는, 머신러닝된 모델; 및상기 하나 이상의 프로세서에 의해 실행되는 경우, 상기 컴퓨팅 시스템으로 하여금,상기 하나 이상의 생체분자 서열 변이체 중 각각의 하나에 각각 상응하는 하나 이상의 예측된 결합 특성을 생성하기 위해 상기 머신 러닝된 모델로 하나 이상의 생체분자 서열 변이체를 처리하게 하고;상기 하나 이상의 생체분자 서열 변이체 중 하나 이상의 관심 생체분자 서열 변이체(여기에서, 상기 하나 이상의 관심 생체분자 서열 변이체 각각은 각각의 하나 이상의 원하는 특성을 가짐)를 식별하기 위해 상기 하나 이상의 예측된 결합 특성을 분석하게 하고;상기 하나 이상의 관심 생체분자 서열 변이체를 출력으로서 제공하게 하는 명령어가 저장되는, 하나 이상의 비일시적 컴퓨터 판독가능 매체를 포함하는, 컴퓨팅 시스템."}
{"patent_id": "10-2024-7026560", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서:(i) 하나 이상의 학습 생체분자 서열 변이체 중 적어도 하나는 항체 서열 변이체이고, 상응하는 각각의 결합 파트너는 항원이고; 하나 이상의 생체분자 서열 변이체는 항체 서열 변이체이고;(ii) 하나 이상의 학습 생체분자 서열 변이체 중 적어도 하나는 항원 서열 변이체이고, 상응하는 각각의 결합파트너는 항체이며; 하나 이상의 생체분자 서열 변이체는 항원 서열 변이체인, 컴퓨팅 시스템."}
{"patent_id": "10-2024-7026560", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,학습 데이터는 (i) 인간 서열 데이터, (ii) 마우스 서열 데이터, (iii) 카멜리드 서열 데이터, 또는 (iv) 또 다른 종에 상응하는 서열 데이터 중 적어도 하나를 포함하는 다중 종 서열 데이터를 포함하는, 컴퓨팅 시스템."}
{"patent_id": "10-2024-7026560", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,하나 이상의 학습 생체분자 서열 변이체는: 총 가능한 변이체 공간의 10% 미만,총 가능한 변이체 공간의 9% 미만,총 가능한 변이체 공간의 8% 미만,총 가능한 변이체 공간의 7% 미만,공개특허 10-2024-0141868-3-총 가능한 변이체 공간의 6% 미만,총 가능한 변이체 공간의 5% 미만,총 가능한 변이체 공간의 4% 미만,총 가능한 변이체 공간의 3% 미만,총 가능한 변이체 공간의 2% 미만,총 가능한 변이체 공간의 1% 미만,총 가능한 변이체 공간의 0.5% 미만,총 가능한 변이체 공간의 0.4% 미만,총 가능한 변이체 공간의 0.3% 미만,총 가능한 변이체 공간의 0.2% 미만, 또는 총 가능한 변이체 공간의 0.1% 미만을 포함하는, 컴퓨팅 시스템."}
{"patent_id": "10-2024-7026560", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 하나 이상의 비일시적 컴퓨터 판독가능 매체에는, 하나 이상의 프로세서에 의해 실행될 때, 컴퓨팅 시스템으로 하여금: (i) 관찰된 항체 공간(Observed Antibody Space, OAS) 데이터베이스;(ii) Uniref90 단백질 데이터베이스;(iii) 임의의 Uniref-유래 데이터세트;(iv) BFD 데이터세트;(v) Mgnify 데이터세트;(vi) JGI 또는 EBI 개설로부터 유래된 임의의 메타게놈 데이터세트;(vii) 조립된 단백질 서열의 임의의 코퍼스(corpus); 또는(viii) BCR-시퀀싱 또는 다른 수단에 의해 수득될 수 있는, 천연 항체 서열의 임의의 데이터세트 중 적어도 하나로부터의 하나 이상의 학습 생체분자 서열 변이체 중 적어도 하나를 수득하게 하는 추가의 명령어가저장되는, 컴퓨팅 시스템."}
{"patent_id": "10-2024-7026560", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 하나 이상의 비일시적 컴퓨터 판독가능 매체에는, 하나 이상의 프로세서에 의해 실행될 때, 컴퓨팅 시스템으로 하여금: (i) 하나 이상의 학습 생체분자 서열 변이체를 분석하기 위해 자체 지도 사전학습 객체화를 사용하여 머신 러닝된 모델을 사전학습시키게 하거나(여기에서, 상기 사전학습은 범용 모델 가중치 세트를 생성하는 단계를포함함),(ii) 하나 이상의 학습 생체분자 서열 변이체를 분석하기 위해 자체 지도 사전학습 객체화를 사용하여 머신 러닝된 모델을 사전학습시키게 하거나(여기에서, 상기 사전학습은 범용 모델 가중치 세트를 생성하는 단계를 포함하고, 상기 자체 지도 사전학습은 목표는 마스킹된 언어 모델 객체화임),(iii) 학습 데이터 내의 학습 생체분자 서열 변이체의 수가 소정의 임계값 미만인 것으로 결정하는 것에 응답하여 머신 러닝된 모델을 사전학습시키게 하거나;(iv) 항체-항원 쌍(여기에서, 상기 항체-항원 쌍은 항체-항원-특이적 가중치의 세트에 상응함)에 상응하는 적어도 하나의 결합 검정에 의한 데이터 출력을 사용하여 머신 러닝된 모델을 추가로 학습시키게 하는 추가의 명령어가 저장되는, 컴퓨팅 시스템.공개특허 10-2024-0141868-4-청구항 7 제6항에 있어서,적어도 하나의 결합 검정은:(i) 고 처리량 스크리닝,(ii) 저 처리량 스크리닝,(iii) 고정밀 표적화 스크리닝,(iv) 표면 플라스몬 공명(SPR) 기술,(v) 등온 적정 열량측정(ITC) 기술,(vi) 바이오층 간섭계(BLI) 기술, 또는(vii) 마이크로스케일 열영동(MST) 기술 중 적어도 하나를 포함하는, 컴퓨팅 시스템."}
{"patent_id": "10-2024-7026560", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 하나 이상의 비일시적 컴퓨터 판독가능 매체에는, 하나 이상의 프로세서에 의해 실행될 때, 컴퓨팅 시스템으로 하여금:상이한 항체-항원 쌍에 상응하는 상이한 적어도 하나의 결합 검정에 의한 데이터 출력을 사용하여 머신 러닝 모델을 재학습시키게 하는 추가의 명령어가 저장되며,여기에서 상기 재학습은 상기 상이한 항체-항원 쌍에 상응하는 상이한 항체-항원-특이적 가중치 세트를 생성하는 것을 포함하는, 컴퓨팅 시스템."}
{"patent_id": "10-2024-7026560", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서, 하나 이상의 비일시적 컴퓨터 판독가능 매체에는, 하나 이상의 프로세서에 의해 실행될 때, 컴퓨팅 시스템으로 하여금:환경 조건에 기초하여 적어도 하나의 각각의 측정된 결합 특성을 결정하게 하는 추가의 명령어가 저장되는, 컴퓨팅 시스템."}
{"patent_id": "10-2024-7026560", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서, 하나 이상의 생체분자 서열 변이체는:기준 항체,상업적 항체,비상업적 항체,임상 항체,비임상 항체,연구 등급 항체,진단 등급 항체,공개적으로 이용 가능한 항체,환자 샘플로부터 유래된 항체,생체 내에서 발견된 신규 항체,시험관 내에서 발견된 신규 항체,가상 환경에서 발견된 신규 항체 중 적어도 하나를 포함하는, 컴퓨팅 시스템.공개특허 10-2024-0141868-5-청구항 11 제1항에 있어서, 하나 이상의 생체분자 서열 변이체는 단클론 항체, 인간 항체, 인간화 항체, 카멜화 항체, 키메라 항체, 단쇄 Fv(scFv), 이황화-결합 Fv(sdFv), Fab 단편, F(ab') 단편, 항-이디오타입(항-Id) 항체 및 상기 중 어느 하나의 에피토프 결합 단편으로 이루어진 군으로부터 선택된 적어도 하나의 서열 변이체를포함하는, 컴퓨팅 시스템."}
{"patent_id": "10-2024-7026560", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1항에 있어서, 하나 이상의 비일시적 컴퓨터 판독가능 매체에는, 하나 이상의 프로세서에 의해 실행될 때, 컴퓨팅 시스템으로 하여금: (i) 하나 이상의 생체분자 서열 변이체 중 적어도 하나의 생체분자의 하나 이상의 아미노산;(ii) 항체의 상보성 결정 영역(CDR), 중쇄 가변 영역(VH), 경쇄 가변 영역(VL), 프레임워크(FR), 또는 불변 도메인으로 이루어진 군으로부터 선택되는, 하나 이상의 생체분자 서열 변이체 중 적어도 하나의 하나 이상의 영역;(iii) VH의 CDR1, CDR2 및 CDR3으로 이루어진 군으로부터 선택되는 하나 이상의 CDR; 또는(iv) VL의 CDR1, CDR2 및 CDR3으로 이루어진 군으로부터 선택되는 하나 이상의 CDR을 프로그램적으로 돌연변이시킴으로써 하나 이상의 생체분자 서열 변이체를 생성하게 하는 추가의 명령어가 저장되는. 컴퓨팅 시스템."}
{"patent_id": "10-2024-7026560", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제1항에 있어서, 하나 이상의 생체분자 서열 변이체 중 적어도 하나의 이소형은 IgG, IgE, IgM, IgD, IgA 및IgY로 이루어진 군으로부터 선택되는, 컴퓨팅 시스템."}
{"patent_id": "10-2024-7026560", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제1항에 있어서, 하나 이상의 예측된 결합 특성 중 적어도 하나는 평형 해리 상수(KD)로서 표현되며, 이는 하나이상의 생체분자 서열 변이체 중 적어도 하나에 비해 2배, 3배, 4배, 5배, 6배, 7배, 8배, 9배, 또는 10배 이상개선되는, 컴퓨팅 시스템."}
{"patent_id": "10-2024-7026560", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제1항에 있어서, 하나 이상의 관심 변이체 중 적어도 하나의 관심 변이체의 각각의 원하는 특성은:(i) 관심 변이체의 적어도 하나의 예측된 결합 평형의 증가;(ii) 관심 변이체의 적어도 하나의 예측된 결합 평형의 감소;(iii) 관심 변이체의 적어도 하나의 예측된 결합 평형의 상한;(iv) 관심 변이체의 적어도 하나의 예측된 결합 평형의 하한;(v) 관심 변이체의 제1 항원에 대한 제1 예측된 결합 평형의 증가 및 관심 변이체의 제2 항원에 대한 제2 예측된 결합 평형의 감소;(vi) 수용체에 대한 결합 평형을 증가 또는 감소시키기 위한 관심 변이체의 사이토카인 서열의 능력;(vii) 차세대 항체 스캐폴드 및/또는 항체 모방 스캐폴드로서 사용하기 위한 관심 변이체의 적합성;(viii) 항체의 Fc 영역에서 Fc 수용체에 결합하는 관심 변이체의 능력;(ix) 투여 시 내약성에 의해 표시된 바와 같은 관심 변이체의 개발가능성; 또는(x) 다른 단백질과 상호작용하는 단백질의 능력 중 적어도 하나를 포함하는, 컴퓨팅 시스템."}
{"patent_id": "10-2024-7026560", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제1항에 있어서, 예측된 결합 특성은:공개특허 10-2024-0141868-6-(i) 해리 상수 수치(Kd);(ii) Kd에 대한 대리체/상관체;(iii) 결합 상수 수치(Ka); 또는(ii) Ka에 대한 대리체/상관체 중 적어도 하나를 포함하는, 컴퓨팅 시스템."}
{"patent_id": "10-2024-7026560", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제1항에 있어서, 비일시적 컴퓨터 판독가능 매체는:(i) 인공 신경망;(ii) 트랜스포머 신경망;(iii) 컨볼루션 신경망;(iv) 순환 신경망;(v) 딥 러닝 네트워크;(vi) 오토인코더;(vii) 회귀 모델;(viii) 플러그 앤 플레이 언어 모델;(iv) 생성 모델; 또는(x) 유전자 알고리즘 중 적어도 하나를 저장하는, 컴퓨팅 시스템."}
{"patent_id": "10-2024-7026560", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "머신 러닝 모델을 학습시켜 관심 생체분자 서열 변이체를 식별하기 위한 컴퓨터 구현 방법으로서, 상기 방법은:기준 생체분자를 프로그램적으로 돌연변이시킴으로써 하나 이상의 생체분자 서열 변이체를 생성하는 단계;하나 이상의 학습 결합 특성에 따른 상기 생체분자 서열 변이체의 순위를 포함하는 스크리닝 데이터를 수신하는단계; 및입력 생체분자 서열 변이체의 하나 이상의 원하는 결합 특성을 예측하기 위해 상기 스크리닝 데이터를 사용하여상기 머신 러닝 모델을 학습시키는 단계를 포함하는, 컴퓨터 구현 방법."}
{"patent_id": "10-2024-7026560", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에 있어서,하나 이상의 학습 결합 특성을 증폭시키기 위해 생체분자 서열 변이체에 상응하는 재스크리닝 데이터를 수신하는 단계; 및머신 러닝 모델의 정확도를 개선하기 위해 상기 재스크리닝 데이터를 사용하여 머신 러닝 모델을 추가로 학습시키는 단계를 포함하는, 컴퓨터 구현 방법."}
{"patent_id": "10-2024-7026560", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제18항에 있어서, 결합 특성을 학습시키는 단계는 결합 친화도(KD)를 포함하는, 컴퓨터 구현 방법."}
{"patent_id": "10-2024-7026560", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제18항에 있어서, 스크리닝 데이터는 (i) 인간 실험자, 및 (ii) 검정 장치 중 하나 또는 둘 모두로부터 수신되는, 컴퓨터 구현 방법."}
{"patent_id": "10-2024-7026560", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "공개특허 10-2024-0141868-7-제18항에 있어서, 하나 이상의 생체분자 서열 변이체는 항체 또는 항원을 포함하는, 컴퓨터 구현 방법."}
{"patent_id": "10-2024-7026560", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "예측 노이즈 제거를 통해 정확도 및 처리량을 개선하기 위한 컴퓨팅 시스템으로서, 상기 컴퓨팅 시스템은:하나 이상의 프로세서; 및하나 이상의 비일시적 컴퓨터 판독가능 매체이되, 상기 하나 이상의 비일시적 컴퓨터 판독가능 매체에는:학습 데이터를 사용하여 학습된 머신 러닝된 모델로서,상기 학습 데이터는, 상응하는 각각의 결합 파트너에 결합하는 각각의 능력을 나타내는 각각의 측정된 결합 특성을 각각 갖는 하나 이상의 학습 생체분자 서열 변이체를 포함하고,상기 머신 러닝된 모델은 하나 이상의 학습 생체분자 서열 변이체의 예측된 노이즈 제거 생체분자 결합 특성을출력하도록 구성되는, 머신 러닝된 모델; 및상기 하나 이상의 프로세서에 의해 실행되는 경우, 상기 컴퓨팅 시스템으로 하여금,상기 하나 이상의 학습 생체분자 서열 변이체 중 각각의 하나에 각각 상응하는 하나 이상의 노이즈 제거된 예측된 결합 특성을 생성하기 위해 상기 머신 러닝된 모델로 상기 하나 이상의 학습 생체분자 서열 변이체를 처리하게 하고;상기 하나 이상의 학습 생체분자 서열 변이체 및 각각의 노이즈 제거된 예측된 결합 특성을 출력으로서 제공하게 하는 명령어가 저장되는, 하나 이상의 비일시적 컴퓨터 판독가능 매체를 포함하는, 컴퓨팅 시스템."}
{"patent_id": "10-2024-7026560", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제23항에 있어서, 학습 생체분자 서열 변이체는 하나 이상의 불포화 서열 변이체를 포함하는, 컴퓨팅 시스템."}
{"patent_id": "10-2024-7026560", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제23항에 있어서, 상응하는 각각의 결합 파트너에 각각 결합하는, 상기 각각의 능력을 나타내는 각각의 측정된결합 특성 각각은, ACE assayTM을 통해 결정되는, 컴퓨팅 시스템."}
{"patent_id": "10-2024-7026560", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "생체분자 서열 변이체의 자연도를 예측하기 위한 컴퓨팅 시스템으로서, 상기 컴퓨팅 시스템은:하나 이상의 프로세서; 및하나 이상의 비일시적 컴퓨터 판독가능 매체이되, 상기 하나 이상의 비일시적 컴퓨터 판독가능 매체에는:학습 데이터를 사용하여 학습된 머신 러닝된 모델로서,상기 학습 데이터는 하나 이상의 학습 생체분자 서열 변이체를 포함하고,상기 머신 러닝 모델은 하나 이상의 생체분자 서열 변이체의 각각의 예측된 자연도 특성을 출력하도록구성되는, 머신 러닝된 모델; 및상기 하나 이상의 프로세서에 의해 실행되는 경우, 상기 컴퓨팅 시스템으로 하여금,상기 하나 이상의 입력 생체분자 서열 변이체의 각각에 대해 각각 예측된 자연도를 생성하기 위해 상기 머신 러닝된 모델로 상기 하나 이상의 생체분자 서열 변이체를 처리하게 하고;상기 예측된 자연도 특성 중 적어도 하나를 출력으로서 제공하게 하는 명령어가 포함되는, 하나 이상의 비일시적 컴퓨터 판독가능 매체를 포함하는, 컴퓨팅 시스템."}
{"patent_id": "10-2024-7026560", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "제26항에 있어서, 비일시적 컴퓨터 판독가능 매체에는, 하나 이상의 프로세서에 의해 실행될 때, 컴퓨팅 시스템으로 하여금:공개특허 10-2024-0141868-8-적어도 하나의 각각의 자연도 특성과 개발가능성 특성 사이의 하나 이상의 상관관계를 결정하기 위해, 하나 이상의 입력 생체분자 서열 변이체 각각에 대한 각각의 예측된 자연도 특성을 (i) 공개된 파지 데이터 및 (ii) 치료 항체 프로파일러(Therapeutic Antibody Profiler) 중 하나 또는 둘 모두와 비교하게 하는, 추가의 명령어가저장되는, 컴퓨팅 시스템."}
{"patent_id": "10-2024-7026560", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_28", "content": "제26항에 있어서, 비일시적 컴퓨터 판독가능 매체에는, 하나 이상의 프로세서에 의해 실행될 때, 컴퓨팅 시스템으로 하여금:CDR 단독 모델을 사용하여 I상, II상, III상, 또는 임상 단계에서 인간에게 투여된 치료 항체의 공개된 자연도와 하나 이상의 입력 생체분자 서열 변이체 각각에 대한 각각의 예측된 자연도 특성을 비교함으로써 기원-정렬데이터를 생성하게 하고;환자에서 완전한 인간 항체에 대한 항-약물 항체 반응이 발생되었는지의 여부에 따라 상기 기원-정렬 데이터를분할함으로써 면역원성 점수를 결정하게 하는 추가의 명령어가 저장되는, 컴퓨팅 시스템."}
{"patent_id": "10-2024-7026560", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "제26항에 있어서, 비일시적 컴퓨터 판독가능 매체에는, 하나 이상의 프로세서에 의해 실행될 때, 컴퓨팅 시스템으로 하여금:(i) CDRH3 돌연변이 부하의 함수로서의 서열 변이체의 자연도, 또는 (ii) 트라스투주맙의 자연도 중 적어도 하나를 채점하게 하는 추가의 명령어가 저장되는, 컴퓨팅 시스템."}
{"patent_id": "10-2024-7026560", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_30", "content": "제26항에 있어서, 비일시적 컴퓨터 판독가능 매체에는, 하나 이상의 프로세서에 의해 실행될 때, 컴퓨팅 시스템으로 하여금:서열 공간에서의 가능한 모든 서열 변이체의 친화도에 대한 완전 예측을 회피하기 위해 생성 기술을 사용하여,하나 이상의 예측된 결합 특성을 생성하기 위해 머신 러닝된 모델로 하나 이상의 생체분자 서열 변이체를 처리하게 하고, 하나 이상의 생체분자 서열 변이체 중 하나 이상의 관심 생체분자 서열 변이체를 식별하기 위해 하나 이상의 예측된 결합 특성을 분석하게 하는 추가의 명령어가 저장되는, 컴퓨팅 시스템."}
{"patent_id": "10-2024-7026560", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_31", "content": "제30항에 있어서, 비일시적 컴퓨터 판독가능 매체에는, 하나 이상의 프로세서에 의해 실행될 때, 컴퓨팅 시스템으로 하여금:하나 이상의 생체분자 서열 변이체의 각각의 예측된 자연도에 기초하여 하나 이상의 예측된 결합 특성을 생성하기 위해 머신 러닝된 모델로 하나 이상의 생체분자 서열 변이체를 처리하게 하는 추가의 명령어가 저장되는, 컴퓨팅 시스템."}
{"patent_id": "10-2024-7026560", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_32", "content": "제30항에 있어서, 비일시적 컴퓨터 판독가능 매체에는, 하나 이상의 프로세서에 의해 실행될 때, 컴퓨팅 시스템으로 하여금:친화도를 최소화하고 자연도를 최대화함으로써 서열 변이체 중에서 하나 이상의 관심 생체분자 서열 변이체를식별하기 위해 하나 이상의 예측된 결합 특징을 분석하게 하는 추가의 명령어가 저장되는, 컴퓨팅 시스템."}
{"patent_id": "10-2024-7026560", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_33", "content": "제30항에 있어서, 비일시적 컴퓨터 판독가능 매체에는, 하나 이상의 프로세서에 의해 실행될 때, 컴퓨팅 시스템으로 하여금:하나 이상의 생체분자 서열 변이체의 친화도를 최대화하고 하나 이상의 생체분자 서열 변이체의 자연도를 최소화함으로써 서열 변이체 중에서 하나 이상의 관심 생체분자 서열 변이체를 식별하기 위해 하나 이상의 예측된결합 특징을 분석하게 하는 추가의 명령어가 저장되는, 컴퓨팅 시스템.공개특허 10-2024-0141868-9-"}
{"patent_id": "10-2024-7026560", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "컴퓨팅 시스템은, 학습된 머신 러닝 모델 및 명령어가 저장된 프로세서 및 메모리를 포함하며, 상기 명령어는, 하나 이상의 프로세서에 의해 실행될 때, 상기 컴퓨팅 시스템으로 하여금 생체분자 서열 변이체를 처리하여 결합 특성을 예측하고, 관심 생체분자 서열 변이체를 식별하고; 출력으로서 상기 관심 생체분자 서열 변이체를 제공하 (뒷면에 계속)"}
{"patent_id": "10-2024-7026560", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "관련 출원에 대한 상호 참조 본 출원은 2022년 8월 15일에 출원된 미국 특허 가출원 제63/398,222호의 이익을 주장한다. 본 출원은 2022년 5 월 7일에 출원된 미국 특허 가출원 제63/339,450호의 이익을 주장한다. 본 출원은 2022년 5월 4일에 출원된 미 국 특허 가출원 제63/338,398호의 이익을 주장한다. 본 출원은 2022년 5월 4일에 출원된 미국 특허 가출원 제 63/338,433호의 이익을 주장한다. 본 출원은 2022년 3월 15일에 출원된 미국 특허 가출원 제63/320,067호의 이 익을 주장한다. 본 출원은 2022년 1월 7일에 출원된 미국 특허 가출원 제63/297,679호의 이익을 주장한다. 본 출원은 2022년 10월 14일에 출원된 미국 특허 출원 제18/046,849호의 이익을 주장한다. 우선권 출원 각각은 그 전체가 참조로서 본원에 통합된다. 전자적으로 제출된 자료의 참조에 의한 통합 본 개시의 일부인 서열 목록은 본 명세서와 함께 XML 파일로서 동시에 제출된다. 서열 목록이 포함된 XML은 명 칭이 \"457548_Seqlisting.xml\"이고, 2023년 1월 4일에 생성되었으며, 그 크기는 68,540바이트이다. 서열 목록 의 주제는 그 전체가 참조로서 본원에 통합된다."}
{"patent_id": "10-2024-7026560", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "단클론 항체는 이의 표적 항원에 대해 준최적 결합 친화도를 나타낼 수 있다. 친화도는 항체 서열의 \"성숙\"에 의해 개선될 수 있고, 종종 CDR의 조합 돌연변이 유발에 의해 개선될 수 있다. 그러나, 조합 돌연변이 공간은 너무 방대하며, 실험적 방법으로 이를 완전히 프로브하는 데에는 상당한 양의 시간과 자원이 소요될 것이다. 따 라서, 습식 실험실 스크리닝 해법(강화된 항체 친화도)은 비효율적이고 시간 소모적일 수 있다. 생물학적 약물을 발견하는 데에는 복잡하고 조합적인 어려움이 있다. 가능한 단클론 항체 CDR 변이체의 수는 우 주에 있는 원자의 수보다 많다. 전통적인 항체 스크리닝 접근법은 작은 서열 공간(예를 들어 수백 내지 수천 개 의 변이체)을 탐색하는데, 종종 결합 친화도가 좋지 않고, 개발 가능성이 염려되고, 면역원성 프로파일이 좋지 않은 약물 후보가 생성된다. 생물학적 약물을 발견하는 것은 실패하는 경우가 너무 많다. 구체적으로, 매년 수 십억 달러의 투자에도 불구하고, 신약의 발견에서 출시까지의 여정에서 성공하는 경우는 대략 4%에 불과하다. 심지어, 전임상 시험을 통과하는 선도 약물(drug leads)의 단지 18%만이 최종적으로 I상 및 II상 시험을 통과하 며, 이는 약물 후보의 대부분이 안전하지 않거나 비효과적임을 시사한다. 이러한 실패율의 대부분은 기저 생물 학 및 병리에 대한 불완전한 이해에 기인하지만, 대다수의 실패 원인은 미흡한 선도 약물 최적화이다. 전통적인 항체 스크리닝 접근법은 작은 서열 공간만을 탐색할 수 있는데, 이는 불충분한 결합 친화도, 개발 가 능성 제한, 및 불량한 면역원성 프로파일과 같은 준최적 특성을 부여하는 서열로 결과를 제한할 수 있다. 대조 적으로, 스크리닝 또는 선택과 결합된 심층 돌연변이유발(deep mutagenesis)은 더 큰 항체 서열 공간을 탐색할 수 있게 하여, 잠재적으로 더 많은 보다 양호한 선도 약물을 수득할 수 있게 한다. 그러나, 심층 돌연변이유발 은 고유한 어려움이 따른다. 예를 들어, 대부분의 돌연변이는 주어진 항체의 결합 친화도를 개선시키기보다는 저하시키며, 이는 스크리닝 효율을 감소시킨다. 또한, 항체 서열 변이체 공간의 조합론은 돌연변이 부하(즉, 각 각의 서열 변이체에 동시에 도입된 돌연변이의 수)에 따라 기하급수적으로 성장하고 단기간에 실험적 검정 용량 을 엄청나게 초과한다. 또한, 후보 생체분자(예를 들어 항체)를 치료 약물로 개발하는 것은 높은 위험이 수반되는 복잡한 과정이다. 이 러한 위험은 종종 생산, 제형화, 효능, 및 부작용에 있어서의 어려움이 많기 때문이다. 당업계에서는 이러한 위 험을 모델링하는 것이 굉장히 어려운 일이었는데, 이는 관련 데이터, 특히 대규모의 관련 데이터를 수득하는 데 어려움이 있었기 때문이다. 또한, 대부분의 항체 스크리닝 접근법은 한 번에 하나의 특성만을 스크리닝하는 것으로 제한되어, 약물 효능 및 개발가능성의 동시 최적화가 제한된다. 항체 특성을 순차적으로 최적화하기보다는 동시에 최적화하는 것이 더 유리한 치료 전략이며, 이는 하나의 특성을 개선하는 것이다른 특성에 부정적인 영향을 미칠 수 있기 때문이다. 모든 특성을 동시에 공동 최적화하는 전략을 통하면 더 나은 치료 생성물을 수득할 수 있다. 심층 신 경망(deep neural networks)은 실험적 스크리닝 용량의 한계를 극복하기 위한 새로운 도구이다. 일반적인 접근법은 소량의 실험 데이터에 대해 모델을 학습시키고, 측정된 형질을 개선할 가능성이 가장 높은 서열을 예측하 는 데 이를 응용하는 것을 포함한다. 몇몇 유망한 접근법이 제안되었지만, 이들 모델을 통한 가상 환경(in silico) 예측 중 실험실에서 검증된 것은 손에 꼽을 정도이다. 원리를 증명하는 것으로서는 충분하겠지만, 이러 한 시연은 학습 데이터를 생성하는 데 사용되는 스크리닝 플랫폼의 단점, 즉 (연속 판독이 아니라) 처리량이 제 한된 이진 판독으로 인해 실제 설계에는 제한된다. 전반적으로, 이는 모델의 정량적 정확도 및 더 높은 돌연변 이 부하를 외삽하는 능력을 제한한다. 항체 스크리닝 접근법에 대한 추가적인 우려는 결합 친화도의 개선이 개발 가능성 및 면역원성 특성의 감소를 초래할 수 있다는 것이다. 이 문제는 다른 특성과 관계없이 학습된 머신 러닝 모델에 의해 해결되지 않은 상태 로 유지될 것이다. 따라서, 종래의 생체분자 스크리닝 접근법을 개선하기 위해 고 처리량 실험 생물학을 머신 러닝과 결합함으로써 정확한 서열의 더 많은 탐색을 가능하게 하는 기술이 필요하다. 일 양태에서, 관심 생체분자 서열 변이체를 식별하기 위한 컴퓨팅 시스템은 다음을 포함한다: (a) 하나 이상의 프로세서; 및 (b) 다음이 저장된 하나 이상의 비일시적 컴퓨터 판독 가능 매체: (i) 학습 데이터를 사용하여 학 습된 머신 러닝된 모델로서, 학습 데이터는 하나 이상의 학습 생체분자 서열 변이체를 포함하고, 각각의 학습 생체분자 서열 변이체는 상응하는 각각의 결합 파트너에 결합하는 각각의 능력을 나타내는 각각의 측정된 결합 특성을 갖고, 머신 러닝된 모델은 입력 생체분자 서열 변이체의 예측 생체분자 결합 특성을 출력하도록 구성되 는, 머신 러닝된 모델; 및 (ii) 하나 이상의 프로세서에 의해 실행될 때 컴퓨팅 시스템으로 하여금 다음을 수행 하도록 하는 명령어: 머신 러닝된 모델을 이용해 하나 이상의 생체분자 서열 변이체를 처리하여 하나 이상 의 예측된 결합 특성을 생성하게 하는 단계로서, 각각은 하나 이상의 생체분자 서열 변이체 중 각각의 하나에 상응하는, 단계; 하나 이상의 예측된 결합 특성을 분석하여 서열 변이체 가운데 하나 이상의 관심 생체분자 서열 변이체를 식별하게 하는 단계로서, 하나 이상의 관심 생체분자 서열 변이체 각각은 하나 이상의 원하는 특 성을 각각 갖는, 단계; 및 하나 이상의 관심 생체분자 서열 변이체를 출력으로서 제공하도록 하는 단계. 또 다른 양태에서, 관심 생체분자 서열 변이체를 식별하기 위해 머신 러닝 모델(machine learning model)을 학 습시키기 위한 컴퓨터 구현 방법은 다음을 포함한다: 기준 생체분자를 프로그램적으로 돌연변이시킴으로써 하나 이상의 생체분자 서열 변이체를 생성하는 단계; 하나 이상의 학습 결합 특성에 따른 생체분자 서열 변 이체의 순위를 포함하는 스크리닝 데이터를 수신하는 단계; 및 입력 생체분자 서열 변이체의 하나 이상의 원하는 결합 특성을 예측하기 위해 수신된 스크리닝 데이터를 사용하여 머신 러닝 모델을 학습시키는 단계. 또 다른 양태에서, 생체분자 서열 변이체의 자연도(naturalness)를 예측하기 위한 컴퓨팅 시스템은 하나 이상의 프로세서; 및 다음이 저장된 하나 이상의 비일시적 컴퓨터 판독가능 매체를 포함한다: 학습 데이터를 사용하여 학습된 머신 러닝된 모델로서, 학습 데이터는 하나 이상의 학습 생체분자 서열 변이체를 포함하고, 머신 러닝된 모델은 하나 이상의 생체분자 서열 변이체의 각각의 예측된 자연도 특성을 출력하도록 구성된, 머신 러닝된 모 델; 및 하나 이상의 프로세서에 의해 실행될 때, 컴퓨팅 시스템으로 하여금 다음을 수행하게 하는 명령어: (i) 머신 러닝된 모델을 이용해 하나 이상의 입력된 생체분자 서열 변이체를 처리하여 하나 이상의 입력된 생체분자 서열 변이체 각각에 대한 각각의 예측된 자연도 특성을 생성하는 단계; 및 (ii) 예측된 자연도 특성 중 적어도 하나를 출력으로서 제공하는 단계. 또 다른 양태에서, 생체분자 서열 변이체의 자연도를 예측하기 위한 컴퓨팅 시스템은 하나 이상의 프로세서; 및 다음이 저장된 하나 이상의 비일시적 컴퓨터 판독가능 매체를 포함한다: 학습 데이터를 사용하여 학습된 머신 러닝된 모델로서, 학습 데이터는 하나 이상의 학습 생체분자 서열 변이체를 포함하고, 머신 러닝된 모델은 하나 이상의 생체분자 서열 변이체의 각각의 예측된 자연도 특성을 출력하도록 구성된, 머신 러닝된 모델; 및 하나 이상의 프로세서에 의해 실행될 때, 컴퓨팅 시스템으로 하여금 다음을 수행하게 하는 명령어: 머신 러닝된 모델을 이용해 하나 이상의 입력된 생체분자 서열 변이체를 처리하여 하나 이상의 입력된 생체분자 서열 변이체 각각에 대한 각각의 예측된 자연도 특성을 생성하는 단계; 및 하나 이상의 예측된 자연도 특성 중 적어도 하나를 출력으로서 제공하는 단계. 일부 구현예에서, 본 개시는 학습 데이터를 생성하기 위한 방법을 제공한다. 일 구현예에서, 머신 러닝 모델을 위한 학습 데이터를 생성하기 위한 방법이 제공되며, 상기 방법은 다음을 포함한다: a) 숙주 세포에서 생체분자 변이체 라이브러리를 발현시키는 단계; b) 다음을 측정하는 단계: (i) 발현 수준 및 (ii) (b)에서 발현된 2개이상의 생체분자 변이체의 관심 결합 파트너에 대한 친화도 값; c) 측정된 발현 수준 및 측정된 친화도 값에 기 초하여 숙주 세포를 세포 하위집단의 분포로 분류하여; 친화도 분포에 걸쳐 세포를 수집하는 단계; d) (c)의 수 집된 세포로부터 발현된 생체분자 변이체를 시퀀싱하는 단계; e) 각각의 시퀀싱된 생체분자 변이체에 대한 농축 점수를 계산하는 단계로서, 상기 농축 점수 및 상기 생체분자 변이체 서열을 통해 서열 기반 친화도 예측을 수 행할 수 있는 머신 러닝 모델을 학습시킬 수 있는, 단계. 또 다른 구현예에서, 전술한 방법으로서, 생체분자 변이체의 라이브러리는 기준 생체분자를 암호화하는 핵산을 무작위로 돌연변이시킴으로써 생성되는 방법이 제공된다. 또 다른 구현예에서, 전술한 방법으로서, 생체분자 변 이체의 라이브러리는 무작위 돌연변이 유발, 오류-유발 PCR 돌연변이 유발, 올리고뉴클레오티드-유도 돌연변이 유발, 카세트 돌연변이 유발, 셔플링, 포화 돌연변이 유발, 상동성-유도 돌연변이 유발, 활성화 유도 시티딘 탈 아미노효소(AID) 매개 돌연변이 유발, 또는 트랜스포존 돌연변이 유발에 의해 생성되는 방법이 제공된다. 또 다 른 구현예에서, 전술한 방법으로서, 생체분자 변이체의 라이브러리는 적어도 104~107개의 고유 생체분자 변이체 서열을 포함하는 방법이 제공된다. 또 다른 구현예에서, 전술한 방법으로서, 생체분자 변이체의 라이브러리가 숙주 세포 표면 상에 디스플레이되는 방법이 제공된다. 또 다른 구현예에서, 전술한 방법으로서, 생체분자 변이 체의 라이브러리가 숙주 세포 세포질에서 발현되고 유지되는 방법이 제공된다. 또 다른 구현예에서, 전술한 방법으로서, 숙주 세포가 대장균 세포인 방법이 제공된다. 또 다른 구현예에서, 전 술한 방법으로서, 대장균 세포가 대장균 521 세포인 방법이 제공된다. 또 다른 구현예에서, 전술한 방법으로서, 대장균 세포가 다음 중 하나 이상 또는 전부를 포함하는 방법이 제공된다: a) 적어도 하나의 유도성 프로모터의 유도자(inducer)에 대한 수송체 단백질을 암호화하는 적어도 하나의 유전자의 유전자 기능의 변경; b) 적어도 하나의 유도성 프로모터의 유도자를 대사시키는 단백질을 암호화하는 적어도 하나의 유전자의 유전자 기능의 감 소된 수준; c) 적어도 하나의 유도성 프로모터의 유도자의 생합성에 관여하는 단백질을 암호화하는 적어도 하나 의 유전자의 유전자 기능의 감소된 수준; d) 숙주 세포 세포질의 환원/산화 환경에 영향을 미치는 유전자의 변 경된 유전자 기능; e) 환원효소를 암호화하는 유전자의 유전자 기능의 감소된 수준; f) 적어도 하나의 이황화 결합 이성질화효소 단백질을 암호화하는 적어도 하나의 발현 작제물; g) 신호 펩티드가 결여된 DsbC의 형태를 암호화하는 적어도 하나의 폴리뉴클레오티드; 및/또는 h) Ervlp를 암호화하는 적어도 하나의 폴리뉴클레오티드. 또 다른 구현예에서, 전술한 방법으로서, 단계 (c)는 발현된 생체분자 변이체의 결합 특이성, 생물학적 활성, 안정성, 및/또는 용해도 중 하나 이상을 임의로 추가로 측정하는 단계인 방법이 제공된다. 또 다른 구현예에서, 전술한 방법으로서, 친화도는 관심 결합 파트너에 대한 생체분자 변이체의 결합 해리 상수 (KD)를 측정함으로써 정량화되는 방법이 제공된다. 일 구현예에서, 관심 결합 파트너는 형광 표지된 항원이다. 또 다른 구현예에서, 전술한 방법으로서, 생체분자 변이체의 발현 수준은 항-IgG-결합 능력을 측정함으로써 정 량화되는 방법이 제공된다. 또 다른 구현예에서, 전술한 방법으로서, 생체분자 변이체의 발현 수준은 형광단에 접합된 항-IgG 항체를 사용하여 정량화되는 방법이 제공된다. 또 다른 구현예에서, 전술한 방법으로서, 생체분 자 변이체의 발현 수준은 비-항원 결합 능력을 측정함으로써 정량화되는 방법이 제공된다. 본 개시는 또한, 일부 구현예에서, 전술한 방법으로서, 단계 (c)에서의 측정하는 단계 및 단계 (d)에서의 분류 하는 단계는 형광 활성화 세포 분류(FACS) 검정을 포함하는 방법을 제공한다. 또 다른 구현예에서, 전술한 방법 으로서, 농축 점수를 계산하기 전에 시퀀싱된 생체분자 변이체의 결합 친화도를 측정하는 단계를 임의로 추가로 포함하는 방법이 제공된다. 일 구현예에서, 결합 친화도는 표면 플라스몬 공명(SPR) 기반 결합 검정, 바이오층 간섭계, 및/또는 유세포 계측법 유래 결합 곡선으로 이루어진 군으로부터 선택된 검정을 사용하여 측정된다. 또 다른 구현예에서, 전술한 방법으로서, 단계 (e)의 시퀀싱하는 단계는 심층 시퀀싱, 차세대 시퀀싱, 롱 리드 나노포어 시퀀싱(Long read nanopore sequencing), 단일 분자 실시간 롱 리드 시퀀싱(pacbio)으로 이루어진 군 으로부터 선택된 방법에 의해 수득되는 방법이 제공된다. 또 다른 구현예에서, 단계 (e)의 시퀀싱하는 단계는 심층 시퀀싱, 차세대 시퀀싱, 롱 리드 나노포어 시퀀싱, 단일 분자 실시간 롱 리드 시퀀싱(pacbio)으로 이루어 진 군으로부터 선택된 방법에 의해 수득된다. 또 다른 구현예에서, 전술한 방법으로서, 시퀀싱에 앞서 생체분자 변이체를 암호화하는 핵산이 고유 분자 식별자(UMI)를 포함하는 바코드 서열을 포함하도록 변형되는 방법이 제 공된다. 본 개시는 또한, 일 구현예에서, 전술한 방법으로서, 생체분자 변이체는 단클론 항체, 이중특이적 항체, 다중특 이적 항체, 인간화 항체, 키메라 항체, 카멜화 항체, 단일 도메인 항체, 단쇄 Fv(ScFv), 단쇄 항체, Fab 단편, F(ab') 단편, 이황화-연결된 Fv(sdFv), 또는 항-유전자형(항-Id) 항체로 이루어진 군으로부터 선택되는 방법을제공한다. 또 다른 구현예에서, 전술한 방법으로서, 생체분자 변이체는 단클론 항체, 이중특이적 항체, 다중특 이적 항체, 인간화 항체, 키메라 항체, 카멜화 항체, 단일 도메인 항체, 단쇄 Fv(ScFv), 단쇄 항체, Fab 단편, F(ab') 단편, 이황화-연결된 Fv(sdFv), 또는 항-유전자형(항-Id) 항체로 이루어진 군으로부터 선택되는 방법이 제공된다. 또 다른 구현예에서, 전술한 방법으로서, 생체분자 변이체는 펩티드, 폴리펩티드, 프로테아제, 산화 환원효소, 전이효소, 가수분해효소, 리아제, 이성질화효소, 리가아제, 효소, 항체, 사이토카인, 케모카인, 핵산, 대사산물, 소분자(<1 kDa), 및 합성 분자로 이루어진 군으로부터 선택되는 방법이 제공된다. 또 다른 구현예에서, 머신 러닝 모델을 위한 학습 데이터를 생성하기 위한 방법이 제공되며, 상기 방법은 다음 을 포함한다: a)숙주 세포에서 생체분자 변이체 라이브러리를 발현시키는 단계; b) 다음을 측정하는 단계: (i) 발현 수준 및 (ii) (b)에서 발현된 2개 이상의 생체분자 변이체의 관심 결합 파트너에 대한 친화도 값; c) 측정 된 발현 수준 및 측정된 친화도 값에 기초하여 숙주 세포를 세포 하위집단의 분포로 분류하여; 친화도 분포에 걸쳐 세포를 수집하는 단계; d) (c)의 수집된 숙주 세포로부터 생체분자 변이체를 암호화하는 핵산을 단리하고, 선택적 회전환 증폭(sRCA, selective rolling circle amplification)을 사용해 상기 핵산을 증폭하고, 생체분 자 변이체를 암호화하는 핵산을 시퀀싱하는 단계; 및 e)각각의 시퀀싱된 생체분자 변이체에 대한 농축 점수를 계산하는 단계로서, 상기 농축 점수 및 상기 생체분자 변이체 서열을 통해 서열 기반 친화도 예측을 수행할 수 있는 머신 러닝 모델을 학습시킬 수 있는, 단계."}
{"patent_id": "10-2024-7026560", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시는 항체 서열 변이체와 실험 측정치(예를 들어, 결합 친화도, pH, 및 다른 데이터 유형) 사이의 맵핑을 사용하여 학습되는 인공 지능(AI) 및 머신 러닝(ML) 모델에 대한 필요성을 다룬다. 본원에 기술된 바와 같이, 모델이 학습되면, 모델은 보지 못했던 서열 변이체의 결합 친화도를 예측할 수 있다. 본 기술은, 고 처리량 및 저 처리량 결합 친화도 데이터와 결합될 때, 여러 자릿 수의 (예를 들어 4자릿수의) KD 범위에 걸쳐 보지 못했 던 항체 서열 변이체의 결합 친화도를 예측할 수 있는 심층 상황별 언어 모델(deep contextual language models)을 포함한다. 본 기술은, 약물 개발 가능성 및 면역원성과 관련된 하류 문제와 결합되도록 본원에서 도 시된 광범위하게 적용할 수 있는 척도인 생체분자(예를 들어, 항체) 서열 변이체의 \"자연도(naturalness)\"를 측 정할 수 있게 한다. 본 기술은 생체분자(예를 들어, 항체) 조작을 가속화 및 개선하고, 실제 적용(예를 들어, 항체 약물 후보물질의 개발)의 성공률을 증가시킬 수 있다. 정확한 머신 러닝 모델을 구축하는 데 있어서의 주된 문제는 적절한 대규모 학습 데이터세트가 부족하다는 것이다. 방향성 진화 플랫폼(directed evolution platforms)이 이에 매우 적합하며, 이는 해당 플랫폼이 생물학적 서열 데이터(DNA, RNA, 단백질)를 표현형 결과에 연결시키는 것에 의존하기 때문이다. 실제로, 돌연변이 유발 라이브러리에 의해 생성된 데이터에 대해 학습된 ML 모델을 단백질 조작을 안내하는 수단으로 사용하는 것은 오 랫동안 제안되어 왔다. 최근 몇 년 동안, 딥 시퀀싱에 대한 액세스 및 병렬 연산은 서열 데이터로부터 분자 표 현형을 예측할 수 있는 딥 러닝 모델의 구축을 가능하게 하였다. 딥 러닝은 다수의 숨겨진 계층을 통합하여 단 일 딥 시퀀싱 실험으로부터 수집된 수백만 개의 리드(reads)와 같은 대규모 고차원 데이터 세트에 숨겨진 관계 를 해독한다. 이어서, 양호하게 학습된 모델을 사용하여 완전히 보지 못했던 변이체 및 신규 변이체를 예측할 수 있다. 이러한 모델 외삽의 적용은 물리적으로 가능한 것보다 훨씬 더 방대한 서열 공간을 조사할 수 있는 방 법을 제공하기 때문에 단백질 조작에 완벽하게 적합하다. 본원에서는, 심층 돌연변이 스캐닝 및 박테리아 디스 플레이 시스템의 조합으로, A ML 모델에 대한 학습 데이터세트를 생성하여 서열-기능 관계를 학습함으로써 이러 한 문제를 해결한다. 비활성 물질이 아닌 관심 활성 유전자 산물(예를 들어, 본원에서 사용되는 바와 같은 생체분자)을 발현하는 숙 주 세포를 식별하는 활성-특이적 세포 농축(ACE) 검정은 WO 2021/146626에 기술되어 있으며, 관련 내용은 본원 에 통합된다. 활성 유전자 산물은, 예를 들어, 결합 파트너 분자에 특이적으로 결합하는 활성 유전자 산물의 능 력에 의해, 또는 화학 또는 효소 반응에 참여하는 유전자 산물의 능력에 의해 비활성 물질과 구별될 수 있다. 폴리펩티드 유전자 산물에서 적절하게 형성된 이황화 결합의 존재는 그것이 정확하게 접혀 있고 추정적으로 활 성이라는 표시이다. 세포-농축 방법에서, 관심 활성 유전자 산물은, 예를 들어, 관심 유전자 산물이 항체 또는 Fab인 경우 표지된 항원; 또는 관심 유전자 산물이 수용체 또는 수용체 단편인 경우 표지된 리간드(여기에서 리 간드는 수용체의 활성 형태에 특이적으로 결합함); 또는 관심 유전자 생성물이 효소인 경우 표지된 기질 또는 표지된 기질 유사체와 같은, 관심 활성 유전자 산물에 특이적으로 결합하는 적절한 표지 복합체를 사용함으로써 검출된다. 임의의 관심 유전자 산물에 대해, 비활성 유전자 산물이 아닌 활성 유전자 산물에 특이적으로 결합하 는 이용 가능한 항체 또는 항체 단편이 있는 경우, 해당 항체 또는 항체 단편은, 이들이 검출 가능한 모이어티 에 부착될 때 관심 활성 유전자 산물을 표지하는 데 사용될 수 있다. ACE의 핵심 강점은 한 번의 실행으로 수만 개의 \"변이체 단위\"를 스크리닝하는 능력이다. 그러나, 약물 발견에 적용된 지속적인 AI 노력은 습식 실험실 단독 스크리닝에 대한 추가 요건을 추가로 하며, 이는 AI에 적합한 데 이터세트의 생성을 위한 ACE의 추가 최적화를 요구한다. 최고 성능의 변이체를 선택하는 것을 목표로 하는 습식 실험실 단독 스크리닝은 검정으로부터의 엄격한 정량화를 필요로 하지 않는다. 실제로, 이러한 스크리닝의 반복 적 특성은 n-1 단계의 히트가 단계 n에서 재스크리닝되어, n-1에서의 위양성(false positive)을 효과적으로 배 제하는 것이다. 또한, 습식 실험실 스크리닝은 종종 원하는 관심 모집단(예를 들어, 더 높은 친화도 변이체)만 을 선택하도록 조정되며, 이와 같이 해당 검정은 관심 파라미터(예를 들어, 항체 친화도)의 넓은 동적 범위에 걸쳐 정량적일 필요는 없다. 그러나, 정성적 예측을 예측하기 위한 AI 모델은 정량적 서열 변이체 학습 데이터 로부터의 이점을 갖는다. 따라서, 모델이 의미 있는 예측을 생성하려면 정량적 서열 변형 학습 데이터가 정확해 야 한다. 본 개시는 이러한 요구 및 단점을 해결한다. 본 개시는, 다양한 구현예에서, KD와 상관되는 qaACE 점수를 생성하기 위해 유세포 계측법 및 차세대 시퀀싱을 사용하여 고 처리량으로 항체 변이체의 친화도를 샘플링하기 위한 방법으로서, qaACE 검정 - 정량적 친화도 qaACE(\"qaACE\")의 증강을 제공한다. 이러한 방법의 주요 목표는 서열 기반 친화도 예측의 수행을 위해 AI 모델 에 대한 고도의 정량적 고 처리량 학습 데이터를 생성하는 것이다. 이러한 방법은 임의의 항체 포맷, mab, fab, scFv, scFAB, VHH, 나노바디 등에 적용될 수 있으며, 다른 결합 약물 포맷에 대한 적용 또한 고려될 수 있다.일 구현예에서, qaACE 프로세스의 제1 단계는 시작점 항체 분자 주위의 서열 공간을 균일하게 샘플링하는, 돌연 변이적으로 다양한 항체 라이브러리를 생성하는 것이다. 이러한 라이브러리는 원래 서열로부터 돌연변이 거리의 범위에 걸쳐 있는 변이체를 포함한다. 본원의 실시예를 포함하는 일부 구현예에서, 방법은 형광 표지된 항원 프로브에 결합하는, SoluPro 대장균에서 발현된, 항체로부터의 유세포 계측 판독을 제공한다. qaACE 검정에서, 항체 분자의 발현 설정은, 세포 내 형광 신호의 변화가 형광 항원 프로브에 결합하는 세포 내의 발현된 항체 변이체의 상이한 친화도로 인한 것이 되도 록 정규화된다. 이러한 정규화는, 모든 변이체에 결합하고 해당 신호가 항원 프로브에 대한 직교 형광 채널에 내에 있게 되는 일반 표적 분자 프로브를 통해 달성된다. 이러한 설정에서, 본 연구진은 변이체의 형광 신호가 임의의 범위 내에서 항체 변이체의 측정된 KD에 비례한다는 것을 입증한다. 이러한 비례성을 감안하여, FACS를 사용하여, 친화도의 범위(예를 들어, 분포)에 걸쳐 항체 변이체를 함유하는 세포가 분류될 수 있다. 라이브러리 모집단 분포에 걸친 게이팅을 사용하는 친화도 값의 범위에 걸친 분류 후, 세포 물질을 시퀀싱하고 친화도 게이트(빈, 튜브)에 걸친 관찰된 변이체의 유병률에 대해 정량화한다. 정량화를 사용하여, 각 변이체에 대한 농축 점수를 계산한다. qaACE를 통해 생성된 농축 점수는 정확도 및 처리량으로 인해 AI 모델링 목적에 이 상적인 데이터 유형이다. 하나의 예시적인 워크플로우에서, 본 개시는 다음의 일반 단계 중 일부 또는 전부를 포함하는 qaACE 검정을 제 공한다: 1) SoluPro 대장균과 같은 숙주 세포에서 발현된 qaACE를 통한 스크리닝을 위한 항체 또는 다른 약물 분자 라이 브러리의 생성. 2) 예를 들어, 초기 유세포 계측법 개발 프로세스를 통한 FACS에 사용하기 위한, 형광 표지된 항원 또는 결합 파트너 프로브의 식별. 3) 세포 내에서 발현 수준을 검출할 수 있게 하는 표적 분자 변이체에 대한 일반 프로브의 사용. 해당 발현 신 호는 균일한 발현 모집단을 게이팅하여 에피토프 결합 신호와 관련된 친화도 및 발현 신호를 명확하게 하는 데 사용됨. 4) 친화도 분포에 걸친 세포 분류. 5) 친화도 분포에 걸쳐 분류된 세포의 시퀀싱. 6) 시퀀싱 동안 DNA 바코드 또는 UMI가 관심 영역의 PCR 증폭을 통해 추가될 수 있음. 이들 UMI는 게이트로부터 검색된 변이체의 절대 정량화를 가능하게 할 수 있음. 7) 각각의 관찰된 변이체에 대한 농축 점수와 상관된 친화도의 생성. 8) 농축 점수 및 항체 변이체 서열을 사용하는 AI 모델 학습. 본원에 기술된 바와 같이, 본 개시는 ML 모델이, 예를 들어 서열 기반 친화도 예측을 수행하도록, 고도의 정량 적 고 처리량 학습 데이터를 생성하는 방법을 제공한다. 본 개시의 일부 구현예에서, 숙주 세포에서 또는 숙주 세포의 표면 상에서 발현되는 매우 다양한 생체분자 변이체 라이브러리의 서열은 실험(예를 들어, 다른 판독값 중, 발현 및/또는 친화도를 결정하기 위한 검정)에 대한 입력치로서 기능한다. 일부 구현예에서, 변이체는 변이 체 발현 수준에 대해 정규화되는 결합 친화도 값(KD)의 고 처리량 측정에 기초하여 복수의 빈으로 분류되고, 각 각의 빈의 변이체 서열은 심층 DNA 시퀀싱에 의해 수득되고 집계된다. 이어서, 일부 구현예에서, 방법은 (즉, 비-결합제, 저 결합제 및 고 결합제로부터의) 전체 실험 친화도 분포에 걸친 KD 및 각각의 빈의 모든 생체분자 변이체의 서열 정보를 상관시키는 복수의 농축 점수를 출력한다. 본 개시의 qaACE 검정을 통해 생성된 농축 점 수는 이의 정확도 및 처리량으로 인해 AI 모델링 목적에 이상적인 데이터 유형이다. 이에 따라, 생체분자 변이 체의 친화도 및 서열 데이터를 수득하는 조합된 방법은 본원에서 정량적 친화도 활성-특이적 세포 농축 (quantitative affinity Activity-specific Cell Enrichment, qaACE) 검정으로서 지칭된다. 본원에서 사용되는 바와 같이, 용어 \"정량적 친화도 활성-특이적 세포 농축 또는 qaACE 검정\"은 생체분자 변이 체의 친화도 및 서열 데이터를 수득하기 위한 고 처리량 검정을 지칭한다(2022년 8월 15일에 출원된, 그 전체 내용이 본원에 참조로서 통합되는 미국 특허 가출원 제63/371,474호 참조). 본원에서 사용되는 바와 같이, 용어 \"친화도 분포\"는 생체분자 변이체의 무작위화된 라이브러리에서 모든 가능 한 서열 변이체에 대한 항원 결합에 대한 KD 값의 분포를 지칭한다. 기준 생체분자의 KD 값과의 비교는 해당 변이체가 보다 높은 친화도 또는 보다 낮은 친화도로 결합하는지의 여부를 나타낸다. 본 기술은 심층 상황별 언어 모델 및 정량적 고 처리량 실험 결합 친화도 데이터를 사용하여 표적 항원에 대한 항체의 결합 친화도를 개선하는 능력을 입증한다. 본 연구진은 모델이 높은 정확도로 보지 못했던 항체 변이체 의 결합 친화도를 정량적으로 예측할 수 있고, 가상 환경에서 약물 스크리닝을 수행하는 능력을 제공함으로써, 궁극적으로 접근 가능한 서열 공간을 100배만큼 증가시킬 수 있음을 입증한다. 이러한 의미에서, 학습된 러너 (머신 러닝)는 서열만으로부터 기능적 주석을 할당하는 블랙 박스 문제에 대한 일반적인 대리자의 역할을 수행 한다. 정의된 특성을 갖는 신규 변이체는, 단백질 피트니스 환경에 대해 학습된 다양한 프레임워크에 대한 오라 클(예지자)로서의 모델을 사용함으로써 일관되게 설계될 수 있다. 본 연구진은, 전통적인 스크리닝으로 달성할 수 있는 것보다 훨씬 더 높은 성공률로, 실험실에서의 예측 및 결과적인 설계를 확인하였다. 본 심층 상황별 언어 모델은, (예를 들어, 트라스투주맙 서열 변이체의 고품질 결합 친화도 측정을 사용하는 항 체 조작의 경우) 높은 정확도로 10배 이상(예를 들어, 10,000배)의 보지 못했던 서열 변이체의 결합 친화도를 예측할 수 있는 대규모 언어 모델이 포함을 포함하며, 이에 따라 전체 가상 환경에서의 전체적인 약물 스크리닝 을 수행할 수 있다. 여기에서, 천연 항체 서열을 본 연구의 언어 모델에 도입함으로써, 본 기술은 숙주 종에 대 한 임의의 주어진 서열의 \"자연도 특성\"을 특성화할 수 있다. 경험적 연구는 높은 자연도 점수는 개선된 면역원 성 및 개발가능성 메트릭과 연관되며, 이에 따라 약물 리드 스크리닝 동안 다수의 항체 특성을 동시에 최적화하 는 것의 중요하다는 것을 강조한다. 이러한 과제를 해결하기 위해, 본 연구진은 강한 결합 친화도 및 높은 자연 도를 갖는 서열의 매우 효율적인 식별을 위한 유전자 알고리즘을 제시한다. 이들 모델은 개선된 결합 친화도를 갖는 변이체를 식별하고, 이들 변이체 중 다수(예를 들어, 76%)가 정확한 습 식 실험실 스크리닝에 기초하여 야생형 트라스투주맙보다 높은 결합 친화도를 갖는다는 것을 확인하는 데 사용 될 수 있다. 심층 상황별 언어 모델을 가상 환경 스크리닝과 조합하는 이러한 개발은 항체 리드 최적화를 크게 가속화하고 항체 후보의 치료 가능성을 개선할 수 있다. 당업자가 의해 이해하는 바와 같이, 가상 환경 모델링은 습식 실험실 실험보다 훨씬 더 신속하고 저렴하기 때문 에, 훨씬 더 방대한 돌연변이 공간을 탐색할 수 있다. 본원에서 제공되는 바와 같이, 일부 양태에서, 단지 정성 적 예측만을 수행할 수 있는 가장 최근에 공개된 최신 기술(Mason 등의 문헌[Nat Biomedical Engineering, 2021, 5, 600-612])(결합제 대 비결합제, 즉 Mason에서, 해당 모델은 기초 분류기임)과 대조적으로, 결합 친화 도(KD로서 표현됨 - 즉, 해당 모델은 회귀기(regressor)임)의 정량적 예측을 수행한다. 가상 환경에서의 스크리 닝에 의해, 습식 실험실 방법을 사용하는 것과 비교하여 훨씬 더 방대한 서열 공간을 탐색할 수 있다. 본 기술 은 고도의 정확한 학습 데이터의 생성을 크게 가속화하는 (예를 들어, 모델 학습을 위한) 습식 실험실 양태를 포함할 수 있다. 따라서, 본원에 기술된 AI 지원 워크플로우는 보다 적은 노력으로 보다 높은 수율 및 보다 양 호한 결과를 제공한다. 당업자가 이해하는 바와 같이, 본 개시는 항체-항원 결합 특성에 관한 다양한 구현예를 제공하지만, 본원에 기 술된 모델 및 방법은, 예를 들어 단백질, 핵산, 수용체, 리간드 등을 포함하는 임의의 생체분자에 적용될 수 있 으며, 여기에서 생체분자는 결합 파트너(일부 구현예에서, 이는 동일하거나 상이한 유형의 생체분자임)와 결합 하거나 그렇지 않으면 상호작용할 수 있다. 따라서, \"관심 생체분자 서열 변이체\"는, 일부 구현예에서, 본원에 기술된 바와 같은 생체분자(예컨대, 항체 또는 항체 단편)의 서열의 변이체(예를 들어, 돌연변이체)를 지칭한다. 본 기술은 가상 환경에서 돌연변이화된 서열을 생성하는 단계, 및 후속하여 실험실 환경에서 이들 서 열을 합성하는 단계를 포함한다. 본 개시의 구현예는, 조성물 및 예를 들어 (예를 들어 해당 조성물의 항원 결합 파트너에 대해) 보다 높은 결합 친화도를 부여할 항체 서열의 식별을 위한 모델을 사용하기 위한 방법을 제공한다. 모델은 인공 신경망일 수 있 다. 일 구현예에서, 신경망 아키텍처는 RoBERTa(Liu 등, 2019 arXiv) 및 \"Attention is all you need\"(Vaswani 등, 2017 arXiv)에 기술된 바와 같은 트랜스포머-인코더 모델이다. RoBERTa 아키텍처는 주로 자연 언어 프로세 싱에 사용되는 신경망의 \"트랜스포머\" 계열에 속한다. 당업자는 RoBERTa가 모델 아키텍처(해당 아키텍처는 트랜 스포머 인코더임)만이 아니라 전체 학습 설정을 지칭한다는 것을 이해할 것이다. 미세 아키텍처(예컨대, 숨겨진 계층의 수, 임베딩의 크기 등)는 다수의 대안적인 RoBERTa 구성에 따라 파라미터화될 수 있으며, 실험 결과는 유사한 성능을 나타낸다. 이와 같이, 세분화된 아키텍처는 성능의 주요 인자가 아닐 가능성이 있다. 대안적인 트랜스포머 및 비-트랜스포머 심층 신경망 아키텍처가 유사한 성능을 제공할 수 있다. 대안적인 비-심층-신경망 머신 러닝 알고리즘은 유사하거나 약간 열등한 성능을 제공할 수 있다. 일부 양태에서, 모델의 코어 아키텍처는 RoBERTa 모델이다(예를 들어, Hugging Face 프레임워크 내에서 이의 PyTorch를 구현함(Wolf, T., Debut, L., Sanh, V., Chaumond, J., Delangue, C., Moi, A., Cistac, P., Rault, T., Louf, R., Funtowicz, M. 등의 문헌[Huggingface's transformers: State-of-the-art natural language processing. arXiv preprint arXiv:1910.03771, 2019]). 모델의 트렁크에는 계층당 다수의 어텐션 헤 드(예를 들어, 12개) 및 숨겨진 계층 규모(예를 들어, 768개)를 갖는 다수의 숨겨진 계층(예를 들어, 16개)가 포함될 수 있다. 회귀 작업에는 주어진 크기의 하나 이상의 숨겨진 계층(예를 들어, 768개)이 포함될 수 있으며, 그 뒤에 필요한 수의 출력을 포함하는 프로젝션 계층이 포함될 수 있다. 예를 들어, 모델의 총 크기는 1억 1,400만개 파라미터일 수 있다. 후술하는 바와 같이, 본 기술은 (예를 들어, 관찰된 항체 공간 데이터베이스(Observed Antibody Space database, OAS)를 사용하는) 자체 지도 체제에서 (예를 들어, 면역글로불린 서열에 대해) 먼저 사전 학습되는 결합 친화도 모델을 포함할 수 있다. 면역글로불린 사슬은 생체분자(예를 들어, 항체)가 유래된 종을 암호화하 는 토큰으로 표현될 수 있으며, 이어서, 예를 들어 IMGT(Lefranc, M.-P., Pommiι, C., Ruiz, M., Giudicelli, V., Foulquier, E., Truong, L., Thouvenin-Contet, V., 및 Lefranc, G.의 문헌[Imgt unique numbering for immunoglobulin and t cell receptor variable domains and ig superfamily v-like domains. Developmental & Comparative Immunology, 27:55-77, 2003]) 및 Martin(Abhinandan, K. 및 Martin, A. C.의 문헌[Analysis and improvements to kabat and structurally correct numbering of antibody variable domains. Molecular immunology, 45: 3832-3839, 2008]) 라벨링 방식의 조합을 사용하여 (예를 들어, 이들 사이의 구분 토큰과 함께) 정의된, 상보성 결정 영역(CDR)의 연결이 이어질 수 있다. 예를 들어, 후술하는 바와 같이, 본 기술은 쌍 을 이루지 않은 면역글로불린 사슬 및 배제된 연구(예를 들어, 데이터베이스에 존재하는 다른 연구의 일부인 샘 플, 미성숙 B 세포로부터 기원하는 연구, B 세포 연관 암 등)를 포함하는 데이터(예를 들어, OAS 데이터베이 스)를 수신하는 단계를 포함할 수 있다. 일부 양태에서, 본 기술은 다수의 품질 검사에 실패한 서열을 추가로 필터링하는 단계, 및/또는 원하는 사슬 표현(예를 들어, 연장 CDR 또는 거의 전체)을 추출하는 단계, 및/또는 생성된 서열에 대해 전체 데이터베이스에 걸쳐 중복 삭제하는 단계를 포함할 수 있다. 본 기술은 다음의 표에 도시된 바와 같이, 단일 연구에서 단지 한 번만 관찰된 서열을 필터링하는 단계, 각각의 사전학습 작업을 위한 데이터세트 및 학습 구성을 도시하는 단계를 추가로 포함할 수 있다:"}
{"patent_id": "10-2024-7026560", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "(예를 들어, 기준 항체의 영역 또는 영역들 내의) 서열 변이체를 포함하는 항체 변이체가 본원에 상세히 기술된 다. 서열 변이체는 하나 이상의 돌연변이에 의해 기준/야생형 서열로부터 벗어나는 서열이다. 돌연변이는 종종 CDR에 도입되지만(IMGT, Martin, Kabat, Chothia 등과 같은 임의의 공통 정의에 따라 식별됨), 원칙적으로 프레 임워크에도 도입될 수 있다. 본 기술은 서열을 의도적으로 \"돌연변이화\"하여 이의 서열 변이체를 생성하는 것을 포함한다. 본 개시에 의해 제공된 데이터 및 예측은 Fab를 사용하여 생성되었지만, mAb, scFv, VHH 등뿐만 아니라 중쇄 대 경쇄와 같은 대안적인 스캐폴드에 대해 매우 유사한 모델링 접근법이 가능하다. 본원에 기술된 바와 같이, 일 구현예에서, 모델은 다른 것들 중에서도, 인간, 마우스 및 카멜리드를 포함하는 다수의 종으로부터의 천연 항체 시퀀싱 데이터(예를 들어, 현재 공지되어 있거나 추후 개발되는 임의의 적절한 종과 관련된 임의의 서열 데이터)를 사용하여 먼저 사전학습된다. 일 구현예에서, 사전학습은 마스킹된 언어 모 델 객체화를 사용하여 수행된다: 항체 서열 내의 일부 위치는 무작위로 마스킹되고, 모델은 마스킹된 위치에 존 재하는 아미노산을 예측하는 작업을 수행한다(분류 작업). 이를 통해, 모델은 항체 서열을 지배하는 \"규칙 (grammar)\"에 대한 이해를 얻게 되며(즉, \"자연도\" 및/또는 \"인간도(humanness)\"에 대한 이해를 얻음), 이는 해 당 모델에 대한 친화도 데이터를 사용하는 미세 조정을 보다 효율적으로 만든다. 사전학습은 라벨링된 데이터를 필요로 하지 않으며: 항원 특이성 또는 다른 특성에 대한 정보 없이 항체 서열만을 필요로 한다. 요구 사항은 이들 서열이 단지 천연 서열이어야 한다는 것 뿐이다. 이들 서열은 University of Oxford's Oxford Protein Informatics Group(OPIG)에 의해 공개된 데이터베이스인, 관찰된 항체 공간(Observed Antibody Space, OAS))으 로부터 유래하였다. OAS는 신규 서열에 기여하지 않으며, 이는 다수의 간행물로부터의 데이터를 집계한다. 그러 나, 이는 통합 파이프라인을 사용하여 이러한 서로 다른 소스의 원시 데이터에 재주석을 추가한다(Kovaltsuk 등의 문헌[J Immunol, 2018, 201 2502-2509]). OAS 재주석은 편리하지만, 모델링 성능의 주요 인자는 아닐 수 있다. 유사하게, 다수의 연구로부터의 데이터 집계는 편리하지만, 모델링 성능에 필수적인 단일 연구는 존재 하지 않을 것이다. 본 개시는, 일부 구현예에서, 독점 친화도 데이터가 제한될 경우 사전학습이 친화도 예측을 개선한다는 것을 제 공한다. 독점적인 친화도 데이터세트의 크기가 증가함에 따라, 사전학습의 이점은 감소한다. 이와 같이, 사전학 습은, 일 구현예에서는 선택적인 것으로 구분되지만, \"낮은 N\" 설정(즉, 작은 친화도 데이터세트)에서는 여전히 이점을 제공하는 것으로 강조된다. 이러한 개념은 단백질 조작에서 양호하게 확립되어 있다(Biswas, S., Khimulya, G., Alley, E.C. 등의 문헌[Low-N protein engineering with data-efficient deep learning. Nat Methods 18, 389-396 ]. https://doi.org/10.1038/s41592-21-01100-y); 그러나, 항체에 특화된 입증은 현재까지 이루어지지 않았다. 단백질에 대해 개발된 모든 머신 러닝 방법이 항체에 대해 작용하는 것은 아니기 때문에, 일반적인 단백질 조작과 항체 조작 간의 구별이 중요하다. 예로서, AlphaFold2는 단백질 복합체를 예측 할 수 있지만, 항체-항원 상호작용을 예측할 수는 없다. (Evans, R. 등의 문헌[bioRxiv 2021.10.4.463034]). 또한, 일부 구현예에서, 사전학습은, 낮은 N 설정과 관련되지 않은 이유로, 예컨대 (다른 것들 중에서도) 돌연 변이 부담이 보다 낮은 변이체로부터의 학습 데이터를 사용하여 돌연변이 부담이 높은 변이체에 대한 예측을 수 행할 수 있다는 장점을 갖는다. 사전학습(또는, 사전학습이 수행되지 않는 구현예에서의 무작위 초기화) 후, 모델은 일차 스크리닝을 포함하는 워크플로우를 사용하여 생성된 친화도 데이터를 사용하여, 예를 들어 고 처리량, 정량적, 활성 기반 방법 (WO/2021/146626) 및 Carterra LSA SPR(고 정확도)(carterra-bio.com/lsa/)을 이용한 표적화된 재스크리닝을 사용하여 학습(즉, 미세 조정)될 수 있다. 다른 구현예에서, 또 다른 디스플레이 기술(예를 들어, 효모 디스플 레이, mRNA 디스플레이, 파지 디스플레이, 리보솜 디스플레이 등)이 심층 돌연변이 스캐닝(DMS) 환경에서 사용 된다(Kyrin, R. 등의 문헌[Trends in Pharmacological Sciences, 2021, ISSN 0165-6147]). 또 다른 구현예에서, Carterra LSA SPR은 저 처리량/전통적 SPR, BLI 또는 유사한 기술로 대체될 수 있다. 데이터 수집 은 처리량(일차 스크리닝) 및 정확도(이차 재스크리닝)를 최대화하기 위한 2개의 단계로 본원에 설명되지만, 일 부 구현예에서, 본 개시는 학습 데이터를 생성하기 위한 2개의 단계 중 하나를 제공한다. 친화도 데이터는 항원 특이적이기 때문에, 모델 또한 항원 특이적이다. 새로운 항체/항원 쌍의 경우, 사전학습은 반복되지 않지만, 친 화도 데이터 수집 및 모델 미세 조정은 반복된다. 모델 사전학습 및 미세 조정 시, 모델은 보지 못했던 서열 변이체에 대해 친화도를 예측할 수 있다. 낮은 조합 공간(예를 들어, 2개의 CDR에서의 삼중 돌연변이체)의 경우, 서열 조합의 수는 모든 가능한 서열 변이체의 친화 도를 완전 예측으로 처리할 수 있을 만큼 충분히 작다. 고도로 조합된 공간의 경우, 서열 조합의 수는 너무 크기 때문에 완전 연산으로 예측될 수 없다. 이 경우, 본 개시에서 제공되는 바와 같은 두 가지 해결책이 가능하다: 플러그 앤 플레이 언어 모델(Dathathri et al., , arXiv:1912.02164 [cs.CL])을 사용하는 예측 모델의 생성 모델로의 전환 (그러나 여러 다른 생성 전략이 공개 됨(예를 들어, Zachary Wu, Kadina E. Johnston, Frances H. Arnold, Kevin K. Yang의 문헌[Protein sequence design with deep generative models, Current Opinion in Chemical Biology, Volume 65, 2021, Pages 18-27, ISSN 1367-5931], https://doi.org/10.1016/j.cbpa.2021.4.004. (https://www.sciencedirect. com/science/article/pii/S136759312100051X)) 참조). 유전자 알고리즘 등과 같은 보다 전통적인 최적화 기술과 모델 예측의 결합. 당업자는 또 다른 방법을 이용할 수 있다(예를 들어, \"Controllable Neural Text Generation,\" https://lilianweng.github.io/lil-log/2021/01/02/controllable-neural-text-generation.html (1/7/2022 검색됨) 참조). 본 개시에 의해 제공되는 방법 및 모델은 다수의 목적을 위해 사용될 수 있다. 일 구현예에서, 본 개시에 의해 제공된 방법 및 모델은 상업적 항체를 포함하는, 약하게 결합하는 항체의 친화도 성숙을 위해 사용된다. 이러한 항체는 동물 유래 항체의 인간화, 라이브러리 스크리닝으로부터의 신규 히트, 불량한 표적 면역원성(예를 들어, 포유류 항원), 또는 다른 이유로 인한 약한 결합제일 수 있다. 일 구현예에서, 본 개시에 의해 제공된 방법 및 모델은 2개 이상의 항원에 대한 동시 친화도 성숙을 위해 사용 된다. 이러한 항원은 상이한 종에 속하는 상동성 단백질일 수 있으며, 종종 하나는 인간이고 다른 하나(들)는 비인간 종, 예를 들어 시노몰구스 원숭이이다. 상이한 종으로부터의 동일한 항원에 결합하도록 항체를 조작하는 것은 개발 중 생체 내 시험을 가능하게 한다. 대안적으로, 항원은 동일한 단백질의 변이체일 수 있다. 이의 일 례는 특정 변이체가 항체 결합을 탈출하여 치료 효능을 제거할 수 있는 감염성 질환이다. 비-탈출 변이체에 대한 친화도를 손상시키지 않으면서 탈출 변이체에 대한 친화도를 복원하는 것은 광범위한 중화 활성을 갖는 항체 를 부여하는 데 있어서 중요하다. 대안적으로, 항원은 동일한 계열의 구별되는 구성원일 수 있다. 이는, 치료 효능의 증가로 인해, 또는 단일 구성원의 결합/차단이 효과적이지 않게 되는 계열 구성원 전체에 걸친 기능적 중복으로 인해, 동일한 계열의 여러 구성원이 결합 또는 중화되어야 하는 경우 유용하다. 다른 구현예에서, 본 개시에 의해 제공되는 방법 및 모델은 상이한 조건 하에서의 동일한 항원에 대한 친화도 성숙을 위해 사용된다. 예를 들어, 이러한 조건은 pH를 변경시키는 것을 포함할 수 있으며, 이는 상이한 미세환 경에서 변경될 수 있으며, 이에 따라 결합에 영향을 미칠 수 있다. 친화도 성숙에 대해서는 결합 친화도를 가능한 한 많이 높이는 것에 데에 중점을 두는 경우가 많지만, 본원에 기술된 모델 및 방법은 정량적 예측을 수행함으로써, 예를 들어, (i) 친화도를 증가시키지 않고 감소시킬 수 있 게 하고; (ii) 예를 들어 생체내에서 항체의 제거를 촉진하고/하거나 부작용이 존재할 때 표적 항원의 결합 또 는 차단을 제한하기 위해, 친화도가 정의된 하한 및 상한 내에 있도록 이를 조작할 수 있게 하고; (iii) 다중 항원 친화도 성숙을 수행할 때 목표가 반드시 모든 항원에 대한 향상이 아닐 수도 있게 한다 - 즉, 하나 이상의 다른 항원(들)에 대한 친화도를 감소/폐기시키면서 하나 이상의 항원(들)에 대한 친화도를 증가시키는 것이 바 람직할 수 있다(예를 들어, 이는 치료 효과를 제공하는 항원을 결합/차단할 때 유리할 수 있지만, 관련 항원의 결합/차단은 독성을 유발할 수 있음. 마찬가지로, 관련되지만 바람직하지 않은 항원에 대한 비특이적 결합을 감 소/폐기시키면서 특정 표적에 대한 친화도를 향상시킬 수 있음). 항원에 대한 항체의 친화도 성숙에 중점을 두는 동시에, 일부 구현예에서, 동일한 전략이 임의의 단백질-단백질 상호작용에 적용될 수 있다. 이에 대해, 2개의 상호작용제의 성질에 따라, OAS를 대신하여, 또는 이에 추가하여, Uniref90과 같은 단백질 데이터베이스를 사용하여 모델 사전 학습을 수행하는 것이 도움이 될 수 있 다. 예를 들어, 사이토카인 서열은 수용체에 대한 결합 친화도를 증가/감소시키도록 조작될 수 있다. 유사하게, 차세대 항체 스캐폴드뿐만 아니라 항체 모방 스캐폴드(예컨대 DARPins) 또한 조작될 수 있다. 또 다른 구현예에 서, 항체의 Fc 영역은 항원에 대한 가변 영역 친화도에 대해 본원에 기술된 동일한 전략을 사용하여, 특이적 Fc 수용체에 대한 결합을 증가/감소시키도록 조작될 수 있다. 다른 양태에서, 모델은 조합된 형태로 또는 순차적으 로 OAS 및 Uniref90과 같은 다수의 데이터베이스에 대해 사전학습될 수 있다. 일 구현예에서, 모델은 최적화되는 쌍별 상호작용에 특이적인 학습 데이터(즉, 단일 항원에 대한 항체 서열 변 이체의 친화도 데이터)를 필요로 한다. 신규 쌍별 관심 상호작용은 해당 상호작용에 특이적인 새로운 학습 데이 터세트를 필요로 할 것이다. 그러나, 모델 아키텍처, 모델 사전학습 및 워크플로우(데이터 생성부터 모델 예측 까지의 모든 과정)는 동일하게 유지된다. 본원에 기술된 바와 같은 일 구현예에서, 모델은 최적화된 쌍별 상호 작용에 대해 특이적인 학습 데이터(즉, 단일 항원에 대한 항체 서열 변이체의 친화도 데이터)와 함께 사용되지 만, 다음의 구현예 또한 제공된다: (a) 항원(항체가 아님)이 돌연변이되는 한편, 항체(항원은 아님)는 고정됨. 이는, 예를 들어, 어떤 항원 변이체가 항체로부터 탈출할 가능성이 있는지 예측하는 데 유용함; (b) (항체뿐만 아니라) 항체 및 항원 둘 모두가 동시에 돌연변이화되는 라이브러리-온-라이브러리 스크리닝 및 학습. 이는, 예 를 들어, 사전 결정된/고정된 변이체 세트를 스크리닝할 필요 없이 항원 변이체(예를 들어, 감염성 질환의 탈출 변이체)에 대한 항체를 조작할 때 유용함. 이는 또한 파라토프/에피토프 잔기에 대한 통찰력이 필요한 경우 유 용함; (c) 더 이상 기준 서열의 변이체(즉, 하나 또는 몇 개의 돌연변이 제거)가 아닌, 선택된 항체 스캐폴드 내의 무작위 CDR(들) 서열(들) 라이브러리인 항체 서열의 라이브러리. 이는 모델이 동일한 항원에 대한 다수의 무관한 결합제에 대해 학습할 수 있게 함. 구별되는 결합제는 구별되는 항원 부위/에피토프를 표적화할 수 있음; (d) 더 이상 기준 서열의 변이체가 아닌, 선형 또는 입체적/순환형으로 무작위화된 펩티드인 항원 라이브 러리. 이는 모델이 항체 서열에 결합하는 모티프(선형 또는 3D)에 대해 학습할 수 있게 할 수 있음; (e) 모델이 임의의 항체 서열과 (펩티드 라이브러리에 의해 포획된) 임의의 구조적 모티프 사이의 거의 보편적인 관계를 학 습할 수 있게 할 수 있는, 이전 2개의 포인트의 (라이브러리-온-라이브러리) 조합. 이는 궁극적으로 구조적 모 티프의 알파벳의 관점에서 에피토프의 선택을 특정하고, 이어서 해당 구조적 모티프에 대해 친화도를 갖는 서열 을 생성하도록 모델을 요청할 때, 신규 가상 환경 항체 설계를 가능하게 할 수 있음. 본 개시의 일 구현예에서, 친화도는 KD(또는 KD의 단일 수 대리체/상관체)로서 수치적으로 부여된다. KD는 결합 및 해리 상수(Ka 및 Kd)로부터 도출되며, 동일한 KD는 Ka 및 Kd의 상이한 조합으로부터 도출될 수 있기 때문에, 모델은 KD보다는 Ka 및 Kd를 예측하는 것으로 수행될 수 있다. 이는 전체 친화도와 대조적으로, 특이적 결합/해 리 속도가 요구되는 경우에 유용하다.일 구현예에서는 항원 친화도에 중점을 두지만, 본원에 제공된 모델은 서열을 수치적 특징으로 맵핑한다. 이와 같이, 충분한 학습 데이터가 확보된 경우, (천연 항체 서열을 이용한 사전학습을 포함하는) 동일한 모델링 전략 을 사용하여 임의의 정량적 결과를 예측할 수 있다. 항체의 다른 수치적 특성을 예측하기 위해 모델을 전개하는 결정은, 불변적인 모델링 전략에 의존하지 않고, 미세 조정 단계에 필요한 충분한 데이터를 생성하기에 충분한 분석 처리량에 의존한다. 친화도와 달리, 항체의 대부분의 다른 특성은 주어진 항원에 특이적이지 않지만, 배타 적으로 항체의 서열에 의존한다는 점에 주목하는 것이 중요하다. 이러한 경우는, 예를 들어 용해도, 점도 등과 같은 항체의 생물물리학적/개발가능성 특성에 해당한다. 한편, 이는, 임의의 2개의 프로젝트가 상이한 항체/항 원에 관한 것일지라도, 하나의 프로젝트를 위해 획득된 학습 데이터가, 다른 하나의 프로젝트를 위해 획득된 학 습 데이터와 통합될 수 있음을 의미한다. 한편, 이는 일반화 가능한 예측이 단지 몇몇 기준/야생형 서열 주변의 국부적 변이보다 더 큰 서열 변이를 포괄하는 학습 데이터를 필요로 한다는 것을 의미한다. 본원에서 사용되는 바와 같이, 용어 \"개발가능성\"은 분자의 물리화학적 특성의 평가를 통해 발견으로부터 개발 로 성공적으로 진행될 수 있는 해당 분자의 가능성을 지칭한다. 용어 \"개발가능성\"은 원하는 표적 분자에 결합 하는 분자(예를 들어, 항체)의 능력 및 다른 고려 사항(예를 들어, 제조 가능성, 보관 안정성, 및 표적 외 점착 성의 부재)에 관한 개념을 포함할 수도 있다. 본원에서 사용되는 바와 같이, \"결합 파트너\"는 또 다른 분자가 이와 함께 물리적 상호작용을 형성하는 분자를 지칭한다. 예를 들어, 항체의 결합 파트너는 이의 항원이다. 본 원에서 사용되는 바와 같이, 용어 \"결합 특성\"은 결합 친화도를 측정하는 메트릭인 평형 해리 상수(KD), 해리 상수(Kd) 및 결합 상수(Ka)를 포함하지만 이에 한정되지 않는다. KD는, 시스템 평형 상태에서 단백질 상의 리간 드 결합 부위의 절반이 점유될 때의 해당 리간드의 농도로 정의될 수 있다. 이는 주어진 단백질 및 리간드 쌍에 대해 동일한 것을 나타내는 속도 상수(Koff)를 단백질 리간드 복합체가 형성되는 동안 순반응이 일어나는 속도 (Kon)로 나눔으로써 계산될 수 있다. 본 기술의 생물물리학/개발가능성 특성은 종래의 기술 대비 상당히 유리한 개선을 나타낸다. 특히, 본 기술, 특 히 모델 사전학습 및/또는 모델 미세 조정을 사용하는 본 기술의 양태에서의 데이터의 신중한 사전 프로세싱 및 준비는 무작위 모델 초기화에 기초한 종래의 방법 대비 상당한 개선을 가져온다. 구체적으로, 본 모델링 기술에 의해 생성된 서열은 본질적으로 보다 양호한 개발가능성을 가지며, 그 이유는, 인간 내에 실제로 존재하는 항체 에 대해 학습되는, 천연 면역 레퍼토리에 의한 정보를 모델이 제공하기 때문이다. 따라서, 모델링의 결과는 무 작위화된 접근법에 기초한 임의의 결과보다 더 양호하며 보다 높은 개발가능성을 갖는다. 당업자는 인간 또는 다른 동물에서 발견되지 않은 서열과 관련되고, 따라서 개발될 수 없는 고친화도 생체분자 를 찾는다는 것이, 비록 가능할지라도, 이에 대한 가능성은 매우 낮다는 것을 이해할 것이다. 서열 식별은 다중 변수를 갖는 문제이며, 여기에서 친화도 결합은 단 하나의 변수이다. 개발가능성 문제(불량한 용해도, 과도한 점도, 인간 면역원성 등)를 내재하는 고친화도 항체를 찾는 것은 본 기술을 통해 극복될 수 있는 주요 연구 및 개발 과제이다. 이들 장애물은 파지 디스플레이 기술이 사용될 경우 특히 일반적으로 나타난다. 또한, 본 모델링 기술은 \"인간도\"(즉, 인간에서 발견되는 것과 보다 유사하고, 따라서 개발가능성이 보다 높은 서열)에 대해 편향될 수 있지만, 이는 본 기술이 비천연적으로 보이는 서열을 출력할 수 없다는 것을 의미하는 것은 아니다. 실제로, 일부 경우, 비천연 생체분자의 친화도 강도는 사전학습 데이터로부터 기인하는 비자연도 에 대한 페널티를 간과할 수 있다. 본 기술은 고도로 민감하므로, 실제로 결합 검정 동안 생성된 실험 오차/노이즈는 일부 범위에서의 모델링 출력 에 영향을 미칠 수 있다. 예를 들어, 예측 범위(예를 들어, .1 피코몰 내지 .2 피코몰)를 고려 시, 검정 동안 발생한 실험 오류로 인해 학습된 모델의 순차적 실험 실행은 상이한 순서를 갖는 결과를 생성할 수 있다(예를 들어, 상위 2개의 친화도 변이체가 전치될 수 있음). 어떤 경우에는 이로 인해 친화도에 따른 변이체의 상대적 순위을 정하는 것을 방해할 수 있다. 그러나, 본원에서 논의된 바와 같이, 본 기술은 여전히 이진 분류로 제한 되는 종래의 기술에 비해 유의한 유리한 개선을 나타내는 한편, 본 기술은 정량적이고 대체적으로 크기의 차수 에 걸친 수학적 연산(예를 들어, 순위 지정, 분류, 평균화, 제한 등)을 가능하게 한다. 다음의 참조 문헌은 단백질 조작 및 모델링의 다양한 양태를 기술한다: 머신 러닝을 사용하는 단백질 조작 (Biswas 등; 및 Evans 등); 머신 러닝을 사용하는 항체 친화도 조작(Mason 등, 및 Hanning 등의 문헌[Trends Pharm Sciences, 2021, doi.org/10.1016/j.tips.2021.11.10]; 생성적 NLP 모델(Dathathri 등); 항체 시퀀싱 데 이터(Kovaltsuk 등); 모델 아키텍처(Liu 등, 2019 arXiv, arXiv:1907.11692); 및 머신 러닝 가이드 폴리펩티드 설계(WO2021026037A1 및 WO2020167667A1).본 가상 환경 스크리닝 양태는, 매우 높은 처리량 및 다중 객체화 최적화를 포함하여, 습식 실험실 분석 대비 다수의 주요 이점을 제공한다. 본 기술은 딥 러닝 모델이 KD의 여러 단위(예를 들어, 10,000 단위)에 걸친 결합 친화도를 정확하게 예측하는 능력을 입증하며, 해당 모델이 다양한 개발가능성 측정의 강력한 척도를 제공하는, 서열 자연도에 대한 암시적인 이해를 포함할 수 있다는 것을 입증한다. 본 기술은 치료 적용을 위한 향상된 가 상 환경 항체 설계를 위한 유익한 실용적 단계를 제시한다. 예시적인 컴퓨터 구현 머신 러닝 학습 및 작동 도 1 은 일부 양태에 따른, 하나 이상의 머신 러닝(ML) 모델을 학습 및/또는 작동시키기 위한 예시적인 컴퓨팅 환경을 도시한다. 환경은 클라이언트 컴퓨팅 장치, 분자 모델링 서버, 분석 장치 및 전자 네트워크를 포함한다. 일부 구현예는 복수의 클라이언트 장치, 복수의 분자 모델링 서버, 및/또는 복수의 분석 장치를 포함할 수 있다. 일반적으로, 하나 이상의 분자 모델링 서버는 본원에 기술된 바와 같이 전체 또는 부분 가상 환경 분자 모델링의 학습 및 작동을 수행하도록 작동한다. 클라이언트 컴퓨팅 장치는 개별 서버, 다수의 서버의 그룹(예를 들어, 클러스터), 또는 다른 적합한 유형 의 컴퓨팅 장치 또는 시스템(예를 들어, 컴퓨팅 자원의 집합)일 수 있다. 예를 들어, 클라이언트 컴퓨팅 장치 는 임의의 적합한 컴퓨팅 장치(예를 들어, 서버, 모바일 컴퓨팅 장치, 스마트폰, 태블릿, 랩톱, 웨어러블 장치 등)일 수 있다. 일부 구현예에서, 클라이언트 장치의 하나 이상의 구성 요소는 하나 이상의 가상 인 스턴스(예를 들어, 클라우드 기반 가상화 서비스)에 의해 구현될 수 있고/있거나 각각의 원격 데이터 센터(예를 들어, 클라우드 컴퓨팅 환경, 공개 클라우드, 사설 클라우드, 하이브리드 클라우드 등)에 포함될 수 있다. 클라 이언트 컴퓨팅 장치는 프로세서 및 네트워크 인터페이스 컨트롤러(NIC)를 포함한다. 프로세서는 임의의 적 절한 수의 프로세서 및/또는 프로세서 유형, 예컨대 CPU 및 하나 이상의 그래픽 프로세싱 유닛(GPU)을 포함할 수 있다. 일반적으로, 프로세서는 메모리에 저장된 소프트웨어 명령어를 실행하도록 구성된다. 메모리는 하나 이상의 영구 메모리(예를 들어, 하드 드라이브/솔리드 스테이트 메모리)를 포함할 수 있으며, 하나 이상의 컴퓨 터 실행가능 명령어/모듈 세트를 저장할 수 있다. 예를 들어, 실행가능 명령어는 서버에 의해 생성된 결과 를 수신 및/또는 디스플레이할 수 있다. 클라이언트 컴퓨팅 장치는 각각의 입력 장치 및 각각의 출력 장치를 포함할 수 있다. 각각의 입력 장치는 하나 이상의 마이크로폰, 하나 이상의 카메라, 하드웨어 키보드, 하드웨어 마우스, 정전식 터치 스크린 등과 같 은, 입력을 수신하기 위한 임의의 적합한 장치 또는 장치들을 포함할 수 있다. 각각의 출력 장치는 하드웨어 스 피커, 컴퓨터 모니터, 터치 스크린 등과 같은, 출력을 전달하기 위한 임의의 적합한 장치를 포함할 수 있다. 일 부 경우, 입력 장치 및 출력 장치는 사용자 입력을 수신하고 출력을 디스플레이하는 터치 스크린 장치와 같은 단일 장치에 통합될 수 있다. 클라이언트 컴퓨팅 장치의 NIC는 유선/무선 컨트롤러(예를 들어, 이더넷 컨트롤러)와 같은 임의의 적절한 네트워크 인터페이스 컨트롤러(들)를 포함할 수 있으며, 클라이언트 컴퓨팅 장 치와 환경의 다른 구성 요소 사이의 네트워크를 통해 양방향/다중 네트워킹을 용이하게 할 수 있다. 분자 모델링 서버는 프로세서, 네트워크 인터페이스 컨트롤러(NIC) 및 메모리를 포함한다. 분자 모델링 서버는 데이터 저장소를 추가로 포함할 수 있다. 데이터 저장소는 구조화된 쿼리 언어(SQL) 데이터베이스(예를 들어, MySQL 데이터베이스, Oracle 데이터베이스 등) 또는 다른 유형의 데이터베 이스(예를 들어, 낫 온리 SQL(not only SQL, NoSQL) 데이터베이스)일 수 있다. 일부 양태에서, 데이터 저장소 는 파일 시스템(예를 들어, EXT 파일시스템, Apple 파일 시스템(APFS), 네트워크 파일시스템(NFS), 로컬 파일시스템 등), 오브젝트 스토어(예를 들어, Amazon Web Services S3), 데이터 레이크 등을 포함할 수 있다. 데이터 저장소는 공개 데이터 소스(예를 들어, OAS 데이터) 및 미세 조정 데이터로부터 소싱되는 사전학습 데이터와 같은 복수의 데이터 유형을 포함할 수 있다. 미세 조정 데이터는 정량적 검정 ACE, Carterra, 또는 임 의의 다른 적절한 소스로부터 소싱되는 독점적 친화도 데이터일 수 있다. 서버는 데이터 저장소에 액세스하기 위한 클라이언트 바인딩 라이브러리를 포함할 수 있다. 일부 구 현예에서, 데이터 저장소는 분자 모델링 서버로부터 원격으로 위치된다. 예를 들어, 데이터 저장소 는, 일부 양태에서, RESTdb.IO 데이터베이스, Amazon Relational Database Service(RDS) 등을 사용하여 구현될 수 있다. 일부 양태에서, 분자 모델링 서버는 전자 요청을 수신하고 이에 응답하는 클라이언트-서 버 플랫폼 기술, 예컨대 Python, PHP, ASP.NET, Java J2EE, Ruby on Rails, Node.js, 웹 서비스 또는 온라인 API를 포함할 수 있다. 또한, 분자 모델링 서버는, 후술하는 바와 같은, 클라이언트-서버 플랫폼 기술과 통합될 수 있는 머신 러닝 작동을 수행하기 위한 명령어 세트를 포함할 수 있다.분석 장치는 표면 플라스몬 공진(SPR) 머신, 예를 들어 Carterra SPR 머신일 수 있다. 장치는 도시된 바와 같이 분자 모델링 서버 또는 데이터 저장소에 물리적으로 연결될 수 있다. 장치는 실험실 에 위치될 수 있고, 실험실 내의 하나 이상의 컴퓨터(미도시) 및/또는 분자 모델링 서버로부터 접근 가능 할 수 있다. 장치는 데이터를 생성하고, 직접적으로 및/또는 실험실 컴퓨터(들)를 통해 데이터 저장소 에 데이터를 업로드할 수 있다. 분석 장치는 하나 이상의 서열(예를 들어, 돌연변이 서열)의 수신 및 이들 서열에 대한 합성을 위한 명령어를 포함할 수 있다. 합성은 때때로 다른 기술을 통해(예를 들어, 상이한 장치를 통해 또는 인간을 통해) 수행될 수 있다. 일부 양태에서, 장치는 장치로서가 아니라, 본 출원의 다 른 섹션에 열거된 단백질-단백질 상호작용을 측정할 수 있는 대안적인 검정으로 구성될 수 있다. 예를 들어, 장 치는 플레이트 및 액체 취급을 포함하는, 일련의 장치/워크플로우의 세트로서 구성될 수 있다. 일반적으로, 장치는 친화도 데이터를 생성하기 위해 인간 운영자를 선택적으로 포함하는, 적절한 하드웨어 및/또는 소프트웨어로 대체될 수 있다. 네트워크는 단일 통신 네트워크일 수 있거나, 하나 이상의 유형의 다중 통신 네트워크(예를 들어, 하나 이 상의 유선 및/또는 무선 근거리 네트워크(LAN), 및/또는 인터넷과 같은 하나 이상의 유선 및/또는 무선 광역 네 트워크(WAN))를 포함할 수 있다. 네트워크는, 예를 들어 클라이언트 컴퓨팅 장치와 분자 모델링 서버 사이의 양방향 통신을 가능하게 할 수 있다. 프로세서는 임의의 적절한 수의 프로세서 및/또는 프로세서 유형, 예컨대 CPU 및 하나 이상의 그래픽 프로 세싱 유닛(GPU)을 포함할 수 있다. 일반적으로, 프로세서는 메모리에 저장된 소프트웨어 명령어를 실 행하도록 구성된다. 메모리는 하나 이상의 영구 메모리(예를 들어, 하드 드라이브/솔리드 스테이트 메모리)를 포함할 수 있고, 입력/출력(I/O) 모듈, 변이체 모듈, 분석 모듈, 시퀀싱 모듈, 머신 러닝 학습 모듈, 머신 러닝 작동 모듈; 및 변이체 식별 모듈을 포함하는, 하나 이상의 컴 퓨터 실행가능 명령어/모듈 세트를 저장할 수 있다. 각각의 모듈은 이하에서 추가로 설명되는 바와 같이, 본 기술에 관한 특정 기능을 구현한다. 모듈은 하나 이상의 애플리케이션(들), 하나 이상의 소프트웨어 구성요소(들), 및/또는 하나 이상의 API를 포함하는 머 신 판독가능 명령어를 저장할 수 있으며, 이는 본원의 다양한 흐름도, 예시, 다이어그램, 도면, 및/또는 다른 개시 내용에 대해 예시, 도시 또는 기술된 바와 같은, 본원에 기술된 특징부, 기능 또는 다른 개시 내용, 예컨 대 임의의 방법, 프로세스, 요소 또는 제한을 용이하게 하거나 수행하도록 구현될 수 있다. 일부 구현예에서, 복수의 모듈은 특정 기술의 구현에서 함께 작용할 수 있다. 예를 들어, 머신 러닝 작동 모듈은 추론 작동을 개시하기 전, 도중 및/또는 후에 하나 이상의 다른 모델로부터의 정보를 로딩할 수 있다. 따라서, 모듈 은 적절한 기술을 통해, 예를 들어 프로세스 간 통신(IPC), REST(Representational State Transfer) API 등을 통해, 단일 컴퓨팅 장치, 예컨대 분자 모델링 서버 내의 데이터를 교환할 수 있다. 일부 구현예에서, 하나 이상의 모듈은 복수의 컴퓨팅 장치(예를 들어, 복수의 서버)에서 구현될 수 있다. 모듈은 네트워크, 예컨대 네트워크를 통해 복수의 컴퓨팅 장치 사이에서 데이터를 교환할 수 있다. 이제 도 1의 모듈이 더욱 상세히 설명된다. 일반적으로, I/O 모듈은 사용자(예를 들어, 회사의 직원)가 (예를 들어, 클라이언트 컴퓨팅 장치를 통해) 분자 모델링 서버에 액세스하고 이를 작동시킬 수 있게 하는 명령어를 포함한다. 예를 들어, 해당 직원은, 항체 모델링 프로젝트에 사용된 출력을 생성하기 위해, 하나 이상의 학습된 ML 모델을 사용하기 위한 준비로서 ML 학습 모듈을 사용하여 하나 이상의 ML 모델을 학습시키는 소프트웨어 개발자일 수 있다. 하나 이상의 ML 모델이 학습되면, 동일한 사용자(또는 다른 사용자)가 I/O 모듈을 통해 분자 모델링 서버에 액 세스하여 분자 모델링 프로세스를 개시할 수 있다. I/O 모듈은 데이터 저장소에 저장된 목록으로부터 특정 기준 단백질, 생체분자, 결합 파트너 등의 사용자 선택과 같은 생체분자 모델링과 관련된 파라미터를 수집 하고 저장하는 하나 이상의 그래픽 사용자 인터페이스(GUI)(미도시)를 생성하기 위한 명령어를 포함할 수 있다. 변이체 모듈은 하나 이상의 기준 생체분자에 기초하여 하나 이상의 돌연변이된 서열 변이체를 생성하기 위 한 컴퓨터 실행가능 명령어를 포함할 수 있다. 예를 들어, 사용자는 I/O 모듈을 사용하여 변이체 모듈 를 파라미터화함으로써 기준 생체분자 돌연변이가 수행되는 방식을 선택적으로 변경시킬 수 있으며, 사용 자는 돌연변이를 반복적으로 수행할 수 있으며, 변이체 모듈은 돌연변이 저장 명령어 세트를 사용하여 이 들 돌연변이 각각을 데이터 저장소에 저장할 수 있다. 따라서, 사용자는 I/O 모듈을 통해, 이전에 실 행된 파라미터화된 돌연변이된 서열 변이체를 검색하거나, 해당 돌연변이의 결과를 로딩할 수 있다. 분석 모듈은 (예를 들어, 저장될 때 메모리를 통해 및/또는 데이터 저장소을 통해) 하나 이상의 합성된 돌연변이된 변이체를 검색/수신하고 분석 머신를 제어하기 위한 컴퓨터 실행가능 명령어를 포함할 수 있다. 예를 들어, 분석 모듈은 분석 머신으로 하여금 합성된 돌연변이된 변이체를 분석하게 하기 위한 명령어를 포함할 수 있다. 도 2에 나타낸 바와 같이, 분석 모듈은 측정된 결합 친화도를 결정하기 위해, 결합 동역학을 결정하고 차세대 시퀀싱을 수행하기 위한 명령어를 포함할 수 있다. 분석 모듈은 하나 이상 의 돌연변이된 변이체와 연관된 데이터 저장소에 결정된 측정된 결합 친화도를 저장할 수 있으며, 이에 따 라 또 다른 모듈/프로세스(예를 들어, 시퀀싱 모듈)은, 이의 측정된 결합 친화도 및 다른 관련 데이터와 함께 변이체를 검색할 수 있다. 시퀀싱 모듈은 일부 양태에서, 유전자 서열을 조작하고 분석 모듈 및 분석 머신의 작동에 의해 생성된 데이터를 변환하기 위한 컴퓨터 실행가능 명령어를 포함할 수 있다. 시퀀싱 모듈은, 예를 들어 전 자 데이터 저장소의 별도의 데이터베이스 테이블에 변환된 검정 데이터를 저장할 수 있다. 시퀀싱 모듈 은 또한, 일부 경우, OAS와 같은 제3자 데이터 소스에 액세스하기 위한 소프트웨어 라이브러리를 포함할 수 있다. 예시적인 컴퓨터 구현 머신 러닝 모델 학습 및 모델 작동 일반적으로, 컴퓨터 프로그램 또는 컴퓨터 기반 제품, 애플리케이션 또는 코드(예를 들어, 모델(들), 예컨대 머 신 러닝 모델, 또는 본원에 기술된 다른 컴퓨팅 명령어)는, 해당 컴퓨터 판독가능 프로그램 코드 또는 컴퓨터 명령어가 내장된, 컴퓨터 사용가능 저장 매체 또는 유형의 비일시적 컴퓨터 판독가능 매체(예를 들어, 표준 랜 덤 액세스 메모리(RAM), 광 디스크, 범용 직렬 버스(USB) 드라이브, 또는 이와 유사한 것)에 저장될 수 있으며, 여기에서 컴퓨터 판독가능 프로그램 코드 또는 컴퓨터 명령어는 (예를 들어, 메모리의 각각의 운영 시스템 에 연결되어 작동하는) 프로세서(들)에 의해 실행되도록 설치되거나 그렇지 않으면 구성됨으로써, 본원의 다양한 흐름도, 예시, 다이어그램, 도면 및/또는 다른 개시 내용에 대해 예시, 도시 또는 기술된 바와 같이, 머 신 판독가능 명령어, 방법, 프로세스, 요소 또는 제한을 용이하게 하거나 구현하거나 수행할 수 있다. 이와 관 련하여, 프로그램 코드는 임의의 원하는 프로그램 언어로 구현될 수 있으며, 머신 코드, 어셈블리 코드, 바이트 코드, 해석가능 소스 코드 등으로서 (예를 들어, Golang, Python, C, C++, C#, Objective-C, Java, Scala, ActionScript, JavaScript, HTML, CSS, XML, 등을 통해) 구현될 수 있다. 일부 양태에서, 컴퓨팅 모듈은 머신 러닝 학습, 구성, 파라미터화 및/또는 저장 기능을 구현하는 컴퓨터 실행가능 명령어 세트를 포함하는 ML 모델 학습 모듈을 포함할 수 있다. ML 모델 학습 모듈은 본원에 서 논의된 바와 같이, 하나 이상의 ML 모델을 초기화, 학습 및/또는 저장할 수 있다. 학습된 ML 모델 및 이들의 가중치/파라미터는, 분자 모델링 서버에 접근 가능하거나 그렇지 않으면 이에 통신 가능하게 커플링된, 데 이터 저장소에 저장될 수 있다. 예를 들어, ML 학습 모듈은 하나 이상의 ML 모델(예를 들어, 인공 신경망(ANN))을 학습시킬 수 있다. 하나 이상의 학습 데이터 세트는 본원에서 논의된 바와 같이, 본 기술에서의 모델 학습에 사용될 수 있다. 입력 데이 터는 ANN 네트워크 아키텍처에 영향을 미칠 수 있는 특정 형상을 가질 수 있다. 학습 데이터 세트의 요소는 (예 를 들어, (-1.0, 1.0) 범위의) 작은 값으로 스케일링된 텐서를 포함할 수 있다. 일부 양태에서, 사전 프로세싱 계층은 입력 데이터에 주요 구성요소 분석(PCA) 또는 다른 기술을 적용하는 학습(및 작동)에 포함될 수 있다. PCA 또는 다른 차원 감소 기술은 높은 수에서 비교적 적은 수로 차원을 감소시키기 위해 학습 중에 적용될 수 있다. 차원의 감소는 입력 데이터를 학습 및/또는 분석하는 데 필요한 컴퓨팅 자원(예를 들어, 메모리 및 CPU 사이클)을 실질적으로 감소시킬 수 있다. 일반적으로, ANN을 학습시키는 단계는 네트워크 아키텍처 또는 토폴로지를 설정하는 단계, 각각의 계층에 대한 활성화 기능(예를 들어, \"누출\" 정류 선형 유닛(ReLU), 소프트맥스, 하이퍼볼릭 접선 등), 손실 기능, 및 옵티 마이저를 포함하는 계층을 추가하는 단계를 포함할 수 있다. 일 양태에서, ANN은 각각의 계층에서, 또는 숨겨진 계층과 출력 계층 사이에서 상이한 활성화 기능을 사용할 수 있다. 적합한 옵티마이저는 Adam 및 Nadam 옵티마 이저를 포함할 수 있다. 일 양태에서, 상이한 신경망 유형(예를 들어, 순환 신경망, 딥 러닝 신경망 등)이 선택 될 수 있다. 학습 데이터는 학습 데이터, 검증 데이터 및 시험 데이터로 분할될 수 있다. 예를 들어, 학습 데이 터 세트의 20%는 추후 검증 및/또는 시험을 위해 보류될 수 있다. 해당 예에서, 학습 데이터 세트의 80%가 학습 에 사용될 수 있다. 해당 예에서, 학습 데이터 세트 데이터는 해당 방식으로 분할되기 전 셔플링될 수 있다. 데 이터세트의 분할은, 예를 들어 데이터 세트가 작을 때, 교차 검증 설정에서 수행될 수도 있다. 인공 신경망에 대한 데이터 입력은 N-차원 텐서, 어레이, 매트릭스, 및/또는 다른 적절한 데이터 구조로 인코딩될 수 있다. 일 부 양태에서, 학습은 라벨링된 학습 샘플을 사용하여, 네트워크의 연속적인 평가(예를 들어, 루핑)에 의해 수행될 수 있다. ANN을 학습시키는 프로세스는 ANN의 가중치 또는 파라미터를 변경시킬 수 있다. 가중치는 무작위 값으로 초기화될 수 있다. 가중치는, 네트워크가 하나 이상의 구배 하강 알고리즘을 사용함으로써 연속적으로 학습됨에 따라, 손실을 감소시키고 네트워크에 의한 출력 값이 예상된 값 또는 \"학습된\" 값으로 수렴되도록 조 정될 수 있다. 일 양태에서, 활성화 기능이 없는 회귀법이 사용될 수 있다. 여기에서, 입력 데이터는 평균 센터 링에 의해 정규화될 수 있고, 평균 제곱 오차 손실 함수가 평균 절대 오차에 더하여 사용되어, 적절한 손실을 결정할 뿐만 아니라 출력의 정확도를 정량화할 수 있다. 일부 양태에서, ML 학습 모듈은 ML 모델 사전학습, ML 모델 미세 조정 및/또는 ML 모델 자체 지도형 학습 을 수행하기 위한 컴퓨터 실행가능 명령어를 포함할 수 있다. 모델 사전학습은 전달 학습으로 알려져 있을 수 있으며, 이는 예를 들어 모든 항체 서열에 대한 공통 문법으로서 사용될 수 있다는 의미에서의 보편적인 기본 모델의 학습을 가능하게 할 수 있다. 용어 \"사전학습\"은 제2 학습(즉, 모델이 \"미세 조정\"될 수 있는 경우)이 발생할 수 있는 시나리오를 기술하는 데 사용될 수 있다. 전달 학습은, 달리 무작위 초기화를 요구할 수 있는, 제2 학습을 보다 양호하게 초기화하기 위해 제1 사전학습의 결과(가중치)를 활용하는 모델의 능력을 지칭한다. 제2 학습, 즉 미세 조정은 본원에서 논의된 바와 같은 독점적인 친화도 데이터를 사용하여 수행될 수 있다. 사 전 학습과 미세 조정을 조합하는 기술의 장점은, 유리하게는 해당 성능을 향상시키며, 친화도 데이터에 대한 학 습의 결과가 사전학습이 수행되지 않을 때보다 사전학습 학습 후 (예를 들어, 기술된 바와 같은 OAS로부터의 천 연 항체 서열을 사용하여) 보다 양호하게 수행된다는 것이다. 모델 미세 조정은 일부 양태에서, 주어진 항체-항 원 쌍에 대해 수행될 수 있다. 사전학습 동안 해당 모델이 항체 문법을 이해할 수 있게 하기 위해, ML 모델 자 체 지도형 학습이 수행될 수 있다. 일반적으로, ML 모델은 지도형, 반-지도형 또는 비지도형 머신 러닝 프로그램 또는 알고리즘을 사용하여 본원에 기술된 바와 같이 학습될 수 있다. 머신 러닝 프로그램 또는 알고리즘은, 특정 관심 영역에서 2개 이상의 특징 을 학습하거나 특징 데이터세트(예를 들어, 구조화된 데이터, 구조화되지 않은 데이터 등)에서 학습하는 컨볼루 션 신경망, 딥 러닝 신경망, 트랜스포머, 오토인코더 및/또는 조합된 학습 모듈 또는 프로그램일 수 있는 신경 망을 사용할 수 있다. 머신 러닝 프로그램 또는 알고리즘은 또한 자연어 프로세싱, 의미 분석, 자동 추론, 회귀 분석, 지원 벡터 머신(SVM) 분석, 의사결정 트리 분석, 랜덤 포레스트 분석, K-최근린 분석(K-Nearest neighbor analysis), 미처리 Bayes 분석, 클러스터링, 강화 학습, 및/또는 다른 머신 러닝 알고리즘 및/또는 기술(예를 들어, 생성 알고리즘, 유전자 알고리즘 등)을 포함할 수 있다. 일부 양태에서, ML 알고리즘 또는 기술은 입력의 문제 세트 크기에 기초하여 특정 입력에 대해 선택될 수 있다. 일부 양태에서, 인공 지능 및/또는 머신 러닝 기반 알고리즘은 서버(들)에서 실행된 라이브러리 또는 패키 지로서 포함된 하나 이상의 머신 러닝 알고리즘의 양태에 기초하거나, 그렇지 않으면 이를 포함할 수 있다. 예 를 들어, 라이브러리는 TensorFlow 기반 라이브러리, Pytorch 라이브러리(예를 들어, PyTorch Lightning), Keras 라이브러리, Jax 라이브러리, HuggingFace 생태계(예를 들어, 이에 포함된 트랜스포머, 데이터세트 및/또 는 토큰화기 라이브러리), 및/또는 사이킷-학습(scikit-learn) Python 라이브러리를 포함할 수 있다. 그러나, 이들 인기 있는 오픈 소스 라이브러리는 훌륭하기는 하지만, 필수적인 것은 아니다. 본 기술은 다른 프레임워크 /언어를 사용하여 구현될 수 있다. 머신 러닝은 (예를 들어, 높은 결합 친화도를 갖는 변이체를 예측하기 위해 학습된 모델을 사용하는 것과 같은) 후속 데이터에 대한 예측, 분류 및/또는 식별을 용이하게 하기 위해 기존 데이터의 패턴(예를 들어, 결합 친화 도)을 식별하고 인식하는 것을 포함할 수 있다. 머신 러닝 모델(들)은, 새로운 입력에 대한 유효하고 신뢰성 있 는 예측을 위해 예시적인 데이터(예를 들어, \"학습 데이터\") 입력 또는 데이터(\"특징\" 및 \"라벨\"로 지칭될 수 있음)에 기초하여 생성되고 학습될 수 있다. 지도형 머신 러닝에서, 서버, 컴퓨팅 장치, 또는 달리 프로세서(들)에서 작동하는 머신 러닝 프로그램에는 예시적인 입력(예를 들어, \"특징부\") 및 이들의 연관, 또는 관찰된, 출력(예를 들어, \"라벨\") 제공될 수 있으며, 이에 따라, 머신 러닝 프로그램 또는 알고리즘은, 예를 들 어, 다양한 기능 카테고리에 걸쳐 해당 모델에 가중치 또는 다른 메트릭을 결정 및/또는 할당함으로써, 규칙, 관계, 패턴을 결정 또는 발견하거나, 그렇지 않을 경우, 해당 입력(예를 들어, \"특징부\")를 출력(예를 들어, \" 라벨\")으로 맵핑하는 머신 러닝 \"모델\"을 결정하거나 발견하게 된다. 이어서, 이러한 규칙, 관계, 또는 그렇지 않을 경우 모델에는, 해당 모델이 서버, 컴퓨팅 장치, 또는 다른 프로세서(들) 상에서 실행되어, 발견된 규칙, 관계, 또는 모델에 기초하여 예상 출력을 예측하게 하기 위해, 후속 입력이 제공될 수 있다. 예를 들어, ML 학습 모듈은 네트워크 계층 아키텍처(예를 들어, 인공 신경망, 컨볼루션 신경망, 심층 신경 망 등)를 갖는 모델의 입력 계층에서 라벨링된 데이터를 분석하여 ML 모델을 생성할 수 있다. 학습 데이터는, 예를 들어 친화도에 따라 라벨링된 서열 변이체일 수 있다. 학습 동안, 라벨링된 데이터는 ML 모델의 하나 이상의 연결된 심층 계층을 통해 전파되어 각각의 계층의 하나 이상의 노드 또는 뉴런의 가중치를 설정할 수 있다. 초기에, 가중치는 무작위 값으로 초기화될 수 있으며, 당업자가 이해하는 바와 같이, 하나 이상의 적절한 활성 화 기능이 학습 프로세스에 대해 선택될 수 있다. ML 학습 모듈은 하나 이상의 머신 러닝 모델의 각각의 출력 계층을 학습시키는 것을 포함할 수 있다. 출력 계층은 예측을 출력하도록 학습될 수 있다. 예를 들어, 본 원에서 학습된 ML 모델은 학습 동안 제공된 라벨링된 예를 분석하는 단계에 의해 보지 못했던 서열 변이체의 결 합 친화도를 예측할 수 있다. 일부 구현예에서, 결합 친화도는 (예를 들어, 회귀 분석에서) 실제 수로서 표현될 수 있다. 일부 구현예에서, 결합 친화도는 (예를 들어, 분류에서) 부울(boolean) 값으로 표현될 수 있다. 일부 양태에서, 다수의 ANN은 별도로 학습 및/또는 작동될 수 있다. 예를 들어, 개별 모델은 복수의 상이한 항체-항 원 쌍에 대해, 전달 학습을 사용하여, 사전 학습된 모델에 기초하여 미세 조정(즉, 학습)될 수 있다. 비지도형 또는 반-지도형 머신 러닝에서, 서버, 컴퓨팅 장치, 또는 달리 프로세서(들)는 라벨이 지정되지 않은 예시적인 입력에서 이의 자체 구조를 찾아야 할 수도 있으며, 여기에서, 예를 들어, 만족스러운 모델이 생성될 때까지 다수의 세대의 모델을 학습시키기 위해, 서버, 컴퓨팅 장치, 또는 달리 프로세서(들)에 의한 다수의 학 습 반복이 실행된다. 본 기술에서, 반-지도형 학습은, 특히, 자연어 프로세싱 목적을 위해, 그리고 마스킹된 언 어 모델 객체화와 같은 객체화를 사용하여 항체 서열의 문법을 학습하기 위해 사용될 수 있다. 지도형 러닝 및/ 또는 비지도형 머신 러닝은 또한, 시간 경과에 따라 수신, 수집, 생성, 또는 다른 방식으로 사용된 정보를 포함 할 수 있는, 새로운 또는 상이한 정보로 모델을 재학습, 재교육, 또는 달리 업데이트하는 것을 포함할 수 있다. 다양한 양태에서, 본원의 ML 모델을 학습시키는 단계는 본원에 기술된 바와 같은, 동일하고/하거나 상이한 AI 알고리즘에 의해 학습되고 함께 작동하도록 구성된 모델을 포함하는, 다수의 모델 또는 서브 모델을 포함하는 앙상블 모델을 생성하는 단계를 포함할 수 있다. 모델 학습 모듈이, ANN 또는 회귀 네트워크일 수 있는 하나 이상의 ML 모델을 초기화하면, 예를 들어, 모 델 학습 모듈은 라벨링된 데이터(예를 들어, 친화도로 라벨링된 항체 변이체)를 모델에 입력함으로써 ML 모델을 학습시킨다. 학습된 ML 모델은 해당 모델이 이전에 보지 못한(즉, 학습 동안 사용되지 않은) 항체 변이 체 입력을 감안하여 정확한 친화도 예측을 제공할 것으로 예상될 수 있다. 모델 학습 모듈은 라벨링된 데이터를 각각의 학습 데이터 세트 및 시험 데이터 세트로 분할할 수 있다. 모 델 학습 모듈은 라벨링된 데이터를 사용하여 ANN을 학습시킬 수 있다. 모델 학습 모듈은 시험 데이터 및 상응하는 시험 라벨 세트를 사용하여 정확도/오류 메트릭(예를 들어, 교차 엔트로피)을 연산할 수 있다. 모 델 학습 모듈은 학습된 모델을 직렬화하고 학습된 모델을 데이터베이스(예를 들어, 데이터 저장소)에 저장할 수 있다. 물론, 당업자는 모델 학습 모듈이 하나 초과의 모델을 학습시키고 저장할 수 있음을 이해 할 것이다. 예를 들어, 모델 학습 모듈은 각각의 항체-항원 쌍에 대한 개별 모델을 학습시킬 수 있다. 설 명된 바와 같은 네트워크의 구조는 구현예에 따라 상이할 수 있음을 이해해야 한다. 일부 양태에서, 컴퓨팅 모듈은 머신 러닝 로딩, 구성, 초기화 및/또는 작동 기능을 구현하는 컴퓨터 실행 가능 명령어 세트를 포함하는 머신 러닝 작동 모듈을 포함할 수 있다. ML 작동 모듈은 학습된 모델을 (예를 들어, 전자 데이터 저장소에, 피클링된 이진수 등으로서) 저장하기 위한 명령어를 포함할 수 있다. 일단 학습되면, 학습된 ML 모델은 추론 모드로 작동될 수 있으며, 이 때, 해당 모델에 이전에 제공되지 않았던 새로운 입력이 제공되면, 모델은 본원에 기술된 바와 같이, 하나 이상의 예측, 분류 등을 출력할 수 있다. 비지 도형 학습 양태에서, 손실 최소화 함수가, 예를 들어, 알려진 출력(즉, 실제 참(truth) 예시값)과 유사한 출력 을 생성하도록 ML 모델을 교시하기 위해 사용될 수 있다. 모델(들)이 모델 학습 모듈에 의해 학습되면, 모델 작동 모듈은 (예를 들어, 데이터 저장소으로 부터의) 하나 이상의 학습된 모델을 로딩할 수 있다. 모델 작동 모듈은 일반적으로 학습된 모델이 이전에 분석하지 않은 새로운 데이터를 해당 학습된 모델에 적용한다. 예를 들어, 모델 작동 모듈은 직렬화된 모 델을 로딩하고, 모델의 직렬화를 해제한 다음, 모델을 메모리 내에 로딩할 수 있다. 모델 작동 모듈 은 학습된 모델을 학습시키는 데 사용되지 않은 새로운 분자 변이체 데이터를 로딩할 수 있다. 예를 들어, 새로 운 분자 데이터는 입력 텐서로서 암호화된, 본원에 기술된 것과 같은 항체 서열 데이터, 항원 서열 데이터 등을 포함할 수 있다. 모델 작동 모듈은 하나 이상의 입력 텐서(들)를 학습된 ML 모델에 적용할 수 있다. 모델 작동 모듈은 학습된 ML 모델로부터 출력(예를 들어, 텐서, 특징부 맵 등)을 수신할 수 있다. ML 모델의 출 력은 입력 서열과 연관된 친화도의 예측일 수 있다. 이러한 방식으로, 본 기술은 유리하게는 종래의 업계 방식 에 비해 훨씬 더 정확하고 데이터가 풍부한, 분자 친화도를 정량적으로 추정하는 수단을 제공한다. 해당 장점은, 기존 방식에서의 이러한 분자 친화도를 측정하는 것은, 실험실에서 수행되어야 하기 때문에, 시간이 많 이 걸리고 비용이 많이 든다는 것이다. ML을 사용함으로써, 본 기술은 학습 세트를 생성하기 위한 실험실 측정의 수행만을 필요로 하며, 이에 이어서 습식 실험실의 지속적인 사용을 필요로 하지 않고, 가상 환경에서의 수 행함으로써, 비교적 저렴하고 신속한 방식으로 측정되지 않은 서열 변이체/KD 쌍을 예측할 수 있다. 모델 작동 모듈은 분자 모델링 서버의 다른 요소(예를 들어, 웹 서비스)에 의해 액세스될 수 있다. ML 작동 모듈은 이의 출력을 변이체 식별 모듈의 추가 프로세싱/분석에 전달할 수 있다. 대안적으로, 변이체 식별 모듈은 전자 데이터 저장소의 ML 작동 모듈에 의해 저장된 결과를 수신할 수 있다. 예를 들어, 변이체 식별 모듈은 하나 이상의 관심 변이체(예를 들어, 본원에서 논의된 바와 같은 가장 높 은 결합, 가장 낮은 결합, 또는 다른 특성을 갖는 변이체)의 식별을 위해, 규칙 세트를 사용하여 ML 작동 모듈 의 출력을 평가할 수 있다. 변이체 식별 모듈은 하나 이상의 관심 서열 변이체를 입력으로서 (예를 들어, 이메일을 통해, 차트/그래프와 같은 시각화로서, 클라이언트 컴퓨팅 장치 등과 같은 컴퓨팅 장치의 GUI의 요소로서) 제공하기 위한 추가 명령어를 포함할 수 있다. 일부 구현예에서, 사용자는 명령 라인 툴, 애플 리케이션 프로그래밍 인터페이스(API), 소프트웨어 개발 키트(SDK), Jupyter 노트북 등을 사용하여 학습 및/또 는 작동 중 ML 모델과 상호작용할 수 있다. 모듈과 관련하여, 당업자는 모듈을 포함하는 소프트웨어 명령어가 상이하게 구성될 수 있으며, 더 많 은/더 적은 모듈이 포함될 수 있음을 이해할 것이다. 예를 들어, 모듈 중 하나 이상은 생략되거나 조합될 수 있다. 일부 양태에서, 추가 모듈이 추가될 수 있다(예를 들어, 국소화 모듈). 일부 구현예에서, 하나 이상의 모듈(예를 들어, Python 코드)을 구현하는 소프트웨어 라이브러리는, 예를 들어, ML 학습 모듈 및 ML 작동 모듈이 학습 및 예측을 위해 사용되는 실행가능 명령어의 단일 세트가 되도록, 조합될 수 있다. 또 다른 구현예에서, 모듈은 분석 모듈 및/또는 시퀀싱 모듈을 포함하지 않을 수 있다. 예를 들어, 실험 실 컴퓨터 및/또는 분석 장치는 해당 모듈 및/또는 모듈의 다른 것들을 구현할 수 있다. 이러한 경우, 분석 및 시퀀싱은 데이터 저장소에 저장되고 서버에 의해 액세스되는 학습 데이터를 생성하기 위해 실험실에서 수행될 수 있다. 예시적인 컴퓨터 구현 방법 모델 학습 도 2는 본 기술의 일부 양태에 따른, 이전에 보지 못했던 서열 변이체의 결합을 예측하기 위해 머신 러닝 모델 을 학습시키기 위한 컴퓨터 구현 방법의 예시적인 데이터 흐름 블록 다이어그램을 도시한다. 전술한 바와 같이, 본 기술은 1-단계 또는 2-단계 학습 절차를 포함할 수 있다. 이들 기술 중 하나는, 원하는 특성(예를 들어, 고 친화도)을 갖는 변이체를 예측할 수 있는 하나의 모델 또는 모델들을 구축하고 학습시키기 위해, 습식 실험실에서 생성된 제한된 수의 데이터 포인트를 사용하는 모델 학습을 포함할 수 있다. 언급된 바 와 같이, 일부 양태에서, 학습 프로세스는 인간 항체 서열을 사용하는 사전학습 및 친화도 데이터를 사용하는 미세 조정 둘 모두를 포함한다. 학습 기간 동안, 학습 데이터(예를 들어, 특정 서열 변이체의 KD 측정치)는 합 성된 변이체 서열에 대해 수행된 습식 실험실 실험/분석으로부터 유래한다. 방법은 사전학습 및/또는 미세 조정을 수행할 수 있다. 경험적으로, 사전학습 및 미세 조정 둘 모두를 사용하는 것이 최상의 성능을 제공하는 것으로 나타났다. 미세 조정만을 사용하는 경우, 두 번째로 우수한 성능을 제공하고, 사전교육만을 사용하는 경 우 세 번째로 우수한 성능만을 제공한다. 구체적으로, 방법은 하나 이상의 학습 결합 특성에 따른 생체분 자 서열 변이체의 순위를 포함하는 스크리닝 데이터를 수신하는 단계를 포함할 수 있다(블록). 학습 결합 특성은 친화도에 따른 순위를 포함할 수 있으며, 합성된 생체분자 서열 변이체의 하나 이상의 \"습식 실험실\" 결 합 분석에 의해 수행될 수 있다. 예를 들어, 해당 검정은 본원에서 논의된 바와 같은, 활성 기반 스크리닝 기술, SPR 기술 및/또는 다른 기술을 포함할 수 있다. 일부 양태에서, 방법은 학습 결합 특성을 증폭/개선하기 위해 생체분자 서열 변이체에 상응하는 재스크리 닝 데이터를 수신하는 단계, 및 모델 정확도를 개선하기 위해 재스크리닝 데이터를 사용하여 머신 러닝 모델을 추가로 학습시키는 단계를 포함할 수 있다(블록). 예를 들어, 재스크리닝 데이터는 관심 KD 범위의 정확도 를 증가시킬 수 있다. 방법은 블록에 도시된 바와 같이 각 서열의 상대 친화도의 시각적 입증을 제공 하도록 측정된 결합 특성(예를 들어, 측정된 결합 친화도)의 그래프를 생성하는 단계를 포함할 수 있음에 주목 해야 한다. 결합 동역학 및 차세대 시퀀싱과 같은 검정에 의해 결정된 정보가 블록에서 수신될 수 있다. 방법은 AI/ML 모델을 생성하는 단계, 및 입력 생체분자 서열 변이체의 하나 이상의 원하는 결합 특성을 예 측하기 위해 수신된 스크리닝 학습 데이터를 사용하여 머신 러닝 모델을 학습시키는 단계를 포함할 수 있다(블 록). 학습 데이터는 블록 및/또는 블록으로부터의 검정된 합성된 생체분자 서열 변이체를 포함할 수 있으며, 여기에서 각각의 변이체는 상응하는 각각의 결합 파트너 생체분자(예를 들어, 생체분자 서열이 항체와 관련될 경우에서는, 항원, 그리고 생체분자 서열이 항원과 관련될 경우에서는, 항체)에 결합하는 능력을 나타내는 각각의 측정된 결합 특성(예를 들어, 친화도)을 갖는다. 논의된 바와 같이, 블록에서의 학습은 전달 학습을 적용할 수 있으며, 여기에서 항체 문법의 지식이 부여된 일반화/범용(즉, 사전학습된) 모델이 친화 도 데이터에 기초한 특정 항체-항원 학습을 포함하는 미세 조정 단계와 함께 사용된다. 방법은, 실시예 1 과 관련하여 후술하는 바와 같은, 머신 러닝된 모델을 교차 검증하는 단계 및 측정 및 예측된 KD 사이에 하나 이 상의 계수(예를 들어, Pearson 상관 계수)를 생성하는 단계를 포함할 수 있다.(블록). 방법의 학습 프로세스에 걸쳐, 방법은, 모델이 항체/항원 상호작용의 기본 규칙을 학습하도록, 머신 러닝 모델의 가중치를 조정할 수 있다. 따라서, 다음 섹션에서 논의되는 바와 같이, 학습된 모델은 해당 모델이 이전에 보지 못한 입력 생체분자 서열 변이체의 생체분자 결합 특성을 신뢰성 있게 예측할 수 있다(블록). 학습된 모델에 입력된 이전에 보지 못했던(즉, 신규 또는 시뮬레이션된) 생체분자 서열 변이체는 블록의 프로세스를 통해 생성될 수 있거나, 전혀 다른 소스로부터 유래될 수 있다. 일부 양태에서, 모델 학습(예를 들어, 방법의 모델 학습)은, 학습된 모델(들)이 해당 모델을 학습시키기 위한 제한된 양의 총 가능한 변이체/돌연변이 공간만을 사용하여, 하나 이상의 항체 변이체 특성, 예를 들어 친 화도를 예측할 수 있게 한다. 변이체 공간은 본원에서 논의된 바와 같이, 생체분자(예를 들어, 항체/항원 등) 변이체의 조합 검색 공간을 지칭할 수 있다. 예를 들어, 일부 양태에서, 변이체 공간의 10%가 모델을 학습시키 는 데 사용될 수 있다. 경험적 테스트는 총 가능한 변이체 공간의 보다 낮은 백분율을 사용하는 것 또한 정확한 예측을 제공한다는 것을 입증하였다. 따라서, 일부 양태에서, 총 가능한 변이체 공간의 10% 미만, 9% 미만, 8% 미만, 7% 미만, 6% 미만, 5% 미만, 4% 미만, 3% 미만, 2% 미만, 또는 1% 미만이 모델을 학습시키는 데 사용될 수 있다. 총 가능한 변이체 공간의 0.5% 미만, 0.4% 미만, 0.3% 미만, 0.2% 미만, 또는 0.1% 미만의 백분율이 사용될 수 있으며, 이 또한 0.6 초과의 Pearson R 값을 달성할 수 있다. 학습 데이터에 대해 돌연변이 공간의 비교적 작은 비율(예를 들어, 0.3%)을 사용하면서도 높은 상관 값을 달성 할 수 있다는 것은 상당한 개선을 나타내며, 유리하게는 컴퓨팅 전력이 제한적으로 이용 가능한 시나리오에서도 (예를 들어, 모바일 장치, 웨어러블 장치 등을 통해) 본 기술을 사용하는 것을 가능하게 할 수 있다는 것을 당 업자는 이해할 것이다. 이는 또한, 유리하게는 본 기술이 학습 및 재학습을 신속하게 수행할 수 있게 함으로써, 지연을 감소시키고 개시된 모델을 학습시키고 작동시키는 애플리케이션의 성능을 개선한다. 마지막으로, 비교적 적은 양의 학습 데이터 요건은 저장되어야 하는 학습 데이터의 양을 유리하게 감소시킨다. 모델 추론 본 기술은, 가상 환경에서 예측을 수행하여 가상-예측된 KD를 얻기 위해 전술한 학습된 ML 모델(들)을 사용하는 것을 포함할 수 있다. 실험실에서 KD를 측정하는 유일한 방법은 실제로 검정, 시퀀싱 등을 수행하는 것이기 때 문에, 높은 수준에서, 이는 가상 환경의 실험을 \"시뮬레이션\"하는 것과 유사하고 할 수 있다. 그러나, 가상 환 경에서, 본 기술은 KD를 얻기 위해 모든 단일 단계를 시뮬레이션하거나 결정할 필요가 없다는 유리한 이점을 갖 는다. 오히려, AI는 서열 변이체와 KD 사이의 관계를 학습하고, 보지 못했던 변이체에 대한 KD 예측을 수행할 수 있다. 이러한 예측은 ML 모델이 실험, 검정, 또는 시퀀싱 실행을 명시적으로 시뮬레이션하지 않음에도 불구 하고, 신규(즉, 이전에 보지 못했던) 서열 변이체를 고려하여 예측된 KD를 출력할 수 있다는 점에서, 실험실 기 반 실험과 동등하다고 할 수 있다. 도 3a는 일부 구현예에 따른, 학습된 머신 러닝된 모델이 하나 이상의 관심 생체분자 서열 변이체를 식별하도록 이를 구동시키는 컴퓨터 구현 방법을 도시한다. 방법은 하나 이상의 시뮬레이션된/보지 못했던 생체 분자 서열 변이체를 수신하는 단계를 포함할 수 있다. 방법은, 일부 양태에서, 본원에서 논의된 바와 같이, 돌연변이를 통해 시뮬레이션된 생체분자 서열 변이체를 생성할 수 있다. 예를 들어, 학습 데이터는 습식 실험실에서 생성될 수 있고, 하나 이상의 ML 모델은 전술한 바와 같이 학습될 수 있다. 이어서, 방법은 학 습된 ML 모델을 사용하여 가상 환경에서의 다양한 임의의 서열에 대한 KD를 예측하는 단계를 포함할 수 있다. 예를 들어, 방법은 가상 환경에서 아미노산을 변경하는 단계, 및 해당 변경 후의 KD를 수득하기 위해 이들 서열을 학습된 ML 모델에 입력하는 단계를 포함할 수 있다. 일부 양태에서, 이러한 프로세스는 최적화될 수 있 으며, 여기에서 서열 변이체를 제공하고 모델을 사용하여 KD를 예측하는 작업(즉, 추론/예측)은 원하는 예측된 KD를 갖는 서열 변이체가 발견될 때까지 반복된다(즉, 최적화됨). 학습된 모델에 대한 입력은 적절한 생성 기술(예를 들어, 생성 대립 기술)을 사용하여 생성될 수 있다. 생성 및 최적화 둘 모두는 동일한 목적을 갖는다: 학습된 모델에 대한 KD 제공 및 이로부터의 서열 수득. 생성은 추론과반대 방향으로 ML 알고리즘을 실행함으로써, 이를 직접적으로 시도한다. 한편, 최적화는 고전적 추론을 활용하 고, 원하는 KD를 갖는 서열이 발견될 때까지 추론을 계속 실행한다. 최적화는, 비효율적이고 일부 경우에는 불 가능한, 모든 가능한 서열 변이체의 완전 검색보다 더 효율적이다. 생성 기술의 예는 전술한 바와 같은 플러그 앤 플레이인 한편, 최적화의 예는 유전자 알고리즘이다. 머신 러닝 모델이 학습된 후, 방법은 본원에서 논의된 이전에 관찰되지 않은 생체분자 서열 변이체를 수신 하는 단계를 포함할 수 있다. 물론, 방법은 이전에 관찰된 변이체(예를 들어, 학습 중에 사용된 변이체)를 수신할 수도 있다. 방법은 하나 이상의 이전에 보지 못했던(예를 들어, 시뮬레이션된) 항체 서열 변이체를 머신 러닝 모델로 처리하여, 각각 하나 이상의 이전에 보지 못했던(예를 들어, 시뮬레이션된) 항체 서열 변이체 중 각각의 하나에 상응하는, 하나 이상의 예측된 결합 친화도를 생성하는 단계를 포함할 수 있다(블록). 구체적으로, 본원에서 논의된 바와 같이, 머신 러닝 모델은 문법 지배 항체 서열의 이해를 갖는 마스킹된 언어 모델 객체화를 사용하여 사전학습되었을 수 있다. 대안적으로 또는 추가적으로, 머신 러닝 모델은 친화도 데이 터를 사용하여 미세 조정되어 모델 가중치가 친화도 측정치로 업데이트되었을 수 있다. 이전에 보지 못했던 항 체 서열 변이체는 본원에서 논의된 바와 같은 돌연변이 기술을 사용하여, 예를 들어 기준 생체분자(예를 들어, 항체, 항원 등)의 돌연변이 유발에 의해 생성될 수 있다. 예를 들어, 항체 서열이 주어진 경우, 머신 러닝 모델은 예측된 결합 친화도의 목록을 생성할 수 있으며, 여기 에서 각각의 결합 친화도는 각각의 항원과 연관된다. 방법은 하나 이상의 예측된 결합 특성을 분석하여 시 뮬레이션된 서열 변이체 중 하나 이상의 관심 생체분자 서열 변이체를 식별하는 단계를 추가로 포함할 수 있으 며, 하나 이상의 관심 생체분자 서열 변이체 각각은 각각의 하나 이상의 원하는 특성을 갖는다. 원하는 특성은 예측된 결합 친화도의 상한/하한과 같은 양태, 및 본원에서 논의된 바와 같은 다수의 다른 양태를 포함할 수 있 다. 본원에서 논의된 바와 같이, 변이체 식별 모듈은 하나 이상의 관심 생체분자 서열 변이체를 식별하도록 머 신 러닝 모델의 출력을 분석하기 위한 컴퓨터 실행가능 명령어를 포함할 수 있다(블록). 예를 들어, 본원 에서 논의된 바와 같이, 하나 이상의 관심 변이체에서의 관심 특성은 다음 중 하나 이상을 포함할 수 있다: (i) 관심 변이체의 적어도 하나의 예측된 결합 친화도의 증가; (ii) 관심 변이체의 적어도 하나의 예측된 결합 친화 도의 감소; (iii) 관심 변이체의 적어도 하나의 예측된 결합 친화도의 상한; (iv) 관심 변이체의 적어도 하나의 예측된 결합 친화도의 하한; (v) 관심 변이체의 제1 예측된 결합 친화도의 제1 항원에 대한 친화도의 증가 및 관심 변이체의 제2 예측된 결합 친화도의 제2 항원에 대한 친화도의 감소; (vi) 수용체에 대한 결합 친화도를 증가 또는 감소시키는 관심 변이체의 사이토카인 서열의 능력; (vii) 차세대 항체 스캐폴드 및/또는 항체 모방 스캐폴드로서의 용도에 대한 관심 변이체의 적합성; (viii) 항체의 Fc 영역에서 Fc 수용체에 결합하는 관심 변 이체의 능력; 또는 (ix) 투여 시 내약성으로 표시되는 바와 같은 관심 변이체의 개발가능성. 방법은 출력으로서 하나 이상의 관심 생체분자 서열 변이체를 제공하는 단계(블록 306)를 포함할 수 있다. 예를 들어, 방법은 관심 변이체를 전자 데이터베이스(예를 들어, 도 1의 전자 데이터베이스)에 저장시키거 나, 디스플레이 스크린(예를 들어, 도 1의 컴퓨팅 장치의 디스플레이) 상에 디스플레이하거나, 그렇지 않 으면 사용자에게(예를 들어, 이메일을 통해) 전달할 수 있다. 일부 양태에서, ML 모델의 학습은 고정 항체 및 돌연변이된 항원을 포함할 수 있다. 이러한 경우, 추론은 항원 검색 공간을 포함할 수 있다(즉, 이전에 보지 못했던 항원을 입력함). 고정된 항체-돌연변이 항원의 경우, 항체 서열은 일정하며, 항원 서열은 변경될 수 있다. 그러나, 항원 서열을 변경시키는 경우에도, 항원은 동일할 수 있고, 단지 일부 잔기에서 돌연변이될 수 있다. 그리고, 모델은 결합 친화도를 출력할 수 있다. 따라서, 이러한 설정에서의 검색 유니버스는 모든 가능한/원하는 항원 변이체의 서열 공간에서의, 모든 항원 변이체에 대한 결 합 친화도를 포함한다. 고정된 항원-돌연변이 항원의 경우, 항원 서열은 일정하며, 항체 서열은 변경될 수 있다. 그러나, 항체 서열을 변경시키는 경우에도, 항체는 동일할 수 있고, 단지 일부 잔기에서 돌연변이될 수 있다. 그리고, 모델은 결합 친화도를 출력할 수 있다. 따라서, 이러한 설정에서의 검색 유니버스는 모든 가능한 /원하는 항체 변이체의 서열 공간에서의, 모든 항체 변이체에 대한 결합 친화도를 포함한다. 다른 양태에서, ML 모델의 학습은 고정 항원 및 돌연변이된 항체를 포함할 수 있다. 이러한 경우, 추론은 항체 검색 공간을 포함할 수 있다(즉, 이전에 보지 못했던 항체를 입력함). 또 다른 양태에서, ML 모델의 학습은 항 원 및 항체의 각각의 돌연변이를 포함할 수 있다. 이러한 경우, 추론은 항원 및 항체 검색 공간을 포함할 수 있 다(즉, 이전에 보지 못했던 항원 및 항체를 입력함). 도 3a는 일부 양태에 따른, 학습된 머신 러닝된 모델이 하나 이상의 관심 생체분자 서열 변이체를 식별하도록 이를 구동시키는 컴퓨터 구현 방법을 도시한다. 일부 양태에서, 방법은 도 1의 분자 모델링 서버와 같은 컴퓨터에 의해 수행될 수 있다. 방법은 기준 생체분자를 프로그램적으로 돌연변이시킴으로써 하나 이상의 생체분자 서열 변이체를 생성하 는 단계를 포함할 수 있다(블록). 본원에서, 용어 \"프로그램적\" 또는 \"프로그래밍적으로\"는 (예를 들어, 컴퓨터 구현 방법을 통한, 컴퓨터 프로그램을 통한, 컴퓨팅 시스템 등을 통한, 등) 방법 또는 시스템에 따른다 는 것을 의미한다. 돌연변이는 본원에서 논의된 원리에 따라 수행될 수 있다. 예를 들어, 방법은 출발점 항체 분자 주위의 서열 공간을 균일하게 샘플링하는 항체 라이브러리를 생성하는 단계를 포함할 수 있다. 방법 은 가상 환경, 즉 컴퓨터 실행가능 명령어를 실행하는 프로세서에 의해 (예를 들어, 분자 모델링 서버 의 변이체 모듈을 사용하는 도 1의 CPU에 의해) 돌연변이를 수행할 수 있다. 방법은 하나 이상의 학습 결합 특성에 따른 생체분자 서열 변이체의 순위를 포함하는 스크리닝 데이터를 수신하는 단계를 포함할 수 있다(블록). 논의된 바와 같이, 본 기술의 스크리닝은 습식 실험실 스크리닝 (예를 들어, qaACE를 사용함) 및/또는 가상 환경 스크리닝을 포함할 수 있다. 방법은 입력 생체분자 서열 변이체의 하나 이상의 원하는 결합 특성을 예측하기 위해 스크리닝 데이터를 사용하여 머신 러닝 모델을 학습시 키는 단계를 포함할 수 있다(블록). 일부 양태에서, 방법은 하나 이상의 학습 결합 특성을 증폭시키기 위해 생체분자 서열 변이체에 상응하는 재스크리닝 데이터를 수신하는 단계; 및 머신 러닝 모델의 정확도를 개선하기 위해 재스크리닝 데이터를 사용하 여 머신 러닝 모델을 추가로 학습시키는 단계를 포함할 수 있다. 일부 양태에서, 방법의 학습 결합 특성은 결합 친화도(KD)를 포함할 수 있다. 일부 양태에서, 방법의 스크리닝 데이터는 (i) 인간 실험자, 및 (ii) 검정 장치 중 하나 또는 둘 모두로부터 수신될 수 있다. 일부 양태에서, 방법의 하나 이상의 생체분자 서 열 변이체는 항체 또는 항원을 포함한다. 예시적인 데이터 흐름도 도 4a는 일부 양태에 따른, 관심 생체분자 서열 변이체의 학습 및 예측을 도시하는 예시적인 데이터 흐름도를 도시한다. 일부 양태에서, 도 4a의 데이터 흐름도는 도 2의 방법에 상응할 수 있다. 대체적으로, 도 4a는 야생형 단클론 항체와 비교하여 고 친화도 단클론 항체를 식별하는 목표를 도시한다. 도 4a는 또한, 하나 이상의 예측을 생성하기 위해 AI 모델(예를 들어, 도 2에서 논의된 바와 같은 하나 이상의 학습된 모델)에 입력되고 있는 실험실 분석 측정을 나타내는 워크플로우 개요를 도시한다. 도 4a는 검정된 생체분자가, 예를 들어 SoluPro® 균주 및/또는 하나 이상의 서열 변이체(예를 들어, 트라스투주맙 Fab CDRH3 변이체)의 라이브러리일 수 있음을 나타내는 추가적인 수준의 세부 사항을 포함한다. 방법은, (예를 들어, ACE AssayTM를 사용하여) 친화도로 입력 변이체의 순위를 지정하는 독점적인 일차 스크리닝을 포함할 수 있고, 입력 을 재스크리닝하여 주어진 관심 KD 범위의 정확도를 증가시키고, AI 모델을 학습시켜 보지 못했던 변이체를 가상 환경에서 스크리닝할 수 있다. 도 4b는 일부 양태에 따른, 도 4a의 검정을 수행하기 위한 예시적인 블록 흐름도를 도시한다. 고유 항체 서열 변이체를 발현하는 균주를 첨가하여 세포를 고정하고 투과화시킬 수 있고, 프로브를 첨가할 수 있다(블록 1 및 2). 이러한 SoluPro® 균주는 친화도에 대한 라벨링된 항원 기록 및 특히 역가에 대한 라벨링된 스캐폴드 결합 단백질 기록을 포함할 수 있다. 균주는 유세포 계측법에 의해 스크리닝되고 분류될 수 있다(블록). 차세대 시퀀싱이 수행될 수 있으며, ACE 친화도 점수가 생성될 수 있다(블록 및 블록). 도 4c는 일부 양태에 따른, 예시적인 친화도 예측 차트를 도시한다. 도 4c에서, Her2에 결합하는 트라스투주맙 CDRH3 서열 변이체의 모델 예측 KD와 SPR 측정 KD 사이의 관찰된 상관 관계가, 거의 4개 차수의 크기에 걸쳐 도 시되어 있으며, 여기에서 Pearson 상관 계수, R은 0.85이다. 도 4d는 일부 양태에 따른, 예시적인 친화도 예측 검정 차트를 도시한다. 도 4d는, 저 처리량 BLI에 의한 추가 적인 이차 검증을 거친, 중간 처리량 SPR에 의해 이미 검증된 20개의 서열 변이체(트라스투주맙 및 트라스투주 맙에 비해 Her2에 더 강하게 결합할 것으로 예측된 15개의 항체 및 트라스투주맙에 비해 약간 더 약한 결합제일 것으로 예측된 4개의 항체)를 도시한다. 이 경우 상관 계수는 R=0.94이다. 예시적인 노이즈 제거 단일 세포 RNA 서열의 분야에서 노이즈 제거를 위해 딥 러닝을 사용하는 풍부한 문헌이 존재한다. 그러나, 항체 조작 분야에서 노이즈 제거가 사용된 적은 없다. 노이즈 제거의 수행을 위해 사용되는 모델은 아키텍처/알고리즘 관점에서 실시예 1에 사용된 것과 동일할 수 있 지만, 단 Carterra SPR 서열을 사용하는 학습을 대신하여, 모델은 ACE 데이터를 사용하여 학습될 수 있다. 천연 항체 서열로 사전학습되는 것은 동일하다. 모델 입력은 상이한 정확도를 갖는 ACE-유래 친화도 점수일 수 있다. 커버리지(고유 변이체의 수에 대한 세포 수)가 높을수록, 점수는 더 정확해진다. ACE 점수와 Carterra KD 사이 의 ~음의 0.7의 상관 관계가 관찰되었지만, 커버리지가 내려가면 이러한 상관 관계가 감소한다. 따라서, 서열 변이체 및 각각의 ACE 점수를 포함하는 학습 데이터로서 ACE 데이터를 모델에 공급하는 단계가 수행된다. 이어 서, 모델은 학습에 사용된 동일한 서열 변이체의 ACE 점수를 예측할 수 있다. 모델을 일반화되고자 하기 때문에, 모델 예측은 학습 세트와 동일하지 않을 것이다. 이러한 예측은 \"노이즈-제거\" 점수로 지칭되며, 경험 적 검정은 이러한 점수가 원래의 (측정된) ACE 점수보다 SPR KD와 보다 양호한 상관 관계를 가짐을 나타냈다. 따라서, 본 기술에서는, 예측(예를 들어, 친화도)의 정확도를 유지하거나 개선하는 동시에 처리량을 증가시키기 위해 비전통적인 방식으로 노이즈 제거를 사용한다. 검정(예를 들어, ACE 검정)에서의 측정치는 도 4e에 도시된 바와 같이 친화도와 상관관계를 가질 수 있다. 도 4e는 일부 양태에 따른, 노이즈가 제거된 예시적인 데이터 차트를 도시한다. 도 4e는 포화 라이브러리(열 (412a)) 및 불포화 라이브러리(열(412b))에 더하여, 원래의 측정치(행(410a)) 및 모델 기반 노이즈 제거 점수 (행(410b))를 도시한다. ACE 라이브러리는 분류 및 시퀀싱 용량이 라이브러리 크기를 크게 초과할 때(즉, 커버 리지가 높을 때) 포화된다. 포화 라이브러리는 일반적으로 ACE 점수와 SPR-유래 KD의 상관성 측면에서 가장 높 은 정확도를 제공한다. 커버리지가 낮은 경우, 라이브러리는 불포화되고 정확도는 저하된다. 본 기술은 불포화 라이브러리로부터의 서열 변이체 및 ACE 점수를 사용하는 모델 학습, 및 학습에 사용된 동일한 서열 변이체에 대한 ACE 점수를 예측하는 모델을 포함할 수 있다. 학습 서열 변이체의 이러한 모델 유래 ACE 점수(즉, 노이즈 제거 ACE 점수)는 하드웨어 측정보다 SPR 유래 KD와 보다 양호한 상관관계를 나타냈다. 대조적으로, 라이브러리 가 완전히 포화되었을 때, 모델 제공 정확도는 부스팅되지 않았다. 검정 처리량과 검정 정확도 사이에는 항상 타협이 존재한다. 보다 관심있는 잠재적 서열을 식별하기 위해 더 많 은 서열 변이체를 추가하면 정확도는 감소한다. 이는 일반적으로 보다 작은 라이브러리가 보다 많은 중복 측정 을 수행할 것이기 때문이며, 이는 동일한 서열이 여러 번 재샘플링되어 오류를 제거할 수 있음을 의미한다. 노이즈 제거를 수행하기 위한 모델은, 본원에 기술된 다른 모델과 동일한 방식으로, 예를 들어 ACE 학습 데이터 를 사용하여 학습될 수 있다. 그러나, 예측은 더 이상 보지 못했던 서열 변이체(즉, 학습 데이터 세트에 없는 서열)에 대한 것이 아닐 수 있을 것이다. 오히려, 예측된 서열 변이체는 학습 데이터 세트에 사용된 것과 동일 한 서열 변이체이다. 노이즈 제거 맥락에서, 보지 못했던 변이체를 예측하는 대신, 예측은 학습 데이터에 대한 것이다. 노이즈 제거는 상당한 이점을 제공하며, 도 4e에 도시된 예에서는, 행(410b), 열(412b)의 불포화 라이브러리 차 트의 상관 계수를 이에 상응하는 행(410b), 열(412b)의 포화 차트로 복원시킨다. 본질적으로, 이러한 결과는 처 리량을 크게 증가시키면서도 정확성을 보존할 수 있음을 의미한다. 모델은 부정확한 측정에 대해 노이즈를 제거 함으로써, 이들이 실체 참(즉, SPR) 측정과 보다 양호하게 상관된다는 의미에서, 이를 보다 정확하게 한다. 노 이즈 제거 기술의 개선을 고려하는 또 다른 방법은, 달리 사용되지 않을 수 있는 보다 부정확한 데이터의 수집 및 사용을 사용할 수 있게 하는 것이다. 예시적인 머신 러닝 자연도 본 기술은 하나 이상의 머신 러닝 모델에 대해 자연도를 학습시키기 위해 천연 항체 서열을 공급하는 단계를 포 함할 수 있다. 항체 서열의 소스는 Totient로부터 서열과 같은, 독점적 서열로 선택적으로 보충된 사전학습(예 를 들어, OAS 데이터베이스)에 사용된 것일 수 있다. 도 4f는 일부 양태에 따른, 자연도 학습 및 예측을 도시한 예시적인 개념도를 도시한다. 일반적으로, \"자연도\" 는 입력이 학습 데이터와 유사한지의 여부에 대한 척도이다. 이러한 유사성은 도 4f에서와 같이 형상 관점으로 간단히 표현될 수 있다. 즉, 학습 단계(460a) 동안, 모델은 다각형의 예를 사용하여 (예를 들어, 도 1의 ML 모 델 학습 모듈에 의해) 학습될 수 있다. 모델은 다각형이 직선, 폐쇄된 기하학적 구조와 같은 특정 특징부 를 갖는다는 것을 학습할 수 있다. 모델은 다른 특징부가 주어진 입력이 다각형인지의 여부를 결정하는 데 있어 서 다른 특징부(예를 들어, 색상, 선 두께, 회전 등)가 중요하지 않다는 것을 학습할 수 있다. 모델은 입력이다각형일 확률을 나타내는, 각각의 입력에 대한 점수를 생성하도록 학습될 수 있다. 예측 단계(460b) 동안, 학 습된 모델은 각각의 자연도 예측을 얻기 위해 개별 형상(도시된 바와 같은, 원, 삼각형, 선 등)의 집합을 입력 함으로써 사용될 수 있다. 도시된 바와 같이, 모델은 삼각형이 이들 입력 중 최상의 다각형인 것으로 추론한다. 학습 세트에서 시험된 서열 변이체는 돌연변이 부하 및 돌연변이될 위치를 정의하고 모든 가능한 서열을 조합적 으로 나열한 후 생성될 수 있으며, 이에 이어서, 이들 모두 또는 서브샘플(예를 들어, 무작위로 선택됨)은 실험 실에서 합성된 다음 시험된다. 이어서, 친화도 측정(ACE 점수 및/또는 SPR KD)을 모델에 공급될 수 있다. 물론, \"자연도\"는 어떤 입력이 모델을 학습하는 데 사용되고 있는지에 따라 다르게 표현될 수 있으며, 이러한 유사성을 결정하는 특성은 덜 직관적일 수 있다. 예를 들어, 유사한 프로세스가 관심 생체분자(예를 들어, 항체 서열)에 적용될 수 있다. 이러한 모델은 항체 서열의 다수의 (예를 들어, 수백만 개 이상의) 예를 포함하는 학 습 데이터를 사용하여 학습될 수 있다. 이들 서열은 하나 이상의 종으로부터 유래할 수 있다. 일단 학습되면, 해당 모델은 이전에 보지 못했던 서열, 예컨대 부모 항체의 변이체의 자연도를 채점할 수 있다. 특히, 이러한 학습된 모델은 순수하게 가상 환경에서 생성된 새로운 항체의 자연도를 판정하는 데 사용될 수 있다. 이는 많은 이유로 도움이 되며, 그 중 하나는 치료제를 설계하고자 하는 회사가 인간에게 사용할 수 없는 항체를 제거하는 데 있어서 해당 기술이 매우 유익하다고 생각할 수 있다는 것이다. 도 4g는 일부 양태에 따른 예시적인 자연도 점수 검증 차트를 도시한다. 논의된 바와 같이, 모델은 항체와 같은 생체분자의 자연도 점수를 결정하도록 학습될 수 있다. 이러한 모델로부터 유도된 점수는 기술적 검증에서 예상 된 대로 거동할 수 있다. 예를 들어, 도 4g에 도시된 바와 같이, 상이한 서열이 각각의 자연도에 따라 시각적으 로 디스플레이될 수 있다. 본 구현예에서, 다양한 품질 관리(QC) 필터를 통과하는 OAS 데이터베이스로부터의 다 수의 항체(\"양성\")가 분포도로 도시된다. QC 실패(예를 들어, 주석이 누락된 시작 및/또는 종료 CDR 잔기(들) (\"음성\")를 나타내는 것들은 거의 0의 자연도 점수 분포로 도시되어 있다. 또한, 드물지만 진품인 항체를 포함 할 뿐만 아니라 시퀀싱 오류를 포함할 것으로 예상되는, 저-존재비 서열에 대한 점수 또한 연산되었다. 시퀀싱 오류는 무작위로 분포되기 때문에, 자연도에 대해 가장 높게 페널티를 부과할 수 있는 보존된 항체 잔기에 거의 영향을 미치지 않는다. 이와 일관되게, 저 존재비 항체의 자연도 분포는 QC-통과 항체에 비해 단지 약간의 하향 시프트만을 나타낸다. QC 필터링에서 탈락한 서열의 경우, \"저 존재비\"는 데이터세트에 걸쳐 1 계수의 존재비를 의미한다. \"시작/종료 CDR 잔기 누락\"은 항체 서열 주석(일반적으로 ANARCI라는 툴을 사용하여 수행됨)이 하나의 CDR의 시작 또는 종 료 잔기를 누락한다는 것을 의미한다. OAS 필터는 다음과 같이 설명된다. 쌍을 이루지 않은 전체 데이터세트로 부터, 중첩된 샘플을 갖는 연구는 제외된다(예를 들어, 'Bonsignori 등', 'Halliley 등', 'Thornqvist 등'). 질환 또한 제외될 수 있다: '경쇄 아밀로이드증', 'CLL'. B형은 제외될 수 있다: '미 성숙-B-세포', 'Pre-B-세포'. 서열 자체에 대해, 다음과 같은 서열은 제외될 수 있다: 정지 코돈을 가진 서열; 비생산적 또는 프레임 외로 표시되는 서열; 보존되지 않은 시스테인 부위를 가진 서열; j_동일성 < 50을 가진 서열; FWR2 또는 FWR3에 AA가 없는 서열; CDR3에 37개 초과의 AA를 가진 서열; IMGT에 따라, 임의의 CDR 상에 처음 2개 또는 마지막 2개의 위치가 누락된 서열. 이에 이어서, 모델 학습에 대해, 1의 누적 중복을 갖는 서열 은 제외될 수 있다. 도 4h는 일부 양태에 따른 예시적인 자연도/개발가능성 상관 차트를 도시한다. 항체 자연도와 개발가능성 사이 의 관계를 분석하기 위해, 본 기술은 공개된 파지 디스플레이 라이브러리(Liu 등의 문헌[Bioinformatics 36:2126 ])의 최종 패닝 라운드를 풍부하게 함으로써 다수의 히트(예를 들어, 5000개)의 자연도를 채점하 는 데 사용될 수 있다(차트(480a)). 동일한 서열은 또한, 적어도 하나의 호박색 또는 적색 개발가능성 플래그를 받거나 전혀 모델링될 수 없는 백분율을 기록하는(개발가능성 실패, 차트(480b)), 치료 항체 프로파일러 (Therapeutic Antibody Profiler)(Raybould 등의 문헌[PNAS 116:4025 ])를 사용하여 분석될 수 있다. 이 어서, 자연도에 대한 상위 및 하위 10% 서열이 비교될 수 있으며, 여기에서 개발가능성 실패의 고갈 및 풍부도 가 각각 관찰되어, 자연도와 개발가능성 사이의 연관성을 나타낼 수 있다. 당업자는 다른 특징부가 비교될 수 있고, 잠재적으로 상관될 수 있음을 이해할 것이다(예를 들어, 응집, 점도, 열안정성, 산화 등). 도 4i는 일부 양태에 따른 예시적인 자연도 및 면역원성 상관 차트를 도시한다. 일부 양태에서, 본 모델링 기술 을 사용하여 항체 자연도와 면역원성 사이의 관계가 탐색될 수 있다. 예를 들어, 모델은 CDR-단독 모델을 사용 하여 기원에 의해 분류된(Marks 등의 문헌[Bioinformatics 37:4041 ]) 인간에게 투여된 (I, II, III상 또는 임상적으로 승인된) 치료 항체의 자연도를 채점할 수 있다. 도시된 바와 같이, 완전한 인간 항체는 다른 부류의 항체보다 더 높은 자연도 점수를 제공할 수 있다(차트(490a)). 인간화, 키메라 또는 하이브리드(인간화+키메라) 항체 서열이 발견되지 않을 수 있는 자연도의 임계값이 정의될 수 있다. 이전에 정의된 자연도 임계값 에 따라 분할된, 완전한 인간 항체에 대한 항-약물 항체(ADA) 반응을 나타낸 환자에 대한 보고된 분율(Marks 등 의 문헌[Bioinformatics 37:4041 ])을 분석하여, 자연도가 임계값을 초과할 경우에서의 인간 항체에 대한 낮은 면역원성을 관찰할 수 있으며(차트(490b)), 자연도가 면역원성과 반비례적으로 연관됨을 시사한다. 이는, 잠재적 교란 인자에도 불구하고, 임계치를 초과하는 자연도를 식별하는 능력은 인간 면역계에 의해 거부될 가능 성이 낮은 약물 후보의 식별에 도움이 될 수 있기 때문에, 중요한 결과라고 할 수 있다. 도 4j는 일부 양태에 따른 예시적인 자연도 및 돌연변이 부하 상관 차트를 도시한다. 일부 양태에서, 본 기술은 CDRH3 돌연변이 부하의 함수로서 트라스투주맙 변이체의 자연도를 채점하는 단계를 포함할 수 있다. 돌연변이 부하가 증가함에 따라, 중간값 자연도가 감소할 수 있다. 이러한 관찰은, 개발가능성과 면역원성 간의 이전에 논의된 연관성을 고려할 때, 조합 서열 공간의 무작위 샘플의 더 크고 더 큰 분획이 더 많은 돌연변이가 도입됨 에 따라 하류 개발에 실패할 수 있음을 시사한다. 결과적으로, 항체 변이체의 무작위 샘플을 스크리닝하는 것과 달리, 자연도의 모델 가이드 최적화는 우수한 전략일 수 있다. 도 4k는 일부 양태에 따라, 자연도 데이터로 농축한 경우의 친화도 예측 개선의 예시적인 차트를 도시한다. 모 델에 대한 항체 서열의 예의 공급은, 자연도 점수의 연산을 가능하게 할 뿐만 아니라, 전달 학습을 통한 친화도 예측의 정확도를 증가시켰다. 이를 통해, 라벨링되지 않은 천연 항체 서열 및 트라스투주맙 변이체(차트(492a), 또한 도 4c에 도시됨), 또는 후자(차트(492b))만의 친화도 측정으로 학습된 모델을 사용하여 예측된 KD와 SPR- 측정된 KD 사이에서 관찰된 상관관계를 파악할 수 있다. 도 4l은 일부 양태에 따른 가상 환경에서의 서열 변이체 생성 및 최적화의 예시적인 개념도를 도시한다. 트라스 투주맙 변이체의 친화도 측정으로 학습된 모델은 보지 못했던 변이체의 친화도를 예측하였으므로(서열은 학습 세트에 존재하지 않음, 도 4c), 스크리닝 실험은 가상 환경에서 시뮬레이션될 수 있다. 그러나, 미처리 시뮬레 이션은 정의된 돌연변이 부하 하에서 모든 가능한 서열 변이체의 KD의 완전한 예측을 포함할 것이며, 이는 방대 한 서열 공간으로 인해 비효율적이 될 수 있다. 대안으로서,생성 기술을 사용하면 연산의 단지 일부만을 사용하 여 KD를 최적화할 수 있다. 2개의 기준(예를 들어, 자연도 및 친화도)에 따른 매우 양호한 서열 변이체를 찾기 위해, 유전자 알고리즘은 본 원에 기술된 딥 러닝 모델과 함께 사용되어, 서열 조합으로 서열을 생성할 필요 없이 생산적으로 최상의 서열 변이체를 찾을 수 있다. 본 기술은 KD를 최대화하거나, KD를 최소화하거나, 특정 KD 값을 찾는 데 사용될 수 있 음을 이해해야 한다. 도 4m은 일부 양태에 따라 트라스트주맙으로부터 친화도를 예측하는 예시적인 차트를 도시한다. 도 4m은 트라스 투주맙 서열의 시작점으로부터, 트라스투주맙 CDRH3 서열 변이체의 친화도 측정으로 학습된 모델에 의해 구동되 는 KD의 점진적 최적화(최소화, 최대화 또는 특정 값으로의 조정)를 도시한다. 도 4n은 일부 양태에 따라 상이한 부모 항체로부터 친화도를 예측하는 예시적인 차트를 도시한다. 도 4n은 트라 스투주맙 변이체의 다수의 시작점으로부터 유래되고, 각각의 KD의 크기는 3차수 규모인, 트라스투주맙 CDRH3 서 열 변이체의 친화도 측정으로 학습된 모델에 의해 구동되는 KD의 점진적 최적화(최소화 또는 최대화)를 도시한다. 도 4o는 일부 양태에 따라 친화도 및 자연도를 최적화하는 것을 예시적으로 시각화하여 도시한다. 도 4o는 트라 스투주맙 CDRH3 서열 변이체의 공동 최적화, 즉 KD의 최적화(최소화, 좌편향 또는 최대화, 우편향) 및 자연도의 최적화(최대화)를 도시한다. 시작점(검은 점)은 트라스투주맙 서열이었다. 전술한 바와 같이, 본 기술은 결합 친화도를 예측하는 딥 러닝 모델을 포함한다. 일부 양태에서, 본 기술은 HT 및 SPR 데이터에 기초하여 다수의(예를 들어, 3개의) 친화도 예측 모델을 학습시키는 단계를 포함한다: 하나는 SPR만을 사용하고, 하나는 HT 데이터만을 사용하고, 다른 하나는 다중-과제 설정으로 둘 모두를 사용한다. 이러 한 양태에서, 모델 성능은 다음 2개의 질문을 다루는 방향으로서 평가될 수 있다. 첫째, 자체 예측, 또는 모델 이 학습을 지도하는 데 사용된 데이터를 얼마나 양호하게 재현(교차 검증)하는가? 및 둘째, KD 예측, 또는 모델 이 실제 KD(SPR로 측정됨)를 얼마나 양호하게 예측하는가? 경험적 연구는 본원에서 논의된 모델이, 트라스투주 맙 친화도 예측에 대한 성능 통계(예를 들어, 여기에서 SPR 측정치를 포함하는 데이터 포인트는 HT 측정치를 또 한 포함하며, 결과적으로 총 조합된 학습 세트 크기는 5689개임)를 나타내는, 다음의 표와 도 4p에 도시된 바와같이, 상당한 수의 크기(예를 들어, 4개 차수)에 걸쳐 자체 예측과 실제 KD 예측에 대해 강력하게 예측할 수 있 음을 입증한다:"}
{"patent_id": "10-2024-7026560", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "KD 예측에 대한 HT 모델은 실험실 측정 데이터의 예측력과 유사할 수 있다. 일부 양태에서, 3개의 모델 중, 조 합된 다중-수행 모델은 최상의 KD 예측 성능을 나타냈다. 종래의 기술과 관련하여 논의된 바와 같이, 후보 생체분자(예를 들어, 항체)를 치료 약물로 개발하는 것은, 특 히 이들 위험을 모델링하는 것과 관련된, 위험이 높은 복잡한 과정이다. 본 기술은 천연 시스템에서 항체의 예 를 사용하여 생산적인 패턴을 모델링하고 이들 문제를 완화시킬 수 있다. 예를 들어, 본 기술은 (예를 들어, 천 연 OAS 서열에 기초한) 전술한 사전-학습 기술을 사용하여 \"자연도\"에 대한 새로운 서열을 평가하는 단계를 포 함할 수 있다. 이어서, 이러한 자연도 측정은 가상 환경 최적화를 위한 추가 측정으로서 사용될 수 있다. 일부 양태에서, 자연도 점수의 유용성을 결정하기 위해, 본 기술은 치료 결과에 대한 독립적인 척도를 평가할 수 있다(예를 들어, 항체 개발 가능성에 대한 5가지 기준을 보고하는 문헌 참조[the Therapeutic Antibody Profiler (TAP) (Raybould 등, 2019)]). 일부 양태에서, 본 기술은 파지 디스플레이 라이브러리로부터의 서열에 대해 자연도과 TAP 사이에 강력한 연관성이 있음을 입증하며(Liu, G., Zeng, H., Mueller, J., Carter, B., Wang, Z., Schilz, J., Horny, G., Birnbaum, M. E., Ewert, S., 및 Gifford, D. K.의 문헌[Antibody complementarity determining region design using high-capacity machine learning. Bioin-formatics, 36:2126-2133], 2019a 11월. doi: 10.1093/bioinformatics/btz895. URL https://doi. org/10.1093/bioinformatics/btz895.), 여기에서 높은 자연도 도메인(10번째 백분위수)에서 하나 이상의 개발 가능성 기준에 실패하는 서열의 수는 낮은 자연도 도메인(90번째 백분위수)에서의 해당 실패 서열의 수에 비해 절반에도 미치지 않는다(7.6% 대 17.8%). 또 다른 예에서, 제2 평가는 임상 단계 항체에 대한 HEK-293 세포주의 생산 역가에 대한 연구의 시퀀스를 사용할 수 있다(Jain, T., Sun, T., Durand, S., Hall, A., Houston, N. R., Nett, J. H., Sharkey, B., Bobrowicz, B., Caffry, I., Yu, Y., Cao, Y., Lynaugh, H., Brown, M., Baruah, H., Gray, L. T., Krauland, E. M., Xu, Y., Vasquez, M., 및 Wittrup, K. D.의 문헌[Biophysical properties of the clinical-stage antibody landscape. Proceedings of the National Academy of Sciences, 114:944-949], 2017년 1월. doi: 10.1073/pnas.1616408114. URL https://doi.org/ 10.1073/pnas.1616408114.). 이 경우, 경험적 증거는 높은 자연도 도메인의 서열이 낮은 자연도 도메인(180 mg/L 대 130 mg/L)과 비교하여 1/3 초과만큼 증가된 생산 역가를 나타냈다는 것을 보여주었다. 또 다른 예에서, 자연도는 Marks 등(Marks, C., Hummer, A. M., Chin, M., 및 Deane, C. M.의 문헌[Humanization of antibodies using a machine learning approach on large-scale repertoire data. Bioinformatics, 37:4041-4047], 2021년 6월. doi: 10.1093/ bioinformatics/btab434. URL https://doi.org/ 10.1093/bioinformatics/btab434)에 의해 컴파일링된 217개의 치료 항체에 대해 보고된 면역원성 척도에 대해 평가될 수 있다. 경험적 증거는 천연 서열의 상위 사분위수가 하위 사분위수에 비해 면역원성일 가능성이 절반임을 입증하였다(ADA 면역원성 중앙값 2.6% 대 5.4%). 또한, 본 기술은 스크리닝 및 모델 가이드 설계에 의한 개선된 항체를 입증하였다. 예를 들어, 고 처리량 농축 에 이어지는 SPR로 이루어진 초기 스크리닝은 야생형(n=87)보다 높은 결합 친화도를 갖는 여러 서열을 식별하였 다. 이는 본 SPR 모델이 해당 범위에서 신규 서열을 예측할 수 있게 하였다. 본 기술을 사용함으로써, 강력한 결합제, 심지어 이를 학습하는 데 사용된 실험실 검정에서 나타난 것을 능가하는 KD 값에 가진 결합제를 식별할 수 있다. 본 기술은, 야생형 트라스투주맙보다 높은 측정된 친화도 값을 갖는 모든 데이터를 홀드-아웃 세트로 따로 설정 하는 단계, 이어서 나머지 데이터를 사용하여 모델을 학습시키는 단계, 및 학습 및 홀드-아웃 세트 둘 모두의 친화도를 예측하는 단계에 의한, 결과 시험을 포함할 수 있다. 일부 양태에서, 일부 모델은 (해당 데이터 포인트가 모델이 경험한 분포를 벗어나기 때문에) 홀드-아웃 데이터 포인트의 정확한 KD 예측을 수행하지 못할 수 있 다. 그러나 일부 모델은 도 4q에 나타낸 바와 같이, 이러한 포인트를 예측 범위의 상단 근처에 배치함으로써, 서열 공간을 가상으로 스크리닝하고, 추가적인 실험실 실험을 사용하여 예측 범위를 확장시킬 수 있다. SPR 모 델의 실용적 가치를 뒷받침하기 위해, 야생형 결합 친화도보다 더 높은 것으로 예측된 다수의 서열을 경험적으 로 시험하였다. SPR 스크리닝은 이들 서열의 76%가 야생형보다 더 높았고 예측의 94%가 해당 측정된 값의 0.5배 이내임을 확인하였다. 예시적인 결과 도 5a는 일부 양태에 따른 예시적인 AI-증강 항체 최적화 다이어그램을 도시한다. 도 5a는 qaACE 및/또는 SPR 측정치가 공급된 딥 러닝 모델이 신규 서열 변이체의 친화도를 정량적으로 예측할 수 있으며, 이에 의해 원 하는 결합 특성을 갖는 항체의 가상 환경 설계를 가능하게 한다는 것을 나타낸다. 심층 언어 모델은 서열 변이 체의 결합 친화도를 예측할 수 있다. 본 기술은 인공 지능(AI)이 실험 데이터로부터 생물학적 서열의 변이체(예 컨대 항체)와 정량적 판독(예컨대 결합 친화도) 사이의 맵핑을 학습할 수 있다고 가정하였다. 도 5a에 도시된 바와 같이, 이러한 기능으로, AI 모델을 사용하여 신규 서열 변이체에 대한 가상 환경 실험을 시뮬레이션함으로 써, 보다 방대한 서열 공간에 액세스하여 원하는 특성을 가진 더 많고 더 양호한 변이체를 훨씬 짧은 시간과 비 용으로 식별할 수 있게 된다. 딥 러닝 모델의 학습은 일반적으로 대용량의 고품질 데이터세트를 필요로 한다. 항체 결합 친화도에 대한 고 처 리량 측정을 생성하기 위해, 본 기술은, 예를 들어 아래의 도 5b에 나타낸 바와 같은, 친화도를 기반으로 항체 변이체를 분류하는 형광 활성화 세포 분류(Fluorescence-Activated Cell Sorting, FACS) 및 차세대 시퀀싱 (NGS) 방법인 활동 특이적 세포 농축(Activity-specific Cell-Enrichment, ACE) 분석(또는 qaACE 분석)을 개발 하고 통합하였다. 일부 양태에서, 해당 검정은 선행 연구[s20]의 개선된 버전이다. qaACE는 SoluProTM 대장균 B 균주에서 접힌 항체의 세포내 가용성 과발현을 활용한다. 항체 변이체를 발현하는 세포는 고정되고, 투과화되고, 변이체의 친화도 및 역가에 기초하여 세포의 동시 구별을 가능하게 하는 형광 표지된 항원 및 스캐 폴드 프로브로 염색된다. 변이체 라이브러리는 이들 신호에 기초하여 분류되고 정렬된다. 이어서, 수집된 DNA 서열은 PCR을 통해 증폭되고 시퀀싱된다. ACE 점수는 시퀀싱 리드 계수로부터 계산된다(방법, 아래 참조). qaACE 친화도 점수는 결합 친화도에 비례하며, 아래의 도 6f와 관련하여 논의된 바와 같이 표면 플라스몬 공명(SPR) KD 측정치와 높은 상관관계를 갖는다. 서 열 친화도 관계가 모델링되고 예측될 수 있는지의 여부를 평가하기 위해, 본 기술은 단편 항원 결합(Fab) 포맷 으로 HER2-결합 항체 트라스투주맙의 변이체를 생성하는 것을 포함한다. CDRH2 및 CDRH3의 돌연변이 유발은 이 들 영역이 일반적으로, 그리고 트라스투주맙에 대해 가장 높은 밀도로 파라토프 잔기를 수용하기 때문에 우선적 으로 선택되었다. 본 연구 전반에 걸쳐, 시스테인을 제외한 모든 천연 아미노산을 허용하여, 최대 5개의 동시 아미노산 치환이 부모 항체에 (부모 항체의 최대 2개의 CDR에) 무작위로 도입되었다(시스테인은 잠재적인 이황"}
{"patent_id": "10-2024-7026560", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "화 결합 관련 결찰을 피하기 위해 제외됨).다음 표는 해당 예에서의 모델 학습에 사용된 데이터세트를 요약한다:"}
{"patent_id": "10-2024-7026560", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "위의 데이터세트 표는 트라스투주맙 변이체 데이터세트; 특히 모델을 학습하고 평가하는 데 사용된 데이터세트 의 특성을 나타낸다. 위치 호스팅 치환(IMGT 넘버링), 동시 치환의 수(돌연변이 부하) 및 허용된 아미노산(모두 시스테인 제외)은 서열 공간의 조합 복잡도를 결정한다. qaACE 또는 SPR에 의한 스크리닝을 위한 라이브러리를 구축하기 위해 표시된 설계 전략에 따라 조합 서열 공간으로부터 서열의 서브세트를 샘플링하였다. 스크리닝 및 분석 시 QC 통과 아미노산 서열 변이체의 수가 돌연변이 부하에 의해 세분화되어 도시되어 있다. * 조합 공간의 무작위 샘플링. ** trast-1 데이터세트로부터의 친화도에 의한 균일한 샘플링. *** 돌연변이 부하 빈의 정의된 유병률을 사용한, 돌연변이 부하 빈당 조합 공간의 무작위 샘플링, 사중 및 오중 돌연변이체는 최대 삼중 돌연 변이체로 학습된 모델로부터의 예측 성능을 평가하는 데에만 사용되었다. 고 처리량(HT) qaACE 데이터에 더하여, 본 기술은 또한 저 처리량이지만 매우 정확한 SPR KD 판독치를 활용하여 결합 친화도를 평가하였다. SPR은 (i) ACE로 일차 스크리닝 시 서열 변이체의 표적화된 재스크리닝; 및 (ii) 모 델 예측의 검증을 위해 사용되었다. 이러한 워크플로우에 대한 개념 증명으로서, 본 기술은 트라스투주맙 CDRH3의 8개 위치에 걸쳐 최대 2개의 돌연 변이를 갖는 모든 서열 변이체를 함유하는 라이브러리를 포함한다. 도 6a는 해당 라이브러리의 다이어그램을 도 시한다. 도 6a는 ACE를 사용하여 스크리닝된, 트라스투주맙의 CDRH3의 8개 위치에서 최대 이중 돌연변이체인, trast-1 데이터세트의 조합 돌연변이 유발 전략을 예시한다. 도 6b는 나머지 10%의 서열에 대해 평가된, 90%의 trast-1로부터의 변이체의 qaACE 점수에 대해 학습된 모델의 예측 성능을 도시한다. qaACE 검정을 사용하여, 본 기술은 8,932개의 변이체(조합 공간의 97%)의 결합 친화도를 측정하여 위의 표의 trast-1 데이터세트를 생성하였다. 본 기술은 trast-1 데이터세트의 90%를 사용하여 심층 언어 모델을 학습시키고, 나머지 10%의 홀드-아웃 데이터를 사용하여 모델 예측을 평가하였다. 홀드-아웃 데이 터세트에 대한 측정 및 예측된 qaACE 점수는 높은 상관관계가 있었으며, 이는 도 6b에 도시된 바와 같이 해당 언어 모델이 높은 정확도로 결합 친화도를 예측할 수 있음을 나타낸다. 도 6c는 복제물 qaACE 측정치와 일부 양태에 따라 개별 qaACE 복제물을 이용해 학습시킨 모델로부터 예측한 qaACE 점수의 비교 분석을 도시한다. 이론적 최적(상관관계에 대해 1, 97 RMSE에 대해 0)으로부터의 회귀 메트 릭의 임의의 편차는 예측의 부정확성 및 측정의 부정확성 둘 모두에 의해 발생한다. 이러한 두 가지 효과를 해 결하기 위해, 본 기술은 예를 들어 도 6d에 나타낸 바와 같이 본원에 개시된 모델의 예측 성능을 평가하기 위해 이전에 사용된 동일한 메트릭을 사용하여 측정 복제물 사이의 일치를 고려할 수 있다. 특히, 측정 복제물의 일 치와 관련하여 모델 성능을 평가하는 것은 도 6c 및 도 6e에 나타낸 바와 같이, 예측과 측정 사이의 대부분의 오류가 실험적 노이즈에 기인할 수 있음을 나타낸다. 도 6a-b에서 평가된 홀드-아웃 세트는 trast-1 데이터세트로부터 무작위로 추출되었다. 따라서, 학습 및 홀드- 아웃 세트는 qaACE 점수의 유사한 분포를 가졌으며, 대부분의 돌연변이의 유해한 효과로 인해 저친화도 결합제 의 유병률을 나타냈다. 이러한 학습 및 홀드아웃 세트의 설계는 모델이 가상 환경에서 실험을 시뮬레이션할 수 있는지의 여부에 대한 문제를 해결하였다. 그러나, 보다 도전적인 시험은 결합 친화도에 대해 균일하게 분포된 홀드-아웃 세트를 사용하여 예측을 평가하는 것을 필요로 할 것이다. 이러한 홀드-아웃 세트는 학습 세트에 비 해 보다 강한 결합제로 풍부해질 것이다. 새로운 홀드-아웃 세트에서 약한 결합제의 유병률을 감소시키기 위해, 본 기술은 trast-1 데이터세트로부터 >200개의 서열을 샘플링하였다. 샘플링된 서열을 SPR로 재스크리닝하여 위 의 데이터세트 표에 나타낸 trast-2 데이터세트를 생성하였다. 도 6f는 일부 양태에 따른, qaACE 친화도 점수와 로그 변환된 SPR KD 측정치 사이의 상관관계를 도시한다. 특히, 도 6f는 trast-2와 교차하는 서열 변이체에 대한 trast-1로부터의 qaACE 점수를 나타내는 플롯을 포함한 다. 경험적 연구로부터, 도 6f에 나타낸 바와 같이, trast-2 서열의 qaACE 점수와 SPR-유래 - log10 KD 값 사이 에 강한 일치가 관찰되었으며, 이는 해당 데이터세트의 거의 균일한 분포를 입증한다. 도 6g는 일부 양태에 따른, 결합 친화도(패널 도 6f에 나타낸 서열에 대한 trast-1의 ACE 점수)에 대해 균일하 게 분포된 홀드-아웃 세트에 대한 예측 성능을 도시한다. 도 6g에 나타낸 바와 같이, 본 기술은, 강력한 예측 성능이 확인된, trast-1 qaACE 점수로 학습된 모델에 대한 홀드-아웃 세트로서 trast-2 서열을 사용하는 것을 포함할 수 있다. 일반적으로, 본 기술은 SPR-생성된 trast-2 데이터세트로 학습된 심층 언어 모델이 도 7a-7d에 나타낸 바와 같 이, 항체 결합 친화도를 정량적으로 예측한다는 것을 입증하며, 여기에서 성능은 풀링된 10-배 교차 검증을 통 해 평가된다. 특히, 도 7a는 SPR-측정된-log10 KD 값에 대해 학습된 모델로부터의 예측을 도시하고; 도 7b는 개 별 SPR 복제물에 대해 학습된 모델로부터 예측된 복제물-log10 KD 측정 및 -log10 KD의 비교 분석을 도시하고; 도 7c는 log10 kon 값에 대해 학습된 모델로부터의 예측을 도시하며; 도 7d는 - log10 koff 값에 대해 학습된 모델로 부터의 예측을 도시한다. 일부 양태에서 SPR 측정이 수집되기 때문에, 도 6f에 도시된 trast-2 데이터세트와 같이, 본 기술은 이러한 데 이터세트 단독만으로 결합 계수를 직접적으로 예측하기 위해 심층 언어 모델을 학습시키는 것이 충분한지의 여 부를 조사하는 데 사용될 수 있다. 데이터세트의 비교적 작은 크기(n=215)로 인해, 모든 모델은 10-배 교차 검 증을 사용하여 학습될 수 있으며, 풀링된 배수 이탈 예측을 사용하여 모델 성능은 평가되었다. 예를 들어, 본 기술은 - log10 KD 값을 예측하기 위해 모델을 먼저 학습하는 데 사용되었으며, 이를 통해, 도 7a에 나타낸 바와 같이, 측정된 값과 예측된 값 사이의 상관 관계가 고 처리량 trast-1 데이터세트에서 관찰된 것보다 약간 낮음 을 발견하였다. 그러나, 예측된 결합 친화도의 87%는 각각의 측정된 값으로부터 로그의 절반 미만만큼의 편차를 나타냈다. trast-1과 유사하게, 본 기술은 예를 들어 도 7b, 도 7e 및 7f에 나타낸 바와 같이 측정 복제물 간의 일치 정도로 정의된 최상의 성능과 관련하여 trast-2 결과를 평가하는 것을 포함할 수 있다. 평형 결합 상수에 더하여, SPR은 결합(kon) 및 해리(koff) 계수를 제공한다. 도 7c 및 7d; 및 도 7h-7j 및 도 7k-7m에 나타낸 바와 같이, 이러한 계수를 예측하도록 학습된 모델 또한 양호한 성능을 나타냈으며, 이는 본 AI 기반 기술이 전반적인 결합 친화력뿐 아니라 결합 및 분리 특성의 특정 조작을 지원할 가능성이 있다는 것을 입 증한다. 도 7h-7j는 trast-2 SPR 데이터세트에서의 복제물 간의 측정된 값 및 예측된 log10kon 값의 비교를 도시 한다. 도 7k-7m은 trast-2 SPR 데이터세트에서의 복제물 간의 측정된 값 및 예측된 log10koff 값의 비교를 도시 한다. kon에 대해 관찰된 더 낮은 상관 계수는 관찰된 변동의 작은 범위로 인한 것임을 유의한다. 일관적으로, 측정 복제물의 일치 또한, koff 보다 kon에서 더 낮으며, 이는 예측 성능을 평가할 때 측정 노이즈를 고려할 필요 성을 추가로 강조한다. 마지막으로, 본 기술은 2개의 친화도 데이터 유형으로 동시에 학습된 모델이 단일 데이터 유형으로만 공급된 모 델의 성능을 개선할 수 있는지 여부를 결정할 수 있게 한다. 이러한 목적을 위해, 예를 들어, 본 기술을 사용하 여 모델을 학습시켜 다중 작업 설정으로 qaACE(trast-1) 및 SPR(trast-2) 데이터 둘 모두를 사용하여 - log10KD 값을 예측하였다. 경험적 연구에 따르면, 해당 모델은 도 7g에 나타낸 바와 같이, trast-2 SPR 데이터 단독으로 학습된 모델에 비해 약간 더 우수한 성능을 나타냈다. 도 7g는 trast-2로부터의 SPR 데이터를 사용하여 학습된 모델, 또는 ACE(trast-1) 및 SPR(trast-2) 데이터 둘 모두를 사용하여 공동 학습된 모델을 도시할 수 있으며; 여기에서 각각의 배수 이탈 검증 세트에서 서열의 -log10KD 값을 예측하는 10-배 교차 검증을 사용하여 평가되었고/되었거나; 여기에서 예측은 배수에 걸쳐 조합되었고 SPR-측정된 -log10KD 값과 비교되었다. 일부 양태에서, trast-1 및 trast-2 데이터세트에 대해 학습된 모든 모델은 OAS 데이터베이스로부터의 면역글로 불린 서열에 대해 사전학습된 심층 언어 모델이다(방법, 아래 참조). 양태에서, 이들 모델은 trast-1 데이터세 트로부터 90:10 학습:홀드-아웃 분할 또는 trast-2 데이터세트로부터 풀링된 10-배 교차 검증을 사용하여 베이 스라인과 비교될 수 있다. 예를 들어, 본 기술은 사전학습(즉, 무작위로 초기화된 가중치) 없이 동일한 아키텍 처를 갖는 심층 언어 모델을 먼저 학습하여 전달 학습의 영향을 평가하는 데 사용될 수 있다. 두번째로, XGBoost 모델은 심층 언어 모델이 \"얕은\" 머신 러닝에 비해 예측 정확도를 향상시켰는지의 여부를 결정하도록 학습될 수 있다. 일부 양태에서, 사전 학습된 모델은, 도 7n 및 도 7o에 나타낸 바와 같이, trast-1 및 trast-2 데이터세트 둘 모두에 대해 두 베이스라인보다 성능이 뛰어났으며, 이전 관찰 결과[23]와 일치하여, 더 작 은 trast-2 데이터세트에서 보다 강력한 이점이 확인되었다. 예를 들어, 도 7n 및 도 7o는 베이스라인 대비 사전학습된 언어 모델 성능의 비교를 도시하며, 여기에서 OAS 사 전학습된 심층 언어 모델의 2개의 예측 성능을 2개의 베이스라인과 비교하였다: 동일한 아키텍처를 갖지만 무작위로 초기화된 가중치를 갖는 심층 언어 모델, 및 XGBoost 모델. 일부 양태에서, 모델은 trast-1 데이 터세트로부터의 ACE 점수의 90:10 학습:홀드-아웃 분할, 또는 trast-2 데이터세트로부터의 -log10KD \"\"값과의 10-배 교차 검증을 사용하여 학습되고 평가되었다. 사전학습이 모델 성능을 개선하는 이유의 이해에 있어서, 본 기술은 사전학습 대 사전학습 없음, 및 미세 조정 대 미세 조정 없음의 모든 조합으로부터의 모델 임베딩을 검사하는 데 사용될 수 있다. 미세 조정이 없더라도, OAS 사전학습으로부터의 임베딩은 높은(또는 낮은) 결합 친화도에 대해 풍부한 구별되는 패치를 갖는 구조를 갖 는 것으로 보인다. 이러한 조직은, 대체적으로 결합 친화도에 대한 모델 임베딩의 구조를 도시하며, 임베딩은 trast-2 데이터세트의 서열을 사용하여 순방향 패스로 계산되었고, UMAP으로 2차원으로 축소하고 결합 친화도 측정에 의해 그래픽으로 코딩된, 도 7p-7s에 나타낸 바와 같이, 결합 데이터로 후속적인 미세 조정을 단순화하 며, 이에 따라 모델 가중치를 보다 용이하게 업데이트함으로써 향상된 결합 친화도 예측을 제공할 수 있다. 모델 가이드 설계에 의해 발견된 개선된 항체 변이체 전술한 바와 같이, 본 기술은 홀드-아웃 세트 및 교차 검증을 사용하여 AI 예측 성능을 입증한다. 본 기술은 모 델을 사용하여 원하는 결합 특성을 갖는 서열 세트를 설계한 다음 전용 SPR 실험을 이용한 검증으로 추가로 입 증한다. 예를 들어, 일 양태에서, 본 기술은 평형 해리 상수의 2개 차수 규모에 걸쳐 있는 설계 서열을 갖는 trast-2 데이터세트에 대해 학습된 모델을 학습시킬 수 있다(본원에서 설계 세트 A로 지칭됨). 일반적으로, 모델 가능 설계는 조합 서열 공간에서 완전 예측을 수반하고, 이에 이어서 요건과 일치하는 예측된 결합 친화도를 갖는 서열을 샘플링하는 것을 포함한다. 도 8a-8d는, 일부 양태에 따른, SPR 생성 trast-2 데이 터세트로 학습된 심층 언어 모델이 독립적인 SPR 실험에서 검증되는 보지 못했던 서열 변이체를 설계할 수 있음 을 도시한다. 도 8e-8h는, 도 8a-8d에 나타낸 것과 같이, SPR 생성 trast-2 데이터세트로 학습된 심층 언어 모 델이 독립적인 SPR 실험에서 검증되는 보지 못했던 서열 변이체를 설계할 수 있음을 도시한다. 경험적으로, 본 기술은, 도 8a, 8e 및 8f에 나타난 바와 같이, 설계 세트 A에 대해 예측과 검증 간에 우수한 일치를 발견하였다. 본 기술은 트라스투주맙보다 더 강한 결합을 갖는 변이체를 탐구함으로써, 보다 도전적인 설계를 입증하는 데 추가로 사용될 수 있다(본원에서 설계 세트 B로 지칭됨). 예를 들어 이전 설계의 경우, 본 기술을 사용하여 SPR 로 50개 시퀀스를 검증한 결과, 도 8b-c 및 다음 표에 나타낸 바와 같이, 변이체의 74%가 실제로 부모 항체보다 더 단단한 결합제였으며, 도 8c 및 도 8g에 나타낸 바와 같이, 0.5 log 미만의 허용 오차 내에서 이의 100%가 설계 사양을 만족시켰음을 발견하였다. 전술한 설계 B 서열 변이체 표는 설계 세트 B로부터의 50개의 설계되고 검증된 트라스투주맙 서열 변이체를 열 거한다. 참조를 위해, 부모 트라스투주맙의 예측되고 검증된 - log10KD는 각각 8.3 M 및 8.25 M이었다. 이러한 성능은 복제물 측정과 비교했을 때 경쟁력이 있으며; 제1 복제물로부터의 실험 측정을 기반으로 보다 단 단한 결합제를 선택한 경우, 제2 복제물 측정에서 유사한 분율이 보다 낮은 결합 친화도를 가지게 될 것이다(도 8h). 해당 설계의 작은 - log10KD 범위로 인해, 도 8g에 나타낸 바와 같이, 예측치와 측정치 간의 상관관계는 낮다. 그러나, 전술한 kon 모델링에서 이전에 유사하게 관찰된 바와 같이, 그리고 도 7h-7j 및 도 8h에 나타낸 바와 같 이, 친화도 범위가 좁은 모든 경우에서, 측정 복제물 또한 서로에 대해 낮은 상관관계를 나타낸다. 상관관계와 대조적으로, RMSE와 같은 다른 실험 메트릭 및 측정 대비 0.5 log 미만으로 벗어난 예측 분율은 도 8g에 나타낸 바와 같이 이전에 관찰된 성능과 일치했다. 일부 양태에서, 이들 메트릭은 대체적으로 좁은 친화도 범위로 패킹 된 서열 세트로 작업 시 보다 유익하다. 도 8i에 나타낸 바와 같이, 설계 세트 B의 검증 속도는 트라스투주맙보다 더 단단한 결합제의 분율이 최소한인 라이브러리 스크리닝에 대한 미노출 접근 방식 대비 매우 유리하게 비교를 수행한다. 구체적으로, 도 8i는 미노 출 라이브러리 스크리닝에 비해, 원하는 결합 특성을 갖는 변이체에 대해 강력하게 풍부화된 것으로 나타난 모 델 예측 차트를 도시한다. 도 8i에서, 설계 세트 B에서의 관심 서열은 부모 트라스투주맙보다 HER2에 보다 단단 히 결합하는 항체 변이체(즉, 상위 결합제)로서 정의될 수 있다. 도 8c는 설계 세트 B의 검증 속도에 대해 조정 된, 전체 조합 공간에 대한 모델 예측에서 상위 결합제의 분율에 의해 추정된 바와 같은, 조합 공간(즉, 실험실 단독 스크리닝)에서의 상위 결합제의 유병률 대비 설계 세트 B(즉, AI 보조 스크리닝)에서의 상위 결합제의 검 증 속도를 도시한다. 도 5에 나타낸 바와 같이, 관심 변이체에 대한 모델 예측이 제공하는 강력한 농축은 가상 환경 실험과 AI 보조 항체 최적화를 가능하게 하는 핵심 발견이다. 언급된 바와 같이, 서열 세트 B를 설계하는 데 사용되는 모델은 트라스투주맙보다 강한 일부 결합제를 포함하는 trast-2 데이터세트에 대해 학습될 수 있다(도 7a). 따라서, 일례에서, 본 기술은, 설계할 대상 모델만큼 극단 적인 (친화도 기준) 서열을 전혀 공급받지 않은 모델이 여전히 최상위 결합제에 대한 우선순위를 정할 수 있는 지의 여부를 결정하는 것을 포함할 수 있다. 일부 애플리케이션이 궁극적으로 방대한 서열 공간 및 낮은 양성 유병률에 직면할 수 있으며, 이로 인해 양성 예가 전혀 없는 학습 세트가 생성될 수 있는 가능성을 고려 시, 이 러한 질문은 실질적인 가치를 갖는다. 분포 이탈 친화도 예측 설정으로 본원에 기술된 모델의 성능을 시험하기 위해, 일부 예는 trast-2 학습 세트로 부터 트라스투주맙보다 더 단단한 임의의 결합제를 드롭하는 것을 포함할 수 있으며, 이에 이어서, 나머지 데이 터를 사용하여 모델을 학습시키고 설계 세트 B의 친화도를 예측한다. 실험적으로, 예상된 바로는, 이러한 방식 으로 학습된 모델은 설계 B에 대해 더 이상 정확한 KD 예측을 수행할 수 없다. 그러나, 놀랍게도, 도 8d에 나타 낸 바와 같이, 해당 모델은 여전히 그의 알려진 분포의 상단에 설계 B 변이체의 결합 친화도를 위치시킬 수 있 었다. 이러한 결과는, 학습 데이터를 생성하는 실험실 실험이 전체 친화도 범위를 관찰하지 않더라도, 본 기술 의 AI 기반 양태 중 일부는 상위 순위 예측을 샘플링함으로써 상위 결합제의 우선 순위 지정을 여전히 수행할 수 있음을 입증한다. 보다 방대한 서열 공간으로 확장할 경우 AI 예측 성능은 유지됨 도 9a-9d는 일부 양태에 따라, ACE-생성 trast-3 데이터세트로부터의 고 처리량 결합 점수는 보다 방대한 돌연 변이 공간으로 예측 능력을 확장할 수 있음을 도시한다. 다른 예에서, 방대한 서열 공간에서의 모델의 성능을 시험하기 위해, 본 기술을 사용하여 CDRH2 및 CDRH3에서의 각각 10개의 아미노산에 걸쳐 최대 3개의 돌연변이의 조합 돌연변이 유발을 수행할 수 있었다. 이러한 예는, 전술한 trast-3의 데이터세트 및 도 9a에 나타낸 바와 같이, 해당 서열 공간의 1% 미만의 샘플링에 의한 라이브러리의 작제, 및 qaACE 검정을 사용하는 샘플링된 서열 변이체의 결합 친화도 측정을 포함하였다. 해당 예는, trast-3 데이터의 80%를 사용하는 모델의 학습, 및 나머 지 20%의 홀드-아웃 서열에 대한 이의 성능 평가를 추가로 포함할 수 있다. 실험적으로, 모델 성능은 이중 돌연 변이체 라이브러리와 유사하였다(도 9b). 음성 대조군으로서, 도 9e에 나타난 바와 같이, qaACE 점수가 무작위로 셔플링된 데이터 집합을 사용하여 학습 시킨 모델은 예측 능력이 없다는 것이 확인되었다. 구체적으로, 이러한 방식으로 학습된 모델은 무작위로 셔플 링된 데이터로부터 ACE 점수를 예측할 수 없다. trast-3 서열 공간은 매우 방대하기 때문에, qaACE 점수와 SPR 에 의해 측정된 - log10KD 값 사이의 높은 상관관계는 이미 입증되었으므로, 모든 모델을 qaACE 데이터 단독으로 학습시키고 평가하였다(도 6f 참조). 원래 트라스투주맙 서열로부터 최대 3개의 돌연변이를 갖는 변이체에 대한 trast-3 모델의 예측 정확도를 고려 하여, 해당 모델이 트라스투주맙으로부터 4개 또는 5개의 돌연변이를 갖는 변이체의 qaACE 점수를 정확하게 예 측할 수 있는지의 여부를 시험하기 위한 실험을 또한 수행하였다(도 9c). 예를 들어, 도 9f는 일부 양태에 따른, 사중 돌연변이체 세트에 대한 예측 성능을 도시한다. 도 9g는 일부 양태 에 따른, 오중 돌연변이체 세트에 대한 예측 성능을 도시한다. 도 9f 및 도 9g에서, 모델은 부모 트라스투주맙 서열의 최대 삼중 돌연변이체의 trast-3 데이터세트에 대해 학습될 수 있으며, 예를 들어 각각 사중 또는 오중 돌연변이체의 홀드-아웃 세트에 대해 평가될 수 있다. 나타낸 바와 같이, 일부 양태에서, 모델은 도 9f에 나타낸 바와 같이, 삼중 돌연변이체보다 약간 낮은 정확도로 사중 돌연변이체의 qaACE 점수를 예측할 수 있다. 예를 들어, 도 9g에 나타낸 바와 같이, 오중 돌연변이체에 대 한 예측 정확도는 훨씬 낮았지만, 모델은 분류 설정으로 높은 결합제와 낮은 결합제를 구별하는 데 있어서 여전 히 사용될 수 있었다. 이들 결과는 삼중 돌연변이체 모델이 외삽됨으로써 원래 서열로부터 최대 4개의 동시 돌 연변이에 대한 결합 점수를 정량적으로 예측하고, 5개의 돌연변이에 대한 결합 점수를 정성적으로 예측할 수 있 음을 나타낸다. 돌연변이 거리가 증가함에 따라, 도 9f 및 도 9g에 도시된 바와 같이, 특히 친화도가 낮은 변이 체의 경우, 모델 정확도가 저하된다. 심층 언어 모델은 고도로 샘플 효율적임 일반적으로, 임의의 딥 러닝 모델의 예측력은 학습 데이터의 품질 및 양에 크게 의존한다. trast-3 데이터세트 는, 전술한 데이터세트 표에 나타낸 바와 같이, 해당 설계를 위한 완전한 조합 돌연변이 공간의 0.7%를 커버하 는, 약 50,000개의 고유 항체 서열에 대한 결합 친화도를 포함한다. 모델 성능과 학습 데이터세트의 품질 및 양 사이의 관계를 결정하기 위해, 일부 예는 도 9d에 나타낸 바와 같이, 다양한 충실도의 데이터세트로부터 샘플링된 다양한 데이터세트 크기로부터 친화도를 예측하기 위해 모델 코호트를 학습시키는 단계를 포함할 수 있다. 일부 예에서, 원래의 trast-3 데이터세트는 고충실도 데이터세트로서 처리될 수 있고, 저충실도 데이터세트는 단일 FACS 분류로부터 각 서열에 대한 단일 DNA 변이체를 단리함으로써 생성될 수 있다(방법, 아래 참조). 해당 예에서, 학습 서브세트의 크기는 44,165개의 서열(전체 233개의 학습 데이터세트) 내지 350개의 서열(전체 학습 데이터세트의 1/128)의 범위일 수 있고, 모델은 고충실도 데이터세트 내의 모든 서열의 10%를 포함하는 공통 홀 드-아웃 검증 데이터세트 상에서 평가될 수 있다. 각각의 학습 서브세트 크기에서, 다음과 같은 4개의 모델의 성능을 비교할 수 있다: 고충실도 데이터세트의 서브세트에 대해 학습된 OAS 사전학습 모델; 저충실도 데이터세트의 서브세트에 대해 학습된 OAS 사전학습 모델; 고충실도 데이터세트의 서브세트에 대해 학습된 무작위 초기화된 모델; 및 저충실도 서브세트의 서브세트에 대해 학습된 무작위 초기화된 모델. 학습 데이터세트의 크기가 감소함에 따라, 모델 성능이 저하되었다. 저충실도 데이터에 대해 학습된 모델은 고 충실도 데이터에 대해 학습된 상대보다 일관되게 보다 불량한 성능을 나타냈으며, 이는 고품질 실험 검정의 중 요성을 강조한다. OAS 데이터세트로 모델을 사전학습시키는 것은 대체적으로 모델 성능을 개선하였지만, 모델이 더 작은 고충실도 데이터세트, 또는 더 큰 저충실도 데이터세트를 사용하여 학습되었을 경우, 사전학습으로부터의 성능 이득은 감 소되었다. 0.8 초과의 Pearson R 상관관계를 유지하기 위해 모델이 적어도 2,760개의 서열을 필요로 한다는 점을 감안하면, SPR 학습 데이터만을 사용하여 이러한 돌연변이 공간을 모델링하는 것은 비실용적이며; qaACE와 같은 고 처리량 검정이 필요하다. Pearson R 상관관계는 잠재적 검색 공간의 적어도 0.4%를 포함하는 모든 고충실도 학습 서브세트에 대해 0.8을 초과하여 유지되었기 때문에, 모델은 학습 데이터세트의 모든 서열에 대해 대략 2,500개의 서열을 예측하는 것을 학습하였다. 따라서, 본 기술의 심층 언어 모델은 실험 데이터세트의 검색 공 간을 적어도 100배만큼 확장시킬 수 있다. 심층 언어 모델은 항체 결합 환경에 대한 해석가능한 분석을 제공함 일단 학습되면, AI 모델은 학습 세트의 설계와 일치하는 조합 공간 내의 모든 서열에 대한 결합 친화도 점수를 예측하기 위한 오라클로서 사용될 수 있다. 신속하고 정확한 예측은 항체가 상이한 조작 전략에 의해 어떻게 영 향을 받을 것인지를 알리고 해당 실험 노력을 가이드하는 데 도움을 줄 수 있다. 트라스투주맙의 돌연변이 환경에 대해 이해하기 위해, 일부 예는 본 기술을 사용하여 CDRH2 및 CDRH3에서 모든 단일, 이중 및 삼중 돌연변이의 효과를 완전히 평가하는 것을 포함할 수 있다. 트라스투주맙은 이의 표적 항원 HER2에 대해 높은 결합 친화도를 갖는다(도 7a에 나타낸 바와 같이 Fab 포맷에서 8.25 M의 - log10KD). 따라서, 도 5에 나타낸 바와 같이, 대부분의 돌연변이는 결합 친화도에 유해한 영향을 미칠 것으로 예측되었다. 다중 돌 연변이를 고려할 경우, 경험적 시험은 도 9h 및 도 9i에 나타낸 바와 같이, 대부분의 조합이 결합 친화도에 유 해한 영향을 미칠 것으로 예측되었음을 시사하였다. 특히, 도 9h 및 도 9i는 위치 55, 107, 111, 112, 및 113이 돌연변이될 때 유해한 효과를 가질 것으로 예측되며, 아래에 논의되는 바와 같이, 다른 돌연변이와 유전자 상호작용하는 경향이 있음을 나타낸다. 이는 이 전의 알라닌 스캐닝 및 구조적 연구[22]와 일치하게, 이들 잔기로부터의 결합 친화도에 대한 강한 기여를 나타 낸다. 참고로, 트라스투주맙에 대한 각각의 개별 돌연변이의 효과는 도 9h 및 도 9i 둘 모두에서 동일한 점으로 표시된다. 각각의 위치에서의 돌연변이는 시스테인을 제외한 천연 아미노산과의 모든 가능한 치환을 포함하며, 이는 알파벳 순으로 분류된다(즉, X ∈ [A, D, E, F, G, H, I, K, L, M, N, P, Q, R, S, T, V, W, Y]). 변이체 전체에 걸쳐 돌연변이의 증분 효과를 분석한 결과, 도 9h 및 도 9i에 도시된 바와 같이 위치 59, 62 및 110이 돌연변이에 대해 상대적으로 내성이 있음이 나타났다. 이는 이들이 결합 친화도에 비교적 작은 기여를 하 였고, 다른 항체 특성을 최적화하기 위한 이상적인 후보일 수 있음을 시사한다. Y57D/E, N62E 또는 T65D/E와 같 은 CDRH2에서의 일부 단일 돌연변이는 결합 친화도를 증가시킬 것으로 예측되었다(도 5 참조). 단일 돌연변이체 에 더하여, 다수의 돌연변이의 조합은 또한 개선된 고친화도 변이체를 제공할 수 있다. 실제로, 돌연변이 부하 가 증가함에 따라, 예측된 고 친화도 서열의 수는 증가하였지만, 이들의 비율은 감소하였다. 예를 들어, 단일 돌연변이체 중 2개(0.56%), 이중 돌연변이체 중 192개(0.31%), 및 삼중 돌연변이체 중 7,063개(0.11%)는 trast-3 데이터세트에서 트라스투주맙보다 더 높은 qaACE 점수를 예측하였다. 본 AI 기반 기술은 트라스투주맙의 고 친화도 변이체의 다양한 클러스터를 식별할 수 있게 한다. 일례에서, 본 기술을 사용하여 고 친화도 서열(예측된 qaACE 점수 >8.0)의 모델-유래 임베딩의 클러스터링 분석을수행하였다. 예를 들어, 도 9j는 임베딩의 고 친화도 클러스터(예측된 ACE 점수 > 8.0)의 조성을 나타내는 서열 로고 플롯을 도시한다. 클러스터는 임베딩의 차원 감소, 이에 이어서 HDBSCAN 클러스터링, 및 평균 예측 ACE 점 수에 의한 분류에 의해 생성될 수 있다. 클러스터당 최소 서열 수가 필요할 수 있다(예를 들어, 40개). 도 9j는 각 클러스터 내의 서열에서 각각의 특이적 치환의 상대 빈도를 나타낸다. 일부 양태에서, 결합 친화도의 예측은 trast-3 데이터세트에 대해 학습된 모델로부터 유래하였다. 삼중 돌연변이체의 공간은 다수의 잠재적인 고 친화도 후보 서열을 제공하는 한편, 이들은 도 9j에 나타낸 바와 같이, 몇몇 위치에서 특정 치환을 포함하는 콤팩트한 클러스터를 형성하는 경향이 있었다. 특히, 돌연변이 Y57D/E가 여러 클러스터에서 관찰되었다. 또한, 대부분의 고친화도 삼중 돌연변이체는 CDRH2에서 (특히 위치 57 및 62 또는 인접 위치에서) 2개 또는 3개의 돌연변이를 가졌지만, 더 적은 솔루션은 CDRH2에서 1개의 돌연변이 및 CDRH3에서 2개의 돌연변이를 포함하였다. 이러한 발견은 다른 연구에서 또한 논의된 바와 같이[22, 24], 트 라스투주맙에 의한 항원 결합에서의 CDRH2 영역의 핵심 역할을 강조한다. 경험적 시험은 또한, 주어진 돌연변이가 결합 친화도에 미치는 영향이 해당 서열에서 다른 돌연변이의 존재에 따라 크게 변한다는 것을 입증하였다(우발성 현상으로 알려짐[25]). 도 9h 및 도 9i는 단지 다른 단일 돌연변이의 존재에 따라, 주어진 돌연변이는, 이들이 부모 트라스투주맙 서열 에 미칠 효과에 비해 더 크거나, 더 작거나, 심지어 반대 효과를 가질 수 있음을 도시한다. 또한, 2개의 돌연변 이가 존재하는 경우, 추가의(제3의) 돌연변이에 대한 가능한 효과 범위는 더 넓어진다. 유사한 맥락에서, 유전자 상호작용은 개별 효과와 비교하여 2개의 동시 발생 돌연변이 효과의 가산성으로부터의 편차이다[26]. 트라스투주맙의 모든 이중 돌연변이체에 대한 돌연변이 간의 유전자 상호작용은 도 9k에 도시되 어 있다. 구체적으로, 도 9k는 길항성 유전자 상호작용이 트라스투주맙의 주요 파라토프 잔기 사이에서 흔히 발견됨을 도 시한다. 도 9k의 히트맵은 모든 가능한 치환 쌍에 걸친 유전자 상호작용 효과를 도시한다. 유전자 상호작용은 두 돌연변이가 존재할 때 두 돌연변이의 효과의 가산성으로부터의 편차를 지칭한다. 길항성 유전자 상호작용은 2개의 돌연변이가 함께 발생할 때의 결합 친화도의 예상된 변화보다 작은 변화를 지칭한다. 일부 양태에 따르면, 각각의 위치에서의 돌연변이는, 시스테인을 제외한 천연 아미노산과의 모든 가능한 치환을 포함한다(즉, X ∈ [A, D, E, F, G, H, I, K, L, M, N, P, Q, R, S, T, V, W, Y ]). 일부 양태에 따르면, 이는 알파벳 순서로 분류된다(즉, X ∈ [A, D, E, F, G, H, I, K, L, M, N, P, Q, R, S, T, V, W, Y ]). 다수의 돌연변이가 결합 친화도에 미친 부정적인 효과를 감안하면, 길항성, 양성 유전자 상호작용은 종종 관찰 된다(즉, 이중 돌연변이체는 이의 성분적인 단일 돌연변이체에 기초하여 예상되는 것보다 더 높은 결합 친화도 를 나타냄). 이는 트라스투주맙의 결합 친화도에 중요한 위치 55, 107, 111, 112, 및 113에 관여하는 돌연변이 쌍에서 특히 명백하다[22]. 유전자 상호작용은 또한 서열 중 다른 돌연변이의 존재에 매우 의존한다. 돌연변이 간의 복잡한 상호작용은 항체의 생화학적 특성에 직접적으로 영향을 미친다. 종합하면, 돌연변이 부하의 함수로서 고 친화도 서열의 다양성 및 이들의 희석은 가능한 변이체의 공간에 대한 완전한 평가의 가치를 강조한다. 이러한 대규모 평가는 컴퓨팅 모델의 도움으로만 가능하다. 본원에서 논의된 모델, 및 본원에서 논의된 이들 모델의 결과는 이전의 기능적 및 구조적 연구와 매우 일치하며, 돌연변이가 어 떤 방식으로 상호작용하여 항체의 결합 친화도를 형성하는지에 대한 고유한 통찰력을 제공할 수 있다. 유전자 상호작용 효과의 확산은 또한 항체 최적화를 정확하게 예측하고 가이드하기 위한 AI 모델의 필요성을 강조한다. 도 10a 및 도 10b는 본 기술의 양태에 따른, 트라스투주맙 변이체의 전역 서열 친화도 맵핑을 도시한다. AI는 3개의 항원 변이체에 대한 동시 결합 예측을 포함하는 제2 사례 연구에서 강력한 예측 성능을 나타냄 트라스투주맙과 함께 위에서 논의된 모델링 접근법은 다른 항체로 용이하게 확장될 수 있다. 이를 입증하기 위 해, 일례로서, 광범위한 중화(bn)Ab CR9114의 변이체의 공개 결합 데이터가 사용될 수 있다(보충 정보, 아래 참 조)[27]. CR9114 데이터세트는 표적 항원 헤마글루티닌(HA)의 3개의 상이한 인플루엔자 아형에 대한 결합 데이 터를 제공하며, 이에 따라 본 기술은 다중-과제 친화도 예측을 다중 표적에 동시에 지원하도록 모델을 확장하는 데 사용될 수 있다. 또한, CR9114 변이체 중 다수가 하나 이상의 HA 아형에 대한 결합을 상실하였기 때문에, 본 기술은 단일 혼합 모델에서 분류 및 회귀를 조합하는 모델의 능력을 탐색하는 데 사용될 수 있다. 또한, 본 기 술은 모델의 성능에 대한 학습 세트 크기의 영향을 평가하는 데 사용될 수 있다. 위의 성능 표는 헤마글루티닌(HA) 항원의 다수의 인플루엔자 균주에 대한, CR9114에 대한 조인트 모델 친화도 예측 성능을 나타낸다. 각각의 학습 세트 크기(65,091개의 10%, 1%, 0.1%)에 대해 4개의 모델을 학습시켰다 (Reg: 회귀 단독 모델; Mix: 혼합 분류/회귀 모델; PT: 사전학습된 OAS-모델 가중치로 초기화됨; NPT: 무작위 가중치로 초기화됨). 풀링된 CV를 사용하여 이들 모델에 대한 결과를 나타낸다. 전체 CR9114 데이터세트는 63,419개(97%)의 H1, 7,174개(11%)의 H3, 및 198개(0.3%)의 FluB 양성 결합제를 포함한다. 위의 표, 및 도 10c-10h는 함께, 다수의 구별되는 항원 표적에 대한 주어진 항체 서열의 친화도를 공동으로 예 측하기 위해, 단일 모델이 본 기술을 사용하여 학습될 수 있음을 입증한다. 도 10c는 일부 양태에 따른, CR 9114 데이터세트의 10%로 학습시킨 모델의 회귀 성능을 도시한다. 도 10c는 회 귀 단독 모델의 결과, 혼합 분류/회귀 모델의 결과, 사전학습된 OAS-모델 가중치로 초기화된 모델 의 결과, 및 무작위 가중치로 초기화된 결과을 포함한다. 도 10d는 일부 양태에 따른, CR 9114 데이터세트의 1%로 학습시킨 모델의 회귀 성능을 도시한다. 도 10d는 회귀 단독 모델의 결과, 혼합 분류/회귀 모델의 결과, 사전학습된 OAS-모델 가중치로 초기화된 모델의 결과, 및 무작위 가중치로 초기화된 결과을 포함한다. 도 10e는 일부 양태에 따른, CR 9114 데이터세트의 0.1%로 학습시킨 모델의 회귀 성능을 도시한다. 도 10e는 회 귀 단독 모델의 결과, 혼합 분류/회귀 모델의 결과, 사전학습된 OAS-모델 가중치로 초기화된 모델 의 결과, 및 무작위 가중치로 초기화된 결과을 포함한다. 도 10c-10e는 양성 결합제 단독에 대해서만 풀링된 CV를 사용하는 이들 모델에 대한 결과를 도시한다(-log10KD > Bc, 여기에서 Bc는 원래의 공개 문헌에서 결정된 바와 같은 각각의 표적에 대한 하부 경계임; H1에 대해 7, H3 및 FluB에 대해 6). 전체 CR9114 데이터세트는 63,419개(97%)의 H1; 7,174개(11%)의 H3 및 198개(0.3%)의 FluB 양성 결합제를 포함한다. 도 10f는 일부 양태에 따른, CR 9114의 10%로 학습시킨 혼합 모델의 회귀 성능을 도시한다. 도 10f는 사전학습 된 OAS-모델 가중치로 초기화된 모델의 결과, 및 무작위 가중치로 초기화된 결과을 포함한다. 도 10g는 일부 양태에 따른, CR 9114의 1%로 학습시킨 혼합 모델의 회귀 성능을 도시한다. 도 10g는 사전학습된 OAS-모델 가중치로 초기화된 모델의 결과, 및 무작위 가중치로 초기화된 결과을 포함한다. 도 10h는 일부 양태에 따른, CR 9114의 0.1%로 학습시킨 혼합 모델의 회귀 성능을 도시한다. 도 10h는 사전학습 된 OAS-모델 가중치로 초기화된 모델의 결과, 및 무작위 가중치로 초기화된 결과을 포함한다. 도 10f-10h는 풀링된 CV를 사용하는 이들 모델에 대한 결과를 도시한다. 각각의 모델 및 타겟에 대해, 도 10f- 10h는 각각, 각각의 정밀도-재현율 곡선 플롯 및 보정 곡선(상이한 채점 빈에서의 참 확률 대 예측 확률)을 도 시한다. 예상대로, 이러한 모델의 예측력은 H1 및 H3에 비해 FluB 표적에 대해 더 낮았으며, 이는 전체 데이터세트가 193개의 양의 FluB 결합제만을 함유하기 때문이다. 이는 10%의 학습 세트를 사용할 경우에서의 단지 19개의 양성 예, 및 1% 및 0.1%의 학습 세트를 사용할 경우에서의 단지 1 내지 2개의 양성 예만을 남겼다(교차 검증 배수 를 선택할 경우, 각 표적에 대한 최소 하나의 양성 예 및 음성 예가 요구됨, 보충 정보, 아래 참조). 그럼에도 불구하고, 심지어 19개의 학습 예로도, FluB에 대한 모델 예측의 88%는 OAS 데이터세트에 대해, 사전학습된 초 기 가중치를 사용할 경우 측정된 값의 0.5 로그 내에 있었던 데 비해, 무작위 초기 가중치를 사용할 경우에는 73%에 불과했다. 사전학습된 가중치의 사용은 학습 예의 수가 1,000 미만인 모든 경우에 성능을 개선시켰다. 혼합 모델은 회귀 단독 모델과 비교하여 회귀 작업에 대한 성능의 유의한 손실 없이 분류 작업에 대해 양호하게 수행될 수 있었다. 모델 예측의 균형잡힌 정확도는, 학습 세트가 적어도 7개의 양성 및 7개의 음성 예를 포함하 는 모든 경우에 0.84를 초과하였으며, 65개의 변이체(평균 7개의 양성 및 58개의 음성 변이체)의 학습 세트에서 도 H3 결합 작업에서 0.91의 균형잡힌 정확도 점수를 달성하였다. 자연도 일반적으로, 후보 항체의 치료 약물로의 개발은 높은 수준의 전임상 및 임상 위험을 수반하는 복잡한 과정이다. 이러한 위험은 종종 생산, 제형화, 효능, 및 부작용과 관련된 난관이 많기 때문이다. 당업계에서는 이러한 위험 을 모델링하는 것이 굉장히 어려운 일이었는데, 이는 유익한 관련 데이터, 특히 대규모의 관련 데이터를 수득하 는 데 어려움이 있었기 때문이다. 도 11은 항체 자연도, 면역원성, 개발가능성 및 다른 특성 간의 연관성을 도시한다. 일부 예에서, 다양한 종의 천연 항체에 걸쳐 서열 패턴을 학습하기 위해 현재의 기술을 사용하는 것은, 도 11에 도시된 바와 같이, \"인간 유사\" 항체 변이체를 식별하고 우선순위를 지정하고, 비천연 서열을 무시하고 궁극적으로 약물 개발 위험을 완 화하는 데 유용할 수 있다는 가설이 세워졌다. 이러한 목적을 이루기 위해, 일례에서, 항체 서열의 자연도 점수 에 대해 이들을 평가하기 위해 OAS에 대해 사전학습된 언어 모델이 사용될 수 있다(물질 및 방법, 아래 참조). 이러한 맥락에서, 자연도라는 것은, 주어진 항체 서열이 관심 유기체로부터 유래될 가능성을 측정하는, 사전 학 습된 언어 모델에 의해 연산된 점수이다. 따라서, 자연도는 항체 설계 및 조작에 대한 가이드 메트릭으로서 사 용될 수 있다. 도 11b-11d에서, 4개의 빈(낮음, 낮음-중간, 중간-높음, 높음)은 자연도 범위를 동일한 크기의 4개의 부분으로 나누는 것에 상응할 수 있다(또한, 도 11g-11j 참조). P-값은 경향에 대한 Jonckheere-Terpstra 검정을 사용하 여 연산될 수 있다. 도 11b 및 11d의 데이터세트는 두 사슬 모두에 대해 채점된 한편, 패널 11c 및 11e의 데이 터세트는 중쇄 변이체만을 포함하였고 중쇄 모델에 의해서만 일관되게 채점되었다. 자연도 점수의 유용성을 결 정하기 위해, 4개의 항체 특성과의 이들의 연관성을 평가하였다. 예를 들어, 면역원성의 특성은, Marks 등의 임 상 단계 항체에 대한 수많은 연구[28]와 통합된, 도 11f에 반영되어 있다. 자연도-면역원성 연관성 분석에서의 잠재적 교란 인자는, 일부 항체가 완전한 인간 기원을 갖는 반면, 다른 항체는 인간화, 키메라 또는 쥣과로부터 유래된다는 것이다. 자연도에 의한 상이한 기원의 항체의 채점은 것은 주로 종에 따라 이들을 분류하는 것과 마찬가지이며, 이는 사 소하고 유익하지 않다. 대조적으로, 동일한 부류에 속하는 항체의 채점은 가장 자연스러운 것으로부터 가장 덜 자연스러운 것까지 진정한 순위를 정하게 될 것이다. 통계 분석을 지원하기에 충분히 큰, Marks 등에 따른 유일 한 두 가지 항체 부류는 인간 및 인간화 항체이다. 일례에서, 후자의 면역원성 잠재력이 더 크기 때문에, 본 기 술을 사용하여 후자를 조사하여 이상적인 사례 연구를 제공하였다. 항-약물 항체(ADA)에 대해 양성인 환자의 분율과 자연도 사이의 산점도는 도 11f에 나타낸 바와 같이, 약하고 유의하지 않은 상관관계를 나타낸다. 그러나, ADA 반응에 대한 보다 상세한 조사는 대부분의 데이터 포인트가 0~10% 범위에 있으며, 몇 가지 이상치가 20%를 초과하는 것을 나타냈다. 경험적 연구 및 이유는 이러한 이상치 가 자연성과 면역원성 사이의 관계를 모호하게 할 수 있음을 시사한다. 이상치의 영향을 경감시키기 위해, 예를 들어 도 11g에 도시된 바와 같이, 본 기술을 사용하여 자연도 점수를 분류하고 자연도 빈당 ADA 반응 중앙값을 계산하였다. 도 11b-11d에서와 같이, 도 11g-11j의 범위(낮음, 낮음-중간, 중간-높음, 높음)은 자연도 범위를 동일한 크기의 4개의 부분으로 나누는 것에 상응할 수 있다. 이러한 분석은 도 11b에 도시된 바와 같이 자연도가 가장 높은 항체가 자연도가 가장 낮은 항체보다 더 낮은 ADA 반응 중앙값을 유발한다는 것을 나타냈다. 본 기술이 고려하는 데 사용된 제2 항체 특성은 개발가능성이며, 이는 치료 항체 프로파일러(TAP)로 추정될 수 있다[31]. 본 기술은 다양성이 낮은 트라스투주맙 변이체(도 11i)뿐만 아니라 다양성이 높은 파지 디스플레이 데이터세트의 중쇄 서열[29](\"Gifford 라이브러리\", 도 11h)에 대한 자연도 점수 및 (TAP를 사용한) 개발가능성점수를 (본원에서 논의된 모델링 기술을 사용하여) 연산하는 데 사용되었다. 둘 모두에 대해, 경험적 검토는 도 11c 및 11k에 나타낸 바와 같이, 자연도과 TAP 유도 개발가능성 사이의 강한 연관성을 발견히였다. 이러한 결과 는, 자연도 점수는 자연 발생 항체 서열의 예만을 단독으로 사용한 학습을 통해 얻은 한편, TAP는 치료 항체에 서 수집한 5가지 측정 항목의 분포를 사용하여 보정되었기 때문에 특히 주목할 만하다[31]. 따라서, 자연도와 TAP-평가 개발가능성 간의 연관성은 개발가능 항체가 인간-유사 항체에서 풍부함을 시사한다. 도 11k는 도 11i 와 관련하여, 트라스투주맙 변이체의 자연도와 개발가능성 실패 사이의 연관성을 도시한다. 본 기술을 사용하여 조사한 세 번째 특성은, Jain 등[30]에 의해 임상 단계 항체에 대해 보고된, 포유류(HEK- 293) 세포에서의 발현 수준이다. 면역원성의 경우, 데이터세트는 여러 부류의 항체를 포함하며, 본 기술을 사용 하여 인간화 항체에 재차 초점을 맞추었다. 경험적 결과는 도 7d 및 도 11j에 도시된 바와 같이, 본원에서 사용 된 모델링 기술에 의해 덜 바람직하게 채점된 항체에 비해 자연도가 고도로 높은 항체가 보다 양호하게 발현되 었음을 시사하였다. 마지막으로, 본 기술이 고려하는 데 사용된 제4 특성은 돌연변이 부하이며, 이는 부모 항체 서열과 변이체 사이 의 아미노산 치환의 수를 측정한다. 예를 들어, 본 기술을 사용하여 도 11e에 도시된, 6,710,400개의 단일 돌연변이, 이중 돌연변이, 및 삼중 돌연 변이 트라스투주맙 변이체에 대한 자연도 점수를 연산하였다. 해당 결과에 대한 경험적 연구는 자연도가 돌연변 이 부하와 음으로 연관되었음을 발견하였다. 이러한 발견은 대부분의 돌연변이가 유해한 영향을 미친다는 통상 적인 개념과 일치하며, 자연도의 고려 없이 부모 항체에 돌연변이를 도입하면 자연도가 저하될 가능성이 높아지 기 때문에 친화도와 함께 자연도를 적극적으로 최적화해야 할 필요성을 강조한다. 원하는 특성을 갖는 서열 변이체 생성 일반적으로, 항체 최적화는 다수의 확립된 실험실 접근법을 사용하여 개별 특성에 대해 제한된 정도로 수행될 수 있다. 예를 들어, 심층 돌연변이 스캐닝은 항체 후보의 결합 친화도를 개선하는 데 사용되어 왔다[5]. 그러 나, 방대한 돌연변이 공간은 이들 방법에 의해 완전히 스크리닝될 수 없으며, 이에 따라, 잠재적 개선의 범위는 제한된다. 파지 디스플레이와 같은 라이브러리 스크리닝 방법은 이러한 장애물을 극복할 수 있지만, 한 번에 단 지 하나의 특성(예컨대 결합)을 선택할 수 있다는 것에 대한 결과는 다른 관심 특성의 의도하지 않은 저하로 이 어질 수 있다. 예를 들어, 본 기술은 도 11d에 도시된 바와 같이 돌연변이 부하의 증가가 더 낮은 자연도 중앙 값을 유발한다는 것을 입증하는 데 사용되었다. 이를 추가로 입증하기 위해, 본 기술을 사용하여 트라스투주맙으로부터 최대 3개의 돌연변이를 갖는 모든 변이 체의 qaACE 점수 및 자연도를 완전히 예측하였다. 도 11l에 나타낸 바와 같이, 670만 개의 변이체 중 단지 46,931개(0.7%)만이 트라스투주맙보다 높은 qaACE 점수로 예측되었다. 개선된 친화도를 갖는 모든 변이체에 대 해 실험적으로 스크리닝할 수 있더라도, 도 11m에 나타낸 바와 같이, 이들 변이체 중 4,003개(8.5%)만이 트라스 투주맙과 동등하거나 더 높은 자연도 점수를 나타냈다. 도 11l 및 도 11m의 파선은 완전 trast-3 검색 공간에 대한 피트니스 환경의 밀도 맵에서의 트라스투주맙의 자연도 및/또는 예측된 ACE 점수를 나타낸다. 대략 50,000개-구성원의 trast-3 라이브러리를 사용하여 해당 공간을 무작위로 스크리닝한 결과, 단지 60개의 qaACE 점수와 자연도가 더 높은 변이체가 생성되었다. 가상 환경 스크리닝은 설계자 객체화 기능을 사용하여 동시에 다수의 특성을 최적화함으로써 이러한 문제를 해 결하는 방법을 제공한다. 본 기술은, 가상 환경 스크리닝 프로세스의 처리량을 크게 개선할 수 있었던, 본 친화 도 및 자연도 모델 오라클의 상단에 위치한 유전자 알고리즘(GA)을 포함할 수 있다. 도 12는 대체적으로, 유전적 알고리즘이 자연도를 최대화하면서, 특정 qaACE 점수를 효율적으로 최대화, 최소화, 또는 표적화할 수 있음을 도시한다. 예로서, 본 기술은 도 12b에 나타낸 바와 같이, 자연도를 최대화하 는 동시에, (도 12a에 도시된 바와 같이) 670만 개에 대한 419개 서열 변이체의 검색 공간에서 특정 qaACE 점수 를 최소화, 최대화 또는 표적화하는 데 사용될 수 있다. 이러한 예에서, 20회의 생성 후, GA는 도 12c에 나타낸 바와 같이 돌연변이 공간을 거의 및 완전 검색을 수행하 였으며: GA에 의해 식별된 상위 100개 변이체 중 85개는 전체 상위 100개 변이체에 포함되었다. 또한, GA에 의 해 식별된 모든 상위 변이체는 달성 가능한 최대 qaACE 점수의 5% 이내였으며(9개의 분류 게이트로부터의, 9 점), 트라스투주맙보다 424배 더 높은 자연도 점수를 나타냈다. 베이스라인으로서, 본 기술은 GA와 동일한 수의 서열의 쿼리에 의한 무작위 검색을 수행하는 데 사용될 수 있다. 이러한 예에서, 해당 검색은 도 12c에 도시된바와 같이, 트라스트주맙보다 qaACE 점수가 높고 자연도가 높은 2개의 서열만 찾을 수 있었다. 돌연변이 공간에 대한 완전 검색과 달리, GA 유도 최적화는 매우 효율적이다. 예를 들어, 각 생성에서, GA는 200개의 새로운 변이체를 샘플링하며, 결과적으로 20회 생성 모두에 걸쳐 샘플링된 총 서열의 수는 4,000개에 불과하다. 또한, 도 12d에 도시된 바와 같이, 상위 100개의 개체 중 절반 이상이 처음 12회 생성에서 GA에 의해 선택되었다. 종합적으로, 이들 결과는 결합 친화도 및 자연도에 대한 예측 모델의 상위에 구축된 유전자 알고리 즘이 하류 개발을 위한 일련의 상위 후보를 신속하고 효율적으로 식별할 수 있음을 나타낸다. 가상 환경 설계가 점점 더 큰 조합 서열 공간에 적용됨에 따라, AI 오라클과 결합된 최적화 기술의 가치는 증가할 것이다. 논의 대체적으로, 딥 러닝 방법은 서열, 구조 및 기능을 포함하는 단백질 모델링에 대한 신속한 진행을 입증하였다. 마찬가지로, 치료적 설계의 목적에 대해 단백질 상호작용에 대한 관심이 증가하고 있다. 이러한 많은 노력의 주 요 제약은 단백질의 방대한 라이브러리를 합성하고 이들의 정량적 속성을 평가하는 능력이다. 본원에서 논의된 qaACE 검정은 딥 러닝 모델을 강력하게 보완함으로써, 단일 실험으로부터의 2개의 CDR(조합 공간: 108~1010)의 최대 4/5개의 돌연변이로 항체 결합 친화도를 정확하게 모델링할 수 있는 처리량 및 충실도를 제공한다는 것을 입증한다. qaACE 검정은 Tite-Seq[32], SORTCERY[33], 및 파지 디스플레이[34]와 같은 대규모 항체 변이체 조 사를 위한 기존의 방법을 능가하는 이점을 제공한다. 먼저, qaACE는 SoluProTM 대장균 B 균주를 사용하여 항체 를 세포 내에서 가용성으로 발현시킴으로써, 표면 디스플레이 포맷과 연관된 결합 인공물의 생성을 방지한다. 또한, qaACE는 대장균에 이용 가능한 유전자 툴을 활용함으로써, 다른 모델 유기체에 비해 더 빠른 라이브러리 생성 사이클 및 증가된 변환 효율을 제공한다. 마지막으로, qaACE 검정은 파지 디스플레이와 같은 선택과는 대 조적으로, 친화도 강도에 관계없이 모든 변이체가 측정되며, 고 친화도 결합제만이 우선적으로 단리되는, 진정 한 스크리닝 방법이다. 본원에서 입증된 본 딥 러닝 모델의 예측 능력은 개선된 qaACE 검정의 정량적 능력으로 구현될 수 있으며, 이는 모델링 관점에서 두 가지 뚜렷한 이점을 제공한다. 첫째는, 전반적인 성능 증가 및 정량적 예측을 위한 정량적 데이터에 대해 학습된 모델의 확장된 능력이며, 이는 단순한 최대화가 아닌 결합 친화도의 조정을 목표로 할 경 우 특히 유용하다. 두번째는, 정량적 학습 데이터가 또한 저 처리량의 최적 표준 SPR 검정을 사용하는 하류 정 량화를 위한 서열에 대한 지능적인 선택을 가능하게 한다는 것이다. 무작위 서열 공간은 거대하며, 유해한 돌연 변이를 향해 크게 치우쳐 있다. 이러한 문제에 대한 일반적인 접근법은 돌연변이 라이브러리를 특정 위치 또는 주요 돌연변이에 대해 편향시키는 것이지만, 이들 모델에 의해 식별된 유전자 상호작용 효과의 강도는 해당 접 근법이 불충분한 커버리지를 제공한다는 것을 시사한다. 개선된 qaACE 분석을 이용한 사전 정량화 단계는 편향 없이 보다 균일한 분포를 측정할 수 있는 기회를 제공하며, 이는 모델의 일반화 능력을 증가시킨다. 이용 가능한 고 친화도 서열의 다양성 및 돌연변이 부하로의 희석은 가능한 변이체의 공간에 대한 완전하고 정 확한 평가의 가치를 강조한다. 이러한 대규모 평가는 컴퓨팅 모델의 도움으로만 가능하다. 모델링 결과는 이전 의 기능적 및 구조적 연구와 매우 일치하며, 상이한 돌연변이가 어떤 방식으로 상호작용하여 항체의 결합 친화 도 환경을 형성하는지에 대한 고유한 통찰력을 제공할 수 있다. 유전자 상호작용 효과의 확산은 또한 항체 최적 화를 정확하게 예측하고 가이드하기 위한 고도로 유연한 AI 모델의 필요성을 강조한다. 거대한 조합 항체 서열 공간 내에서 매우 소수의 서열만이 자연에서 검출되었다. 즉, OAS 데이터베이스에서는 108개, 가장 긴 보고된 인간 서열에 대해서는 10120개 이상의 가능한 고유 CDR 서열이 검출되었다. 본원에 제시 된 자연도 모델은 새로운 서열이 이러한 범주에 속하는지의 여부를 결정하는 데 도움이 될 수 있으며, 본 기술 은 도 18a 및 도 18b에 나타낸 바와 같이, 이러한 자연 공간의 크기를 1060개로 대략적으로 추정하는 데 사용될 수 있다. 도 18a 및 도 18b는 중쇄 인간 CDR에 대한 서열 공간 크기를 추정하는 것과 관련된 플롯 및 다이어그램을 도시 한다. 예를 들어, 도 18a에서, OAS의 길이 분포와 일치하는 무작위 아미노산을 사용하여 백만 개의 무작위 서열 이 생성될 수 있다. OA의 자연도의 하부 꼬리에 기초하여, 천연 서열 공간의 크기를 추정하기 위해 0.15의 임계 값이 선택될 수 있다. 도 18b에서, 원의 크기는 실제 규모에 비례하지 않는다. 총 가능한 서열 공간의 크기는 61개 위치(필터링된 OAS 데이터세트 중 가장 긴 인간 서열)에 걸쳐 20개의 아미노산 가능성으로부터 추정될 수 있다. 천연 CDR 공간은 편향(skew)-정규 분포를 무작위 서열에 피팅하고 자연도 임계값을 초과하는 분율을 계산 함으로써 대략적으로 근사화될 수 있다. 이러한 계산에서의 통계적 불확실성은 무시할 수 없지만, 천연 공간이 실험실 또는 가상 환경에서 스크리닝될 수 있는 것보다 훨씬 더 크다는 것은 분명하다. 동시에, 이들 천연 서열은 무작위 서열 변이체의 스크리닝에서 희소성을 갖는다. 본원에 제시된 솔루션은 특이적 항체에 표적화된 자연도 및 친화도 데이터 둘 모두에 대해 학습된 모델을 적용 하는 것이며, 이의 교차점은 물리적 평가가 접근할 수 있는 규모에 비해 서열의 보다 방대한 공간의 평가를 효 과적으로 가능하게 하는 동시에, 가장 관련된 '천연' 서열에 대한 스크리닝에 집중할 수 있게 한다는 것이다. 본 연구의 2개의 항체 특성의 공동 최적화는 n개의 항체 특성의 공동 최적화로 연장될 수 있다. CR9114에 대해 본원에서 나타낸 바와 같이, 다수의 친화도 데이터세트에 대한 학습 모델은 다수의 항원 또는 항원 변이체에 대 한 결합 예측을 잠금 해제한다. 원칙적으로, 다중 항원 예측은 예측 범위(항원 탈출 변이체에 대한 공동 최적화), 특이성(동일한 계열의 원하는 구성원에 대한 결합을 증가시키면서 단백질 계열의 원하지 않는 구성원 에 대한 결합을 감소시키기 위한 공동 최적화), 및 종 교차 반응성(인간 및 시노몰구스 이종상동체에 대한 공동 최적화)의 조작을 용이하게 할 수 있다. 위에서, 천연 서열에 대한 사전학습은 본 모델의 예측 성능을 개선시킴을 입증하였다. 마찬가지로, 모델은 새로 운 항체와 관련하여 새로운 데이터를 추가하고 새로운 성능 또는 개발가능성 속성이 추가됨으로써 지속적으로 개선될 수 있다. 본 기술은 자연도가 공통 메트릭의 유용한 대리체임을 나타내는 데 사용될 수 있으며, 자연도 와 유리한 특성 사이의 직관적인 관계가 유지되는 경우, 실제로 이들 연관성을 능가할 수 있다. 조건부 pH 결합, 효과기 기능, 용융 온도, 자가 응집, 점도 등과 같은, 이들 각각의 검정으로부터의 데이터와 함께, 추가 특성이 추가될 수 있다. 이들 중 대부분에 대해, 강력한 데이터세트에 대해 학습된 단일 모델은 다양한 관심 항 체를 위해 기능할 수 있고, 심지어 다중-작업 학습을 통해 결합 친화도 모델의 능력을 개선시킬 수 있다. 중요하게는, 본원에 제시된 프레임워크는 주어진 범위의 극단에서 변이체를 선택하는 것으로 반드시 제한되지 않으며, 원하는 값으로 항체 특징을 조정하는 것을 용이하게 한다. 또한, 본원에 제시된 모델은 표적 친화도 및 자연도 특징에 대한 항체 최적화에 초점을 맞추지만, 이러한 접근법은 원칙적으로 임의의 단백질의 이의 표적과 의 상호작용을 조정하는 데 적용될 수 있다. 생물학적 서열의 AI 보조 최적화는 치료 개발 시간을 감소시키는 실질적인 용도를 제공하지만, 그 자체로는 완 전한 가상 환경 대체물을 제공하지 않는다. 이를 위해서는, 완전한 생성 모델링 접근법이 필요하다. 그러나, 이 들의 학습 및 검증은, 부모 서열의 앵커 없이 고려되는 전체 신규 조합 공간이 극적으로 더 방대하고, 강한 선 택적 결합제는 해당 공간 중의 무한히 작은 슬라이스이기 때문에, 훨씬 더 큰 데이터 장애물에 직면하게 된다. 구조 기반 접근법은 증가된 능력을 나타내고 있으며, 이러한 갭을 가교하는 데 유용할 수 있다. 본원에 제시된 언어 모델은, 생성 모델에 효과적인 학습 기반을 제공할 수 있는, 외삽 범위 내에서 가상 환경 오라클로서 기능 할 수 있는 가능성을 제공한다. 최적화 및 전체 생성의 통합은 데이터 기반 치료 설계의 다음 큰 단계일 수 있 다. 물질 및 방법 라이브러리 클로닝 항체 변이체를 클로닝하고 Fab 포맷으로 발현시켰다. 모델 학습 및 평가를 위한 qaACE 및 SPR 데이터세트를 생 성하기 위해(표 1), ssDNA 올리고 풀(Twist Bioscience)을 사용하여 단일 올리고뉴클레오티드에서 CDRH2 및 CDRH3에 걸쳐 DNA 변이체를 합성하였다. 코돈은 각 변이체에 대해 대장균 B 균주[35]에서 가장 흔한 2가지로부 터 무작위로 선택되었다. 각각의 아미노산 변이체에 대해 2개의 동의어 DNA 서열을 합성하였다(부모 트라스투주 맙에 대해 5개 또는 10개 및 양성/음성 대조군). Twist Bioscience ssDNA 올리고 풀의 증폭은, Platinum SuperFi II DNA 중합효소(ThermoFisher)를 KAPA 중합효소 대신 사용하였다는 점을 제외하고는, Twist Bioscience의 권장사항에 따라 PCR에 의해 수행되었다. 간략하게, 20 μL의 반응물은 1x Platinum SuperFi II Mastermix, 각각 0.3 μM의 순방향 및 역방향 프라이머, 및 10 ng 올리고 풀로 구성되었다. 반응물을 초기에 95 °C에서 3분 동안 초기에 변성시킨 다음, 20초 동안 95°C; 20초 동안 66°C; 15초 동안 72°C; 및 1분 동안 72 °C의 최종 연장의 13회 사이클이 이어진다. 아가로오스 겔 전기영동으로 DNA 증폭을 확인하고, 이어서 증폭된 DNA를 정제하였다(DNA Clean and Concentrate Kit, Zymo Research). 독립적인 실험에서 모델 설계의 SPR 검증을 위한 라이브러리를 구축하기 위해, CDRH3에 걸친 올리고뉴클레오티 드(59 nt) 및 즉각적인 p스트림/하류 측부 뉴클레오티드를 Integrated DNA Technologies(IDT)에 의해 합성하였다. 코돈 사용은 돌연변이된 위치를 제외하고는 모든 변이체에 대해 동일하였다. 올리고뉴클레오티드가 풀 내에 서 등몰 방식으로 제시되도록, 올리고뉴클레오티드를 풀링하였다. 이러한 단일 가닥 올리고뉴클레오티드 풀을 사전 증폭 없이 클로닝 반응(아래 참조)에 직접 사용하였다. 선형화 벡터를 생성하기 위해, 2단계 PCR을 수행하여, 증폭된 Twist Bioscience 라이브러리의 5' 및 3' 말단 상 에 약 30개의 뉴클레오티드(nt) 또는 IDT 올리고뉴클레오티드의 5' 및 3' 말단 상에 18개의 뉴클레오티드(nt)의 클로닝 중첩을 제공하는 방식으로, 팹 포맷 트라스투주맙을 운반하는 Absci 플라스미드 벡터를 2개의 단편으로 분할하였다. 벡터 선형화 반응물을 DPN1(New England Bioloabs)로 분해하고, 0.8% 아가로오스 겔(Gel DNA Recovery Kit, Zymo Research)로부터 정제하여 부모 벡터 전달물을 제거하였다. 클로닝 반응은 50 fmol의 각각 의 정제된 벡터 단편, 100 fmol 정제된 라이브러리(Twist Bioscience) 또는 10 pmol(IDT) 삽입체, 및 1x 최종 농도 NEBuilder HiFi DNA Assembly(New England Biolabs)로 구성되었다. 반응물을 50°C에서 2시간(Twist Bioscience 라이브러리) 또는 25분(IDT 라이브러리) 동안 인큐베이션하고, 후속하여 이를 정제하였다(DNA Clean and Concentrate Kit, Zymo Research). Transformax Epi300(Lucigen) 대장균을 정제된 어셈블리 반응물로 전기 천공(BioRad MicroPulser)에 의해 형질전환시키고, 50 μg/ml 카나마이신을 함유하는 LB 한천 플레이트 상에서 30°C에서 밤새 성장시켰다. 다음날 아침 콜로니를 LB 플레이트로부터 긁어내고 플라스미드를 추출하고(Plasmid Midi Kit, Zymo Research), QC 시퀀싱을 위해 제출하였다. QC 항체 변이체 라이브러리를 CDRH2 및 CDRH3 영역에 걸쳐 PCR로 증폭시키고, 20% PhiX를 사용하는 Illumina NextSeq 1000 P2 플랫폼을 사용하여 2x150 nt 판독으로 시퀀싱하였다. PCR 반응은 10 nM 프라이머 농도, Q5 2x 마스터 혼합물(NEB), 및 MGH20에서 희석된 1 ng의 입력 DNA를 사용하였다. 반응물을 초기에 98°C에서 3분 동안 변성시킨 다음; 98°C에서 10초 동안, 59°C에서 30초 동안, 72°C에서 15초 동안의 30회 사이클을 수행하고; 72°C에서 2분 동안 최종 연장시켰다. 돌연변이의 분포, 변이체 표현, 라이브러리 복잡도 및 예상 서열의 회복에 대해 시퀀싱 결과를 분석하였다. 메 트릭은 서열 표현의 변동 계수, 상위 1% 가장 흔한 서열의 판독 점유율, 및 라이브러리 내에서 관찰된 설계된 라이브러리 서열의 백분율을 포함하였다. 활성 특이적 세포 농축(ACE/qaACE) 검정 SoluProTM 대장균 B 균주에서의 항체 발현 SoluProTM 대장균 B 균주를 전기천공(Bio-Rad MicroPulser)으로 형질전환시켰다. 30°C에서 90분 동안 세포를 250 rpm으로 진탕하면서 1 ml SOC 배지에서 회복시켰다. 회복 증식물을 8,000 g로 5분 동안 원심분리하고 상청 액을 제거하였다. 생성된 세포 펠릿을, 유도제 및 보충제(260 μM 아라비노스, 50 μg/mL 카나마이신, 8 mM 황 산마그네슘, 1 mM 프로피오네이트, 1X Korz 미량 금속)를 함유하는 1 ml의 유도 매질(IBM)(4.5 g/L 인산칼륨 547 일염기, 13.8 g/L 황산암모늄, 20.5 g/L 효모 추출물, 20.5 g/L 글리세롤, 1.95 g/L 시트르산)에 재현탁시 키고, 이어서 1 L 배플 플라스크 중 100 ml의 IBM 함유 유도 및 보충제에 첨가하였다. 30°C에서 250 rpm으로 24시간 동안 진탕하면서 항체 Fab 유도를 진행하였다. 24시간 종료 시, 유도된 배양물의 1 ml 분취액을 25% v/v 글리세롤로 조정하고 -80°C에서 보관하였다. 세포 제조 항원 특이적 Fab 발현 세포의 고처리량 정량적 선택은 Liu 등[20]에 설명된 접근법으로부터 채택되었다. 염색을 위해, 유도된 배양물로부터 해동된 글리세롤 스톡 중 OD600 = 2를 0.7 ml 매트릭스 튜브에 옮기고, 3300 g에서 3분 동안 원심분리하고, 생성된 펠릿화된 세포를 PBS + 1 mM EDTA로 3회 세척하였다. 세척된 세포를 피펫팅으러 250 μL의 33 mM 인산염 완충액(Na2HPO4)에 완전히 재현탁시킨 다음, 0.5% 파라포름알데히드 및 0.4% 글루타르 알데히드가 포함된 250 μL의 32 mM 인산염 완충액을 추가로 첨가하여 고정시켰다. 얼음 상에서 40분 동안 인큐 베이션한 후, 세포를 PBS로 3회 세척하고, 리소자임 완충액(20 mM Tris, 50 mM 포도당, 10 mM EDTA, 5 μg/ml 리소자임)에 재현탁하고, 얼음 상에서 8분 동안 인큐베이션하였다. 고정 및 리소자임-처리된 세포를 0.1% 사포 닌 완충액(1x PBS, 1 mM EDTA, 0.1% 사포닌, 1% 열 불활성화 FBS)에서 3회 세척하여 염색 완충액 중 평형화시켰 다. 염색 라이브러리 염색 전, Her2 프로브를 기준 균주에 대해 적정하여 75% 유효 농도(EC75)를 결정하였다. 리소자임 처리 및 평형화 후, trast-1 라이브러리를 250 μL 사포닌 완충액 중 재현탁하고 새로운 매트릭스 튜브로 옮겼 다. trast-3 라이브러리를, 사포닌 완충액 중에서의 평형화 및 재현탁 전, 추가적인 투과화를 위해 AlphaLISA 면역검정 분석 완충액(Perkin Elmer; 25 mM HEPES, 0.1% 카제인, 1 mg/ml 덱스트란-500, 0.5% Triton X-100, 및 0.5% 카톤) 중에서 20분 동안 인큐베이션하였다. 2배 농도의 염색 시약 - 100 nM 인간 HER2:AF647(Acro Biosystems) 및 60 nM 항-카파 경쇄:AF488(BioLegend)을 사포닌 완충액에서 제조한 다음, 250 μL 프로브 용액 을 준비된 세포에 옮기고, 총 염색 부피를 50 nM Her2 및 30 nM 항-카파 LC로 500 μL로 만들었다. 라이브러리 를 프로브와 함께 밤새(16시간) 인큐베이션하고, 4°C 차광 상태에서 단부 간 회전시켰다. 인큐베이션 후, 세포 를 펠릿화하고, PBS로 3회 세척한 다음, 철저한 피펫팅으로 500 μL PBS 중 재현탁하였다. 라이브러리 분류 분류 라이브러리를 FACSymphony S6(BD Biosciences) 기기를 이용해 분류하였다. 분류 직전, 50 μL의 분취 샘 플을 1 mL PBS + 3 μL의 프로피듐 요오드화물이 담긴 유동 튜브로 옮겼다. 응집체, 부스러기, 및 불투과성 세 포를 단일항, 크기, 및 PI+ 부모 게이팅으로 제거하였다. 발현 편향을 감소시키기 위해, 추가 부모 게이트를 피 크 발현 양성 세포의 중간 65% 상에 설정하였다. 결합 신호의 로그 범위를 균등하게 샘플링하기 위해 수집 게이 트가 그려졌다. 최우측 게이트는, 발현 부모 게이트의 65,000개마다 5개의 가장 밝은 이벤트를 포함함으로써 추 정된, 할당된 분류 시간에 걸쳐 가장 밝은 10,000개의 이벤트를 수집하도록 설정되었다. 이어서, 도 S13a 및 도 13b에 도시된 바와 같이, 7개의 추가 게이트를 설정하여 양성 결합 신호를 분별하고, 하나의 게이트는 결합 음 성 모집단을 수집하였다. 구체적으로, 도 13a는 일부 양태에 따른, 모든 ACE 분류에 대한 대표적인 부모 게이팅을 도시한다. GFP 및 mCherry 리포터 균주의 이중 형광에 의해 이전에 식별된 SoluProTM 응집 영역을 배제하기 위해 2개의 단일항 게 이트를 그리고, 프로피듐 요오드화물을 사용하여 투과되지 않은 세포를 배제하였다. 도 13b는 일부 양태에 따른, 각각의 ACE 라이브러리 분류에 대한 특이적 표현 및 수집 게이팅을 도시한다. 프로브 특이적 결합 신호에 대한 수집 게이트를 설정하기 전, 약 65%의 발현 양성 세포를 포함하고 피크 발현 신호 위에 중심을 둔 부모 게 이트를 그렸다. 라이브러리는 형광 강도를 정규화하도록 조정된 광전 증배관이 구비된 2개의 기구 상에서 동시에 분류되었으며, 수집된 이벤트는 기술적 복제물로 독립적으로 처리되었다. 차세대 시퀀싱 다양한 게이트로부터의 세포 물질을 1.5 mL 튜브(Eppendorf) 중 희석된 PBS 혼합물(VWR) 중에 수집하였다. 분류 후 샘플을 3,800 g로 회전시키고 부피를 20 μl로 정규화하였다. 다음의 2개의 방법 중 하나로부터 시퀀싱을 위 한 앰플리콘을 생성하였다. 제1 방법은 수집된 세포 물질을 템플릿으로서 직접 사용하여, 2-단계 PCR을 통해 CDRH2 및 CDRH3 영역을 증폭시킨다. 초기 PCR 단계 동안, 고유 분자 식별자(UMI) 및 부분 Illumina 어댑터를 4 회의 PCR 사이클을 통해 CDRH2 및 CDRH3 앰플리콘에 첨가하였다. 제2 단계 PCR은 Illumina 시퀀싱 어댑터의 나 머지 부분 및 Illumina i5 및 i7 샘플 인덱스를 첨가하였다. 초기 PCR 반응은 1 nm UMI 프라이머 농도, Q5 2x 마스터 혼합물(NEB) 및 희석된 PBS(VWR) 중 현탁된 20 μl의 분류된 세포 물질 입력을 사용하였다. 반응물을 초 기에 98°C에서 3분 동안 변성시킨 다음; 98°C에서 10초 동안, 59°C에서 30초 동안, 72°C에서 30초 동안의 4 회 사이클을 수행하고; 72°C에서 2분 동안 최종 연장시켰다. 초기 PCR에 이어서, 0.5 μM의 2차 샘플 인덱스 프라이머를 각각의 반응 튜브에 첨가하였다. 이어서, 반응물을 98°C에서 3분 동안 변성시킨 다음; 98°C에서 10초 동안, 62°C에서 30초 동안, 72°C에서 15초 동안의 29회 사이클을 수행하고; 72°C에서 2분 동안 최종 연 장시켰다. 제2 방법은 UMI의 추가 없이 CDRH2 및 CDRH3 영역을 증폭시킨다. 해당 단일 단계 PCR은 10 nm 프라이 머 농도, Q5 2x 마스터 혼합물(NEB) 및 희석된 PBS(VWR) 중 현탁된 20 μl의 분류된 세포 물질 입력을 사용하였 다. 반응물을 초기에 98°C에서 3분 동안 변성시킨 다음; 98°C에서 10초 동안, 59°C에서 30초 동안, 72°C에 서 15초 동안의 30회 사이클을 수행하고; 72°C에서 2분 동안 최종 연장시켰다. 두 방법 중 어느 하나에 의한 증폭 후, 샘플을 2% 아가로오스 겔 상에서 75 V에서 60분 동안 실행하고, 적절한 길이 밴드를 절제하고, Zymoclean Gel DNA Recovery Kit(Zymo Research)를 사용하여 정제하였다. 생성된 DNA 샘플을 Qubit 형광계 (Invitrogen)로 정량화하고, 정규화하고, 풀링하였다. Tapestation 1000 HS를 통해 풀 크기를 검증하고, 20% PhiX로 Illumina NextSeq 1000 P2(2x150 nt) 상에서 시퀀싱하였다. ACE 검정 분석 리드(reads)로부터 정량적 결합 점수를 생성하기 위해, 다음의 처리 단계 및 품질 관리 단계를 수행하였다: 1. 쌍을 이룬 말단 판독은 앰플리콘 크기 및 시퀀싱 판독 길이에 따라 설정된 최대 허용 중복에 따라 FLASH2[36]를 사용하여 병합되었다(본원에 기술된 모든 라이브러리에 대해 150개의 염기). 2. 증폭 동안 UMI가 추가된 경우, 하류 UMI 태그(마지막 8개의 염기)를 판독의 시작 지점으로 이동시키고, UMI Collapse 툴[37]을 FASTQ 모드에서 사용하여 임의의 PCR 복제물을 제거하였다. 완전히 동일한 서열만이 복제된 것으로 간주되었고, 해당 단계에서 오류 보정은 수행되지 않았다. 3. 프라이머를 Cutadapt 툴[38]를 사용하여 병합된 판독의 양 단부로부터 제거하고, 프라이머가 검출되지 않은 경우 판독을 폐기하였다. 4. 판독을 모든 FACS 분류 게이트에 걸쳐 응집시키고 아미노산 공간에서 기준 서열(앰플리콘의 부모 버전)에 정 렬시켰다. Biopython[39]에서 구현된 Needleman-Wunsch 알고리즘을 사용하여 다음의 파라미터로 정렬을 수행하 였다: PairwiseAligner, 모드=전역, 일치_점수=5, 불일치_점수=-4, 오픈_갭_점수=-20, 연장_갭_점수=-1. 파라 미터는 다수의 처리된 라이브러리에 걸친 수동 검사에 의해 선택되었다. 5. 이어서, 평균 염기 품질이 20 미만이거나, 모든 게이트에 걸쳐 10개 미만의 판독으로 (DNA 공간 내) 서열이 관찰된 경우(또는 이용 가능한 경우, UMI 중복 제거 후 10개 미만의 고유 분자인 경우), 해당 판독을 폐 기하였다. 6. 상기 절차는 또한: 낮은 점수(기준을 그 자체에 대해 정렬하여 얻은 점수의 0.6 미만으로 정의됨)로 기 준과 정렬되는 서열; 관심 영역 외부의 정지 코돈을 함유하는 서열; 및 프레임-시프팅 삽입 또는 결실 을 함유하는 서열로 프래그되었다. 플래그된 서열은 임의의 돌연변이 관련 통계에 포함되지 않았지만, 결합 점 수 계산을 위한 계수 정규화에 사용하였다. FastQC[40] 및 MultiQC[41]를 사용하여 시퀀싱 품질 관리 메트릭을 생성하였다. 7. 각 게이트에 대해, 각각의 서열의 유병률(해당 게이트의 모든 서열로부터의 판독/UMI의 총 수에 대한 판독 /UMI 계수)을 1백만 672 계수로 정규화하였다. 8. 결합 점수(ACE 점수)는 분류 게이트에 걸쳐 정규화된 계수의 가중 평균을 취함으로써 각각의 고유 DNA 서열 에 할당되었다. 모든 실험에 대해, 정수 스케일을 사용하여 가중치를 선형으로 할당하였다: 가장 낮은 형광 신 호를 캡처하는 게이트에 대해 1의 가중치 할당, 그 다음 가장 낮은 게이트에 대해 2의 가중치 할당, 등. 9. 원래 설계된 라이브러리 및 합성된 679개 라이브러리에 존재하지 않은 임의의 검출된 서열을 탈락시켰다. 10. 각각의 고유 아미노산 변이체에 대해, 동의 DNA 서열로부터의 qaACE 점수를 평균화하였다. 11. qaACE 점수를 독립적인 FACS 분류에 걸쳐 평균화하고, 반복 측정의 표준 편차가 1.25를 초과하는 서열을 탈 락시켰다. 아미노산 변이체는, 동의 DNA 변이체와 복제 FACS 분류 사이에서 적어도 3개의 독립적인 QC 통과 관 찰이 수집된 경우에만 유지되었다. 표면 플라스몬 공진(SPR) SoluProTM 대장균 B 균주에서의 항체 발현 항체 Fab 변이체를 발현하는 개별 SoluProTM 대장균 B 균주 콜로니를 96-웰 딥 블록(Labcon)의 LB 배지에 접종 하고 30°C에서 24시간 동안 성장시켜 발현 유도를 위한 시드 배양물을 생성하였다. 이어서, 시드 배양물을 96- 웰 딥 블록에서 유도제 및 보충제를 함유하는 IBM에 접종하고, 30°C에서 24시간 동안 추가로 성장시켰다. 유도 후 샘플을 96-웰 플레이트(Greiner Bio-One)에 옮기고, 펠릿화하고, 50 μL 용해 완충액(0.01 KU 벤조나아제 뉴 클레아제 및 1X 프로테아제 억제제 칵테일을 함유하는 1X BugBuster 단백질 추출 시약) 중에 용해시켰다. 플레 이트를 30°C에서 15~20분 동안 인큐베이션한 다음, 원심분리하여 불용성 부스러기를 제거하였다. 용해 후, 샘 플을 200 μL의 SPR 실행 완충액(10 mM HEPES, 150 mM NaCl, 3 mM EDTA, 0.01% w/v Tween-20, 0.5 mg/mL BS A)으로 260 μL의 최종 부피로 조정하고, 96-웰 플레이트 내로 여과하였다. 이어서, 용해된 샘플을 Hamilton STAR 자동화 액체 핸들러를 사용하여 고 처리량 SPR을 위해 96-웰 플레이트로부터 384-웰 플레이트로 옮겼다. 용해 전에 2개 세트의 독립적인 복제물로 콜로니를 제조하였고, 각각의 복제물은 2개의 별도의 실험 실행으로 측정하였다. 일부 경우, 표시된 바와 같이 단일 복제물을 사용하였다.SPR 실험 고 처리량 SPR 실험은 SPR 실행 완충액(10 mM HEPES, 150 mM NaCl, 3 mM EDTA, 0.01% w/v Tween-20, 0.5 mg/mL BSA) 및 SPR 세척 완충액(10 mM HEPES, 150 mM NaCl, 3 mM EDTA, 0.01% w/v Tween-20)을 사용하여 미세유체 Carterra LSA SPR 기기 상에서 수행되었다. 실험을 수행하기 전에 Carterra LSA SAD200M 칩을 20 μg/mL 비오 티닐화 항체 포획 시약으로 600초 동안 사전 기능화하였다. 384-웰 블록 중의 용해된 샘플을 25/74 칩 표면 상 에 600초 동안 고정시킨 다음, 베이스라인 안정화를 위해 60초의 휴약 단계를 수행하였다. 항원 결합은 300초 결합 단계 후 900초 해리 단계를 갖는 비-재생 동역학 방법을 사용하여 수행하였다. 분석물 주입을 위해, 항원 결합 동역학을 모니터링하기 전, 일관된 베이스라인을 생성하기 위해 6개의 선행 블랭크를 도입하였다. 선행 블 랭크 후, 5가지 농도의 HER2 세포외 도메인 항원(ACRO Biosystems, 500 nM의 시작 농도로부터 3배 연속 희석으 로 제조됨)을 기기에 주입하고, 시계열 반응을 기록하였다. 대부분의 실험에서, 개별 DNA 변이체에 대한 측정을 4회 반복하였다. 일반적으로, 각각의 실험 실행은 1회 실행 1개 클론 당 2회의 중복 측정 시도를 제공하는 2회 의 완전 측정 사이클(리간드 고정, 선행 블랭크 주입, 분석물 주입, 칩 재생)로 구성되었다. 대부분의 실험에서, 별도의 실행에서 측정된 기술적 복제물은 클론당 측정 시도 횟수를 4로, 추가로 2배 증가시켰다. 센서그램 베이스라인 차감 Carterra LSA 기기와 함께 제공된 Carterra Kinetics GUI 소프트웨어 애플리케이션을 사용하여 센서그램 (Sensorgram)을 원시 데이터로부터 생성하였다. Carterra 제조업체에 의해 구현된 이중 참조 및 정렬 기술을 사 용하여, Carterra 칩 상의 384개의 관심 영역(ROI)에 대한 센서그램 응답 값 대 시간을 보정하였다. 이 기술은, 배경 반응을 추정하고 이를 차감하기 위해, 초기 실험 실행 사이클 동안 동일한 ROI에 걸쳐 유동하는 선행 블랭 크 완충액 주입으로부터의 비동기 반응뿐만 아니라, ROI에 인접한 인터스팟 기준 영역의 시간 동기화 반응 둘 모두를 포함한다. 오프라인 분석을 위해 Kinetics 소프트웨어 패키지로부터 보정된 센서그램을 내보냈다. 동역학 결합 파라미터 동역학 결합 파라미터는 표준 1:1 결합 모델을 사용하여 비선형 회귀를 통해 추정되었으며, 이는 각각 하나의 분석물 농도에 고유한 tc 파라미터의 벡터의 혼입에 의해 변형되었다. 단일 분석물 농도에 대해, 연관 단계 모델 은 다음과 같다:"}
{"patent_id": "10-2024-7026560", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "이전 단계로부터의 분석물이 완전히 해리되기 전 각각의 새로운 분석물 농도에서 연속적인 연관 단계 측정이 시 도되어 t = 0에서 제로 반응으로부터 시작되지 않는 반응 곡선이 생성되는 Carterra가 사용하는 고유 측정 시스 템으로 인해, 추가적인 농도 의존적 시간 오프셋 파라미터 tc가 필요하였다. 시간 오프셋 파라미터는 각각의 연 관 반응 곡선의 투영된 시간 절편, 즉 t = 0에서 실제 관찰된 반응에 도달하기 위해 측정을 시작해야 했던 연관 단계의 시작 전의 시간의 양을 나타낸다. 해리 단계는 표준 감쇠 지수 곡선으로 모델링되었다: 회귀는 R-언어[42] 스크립트를 사용하여 수행되었다. Levenberg-Marquardt[46][47] 비선형 최소 제곱 파라미터 검색 알고리즘을 구현하는 FORTRAN 기반 소프트웨어 패키지인, Minpack.lm[43], MINPACK-1의 R-포트 카피"}
{"patent_id": "10-2024-7026560", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "[44][45]를 사용하여 파라미터 검색을 수행하였다. 차세대 시퀀싱 SPR에서 평가된 개별 항체 변이체의 DNA 서열을 식별하기 위해, 측정된 변이체에 대해 NGS를 수행하였다. 개별 콜로니를 50 μg/mL 카나마이신(Teknova)이 담긴 LB 한천 플레이트로부터 1 mL LB 배지(Teknova)가 담긴 96개 딥 웰 플레이트로 따냈다. 배양 플레이트를 30°C 진탕기 인큐베이터에서 밤새 성장시켰다. 200 μl의 밤새 배 양물을 새로운 96 웰 플레이트(Labcon)에 옮기고 3,500 g로 회전시켰다. 펠릿화된 물질의 일부를 핀너(Fisher Scientific)를 통해, Illumina 어댑터의 첨가 및 시퀀싱을 위한 2-단계 PCR의 초기 단계 PCR을 수행하기 위한 시약을 함유한 96 웰 PCR(Thermo-Fisher) 플레이트 내로 옮겼다. 사용된 반응 부피는 25 μl였다. 초기 PCR 단 계 동안, 부분 Illumina 어댑터를 4회의 PCR 사이클을 통해 CDRH2 및 CDRH3 앰플리콘에 첨가하였다. 제2 단계 PCR은 Illumina 시퀀싱 어댑터의 나머지 부분 및 Illumina i5 및 i7 샘플 인덱스를 첨가하였다. 초기 PCR 반응 은 0.45 μM UMI 프라이머 농도, 12.5 μl Q5 2x 마스터 혼합물(NEB)을 사용하였다. 반응물을 초기에 98°C에서 3분 동안 변성시킨 다음; 98°C에서 10초 동안, 59°C에서 30초 동안, 72°C에서 30초 동안의 4회 사이클을 수 행하고; 72°C에서 2분 동안 최종 연장시켰다. 초기 PCR에 이어서, 0.5 μM의 2차 샘플 인덱스 프라이머를 각각 의 반응 튜브에 첨가하였다. 이어서, 반응물을 98°C에서 3분 동안 변성시킨 다음; 98°C에서 10초 동안, 62°C 에서 30초 동안, 72°C에서 15초 동안의 29회 사이클을 수행하고; 72°C에서 2분 동안 최종 연장시켰다. 이어서, 반응물을 1.5 mL 튜브(Eppendorf)에 풀링하였다. 1x AMPure XP(Beckman Coulter) 비드 절차로 풀링된 샘플의 크기를 선택하였다. 생성된 DNA 샘플을 Qubit 형광계로 정량화하였다. Tapestation 1000 HS를 통해 풀 크기를 검증하고, 20% PhiX로 Illumina MiSeq Micro(2x150 nt) 상에서 시퀀싱하였다. 시퀀싱 후, 앰플리콘 판독을 이들의 샘플 인덱스에 따라 병합하였다. 병합은 맞춤형 Python 스크립트에 의해 수 행되었다. 스크립트는 중첩 서열에 기초하여 R1 및 R2 판독을 병합하였다. 각 샘플 내의 고유 앰플리콘 서열의 인스턴스를 계수하고 도표화하였다. 다음으로, 맞춤형 R 스크립트를 적용하여 샘플 내에서 관찰된 우성 서열과 이차 서열 사이의 서열 빈도 비율 및 Levenshtein 거리를 계산하였다. 이들 계산은 클론 SPR 측정을 확인하기 위한 하류에서의 품질 필터링에 사용되었다. 이어서, 각 샘플 내의 우성 서열을 이에 해당하는 Carterra SPR 측 정치와 조합하였다. QC 다음 기준 중 어느 하나에 부합하는 경우 해당 SPR 피팅은 제외되었다: ·3개 미만의 사용가능 피팅을 제공하는 분석물 농도; ·작동자에 의해 확인된 바와 같은 취급 오류; ·비-물리적 피팅(예컨대, 센서그램 베이스라인 차감 후에도 상향으로 기울어지는 해리 단계 신호); ·비수렴적 피팅 ·-log10KD 값 ≤ 8.5과 함께, 피팅에 포함된 대략적인 최고 분석물 농도(통상적으로 500 nM)에 대해, 10 미만의 추정된 신호 대 노이즈 비율; ·-log10KD 값 > 8.5과 함께, 피팅에 포함된 최고 분석물 농도에 대해, 70 미만의 추정된 신호 대 노이즈 비율; ·tc < -300초 또는 tc > 0초인, 피팅에 포함된 최고 분석물 농도에 대한 tc 값; ·NGS 실패; ·비-클론 서열(두 서열 사이의 Levenshtein 거리가 2보다 클 경우, 우성 서열은 이차 서열보다 100배 미만으로 풍부함); 및/또는 ·서열은 (서열 오류를 수용할 만큼의 서열 동일성 허용 오차 내) 합성된 올리고 풀 내의 임의의 설계된 변이체 와 일치하지 않음. KD 및 koff는 -log10으로 변환되는 한편, kon은 log10으로 변환되었다. 유의한 배치 효과의 부재에 대해 동역학 파 라미터의 분포를 시각적으로 검사하였다. 동일한 항체 변이체의 다수의 측정(일반적으로 (a) 동일한 SPR 실행에 서의 동일한 클론의 중복 연속 측정; (b) 별도의 실행에서 측정된 중복 384-웰 플레이트로부터의 동일한 클론의 기술적 복제물; (c) 이용 가능한 경우 동일한 번역을 갖는 2개의 DNA 변이체; 및 (d) 변이체의 독립적인 클론) 을 로그 공간에서 평균화하였다. 응집 시 -log10KD 측정치가 5%를 초과하는 변동 계수를 나타낸 변이체는 탈락시 켰다. 관찰된 항체 공간(OAS) 데이터베이스 프로세싱 쌍을 이루지 않은 면역글로불린 사슬의 OAS 데이터베이스[48]는 2022년 2월 1일에 다운로드되었다. 전체 데이터 베이스로부터, 원시 OAS 데이터에 대해 다음 제외 기준이 적용되었다: 첫째, 해당 데이터베이스의 다른 연구(작 성자 필드 Bonsignori 등, Halliley 등, Thornqvist 등)로부터 유래된 샘플이 있는 연구; 둘째, 미성숙 B 세포(BType 필드 미성숙-B-세포 및 Pre-B-세포) 및 B 세포 연관 암(질병 필드 경쇄 아밀로이드 증, CLL)으로부터 유래된 연구; 그리고, 최종적으로, 다음 기준 중 어느 하나가 충족되는 경우, 해당 서열을 제 외시켰다: ·서열에 정지 코돈이 포함됨 ·서열이 비생산적임 ·V 및 J 분절이 프레임에서 벗어남 ·프레임워크 영역 2가 누락됨 ·프레임워크 영역 3이 누락됨 ·CDR3이 37개 아미노산보다 김 ·가장 가까운 생식선과의 J 분절 서열 동일성이 50% 미만임 ·임의의 CDR의 시작 또는 종료 지점에서의 아미노산이 서열에 누락됨 ·보존된 시스테인 잔기가 누락됨 ·유전자좌가 사슬 유형과 불일치함 생성된 서열로부터, 그리고 2개의 (중쇄/경쇄) 사슬 각각에 대해, 2개의 유형의 하위 서열을 추출하였다: \"CDR\" 및 \"근-전장 길이(NF)\". CDR 데이터세트에서, IMGT[49] 및 Martin[50] 라벨링 체계의 조합에 의해 정의된 바와 같이 CDR1, CDR2 및 CDR3 분절만을 추출하였다. NF 데이터세트에서, IMGT 위치 21 내지 128(경쇄, 및 토끼 및 낙타 유래 중쇄의 경우 127)을 포함시켰다. 4개의 데이터세트 모두에서, 중복 정보(즉, 각각의 연구에서 특정 서열이 관찰된 횟수)를 도표화하면서 중복된 서열을 제거하였다. 하나의 중복을 갖는 서열(즉, 단일 연구에서 단지 한 번만 관찰됨)은 시퀀싱 오류와는 달리 실제 생물학적 서열의 증거가 불충분하다는 이유로 탈락되었다. 도 14는 일부 양태에 따른, 각각의 전처리 단계 후에 필터링 제외되고 유지되는 서열의 수를 나타내는, 컴퓨터 구현 방법을 도시하는 흐름도를 도시한다. 방법은 OAS 데이터세트를 프로세싱하는 단계에 의해 4개의 데이터베이스를 구축하는 단계를 포함할 수 있 다. 방법은, 전술한 바와 같이, 2개의 사슬, 즉 중쇄 및 경쇄 각각에 대해, 서열의 2개의 서브세트(CDR 단독 및 근-전장 항체 서열)를 추출하는 단계에 의해 데이터베이스를 구축하는 단계를 포함할 수 있다. 방법 은, 돌연변이된 위치의 위치설정로 인해 근-전장 데이터세트에 대해 학습된 모델이 사용될 수 있는 CR 9144 사례 연구를 제외하고, 결합 친화도 및 자연도 예측을 위해 CDR 데이터세트에 대해 학습된 모델을 사용하 는 단계를 포함할 수 있다. 도 14에서 \"H\" 및 \"L\"로 표시된 숫자는 각각의 단계에서 필터링되거나 보유된 고유 중쇄 및 경쇄 서열을 각각 나타낸다, 방법은 도 1의 컴퓨팅 장치와 같은 컴퓨팅 장치에 의해 수행될수 있다. 모델 아키텍처 단백질 언어 모델은 다양한 단백질 조작 작업에 걸쳐 높은 가능성을 나타냈다[17, 51-55]. 일부 양태에서, 본 아키텍처는 RoBERTa 모델[56] 및 Hugging Face 프레임워크[57] 내의 PyTorch 구현에 기초한다. 일부 양태에서, 모델은 계층 당 12개의 어텐션 헤드를 갖는 16개의 숨겨진 층을 포함한다. 일부 양태에서, 숨겨진 계층 크기는 768이고 중간 층 크기는 3072이다. 전체적으로, 모델은 1억 1,400만 개의 파라미터를 포함할 수 있다. 파일럿 연구에서, 이보다 더 크고 더 작은 모델을 시험하였고, 마스킹된 언어 모델링 작업 및 회귀 작업 둘 모두에서 이들 각각의 손실을 비교하였다. 더 작은 모델은 저조한 성과를 보인 반면, 더 큰 모델은 상당한 성능 향상을 제공하지 않았으며, 이는 본 선택된 모델 크기가 적절하다는 것을 확인한다. 그러나, 당업자는 본 기술의 목적 을 달성하기 위해, 상이하게 구성되고 상이하게 파라미터화된 모델이 본 기술에 사용될 수 있음을 이해할 것이다. 모델 학습 OAS 항체 서열을 이용한 사전학습 일부 양태에서, 본원에 제시된 결합 친화도를 예측하기 위한 모델은 OAS 데이터베이스 프로세싱으로부터 생성된 4개의 데이터세트로부터의 면역글로불린 서열에 대해 사전학습된 RoBERTa 아키텍처로부터 유래될 수 있다(전술 한, 관찰된 항체 공간(OAS) 데이터베이스 프로세싱 참조). 따라서, 4개 이상의 모델이 중쇄 또는 경쇄, CDR 또 는 NF 서열로 학습될 수 있다. 일부 양태에서, 학습 서열은 언어 모델을 컨디셔닝하기 위한 종 토큰(예를 들어, 인간의 경우 h, 마우스의 경우 m 등)을 함유한다[58]. 또한, CDR 모델에 대한 입력 서열은, 원래 불연속적인 CDR 분절이 단일 입력 서열로 연결될 수 있도록, CDR-제한 토큰을 포함할 수 있다. 일부 양태에서, CDR 모델은, 데이터세트에 존재하는 일부 프레임워크 치환으로 인해 NF 모델이 사용될 수 있는 CR9114 사례 연구를 제외하고, 모든 결합 친화도 및 자연도 예측에 사용될 수 있다. 일부 양태에서, 모델 학습은, Wolf 등[56]에 기술된 바와 같이, 동적 마스킹 절차에 따라 자체 지도 방식[48]으 로 수행될 수 있으며, 이에 의해 서열 중 토큰의 15%는 특수 [MASK] 토큰으로 무작위로 마스킹된다. 마스킹을 위해, Hugging Face 프레임워크의 DataCollatorForLanguageModeling 클래스가 사용될 수 있으며, 이는 Wolf 등"}
{"patent_id": "10-2024-7026560", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "[56]과 달리, 단순히 무작위로 선택된 모든 토큰을 마스킹한다. 학습은, 예를 들어, 10-6의 , 0.003의 가중치 감 쇠, 및 10의 클램프 값으로 LAMB 옵티마이저[59]를 사용하여 수행될 수 있다. 일부 양태에서, 사용된 최대 학습 속도는 선형 감쇠 및 1000개 단계 워밍업, 0.2의 드롭아웃 확률, 0.01의 가중치 감쇠, 및 416의 배치 크기에서 10-3이었다. 일부 양태에서 모델은 최대 10개의 세대에 대해 학습될 수 있다. 친화도 데이터를 이용한 미세 조정 전달 학습은, 다수의 노드(예를 들어, 768개)를 갖는 조밀한 숨겨진 계층에 이어서 필요한 수의 출력을 갖는 프 로젝션 계층을 추가함으로써, OAS-사전학습 모델을 활용하기 위한 일부 양태에서 사용될 수 있다. 모든 계층은 학습 동안 모든 모델 파라미터를 업데이트하기 위해 프리징되지 않은 상태로 유지될 수 있다. 학습은, 예를 들 어, 10-5의 학습 속도에서, 0.01의 가중치 감쇠, 0.2의 드롭아웃 확률, 100개의 워밍업 단계를 갖는 선형 학습 속도 감쇠, 64의 배치 크기, 및 손실 함수로서의 평균 제곱 오차(MSE)를 갖는 AdamW 옵티마이저[60]로 수행될 수 있다. 일부 양태에서, 본 모델은 25,000개의 단계에 대해 학습될 수 있다. 모든 실행에 대한 단계 수, 배치 크기, 및 학습 속도는 파일럿 데이터세트를 사용하여 하이퍼파라미터 스위프를 통해 결정하였다. 예를 들어, 그리드 검색 을 3가지 학습 속도(10-4, 10-5, 10-6), 3가지 배치 크기(64, 128, 256), 및 2가지 단계 수(25,000; 50,000)에 걸쳐 실행하였다. 각각의 하이퍼파라미터 세트는 예를 들어 도 15a에 도시된 바와 같이, 파일럿 데이터세트로부 터, 또는 도 15b에 도시된 바와 같이, 파일럿 데이터세트로부터 무작위로 선택된 500개의 서열의 서브세트로부 터의 90:10 학습:홀드-아웃 분할을 사용하여, OAS 사전학습 RoBERTa 모델을 미세 조정하는 데 사용될 수 있다. 도 15a 및 도 15b의 파일럿 데이터세트의 하이퍼파라미터 스위프는 모델을 학습시키는 데 필요한 시간과 함께, 각각의 모델에 대한 시험 세트에 대한 예측 정확도의 3개의 메트릭을 포함할 수 있다. 모델 성능을 유지하면서 모델 학습 시간을 최소화하기 위해, 최종 하이퍼파라미터는, 예를 들어 학습 속도 10-5의 경우, 64의 배치 크기,및 25,000개의 학습 단계일 수 있다. qaACE 및 SPR 데이터를 사용하는 공동 학습 일부 양태에서, 모델은, 각각의 회귀 작업에 대한 평균 제곱 오차의 가중 합계를 손실 함수로서 사용하여, 서열 로부터 qaACE 및 SPR 값 둘 모두를 예측하는 데 사용될 수 있다. 예를 들어, 가중치에 걸친 스위프는, 도 16에 나타낸 바와 같이, SPR에 대한 1:50 가중치가 가장 높은 결합 정확도를 제공함을 나타낸다. 일부 양태에서, 모 델은 10-배 교차 검증 설정에서 풀링된 배수 이탈 예측을 사용하고, ACE 및 SPR 실험 둘 모두의 데이터를 동시 에 사용하고, 가중치 합계를 사용하여 각각의 데이터 세트의 손실을 결합하여, 평가될 수 있다. 배수 이탈 예측 은 SPR에 의해 측정된 -log10KD 값의 비교를 위해 10-배 교차 검증과 함께 풀링될 수 있다. 모델 특성화 베이스라인 사전학습된 모델에 대한 미세 조정의 효과를 평가하기 위해, 2개의 베이스라인이 평가될 수 있다. 첫째, XGBoost[61] 모델은 아미노산의 원-핫 인코딩(one-hot encoding)을 사용하여 구현될 수 있다. 예를 들어, 도 17에 도시된 바와 같이, 다음의 7개의 XGBoost 하이퍼파라미터가 파일럿 데이터세트에 대한 그리드 검색을 사용 하여 선택될 수 있다: eta=0.5, 감마=0, n_추정자=1000, 서브샘플=0.6, max_깊이=9, min_자녀_가중치=1, 수집_ 샘플_바이_트리=1. 도 17은 7개의 최적화된 XGBoost 하이퍼파라미터 각각에 걸친 10-배 교차 검증의 시험 세트 정확도를 도시한다. 완전한 파일럿 데이터세트, 및 선택된 서열의 수(예를 들어, 500개)를 포함하는 파일럿 데 이터세트의 서브세트 둘 모두를 사용하여, 각 하이퍼파라미터에 대한 값의 수(예를 들어, 3개)에 걸쳐 완전한 그리드 검색을 수행할 수 있다. 일부 양태에서, 디폴트 값이 다른 하이퍼파라미터에 사용될 수 있다. 둘째, 사전학습된 모델과 동일한 아키텍처 를 갖는 RoBERTa 모델은 OAS 사전학습 없이 무작위로 초기화된 가중치로부터 시작하는 친화도 데이터로 학습될 수 있다. 결합 친화도의 분포 외 예측 학습 세트에서 보이는 분포 외부의 결합 친화도에 대한 예측력을 평가하기 위해, 본 기술은 학습 세트로부터 부 모 트라스투주맙의 것보다 더 높은 -log10KD를 갖는 임의의 변이체를 배제함으로써 모델을 미세 조정하는 것을 포함할 수 있다. 또한, 모델은 SPR에 의해 검증된 트라스투주맙보다 강한 결합제가 매우 풍부한 서열 세트의 친 화도의 예측을 수행할 수 있다. 학습 데이터의 크기 및 충실도 평가 일부 양태에서, 모델은 다양한 충실도의 데이터세트로부터의 상이한 크기의 서브세트를 사용하여 학습될 수 있 다. trast-3 데이터세트를 고 충실도 데이터세트로서 처리하였다. 동일한 전처리 워크플로우를 사용하여, 단일 FACS 분류로부터 각 서열에 대한 단일 DNA 변이체를 단리함으로써 저 충실도 데이터세트를 생성하였다. 각각의 학습 데이터세트는 분할될 수 있다(예를 들어, 각각 1, 2, 4, 8, 16, 32, 64 및 128개의 서브세트로 균등 분할 됨). 각각의 학습 서브세트는 무작위로 초기화된 가중치로 모델을 직접 학습시키고, OAS 사전학습 모델을 미세 조정하는 데 사용될 수 있다. 원래의 trast-3 데이터세트로부터의 데이터의 10%를 포함하는 공통 홀드-아웃 데 이터세트는, 일부 양태에서, 데이터 소스 또는 학습 세트 크기에 관계없이, 모든 모델을 평가하는 데 사용될 수 있다. 이들 서열은 학습 서브세트의 구성 전, 두 데이터세트 모두로부터 제거될 수 있다. 임베딩 임베딩은, 모델의 최종 숨겨진 계층, 즉 제외된 헤드로부터의 활성화의 평균 풀을 취함으로써 생성될 수 있다. 각각의 서열의 임베딩의 결과적인 크기는, 예를 들어 768일 수 있다. 임베딩의 차원은, 예를 들어 RAPIDS 라이 브러리[62]에서 구현된 바와 같이 UMAP(Uniform Manifold Approximation and Projection) 알고리즘으로 감소될 수 있다. 제1 조사에서, OAS 사전학습의 존재 또는 부재, 및 trast-2 데이터세트를 사용한 결합 친화도 미세 조정의 존재 또는 부재로부터 생성된, 4개의 상이한 모델로부터의 임베딩을 비교하였다. 제2 조사에서, 임베딩은 내부 표현 공간에 근접한 변이체를 클러스터링하는 데 활용되었다. 이러한 목적을 위해, 차원 감소된 임베딩을 필터링하여, 예측된 qaACE 점수에 기초하여 강한 결합제만을 유지하였고, 3D 임베딩을, HDBSCAN[63]을 사용하여 40개의 서열의 최소 클러스터 크기로 클러스터링하였다. 각각의 클러스터에 대한 시퀀스 로고 플롯은Logomaker[64]를 사용하여 생성될 수 있다. 유전자 상호작용 돌연변이 간의 유전자 상호작용은 이중 돌연변이체, 성분 단일 돌연변이체, 및 부모 항체 서열에 대한 예측된 친화도 점수를 고려하여 평가될 수 있다. 구체적으로, 2개의 돌연변이, m1 및 m2 사이의 유전자 상호작용 효과는 다음과 같이 계산될 수 있다:"}
{"patent_id": "10-2024-7026560", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "식 중, yi는 돌연변이(들) i를 갖는 돌연변이체에 대한 예측된 qaACE 점수를 나타내거나, ywt의 경우 부모 서열 에 대한 예측된 qaACE 점수를 나타낸다. 항체 자연도 서열의 자연도 ns는 마스킹된 언어 모델(MLM)에 대한 Salazar 등[65]에 의한 정의에 따른 이의 의사-복잡성의 역으로서 정의될 수 있다. N개의 토큰을 갖는 시퀀스 S의 경우, 파라미터 Θ를 갖는 MLM이 해당 시퀀스에 할당 되는 의사 가능성은 다음과 같이 제공된다: . 의사-복잡성은 먼저 서열 길이만큼 의사-가능성을 정규화한 다음 음의 지수 함수를 적용함으로써 수득된다: . 따라서, 서열 자연도는 다음과 같다: . 자연도 점수는 전술한 2개의 사전 학습된 모델을 사용하여 계산될 수 있다(OAS 항체 서열을 이용한 사전학습 참 조). 서열 자연도와의 잠재적 관계를 조사하기 위해 여러 항체 특성(면역원성, 개발가능성, 발현 수준, 및 돌연 변이 부하)가 분석될 수 있다. 구성원이 두 사슬 모두에서 변동(면역원성 및 발현 수준)을 나타내는 데이터세트 의 경우, 보고된 자연도 점수는 개별 중쇄 및 개별 경쇄 점수의 평균일 수 있다. 구성원이 중쇄에서만 변동(개 발가능성 및 돌연변이 부하)을 나타내는 데이터세트의 경우, 중쇄 자연도 점수만 연산될 수 있다. 일부 양태에 서, 자연도 점수는 CDR 데이터세트에 대해 학습된 모델로부터의 모든 경우에 대해 기록된다(전술한, OAS 항체 서열을 사용한 사전학습 참조). 자연도 연관 플롯 자연도와 관심 항체 특성 사이의 관계를 평가하기 위해, 본 기술은 자연도 연관 플롯을 사용할 수 있다. 이러한 플롯을 작제하기 위해, 각각의 행이 한 쌍의 (항체 자연도, 항체 특성 값)을 함유하는 2-열 표가 고려될 수 있 다. 이어서, 다음의 절차가 따를 수 있다: ·자연도 값을 4개의 균등하게 이격된 간격(낮음, 낮음-중간, 중간-높음, 높음)으로 나누어, 자연도 범위를 4개 로 나누어 정렬한다. ·각각의 자연도 간격에 대해, 해당 간격 내에 속하는 자연도를 갖는 항체의 특성 값을 취하고, 중앙값(연속 특 성) 또는 양성 분율(이진 특성)으로 해당 값을 집계한다. 이어서, 자연도 간격(X축)별 집계 값(Y축)이 박스 플 롯(연속 특성) 또는 막대 플롯(이진)으로 도표화된다. ·증가 또는 감소 추세에 대한 Jonckheere-Terpstra 검정을 계산하고 해당 p-값을 기록한다. ·중앙값(박스 플롯의 경우) 또는 높이(막대 플롯의 경우)를 연결하는 파선을 추가한다. 박스플롯의 경우, 위스커(whisker) 파라미터는 1.5로 설정될 수 있고, 이상치는 도표화되지 않을 수 있다. 일반 적으로, 연속 변수를 집계하기 위해 중앙값 및 정렬을 사용하는 이론적 근거는 이상치 및 노이즈 데이터 포인트 의 영향을 감소시키기 위한 것이다. 면역원성 본 기술은 Marks 등[28]으로부터의 항-약물 항체(ADA) 반응을 가진 환자의 백분율로서 보고된 면역원성 반응을 수득하는 것을 포함할 수 있다. 모든 종류의 항체(인간, 인간화, 키메라, 하이브리드, 마우스) 중, 부류 간 비교는 사소하고 단순한 종 구분에 해당하는 반면, 부류 내 비교는 난관이 있으며 실질적으로 관련성을 갖고; 인간화 항체는 해당 데이터 세트에서 가장 큰 부류(n=97)를 나타내므로 가장 큰 통계적 힘을 제공하고; 데이터 세트에서 두 번째로 큰 부류인 인간 항체와 비교하여, 인간화 항체는 원칙적으로 이의 CDR의 동물 기원 으로 인해 더 높은 면역원성을 가지며, 이에 따라 조작/인간화 시 달성된 인간 자연도의 정도를 평가하기 위한 실질적으로 관련된 사례 연구를 제공하기 때문에, 일부 분석 양태에는 인간화 항체만이 포함될 수 있다. 개발가능성 서열 개발가능성은, 항체 서열이 치료 항체 프로파일러(TAP) 도구에 의해 연산된 개발가능성 플래그 중 적어도 하나에 대해 실패하는지의 여부를 나타내는 이진 변수로서 정의될 수 있다[31]. 이러한 플래그에 대한 자세한 정의는 전술한 TAP 분석 하위 섹션을 참조한다. 본 기술은 Liu 등[29]에 기술된 파지 디스플레이 라이브러리로부터의 중쇄 서열(n=882)의 히트(라운드 2와 비교 된 라운드 3에서의 양성 농축)를 채점하는 것을 포함할 수 있으며, 이는 Gifford 라이브러리로서 지칭된다. 본 기술은 또한, (trast-3 데이터세트의 동일한 돌연변이 유발 전략에 따른) CDRH2의 10개의 위치 및 CDRH3의 10개 의 위치에서의 최대 3개의 동시 아미노산 치환을 갖는 트라스투주맙 변이체를 분석하는 것을 포함할 수 있다. Gifford 라이브러리 데이터세트의 프로세싱 본 기술은 Liu 등[29]에 기술된 Gifford 라이브러리로부터 파지 디스플레이 데이터를 수득하는 것을 포함할 수 있다. 구체적으로, 농축의 라운드 2(E1_R2) 및 라운드 3(E1_R3)을 위한 원시 FASTQ 파일은 수탁 번호 SRP158510 하에 NIH's Sequence Read Archive(SRA)로부터 다운로드될 수 있다. 이어서, Liu 등[29]에 따른, 데 이터 프로세싱을 위한 지침을 따를 수 있다. 우선, TATTATTGCGCG(서열번호 26) 및 TGGGGTCAA의 측부 DNA 서열이 CDRH3 서열을 당기는 데 사용될 수 있다. 이어서, N을 포함하거나 번역될 수 없는(3으로 나눌 수 없는) 서열은 배제될 수 있다. 다음으로, DNA 서열은 단백질 서열로 번역될 수 있으며, 조기 정지 코돈을 함유하는 경우 탈락 될 수 있다. 이어서, 8개 아미노산보다 짧거나 20개 아미노산보다 긴 CDRH3 서열이 필터링될 수 있다. 마지막으 로, 각각의 고유 서열의 발생 횟수가 결정될 수 있으며, 일부 양태에서, 6회 미만으로 발생하는 서열은 노이즈 로 간주되고 탈락/제외된다. Gifford 라이브러리 데이터세트에서의 스캐폴드 서열의 작제 NF 언어 모델을 사용하는 분석을 위해 전장 항체 서열이 요구될 수 있다. 그러나, Liu 등의 원시 시퀀싱 데이터"}
{"patent_id": "10-2024-7026560", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "[29]는 CDRH3만을 포함하며, 원래의 연구는 서열이 아닌 스캐폴드 유전자 명칭을 제공한다. 따라서, 본 기술의 일부 양태에서, 항체 서열은 제공된 유전자 명칭으로부터 재구성될 수 있다. 중쇄의 경우, 본 기술은 IGHV3-23 생식선을 사용할 수 있고 다음의 변형을 수행할 수 있다: Liu 등[29]에 따라, CDRH3이 DY로 종료된 경우, IGHJ4 서열을 IGHV3-23에 첨부하지만, CDRH3이 DV로 종료된 경우, 그 대신 IGHJ6을 사용한다. 중쇄 유전자는 또한 IgBlast와 교차 검증될 수 있다. 생성된 스캐폴드 서열은 아래에 보고되어 있으며, 여기에서 __CDR3__ 위치표시자는 선택된 NGS-유래 CDRH3 서열 로 대체되었다: TAP 분석 본 기술은 개발가능성 점수를 계산하기 위해 Raybouldet 등[66]에 기술된 치료 항체 프로파일러(TAP)를 사용할 수 있다. 해당 툴의 상업적으로 인가된 가상 머신 이미지(예를 들어, 2022년 2월 7일에 마지막으로 업데이트 됨)가 사용될 수 있다. TAP는 다섯 가지의 개발가능성 메트릭을 계산한다: 총 CDR 길이, 표면 패치 소수성(PSH), 양전하 패치(PPC), 음전하 패치(PNC), 및 구조적 Fv 전하 대칭 파라미터(SFvCSP). 또한, 이는 치 료 항체의 기준 세트 대비 해당 메트릭이 허용 가능한지의 여부에 대한 플래그를 생성한다. 기준 분포를 벗어나 는 메트릭은 \"적색\"으로 플래그될 수 있는 한편, 분포의 가장 극단적인 5% 내에 속하는 메트릭은 \"황색\"일 수 있고, 5% 임계값을 초과하는 분포의 본체에 속하는 메트릭은 \"녹색\"일 수 있으며 허용 가능하다. TAP를 사용하여, Gifford 라이브러리 데이터세트로부터의 서열 히트뿐만 아니라 트라스투주맙 변이체를 분석할 수 있다. TAP 플래그는 항체가 허용 가능한 개발가능성 점수를 갖는지의 여부를 결정하며, TAP 플래그 중 적어 도 하나가 녹색이 아닌 경우, 해당 항체 변이체는 실패로 간주될 수 있다. HEK-293 세포에서의 항체 발현 일부 양태에서, HEK-293 세포에서의 임상 단계 항체 발현 수준은 Jain 등으로부터 수집될 수 있다 [30]. 데이터 세트는 항체 유형(예를 들어, 인간, 인간화, 키메라 등)과 관련하여 이종일 수 있다. 면역원성에 대해 설명된 것과 동일한 이유로, 본 기술은 인간화 항체(n=67)에 중점을 둘 수 있다. HEK-293 역가에 더하여, Jain 등은 추가적인 생물물리학적 측정치를 보고하였다. 시험에서, 자연도 점수와 역가 이외의 생물물리학적 파라미터 사이의 연관성은 구체적으로 식별되지 않았다. 그 러나, 당업자는 임상-단계 항체의 데이터세트가 유리한 특성을 갖는 항체에 대해 이미 분명히 편향되어 있음을 이해할 것이며, 이는 생물물리학적 파라미터의 분포에는 성능이 불량한 항체가 크게 고갈되어 있음을 의미한다. 양성이지만 음성이 아닌 실시예의 가용성은 생물물리학적 파라미터와 자연도와 같은 다른 메트릭 간의 연관성을 검출하는 능력을 심각하게 제한한다. 돌연변이 부하 돌연변이 부하는 이의 부모 서열과 비교된 항체 변이체 중 아미노산 치환의 수로서 정의될 수 있다. 본 기술은 1 내지 3개의 돌연변이 부하를 갖는 6,710,401개의 트라스투주맙 변이체에 걸친 자연도 점수의 분포를 분석할 수 있다(CDRH2에서의 10개 위치 및 CDRH3에서의 10개 위치, 시스테인을 제외한 모든 천연 아미노산을 허용함). 본 기술은 경향에 대한 Jonckheere-Terpstra 검정을 사용하여 돌연변이 부하 별 자연도 점수 분포의 차이의 통 계적 유의성을 평가하는 것을 포함할 수 있다. 유전적 알고리즘 원하는 특성(예를 들어, 높은/낮은/표적 qaACE 점수 및 높은 자연도)을 갖는 서열 변이체를 생성하기 위해, 본 기술은, 예를 들어 Python으로 이루어진 DEAP 라이브러리[67]의 맞춤형 버전을 사용하는 유전자 알고리즘(GA)을 포함할 수 있다. 이러한 GA에서, 각각의 개별 서열 변이체는 전술한 CDR 표현(IMGT 및 Martin 정의의 조합)으로 환원될 수 있다. 각각의 GA 실행은 단일 트라스투주맙 서열로부터 초기화될 수 있다. 각각의 서열의 예측된 qaACE 및 자연도 점수는 전술한 모델을 사용하여 평가될 수 있다. μ + λGA에서 흔한 시작 서열 풀에 사이클 선택-재생-돌연변이-컬링 프로세스를 적용하였다[68]. 각각의 자손 풀은, 예를 들어, 200개의 새로운, 고유 1062개의 개체와 함께. 원래의 100개의 부모를 포함할 수 있다. 자손 중 30%는 부모의 단일 점 돌연변이(시스테인 제외)로부터 생성되었고, 70%는 두 부모 사이의 2-점교차로부터 생성되었다. 예를 들어, GA는 단일 서열로부터 초기화되기 때문에, 제1 자손 풀은 299개의 개체들을 포함하였고, 이들 모두 는 트라스투주맙으로부터의 단일 점 돌연변이를 사용하여 생성되었다. 일부 양태에서, 모든 서열은 trast-3 라 이브러리 연산 공간 내에 유지되도록 제한될 수 있다(CDRH2 및 CDRH3에서 각각 10개 위치에서 최대 삼중 돌연변 이체). 이러한 제약 조건 내에서 고유한 자손을 생산될 수 없는 경우, 해당 제약 내에서 무작위로 생성된 개체 가 자손 풀에 첨가될 수 있다. 대체가 없는 토너먼트 선택(토너먼트 크기 = 3)은 모집단(크기 = 300)을 컬링하 고 다음 생성(크기 = 100)을 위한 개체를 선택하도록 수행될 수 있다. 이러한 프로세스는 GA의 하나의 \"생성\"을 나타냈다. GA는 다수의 생성(예를 들어, 20개 생성)에 대해 실행될 수 있다. qaACE 점수와 자연도 객체화 간의 적절한 균형을 유지하기 위해, 피트니스 목표는 다음과 같이 정의될 수 있다:"}
{"patent_id": "10-2024-7026560", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 11, "content": "본 기술 모델의 생성 능력을 시험하기 위해, GA는 다음 구성으로 실행될 수 있다: ·자연도 최대화에서, 목표 qaACE 점수 = 9(qaACE 점수 최대화) ·자연도 최대화에서, 목표 qaACE 점수 = 1(qaACE 점수 최소화) ·자연도 최대화에서, 목표 qaACE 점수 = 6 예를 들어, GA는 제1 생성에서 300개의 개체 및 각각의 후속 생성에서 200개의 개체를 쿼리하기 때문에, GA는 20개 생성에 걸쳐 4,100개의 (비고유) 서열을 쿼리한다. 베이스라인으로서, 본 기술은 전체 돌연변이 검색 공간으로부터 4,100개의 서열을 무작위로 선택하는 단계, 및 전술한 바와 같이 가장 높은 적합도를 갖는 상위 100명의 개체를 선택하는 단계를 포함할 수 있다. 피트니스 기 능은 또한 돌연변이 공간의 완전 검색 및 trast-3 데이터세트로부터 상위 100개의 개체를 식별하는 데 사용될 수 있다. 참조문헌 1. S. M. Paul, D. S. Mytelka, C. T. Dunwiddie, C. C. Persinger, B. H. Munos, S. R. Lindborg, 및 A. L. Schacht의 문헌[\"How to improve R&D productivity: the pharmaceutical industry's grand challenge,\" Nature Reviews Drug Discovery, vol. 9, pp. 203-214, Feb 2010]. 2. S. Yamaguchi, M. Kaneko, 및 M. Narukawa의 문헌[\"Approval success rates of drug candidates based on target, action, modality, application, and their combinations,\" Clinical and Translational Science, vol. 14, pp. 1113-1122, Apr 2021]. 3. J. P. Hughes, S. Rees, S. B. Kalindjian, 및 K. L. Philpott의 문헌[\"Principles of early drug discovery,\" British Journal of Pharmacology, vol. 162, pp. 1239-49, Mar 2011]. 4. J. Ministro, A. Manuel, 및 J. Goncalves의 문헌[\"Therapeutic antibody engineering and selection strategies,\" Advances in biochemical engineering/biotechnology, vol. 171, pp. 55-86, Nov 2019]. 5. K. R. Hanning, M. Minot, A. K. Warrender, W. Kelton, 및 S. T. Reddy의 문헌[\"Deep mutational scanning for therapeutic antibody engineering,\" Trends in Pharmacological Sciences, vol. 43, no. 2, pp. 123-135, 2022]. 6. T. Kuramochi, T. Igawa, H. Tsunoda, 및 K. Hattori의 문헌[\"Humanization and simultaneous optimization of monoclonal antibody,\" Methods in Molecular Biology, vol. 1060, pp. 123-137, 2014]. 7. C. Schneider, A. Buchanan, B. Taddese, 및 C. M. Deane의 문헌[\"DLAB-Deep learning methods for structure-based virtual screening of antibodies,\" Bioinformatics, vol. 38, pp. 377-383, Sep 2021]. 8. A. Khan, A. I. Cowen-Rivers, D.-G.-X. Deik, A. Grosnit, K. Dreczkowski, P. A. Robert, V. Greiff, R. Tutunov, D. Bou-Ammar, J. Wang, 및 H. Bou-Ammar의 문헌[\"AntBO: Towards real-world automated antibodydesign with combinatorial bayesian optimisation,\" arXiv:2201.12570 [q-bio.BM], 2022]. 9. W. Jin, J. Wohlwend, R. Barzilay, 및 T. S. Jaakkola의 문헌[\"Iterative refinement graph neural network for antibody sequence-structure co-design,\" arXiv:2110.04624 [q-bio.BM], 2022]. 10. W. Jin, D. Barzilay 및 T. Jaakkola의 문헌[\"Antibody-antigen docking and design via hierarchical structure refinement,\" in Proceedings of the 39th International Conference on Machine Learning (K. Chaudhuri, S. Jegelka, L. Song, C. Szepesvari, G. Niu, 및 S. Sabato(eds.), vol. 162 of Proceedings of Machine Learning Research, pp. 10217-10227, PMLR, 17-23 Jul 2022]. 11. S. Luo, Y. Su, X. Peng, S. Wang, J. Peng, 및 J. Ma의 문헌[\"Antigen-specific antibody design and optimization with diffusion-based generative models,\" bioRxiv doi: 10.1101/2022.7.10.499510, 2022]. 12. S. P. Mahajan, J. A. Ruffolo, R. Frick, 및 J. Gray의 문헌[\"Hallucinating structure-conditioned antibody libraries for target-specific binders,\" BioRxiv doi: 10.1101/2022.6.6.494991, 2022]. 13. J. J. Jeffrey A. Ruffolo, Jeremias Sulam의 문헌[\"Antibody structure prediction using interpretable deep learning,\" Patterns, vol. 3, p. 100406, Feb 2022]. 14. R. W. Shuai, J. A. Ruffolo, 및 J. J. Gray의 문헌[\"Generative language modeling for antibody design,\" bioRxiv doi: 10.1101/2021.12.13.472419, 2021]. 15. D. M. Mason, S. Friedensohn, C. R. Weber, C. Jordi, B. Wagner, S. M. Meng, R. A. Ehling, L. Bonati, J. Dahinden, P. Gainza, B. E. Correia, 및 S. T. Reddy의 문헌[\"Optimization of therapeutic antibodies by predicting antigen specificity from antibody sequence via deep learning,\" Nature Biomedical Engineering, pp. 600-612, Apr 2021]. 16. K. Saka, T. Kakuzaki, S. Metsugi, D. Kashiwagi, K. Yoshida, M. Wada, H. Tsunoda, 및 R. Teramoto의 문헌[\"Antibody design using LSTM based deep generative model from phage display library for affinity maturation,\" Scientific Reports, vol. 11, p. 5852, Mar 2021]. 17. E. C. Alley, G. Khimulya, S. Biswas, M. AlQuraishi, 및 G. M. Church의 문헌[\"Unified rational protein engineering with sequence-only deep representation learning,\" Nature Methods, vol. 12, pp. 1315-1322, Mar 2019]. 18. Z. Ren, J. Li, F. Ding, Y. Zhou, J. Ma, 및 J. Peng의 문헌[\"Proximal exploration for model-guided protein sequence design,\" bioRxiv doi 10.1101/2022.4.12.487986, 2022]. 19. L. A. Rabia, A. A. Desai, H. S. Jhajj, 및 P. M. Tessier의 문헌[\"Understanding and overcoming trade-offs between antibody affinity, specificity, stability and solubility,\" Biochemical engineering journal, vol. 137, pp. 365-374, Sep 2018]. 20. J. Liu의 \"Activity-specific cell enrichment,\" 특허 공개 제WO 2021/146626, 22.7.2021호. 21. R. Akbar, P. A. Robert, M. Pavloviζ, J. R. Jeliazkov, I. Snapkov, A. Slabodkin, C. R. Weber, L. Scheffer, E. Miho, I. H. Haff, D. T. T. Haug, F. Lund-Johansen, Y. Safonova, G. K. Sandve, 및 V. Greiff의 문헌[\"A compact vocabulary of paratope-epitope interactions enables predictability of antibody-antigen binding,\" Cell Reports, vol. 34, p. 108856, Mar 2021]. 22. J. Bostrom, S.-F. Yu, D. Kan, B. A. Appleton, C. V. Lee, K. Billeci, W. Man, F. Peale, S. Ross, C. Wiesmann, 및 G. Fuh의 문헌[\"Variants of the antibody herceptin that interact with HER2 and VEGF at the antigen binding site,\" Science, vol. 323, pp. 1610-1614, Mar 2009]. 23. S. Biswas, G. Khimulya, E. C. Alley, K. M. Esvelt, 및 G. M. Church의 문헌[\"Low-n protein engineering with data-efficient deep learning,\" Nature Methods, vol. 18, pp. 389-396, Apr 2021]. 24. A. Burkovitz, O. Leiderman, I. Sela-Culang, G. Byk, 및 Y. Ofran의 문헌[\"Computational identification of antigen-binding antibody fragments,\" The Journal of Immunology, vol. 190, pp. 2327- 2334, Jan 2013]. 25. V. C. Xie, J. Pu, B. P. Metzger, J. W. Thornton, 및 B. C. Dickinson의 문헌[\"Contingency and chance erase necessity in the experimental evolution of ancestral proteins,\" eLife, vol. 10, Jun 2021]. 26. P. C. Phillips의 문헌[\"Epistasis ― the essential role of gene interactions in the structure and evolution of genetic systems,\" Nature Reviews Genetics, vol. 9, pp. 855-867, Nov 2008]. 27. A. M. Phillips, K. R. Lawrence, A. Moulana, T. Dupic, J. Chang, M. S. Johnson, I. Cvijovic, T. Mora, A. M. Walczak, 및 M. M. Desai의 문헌[\"Binding affinity landscapes constrain the evolution of broadly neutralizing anti-influenza antibodies,\" eLife, vol. 10, p. e71393, Sep 2021]. 28. C. Marks, A. M. Hummer, M. Chin, 및 C. M. Deane의 문헌[\"Humanization of antibodies using a machine learning approach on large-scale repertoire data,\" Bioinformatics, vol. 37, pp. 4041-4047, Jun 2021]. 29. G. Liu, H. Zeng, J. Mueller, B. Carter, Z. Wang, J. Schilz, G. Horny, M. E. Birnbaum, S. Ewert, 및 D. K. Gifford의 문헌[\"Antibody complementarity determining region design using high-capacity machine learning,\" Bioinformatics, vol. 36, pp. 2126-2133, Nov 2019]. 30. T. Jain, T. Sun, S. Durand, A. Hall, N. R. Houston, J. H. Nett, B. Sharkey, B. Bobrowicz, I. Caffry, Y. Yu, Y. Cao, H. Lynaugh, M. Brown, H. Baruah, L. T. Gray, E. M. Krauland, Y. Xu, M. Vasquez, 및 K. D. Wittrup의 문헌[\"Biophysical properties of the clinical-stage antibody landscape,\" Proceedings of the National Academy of Sciences, vol. 114, pp. 944-949, Jan 2017]. 31. M. I. J. Raybould, C. Marks, K. Krawczyk, B. Taddese, J. Nowak, A. P. Lewis, A. Bujotzek, J. Shi, 및 C. M. Deane의 문헌[\"Five computal developmentability guidelines for therapeutic antibody profiling,\" Proceedings of the National Science, vol. 116, pp. 4025-4030, Feb 2019]. 32. R. M. Adams, T. Mora, A. M. Walczak, 및 J. B. Kinney의 문헌[\"Measuring the sequence-affinity landscape of antibodies with massively parallel titration curves,\" eLife, vol. 5, p. e23156, Dec 2016]. 33. L. L. Reich, S. Dutta, 및 A. E. Keating의 문헌[\"SORTCERY-a high-throughput method to affinity rank peptide ligands,\" Journal of Molecular Biology, vol. 427, pp. 2135-50, Jun 2015]. 34. C. E. Z. Chan, A. P. C. Lim, P. A. MacAry, 및 B. J. Hanson의 문헌[\"The role of phage display in therapeutic antibody discovery,\" International Immunology, vol. 26, pp. 649-657, Aug 2014]. 35. I. T. Nakamura Y, Gojobori T의 문헌[\"Codon usage tabulated from international DNA sequence databases: status for the year 2000,\" Nucleic Acids Research, vol. 28, p. 292, Jan 2000]. 36. T. Magoc 및 S. L. Salzberg의 문헌[\"FLASH: fast length adjustment of short reads to improve genome assemblies,\" Bioinformatics, vol. 27, pp. 2957-2963, Sep 2011]. 37. L. D.의 문헌[\"Algorithms for efficiently collapsing reads with unique molecular identifiers,\" PeerJ, vol. 7, p. e8275, Dec 2019]. 38. M. Martin의 문헌[\"Cutadapt removes adapter sequences from high-throughput sequencing reads,\" EMBnet.journal, vol. 17, May 2011]. 39. P. J. Cock, T. Antao, J. T. Chang, B. A. Chapman, C. J. Cox, A. Dalke, I. Friedberg, T. Hamelryck, F. Kauff, B. Wilczynski, 및 M. J. L. de Hoon의 문헌[\"Biopython: freely available python tools for computational molecular biology and bioinformatics,\" Bioinformatics, vol. 25, pp. 1422-1423, Jun 2009]. 40. S. Andrews의 문헌[\"FastQC. A quality control tool for high throughput sequence data.\" Babraham Bioinformatics, Babraham Institute, Cambridge, United Kingdom, https://www.bibsonomy.org/bibtex/2b6052877491828ab53d3449be9b293b3/ozborn, 2010]. 41. P. Ewels, M. Magnusson, S. Lundin, 및 M. Kaeller의 문헌[\"MultiQC: summarize analysis results for multiple tools and samples in a single report,\" Bioinformatics, vol. 32, pp. 3047-3048, Jun 2016]. 42. R Core Team의 문헌[\"R: A language and environment for statistical computing.\" R Foundation for Statistical Computing, Vienna, Austria, https://www.R-project.org, 2021]. 43. T. V. Elzhov, K. M. Mullen, A.-N. Spiess, 및 B. Bolker의 문헌[minpack.lm: R Interface to the Levenberg-Marquardt Nonlinear Least-Squares Algorithm Found in MINPACK, Plus Support for Bounds. https://cran.r-project.org/web/packages/minpack.lm/minpack.lm.pdf, 2022]. 44. J. J. More의 문헌[\"The Levenberg-Marquardt algorithm: Implementation and theory,\" in Lecture Notes in Mathematics, pp. 105-116, Springer Berlin Heidelberg, 1978]. 45. J. J. More, B. S. Garbow, 및 K. E. Hillstrom의 문헌[Implementation Guide for MINPACK-1. https://www.osti.gov/biblio/5171554, 1980]. 46. K. Levenberg의 문헌[\"A method for the solution of certain non-linear problems in least squares,\" Quarterly of applied mathematics, vol. 2, pp. 164-168, Jul 1944]. 47. D. W. Marquardt의 문헌[\"An algorithm for least-squares estimation of nonlinear parameters,\" Journal of the society for Industrial and Applied Mathematics, vol. 11, no. 2, pp. 431-441, 1963]. 48. T. H. Olsen, F. Boyles, 및 C. M. Deane의 문헌[\"Observed Antibody Space: A diverse database of cleaned, annotated, and translated unpaired and paired antibody sequences,\" Protein Science, vol. 31, pp. 141-146, Jan 2022]. 49. M.-P. Lefranc, C. Pommie, Q. Kaas, E. Duprat, N. Bosc, D. Guiraudou, C. Jean, M. Ruiz, I. Da Piedade, M. Rouard, E. Foulquier, V. Thouvenin, 및 G. Lefranc의 문헌[\"IMGT unique numbering for immunoglobulin and T cell receptor constant domains and Ig superfamily C-like domains,\" Developmental & Comparative Immunology, vol. 29, pp. 185-203, Mar 2005]. 50. K. Abhinandan 및 A. C. Martin의 문헌[\"Analysis and improvements to Kabat and structurally correct numbering of antibody variable domains,\" Molecular Immunology, vol. 45, pp. 3832-3839, Aug 2008]. 51. R. Rao, N. Bhattacharya, N. Thomas, Y. Duan, X. Chen, J. Canny, P. Abbeel, 및 Y. S. Song의 문헌 [\"Evaluating Protein Transfer Learning with TAPE,\" in Neural Information Processing Systems, vol. 32, pp. 9689--9701, Cold Spring Harbor Laboratory, Jun 2019]. 52. A. Elnaggar, M. Heinzinger, C. Dallago, G. Rihawi, Y. Wang, L. Jones, T. Gibbs, T. Feher, C. Angerer, M. Steinegger, D. Bhowmik, 및 B. Rost의 문헌[\"ProtTrans: Towards Cracking the Language of Life's Code Through Self-Supervised Deep Learning and High Performance Computing,\" bioRxiv doi: 10.48550/arXiv.2007.06225, 2020]. 53. A. Rives, J. Meier, T. Sercu, S. Goyal, Z. Lin, J. Liu, D. Guo, M. Ott, C. L. Zitnick, J. Ma, 및 R. Fergus의 문헌[\"Biological structure and function emerge from scaling unsupervised learning to 250 million protein sequences,\" Proceedings of the National Academy of Sciences, vol. 118, no. 15, p. e2016239118, 2021]. 54. J. Meier, R. Rao, R. Verkuil, J. Liu, T. Sercu, 및 A. Rives의 문헌[\"Language models enable zero- shot prediction of the effects of mutations on protein function,\" in Advances in Neural Information Processing Systems (A. Beygelzimer, Y. Dauphin, P. Liang, and J. W. Vaughan, eds.), vol. 34, pp. 29287-29303, 2021]. 55. R. M. Rao, J. Liu, R. Verkuil, J. Meier, J. Canny, P. Abbeel, T. Sercu, 및 A. Rives의 문헌[\"MSA transformer,\" in Proceedings of the 38th International Conference on Machine Learning (M. Meila and T. Zhang, eds.), vol. 139 of Proceedings of Machine Learning Research, pp. 8844-8856, PMLR, Jul 2021]. 56. Y. Liu, M. Ott, N. Goyal, J. Du, M. Joshi, D. Chen, O. Levy, M. Lewis, L. Zettlemoyer, 및 V. Stoyanov의 문헌[\"RoBERTa: A robustly optimized BERT pretraining approach,\" arXiv:1907.11692 [cs.CL], 2019]. 57. T. Wolf, L. Debut, V. Sanh, J. Chaumond, C. Delangue, A. Moi, P. Cistac, T. Rault, R. Louf, M. Funtowicz, J. Davison, S. Shleifer, P. von Platen, C. Ma, Y. Jernite, J. Plu, C. Xu, T. L. Scao, S.Gugger, M. Drame, Q. Lhoest, 및 A. M. Rush의 문헌[\"Huggingface's transformers: State-of-the-art natural language processing,\" arXiv:1910.03771 [cs.CL], 2019]. 58. N. S. Keskar, B. McCann, L. R. Varshney, C. Xiong, 및 R. Socher의 문헌[\"CTRL: A conditional transformer language model for controllable generation,\" arXiv:1909.05858 [cs.CL], 2019]. 59. Y. You, J. Li, S. Reddi, J. Hseu, S. Kumar, S. Bhojanapalli, X. Song, J. Demmel, K. Keutzer, 및 C.-J. Hsieh의 문헌[\"Large batch optimization for deep learning: Training bert in 76 minutes,\" arXiv:1904.00962 [cs.LG], 2019]. 60. I. Loshchilov 및 F. Hutter의 문헌[\"Fixing weight decay regularization in Adam,\" https://openreview.net/forum?id=rk6qdGgCZ, 2018]. 61. T. Chen 및 C. Guestrin의 문헌[\"XGBoost: A scalable tree boosting system,\" in Proceedings of the 22nd ACM SIGKDD International Conference on Knowledge Discovery and Data Mining, KDD '16, (New York, NY, USA), pp. 785-794, ACM, 2016]. 62. R. D. Team의 문헌[RAPIDS: Collection of Libraries for End to End GPU Data Science, 2018]. 63. R. J. G. B. Campello, D. Moulavi, 및 J. Sander의 문헌[\"Density-based clustering based on hierarchical density estimates,\" in Advances in Knowledge Discovery and Data Mining, pp. 160-172, Springer Berlin Heidelberg, 2013]. 64. A. Tareen 및 J. B. Kinney의 문헌[\"Logomaker: beautiful sequence logos in Python,\" Bioinformatics, vol. 36, pp. 2272-2274, Dec 2019]. 65. J. Salazar, D. Liang, T. Q. Nguyen, 및 K. Kirchhoff의 문헌[\"Masked language model scoring,\" arXiv:1910.14659 [cs.CL], 2019]. 66. M. I. J. Raybould, C. Marks, K. Krawczyk, B. Taddese, J. Nowak, A. P. Lewis, A. Bujotzek, J. Shi, 및 C. M. Deane의 문헌[\"Five computational developability guidelines for therapeutic antibody profiling,\" Proceedings of the National Academy of Sciences, vol. 116, pp. 4025- 4030, Feb 2019]. 67. F.-A. Fortin, F.-M. De Rainville, M.-A. Gardner, M. Parizeau, 및 C. Gagne의 문헌[\"DEAP: Evolutionary algorithms made easy,\" Journal of Machine Learning Research, vol. 13, pp. 2171-2175, Jul 2012]. 68. H. Beyer 및 H. Schwefel의 문헌[\"Evolution strategies - a comprehensive introduction,\" Natural Computing, vol. 1, pp. 3-52, Mar 2002]. 보충 정보 Tite-seq CR9114 데이터세트 데이터세트 프로세싱 Tite-seq CR9114 데이터세트[27]는 3개의 상이한 인플루엔자 헤마글루티닌(HA) 항원 아형(H1, H3, 및 FluB)에 대한 CR9114 bnAb 중쇄의 65,091개의 변이체에 대한 친화도 데이터를 포함한다. 각각의 변이체는 CR9114 생식선 과 체세포 서열 간의 차이에 기초하여 최대 16개의 위치에 이원 돌연변이를 포함한다. 65,091개의 변이체 중, 63,419개(97%)는 H1에 결합하고, 7174개(11%)는 H3에 결합하고, 198개(0.3%)는 FluB에 결합한다. 본 기술은 https://cdn.elifesciences.org/articles/71393/elife-71393-fig1-data1-v3.csv로부터 데 이터세트를 다운로드하는 것을 포함할 수 있다. 각 변이체의 아미노산 서열은 생식선 서열(적색으로 강조된 16 개의 체세포 돌연변이, 및 중간에 개재된 트리밍된 서열)을 사용하여, 맞춤형 python 스크립트를 사용하는 이진 돌연변이 정보로부터 추론되었다. 처음 19개의 아미노산은 NF Heavy 모델(IMGT 넘버링 체계에서 21번째 아미노산으로부터 시작함)과의 호환성을 위해 트리밍될 수 있다. 모델 아키텍처 NF Heavy 모델은 OAS 데이터세트(PT)에 대해 학습된 가중치로 초기화되어 사용될 수 있을 뿐만 아니라 무작위 가중치(NPT)로 초기화된 모델로도 초기화되어 사용될 수 있다. 3개의 항원 표적 모두에 대한 예측을 지원하기 위해, 회귀 단독 모델(Reg)에 대한 손실 함수로서 각각의 회귀 작업에 대한 일부 양태에서 평균 제곱 오차의 합 이 사용될 수 있다. 또한, 모델은 조인트 모델(Mix)에서 분류 및 회귀 작업을 조합하는 혼합 모델을 사용하여 학습될 수 있다. 예를 들어, 혼합 모델에 대한 손실 함수는 다음과 같이 정의될 수 있다:"}
{"patent_id": "10-2024-7026560", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 12, "content": "식 중, C는 표적의 수(예를 들어, 3)이고, N은 배치에서의 학습 예의 수(예를 들어, 256)이고, yn,c는 표적 c에 대한 샘플 n의 측정된 친화도이고, 는 표적 c에 대한 샘플 n의 예측된 결합 분류 로그척도 점수이고, c는 c에 결합하는 경우 표적 c에 대한 샘플 n의 예측된 친화도이고, wCls는 분류 손실 가중치(데 이터세트의 10% 및 0.1%로 학습된 모델의 경우 0.1, 및 데이터세트의 1%로 학습된 모델의 경우 0.01), Bc는 원 래의 공개 문헌에서 결정된 바와 같은 각각의 표적에 대한 하한(예를 들어, H1의 경우 7, 및 H3 및 FluB의 경우 6)이고, σ는 로그척도 S자 함수이고, pc는 양의 가중치 점수이다. 예를 들어, pc는 부류 c에 대한 음성 예의 수 를 학습 세트의 부류 c에 대한 양성 예(양성 예가 없는 경우 1로 설정됨)의 수로 나눈 값으로서 각각의 학습 세 트에 대해 동적으로 계산될 수 있다. 모델 학습 일부 양태에서, 본 기술은 3개의 학습 세트 크기(65,091개의 10%, 1%, 및 0.1%)를 사용하여 4가지 유형의 모델 (Reg-PT, Reg-NPT, Mix-PT, 및 Mix-NPT)을 학습시키는 것을 포함할 수 있으며, 여기에서 이들 각각은 10개의 교차 검증 배수를 사용한다. 1% 및 0.1% 실험의 경우, 10-배가 무작위로 선택될 수 있으며, 이는 각각의 배수가 학습 세트의 각각의 표적에 대해 적어도 하나의 양성 예 및 하나의 음성 예를 포함할 것을 요구한다. 조기 정지 및 분류기 교정을 지원하기 위해, 각각의 시험 세트의 10%가 별도의 검증 세트로서 할당될 수 있다. 일부 양태 에서, 전달 학습은, 다수의 노드(예를 들어, 768개)를 갖는 조밀한 숨겨진 계층에 이어서 필요한 수의 출력을 갖는 프로젝션 계층을 추가함으로써, OAS-사전학습 모델을 활용하기 위한 일부 양태에서 사용될 수 있다. 모든 계층은 학습 동안 모든 모델 파라미터를 업데이트하기 위해 프리징되지 않은 상태로 유지될 수 있다. 학습은,(예를 들어) 10-5의 학습 속도에서, 0.01의 가중치 감쇠, 0.2의 드롭아웃 확률, 100개의 워밍업 단계를 갖는 선 형 학습 속도 감쇠, 및 256의 배치 크기를 갖는 AdamW 옵티마이저로 수행될 수 있다. 검증 세트 손실이 학습 크 기(예를 들어, 10%, 1%, 및 0.1%)에 대해 다수의 세대(예를 들어, 50, 250, 2500개)에 대한 각각의 개선이 중지 될 때까지 모든 모델을 학습시켰다. 모델 평가 통상적인 교차 검증 실험과 달리, 학습 세트는 시험 세트보다 작을 수 있으며, 따라서 각각의 변이체는 다수의 시험 세트에 존재할 수 있다. 각각의 변이체 예측에 대해, 앙상블 효과를 도입되는 것을 회피하기 위해 평균 예 측 값을 사용하는 대신 단일 모델로부터 무작위로 선택될 수 있다. 시험 세트에 대한 추론 동안, 예측된 회귀 값은 다음과 같이 계산될 수 있다:"}
{"patent_id": "10-2024-7026560", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 13, "content": "원시 분류 로그척도는 확률로 변환되고 cv=\"prefit\" 및 방법=\"isotonic\"을 사용하는 scikit-학습의 CalibratedClassifierCV 클래스를 사용하여 보정될 수 있으며, 예를 들어 분류 메트릭은 일부 양태에서, scikit-학습 기능 균형_정확도_점수, f1_점수, 정밀도_점수, 재현율_점수, 및 평균_정밀도_점수를 사용하여 계 산될 수 있다. 구체적으로, 균형잡힌 정확도는 다음과 같이 정의될 수 있다:"}
{"patent_id": "10-2024-7026560", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 14, "content": "그리고, 평균 정밀도는 다음과 같이 정의된다:"}
{"patent_id": "10-2024-7026560", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 15, "content": "식 중, Pn 및 Rn은 정밀도-재현율 곡선의 n번째 임계값에서의 정밀도 및 재현율이다. 항체 본원에서 사용되는 용어 \"항체\"는 표적 항원 상의 에피토프와 (예를 들어, 결합, 입체 장애(steric hindrance), 안정화/탈안정화, 공간 분포에 의해) 상호작용하는 전체 항체를 지칭한다. 자연 발생 \"항체\"는 이황화 결합에 의해 상호 연결된 적어도 2개의 중쇄(H) 및 2개의 경쇄(L)를 포함하는 당단백질이다. 각각의 중쇄는 중쇄 가변 영역(본원에서 VH로 약칭됨) 및 중쇄 불변 영역으로 구성된다. 중쇄 불변 영역은 3개의 도메인, CH1, CH2 및 CH3으로 구성된다. 각각의 경쇄는 경쇄 가변 영역(본원에서 VL로 약칭됨) 및 경쇄 불변 영역으로 구성된다. 경 쇄 불변 영역은 하나의 도메인, CL로 구성된다. VH 및 VL 영역은 프레임워크 영역(FR)으로 지칭되는, 보다 보존 된 영역으로 산재된, 상보성 결정 영역(CDR)으로 지칭되는 초가변 영역으로 추가로 세분화될 수 있다. 각각의 VH 및 VL은 아미노 말단으로부터 카르복시 말단까지 다음 순서로 배열된 3개의 CDR 및 4개의 FR로 구성된다: FR1, CDR1, FR2, CDR2, FR3, CDR3, FR4. 중쇄 및 경쇄의 가변 영역은 항원과 상호작용하는 결합 도메인을 함유 한다. 항체의 불변 영역은 면역 시스템의 다양한 세포(예를 들어, 효과기 세포) 및 고전적인 보체 시스템의 제1 성분(Clq)을 포함하는 숙주 조직 또는 인자에 대한 면역글로불린의 결합을 매개할 수 있다. 용어 \"항체\"는, 예 를 들어 단클론 항체, 인간 항체, 인간화 항체, 카멜화 항체, 키메라 항체, 단쇄 Fv(scFv), 이황화-결합 Fv(sdFv), Fab 단편, F(ab') 단편, 및 항-이디오타입(항-Id) 항체(예를 들어, 본 발명의 항체에 대한 항-Id 항 체를 포함함), 및 전술한 것 중 어느 하나의 에피토프 결합 단편을 포함한다. 항체는 임의의 이소형(예를 들어, IgG, IgE, IgM, IgD, IgA 및 IgY), 임의의 부류(예를 들어, IgG1, IgG2, IgG3, IgG4, IgA1 및 IgA2) 또는 임의 의 하위부류일 수 있다. 항체 또는 에피토프 결합 단편은 다중특이적 분자이거나 이의 성분일 수 있다. 경쇄 및 중쇄 둘 모두는 구조적 및 기능적 상동성 영역으로 나누어진다. 용어 \"불변\" 및 \"가변\"은 기능적으로 사용된다. 이와 관련하여, 경쇄(VL) 및 중쇄(VH) 부분 둘 모두의 가변 도메인이 항원 인식 및 특이성을 결정함 을 이해할 것이다. 역으로, 경쇄(CL) 및 중쇄(CH1, CH2 또는 CH3)의 불변 도메인은 분비, 경태반 이동성, Fc 수 용체 결합, 보체 결합 등과 같은 중요한 생물학적 특성을 제공한다. 종래에 불변 영역 도메인의 넘버링은 항체 의 항원 결합 부위 또는 아미노 말단으로부터 보다 원위에 위치됨에 따라 증가한다. N-말단은 가변 영역이고, C-말단에서 이는 불변 영역이며; CH3 및 CL 도메인은 실제로 중쇄 및 경쇄의 카르복시-말단을 각각 포함한다.본원에서 사용되는 바와 같이, 문구 \"항체 단편\"은 표적 에피토프와 특이적으로 상호작용하는 능력을 (예를 들 어, 결합, 입체 장애, 안정화/탈안정화, 공간 분포에 의해) 보유하는 항체의 하나 이상의 부분을 지칭한다. 결 합 단편의 예는 다음을 포함하나, 이에 한정되지는 않는다: Fab 단편, VL, VH, CL 및 CH1 도메인로 이루어진 1 가 단편; F(ab)2 단편, 즉 힌지 영역에서 이황화 브릿지에 의해 연결된 2개의 Fab 단편을 포함하는 2가 단편; VH 및 CH1 도메인으로 이루어진 Fd 단편; 항체의 단일 아암의 VL 및 VH 도메인으로 이루어진 Fv 단편; VH 도메 인으로 이루어진 dAb 단편(Ward 등의 문헌[Nature 341:544-546]); 및 단리된 상보성 결정 영역(CDR). 또 한, Fv 단편의 2개의 도메인인 VL 및 VH은 별도의 유전자에 의해 코딩되지만, 이들은 재조합 방법을 사용하여, VL 및 VH 영역이 쌍을 이루어 1가 분자(단쇄 Fv(scFv)로 알려짐; 예를 들어, Bird 등의 문헌[Science 242:423-426]; 및 Huston 등의 문헌[Proc. Natl. Acad. Sci. 85:5879-5883] 참조)를 형성하는 단일 단백 질 사슬로서 제조될 수 있게 하는 합성 링커에 의해 결합될 수 있다. 이러한 단쇄 항체는 또한 용어 \"항체 단편\" 내에 포함되는 것으로 의도된다. 이들 항체 단편은 당업자에게 공지된 종래의 기술을 사용하여 수득되고, 해당 단편은 온전한 항체와 동일한 방식으로 유용성에 대해 스크리닝된다. 본원에 기술된 바와 같이, 항체는 생물학적으로 활성인 유도체 또는 변이체 또는 단편을 포함할 수 있다. 본원 에서 사용되는 바와 같이, \"생물학적 활성 유도체\" 또는 \"생물학적 활성 변이체\"는 결합 특성과 같은 상기 항체 (예를 들어, WT 항체)의 실질적으로 동일한 기능적 및/또는 생물학적 특성을 갖는 항체의 임의의 유도체 또는 변이체, 및/또는 프레임워크 영역을 포함하는 펩티드 골격 또는 염기성 중합체 유닛과 같은 동일한 구조적 기초 를 포함한다. \"유사체\", 예컨대 \"변이체\" 또는 \"유도체\"는, 특정 경우에는 상이하지만, 당업자가 이해하는 바와 같은 자연 발 생 항체, WT 항체 또는 또 다른 기준 항체와 구조가 실질적으로 유사하고 동일한 생물학적 활성을 갖는 항체이 다. 예를 들어, 항체 변이체는 실질적으로 유사한 구조를 공유하고 기준 항체와 동일한 생물학적 활성을 갖는 항체를 지칭한다. 변이체 또는 유사체는, 다음과 관련된 하나 이상의 돌연변이에 기초하여, 해당 유사체가 유래 되는 기준 항체 대비 이의 아미노산 서열의 조성에서 서로 상이하다: (i) 항체의 하나 이상의 말단 및/또는 항 체 서열의 하나 이상의 내부 영역(예를 들어, 단편)에서의 하나 이상의 아미노산 잔기의 결실, (ii) 항체 및/또 는 항체 서열의 하나 이상의 내부 영역의 하나 이상의 말단에서의 하나 이상의 아미노산의 삽입 또는 첨가(통상 적으로 \"첨가\" 또는 \"융합\")(통상적으로 \"삽입\"), 또는 (iii) 항체 서열 내의 다른 아미노산에 대한 하나 이상 의 아미노산의 치환. 예로서, \"유도체\"는 유사체의 일종이며, 예를 들어 화학적으로 변형된 기준 항체와 동일하 거나 실질적으로 유사한 구조를 공유하는 항체를 지칭한다. 일부 구현예에서, 변이체 또는 서열 변이체는, 하나 이상의 CDR 내의 1, 2, 3, 4, 5, 6개 이상의 아미노산이 기 준 항체에 대해 돌연변이된, 돌연변이체이다. 일부 구현예에서, 경쇄, 중쇄, 또는 중쇄 및 경쇄 둘 모두 상의 CDR은 돌연변이된다. 일부 구현예에서, 하나 이상의 프레임워크 아미노산 잔기는 기준 항체에 대해 돌연변이된 다. 치환 변이체에서, 항체의 하나 이상의 아미노산 잔기는, 예를 들어, CDR 영역에서 제거되고 대안적인 잔기로 대 체된다. 일 양태에서, 치환은 본질적으로 보존적이며, 이러한 유형의 보존적 치환은 당업계에 잘 알려져 있다. 대안적으로, 본 개시는 또한 비보존성인 치환을 포함한다. 예시적인 보존적 치환은 Lehninger의 문헌 [Biochemistry, 제2판; Worth Publishers, Inc., New York , pp.71-77]에 기술되어 있다. 본원에서 고려되는 항체는 전장 항체, 전장 항체의 생물학적 활성 서브유닛 또는 단편, 뿐만 아니라 이들 형태 의 치료 단백질 중 어느 하나의 생물학적 활성 유도체 및 변이체를 포함한다. 따라서 항체는 기준 항체에 대해, 적어도 약 25개, 약 50개, 약 100개, 약 200개, 약 300개, 약 400개, 또는 그 이상의 아미노산에 대해, 약 60%, 약 65%, 약 70%, 약 75%, 약 80%, 약 85%, 약 90%, 약 91%, 약 92%, 약 93%, 약 94%, 약 95%, 약 96%, 약 97%, 약 98% 또는 약 99% 초과 또는 그 이상의 아미노산 서열 동일성을 갖는 아미노산 서열을 갖는 것을 포 함한다(예를 들어, 기준화된 핵산 또는 본원에 기술된 아미노산 서열에 의해 암호화됨). 본 개시에 따르면, 용 어 \"재조합 단백질\" 또는 \"재조합 항체\"는 재조합 DNA 기술을 통해 수득된 임의의 단백질을 포함한다. 특정 구 현예에서, 해당 용어는 본원에 기술된 것과 같은 항체를 포함한다. 일부 구현예에서, 본원에 기술된 항체 또는 항체 변이체는 하나 이상의 발현 작제물로부터 및/또는 본원에 기술 된 바와 같은 세포 또는 균주에서 발현된다. 예시적인 야생형 또는 기준 항체는 치료 단클론 항체를 포함하여 상업적으로 이용 가능한 또는 다른 공지된 항 체를 포함한다. 본 개시에 따른 기준 항체는 임상적으로 및/또는 상업적으로 이용 가능하지 않은 것들을 포함하여, 현재 알려져 있거나 추후 개발된 임의의 항체를 포함할 수 있다. 세포 및 발현 작제물 세포 야생형(WT) 항체 및 변이체 항체를 포함하는 본 개시의 항체는 일부 구현예에서 세포에서 생산된다. 본 개시의 다양한 구현예에서, 본원에 기술된 발현 작제물 중 하나 이상을 포함하는 세포가 고려된다. 원핵 숙주 세포. 본 개시의 일부 구현예에서, 본원에 기술된 융합 단백질을 포함하는, 유전자 산물의 발현을 위 해 설계된 발현 작제물은 원핵 숙주 세포와 같은 숙주 세포에 제공된다. 원핵 숙주 세포는, 고세균(예를 들어, 할로페락스 볼카니(Haloferax volcanii), 술포로부스 솔파타리쿠스(Sulfolobus solfataricus)), 그람-양성 박 테리아(예를 들어, 바실루스 서브틸리스(Bacillus subtilis), 바실루스 리케니포르미스(Bacillus licheniformis), 브레비바실루스 코시넨시스(Brevibacillus choshinensis), 락토바실루스 브레비스 (Lactobacillus brevis), 락토바실루스 부흐네리(Lactobacillus buchneri), 락토바실루스 락티스(Lactococcus lactis), 및 스트렙토미세스 리비단스(Streptomyces lividans)), 또는 알파프로테오박테리아 (Alphaproteobacteria)를 포함하는 그람-음성 박테리아(아그로박테리움 투메파시엔스(Agrobacterium tume- faciens), 칼로박터 크레센투스(Caulobacter crescentus), 로도박터 스파에로이데스(Rhodobacter sphaeroides), 및 시노리조비움 멜릴로티(Sinorhizo-bium meliloti)), 베타프로테오박테리아 (Betaproteobacteria)(알칼리게네스 유트로푸스(Alcaligenes eutrophus)), 및 감마프로테오박테리아 (Gammaproteo-bacteria)(아시네토박터 칼코아세티쿠스(Acinetobacter calcoaceticus), 아조토박터 비네란디이 (Azotobacter vinelandii), 대장균, 슈도노마스 아에루기노사(Pseudo-monas aeruginosa), 및 슈도노마스 푸티 다(Pseudomonas putida))를 포함할 수 있다. 바람직한 숙주 세포는, 엔테로박터(Enterobacter), 에르비니아 (Erwinia), 에스케리키아(Escherichia)(대장균 포함), 크렙시엘라(Klebsiella), 프로테우스(Proteus), 살모넬 라(Salmonella)(살모넬라 티피무리움(Salmonella typhimurium) 포함), 세라티아(Serratia)(세라티아 마르세스 칸스(Serratia marcescans) 포함), 및 시겔라(Shigella)와 같은, 엔테로박테리아과의 감마프로테오박테리아를 포함한다. 진핵 숙주 세포. 다수의 추가 유형의 숙주 세포가 본 개시의 발현 시스템에 대해 사용될 수 있으며, 이는 다음 을 포함한다: 효모와 같은 진핵 세포(칸디다 세하타에(Candida shehatae), 클루이베로미세스 락티스 (Kluyveromyces lactis), 클루이베로미세스 프라길리스(Kluyveromyces fragilis), 다른 클루이베로미세스 종, 피치아 파스토리스(Pichia pastoris), 사카로미세스 세레비지애(Saccharomyces cerevisiae), 사카로미세스 파 스토리아누스(Saccharomyces pastorianus)(사카로미세스 칼스베르겐시스(Saccharo-myces carlsbergensis로도 알려짐), 시조사카로미세스 폼브(Schizosaccharomyces pombe), 데크라/브레타노미세스(Dekkera/Brettanomyces) 종, 및 야로비아 리폴리티카(Yarrowia lipolyticd)); 다른 진균류(아스페르길루스 니둘란스(Aspergillus nidulans), 아스페르길루스 니게르(Aspergillus niger), 뉴로스포라 크라사(Neurospora crassa), 페니실리움 (Penicillium), 톨리포클라디움(Tolypocladium), 트리코데르마 레에시아(Trichoderma reesia)); 곤충 세포주 (초파리 멜라노가스터 슈나이더 2(Drosophila melanogaster Schneider 2) 세포 및 스포도프테라 프루기페르다 Sf9(Spodoptera frugiperda Sf9) 세포; 및 불멸화 세포주(중국 햄스터 난소(CHO) 세포, HeLa 세포, 아기 햄스 터 신장(BHK) 세포, 원숭이 신장 세포(COS), 인간 배아 신장(HEK, 293 또는 HEK-293) 세포), 및 인간 간세포 암종 세포(Hep G2))를 포함하는 포유동물 세포주. 전술한 숙주 세포는 American Type Culture Collection(ATCC)으로부터 이용 가능하다. 그 전체 내용이 참조로서 본원에 통합되는 WO/2017/106583에 기술된 바와 같이, 치료 단백질과 같은 유전자 산 물의 상업적 규모 및 가용성 형태의 생산은 발효 배양물 중에서의 높은 세포 밀도로 성장할 수 있고, 고도로 조 절된 유도성 유전자 발현을 통해 산화 숙주 세포질에서 가용성 유전자 산물을 생산할 수 있는 적절한 숙주 세포 를 제공함으로써 해결된다. 이러한 품질을 갖는 본 개시의 숙주 세포는 다음의 특성 중 일부 또는 전부를 조합 함으로써 생성된다. 숙주 세포는, 세포질에서 산화성 폴리펩티드의 발현 또는 기능을 증가시키고/증가시키 거나 세포질에서 환원성 폴리펩티드의 발현 또는 기능을 감소시킴으로써, 산화성 세포질을 갖도록 유전적으로 변형된다. 이러한 유전적 변경의 구체적인 예가 본원에 제공된다. 선택적으로, 숙주 세포는 또한 원하는 유전자 산물(들)의 생성을 돕는 샤페론 및/또는 보조 인자를 발현하고/발현하거나, 글리코실레이트 폴리펩티드 유전자 산물을 발현하도록 유전적으로 변형될 수 있다. 숙주 세포는 하나 이상의 관심 유전자 산물의 발현을 위해 설계된 하나 이상의 발현 작제물을 포함하고; 특정 구현예에서, 적어도 하나의 발현 작제물은 유도성 프로모터 및 유도성 프로모터로부터 발현될 유전자 산물을 암호화하는 폴리뉴클레오티드를 포함한다. 숙주 세포는 발현 작제물(들)로부터의 유전자 산물 발현의 특정 양태를 개선하도록 설계된 추가적인 유전적 변형을 함유한다. 특정 구현예에서, 상기 숙주 세포는, (A) 적어도 하나의 유도성 프로모터의 유도인자에 대한 트랜스포터 단백질 을 암호화하는 적어도 하나의 유전자의 유전자 기능의 변형을 갖되, 트랜스포터 단백질을 암호화하는 유전자는 araE, araE, araG, araH, rhaT, xylF, xylG, 및 xylH로 이루어진 군으로부터 선택되거나, 특히 araE이거나, 보 다 구체적으로 유전자 기능의 변경은 구성적 프로모터로부터의 araE의 발현이고/이거나; (B) 적어도 하나의 유 도성 프로모터의 유도자를 대사하는 단백질을 암호화하는 적어도 하나의 유전자의 감소된 수준의 유전자 기능을 갖되, 적어도 하나의 상기 유도성 프로모터의 유도자를 대사하는 단백질을 암호화하는 유전자는 araA, araB, araD, prpB, prpD, rhaA, rhaB, rhaD, xylA, 및 xylB로 이루어진 군으로부터 선택되고/되거나; (C) 적어도 하 나의 유도성 프로모터의 유도자의 생합성에 관여하는 단백질을 암호화하는 적어도 하나의 유전자의 감소된 수준 의 유전자 기능을 갖되, 이 유전자는 추가의 구현예에서 scpA/sbm, argK/ygfD, scpB/ygfG, scpC/ygfH, rmlA, rmlB, rmlC, 및 rmlD로 이루어진 군으로부터 선택된다. 산화 세포질을 갖는 숙주 세포. 본 개시의 발현 시스템은 유전자 산물을 발현하도록 설계되고; 본 개시의 특정 구현예에서, 해당 유전자 산물은 숙주 세포에서 발현된다. 다량체 산물의 성분을 포함하는, 유전자 산물의 효율 적이고 비용-효율적인 발현을 가능하게 하는 숙주 세포의 예가 제공된다. 숙주 세포는 배양물 중 단리된 세포에 더하여, 다세포 유기체의 일부인 세포, 또는 상이한 유기체 또는 유기체의 시스템 내에서 성장된 세포를 포함할 수 있다. 본 개시의 특정 구현예에서, 숙주 세포는 효모(사카로미세스(Saccharomyces), 시조사카로미세스 (Schizosaccharomyces) 등) 또는 박테리아 세포와 같은 미생물 세포이거나, 그램 양성 박테리아 또는 그램 음성 박테리아이거나, 대장균이거나, 대장균 B 균주이거나, 대장균(B 균주) EB0001 세포(대장균 ASE(DGH) 세포로도 불림)이거나, 대장균(B 균주) EB0002 세포이다. 산화 세포질을 갖는 대장균 숙주 세포, 특히 대장균 B 균주 SHuffle® Express(NEB 카탈로그 번호 C3028H) 및 SHuffle® T7 Express(NEB 카탈로그 번호 C3029H) 및 대장균 K 균주 SHuffle® T7(NEB 카탈로그 번호 C3026H)을 이용한 성장 실험에서, 산화 세포질을 갖는 이들 대장균 B 균주는 가장 밀접하게 상응하는 대장균 K 균주(WO/2017/106583)보다 훨씬 더 높은 세포 밀도로 성장할 수 있다. 숙주 세포 유전자 기능에 대한 변경. 유도자에 의한 숙주 세포 모집단의 효율적이고 균질한 유도를 촉진하기 위 해, 유도성 발현 작제물을 포함하는 숙주 세포의 유전자 기능에 대해 특정 변경이 이루어질 수 있다. 바람직하 게는, 발현 작제물, 숙주 세포 유전자형, 및 유도 조건의 조합은 WO/2017/106583의 실시예 9에 기술된 Khlebnikov 등의 방법에 의해 측정 시, 각각의 유도된 프로모터로부터 유전자 산물을 발현하는 배양물 내의 세 포의 적어도 75%(보다 바람직하게는 적어도 85%, 가장 바람직하게는 적어도 95%)를 생성한다. 대장균 이외의 숙 주 세포의 경우, 이러한 변경은 대장균 유전자와 구조적으로 유사한 유전자, 또는 대장균 유전자의 기능과 유사 한 숙주 세포 내에서의 기능을 수행하는 유전자의 기능을 포함할 수 있다. 숙주 세포 유전자 기능에 대한 변경 은 유전자 단백질 코딩 서열 전체를 결실시키거나, 유전자의 충분히 큰 부분을 결실시키거나, 유전자에 서열을 삽입하거나, 그렇지 않으면 유전자 서열을 변경시킴으로써, 감소된 수준의 기능적 유전자 산물이 해당 유전자로 부터 만들어지도록 함으로써 유전자 기능을 제거하거나 감소시키는 것을 포함한다. 숙주 세포 유전자 기능에 대 한 변경은 또한, 예를 들어, 천연 프로모터를 변경하여 유전자의 더 높은 수준의 전사를 유도하는 더 강한 프로 모터를 생성하거나, 미스센스 돌연변이를 단백질 코딩 서열에 도입하여 활성이 더 높은 유전자 산물을 생성함으 로써 유전자 기능을 증가시키는 것을 포함한다. 숙주 세포 유전자 기능에 대한 변경은, 예를 들어 구성적으로 활성화되는 프로모터를 생성하기 위해 천연 유도성 프로모터를 변경하는 것을 포함하는, 임의의 방식으로 유전 자 기능을 변경하는 것을 포함한다. 유도성 프로모터 및/또는 샤페론 단백질의 변경된 발현과 관련하여 본원에 기술된 바와 같이, 유도자의 수송 및 대사를 위한 유전자 기능의 변경에 더하여, 숙주 세포의 환원-산화 환경을 변경하는 것 또한 가능하다. 숙주 세포 환원-산화 환경. 대장균과 같은 박테리아 세포에서, 이황화 결합을 필요로 하는 단백질은 일반적으로 이황화 결합 형성 및 이성질체화가 DsbABCD 및 DsbG를 포함하는 Dsb 시스템에 의해 촉매화되는 주변질 내로 내 보내진다. 모두 정상적으로 주변질로 수송되는, 시스테인 옥시다아제 DsbA, 이황화 이성질체 DsbC, 또는 Dsb 단 백질의 조합의 증가된 발현은, 이황화 결합을 필요로 하는 이종 단백질의 발현에 활용되었다(Makino 등, Microb Cell Fact 2011년 5월 14일; 10: 32). 예를 들어, 신호 펩티드가 결여되어 주변질로 수송되지 않는 DsbA 및/또 는 DsbC의 세포질 버전('cDsbA' 또는 'cDsbC')과 같은, 이들 Dsb 단백질의 세포질 형태를 발현시키는 것 또한 가능하다. cDsbA 및/또는 cDsbC와 같은 세포질 Dsb 단백질은 숙주 세포의 세포질을 더 산화시키고, 따라서 세포 질에서 생성된 이종 단백질에서의 이황화 결합의 형성에 보다 도움이 되도록 만드는 데 유용하다. 숙주 세포 세 포질은 또한 티오레독신 및 글루타르독신/글루타티온 효소 시스템을 직접적으로 변경함으로써 보다 덜 환원되고, 이에 따라 더 산화될 수 있다: 글루타티온 환원효소(gor) 또는 글루타티온 합성효소(gshB)에 결함을 갖는 돌연변이 균주는 티오레독신 환원효소(trxB)와 함께 세포질을 산화시킨다. 이들 균주는 리보뉴클레오티드를 환원시킬 수 없기 때문에, 디티오트레이톨(DTT)과 같은 외인성 환원제의 부재 시 성장할 수 없다. 퍼옥시레 독신 AhpC를 암호화하는 유전자 ahpC의 억제 돌연변이(예컨대, ahpC* 및 ahpCA, Lobstein 등의 문헌[Microb Cell Fact 2012년 5월 8일; 11:56; doi: 10.1186/1475-2859-11-56])는, 이를 이황화 환원효소로 전환시켜 환원 된 글루타티온을 생성하고, 효소 리보뉴클레오티드 환원효소 상으로의 전자 채널링을 가능하게 하고, gor 및 trxB에 결함이 있거나 gshB 및 trxB에 결함이 있는 세포가 DTT의 부재 하에 성장하는 것을 가능하게 한다. AhpC 의 돌연변이된 형태의 상이한 부류는 감마-글루타밀시스테인 합성효소(gshA)의 활성에 결함이 있고, trxB에 결 함이 있는 균주가 DTT의 부재 하에 성장하는 것을 가능하게 하며, 이는 AhpC V164G, AhpC S71F, AhpC E173/S71F, AhpC E171Ter, 및 AhpC dupl62-169를 포함한다(Faulkner 등의 문헌[Proc Natl Acad Sci USA 2008 May 6; 105: 6735-6740, Epub 2008년 5월 2일]). 산화 세포질을 갖는 이러한 균주에서, 노출된 단백질 시 스테인은 티오레독신에 의해 촉매되는 프로세스에서, 이들의 생리학적 기능의 반전으로 쉽게 산화되어, 이황화 결합의 형성을 초래한다. 산화 세포질의 숙주 세포에서 산화 스트레스 효과를 감소시키는 데 도움이 될 수 있는 다른 단백질은, 대장균 katG에 의해 암호화된 HPI(하이드로퍼옥시다아제 I) 카탈라아제-과산화효소 및 대장균 katE에 의해 암호화된 HPII(하이드로퍼옥시다아제 II) 카탈라아제-과산화효소이며, 이는 과산화물을 물 및 02로 분해한다(Farr 및 Kogoma의 문헌[Microbiol Rev. 1991년 12월; 55: 561-585; 리뷰]). 유도된 공발현을 통해 또는 구성적 발현의 상승된 수준을 통해 숙주 세포에서 KatG 및/또는 KatE 단백질의 수준을 증가시키는 것은 본 개시의 일부 구현예의 양태이다. 숙주 세포에 대해 이루어질 수 있는 또 다른 변경은 숙주 세포 세포질에서 효모 미토콘드리아의 내부 막 공간으 로부터 설프하이드릴 산화효소 Ervlp를 발현시키는 것이며, 이는 gor 또는 trxB에 돌연변이가 없는 경우에도, 대장균의 세포질에서 진핵 기원의 다양한 복합체, 이황화 결합 단백질의 생산을 증가시키는 것으로 밝혀졌다 (Nguyen 등의 문헌[Microb Cell Fact 2011년 1월 7일; 10: 1]). 발현 작제물을 포함하는 숙주 세포는 또한 바람직하게는 cDsbA 및/또는 cDsbC 및/또는 Ervlp를 발현하고; trxB 유전자 기능이 결핍되고; gor, gshB, 또는 gshA의 유전자 기능이 또한 결핍되고; 선택적으로 katG 및/또는 katE 유전자 기능의 증가된 수준을 갖고; AhpC의 적절한 돌연변이체 형태를 발현하여 숙주 세포가 DTT의 부재 하에 성장될 수 있게 한다. 샤페론. 일부 구현예에서, 원하는 유전자 산물은 원하는 유전자 산물의 생산에 유익한, 샤페론과 같은 다른 유 전자 산물과 공발현된다. 샤페론은 다른 유전자 산물의 비공유 폴딩 또는 언폴딩, 및/또는 조립 또는 분해를 보 조하는 단백질이지만, 구조가 (폴딩 및/또는 조립 프로세스를 완료한) 정상적인 생물학적 기능을 수행할 경우, 생성된 단량체 또는 다량체 유전자 산물 구조에서는 발생하지 않는다. 샤페론은 발현 작제물 내의 유도성 프로 모터 또는 구성적 프로모터로부터 발현될 수 있거나, 숙주 세포 염색체로부터 발현될 수 있고; 바람직하게는, 숙주 세포에서 샤페론 단백질(들)의 발현은 원하는 산물로 적절하게 폴딩되고/되거나 조립되는 공발현된 유전자 산물을 생산하기에 충분히 높은 수준이다. 대장균 숙주 세포에 존재하는 샤페론의 예는, 세포질 또는 주변질 단 백질의 단백질 응집을 방지하는 데 사용된 폴딩 인자 DnaK/DnaJ/GrpE, DsbC/DsbG, GroEL/GroES, IbpA/IbpB, Skp, Tig(유발 인자), 및 FkpA이다. DnaK/DnaJ/GrpE, GroEL/GroES, 및 ClpB는 단백질 폴딩을 보조하는 데 상승 적으로 기능할 수 있으므로, 이들 샤페론의 조합된 발현은 단백질 발현에 유익한 것으로 밝혀졌다(Makino 등이 문헌[Microb Cell Fact 2011년 5월 14일; 10: 32]). 원핵 숙주 세포에서 진핵 단백질을 발현시킬 때, 진핵 샤 페론 단백질, 예컨대 동일하거나 관련된 진핵 종으로부터의 이황화 단백질 이성질체화효소(PDI)는 본 개시의 특 정 구현예에서 원하는 유전자 산물과 공발현되거나 유도적으로 공발현된다. 숙주 세포에서 발현될 수 있는 하나의 샤페론은 토양 하이포미세테(hyphomycete)(연엽 곰팡이)인 후미콜라 인솔 렌스(Humicola insolens)으로부터의 단백질 이황화 이성질화효소이다. 후미콜라 인솔렌스 PDI의 아미노산 서열 은 WO/2017/106583의 서열번호 l로서 제시되며; 이는 천연 단백질의 신호 펩티드가 결여되며, 이에 따라 숙주 세포 세포질에 남아 있게 된다. PDI를 암호화하는 뉴클레오티드 서열을 대장균에서의 발현에 대해 최적화하였으 며; PDI에 대한 발현 작제물은 WO/2017/106583의 서열번호 2로서 제시되어 있다. 서열번호 2는 이의 5' 말단에 GCTAGC Nhel 제한 부위, 뉴클레오티드 7 내지 12에 AGGAGG 리보솜 결합 부위, 뉴클레오티드 21 내지 1478에 PDI 코딩 서열, 및 이의 3' 말단에 GTCGAC Sail 제한 부위를 함유한다. 서열번호 2의 뉴클레오티드 서열은 유도 성 프로모터와 같은 프로모터의 바로 하류에 삽입되도록 설계되었다. 서열번호 2의 Nhel 및 Sail 제한 부위는, 공개된 미국 특허 출원 US2015353940A1에 기술된 pSOL 발현 벡터(WO/2017/106583의 서열번호 3)의 것과 같은, 벡터 다중 클로닝 부위 내에 이를 삽입하는 데 사용될 수 있다. 다른 PDI 폴리펩티드 또한, 다양한 종으로부터 의 PDI 폴리펩티드(사카로미세스 세레비시애(UniProtKB PI 7967), 호모 사피엔스(UniProtKB P07237), 무스 무 스쿨루스(Mus musculus)(UniProtKB P09103), 카에노르하브디티스 엘레간스(Caenorhabditis elegans)(UniProtKBQ 17770 및 Q 17967), 아라브도프시스 탈리아나(Arabdopsis thaliana)(UniProtKB 048773, Q9XI01 , Q9S G3, Q9LJU2, Q9MAU6, Q94F09, 및 Q9T042), 아스페르길루스 니게르(Aspergillus niger)(UniProtKB Q12730) 및 이러 한 PDI 폴리펩티드의 변형된 형태를 포함하는 숙주 세포에서 발현될 수 있다. 본 개시의 특정 구현예에서, 본 개시의 숙주 세포에서 발현된 PDI 폴리펩티드는 WO/2017/106583의 서열번호 l의 길이의 적어도 50%(또는 적어도 60%, 또는 적어도 70%, 또는 적어도 80%, 또는 적어도 90%)에 걸쳐 적어도 70%, 또는 80%, 또는 90%, 또는 95% 의 아미노산 서열 동일성을 공유하며, 여기에서 아미노산 서열 동일성은 WO/2017/106583의 실시예 10에 따라 결 정된다. 보조인자의 세포 수송. 본 개시의 발현 시스템을 사용하여 기능에 대한 보조인자를 필요로 하는 효소를 생산하 는 경우, 이용 가능한 전구체로부터 보조인자를 합성하거나 환경으로부터 이를 취할 수 있는 숙주 세포를 사용 하는 것이 도움이 된다. 통상적인 보조인자는 ATP, 코엔자임 A, 플라빈 아데닌 디뉴클레오티드(FAD), NAD+/NADH, 및 헴을 포함한다. 보조인자 수송 폴리펩티드 및/또는 보조인자 합성 폴리펩티드를 암호화하는 폴리 뉴클레오티드는 숙주 세포 내로 도입될 수 있으며, 이러한 폴리펩티드는 구성적으로 발현되거나, 본 개시의 방 법에 의해 생산될 유전자 산물과 유도적으로 공동발현될 수 있다. 폴리펩티드 유전자 산물의 당질화. 숙주 세포는 폴리펩티드를 당질화하는 이들의 능력에 변경을 가질 수 있다. 예를 들어, 진핵 숙주 세포에 대해 당질화전이효소 및/또는 올리고-당질화전이효소 유전자에서 유전자 기능을 제거하거나 감소시킴으로써, 폴리펩티드의 정상적인 진핵 당질화를 손상시켜 당단백질을 형성할 수 있다. 일반 적으로 폴리펩티드를 글리코실화하지 않는 대장균과 같은 원핵 숙주 세포는 글리코실화 기능을 제공하는 진핵 및 원핵 유전자 세트를 발현시키도록 변경될 수 있다(DeLisa 등의 문헌[WO2009089154A2, 2009년 7월 16일]). 변경된 유전자 기능을 갖는 이용 가능한 숙주 세포 균주. 본 개시의 발현 시스템 및 방법에 사용될 숙주 세포의 바람직한 균주를 생성하기 위해, 원하는 유전적 변경을 이미 포함하는 균주로 시작하는 것이 유용하다(표 A; WO/2017/106583)."}
{"patent_id": "10-2024-7026560", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 16, "content": "발현 작제물 본 개시의 일부 구현예에서, 발현 작제물과 함께 사용하기 위해 유도성 프로모터가 고려된다. 예시적인 프로모 터는 본원에 기술되어 있으며, 그 전체 내용이 참조로서 본원에 통합되는 WO/2016/205570에도 기술되어 있다. 본원에 기술된 바와 같이, 하나 이상의 발현 작제물을 포함하는 세포는 야생형 항체 및 변이체 항체를 포함하여, 본 개시의 항체를 발현하기 위한 하나 이상의 유도성 프로모터를 임의로 포함할 수 있다. 발현 작제물. 발현 작제물은 하나 이상의 항체의 발현을 위해 설계된 폴리뉴클레오티드이며, 따라서 자연 발생 분자가 아니다. 발현 작제물은 숙주 세포 염색체에 통합되거나, 플라스미드 또는 인공 염색체와 같은 숙주 세포 염색체와 독립적으로 복제되는 폴리뉴클레오티드 분자로서 숙주 세포 내에 유지될 수 있다. 발현 작제물의 예는 하나 이상의 폴리뉴클레오티드 서열의 숙주 세포 염색체 내로의 삽입에 기인하는 폴리뉴클레오티드이며, 여기에 서 삽입된 폴리뉴클레오티드 서열은 염색체 코딩 서열의 발현을 변경시킨다. 발현 벡터는 하나 이상의 유전자 산물, 예컨대 하나 이상의 항체의 발현에 특이적으로 사용되는 플라스미드 발현 작제물이다. 하나 이상의 발현 작제물은 숙주 세포 염색체에 통합되거나 플라스미드 또는 인공 염색체와 같은 염색체외 폴리뉴클레오티드 상에 유지될 수 있다. 다음은 항체의 발현 또는 공발현을 위한 발현 작제물에 사용될 수 있는 특정 유형의 폴리뉴클레오티드 서열에 대한 설명이다. 복제 기점. 발현 작제물은, 복제 폴리뉴클레오티드로서 독립적으로 숙주 세포 내에 유지되기 위해, 레플리콘으 로도 불리는 복제 기점을 포함해야 한다. 동일한 복제 메커니즘을 사용하는 상이한 레플리콘은 반복된 세포 분 열을 통해 단일 숙주 세포에서 함께 유지될 수 없다. 결과적으로, 플라스미드는 WO/2016/205570의 표 2에 나타 낸 바와 같이, 이들이 함유하는 복제 기점에 따라 비호환성 그룹으로 분류될 수 있다. 복제 기점은 다른 기준 중에서도, 비호환성 그룹, 카피 수, 및/또는 숙주 범위에 기초하여 발현 작제물을 사용하기 위해 선택될 수 있 다. 전술한 바와 같이, 2개 이상의 상이한 발현 작제물이 다수의 항체 또는 항체 성분(예를 들어, 본원에 기술 된 바와 같은 단편을 포함하는 중쇄 및 경쇄)의 공발현을 위해 동일한 숙주 세포에 사용되는 경우, 일 구현예에 서, 상이한 발현 작제물은 상이한 비호환성 기로부터의 복제 기점(예를 들어, 하나의 발현 작제물 중 pMBl 레플 리콘 및 다른 하나의 발현 작제물 중 pl5A 레플리콘)을 함유한다. 숙주 염색체 분자의 수에 대한, 세포에서의 발현 작제물의 평균 카피 수는 해당 발현 작제물에 함유된 복제 기점에 의해 결정된다. 카비 수는 셀 당 몇 개 내지 수백 개까지 다양할 수 있다(WO/2016/205570의 표 2). 본 개시의 일 구현예에서, 동일한 유도자에 의해 활 성화되지만 상이한 복제 기점을 갖는 유도성 프로모터를 포함하는 상이한 발현 작제물이 사용된다. 각각의 상이 한 발현 작제물을 세포에서 소정의 대략적인 카피 수로 유지하는 복제 기점을 선택함으로써, 하나의 발현 작제 물로부터 발현된 항체 성분 또는 단편(예를 들어, 중쇄 또는 경쇄)의 전체 생산 수준을 상이한 발현 작제물로부 터 발현된 다른 항체 성분 또는 단편(예를 들어, 중쇄 또는 경쇄)에 대해 조정하는 것이 가능하다. 예로서, 다 량체 단백질(예를 들어, 중쇄 및 경쇄 포함)의 서브유닛 A 및 B를 공발현시키기 위해, colEl 레플리콘, am 프로 모터, 및 am 프로모터로부터 발현된 서브유닛 A에 대한 코딩 서열: 'colEl-Para-A를 포함하는 발현 작제물이 생 성된다. pl 5A 레플리콘, am 프로모터, 및 서브유닛 B: 'pl5A-Para-B'에 대한 코딩 서열을 포함하는 또 다른 발현 작제 물이 생성된다. 이들 2개의 발현 작제물은 동일한 숙주 세포에서 함께 유지될 수 있고, 서브유닛 A 및 B 둘 모 두의 발현은 하나의 유도자인 아라비노오스를 성장 배지에 첨가함으로써 유도된다. 서브유닛 A의 발현 수준이 서브유닛 B의 발현 수준에 비해 상당히 증가되어야 하는 경우, 두 서브유닛의 발현된 양의 화학량론 비율을 원 하는 비율에 보다 가깝게 하기 위해, 예를 들어, pUC9 플라스미드의 복제 기점('pUC9ori')에서 발견되는 것와 같은 변형된 pMB 1 레플리콘을 갖는, 서브유닛 A에 대한 새로운 발현 작제물이 생성될 수 있다: pUC9ori-Para- A. pUC9ori-Para-A와 같은 고-카피 수 발현 작제물로부터의 서브유닛 A의 발현은 pl5A-Para-B로부터의 서브유닛 B의 발현 대비 생산된 서브유닛 A의 양을 증가시켜야 한다. 유사한 방식으로, pSOOl(WO/2016/205570)과 같은 더 낮은 카피 수로 발현 작제물을 유지하는 복제 기점의 사용은, 해당 작제물로부터 발현된 유전자 산물의 전체 수 준을 감소시킬 수 있다. 복제 기점의 선택은 또한, 어떤 숙주 세포가 해당 레플리콘을 포함하는 발현 작제물을 유지할 수 있는지를 결정할 수 있다. 예를 들어, colEl 복제 기점을 포함하는 발현 작제물은 비교적 좁은 범위 의 이용 가능한 숙주, 엔테로박테리아과의 종을 갖는 한편, RK2 레플리콘을 포함하는 발현 작제물은 대장균, 슈 도노마스 아에루기노사, 슈도노마스 푸티다, 아조토박터 비네란디이, 및 알칼리게네스 유트로푸스에서 유지될 수 있지만, 발현 작제물이 RK2 레플리콘 및 RK2 플라스미드로부터의 일부 조절자 유전자를 포함하는 경우, 이는 시노리조비움 멜릴로티, 아그로박테리움 투메파시엔스, 칼로박터 크레센투스, 아시네토박터 칼코아세티쿠스, 및 로도박터 스파에로이데스와 같은 다양한 숙주 세포에서 유지될 수 있다(Kiies 및 Stahl의 문헌[Microbiol Rev 1989년 12월; 53: 491-516]). 진핵 세포에서의 유도성 발현 또는 공발현을 위한 발현 작제물을 생성하기 위해 유사한 고려 사항이 사용될 수 있다. 예를 들어, 사카로미세스 세레비시애의 2-마이크론 원형 플라스미드는 pSRl(ATCC 위탁 번호 48233 및 66069; Araki 등의 문헌[J Mol Biol 1985년 5월 20일; 182: 191-203]) 및 pKDl(ATCC 위탁 번호 37519; Chen 등의 문헌[Nucleic Acids Res 1986년 6월 11일; 14: 4471-4481])과 같은 다른 효모 균주로부터의 플라스미 드와 호환될 수 있다. 선택성 마커. 발현 작제물은 일반적으로 선택적 배양 배지에서 숙주 세포의 생존 또는 성장에 필요한 단백질을 암호화하는 선택성 마커로도 지칭되는 선택 유전자를 포함한다. 선택 유전자를 포함하는 발현 작제물을 함유하 지 않는 숙주 세포는 배양 배지에서 생존하지 않을 것이다. 전형적인 선택 유전자는 항생제 또는 다른 독소에 대한 내성을 부여하거나 숙주 세포의 영양요구성 결핍을 보완하는 단백질을 암호화한다. 선택 요법의 일례는 항 생제와 같은 약물을 사용하여 숙주 세포의 성장을 억제한다. 선택성 마커를 포함하는 발현 작제물을 함유하는 세포는 약물 내성을 부여하는 단백질을 생산하고 선택 요법에서 생존한다. 선택성 마커의 선택에 통상적으로 사 용되는 항생제(및 항생제 내성 표현형을 제공하는 유전자를 나타내는 약어)의 일부 예는: 암피실린(AmpR), 클로 람페니콜(CmlR 또는 CmR), 카나마이신(KanR), 스펙티노마이신(SpcR), 스트렙토마이신(StrR), 및 테트라사이클린(TetR)이다. WO/2016/205570의 표 2의 플라스미드 중 다수는 pBR322 (AmpR, TetR); pMOB45 (CmR, TetR); pACYClW (AmpR, KanR); 및 pGBMl (SpcR, StrR)과 같은 선택성 마커를 포함한다. 선택 유전자에 대한 천연 프로 모터 영역은 일반적으로 발현 작제물의 선택성 표지 부분의 일부로서, 이의 유전자 산물에 대한 코딩 서열과 함 께 포함된다. 대안적으로, 선택 유전자에 대한 코딩 서열은 구성 프로모터로부터 발현될 수 있다. 다양한 양태에서, 적절한 선택성 마커는 다음을 포함하나 이에 한정되지는 않는다: 네오마이신 포스포트랜스퍼 라아제(npt II), 하이그로마이신 포스포트랜스퍼라아제(hpt), 디하이드로폴레이트 환원효소(dhfr), 제오신, 플 레오마이신, 블레오마이신 내성 유전자(ble), 겐타마이신 아세틸트랜스퍼라아제, 스트렙토마이신 포스포트랜스 퍼라아제, 아세도락테이트 합성효소(als)의 돌연변이체 형태, 브로목시닐 니트릴라아제, 포스피노트리신 아세틸 트랜스퍼라아제(bar), 에놀피루빌시키메이트-3-포스페이트(EPSP) 합성효소(aro A), 근육 특이적 티로신 키나아 제 수용체 분자(MuSK-R), 구리-아연 초산화물 디스뮤타아제(sod1), 메탈로티오네인(cup1, MT1), 베타-락타마아 제(BLA), 퓨로마이신 N-아세틸-트랜스퍼러아제(pac), 블라스티시딘 아세틸 트랜스퍼라아제(bls), 블라스티딘 탈 아미노효소(bsr), 히스티디놀 탈수소효소(HDH), N-숙시닐-5-아미노이미다졸-4-카르복사미드 리보티드(SAICAR) 합성효소(ade1), 아르기니노숙시네이트 리아제(arg4), 베타-이소프로필말레이트 탈수소효소(leu2), 인버타아제 (suc2), 오로티딘-5'-포스페이트(OMP) 디카르복실라아제(ura3), 및 전술한 것 중 어느 하나의 동족체. 유도성 프로모터. 본원에 기술된 바와 같이, 본 개시의 유도 가능한 공발현 시스템의 일부로서 발현 작제물에 포함될 수 있는 여러 상이한 유도 가능한 프로모터가 존재한다. 바람직한 유도성 프로모터는 대장균 K-12 하위 균주 MG1655 게놈 서열을 참조하여 WO/2016/205570의 표 1에 정의된 바와 같은 프로모터 폴리뉴클레오티드 서열 의 30개 이상(보다 바람직하게는, 적어도 40개, 및 가장 바람직하게는, 적어도 50개)의 인접 염기에 대해 적어 도 80%의 폴리뉴클레오티드 서열 동일성(보다 바람직하게는, 적어도 90% 동일성, 및 가장 바람직하게는, 적어도 95% 동일성)을 공유하며, 여기에서 폴리뉴클레오티드 서열 동일성 백분율은 WO/2016/205570의 실시예 11의 방법 을 사용하여 결정된다. '표준' 유도 조건(WO/2016/205570의 실시예 5 참조) 하에서, De Mey 등의 정량적 PCR 방 법(WO/2016/205570의 실시예 6)을 사용하여 결정 시, 바람직한 유도성 프로모터는 대장균 K-12 하위균주 MG1655 의 상응하는 '야생형' 유도성 프로모터의 강도의 적어도 75%(보다 바람직하게는, 적어도 100%, 가장 바람직하게 는, 적어도 110%)를 갖는다. 발현 작제물 내에서, 유도성 프로모터의 존재가 유전자 산물을 암호화하는 폴리뉴 클레오티드의 코딩 가닥에 대해 5'에서 3' 방향으로 유전자 산물 코딩 서열의 전사를 유도할 수 있도록, 유도성 프로모터는 유도성으로 발현될 유전자 산물(예를 들어, 항체 또는 항체 단편)에 대한 코딩 서열에 대해 5'(또는 '상류)에 위치된다. 리보솜 결합 부위. 일부 항체 또는 항체 단편의 경우, 유도성으로 발현될 유전자 산물의 코딩 서열의 개시 코돈 과 전사 개시 부위 사이의 영역의 뉴클레오티드 서열은 폴리펩티드 유전자 산물에 대한 mRNA의 5' 미번역 영역 ('UTR')에 상응한다. 바람직하게는, 5' UT에 상응하는 발현 작제물의 영역은 숙주 세포의 종에서 발견되는 공통 리보솜 결합 부위(RBS, 샤인-달가르노(Shine-Dalgarno) 서열로도 불림)와 유사한 폴리뉴클레오티드 서열을 포함 한다. 원핵생물(고세균 및 박테리아)에서, RBS 공통 서열은 GGAGG 또는 GGAGGU이고, 대장균과 같은 박테리아에 서, RBS 공통 서열은 AGGAGG 또는 AGGAGGU이다. RBS는 일반적으로 개시 코돈으로부터 5 내지 10개의 개재 뉴클 레오티드만큼 분리된다. 발현 작제물에서, RBS 서열은 바람직하게는 AGGAGGU 컨센서스 서열과 적어도 55% 동일 하고, 보다 바람직하게는 적어도 70% 동일하고, 가장 바람직하게는 적어도 85% 동일하며, 5 내지 10개의 개재 뉴클레오티드, 보다 바람직하게는 6 내지 9개의 개재 뉴클레오티드, 가장 바람직하게는 6 또는 7개의 개재 뉴클 레오티드만큼 개시 코돈으로부터 분리된다. 바람직한 번역 개시 속도를 생성하는 주어진 RBS의 능력은 RBS 계산 기를 사용하여, 웹사이트 salis.psu.edu/software/RBSLibraryCalculatorSearchMode에서 계산될 수 있고; 동일 한 툴을 사용하여 100,000배 이상의 범위에 걸친 번역 속도에 대해 합성 RBS를 최적화할 수 있다(Salis의 문헌 [Methods Enzymol 2011; 498: 19-42]). 다중 클로닝 부위. 폴리링커로도 불리는 다중 클로닝 부위(MCS)는 서로 근접하거나 서로 중첩되는 다수의 제한 부위를 함유하는 폴리뉴클레오티드이다. MCS의 제한 부위는 일반적으로 MCS 서열 내에서 한 번 발생하고, 바람 직하게는 플라스미드 또는 다른 폴리뉴클레오티드 작제물의 나머지 내에서는 발생하지 않으며, 제한 효소가 MCS 내에서만 플라스미드 또는 다른 폴리뉴클레오티드 작제물을 절단할 수 있게 한다. MCS 서열의 예는, pBAD18, pBAD18-Cm, pBAD18-Kan, pBAD24, pBAD28, pBAD30, 및 pBAD33을 포함하는 발현 벡터의 pBAD 시리즈의 서열 (Guzman 등의 문헌[J Bacteriol 1995년 7월; 177: 4121-4130]); 또는 pPR018, pPR018-Cm, pPR018-Kan, pPR024, pPRO30, 및 pPR033과 같은 pBAD 벡터로부터 유래된 발현 벡터의 pPRO 시리즈의 서열(미국 특허 제 8178338 B2호; 2012년 5월 15일; Keasling, Jay)이다. 다중 클로닝 부위는 발현 작제물의 생성에 사용될 수 있 다: 다중 클로닝 부위 3'를 프로모터 서열에 (또는 이의 하류에) 배치함으로써, MCS는 코딩 서열의 전사가 발생할 수 있도록 프로모터에 대해 적절한 위치에, 작제물 내로 발현되거나 공발현될 유전자 산물에 대한 코딩 서열 을 삽입하는 데 사용될 수 있다. MCS 내에서의 절단에 사용되는 제한 효소에 따라, 코딩 서열 또는 다른 폴리뉴 클레오티드 서열이 발현 작제물 내에 삽입된 후, 발현 작제물 내에 MCS 서열의 일부가 남아 있을 수 있다. 임의 의 잔여 MCS 서열은 삽입된 서열의 상류 또는, 또는 하류에 있거나, 또는 양 측면 상에 있을 수 있다. 리보솜 결합 부위는 MCS의 상류에 위치될 수 있고, 바람직하게는 MCS에 바로 인접하거나 몇 개의 뉴클레오티드에 의해 MCS로부터 분리될 수 있으며, 이 경우 RBS는 MCS에 삽입된 임의의 코딩 서열의 상류에 있게 된다. 또 다른 대안 은 MCS 내에 리보솜 결합 부위를 포함하는 것이며, 이 경우 MCS 내에서의 절단에 사용되는 제한 효소의 선택은 RBS가 보유되는지의 여부, 및 삽입된 서열과 어떤 관련이 있는지의 여부를 결정할 것이다. 또 다른 대안은, 바 람직하게는 전사된 메신저 RNA로부터의 번역 개시를 자극하기 위해, MCS에서 발현 작제물 내에 삽입될 폴리뉴클 레오티드 서열 내에, 임의의 코딩 서열과 적절한 관계로 RBS를 포함하는 것이다. 구성 프로모터로부터의 발현. 본 개시의 발현 작제물은 또한 구성 프로모터로부터 발현되는 코딩 서열을 포함할 수 있다. 유도성 프로모터와 달리, 구성적 프로모터는 대부분의 성장 조건 하에서 연속적인 유전자 산물 생산을 개시한다. 구성적 프로모터의 일례는 베타-락타마제를 암호화하고 pBR322(ATCC 31344), pACYClW(ATCC 37031), 및 pBAD24(ATCC 87399)를 포함하는, 다수의 플라스미드에 의해 숙주 세포에 부여된 암피실린-내성(AmpR) 표현형 을 담당하는 Tn3 bla 유전자의 것이다. 발현 작제물에 사용될 수 있는 또 다른 구성적 프로모터는 대장균 K-12 하위 균주 MG1655의 위치 1755731-1755406(+ 가닥)에 위치된 대장균 지질단백질 유전자인 Ipp에 대한 프로모터 이다(Inouye 및 Inouye의 문헌[Nucleic Acids Res 1985년 5월 10일; 13: 3101-3110]). 대장균에서 이종 유 전자 발현에 사용된 구성적 프로모터의 또 다른 예는 대장균 K-12 하위균주 MG1655의 위치 1321169-1321133(마 이너스 가닥)에 위치된, trpLEDCBA 프로모터이다(Windass 등의 문헌[Nucleic Acids Res 1982년 11월 11일; 10: 6639-6657]). 구성적 프로모터는 본원에 기술된 바와 같은 선택성 마커의 발현을 위한 발현 작제물에 사용될 수 있으며, 원하는 산물의 공발현에 유용한 다른 유전자 산물의 구성적 발현에도 사용될 수 있다. 예를 들어, 유도성 프로모터, 예컨대 AraC, PrpR, RhaR, 및 XylR의 전사 조절자는, 양방향 유도성 프로모터로부터 발 현되지 않는 경우, 이들이 조절하는 유도성 프로모터와 동일한 발현 작제물, 또는 상이한 발현 작제물 중 어느 하나 상에서 구성적 프로모터로부터 대안적으로 발현될 수 있다. 유사하게, PrpEC, AraE, 또는 Rha와 같은 유도 자의 생산 또는 수송에 유용한 유전자 산물, 또는 세포의 환원-산화 환경을 변형시키는 단백질은, 몇몇 예로서, 발현 작제물 내의 구성적 프로모터로부터 발현될 수 있다. 공발현된 유전자 산물의 생산에 유용한 유전자 산물, 및 생성된 원하는 산물은 또한 샤페론 단백질, 보조인자 수송체 등을 포함한다. 신호 펩티드. 본 개시의 방법에 의해 발현되거나 공발현된 항체 또는 항체 단편은, 이러한 유전자 산물이 숙주 세포 세포질로부터 각각 주변질로 내보내지거나 세포질에 보유되는 것이 바람직한지 여부에 따라, 신호 펩티드 를 함유하거나 신호 펩티드가 결여될 수 있다. 신호 펩티드(신호 서열, 선도 서열, 또는 선도 펩티드로도 지칭 됨)는 단일 알파-나선을 형성하는 경향이 있는 약 5 내지 20개의 아미노산 길이, 종종 약 10 내지 15개의 아미 노산 길이인 소수성 아미노산의 신장부를 구조적인 특징으로 한다. 이러한 소수성 신장부는 종종 양으로 하전된 아미노산(특히 리신)이 풍부한 보다 짧은 신장부에 선행한다. 성숙한 폴리펩티드로부터 절단될 신호 펩티드는 일반적으로 신호 펩티다아제에 의해 인식되고 절단되는 아미노산의 신장부로 종료된다. 신호 펩티드는 기능적으 로, 번역과 함께 또는 번역 후, 폴리펩티드의 수송을 원핵생물의 형질막(또는 대장균과 같은 그람 음성 박테리 아의 내부 막)을 통해, 또는 진핵 세포의 소포체 내로 유도하는 능력을 특징으로 할 수 있다. 신호 펩티드가 폴 리펩티드를 대장균과 같은 숙주 세포의 주변질 공간 내로 수송할 수 있게 하는 정도는, 예를 들어 WO/2016/205570의 실시예 12에 설명된 것과 같은 방법을 사용하여, 세포질에 보유된 단백질로부터 주변질 단백 질을 분리함으로써 결정될 수 있다. 다음은 유전자 산물의 발현 또는 공발현을 위한 발현 작제물에 사용될 수 있는 유도성 프로모터를 이러한 발현 작제물을 함유하는 숙주 세포에 대해 이루어질 수 있는 유전적 변형 중 일부와 함께 기술한다. 이들 유도성 프 로모터 및 관련 유전자의 예는, 달리 명시되지 않는 한, 대장균 K-12(American Type Culture Collection 위탁 ATCC 10798)의 하위균주인 대장균(E. coli) 균주 MG1655(American Type Culture Collection 위탁 ATCC 70092 6)로부터 유래한다. WO/2016/205570의 표 1은 유도성 프로모터 및 관련 유전자의 이들 실시예에 대한 뉴클레오 티드 서열의, 대장균 MG1655에서의, 게놈 위치를 열거한다. WO/2016/205570의 표 1에서와 같이 게놈 위치에 의 해 참조되는 뉴클레오티드 및 다른 유전자 서열은 본원에 참조로서 명시적으로 통합된다. 본원에 기술된 대장균 프로모터, 유전자, 및 균주에 대한 추가 정보는 ecoliwiki.net에 있는 온라인 EcoliWiki 리소스를 포함하는 많 은 공개 출처에서 찾을 수 있다. 아라비노오스 프로모터. (본원에서 사용되는 바와 같이, '아라비노오스'는 L-아라비노오스를 의미한다.) 아라비 노오스 이용에 관여하는 여러 대장균 오페론은 아라비노오스-araBAD, araC, arciE, 및 araFGH-에 의해 유도될 수 있지만, 용어 '아라비노오스 프로모터' 및 'ara 프로모터'는 일반적으로 araBAD 프로모터의 지칭에 사용된다. 몇몇 추가의 용어, 예컨대 Para, ParaB, ParaBAD, 및 PBAD-가 대장균 araBAD 프로모터를 나타내는 데 사용되어 왔다. 본원에서의 'ara 프로모터' 또는 위에 주어진 임의의 대안적인 용어는 대장균 araBAD 프로모 터를 의미한다. 다른 용어, 'araC-araBAD 프로모터'의 사용으로부터 알 수 있는 바와 같이, araBAD 프로모터는 양방향 프로모터의 일부인 것으로 간주되고, 여기에서 araBAD 프로모터는 일 방향으로 araBAD 오페론의 발현을 제어하고, araC 프로모터는 araBAD 프로모터와 매우 근접하고 이로부터의 대향 가닥 상에서 araC 코딩 서열의 발현을 다른 방향으로 제어한다. AraC 단백질은 araBAD 프로모터의 양성 및 음성 전사 조절자이다. 아라비노오 스가 없는 경우, AraC 단백질은 PBAD로부터의 전사를 억제하지만, 아라비노오스가 있는 경우, 아라비노오스와 결합 시 그 형태를 변경하는 AraC 단백질은 PBAD-로부터의 전사를 허용하는 양성 조절 요소가 된다. araBAD 오 페론은 L-리불로오스 및 L-리불로오스-인산염 중간체를 통해 이를 D-자일룰로오스-5-인산염으로 변환시킴으로써, L-아라비노스를 대사하는 단백질을 암호화한다. 아라비노오스 유도성 프로모터로부터의 발현 유도를 최대화하기 위해, L-아라비노오스의 L-리불로오스로의 전환을 촉매하는 AraA의 기능을 제거하거나 감소 시키는 것, 및 선택적으로 AraB 및 AraD 중 적어도 하나의 기능을 제거하거나 감소시키는 것 또한 유용하다. 아 라비노오스를 다른 당으로 변환하는 세포의 능력을 제거하거나 감소시킴으로써, 숙주 세포가 세포에서 아라비노 오스의 유효 농도를 감소시키는 능력을 제거하거나 감소시키는 것은 아라비노오스-유도성 프로모터의 유도에 더 많은 아라비노오스을 이용할 수 있게 한다. 아라비노오스를 숙주 세포 내로 이동시키는 수송체를 암호화하는 유 전자는 저 친화도 L-아라비노오스 양성자 동시수송체(symporter)를 암호화하는 araE, 및 ABC 수퍼패밀리 고 친 화도 L-아라비노오스 수송체의 서브유닛을 암호화하는 araFGH 오페론이다. L-아라비노오스를 세포 내로 수송할 수 있는 다른 단백질은 LacY 락토오스 투과효소의 특정 돌연변이체이다: 위치 177에서 알라닌 대신 시스테인 또 는 발린 아미노산을 각각 갖는 LacY(AlWC) 및 LacY(AlWV) 단백질(Morgan-Kiss 등의 문헌[Proc Natl Acad Sci USA 2002년 5월 28일; 99: 7373-7377]). 아라비노오스-유도성 프로모터의 균질한 유도를 달성하기 위해, 아 라비노오스에 의한 조절과 무관하게 아라비노오스를 세포 내로 수송하는 것이 유용하다. 이는 AraFGH 수송체 단 백질의 활성을 제거하거나 감소시키고 araE의 발현을 변경하여 구성적 프로모터로부터만 전사되도록 함으로써 달성될 수 있다. araE의 구성적 발현은 천연 araE 유전자의 기능을 제거하거나 감소시키고, 구성적 프로모터로 부터 발현된 AraE 단백질에 대한 코딩 서열을 포함하는 발현 작제물을 세포 내에 도입함으로써 달성될 수 있다. 대안적으로, AraFGH 기능이 결여된 세포에서, 숙주 세포의 염색체 araE 유전자의 발현을 조절하는 프로모터는 아라비노오스-유도성 프로모터로부터 구성적 프로모터로 변경될 수 있다. 유사한 방식으로, 아라비노오스-유도 성 프로모터의 균질한 유도를 위한 추가적인 대안으로서, AraE 기능이 결여된 숙주 세포는 구성적 프로모터로부 터 발현된 세포에 존재하는 임의의 기능적 AraFGH 코딩 서열을 가질 수 있다. 다른 대안으로서, 천연 araE 및 araFGH 프로모터를 숙주 염색체 내의 구성 프로모터로 대체함으로써, 구성 프로모터로부터 araE 유전자 및 araFGH 오페론 둘 모두를 발현시키는 것이 가능하다. 또한, AraE 및 AraFGH 아라비노오스 수송체 둘 모두의 활 성을 제거하거나 감소시키는 것이 가능하며, 해당 상황에서는, 해당 단백질이 아라비노오스를 수송할 수 있게 하는 LacY 락토오스 투과효소에서의 돌연변이를 사용하는 것이 가능하다. lacY 유전자의 발현은 대체적으로 아 라비노오스에 의해 조절되지 않기 때문에, 아라비노오스-유도성 프로모터가 아라비노오스의 존재에 의해 유도될 경우, LacY(A177C) 또는 LacY(A177V)와 같은 LacY 돌연변이체의 사용은 '전부 또는 없음(all or none)' 유도 현상을 초래하지 않게 된다. LacY(A177C) 단백질은 아라비노오스를 세포 내로 수송하는 데 보다 효과적인 것으 로 보이며, 이에 따라 LacY(A177C) 단백질을 암호화하는 폴리뉴클레오티드를 사용하는 것은 LacY(A177V) 단백질 을 암호화하는 폴리뉴클레오티드의 사용하는 것보다 바람직하다. 프로피오네이트 프로모터. '프로피오네이트 프로모터' 또는 'prp 프로모터'는 대장균 prpBCDE 오페론에 대한 프 로모터이며, 또한 ΡΡΦB로도 지칭된다. ara 프로모터와 같이, prp 프로모터는 양방향 프로모터의 일부이고, 일 방향으로 prpBCDE 오페론의 발현을 제어하고, 여기에서 prpR 프로모터는 다른 방향으로 prpR 코딩 서열의 발 현을 제어한다. PrpR 단백질은 prp 프로모터의 전사 조절자이며, PrpR 단백질이 2-메틸시트레이트('2-MC')에 결 합할 때 prp 프로모터로부터의 전사를 활성화시킨다. 프로피오네이트(프로파노에이트로도 지칭된)는 프로피온산 (또는 '프로파논산')의 이온인 CH3CH2COO-이고, 이러한 분자 부류의 특정 특성을 공유하는 일반 조성식 H(CH2),,COOH를 갖는 '지방' 산 중 가장 작으며, 물 없이 염화될 때 유성 층을 생성하고 비누형 칼륨 염을 갖는 다. 상업적으로 이용 가능한 프로피오네이트는 일반적으로 프로피오네이트 나트륨(CH3CH2COONa)과 같은 프로피온 산의 1가 양이온 염으로서, 또는 프로피오네이트 칼슘(Ca(CH3CH2COO)2)과 같은 2가 양이온 염으로서 판매된다. 프로피오네이트는 막 투과성이며, PrpE(프로피오닐-CoA 합성효소)에 의한 프로피오네이트의 프로피오닐-CoA로의전환, 이어서 PrpC(2-메틸시트레이트 합성효소)에 의한 프로피오닐-CoA의 2-MC로 전환에 의해 2-MC로 대사된다. prpBCDE 오페론, PrpD(2-메틸시트레이트 탈수소효소) 및 PrpB(2-메틸이소시트레이트 리아제)에 의해 암호화된 다른 단백질은 2-MC가 피루브산염 및 숙신산염과 같은 더 작은 생성물로의 추가적인 이화에 관여한다. 따라서, 세포 성장 배지에 첨가된 프로피오네이트에 의한 프로피오네이트 유도성 프로모터의 유도를 최대화하기 위해, PrpC 및 PrpE 활성을 갖는 숙주 세포를 가지면서, 프로피오네이트를 2-MC로 전환하되, 또한 2-MC가 대사되는 것 을 방지하기 위해 PrpD 활성을 제거하거나 감소시키고, 선택적으로 PrpB 활성을 제거하거나 감소시키는 것이 바 람직하다. 2-MC 생합성에 관여하는 단백질을 암호화하는 또 다른 오페론은 sbm-yg/DGH 오페론으로도 지칭되는 scpA-argK-scpBC 오페론이다. 이들 유전자는 숙신산염의 프로피오닐-CoA로의 전환에 필요한 단백질을 암호화하 며, 이어서 PrpC에 의해 2-MC로 전환될 수 있다. 이들 단백질의 기능의 제거 또는 감소는 2-MC 유도자의 생산을 위한 평행한 경로를 제거할 것이며, 이에 따라 프로피오네이트-유도성 프로모터의 발현의 백그라운드 수준을 감 소시킬 수 있고, 프로피오네이트-유도성 프로모터의 외인성으로 공급된 프로피오네이트에 대한 민감도를 증가시 킬 수 있다. 균주 JSB(Lee 및 Keasling의 문헌[Appl Environ Microbiol 2005년 11월; 71: 6856-6862])를 생성하기 위해 대장균 BL21(DE3) 내에 도입된 sbm-ygfD-ygfG-ygfH-ygfl의 결실은 외인성으로 공급된 유도자의 부재 시 백그라운드 발현을 감소시키는 데 도움이 되었지만, 이러한 결실은 균주 JSB에서 prp 프로모터로부터의 전체 발현을 또한 감소시켰다. 그러나, 결실 sbm-ygfD-ygfG-ygfH-ygfl은 알려지지 않은 기능의 추정 LysR-계열 전사 조절자를 암호화하는 ygfl에 또한 명백하게 영향을 미친다는 점에 주목해야 한다. 유전자 sbm-yg/DGH는 하 나의 오페론으로서 전사되고, ygfl은 반대 가닥으로부터 전사된다. ygfti 및 ygfl 코딩 서열의 3' 말단은 몇 개 의 염기쌍에 의해 중첩되므로, sbm- yg/DGH 오페론을 모두 제거하는 결실은 ygfl 코딩 기능을 또한 명백하게 제 거한다. YgfG(ScpB, 메틸말로닐-CoA 데카르복실라아제로도 지칭됨)와 같은 sbm-ygfDGH 유전자 산물의 서브세트 의 기능의 제거 또는 감소시키는 것, 또는 ygfli(또는 scpC) 유전자의 3' 말단을 충분히 남기면서 sbm- yg/DGH(또는 scpA-argK-scpBC) 오페론의 대부분을 결실시켜 ygfl의 발현이 영향을 받지 않도록 하는 것은 유도 된 발현의 최대 수준을 감소시키지 않으면서 프로피오네이트-유도성 프로모터로부터의 백그라운드 발현을 감소 시키기에 충분할 수 있다. 람노오스 프로모터. (본원에서 사용되는 바와 같이, '람노오스'는 L-람노오스를 의미한다.) '람노오스 프로모터' 또는 'rha 프로모터', 또는 PrhaSR은 대장균 rhaSR 오페론에 대한 프로모터이다. ara 및 prp 프로모 터와 마찬가지로, rha 프로모터는 양방향 프로모터의 일부이고, 일 방향으로 rhaSR 오페론의 발현을 제어하며, 여기에서 rhaBAD 프로모터는 다른 방향으로 rhaBAD 오페론의 발현을 제어한다. 그러나, rha 프로모터는 발현 조 절에 관여하는 2개의 전사 조절자를 갖는다: RhaR 및 RhaS. RhaR 단백질은 람노오스의 존재 하에 rhaSR 오페론 의 발현을 활성화하는 한편, RhaS 단백질은 L-람노오스 이화 및 수송 오페론, rhaBAD 및 rhaT의 발현을 각각 활 성화시킨다(Wickstrum 등의 문헌[J Bacteriol 2010년 1월; 192: 225-232]). RhaS 단백질은 또한 rhaSR 오페 론의 발현을 활성화시킬 수 있지만, 실제로 RhaS는 RhaR와 함께 발현을 훨씬 더 큰 수준으로 공동 활성화하는 고리형 AMP 수용체 단백질(CRP)의 능력을 방해함으로써 해당 발현을 음성적으로 자가조절한다. rhaBAD 오페론은 L-람노오스를 L-람누로오스로 변환하는 람노오스 이화 단백질 RhaA(L-람노오스 이성질효소); L-람누로오스를 인 산화하여 L-람누로오스-1-P를 형성하는 RhaB(람누로키나아제); 및 L-람누로오스-1-P를 L-락트알데히드 및 DHAP (디하이드록시 아세톤 인산염)로 변환하는 RhaD(람누로오스-1-인산염 알돌라아제)를 암호화한다. 람노오스-유도 성 프로모터로부터의 발현의 유도에 이용 가능한 세포에서 람노오스의 양을 최대화하기 위해, RhaA, 또는 선택 적으로 RhaA 및 RhaB 및 RhaD 중 적어도 하나의 기능을 제거하거나 감소시킴으로써, 촉매에 의해 분해되는 람노 오스의 양을 감소시키는 것이 바람직하다. 대장균 세포는 또한 rmlBDACX(또는 rfbBDACX) 오페론에 의해 암호화 된 단백질 RmlA, RmlB, RmlC, 및 RmlD(이들은 또는 각각 RfbA, RfbB, RfbC, 및 RfbD로도 지칭됨)의 활성을 통 해 알파-D-포도당-1-P로부터 L-라마노오스를 합성할 수 있다. 람노오스-유도성 프로모터로부터의 백그라운드 발 현을 감소시키고, 외인성으로 공급된 람노오스에 의한 람노오스-유도성 프로모터의 유도 민감도를 향상시키기 위해, RmlA, RmlB, RmlC 및 RmlD 단백질 중 하나 이상의 기능을 제거하거나 감소시키는 것이 유용할 수 있다. L-람노오스는 RhaT, 람노오스 투과효소 또는 L-람노오스:양성자 동시수송체에 의해 세포 내로 수송된다. 전술한 바와 같이, RhaT의 발현은 전사 조절자 RhaS에 의해 활성화된다. (RhaS의 발현을 유도하는) 람노오스에 의한 유 도와 독립적으로 RhaT를 발현시키기 위해, 숙주 세포는 세포의 모든 기능적 RhaT 코딩 서열이 구성 프로모터로 부터 발현되도록 변경될 수 있다. 또한, 기능적 RhaS는 생성되지 않도록, RhaS에 대한 코딩 서열은 결실되거나 불활성화될 수 있다. 세포에서 RhaS의 기능을 제거하거나 감소시킴으로써, rhaSR 프로모터로부터의 발현 수준은 RhaS에 의한 음성 자가조절의 부재로 인해 증가하고, 람노오스 촉매 오페론 rhaBAD의 발현 수준은 감소되어, rha 프로모터로부터 발현을 유도하는 람노오스의 능력을 추가로 증가시킨다. 자일로오스 프로모터. (본원에서 사용되는 바와 같이, '자일로오스'는 D-자일로오스를 의미한다.) 자일로오스 프로모터, 또는 'xyl 프로모터', 또는 PxyiA는 대장균 xylAB 오페론에 대한 프로모터를 의미한다. 자일로오스 프로모터 영역은, xylAB 오페론 및 xylFGHR 오페론이 대장균 염색체 상의 반대 방향으로 인접한 자일로오스 유 도성 프로모터로부터 발현된다는 점에서 다른 유도성 프로모터와 조직적으로 유사하다(Song 및 Park의 문헌[J Bacteriol. 1997년 11월; 179: 7025-7032]). PxyiA 및 PxyiF 프로모터 둘 모두의 전사 조절자는 XylR이며, 이는 자일로오스의 존재 하에 이들 프로모터의 발현을 활성화시킨다. xylR 유전자는 xylFGHR 오페론의 일부로서 발현되거나, xylH와 xylR 단백질 코딩 서열 사이에 위치된 자일로오스에 의해 유도되지 않는 그 자체의 약한 프 로모터로부터 발현된다. D-자일로오스는 D-자일로오스를 D-자일루로오스로 변환하는 XylA(D-자일로오스 이성질 체효소)에 의해 이화되고, 이어서 XylB(자일로키나아제)에 의해 인산화되어 D-자일루로오스-5-P를 형성한다. 자 일로오스-유도성 프로모터로부터의 발현 유도에 이용 가능한 세포에서 자일로오스의 양을 최대화하기 위해, 적 어도 XylA, 또는 선택적으로 XylA 및 XylB 둘 모두의 기능을 제거하거나 감소시킴으로써, 촉매에 의해 분해되는 자일로오스의 양을 감소시키는 것이 바람직하다. xylFGHR 오페론은 ABC 수퍼패밀리 고 친화도 D-자일로오스 수 송체의 서브유닛인 XylF, XylG, 및 XylH를 암호화한다. 대장균 저 친화도 자일로오스-양성자 동시수송체를 암호 화하는 xylE 유전자는 별도의 오페론을 나타내며, 이의 발현은 또한 자일로오스에 의해 유도 가능하다. 자일로 오스에 의한 유도와 독립적으로 자일로오스 수송체를 발현시키기 위해, 숙주 세포는 모든 기능성 자일로오스 수 송체가 구성 프로모터로부터 발현되도록 변경될 수 있다. 예를 들어, xylFGHR 오페론은 xylFGH 코딩 서열이 결 실되도록 변경될 수 있으며, 이에 따라 자일로오스-유도성 PxyiF 프로모터로부터 발현된 유일한 활성 단백질로 서 XylR을 남기게 되며, 여기에서 xylE 코딩 서열은 이의 천연 프로모터보다는 구성적 프로모터로부터 발현된다. 다른 예로서, xylR 코딩 서열은 발현 작제물 내의 PxyiA 또는 프로모터로부터 발현되는 한편, xylFGHR 오퍼론은 결실되고 xylE는 구성적으로 발현되거나, 대안적으로 xylFGH 오페론(이는 발현 작제물 중 존 재하기 때문에 xylR 코딩 서열이 결여됨)은 구성 프로모터로부터 발현되고 xylE 코딩 서열은 활성 단백질을 생 성하지 않도록 결실되거나 변경된다. 락토오스 프로모터. 용어 '락토오스 프로모터'는, lacZpl으로도 지칭되는 프로모터인, lacZYA 오페론에 대한 락 토오스 유도성 프로모터를 지칭하며; 이러한 락토오스 프로모터는 대장균 K-12 하위균주 MG1655(NCBI 기준 서열 NC 000913.2, l l-JAN-2012)의 게놈 서열에서 약 365603~365568(- 가닥, NA 중합효소 결합('-35') 부위는 약 365603~365598, Pribnow 박스('-10')는 365579~365573, 및 전사 개시 부위는 365567)에 위치된다. 일부 구현예 에서, 본 개시의 유도 가능한 공발현 시스템은 lacZYA 프로모터와 같은 락토오스 유도성 프로모터를 포함할 수 있다. 다른 구현예에서, 본 개시의 유도성 공발현 시스템은 락토오스 유도성 프로모터가 아닌 하나 이상의 유도 성 프로모터를 포함한다. 알칼리 인산분해효소 프로모터. 용어 '알칼리성 인산분해효소 프로모터' 및 'phoA 프로모터'는 인산염 결핍의 조건 하에서 유도되는 프로모터인 phoApsiF 오페론에 대한 프로모터를 지칭한다. phoA 프로모터 영역은 대장균 K-12 하위균주 MG1655(NCBI 기준 서열 000913.3, 16-DEC-2014)의 게놈 서열에서 약 401647~401746(+ 가닥, Pribnow 박스('-10')는 401695~401701(Kikuchi 등의 문헌[Nucleic Acids Res 1981년 11월 11일; 9: 5671 -5678]))에 위치된다. phoA 프로모터에 대한 전사 활성화제는 센서 단백질 PhoR과 함께 대장균에서 2-성분 신호 전달 시스템을 형성하는 전사 조절제인 PhoB이다. PhoB 및 PhoR은 대장균 K-12 하위균주 MG1655(NCBI 기준 서열 NC 000913.3, 16-DEC-2014)의 게놈 서열에서 약 417050~419300(+ 가닥, PhoB 코딩 서열은 417,142~417,831이고 PhoR 코딩 서열은 417,889~419,184)에 위치된 phoBR 오페론으로부터 전사된다. phoA 프로모터는 유도자의 첨가 보다는 물질, 즉 세포내 인산염의 결여에 의해 유도된다는 점에서 전술한 유도성 프로모터와 상이하다. 이러한 이유로, phoA 프로모터는 대체적으로 숙주 세포가 인산염에 대해 고갈되는 단계, 예컨대 발효의 후기 단계에서 생산될 유전자 산물의 전사를 유도하는 데 사용된다. 일부 구현예에서, 본 개시의 유도 가능한 공발현 시스템은 phoA 프로모터를 포함할 수 있다. 다른 구현예에서, 본 개시의 유도성 공발현 시스템은 phoA 프로모터가 아닌 하나 이상의 유도성 프로모터를 포함한다. 친화도 검정 항체 결합 및 항체 친화도 결정 검정은 당업계에 공지되어 있다. 일 구현예에서, 활성 특이적 세포 농축 방법(ACE/qaACE)은 \"비활성 물질\"보다는 \"활성\" 항체를 발현하는 숙주 세포를 식별하는 데 사용될 수 있다. 활성 항체는 결합 파트너 분자(예를 들어, 항원 또는 에피토프)에 특이적 으로 결합하는 활성 항체의 능력에 의해 비활성 항체와 구별될 수 있다. ACE 검정 프로토콜은 WO/2021/146626에 기술되어 있으며, 이는 본원에 참조로서 통합된다. 당업자는 ACE가 이진 방식으로 활성/비활성을 구별할 수 있 을 뿐만 아니라 친화도에 비례하는 점수를 계산할 수 있음을 이해할 것이다. 따라서, ACE는 단지 이진/부울 (Boolean) 정보가 아닌 정량적 검정 정보를 제공하며, 이는 본원의 모델링 기술로 하여금 회귀 기술을 수행할수 있게 한다. 이러한 더 풍부한 모델링은 종래의 기술의 제한된 이진 분류에 비해 유리한 개선을 나타낸다. 다른 구현예에서, WO/2021/163349에 기술되고 본원에 참조로서 통합된 HiPR 결합 검정이 본원에 제공된 방법과 함께 사용된다. 결합 검정, 예를 들어 항체-항원 상호작용을 포함하여 단백질-단백질 상호작용을 측정하고 결합 친화도를 측정 하는 검정은 당업계에 공지되어 있다. 예로서, 표면 플라스몬 공명(SPR), 이중 편광 간섭계(DPI), 정적 광 산란 (SLS), 동적 광 산란(DLS), 유동 유도 분산 분석(FIDA), 형광 편광/이방성, 형광 공명 에너지 전달(FRET), 바이 오층 간섭계(BLI), 등온 적정 열량측정(ITC), 마이크로스케일 열영동(MST), 단색 반사계(SCORE)가 고려된다. 또 한, 이중분자 형광 보완(BiFC), 친화도 전기영동, 라벨 전달, 파지 디스플레이, 탠덤 친화도 정제(TAP), 가교 결합, 녹다운과 조합된 정량적 면역침강(QUICK) 및 근접 결찰 검정(PLA)은 단백질-단백질 상호작용 정보를 제공 하는 다른 공지된 검정이다. 일부 구현예에서, 본원에 기술된 항체의 결합 친화도는 표준 기술(Abdiche 등의 문헌[MAbs 8:264-277])에"}
{"patent_id": "10-2024-7026560", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 17, "content": "따라, 어레이 표면 플라스몬 공명(SPR)에 의해 측정된다. 요약하면, 항체를 HC 30M 칩 상에 4개의 상이한 밀도/ 항체 농도로 고정시켰다. 이어서, 다양한 농도(0~500 nM)의 항체 표적을 포획된 항체에 결합시킨다. 각 항체에 대한 결합 및 해리 속도 상수(각각 ka 및 kd)를 추출하기 위해 Carterra 소프트웨어를 사용하여 동역학 분석을 수행한다. 겉보기 친화도 상수(KD)는 kd/ka의 비율로부터 계산된다. 일부 구현예에서, Carterra LSA 플랫폼이 동 역학 및 친화도를 결정하는 데 사용된다. 다른 구현예에서, 결합 친화도는, 예를 들어, IBIS Technologies의 IBIS MX96 SPR 시스템 또는 Carterra LSA SPR 플랫폼을 사용하는 표면 플라스몬 공명(예를 들어, BIAcoreTM)에 의해, 또는 예를 들어 ForteBio의 OctetTM 시스템을 사용하는 Bio-Layer Interferometry에 의해 측정될 수 있다. 일부 구현예에서, Octet RED384, ProteOn XPR36, IBIS MX96 및 Biacore T100과 같은 바이오센서 기기가 사용된다(Yang, D. 등의 문헌[J. Vis. Exp., 2017, 122:55659]). KD는 항체와 이의 항원 사이의 koff/kon의 비율인 평형 해리 상수이다. KD 및 친화도는 반비례 관계이다. KD 값은 항체의 농도에 관한 것이며, 따라서 KD 값이 낮을수록(보다 낮은 농도), 이에 따라 해당 항체의 친화도는 더 높 아진다. 기준 항체 및 변이체 항체를 포함하는, 본 개시의 다양한 구현예에 따른 KD는, 예를 들어 마이크로몰 범 위(10-4 내지 10-6), 나노몰 범위(10-7 내지 10-9), 피코몰 범위(10-10 내지 10-12) 또는 펨토몰 범위(10-13 내지 10- 15)일 수 있다. 일부 구현예에서, 변이체 항체의 항체 친화도는 기준 항체에 비해 대략 5, 10, 15, 20, 25, 30, 35, 40, 45, 또는 50% 이상만큼 개선된다. 이러한 개선은 또한 배수 변화(예를 들어, 결합 활성의 2x, 4x, 6x, 또는 2-, 3-, 4-, 5-, 6-, 7-, 8-, 9-, 10-배 또는 그 이상의 개선 등) 및/또는 차수 크기(예를 들어, 107, 108, 109 등)에 대해 표현될 수 있다. 본원에 기술된 항체 및 검정으로부터 생성된 데이터는, 일부 구현예에서, 다음에서 설명되는 바와 같이, 하나 이상의 모델을 학습시키는 데 사용된다. 추가 고려 사항 본 개시가 추가로 설명되기 전, 본 개시는 설명된 특정 구현예에 한정되지 않으며, 따라서 물론 다양할 수 있음 을 이해해야 한다. 또한, 본 개시의 범주는 첨부된 청구범위에 의해서만 제한되기 때문에, 본원에서 사용되는 용어는 단지 특정 구현예를 설명하기 위한 것이며 이를 제한하려는 것은 아님을 이해해야 한다. 값의 범위가 제공되는 경우, 문맥이 달리 명백하게 지시하지 않는 한, 각각의 개재 값은, 하한의 단위의 10분의 1까지, 해당 범위의 상한 및 하한과 해당 언급된 범위의 임의의 다른 명시된 값 또는 개재 값 사이에서 본 개시 에 포함되는 것으로 이해된다. 이들 더 작은 범위의 상한 및 하한은 독립적으로 더 작은 범위에 포함될 수 있으 며, 이 또한 명시된 범위의 임의의 구체적으로 배제된 한계에 따라 본 개시에 포함된다. 명시된 범위가 해당 한 계 중 하나 또는 둘 모두를 포함하는 경우, 포함된 한계 중 하나 또는 둘 모두를 배제하는 범위 또한 본 개시에 포함된다. 달리 정의되지 않는 한, 본원에 사용된 모든 기술적 및 과학적 용어는 본 개시가 속하는 당업자에 의해 일반적 으로 이해되는 것과 동일한 의미를 갖는다. 본원에 기술된 것과 유사하거나 동등한 임의의 방법 및 물질 또한 본 개시의 실시 또는 시험에 사용될 수 있지만, 이제 바람직한 방법 및 물질이 설명된다. 본원에 언급된 모든간행물은 해당 간행물이 인용되는 방법 및/또는 물질을 개시하고 설명하기 위해 참조로서 본원에 통합된다. 본원에서 사용되는 바와 같이, 그리고 첨부된 청구범위에서, 문맥이 달리 명백하게 언급하지 않는 한, 단수 형 태 \"일\", \"및\", 및 \"하나\"는 복수의 참조를 포함한다는 점에 주목해야 한다. 따라서, 예를 들어, \"형태 스위칭 프로브\"에 대한 언급은 복수의 해당 형태 스위칭 프로브를 포함하고, \"미세유체 장치\"에 대한 언습은 당업자에 게 공지된 하나 이상의 미세유체 장치 및 이의 등가물에 대한 참조 등을 포함한다. 청구범위는 임의의 요소, 예 를 들어 임의의 선택적인 요소를 배제하는 것으로 작성될 수 있음에 추가로 유의해야 한다. 이와 같이, 해당 문 구는 청구범위 요소의 인용, 또는 \"부정적\" 제한의 사용과 관련하여, \"단독으로\", \"단지\" 등과 같은 배타적인 용어의 사용에 대한 선행 기준으로서 기능하는 것으로 의도된다. 본 개시를 읽을 때 당업자에게 명백해지는 바와 같이, 본원에 설명되고 도시된 개별 구현예 각각은 본 개시의 범주 또는 사상을 벗어나지 않고 다른 여러 구현예 중 어느 하나의 특징부로부터 용이하게 분리되거나 조합될 수 있는 개별 구성요소 및 특징부를 갖는다. 임의의 인용된 방법은 인용된 이벤트의 순서 또는 논리적으로 가능 한 임의의 다른 순서로 수행될 수 있다. 이는 이러한 모든 조합에 대한 지원을 제공하는 것으로 의도된다. 실시예 실시예 1 - 서열 변이체의 생성 및 친화도 결정 예를 들어, 도 2에 도시된 바와 같이, 트라스투주맙의 가변 도메인(서열번호 1 및 2; 및 www.genome.jp/entry/D03257)의 CDRH3의 8개 위치의 이중 돌연변이체(서열번호 2-#)를 먼저 생성하였다. 서열번호 1 (중쇄) EVQLVESGGG LVQPGGSLRL SCAASGFNIK DTYIHWVRQA PGKGLEWVAR IYPTNGYTRY ADSVKGRFTI SADTSKNTAY LQMNSLRAED TAVYYCSRWG GDGFYAMDYW GQGTLVTVSS 서열번호 2 (경쇄) DIQMTQSPSS LSASVGDRVT ITCRASQDVN TAVAWYQQKP GKAPKLLIYS ASFLYSGVPSRFSGSRSGTD FTLTISSLQP EDFATYYCQQ HYTTPPTFGQ GTKVEIK Her2에 대한 활성 기반 정량적 검정(WO/2021/146626)을 사용하여 변이체를 스크리닝하였다. 넓은 KD 범위(예를 들어, 10-6 내지 10-10 M)에 걸쳐 변이체를 양호하게 표현하기 위해 상이한 게이트에 걸쳐 개별 클론을 선택하였 다. 개별 클론을 Carterra SPR을 사용하여 재스크리닝하였다. 이는 약 500개의 고유 서열 변이체 및 연관된 KD 를 제공하였다. OAS 데이터 세트를 사용하여 사전 학습된 모델을, 500개의 고유 서열 변이체 및 이들의 연관된 친화도 표지를 사용하는 전달 학습을 사용하여, 본원에서 논의된 바와 같이 추가로 미세 조정하였다.500개 중 발췌된 고유 변이체는 다음과 같다:"}
{"patent_id": "10-2024-7026560", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 18, "content": "10-배 교차 검증을 수행하여, 10개의 독립적인 데이터세트 슬라이스에 걸쳐, 450개의 변이체를 학습에 사용하고 50개의 변이체를 사용하여 예측 정확도를 확인하였다. 교차 검증 데이터 세트를 통합할 때, Pearson 상관 계수 는 도 2의 블록에 도시된 바와 같이 0.74인 것으로 밝혀졌다. 당업자는 본 실시예가 이용 가능한 데이터세트를 사용하는 통계 분석을 포함하는 추가 모델링을 포함할 수 있음 을 이해할 것이다. 일부 양태에서, 친화도 모델링의 목표는 CDR 영역에서의 서열 변형에 기초하여 표적에 대한 항체의 친화도를 예측하는 것이다. 예를 들어, 트라스투주맙과 관련하여, 전술한 실시예에 도시된 바와 같이, 8 개의 아미노산에 걸쳐 최대 2개의 돌연변이의 조합 돌연변이 유발이 CDRH3에서 수행될 수 있다. 두 가지 유형의 실험 측정치가 측정될 수 있다: 낮은 처리량, 그러나 매우 정확한 표면 플라스몬 공명(SPR) KD 판독치, 및 독점 적 ACE 검정으로부터의 KD의 높은 처리량(HT)이지만 노이즈가 더 많은 추정치. 본 기술은 2가지 목적, 즉 모델 학습 및 평가을 위해, SPR 검정을 위한 샘플을 선택하는 단계를 포함할 수 있다. 학습 서열은 HT 스크린(SPR) 내의 농축된 결합제의 군으로부터 선택될 수 있다. 추가 서열은 학습된 SPR 모델의 예측에 기초하여 평가될 수 있다. 성능 측정은 10-배 교차 검증으로부터의 풀링된 배수 이탈 예측에 기초할 수 있다. KD의 모든 측정은 각 각의 RMSE 메트릭에 반영된 바와 같이, log10 척도에 기초하였다. 서열 자연도는, 일부 양태에서, 일부 마스킹된 언어 모델에 대해 공지된 바와 같이, 이의 의사-복잡성의 역으로 서 정의될 수 있다:"}
{"patent_id": "10-2024-7026560", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 19, "content": "예를 들어, Salazar, J., Liang, D., Nguyen, T. Q., 및 Kirchhoff, K.의 문헌[Masked language model scoring. 2019. doi: 10.48550/ARXIV.1910.14659. URL https://arxiv. org/abs/1910.14659]을 참조한다. 일부 양태에서, 136개의 항체에 걸친 HEK-293 세포에서의 항체 역가의 측정이 수득될 수 있다(예를 들어, Jain 등). 역가와 CDR 서열 자연도 사이의 관계를 비교하기 위해, 0.5의 유의성 임계값을 갖는 Mann-Whitney U 검정이 사용될 수 있다. 항체 개발가능성 점수 및 플래그는, 일부 양태에서, 다양한 개발가능성 잠재력을 가질 것으로 예상되는 파지 디 스플레이 스크리닝 라이브러리로부터의 서열에 대해 평가될 수 있다(예를 들어, Liu 등(2019a)). 예를 들어, 가장 풍부한 5000개의 서열은 치료 항체 프로파일러(TAP)를 사용하여, 개발가능성의 5가지 기준(Raybould, M. I. J., Marks, C., Krawczyk, K., Tad-dese, B., Nowak, J., Lewis, A. P., Bujotzek, A., Shi, J., 및 Deane, C. M.의 문헌[Five computational de-velopability guidelines for therapeutic antibody profiling. Proceedings of the National Academy of Sciences, 116:4025-4030, 2019. doi: 10.1073/pnas. 1810576116. URL https://www.pnas.org/doi/ abs/10.1073/pnas.1810576116.])에 따라 평가될 수 있다. 일부 양태에서, 항-약물 항체(ADA) 반응을 갖는 환자의 백분율로서 (예를 들어, Marks 등으로부터의) 보 고된 면역원성 수준이 수득될 수 있다. 분석은 인간화 항체만을 사용하여 수행될 수 있다. 분석은, 예를 들어, 0.5의 유의성 임계값을 갖는 Mann-Whitney U 검정을 사용하여, 본 모델링 기술에 의해 자연적으로 간주되는 항 체와 비자연적으로 간주되는 항체 간의 면역원성 수준을 비교하는 단계를 포함할 수 있다. 실시예 2 - 취약한 결합 학습 데이터를 사용한 서열 변이체의 생성 및 친화도 결정 실시예 1의 데이터를 사용하여, 모델을 KD 기준 하위(더 약한 결합제) 450개의 변이체로 학습시킨 다음, 상위 50개의 변이체(더 강한 결합제)의 KD를 예측하였다. 모델은 이들 서열 변이체의 대부분이 강한 결합제임을 정확 하게 예측하였다. 그러나, 강력한 결합제가 매우 좁은 KD 분포를 갖지며, 여기에서 측정 오차는 순위 지정에 필 요한 정확도보다 크다는 사실로 인해, 모델은 이러한 강한 결합제의 상대 순위를 예측할 수 없었다. 즉, 상위 50개의 변이체에 대한 Carterra 측정의 두번째 반복에서도 원래의 Carterra 측정에서 보이는 것과 동일한 순위 를 산출하지 못할 가능성이 있다. 모델이 실험 데이터에 대해 학습되며, 해당 실험 데이터는 좁은 KD 범위에서 변이체의 순위 지정할 수 있는 해상도를 갖지 않기 때문에, 모델은 해당 기능 한계를 물려받는다. 그럼에도 불 구하고, 모델은 어느 결합제가 KD 친화도의 가장 강한 분류에 속하는지 예측할 수 있다. 실시예 3 - 노이즈 제거 및 자연도를 사용하는 관심 생체분자 생성 노이즈 제거 및 자연도에 대한 예 및 설명은 도 4a-도 4o에 상세히 제시되어 있다. 라이브러리 스크리닝, 면역 화 및/또는 인간화 캠페인으로부터 생성된 관심 표적에 대한 항체는 불충분한 결합 친화도와 같은 준최적 특성 을 나타낼 수 있으므로, 선도 최적화를 필요로 한다. 구조 가이드 조작은 항체를 개선하기 위한 강력한 접근법 이지만, 시간이 많이 걸리며, 이는 솔루션의 제한된 세트에 대한 실험적 검증으로 이어진다. 대조적으로, 스크 리닝 또는 선택과 결합된 심층 돌연변이유발은 더 큰 서열 공간에 대한 탐색을 가능하게 함으로써, 잠재적으로 더 많은 보다 양호한 변이체를 수득할 수 있게 한다. 그러나, 대부분의 돌연변이는 결합을 개선하지 않고 분해 하여, 스크리닝 효율을 감소시킨다. 또한, 탐색 가능한 서열 공간의 조합은 돌연변이 부하에 따라 기하급수적으 로 증가하며, 이는 실험 분석의 용량을 수십 배 초과한다. 마지막으로, 대부분의 접근법에서, 변이체 라이브러 리는 한 번에 하나의 특성에 대해서만 스크리닝될 수 있기 때문에, 다수의 특성에 대한 동시에 최적화에는 난관 이 있다. 선도 항체는 결합 친화도 및 다른 특성의 최적화를 필요로 한다. 전통적인 조작 접근법은 시간이 많이 걸리고 솔루션 시퀀스 공간의 하위 집합만을 탐색한다. 이러한 문제를 해결하기 위해, 본 연구진은, 합성 생물학 데이 터 생성을 활용하는, AI를 사용하는 항체 개발을 지원한다. 일부 경우에, 독점 습식 실험실 검정을 사용하여 생 성된 트라스투주맙의 서열 변이체의 고품질 친화도 측정(KD s 또는 대리체)을 사용하는 머신 러닝 및 인공 지능 (예를 들어, 학습된 신경망)은, KD s의 거의 4배에 걸쳐 있는 보이지 않는 서열 변이체의 결합 친화도를 높은 정확도로 예측하여, 가상 환경에서 스크리닝을 수행하는 능력을 초래할 수 있다. 예측의 정량적 성질은 원하는 KD에 대한 항원 결합을 강화, 약화 또는 조정하는 친화도 성숙 응용을 가능하게 하였다. 또한, 천연 항체의 서열 을 AI 모델에 도입함으로써, 변이체를 인간 항체 레퍼토리와 비교하여, 천연 항체 특성을 가질 가능성이 더 높 은 것들(높은 \"자연도\" 점수)을 예측할 수 있다. 경험적 시험은 자연도 점수가 개발가능성 및 면역원성과 관련 된 하류 문제를 완화시킬 가능성을 가짐을 발견하였다. 생성 기술을 사용함으로써, 신경망은 친화도 및 자연도 둘 모두에 대해 최적화된 서열 변이체를 생성하였다. 돌연변이 부하가 증가함에 따라 항체 변이체 자연도 중앙"}
{"patent_id": "10-2024-7026560", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 20, "content": "값은 감소하기 때문에, 고-자연도 서열 공간에 대해 친화도 성숙을 제한하는 능력이 중요하다. 요약하면, 인공 지능에 있어서의 본 개발은 항체 조작을 가속화하고 향상시킬 뿐만 아니라, 궁극적으로 항체의 품질을 개선할 수 있는 완전히 신규한 응용을 가능하게 할 것을 약속한다. (예를 들어, 트라스투주맙의) 서열 변이체의 친화도 측정으로 학습된 모델은 보지 못했던 변이체의 결합 강도를 정량적으로 예측할 수 있다. 모델은 인간 항체 레퍼 토리와 비교하여 예측된 \"자연도\"에 대해 항체 서열을 채점할 수 있다. 본 기술은 다중 종 데이터를 사용하여 하나 이상의 자연도 머신 러닝 모델을 학습시킬 수 있다. 높은 자연도 점수는 개발가능성과 긍정적으로, 그리고면역원성과 부정적으로 연관될 수 있다. 생성 기술은 친화도 및 자연도 둘 모두에 대한 최적화를 가능하게 한다. 자연도는, 결합 친화도는 유일한 관련 고려 사항이 아닌, 약물 발견과 같은 본 기술의 많은 응용에서 매 우 중요하다. 전술한 다양한 구현예는 추가 구현예를 제공하기 위해 조합될 수 있다. 본 명세서에 언급되고/되거나 본 출원 데이터 시트에 열거된 모든 미국 특어, 미국 출원 공개, 미국 특허 출원, 해외 특허, 해외 특허 출원 및 비특허 공개 문헌은 그 전체가 참조로서 본원에 통합된다. 구현예의 양태는, 다양한 특허, 출원 및 공개의 개념을 사용 하여 추가 구현예를 제공하기 위해, 필요한 경우 수정될 수 있다. 이들 및 다른 변경은 전술한 상세한 설명을 고려하여 해당 구현예에 대해 이루어질 수 있다. 일반적으로, 다음 의 청구범위에서, 사용된 용어는 해당 청구범위를 본 명세서 및 청구범위에 개시된 특정 구현예로 제한하는 것으로 해석되어서는 안 되며, 해당 청구범위는, 해당 청구범위에 대한 자격이 갖추어진 등가물의 전체 범주와 함 께 모든 가능한 구현예를 포함하는 것으로 해석되어야 한다. 따라서, 청구범위는 본 개시에 의해 제한되지 않는 다. 본 개시에 기술된 기술의 양태는 다음 양태 중 어느 하나를 단독으로 또는 조합하여 포함할 수 있다: 1. 관심 생체분자 서열 변이체를 식별하기 위한 컴퓨팅 시스템으로서, 상기 컴퓨팅 시스템은: 하나 이상의 프로 세서; 및 하나 이상의 비일시적 컴퓨터 판독가능 매체이되, 상기 하나 이상의 비일시적 컴퓨터 판독가능 매체에 는: 학습 데이터를 사용하여 학습된 머신 러닝된 모델로서, 상기 학습 데이터는, 상응하는 각각의 결합 파트너 에 결합하는 각각의 능력을 나타내는 각각의 측정된 결합 특성을 각각 갖는 하나 이상의 학습 생체분자 서열 변 이체를 포함하고, 상기 머신 러닝된 모델은 입력 생체분자 서열 변이체의 예측 생체분자 결합 특성을 출력하도 록 구성되는, 머신 러닝된 모델; 및 상기 하나 이상의 프로세서에 의해 실행되는 경우, 상기 컴퓨팅 시스템으로 하여금, 상기 하나 이상의 생체분자 서열 변이체 중 각각의 하나에 각각 상응하는 하나 이상의 예측된 결합 특 성을 생성하기 위해 상기 머신 러닝된 모델로 하나 이상의 생체분자 서열 변이체를 처리하게 하고; 상기 하나 이상의 생체분자 서열 변이체 중 하나 이상의 관심 생체분자 서열 변이체(여기에서, 상기 하나 이상의 관심 생 체분자 서열 변이체 각각은 각각의 하나 이상의 원하는 특성을 가짐)를 식별하기 위해 상기 하나 이상의 예측된 결합 특성을 분석하게 하고; 상기 하나 이상의 관심 생체분자 서열 변이체를 출력으로서 제공하게 하는 명령어 가 저장되는, 하나 이상의 비일시적 컴퓨터 판독가능 매체를 포함하는, 컴퓨팅 시스템. 2. 양태 1에 있어서, 하나 이상의 학습 생체분자 서열 변이체 중 적어도 하나는 항체 서열 변이체이고, 상응하 는 각각의 결합 파트너는 항원이며; 하나 이상의 생체분자 서열 변이체는 항체 서열 변이체인, 컴퓨팅 시스템. 3. 양태 2에 있어서, 하나 이상의 학습 생체분자 서열 변이체 중 적어도 하나는 항원 서열 변이체이고, 상응하 는 각각의 결합 파트너는 항체이며; 하나 이상의 생체분자 서열 변이체는 항원 서열 변이체인, 컴퓨팅 시스템. 4. 양태 1에 있어서, 학습 데이터는 다중 종 서열 데이터를 포함하는, 컴퓨팅 시스템. 5. 양태 4에 있어서, 다중 종 서열 데이터는 (i) 인간 서열 데이터, (ii) 마우스 서열 데이터, 또는 (iii) 카멜 리드 서열 데이터 중 적어도 하나를 포함하는, 컴퓨팅 시스템. 6. 양태 1에 있어서,하나 이상의 학습 생체분자 서열 변이체는, 총 가능한 변이체 공간의 10% 미만, 총 가능한 변이체 공간의 9% 미만, 총 가능한 변이체 공간의 8% 미만, 총 가능한 변이체 공간의 7% 미만, 총 가능한 변이 체 공간의 6% 미만, 총 가능한 변이체 공간의 5% 미만, 총 가능한 변이체 공간의 4% 미만, 총 가능한 변이체 공 간의 3% 미만, 총 가능한 변이체 공간의 2% 미만, 또는 총 가능한 변이체 공간의 1% 미만을 포함하는, 컴퓨팅 시스템. 7. 양태 1에 있어서,하나 이상의 학습 생체분자 서열 변이체는, 총 가능한 변이체 공간의 0.5% 미만,총 가능한 변이체 공간의 0.4% 미만, 총 가능한 변이체 공간의 0.3% 미만, 총 가능한 변이체 공간의 0.2% 미만, 또는 총 가능한 변이체 공간의 0.1% 미만을 포함하는, 컴퓨팅 시스템. 8. 양태 1 내지 7 중 어느 하나에 있어서, 하나 이상의 비일시적 컴퓨터 판독가능 매체에는, 하나 이상의 프로 세서에 의해 실행될 때, 컴퓨팅 시스템으로 하여금: (i) 관찰된 항체 공간(Observed Antibody Space, OAS) 데 이터베이스; (ii) Uniref90 단백질 데이터베이스; (iii) 임의의 Uniref-유래 데이터세트; (iv) BFD 데이터세트; (v) Mgnify 데이터세트; (vi) JGI 또는 EBI 개설로부터 유래된 임의의 메타게놈 데이터세트; (vii) 조립된 단백질 서열의 임의의 코퍼스(corpus); 또는 (viii) BCR-시퀀싱 또는 다른 수단에 의해 수득될 수 있는, 천연 항체 서열의 임의의 데이터세트 중 적어도 하나로부터의 하나 이상의 학습 생체분자 서열 변이체 중 적어도 하나를 수득하게 하는 추가의 명령어가 저장되는, 컴퓨팅 시스템. 9. 양태 1 내지 8 중 어느 하나에 있어서, 하나 이상의 비일시적 컴퓨터 판독가능 매체에는, 하나 이상의 프로 세서에 의해 실행될 때, 컴퓨팅 시스템으로 하여금: 하나 이상의 학습 생체분자 서열 변이체를 분석하기 위해 자체 지도 사전학습 객체화를 사용하여 머신 러닝된 모델을 사전학습시키게 하는(여기에서, 상기 사전학습은 범 용 모델 가중치 세트를 생성하는 단계를 포함함) 추가의 명령어가 저장되는, 컴퓨팅 시스템. 10. 양태 9에 있어서, 자체 지도 사전학습 객체화는 마스킹된 언어 모델 객체화인, 컴퓨팅 시스템. 11. 양태 1 내지 10 중 어느 하나에 있어서, 하나 이상의 비일시적 컴퓨터 판독가능 매체에는, 하나 이상의 프 로세서에 의해 실행될 때, 컴퓨팅 시스템으로 하여금: 학습 데이터 내의 학습 생체분자 서열 변이체의 수가 소 정의 임계값 미만인 것으로 결정하는 것에 응답하여 머신 러닝된 모델을 사전학습시키게 하는 추가의 명령어가 저장되는, 컴퓨팅 시스템. 12. 양태 1 내지 11 중 어느 하나에 있어서, 하나 이상의 비일시적 컴퓨터 판독가능 매체에는, 하나 이상의 프 로세서에 의해 실행될 때, 컴퓨팅 시스템으로 하여금: 항체-항원 쌍(여기에서, 상기 항체-항원 쌍은 항체-항원- 특이적 가중치의 세트에 상응함)에 상응하는 적어도 하나의 결합 검정에 의한 데이터 출력을 사용하여 머신 러 닝된 모델을 추가로 학습시키게 하는 추가의 명령어가 저장되는, 컴퓨팅 시스템. 13. 양태 12에 있어서, 적어도 하나의 결합 검정은 (i) 고 처리량 스크리닝, (ii) 저 처리량 스크리닝, (iii) 고정밀 표적화 스크리닝, (iv) 표면 플라스몬 공명(SPR) 기술, (v) 등온 적정 열량측정(ITC) 기술, (vi) 바이오 층 간섭측정(BLI) 기술, 또는 (vii) 마이크로스케일 열영동(MST) 기술 중 적어도 하나를 포함하는, 컴퓨팅 시스 템. 14. 양태 1 내지 13 중 어느 하나에 있어서, 하나 이상의 비일시적 컴퓨터 판독가능 매체에는, 하나 이상의 프 로세서에 의해 실행될 때, 컴퓨팅 시스템으로 하여금: 상이한 항체-항원 쌍에 상응하는 상이한 적어도 하나의 결합 검정에 의한 데이터 출력을 사용하여 머신 러닝 모델을 재학습시키게 하는 추가의 명령어가 저장되며, 여 기에서 상기 재학습은 상기 상이한 항체-항원 쌍에 상응하는 상이한 항체-항원-특이적 가중치 세트를 생성하는 것을 포함하는, 컴퓨팅 시스템. 15. 양태 1 내지 14 중 어느 하나에 있어서, 하나 이상의 프로세서에 의해 실행되는 경우, 컴퓨팅 시스템으로 하여금 환경 조건에 기초하여 적어도 하나의 각각의 측정된 결합 특성을 결정하게 하는 추가 명령어가 저장된 하나 이상의 비일시적 컴퓨터 판독 가능 매체를 포함하는, 컴퓨팅 시스템. 16. 양태 1에 있어서, 하나 이상의 생체분자 서열 변이체는 기준 항체를 포함하는, 컴퓨팅 시스템. 17. 양태 1에 있어서, 하나 이상의 생체분자 서열 변이체는, 상업적 항체, 비상업적 항체, 임상 항체, 비임상 항체, 연구 등급 항체, 진단 등급 항체, 공개적으로 이용 가능한 항체, 환자 샘플로부터 유래된 항체, 생체 내 에서 발견된 신규 항체, 시험관 내에서 발견된 신규 항체, 가상 환경에서 발견된 신규 항체 중 적어도 하나를 포함하는, 컴퓨팅 시스템. 18. 양태 1에 있어서, 하나 이상의 생체분자 서열 변이체는 단클론 항체, 인간 항체, 인간화 항체, 카멜화 항체, 키메라 항체, 단쇄 Fv(scFv), 이황화-결합 Fv(sdFv), Fab 단편, F(ab') 단편, 항-이디오타입(항-Id) 항 체 및 상기 중 어느 하나의 에피토프 결합 단편으로 이루어진 군으로부터 선택된 적어도 하나의 서열 변이체를 포함하는, 컴퓨팅 시스템. 19. 양태 1에 있어서, 하나 이상의 비일시적 컴퓨터 판독가능 매체에는, 하나 이상의 프로세서에 의해 실행될 때, 컴퓨팅 시스템으로 하여금, 하나 이상의 생체분자 서열 변이체 중 적어도 하나의 생체분자의 하나 이상의 아미노산을 프로그램적으로 돌연변이시킴으로써 하나 이상의 생체분자 서열 변이체를 생성하게 하는 추가의 명 령어가 저장되는. 컴퓨팅 시스템. 20. 양태 1 내지 19 중 어느 하나에 있어서, 하나 이상의 비일시적 컴퓨터 판독가능 매체에는, 하나 이상의 프 로세서에 의해 실행될 때, 컴퓨팅 시스템으로 하여금, 항체의 상보성 결정 영역(CDR), 중쇄 가변 영역(VH), 경 쇄 가변 영역(VL), 프레임워크(FR), 또는 불변 도메인으로 이루어진 군으로부터 선택되는, 하나 이상의 생체분 자 서열 변이체 중 적어도 하나의 하나 이상의 영역을 프로그램적으로 돌연변이시킴으로써 하나 이상의 생체분 자 서열 변이체를 생성하게 하는 추가의 명령어가 저장되는. 컴퓨팅 시스템. 21. 양태 1 내지 양태 20 중 어느 하나에 있어서, 하나 이상의 비일시적 컴퓨터 판독가능 매체에는, 하나 이상 의 프로세서에 의해 실행될 때, 컴퓨팅 시스템으로 하여금, VH의 CDR1, CDR2 및 CDR3으로 이루어진 군으로부터 선택되는 하나 이상의 CDR을 프로그램적으로 돌연변이시킴으로써 하나 이상의 생체분자 서열 변이체를 생성하게 하는 추가의 명령어가 저장되는. 컴퓨팅 시스템. 22. 양태 1 내지 양태 21 중 어느 하나에 있어서, 하나 이상의 비일시적 컴퓨터 판독가능 매체에는, 하나 이상 의 프로세서에 의해 실행될 때, 컴퓨팅 시스템으로 하여금, VL의 CDR1, CDR2 및 CDR3으로 이루어진 군으로부터 선택되는 하나 이상의 CDR을 프로그램적으로 돌연변이시킴으로써 하나 이상의 생체분자 서열 변이체를 생성하게 하는 추가의 명령어가 저장되는. 컴퓨팅 시스템. 23. 양태 1에 있어서, 하나 이상의 생체분자 서열 변이체 중 적어도 하나의 이소형은 IgG, IgE, IgM, IgD, IgA 및 IgY로 이루어진 군으로부터 선택되는, 컴퓨팅 시스템. 24. 양태 1에 있어서, 하나 이상의 예측된 결합 특성 중 적어도 하나는 평형 해리 상수(KD)로서 표현되며, 이는 하나 이상의 생체분자 서열 변이체 중 적어도 하나에 비해 2배, 3배, 4배, 5배, 6배, 7배, 8배, 9배, 또는 10배 이상 개선되는, 컴퓨팅 시스템. 25. 양태 1에 있어서, 하나 이상의 관심 변이체 중 적어도 하나의 관심 변이체의 각각의 원하는 특성은: (i) 관 심 변이체의 적어도 하나의 예측된 결합 평형의 증가; (ii) 관심 변이체의 적어도 하나의 예측된 결합 평형의 감소; (iii) 관심 변이체의 적어도 하나의 예측된 결합 평형의 상한; (iv) 관심 변이체의 적어도 하나의 예측된 결합 평형의 하한; (v) 관심 변이체의 제1 항원에 대한 제1 예측된 결합 평형의 증가 및 관심 변이체의 제2 항 원에 대한 제2 예측된 결합 평형의 감소; (vi) 수용체에 대한 결합 평형을 증가 또는 감소시키기 위한 관심 변 이체의 사이토카인 서열의 능력; (vii) 차세대 항체 스캐폴드 및/또는 항체 모방 스캐폴드로서 사용하기 위한 관심 변이체의 적합성; (viii) 항체의 Fc 영역에서 Fc 수용체에 결합하는 관심 변이체의 능력; (ix) 투여 시 내 약성에 의해 표시된 바와 같은 관심 변이체의 개발가능성; 또는 (x) 다른 단백질과 상호작용하는 단백질의 능력 중 적어도 하나를 포함하는, 컴퓨팅 시스템. 26. 양태 1에 있어서, 예측된 결합 특성은 (i) 해리 상수 수치(Kd); (ii) Kd에 대한 대리체/상관체; (iii) 결합 상수 수치(Ka); 또는 (iv) Ka에 대한 대리체/상관체 중 적어도 하나를 포함하는, 연산 시스템. 27. 양태 1에 있어서, 비일시적 컴퓨터 판독가능 매체는 (i) 인공 신경망; (ii) 트랜스포머 신경망; (iii) 컨볼 루션 신경망; (iv) 순환 신경망; (v) 딥 러닝 네트워크; (vi) 오토인코더; (vii) 회귀 모델; (viii) 플러그 앤 플레이 언어 모델; (iv) 생성 모델; 또는 (x) 유전자 알고리즘 중 적어도 하나를 저장하는, 컴퓨팅 시스템. 28. 관심 생체분자 서열 변이체를 식별하기 위해 머신 러닝 모델을 학습시키기 위한 컴퓨터 구현 방법으로서: 기준 생체분자를 프로그램적으로 돌연변이시킴으로써 하나 이상의 생체분자 서열 변이체를 생성하는 단계; 하나 이상의 학습 결합 특성에 따른 생체분자 서열 변이체의 순위를 포함하는 스크리닝 데이터를 수신하는 단계; 및 입력 생체분자 서열 변이체의 하나 이상의 원하는 결합 특성을 예측하기 위해 상기 스크리닝 데이터를 사용하여 상기 머신 러닝 모델을 학습시키는 단계를 포함하는, 컴퓨터 구현 방법. 29. 양태 28에 있어서, 하나 이상의 학습 결합 특성을 증폭시키기 위해 생체분자 서열 변이체에 상응하는 재스 크리닝 데이터를 수신하는 단계; 및 머신 러닝 모델의 정확도를 개선하기 위해 상기 재스크리닝 데이터를 사용 하여 머신 러닝 모델을 추가로 학습시키는 단계를 추가로 포함하는, 컴퓨터 구현 방법. 30. 양태 28에 있어서, 결합 특성을 학습시키는 단계는 결합 친화도(KD)를 포함하는, 컴퓨터 구현 방법. 31. 양태 28에 있어서, 스크리닝 데이터는 (i) 인간 실험자, 및 (ii) 검정 장치 중 하나 또는 둘 모두로부터 수 신되는, 컴퓨터 구현 방법. 32. 양태 28에 있어서, 하나 이상의 생체분자 서열 변이체는 항체 또는 항원을 포함하는, 컴퓨터 구현 방법. 33. 예측 노이즈 제거를 통해 정확도 및 처리량을 개선하기 위한 컴퓨팅 시스템으로서, 상기 컴퓨팅 시스템은: 하나 이상의 프로세서; 및 하나 이상의 비일시적 컴퓨터 판독가능 매체이되, 상기 하나 이상의 비일시적 컴퓨터 판독가능 매체에는: 학습 데이터를 사용하여 학습된 머신 러닝된 모델로서, 상기 학습 데이터는, 상응하는 각각 의 결합 파트너에 결합하는 각각의 능력을 나타내는 각각의 측정된 결합 특성을 각각 갖는 하나 이상의 학습 생 체분자 서열 변이체를 포함하고, 상기 머신 러닝된 모델은 하나 이상의 학습 생체분자 서열 변이체의 예측된 노 이즈 제거 생체분자 결합 특성을 출력하도록 구성되는, 머신 러닝된 모델; 및 상기 하나 이상의 프로세서에 의 해 실행되는 경우, 상기 컴퓨팅 시스템으로 하여금, 상기 하나 이상의 학습 생체분자 서열 변이체 중 각각의 하 나에 각각 상응하는 하나 이상의 노이즈 제거된 예측된 결합 특성을 생성하기 위해 상기 머신 러닝된 모델로 상기 하나 이상의 학습 생체분자 서열 변이체를 처리하게 하고; 상기 하나 이상의 학습 생체분자 서열 변이체 및 각각의 노이즈 제거된 예측된 결합 특성을 출력으로서 제공하게 하는 명령어가 저장되는, 하나 이상의 비일시적 컴퓨터 판독가능 매체를 포함하는, 컴퓨팅 시스템. 34. 양태 33에 있어서, 학습 생체분자 서열 변이체는 하나 이상의 불포화 서열 변이체를 포함하는, 컴퓨팅 시스 템. 35. 양태 33에 있어서, 상응하는 각각의 결합 파트너에 각각 결합하는, 상기 각각의 능력을 나타내는 각각의 측 정된 결합 특성 각각은, ACE assayTM을 통해 결정되는, 컴퓨팅 시스템. 36. 생체분자 서열 변이체의 자연도를 예측하기 위한 컴퓨팅 시스템으로서, 상기 컴퓨팅 시스템은: 하나 이상의 프로세서; 및 하나 이상의 비일시적 컴퓨터 판독가능 매체이되, 상기 하나 이상의 비일시적 컴퓨터 판독가능 매 체에는: 학습 데이터를 사용하여 학습된 머신 러닝된 모델로서, 상기 학습 데이터는 하나 이상의 학습 생체분자 서열 변이체를 포함하고, 상기 머신 러닝 모델은 하나 이상의 생체분자 서열 변이체의 각각의 예측된 자연도 특 성을 출력하도록 구성되는, 머신 러닝된 모델; 및 상기 하나 이상의 프로세서에 의해 실행되는 경우, 상기 컴퓨 팅 시스템으로 하여금: 상기 하나 이상의 입력 생체분자 서열 변이체의 각각에 대해 각각 예측된 자연도를 생성 하기 위해 상기 머신 러닝된 모델로 상기 하나 이상의 생체분자 서열 변이체를 처리하게 하고; 상기 예측된 자 연도 특성 중 적어도 하나를 출력으로서 제공하게 하는 명령어가 포함되는, 하나 이상의 비일시적 컴퓨터 판독 가능 매체를 포함하는, 컴퓨팅 시스템. 37. 양태 36에 있어서, 비일시적 컴퓨터 판독가능 매체에는, 하나 이상의 프로세서에 의해 실행될 때, 컴퓨팅 시스템으로 하여금: 적어도 하나의 각각의 자연도 특성과 개발가능성 특성 사이의 하나 이상의 상관관계를 결정 하기 위해, 하나 이상의 입력 생체분자 서열 변이체 각각에 대한 각각의 예측된 자연도 특성을 (i) 공개된 파지 데이터 및 (ii) 치료 항체 프로파일러(Therapeutic Antibody Profiler) 중 하나 또는 둘 모두와 비교하게 하는, 추가의 명령어가 저장되는, 컴퓨팅 시스템. 38. 양태 36 또는 37 중 어느 하나에 있어서, 비일시적 컴퓨터 판독가능 매체에는, 하나 이상의 프로세서에 의 해 실행될 때, 컴퓨팅 시스템으로 하여금: CDR 단독 모델을 사용하여 I상, II상, III상, 또는 임상 단계에서 인 간에게 투여된 치료 항체의 공개된 자연도와 하나 이상의 입력 생체분자 서열 변이체 각각에 대한 각각의 예측 된 자연도 특성을 비교함으로써 기원-정렬 데이터를 생성하게 하고; 환자에서 완전한 인간 항체에 대한 항-약물 항체 반응이 발생되었는지의 여부에 따라 상기 기원-정렬 데이터를 분할함으로써 면역원성 점수를 결정하게 하 는 추가의 명령어가 저장되는, 컴퓨팅 시스템. 39. 양태 36 내지 양태 38 중 어느 하나에 있어서, 비일시적 컴퓨터 판독가능 매체에는, 하나 이상의 프로세서 에 의해 실행될 때, 컴퓨팅 시스템으로 하여금 서열 변이체의 자연도를 CDRH3 돌연변이 부하의 함수로서 채점하 게 하는 추가의 명령어가 저장되는, 컴퓨팅 시스템. 40. 양태 36 내지 양태 39 중 어느 하나에 있어서, 비일시적 컴퓨터 판독가능 매체에는, 하나 이상의 프로세서 에 의해 실행될 때, 컴퓨팅 시스템으로 하여금 트라스투주맙의 자연도를 채점하게 하는 추가의 명령어가 저장되 는, 컴퓨팅 시스템. 41. 양태 36 내지 40 중 어느 하나에 있어서, 비일시적 컴퓨터 판독가능 매체에는, 하나 이상의 프로세서에 의 해 실행될 때, 컴퓨팅 시스템으로 하여금: 서열 공간에서의 가능한 모든 서열 변이체의 친화도에 대한 완전 예 측을 회피하기 위해 생성 기술을 사용하여, 하나 이상의 예측된 결합 특성을 생성하기 위해 머신 러닝된 모델로 하나 이상의 생체분자 서열 변이체를 처리하게 하고, 하나 이상의 생체분자 서열 변이체 중 하나 이상의 관심 생체분자 서열 변이체를 식별하기 위해 하나 이상의 예측된 결합 특성을 분석하게 하는 추가의 명령어가 저장되 는, 컴퓨팅 시스템. 42. 양태 36 내지 41 중 어느 하나의 양태에 있어서, 비일시적 컴퓨터 판독가능 매체에는, 하나 이상의 프로세 서에 의해 실행될 때, 컴퓨팅 시스템으로 하여금: 하나 이상의 생체분자 서열 변이체의 각각의 예측된 자연도에 기초하여 하나 이상의 예측된 결합 특성을 생성하기 위해 머신 러닝된 모델로 하나 이상의 생체분자 서열 변이 체를 처리하게 하는 추가의 명령어가 저장되는, 컴퓨팅 시스템. 43. 양태 36 내지 42 중 어느 하나에 있어서, 비일시적 컴퓨터 판독가능 매체에는, 하나 이상의 프로세서에 의 해 실행될 때, 컴퓨팅 시스템으로 하여금: 친화도를 최소화하고 자연도를 최대화함으로써 서열 변이체 중에서 하나 이상의 관심 생체분자 서열 변이체를 식별하기 위해 하나 이상의 예측된 결합 특징을 분석하게 하는 추가의 명령어가 저장되는, 컴퓨팅 시스템. 44. 양태 36 내지 43 중 어느 하나에 있어서, 비일시적 컴퓨터 판독가능 매체에는, 하나 이상의 프로세서에 의 해 실행될 때, 컴퓨팅 시스템으로 하여금: 하나 이상의 생체분자 서열 변이체의 친화도를 최대화하고 하나 이상 의 생체분자 서열 변이체의 자연도를 최소화함으로써 서열 변이체 중에서 하나 이상의 관심 생체분자 서열 변이 체를 식별하기 위해 하나 이상의 예측된 결합 특징을 분석하게 하는 추가의 명령어가 저장되는, 컴퓨팅 시스템."}
{"patent_id": "10-2024-7026560", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일부 양태에 따른, 본 발명의 기술을 수행하기 위한 예시적인 컴퓨팅 환경을 도시한다. 도 2는 일부 양태에 따른, 하나 이상의 머신 러닝된 모델이 하나 이상의 관심 생체분자 서열 변이체를 식별하도 록 이를 학습시키기 위한 예시적인 컴퓨터 구현 방법을 도시한다. 도 3a는 일부 양태에 따른, 학습된 머신 러닝 모델이 하나 이상의 관심 생체분자 서열 변이체를 식별하도록 이 를 구동시키는 컴퓨터 구현 방법을 도시한다. 도 3b는 일부 양태에 따른, 머신 러닝 모델이 관심 생체분자 서열 변이체를 식별하도록 이를 학습시키는 컴퓨터 구현 방법을 도시한다. 도 4a는 일부 양태에 따른, 도 2에 상응할 수 있는, 관심 생체분자 서열 변이체의 학습 및 예측을 도시하는 예 시적인 데이터 흐름도를 도시한다. 도 4b는 일부 양태에 따른, 도 4a의 검정을 수행하기 위한 예시적인 블록 흐름도를 도시한다. 고유 항체 서열 변이체를 발현하는 균주를 첨가하여 세포를 고정하고 투과화시킬 수 있고, 프로브를 첨가할 수 있다. 도 4c는 일부 양태에 따른, 예시적인 친화도 예측 차트를 도시한다. 도 4d는 일부 양태에 따른, 예시적인 친화도 예측 검정 차트를 도시한다. 도 4e는 일부 양태에 따른, 노이즈가 제거된 예시적인 데이터 차트를 도시한다. 도 4f는 일부 양태에 따른, 자연도 학습 및 예측을 도시한 예시적인 개념도를 도시한다. 도 4g는 일부 양태에 따른 예시적인 자연도 점수 검증 차트를 도시한다. 도 4h는 일부 양태에 따른 예시적인 자연도/개발가능성 상관 차트를 도시한다. 도 4i는 일부 양태에 따른 예시적인 자연도 및 면역원성 상관 차트를 도시한다. 도 4j는 일부 양태에 따른 예시적인 자연도 및 돌연변이 부하 상관 차트를 도시한다. 도 4k는 일부 양태에 따라, 자연도 데이터로 농축한 경우의 친화도 예측 개선의 예시적인 차트를 도시한다. 도 4l은 일부 양태에 따른 가상 환경에서의 서열 변이체 생성 및 최적화의 예시적인 개념도를 도시한다. 도 4m은 일부 양태에 따라 트라스트주맙으로부터 친화도를 예측하는 예시적인 차트를 도시한다. 도 4n은 일부 양태에 따라 상이한 부모 항체로부터 친화도를 예측하는 예시적인 차트를 도시한다. 도 4o는 일부 양태에 따라 친화도 및 자연도를 최적화하는 것을 예시적으로 시각화하여 도시한다. 도 4p는 결합 친화도 측정치의 비교를 포함하여, 일부 양태에 따른 또 다른 예시적인 친화도 예측 차트를 도시한다. 도 4q는 SPR에 의해 이루어진 결합 친화도 측정치와 모델 예측치의 비교를 포함하여, 일부 양태에 따라 야생형 트라스투주맙보다 친화도가 더 큰 모든 포인트들을 홀드아웃하면서 SPR 데이터를 이용해 학습시킨 예시적인 친 화도 예측 차트를 도시한다. 도 5는 일부 양태에 따른 예시적인 AI-증강된 항체 최적화 다이어그램을 도시한다. 도 6a는 일부 양태에 따른 예시적인 워크플로 개념 증명 다이어그램을 도시한다. 도 6b는 10% 홀드아웃 데이터 세트를 이용해 평가한 trast-1의 90% 변이체의 qaACE 점수를 이용해 일부 양태에 따라 학습시킨 모델의 예측 성능을 도시한다. 도 6c는 복제물 qaACE 측정치와 일부 양태에 따라 개별 qaACE 복제물을 이용해 학습시킨 모델로부터 예측한 qaACE 점수의 비교 분석을 도시한다. 도 6d는 일부 양태에 따라 2개의 복제물 FACS 분류에 의해 측정한 ACE 점수의 비교를 도시한다. 도 6e는 2개의 복제물 FACS 분류 중 하나에 의해 측정한 ACE 점수와 일부 양태에 따라 2개의 복제물 중 하나 데 이터로만 학습시킨 모델에 의해 예측된 ACE 점수의 전체-대-전체 비교를 도시한다. 도 6f는 일부 양태에 따른, qaACE 친화도 점수와 로그 변환된 SPR KD 측정치 사이의 상관관계를 도시한다. 도 6g는 일부 양태에 따라, 결합 친화도에 대해 균일하게 분포된 홀드아웃 세트에 대한 예측 성능을 도시한다. 도 7a는 일부 양태에 따라 SPR 측정된 - log10 KD 값을 이용해 학습된 모델로부터의 예측을 도시한다. 도 7b는 복제물 - log 10 KD 측정치와 일부 양태에 따라 개별 SPR 복제물을 이용해 학습된 모델로부터 예측된 - log10 KD의 비교 분석을 도시한다. 도 7c는 일부 양태에 따라 log10 kon 값을 이용해 학습된 모델로부터의 예측을 도시한다. 도 7d는 일부 양태에 따라 - log10 koff 값을 이용해 학습된 모델로부터의 예측을 도시한다. 도 7e는 일부 양태에 따라 2개의 SPR 실험에 의해 측정된 -log10KD 값의 비교를 도시한다. 도 7f는 2개의 복제물 SPR 실험 중 하나에 의해 측정된 -log10KD 값과 일부 양태에 따라 2개의 복제물 중 하나의 데이터로만 학습된 모델에 의해 예측된 -log10KD 값의 전체-대-전체 비교를 도시한다. 도 7g는 일부 양태에 따라 SPR 학습 데이터를 단독으로 사용하거나 ACE 측정치에 의해 보충된 SPR 학습 데이터 를 사용해 -log10KD를 예측하는 것을 도시한다. 도 7h는 일부 양태에 따라 2개의 SPR 실험에 의해 측정된 log10kon 값의 비교를 도시한다. 도 7i는 복제물 log10kon 측정치와 일부 양태에 따라 개별 SPR 복제물을 이용해 학습된 모델로부터 예측된 log10kon의 비교 분석을 도시한다. 도 7j는 2개의 복제물 SPR 실험 중 하나에 의해 측정된 log10kon 값과 일부 양태에 따라 2개의 복제물 중 하나의 데이터로만 학습된 모델에 의해 예측된 log10kon 값의 전체-대-전체 비교를 도시한다. 도 7k는 일부 양태에 따라 2개의 SPR 실험에 의해 측정된 -log10koff 값의 비교를 도시한다. 도 7l은 복제물 -log10koff 측정치와 일부 양태에 따라 개별 SPR 복제물을 이용해 학습된 모델로부터 예측된 -log10koff의 비교 분석을 도시한다. 도 7m은 2개의 복제물 SPR 실험 중 하나에 의해 측정된 -log10koff 값과 일부 양태에 따라 2개의 복제물 중 하나 의 데이터로만 학습된 모델에 의해 예측된 -log10koff값의 전체-대-전체 비교를 도시한다.도 7n은 일부 양태에 따른, trast-1 데이터세트로부터 ACE 점수의 90:10 학습:홀드-아웃 분할을 도시한다. 도 7o는 일부 양태에 따른, trast-2 데이터세트로부터의 -log10KD 값과의 10배 교차 검증을 도시한다. 도 7p는 일부 양태에 따른, 사전 학습되지 않고 미세 조정되지 않은, 결합 친화도에 대한 무작위 모델 임베딩의 산포도를 도시한다. 도 7q는 일부 양태에 따른, 사전 학습되지 않고 trast-2 데이터세트를 사용하여 결합 친화도 데이터로 미세 조 정된, 결합 친화도에 대한 모델 임베딩의 산포도를 도시한다. 도 7r은 일부 양태에 따른, OAS-유래 서열을 사용하여 사전 학습되고 미세 조정되지 않은, 결합 친화도에 대한 모델 임베딩의 산포도를 도시한다. 도 7s는 일부 양태에 따른, OAS-유래 서열을 사용하여 사전 학습되고, trast-2 데이터세트를 사용하여 결합 친 화도 데이터로 미세 조정된, 결합 친화도에 대한 모델 임베딩의 산포도를 도시한다. 도 8a는 일부 양태에 따른, KD의 약 100배의 크기를 망라하도록 설계된 50개 서열(세트 A)에 대한 예측된(설계) 결합 친화도 및 측정된(검증) 결합 친화도의 밀도도(density plot)를 도시한다. 도 8b는 일부 양태에 따른, 부모 트라스투주맙보다는 더 긴밀하게 HER2에 결합하도록 설계된 50개 서열(세트 B)에 대한 예측된(설계) 결합 친화도 및 측정된(검증) 결합 친화도의 밀도도를 도시한다. 도 8c는 일부 양태에 따른, 설계 세트 B로부터 50개의 서열의 측정된 (검증) 결합 친화도의 경험적 분포 함수 (ECDF)를 도시하며, 여기에서 실선은 일부 양태에 따라 측정된 트라스투주맙의 -log10 KD(또는 -0.1 또는 -0.5 로그만큼의 편차)를 나타낸다. 도 8d는 일부 양태에 따른, 도 8b에서와 같이 전체 trast-2 데이터시트로 학습시킨 모델에 의해 예측했을 때(설 계, 원래 예측), 또는 부모 트라스투주맙(학습, KD-캡핑됨)보다 더 강하게 결합하는 모든 변이체가 고갈된 trast-2 데이터세트 버전을 이용해 학습시킨 모델에 의해 재예측했을 때(설계, KD-캡핑된 학습을 통한 예측), 세트 B의 결합 친화도의 밀도도를 도시한다. 도 8e는 일부 양태에 따른, 예측된(설계) 및 측정된(검증된) -log10KD 값의 산포도를 도시하며, 여기에서 데이터 는 도 8a의 설계 세트 A를 참조한다. 도 8f는 일부 양태에 따른, 개별 SPR 복제물에서 측정(검증된) -log10KD 값의 산포도를 도시하며, 여기에서 데이 터는 도 8a의 설계 세트 A를 참조한다. 도 8g는 일부 양태에 따른, 예측된(설계) 및 측정된(검증된) -log10KD 값의 산포도를 도시한 것으로서, 여기에서 데이터는 도 8b~8d의 설계 세트 B를 참조한다. 도 8h는 일부 양태에 따른 개별 SPR 복제물에서 측정된(검증된) -log10KD 값의 산포도를 도시한 것으로서, 여기 에서 데이터는 도 8b~8d의 설계 세트 B를 참조한다. 도 8i는 일부 양태에 따른, 원하는 결합 특성을 갖는 변이체에 대한 모델 예측 차트를 미노출 라이브러리 스크 리닝과 비교하여 도시한다. 도 9a는 일부 양태에 따라, ACE를 사용하여 20개(CDRH2에서 10개, CDRH3에서 10개)의 위치에서 모든 삼중 돌연 변이체를 대상으로 스크리닝한, trast-3 데이터세트의 조합 돌연변이 유발 전략의 예시를 도시한 것이다. 도 9b는 일부 양태에 따른, 20%의 데이터가 홀드아웃 세트에 있는, trast-3 데이터세트를 이용해 학습시킨 모델 의 예측 성능을 도시한다. 도 9c는 일부 양태에 따른, 학습 세트에서 관찰된 것보다 더 높은 돌연변이 부하에 예측을 외삽함으로써, 최대 삼중 돌연변이체를 이용해 학습시킨 모델을 최대 삼중 돌연변이체의 홀드아웃 세트에 검정하고, 사중 돌연변이 체 및 오중 돌연변이체의 홀드아웃 세트에 대해 검정한 것을 도시한다. 도 9d는 일부 양태에 따른, 상이한 학습 세트 크기에 걸쳐 공통 홀드-아웃 검증 세트에 대한 모델 정확도를 보 여주는 선 도표를 도시한 것으로서, 여기에서 (i) 음영 영역은 모든 배수에 대한 표준 편차를 나타내고; (ii) 각각의 학습 서브세트 크기별로, OAS-사전 학습된 모델 및 무작위로 초기화된 모델 각각의 성능이 도시되어 있고, 이들 각각은 고충실도 trast-3 데이터세트 또는 저충실도 버전의 데이터세트의 서브세트를 사용해 학습되었 으며; (iii) 각각의 서브세트 크기 아래에는 사용된 학습 데이터의 분획, 학습 데이터세트의 크기, 및 학습 서 브세트에 의해 덮인 완전한 돌연변이 공간의 백분율에 대한 표시가 포함되어 있다. 도 9e는 일부 양태에 따른, 무작위화된 ACE 점수(trast-3 데이터세트)를 이용한 모델링의 성능을 도시한다. 도 9f는 일부 양태에 따라, 사중 돌연변이체(trast-3 데이터세트)에 대한 더 높은 돌연변이 부하에 예측을 외삽 한 것을 도시한다. 도 9g는 일부 양태에 따라, 오중 돌연변이체(trast-3 데이터세트)에 대한 더 높은 돌연변이 부하에 예측을 외삽 한 것을 도시한다. 도 9h는 일부 양태에 따른, 트라스투주맙의 모든 가능한 단일 돌연변이체에 걸쳐 각각의 개별 치환이 이루어진 후, trast-3 데이터세트를 이용해 학습된 모델의 예측된 결합 친화도에 개별 돌연변이가 미치는 효과가 다른 돌 연변이의 존재에 따라 증분 효과 범위별로(최소 내지 최대) 크게 달라질 수 있음을 도시한 도표를 도시한다. 도 9i는 일부 양태에 따른, 트라스투주맙의 모든 가능한 이중 돌연변이체에 걸쳐 각각의 개별 치환이 이루어진 후, trast-3 데이터세트를 이용해 학습된 모델의 예측된 결합 친화도에 개별 돌연변이가 미치는 효과가 다른 돌 연변이의 존재에 따라 증분 효과 범위별로(최소 내지 최대) 크게 달라질 수 있음을 도시한 도표를 도시한다. 도 9j는 일부 양태에 따른, 트라스투주맙의 고친화도 변이체의 조성을 도시한 서열 로고 도표를 도시한다. 도 9k는 일부 양태에 따른, 모든 가능한 치환 쌍에 걸쳐 상위성 효과(epistatic effects)를 도시한 히트맵을 도 시한다. 도 10a는 일부 양태에 따른, trast-3 데이터세트를 이용해 학습시킨 모델의 단일 돌연변이체에 대한 예측된 결 합 친화도를 도시한 것으로서, 여기에서 (i) 돌연변이를 보유한 위치는 CDRH2(R55로 시작하는 10개의 위치) 및 CDRH3(W107로 시작하는 10개의 위치)을 포함하고; (ii) 기준 트라스투주맙 서열은 X 표시로 강조되어 있으며; (iii) 각각의 위치에 있는 돌연변이는, 시스테인을 제외하고 알파벳 순으로 분류된(즉, X ∈ [A, D, E, F, G, H, I, K, L, M, N, P, Q, R, S, T, V, W, Y]) 천연 아미노산과의 모든 가능한 치환을 포함한다. 도 10b는 일부 양태에 따른, trast-3 데이터세트를 이용해 학습시킨 모델의 이중 돌연변이체에 대한 예측된 결 합 친화도를 도시한 것으로서, 여기에서 (i) 돌연변이를 보유한 위치는 CDRH2(R55로 시작하는 10개의 위치) 및 CDRH3(W107로 시작하는 10개의 위치)을 포함하고; (ii) 기준 트라스투주맙 서열은 X 표시로 강조되어 있으며; (iii) 각각의 위치에 있는 돌연변이는, 시스테인을 제외하고 알파벳 순으로 분류된(즉, X ∈ [A, D, E, F, G, H, I, K, L, M, N, P, Q, R, S, T, V, W, Y]) 천연 아미노산과의 모든 가능한 치환을 포함한다. 도 10c는 일부 양태에 따른, CR 9114 데이터세트의 10%로 학습시킨 모델의 회귀 성능을 도시한다. 도 10d는 일부 양태에 따른, CR 9114 데이터세트의 1%로 학습시킨 모델의 회귀 성능을 도시한다. 도 10e는 일부 양태에 따른, CR 9114 데이터세트의 0.1%로 학습시킨 모델의 회귀 성능을 도시한다. 도 10f는 일부 양태에 따른, CR 9114의 10%로 학습시킨 혼합 모델의 회귀 성능을 도시한다. 도 10g는 일부 양태에 따른, CR 9114의 1%로 학습시킨 혼합 모델의 회귀 성능을 도시한다. 도 10h는 일부 양태에 따른, CR 9114의 0.1%로 학습시킨 혼합 모델의 회귀 성능을 도시한다. 도 11a는 일부 양태에 따른, 주어진 종에 대한 조절된 항체 서열의 자연도의 계산을 위해 서열이 활용될 수 있 는 항체 레퍼토리로 사전 학습된 언어 모델을 도시하며, 여기에서 4개의 항체 특성과의 연관성에 대한 자연도 점수가 조사되었다. 도 11b는 일부 양태에 따른, Marks 등에 의해 보고된 인간화 임상 단계 항체[28](n=97)에 대한 항약물 항체 (Anti-Drug Antibody, ADA) 반응을 사용한 면역원성을 도시한다. 도 11c는 일부 양태에 따른, Gifford 라이브러리[29](n=882)로부터의 라운드 3-풍부화 파지 디스플레이 히트에 대한 치료 항체 프로파일러(Therapeutic Antibody Profiler, TAP)에 의해 예측된 바와 같은 개발가능성 실패를 도시한다. 도 11d는 일부 양태에 따른, Jain 등으로부터의 임상 단계 인간화 항체[30](n=67)의 HEK-293 세포(mg/L)에서의 발현 수준을 도시한다.도 11e는 일부 양태에 따른, 돌연변이 부하에 의해 분할된 6,710,401개의 트라스투주맙 변이체에 대한 자연도 밀도 플롯을 도시하며, 여기에서 파선은 부모 트라스투주맙 서열의 자연도에 해당한다. 도 11f는 일부 양태에 따른, 자연도와 항체 면역원성 간의 상관관계를 도시한다. 도 11g는 일부 양태에 따른, 도 11b의 면역원성 분석에 사용된 임상 단계 인간화 항체의 자연도 점수를 도시한 다. 도 11h는 일부 양태에 따른, 도 11c에서와 같은 치료 항체 프로파일러(TAP)를 사용한 개발가능성 분석에 사용된 Gifford 라이브러리(n=882)로부터의 라운드 3-풍부화 파지 디스플레이 히트의 자연도 점수를 도시한다. 도 11i는 일부 양태에 따른, 도 11h에서와 같은 TAP를 사용한 개발가능성 분석에 사용된, trast-3 데이터세트가 샘플링된 조합 공간(n=6710401)으로부터의 트라스투주맙 삼중 돌연변이체의 자연도 점수를 도시한다. 도 11j는 일부 양태에 따른, 도 11d에서와 같은 HEK-293 발현 역가 분석에 사용된 임상 단계 인간화 항체의 자 연도 점수를 도시한다. 도 11k는 일부 양태에 따른, 도 11i 및 trast-3 데이터세트가 샘플링된 조합 공간(n=6710401)으로부터의 트라스 투주맙 삼중 돌연변이체에 대한 TAP-예측 개발가능성 실패에 해당하는 자연도 점수를 도시하며, 여기에서 P-값 은 이진 데이터에 대한 Jonckheere-Terpstra 추세 테스트를 사용하여 계산될 수 있다. 도 11l은 일부 양태에 따른, 완전한 트래스트-3 검색 공간의 밀도 맵을 도시한다. 도 11m은 일부 양태에 따른, 트라스투주맙보다 높은 예측된 ACE 점수를 갖는 변이체의 밀도 맵을 도시한다. 도 12a는 일부 양태에 따른, 각각의 선이 진화 궤적에 걸쳐 관찰된 최상의 100개 서열의 평균 예측 qaACE 점수 를 추적하는 다이어그램을 도시하며, 여기에서 음영 영역은 표준 편차를 나타낸다. 도 12b는 일부 양태에 따른, 진화 궤적에 걸쳐 관찰된 최상의 100개 서열의 평균 자연도의 다이어그램을 도시하 며, 여기에서 음영 영역은 표준 편차를 나타낸다. 도 12c는 일부 양태에 따른, 다음과 같은 3개의 검색 전략을 통해 결정된 최상의 100개 서열의 qaACE 및 자연도 점수의 다이어그램을 도시한다: 유전적 알고리즘(Genetic Algorithm), 완전 검색(Exhaustive Search), 및 무작 위 검색(Random Search); 여기에서 파선은 트라스투주맙에 대해 예측된 점수를 나타내고; 자주색 파선은 전체 조합 공간에 걸쳐 예측된 최대 점수를 나타낸다. 도 12d는 일부 양태에 따른, 진화 궤적을 따라 관찰된 상위 100개 서열 각각이 식별된 제1 생성을 나타내는 히 스토그램을 도시한다. 도 13a는 일부 양태에 따른, 모든 ACE 분류에 대한 대표적인 부모 게이팅을 도시한다. 도 13b는 일부 양태에 따른, 각각의 ACE 라이브러리 분류에 대한 특이적 표현 및 수집 게이팅을 도시한다. 도 14는 일부 양태에 따른, 각각의 전처리 단계 후에 필터링 제외되고 유지되는 서열의 수를 나타내는 흐름도 를 도시한다. 도 15a는 일부 양태에 따른, 파일럿 데이터 세트에 대해 수행된 하이퍼파라미터 값에 대한 그리드 검색의 출력 을 도시한다. 도 15b는 무작위로 선택된 500개의 서열을 포함하는 도 15a의 파일럿 데이터세트의 서브세트에 대해 수행된 하 이퍼파라미터 값에 대한 그리드 검색의 출력을 도시한다. 도 16은 일부 양태에 따른, 상이한 ACE:SPR 손실 비율을 갖는 ACE + SPR 데이터에 대해 학습된 모델의 성능을 도시하는 차트를 도시한다. 도 17은 일부 양태에 따른, 파일럿 데이터세트 상의 XGBoost 베이스라인에 대한 하이퍼파라미터 최적화의 그래 프를 도시한다. 도 18a는 일부 양태에 따른, 상이한 서열 군에 대한 자연도 분포의 밀도 플롯을 도시한다. 도 18b는 일부 양태에 따른, 서열 공간 사이의 관계의 다이어그램을 도시한다."}
