{"patent_id": "10-2019-0176810", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0083971", "출원번호": "10-2019-0176810", "발명의 명칭": "이미지 추출 방법 및 이를 수행하는 장치들", "출원인": "건국대학교 산학협력단", "발명자": "윤경로"}}
{"patent_id": "10-2019-0176810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "이미지 검색어를 통해 획득된 복수의 이미지들을 획득하는 단계;상기 복수의 이미지들 중에서 상기 이미지 검색어를 대표하는 대표 이미지를 결정하는 단계;상기 대표 이미지의 1차원 특징 벡터와 상기 복수의 이미지들 중에서 상기 대표 이미지를 제외한 나머지 이미지들의 1차원 특징 벡터를 추출하는 단계; 및상기 대표 이미지의 1차원 특징 벡터 및 상기 나머지 이미지들의 1차원 특징 벡터 간의 유사도에 기초하여 상기나머지 이미지들을 필터링하는 단계를 포함하는 이미지 추출 방법."}
{"patent_id": "10-2019-0176810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 결정하는 단계는,상기 복수의 이미지들 중에서 상기 이미지 검색어를 통해 첫번째로 검색된 이미지를 상기 대표 이미지로 결정하는 단계를 포함하는 이미지 추출 방법."}
{"patent_id": "10-2019-0176810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 추출하는 단계는,상기 대표 이미지의 2차원 특징맵 및 상기 나머지 이미지들 각각의 2차원 특징맵을 추출하는 단계; 및상기 대표 이미지의 2차원 특징맵 및 상기 나머지 이미지들 각각의 2차원 특징맵을 평탄화하여 1차원 특징 벡터로 변환하는 단계를 포함하는 이미지 추출 방법."}
{"patent_id": "10-2019-0176810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 2차원 특징맵을 추출하는 단계는,인공 신경망에 상기 대표 이미지 및 상기 나머지 이미지들을 입력하는 단계; 및상기 인공 신경망의 마지막 콘볼류션 레이어로부터 출력되는 상기 대표 이미지의 2차원 특징맵 및 상기 나머지이미지들 각각의 2차원 특징맵을 획득하는 단계를 포함하는 이미지 추출 방법."}
{"patent_id": "10-2019-0176810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2021-0083971-3-제3항에 있어서,상기 변환하는 단계는,global average pooling을 이용하여 상기 대표 이미지의 2차원 특징맵 및 상기 나머지 이미지들 각각의 2차원특징맵을 1차원 특징 벡터로 평탄화하는 단계를 포함하는 이미지 추출 방법."}
{"patent_id": "10-2019-0176810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제3항에 있어서,상기 변환하는 단계는,global max pooling을 이용하여 상기 대표 이미지의 2차원 특징맵 및 상기 나머지 이미지들 각각의 2차원 특징맵을 1차원 특징 벡터로 평탄화하는 단계를 포함하는 이미지 추출 방법."}
{"patent_id": "10-2019-0176810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 필터링하는 단계는,상기 대표 이미지의 1차원 특징 벡터와 상기 나머지 이미지들 각각의 1차원 특징 벡터 간의 코사인 유사도를 계산하는 단계; 및기준 유사도와 상기 코사인 유사도를 비교하여 상기 대표 이미지와 상기 나머지 이미지들 각각이 유사한지 여부를 판단함으로써 상기 나머지 이미지들을 필터링하는 단계를 포함하는 이미지 추출 방법."}
{"patent_id": "10-2019-0176810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,기준 유사도와 상기 코사인 유사도를 비교하여 상기 대표 이미지와 상기 나머지 이미지들 각각이 유사한지 여부를 판단함으로써 상기 나머지 이미지들을 필터링하는 단계는,상기 대표 이미지와 상기 나머지 이미지들 중에서 적어도 하나의 이미지 간의 코사인 유사도가 상기 기준 유사도 이상인 경우, 상기 적어도 하나의 이미지가 상기 대표 이미지와 유사하다고 판단하는 단계를 포함하는 이미지 추출 방법."}
{"patent_id": "10-2019-0176810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서,기준 유사도와 상기 코사인 유사도를 비교하여 상기 대표 이미지와 상기 나머지 이미지들 각각이 유사한지 여부를 판단함으로써 상기 나머지 이미지들을 필터링하는 단계는,상기 대표 이미지와 상기 나머지 이미지들 중에서 적어도 하나의 이미지 간의 코사인 유사도가 상기 기준 유사도 미만인 경우, 상기 적어도 하나의 이미지가 상기 대표 이미지와 유사하지 않다고 판단하는 단계공개특허 10-2021-0083971-4-를 포함하는 이미지 추출 방법."}
{"patent_id": "10-2019-0176810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제7항에 있어서,기준 유사도와 상기 코사인 유사도를 비교하여 상기 대표 이미지와 상기 나머지 이미지들 각각이 유사한지 여부를 판단함으로써 상기 나머지 이미지들을 필터링하는 단계는,상기 판단 결과에 기초하여 상기 나머지 이미지들 중에서 상기 대표 이미지와 유사하지 않은 비유사 이미지를삭제하는 단계를 포함하는 이미지 추출 방법."}
{"patent_id": "10-2019-0176810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "인스트럭션들을 포함하는 메모리; 및상기 인스트럭션들을 실행하기 위한 컨트롤러를 포함하고,상기 컨트롤러는,이미지 검색어를 통해 획득된 복수의 이미지들을 획득하고, 상기 복수의 이미지들 중에서 상기 이미지 검색어를대표하는 대표 이미지를 결정하고, 상기 대표 이미지의 1차원 특징 벡터와 상기 복수의 이미지들 중에서 상기대표 이미지를 제외한 나머지 이미지들의 1차원 특징 벡터를 추출하고, 상기 대표 이미지의 1차원 특징 벡터 및상기 나머지 이미지들의 1차원 특징 벡터 간의 유사도에 기초하여 상기 나머지 이미지들을 필터링하는 이미지추출 장치."}
{"patent_id": "10-2019-0176810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 컨트롤러는,상기 복수의 이미지들 중에서 상기 이미지 검색어를 통해 첫번째로 검색된 이미지를 상기 대표 이미지로 결정하는 이미지 추출 장치."}
{"patent_id": "10-2019-0176810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서,상기 컨트롤러는,상기 대표 이미지의 2차원 특징맵 및 상기 나머지 이미지들 각각의 2차원 특징맵을 추출하고, 상기 대표 이미지의 2차원 특징맵 및 상기 나머지 이미지들 각각의 2차원 특징맵을 평탄화하여 1차원 특징 벡터로 변환하는 이미지 추출 장치."}
{"patent_id": "10-2019-0176810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 컨트롤러는,공개특허 10-2021-0083971-5-인공 신경망에 상기 대표 이미지 및 상기 나머지 이미지들을 입력하고, 상기 인공 신경망의 마지막 콘볼류션 레이어로부터 출력되는 상기 대표 이미지의 2차원 특징맵 및 상기 나머지 이미지들 각각의 2차원 특징맵을 획득하는 이미지 추출 장치."}
{"patent_id": "10-2019-0176810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제13항에 있어서,상기 컨트롤러는,global average pooling을 이용하여 상기 대표 이미지의 2차원 특징맵 및 상기 나머지 이미지들 각각의 2차원특징맵을 1차원 특징 벡터로 평탄화하는 이미지 추출 장치."}
{"patent_id": "10-2019-0176810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제13항에 있어서,상기 컨트롤러는,global max pooling을 이용하여 상기 대표 이미지의 2차원 특징맵 및 상기 나머지 이미지들 각각의 2차원 특징맵을 1차원 특징 벡터로 평탄화하는 이미지 추출 장치."}
{"patent_id": "10-2019-0176810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제11항에 있어서,상기 컨트롤러는,상기 대표 이미지의 1차원 특징 벡터와 상기 나머지 이미지들 각각의 1차원 특징 벡터 간의 코사인 유사도를 계산하고, 기준 유사도와 상기 코사인 유사도를 비교하여 상기 대표 이미지와 상기 나머지 이미지들 각각이 유사한지 여부를 판단함으로써 상기 나머지 이미지들을 필터링하는 이미지 추출 장치."}
{"patent_id": "10-2019-0176810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서,상기 컨트롤러는,상기 대표 이미지와 상기 나머지 이미지들 중에서 적어도 하나의 이미지 간의 코사인 유사도가 상기 기준 유사도 이상인 경우, 상기 적어도 하나의 이미지가 상기 대표 이미지와 유사하다고 판단하는 이미지 추출 장치."}
{"patent_id": "10-2019-0176810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제17항에 있어서,상기 컨트롤러는,상기 대표 이미지와 상기 나머지 이미지들 중에서 적어도 하나의 이미지 간의 코사인 유사도가 상기 기준 유사도 미만인 경우, 상기 적어도 하나의 이미지가 상기 대표 이미지와 유사하지 않다고 판단하는 이미지 추출장치."}
{"patent_id": "10-2019-0176810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "공개특허 10-2021-0083971-6-제17항에 있어서,상기 컨트롤러는,상기 판단 결과에 기초하여 상기 나머지 이미지들 중에서 상기 대표 이미지와 유사하지 않은 비유사 이미지를삭제하는 이미지 추출 장치."}
{"patent_id": "10-2019-0176810", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "이미지 추출 방법 및 이를 수행하는 장치들이 개시된다. 일 실시예에 따른 이미지 추출 방법은 이미지 검색어를 통해 획득된 복수의 이미지들을 획득하는 단계와, 상기 복수의 이미지들 중에서 상기 이미지 검색어를 대표하는 대표 이미지를 결정하는 단계와, 상기 대표 이미지의 1차원 특징 벡터와 상기 복수의 이미지들 중에서 상기 대표 이미지를 제외한 나머지 이미지들의 1차원 특징 벡터를 추출하는 단계와, 상기 대표 이미지의 1차원 특징 벡터 및 상기 나머지 이미지들의 1차원 특징 벡터 간의 유사도에 기초하여 상기 나머지 이미지들을 필터링하는 단계를 포함한다."}
{"patent_id": "10-2019-0176810", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "아래 실시예들은 이미지 추출 방법 및 이를 수행하는 장치들에 관한 것이다."}
{"patent_id": "10-2019-0176810", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근에는 인공 지능 기술의 발전으로 인해 인공 지능 기술을 이용하여 다양한 딥러닝 기술의 연구가 활발히 이 루어지고 있다. 최근에는 인공 신경망인 합성곱 신경망(convolutional neural network; CNN)을 이용하여 이미지 분류 및 이미지 에 존재하는 객체를 판정하는 다양한 연구가 있다. 예를 들어, CNN은 입력 이미지에 대해 소정의 콘볼루션 필터를 적용하여 이미지의 특징 추출을 위한 특징맵의 생성 과정을 반복 수행할 수 있다. CNN은 특징맵 생성 과정을 기초로 전연결계층(fully connected layer)을 생 성한 후 분류기를 통해 입력 이미지를 분류 및 입력 이미지의 객체가 무엇인지 확률적으로 연산할 수 있다."}
{"patent_id": "10-2019-0176810", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "실시예들은 웹(또는 웹 사이트) 상에서 이미지 검색어를 통해 획득된 복수의 이미지들 중에서 이미지 검색어와 관련되지 않은 이미지를 필터링하여 이미지 검색어와 관련된 이미지만을 추출 및 제공하는 기술을 제공할 수 있 다."}
{"patent_id": "10-2019-0176810", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시예에 따른 이미지 추출 방법은 이미지 검색어를 통해 획득된 복수의 이미지들을 획득하는 단계와, 상기 복수의 이미지들 중에서 상기 이미지 검색어를 대표하는 대표 이미지를 결정하는 단계와, 상기 대표 이미지의 1 차원 특징 벡터와 상기 복수의 이미지들 중에서 상기 대표 이미지를 제외한 나머지 이미지들의 1차원 특징 벡터 를 추출하는 단계와, 상기 대표 이미지의 1차원 특징 벡터 및 상기 나머지 이미지들의 1차원 특징 벡터 간의 유 사도에 기초하여 상기 나머지 이미지들을 필터링하는 단계를 포함한다. 상기 결정하는 단계는 상기 복수의 이미지들 중에서 상기 이미지 검색어를 통해 첫번째로 검색된 이미지를 상기 대표 이미지로 결정하는 단계를 포함할 수 있다. 상기 추출하는 단계는 상기 대표 이미지의 2차원 특징맵 및 상기 나머지 이미지들 각각의 2차원 특징맵을 추출 하는 단계와, 상기 대표 이미지의 2차원 특징맵 및 상기 나머지 이미지들 각각의 2차원 특징맵을 평탄화하여 1 차원 특징 벡터로 변환하는 단계를 포함할 수 있다. 상기 2차원 특징맵을 추출하는 단계는 인공 신경망에 상기 대표 이미지 및 상기 나머지 이미지들을 입력하는 단 계와, 상기 인공 신경망의 마지막 콘볼류션 레이어로부터 출력되는 상기 대표 이미지의 2차원 특징맵 및 상기 나머지 이미지들 각각의 2차원 특징맵을 획득하는 단계를 포함할 수 있다. 상기 변환하는 단계는 global average pooling을 이용하여 상기 대표 이미지의 2차원 특징맵 및 상기 나머지 이 미지들 각각의 2차원 특징맵을 1차원 특징 벡터로 평탄화하는 단계를 포함할 수 있다. 상기 변환하는 단계는 global max pooling을 이용하여 상기 대표 이미지의 2차원 특징맵 및 상기 나머지 이미지 들 각각의 2차원 특징맵을 1차원 특징 벡터로 평탄화하는 단계를 포함할 수 있다. 상기 필터링하는 단계는 상기 대표 이미지의 1차원 특징 벡터와 상기 나머지 이미지들 각각의 1차원 특징 벡터 간의 코사인 유사도를 계산하는 단계와, 기준 유사도와 상기 코사인 유사도를 비교하여 상기 대표 이미지와 상기 나머지 이미지들 각각이 유사한지 여부를 판단함으로써 상기 나머지 이미지들을 필터링하는 단계를 포함할 수 있다. 기준 유사도와 상기 코사인 유사도를 비교하여 상기 대표 이미지와 상기 나머지 이미지들 각각이 유사한지 여부 를 판단함으로써 상기 나머지 이미지들을 필터링하는 단계는 상기 대표 이미지와 상기 나머지 이미지들 중에서 적어도 하나의 이미지 간의 코사인 유사도가 상기 기준 유사도 이상인 경우, 상기 적어도 하나의 이미지가 상기 대표 이미지와 유사하다고 판단하는 단계를 포함할 수 있다. 기준 유사도와 상기 코사인 유사도를 비교하여 상기 대표 이미지와 상기 나머지 이미지들 각각이 유사한지 여부 를 판단함으로써 상기 나머지 이미지들을 필터링하는 단계는 상기 대표 이미지와 상기 나머지 이미지들 중에서 적어도 하나의 이미지 간의 코사인 유사도가 상기 기준 유사도 미만인 경우, 상기 적어도 하나의 이미지가 상기 대표 이미지와 유사하지 않다고 판단하는 단계를 포함할 수 있다. 기준 유사도와 상기 코사인 유사도를 비교하여 상기 대표 이미지와 상기 나머지 이미지들 각각이 유사한지 여부 를 판단함으로써 상기 나머지 이미지들을 필터링하는 단계는 상기 판단 결과에 기초하여 상기 나머지 이미지들 중에서 상기 대표 이미지와 유사하지 않은 비유사 이미지를 삭제하는 단계를 포함할 수 있다. 일 실시예에 따른 이미지 추출 장치는 인스트럭션들을 포함하는 메모리와, 상기 인스트럭션들을 실행하기 위한 컨트롤러를 포함하고, 상기 컨트롤러는 이미지 검색어를 통해 획득된 복수의 이미지들을 획득하고, 상기 복수의 이미지들 중에서 상기 이미지 검색어를 대표하는 대표 이미지를 결정하고, 상기 대표 이미지의 1차원 특징 벡터 와 상기 복수의 이미지들 중에서 상기 대표 이미지를 제외한 나머지 이미지들의 1차원 특징 벡터를 추출하고, 상기 대표 이미지의 1차원 특징 벡터 및 상기 나머지 이미지들의 1차원 특징 벡터 간의 유사도에 기초하여 상기 나머지 이미지들을 필터링할 수 있다. 상기 컨트롤러는 상기 복수의 이미지들 중에서 상기 이미지 검색어를 통해 첫번째로 검색된 이미지를 상기 대표 이미지로 결정할 수 있다. 상기 컨트롤러는 상기 대표 이미지의 2차원 특징맵 및 상기 나머지 이미지들 각각의 2차원 특징맵을 추출하고, 상기 대표 이미지의 2차원 특징맵 및 상기 나머지 이미지들 각각의 2차원 특징맵을 평탄화하여 1차원 특징 벡터 로 변환할 수 있다. 상기 컨트롤러는 인공 신경망에 상기 대표 이미지 및 상기 나머지 이미지들을 입력하고, 상기 인공 신경망의 마 지막 콘볼류션 레이어로부터 출력되는 상기 대표 이미지의 2차원 특징맵 및 상기 나머지 이미지들 각각의 2차원 특징맵을 획득할 수 있다. 상기 컨트롤러는 global average pooling을 이용하여 상기 대표 이미지의 2차원 특징맵 및 상기 나머지 이미지 들 각각의 2차원 특징맵을 1차원 특징 벡터로 평탄화할 수 있다. 상기 컨트롤러는 global max pooling을 이용하여 상기 대표 이미지의 2차원 특징맵 및 상기 나머지 이미지들 각 각의 2차원 특징맵을 1차원 특징 벡터로 평탄화할 수 있다. 상기 컨트롤러는 상기 대표 이미지의 1차원 특징 벡터와 상기 나머지 이미지들 각각의 1차원 특징 벡터 간의 코 사인 유사도를 계산하고, 기준 유사도와 상기 코사인 유사도를 비교하여 상기 대표 이미지와 상기 나머지 이미 지들 각각이 유사한지 여부를 판단함으로써 상기 나머지 이미지들을 필터링할 수 있다. 상기 컨트롤러는 상기 대표 이미지와 상기 나머지 이미지들 중에서 적어도 하나의 이미지 간의 코사인 유사도가 상기 기준 유사도 이상인 경우, 상기 적어도 하나의 이미지가 상기 대표 이미지와 유사하다고 판단할 수 있다. 상기 컨트롤러는 상기 대표 이미지와 상기 나머지 이미지들 중에서 적어도 하나의 이미지 간의 코사인 유사도가 상기 기준 유사도 미만인 경우, 상기 적어도 하나의 이미지가 상기 대표 이미지와 유사하지 않다고 판단할 수 있다. 상기 컨트롤러는 상기 판단 결과에 기초하여 상기 나머지 이미지들 중에서 상기 대표 이미지와 유사하지 않은 비유사 이미지를 삭제할 수 있다."}
{"patent_id": "10-2019-0176810", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서, 첨부된 도면을 참조하여 실시예들을 상세하게 설명한다. 그러나, 실시예들에는 다양한 변경이 가해 질 수 있어서 특허출원의 권리 범위가 이러한 실시예들에 의해 제한되거나 한정되는 것은 아니다. 실시예들에 대한 모든 변경, 균등물 내지 대체물이 권리 범위에 포함되는 것으로 이해되어야 한다. 실시예에서 사용한 용어는 단지 설명을 목적으로 사용된 것으로, 한정하려는 의도로 해석되어서는 안된다. 단 수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 명세서에서, \"포함하다\" 또 는 \"가지다\" 등의 용어는 명세서 상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것 이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 제1 또는 제2등의 용어를 다양한 구성요소들을 설명하는데 사용될 수 있지만, 구성요소들은 용어들에 의해서 한 정되어서는 안 된다. 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만, 예를 들어 실시 예의 개념에 따른 권리 범위로부터 이탈되지 않은 채, 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하 게 제2 구성요소는 제1 구성요소로도 명명될 수 있다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 실시예가 속 하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일 반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥 상 가지는 의미와 일치하는 의 미를 가지는 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적 인 의미로 해석되지 않는다. 또한, 첨부 도면을 참조하여 설명함에 있어, 도면 부호에 관계없이 동일한 구성 요소는 동일한 참조부호를 부여 하고 이에 대한 중복되는 설명은 생략하기로 한다. 실시예를 설명함에 있어서 관련된 공지 기술에 대한 구체적 인 설명이 실시예의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 도 1은 일 실시예에 따른 이미지 추출 시스템의 개략적인 블록도를 나타낸다. 이미지 추출 시스템은 이미지 수집 장치 및 이미지 추출 장치를 포함한다. 이미지 수집 장치는 이미지를 검색하기 위한 이미지 검색어를 통해 복수의 이미지들을 검색하여 검색된 복 수의 이미지들을 수집할 수 있다. 예를 들어, 이미지 수집 장치는 웹에서 이미지 검색어에 대응하는 복수 의 이미지들을 검색할 수 있다. 이미지 수집 장치는 수집된 복수의 이미지들을 이미지 추출 장치에 제공할 수 있다. 이미지 추출 장치는 웹(또는 웹 사이트) 상에서 이미지 검색어를 통해 획득된 복수의 이미지들 중에서 이 미지 검색어와 관련되지 않은 이미지를 필터링하여 이미지 검색어와 관련된 이미지만을 추출 및 제공할 수 있다. 이에, 이미지 추출 장치는 이미지 검색어와 관련되지 않은 비유사 이미지를 가려내기 위한 노동(또는 인력) 및 시간을 소비하지 않아 비유사 이미지를 가려내기 위한 노동 및 시간이 절약될 수 있다. 도 1에 도시된 바와 같이 이미지 수집 장치와 이미지 추출 장치가 서로 구별되게 도시되었지만, 이에 한정하는 것은 아니다. 예를 들어, 이미지 수집 장치는 이미지 추출 장치 내에 구현되거나 이미지 추출 장치는 이미지 수집 장치 내에 구현될 수 있다.도 2는 도 1에 도시된 이미지 추출 장치의 개략적인 블록도를 나타낸다. 이미지 추출 장치는 메모리 및 컨트롤러를 포함한다. 메모리는 컨트롤러에 의해 실행가능한 인스트럭션들(또는 프로그램)을 저장할 수 있다. 예를 들어, 인스트럭션들은 컨트롤러의 동작 및/또는 컨트롤러의 각 구성의 동작을 실행하기 위한 인스트럭션들 을 포함할 수 있다. 컨트롤러는 메모리에 저장된 데이터를 처리할 수 있다. 컨트롤러는 메모리에 저장된 컴퓨 터로 읽을 수 있는 코드(예를 들어, 소프트웨어) 및 컨트롤러에 의해 유발된 인스트럭션(instruction)들을 실행할 수 있다. 컨트롤러는 목적하는 동작들(desired operations)을 실행시키기 위한 물리적인 구조를 갖는 회로를 가지는 하드웨어로 구현된 데이터 처리 장치일 수 있다. 예를 들어, 목적하는 동작들은 프로그램에 포함된 코드(code) 또는 인스트럭션들(instructions)을 포함할 수 있다. 예를 들어, 하드웨어로 구현된 데이터 처리 장치는 마이크로프로세서(microprocessor), 중앙 처리 장치(central processing unit), 프로세서 코어(processor core), 멀티-코어 프로세서(multi-core processor), 멀티프로세서 (multiprocessor), ASIC(Application-Specific Integrated Circuit), FPGA(Field Programmable Gate Array)를 포함할 수 있다. 컨트롤러는 이미지 추출 장치의 전반적인 동작을 제어할 수 있다. 예를 들어, 컨트롤러는 메모 리의 동작을 제어할 수 있다. 컨트롤러는 이미지 수집 장치로부터 전송된 복수의 이미지들을 획득할 수 있다. 이때, 복수의 이미 지들은 이미지 검색어를 통해 검색된 이미지일 수 있다. 컨트롤러는 복수의 이미지들 중에서 이미지 검색어를 대표하는 대표 이미지를 결정할 수 있다. 컨트롤러는 대표 이미지의 1차원 특징 벡터와 복수의 이미지들 중에서 대표 이미지를 제외한 나머지 이미 지들의 1차원 특징 벡터를 추출할 수 있다. 컨트롤러는 대표 이미지의 1차원 특징 벡터와 나머지 이미지들의 1차원 특징 벡터 간의 유사도에 기초하여 나머지 이미지들을 필터링함으로써, 대표 이미지와 유사한 유사 이미지를 추출 및 제공할 수 있다. 도 3은 도 1에 도시된 이미지 추출 시스템을 설명하기 위한 일 예를 나타내고, 도 4a는 도 1에 도시된 이미지 추출 장치의 평탄화 동작을 설명하기 위한 일 예를 나타내고, 도 4b는 도 1에 도시된 이미지 추출 장치의 평탄 화 동작을 설명하기 위한 다른 예를 나타낸다. 이미지 수집 장치는 검색기 및 검색 이미지 저장소를 포함할 수 있다. 검색기는 이미지 검색어에 응답하여 웹에서 이미지 검색어에 대응하는 복수의 이미지들을 검색할 수 있다. 검색기는 검색된 복수의 이미지들을 이미지 검색어와 매칭하여 검색 이미지 저장소로 전송할 수 있다. 검색 이미지 저장소는 이미지 검색어와 복수의 이미지들을 매칭하여 저장할 수 있다. 검색 이미지 저장소 는 이미지 검색어와 복수의 이미지들을 이미지 추출 장치에 전송할 수 있다. 이미지 추출 장치의 컨트롤러는 결정기, 추출기, 평탕화기, 필터기 및 필터 이 미지 저장소를 포함할 수 있다. 도 3에 도시된 바와 같이 필터 이미지 저장소가 컨트롤러 내에 구현되었지만, 이에 한정하는 것은 아니다. 예를 들어, 필터 이미지 저장소는 이미지 추출 장치 내 에 컨트롤러와 구별되게 구현될 수 있다. 결정기는 검색 이미지 저장소로부터 전송된 이미지 검색어와 복수의 이미지들을 수신할 수 있다. 결정기는 수신된 복수의 이미지들 중에서 이미지 검색어를 통해 첫번째로 검색된 이미지를 이미지 검색어 를 대표하는 대표 이미지로 결정할 수 있다. 첫번째로 검색된 이미지는 이미지 검색어로 이미지를 검색했을 때 가장 많이 다운로드되고, 이미지 검색어를 대표할 수 있는 신뢰성 있는 이미지일 수 있다. 추출기는 결정기로부터 전송된 대표 이미지와 복수의 이미지들 중에서 대표 이미지를 제외한 나머지 이미지들을 수신할 수 있다. 추출기는 인공 신경망에 대표 이미지와 나머지 이미지들을 입력하여 인공 신경망의 마지막 콘볼류션 레이 어로부터 출력되는 대표 이미지의 2차원 특징맵 및 나머지 이미지들 각각의 2차원 특징맵을 추출(또는 획득)할 수 있다. 이때, 추출기는 computer vision에서 많이 사용되었던 SURF 및 SIFT 기술이 아닌 deep learning 모델 중에서 classification model의 마지막 convolutional layer를 이용할 수 있다. 평탄화기는 추출기로부터 전송된 대표 이미지의 2차원 특징맵 및 나머지 이미지들 각각의 2차원 특징 맵을 평탄화하여 1차원 특징 벡터로 변환할 수 있다. 예를 들어, 평탄화기는 global average pooling을 이용하여 대표 이미지의 2차원 특징맵 및 나머지 이미지들 각각의 2차원 특징맵을 1차원 특징 벡터로 평탄화할 수 있다. 평탄화기는 global max pooling을 이용하여 대표 이미지의 2차원 특징맵 및 나머지 이미지들 각 각의 2차원 특징맵을 1차원 특징 벡터로 평탄화할 수 있다. global average pooling을 이용하여 평탄화된 1차 원 특징 벡터는 도 4a와 같을 수 있다. global max pooling을 이용하여 평탄화된 1차원 특징 벡터는 도 4b와 같을 수 있다. 필터기는 코사인 유사도 측정 방법을 이용하여 평탄화기로부터 전송된 대표 이미지의 1차원 특징 벡 터와 나머지 이미지들 각각의 1차원 특징 벡터 간의 코사인 유사도를 계산할 수 있다. 이때, 코사인 유사도는 1차원으로 변환된 특징 벡터에 의해 0 내지 1 사이의 실수 값으로 계산될 수 있다. 필터기는 기준 유사도와 계산된 코사인 유사도를 비교하여 대표 이미지와 나머지 이미지들 각각이 유사한 지 여부를 판단함으로써 나머지 이미지들을 필터링할 수 있다. 기준 유사도는 이미지가 서로 유사한지 여부를 판단하기 위한 기준으로 0 내지 1 사이의 실수 값으로 기 설정될 수 있다. 대표 이미지와 나머지 이미지들 중에서 적어도 하나의 이미지 간의 코사인 유사도가 기준 유사도 이상인 경우, 필터기는 적어도 하나의 이미지가 대표 이미지와 유사하다고 판단할 수 있다. 대표 이미지와 나머지 이미지들 중에서 적어도 하나의 이미지 간의 코사인 유사도가 기준 유사도 미만인 경우, 필터기는 적어도 하나의 이미지가 대표 이미지와 유사하지 않다고 판단할 수 있다. 대표 이미지와 나머지 이미지들 중에서 적어도 하나의 이미지 간의 코사인 유사도가 1이고, 기준 유사도가 1인 경우, 필터기는 적어도 하나의 이미지가 대표 이미지와 동일하다고 판단할 수 있다. 필터기는 판단 결과에 기초하여 나머지 이미지들 중에서 대표 이미지와 유사하지 않은 비유사 이미지를 삭 제하고, 대표 이미지와 유사한 유사 이미지를 추출할 수 있다. 필터기는 대표 이미지와 유사한 유사 이미 지를 제공하고, 유사 이미지를 필터 이미지 저장소에 저장할 수 있다. 도 5는 도 1에 도시된 이미지 추출 장치의 동작을 설명하기 위한 순서도를 나타낸다. 컨트롤러는 이미지 검색어를 통해 검색된 복수의 이미지들을 획득할 수 있다. 컨트롤러는 복수의 이미지들 중에서 이미지 검색어를 통해 첫번째로 검색된 이미지를 이미지 검색어를 대 표하는 대표 이미지로 결정할 수 있다. 컨트롤러는 인공 신경망을 이용하여 대표 이미지의 2차원 특징맵과 나머지 이미지들의 2차원 특징맵을 추 출할 수 있다. 컨트롤러는 대표 이미지의 2차원 특징맵과 나머지 이미지들의 2차원 특징맵을 평탄화하여 1차원 특징 벡터 로 변환할 수 있다. 컨트롤러는 대표 이미지의 1차원 특징 벡터와 나머지 이미지들 각각의 1차원 특징 벡터 간의 코사인 유사 도를 계산할 수 있다. 컨트롤러는 기준 유사도와 각 코사인 유사도를 비교하여 대표 이미지와 나머지 이미지들 각각이 유사한지 여부를 판단할 수 있다. 컨트롤러는 판단 결과에 기초하여 나머지 이미지들을 필터링하여 나머지 이미지들 중에서 대표 이미지와 유사한 유사 이미지를 추출하고, 대표 이미지와 유사하지 않은 비유사 이미지를 삭제할 수 있다.실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등 을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 실시예를 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판 독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체 (magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도 록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 상기된 하드웨어 장치는 실시예의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도 록 구성될 수 있으며, 그 역도 마찬가지이다. 소프트웨어는 컴퓨터 프로그램(computer program), 코드(code), 명령(instruction), 또는 이들 중 하나 이상의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결합적으로 (collectively) 처리 장치를 명령할 수 있다. 소프트웨어 및/또는 데이터는, 처리 장치에 의하여 해석되거나 처리 장치에 명령 또는 데이터를 제공하기 위하여, 어떤 유형의 기계, 구성요소(component), 물리적 장치, 가상 장치(virtual equipment), 컴퓨터 저장 매체 또는 장치, 또는 전송되는 신호 파(signal wave)에 영구적으로, 또는 일시적으로 구체화(embody)될 수 있다. 소프트웨어는 네트워크로 연결된 컴퓨터 시스템 상에 분산되어서, 분산된 방법으로 저장되거나 실행될 수도 있다. 소프트웨어 및 데이터는 하나 이상의 컴퓨터 판독 가능 기록 매 체에 저장될 수 있다."}
{"patent_id": "10-2019-0176810", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이상과 같이 실시예들이 비록 한정된 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가진 자라면 상기를 기초로 다양한 기술적 수정 및 변형을 적용할 수 있다. 예를 들어, 설명된 기술들이 설명된 방법과 다 른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태 로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다. 그러므로, 다른 구현들, 다른 실시예들 및 특허청구범위와 균등한 것들도 후술하는 청구범위의 범위에 속한다."}
{"patent_id": "10-2019-0176810", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 따른 이미지 추출 시스템의 개략적인 블록도를 나타낸다. 도 2는 도 1에 도시된 이미지 추출 장치의 개략적인 블록도를 나타낸다. 도 3은 도 1에 도시된 이미지 추출 시스템을 설명하기 위한 일 예를 나타낸다. 도 4a는 도 1에 도시된 이미지 추출 장치의 평탄화 동작을 설명하기 위한 일 예를 나타낸다. 도 4b는 도 1에 도시된 이미지 추출 장치의 평탄화 동작을 설명하기 위한 다른 예를 나타낸다. 도 5는 도 1에 도시된 이미지 추출 장치의 동작을 설명하기 위한 순서도를 나타낸다."}
