{"patent_id": "10-2022-0128389", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0048723", "출원번호": "10-2022-0128389", "발명의 명칭": "다중 카메라 기반의 이동 로봇의 맵 이미지 및 물체 위치를 획득하기 위한 시스템 및 방법", "출원인": "주식회사 클로봇", "발명자": "황서연"}}
{"patent_id": "10-2022-0128389", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "일정한 촬영 각도의 촬상 영역을 촬영하도록 구성된 복수의 카메라들; 및상기 복수의 카메라들로부터 주변 영역에 대한 비전 이미지들을 입력받고, 상기 비전 이미지들을 기초로 물체의위치를 획득하도록 구성된 이동 로봇을 포함하고,상기 복수의 카메라들은,상기 이동 로봇에서 제1 모서리에 대응되는 제1 부분에 배치되는 제1 카메라 그룹;상기 이동 로봇에서 상기 제1 부분으로부터 제1 방향과 수직되는 제2 방향으로 이격된 제2 모서리에 대응되는제2 부분에 배치되는 제2 카메라 그룹;상기 이동 로봇에서 상기 제2 부분으로부터 상기 제1 방향으로 이격된 제3 모서리에 대응되는 제3 부분에 상기제1 카메라 그룹과 동일한 배치 형태로 배치되는 제3 카메라 그룹; 및상기 이동 로봇에서 상기 제1 부분으로부터 상기 제2 방향으로 이격된 제4 모서리에 대응되는 제4 부분에 상기제2 카메라 그룹과 동일한 배치 형태로 배치되는 제4 카메라 그룹을 포함하는 것을 특징으로 하는, 시스템."}
{"patent_id": "10-2022-0128389", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 복수의 카메라들의 개수는360도에서 상기 촬영 각도로 나눈 정수의 두배이고,상기 제1 카메라 그룹, 상기 제2 카메라 그룹, 상기 제3 카메라 그룹, 및 상기 제4 카메라 그룹 각각에 포함된카메라의 개수는, 상기 복수의 카메라들의 개수의 1/4인 것을 특징으로 하는, 시스템."}
{"patent_id": "10-2022-0128389", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서,상기 촬영 각도는, 90도(degree)이고,상기 복수의 카메라들의 개수는, 8개이고,상기 제1 카메라 그룹은,상기 제2 방향에 대하여 45도 각도로 배치된 제1 카메라, 및 상기 제1 카메라와 상기 제1 방향 및 상기 제2 방향 각각에 대하여 대칭되고 상기 제2 방향에 대하여 45도 각도로 배치된 제2 카메라를 포함하고, 상기 제2 카메라 그룹은,상기 제1 카메라와 상기 제1 방향에 대하여 대칭되고 상기 제2 방향에 대하여 45도 각도로 배치된 제3 카메라,및 상기 제3 카메라와 상기 제1 방향 및 상기 제2 방향 각각에 대하여 대칭되고 상기 제2 방향에 대하여 45도각도로 배치된 제4 카메라를 포함하고,상기 제3 카메라 그룹은,상기 제1 카메라의 배치 방향과 동일한 배치 방향으로 배치되는 제5 카메라, 및 상기 제2 카메라의 배치 방향과동일한 배치 방향으로 배치되는 제6 카메라를 포함하고,상기 제4 카메라 그룹은,공개특허 10-2024-0048723-3-상기 제3 카메라의 배치 방향과 동일한 배치 방향으로 배치되는 제7 카메라, 및 상기 제4 카메라의 배치 방향과동일한 배치 방향으로 배치되는 제8 카메라를 포함하는 것을 특징으로 하는, 시스템."}
{"patent_id": "10-2022-0128389", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3 항에 있어서,상기 주변 영역은,상기 제1 방향에 대응되는 전방 영역 및 후방 영역, 상기 제2 방향에 대응되는 측방 영역들, 및 사선 영역들을포함하고,상기 이동 로봇은,상기 제1 카메라로부터 수신된 비전 이미지와 상기 제5 카메라로부터 수신된 비전 이미지를 기초로, 제1 사선영역에 존재하는 물체의 위치를 획득하고,상기 제2 카메라로부터 수신된 비전 이미지와 상기 제6 카메라로부터 수신된 비전 이미지를 기초로, 제2 사선영역에 존재하는 물체의 위치를 획득하고,상기 제3 카메라로부터 수신된 비전 이미지와 상기 제7 카메라로부터 수신된 비전 이미지를 기초로, 제3 사선영역에 존재하는 물체의 위치를 획득하고,상기 제4 카메라로부터 수신된 비전 이미지와 상기 제8 카메라로부터 수신된 비전 이미지를 기초로, 제4 사선영역에 존재하는 물체의 위치를 획득하는 것을 특징으로 하는, 시스템."}
{"patent_id": "10-2022-0128389", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4 항에 있어서,상기 이동 로봇은,상기 제1 카메라로부터 수신된 비전 이미지와 상기 제3 카메라로부터 수신된 비전 이미지를 기초로, 상기 전방영역에 존재하는 물체의 위치를 획득하고,상기 제4 카메라로부터 수신된 비전 이미지와 상기 제5 카메라로부터 수신된 비전 이미지를 기초로, 제1 측방영역에 존재하는 물체의 위치를 획득하고,상기 제6 카메라로부터 수신된 비전 이미지와 상기 제8 카메라로부터 수신된 비전 이미지를 기초로, 상기 후방영역에 존재하는 물체의 위치를 획득하고,상기 제7 카메라로부터 수신된 비전 이미지와 상기 제2 카메라로부터 수신된 비전 이미지를 기초로, 제2 측방영역에 존재하는 물체의 위치를 획득하는 것을 특징으로 하는, 시스템."}
{"patent_id": "10-2022-0128389", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5 항에 있어서,상기 제1 카메라 그룹과 상기 제3 카메라 그룹 간의 거리는,상기 제2 카메라 그룹과 상기 제4 카메라 그룹 간의 거리와 동일하고,상기 제1 카메라 그룹과 상기 제3 카메라 그룹 간의 거리 및 상기 제2 카메라 그룹과 상기 제4 카메라 그룹 간의 거리는, 상기 복수의 카메라들 간의 거리들 중 가장 긴 것을 특징으로 하는, 시스템."}
{"patent_id": "10-2022-0128389", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6 항에 있어서,상기 이동 로봇은,상기 복수의 카메라들과 통신을 수행하도록 구성된 통신부;상기 통신부를 통해 상기 비전 이미지들을 수신하고, 삼각측량법을 이용하여 상기 비전 이미지들로부터 상기 주변 영역에 존재하는 상기 물체의 위치를 연산하고, 상기 물체의 위치를 포함하는 맵 이미지를 생성하도록 구성공개특허 10-2024-0048723-4-된 프로세서; 및상기 맵 이미지를 저장하도록 구성된 메모리를 포함하는 것을 특징으로 하는, 시스템."}
{"patent_id": "10-2022-0128389", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7 항에 있어서,상기 복수의 카메라들 및 상기 이동 로봇 상에서 물품을 지지하는 받침대 및 복수의 다리 부품들을 포함하는 트롤리(Trolley)를 더 포함하는 것을 특징으로 하는, 시스템."}
{"patent_id": "10-2022-0128389", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "복수의 카메라들 및 이동 로봇을 포함하는 시스템의 방법에 있어서,복수의 카메라들로부터 비전 이미지들을 수신하는 단계; 및상기 비전 이미지들을 기초로 물체의 위치를 획득하는 단계를 포함하고,상기 복수의 카메라들은,상기 이동 로봇에서 제1 모서리에 대응되는 제1 부분에 배치되는 제1 카메라 그룹;상기 이동 로봇에서 상기 제1 부분으로부터 제1 방향으로 이격된 제2 모서리에 대응되는 제2 부분에 배치되는제2 카메라 그룹;상기 이동 로봇에서 상기 제2 부분으로부터 상기 제1 방향과 수직되는 제2 방향으로 이격된 제3 모서리에 대응되는 제3 부분에 상기 제1 카메라 그룹과 동일한 배치 형태로 배치되는 제3 카메라 그룹; 및상기 이동 로봇에서 상기 제1 부분으로부터 상기 제2 방향으로 이격된 제4 모서리에 대응되는 제4 부분에 상기제2 카메라 그룹과 동일한 배치 형태로 배치되는 제4 카메라 그룹을 포함하는 것을 특징으로 하는, 방법."}
{"patent_id": "10-2022-0128389", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "일정한 촬영 각도의 촬상 영역을 촬영하도록 구성된 복수의 카메라들;상기 복수의 카메라들로부터 주변 영역에 대한 비전 이미지들을 입력받고, 상기 비전 이미지들을 기초로 물체의위치를 획득하도록 구성된 이동 로봇; 및상기 복수의 카메라들 및 상기 이동 로봇 상에서 물품을 지지하는 받침대 및 상기 받침대와 물리적으로 연결된복수의 다리 부품들을 포함하는 트롤리(Trolley)을 포함하고,상기 복수의 카메라들은,상기 이동 로봇에서 제1 모서리에 대응되는 제1 부분에 배치되는 제1 카메라 그룹;상기 이동 로봇에서 상기 제1 부분으로부터 제1 방향으로 이격된 제2 모서리에 대응되는 제2 부분에 배치되는제2 카메라 그룹;상기 이동 로봇에서 상기 제2 부분으로부터 상기 제1 방향과 수직되는 제2 방향으로 이격된 제3 모서리에 대응되는 제3 부분에 상기 제1 카메라 그룹과 동일한 배치 형태로 배치되는 제3 카메라 그룹; 및상기 이동 로봇에서 상기 제1 부분으로부터 상기 제2 방향으로 이격된 제4 모서리에 대응되는 제4 부분에 상기제2 카메라 그룹과 동일한 배치 형태로 배치되는 제4 카메라 그룹을 포함하는 것을 특징으로 하는, 시스템."}
{"patent_id": "10-2022-0128389", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "다중 카메라 기반의 이동 로봇의 맵 이미지 및 물체 위치를 획득하기 위한 시스템 및 방법이 개시된다. 본 개시 의 일 실시예에 따른 시스템은, 이동 로봇 및 이동 로봇에서 제1 모서리에 대응되는 제1 부분에 배치되는 제1 카 메라 그룹, 이동 로봇에서 제1 부분으로부터 제1 방향과 수직되는 제2 방향으로 이격된 제2 모서리에 대응되는 제2 부분에 배치되는 제2 카메라 그룹, 이동 로봇에서 제2 부분으로부터 제1 방향으로 이격된 제3 모서리에 대응 되는 제3 부분에 제1 카메라 그룹과 동일한 배치 형태로 배치되는 제3 카메라 그룹, 및 이동 로봇에서 제1 부분 으로부터 제2 방향으로 이격된 제4 모서리에 대응되는 제4 부분에 제2 카메라 그룹과 동일한 배치 형태로 배치되 는 제4 카메라 그룹을 포함한다."}
{"patent_id": "10-2022-0128389", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 전자 장치 및 그의 방법에 관한 것이다. 보다 상세하게는, 본 개시는 다중 카메라 기반의 이동 로봇 의 맵 이미지 및 위치를 획득하기 위한 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2022-0128389", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "4차 산업혁명 시대를 맞이하여 유통, 호텔, 물류 등 다양한 산업 분야에서 인공지능 개발되면서 서비스 로봇의 도입이 증가하는 추세이다. 이러한 서비스 로봇의 원활한 주행을 위해서는, 다수의 로봇들이 공유하여 사용할 정비된 지도환경 데이터를 제 공해 주어야 한다. 이를 위한 맵 데이터는 이동로봇들의 주행이 원활하게 이루어질 수 있도록 맵 에디터를 통해 정비되어 각 이동 로봇들로 배포된다. 맵 데이터는 기본적으로 로봇의 운영 계획에 맞추어 공통의 지도 공간 정보를 제공하고 있으나, 어떤 환경에 어 떤 정보를 제공할 것인지에 대한 구체적인 설정이 미흡한 실정이다."}
{"patent_id": "10-2022-0128389", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시에 개시된 실시예는 일반적인 카메라들을 로봇에 적절히 배치함으로써, 일반적인 카메라만으로도 로봇의 주변에 위치한 물체들의 위치를 왜곡 없이 정확히 검출하는데 그 목적이 있다. 본 개시가 해결하고자 하는 과제들은 이상에서 언급된 과제로 제한되지 않으며, 언급되지 않은 또 다른 과제들 은 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0128389", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 본 개시의 일 측면에 따른 시스템은, 일정한 촬영 각도의 촬상 영역을 촬 영하도록 구성된 복수의 카메라들; 및 복수의 카메라들로부터 주변 영역에 대한 비전 이미지들을 입력받고, 비 전 이미지들을 기초로 물체의 위치를 획득하도록 구성된 이동 로봇을 포함한다. 복수의 카메라들은, 이동 로봇 에서 제1 모서리에 대응되는 제1 부분에 배치되는 제1 카메라 그룹; 이동 로봇에서 제1 부분으로부터 제1 방향 과 수직되는 제2 방향으로 이격된 제2 모서리에 대응되는 제2 부분에 배치되는 제2 카메라 그룹; 이동 로봇에서 제2 부분으로부터 제1 방향으로 이격된 제3 모서리에 대응되는 제3 부분에 제1 카메라 그룹과 동일한 배치 형태 로 배치되는 제3 카메라 그룹; 및 이동 로봇에서 제1 부분으로부터 제2 방향으로 이격된 제4 모서리에 대응되는 제4 부분에 제2 카메라 그룹과 동일한 배치 형태로 배치되는 제4 카메라 그룹을 포함한다. 또한, 본 개시의 다른 측면에 따른 복수의 카메라들 및 이동 로봇을 포함하는 시스템의 방법은, 복수의 카메라 들로부터 비전 이미지들을 수신하는 단계; 및 비전 이미지들을 기초로 물체의 위치를 획득하는 단계를 포함한다. 복수의 카메라들은, 이동 로봇에서 제1 모서리에 대응되는 제1 부분에 배치되는 제1 카메라 그룹; 이 동 로봇에서 제1 부분으로부터 제1 방향으로 이격된 제2 모서리에 대응되는 제2 부분에 배치되는 제2 카메라 그 룹; 이동 로봇에서 제2 부분으로부터 제1 방향과 수직되는 제2 방향으로 이격된 제3 모서리에 대응되는 제3 부 분에 제1 카메라 그룹과 동일한 배치 형태로 배치되는 제3 카메라 그룹; 및 이동 로봇에서 제1 부분으로부터 제 2 방향으로 이격된 제4 모서리에 대응되는 제4 부분에 제2 카메라 그룹과 동일한 배치 형태로 배치되는 제4 카 메라 그룹을 포함한다. 또한, 본 개시의 또 다른 측면에 따른 시스템은, 일정한 촬영 각도의 촬상 영역을 촬영하도록 구성된 복수의 카 메라들; 복수의 카메라들로부터 주변 영역에 대한 비전 이미지들을 입력받고, 비전 이미지들을 기초로 물체의 위치를 획득하도록 구성된 이동 로봇; 및 복수의 카메라들 및 이동 로봇 상에서 물품을 지지하는 받침대 및 받 침대와 물리적으로 연결된 복수의 다리 부품들을 포함하는 트롤리(Trolley)을 포함한다. 복수의 카메라들은, 이 동 로봇에서 제1 모서리에 대응되는 제1 부분에 배치되는 제1 카메라 그룹; 이동 로봇에서 제1 부분으로부터 제 1 방향으로 이격된 제2 모서리에 대응되는 제2 부분에 배치되는 제2 카메라 그룹; 이동 로봇에서 제2 부분으로 부터 제1 방향과 수직되는 제2 방향으로 이격된 제3 모서리에 대응되는 제3 부분에 제1 카메라 그룹과 동일한 배치 형태로 배치되는 제3 카메라 그룹; 및 이동 로봇에서 제1 부분으로부터 제2 방향으로 이격된 제4 모서리에 대응되는 제4 부분에 제2 카메라 그룹과 동일한 배치 형태로 배치되는 제4 카메라 그룹을 포함한다. 이 외에도, 본 개시를 구현하기 위한 실행하기 위한 컴퓨터 판독 가능한 기록 매체에 저장된 컴퓨터 프로그램이 더 제공될 수 있다. 이 외에도, 본 개시를 구현하기 위한 방법을 실행하기 위한 컴퓨터 프로그램을 기록하는 컴퓨터 판독 가능한 기 록 매체가 더 제공될 수 있다."}
{"patent_id": "10-2022-0128389", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 전술한 과제 해결 수단에 의하면, 본 개시는 일반적인 카메라들을 로봇에 적절히 배치함으로써, 일반 적인 카메라만으로도 로봇의 주변에 위치한 물체들의 위치를 왜곡 없이 정확히 검출하는 효과를 제공한다. 또한, 본 개시의 전술한 과제 해결 수단에 의하면, 본 개시는 일반적인 카메라들을 로봇에 적절히 배치함으로써, 일반적인 카메라만으로도 맵 이미지를 정확히 생성하는 효과를 제공한다. 또한, 본 개시의 전술한 과제 해결 수단에 의하면, 본 개시는 일반적인 카메라들을 로봇에 적절히 배치함으로써, 트롤리의 다리 부품이 카메라의 촬상 영역에 가려지는 현상을 최소화하는 효과를 제공한다. 본 개시의 효과들은 이상에서 언급된 효과로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재로 부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0128389", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시 전체에 걸쳐 동일 참조 부호는 동일 구성요소를 지칭한다. 본 개시가 실시예들의 모든 요소들을 설명"}
{"patent_id": "10-2022-0128389", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "하는 것은 아니며, 본 개시가 속하는 기술분야에서 일반적인 내용 또는 실시예들 간에 중복되는 내용은 생략한 다. 명세서에서 사용되는 '부, 모듈, 부재, 블록'이라는 용어는 소프트웨어 또는 하드웨어로 구현될 수 있으며, 실시예들에 따라 복수의 '부, 모듈, 부재, 블록'이 하나의 구성요소로 구현되거나, 하나의 '부, 모듈, 부재, 블 록'이 복수의 구성요소들을 포함하는 것도 가능하다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 직접적으로 연결되어 있는 경우뿐 아니라, 간접적으로 연결되어 있는 경우를 포함하고, 간접적인 연결은 무선 통신망을 통해 연결되는 것을 포함 한다. 또한 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 명세서 전체에서, 어떤 부재가 다른 부재 \"상에\" 위치하고 있다고 할 때, 이는 어떤 부재가 다른 부재에 접해 있는 경우뿐 아니라 두 부재 사이에 또 다른 부재가 존재하는 경우도 포함한다. 제1, 제2 등의 용어는 하나의 구성요소를 다른 구성요소로부터 구별하기 위해 사용되는 것으로, 구성요소가 전 술된 용어들에 의해 제한되는 것은 아니다. 단수의 표현은 문맥상 명백하게 예외가 있지 않는 한, 복수의 표현을 포함한다. 각 단계들에 있어 식별부호는 설명의 편의를 위하여 사용되는 것으로 식별부호는 각 단계들의 순서를 설명하는 것이 아니며, 각 단계들은 문맥상 명백하게 특정 순서를 기재하지 않는 이상 명기된 순서와 다르게 실시될 수 있다. 이하 첨부된 도면들을 참고하여 본 개시의 작용 원리 및 실시예들에 대해 설명한다. 본 명세서에서 '본 개시에 따른 시스템'은 연산처리를 수행하여 사용자에게 결과를 제공할 수 있는 다양한 장치 들이 모두 포함된다. 예를 들어, '본 개시에 따른 시스템'은, 컴퓨터, 서버 장치 및 휴대용 단말기를 모두 포함 하거나, 또는 어느 하나의 형태가 될 수 있다. 여기에서, 상기 컴퓨터는 예를 들어, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스크톱(desktop), 랩톱 (laptop), 태블릿 PC, 슬레이트 PC 등을 포함할 수 있다. 상기 서버 장치는 외부 장치와 통신을 수행하여 정보를 처리하는 서버로써, 애플리케이션 서버, 컴퓨팅 서버, 데이터베이스 서버, 파일 서버, 게임 서버, 메일 서버, 프록시 서버 및 웹 서버 등을 포함할 수 있다. 상기 휴대용 단말기는 예를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), WiBro(Wireless Broadband Internet) 단말, 스마트 폰(Smart Phone) 등과 같은 모든 종류의 핸드헬드 (Handheld) 기반의 무선 통신 장치와 시계, 반지, 팔찌, 발찌, 목걸이, 안경, 콘택트 렌즈, 또는 머리 착용형 장치(head-mounted-device(HMD)) 등과 같은 웨어러블 장치를 포함할 수 있다. 도 1은 본 개시의 예시적인 실시예들에 따른 시스템을 설명하기 위한 도면이다. 도 1을 참조하면, 시스템은 다중 카메라 기반으로 맵 이미지 및 물체 위치를 획득할 수 있다. 이러한 시스 템은 이동 물체의 주행 시스템과 결합되어 주행 보조 시스템, 어라운드 뷰 장치, 자율 주행 시스템으로 적 용될 수 있다. 시스템은 이동 로봇 및 복수의 카메라들(1000_1~1000_8)을 포함할 수 있다. 이동 로봇은 바퀴를 이용해 자유롭게 이동할 수 있는 물체일 수 있다. 도 1에서는 이동 로봇에 바퀴 가 포함되는 것으로 도시되어 있으나, 이에 한정되는 것은 아니며, 다른 실시예들에 따른 이동 로봇은 캐 터필러로 동작하거나, 프로펠러로 동작하는 드론, 선박, 자동차 등에 적용될 수 있다. 이동 로봇은 제1 방향(D1)으로 움직일 수 있다. 여기서, 제1 방향(D1)은 이동 로봇이 전진하거나 후 진하는 방향인 것으로 가정한다. 이동 로봇은 제2 방향(D2)으로 움직일 수 있다. 여기서, 제2 방향(D2)은 이동 로봇이 방향 전환하기 위한 방향인 것으로 가정한다. 이동 로봇은 제1 방향(D1) 및 제2 방향 (D2)으로 전진 좌회전, 전진 우회전, 후진 좌회전, 또는 후진 우회전을 할 수 있다. 이동 로봇은 일측(예를 들면, 제3 방향(D3))의 높이(또는 두께)갖고, 제1 방향(D1) 및 제2 방향(D2)의 면 적을 갖는 본체와, 적어도 하나의 바퀴를 포함할 수 있다. 이동 로봇의 본체 형상은 입체형상으로서 도 1 에서는 육면체일 수 있으나, 이에 한정되는 것은 아니다. 일부 실시예들에서, 복수의 카메라들(1000_1~1000_8)은, 제1 내지 제4 카메라 그룹들로 구분될 수 있다. 각 카 메라 그룹은 이동 로봇에서 모서리에 대응되는 부분에 배치될 수 있다. 도 1에 도시된 복수의 카메라들(1000_1~1000_8)의 개수는 8개일 수 있으나, 이에 한정되는 것은 아니며, 설계 방법에 따라 8개보다 작거나 8개보다 클 수 있다. 복수의 카메라들(1000_1~1000_8)은 일정한 촬영 각도(또는 화각)의 촬상 영역을 촬영하도록 구성될 수 있다. 카 메라의 촬영 각도가 커지면 시차가 켜져 왜곡이 발생할 수 있는데, 복수의 카메라들(1000_1~1000_8)은 일반적인 카메라로 구현될 수 있으므로, 복수의 카메라들(1000_1~1000_8)로부터 획득된 비전 이미지들에서 왜곡이 발생하 지 않을 수 있다. 복수의 카메라들(1000_1~1000_8)은 이동 로봇의 상부(예를 들면, 제3 방향(D3))에 위치할 수 있다. 복수의 카메라들(1000_1~1000_8)은 이동 로봇의 이동 방향(예를 들면, 제1 방향(D1))에 대해 전면 방향, 후면 방 향, 사선 방향 등으로 배치될 수 있다. 일부 실시예들에서, 복수의 카메라들(1000_1~1000_8)이 사선 방향으로 배치될 수 있다. 그리고, 복수의 카메라 들(1000_1~1000_8) 중 제1 및 제2 카메라들(1000_1, 1000_2)이 같은 위치에 모여 배치되고, 복수의 카메라들 (1000_1~1000_8) 중 제3 및 제4 카메라들(1000_3, 1000_4)이 같은 위치에 모여 배치되고, 복수의 카메라들 (1000_1~1000_8) 중 제5 및 제6 카메라들(1000_5, 1000_6)이 같은 위치에 모여 배치되고, 복수의 카메라들 (1000_1~1000_8) 중 제7 및 제8 카메라들(1000_7, 1000_8)이 같은 위치에 모여 배치될 수 있다. 그리고, 복수의 카메라들(1000_1~1000_8) 중 제1 카메라(1000_1) 및 제7 카메라(1000_7)가 같은 방향으로 배치되고, 복수의 카메라들(1000_1~1000_8) 중 제2 카메라(1000_2) 및 제8 카메라(1000_8)가 같은 방향으로 배치되고, 복수의 카 메라들(1000_1~1000_8) 중 제3 카메라(1000_3) 및 제5 카메라(1000_5)가 같은 방향으로 배치되고, 복수의 카메 라들(1000_1~1000_8) 중 제4 카메라(1000_4) 및 제6 카메라(1000_6)가 같은 방향으로 배치될 수 있다. 일부 실시예들에서, 복수의 카메라들(1000_1~1000_8)이 제1 방향(D1) 및 제2 방향(D2)에 평행하게 배치될 수 있 다. 즉, 복수의 카메라들(1000_1~1000_8)이, 제1 방향(D1) 및 제2 방향(D2)으로 이루어진 2차원 평면 상에 나란 히 배치될 수 있다. 일부 실시예들에서, 복수의 카메라들(1000_1~1000_8)이, 제1 방향(D1) 및 제2 방향(D2)으로 이루어진 2차원 평 면으로부터 일정한 기울기를 갖도록, 이동 로봇 상에 기울어져 배치될 수 있다. 이 경우, 복수의 카메라들 (1000_1~1000_8)의 촬영 각도가, 제1 방향(D1) 및 제2 방향(D2)으로 이루어진 2차원 평면으로부터 일정한 각도 를 유지할 수 있으므로, 복수의 카메라들(1000_1~1000_8)에 의해 획득된 비전 이미지에서 바닥면(예를 들면, 이 동 로봇이 지지되는 면으로, 제3 방향(D3)으로의 길이가 0이고 제1 방향(D1) 및 제2 방향(D2)으로 이루어 진 2차원 평면)이 포함되지 않을 수 있다. 이에 따라, 복수의 카메라들(1000_1~1000_8)에 의해 획득된 비전 이 미지에서 상대적으로 더 많은 정보들이 포함될 수 있다. 전술한 바에 의하면, 일반적인 촬영 각도를 갖는 카메라들을 이용함으로써 로봇의 주변에 위치한 물체들의 위치 를 왜곡 없이 검출할 수 있다는 장점이 있다. 이하에서는 이동 로봇 상에서 복수의 카메라들(1000_1~1000_8)이 배치되는 배치 위치에 대한 설명이 후술 된다. 도 2는 복수의 카메라들의 배치를 설명하기 위한 도 1의 시스템의 평면도이다. 도 2를 참조하면, 시스템에 포함된 복수의 카메라들(1000_1~1000_8)은 제1 내지 제4 카메라 그룹으로 구분 될 수 있다. 제1 카메라 그룹은 이동 로봇에서 제1 모서리에 대응되는 제1 부분(P1)에 배치될 수 있다. 예를 들면, 제1 및 제2 카메라들(1000_1, 1000_2)은 제1 카메라 그룹에 포함되며, 제1 부분(P1)에 배치될 수 있다. 제1 카메라 (1000_1)는 제2 방향(D2)에 대하여 일정한 각도(θ1)만큼 기울어져 배치될 수 있다. 또는 제1 카메라(1000_1)는 제1 방향(D1)에 대하여 일정 각도만큼 기울어져 배치될 수 있다. 제2 카메라(1000_2)는 제1 카메라(1000_1)와 원점 대칭되도록 배치될 수 있다. 구체적으로, 제2 카메라(1000_2)는 제1 카메라(1000_1)와 제1 방향(D1) 및 제 2 방향(D2) 각각에 대하여 대칭되고 제2 방향(D2)에 대하여 일정한 각도(θ1)만큼 기울어져 배치될 수 있다. 제2 카메라 그룹은 이동 로봇에서 제2 모서리에 대응되는 제2 부분(P2)에 배치될 수 있다. 예를 들면, 제3 및 제4 카메라들(1000_3, 1000_4)은 제2 카메라 그룹에 포함되며, 제2 부분(P2)에 배치될 수 있다. 제2 부분 (P2)은 제1 부분(P1)으로부터 제2 방향(D2)으로 일정한 거리(a)만큼 이격된 부분될 수 있다. 제3 카메라 (1000_3)는 제2 방향(D2)에 대하여 일정한 각도(θ1)만큼 기울어져 배치될 수 있다. 제4 카메라(1000_4)는 제3 카메라(1000_3)와 원점 대칭되도록 배치될 수 있다. 구체적으로, 제4 카메라(1000_4)는 제3 카메라(1000_3)와 제1 방향(D1) 및 제2 방향(D2) 각각에 대하여 대칭되고 제2 방향(D2)에 대하여 일정한 각도(θ1)만큼 기울어져 배치될 수 있다. 제3 카메라 그룹은 이동 로봇에서 제3 모서리에 대응되는 제3 부분(P3)에 배치될 수 있다. 예를 들면, 제5 및 제6 카메라들(1000_5, 1000_6)은 제3 카메라 그룹에 포함되며, 제3 부분(P3)에 배치될 수 있다. 제3 부분 (P3)은 제2 부분(P2)으로부터 제1 방향(D1)으로 일정한 거리(b)만큼 이격된 부분될 수 있다. 또는 제3 부분(P 3)은 제1 부분(P1)으로부터 사선 방향으로 일정한 거리(c)만큼 이격된 부분될 수 있다. 제3 카메라 그룹은 제1 카메라 그룹과 동일한 배치 형태로 배치될 수 있다. 예를 들면, 제1 카메라 그룹의 제1 및 제2 카메라들 (1000_1, 1000_2)의 배치 형태와 제3 카메라 그룹의 제5 및 제6 카메라들(1000_5, 1000_6)의 배치 형태가 동일 할 수 있다. 제4 카메라 그룹은 이동 로봇에서 제4 모서리에 대응되는 제4 부분(P4)에 배치될 수 있다. 예를 들면, 제7 및 제8 카메라들(1000_7, 1000_8)은 제4 카메라 그룹에 포함되며, 제4 부분(P4)에 배치될 수 있다. 제4 부분 (P4)은 제3 부분(P3)으로부터 제2 방향(D2)으로 일정한 거리(a)만큼 이격된 부분될 수 있다. 또는 제4 부분(P 4)은 제1 부분(P1)으로부터 제1 방향(D1)으로 일정한 거리(b)만큼 이격된 부분될 수 있다. 또는 제4 부분(P4)은 제2 부분(P2)으로부터 사선 방향으로 일정한 거리(c)만큼 이격된 부분될 수 있다. 제4 카메라 그룹은 제2 카메 라 그룹과 동일한 배치 형태로 배치될 수 있다. 예를 들면, 제2 카메라 그룹의 제3 및 제4 카메라들(1000_3,1000_4)의 배치 형태와 제4 카메라 그룹의 제7 및 제7 카메라들(1000_7, 1000_8)의 배치 형태가 동일할 수 있다. 일부 실시예들에서, 제1 카메라 그룹과 제3 카메라 그룹 간의 거리(c)는, 제2 카메라 그룹과 제4 카메라 그룹 간의 거리(c)와 동일할 수 있다. 그리고, 제1 카메라 그룹과 제3 카메라 그룹 간의 거리(c) 및 제2 카메라 그룹 과 제4 카메라 그룹 간의 거리(c)는, 복수의 카메라들 간의 거리들 중 가장 길 수 있다. 예를 들면, 제1 카메라 그룹과 제3 카메라 그룹 간의 거리(c) 및 제2 카메라 그룹과 제4 카메라 그룹 간의 거리(c)는, 제1 카메라 그룹 과 제2 카메라 그룹 간의 거리(a) 및 제2 카메라 그룹과 제3 카메라 그룹 간의 거리(b)보다 클 수 있다. 전술한 바에 의하면, 제1 카메라 그룹과 제3 카메라 그룹(또는, 제2 카메라 그룹과 제4 카메라 그룹)으로부터 획득된 비전 이미지들로부터 물체의 위치를 정확히 검출할 수 있다는 장점이 있다. 복수의 카메라들(1000_1~1000_8)은 일정한 촬영 각도(θ2)의 촬상 영역을 촬영할 수 있다. 일부 실시예들에서, 복수의 카메라들(1000_1~1000_8)의 개수는 360도에서 촬영 각도(θ2)로 나눈 정수의 두배이 고, 제1 카메라 그룹 내지 제4 카메라 그룹 각각에 포함된 카메라의 개수는, 복수의 카메라들의 개수의 1/4, 즉 균등하게 분배될 수 있다. 구체적으로, 복수의 카메라들(1000_1~1000_8)의 개수(n)는 아래의 [수학식 1]에 따라 산출될 수 있다. [수학식 1]"}
{"patent_id": "10-2022-0128389", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "여기서, θ는 촬영 각도이고, θ의 단위는 도(degree)일 수 있다. 예를 들면, θ가 90°이면, 복수의 카메라들 (1000_1~1000_8)의 개수는 8개이고, 각 카메라 그룹에 포함되는 카메라 개수는 2개일 수 있다. 다른 예를 들면, θ가 60°이면, 복수의 카메라들(1000_1~1000_8)의 개수는 12개이고, 각 카메라 그룹에 포함되는 카메라 개수는 3개일 수 있다. 또 다른 예를 들면, θ가 45°이면, 복수의 카메라들(1000_1~1000_8)의 개수는 16개이고, 각 카 메라 그룹에 포함되는 카메라 개수는 4개일 수 있다. 하지만, 이에 한정되는 것은 아니다. 이하에서는 촬영 각도(θ2)가 90°인 8 개의 카메라들(1000_1~1000_8)을 기준으로 각 카메라의 배치 형태에 대 한 설명이 후술된다. 도 3은 본 개시의 일 실시예에 따라 배치된 복수의 카메라들의 촬상 영역들을 설명하기 위한 도면이다. 도 3을 참조하면, 일 실시예에서, 복수의 카메라들(1000_1~1000_8)은 일반적인 카메라일 수 있다. 각 카메라의 촬영 각도는 90°인 경우, 복수의 카메라들(1000_1~1000_8)의 개수는 8개일 수 있다. 그리고, 각 카메라 그룹은 2개의 카메라들을 포함할 수 있다. 제1 카메라 그룹은 제1 부분(P1)에 배치될 수 있다. 제1 카메라 그룹에 포함된 제1 카메라(1000_1)는 제2 방향 (D2)에 대하여 45° 각도로 배치될 수 있다. 제1 카메라 그룹에 포함된 제2 카메라(1000_2)는, 제1 카메라 (1000_1)와 제1 방향(D1) 및 제2 방향(D2) 각각에 대하여 대칭되고 제2 방향(D2)에 대하여 45° 각도로 배치될 수 있다. 제1 카메라(1000_1)와 제2 카메라(1000_2)는 원점 대칭일 수 있다. 제2 카메라 그룹은 제2 부분(P2)에 배치될 수 있다. 제2 카메라 그룹에 포함된 제3 카메라(1000_3)는 제1 카메 라(1000_1)와 제1 방향(D1)에 대하여 대칭되고 제2 방향(D2)에 대하여 45° 각도로 배치될 수 있다. 제2 카메라 그룹에 포함된 제4 카메라(1000_4)는 제3 카메라(1000_3)와 제1 방향(D1)및 제2 방향(D2) 각각에 대하여 대칭되 고 제2 방향(D2)에 대하여 45° 각도로 배치될 수 있다. 제3 카메라(1000_3)와 제4 카메라(1000_4)는 원점 대칭 일 수 있다. 제3 카메라 그룹은 제3 부분(P3)에 배치될 수 있다. 제3 카메라 그룹에 포함된 제5 카메라(1000_5)는 제1 카메 라(1000_1)의 배치 방향과 동일한 배치 방향으로 배치될 수 있다. 제3 카메라 그룹에 포함된 제6 카메라 (1000_6)는 제2 카메라(1000_2)의 배치 방향과 동일한 배치 방향으로 배치될 수 있다. 제5 카메라(1000_5)와 제 6 카메라(1000_6)는 원점 대칭일 수 있다. 제4 카메라 그룹은 제4 부분(P4)에 배치될 수 있다. 제4 카메라 그룹에 포함된 제7 카메라(1000_7)는 제3 카메 라(1000_3)의 배치 방향과 동일한 배치 방향으로 배치될 수 있다. 제4 카메라 그룹에 포함된 제8 카메라 (1000_8)는 제4 카메라(1000_4)의 배치 방향과 동일한 배치 방향으로 배치될 수 있다. 제7 카메라(1000_7)와 제 8 카메라(1000_8)는 원점 대칭일 수 있다.일 실시예에서, 이동 로봇의 주변 영역은 복수의 영역들(FR1, FR2, FR3, FR4) 및 사선 영역들(DFR1, DFR2, DFR3, DFR4)을 포함할 수 있다. 이때, 제1 방향(D1)이 이동 로봇의 전방인 경우, 제1 영역(FR1)은 제1 방향(D1)에 대응되는 전방 영역으로 지칭될 수 있다. 제2 영역(FR2)은 제1 방향(D1)에 대응되는 후방 영역 으로 지칭될 수 있다. 제3 및 제4 영역들(FR3, FR4)은 제2 방향(D2)에 대응되는 측방 영역들로 지칭될 수 있다. 여기서, 제3 영역(FR3)은 좌측방 영역이고 제4 영역(FR4)은 우측방 영역인 것으로 가정한다. 여기서, 복수의 영 역들(FR1, FR2, FR3, FR4) 및 사선 영역들(DFR1, DFR2, DFR3, DFR4)을 구분 지칭하기 위한 제1, 제2 등의 용어 는 이에 한정되는 것은 아니다. 각 카메라의 촬상 영역에 의해, 각 카메라는 주변 영역에서 일부 영역들을 촬영할 수 있다. 도 3을 참조하여 예 를 들면, 제1 카메라(1000_1)는 제1 영역(FR1) 및 제1 사선 영역(DFR1)을 촬영할 수 있다. 제2 카메라(1000_ 2)는 제3 영역(FR3) 및 제3 사선 영역(DFR3)을 촬영할 수 있다. 제3 카메라(1000_3)는 제1 영역(FR1) 및 제4 사선 영역(DFR4)을 촬영할 수 있다. 제4 카메라(1000_4)는 제4 영역(FR4) 및 제2 사선 영역(DFR2)을 촬영할 수 있다. 제5 카메라(1000_5)는 제4 영역(FR4) 및 제1 사선 영역(DFR1)을 촬영할 수 있다. 제6 카메라(1000_6)는 제2 영역(FR2) 및 제3 사선 영역(DFR3)을 촬영할 수 있다. 제7 카메라(1000_7)는 제3 영역(FR3) 및 제4 사선 영역(DFR4)을 촬영할 수 있다. 제8 카메라(1000_8)는 제2 영역(FR2) 및 제2 사선 영역(DFR2)을 촬영할 수 있다. 하나의 카메라로부터 획득된 비전 이미지만으로는 그 비전 이미지 내에 포함된 물체의 위치 및/또는 물체에 대 한 거리는 알 수 없지만, 카메라로부터 그 물체를 향하는 방향은 알 수 있다. 제1 카메라(1000_1)와 제3 카메라(1000_3)에 의해, 이동 로봇의 제4 사선 영역(DFR4), 제1 영역(FR1), 및 제1 사선 영역(DFR1)에 존재하는 물체가 감지될 수 있다. 제4 카메라(1000_4)와 제5 카메라(1000_5)에 의해, 이 동 로봇의 제1 사선 영역(DFR1), 제4 영역(FR4), 및 제2 사선 영역(DFR2)에 존재하는 물체가 감지될 수 있 다. 제6 카메라(1000_6)와 제8 카메라(1000_8)에 의해, 이동 로봇의 제2 사선 영역(DFR2), 제2 영역 (FR2), 및 제3 사선 영역(DFR3)에 존재하는 물체가 감지될 수 있다. 제7 카메라(1000_7)와 제2 카메라(1000_ 2)에 의해, 이동 로봇의 제3 사선 영역(DFR3), 제3 영역(FR3), 및 제4 사선 영역(DFR4)에 존재하는 물체가 감지될 수 있다. 한편, 중복되는 촬상 영역을 갖는 2 개의 카메라들로부터 획득된 비전 이미지들으로 해당 촬상 영역 내 존재하 는 물체의 위치는 검출될 수 있다. 구체적으로 예를 들면, 제1 카메라(1000_1)와 제5 카메라(1000_5)는 제1 사선 영역(DFR1)을 공통적으로 촬영할 수 있으므로, 제1 카메라(1000_1)와 제5 카메라(1000_5) 각각에 의해 촬영된 비전 이미지들로부터 제1 사선 영 역(DFR1)에 존재하는 물체의 위치가 획득될 수 있다. 제4 카메라(1000_4)와 제8 카메라(1000_8)는 제2 사선 영역(DFR2)을 공통적으로 촬영할 수 있으므로, 제4 카메 라(1000_4)와 제8 카메라(1000_8) 각각에 의해 촬영된 비전 이미지들로부터 제2 사선 영역(DFR2)에 존재하는 물 체의 위치가 획득될 수 있다. 제2 카메라(1000_2)와 제6 카메라(1000_6)는 제3 사선 영역(DFR3)을 공통적으로 촬영할 수 있으므로, 제2 카메 라(1000_2)와 제6 카메라(1000_6) 각각에 의해 촬영된 비전 이미지들로부터 제3 사선 영역(DFR3)에 존재하는 물 체의 위치가 획득될 수 있다. 제3 카메라(1000_3)와 제7 카메라(1000_7)는 제4 사선 영역(DFR4)을 공통적으로 촬영할 수 있으므로, 제3 카메 라(1000_3)와 제7 카메라(1000_7)는 각각에 의해 촬영된 비전 이미지들로부터 제4 사선 영역(DFR4)에 존재하는 물체의 위치가 획득될 수 있다. 제1 카메라(1000_1)와 제3 카메라(1000_3)는 제1 영역(FR1)을 공통적으로 촬영할 수 있으므로, 제1 카메라 (1000_1)와 제3 카메라(1000_3) 각각에 의해 촬영된 비전 이미지들로부터 제1 영역(FR1)에 존재하는 물체의 위 치가 획득될 수 있다. 제6 카메라(1000_6)와 제8 카메라(1000_8)는 제2 영역(FR2)을 공통적으로 촬영할 수 있으므로, 제6 카메라 (1000_6)와 제8 카메라(1000_8) 각각에 의해 촬영된 비전 이미지들로부터 제2 영역(FR2)에 존재하는 물체의 위 치가 획득될 수 있다. 제2 카메라(1000_2)와 제7 카메라(1000_7)는 제3 영역(FR3)을 공통적으로 촬영할 수 있으므로, 제2 카메라 (1000_2)와 제7 카메라(1000_7) 각각에 의해 촬영된 비전 이미지들로부터 제3 영역(FR3)에 존재하는 물체의 위 치가 획득될 수 있다. 제4 카메라(1000_4)와 제5 카메라(1000_5)는 제4 영역(FR4)을 공통적으로 촬영할 수 있으므로, 제4 카메라 (1000_4)와 제5 카메라(1000_5) 각각에 의해 촬영된 비전 이미지들로부터 제4 영역(FR4)에 존재하는 물체의 위 치가 획득될 수 있다. 도 4는 본 개시의 다른 실시예들에 따라 배치된 복수의 카메라들의 촬상 영역들을 설명하기 위한 도면이다. 도 4를 참조하면, 일부 실시예들에서, 각 카메라의 촬영 각도는 60°인 경우, 복수의 카메라들의 개수는 12개이 며, 각 카메라 그룹은 3개의 카메라들을 포함하는 실시예가 도 4에 도시되어 있다. 도 4에 표시된 패턴은 하나의 카메라의 배치 위치, 촬영 방향, 및 촬상 영역을 나타낼 수 있다. 도 4에서 같은 모양으로 표시된 2개의 패턴들은, 도 3을 참조하여 전순한 바와 같이, 중첩되는 촬상 영역 내에 존재하는 물체 의 위치를 검출하기 위한 2개의 카메라들에 대응될 수 있다. 도 4에 각 카메라의 배치 형태에 따르면, 이동 로봇의 주변 영역, 즉 복수의 영역들(FR1, FR2, FR3, FR4) 및 사선 영역들(DFR1, DFR2, DFR3, DFR4)이 촬영될 수 있고, 복수의 영역들(FR1, FR2, FR3, FR4) 및 사선 영역 들(DFR1, DFR2, DFR3, DFR4) 내에 존재하는 모든 물체들의 위치가 검출될 수 있다. 전술한 바에 의하면, 일반적인 카메라들만으로 왜곡 없이 물체의 위치를 정확히 획득할 수 있다는 장점이 있다. 도 5는 본 개시의 예시적인 실시예들에 따른 시스템의 블록도이다. 도 5를 참조하면, 시스템은 복수의 카메라들 및 이동 로봇을 포함할 수 있다. 카메라는 촬영 모드에서 이미지 센서에 의해 얻어지는 정지영상 또는 동영상 등의 화상 프레임을 처리한다. 처 리된 화상 프레임은 디스플레이에 표시되거나 메모리에 저장될 수 있다. 복수의 카메라들은 일정한 촬영 각도의 촬상 영역을 촬영할 수 있다. 복수의 카메라들은 왜곡되지 않는 비전 이비지를 생성하는 일반적인 카메라로 구현될 수 있다. 복수의 카메라들 각각은 각자의 촬상 영역을 촬영하여 비전 이미지를 생성하고, 생성된 비전 이미지를 이동 로봇에 제공할 수 있다. 복수의 카 메라들 각각은 이동 로봇과 통신하기 위한 통신 인터페이스를 구비할 수 있다. 인터페이스는 다양한 종류의 외부 기기와의 통로 역할을 수행한다. 이러한 인터페이스는 유/무선 헤드셋 포트 (port), 외부 충전기 포트(port), 유/무선 데이터 포트(port), 메모리 카드(memory card) 포트, 식별 모듈 (SIM)이 구비된 장치를 연결하는 포트(port), 오디오 I/O(Input/Output) 포트(port), 비디오 I/O(Input/Output) 포트(port), 이어폰 포트(port) 중 적어도 하나를 포함할 수 있다. 복수의 카메라들은 매트릭스 구조를 이루도록 배치될 수 있으며, 이와 같이 매트릭스 구조를 이루는 카메 라들을 통해 다양한 각도 또는 초점을 갖는 복수의 영상정보가 입력될 수 있고, 또한 복수의 카메라들은 3차원의 입체영상을 구현하기 위한 좌 영상 및 우 영상을 획득하도록, 스트레오 구조로 배치될 수도 있다. 이동 로봇은 복수의 카메라들로부터 주변 영역에 대한 비전 이미지들을 입력받을 수 있다. 그리고, 이동 로봇은 비전 이미지들을 기초로 물체의 위치를 획득할 수 있다. 그리고, 이동 로봇은 이동 로봇 의 주변 영역에 대한 맵 이미지를 생성할 수 있다. 맵 이미지는 물체의 위치를 나타내는 정보가 포함될 수 있다. 특정 방향에 대해서 두 대의 카메라가 동일한 촬상 영역을 중첩(Overlap) 하여 촬영함로, 특정 촬상 영역에 있 는 물체의 위치가 추정 가능하다. 이를 위해, 일부 실시예들에서, 이동 로봇은 삼각측량법을 수행하여, 두 카메라들로부터 획득된 비전 이미지들에서 물체의 위치를 획득할 수 있다. 구체적으로, 이동 로봇은 각 비 전 이미지에서 물체에 대한 방향을 획득하여, 획득된 제1 방향 및 제2 방향 각각으로부터 연장된 라인들이 교차 되는 지점을 물체의 위치로 획득할 수 있다. 일부 실시예들에서, 이동 로봇은 제1 카메라(1000_1)와 제5 카메라(1000_5) 각각으로부터 획득된 비전 이 미지들을 이용하여 제1 사선 영역(DFR1)에 존재하는 물체의 위치를 획득할 수 있다. 이동 로봇은 제4 카메 라(1000_4)와 제8 카메라(1000_8) 각각으로부터 획득된 비전 이미지들을 이용하여 제2 사선 영역(DFR2)에 존재 하는 물체의 위치를 획득할 수 있다. 이동 로봇은 제2 카메라(1000_2)와 제6 카메라(1000_6) 각각으로부터 획득된 비전 이미지들을 이용하여 제3 사선 영역(DFR3)에 존재하는 물체의 위치를 획득할 수 있다. 이동 로봇 은 제3 카메라(1000_3)와 제7 카메라(1000_7) 각각으로부터 획득된 비전 이미지들을 이용하여 제4 사선 영 역(DFR4)에 존재하는 물체의 위치를 획득할 수 있다. 일부 실시예들에서, 이동 로봇은 제1 카메라(1000_1)와 제3 카메라(1000_3) 각각으로부터 획득된 비전 이 미지들을 이용하여 제1 영역(FR1)에 존재하는 물체의 위치를 획득할 수 있다. 이동 로봇은 제6 카메라 (1000_6)와 제8 카메라(1000_8) 각각으로부터 획득된 비전 이미지들을 이용하여 제2 영역(FR2)에 존재하는 물체 의 위치를 획득할 수 있다. 이동 로봇은 제2 카메라(1000_2)와 제7 카메라(1000_7) 각각으로부터 획득된 비전 이미지들을 이용하여 제3 영역(FR3)에 존재하는 물체의 위치를 획득될 수 있다. 이동 로봇은 제4 카 메라(1000_4)와 제5 카메라(1000_5) 각각으로부터 획득된 비전 이미지들을 이용하여 제4 영역(FR4)에 존재하는 물체의 위치를 획득할 수 있다. 도 6은 본 개시의 예시적인 실시예들에 따른 이동 로봇의 블록도이다. 도 6을 참조하면, 이동 로봇은 통신부, 프로세서, 메모리, 디스플레이, 및 입력부 를 포함할 수 있다. 통신부는 복수의 카메라들과 통신을 수행할 수 있다. 통신부는 장치와 통신을 가능하게 하는 하나 이상의 구성 요소를 포함할 수 있다. 예를 들어, 통신부는 방송 수신 모듈, 유선통신 모듈, 무선통신 모듈, 근거리 통신 모듈, 위치정보 모듈 중 적어도 하나를 포함할 수 있다. 유선 통신 모듈은, 지역 통신(Local Area Network; LAN) 모듈, 광역 통신(Wide Area Network; WAN) 모듈 또는 부가가치 통신(Value Added Network; VAN) 모듈 등 다양한 유선 통신 모듈뿐만 아니라, USB(Universal Serial Bus), HDMI(High Definition Multimedia Interface), DVI(Digital Visual Interface), RS-232(recommended standard232), 전력선 통신, 또는 POTS(plain old telephone service) 등 다양한 케이블 통신 모듈을 포함할 수 있다. 무선 통신 모듈은 와이파이(Wifi) 모듈, 와이브로(Wireless broadband) 모듈 외에도, GSM(global System for Mobile Communication), CDMA(Code Division Multiple Access), WCDMA(Wideband Code Division Multiple Access), UMTS(universal mobile telecommunications system), TDMA(Time Division Multiple Access), LTE(Long Term Evolution), 4G, 5G, 6G 등 다양한 무선 통신 방식을 지원하는 무선 통신 모듈을 포함할 수 있 다. 무선 통신 모듈은 신호를 송신하는 안테나 및 송신기(Transmitter)를 포함하는 무선 통신 인터페이스를 포함할 수 있다. 또한, 무선 통신 모듈은 제어부의 제어에 따라 무선 통신 인터페이스를 통해 제어부로부터 출력된 디 지털 제어 신호를 아날로그 형태의 무선 신호로 변조하는 신호 변환 모듈을 더 포함할 수 있다. 무선 통신 모듈은 신호를 수신하는 안테나 및 수신기(Receiver)를 포함하는 무선 통신 인터페이스를 포함할 수 있다. 또한, 무선 통신 모듈은 무선 통신 인터페이스를 통하여 수신한 아날로그 형태의 무선 신호를 디지털 제 어 신호로 복조하기 위한 신호 변환 모듈을 더 포함할 수 있다. 근거리 통신 모듈은 근거리 통신(Short range communication)을 위한 것으로서, 블루투스(Bluetooth™ RFID(Radio Frequency Identification), 적외선 통신(Infrared Data Association; IrDA), UWB(Ultra Wideband), ZigBee, NFC(Near Field Communication), Wi-Fi(Wireless-Fidelity), Wi-Fi Direct, Wireless USB(Wireless Universal Serial Bus) 기술 중 적어도 하나를 이용하여, 근거리 통신을 지원할 수 있다. 위치정보 모듈은 본 개시에 따른 이동 로봇의 위치(또는 현재 위치)를 획득하기 위한 모듈로서, 그의 대표 적인 예로는 GPS(Global Positioning System) 모듈 또는 WiFi(Wireless Fidelity) 모듈이 있다. 예를 들어, GPS모듈을 활용하면, GPS 위성에서 보내는 신호를 이용하여 이동 로봇의 위치를 획득할 수 있다. 다른 예 로서, Wi-Fi모듈을 활용하면, Wi-Fi모듈과 무선신호를 송신 또는 수신하는 무선 AP(Wireless Access Point)의 정보에 기반하여, 이동 로봇의 위치를 획득할 수 있다. 필요에 따라서, 위치정보 모듈은 치환 또는 부가적 으로 이동 로봇의 위치에 관한 데이터를 얻기 위해 통신부의 다른 모듈 중 어느 기능을 수행할 수 있다. 위치정보모듈은 이동 로봇의 위치(또는 현재 위치)를 획득하기 위해 이용되는 모듈로, 이동 로봇의 위치를 직접적으로 계산하거나 획득하는 모듈로 한정되지는 않는다. 프로세서는 통신부를 통해 비전 이미지들을 수신하고, 삼각측량법을 이용하여 비전 이미지들로부터 주변 영역에 존재하는 물체의 위치 및/또는 거리를 연산하고, 물체의 위치를 포함하는 맵 이미지를 생성할 수 있다. 프로세서는 선행적으로 입력된 복수의 비전 이미지들(또는 이미지 처리된 이미지들)에서 특징 맵을 생성할 수 있다. 예를 들어, 프로세서는 합성 뉴럴 네트워크에 이미지를 입력하여, 복수의 특징 맵들을 추출할 수있다. 특징 맵을 이용하는 경우, 스테레오 매핑 과정에서의 연산량을 줄일 수 있는 효과가 있다. 프로세서는 복수의 이미지들(또는 복수의 특징 맵들)을 가상의 3차원 도형에 투영할 수 있다. 예를 들어, 프로세서는 복수의 카메라들 각각에 대한 자세 정보를 이용하여 복수의 이미지들 각각을 가상의 3차 원 도형에 투영할 수 있다. 프로세서는 3차원 도형에 투영된 복수의 이미지 각각을 병합하여 이동체 전(All) 방향에 대한 맵 이미지를 생성할 수 있다. 예를 들어, 3차원 도형에 투영된 특징 맵 각각을 병합하여 3차원 전방향 영역에 대한 물리적인 공간 정보를 포함하도록 변환할 수 있다. 메모리는 맵 이미지를 저장할 수 있다. 메모리는 이동 로봇의 다양한 기능을 지원하는 데이터와, 제어부의 동작을 위한 프로그램을 저장할 수 있고, 입/출력되는 데이터들(예를 들어, 음악 파일, 정 지영상, 동영상 등)을 저장할 있고, 이동 로봇에서 구동되는 다수의 응용 프로그램(application program 또는 애플리케이션(application)), 이동 로봇의 동작을 위한 데이터들, 명령어들을 저장할 수 있다. 이러 한 응용 프로그램 중 적어도 일부는, 무선 통신을 통해 외부 서버로부터 다운로드 될 수 있다. 메모리는 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), SSD 타입(Solid State Disk type), SDD 타입(Silicon Disk Drive type), 멀티미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 램(random access memory; RAM), SRAM(static random access memory), 롬(read-only memory; ROM), EEPROM(electrically erasable programmable read-only memory), PROM(programmable read-only memory), 자기 메모리, 자기 디스크 및 광디스 크 중 적어도 하나의 타입의 저장매체를 포함할 수 있다. 또한, 메모리는 이동 로봇와는 분리되어 있 으나, 유선 또는 무선으로 연결된 데이터베이스가 될 수도 있다. 디스플레이는 프로세서에서 처리되는 정보를 표시(출력)할 수 있다. 예를 들어, 디스플레이는 프로세서에서 구동되는 응용 프로그램(일 예로, 어플리케이션)의 실행화면 정보, 또는 이러한 실행화면 정 보에 따른 UI(User Interface), GUI(Graphic User Interface) 정보를 표시할 수 있다. 입력부는, 영상 정보(또는 신호), 오디오 정보(또는 신호), 데이터, 또는 사용자로부터 입력되는 정보의 입력을 위한 것일 수 있다. 입력부는 적어도 하나의 마이크로폰 및 사용자 입력부 중 적어도 하나를 포함 할 수 있다. 입력부에서 수집한 음성 데이터나 이미지 데이터는 분석되어 사용자의 제어 명령으로 처리될 수 있다. 사용자 입력부는 사용자로부터 정보를 입력받기 위한 것으로서, 사용자 입력부를 통해 정보가 입력되 면, 프로세서는 입력된 정보에 대응되도록 이동 로봇의 동작을 제어할 수 있다. 이러한, 사용자 입력 부는 하드웨어식 물리 키(예를 들어, 이동 로봇의 전면, 후면 및 측면 중 적어도 하나에 위치하는 버튼, 돔 스위치 (dome switch), 조그 휠, 조그 스위치 등) 및 소프트웨어식 터치 키를 포함할 수 있다. 일 예로서, 터치 키는, 소프트웨어적인 처리를 통해 터치스크린 타입의 디스플레이 상에 표시되는 가상 키(virtual key), 소프트 키(soft key) 또는 비주얼 키(visual key)로 이루어지거나, 터치스크린 이외의 부분에 배치되는 터치 키(touch key)로 이루어질 수 있다. 한편, 가상키 또는 비주얼 키는, 다양한 형태를 가지면서 터치스크린 상에 표시되는 것이 가능하며, 예를 들어, 그래픽(graphic), 텍스트(text), 아이콘(icon), 비디오(video) 또는 이들의 조합으로 이루어질 수 있다. 도시되지 않았지만, 이동 로봇은 프로세서의 제어에 의해 바퀴 등을 움직이기 위한 거동부를 더 포함 할 수 있다. 도 6에 도시된 구성 요소들의 성능에 대응하여 적어도 하나의 구성요소가 추가되거나 삭제될 수 있다. 또한, 구 성 요소들의 상호 위치는 시스템의 성능 또는 구조에 대응하여 변경될 수 있다는 것은 당해 기술 분야에서 통상 의 지식을 가진 자에게 용이하게 이해될 것이다. 한편, 도 6에 도시된 각각의 구성요소는 소프트웨어 및/또는 Field Programmable Gate Array(FPGA) 및 주문형 반도체(ASIC, Application Specific Integrated Circuit)와 같은 하드웨어 구성요소를 의미한다. 도 7은 본 개시의 예시적인 실시예들에 따른 시스템의 방법을 설명하기 위한 흐름도이다. 도 7을 참조하면, 이동 로봇은 복수의 카메라들로부터 비전 이미지들을 수신한다(S100). 복수의 카 메라들은, 도 2 내지 도 4를 참조하여 전술한 바와 같이 이동 로봇 상에 배치될 수 있다. 이동 로봇은 비전 이미지들을 기초로 물체의 위치를 획득한다(S200). 이동 로봇은 물체의 위치를 포함하는 맵 이미지를 생성한다(S300). 전술한 바에 의하면, 일반적인 카메라들만으로 왜곡 없이 물체의 위치를 정확히 획득할 수 있다는 장점이 있다. 도 8은 본 개시의 일부 실시예들에 따른 시스템을 설명하기 위한 도면이다. 도 8을 참조하면, 시스템은 이동 로봇, 복수의 카메라들(1000_1~1000_8), 및 트롤리(Trolley, 1000 0)를 포함할 수 있다. 이동 로봇 및 복수의 카메라들(1000_1~1000_8)은 도 1을 참조하여 전술한 바와 같다. 일부 실시예들에서, 복수의 카메라들(1000_1~1000_8)이, 제1 방향(D1) 및 제2 방향(D2)으로 이루어진 2차원 평 면으로부터 일정한 기울기를 갖도록, 이동 로봇 상에 기울어져 배치될 수 있다. 이 경우, 복수의 카메라들 (1000_1~1000_8)의 촬영 각도가, 제1 방향(D1) 및 제2 방향(D2)으로 이루어진 2차원 평면으로부터 일정한 각도 를 유지할 수 있으므로, 복수의 카메라들(1000_1~1000_8)에 의해 획득된 비전 이미지에서 바닥면이 포함되지 않 을 수 있다. 이에 따라, 복수의 카메라들(1000_1~1000_8)에 의해 획득된 비전 이미지에서 상대적으로 더 많은 정보들이 포함될 수 있다. 트롤리는 이동 로봇 및 복수의 카메라들(1000_1~1000_8) 상에서 운반하고자 하는 물품을 지지하는 받침대 및 받침대와 물리적으로 연결된 복수의 다리 부품들(10002~10005)을 포함할 수 있다. 복 수의 다리 부품들(10002~10005) 각각은 이동 로봇의 각 모서리 부근에 위치할 수 있다. 복수의 다리 부품 들(10002~10005)의 개수는 도 8에 도시된 바와 같이 4개일 수 있으나, 이에 한정되는 것은 아니며, 설계 방법에 따라 4개보다 작거나 4개보다 클 수 있다. 설명의 편의상 복수의 다리 부품들(10002~10005)의 개수는 4개인 것으로 가정한다. 이하에서는 이동 로봇 상에서 복수의 카메라들(1000_1~1000_8) 및 복수의 다리 부품들(10002~10005)이 배 치되는 배치 위치에 대한 설명이 후술된다. 도 9는 복수의 카메라들의 배치를 설명하기 위한 도 8의 시스템의 평면도이다. 도 9는 도 3에 도시된 바와 유사 하므로, 동일한 내용은 그 설명을 생략하기로 한다. 도 9를 참조하면, 제1 다리 부품은 제1 부분(P1) 근처에서 위치할 수 있다. 제1 다리 부품은, 제 3 카메라(1000_3) 및 제7 카메라(1000_7)에 의해서, 제4 사선 영역(DFR4) 내에 위치하는 물체로 감지될 수 있다. 제1 다리 부품은 제3 카메라(1000_3)와 제7 카메라(1000_7) 각각의 촬상 영역을 가리는 물체일 수 있다. 그러나, 제3 카메라(1000_3)와 제7 카메라(1000_7) 간의 거리가 충분히 멀리 이격되어 배치되어 있으므로, 제1 다리 부품에 의해 촬상 영역이 가려지는 문제가 최소화될 수 있다. 제2 다리 부품은 제2 부분(P2) 근처에서 위치할 수 있다. 제2 다리 부품은, 제1 카메라(1000_1) 및 제5 카메라(1000_5)에 의해서, 제1 사선 영역(DFR1) 내에 위치하는 물체로 감지될 수 있다. 제2 다리 부품 은 제1 카메라(1000_1)와 제5 카메라(1000_5) 각각의 촬상 영역을 가리는 물체일 수 있다. 그러나, 제1 카메라(1000_1)와 제5 카메라(1000_5) 간의 거리가 충분히 멀리 이격되어 배치되어 있으므로, 제2 다리 부품 에 의해 촬상 영역이 가려지는 문제가 최소화될 수 있다. 제3 다리 부품은 제3 부분(P3) 근처에서 위치할 수 있다. 제3 다리 부품은, 제4 카메라(1000_4) 및 제8 카메라(1000_8)에 의해서, 제1 사선 영역(DFR1) 내에 위치하는 물체로 감지될 수 있다. 제3 다리 부품 은 제4 카메라(1000_4)와 제8 카메라(1000_8) 각각의 촬상 영역을 가리는 물체일 수 있다. 그러나, 제4 카메라(1000_4)와 제8 카메라(1000_8) 간의 거리가 충분히 멀리 이격되어 배치되어 있으므로, 제3 다리 부품 에 의해 촬상 영역이 가려지는 문제가 최소화될 수 있다. 제4 다리 부품은 제4 부분(P4) 근처에서 위치할 수 있다. 제4 다리 부품은, 제2 카메라(1000_2) 및 제6 카메라(1000_6)에 의해서, 제1 사선 영역(DFR1) 내에 위치하는 물체로 감지될 수 있다. 제4 다리 부품 은 제2 카메라(1000_2)와 제6 카메라(1000_6) 각각의 촬상 영역을 가리는 물체일 수 있다. 그러나, 제2 카메라(1000_2)와 제6 카메라(1000_6) 간의 거리가 충분히 멀리 이격되어 배치되어 있으므로, 제4 다리 부품 에 의해 촬상 영역이 가려지는 문제가 최소화될 수 있다. 전술한 바에 의하면, 운반하고자 하는 물체를 지지하기 위한 트롤리가 시스템에 포함되더라도, 카메라들을 로봇 상에 적절히 배치함으로써, 트롤리의 다리 부품이 카메라의 촬상 영역을 가리는 것을 최소화하여 물체를 정확히 인식하는 장점이 있다. 또한, 전술한 바에 의하면, 운반하고자 하는 물체를 지지하기 위한 트롤리가 시스템에 포함되더라도, 카메라들 을 로봇 상에 적절히 배치함으로써, 트롤리의 다리 부품이 카메라의 촬상 영역을 가리는 것을 최소화하여 정확 한 맵 이미지를 생성할 수 있다는 장점이 있다. 한편, 개시된 실시예들은 컴퓨터에 의해 실행 가능한 명령어를 저장하는 기록매체의 형태로 구현될 수 있다. 명 령어는 프로그램 코드의 형태로 저장될 수 있으며, 프로세서에 의해 실행되었을 때, 프로그램 모듈을 생성하여 개시된 실시예들의 동작을 수행할 수 있다. 기록매체는 컴퓨터로 읽을 수 있는 기록매체로 구현될 수 있다. 컴퓨터가 읽을 수 있는 기록매체로는 컴퓨터에 의하여 해독될 수 있는 명령어가 저장된 모든 종류의 기록 매체 를 포함한다. 예를 들어, ROM(Read Only Memory), RAM(Random Access Memory), 자기 테이프, 자기 디스크, 플 래쉬 메모리, 광 데이터 저장장치 등이 있을 수 있다."}
{"patent_id": "10-2022-0128389", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "이상에서와 같이 첨부된 도면을 참조하여 개시된 실시예들을 설명하였다. 본 개시가 속하는 기술분야에서 통상 의 지식을 가진 자는 본 개시의 기술적 사상이나 필수적인 특징을 변경하지 않고도, 개시된 실시예들과 다른 형 태로 본 개시가 실시될 수 있음을 이해할 것이다. 개시된 실시예들은 예시적인 것이며, 한정적으로 해석되어서 는 안 된다."}
{"patent_id": "10-2022-0128389", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 예시적인 실시예들에 따른 시스템을 설명하기 위한 도면이다. 도 2는 복수의 카메라들의 배치를 설명하기 위한 도 1의 시스템의 평면도이다. 도 3은 본 개시의 일 실시예에 따라 배치된 복수의 카메라들의 촬상 영역들을 설명하기 위한 도면이다. 도 4는 본 개시의 다른 실시예들에 따라 배치된 복수의 카메라들의 촬상 영역들을 설명하기 위한 도면이다. 도 5는 본 개시의 예시적인 실시예들에 따른 시스템의 블록도이다. 도 6은 본 개시의 예시적인 실시예들에 따른 이동 로봇의 블록도이다. 도 7은 본 개시의 예시적인 실시예들에 따른 시스템의 방법을 설명하기 위한 흐름도이다. 도 8은 본 개시의 일부 실시예들에 따른 시스템을 설명하기 위한 도면이다. 도 9는 복수의 카메라들의 배치를 설명하기 위한 도 8의 시스템의 평면도이다."}
