{"patent_id": "10-2023-0133387", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0050403", "출원번호": "10-2023-0133387", "발명의 명칭": "고객 리뷰 데이터 기반 검색결과 제공 시스템", "출원인": "주식회사 히어로웍스", "발명자": "이창주"}}
{"patent_id": "10-2023-0133387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "고객의 리뷰 데이터에 대한 학습 및 분석을 수행하는 AI 분석부; 상기 AI 분석부의 분석 결과를 저장하는 저장부; 및잠재 고객의 요청 정보에 대응되는 추천 시설에 대한 정보를 제공하는 서비스 제공부를 포함하는 고객 리뷰 데이터 기반 검색결과 제공 시스템."}
{"patent_id": "10-2023-0133387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 AI 분석부는 OTA에 저장된 기존 고객의 숙박 시설에 대한 리뷰 데이터를 이용하여 학습을 수행하고, 상기리뷰 데이터에 대한 분석을 수행하여 상기 분석 결과를 생성하는 것인 고객 리뷰 데이터 기반 검색결과 제공 시스템."}
{"patent_id": "10-2023-0133387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 AI 분석부는 상기 리뷰 데이터에 포함되는 리뷰 원문을 학습하고, 상기 분석을 수행한 결과에 따라 해당숙박시설의 특징 정보를 생성하는 것인 고객 리뷰 데이터 기반 검색결과 제공 시스템."}
{"patent_id": "10-2023-0133387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 AI 분석부는 상기 학습의 결과를 이용하여, 상기 해당 숙박시설의 이용 형태, 보유시설, 주변 인프라, 서비스, 청결도를 포함하는 항목 별로 상기 리뷰 데이터를 분류하고, 상기 항목 별로 긍정, 부정, 중립의 감성을분석하는 것인 고객 리뷰 데이터 기반 검색결과 제공 시스템."}
{"patent_id": "10-2023-0133387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서, 상기 AI 분석부는 상기 리뷰 데이터에 포함되는 이미지 정보의 포커스 정보, 중심 영역에 포함된 객체 정보를이용하여 상기 해당 숙박시설의 특징 정보를 생성하는 것인 고객 리뷰 데이터 기반 검색결과 제공 시스템."}
{"patent_id": "10-2023-0133387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2025-0050403-3-제3항에 있어서, 상기 AI 분석부는 상기 해당 숙박시설의 동일 시설물에 대한 상이한 평가가 존재하는 복수의 리뷰 데이터에 대해 그룹핑하여 분석을 수행하는 것인 고객 리뷰 데이터 기반 검색결과 제공 시스템."}
{"patent_id": "10-2023-0133387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 상기 저장부는 시설의 명칭, 주소, 이용 가격, 시설 종류를 포함하는 기초 정보와 상기 분석 결과를 결합하여저장하는 것인 고객 리뷰 데이터 기반 검색결과 제공 시스템."}
{"patent_id": "10-2023-0133387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 서비스 제공부는 상기 잠재 고객으로부터 수신한 텍스트를 분석하여 상기 요청 정보를 도출하고, 상기 요청 정보에 대응되는 상기 추천 시설에 대한 정보를 생성하는 것인 고객 리뷰 데이터 기반 검색결과 제공 시스템."}
{"patent_id": "10-2023-0133387", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 고객 리뷰 데이터 기반 검색 결과 제공 시스템에 관한 것으로, 보다 상세하게는 숙박시설에 대한 리뷰 데이터를 수집하고, 인공지능을 이용하여 이를 분석하여, 고객이 원하는 숙박시설 정보를 제공하는 시스템에 관 한 것이다. 본 발명에 따른 고객 리뷰 데이터 기반 검색결과 제공 시스템은 고객의 리뷰 데이터에 대한 학습 및 분석을 수행 하는 AI 분석부와, AI 분석부의 분석 결과를 저장하는 저장부 및 잠재 고객의 요청 정보에 대응되는 추천 시설에 대한 정보를 제공하는 서비스 제공부를 포함한다."}
{"patent_id": "10-2023-0133387", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 고객 리뷰 데이터 기반 검색 결과 제공 시스템에 관한 것으로, 보다 상세하게는 숙박시설에 대한 리 뷰 데이터를 수집하고, 인공지능을 이용하여 이를 분석하여, 고객이 원하는 숙박시설 정보를 제공하는 시스템에 관한 것이다."}
{"patent_id": "10-2023-0133387", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "고객의 숙박시설 예약 시, 온라인 여행사(OTA)를 통해 예약하는 경우가 증가되고 있다. 고객은 OTA에서 자신이 원하는 숙박시설을 검색하기 위해, 가격, 위치, 숙박시설 명칭 등 기초 정보를 활용한다. 기초 정보만으로는 숙박시설의 구체적인 특징이나 서비스 만족도 등 다양한 정보를 알 수 없기에, 고객은 자신 보다 먼저 해당 숙박시설을 이용한 고객이 남긴 이용 후기를 참고하는 경우가 많다. 종래 기술에 따른 OTA는 리뷰 검색 등 리뷰 정보를 참고하기 위한 편의 기능을 제공하고 있지 않아, 고객이 원 하는 숙박시설을 예약하는 검색 과정에 상당한 노력과 시간이 소요되고 있다."}
{"patent_id": "10-2023-0133387", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술한 문제점을 해결하기 위해 제안된 것으로, 숙박시설 리뷰 데이터 학습을 수행하여 숙박시설의 강점, 약점, 선호되는 시설, 특징을 분석할 수 있는 AI 모델을 구축하여 숙박시설의 특징을 파악하고, 숙박시설 을 이용하고자 하는 고객이 원하는 특징과 유사한 특징 정보를 가진 숙박시설을 추천하는 것이 가능한 고객 리 뷰 데이터 기반 검색결과 제공 시스템을 제안한다."}
{"patent_id": "10-2023-0133387", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명은 고객 리뷰 데이터 기반 검색 결과 제공 시스템에 관한 것으로, 보다 상세하게는 숙박시설에 대한 리 뷰 데이터를 수집하고, 인공지능을 이용하여 이를 분석하여, 고객이 원하는 숙박시설 정보를 제공하는 시스템에 관한 것이다. 본 발명에 따른 고객 리뷰 데이터 기반 검색결과 제공 시스템은 고객의 리뷰 데이터에 대한 학습 및 분석을 수 행하는 AI 분석부와, AI 분석부의 분석 결과를 저장하는 저장부 및 잠재 고객의 요청 정보에 대응되는 추천 시 설에 대한 정보를 제공하는 서비스 제공부를 포함한다. 상기 AI 분석부는 OTA에 저장된 기존 고객의 숙박 시설에 대한 리뷰 데이터를 이용하여 학습을 수행하고, 상기 리뷰 데이터에 대한 분석을 수행하여 상기 분석 결과를 생성한다. 상기 AI 분석부는 상기 리뷰 데이터에 포함되는 리뷰 원문을 학습하고, 상기 분석을 수행한 결과에 따라 해당 숙박시설의 특징 정보를 생성한다. 상기 AI 분석부는 상기 학습의 결과를 이용하여, 상기 해당 숙박시설의 이용 형태, 보유시설, 주변 인프라, 서 비스, 청결도를 포함하는 항목 별로 상기 리뷰 데이터를 분류하고, 상기 항목 별로 긍정, 부정, 중립의 감성을 분석한다. 상기 AI 분석부는 상기 리뷰 데이터에 포함되는 이미지 정보의 포커스 정보, 중심 영역에 포함된 객체 정보를 이용하여 상기 해당 숙박시설의 특징 정보를 생성한다. 상기 AI 분석부는 상기 해당 숙박시설의 동일 시설물에 대한 상이한 평가가 존재하는 복수의 리뷰 데이터에 대 해 그룹핑하여 분석을 수행한다. 상기 저장부는 시설의 명칭, 주소, 이용 가격, 시설 종류를 포함하는 기초 정보와 상기 분석 결과를 결합하여 저장한다. 상기 서비스 제공부는 상기 잠재 고객으로부터 수신한 텍스트를 분석하여 상기 요청 정보를 도출하고, 상기 요 청 정보에 대응되는 상기 추천 시설에 대한 정보를 생성한다."}
{"patent_id": "10-2023-0133387", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, OTA를 통해 숙박시설을 이용하고자 하는 고객이 OTA에서 제공하는 숙박시설에 대한 기초 정 보를 활용함에 그치지 않고, 고객 리뷰 데이터 기반의 검색 결과를 활용하여 자신이 원하는 특징을 가진 숙박시 설을 편리하게 검색하고 예약할 수 있어, 종래 기술에 따른 OTA의 검색 기능의 한계를 극복하는 것이 가능하다."}
{"patent_id": "10-2023-0133387", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과는 이상에서 언급한 것들에 한정되지 않으며, 언급되지 아니한 다른 효과들은 아래의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0133387", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 전술한 목적 및 그 이외의 목적과 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있"}
{"patent_id": "10-2023-0133387", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "으며, 단지 이하의 실시예들은 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 발명의 목적, 구성 및 효과를 용이하게 알려주기 위해 제공되는 것일 뿐으로서, 본 발명의 권리범위는 청구항의 기재에 의해 정의 된다. 한편, 본 명세서에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함한 다(comprises)\" 및/또는 \"포함하는(comprising)\"은 언급된 구성소자, 단계, 동작 및/또는 소자가 하나 이상의 다른 구성소자, 단계, 동작 및/또는 소자의 존재 또는 추가됨을 배제하지 않는다. 본 발명의 실시예에 따르면, 고객의 리뷰 데이터를 기반으로 중소 규모의 숙박시설의 운영 효율화를 지원하기 위해, 고객의 리뷰에 포함된 문제점을 분석하고 해당 리뷰에 대해 답글을 자동 제공하며, 분석된 문제점을 개선 하기 위한 해결책을 제공하여 이를 숙박시설 운영에 적용한다. 본 발명의 실시예에 따르면, 대형 호텔에서는 가능하지만 중소형 호텔에서는 제공하고 있지 못한, 리뷰에 대한 답글이라는 고객 관리 서비스를 학습 기반으로 자동 제공할 수 있도록 함으로써, 대형 호텔과 중소형 호텔의 서 비스 퀄리티의 간극을 줄이는 것이 가능하다. 도 1은 본 발명의 실시예에 따른 리뷰 데이터 학습 기반 자동 리뷰 대응 시스템, OTA 서버 및 호텔 관리자 단말 을 도시한다. 본 발명의 실시예에 따른 자동 리뷰 대응 시스템은 OTA 서버로부터 리뷰 데이터를 수집하는 수집부 , 해당 리뷰 데이터를 저장하는 저장부, 해당 리뷰 데이터를 학습하고 분석하는 분석부, 분석 결과를 OTA 서버 및 호텔 관리자 단말에 전달하는 전달부를 포함한다. 본 발명의 실시예에 따르면, 숙박시설의 리뷰 데이터를 수집하고 이를 인공지능으로 분석 및 가공하여 호텔 운 영에 활용하며, 고객에게 제공할 해당 리뷰에 대한 답글을 자동 작성하여 제공한다. 수집부는 HTML의 URL을 통해 지정된 페이지에서 페이지 파싱(Parsing)과 크롤링(Crawling)을 통해, 개별 호텔 별로 리뷰 데이터를 수집한다. 저장부는 개별 호텔 별로 수집된 리뷰 데이터를 데이터베이스에 저장한다. 분석부는 인공지능 엔진을 이용하여, 리뷰 데이터에 대해 메타 데이터 분석을 수행한다. 전달부는 분석된 데이터(분석 결과)를 OTA 서버와 호텔 운영자에게 전달하고, 분석 결과는 리뷰에 대응하 는 답글 데이터를 포함한다. 본 발명의 실시예에 따르면, 크롤러를 통해 수집된 개별 숙박시설의 리뷰 데이터와 보유시설, 주변 상권 특성 등의 시설 정보를 인공지능 엔진이 학습하고, 이를 호텔 별 답글 작성에 활용하며, 리뷰 데이터에 대한 분석 결 과를 예약실, 관리자 및 전담 업체 등에 전달함으로써, 고객 리뷰에 대한 후속 조치에 활용한다. 개별 호텔은 각각의 특성(역사 근처의 호텔은 교통 편의성이 높지만 소음이 심하고, 유명 관광지에 인접한 호텔 은 타 지역으로부터 관광 여행을 온 고객이 많으니 주변 맛집 소개가 필요하다는 등의 특성)에 따라, 리뷰 데이 터의 성격이 상이하다. 분석부는 이러한 개별 호텔 각각의 특성 정보를 반영하여, 리뷰 데이터 분석 및 해 당 리뷰에 대한 답글 자동 작성을 수행한다. 분석부는 개별 호텔의 리뷰 데이터 및 특성 정보를 학습하여, 해당 호텔의 특성에 부합되는 답글 및 추천 운영 방안 정보를 생성하고 제공한다. 도 2는 본 발명의 실시예에 따른 리뷰 데이터 학습 기반 자동 리뷰 대응 시스템의 데이터 수집 및 저장의 일부 과정을 도시한다. OTA 서버에는 복수의 서버, 즉 제1 OTA 서버(100a), 제2 OTA 서버(100b), 쪋, 제n OTA 서버(100n)가 포함 된다. 수집부에 포함되는 통신 모듈은 OTA 서버로 고객의 리뷰 데이터를 요청하고, OTA 서버로부 터 고객의 리뷰 데이터를 수신하여 수집한다. 이 때, 통신 모듈은 고객의 리뷰 데이터 외에, 개별 호텔의 특성 정보(주변에 지상 선로가 존재하는지, 유명 관광지로부터 기설정 거리 내에 위치하는지, 기설정 거리 내에 서 지역 축제가 열리고 있는 기간인지 여부 등)를 수집한다. 수집부에 포함되는 통신 모듈은 저장부의 데이터 관리 모듈로 고객의 리뷰 데이터, 개별 호텔의 특성 정보, 주변 정보를 전송한다. 저장부에 포함되는 데이터 관리 모듈은 전송된 데이터를 분류하여 데이터베이스에 저장하며, 데이터 분류에는 가격 데이터, 리뷰 데이터, 축제 데이터, 날씨 데이터, 분석된 리뷰 데이터가 포함된다. 분석된 리뷰 데이터는 분석부로부터 수신한 고객 리뷰에 대한 분석 데이터로서, 해당 데이터 역시 데이터 베이스에 저장되어 재학습 및 자동 답글 작성에 활용된다. 도 3은 본 발명의 실시예에 따른 리뷰 데이터 학습 기반 자동 리뷰 대응 시스템의 저장부, 분석부, 전달부와, OTA 서버 및 호텔 관리자 단말의 정보 송수신 과정을 도시한다. 데이터 관리 모듈은 분석부로 고객의 리뷰 데이터를 전송한다. 분석부는 리뷰 데이터 분석 모듈, 답글 작성 모듈, 전송 모듈을 포함한다. 분석부에 의해 수행된 분석 결과인 분석 데이터, 답글은 저장부로 전송되고, 저장부는 이를 전달부로 전 송한다. 분석부에 포함되는 답글 작성 모듈은 개별 호텔의 특성 정보와, 리뷰 데이터 분석 모듈로부터 수신된 분석 결과를 종합적으로 고려하여, 해당 고객 리뷰에 답글로 달릴 텍스트 및 이모티콘에 대한 자동 작성 을 수행한다. 예컨대, 자동 답글 작성에 있어 고려 대상 요소로, <격식>, <친밀도>, <공감>, <문제 해결책>, <리워드 부여> 등의 팩터를 고려함을 가정한다. 개별 호텔 A의 경우 그 분류가 게스트하우스에 속하며, 대학생 등 20대 초반의 연령대가 주로 이용하는 시설인 경우를 가정하고, 개별 호텔 B의 경우 5성급 호텔로서 40대 이상의 연령대가 주로 이용하는 시설인 경우를 가정 한다. 답글 작성 모듈은 <격식> 팩터를 고려하여, 답글 작성의 <친밀도>가 기설정 수치 이상이 되도록 답글 작성 스탠스를 결정하고, 그에 따른 답글 텍스트를 작성한다. 개별 호텔 A와 개별 호텔 B의 <격식> 팩터 지수가 기설정 수치 이상인 경우, 답글 작성의 <친밀도>의 차이가 기 설정 수치 이상이 되도록 답글 작성 스탠스를 상이하게 결정한다. 답글 내 이모티콘 사용 여부, ~, !, 쪋, ^^, ㅠㅠ의 사용 여부 등이 결정될 수 있다. 개별 호텔 A와 개별 호텔 B의 <격식> 팩터 지수가 기설정 수치 이상인 경우, 답글 작성의 <공감>의 차이가 기설 정 수치 이상이 되도록 답글 작성 스탠스를 상이하게 결정한다. 예컨대 개별 호텔 A의 사용자가 <2층 침대가 불 편했어요>라는 요지의 리뷰 데이터를 남긴 경우, 그리고 개별 호텔 B의 사용자가 <매트리스가 다소 딱딱한 듯> 이라는 요지의 리뷰 데이터를 남긴 경우를 가정한다. 고객의 성별, 연령대, 리뷰 데이터 분석 결과에 포함되는 고객 불만족 정도 및 시급한 시정 대상 분류 여부를 종합적으로 고려하여, 자동 작성되는 답글의 <공감> 수치를 결정하도록 답글 작성 스탠스를 결정한다. 개별 호텔 A의 2층 침대의 2층을 사용한 사용자에게는 <2층 침대로 올라가는 사다리가 좁고 올라가고 내려오는 과정을 여러 번 하셔야 해서 불편하셨겠다>는 취지의 공감에 대한 문구가 포함되도록, 2층 침대의 1층을 사용한 사용자에게는 <저희 2층 침대가 목재 침대이다 보니, 2층에 있는 사용자의 작은 뒤척임에도 삐걱거리는 소리가 크게 들려 불편하셨겠다>는 취지의 공감에 대한 문구가 포함되도 록, 답글 작성 스탠스를 결정한다. 개별 호텔 B의 사용자에게는, <저희 B 호텔은 최고급 ~소재를 이용한 매트리 스를 고객님들께 제공하고 있으나, ~한 경우 다소 강도가 딱딱하게 느껴지셨을 수 있겠다. 하지만 소중한 의견 주신 만큼, OO사 매트리스로의 교체도 고려 중에 있으며, 다음 번에 투숙하실 때 사전에 코멘트를 주시면, OO 사 매트리스로 리뉴얼한 객실로 예약을 도와드릴 수 있도록 하겠다>는 취지의 <공감> 지수에 대한 자동 답글 작성 스탠스를 결정한다. <공감> 지수에 대한 자동 답글 작성 스탠스는 결국 <문제 해결책>, <리워드 부여> 지수 에 대한 개별 호텔의 자본력 등에 있어서도 고려하여야 할 요소이므로, 고객의 불만사항에 대해 적극적으로 공 감하되, 위로의 문구를 제공하는 것 정도로 스탠스를 정할 것인지, 해당 고객의 등급(1년에 4박 이상 방문하는 고객으로 고객 등급이 골드 등급 이상인 경우)에 따라 어느 정도의 투입 자본이 발생하더라도 적극적인 문제 해 결 방안에 좀 더 가중치를 둘 것인지 여부를 결정할 수 있다. 답글 작성 모듈은 리뷰 데이터 분석 모듈로부터 수신한 고객 리뷰 데이터 중 불만 데이터에 대한 분 류 요소를 토대로, 자동 답글 작성 스탠스를 결정한다. 예컨대, 고객 리뷰 데이터에 <ㅠㅠ, ㅜㅜ, ~용, ~했는뎅> 등의 문구가 포함되는 경우, <고객 친밀도> 지수에 기설정 수치 이상의 상승 가중치를 적용하여 자동 답글 작성 스탠스를 결정하여, 딱딱한 사무적인 말투보다는 친밀도가 느껴지는 자동 답글이 작성되도록 한다. 고객 리뷰 데이터에 <중엄하게, 엄중하게, 최고 관리자, 책임, 배상, 보상>등의 문구가 포함되는 경우, <고객 친밀도> 지수에 기설정 수치 이상의 하강 가중치를 적용하여 자동 답글 작성 스탠스를 결정하여, 전문적이고 사 무적인 말투의 자동 답글이 작성되도록 한다. 답글 작성 모듈은 경우에 따라, 고객 리뷰 데이터의 생성 전, 사전 안내 문구를 작성할 수 있다. 예컨대, 호텔 주변에 공사가 진행 중이어서, 자차로 이동한 고객이 주차장 진출입에 불편을 느꼈을 것으로 예상되는 경 우, <~월 ~일부터 진행된 지하철 역사 신축 공사로 인해, OOO어OOOO 차량을 이용하신 고객님의 불편이 있지는 않으셨는지요. 공사로 인한 불편 이외에 다른 불편함이 있으셨다면 리뷰 데이터 또는 저희 호텔 데스크로 남겨 주시면, 고객님의 말씀 귀담아 듣도록 하겠습니다>등의 사전 안내 문구를 제공하는 것이 가능하다. 사전 안내 문구는 푸쉬 알람 등을 통해, 고객의 단말로 제공될 수 있다. 즉, 고객의 불만이 담긴 리뷰 데이터에 대해 자동 답글로 대응하는 것 외에, 선제적으로 예상되는 고객 불만사 항에 대한 위로, 감사 문구를 포함한 사전 안내 문구를 제공할 수 있다. 이 때, 답글 작성 모듈은 사전에 남겨진 다른 고객들의 SNS 후기 데이터, 리뷰 데이터 등을 크롤링하여 분 석한 결과와, 해당 고객의 성별, 연령대, 시설 이용 여부, 동일 투숙 기간 접수된 다른 고객의 불만사항 정보 등을 종합적으로 고려하여, 사전 안내 문구를 제공한다. 예를 들어, 동일 투숙 기간 중 다른 고객의 불만사항 정보 중, 해당 고객도 동일하게 불편함을 겪었을 것으로 예상되는 정보(예: 불만사항이 조식 대기 줄이 길었다는 것이고, 해당 고객이 조식을 이용한 경우)인 경우, 해 당 내용을 사전 안내 문구에 적용하도록 하고, 동일 투숙 기간 중 다른 고객의 불만사항 정보 중, 해당 고객도 동일하게 불편함을 겪지는 않았을 것으로 예상되는 정보(예: 불만사항이 조식 대기 줄이 길었다는 것이나, 해당 고객이 조식을 이용하지 않은 경우)인 경우, 해당 내용을 사전 안내 문구에 적용하지 않도록 한다. 또 다른 예 로서, 동일 투숙 기간 중 다른 고객의 불만사항 정보 중, 해당 고객도 동일하게 불편함을 겪지는 않았을 것으로 예상되는 정보(예: 불만사항이 조식 대기 줄이 길었다는 것이나, 해당 고객이 조식을 이용하지 않은 경우)임에 도 불구하고, 사전의 다른 구매자들의 리뷰 데이터에 조식 줄이 길다 등의 이유로 해당 고객이 조식을 이용하지 않았을 수도 있으므로, 기존 리뷰 데이터의 분석 결과를 토대로, <OOO 고객님, 1박 2일의 일정은 편안하셨는지 요. 저희 AAA 호텔에서는 저희 지역의 특산물인 BBB를 활용한 CCC 메뉴를 주 메뉴로 하는 조식 서비스를 제공 드리고 있습니다만, 금번에는 조식 서비스를 이용하지 않으셨던 것으로 확인됩니다. 대기 줄이 길다는 다른 고 객님들의 불편사항 해결을 위해, 조식 서비스 동선을 개선하여 운영 중에 있사오니, 다음 번에 방문하시는 경우 에는 저희 조식 서비스를 한번 이용해보시는 것을 추천 드립니다. 특별 프로모션으로 3개월 이내에 재방문하시 어 조식 서비스 이용시, OO% 할인 혜택을 제공드리오니 참고 부탁 드립니다. 감사합니다.>의 사전 안내 문구를 작성하여 제공하도록 자동 답글 작성 스탠스를 결정할 수 있다. 전달부는 답글 전달 모듈 및 분석 내용 전달 모듈을 포함한다. 답글 전달 모듈은 자동 작 성된 특정 리뷰에 대한 답글을 OTA 서버로 전송하여, 리뷰 데이터에 답글이 게시되도록 한다. 분석 내용 전달 모듈은 고객 리뷰 데이터에 대한 분석 결과를 호텔 관리자 단말로 전송한다. 호텔 관리자 단말은 추천 청소 업체 판단 모듈과 추천 FnB 업체 판단 모듈을 포함한다. 전달부로부터 수신한 리뷰 데이터 분석 내용 중, 객실의 청결도 문제가 발생한 경우, 추천 청소 업체 판단 모듈이 호출되어, 크롤링한 데이터를 기반으로 청소 업체에 대한 추천 정보를 생성하여, 호텔 관리자에게 제공한다. 전달부로부터 수신한 리뷰 데이터 분석 내용 중, 조식, 룸서비스 등의 음식 또는 카페에서의 응대 문제가 발생한 경우, 추천 FnB 업체 판단 모듈이 호출되어, 크롤링한 데이터를 기반으로 FnB 업체에 대한 추천 정보를 생성하여, 호텔 관리자에게 제공한다. 본 발명의 실시예에 따르면, 개별 호텔의 특성 정보, 고객의 리뷰 데이터, 추천 청소 업체 정보 생성, 추천 FnB 업체 정보 생성 등을 위해, 중계 서버를 구축하여 데이터 크롤링을 수행한다. 데이터 수집을 위해, 안정적인 프 록시의 확보가 요구된다. 그런데, 고정된 IP 어드레스를 이용하여 각 사이트마다 특정 조건 이상으로 수집을 수 행하는 경우, IP 어드레스에 대해 밴이 되는 경우가 발생할 수 있다. 유통 IP 어드레스의 경우 수집 목적 달성 을 위해 유리한 면이 있으므로, 본 발명의 실시예에 따르면 크롤링 과정에서 유동 IP 어드레스를 가지는 디바이 스의 그룹으로 형성되는 중계 서버를 이용한다. 본 발명의 실시예에 따르면, 개별 호텔의 특성 정보 수집, 고객의 리뷰 데이터 수집, 추천 청소 업체 정보 생성, 추천 FnB 업체 정보 생성을 위한 목적 별로, 해당 데이터 수집을 수행할 디바이스의 그룹을 생성하고, 그 룹을 해제하고 재설정(리그룹핑)하는 과정이 수행된다. 관리 모듈은 그룹에 편입되는 디바이스 및 그룹으로부터 퇴출되는 디바이스의 정보를 이용하여, 중계 서버에 대 한 등록 현황을 관리한다. 관리 모듈은 그룹핑된 디바이스의 통신 로드를 모니터링하여, 크롤링 요청에 따라 데이터 수집을 수행할 적어도 하나 이상의 디바이스를 중계 서버 내에 하위 그룹핑한다. 관리 모듈은 현재 다른 크롤링 요청에 따라 데이터 수집 요청을 수행하고 있는 디바이스의 태스크 완료 예상 시 점을 고려하여, 디바이스에 대한 하위 그룹핑을 수행하고, 추가로 디바이스의 스펙이 필요한 경우 하위 그룹에 대한 추가 디바이스의 인입을 요청한다. 관리 모듈은 데이터 수집 요청의 특성(긴급성, 정보 수집 대상의 시계열적 특성)을 고려하여, 기존에 제1 데이 터 수집 요청에 따라 태스크를 수행하고 있는 제1 하위 그룹과, 새로운 제2 데이터 수집 요청에 따라 태스크를 수행할 제2 하위 그룹을 통합하여, 일정 기간 동안 제2 데이터 수집 요청에 따른 태스크를 집중적으로 수행하고, 그 이후에는 제1 및 제2 하위 그룹으로 리그룹핑하여 각각의 기존 태스크를 수행하도록 제어한다. 제1 하위 그룹이 수집하고자 하는 데이터는 실시간 수집에 대한 필요성이 기설정 수치 이하인 경우( \"1일 누적 데이터 수집: 매일 22시부터 24시까지 1일 동안의 누적 데이터 집계\"가 요청 사항이므로, 데이터 수집을 위한 구동 필요 시간대가 1일 기준 1/12인 경우), 제1 하위 그룹을 일시적으로 활용하여 다른 데이터의 수집 용도로 활용하는 것이 가능하다. 이 때, 제1 하위 그룹은 새로운 제2 데이터 수집 요청에 따라 태스크를 수행할 통합 그룹으로 편입되어, 기설정된 기간 동안은 제2 데이터 수집을 수행하고, 그 외 기간에는 본래의 제1 데이터 수 집 요청에 따른 태스크를 수행한다. 관리 모듈은 중계 서버의 관리를 위해, 새로운 디바이스의 그룹 내 편입 시, 예비 그룹을 운영한다. 관리 모듈은 중계 서버 내 디바이스 각각의 통신 현황을 모니터링하고, 데이터 수집 요청을 전달하여 그 태스크 를 수행할 모바일 디바이스를 지정하여야 하는 바, 모니터링 및 지정에 소요되는 연산 로드(load)를 함께 모니 터링한다. 관리 모듈은 모니터링 대상 디바이스의 개수가 많아질수록 모니터링 및 지정에 소요되는 연산 로드(load)가 커 지므로, 새로운 디바이스의 그룹 내 편입 허가에 있어서, 모니터링 및 지정에 소요되는 연산 로드를 고려하여 허가 시점을 결정한다. 중계 서버 내 디바이스의 통신 현황 모니터링 및 지정에 소요되는 연산 부하량이 1임을 기준으로 하였을 때, 새 로이 편입되는 디바이스 n개가 추가되면 통신 현황 모니터링 및 지정에 소요되는 연산 부하량이 2가 되는 것으 로 판단한 경우, 연산 부하량의 증가는 100%가 된다. 이 때, 현재 수신되고 있는 데이터 수집 요청의 증감 수치를 고려하여, 연산 부하량의 증가에도 불구하고 새로 이 편입되는 디바이스 n개를 즉시 그룹 내로 편입되도록 허가하여야 하는 경우, 디바이스 n개를 즉시 그룹 내로 편입시킨다. 반면, 현재 수신되고 있는 데이터 수집 요청의 증감 수치를 고려하여 볼 때, 현 시점에서 새로운 모바일 디바이 스 n개를 편입시킬 필요가 없다고 판단되는 경우에는, 예비 그룹을 운영/관리함으로써, 추후 필요에 따라 즉시 중계 서버의 그룹 내로 편입될 수 있도록 대비한다. 관리 모듈은 중계 서버 내에서 복수의 계층으로 그룹을 관리하여, 타겟 웹사이트에 대해 데이터를 수집하는 태 스크를 우선 지정하는 제1 그룹, 태스크를 우선 지정하지 않고 데이터 수집 요청 특성(수집 대상 데이터의 양,수집 기간 등)을 고려하여 예비적으로 구비하는 제2 그룹, 새로운 디바이스의 편입 시에 전술한 예비 그룹 등으 로 계층화하여 그룹을 관리함으로써, 중계 서버에 대한 관리를 효율적으로 수행하는 것이 바람직하다. 도 4는 본 발명의 실시예에 따른 리뷰 데이터 학습 기반 자동 리뷰 대응 방법을 도시한다. 본 발명의 실시예에 따른 리뷰 데이터 학습 기반 자동 리뷰 대응 방법은 개별 호텔 특성 정보, 주변 정보 및 리 뷰 데이터를 수집하는 단계(S410)와, 리뷰 데이터를 분석하고 자동 답글을 작성하는 단계(S420) 및 자동 답글 정보를 전송하고, 리뷰 데이터를 호텔 운영에 반영하는 단계(S430)를 포함한다. S410 단계에서, 수집부는 HTML의 URL을 통해 지정된 페이지에서 페이지 파싱(Parsing)과 크롤링 (Crawling)을 통해, 개별 호텔 별로 리뷰 데이터를 수집한다. S410 단계에서, 개별 호텔의 각각의 특성(역사 근 처의 호텔은 교통 편의성이 높지만 소음이 심하고, 유명 관광지에 인접한 호텔은 타 지역으로부터 관광 여행을 온 고객이 많으니 주변 맛집 소개가 필요하다는 등의 특성)을 포함하는 개별 호텔 특성 정보를 수집한다. S410 단계에서, 주변 정보로는 주변 축제 정보, 날씨 정보 등을 포함하는 주변 정보를 수집한다. S420 단계에서, 인공지능 엔진을 이용하여, 리뷰 데이터에 대해 메타 데이터 분석을 수행한다. S420 단계에서, 개별 호텔의 특성 정보, 주변 정보, 리뷰 데이터 분석 결과를 토대로 자동 답글 작성의 스탠스를 결정한다. 이 때, 자동 답글 작성 스탠스 결정에 있어, <격식>, <친밀도>, <공감>, <문제 해결책>, <리워드 부여> 등의 팩터 를 고려한다. S420 단계에서, 동일한 사용자의 A호텔, B 호텔, C 호텔에 대한 리뷰는 복수의 OTA 서버로 공유가 이루어진다. 따라서, 해당 리뷰들에 대한 분석 결과를 토대로, 해당 사용자가 블랙컨슈머에 해당되는지 여부에 대한 판단 결 과가 복수의 OTA 서버와 호텔 운영자 단말로 공유되며, 그에 따라 자동 답글 작성 스탠스가 결정되며, 리워드 부여 여부에 대한 판단이 수행될 수 있다. S420 단계에서, 다른 고객들의 리뷰 데이터 분석 결과를 토대로, 해당 고객의 리뷰가 남겨지기 전, 사전 안내 문구를 생성하여 제공한다. 고객의 불만이 담긴 리뷰 데이터에 대해 자동 답글로 대응하는 것 외에, 선제적으로 예상되는 고객 불만사항에 대한 위로, 감사 문구를 포함한 사전 안내 문구를 제공한다. 이 때, 사전에 남겨진 다른 고객들의 SNS 후기 데이터, 리뷰 데이터 등을 크롤링하여 분석한 결과와, 해당 고객의 성별, 연령대, 시설 이용 여부, 동일 투숙 기간 접수된 다른 고객의 불만사항 정보 등을 종합적으로 고려하여, 사전 안내 문구를 생 성한다. S430 단계에서, 리뷰 데이터 분석 내용 중, 객실의 청결도 문제가 발생한 경우, 추천 청소 업체 판단 모듈을 호 출하여, 추천 청소 업체 판단 결과를 호텔 운영에 반영한다. S430 단계에서, 리뷰 데이터 분석 내용 중, 조식, 룸서비스 등의 음식 또는 카페에서의 응대 문제가 발생한 경 우, 추천 FnB 업체 판단 모듈을 호출하여, 추천 FnB 업체 판단 결과를 호텔 운영에 반영한다. 도 5는 본 발명의 실시예에 따른 방법을 구현하기 위한 컴퓨터 시스템을 나타낸 블록도이다. 도 5를 참조하면, 컴퓨터 시스템은, 버스를 통해 통신하는 프로세서, 메모리, 입력 인 터페이스 장치, 출력 인터페이스 장치, 및 저장 장치 중 적어도 하나를 포함할 수 있다. 컴 퓨터 시스템은 또한 네트워크에 결합된 통신 장치를 포함할 수 있다. 프로세서는 중앙 처리 장치(central processing unit, CPU)이거나, 또는 메모리 또는 저장 장치에 저장된 명령을 실행하 는 반도체 장치일 수 있다. 메모리 및 저장 장치는 다양한 형태의 휘발성 또는 비휘발성 저장 매체 를 포함할 수 있다. 예를 들어, 메모리는 ROM(read only memory) 및 RAM(random access memory)를 포함할 수 있다. 본 기재의 실시예에서 메모리는 프로세서의 내부 또는 외부에 위치할 수 있고, 메모리는 이미 알려진 다 양한 수단을 통해 프로세서와 연결될 수 있다. 메모리는 다양한 형태의 휘발성 또는 비휘발성 저장 매체이며, 예를 들어, 메모리는 읽기 전용 메모리(read-only memory, ROM) 또는 랜덤 액세스 메모리(random access memory, RAM)를 포함할 수 있다. 따라서, 본 발명의 실시예는 컴퓨터에 구현된 방법으로서 구현되거나, 컴퓨터 실행 가능 명령이 저장된 비일시 적 컴퓨터 판독 가능 매체로서 구현될 수 있다. 한 실시예에서, 프로세서에 의해 실행될 때, 컴퓨터 판독 가능 명령은 본 기재의 적어도 하나의 양상에 따른 방법을 수행할 수 있다. 통신 장치는 유선 신호 또는 무선 신호를 송신 또는 수신할 수 있다. 또한, 본 발명의 실시예에 따른 방법은 다양한 컴퓨터 수단을 통해 수행될 수 있는 프로그램 명령 형태로 구현 되어, 컴퓨터 판독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 컴퓨터 판독 가능 매체에 기록되는 프로그램 명령은, 본 발명의 실시예를 위해 특별히 설계되어 구성된 것이거나, 컴퓨터 소프트웨어 분야의 통상의 기술자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가능 기록 매체는 프로그램 명령을 저장하고 수행하도록 구성된 하드웨어 장치를 포함할 수 있다. 예를 들 어, 컴퓨터 판독 가능 기록 매체는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광 기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical media), 롬(ROM), 램(RAM), 플래시 메모리 등일 수 있다. 프로그램 명령은 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라, 인터프리터 등을 통해 컴퓨터에 의해 실행될 수 있는 고급 언어 코드를 포함할 수 있다. 이상에서 본 발명의 실시예에 대하여 상세하게 설명하였지만 본 발명의 권리범위는 이에 한정되는 것은 아니고 다음의 청구범위에서 정의하고 있는 본 발명의 기본 개념을 이용한 당업자의 여러 변형 및 개량 형태 또한 본 발명의 권리범위에 속하는 것이다. 이하에서는 본 발명의 다른 실시예에 따른 고객 리뷰 데이터 기반 검색결과 제공 시스템에 대해 설명한다. 고객의 숙박시설 예약 시, 온라인 여행사(OTA)를 통해 예약하는 경우가 증가되고 있다. 고객은 OTA에서 자신이 원하는 숙박시설을 검색하기 위해, 가격, 위치, 숙박시설 명칭 등 기초 정보를 활용한다. 기초 정보만으로는 숙박시설의 구체적인 특징이나 서비스 만족도 등 다양한 정보를 알 수 없기에, 고객은 자신 보다 먼저 해당 숙박시설을 이용한 고객이 남긴 이용 후기를 참고하는 경우가 많다. 종래 기술에 따른 OTA는 리뷰 검색 등 리뷰 정보를 참고하기 위한 편의 기능을 제공하고 있지 않아, 고객이 원 하는 숙박시설을 예약하는 검색 과정에 상당한 노력과 시간이 소요되고 있다. 본 발명은 전술한 문제점을 해결하기 위해 제안된 것으로, 숙박시설 리뷰 데이터 학습을 수행하여 숙박시설의 강점, 약점, 선호되는 시설, 특징을 분석할 수 있는 AI 모델을 구축하여 숙박시설의 특징을 파악하고, 숙박시설 을 이용하고자 하는 고객이 원하는 특징과 유사한 특징 정보를 가진 숙박시설을 추천하는 것이 가능한 고객 리 뷰 데이터 기반 검색결과 제공 시스템을 제안한다. 본 발명의 다른 실시예에 따른 고객 리뷰 데이터 기반 검색결과 제공 시스템은 고객의 리뷰 데이터에 대한 학습 및 분석을 수행하는 AI 분석부와, AI 분석부의 분석 결과를 저장하는 저장부 및 잠재 고객의 요 청 정보에 대응되는 추천 시설에 대한 정보를 제공하는 서비스 제공부를 포함한다. AI 분석부는 OTA에 저장된 기존 고객의 숙박 시설에 대한 리뷰 데이터를 이용하여 학습을 수행하고, 리뷰 데이터에 대한 분석을 수행하여 분석 결과를 생성한다. AI 분석부는 리뷰 데이터에 포함되는 리뷰 원문을 학습하고, 분석을 수행한 결과에 따라 해당 숙박시설의 특징 정보를 생성한다. AI 분석부는 학습의 결과를 이용하여, 해당 숙박시설의 이용 형태, 보유시설, 주변 인프라, 서비스, 청결 도를 포함하는 항목 별로 리뷰 데이터를 분류하고, 항목 별로 긍정, 부정, 중립의 감성을 분석한다. AI 분석부는 리뷰 데이터에 포함되는 이미지 정보의 포커스 정보, 중심 영역에 포함된 객체 정보를 이용하 여 해당 숙박시설의 특징 정보를 생성한다. AI 분석부는 해당 숙박시설의 동일 시설물에 대한 상이한 평가가 존재하는 복수의 리뷰 데이터에 대해 그 룹핑하여 분석을 수행한다. 저장부는 시설의 명칭, 주소, 이용 가격, 시설 종류를 포함하는 기초 정보와 분석 결과를 결합하여 저장한 다. 서비스 제공부는 잠재 고객으로부터 수신한 텍스트를 분석하여 상기 요청 정보를 도출하고, 요청 정보에 대응되는 추천 시설에 대한 정보를 생성한다. 본 발명의 다른 실시예에 따르면, OTA를 통해 숙박시설을 이용하고자 하는 고객이 OTA에서 제공하는 숙박시설에 대한 기초 정보를 활용함에 그치지 않고, 고객 리뷰 데이터 기반의 검색 결과를 활용하여 자신이 원하는 특징을가진 숙박시설을 편리하게 검색하고 예약할 수 있어, 종래 기술에 따른 OTA의 검색 기능의 한계를 극복하는 것 이 가능하다. 본 발명의 다른 실시예에 따르면, 고객 리뷰 데이터 정보를 이용하여 학습된 AI 모델을 활용하여, 고객의 만족 도 정보, 시설 이용 후기를 포함하는 숙박시설의 특징 정보를 파악한다. 본 발명의 다른 실시예에 따르면, 고객 은 숙박시설을 검색하고 예약하는 과정에서, 시설의 이름, 등급, 위치, 가격 등 기초적인 정보에만 의존하여 예 약 진행 여부를 결정하는 종래 기술의 한계를 벗어나, 다양한 시설의 특징 정보 및 만족도 정보를 참고하여 합 리적으로 숙박시설에 대한 예약 여부를 결정할 수 있다. 도 6은 본 발명의 다른 실시예에 따른 고객 리뷰 데이터 기반 검색결과 제공 시스템을 도시한다. 본 발명의 다른 실시예에 따른 고객 리뷰 데이터 기반 검색결과 제공 시스템은 기저장된 리뷰 데이터를 학습 및 분석하는 AI 분석부, 분석된 리뷰 데이터를 저장하는 저장부 및 검색된 문장을 인식하고 검색결과를 제공하는 서비스 제공부를 포함한다. AI 분석부는 기저장된 고객의 리뷰 데이터 원문을 학습하고, 분석하여 해당 숙박시설의 특징 정보를 생성 한다. AI 분석부는 수집된 고객 후기를 학습하고, 학습된 모델을 바탕으로 분류 작업을 수행한다. AI 분석 부는 숙박시설의 이용 형태, 숙박시설의 보유시설, 숙박시설의 주변 인프라, 서비스, 청결도를 포함하는 항목으로 고객의 리뷰 데이터를 분류하며, 각 항목 별로 긍정, 부정, 중립의 감성을 분석한다. 예컨대, A호텔에 대한 B 고객의 리뷰 데이터가 <가족끼리 여행하기 너무 좋았습니다. 특히 수영장은 제가 다녀본 호텔 중 최고였 어요 너무나 만족스럽습니다.>라면, <1) 이용 형태, 가족, 감성평가, 긍정, 2) 보유시설, 수영장, 감성평가, 긍 정>으로 분류한다. AI 분석부는 고객이 리뷰 데이터에 첨부한 사진 정보가 있는 경우, 해당 사진 정보에 포함되는 보유시설 정보 중, 고객 만족도가 높은 것으로 유추되는 시설정보를 추출한다. 예컨대, 고객이 8살 어린아이와 함께 물놀 이를 하면서 온수 풀, 야외 사우나, 미끄럼틀 사진을 찍어서 첨부한 경우, 해당 시설에 대한 고객의 만족도가 높았던 것으로 확인한다. AI 분석부는 동일한 시설에 대해 상이한 평가를 내린 고객의 리뷰를 종합적으로 분석한다. 예컨대, A 호텔 에 대한 다른 리뷰 중, 즉 A 호텔을 이용한 C고객의 리뷰 데이터가 <3살 어린이가 이용하기에는 미끄럼틀이 너 무 가파른 듯 합니다. 하지만 온수풀이 있어 저녁에 수영하기에도 좋았습니다.>라면, <1) 이용 형태, 가족, 감 성평가, 긍정 2) 보유시설, 수영장, 감성평가, 중립> 으로 분류한다. 이 때, 보유시설과 관련하여, 미끄럼틀에 대해서는 부정, 온수풀에 대해서는 긍정, 종합적으로는 중립으로 감성 분석 결과를 생성한다. 서비스 제공부는 3살 어린이를 동반한 가족여행을 계획하며, 수영장을 이용하고자 하는 D 고객에게, A 호 텔을 먼저 이용한 B 고객 및 C 고객의 리뷰 데이터를 함께 제공하며, <수영장을 이용하는 어린이의 연령대에 따 라 만족도가 다를 수 있음>에 대한 보유시설 정보를 제공한다. 또한, 서비스 제공부는 D 고객의 예약을 유도하기 위해, A 호텔을 먼저 이용한 B 고객 및 C 고객의 리뷰 데이터를 분석하여, <3살 어린이를 동반하여 수영장을 이용하셨던 다른 고객님의 경우, 미끄럼틀의 경사가 다소 가파르다는 의견이 있었습니다. 이에, 5살 이하 어린이가 이용하기에 적합한 유아용 미끄럼틀을 추가적으로 설 치하였사오니, 많은 이용 바랍니다.>의 추천 정보 텍스트를 생성하여 제공할 수 있다. 저장부는 AI 분석부의 분석 결과와, 숙박시설의 기초 정보(숙박시설의 이름, 주소, 평균판매가격, 시 설 종류 등의 기초정보)를 결합하여 저장한다. 서비스 제공부는 사용자 인터페이스를 통해 구매 예정인 고 객의 니즈 정보를 입력받고, 저장부로부터 데이터를 전달받아, 고객이 요구하는 숙박시설의 리스트 정보를 생성하여 제공한다. 예컨대 앞서의 리뷰 분석 정보를 'A호텔', '강원도', '호텔', '120,000~150,000'이라는 기 초정보와 함께 저장한다. 서비스 제공부는 데이터베이스에 저장된 데이터를 기반하여 고객이 숙박시설 정보를 검색할 때 그에 맞는 숙박시설 목록을 제공한다. 예컨대 고객이 <5살 어린이를 동반한 3인 가족이 놀러가기 좋고, 수영장이 포함된 호텔>이라고 검색을 하는 경우 이에 맞는 특징을 보유하고 있는 'A호텔'을 포함한 다수 숙박시설의 목록을 제공 할 수 있으며, 지역, 가격대, 숙박시설의 종류가 특정되지 않았기 때문에 각 지역별, 가격대별, 숙박시설 종류 별 특징에 맞는 숙박시설을 추천한다. 고객이 검색한 호텔을 이용하고, 새로운 후기를 작성하는 경우 해당 리뷰는 다시 AI 분석부로 전달되어 학 습 및 해당 호텔의 특징을 업데이트하는 것에 활용된다. 도 7은 본 발명의 다른 실시예에 따른 고객 리뷰 데이터 기반 검색결과 제공 방법을 도시한다. 본 발명의 다른 실시예에 따른 고객 리뷰 데이터 기반 검색결과 제공 방법은 고객의 리뷰 정보를 획득하여 시설 의 특징 정보 및 고객 만족도 정보를 파악하는 단계(S710)와, 기초 정보와 연동하여 시설 분석 정보를 저장하는 단계(S720) 및 고객 요청에 대응되는 시설의 리스트를 생성하여 제공하는 단계(S730)를 포함한다. S710 단계에서, OTA에 기저장된 숙박시설 이용 고객의 리뷰 데이터를 획득하고, 리뷰 데이터 원문을 학습한다. S710 단계에서, 숙박시설의 이용 형태, 숙박시설의 보유시설, 숙박시설의 주변 인프라, 서비스, 청결도를 포함 하는 항목으로 고객의 리뷰 데이터를 분류한다. 고객의 리뷰 데이터에 포함된 각 항목별로 긍정, 부정, 중립의 감성을 분석한다. S710 단계에서, 각 항목별로 긍정, 부정, 중립의 감성을 분석하고, 전체 감성에 대한 분석을 수행한다. 예컨대, 대부분의 항목에 대해 긍정 감성으로 분석되었으나, 한 가지 항목에 대해 부정 감성이 판단 기준치 이상의 매우 큰 값을 가지는 것으로 분석되는 경우, 전체 감성은 부정 감성인 것으로 분석한다. S710 단 계에서, 학습 엔진을 이용하여 고객 리뷰 데이터를 분석하고, 시설의 특징 정보 및 고객 만족도 정보를 파악함 에 있어서, 고객이 첨부한 사진이 있는 경우 이를 고려하여 분석을 수행한다. 예컨대, 사진의 포커스 또는 사진 의 중심 영역에 포함된 객체에 대해, 긍정 감성에 해당되는 객체인지, 부정 감성에 해당되는 객체인지 여부를 판단한다. 수영장을 이용한 고객이 온수 풀에서 찍은 사진을 다른 사진 대비 기준치 이상(예: 2배 이상)의 수로 첨부한 경우, 사진 속에 찍힌 인물의 표정을 분석한 감정 점수, 텍스트에 포함된 만족도 관련 단어의 포함 여부 등을 고려하여, 해당 시설에 대한 고객의 만족도 점수를 판단한다. S710 단계에서, 동일한 시설에 대해 상이한 평가를 내린 고개의 리뷰를 그룹핑하여, 분석을 수행한다. 전술한 예를 참조하면, A 호텔에 대한 다른 리뷰 중, 즉 A 호텔을 이용한 B 고객의 리뷰 데이터 및 C고객의 리뷰 데이 터가 수영장 시설 이용 후기를 포함하는 경우, 해당 리뷰들을 그룹핑하고 분석을 수행한다. B고객은 8살 어린이 를 동반한 부모로서, 수영장 시설에 대한 긍정 평가가 있었고, C 고객은 3살 어린이를 동반한 부모로서, 수영장 시설 중 일부 시설에 대해서는 긍정적인 평가를, 다른 일부 시설에 대해서는 부정적인 평가를 남긴 경우를 가정 한다. 동일한 시설인 경우에도, 누가 이용하는지에 따라, 언제 이용하는지에 따라, 그날 그날의 컨디션에 따라 고객의 리뷰가 달라질 수 있는 바, S710 단계는 해당 리뷰 데이터들을 종합적으로 분석하여 숙박시설 관리자에 게 개선점을 전달한다. 아울러, S710 단계는 해당 리뷰들을 참고할 잠재적인 구매자(숙박시설을 예약하려고 검 색하는 잠재 고객)에게, A 호텔을 먼저 이용한 B 고객 및 C 고객의 리뷰 데이터를 함께 제공하도록 관리를 수행 한다. S730 단계는 고객 요청 정보를 분석하여, 고객 요청에 대응되는 숙박시설의 리스트를 생성하여 제공하는 데, 리스트에 A 호텔이 포함되는 경우, <수영장을 이용하는 어린이의 연령대에 따라 만족도가 다를 수 있음>에 대한 보유시설 정보와 B 고객 및 C고객의 리뷰 데이터를 함께 제공하며, 예약을 유도하기 위해 해당 시설에 대 한 개선점 관련 정보가 존재하는 경우, 개선점 관련 정보를 포함한 광고 문구를 생성하여 제공한다. S720 단계에서, S710 단계에서의 분석 수행 결과 및 숙박시설의 기초 정보(숙박시설의 이름, 주소, 평균판매가 격, 시설 종류 등의 기초정보)를 결합하여 저장한다. S730 단계에서, 사용자 인터페이스를 통해 잠재 고객의 니즈 정보를 입력받고, 잠재 고객이 요청하는 사항에 대 응되는 추천 숙박시설의 리스트 정보를 생성하여 제공한다. 이하에서는 본 발명의 또 다른 실시예에 따른 리뷰 작성자의 성향 분석 및 시설 추천 시스템을 설명한다. 종래 기술에 따르면, 온라인 여행사(OTA)를 통해 숙박시설을 예약하고 이용하는 고객은 OTA로부터 다양한 기준 에 의해 추천된 호텔 정보를 제공받는다. 그런데, 고객은 어떠한 이유로 해당 숙박시설이 추천되었는지, 그 정 확한 이유에 대해 알지 못하고, 추천 서비스에 대한 신뢰도와 만족도가 떨어지는 문제점이 있다. 본 발명의 또 다른 실시예에 따른 리뷰 작성자의 성향 분석 및 시설 추천 시스템은 전술한 문제점을 해결하기 위해 제안된 것으로, 고객의 정확한 성향 및 니즈를 파악하고 수치화한 데이터를 이용하여, 해당 성향 및 니즈 를 충족시킬 수 있는 시설에 대한 추천 서비스를 제공함으로써, 고객의 시설 이용에 대한 만족도 및 추천 서비 스에 대한 신뢰도를 높이는 것이 가능한 시스템을 제공하는데 그 목적이 있다. 본 발명의 또 다른 실시예에 따른 리뷰 작성자의 성향 분석 및 시설 추천 시스템은 고객의 리뷰 데이터를 분석 하여 상기 고객의 성향 정보를 도출하는 AI 기반 고객 성향 분석부와, 고객의 성향 정보와 고객의 기초 정 보를 연동하여 저장하는 저장부 및 고객의 니즈를 파악하여, 고객의 성향 정보를 고려한 시설 추천 정보를 제공하는 서비스 제공부를 포함한다. AI 기반 고객 성향 분석부는 OTA에 저장된 고객의 리뷰 데이터를 분석하고, 기설정 분류에 따른 리뷰 데이 터 분석의 결과를 이용하여 성향 정보를 도출한다. AI 기반 고객 성향 분석부는 시설이 보유한 특징에 대해 기설정 분류를 고려하여 리뷰 데이터에 언급된 횟 수 및 긍정도를 부여하고, 성향 정보를 도출한다. 저장부는 거주지, 선호 지역 정보를 포함하는 기초 정보와 연동하여 성향 정보를 저장한다. 서비스 제공부는 고객으로부터 요청 정보를 포함한 텍스트를 수신하고, 텍스트를 분석하여 고객의 니즈를 파악한다. 서비스 제공부는 고객의 성향 정보와 기설정 수준 이상의 유사도를 가진 다른 고객의 리뷰 데이터를 분석 한 결과를 이용하여, 고객의 니즈에 부합될 것으로 예상되는 시설 추천 정보를 생성한다. AI 기반 고객 성향 분석부는 고객의 소비 패턴 정보를 이용하여, 고객의 성향 정보를 도출한다. 서비스 제공부는 동일한 사전적 의미를 가지는 텍스트가 고객 별로 상이하게 사용되는 경우, 소비 패턴 정 보를 고려하여 시설 추천 정보를 생성한다. 본 발명의 또 다른 실시예에 따르면, 고객은 불명료한 추천 시설 정보를 제공받는 것이 아닌, 실제 고객 본인이 작성한 리뷰 데이터에 대한 분석 결과 도출된 성향을 토대로 추천되는 시설에 대한 정보를 제공받는 것이 가능 한 효과가 있다. 도 8은 본 발명의 또 다른 실시예에 따른 리뷰 작성자의 성향 분석 및 시설 추천 시스템을 도시한다. 본 발명의 또 다른 실시예에 따른 리뷰 작성자의 성향 분석 및 시설 추천 시스템은 고객이 기존에 작성하였던 리뷰 데이터를 분석하여 고객의 성향을 파악하고, 해당 고객과 유사한 성향을 가진 다른 고객들이 긍정적인 평 가를 남긴 시설을 해당 고객에게 추천한다. ‘청결’, '가격', '서비스', '시설', '인테리어', '조식' 등 숙박 시설이 보유한 다양한 특징 중에서 해당 고객이 중요하게 언급하거나 자주 언급하는 특징을 통해 해당 고객의 성향을 파악한다. 리뷰 분류를 위한 AI모델을 바탕으로 고객의 성향과 니즈를 정확하게 파악하고, 유사한 성향 의 고객을 클러스터링하며, 고객의 성향을 고려하여 고객의 만족도가 높을 것으로 예상되는 숙박시설을 추천한 다. 본 발명의 또 다른 실시예에 따른 리뷰 작성자의 성향 분석 및 시설 추천 시스템은 고객이 작성한 리뷰 데이터 를 학습 및 분석하는 AI기반 고객 성향 분석부와, 분석된 고객의 성향 정보 및 기초정보를 저장하는 저장 부 및 저장부에 저장된 고객 데이터를 기반으로 추천 숙박시설 목록을 제공하는 서비스 제공부 를 포함한다. AI 기반 고객 성향 분석부는 해당 고객이 작성한 리뷰 데이터를 획득하고 분석하여, 해당 고객의 성향을 파악한다. AI 기반 고객 성향 분석부는 고객이 작성한 리뷰를 '청결', '가격', '서비스', '시설', '인테리 어', '조식' 등 숙박시설이 보유한 다양한 특징으로 분류하고, 언급 횟수, 긍정도에 따라 점수를 부여하여 고객 이 가장 중요하게 생각하는 호텔의 특징이 무엇인지 판단한다. 예컨대 고객이 <가성비가 정말 좋은 호텔이네요 최고로 만족했습니다>, <가성비, 직원의 친절함 모두 만족스러웠지만 청결상태가 아쉽네요,>, <가성비 좋고 깔 끔하네요. 잘 묵고 갑니다.>를 포함하는 3개의 리뷰를 작성했다고 할 때, '가격' 항목에 3점, '청결' 항목에 2 점, '서비스' 항목에 1점의 점수를 부여하여 고객의 성향을 분류한다. 이 때, 항목 별로 고객의 성향 정보는 세분화되어 분석된다. 예컨대, 가성비의 사전적 의미는 가격 대비 성능의 의미인데, 각 고객의 성향 별로 다르게 쓰일 수도 있다. 예컨대, A 고객은 10만원 이하의 숙박 시설을 주로 이 용한 후 리뷰를 남긴 고객으로, 숙박 가격 자체가 자신의 기준(10만원) 이하인 경우 가성비가 좋은 것으로 리뷰 를 남긴다. 다른 예로서, B 고객은 50만원 대의 숙박 시설을 주로 이용하며, 숙박 가격 자체는 평균적인 가격보 다 비싸더라도, 부대 시설, 서비스 이용에 대한 만족도가 높다는 의미로 가성비가 좋음을 리뷰 데이터에서 언급 할 수 있다. 이처럼 각 고객의 소비 패턴을 토대로, 동일한 단어에 대해서도 상이하게 사용될 수 있다. A 고객 에게 단순히 <가성비>의 항목을 토대로 B 고객의 리뷰 데이터를 이용하여 50만원 대의 숙박 시설을 추천한다면, A 고객은 추천 서비스에 대한 신뢰를 가지기 어렵다. 이에, 숙박 시설의 항목에 대한 성향 분석을 수행하되, 각 각의 소비자의 소비 패턴을 고려하여, 추천 숙박시설 리스트를 생성한다. 저장부는 AI 기반 고객 성향 분석부에 의해 파악된 해당 고객의 성향과, 해당 고객의 기초 정보(이름, 거 주지, 선호 지역 등)를 저장한다. 고객의 정보는 'ID', '거주지역', '선호지역(주로 여행한 지역)'과 함께 성향정보가 연동되어 저장된다. 서비스 제공부는 해당 고객의 성향과 유사한 성향을 가진 다른 고객을 클러스터링하고, 해당 고객의 니즈 에 부합하는 시설에 대한 추천 목록을 생성하여 제공한다. 서비스 제공부는 분류된 고객 성향과 유사한 성 향을 보유한 다른 고객이 긍정적인 후기를 남긴 숙박 시설을 추천한다. 서비스 제공부는 고객의 선호지역 등 기초정보를 융합하여 '새로운 방문을 추천하는 지역', '자주 방문한 지역 중 추천하는 호텔' 등 다양한 카테 고리로 숙박시설을 추천한다. 고객이 숙박 시설을 이용하고 새로운 후기를 작성하는 경우, 새로운 후기는 다시 AI 기반 고객 성향 분석부 로 전달되어 고객 성향 분석을 위해 활용된다. 도 9는 본 발명의 또 다른 실시예에 따른 리뷰 작성자의 성향 분석 및 시설 추천 방법을 도시한다. 본 발명의 또 다른 실시예에 따른 리뷰 작성자의 성향 분석 및 시설 추천 방법은 해당 고객의 기존 리뷰 데이터 를 분석하여 해당 고객의 성향을 파악하는 단계(S1010)와, 고객 성향 데이터를 고객 기초 정보와 연동하여 저장 하는 단계(S1020) 및 고객 요청에 대응되는 숙박시설 리스트를 생성하여 제공하는 단계(S1030)를 포함한다. S1010 단계에서, 해당 고객이 작성한 리뷰 데이터를 분석하되, '청결', '가격', '서비스', '시설', '인테리어', '조식' 등 숙박시설이 보유한 다양한 특징으로 분류하여 각 항목에 대해 언급된 횟수 및 긍정도를 부여한다. 이 러한 과정을 통해, 고객이 중요하게 생각하는 숙박시설의 요소가 무엇인지 판단한다. S1020 단계는 고객의 성향 데이터를 고객 기초 정보(이름, 거주지, 선호 지역 등)와 연동하여 저장한다. S1030 단계는 해당 고객의 성향과 유사한 성향을 가진 다른 고객을 클러스터링하고, 해당 고객의 니즈에 부합하 는 시설에 대한 추천 목록을 생성하여 제공한다. 예컨대, A 고객의 리뷰 데이터 분석 결과, A 고객이 조식 시간 대에 대기 혼잡도가 적고, 조식 메뉴 중에 쌀국수 메뉴를 좋아하고, 온수 풀이 있는 야외 수영장 시설에 대한 만족도가 높은 성향을 가진 것으로 판단함을 가정한다. S1030 단계는 고객이 <제주도 지역 8살 어린이를 동반한 3인 가족>에 대한 니즈를 입력하는 경우, 해당 고객의 성향을 고려하여, 조식 시간 대의 대기 혼잡도, 조식 메 뉴, 야외 수영장 시설 정보에 대한 다른 고객의 리뷰 데이터 분석 결과를 토대로, 추천 숙박시설의 리스트를 생 성하여 제공한다."}
{"patent_id": "10-2023-0133387", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 리뷰 데이터 학습 기반 자동 리뷰 대응 시스템, OTA 서버 및 호텔 관리자 단말 을 도시한다. 도 2는 본 발명의 실시예에 따른 리뷰 데이터 학습 기반 자동 리뷰 대응 시스템의 데이터 수집 및 저장의 일부 과정을 도시한다. 도 3은 본 발명의 실시예에 따른 리뷰 데이터 학습 기반 자동 리뷰 대응 시스템의 저장부, 분석부, 전달부와, OTA 서버 및 호텔 관리자 단말의 정보 송수신 과정을 도시한다. 도 4는 본 발명의 실시예에 따른 리뷰 데이터 학습 기반 자동 리뷰 대응 방법을 도시한다. 도 5는 본 발명의 실시예에 따른 방법을 구현하기 위한 컴퓨터 시스템을 나타낸 블록도이다. 도 6은 본 발명의 실시예에 따른 고객 리뷰 데이터 기반 검색결과 제공 시스템을 도시한다. 도 7은 본 발명의 실시예에 따른 고객 리뷰 데이터 기반 검색결과 제공 방법을 도시한다. 도 8은 본 발명의 다른 실시예에 따른 리뷰 작성자의 성향 분석 및 시설 추천 시스템을 도시한다. 도9는 본 발명의 또 다른 실시예에 따른 리뷰 작성자의 성향 분석 및 시설 추천 방법을 도시한다."}
