{"patent_id": "10-2019-0011091", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0093849", "출원번호": "10-2019-0011091", "발명의 명칭": "시간 상관 관계에 기초하여 잔여 에코를 추정하는 잔여 에코 추정기, 잔여 에코를 추정하는", "출원인": "삼성전자주식회사", "발명자": "김성우"}}
{"patent_id": "10-2019-0011091", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "기준 신호가 스피커를 통해 출력됨에 따라 마이크로폰으로 입력되는 마이크로폰 신호의 잔여 에코를 추정하는잔여 에코 추정기에 있어서, 상기 잔여 에코 추정기는:현재 프레임에서의 상기 기준 신호의 선형 에코의 크기 및 과거 프레임에서의 상기 기준 신호의 상기 선형 에코의 크기를 이용하여 상기 현재 프레임에서의 상기 잔여 에코의 상기 크기를 추정하고, 그리고상기 선형 에코의 상기 크기들에 적용되는 가중치들을 업데이트하도록 구성되는 잔여 에코 추정기."}
{"patent_id": "10-2019-0011091", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 잔여 에코 추정기는:상기 현재 프레임에서의 상기 마이크로폰 신호의 크기 및 상기 과거 프레임에서의 상기 마이크로폰 신호의 크기를 더 이용하여 상기 현재 프레임에서의 상기 잔여 에코의 상기 크기를 추정하고, 그리고상기 상기 마이크로폰 신호의 상기 크기들에 적용되는 가중치들을 더 업데이트하도록 구성되는 잔여 에코 추정기."}
{"patent_id": "10-2019-0011091", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 잔여 에코 추정기는:상기 과거 프레임에서의 상기 잔여 에코의 크기를 더 이용하여 상기 현재 프레임에서의 상기 잔여 에코의 상기크기를 추정하고, 그리고상기 과거 프레임에서의 상기 잔여 에코의 상기 크기에 적용되는 가중치를 더 업데이트하도록 구성되는 잔여 에코 추정기."}
{"patent_id": "10-2019-0011091", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 잔여 에코 추정기는:상기 잔여 에코의 실제 크기와 상기 잔여 에코의 상기 크기 간의 차이를 이용하여 상기 가중치들을 업데이트하도록 구성되는 잔여 에코 추정기."}
{"patent_id": "10-2019-0011091", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 잔여 에코의 상기 크기는, 상기 선형 에코의 상기 크기들과 상기 가중치들을 각각 곱한 곱셈 결과들을 더한 값인 잔여 에코 추정기."}
{"patent_id": "10-2019-0011091", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "프로세서에 의해 실행 가능한 프로그램 코드를 저장하는 비일시적 컴퓨터 판독 가능한 매체에 있어서, 기준 신호가 스피커를 통해 출력됨에 따라 마이크로폰으로 입력된 마이크로폰 신호의 잔여 에코를 추정하는 상기 프로세서는:현재 프레임에서의 상기 기준 신호의 선형 에코의 크기 및 과거 프레임에서의 상기 기준 신호의 상기 선형 에코의 크기를 이용하여 상기 현재 프레임에서의 상기 잔여 에코의 상기 크기를 추정하고 그리고 상기 선형 에코의공개특허 10-2020-0093849-3-상기 크기들에 적용되는 가중치들을 업데이트하는 잔여 에코 추정기; 및상기 잔여 에코의 상기 크기 그리고 상기 마이크로폰 신호에서 상기 선형 에코가 제거된 출력 신호의 크기를 이용하여 상기 출력 신호에 곱해지는 억제 게인을 계산하는 게인 계산기를 실행하도록 구성되는 비일시적 컴퓨터판독 가능한 매체."}
{"patent_id": "10-2019-0011091", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서,상기 과거 프레임에서의 상기 기준 신호의 상기 선형 에코의 상기 크기는 메모리에 저장되고, 그리고상기 메모리는 TCM(tightly coupled memory), SRAM(static random access memory), 또는 DRAM(dynamic randomaccess memory)인 비일시적 컴퓨터 판독 가능한 매체."}
{"patent_id": "10-2019-0011091", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 6 항에 있어서,상기 잔여 에코 추정기는:상기 현재 프레임에서의 상기 마이크로폰 신호의 크기 및 상기 과거 프레임에서의 상기 마이크로폰 신호의 크기를 더 이용하여 상기 현재 프레임에서의 상기 잔여 에코의 상기 크기를 추정하고, 그리고상기 상기 마이크로폰 신호의 상기 크기들에 적용되는 가중치들을 더 업데이트하는 비일시적 컴퓨터 판독 가능한 매체."}
{"patent_id": "10-2019-0011091", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 6 항에 있어서,상기 잔여 에코 추정기는:상기 과거 프레임에서의 상기 잔여 에코의 크기를 더 이용하여 상기 현재 프레임에서의 상기 잔여 에코의 상기크기를 추정하고, 그리고상기 과거 프레임에서의 상기 잔여 에코의 상기 크기에 적용되는 가중치를 더 업데이트하는 비일시적 컴퓨터 판독 가능한 매체."}
{"patent_id": "10-2019-0011091", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 6 항에 있어서,상기 잔여 에코 추정기는:상기 출력 신호의 상기 크기와 상기 잔여 에코의 상기 크기 간의 차이를 이용하여 상기 가중치들을 업데이트하는 비일시적 컴퓨터 판독 가능한 매체."}
{"patent_id": "10-2019-0011091", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 6 항에 있어서,상기 잔여 에코 추정기는:상기 출력 신호의 상기 크기와 상기 잔여 에코의 상기 크기 간의 차이가 최소가 되도록 상기 가중치들을 업데이트하는 인공 신경망을 실행하는 비일시적 컴퓨터 판독 가능한 매체."}
{"patent_id": "10-2019-0011091", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 6 항에 있어서,상기 프로세서는 상기 출력 신호의 상기 크기를 이용하여 노이즈의 크기를 추정하는 노이즈 추정기를 더 실행하도록 구성되고, 그리고상기 게인 계산기는 상기 노이즈의 상기 크기를 더 이용하여 상기 억제 게인을 계산하는 비일시적 컴퓨터 판독공개특허 10-2020-0093849-4-가능한 매체."}
{"patent_id": "10-2019-0011091", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 6 항에 있어서,상기 프로세서는 상기 잔여 에코의 상기 크기와 상기 출력 신호의 크기를 스무딩(smoothing)하고 그리고 상기잔여 에코의 상기 스무딩된 크기와 상기 출력 신호의 상기 스무딩된 크기를 상기 게인 계산기에 제공하는 스무딩 계산기를 더 실행하도록 구성되는 비일시적 컴퓨터 판독 가능한 매체."}
{"patent_id": "10-2019-0011091", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "오디오 프로세서; 및상기 오디오 프로세서에 의해 실행 가능한 프로그램 코드를 저장하는 비일시적 컴퓨터 판독 가능한 매체를 포함하되,상기 오디오 프로세서는:기준 신호가 스피커를 통해 출력됨에 따라 마이크로폰으로 입력되는 마이크로폰 신호에서 상기 스피커와 상기마이크로폰 간의 전송 경로에 기초하여 결정되는 상기 기준 신호의 선형 에코를 제거하여 출력 신호를 생성하는선형 에코 제거기; 및현재 프레임에서의 상기 선형 에코의 크기 및 과거 프레임에서의 상기 선형 에코의 크기를 선택적으로 이용하여상기 현재 프레임에서의 잔여 에코의 크기를 추정하는 잔여 에코 억제기를 실행하도록 구성되는 어플리케이션프로세서."}
{"patent_id": "10-2019-0011091", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 14 항에 있어서,상기 잔여 에코 억제기는:제 1 모드에서는 상기 현재 프레임에서의 상기 선형 에코의 상기 크기를 이용하고 상기 과거 프레임에서의 상기선형 에코의 상기 크기를 이용하지 않고, 그리고제 2 모드에서는 상기 현재 프레임에서의 상기 선형 에코의 상기 크기 및 상기 과거 프레임에서의 상기 선형 에코의 상기 크기를 이용하는 어플리케이션 프로세서."}
{"patent_id": "10-2019-0011091", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 14 항에 있어서,메인 프로세서를 더 포함하되,상기 프로그램 코드는 제 1 프로그램 코드이고, 그리고상기 비일시적 컴퓨터 판독 가능한 매체는 상기 메인 프로세서에 의해 실행 가능한 제 2 프로그램 코드를 더 저장하고,상기 제 2 프로그램 코드는 상기 잔여 에코 억제기에 의해 상기 과거 프레임에서의 상기 선형 에코의 상기 크기가 이용되는지 여부를 결정하는 어플리케이션 프로세서."}
{"patent_id": "10-2019-0011091", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 14 항에 있어서,상기 잔여 에코 억제기는:상기 잔여 에코의 상기 크기 그리고 상기 출력 신호의 크기를 이용하여 상기 출력 신호에 곱해지는 억제 게인을계산하고, 그리고상기 출력 신호와 상기 억제 게인을 곱하여 최종 출력 신호를 생성하는 어플리케이션 프로세서.공개특허 10-2020-0093849-5-청구항 18 제 14 항에 있어서,상기 잔여 에코 억제기는:상기 출력 신호의 크기와 상기 잔여 에코의 상기 크기 간의 차이가 최소가 되도록 상기 선형 에코의 상기 크기들에 적용되는 가중치들을 업데이트하는 어플리케이션 프로세서."}
{"patent_id": "10-2019-0011091", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 14 항에 있어서,상기 잔여 에코 억제기는 더블 토크가 검출되지 않으면, 상기 과거 프레임에서의 상기 잔여 에코의 크기 그리고상기 현재 프레임 및 상기 과거 프레임에서의 상기 마이크로폰 신호의 상기 크기들을 더 이용하여 상기 현재 프레임에서의 상기 잔여 에코의 상기 크기를 추정하는 어플리케이션 프로세서."}
{"patent_id": "10-2019-0011091", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 14 항에 있어서,상기 과거 프레임에서의 상기 기준 신호의 상기 선형 에코의 상기 크기는 메모리에 저장되고, 그리고상기 메모리는 TCM(tightly coupled memory), SRAM(static random access memory), 또는 DRAM(dynamic randomaccess memory)인 어플리케이션 프로세서."}
{"patent_id": "10-2019-0011091", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 실시 예에 따라, 기준 신호가 스피커를 통해 출력됨에 따라 마이크로폰으로 입력되는 마이크로폰 신호 의 잔여 에코의 크기를 추정하는 잔여 에코 추정기는: 현재 프레임에서의 기준 신호의 선형 에코의 크기 및 과거 프레임에서의 기준 신호의 선형 에코의 크기를 이용하여 현재 프레임에서의 잔여 에코의 크기를 추정하고, 그리 고 선형 에코의 크기들에 적용되는 가중치들을 업데이트하도록 구성된다."}
{"patent_id": "10-2019-0011091", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 시간 상관 관계에 기초하여 잔여 에코를 추정하는 잔여 에코 추정기, 잔여 에코를 추정하는 프로그램 코드를 저장하는 비일시적 컴퓨터 판독 가능한 매체, 그리고 어플리케이션 프로세서에 관한 것이다."}
{"patent_id": "10-2019-0011091", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "스피커와 마이크로폰을 포함하는 전자 장치에서 원단 화자의 음성이 스피커를 통해 출력됨에 따라 마이크로폰으 로 원단 화자의 음성이 입력될 수 있다. 이러한 음향 반향은 원단에서 근단 화자의 음성이 인식되는 것을 방해 할 수 있다. 따라서, 서로 인접하게 배치되는 스피커와 마이크로폰 간의 커플링에 따른 음향 반향이 제거되는 것이 필요하다. 또한, 음성 인식을 지원하는 전자 장치의 수요가 증대됨에 따라 음향 반향을 효과적으로 제거하 는 것이 더욱 중요하다."}
{"patent_id": "10-2019-0011091", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상술한 기술적 과제를 해결하기 위한 것으로, 본 발명은 시간 상관 관계에 기초하여 잔여 에코를 추 정하는 잔여 에코 추정기, 잔여 에코를 추정하는 프로그램 코드를 저장하는 비일시적 컴퓨터 판독 가능한 매체, 그리고 어플리케이션 프로세서를 제공할 수 있다."}
{"patent_id": "10-2019-0011091", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시 예에 따라, 기준 신호가 스피커를 통해 출력됨에 따라 마이크로폰으로 입력되는 마이크로폰 신 호의 잔여 에코를 추정하는 잔여 에코 추정기는: 현재 프레임에서의 기준 신호의 선형 에코의 크기 및 과거 프 레임에서의 기준 신호의 선형 에코의 크기를 이용하여 현재 프레임에서의 잔여 에코의 크기를 추정하고, 그리고 선형 에코의 크기들에 적용되는 가중치들을 업데이트하도록 구성된다. 본 발명의 다른 실시 예에 따라, 프로세서에 의해 실행 가능한 프로그램 코드를 저장하는 비일시적 컴퓨터 판독 가능한 매체에 있어서, 기준 신호가 스피커를 통해 출력됨에 따라 마이크로폰으로 입력되는 마이크로폰 신호의 잔여 에코를 추정하는 프로세서는: 현재 프레임에서의 기준 신호의 선형 에코의 크기, 현재 프레임에서의 마이 크로폰 신호의 크기 및 과거 프레임에서의 기준 신호의 선형 에코의 크기를 이용하여 현재 프레임에서의 잔여에코의 크기를 추정하고 그리고 선형 에코의 크기들에 적용되는 가중치들을 업데이트하는 잔여 에코 추정기; 및 잔여 에코의 크기 그리고 마이크로폰 신호에서 선형 에코가 제거된 출력 신호의 크기를 이용하여 출력 신호에 곱해지는 억제 게인을 계산하는 게인 계산기를 실행하도록 구성된다. 본 발명의 또 다른 실시 예에 따라, 어플리케이션 프로세서는 오디오 프로세서; 및 오디오 프로세서에 의해 실 행 가능한 프로그램 코드를 저장하는 비일시적 컴퓨터 판독 가능한 매체를 포함하고, 오디오 프로세서는: 기준 신호가 스피커를 통해 출력됨에 따라 마이크로폰으로 입력되는 마이크로폰 신호에서 스피커와 마이크로폰 간의 전송 경로에 기초하여 결정되는 기준 신호의 선형 에코를 제거하여 출력 신호를 생성하는 선형 에코 제거기; 및 현재 프레임에서의 선형 에코의 크기 및 과거 프레임에서의 선형 에코의 크기를 선택적으로 이용하여 현재 프레 임에서의 잔여 에코의 크기를 추정하는 잔여 에코 억제기를 실행하도록 구성된다."}
{"patent_id": "10-2019-0011091", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시 예에 따르면, 잔여 에코의 크기를 계산하는데 선형 에코의 시간 상관 관계, 잔여 에코의 시간 상관 관계, 및 마이크로폰 신호의 시간 상관 관계가 선택적으로 사용될 수 있다. 따라서, AEC 시스템의 ERLE가 더 개선될 수 있다."}
{"patent_id": "10-2019-0011091", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 1, "content": "도 1은 본 발명의 일 실시 예에 따른 통신 시스템을 예시적으로 도시한다. 통신 시스템은 근단(near-end) 화 자와 관련되거나 인접한 전자 장치 및 원단(far-end) 화자와 관련되거나 인접한 전자 장치를 포함할 수 있다. 원단 화자의 음성에 따른 원단 신호(이하, 기준(reference) 신호로 지칭))가 마이크로폰을 통해 전자 장치로 입력될 수 있다. 전자 장치는 유/무선 통신 프로토콜에 기초하여 전자 장치로 기준 신호를 전송할 수 있다. 본 발명의 실시 예에 따른 전자 장치는 전자 장치로부터 기준 신호를 수신하고 기준 신호를 스피커(1 1)를 통해 출력할 수 있다. 전자 장치는 마이크로폰을 통해 전자 장치의 주변의 소리(예를 들어, 근단 화자의 음성 또는 노이즈(noise))를 수신할 수 있다. 그러나, 스피커를 통해 기준 신호가 출력됨에 따 라 전자 장치의 마이크로폰으로 기준 신호에 대한 에코(echo; 또는 에코 신호)가 입력될 수 있다. 따라 서, 전자 장치는 전자 장치의 스피커를 통해 원단 화자의 음성이 원단 화자에게 다시 재생되는 것 을 방지하기 위해 마이크로폰 신호에 포함된 에코를 제거(cancel)하거나 억제(suppress)할 수 있다. 전자 장치는 어플리케이션 프로세서를 포함할 수 있다. 어플리케이션 프로세서는 오디오 프로세 서 및 메모리를 포함할 수 있다. 예를 들어, 어플리케이션 프로세서는 기준 신호에 대한 에코를 제거하기 위한 다양한 하드웨어 구성 요소(들), 회로(들), 또는 모듈(들)을 이용하여 구현되는 AEC(acousticecho cancellation) 시스템을 포함할 수 있다. 다른 예를 들어, 어플리케이션 프로세서는 소프트웨 어 구성 요소(들), 기능 블록(들), 또는 모듈(들)을 이용하여 실행되는 AEC 시스템을 실행하거나 구현할 수 있다. AEC 시스템의 일부 또는 전체가 소프트웨어로 구현되는 경우, 오디오 프로세서는 메모리에 저 장된 프로그램 코드를 실행하여, AEC 시스템을 실행하거나 구현할 수 있다. 오디오 프로세서는 AEC 시스템을 실행하기 위해 프로그램 코드에 포함된 명령(들), 알고리즘(들), 또는 기능(들)을 메모리 로부터 읽고 이들을 실행할 수 있는 적어도 하나의 코어(프로세싱 유닛)를 포함할 수 있다. 메모리는 AEC 시스템을 실행하기 위한 프로그램 코드를 저장하는 비일시적 컴퓨터 판독 가능한 매체 일 수 있다. 메모리는 RAM(Random Access Memory), 플래시 메모리, ROM(Read Only Memory), EPROM(Electrically Programmable ROM), EEPROM(Electrically Erasable Programmable ROM), 레지스터, 하드 디스크, 착탈식 디스크, CD-ROM, 또는 임의의 형태의 저장 매체일 수 있다. 도 1의 도시대로, 메모리는 어 플리케이션 프로세서 내에서 구현될 수도 있거나, 또는 도 1의 도시와 달리 메모리는 전자 장치 내에서 어플리케이션 프로세서와 독립적으로 구현되거나 또는 전자 장치의 외부에 위치하는 저장 매체 일 수도 있다. AEC 시스템은 선형 에코 제거기(LEC) 및 잔여 에코 억제기(RES)를 포함할 수 있다. 선형 에코 제거기 (LEC)는 기준 신호 수신할 수 있다. 선형 에코 제거기(LEC)는 스피커와 마이크로폰 간의 전달 (transfer) 경로에 기초하여 선형적으로 기준 신호의 선형 에코(X'(κ, m))를 추정(계산)할 수 있다. κ(kapp a)는 시간에 관한 프레임 인덱스이고 m은 주파수 밴드이다. 예를 들어, 선형 에코 제거기(LEC)는 기준 신호 그 리고 전달 경로를 나타내는 사전에 모델링된 전달 함수에 대한 컨볼루션(convolution) 연산을 실행할 수 있다. 선형 에코 제거기(LEC)는 적응 필터(adaptive filter)를 포함할 수 있고, 적응 필터를 이용하여 마이크로폰 신 호에서 선형 에코(X'(κ, m))가 제거된 출력 신호(E(κ, m))를 생성할 수 있다. 선형 에코(X'(κ, m))가 마이크 로폰 신호의 실제 에코와 일치하도록 적응 필터의 계수는 계속하여 업데이트될 수 있다. 선형 에코 제거기(LEC)는 선형적으로 기준 신호의 선형 에코(X'(κ, m))를 추정하므로, 출력 신호(E(κ, m))에 는 잔여(residual) 에코가 존재할 수 있다. 에코의 비선형 왜곡(nonlinear distortion), 즉 고조파 왜곡(HD)의 근원은 스피커 자체의 비선형적 특성, 스피커와 마이크로폰이 인접함에 따라 발생되는 진동, 전자 장치의 구성 요소들의 비선형적인 특성 등으로 다양할 수 있다. 잔여 에코 억제기(RES)는 선형 에코 제거기(LEC)에 의해 제거되지 않은 잔여 에코를 억제할 수 있다. 잔여 에코 억제기(RES)는 억제 게인(suppression gain; G(κ, m))을 생성할 수 있고 억제 게인(G(κ, m))과 출력 신호(E (κ, m))를 곱하여 출력 신호(R(κ, m))를 생성할 수 있다. 잔여 에코 억제기(RES)는 출력 신호(R(κ, m))에 잔 여 에코가 최대한 포함되지 않도록 억제 게인(G(κ, m))을 적응적으로 업데이트할 수 있다. 전자 장치는 에 코가 제거된 마이크로폰 신호를 전자 장치로 제공할 수 있고 원단 화자는 스피커를 통해 에코가 (최대 한) 제거된 마이크로폰 신호를 들을 수 있다. 도 2는 본 발명의 일 실시 예에 따른 도 1의 AEC 시스템을 도시한다. 도 2를 참조하면, 전자 장치의 AEC 시 스템이 상세하게 도시되었고, 기준 신호가 증폭기를 통해 증폭된 이후에 스피커를 통해 출력되는 것으로 도시되었고, 마이크로폰에 의해 에코가 캡처(capture)되는 것으로 도시되었다. 도면의 간결성 및 설 명의 편의를 위해 전자 장치의 다른 구성 요소들은 생략되었다. AEC 시스템은 제 1 및 제 2 주파수 변환(FT) 모듈들(1100, 1200), 선형 에코 제거기, 잔여 에코 억제기, 및 역 주파수 변환(IFT) 모듈을 포함할 수 있다. 변환 모듈은 변환기로도 지칭될 수 있다. AEC 시스템은 잔여 에코의 크기를 추정하는 프로그램 코드에 대응할 수 있고 프로그램 코드는 AEC 시스템 의 구성 요소(들), 기능(들), 블록(들), 모듈(들)을 포함할 수 있다. 제 1 주파수 변환 모듈은 마이크로폰 신호를 수신하고 시간 영역(time domain)의 마이크로폰 신호를 주파 수 영역으로 변환할 수 있다. 예를 들어, 제 1 주파수 변환 모듈은 MCLT(modulated complex lapped transform), FT(fourier transform), STFT(short-time fourier transform), DFT(discrete fourier transform), FFT(fast fourier transform) 등에 기초하여 변환 동작을 수행하고 마이크로폰 신호(Y(κ, m))를 출력할 수 있다. 제 2 주파수 변환 모듈은 기준 신호를 수신하고 시간 영역의 기준 신호를 주파수 영역으 로 변환할 수 있다. 제 2 주파수 변환 모듈은 제 1 주파수 변환 모듈과 유사하게 변환 동작을 수행 하고 기준 신호(X(κ, m))를 출력할 수 있다.선형 에코 제거기는 기준 신호 그리고 스피커와 마이크로폰간의 경로를 나타내는 사전에 모델링 된 전달 함수에 대한 컨볼루션 연산을 실행하여 기준 신호의 선형 에코(X'(κ, m))를 추정할 수 있다. 선형 에 코 제거기는 선형 에코(X'(κ, m)), 그리고 마이크로폰 신호(Y(κ, m))에서 선형 에코(X'(κ, m))가 제거 된 출력 신호(E(κ, m))를 잔여 에코 억제기로 제공할 수 있다. 잔여 에코 억제기는 마이크로폰 신호(Y(κ, m)), 선형 에코(X'(κ, m)), 추정된 잔여 에코, 및 출력 신호 (E(κ, m))를 수신할 수 있다. 본 발명의 실시 예에 따른 잔여 에코 억제기는 마이크로폰 신호(Y(κ, m)), 선형 에코(X'(κ, m)), 및 추정된 잔여 에코를 이용하여 잔여 에코를 억제하기 위한 억제 게인(G(κ, m)) 을 계산할 수 있다. 잔여 에코 억제기는 억제 게인(G(κ, m))과 출력 신호(E(κ, m))를 곱하여 출력 신호 (R(κ, m))를 생성할 수 있다. 역 주파수 변환 모듈은 잔여 에코 억제기로부터 출력 신호(R(κ, m))를 수신할 수 있다. 역 주파수 변환 모듈은 주파수 영역의 출력 신호(R(κ, m))를 시간 영역으로 변환할 수 있다. 예를 들어, 역 주파수 변환 모듈은 역 MCLT, 역 FT, 역 STFT, 역 DFT, 역 FFT 등에 기초하여 변환 동작을 수행할 수 있다. 도 3a는 본 발명의 일 실시 예에 따른 도 2의 잔여 에코 억제기를 예시적으로 도시한다. 잔여 에코 억제기 (1400a)는 잔여 에코 추정기(1410a), 노이즈 추정기, 제 1 내지 제 3 스무딩 계산기들(1431~1433), 게인 계산기, 및 곱셈기를 포함할 수 있다. 잔여 에코 억제기(1400a)는 도 2의 잔여 에코 억제기 의 일 실시 예일 수 있다. 잔여 에코 추정기(1410a)는 선형 에코(X'(κ, m)) 및 메모리에 저장된 과거(past) 프레임들에서의 선형 에 코들(X'(κ-t, m))을 수신할 수 있다. 도 2의 도시와 달리, 잔여 에코 추정기(1410a)는 마이크로폰 신호(Y(κ, m)를 수신하지 않을 수도 있다. 잔여 에코 추정기(1410a)는 현재 프레임에서의 선형 에코(X'(κ, m))의 크기 및 과거 프레임들에서의 선형 에코들(X'(κ-t, m))의 크기들을 이용하여 현재 프레임에서의 잔여 에코( )의 크기를 추정할 수 있다. 예를 들어, 현재 프레임에서의 잔여 에코( )의 크기는 수학식 1에 의해 계산될 수 있다. 수학식 1"}
{"patent_id": "10-2019-0011091", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "수학식 1에서, i는 기본 주파수 밴드(fundamental frequency band)이고, M은 서브-밴드들의 개수이고, j는 하 모닉이고, H는 고려되는 하모닉들의 개수이고, 2K+1은 (알파벳) k 인덱스로 하모닉 검색 윈도우의 길이이고, m 은 주파수 빈 인덱스(frequency bin index)이고, WR(i, j, k)는 현재 프레임에서의 선형 에코(X'(κ, m))의 크 기에 적용되는 가중치들이고, T는 인덱스 t로 추정을 위한 과거 프레임들의 개수이고, WT1(t, m)은 과거 프레임 들에서의 선형 에코들(X'(κ-t, m))의 크기들에 적용되는 가중치들이다. 가중치들(WR(i, j, k), WT1(t, m))은 잔 여 에코 추정기(1410a)에 의해 적응적으로 업데이트될 수 있다. 본 발명의 일 실시 예에 따르면, 잔여 에코 추정기(1410a)는 현재 프레임에서의 선형 에코(X'(κ, m))의 크기뿐 만 아니라, 과거 프레임들에서의 선형 에코들(X'(κ-t, m))의 크기들을 이용하여 현재 프레임에서의 잔여 에코 ( )의 크기를 추정할 수 있다. 잔여 에코( )의 크기를 계산하는데 선형 에코(X'(κ, m))의 시간 상관 관계가 사용될 수 있다. 따라서, AEC 시스템의 ERLE(echo return loss enhancement)가 개선될 수 있다. 과거 프레임들에서의 선형 에코들(X'(κ-t, m))의 크기들은 메모리에 저장될 수 있다. 전술한대로, 메모리 는 임의의 형태의 저장 매체일 수 있다. 메모리는 어플리케이션 프로세서 내부의 레지스터들,TCM(tightly coupled memory), 또는 SRAM(static random access memory)일 수 있다. 메모리는 어플리케이 션 프로세서 외부의 DRAM(dynamic random access memory)일 수 있다. 현재 프레임에서의 선형 에코(X'(κ, m))의 크기도 메모리에 저장될 수 있다. 과거 프레임들에서의 선형 에코들(X'(κ-t, m))의 크 기들 및 현재 프레임에서의 선형 에코(X'(κ, m))의 크기가 모두 다음 프레임에서의 잔여 에코( ) 의 크기를 추정하는데 사용될 수 있다. 노이즈 추정기는 선형 에코 제거기의 출력 신호(E(κ, m))의 크기를 이용하여 노이즈(N(κ, m))의 크기를 추정할 수 있다. 예를 들어, 노이즈 추정기는 최소 통계(minimum statics)에 따라 노이즈(N(κ, m))의 크기를 계산할 수 있다. 제 1 내지 제 3 스무딩 계산기들(1431~1433)은 잔여 에코( )의 크기, 선형 에코 제거기의 출력 신호(E(κ, m))의 크기, 및 노이즈(N(κ, m))의 크기에 대한 스무딩 연산들을 각각 실행할 수 있다. 제 1 내지 제 3 스무딩 계산기들(1431~1433)은 잔여 에코( )의 크기, 선형 에코 제거기의 출력 신호(E(κ, m))의 크기, 및 노이즈(N(κ, m))의 크기에 회귀적인 평균을 취할 수 있다. 예를 들어, 잔여 에코, 선형 에코 제거기의 출력 신호, 및 노이즈의 스무딩된 크기들은 수학식 2 내지 수학식 4에 의해 계산될 수 있다. 수학식 2"}
{"patent_id": "10-2019-0011091", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "수학식 3"}
{"patent_id": "10-2019-0011091", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "수학식 4"}
{"patent_id": "10-2019-0011091", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "수학식 2 내지 수학식 4에서, α1, α2, 및 α3는 0과 1 사이의 변수들이고 서로 동일하거나 상이할 수 있다. 게인 계산기는 잔여 에코, 선형 에코 제거기의 출력 신호, 및 노이즈의 스무딩된 크기들을 이용하 여 선형 에코 제거기의 출력 신호(E(κ, m))와 곱해지는 억제 게인(G(κ, m))을 계산할 수 있다. 게인 계 산기는 다양한 연산 기법들을 이용하여 억제 게인(G(κ, m))을 계산할 수 있다. 예를 들어, 억제 게인(G (κ, m))은 스펙트럼 차감법(Spectral subtraction)에 기초하여 수학식 5에 의해 계산될 수 있다. 수학식 5"}
{"patent_id": "10-2019-0011091", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "수학식 5에서 β는 0과 1 사이의 변수이다. 다른 예를 들어, 억제 게인(G(κ, m))은 위너 필터(wiener filter)에 기초하여 수학식 6에 의해 계산될 수 있다.수학식 6"}
{"patent_id": "10-2019-0011091", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "수학식 6에서 는 수학식 7에 의해 계산될 수 있다. 수학식 7"}
{"patent_id": "10-2019-0011091", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "수학식 7에서, α4는 0과 1 사이의 변수이고, u(·)는 단위 계단 함수이고, 그리고 는 수학식 8에 의해 계산될 수 있다. 수학식 8"}
{"patent_id": "10-2019-0011091", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "수학식 8에서, α5는 0과 1 사이의 변수이다. 또 다른 예를 들어, 억제 게인(G(κ, m))은 MMSE-STSA(minimum mean square error - short time spectral amplitude estimator)에 기초하여 수학식 9에 의해 계산될 수 있다. 수학식 9"}
{"patent_id": "10-2019-0011091", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "수학식 9에서, 는 감마(gamma) 함수이고, v(κ, m)는 수학식 10에 의해 계산될 수 있고, 그리고 M(·;·;·)는 Confluent hypergeometric 함수일 수 있다. 수학식 10"}
{"patent_id": "10-2019-0011091", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 11, "content": "곱셈기는 선형 에코 제거기의 출력 신호(E(κ, m))에 억제 게인(G(κ, m))을 곱하여 출력 신호(R (κ, m))를 생성할 수 있다. 도 3b는 본 발명의 다른 실시 예에 따른 도 2의 잔여 에코 억제기를 예시적으로 도시한다. 잔여 에코 억제기 (1400b)는 잔여 에코 추정기(1410b), 노이즈 추정기, 제 1 내지 제 3 스무딩 계산기(1431~1433), 게인 계산기, 및 곱셈기를 포함할 수 있다. 잔여 에코 억제기(1400b)는 도 2의 잔여 에코 억제기의 일 실시 예일 수 있다. 잔여 에코 추정기(1410b)와 잔여 에코 추정기(1410a) 간의 차이점이 주로 설명될 것 이고 나머지 구성 요소들(1420~1450)은 도 3a를 참조하여 설명되었다. 잔여 에코 추정기(1410b)는 선형 에코(X'(κ, m)) 및 메모리에 저장된 과거 프레임들에서의 선형 에코들 (X'(κ-t, m))을 수신할 수 있다. 도 2의 도시와 달리, 잔여 에코 추정기(1410a)는 마이크로폰 신호(Y(κ, m)를 수신하지 않을 수도 있다. 잔여 에코 추정기(1410b)는 메모리에 저장된 과거 프레임들에서의 잔여 에코들 ( )을 더 수신할 수 있다. 잔여 에코 추정기(1410b)는 현재 프레임에서의 선형 에코(X'(κ, m))의 크기, 과거 프레임들에서의 선형 에코들(X'(κ-t, m))의 크기들, 및 과거 프레임들에서의 잔여 에코들 ( )의 크기들을 이용하여 현재 프레임에서의 잔여 에코( )의 크기를 추정할 수 있다. 예를 들어, 현재 프레임에서의 잔여 에코( )의 크기는 수학식 11에 의해 계산될 수 있다. 수학식 11"}
{"patent_id": "10-2019-0011091", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 12, "content": "WT2(t, m)은 과거 프레임들에서의 잔여 에코들( )의 크기들에 적용되는 가중치들이다. 가중치들 (WT2(t, m))은 잔여 에코 추정기(1410b)에 의해 적응적으로 업데이트될 수 있다. 본 발명의 다른 실시 예에 따르 면, 잔여 에코 추정기(1410b)는 현재 프레임에서의 선형 에코(X'(κ, m))의 크기뿐만 아니라, 과거 프레임들에 서의 선형 에코들(X'(κ-t, m))의 크기들, 과거 프레임들에서의 잔여 에코들( )의 크기들을 이용하 여 현재 프레임에서의 잔여 에코( )의 크기를 추정할 수 있다. 잔여 에코( )의 크기를 계산하는 데 선형 에코(X'(κ, m))의 시간 상관 관계 및 잔여 에코( )의 시간 상관 관계가 사용될 수 있다. 따라 서, 도 3a의 잔여 에코 추정기(1410a)에 의한 ERLE보다 잔여 에코 추정기(1410b)에 의한 ERLE가 더 개선될 수 있다. 과거 프레임들에서의 잔여 에코들( )의 크기들은 메모리에 저장될 수 있다. 현재 프레임에서의 잔여 에코( )의 크기도 메모리에 저장될 수 있다. 과거 프레임들에서의 잔여 에코들 ( )의 크기들, 현재 프레임에서의 잔여 에코( )의 크기, 과거 프레임들에서의 선형 에코들 (X'(κ-t, m))의 크기들, 및 현재 프레임에서의 선형 에코(X'(κ, m))의 크기가 모두 다음 프레임에서의 잔여 에코( )의 크기를 추정하는데 사용될 수 있다. 도 3c는 본 발명의 또 다른 실시 예에 따른 도 2의 잔여 에코 억제기를 예시적으로 도시한다. 잔여 에코 억제기 (1400c)는 잔여 에코 추정기(1410c), 노이즈 추정기, 제 1 내지 제 3 스무딩 계산기(1431~1433), 게인 계산기, 및 곱셈기를 포함할 수 있다. 잔여 에코 억제기(1400c)는 도 2의 잔여 에코 억제기 의 일 실시 예일 수 있다. 잔여 에코 추정기(1410c)와 잔여 에코 추정기(1410a) 간의 차이점이 주로 설명될 것 이고 나머지 구성 요소들(1420~1450)은 도 3a를 참조하여 설명되었다. 잔여 에코 추정기(1410c)는 선형 에코(X'(κ, m)) 및 메모리에 저장된 과거 프레임들에서의 선형 에코들 (X'(κ-t, m))을 수신할 수 있다. 잔여 에코 추정기(1410b)는 마이크로폰 신호(Y(κ, m)) 및 메모리에 저 장된 과거 프레임들에서의 마이크로폰 신호들(Y(κ-t, m))을 더 수신할 수 있다. 잔여 에코 추정기(1410c)는 현 재 프레임에서의 선형 에코(X'(κ, m))의 크기, 과거 프레임들에서의 선형 에코들(X'(κ-t, m))의 크기들, 현재 프레임에서의 마이크로폰 신호(Y(κ, m))의 크기, 및 과거 프레임들에서의 마이크로폰 신호들(Y(κ-t, m))의 크기들을 이용하여 현재 프레임에서의 잔여 에코( )의 크기를 추정할 수 있다. 예를 들어, 현재 프레임에 서의 잔여 에코( )의 크기는 수학식 12에 의해 계산될 수 있다. 수학식 12"}
{"patent_id": "10-2019-0011091", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 13, "content": "WT3(t, m)은 현재 프레임에서의 마이크로폰 신호(Y(κ, m))의 크기 및 과거 프레임들에서의 마이크로폰 신호들 (Y(κ-t, m))의 크기들에 적용되는 가중치들이다. 가중치들(WT3(t, m))은 잔여 에코 추정기(1410c)에 의해 적응 적으로 업데이트될 수 있다. 본 발명의 또 다른 실시 예에 따르면, 잔여 에코 추정기(1410c)는 현재 프레임에서 의 선형 에코(X'(κ, m))의 크기뿐만 아니라, 과거 프레임들에서의 선형 에코들(X'(κ-t, m))의 크기들, 현재 프레임에서의 마이크로폰 신호(Y(κ, m))의 크기, 및 과거 프레임들에서의 마이크로폰 신호들(Y(κ-t, m))의 크 기들을 이용하여 현재 프레임에서의 잔여 에코( )의 크기를 추정할 수 있다. 잔여 에코( )의 크 기를 계산하는데 선형 에코(X'(κ, m))의 시간 상관 관계 및 마이크로폰 신호(Y(κ, m))의 시간 상관 관계가 사 용될 수 있다. 따라서, 도 3a의 잔여 에코 추정기(1410a)에 의한 ERLE보다 잔여 에코 추정기(1410c)에 의한 ERLE가 더 개선될 수 있다. 과거 프레임들에서의 마이크로폰 신호들(Y(κ-t, m))의 크기들은 메모리에 저장될 수 있다. 현재 프레임에 서의 마이크로폰 신호(Y(κ, m))의 크기도 메모리에 저장될 수 있다. 과거 프레임들에서의 마이크로폰 신 호들(Y(κ-t, m))의 크기들, 현재 프레임에서의 마이크로폰 신호(Y(κ, m))의 크기, 과거 프레임들에서의 선형 에코들(X'(κ-t, m))의 크기들, 및 현재 프레임에서의 선형 에코(X'(κ, m))의 크기가 모두 다음 프레임에서의 잔여 에코( )의 크기를 추정하는데 사용될 수 있다. 도 3d는 본 발명의 또 다른 실시 예에 따른 도 2의 잔여 에코 억제기를 예시적으로 도시한다. 잔여 에코 억제 기(1400d)는 잔여 에코 추정기(1410d), 노이즈 추정기, 제 1 내지 제 3 스무딩 계산기(1431~1433), 게인 계산기, 및 곱셈기를 포함할 수 있다. 잔여 에코 억제기(1400d)는 도 2의 잔여 에코 억제기 의 일 실시 예일 수 있다. 잔여 에코 추정기(1410d)와 잔여 에코 추정기(1410a) 간의 차이점이 주로 설명될 것 이고 나머지 구성 요소들(1420~1450)은 도 3a를 참조하여 설명되었다. 잔여 에코 추정기(1410d)는 선형 에코(X'(κ, m)) 및 메모리에 저장된 과거 프레임들에서의 선형 에코들 (X'(κ-t, m))을 수신할 수 있다. 잔여 에코 추정기(1410b)는 메모리에 저장된 과거 프레임들에서의 잔여 에코들( ), 마이크로폰 신호(Y(κ, m)), 및 메모리에 저장된 과거 프레임들에서의 마이크로폰 신호들(Y(κ-t, m))을 더 수신할 수 있다. 잔여 에코 추정기(1410d)는 현재 프레임에서의 선형 에코(X'(κ, m))의 크기, 과거 프레임들에서의 선형 에코들(X'(κ-t, m))의 크기들, 과거 프레임들에서의 잔여 에코들 ( )의 크기들, 현재 프레임에서의 마이크로폰 신호(Y(κ, m))의 크기, 및 과거 프레임들에서의 마이 크로폰 신호들(Y(κ-t, m))의 크기들을 이용하여 현재 프레임에서의 잔여 에코( )의 크기를 추정할 수 있다. 예를 들어, 현재 프레임에서의 잔여 에코( )의 크기는 수학식 13에 의해 계산될 수 있다.수학식 13"}
{"patent_id": "10-2019-0011091", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 14, "content": "가중치들(WR(i, j, k), WT1(t, m), WT2(t, m), WT3(t, m))은 잔여 에코 추정기(1410d)에 의해 적응적으로 업데이 트될 수 있다. 본 발명의 또 다른 실시 예에 따르면, 잔여 에코 추정기(1410d)는 현재 프레임에서의 선형 에코 (X'(κ, m))의 크기뿐만 아니라, 과거 프레임들에서의 선형 에코들(X'(κ-t, m))의 크기들, 과거 프레임들에서 의 잔여 에코들( )의 크기들, 현재 프레임에서의 마이크로폰 신호(Y(κ, m))의 크기, 및 과거 프레 임들에서의 마이크로폰 신호들(Y(κ-t, m))의 크기들을 이용하여 현재 프레임에서의 잔여 에코( )의 크 기를 추정할 수 있다. 잔여 에코( )의 크기를 계산하는데 선형 에코(X'(κ, m))의 시간 상관 관계, 잔 여 에코( )의 시간 상관 관계, 및 마이크로폰 신호(Y(κ, m))의 시간 상관 관계가 사용될 수 있다. 따 라서, 도 3a 내지 도 3c의 잔여 에코 추정기들(1410a~1410c)에 의한 ERLE보다 잔여 에코 추정기(1410d)에 의한 ERLE가 더 개선될 수 있다. 과거 프레임들에서의 선형 에코들(X'(κ-t, m))의 크기들은 메모리에 저장될 수 있다. 현재 프레임에서의 선형 에코(X'(κ, m))의 크기도 메모리에 저장될 수 있다. 과거 프레임들에서의 잔여 에코들 ( )의 크기들은 메모리에 저장될 수 있다. 현재 프레임에서의 잔여 에코( )의 크기도 메모리에 저장될 수 있다. 과거 프레임들에서의 마이크로폰 신호들(Y(κ-t, m))의 크기들, 현재 프레임에 서의 마이크로폰 신호(Y(κ, m))의 크기, 과거 프레임들에서의 선형 에코들(X'(κ-t, m))의 크기들, 현재 프레 임에서의 선형 에코(X'(κ, m))의 크기, 과거 프레임들에서의 잔여 에코들( )의 크기들, 및 현재 프 레임에서의 잔여 에코( )의 크기가 모두 다음 프레임에서의 잔여 에코( )의 크기를 추정하 는데 사용될 수 있다. 실시 예에 있어서, 잔여 에코 추정기들(1410a~1410d) 각각은 하드웨어 구성 요소(들), 회로(들), 또는 모듈 (들)을 이용하여 구현되는 하드웨어 가속기(즉, 프로세서)일 수 있다. 하드웨어 가속기는 도 1에서 전술한 오디 오 프로세서와 함께 AEC 시스템을 실행할 수 있다. 하드웨어 가속기는 도 3a 내지 도 3d를 참조하여 설명된 잔여 에코 추정기들(1410a~1410d)의 연산들을 실행할 수 있고 오디오 프로세서는 AEC 시스템(100 0)의 나머지 연산들을 실행할 수 있다. 다른 실시 예에 있어서, 잔여 에코 추정기들(1410a~1410d) 각각은 소프 트웨어 구성 요소로서 오디오 프로세서에 의해 실행될 수도 있다. 도 4는 본 발명의 일 실시 예에 따른 도 1의 전자 장치를 예시적으로 도시한다. 도 4는 도 2 그리고 도 3a 내지 도 3d를 참조하여 설명될 것이다. 전자 장치는 어플리케이션 프로세서 및 메모리를 포함할 수 있 다. 어플리케이션 프로세서는 오디오 프로세서 및 메모리를 포함할 수 있다. 어플리케이션 프로 세서에서 선형 에코 제거기 및 잔여 에코 억제기를 포함하는 AEC 시스템이 실행될 수 있다. 메모리는 어플리케이션 프로세서의 내부에 위치하는 레지스터들, TCM, 또는 SRAM일 수 있다. 메모리 는 어플리케이션 프로세서의 외부에 위치하는 DRAM일 수 있다. 도 2 그리고 도 3a 내지 도 3d를 참조 하여 설명된, 현재 프레임에서의 선형 에코(X'(κ, m))의 크기, 마이크로폰 신호(Y(κ, m))의 크기, 및 잔여 에 코( )의 크기는 메모리뿐만 아니라 메모리에 더 저장될 수 있다. 예를 들어, 메모리는 상술한 크기들의 적어도 일부 또는 전부를 저장하는 캐시 메모리로서 동작할 수 있다. 다른 예를 들어, 상술한 크기들은 메모리에도 저장될 수도 있다. 상술한 크기들은 메모리가 지원하는 프로토콜(예를 들어,DDR(double data rate) 인터페이스)에 기초하여 어플리케이션 프로세서에서 메모리로 프레임 단위로 전송될 수 있다. 메모리에 저장된 현재 프레임에서의 선형 에코(X'(κ, m))의 크기, 마이크로폰 신호(Y(κ, m))의 크기, 및 잔여 에코( )의 크기는 다음 프레임의 잔여 에코( )의 크기를 추정하는데 사용되고 그리고 과거 프레임에서의 크기들에 해당할 수 있다. 메모리는 저장된 크기들을 과거 프레임들에서의 선형 에코들 (X'(κ-t, m))의 크기들, 마이크로폰 신호들(Y(κ-t, m))의 크기들, 및 잔여 에코들( )의 크기들로 서 어플리케이션 프로세서로 전송할 수 있다. 또한, 현재 및 과거 프레임들에서의 선형 에코들(X'(κ, m), X'(κ-t, m))의 크기들, 마이크로폰 신호들(Y(κ, m))의 크기들, 그리고 잔여 에코들( )의 크기들에 적용되는 가중치들(WR(i, j, k), WT1(t, m), WT2(t, m), WT3(t, m))은 메모리뿐만 아니라 메모리에 더 저장될 수 있다. 메모리는 저장된 가중 치들을 어플리케이션 프로세서로 전송할 수 있다. 가중치들(WR(i, j, k), WT1(t, m), WT2(t, m), WT3(t, m))은 적응적으로 업데이트될 수 있다. 도 5는 본 발명의 다른 실시 예에 따른 도 1의 AEC 시스템을 예시적으로 도시한다. 도 5는 도 2 그리고 도 3a 내지 도 3d를 참조하여 설명될 것이다. AEC 시스템은 제 1 및 제 2 주파수 변환 모듈들(1100, 1200), 선형 에코 제거기, 잔여 에코 억제 기, 및 역 주파수 변환(IFT) 모듈을 포함할 수 있다. 도 5의 AEC 시스템은 도 2의 AEC 시스 템과 유사하게 구현되거나 실행될 수 있다. AEC 시스템은 더블 토크 검출기를 더 포함할 수 있다. 더블 토크 검출기는 기준 신호 및 마이크로폰 신호를 이용하여 더블 토크가 발생하였는지 여부를 검출할 수 있다. 더블 토크는 원단 화자의 음성과 근단 화자의 음성이 함께 전자 장치로 입력되는 상황을 나타낼 수 있다. 예를 들어, 더블 토크 검출기는 기준 신호의 크기와 마이크로폰 신호의 크기를 비교하거나 기준 신호와 마이크로폰 신호 간의 상관 관계에 기초하여 더블 토크를 검출할 수 있다. 실시 예에 있어서, 더블 토크 검출기에 의해 더블 토크가 검출되면, 잔여 에코 추정기들(1410b~1410d)의 추정 방식이 변경될 수 있다. 예를 들어, 잔여 에코 추정기들(1410b~1410d)에 의해 각각 추정되는 현재 프레임 의 잔여 에코( )의 크기들은 수학식 14 내지 수학식 16에 의해 각각 계산될 수 있다. 수학식 14"}
{"patent_id": "10-2019-0011091", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 15, "content": "수학식 15 수학식 16"}
{"patent_id": "10-2019-0011091", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 16, "content": "수학식 14 내지 수학식 16에서 g(·)는 더블 토크에 관련된 함수이다. 더블 토크가 검출되면, 현재 및 과거 프 레임들의 마이크로폰 신호들(Y(κ-t, m))의 크기들과 과거 프레임들의 잔여 에코들( )의 크기들이 모두 사용되지 않을 수 있고(비활성화될 수 있고) 추정되는 현재 프레임의 잔여 에코( )의 크기에 반영 되지 않을 수 있다. 더블 토크가 검출되지 않으면, 전술한 바와 같이, 잔여 에코 추정기들(1410a~1410d)은 수학 식 1 그리고 수학식 11 내지 수학식 13에 의해 계산되는 현재 프레임의 잔여 에코( )의 크기들을 추정할 수 있다. 도 6은 본 발명의 실시 예에 따라 잔여 에코의 크기를 추정하는 순서도를 예시적으로 도시한다. 도 6은 도 1 내 지 도 5를 참조하여 설명될 것이다. 이하의 설명에서, 잔여 에코 억제기는 도 3a 내지 도 3d의 잔여 에코 억제기들(1400a~1400d) 중 어느 하나를 나타내고 그리고 잔여 에코 억제기의 잔여 에코 추정기는 도 3a 내지 도 3d의 잔여 에코 추정기들(1410a~1410d) 중 어느 하나를 나타낼 수 있다. S110 단계에서, 잔여 에코 추정기는 현재 및 과거 프레임들의 선형 에코들(X'(κ, m), X'(κ-t, m))의 크 기들, 과거 프레임들의 잔여 에코들( )의 크기들, 및 현재 및 과거 프레임들의 마이크로폰 신호들 (Y(κ, m), Y(κ-t, m))의 크기들을 선택적으로 이용하여 현재 프레임의 잔여 에코( )의 크기를 추정할 수 있다. S110 단계의 세부 단계들은 도 7 및 도 8에서 후술될 것이다. S120 단계에서, 잔여 에코 추정기는 선형 에코 제거기의 출력 신호(E(κ, m))의 크기와 잔여 에코 ( )의 크기 간의 차이가 최소가 되도록 S110 단계의 추정에서 선택적으로 사용된 가중치들(WR(i, j, k), WT1(t, m), WT2(t, m), WT3(t, m))의 적어도 일부를 업데이트할 수 있다. 상술한 차이는 수학식 17과 같다. 수학식 17"}
{"patent_id": "10-2019-0011091", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 17, "content": "잔여 에코 추정기는 수학식 17의 차이를 이용하여 S110 단계의 추정에서 선택적으로 사용된 가중치들 (WR(i, j, k), WT1(t, m), WT2(t, m), WT3(t, m))의 적어도 일부를 업데이트할 수 있다. 잔여 에코 추정기 는 가중치들(WR(i, j, k), WT1(t, m), WT2(t, m), WT3(t, m))을 최적화하기 위한 적응 알고리즘으로 NLMS(normalized least mean square), RLS(recursive least square), 칼만 필터 등을 이용할 수 있다. 예를 들 어, NLMS가 이용되는 경우, 가중치들(WR(i, j, k), WT1(t, m), WT2(t, m), WT3(t, m))은 수학식 18과 같이 최적화 될 수 있다. 수학식 18에서 화살표 방향으로 가중치들이 업데이트될 수 있고 그리고 P1, P2, P3는 각각 선형 에 코(X'(κ, m)), 잔여 에코( )), 및 마이크로폰 신호(Y(κ, m))의 파워 스무딩들일 수 있다.수학식 18"}
{"patent_id": "10-2019-0011091", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 18, "content": "다른 예를 들어, RLS가 이용되는 경우, 가중치들(WR(i, j, k), WT1(t, m), WT2(t, m), WT3(t, m))은 수학식 19 내 지 수학식 21과 같이 최적화될 수 있다. 수학식 19에서 화살표 방향으로 가중치들이 업데이트될 수 있다. 수학식 19"}
{"patent_id": "10-2019-0011091", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 19, "content": "수학식 20"}
{"patent_id": "10-2019-0011091", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 20, "content": "수학식 21"}
{"patent_id": "10-2019-0011091", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 21, "content": "실시 예에 있어서, 잔여 에코 추정기는 선형 에코 제거기의 출력 신호(E(κ, m))의 크기와 잔여 에 코( )의 크기 간의 차이가 최소가 되도록 사용된 가중치들(WR(i, j, k), WT1(t, m), WT2(t, m), WT3(t, m))을 업데이트하는 인공 신경망을 실행할 수 있다. 인공 신경망은 상술한 차이가 최소가 되도록 상술한 적응 알고리즘에 기초하여 가중치들(WR(i, j, k), WT1(t, m), WT2(t, m), WT3(t, m))을 학습할 수 있다. 선형 에코 제 거기의 출력 신호(E(κ, m))의 크기는 실제 잔여 에코의 크기를 나타내므로, 차이의 이상적인 값은 예를 들어, 0일 수 있다. S130 단계에서, 제 1 내지 제 3 스무딩 계산기들(1431~1433)은 잔여 에코( )의 크기, 선형 에코 제거기 의 출력 신호(E(κ, m))의 크기, 및 노이즈(N(κ, m))의 크기에 대한 스무딩 연산들을 각각 실행할 수 있 다. S140 단계에서, 게인 계산기는 게인 계산기는 잔여 에코, 선형 에코 제거기의 출력 신호, 및 노이즈의 스무딩된 크기들을 이용하여 선형 에코 제거기의 출력 신호(E(κ, m))와 곱해지는 억 제 게인(G(κ, m))을 계산할 수 있다. S150 단계에서, 곱셈기는 선형 에코 제거기의 출력 신호(E (κ, m))에 억제 게인(G(κ, m))을 곱하여 출력 신호(R(κ, m))를 생성할 수 있다. 도 7은 본 발명의 일 실시 예에 따른 도 6의 S110 단계의 상세한 단계들을 예시적으로 도시한다. S111a 단계에서, 잔여 에코 추정기는 유저 입력에 기초하여 AEC 모드를 선택할 수 있다. 여기서, 유저는 전자 장치의 유저, 어플리케이션 프로세서가 지원하는 OS(operating system), 응용 프로그램, 원단 화 자, 근단 화자 등과 같은 다양한 대상을 나타낼 수 있다. 예를 들어, 잔여 에코 추정기는 5개 AEC 모드들 을 지원할 수 있다. 물론, AEC 모드들의 개수는 상술한 것에 한정되지 않는다. 제 1 모드가 선택된 경우, S112a 단계에서, 잔여 에코 추정기는 현재 프레임의 선형 에코(X'(κ, m))의 크기만을 이용하여 잔여 에코( )의 크기를 추정할 수 있다. 제 1 모드는 디폴트(default) 모드로서 선 형 에코의 시간 상관 관계, 잔여 에코의 시간 상관 관계, 및 마이크로폰 신호의 시간 상관 관계가 잔여 에코 ( )의 크기를 추정하는데 사용되지 않을 수 있다. 제 2 모드가 선택된 경우, S113a 단계에서, 잔여 에코 추정기는 현재 프레임의 선형 에코(X'(κ, m))의 크기에 과거 프레임들의 선형 에코들(X'(κ-t, m))의 크기들을 더 이용하여 잔여 에코( )의 크기를 추 정할 수 있다(도 3a의 잔여 에코 추정기(1410a) 참조). 제 2 모드가 선택되면 선형 에코의 시간 상관 관계가 잔 여 에코( )의 크기를 추정하는데 더 사용될 수 있다. 따라서, 제 2 모드가 선택된 경우의 AEC 시스템 의 ERLE는 제 1 모드가 선택된 경우보다 더 개선될 수 있다. 제 3 모드가 선택된 경우, S114a 단계에서, 잔여 에코 추정기는 현재 프레임의 선형 에코(X'(κ, m))의 크기에 과거 프레임들의 선형 에코들(X'(κ-t, m))의 크기들과 과거 프레임들의 잔여 에코들( )의 크기들을 더 이용하여 잔여 에코( )의 크기를 추정할 수 있다(도 3b의 잔여 에코 추정기(1410b) 참조). 제 3 모드가 선택되면 선형 에코의 시간 상관 관계 및 잔여 에코의 시간 상관 관계가 잔여 에코( )의 크 기를 추정하는데 더 사용될 수 있다. 따라서, 제 3 모드가 선택된 경우의 AEC 시스템의 ERLE는 제 1 또는 제 2 모드들이 선택된 경우보다 더 개선될 수 있다. 제 4 모드가 선택된 경우, S115a 단계에서, 잔여 에코 추정기는 현재 프레임의 선형 에코(X'(κ, m))의 크기에 과거 프레임들의 선형 에코들(X'(κ-t, m))의 크기들과 현재 및 과거 프레임들의 마이크로폰 신호들(Y (κ, m), Y(κ-t, m))의 크기들을 더 이용하여 잔여 에코( )의 크기를 추정할 수 있다(도 3c의 잔여 에 코 추정기(1410c) 참조). 제 4 모드가 선택되면 선형 에코의 시간 상관 관계 및 마이크로폰 신호의 시간 상관관계가 잔여 에코( )의 크기를 추정하는데 더 사용될 수 있다. 따라서, 제 4 모드가 선택된 경우의 AEC 시스템의 ERLE는 제 1 또는 제 2 모드들이 선택된 경우보다 더 개선될 수 있다. 제 5 모드가 선택된 경우, S116a 단계에서, 잔여 에코 추정기는 현재 프레임의 선형 에코(X'(κ, m))의 크기에, 과거 프레임들의 선형 에코들(X'(κ-t, m))의 크기들, 과거 프레임들의 잔여 에코들( )의 크기들, 및 현재 및 과거 프레임들의 마이크로폰 신호들(Y(κ, m), Y(κ-t, m))의 크기들, 및 을 더 이용하여 잔여 에코( )의 크기를 추정할 수 있다(도 3d의 잔여 에코 추정기(1410d) 참조). 제 5 모드가 선택되면 선형 에코의 시간 상관 관계, 잔여 에코의 시간 상관 관계, 및 마이크로폰 신호의 시간 상관 관계가 잔여 에코 ( )의 크기를 추정하는데 더 사용될 수 있다. 따라서, 제 5 모드가 선택된 경우의 AEC 시스템의 ERLE는 제 1 또는 제 4 모드들이 선택된 경우보다 더 개선될 수 있다. 다만, 제 2 내지 제 5 모드들이 선택된 경우에 제 1 모드가 선택된 경우보다 가중치들을 업데이트하고 잔여 에 코의 크기를 추정하는데 필요한 연산량이 증가할 수 있다. 따라서, 유저는 ERLE와 전자 장치의 하드웨어 자 원(resource)을 고려하여 제 1 내지 제 5 모드들 중 어느 하나를 적절히 선택할 수 있다. 도 8은 본 발명의 다른 실시 예에 따른 도 6의 S110 단계의 상세한 단계들을 예시적으로 도시한다. S111b 단계에서, 잔여 에코 억제기는 과거 프레임의 ERLE에 기초하여 AEC 모드를 선택할 수 있다. 잔여 에코 억제기는 제 1 내지 제 5 모드들 중 이전에 선택된 모드에 따른 과거 프레임의 잔여 에코의 크기를 추정하고 그리고 ERLE를 평가할 수 있다. 잔여 에코 억제기는 ERLE와 기준치를 비교하여 이전에 선택된 모드를 변경할 수 있다. 예를 들어, ERLE가 기준치에 미치지 못하면, 잔여 에코 억제기는 더 높은 ERLE를 기대할 수 있는 제 2 내지 제 5 모드들 중 어느 하나를 선택할 수 있다. 다른 예를 들어, ERLE가 기준치보다 훨 씬 높으면, 잔여 에코 억제기는 연산량 감소를 위해 제 1 내지 제 5 모드들 중 어느 하나를 선택할 수 있 다. S112b 내지 S116b 단계들은 도 7의 S112a 내지 S116a 단계들과 실질적으로 동일하다. 도 9는 본 발명의 일 실시 예에 따른 전자 장치를 예시적으로 도시한다. 전자 장치는 도 1의 전자 장치 일 수 있다. 전자 장치는 MIPI(Mobile Industry Processor Interface) 연합(Alliance)에 의해 제안 된 인터페이스를 이용하거나 지원할 수 있는 데이터 처리 장치로 구현될 수 있다. 예를 들어, 전자 장치 는 디지털 카메라, 비디오 캠코더, 스마트폰, 태블릿, 웨어러블 장치(예컨대, 스마트 워치, 스마트 밴드 등), 스마트 스피커, 인공 지능 기반의 음성 인식 장치, 의료 기기, 네비게이션 장치, 가전 제품 등일 수 있다. 전자 장치는 모바일 통신, 컨퍼런스 콜(conference call) 등에 사용될 수 있다. 전자 장치는 스피커 및 마이크로폰을 모두 포함하는 임의의 장치일 수 있다. 전자 장치의 음성 정보를 처리하기 위한 스피커 및 마이크로폰을 포함할 수 있다. 스피커 및 마이크로폰은 도 1에서 전술한 스피커 및 마이크로폰일 수 있다. 전자 장치는 통신 모듈을 통해 외부 시스템 또는 외부 장치(예를 들어, 도 1의 전자 장치)와 통신할 수 있다. 통신 모듈은 LTE(Long Term Evolution), WiMax(Worldwide Interoperability for Microwave Access), GSM(Global System for Mobile communication), CDMA(Code Division Multiple Access), Bluetooth, NFC(Near Field Communication), Wi-Fi(Wireless Fidelity), RFID(Radio Frequency Identification) 등과 같은 다양한 무선 통신 규약 중 적어도 하나를 지원할 수 있다. 통신 모듈은 어플 리케이션 프로세서에 내장될 수도 있다. 전자 장치는 스토리지를 포함할 수 있다. 스토리지는 도 4에서 전술한 메모리에 대응하 거나 또는 메모리와 별개로 구현되는 이차적인 메모리로서 메모리에 저장된 데이터가 백업될 수 있다. 스토리지는 전원 공급에 관계없이 전술한 가중치들(WR(i, j, k), WT1(t, m), WT2(t, m), WT3(t, m)) 및 AEC 시스템을 실행하기 위한 프로그램 코드를 저장하거나 백업할 수 있다. 스토리지는 불휘발성 메모리를 포함할 수 있다. 스토리지는 SD(Secure Digital) 카드, eMMC(Embedded Multimedia Card) 카드 등과 같은 장치들일 수 있다. 전자 장치의 디스플레이는 어플리케이션 프로세서의 제어에 따라 유저와 인터페이스를 수행 할 수 있다. 예를 들어, 유저는 디스플레이를 통해 전술한 AEC 시스템을 활성화할 수 있다. 더 세 부적으로, 유저는 AEC 시스템을 활성화하고 그리고 AEC 시스템이 지원하는 모드들(도 7 및 도 8의제 1 내지 제 5 모드들) 중 하나를 선택할 수 있다(S111a, S111b 단계들 참조). 예를 들어, 유저가 노멀 모드를 선택하는 경우, AEC 시스템은 제 1 모드에 따라 잔여 에코의 크기를 추정할 수 있다. 다른 예를 들어, 유 저가 강화(enhanced) 모드를 선택하는 경우, AEC 시스템은 제 2 내지 제 5 모드들 중 어느 하나에 따라 잔여 에코의 크기를 추정할 수 있다. 물론, 유저는 디스플레이 이외 전자 장치의 다른 입출력 방식 을 통해 AEC 시스템의 모드들 중 어느 하나를 선택할 수도 있다. 어플리케이션 프로세서는 전자 장치의 전반적인 동작을 제어할 수 있다. 어플리케이션 프로세서 는 시스템-온-칩(System-on-Chip) 형태로 구현될 수 있다. 어플리케이션 프로세서는 오디오 프로세 서, 메인 프로세서, 메모리, 및 입출력 인터페이스를 포함할 수 있다. 오디오 프로세 서는 전술한 오디오 프로세서일 수 있고 메모리는 전술한 메모리일 수 있다. 메인 프로세서는 오디오 프로세서와 별개로 어플리케이션 프로세서의 전반적인 동작을 제어 할 수 있다. 메인 프로세서는 어플리케이션 프로세서가 지원하는 다양한 소프트웨어들(응용 프로그 램, 운영 체제, 장치 드라이버 등)을 메모리에 로드하고 실행할 수 있다. 메인 프로세서는 하나 이 상의 CPU(Central Processing Unit)들 또는 하나 이상의 GPU(graphics processing unit)들, 즉 하나 이상의 코 어들을 포함할 수 있다. 메모리에는 메인 프로세서에 의해 실행되는 소프트웨어들, 프로그램, 또는 프로그램 코드가 로드될 수 있다. 예를 들어, 프로그램 또는 프로그램 코드는 커널, 미들웨어, API(application programming interface), 및 응용 프로그램들(AP1~AP4)을 포함할 수 있다. 커널, 미들웨어, 및 API의 적어도 일부는 OS로 지 칭될 수 있다. 커널은 다른 프로그램들(미들웨어, API, 응용 프로그램들(AP1~AP4)에 의한 동작들 또는 기능들을 실행하는데 사용되는 자원(메모리, 스토리지)을 관리할 수 있다. 미들웨어는 API 또는 응용 프로그 램들(AP1~AP4)과 커널 간의 데이터를 교환을 위한 중개자 역할을 수행할 수 있다. API는 응용 프로그램들 (AP1~AP4)이 커널 또는 미들웨어에서 제공되는 기능을 제어하기 위한 인터페이스일 수 있다. 응용 프로그램들(AP1~AP4)의 개수는 도 9에서 도시된 것으로 한정되지 않는다. 전술한대로 메모리에는 AEC 시스템을 실행하기 위한 프로그램 코드가 저장되고 메모리에 AEC 시스템이 로드되고 실 행될 수 있다. 예를 들어, 응용 프로그램들(AP1~AP4) 중 음성 통신과 관련된 어느 하나는 AEC 시스템이 지원하는 모드들(도 7 및 도 8의 제 1 내지 제 5 모드들) 중 어느 하나를 선택할 수 있다(S111a 단계 참조). AEC 시스템이 지원하는 모드들을 선택할 수 있는 프로그램 코드는 AEC 시스템을 실행하기 위한 프 로그램 코드와 동일할 수도 있고 상이할 수 있다. 입출력 인터페이스는 어플리케이션 프로세서와 전자 장치 내 다른 구성 요소들 간의 데이터 교환을 위한 인터페이스 동작을 수행할 수 있다. 예를 들어, 입출력 인터페이스를 통해 메모리에 저장된 데이터가 스토리지로 전송되고 백업될 수 있다.도면 도면1 도면2 도면3a 도면3b 도면3c 도면3d 도면4 도면5 도면6 도면7 도면8 도면9"}
{"patent_id": "10-2019-0011091", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시 예에 따른 통신 시스템을 예시적으로 도시한다. 도 2는 본 발명의 일 실시 예에 따른 도 1의 AEC 시스템을 도시한다. 도 3a는 본 발명의 일 실시 예에 따른 도 2의 잔여 에코 억제기를 예시적으로 도시한다. 도 3b는 본 발명의 다른 실시 예에 따른 도 2의 잔여 에코 억제기를 예시적으로 도시한다. 도 3c는 본 발명의 또 다른 실시 예에 따른 도 2의 잔여 에코 억제기를 예시적으로 도시한다. 도 3d는 본 발명의 또 다른 실시 예에 따른 도 2의 잔여 에코 억제기를 예시적으로 도시한다. 도 4는 본 발명의 일 실시 예에 따른 도 1의 전자 장치를 예시적으로 도시한다. 도 5는 본 발명의 다른 실시 예에 따른 도 1의 AEC 시스템을 예시적으로 도시한다. 도 6은 본 발명의 실시 예에 따라 잔여 에코의 크기를 추정하는 순서도를 예시적으로 도시한다. 도 7은 본 발명의 일 실시 예에 따른 도 6의 S110 단계의 상세한 단계들을 예시적으로 도시한다. 도 8은 본 발명의 다른 실시 예에 따른 도 6의 S110 단계의 상세한 단계들을 예시적으로 도시한다. 도 9는 본 발명의 일 실시 예에 따른 전자 장치를 예시적으로 도시한다."}
