{"patent_id": "10-2022-7029042", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0131311", "출원번호": "10-2022-7029042", "발명의 명칭": "생검용 MRI 안내형 로봇 시스템 및 방법", "출원인": "프로맥소 인크.", "발명자": "쿠마르 디네쉬"}}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "안내형 로봇 시스템(guided robotic system)으로서, 상기 시스템은,대상체의 자기 공명 이미지를 연속적으로 획득하기 위한 자기 이미징 장치;로봇 암, 및상기 자기 공명 이미지를 분석하고 상기 대상체의 부분을 식별하기 위한 컴퓨터 시스템을 포함하며,상기 로봇 암을 상기 대상체의 부분으로 안내하기 위해 상기 자기 공명 이미지가 실시간으로 분석되는, 시스템."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 로봇 암은, 약물 전달을 위해 구성되는 구성요소에 부착되는, 시스템."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 로봇 암은, 시편을 추출하기 위해 상기 대상체의 부분 내에 바늘을 삽입하도록 구성되는,시스템."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 로봇 암은, 상기 대상체의 부분 내에 스텐트를 배치하도록 구성되는, 시스템."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 로봇 암은, 상기 대상체의 부분으로부터 샘플을 제거하도록 구성되는 바늘에 부착되는,시스템."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 로봇 암은, 상기 대상체의 부분을 절단함으로써, 상기 식별된 부분을 제거하도록 구성되는, 시스템."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 상기 로봇 암은, 복수의 바늘을 포함하는 엔드 이펙터에 부착되는, 시스템."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 로봇 암은, 하나 이상의 스텐트를 운반하도록 구성되는 엔드 이펙터에 부착되는, 시스템."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서, 상기 로봇 암은, 하나 이상의 근접치료 시드를 운반하도록 구성되는 엔드 이펙터에 부착되는,시스템."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서, 상기 로봇 암은, 경회음부 생검, 경회음부 LDR 근접치료, 경회음부 HDR 근접치료, 경회음부 레이저 절제, 경회음부 냉동절제, 경직장 HIFU, 유방 생검, 뇌 심부 자극술(DBS, deep brain stimulation), 뇌생검, 간 생검, 신장 생검, 폐 생검, 관상동맥 스텐트 삽입, 뇌 스텐트 삽입, 및 세기 조절 방사선 치료 안내로구성되는 의료 절차의 목록으로부터의 의료 절차에서의 검사를 위해 시편을 추출하도록 구성되는, 시스템."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "공개특허 10-2022-0131311-3-안내형 로봇 시스템을 사용하는 방법으로서,대상체의 라이브(live) 자기 공명 이미지를 획득하는 단계;상기 대상체의 타겟 부분을 연속적으로 식별하기 위해 상기 라이브 자기 공명 이미지의 이미지 분석을 수행하는단계;상기 라이브 자기 공명 이미지에 기초하여 상기 대상체의 식별된 타겟 부분을 향해 로봇 암을 자동으로 안내하는 단계; 및상기 대상체의 타겟 부분에서 절차를 수행하는 단계를 포함하는, 방법."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 획득된 라이브 자기 공명 이미지는, 상기 절차를 제어하기 위한 기능 버튼을 포함하는 그래픽사용자 인터페이스(GUI) 내에 디스플레이되는, 방법."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서, 획득된 라이브 자기 공명 이미지는, 상기 절차 중에 삽입된 바늘 근처의 고해상도의 이미지부분 및 상기 바늘로부터 더 멀리 떨어진 곳의 더 낮은 해상도의 이미지 부분을 포함하는, 방법."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서,상기 절차를 수행하는 단계 동안의 환자 움직임에 대해, 획득된 라이브 자기 공명 이미지를 정정하는 단계를 더포함하는, 방법."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11항에 있어서,상기 바늘의 삽입 동안의 움직임 인공물에 대해, 획득된 라이브 자기 공명 이미지를 정정하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제14항에 있어서,상기 환자 움직임에 대해 수동으로 정정하기 위해 기존의 동작을 오버라이드하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제11항에 있어서,터치 입력, 마우스 입력, 또는 조이스틱 입력을 사용하여 상기 GUI를 제어함으로써 상기 로봇 암을 수동으로 전진시키는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제11항에 있어서,상기 로봇 암에 부착되는 바늘을 제공하는 단계,상기 바늘의 위치를 포착하기 위해 자동 분할을 수행하는 단계;상기 바늘을 인출하는 단계; 및 상기 바늘을 다음 타겟 위치로 전진시키는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제11항에 있어서, 상기 절차는, 경회음부 생검, 경회음부 LDR 근접치료, 경회음부 HDR 근접치료, 경회음부 레이저 절제, 경회음부 냉동절제, 경직장 HIFU, 유방 생검, 뇌 심부 자극술(DBS), 뇌 생검, 간 생검, 신장 생검, 폐공개특허 10-2022-0131311-4-생검, 관상동맥 스텐트 삽입, 뇌 스텐트 삽입, 및 세기 조절 방사선 치료 안내로 구성되는 의료 절차의 목록으로부터의 하나의 의료 절차를 포함하는, 방법."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "안내형 로봇 시스템을 사용하는 방법으로서,대상체의 자기 공명 이미지를 연속적으로 획득하는 단계;상기 자기 공명 이미지 내에서 상기 대상체의 타겟 부분을 연속적으로 식별하는 단계;로봇 암에 부착된 바늘을 상기 대상체의 식별된 타겟 부분을 향해 안내하는 단계(상기 대상체의 타겟 부분으로상기 바늘을 안내하기 위해 상기 자기 공명 이미지가 실시간으로 분석됨); 및상기 대상체의 타겟 부분에 상기 바늘을 삽입하고 시편을 추출하는 단계를 포함하는, 방법."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제20항에 있어서, 연속적으로 획득된 라이브 자기 공명 이미지는, 상기 바늘의 삽입 동안의 제어를 위한 기능버튼을 포함하는 그래픽 사용자 인터페이스(GUI) 내에 디스플레이되는, 방법."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제20항에 있어서, 연속적으로 획득된 라이브 자기 공명 이미지는, 상기 바늘 근처의 고해상도의 이미지 부분 및상기 바늘로부터 더 멀리 떨어진 곳의 더 낮은 해상도의 이미지 부분을 포함하는, 방법."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제20항에 있어서,상기 바늘의 삽입 동안의 모션 블러링을 보상하기 위해, 연속적으로 획득된 라이브 자기 공명 이미지를 자동으로 정정하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제23항에 있어서,정정된 획득된 라이브 자기 공명 이미지에 기초하여 삽입 동안 상기 바늘의 궤적을 자동으로 정정하는 단계를더 포함하는, 방법."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제23항에 있어서,모션 블러에 대해 수동으로 정정하기 위해 기존의 안내된 궤적을 오버라이드하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "제20항에 있어서,터치 입력, 마우스 입력, 또는 조이스틱 입력을 사용하여 상기 GUI를 제어함으로써 상기 로봇 암을 수동으로 전진시키는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "제20항에 있어서,상기 바늘의 위치를 포착하기 위해 자동 분할을 수행하는 단계;상기 바늘을 인출하는 단계; 및 상기 바늘을 다음 타겟 위치로 전진시키는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_28", "content": "공개특허 10-2022-0131311-5-제20항에 있어서, 추출된 시편은, 경회음부 생검, 경회음부 LDR 근접치료, 경회음부 HDR 근접치료, 경회음부 레이저 절제, 경회음부 냉동절제, 경직장 HIFU, 유방 생검, 뇌 심부 자극술(DBS), 뇌 생검, 간 생검, 신장 생검,폐 생검, 관상동맥 스텐트 삽입, 뇌 스텐트 삽입, 및 세기 조절 방사선 치료 안내로 구성되는 목록으로부터의의료 절차에서 검사되는, 방법."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "제20항에 있어서, 상기 안내하는 단계는, 자기 공명 이미지를 연속적으로 획득하도록 구성되는 자기 이미징 장치의 중앙에 있는 보어를 통해 상기 바늘을 안내하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_30", "content": "안내형 시스템을 사용하는 방법으로서,대상체의 라이브 자기 공명 이미지를 획득하는 단계;상기 라이브 자기 공명 이미지 내에서 상기 대상체의 타겟 부분을 연속적으로 식별하는 단계;기계 암에 부착된 엔드 이펙터를 상기 대상체의 식별된 타겟 부분을 향해 안내하는 단계(상기 엔드 이펙터는 복수의 바늘을 운반함); 및상기 대상체의 타겟 부분에 상기 복수의 바늘을 한 번에 하나씩 삽입하고 상기 대상체의 타겟 부분으로부터 복수의 시편을 추출하는 단계를 포함하는, 방법."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_31", "content": "제30항에 있어서, 획득된 라이브 자기 공명 이미지는, 상기 복수의 바늘의 삽입 동안의 제어를 위한 기능 버튼을 포함하는 그래픽 사용자 인터페이스(GUI) 내에 디스플레이되는, 방법."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_32", "content": "제30항에 있어서, 획득된 라이브 자기 공명 이미지는, 삽입된 바늘 근처의 고해상도의 이미지 부분 및 상기 삽입된 바늘로부터 더 멀리 떨어진 곳의 더 낮은 해상도의 이미지 부분을 포함하는, 방법."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_33", "content": "제30항에 있어서,상기 복수의 바늘의 삽입 동안의 모션 블러링을 보상하기 위해, 상기 획득된 라이브 자기 공명 이미지를 자동으로 정정하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_34", "content": "제33항에 있어서,정정된 획득된 라이브 자기 공명 이미지에 기초하여 삽입 동안 삽입되는 바늘의 궤적을 자동으로 정정하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_35", "content": "제34항에 있어서,모션 블러에 대해 수동으로 정정하기 위해 기존의 안내된 궤적을 오버라이드하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_36", "content": "제30항에 있어서,터치 입력, 마우스 입력, 또는 조이스틱 입력을 사용하여 GUI를 제어함으로써 상기 기계 암을 수동으로 전진시키는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_37", "content": "공개특허 10-2022-0131311-6-제30항에 있어서,삽입된 바늘의 위치를 포착하기 위해 자동 분할을 수행하는 단계;상기 삽입된 바늘을 인출하는 단계; 및 다음 위치에 추가적인 바늘을 삽입하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_38", "content": "제30항에 있어서, 추출된 시편은, 경회음부 생검, 경회음부 LDR 근접치료, 경회음부 HDR 근접치료, 경회음부 레이저 절제, 경회음부 냉동절제, 경직장 HIFU, 유방 생검, 뇌 심부 자극술(DBS), 뇌 생검, 간 생검, 신장 생검,폐 생검, 관상동맥 스텐트 삽입, 뇌 스텐트 삽입, 및 세기 조절 방사선 치료 안내로 구성되는 목록으로부터의하나 이상의 의료 절차에서 검사되는, 방법."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_39", "content": "제30항에 있어서, 상기 기계 암에 부착된 엔드 이펙터를 상기 대상체의 식별된 타겟 부분을 향해 안내하는 단계는, 자기 공명 이미지를 연속적으로 획득하도록 구성되는 단면 자기 이미징 장치의 중앙에 있는 보어를 통해 안내하는 단계를 포함하는, 방법."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_40", "content": "안내형 로봇 시스템으로서, 상기 시스템은,대상체의 실시간 이미징을 위한 이미징 장치;실시간으로 이미지를 분석하기 위한 컴퓨터 시스템; 및로봇 암을 포함하는 로봇 시스템을 포함하며, 상기 로봇 시스템은, 상기 이미지의 실시간 분석에 기초하여 수술절차 동안 상기 로봇 암을 안내하도록 구성되고, 상기 로봇 암은,근위 단부; 및로봇 수술 도구를 홀딩하도록 구성되는 원위 단부를 포함하고;상기 이미징 장치는, 상기 수술 절차 동안 상기 로봇 암의 근위 단부와 상기 대상체의 중간에 위치되는,시스템."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_41", "content": "제40항에 있어서, 상기 로봇 암의 원위 단부는, 약물 전달을 위해 구성되는 구성요소에 부착되는, 시스템."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_42", "content": "제40항에 있어서, 상기 로봇 암의 원위 단부는, 시편을 추출하기 위해 상기 대상체 내에 바늘을 삽입하도록 구성되는, 시스템."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_43", "content": "제40항에 있어서, 상기 로봇 암은, 상기 대상체 내에 스텐트를 배치하도록 구성되는, 시스템."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_44", "content": "제40항에 있어서, 상기 로봇 암은, 상기 대상체로부터 샘플을 제거하도록 구성되는 바늘에 부착되는, 시스템."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_45", "content": "제40항에 있어서, 상기 로봇 암은 절제 도구에 부착되는, 시스템."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_46", "content": "제40항에 있어서, 상기 로봇 암의 원위 단부는, 복수의 바늘을 포함하는 엔드 이펙터에 부착되는, 시스템.공개특허 10-2022-0131311-7-청구항 47 제40항에 있어서, 상기 로봇 암의 원위 단부는, 하나 이상의 스텐트를 운반하도록 구성되는 엔드 이펙터에 부착되는, 시스템."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_48", "content": "제40항에 있어서, 상기 로봇 암의 원위 단부는, 하나 이상의 근접치료 시드를 운반하도록 구성되는 엔드 이펙터에 부착되는, 시스템."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_49", "content": "제40항에 있어서, 상기 로봇 암은, 경회음부 생검, 경회음부 LDR 근접치료, 경회음부 HDR 근접치료, 경회음부레이저 절제, 경회음부 냉동절제, 경직장 HIFU, 유방 생검, 뇌 심부 자극술(DBS), 뇌 생검, 간 생검, 신장생검, 폐 생검, 관상동맥 스텐트 삽입, 뇌 스텐트 삽입, 및 세기 조절 방사선 치료 안내로 구성되는 의료 절차의 목록으로부터의 의료 절차에서의 검사를 위해 시편을 추출하도록 구성되는, 시스템."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_50", "content": "제40항에 있어서, 상기 로봇 암은, 상기 이미징 장치 내의 보어를 통해 연장되어, 상기 로봇 암의 원위 단부를상기 대상체에 근접하게 위치시키도록 구성되는, 시스템."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_51", "content": "제40항에 있어서, 상기 로봇 암은 모터를 포함하고, 상기 이미징 장치는,상기 모터에 의해 발생된 잡음을 검출하고; 그리고검출된 잡음을 상기 획득된 신호로부터 제거하도록 구성되는 능동형 잡음 상쇄 모듈을 포함하는, 시스템."}
{"patent_id": "10-2022-7029042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_52", "content": "제40항에 있어서, 상기 이미징 장치는, 그 중앙에 보어를 갖는 단면 자기 공명 이미징 장치인, 시스템."}
{"patent_id": "10-2022-7029042", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "안내형 로봇 시스템(guided robotic system)이 개시된다. 안내형 로봇 시스템은, 대상체의 실시간 이미징을 위한 자기 공명 이미징 장치, 실시간으로 이미지를 분석하기 위한 컴퓨터 시스템, 및 이미지의 실시간 분석에 기초하 여 로봇 암을 안내하기 위한 로봇 시스템을 포함한다. 안내형 로봇 시스템을 사용하는 방법이 또한 개시된다. 방 법은, 대상체의 라이브(live) 자기 공명 이미지를 획득하는 단계, 대상체의 타겟 부분을 연속적으로 식별하기 위 해 라이브 자기 공명 이미지를 분석하는 단계, 라이브 자기 공명 이미지에 기초하여 대상체의 식별된 타겟 부분 을 향해 로봇 암을 안내하는 단계, 및 대상체의 타겟 부분에서 절차를 수행하는 단계를 포함한다. 안내형 로봇 시스템을 사용하는 비제한적인 절차는, 예를 들어, 생검, 스텐트 삽입을 포함할 수 있다."}
{"patent_id": "10-2022-7029042", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "관련 출원에 대한 상호 참조 본 출원은, 2020년 1월 23일에 출원되었고 발명의 명칭이 \"GUIDED ROBOTIC SYSTEM, METHODS AND APPARATUS FOR BIOPSY\"인 미국 가특허 출원 일련 번호 제62/965,070호의 35 U.S.C. § 119(e)에 따른 우선권의 이익을 주장하 며, 그 전체 개시 내용은 본원에 참조로서 통합된다."}
{"patent_id": "10-2022-7029042", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "자기 이미징은, 특히 자기 공명 이미징(MRI, magnetic resonance imaging)은 현대 의학에서 보편적이다. MRI는 여전히 스크리닝을 위한 진단 스캔, 계획 생검 및 계획 치료, 또는 수술적 중재를 수행하기 위한 최상의 이미징 방법 중 하나이지만, 동작 또는 절차 동안 안내를 위해 MRI 시스템을 사용하는 것은 어렵고, 일부 경우에는 다 양한 문제로 인해 매우 제한된 성공을 거두기도 한다. 문제점 중 일부는, 예를 들어, MRI 시스템 내에서의 이미 징에 필요한 강한 자기장으로부터 기인한다. 이러한 경우, 자기 공명 이미징 동안, MRI 시스템 내부의 큰 자석 으로부터의 강한 자기력은, 금속 또는 임의의 자화 가능한 부분을 포함하는 수술 또는 진단 도구를 손상시킬 수 있다. 일부 경우, 강한 자기장은, 강한 자기장이 존재하는 가운데 외과의사 또는 의료인을 위험에 빠뜨릴 수도 있다. 안전상의 이유로 외과의사 또는 의료인 대신에 로봇 또는 로봇 시스템이 사용되는 경우, 강한 자기장은 계속하여, 예를 들어 제어 시스템 또는 메커니즘, 또는 결합된 로봇 암의 상호 연결 조인트를 비롯한, 로봇의 다양한 구성요소와 간섭할 수 있으며, 따라서 로봇이 일시적으로 또는 영구적으로 오작동하게 할 수 있다. 따라 서, MRI 시스템과 같은 의료 이미징 장치와 함께 효과적이고 정확하게 동작할 수 있는 로봇 시스템이 필요하다."}
{"patent_id": "10-2022-7029042", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "발명의 내용다양한 구현예에 따르면, 안내형 로봇 시스템(guided robotic system)이 제공된다. 안내형 로봇 시스템은, 대상 체의 자기 공명 이미지를 연속적으로 획득하기 위한 자기 이미징 장치, 로봇 암, 및 자기 공명 이미지를 분석하 고 대상체의 부분을 식별하기 위한 컴퓨터 시스템을 포함하며, 로봇 암을 대상체의 부분으로 안내하기 위해 자 기 공명 이미지가 실시간으로 분석된다. 시스템의 다양한 구현예에 따르면, 로봇 암은 약물 전달을 위해 구성되는 구성요소에 부착된다. 다양한 구현예 에 따르면, 로봇 암은 시편을 추출하기 위해 대상체의 부분 내에 바늘을 삽입하도록 구성된다. 다양한 구현예에 따르면, 로봇 암은 대상체의 부분 내에 스텐트를 배치하도록 구성된다. 다양한 구현예에 따르면, 로봇 암은 대 상체의 부분으로부터 샘플을 제거하도록 구성되는 바늘에 부착된다. 다양한 구현예에 따르면, 로봇 암은 대상체 의 부분을 절단함으로써 식별된 부분을 제거하도록 구성된다. 다양한 구현예에 따르면, 로봇 암은 복수의 바늘을 포함하는 엔드 이펙터에 부착된다. 다양한 구현예에 따르면, 로봇 암은 하나 이상의 스텐트를 운반하도록 구성되는 엔드 이펙터에 부착된다. 다양한 구현예에 따르면, 로봇 암은 하나 이상의 근접치료 시드를 운반하도록 구성되는 엔드 이펙터에 부착된다. 다양한 구현예에 따르면, 로봇 암은 경회음부 생검, 경회음부 LDR 근접치료, 경회음부 HDR 근접치료, 경회음부 레이저 절제, 경회음부 냉동절제, 경직장 HIFU, 유방 생검, 뇌 심부 자극술(DBS; deep brain stimulation), 뇌 생검, 간 생검, 신장 생검, 폐 생검, 관상동맥 스텐트 삽입, 뇌 스텐트 삽입, 및 세기 조절 방사선 치료 안내로 구성되는 의료 절차의 목록으로부터의 의료 절차에서의 검사를 위해 시편을 추출하도록 구성된다. 다양한 구현예에 따르면, 안내형 로봇 시스템을 사용하는 방법이 제공된다. 방법은, 대상체의 라이브(live) 자 기 공명 이미지를 획득하는 단계, 대상체의 타겟 부분을 연속적으로 식별하기 위해 라이브 자기 공명 이미지의 이미지 분석을 수행하는 단계, 라이브 자기 공명 이미지에 기초하여 대상체의 식별된 타겟 부분을 향해 로봇 암 을 자동으로 안내하는 단계, 및 대상체의 타겟 부분에서 절차를 수행하는 단계를 포함한다. 방법의 다양한 구현예에 따르면, 획득된 라이브 자기 공명 이미지는, 절차를 제어하기 위한 기능 버튼을 포함하 는 그래픽 사용자 인터페이스(GUI; graphical user interface) 내에 디스플레이된다. 다양한 구현예에 따르면, 획득된 라이브 자기 공명 이미지는 절차 중에 삽입된 바늘 근처의 고해상도의 이미지 부분 및 바늘로부터 더 멀 리 떨어진 곳의 더 낮은 해상도의 이미지 부분을 포함한다. 다양한 구현예에 따르면, 방법은 절차를 수행하는 단계 동안의 환자 움직임에 대해, 획득된 라이브 자기 공명 이미지를 정정하는 단계를 더 포함한다. 다양한 구현예에 따르면, 방법은 바늘의 삽입 동안의 움직임 인공물에 대해, 획득된 라이브 자기 공명 이미지를 정정하는 단계를 더 포함한다. 다양한 구현예에 따르면, 방법은 환자 움직임에 대해 수동으로 정정하기 위해 기존의 동작을 오버라이드하는 단계를 더 포함한다. 다양한 구현예에 따 르면, 방법은 터치 입력, 마우스 입력, 또는 조이스틱 입력을 사용하여 GUI를 제어함으로써 로봇 암을 수동으로 전진시키는 단계를 더 포함한다. 다양한 구현예에 따르면, 방법은 로봇 암에 부착되는 바늘을 제공하는 단계, 바늘의 위치를 포착하기 위해 자동 분할을 수행하는 단계, 바늘을 인출하는 단계, 및 바늘을 다음 타겟 위치로 전진시키는 단계를 더 포함한다. 방법의 다양한 구현예에 따르면, 절차는 경회음부 생검, 경회음부 LDR 근접치료, 경회음부 HDR 근접치료, 경회 음부 레이저 절제, 경회음부 냉동절제, 경직장 HIFU, 유방 생검, 뇌 심부 자극술(DBS), 뇌 생검, 간 생검, 신장 생검, 폐 생검, 관상동맥 스텐트 삽입, 뇌 스텐트 삽입, 및 세기 조절 방사선 치료 안내로 구성되는 의료 절차 의 목록으로부터의 하나의 의료 절차를 포함한다. 다양한 구현예에 따르면, 안내형 로봇 시스템을 사용하는 방법이 제공된다. 방법은, 대상체의 자기 공명 이미지 를 연속적으로 획득하는 단계, 자기 공명 이미지 내에서 대상체의 타겟 부분을 연속적으로 식별하는 단계, 로봇 암에 부착된 바늘을 대상체의 식별된 타겟 부분을 향해 안내하는 단계(대상체의 타겟 부분으로 바늘을 안내하기 위해 자기 공명 이미지가 실시간으로 분석됨), 및 대상체의 타겟 부분에 바늘을 삽입하고 시편을 추출하는 단계 를 포함한다. 방법의 다양한 구현예에 따르면, 연속적으로 획득된 라이브 자기 공명 이미지는 바늘의 삽입 동안의 제어를 위 한 기능 버튼을 포함하는 그래픽 사용자 인터페이스(GUI) 내에 디스플레이된다. 다양한 구현예에 따르면, 연속 적으로 획득된 라이브 자기 공명 이미지는 바늘 근처의 고해상도의 이미지 부분 및 바늘로부터 더 멀리 떨어진 곳의 더 낮은 해상도의 이미지 부분을 포함한다. 다양한 구현예에 따르면, 방법은 바늘의 삽입 동안의 모션 블러링을 보상하기 위해, 연속적으로 획득된 라이브 자기 공명 이미지를 자동으로 정정하는 단계를 더 포함한다. 다양한 구현예에 따르면, 방법은 정정된 획득된 라 이브 자기 공명 이미지에 기초하여 삽입 동안 바늘의 궤적을 자동으로 정정하는 단계를 더 포함한다. 다양한 구 현예에 따르면, 방법은 모션 블러에 대해 수동으로 정정하기 위해 기존의 안내된 궤적을 오버라이드하는 단계를 더 포함한다. 다양한 구현예에 따르면, 방법은 터치 입력, 마우스 입력, 또는 조이스틱 입력을 사용하여 GUI를 제어함으로써 로봇 암을 수동으로 전진시키는 단계를 더 포함한다. 다양한 구현예에 따르면, 방법은 바늘의 위 치를 포착하기 위해 자동 분할을 수행하는 단계, 바늘을 인출하는 단계, 및 바늘을 다음 타겟 위치로 전진시키 는 단계를 더 포함한다. 방법의 다양한 구현예에 따르면, 추출된 시편은 경회음부 생검, 경회음부 LDR 근접치료, 경회음부 HDR 근접치료, 경회음부 레이저 절제, 경회음부 냉동절제, 경직장 HIFU, 유방 생검, 뇌 심부 자극술(DBS), 뇌 생검, 간 생검, 신장 생검, 폐 생검, 관상동맥 스텐트 삽입, 뇌 스텐트 삽입, 및 세기 조절 방사선 치료 안내로 구성 되는 목록으로부터의 의료 절차에서 검사된다. 다양한 구현예에 따르면, 안내하는 단계는 자기 공명 이미지를 연속적으로 획득하도록 구성되는 자기 이미징 장 치의 중앙에 있는 보어를 통해 안내하는 단계를 더 포함한다. 다양한 구현예에 따르면, 안내형 시스템을 사용하는 방법이 제공된다. 방법은, 대상체의 라이브 자기 공명 이미 지를 획득하는 단계, 라이브 자기 공명 이미지 내에서 대상체의 타겟 부분을 연속적으로 식별하는 단계, 기계 암에 부착된 엔드 이펙터를 대상체의 식별된 타겟 부분을 향해 안내하는 단계(엔드 이펙터는 복수의 바늘을 운 반함), 및 대상체의 타겟 부분에 복수의 바늘을 한 번에 하나씩 삽입하고 대상체의 타겟 부분으로부터 복수의 시편을 추출하는 단계를 포함한다. 방법의 다양한 구현예에 따르면, 획득된 라이브 자기 공명 이미지는 복수의 바늘의 삽입 동안의 제어를 위한 기 능 버튼을 포함하는 그래픽 사용자 인터페이스(GUI) 내에 디스플레이된다. 다양한 구현예에 따르면, 획득된 라 이브 자기 공명 이미지는 삽입된 바늘 근처의 고해상도의 이미지 부분 및 삽입된 바늘로부터 더 멀리 떨어진 곳 의 더 낮은 해상도의 이미지 부분을 포함한다. 다양한 구현예에 따르면, 방법은 복수의 바늘의 삽입 동안의 모션 블러링을 보상하기 위해, 획득된 라이브 자기 공명 이미지를 자동으로 정정하는 단계를 더 포함한다. 다양한 구현예에 따르면, 방법은 정정된 획득된 라이브 자기 공명 이미지에 기초하여 삽입 동안 삽입되는 바늘의 궤적을 자동으로 정정하는 단계를 더 포함한다. 다양 한 구현예에 따르면, 방법은 모션 블러에 대해 수동으로 정정하기 위해 기존의 안내된 궤적을 오버라이드하는 단계를 더 포함한다. 다양한 구현예에 따르면, 방법은 터치 입력, 마우스 입력, 또는 조이스틱 입력을 사용하여 GUI를 제어함으로써 기계 암을 수동으로 전진시키는 단계를 더 포함한다. 다양한 구현예에 따르면, 방법은 삽입 된 바늘의 위치를 포착하기 위해 자동 분할을 수행하는 단계, 삽입된 바늘을 인출하는 단계, 및 다음 위치에 추 가적인 바늘을 삽입하는 단계를 더 포함한다. 방법의 다양한 구현예에 따르면, 추출된 시편은 경회음부 생검, 경회음부 LDR 근접치료, 경회음부 HDR 근접치료, 경회음부 레이저 절제, 경회음부 냉동절제, 경직장 HIFU, 유방 생검, 뇌 심부 자극술(DBS), 뇌 생검, 간 생검, 신장 생검, 폐 생검, 관상동맥 스텐트 삽입, 뇌 스텐트 삽입, 및 세기 조절 방사선 치료 안내로 구성 되는 목록으로부터의 하나 이상의 의료 절차에서 검사된다. 방법의 다양한 구현예에 따르면, 기계 암에 부착된 엔드 이펙터를 대상체의 식별된 타겟 부분을 향해 안내하는 단계는, 자기 공명 이미지를 연속적으로 획득하도록 구성되는 단면 자기 이미징 장치의 중앙에 있는 보어를 통 해 안내하는 단계를 포함한다. 다양한 구현예에 따르면, 안내형 로봇 시스템이 제공된다. 안내형 로봇 시스템은, 대상체의 실시간 이미징을 위 한 이미징 장치, 실시간으로 이미지를 분석하기 위한 컴퓨터 시스템, 및 이미지의 실시간 분석에 기초하여 로봇 암을 안내하기 위한 로봇 시스템을 포함한다. 시스템의 다양한 구현예에 따르면, 로봇 암은 약물 전달을 위해 구성되는 구성요소에 부착된다. 다양한 구현예 에 따르면, 로봇 암은 시편을 추출하기 위해 대상체 내에 바늘을 삽입하도록 구성된다. 다양한 구현예에 따르면, 로봇 암은 대상체 내에 스텐트를 배치하도록 구성된다. 다양한 구현예에 따르면, 로봇 암은 대상체로부 터 샘플을 제거하도록 구성되는 바늘에 부착된다. 다양한 구현예에 따르면, 로봇 암은 절제를 제공하도록 구성 되는 구성요소 또는 메커니즘에 부착된다. 다양한 구현예에 따르면, 로봇 암은 복수의 바늘을 포함하는 엔드 이 펙터에 부착된다. 다양한 구현예에 따르면, 로봇 암은 하나 이상의 스텐트를 운반하도록 구성되는 엔드 이펙터 에 부착된다. 다양한 구현예에 따르면, 로봇 암은 하나 이상의 근접치료 시드를 운반하도록 구성되는 엔드 이펙터에 부착된다. 시스템의 다양한 구현예에 따르면, 로봇 암은 경회음부 생검, 경회음부 LDR 근접치료, 경회음부 HDR 근접치료, 경회음부 레이저 절제, 경회음부 냉동절제, 경직장 HIFU, 유방 생검, 뇌 심부 자극술(DBS), 뇌 생검, 간 생검, 신장 생검, 폐 생검, 관상동맥 스텐트 삽입, 뇌 스텐트 삽입, 및 세기 조절 방사선 치료 안내로 구성되는 의료 절차의 목록으로부터의 의료 절차에서의 검사를 위해 시편을 추출하도록 구성된다. 시스템의 다양한 구현예에 따르면, 이미징 장치는 그 중앙에 보어를 갖는 단면 자기 공명 이미징 장치이다. 이들 및 다른 양태 및 구현예가 아래에서 상세히 논의된다. 전술한 정보 및 다음의 상세한 설명은 다양한 양태 및 구현예의 예시적인 예를 포함하고, 청구되는 양태 및 구현예의 성질 및 특징을 이해하기 위한 개요 또는 프 레임워크를 제공한다. 도면은 다양한 양태 및 구현예의 예시 및 추가적인 이해를 제공하며, 본 명세서에 통합되 고 본 명세서의 일부를 구성한다."}
{"patent_id": "10-2022-7029042", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "다음의 국제 특허 출원이 또한 그 각각의 전체가 본원에 참조로서 통합된다: ● 2020년 2월 14일에 출원되었고 발명의 명칭이 \"SYSTEMS AND METHODS FOR ULTRALOW FIELD RELAXATION DISPERSION\"인 국제 출원 제PCT/US2020/018352호(현재 국제 공개 제WO2020/168233호) ● 2020년 2월 24일에 출원되었고 발명의 명칭이 \"SYSTEMS AND METHODS FOR PERFORMING MAGNETIC RESONANCE IMAGING\"인 국제 출원 제PCT/US2020/019530호(현재 국제 공개 제WO2020/172673호); ● 2020년 2월 24일에 출원되었고 발명의 명칭이 \"PSEUDO-BIRDCAGE COIL WITH VARIABLE TUNING AND APPLICATIONS THEREOF\"인 국제 출원 제PCT/US2020/019524호(현재 국제 공개 제WO2020/172672호); ● 2020년 3월 25일에 출원되었고 발명의 명칭이 \"SINGLE-SIDED FAST MRI GRADIENT FIELD COILS AND APPLICATIONS THEREOF\"인 국제 출원 제PCT/US2020/024776호(현재 국제 공개 제WO2020/198395호); ● 2020년 3월 25일에 출원되었고 발명의 명칭이 \"SYSTEMS AND METHODS FOR VOLUMETRIC ACQUISITION IN A SINGLE-SIDED MRI SYSTEM\"인 국제 출원 제PCT/US2020/024778호(현재 국제 공개 제WO2020/198396호); 및 ● 2020년 6월 25일에 출원되었고 발명의 명칭이 \"SYSTEMS AND METHODS FOR IMAGE RECONSTRUCTIONS IN MAGNETIC RESONANCE IMAGING\"인 국제 출원 제PCT/US2020/039667호(현재 국제 공개 제WO2020/264194호). 2018년 6월 8일에 출원되었고 발명의 명칭이 \"UNILATERAL MAGNETIC RESONANCE IMAGING SYSTEM WITH APERTURE FOR INTERVENTIONS AND METHODOLOGIES FOR OPERATING SAME\"인 미국 특허 출원 제16/003,585호는 그 전체가 참 조로서 본원에 통합된다. 다음의 미국 가특허 출원은 그 각각의 전체가 참조로서 본원에 통합된다: ● 2020년 2월 20일에 출원되었고 발명의 명칭이 \"SYSTEMS AND METHODS FOR UTILIZING A RADIO FREQUENCY RECEIVE NETWORK FOR SINGLE-SIDED MAGNETIC RESONANCE IMAGING\"인 미국 가특허 출원 제62/979,332호; ● 2020년 3월 9일에 출원되었고 발명의 명칭이 \"SYSTEMS AND METHODS FOR ADAPTING DRIVEN EQUILIBRIUM FOURIER TRANSFORM FOR SINGLE-SIDED MRI\"인 미국 가특허 출원 제62/987,286호; 및 ● 2020년 3월 9일에 출원되었고 발명의 명칭이 \"SYSTEMS AND METHODS FOR LIMITING K-SPACE TRUNCATION IN A SINGLE-SIDED MRI SCANNER\"인 미국 가특허 출원 제62/987,292호. MRI 안내형 로봇 시스템 및 방법의 다양한 양태를 상세히 설명하기 전에, 예시적인 구현예는 적용 및 사용에 있 어서 첨부된 도면 및 설명에 예시된 부분의 구성 및 배열의 세부사항으로 제한되지 않는다는 점에 주목해야 한 다. 예시적인 구현예는 다른 양태, 변형예, 및 수정예로 구현되거나 다른 양태, 변형예, 및 수정예에 포함될 수 있으며, 다양한 방식으로 실시되거나 수행될 수 있다. 또한, 달리 명시되지 않는 한, 본원에서 사용되는 용어 및 표현은 독자의 편의를 위해 예시적인 구현예를 설명하기 위한 목적으로 선택되었으며, 예시적인 구현예를 제 한하기 위한 목적으로 선택되지 않는다. 또한, 설명되는 양태, 양태의 표현, 및/또는 구현예 중 하나 이상은 다 른 설명되는 양태, 양태의 표현, 및/또는 구현예 중 임의의 하나 이상과 조합될 수 있다는 것이 이해될 것이다 전립선 생검과 같은 일부 의료 절차에서는, 환자가 불편한 엎드린 자세로 긴 절차를 견디는 것이 일반적이며, 이는 종종 전체 절차 동안 하나의 특정한 신체 자세로 움직임 없이 유지하는 것을 포함한다. 이러한 긴 절차에서, MRI 시스템으로부터의 안내를 사용하는 생검을 위해 금속성 강자성 바늘이 사용되는 경우, 바늘은 MRI 시스 템의 강한 자석으로부터의 인력을 경험할 수 있으며, 따라서 절차의 길이 동안 바늘이 그의 경로로부터 이탈하 게 할 수 있다. 비자성 바늘을 사용하는 경우에도, 국소 자기장 왜곡은 자기 공명 이미지의 왜곡을 야기할 수 있고, 따라서 바늘을 둘러싼 곳의 이미지 품질은 불량한 품질을 초래할 수 있다. 이러한 왜곡을 피하기 위해, 종래의 MRI 시스템과 함께 작동하도록, 복잡한 압축 공기 메커니즘을 갖는 공압 로봇이 설계되었다. 그럼에도 불구하고, 현재 사용 가능한 MRI 시스템의 폼 팩터로 인해 타겟 해부학적 구조에 대한 접근은 여전히 난제이다. 본원에서 제시되는 다양한 구현예는, 예를 들어, 로봇 보조식 침습적 의료 절차를 포함하는, 의료 절차에서 안 내하는 데 사용하도록 구성되는 개선된 MRI 시스템을 포함한다. 본원에 개시된 기술, 방법, 및 장치는, 의료 절 차에서 로봇(일반적으로 본원에서 \"로봇 시스템\"으로서 지칭됨)을 자동으로 안내하기 위한 안내로서 자기 공명 이미징을 사용하는 안내형 로봇 시스템에 관한 것이다. 다양한 구현예에 따르면, 개시되는 기술은 안내로서의 자기 공명 이미징과 로봇 시스템을 조합한다. 다양한 구현예에 따르면, 본원에서 개시되는 로봇 시스템은 다른 적절한 이미징 기법, 예를 들어 광학, 초음파, x-선, 레이저, 또는 임의의 다른 적절한 진단 또는 이미징 방법 론과 조합된다. 다양한 구현예에 따르면, 안내형 로봇 시스템은 대상체의 실시간 이미징을 위한 자기 공명 이미징 장치, 실시간 으로 이미지를 분석하기 위한 컴퓨터 시스템, 및 이미지의 실시간 분석에 기초하여 로봇 암을 안내하기 위한 로 봇 시스템을 포함한다. 다양한 구현예에 따르면, 안내형 로봇 시스템을 사용하는 방법은 대상체의 라이브 자기 공명 이미지를 획득하는 단계, 대상체의 타겟 부분을 연속적으로 식별하기 위해 라이브 자기 공명 이미지를 분 석하는 단계, 라이브 자기 공명 이미지에 기초하여 대상체의 식별된 타겟 부분을 향해 로봇 암을 안내하는 단계, 및 대상체의 타겟 부분에서의 절차를 수행하는 단계를 포함할 수 있다. 임의의 침습적 절차를 비롯한, 절 차는, 예를 들어, 생검 또는 스텐트 삽입을 포함할 수 있지만 이들로 제한되지는 않는다. 도 1a는 다양한 구현예에 따른 안내형 로봇 시스템의 개략도이다. 안내형 로봇 시스템은 이미징 장치 , 컴퓨터 시스템, 및 로봇 시스템을 포함한다. 다양한 구현예에 따르면, 안내형 로봇 시스템 은 조작자를 선택적으로 포함한다. 본원에서 설명되는 바와 같은 다양한 구현예에 따르면, 이미징 장치는 자기 공명 이미징 장치이다. 본원에 서 설명되는 바와 같은 다양한 구현예에 따르면, 이미징 장치는 단면 자기 공명 이미징 장치이다. 다양한 구현예에 따르면, 이미징 장치는, 예를 들어 초음파, x-선, 감마선, 자외선, 적외선, 가시광, 레이저, 또 는 이전에 획득된 스캔, 혼합 또는 증강 현실 기반 내비게이션 시스템에 기초한 시각적 안내 등을 포함하지만 이들로 제한되지는 않는 임의의 다른 적절한 진단 또는 이미징 방법론에 기초한 임의의 이미징 장치일 수 있다. 다양한 구현예에 따르면, 자기 공명 이미징(MRI) 이외의 뇌 절차에 사용되는 정위 프레임을 대체하기 위해 로봇 이 사용된다. 이러한 경우, 자기 공명 스캔을 사용하여 절차를 계획하고, 프레임을 자기 공명 이미지에 등록시 키고, 임의의 이미지 안내를 사용하거나 사용하지 않으면서 프레임을 사용하여 중재를 수행한다. 본원에서 설명되는 바와 같은 다양한 구현예에 따르면, 이미징 장치는 그 부근에 적절한 차폐를 갖는 로봇 디바이스를 배치할 수 있게 하는 저자기장 자기 공명 이미징 시스템이다. 다양한 구현예에 따르면, 이미징 장치 는 제한된 프린지 자기장을 갖도록 구성되고, 그 결과로서, 로봇 또는 로봇 암을 손상시키지 않으면서 로 봇 또는 로봇 암이 그 부근에 배치될 수 있다. 다양한 구현예에 따르면, 이미징 장치는 단면 자기 공명 이 미징 시스템이도록 구성된다. 다양한 구현예에 따르면, 이미징 장치의 단면 자기 공명 이미징 시스템은 자 석 어셈블리의 외부에 있는 이미징 영역(예를 들어, 환자의 타겟 해부학적 부분)을 갖는다. 다양한 구현예에 따 르면, 자석 어셈블리는 단면 MRI 시스템 내에서 작동하도록 구성되는 여러 개의 경사 자기장 나선형 코일을 포 함하는 단면 경사 코일 세트를 포함한다. 다양한 구현예에 따르면, 이미징 장치의 단면 MRI 시스템은 자기 장 생성 물질 및 이미징 시스템 구성요소에 의해 환자가 일측에서는 커버되지만 완전히 둘러싸이지는 않도록 구 성된다. 단면 구성은, 이미징 장치로부터 환자를 배치 및/또는 제거하는 동안 불필요한 부담을 감소시키면 서 환자 움직임에 대해 더 적은 제한을 제공한다. 그러므로, 환자의 일측에만 단면 경사 코일 세트를 배치함으 로써 환자는 이미징 장치 내부에 갇혀 있다고 느끼지 않을 것이다. 본원에서 설명되는 바와 같은 다양한 구현예에 따르면, 이미징 장치는 환자(또는 본원에서 일반적으로 \"대 상체\"로서 지칭됨)의 이미지를 연속적으로 획득하도록 구성된다. 본원에서 설명되는 바와 같은 다양한 구현예에 따르면, 이미징 장치는 대상체의 자기 공명 이미지를 연속적으로 획득하도록 구성된다. 다양한 구현예에 따르면, 이미징 장치는 대상체의 실시간 또는 근실시간 이미징을 위해 구성된다. 다양한 구현예에 따르면, 이미징 장치는 대상체의 라이브 이미지, 자기 공명 이미지 등을 획득하도록 구성된다.본원에서 설명되는 바와 같은 다양한 구현예에 따르면, 컴퓨터 시스템은 이미징 장치에 커플링된다. 다양한 구현예에 따르면, 컴퓨터 시스템은 이미지를 자동으로 또는 실시간으로 분석하고 이미지로부터 대 상체의 부분을 식별하도록 구성된다. 다양한 구현예에 따르면, 컴퓨터 시스템은 이미징 장치로부터의 자기 공명 이미지를 분석하고 자기 공명 이미지로부터 대상체의 부분을 식별하도록 구성된다. 다양한 구현예에 따르면, 컴퓨터 시스템은 이미징 장치로부터 수신되는 라이브 이미지, 자기 공명 이미지 등 내에서 대상체의 타겟 부분을 연속적으로 식별하도록 구성된다. 다양한 구현예에 따르면, 컴퓨터 시스템은 이미징 장치로부터의 이미지를 실시간으로 또는 근실시간으로 분석하고, 로봇 시스템에 안내를 제공하도록 구성된다. 다양한 구현예에 따르면, 컴퓨터 시스템은 의사 또는 조작자에 의해 수동으로 입력되는(그리고 이미징 장 치로부터 획득되지 않는) 하나 이상의 이미지를 자동으로 분석하고, 이어서 분석된 이미지로부터 대상체의 부분을 식별하도록 구성된다. 다양한 구현예에 따르면, 컴퓨터 시스템은 의사 또는 조작자에 의해 분석된 하나 이상의 이미지로부터 대상체의 부분을 식별하도록 구성된다. 본원에서 설명되는 바와 같은 다양한 구현예에 따르면, 로봇 시스템은 컴퓨터 시스템에 커플링된다. 다양한 구현예에 따르면, 로봇 시스템은 컴퓨터 시스템으로부터의 안내에 기초하여 로봇 암(또는 본 원에서 일반적으로 \"로봇 시스템\"으로서 지칭됨)을 안내하도록 구성된다. 다양한 구현예에 따르면, 안내는, 예 를 들어 로봇 암에 대한 실행 가능 명령어를 포함한다. 다양한 구현예에 따르면, 실행 가능 명령어는 로봇 암이 기동되도록 하기 위한 순차적 움직임의 세트를 포함한다. 다양한 구현예에 따르면, 실행 가능 명령어는 대상체 의 식별된 타겟 부분을 향해 로봇 암을 안내하는 결과를 초래한다. 다양한 구현예에 따르면, 로봇 암은 컴퓨터 시스템으로부터의 명령어에 기초하여 움직이도록 구성된다. 다양한 구현예에 따르면, 로봇 시스템은 모션 컨트롤러 및 로봇 암을 포함한다. 다양한 구현예에 따르면, 컴퓨터 시스템으로부터의 실행 가능 명령어는 로봇 암이 기동되도록 하기 위한 순차적인 움직임의 세트를 초래하는 명령어를 실행하기 위해 모션 컨트롤러에서 수신된다. 다양한 구현예에 따르면, 실행 가능 명령어는 대상체의 식별된 타겟 부분을 향해 로봇 암을 안내하는 결과를 초래한다. 다양한 구현예에 따르면, 로봇 암은 모션 컨트롤러로부터의 명령어에 기초하여 움직이도록 구성된다. 다양한 구현예에 따르면, 로봇 시스템의 모션 컨트롤러는 컴퓨터 시스템 상에 존재한다. 다양한 구현예에 따르면, 로봇 시스템은 획득된 이미지의 실시간 분석에 기초하여 대상체의 식별된 타겟 부분을 향해 로봇 암(본원에서 \"기계 암\" 또는 \"기계 부재\"로서도 지칭됨)을 안내하고, 기계 암을 대상체의 부 분에 안내하도록 구성된다. 다양한 구현예에 따르면, 로봇 시스템은 이미징 장치에 의한 대상체의 타 겟 부분의 획득된 이미지의 분석에 기초하여 대상체의 식별된 타겟 부분을 향해 로봇 암을 자동으로 안내하도록 구성된다. 다양한 구현예에 따르면, 안내형 로봇 시스템의 실시간 또는 근실시간 동작은 조작자로부 터의 임의의 추가적인 입력 없이 자동으로 발생한다. 도 1a에 도시된 바와 같이, 안내형 로봇 시스템은, 다양한 구현예에 따라서, 조작자를 선택적으로 포 함한다. 다양한 구현예에 따르면, 조작자는 입력 또는 중재가 필요한 안내형 로봇 시스템의 동작 중 에 중재한다. 다양한 구현예에 따르면, 조작자에 의한 중재는, 예를 들어 이미징 장치에서의 이미지 획득 동안, 컴퓨터 시스템에서의 획득된 이미지의 분석 동안, 그리고/또는 로봇 시스템의 안내 동안 발생한다. 다양한 구현예에 따르면, 동작은 안내형 로봇 시스템의 동작 중에 오류가 발생할 때 또는 로봇 조작 중에 코스의 정정이 필요할 때 중재한다. 도 1b는 구현예에 따른 안내형 로봇 시스템을 사용하는 방법(S100)에 대한 흐름도이다. 도 1b에 도시된 바 와 같이, 방법(S100)은 단계(S110)에서 대상체의 이미지를 획득하는 단계를 포함한다. 다양한 구현예에 따르면, 대상체의 이미지를 획득하는 단계는 대상체 또는 환자의 하나 이상의 타겟 해부학적 부분을 획득하는 단계를 포 함한다. 다양한 구현예에 따르면, 이미지는 이미징 장치 또는 외부 소스로부터 획득된다. 획득하는 단계는, 자 기 이미징, 자기 공명 이미징, 초음파, x-선, 감마선, 자외선, 적외선, 가시광, 레이저, 또는 이전에 획득된 스 캔, 혼합 또는 증강 현실 기반 내비게이션 시스템 등에 기초한 시각적 안내 등을 포함하지만 이들로 제한되지는 않는 임의의 적절한 이미징 장치 또는 기법에 의해 수행될 수 있다. 다양한 구현예에 따르면, 이미지는 의사, 환자, 사용자, 또는 조작자와 같은 외부 소스로부터 획득된다. 도 1b에 도시된 바와 같이, 방법(S100)은 단계(S120)에서 대상체의 타겟 부분을 식별하기 위해 이미지를 자동으 로 분석하는 단계를 포함한다. 다양한 구현예에 따르면, 획득된 이미지는 인공 지능(AI, artificial intelligence), 머신 러닝, 이미지 또는 신호 잡음 제거, 분할 알고리즘, 객체 및 경계 식별, 이미지 등록, 적응식 세기 정정, 및 패턴 인식 등을 포함하지만 이들로 제한되지는 않는 하나 이상의 프로세스를 통한 분석을 위해 컴퓨터 시스템과 같은 컴퓨터 시스템에 자동으로 업로드된다. 다양한 구현예에 따르면, 획득된 이미 지는 의사 또는 조작자에 의해 수동으로 분석되고, 분석된 이미지로부터 대상체의 부분을 자동으로 식별하는 데 사용되는 컴퓨터 시스템과 같은 컴퓨터 시스템에 입력된다. 단계(S130)에서, 방법(S100)은 이미지 분석에 기초하여 로봇 암을 대상체의 식별된 타겟 부분에 (자동 안내를 통해) 자동으로 안내하는 단계를 포함한다. 다양한 구현예에 따르면, 자동 안내는 대상체의 타겟 부분의 연속적 으로 획득된 이미지의 분석에 기초하여 실시간 또는 근실시간으로 로봇 암을 안내하는 것을 포함한다. 다양한 구현예에 따르면, 자동 안내는 이미지 분석을 통한 자기 정정을 포함한다. 다양한 구현예에 따르면, 자동 안내 는 획득된 이미지에 기초하여 로봇 암의 궤적을 정정하기 위한 의사 또는 조작자에 의한 간헐적인 중재를 포함 한다. 다양한 구현예에 따르면, 자동 안내는 대안적인 또는 추가적인 의료 절차를 수행하기 위해 획득된 이미지 에 기초하여 로봇 암의 궤적을 변경하기 위한 의사 또는 조작자에 의한 간헐적인 중재를 포함한다. 방법(S100)의 다양한 구현예에 따르면, 로봇 암은 적어도 6 자유도(DoF, degrees of freedom)로 움직이도록 구 성된다. 다양한 구현예에 따르면, 로봇 암은 로봇 암이 6 DoF로 움직이거나, 회전하거나, 스위블할 수 있게 하 는 구성으로 연결된 하나 이상의 기계 암 부분을 포함한다. 다양한 구현예에 따르면, 로봇 암은 대상체의 다양 한 해부학적 부분에 접근하도록 구성된다. 다양한 구현예에 따르면, 로봇 암은 6 미만의 DoF를 가질 수 있으며, 로봇이 평면 내에서만(2 DoF) 그리고 평행 궤적을 따라 계획 내외로(1개의 DoF) 이동하기만 하면 되는 경회음부 생검과 같은 일부 시나리오에 대해 3 DoF 로 충분할 수 있다. 다양한 구현예에 따르면, 전립선에 접근하는 경우에 치골궁과 같은 해부학적 구조에 의해 가려지거나 차단된 영역에 접근할 수 있도록 평면의 x축 및 y축 둘레의 작은 회전을 제공하기 위해 하나 또는 두 개의 추가적인 DoF가 추가될 수 있다. 단계(S140)에서, 방법(S100)은 대상체의 타겟 부분에서 절차를 수행하는 단계를 포함한다. 다양한 구현예에 따 르면, 방법(S100)은, 예를 들어 경회음부 생검, 경회음부 LDR 근접치료, 경회음부 HDR 근접치료, 경회음부 레이 저 절제, 경회음부 냉동절제, 경직장 HIFU, 유방 생검, 뇌 심부 자극술(DBS), 뇌 생검, 간 생검, 신장 생검, 폐 생검, 관상동맥 스텐트 삽입, 뇌 스텐트 삽입, 및 세기 조절 방사선 치료 안내 등을 포함하지만 이들로 제한되 지는 않는 적절한 의료 절차를 수행하는 단계를 포함한다. 도 2는 다양한 구현예에 따른 예시적인 안내형 로봇 시스템의 그래픽 예시이다. 도 2에 예시된 바와 같이, 안내형 로봇 시스템은 자기 이미징 장치, 컴퓨터 시스템, 및 로봇 시스템을 포함한다. 안 내형 로봇 시스템은 여러 양태에서 로봇 시스템과 유사하다. 도 2에 도시된 예시적인 자기 이미징 장치는 의료 절차 중에 이미징되는 환자의 하나 이상의 해부학적 부 분에 대한 접근을 제공하기 위해 단면 자기 코일 세트의 중앙에 보어(본원에서 \"액세스 포트\"로서도 지칭됨)를 포함할 수 있다. 다양한 구현예에 따르면, 자기 이미징 장치는 기계적 구조에 대해 고정된 시야 (FOV, fixed field of view)를 갖는다. 다양한 구현예에 따르면, 고정된 FOV는 직경이 약 4 인치이고 길이가 약 4 인치인 원통형 체적, 또는 약 4 인치의 변을 갖는 정육면체 체적으로서 정의된다. 다양한 구현예에 따르면, 고정된 FOV는 직경/변이 약 2 인치에서부터 직경/변이 약 12 인치까지의 범위이다. 일부 다른 구현예에서, FOV 는, 예를 들어 유방 이미징 응용예를 위해, 더 클 수 있으며, 수신 코일 어레이(예를 들어, 이중 수신 코일)가 총 약 18 인치 내지 24 인치의 측면 정육면체/원통을 커버할 수 있다. 일부 구현예에 따르면, 정의된 고정 FOV 내에서, 로봇 시스템은 로봇 시스템과 자기 이미징 장치 의 이미징 FOV 사이의 고정된 기준 프레임을 결정하도록 교정될 수 있다. 이러한 교정은, 로봇 시스템 이 컴퓨터 시스템을 통해 자기 이미징 장치에 동작 가능하게 커플링되는 것을 보장할 수 있다. 설정 및 교정 프로세스는, 사용할 로봇 시스템과 자기 이미징 장치를 함께 설정하는 것을 포함할 수 있다. 다양한 예에서, 설정은, MR 이미징에서 쉽게 식별 가능한, 동일 평면 상에 있지 않은 적어도 4개의 마커 를 갖는 MR 이미징 팬텀을 구축하는 것을 수반한다. 설정 후 시스템을 교정하기 위해, 다음 단계를 수행할 수 있다. 첫 번째로, 팬텀은 스캐너의 시야 내에 엄격하 게 고정될 수 있고, 이미지가 획득될 수 있다. 두 번째로, 이미지 상에서 한 번에 하나씩 마크를 시각적으로 식 별함으로써 마크의 위치가 기록될 수 있다. 이미지 상에서 보이는 이러한 모든 포인트의 세트는 포인트 세트 (Point Set) A0(Nx3의 치수를 가지며, N은 식별된 포인트의 수임)로 불릴 수 있다. 특정한 예에서, 식별은 분할 및/또는 분류에 의해 자동으로 행해질 수 있다. 세 번째로, 로봇은 자유 주행 모드에서 동작될 수 있고 각 포인트 세트 A0로 내비게이팅될 수 있다. 바늘 팁이 세트 내의 각 포인트에 도달할 때의 로봇의 위치를 기록할 수 있다. 로봇 좌표에 기록된 이러한 모든 포인트의 세트를 포인트 세트 B0(또한 Nx3의 치수를 가짐)라고 부를 수 있다. 네 번째로, B0를 A0로 변환하는 엄격한 선형 최소 제곱 변환을 추정할 수 있다(T: B0-->A0). 이것이 로봇 -이미지 변환이다. 이러한 변환의 역변환은 이미지-로봇 변환이다. 변환 T에 기초하여 교정을 테스트하기 위해, 시야 내의 (예를 들어, X 방향 및 Y 방향으로 1 cm 내지 2 cm 시프 팅된) 새로운 위치로 팬텀을 재배치할 수 있다. 전술한 4개의 교정 단계를 반복하여 포인트 세트 A1 및 B1을 생 성할 수 있다. 이어서, 이전에 추정된 변환 T를 B1에 적용하여 T(B1)를 얻을 수 있고, T(B1)와 A1 사이의 평균 제곱근 오차(RMSE, root mean squared error)를 계산할 수 있다. 마지막으로, RMSE가 허용 가능한 임계값 및/ 또는 값 내에 있는지 결정하기 위해 RMSE를 확인할 수 있다. 도 2에 묘사된 바와 같이, 자기 이미징 장치는, 환자 또는 타겟 부위에 도달하기 위해 로봇 암이 그를 통 해 연장될 수 있는 단일 보어를 포함한다. 다른 예에서, 자기 이미징 장치는 2개 이상의 액세스 포트를 포 함할 수 있다. 각각의 액세스 부분은 환자 및/또는 수술 부위에 대한 접근을 제공할 수 있다. 예를 들어, 다수 의 액세스 포트의 경우, 다수의 액세스 포트는 상이한 방향 및/또는 근위 위치로부터의 접근을 허용할 수 있다. 도 2는 단면 자기 코일 세트의 중앙에 보어를 갖는 예시적인 자기 이미징 장치를 도시하지만, 이러한 자기 이미징 장치는 예시적인 목적으로만 사용된다는 것을 주목한다. 로봇 암은, 본원에서 논의되는 바와 같은 장치 설계(예를 들어, 표준 MRI 시스템, 단면 MRI, 또는 임의의 다른 고려되는 자기 이미징 장치 또는 일 반 이미징 장치)에 관계없이 임의의 자기 이미징 장치와, 또는 일반적으로는 이미징 장치(예를 들어, 이미징 장 치와 관련된 위의 논의 참조)와, 함께 동작하도록 구성될 수 있다. 로봇 보조 의료 절차용 도구를 안내하기 위해 인간 대신 로봇을 사용하는 것은, 현재 사용 가능한 이미징 시스 템의 제한사항 중 일부를 고려하더라도, 특정한 예에서 더 안전하고 더 정확한 접근법일 수 있다. 예를 들어, 이들 제한사항은, 예를 들어 현재의 MRI 시스템의 구조적 설계 및 기하학적 아키텍처로부터 기인할 수 있다. 예 를 들어, 전부는 아니더라도, 환자 치료 센터 내의 대부분의 현재의 MRI 시스템은, 환자가 일반적으로 이미징 동안 MRI 기계의 갠트리(스캐폴드) 내부에 놓이는 자석 구성을 이용한다. 환자를 둘러싸기 위한 자석의 이러한 배열은 환자의 대부분의 해부학적 부분에 대한 직접적인 접근을, 가장 흔하게는, 엄격하게 제한한다. 따라서, 다양한 구현예에 따르면, 환자의 다양한 해부학적 부분에 대한 접근을 제한하지 않는 MRI 시스템(또는 일반적으 로 이미징 시스템)은 로봇의 장점을 추가적으로 이용할 수 있으며, 특히 의료 절차에서 안내 도구로서 로봇을 사용할 수 있다. 따라서, 이러한 시스템은, 예를 들어, 갠트리의 한정하는 기하학적 구조로부터 초래되는 제약 또는 제한 없이, 환자의 임의의 해부학적 부분을 타겟팅하는 데 있어 추가적으로 유익할 수 있으며, 특히 로봇 식 또는 로봇 보조식 침습적 의료 절차에서 그러하다. 예를 들어 도 2에 도시된 바와 같이, 다양한 구현예에 따르면, 컴퓨터 시스템은 자기 이미징 장치 및 로봇 시스템에 커플링될 수 있다. 도 1과 유사하게, 컴퓨터 시스템은, 자기 이미징 장치로부터 획득된 이미지를 실시간으로 분석하고 획득된 이미지로부터 환자(또는 대상체)의 해부학적 부분을 식별하도록 구성될 수 있다. 예를 들어, 의료 절차의 동작 중에, 자기 이미징 장치는, 의료 절차를 위해 환자의 타겟 해부학적 부분으로 이동되어야 하는 바늘, 스텐트, 또는 로봇 시스템의 단부에 부착되는 임의의 것과 같은, 수술 디바이스를 포함할 수도 있는 라이브(실시간) 또는 라이브에 가까운(근실시간) 이미지를 획득하도록 구성된다. 바늘 또는 스텐트를 이미징하는 것은, 환자의 해부학적 부분의 타겟 부분에 대한 바늘 또는 스텐트의 상대적인 위치 확인을 제공한다. 예를 들어, 바늘 또는 스텐트를 FOV 내에 삽입하기 위한 로봇 시스템의 안내 동안, 바늘 또는 스텐트를 포함하는 획득된 이미지의 평면은, 수동으로 결정되어야 하기보다는, 연속적으 로 모니터링된다. 이는, 예를 들어, 바늘을 포함하는 이미징 평면을 아는 것에 대한 이점을 제공한다. 다양한 구현예에 따르면, 획득된 이미지가 해부학적 부분의 타겟 부분에 대한 바늘의 상대적 위치를 결정하기에 충분한 품질을 갖지 못하는 경우, 더 높은 해상도의 이미지가 획득될 수 있다. 다양한 구현예에 따르면, 획득된 이미지 가 해부학적 부분의 타겟 부분에 대한 바늘의 상대적 위치를 결정하기에 충분한 품질을 갖는 경우, 더 낮은 해 상도의 이미지가 더 높은 획득 속도로 취해질 수 있으며, 이는 결과적으로 의료 절차의 동작 중에 실시간 또는 근실시간 이미징 능력을 제공한다. 다양한 구현예에 따르면, 자기 이미징 장치의 이미지 획득 속도는 해상 도에 따라 초당 약 3개 내지 10개의 이미지에서부터 5분당 약 1개의 이미지까지의 범위이다. 다양한 구현예에 따르면, 자기 이미징 장치의 이미지 획득 속도는 초당 최대 약 60개 또는 120개의 이미지 범위이다. 다양한 구현예에 따르면, 로봇 시스템은 자기 이미징 장치 외부에 배치되도록 구성된다. 도 2에 도시 된 바와 같이, 로봇 시스템은, 6 자유도로 이동하도록 구성되는 로봇 암을 포함할 수 있다. 다양한구현예에 따르면, 로봇 암은 로봇 암이 하나 이상의 모션 컨트롤러를 통해 6 자유도로 움직이거 나, 회전하거나, 스위블할 수 있게 하는 구성으로 연결된 중공형 샤프트 및 엔드 이펙터를 포함하는 하나 이상의 기계 암 부분(본원에서 하나 이상의 구성요소로서도 지칭됨)을 포함한다. 이중 화살촉을 갖는 곡선 화살표는, 모션 컨트롤러에 의해 생성되는 회전 움직임을 나타낸다. 다양한 구현예에 따르면, 하나 이상의 모션 컨트롤러는 서보 모터를 포함하지만 이로 제한되지는 않는, 기계식 액추에이터와 같은 액추에이터이 다. 다양한 구현예에 따르면, 하나 이상의 모션 컨트롤러는 공압식, 스프링 장착식, 기계식, 전기 모터, 압전 액추에이터, 또는 이들의 조합과 같은 액추에이터이다. 다양한 구현예에 따르면, 로봇 시스템의 로봇 암은 자기 이미징 장치를 통해 또는 그 주위에서 다양한 관심 해부학적 부분에 접근하도록 구성된다. 다양한 구현예에 따르면, 자기 이미징 장치의 중앙에 있는 보어는 의료 절차 동안 환자의 다양한 관심 해부학적 부분에서의 동작을 위해 로봇 시스템의 로 봇 암에 대한 접근을 제공하도록 특별히 설계된다. 다양한 구현예에 따르면, 자기 이미징 장치의 중 앙에 있는 보어는 로봇 암의 크기를 고려하도록 설계된다. 예를 들어, 보어는 그를 통해, 본원 에서 설명되는 다양한 로봇 암과 같은, 로봇 암을 수용하도록 구성되는 원주를 규정한다. 다양한 구현예에 따르 면, 로봇 시스템의 로봇 암은 자기 이미징 장치의 측면 주위에서 환자의 다양한 해부학적 부분 에 접근하도록 구성된다. 자기 이미징 장치는, 2018년 6월 8일에 출원되었고 발명의 명칭이 \"UNILATERAL MAGNETIC RESONANCE IMAGING SYSTEM WITH APERTURE FOR INTERVENTIONS AND METHODOLOGIES FOR OPERATING SAME\"인 미국 특허 출원 제16/003,585호에 추가적으로 설명되어 있으며, 이 미국 특허 출원은 그 전체가 참조로 서 본원에 통합된다. 다양한 구현예에 따르면, 중공형 샤프트는 엔드 이펙터를 작동시키기 위한 메커니즘용 하우징을 제공하며, 생검 샘플을 취하는 데 필요한 빠른 엔드 이펙터 동작을 제공하기 위한 긴 스크류 드라이브, 샤프트, 또는 다른 메커니즘을 포함할 수 있다. 또한, 중공형 샤프트는 다수의 바늘 및/또는 샘플링된 코어를 수납할 수 있다. 다양한 구현예에 따르면, 도 2에 예시된 바와 같이, 엔드 이펙터는 로봇 암의 한쪽 단부에 부착된다. 다양한 구현예에 따르면, 엔드 이펙터는 하나 이상의 바늘을 수납하거나 운반하고/하거나 하나 이상 의 바늘을 삽입하기 위한 메커니즘, 액추에이터, 하우징 또는 구성, 또는 하나 이상의 스텐트 또는 근접치 료 시드를 수납, 운반, 및/또는 삽입하기 위한 하우징 또는 구성을 포함한다. 다양한 구현예에 따르면, 엔드 이 펙터는 여러 다른 적절한 의료 절차(본원에서 중재로서도 지칭됨) 중에서도, 생검 샘플을 얻기 위해 바늘 을 삽입하기 위한 메커니즘, 절제를 제공하기 위한 구성요소 또는 메커니즘, 또는 근접치료를 수행하기 위 한 구성요소 또는 메커니즘을 포함한다. 다양한 구현예에 따르면, 바늘은 시편을 추출하는 데 사용되며, 시편은 바늘에 부착될 수 있거나, 바늘 내로 흡인될 수 있거나, 바늘을 사용하여 시편이 추출될 수 있는 임의의 다른 메커니즘을 경유할 수 있다. 다양한 구현예에 따르면, 엔드 이펙터는 삽입될 바늘 을 선택하기 위한 최소한의 기계식 또는 공압식 제어부를 갖는다. 다양한 구현예에 따르면, 로봇 암 의 움직임 또는 이동은 바늘을 삽입하거나 인출한다. 다양한 구현예에 따르면, 중공형 샤프트 및 엔드 이펙터를 포함하는 로봇 암의 하나 이상의 기 계 암 부분은 비자성 물질로 제조되고, 예를 들어 모션 제어를 위한 서보 모터와 같은 임의의 전기적 구성요소 를 포함하지 않는다. 이러한 구성에서, 로봇 시스템에 대한, 서보 모터와 같은, 모든 움직임의 정도는, 환 자로부터 멀리 향하는 자기 이미징 장치의 일 측면 상에서 보어 외부에 유지될 수 있다. 이러한 구성 은 로봇 시스템을 자기 이미징 장치의 자석으로부터 멀리 안전하게 보관할 수 있게 한다. 이러한 구 성을 사용하면, 다양한 구현예에 따라서, 로봇 시스템은 로봇 암의 하나 이상의 기계 암 부분을 사용 하여 연장되어 보어를 통해 건너편의 환자의 타겟 부분에 도달할 수 있다. 다양한 구현예에 따르면, 로봇 시스템은 로봇 암의 하나 이상의 기계 암 부분을 사용하여 연장되어, 보어를 통해서가 아니라, 자기 이미징 장치 주위의 환자의 타겟 부분에 도달할 수 있다. 주변에 도달하기 위한 구성은 사지 또는 유 방 생검에 적합하며, 여기서 (로봇 암의 엔드 이펙터에 부착된) 바늘이 환자의 측면으로부터 직교 방향으 로 삽입될 수 있다. 다양한 구현예에 따르면, 바늘은 이미징 평면 내에 삽입되고 바늘 궤적은 이미징 평면 내에 놓이도록 교정된다. 다양한 구현예에 따르면, 바늘은 티타늄, 비자성 스테인리스 스틸, 세라믹 등과 같은 임의의 비자성 물질 을 포함한다. 특정한 예에서, 자기 이미징 장치와의 간섭을 감소시키기 위해 바늘은 전체적으로 비자성일 수 있다. 다양한 구현예에 따르면, 자성 스테인리스 스틸 바늘이 사용될 때 이미지 왜곡이 국부적으로 발생할 수 있으며, 이는 특정한 예에서 일반적으로 발생하는 일이다. 자성 바늘 또는 다른 자성 수술 디바이스를 사용하여 왜곡이 발생하는 경우, 이미지 프로세싱으로 왜곡을 제거할 수 있다. 비자성 바늘을 사용하면 이미지에 대한 왜곡을 야 기하지 않는다는 이점이 있다. 다양한 구현예에 따르면, 생검 바늘과 같은 바늘은, 도 2에 도시된 바와 같 이, 외측 원통형 슬리브 및 내측 코어를 포함한다. 내측 슬리브는 샘플링된 조직을 담기 위한 리세싱 된 영역을 갖는다. 예를 들어, 의료 절차 또는 중재 동안, 내측 슬리브는 먼저 조직을 절단하고, 조직은 리세스 내에 고정된다. 이러한 경우, 외측 슬리브는 곧 이어서 조직을 절단하여 조직의 샘플이 리세스 내에 머무르게 한다. 다양한 구현예에 따르면, 스텐트 또는 근접치료 시드를 배치하기 위해 중공형 바늘이 사용된다. 다양한 구현예 에 따르면, 중공형 바늘은 외측 슬리브, 및 적절한 위치에서 스텐트/시드를 밀어내는 내측 바늘을 포함한다. 다양한 구현예에 따르면, 바늘은 10 G, 12 G, 14 G, 16 G, 및 18 G를 포함하는, 12 G에서부터 18 G까지의 범위의 게이지 사이즈를 포함한다. 다양한 구현예에 따르면, 바늘은 생검용으로는 16 G 내지 18 G 사이즈 이고, 근접치료 또는 절제용으로는 10 G 사이즈이다. 다양한 구현예에 따르면, 바늘은 약 15 cm와 25 cm 사이의 전립선 절차를 위한 길이의 범위를 갖는다. 다양한 구현예에 따르면, 자기 이미징 장치는 고정된 기하학적 구조를 갖는 저자기장 자기 이미징 시스템 이다. 이러한 저자기장 자기 이미징 시스템의 동작 중에, 충분히 낮은 자기장의 자석은 차폐된 로봇 서보 모터 와 간섭하지 않을 수 있다. 그러나, 이들 구성요소의 존재 및 동작은, 동작 중에 자기 이미징 장치에 의해 생성되는 자기장과 간섭할 수 있다. 자기 이미징 동안의 잠재적 간섭을 제거하거나 감소시키기 위해, 로봇 시스 템은, 자기 이미징 장치의 보어를 관통하는 중공형 샤프트 및 엔드 이펙터를 포함하 는 하나 이상의 기계 암 부분을 통해 연장될 수 있는 로봇 암으로 구성된다. 이러한 예에서, 수술 절차 동 안 전체 로봇 도구는 보어에 대해 원위에 있을 수 있고 자기 이미징 장치의 외부에 있을 수 있다. 다 양한 구현예에 따르면, 자기 이미징 장치는 보어와 정렬되고 이미징 구역 내의 다른 영역보다 더 낮은 자 기 간섭을 갖는 원통형 영역을 갖도록 설계된다. 예를 들어, 로봇 도구는 코일로부터 충분히 멀리, 그리고 가장 약한 자기장, 경사장, 및/또는 RF장을 갖는 이미징 구역의 영역 내에 위치될 수 있다. 다양한 양태에서, 이러한 원통형 영역은, 로봇 암이 그 내부로 연장되고 동작하는 곳일 수 있다. 로봇 시스템으로부터의 잠재 적인 자기 간섭을 더욱 감소시키거나 피하기 위해, 로봇 암의 구성요소의 전부 또는 대부분이 비자성 물질 로 구성될 수 있다. 다양한 구현예에 따르면, 자기 이미징 장치는 환자에게 가깝게 그리고 자기 간섭의 원 천으로부터 멀리 유지된다. 예를 들어, 로봇 암 및/또는 로봇 도구용 모터는 보어의 외부에 위치될 수 있 다. 이러한 예에서, 도 14를 참조하면, 환자는 자기 이미징 장치에 근접하고, 자기 이미징 장치는 환자와 로봇 시스템 사이에 있다. 로봇 암의 원위 부분은 자기 이미징 장치를 통해 환자에게 도달할 수 있다. 다 양한 구현예에 따르면, 모터로부터 발생된 잡음을 감지한 후 획득된 MRI 신호로부터 이를 제거하기 위해 능동형 잡음 상쇄 기법이 사용될 수 있다. 다양한 구현예에 따르면, 모터로부터 발생된 임의의 잡음을 제거하기 위해 신호 프로세싱이 사용될 수 있다. 예를 들어, 모터에 의해 발생된 잡음을 제거하기 위하여, MRI 신호는, 잡음 없는 MRI 신호를 생성하기 위해 능동적으로 생성되는 모터 잡음 제거 신호와 조합될 수 있다. 저자기장 자기 이 미징 시스템은, 2020년 2월 14일에 출원되었고 발명의 명칭이 \"SYSTEMS AND METHODS FOR ULTRALOW FIELD RELAXATION DISPERSION\"인 국제 출원 제PCT/US2020/018352호, 현재 국제 공개 제WO2020/172673, 168233호에 추 가적으로 설명되어 있으며, 이 국제 출원은 그 전체가 참조로서 본원에 통합된다. 도 3a는, 다양한 구현예에 따른, 예시적인 안내형 로봇 시스템용 그래픽 사용자 인터페이스(GUI)의 개략도 이다. 도 3a에 도시된 바와 같이, GUI는 좌측 패널, 중간 패널, 및 우측 패널을 포함한다. 도 3a에 도시된 GUI는 예시적의 목적을 위한 것이며, 따라서 비제한적인 예시적 사용자 인터페이스이다. 비제한적인 예로서, GUI는, 침습적 동작 절차, 로봇식 경회음부 전립선 생검에서의 사용을 위해 구성된다. 도 3a에 도시된 바와 같이, 좌측 패널은 로봇 제어를 위한 복수의 버튼을 나타낸다. 다양한 구현예에 따르 면, 버튼은 조작자에 의한 정전용량식 터치, 마우스 입력, 또는 조이스틱 입력에 의해 동작되거나 활성화된다. 다양한 구현예에 따르면, 좌측 패널은 로봇을 제어하기 위한 그리고 다양한 이미징 조정을 위한 터치스크 린 제어부를 포함한다. 다양한 구현예에 따르면, 좌측 패널은, 예를 들어 바늘 움직임의 이전 궤적을 변경 하는 것이지만 이로 제한되지는 않는, 특정한 사용자 동작을 포함하는, 이전 입력을 오버라이드하기 위한 제어 부를 포함한다. 다양한 구현예에 따르면, 좌측 패널은 대상체의 라이브 스캔 동안의 움직임 정정을 위한 버튼을 포함할 수 있다. 중간 패널은 타겟(예를 들어, 전립선)의 부분, 현재 바늘 위치, 현재 바늘 궤적, 및 전립선 내의 타겟 샘플 위치의 라이브 이미지(\"라이브\"라는 용어는 또한 본원에서 \"연속적으로 캡처\"되거나 또는 \"연속적으로 획득\"되는 것을 지칭함)를 나타내는 라이브 안내 뷰를 포함한다. 수술 절차 및/ 또는 중재 동안, 수술 중에 \"라이브\" 이미지를 획득한다. 다양한 구현예에 따르면, 중간 패널은 획득되고 있는 라이브 스캔되는 이미지를 나타내며, 이는 현재 바늘 위치, 바늘 궤적, 및 스캔으로부터 자동으 로 식별되는 타겟을 포함한다. 중간 패널 내의 라이브 안내 뷰에 나타난 시야 내로 바늘이 전진함에 따라, 라이브 이미지는 바늘의 현재 위치를 연속적으로 디스플레이하며, 즉, 업데이트된 현재 바늘 위치 를 디스플레이한다. 일부 구현예에 따르면, 백그라운드(예를 들어, 이면에서의 프로세싱)에서, 이러한 뷰 는 움직임을 보상하기 위해 절차 전의 이미지로부터의 대응하는 뷰에 연속적으로 등록된다. 예를 들어, 스캔이 있을 때마다, 새로운 이미지가 생성되고, 임의의 움직임을 보상하기 위해 절차 전의 이미지로부터의 대응하는 뷰에 재등록된다. 도 3a에 도시된 바와 같이, 우측 패널은, 예를 들어 횡단 뷰, 시상 뷰, 및 3차원(3D, three- dimensional) 뷰를 포함하는, 계획 스캔의 다양한 뷰를 포함한다. 횡단 뷰는, 타겟을 포함하는 계획 스캔으로부터의 슬라이스를 나타낸다. 다양한 구현예에 따르면, 횡단 뷰에서 중공형 원으로 도시되어 있는, 균등하게 이격된 잠재적 바늘 위치를 나타내기 위해 가상 그리드가 사용된다. 시상 뷰는, 타겟 을 포함하는 시상 이미지를 나타낸다. 다양한 구현예에 따르면, 시상 뷰에서 수평 라인으로서 도시되 어 있는, 균등하게 이격된 잠재적 바늘 위치를 나타내기 위해 가상 그리드가 사용된다. 일부 구현예에 따 르면, 라인은 가로방향을 따른 경회음부 접근으로 인한 잠재적 바늘 궤적을 나타낸다. 3D 뷰는 현재 바늘 위치에 기초하여 계획 이미지로부터의 단면 뷰를 디스플레이하고, 바늘이 원위로 전진함에 따라 GUI(예, GUI) 상의 그래픽을 업데이트한다. 도 3b는 다양한 구현예에 따른 안내형 로봇 시스템의 이미징 동안의 라이브 뷰의 개략도이다. 도 3b에 예 시된 바와 같이, 라이브 뷰는 x축, y축 및 z축을 따른 점선 정육면체에 의해 표시된 x-y-z 좌표계 내에 있 다. 이미징은 바늘이 예상되는 평면 내에서만 획득될 필요가 있으며, 이는 도 3b에서 시야의 중간에 있는 이미징 평면에 의해 나타나 있다. 다양한 구현예에 따르면, 라이브 뷰는 내장된 z-경사를 가지며, 시 야 내의 다양한 두께의 하나 이상의 슬래브를 여기시킬 수 있다. 대안적인 구현예는, 내장된 z축 경사를 갖지 않을 수 있다. 다양한 구현예에 따르면, x 경사 및 y 경사는 바늘을 포함하는 이미징 평면에서의 이 미징을 위한 위상 인코드로서 내장된다. 시야 내의 포인트의 공간적 위치는 x 및 y 위상 인코드의 조합에 의해 결정되고, z 경사에 대응하는 주파수 대역을 송신한다. 이들 슬래브는 종래의 이미지 슬라이스와는 상이하 고, 이미지 재구성을 거치며, 따라서 다수의 슬라이스로 분할될 수 있다. 다양한 구현예에 따르면, 펄스 시퀀스 내에서 상이한 시간 간격으로 상이한 대역폭을 송신 및 수신함으로써 전 체 시야를 완전히 커버하기 위해 시야 내의 상이한 슬래브의 여기를 멀티플렉싱함으로써 시스템이 전 체 시야를 여기시킬 수 있는 슬라이스 인터리빙이 이용된다. (시스템에 내에 z 위상이 내장됨으로 인해) y 위상 인코드에만 기초하면, 바늘을 포함하는 2차원 단면 이미지를 빠른 속도로 생성할 수 있다. 예를 들어, 단일 차 원(예를 들어, 바늘 궤적)에서 슬라이스 인터리빙을 이용하는 것은 높은 해상도 및 빠른 속도로 행해질 수 있다. 다양한 구현예에 따르면, 슬라이스 인터리빙 접근법을 사용하여 y 위상 인코드만을 사용하면서 두꺼운 슬래브를 획득하는 것과 관련된 획득 및 연산 비용은 사실상 없으며, 여기서는 한 차원에서만 샘플링이 행해진 다. 도 3b에 예시된 바와 같이, 라이브 뷰는, 이미징 평면 내에서의 예상되는 바늘 궤적을 나타내도 록 구성된다. 일부 구현예에 따르면, 도 3b에 예시된 바와 같이, 바늘은 x-y-z 좌표계에서 양의 z 방향으로 전 진한다. 다양한 구현예에 따르면, 바늘의 정확한 위치를 나타내기 위해, 라이브 안내 동안, 더 낮은 디테일로 전체 체적이 이미징된 후 바늘 궤적 주위의 영역이 더 미세한 디테일로 이미징된다. 다양한 구현예에 따르 면, 바늘에 더 가까운 이미지의 더 높은 해상도의 부분과 이미지 내의 다른 곳에서의 더 낮은 해상도의 이미지 부분을 포함하는 하이브리드 이미지로 충분할 수 있다. 하이브리드 이미징 접근법은, 타겟의 위치에 대한 바늘의 정확한 위치를 결정하는 데 필요한 영역에서 충분한 디테일을 유지하면서, 이미징 획득 시간에 대한 추 가적인 개선점, 즉, 즉 더 빠른 이미징을 제공할 수 있다. 하드웨어 및/또는 소프트웨어 접근법을 사용하는 적절한 최적화 기법, 예컨대 k-공간 언더 샘플링을 사용하는 압축된 감지, 병렬 이미징, 및 다중 슬라이스 이미지 획득에 의해 이미지 획득 속도 대 획득된 이미지의 해상도 간의 추가적인 트레이드 오프가 달성될 수 있다. 이들 기법은 이미지 신호 대 잡음 비의 통상적인 비용으로 이 미지 획득을 가속화하는 것을 목표로 한다. 이들은 데이터 대칭성 및 데이터 압축 기법을 활용하여, 이미지를재구성하는 데 필요한 최소한의 양의 데이터를 획득한다. 전립선과 같은 일부 타겟 해부학적 구조는 바늘 안내형 중재에 대한 고유한 난제를 야기한다. 전립선은, 예를 들어, 연조직에 의해 둘러싸여 있으며, 전립선 내로 진입하는 바늘 또는 경직장 트랜스듀서로부터의 임의의 압 력의 결과로서 움직이기 쉽다. 예를 들어, 바늘이 전립선 내로 삽입됨에 따라서, 전립선이 밀려질 수 있고, 삽 입 시, 전립선이 원래 위치 또는 어떠한 다른 위치에 다시 정착될 수 있다. 마찬가지로, 바늘을 인출시킬 때, 전립선은 계속하여 되밀고 위치를 변경할 수 있다. 이는, 로봇과 함께 강성 기준 프레임을 사용하려고 할 때 특 히 문제가 되며, 왜냐하면 해부학적 구조와 이미징 사이의 등록이 잘못될 수 있기 때문이다. 다양한 구현예에 따르면, 라이브 이미지와 계획 이미지로부터의 대응하는 단면 사이의 이미지 유사도 메트릭을 사용하여 움직임을 동적으로 추정하기 위해 움직임 정정 방법이 사용된다. 다양한 구현예에 따르면, 이는 k-공 간 자체에서의 움직임 검출 및 정정에 의해 더욱 향상된다. k-공간에서의 정정은, 재구성되는 이미지에 움직임 인공물이 없는 것을 보장하는 반면, 이미지 기반 등록은, 로봇의 정확한 배치에서 움직임에 의해 야기되는 오류 를 최소화한다. 예를 들어, 전체적인 환자 움직임 및 국소화된 전립선 변형은 자기적 공명 가시 기준 마커를 사 용하여 분리되고 개별적으로 정정될 수 있다. 움직임은, 예를 들어 MRI 이미지의 프레임을 비교하여 결정될 수 있다. 측정된 움직임은 로봇에 의해 알려진 로봇 기준 프레임에 적용되고, 타겟 해부학적 구조와 로봇은 그들의 대응성을 유지한다. 예를 들어, 측정된 움직임은 타겟 해부학적 구조 및 로봇 참조 프레임을 업데이트하도록 적 용되어, 로봇이 타겟 해부학적 구조에 대한 올바른 경로로 이동할 수 있게 한다. 대응성을 결정하기 위해 기준 마커가 또한 사용될 수 있다. 안내형 로봇 절차 또는 중재의 경우, 절차를 계획하기 위해 타겟 해부학적 구조에 대해 자기 이미징 스캔이 촬 영된다. 이들 스캔(계획 스캔)은 하나 이상의 대조 유형을 사용하는 자기(예를 들어, 자기 공명) 이미지 스캔을 포함할 수 있다. 이미지는 생검의 경우에는 의심되는 악성 종양으로 그리고 이미지 안내형 치료의 경우에는 악 성 종양 정도로 수동으로 또는 자동으로 분류될 수 있다. 다양한 구현예에 따르면, 이미지 안내형 절차는 계획 이미지가 획득된 직후에, 즉, 라이브 이미징 직후에, 또는 나중에 수행될 수 있다. 나중에 수행될 절차에 대한 다양한 구현예에 따르면, 계획 이미지를 현재 기준 프레임에 매핑하기 위해 절차 전의 해부학적 스캔이 수행된 다. 다음 도면은 안내형 로봇 절차를 이용하는 절차의 다양한 구현예를 예시한다. 도 4a, 도 4b, 도 4c, 도 4d, 도 5a, 도 5b, 도 5c, 도 5d는 가상 템플릿 기반 또는 그리드 기반 접근법에 대 한 상이한 뷰(예를 들어, 횡단 뷰 및 시상 뷰)를 도시한다. 도 4a는 다양한 구현예에 따른 전립선 샘플의 계획 스캔 동안의 횡단 뷰(400a)를 도시하는 개략도이다. 도 4b는 다양한 구현예에 따른 전립선 샘플의 시상 뷰(400b)를 도시하는 개략도이다. 도 4a 및 도 4b에 예시 된 바와 같이, 전립선 샘플의 계획 이미지는 횡단 뷰(400a)와 시상 뷰(400b) 둘 모두에서 의심되는 영역 (예를 들어, 악성일 가능성이 있거나 악성으로 확인됨)을 나타내도록 마킹될 수 있다. 도 4a에서의 잠재적 인 바늘 위치에 대한 균등하게 이격된 중공형 도트 및 도 4b에서의 잠재적인 바늘 궤적에 대한 직선으로서 예시 된 가상 템플릿 그리드가 도 4a 및 도 4b에 또한 도시되어 있다. 다양한 구현예에 따르면, 중공형 도트의 간격은 원하는 바늘 위치 또는 궤적에 기초하여 달라질 수 있다. 도 4c는 다양한 구현예에 따른 도 4a에 예시된 계획 스캔에 기초한 생검 계획에 대한 횡단 뷰(400c)를 도시하는 개략도이다. 도 4d는 도 4b에 예시된 전립선 샘플의 계획 스캔에 기초한 생검 계획에 대한 시상 뷰(400d) 를 도시하는 개략도이다. 도 4c에 예시된 바와 같이, 의심되는 영역으로부터 생검 샘플이 획득될 수 있는 그리드의 4개의 위치(예를 들어, 4개의 채워진 도트)가 샘플 위치에 도시되어 있다. 유사하게, 도 4d 는 의심되는 영역을 포함하는 샘플 위치에 대응하는, 시상 뷰(400d)에서의 그리드의 2개의 직선 궤적 라인을 도시한다. 채워진 원 및 직선에 의해 예시된 생검 계획은 타겟 의심 영역 전체를 커버한다. 도 5a 및 도 5b는 다양한 구현예에 따른 전립선 샘플의 경계 박스를 배치함으로써 악성 종양의 정도를 결 정하기 위한 예후 계획의 횡단 뷰(500a) 및 시상 뷰(500b)를 각각 예시한다. 도 5a 및 도 5b에 예시된 바와 같 이, 전립선 샘플에 대한 예후 계획은 횡단 뷰(500a)와 시상 뷰(500b) 둘 모두에서 의심되는 영역(예 를 들어, 악성일 가능성이 있거나 악성으로 확인됨)을 나타내도록 마킹되어 있다. 도 5a에서의 잠재적인 바늘 위치에 대한 균등하게 이격된 중공형 도트 및 도 5b에서의 잠재적인 바늘 궤적에 대한 직선으로서 예시된 가상 템플릿 그리드가 도 5a 및 도 5b에 또한 도시되어 있다. 도 5a 및 도 5b에 예시된 바와 같은 전립선 샘플 의 예후 계획은, 도 5a에서의 16개의 채워진 도트 및 도 5b에서의 4개의 채워진 라인으로서 도시된, 샘플 위치에 의해 예시된 경계 박스를 제공한다. 예후의 정도를 결정하기 위해 샘플 위치는 의심되는 영역 내의 의심되거나 알려진 악성 종양을 포함한다. 이러한 예후는 능동적 감시와 같은 질병 관리 경로, 또는절차의 유형 및 정도를 결정하는 데 사용될 수 있다. 도 5c는 다양한 구현예에 따른 전립선 샘플의 저선량 근접치료 계획에 대한 횡단 뷰(500c)를 도시하는 개 략도이다. 도 5d는 다양한 구현예에 따른 시상 뷰(500d)의 개략도를 도시한다. 도 5c 및 도 5d에 도시된 전립선 샘플에 대한 저선량 근접치료 계획은, 도 5c에서의 전체 전립선 샘플 내의 채워진 도트 및 도 5d에서 의 전체 전립선 샘플 내의 파선으로서 도시된 샘플 위치에 의해 예시되어 있다. 다양한 구현예에 따 르면, 저선량 근접치료는 도 5c 및 도 5d에 예시된 바와 같은 전립선 샘플을 치료하기 위해 사용될 수 있 다. 일부 다른 구현예에서, 저선량 근접치료는 전립선 샘플의 부분을 치료하기 위해 사용될 수 있다. 도 6a는 다양한 구현예에 따른 가상 그리드가 없는 전립선 샘플의 생검 계획에 대한 횡단 뷰(600a)를 도시 하는 개략도이다. 도 6b는 다양한 구현예에 따른 전립선 샘플의 생검 계획에 대한 시상 뷰(600b)의 개략도 를 도시한다. 도 6a 및 도 6b에 예시된 바와 같이, 전립선 샘플에 대한 생검 계획은 횡단 뷰(600a)와 시상 뷰(600b) 둘 모두에서 의심되는 영역(예를 들어, 악성일 가능성이 있거나 악성으로 확인됨)을 나타내도록 마킹되어 있다. 예시된 바와 같이, 도 6a 및 도 6b에 도시된 전립선 샘플에 대한 생검 계획은 바늘 삽입을 위한 그리드에 의해 제한되지 않는다. 도 6a 및 도 6b에 예시된 바와 같은 전립선 샘플의 생검 계획은 의 심되는 영역 내의 일부 선택된 샘플 위치를 포함한다. 샘플 위치는 도 6a에서의 3개의 채워진 도트 및 도 6b에서의 채워진 라인으로서 도시되어 있다. 본원에서 설명되는 다양한 구현예에 따르면, 도 2의 로봇 시스템은 도 4a, 도 4b, 도 4c, 도 4d, 도 5a, 도 5b, 도 5c, 도 5d, 도 6a, 및 도 6d에 대해 예시 및 설명된 절차 또는 중재 중 임의의 것에 대해 사용될 수 있다. 도 2에 도시된 바와 같이, 로봇 시스템은, 6 자유도로 이동하도록 구성되는 로봇 암을 포함한 다. 예를 들어 도 3a 또는 도 3b에 도시된 이미징 시야 내의 원점에서의 교정 후, 로봇 암은, 예를 들어 도 3b에 도시된 바와 같은 x-y 평면 내의 임의의 포인트로 바늘 팁을 움직일 수 있다. 다양한 구현예에 따르면, 로봇 암은, 예를 들어 도 4a, 도 4c, 도 5a, 또는 도 5c에 도시된 바와 같은 오버레이되는 가상 템플릿의 그리드 패턴 내의 임의의 점에, 또는 예를 들어 도 6a에 도시된 바와 같은 템플릿에 자유로운 접근법에서의 시 야 내의 임의의 다른 위치에 정렬될 수 있다. 다양한 구현예에 따르면, 도 3b에 도시된 바와 같이 z 방향을 따 라서, 또는 도 4b, 도 4d, 도 5b, 도 5d, 또는 도 6b에 도시된 바와 같이 왼쪽에서 오른쪽으로 또는 그 반대로 로봇 암을 전진시킴으로써 바늘 삽입이 수행된다. 전술한 바와 같이, 다양한 구현예에 따르면, 로봇 암은 하나 이상의 짧은 바늘을 홀딩할 수 있는 암의 단 부에 액추에이터와 같은 하나 이상의 모션 컨트롤러 또는 엔드 이펙터를 포함하도록 구성된다. 다양 한 구현예에 따르면, 액추에이터는 완전히 기계식이며, 로봇 시스템의 기저부 근처의 서보 모터에 의 해 트리거된다. 다양한 구현예에 따르면, 액추에이터는 평면 내에 바늘을 위치시키기 위한 공압 액추에이터이다. 다양한 구현예에 따르면, 액추에이터는 공압식으로 제어되고, 전체 로봇 시스템 내의 다 른 구성요소는 하나 이상의 서보 모터에 의해 기계식으로 제어된다. 다양한 구현예에 따르면, 액추에이터를 비 롯한 로봇 시스템의 거의 모든 구성요소는 하나 이상의 서보 모터에 의해 기계식으로 제어된다. 다양한 구현예에 따르면, 로봇 시스템의 로봇 암은, 예를 들어 경회음부 전립선 절차에서와 같이, 평 행선을 따라 이동하도록 제약된다. 다양한 구현예에 따르면, (6 자유도에 더하여) 추가적인 자유도는 로봇 암 에 부착된 바늘이 예컨대 전립선 비대의 경우와 같이 치골궁 영역을 지나 기동되도록 하기 위한 각운동을 포함한다. 다양한 구현예에 따르면, 로봇 시스템은 다양한 궤적을 통해 신체 내부의 동일한 위치에 접근할 수 있도록 외부 원격 중심 운동(RCM; Remote Center of Motion)을 유지하기 위하여 이동하도록 제약된다. RCM 모델에서, 로봇 메커니즘은, 로봇 메커니즘에 의해 작동되는 도구가, 로봇 메커니즘에 대해 고정된 지점을 통과 하는 궤적을 항상 갖도록 이동한다. 예를 들어, 최소 침습 단일 포트 중재의 경우, RCM은 신체 내로의 진입 포 트에 고정될 수 있고, 로봇 메커니즘은 상이한 각도를 통해 그 내로 진입하여 도구를 신체 내부의 상이한 위치 로 전진시킬 수 있다. 다양한 구현예에 따르면, RCM 중심은 환자의 신체 표면 상에 있을 수 있어서, 하나의 접 근 천공/포트만을 통해 다수의 위치를 샘플링/치료하는 것을 용이하게 한다. 다양한 구현예에 따르면, 생검 계획이 이미 결정된 경우, 조작자는 액추에이터 내에 다수의 바늘을 미리 로딩할 수 있다. 이러한 경우, 생검 계획은, 예를 들어 도 4c, 도 4d, 도 5a, 도 5b, 도 6a, 도 6b에 대해 설명 된 바와 같은 모든 계획된 위치로부터 샘플 시편을 획득하는 것을 포함한다. 이러한 구현예에서, 로봇 암 은, 다수의 바늘을 사용하여 한 번에 다수의 샘플을 획득하도록 구성된다. 이러한 경우, 전립선 샘플은 경 요도관(도시되지 않음)을 사용하여 제자리에 유지되어야 할 수 있다. 전립선 움직임은 바늘 삽입 방향을 따르며 동시에 삽입되는 모든 바늘에 대해 동일할 것이기 때문에, 바늘 중 하나만 추적하는 것으로 충분할 수도있다. 이와 같이, 중앙 바늘에 대한 움직임 교정은 모든 바늘에 대한 움직임을 교정하기에 충분할 수 있다. 다양한 구현예에 따르면, 바늘은 한 번에 하나씩 삽입될 수 있다. 이러한 구성에서, 바늘 삽입의 미리 결 정된 순서가, 최적화된 샘플링 방식과 함께 사용되어, 바늘 삽입이 다음 타겟 위치의 이미징에 미치는 효과가 최소화되도록 한다. 이러한 구현예에서, 액추에이터는 동시에 삽입하기 위해 모든 바늘을 홀딩하지는 않지만, 한 번에 하나의 바늘을 삽입하고 인출하기 위해 카트리지 또는 엔드 이펙터 내에 여러 개의 바늘을 홀딩한 다. 이는 보어를 가로질러 전체 로봇 암이 철수되는 것을 피하기 위해 행해진다. 다양한 구현예에 따르면, 바늘은 바늘에 부착된 RF 코일 또는 메타물질을 갖는다. 다양한 구현예에 따르면, RF 코일 또는 메타물질은 자기 이미징 장치의 수신 코일 체인에 커플링되도록 구성된다. 이러한 구현예는 컴퓨터에 의해 디지털화되도록 수신 코일 네트워크로의 정보의 전달 및 무선 커플링을 수 있게 할 것 이다. 다양한 구현예에 따르면, 부착된 RF 코일 또는 메타물질은 삽입 동안 바늘을 둘러싸는 조직으로부터의 신 호 트랜스덕션을 증가시킬 수 있으며, 이는 결과적으로 자기 이미징 장치에 의한 스캔 동안 획득되는 이미 지 품질을 개선한다. 다양한 구현예에 따르면, 예를 들어 도 4a, 도 4b, 도 4c, 도 4d, 도 5a, 도 5b, 도 5c, 도 5d, 도 6a, 및 도 6d에 대해 설명된 것과 같은 안내형 로봇 절차를 위해 사용되는 안내형 로봇 시스템은 핵 자기 공명(NMR; nuclear magnetic resonance) 분석 네트워크를 이용하는 추가적인 구성을 포함한다. 다양한 구현예에 따르면, 로봇 시스템 상의 NMR 분석 네트워크는 수집된 생검 시편에 대한 스펙트럼 분석을 수행하기 위해 보어 내에서 더 높은 자기장을 이용하도록 구성된다. 상이한 조직 유형은 상이한 NMR 스펙트럼을 갖는 것으로 공지되어 있기 때문에, 시편이 획득된 후에 곧 신속하게 각 시편 내의 조직의 유형 및 양이 특성화될 수 있다. 다양한 구현예에 따르면, 시편으로부터 수집되고 분석되는 추가적인 NMR 정보는 조직 유형에 대한 실시간 피드 백을 위해 사용될 수 있으며, 이는 생검 코어의 병리와 관련될 수 있는 추가적인 정보를 제공한다. 다양한 구현예에 따르면, 예를 들어 도 4a, 도 4b, 도 4c, 도 4d, 도 5a, 도 5b, 도 5c, 도 5d, 도 6a, 및 도 6d에 대해 설명된 것과 같은 안내형 로봇 절차를 위해 사용되는 안내형 로봇 시스템은, 안내를 위해 초음 파를 이용하는 추가적인 구성을 포함한다. 다양한 구현예에 따르면, 초음파를 획득하기 위한 장치는 안내형 로 봇 시스템의 외부에 있다. 다양한 구현예에 따르면, 초음파를 획득하기 위한 장치는 안내형 로봇 시스템 내에 통합되고, 예를 들어, 엔드 이펙터 근처에서 로봇 암에 통합된다. 다양한 구현예에 따르 면, 초음파로 보충되는 안내형 로봇 시스템은 자기 안내를 개선하여 더 빠른 이미징 업데이트를 제공할 수 있거나, 동작 또는 중재 동안 대상체 내의 정맥 및 동맥을 국소화하도록 자기 안내를 개선할 수 있다. 안내형 로봇 시스템 또는 안내형 로봇 시스템이 자기 이미징 기법을 사용하는 추가적인 의료 절차, 동작, 또는 중재는, 예를 들어, 경회음부 생검, 경회음부 LDR 근접치료, 경회음부 HDR 근접치료, 경회음부 레이 저 절제, 경회음부 냉동절제, 및 경직장 HIFU를 포함할 수 있지만, 이들로 제한되지는 않는다. 경직장 HIFU의 경우, 다양한 구현예에 따르면, 로봇 시스템은 경직장 HIFU 트랜스듀서를 그의 축에 대해 회전시키는 데 사용된다. 다양한 구현예에 따르면, 조작자 또는 의사는 먼저 트랜스듀서를 삽입한 다음, 자기 이미징 시야 내에서 환자를 움직인다. 이들 구현예에서, 로봇 암은, 자기 이미징 장치의 보어를 통해 접근하여 트랜스듀서 또는 그의 홀더 내로 래칭하도록 구성된다. 안내형 로봇 시스템 또는 안내형 로봇 시스템이 자기 이미징 기법을 사용하는 추가적인 의료 절차, 동작, 또는 중재는 유방 생검을 포함한다. 유방 생검에서, 삽입 방향은 상이할 수 있지만, 절차는 전립선 생검 과 유사하다. 예를 들어, 유방 생검에 사용되는 로봇 시스템은, 보어를 통하는 대신에, 로봇 암(26 2)의 하나 이상의 기계 암 부분을 사용하여 연장되어 자기 이미징 장치 주위의 유방의 타겟 부분에 도달하 도록 구성될 수 있다. 이러한 구성은, 바늘이 유방의 측면으로부터 삽입되는 유방 생검에 특히 적합하다. 안내형 로봇 시스템 또는 안내형 로봇 시스템이 자기 이미징 기법을 사용하는 추가적인 의료 절차, 동작, 또는 중재는 뇌 심부 자극술(DBS)을 포함한다. DBS의 경우, 바늘 궤적이 임의의 중요한 구조를 통과하지 않도록 보장하기 위해, 예를 들어 절차 또는 중재 전에, 사전 계획이 행해진다. 다양한 구현예에 따르면, 중요 한 구조는 사전에 자동 또는 수동으로 분할, 식별, 또는 마킹된다. 이어서, 이들 구조는 절차 동안 라이브 이미 지 상에 오버레이될 수 있다. 라이브 안내 동안, 중요한 구조가 손상되거나 훼손되지 않도록 직접적인 시각화 하에서 정확한 위치에 바늘이 삽입되도록 보장하기 위해 이미지가 획득될 것이다. 다양한 구현예에 따르면, 복잡성을 최소화하기 위해, 일단 뇌 내로의 진입을 위한 진입점이 선택되면 RCM 모델이 사용될 수있다. 안내형 로봇 시스템 또는 안내형 로봇 시스템이 자기 이미징 기법을 사용하는 추가적인 의료 절차, 동작, 또는 중재는 뇌 생검을 포함한다. 다양한 구현예에 따르면, 뇌 생검은, 예를 들어 도 3a에 도시된 바와 같은, 라이브 안내 패널 상의 조작자에게 디스플레이되는 예상되는 바늘 궤적을 사용하여 수행된다. 중간 패널 의 라이브 안내 패널 상의 정보를 검토하면, 해당 조작자는 바늘의 삽입을 개시하기로 결정할 수 있다. 다 양한 구현예에 따르면, 안내형 로봇 시스템은 뇌의 타겟 위치를 기록하도록 구성된다. 다양한 구현예에 따 르면, 조작자는 뇌의 타겟 위치의 획득된 이미지를 검토하고, 각각의 결과에 대한 병리학적 결과를 이미지 내의 결과의 각각의 위치와 함께 입력한다. 안내형 로봇 시스템 또는 안내형 로봇 시스템이 자기 이미징 기법을 사용하는 추가적인 의료 절차, 동작, 또는 중재는 간 및 신장 생검을 포함한다. 다양한 구현예에 따르면, 간 및 신장 생검은 시편을 얻기 위해 하나의 진입 지점에서 삽입하는 것을 포함한다. 다양한 구현예에 따르면, 복잡성을 최소화하기 위해, 일단 뇌 내로의 진입을 위한 진입점이 선택되면 원격 중심 운동(RCM) 모델이 사용될 수 있다. 안내형 로봇 시스템 또는 안내형 로봇 시스템이 자기 이미징 기법을 사용하는 추가적인 의료 절차, 동작, 또는 중재는 폐 생검을 포함한다. 다양한 구현예에 따르면, 폐 생검은 로봇 시스템을 이용하여 기도를 통 해 관을 삽입하는 것을 포함한다. 본원에서 설명되는 바와 같은 다양한 구현예에 따르면, 안내형 로봇 시스템 또는 안내형 로봇 시스템(20 0)은 스텐트, 예를 들어 관상동맥 스텐트 또는 뇌 스텐트의 삽입을 위한 의료 절차, 동작, 또는 중재를 위해 이 용될 수 있다. 본원에서 설명되는 바와 같은 다양한 구현예에 따르면, 안내형 로봇 시스템 또는 안내형 로 봇 시스템은 세기 조절 방사선 치료 안내를 위해 이용될 수 있다. 도 7은 다양한 구현예에 따른 안내형 로봇 시스템을 사용하는 예시적인 방법(S200)에 대한 흐름도이다. 도 7에 도시된 바와 같이, 방법(S200)은 단계(S210)에서 대상체의 자기 공명 이미지를 획득하는 단계를 포함한다. 다양한 구현예에 따르면, 대상체의 이미지를 획득하는 단계는 대상체 또는 환자의 하나 이상의 타겟 해부학적 부분을 획득하는 단계를 포함한다. 다양한 구현예에 따르면, 자기 공명 이미지는 자기 이미징 장치와 같은 자기 공명 이미징 장치 또는 외부 소스로부터 획득된다. 다양한 구현예에 따르면, 자기 공명 이미지는 의사, 환 자, 사용자, 또는 조작자와 같은 외부 소스로부터 획득된다. 도 7에 도시된 바와 같이, 방법(S200)은 단계(S220)에서 대상체의 타겟 부분을 연속적으로 식별하기 위해 라이 브 자기 공명 이미지의 이미지 분석을 수행하는 단계를 포함한다. 다양한 구현예에 따르면, 획득된 자기 공명 이미지는 인공 지능(AI), 머신 러닝, 이미지 또는 신호 잡음 제거, 분할 알고리즘, 객체 및 경계 식별, 이미지 등록, 적응식 세기 정정, 및 패턴 인식 등을 포함하지만 이들로 제한되지는 않는 하나 이상의 프로세스를 통한 분석을 위해 컴퓨터 시스템과 같은 컴퓨터 시스템에 자동으로 업로드된다. 다양한 구현예에 따르면, 획득 된 자기 공명 이미지는 의사 또는 조작자에 의해 수동으로 분석되고, 분석된 이미지로부터 대상체의 부분을 자 동으로 식별하는 데 사용되는 컴퓨터 시스템과 같은 컴퓨터 시스템에 입력된다. 단계(S230)에서, 방법(S200)은 라이브 자기 공명 이미지에 기초하여 로봇 암과 같은 로봇 암을 대상체의 식별된 타겟 부분에 (자동 안내를 통해) 자동으로 안내하는 단계를 포함한다. 다양한 구현예에 따르면, 자동 안 내는 대상체의 타겟 부분의 연속적으로 획득된 자기 공명 이미지의 분석에 기초하여 실시간 또는 근실시간으로 로봇 암을 안내하는 것을 포함한다. 다양한 구현예에 따르면, 자동 안내는 이미지 분석을 통한 자기 정정을 포 함한다. 다양한 구현예에 따르면, 자동 안내는 획득된 자기 공명 이미지에 기초하여 로봇 암의 궤적을 정정하기 위한 의사 또는 조작자에 의한 간헐적인 중재를 포함한다. 다양한 구현예에 따르면, 자동 안내는 대안적인 또는 추가적인 의료 절차를 수행하기 위해 획득된 자기 공명 이미지에 기초하여 로봇 암의 궤적을 변경하기 위한 의 사 또는 조작자에 의한 간헐적인 중재를 포함한다. 방법(S200)의 다양한 구현예에 따르면, 로봇 암은 로봇 암과 같이, 6 자유도로 움직이도록 구성된다. 다양 한 구현예에 따르면, 로봇 암은 로봇 암이 6 자유도로 움직이거나, 회전하거나, 스위블할 수 있게 하는 구성으 로 연결된 하나 이상의 기계 암 부분을 포함한다. 다양한 구현예에 따르면, 로봇 암은 대상체의 다양한 해부학 적 부분에 접근하도록 구성된다. 방법(S200)의 다양한 구현예에 따르면, 로봇 암에 의한 바늘 삽입 동안 중요한 구조가 손상되지 않는다. 예를 들어, 전립선 생검의 다양한 구현예에 따르면, 안내형 로봇 시스템은 대상체의 타겟 부분 내에 삽입 되는 로봇 암에 부착되는 바늘이 요도를 통과하거나 방광 내로 통과하는 것을 피하도록 구성된다. 근접치료의 다양한 구현예에 따르면, 바늘은 전립선을 넘어 방광 내로 침투하지 않으며 직장 또는 방광을 절제하지 않 는다. 방법(S200)의 다양한 구현예에 따르면, 획득된 라이브 자기 공명 이미지는 절차를 제어하기 위한 기능 버튼을 포함하는 그래픽 사용자 인터페이스(GUI) 내에 디스플레이된다. 다양한 구현예에 따르면, 획득된 라이브 자기 공명 이미지는 절차 중에 삽입된 바늘 근처의 고해상도의 이미지 부분 및 바늘로부터 더 멀리 떨어진 곳의 더 낮은 해상도의 이미지 부분을 포함한다. 다양한 구현예에 따르면, 방법(S200)은 절차를 수행하는 동안의 움직임 에 대해, 획득된 라이브 자기 공명 이미지를 정정하는 단계를 더 포함한다. 다양한 구현예에 따르면, 방법 (S200)은 바늘의 삽입 동안의 움직임에 대해, 획득된 라이브 자기 공명 이미지를 정정하는 단계를 더 포함한다. 다양한 구현예에 따르면, 방법(S200)은 움직임에 대해 수동으로 정정하기 위해 기존의 동작을 오버라이드하는 단계를 더 포함한다. 다양한 구현예에 따르면, 방법(S200)은 터치 입력, 마우스 입력, 또는 조이스틱 입력을 사 용하여 GUI를 제어함으로써 로봇 암을 수동으로 전진시키는 단계를 더 포함한다. 다양한 구현예에 따르면, 방법 (S200)은 시편을 추출한 후에 바늘의 위치를 포착하기 위해 자동 분할을 수행하는 단계, 바늘을 인출하는 단계, 및 바늘을 다음 타겟 위치로 전진시키는 단계를 더 포함한다. 단계(S240)에서, 방법(S200)은 대상체의 타겟 부분에서 절차를 수행하는 단계를 포함한다. 다양한 구현예에 따 르면, 방법(S200)은, 예를 들어 경회음부 생검, 경회음부 LDR 근접치료, 경회음부 HDR 근접치료, 경회음부 레이 저 절제, 경회음부 냉동절제, 경직장 HIFU, 유방 생검, 뇌 심부 자극술(DBS), 뇌 생검, 간 생검, 신장 생검, 폐 생검, 관상동맥 스텐트 삽입, 뇌 스텐트 삽입, 및 세기 조절 방사선 치료 안내 등을 포함하지만 이들로 제한되 지는 않는 적절한 의료 절차를 수행하는 단계를 포함한다. 다양한 구현예에 따르면, 절차를 수행하는 단계는, 예를 들어 생검을 위해 시편을 추출하는 단계를 포함한다. 도 8은 다양한 구현예에 따른 안내형 로봇 시스템을 사용하는 예시적인 방법(S300)에 대한 흐름도이다. 도 8에 도시된 바와 같이, 방법(S300)은 단계(S310)에서 대상체의 자기 공명 이미지를 연속적으로 획득하는 단계를 포함한다. 다양한 구현예에 따르면, 대상체의 이미지를 획득하는 단계는 대상체 또는 환자의 하나 이상의 타겟 해부학적 부분을 획득하는 단계를 포함한다. 다양한 구현예에 따르면, 자기 공명 이미지는 자기 이미징 장치 (100 또는 200)와 같은 자기 공명 이미징 장치 또는 외부 소스로부터 획득된다. 다양한 구현예에 따르면, 자기 공명 이미지는 의사, 환자, 사용자, 또는 조작자와 같은 외부 소스로부터 획득된다. 단계(S320)에서, 방법 S300은 자기 공명 이미지 내에서 대상체의 타겟 부분을 연속적으로 식별하는 단계를 포함 한다. 다양한 구현예에 따르면, 획득된 자기 공명 이미지는 타겟 부분의 식별 전에, 인공 지능(AI)을 포함하지 만 이로 제한되지는 않는 하나 이상의 프로세스를 통한 분석을 위해 컴퓨터 시스템과 같은 컴퓨터 시스템 에 자동으로 업로드된다. 다양한 구현예에 따르면, 획득된 자기 공명 이미지는 의사 또는 조작자에 의해 수동으 로 분석되고, 분석된 이미지로부터 대상체의 부분을 자동으로 식별하는 데 사용되는 컴퓨터 시스템과 같은 컴퓨터 시스템에 입력된다. 단계(S330)에서, 방법(S300)은 로봇 암과 같은 로봇 암을 대상체의 식별된 타겟 부분을 향해 안내하는 단 계를 포함하며, 로봇 암을 대상체의 부분으로 안내하기 위해 자기 공명 이미지가 실시간으로 분석된다. 다양한 구현예에 따르면, 연속적으로 획득된 자기 공명 이미지는 대상체의 타겟 부분을 연속적으로 식별하기 위해 실시 간 또는 근실시간으로 분석된다. 다양한 구현예에 따르면, 로봇 암을 안내하는 단계는 이미지 분석을 통한 자기 정정을 포함한다. 다양한 구현예에 따르면, 로봇 암을 안내하는 단계는 연속적으로 획득된 자기 공명 이미지에 기초하여 로봇 암의 궤적을 정정하기 위한 의사 또는 조작자에 의한 간헐적인 중재를 포함한다. 다양한 구현예 에 따르면, 로봇 암을 안내하는 단계는 대안적인 또는 추가적인 의료 절차를 수행하기 위해 연속적으로 획득된 자기 공명 이미지에 기초하여 로봇 암의 궤적을 변경하기 위한 의사 또는 조작자에 의한 간헐적인 중재를 포함 한다. 단계(S340)에서, 방법(S300)은 대상체의 타겟 부분에 바늘을 삽입하고 시편을 추출하는 단계를 포함한다. 삽입 중에, 로봇 암에 의한 바늘 삽입 동안 중요한 구조가 손상되지 않는다. 예를 들어, 전립선 생검의 다양한 구현예에 따르면, 안내형 로봇 시스템은 대상체의 타겟 부분 내에 삽입되는 로봇 암에 부착되는 바늘 이 요도를 통과하거나 방광 내로 통과하는 것을 피하도록 구성된다. 근접치료의 다양한 구현예에 따르면, 바늘 은 전립선을 넘어 방광 내로 침투하지 않으며 직장 또는 방광을 절제하지 않는다. 방법(S300)의 다양한 구현예에 따르면, 연속적으로 획득된 라이브 자기 공명 이미지는 바늘의 삽입 동안의 제어 를 위한 기능 버튼을 포함하는 그래픽 사용자 인터페이스(GUI) 내에 디스플레이된다. 다양한 구현예에 따르면, 연속적으로 획득된 라이브 자기 공명 이미지는 바늘 근처의 고해상도의 이미지 부분 및 바늘로부터 더 멀리 떨어진 곳의 더 낮은 해상도의 이미지 부분을 포함한다. 다양한 구현예에 따르면, 방법(S300)은 바늘의 삽입 동안 의 모션 블러링을 보상하기 위해, 연속적으로 획득된 라이브 자기 공명 이미지를 자동으로 정정하는 단계를 더 포함한다. 다양한 구현예에 따르면, 방법(S300)은 정정된 획득된 라이브 자기 공명 이미지에 기초하여 삽입 동 안 바늘의 궤적을 자동으로 정정하는 단계를 더 포함한다. 다양한 구현예에 따르면, 방법(S300)은 모션 블러에 대해 수동으로 정정하기 위해 기존의 안내된 궤적을 오버라이드하는 단계를 더 포함한다. 다양한 구현예에 따르 면, 방법(S300)은 터치 입력, 마우스 입력, 또는 조이스틱 입력을 사용하여 GUI를 제어함으로써 로봇 암을 수동 으로 전진시키는 단계를 더 포함한다. 다양한 구현예에 따르면, 방법(S300)은 시편을 추출한 후에 바늘의 위치 를 포착하기 위해 자동 분할을 수행하는 단계, 바늘을 인출하는 단계; 및 바늘을 다음 타겟 위치로 전진시키는 단계를 더 포함한다. 다양한 구현예에 따르면, 로봇 암에 부착된 바늘을 대상체의 식별된 타겟 부분을 향해 안 내하는 단계는, 자기 공명 이미지를 연속적으로 획득하도록 구성되는 자기 이미징 장치의 중앙에 있는 보어를 통해 안내하는 단계를 포함한다. 단계(S340)의 다양한 구현예에 따르면, 추출된 시편은, 예를 들어 경회음부 생검, 경회음부 LDR 근접치료, 경회 음부 HDR 근접치료, 경회음부 레이저 절제, 경회음부 냉동절제, 경직장 HIFU, 유방 생검, 뇌 심부 자극술(DBS), 뇌 생검, 간 생검, 신장 생검, 폐 생검, 관상동맥 스텐트 삽입, 뇌 스텐트 삽입, 및 세기 조절 방사선 치료 안 내 등과 같지만 이들로 제한되지는 않는 의료 절차에서의 분석을 위한 것이다. 도 9는 다양한 구현예에 따른 안내형 로봇 시스템을 사용하는 예시적인 방법(S400)에 대한 흐름도이다. 도 9에 도시된 바와 같이, 방법(S400)은 단계(S410)에서 대상체의 라이브 자기 공명 이미지를 획득하는 단계를 포 함한다. 다양한 구현예에 따르면, 대상체의 라이브 자기 공명 이미지를 획득하는 단계는 대상체 또는 환자의 하 나 이상의 타겟 해부학적 부분을 획득하는 단계를 포함한다. 다양한 구현예에 따르면, 라이브 자기 공명 이미지 는 자기 이미징 장치(100 또는 200)와 같은 자기 공명 이미징 장치로부터 획득된다. 단계(S420)에서, 방법(S400)은 자기 공명 이미지 내에서 대상체의 타겟 부분을 연속적으로 식별하는 단계를 포 함한다. 다양한 구현예에 따르면, 획득된 라이브 자기 공명 이미지는 타겟 부분의 식별 전에, 인공 지능(AI)을 포함하지만 이로 제한되지는 않는 하나 이상의 프로세스를 통한 분석을 위해 컴퓨터 시스템과 같은 컴퓨터 시스템에 자동으로 업로드된다. 다양한 구현예에 따르면, 획득된 라이브 자기 공명 이미지는 의사 또는 조작자 에 의해 수동으로 분석되고, 분석된 이미지로부터 대상체의 부분을 자동으로 식별하는 데 사용되는 컴퓨터 시스 템과 같은 컴퓨터 시스템에 입력된다. 단계(S430)에서, 방법(S300)은 기계 암에 부착된 엔드 이펙터를 대상체의 식별된 타겟 부분을 향해 안내하는 단 계를 포함한다. 다양한 구현예에 따르면, 엔드 이펙터는 복수의 바늘을 운반하도록 구성된다. 단계(S440)에서, 방법(S300)은 복수의 바늘을 대상체의 타겟 부분에 한 번에 하나씩 또는 순차적으로 삽입하고 대상체의 타겟 부분으로부터 복수의 시편을 추출하는 단계를 포함한다. 단계(S440)의 다양한 구현예에 따르면, 로봇 암에 의한 바늘 삽입 동안 대상체의 중요한 구조가 손상되지 않는다. 예를 들어, 전립선 생검의 다양 한 구현예에 따르면, 안내형 로봇 시스템은 대상체의 타겟 부분 내에 삽입되는 로봇 암에 부착되는 바늘이 요도를 통과하거나 방광 내로 통과하는 것을 피하도록 구성된다. 근접치료의 다양한 구현예에 따르면, 바늘은 전립선을 넘어 방광 내로 침투하지 않으며 직장 또는 방광을 절제하지 않는다. 방법(S400)의 다양한 구현예에 따르면, 획득된 라이브 자기 공명 이미지는 복수의 바늘의 삽입 동안의 제어를 위한 기능 버튼을 포함하는 그래픽 사용자 인터페이스(GUI) 내에 디스플레이된다. 다양한 구현예에 따르면, 획 득된 라이브 자기 공명 이미지는 삽입된 바늘 근처의 고해상도의 이미지 부분 및 삽입된 바늘로부터 더 멀리 떨 어진 곳의 더 낮은 해상도의 이미지 부분을 포함한다. 다양한 구현예에 따르면, 방법(S400)은 복수의 바늘의 삽 입 동안의 모션 블러링을 보상하기 위해, 획득된 라이브 자기 공명 이미지를 자동으로 정정하는 단계를 더 포함 한다. 다양한 구현예에 따르면, 방법(S400)은 정정된 획득된 라이브 자기 공명 이미지에 기초하여 삽입 동안 삽 입되는 바늘의 궤적을 자동으로 정정하는 단계를 더 포함한다. 다양한 구현예에 따르면, 방법(S400)은 모션 블 러에 대해 수동으로 정정하기 위해 기존의 안내된 궤적을 오버라이드하는 단계를 더 포함한다. 다양한 구현예에 따르면, 방법(S400)은 터치 입력, 마우스 입력, 또는 조이스틱 입력을 사용하여 GUI를 제어함으로써 기계 암을 수동으로 전진시키는 단계를 더 포함한다. 다양한 구현예에 따르면, 방법(S400)은 시편을 추출한 후에 삽입된 바늘의 위치를 포착하기 위해 자동 분할을 수행하는 단계, 삽입된 바늘을 인출하는 단계, 및 다음 위치에 추가 적인 바늘을 삽입하는 단계를 더 포함한다. 다양한 구현예에 따르면, 기계 암에 부착된 엔드 이펙터를 대상체의 식별된 타겟 부분을 향해 안내하는 단계는, 자기 공명 이미지를 연속적으로 획득하도록 구성되는 단면 자기 이 미징 장치의 중앙에 있는 보어를 통해 안내하는 단계를 포함한다.단계(S440)의 다양한 구현예에 따르면, 복수의 추출된 시편은, 예를 들어 경회음부 생검, 경회음부 LDR 근접치 료, 경회음부 HDR 근접치료, 경회음부 레이저 절제, 경회음부 냉동절제, 경직장 HIFU, 유방 생검, 뇌 심부 자극 술(DBS), 뇌 생검, 간 생검, 신장 생검, 폐 생검, 관상동맥 스텐트 삽입, 뇌 스텐트 삽입, 및 세기 조절 방사선 치료 안내 등과 같지만 이들로 제한되지는 않는 하나 이상의 의료 절차에서 분석되기 위한 것이다. 도 10 내지 도 14는 자기 공명 이미징 시스템을 묘사한다. 도 10 및 도 11에 도시된 바와 같이, 자기 공명 이미징 시스템은 하우징을 포함한다. 하우징은 전방 표면을 포함한다. 다양한 구현예에 따 르면, 전방 표면은 오목한 전방 표면일 수 있다. 다양한 구현예에 따르면, 전방 표면은 리세싱된 전 방 표면일 수 있다. 도 10 및 도 11에 도시된 바와 같이, 하우징은 영구 자석, 무선 주파수 송신 코일, 경사 코일 세트, 전자석, 및 무선 주파수 수신 코일을 포함한다. 도 12 및 도 13에 도시된 바와 같이, 영 구 자석은, 어레이 구성으로 배치된 복수의 자석을 포함할 수 있다. 영구 자석을 형성하는 복수의 자 석은, 도 12의 전방 입면도에 도시된 바와 같이 전체 표면을 커버하는 것으로 예시되어 있고, 도 13의 측면 입 면도에 도시된 바와 같이 수평 방향의 막대로서 예시되어 있다. 주로 도 10을 참조하면, 주 영구 자석 어레이는, 시스템의 다수의 측면으로부터 환자에 접근하기 위한 적어도 하나의 액세스 애퍼처를 포함할 수 있다. 다양한 구현예에 따르면, 영구 자석은 관심 영역 내에 정적 자기장을 제공한다. 다양한 구현예에 따 르면, 영구 자석은 도 12 및 도 13에 도시된 바와 같이 평행 구성으로 된 복수의 원통형 영구 자석을 포함 할 수 있다. 다양한 구현예에 따르면, 영구 자석은, 예를 들어 Nd계 자성 물질 등과 같은 희토류계 자성 물질을 포함하지만 이로 제한되지는 않는, 임의의 적절한 자성 물질을 포함할 수 있다. 도 10에 도시된 바와 같 이, 주 영구 자석은, 자기 이미징 시스템의 몸체를 통해 시스템의 반대측으로부터 환자에게 접근하기 위한 적어도 하나의 액세스 애퍼처를 포함할 수 있다. 다양한 구현예에 따르면, 도 14에 예시된 자기 공명 이미징 시스템을 사용하여, 환자는 원하는 해부학적 스캔의 유형에 따라서 임의의 수의 상이한 자세로 위치될 수 있다. 도 14는 복부 영역이 스캔될 때를 위한 예시적인 자 세를 예시한다. 환자는 측방향 자세로 표면 상에 놓일 수 있다. 예시된 바와 같이, 복부 스캔의 경우, 환자는, 테이블에 가장 가까운 팔은 뻗고 다른 팔은 신체의 측면에서 있는 상태로, 보어를 향해 옆으로 놓이도록 위치될 수 있다. 복부 영역은 보어의 바로 앞에 있도록 위치될 수 있다. 로봇 시스템은, 로봇 시스템이 환자로부터 떨 어져 있도록 자기 공명 이미징 시스템의 다른 측면 상에 배치될 수 있다. 로봇 시스템의 로봇 암은 자기 공명 이미징 시스템 내의 액세스 애퍼처를 통해 도달하여 환자에 대한 절차를 수행할 수 있다. 이러한 예시적인 설정 에서, 로봇 시스템이 존재하고, 그 다음으로 자기 공명 이미징 시스템이 존재하고, 그 다음으로 환자가 존재한 다. 이러한 예시적인 설정은 환자를 자기 공명 이미징 시스템에 가깝게 유지시키고, 오직 로봇 시스템의 암이 액세스 애퍼처를 통해 환자를 향해 도달할 수 있게 하며, 이는 로봇 시스템의 모터를 자기 공명 이미징 시스템 으로부터 멀리 유지시켜 자기 공명 이미징 시스템과의 간섭을 감소시킨다. 다른 예에서, 로봇 시스템의 암은 자 기 공명 이미징 시스템의 측면 주위에 도달하여 환자에게 도달할 수 있다. 두 경우 모두에서, 자기 공명 이미징 시스템은 환자와 로봇 암의 근위 부분 중간에 있다. 실시예 실시예 1 - 안내형 로봇 시스템으로서, 상기 시스템은, 대상체의 자기 공명 이미지를 연속적으로 획득하기 위한 자기 이미징 장치; 로봇 암, 및 상기 자기 공명 이미지를 분석하고 상기 대상체의 부분을 식별하기 위한 컴퓨터 시스템을 포함하며, 상기 로봇 암을 상기 대상체의 부분으로 안내하기 위해 상기 자기 공명 이미지가 실시간으 로 분석되는, 시스템. 실시예 2 - 실시예 1에 있어서, 로봇 암은, 약물 전달을 위해 구성되는 구성요소에 부착되는, 시스템. 실시예 3 - 실시예 1 또는 실시예 2에 있어서, 상기 로봇 암은, 시편을 추출하기 위해 상기 대상체의 부분 내에 바늘을 삽입하도록 구성되는, 시스템. 실시예 4 - 실시예 1 내지 실시예 3 중 어느 한 실시예에 있어서, 상기 로봇 암은, 상기 대상체의 부분 내에 스 텐트를 배치하도록 구성되는, 시스템. 실시예 5 - 실시예 1 내지 실시예 4 중 어느 한 실시예에 있어서, 상기 로봇 암은, 상기 대상체의 부분으로부터 샘플을 제거하도록 구성되는 바늘에 부착되는, 시스템.실시예 6 - 실시예 1 내지 실시예 5 중 어느 한 실시예에 있어서, 상기 로봇 암은, 상기 대상체의 부분을 절단 함으로써, 상기 식별된 부분을 제거하도록 구성되는, 시스템. 실시예 7 - 실시예 1 내지 실시예 6 중 어느 한 실시예에 있어서, 상기 로봇 암은, 복수의 바늘을 포함하는 엔 드 이펙터에 부착되는, 시스템. 실시예 8 - 실시예 1 내지 실시예 7 중 어느 한 실시예에 있어서, 상기 로봇 암은, 하나 이상의 스텐트를 운반 하도록 구성되는 엔드 이펙터에 부착되는, 시스템. 실시예 9 - 실시예 1 내지 실시예 8 중 어느 한 실시예에 있어서, 상기 로봇 암은, 하나 이상의 근접치료 시드 를 운반하도록 구성되는 엔드 이펙터에 부착되는, 시스템. 실시예 10 - 실시예 1 내지 실시예 9 중 어느 한 실시예에 있어서, 상기 로봇 암은, 경회음부 생검, 경회음부 LDR 근접치료, 경회음부 HDR 근접치료, 경회음부 레이저 절제, 경회음부 냉동절제, 경직장 HIFU, 유방 생검, 뇌 심부 자극술(DBS), 뇌 생검, 간 생검, 신장 생검, 폐 생검, 관상동맥 스텐트 삽입, 뇌 스텐트 삽입, 및 세기 조 절 방사선 치료 안내로 구성되는 의료 절차의 목록으로부터의 의료 절차에서의 검사를 위해 시편을 추출하도록 구성되는, 시스템. 실시예 11 - 안내형 로봇 시스템을 사용하는 방법으로서, 대상체의 라이브 자기 공명 이미지를 획득하는 단계; 상기 대상체의 타겟 부분을 연속적으로 식별하기 위해 상기 라이브 자기 공명 이미지의 이미지 분석을 수행하는 단계; 상기 라이브 자기 공명 이미지에 기초하여 상기 대상체의 식별된 타겟 부분을 향해 로봇 암을 자동으로 안내하는 단계; 및 상기 대상체의 타겟 부분에서 절차를 수행하는 단계를 포함하는, 방법. 실시예 12 - 실시예 11에 있어서, 획득된 라이브 자기 공명 이미지는, 상기 절차를 제어하기 위한 기능 버튼을 포함하는 그래픽 사용자 인터페이스(GUI) 내에 디스플레이되는, 방법. 실시예 13 - 실시예 11 또는 실시예 12에 있어서, 획득된 라이브 자기 공명 이미지는, 상기 절차 중에 삽입된 바늘 근처의 고해상도의 이미지 부분 및 상기 바늘로부터 더 멀리 떨어진 곳의 더 낮은 해상도의 이미지 부분을 포함하는, 방법. 실시예 14 - 실시예 11 내지 실시예 13 중 어느 한 실시예에 있어서, 상기 절차를 수행하는 단계 동안의 환자 움직임에 대해, 획득된 라이브 자기 공명 이미지를 정정하는 단계를 더 포함하는, 방법. 실시예 15 - 실시예 11 내지 실시예 14 중 어느 한 실시예에 있어서, 상기 바늘의 삽입 동안의 움직임 인공물에 대해, 획득된 라이브 자기 공명 이미지를 정정하는 단계를 더 포함하는, 방법. 실시예 16 - 실시예 11 내지 실시예 15 중 어느 한 실시예에 있어서, 상기 환자 움직임에 대해 수동으로 정정하 기 위해 기존의 동작을 오버라이드하는 단계를 더 포함하는, 방법. 실시예 17 - 실시예 11 내지 실시예 16 중 어느 한 실시예에 있어서, 터치 입력, 마우스 입력, 또는 조이스틱 입력을 사용하여 상기 GUI를 제어함으로써 상기 로봇 암을 수동으로 전진시키는 단계를 더 포함하는, 방법. 실시예 18 - 실시예 11 내지 실시예 17 중 어느 한 실시예에 있어서, 상기 로봇 암에 부착되는 바늘을 제공하는 단계, 상기 바늘의 위치를 포착하기 위해 자동 분할을 수행하는 단계; 상기 바늘을 인출하는 단계; 및 상기 바 늘을 다음 타겟 위치로 전진시키는 단계를 더 포함하는, 방법. 실시예 19 - 실시예 11 내지 실시예 18 중 어느 한 실시예에 있어서, 상기 절차는, 경회음부 생검, 경회음부 LDR 근접치료, 경회음부 HDR 근접치료, 경회음부 레이저 절제, 경회음부 냉동절제, 경직장 HIFU, 유방 생검, 뇌 심부 자극술(DBS), 뇌 생검, 간 생검, 신장 생검, 폐 생검, 관상동맥 스텐트 삽입, 뇌 스텐트 삽입, 및 세기 조 절 방사선 치료 안내로 구성되는 의료 절차의 목록으로부터의 하나의 의료 절차를 포함하는, 방법. 실시예 20 - 안내형 로봇 시스템을 사용하는 방법으로서, 대상체의 자기 공명 이미지를 연속적으로 획득하는 단 계; 상기 자기 공명 이미지 내에서 상기 대상체의 타겟 부분을 연속적으로 식별하는 단계; 로봇 암에 부착된 바 늘을 상기 대상체의 식별된 타겟 부분을 향해 안내하는 단계(상기 대상체의 타겟 부분으로 상기 바늘을 안내하 기 위해 상기 자기 공명 이미지가 실시간으로 분석됨); 및 상기 대상체의 타겟 부분에 상기 바늘을 삽입하고 시 편을 추출하는 단계를 포함하는, 방법. 실시예 21 - 실시예 20에 있어서, 연속적으로 획득된 라이브 자기 공명 이미지는, 상기 바늘의 삽입 동안의 제 어를 위한 기능 버튼을 포함하는 그래픽 사용자 인터페이스(GUI) 내에 디스플레이되는, 방법.실시예 22 - 실시예 20 또는 실시예 21에 있어서, 연속적으로 획득된 라이브 자기 공명 이미지는, 상기 바늘 근 처의 고해상도의 이미지 부분 및 상기 바늘로부터 더 멀리 떨어진 곳의 더 낮은 해상도의 이미지 부분을 포함하 는, 방법. 실시예 23 - 실시예 20 내지 구현예 22 중 어느 한 실시예에 있어서, 상기 바늘의 삽입 동안의 모션 블러링을 보상하기 위해, 연속적으로 획득된 라이브 자기 공명 이미지를 자동으로 정정하는 단계를 더 포함하는, 방법. 실시예 24 - 실시예 23에 있어서, 정정된 획득된 라이브 자기 공명 이미지에 기초하여 삽입 동안 상기 바늘의 궤적을 자동으로 정정하는 단계를 더 포함하는, 방법. 실시예 25 - 실시예 23에 있어서, 모션 블러에 대해 수동으로 정정하기 위해 기존의 안내된 궤적을 오버라이드 하는 단계를 더 포함하는, 방법. 실시예 26 - 실시예 20 내지 실시예 25 중 어느 한 실시예에 있어서, 터치 입력, 마우스 입력, 또는 조이스틱 입력을 사용하여 상기 GUI를 제어함으로써 상기 로봇 암을 수동으로 전진시키는 단계를 더 포함하는, 방법. 실시예 27 - 실시예 20 내지 실시예 26 중 어느 한 실시예에 있어서, 상기 바늘의 위치를 포착하기 위해 자동 분할을 수행하는 단계; 상기 바늘을 인출하는 단계; 및 상기 바늘을 다음 타겟 위치로 전진시키는 단계를 더 포 함하는, 방법. 실시예 28 - 실시예 20 내지 실시예 27 중 어느 한 실시예에 있어서, 추출된 시편은, 경회음부 생검, 경회음부 LDR 근접치료, 경회음부 HDR 근접치료, 경회음부 레이저 절제, 경회음부 냉동절제, 경직장 HIFU, 유방 생검, 뇌 심부 자극술(DBS), 뇌 생검, 간 생검, 신장 생검, 폐 생검, 관상동맥 스텐트 삽입, 뇌 스텐트 삽입, 및 세기 조 절 방사선 치료 안내로 구성되는 목록으로부터의 의료 절차에서 검사되는, 방법. 실시예 29 - 실시예 20 내지 실시예 28 중 어느 한 실시예에 있어서, 상기 안내하는 단계는, 자기 공명 이미지 를 연속적으로 획득하도록 구성되는 자기 이미징 장치의 중앙에 있는 보어를 통해 상기 바늘을 안내하는 단계를 더 포함하는, 방법. 실시예 30 - 안내형 시스템을 사용하는 방법으로서, 대상체의 라이브 자기 공명 이미지를 획득하는 단계; 상기 라이브 자기 공명 이미지 내에서 상기 대상체의 타겟 부분을 연속적으로 식별하는 단계; 기계 암에 부착된 엔드 이펙터를 상기 대상체의 식별된 타겟 부분을 향해 안내하는 단계(상기 엔드 이펙터는 복수의 바늘을 운반함); 및 상기 대상체의 타겟 부분에 상기 복수의 바늘을 한 번에 하나씩 삽입하고 상기 대상체의 타겟 부분으로부터 복수의 시편을 추출하는 단계를 포함하는, 방법. 실시예 31 - 실시예 30에 있어서, 획득된 라이브 자기 공명 이미지는, 상기 복수의 바늘의 삽입 동안의 제어를 위한 기능 버튼을 포함하는 그래픽 사용자 인터페이스(GUI) 내에 디스플레이되는, 방법. 실시예 32 - 실시예 30 또는 실시예 31에 있어서, 획득된 라이브 자기 공명 이미지는, 삽입된 바늘 근처의 고해 상도의 이미지 부분 및 상기 삽입된 바늘로부터 더 멀리 떨어진 곳의 더 낮은 해상도의 이미지 부분을 포함하는, 방법. 실시예 33 - 실시예 30 내지 실시예 32 중 어느 한 실시예에 있어서, 상기 복수의 바늘의 삽입 동안의 모션 블 러링을 보상하기 위해, 상기 획득된 라이브 자기 공명 이미지를 자동으로 정정하는 단계를 더 포함하는, 방법. 실시예 34 - 실시예 33에 있어서, 정정된 획득된 라이브 자기 공명 이미지에 기초하여 삽입 동안 삽입되는 바늘 의 궤적을 자동으로 정정하는 단계를 더 포함하는, 방법. 실시예 35 - 실시예 30 내지 실시예 34 중 어느 한 실시예에 있어서, 모션 블러에 대해 수동으로 정정하기 위해 기존의 안내된 궤적을 오버라이드하는 단계를 더 포함하는, 방법. 실시예 36 - 실시예 30 내지 실시예 35 중 어느 한 실시예에 있어서, 터치 입력, 마우스 입력, 또는 조이스틱 입력을 사용하여 GUI를 제어함으로써 상기 기계 암을 수동으로 전진시키는 단계를 더 포함하는, 방법. 실시예 37 - 실시예 30 내지 실시예 36 중 어느 한 실시예에 있어서, 삽입된 바늘의 위치를 포착하기 위해 자동 분할을 수행하는 단계; 상기 삽입된 바늘을 인출하는 단계; 및 다음 위치에 추가적인 바늘을 삽입하는 단계를 더 포함하는, 방법. 실시예 38 - 실시예 30 내지 실시예 37 중 어느 한 실시예에 있어서, 추출된 시편은, 경회음부 생검, 경회음부 LDR 근접치료, 경회음부 HDR 근접치료, 경회음부 레이저 절제, 경회음부 냉동절제, 경직장 HIFU, 유방 생검, 뇌심부 자극술(DBS), 뇌 생검, 간 생검, 신장 생검, 폐 생검, 관상동맥 스텐트 삽입, 뇌 스텐트 삽입, 및 세기 조 절 방사선 치료 안내로 구성되는 목록으로부터의 하나 이상의 의료 절차에서 검사되는, 방법. 실시예 39 - 실시예 30 내지 실시예 38 중 어느 한 실시예에 있어서, 상기 기계 암에 부착된 엔드 이펙터를 상 기 대상체의 식별된 타겟 부분을 향해 안내하는 단계는, 자기 공명 이미지를 연속적으로 획득하도록 구성되는 단면 자기 이미징 장치의 중앙에 있는 보어를 통해 안내하는 단계를 포함하는, 방법. 실시예 40 - 안내형 로봇 시스템으로서, 상기 시스템은, 대상체의 실시간 이미징을 위한 이미징 장치; 실시간으 로 이미지를 분석하기 위한 컴퓨터 시스템; 및 로봇 암을 포함하는 로봇 시스템을 포함하며, 상기 로봇 시스템 은, 상기 이미지의 실시간 분석에 기초하여 수술 절차 동안 상기 로봇 암을 안내하도록 구성되고, 상기 로봇 암 은, 로봇 수술 도구를 홀딩하도록 구성되는 근위 단부 및 원위 단부를 포함하고, 상기 이미징 장치는, 상기 수 술 절차 동안 상기 로봇 암의 근위 단부와 상기 대상체의 중간에 위치되는, 시스템. 실시예 41 - 실시예 40에 있어서, 상기 로봇 암의 원위 단부는, 약물 전달을 위해 구성되는 구성요소에 부착되 는, 시스템. 실시예 42 - 실시예 40 또는 실시예 41에 있어서, 상기 로봇 암의 원위 단부는, 시편을 추출하기 위해 상기 대 상체 내에 바늘을 삽입하도록 구성되는, 시스템. 실시예 43 - 실시예 40 내지 실시예 42 중 어느 한 실시예에 있어서, 상기 로봇 암은, 상기 대상체 내에 스텐트 를 배치하도록 구성되는, 시스템. 실시예 44 - 실시예 40 내지 실시예 43 중 어느 한 실시예에 있어서, 상기 로봇 암은, 상기 대상체로부터 샘플 을 제거하도록 구성되는 바늘에 부착되는, 시스템. 실시예 45 - 실시예 40 내지 실시예 44 중 어느 한 실시예에 있어서, 상기 로봇 암은 절제 도구에 부착되는, 시 스템. 실시예 46 - 실시예 40 내지 실시예 45 중 어느 한 실시예에 있어서, 상기 로봇 암의 원위 단부는, 복수의 바늘 을 포함하는 엔드 이펙터에 부착되는, 시스템. 실시예 47 - 실시예 40 내지 실시예 46 중 어느 한 실시예에 있어서, 상기 로봇 암의 원위 단부는, 하나 이상의 스텐트를 운반하도록 구성되는 엔드 이펙터에 부착되는, 시스템. 실시예 48 - 실시예 40 내지 실시예 47 중 어느 한 실시예에 있어서, 상기 로봇 암의 원위 단부는, 하나 이상의 근접치료 시드를 운반하도록 구성되는 엔드 이펙터에 부착되는, 시스템. 실시예 49 - 실시예 40 내지 실시예 48 중 어느 한 실시예에 있어서, 상기 로봇 암은, 경회음부 생검, 경회음부 LDR 근접치료, 경회음부 HDR 근접치료, 경회음부 레이저 절제, 경회음부 냉동절제, 경직장 HIFU, 유방 생검, 뇌 심부 자극술(DBS), 뇌 생검, 간 생검, 신장 생검, 폐 생검, 관상동맥 스텐트 삽입, 뇌 스텐트 삽입, 및 세기 조 절 방사선 치료 안내로 구성되는 의료 절차의 목록으로부터의 의료 절차에서의 검사를 위해 시편을 추출하도록 구성되는, 시스템. 실시예 50 - 실시예 40 내지 실시예 49 중 어느 한 실시예에 있어서, 상기 로봇 암은, 상기 이미징 장치 내의 보어를 통해 연장되어, 상기 로봇 암의 원위 단부를 상기 대상체에 근접하게 위치시키도록 구성되는, 시스템. 실시예 51 - 실시예 40 내지 실시예 50 중 어느 한 실시예에 있어서, 상기 로봇 암은 모터를 포함하고, 상기 이 미징 장치는, 상기 모터에 의해 발생된 잡음을 검출하고; 검출된 잡음을 상기 획득된 신호로부터 제거하도록 구 성되는 능동형 잡음 상쇄 모듈을 포함하는, 시스템. 실시예 52 - 실시예 1 내지 실시예 51 중 어느 한 실시예에 있어서, 상기 이미징 장치는, 그 중앙에 보어를 갖 는 단면 자기 공명 이미징 장치인, 시스템 몇몇 형태가 예시되고 설명되었지만, 출원인의 의도는, 첨부된 청구항의 범위를 이러한 세부사항으로 제한하거 나 한정하는 것이 아니다. 이러한 형태에 대한 수많은 수정예, 변형예, 변경예, 치환예, 조합예, 및 등가물이 구현될 수 있으며, 본 개시의 범위로부터 벗어나지 않으면서 당업자에게 떠오를 것이다. 또한, 설명된 형태와 연관된 각 요소의 구조는, 요소에 의해 수행되는 기능을 제공하기 위한 수단으로서 대안적으로 설명될 수 있다. 또한, 특정 구성요소에 대해 물질이 개시되는 경우, 다른 물질이 사용될 수 있다. 따라서, 전술한 설명 및 첨부 된 청구범위는, 개시된 형태의 범위 내에 속하는 바와 같은 모든 이러한 수정예, 조합예, 및 변형예를 커버하도록 의도된다는 것을 이해해야 한다. 첨부된 청구범위는, 모든 이러한 수정예, 변형예, 변경예, 치환예, 수정예, 및 등가물을 커버하도록 의도된다. 전술한 상세한 설명은 블록도, 흐름도, 및/또는 구현예를 사용하여 디바이스 및/또는 프로세스의 다양한 형태를 제시하였다. 이러한 블록도, 흐름도, 및/또는 구현예가 하나 이상의 기능 및/또는 작동을 포함하는 한, 이러한 블록도, 흐름도, 및/또는 구현예 내의 각 기능 및/또는 작동은 광범위한 하드웨어, 소프트웨어, 펌웨어, 또는 사실상 이들의 임의의 조합에 의해 개별적으로 그리고/또는 집합적으로 구현될 수 있다는 것을 당업자는 이해할 것이다. 본원에 개시된 형태의 일부 양태가 집적 회로로, 하나 이상의 컴퓨터 상에서 실행되는 하나 이상의 컴 퓨터 프로그램으로서(예를 들어, 하나 이상의 컴퓨터 시스템 상에서 실행되는 하나 이상의 프로그램으로서), 하 나 이상의 프로세서 상에서 실행되는 하나 이상의 프로그램으로서(예를 들어, 하나 이상의 마이크로프로세서 상 에서 실행되는 하나 이상의 프로그램으로서), 펌웨어로서, 또는 사실상 이들의 임의의 조합으로서, 전체적 또는 부분적으로, 등가적으로 구현될 수 있다는 것, 그리고 회로부를 설계하는 것 및/또는 소프트웨어 및 또는 펌웨 어에 대한 코드를 작성하는 것은, 본 개시를 고려하면, 당업자의 기술 내에 있으리라는 것을 당업자는 인식할 것이다. 또한, 본원에 설명된 주제의 메커니즘은 다양한 형태의 하나 이상의 프로그램 제품으로서 배포될 수 있 다는 것, 그리고 본원에 설명된 주제의 예시적인 형태는, 실제로 배포를 수행하는 데 사용되는 신호 전달 매체 의 특정 유형에 상관없이 적용된다는 것을 당업자는 이해할 것이다. 다양한 개시된 양태를 수행하기 위한 로직을 프로그래밍하는 데 사용되는 명령어는, 동적 랜덤 액세스 메모리 (DRAM; dynamic random access memory), 캐시, 플래시 메모리, 또는 다른 저장장치와 같은 시스템 내의 메모리 내에 저장될 수 있다. 또한, 명령어는 네트워크를 통해 또는 다른 컴퓨터 판독 가능 매체를 통해 배포될 수 있 다. 따라서, 기계 판독 가능 매체는, 기계(예를 들어, 컴퓨터)에 의해 판독 가능한 형태로 정보를 저장 또는 송 신하기 위한 임의의 메커니즘을 포함할 수 있지만, 플로피 디스켓, 광 디스크, 컴팩트 디스크, 읽기 전용 메모 리(CD-ROM; compact disc, read-only memory), 광자기 디스크, 읽기 전용 메모리(ROM), 랜덤 액세스 메모리 (RAM), 소거 가능한 프로그래밍 가능 읽기 전용 메모리(EPROM; erasable programmable read-only memory), 전 기적으로 소거 가능한 프로그래밍 가능 읽기 전용 메모리(EEPROM; electrically erasable programmable read- only memory), 자기 또는 광학 카드, 플래시 메모리, 또는 전기, 광학, 음향, 또는 다른 형태의 전파되는 신호 (예를 들어, 반송파, 적외선 신호, 디지털 신호 등)를 통해 인터넷을 거친 정보의 송신에 사용되는 유형의 (tangible) 기계 판독 가능 저장장치로 제한되지는 않는다. 따라서, 비일시적 컴퓨터 판독 가능 매체는, 기계 (예를 들어, 컴퓨터)에 의해 판독 가능한 형태로 전자 명령어 또는 정보를 저장하거나 송신하기에 적합한 임의 의 유형의(tangible) 기계 판독 가능 매체를 포함한다. 본원의 임의의 양태에서 사용되는 바와 같이, \"제어 회로\"라는 용어는, 예를 들어, 고정배선 회로부, 프로그래 밍 가능 회로부(예를 들어, 하나 이상의 개별 명령어 프로세싱 코어를 포함하는 컴퓨터 프로세서, 프로세싱 유 닛, 프로세서, 마이크로컨트롤러, 마이크로컨트롤러 유닛, 컨트롤러, 디지털 신호 프로세서(DSP; digital signal processor), 프로그래밍 가능 로직 디바이스(PLD; programmable logic device), 프로그래밍 가능 로직 어레이(PLA; programmable logic array), 또는 필드 프로그래밍 가능 게이트 어레이(FPGA; field programmable gate array)), 상태 머신 회로부, 프로그래밍 가능 회로부에 의해 실행되는 명령어를 저장한 펌웨어, 및 이들의 임의의 조합을 지칭할 수 있다. 제어 회로는, 집합적으로 또는 개별적으로, 더 큰 시스템의 부분을 형성하는 회 로부로서, 예를 들어, 집적 회로(IC; integrated circuit), 주문형 집적 회로(ASIC; application-specific integrated circuit), 시스템 온 칩(SoC; system on-chip), 데스크톱 컴퓨터, 랩톱 컴퓨터, 태블릿 컴퓨터, 서 버, 스마트폰 등으로서 구체화될 수 있다. 따라서, 본원에서 사용되는 바와 같이, \"제어 회로\"는, 적어도 하나 의 개별 전기 회로를 갖는 전기 회로부, 적어도 하나의 집적 회로를 갖는 전기 회로부, 적어도 하나의 주문형 집적 회로를 갖는 전기 회로부, 컴퓨터 프로그램에 의해 구성되는 범용 컴퓨팅 디바이스를 형성하는 전기 회로 부(예를 들어, 프로세스를 적어도 부분적으로 수행하는 컴퓨터 프로그램 및/또는 본원에 설명된 디바이스에 의 해 구성되는 범용 컴퓨터, 또는 프로세스를 적어도 부분적으로 수행하는 컴퓨터 프로그램 및/또는 본원에 설명 된 디바이스에 의해 구성되는 마이크로프로세서), 메모리 디바이스를 형성하는 전기 회로부(예를 들어, 랜덤 액 세스 메모리의 형태), 및/또는 통신 디바이스를 형성하는 전기 회로부(예를 들어, 모뎀, 통신 스위치, 또는 광 전기 장비)를 포함하지만 이들로 제한되지는 않는다. 본원에 설명된 주제가 아날로그 또는 디지털 방식 또는 이 들의 어떠한 조합으로 구현될 수 있다는 것을 당업자는 인식할 것이다. 본원의 임의의 양태에서 사용되는 바와 같이, \"로직\"이라는 용어는, 전술한 작동 중 임의의 작동을 수행하도록 구성되는 앱, 소프트웨어, 펌웨어, 및/또는 회로부를 지칭할 수 있다. 소프트웨어는, 비일시적 컴퓨터 판독 가 능 저장 매체 상에 기록된 소프트웨어 패키지, 코드, 명령어, 명령어 세트, 및/또는 데이터로서 구체화될 수 있다. 펌웨어는, 메모리 디바이스 내에 하드 코딩된(예를 들어, 비휘발성) 코드, 명령어 또는 명령어 세트, 및/또 는 데이터로서 구체화될 수 있다. 본원의 임의의 양태에서 사용되는 바와 같이, \"구성요소\", \"시스템\", 및 \"모듈\" 등의 용어는, 하드웨어, 하드웨 어와 소프트웨어의 조합, 소프트웨어, 또는 실행 중인 소프트웨어 중 어느 하나인, 컴퓨터 관련 엔티티를 지칭 할 수 있다. 본원의 임의의 양태에서 사용되는 바와 같이, \"알고리즘\"은, 원하는 결과를 초래하는 단계의 일관성 있는 시퀀 스를 지칭하며, \"단계\"는, 저장, 전송, 조합, 비교, 및 다르게 조작될 수 있는 전기 또는 자기 신호의 형태를 취할 수 있지만 반드시 그러할 필요는 없는 물리적 정량 및/또는 논리적 상태의 조작을 지칭한다. 이들 신호를 비트, 값, 요소, 기호, 문자, 항, 또는 숫자 등으로서 지칭하는 것은 일반적인 용법이다. 이들 용어 및 유사한 용어는 적절한 물리적 정량과 연관될 수 있으며, 이러한 용어는, 이들 정량 및/또는 상태에 적용되는 단지 편의 를 위한 라벨일 뿐이다. 네트워크는 패킷 교환 네트워크를 포함할 수 있다. 통신 디바이스는, 선택된 패킷 교환 네트워크 통신 프로토콜 을 사용하여 서로 통신할 수 있다. 하나의 예시 통신 프로토콜은, 전송 제어 프로토콜/인터넷 프로토콜(TCP/IP; Transmission Control Protocol/Internet Protocol)을 사용한 통신을 허용할 수 있는 이더넷 통신 프로토콜을 포함할 수 있다. 이더넷 프로토콜은, 2008년 12월에 \"IEEE 802.3 표준\"이라는 제목으로 IEEE(Institute of Electrical and Electronics Engineers)에 의해 공개된 이더넷 표준 및/또는 이 표준의 이후 버전을 준수하거 나 이러한 표준과 호환 가능할 수 있다. 대안적으로 또는 추가적으로, 통신 디바이스는 X.25 통신 프로토콜을 사용하여 서로 통신할 수 있다. X.25 통신 프로토콜은, 국제 전기통신 연합-전기통신 표준화 부문(ITU-T; International Telecommunication Union-Telecommunication Standardization Sector)에 의해 공포된 표준을 준수하거나 이러한 표준과 호환 가능할 수 있다. 대안적으로 또는 추가적으로, 통신 디바이스는 프레임 릴레이 통신 프로토콜을 사용하여 서로 통신할 수 있다. 프레임 릴레이 통신 프로토콜은, 국제 전신 전화 자문 위원회 (CCITT; Consultative Committee for International Telegraph and Telephone) 및/또는 미국 국가 표준 협회 (ANSI; American National Standards Institute)에 의해 공포된 표준을 준수하거나 이러한 표준과 호환 가능할 수 있다. 대안적으로 또는 추가적으로, 송수신기는 비동기식 전송 방식(ATM; Asynchronous Transfer Mode) 통신 프로토콜을 사용하여 서로 통신할 수 있다. ATM 통신 프로토콜은, 2001년 8월에 \"ATM-MPLS Network Interworking 2.0\"이라는 명칭의 ATM 포럼에 의해 공개된 ATM 표준 및/또는 이 표준의 이후 버전을 준수하거나 이러한 표준과 호환 가능할 수 있다. 물론, 상이한 그리고/또는 후에 개발되는 연결 지향적 네트워크 통신 프로 토콜은 본원에서 동등하게 고려된다. 구체적으로 다르게 언급되지 않는 한, 전술한 개시로부터 명백한 바와 같이, 전술한 개시 전반에 걸쳐, \"프로세 싱\", \"컴퓨팅\", \"계산\", \"결정\", 또는 \"디스플레이\" 등과 같은 용어를 사용하는 논의는, 컴퓨터 시스템의 레지 스터 및 메모리 내의 물리적(전자적) 정량으로서 표현되는 데이터를 조작하고 컴퓨터 시스템 메모리나 레지스터 또는 다른 이러한 정보 저장, 송신, 또는 디스플레이 디바이스 내의 물리적 정량으로서 유사하게 표현되는 다른 데이터로 변환하는 컴퓨터 시스템 또는 유사한 전자 컴퓨팅 디바이스의 작동 및 프로세스를 지칭한다는 것이 이 해된다. 하나 이상의 구성요소는 본원에서 \"~도록 구성되는\", \"~도록 구성 가능한\", \"~도록 작동 가능한/작동하는\", \"적 응되는/적응 가능한\", \"가능한\", \"~도록 순응 가능한/순응되는\" 것 등으로서 지칭될 수 있다. 맥락에서 다르게 요구하지 않는 한, \"~도록 구성되는\"은, 활성 상태 구성요소 및/또는 비활성 상태 구성요소 및/또는 대기 상태 구성요소를 일반적으로 포함할 수 있다는 것을 당업자는 인식할 것이다. \"근위\" 및 \"원위\"라는 용어는 본원에서, 수술 기기의 핸들 부분 또는 하우징을 조작하는 임상의를 기준으로 사 용된다. \"근위\"라는 용어는 임상의 및/또는 로봇 암에 가장 가까운 부분을 지칭하며, \"원위\"라는 용어는 임상의 및/또는 로봇 암으로부터 멀리 위치하는 부분을 지칭한다. 편의와 명확성을 위해, 도면에 관하여 \"수직\", \"수평\", \"위\", 및 \"아래\"와 같은 공간적 용어가 본원에서 사용될 수 있다는 것이 또한 이해될 것이다. 그러나, 로봇 수술 도구는 많은 배향 및 위치에서 사용되며, 이들 용어는 제한적인 것 및/또는 절대적인 것으로 의도되 지 않는다. 일반적으로, 본원에서, 그리고 특히 첨부된 청구범위(예를 들어, 첨부된 청구범위의 본문)에서, 사용되는 용어 는, 일반적으로 \"개방적\" 용어로서 의도된다는 것을 당업자는 인식할 것이다(예를 들어, \"~을/를 포함하는\"이라 는 용어는 \"~을/를 포함하지만 이들로 제한되지는 않는\"으로서 해석되어야 하고, \"~을/를 갖는\"이라는 용어는 \"적어도 ~을/를 갖는\"으로서 해석되어야 하고, \"~을/를 포함한다\"라는 용어는 \"~을/를 포함하지만 이들로 제한되지는 않는다\"로서 해석되어야 하며, 그 외에도 이와 같음). 도입되는 청구항 기재사항의 특정한 수가 의도된 다면, 이러한 의도는 청구항 내에 명시적으로 기재될 것이며, 이러한 기재가 없는 경우, 이러한 의도는 존재하 지 않는다는 것을 당업자는 또한 이해할 것이다. 예를 들어, 이해를 돕기 위하여, 다음의 첨부된 청구범위는 청 구항 기재사항을 도입하기 위해 \"적어도 하나\" 및 \"하나 이상\"이라는 도입 구절의 사용을 포함할 수 있다. 그러 나, 이러한 구절의 사용은, 부정관사 \"a\" 또는 \"an\"에 의한 청구항 기재사항의 도입이, 그렇게 도입되는 청구항 기재사항을 포함하는 임의의 특정한 청구항을, 단 하나의 이러한 기재사항을 포함하는 청구항으로 제한한다고 암시하는 것으로 해석되어서는 안 되고, 이는 동일한 청구항이 \"하나 이상\" 또는 \"적어도 하나\"라는 도입 구절 및 \"a\" 또는 \"an\"과 같은 부정관사를 포함할 때에도 마찬가지며(예를 들어, \"a\" 및/또는 \"an\"은 통상적으로, \" 적어도 하나\" 또는 \"하나 이상\"을 의미하는 것으로 해석되어야 함); 이는, 청구항 기재사항을 도입하는 데 사용 되는 정관사의 사용에 대해서도 동일하게 적용된다. 또한, 도입되는 청구항 기재사항의 특정한 수가 명시적으로 기재되어 있더라도, 이러한 기재는, 적어도 기재된 수를 의미하는 것으로 통상적으로 해석되어야 한다는 것을 당업자는 인식할 것이다(예를 들어, 다른 수식어가 없는 \"2개의 기재사항\"의 단순 기재는, 통상적으로 적어도 2개의 기재사항, 또는 2개 이상의 기재사항을 의미함). 또한, \"A, B, 및 C 등 중 적어도 하나\"와 유사한 방식이 사용되는 경우, 일반적으로 이러한 구성은, 당업자가 해당 방식을 이해하는 의미로 의도된다(예를 들어, \"A, B, 및 C 중 적어도 하나를 갖는 시스템\"은, A 만을 갖는 시스템, B만을 갖는 시스템, C만을 갖는 시스템, A 및 B를 함께 갖는 시스템, A 및 C를 함께 갖는 시 스템, B 및 C를 함께 갖는 시스템, 및/또는 A, B, 및 C를 함께 갖는 시스템 등을 포함할 것이지만 이들로 제한 되지는 않음). \"A, B, 또는 C 등 중 적어도 하나\"와 유사한 방식이 사용되는 경우, 일반적으로 이러한 구성은, 당업자가 해당 방식을 이해하는 의미로 의도된다(예를 들어, \"A, B, 또는 C 중 적어도 하나를 갖는 시스템\"은, A만을 갖는 시스템, B만을 갖는 시스템, C만을 갖는 시스템, A 및 B를 함께 갖는 시스템, A 및 C를 함께 갖는 시스템, B 및 C를 함께 갖는 시스템, 및/또는 A, B, 및 C를 함께 갖는 시스템 등을 포함할 것이지만 이들로 제 한되지는 않음). 통상적으로, 설명 내에서든, 청구범위 내에서든, 또는 도면 내에서든, 2개 이상의 택일적인 용 어를 제시하는 이접성 접속사 및/또는 구절은, 맥락에서 달리 지시하지 않는 한, 용어 중 하나, 용어 중 어느 하나, 또는 용어 둘 모두를 포함할 가능성을 고려하는 것으로 이해되어야 한다는 것을 당업자는 또한 이해할 것 이다. 예를 들어, \"A 또는 B\"라는 구절은 \"A\" 또는 \"B\" 또는 \"A 및 B\"의 가능성을 포함하는 것으로 통상적으로 이해될 것이다. 첨부된 청구범위와 관련하여, 청구범위 내의 기재된 작동은 일반적으로 임의의 순서로 수행될 수 있다는 것을 당업자는 이해할 것이다. 또한, 다양한 작동 흐름도가 시퀀스(들)로 제시되지만, 다양한 작동은, 예시된 것 이 외의 순서로 수행될 수 있거나 동시에 수행될 수 있다는 것을 이해해야 한다. 맥락에서 달리 지시하지 않는 한, 이러한 대안적인 순서화의 예는, 오버래핑, 인터리빙, 중단, 재순서화, 증분, 준비, 보충, 동시, 역방향, 또는 다른 변형된 순서화를 포함할 수 있다. 또한, 맥락에서 달리 지시하지 않는 한, \"~에 반응하는\", \"~과(와) 관련 되는\", 또는 다른 과거형 형용사와 같은 용어는 일반적으로, 이러한 변형을 제외하도록 의도되지 않는다. \"일 양태\", \"양태\", \"예시\", 및 \"일 예시\" 등에 대한 임의의 언급은, 그 양태와 관련하여 설명되는 특정한 특징, 구조, 또는 특성이 적어도 하나의 양태에 포함된다는 것을 의미한다는 점에 주목할 만하다. 따라서, 본 명세서 전반에 걸친 다양한 위치에서의 \"일 양태에서\", \"양태에서\", \"예시에서\", 및 \"일 예시에서\"라는 구절의 등장은, 모두가 반드시 동일한 양태를 지칭하는 것은 아니다. 또한, 하나 이상의 양태에서 특정한 특징, 구조, 또는 특성은 임의의 적절한 방식으로 조합될 수 있다. 본 명세서에서 언급되고/되거나 임의의 애플리케이션 데이터 시트에 열거된 임의의 특허 출원, 특허, 비특허 공 개, 또는 다른 개시 자료는, 통합되는 자료가 본원과 모순되지 않는 범위에서, 본원에 참조로서 포함된다. 이와 같이, 그리고 필요한 범위에서, 본원에서 명시적으로 제시되는 바와 같은 개시는, 본원에 참조로서 통합되는 임 의의 상충되는 자료를 대체한다. 본원에 참조로서 통합된다고 언급되지만 본원에서 제시되는 기존의 정의, 진술, 또는 다른 개시 자료와 상충되는 임의의 자료 또는 이러한 자료의 부분은, 해당 통합되는 자료와 기존의 개시 자료 간에 충돌이 발생하지 않는 범위에서만 통합될 것이다."}
{"patent_id": "10-2022-7029042", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "요약하면, 본원에 설명된 개념을 사용함으로써 초래되는 수많은 이점이 설명되었다. 하나 이상의 형태에 대한 전술한 설명은 예시 및 설명의 목적으로 제시되었다. 전술한 설명은, 모든 내용을 포함하거나, 개시된 엄밀한 형태로 제한하도록 의도되지 않는다. 전술한 교시를 고려하여 수정 또는 변형이 가능하다. 원리 및 실용적인 응 용예를 예시하여 이에 의해 당업자가 다양한 형태를 이용할 수 있도록 하기 위해, 그리고 고려되는 특정한 용도 에 적합한 바와 같은 다양한 수정예를 사용하여, 하나 이상의 형태가 선택 및 설명되었다. 본원과 함께 제출되는 청구범위는 전체적인 범위를 규정하도록 의도된다."}
{"patent_id": "10-2022-7029042", "section": "도면", "subsection": "도면설명", "item": 1, "content": "다양한 양태의 신규한 특징부는 첨부된 청구범위에서 구체적으로 제시된다. 그러나, 설명되는 양태는, 구성 및 동작 방법 둘 모두에 관하여, 첨부된 도면과 함께 취해진 다음의 설명을 참조하여 가장 잘 이해될 수 있다. 도 1a는 본 개시의 다양한 양태에 따른 안내형 로봇 시스템의 개략도이다. 도 1b는 본 개시의 다양한 양태에 따른 안내형 로봇 시스템을 사용하는 방법에 대한 흐름도이다. 도 2는 본 개시의 다양한 양태에 따른 또 다른 안내형 로봇 시스템의 그래픽 도면이다. 도 3a는 본 개시의 다양한 양태에 따른 안내형 로봇 시스템의 그래픽 사용자 인터페이스의 개략도이다. 도 3b는 본 개시의 다양한 양태에 따른 안내형 로봇 시스템의 이미징 동안의 라이브 뷰의 개략도이다. 도 4a는 본 개시의 다양한 양태에 따른 전립선 샘플의 계획 스캔 동안의 횡단 이미지를 도시하는 개략도이다. 도 4b는 본 개시의 다양한 양태에 따른 전립선 샘플의 계획 스캔 동안의 시상 이미지를 도시하는 개략도이다. 도 4c는 본 개시의 다양한 양태에 따른 도 4a에 예시된 계획 스캔에 기초한 생검 계획에 대한 횡단 이미지를 도 시하는 개략도이다. 도 4d는 본 개시의 다양한 양태에 따른 도 4b에 예시된 계획 스캔에 기초한 생검 계획에 대한 시상 이미지를 도 시하는 개략도이다. 도 5a는 본 개시의 다양한 양태에 따른 전립선 샘플의 악성 종양의 정도를 제공하는 생검 계획에 대한 횡단 이 미지를 도시하는 개략도이다. 도 5b는 본 개시의 다양한 양태에 따른 전립선 샘플의 악성 종양의 정도를 제공하는 생검 계획에 대한 시상 이 미지를 도시하는 개략도이다. 도 5c는 본 개시의 다양한 양태에 따른 전립선 샘플의 저선량 근접치료 계획에 대한 횡단 이미지를 도시하는 개 략도이다. 도 5d는 본 개시의 다양한 양태에 따른 전립선 샘플의 저선량 근접치료 계획에 대한 시상 이미지를 도시하는 개 략도이다. 도 6a는 본 개시의 다양한 양태에 따른 전립선 샘플의 생검 계획에 대한 가상 그리드가 없는 횡단 이미지를 도 시하는 개략도이다. 도 6b는 본 개시의 다양한 양태에 따른 전립선 샘플의 생검 계획에 대한 가상 그리드가 없는 시상 이미지를 도 시하는 개략도이다. 도 7은 본 개시의 다양한 양태에 따른 안내형 로봇 시스템을 사용하는 방법에 대한 흐름도이다. 도 8은 본 개시의 다양한 양태에 따른 안내형 로봇 시스템을 사용하는 방법에 대한 또 다른 흐름도이다. 도 9는 본 개시의 다양한 양태에 따른 안내형 로봇 시스템을 사용하는 방법에 대한 또 다른 흐름도이다. 도 10은 본 개시의 다양한 양태에 따른 자기 공명 이미징 시스템의 개략도이다.도 11은 본 개시의 다양한 양태에 따른 도 10에 도시된 자기 공명 이미징 시스템의 분해 투시도이다. 도 12는 본 개시의 다양한 양태에 따른 도 10에 도시된 자기 공명 이미징 시스템의 입면도이다. 도 13은 본 개시의 다양한 양태에 따른 도 10에 도시된 자기 공명 이미징 시스템의 입면도이다. 도 14는 본 개시의 다양한 양태에 따른 특정 수술 절차 및 중재를 위한 자기 공명 이미징 시스템에 의한 이미징 을 위한 환자의 예시적인 자세지정을 예시한다. 첨부 도면은 실제 축척대로 도시되도록 의도되지 않는다. 대응하는 참조 문자는, 여러 도면 전체에 걸쳐, 대응 하는 부분을 나타낸다. 명확성을 위해, 모든 도면에서 모든 구성요소가 표지되지 않을 수 있다. 본원에 기재된 예시는 일 형태로 본 발명의 특정 구현예를 예시하며, 이러한 예시는 임의의 방식으로 본 발명의 범위를 제한하 는 것으로 해석되어서는 안 된다."}
