{"patent_id": "10-2018-0123974", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0046172", "출원번호": "10-2018-0123974", "발명의 명칭": "전자 장치 및 전자 장치의 제어 방법", "출원인": "삼성전자주식회사", "발명자": "김찬우"}}
{"patent_id": "10-2018-0123974", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,마이크;적어도 하나의 명령을 포함하는 메모리; 및상기 마이크 및 상기 메모리와 연결되어 상기 전자 장치를 제어하는 프로세서; 를 포함하고, 상기 프로세서는, 상기 마이크를 통하여 사용자 음성이 입력되면, 상기 입력된 사용자 음성에 대응되는 그래핌 시퀀스(graphemesequence)를 식별하고, 상기 메모리에 저장되는 명령어 사전에 포함되며 상기 전자 장치의 제어에 관련되는 복수의 명령어 각각과 상기식별된 그래핌 시퀀스 사이의 편집 거리(edit distance)에 기초하여, 상기 식별된 그래핌 시퀀스로부터 명령어시퀀스를 획득하며,상기 획득된 명령어 시퀀스를 상기 전자 장치의 동작을 제어하기 위한 복수의 제어 명령 중 하나와 매핑하고, 상기 매핑된 제어 명령에 기초하여 상기 전자 장치의 동작을 제어하는 전자 장치."}
{"patent_id": "10-2018-0123974", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 메모리는,종단간(end-to-end) 음성 인식 모델이 구현된 소프트웨어를 포함하고,상기 프로세서는,상기 종단간 음성 인식 모델이 구현된 소프트웨어를 실행하고,상기 종단간 음성 인식 모델에 상기 마이크를 통하여 입력된 사용자 음성을 입력하여 상기 그래핌 시퀀스를 식별하는 전자 장치."}
{"patent_id": "10-2018-0123974", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서,상기 메모리는,인공 신경망(artificial neural network) 모델이 구현된 소프트웨어를 포함하고,상기 프로세서는,상기 인공 신경망 모델이 구현된 소프트웨어를 실행하고, 상기 인공 신경망 모델에 상기 획득된 명령어 시퀀스를 입력하여 상기 복수의 제어 명령 중 적어도 하나와 매핑하는 전자 장치."}
{"patent_id": "10-2018-0123974", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "공개특허 10-2020-0046172-3-제3 항에 있어서,상기 종단간 방식의 음성 인식 모델 및 상기 인공 신경망 모델 중 적어도하나의 모델은 RNN(Recurrent NeuralNetwork)를 포함하는 전자 장치."}
{"patent_id": "10-2018-0123974", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3 항에 있어서,상기 프로세서는,상기 종단간 음성 인식 모델 및 상기 인공 신경망 모델의 전체 경로(pipeline)를 joint training하는 전자장치."}
{"patent_id": "10-2018-0123974", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1 항에 있어서, 상기 편집 거리는,상기 식별된 그래핌 시퀀스를 상기 복수의 명령어 각각으로 변환하는데 필요한 문자의 제거, 삽입 및 치환의 최소 횟수이며, 상기 프로세서는,상기 식별된 그래핌 시퀀스로부터, 상기 복수의 명령어 중 상기 식별된 그래핌 시퀀스와 기 설정된 편집 거리내에 있는 명령어 시퀀스를 획득하는 전자 장치."}
{"patent_id": "10-2018-0123974", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1 항에 있어서,상기 복수의 명령어는 상기 전자 장치의 유형 및 상기 전자 장치가 포함하는 기능에 관련되는 전자 장치."}
{"patent_id": "10-2018-0123974", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "전자 장치의 제어 방법에 있어서,마이크를 통하여 사용자 음성이 입력되면, 상기 입력된 사용자 음성에 대응되는 그래핌 시퀀스(graphemesequence)를 식별하는 단계;상기 메모리에 저장되는 명령어 사전에 포함되며 상기 전자 장치의 제어에 관련되는 복수의 명령어 각각과 상기식별된 그래핌 시퀀스 사이의 편집 거리(edit distance)에 기초하여, 상기 식별된 그래핌 시퀀스로부터 명령어시퀀스를 획득하는 단계;상기 획득된 명령어 시퀀스를 상기 전자 장치의 동작을 제어하기 위한 복수의 제어 명령 중 하나와 매핑하는 단계; 및 상기 매핑된 제어 명령에 기초하여 상기 전자 장치의 동작을 제어하는 단계; 를 포함하는 전자 장치의 제어 방법."}
{"patent_id": "10-2018-0123974", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8 항에 있어서,공개특허 10-2020-0046172-4-상기 식별하는 단계는,종단간(end-to-end) 음성 인식 모델에 상기 마이크를 통하여 입력된 사용자 음성을 입력하여 상기 그래핌 시퀀스를 식별하는 전자 장치의 제어 방법."}
{"patent_id": "10-2018-0123974", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9 항에 있어서,상기 매핑하는 단계는,인공 신경망(artificial neural network) 모델에 상기 획득된 명령어 시퀀스를 입력하여 상기 복수의 제어 명령중 적어도 하나와 매핑하는 전자 장치의 제어 방법."}
{"patent_id": "10-2018-0123974", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10 항에 있어서,상기 종단간 방식의 음성 인식 모델 및 상기 인공 신경망 모델 중 적어도하나의 모델은 RNN(Recurrent NeuralNetwork)를 포함하는 전자 장치의 제어 방법."}
{"patent_id": "10-2018-0123974", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10 항에 있어서,상기 종단간 음성 인식 모델 및 상기 인공 신경망 모델의 전체 경로(pipeline)를 joint training하는 전자 장치의 제어 방법."}
{"patent_id": "10-2018-0123974", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제8 항에 있어서, 상기 편집 거리는,상기 식별된 그래핌 시퀀스를 상기 복수의 명령어 각각으로 변환하는데 필요한 문자의 제거, 삽입 및 치환의 최소 횟수이며, 상기 획득하는 단계는,상기 식별된 그래핌 시퀀스로부터, 상기 복수의 명령어 중 상기 식별된 그래핌 시퀀스와 기 설정된 편집 거리내에 있는 명령어 시퀀스를 획득하는 전자 장치의 제어 방법."}
{"patent_id": "10-2018-0123974", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제8 항에 있어서,상기 복수의 명령어는 상기 전자 장치의 유형 및 상기 전자 장치가 포함하는 기능에 관련되는 전자 장치의 제어방법."}
{"patent_id": "10-2018-0123974", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "전자 장치의 제어 방법을 실행하는 프로그램을 포함하는 컴퓨터 판독 가능 기록매체에 있어서,공개특허 10-2020-0046172-5-상기 전자 장치의 제어 방법은,마이크를 통하여 사용자 음성이 입력되면, 상기 입력된 사용자 음성에 대응되는 그래핌 시퀀스(graphemesequence)를 식별하는 단계;상기 메모리에 저장되는 명령어 사전에 포함되며 상기 전자 장치의 제어에 관련되는 복수의 명령어 각각과 상기식별된 그래핌 시퀀스 사이의 편집 거리(edit distance)에 기초하여, 상기 식별된 그래핌 시퀀스로부터 명령어시퀀스를 획득하는 단계;상기 획득된 명령어 시퀀스를 상기 전자 장치의 동작을 제어하기 위한 복수의 제어 명령 중 하나와 매핑하는 단계; 및 상기 매핑된 제어 명령에 기초하여 상기 전자 장치의 동작을 제어하는 단계; 를 포함하는 컴퓨터 판독 가능 기록매체."}
{"patent_id": "10-2018-0123974", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "음성 인식을 통하여 제어할 수 있는 전자 장치 및 그 제어 방법이 개시된다. 구체적으로, 본 개시는 마이크를 통 하여 사용자 음성이 입력되면, 입력된 사용자 음성에 대응되는 그래핌 시퀀스(grapheme sequence)를 식별하고, 메모리에 저장되는 명령어 사전에 포함되며 전자 장치의 제어에 관련되는 복수의 명령어 각각과 식별된 그래핌 시퀀스 사이의 편집 거리(edit distance)에 기초하여, 식별된 그래핌 시퀀스로부터 명령어 시퀀스를 획득하며, 획득된 명령어 시퀀스를 전자 장치의 동작을 제어하기 위한 복수의 제어 명령 중 하나와 매핑하고, 매핑된 제어 명령에 기초하여 전자 장치의 동작을 제어하는 전자 장치 및 그 제어 방법에 관한 것이다."}
{"patent_id": "10-2018-0123974", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 전자 장치 및 전자 장치의 제어 방법에 관한 것으로서, 구체적으로는 음성 명령을 통하여 제어할 수 있는 전자 장치 및 그 제어 방법에 관한 것이다."}
{"patent_id": "10-2018-0123974", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "음성 인식 분야에 있어서, 사용자 음성의 인식 과정 및 언어의 이해 과정은 일반적으로 전자 장치와 연결되는 서버를 통하여 이루어진다. 그런데, 서버를 통하여 이루어지는 음성 인식의 경우, 지연 시간(latency)이 발생할 수 있을 뿐만 아니라, 전자 장치가 서버에 접속할 수 없는 환경에 있는 경우에는 수행될 수 없다는 문제가 있다. 따라서, 근래에는 on-device 방식의 음성 인식 기술이 주목 받고 있다. 그런데, on-device 방식으로 음성 인식 기술을 구현하는 경우, 다양한 언어, 다양한 발음, 그리고 다양한 표현으로 입력되는 사용자 음성을 효과적으로 처리하면서도 음성 인식 시스템의 크기를 최소화시켜야 한다는 해결 과제에 직면하게 된다. 따라서, on-device 방식으로 음성 인식 기술을 구현하면서도, 음성 인식 시스템의 크기를 최소화할 수 있는 기 술에 대한 필요성이 대두되고 있다."}
{"patent_id": "10-2018-0123974", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 상술한 바와 같은 필요성에 따라 안출된 것으로서, on-device 방식으로 음성 인식 기술을 구현하면서 도, 음성 인식 시스템의 크기를 최소화할 수 있는 전자 장치 및 그 제어 방법을 제공하기 위한 것이다."}
{"patent_id": "10-2018-0123974", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 바와 같은 목적을 달성하기 위한 본 개시의 일 실시 예에 따르면, 전자 장치는 마이크, 적어도 하나의 명령을 포함하는 메모리 및 상기 마이크 및 상기 메모리와 연결되어 상기 전자 장치를 제어하는 프로세서를 포 함한다. 그리고, 상기 프로세서는 상기 마이크를 통하여 사용자 음성이 입력되면, 상기 입력된 사용자 음성에 대응되는 그래핌 시퀀스(grapheme sequence)를 식별하고, 상기 메모리에 저장되는 명령어 사전에 포함되며 상기 전자 장 치의 제어에 관련되는 복수의 명령어 각각과 상기 식별된 그래핌 시퀀스 사이의 편집 거리(edit distance)에 기 초하여, 상기 식별된 그래핌 시퀀스로부터 명령어 시퀀스를 획득하며, 상기 획득된 명령어 시퀀스를 상기 전자 장치의 동작을 제어하기 위한 복수의 제어 명령 중 하나와 매핑하고, 상기 매핑된 제어 명령에 기초하여 상기 전자 장치의 동작을 제어한다. 여기서, 상기 메모리는 종단간(end-to-end) 음성 인식 모델이 구현된 소프트웨어를 포함하고, 상기 프로세서는 상기 종단간 음성 인식 모델이 구현된 소프트웨어를 실행하고, 상기 종단간 음성 인식 모델에 상기 마이크를 통 하여 입력된 사용자 음성을 입력하여 상기 그래핌 시퀀스를 식별할 수 있다. 한편, 상기 메모리는 인공 신경망(artificial neural network) 모델이 구현된 소프트웨어를 포함하고, 상기 프 로세서는 상기 인공 신경망 모델이 구현된 소프트웨어를 실행하고, 상기 인공 신경망 모델에 상기 획득된 명령 어 시퀀스를 입력하여 상기 복수의 제어 명령 중 적어도 하나와 매핑할 수 있다. 한편, 상기 종단간 방식의 음성 인식 모델 및 상기 인공 신경망 모델 중 적어도하나의 모델은 RNN(Recurrent Neural Network)를 포함할 수 있다. 한편, 상기 프로세서는 상기 종단간 음성 인식 모델 및 상기 인공 신경망 모델의 전체 경로(pipeline)를 joint training할 수 있다. 한편, 상기 편집 거리는 상기 식별된 그래핌 시퀀스를 상기 복수의 명령어 각각으로 변환하는데 필요한 문자의 제거, 삽입 및 치환의 최소 횟수이며, 상기 프로세서는 상기 식별된 그래핌 시퀀스로부터, 상기 복수의 명령어 중 상기 식별된 그래핌 시퀀스와 기 설정된 편집 거리 내에 있는 명령어 시퀀스를 획득할 수 있다. 한편, 상기 복수의 명령어는 상기 전자 장치의 유형 및 상기 전자 장치가 포함하는 기능에 관련될 수 있다. 한편, 상술한 바와 같은 목적을 달성하기 위한 본 개시의 일 실시 예에 따르면, 전자 장치의 제어 방법은 마이 크를 통하여 사용자 음성이 입력되면, 상기 입력된 사용자 음성에 대응되는 그래핌 시퀀스(grapheme sequence) 를 식별하는 단계, 상기 메모리에 저장되는 명령어 사전에 포함되며 상기 전자 장치의 제어에 관련되는 복수의 명령어 각각과 상기 식별된 그래핌 시퀀스 사이의 편집 거리(edit distance)에 기초하여, 상기 식별된 그래핌 시퀀스로부터 명령어 시퀀스를 획득하는 단계, 상기 획득된 명령어 시퀀스를 상기 전자 장치의 동작을 제어하기 위한 복수의 제어 명령 중 하나와 매핑하는 단계 및 상기 매핑된 제어 명령에 기초하여 상기 전자 장치의 동작 을 제어하는 단계를 포함한다. 여기서, 상기 식별하는 단계는 종단간(end-to-end) 음성 인식 모델에 상기 마이크를 통하여 입력된 사용자 음성 을 입력하여 상기 그래핌 시퀀스를 식별할 수 있다. 한편, 상기 매핑하는 단계는 인공 신경망(artificial neural network) 모델에 상기 획득된 명령어 시퀀스를 입 력하여 상기 복수의 제어 명령 중 적어도 하나와 매핑할 수 있다. 한편, 상기 종단간 방식의 음성 인식 모델 및 상기 인공 신경망 모델 중 적어도 하나의 모델은 RNN(Recurrent Neural Network)를 포함할 수 있다. 한편, 상기 종단간 음성 인식 모델 및 상기 인공 신경망 모델의 전체 경로(pipeline)를 joint training할 수 있 다. 한편, 상기 편집 거리는 상기 식별된 그래핌 시퀀스를 상기 복수의 명령어 각각으로 변환하는데 필요한 문자의 제거, 삽입 및 치환의 최소 횟수이며, 상기 획득하는 단계는 상기 식별된 그래핌 시퀀스로부터, 상기 복수의 명 령어 중 상기 식별된 그래핌 시퀀스와 기 설정된 편집 거리 내에 있는 명령어 시퀀스를 획득할 수 있다. 한편, 상기 복수의 명령어는 상기 전자 장치의 유형 및 상기 전자 장치가 포함하는 기능에 관련될 수 있다. 한편, 전자 장치의 제어 방법을 실행하는 프로그램을 포함하는 컴퓨터 판독 가능 기록매체에 있어서, 상기 전자 장치의 제어 방법은 마이크를 통하여 사용자 음성이 입력되면, 상기 입력된 사용자 음성에 대응되는 그래핌 시 퀀스(grapheme sequence)를 식별하는 단계, 상기 메모리에 저장되는 명령어 사전에 포함되며 상기 전자 장치의 제어에 관련되는 복수의 명령어 각각과 상기 식별된 그래핌 시퀀스 사이의 편집 거리(edit distance)에 기초하 여, 상기 식별된 그래핌 시퀀스로부터 명령어 시퀀스를 획득하는 단계, 상기 획득된 명령어 시퀀스를 상기 전자 장치의 동작을 제어하기 위한 복수의 제어 명령 중 하나와 매핑하는 단계 및 상기 매핑된 제어 명령에 기초하여 상기 전자 장치의 동작을 제어하는 단계를 포함한다."}
{"patent_id": "10-2018-0123974", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 실시 예들은 다양한 변환을 가할 수 있고 여러 가지 실시 예를 가질 수 있는바, 특정 실시 예들을 도면에 예 시하고 상세한 설명에 상세하게 설명하고자 한다. 그러나 이는 특정한 실시 형태에 대해 범위를 한정하려는 것 이 아니며, 본 개시의 실시 예의 다양한 변경(modifications), 균등물(equivalents), 및/또는 대체물 (alternatives)을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유 사한 참조 부호가 사용될 수 있다. 본 개시를 설명함에 있어서, 관련된 공지 기능 혹은 구성에 대한 구체적인 설명이 본 개시의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우 그에 대한 상세한 설명은 생략한다. 덧붙여, 하기 실시 예는 여러 가지 다른 형태로 변형될 수 있으며, 본 개시의 기술적 사상의 범위가 하기 실시 예에 한정되는 것은 아니다. 오히려, 이들 실시 예는 본 개시를 더욱 충실하고 완전하게 하고, 당업자에게 본 개시의 기술적 사상을 완전하게 전달하기 위하여 제공되는 것이다. 본 개시에서 사용한 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 권리범위를 한정하려는 의도 가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 개시에서, \"가진다,\" \"가질 수 있다,\" \"포함한다,\" 또는 \"포함할 수 있다\" 등의 표현은 해당 특징(예: 수치, 기능, 동작, 또는 부품 등의 구성요소)의 존재를 가리키며, 추가적인 특징의 존재를 배제하지 않는다. 본 개시에서, \"A 또는 B,\" \"A 또는/및 B 중 적어도 하나,\" 또는 \"A 또는/및 B 중 하나 또는 그 이상\"등의 표현 은 함께 나열된 항목들의 모든 가능한 조합을 포함할 수 있다. 예를 들면, \"A 또는 B,\" \"A 및 B 중 적어도 하나,\" 또는 \"A 또는 B 중 적어도 하나\"는, 적어도 하나의 A를 포함, 적어도 하나의 B를 포함, 또는 적어도 하나의 A 및 적어도 하나의 B 모두를 포함하는 경우를 모두 지칭할 수 있다. 본 개시에서 사용된 \"제1,\" \"제2,\" \"첫째,\" 또는 \"둘째,\"등의 표현들은 다양한 구성요소들을, 순서 및/또는 중 요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구성요소들을 한정하지 않는다. 어떤 구성요소(예: 제1 구성요소)가 다른 구성요소(예: 제2 구성요소)에 \"(기능적으로 또는 통신적으로) 연결되 어((operatively or communicatively) coupled with/to)\" 있다거나 \"접속되어(connected to)\" 있다고 언급된 때에는, 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로 연결되거나, 다른 구성요소(예: 제3 구성요 소)를 통하여 연결될 수 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소(예: 제1 구성요소)가 다른 구성 요소(예: 제2 구성요소)에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 상기 어떤 구성요 소와 상기 다른 구성요소 사이에 다른 구성요소(예: 제 3 구성요소)가 존재하지 않는 것으로 이해될 수 있다. 본 개시에서 사용된 표현 \"~하도록 구성된(또는 설정된)(configured to)\"은 상황에 따라, 예를 들면, \"~에 적합 한(suitable for),\" \"~하는 능력을 가지는(having the capacity to),\" \"~하도록 설계된(designed to),\" \"~하도 록 변경된(adapted to),\" \"~하도록 만들어진(made to),\" 또는 \"~를 할 수 있는(capable of)\"과 바꾸어 사용될 수 있다. 용어 \"~하도록 구성된(또는 설정된)\"은 하드웨어적으로 \"특별히 설계된(specifically designed to)\" 것만을 반드시 의미하지 않을 수 있다. 대신, 어떤 상황에서는, \"~하도록 구성된 장치\"라는 표현은, 그 장치가 다른 장치 또는 부품들과 함께 \"~할 수 있는\" 것을 의미할 수 있다. 예를 들면, 문구 \"A, B, 및 C를 수행하도록 구성된(또는 설정된) 프로세서\"는 해당 동작을 수행하기 위한 전용 프로세서(예: 임베디드 프로세서), 또는 메모리 장치에 저장된 하나 이상의 소프트 웨어 프로그램들을 실행함으로써, 해당 동작들을 수행할 수 있는 범용 프로세서(generic-purpose processor)(예: CPU 또는 application processor)를 의미할 수 있다.실시 예에 있어서 ‘모듈’ 혹은 ‘부’는 적어도 하나의 기능이나 동작을 수행하며, 하드웨어 또는 소프트웨어 로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 또한, 복수의 ‘모듈’ 혹은 복수의 ‘부’ 는 특정한 하드웨어로 구현될 필요가 있는 ‘모듈’ 혹은 ‘부’를 제외하고는 적어도 하나의 모듈로 일체화되 어 적어도 하나의 프로세서(미도시)로 구현될 수 있다. 아래에서는 첨부한 도면을 참고하여 본 발명의 실시 예에 대하여 본 발명이 속하는 기술 분야에서 통상의 지식 을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시 예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해 서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 도 1은 본 개시의 일 실시 예에 따른 전자 장치의 제어 과정을 개략적으로 나타내는 도면이다. 도 1에 도시된 바와 같이, 본 개시의 일 실시 예에 따른 전자 장치에 사용자 음성이 입력되면, 전자 장치 는 입력된 사용자 음성에 대응되는 그래핌 시퀀스(grapheme sequence)를 식별한다. 여기서, 그래핌은 하나의 음소(phoneme)을 나타내는 개별 문자(letter) 또는 문자의 그룹을 의미한다. 예를 들 어, “spoon”의 경우 <s>, <p>, <oo> 및 <n>이라는 그래핌을 포함한다. 이하에서는 각각의 그래핌을 < >로 묶 어서 나타낸다. 예를 들어, “increase the volume”과 같은 사용자 음성이 입력되면, 전자 장치는 입력된 사용자 음성에 대응되는 그래핌으로서, <i><n><c><r><i><z><space><th><u><space><v><o><l><u><m>과 같은 그래핌 시퀀스를 식 별할 수 있다. 여기서 <space>는 공백을 의미한다. 사용자 음성에 대응되는 그래핌 시퀀스가 식별되면, 전자 장치는 메모리에 저장되는 명령어 사전에 포함되 며 전자 장치의 제어에 관련되는 복수의 명령어 각각과 식별된 그래핌 시퀀스 사이의 편집 거리(edit distance)에 기초하여, 식별된 그래핌 시퀀스로부터 명령어 시퀀스를 획득한다. 구체적으로, 전자 장치는 식별된 그래핌 시퀀스로부터, 명령어 사전에 포함되는 복수의 명령어 중 식별된 그래핌 시퀀스와 기 설정된 편집 거리 내에 있는 명령어 시퀀스를 획득할 수 있다. 여기서, 복수의 명령어란 전자 장치의 유형 및 기능에 관련되는 명령어를 의미하며, 편집 거리란 식별된 그래핌 시퀀스를 복수의 명령어 각각으로 변환하는데 필요한 문자의 제거, 삽입 및 치환의 최소 횟수를 의미한 다. 이하에서는 <i><n><c><r><i><z><space><th><u><space><v><o><l><u><m>와 같은 그래핌 시퀀스가 식별되고, 명령 어 사전에 포함되는 복수의 명령어는 “increase”와 “volume” 두 가지이며, 기 설정된 편집 거리는 3이며, 전자 장치의 동작을 제어 하기 위한 복수의 제어 명령은 “볼륨 증가”를 포함하는 경우를 예로 들어 설명 한다. 구체적으로, <i><n><c><r><i><z>에서 <i>를 <ea>로 치환하고 <z>를 <se>로 치환하면 <i><n><c><r><ea><se>로 변환되는바, <i><n><c><r><i><z>를 <i><n><c><r><ea><se>로 변환하는데 필요한 문자의 제거, 삽입 및 치환의 최소 횟수는 두 번이며, 따라서 편집 거리는 2가 된다. 그리고, <v><o><l><u><m>에서 <e>를 추가하면 <v><o><l><u><m><e>으로 변환되는바, <v><o><l><u><m>을 <v><o><l><u><m><e>으로 변환하는데 필요한 문자의 제거, 삽입 및 치환의 최소 횟수는 한 번이며, 따라서 편집 거리는 1이 된다. 한편, <th><u>의 경우 3번 이하의 제거, 삽입 및 치환을 통하여 <i><n><c><r><ea><se>와 <v><o><l><u><m><e>로 변환될 수 없다는 것은 쉽게 알 수 있다. 상술한 바와 같은 과정을 통하여, <i><n><c><r><i><z><space><th><u><space><v><o><l><u><m>과 같은 그래핌 시 퀀스로부터 {increase, volume}과 같은 명령어 시퀀스가 획득된다. 명령어 시퀀스가 획득되면, 획득된 명령어 시퀀스를 전자 장치의 동작을 제어 하기 위한 복수의 제어 명령 중 하나와 매핑한다. 예를 들어, {increase, volume}과 같은 명령어 시퀀스는 전자 장치의 동작을 제어하 기 위한 복수의 제어 명령 중 “볼륨 증가”라는 제어 명령과 매핑될 수 있다.획득된 명령어 시퀀스가 복수의 제어 명령 중 하나와 매핑되면, 전자 장치는 매핑된 제어 명령에 기초하여 전자 장치의 동작을 제어한다. 예를 들어, 명령어 시퀀스가 복수의 제어 명령 중 “볼륨 증가”라는 제어 명령과 매핑되면, 전자 장치는 매핑된 제어 명령에 기초하여 전자 장치의 볼륨을 증가시킬 수 있다. 한편, 상술한 바와 같은 본 개시의 목적을 달성할 수 있는 범위 내라면, 본 개시의 다양한 실시 예에 따른 전자 장치의 유형은 제한되지 않는다. 예를 들어, 전자 장치는 스마트폰, 태블릿 PC, 카메라, 에어컨, TV, 세탁기, 공기 청정기, 청소기, 라디오, 선풍기, 전등, 자동차의 네비게이션, 차량용 오디오 또는 웨어러블 장치 등과 같은 전자 장치일 수 있다. 또한, 본 개시의 다양한 실시 예에 따라 전자 장치의 유형이 달라질 수 있는 만큼, 상술한 바와 같은 전자 장치의 제어 명령은 전자 장치의 유형 및 전자 장치가 포함하는 기능에 따라 달라질 수 있으며, 이에 따라 명령어 사전에 포함되는 복수의 명령어 또한 전자 장치의 유형 및 기능에 따라 달라질 수 있음 을 물론이다. 이하에서는 전자 장치가 포함하는 구체적인 구성을 바탕으로 본 개시의 다양한 실시 예를 보다 구체적으로 설명한다. 도 2는 본 개시의 일 실시 예에 따른 전자 장치의 구성을 간략하게 나타내는 블록도이다. 도 2에 도시된 바와 같이, 본 개시의 일 실시 예에 따른 전자 장치는 마이크, 메모리 및 프로세 서를 포함한다. 마이크는 전자 장치의 동작을 제어하기 위한 사용자 음성을 입력 받을 수 있다. 구체적으로, 마이크 는 사용자 음성에 따른 음향 신호를 전기 신호로 변환하는 역할을 한다. 특히, 본 개시의 다양한 실시 예에 있어서, 마이크는 전자 장치의 동작을 제어하기 위한 명령에 해당 하는 사용자 음성을 입력 받을 수 있다. 메모리에는 전자 장치에 관한 적어도 하나의 명령이 저장될 수 있다. 그리고, 메모리에는 전자 장치를 구동시키기 위한 O/S(Operating System)가 저장될 수 있다. 또한, 메모리에는 본 개시의 다양 한 실시 예들에 따라 전자 장치가 동작하기 위한 각종 소프트웨어 프로그램이나 애플리케이션이 저장될 수 도 있다. 그리고, 메모리는 플래시 메모리(Flash Memory) 등과 같은 반도체 메모리나 하드디스크(Hard Disk) 등과 같은 자기 저장 매체 등을 포함할 수 있다. 구체적으로, 메모리에는 본 개시의 다양한 실시 예에 따라 전자 장치가 동작하기 위한 각종 소프트웨 어 모듈이 저장될 수 있으며, 프로세서는 메모리에 저장된 각종 소프트웨어 모듈을 실행하여 전자 장 치의 동작을 제어할 수 있다. 특히, 본 개시의 다양한 실시 예에 있어서, 후술하는 바와 같은 종단간(end-to-end) 음성 인식 모델 및 인공 신 경망 모델 등과 같은 인공 지능 모델은 소프트웨어로 구현되어 메모리에 저장될 수 있으며, 프로세서(13 0)는 메모리에 저장된 소프트웨어를 실행하여, 본 개시에 따른 그래핌 시퀀스의 식별 과정 및 명령어 시퀀 스와 제어 명령 사이의 매핑 과정 등을 수행할 수 있다. 또한, 메모리에는 명령어 사전이 저장될 수 있다. 그리고, 명령어 사전은 전자 장치의 제어에 관련되 는 복수의 명령어를 포함할 수 있다. 구체적으로, 메모리에 저장되는 명령어 사전에는 전자 장치의 유형 및 기능에 관련되는 복수의 명령어를 포함할 수 있다. 프로세서는 전자 장치의 전반적인 동작을 제어한다. 구체적으로, 프로세서는 상술한 바와 같은 마이크 및 메모리를 포함하는 전자 장치의 구성과 연결되어 전자 장치의 동작을 전반적으 로 제어한다. 프로세서는 다양한 방식으로 구현될 수 있다. 예를 들어, 프로세서는 주문형 집적 회로(Application Specific Integrated Circuit, ASIC), 임베디드 프로세서, 마이크로프로세서, 하드웨어 컨트롤 로직, 하드웨어 유한 상태 기계(hardware Finite State Machine, FSM), 디지털 신호 프로세서(Digital Signal Processor, DSP) 중 적어도 하나로 구현될 수 있다. 또한, 프로세서는 ROM, RAM, GPU(Graphic Processing Unit), CPU 및 버스를 포함할 수 있으며, ROM, RAM, GPU(Graphic Processing Unit), CPU 등은 버스를 통해 서로 연결될 수 있다. 특히, 본 개시에 따른 다양한 실시 예에 있어서, 프로세서는 사용자 음성에 대응되는 그래핌 시퀀스의 식 별 과정, 명령어 시퀀스의 획득 과정, 명령어 시퀀스와 제어 명령 사이의 매핑 과정 및 제어 명령에 기초한 전 자 장치의 제어 과정에 이르기까지의 전반적인 동작을 제어한다. 구체적으로, 프로세서는 마이크를 통하여 사용자 음성이 입력되면, 입력된 사용자 음성에 대응되는 그래핌 시퀀스(grapheme sequence)를 식별한다. 도 1에 대한 설명에서 예로 든 바와 같이, “increase the volume”과 같은 사용자 음성이 입력되면, 프로세서 는 입력된 사용자 음성에 대응되는 그래핌 시퀀스로서, <i><n><c><r><i><z><space><th><u><space><v><o><l><u><m>와 같은 그래핌 시퀀스를 식별할 수 있다. 또 다른 예로서, “소리를 크게 해 주세요”와 같은 사용자 음성이 입력되면, 프로세서는 입력된 사용자 음성에 대응되는 그래핌 시퀀스로서, <ㅅ><ㅗ><ㄹ><ㅏ><ㄹ><ㅡ><ㄹ1><space><ㅋ><ㅡ><ㄱ><ㅐ><space><ㅎ> <ㅐ><space><ㅈ><ㅠ><ㅅ><ㅔ><ㅇ><ㅛ>와 같은 그래핌 시퀀스를 식별할 수 있다. 여기서 <ㄹ1>은 리을 받침을 의 미한다. 한편, 종래의 음성 인식 시스템은 일반적으로, 음향 특징을 추출하고 음소와 같은 sub-word unit을 예측하는 AM(Acoustic Model), 음소 시퀀스를 단어에 매핑하는 PM(Pronunciation Model), 단어 시퀀스에 확률을 지정하 는 LM(Language Model)을 포함한다. 그리고, 종래의 음성 인식 시스템에서는 AM, PM 및 LM이 서로 다른 데이터 세트에서 독립적으로 학습되는 것이 일반적이었다. 그런데, 근래에는 AM, PM 및 LM의 구성요소를 단일 신경망으로 결합하는 방식인 종단간(end-to- end) 음성 인식 모델이 개발되었다. 특히, 종단간 음성 인식 모델에 따르면, 음소 단위에서 단어로 매핑하기 위한 별도의 발음 사전(pronunciation dictionary, pronunciation lexicon)을 필요로 하지 않는다는 점에서, 음성 인식 프로세스를 단순화할 수 있다. 종단간 음성 인식 모델은 본 개시에 있어서도 적용될 수 있다. 구체적으로, 본 개시의 일 실시 예에 따르면, 메 모리는 종단간 음성 인식 모델이 구현된 소프트웨어를 포함할 수 있다. 그리고, 프로세서는 메모리 에 저장된 소프트웨어를 실행하고, 종단간 음성 인식 모델에 마이크를 통하여 입력된 사용자 음성을 입력하여 그래핌 시퀀스를 식별할 수 있다. 한편, 종단간 음성 인식 모델은 소프트웨어로 구현되어 메모리에 저장될 수 있을 뿐만 아니라, 종단간 음 성 인식 모델은 종단간 음성 인식 모델의 알고리즘을 수행할 수 있는 전용 칩으로 구현되어 프로세서에 포 함될 수도 있다. 종단간 음성 인식 모델의 구성에 관한 보다 구체적인 설명은 도 3에 대한 설명에서 상술한다. 사용자 음성에 대응되는 그래핌 시퀀스가 식별되면, 전자 장치는 메모리에 저장되는 명령어 사전에 포함되며 전자 장치의 제어에 관련되는 복수의 명령어 각각과 식별된 그래핌 시퀀스 사이의 편집 거리 (edit distance)에 기초하여, 식별된 그래핌 시퀀스로부터 명령어 시퀀스를 획득한다. 구체적으로, 전자 장치는 식별된 그래핌 시퀀스로부터, 명령어 사전에 포함되는 복수의 명령어 중 식별된 그래핌 시퀀스와 기 설정된 편집 거리 내에 있는 명령어 시퀀스를 획득할 수 있다. 여기서, 복수의 명령어란 전자 장치의 유형 및 기능에 관련되는 명령어를 의미하며, 편집 거리란 식별된 그래핌 시퀀스를 복수의 명령어 각각으로 변환하는데 필요한 문자의 제거, 삽입 및 치환의 최소 횟수를 의미한 다. 또한, 기 설정된 편집 거리는 프로세서에 의하여 설정되는 것일 수도 있고, 사용자에 의하여 설정되는 것일 수도 있다. 복수의 명령어에 대한 구체적인 예시에 대해서는 도 4에 대한 설명에서 상술한다. 도 1에 대한 설명에서 예로 든 바와 같이, <i><n><c><r><i><z>를 <i><n><c><r><ea><se>로 변환함에 따른 편집 거리는 2가 되며, <v><o><l><u><m>을 <v><o><l><u><m><e>으로 변환함에 따른 편집 거리는 1이 된다. 그리고, 이 경우, 기 설정된 편집 거리가 3이라면, <i><n><c><r><i><z><space><th><u><space><v><o><l><u><m>와 같은 그래핌 시퀀스로부터 {increase, volume}과 같은 명령어 시퀀스가 획득된다.한편, “increase the volume”과 같은 사용자 음성이 입력되는 경우, 그래핌 시퀀스가 위의 예와는 달리 식별 될 수도 있다. 예를 들어, “increase the volume”과 같은 사용자 음성이 입력되는 경우, <i><n><c><r><i><se><space><th><u><space><v><ow><l><u><m>와 같은 그래핌 시퀀스가 식별될 수도 있다. 그러 나, 이 경우에도 <i><n><c><r><i><se>를 <i><n><c><r><ea><se>로 변환함에 따른 편집 거리는 1이 되며, <v><ow><l><u><m>을 <v><o><l><u><m><e>으로 변환함에 따른 편집 거리는 2가 되므로, {increase, volume}과 같 은 명령어 시퀀스가 획득된다. 한편, 또 다른 예로서, <ㅅ><ㅗ><ㄹ><ㅏ><ㄹ><ㅡ><ㄹ1><space><ㅋ><ㅡ><ㄱ><ㅐ><space><ㅎ><ㅐ><space><ㅈ><ㅠ><ㅅ><ㅔ><ㅇ><ㅛ>와 같 은 그래핌 시퀀스가 식별되고, 기 설정된 편집 거리는 3이며, 명령어 사전은 “소리”와 “크기”라는 명령어를 포함하는 경우를 들 수 있다. 이 경우, <ㅅ><ㅗ><ㄹ><ㅏ>에서 <ㅏ>를 <ㅣ>로 치환하면, <ㅅ><ㅗ><ㄹ><ㅣ>로 변환되는바, <ㅅ><ㅗ><ㄹ><ㅏ>를 <ㅅ><ㅗ><ㄹ><ㅣ>로 변환하는데 필요한 문자의 제거, 삽입 및 치환의 최소 횟수는 한 번이며, 따라서 편집 거리 는 1이 된다. 그리고, <ㅋ><ㅡ><ㄱ><ㅐ>에서 <ㅐ>를 <ㅔ>로 치환하면, <ㅋ><ㅡ><ㄱ><ㅐ>로 변환되는바, <ㅋ><ㅡ><ㄱ><ㅐ>를 <ㅋ><ㅡ><ㄱ><ㅔ>로 변환하는데 필요한 문자의 제거, 삽입 및 치환의 최소 횟수는 한 번이며, 따라서 편집 거리 는 1이 된다. 한편, 나머지 식별된 그래핌들은 3번 이하의 제거, 삽입 및 치환을 통하여 명령어 사전에 포함되는 복수의 명령 어로 변환될 수 없다는 것을 전제한다. 상술한 바와 같은 과정을 통하여, <ㅅ><ㅗ><ㄹ><ㅏ><ㄹ><ㅡ><ㄹ1><space><ㅋ><ㅡ><ㄱ><ㅐ><space><ㅎ> <ㅐ><space><ㅈ><ㅠ><ㅅ><ㅔ><ㅇ><ㅛ>와 같은 그래핌 시퀀스로부터 {소리, 크게}와 같은 명령어 시퀀스가 획득 된다. 식별된 그래핌 시퀀스로부터 명령어 시퀀스를 획득하면, 프로세서는 획득된 명령어 시퀀스를 전자 장치 의 동작을 제어 하기 위한 복수의 제어 명령 중 하나와 매핑한다. 도 1에 대한 설명에서 예로 든 바와 같이, {increase, volume}과 같은 명령어 시퀀스는 전자 장치의 동작 을 제어하기 위한 복수의 제어 명령 중 “볼륨 증가”라는 동작에 관한 제어 명령과 매핑될 수 있다. 그리고, 또 다른 예로 든 바와 같이, {소리, 크게}와 같은 명령어 시퀀스 역시 전자 장치의 동작을 제어하 기 위한 복수의 제어 명령 중 “볼륨 증가”라는 동작에 관한 제어 명령과 매핑될 수 있다. 이상에서는 명령어 시퀀스가 전자 장치의 동작을 제어 하기 위한 복수의 제어 명령 중 하나와 매핑되는 경 우를 전제하였으나, 이는 설명의 편의를 위한 것일 뿐, 명령어 시퀀스가 두 가지 이상의 제어 명령과 매핑되는 경우를 제한하는 것은 아니다. 즉, 본 개시의 또 다른 실시 예에 따르면, {volume, Increase, Channel, Up}과 같은 명령어 시퀀스가 획득되는 경우, 명령어 시퀀스는 “볼륨 증가”와 “채널 증가”라는 두 가지 제어 명령과 매핑되고, 그에 따라 “볼륨 증가”와 “채널 증가”라는 동작이 순차적으로 수행될 수 있다. 한편, 명령어 시퀀스와 복수의 제어 명령 사이의 매핑 과정은 미리 정해진 규칙에 따라 이루어질 수도 있으나, 인공 신경망 모델을 통한 학습을 통하여 이루어질 수도 있다. 즉, 본 개시의 일 실시 예에 따르면, 메모리는 명령어 시퀀스와 복수의 제어 명령 사이의 매핑을 위한 인 공 신경망 모델이 구현된 소프트웨어를 포함할 수 있다. 그리고, 프로세서는 메모리에 저장된 소프트 웨어를 실행하고, 인공 신경망 모델에 명령어 시퀀스를 입력하여 복수의 제어 명령 중 하나와 매핑할 수 있다. 한편, 인공 신경망 모델은 소프트웨어로 구현되어 메모리에 저장될 수 있을 뿐만 아니라, 인공 신경망 모 델의 알고리즘을 수행할 수 있는 전용 칩으로 구현되어 프로세서에 포함될 수도 있다. 인공 신경망 모델의 구성에 관한 보다 구체적인 설명은 도 5에 대한 설명에서 상술한다. 획득된 명령어 시퀀스가 복수의 제어 명령 중 하나와 매핑되면, 전자 장치는 매핑된 제어 명령에 기초하여 전자 장치의 동작을 제어한다. 예를 들어, 상술한 바와 같은 두 가지 예시의 경우와 같이, 명령어 시퀀스 가 복수의 제어 명령 중 “볼륨 증가”라는 제어 명령과 매핑되면, 전자 장치는 매핑된 제어 명령에 기초하여 전자 장치의 볼륨을 증가시킬 수 있다. 한편, 도 2에 도시하지는 않았으나, 본 개시의 일 실시 예에 따른 전자 장치는 출력부(미도시)를 더 포함 할 수 있다. 출력부(미도시)는 전자 장치가 수행할 수 있는 다양한 기능을 출력할 수 있다. 그리고, 출력 부(미도시)는 디스플레이, 스피커 또는 진동 장치 등을 포함할 수 있다. 한편, 본 개시에 따른 제어 과정에 있어서, 사용자가 발화로써 의도하였던 대로 전자 장치의 제어가 원활 하게 수행되는 경우라면, 사용자는 해당 동작이 수행되는 것을 확인함으로써 전자 장치의 제어가 원활하게 수행되었음을 인식할 수 있다. 그러나, 사용자의 음성 명령이 매우 추상적인 단어로 이루어진 경우와 같이, 사용자가 발화로써 의도하였던 대 로 전자 장치의 제어가 원활하게 수행되지 않는 경우가 발생할 수 있으며, 이 경우에는 사용자에게 알림을 제공하여 다시 발화하도록 유도할 필요성이 생기게 된다. 따라서, 본 개시의 일 실시 예에 따르면, 사용자 음성이 입력되었으나 전자 장치의 동작에 대한 제어가 기 설정된 시간 동안 수행되지 않으면, 프로세서는 사용자에게 알림을 제공하도록 출력부(미도시)를 제어할 수 있다. 예를 들어, 프로세서는 원활한 제어가 수행되지 않았음을 알리는 시각적 영상을 출력하도록 디스플레이를 제어할 수도 있고, 원활한 제어가 수행되지 않았음을 알리는 음성을 출력하도록 스피커를 제어할 수도 있으며, 원활한 제어가 수행되지 않았음을 알리는 진동을 전달하도록 진동 장치를 제어할 수도 있다. 한편, 이상에서는 본 개시의 다양한 실시 예를 설명함에 있어서 사용자 음성에 대응되는 그래핌 시퀀스를 식별 하는 경우를 예로 들어 설명하였지만, 본 개시가 반드시 이에 국한되는 것은 아니다. 즉, 본 개시의 목적을 달성할 수 있는 범위 내에서라면, 본 개시는 그래핌뿐만 아니라 다양한 subword를 음성 인식의 단위로 하여 구현될 수 있다. 여기서 subword란 그래핌 또는 word piece와 같이 단어(word)를 구성하는 다양한 하위 구성요소를 의미한다. 특히, 본 개시의 또 다른 실시 예에 따르면, 프로세서는 입력된 사용자 음성에 대응되는 또 다른 subword, 예를 들어 word piece의 시퀀스를 식별할 수도 있다. 그리고, 프로세서는 식별된 word piece의 시퀀스로부 터 명령어 시퀀스를 획득하고, 명령어 시퀀스를 복수의 제어 명령 중 하나와 매핑하며, 매핑된 제어 명령에 기 초하여 전자 장치의 동작을 제어할 수도 있다. 여기서, word piece란 제한된 개수로 해당 언어의 모든 단어를 표현할 수 있도록 하는 subword로서, 해당 언어 에 있어서 사용 빈도가 높은 단어의 종류 및 word piece를 획득하기 위한 학습 알고리즘 등에 따라 구체적인 word piece의 예는 달라질 수 있다. 예를 들어, 영어의 경우 “over”라는 단어는 자주 사용되기 때문에 그 자체가 하나의 word piece가 되지만, “ Jet”라는 단어는 자주 사용되지 않기 때문에, “J”와 “et”라는 word piece에 의하여 식별될 수 있다. 한편, 예를 들어 BPE(Byte-Pair Encoding)와 같은 알고리즘을 이용하여 word piece를 학습할 경우, 5천개 내지 1만개 의 word piece를 획득할 수 있다. 한편, 이상에서는 사용자 음성이 영어 또는 한국어로 입력되는 경우를 예로 들어 설명하였으나, 그 밖에도 사용 자의 음성은 다양한 언어로 입력될 수 있다. 그리고, 사용자의 음성이 어떠한 언어로 입력되는지에 따라 본 개 시에 따라 식별되는 subword의 단위, subword의 식별을 위한 종단간 음성 인식 모델 또는 명령어 시퀀스와 복수 의 제어 명령 사이의 매핑을 위한 인공 신경망 모델 등은 본 개시의 목적을 달성할 수 있는 범위 내에서 다양하 게 변경될 수 있다. 이상에서 살펴 본 바와 같은 본 개시의 다양한 실시 예에 따르면, on- device 방식으로 음성 인식 기술을 구현 하면서도, 음성 인식 시스템의 크기를 최소화할 수 있다. 구체적으로, 본 개시에 따르면, AM, PM 및 LM의 구성요소를 단일 신경망으로 결합하는 방식인 종단간 음성 인식 모델 및 명령어 사전을 이용함으로써 메모리 사용량을 최소화할 수 있다. 그리고 이에 따라, 높은 메모리 사용량에 따른 단가 상승의 문제를 해결할 수 있으며, 기기 마다 다르게 LM, PM 등을 구현해야 하는 노력 에서 해방될 수 있다. 또한, 명령어 시퀀스와 복수의 제어 명령 사이의 매핑을 위한 인공 신경망 모델을 활용함으로써, 보다 유연한 사용자 명령의 처리가 가능하게 된다. 나아가, 그래핌 시퀀스의 식별을 위한 종단간 음성 인식 모델과, 명령어시퀀스와 복수의 제어 명령 사이의 매핑을 위한 인공 신경망 모델의 전체 경로를 joint training함으로써, 더욱 유연한 사용자 명령의 처리가 가능하게 된다. 도 3은 본 개시의 일 실시 예에 따른, 그래핌 시퀀스의 식별을 위한 종단간 음성 인식 모델의 구성을 간략하게 나타내는 도면이다. 상술한 바와 같이, 근래에는 AM, PM 및 LM의 구성요소를 단일 신경망으로 결합하는 방식인 종단간(end-to-end) 음성 인식 모델이 개발되었으며, 종단간 음성 인식 모델은 본 개시에 있어서도 적용될 수 있다. 구체적으로, 본 개시의 일 실시 예에 따르면, 프로세서는 종단간 음성 인식 모델에 마이크를 통하여 입력된 사용자 음성을 입력하여 그래핌 시퀀스를 식별할 수 있다. 도 3은 종단간 음성 인식 모델 중 attention based model의 구성을 간략하게 도시한 것이다. 도 3에 도시된 바 와 같이, attention based model은 인코더, 어텐션 모듈, 디코더를 포함할 수 있다. 그리고, 인코 더 및 디코더는 RNN으로 구현될 수 있다. 인코더는 사용자 음성 x를 입력 받고 x의 음향 특징을 고차원의 음향 특징(higher order feature representation) h로 매핑시킨다. 고차원의 음향 특징인 h가 어텐션 모듈로 전달되면, 어텐션 모듈은 출력 y를 예측하기 위하여 음향 특징 x에서 어떠한 부분을 중요하게 고려하여야 하는지를 결정하고, 어텐션 컨 텍스트(attention contex) c를 디코더로 전달한다. 어텐션 턴텍스트 c가 디코더로 전달되면, 디코더 는 어텐션 컨텍스트 c와 이전 예측의 임베딩에 해당하는 yi-1를 입력 받아, 확률 분포 P를 생성하고 출력 yi 를 예측한다. 상술한 바와 같은 종단간 음성 인식 모델에 따르면, 사용자 음성을 입력 값으로 하고 사용자 음성에 대응되는 그래핌 시퀀스를 출력 값으로 하는 end-to-end 그래핌 디코더가 구현될 수 있다. 그리고, 입력되는 데이터의 크 기 및 입력 데이터에 대한 인공 신경망의 훈련에 따라, 사용자 음성에 보다 정확하게 대응되는 그래핌 시퀀스가 식별될 수 있다. 한편, 도 3에 도시된 바와 같은 구성은 예시적인 것일 뿐이며, 본 개시의 목적을 달성할 수 있는 범위 내에서, 다양한 형태의 종단간 음성 인식 모델이 적용될 수 있음은 물론이다. 상술한 바와 같이, 본 개시의 일 실시 예에 따르면, 발음 사전 대신 명령어 사전을 이용하며, AM, PM 및 LM의 구성요소를 단일 신경망으로 결합하는 방식인 종단간 음성 인식 모델을 이용함으로써 메모리 사용량을 최 소화할 수 있다. 도 4a 및 도 4b는 본 개시의 일 실시 예에 따른 명령어 사전 및 명령어 사전에 포함되는 복수의 명령어를 나타 내는 도면이다. 본 개시에 따른 명령어 사전은 메모리에 저장되며, 복수의 명령어를 포함한다. 그리고, 복수의 명령어는 전자 장치의 제어에 관련된다. 구체적으로, 복수의 명령어는 전자 장치의 유형 및 전자 장치가 포함하는 기능에 관련된다. 다시 말해, 복수의 명령어는 전자 장치의 다양한 유형에 따라 달라질 수 있으 며, 동일한 유형의 전자 장치에 있어서도 전자 장치가 포함하는 기능에 따라서 달라질 수 있다. 도 4a는 전자 장치가 TV인 경우를 예로 들어, 명령어 사전에 포함되는 복수의 명령어를 간략하게 나타내기 위한 도면이다. 도 4a에 도시된 바와 같이, 전자 장치가 TV인 경우 명령어 사전은 “Volume”, “Increase ”, “Decrease”, “Channel”, “Up” 및 “Up” 등과 같은 복수의 명령어를 포함할 수 있다. 한편, 도 4b는 전자 장치가 에어컨인 경우를 예로 들어, 명령어 사전에 포함되는 복수의 명령어를 상세하 게 나타내기 위한 도면이다. 도 4b에 도시된 바와 같이, 전자 장치가 에어컨인 경우, “에어컨”, “상세 화면”, “전원”, “제습”, “습도”, “온도”, “상단”, “세기”, “강하게”, “약하게”, “쾌면”, “ 외부온도” 및 “전력” 등과 같은 복수의 명령어를 포함할 수 있다. 한편, 명령어 사전에 포함되는 명령어의 개수가 많을수록 사용자의 음성으로부터 명령어 시퀀스가 용이하게 획 득될 수 있는 반면, 획득된 명령어 시퀀스를 복수의 제어 명령과 매핑하는 과정의 효율성은 떨어질 수 있다. 그 리고, 명령어 사전에 포함되는 명령어의 개수가 적을수록 사용자 음성으로부터 명령어 시퀀스가 용이하게 획득되기는 어려운 반면, 획득된 명령어 시퀀스는 복수의 제어 명령 중 하나와 쉽게 매핑될 수 있다. 따라서, 명령어 사전에 포함되는 복수의 명령어의 양은 전자 장치의 유형과 전자 장치가 포함하는 기 능의 개수, 본 개시를 구현하기 위한 구체적인 인공 신경망 모델, 그리고 본 개시에 따른 전체 제어 과정의 효 율성 등을 종합적으로 고려하여 결정되어야 한다. 한편, 명령어 사전에 포함되는 복수의 명령어는 전자 장치의 출고 시에 메모리에 저장된 대로 유지될 수도 있으나, 반드시 이에 국한되는 것은 아니다. 즉, 출고 후 해당 전자 장치의 기능이 업데이트됨에 따 라, 업데이트된 기능에 대응되는 명령어가 명령어 사전에 추가될 수도 있다. 또한, 사용자의 명령에 따라 특정 기능에 대응되는 명령어가 명령어 사전에 추가될 수도 있다. 예를 들어, 사용 자가 “Be quiet”이라는 음성을 발화함으로써 TV의 음소거 기능을 실행하고자 하는 경우가 있을 수 있다. 이 경우, “quiet”이 명령어 사전에 포함되어 있지 않으면, “Be quiet”이라는 사용자 음성이 입력되었으나 전자 장치의 동작에 대한 제어가 기 설정된 시간 동안 수행되지 않는 경우로서, 출력부(미도시)를 통하여 사용자에게 알림이 제공될 수 있다. 그리고, 이 경우 사용자는 또 다른 음성을 발화할 수도 있지만, “quiet” 이라는 명령어를 명령어 사전에 추가할 수도 있다. 도 5a 및 도 5b는 본 개시의 일 실시 예에 따른, 명령어 시퀀스와 복수의 제어 명령 사이의 매핑을 위한 인공 신경망 모델의 구성을 간략하게 나타내는 도면이다. 도 5a에 도시된 바와 같이, 명령어 시퀀스와 복수의 제어 명령 사이의 매핑을 위한 인공 신경망 모델은 워드 임 베딩(word embedding) 모듈 및 RNN Classifier 모듈을 포함할 수 있다. 구체적으로, 명령어 시퀀스는 워드 임베딩 과정을 거쳐 벡터의 시퀀스로 변환될 수 있다. 여기서, 워드 임베딩 이란 단어를 벡터 공간 상의 점으로 매핑해주는 것을 말한다. 예를 들어, 본 개시의 일 실시 예에 따라 획득된 {increase, volume}과 같은 명령어 시퀀스가 워드 임베딩 과정 을 거치면, { , }과 같은 벡터의 시퀀스로 변환될 수 있다. 한편, 워드 임베딩을 통하여 명령어 시퀀스를 구성하는 각각의 명령어를 벡터로 변환할 때 명령어의 의미, 그리 고 명령어와 명령어 사이의 관계 등을 고려하기 위한 다양한 방법이 존재하는바, 본 개시가 특정의 워드 임베딩 방법에 국한되는 것은 아니다. 명령어 시퀀스가 워드 임베딩 모듈을 거쳐 벡터의 시퀀스로 변환되면, 벡터의 시퀀스는 RNN(Recurrent Neural Network) Classifier을 통하여 분류되며, 이에 따라 전자 장치의 동작을 제어하기 위한 복수 의 제어 명령 중 하나와 매핑될 수 있다. 예를 들어, 워드 임베딩 모듈을 거쳐 {소리, 크게}, {소리, 증가}, {소리, 아주, 크게}, {소리, 작게} 및 {소리, 줄여}라는 벡터의 시퀀스가 획득되면, RNN Classifier는 그 중 {소리, 크게}, {소리, 증가}를 동일 한 하나의 벡터 차원으로 분류할 수 있다. 또한, RNN Classifier는 {소리, 아주, 크게} 를 위와 유사하나 더 큰 볼륨 증가와 관련된 또 다른 벡터 차 원으로 분류할 수 있고, {소리, 작게}, {소리, 줄여} 를 위 두 가지 예와 상이한 하나의 벡터 차원으로 분류할 수 있다. 그리고, 위와 같은 분류 각각은 전자 장치의 동작을 제어하기 위한 복수의 제어 명령 중 “볼륨 한 단계 증가”, “볼륨 세 단계 증가” 및 “볼륨 한 단계 감소” 와 같은 제어 명령과 각각 매핑될 수 있다. 한편, RNN은 순환 구조를 가지는 인공 신경망의 한 종류로서, 음성이나 문자와 같이 순차적으로 구성되는 데이 터의 처리에 적합한 모델이다. 도 5b를 참조하여 RNN의 기본적인 구성에 대하여 살펴보면, xt는 시간 스텝 t에서의 입력 값이며, st는 시간 스 텝 t에서의 hidden state로서, 이전 시간 스텝의 hidden state 값과 현재 시간 스텝의 입력 값에 의해 계산된다. 그리고, yt는 시간 스텝 t에서의 출력 값이다. 즉, 도 5b에 도시된 바와 같은 인공 신경망에 따르면, 과거의 데이터가 현재의 출력에 영향을 미칠 수 있다.상술한 바와 같은 본 개시의 일 실시 예에 따르면, 명령어 시퀀스와 복수의 제어 명령 사이의 매핑을 위하여 인 공 신경망 모델을 적용함으로써, 보다 유연한 사용자 명령의 처리가 가능하게 된다. 다만, 상술한 바와 같은 인 공 신경망의 구성은 예시적인 것으로서, 본 개시의 목적을 달성할 수 있는 범위 내에서라면 CNN(Convolutional Neural Network) 등과 같은 다양한 인공 신경망 구조가 적용될 수 있다. 한편, 이상에서는 그래핌 시퀀스의 식별을 위한 종단간 음성 인식 모델과, 명령어 시퀀스와 복수의 제어 명령 사이의 매핑을 위한 인공 신경망 모델이 각각 독립된 하나의 모델로서 구현되는 경우를 전제하여 설명하였다. 그러나, 본 개시의 또 다른 실시 예에 따르면, 그래핌 시퀀스의 식별을 위한 종단간 음성 인식 모델과, 명령어 시퀀스와 복수의 제어 명령 사이의 매핑을 위한 인공 신경망 모델의 전체 경로(pipeline)를 joint training할 수도 있다. 다시 말해, 사용자 음성을 입력 값으로 하고 사용자 음성에 대응되는 제어 명령을 출력 값으로 하는 하나의 모 델을 훈련시키는 것과 같이 종단간 음성 인식 모델 및 인공 신경망 모델의 전체 경로를 end-to-end로 훈련시킬 수 있다. 본 개시에 따른 전자 장치의 사용자가 음성 명령을 발화함으로써 의도하는 것은 다름 아니라, 사용자 음성 명령에 대응되는 전자 장치의 동작이 수행되는 것이므로, 사용자의 음성을 입력 값으로 하고 사용자 음성에 대 응되는 제어 명령을 출력 값으로 하여 전체 경로를 end-to-end로 훈련할 경우, 보다 정확하고 유연한 사용자 명 령의 처리가 가능하게 된다. 도 6은 본 개시의 일 실시 예에 따른 전자 장치의 제어 방법을 설명하기 위한 흐름도이다. 도 6에 도시된 바와 같이, 마이크를 통하여 사용자 음성이 입력되면(S601), 전자 장치는 입력된 사용자 음성에 대응되는 그래핌 시퀀스(grapheme sequence)를 식별한다(S602). 구체적으로, 전자 장치는 종단간(end-to-end) 음성 인식 모델에, 마이크를 통하여 입력된 사용자 음성을 입력하 여 그래핌 시퀀스를 식별할 수 있다. 그래핌 시퀀스가 식별되면, 전자 장치는 메모리에 저장되는 명령어 사전에 포함되며 전자 장치의 제어에 관련되 는 복수의 명령어 각각과 식별된 그래핌 시퀀스 사이의 편집 거리(edit distance)에 기초하여, 식별된 그래핌 시퀀스로부터 명령어 시퀀스를 획득한다(S603). 여기서, 편집 거리는 식별된 그래핌 시퀀스를 복수의 명령어 각각으로 변환하는데 필요한 문자의 제거, 삽입 및 치환의 최소 횟수를 의미한다. 그리고, 전자 장치는 식별된 그래핌 시퀀스로부터, 복수의 명령어 중 식별된 그 래핌 시퀀스와 기 설정된 편집 거리 내에 있는 명령어 시퀀스를 획득할 수 있다. 명령어 시퀀스가 획득되면, 획득된 명령어 시퀀스를 전자 장치의 동작을 제어하기 위한 복수의 제어 명령 중 하 나와 매핑한다(S604). 구체적으로, 전자 장치는 인공 신경망(artificial neural network) 모델에 획득된 명령어 시퀀스를 입력하여 복 수의 제어 명령 중 적어도 하나와 매핑할 수 있다. 명령어 시퀀스가 복수의 제어 명령 중 하나와 매핑되면, 매핑된 제어 명령에 기초하여 전자 장치의 동작을 제어 한다(S605). 한편, 상술한 바와 같은 종단간 음성 인식 모델 및 인공 신경망 모델 중 적어도 하나의 모델은 RNN(Recurrent Neural Network)를 포함할 수 있다. 그리고, 본 개시의 일 실시 예에 따르면, 종단간 음성 인식 모델 및 인공 신경망 모델의 전체 경로(pipeline)는 joint training될 수 있다. 상술한 바와 같은 본 개시의 다양한 실시 예에 따르면, on-device 방식으로 음성 인식 기술을 구현하면서도, 음 성 인식 시스템의 크기를 최소화할 수 있다. 구체적으로, 종단간 음성 인식 모델 및 명령어 사전을 활용함으로 써 메모리 사용량을 최소화할 수 있으며, 명령어 시퀀스와 복수의 제어 명령 사이의 매핑을 위한 인공 신경망 모델을 활용함으로써, 보다 유연한 사용자 명령의 처리가 가능하게 된다. 한편, 상술한 실시 예에 따른 전자 장치의 제어 방법은 프로그램으로 구현되어 전자 장치에 제공될 수 있다. 특 히, 전자 장치의 제어 방법을 포함하는 프로그램은 비일시적 판독 가능 매체(non-transitory computer readable medium)에 저장되어 제공될 수 있다. 구체적으로, 전자 장치의 제어 방법을 실행하는 프로그램을 포함하는 컴퓨터 판독 가능 기록매체에 있어서, 사 용자 단말의 제어 방법은 마이크를 통하여 사용자 음성이 입력되면, 입력된 사용자 음성에 대응되는 그래핌 시 퀀스(grapheme sequence)를 식별하는 단계, 메모리에 저장되는 명령어 사전에 포함되며 전자 장치의 제어에 관 련되는 복수의 명령어 각각과 식별된 그래핌 시퀀스 사이의 편집 거리(edit distance)에 기초하여, 식별된 그래 핌 시퀀스로부터 명령어 시퀀스를 획득하는 단계, 획득된 명령어 시퀀스를 전자 장치의 동작을 제어하기 위한 복수의 제어 명령 중 하나와 매핑하는 단계 및 매핑된 제어 명령에 기초하여 전자 장치의 동작을 제어하는 단계 를 포함한다. 한편, 비일시적 판독 가능 매체란 레지스터, 캐쉬, 메모리 등과 같이 짧은 순간 동안 데이터를 저장하는 매체가 아니라 반영구적으로 데이터를 저장하며, 기기에 의해 판독(reading)이 가능한 매체를 의미한다. 구체적으로는, 상술한 다양한 어플리케이션 또는 프로그램들은 CD, DVD, 하드 디스크, 블루레이 디스크, USB, 메모리카드, ROM 등과 같은 비일시적 판독 가능 매체에 저장되어 제공될 수 있다. 이상에서는 본 개시의 바람직한 실시 예에 대하여 도시하고 설명하였지만, 본 개시는 상술한 특정의 실시 예에"}
{"patent_id": "10-2018-0123974", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "한정되지 아니하며, 청구범위에서 청구하는 본 개시의 요지를 벗어남이 없이 당해 개시가 속하는 기술분야에서 통상의 지식을 가진 자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 개시의 기술 적 사상이나 전망으로부터 개별적으로 이해되어서는 안 될 것이다."}
{"patent_id": "10-2018-0123974", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시 예에 따른 전자 장치의 제어 과정을 개략적으로 나타내는 도면, 도 2는 본 개시의 일 실시 예에 따른 전자 장치의 구성을 간략하게 나타내는 블록도, 도 3은 본 개시의 일 실시 예에 따른, 그래핌 시퀀스의 식별을 위한 종단간 음성 인식 모델의 구성을 간략하게나타내는 도면, 도 4a 및 도 4b는 본 개시의 일 실시 예에 따른 명령어 사전 및 명령어 사전에 포함되는 복수의 명령어를 나타 내는 도면, 도 5a 및 도 5b는 본 개시의 일 실시 예에 따른, 명령어 시퀀스와 복수의 제어 명령 사이의 매핑을 위한 인공 신경망 모델의 구성을 간략하게 나타내는 도면, 그리고 도 6은 본 개시의 일 실시 예에 따른 전자 장치의 제어 방법을 설명하기 위한 흐름도이다."}
