{"patent_id": "10-2023-7029140", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0145090", "출원번호": "10-2023-7029140", "발명의 명칭": "검사 장치와 연동하는 복수의 프로브로부터 타겟 프로브를 식별하는 시스템 및 방법", "출원인": "수퍼소닉 이매진", "발명자": "루쏘, 에티엔느"}}
{"patent_id": "10-2023-7029140", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "검사 장치와 연동하는 복수의 프로브 중 타겟 프로브(1)를 식별하는 시스템에 있어서,상기 시스템 (10)은, 상기 타겟 프로브(1)와 결합하도록 구성된 식별 요소, 및 상기 검사 장치와 결합되고 상기 타겟 프로브(1)를 지지하도록 구성된 적어도 하나의 프로브-홀더(2), 상기 프로브-홀더(2)와 연관되고 상기 타겟 프로브(1)의 식별 요소와 통신하도록 구성된 판독기(3), 및 상기 판독기(3)와 통신하도록 구성되고 상기 판독기(3)와 상기 타겟 프로브(1)의 상기 식별 요소 사이의 통신 기능으로서 상기 시스템 (10)의 사용자에게 신호를 방출하도록 구성된 시그널링 요소(4)를 포함하는, 시스템."}
{"patent_id": "10-2023-7029140", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 식별 요소는, 상기 타겟 프로브(1)의 식별 정보를 상기 판독기(3)로 보내도록 구성되고, 및 상기 시그널링 요소(4)는, 상기 식별 정보의 함수로서 신호를 방출하도록 구성되는, 시스템."}
{"patent_id": "10-2023-7029140", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항 또는 제2항에 있어서,상기 판독기(3)는, 상기 검사 장치의 프로세서와 통신하도록 구성되고, 및 상기 시그널링 요소(4)는, 상기 프로세서에 의해 수신된 제어 신호의 함수로서 추가로 상기 신호를 방출하는, 시스템."}
{"patent_id": "10-2023-7029140", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항 내지 제3항 중 어느 한 항에 있어서,상기 제어 신호는, 상기 타겟 프로브(1)의 식별 요청을 포함하고, 상기 판독기(3)가 상기 타겟 프로브(1)의 식별 요소와 통신하는경우, 상기 시그널링 요소(4)는 상기 프로브의 존재를 나타내는 신호를 방출하는, 공개특허 10-2023-0145090-3-시스템."}
{"patent_id": "10-2023-7029140", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항 내지 제4항 중 어느 한 항에 있어서,상기 시스템 (10)은, 각각 프로브와 연관되도록 구성된 복수의 식별 요소를 포함하고, 및/또는 상기 시스템 (10)은, 복수의 프로브-홀더를 포함하고, 각 프로브-홀더는, 판독기 및/또는 시그널링 요소를 포함하거나, 또는 상기 프로브-홀더는, 중앙 집중식 판독기 및/또는 중앙 집중식 시그널링 요소를 포함하는, 시스템."}
{"patent_id": "10-2023-7029140", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항 내지 제5항 중 어느 한 항에 있어서,상기 시그널링 요소(4)에 의해 방출된 상기 신호는, 광 및/또는 소리를 포함하고, 및/또는 상기 시그널링 요소(4)는, 적어도 하나의 광원(401) 및/또는 음원을 포함하고, 및/또는 상기 시스템 (10)이 복수의 프로브-홀더를 포함하는 경우, 각각의 프로브-홀더(2)는 적어도 하나의 광원 형태의시그널링 요소를 포함하는, 시스템."}
{"patent_id": "10-2023-7029140", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항 내지 제6항 중 어느 한 항에 있어서,상기 시그널링 요소에 의해 방출된 상기 신호는, 디스플레이 시스템에 대한 정보를 제공하고 및/또는 확성기를 통해 소리를 방출하도록 구성된 전자 신호를 포함하고, 및/또는 상기 시그널링 요소는, 상기 신호를 외부 장치로 전송하기 위한 적어도 하나의 인터페이스를 포함하는, 시스템."}
{"patent_id": "10-2023-7029140", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항 내지 제7항 중 어느 한 항에 있어서,상기 프로브-홀더(2)는, 공개특허 10-2023-0145090-4-상기 판독기(3) 및/또는 상기 시그널링 요소를 포함하고, 및/또는 상기 프로브-홀더(2)는, 상기 프로브를 수용하도록 구성된 리셉터클(201) 및/또는 상기 프로브-홀더(2) 및/또는 상기 리셉터클(201)을 조명하도록 구성된 적어도 하나의 광원을 포함하는, 시스템."}
{"patent_id": "10-2023-7029140", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항 내지 제8항 중 어느 한 항에 있어서,상기 프로브-홀더(2)는, 상기 프로브-홀더(2)의 하부에 위치되거나 상기 프로브-홀더(2) 아래에 조명을 제공하도록 구성된 적어도 하나의 추가 광원을 포함하는, 시스템."}
{"patent_id": "10-2023-7029140", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항 내지 제9항 중 어느 한 항에 있어서,상기 프로브는, 유선 또는 무선으로 상기 검사 장치에 연결되도록 구성되고, 및/또는 식별 요청에 표시된 상기 타겟 프로브(1)가 상기 프로브-홀더(2)에 있지만 상기 검사 장치에 연결되지 않은 경우, 상기 추가 광원이 켜지는, 시스템."}
{"patent_id": "10-2023-7029140", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항 내지 제10항 중 어느 한 항에 있어서,상기 판독기(3)와 상기 프로브의 식별 요소 사이의 상기 통신은, 무선이고, 및/또는 알에프아이디, 엔에프씨, 비엘이, 와이파이 또는 광통신 기술 중 적어도 하나를 포함하고,및/또는 상기 판독기(3)는, 알에프아이디 판독기이고 상기 식별 요소는, 수동 알에프아이디 태그이고, 및/또는 상기 판독기(3)와 상기 프로브의 상기 식별 요소 사이의 통신은, 상기 검사 장치와 상기 프로브에서 상기 장치로 검사 데이터를 전송하는 데 사용되는 상기 프로브 사이의 인터페이스와 상이한 인터페이스를 통해 수행되는, 시스템."}
{"patent_id": "10-2023-7029140", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "공개특허 10-2023-0145090-5-제1항 내지 제11항 중 어느 한 항에 있어서, 적어도 하나 또는 각각의 프로브-홀더(2)는, 상기 판독기(3)의 전자기 보호를 위해 구성되고, 및/또는 상기 판독기(3)가 상기 리셉터클(201) 외부에 있는 및/또는 다른 프로브-홀더(2)에 포지션된 프로브의 상기 식별 요소를 판독하는 것을 방지하도록 구성되는, 보호 요소, 를 포함하는, 시스템."}
{"patent_id": "10-2023-7029140", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제1항 내지 제12항 중 어느 한 항에 있어서,상기 보호 요소는, 적어도 하나의 전자기 절연벽이고, 및/또는 상기 전자기 절연벽을 포함하는, 시스템."}
{"patent_id": "10-2023-7029140", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제1항 내지 제13항 중 어느 한 항에 있어서,상기 전자기 절연벽은, 상기 프로브-홀더의 쉘의 적어도 하나의 측면에 배치되고, 및/또는 상기 전자기 절연벽은, 상기 리셉터클의 표면에 배치되는, 시스템."}
{"patent_id": "10-2023-7029140", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "타겟 프로브(1)을 찾기 위한 시스템에 있어서,제1항 내지 제14항 중 어느 한 항에 따른 시스템을 포함하고, 상기 판독기(3)는, 상기 타겟 프로브(1)의 위치를 파악하도록 구성되는, 시스템."}
{"patent_id": "10-2023-7029140", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "복수의 프로브와 연동하도록 구성된 검사 장치에 있어서, 작동 연결을 통해 프로브로부터 수신된 검사 데이터를 처리하도록 구성된 프로세서, 및 제1항 내지 제15항 중 어느 한 항에 따른 시스템을 포함하고, 공개특허 10-2023-0145090-6-상기 검사 장치는, 적어도 하나의 프로브-홀더(2)를 구비하는, 검사 장치."}
{"patent_id": "10-2023-7029140", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제1항 내지 제16항 중 어느 한 항에 있어서,상기 작동 연결은, 유선 또는 무선 모드 연결을 포함하고 및/또는 상기 판독기(3)는, 상기 작동 연결 이외의 연결을 통해 상기 식별 요소와 통신하도록 구성되는, 장치."}
{"patent_id": "10-2023-7029140", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "검사 플랫폼에 있어서,제16항 및 제17항 중 어느 한 항에 따른 장치 및 식별 요소가 구비된 적어도 하나의 프로브를 포함하는, 검사 플랫폼."}
{"patent_id": "10-2023-7029140", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "검사 장치(500)와 연동하는 복수의 프로브 중 타겟 프로브를 식별하는 방법에 있어서,상기 방법은, 상기 타겟 프로브(1)를 지지하기 위한 프로브-홀더(2)와 연관된 판독기(3)가 상기 타겟 프로브(1)와 연관된 식별 요소와 통신하는 통신 단계, 및 상기 판독기(3)와 상기 식별 요소 사이의 상기 통신의 기능으로서 시그널링 요소가 사용자에게 신호를 방출하는시그널링 단계를 포함하는, 방법."}
{"patent_id": "10-2023-7029140", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제1항 내지 제19항 중 어느 한 항에 있어서,상기 신호는, 상기 타겟 프로브(1)의 상태를 상기 사용자에게 표시하기에 적합하고, 상기 신호는, 상기 타겟 프로브(1)가 상기 장치의 복수의 프로브-홀더 중 어느 프로브-홀더(2)에 놓여 있는지를 나타내는 신호 유형, 공개특허 10-2023-0145090-7-상기 프로브가 소정의 검사 또는 검사의 주어진 상태에 적합함을 나타내는 신호 유형, 상기 타겟 프로브(1)가 유지 보수 중임을 나타내는 신호 유형, 상기 프로브가 고장난 것을 나타내는 신호 유형, 상기 타겟 프로브(1)가 상기 프로브-홀더(2)에 잘못 삽입되었음을 나타내는 신호 유형, 상기 타겟 프로브(1)가 상기 검사 장치에 연결되어 있지 않음을 나타내는 신호 유형, 및 상기 타겟 프로브(1)가 테스트 모드에 있음을 나타내는 신호 유형 중 적어도 하나를 포함하는, 방법."}
{"patent_id": "10-2023-7029140", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제1항 내지 제20항 중 어느 한 항에 있어서,소정의 검사에서 상기 타겟 프로브(1)를 사용하기 전에, 상기 시그널링 요소는 상기 타겟 프로브(1)가 제1 시그널링 레벨에 배치된 상기 프로브-홀더(2)를 나타내는 제1 신호 유형을 방출하고, 및 사용 중 및/또는 사용 종료 시, 상기 시그널링 요소는 사용 후 상기 타겟 프로브(1)를 수용하는 데 적합한 프로브-홀더(들)를 나타내는 제2 신호 유형을 방출하는, 방법."}
{"patent_id": "10-2023-7029140", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제1항 내지 제21항 중 어느 한 항에 있어서, 각 프로브에 식별 요소를 구비하는 단계, 판독기(3) 및/또는 시그널링 요소를 각각 포함하거나, 또는 각각 중앙 판독기 및/또는 중앙 시그널링 요소를 포함하는 프로브-홀더를 검사 장치에 구비하거나, 또는 상기 장치의 기존 프로브-홀더에 판독기 또는 중앙 판독기및/또는 시그널링 요소 또는 중앙 시그널링 요소를 장착하는 단계, 어떤 프로브-홀더(2)가 어떤 프로브의 카테고리를 수용하기에 적합한지 데이터 메모리에 기록하는 단계, 및 프로브가 이 프로브에 적합하지 않은 프로브-홀더(2)에 배치된 경우, 선택적으로 상기 시그널링 요소를 통해 상기 사용자에게 시그널링하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2023-7029140", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "검사 방법에 있어서, 제1항 내지 제22항 중 어느 한 항의 단계에 더하여, 제1 타겟 프로브인 상기 타겟 프로브(1)를 통해 검사 데이터를 획득하는 단계, 상기 제1 타겟 프로브에 의해 획득된 상기 검사 데이터에 기초하여 추가 검사 데이터를 획득하기 위한 추천을상기 장치의 프로세서를 통해 결정하는 단계, 추가 검사 데이터를 획득하기에 적합한 적어도 하나의 제2 타겟 프로브를 식별하고 제2 프로브가 배치된 프로브-홀더(2)에서 상기 사용자에게 시그널링하는 단계공개특허 10-2023-0145090-8-를 포함하는, 방법."}
{"patent_id": "10-2023-7029140", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제1항 내지 제23항 중 어느 한 항에 있어서,추가 검사 데이터 획득을 위한 추천은, 지능형 학습 알고리즘에 의해 결정되고, 상기 지능형 학습 알고리즘은, 상기 제1 타겟 프로브에 의해 획득된 상기 검사 데이터를 입력 데이터로 사용하고, 가능한 제2 타겟 프로브의식별 및/또는 상기 제2 타겟 프로브를 포함하는 상기 프로브-홀더(2)의 ID를 출력 데이터로서 결정하는, 방법."}
{"patent_id": "10-2023-7029140", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 검사 장치와 연동하여 복수의 프로브로부터 타겟 프로브를 식별하는 시스템에 관한 것으로서, 시스 템은: 타겟 프로브와 연관되도록 구성된 식별 요소, 검사 장치와 연결되고 타겟 프로브를 지지하도록 구성된 적어도 하나의 프로브-홀더, 프로브-홀더와 연결되고 타겟 프로브의 식별 요소와 통신하도록 구성된 판독기 , 및 판독기와 통신하도록 구성되고 판독기와 타겟 프로브 식별 요소 사이의 통신에 따라 시스템의 사용자를 향한 신호를 방출하도록 구성된 시그널링 요소를 포함한다."}
{"patent_id": "10-2023-7029140", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 검사 장치(examination device)와 연동하는(collaborating) 복수의 프로브(probe)로부터 타겟 프로 브(target probe)를 식별하기 위한 시스템 및 방법에 관한 것이다. 이러한 검사 장치(examination device)는 의료 기기(medical device), 예를 들어 초음파 이미징 장치(ultrasound wave imaging device)일 수 있다. 구체 적으로, 복수의 프로브는 초음파 이미징 장치와 연결 또는 연관된 초음파 프로브일 수 있다."}
{"patent_id": "10-2023-7029140", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "초음파 이미징 장치와 같은, 검사 장치는 일반적으로 검사할 매질의 이미지를 제공하도록 의도된 이미징 장치이 다. 의료 적용의 경우, 이 매질은 신체, 예를 들어 환자의 신체 일부(가슴, 간, 복부 등)이다. 프로브는 매질을 관찰하고 이미지를 생성하는 데 사용된다. 프로브는 검사 데이터(예를 들어, 수신된 웨이브 데 이터 또는 이미징 데이터)를 전송하기 위해 유선 또는 무선 연결(wireless connection)을 통해 검사 장치에 연 결된다. 장치는 검사 데이터를 처리하기 위한 프로세서(processor), 예를 들어 이를 사용자에게 표시하기 위한 프로세서를 포함한다. 프로브와 검사 장치는 검사 플랫폼(examination platform)을 형성할 수 있다. 이는 검사 플랫폼이 검사 장치(examination device)와 하나 이상의 프로브를 포함할 수 있음을 의미한다. 초음파 이미징의 경우, 초음파 프로브는 관찰 중인 매질의 외부 표면에 대고 배치된다. 다른 경우, 프로브는 예 를 들어 절차 중에 관찰된 매질 가까이 또는 내부에 배치될 수 있다. 프로브를 사용하지 않을 때는 일반적으로 장치의 프로브-홀더(probe-holder)에 배치된다. 이 장치는 일반적으로 서로 다른 응용 분야를 위해 복수의 동일하거나 서로 다른 프로브가 구비되어 있다. 따라 서, 복수의 프로브-홀더가 제공된다. 그러나, 프로브-홀더는 유형에 상관없이 프로브을 지지할 수 있도록 통일 된 모양을 가지고 있는 경우가 많다. 결과적으로, 프로브-홀더에 프로브를 보관하기 위해 사전 설정된 순서가 없는 경우가 많다. 이러한 검사(이미징) 플랫폼은 생성된 이미지를 보다 쉽게 분석할 수 있도록 암실에서 자주 사용된다. 이러한 이유로, 장치 사용자는 원하는 장비를 찾는 데 어려움을 겪을 수 있다. 예를 들어, 사용자가 필요로 하는 프로브(예를 들어, 타겟 프로브)를 찾기에는 너무 어두울 수 있다. 이 상황에 서, 프로브 즉 프로브-홀더를 배치할 수 있는 공간을 찾는 것도 어려울 수 있다. 예를 들어, 연결을 확인하기 위해 장치와 프로브 케이블 사이의 커넥터(connector)를 찾기 어려울 수도 있다. 그러나, 정상적인 조명 조건(normal lighting condition)에서도 동일한 문제가 발생할 수 있다. 일반적으로 특히 환자의 건강과 검사 비용을 최적화하기 위해 시간을 낭비하지 않고 검사를 효율적으로 수행하 는 것이 바람직하다.지지대(support)에 의해 고정된 프로브의 움직임(movement)을 검출하는 것으로 알려져 있다. 예를 들어, 특허 출원 EP3175794A1은, 프로브를 유지하기 위해 사용되는 지지대(support); 지지대 주변의 물리적 변화를 검출하 는 물체 센서(object sensor); 지지대 주변의 전자파를 검출하는 전자파 센서(electromagnetic wave sensor); 및 상기 물체 센서 및 전자파 센서로부터의 검출값에 기초하여 지지대에 고정된 프로브의 포트명(port name)을 결정하는 제어기(controller)를 포함하는, 초음파 진단 장치(ultrasound diagnostic device)를 설명한다. 이 장치는 복잡한 센서 시스템으로 구성되어 있으며 예를 들어 움직이지 않거나 장치에 의해 활성화되지 않는 것과 같이 수동 상태로 남아 있는 프로브를 검출할 수 없다."}
{"patent_id": "10-2023-7029140", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 목적은 간단하고 신뢰할 수 있는 방식으로 검사 장치와 연동하는 복수의 프로브 중 타겟 프로브를 식 별하는 것이다. 본 발명은 잠재적인 사용자에게 타겟 프로브를 시그널링하는 것을 가능하게 한다. 특히, 본 발 명의 목적은 타겟 프로브를 식별하기 위한 이러한 기능을 검사 플랫폼(검사 장치 및 적어도 하나의 프로브로 구 성됨)에 쉽게 구비할 수 있도록 하는 시스템을 제공하는 것이다. 또한, 개시된 시스템의 목적은, 특히 다양한 프로브-홀더 중 하나에 배치된 타겟 프로브를 식별 및/또는 찾아내고 사용자에게 알리는 것이다. 이를 위해 본 발명에서는 검사 장치와 연동하여 복수의 프로브 중 타겟 프로브를 식별하는 시스템을 제안하며, 상기 시스템은, 상기 타겟 프로브와 결합되도록 구성된 식별 요소(identification element) 및 상기 검사 장치와 결합되어 상기 타겟 프로브를 지지하도록 구성된 적어도 하나의 프로브-홀더(probe-holder), 프로브-홀더와 연결되고 타겟 프로브의 식별 요소와 통신하도록 구성된 판독기(reader), 및 판독기와 통신하도록 구성되고 판독기와 타겟 프로브의 식별 요소 사이의 통신에 기초하여 시스템의 사용자에게 신호를 방출하도록 구성된 시그널링 요소(signalling element)를 포함한다. 이를 바탕으로, 기존 검사 플랫폼에 타겟 프로브 식별이 가능한 시스템을 탑재할 수 있다. 예를 들어, 기존 프 로브에 식별 요소를 구비하면 충분하므로, 다양한 프로브-홀더 중 하나에서 타겟 프로브로 찾을 수 있다. 판독기는 타겟 프로브의 위치, 예를 들어 프로브-홀더가 배치된 위치를 결정하도록 구성될 수 있다. 보다 일반 적으로, 시스템은 타겟 프로브를 찾도록 구성될 수 있다. 식별 요소는 타겟 프로브를 식별하는 정보를 판독기에 보내도록 구성될 수 있다. 시그널링 요소는 식별 정보의 함수로서 신호를 방출하도록 구성될 수 있다. 그 결과, 신호는 타겟 프로브의 식별 및/또는 식별된 타겟 프로브의 위치를 나타내는 정보를 포함할 수 있다. 타겟 프로브와 검사 장치는 검사 플랫폼을 형성할 수 있다. 이는 검사 플랫폼이 검사 장치 및 타겟 프로브를 포 함하는 하나 이상의 프로브를 포함할 수 있음을 의미한다. 시스템의 사용자는 타겟 프로브 및/또는 검사 장치 및/또는 플랫폼의 사용자일 수도 있다. 판독기는 검사 장치의 프로세서와 통신하도록 구성될 수 있다. 시그널링 요소는 또한 프로세서에 의해 수신된 제어 신호의 함수로서 신호를 방출할 수 있다. 예를 들어, 이 제어 신호는 시스템에 의해 식별될 타겟 프로브에 대한 요청(request)을 포함할 수 있다. 따라서, 제어 신호는 타겟 프로브의 식별 및/또는 강조(highlighting)에 대한 요청을 포함할 수 있다. 판독기가 타겟 프로브의 식별 요소와 통신하는 경우 시그널링 요소는 해당 프로브의 존재를 나타내는 신호를 방 출할 수 있다. 이 존재 정보는 타겟 프로브의 위치 및/또는 상태도 포함될 수 있다. 시스템은 또한 각각 프로브와 연관되도록 구성된 복수의 식별 요소를 포함할 수 있다. 시스템은 또한 복수의 프로브-홀더를 포함할 수 있다. 각 프로브-홀더는 판독기 및/또는 시그널링 요소를 포함할 수 있다. 대안적으로, 프로브-홀더는 중앙 집중식 판 독기(centralised reader) 및/또는 중앙 집중식 시그널링 요소(centralised signalling element)를 포함할 수 있다. 검사 장치에는, 예를 들어 프로세서 및/또는 스크린(screen)이 구비될 수 있다. 프로세서는 하나 이상의 프로브 에 연결될 수 있다. 일 측면에 따르면, 중앙 장치(central device)는 프로브-홀더(들) 및/또는 판독기(들)를 구비할 수 있다. 일 실 시예에서, 각각의 프로브-홀더는 전용 판독기를 포함한다. 이 경우, 본 발명의 이점으로부터 이익을 얻기 위해 중앙 장치에 이들 프로브-홀더를 구비하는 것으로 충분하다. 대안적으로, 판독기 및/또는 프로브-홀더는 장치에서 멀리 떨어져 포지션될 수도 있고, 판독기가 프로브-홀더에 서 멀리 떨어져 있거나 외부에 포지션될 수도 있다. 프로브-홀더가 판독 범위 내에 있도록 판독기가 포지션되는 것이 바람직할 수 있다. 시그널링 요소는 적어도 하나의 광원( light source)(예를 들어 하나 이상의 (O)LED) 및/또는 음원(sound source)(예를 들어 스피커)을 포함할 수 있다. 시스템이 복수의 프로브-홀더를 포함하는 경우, 각각의 프로브-홀더는 적어도 하나의 광원 형태의 시그널링 요 소를 포함한다. 그 결과, 예를 들어 타겟 프로브를 지지하는 프로브-홀더의 광원을 켜서, 타겟 프로브의 위치를 사용자에게 쉽 게 알릴 수 있다. 시그널링 요소에 의해 방출되는 신호는 디스플레이 시스템에 대한 정보를 제공하고/하거나 확성기(loudspeake r)를 통해 소리를 방출하도록 구성된 전자 신호(electronic signal)를 포함할 수 있다. 시그널링 요소는 스크린, 태블릿 및/또는 사운드 장치와 같은 외부 장치에 신호를 전송하기 위한 적어도 하나의 인터페이스(interface)를 포함할 수 있다. 시그널링 요소에 의해 방출된 신호는 사용자에게 직접 경고하도록 구성될 수 있거나, 외부 전자 장치에 의해 처 리되고 전자 신호의 형태를 취하도록 구성될 수 있다. 또한, 이 외부 전자 요소(external electronic element) 는 전자 신호에 기초하여 사용자를 위한 신호를 생성하도록 구성될 수 있다. 프로브-홀더는 판독기 및/또는 시그널링 요소를 포함할 수 있다. 이 유형의 프로브-홀더는 \"지능형 프로브-홀더\"로 간주될 수 있다. 결과적으로, 기존 장치에 하나 이상의 지능형 프로브-홀더를 구비하는 것으로 충분한다. 프로브-홀더는 프로브를 수용하도록 구성된 리셉터클(receptacle) 및/또는 프로브-홀더 및/또는 리셉터클을 조 명하도록 구성된 적어도 하나의 광원을 포함할 수 있다. 이 광원은 시그널링 요소(signalling element)의 구현 이다. 각 프로브-홀더에 이러한 광원이 구비될 수 있다는 이점이 있다. 이 경우, 타겟 프로브의 위치를 표시하 기 위해 이러한 광원을 사용할 수 있다. 프로브-홀더는 프로브-홀더의 하측에 위치하고 및/또는 프로브-홀더 아래에 조명(lighting)을 제공하도록 구성 된 적어도 하나의 추가 광원(additional light source)을 포함할 수 있다. 이 추가 광원은 사용자에게 추가 정보를 알리도록 구성될 수 있다. 또한 프로브-홀더 아래 영역(예를 들어, 프로브를 장치에 연결하는 인터페이스)을 비추도록 구성할 수도 있다. 예를 들어, 프로브는 유선 또는 무선으로 검사 장치와 연결되도록 구성될 수 있다. 식별 요청에 표시된 타겟 프로브가 프로브-홀더에 있지만 검사 장치에 연결되지 않은 경우, 추가 광원이 켜질 수 있다. 따라서, 추가 광원은 사용자에게 프로브가 연결되지 않았음을 시그널링 할 수 있고 및/또는 프로브를 보다 쉽게 연결하는 데 사용될 수 있다. 판독기와 프로브의 식별 요소 사이의 통신은 무선일 수 있다. 예를 들어, 통신은 다음 기술 중 적어도 하나를 포함할 수 있다: 알에프아이디(RFID®), 엔에프씨(NFC®), 비엘이(BLE®), 와이파이(Wifi®) 또는 광통신. 특히, 판독기는 알에프아이디(RFID) 판독기일 수 있고 식별 요소는 수동형 알에프아이디(RFID) 태그일 수 있다. 이 경우, 다른 대안과 마찬가지로 식별 요소(identification element)는 배터리와 같은 자체 전원이 없는 수동 요소(passive element)일 수 있다. 한편, 식별 요소는 판독기에 의해 전송된 신호에 의해 전력을 공급받을 수 있다. 또한, 판독기와 프로브의 식별 요소 사이의 통신은, 프로브에서 장치로 검사 데이터를 전송하는 데 사용되는 검 사 장치와 프로브 사이의 인터페이스 이외의 인터페이스에 의해 수행될 수 있다. 따라서, 시스템은 프로브-홀더 (따라서, 예를 들어 검사 장치)와 프로브 사이에 추가 연결을 제공할 수 있다. 이러한 개념은, 프로브에서 장치 로 검사 데이터를 전송하기 위해 사용되는 기존의 연결 및/또는 인터페이스 및/또는 통신을 변경하지 않고도, 본 발명에 따른 시스템을 종래의 검사 장치에 쉽게 구비할 수 있다는 장점이 있다. 프로브-홀더(즉, 적어도 하나의 프로브-홀더 또는 각 프로브-홀더)는 판독기의 전자기 보호를 위해 구성된 보호 요소(protective element)를 포함할 수 있다. 특히, 보호 요소는 리셉터클 외부에서 발생하는 전자기 효과로부 터 판독기를 보호하도록 구성될 수 있다. 따라서, 보호 요소(protective element)는, 판독기가, 리셉터클 외부 및/또는 다른 프로브-홀더 또는 프로브-홀더 외부에 포지션되는, 프로브로부터 식별 요소를 판독하는 것(즉, 식 별 요소로부터 전자파를 수신하는 것)을 방지하도록 구성될 수 있다. 보호 요소는 적어도 하나의 전자기 절연벽(electromagnetic insulation wall)일 수 있고/있거나 이를 포함할 수 있다. 절연벽(insulation wall)은, 예를 들어 금속 재료(또는 전자파를 차단할 수 있는 다른 재료)로 만들어질 수 있다. 따라서, 절연벽은 프로브-홀더에 배치된 금속 접힘 또는 레이어일 수 있다. 전자기 절연벽은 프로브-홀더의 쉘(shell)의 적어도 하나의 측면에 배치될 수 있다. 전자기 절연벽은 쉘의 외부 및/또는 내부에 배치될 수 있거나 쉘의 일부 또는 벽을 형성할 수 있다. 그 결과, 복수의 프로브-홀더가 서로 인접하게 배치된 경우, 각각의 프로브-홀더는 한쪽(오직)에만 절연벽을 가 지면 충분할 수 있다. 따라서 두 개의 인접한 프로브-홀더의 판독기를 분리하도록 절연벽을 배치할 수 있다. 그 결과, 이 두 판독기 중 어느 것도 다른 프로브-홀더에 배치된 프로브에서 식별 요소를 우발적으로 판독할 수 없 다. 전자기 절연벽이 리셉터클의 표면에 배치되는 것도 가능하다. 그 결과, 절연벽은 리셉터클 내측의 적어도 하나(또는 단 하나)의 측벽에 배치될 수 있다. 대안적으로, 절연벽 은 리셉터클의 전체 표면에 걸쳐 배치될 수 있다. 후자의 경우, 절연벽은 판독기가 리셉터클에 배치된 프로브의 식별 요소를 판독할 수 있도록 판독기가 배치되는 개구부(opening)를 포함할 수 있다. 대안적으로, 절연벽은 판 독기가 리셉터클에 배치된 프로브의 식별 요소를 판독할 수 있도록 판독기를 둘러쌀 수 있다. 또한, 본 발명은 전술한 시스템을 포함하는 타겟 프로브를 찾기 위한 시스템을 제안하고, 여기서 판독기는 타겟 프로브를 찾도록 구성된다. 예를 들어, 판독기는 타겟 프로브의 위치를 찾기 위해 복수의 판독기 유닛(reader unit)을 포함할 수 있다. 본 발명은, 또한 작동 연결(operating connection)(예를 들어, 프로브와 프로브-홀더 사이의 데이터 교환 채 널)을 통해 프로브로부터 수신된 검사 데이터를 처리하도록 구성된 프로세서를 포함하는, 복수의 프로브와 연동 하도록 구성된 검사 장치, 및 위에서 제시된 시스템에 관한 것이다. 검사 장치는 위에서 설명한 대로 적어도 하 나의 프로브-홀더가 구비될 수 있다. 작동 연결은 유선 또는 무선 연결, 예를 들어 하나 이상의 유선 또는 예를 들어 WIFI® 유형의 무선 연결을 포 함할 수 있다. 판독기는 작동 연결과 다른 연결을 통해 식별 요소와 통신하도록 구성될 수 있다. 특히, 작동 연결이 유선 연결의 형태일 수 있다면, 다른 연결은 무선 연결, 예를 들어 알에프아이디(RFID) 연결 일 수 있다. 또 다른 연결을 사용하면 타겟 프로브에서 판독기(따라서 검사 장치의 목적지)로 식별 및/또는 기타 정보를 시 그널링 할 수 있으며, 프로브가 작동 연결을 통해 검사 장치에 연결되지 않았거나 이 작동 연결이 올바르게 작 동하지 않는 경우에도 마찬가지이다. 본 발명은 또한 상기 제시된 장치 및 식별 요소가 구비된 적어도 하나의 프로브를 포함하는 검사 플랫폼 (examination platform)에 관한 것이다.본 발명은, 또한 다음 단계를 포함하는 검사 장치와 연동하는 복수의 프로브 중 타겟 프로브를 식별하는 방법에 관한 것이다: 타겟 프로브를 지지하기 위한 프로브-홀더와 연관된 판독기가 타겟 프로브와 연관된 식별 요소와 통신하는 통신 단계, 및 판독기와 식별 요소 사이의 통신의 기능으로서 시그널링 요소가 (예를 들어 프로브 및/또는 검사 장치로부터) 사용자에게 신호를 방출하는 시그널링 단계. 신호는 다음 신호 유형 중 적어도 하나를 포함하여 타겟 프로브의 상태를 사용자에게 나타내도록 적응될 수 있 다: 타겟 프로브가 장치의 복수의 프로브-홀더 중 어느 프로브-홀더에 배치되었는지를 나타내는 신호 유형, 프로브가 소정의 검사 또는 검사의 주어진 상태(pahse)에 적합함을 나타내는 신호 유형, 타겟 프로브가 유지 보수 중임을 나타내는 신호 유형, 프로브가 고장난 것을 나타내는 신호 유형, 타겟 프로브가 프로브-홀더에 잘못 삽입되었음을 나타내는 신호 유형, 타겟 프로브가 검사 장치에 연결되어 있지 않음을 나타내는 신호 유형, 및 타겟 프로브가 테스트 모드에 있음을 나타내는 신호 유형이다. 사용자에 대한 이러한 유형의 신호는, 예를 들어 다른 색상 및/또는 깜박임 모드의 조명을 사용하여 다를 수 있 으므로, 사용자는 타겟 프로브의 현재 상태를 더 쉽게 인식할 수 있다. 대안적으로, 적어도 일부 유형은 유사할 수 있다. 소정의 검사에서 타겟 프로브를 사용하기 전에, 시그널링 요소는 타겟 프로브가 제1 시그널링 레벨(first signalling level)에 배치된 프로브-홀더를 나타내는 제1 신호 유형(first signal type)을 방출할 수 있다. 사용 중 및/또는 사용 종료 시 시그널링 요소는 사용 후 타겟 프로브를 수용하는 데 적합한 프로브-홀더(들)를 나타내는 제2 신호 유형()을 방출할 수 있다. 예를 들어 다른 색상 및/또는 깜박임 모드의 조명을 사용하여, 제1 및 제2 시그널링 레벨(second signalling level)이 다를 수 있다. 다른 예에서, 제1 레벨은 예를 들어 타겟 프로브를 더 빠르고 쉽게 찾는 것을 가능하게 하는 더 강한 광을 사용함으로써, 사용자의 주의를 끌도록 할 수 있다. 제1 신호 유형은 또한 검사 장치의 스크 린 상의 디스플레이 및/또는 음성 정보를 포함할 수 있다. 제2 레벨은, 예를 들어 덜 밝은 광을 사용하거나 더 어두운 색상을 사용하여, 사용자가 검사하는 동안 광에 의해 방해받지 않도록 사용자의 주의를 덜 끌도록 할 수 있다. 대안적으로, 두 레벨이 비슷할 수 있다. 이 방법은 또한 다음 단계를 포함할 수 있다: 각 프로브에 식별 요소를 구비하는(equipping) 단계, 각각 판독기 및/또는 시그널링 요소를 포함하거나 각각 중앙 판독기(central reader) 및/또는 중앙 시그널링 요 소(central signalling element)를 포함하는 프로브-홀더를 검사 장치에 구비하는 단계 및/또는 장치의 기존 프 로브-홀더에 판독기 또는 중앙 판독기 및/또는 시그널링 요소 또는 중앙 시그널링 요소를 구비하는 단계, 어떤 프로브-홀더가 어떤 프로브의 카테고리를 수용하기에 적합한지 데이터 메모리에 기록하는 단계 (recording), 및 선택적으로 프로브가 이 프로브에 적합하지 않은 프로브-홀더에 배치된 경우 시그널링 요소를 통해 사용자에게 시그널링하는 단계. 따라서 시스템 메모리 또는 원격 위치 메모리는 프로브 ID(probe identification)를 기록할 수 있으므로 타겟 프로브를 찾기 위한 정확한 식별 요청을 설정할 수 있다. 또한, 메모리는 호환 가능한 프로브-홀더 및 프로브 유형의 매핑(mapping)을 포함할 수 있다. 매핑 또는 다른 장치가 프로브-홀더에 있는 프로브의 현재 위치를 기록하는 것도 가능하다. 그러나, 이 매핑은 의무적이지 않은데, 본 발명이 각 프로브(타겟)를 언제든지 찾을 수 있게 해주기 때문이다. 따라서 메모리에 현재 위치를 업데 이트하는 것은 필요하지 않지만 여전히 가능하다. 또한, 본 발명은 프로브가 활성화되지 않고 및/또는 작동 연결에 의해 검사 장치에 연결되지 않더라도 프로브가 이 프로브에 적합하지 않은 프로브-홀더에 놓일 때 사용자에게 시그널링 하는 것을 가능하게 한다. 본 발명은 또한 검사 방법과 관련되는데, 이 방법은, 위에서 설명한 단계 외에도, 제1 타겟 프로브인 타겟 프로브를 통해 검사 데이터를 획득하는(acquiring) 단계, 제1 타겟 프로브에 의해 획득된 검사 데이터에 기초하여 추가 검사 데이터를 획득하기 위한 추천 (recommendation)을 장치의 프로세서를 통해 결정하는(determining) 단계, 추가 검사 데이터를 획득하기에 적합한 적어도 하나의 제2 타겟 프로브를 식별하는(identifying) 단계 및 제2 프로브가 배치된 프로브-홀더를 사용자에게 시그널링 하는 단계를 포함한다. 따라서 본 발명은, 예를 들어 검사의 정확성을 개선하거나 아직 다루지 않은 검사 부분을 처리하기 위해(예를 들어 촬영된 장기의 변화), (제1) 타겟 프로브가 획득한 데이터가 검사에 충분한지 또는 추가적인 검사 데이터 가 유용한지를 자동으로 판단하는 알고리즘을 사용할 수 있다. 이 경우, 알고리즘은 추가적인 검사 데이터 획득 에 적합한 제2 타겟 프로브도 결정할 수 있다. 마지막으로, 알고리즘은 이 제2 타겟 프로브의 현재 위치를 사용자에게 시그널링 하기 위해 본 발명에 따른 시 스템을 사용할 수 있다. 이 알고리즘은 인공 지능 알고리즘(artificial intelligence algorithm), 예를 들어 지능형 학습 알고리즘 (intelligent learning algorithm) 및/또는 적어도 하나의 신경망을 포함하거나 기반으로 할 수 있다. 추가 검사 데이터 획득을 위한 추천을 결정하기 위해 지능형 학습 알고리즘을 사용할 수 있다. 이 지능형 학습 알고리즘은 검사 정보를 입력 데이터로 사용할 수 있고 출력 데이터로서 가능한 제2 타겟 프로브의 식별 및/또 는 제2 타겟 프로브를 포함하는 프로브-홀더의 ID(identification)를 결정할 수 있다. 예를 들어 이 알고리즘은 두 부분을 포함할 수 있다: 제1 부분(first part)은, 검사 데이터의 적어도 하나의 품질 파라미터(예를 들어, 제1 타겟 프로브에 의해 획득 된 검사 데이터의 회귀에 의해) 및/또는 검사의 완전성 파라미터(예를 들어, 동일한 검사 중에 두 개의 다른 장 기를 영상화하기 위해 두 개의 탐침이 필요한 경우)를 추정하는, 예를 들어 적어도 하나의 컨벌루션 신경망 (convolutional neural network)을 포함할 수 있고, 및 제2 부분은, 제2 타겟 프로브를 식별하고 선택적으로 제2 타겟 프로브를 포함하는 프로브-홀더를 식별하기 위해, (적어도 하나의) 검사 데이터 품질 파라미터에 기초하여 프로브를 분류하도록 구성된 신경망을 포함할 수 있다. 본 개시내용의 특징 및 장점은 비제한적 예로서만 주어지고 첨부된 도면을 참조하여 이루어진 다음의 설명으로 부터 명백해질 것이다. 특히, 도면에 예시된 예들은 조합될 수 있다."}
{"patent_id": "10-2023-7029140", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "예시로서 제공되는 다양한 도면에서, 동일한 참조 번호는 동일하거나 유사한 요소를 나타낸다. 도 1은 본 개시내용의 일 실시예에 따른 타겟 프로브를 식별하기 위한 시스템의 개략도이다. 시스템은 타겟 프로브(도 1에 도시되지 않음)와 연관되도록 구성된 식별 요소(identification element)를 포함한다. 또한, 시스템은 검사 장치(도 1에 도시되지 않음)와 연결되고 타겟 프로브를 지지하도록 구성된 적어도 하나의 프로브-홀더(probe-holder)를 포함한다. 프로브는 사용하지 않을 때 프로브-홀더에 부착, 보관, 배치 또는 수용할 수 있다. 한편, 예를 들어 검사 중 또는 프로브의 테스트/치료를 위해 사용되는 경우 프로브-홀더에서 제거될 수 있다. 프로브-홀더는 주로 고정 요소(stationary element) 및/또는 프로브를 이동 요소(mobile element)로 간주할 수 있다. 따라서 프로브는 프로브-홀더를 기준으로 이동할 수 있다(도면의 연속 화살표 참조). 또한, 이 시스템은 프로브-홀더와 연결된 판독기(reader)를 포함하고 타겟 프로브(target probe)의 식 별 요소와 통신하도록 구성된다(점선 플래시 참조). 또한, 시스템(system)은 판독기와 통신하도록 구성 되고 판독기와 타겟 프로브의 식별 요소(identification element) 사이의 통신의 기능으로서 시스템의 사 용자에게 신호를 방출하도록 구성된 시그널링 요소(signalling element)를 포함한다. 프로브-홀더는 판독기 및/또는 시그널링 요소를 포함할 수 있다. 이러한 유형의 프로브-홀더는 도 3a- 3c 및 4a-4e를 참조하여 자세히 설명된 \"지능형 프로브-홀더(intelligent probe-holder)\"로 간주될 수 있다. 대안적으로, 판독기 및/또는 시그널링 요소는 프로브-홀더 외부의 요소일 수 있다. 예를 들어, 판독기 는, 프로브-홀더에 위치된 프로브 또는 다른 프로브-홀더에 위치된 복수의 프로브의 식별 요소를 판독할 수 있 도록, 프로브-홀더 근처에만 위치될 수 있다. 시그널링 요소는 또한 유선 또는 무선으로 판독기에 연결될 수 있다. 시그널링 요소는 또한 판독기의 일부일 수 있다. 보다 일반적으로, 본 개시의 시스템은 기존의 검사 플랫폼(즉, 검사 장치 및 하나 이상의 프로브를 포함하는 종 래의 플랫폼)에 본 개시에 따른 타겟 프로브를 식별하는 기능을 구비하는 것을 가능하게 한다. 종래의 프로브에 식별 요소를 구비하고 검사 장치에 판독기 및/또는 식별 요소를 포함하거나 그와 연관된 프로브-홀더 를 구비하는 것으로 충분하다. 또한 시스템에 복수의 식별 요소(예를 들어 프로브당 하나) 및 복수의 프로브-홀더(예를 들어 프로브 당 하나 또는 미리 정의된 수)를 제공하는 것도 가능하다. 이 경우, 검사 장치의 각 프로브가 식별될 수 있으므 로 프로브-홀더 중 하나에 위치될 수 있다. 프로브-홀더 중 하나에서 타겟 프로브를 찾도록 판독기를 구성할 수 있다. 예를 들어, 각 프로브-홀더는 자 체 판독기를 구비할 수 있다. 이 경우 타겟 프로브를 판독하고 식별할 수 있는 판독기는 프로브-홀더에서도 프 로브를 찾을 수 있다. 하나의 변형에서, 복수의 프로브-홀더를 포함하는 영역에서 타겟 프로브를 찾을 수 있는 판독기 시스템(reader system)이 제공될 수 있다.판독기는, 또한 예를 들어 유선 또는 무선 연결을 통해 검사 장치의 프로세서와 통신하도록 구성될 수 있다. 따라서 이 프로세서가 시스템에 의해 식별될 타겟 프로브에 대한 요청을 포함하는 제어 신호(control signal)를 보내는 것이 가능하다. 프로세서는 시스템(또는 판독기)에 어떤 타겟 프로브가 식별되고 및/또는 찾게되 도록 표시할 수 있다. 판독기가 타겟 프로브의 식별 요소와 통신하는 경우, 프로브-홀더 중 하나에서 찾을 수 있다. 시그널링 요소 는 상기 프로브의 존재를 나타내는 신호를 방출할 수 있다. 이 존재 정보는 타겟 프로브의 위치도 포함할 수 있다. 시그널링 요소에 의해 방출되는 신호는 광 및/또는 소리를 포함할 수 있다. 시스템이 복수의 프로브-홀더를 포함하는 경우, 각각의 프로브-홀더는 적어도 하나의 광원(light source) 형태의 시그널링 요소를 포함할 수 있다. 그 결과, 예를 들어 타겟 프로브를 지지하는 프로브-홀더의 광원을 켜서 타겟 프로브의 위치를 사용자 에게 쉽게 알릴 수 있다. 도 2a는 특히 판독기와 시그널링 요소를 포함하는, 본 발명에 따른 프로브-홀더의 제1 예의 측면도를 개략적으 로 도시한다. 특히, 도 2a는 판독기(예를 들어 알에프아이디(RFID) 안테나) 및 시그널링 요소(예를 들어 하나 이상의 LED, 특히 다색 LED)를 포함하는 \"지능형(intelligent)\" 프로브-홀더의 제1 예를 도시한다. LED 는 프로브를 포함/지지/유지하도록 구성되는 리셉터클 가까이 및/또는 그 주위에 배치된다. 리셉터클은 부 분적으로 또는 완전히 반투명하거나 심지어 투명할 수 있다. 프로브-홀더는 또한 연결(connection)을 통해 검사 장치(도 2a에 도시되지 않음)와 통신하도록 구성된 전 자 회로(electronic circuit)(예를 들어 인쇄 회로 기판 PCB)를 포함할 수 있다. 전자 회로는 또한 시그널링 요소(4, 401) 및/또는 판독기를 제어하고 전력을 공급하도록 구성될 수 있다. 예를 들어, 검사 장 치의 프로세서는 타겟 프로브를 찾기 위해 회로를 통해 판독기에 명령(command)(즉, 식별 요청)을 보낼 수 있다. 판독기는 신호를 사용자에게 전송하기 위해 회로를 통해 시그널링 요소(4 및/또는 401)에 명령을 보낼 수 있다. 따라서 지능형 프로브-홀더는 리셉터클에 배치된 프로브를 식별하고 필요한 경우 이 프로브에 대한 정보를 사용 자에게 시각적으로 알리도록 구성될 수 있다. 이를 달성하기 위해, 프로브-홀더는, 예를 들어 알에프아이디 (RFID) 기술을 사용할 수 있다. 안테나가 구비된 알에프아이디(RFID) 판독기(옵션으로 알에프아이디(RFID) 판독기를 사용하여 태그를 업데이트할 수 있음)를 내부 몸체(internal volume)에 포함할 수 있고 리셉터 클의 몸체 또는 주변에 위치된 알에프아이디(RFID) 픽업할 수 있도록 한다. 보다 구체적으로, 선택된 알에프아 이디(RFID) 기술은 근거리 통신(Near-Field Communication)(NFC) 기술일 수 있다. NFC 태그는 수동적 또는 능동적으로 작동할 수 있다. 수동 작동(passive operation)은 특히 연결성 및 무게 감소 측면에서 사용하기 쉽 다는 장점이 있다(초음파 프로브의 인체 공학에 매우 중요한 이점). 가장 개발된 버전에서, 광원은 프로브를 연결하거나 연결 해제해야 할 때 커넥터를 더 잘 볼 수 있도록 프 로브 커넥터를 향하는 프로브-홀더 아래에서 찾게되도록 제공될 수 있다. 예를 들어, 이 광원은 광 공해를 일으 키지 않도록 검사 중에(즉, 프로브가 활성화되고 사용 중일 때) 활성화되지 않는다. 하나의 변형에서, 커넥터의 광원을 수동 또는 자동으로 조정할 수 있다. 도 2a의 예에서 발광하거나 조명을 받을 수 있는 것은 리셉터클 자체이다. 실제로, 반투명 리셉터클 (translucent receptacle)을 만듦으로써 내부에 LED를 통합함으로써 전체적으로(또는 부분적으로) 역광 이 될 수 있다. 리셉터클의 반투명 재료는, 예를 들어 ABS와 같은 단단한 플라스틱이거나 실리콘과 같은 더 유 연한 재료일 수 있다. 이 변형은 또한 형광 및 반투명 재료와 결합된 블랙 라이트(black light)(UV) LED를 사용 하여 만들어질 수 있으며, 유리하게는 사용자에게 낮은 눈부심 조명(low-glare lighting)을 제공한다. 거동(behaviour)은 사용자가 사용자 정의할 수 있다(예를 들어, LED 색상 선택, 플래시 지속 시간 선택, 지속/ 불연속 조명 유형, LED 강도 등). 사전 정의된 조명 효과는 사용자가 선택할 수도 있다. 예를 들어, 사용자는 여러 개의 프로브-홀더를 차례로 켜거나 꺼서 이동하는 조명 효과를 선택하여 경로의 착시 효과를 줄 수 있다. 도 2b는 특히 검사 장치와 통신하기 위한 무선 연결이 구비된, 본 발명에 따른 프로브-홀더의 제2 예의 측면도 를 개략적으로 도시한다. 넓은 의미에서, 도 2b의 예는 도 2a의 제1 예에 대응한다. 그러나, 도 2b에서 프로브- 홀더는 자율적으로 사용할 수 있도록 자체 전원을 가질 수 있다. 예를 들어, 하나 이상의 배터리 (batteries)를 포함할 수 있다.또한, 전자 회로는 검사 장치와 통신하기 위한 무선 인터페이스(예를 들어, 블루투스 또는 유사한 기술을 사용 하는 안테나)를 포함할 수 있다. 따라서, 프로브-홀더는 사용을 위해 검사 장치(examination device)나 다른 고 정 요소(stationary element) 또는 가상 고정 요소(virtually stationary element)(검사 장치가 프로브(들)에 서 멀리 떨어져 있는 경우)에 기계적으로 연결되기만 하면 된다. 또한, 도 2b는, 리셉터클 아래, 특히 리셉터클 주위 및 아래에 위치된 LED를 갖는, LED의 포지셔닝 (positioning)의 다른 예를 도시한다. 하나의 변형에서, LED(들)는 리셉터클 위에 위치될 수 있다. 따라서 이러한 LED의 광은 사용자에게 표시된다. 다른 변형에서, 하나 이상의 LED가 프로브-홀더의 플라스틱 쉘에 배치될 수 있다. 본 발명의 개발된 버전에서, 시각 정보는, 예를 들어 색상이 변할 수 있는 LED 백라이트(LED backlighting)(소형 백열 전구와 같이 관련성이 덜한 다른 기술도 가능함)이다. 도 2c는 본 발명에 따른 프로브-홀더의 예, 특히 제1 또는 제2 예의 사시도를 개략적으로 도시한다. 이 예는 리 셉터클 부근에 있는 판독기의 포지셔닝 도시하고, 판독기는 프로브-홀더 내부에 있어 이 보기에서는 보이지 않는다. 따라서 판독기는 리셉터클에 위치된 프로브, 특히 프로브의 식별 요소에 가까이 있을 수 있 다. 이를 통해 판독기와 식별 요소 간의 안정적인 통신이 가능하다. 도 2d는 특히 프로브-홀더 쉘의 측면(205, 206) 상에 본 발명에 따른 보호 요소(protective element)의 제1 예를 갖는 프로브-홀더의 예의 사시도를 개략적으로 도시한다. 따라서 일반적으로, 프로브-홀더는 판독기의 전자기 보호를 위해 구성된 보호 요소를 포함할 수 있다. 특히, 보호 요소는 리셉터클 외부에서 발생하는 전자기적 영향으로부터 판독기를 보호하도록 구성될 수 있다. 그 결과, 보호 요소는 판독기가 리셉터클 외부 및/또는 다른 프로브-홀더 또는 프로브-홀더 외부에 포지션된 프 로브의 식별 요소를 판독하는 것을 방지하도록 구성될 수 있다. 이는 판독기가 이 식별 요소로부터 전자파를 수 신하는 것을 방지하도록 보호 요소가 구성될 수 있음을 의미한다. 보호 요소는 적어도 하나의 전자기 절연벽(electromagnetic insulation wall)일 수 있고/있거나 이를 포함할 수 있다. 절연벽(즉, 보호 요소)은 예를 들어 금속 재료(또는 전자파를 차단할 수 있는 다른 재료)로 만들어질 수 있다. 따라서, 절연벽은 프로브-홀더에 배치된 금속 접힘(metal fold) 또는 레이어(layer)일 수 있다. 보호 요소를 생산하는 재료 및 방법의 다른 예는: · 특히 프로브-홀더의 모양에 맞게 조정된, 알루미늄 접힘(fold of aluminium)(또는 전자기파를 차단할 수 있 는 다른 재료로 만들어짐)을 포함한다. 접힘(fold)은 스크리닝 패브릭(screening fabric); · 전자기파를 차단할 수 있는 재료로 만들어진 그리드(grid), 특히 식별 요소에 의해 방출되는 전자기파의 파 장에 적합한 그리드 크기를 가진 그리드; · 금속 레이어(metallic layer)를 갖는 프로브-홀더의 코팅 부분(coating part)(예를 들어, 쉘 또는 플라스틱 재료로 만들어진 부분)이라고도 할 수 있다. 전자기 절연벽은 프로브-홀더의 쉘의 적어도 하나의 측면(205 및/또는 206)에 배치될 수 있다. 전자기 절연벽은 쉘 외부 및/또는 내부에 배치될 수 있거나 쉘의 일부 또는 벽을 형성할 수 있다. 결과적으로, 서로 인접하게 배치된 복수의 프로브-홀더의 경우(예를 들어 도 4a, 4b 참조), 각각의 프로브-홀더 가 한 면(205 또는 206)에만 절연벽을 갖는 것으로 충분할 수 있다. 그러나, 인접한 프로브-홀더의 각 쌍은 절 연벽으로 분리될 수 있다. 그 결과, 이 두 판독기 중 어느 것도 다른 프로브-홀더에 배치된 프로브에서 식별 요 소를 우발적으로 판독할 수 없다. 도 2e는 본 개시내용에 따른 보호 요소의 제1 예의 변형을 갖는 프로브-홀더의 예의 사시도를 개략적으로 도 시한다. 전자기 절연벽(electromagnetic insulation wall)에 더하여, 보호 요소는 프로브-홀더의 전면 (front side)에 추가 전자기 절연벽을 포함할 수 있다. 추가 전자기 절연벽은, 또한 (제1) 절연 벽의 연장부, 즉 동일한 벽일 수 있다. 추가 전자기 절연벽은, 또한 프로브-홀더의 한 면 또는 두 면 (205, 206)에 배치될 수 있다. 따라서 판독기의 전자파 보호는 특히 프로브-홀더의 측면보다 전면에서 발생하는 바람직하지 않은 전자파 와 관련하여 개선될 수 있다. 도 2f는 본 발명에 따른 보호 요소의 제2 예, 특히 프로브-홀더의 쉘의 사시도를 개략적으로 도시한 다. 그 결과, 완전한 쉘(complete shell)은 예를 들어 레이어 형태의 전자기 절연벽(electromagneticinsulation wall)을 포함할 수 있다. 쉘이 전자기 절연 재료로 만들어지는 것도 가능하다. 도 2g는 특히 프로브-홀더의 리셉터클에서 본 발명에 따른 보호 요소의 제3 예를 갖는 프로브-홀 더의 예의 사시도를 개략적으로 도시한다. 따라서 전자기 절연벽은 리셉터클의 표면에 배치될 수 있 다. 그 결과, 절연벽은 리셉터클의 내측의 적어도 하나(또는 단 하나)의 측벽(201a, 201b)에 배치될 수 있다. 대안적으로, 절연벽은 리셉터클의 전체 표면에 걸쳐 배치될 수 있다. 후자의 경우에, 절연벽은 판독기 가 리셉터클에 배치된 프로브의 식별 요소를 판독할 수 있도록 판독기가 배치되는 개구부를 포함할 수 있다. 대안적으로, 절연벽은 판독기가 리셉터클(벽의 연장부(extension) 참조)에 배치된 프로브의 식별 요소를 판독할 수 있도록 판독기를 둘러쌀 수 있다. 도 2h는 본 개시내용에 따른 보호 요소의 제3 예의 변형을 갖는 프로브-홀더의 예의 개략적인 사시도를 도시한 다. 리셉터클은 예를 들어 고무 또는 다른 가요성 재료로 만들어진 추가 레이어를 절연벽의 상부에 포함할 수 있다. 상기 레이어는 프로브-홀더의 리셉터클에 배치된 프로브와 접촉하도록 구성될 수 있다. 따라서 레이어는 프로브가 긁히는 것을 방지하고/하거나 프로브가 프로브-홀더에 안정적으로 고정되도록 구성될 수 있다. 도 2i는, 예를 들어 프로브-홀더의 리셉터클의 외부 표면(201c, 201d) 상에 본 발명에 따른 보호 요소 의 제4 예를 갖는 프로브-홀더의 예의 사시도를 개략적으로 도시한다. 결과적으로, 전자기 절연벽은, 예를 들어 외부 쉘의 내부 표면(도 2i에 도시되지 않음) 또는 리셉터클을 제공하는 내부 쉘(2a)의 외부 표 면 또는 두 표면 사이의 임의의 위치의, 프로브-홀더 내부에 배치될 수 있다. 또한, 전자기 절연벽은 하나 또는 두 개의 변(201c, 201d)에 배치될 수 있다. 도 3은 본 발명에 따른 식별 요소, 특히 알에프아이디(RFID) 태그가 구비된 프로브의 예를 개략적으로 도 시한다. 프로브는 종래의 프로브, 예를 들어 종래 기술로부터 알려진 프로브일 수 있다. 이 경우 프로브에는 식별 요소, 예를 들어 프로브 쉘의 내부 또는 외부 표면에 배치된 스티커 형태의 NFC 태그가 구비될 수 있다. 따라서 기존 프로브는 식별 요소(예를 들어, 수동 알에프아이디(RFID) 태그)의 부착 또는 통합에 의해서만 수정 될 수 있다. 따라서 각 프로브에는 이 프로브를 고유하게 식별할 수 있는 자체 식별 요소가 구비될 수 있다. 각 식별 요소는, 예를 들어 프로브의 일련 번호(프로브 ID라고 함) 및/또는 해당 프로브 유형 및 다음과 같은 컨텍스트 정보(contextual information)를 식별할 수 있다: 프로브가 속한 병원 및/또는 프로브가 연결된 검사 장치의 ID(identification). 이상적으로 이러한 태그는 수동 적일 수 있으며, 작동하는 데 자체 에너지가 필요하지 않다(\"판독\" 시 알에프아이디(RFID)/NFC 3 판독기에 의해 유도되는 에너지는 제외). 하나의 변형에서, 식별 요소는 재기록 가능한 NFC 칩을 포함할 수 있으므로 필요한 경우 정보를 재작성할 수 있 다(예를 들어, 재조정 후 설정 변경, 수행된 마지막 테스트 및 그 결과, 코딩된 사용 이력). 정보는 재작성 모 듈(rewriting module)(판독기 3과 혼동됨)에서 방출되는 자기장을 사용하여 무선으로 재작성될 수 있다. 이 재 작성(rewriting)은, 또한 예를 들어 온도 센서, 충격 센서 또는 프로브에 통합하는 데 유용할 수 있는 다른 센 서와 같은 프로브의 내부 센서에서 데이터 쓰기를 가능하게 할 수 있다. 프로브-홀더의 판독기(예를 들어, NFC 안테나)는 프로브가 리셉터클에 배치될 때 프로브의 식별 요소(NFC 태 그)를 검출할 수 있다. 예를 들어 LED와 같은 시각 정보 장치에 소프트웨어를 통해 명령을 보내는 장치로 정보 가 재전송된다. 정보는 소리 신호(프로브가 어느 프로브-홀더에 있는지를 나타내는 위치 소리(location sound) 또는 녹음된 음성 또는 합성 음성) 또는 스크린(screen)에 표시되는 시각적 신호와 같은 다른 방식으로 강조 표 시될 수 있다. 일부 변형에서, 프로브에서 프로브-홀더까지의 통신 기술은, 예를 들어 블루투스(Bluetooth), 비엘이(BLE), 와 이파이(Wifi) 또는 심지어 광 통신과 같이 알에프아이디(RFID)와 다를 수 있다(이 특정 경우, 프로브-홀더의 통 신 안테나는 프로브 쉘의 외부 표면에 포지션된 바코드 또는 QR 코드를 판독할 수 있는 광학 판독기로 대체되며프로브가 리셉터클에 포지션될 때 코드를 판독한다). 도 4a 내지 도 4e는 본 개시내용에 따른 검사 장치의 상이한 예의 개략적인 평면도를 도시한다. 각각의 예 에서, 검사 장치(examination device)는 중앙 장치(central device)(예를 들어 검사 데이터를 처리 하기 위한 프로세서를 포함함) 및 주로 사용자 인터페이스로 사용되는 부분(part)을 포함할 수 있다(즉, 예를 들어 하나 이상의 스크린, 예를 들어 촉각(tactile) 또는 비촉각 스크린(non-tactile screens), 및 키패드 또는 기타 제어 요소를 포함하는 제어 패널). 이 부분은 또한 장치의 사용자를 위해 프로브-홀더에 저장된 프로브의 접근성을 용이하게 하는 하나 이상의 프로브-홀더를 포함할 수 있다. 따라서 장치는 본 발명에 따른 복수의 프로브-홀더를 포함할 수 있다. 이러한 프로브-홀더는, 예를 들어 장 치의 기존 프로브-홀더를 교체하여 기존 검사 장치에 추가될 수 있다. 선택적으로, 음성 명령을 사용할 수 있도록 검사 장치에 마이크를 구비할 수 있다. 이 마이크는, 예를 들어 USB 포트에 연결된 기존 검사 장치에 추가 모듈로 추가할 수 있다. 도 4a에 도시된 제1 예에서 검사 장치는 본 개시 내용에 따른 복수의 프로브-홀더를 포함한다. 프로브- 홀더(특히 각 프로브-홀더)는 검사 장치에 대한 전원 및 통신 채널을 가질 수 있다. 일례에 따른 작동 모 드에서, 통신 및 전원 공급은 장치(device)의 제어 패널(control panel)에 연결된 USB 케이블 을 통해 제공된다. USB 멀티소켓(USB multisocket)은 제어 패널 아래에 포지션되고 고정될 수 있으며, 예를 들어 프로브-홀더를 연결하기 위한 6개 내지 8개의 암 USB 포트가 있다. USB 멀티소켓은 검사 장치의 USB 포트에 연결될 수 있고 따라서 예를 들어 장치의 프로세서에 연결될 수 있다. 도 4b에 예시된 예에 따른 연결의 한 변형에 따르면, 1개 또는 2개의 포트가 구비된 단일 USB 멀티소켓(504')이 프로브-홀더를 연결하는데 적합하고, 후자는 착탈식 케이블을 통해 이에 병치된 프로브-홀더에 연결 가능 하다. 도 4c 및 4d에 표시된 변형에서 프로브-홀더는 병합되어 여러 모듈 2' 및 2\"를 형성할 수 있다. 예를 들어, 3중 프로브-홀더(2')는 3개의 단일 프로브-홀더의 융합일 수 있으므로, 이 예시적인 예에서는 제어 패널의 동일 한 측면에 포지션된 3개의 리셉터클을 포함한다(도 4c 참조). 또 다른 예에서, 다중 프로브-홀더\"는 리셉터 클이 제어 패널의 양쪽에 포지션된 6개의 단일 프로브-홀더의 융합이다(도 4d 참조). 도 4e에 도시된 변형에서, 프로브-홀더(2\"')와 검사 장치 사이의 통신은 무선 연결, 예를 들어 블루투스 연결을 통해 달성될 수 있다. 따라서 예를 들어 전원과 함께 적합한 안테나를 프로브-홀더\"'에 설치할 수 있다. 따 라서, 프로브-홀더는 예를 들어 셀 또는 배터리로 전원을 공급받을 수 있다. 따라서, 프로브-홀더는 완전히 무 선이며 기존 검사 장치에 설치할 때 설치가 더 쉽다. 도 5는 본 발명에 따른 방법의 예, 특히 타겟 프로브의 식별 및 사용자에게 신호를 개략적으로 도시한다. 단계 \"a\"에서 사용자는 검사 장치 D로 검사 절차를 시작하거나 준비한다. 예를 들어, 사용자는 타겟 프로브(S) 를 선택하고 활성화할 수 있다(예를 들어 검사 장치 D의 사용자 인터페이스에서). 대안적으로, 검사 장치의 프 로세서는 사용자의 제스처/명령/액션 및/또는 절차의 진행 상황에 기초하여 (예를 들어 미리 정의된 알고리즘 및/또는 인공 지능을 사용하는 알고리즘에 따라) 타겟 프로브(S)를 자동으로 선택할 수 있다. 단계 \"b\"에서 검사 장치(D)는 식별 및/또는 찾아낼 타겟 프로브(S)에 관한 요청을 판독기 및/또는 프로브-홀 더로 보낸다. 이 요청은 타겟 프로브(S)의 ID를 포함하는 메시지일 수 있다. 각각 판독기가 구비된 프로브- 홀더가 여러 개인 경우 검사 장치(D)는 각 판독기에도 요청을 보낼 수 있다. 단계 \"c\"에서 판독기(들)(또는 판독기(들)을 포함하는 프로브-홀더(들))는 타겟 프로브(S)를 포함하는 프로브들의 식별 요소(들)와 통신한다. 예를 들어, 판독기(들)는 그들의 ID(identification)를 요청하는 각각의 프로브에 신호를 보낼 수 있다. 응답으로, 프로브는 그들의 ID를 전송한다. 그런 다음 판독기(들)는 이 러한 응답에 기초하여 검사 장치 D로부터의 요청을 수신된 식별과 비교함으로써 어떤 프로브가 타겟 프로브에 대응하는지 결정할 수 있다. 단계 \"c\"에서 판독기(들)(또는 판독기(들)를 포함하는 프로브-홀더(들))는 타겟 프로브(S)를 포함하는 프로브들의 식별 요소(들)와의 통신 결과를 시그널링 요소에 통지한다. 하나의 예에서, 각각의 프로브-홀 더가 판독기를 포함하는 경우, 타겟 프로브를 지원하는 프로브-홀더의 판독기는 타겟 프로브의 위치를 시그널링 요소와 통신할 수 있다(그리고 예를 들어 다른 판독기는 따라서 시그널링 요소와의 통신을 피할 수 있다). 이에 응답하여, 단계 \"e\"에서, 시그널링 요소는 단계 \"c\"의 통신의 결과인 타겟 프로브로부터 사용자 정보를 방출 및/또는 시그널링할 수 있다(예를 들어, 타겟 프로브의 위치 또는 아래에 설명된 기타 타겟 프로브 상태 정보). 예를 들어, 시그널링 요소가 각 프로브-홀더에 적어도 하나의 광원을 포함하는 경우, 타겟 프로브를 지지하는 프로브-홀더의 광원이 활성화될 수 있다. 각 프로브-홀더가 자체 판독기 및 자체 시그널링 요소(예를 들어 하나 이상의 (O)LED)를 포함하는 시 나리오에서, 각 프로브-홀더는 단계 \"c\"에서 \"e\"를 자율적으로 방식으로 수행할 수 있다. 각 프로브-홀더 가 단계 c를 수행하고, 프로브-홀더와 통신한 이 프로브-홀더만이 단계 \"d\" 및 \"e\"를 수행하는 것도 가능 하다. 마지막으로, 단계 \"f\"에서 사용자(U)는, 시그널링 요소에 의해 수신된 정보의 함수로서 타겟 프로브(S)로 작 업을 수행할 수 있다. 일 예에 따른 경우, 사용자에게, 단계 \"e\"에서 현재 타겟 프로브(S)를 지원하는 프로브- 홀더를 알릴 수 있다. 따라서 사용자는 이 프로브를 사용할 수 있다(예를 들어, 이 프로브에 대한 검사, 치료 또는 테스트 수행). 또 다른 예에서, 예를 들어 사전 정의된 색상으로 깜박이는 광원을 통해, 타겟 프로브가 프 로브-홀더에 올바르게 배치/부착/삽입/연결되지 않은 프로브임을 사용자에게 알릴 수 있다. 이에 대한 응답으로, 사용자는 단계 \"f\"에서 올바르게 연결/부착/배치/삽입할 수 있다. 그러나, 단계 \"e\"에서 사용자에게 전송되는 정보는 검사 장치의 판단에 기반할 수도 있다. 예를 들어, 장치는 타겟 프로브가 중앙 장치에 올바르게 연결되지 않았는지 확인할 수 있다. 이 경우 사용자는 타겟 프로브의 위치 와 상태(예를 들어, 연결 상태)를 알 수 있다. 그러나, 본 발명은 타겟 프로브로 검사를 수행하기 위해 타겟 프로브를 식별 및/또는 위치를 찾는 방법에 제한 되지 않는다. 본 발명은 또한 하기 실시예에 따른 다른 방법(또는 사용 모드)을 포함할 수 있다. 다음에서, 프로브-홀더에 포지션된 활성화된 타겟 프로브을 찾기 위한 한 예에 따른 사용 모드가 제시된다. 프로브-홀더는, 예를 들어 어두운 방에서 타겟 프로브를 쉽게 찾을 수 있도록 파란색 백라이트(backlight)로 조 명된다. 프로브-홀더는 사용자가 리셉터클에서 프로브를 제거하면 꺼진다. 검사에 유용할 수 있는 다른 프로브 (예를 들어, 유방)는 프로브-홀더에 의해 감소된 강도로 일시적으로 조명된다. 색상은 검사 기능(예: 분홍색의 \"유방\" 또는 노란색의 \"간\") 및/또는 진행 중인 검사 부분에 따라 다를 수 있다(예: 동일한 검사 내에서 다른 임상 적용). 한 예에 따른 프로브의 사용 동안 예에 따른 사용 모드: 빈 리셉터클이 있는 프로브-홀더는 검사가 끝날 때 또는 동일한 검사 중에 프로브가 변경될 때 파란색 또는 녹 색으로 약간 광나서 사용자에게 타겟 프로브에 사용할 수 있음을 나타낸다(검사 종료는 사용자 인터페이스를 통 해 또는 \"정지(freeze)\" 버튼을 클릭하거나 검사를 지원하는 인공 지능 모듈에 의해 또는 사용자 인터페이스를 통해 시그널링된 프로브를 변경하려는 사용자의 요구에 의해 트리거됨). 프로브-홀더는 수용할 수 있는 프로브 에 따라 리셉터클 크기가 다르기 때문에, 현재 사용 중인 프로브를 수용할 수 있는 빈 리셉터클만 조명된다. 프로브가 떨어질 수 있는 위험이 있는 한 예에 따른 사용 모드: 사용자가 (타겟) 프로브를 부적합한 리셉터클이 있는 프로브-홀더에 넣으면 프로브가 떨어져서 종종 파손될 위 험이 있다. 따라서 리셉터클과 호환되는 프로브가 식별되는 프로브-홀더가 깜박이기 시작하여 사용자에게 경고 한다. 이 프로브와 호환되는 다른 프로브-홀더는 변경이 이루어질 때까지 프로브를 배치할 위치를 사용자에게 시그널링 하기 위해 약간 불이 들어온다. 타겟 프로브가 연결되지 않은, 한 예에 따른 사용 모드: 사용자가 사용자 인터페이스를 통해 프로브 유형이 있는 검사 프로그램을 선택하면, 프로브-홀더는 타겟 프로브 를 찾을 수 있고 사용자에게 깜박임으로 연결되지 않았음을 경고한다. 하나의 변형에서, 프로브-홀더 아래에 조 명 시스템을 배치함으로써 초음파 스캐너 프로브 커넥터(들)가 조명되어 프로브의 연결 및 분리를 용이하게 한 다. 하나의 변형에서, 이 조명은 너무 많은 광 공해를 일으키지 않도록 검사 중에 활성화되지 않는다. 종래의 프로토콜 동안의 한 예에 따른 사용 모드: 프로토콜은 (다른 검사에 따른 특정 단계를 따라) 사용자를 안내하는 검사 소프트웨어(예를 들어, 초음파)의 검 사 프로그램이다. 프로토콜이 시작되면, 프로브-홀더는 스크린에 정보를 표시하는 것 외에도 검사의 각 단계에 서 달라질 수 있는 사용할 프로브의 위치를 표시하여 사용자 안내를 유리하게 개선한다. 사용자는 검사 속도 측 면에서 이득을 얻는다. 인공 지능에 의해 제어되는 프로토콜을 포함하는 한 예에 따른 사용 모드: 각 환자에게 가장 적합한 검사를 제공하기 위해 인공 지능이 검출한 것에 따라 활성화되는 프로토콜이다. 이러 한 프로토콜 실행의 자동화된 특성으로 인해 검사 중에 사용할 프로브를 더욱 흥미롭게 강조할 수 있다(사용자 는 생각할 필요가 없음). 예 1: 사용자는 환자를 검사하고 관심 영역(예를 들어, 병변)을 식별한다. 사용자는 관련성, 신뢰성 및 속도를 높이기 위해 검사를 통해 안내를 받을 수 있다. 인공 지능은 \"이 사례\"를 인식한다(예를 들어 \"학습(learnt)\"했 기 때문). 이를 바탕으로 사용자에게 타겟 프로브를 추천한다. 타겟 프로브를 지지하는 지능형 프로브-홀더 (들)를 조명하기 위해 본 발명을 사용한다. 예 2: 사용자는 프로브(A)로 작고 매우 표면적인 병변을 본다. 인공 지능은 표면 병변에 더 적합한 제2 타겟 프 로브로 측정할 것을 권장한다. 제2 타겟 프로브를 지지하는 프로브-홀더는 본 발명에 의해 조명된다. 프로브가 유지 관리 중이거나 검사 장치를 시작할 때 또는 각 검사 사이에 한 가지 예에 따른 사용 모드: 타겟 프로브를 확인하기 위해 빠른 테스트를 수행하면, 프로브-홀더가, 예를 들어 주황색(orange colour)으로 깜박여 테스트가 진행 중이고 프로브를 사용할 수 없음을 사용자에게 알린다. 기술자가 직접 또는 원격으로 검 사 장치를 유지 관리할 때, 프로브-홀더는 이전 경우와 다른 광(예를 들어, 주황색)을 방출할 수 있다. 유지보 수 테스트 중 하나가 프로브에서 오류를 검출하면, 해당 프로브-홀더가 빨간색으로 켜질 수 있다. 절차 중 한 예에 따른 사용 모드: 초음파 검사 중에 사용자(예를 들어, 의사)는 생검(biopsy) 또는 세침 흡인(fine needle aspiration)(FNA) 유 형 절차에 참여한다. 그들은 보조자(assistant)에게 프로브와 초음파 장치를 조작하는 것을 도와달라고 요청할 것이다. 그들은 특정 생검 모드를 사용하고 절차를 위해 적어도 한 손을 비울 수 있도록 보조자에게 장치 취급 을 맡긴다(예를 들어, 바늘 잡기). 개입에 필요한 프로브를 수용하는 프로브-홀더(생검 모드를 통해 식별/활성 화되거나 방사선 전문의의 음성 명령을 통해 또는 프로브 선택 스크린/버튼 또는 기타 인간-기계 인터페이스 시 스템을 통해 식별됨)에 불이 들어오고, 보조자는 신속하게 의사에게 전달할 수 있다. 의사는 프로브을 잡고 있 는 동시에 바늘을 채취할 조직에 넣는다. 생검이 완료되면, 의사는, 생검 건(biopsy gun) 포함된 타겟 조직의 추출을 진행하고 환자를 돌보는 동안(예를 들어 유방 생검에서), 보조자에게 프로브를 건네어 마지막으로 사용 한 프로브에 따라 불이 들어오는 프로브-홀더에 다시 넣는다(프로브 유형 및/또는 의사의 포지셔닝 선호도에 적 합한 프로브-홀더). 의사와 보조자는 검사 시간 동안 검사 시간과 집중도를 유리하게 획득하였고, 따라서 보조 자는 본 발명에 따른 시스템 또는 방법에 의해 프로브 선택에 안내를 받게되었다. 수술실(심장내과, 유방절제술, 갑상선결절제거술)의 외과의의 경우, 손이 오염되지 않도록 외과의는 프로브를 전혀 조작하지 않는 것이 좋다(수술 장비보다 낮은 멸균 수준). 따라서 보조자는 초음파 프로브를 직접 처리해 야 한다. 따라서 본 발명에 따른 프로브-홀더는 외과 의사를 개입시키지 않고 보조자를 안내함으로써 이러한 작 동 모드를 용이하게 한다. 의사는 음성 명령으로 프로브(A)의 사용을 요청하거나 특정 수술 모드를 시작한다. 관련 프로브가 활성화된다. 프로브가 들어 있는 프로브-홀더에 불이 들어오고 보조자가 신속하게 프로브를 찾아 환자에게 위치를 지정한다. 그런 다음 외과 의사는 초음파 제어하에 수술을 진행한다. 필요한 경우, 의사는 음 성 명령 또는 수술 모드 중에 프로브를 변경할 수 있으므로 프로브(A)는 비활성화되고 프로브(B)는 활성화된다. 보조자가 제거할 수 있을 때까지, 프로브(A)를 수용하기 위한 빈 프로브-홀더에 불이 들어온 다음, 프로브(B)가 들어 있는 프로브-홀더에 불이 들어온다. 프로브가 아래 설명된 대로 소독되지 않은 경우, 소독될 때까지 사용 할 수 없으며, 따라서 요청한 프로브 유형이더라도 조명이 켜지지 않는다. 초음파 스캐너 및 프로브의 준비 및 소독 단계 동안 한 예에 따른 사용 모드: 사용자(예를 들어, 기술자)가 \"청소(cleaning)\" 모드 또는 \"소독(disinfection)\" 모드를 활성화한다. 연결 해제 가 승인된 프로브(유지보수 또는 테스트 중이 아니므로)는 해당 프로브-홀더에 의해 녹색으로 켜진다. 분리하지 않을 프로브는 해당 프로브-홀더에 의해 빨간색으로 켜진다. 따라서 기술자는 특히 예를 들어 초음파 검사 장치 와 분리된 소독 장치에 배치되어야 하는 내강 내 프로브의 경우 소독을 위해 프로브을 회수하고 따로 보관할 수있다. 세척 후 프로브을 교체하기 위해, 소독 모드의 제2 단계가 활성화되고, 프로브를 올바른 위치, 즉 적합한 프로브-홀더에 배치하기 위해 프로브-홀더가 연속적으로 점등된다(잠재적으로 탐침이 시스템에 연결되면). 필요 한 경우 프로브에 따라야 할 절차를 나타내는 메시지가 스크린에 표시되어 사용자를 안내한다. 프로브가 유선 또는 무선의 하나의 변형에서, 예를 들어 인공 지능 모듈을 통해 시스템 또는 검사 장치에서 실행되는 프로토콜 은 청소된 프로브를 재배치하는 과정에서 기술자를 안내한다. 즉, 시스템 또는 검사 장치는, 대응하는 프로브- 홀더에 조명이 켜져 있는 동안, 스크린에 포지셔닝될 프로브를 표시하는 것을 의미한다. 전술한 포지셔닝은, 유 리하게는 사용자 선호도(개인화될 수 있음) 및/또는 상이한 유형의 프로브에 대한 프로브-홀더의 적응 및/또는 사용되거나 사용될 커넥터의 포지셔닝에 연결된다. 관리자 또는 사용자가 사용자 기본 설정을 지정하는 단계(등록, 개인화 또는 설정) 중 한 예에 따른 사용 모드: 이 두 사람 중 한 사람이 원하는 설정 기능을 통해 검사 장치의 개인화 주기를 시작한다. 이를 달성하기 위해, 사용자는 설정을 전체적으로 선택하거나(사용할 프로브는 왼쪽에 있는 프로브-홀더에 배치 하는 것이 바람직함, ...) 또는 프로브별로 설정을 선택하고 이 경우 시스템은 선택한 설정과 호환되는 프로브 를 기능으로 사용하거나 현재 검사 장치에 연결된 프로브의 사용을 제안하고: 그런 다음 스크린에 포지션될 프 로브가 표시되고 검사 장치에서 호환되는 프로브-홀더에 불이 들어온다. 사용자(개별 구성) 또는 관리자(집단 구성)는 이러한 호환 가능하고 비어 있는 프로브-홀더 중 하나에 프로브를 배치하고 사용자 인터페이스를 통해 선택을 확인한 다음 필요한 경우 다음 프로브로 이동할 수 있다. 설정이 완료되면, 모든 선택 사항이 예를 들어 장치를 소유한 기관의 사용자 프로필 또는 집단 프로필에 저장된다. 따라서, 주어진 사용자의 휴가가 시작될 때, 기술자 또는 사용자가 와서 상기 사용자의 선호도에 따라 프로브를 배치할 수 있다. 그러면 시스템 또는 검 사 장치의 모듈이 포지션될 프로브를 연속적으로 표시하고 해당 프로브-홀더를 조명할 수 있다. 따라서 기술자 (및/또는 사용자)는 검사 전 준비 시간을 절약하고 편안함과 재현성을 향상시킨다(조명으로 인해 준비 절차가 간소화되고 가속화됨). 따라서 검사가 더욱 신뢰할 수 있고 개선되고 최적화된다. 일반적으로, 본 발명에 따른 시스템의 사용자는 검사를 수행할 수 있는 자격이 있는 사람(예를 들어, 의사 또는 외과 의사) 또는 본 발명에 따른 시스템의 안내를 받을 수 있는 무자격자일 수 있다. 이러한 모든 실시예 및 위에서 설명한 것과 같은 다른 예는 비제한적인 예로서만 제공되며 다음 청구 범위 내에 서 결합 및/또는 수정될 수 있다."}
{"patent_id": "10-2023-7029140", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 타겟 프로브 식별 시스템의 개략도이다. 도 2a는 특히 판독기와 시그널링 요소를 포함하는, 본 발명에 따른 프로브-홀더의 제1 예의 측면도를 개략적으 로 도시한다. 도 2b는 특히 검사 장치와 통신하기 위한 무선 연결이 구비된, 본 발명에 따른 프로브-홀더의 제2 예의 측면도 를 개략적으로 도시한다. 도 2c는 본 발명에 따른 프로브-홀더의 예, 특히 제1 또는 제2 예의 사시도를 개략적으로 도시한다. 도 2d는 특히 프로브-홀더의 쉘의 측면에서 본 발명에 따른 보호 요소의 제1 예를 갖는 프로브-홀더의 예의 사 시도를 개략적으로 도시한다.도 2e는 본 발명에 따른 보호 요소의 제1 예의 변형을 갖는 프로브-홀더의 예의 사시도를 개략적으로 도시한다. 도 2f는 특히 프로브-홀더의 쉘로 구성된, 본 발명에 따른 보호 요소의 제2 예의 사시도를 개략적으로 도시한다. 도 2g는 특히 프로브-홀더의 리셉터클에서 본 발명에 따른 보호 요소의 제3 예를 갖는 프로브-홀더의 예의 사시 도를 개략적으로 도시한다. 도 2h는 본 개시내용에 따른 보호 요소의 제3 예의 변형을 갖는 프로브-홀더의 예의 개략적인 사시도를 도시한 다. 도 2i는 특히 프로브-홀더의 리셉터클의 외부 표면 상에 본 발명에 따른 보호 요소의 제4 예를 갖는 프로브-홀 더의 예의 사시도를 개략적으로 도시한다. 도 3은 본 발명에 따른 식별 요소, 특히 알에프아이디(RFID) 태그가 구비된 프로브의 예를 개략적으로 도시한다. 도 4a, 도 4b, 도 4c, 도 4d 및 도 4e는 본 발명에 따른 검사 장치의 다른 예의 개략적인 입면도를 도시한다. 도 5는 본 개시내용에 따른 방법의 예, 특히 타겟 프로브의 식별 및 사용자의 주의를 위한 시그널링의 예를 개 략적으로 도시한다."}
