{"patent_id": "10-2018-0038168", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0119219", "출원번호": "10-2018-0038168", "발명의 명칭": "대표이미지 추천 방법 및 장치, 및 시스템", "출원인": "카페24 주식회사", "발명자": "서일근"}}
{"patent_id": "10-2018-0038168", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "복수 개의 쇼핑몰과 연동하여 대표 이미지를 추천하는 방법에 있어서,상품 또는 쇼핑몰의 대표 이미지 추천과 연관하여, 상기 복수 개의 쇼핑몰로부터 상품 정보를 다운로드하는 단계;상기 상품 정보에서 대표이미지와 대표이미지로 선택되지 않은 상세이미지를 추출하는 단계;상기 추출된 상세이미지를 딥러닝(deep learning) 학습에 적합한 형태로 변환하는 단계;상기 추출된 대표이미지 및 상기 변환된 상세이미지를 기반으로 학습용 데이터 셋(data set)을 생성하는 단계;상기 학습용 데이터 셋를 이용하여 대표이미지 예측을 위한 제 1 딥러닝 모델을 학습시키는 단계; 및상기 학습된 제 1 딥러닝 모델을 이용하여 대표 이미지를 추천하는 단계를 포함하는 쇼핑몰 대표 이미지 추천방법."}
{"patent_id": "10-2018-0038168", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 상기 추출된 상세이미지를 딥러닝 학습에 적합한 형태로 변환하는 단계는, 상기 다운로드된 상세이미지를 기반으로, 이미지 종류 분류를 위한 제 2 딥러닝 모델을 활용하여 학습용 상세이미지를 생성하는 단계를 포함하는 쇼핑몰 대표 이미지 추천 방법."}
{"patent_id": "10-2018-0038168", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서, 상기 추출된 상세이미지를 딥러닝 학습에 적합한 형태로 변환하는 단계는,상기 제 2 딥러닝 모델을 활용하여 상품의 촬영과 관련된 종류별로 상기 다운로드된 상세이미지를 분류하는 단계; 및상기 분류된 상세이미지를 기반으로 상기 학습용 상세이미지를 생성하는 단계를 포함하는 쇼핑몰 대표 이미지추천 방법."}
{"patent_id": "10-2018-0038168", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서, 상기 상품의 촬영과 관련된 종류는 상품과 관련된 모델의 존재 여부, 상품의 노출 범위, 및 상품의 착용 범위중 적어도 하나를 기준으로 분류되는 쇼핑몰 대표 이미지 추천 방법."}
{"patent_id": "10-2018-0038168", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4 항에 있어서, 상기 상품의 촬영과 관련된 복수 개의 종류 중 모델이 상품을 착용한 종류에 해당하는 상세이미지를 추출하여,객체 검출 알고리즘(Object Detection Algorithm)을 사용하여 모델의 위치를 파악하고 배경을 삭제함으로써 모델 부분만을 추출하여 상기 학습용 상세이미지를 생성하는 쇼핑몰 대표 이미지 추천 방법."}
{"patent_id": "10-2018-0038168", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서, 상기 추출된 상세이미지를 딥러닝 학습에 적합한 형태로 변환하는 단계는, 상기 추출된 대표 이미지의 개수와 학습용 상세이미지의 개수가 유사하도록 비율을 고려하여 상기 학습용 상세이미지를 생성하는 단계를 포함하는 쇼핑몰 대표 이미지 추천 방법."}
{"patent_id": "10-2018-0038168", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2019-0119219-2-제 1 항에 있어서, 상기 추출된 상세이미지를 딥러닝 학습에 적합한 형태로 변환하는 단계는, 학습용 상세이미지 외에, 상기 제 1 딥러닝 모델의 하이퍼 파라미터(hyper parameter)를 세부 조정하고 테스트하기 위한 검증 데이터 및 최종 학습된 제 1 딥러닝 모델의 성능 평가를 위한 테스트용 데이터를 함께 생성하는단계를 포함하는 쇼핑몰 대표 이미지 추천 방법."}
{"patent_id": "10-2018-0038168", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1 항에 있어서, 상기 학습용 데이터 셋을 이용하여 대표이미지 예측을 위한 제 1 딥러닝 모델을 학습시키는단계는,학습용 대표이미지 및 학습용 상세이미지를 기반으로, 학습과 관련된 복수 개의 하이퍼 파라미터(hyperparameter)를 변경하면서 검증 데이터의 정확도가 높아지도록 상기 제 1 딥러닝 모델을 반복학습시키는 단계를포함하는 쇼핑몰 대표 이미지 추천 방법."}
{"patent_id": "10-2018-0038168", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서,상기 학습용 데이터 셋를 이용하여 대표이미지 예측을 위한 제 1 딥러닝 모델을 학습시키는 단계는,반복학습 도중 가장 높은 정확도로 학습된 모델을 확보하는 단계를 포함하는 쇼핑몰 대표 이미지 추천 방법."}
{"patent_id": "10-2018-0038168", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 1 항에 있어서, 상기 학습된 제 1 딥러닝 모델을 이용하여 대표 이미지를 추천하는 단계는,제 2 쇼핑몰로부터 대표이미지 추천을 위한 복수 개의 상품이미지를 다운로드하는 단계;상기 다운로드된 복수 개의 상품이미지를 상기 학습된 제 1 딥러닝 모델에 입력하기 적합한 포맷으로 변환하는단계;상기 변환된 복수 개의 상품이미지를 상기 제 1 딥러닝 모델에 입력하여 상기 복수 개의 상품이미지 각각의 대표이미지 점수를 측정하는 단계;상기 측정된 대표이미지 점수를 기반으로 대표이미지를 추천하는 단계를 포함하는 쇼핑몰 대표 이미지 추천 방법."}
{"patent_id": "10-2018-0038168", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 10 항에 있어서, 상기 다운로드된 복수 개의 상품이미지를 상기 학습된 제 1 딥러닝 모델에 입력하기 적합한포맷으로 변환하는 단계는, 상기 다운로드된 복수 개의 상품이미지 중에서 모델이 상품을 착용한 상품이미지를 추출하는 단계; 및 상기 추출된 상품이미지에서 배경을 제외하고 모델 주변부분만 추출하는 단계를 포함하는 쇼핑몰 대표 이미지추천 방법."}
{"patent_id": "10-2018-0038168", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "복수 개의 쇼핑몰과 연동하여 대표 이미지를 추천하는 장치에 있어서,상품 또는 쇼핑몰의 대표 이미지 추천과 연관하여, 상기 복수 개의 쇼핑몰 중 하나인 제 1 쇼핑몰로부터 상품정보를 다운로드하는 상품정보 다운로드부;상기 상품 정보에서 대표이미지와 대표이미지로 선택되지 않은 상세이미지를 추출하는 이미지 추출부;상기 추출된 상세이미지를 딥러닝(deep learning) 학습에 적합한 형태로 변환하는 이미지 변환부;상기 추출된 대표이미지 및 상기 변환된 상세이미지를 기반으로 학습용 데이터 셋(data set)을 생성하는 학습데이터 생성부;상기 학습용 데이터 셋를 이용하여 대표이미지 예측을 위한 제 1 딥러닝 모델을 학습시키는 모델 학습부; 및공개특허 10-2019-0119219-3-상기 학습된 제 1 딥러닝 모델을 이용하여 대표 이미지를 추천하는 이미지 추천부를 포함하는 쇼핑몰 대표 이미지 추천 장치."}
{"patent_id": "10-2018-0038168", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "복수 개의 쇼핑몰과 연동하여 대표 이미지를 추천하는 방법에 있어서,상품 또는 쇼핑몰의 대표 이미지 추천과 연관하여, 제 1 쇼핑몰로부터 대표이미지 추천을 위한 복수 개의 상품이미지를 수신하는 단계;상기 수신된 복수 개의 상품이미지를 대표이미지 예측을 위한 제 1 딥러닝(deep learning) 모델에 입력하기 적합한 포맷으로 변환하는 단계;상기 변환된 복수 개의 상품이미지를 상기 제 1 딥러닝 모델에 입력하여 상기 복수 개의 상품이미지의 대표이미지 점수를 측정하는 단계; 및상기 측정된 대표이미지 점수를 기반으로 대표이미지를 추천하는 단계를 포함하는 쇼핑몰 대표 이미지 추천 방법."}
{"patent_id": "10-2018-0038168", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13 항에 있어서,상기 수신된 복수 개의 상품이미지를 상기 학습된 제 1 딥러닝 모델에 입력하기 적합한 포맷으로 변환하는 단계는, 상기 수신된 복수 개의 상품이미지 중에서 모델이 상품을 착용한 상품이미지를 추출하는 단계; 및 상기 추출된 상품이미지에서 배경을 제외하고 모델 주변부분만 추출하는 단계를 포함하는 쇼핑몰 대표 이미지추천 방법."}
{"patent_id": "10-2018-0038168", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "복수 개의 쇼핑몰과 연동하여 대표 이미지를 추천하는 장치에 있어서,상품 또는 쇼핑몰의 대표 이미지 추천과 연관하여, 제 1 쇼핑몰로부터 대표이미지 추천을 위한 복수 개의 상품이미지를 수신하는 상품이미지 수신부;상기 수신된 복수 개의 상품이미지를 대표이미지 예측을 위한 제 1 딥러닝(deep learning) 모델에 입력하기 적합한 포맷으로 변환하는 이미지 변환부;상기 변환된 복수 개의 상품이미지를 상기 제 1 딥러닝 모델에 입력하여 상기 복수 개의 상품이미지의 대표이미지 점수를 측정하는 점수 측정부; 및상기 측정된 대표이미지 점수를 기반으로 대표이미지를 추천하는 대표이미지 추천부를 포함하는 쇼핑몰 대표 이미지 추천 장치."}
{"patent_id": "10-2018-0038168", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "복수 개의 쇼핑몰과 연동하여 대표 이미지를 추천하는 시스템에 있어서,상품 또는 쇼핑몰의 대표 이미지 추천 요청 - 상기 대표이미지 추천 요청은 상품정보를 포함함 - 을 상기 복수개의 쇼핑몰 중 하나인 제 1 쇼핑몰의 관리자 단말로부터 수신하여 인공지능 서버로 전달하고, 상기 인공지능서버로부터, 상기 대표이미지 추천 요청에 포함된 상품정보 내의 각 상품이미지의 대표이미지 예측점수를 수신하여 대표이미지 후보를 선택하며, 상기 선택된 대표이미지 후보를 상기 제 1 쇼핑몰의 관리자 단말로 반환하는대표이미지 예측 API 서버; 및상기 대표이미지 예측 API 서버로부터 상기 대표이미지 추천 요청을 수신하고, 상기 대표이미지 추천 요청에 포함된 상품정보 내의 상품이미지를 대표이미지 추천을 위한 제 1 딥러닝(deep learning) 모델에 입력한 후, 상기제 1 딥러닝 모델을 실행하여 각 상품이미지별로 대표이미지 예측점수를 측정하여 상기 대표이미지 예측 API 서버로 제공하는 인공지능 모델을 포함하는 대표이미지 추천 시스템.공개특허 10-2019-0119219-4-청구항 17 제 16 항에 있어서,상기 상품정보에 포함된 대표이미지 및 대표이미지가 아닌 상세이미지를 기반으로 상기 제 1 딥러닝 모델을 학습시키고, 최종 학습된 제 1 딥러닝 모델을 상기 인공지능 서버로 제공하는 인공지능 모델 학습 장치를 더 포함하는 대표이미지 추천 시스템."}
{"patent_id": "10-2018-0038168", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 16 항에 있어서,상기 복수 개의 쇼핑몰로부터 상품 정보를 수신하여 상기 상품 정보에서 대표이미지와 대표이미지로 선택되지않은 상세이미지를 추출하여 다운로드하고, 상기 다운로드된 상세이미지를 기반으로 학습용 상세이미지를 생성하는 학습용 데이터 가공 장치를 더 포함하는 대표이미지 추천 시스템."}
{"patent_id": "10-2018-0038168", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 양태는 복수 개의 쇼핑몰과 연동하여 대표 이미지를 추천하는 방법을 개시하고 있다. 상기 방법은, 상품 또는 쇼핑몰의 대표 이미지 추천과 연관하여, 상기 복수 개의 쇼핑몰로부터 상품 정보를 다운로드하는 단계, 상기 상품 정보에서 대표이미지와 대표이미지로 선택되지 않은 상세이미지를 추출하는 단계, 상기 추출된 상세이미지를 딥러닝(deep learning) 학습에 적합한 형태로 변환하는 단계, 상기 추출된 대표이미지 및 상기 변 환된 상세이미지를 기반으로 학습용 데이터 셋(data set)을 생성하는 단계, 상기 학습용 데이터 셋를 이용하여 대표이미지 예측을 위한 제 1 딥러닝 모델을 학습시키는 단계 및 상기 학습된 제 1 딥러닝 모델을 이용하여 대표 이미지를 추천하는 단계를 포함한다."}
{"patent_id": "10-2018-0038168", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 이미지 추천 방법에 관한 것으로, 보다 상세하게는, 여러 이미지들 중에서 대표 이미지를 추천하는 방법 및 시스템에 관한 것이다."}
{"patent_id": "10-2018-0038168", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인터넷 쇼핑몰에서 상품을 등록하기 위해서는 상당히 많은 프로세스(process)를 거쳐야 한다. 상품사진을 촬영 후 업로드하고 상세화면을 디자인하고 제목과 상품 소개 및 정보 등을 입력해야 하며 상품 리스트에 출력될 상 품의 대표 이미지를 선택해야 하는 등의 복잡한 과정을 거친다. 하지만, 상품의 대표 이미지를 추천하는 시스템을 일반적인 전문가 시스템으로 접근해 개발하는 것은 너무나 난 이도가 높고, 거의 불가능에 가까운 일이라고 할 수 있다. 대표 이미지로 추천할 이미지들의 공통적인 특징을 사람이 직접 파악해서 그 공통적인 특징들을 픽셀 단위로 프로그래밍 해야 하는데 공통적인 특징을 모두 뽑아낸 다는 것 자체도 불가능에 가깝고, 설령 가능하다고 해도 전혀 다른 스타일의 추가적인 이미지가 나올 때마다 매 번 기존 이미지들과의 공통적인 특징을 다시 뽑아내서 기존 코딩 규칙에 위배되지 않게 코딩을 한다는 것 역시 불가능에 가까운 일이라고 할 수 있기 때문이다."}
{"patent_id": "10-2018-0038168", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상술한 문제점을 해결하기 위한 본 발명의 일 양태에 따른 목적은 상기와 같이 쇼핑몰에 상품을 등록하고 대표 디자인을 선택하기까지의 많은 작업들을 최대한 자동화하여 상품의 대표 이미지를 자동으로 추천해주는 대표이 미지 추천 방법, 장치 및 시스템을 제공하는 것이다."}
{"patent_id": "10-2018-0038168", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 목적을 달성하기 위한 본 발명의 일 양태에 따른 복수 개의 쇼핑몰과 연동하여 대표 이미지를 추천하는 방법은, 상품 또는 쇼핑몰의 대표 이미지 추천과 연관하여, 상기 복수 개의 쇼핑몰로부터 상품 정보를 다운로드 하는 단계, 상기 상품 정보에서 대표이미지와 대표이미지로 선택되지 않은 상세이미지를 추출하는 단계, 상기 추출된 상세이미지를 딥러닝(deep learning) 학습에 적합한 형태로 변환하는 단계, 상기 추출된 대표이미지 및 상기 변환된 상세이미지를 기반으로 학습용 데이터 셋(data set)을 생성하는 단계, 상기 학습용 데이터 셋를 이 용하여 대표이미지 예측을 위한 제 1 딥러닝 모델을 학습시키는 단계 및 상기 학습된 제 1 딥러닝 모델을 이용 하여 대표 이미지를 추천하는 단계를 포함할 수 있다. 상기 추출된 상세이미지를 딥러닝 학습에 적합한 형태로 변환하는 단계는, 상기 다운로드된 상세이미지를 기반 으로, 이미지 종류 분류를 위한 제 2 딥러닝 모델을 활용하여 학습용 상세이미지를 생성하는 단계를 포함할 수있다. 상기 추출된 상세이미지를 딥러닝 학습에 적합한 형태로 변환하는 단계는, 상기 제 2 딥러닝 모델을 활용하여 상품의 촬영과 관련된 종류별로 상기 다운로드된 상세이미지를 분류하는 단계 및 상기 분류된 상세이미지를 기 반으로 상기 학습용 상세이미지를 생성하는 단계를 포함할 수 있다. 상기 상품의 촬영과 관련된 종류는 상품과 관련된 모델의 존재 여부, 상품의 노출 범위, 및 상품의 착용 범위 중 적어도 하나를 기준으로 분류될 수 있다. 상기 상품의 촬영과 관련된 복수 개의 종류 중 모델이 상품을 착용한 종류에 해당하는 상세이미지를 추출하여, 객체 검출 알고리즘(Object Detection Algorithm)을 사용하여 모델의 위치를 파악하고 배경을 삭제함으로써 모 델 부분만을 추출하여 상기 학습용 상세이미지를 생성할 수 있다. 상기 추출된 상세이미지를 딥러닝 학습에 적합한 형태로 변환하는 단계는 상기 추출된 대표 이미지의 개수와 학 습용 상세이미지의 개수가 유사하도록 비율을 고려하여 상기 학습용 상세이미지를 생성하는 단계를 포함할 수 있다. 상기 추출된 상세이미지를 딥러닝 학습에 적합한 형태로 변환하는 단계는 학습용 상세이미지 외에, 상기 제 1 딥러닝 모델의 하이퍼 파라미터(hyper parameter)를 세부 조정하고 테스트하기 위한 검증 데이터 및 최종 학습 된 제 1 딥러닝 모델의 성능 평가를 위한 테스트용 데이터를 함께 생성하는 단계를 포함할 수 있다. 상기 학습용 데이터 셋를 이용하여 대표이미지 예측을 위한 제 1 딥러닝 모델을 학습시키는 단계는, 학습용 대 표이미지 및 학습용 상세이미지를 기반으로, 학습과 관련된 복수 개의 하이퍼 파라미터(hyper parameter)를 변 경하면서 검증 데이터의 정확도가 높아지도록 상기 제 1 딥러닝 모델을 반복학습시키는 단계를 포함할 수 있다. 상기 학습용 데이터 셋를 이용하여 대표이미지 예측을 위한 제 1 딥러닝 모델을 학습시키는 단계는, 반복학습 도중 가장 높은 정확도로 학습된 모델을 확보하는 단계를 포함할 수 있다. 상기 학습된 제 1 딥러닝 모델을 이용하여 대표 이미지를 추천하는 단계는, 제 2 쇼핑몰로부터 대표이미지 추천 을 위한 복수 개의 상품이미지를 다운로드하는 단계, 상기 다운로드된 복수 개의 상품이미지를 상기 학습된 제 1 딥러닝 모델에 입력하기 적합한 포맷으로 변환하는 단계, 상기 변환된 복수 개의 상품이미지를 상기 제 1 딥 러닝 모델에 입력하여 상기 복수 개의 상품이미지 각각의 대표이미지 점수를 측정하는 단계 및 상기 측정된 대 표이미지 점수를 기반으로 대표이미지를 추천하는 단계를 포함할 수 있다. 상기 다운로드된 복수 개의 상품이미지를 상기 학습된 제 1 딥러닝 모델에 입력하기 적합한 포맷으로 변환하는 단계는, 상기 다운로드된 복수 개의 상품이미지 중에서 모델이 상품을 착용한 상품이미지를 추출하는 단계 및 상기 추출된 상품이미지에서 배경을 제외하고 모델 주변부분만 추출하는 단계를 포함할 수 있다. 상기한 목적을 달성하기 위한 본 발명의 일 양태에 따른 복수 개의 쇼핑몰과 연동하여 대표 이미지를 추천하는 장치는 상품 또는 쇼핑몰의 대표 이미지 추천과 연관하여, 상기 복수 개의 쇼핑몰 중 하나인 제 1 쇼핑몰로부터 상품 정보를 다운로드하는 상품정보 다운로드부, 상기 상품 정보에서 대표이미지와 대표이미지로 선택되지 않은 상세이미지를 추출하는 이미지 추출부, 상기 추출된 상세이미지를 딥러닝(deep learning) 학습에 적합한 형태로 변환하는 이미지 변환부, 상기 추출된 대표이미지 및 상기 변환된 상세이미지를 기반으로 학습용 데이터 셋 (data set)을 생성하는 학습데이터 생성부, 상기 학습용 데이터 셋를 이용하여 대표이미지 예측을 위한 제 1 딥 러닝 모델을 학습시키는 모델 학습부 및 상기 학습된 제 1 딥러닝 모델을 이용하여 대표 이미지를 추천하는 이 미지 추천부를 포함할 수 있다. 상기한 목적을 달성하기 위한 본 발명의 다른 양태에 따른 복수 개의 쇼핑몰과 연동하여 대표 이미지를 추천하 는 방법은 상품 또는 쇼핑몰의 대표 이미지 추천과 연관하여, 제 1 쇼핑몰로부터 대표이미지 추천을 위한 복수 개의 상품이미지를 수신하는 단계, 상기 수신된 복수 개의 상품이미지를 대표이미지 예측을 위한 제 1 딥러닝 (deep learning) 모델에 입력하기 적합한 포맷으로 변환하는 단계, 상기 변환된 복수 개의 상품이미지를 상기 제 1 딥러닝 모델에 입력하여 상기 복수 개의 상품이미지의 대표이미지 점수를 측정하는 단계 및 상기 측정된 대표이미지 점수를 기반으로 대표이미지를 추천하는 단계를 포함할 수 있다. 상기 수신된 복수 개의 상품이미지를 상기 학습된 제 1 딥러닝 모델에 입력하기 적합한 포맷으로 변환하는 단계 는, 상기 수신된 복수 개의 상품이미지 중에서 모델이 상품을 착용한 상품이미지를 추출하는 단계 및 상기 추출 된 상품이미지에서 배경을 제외하고 모델 주변부분만 추출하는 단계를 포함할 수 있다.상기한 목적을 달성하기 위한 본 발명의 다른 양태에 따른 복수 개의 쇼핑몰과 연동하여 대표 이미지를 추천하 는 장치은 상품 또는 쇼핑몰의 대표 이미지 추천과 연관하여, 제 1 쇼핑몰로부터 대표이미지 추천을 위한 복수 개의 상품이미지를 수신하는 상품이미지 수신부, 상기 수신된 복수 개의 상품이미지를 대표이미지 예측을 위한 제 1 딥러닝(deep learning) 모델에 입력하기 적합한 포맷으로 변환하는 이미지 변환부, 상기 변환된 복수 개의 상품이미지를 상기 제 1 딥러닝 모델에 입력하여 상기 복수 개의 상품이미지의 대표이미지 점수를 측정하는 점 수 측정부 및 상기 측정된 대표이미지 점수를 기반으로 대표이미지를 추천하는 대표이미지 추천부를 포함할 수 있다. 상기한 목적을 달성하기 위한 본 발명의 또 다른 양태에 따른 복수 개의 쇼핑몰과 연동하여 대표 이미지를 추천 하는 시스템은, 상품 또는 쇼핑몰의 대표 이미지 추천 요청 - 상기 대표이미지 추천 요청은 상품정보를 포함함 - 을 상기 복수 개의 쇼핑몰 중 하나인 제 1 쇼핑몰의 관리자 단말로부터 수신하여 인공지능 서버로 전달하고, 상기 인공지능 서버로부터, 상기 대표이미지 추천 요청에 포함된 상품정보 내의 각 상품이미지의 대표이미지 예 측점수를 수신하여 대표이미지 후보를 선택하며, 상기 선택된 대표이미지 후보를 상기 제 1 쇼핑몰의 관리자 단 말로 반환하는 대표이미지 예측 API 서버 및 상기 대표이미지 예측 API 서버로부터 상기 대표이미지 추천 요청 을 수신하고, 상기 대표이미지 추천 요청에 포함된 상품정보 내의 상품이미지를 대표이미지 추천을 위한 제 1 딥러닝(deep learning) 모델에 입력한 후, 상기 제 1 딥러닝 모델을 실행하여 각 상품이미지별로 대표이미지 예 측점수를 측정하여 상기 대표이미지 예측 API 서버로 제공하는 인공지능 서버을 포함할 수 있다. 상기 대표이미지 추천 시스템은 상기 상품정보에 포함된 대표이미지 및 대표이미지가 아닌 상세이미지를 기반으 로 상기 제 1 딥러닝 모델을 학습시키고, 최종 학습된 제 1 딥러닝 모델을 상기 인공지능 서버로 제공하는 인공 지능 모델 학습 장치를 더 포함할 수 있다. 상기 대표이미지 추천 시스템은 상기 복수 개의 쇼핑몰로부터 상품 정보를 수신하여 상기 상품 정보에서 대표이 미지와 대표이미지로 선택되지 않은 상세이미지를 추출하여 다운로드하고, 상기 다운로드된 상세이미지를 기반 으로 학습용 상세이미지를 생성하는 학습용 데이터 가공 장치를 더 포함할 수 있다."}
{"patent_id": "10-2018-0038168", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 대표이미지 추천 방법 및 시스템에 따르면, 쇼핑몰 운영자의 불편함을 덜어주고, 상품 등록의 생산성 을 높이는 효과가 있다."}
{"patent_id": "10-2018-0038168", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변경을 가할 수 있고 여러 가지 실시예를 가질 수 있는 바, 특정 실시예들을 도면에 예시하고 상세하게 설명하고자 한다. 그러나, 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포 함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 제 1, 제 2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소들은 상기 용어들에 의해 한정되어서는 안 된다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용 된다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제 1 구성요소는 제 2 구성요소로 명명될 수 있고, 유사하게 제 2 구성요소도 제 1 구성요소로 명명될 수 있다. 및/또는 이라는 용어는 복수의 관련된 기재된 항목 들의 조합 또는 복수의 관련된 기재된 항목들 중의 어느 항목을 포함한다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있 다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 본 출원에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함 하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조 합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일 반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의미 를 가진 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의 미로 해석되지 않는다. 이하, 첨부한 도면들을 참조하여, 본 발명의 바람직한 실시예를 보다 상세하게 설명하고자 한다. 본 발명을 설 명함에 있어 전체적인 이해를 용이하게 하기 위하여 도면상의 동일한 구성요소에 대해서는 동일한 참조부호를 사용하고 동일한 구성요소에 대해서 중복된 설명은 생략한다. 도 1은 본 발명의 일 실시예에 따른 대표이미지 추천 방법이 적용되는 시스템을 나타낸 블록도이다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 대표이미지 추천을 위한 시스템은 복수 개의 쇼핑몰(110- 1~110-N)과 통신망, 예컨대, 유선망 또는 무선망(인터넷(internet)을 포함함)을 통해 연동할 수 있다. 상 기 쇼핑몰(110-1~110-N)은 인터넷을 통하여 상품을 판매하는 쇼핑몰을 의미할 수 있고, 쇼핑몰과 연관된 정보를 취급하는 서버 또는 쇼핑몰의 관리자의 단말기를 의미할 수 있다. 쇼핑몰 대표이미지 추천 시스템은 복수 개의 쇼핑몰(110-1~110-N)과 연동하여, 쇼핑몰(110-1~110-N)의 정보를 기반으로 대표이미지를 추천할 수 있다. 쇼핑몰 대표 이미지 추천 시스템은 대표이미지 예측 API(Application Programming Interface) 서버, 인공지능 서버, 인공지능 모델 학습 장치 및 학습데이터 가공 장치를 포함할 수 있다. 대표이미 지 예측 API 서버, 인공지능 서버, 인공지능 모델 학습 장치 및 학습데이터 가공 장치는 하나의 하드웨어 컴퓨터 디바이스 내의 각각의 기능을 실행하는 기능블록(functional block)으로 구현될 수도 있고, 복수 개의 하드웨어 컴퓨터 장치의 조합으로 구현될 수도 있다. 대표이미지 예측 API 서버, 인공지 능 서버, 인공지능 모델 학습 장치 및 학습데이터 가공 장치가 하나 또는 다수의 컴퓨터 장치 로 구현될 때, 여기서 말하는 컴퓨터 장치는 서버 급 컴퓨터 단말기로 구현될 수 있다. 상기 컴퓨터 장치는 통 상적인 컴퓨터 단말이 가지는 입력 장치, 표시 장치, 네트워킹 장치, 하드디스크, 프로그램을 저장하는 메모리 및 메모리에 저장된 프로그램을 수행시키는 프로세서 등을 구비할 수 있다. 대표이미지 예측 API 서버는 쇼핑몰(110-1~110-N)로부터 대표이미지 추천 요청을 수신하고 인공지는 서버 에 쇼핑몰(110-1~110-N)의 상품정보를 제공하여 대표이미지 예측 후보와 연관된 이미지 정보를 획득하여 쇼핑몰(110-1~110-N)로 리턴(return)할 수 있다. 예컨대, 쇼핑몰을 통해 상품을 등록하고자 하는 쇼핑몰 관리자 (110-1)가 상품에 대한 다양한 이미지를 쇼핑몰 관리 서버로 업로드하면, 쇼핑몰 관리 서버와 연동하는 대표이 미지 추천 API 서버는 해당 이미지를 수신하여 인공지능 서버로 전달한다. 이때, 인공지능 서버(13 4)는 각 이미지의 대표이미지 여부 점수를 측정하여 그 결과를 대표이미지 예측 API 서버로 반환하고, 대 표이미지 예측 API 서버는 이를 쇼핑몰(110-1) 또는 쇼핑몰(110-1)의 상품을 관리하는 서버로 전달한다. 그리고 나서, 최종적으로, 쇼핑몰 상품 관리 서버에는 가장 높은 점수를 받은 이미지 몇 개를 쇼핑몰 관리자 (110-1)에게 제공하여 대표이미지를 추천한다. 추천을 받은 관리자(110-1)는 추천된 이미지 중 대표이미지를 선 택하거나 다른 이미지를 선택할 수 있다. 상품정보와 관련하여, 대표이미지 예측 API 서버는 쇼핑몰(110-1~110-N)로부터 대표이미지와 대표이미지가 아닌 상세이미지 정보를 포함하는 상품 정보를 획득할 수 있다. 경우에 따라 대표이미지 예측 API 서버는 각 쇼핑몰(110-1~110-N)의 전체 상품정보를 수신할 수 있고, 이를 인공지능 서버로 제공할 수 있다. 대표 이미지 예측 API 서버는 쇼핑몰(110-1~110-N)에 인공지능 서버에서 완성된 인공지능 모델을 다운로드 하여 각 쇼핑몰(110-1~110-N)의 단말 또는 쇼핑몰(110-1~110-N)을 관리하는 서버로 제공할 수 있고, 각 쇼핑몰 (110-1~110-N)의 단말 또는 관련 서버는 이를 다운로드하여 단말 또는 서버에서 직접 대표이미지 예측 동작을 진행시킬 수 있다. 인공지능 서버는 대표이미지 예측 API 서버로부터 각 쇼핑몰의 상품정보를 다운로드하여, 대표이미지 와 상세이미지를 기반으로 대표이미지 예측 인공지능 모델을 실행시켜 대표이미지로 추천할 예측후보 이미지를 획득하여 대표이미지 예측 API 서버로 제공한다. 인공지능 서버는 기계학습 또는 딥러닝(Deep Learning) 기반의 인공 지능 엔진을 포함한다. 인공지능 서버는 인공지능 모델 학습 장치로부터 최종적으로 학습된 대표이미지 예측 인공지능 모델 파일을 수신하여 실행시킬 수 있다. 뿐만 아니라 인공지능 서버는 대표이미지 예측을 위한 인공지능 모델 외에, 이미지 종류를 분류하기 위한 인공지능 모델 및/또는 모델 위치 감지를 위한 인공지능 모델을 포함할 수 있다. 이미지 종류를 분류하는 인공지능 모델은 각 상품이미지의 종류를 분류하기 위한 인공지능 모델로써, 모 델의 존재 여부, 상품의 노출범위, 모델의 상품의 착용 범위 등을 기반으로 이미지들을 분류하는 인공지능 모델 이다. 또한, 모델 위치 감지 인공지능 모델은 모델이 존재하는 상품착용 컷에서 모델 부분을 검출하기 위한 서 비스 모델로써, 객체검출(Object Detection) 모델을 포함할 수 있다. 이러한 모델을 사용하여 모델을 포함하는 이미지에서 모델을 탐지하여 배경을 제외하고 모델 부분만 잘라서 저장할 수 있다. 각각의 인공지능 모델은 인 공지능 모델 학습 장치를 통해 학습될 수 있다. 인공지능 서버는 특정 쇼핑몰(110-1)로부터 요청된 해당 쇼핑몰의 대표이미지 추천과 관련된 상품정보를 수신하여, 대표이미지와 상세이미지를 다운로드하고, 이미 지 종류 분류 인공지능 모델을 사용하여 모델이 존재하는 상품컷만을 추출할 수 있다. 그리고는, 모델이 존재하 는 상품컷에 대해 모델 위치 감지 인공지능 모델을 실행시켜, 모델부분만을 잘라서 대표이미지 예측 인공지능 모델에 적용시킬 수 있다. 그리고는, 대표이미지 예측 인공지능 모델을 실행시켜 상품정보 중 상품이미지(또는 상세이미지)를 추출하고, 추출된 상품이미지의 대표이미지로써의 점수를 각각 측정한 후, 측정된 점수를 대표이 미지 예측 API 서버로 제공한다. 대표이미지 예측 API 서버는 오름차순으로 정리하여, 대표이미지 후 보를 선별한다. 이때, 특정 비율의 상위 점수를 기준으로 할 수 있고, 또는 특정 기준점수를 기준으로 할 수 있 다. 예컨대, 상위 10%의 점수를 받은 이미지를 대표이미지 후보로 하는 방식 및/또는 90점과 같은 특정 기준점 이상을 받은 이미지를 대표이미지 후로보 하는 방식 등을 선택 적용할 수 있다. 대표이미지 예측 API 서버(13 2)는 이와 같은 방식으로 선별된 대표이미지 예측 후보들을 해당 쇼핑몰(110-1)로 반환한다. 인공지능 모델 학습 장치는 학습데이터 가공장치로부터 학습데이터를 수신하여 인공지능 모델을 학습 시키는 기능을 수행한다. 인공지능 모델 학습 장치는 기본적으로 대표이미지 예측 인공지능 모델을 학습시 키나, 앞서 설명한 바와 같이, 이미지 종류를 분류하기 위한 인공지능 모델 및 모델 위치 감지 인공지능 모델의 학습도 수행할 수 있다. 그리고는, 최적의 성능을 나타내는 인공지능 모델들의 파일을 생성하여 인공지능 서버 로 제공할 수 있다. 인공지능 학습용 데이터 가공 장치는 쇼핑몰(110-1~110-N) 또는 대표이미지 예측 API 서버로부터 상 품정보를 수신하여 학습용 데이터로 가공한다. 상품정보의 수신은 연결된, 또는 연관된 쇼핑몰(110-1~110-N)로 부터 주기적으로 및/또는 실시간으로 이루어지는 것이 바람직하다. 또는 비주기적으로 상품정보의 업로드 또는 업데이트, 및 대표이미지 추천 요청이 있을 때마다 이를 감지하여 이루어지도록 할 수 있다. 인공지능 학습용 데이터 가공 장치는 데이터 가공을 위한 동작을 수행하는데, 대표이미지와 상세이미지의 두 종류의 이미지에 대해 서로 다른 가공작업이 이루어지도록 할 수 있다. 대표이미지는 JPG, PNG 등의 이미지 파일로 변환하는 작업을 수행하고, 상세이미지에 대해서는, 이미지 파일 변환 작업뿐만 아니라, 이미지 파일의 크기 변환 작업, 이미지 파일의 분류작업 및 객체검출 작업 등을 부가적으로 수행할 수 있다. 그리고는, 최종적 으로 인공지능 학습에 적합한 표준 데이터(가공된 대표이미지와 가공된 상세이미지를 포함할 수 있음)를 생성한 다. 이때, 인공지능의 학습만을 위한 학습데이터와, 인공지능 모델의 하이퍼 파라미터(hyper parameter) 세부조 정을 위한 검증데이터, 및 최종학습된 인공지능 모델의 성능을 평가하기 위한 테스트 데이터의 비율은 7:2:1로 하는 것이 바람직하다. 본 발명의 다른 실시예에 따르면, 대표이미지 예측 API 서버, 인공지능 서버, 인공지능 모델 학습 장 치 및 학습데이터 가공 장치는 서로 연동하기 때문에, 학습데이터 가공장치는 가공 중에 사용되 는 인공지는 모델(예컨대, 이미지 종류 분류 인공지능 모델 및/또는 모델 위치 감지 인공지능 모델 등)의 사용 시 인공지능 서버를 활용할 수 있다. 또한, 인공지능 학습을 위한 이미지 가공과 대표이미지 추천을 위한 요청에 따른 이미지 가공은 동일 또는 유사 한 프로세스를 거치기 때문에, 이러한 이미지 가공은 학습데이터 가공장치에서 이루어질 수 있다. 더욱이, 대표이미지 추천 요청에 있을 때, 대표이미지 예측 API 서버는 요청과 관련된 상품정보를 학습데이터 가공 장치로 제공하고, 가공된 데이터를 학습 데이터 가공장치로부터 수신하여, 이를 인공지능 서버 로 전달함으로써 대표이미지 예측작업이 효율적으로 진행되도록 할 수 있다. 또한, 대표이미지 추천 요청과 관 련하여 다운로드되는 상품정보도 인공지능 모델의 정밀도 향상을 위한 학습데이터로 활용될 수 있도록 하여, 빅 데이터(BigData) 기반의 인공지능 학습에 미래지향적으로, 영구적으로 활용될 수 있도록 하는 것이 바람직하다. 인공지능 모델의 결과의 정밀도 개선에 순환적으로 도움이 될 수 있도록 하는 것이 바람직하다. 본 발명의 실시예에 있어서, 상기 대표이미지 추천 시스템이 하나의 컴퓨팅 장치로써 구현될 때, 상기 하나의 컴퓨팅 장치는 상품 정보를 다운로드하는 상품정보 다운로드부, 상품정보에서 대표이미지와 상세이미지를 추출 하는 이미지 추출부, 추출된 상세이미지를 딥러닝(deep learning) 학습에 적합한 형태로 변환하는 이미지 변환 부, 추출된 대표이미지 및 변환된 상세이미지를 기반으로 학습용 데이터 셋(data set)을 생성하는 학습데이터 생성부, 학습용 데이터 셋를 이용하여 대표이미지 예측을 위한 딥러닝 모델을 학습시키는 모델 학습부 및 학습 된 딥러닝 모델을 이용하여 대표이미지를 추천하는 이미지 추천부를 포함할 수 있다. 또한, 본 발명의 다른 실시예에 따라, 상기 대표이미지 추천 시스템이 다른 하나의 컴퓨팅 장치로써 구현될 때, 상기 다른 하나의 컴퓨팅 장치는 상품 또는 쇼핑몰의 대표 이미지 추천과 연관하여, 대표이미지 추천을 위한 복 수 개의 상품이미지를 수신하는 상품이미지 수신부, 수신된 복수 개의 상품이미지를 대표이미지 예측을 위한 딥 러닝 모델에 입력하기 적합한 포맷으로 변환하는 이미지 변환부, 변환된 복수 개의 상품이미지를 딥러닝 모델에 입력하여 복수 개의 상품이미지의 대표이미지 점수를 측정하는 점수 측정부 및 측정된 대표이미지 점수를 기반 으로 대표이미지를 추천하는 대표이미지 추천부를 포함할 수 있다. 즉, 이와 같이, 상기 시스템은 하나 또는 둘 이상의 컴퓨팅 장치의 조합으로 구현될 수 있고, 이때, 유사한 원"}
{"patent_id": "10-2018-0038168", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "리로 동작하되, 각 구성요소의 기능 및 이름이 다양하게 불릴 수 있다는 것은 본 기술분야의 통상의 기술자에게 자명할 것이다. 도 2는 본 발명의 일 실시예에 따른 대표이미지 추천 방법의 학습용 데이터 가공 장치의 동작을 나타낸 흐름도 이다 . 도 2를 참조하면, 학습데이터 가공 장치는 대표이미지 예측 API 서버 또는 각 쇼핑몰로부터 상품정보를 수신한 다(S210). 이때, 상품정보에는 대표이미지와 대표이미지가 아닌 상세이미지가 포함되어 있을 수 있다. 여기서, 대표이미지는 쇼핑몰을 대표하는 쇼핑몰 대표이미지 및/또는 특정 상품을 대표하는 상품 대표이미지를 포함할 수 있다. 이는 사용자 설정을 통해 쇼핑몰의 대표이미지와 상품대표이미지를 식별할 수 있도록 식별자를 부여하 여 장치가 식별하도록 할 수 있다. 또한, 인공지는 모델의 학습뿐만 아니라 대표이미지 추천 요청시 쇼핑몰 대 표이미지와 상품대표이미지는 별도로 수행되는 것이 바람직하다. 다시 돌아가서, 학습용 데이터 가공 장치는 상품정보에서 대표이미지 URL과 상품설명에 있는 상세이미지 URL을 추출하여 대표이미지와 상세이미지를 다운로드할 수 있다. 그리고는, 대표이미지 파일와 상세이미지 파일을 JPG 와 같은 이미지 파일로 변환한다(S212, S214). 이때, 반드시 JPG 파일로만 변환해야 하는 것은 아니고, PNG, BMP, TIFF 등 등 다른 이미지 파일로 변환해도 무방하다. 다만, GIF 파일은 다수 프레임을 포함하는 움직이는 이미지 파일이므로, 각 프레임을 추출하여 JPG 파일로 변환하는 것이 바람직하다. 또한, 쇼핑몰의 상세이미지가 여러 개의 상품이미지가 세로로 길게 붙어 하나의 파일로 되어 있을 수 있기 때문 에, 이러한 경우, 학습용 데이터 가공 장치는 각각의 상품이미지가 모두 다른 파일로 저장되도록 잘라내어 저장 한다(S216). 그리고는, 상세이미지의 사이즈가 커서 딥러닝 모델로 이미지 종류를 분류하는 데 시간이 오래걸리 는 것을 방지하기 위해, 사이즈를 축소한다(S218). 이때, 적절한 사이즈는 600px X 600px 사이즈일 수 있다. 다 만, 반드시 에에 국한되는 것은 아니다. 사이즈를 축소하고 나면, 학습용 데이터 가공 장치는 이미지 종류를 분 류하는 딥러닝 모델을 활용하여 이미지 종류를 분류한다(S220). 상품이미지의 종류에 따른 분류는 도 3을 통해 보다 상세히 설명한다. 상품이미지의 종류를 분류하고 나면, 분류된 상품이미지 종류 중에서 특정 분류를 선택하여 학습데이터 셋을 생 성할 수 있다(S222). 본 발명의 일 실시예에 따르면, 이 경우, 모델이 착용한 분류만 선택해서 학습 데이터 셋 을 추출한다. 다만, 이는 사용자 설정을 통해 임의로 변경가능한 사항이며, 반드시 모델착용샷만을 이용할 필요 는 없다. 모델이 없는 샷, 상품전체샷, 신발착용컷 등 다양한 분류의 샷이 학습데이터 또는 그밖의 데이터로 활 용될 수 있도록 할 수 있다. 본 발명의 일 실시예에 따라 모델착용 샷을 추출하여 데이터를 가공하는 경우, 모델 착용샷에서 모델을 탐지하 여 배경을 제외하고 모델 부분만 추출하는 작업을 수행한다(S224). 이때, 이미지 내에서 모델 위치를 감지하기 위한 객체 검출(Object Detection) 인공지능 모델을 사용하여 이미지 전처리 과정을 거치는 것이 바람직하다. 특히, 상세이미지에는 대표이미지에 비해, 배경이 많아서 배경 자체가 학습되는 문제가 발생할 수 있기 때문에, 객체 검출 알고리즘을 활용하여 학습 전 모델 사진에서 모델의 위치를 파악하여 배경을 모두 제거한 후 모델 부 분만을 추출하여 사용하는 것이 바람직하다. 상세이미지의 가공이 단계(S224)까지 진행되면, 이미지 변환된 대표이미지와 상세이미지의 개수가 거의 비슷하 도록 비율을 맞추어 학습데이터 셋을 생성한다(S226). 이때, 학습데이터는 딥러닝(deep learning) 분류모델에 적합하도록 이미지를 299px X 299px 사이즈로 축소한다(S228). 그리고는, 전체 이미지 데이터를 학습데이터, 검 증데이터, 테스트데이터의 비가 7:2:1이 되도록 생성한다(S230). 도 3은 상품분류 학습을 위한 상품 컷을 구분한 리스트이다. 도 3을 참조하면, 본 발명의 바람직한 실시예에 따른 이미지 종류의 분류를 위한 인공지능 모델 역시 인공지능 학습 장치와 연동하여 인공지능 엔진을 교육하면서 업데이트될 수 있다. 이미지 종류의 분류를 위한 인공지능 모델을 사용하는 인공지능 서버 및/또는 인공지능 모델 학습장치는 복수 개의 이미지들을 이미지 분류 엔진에 입력하여 각 입력 이미지를 대응된 1차 클래스로 분류할 수 있도록 이미지 분류 엔진을 교육한다. 본 발명의 바람직한 실시예에서 상기 상품은 의류를 예를 들어 설명하기로 한다. 이 경우 상기 복수 개의 이미 지들은 복수 개의 의류 판매 관련 쇼핑몰로부터 수집한 의류 상품 관련 이미지들일 수 있다. 그러나, 이는 실시 의 한 예일 뿐 한정되는 의미는 아니며 상기 상품은 판매 가능한 다양한 종류가 적용될 수 있음은 물론이다. 도 3은 1차 클래스의 분류들을 도표로 나타내는 예시도이다. 도 3에 도시된 바와 같이, 본 발명에서는 의류 쇼 핑몰에서 사용될 수 있는 모든 이미지를 이미지 분류 엔진의 교육에 적합하고, 중복으로 인한 에러를 발생하지 않으면서도, 효과적으로 교육시킬 수 있는 19개의 1차 클래스로 구분할 수 있다. 이러한 1차 클래스는 제 1 내 지 제 19 클래스를 포함할 수 있다. 예컨대, 1차 제 1 클래스는 모델전신(whole_body), 1차 제 2 클래스는 얼굴없는 전신착용컷(body_only), 1차 제 3 클래스는 모델상반(upper_body), 1차 제 4 클래스는 얼굴컷(face_shot), 1차 제 5 클래스는 상의착용컷 (upper_wear), 1차 제 6 클래스는 하의착용컷(lower_wear), 1차 제 7 클래스는 신발착용컷(shoes_wear), 1차 제 8 클래스는 기타착용컷(etc_wear), 1차 제 9 클래스는 상품전체(product), 1차 제 10 클래스는 상품상세 (detail), 1차 제 11 클래스는 스펙(spec), 1차 제 12 클래스는 멀티(multi), 1차 제 13 클래스는 코디제안 (cody), 1차 제 14 클래스는 상품배너(product_banner), 1차 제 15 클래스는 모델멀티(model_multi), 1차 제 16 클래스는 상품멀티(product_multi), 1차 제 17 클래스는 기타멀티(etc_multi), 1차 제 18 클래스는 마네킹 코디(mannequin_cody), 1차 제 19 클래스는 미분류(trash)일 수 있다. 1차 제 1 클래스인 모델전신(whole_body)은 모델의 얼굴, 팔, 다리, 손, 발 모두 표시된 상품 컷 이미지일 수 있다. 1차 제 2 클래스인 얼굴없는 전신착용컷(body_only)은 모델 전신에서 얼굴을 제외한 팔, 다리, 손, 발이 모두 표시된 상품 컷 이미지를 의미할 수 있다. 1차 제 3 클래스인 모델상반(upper_body)은, 모델의 얼굴, 팔, 손 및 다리의 적어도 일부분이 표시되고 발은 나타나지 않은 상품 컷 이미지를 의미할 수 있다. 1차 제 4 클래 스인 얼굴컷(face_shot)은, 모델의 얼굴이 중심이 되고 흉부가 표시되는 상품 컷 이미지를 의미할 수 있다. 또한, 1차 제 5 클래스인 상의착용컷(upper_wear)은, 모델의 흉부가 중심이 되어 얼굴 및 발은 표시되지 않지만 목이 노출되고 하반신은 일부 노출될 수 있는 이미지를 의미할 수 있다. 1차 제 6 클래스인 하의착용컷 (lower_wear)은, 다리나 하반신이 중심이 되고 일부 상반신이 노출이 있으며 발은 필수적으로 노출되는 이미지 를 의미할 수 있다. 1차 제 7 클래스인 신발착용컷(shoes_wear)은 발이 중심이 되어 하반신 노출만 있고 상반신은 노출되지 않는 이 미지를 의미할 수 있다. 1차 제 8 클래스인 기타착용컷(etc_wear)은 1차 제 1 내지 1차 제 7 클래스 이외의 모든 상품 착용 이미지를 의미할 수 있다. 1차 제 9 클래스인 상품전체(product)는 착용되지 않은 상품의 전체적인 형상이 완전히 노출된 이미지를 의미할 수 있다. 1차 제 10 클래스인 상품상세(detail)는 착용되지 않은 상품의 전체적인 형태가 부분적으로 노출된 이 미지를 의미할 수 있다. 1차 제 11 클래스인 스펙(spec)은 상품의 스팩 및 사용주의점 등과 같은 텍스트로 이루어진 이미지를 의미할 수 있다. 1차 제 12 클래스인 멀티(multi)는 상품 컷 이미지 중 동일 상품의 옵션(예컨대, 색상, 모양 등)이 다른 상품이 각각 2개 이상 노출된 이미지를 의미할 수 있다. 1차 제 13 클래스인 코디제안(cody)은 상품 컷 이미지 중 다른 종류의 상품이 2개 이상 노출된 이미지로서 다른 상품과 매칭시킨 이미지를 의미할 수 있다. 1차 제 14 클래스인 상품배너(product_banner)는 상품 전체 사진과 광고 문구가 혼합된 이미지를 의미할 수 있다. 1차 제 15 클래스인 모델멀티(model_multi)는 모델 착용 사진들만 2개 이상 포함된 이미지를 의미할 수 있다. 1 차 제 16 클래스인 상품멀티(product_multi)는 상품 사진이 2장 이상 또는 여러 상품이 포함된 편집 컷 이미지 를 의미할 수 있다. 1차 제 17 클래스는 기타멀티(etc_multi)는 앞서 설명한 멀티, 모델 멀티, 상품 멀티의 범주에 포함되지 않는 기타 멀티 컷 또는 상품과 모델이 혼용되거나 편집된 이미지를 의미할 수 있다. 1차 제 18 클래스인 마네킹코디 (mannequin_cody)는 마네킹 착용 이미지를 의미할 수 있다. 한편, 1차 제 19 클래스인 미분류(trash) 상기 제 1 내지 제 18 클래스의 범주를 벗어난 모든 이미지로서 분류 하기에 애매하거나 분류에 사용할 수 없는 이미지를 의미할 수 있다. 상기 이미지 분류를 위한 인공지능 서버 및/또는 인공지능 모델 학습장치는 이러한 1차 클래스에 따라 입력 이 미지를 구분하여 이미지 분류 엔진에 입력하고, 이미지 분류 엔진(인공지능 서비스 모델을 실행하는 엔진으로, 인공지능 서버 및/또는 인공지능 모델 학습장치에 포함된 구성요소임)은 입력된 이미지를 식별하는 것을 기반으 로 교육된다. 본 발명의 실시예에 따르면, 이미지 분류 학습을 위해 쇼핑몰 관리자가 인터페이스할 수 있는 별도의 사용자 인 터페이스를 포함하는 애플리케이션(application)을 독립적인 서버(이미지 종류 분류 기능 제공 서버로 불릴 수 있음)(미도시)를 통해 제공할 수 있다. 이미지 분류 엔진에 이미지들을 입력하기 위하여 상기 독립적인 서버는 이미지 입력 사용자 인터페이스를 표시 할 수 있다. 이미지 입력 사용자 인터페이스는 수신된 이미지들을 표시하는 표시부, 복수 개의 1차 클래스 중 하나의 1차 클래스를 선택할 수 있는 선택부를 구비할 수 있다. 이미지 입력 사용자 인터페이스는 상기 표시부에 표시된 이미지들 중 선택부(미도시)에 의하여 선택된 1차 클래 스에 대응하는 이미지를 선택할 수 있으며, 표시부(미도시)에 의하여 선택된 이미지를 선택부에 의하여 선택된 1차 클래스와 대응시켜 이미지 분류 엔진에 입력할 수 있다. 예를 들어, 이미지 입력 사용자 인터페이스는 선택부에서 제 8 클래스인 기타착용컷을 선택하고, 표시부에 표시 된 이미지들 중 기타착용컷에 해당하는 적어도 하나의 이미지를 선택하여 저장하면 이미지 분류 엔진은 제 8 클 래스인 키타착용컷에 해당하는 이미지들을 입력 받아 해당 이미지 분류 지식을 습득할 수 있다. 이와 같이, 상기 독립적인 서버의 엔진 교육부는 이러한 이미지 입력 사용자 인터페이스를 기반으로 하여 복수 개의 이미지들을 1차 클래스 별로 이미지 분류 엔진에 입력할 수 있다. 앞서도 언급한 바와 같이, 이미지 분류 엔진에 입력되는 이미지들은 복수 개의 쇼핑몰로부터 수집한 의류 상품 관련 이미지들일 수 있다. 이를 위하여 상기 엔진 교육부는 복수 개의 연동된 쇼핑몰의 상품 판매 웹페이지로부 터 이미지들을 수집할 수 있다. 한편, 엔진 교육부는 복수 개의 이미지를 이미지 분류 엔진에 정해진 기간만큼 입력한 후 쇼핑몰 별로 입력된 이미지 개수 및 1차 클래스 별 입력된 이미지 개수를 산출할 수 있다. 엔진 교육부는 산출된 쇼핑몰 별 이미지 개수 및 1차 클래스 별 이미지 개수를 통계 사용자 인터페이스를 통하여 표시할 수 있다. 본 발명의 다른 실시예에 따르면, 상기 독립적인 서버가 제공하는 통계 사용자 인터페이스는 쇼핑몰 별로 입력 된 이미지 개수, 1차 클래스 별로 입력된 이미지 개수, 각각의 쇼핑몰로부터 수집된 이미지 중 1차 클래스 별입력된 이미지 개수를 식별할 수 있도록 그래프를 사용하여 통계낼 수 있고, 이를 사용자 인터페이스를 통해 표 시할 수 있다. 상대적으로 특정 쇼핑몰의 이미지가 많이 입력되어 쇼핑몰 별로 입력된 이미지가 균등하지 않으며, 상기 특정 쇼핑몰의 경우 특정한 1차 클래스가 상대적으로 많이 입력되어 이미지가 균등하게 입력되지 않은 것을 파악할 수 있다. 엔진 교육부는 이러한 통계 사용자 인터페이스를 기반으로 하여 설정된 쇼핑몰 별 입력된 이미지의 개수가 미리 설정된 오차 범위 내로 균등할 때까지 이미지의 입력을 수행할 수 있다. 또한, 엔진 교육부는 1차 클래스 별로 입력된 이미지의 개수가 미리 설정된 오차 범위 내로 균등할 때까지 이미지의 입력을 수행할 수도 있다. 한편, 엔진 교육부는 쇼핑몰 별로 또는 1차 클래스 별로 입력할 이미지의 최소 개수를 설정하고, 최소 개수를 만족할 때까지 이미지의 입력을 수행할 수도 있다. 이미지 분류 엔진의 교육이 완료되면, 상품을 판매하고자 하는 웹페이지를 제작하기 위하여, 입력부는 상기 웹 페이지에 삽입할 상품 관련 이미지를 입력할 수 있다. 상품 관련 이미지가 입력되면, 상기 독립적인 서버의 1차 분류부(미도시)는 교육된 이미지 분류 엔진을 사용하 여 입력된 상품 관련 이미지를 자동으로 분류할 수 있다. 예를 들어, 1차 분류부는 이미지 분류 엔진으로 상품 관련 이미지를 전달하여 1차 클래스 별로 분류할 것을 요청하고, 1차 클래스 별로 분류된 상품 관련 이미지를 이미지 분류 엔진으로부터 수신할 수 있다. 그리고, 상기 독립적인 서버의 2차 분류부(미도시)는 1차 클래스 별로 분류된 상품 관련 이미지를 수신한 후 대 응 테이블을 이용하여 2차 클래스 별로 분류할 수 있다. 여기서 2차 클래스는 웹페이지에서 배치되는 위치에 따 른 상품 관련 이미지의 그룹일 수 있다. 각각의 2차 클래스는 적어도 하나의 1차 클래스와 대응될 수 있다. 예를 들면, 웹페이지의 임의의 3개의 영역, 예컨대 제 1 영역, 제 2 영역 및 제 3 영역에 각각 이미지의 그룹이 배치되도록 웹페이지가 구성되는 것으로 가 정하면, 제 1 영역에 대응하는 이미지 그룹(즉, 제 1 영역에 배치될 이미지 그룹)인 2차 제 1 클래스는 1차 제 1 클래스에 대응되고, 제 2 영역에 대응하는 이미지 그룹인 2차 제 2 클래스는 1차 제 3 클래스 및 1차 제5 클 래스에 대응되고, 제 3 영역에 대응하는 이미지 그룹인 2차 제 3 클래스는 1차 제 2 클래스, 1차 제 4 클래스 및 1차 제 6 내지 제 18 클래스에 대응되는 식이 될 수 있을 것이다. 이와 같은 1차 클래스와 2차 클래스의 대응 관계는 쇼핑몰의 웹페이지와 연관되어 미리 저장된 대응 테이블에 정해질 수 있다. 이를 위하여 2차 분류부는 웹페이지에 따른 대응 테이블을 설정하고, 설정된 대응 테이블을 스 토리지에 저장 및 관리할 수 있다. 이와 같은 방식으로, 이미지 분류를 위한 인공지능 모델은 학습되며, 학습된 인공지능 모델을 기반으로 입력되 는 상품이미지들을 1차 및/또는 2차 클래스에 대응되도록 적응적으로 분류할 수 있다. 도 4는 본 발명의 일 실시예에 따른 대표이미지 추천 방법의 학습과정을 구체적으로 나타낸 개념도이다. 도 4를 참조하면, 인공지능 학습장치는 이미지 인식에 많이 활용되는 합성곱 신경망(CNN: Convolutional Neural Network) 모델을 활용하여 대표이미지를 분류해낸다. 인공지능 학습장치는 학습데이터를 이용하여 딥러닝 모델 (에컨대, 합성곱 신경망 모델)을 학습시킨다. 합성곱 신경망 모델은 생물의 시각처리과정을 모방한 모델로, 패 터의 크기 및 위치가 바뀌어도 인식할 수 있는 장점이 있다. 합성곱 신경망은 지역수용필트(local receptive field), 공유 가중치(share weights) 및 서브 샘플링(sub sampling)의 방식으로 데이터의 피처를 추출해 모델 의 성능을 향상시킨다. 지역수용필드는 하위계층의 노드가 상위계층의 모든 노드와 연결되어 있지 않고, 지역적 으로 일부의 노드에만 연결되어 있는 것을 의미한다. 도 5는 본 발명의 일 실시예에 따른 대표이미지 예측을 위한 인공지능 모델 중 하나인 합성곱 신경망의 구조를 나타낸 도면이다. 도 5를 참조하면, 가장 좌측의 입력되는 이미지 데이터로 학습용 상세이미지들이 입력된다. 도 5의 사각형 형태 는 지역 수용 필드를 나타낸다. 지역 수용 필드가 다음 계층인 C1의 한 개의 노드와 가중치로 연결되어 있다. 즉, 입력인 상세이미지의 모든 영역을 C1 패털의 노드로 전달하며 이를 합성곱(convolution)이라 할 수 있다(도 5의 실시예에서 C1의 패널은 8개). 공유 가중치는 가중치를 공유한다는 것인데, C1의 한 패널 내의 노드들과 입력 패턴에 적용되는 필터가 동일함 을 나타낸다. 도 5의 C1은 8개 패널이 있으므로, 8개의 서로 다른 필터가 있을 수 잇다. 패널당 한 개의 공유되 는 필터를 통해 입력 패턴의 특정 위치에 존재하는 한 개의 특징을 발견할 수 있다. 서브-샘플링은 C1에서 S1으로 진행되는 과정이다. C1 패널을 S1으로 압축하는 것인데, C1의 영역들을 S2의 노드 로 만들어 축소하게 된다. 서브-샘플링을 풀링(pooling)이라 부를 수 있다. 도 5에 도시된 바와 같이, 합성곱 신경망(CNN)은 각 단계(stage)가 합성곱(convolution)과 서브-샘플링이라는 두 개의 핵심 구조로 구성되었기 때 문에 하이퍼 파라미터의 개수를 효율적으로 감소시켜 전체 모델의 복잡성을 감소시킬 수 있다. 스테이지가 반복 되며 최적적으로 완전 연결 계층(Fully connected layer)을 생성해 분류를 수행할 수 있다. 본 발명의 실시예에 따르면, 복수 개의 쇼핑몰로부터 수신된 대표이미지를 기반으로 공통적인 특징들을 자동으 로 추출할 수 있다. 이에 따라 상기 공통적인 특징들을 기반으로 하이퍼 파라미터를 정의하고 정의된 하이퍼 파 라미터가 상기 공통적인 특징을 반영할 수 있도록 설정한다. 그리고는, 학습용 상세이미지를 입력하고, 설정된 하이퍼 파라미터를 기반으로 대표이미지로써의 공통특징적인 부분이 얼마나 도출되는지 예측하는 알고리즘을 학습시킨다. 이때, 복수의 하이퍼 파라미터들의 변수값을 변경 하고, 모델을 변경하면서 대표이미지 예측을 위한 정확도를 높이는 과정을 수행한다. 여기서, 상품별 대표이미 지와 쇼핑몰 대표이미지는 별도로 처리될 수 있고, 이에 따라 서비스 모델도 상품별 대표이미지를 추천하는 모 델과 쇼핑몰 대표이미지를 추천하는 모델이 독립적으로 생성될 수 있다. 위와 같은 과정을 통해, 학습용 데이터 를 기반으로 서비스 모델을 학습시키되, 검증데이터의 정확도가 높이지도록 합성곱 신경망 모델을 반복학습시킨 다. 반복학습은 기설정된 시간 또는 기설정된 정확도, 기설정된 학습데이터의 양에 기반하여 수행되고, 설정된 시간, 정확도 및/또는 학습데이터의 양에 도달하면 해당시점까지 가장 높은 정확도로 학습된 모델을 저장한다. 그리고는, 학습과 검증에 사용하지 않은 테스트 데이터로 최종성능을 평가한다. 그리고는, 학습에러율과 검증 정확도 및 테스트 정확도가 전체적으로 균형잡힌 모델을 최종 서비스 모델로 선정한다. 본 발명의 다른 실시예에 따르면, 서비스 모델로 최종 선정된 합성곱 신경망 모델은 파일 형태로 생성하여 각 서비스 서버(예컨대, 인공지능 서버)로 배포할 수 있다. 그리고는, 새로운 모델을 반영하기 위해 서비스와 관련 된 데몬(daemon) 프로세스를 재시작할 수 있다. 도 6은 본 발명의 일 실시예에 따른 대표이미지 추천 방법을 사용하는 쇼핑몰 관리자 장치에서의 화면을 나타낸 도면이다. 도 6을 참조하면, 쇼핑몰 관리자는 대표이미지 추천 API 서버에 접속하여 쇼핑몰과 관련된 대표이미지 추천을 받을 수 있다. 도 6의 사용자 인터페이스 화면에서, 우측 상단의 대표이미지 추천 서버스 아이콘을 누르면, 상세이미지와 대표이미지를 선택하는 화면이 표시될 수 있다. 이때, 상품별 대표이미지를 추천하는 서 비스를 개시하기 위한 아이콘과 쇼핑몰 대표이미지를 추천하는 서비스를 개시하기 위한 아이콘이 별 도로 표시될 수 있다. 아이콘을 누르면, 상품별 대표이미지 추천을 위한 인공지능 서비스 모델이 개시되고, 아이콘을 누르면, 쇼핑몰 대표이미지 추천을 위한 인공지능 서비스 모델이 개시될 수 있다. 쇼핑몰 관리자는, 대표이미지 추천 서비스상품정보와 관련하여, 저장된 이미지들 중 상품정보로써 활용가능한 상세이미지 정보를 선택할 수 있다. 즉, 상세이미지로 활용가능한 이미지들 중 적어도 일부를 선택하여 상품정 보로써 이용될 수 있도록 한다. 그러면, 대표이미지 추천 API 서버는 이를 인공지능 서버로 전송하여 선택된 상 세이미지의 대표이미지로써의 점수를 매겨 후보 대표이미지를 추출하고, 이를 대표이미지 추천 API 서버를 매개 로 쇼핑몰 관리자의 단말로 반환할 수 있다. 쇼핑몰 관리자는 사용자 인터페이스를 통해 대표이미지로 추천된 적어도 하나의 후보이미지를 수신하고, 이들 중 하나를 선택할 수도 있고, 그렇지 않고 저장된 이미지들 중 하 나를 선택할 수도 있다. 도 7은 본 발명의 일 실시예에 따른 대표이미지 추천 방법을 활용하여 대표이미지를 추천받는 과정을 나타낸 흐 름도이다. 도 7을 참조하면, 쇼핑몰 관리자는 자신의 단말을 통해 대표이미지 추천 서비스를 실행한다. 상기 서비스 를 실행하면, 쇼핑몰 관리자 단말은 대표이미지 예측 API 서버로 대표이미지 예측 API 서버를 호출하는 요청을 전송한다(S710). 이때, 대표이미지 추천 서비스를 실행하면서 대표이미지로 선택될 수 있는 상 세이미지들의 세트를 함께 전송한다(S712). 대표이미지 예측 API 서버는 상세이미지들의 세트를 수신하여 해당 상세이미지들을 대표이미지 예측을 위한 인공지능 모델에 적합한 형태로 가공하는 과정을 거친다. 앞서 설명한 바와 같이, 이는 학습용 데이터를 가공하는 과정과 유사하기에 경우에 따라 학습데이터 가공 장치에 요청 하여 이를 대신하도록 할 수도 있다. 이 과정은 먼저, 상하복 의류인지 판단함으로써 개시된다(S714). 이때, 상 하복 의류가 아니라면, 대표이미지 에측이 불가하다는 메시지를 전달할 수 있다(S716). 만약 상하복 의류가 맞 다면, 이미지 종류별로 이미지들을 분류한다(S718). 이때, 인공지능 서버의 이미지 분류를 위한 인공지능 모델을 활용할 수 있다. 그리고는, 이미지 분류된 상태에서, 이미지에 모델이 존재하는 컷을 추출하고, 이미지 에 모델이 존재하지 않는 이미지는 스킵(skip)한다. 이는 사용자 설정을 통해 변경가능한 부분이다. 이미지에 모델이 존재하는 컷만을 추출한 상태에서, 모델의 위치 감지 및 객체 검출을 위한 인공지능 모델을 활용하여 배 경을 제외하고 모델 주변 부분만을 추출한다. 이때, 인공지능 서버의 객체검출을 위한 인공지능 모델을 활 용할 수 있다. 모델 주변부분만을 검출하고 나면, 대표 이미지 예측 API 서버는 해당 이미지에 대해 대표 이미지 분류 인공지능 모델(예컨대, 합성곱 신경망 모델)의 실행을 인공지능 서버로 요청하고, 인공지능 서버는 요청에 응답하여, 인공지능 모델을 실행하여, 상세이미지들의 대표이미지로써의 예측 결과를 도출 한다(S724). 그리고는 예측결과(상위 10% 또는 기준점수 이상인 상세이미지를 대표이미지 후보로 선택 가능)를 대표이미지 예측 API 서버로 제공하고(S726), 대표이미지 예측 API 서버는 수신된 예측결과 정보를 쇼핑몰 관리자에게 전달한다(S728). 쇼핑몰 관리자는 예측결과 정보를 수신하여 추천이미지 중 대표 이미지를 선택할 수 있다(S730). 다만, 반드시 추천이미지 중에서 대표이미지를 선택해야 하는 것은 아니고, 단 순히 참고자료 정도로만 활용할 수도 있다. 이상 도면 및 실시예를 참조하여 설명하였지만, 본 발명의 보호범위가 상기 도면 또는 실시예에 의해 한정되는 것을 의미하지는 않으며 해당 기술 분야의 숙련된 당업자는 하기의 특허 청구의 범위에 기재된 본 발명의 사상 및 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수정 및 변경시킬 수 있음을 이해할 수 있을 것이다. 도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7"}
{"patent_id": "10-2018-0038168", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 대표이미지 추천 방법이 적용되는 시스템을 나타낸 블록도, 도 2는 본 발명의 일 실시예에 따른 대표이미지 추천 방법의 학습용 데이터 가공 장치의 동작을 나타낸 흐름도, 도 3은 상품분류 학습을 위한 상품 컷을 구분한 리스트, 도 4는 본 발명의 일 실시예에 따른 대표이미지 추천 방법의 학습과정을 구체적으로 나타낸 개념도, 도 5는 본 발명의 일 실시예에 따른 대표이미지 예측을 위한 인공지능 모델 중 하나인 합성곱 신경망의 구조를 나타낸 도면, 도 6은 본 발명의 일 실시예에 따른 대표이미지 추천 방법을 사용하는 쇼핑몰 관리자 장치에서의 화면을 나타낸 도면, 도 7은 본 발명의 일 실시예에 따른 대표이미지 추천 방법을 활용하여 대표이미지를 추천받는 과정을 나타낸 흐 름도이다."}
