{"patent_id": "10-2022-0097484", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0019602", "출원번호": "10-2022-0097484", "발명의 명칭": "연산 스토리지 장치, 이를 포함하는 스토리지 시스템 및 그 동작 방법", "출원인": "삼성전자주식회사", "발명자": "진상화"}}
{"patent_id": "10-2022-0097484", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "제어 모듈; 및상기 제어 모듈과 연결되고, 각각이 복수의 블록을 가지고 서로 다른 리드 속도를 갖는 제1 메모리 영역 및 제2메모리 영역에 복수의 노드와 상기 복수의 노드 간 엣지를 포함하는 그래프 데이터 요소들을 저장하는 비휘발성메모리를 포함하고,상기 제어 모듈은,상기 그래프 데이터 요소들 중 상기 복수의 노드에 포함된 하나의 노드와 연관도가 상대적으로 높은 제1 그래프데이터 요소를 상기 제1 메모리 영역에 저장하고, 상기 하나의 노드와 연관도가 상대적으로 낮은 제2 그래프 데이터 요소를 상기 제2 메모리 영역에 저장하는 연산 스토리지 장치."}
{"patent_id": "10-2022-0097484", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제1 메모리 영역은 상기 제2 메모리 영역 보다 빠른 리드 속도를 갖는 연산 스토리지 장치."}
{"patent_id": "10-2022-0097484", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 제어 모듈은,상기 그래프 데이터 요소들을 연관도에 기초하여 복수의 그룹으로 클러스터링하고, 여기서 상기 제1 그래프 데이터 요소는 상기 복수의 그룹 중 상기 하나의 노드가 포함된 그룹에 포함되고, 상기 제2 그래프 데이터 요소는상기 복수의 영역 중 나머지 그룹에 포함되는 연산 스토리지 장치."}
{"patent_id": "10-2022-0097484", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 제어 모듈은,상기 그래프 데이터 요소들에 기초하여 인공지능 모델을 학습시키고,상기 그래프 데이터 요소들 중 학습에 따른 업데이트 빈도가 상대적으로 높은 그래프 데이터 요소를 상기 복수의 블록 중 지정된 블록에 저장하는 연산 스토리지 장치."}
{"patent_id": "10-2022-0097484", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 제어 모듈은,상기 지정된 블록에 포함된 적어도 하나의 예약 페이지에 학습에 따라 업데이트된 그래프 데이터 요소를 저장하는 연산 스토리지 장치.공개특허 10-2024-0019602-3-청구항 6 제5항에 있어서,상기 지정된 블록은 상기 제1 메모리 영역에 포함되는 연산 스토리지 장치."}
{"patent_id": "10-2022-0097484", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제4항에 있어서,상기 제어 모듈은,상기 인공지능 모델을 학습시킬 때 상기 제1 메모리 영역에 포함된 복수의 제1 페이지를 리드하고, 상기 제2 메모리 영역에 포함된 복수의 제2 페이지를 순차적으로 리드하는 연산 스토리지 장치."}
{"patent_id": "10-2022-0097484", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "연산 스토리지 장치에 의해 수행되는 동작 방법으로서,복수의 노드와 상기 복수의 노드 간 엣지를 포함하는 그래프 데이터 요소들 중 상기 복수의 노드에 포함된 하나의 노드와 연관도가 상대적으로 높은 제1 그래프 데이터 요소를 제1 메모리 영역에 저장하는 단계; 및상기 하나의 노드와 연관도가 상대적으로 낮은 제2 그래프 데이터 요소를 상기 제1 메모리 영역과 서로 다른 리드 속도를 갖는 제2 메모리 영역에 저장하는 단계를 포함하는 동작 방법."}
{"patent_id": "10-2022-0097484", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 제1 메모리 영역은 상기 제2 메모리 영역 보다 빠른 리드 속도를 갖는 동작 방법."}
{"patent_id": "10-2022-0097484", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "저장 매체를 포함하는 외부 장치; 및상기 저장 매체를 대체 가능한 연산 스토리지 장치를 포함하고,상기 연산 스토리지 장치는:제어 모듈; 및상기 제어 모듈과 연결되고, 각각이 복수의 블록을 가지고 서로 다른 리드 속도를 갖는 제1 메모리 영역 및 제2메모리 영역에 복수의 노드와 상기 복수의 노드 간 엣지를 포함하는 그래프 데이터 요소들을 저장하는 비휘발성메모리를 포함하고,상기 제어 모듈은,상기 그래프 데이터 요소들 중 상기 복수의 노드에 포함된 하나의 노드와 연관도가 상대적으로 높은 제1 그래프데이터 요소를 상기 제1 메모리 영역에 저장하고, 상기 하나의 노드와 연관도가 상대적으로 낮은 제2 그래프 데이터 요소를 상기 제2 메모리 영역에 저장하는 스토리지 시스템."}
{"patent_id": "10-2022-0097484", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명에 따르면, 제어 모듈; 및 상기 제어 모듈과 연결되고, 각각이 복수의 블록을 가지고 서로 다른 리드 속 도를 갖는 제1 메모리 영역 및 제2 메모리 영역에 복수의 노드와 상기 복수의 노드 간 엣지를 포함하는 그래프 데이터 요소들을 저장하는 비휘발성 메모리를 포함하고, 상기 제어 모듈은, 상기 그래프 데이터 요소들 중 상기 복수의 노드에 포함된 하나의 노드와 연관도가 상대적으로 높은 제1 그래프 데이터 요소를 상기 제1 메모리 영역 에 저장하고, 상기 하나의 노드와 연관도가 상대적으로 낮은 제2 그래프 데이터 요소를 상기 제2 메모리 영역에 저장하는 연산 스토리지 장치이다."}
{"patent_id": "10-2022-0097484", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 연산 스토리지 장치, 이를 포함하는 스토리지 시스템 및 그 동작 방법에 관한 것이다."}
{"patent_id": "10-2022-0097484", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "방대한 양의 데이터 처리가 필요 됨에 따라, 기존의 호스트가 수행하던 연산 기능의 일부를 스토리지 장치로 오 프로딩(offloading)시킨 연산 스토리지 장치(computational storage device)가 개발되었다. 연산 스토리지 장 치는 연산에 따른 데이터를 비휘발성 메모리(Non-Volatile Memory, NVM)에 저장한다. 그러나, 기존의 연산 스토 리지 장치는 비휘발성 메모리의 고유한 특성을 고려하지 않고 데이터를 비휘발성 메모리에 순차적으로 저장하였 다."}
{"patent_id": "10-2022-0097484", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상술한 과제를 해결하기 위한 것으로서, 본 발명의 목적은 비휘발성 메모리의 특성을 고려하여 인공 지능 동작 및 데이터 저장이 가능한 연산 스토리지 장치, 이를 포함하는 스토리지 시스템 및 그 동작 방법을 제 공하는 데 있다."}
{"patent_id": "10-2022-0097484", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예로, 제어 모듈; 및 상기 제어 모듈과 연결되고, 각각이 복수의 블록을 가지고 서로 다른 리드 속도를 갖는 제1 메모리 영역 및 제2 메모리 영역에 복수의 노드와 상기 복수의 노드 간 엣지를 포함하는 그래프 데이터 요소들을 저장하는 비휘발성 메모리를 포함하고, 상기 제어 모듈은, 상기 그래프 데이터 요소들 중 상기 복수의 노드에 포함된 하나의 노드와 연관도가 상대적으로 높은 제1 그래프 데이터 요소를 상기 제1 메 모리 영역에 저장하고, 상기 하나의 노드와 연관도가 상대적으로 낮은 제2 그래프 데이터 요소를 상기 제2 메모 리 영역에 저장하는 연산 스토리지 장치이다. 예를 들어, 상기 제1 메모리 영역은 상기 제2 메모리 영역 보다 빠른 리드 속도를 가질 수 있다. 예를 들어, 상기 제어 모듈은, 상기 그래프 데이터 요소들을 연관도에 기초하여 복수의 그룹으로 클러스터링하 고, 여기서 상기 제1 그래프 데이터 요소는 상기 복수의 그룹 중 상기 하나의 노드가 포함된 그룹에 포함되고, 상기 제2 그래프 데이터 요소는 상기 복수의 영역 중 나머지 그룹에 포함될 수 있다. 예를 들어, 상기 제어 모듈은, 상기 그래프 데이터 요소들에 기초하여 인공지능 모델을 학습시키고, 상기 그래 프 데이터 요소들 중 학습에 따른 업데이트 빈도가 상대적으로 높은 그래프 데이터 요소를 상기 복수의 블록 중 지정된 블록에 저장할 수 있다. 예를 들어, 상기 제어 모듈은, 상기 지정된 블록에 포함된 적어도 하나의 예약 페이지에 학습에 따라 업데이트 된 그래프 데이터 요소를 저장할 수 있다. 예를 들어, 상기 지정된 블록은 상기 제1 메모리 영역에 포함될 수 있다. 예를 들어, 상기 제어 모듈은, 상기 인공지능 모델을 학습시킬 때 상기 제1 메모리 영역에 포함된 복수의 제1 페이지를 리드하고, 상기 제2 메모리 영역에 포함된 복수의 제2 페이지를 순차적으로 리드할 수 있다. 본 발명의 다른 일 실시예로, 연산 스토리지 장치에 의해 수행되는 동작 방법으로서, 복수의 노드와 상기 복수 의 노드 간 엣지를 포함하는 그래프 데이터 요소들 중 상기 복수의 노드에 포함된 하나의 노드와 연관도가 상대 적으로 높은 제1 그래프 데이터 요소를 제1 메모리 영역에 저장하는 단계; 및 상기 하나의 노드와 연관도가 상 대적으로 낮은 제2 그래프 데이터 요소를 상기 제1 메모리 영역과 서로 다른 리드 속도를 갖는 제2 메모리 영역 에 저장하는 단계를 포함하는 동작 방법이다. 예를 들어, 상기 제1 메모리 영역은 상기 제2 메모리 영역 보다 빠른 리드 속도를 가질 수 있다. 본 발명의 다른 일 실시예로, 저장 매체를 포함하는 외부 장치; 및 상기 저장 매체를 대체 가능한 연산 스토리 지 장치를 포함하고, 상기 연산 스토리지 장치는: 제어 모듈; 및 상기 제어 모듈과 연결되고, 각각이 복수의 블 록을 가지고 서로 다른 리드 속도를 갖는 제1 메모리 영역 및 제2 메모리 영역에 복수의 노드와 상기 복수의 노 드 간 엣지를 포함하는 그래프 데이터 요소들을 저장하는 비휘발성 메모리를 포함하고, 상기 제어 모듈은, 상기그래프 데이터 요소들 중 상기 복수의 노드에 포함된 하나의 노드와 연관도가 상대적으로 높은 제1 그래프 데이 터 요소를 상기 제1 메모리 영역에 저장하고, 상기 하나의 노드와 연관도가 상대적으로 낮은 제2 그래프 데이터 요소를 상기 제2 메모리 영역에 저장하는 스토리지 시스템이다."}
{"patent_id": "10-2022-0097484", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하면, 비휘발성 메모리의 특성을 고려하여 인공지능 동작 및 데이터 저장이 가능한 연산 스토리지 장치, 이를 포함하는 스토리지 시스템 및 그 동작 방법이 제공될 수 있다."}
{"patent_id": "10-2022-0097484", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서, 본 발명의 기술 분야에서 통상의 지식을 가진 자가 본 발명을 용이하게 실시할 수 있을 정도로, 본 발명의 실시 예들이 명확하고 상세하게 기재될 것이다. 본 발명의 다양한 실시예들은 예를 들어 데이터베이스 어플리케이션(database application), 그래프 처리, 인공 지능 학습 또는 통계 분석 등과 같이 빅데이터(big data) 처리가 필요한 다양한 어플리케이션에 적용될 수 있다. 예를 들어, 인공지능 학습은 GNN(Graph Neural Network), CNN(Convolution Neural Network), R- CNN(Region with Convolution Neural Network), RPN(Region Proposal Network), RNN(Recurrent Neural Network), S-DNN(Stacking-based deep Neural Network), S-SDNN(State-Space Dynamic Neural Network), Deconvolution Network, DBN(Deep Belief Network), RBM(Restricted Boltzman Machine), Fully Convolutional Network, LSTM(Long Short-Term Memory) Network, Classification Network 등과 같은 다양한 종류의 인공지능 모델이나 네트워크가 사용될 수 있다. 이하, 본 발명에서는 상술한 다양한 어플리케이션 중에서 GNN을 기준으로 설명하나, 본 발명의 다양한 실시예들 이 GNN에 반드시 한정되는 것은 아니다. GNN 도 1은 GNN에서 정의되는 그래프를 도시한 것이다. 도 1을 참조하면, 그래프는 노드(N)(또는 버텍스(vertex))와 엣지(E)를 포함하는 구조화된 정보의 집합이다. 적 어도 두 개의 노드는 엣지(E)를 통해 연결된다. 노드(N)에 대응되는 노드 값은 엔티티(entity) 또는 속성을 나타낼 수 있으며, 엣지(E)에 대응되는 엣지 값은 엣지(E)에 연결된 노드(N)들 간 연관 관계를 나타낼 수 있다. 엣지(E)는 방향을 포함하거나 포함하지 않을 수 있으며, 엣지(E)가 방향을 포함하는 경우 그래프는 단방향성이 거나 양방향성일 수 있다. 노드(N) 간 거리(홉, hop), 즉 엣지 거리가 동일하면 동일한 GNN 레이어에 포함될 수 있다. 본 발명에서, 상술한 노드(N)와 엣지(E)를 포함하는 데이터를 그래프 데이터 요소(GDE)로 칭한다. GNN은 상술한 그래프의 구조를 학습하는 알고리즘으로 정의될 수 있다. GNN은 집계(aggregate)와 '결합 (combine)'의 두 가지 구성을 포함할 수 있다. 집계는 타겟 노드(RN)의 이웃 노드(NN)의 피쳐(feature)를 집계 하여 집계된 노드 피쳐에 대응되는 노드 임베딩(node embedding)을 생성한다. '결합'은 타겟 노드(RN)에 대하여 집계된 모든 노드 피쳐를 학습 가능한 레이어에 전달하여 타겟 노드(RN)를 위한 노드 임베딩을 생성한다. 집계와 '결합'은 학습의 대상이 되는 GNN에 포함된 각 레이어에서 수행될 수 있다. 레이어의 관점에서, 집계는 타겟 노드(RN)에 대하여 k-1 시점(여기서, k는 반복 차수로 자연수임)의 이웃 노드(NN)들의 히든 스테이트 (hidden state)를 결합하는 것으로 정의될 수 있고, '결합'은 k-1 시점의 타겟 노드(RN)의 히든 스테이트와 집 계된 정보를 사용하여 k 시점의 타겟 노드(RN)의 히든 스테이트를 업데이트하는 것으로 정의될 수 있다. GNN은 상술한 동작을 통해 각 타겟 노드(RN)에 대한 노드 임베딩을 생성하고, 생성한 노드 임베딩을 GNN의 입력 데이터로 하여 출력 데이터를 생성한다. GNN은 역전파(back propagation)를 통해 학습될 수 있는데, 학습 과정 에서 GNN의 각 레이어에서 정의되는 가중치 및 바이어스 값과 상술한 노드 피쳐, 히든 스테이트 또는 노드 임베 딩과 같은 그래프 데이터 요소가 업데이트될 수 있다. 그래프 데이터 요소는 연산 과정에서 업데이트 이전의 값 (예를 들어, k-1 시점)은 물론 업데이트된 값(예를 들어, k 시점)이 메모리에 저장될 수 있을 것이다. 연산 스토리지 장치 도 2는 본 발명의 일 실시예에 따른 연산 스토리지 장치를 도시한 것이다. 도 2를 참조하면, 연산 스토리지 장치는 상술한 GNN에 따른 연산 동작을 수행하고, 연산 과정에서 각 노드 들에 대한 그래프 데이터 요소를 저장할 수 있다. 또한, 그래프 데이터 요소가 업데이트될 경우 업데이트된 값 을 저장할 수 있다. 연산 스토리지 장치는 제어 모듈과, 제어 모듈에 연결된 비휘발성 메모리, 즉 NVM을 포함 한다. NVM은 서로 다른 리드(read) 속도를 갖는 제1 메모리 영역과 제2 메모리 영역을 포함한다. 일 실시예에 따르면, 제1 메모리 영역은 제2 메모리 영역 보다 빠른 리드 속도를 가질 수 있다. 일 실시예에서, 제1 메모리 영역과 제2 메모리 영역 각각은 단일 메모리 칩에 구현될 수 있다. 예를 들어, 제1 메모리 영역과 제2 메모리 영역은 단일 메모리 칩의 일부 블록 또는 페이지에 대응될 수 있다. 이때, 제1 메모리 영역에 포함되는 각 메모리 셀에 기입 가능한 비트의 개수와, 제2 메모리 영역 에 포함되는 각 메모리 셀에 기입 가능한 비트의 개수는 서로 다를 수 있다. 예를 들어, 제1 메모리 영역 은 SLC(Single Level Cell) 영역이고, 제2 메모리 영역은 MLC(Multi Level Cell) 영역 또는 TLC(Triple Level Cell) 영역일 수 있다. 다른 예를 들어, 제1 메모리 영역은 고속(fast) SLC 영역이고, 제2 메모리 영역은 저속(slow) SLC 영역일 수 있다. NVM은 상술한 복수의 노드와 복수의 노드 간 엣지를 포함하는 그래프 데이터 요소들을 제어 모듈의 동작에 따라 저장한다. 제어 모듈은 GNN에 따른 연산 동작을 수행하고, 연산 과정에서 각 노드들에 대한 그래프 데이터 요소를 저 장할 수 있다. 일 실시예에 따르면, 제어 모듈은 상술한 GNN에 따른 다양한 동작들을 수행할 수 있고, 연 산 처리된 그래프 데이터 요소를 NVM에 저장할 수 있다. 또한, GNN의 학습 과정에서 그래프 데이터 요소가 업데이트될 경우 업데이트된 값을 NVM에 저장할 수 있다. 도 3은 본 발명의 일 실시예에 따른 제어 모듈의 그래프 처리 동작을 나타낸 것이다. 도 3을 참조하면, 제어 모듈은 상술한 그래프 데이터 요소를 포함하는 그래프를 처리할 수 있으며, 예를 들어 GNN에 기초하여 그래프에 포함된 타겟 노드와 연관된 출력 데이터를 생성할 수 있다. GNN은 상술한 바와 같이 각각이 동일한 홉으로 분류되는 레이어를 포함하는데, 도 3의 경우 타겟 노드를 k라 할 경우 타겟 노드와 가장 가까운 홉을 갖는 레이어를 기준으로 도시되었다. 타겟 노드에 대하여 GNN에 따른 연산을 수행하기 위하여, 제어 모듈은 먼저 타겟 노드와 가장 가까운 홉에 위치한 이웃 노드들(1, 3, 7, l) 각각의 피쳐(또는 노드 임베딩)를 분석하고, 분석된 결과를 NVM에 저장한 다(S1010). 이웃 노드들(1, 3, 7, l)의 피쳐의 분석은 상술한 집계 동작에 대응될 수 있으며, 예를 들어 이웃 노드들(1, 3, 7, l) 각각과 연결된 또 다른 이웃 노드들의 피쳐에 기초하여 이웃 노드들(1, 3, 7, l) 각각의 피 쳐를 생성하는 것으로 이해될 수 있을 것이다. 제어 모듈은 분석에 따라 생성된 피쳐를 NVM에 저장한 다. 제어 모듈은 이웃 노드들(1, 3, 7, l) 각각의 피쳐가 생성 및 저장되면 생성된 피쳐를 리드할 수 있다 (S1020). 제어 모듈은 리드한 피쳐에 기초하여 타겟 노드의 피쳐를 업데이트한다(S1030). 또한, 제어 모듈은 업데이트한 타겟 노드의 피쳐를 NVM에 저장할 수 있다. 일 실시예에 따르면, 제어 모듈은 분석 또는 업데이트에 따라 생성된 피쳐와 같은 그래프 데이터 요소를 NVM에 저장할 때, 노드 간 연관도에 기초하여 그래프 저장할 수 있다. 제어 모듈은 연관도에 따라 NVM에 그래프 데이터 요소를 저장하기 위하여 GNN의 입력 데이터인 그래프를 연관도에 기초하여 클러스터 링하고, 클러스터링에 의해 분류된 클러스터로 노드들 간 연관도를 판단할 수 있다. 도 4는 본 발명의 일 실시예에 따른 클러스터링된 그래프를 나타낸 것이다. 도 4를 참조하면, 복수의 노드와 적어도 두 노드 간 연결된 엣지를 포함하는 그래프는 노드들 간 연관도에 따라 복수의 그룹(A 내지 C)으로 분류될 수 있다. 예를 들어, 도 4의 경우 타겟 노드(RN)인 k와 연관도가 높은 노드 는 1 내지 3이고, k와 연관도가 상대적으로 낮은 노드는 7 내지 9이고, 연관도가 가장 낮은 노드는 1, 4 및 5일 수 있다. 제어 모듈은 다양한 방식에 기초하여 그래프를 클러스터링할 수 있다. 일 실시예에 따르면, 제어 모듈 은 각각의 노드와 연관되고, 볼록 함수이자 미분 가능한 비용 함수(cost function)를 사용하여 클러스터링 할 수 있다. 예를 들어, 비용 함수가 노드 간 거리, 가중치, 엣지 또는 비용 등으로 정의될 수 있는 어떠한 파 라미터(wk)로 정의되는 경우, 제어 모듈은 비용 함수를 최소화할 수 있는 파라미터(wk)를 탐색하여 그래프 를 클러스터링할 수 있다. 예를 들어, 동일한 파라미터(wk)를 갖는 노드들은 동일한 그룹으로 분류될 수 있다. 제어 모듈은 클러스터링을 통해 분류된 그룹에서 어떠한 노드가 타겟 노드(RN)와 동일한 그룹(A)에 포함되 어 있는 경우 타겟 노드(RN)와 상대적으로 연관도가 높은 노드로 판단할 수 있고, 다른 그룹(B, C)에 포함되어 있는 경우 타겟 노드(RN)와 상대적으로 연관도가 낮은 노드로 판단할 수 있다. 연관도에 따라 노드 및 엣지가 분류되면, 노드 및 엣지를 포함하는 그래프 데이터 요소 또한 분류될 수 있다. 예를 들어, 그래프 데이터 요소들은 타겟 노드(RN)가 포함된 그룹(A)에 포함된 노드 및 엣지를 포함하는 그래프 데이터 요소(이하, 제1 그래프 데이터 요소(GDE 1))와 나머지 그룹(B, C)에 포함된 노드 및 엣지를 포함하는 그 래프 데이터 요소(이하, 제2 그래프 데이터 요소(GDE 2))로 분류될 수 있을 것이다. 일 실시예에 따르면, 제어 모듈은 그래프 데이터 중 복수의 노드에 포함된 하나의 노드와 연관도가 상대적 으로 높은 제1 그래프 데이터 요소(GDE 1)를 제1 메모리 영역에 저장한다. 또는, 제어 모듈은 하나의 노드와 연관도가 상대적으로 낮은 제2 그래프 데이터 요소(GDE 2)를 제2 메모리 영역에 저장한다. 도 5a 및 도 5b는 본 발명의 일 실시예에 따른 제어 모듈의 저장 동작을 설명하기 위한 것이다. 도 5a 및 도 5b 에서, 상술한 제1 메모리 영역 및 제2 메모리 영역 각각은 복수의 블록을 포함하고, 각 블록은 복수 의 페이지를 포함할 수 있다. 도 5a를 참조하면, 일 실시예에 따른 제어 모듈은 제1 메모리 영역과 제2 메모리 영역에 노드의 인덱스 순으로 순차적으로 그래프 데이터 요소를 저장할 수 있다. 또는, 제어 모듈은 GNN에서 처리되는 노 드의 순서대로 그래프 데이터 요소를 저장할 수 있다. 예를 들어, 도시된 바와 같이 제1 메모리 영역에 제 1-1 블록(BLK 1-1) 내지 제1-2 블록(BLK 1-2)이 포함되고, 제2 메모리 영역에 제2-1 블록(BLK 2-1) 내지 제2-2 블록(BLK 2-2)이 포함될 수 있고, 각 블록은 복수의 페이지를 포함할 수 있다. 이때, 제1-2 블록(BLK 1-2), 제2-1 블록(BLK 2-1) 및 제2-2 블록(BLK 2-2)이 가용 가능할 경우, 제어 모듈 은 제1-2 블록(BLK 1-2), 제2-1 블록(BLK 2-1) 및 제2-2 블록(BLK 2-2)에 순차적으로 그래프 데이터 요소 를 저장할 수 있다. 예를 들어, 제어 모듈은 제1 메모리 영역에서 제1-2 블록(BLK 1-2)에 포함된 제 1-3 페이지에 노드 1 및 노드 2와 연관된 그래프 데이터 요소를 저장할 수 있다. 이후, 제어 모듈은 제2 메모리 영역에서 제2-1 블록(BLK 2-1)에 포함된 제2-1 페이지에 노드 5 및 노드 7과 연관된 그래프 데이터요소를 저장하고, 제2-2 페이지에 노드 8 및 노드 9와 연관된 그래프 데이터 요소를 저장하고 제2-2 블록(BLK 2-2)에 포함된 제2-3 페이지에 노드 k 및 노드 l과 연관된 그래프 데이터 요소를 저장한다. 도 5b를 참조하면, 일 실시예에 따른 제어 모듈은 클러스터링된 그래프에 기초하여 그래프 데이터 요소를 저장한다. 예를 들어, 그래프에 포함된 노드들이 타겟 노드가 포함된 그룹 A와, 나머지 그룹인 그룹 B 및 그룹 C로 분류된 경우, 제어 모듈은 그룹 A에 포함된 노드 k, 노드 1, 노드 2 및 노드 3을 연관도가 높은 노드 로 판단하여 제1 메모리 영역에 저장한다. 제어 모듈은 나머지 그래프 데이터 요소를 연관도가 낮은 노드로 판단하여 제2 메모리 영역에 저장한다. 도 6 및 도 7은 일 실시예에 따른 NVM의 리드 동작을 설명하기 위한 것이다. 도 6을 참조하면, 일 실시예에 따른 제어 모듈은 인공지능 모델을 학습시킬 때 제1 메모리 영역에 포함된 복수의 제1 페이지(제1-1 페이지 내지 제1-4 페이지)를 리드하고, 제2 메모리 영역에 포함된 복수의 제2 페이지 (제2-1 페이지 내지 제2-4 페이지)를 순차적으로 리드할 수 있다. 예를 들어 제어 모듈이 타겟 노드 k의 피쳐를 업데이트하기 위하여 타겟 노드의 이웃 노드들(1, 3, 7, l) 로부터 그래프 데이터 요소를 순차적으로 리드하는 경우를 고려할 수 있다. 즉, 제어 모듈은 먼저 타겟 노 드 k로부터 그래프 데이터 요소를 리드하고(S1021), 그 다음 이웃 노드 1로부터 그래프 데이터 요소를 리드하고 (S1022), 그 다음 이웃 노드 3으로부터 그래프 데이터 요소를 리드하고(S1023), 그 다음 이웃 노드 7로부터 그 래프 데이터 요소를 리드하고(S1024), 마지막으로 이웃 노드 l로부터 그래프 데이터 요소를 리드할 수 있다 (S1025). 이때, 일 실시예에 따르면, 도 7과 같이 그래프 데이터 요소들이 상술한 바(도 5b)와 같이 제1 메모리 영역 과 제2 메모리 영역에 타겟 노드와의 연관도에 따라 저장된 경우, 단순히 순차적으로 저장된 경우(도 5a) 보다 NVM의 리드 동작이 줄어들 수 있다. 예를 들어, 도 5a와 같이 리드되어야 할 노드 1, k 3, 5, 7, l, k의 그래프 데이터 요소들이 각 페이지에 순차적으로 저장된 경우 타겟 노드 k의 피쳐를 업데이트하기 위하 여 적어도 4번의 페이지 리드 동작이 필요하다. 반면, 도 5b 및 도 7과 같이 연관도에 따라 그래프 요소 데이터 가 저장된 경우, 노드 k, 1이 저장된 제1-3 페이지를 리드하고(S1110), 노드 3이 저장된 제1-4 페이지를 리드하 고(S1120), 노드 7, l이 저장된 제2-1 페이지를 리드(S1130)함으로써 보다 적은 페이지 리드 동작으로 타겟 노 드 분석이 가능하다. 도 8은 본 발명의 일 실시예에 따른 제어 모듈의 저장 동작을 설명하기 위한 것이다. 도 8을 참조하면, 일 실시예에 따르면 제어 모듈은 상술한 GNN과 같은 인공지능 모델의 학습 과정에서, 그 래프에 포함된 복수의 노드 각각에 대한 그래프 데이터 요소들 중 특히 업데이트가 빈번하게 발생하는 그래프 데이터 요소를 지정된 블록에 저장할 수 있다. 예를 들어, 그래프에 포함된 노드 k와 노드 l 중에서 상대적으로 노드 k의 그래프 데이터 요소가 학습에 따른 업데이트 빈도가 높을 경우, 제어 모듈은 노드 k의 그래프 데이터 요소를 지정된 블록에 저장하고, 다른 노드 l의 그래프 데이터 요소는 지정된 블록을 제외한 나머지 블록에 저장한다. 지정된 블록은 그래프 데이터 요소의 업데이트 빈도, NVM에 포함된 페이지, 블록 또는 슈퍼 블록의 크기 등에 따라 지정될 수 있다. 제 어 모듈은 일 실시예에 따라 블록을 지정할 수 있고, 또는 호스트로부터 지정될 수도 있다. 지정된 블록은 저장된 빈도가 높은 노드의 그래프 데이터 요소가 가비지 컬렉션(garbage collection)을 통해 복사될 블록을 포 함하여 복수 개가 지정될 수 있다. 지정된 블록에는 도시된 바와 같이 복수의 페이지가 포함되되, 예를 들어 제1-3 페이지와 같이 예약된 영역, 즉 예약 페이지가 포함될 수 있다. 제어 모듈은 학습에 따라 지속적으로 업데이트되는 노드 k의 그래프 데이 터 요소를 지정된 블록에 저장하며, 추후 업데이트될 그래프 데이터 요소(예를 들어, k+1 번째 업데이트 시점) 를 예약된 영역에 저장할 수 있다. 또는, 제어 모듈은 업데이트 빈도가 높은 다른 노드의 그래프 데이터 요소를 예약된 영역에 저장할 수도 있다. NVM에 그래프 데이터 요소가 저장된 이후, NVM에 연결된 스토리지 컨트롤러를 통해 각 블록에 저장된 데이터는 소거(erase)될 수 있다. 소거 동작은 블록 단위로 수행된다. 소거 동작은 예를 들어 블록에 저장된 유 효 데이터를 다른 블록에 복사(copy)한 후 기존 블록을 소거하는 가비지 컬렉션(garbage collection)에서 수행 될 수 있다. 도 9는 본 발명의 일 실시예에 따른 제어 모듈의 GNN에 따른 동작들을 설명하기 위한 것이다. 도 9를 참조하면, 제어 모듈은 상술한 바와 같이 GNN에 포함된 각 레이어를 순차적으로 분석(예를 들어, 학습)하고, 분석에 따라 생성되는 데이터, 즉 그래프 데이터 요소를 NVM에 저장할 수 있다. 레이어는 타겟 노드로부터 가장 홉 수가 낮은 레이어부터 홉 수가 가장 높은 레이어를 포함하거나, 또는 노드 임베딩 생성 후 분류기나 예측기에 대응되는 신경망 레이어를 포함할 수도 있다. 어떠한 종류의 레이어를 포함하든 간에, 제어 모듈은 각 레이어에서 NVM에 저장된 그래프 데이터 요 소를 리드하고, 리드한 그래프 데이터 요소에 기초하여 레이어를 분석하고, 분석에 따라 업데이트된 그래프 데 이터 요소를 NVM에 저장한다. 이후, 업데이트된 그래프 데이터 요소가 저장된 블록이 가득 찰 경우 NVM의 특성 상 덮어 쓰기가 허용되지 않으므로 소거 동작을 통한 가비지 컬렉션이 수행될 수 있다. 이때, 일 실시예에 따라 제어 모듈이 업데이트 빈도가 높은 그래프 데이터 요소를 지정된 블록에 따로 저 장한 경우, 가비지 컬렉션 등과 같은 블록 단위의 동작이 지정된 블록과 나머지 블록 단위 마다 수행되므로 블 록 단위의 동작 횟수와 그로 인한 입/출력 레이턴시(latency)가 감소될 수 있다. 예를 들어, 업데이트 빈도가 다양한 그래프 데이터 요소를 구분 없이 블록에 저장하게 될 경우, 업데이트 빈도가 낮은 그래프 데이터 요소가 포함되어 있음에도 불과하고 업데이트 빈도가 높은 그래프 데이터 요소로 인하여 가비지 컬렉션이 빈번하게 발 생될 수 있으나, 일 실시예에 따라 지정 블록에 업데이트 빈도가 높은 그래프 데이터 요소를 따로 저장하게 될 경우 가비지 컬렉션의 횟수가 줄어들 수 있다. 이상에서, 본 발명의 연산 스토리지 장치와 관련된 다양한 실시예들을 살펴보았다. 실시예들에 따르면, 페 이지 단위로 읽기/쓰기 동작이 가능하고, 블록 단위로 소거 동작이 가능하다는 NVM의 특성을 고려하여 GNN 과 같은 다양한 연산 처리 동작에 따라 생성되는 데이터를 NVM에 저장함으로써 페이지 리드 동작이나 가비 지 컬렉션 동작의 횟수가 줄어들고, 그에 따른 연산 동작의 효율성이 증대될 수 있다. 도 10은 본 발명의 일 실시예에 따른 연산 스토리지 장치의 동작 방법의 순서도이다. 도 10을 참조하면, S110에서, 연산 스토리지 장치는 복수의 노드와 복수의 노드 간 엣지를 포함하는 그래 프 데이터 요소들 중 복수의 노드에 포함된 하나의 노드와 연관도가 상대적으로 높은 제1 그래프 데이터 요소 (GDE 1)를 제1 메모리 영역에 저장한다. S120에서, 연산 스토리지 장치는 하나의 노드와 연관도가 상대적으로 낮은 제2 그래프 데이터 요소(GDE 2)를 제1 메모리 영역과 서로 다른 리드 속도를 갖는 제2 메모리 영역에 저장한다. 예를 들어, 제1 메모리 영역은 제2 메모리 영역 보다 리드 속도가 빠를 수 있다. 즉, 연관도가 상대 적으로 높은 제1 그래프 데이터 요소(GDE 1)가 리드 속도가 빠른 제1 메모리 영역에 저장되고, 상대적으로 낮은 제2 그래프 데이터 요소(GDE 2)가 리드 속도가 느린 제2 메모리 영역에 저장된다. 도 11은 본 발명의 다른 일 실시예에 따른 연산 스토리지 장치의 동작 방법의 순서도이다. 도 11을 참조하면, S210에서, NVM은 그래프 데이터 요소를 포함하는 그래프와, GNN 모델을 저장한다. 도시 되지는 않았으나, S210 단계는 예를 들어 연산 스토리지 장치와 인터페이스를 통해 연결된 호스트를 통해 수행될 수 있다. S220에서, 제어 모듈은 NVM에 저장된 그래프와 그래프 데이터 요소를 리드한다. S230에서, 제어 모듈은 그래프에 대하여 클러스터링을 수행하고, 그래프에 포함된 복수의 노드를 복수의 그룹 중 하나에 포함되도록 분류한다. 클러스터링은 상술한 바와 같이 노드 간 연관도에 기초하여 수행될 수 있 고, 타겟 노드와 연관도가 상대적으로 높은 노드들은 타겟 노드가 포함된 그룹에 포함될 수 있다. S240에서, 제어 모듈은 연산을 수행하고, 그래프 데이터 요소를 업데이트한다. 예를 들어, 연산은 상술한 GNN을 포함한 인공지능 학습이나 그래프 처리 등과 같은 다양한 동작을 포함할 수 있다. S250에서, 제어 모듈은 업데이트된 그래프 데이터 요소 중 타겟 노드와 연관도가 높은 것으로 분류된 제1 그래프 데이터 요소(GDE 1)를 리드 속도가 빠른 제1 메모리 영역에 저장한다. S260에서, 제어 모듈은 업데이트된 그래프 데이터 요소 중 타겟 노드와 연관도가 낮은 것으로 분류된 제2 그래프 데이터 요소(GDE 2)를 리드 속도가 느린 제2 메모리 영역에 저장한다. 도 12는 본 발명의 다른 일 실시예에 따른 연산 스토리지 장치의 동작 방법의 순서도이다. 도 12를 참조하면, S310에서, 연산 스토리지 장치는 업데이트 빈도가 높은 노드의 그래프 데이터 요소를 별도로 저장하기 위한 블록을 지정한다. 예를 들어, 블록은 그래프 데이터 요소의 업데이트 빈도, NVM에 포함된 페이지, 블록 또는 슈퍼 블록의 크기 등에 따라 지정될 수 있다. S320에서, 연산 스토리지 장치는 지정된 블록에 업데이트 빈도가 높은 노드의 그래프 데이터 요소를 저장 한다. 이후, 연산 스토리지 장치는 지정된 블록에 저장된 노드의 그래프 데이터 요소가 업데이트될 경우 해당 지정된 블록에 포함된 다른 페이지(예를 들어, 예약된 영역)에 업데이트된 그래프 데이터 요소를 저장할 수 있다. 이하에서는, 상술한 연산 스토리지 장치가 적용될 수 있는 실시예들에 대하여 설명한다. 중복되는 부분에 대한 상세한 설명은 생략한다. 도 13은 본 발명의 다른 실시예에 따른 연산 스토리지 장치를 나타낸 것이다. 도 13을 참조하면, 일 실시예에 따른 연산 스토리지 장치는 호스트에 연결되며, 스토리지 장치, 스위치 및 가속기를 포함한다. 스토리지 장치는 연산 스토리지 장치에 내장되는 내부 메모리일 수 있다. 예를 들어, 스토리지 장치 는 SSD(Solid State Drive), 임베디드 UFS(Universal Flash Storage) 메모리 장치 또는 eMMC(embedded Multi-Media Card)일 수 있다. 일부 실시예들에서, 스토리지 장치는 전자 장치에 착탈 가능한 외장 메모리 일 수 있다. 예를 들어, 스토리지 장치는 UFS 메모리 카드, CF(Compact Flash), SD(Secure Digital), Micro-SD(MicroSecure Digital), Mini-SD(Mini Secure Digital), xD(extreme Digital) 또는 메모리 스틱 (Memory Stick)일 수 있다. 스토리지 장치는 NVM과 스토리지 컨트롤러를 포함할 수 있고, 스토리지 컨트롤러는 호스트 가 요청한 동작을 수행하기 위해 필요한 입력 데이터를 명령에 기초하여 생성하거나, 또는 NVM으로부 터 독출하여 생성할 수 있다. 스위치는 스토리지 장치와 가속기 사이에 연결되며, 예를 들어 PCIe(Peripheral Component Interconnect express) 표준을 따르는 PCIe 스위치일 수 있다. 스위치는 스토리지 장치와 가속기에 연결된 버퍼 메모리 간 통신을 설정하고, PCIe 프로토콜에 따라 통신을 수행할 수 있다. 가속기는 호스트가 수행하는 연산들 중 일부를 수행하여 호스트의 연산을 보조하는 가속 기능을 수행할 수 있다. 예를 들어, 가속기는 스토리지 장치에 연결되어 스토리지 장치로부터 입력 데 이터를 수신하고, 입력 데이터에 대한 연산을 수행하여 연산 데이터를 생성하고, 생성한 연산 데이터를 버퍼 메 모리에 저장하거나 또는 스토리지 장치에 전송할 수 있다. 가속기는 호스트의 명령에 따라 상술한 연산 동작들(예를 들어, 클러스터링, GNN 등)을 수행할 수 있다. 가속기는 호스트 동작의 오프로딩을 위해 재구성, 재프로그래밍이 가능한 로직 칩일 수 있으며, 예를 들어 FPGA(Field Programmable Gate Array), MCU(MiCrocontroller Unit), PLD(Programmable Logic Device) 또 는 CPLD(Complex PLD) 등일 수 있다. 버퍼 메모리는 가속기로부터 연산에 따른 연산 데이터를 저장할 수 있다. 또는, 일 실시예에 따르면 버퍼 메모리는 호스트로부터 오프로딩된 시스템 데이터를 저장할 수도 있다. 버퍼 메모리는 DRAM 또는 SRAM 등과 같은 휘발성 메모리일 수 있다. 버퍼 메모리에 저장된 연산 데이터는 스토리지 장치 에 포함된 NVM으로 저장될 수 있다. 도 13에 따른 연산 스토리지 장치에서, 상술한 도 2의 제어 모듈은 실시예들에 따라 스토리지 컨트롤 러일 수도 있고, 또는 가속기일 수도 있다. 실시예들에 따라, 스토리지 컨트롤러 또는 가속기 는 상술한 제어 모듈의 다양한 동작들을 수행할 수 있다. 스토리지 시스템 도 14는 본 발명의 일 실시예에 따른 스토리지 시스템을 나타낸 것이다. 도 14를 참조하면, 일 실시예에 따른 스토리지 시스템은 호스트와 호스트에 연결된 연산 스토리지 장치를 포함한다. 호스트는 호스트 인터페이스, 호스트 컨트롤러 및 호스트 메모리를 포함한다. 호스트 인터페이스는 연산 스토리지 장치와의 인터페이스를 제공하는 호스트 인터페이스는 물리 계층(physical layer) 및 링크 계층(link layer)을 포함할 수 있다. 물리 계층은 연산 스토리지 장치와 데이터를 교환하기 위한 물리적 구성들을 포함할 수 있고, 적어도 하나의 송신기(transmitter: TX) 및 적어도 하나의 수신기 (receiver: RX) 등을 포함할 수 있다. 링크 계층은 데이터의 전송 및/또는 조합(Composition)을 관리할 수 있고, 데이터의 무결성(Integrity) 및 오류(Error)를 관리할 수도 있다. 호스트 컨트롤러는 호스트의 동작을 제어할 수 있다. 예를 들어, 호스트 컨트롤러는 운영 체제 (operating system; OS)를 실행할 수 있다. 운영 체제는 예를 들어 파일 관리를 위한 파일 시스템(file system) 및 연산 스토리지 장치를 포함하는 주변 기기를 운영 체제 레벨에서 제어하기 위한 장치 드라이버 (device driver)를 포함할 수 있다. 예를 들어, 호스트 컨트롤러는 CPU(Central Processing Unit)와 같은 임의의 프로세서를 포함할 수 있다. 호스트 메모리는 호스트 컨트롤러에 의해 실행 및 처리되는 명령어(instruction) 및 데이터를 저장할 수 있다. 호스트 메모리는 상대적으로 빠른 동작 속도를 갖는 메모리로 구현될 수 있다. 예를 들어, 호스트 메모리는 DRAM 등과 같은 휘발성 메모리를 포함할 수 있다. 일 실시예에 따르면, 연산 스토리지 장치가 단지 NVM만을 포함하고, DRAM과 같은 휘발성 메모리를 별 도로 포함하지 않는 경우(예를 들어, 착탈 가능한 다양한 외장 메모리들), 제어 모듈은 호스트 인터페이스 를 통해 HPB(Host Performance Booster) 또는 HMB(Host Memory Buffer) 기법에 따라 호스트 메모리에 액세스할 수 있다. HPB 기법은 호스트에 포함되는 호스트 메모리에 연산 스토리지 장치의 동작과 관련된 다양한 데이터를 저장함으로써, 호스트 메모리를 연산 스토리지 장치의 캐시 메모리로서 이용 하는 것을 의미한다. 따라서, 제어 모듈은 상술한 다양한 연산 동작들에 따라 생성되는 데이터(예를 들어, 업데이트된 그래프 데이터 요소 등)를 호스트 메모리에 저장하거나, 저장된 데이터를 리드하여 GNN과 같은 상술한 연산 동작들 을 수행할 수 있다. 이때, 제어 모듈은 호스트 메모리에 저장된 데이터를 리드하여 NVM에 저장할 때, 일 실시예에 따라 연관도가 높은 제1 그래프 데이터 요소(GDE 1)를 NVM에 포함된 제1 메모리 영역 에 저장하고, 연관도가 낮은 제2 그래프 데이터 요소(GDE 2)를 제2 메모리 영역에 저장할 수 있다. 또는, 제어 모듈은 일 실시예에 따라 업데이트 빈도가 높은 그래프 데이터 요소를 NVM에 포함된 복수 의 블록 중 지정된 블록에 저장할 수 있다. 도 15는 본 발명의 다른 일 실시예에 따른 스토리지 시스템을 나타낸 것이다. 도 15를 참조하면, 다른 일 실시예에 따른 스토리지 시스템은 외부 장치 및 연산 스토리지 장치를 포함한다. 외부 장치는 예를 들어 휴대폰(mobile phone), 스마트 폰(smart phone), 태블릿(tablet), PC(Personal Computer), 노트북(laptop computer), PDA(Personal Digital Assistant), PMP(Portable Multimedia Player), 감시 카메라(surveillance camera)), 디지털 카메라(digital camera), 캠코더(camcorder), 휴대용 게임 콘솔 (portable game console), 음악 재생기(music player), 동영상 재생기(video player), 네비게이션(navigation) 기기, 웨어러블(wearable) 기기, IoT(Internet of Things) 기기, e-북(e-book), VR(Virtual Reality) 기기, AR(Augmented Reality) 기기 등과 같은 다양한 장치를 포함할 수 있다. 외부 장치는 외부 장치의 동작을 제어하는 컨트롤러와, 탈착 가능한 매체를 포함할 수 있다. 탈착 가능한 매체는 다양한 데이터, 소프트웨어, 어플리케이션 및/또는 프로그램이 저장된 저장 매체일 수 있으며, 컨트롤러가 수행하는 다양한 동작이나 기능을 업데이트하거나, 또는 새로운 기능을 추가할 수 있다. 예를 들어, 외부 장치가 감시 카메라인 경우, 탈착 가능한 매체가 인공 신경망에 따라 실시간으 로 비디오 분석을 수행할 수 있도록 구성되었다면 해당 기능을 추가로 수행할 수 있다. 탈착 가능한 매체는 본 발명의 다양한 실시예들에 따른 연산 스토리지 장치가 대체될 수 있다. 즉, 연 산 스토리지 장치가 외부 장치에 새로이 삽입될 수 있다. 연산 스토리지 장치가 외부 장치에 삽입될 경우, 상술한 그래프 처리, 인공지능 학습 등과 같은 다양한 동작을 수행할 수 있다. 일 실시예에 따라, 연산 스토리지 장치는 GNN을 이용하여 외부 장치의 기능을 수행할 수 있고(예를 들어, 감시 카메라의 경우 감시 카메라의 실시간 영상으로부터 영상 패턴, 객체 식별 또는 경보 생성 등과 같은 동작 등), GNN에 따 른 그래프 데이터 요소를 NVM에 저장할 수 있다. 제어 모듈은 NVM에 저장할 때, 일 실시예에 따 라 연관도가 높은 제1 그래프 데이터 요소(GDE 1)를 NVM에 포함된 제1 메모리 영역에 저장하고, 연관도가 낮은 제2 그래프 데이터 요소(GDE 2)를 제2 메모리 영역에 저장할 수 있다. 또는, 제어 모듈은 일 실시예에 따라 업데이트 빈도가 높은 그래프 데이터 요소를 NVM에 포함된 복수 의 블록 중 지정된 블록에 저장할 수 있다. 도 16은 본 발명의 다른 일 실시예에 따른 스토리지 시스템을 나타낸 것이다. 도 16을 참조하면, 도 15에 따른 외부 장치의 탈착 가능한 매체가 본 발명의 다양한 실시예들에 따른 연산 스토리지 장치로 대체될 수 있다. 외부 장치는 컨트롤러 및 연산 스토리지 장치에 더하여 외부 인터페이스를 포함한다. 외부 인터페이스는 외부 장치와 다른 별도의 컴퓨팅 시스템과 통신하 기 위해 구비될 수 있다. 컴퓨팅 시스템은 연산 스토리지 장치와 별개로 외부 장치와 연관된 다양한 연산 동작을 수행할 수 있다. 연산 스토리지 장치는 외부 인터페이스를 통해 컴퓨팅 시스템과 연결되어, 그래프 처리나 인공지능 학습에 따른 다양한 데이터를 주고받거나, 연산 동작의 일부를 오프로딩시키거나 또는 오프로딩받을 수 있다. 예를 들어, 외부 인터페이스는 CXL 인터페이스일 수 있다. CXL 인터페이스는 컴퓨터 디바이스 인터커넥터 규격으로서, 데이터 압축 및 암호화, 인공지능 같은 특수 작업 부하의 급속한 혁신으로 인해 이기종 컴퓨팅 환 경에서 호스트와 스토리지 장치의 오버헤드 및 대기 시간을 줄이고 호스트 메모리와 메모리 장치의 공 간을 공유할 수 있게 해주는 인터페이스이다. 예를 들어, 컴퓨팅 시스템은 복잡한 연산을 수행하는 연산 스 토리지 장치에 포함된 제어 모듈과 직접 통신하고 메모리를 공유할 수 있다. 상술한 다양한 실시예들에 따른 스토리지 시스템(1, 2, 3)은 기존의 외부 장치가 포함된 다양한 네트워크 시스 템에서 엣지단(예를 들어, 엣지 서버(edge server) 등)이 수행하는 기능의 적어도 일부를 외부 장치가 수행가능 할 수 있고, 또는 GNN과 같은 다양한 연산 기능을 외부 장치가 직접 수행할 수도 있다. 상술한 내용은 본 발명을 실시하기 위한 구체적인 실시 예들이다. 본 발명은 상술한 실시 예들 이외에도, 단순 하게 설계 변경되거나 용이하게 변경할 수 있는 실시 예들도 포함될 것이다. 또한, 본 발명은 실시 예들을 이용 하여 용이하게 변형하여 실시할 수 있는 기술들도 포함될 것이다. 따라서, 본 발명의 범위는 상술한 실시 예들 에 국한되어 정해져서는 안되며, 후술하는 특허청구범위뿐만 아니라 이 발명의 특허청구범위와 균등한 것들에 의해 정해져야 할 것이다.도면 도면1 도면2 도면3 도면4 도면5a 도면5b 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13 도면14 도면15 도면16"}
{"patent_id": "10-2022-0097484", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 GNN에서 정의되는 그래프를 도시한 것이다. 도 2는 본 발명의 일 실시예에 따른 연산 스토리지 장치를 도시한 것이다. 도 3은 본 발명의 일 실시예에 따른 제어 모듈의 그래프 처리 동작을 나타낸 것이다. 도 4는 본 발명의 일 실시예에 따른 클러스터링된 그래프를 나타낸 것이다. 도 5a 및 도 5b는 본 발명의 일 실시예에 따른 제어 모듈의 저장 동작을 설명하기 위한 것이다. 도 6 및 도 7은 일 실시예에 따른 NVM의 리드 동작을 설명하기 위한 것이다. 도 8은 본 발명의 일 실시예에 따른 제어 모듈의 저장 동작을 설명하기 위한 것이다. 도 9는 본 발명의 일 실시예에 따른 제어 모듈의 GNN에 따른 동작들을 설명하기 위한 것이다. 도 10은 본 발명의 일 실시예에 따른 연산 스토리지 장치의 동작 방법의 순서도이다. 도 11은 본 발명의 다른 일 실시예에 따른 연산 스토리지 장치의 동작 방법의 순서도이다. 도 12는 본 발명의 다른 일 실시예에 따른 연산 스토리지 장치의 동작 방법의 순서도이다. 도 13은 본 발명의 다른 실시예에 따른 연산 스토리지 장치를 나타낸 것이다. 도 14는 본 발명의 일 실시예에 따른 스토리지 시스템을 나타낸 것이다. 도 15는 본 발명의 다른 일 실시예에 따른 스토리지 시스템을 나타낸 것이다. 도 16은 본 발명의 다른 일 실시예에 따른 스토리지 시스템을 나타낸 것이다."}
