{"patent_id": "10-2022-0043497", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0144349", "출원번호": "10-2022-0043497", "발명의 명칭": "비콘을 이용한 모니터링 장치 및 방법", "출원인": "옴니시스템 주식회사", "발명자": "박혜린"}}
{"patent_id": "10-2022-0043497", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "작업자가 구비한 비콘 발신기의 식별번호 및 비콘 수신기의 수신전력강도(Received Signal StrengthIndication, RSSI)를 이용하여 복수의 비콘 수신기가 설치된 구역들 중 상기 비콘 발신기가 어디에 위치하는지추정하는 위치 추정부; 및상기 추정된 위치를 이용하여 상기 작업자에게 이상 상황이 발생되었는지 여부를 검출하는 이상 검출부;를 포함하는 모니터링 장치."}
{"patent_id": "10-2022-0043497", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,상기 이상 검출부는,상기 추정된 위치에 대한 제1 입력벡터를 생성하고, 학습된 검출모델을 통해 상기 제1 입력벡터를 분석하여 상기 작업자에게 이상 상황이 발생되었는지 여부를 검출하는 것을 특징으로 하는 모니터링 장치."}
{"patent_id": "10-2022-0043497", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2항에 있어서,상기 위치 추정부는,상기 복수의 비콘 수신기 중 수신전력강도가 가장 큰 비콘 수신기에 해당하는 구역에 상기 작업자가 위치한다고추정하는 것을 특징으로 하는 모니터링 장치."}
{"patent_id": "10-2022-0043497", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3항에 있어서,상기 위치 추정부는,상기 수신전력강도가 가장 큰 비콘 수신기가 변경되는 경우, 상기 작업자가 이동하는 것으로 판단하고, 상기 이동하는 경로를 추적하여 이동패턴을 산출하며, 상기 산출된 이동패턴을 작업자별로 관리하는 것을 특징으로 하는 모니터링 장치."}
{"patent_id": "10-2022-0043497", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4항에 있어서,상기 이상 검출부는,작업자의 이동패턴을 이용하여 제2 입력벡터를 생성하고, 상기 제1 및 제2 입력벡터를 상기 학습된 검출모델에적용하여 해당 작업자에게 이상 상황이 발생되었는지 여부를 검출하는 것을 특징으로 하는 모니터링 장치."}
{"patent_id": "10-2022-0043497", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 2항에 있어서,상기 이상 검출부는,각 작업자의 당일 작업정보를 기반으로 당일 작업경로를 예측하고, 상기 예측된 당일 작업경로를 이용하여 제3입력벡터를 생성하며, 상기 제1 및 제3 입력벡터를 상기 학습된 검출모델에 적용하여 해당 작업자에게 이상 상황이 발생되었는지 여부를 검출하는 것을 특징으로 하는 모니터링 장치.공개특허 10-2023-0144349-3-청구항 7 제 1항에 있어서,상기 이상 검출부는,상기 작업자에게 이상 상황이 발생된 것으로 판단하면 상기 작업자가 위치한 구역 및 이웃하는 구역의 비콘 수신기로 알림 메시지를 전송하는 것을 특징으로 하는 모니터링 장치."}
{"patent_id": "10-2022-0043497", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1항에 있어서,상기 수신전력강도 중 기 설정된 범위를 벗어나는 값을 노이즈(noise)라고 판단하고, 해당 값을 필터링하는 전처리부;를 더 포함하는 것을 특징으로 하는 모니터링 장치."}
{"patent_id": "10-2022-0043497", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1항에 있어서,학습용 입력벡터 및 상기 학습용 입력벡터에 대응하는 학습용 실측 출력벡터를 마련하고, 상기 학습용 입력벡터를 학습이 완료되지 않은 검출모델에 입력한 후, 상기 검출모델이 상기 학습용 입력벡터에 대해 복수의 계층 간학습이 완료되지 않은 가중치를 적용하여 복수의 연산을 수행하여 학습용 연산 출력벡터를 산출하며, 손실함수를 통해 상기 학습용 연산 출력벡터와 상기 학습용 실측 출력벡터 간의 차이를 나타내는 손실을 산출하고, 상기산출된 손실이 최소가 되도록 검출모델의 가중치를 갱신하는 학습부;를 더 포함하는 것을 특징으로 하는 모니터링 장치."}
{"patent_id": "10-2022-0043497", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "모니터링 장치가 작업자가 구비한 비콘 발신기의 식별번호 및 비콘 수신기의 수신전력강도를 이용하여 복수의비콘 수신기가 설치된 구역들 중 상기 비콘 발신기가 어디에 위치하는지 추정하는 단계; 및상기 모니터링 장치가 상기 추정된 위치를 이용하여 상기 작업자에게 이상 상황이 발생되었는지 여부를 검출하는 단계;를 포함하는 모니터링 방법."}
{"patent_id": "10-2022-0043497", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "비콘을 이용한 모니터링 장치 및 방법이 개시된다. 모니터링 장치는 작업자가 구비한 비콘 발신기의 식별번호 및 비콘 수신기의 수신전력강도(Received Signal Strength Indication, RSSI)를 이용하여 복수의 비콘 수신기가 설 치된 구역들 중 비콘 발신기가 어디에 위치하는지 추정하는 위치 추정부 및 추정된 위치를 이용하여 작업자에게 이상 상황이 발생되었는지 여부를 검출하는 이상 검출부를 포함한다."}
{"patent_id": "10-2022-0043497", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 모니터링 기술에 관한 것으로, 더욱 상세하게는 비콘 발신기의 식별번호, 배터리 잔량 및 수신전력강 도(Received Signal Strength Indication, RSSI)를 이용하여 비콘 발신기를 구비한 작업자 위치를 추정하고, 이상 상황의 발생 여부를 판단하는 비콘을 이용한 모니터링 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2022-0043497", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 실내/지하 구조물이나 고층 건물 등의 현장에서는 작업자의 위치 정보를 확보하기 위한 요구와 노력이 증 대되고 있다. 이는 위성항법장치(GPS)가 제공하는 위치를 현장 대부분에서는 확보하기 어려울 정도로 복잡한 구 조물과 실내/지하 공간으로 이루어져 있기 때문이다. 다시 말해서 터널 및 공동구 등 지하 구조물의 현장이나, 복잡하고 대형화되는 고층 건물은 지하 구조물 및 고 층 건물의 구조적 특성으로 인해 작업자의 위치 및 상태 파악, 작업 진행 상황 파악 등이 중요하다. 구체적으로 안전사고, 화재, 폭발, 지진 및 붕괴 등의 위험 상황 발생시 작업자에 대한 신속한 구조 및 지하 구조물 작업 현장에서의 안전하고 원활한 작업 진행을 위한 작업 지시와 의사소통 등을 위해 작업자의 위치 및 상태 파악, 작업 진행 상황 파악 등이 더욱더 중요하다. 그러나 작업 현장의 복잡한 구조, 소음, 진동, 분진 및 전파간섭 등의 열악한 환경으로 인해 작업자의 3차원 위 치 추적/관리 및 유/무선 통신환경 구현에 한계가 있으며, 실내 등에서는 GPS 사용이 불가능한 한계가 있다. 특 히 지하 구조물 현장을 비롯한 많은 현장에서의 사고사례는 끊임없이 발생하고 있고, 신속한 대응 및 구조가 이 루어지지 못하고 있어 많은 인명피해가 일어나고 있다. 따라서 이러한 문제를 해결할 방법이 매우 요구되는 실 정이다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국공개특허공보 제10-2018-0095261호(2018.08.27.)"}
{"patent_id": "10-2022-0043497", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 과제는 작업 현장의 작업자가 구비한 비콘 발신기로부터의 수집된 식별정보 및 배터 리 잔량과, 비콘 수신기로부터 산출된 수신신호강도를 포함한 비콘과 관련된 정보를 기반으로 해당 작업자의 위 치 및 이상상태를 모니터링하는 비콘을 이용한 모니터링 장치 및 방법을 제공하는 것이다."}
{"patent_id": "10-2022-0043497", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 과제를 해결하기 위해 본 발명에 따른 모니터링 장치는 작업자가 구비한 비콘 발신기의 식별번호 및 비콘 수신기의 수신전력강도(Received Signal Strength Indication, RSSI)를 이용하여 복수의 비콘 수신기가 설치된 구역들 중 상기 비콘 발신기가 어디에 위치하는지 추정하는 위치 추정부 및 상기 추정된 위치를 이용하여 상기 작업자에게 이상 상황이 발생되었는지 여부를 검출하는 이상 검출부를 포함한다. 또한 상기 이상 검출부는, 상기 추정된 위치에 대한 제1 입력벡터를 생성하고, 학습된 검출모델을 통해 상기 제 1 입력벡터를 분석하여 상기 작업자에게 이상 상황이 발생되었는지 여부를 검출하는 것을 특징으로 한다. 또한 상기 위치 추정부는, 상기 복수의 비콘 수신기 중 수신전력강도가 가장 큰 비콘 수신기에 해당하는 구역에 상기 작업자가 위치한다고 추정하는 것을 특징으로 한다. 또한 상기 위치 추정부는, 상기 수신전력강도가 가장 큰 비콘 수신기가 변경되는 경우, 상기 작업자가 이동하는 것으로 판단하고, 상기 이동하는 경로를 추적하여 이동패턴을 산출하며, 상기 산출된 이동패턴을 작업자별로 관 리하는 것을 특징으로 한다. 또한 상기 이상 검출부는, 작업자의 이동패턴을 이용하여 제2 입력벡터를 생성하고, 상기 제1 및 제2 입력벡터 를 상기 학습된 검출모델에 적용하여 해당 작업자에게 이상 상황이 발생되었는지 여부를 검출하는 것을 특징으 로 한다. 또한 상기 이상 검출부는, 각 작업자의 당일 작업정보를 기반으로 당일 작업경로를 예측하고, 상기 예측된 당일 작업경로를 이용하여 제3 입력벡터를 생성하며, 상기 제1 및 제3 입력벡터를 상기 학습된 검출모델에 적용하여 해당 작업자에게 이상 상황이 발생되었는지 여부를 검출하는 것을 특징으로 한다. 또한 상기 이상 검출부는, 상기 작업자에게 이상 상황이 발생된 것으로 판단하면 상기 작업자가 위치한 구역 및 이웃하는 구역의 비콘 수신기로 알림 메시지를 전송하는 것을 특징으로 한다. 또한 상기 수신전력강도 중 기 설정된 범위를 벗어나는 값을 노이즈(noise)라고 판단하고, 해당 값을 필터링하 는 전처리부를 더 포함하는 것을 특징으로 한다. 또한 학습용 입력벡터 및 상기 학습용 입력벡터에 대응하는 학습용 실측 출력벡터를 마련하고, 상기 학습용 입 력벡터를 학습이 완료되지 않은 검출모델에 입력한 후, 상기 검출모델이 상기 학습용 입력벡터에 대해 복수의 계층 간 학습이 완료되지 않은 가중치를 적용하여 복수의 연산을 수행하여 학습용 연산 출력벡터를 산출하며, 손실함수를 통해 상기 학습용 연산 출력벡터와 상기 학습용 실측 출력벡터 간의 차이를 나타내는 손실을 산출하 고, 상기 산출된 손실이 최소가 되도록 검출모델의 가중치를 갱신하는 학습부를 더 포함하는 것을 특징으로 한 다.본 발명에 따른 모니터링 방법은 모니터링 장치가 작업자가 구비한 비콘 발신기의 식별번호 및 비콘 수신기의 수신전력강도를 이용하여 복수의 비콘 수신기가 설치된 구역들 중 상기 비콘 발신기가 어디에 위치하는지 추정 하는 단계 및 상기 모니터링 장치가 상기 추정된 위치를 이용하여 상기 작업자에게 이상 상황이 발생되었는지 여부를 검출하는 단계를 포함한다."}
{"patent_id": "10-2022-0043497", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따르면 각 작업자에 구비된 비콘 발신기와 복수의 구역별로 설치된 비콘 수신기 간의 수신 전력강도를 이용하여 비콘 발신기의 위치를 추정함으로써, 최소 정보만으로 해당 작업자의 위치를 추정하여 유 지보수 비용을 절감할 수 있다. 또한 학습된 검출모델에 추정된 위치를 적용하여 해당 작업자에게 이상이 발생되었는지 여부를 검출할 수 있다."}
{"patent_id": "10-2022-0043497", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참고로 하여 본 발명의 실시예에 대하여 본 발명이 속하는 기술 분야에서 통상의 지 식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현 될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위 해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 본 명세서 및 도면(이하 '본 명세서')에서, 동일한 구성요소에 대해서 중복된 설명은 생략한다. 또한 본 명세서에서, 어떤 구성요소가 다른 구성요소에 '연결되어' 있다거나 '접속되어' 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존 재할 수도 있다고 이해되어야 할 것이다. 반면에 본 명세서에서, 어떤 구성요소가 다른 구성요소에 '직접 연결 되어' 있다거나 '직접 접속되어' 있다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되 어야 할 것이다. 또한, 본 명세서에서 사용되는 용어는 단지 특정한 실시예를 설명하기 위해 사용되는 것으로써, 본 발명을 한정 하려는 의도로 사용되는 것이 아니다. 또한 본 명세서에서, 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 또한 본 명세서에서, '포함하다' 또는 '가지다' 등의 용어는 명세서에 기재된 특징, 숫자, 단계, 동작, 구성요 소, 부품, 또는 이들을 조합한 것이 존재함을 지정하려는 것일 뿐, 하나 또는 그 이상의 다른 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이 해되어야 할 것이다. 또한 본 명세서에서, '및/또는' 이라는 용어는 복수의 기재된 항목들의 조합 또는 복수의 기재된 항목들 중의 어느 항목을 포함한다. 본 명세서에서, 'A 또는 B'는, 'A', 'B', 또는 'A와 B 모두'를 포함할 수 있다. 또한 본 명세서에서, 본 발명의 요지를 흐리게 할 수 있는 공지 기능 및 구성에 대한 상세한 설명은 생략될 것 이다. 도 1은 본 발명의 실시예에 따른 모니터링 시스템을 설명하기 위한 구성도이고, 도 2는 본 발명의 실시예에 따 른 모니터링 시스템의 구조를 설명하기 위한 도면이다. 도 1 및 도 2를 참조하면, 모니터링 시스템은 작업 현장의 작업자가 구비한 비콘 발신기로부터의 수집된 식별정보 및 배터리 잔량과, 비콘 수신기로부터 산출된 수신신호강도(Received Signal Strength Indication, RSSI)를 포함한 비콘과 관련된 정보를 기반으로 해당 작업자의 위치 및 이상상태를 모니터링한다. 여기서 작업 현장은 실내/지하 구조물이나 고층 건물, 선박, 병원, 재난현장, 터널, 갱도 등을 포함할 수 있다. 모니터링 시 스템은 모니터링 장치, 비콘 발신기 및 비콘 수신기를 포함하고, 관리자 단말을 더 포함할 수 있다. 비콘 발신기는 작업 현장의 작업자가 구비한 발신기이다. 비콘 발신기는 다양한 형태로 작업자 가 구비할 수 있도록 한다. 예를 들어 비콘 발신기는 카드, 단말 등과 같은 형태로 작업자의 주 머니 속에 넣어지거나, 시계, 목걸이, 안전모 등과 같은 형태인 웨어러블 디바이스로 형성될 수 있으나, 이에 한정하지 않는다. 비콘 발신기는 실시간 또는 기 설정된 주기마다 비콘 신호를 송신하고, 브로드캐스트 (broadcast) 방식으로 비콘 신호를 송신하여 적어도 하나의 비콘 수신기가 송신된 비콘 신호를 수신하도록 할 수 있다. 이때 비콘 발신기는 자가망을 통해 비콘 수신기와 통신을 수행하고, 주파수 특성 및 출 력 조절을 통해 상황에 맞는 위치 정밀도를 조절한다. 예를 들면 비콘 발신기는 주파수 범위를 낮은 주파수로 조절하여 비콘 신호의 높은 투과율을 기반으로 저 해상도이지만 광역 범위에 대한 위치 추적을 할 수 있도록 하고, 주파수 범위를 높은 주파수로 조절하여 좁은 범위이지만 고해상도의 위치 추적을 할 수 있도록 한다. 또한 비콘 발신기는 출력 레벨을 낮게 조절하여 좁은 범위지만 고해상도의 위치 추적을 할 수 있도록 하고, 출력 레벨을 높게 조절하여 저해상도이지만 광역 범 위에 대한 위치 추적을 할 수 있도록 한다. 여기서 비콘 신호는 비콘 발신기의 식별번호 및 해당 비콘 발신기의 배터리 잔량에 대한 정보를 포함한다. 비콘 수신기는 비콘 발신기로부터 브로드캐스트 방식으로 송신된비콘신호를 수신하는 수신기이다. 비 콘 수신기는 작업 현장을 기 설정된 기준에 따라 구분한 구역별로 적어도 하나를 설치할 수 있다. 예를 들 면 비콘 수신기는 A구역에 설치된 제1 비콘 수신기(300a), B구역에 설치된 제2 비콘 수신기(300b), C구역 에 설치된 제3 비콘 수신기(300c), D구역에 설치된 제4 비콘 수신기(300d), E구역에 설치된 제5 비콘 수신기 (300e), F구역에 설치된 제6 비콘 수신기(300f), G구역에 설치된 제7 비콘 수신기(300g), H구역에 설치된 제8 비콘 수신기(300h), I구역에 설치된 제9 비콘 수신기(300i), J구역에 설치된 제10 비콘 수신기(300j), K구역에 설치된 제11 비콘 수신기(300k), L구역에 설치된 제12 비콘 수신기(300l)를 포함한다. 여기서 도면에는 작업 현 장을 12구역으로 나눈 것으로 도시하고 있으나, 이에 한정하지 않는다. 각 비콘 수신기(300a~300l)는 비콘 신호 를 수신하면 수신된 비콘 신호에 대한 수신전력강도를 산출한다. 수신전력강도는 비콘 신호를 송신한 위치가 가 까울수록 값의 크기가 클 수 있다. 각 비콘 수신기(300a~300l)는 산출된 수신전력강도와 비콘 발신기의 식 별번호 및 배터리 잔량이 포함된 비콘과 관련된 정보를 모니터링 장치로 전송한다. 모니터링 장치는 작업자의 위치 및 이상 여부를 모니터링한다. 모니터링 장치는 복수의 작업자 에 대한 모니터링을 개별적으로 수행할 수 있다. 이를 위해 모니터링 장치는 비콘 발신기로부터 송신 된 비콘 신호에 대한 비콘 수신기의 수신신호강도를 기반으로 작업자의 위치를 추정할 수 있으며, 인 공지능 기술에 의해 학습된 검출모델을 이용하여 작업자의 이상 여부를 검출할 수 있다. 여기서 이상 상황 은 작업자의 움직임이 일정시간 이상 멈추어 있는 경우, 작업자가 지정된 작업구역을 이탈한 경우, 작업자의 이동이 비연속적인 경우 등을 포함한다. 모니터링 장치는 작업자에 이상 상황이 발생 되었다고 판단하면 이상 발생 알림 메시지를 비콘 수신기 및 관리자 단말 중 적어도 하나로 전송할 수 있다. 관리자 단말는 관리자가 사용하는 단말로써, 모니터링 정보를 출력한다. 이를 통해 관리자 단말는 관 리자가 작업자들을 실시간으로 모니터링할 수 있도록 한다. 여기서 모니터링 정보는 각 작업자의 현재 위 치, 이동경로, 당일 작업정보, 이상 상황 여부 등을 포함할 수 있다. 모니터링 시스템은 모니터링 장치, 비콘 수신기 및 관리자 단말 사이에 통신망을 구 축하여 서로 간의 통신이 이루어지도록 지원한다. 통신망은 백본망과 가입자망으로 구성될 수 있다. 백본망은 X.25 망, Frame Relay 망, ATM망, MPLS(Multi Protocol Label Switching) 망 및 GMPLS(Generalized Multi Protocol Label Switching) 망 중 하나 또는 복수의 통합된 망으로 구성될 수 있다. 가입자망은 FTTH(Fiber To The Home), ADSL(Asymmetric Digital Subscriber Line), 케이블망, 지그비(zigbee), 블루투스 (bluetooth), Wireless LAN(IEEE 802.11b, IEEE 802.11a, IEEE 802.11g, IEEE 802.11n), Wireless Hart(ISO/IEC62591-1), ISA100.11a(ISO/IEC 62734), CoAP(Constrained Application Protocol), MQTT(Message Queuing Telemetry Transport), WIBro(Wireless Broadband), Wimax, 3G, HSDPA(High Speed Downlink Packet Access), 4G 및 5G일 수 있다. 일부 실시예로, 통신망은 인터넷망일 수 있고, 이동 통신망일 수 있다. 또 한 통신망은 기타 널리 공지되었거나 향후 개발될 모든 무선통신 또는 유선통신 방식을 포함할 수 있다. 도 3은 본 발명의 실시예에 따른 모니터링 장치를 설명하기 위한 블록도이고, 도 4는 본 발명의 실시예에 따른 이상 검출을 위한 검출모델의 구성을 설명하기 위한 도면이며, 도 5는 도 4의 검출모델에 대한 노드를 설명하기 위한 도면이다. 도 1 내지 도 5를 참조하면, 모니터링 장치는 위치 추정부 및 이상 검출부를 포함하고, 학습부 및 전처리부를 더 포함할 수 있다. 학습부는 검출모델(DM)을 학습한다. 즉 학습부는 작업자의 이상 상황 여부를 검출하기 위한 검출모델 (DM)을 학습한다. 여기서 검출모델(DM)은 인공신경망이고, 다층퍼셉트론(Multilayer Perceptron, MLP)이 될 수 있으나, 이에 한정하지 않는다. 이러한 검출모델(DM)은 복수의 계층(IL, HL, OL)을 포함한다. 이러한 복수의 계 층은 입력층(IL), 복수의 은닉 계층(HL1 내지 HLk, HL) 및 출력층(OL)을 포함한다. 또한 복수의 계층(IL, HL, OL) 각각은 복수의 노드를 포함한다. 예를 들면 입력층(IL)은 n개의 입력노드(i1 ~ in)를 포함하며, 출력층(OL)은 1개의 출력노드(o)를 포함할 수 있다. 또한, 은닉층(HL) 중 제1 은닉계층(HL1)은 a개의 노드(h11 ~ h1a)를 포함하고, 제2 은닉계층(HL2)은 b개의 노드(h21 ~ h2b)를 포함하고, 제k 은닉계층 (HLk)은 c개의 노드(hk1 ~ hkc)를 포함할 수 있다. 복수의 계층의 복수의 노드 모두는 연산을 가진다. 특히 서로 다른 계층의 복수의 노드는 가중치(W: weight)를 가지는 채널(점선으로 표시)로 연결된다. 다른 말로, 어느 하나의 노드의 연산 결과는 가중치가 적용되어 다음 계층 노드의 입력이 된다. 한편, 도 5에 본 발명의 실시예에 따른 노드(h)가 도시되었다. 이러한 노드(h)는 검출모델(DM)의 어느 하나의 노드가 될 수 있다. 노드(h)는 입력된 신호 x=[x1, x2, …, xn]에 가중치 w=[w1, w2, …, wn]를 적용한 후, 그 결과에 함수 F를 취한다. 여기서, 함수 F는 활성화 함수(activation function)이다. 활성화함수는 시그모이드 (Sigmoid), 하이퍼볼릭탄젠트(tanh: Hyperbolic tangent), ELU(Exponential Linear Unit), ReLU(Rectified Linear Unit), Leakly ReLU, Maxout, Minout, Softmax 등을 예시할 수 있다. 이러한 활성화함수 중 어느 하나 를 선택하여 사용할 수 있다. 각 노드의 출력은 다음의 [수학식 1]과 같다. 수학식 1"}
{"patent_id": "10-2022-0043497", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기서 설명되지 않은 파라미터 중 b는 임계치이며, 이러한 임계치는 [수학식 1]에서 의 값이 임 계치 보다 작을 때 해당 노드가 활성화되지 않도록 하는 역할을 한다. [수학식 1]에 따르면 입력이 동일한 경우에도, 출력은 가중치(W)에 따라 다른 값이 된다. 예를 들면 노드(h)의 이전 계층의 노드가 3개라고 가정한다. 이에 따라, 해당 노드에 대해 3개의 입력(n=3) X1, X2, X3과 3개의 가중 치 W1, W2, W3이 존재한다. 노드(h)는 3개의 입력 X1, X2, X3에 대응하는 가중치 W1, W2, W3을 곱한 값을 입력받고, 모두 합산한 후, 합산된 값을 활성화 함수에 대입하여 출력을 산출한다. 구체적으로, 입력 x=[X1, X2, X3] = 0.5, -0.3, 0이라고 가정하고, 가중치 w=[W1, W2, W3] = 4, 5, 2라고 가정한다. 또한, 설명의 편의를 위하여 전달 함수는 ‘sgn()’이라고 가정하면, 다음과 같이 출력값이 산출된다. x1 × w1 = 0.5 × 4 = 2 x2 × w2 = - 0.3 × 5 = -1.5 x3 × w3 = 0 × 2 = 0 2 + (-1.5) + 0 = 0.5 sgn(0.5) = 1 이와 같이, 검출모델(DM) 중 어느 하나의 노드는 이전 계층의 노드값에 가중치를 적용한 값을 입력받고, 이를 합산하여 활성화함수에 따라 연산을 수행하고, 이러한 결과를 다음 계층의 입력으로 전달한다. 정리하면 학습부는 학습이 완료되지 않은 검출모델(DM)에 학습용 입력벡터를 포함하는 학습 데이터를 적용 하여 복수의 계층 간 가중치가 적용되는 연산을 수행한 후, 학습용 연산 출력값을 산출하고, 산출된 학습용 연 산 출력값과 학습용 입력벡터에 대응하는 학습용 출력벡터의 차이를 최소가 되도록 검출모델(DM)의 파라미터를 갱신하여 모델을 최적화한다. 전처리부는 비콘 수신기로부터 수신된 비콘과 관련된 정보를 전처리한다. 전처리부는 추후 수행될 작업자의 위치 추정 및 이상 상황 여부 검출을 원활하게 이루어지도록 데이터를 전처리할 수 있다. 전처리 부는 각 비콘 발신기의 식별정보를 기반으로 비콘 발신기별로 데이터를 분류할 수 있다. 또한 전 처리부는 수신전력강도 중 기 설정된 범위를 벗어나는 값을 노이즈(noise)라고 판단하고, 해당 값을 필터링 한다. 여기서 전처리부는 밴드 패스 필터(band-pass filter)를 이용하여 필터링을 할 수 있다. 위치 추정부는 작업자가 구비한 비콘 발신기의 식별번호 및 비콘 수신기의 수신전력강도를 이용 하여 복수의 비콘 수신기가 설치된 구역들 중 비콘 발신기가 어디에 위치하는지 추정한다. 이때 위치 추정부는 복수의 비콘 수신기 중 수신전력강도가 가장 큰 비콘 수신기에 해당하는 구역에 작업자(60 0)가 위치한다고 추정한다. 예를 들면, 제1 비콘 수신기(300a)로부터 수신된 수신전력강도가 -70이고, 제2 비콘 수신기(300b)로부터 수신된 수신전력강도가 -85이며, 제3 비콘 수신기(300c)로부터 수신된 수신전력강도가 -100 이고, 제5 비콘 수신기(300e)로부터 수신된 수신전력강도가 -80이며, 제6 비콘 수신기(300f)로부터 수신된 수신 전력강도가 -85인 경우, 위치 추정부는 제1 비콘 수신기(300a)가 위치한 A구역에 작업자이 위치하는 것으로 추정할 수 있다. 바람직하게는 위치 추정부는 수신전력강도를 기반으로 작업자가 A구역 중에서 도 E구역에 가까운 위치에 있는 것으로 추정할 수 있다. 여기서 위치 추정부는 수신전력강도가 가장 큰 비콘 수신기가 변경되는 경우, 작업자가 이동하는 것으 로 판단하고, 작업자의 이동하는 경로를 추적한다. 위치 추정부는 추적된 이동하는 경로를 이용하여 작업자의 이동패턴을 산출한다. 위치 추정부는 산출된 이동패턴을 작업자별로 관리하도록 관련 정보를 개별 저장시킨다. 이때 위치 추정부는 비콘 발신기의 배터리 잔량, 시간, 날씨 등과 같은 상황정보와 이동하는 경로를 매칭시켜 분석할 수 있다. 이를 통해 위치 추정부는 단순히 작업자가 이동하는 경로 만으로 이동패턴을 산출하는 것이 아니라, 작업자의 현재 상황과 이동하는 경로의 상관관계를 통해 작업자 별 이동패턴을 산출할 수 있다. 이상 검출부는 위치 추정부로부터 추정된 위치에 대한 제1 입력벡터를 생성한다. 이상 검출부는 작 업자의 이동패턴을 이용하여 제2 입력벡터를 생성할 수 있다. 즉 이상 검출부는 이동패턴을 이용하여 제2 입력벡터를 생성함으로써, 각 작업자마다의 성향, 습관 등이 개인별 특성을 반영된 제2 입력벡터를 생성할 수 있다. 또한 이상 검출부는 각 작업자의 당일 작업정보를 기반으로 당일 작업경로를 예측하고, 예측된 당 일 작업경로를 이용하여 제3 입력벡터를 생성할 수 있다. 여기서 당일 작업정보는 오늘 수행해야 하는 작업의 종류와 관련된 정보로써, 예를 들면 건설현장 A구역에서 미장 공사, 선박 C구역에서 용접 작업 등을 포함할 수 있다. 이상 검출부는 제1 내지 제3 입력벡터 중 적어도 하나를 학습부로부터 학습된 검출모델(DM)에 적 용하여 해당 작업자에게 이상 상황이 발생되었는지 여부를 검출한다. 여기서 이상 상황은 작업자의 움직임 이 일정시간 이상 멈추어 있는 경우, 작업자가 지정된 작업구역을 이탈한 경우, 작업자의 이동이 비 연속적인 경우 등을 포함한다. 상세하게는 제1 내지 제3 입력벡터 중 적어도 하나가 검출모델(DM)의 입력층(IL)의 복수의 입력노드(i1 ~ in)에 입력되면 제1 은닉층(HL1)의 복수의 제1 은닉노드(h11 ~ h1a) 각각은 복수의 입력노드(i1 ~ in)의 입력벡터에 가중치가 적용된 값을 입력받고(점선으로 표시), 입력된 값을 모두 합산한 후, 합산된 값에 대해 활성화함수에따른 연산을 수행하여 복수의 제1 은닉노드값을 산출한다. 이어서 제2 은닉층(HL2)의 복수의 제2 은닉노드(h21 ~ h2b) 각각은 복수의 제1 은닉노드(h11 ~ h1a)의 복수의 제1 은닉노드값 각각에 가중치가 적용된 값을 입력받 고(점선으로 표시), 입력된 값을 모두 합산하며, 합산된 값에 대해 활성화함수에 따른 연산을 수행하여 복수의 제2 은닉노드값을 산출한다. 이와 같은 방식으로 은닉층(HL) 내에서 이전의 노드값이 가중치가 적용되어 전달되 고, 연산을 통해 현재의 노드값이 산출된다. 이러한 과정을 반복하여, 제k 은닉계층(HLk)의 복수의 제k 은닉노 드(hk1 ~ hkc)의 복수의 제k 은닉노드값을 산출할 수 있다. 그러면 출력노드(o) 각각은 제k 은닉계층(HLk)의 복 수의 제k 은닉노드(hk1 ~ hkc)의 복수의 제k 은닉노드값에 가중치 w=[w1, w2, …, wc×2]가 적용된 값을 입력받 고(점선으로 표시), 입력된 값을 모두 합산한 후, 합산된 값에 대해 활성화함수에 따른 연산을 수행하여 출력값 을 산출한다. 출력층(OL)의 출력노드(o)의 출력값은 입력된 제1 내지 제3 입력벡터 중 적어도 하나에 대응하는 작업자의 이상 상황 발생 확률을 나타낸다. 예를 들면 출력노드(o)의 출력값이 0.841이면 입력벡터에 대응하는 작업자의 이상 상황 발생 확률이 84%이다. 이와 같이 검출모델(DM)이 확률(0.841)을 출력하면 이상 검출부는 해당 확률에 따라 입력벡터에 대응하는 작업자의 이상 상황을 판단한다. 이때 검출부는 출력된 확률이 70% 내지 90% 이 상인 경우, 해당 작업자에게 이상이 발생한 것으로 판단할 수 있다. 한편 이상 검출부는 작업자에 이상 상황이 발생되었다고 판단하면 작업자가 위치한 구역(A구역) 및 이웃하는 구역(B구역, E구역, F구역)의 수신기(300a, 300c, 300e, 300f)로 알림 메시지를 전송할 수 있다. 또한 이상 검출부는 알림 메시지를 포함하는 모니터링 정보를 관리자 단말로 전송할 수 있다. 도 6은 본 발명의 실시예에 따른 검출모델을 학습하는 방법을 설명하기 위한 순서도이다. 도 1 및 도 6을 참조하면, 모니터링 장치는 작업자의 이상 상황 검출을 하기 이전에 검출모델(DM)을 학습 시켜 이상 상황 검출에 대한 정확도를 향상시킬 수 있다. S110 단계에서, 모니터링 장치는 학습 데이터를 마련한다. 여기서 학습 데이터는 학습용 입력벡터 및 학습 용 입력벡터에 대응하는 학습용 실측 출력벡터를 포함한다. 여기서 학습용 실측 출력벡터는 학습용 입력벡터의 레이블이다. 학습용 입력벡터는 비콘 발신기로부터 발신된 비콘과 관련된 정보를 입력벡터로 변환 것이다. S120 단계에서, 모니터링 장치는 학습이 완료되지 않은 가중치를 가지는 검출모델(DM)에 학습용 입력벡터 를 입력한다. 검출모델(DM)은 인공신경망이고, 다층퍼셉트론이 될 수 있으나, 이에 한정하지 않는다. S130 단계에서, 모니터링 장치는 학습용 연산 출력벡터를 산출한다. 모니터링 장치는 학습용 입력벡 터에 대해 검출모델(DM)의 복수의 계층(IL, HL, OL) 간 학습이 완료되지 않은 가중치를 적용되는 연산을 수행하 여 학습용 연산 출력벡터를 산출한다. S140 단계에서, 모니터링 장치는 손실을 산출한다. 모니터링 장치는 학습용 연산 출력벡터와 학습용 실측 출력벡터 간의 차이를 나타내는 손실을 산출한다. 이때 모니터링 장치는 손실함수(loss function)를 이용하여 손실을 산출할 수 있다. S150 단계에서, 모니터링 장치는 최적화를 한다. 모니터링 장치는 산출된 손실이 최소가 되도록 검출모델 (DM)의 가중치를 수정하여 최적화를 수행한다. S160 단계에서, 모니터링 장치는 전술된 S120 단계 내지 S150 단계를 서로 다른 복수의 학습 데이터를 기 반으로 기 설정된 종료 조건을 만족할 때까지 반복하여 수행한다. 이러한 반복에 따라 검출모델(DM)의 가중치는 반복하여 갱신된다. 그리고 이러한 반복은 손실이 기 설정된 목표치 이하가 될 때까지 진행될 수 있다. 따라서 모니터링 장치는 손실이 기 설정된 목표치 이하인지 여부를 판별하고, 손실이 기 설정된 목표치 이하이면 검출모델(DM)에 대한 학습을 완료한다. 도 7은 본 발명의 실시예에 따른 모니터링 방법을 설명하기 위한 순서도이다. 도 1 및 도 7을 참조하면, 모니터링 방법은 각 작업자에 구비된 비콘 발신기와 복수의 구역별로 설치된 비 콘 수신기 간의 수신전력강도를 이용하여 비콘 발신기의 위치를 추정함으로써, 최소 정보만으로 해당 작업자의 위치를 추정하여 유지보수 비용을 절감할 수 있다. 또한 모니터링 방법은 학습된 검출모델에 추정된 위치를 적용하여 해당 작업자에게 이상이 발생되었는지 여부를 검출할 수 있다.S210 단계에서, 모니터링 장치는 비콘과 관련된 정보를 수집한다. 모니터링 장치는 비콘 수신기(30 0)로부터 작업자가 구비한 비콘 발신기의 식별정보, 배터리 잔량에 대한 정보 및 비콘 수신기의 수신 전력강도에 대한 정보를 수집한다. 이때 모니터링 장치는 수신된 정보에 대한 전처리를 수행할 수 있다. 전처리는 수신된 정보 중 노이즈라고 판단되는 부분을 필터링하는 과정일 수 있다. S220 단계에서, 모니터링 장치는 작업자의 위치를 추정한다. 모니터링 장치는 작업자가 구비한 비콘 발신기의 식별번호 및 비콘 수신기의 수신전력강도를 이용하여 복수의 비콘 수신기가 설치된 구 역들 중 비콘 발신기가 어디에 위치하는지 추정한다. 이때 모니터링 장치는 복수의 비콘 수신기 중 수신전력강도가 가장 큰 비콘 수신기에 해당하는 구역에 작업자가 위치한다고 추정한다. S230 단계에서, 모니터링 장치는 입력벡터를 생성한다. 모니터링 장치는 추정된 위치에 대한 제1 입 력벡터를 생성한다. 모니터링 장치는 작업자의 이동패턴을 이용하여 제2 입력벡터를 생성할 수 있다. 즉 모니터링 장치는 이동패턴을 이용하여 제2 입력벡터를 생성함으로써, 각 작업자마다의 성향, 습관 등이 개 인별 특성이 반영된 제2 입력벡터를 생성할 수 있다. 또한 모니터링 장치는 각 작업자의 당일 작업정보를 기반으로 당일 작업경로를 예측하고, 예측된 당일 작업경로를 이용하여 제3 입력벡터를 생성할 수 있다. 여기서 당일 작업정보는 오늘 수행해야 하는 작업의 종류와 관련된 정보일 수 있다. S240 단계에서, 모니터링 장치는 이상 상황 여부를 검출한다. 모니터링 장치는 생성된 제1 내지 제3 입력벡터 중 적어도 하나를 학습된 검출모델(DM)에 적용하여 해당 작업자에게 이상 상황이 발생되었는지 여부를 검출한다. 여기서 이상 상황은 작업자의 움직임이 일정시간 이상 멈추어 있는 경우, 작업자가 지정된 작업구역 을 이탈한 경우, 작업자의 이동이 비연속적인 경우 등을 포함한다. 도 8은 본 발명의 실시예에 따른 컴퓨팅 장치를 설명하기 위한 블록도이다. 도 8의 컴퓨팅 장치(TN100)는 본 명세서에서 기술된 장치(예, 모니터링 장치, 관리자 단말 등) 일 수 있다. 컴퓨팅 장치(TN100)는 적어도 하나의 프로세서(TN110), 송수신 장치(TN120), 및 메모리(TN130)를 포함할 수 있 다. 또한, 컴퓨팅 장치(TN100)는 저장 장치(TN140), 입력 인터페이스 장치(TN150), 출력 인터페이스 장치 (TN160) 등을 더 포함할 수 있다. 컴퓨팅 장치(TN100)에 포함된 구성 요소들은 버스(bus)(TN170)에 의해 연결 되어 서로 통신을 수행할 수 있다. 프로세서(TN110)는 메모리(TN130) 및 저장 장치(TN140) 중에서 적어도 하나에 저장된 프로그램 명령(program command)을 실행할 수 있다. 프로세서(TN110)는 중앙 처리 장치(CPU: central processing unit), 그래픽 처리 장치(GPU: graphics processing unit), 또는 본 발명의 실시예에 따른 방법들이 수행되는 전용의 프로세서를 의 미할 수 있다. 프로세서(TN110)는 본 발명의 실시예와 관련하여 기술된 절차, 기능, 및 방법 등을 구현하도록 구성될 수 있다. 프로세서(TN110)는 컴퓨팅 장치(TN100)의 각 구성 요소를 제어할 수 있다. 메모리(TN130) 및 저장 장치(TN140) 각각은 프로세서(TN110)의 동작과 관련된 다양한 정보를 저장할 수 있다. 메모리(TN130) 및 저장 장치(TN140) 각각은 휘발성 저장 매체 및 비휘발성 저장 매체 중에서 적어도 하나로 구 성될 수 있다. 예를 들어, 메모리(TN130)는 읽기 전용 메모리(ROM: read only memory) 및 랜덤 액세스 메모리 (RAM: random access memory) 중에서 적어도 하나로 구성될 수 있다. 송수신 장치(TN120)는 유선 신호 또는 무선 신호를 송신 또는 수신할 수 있다. 송수신 장치(TN120)는 네트워크 에 연결되어 통신을 수행할 수 있다. 한편, 본 발명의 실시예는 지금까지 설명한 장치 및/또는 방법을 통해서만 구현되는 것은 아니며, 본 발명의 실 시예의 구성에 대응하는 기능을 실현하는 프로그램 또는 그 프로그램이 기록된 기록 매체를 통해 구현될 수도 있으며, 이러한 구현은 상술한 실시예의 기재로부터 본 발명이 속하는 기술 분야의 통상의 기술자라면 쉽게 구 현할 수 있는 것이다. 이상에서 본 발명의 실시예에 대하여 상세하게 설명하였지만 본 발명의 권리범위는 이에 한정되는 것은 아니고 다음의 청구범위에서 정의하고 있는 본 발명의 기본 개념을 이용한 통상의 기술자의 여러 변형 및 개량 형태 또한 본 발명의 권리범위에 속하는 것이다."}
{"patent_id": "10-2022-0043497", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 모니터링 시스템을 설명하기 위한 구성도이다. 도 2는 본 발명의 실시예에 따른 모니터링 시스템의 구조를 설명하기 위한 도면이다. 도 3은 본 발명의 실시예에 따른 모니터링 장치를 설명하기 위한 블록도이다. 도 4는 본 발명의 실시예에 따른 이상 검출을 위한 검출모델의 구성을 설명하기 위한 도면이다. 도 5는 도 4의 검출모델에 대한 노드를 설명하기 위한 도면이다. 도 6은 본 발명의 실시예에 따른 검출모델을 학습하는 방법을 설명하기 위한 순서도이다. 도 7은 본 발명의 실시예에 따른 모니터링 방법을 설명하기 위한 순서도이다. 도 8은 본 발명의 실시예에 따른 컴퓨팅 장치를 설명하기 위한 블록도이다."}
