{"patent_id": "10-2022-7031201", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0137753", "출원번호": "10-2022-7031201", "발명의 명칭": "신경외과 및 정형외과적 척추 및 뇌 수술을 시뮬레이팅하기 위한 방법 및 어레인지먼트", "출원인": "리얼리스츠 트레이닝 테크놀로지스 게엠베하", "발명자": "베르날 베라, 루이스, 엔리케"}}
{"patent_id": "10-2022-7031201", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "신경외과 및 정형외과적 척추 및 뇌 수술을 시뮬레이팅(simulate)하기 위한 방법으로서,해부학적 구조 형성 모델(model) 구조들이 제공되며,상기 모델 구조들은 수술에 의해 치료될 장기들 또는 장기 성분들을 광학적으로 그리고 햅틱으로(haptically)그리고 기능적으로 모델링하고, 외과 수술들의 시뮬레이션(simulation)들을 수행하기 위해 사용되고,수술 시뮬레이션의 파라미터, 이를테면 압력, 정확도, 장력, 포지션 및/또는 강도가 센서에 의해 등록되고 시뮬레이션 결과에 할당되어 저장되며, 상기 시뮬레이션 결과는 요청 시 준비된 형태로 출력되는 것을 특징으로 하는, 신경외과 및 정형외과적 척추 및 뇌 수술을 시뮬레이팅하기 위한 방법."}
{"patent_id": "10-2022-7031201", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 파라미터는 상기 모델 구조들 중 적어도 하나에 의해 등록되는 것을 특징으로 하는, 신경외과 및 정형외과적 척추 및 뇌 수술을 시뮬레이팅하기 위한 방법."}
{"patent_id": "10-2022-7031201", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항 또는 제2항에 있어서,상기 파라미터는 상기 파라미터의 발생의 타임스탬프(timestamp)와 함께 저장되는 것을 특징으로 하는, 신경외과 및 정형외과적 척추 및 뇌 수술을 시뮬레이팅하기 위한 방법."}
{"patent_id": "10-2022-7031201", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 파라미터는 파라미터 시퀀스(sequence)로서 저장되는 것을 특징으로 하는, 신경외과 및 정형외과적 척추및 뇌 수술을 시뮬레이팅하기 위한 방법."}
{"patent_id": "10-2022-7031201", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항 내지 제4항 중 어느 한 항에 있어서,상기 파라미터들 중 적어도 하나는 광학 레코딩(recording)에 의해 등록되는 것을 특징으로 하는, 신경외과 및정형외과적 척추 및 뇌 수술을 시뮬레이팅하기 위한 방법."}
{"patent_id": "10-2022-7031201", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항 내지 제5항 중 어느 한 항에 있어서,상기 센서들 중 하나는 모델링된 신경 구조들에 제공되거나 모델링된 신경 구조들에 연결되는 것을 특징으로 하는, 신경외과 및 정형외과적 척추 및 뇌 수술을 시뮬레이팅하기 위한 방법."}
{"patent_id": "10-2022-7031201", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항 내지 제6항 중 어느 한 항에 있어서,상기 센서들 중 하나는 근육 구조들, 인대들 및/또는 근막들에 제공되거나 근육 구조들, 인대들 및/또는 근막들에 연결되며, 합병증들 및 출혈, 응고 및 지혈을 측정할 파라미터가 결정되는 것을 특징으로 하는, 신경외과 및정형외과적 척추 및 뇌 수술을 시뮬레이팅하기 위한 방법."}
{"patent_id": "10-2022-7031201", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "공개특허 10-2022-0137753-3-신경외과 및 정형외과적 척추 및 뇌 수술을 시뮬레이팅하기 위한 어레인지먼트(arrangement)로서,제1항 내지 제7항 중 어느 한 항에 따른 방법을 수행하기 위해, 해부학적 구조들을 형성하고 수술에 의해 치료될 장기들 또는 장기 성분들을 광학적으로 그리고 햅틱으로 그리고 기능적으로 모델링하는 모델 구조들을 포함하며,상기 수술 시뮬레이션의 파라미터들을 적어도 간접적으로 등록하는 센서들은 상기 모델 구조들에 연결되고, 상기 센서들은 차례로, 상기 파라미터들을 등록, 저장 및 평가하는 프로세싱 유닛에 연결되는 것을 특징으로하는, 신경외과 및 정형외과적 척추 및 뇌 수술을 시뮬레이팅하기 위한 어레인지먼트."}
{"patent_id": "10-2022-7031201", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 모델 구조들은 플라스틱 복합체들로 구성되고 동시에 상기 센서들을 형성하는 것을 특징으로 하는, 신경외과 및 정형외과적 척추 및 뇌 수술을 시뮬레이팅하기 위한 어레인지먼트."}
{"patent_id": "10-2022-7031201", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항 또는 제9항에 있어서,상기 모델 구조들은 지능형 재료들로 구성되고 동시에 상기 센서들을 형성하는 것을 특징으로 하는, 신경외과및 정형외과적 척추 및 뇌 수술을 시뮬레이팅하기 위한 어레인지먼트."}
{"patent_id": "10-2022-7031201", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제8항 내지 제10항 중 어느 한 항에 있어서,상기 센서들 중 적어도 하나는 모델링된 신경 구조들에 배열되거나 상기 모델링된 신경 구조들에 연결되는 것을특징으로 하는, 신경외과 및 정형외과적 척추 및 뇌 수술을 시뮬레이팅하기 위한 어레인지먼트."}
{"patent_id": "10-2022-7031201", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제8항 내지 제11항 중 어느 한 항에 있어서,상기 센서들 중 적어도 하나는 모델링된 근육 구조들, 인대들 및/또는 근막들에 배열되거나 상기 모델링된 근육구조들, 상기 인대들 및/또는 상기 근막들에 연결되는 것을 특징으로 하는, 신경외과 및 정형외과적 척추 및 뇌수술을 시뮬레이팅하기 위한 어레인지먼트."}
{"patent_id": "10-2022-7031201", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제8항 내지 제12항 중 어느 한 항에 있어서,상기 센서들 중 적어도 하나는 합병증들 및/또는 출혈, 응고 및/또는 지혈을 측정하도록 설계되는 것을 특징으로 하는, 신경외과 및 정형외과적 척추 및 뇌 수술을 시뮬레이팅하기 위한 어레인지먼트."}
{"patent_id": "10-2022-7031201", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 신경외과 및 정형외과적 척추 및 뇌 수술을 시뮬레이팅하기 위한 방법 및 어레인지먼트에 관한 것으로, 그 방법은 해부학적 구조들을 형성하고 수술로 치료될 장기들 또는 장기 부분들에 대해 광학적으로, 햅 틱으로 그리고 기능적으로 모델링되는 모델 구조들이며, 이러한 모델 구조들에 의해 시뮬레이팅된 외과 수술들이 수행된다. 본 발명에 의해 해결되는 문제는 훈련을 추가로 개선하고, 그에 따라 환자 안전을 높임으로써 수술을 보다 안전하게 하는 것이다. 이는 센서에 의해 수술 시뮬레이션의 파라미터, 이를테면 압력, 정확도, 장력, 포 지션 및/또는 힘의 감지에 의해 해결되며, 파라미터는 시뮬레이션 이벤트(event)에 할당되고 그와 함께 저장되며, 이는 요청 시 프로세싱된 형태로 출력된다."}
{"patent_id": "10-2022-7031201", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 신경외과 및 정형외과적 척추 및 뇌 수술을 시뮬레이팅(simulate)하기 위한 방법에 관한 것으로, 여 기서는 해부학적 구조 형성 모델(model) 구조들이 제공되며, 상기 모델 구조들은 수술에 의해 치료될 장기들 또 는 장기 성분들을 광학적으로 그리고 햅틱으로(haptically) 그리고 기능적으로 모델링하고, 외과 수술들의 시뮬 레이션(simulation)들을 수행하기 위해 사용된다. 본 발명은 또한, 해부학적 구조들을 형성하고 수술에 의해 치료될 장기들 또는 장기 성분들을 광학적으로 그리 고 햅틱으로 그리고 기능적으로 모델링하는 모델 구조들을 포함하는, 신경외과 및 정형외과적 척추 및 뇌 수술 을 시뮬레이팅하기 위한 어레인지먼트(arrangement)에 관한 것이다. 그러므로 본 발명은 외과 의사들이 복잡한 시나리오(scenario)들을 실시할 수 있는 훈련(training) 및 시뮬레이 션 환경들에 관한 것이다."}
{"patent_id": "10-2022-7031201", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "국제적으로, 지금까지 수술 시뮬레이션 및 훈련은 일반적으로 단순한 플라스틱(plastics) 모델들을 사용하여 또 는 가상 시뮬레이션을 사용하여(대안적으로 인간 표본들을 사용하여) 수행되었다. 본 발명의 기초가 되며 RealSpine 훈련 플랫폼(platform)으로 알려진 출원인의 기술은 수년 동안 이러한 모든 기술들에 비해 두드러졌다. 출원인의 기술을 사용하여, 수술에서의 시뮬레이션 및 훈련이 3D 프린팅 (printing), 모델링 및 인공 혈액에 의해 개선될 수 있음을 보여주는 것이 이미 가능하였다. 그러나 지금까지 는 모든 원하는 시나리오들에서 참가자들의 훈련 성과를 센서(sensor)들을 통해 체계적으로 측정하는 것은 가능 하지 않았다. 장기적인 목표는 환자의 안전을 높이는 것이다. 이 경우, 본 발명의 목적은 훈련을 더 개선함으로써 수술을 보 다 안전하게 하는 것이다. 방법 측에서, 목적은 처음에 기술된 타입의 방법에 의해 달성되며, 본 발명에 따르면, 수술 시뮬레이션의 파라 미터(parameter), 이를테면 압력, 정확도, 장력, 포지션(position) 및/또는 강도가 센서에 의해 등록되고 시뮬 레이션 결과에 할당되어 저장되며, 이 시뮬레이션 결과는 요청 시 준비된 형태로 출력된다. 본 발명의 기본 개념은 모델링된 해부학적 부분들에서의 센서들의 통합에 있다. 이를 위해, 더욱이 적합한 측 정 전자 장치 및 소프트웨어(software)가 사용된다. 이를 위해, 바람직하게는, 모델 구조들 중 적어도 하나에 의해 파라미터가 등록되는 것이 제공된다. 추가적인 실시예에서, 파라미터가 그 발생의 타임스탬프(timestamp)와 함께 저장되는 것이 제공된다. 그러므로 시뮬레이션 내의 시간에 파라미터를 할당하는 것이 항상 가능하다. 특히, 그러한 \"타임스탬프\"를 사용하는 것은 파라미터가 파라미터 시퀀스(sequence)로서 저장될 수 있게 한다. 당연히, 동일한 또는 상이한 타입의 다른 파라미터들이 시간 관련 개별 값들로서 또는 마찬가지로 파라미터 시 퀀스들로서 병렬로 저장될 수 있다. 결과적으로, 값들의 준비 후에, 특정 수술 시뮬레이션 시간들에서의 파라 미터 상황은 요구될 때마다 재구성될 수 있다. 본 발명의 추가적인 실시예에서, 파라미터들 중 적어도 하나가 광학 레코딩(recording)을 통해 등록되는 것이 제공된다. 일부 상황들에서는, 순수하게 이미지(image) 또는 비디오(video) 시퀀스로부터 파라미터를 추론하는 것이 가능하다. 예로서, 적용된 기구의 경우의 해부학적 구조의 변형이 이미지에 등록될 수 있다면, 가해지는 압축력은 광학적으로 가시적인 크기 및 변형의 타입(type)으로부터 추론될 수 있다. 추가적인 변형에서, 센서들 중 하나가 모델링된 신경 구조들에 제공되거나 모델링된 신경 구조들에 연결되는 것 이 제공된다. 본 발명에 따른 방법의 추가의 실시예에서, 센서들 중 하나가 근육 구조들, 인대들 및/또는 근막들에 제공되거 나 근육 구조들, 인대들 및/또는 근막들에 연결되는 것, 그리고 합병증들 및 출혈, 응고 및 지혈을 측정할 파라 미터가 결정되는 것이 제공된다. 처음에 제시된 타입의 어레인지먼트의 경우의 문제에 대한 어레인지먼트 측 솔루션은, 수술 시뮬레이션의 파라 미터들을 적어도 간접적으로 등록하는 센서들이 모델 구조들에 연결되는 것에 있으며, 상기 센서들은 차례로, 파라미터들을 등록, 저장 및 평가하는 프로세싱 유닛(processing unit)에 연결된다. 이 점에 있어서의 일 실시예에서는, 모델 구조들이 플라스틱 복합체들로 구성되고 동시에 센서들을 형성하는 것 이 제공된다. 모델 구조들이 지능형 재료들로 구성되고 동시에 센서들을 형성하는 것이 또한 가능하다. 이는, 개입의 해부학적 구조, 햅틱들 및 광학기를 변경하지 않는 통합된 특수 센서들에 의해 달성된다. 매끄럽 게 통합된 센서 시스템(system)은 그럼에도 불구하고, 햅틱들 및 광학기들이 프로세스에서 매우 현실적인 상태 로 유지되면서, 훈련을 평가하는 것을 처음으로 가능하게 한다. 모델링 및 과학적 검증은 밀접하게 관련되며 임상 파트너(partner)들과 밀접하게 협력하여 발생한다(= 임상 검 증). 이를 위해, 본 발명은 처음으로, 시뮬레이터(simulator)들의 모델 구조들에 매끄럽게 통합되고 동시에, 수술 시 뮬레이터들에서 예상되는 매우 엄격한 햅틱 및 광학 요건들을 충족시키는 센서들의 개발을 제공한다. 지금까지, 그러한 센서들은 상업적으로 입수 가능하지 않았다. 이와 관련하여, 본 발명에 따르면, 센서들 중 적어도 하나가 모델링된 신경 구조들에 배열되거나 그에 연결되는 것이 가능하다. 다른 옵션은 센서들 중 적어도 하나가 모델링된 근육 구조들, 인대들 및/또는 근막들에 배열되거나 그에 연결되 는 것에 있다. 센서들 중 적어도 하나가 합병증들 및/또는 출혈, 응고 및/또는 지혈을 측정하도록 설계되는 것이 또한 가능하 다. 본 발명에 따른 솔루션은 예시적인 실시예에 기반하여 아래에 제시된다."}
{"patent_id": "10-2022-7031201", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "외과 의사들은 (지금까지 상상할 수 없었던) 훨씬 더 복잡하고 훨씬 더 현실적인 시뮬레이션 환경들에서 훈련하 고, 그렇게 하여, 각자의 성과를 다른 외과 의사들(특히 전문가들)의 성과와 비교하고 싶을 것이다. 이는 본 발명에 따른 통합 측정 시스템들을 필요로 한다. 센서 시스템 및 기구/조직 상호 작용의 큰 복잡성은 지금까지 전 세계적으로 어떠한 그룹에 의해서도 달성될 수 없었다. 이러한 혁신은, 수술 시뮬레이션에서의 재료들 및 재료 특성들 그리고 요구되는 기술들, 예컨대 코팅 (coating), 생성적 방법들, 첨가제들 및 기술적인 텍스타일(textile)들의 프로세싱 등과 관련하여 본 발명자들 이 갖는 경험에 의해 가능하게 된다. 도면에 도시된 바와 같이, 훈련 중인 외과 의사(수련의)가 RealSpine 시뮬레이터 상에서 수술한다. 프로 세스에서, 이들의 수술 동작들은 위에서 설명된 특수 센서들을 통해 압력, 정확도, 장력, 포지션 및/또는 강도와 같은 다양한 파라미터들에 등록된다. 이 경우, 직접 등록, 광학 레코딩(사진 기록) 또는 비디오 레코딩이 사용될 수 있다. 그 다음, 이러한 모든 결과들은 프로세싱 유닛에 함께 저장되고(결과 보고), 준비되어 출력될 수 있다. 이는 본 기술의 발명을 완성한다. 본 발명은, 평가자(인증된 평가자)가 시뮬레이팅된 수술 동작을 평가하고 궁극적으로 평가 보고를 생성 하며, 선택적으로 외과 의사의 능력들과 관련된 증명서를 생성할 수 있게 하는 기술적 수단을 상기 평가자 에게 제공한다."}
{"patent_id": "10-2022-7031201", "section": "도면", "subsection": "도면설명", "item": 1, "content": "연관된 도면은 본 발명에 따른 어레인지먼트 및 추가의 비-기술적 평가와 함께 본 발명에 따른 방법의 개요를 도시한다."}
