{"patent_id": "10-2023-7003244", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0025492", "출원번호": "10-2023-7003244", "발명의 명칭": "디스플레이, 디스플레이 디바이스, 및 디스플레이를 동작시키기 위한 방법", "출원인": "에이엠에스 인터내셔널 에이쥐", "발명자": "호프리히터, 옌스"}}
{"patent_id": "10-2023-7003244", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "디스플레이로서,복수의 제1 디스플레이 서브픽셀들을 포함하는 활성 디스플레이 영역(DA)을 갖는 디스플레이 기판(DS), 및 제1 동작 모드로 또는 제2 동작 모드로 상기 디스플레이를 구동하도록 배열된 트랜시버 회로(TC)를 포함하며,상기 제1 디스플레이 서브픽셀들은 마이크로 발광 다이오드들 및/또는 공진-캐비티 발광 디바이스들을포함하고, 상기 제1 동작 모드에서, 상기 트랜시버 회로(TC)는 상기 제1 디스플레이 서브픽셀들에 순방향 바이어스를 제공하여서, 상기 제1 디스플레이 서브픽셀들은 광을 방출하도록 동작가능하며, 그리고상기 제2 동작 모드에서, 상기 트랜시버 회로(TC)는 상기 제1 디스플레이 서브픽셀들에 역방향 바이어스를 제공하여서, 상기 제1 디스플레이 서브픽셀들은 광을 검출하도록 동작가능한, 디스플레이."}
{"patent_id": "10-2023-7003244", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서, 상기 디스플레이는 복수의 제2 디스플레이 서브픽셀들을 포함하고, 상기 제2 디스플레이 서브픽셀들은 마이크로 발광 다이오드(마이크로-LED)들을 포함하고, 상기 트랜시버 회로(TC)는 상기 제1 동작 모드 및 상기 제2 동작 모드 둘 모두에서 상기 제2 디스플레이 서브픽셀들에 동일한 바이어스를 제공하며, 그리고/또는상기 트랜시버 회로(TC)는, 상기 제1 동작 모드에서, 상기 제2 디스플레이 서브픽셀들에 순방향 바이어스를 제공하여서, 상기 순방향 바이어스가 제공된 상기 제2 디스플레이 서브픽셀들은 광을 방출하도록 동작가능하며,그리고 상기 제2 동작 모드에서, 상기 제2 디스플레이 서브픽셀들에 역방향 바이어스를 제공하여서, 상기 역방향 바이어스가 제공된 상기 제2 디스플레이 서브픽셀들은 광을 검출하도록 동작가능한, 디스플레이."}
{"patent_id": "10-2023-7003244", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서, 상기 제2 디스플레이 서브픽셀들은 상기 제1 동작 모드 및 상기 제2 동작 모드 둘 모두 동안 광의 이미터(emitter)들로서 또는 광의 검출기들로서 동작하는, 디스플레이."}
{"patent_id": "10-2023-7003244", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2 항 또는 제3 항에 있어서, 상기 트랜시버 회로(TC)는 선택가능한 전기 연결들을 통해 제1 디스플레이 픽셀 및/또는 제2 디스플레이 픽셀에전기적으로 연결되고, 상기 트랜시버 회로(TC)는, 각각, 선택가능한 전기 연결들을 선택하기 위한 하나 이상의 선택 신호들을 수신하기 위한 입력 단자를 포함하며, 그리고상기 트랜시버 회로(TC)는 상기 하나 이상의 선택 신호들에 따라 선택된 전기 연결들을 통해 순방향 바이어스,역방향 바이어스 또는 동일한 바이어스를 제공하는,공개특허 10-2023-0025492-3-디스플레이."}
{"patent_id": "10-2023-7003244", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2 항 내지 제4 항 중 어느 한 항에 있어서, 상기 활성 디스플레이 영역(DA)은 복수의 픽셀들을 포함하며, 그리고 상기 픽셀들은 적어도 하나의 제1 디스플레이 서브픽셀 및 적어도 하나의 제2 디스플레이 서브픽셀에 의해 형성되는,디스플레이."}
{"patent_id": "10-2023-7003244", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5 항에 있어서, 상기 픽셀들은 적어도 2개의 제1 디스플레이 서브픽셀들 및 적어도 하나의 제2 디스플레이 서브픽셀을포함하고, 상기 적어도 하나의 제2 디스플레이 서브픽셀은 마이크로 발광 다이오드를 포함하며, 그리고 상기 적어도 2개의 제1 디스플레이 서브픽셀들은 마이크로 발광 다이오드 및 공진-캐비티 발광 디바이스를 포함하는, 디스플레이."}
{"patent_id": "10-2023-7003244", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5 항 또는 제6 항에 있어서, 상기 디스플레이 서브픽셀들의 방출 특성 및 검출 특성은, 각각, 방출 스펙트럼 및 흡수 스펙트럼에 의해 정의되고, 상기 픽셀들은,제1 스펙트럼 특징의 적어도 하나의 제1 디스플레이 서브픽셀, 및상기 제1 스펙트럼 특징과 상이한 제2 스펙트럼 특징의 적어도 하나의 제2 디스플레이 서브픽셀을 포함하며, 그리고/또는상기 픽셀들은 제로 스펙트럼 시프트를 갖는 흡수 스펙트럼 및 방출 스펙트럼을 갖는 적어도 하나의 제1 디스플레이 서브픽셀을 포함하는,디스플레이."}
{"patent_id": "10-2023-7003244", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7 항에 있어서, 상기 픽셀들은 적어도 3개의 마이크로 발광 다이오드들, 제1 디스플레이 서브픽셀로서 구성된, 상기 제1 스펙트럼 특징의 제1 마이크로 발광 다이오드,제2 디스플레이 서브픽셀로서 구성된, 상기 제2 스펙트럼 특징의 제2 마이크로 발광 다이오드, 및 제1 디스플레이 서브픽셀로서 구성된, 제3 스펙트럼 특징의 제3 마이크로 발광 다이오드를 포함하며,상기 제3 스펙트럼 특징은 상기 제1 스펙트럼 특징 및 상기 제2 스펙트럼 특징과 상이하며; 그리고 상기 제2 스펙트럼 특징과 관련하여: 상기 제1 스펙트럼 특징은 포지티브 스펙트럼 시프트를 갖고, 그리고 상기 제3 스펙트럼 특징은 네거티브 스펙트럼 시프트를 갖는,디스플레이.공개특허 10-2023-0025492-4-청구항 9 제1 항 내지 제8 항 중 어느 한 항에 있어서, 상기 제1 동작 모드 및 상기 제2 동작 모드가 교번하여서, 상기 제1 디스플레이 서브픽셀들은 광의 이미터들 또는 광의 검출기들로서 동작하도록 교번하고, 그리고/또는 상기 제1 디스플레이 서브픽셀들은 적어도 제1 서브세트 및 제2 서브세트를 포함하여서, 상기 제2 동작 모드 동안, 상기 제1 서브세트 및 제2 서브세트로부터의 디스플레이 서브픽셀들은 광의 이미터들 또는 광의 검출기들로서 동작하도록 교번하는,디스플레이."}
{"patent_id": "10-2023-7003244", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1 항 내지 제9 항 중 어느 한 항에 있어서, 상기 트랜시버 회로(TC)는 상기 제2 동작 모드에서 디스플레이 서브픽셀들에 의해 생성된 센서 신호들을 수신및 출력하도록 배열되는, 디스플레이."}
{"patent_id": "10-2023-7003244", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1 항 내지 제10 항 중 어느 한 항에 있어서, 적어도 하나의 공진-캐비티 발광 디바이스는 상기 마이크로 발광 다이오드들의 흡수 대역에서의 부가적인 흡수를 위해 배열된 고 Q 공진기(high Q resonator)를 포함하는, 디스플레이."}
{"patent_id": "10-2023-7003244", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1 항 내지 제11 항 중 어느 한 항에 있어서, 상기 공진-캐비티 발광 디바이스들은,수직-캐비티 표면-발광 레이저(VCSEL: vertical-cavity surface-emitting laser),마이크로디스크 레이저,공진 캐비티 발광 다이오드, 및분산 피드백 레이저(DFB: distributed feedback laser) 중 적어도 하나를 포함하는,디스플레이."}
{"patent_id": "10-2023-7003244", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "디스플레이 디바이스로서,제1 항 내지 제12 항 중 어느 한 항에 따른 디스플레이, 및호스트 시스템을 포함하며, 호스트 시스템들은,모바일 폰, 스마트 폰, 스마트 워치, 인공 현실 또는 가상 현실 가능 디바이스와 같은 모바일 디바이스, 랩톱, 태블릿, 이어버드(earbud)와 같은 소비자 전자장치,첨단 운전자 보조 시스템(ADAS: Advanced Driver Assistance System),의료 디바이스, 및/또는공개특허 10-2023-0025492-5-휴먼 인터페이스 디바이스 중 하나를 포함하는,디스플레이 디바이스."}
{"patent_id": "10-2023-7003244", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13 항에 있어서, 상기 제2 동작 모드에서, 상기 디스플레이는,주변 광 센서,근접 센서,거리 센서,지문 센서, 및/또는제스처 센서로서 동작가능한,디스플레이 디바이스."}
{"patent_id": "10-2023-7003244", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "디스플레이를 동작시키기 위한 방법으로서, 상기 디스플레이는,복수의 제1 디스플레이 서브픽셀들을 포함하는 활성 디스플레이 영역(DA)을 갖는 디스플레이 기판(DS) ― 상기제1 디스플레이 서브픽셀들(PX1)은 마이크로 발광 다이오드들 및/또는 공진-캐비티 발광 디바이스들을 포함함―, 및제1 동작 모드로 또는 제2 동작 모드로 상기 디스플레이를 구동하도록 배열된 트랜시버 회로(TC)를 포함하며, 상기 방법은,제1 동작 모드에서, 상기 트랜시버 회로(TC)에 의해 상기 제1 디스플레이 서브픽셀들에 순방향 바이어스를 제공하고, 광을 방출하도록 상기 제1 디스플레이 서브픽셀들을 동작시키는 단계, 및상기 제2 동작 모드에서, 상기 트랜시버 회로(TC)에 의해 상기 제1 디스플레이 서브픽셀들에 역방향 바이어스를제공하고, 광을 검출하도록 상기 제1 디스플레이 서브픽셀들을 동작시키는 단계를 포함하는, 디스플레이를 동작시키기 위한 방법."}
{"patent_id": "10-2023-7003244", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "디스플레이는 복수의 제1 디스플레이 서브픽셀들을 포함하는 활성 디스플레이 영역(DA)을 갖는 디스플레이 기판 (DS)을 포함한다. 트랜시버 회로(TC)는 제1 동작 모드로 또는 제2 동작 모드로 디스플레이를 구동하도록 배열된 다. 제1 디스플레이 서브픽셀들은 마이크로 발광 다이오드들 및/또는 공진-캐비티 발광 디바이스들을 포함한다. 제1 동작 모드에서, 트랜시버 회로(TC)는 제1 디스플레이 서브픽셀들에 순방향 바이어스를 제공하여서, 제1 디스 플레이 서브픽셀들은 광을 방출하도록 동작가능하다. 제2 동작 모드에서, 트랜시버 회로(TC)는 제1 디스플레이 서브픽셀들에 역방향 바이어스를 제공하여서, 제1 디스플레이 서브픽셀들은 광을 검출하도록 동작가능하다."}
{"patent_id": "10-2023-7003244", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 특허 출원은 유럽 특허 출원 제20192155.8호를 우선권으로 주장하며, 이로써, 그 개시내용은 인용에 의해 포 함된다. 본 개시내용은 디스플레이, 디스플레이 디바이스, 및 디스플레이를 동작시키기 위한 방법에 관한 것이다."}
{"patent_id": "10-2023-7003244", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "평판 디스플레이 기술들은 모바일 디바이스들, 웨어러블들, 자동차 디바이스들 등과 같은 다양한 애플리케이션 들에서 이용된다. 현재 개발들의 초점은 점점 더 높은 픽셀 밀도들, 개선된 콘트라스트(contrast) 및 더 양호 한 에너지 효율을 갖는 디스플레이들을 제조하는 것에 있다. 현대의 디바이스들은 상기 디스플레이들의 픽셀 엘리먼트들을 형성하기 위해 신흥 마이크로 발광 디바이스들(마이크로-LED) 기술을 활용하기 시작하고 있다. 게다가, 현대의 디스플레이들에서의 초점은 또한, 예를 들어 근접 감지 및 생체인식 인증과 같은 애플리케이션 들에 요구되는 조명을 제공하기 위해, 적외선 광 이미터(emitter)들과 같은 광 이미터를 통합하는 것에 있다.이러한 애플리케이션들은 반사된 광을 감지하기 위한 별개의 광학 이미징 모듈을 이용함으로써 실현될 수 있다. 따라서, 마이크로-LED 및 레이저들은 최신 기술 및 차세대 디스플레이들에 존재한다. 감지 기능성을 달성하기 위해, 통상적으로 센서는 이미징 센서로서 또는 근접 센서, 주변 광 센서에 의해 디스 플레이 뒤에 구현된다. 이러한 부가적인 센서는 여분의 공간, 비용 및 조립 노력을 필요로 하며 디스플레이의 전체 스택 높이를 증가시킨다. 이는 예를 들어 모바일 디바이스들, 웨어러블 디바이스들 및 스마트 안경에 대 한 도전일 수 있다. 더욱이, 이미징 또는 센서 디바이스는 통상적으로 디스플레이와 동기화될 필요가 있다. 본 개시내용의 목적은 개선된 감지 및 검출 기능성을 갖는 디스플레이, 디스플레이 디바이스, 및 디스플레이를 동작시키기 위한 방법을 제공하는 것이다. 이러한 목적들은 독립항들의 청구대상에 의해 달성된다. 추가적인 개발들 및 실시예들은 종속항들에서 설명된 다. 임의의 하나의 실시예와 관련하여 설명된 임의의 특징은 단독으로 또는 본원에 설명된 다른 특징들과 조합하여 사용될 수 있고, 또한, 대안으로서 설명되지 않는 한, 임의의 다른 실시예들의 하나 이상의 특징들, 또는 임의 의 다른 실시예들의 임의의 조합과 조합하여 사용될 수 있다는 것이 이해되어야 한다. 게다가, 아래에서 설명 되지 않는 등가물들 및 수정들이 또한, 첨부된 청구항들에서 정의되는, 디스플레이, 디스플레이 디바이스, 및 디스플레이를 동작시키기 위한 방법의 범위를 벗어나지 않으면서 이용될 수 있다. 다음은 디스플레이들의 분야의 개선된 개념에 관한 것이다. 이 개념은, 마이크로 발광 다이오드들 및/또는 레 이저들, 이를테면 수직 캐비티 표면 발광 레이저(VCSEL: vertical cavity surface emitting laser)들이 이들의 바이어스에 따라 검출기 및 이미터 둘 모두로서 교번하여 사용될 수 있다는 관찰에 기반한다. 예를 들어, 상기 다이오드들 또는 발광 디바이스들의 역방향 바이어싱은, LED들에 대한 스타크 효과(Stark Effect) 및 수직-캐비 티 표면-발광 레이저(VCSEL: vertical-cavity surface-emitting laser)들과 같은 레이저들에 대한 양자-제한 스타크-효과(Quantum-Confined Stark-Effect)를 사용하는 효율적인 광 검출을 가능하게 한다. 제안된 개념은, 하나의 동작 모드에서 광을 방출하도록, 디스플레이, 예를 들어, VCSEL들을 포함하는 마이크로- LED 디스플레이 또는 마이크로-LED 디스플레이를 구동하는 것을 제안한다. 다른 동작 모드에서, 감지 기능성은 디스플레이 서브픽셀들, 예를 들어, 마이크로-LED들, 공진 캐비티 LED들, 또는 VCSEL들과 같은 레이저들의 역방 향 바이어싱에 의해 달성될 수 있다. 이는 동일한 디바이스가 이미터 및 수신기로서 이용될 수 있다는 것을 의 미한다. 따라서, 디스플레이는, 트랜시버 회로를 포함하는 트랜시버 칩에 의해 전기적으로 구동되는 전기-광학 변환기를 형성한다. 결과적으로, 부가적인 센서 칩을 요구하지 않으면서 감지 기능성이 디스플레이에 포함될 수 있다. 적어도 하나의 실시예에서, 디스플레이는 복수의 제1 디스플레이 서브픽셀들을 포함하는 활성 디스플레이 영역 또는 활성 구역을 갖는 디스플레이 기판을 포함한다. 트랜시버 회로는 제1 동작 모드로 또는 제2 동작 모드로 디스플레이를 구동하도록 배열된다. 제1 디스플레이 서브픽셀들은 마이크로 발광 다이오드들 및/또는 공진 캐 비티 발광 디바이스들을 포함한다. 예를 들어, 디스플레이 기판은, 픽셀들을 동작시키기 위한 회로부, 이를테면, 예컨대, 판독 회로 및/또는 구동 회로의 컴포넌트들을 갖는 기능 층들을 포함하는 실리콘 기판, 예를 들어, 실리콘 웨이퍼 또는 실리콘 웨이퍼의 다이싱된 칩일 수 있다. 디스플레이 기판은 또한, FR4 또는 폴리이미드와 같은 상이한 재료로 이루어질 수 있 다. 예를 들어, InGaN-기반 LED들 및 마이크로-LED들을 사파이어 상에서 직접 성장시키고 이들을 나중에 전사 하는 것이 가능하다. 디스플레이 이미지를 형성하기 위해, 제1 디스플레이 서브픽셀들은 디스플레이 기판의 표면 상에 배열되고, 그 에 따라, 활성 디스플레이 영역의 적어도 일부를 형성한다. \"활성 디스플레이 영역\"이라는 용어는, 디스플레이 서브픽셀들에 의해, 디스플레이의 상기 부분이 활성 디스플레이 영역에 입사되는 광을 감지 및/또는 방출할 수 있음을 나타낸다. 적어도 하나의 실시예에서, 디스플레이는 제2 디스플레이 서브픽셀들로 표기된 추가적인 복수의 디스플레이 서 브픽셀들을 포함한다. 제2 디스플레이 서브픽셀들은 마이크로 발광 다이오드들인 마이크로-LED들을 포함한다. 디스플레이 이미지를 형성하기 위해, 제2 디스플레이 서브픽셀들도 역시, 디스플레이 기판의 표면 상에 배열되 고, 그에 따라, 활성 디스플레이 영역의 적어도 일부를 형성한다.활성 디스플레이 영역은 상이한 타입일 수 있는 디스플레이 서브픽셀들에 의해 형성된다. 제1 디스플레이 서브 픽셀 및 제2 디스플레이 서브픽셀 타입이라는 용어들은 특성 및/또는 설계에 의해 디스플레이 서브픽셀들을 구 별하기 위해 사용된다. 이러한 방식으로, 공통 용어를 사용하여 상이한 타입들의 디스플레이들이 정의될 수 있 다. 예를 들어, 각각의 디스플레이 서브픽셀들, 즉, 제1 타입 및 제2 타입 둘 모두의 각각의 디스플레이 서브 픽셀들은, 예를 들어 RGB 컬러들 또는 IR의 일부 종류의 발광 엘리먼트를 포함한다. 그러나, 제1 디스플레이 서브픽셀들 각각은 마이크로-LED 또는 공진-캐비티 발광 디바이스를 포함하는 한편, 제2 디스플레이 서브픽셀들 은 마이크로-LED를 포함할 수 있다. 게다가, 제1 디스플레이 서브픽셀들 각각에는 역방향 바이어스가 제공될 수 있어서, 적어도 이러한 픽셀들은 광을 검출하도록 동작가능하다. 어떤 의미에서, 아래에서 논의되는 상이한 타입들의 디스플레이들은 이러한 일반적인 개념을 기반으로 하며, 아래의 개시내용으로부터 명백해질 바와 같이, 특성 및/또는 설계의 부가적인 특징들을 디스플레이 서브픽셀들에 귀착시킬 수 있거나 또는 귀착시키지 않을 수 있다. 달리 언급되지 않으면, \"디스플레이 서브픽셀\"이라는 용어는, 설계(마이크로-LED 및/또는 공진- 캐비티 발광 디바이스)에 의해 또는 주어진 디스플레이 서브픽셀을 구동함으로써 특징 또는 기능을 디스플레이 서브픽셀(제1 디스플레이 서브픽셀 및 제2 디스플레이 서브픽셀)에 귀착시키기 위해 사용될 수 있다. 마이크로스코픽 LED들 또는 간단히 마이크로-LED들은, 예를 들어, 갈륨 질화물계 LED를 형성하기 위한 종래의 기술에 기반한다. 그러나, 마이크로-LED들은 훨씬 더 작은 풋프린트를 특징으로 한다. 각각의 마이크로-LED는 예를 들어 사이즈가 5 마이크로미터만큼 작을 수 있다. 마이크로-LED들은, 특정 픽셀 밝기 또는 휘도를 유지하 면서, 디스플레이 층, 즉, 디스플레이 기판의 표면 상에 더 높은 픽셀 밀도 또는 더 낮은 파퓰레이션 밀도의 활 성 컴포넌트들을 갖는 디스플레이들을 가능하게 한다. 후자의 양상은 디스플레이의 픽셀 층에 부가적인 활성 컴포넌트들의 배치를 가능하게 하여서, 부가적인 기능성 및/또는 더 콤팩트한 설계를 가능하게 한다. OLED들에 뛰어나게, 마이크로-LED들은, OLED들과 비교하여 방출의 상당히 더 높은 밝기를 특징으로 함으로써, 종래의 LED 들과 비교하여 향상된 에너지 효율을 제공한다. 이는 거의 무한대에 가까운 콘트라스트 비를 가능하게 한다. 더욱이, OLED들과 달리, 마이크로-LED들은 스크린 번-인 효과(screen burn-in effect)들을 보여주지 않는다. 공진-캐비티 발광 디바이스는, 공진 프로세스에 기반하여 광을 방출하도록 동작가능한 발광 다이오드와 유사한 반도체 디바이스로 간주될 수 있다. 이 프로세스에서, 공진-캐비티 발광 디바이스는, 예를 들어, 증폭된 자연 방출(spontaneous emission)을 생성하도록 전류로 직접 펌핑될 때, 전기 에너지를 광으로 직접 변환할 수 있다. 그러나, 유도 방출(stimulated emission)을 생성하는 대신에, 자연 방출만이 야기될 수 있는데, 예를 들어, 반 도체의 표면에 수직(perpendicular)인 자연 방출이 증폭된다. 공진 광 검출기는, 예를 들어 공진 발광 디바이 스, 이를테면 VCSEL 또는 공진 캐비티 LED를 역방향 바이어싱할 때 확립된다. 트랜시버 회로는, 예를 들어, 제1 동작 모드 및 제2 동작 모드에서 제1 디스플레이 서브픽셀 및 제2 디스플레이 서브픽셀 둘 모두를 제어하도록 배열된다. 디스플레이 이미지를 형성하기 위해 디스플레이 서브픽셀들을 구동 하는 것 외에도, 트랜시버 회로는, 검출 목적들을 위해 적어도 제1 디스플레이 서브픽셀들을 또한 구동하도록 구성된다. 예를 들어, 디스플레이의 표면까지 거리를 두고 위치되거나 또는 디스플레이의 표면 상에 위치된 오브젝트는 제 2 디스플레이 서브픽셀들로부터의 광 방출에 의해 조명된다. 오브젝트로부터 디스플레이로 다시 반사되는 광은 제1 디스플레이 서브픽셀들에 의해 검출될 수 있다. 일반적으로, 이러한 맥락에서 디스플레이 서브픽셀들을 구 동하는 것은, 예를 들어 광 검출기들로서 동작되는 그러한 디스플레이 서브픽셀들에 의해 생성된 광-신호들을 판독하는 것을 수반한다. 검출된 광은, 디스플레이 서브픽셀들에 의해 방출되고 반사에 의해 다른 디스플레이 서브픽셀들로 지향되는 광, 또는 디스플레이의 환경에서 방출되는 광, 예를 들어 주변 광일 수 있다. 예를 들 어, 트랜시버 회로는 구동 방식에 의해 또는 전용 동작 모드들에 의해 디스플레이를 동작시킨다. 적어도 하나의 실시예에서, 제1 동작 모드에서, 트랜시버 회로는 제1 디스플레이 서브픽셀들에 순방향 바이어스 를 제공한다. 이러한 방식으로, 제1 디스플레이 서브픽셀들은 광을 방출하도록 동작가능하다. 적어도 제2 동 작 모드에서, 트랜시버 회로는 제1 디스플레이 서브픽셀들에 역방향 바이어스를 제공한다. 이러한 방식으로, 적어도 제1 디스플레이 서브픽셀들은 광을 검출하도록 동작가능하다. 동작 모드들의 시퀀스는 구동 방식에 의 해 결정될 수 있다. 예를 들어, 제1 동작 모드 및 제2 동작 모드는 교번할 수 있거나, 또는 당면한 애플리케이 션에 의해 요구되는 임의의 다른 방식으로 구동될 수 있다. 개선된 개념은 디스플레이 서브픽셀들의 동적 바이어싱을 가능하게 한다. 예를 들어, 발광 디바이스들, 이를테 면 마이크로-LED들, 및 공진-캐비티 발광 디바이스들, 예를 들어 레이저들, 이를테면 VCSEL들을 역방향 바이어 싱함으로써, 적어도 일부 디스플레이 서브픽셀들 또는 이들 모두가 검출기들 및 이미터들로서 사용될 수 있다.부가적인 광학 컴포넌트들이 요구되지 않는다. 어떤 의미에서, 광 이미터들을 광학 센서들로 만들기 위해 광 이미터들의 극성을 반전(inverse)시키는 지능은 구동 전자장치, 즉, 트랜시버 회로에 포함된다. 본질적으로, 구동기 IC로서 구현되는 트랜시버 회로는 구동기와 수신기의 기능성을 하나의 빌딩 블록에 결합한다. 일부 실시예들에서, 디스플레이 서브픽셀들은 활성 디스플레이 영역 내에 2-차원 어레이로 배열된다. 통상적으 로, 디스플레이들은 2-차원 매트릭스 어레인지먼트(matrix arrangement)에 의해 형성되며, 여기서, 방출 엘리먼 트와 수신 엘리먼트는 디스플레이 기판 상에 나란한 어레인지먼트로 코-로케이팅된다. 트랜시버 회로는 디스플레이 서브픽셀들의 개개의 바이어스를 세팅함으로써 디스플레이 서브픽셀들을 구동할 수 있다. 예를 들어, 디스플레이 서브픽셀이 검출기로서 동작되는지 또는 이미터로서 동작되는지는 순방향 또는 역방향 바이어스를 인가함으로써 정의될 수 있다. 다른 용어들로, 디스플레이 서브픽셀들은, 각각, 포지티브 또는 네거티브 극성을 갖는 포지티브 또는 네거티브 바이어스에 의해 동작된다. 디스플레이의 몇몇 구현들은 제1 디스플레이 서브픽셀 및 제2 디스플레이 서브픽셀을 사용할 때 가능하다. 예 를 들어, 일 구현에서, 제2 디스플레이 서브픽셀들은 광을 방출하도록 항상 동작된다. 제1 디스플레이 서브픽 셀들만이, 각각, 제1 동작 모드 및 제2 동작 모드에서 변화하는 바이어스로 인해 검출 및/또는 방출하도록 동작 된다. 다른 구현에서, 제2 디스플레이 서브픽셀들은 광을 방출하도록 선택되는 경우에만 광을 방출할 수 있는 한편, 제1 디스플레이 서브픽셀들은 제1 동작 모드 및 제2 동작 모드에서 변화하는 바이어스로 인해 검출 또는 방출하도록 동작된다. 또 다른 구현에서, 제1 디스플레이 서브픽셀 및 제2 디스플레이 서브픽셀 둘 모두는 적 어도 때때로, 변화하는 바이어스로 인해 검출/방출 둘 모두를 할 수 있다. 제1 디스플레이 서브픽셀 및 제2 디 스플레이 서브픽셀은 마이크로-LED 또는 공진-캐비티 발광 디바이스와 같은 상이한 타입일 수 있다. 다른 구현 에서, 제1 디스플레이 서브픽셀 및 제2 디스플레이 서브픽셀 둘 모두는, 적어도 때때로 또는 주어진 동작 모드 동안, 변화하는 바이어스로 인해 검출 및/또는 방출할 수 있다. 그러나, 제1 디스플레이 서브픽셀 및 제2 디스 플레이 서브픽셀은 마이크로-LED와 같은 동일한 타입일 수 있다. 이러한 구현 리스트는 포괄적인 것으로 간주 되지 않아야 한다. 실제로, 본원에서 설명된 개념의 사상 및 범위를 벗어나지 않으면서 다양한 수정들이 이루 어질 수 있다. 트랜시버 회로는 또한, 디스플레이 서브픽셀들에 의해 생성되는 광 신호들을 프로세싱하도록 동작가능할 수 있 다. 예를 들어, 광 신호들의 가능한 프로세싱은 광 신호들 또는 광 신호들로부터 유도된 신호들을 기준 데이터 와 비교하는 것과 관련될 수 있다. 광 신호들을 프로세싱하는 것은 또한, 또는 대안적으로, 예를 들어 광 세기, 밝기, 스펙트럼 조성(spectral composition) 또는 이들 중 하나로부터 유도된 수량과 같은 측정 값을 결 정하는 것을 포함할 수 있다. 게다가, 트랜시버 회로는 또한, 예를 들어, 근접 또는 거리 검출을 위해, 디스플 레이 서브픽셀들의 방출 및 검출을 동기화하도록 배열될 수 있다. 적어도 하나의 실시예에서, 디스플레이는 복수의 제1 디스플레이 서브픽셀 및 제2 디스플레이 서브픽셀 둘 모두 를 포함한다. 제2 디스플레이 서브픽셀들은 마이크로 발광 다이오드들인 마이크로-LED들을 포함한다. 트랜시 버 회로는 제1 동작 모드 및 제2 동작 모드 둘 모두에서 제2 디스플레이 서브픽셀들에 동일한 바이어스를 제공 한다. 이러한 방식으로, 제2 디스플레이 서브픽셀들은 제1 동작 모드 및 제2 동작 모드 둘 모두에서 이미터들 로서 또는 검출기들로서 동작한다. 동일한 바이어스는 순방향 또는 역방향 바이어스, 또는 디스플레이 서브픽 셀들을 동작시키기 위한 임의의 다른 바이어스일 수 있다. 부가하여 또는 대안적으로, 제1 동작 모드에서, 트랜시버 회로는 제2 디스플레이 서브픽셀들에 순방향 바이어스 를 제공한다. 이러한 방식으로, 제2 디스플레이 서브픽셀들에는 순방향 바이어스가 제공되고, 광을 방출하도록 동작가능하다. 이러한 방식으로, 제1 디스플레이 서브픽셀들 및 제2 디스플레이 서브픽셀들 둘 모두는, 제1 동 작 모드 동안, 이들이 순방향 바이어스를 수신할 때 광을 방출하도록 동작된다. 게다가, 제2 동작 모드에서, 트랜시버 회로는 제2 디스플레이 서브픽셀들에 역방향 바이어스를 제공한다. 이러 한 방식으로, 제2 디스플레이 서브픽셀들에는 역방향 바이어스가 제공되고, 광을 방출하도록 동작가능하다. 다 시 말해서, 제2 동작 모드 동안, 제1 디스플레이 서브픽셀들 및 제2 디스플레이 서브픽셀들은 이들이 역방향 바 이어스를 수신할 때 광을 검출하도록 동작된다. 적어도 하나의 실시예에서, 제2 디스플레이 서브픽셀들의 서브세트만이 제1 동작 모드 및 제2 동작 모드 둘 모 두에서 제1 디스플레이 서브픽셀들과 동일한 바이어스를 수신할 수 있다. 유사하게, 적어도 하나의 실시예에서, 제2 디스플레이 서브픽셀들의 서브세트만이 제1 동작 모드 동안 순방향 바이어스를 수신할 수 있거 나 또는 제2 동작 모드 동안 역방향 바이어스를 수신할 수 있다. 이는 하드와이어드(hardwired) 전기 상호연결들에 의해 구현될 수 있거나 또는 전기 스위치들을 통해 선택될 수 있다. 따라서, 디스플레이의 실제 레이아웃 및 그의 디스플레이 서브픽셀들에 귀착되는 기능성은 크게 변경될 수 있다. 제1 동작 모드 및 제2 동작 모드에 따라, 제2 디스플레이 서브픽셀들에 동일한 바이어스, 즉, 순방향 바이어스 및 역방향 바이어스가 공급되는 경우, 제1 디스플레이 서브픽셀들과 제2 디스플레이 서브픽셀들 사이의 구별은 이들의 기능성을 설명하는 데 필요하지 않을 수 있다. 결과적으로, 이것이 사실이라면, 제1 디스플레이 서브픽 셀들에 대해 본원에서 개시되고 있는 전부가 제2 디스플레이 서브픽셀들에 적용될 수 있고, 그 반대도 마찬가지 이다. 적어도 하나의 실시예에서, 제1 동작 모드 및 제2 동작 모드가 교번하여서, 제1 디스플레이 서브픽셀들은 광의 이미터들 또는 광의 검출기들로서 동작하도록 교번한다. 동작 모드들을 교번하는 것은 필요에 따라 센서 기능 성을 구현하는 것을 가능하게 할 수 있다. 예를 들어, 2개의 모드들은 디스플레이의 리프레시 레이트(refresh rate) 내에서 교번할 수 있고, 따라서 인간 지각에 의해 의식되지 않을 수 있다. 리프레시 레이트는 통상적으 로 디스플레이의 사이즈에 의존한다. 예를 들어, 60 또는 72 Hz보다 높은 리프레시 레이트들은 통상적으로 의 식되지 않는다. 디스플레이 서브픽셀들의 검출 기능성은 디스플레이의 기능, 즉, 이미지들 및 비디오의 디스플 레이를 간섭하지 않을 수 있다. 부가하여 또는 대안적으로, 제1 디스플레이 서브픽셀들은 적어도 제1 서브세트 및 제2 서브세트를 포함하여서, 제2 동작 모드 동안, 제1 서브세트 및 제2 서브세트로부터의 디스플레이 서브픽셀들은 광의 이미터들 또는 광의 검출기들로서 동작하도록 교번한다. 특정 타입들의 센서 기능성은 검출기 및 이미터 둘 모두, 예를 들어 근접 또는 거리 검출을 수반할 수 있다. 디스플레이 서브픽셀들을 전술된 서브세트들로 그룹화함으로써, 이러한 검 출기 및 이미터 쌍들이 달성될 수 있다. 서브세트들은 하드와이어드 전기 상호연결들에 의해 구현될 수 있거나 또는 전기 스위치들을 통해 선택될 수 있다. 따라서, 서브세트들로의 실제 할당은 당면한 애플리케이션에 의해 필요에 따라 크게 변경될 수 있다. 적어도 하나의 실시예에서, 트랜시버 회로는 제2 동작 모드에서 디스플레이 서브픽셀들에 의해 생성된 센서 신 호들을 수신 및 출력하도록 배열된다. 따라서, 트랜시버는 바이어스, 예를 들어 순방향 및 역방향 바이어스를 제공하도록 동작가능하지만, 또한 신호 포착의 제어에 수반된다. 따라서, 광 이미터들을 광학 센서들로 만들기 위해 광 이미터들의 바이어스의 극성을 반전시키기 위한 \"지능\"이 구동 전자장치에 포함된다. 본질적으로, 구 동기 IC는, 이 구동기 IC가 하나의 빌딩 블록에서 구동기 및 수신기의 기능성을 특징으로 하는 트랜시버 IC가 되도록 보완된다. 적어도 하나의 실시예에서, 트랜시버 회로는 선택가능한 전기 연결들을 통해 제1 디스플레이 픽셀 및/또는 제2 디스플레이 픽셀에 전기적으로 연결된다. 트랜시버 회로는, 각각, 선택가능한 전기 연결들을 선택하기 위한 하 나 이상의 선택 신호들을 수신하기 위한 입력 단자를 포함한다. 마지막으로, 트랜시버 회로는 하나 이상의 선 택 신호들에 따라 선택된 전기 연결들을 통해 순방향 바이어스, 역방향 바이어스 또는 동일한 바이어스를 제공 한다. 디스플레이 서브픽셀이 제1 디스플레이 서브픽셀의 기능을 갖는지 또는 제2 디스플레이 서브픽셀의 기능을 갖는 지는 디스플레이의 타입 및 레이아웃에 의해 결정될 수 있다. 그러나, 선택가능한 전기 연결들은, 예를 들어, 디스플레이 서브픽셀들이 전기 스위치들을 통해 선택될 수 있기 때문에, 더 많은 자유도를 가능하게 한다. 이 러한 방식으로, 제1 디스플레이 서브픽셀 및 제2 디스플레이 서브픽셀의 역할 및 그에 따른 기능성이 변화될 수 있고, 결과적으로, 동일한 디스플레이 서브픽셀이 하나의 선택된 연결에서 이미터로서 또는 다른 선택된 연결에 서 검출기로서 작용할 수 있다. 적어도 하나의 실시예에서, 활성 디스플레이 영역은 복수의 픽셀들을 포함한다. 픽셀들은 적어도 하나의 제1 디스플레이 서브픽셀 및 적어도 하나의 제2 디스플레이 서브픽셀에 의해 형성된다. 디스플레이 서브픽셀들은 디스플레이의 최소 기능 유닛을 형성한다. \"픽셀들\"은, 이들이 적어도 하나의 제1 디스플레이 서브픽셀 및 적 어도 하나의 제2 디스플레이 서브픽셀을 포함하기 때문에 더 높은 레벨에서 기능 유닛으로 간주될 수 있다. 예 를 들어, 픽셀들은 기능 쌍들을 형성할 수 있으며, 하나의 디스플레이 서브픽셀은 이미터로서 작용하는 한편 다 른 디스플레이 서브픽셀은 검출기로서 작용한다. 주어진 제1 디스플레이 서브픽셀은 마이크로 발광 다이오드 또는 공진-캐비티 발광 디바이스를 포함하는 한편, 제2 디스플레이 서브픽셀은 마이크로 발광 다이오드만을 포 함할 수 있다. 차례로, 디스플레이 서브픽셀들은 마찬가지로 서브픽셀들의 2-차원 어레이로서 형성될 수 있다. 예를 들어, 픽 셀들은 바이엘(Bayer) 구성의 발광 서브픽셀들로서 RGB 마이크로-LED들을 포함하고, 제2 디스플레이 서브픽셀은 마이크로 포토다이오드와 같은 부가적인 광 캡처 서브픽셀을 추가로 제공할 수 있다. 대안적으로, 예를 들어, 광 캡처 디스플레이 서브픽셀을 위해, 픽셀 내의 발광 디스플레이 서브픽셀, 예를 들어, 바이엘 어레인지먼트의 녹색 픽셀이 희생될 수 있다. 적어도 하나의 실시예에서, 픽셀들은 적어도 2개의 제1 디스플레이 서브픽셀들 및 적어도 하나의 제2 디스플레 이 서브픽셀들을 포함한다. 적어도 2개의 제1 디스플레이 서브픽셀은 마이크로 발광 다이오드 및 공진-캐비티 발광 디바이스를 포함한다. 게다가, 적어도 하나의 제2 디스플레이 서브픽셀들은 마이크로 발광 다이오드를 포 함한다. 다시 말해서, 제1 디스플레이 서브픽셀들은, 디스플레이의 원하는 기능성에 따라, 마이크로 발광 다이 오드 또는 공진-캐비티 발광 디바이스일 수 있다. 적어도 하나의 실시예에서, 서브픽셀들의 방출 특성 및 검출 특성은, 각각, 방출 스펙트럼 및 흡수 스펙트럼에 의해 정의된다. 방출 스펙트럼과 흡수 스펙트럼은 함께 스펙트럼 특징을 형성한다. 픽셀들은 제1 스펙트럼 특 징의 적어도 하나의 제1 디스플레이 서브픽셀, 및 제1 스펙트럼 특징과 상이한 제2 스펙트럼 특징의 적어도 하 나의 제2 디스플레이 서브픽셀을 포함한다. 방출 스펙트럼들 및 흡수 스펙트럼들 또는 대역들은, 각각, 방출 및 흡수의 대역 최대치들을 특징으로 할 수 있 다. 디스플레이 기술 분야에서, 디스플레이 서브픽셀들은 적색(red), 녹색(green), 청색(blue) 또는 적외선 (infrared) 픽셀로 지정될 수 있다. 이는, 각각, 적색, 녹색, 청색 또는 적외선의 방출의 대역 최대치들을 나 타낸다. 따라서, 위에서 도입된 제1 스펙트럼 특징 및 제2 스펙트럼 특징은 주어진 픽셀로 그룹화된 대응하는 디스플레이 서브픽셀들이 상이한 방출, 예를 들어, 적색, 녹색, 청색 또는 적외선 대역들을 가짐을 나타낸다. 디스플레이 서브픽셀은 자신의 방출 스펙트럼을 특징으로 하는 것으로 방출을 보여줄 수 있다. 그러나, 동일한 디스플레이 서브픽셀은 또한, 자신의 흡수 스펙트럼을 특징으로 하는 것으로 흡수를 나타낼 수 있다. 예를 들 어, 이러한 서브픽셀들에 대한 방출은 더 작은 밴드갭에 대응할 수 있는 한편, 흡수는 더 큰 밴드갭에 대응한다. 그러한 경우, 스토크스 시프트(Stokes shift)는 비-제로(non-zero)이고, 흡수 및 방출 스펙트럼들의 대역 최대치들의 포지션들 사이의 차이를 나타낸다. 예를 들어, 마이크로 발광 다이오드는 주어진 파장에 대해, 높은 방출이지만 낮은 흡수를 특징으로 할 수 있다. 따라서, 예를 들어, 적색 디스플레이 서브픽셀은 녹 색 및 청색 흡수 대역들 등에서 흡수할 수 있다. 적어도 하나의 실시예에서, 픽셀들은 제로 스펙트럼 시프트(즉, 방출 및 흡수의 대역 최대치들이 동일함)를 갖 는 방출 스펙트럼 및 흡수 스펙트럼을 가지는 적어도 하나의 제1 디스플레이 서브픽셀을 포함한다. 예를 들어, 특정 타입들의 공진-캐비티 발광 디바이스들, 예를 들어 VCSEL 레이저 다이오드들은 제로 스펙트럼 시프트를 갖 는 방출 스펙트럼들 및 흡수 스펙트럼들을 갖도록 구성될 수 있다. 실제로, 방출 스펙트럼들과 흡수 스펙트럼 들이 또한 동일할 수 있다. 적어도 하나의 실시예에서, 픽셀들은 적어도 3개의 마이크로 발광 다이오드들을 포함한다. 제1 스펙트럼 특징 의 제1 마이크로 발광 다이오드는 제1 디스플레이 서브픽셀로서 구성된다. 제2 스펙트럼 특징의 제2 마이크로 발광 다이오드는 제2 디스플레이 서브픽셀로서 구성된다. 제3 스펙트럼 특징의 제3 마이크로 발광 다이오드는 제1 디스플레이 서브픽셀로서 구성된다. 제3 스펙트럼 특징은 제1 스펙트럼 특징 및 제2 스펙트럼 특징과 상이 하다. 예를 들어, 제2 스펙트럼 특징과 관련하여, 제1 스펙트럼 특징은 포지티브 시프트를 갖고, 제3 스펙트럼 특징은 네거티브 시프트를 갖는다. 예를 들어, 적어도 3개의 마이크로 발광 다이오드들은 이들의 스펙트럼 특징에 따라 적색, 녹색 및 청색 디스플 레이 서브픽셀들이다. 그러나, 픽셀을 형성하는 디스플레이 서브픽셀들은 임의의 다른 타입의 컬러들, 예를 들 어 IR에서의 방출을 가질 수 있다. 게다가, 예를 들어, RGGB, RGB-NIR 픽셀을 형성하는 3개 초과의 디스플레이 서브픽셀들이 있을 수 있다. 네거티브 및 포지티브 시프트는 에너지, 파수 또는 주파수 유닛들로 표현될 수 있 다. 따라서, \"네거티브\" 및 \"포지티브\"라는 용어들은 시프트를 표현하는 데 사용되는 유닛에 의해 결정된다. 일반적으로, 네거티브 또는 포지티브 시프트는 스토크스 시프트에 대응할 수 있거나 또는 대응하지 않을 수 있 다. 이러한 용어들은 이하에서 방출 및 흡수의 상대적인 측정치(relative measure)로서 사용된다. 픽셀을 형성하는 디스플레이 서브픽셀들은 네거티브 또는 포지티브 시프트에 의해 표현되는 바와 같이 이들의 스펙트럼 특성들이 조정될 수 있다. 이러한 방식으로, 디스플레이 서브픽셀은 대역에서 방출할 수 있고, 이는 결국 이웃 디스플레이 서브픽셀에 의해 검출될 수 있다. 예를 들어, 적색 디스플레이 서브픽셀은 적색 대역에 서 방출하고 녹색 및 청색 흡수 대역들에서 흡수할 수 있다. 따라서, 적색 디스플레이 서브픽셀은 픽셀을 형성하기 위해 녹색 및 청색 디스플레이 서브픽셀로 보완될 수 있다. 제1 동작 모드 및 제2 동작 모드에서 방출 및 검출이 변화될 수 있기 때문에, 디스플레이 서브픽셀들은 픽셀 레벨에서 이미터들 및 검출기로서 사용될 수 있 다. 적어도 하나의 실시예에서, 적어도 하나의 공진-캐비티 발광 디바이스는 마이크로 발광 다이오드들의 흡수 대역 에서의 부가적인 흡수를 위해 배열된 고 Q 공진기(high Q resonator)를 포함한다. 디스플레이 서브픽셀들의 방출 및 흡수는 인가된 바이어스에 따라 변경될 수 있지만, 스펙트럼 특징은 변경될 수 없다. 이는 예를 들어 방출이 흡수보다 더 강할 수 있다는 것을 의미한다. 게다가, 스펙트럼 시프트는 통 상적으로, 예를 들어 수반된 밴드갭들에 대한 재료 특성이다. 그러나, 공진-캐비티 발광 디바이스의 공진기는 디바이스의 레이아웃에 의해 약간의 마진 내에서 조정될 수 있다. 이러한 방식으로, 흡수 대역은 마이크로 발 광 다이오드, 예를 들어 픽셀 내의 이웃 마이크로 발광 다이오드의 흡수 대역과 중첩되도록 배열될 수 있다. 고 Q는 픽셀 내의 디스플레이 서브픽셀들의 결합된 흡수 대역까지 흡수하기에 충분히 높은 값으로 간주될 수 있 다. 이하에서, 광학 품질 팩터(Q)의 값은 이 값이 1보다 크면 \"높음\"인 것으로 간주된다. 일부 실시예들에서, 광학 품질 팩터는 10보다 크다. 큰 Q 팩터는 역방향으로 동작할 때 공진 발광 디바이스의 흡수를 개선한다. 그러므로, 합리적인 반응성(responsivity)이 달성될 수 있다. 적어도 하나의 실시예에서, 공진-캐비티 발광 디바이스들은 수직-캐비티 표면-방출 레이저(VCSEL: vertical- cavity surface-emitting laser), 또는 마이크로 디스크 레이저 중 적어도 하나를 포함한다. 적어도 하나의 실시예에서, 디스플레이 디바이스는 위에서 논의된 양상들 중 하나에 따른 디스플레이뿐만 아니 라 호스트 시스템을 포함한다. 호스트 시스템은 모바일 디바이스, 이를테면 스마트폰, 스마트 워치, 인공 현실 또는 가상 현실 가능 디바이스, 모바일 폰, 소비자 전자장치, 첨단 운전자 보조 시스템(ADAS: Advanced Driver Assistance System), 의료 디바이스, 휴먼 인터페이스 디바이스, 및/또는 유사한 디바이스들을 포함할 수 있다. 적어도 하나의 실시예에서, 디스플레이는, 제2 동작 모드에서, 주변 광 센서, 근접 센서, 거리 센서, 지문 센서 및/또는 제스처 센서로서 동작가능하다. 예를 들어, 운전자의 인증 또는 식별은 지문, 손바닥 검출 등에 의해 통합될 수 있다. 다른 애플리케이션들은 주변 광 검출, 근접 검출 및 생체인식 감지(예를 들어, 지문 감지)를 포함한다. 그럼에도 불구하고, 이는 또한, 의료, 산업 및 자동차 애플리케이션들(예를 들어, 차들 내의 위성 항법 디스플레이(sat-nav display)들)에 사용될 수 있다. 목적은 추가로, 디스플레이를 동작시키기 위한 방법에 의해 해결된다. 적어도 하나의 실시예에서, 디스플레이 는 복수의 제1 디스플레이 서브픽셀들을 포함하는 활성 디스플레이 영역을 갖는 디스플레이 기판을 포함한다. 제1 디스플레이 서브픽셀들은 마이크로 발광 다이오드들 및/또는 공진 캐비티 발광 디바이스들을 포함한다. 트 랜시버 회로는 제1 동작 모드로 또는 제2 동작 모드로 디스플레이를 구동하도록 배열된다. 방법은, 제1 동작 모드에서, 트랜시버 회로에 의해 제1 디스플레이 서브픽셀들에 순방향 바이어스를 제공하는 단계들을 포함한다. 제1 디스플레이 서브픽셀들은 광을 방출하도록 동작된다. 제2 동작 모드에서, 트랜시버 회로에 의해 제1 디스 플레이 서브픽셀들에 역방향 바이어스가 제공된다. 제1 디스플레이 서브픽셀들은 광을 검출하도록 동작된다. 개선된 개념에 따라 디스플레이를 동작시키기 위한 방법의 추가적인 실시예들은 위에서 설명된 디스플레이 및 디스플레이 디바이스의 실시예들로부터 당업자에게 명백해진다. 예시적인 실시예들의 도면들의 다음의 설명은 개선된 개념의 양상들을 추가로 예시 및 설명할 수 있다. 동일한 구조 및 동일한 효과를 갖는 컴포넌트들 및 부품들은, 각각, 동등한 참조 부호들로 나타난다. 컴포넌트들 및 부품들이 상이한 도면들에서 이들의 기능 면에서 서로 대응하는 한, 이들의 설명은 다음의 도면들 각각에 대해 반드시 반복되는 것은 아니다."}
{"patent_id": "10-2023-7003244", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 1, "content": "도 1은 디스플레이의 예시적인 실시예를 도시한다. 디스플레이는, 디스플레이 기판(DS) 상에 배열되고 디스 플레이의 활성 디스플레이 영역(DA)을 형성하는 디스플레이 서브픽셀들을 포함한다. 디스플레이 서브픽셀들은 상이한 타입일 수 있다. 일반적으로, 디스플레이 서브픽셀들은 예를 들어 수직-캐비티 표면-방출 레이저 (VCSEL: vertical-cavity surface-emitting laser), 마이크로디스크 레이저, 공진 캐비티 발광 다이오드 또는 분산 피드백 레이저(DFB: distributed feedback laser)를 포함하는 임의의 타입의 마이크로 발광 다이오드(마이 크로-LED) 또는 공진-캐비티 발광 디바이스일 수 있다. 이 실시예에서, 디스플레이는 마이크로-LED들 및 VCSEL 들의 어레이를 포함한다. 함께, VCSEL들을 포함하는 디스플레이 서브픽셀들은 디스플레이 이미지들을 형성하도 록 동작가능하다. 디스플레이 서브픽셀들은 함께 그룹화되고 기능 유닛들 또는 픽셀들을 형성한다. 이는 아래 에서 더 상세히 논의될 것이다. 디스플레이 서브픽셀들은 제1 디스플레이 서브픽셀들 및 제2 디스플레이 서브픽셀들로 추가로 카테고리화될 수 있다. 이러한 구별은 기능의 차이들을 가장 먼저 반영하며, 반드시 디스플레이 서브픽셀들의 타입의 차이들을 반영하는 것은 아니다. 일반적으로, 제1 디스플레이 서브픽셀들은 임의의 타입의 마이크로 발광 다이오드(마이 크로-LED) 또는 공진-캐비티 발광 디바이스일 수 있다. 그러나, 이하, 제2 디스플레이 서브픽셀들은 마이크로- LED들이다. 상이한 하드웨어 타입 외에도, 디스플레이 서브픽셀들은 이들에 인가된 바이어스에 의해 이들의 기능성이 변경 될 수 있다. 바이어스는 트랜시버 회로(TC)에 의해 제공된다. 트랜시버 회로는 디스플레이 서브픽셀들의 어레 이에 전기적으로 연결된다. 예를 들어, 트랜시버 회로는 디스플레이 서브픽셀들을 개별적으로 어드레싱하도록 구성된다. 따라서, 트랜시버는, 예를 들어, 디스플레이 이미지를 형성하고 보여주기 위해, 디스플레이 서브픽 셀들의 구동기로서 동작한다. 전기 연결들을 통해, 트랜시버 회로는 디스플레이 서브픽셀들에 바이어스를 제공 한다. 적어도 제1 디스플레이 서브픽셀들은 순방향 또는 역방향 바이어스(또는 포지티브 및 네거티브 바이어스)를 수신할 수 있다. 디스플레이 서브픽셀들에 어느 바이어스가 인가되는지는 디스플레이의 동작 모드 에 따라 정의된다. 예컨대, 제1 동작 모드에서, 트랜시버 회로(TC)는 제1 디스플레이 서브픽셀들에 순방향 바 이어스를 제공한다. 제2 동작 모드에서, 트랜시버 회로(TC)는 제1 디스플레이 서브픽셀들에 역방향 바이어스를 제공한다. 동작 모드에 따라, 디스플레이 서브픽셀들은 광 검출기 또는 이미터로서 동작될 수 있다. 디스플레이 서브픽셀 이 검출기로서 동작하는지 또는 이미터로서 동작하는지는 디스플레이 서브픽셀이 트랜시버 회로로부터 수신하는 바이어스에 의존한다. 예를 들어, 제1 디스플레이 서브픽셀들을 역방향 바이어싱하는 것은 마이크로-LED들에 대한 스타크 효과 및 VCSEL들에 대한 양자-제한 스타크-효과를 사용하는 효율적인 광 검출을 가능하게 한다. 이러한 방식으로, VCSEL은 가시 광 또는 IR 광을 흡수할 수 있고, 적색 LED는 청색 및 녹색 광을 흡수할 수 있 다. 이는 다음의 도면들과 관련하여 추가로 논의될 것이다. 그러나 더 일반적인 가이드라인으로서, 트랜시버 회로는 이를테면 광을 방출하기 위해 디스플레이, 예를 들어, VCSEL들을 포함하는 마이크로-LED 디스플레이 또는 마이크로-LED 디스플레이를 구동하도록 동작가능하다. 마이 크로-LED들 또는 VCSEL들을 역방향 바이어싱함으로써, 감지 기능성이 달성될 수 있다. 이는, 동일한 디바이스 가 이미터 및 수신기로서 이용되어서, 전기-광학 트랜시버를 형성할 수 있다는 것을 의미한다. 결과적으로, 부 가적인 센서 칩을 요구하지 않으면서 감지 기능성이 디스플레이에 포함될 수 있다. 기본적으로, 디스플레이는 트랜시버 회로에 의해 구동되는 트랜시버로서 작용한다. 부가적인 광학 컴포넌트들이 요구되지 않는다. 디스 플레이 서브픽셀들을 광학 센서들로 만들기 위해 디스플레이 서브픽셀들의 극성을 반전시키기 위한 \"지능\"은 구 동 전자장치, 즉, 트랜시버 회로에 의해 구성된다. 트랜시버 회로는 집적 회로일 수 있고, 하나의 빌딩 블록에 구동기 및 수신기를 포함하도록 수정된 구동기 IC로 간주될 수 있다. 따라서, 트랜시버 회로는 또한, 예를 들어 광 검출기들로서 동작하는 그러한 디스플레이 서브 픽셀들에 의해 생성되는 광-신호들을 판독하도록 동작가능하다. 이 맥락에서, 동작 모드들은 마이크로제어기 또는 디스플레이 프로세서와 같은 프로세싱 유닛에 의해 제어될 수 있다. 프로세싱 유닛은, 예를 들어, 필요에 따라 동작 모드들을 교번시킴으로써, 센서 기능성을 정의하기 위해 타이밍 및 동기화 동작들을 제어한다. 예를 들어, 2개의 모드들은 디스플레이의 리프레시 레이트 내에서 교번할 수 있고, 따라서 인간 지각에 의해 의식되 지 않을 수 있다. 리프레시 레이트는 통상적으로 디스플레이의 사이즈에 의존하지만, 적어도 60 또는 72 Hz보다 높아야 한다. 디스플레이 서브픽셀들의 검출 기능성은 디스플레이의 기능, 즉, 이미지들 및 비디오의 디스 플레이를 간섭하지 않을 수 있다. 도 2a 내지 도 2c는 디스플레이 서브픽셀들의 예시적인 실시예들을 도시한다. 도면들은 디스플레이 서브픽셀들, 예를 들어, 디스플레이 기판 상에 서로 나란히 배열된 이웃 디스플레이 서브픽셀들을 도시한다. 디스플레이 서브픽셀들은, 디스플레이 서브픽셀들에 순방향 바이어스(Vbias,forward)가 제공될 때 광 방출을 위 해 배열된다. 이 예에서, 좌측에 도시된 디스플레이 서브픽셀은 녹색 방출 대역의 광을 방출한다. 그러나, 우 측의 디스플레이 서브픽셀은 상이하게 바이어싱되며, 역방향 바이어스는 역방향으로 Vbias,backward로서 표현된 다. 이 디스플레이 서브픽셀은 순방향 바이어스가 제공될 때 적색 방출 대역에서 방출할 것이다. 그러나, 역 방향 바이어스(Vbias,backward)로 바이어싱될 때, 디스플레이 서브픽셀은, 예를 들어 하나 이상의 이웃 디스플 레이 서브픽셀들에 의해 방출된 녹색 방출 대역의 광을 검출하도록 동작가능하다(도 2a 참조). 도면의 다이오 드 심볼들에 의해 예시된 바와 같이, Ibias,forward와 Ibias,backward 사이의 바이어스 전류의 극성을 반전시킴 으로써, 상이한 바이어스 조건들이 디스플레이 서브픽셀에 제공된다. 트랜시버 회로는, 제1 동작 모드 및 제2 동작 모드 동안 바이어스 전류의 극성을 변경하고 이 전류를 디스플레이 서브픽셀들에 제공하도록 구성된다. 순방향 바이어스에서 적색 방출로 방출하는 디스플레이 서브픽셀은 또한 청색 방출 대역의 광을 검출할 수 있다 (예를 들어, 도 2b의 청색 방출 디스플레이 서브픽셀 참조). 마이크로-LED들의 방출/검출 특성들은 마이크로- LED들의 스펙트럼 특징들에 의해 결정된다. 스타크 효과는 인가된 바이어스에 따라 방출이 적색 대 흡수로 시 프트되는 방식을 설명한다. 마이크로-LED들의 경우, 방출은 \"더 작은 밴드갭\"에 대응하는 반면, 흡수는 \"더 큰 밴드갭\"에 대응한다. 결과적으로, 적색 마이크로-LED(Ibias,forward에서 적색 대역에서의 우세한 방출을 가 짐)는 (Ibias,backward에서) 녹색 및 청색 대역들에서 흡수할 수 있다. 통상적으로, 방출 및 흡수는 서로에 대 해 시프트된다. 도 2c는 광 방출과 광 검출 사이에서 교번하는 공진-캐비티 발광 디바이스의 예시적인 실시예를 도시한다. 이 예에서, 공진-캐비티 발광 디바이스는 VCSEL이다. VCSEL에 의해 구현되는 디스플레이 서브픽셀에는 또한, 반전 된 극성의 바이어스 전류들, 즉, Ibias,forward와 Ibias,backward 사이에서의 바이어스 전류 변화들이 공급될 수 있다. 이러한 방식으로, VCSEL에 걸쳐 순방향 바이어스(Vbias,forward) 또는 역방향 바이어스 (Vbias,backward)가 있다. VCSEL은 Ibias,forward로 바이어싱될 때 광을 방출하고, Ibias,backward로 바이어 싱될 때 광을 검출한다. 예를 들어, VCSEL은 (Ibias,backward에서) 녹색 및 청색 대역들에서 흡수할 수 있다. 그러나, VCSEL의 방출 및 흡수는 서로에 대해 시프트가 없거나 작은 시프트를 갖도록 구성될 수 있다. 이는, 일반적으로 양자 우물(quantum well)의 광 흡수 스펙트럼 또는 방출 스펙트럼에 대한 외부 전기장의 효과를 설 명하는 양자-제한 스타크 효과에 기인한다. VCSEL들 뿐만 아니라 다른 공진-캐비티 발광 디바이스들의 역방향 바이어싱이 효율적인 광 검출을 가능하게 한다는 것이 실현되었다. 이러한 방식으로, 적외선 VCSEL은 예를 들 어 광, 예를 들어 IR 및 가시 광을 흡수할 수 있다. 예를 들어, VCSEL은 교번하는 고굴절률 층 및 저굴절률 층들로 만들어진 1/4 파장 스택(quarter wave stack)들 로 구성된 2개의 유전체 브래그 반사기(DBR: dielectric Bragg reflector) 미러들 사이에 삽입된 활성 QW(quantum wall) 구역을 포함한다. 구조는 n-타입 GaAs 기판 상에서 성장될 수 있고, 미러들은 n-타입 또는 p-타입으로 도핑되어 p-n 접합을 형성한다. 전자들 및 정공들은 순방향 바이어스 하에서 활성 구역에 주입된다. 궁극적으로, 전자들 및 정공들은 QW들에 의해 포획되어 레이징 파장(lasing wavelength)에서 이득을 생성한다. GaAs 기판들 상에서 성장된 종래의 VCSEL 구조들은, 예를 들어 700 내지 1100 nm의 파장 범위에서 동작한다. 그러나, 역방향 바이어스에서, VCSEL의 활성 구역은 광 흡수 매체로서 작용하도록 동작가능하고, VCSEL은 광 검출기 또는 센서로서 사용될 수 있다. 도 3a 및 도 3b는 트랜시버 회로의 예시적인 실시예들을 도시한다. 실제로, 트랜시버 회로의 일부 및 단일 디 스플레이 서브픽셀만이 도면들에 각각 묘사된다. 도 3a에 도시된 트랜시버 회로의 일부는 스위치들(TPD 및 TLED)을 갖는 2개의 브랜치(branch)들을 포함한다. 제1 브랜치는 광 방출을 위해 배열된다. 이 예에서 스위치(TLED)는 트랜지스터로 표현된다. 트랜지스터 단자 들, 예를 들어 이미터 및 콜렉터는 디스플레이 서브픽셀, 즉, 이 경우 마이크로-LED에 연결된다. 디스플레이 서브픽셀을 이미터로서 동작시키기 위해, 바이어스 전류 소스(Ibias)가 디스플레이 서브픽셀과 트랜지스터 사이 에 커플링된다. 바이어스 전류 소스는 디스플레이 서브픽셀들에 걸쳐 Vbias,forward가 강하(drop)도록 배열된 다. 트랜지스터의 제어 단자, 예를 들어 트랜지스터의 베이스는 인버터의 출력 측에 연결된다.제2 브랜치는 광 검출을 위해 배열된다. 이 예에서 스위치(TPD)는 트랜지스터로 표현된다. 트랜지스터 단자들, 예를 들어 이미터 및 콜렉터는 디스플레이 서브픽셀, 즉, 마이크로-LED에 연결된다. 디스플레이 서브 픽셀을 검출기로서 동작시키기 위해, 바이어스 전압(Vbias,backward)은 도면에서 표시된 바와 같이 디스플레이 서브픽셀들에 걸쳐 강하한다. 이러한 방식으로 바이어싱될 때, 디스플레이 서브픽셀은, 광을 검출하고 광전류 (IPHOTO)를 생성하도록 동작가능하다. 트랜지스터(TPD)의 제어 단자, 예를 들어 트랜지스터(TPD)의 베이스는 트랜시버 회로의 입력 단자(INSEL)에 연결된다. 게다가, 인버터의 입력 측은 또한 입력 단자(INSEL)에 연결된 다. 동작 동안, 트랜시버 회로는 입력 단자(INSEL)에서 선택 신호(SEL)를 제공하거나 또는 수신한다. 예를 들어, 선택 신호는 연속적인 상승-에지(rising-edge)들 및 하강-에지들을 포함한다. 선택 신호의 모든 각각의 변화하 는 에지에 따라, 스위치들(TPD 및 TLED)은 각각 개방 및 폐쇄된다. TLED로의 경로에서의 인버터로 인해, TPD 또는 TLED는 개방 또는 폐쇄된다. 결과적으로, 트랜시버 회로는 순방향 바이어스 또는 역방향 바이어스를 제공 하고, 디스플레이 서브픽셀은 각각 이미터 또는 검출기로서 동작한다. 따라서, 선택 신호가 2개의 동작 모드들 을 정의하며, 따라서 제1 동작 모드에서, 트랜시버 회로(TC)가 순방향 바이어스를 디스플레이 서브픽셀(PX2)에 제공하여서 디스플레이 서브픽셀(PX2)이 광을 방출하고, 제2 동작 모드에서, 트랜시버 회로(TC)가 역방향 바이 어스를 디스플레이 서브픽셀(PX2)에 제공하여서 제2 디스플레이 서브픽셀들(PX2)이 광을 검출한다. 도 3b는 그 대신에 공진-캐비티 발광 디바이스(이 실시예에서는 VCSEL)를 구동하도록 배열된 트랜시버 회로의 다른 부분을 도시한다. 스위치(TLED)는 TVCSEL을 스위칭하도록 교환된다. 그 점을 제외하고, 도 3a 및 도 3b에 도시된 2개 의 회로들은 동일하다. 도 4a 내지 도 4d는 예시적인 타이밍 다이어그램들을 도시한다. 도 4a는 시간의 함수로써 VCSEL(좌측) 및 마이 크로-LED(우측)의 바이어스 전압을 도시한다. 일반적으로, 디스플레이 서브픽셀들은 동일한 또는 상이한 타입, 즉, 마이크로-LED 또는 공진-캐비티 발광 디바이스일 수 있다. 이러한 타입들의 디스플레이 서브픽셀들 둘 모 두는, 이들에게 제공되는 바이어스에 따라 이미터 또는 검출기로서 동작될 수 있다. 타이밍 다이어그램에 도시 된 바와 같이, 방출 및 검출 그리고 그에 따라 제1 동작 모드 및 제2 동작 모드가 교번할 수 있다. 게다가, 다 이어그램은 동작 모드들이 또한 바이어스 전압의 극성의 교번하는 변화들에 반영됨을 보여준다. 디스플레이 서브픽셀들은 제1 디스플레이 서브픽셀들 및 제2 디스플레이 서브픽셀로 추가로 카테고리화될 수 있 다. 위에서 논의된 바와 같이, 이러한 카테고리들은 디스플레이 서브픽셀들의 타입보다는 기능의 차이들을 반 영한다. 예를 들어, 마이크로-LED는 제1 디스플레이 서브픽셀 또는 제2 디스플레이 서브픽셀일 수 있다. 그러 나, 공진-캐비티 발광 디바이스는 항상 제1 디스플레이 서브픽셀로 간주된다. 도 4b의 좌측의 타이밍 다이어그램은 제2 디스플레이 서브픽셀, 예를 들어, 녹색 대역에서 방출하는 마이크로- LED(이하, 녹색 LED로 표기됨)의 예를 도시한다. 2개의 그래프들은 시간의 함수들로써 디바이스의 전류 (Idevice) 및 바이어스 전압(Vbias)을 도시한다. 녹색 LED에는 교번하는 동작 모드들에도 불구하고 동일한 극 성 바이어스가 공급된다. 따라서, 제2 디스플레이 서브픽셀은 제1 동작 모드 및 제2 동작 모드 둘 모두에서 동 일한 바이어스를 수신하는 것으로 간주될 수 있다. 다시 말해서, 적어도 특정 시간 기간 동안, 제2 디스플레이 서브픽셀은 이미터로서 동작된다. 결과적으로, 녹색 LED는 녹색 대역에서 방출하고, 이미지를 디스플레이하는 데 사용될 수 있다. 도 4b의 우측의 타이밍 다이어그램은 제1 디스플레이 서브픽셀, 예를 들어, 적색 대역에서 방출하는 마이크로- LED(이하, 적색 LED로 표기됨)의 예를 도시한다. 2개의 그래프들은 시간의 함수들로써 디바이스의 전류 (Idevice) 및 바이어스 전압(Vbias)을 도시한다. 적색 LED에는 교번하는 동작 모드들에 따라 교번하는 극성의 바이어스가 공급된다. 따라서, 제1 디스플레이 서브픽셀은, 각각, 제1 동작 모드 및 제2 동작 모드에서 교번하 는 극성의 바이어스, 예를 들어 순방향 및 역방향 바이어스를 수신하는 것으로 간주될 수 있다. 다시 말해서, 적어도 특정 시간 기간 동안, 제1 디스플레이 서브픽셀은 이미터 또는 검출기로서 동작된다. 이는, 검출 동안 디바이스의 전류(Idevice)가 광전류(IPHOTO)에 대응하기 때문에, 그래프로부터 확인될 수 있다. 도 4c는 도 4b 에 대응하지만, 좌측의 청색 대역(이하, 청색 LED로 표기됨)에서 방출하는 마이크로-LED를 도시한다. 도 4d는 2개의 제1 디스플레이 서브픽셀들을 표현하는 2개의 공진-캐비티 발광 디바이스, 예를 들어 VCSEL들에 대한 Vbias 및 Idevice의 타이밍 다이어그램들을 도시한다. 좌측의 그래프는 제1 VCSEL을 표현하고, 우측의 그 래프는 제2 VCSEL을 표현한다. 제1 VCSEL에는 교번하는 동작 모드들에 따라 교번하는 극성의 바이어스가 공급 되고, 그에 따라, 적어도 특정 시간 기간 동안, 이미터 또는 검출기로서 교번하여 동작된다. 이는, 검출 동안 디바이스의 전류(Idevice)가 광전류(IPHOTO)에 대응하기 때문에, 그래프로부터 확인될 수 있다. 동시에, 제2VCSEL에는 또한 교번하는 동작 모드들에 따라 교번하는 극성의 바이어스가 공급되고, 그에 따라, 적어도 특정 시간 기간 동안, 이미터 또는 검출기로서 교번하여 동작된다. 그러나, 동작 모드들, 그리고 결과적으로, 이미 터 또는 검출기의 타이밍이 시프트된다. 때때로, 제1 VCSEL은 이미터로서 동작하고, 제2 VCSEL은 검출기로서 동작하며, 그 반대도 마찬가지이다. 따라서, 동작 모드들은 픽셀 단위로 정의될 수 있다. 도 5a 및 도 5b는 예시적인 디스플레이를 도시한다. 도 5a는 예시적인 디스플레이의 평면도를 도시한다. 디스 플레이의 구현에서, 디스플레이 서브픽셀들은 서브픽셀들의 어레이로 디스플레이 기판 상에 배열되며, 서브픽셀 들은 이하에서 픽셀들로 지칭되는 기능 유닛들을 형성한다. 픽셀들은 적어도 2개의 디스플레이 서브픽셀들을 포함하며, 하나는 제1 디스플레이 서브픽셀이고 다른 하나는 제2 디스플레이 서브픽셀이다. 도 5a 및 도 5b의 실시예에서, 픽셀은, 각각, 적색, 녹색 및 청색 방출 대역들에서 방출하도록 동작가능한 적색, 녹색 및 청색 마 이크로-LED를 포함한다. 게다가, 픽셀은 또한, 예를 들어 적외선에서 광을 방출하도록 동작가능한 VCSEL을 포 함한다. 복수의 픽셀들은 활성 디스플레이를 구성하고, 이미지 또는 비디오를 디스플레이 하기 위해 트랜시버 회로를 포함하는 구동기 회로부에 의해 제어된다. 그 다음, 서브픽셀들 중 적어도 일부는 이들의 개개의 대역 들의 광을 방출하고 있다. 도 5b는 유리 플레이트와 같은 커버로 보완될 수 있는 예시적인 디스플레이의 측면 도를 도시한다. 이미지들 및 비디오들을 디스플레이하는 그 핵심 기능성 외에도, 디스플레이는 검출기 기능성을 특징으로 한다. 어떤 타입의 센서가 구현될 것인지에 따라, 픽셀들의 설계 및 이들을 제어하는 방식이 상이할 수 있다. 예를 들어, 디스플레이는 근접 센서, 지문 센서 또는 비행 시간 센서로서 동작할 수 있다. 이러한 실시예들에서, 픽 셀들은 디스플레이 서브픽셀들로서 IR VCSEL뿐만 아니라 적색, 녹색 및 청색 마이크로-LED를 포함한다. 어레이 내의 각각의 픽셀은 예를 들어, 동일한 조성, 즉, RGBIR의 이웃 픽셀들을 갖는다. 센서 기능성은 디스플레이 서브픽셀들이 시간의 함수로써 바이어싱되는 방식에 의해 구현된다. 예를 들어, 녹 색 및 청색 마이크로-LED들은 제2 디스플레이 서브픽셀들로서, 즉, 동일한 바이어스로 바이어싱되고, 그에 따라, 이미터들로서 동작한다. 적색 마이크로-LED 및 IR VCSEL은 제1 디스플레이 서브픽셀들로서, 즉, 동작 모 드에 따라 극성을 변화시키는 바이어스로 바이어싱되고, 그에 따라 이미터들 및 검출기들로서 교번하여 동작한 다. 동시에, 이웃 픽셀들은 동일한 동작 모드들에 따라 동작하지만, 이미터 또는 검출기의 타이밍이 시프트된다. 때때로, IR VCSEL은 이미터로서 동작하고, 이웃 픽셀의 VCSEL은 검출기로서 동작하며, 그 반대도 마찬가지이다. 이러한 방식으로, 방출 및 검출은 픽셀과 이의 이웃 픽셀들 사이에서 동기화될 수 있다. 동작 모드들의 타이밍 의 시프팅은 원하는 범위의 근접 검출을 가능하게 하도록 조정될 수 있다. 실제로, 원하는 범위는 또한, 시간 지연의 함수이며, 그에 따라, 방출과 검출 사이의 시프팅이다. 이러한 방식으로 생성된 센서 신호들, 예를 들 어 광전류들은 트랜시버 회로에 의해 수신되고 프로세싱 유닛, 예를 들어 마이크로제어기에서 프로세싱되어 근 접 또는 비행 시간 정보가 산출된다. 검출기 기능성을 구현하기 위해 더 많은 수의 또는 모든 픽셀들이 수반되 는 경우, 지문이 맵핑 및 검출될 수 있다. 수정에서, 녹색 및 청색 마이크로-LED들에 의한 방출은 어떠한 녹색, 청색 방출도 발생하지 않도록 이웃 픽셀들 의 제2 동작 모드의 지속기간 동안 종결될 수 있다. 실제로, 타이밍은 원하는 애플리케이션 및 검출기 기능성 에 가장 잘 맞도록(fit best) 조정될 수 있다. 검출의 범위는 어느 이웃 픽셀들이 검출에 수반되는지에 따라 조정 또는 확장될 수 있다. 예를 들어, 모든 바 로 이웃 픽셀들이 수반되는 경우, 이는 제1 범위로 번역(translate)된다. 그러나, (어레이 내의 상대적인 거리 에 대해) 단지 더 멀리 떨어진 픽셀들이 수반되는 경우, 이는 제2 범위 또는 추가적인 범위들로 번역된다. 그 다음, 바로 이웃들은 무시될 수 있거나 또는 특정 시간 동안 검출기들로서 동작하지 않을 수 있다. 다른 예에서, 디스플레이는 주변 광 센서 또는 컬러 센서로서 동작할 수 있다. 높은 신호대 잡음비를 달성하기 위해, 많은 수의 픽셀들 또는 심지어 모든 픽셀들이 검출에 수반될 수 있다. 이웃 픽셀들 사이에서 방출/검출 의 시프트된 타이밍을 갖는 것이 아니라, 모든 픽셀들이 동기화된다. 예를 들어, 모든 제2 디스플레이 서브픽 셀들은 한 번에 검출기들로서 동작한다. 이러한 방식으로, 디스플레이의 큰 표면 영역은 검출기로서 작용하고 주변 광을 수집할 수 있다. 디스플레이 서브픽셀들의 상이한 스펙트럼 특징들로 인해, 센서 신호들은 또한, 파 장의 함수로써 수집될 수 있다. 따라서, 신호 프로세싱은 또한, 컬러 정보를 산출할 수 있고, 디스플레이는 컬 러 센서로서 작용한다. 제1 디스플레이 서브픽셀 및 제2 디스플레이 서브픽셀의 역할은 트랜시버 회로에 의해 공급되는 바이어스에 의 존한다. 트랜시버 회로는 또한, 바이어스의 타이밍 및 극성을 결정한다. 따라서, 트랜시버 회로는 주어진 디 스플레이 서브픽셀들이 제1 디스플레이 서브픽셀인지 제2 디스플레이 서브픽셀인지를 결정한다. 이는 디스플레 이의 방출/검출 기능성을 구현 및 실행하기 위한 큰 자유도를 가능하게 한다. 제1 디스플레이 서브픽셀들로서 VCSEL들의 사용은, 예를 들어 적색 마이크로-LED들의 흡수를 확장하는 것을 가 능하게 한다. 디스플레이 서브픽셀들의 방출 및 흡수는 인가된 바이어스에 따라 변경될 수 있지만, 스펙트럼 특징은 변경될 수 없다. 이는 예를 들어 방출이 흡수보다 더 강할 수 있다는 것을 의미한다. 게다가, 스펙트 럼 시프트는 통상적으로, 예를 들어 수반된 밴드갭들에 대한 재료 특성이다. 그러나, 공진-캐비티 발광 디바이 스의 공진기는 디바이스의 레이아웃에 의해 약간의 마진 내에서 조정될 수 있다. 이러한 방식으로, 흡수 대역 은 마이크로 발광 다이오드, 예를 들어 픽셀 내의 이웃 마이크로 발광 다이오드의 흡수 대역과 중첩되도록 배열 될 수 있다. 고 Q는 픽셀 내의 의미 있는 흡수를 달성하기에 충분히 높은 값으로 간주될 수 있다. 의미 있는 것이란 1% 초과, 바람직하게는 10% 초과의 양자 효율을 의미한다. 본 명세서가 많은 특정사항들을 포함하지만, 이들은 발명 또는 청구될 수 있는 것의 범위에 대한 제한들로서 해 석되는 것이 아니라, 본 발명의 특정 실시예들에 특정한 특징들의 설명들로서 해석되어야 한다. 별개의 실시예 들의 맥락에서 본 명세서에 설명되는 특정 특징들은 또한, 단일 실시예로의 결합으로 구현될 수 있다. 반대로, 단일 구현의 맥락에서 설명되는 다양한 특징들은 또한, 다수의 실시예들에서 별개로 또는 임의의 적절한 하위- 조합으로 구현될 수 있다. 게다가, 특징들이 특정 결합들에서 작용하는 것으로 위에서 설명되고, 심지어 초기 에 그와 같이 청구될 수 있지만, 청구되는 결합으로부터의 하나 이상의 특징들은 일부 경우들에서, 그 결합으로 부터 제거될 수 있으며, 청구되는 결합은 하위-결합 또는 하위-결합의 변형에 관한 것일 수 있다. 유사하게, 동작들이 특정 순서로 도면들에서 묘사되지만, 이는, 바람직한 결과들을 달성하기 위해, 그러한 동작 들이 도시된 특정 순서로 또는 순차적인 순서로 수행되거나 또는 모든 예시된 동작들이 수행될 것을 요구하는 것으로 이해되지 않아야 한다. 특정 상황들에서, 멀티태스킹 및 병렬 프로세싱이 유리할 수 있다. 다수의 구현들이 설명되었다. 그럼에도 불구하고, 본 발명의 사상 및 범위를 벗어나지 않으면서 다양한 수정들 이 이루어질 수 있다. 이에 따라서, 다른 구현들은 청구항들의 범위 내에 있다."}
{"patent_id": "10-2023-7003244", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도면들에서: 도 1은 디스플레이의 예시적인 실시예를 도시하고, 도 2a 내지 도 2c는 디스플레이 서브픽셀들의 예시적인 실시예들을 도시하고, 도 3a 및 도 3b는 트랜시버 회로의 예시적인 실시예들을 도시하고, 도 4a 내지 도 4d는 예시적인 타이밍 다이어그램들을 도시하고, 그리고도 5a 및 도 5b는 예시적인 디스플레이를 도시한다."}
