{"patent_id": "10-2023-0003323", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0161330", "출원번호": "10-2023-0003323", "발명의 명칭": "실감형 가상훈련 장치 및 그 방법", "출원인": "(주)비피에스", "발명자": "장주희"}}
{"patent_id": "10-2023-0003323", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "흉기난동과 관련한 복수의 훈련 시나리오를 저장하는 저장부; 및상기 복수의 훈련 시나리오 중에서 어느 하나의 훈련 시나리오를 랜덤하게 선택하고, 상기 훈련 시나리오에 따른 복수의 단계별 훈련 상황 중에서 미리 설정된 준비 단계, 대처 단계 및 사후조치 단계에 각각 대응하는 준비단계 실감형 콘텐츠, 대처 단계 실감형 콘텐츠 및 사후조치 단계 실감형 콘텐츠를 표시부 및 음성 출력부를 통해 순차로 출력하도록 제어하고, 입력부를 통해 사용자 입력에 따른 상기 준비 단계와 관련한 서브 훈련 상황별복수의 입력값, 상기 대처 단계와 관련한 서브 훈련 상황별 복수의 다른 입력값 및 상기 사후조치 단계와 관련한 서브 훈련 상황별 복수의 또 다른 입력값을 훈련자별로 각각 수신하도록 제어하고, 훈련자별로 수신된 상기서브 훈련 상황별 복수의 입력값, 상기 서브 훈련 상황별 복수의 다른 입력값, 상기 서브 훈련 상황별 복수의또 다른 입력값 및 미리 설정된 항목별 행동지표를 근거로 평가 결과를 생성하고, 상기 생성된 평가 결과를 상기 표시부 및 상기 음성 출력부를 통해 출력하도록 제어하는 제어부를 포함하며,상기 제어부는,경찰의 직무분류 및 성과평가와 교육훈련 체계를 바탕으로 현장경찰관의 직무를 분석하여 경찰의 역량을 분석하고, 경찰헌장과 경찰청장 취임사 및 경찰교육기관의 교육목표를 바탕으로 경찰 조직의 요구를 분석하고, 경찰의역할 및 책임에 대해 수집된 신문기사와 논문을 통해 시민의 요구를 분석하고, 상기 분석된 경찰의 역량과 경찰조직의 요구와 시민의 요구에 따라 현장 경찰의 핵심 역량에 대해서 인권존중 항목, 현장에서의 소통 항목, 직무의 성실성 항목, 동료와의 협업 항목 및 법집행 공정성 항목을 설정하고, 5개의 현장 경찰의 핵심 역량에 대해 시민과 업무에 따른 지향점과 개인적인 차원과 집단적 차원으로 구분하며,상기 인권존중 항목은, 시민지향의 개인차원 역량이고,상기 현장에서의 소통 항목은, 시민지향의 집단차원 역량이고,상기 직무의 성실성 항목은, 업무지향의 개인차원 역량이고,상기 동료와의 협업 항목은, 업무지향의 집단차원 역량이고,상기 법집행 공정성 항목은, 시민과 업무 및 개인과 집단에 모두 작동할 뿐 아니라 현장 경찰관의 법집행력을강화하는데 준거가 되는 통합적 역량이며,상기 제어부는,현장 경찰의 역량 파악을 위해서 상기 인권존중 항목, 상기 현장에서 소통 항목, 상기 직무의 성실성 항목, 상기 동료와의 협업 항목 및 상기 법집행 공정성 항목에 따라 상기 항목별 행동지표를 도출하고, 상기 도출된 항목별 행동지표, 상기 수신된 상기 서브 훈련 상황별 복수의 입력값, 상기 서브 훈련 상황별 복수의 다른 입력값및 상기 서브 훈련 상황별 복수의 또 다른 입력값을 근거로 상기 평가 결과를 생성하는 것을 특징으로 하는 실감형 가상훈련 장치."}
{"patent_id": "10-2023-0003323", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제어부에 의해, 저장부에 미리 저장된 흉기난동과 관련한 복수의 훈련 시나리오 중에서 어느 하나의 훈련 시나리오를 랜덤하게 선택하는 단계;상기 제어부에 의해, 상기 훈련 시나리오에 따른 복수의 단계별 훈련 상황 중에서 미리 설정된 준비 단계, 대처단계 및 사후조치 단계에 각각 대응하는 준비 단계 실감형 콘텐츠, 대처 단계 실감형 콘텐츠 및 사후조치 단계실감형 콘텐츠를 표시부 및 음성 출력부를 통해 순차로 출력하도록 제어하는 단계;상기 제어부에 의해, 입력부를 통해 사용자 입력에 따른 상기 준비 단계와 관련한 서브 훈련 상황별 복수의 입력값, 상기 대처 단계와 관련한 서브 훈련 상황별 복수의 다른 입력값 및 상기 사후조치 단계와 관련한 서브 훈공개특허 10-2023-0161330-3-련 상황별 복수의 또 다른 입력값을 훈련자별로 각각 수신하도록 제어하는 단계;상기 제어부에 의해, 훈련자별로 수신된 상기 서브 훈련 상황별 복수의 입력값, 상기 서브 훈련 상황별 복수의다른 입력값, 상기 서브 훈련 상황별 복수의 또 다른 입력값 및 미리 설정된 항목별 행동지표를 근거로 평가 결과를 생성하는 단계; 및상기 제어부에 의해, 상기 생성된 평가 결과를 상기 표시부 및 상기 음성 출력부를 통해 출력하도록 제어하는단계를 포함하며,상기 제어부는,경찰의 직무분류 및 성과평가와 교육훈련 체계를 바탕으로 현장경찰관의 직무를 분석하여 경찰의 역량을 분석하고, 경찰헌장과 경찰청장 취임사 및 경찰교육기관의 교육목표를 바탕으로 경찰 조직의 요구를 분석하고, 경찰의역할 및 책임에 대해 수집된 신문기사와 논문을 통해 시민의 요구를 분석하고, 상기 분석된 경찰의 역량과 경찰조직의 요구와 시민의 요구에 따라 현장 경찰의 핵심 역량에 대해서 인권존중 항목, 현장에서의 소통 항목, 직무의 성실성 항목, 동료와의 협업 항목 및 법집행 공정성 항목을 설정하고, 5개의 현장 경찰의 핵심 역량에 대해 시민과 업무에 따른 지향점과 개인적인 차원과 집단적 차원으로 구분하며,상기 인권존중 항목은, 시민지향의 개인차원 역량이고,상기 현장에서의 소통 항목은, 시민지향의 집단차원 역량이고,상기 직무의 성실성 항목은, 업무지향의 개인차원 역량이고,상기 동료와의 협업 항목은, 업무지향의 집단차원 역량이고,상기 법집행 공정성 항목은, 시민과 업무 및 개인과 집단에 모두 작동할 뿐 아니라 현장 경찰관의 법집행력을강화하는데 준거가 되는 통합적 역량이며,상기 항목별 행동지표는,현장 경찰의 역량 파악을 위해서 상기 인권존중 항목, 상기 현장에서 소통 항목, 상기 직무의 성실성 항목, 상기 동료와의 협업 항목 및 상기 법집행 공정성 항목에 따라 도출된 것을 특징으로 하는 실감형 가상훈련 방법."}
{"patent_id": "10-2023-0003323", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 실감형 가상훈련 장치 및 그 방법을 개시한다. 즉, 본 발명은 현장에 출동하는 경찰관 등을 대상으로 다양한 현장 상황을 반영한 실감형 가상훈련을 제공함으로써, 현장 경찰관 등에 대한 법집행력을 강화할 수 있다."}
{"patent_id": "10-2023-0003323", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 실감형 가상훈련 장치 및 그 방법에 관한 것으로서, 특히 현장에 출동하는 경찰관 등을 대상으로 다 양한 현장 상황을 반영한 실감형 가상훈련을 제공하는 실감형 가상훈련 장치 및 그 방법에 관한 것이다."}
{"patent_id": "10-2023-0003323", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "교육 훈련 시스템은 직무를 수행하는 데 요구되는 전문적인 지식과 기술을 배우고, 가치관이나 태도 따위를 바 람직한 방향으로 변화시키기 위하여 체계적으로 짜서 이룬 조직이나 제도이다. 이러한 교육 훈련 시스템은 실제 현장 상황과 법집행 간의 부조화로 인해 현장에 배치되는 경찰관 등이 교육 훈 련 효과를 제대로 발휘하지 못하고 있다. 또한, 범죄·사고 현장에서의 경찰의 안전이 항상 위협받고 있어, 안전사고 및 범인 피습에 대응한 현장 경찰관 의 현장지원 장비 개발 및 교육·훈련 등이 필요한 상태이다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허 제10-2116390호 [제목: 훈련 신 생성이 가능한 재난대응 훈련방법 및 그 시스템]"}
{"patent_id": "10-2023-0003323", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "발명의 내용"}
{"patent_id": "10-2023-0003323", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 현장에 출동하는 경찰관 등을 대상으로 다양한 현장 상황을 반영한 실감형 가상훈련을 제공하 는 실감형 가상훈련 장치 및 그 방법을 제공하는 데 있다. 본 발명의 다른 목적은 법집행 공정성, 인권존중, 현장에서의 소통, 직무의 성실성, 동료와의 협업 등을 고려하 여 생성된 역량 모델을 근거로 다양한 상황별로 학습자가 수행하는 내용에 대해 평가하고, 평가 결과를 제공하 는 실감형 가상훈련 장치 및 그 방법을 제공하는 데 있다."}
{"patent_id": "10-2023-0003323", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시예에 따른 실감형 가상훈련 장치는 흉기난동과 관련한 복수의 훈련 시나리오를 저장하는 저장부; 및 상기 복수의 훈련 시나리오 중에서 어느 하나의 훈련 시나리오를 랜덤하게 선택하고, 상기 훈련 시나리오에 따른 복수의 단계별 훈련 상황 중에서 미리 설정된 준비 단계, 대처 단계 및 사후조치 단계에 각각 대응하는 준 비 단계 실감형 콘텐츠, 대처 단계 실감형 콘텐츠 및 사후조치 단계 실감형 콘텐츠를 표시부 및 음성 출력부를 통해 순차로 출력하도록 제어하고, 입력부를 통해 사용자 입력에 따른 상기 준비 단계와 관련한 서브 훈련 상황 별 복수의 입력값, 상기 대처 단계와 관련한 서브 훈련 상황별 복수의 다른 입력값 및 상기 사후조치 단계와 관 련한 서브 훈련 상황별 복수의 또 다른 입력값을 훈련자별로 각각 수신하도록 제어하고, 훈련자별로 수신된 상 기 서브 훈련 상황별 복수의 입력값, 상기 서브 훈련 상황별 복수의 다른 입력값, 상기 서브 훈련 상황별 복수 의 또 다른 입력값 및 미리 설정된 항목별 행동지표를 근거로 평가 결과를 생성하고, 상기 생성된 평가 결과를 상기 표시부 및 상기 음성 출력부를 통해 출력하도록 제어하는 제어부를 포함하며, 상기 제어부는, 경찰의 직무 분류 및 성과평가와 교육훈련 체계를 바탕으로 현장경찰관의 직무를 분석하여 경찰의 역량을 분석하고, 경찰헌 장과 경찰청장 취임사 및 경찰교육기관의 교육목표를 바탕으로 경찰 조직의 요구를 분석하고, 경찰의 역할 및 책임에 대해 수집된 신문기사와 논문을 통해 시민의 요구를 분석하고, 상기 분석된 경찰의 역량과 경찰 조직의 요구와 시민의 요구에 따라 현장 경찰의 핵심 역량에 대해서 인권존중 항목, 현장에서의 소통 항목, 직무의 성 실성 항목, 동료와의 협업 항목 및 법집행 공정성 항목을 설정하고, 5개의 현장 경찰의 핵심 역량에 대해 시민 과 업무에 따른 지향점과 개인적인 차원과 집단적 차원으로 구분하며, 상기 인권존중 항목은, 시민지향의 개인 차원 역량이고, 상기 현장에서의 소통 항목은, 시민지향의 집단차원 역량이고, 상기 직무의 성실성 항목은, 업 무지향의 개인차원 역량이고, 상기 동료와의 협업 항목은, 업무지향의 집단차원 역량이고, 상기 법집행 공정성 항목은, 시민과 업무 및 개인과 집단에 모두 작동할 뿐 아니라 현장 경찰관의 법집행력을 강화하는데 준거가 되 는 통합적 역량이며, 상기 제어부는, 현장 경찰의 역량 파악을 위해서 상기 인권존중 항목, 상기 현장에서 소통 항목, 상기 직무의 성실성 항목, 상기 동료와의 협업 항목 및 상기 법집행 공정성 항목에 따라 상기 항목별 행 동지표를 도출하고, 상기 도출된 항목별 행동지표, 상기 수신된 상기 서브 훈련 상황별 복수의 입력값, 상기 서 브 훈련 상황별 복수의 다른 입력값 및 상기 서브 훈련 상황별 복수의 또 다른 입력값을 근거로 상기 평가 결과 를 생성할 수 있다. 본 발명의 실시예에 따른 실감형 가상훈련 방법은 제어부에 의해, 저장부에 미리 저장된 흉기난동과 관련한 복 수의 훈련 시나리오 중에서 어느 하나의 훈련 시나리오를 랜덤하게 선택하는 단계; 상기 제어부에 의해, 상기 훈련 시나리오에 따른 복수의 단계별 훈련 상황 중에서 미리 설정된 준비 단계, 대처 단계 및 사후조치 단계에 각각 대응하는 준비 단계 실감형 콘텐츠, 대처 단계 실감형 콘텐츠 및 사후조치 단계 실감형 콘텐츠를 표시부 및 음성 출력부를 통해 순차로 출력하도록 제어하는 단계; 상기 제어부에 의해, 입력부를 통해 사용자 입력에 따른 상기 준비 단계와 관련한 서브 훈련 상황별 복수의 입력값, 상기 대처 단계와 관련한 서브 훈련 상황별 복 수의 다른 입력값 및 상기 사후조치 단계와 관련한 서브 훈련 상황별 복수의 또 다른 입력값을 훈련자별로 각각 수신하도록 제어하는 단계; 상기 제어부에 의해, 훈련자별로 수신된 상기 서브 훈련 상황별 복수의 입력값, 상 기 서브 훈련 상황별 복수의 다른 입력값, 상기 서브 훈련 상황별 복수의 또 다른 입력값 및 미리 설정된 항목 별 행동지표를 근거로 평가 결과를 생성하는 단계; 및 상기 제어부에 의해, 상기 생성된 평가 결과를 상기 표시 부 및 상기 음성 출력부를 통해 출력하도록 제어하는 단계를 포함하며, 상기 제어부는, 경찰의 직무분류 및 성 과평가와 교육훈련 체계를 바탕으로 현장경찰관의 직무를 분석하여 경찰의 역량을 분석하고, 경찰헌장과 경찰청 장 취임사 및 경찰교육기관의 교육목표를 바탕으로 경찰 조직의 요구를 분석하고, 경찰의 역할 및 책임에 대해 수집된 신문기사와 논문을 통해 시민의 요구를 분석하고, 상기 분석된 경찰의 역량과 경찰 조직의 요구와 시민 의 요구에 따라 현장 경찰의 핵심 역량에 대해서 인권존중 항목, 현장에서의 소통 항목, 직무의 성실성 항목, 동료와의 협업 항목 및 법집행 공정성 항목을 설정하고, 5개의 현장 경찰의 핵심 역량에 대해 시민과 업무에 따 른 지향점과 개인적인 차원과 집단적 차원으로 구분하며, 상기 인권존중 항목은, 시민지향의 개인차원역량이고, 상기 현장에서의 소통 항목은, 시민지향의 집단차원 역량이고, 상기 직무의 성실성 항목은, 업무지향 의 개인차원 역량이고, 상기 동료와의 협업 항목은, 업무지향의 집단차원 역량이고, 상기 법집행 공정성 항목은, 시민과 업무 및 개인과 집단에 모두 작동할 뿐 아니라 현장 경찰관의 법집행력을 강화하는데 준거가 되 는 통합적 역량이며, 상기 항목별 행동지표는, 현장 경찰의 역량 파악을 위해서 상기 인권존중 항목, 상기 현장 에서 소통 항목, 상기 직무의 성실성 항목, 상기 동료와의 협업 항목 및 상기 법집행 공정성 항목에 따라 도출 될 수 있다."}
{"patent_id": "10-2023-0003323", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 현장에 출동하는 경찰관 등을 대상으로 다양한 현장 상황을 반영한 실감형 가상훈련을 제공함으로써, 현장 경찰관 등에 대한 법집행력을 강화할 수 있는 효과가 있다. 또한, 본 발명은 법집행 공정성, 인권존중, 현장에서의 소통, 직무의 성실성, 동료와의 협업 등을 고려하여 생 성된 역량 모델을 근거로 다양한 상황별로 학습자가 수행하는 내용에 대해 평가하고, 평가 결과를 제공함으로써, 치안 현장 대응력 및 교육 효율성을 높이고, 학습자의 훈련 효과에 대한 만족도를 향상시킬 수 있는 효과가 있다."}
{"patent_id": "10-2023-0003323", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명에서 사용되는 기술적 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려 는 의도가 아님을 유의해야 한다. 또한, 본 발명에서 사용되는 기술적 용어는 본 발명에서 특별히 다른 의미로 정의되지 않는 한, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 의미로 해석되어야 하며, 과도하게 포괄적인 의미로 해석되거나, 과도하게 축소된 의미로 해석되지 않아야 한다. 또한, 본 발명에서 사용되는 기술적인 용어가 본 발명의 사상을 정확하게 표현하지 못하는 잘못된 기술적 용어일 때에 는 당업자가 올바르게 이해할 수 있는 기술적 용어로 대체되어 이해되어야 할 것이다. 또한, 본 발명에서 사용 되는 일반적인 용어는 사전에 정의되어 있는 바에 따라, 또는 전후 문맥상에 따라 해석되어야 하며, 과도하게 축소된 의미로 해석되지 않아야 한다. 또한, 본 발명에서 사용되는 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한 복수의 표현을 포함한다. 본 발명에서 \"구성된다\" 또는 \"포함한다\" 등의 용어는 발명에 기재된 여러 구성 요소들 또는 여러 단계를 반드 시 모두 포함하는 것으로 해석되지 않아야 하며, 그 중 일부 구성 요소들 또는 일부 단계들은 포함되지 않을 수 도 있고, 또는 추가적인 구성 요소 또는 단계들을 더 포함할 수 있는 것으로 해석되어야 한다. 또한, 본 발명에서 사용되는 제 1, 제 2 등과 같이 서수를 포함하는 용어는 구성 요소들을 설명하는데 사용될 수 있지만, 구성 요소들은 용어들에 의해 한정되어서는 안 된다. 용어들은 하나의 구성 요소를 다른 구성 요소 로부터 구별하는 목적으로만 사용된다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제 1 구성 요소는 제 2 구성 요소로 명명될 수 있고, 유사하게 제 2 구성 요소도 제 1 구성 요소로 명명될 수 있다. 이하, 첨부된 도면을 참조하여 본 발명에 따른 바람직한 실시예를 상세히 설명하되, 도면 부호에 관계없이 동일 하거나 유사한 구성 요소는 동일한 참조 번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 또한, 본 발명을 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 또한, 첨부된 도면은 본 발명의 사상을 쉽게 이해할 수 있도록 하기 위한 것일 뿐, 첨부된 도면에 의해 본 발명의 사상이 제한되는 것으로 해석되어서는 아니 됨을 유의해야 한다. 도 1은 본 발명의 실시예에 따른 실감형 가상훈련 장치의 구성을 나타낸 블록도이다. 도 1에 도시한 바와 같이, 실감형 가상훈련 장치는 통신부, 저장부, 입력부, 표시부, 음성 출력부 및 제어부로 구성된다. 도 1에 도시된 실감형 가상훈련 장치의 구성 요소 모두가 필수 구성 요소인 것은 아니며, 도 1에 도시된 구성 요소보다 많은 구성 요소에 의해 실감형 가상훈련 장치 가 구현될 수도 있고, 그보다 적은 구성 요소에 의해서도 실감형 가상훈련 장치가 구현될 수도 있다. 상기 실감형 가상훈련 장치는 스마트폰(Smart Phone), 휴대 단말기(Portable Terminal), 이동 단말기 (Mobile Terminal), 폴더블 단말기(Foldable Terminal), 개인 정보 단말기(Personal Digital Assistant: PDA), PMP(Portable Multimedia Player) 단말기, 텔레매틱스(Telematics) 단말기, 내비게이션(Navigation) 단말기, 개인용 컴퓨터(Personal Computer), 노트북 컴퓨터, 슬레이트 PC(Slate PC), 태블릿 PC(Tablet PC), 울트라북 (ultrabook), 웨어러블 디바이스(Wearable Device, 예를 들어, 워치형 단말기(Smartwatch), 글래스형 단말기 (Smart Glass), HMD(Head Mounted Display) 등 포함), 와이브로(Wibro) 단말기, IPTV(Internet Protocol Television) 단말기, 스마트 TV, 디지털방송용 단말기, AVN(Audio Video Navigation) 단말기, A/V(Audio/Video) 시스템, 플렉시블 단말기(Flexible Terminal), 디지털 사이니지 장치 등과 같은 다양한 단말 기에 적용될 수 있다. 이때, 상기 실감형 가상훈련 장치는 증강현실(Augmented Reality: AR), 가상현실 (Virtual Reality: VR), 혼합현실(Mixed Reality: MR), 메타버스(Metaverse) 등의 형태로 제공되는 콘텐츠를 통해 다양한 훈련 기능을 수행하고자 하는 사용자(또는 훈련자/학습자)가 소지한 단말일 수 있다. 상기 통신부는 유/무선 통신망을 통해 내부의 임의의 구성 요소 또는 외부의 임의의 적어도 하나의 단말기 와 통신 연결한다. 이때, 상기 외부의 임의의 단말기는 서버(미도시), 다른 단말(미도시) 등을 포함할 수 있다. 여기서, 무선 인터넷 기술로는 무선랜(Wireless LAN: WLAN), DLNA(Digital Living Network Alliance), 와이브 로(Wireless Broadband: Wibro), 와이맥스(World Interoperability for Microwave Access: Wimax), HSDPA(High Speed Downlink Packet Access), HSUPA(High Speed Uplink Packet Access), IEEE 802.16, 롱 텀 에볼루션(Long Term Evolution: LTE), LTE-A(Long Term Evolution-Advanced), 광대역 무선 이동 통신 서비스 (Wireless Mobile Broadband Service: WMBS) 등이 있으며, 상기 통신부는 상기에서 나열되지 않은 인터넷 기술까지 포함한 범위에서 적어도 하나의 무선 인터넷 기술에 따라 데이터를 송수신하게 된다. 또한, 근거리 통 신 기술로는 블루투스(Bluetooth), RFID(Radio Frequency Identification), 적외선 통신(Infrared Data Association: IrDA), UWB(Ultra Wideband), 지그비(ZigBee), 인접 자장 통신(Near Field Communication: NFC), 초음파 통신(Ultra Sound Communication: USC), 가시광 통신(Visible Light Communication: VLC), 와이 파이(Wi-Fi), 와이 파이 다이렉트(Wi-Fi Direct) 등이 포함될 수 있다. 또한, 유선 통신 기술로는 전력선 통신 (Power Line Communication: PLC), USB 통신, 이더넷(Ethernet), 시리얼 통신(serial communication), 광/동축 케이블 등이 포함될 수 있다. 또한, 상기 통신부는 유니버설 시리얼 버스(Universal Serial Bus: USB)를 통해 임의의 단말과 정보를 상 호 전송할 수 있다. 또한, 상기 통신부는 이동통신을 위한 기술표준들 또는 통신방식(예를 들어, GSM(Global System for Mobile communication), CDMA(Code Division Multi Access), CDMA2000(Code Division Multi Access 2000), EV-DO(Enhanced Voice-Data Optimized or Enhanced Voice-Data Only), WCDMA(Wideband CDMA), HSDPA(High Speed Downlink Packet Access), HSUPA(High Speed Uplink Packet Access), LTE(Long Term Evolution), LTE- A(Long Term Evolution-Advanced) 등)에 따라 구축된 이동 통신망 상에서 기지국, 상기 단말, 상기 서버 등과 무선 신호를 송수신한다. 또한, 상기 통신부는 상기 제어부의 제어에 의해, 상기 입력부를 통해 수신된(또는 수집된) 다 양한 정보 등을 상기 단말, 상기 서버 등에 전송한다. 상기 저장부는 다양한 사용자 인터페이스(User Interface: UI), 그래픽 사용자 인터페이스(Graphic User Interface: GUI) 등을 저장한다. 또한, 상기 저장부는 상기 실감형 가상훈련 장치가 작동하는데 필요한 데이터와 프로그램 등을 저장 한다. 즉, 상기 저장부는 상기 실감형 가상훈련 장치에서 구동되는 다수의 응용 프로그램(application program 또는 애플리케이션(application)), 실감형 가상훈련 장치의 작동을 위한 데이터들, 명령어들을 저 장할 수 있다. 이러한 응용 프로그램 중 적어도 일부는 무선 통신을 통해 외부 서버로부터 다운로드 될 수 있다. 또한, 이러한 응용 프로그램 중 적어도 일부는 실감형 가상훈련 장치의 기본적인 기능을 위하여 출 고 당시부터 실감형 가상훈련 장치 상에 존재할 수 있다. 한편, 응용 프로그램은 상기 저장부에 저장되고, 실감형 가상훈련 장치에 설치되어, 제어부에 의하여 상기 실감형 가상훈련 장치의 작동 (또는 기능)을 수행하도록 구동될 수 있다. 또한, 상기 저장부는 플래시 메모리 타입(Flash Memory Type), 하드 디스크 타입(Hard Disk Type), 멀티 미디어 카드 마이크로 타입(Multimedia Card Micro Type), 카드 타입의 메모리(예를 들면, SD 또는 XD 메모리 등), 자기 메모리, 자기 디스크, 광디스크, 램(Random Access Memory: RAM), SRAM(Static Random Access Memory), 롬(Read-Only Memory: ROM), EEPROM(Electrically Erasable Programmable Read-Only Memory), PROM(Programmable Read-Only Memory) 중 적어도 하나의 저장매체를 포함할 수 있다. 또한, 실감형 가상훈련 장치는 인터넷(internet)상에서 저장부의 저장 기능을 수행하는 웹 스토리지(web storage)를 운영하 거나, 또는 상기 웹 스토리지와 관련되어 작동할 수도 있다. 또한, 상기 저장부는 상기 제어부의 제어에 의해 상기 입력부를 통해 수신된(또는 수집된) 다양 한 정보 등을 저장한다. 상기 입력부는 사용자에 의한 버튼 조작 또는 임의의 기능 선택에 따른 신호를 수신하거나, 디스플레이되 는 화면을 터치/스크롤하는 등의 조작에 의해 생성된 명령 또는 제어 신호를 수신한다. 또한, 상기 입력부는 사용자에 의해 입력된 정보에 대응하는 신호를 수신하며, 키 패드(Key Pad), 돔 스위 치 (Dome Switch), 터치 패드(예를 들어 접촉식 정전 용량 방식, 압력식 저항막 방식, 적외선 감지 방식, 표면 초음파 전도 방식, 적분식 장력 측정 방식, 피에조 효과 방식 등 포함), 터치 스크린(Touch Screen), 조그 휠, 조그 스위치, 조그 셔틀(Jog Shuttle), 조이스틱, 마우스(mouse), 스타일러스 펜(Stylus Pen), 터치 펜(Touch Pen) 등의 다양한 장치가 사용될 수 있다. 또한, 상기 입력부는 오디오 신호 또는 비디오 신호를 입력받기 위한 적어도 하나 이상의 마이크(미도시) 와 카메라(미도시) 등을 포함할 수 있다. 상기 마이크는 통화 모드, 녹음 모드, 음성 인식 모드, 영상 회의 모 드, 영상 통화 모드 등에서 마이크로폰(Microphone)에 의해 외부의 음향 신호(사용자의 음성(음성 신호 또는 음 성 정보) 포함)를 수신하여 전기적인 음성 데이터로 처리한다. 또한, 상기 처리된 음성 데이터는 상기 음성 출 력부를 통해 출력하거나 또는 상기 통신부를 통하여 외부 단말기로 송신 가능한 형태로 변환되어 출 력될 수 있다. 또한, 상기 마이크는 외부의 음향 신호를 입력받는 과정에서 발생하는 잡음을 제거하기 위한 다 양한 잡음 제거 알고리즘이 구현될 수도 있다. 또한, 상기 카메라는 영상 통화 모드, 촬영 모드, 영상 회의 모드 등에서 이미지 센서(카메라 모듈 또는 카메라)에 의해 얻어지는 정지영상 또는 동영상 등의 화상 프레임을 처리한다. 즉, 코덱(CODEC)에 따라 상기 이 미지 센서에 의해 얻어지는 해당 화상 데이터들을 각 규격에 맞도록 인코딩/디코딩한다. 상기 처리된 화상 프레 임은 상기 제어부의 제어에 의해 상기 표시부에 표시될 수 있다. 일 예로, 상기 카메라는 객체(또는 피사체)(사용자 영상 또는 화상 회의자)를 촬영하고, 그 촬영된 영상(피사체 영상)에 대응하는 비디오 신호를 출력한다. 또한, 상기 카메라에서 처리된 화상 프레임은 상기 저장부에 저장되거나 상기 통신부를 통해 상기 단 말, 상기 서버 등에 전송될 수 있다. 또한, 상기 입력부에 포함된 조이스틱은 사용자 제어(또는 사용자 조작/작동)에 따른 제어 신호를 수신한 다. 이때, 상기 조이스틱은 상기 표시부에 표시되는 실감형 콘텐츠에 포함된 하나 이상의 메뉴(또는 항목/ 버튼) 중에서 해당 사용자 제어에 따라 선택되는 특정 메뉴(또는 항목/버튼)에 대응하는 정보(또는 제어 신호/ 데이터)를 수신할 수 있다. 상기 표시부(또는 디스플레이부)는 상기 제어부의 제어에 의해 상기 저장부에 저장된 사용자 인 터페이스 및/또는 그래픽 사용자 인터페이스를 이용하여 다양한 메뉴 화면 등과 같은 다양한 콘텐츠를 표시할 수 있다. 여기서, 상기 표시부에 표시되는 콘텐츠는 다양한 텍스트 또는 이미지 데이터(각종 정보 데이터 포함)와 아이콘, 리스트 메뉴, 콤보 박스 등의 데이터를 포함하는 메뉴 화면 등을 포함한다. 또한, 상기 표시부 는 터치 스크린 일 수 있다. 또한, 상기 표시부는 액정 디스플레이(Liquid Crystal Display: LCD), 박막 트랜지스터 액정 디스플레이 (Thin Film Transistor-Liquid Crystal Display: TFT LCD), 유기 발광 다이오드(Organic Light-Emitting Diode: OLED), 플렉시블 디스플레이(Flexible Display), 3차원 디스플레이(3D Display), 전자잉크 디스플레이 (e-ink display), LED(Light Emitting Diode) 중에서 적어도 하나를 포함할 수 있다.또한, 상기 표시부는 HMD(Head Mounted Display), 구글 글래스, 웨어러블 디스플레이 중에서 적어도 하나 를 포함할 수 있다. 또한, 상기 표시부는 상기 제어부의 제어에 의해 실감형 콘텐츠를 표시한다. 상기 음성 출력부는 상기 제어부에 의해 소정 신호 처리된 신호에 포함된 음성 정보를 출력한다. 여 기서, 상기 음성 출력부에는 리시버(receiver), 스피커(speaker), 버저(buzzer) 등이 포함될 수 있다. 또한, 상기 음성 출력부는 상기 제어부에 의해 생성된 안내 음성을 출력한다. 또한, 상기 음성 출력부는 상기 제어부의 제어에 의해 상기 실감형 콘텐츠 등에 대응하는 음성 정보 (또는 음향 정보) 등을 출력한다. 상기 제어부(controller, 또는 MCU(microcontroller unit)는 상기 실감형 가상훈련 장치의 전반적인 제어 기능을 실행한다. 또한, 상기 제어부는 상기 저장부에 저장된 프로그램 및 데이터를 이용하여 실감형 가상훈련 장치 의 전반적인 제어 기능을 실행한다. 상기 제어부는 RAM, ROM, CPU, GPU, 버스를 포함할 수 있으며, RAM, ROM, CPU, GPU 등은 버스를 통해 서로 연결될 수 있다. CPU는 상기 저장부에 액세스하여, 상기 저장 부에 저장된 O/S를 이용하여 부팅을 수행할 수 있으며, 상기 저장부에 저장된 각종 프로그램, 콘텐츠, 데이터 등을 이용하여 다양한 작동을 수행할 수 있다. 또한, 상기 제어부는 상기 서버 등과의 연동에 의해, 상기 서버 등에서 제공하는 전용 앱 및/또는 웹 사이 트를 통해 실감형 가상훈련 기능, 실감형 콘텐츠 출력 기능 등을 제공받기 위한 사용자로 회원 가입하며, 개인 정보 등을 상기 서버에 등록한다. 이때, 상기 개인 정보는 아이디, 이메일 주소, 패스워드(또는 비밀번호), 이 름, 성별, 생년월일, 연락처(또는 전화번호), 주소지 등을 포함한다. 또한, 상기 제어부는 해당 실감형 가상훈련 장치의 사용자가 가입한 SNS 계정 정보 또는 모바일 메신 저 계정 정보를 이용하여 상기 서버 등에 사용자로 회원 가입할 수도 있다. 여기서, 상기 SNS 계정은 페이스북, 트위터, 카카오 스토리, 네이버, 페이코(PAYCO) 등과 관련한 정보일 수 있다. 또한, 상기 모바일 메신저 계정은 카카오톡(KakaoTalk), 라인(line), 바이버(viber), 위챗(wechat), 와츠앱(whatsapp), 텔레그램(Telegram), 스 냅챗(snapchat) 등과 관련한 정보일 수 있다. 또한, 회원 가입 절차 수행 시, 상기 제어부는 본인 인증 수단(예를 들어 이동 전화, 신용카드, 아이핀 등 포함)을 통한 인증 기능을 완료해야 상기 서버 등에 대한 회원 가입 절차를 정상적으로 완료할 수 있다. 또한, 회원 가입이 완료된 후, 상기 제어부는 상기 서버 등에서 제공하는 서비스를 이용하기 위해서, 상기 서버 등으로부터 제공되는 전용 앱(또는 애플리케이션/응용 프로그램/특정 앱)을 해당 실감형 가상훈련 장치 에 설치한다. 이때, 상기 전용 앱은 실감형 가상훈련 기능, 실감형 콘텐츠 출력 기능 등을 수행하기 위한 앱일 수 있다. 또한, 상기 제어부는 현재 경찰의 직무분류 및 성과평가와 교육훈련 체계를 바탕으로 현장경찰관의 직무를 분석하여, 경찰의 역량을 종합적으로 분석한다. 또한, 상기 제어부는 경찰헌장과 경찰청장 취임사 및 경찰교육기관의 교육목표를 바탕으로 경찰 조직의 요 구를 파악(또는 분석)한다. 또한, 상기 제어부는 경찰의 역할 및 책임에 대해 수집된 신문기사, 논문 등을 통해 시민의 요구를 파악 (또는 분석)한다. 또한, 상기 제어부는 상기 분석된 정보들에 따라 도출한 현장경찰의 역량에 대해 경찰청의 실무자, 경찰인 재개발원의 실무자, 현장 경찰관 등으로 이루어진 전문가 협의 회의에서의 검토 결과를 반영하여, 다음의 [표 1]과 같이, 현장경찰의 핵심 역량에 대해서 인권존중, 현장에서 소통, 직무의 성실성, 동료와의 협업, 법집행 공정성 등을 확인(또는 확정/설정)한다.표 1"}
{"patent_id": "10-2023-0003323", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "기준국민기대 경찰조직의 요구 경찰 역량 선행연구 뉴스('01 ~'20)경찰 윤리헌장경찰청장 취임사신임경찰 관 교육목표경찰 성과측정 요소지역 경찰 경찰지구대 경찰 인권존중인권 인권 인권국민우선인권 - - - 법집행 공 정성절차적 공정성공정성법과 원칙 에 따른 공정법과 원칙 을 준수법집행 공정성공정성공정업무 처리 법이해/적 용력법 절차 수행 직무의 성 실성- 성실성적극성 - - 성실성 적극성업무성실 성 업무적극 성- 현장에서 소통의견 경철친절성 -국민우선시민에 대 한 봉사 친절성시민지향 의사소통대민공감 력/의사소 통민원경청 의사소통 동료와의 협업-화합과 단 결- - - 팀워크팀워크 협업 기타 전문성청렴성 국민의 안 전안전 중립성 일관성현장중심 올바른 인성과 감 성청렴성 중립성 방범능력 범인검거 능력 신속성민첩성 체력 네트워크 문제해결 능력 대상식별 능력청렴성 대인관계 문제해결 력 정보수집 관리 상황판단 력 통합적사 고능력- 또한, 상기 제어부는 상기 확인된(또는 확정된/설정된) 5개의 핵심 역량을 구조화하여 잠정 역량 모형을 생성(또는 구성)한다. 여기서, 상기 5개의 현장경찰관의 핵심 역량은 시민과 업무에 따라 지향점을 가지고 있다. 또한, 역량을 개인적 차원과 집단적/업무적 차원으로 구분할 수도 있다.즉, 지향과 차원의 2가지 기준에 서 역을 재배치하면 상기 인권존중 역량은 시민지향의 개인차원 역량이고, 상기 현장에서의 소통 역량은 시민지 향의 집단차원 역량이다. 또한, 상기 직무의 성실성은 업무지향의 개인차원의 역량이고, 상기 동료와의 협업능 력은 업무지향의 집단차원의 역량이다. 또한, 상기 법집행 공정성은 시민과 업무 및 개인과 집단에 모두 작동할 뿐 아니라 현장경찰관의 법집행력을 강화하는데 준거가 되는 통합적 역량이다. 또한, 상기 제어부는 빅데이터 분석을 통해 각 역량에 대해 미리 설정된 개수(예를 들어 3개)의 행동지표 를 도출(또는 생성/정의/설정)한다. 이때, 상기 법집행 공정성과 관련한 행동지표는 타당성, 실효성, 일관성을 포함하고, 상기 인권존중과 관련한 행동지표는 생명권, 안전권, 자유권을 포함하고, 상기 현장에서 소통과 관련 한 행동지표는 구두소통, 문서소통, 배려를 포함하고, 상기 직무의 성실성과 관련한 행동지표는 기초지식, 직무 자세, 업무완수를 포함하고, 상기 동료와의 협업과 관련한 행동지표는 업무분장, 자원공유, 화합단결을 포함한 다. 또한, 상기 제어부는 상기 생성된 잠정 역량 모형을 지역경찰관서에 근무하고 있는 실무자로 이루어진 협 의회의 의견(또는 검토 결과)를 반영하여, 도 2에 도시된 바와 같이, 현장경찰관 역량 모델(또는 현장경찰관 역 량 모형)을 생성(또는 구성)한다. 이에 따라, 수정된 행동지표는 다음과 같다. 즉, 상기 도 2에 도시된 바와 같이, 상기 법집행 공정성과 관련한 행동지표는 규범적 타당성, 사실적 실효성, 일관성을 포함하고, 상기 인권존중과 관련한 행동지표는 권리보장, 안전보호, 긴급구조를 포함하고, 상기 현장 에서 소통과 관련한 행동지표는 전달, 수용, 배려를 포함하고, 상기 직무의 성실성과 관련한 행동지표는 기초판 단, 실행관리, 직무완수를 포함하고, 상기 동료와의 협업과 관련한 행동지표는 업무분장, 자원공유, 화합단결을 포함한다.이러한 개별 행동지표는 각기 인지적 영역, 정서적 영역, 심동적 영역에 특성을 나타낼 수 있다. 또한, 현장경 찰관의 역량이기 때문에 심동적 영역에 속한 행동지표가 상대적으로 많이 포함된 상태임을 확인할 수 있다. 또한, 상기 제어부는 평가준거를 고려하여 행동지표를 조작적으로 정의한다. 이때, 상기 제어부는 각 행동지표의 영역에 맞추어 상·중·하의 수준을 정하고, 도 3 내지 도 7에 도시된 바와 같이, 전자문서 형태로 수준에 적합하게 평가준거를 도출(또는 생성/설정)한다. 여기서, 상기 조작적 정의는 사회 조사를 위해 사물 또 는 현상을 객관적이고 경험적으로 기술한 것을 의미한다. 즉, 상기 제어부는 각 행동지표를 사용자(또는 학습자)의 특성에 따라 영역을 정하고 조작적으로 정의한 후, 수준에 따라 평가준거를 작성(또는 구성/생성)한다. 이와 같이, 상기 제어부는 현장경찰관에 대한 실감형 가상훈련을 제공하고, 그에 따른 평가를 위해서 상기 역량 모델(또는 상기 현장경찰관 역량 모델/상기 현장경찰관 역량 모형)을 생성할 수 있다. 이렇게 생성된 역량 모델은 현장경찰관을 위한 교육훈련체계를 만들고, 교육과정을 개발하여, 나아가 경력개발 체계를 개발하는데 기초로 사용할 수 있다. 또한, 상기 역량 모델은 모듈화된 교안의 교육방법으로 실감형 가상훈련 기반의 콘텐츠를 사용하는데 적용할 수 있다. 또한, 상기 역량 모델은 현장경찰관의 역량진단도구를 만드는데 사용할 수 있다. 또한, 상기 제어부는 사전에 수집된 복수의 학습용 데이터세트를 지속적인 기계학습(또는 딥러닝)의 데이 터로 활용한다. 여기서, 상기 기계학습을 위한 입력 데이터세트(또는 학습용 데이터세트)는 미리 설정된 비율 (예를 들어 7:3)로 훈련 세트(train set)와 테스트 세트(test set)로 분할하여, 훈련 및 테스트 기능을 수행할 수 있다. 또한, 상기 기계학습을 위한 입력 데이터세트는 추후 수집되는 서브 훈련 상황별 입력값 등을 포함한 다. 또한, 상기 기계학습을 위한 출력 데이터세트는 예측하고 싶은 부분으로, 서브 훈련 상황에 따른 학습자의 평가 결과 등을 포함한다. 즉, 상기 제어부는 미리 설정된 학습용 데이터를 통해 역량 모델(또는 역량 모형)에 대해서 특정 로우 데 이터와 관련해서 서브 훈련 상황에 따른 학습자의 평가 결과를 설정(또는 결정/생성)하기 위한 학습 기능을 수 행한다. 이때, 상기 제어부는 로우 데이터(예를 들어 서브 훈련 상황별 입력값 등 포함)를 병렬 및 분산하 여 저장하고, 저장된 로우 데이터(또는 학습용 데이터 등 포함) 내에 포함된 비정형(Unstructed) 데이터, 정형 (Structured) 데이터, 반정형 데이터(Semi-structured)를 정제하고, 메타 데이터로 분류를 포함한 전처리를 실 시하고, 전처리된 데이터를 데이터 마이닝(Data Mining)을 포함하는 분석을 실시하고 적어도 하나의 종류의 기 계학습에 기반하여 학습, 훈련 및 테스트를 진행하여 빅데이터를 구축할 수 있다. 이때, 적어도 하나의 종류의 기계학습은 지도 학습(Supervised Learning), 반지도 학습(Semi-Supervised Learning), 비지도 학습 (Unsupervised Learning), 강화 학습(Reinforcement Learning) 및 심층 강화 학습(Deep Reinforcement Learning) 중 어느 하나 또는 적어도 하나의 조합으로 이루어질 수 있다. 이와 같이, 상기 제어부는 상기 학습용 데이터 등을 통해서 뉴럴 네트워크(Neural Networks) 형태의 상기 역량 모델에 대해서 학습 기능을 수행한다. 또한, 상기 제어부는 해당 실감형 가상훈련 장치에 미리 설치된 전용 앱을 실행하고, 전용 앱 실행에 따른 앱 실행 결과 화면을 표시부에 표시한다. 이때, 상기 앱 실행 결과 화면은 가상현실, 증강현실, 혼합 현실, 메타버스 등의 형태로 제공될 수 있으며, 복수의 훈련 내용 중 어느 하나의 훈련 내용을 선택하기 위한 훈련 내용 선택 메뉴(또는 항목/버튼), 선택된 훈련 내용에 대응하는 훈련 시나리오와 관련한 실감형 콘텐츠를 제공하기 위한 시작 메뉴, 전용 앱 기능을 설정하기 위한 설정 메뉴 등을 포함한다. 여기서, 상기 복수의 훈련 내용은 흉기 난동자에 대한 대응을 훈련하기 위한 흉기난동 대응 메뉴, 집단폭력에 대한 대응을 훈련하기 위한 집단폭력 대응 메뉴, 치매노인에 대한 조치를 훈련하기 위한 치매노인 보호조치 메뉴, 정신질환자에 대한 조치 를 훈련하기 위한 정신질환자 보호조치 메뉴, 집회시위에 대한 대응을 훈련하기 위한 집회시위 대응 메뉴, 가정 폭력에 대한 조치를 훈련하기 위한 가정폭력 조치 메뉴, 주취자에 대한 보호조치를 훈련하기 위한 주취난동자 보호조치 메뉴, 살인사건 현장에 대한 초동조치를 훈련하기 위한 살인현장 초동조치 메뉴, 자살기도에 대한 대 응을 훈련하기 위한 자살기도 대처요령 메뉴, 성폭력 피해자에 대한 조사 방법을 훈련하기 위한 성폭력 피해자 조사 메뉴 등을 포함하며, 디폴트로 흉기 난동자에 대한 대응 훈련을 위해서 흉기난동 대응 메뉴가 선택된 상태 일 수 있다. 또한, 상기 표시부는 HMD(Head Mounted Display), 구글 글래스, 웨어러블 디스플레이 등일수 있다. 여기서, 동일 훈련에 참여하는 훈련자가 복수인 경우, 상기 제어부는 해당 훈련 내용(또는 훈련 과정)에 따라, 동일한 실감 콘텐츠를 복수의 훈련자가 각각 착용(또는 소지/보유) 중인 상기 표시부 및/또 는 음성 출력부를 통해 출력하도록 제어하거나 또는, 훈련 과정 중 서로 다른 실감 콘텐츠를 상기 복수의 훈련자가 각각 착용 중인 상기 표시부 및/또는 상기 음성 출력부를 통해 각각 출력하도록 제어할 수 도 있다. 이때, 사전에 훈련을 수행하기 위한 훈련자(또는 학습자)의 고유 아이디(또는 고유 코드), 해당 아이디를 포함 하는 바코드 또는 QR 코드 등을 이용해서 상기 전용 앱 실행 시 로그인 절차(또는 훈련자 정보 입력 절차)를 수 행하여, 해당 전용 앱의 하나 이상의 기능(예를 들어 실감형 가상훈련 기능 등 포함)을 수행할 수 있다. 또한, 상기 훈련자가 패용(또는 착용/소지) 중인 신분증에 구성된 RFID 또는 NFC를 통해 해당 훈련자의 고유 아이디 등을 인식하여, 상기 전용 앱 실행시 로그인 절차를 수행할 수도 있다. 또한, 상기 입력부를 통해 사용자 선택(또는 사용자 입력/터치/제어)에 따라 상기 표시부에 표시되는 상기 앱 실행 결과 화면에서 상기 시작 메뉴(또는 항목/버튼)가 선택되는 경우, 상기 제어부는 상기 저장 부에 미리 저장된 흉기난동과 관련한 복수의 훈련 시나리오 중에서 어느 하나의 훈련 시나리오를 랜덤하게 선택한다. 여기서, 상기 훈련 시나리오는 준비 단계, 대처 단계, 사후조치 단계, 평가 수행 단계, 평가결과 제 공 단계 등을 포함한다. 또한, 상기 표시부에 표시되는 복수의 훈련 내용 메뉴(또는 항목/버튼) 중에서 상기 입력부를 통해 사용자 선택(또는 사용자 입력/터치/제어)에 따라 어느 하나의 훈련 내용 메뉴가 선택되는 경우, 상기 제어부 는 상기 선택된 훈련 내용 메뉴에 대응하여 상기 저장부에 미리 저장된 훈련 내용별 복수의 훈련 시 나리오 중에서 상기 선택된 훈련 내용 메뉴에 대응하는 어느 하나의 훈련 시나리오를 랜덤하게 선택할 수도 있 다. 이와 같이, 상기 제어부는 미리 설정된 훈련 내용과 관련해서 어느 하나의 훈련 시나리오를 랜덤하게 선택 하거나 또는, 상기 표시부에 표시되는 복수의 훈련 내용 메뉴 중에서 선택되는 특정 훈련 내용 메뉴와 관 련해서 어느 하나의 훈련 시나리오를 랜덤하게 선택할 수 있다. 본 발명의 실시예에서는, 흉기 난동자에 대한 대응을 훈련하기 위한 내용을 주로 다루고 있으나, 이에 한정되는 것은 아니며, 상기 제어부는 집단폭력에 대한 대응을 훈련하기 위한 내용, 치매노인에 대한 조치를 훈련하 기 위한 내용, 정신질환자에 대한 조치를 훈련하기 위한 내용, 집회시위에 대한 대응을 훈련하기 위한 내용, 가 정폭력에 대한 조치를 훈련하기 위한 내용, 주취자에 대한 보호조치를 훈련하기 위한 내용, 살인사건 현장에 대 한 초동조치를 훈련하기 위한 내용, 자살기도에 대한 대응을 훈련하기 위한 내용, 성폭력 피해자에 대한 조사 방법을 훈련하기 위한 내용 등과 관련해서 실감형 가상훈련 기능을 제공할 수도 있다. 또한, 상기 제어부는 상기 훈련 시나리오에 따른 복수의 단계별 훈련 상황 중에서 미리 설정된 준비 단계 에 대응하는 준비 단계 실감형 콘텐츠를 상기 표시부 및/또는 음성 출력부를 통해 출력한다. 여기서, 상기 준비 단계 실감형 콘텐츠는 경찰차 차량 내부 화면 영역, 흉기난동 현장 입구/주변 영역, 서브 훈련 상황 별 시스템 메시지 표시 영역, 서브 훈련 상황별 선택지 옵션 표시 영역 등으로 구성된 사용자 인터페이스를 포 함하며, 신고 접수에 따른 신고 접수 내용(또는 신고 녹취록) 출력 정보(또는 데이터/상황 정보), 출동 및 현장 상황 파악 정보, 현장 대처 계획 수립 정보, 현장 진입 전 준비 정보 등의 복수의 서브 훈련 상황(또는 복수의 서브 훈련 상황 콘텐츠)을 포함한다. 이때, 상기 출동 및 현장 상황 파악 정보는 신고 접수 내용 이해에 따라 학습자가 정확한 현장 상황을 파악하기 위해서 무엇을 해야하는지에 대해 알고 있는지를 확인(또는 판단)하기 위해서, 신고 접수 내용 이해 정보(또는 신고 접수 내용 이해 정보/항목)(예를 들어 신고자에게 연락 등 포함), 신고자 연락에 따라 학습자가 현장 상황을 정확하게 파악하기 위해서 무엇을 확인해야 하는지에 대해서 알고 있 는지를 확인하기 위해서 현장 상황 정보 수집을 위한 정보(또는 신고자에게 연락 항목)(예를 들어 난동행위자 상태, 난동행위자 인원, 흉기소지 여부, 흉기 종류, 피해자 부상 정도, 현장의 정확한 위치, 현장의 밀집도 등 포함) 등을 포함한다. 또한, 상기 현장 대처 계획 수립 정보는 파악된 현장 상황 정보에 따른 현장 상황 종합 정리 정보(예를 들어 흉기난동, 피해자 있음, 피해자 없음, 난동행위자 1명, 다수의 난동행위자 등 포함), 흉기 난동 대응에 필요한 업무를 정확하게 파악하고 있는지 확인하기 위해서 현장 상황 종합 정리 정보에 대응하는 현장 업무 계획 정보(예를 들어 신분고지, 행위자 제압, 피해자 구조, 행위자 체포 및 수색, 피해 조사, 증거확 보, 증원인력 도착 확인, 가/피해자 분리, 블랙박스 작동확인 등 포함), 동료와 함께 처리해야 할 업무가 무엇 인지에 대해 알고 있는지를 확인하기 위해서 학습자 역할 분담 정보(예를 들어 행위자 체포 및 위험요소 차단, 피해자 구조 및 피해조사 등 포함) 등을 포함한다. 또한, 상기 현장 진입 전 준비 정보는 현장 도착 시 112 치안종합상황실에 현장 도착 상황 보고 여부를 알고 있는지를 확인하기 위해서 112 치안종합상황실 보고 정보, 현 장 진입 전 증원 인력이 도착했는지 여부를 알고 있는지를 확인하기 위해서 증원 인력 도착 확인 정보, 안전을 위해 흉기난동 상황 대응 전 안전장비 착용 필요성을 알고 어떤 장비를 착용해야 함을 알고 있는지를 확인하기 위해서 안전 장구 착용 정보(또는 방검 장비 착용 정보)(예를 들어 방검복, 안전 장갑, 방패 등 포함) 등을 포 함한다. 또한, 상기 제어부는 상기 입력부를 통해 사용자 입력(또는 사용자 선택/터치/제어/반응)에 따른 해 당 준비 단계에서의 상기 준비 단계 실감형 콘텐츠에 포함된 복수의 서브 훈련 상황에 대응하는 복수의 입력값 을 서브 훈련 상황별(또는 서브 훈련 상황별 복수의 입력값)로 수신한다. 이때, 상기 제어부는 훈련자별 평가를 위해서 복수의 훈련자별로 서브 훈련 상황별 복수의 입력값을 각각 수신한다. 본 발명의 실시예에서는, 상기 입력부에 포함된 조이스틱을 이용해서, 사용자 선택에 따른 기능을 수행하 는 것을 주로 설명하고 있으나, 이에 한정되는 것은 아니며, 상기 제어부는 상기 입력부에 포함된 마 이크를 통해 수신된 학습자의 음성 정보에 대해 음성 인식 기능을 수행하고, 음성 인식 기능 수행 결과에 대응 하여 해당 기능을 수행할 수도 있다. 이와 같이, 상기 훈련 시나리오에 포함된 준비 단계와 관련해서, 준비 단계 실감형 콘텐츠에 포함된 복수의 서 브 훈련 상황과 관련한 콘텐츠를 출력하고, 그에 따른 학습자의 반응에 의한 복수의 훈련자별로 서브 훈련 상황 별 복수의 입력값을 각각 수신(또는 수집)할 수 있다. 또한, 이와 같이, 상기 제어부는 상기 표시부 및/또는 상기 음성 출력부를 통해 출력되는 실감 형 콘텐츠에 대해서 훈련자와의 인터랙션을 통해 해당 훈련자의 선택에 따른 서브 훈련 상황별 복수의 입력값을 수신할 수 있다. 또한, 상기 제어부는 상기 훈련 시나리오에 따른 복수의 단계별 훈련 상황 중에서 미리 설정된 대처 단계 에 대응하는 대처 단계 실감형 콘텐츠를 상기 표시부 및/또는 상기 음성 출력부를 통해 출력한다. 여 기서, 상기 대처 단계 실감형 콘텐츠는 흉기 난동 발생 장소 화면 영역, 서브 훈련 상황별 시스템 메시지 표시 영역, 서브 훈련 상황별 선택지 옵션 표시 영역 등으로 구성된 사용자 인터페이스를 포함하며, 난동행위자에 접 근, 고지 및 위험요소 차단 정보, 난동행위자 대처 정보, 물리력 대응 정보, 학습자 역할 분리에 따른 행위자 체포 정보, 난동현장 조치 정보, 학습자 역할 분리에 따른 피해자 구조 정보, 피해자 이송 정보, 피해자 인계 정보, 주변 조사 정보 등의 복수의 다른 서브 훈련 상황(또는 복수의 다른 서브 훈련 상황 콘텐츠)을 포함한다. 이때, 상기 난동행위자에 접근, 고지 및 위험요소 차단 정보는 위험 요소를 정확히 파악하고 이를 제거했는지를 확인하기 위해서 피해 장소에서의 위험 요소 차단 정보(예를 들어 깨진 술병, 가위, 프라이팬 등 포함), 도주로 차단 필요성을 알고 적합한 자리/위치를 선택할 수 있고 경찰관의 안전을 위한 안전거리 확보 필요성을 알고 이 를 실행할 수 있는지를 확인하기 위해서 안전거리를 고려한 난동행위자에게 접근하기 위한 정보(또는 난동행위 자에 접근 정보)(예를 들어 난동행위자 앞, 난동행위자 옆 등 포함), 필요한 고지 사항을 정확하게 알고 있는지 를 확인하기 위해서 신분 및 촬영 고지를 안내하기 위한 정보, 난동행위 중단 경고의 필요성을 알고 있는지를 확인하기 위해서 난동행위자의 행동(또는 난동)에 따른 난동행위 중단 경고를 위한 정보, 흉기를 버릴 것을 경 고해야 함을 알고 있는지를 확인하기 위해서 흉기 소지 시 흉기 버릴 것을 경고하기 위한 정보 등을 포함한다. 또한, 상기 난동행위자 대처 정보는 난동행위자의 상태, 저항 수준, 현장 상황을 정확하게 판단할 수 있는지를 확인하기 위해서 행위자 상황 및 현장 상황 판단 정보(예를 들어 행위자 상태, 난동 상황, 위험물 소지 여부, 음주, 흥분 상태, 가/피해자 분리, 가/피해자 미분리 등 포함), 부적절/불필요하거나 난동행위자를 도발하지 않 고 난동행위자를 미리 설정된 '순응' 상태로 이끌어내기(또는 유도하기) 위한 상황과 언어를 선택할 수 있는지 를 확인하기 위해서 난동행위자의 행동(또는 난동)에 따른 학습자의 반응 정보(예를 들어 행위 중단 설득, 행위 중단 경고, 무기 사용 고지, 총기 사용 고지 등 포함) 등을 포함한다. 또한, 상기 물리력 대응 정보는 적합한 물리력 대응 방법을 선택하기 위해 범죄 종류, 대상자(또는 훈련자/경찰관) 수, 흉기 종류, 난동행위자의 신체 및 건강 상태, 피해 상황, 저항 강도, 위해 급박성 등을 제대로 파악하고 있는지를 확인하기 위해서 난동행위자 의 저항 정도에 대한 정보(또는 난동행위자 저항 수준 파악 정보)(예를 들어 미리 설정된 순응, 소극적 저항, 적극적 저항, 폭력적 공격, 치명적 공격 등 포함), 학습자가 선택한 저항 정도에서 사용할 수 있는 물리력 행사 수단을 정확하게 알고 있는지를 확인하기 위해서 난동행위자의 저항 정도에 따른 물리력 행사 수단 선택 정보 (예를 들어 대화, 삼단봉/방패, 가스분사기, 테이저건, 권총 등 포함), 적합한 신체 부위에 물리력을 사용했는 지를 확인하기 위해서 물리력 행사 정보(예를 들어 머리, 팔, 복부, 허벅지, 손 등 포함) 등을 포함한다. 또한, 상기 학습자 역할 분리에 따른 행위자 체포 정보는 행위자 체포 정보, 미란다 원칙을 고지하였는지를 확인하기 위해서 행위자 권리 고지 정보, 난동행위자가 추가 위해 물건을 소지하고 있는지를 인지하고 있는지 확인하기위해서 행위자 수색 정보, 난동행위자 제압 후 난동행위자의 부상 여부 확인 필요성을 인지하고 있는지를 확인 하기 위해서 행위자 부상 확인 정보, 행위자 연행 정보 등을 포함한다. 또한, 상기 난동현장 조치 정보는 난동 현장 위험요소 차단 정보, 증거 사진/영상이 필요함을 알고 이를 확보하였는지를 확인하기 위해서 난동 현장 촬 영 정보 등을 포함한다. 또한, 상기 학습자 역할 분리에 따른 피해자 구조 정보는 본인(또는 학습자)이 아닌 119 구조 대원이 피해자 부상 정도를 확인하게 하였는지를 확인하기 위해서 피해자의 부상 정도(예를 들어 피해 자가 부상을 입지 않음, 피해자가 경미한 부상을 입음, 피해자가 심각한 부상을 입음 등 포함)에 따른 119 구조 대원에게 피해자 부상 여부 확인 요청 정보(예를 들어 119 구조대원에 확인 요청 등 포함), 피해자에게 치료 필 요 여부를 물어보았고, 피해자의 상태에 적합한 대처 방법을 결정하였는지를 확인하기 위해서 피해자 병원 치료 여부 확인 정보(예를 들어 부상 없음, 경미한 부상, 심각한 부상 등 포함), 피해자 병원 치료 여부 정보(예를 들어 피해자 병원 치료 거절, 피해자 병원 치료 요청 등 포함) 등을 포함한다. 또한, 상기 피해자 이송 정보는 피해자에게 피해 진술 절차와 지구대, 파출소, 치안센터 등으로의 이송 여부를 안내하고, 피해자가 진술 가능한 상태인지 여부를 확인하였는지를 확인하기 위해서 피해자가 병원 치료 거절 시, 지구대(또는 파출소, 치안센 터)로 피해자 이송을 위한 정보(예를 들어 지구대로 피해자 이송, 피해 진술 절차 안내, 진술 가능 상태 확인, 지구대 동행 안내, 피해자-가해자 분리하여 이송 등 포함), 피해자의 상태에 적합한 대처 방법을 결정하였고 피 해자에게 병원으로 이송됨을 안내하였는지를 확인하기 위해서 피해자가 병원 치료 요청 시, 119에 피해자 인계 를 위한 정보(예를 들어 119에 피해자 인계, 피해자에게 119로 인계됨을 안내, 112 치안종합상황실에 보고 등 포함) 등을 포함한다. 또한, 상기 피해자 인계 정보는 지구대로 피해자 이송시 피해 진술 절차 및 지구대 동행 안내 정보, 119에 피해자 인계시 피해자에게 병원 이송 안내 등을 포함한다. 또한, 상기 주변 조사 정보는 필요 한 목격자 정보를 수집하고 추후 출석 및 증거자료 요구 가능성을 공지했는지를 확인하기 위해서 목격자 정보 확보, 피해 상황 및 초기 발생 상황 관련 정보를 수집했는지를 확인하기 위해서 피해조사, CCTV 확보 필요성을 인지하고 CCTV 자료를 확보하였는지를 확인하기 위해서 증거확보 등을 포함한다. 또한, 상기 제어부는 상기 입력부를 통해 사용자 입력(또는 사용자 선택/터치/제어/반응)에 따른 해 당 대처 단계 실감형 콘텐츠에 포함된 복수의 다른 서브 훈련 상황에 대응하는 복수의 다른 입력값을 서브 훈련 상황별(또는 서브 훈련 상황별 복수의 다른 입력값)로 수신한다. 이때, 상기 제어부는 훈련자별 평가를 위 해서 복수의 훈련자별로 다른 서브 훈련 상황별 복수의 다른 입력값을 각각 수신한다. 이와 같이, 상기 훈련 시나리오에 포함된 대처 단계와 관련해서, 대처 단계 실감형 콘텐츠에 포함된 복수의 다 른 서브 훈련 상황과 관련한 콘텐츠를 출력하고, 그에 따른 학습자의 반응에 의한 복수의 훈련자별로 서브 훈련 상황별 복수의 다른 입력값을 각각 수신(또는 수집)할 수 있다. 또한, 이와 같이, 상기 제어부는 상기 표시부 및/또는 상기 음성 출력부를 통해 출력되는 실감 형 콘텐츠에 대해서 훈련자와의 인터랙션을 통해 해당 훈련자의 선택에 따른 서브 훈련 상황별 복수의 다른 입 력값을 수신할 수 있다. 또한, 상기 제어부는 상기 훈련 시나리오에 따른 복수의 단계별 훈련 상황 중에서 미리 설정된 사후조치 단계에 대응하는 사후조치 단계 실감형 콘텐츠를 상기 표시부 및/또는 상기 음성 출력부를 통해 출력 한다. 여기서, 상기 사후조치 단계 실감형 콘텐츠는 흉기 난동 발생 장소 화면 영역, 서브 훈련 상황별 시스템 메시지 표시 영역, 서브 훈련 상황별 선택지 옵션 표시 영역 등으로 구성된 사용자 인터페이스를 포함하며, 112 치안종합상황실에 상황 종료를 보고하였는지를 확인하기 위해서 사건 종결에 따른 발생보고 정보, 상황 종료 후 어떤 보고서를 작성해야 하는지를 알고 있는지 확인하기 위해서 보고서 작성 정보(예를 들어 물리력 사용 보고 서, 경찰 사용 장구 보고서, 현행범 체포서, 범죄신고 접수대장, 사건발생 검거보고 등 포함) 등의 복수의 또 다른 서브 훈련 상황(또는 복수의 또 다른 서브 훈련 상황 콘텐츠)을 포함한다. 이때, 상기 발생보고 정보는 촬 영된 난동 현장과 관련한 영상 정보, 수집된 증거 등을 포함한다. 또한, 상기 보고서 작성 정보는 난동 현장과 관련해서 미리 설정된 형식의 하나 이상의 보고서를 작성하기 위한 정보 등을 포함한다. 또한, 상기 제어부는 상기 입력부를 통해 사용자 입력(또는 사용자 선택/터치/제어/반응)에 따른 해 당 사후조치 단계 실감형 콘텐츠에 포함된 복수의 또 다른 서브 훈련 상황에 대응하는 복수의 또 다른 입력값을 서브 훈련 상황별(또는 서브 훈련 상황별 복수의 또 다른 입력값)로 수신한다. 이때, 상기 제어부는 훈련 자별 평가를 위해서 복수의 훈련자별로 서브 훈련 상황별 복수의 또 다른 입력값을 각각 수신한다. 이와 같이, 상기 훈련 시나리오에 포함된 사후조치 단계와 관련해서, 사후조치 단계 실감형 콘텐츠에 포함된 복 수의 또 다른 서브 훈련 상황과 관련한 콘텐츠를 출력하고, 그에 따른 학습자의 반응에 의한 복수의 훈련자별로 서브 훈련 상황별 복수의 또 다른 입력값을 각각 수신(또는 수집)할 수 있다.또한, 이와 같이, 상기 제어부는 상기 표시부 및/또는 상기 음성 출력부를 통해 출력되는 실감 형 콘텐츠에 대해서 훈련자와의 인터랙션을 통해 해당 훈련자의 선택에 따른 서브 훈련 상황별 복수의 또 다른 입력값을 수신할 수 있다. 또한, 본 발명에서 설명되는 다양한 실감형 콘텐츠(예를 들어 준비 단계 실감형 콘텐츠, 대처 단계 실감형 콘텐 츠, 사후조치 단계 실감형 콘텐츠 등 포함)에 각각 포함되는 정보(또는 데이터/항목)는 미리 설정된 특정범죄 가중처벌 등에 관한 법률, 위해성 경찰장비의 사용 기준 등에 관한 규정, 경찰 물리력 행사의 기준과 방법에 관 한 규칙, 경찰관 직무집행법, 관련 판례, 피해자 보호관 임무 체크리스트, 피해자 보호 및 지원에 관한 규칙 등 이 적용된(또는 반영된/근거로) 상태일 수 있다. 또한, 상기 제어부는 미리 설정된 항목별 행동지표, 상기 수신된 단계별 훈련 상황에 따른 입력값(예를 들 어 서브 훈련 상황별 복수의 입력값, 서브 훈련 상황별 복수의 다른 입력값, 서브 훈련 상황별 복수의 또 다른 입력값 등 포함) 등을 근거로 단계별 훈련 상황에 대한 평가 결과를 생성한다. 이때, 상기 항목별 행동지표는 법집행 공정성과 관련한 행동지표(예를 들어 규범적 타당성, 사실적 실효성, 일관성 등 포함), 인권존중과 관련 한 행동지표(예를 들어 권리보장, 안전보호, 긴급구조 등 포함), 현장에서 소통과 관련한 행동지표(예를 들어 전달, 수용, 배려 등 포함), 직무의 성실성과 관련한 행동지표(예를 들어 기초판단, 실행관리, 직무완수 등 포 함), 동료와의 협업과 관련한 행동지표(예를 들어 업무분장, 자원공유, 화합단결 등 포함) 등을 포함한다. 여기 서, 상기 평가 결과는 해당 훈련을 수행한 복수의 훈련자를 포함하는 하나의 팀에 대한 평가 결과이며, 총평, 훈련결과, 세부 훈련기록 등을 포함한다. 이때, 상기 총평(또는 전체 평가 결과/종합 평가 결과)은 복수의 훈련 자명, 훈련 시나리오, 훈련 소요시간, 훈련 점수, 방사형 그래프 형태의 복수의 역량별 결과, 훈련 총평 등을 포함한다. 또한, 상기 훈련결과(또는 미리 설정된 복수의 역량별 결과)는 미리 설정된 5대 역량과 관련한 시민 지향(예를 들어 인권존중, 현장에서의 소통 등 포함), 업무지향(예를 들어 직무의 성실성, 동료와의 협업 등 포 함), 통합(예를 들어 법집행 공정성 등 포함) 등의 훈련 방향에 대한 결과(예를 들어 상, 중, 하 등 포함), 세 부결과 등을 포함한다. 또한, 상기 세부 훈련기록은 복수의 훈련자명, 훈련 시나리오, 훈련 소요시간, 훈련 점 수, 훈련일자 및 시각 정보, 미리 설정된 복수의 강평 문항별 결과 등을 포함한다. 또한, 상기 미리 설정된 복 수의 강평 문항별 결과는 상기 복수의 훈련자에게 제공되는 복수의 서브 훈련 상황 콘텐츠에 대응하여 상기 수 신된 단계별 훈련 상황에 따른 입력값 중에서 미리 설정된 하나 이상의 특정 서브 훈련 상황 콘텐츠에 대응하여 입력된(또는 수신된) 하나 이상의 특정 서브 훈련 입력값을 근거로 미리 설정된 현장 대처 계획 수립 항목(또는 역할 분담 항목), 난동행위자에 접근, 고지 및 위험요소 차단 항목(또는 신분고지 및 상황설명 항목), 난동행위 자 대처 항목(또는 물리력 행사 기준 적용 항목), 피해자 구조 항목(또는 피해자 부상 확인 요청 항목), 물리력 대응 평가 항목(또는 언어적 통제 항목/대상자 행위 수준 판단 및 물리력 행사 항목), 현장 진입 전 준비 항목 (또는 보고 및 업무 분장 항목/안전 장구 착용 확인 항목) 등에 대해서 평가한 결과이며, 사용자 입력값에 따른 정답 여부에 대한 정보, 관련된 법 조항(또는 코멘트) 등을 포함한다. 여기서, 상기 강평은 작품이나 연기, 또 는 실습 등에 대해 총괄적으로 분석하고 평가하는 기능을 의미한다(또는 나타낸다). 이때, 상기 제어부는 동일 항목에 대해서 상기 복수의 훈련자로부터 입력값을 각각 수신한 경우, 먼저 입력된 입력값을 해당 항목에 대응하는 입력값으로 사용할 수 있다. 이때, 상기 훈련자에 대한 평가 결과 생성 시, 상기 제어부는 훈련 중인 훈련자와 관련한 영상 정보를 수 집(또는 모니터링)하고, 수집된 영상 정보를 분석하여 훈련자별 훈련 집중도를 계산(또는 산출/생성)하고, 상기 계산된 훈련자별 훈련 집중도를 상기 평가 결과에 반영(또는 적용)할 수도 있다. 예를 들어, 상기 제어부는 훈련 중인 훈련자 미리 설정된 시간 이상 눈을 감은 상태를 유지하는 경우(또는 영상 분석에 따라 조는/자는 경우로 판정되는 경우), 훈련자가 하품을 하는 경우, 훈련자가 휴대폰 등의 훈련에 필요한 장치(또는 디바이스) 이외에 다른 장치를 조작(또는 제어)하는 경우 등이 발생하면, 미리 설정된 포인트 를 상기 훈련자별 훈련 집중도에 적용(또는 차감/반영)한다. 이와 같이, 상기 제어부는 현장 경찰의 역량 파악을 위해서 인권존중 항목, 현장에서 소통 항목, 직무의 성실성 항목, 동료와의 협업 항목, 법집행 공정성 항목 등에 따라 항목별 행동지표를 도출하고, 상기 도출된 항 목별 행동지표, 상기 수신된 단계별 훈련 상황에 따른 입력값(예를 들어 서브 훈련 상황별 복수의 입력값, 서브 훈련 상황별 복수의 다른 입력값, 서브 훈련 상황별 복수의 또 다른 입력값 등 포함)을 근거로 상기 평가 결과 를 생성할 수 있다. 또한, 상기 제어부는 상기 도출된 항목별 행동지표를 근거로 상기 역량 모델을 업데이트(또는 재생성/보완)할 수 있다.또한, 상기 제어부는 상기 업데이트된(또는 재생성된/보완된) 역량 모델, 상기 수신된 단계별 훈련 상황에 따른 입력값(예를 들어 서브 훈련 상황별 복수의 입력값, 서브 훈련 상황별 복수의 다른 입력값, 서브 훈련 상 황별 복수의 또 다른 입력값 등 포함)을 근거로 상기 평가 결과를 생성할 수도 있다. 또한, 상기 제어부는 상기 생성된 해당 복수의 훈련자를 포함하는 하나의 팀에 대한 평가 결과 등을 상기 표시부 및/또는 상기 음성 출력부를 통해 출력한다. 이때, 상기 평가 결과는 총평 항목(또는 총평 탭), 훈련결과 항목(또는 훈련결과 탭), 세부 훈련기록 항목(또는 세부 훈련기록 탭) 등으로 분류하여 표시되며, 각 항목(또는 탭)이 선택되는 경우 선택된 항목에 대응하는 세부 정보(예를 들어 총평, 훈련결과, 세 부 훈련기록 등 포함)가 표시될 수 있다. 본 발명의 실시예에서는 복수의 훈련자를 포함하는 하나의 팀 단위로 상기 평가 결과를 생성 및 표시하는 것을 주로 설명하고 있으나, 이에 한정되는 것은 아니며, 상기 제어부는 상기 미리 설정된 항목별 행동지표, 상 기 수신된 단계별 훈련 상황에 따른 입력값(예를 들어 서브 훈련 상황별 복수의 입력값, 서브 훈련 상황별 복수 의 다른 입력값, 서브 훈련 상황별 복수의 또 다른 입력값 등 포함)을 근거로 훈련자별로 복수의 역량 항목 및 미리 설정된 강평 항목에 대한 평가 결과를 각각 생성(또는 계산/산출/설정/결정)하고, 상기 생성된 훈련자별 복수의 역량 항목 및 미리 설정된 강평 항목에 대한 평가 결과 등을 상기 표시부 및/또는 상기 음성 출력 부를 통해 출력할 수도 있다. 여기서, 상기 복수의 역량 항목은 시민지향 항목(예를 들어 인권존중, 현장 에서의 소통 등 포함), 업무지향 항목(예를 들어 직무의 성실성, 동료와의 협업 등 포함), 통합 항목(예를 들어 법집행 공정성 등 포함) 등을 포함한다. 이때, 상기 제어부는 상기 수신된 단계별 훈련 상황에 따른 입력값을 근거로 훈련자별로 단계별 훈련 상황 에 대한 단계별 평가 결과를 각각 생성(또는 계산/산출/설정/결정)하고, 상기 생성된 훈련자별 단계별 평가 결 과 등을 상기 표시부 및/또는 상기 음성 출력부를 통해 출력할 수도 있다. 또한, 상기 제어부는 상기 생성된 단계별 평가 결과를 종합하여 해당 훈련 시나리오에 대한 훈련자별로 전 체 평가 결과(또는 종합 평가 결과)를 각각 생성할 수도 있다. 또한, 상기 제어부는 상기 생성된 훈련자별로 단계별 평가 결과, 상기 생성된 훈련자별로 전체 평가 결과 (또는 종합 평가 결과), 훈련에 참여한 훈련자 정보(예를 들어 고유 아이디/고유 코드, 이름 등 포함) 등을 상 기 표시부 및/또는 상기 음성 출력부를 통해 출력할 수도 있다. 또한, 상기 제어부는 현장경찰관의 가상현실 교육이 학습자의 서열화가 아닌 업무 수행을 위한 역량을 충 분히 인식하고 행동할 수 있도록 교육·평가하는 도구이므로 학습의 정도를 평가하는 성취평가(또는 종합 평 가)를 실시할 수 있다. 즉, 상기 제어부는 가상현실 매체를 이용한 학습에 대한 검토 및 비교 자료들이 부족함에 따라 기존의 유 사 교육과정의 성취 기준을 최대한 단순화(예를 들어 3단계, 예: 우수, 보통, 미흡)하여 초기 평가 기준으로 설 정할 수 있다. 또한, 상기 제어부는 시스템 운영을 통해 일정기간(3~6개월) 동안 가상현실 교육을 현장에서 운영하여 성 취 기준을 점검하고 평가 기준 재설정(5단계 기준 설정)할 수 있다. 또한, 상기 제어부는 초기 평가 시 팀평가로 진행되나, 반복학습자의 확대 또는 이후 평가 시 경찰청 요구 사항을 고려하여, 추후 개인별 평가가 가능하도록 구성(세부 평가 방안 변경 포함)할 수 있다. 또한, 상기 제어부는 각각의 역량별 평가 목적과 평가 결과를 성취기준에 따라 표기하고, 방사형 그래프를 이용하여 현장경찰관 5대 역량의 균형을 확인할 수 있도록 지원(또는 표시)할 수 있다. 또한, 상기 제어부는 평가문항은 모두 선다형으로 구성하며, 단일 또는 다중 답안으로 구성하고, 배점은 문항의 중요도와 특성에 따라 구분할 수 있다. 즉, 상기 제어부는 전체 합산 점수를 100점으로 하고, 학습자 2인의 문항 총 수는 기준으로 총점을 문항별 로 배분한다. 단, 강평이 진행되는 문항에 있어서는 강평이 미진행되는 문항보다 미리 설정된 가산 점수(예를 들어 50%)를 부여한다. 또한, 상기 제어부는 정답 선택 여부에 따라 0점 또는 문항별 배점 전체 부여한다. 또한, 상기 제어부는 문항 특성에 따라 배점 구성하고, 다중 답안 중 선택된 답안의 개수만큼의 비율 배점 을 부여하며, 오답을 선택한 경우 배점을 미부여한다. 또한, 상기 제어부는 콘텐츠 내 평가 단계 중 현장경찰관 5대 업무역량 분야별 주요 분기를 각 1개씩 선택 (단, 분야별 주요 학습사항이 다수 발생하거나 가상현실 교육 특성에 따라 업무 수행 과정 평가가 다수 존재할 경우 분야별 강평 제공 빈도가 조정될 수 있음)한다. 또한, 상기 제어부는 콘텐츠 내 평가 단계 중 현장경찰관 5대 업무역량 분야별 주요 분기를 각 1개씩 선택 하여 학습자의 선택 답안과 정답을 제시하고 주요 학습 필요사항을 함께 제공(또는 표시)한다. 또한, 상기 제어부는 상기 생성된 평가 결과를 학습자(또는 훈련자)별로 관리하고, 해당 학습자의 인사정 보와 연계하여 지역, 직급, 근무연차 등의 인구통계학적 정보와 학습 결과를 연계 활용할 수 있다. 또한, 상기 제어부는 상기 생성된 평가 결과를 반복 학습자를 위한 다양한 평가 결과 제공에 활용할 수 있 다. 또한, 상기 제어부는 기간, 대상, 콘텐츠 등의 항목별 조건에 따라 데이터 산출에 활용할 수 있다. 이와 같이, 상기 제어부는 현장경찰관의 법집행력 강화라는 가상현실 교육의 목표를 달성하기 위해서, 가 상현실 학습 과정 중 발생한 학습자(또는 훈련자)의 주요 선택과 행위를 법령 또는 업무 매뉴얼에 근거하여 평 가하고, 개선이 필요한 사항이 확인될 경우 정확한 정보를 전달하여 학습자 스스로 학습하고 현장 적용이 가능 하도록 지원할 수 있다. 또한, 상기 제어부는 제한된 가상환경을 통해 경찰의 업무의 가변성을 모두 표현하지 못하고 제한적으로 학습하도록 설계됨에 따라 반복 학습 시 발생할 수 있는 흥미 및 참여도 저하를 개선할 수 있는 도구로 활용할 수 있다. 또한, 상기 제어부는 상기 훈련 시나리오에 따른 복수의 단계별 훈련 상황 중에서 평가 수행 단계와 관련 해서, 상기 수신된 단계별 훈련 상황에 따른 입력값(예를 들어 서브 훈련 상황별 복수의 입력값, 서브 훈련 상 황별 복수의 다른 입력값, 서브 훈련 상황별 복수의 또 다른 입력값 등 포함)을 미리 학습된 역량 모델의 입력 값으로 하여 기계 학습(또는 인공지능/딥 러닝)을 수행하고, 기계 학습 결과(또는 인공지능 결과/딥 러닝 결 과)를 근거로 훈련자별로 단계별 훈련 상황에 대한 단계별 평가 결과를 각각 생성(또는 계산/산출/설정/결정)한 다. 즉, 상기 제어부는 훈련자별로 수신된 상기 준비 단계와 관련한 상기 서브 훈련 상황별 복수의 입력값을 상기 역량 모델의 입력값으로 하여 기계 학습을 수행하고, 기계 학습 결과를 근거로 훈련자별로 상기 준비 단계 와 관련한 평가 결과를 생성한다. 또한, 상기 제어부는 훈련자별로 수신된 상기 대처 단계와 관련한 상기 서브 훈련 상황별 복수의 다른 입 력값을 상기 역량 모델의 입력값으로 하여 기계 학습을 수행하고, 다른 기계 학습 결과를 근거로 훈련자별로 상 기 대처 단계와 관련한 평가 결과를 생성한다. *또한, 상기 제어부는 훈련자별로 수신된 상기 사후조치 단계와 관련한 상기 서브 훈련 상황별 복수의 또 다른 입력값을 상기 역량 모델의 입력값으로 하여 기계 학습을 수행하고, 또 다른 기계 학습 결과를 근거로 훈 련자별로 상기 사후조치 단계와 관련한 평가 결과를 생성한다. 또한, 상기 제어부는 상기 생성된 단계별 평가 결과(예를 들어 훈련자별 상기 준비 단계와 관련한 평가 결 과, 상기 대처 단계와 관련한 평가 결과, 상기 사후조치 단계와 관련한 평가 결과 등 포함)를 종합하여 해당 훈 련 시나리오에 대한 훈련자별로 전체 평가 결과(또는 종합 평가 결과)를 각각 생성한다. 또한, 상기 제어부는 상기 훈련 시나리오에 따른 복수의 단계별 훈련 상황 중에서 평가결과 제공 단계와 관련해서, 상기 생성된 훈련자별로 단계별 평가 결과, 상기 생성된 훈련자별로 전체 평가 결과(또는 종합 평가 결과), 훈련에 참여한 훈련자 정보(예를 들어 고유 아이디/고유 코드, 이름 등 포함) 등을 상기 표시부 및 /또는 상기 음성 출력부를 통해 출력한다. 본 발명의 실시예에서는 상기 실감형 가상훈련 장치에서 전용 앱 형태로 실감형 가상훈련 기능, 실감형 콘 텐츠 출력 기능 등을 수행하는 것을 설명하고 있으나, 이에 한정되는 것은 아니며, 상기 전용 앱 이외에도 상기 서버에 제공하는 웹 사이트 등을 통해 상기 실감형 가상훈련 기능, 상기 실감형 콘텐츠 출력 기능 등을 수행할수도 있다. 이와 같이, 현장에 출동하는 경찰관 등을 대상으로 다양한 현장 상황을 반영한 실감형 가상훈련을 제공할 수 있 다. 또한, 이와 같이, 법집행 공정성, 인권존중, 현장에서의 소통, 직무의 성실성, 동료와의 협업 등을 고려하여 생 성된 역량 모델을 근거로 다양한 상황별로 학습자가 수행하는 내용에 대해 평가하고, 평가 결과를 제공할 수 있 다. 이하에서는, 본 발명에 따른 실감형 가상훈련 방법을 도 1 내지 도 49를 참조하여 상세히 설명한다. 도 8은 본 발명의 실시예에 따른 실감형 가상훈련 방법을 나타낸 흐름도이다. 먼저, 제어부는 해당 실감형 가상훈련 장치에 미리 설치된 전용 앱을 실행하고, 전용 앱 실행에 따른 앱 실행 결과 화면을 표시부에 표시한다. 이때, 상기 앱 실행 결과 화면은 가상현실, 증강현실, 혼합현실, 메타버스 등의 형태로 제공될 수 있으며, 복수의 훈련 내용 중 어느 하나의 훈련 내용을 선택하기 위한 훈련 내 용 선택 메뉴(또는 항목/버튼), 선택된 훈련 내용에 대응하는 훈련 시나리오와 관련한 실감형 콘텐츠를 제공하 기 위한 시작 메뉴, 전용 앱 기능을 설정하기 위한 설정 메뉴 등을 포함한다. 여기서, 상기 복수의 훈련 내용은 흉기 난동자에 대한 대응을 훈련하기 위한 흉기난동 대응 메뉴, 집단폭력에 대한 대응을 훈련하기 위한 집단폭 력 대응 메뉴, 치매노인에 대한 조치를 훈련하기 위한 치매노인 보호조치 메뉴, 정신질환자에 대한 조치를 훈련 하기 위한 정신질환자 보호조치 메뉴, 집회시위에 대한 대응을 훈련하기 위한 집회시위 대응 메뉴, 가정폭력에 대한 조치를 훈련하기 위한 가정폭력 조치 메뉴, 주취자에 대한 보호조치를 훈련하기 위한 주취난동자 보호조치 메뉴, 살인사건 현장에 대한 초동조치를 훈련하기 위한 살인현장 초동조치 메뉴, 자살기도에 대한 대응을 훈련 하기 위한 자살기도 대처요령 메뉴, 성폭력 피해자에 대한 조사 방법을 훈련하기 위한 성폭력 피해자 조사 메뉴 등을 포함하며, 디폴트로 흉기 난동자에 대한 대응 훈련을 위해서 흉기난동 대응 메뉴가 선택된 상태일 수 있다. 또한, 상기 표시부는 HMD(Head Mounted Display), 구글 글래스, 웨어러블 디스플레이 등일 수 있다. 여기서, 동일 훈련에 참여하는 훈련자가 복수인 경우, 상기 제어부는 해당 훈련 내용(또는 훈련 과 정)에 따라, 동일한 실감 콘텐츠를 복수의 훈련자가 각각 착용(또는 소지/보유) 중인 상기 표시부 및/또는 음성 출력부를 통해 출력하도록 제어하거나 또는, 훈련 과정 중 서로 다른 실감 콘텐츠를 상기 복수의 훈 련자가 각각 착용 중인 상기 표시부 및/또는 상기 음성 출력부를 통해 각각 출력하도록 제어할 수도 있다. 이때, 사전에 훈련을 수행하기 위한 훈련자(또는 학습자)의 고유 아이디(또는 고유 코드), 해당 아이디를 포함 하는 바코드 또는 QR 코드 등을 이용해서 상기 전용 앱 실행 시 로그인 절차(또는 훈련자 정보 입력 절차)를 수 행하여, 해당 전용 앱의 하나 이상의 기능(예를 들어 실감형 가상훈련 기능 등 포함)을 수행할 수 있다. 또한, 상기 훈련자가 패용(또는 착용/소지) 중인 신분증에 구성된 RFID 또는 NFC를 통해 해당 훈련자의 고유 아이디 등을 인식하여, 상기 전용 앱 실행시 로그인 절차를 수행할 수도 있다. 또한, 입력부를 통해 사용자 선택(또는 사용자 입력/터치/제어)에 따라 상기 표시부에 표시되는 상기 앱 실행 결과 화면에서 상기 시작 메뉴(또는 항목/버튼)가 선택되는 경우, 상기 제어부는 저장부에 미리 저장된 흉기난동과 관련한 복수의 훈련 시나리오 중에서 어느 하나의 훈련 시나리오를 랜덤하게 선택한다. 여기서, 상기 훈련 시나리오는 준비 단계, 대처 단계, 사후조치 단계, 평가 수행 단계, 평가결과 제공 단계 등 을 포함한다. 일 예로, 제 1 제어부는 해당 제 1 실감형 가상훈련 장치에 미리 설치된 현장경찰관 실감형 가상훈련 전용 앱을 실행하고, 도 9에 도시된 바와 같이, 현장경찰관 실감형 가상훈련 전용 앱에 따른 증강현실 형태의 앱 실행 결과 화면을 제 1 훈련자(예를 들어 고유 아이디 000001, 홍길동) 및 제 2 훈련자(예를 들어 고유 아이디 000007, 장발장)가 각각 착용 중인 HMD 형태의 제 1 표시부 및 제 2 표시부에 각각 표시하고, 해당 앱 실행 결과 화면에 대응하는 음성 정보를 상기 제 1 훈련자 및 상기 제 2 훈련자가 각각 착용 중인 제 1 음성 출력부 및 제 2 음성 출력부에 각각 출력한다. 이때, 상기 제 1 훈련자 및 제 2 훈련자는 협업 에 의해 특정 현장 상황에 대한 대응을 훈련하고자 하는 훈련자일 수 있다. 또한, 상기 제 1 훈련자가 제 1 입력부에 포함된 양손에 쥐고 있는 제 1 조이스틱을 통해 상기 증강현실 형태로 상기 제 1 표시부에 표시 중인 앱 실행 결과 화면 중에서 상기 시작 메뉴를 선택할 때, 상기 제 1 제어부는 제 1 저장부에 미리 저장된 흉기난동과 관련한 복수의 훈련 시나리오 중에서 제 3 훈련 시 나리오(예를 들어 1명의 음주 상태의 난동행위자가 1명의 피해자에게 경미한 부상을 입힌 상태에서, 유리병을든 채로 위협하고 있는 시나리오)를 선택한다(S810). 이후, 상기 제어부는 상기 훈련 시나리오에 따른 복수의 단계별 훈련 상황 중에서 미리 설정된 준비 단계 에 대응하는 준비 단계 실감형 콘텐츠를 상기 표시부 및/또는 음성 출력부를 통해 출력한다. 여기서, 상기 준비 단계 실감형 콘텐츠는 경찰차 차량 내부 화면 영역, 흉기난동 현장 입구/주변 영역, 서브 훈련 상황 별 시스템 메시지 표시 영역, 서브 훈련 상황별 선택지 옵션 표시 영역 등으로 구성된 사용자 인터페이스를 포 함하며, 신고 접수에 따른 신고 접수 내용(또는 신고 녹취록) 출력 정보(또는 데이터/상황 정보), 출동 및 현장 상황 파악 정보, 현장 대처 계획 수립 정보, 현장 진입 전 준비 정보 등의 복수의 서브 훈련 상황(또는 복수의 서브 훈련 상황 콘텐츠)을 포함한다. 이때, 상기 신고 접수 내용 출력 정보는 서버(미도시)(또는 112 치안종합 상황실)에서 경찰차(또는 순찰차)로 집단폭력 사건 신고가 발생한 상태임을 나타내는 정보, 해당 112 치안종합 상황실에서 전달해준 신고녹취록에 대한 정보 등을 포함한다. 또한, 상기 출동 및 현장 상황 파악 정보는 신고 접수 내용 이해에 따라 학습자가 정확한 현장 상황을 파악하기 위해서 무엇을 해야하는지에 대해 알고 있는지를 확인(또는 판단)하기 위해서, 신고 접수 내용 이해 정보(또는 신고 접수 내용 이해 정보/항목)(예를 들어 신고 자에게 연락 등 포함), 신고자 연락에 따라 학습자가 현장 상황을 정확하게 파악하기 위해서 무엇을 확인해야 하는지에 대해서 알고 있는지를 확인하기 위해서 현장 상황 정보 수집을 위한 정보(또는 신고자에게 연락 항 목)(예를 들어 난동행위자 상태, 난동행위자 인원, 흉기소지 여부, 흉기 종류, 피해자 부상 정도, 현장의 정확 한 위치, 현장의 밀집도 등 포함) 등을 포함한다. 또한, 상기 현장 대처 계획 수립 정보는 파악된 현장 상황 정 보에 따른 현장 상황 종합 정리 정보(예를 들어 흉기난동, 피해자 있음, 피해자 없음, 난동행위자 1명, 다수의 난동행위자 등 포함), 흉기난동 대응에 필요한 업무를 정확하게 파악하고 있는지 확인하기 위해서 현장 상황 종 합 정리 정보에 대응하는 현장 업무 계획 정보(예를 들어 신분고지, 행위자 제압, 피해자 구조, 행위자 체포 및 수색, 피해 조사, 증거확보, 증원인력 도착 확인, 가/피해자 분리, 블랙박스 작동확인 등 포함), 동료와 함께 처리해야 할 업무가 무엇인지에 대해 알고 있는지를 확인하기 위해서 학습자 역할 분담 정보(예를 들어 행위자 체포 및 위험요소 차단, 피해자 구조 및 피해조사 등 포함) 등을 포함한다. 또한, 상기 현장 진입 전 준비 정보 는 현장 도착 시 112 치안종합상황실에 현장 도착 상황 보고 여부를 알고 있는지를 확인하기 위해서 112 치안종 합상황실 보고 정보, 현장 진입 전 증원 인력이 도착했는지 여부를 알고 있는지를 확인하기 위해서 증원 인력 도착 확인 정보, 안전을 위해 흉기난동 상황 대응 전 안전장비 착용 필요성을 알고 어떤 장비를 착용해야 함을 알고 있는지를 확인하기 위해서 안전 장구 착용 정보(또는 방검 장비 착용 정보)(예를 들어 방검복, 안전 장갑, 방패 등 포함) 등을 포함한다. 또한, 상기 제어부는 상기 입력부를 통해 사용자 입력(또는 사용자 선택/터치/제어/반응)에 따른 해 당 준비 단계에서의 상기 준비 단계 실감형 콘텐츠에 포함된 복수의 서브 훈련 상황에 대응하는 복수의 입력값 을 서브 훈련 상황별(또는 서브 훈련 상황별 복수의 입력값)로 수신한다. 이때, 상기 제어부는 훈련자별 평가를 위해서 복수의 훈련자별로 서브 훈련 상황별 복수의 입력값을 각각 수신한다. 이와 같이, 상기 훈련 시나리오에 포함된 준비 단계와 관련해서, 준비 단계 실감형 콘텐츠에 포함된 복수의 서 브 훈련 상황과 관련한 콘텐츠를 출력하고, 그에 따른 학습자의 반응에 의한 복수의 훈련자별로 서브 훈련 상황 별 복수의 입력값을 각각 수신(또는 수집)할 수 있다. 일 예로, 상기 제 1 제어부는 상기 제 3 훈련 시나리오에 따른 복수의 단계별 훈련 상황 중에서 미리 설정된 준 비 단계에 대응하는 제 1 준비 단계 실감형 콘텐츠를 확인하고, 도 10 및 도 11에 도시된 바와 같이, 상기 제 1 준비 단계 실감형 콘텐츠에 포함된 제 1-1 서브 훈련 상황 콘텐츠 및 제 1-2 서브 훈련 상황 콘텐츠 를 상기 제 1 훈련자와 관련한 상기 제 1 표시부 및 상기 제 1 음성 출력부와 상기 제 2 훈련자와 관련한 상기 제 2 표시부 및 상기 제 2 음성 출력부를 통해 각각 출력한다. 여기서, 상기 제 1-1 서브 훈련 상황 콘텐 츠는 주점 흉기난동과 관련해서 112 치안종합상황실(또는 신고센터)에서의 신고 접수 상태와 관련한 콘텐츠(예 를 들어 무전기 선택 시 112 치안종합상황실 코멘트 및 코멘트에 대응하는 음성 정보)를 포함하고(또는 나타내 고), 상기 제 1-2 서브 훈련 상황 콘텐츠는 신고자의 신고 접수 내용(또는 신고 녹취록)과 관련한 콘텐츠(예를 들어 무전기 선택 시 신고 접수 내용에 대응하는 텍스트 및 음성 정보)를 포함한다. 또한, 상기 제 1-1 서브 훈 련 상황 콘텐츠 및 제 1-2 서브 훈련 상황 콘텐츠의 좌측 일측에 표시되는 사람 모양의 아이콘은, 사람 수가 한 명인 경우 훈련자별로 수행해야 할 업무가 나눠졌을 때 훈련자 중 한 명이 선택할 수 있는 인터랙 션을 나타내고, 사람 수가 두 명인 경우 2명의 훈련자가 각각 선택할 수 있는 인터랙션을 나타낸다. 이때, 상기 제 1-1 서브 훈련 상황 콘텐츠의 출력이 종료된 후, 상기 제 1 훈련자가 보유 중인 제 1 조이스틱 또는 상기 제 2 훈련자가 보유 중인 제 2 조이스틱을 통해서 상기 제 1 표시부 또는 상기 제 2 표시부에 표시 중인 특정 객체 (예를 들어 무전기 아이템)가 선택될 때, 상기 제 1 제어부는 상기 제 1-2 서브 훈련 상황 콘텐츠를 상기 제 1표시부 및 상기 제 1 음성 출력부와 상기 제 2 표시부 및 상기 제 2 음성 출력부를 통해 각각 출력한다. 또한, 상기 제 1-2 서브 훈련 상황 콘텐츠의 출력이 종료된 후, 상기 제 1 제어부는 해당 제 1 학습자 및 제 2 학습자가 신고 접수 내용을 제대로 이해한 상태로 정확한 현장 상황을 파악하기 위해서 무엇을 해야할지에 대해 알고 있는지를 확인하기 위해서, 도 12에 도시된 바와 같이, 다음 상태에서 훈련자가 수행해야 할 정보들 을 포함하는 제 1-3 서브 훈련 상황 콘텐츠를 상기 제 1 표시부 및 상기 제 1 음성 출력부와 상기 제 2 표시부 및 상기 제 2 음성 출력부를 통해 각각 출력한다. 여기서, 상기 제 1-3 서브 훈련 상황 콘텐츠는 훈련자 의 다음 행동을 확인하기 위해서, 정답 및 오답을 포함하는 신고자 연락 항목, 112 치안종합상황실 연락 항목 (또는 112 치안종합상황실 연락 항목), 소속 지역관서에 연락 항목, 주변 순찰차에 무전 항목, 추가 연락 불필 요 항목 등을 포함한다. 이때, 상기 제 1 제어부는 상기 서브 훈련 상황별 선택지 옵션 표시 영역에 상기 제 1- 3 서브 훈련 상황 콘텐츠(또는 상기 제 1-3 서브 훈련 상황 콘텐츠에 포함된 텍스트 등 포함)를 표시할 수 있다. 또한, 상기 제 1 훈련자가 보유 중인 제 1 조이스틱을 통해서 상기 제 1 표시부에 표시 중인 제 1-3 서브 훈련 상황 콘텐츠에서 신고자 연락 항목이 선택될 때, 상기 제 1 제어부는 상기 선택된 신고자 연락 항목 등을 포함하는 제 000001-1-3 서브 훈련 입력값을 수신한다. 또한, 상기 제 2 훈련자가 보유 중인 제 2 조이스틱을 통해서 상기 제 2 표시부에 표시 중인 제 1-3 서브 훈련 상황 콘텐츠에서 상황실 연락 항목이 선택될 때, 상기 제 1 제어부는 상기 선택된 상황실 연락 항목 등을 포함하는 제 000007-1-3 서브 훈련 입력값을 수신한다. 이때, 상기 제 1-3 서브 훈련 상황 콘텐츠 중에서 오답에 해당하는 상기 112 치안종합상황실 연락 항목, 소속 지역관서에 연락 항목, 주변 순찰차에 무전 항목, 추가 연락 불필요 항목 등이 선택될 때, 상기 제 1 제어 부는 현재 단계에서의 학습자의 올바른 대응안에 대한 정보를 상기 제 1 표시부 및 상기 제 1 음성 출력부와 상 기 제 2 표시부 및 상기 제 2 음성 출력부를 통해 각각 출력할 수 있다. 또한, 상기 제 1 제어부는 상기 선택된 신고자 연락 항목과 관련해서 해당 신고와의 통화에 따라 학습자가 현장 상황을 정확하게 파악하기 위해서 무엇을 확인해야 하는지에 대해서 알고 있는지를 확인하고 해당 현장과 관련 한 상황 정보를 수집하기 위해서, 도 13에 도시된 바와 같이, 다음 상태에서 훈련자가 수행해야 할 정보들을 포 함하는 제 1-4 서브 훈련 상황 콘텐츠를 상기 제 1 표시부 및 상기 제 1 음성 출력부와 상기 제 2 표시부 및 상기 제 2 음성 출력부를 통해 각각 출력한다. 여기서, 상기 제 1-4 서브 훈련 상황 콘텐츠는 현장에서의 난 동행위자 및 피해자의 상태를 확인하기 위해서, 정답 및 오답을 포함하는 난동행위자 상태 항목, 난동행위자 인 원 항목, 흉기소지 여부 항목, 흉기 종류 항목, 피해자 부상 정도 항목, 난동행위자의 성별 항목, 피해자의 성 별 항목 등을 포함한다. 또한, 상기 제 1 제어부는 상기 제 1 훈련자가 보유 중인 제 1 조이스틱을 통해서 상기 제 1 표시부에 표시 중 인 제 1-4 서브 훈련 상황 콘텐츠에서 제 1 난동행위자 상태(예를 들어 음주), 제 1 난동행위자 인원(예 를 들어 1명), 제 1 흉기소지 여부(예를 들어 유리병 소지), 제 1 흉기 종류(예를 들어 유리병), 제 1 피해자 부상 정도(예를 들어 경미한 부상) 등을 포함하는 제 000001-1-4 서브 훈련 입력값을 수신한다. 또한, 상기 제 1 제어부는 상기 제 2 훈련자가 보유 중인 제 2 조이스틱을 통해서 상기 제 2 표시부에 표시 중 인 제 1-4 서브 훈련 상황 콘텐츠에서 제 1 난동행위자 상태(예를 들어 음주), 제 1 난동행위자 인원(예 를 들어 1명), 제 1 흉기소지 여부(예를 들어 유리병 소지), 제 1 흉기 종류(예를 들어 유리병), 제 1 피해자 부상 정도(예를 들어 경미한 부상) 등을 포함하는 제 000007-1-4 서브 훈련 입력값을 수신한다. 또한, 상기 제 1 제어부는 해당 제 1 학습자 및 제 2 학습자가 현장 상태를 제대로 파악한 상태인지 여부를 확 인하고, 현장 상황 파악을 위해 무엇을 확인해야 하는지에 대해서 알고 있는지를 확인하기 위해서, 도 14에 도 시된 바와 같이, 다음 상태에서 훈련자가 수행해야 할 정보들을 포함하는 제 1-5 서브 훈련 상황 콘텐츠 를 상기 제 1 표시부 및 상기 제 1 음성 출력부와 상기 제 2 표시부 및 상기 제 2 음성 출력부를 통해 각각 출 력한다. 여기서, 상기 제 1-5 서브 훈련 상황 콘텐츠는 훈련자의 다음 행동을 확인하기 위해서, 정답 및 오답을 포함하는 흉기난동 항목, 자해 항목, 피해자 있음 항목, 피해자 없음 항목, 난동행위자 1명 항목, 다수의 난동 행위자 항목, 추가 증원 요청 필요 항목 등을 포함한다. 또한, 상기 제 1 제어부는 상기 제 1 훈련자가 보유 중인 제 1 조이스틱을 통해서 상기 제 1 표시부에 표시 중 인 제 1-5 서브 훈련 상황 콘텐츠에서 흉기 난동 항목, 피해자 있음 항목, 난동행위자 1명 항목 등을 포 함하는 제 000001-1-5 서브 훈련 입력값을 수신한다.또한, 상기 제 1 제어부는 상기 제 2 훈련자가 보유 중인 제 2 조이스틱을 통해서 상기 제 2 표시부에 표시 중 인 제 1-5 서브 훈련 상황 콘텐츠에서 흉기 난동 항목, 피해자 있음 항목, 난동행위자 1명 항목 등을 포 함하는 제 000007-1-5 서브 훈련 입력값을 수신한다. 또한, 상기 제 1 제어부는 해당 제 1 학습자 및 제 2 학습자가 파악한 현장 상태에 따라 해당 상황에 대처하기 위해서 해야 할 일들을 확인하기 위해서, 도 15에 도시된 바와 같이, 다음 상태에서 훈련자가 수행해야 할 정보 들(또는 현장 업무 계획 정보)을 포함하는 제 1-6 서브 훈련 상황 콘텐츠를 상기 제 1 표시부 및 상기 제 1 음성 출력부를 통해 출력한다. 여기서, 상기 제 1-6 서브 훈련 상황 콘텐츠는 훈련자의 다음 행동을 확인하기 위해서, 안전 장구 착용 항목, 신분고지 항목, 행위자 제압 항목, 피해자 구조 항목, 피해 조사 항목, 증거확보 항목, 증원인력 도착 확인 항목, 가/피해자 분리 항목, 블랙박스 작동확인 항목 등을 포함한다. 또한, 상기 제 1 제어부는 상기 제 1 훈련자가 보유 중인 제 1 조이스틱을 통해서 상기 제 1 표시부에 표시 중 인 제 1-6 서브 훈련 상황 콘텐츠에서 안전 장구 착용 항목, 신분고지 항목, 행위자 제압 항목, 피해자 구조 항목, 피해자 조사 항목, 증거확보 항목, 가/피해자 분리 항목, 블랙박스 작동확인 항목 등을 포함하는 제 000001-1-6 서브 훈련 입력값을 수신한다. 또한, 상기 제 1 제어부는 상기 제 2 훈련자가 보유 중인 제 2 조이스틱을 통해서 상기 제 2 표시부에 표시 중 인 제 1-6 서브 훈련 상황 콘텐츠에서 신분고지 항목, 행위자 제압 항목, 피해자 구조 항목, 피해자 조사 항목, 증거확보 항목, 블랙박스 작동확인 항목 등을 포함하는 제 000007-1-6 서브 훈련 입력값을 수신한다. 또한, 상기 제 1 제어부는 훈련에 참여 중인 제 1 학습자와 제 2 학습자에 대한 역할 분담을 위해서, 도 16에 도시된 바와 같이, 학습자별 역할을 선택하기 위한 제 1-7 서브 훈련 상황 콘텐츠를 상기 제 1 표시부 및 상기 제 1 음성 출력부와 상기 제 2 표시부 및 상기 제 2 음성 출력부를 통해 각각 출력한다. 여기서, 상기 제 1-7 서브 훈련 상황 콘텐츠는 훈련자별 역할 분담을 위해서, 행위자 체포 및 위험요소 차단 항목, 피해자 구조 및 피해조사 항목 등을 포함한다. 또한, 상기 제 1 제어부는 상기 제 1 훈련자가 보유 중인 제 1 조이스틱을 통해서 상기 제 1 표시부에 표시 중 인 제 1-7 서브 훈련 상황 콘텐츠에서 제 1 학습자 선택에 의한 행위자 체포 및 위험요소 차단 항목 등을 포함하는 제 000001-1-7 서브 훈련 입력값을 수신한다. 또한, 상기 제 1 제어부는 상기 제 2 훈련자가 보유 중인 제 2 조이스틱을 통해서 상기 제 2 표시부에 표시 중 인 제 1-7 서브 훈련 상황 콘텐츠에서 제 2 학습자 선택에 의한 피해자 구조 및 피해조사 항목 등을 포함 하는 등을 포함하는 제 000007-1-7 서브 훈련 입력값을 수신한다. 또한, 상기 제 1 제어부는 해당 제 1 학습자 및 제 2 학습자가 현장 진입 전 준비해야 할 일들을 인지하고 있는 지를 확인하기 위해서, 도 17에 도시된 바와 같이, 다음 상태에서 훈련자가 수행해야 할 정보들을 포함하는 제 1-8 서브 훈련 상황 콘텐츠를 상기 제 1 표시부 및 상기 제 1 음성 출력부와 상기 제 2 표시부 및 상기 제 2 음성 출력부를 통해 각각 출력한다. 여기서, 상기 제 1-8 서브 훈련 상황 콘텐츠는 훈련자의 다음 행동을 확인하기 위해서, 112 치안종합상황실 보고 항목, 증원 인력 도착 확인 항목, 방검 장비 착용 항목 등을 포함한 다. 또한, 상기 제 1 훈련자가 보유 중인 제 1 조이스틱 또는 상기 제 2 훈련자가 보유 중인 제 2 조이스틱의 선택 에 따라 상기 제 1 표시부 또는 상기 제 2 표시부에 표시 중인 제 1-8 서브 훈련 상황 콘텐츠에서의 112 치안종합상황실 보고 항목이 선택될 때, 도 18에 도시된 바와 같이, 상기 제 1 제어부는 현장 도착, 현장 진입 등에 따른 상황을 112 치안종합상황실에 보고하기 위한 제 1-9 서브 훈련 상황 콘텐츠를 상기 제 1 표시부 및 상기 제 1 음성 출력부와 상기 제 2 표시부 및 상기 제 2 음성 출력부를 통해 각각 출력한다. 여기서, 상기 제 1-9 서브 훈련 상황 콘텐츠는 훈련자의 다음 행동을 확인하기 위해서, 정답 및 오답을 포함하 는 현장 도착, 현장 진입 등에 따른 실시간 상황을 112 치안종합상황실에 보고하기 위한 무전기 항목 등을 포함 한다. 또한, 상기 제 1 훈련자가 보유 중인 제 1 조이스틱 또는 상기 제 2 훈련자가 보유 중인 제 2 조이스틱의 선택 에 따라 상기 제 1 표시부 또는 상기 제 2 표시부에 표시 중인 제 1-8 서브 훈련 상황 콘텐츠에서의 증원 인력 도착 확인 항목이 선택될 때, 도 19에 도시된 바와 같이, 상기 제 1 제어부는 현장 도착, 현장 진입 등에 따른 증원 인력의 도착 상태를 112 치안종합상황실에 확인하기 위한 제 1-10 서브 훈련 상황 콘텐츠(190 0)를 상기 제 1 표시부 및 상기 제 1 음성 출력부와 상기 제 2 표시부 및 상기 제 2 음성 출력부를 통해 각각 출력한다. 여기서, 상기 제 1-10 서브 훈련 상황 콘텐츠는 훈련자의 다음 행동을 확인하기 위해서, 정답 및 오답을 포함하는 현장 도착, 현장 진입 등에 따른 증원 인력의 도착 여부, 도착 예정 시각 등을 112 치안종합상황 실에 확인하기 위한 무전기 항목 등을 포함한다. 또한, 상기 제 1 훈련자가 보유 중인 제 1 조이스틱 또는 상기 제 2 훈련자가 보유 중인 제 2 조이스틱의 선택 에 따라 상기 제 1 표시부 또는 상기 제 2 표시부에 표시 중인 제 1-8 서브 훈련 상황 콘텐츠에서의 방검 장비 착용 항목이 선택될 때, 도 20에 도시된 바와 같이, 상기 제 1 제어부는 안전을 위해 흉기난동 상황 대응 전 안전장비 착용 필요성을 알고, 어떤 장비를 착용해야 함을 알고 있는지를 확인하기 위해서, 복수의 안 전 장구 항목을 포함하는 제 1-11 서브 훈련 상황 콘텐츠를 상기 제 1 표시부 및 상기 제 1 음성 출력부 와 상기 제 2 표시부 및 상기 제 2 음성 출력부를 통해 각각 출력한다. 여기서, 상기 제 1-11 서브 훈련 상황 콘텐츠는 훈련자의 다음 행동을 확인하기 위해서, 정답 및 오답을 포함하는 방패 항목, 방검복 항목, 안전장갑 항목 등을 포함한다. 또한, 상기 제 1 제어부는 상기 제 1 훈련자가 보유 중인 제 1 조이스틱을 통해서 상기 제 1 표시부에 표시 중 인 제 1-11 서브 훈련 상황 콘텐츠에서 방패 항목, 방검복 항목, 안전장갑 항목 등을 포함하는 제 000001-1-11 서브 훈련 입력값을 수신한다. 또한, 상기 제 1 제어부는 상기 제 2 훈련자가 보유 중인 제 2 조이스틱을 통해서 상기 제 2 표시부에 표시 중 인 제 1-11 서브 훈련 상황 콘텐츠에서 방패 항목, 방검복 항목, 안전장갑 항목 등을 포함하는 제 000007-1-11 서브 훈련 입력값을 수신한다(S820). 이후, 상기 제어부는 상기 훈련 시나리오에 따른 복수의 단계별 훈련 상황 중에서 미리 설정된 대처 단계 에 대응하는 대처 단계 실감형 콘텐츠를 상기 표시부 및/또는 상기 음성 출력부를 통해 출력한다. 여 기서, 상기 대처 단계 실감형 콘텐츠는 흉기 난동 발생 장소 화면 영역, 서브 훈련 상황별 시스템 메시지 표시 영역, 서브 훈련 상황별 선택지 옵션 표시 영역 등으로 구성된 사용자 인터페이스를 포함하며, 난동행위자에 접 근, 고지 및 위험요소 차단 정보, 난동행위자 대처 정보, 물리력 대응 정보, 학습자 역할 분리에 따른 행위자 체포 정보, 난동현장 조치 정보, 학습자 역할 분리에 따른 피해자 구조 정보, 피해자 이송 정보, 피해자 인계 정보, 주변 조사 정보 등의 복수의 다른 서브 훈련 상황(또는 복수의 다른 서브 훈련 상황 콘텐츠)을 포함한다. 이때, 상기 난동행위자에 접근, 고지 및 위험요소 차단 정보는 위험 요소를 정확히 파악하고 이를 제거했는지를 확인하기 위해서 피해 장소에서의 위험 요소 차단 정보(예를 들어 깨진 술병, 가위, 프라이팬 등 포함), 도주로 차단 필요성을 알고 적합한 자리/위치를 선택할 수 있고 경찰관의 안전을 위한 안전거리 확보 필요성을 알고 이 를 실행할 수 있는지를 확인하기 위해서 안전거리를 고려한 난동행위자에게 접근하기 위한 정보(또는 난동행위 자에 접근 정보)(예를 들어 난동행위자 앞, 난동행위자 옆 등 포함), 필요한 고지 사항을 정확하게 알고 있는지 를 확인하기 위해서 신분 및 촬영 고지를 안내하기 위한 정보, 난동행위 중단 경고의 필요성을 알고 있는지를 확인하기 위해서 난동행위자의 행동(또는 난동)에 따른 난동행위 중단 경고를 위한 정보, 흉기를 버릴 것을 경 고해야 함을 알고 있는지를 확인하기 위해서 흉기 소지 시 흉기 버릴 것을 경고하기 위한 정보 등을 포함한다. 또한, 상기 난동행위자 대처 정보는 난동행위자의 상태, 저항 수준, 현장 상황을 정확하게 판단할 수 있는지를 확인하기 위해서 행위자 상황 및 현장 상황 판단 정보(예를 들어 행위자 상태, 난동 상황, 위험물 소지 여부, 음주, 흥분 상태, 가/피해자 분리, 가/피해자 미분리 등 포함), 부적절/불필요하거나 난동행위자를 도발하지 않 고 난동행위자를 미리 설정된 '순응' 상태로 이끌어내기(또는 유도하기) 위한 상황과 언어를 선택할 수 있는지 를 확인하기 위해서 난동행위자의 행동(또는 난동)에 따른 학습자의 반응 정보(예를 들어 행위 중단 설득, 행위 중단 경고, 무기 사용 고지, 총기 사용 고지 등 포함) 등을 포함한다. 또한, 상기 물리력 대응 정보는 적합한 물리력 대응 방법을 선택하기 위해 범죄 종류, 대상자(또는 훈련자/경찰관) 수, 흉기 종류, 난동행위자의 신체 및 건강 상태, 피해 상황, 저항 강도, 위해 급박성 등을 제대로 파악하고 있는지를 확인하기 위해서 난동행위자 의 저항 정도에 대한 정보(또는 난동행위자 저항 수준 파악 정보)(예를 들어 미리 설정된 순응, 소극적 저항, 적극적 저항, 폭력적 공격, 치명적 공격 등 포함), 학습자가 선택한 저항 정도에서 사용할 수 있는 물리력 행사 수단을 정확하게 알고 있는지를 확인하기 위해서 난동행위자의 저항 정도에 따른 물리력 행사 수단 선택 정보 (예를 들어 대화, 삼단봉/방패, 가스분사기, 테이저건, 권총 등 포함), 적합한 신체 부위에 물리력을 사용했는 지를 확인하기 위해서 물리력 행사 정보(예를 들어 머리, 팔, 복부, 허벅지, 손 등 포함) 등을 포함한다. 또한, 상기 학습자 역할 분리에 따른 행위자 체포 정보는 행위자 체포 정보, 미란다 원칙을 고지하였는지를 확인하기 위해서 행위자 권리 고지 정보, 난동행위자가 추가 위해 물건을 소지하고 있는지를 인지하고 있는지 확인하기 위해서 행위자 수색 정보, 난동행위자 제압 후 난동행위자의 부상 여부 확인 필요성을 인지하고 있는지를 확인 하기 위해서 행위자 부상 확인 정보, 행위자 연행 정보 등을 포함한다. 또한, 상기 난동현장 조치 정보는 난동 현장 위험요소 차단 정보, 증거 사진/영상이 필요함을 알고 이를 확보하였는지를 확인하기 위해서 난동 현장 촬영 정보 등을 포함한다. 또한, 상기 학습자 역할 분리에 따른 피해자 구조 정보는 본인(또는 학습자)이 아닌 119 구조 대원이 피해자 부상 정도를 확인하게 하였는지를 확인하기 위해서 피해자의 부상 정도(예를 들어 피해 자가 부상을 입지 않음, 피해자가 경미한 부상을 입음, 피해자가 심각한 부상을 입음 등 포함)에 따른 119 구조 대원에게 피해자 부상 여부 확인 요청 정보(예를 들어 119 구조대원에 확인 요청 등 포함), 피해자에게 치료 필 요 여부를 물어보았고, 피해자의 상태에 적합한 대처 방법을 결정하였는지를 확인하기 위해서 피해자 병원 치료 여부 확인 정보(예를 들어 부상 없음, 경미한 부상, 심각한 부상 등 포함), 피해자 병원 치료 여부 정보(예를 들어 피해자 병원 치료 거절, 피해자 병원 치료 요청 등 포함) 등을 포함한다. 또한, 상기 피해자 이송 정보는 피해자에게 피해 진술 절차와 지구대, 파출소, 치안센터 등으로의 이송 여부를 안내하고, 피해자가 진술 가능한 상태인지 여부를 확인하였는지를 확인하기 위해서 피해자가 병원 치료 거절 시, 지구대로 피해자 이송을 위한 정보(예를 들어 지구대로 피해자 이송, 피해 진술 절차 안내, 진술 가능 상태 확인, 지구대 동행 안내, 피해자- 가해자 분리하여 이송 등 포함), 피해자의 상태에 적합한 대처 방법을 결정하였고 피해자에게 병원으로 이송됨 을 안내하였는지를 확인하기 위해서 피해자가 병원 치료 요청 시, 119에 피해자 인계를 위한 정보(예를 들어 119에 피해자 인계, 피해자에게 119로 인계됨을 안내, 112 치안종합상황실에 보고 등 포함) 등을 포함한다. 또 한, 상기 피해자 인계 정보는 지구대로 피해자 이송시 피해 진술 절차 및 지구대 동행 안내 정보, 119에 피해자 인계시 피해자에게 병원 이송 안내 등을 포함한다. 또한, 상기 주변 조사 정보는 필요한 목격자 정보를 수집하 고 추후 출석 및 증거자료 요구 가능성을 공지했는지를 확인하기 위해서 목격자 정보 확보, 피해 상황 및 초기 발생 상황 관련 정보를 수집했는지를 확인하기 위해서 피해조사, CCTV 확보 필요성을 인지하고 CCTV 자료를 확 보하였는지를 확인하기 위해서 증거확보 등을 포함한다. 또한, 상기 제어부는 상기 입력부를 통해 사용자 입력(또는 사용자 선택/터치/제어/반응)에 따른 해 당 대처 단계 실감형 콘텐츠에 포함된 복수의 다른 서브 훈련 상황에 대응하는 복수의 다른 입력값을 서브 훈련 상황별(또는 서브 훈련 상황별 복수의 다른 입력값)로 수신한다. 이때, 상기 제어부는 훈련자별 평가를 위 해서 복수의 훈련자별로 다른 서브 훈련 상황별 복수의 다른 입력값을 각각 수신한다. 이와 같이, 상기 훈련 시나리오에 포함된 대처 단계와 관련해서, 대처 단계 실감형 콘텐츠에 포함된 복수의 다 른 서브 훈련 상황과 관련한 콘텐츠를 출력하고, 그에 따른 학습자의 반응에 의한 복수의 훈련자별로 서브 훈련 상황별 복수의 다른 입력값을 각각 수신(또는 수집)할 수 있다. 일 예로, 상기 제 1 제어부는 상기 제 3 훈련 시나리오에 따른 복수의 단계별 훈련 상황 중에서 미리 설정된 대 처 단계에 대응하는 제 2 대처 단계 실감형 콘텐츠를 확인하고, 도 21에 도시된 바와 같이, 상기 제 2 대처 단 계 실감형 콘텐츠에 포함된 제 2-1 서브 훈련 상황 콘텐츠를 상기 제 1 표시부 및 상기 제 1 음성 출력부 와 상기 제 2 표시부 및 상기 제 2 음성 출력부를 통해 각각 출력한다. 여기서, 상기 제 2-1 서브 훈련 상황 콘 텐츠는 피해 현장에서의 위험 요소를 정확히 파악하고 이를 제거했는지 확인하기 위해서, 정답 및 오답을 포함 하는 깨진 술병 항목, 가위 항목, 프라이팬 항목, 티슈케이스 항목, 휴지통 항목 등을 포함한다. 또한, 상기 제 1 제어부는 상기 제 1 훈련자가 보유 중인 제 1 조이스틱을 통해서 상기 제 1 표시부에 표시 중 인 제 2-1 서브 훈련 상황 콘텐츠에서 술병 항목, 가위 항목, 프라이팬 항목 등을 포함하는 제 000001-2- 1 서브 훈련 입력값을 수신한다. 또한, 상기 제 1 제어부는 상기 제 2 훈련자가 보유 중인 제 2 조이스틱을 통해서 상기 제 2 표시부에 표시 중 인 제 2-1 서브 훈련 상황 콘텐츠에서 술병 항목, 가위 항목, 프라이팬 항목 등을 포함하는 제 000007-2- 1 서브 훈련 입력값을 수신한다. 또한, 상기 제 1 제어부는 해당 제 1 학습자 및 제 2 학습자가 도주로 차단 필요성을 알고, 적합한 자리를 선택 (또는 선점)할 수 있고 경찰관의 안전을 위한 안전거리 확보 필요성을 알고 이를 실행할 수 있는지를 확인하기 위해서, 도 22에 도시된 바와 같이, 학습자가 이동할 위치를 선택하기 위한 정보들을 포함하는 제 2-2 서브 훈 련 상황 콘텐츠를 상기 제 1 표시부 및 상기 제 1 음성 출력부와 상기 제 2 표시부 및 상기 제 2 음성 출 력부를 통해 각각 출력한다. 여기서, 상기 제 2-2 서브 훈련 상황 콘텐츠는 훈련자가 위치할 영역을 선택하기 위해서, 정답 및 오답을 포함하는 피해 현장 내에서의 복수의 위치 영역 등을 포함한다. 또한, 상기 제 1 제어부는 상기 제 1 훈련자가 보유 중인 제 1 조이스틱을 통해서 상기 제 1 표시부에 표시 중 인 제 2-2 서브 훈련 상황 콘텐츠에서 제 1 위치(예를 들어 난동행위자 옆) 등을 포함하는 제 000001-2-2 서브 훈련 입력값을 수신한다. 또한, 상기 제 1 제어부는 상기 제 2 훈련자가 보유 중인 제 2 조이스틱을 통해서 상기 제 2 표시부에 표시 중 인 제 2-2 서브 훈련 상황 콘텐츠에서 제 2 위치(예를 들어 난동행위자 앞) 등을 포함하는 제 000007-2-2 서브 훈련 입력값을 수신한다. 또한, 상기 제 1 제어부는 해당 제 1 학습자 및 제 2 학습자가 필요한 고지 사항을 정확하게 알고 있는지를 확 인하기 위해서, 도 23에 도시된 바와 같이, 다음 상태에서 훈련자가 수행해야 할 정보들을 포함하는 제 2-3 서 브 훈련 상황 콘텐츠를 상기 제 1 표시부 및 상기 제 1 음성 출력부와 상기 제 2 표시부 및 상기 제 2 음 성 출력부를 통해 각각 출력한다. 여기서, 상기 제 2-3 서브 훈련 상황 콘텐츠는 훈련자의 다음 행동을 확인하 기 위해서, 정답 및 오답을 포함하는 신분고지 항목, 난동행위 중단경고 항목, 동영상 촬영 고지 항목 등을 포 함한다. 또한, 상기 제 1 제어부는 상기 제 1 훈련자가 보유 중인 제 1 조이스틱을 통해서 상기 제 1 표시부에 표시 중 인 제 2-3 서브 훈련 상황 콘텐츠에서 신분고지 항목, 난동행위 중단경고 항목, 동영상 촬영 고지 항목 등을 포함하는 제 000001-2-3 서브 훈련 입력값을 수신한다. 또한, 상기 제 1 제어부는 상기 제 2 훈련자가 보유 중인 제 2 조이스틱을 통해서 상기 제 2 표시부에 표시 중 인 제 2-3 서브 훈련 상황 콘텐츠에서 신분고지 항목, 난동행위 중단경고 항목, 동영상 촬영 고지 항목 등을 포함하는 제 000007-2-3 서브 훈련 입력값을 수신한다. 또한, 상기 제 1 제어부는 해당 제 1 학습자 및 제 2 학습자가 난동행위자의 상황을 정확하게 알고 있는지를 확 인하기 위해서, 도 24에 도시된 바와 같이, 다음 상태에서 훈련자가 수행해야 할 정보들을 포함하는 제 2-4 서 브 훈련 상황 콘텐츠를 상기 제 1 표시부 및 상기 제 1 음성 출력부와 상기 제 2 표시부 및 상기 제 2 음 성 출력부를 통해 각각 출력한다. 여기서, 상기 제 2-4 서브 훈련 상황 콘텐츠는 훈련자의 다음 행동을 확인하 기 위해서, 정답 및 오답을 포함하는 음주 항목, 흥분 상태 항목, 가/피해자 분리 항목, 가/피해자 미분리 항목 등을 포함한다. 또한, 상기 제 1 제어부는 상기 제 1 훈련자가 보유 중인 제 1 조이스틱을 통해서 상기 제 1 표시부에 표시 중 인 제 2-4 서브 훈련 상황 콘텐츠에서 음주 항목, 흥분 상태 항목, 가/피해자 분리 항목 등을 포함하는 제 000001-2-4 서브 훈련 입력값을 수신한다. 또한, 상기 제 1 제어부는 상기 제 2 훈련자가 보유 중인 제 2 조이스틱을 통해서 상기 제 2 표시부에 표시 중 인 제 2-4 서브 훈련 상황 콘텐츠에서 음주 항목, 흥분 상태 항목, 가/피해자 분리 항목 등을 포함하는 제 000007-2-4 서브 훈련 입력값을 수신한다. 또한, 상기 제 1 제어부는 해당 제 1 학습자 및 제 2 학습자가 부적절/불필요하거나 난동행위자를 도발하지 않 고 난동행위자를 '순응' 상태로 이끌어내기 위한 상황과 언어를 선택할 수 있는지를 확인하기 위해서, 도 25에 도시된 바와 같이, 다음 상태에서 훈련자가 수행해야 할 정보들을 포함하는 제 2-5 서브 훈련 상황 콘텐츠 를 상기 제 1 표시부 및 상기 제 1 음성 출력부와 상기 제 2 표시부 및 상기 제 2 음성 출력부를 통해 각 각 출력한다. 여기서, 상기 제 2-5 서브 훈련 상황 콘텐츠는 훈련자의 다음 행동을 확인하기 위해서, 정답 및 오답을 포함하는 행위 중단 설득 항목, 행위 중단 경고 항목, 무기 사용 고지 항목, 총기 사용 고지 항목 등을 포함한다. 또한, 상기 제 1 제어부는 상기 제 1 훈련자가 보유 중인 제 1 조이스틱을 통해서 상기 제 1 표시부에 표시 중 인 제 2-5 서브 훈련 상황 콘텐츠에서 행위 중단 경고 항목, 무기 사용 고지 항목 등을 포함하는 제 000001-2-5 서브 훈련 입력값을 수신한다. 또한, 상기 제 1 제어부는 상기 제 2 훈련자가 보유 중인 제 2 조이스틱을 통해서 상기 제 2 표시부에 표시 중 인 제 2-5 서브 훈련 상황 콘텐츠에서 행위 중단 경고 항목, 무기 사용 고지 항목 등을 포함하는 제 000007-2-5 서브 훈련 입력값을 수신한다. 또한, 상기 제 1 제어부는 해당 제 1 학습자 및 제 2 학습자가 적합한 물리력 대응 방법을 선택하기 위해 범죄 종류, 경찰관 수, 흉기 종류, 난동행위자의 신체 및 건강 상태, 피해 상황, 저항 강도, 위해 급박성 등을 제대 로 파악하고 있는지를 확인하기 위해서, 도 26에 도시된 바와 같이, 다음 상태에서 훈련자가 수행해야 할 정보 들을 포함하는 제 2-6 서브 훈련 상황 콘텐츠를 상기 제 1 표시부 및 상기 제 1 음성 출력부와 상기 제 2 표시부 및 상기 제 2 음성 출력부를 통해 각각 출력한다. 여기서, 상기 제 2-6 서브 훈련 상황 콘텐츠는 훈련자 의 다음 행동을 확인하기 위해서, 정답 및 오답을 포함하는 폭력적 공격 항목, 치명적 공격 항목, 적극적 저항 항목(또는 적극적 공격 항목), 소극적 저항 항목(또는 소극적 공격 항목), 순응 항목(또는 순응 상태 항목) 등을 포함한다. 또한, 상기 제 1 제어부는 상기 제 1 훈련자가 보유 중인 제 1 조이스틱을 통해서 상기 제 1 표시부에 표시 중 인 제 2-6 서브 훈련 상황 콘텐츠에서 폭력적 공격 항목 등을 포함하는 제 000001-2-6 서브 훈련 입력값 을 수신한다. 또한, 상기 제 1 제어부는 상기 제 2 훈련자가 보유 중인 제 2 조이스틱을 통해서 상기 제 2 표시부에 표시 중 인 제 2-6 서브 훈련 상황 콘텐츠에서 폭력적 공격 항목 등을 포함하는 제 000007-2-6 서브 훈련 입력값 을 수신한다. 또한, 상기 제 1 제어부는 해당 제 1 학습자 및 제 2 학습자가 파악한 저항 강도(또는 저항 정도)에서 사용할 수 있는 물리력 행사 수단을 정확하게 알고 있는지를 확인하기 위해서, 도 27에 도시된 바와 같이, 다음 상태에 서 훈련자가 수행해야 할 정보들을 포함하는 제 2-7 서브 훈련 상황 콘텐츠를 상기 제 1 표시부 및 상기 제 1 음성 출력부와 상기 제 2 표시부 및 상기 제 2 음성 출력부를 통해 각각 출력한다. 여기서, 상기 제 2-7 서브 훈련 상황 콘텐츠는 훈련자의 다음 행동을 확인하기 위해서, 정답 및 오답을 포함하는 대화 항목(또는 말 로 설득 항목), 삼단봉/방패 항목, 가스분사기 항목, 테이저건 항목, 권총 항목 등을 포함한다. 또한, 상기 제 1 제어부는 상기 제 1 훈련자가 보유 중인 제 1 조이스틱을 통해서 상기 제 1 표시부에 표시 중 인 제 2-7 서브 훈련 상황 콘텐츠에서 삼단봉/방패 항목, 가스분사기 항목 등을 포함하는 제 000001-2-7 서브 훈련 입력값을 수신한다. 또한, 상기 제 1 제어부는 상기 제 2 훈련자가 보유 중인 제 2 조이스틱을 통해서 상기 제 2 표시부에 표시 중 인 제 2-7 서브 훈련 상황 콘텐츠에서 삼단봉/방패 항목 등을 포함하는 제 000007-2-7 서브 훈련 입력값 을 수신한다. 또한, 상기 제 1 제어부는 해당 제 1 학습자 및 제 2 학습자가 선택한 물리력 행사 수단을 이용해서 제대로 물 리력을 행사하는지를 확인하기 위해서, 도 28에 도시된 바와 같이, 다음 상태에서 훈련자가 수행해야 할 정보들 을 포함하는 제 2-8 서브 훈련 상황 콘텐츠를 상기 제 1 표시부 및 상기 제 1 음성 출력부와 상기 제 2 표시부 및 상기 제 2 음성 출력부를 통해 각각 출력한다. 여기서, 상기 제 2-8 서브 훈련 상황 콘텐츠는 훈련자 의 다음 행동을 확인하기 위해서, 정답 및 오답을 포함하는 난동행위자의 신체 일부 영역에 물리력 행사 수단의 적절 위치 항목, 부적절 위치 항목 등을 포함한다. 이때, 상기 제 1 제어부는 앞서 단계에서 해당 제 1 학습자 및 제 2 학습자 중에서 안전 장구 항목을 선택하지 않은 학습자에 대해서는 부상을 입어 전체 학습 과정을 종료 하는 화면(또는 콘텐츠)을 상기 제 1 표시부 및/또는 제 2 표시부에 표시할 수 있다. 또한, 상기 제 1 제어부는 상기 제 1 훈련자가 보유 중인 제 1 조이스틱을 통해서 상기 제 1 표시부에 표시 중 인 제 2-8 서브 훈련 상황 콘텐츠에서 난동행위자의 신체 일부 영역에 해당 학습자가 선택한 물리력 행사 수단을 적용할 위치 정보 등을 포함하는 제 000001-2-8 서브 훈련 입력값을 수신한다. 또한, 상기 제 1 제어부는 상기 제 2 훈련자가 보유 중인 제 2 조이스틱을 통해서 상기 제 2 표시부에 표시 중 인 제 2-8 서브 훈련 상황 콘텐츠에서 난동행위자의 신체 일부 영역에 해당 학습자가 선택한 물리력 행사 수단을 적용할 위치 정보 등을 포함하는 제 000007-2-8 서브 훈련 입력값을 수신한다. 또한, 상기 제 1 제어부는 앞서 제 1 학습자에 의해 선택된 행위자 체포 및 위험요소 차단 항목에 따라, 해당 제 1 학습자가 난동행위자 체포와 관련한 내용을 정확하게 이해하고 있는지를 확인하기 위해서, 도 29에 도시된 바와 같이, 다음 상태에서 훈련자가 수행해야 할 정보들을 포함하는 제 2-9 서브 훈련 상황 콘텐츠를 상 기 제 1 표시부 및 상기 제 1 음성 출력부를 통해 출력한다. 여기서, 상기 제 2-9 서브 훈련 상황 콘텐츠는 훈 련자의 다음 행동을 확인하기 위해서, 정답 및 오답을 포함하는 행위자 체포 항목, 행위자 권리 고지 항목, 행 위자 수색 항목, 행위자 부상 확인 항목, 행위자 연행 항목, 난동 현장 위험요소 차단 항목, 난동 현장 촬영 항 목 등을 포함한다. 또한, 상기 제 1 제어부는 상기 제 1 훈련자가 보유 중인 제 1 조이스틱의 선택에 따라 상기 제 1 표시부에 표 시 중인 제 2-9 서브 훈련 상황 콘텐츠에서의 행위자 체포 항목, 행위자 권리 고지 항목, 행위자 수색 항 목, 행위자 부상 확인 항목, 행위자 연행 항목, 난동 현장 위험요소 차단 항목, 난동 현장 촬영 항목 중 어느 하나의 항목이 선택될 때, 선택된 항목에 대응하는 추가 서브 훈련 상환 콘텐츠를 상기 제 1 표시부에 표시한다. 즉, 상기 제 1 제어부는 상기 제 1 훈련자가 보유 중인 제 1 조이스틱의 선택에 따라 상기 제 1 표시부에 표시 중인 제 2-9 서브 훈련 상황 콘텐츠에서의 행위자 체포 항목이 선택될 때, 도 30에 도시된 바와 같이, 다 음 상태에서 훈련자가 수행해야 할 정보들을 포함하는 제 2-10 서브 훈련 상황 콘텐츠를 상기 제 1 표시 부 및 상기 제 1 음성 출력부를 통해 출력한다. 여기서, 상기 제 2-10 서브 훈련 상황 콘텐츠는 훈련자의 다음 행동을 확인하기 위해서, 정답 및 오답을 포함하는 화면에 표시되는 수갑 아이템을 이용해서 난동행위자에 대한 체포 동작을 수행하기 위한 항목 등을 포함한다. 또한, 상기 제 1 제어부는 상기 제 1 훈련자가 보유 중인 제 1 조이스틱의 선택에 따라 상기 제 1 표시부에 표 시 중인 제 2-10 서브 훈련 상황 콘텐츠에서의 난동행위자의 신체 일부 영역에 해당 학습자가 선택한 수 갑 아이템을 적용하는 정보 등을 포함하는 제 2-10 서브 훈련 입력값을 수신한다. 또한, 상기 제 1 제어부는 난동행위자 체포 후, 상기 제 1 표시부에 표시되는 제 2-9 서브 훈련 상황 콘텐츠 에서 상기 제 1 훈련자가 보유 중인 제 1 조이스틱의 선택에 따라 행위자 권리 고지 항목이 선택될 때, 도 31에 도시된 바와 같이, 다음 상태에서 훈련자가 수행해야 할 정보들을 포함하는 제 2-11 서브 훈련 상황 콘 텐츠를 상기 제 1 표시부 및 상기 제 1 음성 출력부를 통해 출력한다. 여기서, 상기 제 2-11 서브 훈련 상황 콘텐츠는 훈련자의 다음 행동을 확인하기 위해서, 정답 및 오답을 포함하는 미란다 원칙 내용 등을 포함한 다. 또한, 상기 제 1 제어부는 상기 제 1 훈련자가 착용 중인 상기 제 1 입력부에 포함된 제 1 마이크를 통해 해당 제 1 훈련자의 미란다 원칙 고지 내용을 포함하는 제 2-11 서브 훈련 입력값을 수신한다. 또한, 상기 제 1 제어부는 미란다 원칙 고지 후, 상기 제 1 표시부에 표시되는 제 2-9 서브 훈련 상황 콘텐츠 에서 상기 제 1 훈련자가 보유 중인 제 1 조이스틱의 선택에 따라 행위자 수색 항목이 선택될 때, 도 32 에 도시된 바와 같이, 다음 상태에서 훈련자가 수행해야 할 정보들을 포함하는 제 2-12 서브 훈련 상황 콘텐츠 를 상기 제 1 표시부 및 상기 제 1 음성 출력부를 통해 출력한다. 여기서, 상기 제 2-12 서브 훈련 상황 콘텐츠는 훈련자의 다음 행동을 확인하기 위해서, 정답 및 오답을 포함하는 해당 난동행위자가 위해 물건을 소 지하고 있는지 확인하기 위한 항목 등을 포함한다. 또한, 상기 제 1 제어부는 상기 제 1 훈련자가 보유 중인 제 1 조이스틱의 선택에 따라 상기 제 1 표시부에 표 시 중인 제 2-12 서브 훈련 상황 콘텐츠에서의 난동행위자의 신체 일부 영역에 해당 학습자가 선택한 위 해 물건 소지 확인을 적용할 위치 정보 등을 포함하는 제 2-12 서브 훈련 입력값을 수신한다. 또한, 상기 제 1 제어부는 난동행위자의 위해 물건 소지 여부 확인 후, 상기 제 1 표시부에 표시되는 제 2-9 서 브 훈련 상황 콘텐츠에서 상기 제 1 훈련자가 보유 중인 제 1 조이스틱의 선택에 따라 행위자 부상 확인 항목이 선택될 때, 도 33에 도시된 바와 같이, 다음 상태에서 훈련자가 수행해야 할 정보들을 포함하는 제 2-13 서브 훈련 상황 콘텐츠를 상기 제 1 표시부 및 상기 제 1 음성 출력부를 통해 출력한다. 여기서, 상기 제 2-13 서브 훈련 상황 콘텐츠는 훈련자의 다음 행동을 확인하기 위해서, 정답 및 오답을 포함하는 난동행위자의 부상 여부를 확인하기 위해서 난동행위자와 관련한 360도 영상 항목 등을 포함한다. 또한, 상기 제 1 제어부는 상기 제 1 훈련자가 보유 중인 제 1 조이스틱의 선택에 따라 상기 제 1 표시부에 표 시 중인 제 2-13 서브 훈련 상황 콘텐츠에서의 난동행위자의 신체 일부 영역에 해당 학습자가 부상 여부 확인을 적용할 위치 정보 등을 포함하는 제 2-13 서브 훈련 입력값을 수신한다. 또한, 상기 제 1 제어부는 난동행위자의 부상 여부 확인 후, 상기 제 1 표시부에 표시되는 제 2-9 서브 훈련 상 황 콘텐츠에서 상기 제 1 훈련자가 보유 중인 제 1 조이스틱의 선택에 따라 행위자 연행 항목이 선택될 때, 도 34에 도시된 바와 같이, 다음 상태에서 훈련자가 수행해야 할 정보들을 포함하는 제 2-14 서브 훈련 상 황 콘텐츠를 상기 제 1 표시부 및 상기 제 1 음성 출력부를 통해 출력한다. 여기서, 상기 제 2-14 서브 훈련 상황 콘텐츠는 훈련자의 다음 행동을 확인하기 위해서, 정답 및 오답을 포함하는 난동행위자의 일측에 해 당 제 1 훈련자가 위치하여 연행하는 항목 등을 포함한다. 이때, 상기 제 1 제어부는 미란다 원칙을 고지하는 내용을 상기 제 1 표시부 및 상기 제 1 음성 출력부를 통해 추가로 출력할 수도 있다. 또한, 상기 제 1 제어부는 난동행위자의 연행 후, 피해 현장에서의 위험 요소를 정확히 파악하고 이를 제거했는 지 확인하기 위해서, 도 35에 도시된 바와 같이, 다음 상태에서 훈련자가 수행해야 할 정보들을 포함하는 제 2- 15 서브 훈련 상황 콘텐츠를 상기 제 1 표시부 및 상기 제 1 음성 출력부를 통해 출력한다. 여기서, 상기 제 2-15 서브 훈련 상황 콘텐츠는 훈련자의 다음 행동을 확인하기 위해서, 정답 및 오답을 포함하는 깨진 술병 항목, 가위 항목, 프라이팬 항목, 티슈케이스 항목, 휴지통 항목 등을 포함한다. 또한, 상기 제 1 제어부는 상기 제 1 훈련자가 보유 중인 제 1 조이스틱의 선택에 따라 상기 제 1 표시부에 표 시 중인 제 2-15 서브 훈련 상황 콘텐츠에서의 깨진 술병 항목, 가위 항목 등을 포함하는 제 2-15 서브 훈련 입력값을 수신한다. 또한, 상기 제 1 제어부는 위험 요소 제거 후, 피해 현장에 대한 영상 정보를 획득하기 위해서, 도 36에 도시된 바와 같이, 다음 상태에서 훈련자가 수행해야 할 정보들을 포함하는 제 2-16 서브 훈련 상황 콘텐츠를 상 기 제 1 표시부 및 상기 제 1 음성 출력부를 통해 출력한다. 여기서, 상기 제 2-16 서브 훈련 상황 콘텐츠는 훈 련자의 다음 행동을 확인하기 위해서, 정답 및 오답을 포함하는 난동 현장 내의 복수의 구역별로 동영상을 촬영 하기 위한 항목 등을 포함한다. 또한, 상기 제 1 제어부는 상기 제 1 훈련자가 보유 중인 제 1 조이스틱의 선택에 따라 상기 제 1 표시부에 표 시 중인 제 2-16 서브 훈련 상황 콘텐츠에서의 난동 현장 촬영이 필요한 하나 이상의 구역 등을 포함하는 제 2-16 서브 훈련 입력값을 수신한다. 또한, 상기 제 1 제어부는 앞서 제 2 학습자에 의해 선택된 피해자 구조 및 피해조사 항목에 따라, 해당 제 2 학습자가 피해자 구조와 관련한 내용을 정확하게 이해하고 있는지를 확인하기 위해서, 도 37에 도시된 바와 같 이, 다음 상태에서 훈련자가 수행해야 할 정보들을 포함하는 제 2-17 서브 훈련 상황 콘텐츠를 상기 제 2 표시부 및 상기 제 2 음성 출력부를 통해 출력한다. 여기서, 상기 제 2-17 서브 훈련 상황 콘텐츠는 훈련자의 다음 행동을 확인하기 위해서, 정답 및 오답을 포함하는 피해자의 부상 정도를 확인하기 위한 주체를 선택하기 위해서 119 구급 대원 항목, 경찰 본인 항목 등을 포함한다. 또한, 상기 제 1 제어부는 상기 제 2 훈련자가 보유 중인 제 2 조이스틱의 선택에 따라 상기 제 2 표시부에 표 시 중인 제 2-17 서브 훈련 상황 콘텐츠에서의 119 구급 대원 항목 또는 경찰 본인 항목이 선택될 때, 선 택된 항목에 대응하는 추가 서브 훈련 상환 콘텐츠를 상기 제 2 표시부에 표시한다. 즉, 상기 제 1 제어부는 상기 제 2 훈련자가 보유 중인 제 2 조이스틱의 선택에 따라 상기 제 2 표시부에 표시 중인 제 2-17 서브 훈련 상황 콘텐츠에서의 119 구급 대원 항목이 선택될 때, 도 38에 도시된 바와 같이, 다음 상태에서 훈련자가 수행해야 할 정보들을 포함하는 제 2-18 서브 훈련 상황 콘텐츠를 상기 제 2 표 시부 및 상기 제 2 음성 출력부를 통해 출력한다. 여기서, 상기 제 2-18 서브 훈련 상황 콘텐츠는 훈련자의 다 음 행동을 확인하기 위해서, 정답 및 오답을 포함하는 피해자의 부상 정도(예를 들어 부상을 입지 않음, 경미한 부상, 심각한 부상 등 포함)를 파악하고, 파악된 피해자의 부상 정도에 따라 추가로 병원 치료 의사를 물어보기 위한 항목, 병원 치료 의사를 물어보지 않기 위한 항목 등을 포함한다. 또한, 상기 제 1 제어부는 상기 제 2 훈련자가 보유 중인 제 2 조이스틱의 선택에 따라 상기 제 2 표시부에 표 시 중인 제 2-18 서브 훈련 상황 콘텐츠에서의 병원 치료 의사를 물어보기 위한 항목이 선택될 때, 도 39 에 도시된 바와 같이, 다음 상태에서 훈련자가 수행해야 할 정보들을 포함하는 제 2-19 서브 훈련 상황 콘텐츠 를 상기 제 2 표시부 및 상기 제 2 음성 출력부를 통해 출력한다. 여기서, 상기 제 2-19 서브 훈련 상황 콘텐츠는 훈련자의 다음 행동을 확인하기 위해서, 정답 및 오답을 포함하는 피해자의 병원 치료 여부에 따른 의 사에 따라 후속 조치를 수행하기 위한 119에 피해자 연계 항목, 피해자에게 119 인계 안내 항목, 상황실 보고 항목, 지구대로 피해자 이송 항목, 피해자 귀가 조치 항목 등을 포함한다. 또한, 상기 제 1 제어부는 상기 제 2 훈련자가 보유 중인 제 2 조이스틱의 선택에 따라 상기 제 2 표시부에 표 시 중인 제 2-19 서브 훈련 상황 콘텐츠에서의 피해자의 의사에 따른 119에 피해자 연계 항목, 피해자에 게 119 인계 안내 항목, 상황실 보고 항목 등을 포함하는 제 2-19 서브 훈련 입력값을 수신한다. 또한, 상기 제 1 제어부는 피해자 구조 후, 목격자 정보를 확인하기 위해서, 도 40에 도시된 바와 같이, 다음 상태에서 훈련자가 수행해야 할 정보들을 포함하는 제 2-20 서브 훈련 상황 콘텐츠를 상기 제 2 표시부 및 상기 제 2 음성 출력부를 통해 출력한다. 여기서, 상기 제 2-20 서브 훈련 상황 콘텐츠는 훈련자의 다음 행 동을 확인하기 위해서, 정답 및 오답을 포함하는 난동 현장을 목격한 목격자에 대한 정보를 수집하기 위해서, 목격자 정보 확인 항목, 피해조사 항목, 증거 확보 항목, 창업 비용 항목 등을 포함한다. 또한, 상기 제 1 제어부는 상기 제 2 훈련자가 보유 중인 제 2 조이스틱의 선택에 따라 상기 제 2 표시부에 표 시 중인 제 2-20 서브 훈련 상황 콘텐츠에서의 목격자 정보 확인 항목이 선택될 때, 목격자와의 인터뷰에 대한 정보를 포함하는 추가 서브 훈련 상황 콘텐츠를 상기 제 2 표시부 및 상기 제 2 음성 출력부를 통해 출력 하고, 그에 따른 목격자와의 인터뷰 진행 결과 등을 포함하는 제 2-20 서브 훈련 입력값을 수신한다. 또한, 상기 제 1 제어부는 목격자 정보 확인 후, 피해 상황을 확인하기 위해서 상기 제 2 표시부에 표시되는 제 2-20 서브 훈련 상황 콘텐츠에서 상기 제 2 훈련자가 보유 중인 제 2 조이스틱의 선택에 따라 피해조사항목이 선택될 때, 도 41에 도시된 바와 같이, 다음 상태에서 훈련자가 수행해야 할 정보들을 포함하는 제 2-21 서브 훈련 상황 콘텐츠를 상기 제 2 표시부 및 상기 제 2 음성 출력부를 통해 출력한다. 여기서, 상기 제 2-21 서브 훈련 상황 콘텐츠는 훈련자의 다음 행동을 확인하기 위해서, 정답 및 오답을 포함하는 피해 상황 확 인 항목, 흉기난동 초기 발생 상황 확인 항목 등을 포함한다. 또한, 상기 제 1 제어부는 상기 제 2 훈련자가 보유 중인 제 2 조이스틱의 선택에 따라 상기 제 2 표시부에 표 시 중인 제 2-21 서브 훈련 상황 콘텐츠에서의 피해 상황 확인 항목 등을 포함하는 제 2-21 서브 훈련 입 력값을 수신한다. 또한, 상기 제 1 제어부는 피해 상황 확인 후, 증거를 확보하기 위해서 상기 제 2 표시부에 표시되는 제 2-20 서브 훈련 상황 콘텐츠에서 상기 제 2 훈련자가 보유 중인 제 2 조이스틱의 선택에 따라 증거확보 항목이 선택될 때, 도 42에 도시된 바와 같이, 다음 상태에서 훈련자가 수행해야 할 정보들을 포함하는 제 2-22 서브 훈련 상황 콘텐츠를 상기 제 2 표시부 및 상기 제 2 음성 출력부를 통해 출력한다. 여기서, 상기 제 2-22 서브 훈련 상황 콘텐츠는 훈련자의 다음 행동을 확인하기 위해서, 정답 및 오답을 포함하는 해당 난동 현장을 관리 중인 관리자에게 CCTV 촬영 여부를 확인하고, CCTV 자료를 입수하기 위해서, 목격자 정보 확인 항목, 피해 조사 항목, 증거 확보 항목, 창업 비용 항목 등을 포함한다. 또한, 상기 제 1 제어부는 상기 제 2 훈련자가 보유 중인 제 2 조이스틱의 선택에 따라 상기 제 2 표시부에 표 시 중인 제 2-22 서브 훈련 상황 콘텐츠에서의 증거 확보 항목이 선택될 때, 주점 내부에 구성된 CCTV를 통해 촬영된 영상 정보에 대한 증거를 수집하는 과정, 상기 제 2 훈련자가 착용 중인 상기 제 2 입력부에 포함 된 제 2 마이크를 통해 해당 제 2 훈련자의 CCTV 촬영 여부 확인 코멘트, CCTV 자료 입수를 위한 코멘트 등을 포함하는 제 2-22 서브 훈련 입력값을 수신한다(S830). 이후, 상기 제어부는 상기 훈련 시나리오에 따른 복수의 단계별 훈련 상황 중에서 미리 설정된 사후조치 단계에 대응하는 사후조치 단계 실감형 콘텐츠를 상기 표시부 및/또는 상기 음성 출력부를 통해 출력 한다. 여기서, 상기 사후조치 단계 실감형 콘텐츠는 흉기 난동 발생 장소 화면 영역, 서브 훈련 상황별 시스템 메시지 표시 영역, 서브 훈련 상황별 선택지 옵션 표시 영역 등으로 구성된 사용자 인터페이스를 포함하며, 112 치안종합상황실에 상황 종료를 보고하였는지를 확인하기 위해서 사건 종결에 따른 발생보고 정보, 상황 종료 후 어떤 보고서를 작성해야 하는지를 알고 있는지 확인하기 위해서 보고서 작성 정보(예를 들어 물리력 사용 보고 서, 경찰 사용 장구 보고서, 현행범 체포서, 범죄신고 접수대장, 사건발생 검거보고 등 포함) 등의 복수의 또 다른 서브 훈련 상황(또는 복수의 또 다른 서브 훈련 상황 콘텐츠)을 포함한다. 이때, 상기 발생보고 정보는 촬 영된 난동 현장과 관련한 영상 정보, 수집된 증거 등을 포함한다. 또한, 상기 보고서 작성 정보는 난동 현장과 관련해서 미리 설정된 형식의 하나 이상의 보고서를 작성하기 위한 정보 등을 포함한다. 또한, 상기 제어부는 상기 입력부를 통해 사용자 입력(또는 사용자 선택/터치/제어/반응)에 따른 해 당 사후조치 단계 실감형 콘텐츠에 포함된 복수의 또 다른 서브 훈련 상황에 대응하는 복수의 또 다른 입력값을 서브 훈련 상황별(또는 서브 훈련 상황별 복수의 또 다른 입력값)로 수신한다. 이때, 상기 제어부는 훈련 자별 평가를 위해서 복수의 훈련자별로 서브 훈련 상황별 복수의 또 다른 입력값을 각각 수신한다. 이와 같이, 상기 훈련 시나리오에 포함된 사후조치 단계와 관련해서, 사후조치 단계 실감형 콘텐츠에 포함된 복 수의 또 다른 서브 훈련 상황과 관련한 콘텐츠를 출력하고, 그에 따른 학습자의 반응에 의한 복수의 훈련자별로 서브 훈련 상황별 복수의 또 다른 입력값을 각각 수신(또는 수집)할 수 있다. 일 예로, 상기 제 1 제어부는 상기 제 3 훈련 시나리오에 따른 복수의 단계별 훈련 상황 중에서 미리 설정된 사 후조치 단계에 대응하는 제 3 사후조치 단계 실감형 콘텐츠를 확인하고, 도 43에 도시된 바와 같이, 상기 제 3 사후조치 단계 실감형 콘텐츠에 포함된 제 3-1 서브 훈련 상황 콘텐츠를 상기 제 1 표시부 및 상기 제 1 음성 출력부와 상기 제 2 표시부 및 상기 제 2 음성 출력부를 통해 각각 출력한다. 여기서, 상기 제 3-1 서브 훈련 상황 콘텐츠는 훈련자의 다음 행동을 확인하고, 피해 현장과 관련해서 사건 종결을 위해 필요한 보고를 선 택하기 위해서, 정답 및 오답을 포함하는 발생보고 항목, 보고서 작성 항목, 훈련 종료 항목, 목격자 지구대 이 송 항목 등을 포함한다. 또한, 상기 제 1 제어부는 상기 제 1 훈련자가 보유 중인 제 1 조이스틱 또는 상기 제 2 훈련자가 보유 중인 제 2 조이스틱의 선택에 따라 상기 제 1 표시부 또는 상기 제 2 표시부에 표시 중인 제 3-1 서브 훈련 상황 콘텐츠 에서 발생보고 항목이 선택될 때, 도 44에 도시된 바와 같이, 제 3-2 서브 훈련 상황 콘텐츠를 상 기 제 1 표시부 및 상기 제 1 음성 출력부와 상기 제 2 표시부 및 상기 제 2 음성 출력부를 통해 각각출력한다. 여기서, 상기 제 3-2 서브 훈련 상황 콘텐츠는 훈련자의 다음 행동을 확인하기 위해서, 정답 및 오답 을 포함하는 난동 현장에서의 사건 처리 종료를 위해 112 치안종합상황실에 보고하기 위한 현장 종결 보고 항목, 발생보고 항목 등을 포함한다. 또한, 상기 제 1 제어부는 상기 제 1 훈련자가 보유 중인 제 1 조이스틱을 통해서 상기 제 1 표시부에 표시 중 인 제 3-2 서브 훈련 상황 콘텐츠에서 현장 종결 보고 항목 등을 포함하는 제 000001-3-2 서브 훈련 입력 값을 수신한다. 또한, 상기 제 1 제어부는 상기 제 2 훈련자가 보유 중인 제 2 조이스틱을 통해서 상기 제 2 표시부에 표시 중 인 제 3-2 서브 훈련 상황 콘텐츠에서 현장 종결 보고 항목 등을 포함하는 제 000007-3-2 서브 훈련 입력 값을 수신한다. 또한, 상기 제 1 제어부는 상기 제 1 훈련자가 보유 중인 제 1 조이스틱 또는 상기 제 2 훈련자가 보유 중인 제 2 조이스틱의 선택에 따라 상기 제 1 표시부 또는 상기 제 2 표시부에 표시 중인 제 3-1 서브 훈련 상황 콘텐츠 에서 보고서 작성 항목이 선택될 때, 도 45에 도시된 바와 같이, 제 3-3 서브 훈련 상황 콘텐츠를 상기 제 1 표시부 및 상기 제 1 음성 출력부와 상기 제 2 표시부 및 상기 제 2 음성 출력부를 통해 각각 출력한 다. 여기서, 상기 제 3-3 서브 훈련 상황 콘텐츠는 훈련자의 다음 행동을 확인하고 상황 종료 후 작성해야 하는 보고서가 무엇인지를 확인하기 위해서, 정답 및 오답을 포함하는 난동 상황에 대해서 전반적인 보고서 작성을 위한 항목 등을 포함한다. 또한, 상기 제 1 제어부는 상기 제 1 훈련자가 보유 중인 제 1 조이스틱을 통해서 상기 제 1 표시부에 표시 중 인 제 3-3 서브 훈련 상황 콘텐츠에서 보고서 종류 항목 등을 포함하는 제 000001-3-3 서브 훈련 입력값 을 수신한다. 또한, 상기 제 1 제어부는 상기 제 2 훈련자가 보유 중인 제 2 조이스틱을 통해서 상기 제 2 표시부에 표시 중 인 제 3-3 서브 훈련 상황 콘텐츠에서 보고서 종류 항목 등을 포함하는 제 000007-3-3 서브 훈련 입력값 을 수신한다. 또한, 도 46에 도시된 바와 같이, 상기 제 1 제어부는 전체 훈련이 종료되었음을 나타내는 정보들을 포함하는 제 3-4 서브 훈련 상황 콘텐츠를 상기 제 1 표시부 및 상기 제 1 음성 출력부와 상기 제 2 표시부 및 상 기 제 2 음성 출력부를 통해 각각 출력한다(S840). 이후, 상기 제어부는 미리 설정된 항목별 행동지표, 상기 수신된 단계별 훈련 상황에 따른 입력값(예를 들 어 서브 훈련 상황별 복수의 입력값, 서브 훈련 상황별 복수의 다른 입력값, 서브 훈련 상황별 복수의 또 다른 입력값 등 포함) 등을 근거로 단계별 훈련 상황에 대한 평가 결과를 생성한다. 이때, 상기 항목별 행동지표는 법집행 공정성과 관련한 행동지표(예를 들어 규범적 타당성, 사실적 실효성, 일관성 등 포함), 인권존중과 관련 한 행동지표(예를 들어 권리보장, 안전보호, 긴급구조 등 포함), 현장에서 소통과 관련한 행동지표(예를 들어 전달, 수용, 배려 등 포함), 직무의 성실성과 관련한 행동지표(예를 들어 기초판단, 실행관리, 직무완수 등 포 함), 동료와의 협업과 관련한 행동지표(예를 들어 업무분장, 자원공유, 화합단결 등 포함) 등을 포함한다. 여기 서, 상기 평가 결과는 해당 훈련을 수행한 복수의 훈련자를 포함하는 하나의 팀에 대한 평가 결과이며, 총평, 훈련결과, 세부 훈련기록 등을 포함한다. 이때, 상기 총평(또는 전체 평가 결과/종합 평가 결과)은 복수의 훈련 자명, 훈련 시나리오, 훈련 소요시간, 훈련 점수, 방사형 그래프 형태의 복수의 역량별 결과, 훈련 총평 등을 포함한다. 또한, 상기 훈련결과(또는 미리 설정된 복수의 역량별 결과)는 미리 설정된 5대 역량과 관련한 시민 지향(예를 들어 인권존중, 현장에서의 소통 등 포함), 업무지향(예를 들어 직무의 성실성, 동료와의 협업 등 포 함), 통합(예를 들어 법집행 공정성 등 포함) 등의 훈련 방향에 대한 결과(예를 들어 상, 중, 하 등 포함), 세 부결과 등을 포함한다. 또한, 상기 세부 훈련기록은 복수의 훈련자명, 훈련 시나리오, 훈련 소요시간, 훈련 점 수, 훈련일자 및 시각 정보, 미리 설정된 복수의 강평 문항별 결과 등을 포함한다. 또한, 상기 미리 설정된 복 수의 강평 문항별 결과는 상기 복수의 훈련자에게 제공되는 복수의 서브 훈련 상황 콘텐츠에 대응하여 상기 수 신된 단계별 훈련 상황에 따른 입력값 중에서 미리 설정된 하나 이상의 특정 서브 훈련 상황 콘텐츠에 대응하여 입력된(또는 수신된) 하나 이상의 특정 서브 훈련 입력값을 근거로 미리 설정된 현장 대처 계획 수립 항목(또는 역할 분담 항목), 난동행위자에 접근, 고지 및 위험요소 차단 항목(또는 신분고지 및 상황설명 항목), 난동행위 자 대처 항목(또는 물리력 행사 기준 적용 항목), 피해자 구조 항목(또는 피해자 부상 확인 요청 항목), 물리력 대응 평가 항목(또는 언어적 통제 항목/대상자 행위 수준 판단 및 물리력 행사 항목), 현장 진입 전 준비 항목 (또는 보고 및 업무 분장 항목/안전 장구 착용 확인 항목) 등에 대해서 평가한 결과이며, 사용자 입력값에 따른 정답 여부에 대한 정보, 관련된 법 조항(또는 코멘트) 등을 포함한다. 여기서, 상기 강평은 작품이나 연기, 또는 실습 등에 대해 총괄적으로 분석하고 평가하는 기능을 의미한다(또는 나타낸다). 이때, 상기 제어부는 동일 항목에 대해서 상기 복수의 훈련자로부터 입력값을 각각 수신한 경우, 먼저 입력된 입력값을 해당 항목에 대응하는 입력값으로 사용할 수 있다. 또한, 상기 제어부는 상기 생성된 해당 복수의 훈련자를 포함하는 하나의 팀에 대한 평가 결과 등을 상기 표시부 및/또는 상기 음성 출력부를 통해 출력한다. 이때, 상기 평가 결과는 총평 항목(또는 총평 탭), 훈련결과 항목(또는 훈련결과 탭), 세부 훈련기록 항목(또는 세부 훈련기록 탭) 등으로 분류하여 표시되며, 각 항목(또는 탭)이 선택되는 경우 선택된 항목에 대응하는 세부 정보(예를 들어 총평, 훈련결과, 세 부 훈련기록 등 포함)가 표시될 수 있다. 이와 같이, 상기 제어부는 현장경찰관의 법집행력 강화라는 가상현실 교육의 목표를 달성하기 위해서, 가 상현실 학습 과정 중 발생한 학습자(또는 훈련자)의 주요 선택과 행위를 법령 또는 업무 매뉴얼에 근거하여 평 가하고, 개선이 필요한 사항이 확인될 경우 정확한 정보를 전달하여 학습자 스스로 학습하고 현장 적용이 가능 하도록 지원할 수 있다. 또한, 상기 제어부는 제한된 가상환경을 통해 경찰의 업무의 가변성을 모두 표현하지 못하고 제한적으로 학습하도록 설계됨에 따라 반복 학습 시 발생할 수 있는 흥미 및 참여도 저하를 개선할 수 있는 도구로 활용할 수 있다. 일 예로, 상기 제 1 제어부는 상기 미리 설정된 항목별 행동지표, 상기 수신된 제 000001-1-3 서브 훈련 입력값, 상기 제 000001-1-4 서브 훈련 입력값, 상기 제 000001-1-5 서브 훈련 입력값, 상기 제 000001-1-6 서 브 훈련 입력값, 상기 제 000001-1-7 서브 훈련 입력값, 상기 제 000001-1-11 서브 훈련 입력값, 상기 제 000001-2-1 서브 훈련 입력값, 제 000001-2-2 서브 훈련 입력값, 상기 제 000001-2-3 서브 훈련 입력값, 상기 제 000001-2-4 서브 훈련 입력값, 상기 제 000001-2-5 서브 훈련 입력값, 상기 제 000001-2-6 서브 훈련 입력 값, 상기 제 000001-2-7 서브 훈련 입력값, 상기 제 000001-2-8 서브 훈련 입력값, 상기 제 2-10 서브 훈련 입 력값, 상기 제 2-11 서브 훈련 입력값, 상기 제 2-12 서브 훈련 입력값, 상기 제 2-13 서브 훈련 입력값, 상기 제 2-15 서브 훈련 입력값, 상기 제 2-16 서브 훈련 입력값, 상기 제 000001-3-2 서브 훈련 입력값, 상기 제 000001-3-3 서브 훈련 입력값, 상기 수신된 제 000007-1-3 서브 훈련 입력값, 상기 제 000007-1-4 서브 훈련 입력값, 상기 제 000007-1-5 서브 훈련 입력값, 상기 제 000007-1-6 서브 훈련 입력값, 상기 제 000007-1-7 서 브 훈련 입력값, 상기 제 000007-1-11 서브 훈련 입력값, 상기 제 000007-2-1 서브 훈련 입력값, 제 000007-2- 2 서브 훈련 입력값, 상기 제 000007-2-3 서브 훈련 입력값, 상기 제 000007-2-4 서브 훈련 입력값, 상기 제 000007-2-5 서브 훈련 입력값, 상기 제 000007-2-6 서브 훈련 입력값, 상기 제 000007-2-7 서브 훈련 입력값, 상기 제 000007-2-8 서브 훈련 입력값, 상기 제 2-19 서브 훈련 입력값, 상기 제 2-20 서브 훈련 입력값, 상기 제 2-21 서브 훈련 입력값, 상기 제 2-22 서브 훈련 입력값, 상기 제 000007-3-2 서브 훈련 입력값, 상기 제 000007-3-3 서브 훈련 입력값 등을 근거로 단계별 훈련 상황에 대한 제 1 평가 결과를 생성한다. 이때, 상기 제 1 제어부는 미리 설정된 복수의 강평 문항에 대응하는 상기 제 000001-1-7 서브 훈련 입력값, 상기 제 000001- 1-11 서브 훈련 입력값, 상기 제 000007-1-7 서브 훈련 입력값, 상기 제 000007-1-11 서브 훈련 입력값, 상기 제 000001-2-3 서브 훈련 입력값, 상기 제 000007-2-3 서브 훈련 입력값, 상기 제 000001-2-6 서브 훈련 입력 값, 상기 제 000001-2-7 서브 훈련 입력값, 상기 제 000001-2-8 서브 훈련 입력값, 상기 제 000007-2-6 서브 훈련 입력값, 상기 제 000007-2-7 서브 훈련 입력값, 상기 제 000007-2-8 서브 훈련 입력값, 상기 제 2-11 서브 훈련 입력값, 상기 제 2-19 서브 훈련 입력값 등을 근거로 제 1 세부 훈련기록(또는 상기 미리 설정된 복수의 강평 문항별 결과)을 생성한다. 또한, 도 47에 도시된 바와 같이, 상기 제 1 제어부는 상기 생성된 제 1 평가 결과에 포함된 제 1 훈련자(예를 들어 고유 아이디 000001, 홍길동) 및 제 2 훈련자(예를 들어 고유 아이디 000007, 장발장)와 관련한 제 1 총평 을 상기 제 1 표시부 및 상기 제 1 음성 출력부와 상기 제 2 표시부 및 상기 제 2 음성 출력부를 통해 각 각 출력한다. 또한, 상기 제 1 표시부에 표시되는 제 1 평가 결과 중에서 훈련결과 항목이 선택될 때, 도 48에 도시된 바와 같이, 상기 제 1 제어부는 상기 제 1 평가 결과에 포함된 제 1 훈련결과를 상기 제 1 표시부 및 상 기 제 1 음성 출력부와 상기 제 2 표시부 및 상기 제 2 음성 출력부를 통해 각각 출력한다. 또한, 상기 제 1 표시부에 표시되는 제 1 평가 결과 중에서 세부 훈련기록 항목이 선택될 때, 도 49에 도 시된 바와 같이, 상기 제 1 제어부는 상기 제 1 평가 결과에 포함된 제 1 세부 훈련기록을 상기 제 1 표 시부 및 상기 제 1 음성 출력부와 상기 제 2 표시부 및 상기 제 2 음성 출력부를 통해 각각 출력한다(S850).본 발명의 실시예는 앞서 설명된 바와 같이, 현장에 출동하는 경찰관 등을 대상으로 다양한 현장 상황을 반영한 실감형 가상훈련을 제공하여, 현장 경찰관 등에 대한 법집행력을 강화할 수 있다. 또한, 본 발명의 실시예는 앞서 설명된 바와 같이, 법집행 공정성, 인권존중, 현장에서의 소통, 직무의 성실성, 동료와의 협업 등을 고려하여 생성된 역량 모델을 근거로 다양한 상황별로 학습자가 수행하는 내용에 대해 평가 하고, 평가 결과를 제공하여, 치안 현장 대응력 및 교육 효율성을 높이고, 학습자의 훈련 효과에 대한 만족도를 향상시킬 수 있다. 전술된 내용은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자라면 본 발명의 본질적인 특성에서 벗어 나지 않는 범위에서 수정 및 변형이 가능할 것이다. 따라서, 본 발명에 개시된 실시예들은 본 발명의 기술 사상 을 한정하기 위한 것이 아니라 설명하기 위한 것이고, 이러한 실시예에 의하여 본 발명의 기술 사상의 범위가 한정되는 것은 아니다. 본 발명의 보호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술 사상은 본 발명의 권리범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2023-0003323", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 실감형 가상훈련 장치의 구성을 나타낸 블록도이다. 도 2는 본 발명의 실시예에 따른 현장경찰관 역량 모델의 예를 나타낸 도이다. 도 3 내지 도 7은 본 발명의 실시예에 따른 핵심역량, 행동지표 및 평가준거 간의 관계를 나타낸 도이다. 도 8은 본 발명의 실시예에 따른 실감형 가상훈련 방법을 나타낸 흐름도이다. 도 9 내지 도 49는 본 발명의 실시예에 따른 사용자 인터페이스의 예를 나타낸 도이다."}
