{"patent_id": "10-2023-0032907", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0139206", "출원번호": "10-2023-0032907", "발명의 명칭": "모바일 엣지 컴퓨팅 시스템에 포함되는 무인 항공 서버 및 그 동작 방법", "출원인": "숙명여자대학교산학협력단", "발명자": "임유진"}}
{"patent_id": "10-2023-0032907", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "모바일 엣지 컴퓨팅(MEC: mobile edge computing) 시스템에 포함되는 무인 항공 서버에 있어서,저장부;전자 장치로부터 복수의 서브-태스크(sub-task)를 포함하는 태스크(task)를 수신하고, 결정된 양의 서브-태스크를 상기 모바일 엣지 컴퓨팅 시스템에 포함되는 타겟 무인 항공 서버로 전송하는 통신부; 및강화 학습을 이용하여 상기 타겟 무인 항공 서버로 전송할 상기 서브-태스크의 양을 결정하는 프로세서;를 포함하고,상기 강화 학습에 사용되는 보상(reward)은 상기 모바일 엣지 컴퓨팅 시스템에 포함되는 복수의 무인 항공 서버사이의 계산 부하 편차가 작을수록, 상기 복수의 무인 항공 서버 사이의 에너지 사용 편차가 작을수록, 상기 모바일 엣지 컴퓨팅 시스템의 처리량(throughput)이 클수록 큰 무인 항공 서버."}
{"patent_id": "10-2023-0032907", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 강화 학습에 사용되는 상태(state)는 상기 태스크의 사이즈, 상기 태스크의 지연 제약 시간(delay constraint time), 상기 무인 항공 서버의 계산 부하 상태, 상기 무인 항공 서버의 잔여 에너지, 상기 타겟 무인 항공 서버의 계산 부하 상태, 상기 타겟 무인 항공 서버의 잔여 에너지, 및 상기 무인 항공 서버와 상기 타겟 무인 항공 서버 사이의 신호-대-간섭-플러스-잡음비율(signal-to-interference-plus-noise ratio, SINR)을 포함하는 무인 항공 서버."}
{"patent_id": "10-2023-0032907", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항에 있어서,상기 타겟 무인 항공 서버는 상기 복수의 무인 항공 서버 중 상기 무인 항공 서버와 서비스 커버리지가 중첩되는 것들 중 가장 계산 부하가 낮은 것인 무인 항공 서버."}
{"patent_id": "10-2023-0032907", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1 항에 있어서,상기 프로세서는 로컬 모델을 이용하여 상기 강화 학습을 수행하고, 상기 로컬 모델은 인공 신경망을 포함하는 무인 항공 서버."}
{"patent_id": "10-2023-0032907", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1 항에 있어서,상기 프로세서는 로컬 모델을 이용하여 상기 강화 학습을 수행하고, 상기 통신부는 상기 로컬 모델을 연합 서버(federated server)로 전송하고, 상기 연합 서버로부터 글로벌 모델을 수신하고, 상기 프로세서는 상기 글로벌 모델을 이용하여 상기 로컬 모델을 업데이트하는 무인 항공 서버."}
{"patent_id": "10-2023-0032907", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5 항에 있어서,상기 글로벌 모델은 인공 신경망을 포함하는 무인 항공 서버.공개특허 10-2024-0139206-3-청구항 7 제1 항에 있어서,상기 프로세서는 심층 Q-네트워크(Deep Q-Network)를 이용하여 상기 강화 학습을 수행하는 무인 항공 서버."}
{"patent_id": "10-2023-0032907", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1 항에 있어서,상기 프로세서는 상기 타겟 무인 항공 서버로 전송할 상기 서브-태스크의 양을 결정하기 위해 연합 학습(federated learning)을 더 이용하는 무인 항공 서버."}
{"patent_id": "10-2023-0032907", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1 항에 있어서,상기 전자 장치는 차량이거나 차량에 구비되는 무인 항공 서버."}
{"patent_id": "10-2023-0032907", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1 항에 있어서,상기 모바일 엣지 컴퓨팅 시스템은 복수의 지상(ground) 서버를 더 포함하는 무인 항공 서버."}
{"patent_id": "10-2023-0032907", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "모바일 엣지 컴퓨팅 시스템에 포함되는 무인 항공 서버의 동작 방법에 있어서,전자 장치로부터 복수의 서브-태스크를 포함하는 태스크를 수신하는 단계;강화 학습을 이용하여 상기 모바일 엣지 컴퓨팅 시스템에 포함되는 타겟 무인 항공 서버로 전송할 서브-태스크의 양을 결정하는 단계; 및결정된 양의 서브-태스크를 상기 타겟 무인 항공 서버로 전송하는 단계를 포함하고,상기 강화 학습에 사용되는 보상은 상기 모바일 엣지 컴퓨팅 시스템에 포함되는 복수의 무인 항공 서버 사이의계산 부하 편차가 작을수록, 상기 복수의 무인 항공 서버 사이의 에너지 사용 편차가 작을수록, 상기 모바일 엣지 컴퓨팅 시스템의 처리량이 클수록 큰 무인 항공 서버의 동작 방법."}
{"patent_id": "10-2023-0032907", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11 항에 있어서,상기 강화 학습에 사용되는 상태(state)는 상기 태스크의 사이즈, 상기 태스크의 지연 제약 시간(delay constraint time), 상기 무인 항공 서버의 계산 부하 상태, 상기 무인 항공 서버의 잔여 에너지, 상기 타겟 무인 항공 서버의 계산 부하 상태, 상기 타겟 무인 항공 서버의 잔여 에너지, 및 상기 무인 항공 서버와 상기 타겟 무인 항공 서버 사이의 신호-대-간섭-플러스-잡음비율을 포함하는 무인 항공 서버의 동작 방법."}
{"patent_id": "10-2023-0032907", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11 항에 있어서,상기 타겟 무인 항공 서버는 상기 복수의 무인 항공 서버 중 상기 무인 항공 서버와 서비스 커버리지가 중첩되는 것들 중 가장 계산 부하가 낮은 것인 무인 항공 서버의 동작 방법."}
{"patent_id": "10-2023-0032907", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11 항에 있어서,상기 강화 학습에 로컬 모델이 사용되고, 공개특허 10-2024-0139206-4-상기 로컬 모델은 인공 신경망을 포함하는 무인 항공 서버의 동작 방법."}
{"patent_id": "10-2023-0032907", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11 항에 있어서,상기 강화 학습에 사용되는 로컬 모델을 연합 서버로 전송하는 단계;상기 연합 서버로부터 글로벌 모델을 수신하는 단계; 및 상기 글로벌 모델을 이용하여 상기 로컬 모델을 업데이트하는 단계를 더 포함하는 무인 항공 서버의 동작 방법."}
{"patent_id": "10-2023-0032907", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15 항에 있어서,상기 글로벌 모델은 인공 신경망을 포함하는 무인 항공 서버의 동작 방법."}
{"patent_id": "10-2023-0032907", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제11 항에 있어서,상기 강화 학습에는 심층 Q-네트워크가 이용되는 무인 항공 서버의 동작 방법."}
{"patent_id": "10-2023-0032907", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제11 항에 있어서,상기 타겟 무인 항공 서버로 전송할 상기 서브-태스크의 양을 결정하는 단계는 연합 학습을 더 이용하는 무인항공 서버의 동작 방법."}
{"patent_id": "10-2023-0032907", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제11 항에 있어서,상기 전자 장치는 차량이거나 차량에 구비되는 무인 항공 서버의 동작 방법."}
{"patent_id": "10-2023-0032907", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제11 항에 있어서,상기 모바일 엣지 컴퓨팅 시스템은 복수의 지상 서버를 더 포함하는 무인 항공 서버의 동작 방법."}
{"patent_id": "10-2023-0032907", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "모바일 엣지 컴퓨팅 시스템(MEC: mobile edge computing)에 포함되는 무인 항공 서버가 제공될 수 있다. 이 무 인 항공 서버는 저장부, 전자 장치로부터 복수의 서브-태스크(sub-task)를 포함하는 태스크(task)를 수신하고, 결정된 양의 서브-태스크를 상기 모바일 엣지 컴퓨팅 시스템에 포함되는 타겟 무인 항공 서버로 전송하는 통신부, 및 강화 학습을 이용하여 상기 타겟 무인 항공 서버로 전송할 상기 서브-태스크의 양을 결정하는 프로세 서를 포함하고, 상기 강화 학습에 사용되는 보상(reward)은 상기 모바일 엣지 컴퓨팅 시스템에 포함되는 복수의 무인 항공 서버 사이의 계산 부하 편차가 작을수록, 상기 복수의 무인 항공 서버 사이의 에너지 사용 편차가 작 을수록, 상기 모바일 엣지 컴퓨팅 시스템의 처리량(throughput)이 클수록 클 수 있다."}
{"patent_id": "10-2023-0032907", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 모바일 엣지 컴퓨팅 시스템에 포함되는 서버에 관한 것이다. 보다 구체적으로 본 발명은 모바일 엣지 컴퓨팅 시스템에 포함되는 무인 항공 서버에 관한 것이다."}
{"patent_id": "10-2023-0032907", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "오늘날 계산 및 통신 기술의 발전들과 함께 차량의 지능화가 이루어지고 있다. 따라서 차량들은 카메라들, 센서 들 등을 사용하여 예를 들어 가상현실, 증강현실, 스트리밍 서비스, 자율 주행 등 더욱 편리한 사용자 기능들을 제공할 수 있다. 그러나 이러한 새로운 기능들을 제공하기 위해 막대한 계산 자원들이 요구된다. 그러나 차량의 컴퓨팅 자원들은 이를 내부적으로 감당하기에 충분하지 않다. 이 문제를 해결하기 위해 그래픽 처리 유닛 (Graphic Processing Unit, GPU)과 같은 프로세서를 차량 내에 설치할 수 있으나, 이는 더 많은 전력과 냉각 성 능들을 필요로 하며, 이는 더 많은 에너지 소모를 야기하고, 차량 연비에 상당한 영향을 미친다. 모바일 엣지 컴퓨팅(mobile edge computing, MEC)은 이러한 한계들을 극복하기 위한 촉망받는 기술로서 등장했 다. 차량은 태스크(task)를 모바일 엣지 컴퓨팅 서버로 전송하고, 모바일 엣지 컴퓨팅 시스템은 계산 자원을 제공함으로써 차량에 고품질의 서비스를 제공할 수 있다. 또한, 전통적인 중앙화된 클라우드 컴퓨팅과 달리, 모바 일 엣지 컴퓨팅 시스템은 지리적으로 사용자에 가깝게 위치하므로 네트워크 지연을 감소시킬 수 있다는 이점을 가진다. 그러나 일반적인 모바일 엣지 컴퓨팅 서버들은 지상에 고정되어 있으며 제한된 처리 용량을 가진다. 따라서, 출 퇴근 시간과 같은 일시적인 교통 정체로 인한 태스크 처리 요청들의 급격한 증가에 유연하게 대응하지 못한다. 따라서, 저렴하고 자유롭게 이동가능한 무인 항공 서버를 추가적으로 사용함으로써 일시적으로 증가하는 태스크 요청들에 대응할 수 있는 모바일 엣지 서비스들이 고려되고 있다. 그러나 무인 항공 서버는 제한된 계산 용량 및 배터리 용량을 가진다. 따라서 무인 항공 서버의 한정된 계산 용량 및 배터리 용량을 효율적으로 사용하면서 모바일 엣지 컴퓨팅 시스템의 서비스 품질을 증가시키는 것이 필요하다."}
{"patent_id": "10-2023-0032907", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 과제는 모바일 엣지 컴퓨팅 시스템에 포함되며 효율적으로 서브-태스크를 타겟 무인 항공 서버로 분배하는 무인 항공 서버 및 그 동작 방법을 제공하는 것이다."}
{"patent_id": "10-2023-0032907", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시예들에 따르면, 모바일 엣지 컴퓨팅(MEC: mobile edge computing) 시스템에 포함되는 무인 항공 서버는 저장부, 전자 장치로부터 복수의 서브-태스크(sub-task)를 포함하는 태스크(task)를 수신하고, 결정된 양의 서브-태스크를 상기 모바일 엣지 컴퓨팅 시스템에 포함되는 타겟 무인 항공 서버로 전송하는 통신부, 및 강화 학습을 이용하여 상기 타겟 무인 항공 서버로 전송할 상기 서브-태스크의 양을 결정하는 프로세서를 포함 하고, 상기 강화 학습에 사용되는 보상(reward)은 상기 모바일 엣지 컴퓨팅 시스템에 포함되는 복수의 무인 항 공 서버 사이의 계산 부하 편차가 작을수록, 상기 복수의 무인 항공 서버 사이의 에너지 사용 편차가 작을수록, 상기 모바일 엣지 컴퓨팅 시스템의 처리량(throughput)이 클수록 클 수 있다. 본 발명의 실시예들에 따르면, 모바일 엣지 컴퓨팅 시스템에 포함되는 무인 항공 서버의 동작 방법은 전자 장치 로부터 복수의 서브-태스크를 포함하는 태스크를 수신하는 단계, 강화 학습을 이용하여 상기 모바일 엣지 컴퓨 팅 시스템에 포함되는 타겟 무인 항공 서버로 전송할 서브-태스크의 양을 결정하는 단계, 및 결정된 양의 서브- 태스크를 상기 타겟 무인 항공 서버로 전송하는 단계를 포함하고, 상기 강화 학습에 사용되는 보상은 상기 모바 일 엣지 컴퓨팅 시스템에 포함되는 복수의 무인 항공 서버 사이의 계산 부하 편차가 작을수록, 상기 복수의 무 인 항공 서버 사이의 에너지 사용 편차가 작을수록, 상기 모바일 엣지 컴퓨팅 시스템의 처리량이 클수록 클 수 있다."}
{"patent_id": "10-2023-0032907", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예들에 따르면, 강화 학습을 이용하여 타겟 무인 항공 서버로 전송할 서브-태스크의 양을 결정하 고, 강화 학습에 사용되는 보상은 복수의 무인 항공 서버 사이의 계산 부하 편차가 작을수록, 복수의 무인 항공 서버 사이의 에너지 사용 편차가 작을수록, 모바일 엣지 컴퓨팅 시스템의 처리량이 클수록 크게 함으로써 무인 항공 서버의 한정된 계산 용량 및 배터리 용량을 효율적으로 사용하면서 모바일 엣지 컴퓨팅 시스템의 서비스 품질을 증가시킬 수 있다. 예를 들어, 본 발명의 실시예들에 따르면, 모바일 엣지 컴퓨팅 시스템의 지연 제약 만족률(delay constraint satisfaction rate)을 증가시킬 수 있고, 복수의 무인항공기의 계산 부하 편차 및 잔 여 에너지 편차를 감소시킬 수 있다."}
{"patent_id": "10-2023-0032907", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 첨부된 도면을 참조하여 본 발명의 바람직한 실시예에 대한 동작 원리를 상세히 설명한다. 또한, 발명에 대한 실시예를 설명함에 있어 관련된 공지 기능 또는 구성에 대한 구체적인 설명이 본 개시의 요지를 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명을 생략할 것이다. 그리고 하기에서 사용되는 용어들은 본 발명에서의 기능을 고려하여 정의된 용어들로써, 이는 사용자, 운용자의 의도 또는 관례 등에 따라 달라질 수 있다. 그러므 로 사용된 용어들의 정의는 본 명세서 전반에 걸친 내용 및 이에 상응한 기능을 토대로 해석되어야 할 것이다. 도 1은 본 발명의 일 실시예에 따른 모바일 엣지 컴퓨팅 시스템의 개념도이다. 도 1을 참조하면, 모바일 엣지 컴퓨팅 시스템은 복수의 무인 항공 서버(100A 내지 100C)를 포함할 수 있다. 복수의 무인 항공 서버는 무선 네트워크를 통해 서로 통신할 수 있다. 복수의 무인 항공 서버(100A 내지 100C)는 전자 장치(VC)와 통신할 수 있으며 전자 장치(VC)를 위한 계산 서비스를 제공할 수 있다. 전자 장치 (VC)는 이동 가능할 수 있다. 예를 들어 전자 장치(VC)는 차량이거나 차량에 구비될 수 있다. 예를 들어 전자 장치(VC)는 복수의 무인 항공 서버(100A 내지 100C) 중 하나, 예를 들어, 신호 전력이 가장 강 한 제1 무인 항공 서버(100A)로 태스크(task)를 전송할 수 있다. 태스크란 정보 처리의 단위를 의미한다. 태스 크는 복수의 서브-태스크(sub-task)를 포함할 수 있다. 제1 무인 항공 서버(100A)는 태스크를 처리하여 처리 결 과를 전자 장치(VC)로 전송할 수 있다. 그러나 복수의 무인 항공 서버(100A 내지 100C)의 한정된 계산 용량 및 에너지 용량을 효율적으로 사용하기 위 하여 제1 무인 항공 서버(100A)는 제2 무인 항공 서버(100B)(이하에서 타겟 무인 항공 서버로 지칭됨)로 전송할 서브-태스크의 양을 결정하고 결정된 양의 서브-태스크를 타겟 무인 항공 서버(100B)로 전송할 수 있다. 타겟 무인 항공 서버(100B)는 수신한 서브-태스크를 처리할 수 있고, 제1 무인 항공 서버(100A)는 나머지 서브-태스 크를 처리할 수 있다. 일부 실시예에서, 타겟 무인 항공 서버(100B)는 복수의 무인 항공 서버(100B, 100C) 중 제1 무인 항공 서버(100A)와 서비스 커버리지가 중첩되는 것들 중 가장 계산 부하가 낮은 것일 수 있다. 복수의 무인 항공 서버(100A 내지 100C)의 한정된 계산 용량 및 에너지 용량을 효율적으로 사용하기 위하여 타 겟 무인 항공 서버(100B)로 전송할 서브-태스크의 양을 적절하게 결정하는 것이 중요하다. 이러한 결정을 위해 강화 학습이 사용될 수 있다. 강화 학습에 대한 상세한 설명은 나중에 도 4를 참조하여 보다 상세히 설명된다.일부 실시예에서, 강화 학습 방법으로서 심층 Q-네트워크(Deep Q-Network, DQN)가 사용될 수 있다. 일부 실시예에서, 각각의 무인 항공 서버(100A 내지 100C)는 각각의 로컬 모델을 이용하여 강화 학습을 수행할 수 있다. 일부 실시예에서, 로컬 모델은 인공 신경망을 포함할 수 있다. 인공 신경망은 예를 들어 완전 연결 신 경망, 순환 신경망, 및 컨벌루션 신경망 중 적어도 하나를 포함할 수 있다. 일부 실시예에서, 모바일 엣지 컴퓨팅 시스템은 연합 서버(federated server)를 더 포함할 수 있다. 연합 서버는 복수의 무인 항공 서버(100A 내지 100C)와 통신할 수 있다. 연합 서버는 연합 학습 (federated learning, FL)에 사용될 수 있다. 예를 들어, 강화 학습을 이용하여 각각의 무인 항공 서버(100A 내 지 100C)는 각각의 로컬 모델을 업데이트할 수 있다. 각각의 무인 항공 서버(100A 내지 100C)는 각각의 로컬 모 델을 연합 서버로 전송할 수 있다. 연합 서버는 복수의 로컬 모델을 이용하여 글로벌 모델을 업데이 트 할 수 있다. 일부 실시예에서, 글로벌 모델은 인공 신경망을 포함할 수 있다. 인공 신경망은 예를 들어 완전 연결 신경망, 순환 신경망, 및 컨벌루션 신경망 중 적어도 하나를 포함할 수 있다. 각각의 무인 항공 서버(100A 내지 100C)는 글로벌 모델을 수신하여 글로벌 모델을 이용하여 각각의 로컬 모델을 업데이트할 수 있다. 일부 실시예에서, 모바일 엣지 컴퓨팅 시스템은 복수의 지상 서버를 더 포함할 수 있다. 복수의 지상 서버는 전자 장치(VC)와 통신할 수 있으며 전자 장치(VC)를 위한 계산 서비스를 제공할 수 있다. 일부 실 시예에서, 복수의 지상 서버는 모바일 엣지 컴퓨팅 시스템의 한정된 계산 자원을 효율적으로 사용하기 위해 서로 통신할 수 있다. 일부 실시예에서, 복수의 지상 서버는 모바일 엣지 컴퓨팅 시스템의 한정 된 계산 자원을 효율적으로 사용하기 위해 복수의 무인 항공 서버(100A 내지 100C)와 통신할 수 있다. 도 2는 본 발명의 일 실시예에 따른 무인 항공 서버의 블록도이다. 도 2를 참조하면, 무인 항공 서버는 저장부, 프로세서, 및 통신부를 포함할 수 있다. 저장부는 프로세서에 연결될 수 있다. 저장부는 프로세서에 의해 실행될 때, 프로세서 로 하여금 무인 항공 서버의 동작을 수행하도록 하는 컴퓨터 명령을 저장할 수 있다. 일부 실시예에 서 저장부는 강화 학습에 사용되는 로컬 모델을 저장할 수 있다. 프로세서는 무인 항공 서버의 동작을 제어할 수 있다. 특히, 프로세서는 강화 학습을 이용하여 타겟 무인 항공 서버로 전송할 서브-태스크의 양을 결정할 수 있다. 일부 실시예에서, 프로세서는 심층 Q- 네트워크를 이용하여 강화 학습을 수행할 수 있다. 일부 실시예에서, 프로세서는 로컬 모델을 이용하여 강 화 학습을 수행할 수 있다. 일부 실시예에서, 프로세서는 타겟 무인 항공 서버로 전송할 서브-태스크의 양 을 결정하기 위해 연합 학습을 더 이용할 수 있다. 일부 실시예에서, 프로세서는 연합 학습 시 글로벌 모 델을 이용하여 로컬 모델을 업데이트할 수 있다. 또한, 프로세서는 무인 항공 서버의 비행을 제어할 수 있 다. 통신부는 다른 무인 항공 서버와 통신할 수 있다. 일부 실시예에서, 추가적으로 통신부는 연합 서버 와 통신할 수 있다. 일부 실시예에서, 추가적으로 통신부는 복수의 지상 서버와 통신할 수 있다. 통신부 는 전자 장치로부터 태스크를 수신하고, 결정된 양의 서브-태스크를 타겟 무인 항공 서버로 전송할 수 있 다. 연합 학습을 실시하는 일부 실시예에서, 통신부는 로컬 모델을 연합 서버로 전송하고, 연합 서버로부 터 글로벌 모델을 수신할 수 있다. 도 3은 본 발명의 일 실시예에 따른 무인 항공 서버의 세부 블록도이다. 도 3을 참조하면, 저장부는 휘발성 메모리 및 비휘발성 메모리 중 적어도 하나를 포함할 수 있 다. 휘발성 메모리는 SRAM(Static Random Access Memory), DRAM(Dynamic Random Access Memory), MRAM(Magnetoresistive Random Access Memory), PRAM(Phase change Random Access Memory), 및 RRAM(Resistive Random Access Memory) 중 적어도 하나를 포함할 수 있다. 비휘발성 메모리는 ROM(Read Only Memory), 하드디스크, 및 플래쉬 메모리 중 적어도 하나를 포함할 수 있다. 휘발성 메모리 및 비휘발 성 메모리 각각은 내장 메모리 및 내장 메모리 중 적어도 하나를 포함할 수 있다. 제어부는 CPU(Central Processing Unit), GPU(Graphic Processing Unit), NPU(Neural Processing Unit), 및 TPU(Tensor Processing Unit) 중 적어도 하나를 포함할 수 있다. 통신부는 블루투스 칩, 와이파이 칩, 위성통신 칩 및 이동통신 칩 중 적어도 하나를 포함할 수 있다.도 3에 도시되지 않았으나, 무인 항공 서버는 배터리를 더 포함할 수 있다. 배터리는 무인 항공 서버(10 0)에 전력을 제공할 수 있다. 도 3에 도시되지 않았으나, 무인 항공 서버는 무인 항공 서버를 구동하기 위한 구동부를 더 포함할 수 있다. 구동부는 예를 들어 변속기, 모터 및 프로펠러를 포함할 수 있다. 도 3에 도시되지 않았으나, 무인 항공 서버는 센싱부를 더 포함할 수 있다. 센싱부는 예를 들어 자이로 센 서, 가속도 센서, 관성 측정 장치(Inertial Measurement Unit, IMU), 지자기 센서, 기압 센서, 및 이미지 센서 중 적어도 하나를 포함할 수 있다. 도 4는 강화 학습의 개념도이다. 도 4를 참조하면, 강화 학습에는 에이전트(ag)와 환경(env)이 필요하다. 예를 들어 본 발명에서 에이전트(ag)는 무인 항공 서버이고, 환경은 모바일 엣지 컴퓨팅 시스템일 수 있다. 에이전트(ag)는 현재 상태(state)에 기초하 여 정책(policy)에 따라 특정 행동(action)을 한다. 그러한 행동(action)에 따라 환경(env)의 상태가 바뀐다. 또한 환경(env)은 에이전트(ag)의 행동(action)이 바람직한 정도인 보상(reward)을 에이전트(ag)에 전달한다. 에이전트(ag)는 보상(reward)에 따라 정책을 업데이트한다. 에이전트(ag)는 다시 새로운 상태(state)와 업데이 트된 정책에 따라 행동(action)을 취하고, 그에 대한 보상(reward)을 받아 정책을 업데이트한다. 강화학습의 목 적은 일련의 보상(reward)들의 합이 최대가 되게 하는 정책을 찾는 것이다. 본 발명을 수식적으로 설명하면 다음과 같다. 복수의 전자 장치 N을 위한 모바일 엣지 컴퓨팅 시스템은 복수의 무인 항공 서버 M을 포함한다. 전자 장치 n∈N 는 가장 강한 신호 전력을 가지는 무인 항공 서버 m∈M로 태스크를 전송한다. 각각의 태스크는 {fn,in,Tnmax}로 정의될 수 있다. fn은 태스크를 처리하기 위해 요구되는 중앙 처리 장치(CPU) 사이클이고, in은 태스크 크기이고, Tnmax는 태스크의 지연 제약 시간이다. 태스크는 지연 제약 시간 내에 완료되어야 한다. 시점 t에서 무인 항공 서버 m의 계산 부하 상태 βmt는 다음과 같다. 수학식 1"}
{"patent_id": "10-2023-0032907", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기서 Lmt는 t 시점에서 무인 항공 서버 m의 태스크 큐(queue) 길이이고, Lmmax는 무인 항공 서버 m의 최대 큐 길이이다. 따라서, t 시점에서 모바일 엣지 컴퓨팅 시스템에 포함되는 모든 무인 항공 서버의 계산 부하 평균 LAt은 다음과 같다. 수학식 2"}
{"patent_id": "10-2023-0032907", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "여기서 M은 무인 항공 서버의 수이고, βmt는 시점 t에서 무인 항공 서버 m의 계산 부하 상태이다. 이를 이용하여, t 시점에서 복수의 무인 항공 서버의 계산 부하 편차 Loaddevt는 다음과 같이 정의될 수 있다. 수학식 3"}
{"patent_id": "10-2023-0032907", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "여기서 M은 무인 항공 서버의 수이고, βmt는 시점 t에서 무인 항공 서버 m의 계산 부하 상태이고, LAt는 t 시점 에서 복수의 무인 항공 서버의 계산 부하 편차이다. 또한 시점 t에서 전자 장치 n으로부터 무인 항공 서버 m으로 전송되는 태스크의 데이터 전송 속도 Rn,m(t)는 다 음과 같이 계산될 수 있다. 수학식 4"}
{"patent_id": "10-2023-0032907", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "여기서 Bn,m은 전자 장치 n과 무인 항공 서버 m 사이의 채널 대역폭이고, σ2은 전자 장치와 무인 항공 서버 사이 의 잡음 전력이고, P는 전자 장치의 전송 전력이고, Hn,m은 전자 장치 n과 무인 항공 서버 m 사이의 채널 게인 (gain)이다. 따라서, 시점 t에서 전자 장치 n으로부터 무인 항공 서버 m으로의 태스크의 전송으로 인한 전송 지 연 Tntrans(t)은 다음 식과 같다. 수학식 5"}
{"patent_id": "10-2023-0032907", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "여기서 Rn,m(t)는 시점 t에서 전자 장치 n으로부터 무인 항공 서버 m으로 전송되는 태스크의 데이터 전송 속도이 고, in은 태스크 크기이다. 태스크가 전자 장치 n으로부터 무인 항공 서버 m으로 전송되는 경우, 태스크는 k개의 서브-태스크들로 분할될 수 있다. 이들 서브-태스크들 중 무인 항공 서버 m에서 수행되는 서브-태스크들의 수는 km으로 표시된다. 무인 항공 서버 m이 서브-태스크들을 계산하기 위해 필요한 시간 Tn,mcomp(t)은 다음과 같이 정의된다. 수학식 6"}
{"patent_id": "10-2023-0032907", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "여기서 Fn,m은 무인 항공 서버 m에 의해 전자 장치 n에 할당된 계산 자원이고, fn은 태스크를 처리하기 위해 요구 되는 중앙 처리 장치 사이클이다. 무인 항공 서버 m으로부터 무인 항공 서버 m'으로 전송된 서브-태스크들의 수는 kmigmm'으로 표현된다. 무인 항공 서버 m으로부터 무인 항공 서버 m'으로 서브-태스크들을 전송하는데 필요한 시간 Tm,m'mig(t)은 다음과 같다. 수학식 7"}
{"patent_id": "10-2023-0032907", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "여기서 in은 태스크 크기이고, Rm,m'은 시점 t에서 무인 항공 서버 m으로부터 타겟 무인 항공 서버 m'로 전송되는 태스크의 데이터 전송 속도이다. 다음으로, 무인 항공 서버의 에너지 소모 모델을 살펴본다. 호버링(hovering) 에너지, 계산에 필요한 에너지, 및 서브-태스크 전송에 필요한 통신 에너지를 포함하는 3가지 측면에서 무인 항공 서버의 에너지 소모를 고려할 수 있다. 시점 t에서 무인 항공 서버 m의 호버링 에너지 Eflyt,m는 다음과 같이 계산될 수 있다. 수학식 8"}
{"patent_id": "10-2023-0032907", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "여기서 δ은 중력 가속도이고, τ는 시간 스텝의 길이이고, Hmt는 시점 t에서 무인 항공 서버 m의 높이이다. 시점 t에서 무인 항공 서버 m이 서브-태스크들을 계산하는데 필요한 에너지 Ecomt,m은 다음과 같다. 수학식 9"}
{"patent_id": "10-2023-0032907", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "여기서 l은 무인 항공 서버의 중앙 처리 장치의 유효 스위칭 용량을 나타내고, k는 하나의 태스크 내에 포함되 는 서브-태스크의 수이고, km은 무인 항공 서버 m에 의해 계산되는 서브-태스크의 수이고, Fn,m은 무인 항공 서버 m에 의해 전자 장치 n에 할당된 계산 자원이고, Tn,mcom(t)은 무인 항공 서버 m이 서브-태스크들을 계산하기 위해 필요한 시간이다. 마지막으로, 무인 항공 서버 m이 서브-태스크들을 다른 무인 항공 서버 m'으로 전송하는 경우 필요한 통신 에너 지 Emigt,m,m'는 주로 무인 항공 서버의 전송 전력에 의해 결정되며 다음과 같이 계산될 수 있다. 수학식 10"}
{"patent_id": "10-2023-0032907", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 11, "content": "여기서 P는 전자 장치의 전송 전력이고, Tm,m'mig(t)은 무인 항공 서버 m으로부터 무인 항공 서버 m'으로 서브-태 스크들을 전송하는데 필요한 시간이다.따라서, t 시점에서 사용된 무인 항공 서버 m의 총 에너지 소모 Etotalt,m는 다음과 같다. 수학식 11"}
{"patent_id": "10-2023-0032907", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 12, "content": "여기서 φ1, φ2, φ3는 가중치들이며, φ1+φ2+φ3=1이다. 따라서, 복수의 무인 항공 서버들의 에너지 편차 Edevt는 다음과 같이 계산된다. 수학식 12"}
{"patent_id": "10-2023-0032907", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 13, "content": "여기서 Eavgt는 t 시점에서 무인 항공 서버의 평균 에너지 사용을 의미한다. 강화 학습에 사용되는 보상은 복수의 무인 항공 서버의 계산 부하 편차를 최소화하고, 복수의 무인 항공 서버의 에너지 사용 편차를 최소화하고, 엣지 컴퓨팅 시스템의 처리량(throughput)을 최대화하도록 설계될 수 있다. 여 기서 처리량은 지연 제약 시간 안에 완료된 태스크들의 수를 말한다. 따라서 복수의 무인 항공 서버에 계산 부하를 골고루 분배함으로써 주어진 지연 제약 시간 안에 태스크를 완료 할 수 있다. 또한, 복수의 무인 항공 서버 사이의 에너지 사용 편차를 최소화함으로써 특정 무인 항공 서버가 먼저 에너지를 다 써서 서비스 지역에 제한이 발생하는 것을 방지할 수 있다. 따라서 강화 학습에 사용되는 보상은 복수의 무인 항공 서버 사이의 계산 부하 편차가 작을수록, 복수의 무인 항공 서버 사이의 에너지 편차가 작을수록, 모바일 엣지 컴퓨팅 시스템의 처리량이 클수록 크게 설계될 수 있다. 예를 들어, 강화 학습에 사용되는 보상 rmt는 다음과 같이 정의될 수 있다. 수학식 13"}
{"patent_id": "10-2023-0032907", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 14, "content": "여기서 Loaddevt,nor 및 Edevt,nor는 복수의 무인 항공 서버의 계산 부하 편차 Loaddevt 및 복수의 무인 항공 서버들의 에너지 편차 Edevt을 0과 1 사이의 값들로 노말라이징(normalizing)함으로써 얻어진 값들을 나타내고, α는 0보 다 크고 1보다 작은 가중치이다. 강화 학습에 사용되는 상태smt는 다음과 같이 정의될 수 있다. 수학식 14"}
{"patent_id": "10-2023-0032907", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 15, "content": "여기서 in은 태스크 크기이고, Tnmax는 지연 제약 시간이고, βmt는 무인 항공 서버 m의 계산 부하 상태이고, Emt는 무인 항공 서버 m의 잔여 에너지이고, βm't는 타겟 무인 항공 서버 m'의 계산 부하 상태이고, Em't는 타겟 무 인 항공 서버 m'의 잔여 에너지이고, γm,m't는 무인 항공 서버 m과 타겟 무인 항공 서버 m' 사이의 신호-대-간섭 -플러스-잡음 비율(signal-to-interference-plus-noise ratio, SINR)이다. 강화 학습에 사용되는 행동 amt은 다음과 같이 정의될 수 있다. 수학식 15"}
{"patent_id": "10-2023-0032907", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 16, "content": "여기서 km+kmigm,m'=k이다. 여기서 km은 무인 항공 서버 m에 의해 처리되는 서브-태스크의 수이고, kmigm,m'은 무인 항공 서버 m으로부터 타겟 무인 항공 서버 m'으로 전송되어 타겟 무인 항공 서버 m'에 의해 처리되는 서브-태스 크의 수이고, k는 하나의 태스크 내에 포함되는 서브-태스크의 수이다. [시뮬레이션 결과] 시뮬레이션은 Python 3.9.7 및 Pytorch 1.11.0을 사용하여 구현되었으며, 전자 장치들은 dataset of mobility traces in San Francisco, USA를 사용하여 구현되었다. 실험 공간이 2.5km X 2.5km임을 가정하고, 9개의 무인 항공 서버들이 이 공간 내에 배치되었다. 무인 항공 서버들은 1000m의 고도에서 비행하는 것으로 가정되었으며, 500m 반경의 서비스 범위를 제공하는 것으로 가정되었다. 각각의 태스크의 데이터 사이즈는 2 내지 6Mbits 사이 에서 무작위적으로 선택되었으며, 각각의 태스크의 지연 제약 시간은 0.5초 내지 2초로 설정되었다. 시간 스텝"}
{"patent_id": "10-2023-0032907", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 17, "content": "의 길이는 60초로 설정되었다. 시뮬레이션에 사용된 파라미터들이 다음에 요약된다. 표 1 파라미터 값 무인 항공 서버들의 수 9 채널 대역폭(B) 1MHZ 백그라운드 소음(σ2) 10-9W 입력 데이터 크기 2-6Mbits 지연 제약 시간 0.5-2s 전자 장치의 최대 전송 전력 2W 시간 스텝의 길이(τ) 60s 본 발명에 따르면, DQN을 이용한 강화 학습과 연합 학습을 수행하는 연합-DQN(FL-DQN) 학습 방법이 제안된다. 본 발명에서 제안된 연합-DQN(FL-DQN) 방법의 성능을 평가하기 위해, 이를 다중-에이전트-DQN(MA-DQN), 단일-에 이전트-DQN(SA-DQN), 및 Q-learning과 비교하였다. 또한, 계산 부하 편차와 에너지 편차를 모두 고려하는 FL- DQN 방법을 연합-DQN을 사용하되 계산 부하 편차만을 고려한 FL-DQN-L 방법과 연합-DQN을 사용하되 에너지 편차 만을 고려하는 FL-DQN-E과 비교하였다.도 5는 다양한 학습 방법에 대한 전자 장치 수에 따른 지연 제약 만족률 시뮬레이션 결과를 나타내는 그래프이다. 도 6은 다양한 학습 방법에 대한 전자 장치 수에 따른 복수의 무인 항 공 서버 사이의 계산 부하 편차 시뮬레이션 결과를 나타내는 그래프이다. 도 7은 다양한 학습 방법에 대한 전자 장치 수에 따른 복수의 무인 항공 서버 사이의 잔여 에너지 편차 시뮬레이션 결과를 나타내는 그래프이다. 도 5 내지 도 7을 참조하면, 전자 장치의 이동 속도는 5m/s로 고정하고, 하나의 태스크에 포함되는 서브-태스크 들의 수는 10으로 고정하고, 전자 장치들의 수를 변화시켜가며 시뮬레이션을 수행하였다. 전자 장치들의 수가 증가함에 따라, 발생하는 태스크들의 수가 증가한다. 도 5에 도시된 바와 같이, 본 발명에 따른 FL-DQN 방법이 가장 높은 지연 제약 만족률을 가지며, MA-DQN보다 약 21-22%, SA-DQN보다 대략 11-12% 나았다. 이는 MA-DQN의 경우 각각의 무인 항공 서버들이 학습한 모델들을 공유 하지 않기 때문일 수 있다. 또한 SA-DQN의 경우 중앙 에이전트가 모든 무인 항공 서버들의 상태 정보를 수집해 야하고 각각의 무인 항공 서버의 행동을 결정해야 하므로 네트워크 트래픽 및 저장 비용이 증가하고, 따라서 최 적의 솔루션을 찾기 어렵기 때문일 수 있다. 또한, DQN-기반 방법들은 Q-learning 방법보다 높은 성능을보였다. 이는 DQN이 Q-learning의 표 크기가 너무 커지는 문제와 샘플 데이터의 상관 문제를 해결함으로써 효율 적인 학습을 가능하게 하기 때문일 수 있다. 도 6 및 도 7에 도시된 바와 같이, FL-DQN을 FL-DQN-L 및 FL-DQN-E과 비교함으로써 계산 부하 편차와 에너지 편 차를 모두 고려함으로써 가장 효과적인 서비스를 제공할 수 있다는 것을 확인할 수 있다. 도 8은 다양한 학습 방법에 대한 전자 장치 이동 속도에 따른 지연 제약 만족률 시뮬레이션 결과를 나타내는 그 래프이다. 도 9는 다양한 학습 방법에 대한 전자 장치 이동 속도에 따른 복수의 무인 항공 서버 사이의 계산 부 하 편차 시뮬레이션 결과를 나타내는 그래프이다. 도 10은 다양한 학습 방법에 대한 전자 장치 이동 속도에 따 른 복수의 무인 항공 서버 사이의 잔여 에너지 편차 시뮬레이션 결과를 나타내는 그래프이다. 도 8 내지 도 10을 참조하면, 시뮬레이션 환경에 사용된 전자 장치들의 수는 100으로 설정되고, 하나의 태스크 내에 포함되는 서브-태스크의 수는 10으로 고정되는 경우 전자 장치들의 이동 속도를 변화시켜가면서 시뮬레이 션을 수행하였다. 전자 장치의 속도가 증가함에 따라, 환경은 보다 역동적이게 된다. 도 8에 도시된 바와 같이, 본 발명에 따른 FL-DQN 방법이 지연 제약 만족률 측면에서 가장 좋은 성능을 나타냈 으며 SA-DQN보다 약 26-27% 향상되고 MA-DQN보다 약 26-27% 향상된 성능을 나타냈다. 본 발명에 따른 FL-DQN 방법은 전자 장치의 속도가 증가하더라도 지연 제약 만족률의 큰 차이가 없으므로 비교적 안정적인 서비스를 제 공할 수 있다. 이는 연합 학습을 사용하는 FL-DQN 방법의 경우 국부적(local) 최적 모델만을 학습하는 DQN 방법 과 달리 전역적(global) 최적 모델을 학습할 수 있기 때문일 수 있다. 또한 SA-DQN이 Q-learning보다 약 11- 12% 더 나은 성능을 보였는데, 이는 전자 장치의 이동이 역동적이고 상태 공간이 클 때 DQN이 Q-learning보다 적합하다는 것을 보여준다. 도 9 및 도 10에 도시된 바와 같이, 본 발명에 따른 FL-DQN 방법이 가장 낮은 에너지 편차 및 계산 부하 편차를 나타냈으며 따라서 FL-DQN 방법을 사용함으로써 다른 방법들에 비해 에너지를 균등하게 사용하는 한편 계산 부 하가 균형적으로 분배될 수 있다. 도 11은 다양한 학습 방법에 대한 하나의 태스크 내의 서브-태스크 수에 따른 지연 제약 만족률 시뮬레이션 결 과를 나타내는 그래프이다. 도 12는 다양한 학습 방법에 대한 하나의 태스크 내의 서브-태스크 수에 따른 복수 의 무인 항공 서버 사이의 계산 부하 편차 시뮬레이션 결과를 나타내는 그래프이다. 도 13은 다양한 학습 방법 에 대한 하나의 태스크 내의 서브-태스크의 수에 따른 복수의 무인 항공 서버 사이의 잔여 에너지 편차 시뮬레 이션 결과를 나타내는 그래프이다. 도 11 내지 도 13을 참조하면, 전자 장치의 수는 100으로 고정되었고, 전 장 장치의 평균 속도는 5m/s로 설정되 었다. 도 11에 도시된 바와 같이, 하나의 태스크 내에 포함되는 서브-태스크의 수가 변화함에 따라 본 발명에 따른 FL-DQN 방법이 가장 높은 지연 제약 만족률을 나타냈다. 그러나, 대부분의 다른 방법들은 하나의 태스크 내에 포함되는 서브-태스크들의 수가 증가함에 따라 지연 제약 만족률이 증가하다 감소했다. 하나의 태스크 내 에 포함되는 서브-태스크들의 수가 증가함에 따라 서브-태스크의 크기가 감소하나, 네트워크를 통해 이동하는 데이터의 양은 증가하여 전체 네트워크 트래픽이 증가하기 때문일 수 있다. 도 12 및 도 13에 도시된 바와 같이, 본 발명에 따른 FL-DQN 방법은 다른 방법들에 비해 복수의 무인 항공 서버 들에 계산 부하를 고르게 분배하였고 에너지를 균등하게 사용하였다. 이는 FL-DQN 방법이 연합 학습을 통해 최 적 전역 모델을 학습할 수 있기 때문일 수 있다. 도 14는 본 발명의 일 실시예에 따른 무인 항공 서버의 동작 방법의 흐름도이다. 도 14를 참조하면, 전자 장치로부터 태스크가 수신될 수 있다(S410). 또한 강화 학습을 이용하여 타겟 무인 항 공 서버로 전송할 서브-태스크의 양이 결정될 수 있다(S420). 또한, 결정된 양의 서브-태스크가 타겟 무인 항공 서버로 전송될 수 있다(S430). 강화 학습에 사용되는 보상은 복수의 무인 항공 서버 사이의 계산 부하 편차가 작을수록, 복수의 무인 항공 서 버 사이의 에너지 사용 편차가 작을수록, 모바일 엣지 컴퓨팅 시스템의 처리량이 클수록 클 수 있다. 일부 실시 예에서, 강화 학습에 사용되는 상태는 태스크의 사이즈, 태스크의 지연 제약 시간, 무인 항공 서버의 계산 부하 상태, 무인 항공 서버의 잔여 에너지, 타겟 무인 항공 서버의 계산 부하 상태, 타겟 무인 항공 서버의 잔여 에 너지, 및 무인 항공 서버와 타겟 무인 항공 서버 사이의 신호-대-간섭-플러스-잡음 비율을 포함할 수 있다. 일 부 실시예에서, 강화 학습에는 로컬 모델이 사용될 수 있으며, 로컬 모델은 인공 신경망을 포함할 수 있다. 일 부 실시예에서, 강화 학습에는 심층 Q-네트워크가 이용될 수 있다.일부 실시예에서, 타겟 무인 항공 서버는 복수의 나머지 무인 항공 서버 중 무인 항공 서버와 서비스 커버리지 가 중첩되는 것들 중 가장 계산 부하가 낮은 것일 수 있다. 일부 실시예에서, 타겟 무인 항공 서버로 전송할 서브-태스크의 양을 결정하는 단계는 연합 학습을 더 이용할 수 있다. 예를 들어, 강화 학습에 사용되는 로컬 모델이 연합 서버로 전송될 수 있다(S440). 또한, 연합 서버로 부터 글로벌 모델이 수신될 수 있다(S450). 글로벌 모델을 이용하여 로컬 모델이 업데이트될 수 있다(S640). 일 부 실시예에서, 글로벌 모델은 인공 신경망을 포함할 수 있다. 일부 실시예에서, 전자 장치는 차량이거나 차량에 구비될 수 있다. 일부 실시예에서, 모바일 엣지 컴퓨팅 시스템은 복수의 지상 서버를 더 포함할 수 있다. 도 15는 본 발명의 일 실시예에 따른 모바일 엣지 컴퓨팅 시스템의 동작 방법의 흐름도이다. 도 15를 참조하면, 전자 장치(VC)는 태스크를 무인 항공 서버(100A)로 전송할 수 있다. 무인 항공 서버(100A)는 타겟 무인 항공 서버(100B)로 전송할 서브-태스크의 양을 결정하고(S520), 결정된 양의 서브-태스크를 타겟 무 인 항공 서버(100B)로 전송할 수 있다(S530). 무인 항공 서버(100A)는 나머지 서브-태스크를 처리할 수 있고, 무인 항공 서버(100B)는 전송 받은 서브-태스크를 처리할 수 있다. 무인 항공 서버(100A)는 제1 로컬 모델을 업 데이트할 수 있다(S540). 타겟 무인 항공 서버(100B)는 제2 로컬 모델을 업데이트할 수 있다. 일부 실시예에서, 무인 항공 서버(100A)는 제1 로컬 모델을 연합 서버로 전송할 수 있고(S551), 타겟 무인 항공 서버(100B)는 제2 로컬 모델을 연합 서버로 전송할 수 있다(S552), 연합 서버는 제1 및 제2 로 컬 모델을 이용해 글로벌 모델을 업데이트할 수 있다(S560). 연합 서버는 글로벌 모델을 무인 항공 서버 (100A) 및 타겟 무인 항공 서버(100B)로 전송할 수 있다(S571 및 S572). 무인 항공 서버(100A)는 글로벌 모델을 이용하여 제1 로컬 모델을 업데이트할 수 있고(S581), 타겟 무인 항공 서버(100B)는 글로벌 모델을 이용하여 제 2 로컬 모델을 업데이트할 수 있다(S582). 이상으로, 본 발명의 실시예들이 도시되고 설명되었지만, 당업자는 첨부된 청구항들 및 그에 동등한 것들에 의 해 정의되는 바와 같은 본 실시예의 사상 및 범위를 벗어나지 않고 형태 및 세부 사항들에 있어 다양한 변경이 이루어질 수 있음을 이해할 것이다."}
{"patent_id": "10-2023-0032907", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 모바일 엣지 컴퓨팅 시스템의 개념도이다. 도 2는 본 발명의 일 실시예에 따른 무인 항공 서버의 블록도이다. 도 3은 본 발명의 일 실시예에 따른 무인 항공 서버의 세부 블록도이다. 도 4는 강화 학습의 개념도이다. 도 5는 다양한 학습 방법에 대한 전자 장치 수에 따른 지연 제약 만족률 시뮬레이션 결과를 나타내는 그래프이다. 도 6은 다양한 학습 방법에 대한 전자 장치 수에 따른 복수의 무인 항공 서버 사이의 계산 부하 편차 시뮬레이 션 결과를 나타내는 그래프이다. 도 7은 다양한 학습 방법에 대한 전자 장치 수에 따른 복수의 무인 항공 서버 사이의 잔여 에너지 편차 시뮬레 이션 결과를 나타내는 그래프이다. 도 8은 다양한 학습 방법에 대한 전자 장치 이동 속도에 따른 지연 제약 만족률 시뮬레이션 결과를 나타내는 그 래프이다. 도 9는 다양한 학습 방법에 대한 전자 장치 이동 속도에 따른 복수의 무인 항공 서버 사이의 계산 부하 편차 시 뮬레이션 결과를 나타내는 그래프이다. 도 10은 다양한 학습 방법에 대한 전자 장치 이동 속도에 따른 복수의 무인 항공 서버 사이의 잔여 에너지 편차 시뮬레이션 결과를 나타내는 그래프이다. 도 11은 다양한 학습 방법에 대한 하나의 태스크 내의 서브-태스크 수에 따른 지연 제약 만족률 시뮬레이션 결 과를 나타내는 그래프이다. 도 12는 다양한 학습 방법에 대한 하나의 태스크 내의 서브-태스크 수에 따른 복수의 무인 항공 서버 사이의 계 산 부하 편차 시뮬레이션 결과를 나타내는 그래프이다. 도 13은 다양한 학습 방법에 대한 하나의 태스크 내의 서브-태스크의 수에 따른 복수의 무인 항공 서버 사이의 잔여 에너지 편차 시뮬레이션 결과를 나타내는 그래프이다. 도 14는 본 발명의 일 실시예에 따른 무인 항공 서버의 동작 방법의 흐름도이다. 도 15는 본 발명의 일 실시예에 따른 모바일 엣지 컴퓨팅 시스템의 동작 방법의 흐름도이다."}
