{"patent_id": "10-2021-7039381", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0020261", "출원번호": "10-2021-7039381", "발명의 명칭": "이염성 백질이영양증의 치료에 유용한 조성물", "출원인": "더 트러스티스 오브 더 유니버시티 오브 펜실베니", "발명자": "호르도 줄리에트"}}
{"patent_id": "10-2021-7039381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "이염성 백질이영양증(Metachromatic Leukodystrophy)을 치료하는데 유용한 재조합 아데노-관련 바이러스(recombinant adeno-associated virus: rAAV)로서, 상기 rAAV는(a) AAVhu68 캡시드; 및(b) (a)의 AAV 캡시드에 패키징된 벡터 게놈을 포함하되, 상기 벡터 게놈은 반전 말단 반복부(inverted terminal repeat: ITR) 및 hARSA 발현을 지시하는조절 서열의 제어하에 기능성 인간 아릴설파테이스 A(human Arylsulfatase A: hARSA)를 암호화하는 핵산 서열을포함하고, 상기 hARSA 코딩 서열은 서열번호 1의 55번 뉴클레오타이드(nt) 내지 1521번 nt의 서열 또는 기능성hARSA를 암호화하는 서열과 적어도 95% 내지 99.9% 동일한 서열을 포함하는, rAAV."}
{"patent_id": "10-2021-7039381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 기능성 hARSA 단백질은 신호 펩타이드 및 서열번호 2의 19번 아미노산(aa) 내지 507번 aa의 아미노산 서열을 포함하는, rAAV."}
{"patent_id": "10-2021-7039381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항 또는 제2항에 있어서, 상기 신호 펩타이드는 서열번호 2의 1번 aa 내지 18번 aa의 아미노산 서열 또는 서열번호 4의 1번 aa 내지 20번 aa의 아미노산 서열을 갖는, rAAV."}
{"patent_id": "10-2021-7039381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항 내지 제3항 중 어느 한 항에 있어서, 상기 제어 서열은 신경계 세포에서 hARSA 발현을 지시하는, rAAV."}
{"patent_id": "10-2021-7039381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항 내지 제4항 중 어느 한 항에 있어서, 상기 제어 서열은 CB7 프로모터를 비롯한 유비쿼터스 프로모터를 포함하는, rAAV."}
{"patent_id": "10-2021-7039381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항 내지 제5항 중 어느 한 항에 있어서, 상기 조절 요소는 코작(Kozak) 서열, 폴리아데닐화 서열, 인트론,인핸서 및 TATA 신호 중 하나 이상을 포함하는, rAAV."}
{"patent_id": "10-2021-7039381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항 내지 제6항 중 어느 한 항에 있어서, 상기 hARSA 코딩 서열은 서열번호 1과 적어도 95% 내지 99.9% 동일하며 기능성 hARSA를 암호화하는, rAAV."}
{"patent_id": "10-2021-7039381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항 내지 제7항 중 어느 한 항에 있어서, 상기 hARSA 코딩 서열은 서열번호 1 또는 서열번호 3인, rAAV."}
{"patent_id": "10-2021-7039381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항 내지 제8항 중 어느 한 항에 있어서, 상기 벡터 게놈은 서열번호 5의 1번 nt 내지 3883번 nt의 서열인,rAAV."}
{"patent_id": "10-2021-7039381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항 내지 제9항 중 어느 한 항에 있어서, 상기 AAVhu68 캡시드는 서열번호 7의 예상되는 아미노산 서열을 암공개특허 10-2022-0020261-3-호화하는 서열로부터 생성된, rAAV."}
{"patent_id": "10-2021-7039381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "수성 약제학적 조성물로서, 제1항 내지 제10항 중 어느 한 항에 따른 rAAV 및 제형 완충액을 포함하는, 수성 약제학적 조성물."}
{"patent_id": "10-2021-7039381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 상기 제형 완충액은 완충 식염수, 및 소듐, 칼슘, 마그네슘, 포타슘 또는 이들의 혼합물 중하나 이상을 포함하는 인공 뇌척수액; 및 계면활성제를 포함하는, 수성 약제학적 조성물."}
{"patent_id": "10-2021-7039381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항 또는 제12항에 있어서, 상기 계면활성제는 상기 약제학적 조성물의 0.0005% 내지 약 0.001%로 존재하는,수성 약제학적 조성물."}
{"patent_id": "10-2021-7039381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항 내지 제13항 중 어느 한 항에 있어서, 상기 조성물은 7.5 내지 7.8 범위의 pH에 있는, 수성 약제학적 조성물."}
{"patent_id": "10-2021-7039381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11항 내지 제14항 중 어느 한 항에 있어서, 상기 제형 완충액은 대수조내 주사(intra-cisterna magnainjection: ICM), 정맥내 전달, 척수강내 투여 또는 뇌실내 투여에 적합한, 수성 약제학적 조성물."}
{"patent_id": "10-2021-7039381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "발현 카세트를 포함하는 벡터로서, 상기 발현 카세트는 기능성 인간 아릴설파테이스 A(hARSA) 발현을 지시하는조절 서열의 제어하에 상기 hARSA를 암호화하는 핵산 서열을 포함하는, 벡터."}
{"patent_id": "10-2021-7039381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서, 상기 기능성 hARSA 단백질은 신호 펩타이드 및 서열번호 2의 19번 아미노산(aa) 내지 507번aa의 아미노산 서열을 포함하는, 벡터."}
{"patent_id": "10-2021-7039381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제16항 또는 제17항에 있어서, 상기 신호 펩타이드는 has 서열번호 2의 1번 aa 내지 18번 aa의 아미노산 서열또는 서열번호 4의 1번 aa 내지 20번 aa의 아미노산 서열을 갖는, 벡터."}
{"patent_id": "10-2021-7039381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제16항 내지 제18항 중 어느 한 항에 있어서, 상기 hARSA 코딩 서열은 서열번호 1의 55번 뉴클레오타이드(nt)내지 1521번 nt의 서열 또는 기능성 hARSA를 암호화하는 서열과 적어도 95% 내지 99.9% 동일한 서열을 갖는, 벡터."}
{"patent_id": "10-2021-7039381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제16항 내지 제19항 중 어느 한 항에 있어서, 상기 hARSA 코딩 서열은 서열번호 1 또는 서열번호 3인, 벡터."}
{"patent_id": "10-2021-7039381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제16항 내지 제20항 중 어느 한 항에 있어서, 상기 벡터는 재조합 아데노-관련 바이러스, 재조합 파보바이러스,재조합 렌티바이러스, 재조합 레트로바이러스 또는 재조합 아데노바이러스로부터 선택되는 바이러스 벡터; 또는네이키드 DNA, 네이키드 RNA, 무기 입자, 지질 입자, 중합체-기반 벡터 또는 키토산-기반 제형으로부터 선택되는 비-바이러스 벡터인, 벡터."}
{"patent_id": "10-2021-7039381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "공개특허 10-2022-0020261-4-약제학적 조성물로서, 제16항 내지 제21항 중 어느 한 항에 따른 벡터 및 제형 완충액을 포함하는, 약제학적 조성물."}
{"patent_id": "10-2021-7039381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제22항에 있어서, 상기 제형 완충액은 정맥내 전달, 대수조내 주사(ICM), 척수강내 투여 또는 뇌실내 투여에 적합한, 약제학적 조성물."}
{"patent_id": "10-2021-7039381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "이염성 백질이영양증 또는 아릴설파테이스 A(ARSA) 유전자 돌연변이와 관련된 질환을 치료하는 방법으로서, 유효량의 제1항 내지 제10항 중 어느 한 항에 따른 rAAV, 또는 제11항 내지 제15항 및 제22항 내지 제23항 중 어느 한 항에 따른 약제학적 조성물, 또는 제16항 내지 제21항 중 어느 한 항에 따른 벡터를 이염성 백질이영양증또는 아릴설파테이스 A(ARSA) 유전자 돌연변이와 관련된 질환의 치료를 필요로 하는 대상체에 투여하는 단계를포함하는, 방법."}
{"patent_id": "10-2021-7039381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제24항에 있어서, 상기 rAAV 또는 상기 벡터는 CT-유도 후두하 주사(CT-guided sub-occipital injection)를 통해 대수조에 투여되는, 방법."}
{"patent_id": "10-2021-7039381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "제24항 또는 제25항에 있어서, 상기 방법은 상기 rAAV, 상기 약제학적 조성물 또는 상기 벡터를 단일 용량으로전달하는 단계를 포함하는, 방법."}
{"patent_id": "10-2021-7039381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "제24항 내지 제26항 중 어느 한 항에 있어서, 상기 rAAV는 뇌 질량의 그램당(GC/g) 3.00×1010 게놈 카피(GC)내지 1.00×1012 GC/뇌 질량의 g의 용량으로 투여되는, 방법."}
{"patent_id": "10-2021-7039381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_28", "content": "제24항 내지 제27항 중 어느 한 항에 있어서, 상기 투여 후 상기 대상체의 질환 증상이 개선되고 그리고/또는질환 진행이 지연되는, 방법."}
{"patent_id": "10-2021-7039381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "대수조 내 CT-유도 후두하 주사를 포함한 대수조내 주사(ICM)를 통해 환자에게 투여하기에 적합한, 제1항 내지제10항 중 어느 한 항에 따른 rAAV, 또는 제16항 내지 제21항 중 어느 한 항에 따른 벡터, 또는 제11항 내지 제15항 및 제22항 내지 제23항 중 어느 한 항에 따른 약제학적 조성물."}
{"patent_id": "10-2021-7039381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_30", "content": "7세 이하인 대상체에 투여하기에 적합한, 제1항 내지 제10항 중 어느 한 항에 따른 rAAV, 또는 제16항 내지 제21항 중 어느 한 항에 따른 벡터 또는 제11항 내지 제15항 및 제22항 내지 제23항 중 어느 한 항에 따른 약제학적 조성물."}
{"patent_id": "10-2021-7039381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_31", "content": "아릴설파테이스 A(ARSA) 유전자 돌연변이와 관련된 이염성 백질이영양증 또는 질환의 증상을 개선하고/하거나아릴설파테이스 A(ARSA) 유전자 돌연변이와 관련된 이염성 백질이영양증 또는 질환의 진행을 지연시키기 위해이를 필요로 하는 대상체에 투여하기에 적합한, 제1항 내지 제10항 중 어느 한 항에 따른 rAAV, 또는 제16항 내지 제21항 중 어느 한 항에 따른 벡터 또는 제11항 내지 제15항 및 제22항 내지 제23항 중 어느 한 항에 따른약제학적 조성물."}
{"patent_id": "10-2021-7039381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_32", "content": "rAAV 또는 벡터 또는 조성물이 단일 용량으로 투여되는, 제1항 내지 제10항 중 어느 한 항에 따른 rAAV, 제16항공개특허 10-2022-0020261-5-내지 제21항 중 어느 한 항에 따른 벡터 또는 제11항 내지 제15항 및 제22항 내지 제23항 중 어느 한 항에 따른약제학적 조성물."}
{"patent_id": "10-2021-7039381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_33", "content": "제1항 내지 제10항 중 어느 한 항에 따른 rAAV를 생산하는데 유용한 rAAV 생산 시스템으로서, 상기 생산 시스템은(a) AAVhu68 캡시드 단백질을 암호화하는 핵산 서열;(b) 벡터 게놈; 및 (c) 상기 벡터 게놈을 상기 AAVhu68 캡시드로 패키징할 수 있는 충분한 AAV rep 기능 및 헬퍼 기능을 포함하는 세포 배양물을 포함하는, rAAV 생산 시스템."}
{"patent_id": "10-2021-7039381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_34", "content": "제33항에 있어서, 상기 벡터 게놈은 서열번호 5의 1번 nt 내지 3883번 nt의 서열을 갖는, rAAV 생산 시스템."}
{"patent_id": "10-2021-7039381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_35", "content": "제33항 또는 제34항에 있어서, 상기 세포 배양물은 인간 배아 신장 293 세포 배양물인, rAAV 생산 시스템."}
{"patent_id": "10-2021-7039381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_36", "content": "제33항 내지 제35항 중 어느 한 항에 있어서, 상기 AAV rep는 AAVhu68과는 상이한 AAV로부터 유래하는, rAAV 생산 시스템."}
{"patent_id": "10-2021-7039381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_37", "content": "제36항에 있어서, 상기 AAV rep는 AAV2로부터 유래하는, rAAV 생산 시스템."}
{"patent_id": "10-2021-7039381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_38", "content": "제33항 내지 제37항 중 어느 한 항에 있어서, 상기 AAV rep 코딩 서열 및 cap 유전자는 동일한 핵산 분자 상에있되, 선택적으로 상기 rep 서열과 cap 유전자 사이에 스페이서가 존재하는, rAAV 생산 시스템."}
{"patent_id": "10-2021-7039381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_39", "content": "제38항에 있어서, 상기 스페이서는 서열번호 24의 폴리뉴클레오타이드인, rAAV 생산 시스템."}
{"patent_id": "10-2021-7039381", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "AAVhu68 캡시드 및 기능성 인간 아릴설파테이스 A(ARSA)를 암호화하는 핵산 서열을 포함하는 벡터 게놈을 갖는 재조합 아데노-관련 바이러스(rAAV)가 제공된다. 또한, rAAV를 생산하는데 유용한 생산 시스템, rAAV를 포함하는 약제학적 조성물 및 유효량의 rAAV를 이를 필요로 하는 대상체에 투여하는 단계를 통해 이염성 백질이영양증이 있는 대상체를 치료하거나 또는 이염성 백질이영양증의 증상을 개선하거나 또는 이염성 백질이영양증의 진행을 지연시키는 방법이 제공된다."}
{"patent_id": "10-2021-7039381", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "이염성 백질이영양증(Metachromatic Leukodystrophy: MLD)은 라이소솜 효소 ARSA를 암호화하는 유전자의 돌연 변이에 의해 유발되는 단일유전자 상염색체 열성 스핑고리피드 축적 질환이다(monogenic autosomal recessive sphingolipid storage disease)(문헌[Figura et al., 2001; Gieselmann and Krageloh-Mann, 2010]). ARSA 결 핍은 일반적으로 설파타이드(sulfatide)로 지칭되는 설페이트화된 갈락토스핑고리피드(갈락토실세라마이드-3-O- 설페이트 및 갈락토실스핑고신-3-O-설페이트)인 천연 기질의 축적으로 이어진다. 설파타이드는 말초 신경계 (Peripheral Nervous System: PNS)의 슈반 세포(Schwann cell) 및 대식세포 외에, 중추 신경계(Central Nervous System: CNS)의 희소돌기아교세포(oligodendrocyte), 미세아교세포(microglia) 및 소정의 유형의 뉴런 의 라이소솜 내에 축적된다(문헌[Peng and Suzuki, 1987]). PNS와 CNS가 주로 영향을 받지만, 설파타이드 축적 은 또한 내장 기관; 특히, 신장, 간(문헌[Toda et al., 1990]) 및 담낭(문헌[Rodriguez-Waitkus et al., 2011; McFadden and Ranganathan, 2015])에서도 발생한다. MLD 환자(즉, 두 대립유전자 모두에 돌연변이를 보유하는 환자)는 전형적으로 합성 기질-기반 검정에서 대조군 값의 0% 내지 10%인 ARSA 효소 활성을 갖는다. 단일 돌연변이된 ARSA 대립유전자 및 하나의 정상 대립유전자를 갖는 ARSA 돌연변이 보인자(carrier)는 임상적으로 영향을 받지 않으며, 일반적으로 대조군 값의 대략 10%인 ARSA 효소 활성을 갖는 반면, 가성결핍(pseudodeficiency: PD, ARSA 결핍의 또 다른 유전적으로 구별되는 형태)대립유전자가 있는 무증상 개체는 건강한 대조군의 대략 10% 내지 20%인 ARSA 효소 활성을 갖는다(문헌[Gomez- Ospina, 2017]). 임상적으로, 세 가지 형태의 MLD가 질환 중증도의 광범위하고 연속적인 스펙트럼에 걸쳐 증상 발병의 연령에 기초하여 구별될 수 있다: MLD 진단의 각각 50% 내지 60%, 20% 내지 30% 및 15% 내지 20%를 포함 하는 급속 진행성 중증 후기 유아기형(rapidly progressive severe late infantile form), 유년기형(juvenile form) 및 후기 발병 느린 진행성 성인형(late onset slowly progressive adult form)(문헌[Gomez-Ospina, 2017, Wang et al., 2011]). 유아기형 MLD는 희귀 질환으로 간주된다. 후기 유아기형 MLD는 30개월 이전에 발 병하며, 질환의 가장 중증 형태이다. 후기 유아기형은 균일한 임상적 양상을 보이고, 급속하게 진행되며 예측 가능한 질환 경과를 보인다. 유년기형 MLD는 연구에 따라 30개월 내지 16세 사이의 발병 연령과 6세 2개월(문헌 [Kehrer et al., 2011a]) 내지 10세(문헌[Mahmood et al., 2010])의 발병 평균 연령을 특징으로 한다. 임상적 표현형을 더 잘 특성화하기 위하여, 후기 유아기형 MLD가 있는 유아와 비교하여 6세 이하의 임상적 발병을 갖고 유사하지만 덜 급속한 초기 질환 진행(evolution)을 보이는, 조기 유년기형 MLD(early juvenile MLD)로 지칭되 는 유년기형 MLD 환자의 하위집단이 기술되어 있다(문헌[Biffi et al., 2008; Chen et al., 2016; Sessa et al., 2016]). 조기 유년기형 및 후기 유아기형 표현형은 집합적으로 조기 발병 MLD로 지칭된다(문헌[Sessa et al., 2016]). 후기 유년기형 MLD 환자(즉, 7세 내지 16세 사이에 증상 발명을 보이는 환자)에서, 행동 문제, 주 의력 결핍 또는 인지 저하가 일반적으로 먼저 발생하며, 때로는 보행 장애와 함께 발생한다. MLD에 대해 승인된 치료적 또는 질환-완화적 요법(disease-modifying therapy)은 없다. MLD는 결함이 있는 ARSA에 의해 발생하기 때문에, 다양한 연구 접근법은 CNS의 영향을 받는 신경 조직에서 기능성 ARSA를 대체함으 로써 생화학적 결함을 교정하는 것을 목표로 한다. 효소 대체 요법(enzyme replacement therapy: ERT) 및 조혈 줄기 세포 이식(hematopoietic stem cell transplantation: HSCT)은 ARSA-결핍 세포에 정상 효소를 제공하는데 의존하는 반면, 유전자 요법 접근법은 다양한 세포 유형에서 야생형 ARSA의 과발현을 기반으로 한다(문헌[Patil and Maegawa, 2013]). 제대혈(umbilical cord blood: UCB), 동종이계 말초 혈액 줄기 세포 또는 동종이계 골수 를 이용한 조혈 줄기 세포 이식(HSCT)의 효능은 환자의 질환 상태에 따른 개입(intervention) 시기에 따라 다르 다(문헌[Patil and Maegawa, 2013; van Rappard et al., 2015]). 골수 이식(Bone marrow transplant: BMT)은 최상의 결과를 위해 인간 백혈구 항원-일치 형제자매 공여자의 가용성을 요구하며(문헌[Boucher et al., 2015]), 이식편 대 숙주 질환(graft versus host disease: GvHD), 감염 및 사망과 같은 이식- 및 전처치 (conditioning)-관련 합병증의 위험이 있다. 제대혈(UCB) 이식은 더 빠른 가용성, 더 낮은 GvHD의 위험, 더 낮 은 사망률, 더 높은 비율의 완전-공여자 키메리즘(full-donor chimerism) 및 효소 결함의 더 나은 교정의 이점 을 갖는 BMT에 대한 대안을 제공한다(문헌[Bjatzios and Zafeiriou, 2012; Martin et al., 2013]). 그러나, BMT는 유럽에서 널리 사용되지 않는다. 뇌 생착은 느리며, 종종 세포가 생착하고, CNS로 이동하고, 분화하며 효 소 수준을 회복하는데 수개월이 걸린다. 더욱이, HSCT로 달성된 생리적 효소 수준은 CNS 전체에 걸친 결손을 교 정하기에 충분하지 않을 수 있다. 이는 이식이 급속 진행성 조기 발병 MLD에서 효과적이지 않은 이유를 설명할 수 있으며, 증상 전에 수행되더라도 질환의 모든 양상을 교정하거나 안정화할 수 없을 수 있다(문헌[de Hosson et al., 2011; Martin et al., 2013; Boucher et al., 2015]). 따라서, 이러한 환자에서 질환 진행을 중지하거나 예방할 수 있는 빠른-효과 발현 요법(fast-onset therapy)에 대한 상당한 충족되지 않은 요구가 남아 있다. HSCT 외에도, ARSA를 (과)발현하고, 영향을 받은 세포에 효소를 전달하며, 미세캡슐화된 재조합 세포, 희소돌기 아교세포 및 신경 전구 세포 및 배아 줄기 세포를 포함하여 MLD의 신경학적 징후를 치료하는 다양한 다른 세포- 기반 접근법이 존재한다. 이러한 세포 요법은 동물 모델에서 설파타이드 축적의 상당한 제거를 보여주었지만(문 헌[Patil and Maegawa, 2013]), 여전히 인간에서는 테스트되지 않았다. 자가유래 CD34+ 세포를 인간 ARSA-암호화 렌티바이러스 벡터로 형질도입하고 유전자-교정된 세포를 환자에게 재 투여함으로써 조혈 줄기 세포 이식과 유전자 요법(HSC-GT)을 조합하는 생체외 렌티바이러스 유전자 요법이 시도 되었다(문헌[Biffi et al., 2013]). 이러한 요법은 증상 전 단계에서 확인된 환자(더 나이가 많은 영향을 받은 형제자매에서 진단 후)에 유망하지만, 이미 증상이 있는 환자에게는 효과적인 것으로 보이지 않았다. 불행하게 도, 대부분의 새로운 MLD 진단은 신생아 스크리닝이 아직 이용 가능하지 않아 많은 MLD 환자에게 가능성이 없는 치료 옵션이 되기 때문에, 증상 발병 후에 이루어진다. 추가적으로, 골수 소멸성 전처치 양생법(myeloablative conditioning regimen)에 내재된 위험과 이러한 통합 벡터와 관련된 삽입성 돌연변이유발의 위험이 있다. NHP에서 약리학적-독성학 연구는 주사 부위 주변에 국한된 뇌 염증(뇌염)으로 인한 상당한 용량-제한 독성(문헌 [Zerah et al., 2015])을 보여주었다. 조기 발병 MLD에 걸린 유아의 뇌에서 AAVrh10-매개성 ARSA 유전자 전달 의 안전성 및 효능을 평가하기 위한 1/2상 임상 연구가 진행 중이며(NCT01801709)(문헌[Aubourg, 2016]), 마찬가지로 뇌의 백질에 있는 12개 부위의 뇌내 벡터 투여가 포함되었다(문헌[Zerah et al., 2015]). 임상 시험 결"}
{"patent_id": "10-2021-7039381", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "과는 요약 형태를 제외하고는 공개되지 않았으며, 예비 보고서는 발병을 예방하거나 또는 질환 진행을 멈추는데 효능이 없음을 시사하였다(문헌[Sevin et al., 2018]). 효능 부족에 대한 이유는 시험의 의뢰자(sponsor)에 의 해 논의되지 않았다. AAVrh10-매개성 유전자 요법 외에도, 뇌내로 전달된 렌티바이러스 유전자 요법은 또한 임 의의 형태의 MLD(NCT03725670)가 있는 환자를 모집하고 있다. 효소 대체 요법(enzyme replace therapy: ERT)은 이제 여러 라이소솜 축적 질환(Lysosomal Storage Disease: LSD)에 대한 치료 기준(Standard of Care: SOC)이며(문헌[Sands, 2014]), 이는 만노스-6-포스페이트 수용체를 통해 주입된 효소를 세포가 흡수하는 능력에 의존한다(문헌[Ghosh et al., 2003]). MLD에서, ERT는 Arsa-/- 마우 스의 신장, 말초 신경 및 CNS에서 설파타이드 축적을 감소시킨다(문헌[Matzner et al., 2005]). 인간 ARSA 및 표준 이상(supra-normal)의 설파타이드 합성에 대해 면역 관용이 있는 악화된 MLD 마우스 모델에서, MLD 증상의 개선 및 설파타이드 축적의 감소는 초기 시점에서 처리된 마우스에서만 나타났으며, 이는 IV-투여된 ERT가 진행 성 증상이 있는 환자에게 효과가 없을 수 있음을 시사한다(문헌[Matthes et al., 2012]). 동일한 모델에서, BBB 를 우회하기 위한 재조합 ARSA의 연속적인 IT 주입(Stroobants et al., 2011)은 설파타이드 축적의 완전한 역전 및 CNS 기능장애의 교정을 초래하는 반면, 마우스에서의 다른 비-임상적 연구는 감소된 설파타이드 축적 및 개 선된 기능적 결과를 초래하였다(문헌[Matzner et al., 2009; Piguet et al., 2012]). 그러나, 인간에서, ERT를 이용한 대사적 교정의 범위는 조기 발병 MLD에서 발생하는 급속한 대뇌 탈수초화를 막기에 충분하고 시기 적절 하지 않을 것이다(문헌[Rosenberg et al., 2016]). BBB는 대부분의 큰 단백질의 CNS에 대한 접근을 제한하기 때 문에, ERT가 CNS로 직접 전달될 때에만 효과가 있을 것으로 여겨지며(문헌[Abbott, 2013]), 짧은 반감기는 빈번 한 투여를 필요로 할 것이다. 이러한 가설은 빈번한 고용량 IV 투여(NCT00681811) 또는 IT 주사를 통해 이러한 한계를 극복하고자 시도한 ERT 임상 시험에서 입증되고 있다(문헌[Giugliani et al., 2018]). 그러나, 조기 발 병 및 후기 유년기형 MLD에서의 IT-투여된 ERT(NCT01510028)와 함께 IV-투여된 ERT를 사용한 후기 유아기형 MLD 환자에서의 결과는 실망스러웠다(NCT00418561). 소분자-기반 치료는 잠재적으로 MLD에 대한 현재 요법의 한계를 극복할 수 있으며(예를 들어, BBB를 통과함으로 써), 질환의 다양한 병원성 메커니즘 또한 해결할 수 있다. 와파린(쿠마딘(Coumadin))은 후기 유아기형 MLD 환 자의 소규모 코호트에서 기질-환원제로 테스트된 항-응고제이다. 요중 설파타이드 수준 또는 뇌 바이오마커 N- 아세틸아스파테이트 및 미오-이노시톨의 수준에 유익한 효과는 없었다(문헌[Patil and Maegawa, 2013]). 다른 연구 접근법으로 얻어진 전반적으로 실망스러운 비임상적 결과와 결합된 HSCT 및 HSC-GT의 제한된 혜택, 제한된 집단, 치료 범위 및 관련 위험은 특히 조기 발병 MLD 환자에 대해 다른 실행 가능한 치료 옵션에 대한 상당한 충족되지 않은 임상적 요구를 나타낸다. 비정상적 ARSA 유전자 및/또는 이염성 백질이영양증과 관련된 병태의 치료를 위한 대안적인 치료제가 바람직하 다. 아릴설파테이스 유전자(Arylsulfatase A gene: ARSA) 돌연변이와 관련된 질환의 치료를 필요로 하는 대상체에서 아릴설파테이스 유전자 돌연변이와 관련된 질환(예를 들어, 이염성 백질이영양증, 즉, MLD 또는 ARSA 가성결 핍)을 치료하는데 유용한 치료적, 재조합 및 복제-결함 아데노-관련 바이러스(replication-defective adeno- associated virus: rAAV)가 본 명세서에 제공된다. rAAV는 바람직하게는 복제-결함이며, 반전 말단 반복부 (inverted terminal repeat: ITR) 및 표적 세포에서 hARSA 발현을 지시하는 조절 서열의 제어하에 기능성 인간 아릴설파테이스 A(hARSA)를 암호화하는 핵산 서열을 포함하는 벡터 게놈을 운반한다. 소정의 실시형태에서, rAAV는 벡터 게놈이 패키징된 AAVhu68 캡시드를 더 포함한다. 소정의 실시형태에서, 벡터 게놈은 AAVhu68 게놈 서열을 포함하지 않기 때문에 AAVhu68 캡시드에 대해 완전히 외인성이다. 소정의 실시형태에서, 기능성 hARSA는 신호 펩타이드 및 서열번호 2의 19번 아미노산(aa)번 내지 아미노산 507 번의 서열을 갖는다. 소정의 실시형태에서, 천연 hARSA 신호 펩타이드, 예를 들어, 서열번호 2의 aa 1번 내지 aa 18번이 사용된다. 소정의 실시형태에서, 신호 펩타이드는 서열번호 4의 aa 1번 내지 aa 20번이다. 소정의 실 시형태에서, 기능성 hARSA는 서열번호 2 또는 서열번호 4의 아미노산 서열을 갖는다. 소정의 실시형태에서, hARSA 코딩 서열은 서열번호 1의 55번 뉴클레오타이드(nt) 내지 1521번 nt와 약 95% 내지 100% 동일하다. 소정의 실시형태에서, hARSA-코딩 서열은 서열번호 1 또는 서열번호 3이다. 추가의 실시형태에 서, hARSA 코딩 서열은 서열번호 2의 19번 아미노산(aa) 내지 507번 aa의 서열을 암호화한다. 또 다른 추가의실시형태에서, hARSA 코딩 서열은 서열번호 2 또는 서열번호 4의 서열을 암호화한다. 소정의 실시형태에서, 제어 서열은 다음 중 하나 이상을 포함한다: 닭 β-액틴(β-actin: BA) 프로모터 및 인간 사이토메갈로바이러스 급초기 인핸서(cytomegalovirus immediate-early enhancer: CMV IE)(예를 들어, CB7 프 로모터, 서열번호 5의 198번 nt 내지 862번 nt)로부터 유래되는 조절 요소, 닭 BA 스플라이스 공여체와 토끼 β -글로빈(rabbit β-globin: rBG) 스플라이스 억셉터 요소(예를 들어, CI, 서열번호 5의 nt 956번 내지 nt 1928 번)로 구성된 키메라 인트론 및 rBG 유전자(예를 들어, rBG, 서열번호 5의 nt 3539번 내지 nt 3665번)로부터 유 래되는 폴리아데닐화(폴리A) 신호. 소정의 실시형태에서, 벡터 게놈은 서열번호 5의 뉴클레오타이드(nt) 1번 내 지 nt 3883번의 서열을 갖는다. 소정의 실시형태에서, rAAV 또는 rAAV를 포함하는 조성물은 ARSA 돌연변이와 관 련된 질환(예를 들어, MLD)의 증상을 개선하고/하거나 ARSA 돌연변이와 관련된 질환(예를 들어, MLD)의 진행을 지연시키기 위해 이를 필요로 하는 대상체에 투여될 수 있다. 또 다른 양태에서, rAAV를 생산하는데 유용한 생산 시스템이 제공된다. 이러한 시스템에서, 본 명세서에 개시된 바와 같은 벡터 게놈 및 AAV 캡시드 내로 벡터 게놈의 패키징을 허용하기에 충분한 AAV rep 기능 및 헬퍼 기능 이 있는 AAVhu68 캡시드 단백질을 암호화하는 핵산 서열을 포함하는 세포가 배양된다. 일 양태에서, ARSA 돌연변이와 관련된 질환의 치료를 필요로 하는 대상체에서 ARSA 돌연변이와 관련된 질환(예 를 들어, MLD)을 치료하는데 유용한 벡터가 본 명세서에 제공된다. 벡터는 표적 세포에서 hARSA 발현을 지시하 는 조절 서열의 제어하에 기능성 인간 아릴설파테이스 A(hARSA)를 암호화하는 핵산 서열을 운반한다. 소정의 실 시형태에서, hARSA-코딩 서열은 서열번호 1과 약 95% 내지 100% 동일하다. 추가적으로 또는 대안적으로, 기능성 hARSA 단백질은 서열번호 2의 아미노산 서열을 갖는다. 소정의 실시형태에서, hARSA 코딩 서열은 서열번호 1이 다. 소정의 실시형태에서, 벡터 또는 벡터를 포함하는 조성물은 ARSA 돌연변이와 관련된 질환(예를 들어, MLD) 의 증상을 개선하고/하거나 ARSA 돌연변이와 관련된 질환(예를 들어, MLD)의 진행을 지연시키기 위해 이를 필요 로 하는 대상체에 투여될 수 있다. 추가의 양태에서, 본 명세서에 개시된 바와 같은 rAAV 또는 벡터 및 수성 현탁 매질를 포함하는 조성물이 본 명 세서에 제공된다. 소정의 실시형태에서, 제형 완충액 및 기재된 바와 같은 rAAV 또는 벡터를 포함하는 수성 조 성물이 제공된다. 소정의 실시형태에서, 제형 완충액은 완충 식염수 및 소듐, 칼슘, 마그네슘, 포타슘 또는 이 들의 혼합물 중 하나 이상을 포함하는 인공 뇌척수액; 및 계면활성제를 포함한다. 소정의 실시형태에서, 제형 완충액은 약 0.0005% 내지 약 0.001%의 계면활성제를 포함한다. 소정의 실시형태에서, 조성물의 pH는 7.2 내지 7.8이다. 또 다른 양태에서, ARSA 돌연변이와 관련된 질환(예를 들어, MLD)이 있는 대상체를 치료하거나, 또는 ARSA 돌연 변이와 관련된 질환(예를 들어, MLD)의 증상을 개선하거나 또는 ARSA 돌연변이와 관련된 질환(예를 들어, MLD) 의 진행을 지연시키는 방법이 제공된다. 방법은 유효량의 본 명세서에 개시된 바와 같은 rAAV 또는 벡터를 이를 필요로 하는 대상체에 투여하는 단계를 포함한다. 소정의 실시형태에서, 벡터 또는 rAAV는 대수조내 주사 (intra-cisterna magna injection: ICM), 예를 들어, 대수조 내로의 CT-유도 후두하 주사(CT-guided sub- occipital injection)를 통해 환자에게 투여될 수 있다. 소정의 실시형태에서, 7세 이하 또는 6세 이하인 이염 성 백질이영양증이 있는 환자에게 투여될 수 있는 벡터 또는 조성물이 제공된다. 소정의 실시형태에서, 방법은 단일 용량으로 인간 환자에게 rAAV 또는 벡터를 전달하는 단계를 포함한다. 본 발명의 이들 및 다른 양태는 본 발명의 다음의 상세한 설명으로부터 명백하다."}
{"patent_id": "10-2021-7039381", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아릴설파테이스 A(ARSA) 유전자의 돌연변이(들) 및/또는 기능성 아릴설파테이스 A의 정상 수준의 결핍에 의해 야기되는 질환(예를 들어, 이염성 백질이영양증(MLD))을 치료하기 위한 조성물 및 방법이 본 명세서에 제공된다. 소정의 실시형태에서, ARSA 유전자의 돌연변이(들) 및/또는 기능성 아릴설파테이스 A의 정상 수준의 결핍에 의해 야기되는 질환(들) 또는 증상(들)을 치료하기 위한 조성물 및 방법이 또한 제공된다. AAVhu68 캡시 드를 갖고 기능성 인간 아릴설파테이스 A(hARSA) 단백질을 암호화하는 벡터 게놈이 그 안에 패키징된 유효량의 재조합 아데노-관련 바이러스(rAAV)가 이를 필요로 하는 대상체에 전달된다. 바람직하게는, 이 rAAV는 수성 완 충액으로 제형화된다. 소정의 실시형태에서, 현탁액은 척추강내 주사에 적합하다. 소정의 실시형태에서, rAAV 벡터는 AAVhu68.hARSAco로 지칭되며, 여기서 hARSA 코딩 서열은 조작된 hARSA 코딩 서열이다(달리 명시되지 않 는 한 \"hARSAco\" 또는 \"hARSA\"로 지칭됨, 예를 들어, 서열번호 1의 55번 뉴클레오타이드(nt) 내지 1521번 nt, 서열번호 3 또는 이와 적어도 약 95% 내지 약 99.9% 동일한 서열). 소정의 실시형태에서, hARSAco는 서열번호 1 이다. 소정의 실시형태에서, hARSAco는 서열번호 3이다. 소정의 실시형태에서, rAAV 벡터는 AAVhu68.CB7.hARSAco로 지칭되며, 여기서 조작된 hARSA 코딩 서열은 사이토메갈로바이러스 인핸서(CB7; 서열번호 16)가 있는 닭 베타 액틴 프로모터를 포함하는 조절 서열의 제어하에 있다. 소정의 실시형태에서, 조성물은 대수조내 주사(ICM)를 통해 전달된다. 본 명세서에서 AAVhu68로 지칭되는 클레이드(clade) F 아데노-관련 바이러스(AAV)의 캡시드를 암호화하는 핵산 서열은 벡터 게놈을 운반하는 AAVhu68 캡시드 및 재조합 AAV(rAAV)의 생산에 이용된다. AAVhu68에 관한 추가적 인 세부사항은 WO 2018/160582 및 이 상세한 설명에 제공된다. 본 명세서에 기재된 AAVhu68 벡터는 hARSA 코딩 서열을 포함하는 벡터 게놈을 뇌, 해마, 운동 피질, 소뇌 및 운동 뉴런을 포함하는 중추 신경계(CNS) 및 뇌와 척수 외부의 신경 및 신경절을 포함하는 말초 신경계(PNS) 내의 세포에 전달하는데 매우 적합하다. 이들 벡터는 CNS 및/또는 PNS 및 소정의 다른 조직 및 세포, 예를 들어, 신장 또는 간 또는 담낭 내의 다른 세포를 표적화하 는데 사용될 수 있다. I. 아릴설파테이스 A(hARSA) 아릴설파테이스 A(ARSA)는 세레브로사이드 설페이트를 가수분해하는 효소적 활성을 갖는다(즉, 다음 반응: 세레 브로사이드 3-설페이트 + H2O = 세레브로사이드 + 설페이트). 인간 ARSA(hARSA) 단백질(UniProtKB - P15289, ARSA_인간)의 두 개의 아이소형(isoform)이 확인되었다: P51608-1, 서열번호 2; 및 P51608-2, 서열번호 15. 본 명세서 전반에 걸쳐, ARSA에 대한 언급은 달리 명시되지 않는 한 hARSA이다. 본 명세서에서 사용되는 바와 같이, 기능성 hARSA 단백질은 야생형 hARSA 단백질(예를 들어, P51608-1, 서열번 호 2; 또는 P51608-2, 서열번호 15)의 효소적 활성(즉, 효소 활성)의 적어도 약 10%를 갖는 hARSA 단백질의 아 이소형, 천연 변이체, 변이체, 다형체 또는 절단을 지칭한다. 각각의 웹 페이지의 전체가 참조에 의해 본 명세 서에 원용되어 있는 OMIM # 607574(omim.org/entry/607574), genecards.org/cgi-bin/carddisp.pl?gene=ARSA and uniprot.org/uniprot/P15289 참조. 소정의 실시형태에서, 기능성 hARSA 단백질은 야생형 hARSA 단백질(예 를 들어, P51608-1, 서열번호 2; 또는 P51608-2, 서열번호 15)의 효소적 활성의 적어도 약 10%, 15%, 20%, 25%, 30%, 35%, 40%, 45%, 50%, 55%, 60%, 65%, 70%, 75%, 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98%, 99%, 100%, 1.5-배, 2-배, 3-배, 4-배, 5-배, 10-배 이상을 갖는다. 소정의 실시형태에서, 기능성 hARSA 단백질은 야생형 hARSA 단백질(예를 들어, P51608-1, 서열번호 2; 또는 P51608-2, 서열번호 15)의 효소 적 활성의 약 10% 내지 약 15%, 약 10% 내지 약 20%, 약 10% 내지 약 25%, 약 10% 내지 약 30%, 약 10% 내지 약 50%, 약 10% 내지 약 75%, 약 10% 내지 약 90%, 약 10% 내지 약 100%, 약 10% 내지 약 3-배, 약 15% 내지 약 20%, 약 15% 내지 약 25%, 약 15% 내지 약 30%, 약 15% 내지 약 50%, 약 15% 내지 약 75%, 약 15% 내지 약 90%, 약 15% 내지 약 100%, 약 15% 내지 약 3-배, 약 20% 내지 약 25%, 약 20% 내지 약 30%, 약 20% 내지 약 50%, 약 20% 내지 약 75%, 약 20% 내지 약 90%, 약 20% 내지 약 100%, 약 20% 내지 약 3-배, 약 25% 내지 약 30%, 약 25% 내지 약 50%, 약 25% 내지 약 75%, 약 25% 내지 약 90%, 약 25% 내지 약 100%, 약 25% 내지 약 3- 배, 약 50% 내지 약 75%, 약 50% 내지 약 90%, 약 50% 내지 약 100%, 약 50% 내지 약 3-배, 약 75% 내지 약 90%, 약 75% 내지 약 100% 또는 약 75% 내지 약 3-배를 갖는다. hARSA 효소적 활성을 측정하는 방법(들)(예를 들어, 합성 기질-기반 검정을 통해 그리고/또는 설파타이드 로딩 검정을 통해)은 실시예뿐만 아니라 문헌 [Kreysing et al., High residual arylsulfatase A (ARSA) activity in a patient with late-infantile metachromatic leukodystrophy. Am J Hum Genet. 1993 Aug;53:339-46.; Lee-Vaupel M and Conzelmann E. A simple chromogenic assay for arylsulfatase A. Clin Chim Acta. 1987 Apr 30;164:171-80; et al., Enzymatic characterization of novel arylsulfatase A variants using human arylsulfatase A- deficient immortalized mesenchymal stromal cells. Hum Mutat. 2017 Nov;38:1511-1520. doi: 10.1002/humu.23306. Epub 2017 Sep 6; 및 Francesco Morena, et al., A new analytical bench assay for the determination of arylsulfatase a activity toward galactosyl-3-sulfate ceramide: implication for metachromatic leukodystrophy diagnosis. Anal Chem. 2014 Jan 7;86:473-81. doi: 10.1021/ac4023555. Epub 2013 Dec 11]와 같은 다양한 간행물에서 찾을 수 있다. 소정의 실시형태에서, 기능성 hARSA 단백질은 (i) 신호 펩타이드 및 (ii) 서열번호 2의 19번 아미노산(aa) 내지 507번 aa의 아미노산 서열 또는 이와 적어도 약 90%(예를 들어, 적어도 약 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98%, 99% 또는 99.9%) 동일한 아미노산 서열을 포함한다. 소정의 실시형태에서, 기능성 hARSA 단백질 은 (i) 신호 펩타이드 및 (ii) 서열번호 15의 아미노산 서열(즉, 서열번호 2의 85번 aa 내지 507번 aa) 또는 이 와 적어도 약 90%(예를 들어, 적어도 약 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98%, 99% 또는 99.9%) 동일 한 아미노산 서열을 포함한다. 소정의 실시형태에서, 기능성 hARSA 단백질은 (i) 신호 펩타이드, (ii) 서열번호 2의 19번 아미노산(aa) 내지 444번 aa의 아미노산 서열 또는 이와 적어도 약 90%(예를 들어, 적어도 약 90%,91%, 92%, 93%, 94%, 95%, 96%, 97%, 98%, 99% 또는 99.9%) 동일한 아미노산 서열 및 (iii) 서열번호 2의 448 번 aa 내지 507번의 아미노산 서열 또는 이와 적어도 약 90%(예를 들어, 적어도 약 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98%, 99% 또는 99.9%) 동일한 아미노산 서열을 포함한다. 추가의 실시형태에서, (ii)의 아미노 산 서열은 이황화 결합(들)에 의해 (iii)의 아미노산 서열에 연결될 수 있다. 다른 화학 결합(들), 예를 들어, 공유 결합 및 비공유 결합(수소, 이온, 소수성 및 반 데르 발스 결합을 포함)이 이용될 수 있다. 또 다른 추가 의 실시형태에서, (ii)와 (iii)의 아미노산 서열 사이의 연결은 기재된 결합의 조합에 의해 형성된다. 또 다른 실시형태에서, (ii)와 (iii)의 아미노산 서열 사이의 연결은 펩타이드 링커이다(예를 들어, parts.igem.org/Protein_domains/Linker 참조). 소정의 실시형태에서, 기능성 hARSA 단백질은 (i) 신호 펩타이 드, (ii) 서열번호 2의 85번 아미노산(aa) 내지 444번 aa의 아미노산 서열 또는 이와 적어도 약 90%(예를 들어, 적어도 약 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98%, 99% 또는 99.9%) 동일한 아미노산 서열 및 (iii) 서 열번호 2의 448번 aa 내지 507번 aa의 아미노산 서열 또는 이와 적어도 약 90%(예를 들어, 적어도 약 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98%, 99% 또는 99.9%) 동일한 아미노산 서열을 포함한다. 추가의 실시형태에서, (ii)의 아미노산 서열은 이황화 결합(들)에 의해 (iii)의 아미노산 서열에 연결될 수 있다. 다른 화학 결합(들), 예를 들어, 공유 결합 및 비공유 결합(수소, 이온, 소수성 및 반 데르 발스 결합 포함)이 이용 될 수 있다. 또 다른 추가의 실시형태에서, (ii)와 (iii)의 아미노산 서열 사이의 연결은 기재된 결합의 조합에 의해 형성된다. 또 다른 실시형태에서, (ii)와 (iii)의 아미노산 서열 사이의 연결은 펩타이드 링커이다(예를 들어, parts.igem.org/Protein_domains/-Linker 참조). 소정의 실시형태에서, 기능성 hARSA 단백질은 (i) 신호 펩타이드 및 (ii) 서열번호 2의 23번 아미노산(aa) 내지 348번 aa의 아미노산 서열 또는 이와 적어도 약 90%(예 를 들어, 적어도 약 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98%, 99% 또는 99.9%) 동일한 아미노산 서열을 포함한다. 소정의 실시형태에서, 기능성 hARSA 단백질은 (i) 신호 펩타이드 및 (ii) 서열번호 2의 19번 아미노 산(aa) 내지 448번 aa의 아미노산 서열 또는 이와 적어도 약 90%(예를 들어, 적어도 약 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98%, 99% 또는 99.9%) 동일한 아미노산 서열을 포함한다. 소정의 실시형태에서, 기능성 hARSA 단백질은 (i) 신호 펩타이드 및 (ii) 서열번호 2의 448번 아미노산(aa) 내지 507번 aa의 아미노산 서열 또는 이와 적어도 약 90%(예를 들어, 적어도 약 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98%, 99% 또는 99.9%) 동일한 아미노산 서열을 포함한다. 소정의 실시형태에서, 명시된 동일성을 갖는 기능성 hARSA 단백질은 서열번호 2의 넘버링을 기준으로 85번 aa 내지 507번 aa의 외부 및/또는 서열번호 2의 넘버링을 기준으로 29번, 69번, 123번, 125번, 150번, 229번, 281번, 282번 aa 중 임의의 하나 이상의 외부 및/또는 임의의 hARSA 보존 된 도메인(들)(예를 들어, Pfam:PF00884가 있는 설파테이스 도메인)의 외부 및/또는 서열번호 2의 넘버링을 기 준으로 19번 aa 내지 444번 aa의 외부 및/또는 서열번호 2의 넘버링을 기준으로 448번 aa 내지 507번 aa의 외부 및/또는 서열번호 2의 넘버링을 기준으로 23번 aa 내지 348번 aa의 외부의 변형 또는 이들의 임의의 조합을 갖 는다. 예를 들어, 문헌[von R et al, Crystal structure of an enzyme-substrate complex provides insight into the interaction between human arylsulfatase A and its substrates during catalysis, J Mol Biol. 2001 Jan 12;305:269-77] 참조. 소정의 실시형태에서, 기능성 hARSA 단백질은 서열번호 2의 아미노산 서열 또는 이와 적어도 약 90%(예를 들어, 적어도 약 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98%, 99% 또는 99.9%) 동일한 아미노산 서열을 갖는다. 소정의 실시형태에서, 기능성 hARSA 단백질은 서열번호 4의 아미노산 서열 또는 이와 적어도 약 90%(예를 들어, 적어도 약 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98%, 99% 또는 99.9%) 동일한 아미노산 서열을 갖는다. 본 명세서에서 사용되는 바와 같이, 신호 펩타이드(때때로 신호 서열, 표적화 신호, 국재화 신호, 국재화 서열, 수송 펩타이드, 리더 서열 또는 리더 펩타이드로도 지칭됨)는 분비 경로로 향하는 대부분의 새로 합성된 단백질 의 N-말단에 존재하는 짧은 펩타이드(일반적으로, 15개 내지 30개의 아미노산 길이)이다(문헌[Blobel G, Dobberstein B (Dec 1975). \"Transfer of proteins across membranes. I. Presence of proteolytically processed and unprocessed nascent immunoglobulin light chains on membrane-bound ribosomes of murine myeloma\". J Cell Biol. 67 : 835-51]). 이들 단백질은 소정의 세포기관(소포체, 골지 또는 엔도솜) 내부에 존재하거나, 세포로부터 분비되거나 또는 대부분의 세포 막에 삽입되는 단백질을 포함한다. 소정의 실시형태에 서, 신호 펩타이드는 서열번호 2의 1번 aa 내지 18번 aa의 아미노산 서열 또는 서열번호 4의 1번 aa 내지 20번 aa의 아미노산 서열을 갖는다. 소정의 실시형태에서, 신호 펩타이드는 CNS 세포(예를 들어, 뉴런), PNS 세포 또 는 또 다른 세포(예컨대, 신장 세포 또는 간 세포)에 의해 분비되는 또 다른 단백질로부터 유래된다. 신호 펩타 이드는 바람직하게는 인간 기원 또는 인간 신호 펩타이드의 유도체이고, 약 15개 내지 약 30개의 아미노산, 바 람직하게는 약 17개 내지 25개의 아미노산 또는 약 18개의 아미노산 길이이다. 소정의 실시형태에서, 신호 펩타이드는 천연 신호 펩타이드(서열번호 2의 1번 내지 18번 아미노산)이다. 소정의 실시형태에서, 기능성 hARSA 단 백질은 천연 신호 펩타이드 대신에 외인성 리더 서열을 포함한다. 또 다른 실시형태에서, 신호 펩타이드는 인간 IL2 또는 돌연변이된 신호 펩타이드로부터 유래될 수 있다. 또 다른 실시형태에서, 인간 세르핀F1 분비 신호는 신호 펩타이드로서 사용될 수 있다. 외인성 신호 펩타이드 및 hARSA의 성숙 부분(예를 들어, 서열번호 2의 19번 aa 내지 507번 aa, 서열번호 2의 19번 aa 내지 444번 aa, 서열번호 2의 85번 aa 내지 507번 aa, 서열번호 2의 23번 aa 내지 348번 aa 또는 서열번호 2의 448번 aa 내지 507번 aa)을 포함하는 이러한 키메라 hARSA 단백질은 기능성 hARSA 단백질에 대한 언급이 있는 경우 본 명세서에 기재된 다양한 실시형태에 포함된다. hARSA 코딩 서열 또는 ARSA 코딩 서열 또는 hARSA 또는 ARSA로 지칭되는 기능성 hARSA 단백질을 암호화하는 핵 산 서열이 본 명세서에 제공된다. 소정의 실시형태에서, hARSA 코딩 서열은 변형 또는 조작된다(hARSA 또는 hARSAco). 소정의 실시형태에서, hARSA 코딩 서열은 서열번호 1의 55번 뉴클레오타이드(nt) 내지 1521번 서열 또는 이와 적어도 95% 내지 99.9% 동일한 서열을 갖는다. 소정의 실시형태에서, hARSA 코딩 서열은 서열번호 1 의 55번 nt 내지 1521번 nt 또는 이와 적어도 약 70%(예를 들어, 적어도 약 75%, 적어도 약 80%, 적어도 약 85%, 적어도 약 90%, 적어도 약 91%, 적어도 약 92%, 적어도 약 93%, 적어도 약 94%, 적어도 약 95%, 적어도 약 96%, 적어도 약 97%, 적어도 약 98%, 적어도 약 99% 또는 적어도 약 99.9%) 동일한 핵산 서열을 갖는다. 소 정의 실시형태에서, hARSA 코딩 서열은 서열번호 1 또는 이와 적어도 95% to 99.9% 동일한 서열이다. 소정의 실 시형태에서, hARSA 코딩 서열은 서열번호 1 또는 이와 적어도 약 70%(예를 들어, 적어도 약 75%, 적어도 약 80%, 적어도 약 85%, 적어도 약 90%, 적어도 약 91%, 적어도 약 92%, 적어도 약 93%, 적어도 약 94%, 적어도 약 95%, 적어도 약 96%, 적어도 약 97%, 적어도 약 98%, 적어도 약 99% 또는 적어도 약 99.9%) 동일한 핵산 서 열이다. 소정의 실시형태에서, hARSA 코딩 서열은 서열번호 3 또는 이와 적어도 95% to 99.9% 동일한 서열이다. 소정의 실시형태에서, hARSA 코딩 서열은 서열번호 3 또는 이와 적어도 약 70%(예를 들어, 적어도 약 75%, 적어 도 약 80%, 적어도 약 85%, 적어도 약 90%, 적어도 약 91%, 적어도 약 92%, 적어도 약 93%, 적어도 약 94%, 적 어도 약 95%, 적어도 약 96%, 적어도 약 97%, 적어도 약 98%, 적어도 약 99% 또는 적어도 약 99.9%) 동일한 핵 산 서열이다. hARSA의 전사체 변이체(hARSA 코딩 서열이기도 함)는 NCBI 참조 서열 NM_000487.5, NM_001085425.2, NM_001085426.2, NM_001085427.2, NM_001085428.2, NM_001362782.1, AB448736.1, AK092752.1, AK098659.1, AK301098.1, AK310564.1, AK315011.1, BC014210.2, BI770997.1, BM818814.1, BP306351.1, BQ184813.1, BU632196.1, BX648618.1, CA423492.1, CN409235.1, CR456383.1, DA844740.1, DB028013.1, GQ891416.1, KU177918.1, KU177919.1 및 X52151.1로서 찾을 수 있다. NCBI 참조 서열 각각은 그 전체가 참조에 의해 본 명 세서에 원용된다. 소정의 실시형태에서, 변형된 또는 조작된 hARSA 코딩 서열은 NCBI 참조 서열 중 하나에 대해 약 70%, 75%, 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98%, 99% 또는 99.9% 미만의 동일성을 공유 한다. 소정의 실시형태에서, 변형된 또는 조작된 hARSA 코딩 서열은 NCBI 참조 서열 중 하나에 대해 약 50%, 60%, 70%, 75%, 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98%, 99% 또는 99.9%의 동일성을 공유한 다. 본 명세서에 기재된 바와 같은 \"핵산\" 또는 \"뉴클레오타이드\"는 RNA, DNA 또는 이들의 변형일 수 있고, 단일 또 는 이중 가닥일 수 있으며, 예를 들어, 관심 있는 단백질을 암호화하는 핵산, 올리고뉴클레오타이드, 핵산 유사 체, 예를 들어, 펩타이드-핵산(peptide-nucleic acid: PNA), 유사상보성 PNA(pseudocomplementary PNA: pc- PNA), 잠금 핵산(locked nucleic acid: LNA) 등을 포함하는 군으로부터 선택될 수 있다. 이러한 핵산 서열은, 예를 들어, 전사 억제인자, 안티센스 분자, 리보자임, 예를 들어, RNAi, shRNAi, siRNA, 마이크로 RNAi(mRNAi), 안티센스 올리고뉴클레오타이드 등이지만 이로 제한되지 않는 작은 억제성 핵산 서열로서 작용하 는, 예를 들어, 단백질을 암호화하는 핵산 서열을 포함하지만 이들로 제한되지 않는다. 핵산 서열의 맥락에서 용어 \"동일성 백분율(%)\", \"서열 동일성\", \"서열 동일성 백분율\" 또는 \"동일한 백분율\"은 관련성을 위해서 정렬되는 경우 동일한 두 개의 서열에서의 잔기를 지칭한다. 서열 길이의 동일성 비교는 게놈 의 전장, 유전자 코딩 서열의 전장 또는 적어도 약 500개 내지 5000개의 뉴클레오타이드의 단편에 걸쳐 이루어 지는 것이 바람직할 수 있다. 그러나, 예를 들어, 적어도 약 9개의 뉴클레오타이드, 일반적으로 적어도 약 20개 내지 24개의 뉴클레오타이드, 적어도 약 28개 내지 32개의 뉴클레오타이드, 적어도 약 36개 이상의 뉴클레오타 이드의 더 작은 단편 간의 동일성이 또한 바람직할 수 있다. 동일성 백분율은 단백질의 전장, 폴리펩타이드, 약 32개의 아미노산, 약 330개의 아미노산, 또는 이들의 펩타이 드 단편 또는 상응하는 핵산 서열 코딩 서열에 걸친 아미노산 서열에 대하여 용이하게 결정될 수 있다. 적합한 아미노산 단편은 적어도 약 8개의 아미노산 길이일 수 있고, 최대 약 700개의 아미노산일 수 있다. 일반적으로,2개의 상이한 서열 사이의 \"동일성\", \"상동성\" 또는 \"유사성\"을 지칭하는 경우, \"동일성\", \"상동성\" 또는 \"유사 성\"은 \"정렬된\" 서열을 참조로 결정된다. \"정렬된\" 서열 또는 \"정렬\"은 종종 참조 서열과 비교하여 누락되거나 또는 추가적인 염기 또는 아미노산에 대한 교정을 포함하는 여러 핵산 서열 또는 단백질(아미노산) 서열을 지칭 한다. 정렬은 여러 가지 공개적으로 또는 상업적으로 입수 가능한 다중 서열 정렬 프로그램 중 임의의 것을 사용하여 수행된다. 서열 정렬 프로그램, 예를 들어, \"Clustal X\", \"Clustal Omega\", \"MAP\", \"PIMA\", \"MSA\", \"BLOCKMAKER\", \"MEME\" 및 \"Match-Box\" 프로그램이 아미노산 서열에 이용 가능하다. 일반적으로, 임의의 이들 프 로그램은 디폴트 설정으로 사용되지만, 당업자는 필요에 따라 이러한 설정을 변경할 수 있다. 대안적으로, 당업 자는 적어도 참조된 알고리즘 및 프로그램에 의해 제공되는 것과 같은 동일성 또는 정렬의 수준을 제공하는 또 다른 알고리즘 또는 컴퓨터 프로그램을 이용할 수 있다. 예를 들어, 문헌[J. D. Thomson et al, Nucl. Acids. Res., \"A comprehensive comparison of multiple sequence alignments\", 27:2682-2690 ]을 참조. 다중 서열 정렬 프로그램은 또한 핵산 서열에 대해 이용 가능하다. 이와 같은 프로그램의 예는 \"Clustal W\", \"Clustal Omega\", \"CAP Sequence Assembly\", \"BLAST\", \"MAP\" 및 \"MEME\"를 포함하며, 이들은 인터넷 웹 서버를 통해 접근 가능하다. 이와 같은 프로그램에 대한 다른 공급원은 당업자에게 알려져 있다. 대안적으로, Vector NTI 유틸리티가 또한 사용된다. 또한, 위에 기재된 프로그램에 포함된 것을 포함하여, 뉴클레오타이드 서열 동 일성을 측정하는 데 사용될 수 있는 당업계에 알려진 다수의 알고리즘이 있다. 또 다른 예로서, 폴리뉴클레오타 이드 서열은 GCG 버전 6.1의 프로그램인 Fasta™을 사용하여 비교될 수 있다. Fasta™은 질의 서열과 검색 서열 사이의 최상의 중복 영역의 정렬 및 서열 동일성 백분율을 제공한다. 예를 들어, 핵산 서열 사이의 서열 동일성 백분율은 참조에 의해 본 명세서에 원용되는 GCG 버전 6.1에서 제공되는 바와 같이 디폴트 매개변수(단어 크기 6, 득점 매트릭스에 대한 NOPAM 인자)와 함께 Fasta™를 사용하여 결정될 수 있다. II. 이염성 백질이영양증(MLD) 본 명세서에서 \"질환\"으로 지칭되는 아릴설파테이스 A(ARSA) 유전자의 돌연변이(들) 및/또는 기능성 아릴설파테 이스 A의 정상 수준의 결핍에 의해 야기되는 질환 또는 비정상적 병태, 예를 들어, 이염성 백질이영양증(MLD)을 치료하는데 유용한 rAAV, 벡터, 방법 및 조성물이 본 명세서에 제공된다. 예를 들어, omim.org/entry/250100 참 조. 이염성 백질이영양증(MLD)은 다음 유형으로 분류될 수 있다: 유아기형 MLD(전형적으로, 30개월 이전에 시작) 및 조기 유년기형 MLD(일반적으로, 30개월 내지 6세(6세 포함) 사이에 시작)를 포함하는 조기 발병 MLD; 조기 유년 기형 MLD 및 후기 유년기형 MLD(일반적으로, 16세를 포함하여 7세 및 16세 사이에 시작됨)를 포함하는 유년기형 MLD; 및 성인형 MLD(16세 이후에 발병). 후기 유아기형 MLD 환자는 운동 장애 및 인지 장애 모두를 나타내는 균 일한 신속하고 예측 가능한 저하와 함께 치명적인 질환 경과를 보인다(문헌[Kehrer et al., 2011a; Sessa et al., 2016]). 이 유아들 대부분은 5세 이전에 사망하며, 98명의 환자에서 평균 생존은 4.2세이고, 5년 생존율은 25%이다(문헌[Mahmood et al., 2010]). 조기 유년기형 MLD(30개월 내지 6세 사이에 증상 발병)가 있는 유아의 표현형은 후기 유아기형 MLD가 있는 유아의 표현형과 매우 유사하지만, 조기 유년기형 MLD 환자는 초기 질환 진 행이 덜 빠를 수 있다(문헌[Biffi et al., 2008; Chen et al., 2016; Sessa et al., 2016]). 그러나, 일단 명 백한 증상이 나타나면, 특히 조기 유년기형 MLD 환자가 독립적으로 걸을 수 있는 능력을 상실할 때, 이들의 질 환 경과는 후기 유아기형 MLD 환자만큼 빠르게 악화될 수 있다. 이들 유아는 또한 먼저 단독으로 또는 행동 및 인지 증상과 동시에 발생하는 신경근 장애를 갖는 후기 유아기형 MLD 환자와 유사한 징후 및 증상을 보인다(문 헌[Groeschel et al., 2011; Kehrer et al., 2014]). 조기 유년기형 및 후기 유아기형 표현형은 집합적으로 조 기 발병 MLD로 지칭된다(문헌[Sessa et al., 2016]). 소정의 실시형태에서, 본 명세서에 기재된 rAAV, 벡터, 조성물 및 방법은 MLD, 조기 발병 MLD, 유아기형 MLD, 후기 유아기형 MLD, 유년기형 MLD, 조기 유년기형 MLD, 후기 유년기형 MLD 또는 성인형 MLD를 치료하는데 유용 하다. 소정의 실시형태에서, 본 명세서에 기재된 rAAV, 벡터, 조성물 및 방법은 대상체에서 질환 증상을 개선하 고/하거나 질환 진행을 지연시킬 수 있다. 소정의 실시형태에서, 본 명세서에 기재된 rAAV, 벡터, 조성물 및 방 법은 후기 유아기형 및 조기 유년기형 MLD를 치료하는데 유용하다. 소정의 실시형태에서, 본 명세서에 기재된 rAAV, 벡터, 방법 또는 조성물의 대상체 또는 환자는 MLD를 갖거나 또는 MLD로 진단된다. 소정의 실시형태에서, 본 명세서에 기재된 rAAV, 벡터, 방법 또는 조성물의 대상체 또는 환자는 후기 유아기형 MLD 또는 조기 유년기형 MLD로 진단된다. MLD의 진단은 유전자 검사 및 생화학적 검사를 통해 이루어질 수 있다. 유전자 검사는 ARSA의 돌연변이를 확인할 수 있는 반면, 생화학적 검사는 설파테이스효소 활성 및 소변 설파타이드 배설을 포함한다. 자기 공명 영상(magnetic resonance imaging: MRI)은 MLD의 진단을 확인할 수 있다. MRI는 사람의 뇌의 영상을 보여주고, 수초(myelin)의 존재 및 부재를 보여줄 수 있다. MLD에 의해 영향을 받은 개체의 뇌에는 전형적인 수초 손실의 패턴이 있다. 질환이 진행됨에 따라, 영상은 뇌에 누적된 손상을 보여준다. 어린 유아의 경우, 초기 뇌 영상은 정상일 수 있다. 소정의 실시형태에서, 본 명세서에 기재된 rAAV, 벡터, 방법 또는 조성물의 대상체는 18세 미만(예를 들어, 약 1개월, 2개월, 3개월, 4개월, 5개월, 6개월, 7개월, 8개월, 9개월, 10개월, 11개월(들) 미만 또는 약 1세, 1.5 세, 2세, 2.5세, 3세, 3.5세, 4세, 4.5세, 5세, 5.5세, 6세, 6.5세, 7세, 7.5세, 8세, 8.5세, 9세, 9.5세, 10 세, 10.5세, 11세, 12세, 13세, 14세, 15세, 16세, 17세, 18세 미만)의 인간이다. 추가적으로 또는 대안적으로, 대상체는 신생아 또는 1개월 이상(예를 들어, 약 2개월, 3개월, 4개월, 5개월, 6개월, 7개월, 8개 월, 9개월, 10개월, 11개월(들) 이상, 또는 약 1세, 1.5세, 2세, 2.5세, 3세, 3.5세, 4세, 4.5세, 5세, 5.5세, 6세, 6.5세, 7세, 7.5세, 8세, 8.5세, 9세, 9.5세, 10세, 10.5세, 11세, 12세, 13세, 14세, 15세, 16세, 17세, 18세 이상)의 인간이다. 소정의 실시형태에서, 환자는 약 1개월, 2개월, 3개월, 4개월, 5개월, 6개월, 7개월, 8 개월, 9개월, 10개월, 11개월(들) 또는 약 1세, 1.5세, 2세, 2.5세, 3세, 3.5세, 4세, 4.5세, 5세, 5.5세, 6세, 6.5세, 7세, 7.5세, 8세, 8.5세, 9세, 9.5세, 10세, 10.5세, 11세, 12세, 13세, 14세, 15세, 16세, 17세, 18세이다. 소정의 실시형태에서, 환자는 약 30개월 내지 약 7세이다. 소정의 실시형태에서, 환자는 약 30개월 내지 16세, 7세 내지 16세 또는 16세 내지 40세이다. 본 명세서에서 상호교환적으로 사용되는 \"환자\" 또는 \"대상체\"는 인간, 수의 또는 농장 동물, 가축 또는 반려동 물 및 임상 연구에 일반적으로 사용되는 동물을 포함하여 수컷 또는 암컷 포유동물을 의미한다. 일 실시형태에 서, 이러한 rAAV, 벡터, 방법 및 조성물의 대상체는 인간 환자이다. 일 실시형태에서, 이러한 rAAV, 벡터, 방법 및 조성물의 대상체는 남성 또는 여성 인간이다. 소정의 실시형태에서, 이러한 rAAV, 벡터, 방법 및 조성물의 대상체는 이염성 백질이영양증 및/또는 이염성 백질이영양증의 증상을 갖는 것으로 진단된다. 질환 증상(예를 들어, MLD가 없는 건강한 대조군과 비교한 MLD 증상)은 다음을 포함하지만 이들로 제한되지 않 을 수 있다: ARSA의 감소된 농도 및/또는 수준 및/또는 생물학적 활성(예를 들어, 혈청 또는 CSF에서), 증가된 소변 설파타이드, CNS 수초화(탈수초화 로딩 및 패턴), MRI에 의해 측정된 백질 위축, 비정상적(감소된 또는 증 가된) 뉴런 대사산물 N-아세틸아스파테이트(N-acetylaspartate: NAA), 미오-이노시톨(myo-inositol: mI), 콜린 (Cho) 및/또는 락테이트(Lac) 수준(예를 들어, 양성자 자기공명 분광법(MRS)에 의해 측정됨), 증가된 CSF 설파 타이드 및 리소-설파타이드 수준, 비정상적 시각적 유발 전위(Visual evoked potential: VEP), 비정상적 뇌간 청각 유발 반응(abnormal Brainstem auditory evoked response: BAER), 담낭벽 비후(예를 들어, 초음파 평가를 통해); 손상된 운동 기능(예를 들어, 이염성 백질이영양증(GMFC-MLD)에 대한 대근육 운동 기능 분류(Gross Motor Function Classification) 또는 대근육 운동 기능 측정(Gross Motor Function Measure: GMFM))에 의해 측정됨), 운동 마일스톤(milestone)을 유지하거나 또는 획득하는 유아의 달성시 연령, 상실시 연령 및 백분율에 의해 평가되는 지연된 운동 마일스톤 달성(세계 보건 기구[World Health Organization: WHO] 기준에 의해 정의 됨), 인지 기능 장애(예를 들어, 문헌[유아 발달의 베일리 척도[BSID - III], 유아용 웩슬러 지능 척도, 제5판 [WISC-V]]에 의해 측정되는 전체 지능 지수[Total Intelligence Quotient: IQ] 및 서브-도메인 IQ), 증가된 수 명(환자에 비해), 신경학적 임상 검사(Neurological clinical exam: NCE)의 비정상적 결과, 척골 신경, 비골 신경, 정중 신경, 비복 신경의 감소된 신경 전도 속도(NCV), 증상 일지(seizure diary)에 의해 포착된 발작의 더 이른 발병 연령 및 더 높은 빈도, 행동 기능 장애(예를 들어, 바인랜드 적응행동 검사(Vineland Adaptive Behavior Scale) 3판(바인랜드-III)에 의해 측정됨), 로어 랜스키 수행 인덱스(Lansky Performance Index), 감 소된 소아의 삶의 질 측정도구(Pediatric Quality of Life Inventory)(예를 들어, PedsQL 및 PedsQL-IS) 및/또 는 감소된 후견인/부모의 삶의 질. 소정의 실시형태에서, 질환 증상(예를 들어, MLD가 없는 건강한 대조군과 비교한 MLD 증상)은 비정상적 특성(예 를 들어, 바이오마커 활성, 전기생리학적 활성 및/또는 영상 매개변수) 및 임상적 관찰(예를 들어, 손상된 대근 육 및 소근육 운동 기능, 손상된 인지 및 언어 발달, 비정상적 신경학적 검사 결과, 손상된 행동 및 마일스톤 발달 및 후견인/부모-보고 결과 및 감소된 삶의 질 평가)을 포함할 수 있다. 비정상적 특성은 수초-생성 희소돌기아교세포 및 슈반 세포의 기능적 손상, 말초 신경 전도 이상, 느린 신경 전 도 속도(NCV)를 갖는 말초 신경병증, 전형적인 백질(예를 들어, 뇌량의 팽대 및 두정후두부 백질, 투사 섬유, 소뇌 백질, 기저핵 및 시상) 패턴(예를 들어, 비정상적 백질 내에서 정상적인 신호 강도의 밴드를 가진 방사 줄 무늬의 \"호반 패턴(tigroid pattern)\", 예를 들어, 문헌[Gieselmann and Krageloh-Mann, 2010; Martin et al., 2012; van Rappard et al., 2015)]을 참조)을 보여주는 뇌 자기 공명 영상(MRI); U-섬유 관련 및 소뇌 변화,백질 탈수초화, 특히 전두엽에서의 백질 저밀도의 양측 영역 및 수초의 손실을 반영하는 대뇌 위축), 뇌 바이오 마커 N-아세틸아스파테이트 및 미오-이노시톨의 비정상적인 수준을 포함하지만, 이들로 제한되지 않는다. 임상적 관찰은 부자연스러움, 발가락 걷기 및 빈번한 낙상으로 나타나는 대근육 운동 장애; 소근육 운동 능력; 보행 이상; 경련성 하반신마비 또는 운동실조; 신경근 장애; 신경학적 증상(쇠약의 징후, 경련 및 요실금으로 진행되는 조정 능력의 상실); 근긴장저하 및 억제된 심부반사; 발작; 치매; 간질; 배뇨 경련의 어려움; 수유 장 애; 사지의 통증; 손상된 언어 기능; 손상된 인지 능력; 손상된 시력 및 청력; 이전에 획득한 운동 및 인지 마 일스톤 상실; 학업 또는 업무 수행의 저하, 주의력 결핍, 비정상적 행동, 정신병적 증상, 지적 장애, 통제되지 않은 웃음, 피질 장애(예를 들어, 실행증(apraxia), 실어증(aphasia), 실인증(agnosia)), 알코올 또는 약물 사 용, 부적절한 금전 관리, 정서적 불안정, 부적절한 감정 및 신경정신병적 증상(정신병, 조현병, 망상 및 환각을 포함)을 포함하지만, 이들로 제한되지 않는다. 질환 진행은 질환 증상의 대상체의 발병 연령, 출현 빈도, 중증도 또는 재발을 지칭한다. 질환 진행의 지연은 일반적으로 질환 증상의 상승된 발병 연령, 더 낮은 출현 빈도, 감소된 중증도 또는 재발 감소를 의미한다. 위에 기재된 바와 같은 용어 \"증가시키다\", \"줄이다\", \"감소시키다\", \"개선하다(ameliorate)\", \"상승시키다\", \"낮은\", \"높은\", \"덜\", \"더\", \"개선하다(improve)\", \"지연시키다\", \"손상시키다\", \"비정상적인\", \"두꺼운\" 또 는 이들의 임의의 문법적 변형 또는 임의의 유사한 용어는 변화를 나타내며, 달리 명시되지 않는 한 상응하는 참조(예를 들어, 처리하지 않은 대조군 또는 MLD가 없는 정상 상태의 대상체)와 비교하여 약 5배, 약 2배, 약 1 배, 약 90%, 약 80%, 약 70%, 약 60%, 약 50%, 약 40%, 약 30%, 약 20%, 약 10%, 약 5%의 변화를 의미한다. 본 명세서의 조성물 및 방법은 치료 기준이 존재하지 않는(HSCT 및 HSC-GT가 효과적이지 않음) 증상이 있는 조 기 발병 환자에게 속효성(fast-acting)의 질환-완화적 치료를 제공하고; 그리고/또는 CNS 병리 및 말초 신경 기 능을 모두 보존하거나 또는 교정할 수 있는 요법을 제공하며, 후자는 HSCT에 의해 교정되지 않으며 진행성 미세 및 대근육 운동 기능 손실 및 호흡 부전을 유발하고; 그리고/또는 강력한 골수 소멸성 전처치를 필요로 하고, 증상의 발병 전에 수행될 때에만 효과적이며, 모든 환자에서 말초 신경병증을 실질적으로 해결하지 않을 수 있 는 HSC-GT에 대한 대안적인 치료 옵션을 제공한다. 소정의 실시형태에서, 환자는 본 명세서에 기재된 rAAV, 벡터, 조성물 또는 방법 없이는 적격하지 않았을 공동- 요법을 투여받는다. 이러한 공동-요법은 제대혈(UCB), 동종이계 말초 혈액 줄기 세포 또는 동종이계 골수를 통 한 효소 대체 요법(ERT) 및 조혈 줄기 세포 이식(HSCT)을 포함할 수 있다. 선택적으로, 면역억제제 공동-요법은 이를 필요로 하는 대상체에 사용될 수 있다. 이러한 공동-요법을 위한 면 역억제제는 글루코코르티코이드, 스테로이드, 항대사물질, T-세포 저해제, 마크롤라이드(예를 들어, 라파마이신 또는 라파로그) 및 알킬화제를 포함한 세포 정지제, 항-대사물질, 세포독성 항생제, 이뮤노필린에 활성인 항체 또는 작용제를 포함하지만, 이들로 제한되지 않는다. 면역 억제제는 나이트로겐 머스타드, 나이트로소우레아, 백금 화합물, 메토트렉세이트, 아자티오프린, 머캅토퓨린, 플루오로우라실, 닥티노마이신, 안트라주기린, 마이 토마이신 C, 블레오마이신, 미트라마이신, IL-2 수용체-(CD25-) 또는 CD3-지시 항체, 항-IL-2 항체, 주기로스포 린, 타크롤리무스, 시롤리무스, IFN-β, IFN-γ, 오피오이드 또는 종양 괴사 인자-알파(tumor necrosis factor-alpha: TNF-α) 결합제를 포함할 수 있다. 소정의 실시형태에서, 면역억제제 요법은 유전자 요법 투여 전 또는 후에 0일, 1일, 2일, 3일, 4일, 5일, 6일, 7일 이상에 시작될 수 있다. 이러한 면역억제제 요법은 1개, 2개 이상의 약물(예를 들어, 글루코코르티코이드, 프레드니손, 마이코페놀레이트 모페틸(micophenolate mofetil: MMF) 및/또는 시롤리무스(즉, 라파마이신))의 투여를 포함할 수 있다. 이러한 면역억제성 약물은 동일 한 용량 또는 조정된 용량으로 1회, 2회 또는 더 많은 횟수로 필요로 하는 대상체에 투여될 수 있다. 이러한 요 법은 같은 날 두 가지 이상의 약물(예를 들어, 프레드니손, 마이코페놀레이트 모페틸(MMF) 및/또는 시롤리무스 (즉, 라파마이신))의 공동-투여를 포함할 수 있다. 이들 약물 중 하나 이상은 유전자 요법 투여 후, 동일한 용 량 또는 조정된 용량으로 계속될 수 있다. 이러한 요법은 필요에 따라 약 1주(7일), 약 60일 또는 그 이상일 수 있다. 소정의 실시형태에서, 타크롤리무스 무함유 양생법이 선택된다. III. 발현 카세트 기능성 hARSA 단백질을 암호화하는 hARSA 코딩 서열 및 발현 카세트라고도 지칭되는 표적 세포에서 hARSA 발현 을 지시하는 제어 서열을 포함하는 핵산 서열이 본 명세서에 제공된다. 본 명세서에서 사용되는 바와 같이, \"발 현 카세트\"는 코딩 서열(예를 들어, hARSA 코딩 서열), 프로모터를 포함하는 핵산 분자를 지칭하며, 이를 위한 다른 제어 서열을 포함할 수 있다. 필요한 제어 서열은 표적 세포에서 이의 전사, 번역 및/또는 발현을 허용하는 방식으로 hARSA 코딩 서열에 작동 가능하게 연결된다. 본 명세서에서 사용되는 바와 같이, \"작동 가능하게 연결된\" 서열은 hARSA 코딩 서열과 인접한 발현 제어 서열 및 hARSA 코딩 서열을 제어하기 위해 트랜스로 또는 거리를 두고 작용하는 발현 제어 서열 둘 다를 포함한다. 이러한 제어 서열은 전형적으로, 예를 들어, 프로모터, 인핸서, 인트론, 코작(Kozak) 서열, 폴리아데닐화 서열 및 TATA 신호 중 하나 이상을 포함한다. 소정 의 실시형태에서, 프로모터는 사이토메갈로바이러스 인핸서(CB7) 프로모터(예를 들어, 서열번호 5의 198번 nt 내지 862번 nt, 본 명세서에서 hSyn 또는 Syn로도 지칭됨)를 갖는 닭 베타 액틴 프로모터이다. 그러나, 소정의 실시형태에서, 다른 프로모터 또는 추가적인 프로모터가 선택될 수 있다. 소정의 실시형태에서, 제어 서열은 표적 세포에서 hARSA 발현을 지시한다. 소정의 실시형태에서, 표적 세포는 신경계 세포, 희소돌기아교세포, 미세아교세포, 중추 신경계(CNS) 세포, CNS의 뉴런, 말초 신경계(PNS) 세포, 슈반 세포, PNS의 대식세포 또는 내장 기관의 세포(예를 들어, 신장 세포, 간 세포 및 담낭 세포)이다. 소정의 실시형태에서, 표적 세포는 중추 신경계 세포일 수 있다. 소정의 실시형태에서, 표적 세포는 흥분성 뉴런, 억제 성 뉴런, 신경교 세포, 피질 세포, 전두 피질 세포, 대뇌 피질 세포, 척수 세포 중 하나 이상이다. 소정의 실시 형태에서, 표적 세포는 말초 신경계(PNS) 세포, 예를 들어, 망막 세포이다. 단핵구, B 림프구, T 림프구, NK 세 포, 림프절 세포, 편도선 세포, 골수 중간엽 세포, 줄기 세포, 골수 줄기 세포, 심장 세포, 상피 세포, 식도 세 포, 위 세포, 태아로부터 잘라낸 세포, 결장 세포, 직장 세포, 간 세포, 신장 세포, 폐 세포, 침샘 세포, 갑상 선 세포, 부신 세포, 유방 세포, 췌장 세포, 랑게르한스섬 세포, 담낭 세포, 전립선 세포, 방광 세포, 피부 세 포, 자궁 세포, 자궁경부 세포, 고환 세포 또는 MLD가 없는 대상체에서 기능성 hARSA 단백질을 발현하는 임의의 다른 세포와 같은 신경계로부터의 세포 이외의 다른 세포도 또한 표적 세포로 선택될 수 있다. genecards.org/cgi-bin/carddisp.pl?gene=ARSA&keywords=arsa#expression 참조. 소정의 실시형태에서, 제어 서열은 유비쿼터스 프로모터, 예를 들어, CB7 프로모터를 포함한다. 소정의 실시형 태에서, 조절 요소는 코작 서열, 폴리아데닐화 서열, 인트론, 인핸서 및 TATA 신호 중 하나 이상을 포함한다. 소정의 실시형태에서, 추가적인 또는 대안적인 프로모터 서열은, 예를 들어, 선택된 5' ITR 서열과 코딩 서열 사이에 위치한 발현 제어 서열(제어 서열)의 일부로서 포함될 수 있다. 구성적 프로모터, 조절 가능한 프로모터 [예를 들어, WO 2011/126808 및 WO 2013/04943 참조], 조직 특이적 프로모터 또는 생리학적 자극(cue)에 반응 하는 프로모터가 본 명세서에 기재된 벡터에 이용될 수 있다. 프로모터(들)는 상이한 공급원, 예를 들어, 인간 사이토메갈로바이러스(CMV) 급초기 인핸서/프로모터, SV40 조기 인핸서/프로모터, JC 폴리모바이러스 프로모터, 수초 염기성 단백질(myelin basic protein: MBP) 또는 신경교 원섬유성 산성 단백질(glial fibrillary acidic protein: GFAP) 프로모터, 단순 포진 바이러스(HSV-1) 잠복 관련 프로모터(latency associated promoter: LAP), 라우스 육종 바이러스(rouse sarcoma virus: RSV) 긴말단 반복부(long terminal repeat : LTR) 프로모터, 뉴런-특이적 프로모터(neuron-specific promoter: NSE), 혈소판 유래 성장 인자(platelet derived growth factor: PDGF) 프로모터, hSYN, 멜라닌-농축 호르몬(melanin-concentrating hormone: MCH) 프로모터, CBA, 기질 금속단백질 프로모터(matrix metalloprotein promoter: MPP) 및 닭 베타-액틴 프로모터로부터 선택 될 수 있다. 프로모터에 더하여, 발현 카세트는 하나 이상의 다른 적절한 전사 개시 서열, 전사 종결 서열, 인핸서 서열, 스 플라이싱 및 폴리아데닐화(폴리A) 신호와 같은 효율적인 RNA 처리 신호; 세포질 mRNA를 안정화하는 서열, 예를 들어, WPRE; 번역 효율(즉, 코작 컨센서스 서열)을 향상시키는 서열; 단백질 안정성을 향상시키는 서열; 및 원 하는 경우, 암호화된 생성물의 분비를 향상시키는 서열을 포함할 수 있다. 적합한 인핸서의 예는 CMV 인핸서이 다. 다른 적합한 인핸서는 목적하는 표적 조직 적응증에 적절한 인핸서를 포함한다. 일 실시형태에서, 제어 서 열은 하나 이상의 발현 인핸서를 포함한다. 일 실시형태에서, 제어 서열은 2개 이상의 발현 인핸서를 포함한다. 이들 인핸서는 동일할 수 있거나 또는 서로 상이할 수 있다. 예를 들어, 인핸서는 CMV 급초기 인핸서(서열번호 19)를 포함할 수 있다. 이 인핸서는 서로 인접하게 위치한 두 개의 카피로 존재할 수 있다. 대안적으로, 인핸서 의 이중 카피는 하나 이상의 서열에 의해 분리될 수 있다. 또 다른 실시형태에서, 발현 카세트는 인트론, 예를 들어, 닭 베타-액틴 인트론(서열번호 17)을 더 포함한다. 소정의 실시형태에서, 인트론은 인간 베타-글로빈 스 플라이스 공여체 및 면역글로불린 G(IgG) 스플라이스 억셉터 요소로 구성된 하이브리드 인트론인 키메라 인트론 (chimeric intron: CI)이다. 다른 적합한 인트론은, 예를 들어, WO 2011/126808에 기술된 것들과 같은 당업계 에 공지된 것들을 포함한다. 적합한 폴리A 서열의 예는, 예를 들어, 토끼 글로빈 폴리 A, SV40, SV50, 소 성장 호르몬(bovine growth hormone: bGH), 인간 성장 호르몬 및 합성 폴리A를 포함한다. 선택적으로, mRNA를 안정 화하기 위해 하나 이상의 서열이 선택될 수 있다. 이러한 서열의 예는 조작된 폴리A 서열의 상류 및 코딩 서열 의 하류일 수 있는 변형된 WPRE 서열이다(예를 들어, 문헌[MA Zanta-Boussif, et al, Gene Therapy 16:605-619] 참조). 소정의 실시형태에서, WPRE 서열은 존재하지 않는다. 선택적으로, 소정의 실시형태에서, hARSA 코딩 서열에 더하여, 또 다른 비-AAV 코딩 서열, 예를 들어, 펩타이드, 폴리펩타이드, 단백질, 기능성 RNA 분자(예를 들어, miRNA, miRNA 저해제) 또는 관심 있는 다른 유전 자 산물이 포함될 수 있다. 유용한 유전자 산물은 miRNA를 포함할 수 있다. miRNA 및 기타 작은 간섭 핵산은 표 적 RNA 전사체 절단/분해 또는 표적 메신저 RNA(mRNA)의 번역 억제를 통해 유전자 발현을 조절한다. miRNA는 전 형적으로 최종 19개 내지 25개의 비-번역된 RNA 생성물로 고유하게 발현된다. miRNA는 표적 mRNA의 3' 비번역 영역(UTR)과의 서열-특이적 상호작용을 통해 활성을 나타낸다. 이러한 내인성으로 발현된 miRNA는 헤어핀 전구 체를 형성하고, 이는 후속적으로 miRNA 듀플렉스로 처리되고, 추가로 \"성숙\" 단일 가닥 miRNA 분자로 처리된다. 이러한 성숙 miRNA는 성숙 miRNA에 대한 상보성을 기반으로 표적 mRNA의 표적 부위, 예를 들어, 3' UTR 영역을 식별하는 다중단백질 복합체인 miRISC를 안내한다. 소정의 실시형태에서, 발현 카세트는 CNS 또는 말초 배근신경절에서 발현 수준을 조절하기 위해 후근 신경절 (drg)-특이적 miRNA 탈표적화 서열을 더 포함할 수 있다. 소정의 실시형태에서, 발현 카세트 또는 벡터 게놈은 유전자 산물 코딩 서열에 대한 번역되지 않은 영역(UTR) 3'에 하나 이상의 miRNA 표적 서열을 포함한다. 소정의 실시형태에서, miR-183, miR-182 또는 miR-96에 특이적인 적어도 하나의 표적 서열이 있다. 소정의 실시형태에 서, 적어도 2개의 drg-특이적 miRNA 표적 서열은 hARSA 코딩 서열의 5' 및 3' 둘 다에 위치한다. 소정의 실시형 태에서, 발현 카세트 mRNA 또는 DNA 양성 가닥에 대한 적어도 제1 및/또는 적어도 제2 miRNA 표적 서열에 대한 miRNA 표적 서열은 (i) AGTGAATTCTACCAGTGCCATA(miR183, 서열번호 20); (ii) AGCAAAAATGTGCTAGTGCCAAA(서열번 호 21), (iii) AGTGTGAGTTCTACCATTGCCAAA(서열번호 22); 및 (iv) AGGGATTCCTGGGAAAACTGGAC(서열번호 23)로부터 선택된다. 소정의 실시형태에서, 작제물은 동일하거나 상이할 수 있는 적어도 제1 miRNA 표적 서열 및 적어도 제2 miRNA 표적 서열을 포함하는 적어도 2개의 탠덤 반복부를 추가로 포함한다. 소정의 실시형태에서, 탠덤 miRNA 표적 서열은 연속적이거나 또는 1개 내지 10개의 핵산의 스페이서에 의해 분리되되, 상기 스페이서는 miRNA 표적 서열이 아니다. 소정의 실시형태에서, hARSA 코딩 서열의 3'에 위치한 적어도 2개의 drg-특이적 miRNA 표적 서열이 존재한다. 소정의 실시형태에서, 적어도 2개의 drg-특이적 miRNA 탠덤 반복부 중 첫 번째 시 작은 hARSA-코딩 서열의 3' 말단으로부터 20개 뉴클레오타이드 이내이다. 소정의 실시형태에서, 적어도 2개의 drg-특이적 miRNA 탠덤 반복부 중 첫 번째의 시작은 hARSA-코딩 서열의 3' 말단으로부터 적어도 100개의 뉴클레 오타이드이다. 소정의 실시형태에서, miRNA 탠덤 반복부는 200개 내지 1200개의 뉴클레오타이드 길이를 포함한 다. 소정의 실시형태에서, hARSA 코딩 서열의 5'에 위치한 적어도 2개의 drg-특이적 miRNA 표적 서열이 존재한 다. 소정의 실시형태에서, 2개 이상의 연속적인 miRNA 표적 서열은 연속적이며, 스페이서에 의해 분리되지 않는 다. 소정의 실시형태에서, 2개 이상의 miRNA 표적 서열은 스페이서에 의해 분리되며, 각각의 스페이서는 (A) GGAT; (B) CACGTG; 또는 (C) GCATGC 중 하나 이상으로부터 독립적으로 선택된다. 소정의 실시형태에서, miRNA 표적 서열 사이에 위치한 스페이서는 첫 번째 miRNA 표적 서열의 3' 및/또는 마지막 miRNA 표적 서열의 5'에 위 치할 수 있다. 소정의 실시형태에서, miRNA 표적 서열 사이의 스페이서는 동일하다. 참조에 의해 본 명세서에 원용되어 있는 2018년 12월 21일자로 출원된 미국 특허 가출원 제62/783,956 및 2019 년 12월 20일자로 출원된 국제 특허 PCT/US2019/067872 참조. 소정의 실시형태에서, miR 서열은 발현 카세트 또 는 벡터 게놈에 포함되지 않는다. IV. AAVhu68 AAVhu68.CB7.CI.hARSAco.RBG에 대한 캡시드로서 선택된 AAVhu68 혈청형은 AAV9에 대한 아미노산 수준에서 99% 동일하다. AAVhu68은 AAV9에 필적하는 NHP 및 마우스의 신경계에서의 형질도입 특성을 나타낸다. 이는 피질 뉴 런(데이터 미제시) 및 수초-생성 희소돌기아교세포의 작은 하위집단의 광범위한 형질도입을 포함한다. 또한, AAVhu68은 PNS로 돌출된 엑손이 있는 운동 뉴런 및 척수 및 말초 신경으로 돌출된 엑손이 있는 DRG 감각 뉴런을 형질도입한다(데이터 미제시). 형질도입은 복측 각의 하부 운동 뉴런과 DRG의 감각 뉴런에서 관찰되었다. 형질 도입된 운동 뉴런은 말초 신경에 기여하는 엑손이 있다. 따라서, AAVhu68 캡시드는 MLD 환자에서 둘 다 영향을 받는 CNS 및 PNS의 세포를 표적으로 한다. 추가적으로, 새로 합성된 ARSA는 트랜스-골지 네트워크에서 라이소솜 으로 직접 수송될 수 있지만, 이는 만노스-6-포스페이트 수용체를 통해 분비되어 다른 세포에 의해 흡수될 수도 있으며, 이는 후속적으로 라이소솜으로 전달된다. 따라서, 근본적인 결함은 기능성 효소가 결여되어 있는 CNS의 이웃 세포에 공급되는 ARSA 효소를 발현하는 rAAVhu68.hARSA에 의해 교차-교정될 수 있다. AAVhu68(이전에는 AAV3G2로 지칭됨)은 서열번호 7의 넘버링을 기준으로 vp1의 67번 및 157번 위치에서의 두 개 의 암호화된 아미노산에 의해 또 다른 클레이드 F 바이러스 AAV9와 다르다. 대조적으로, 다른 클레이드 FAAV(AAV9, hu31, hu31)는 67번 위치에 Ala 및 157번 위치에 Ala를 갖는다. 서열번호 7의 넘버링을 기준으로 157번 위치에 발린(Val 또는 V) 및 선택적으로, 서열번호 7의 넘버링을 기준으로 67번 위치에 글루탐산(Glu 또 는 E)을 갖는 신규한 AAVhu68 캡시드 및/또는 조작된 AAV 캡시드가 제공된다. 소정의 실시형태에서, AAV 캡시드 스테레오타입은 AAVhu31 vp1(서열번호 11 및 서열번호 12) 또는 AAVhu32 vp1(서열번호 13 및 서열번호 14)로부 터 선택될 수 있다. 본 명세서에서 사용되는 바와 같이, AAV 그룹과 관련된 용어 \"클레이드\"는 AAV vp1 아미노산 서열의 정렬을 기 반으로 하여, (적어도 1000개의 복제물의) 적어도 75%의 부트스트랩(bootstrap) 값 및 0.05 이하의 포아송 보정 거리(Poisson correction distance) 측정에 의해 이웃-연결 알고리즘(Neighbor-Joining algorithm)을 사용하여 결정될 때 계통발생적으로 서로 관련된 AAV 그룹을 지칭한다. 이웃-연결 알고리즘은 문헌에 기재되어 있다. 예 를 들어, 문헌[M. Nei and S. Kumar, Molecular Evolution and Phylogenetics (Oxford University Press, New York ] 참조. 이러한 알고리즘을 시행하기 위해 사용될 수 있는 컴퓨터 프로그램이 이용 가능하다. 예를 들어, MEGA v2.1 프로그램은 변형된 Nei-Gojobori 방법을 시행한다. 이러한 기법과 컴퓨터 프로그램 및 AAV vp1 캡시드 단백질의 서열을 사용하여, 당업자는 선택된 AAV가 본 명세서에서 확인된 클레이드 중 하나에 포함되는 지, 다른 클레이드에 포함되는지 또는 이들 클레이드 외부에 있는지 여부를 용이하게 결정할 수 있다. 예를 들 어, 클레이드 A, B, C, D, E 및 F를 식별하고, 신규한 AAV의 핵산 서열, GenBank 등록 번호 AY530553 내지 AY530629를 제공하는 문헌[G Gao, et al, J Virol, 2004 Jun; 78: 6381-6388]을 참조한다. 또한, WO 2005/033321 참조. 소정의 실시형태에서, AAVhu68 캡시드는 다음 중 하나 이상에 의해 추가로 특징지어진다. AAVhu68 캡시드 단백 질은 서열번호 7의 1번 내지 736번의 예상되는 아미노산 서열을 암호화하는 핵산 서열로부터의 발현에 의해 생 성된 AAVhu68 vp1 단백질, 서열번호 6으로부터 생성된 vp1 단백질 또는 서열번호 7의 1번 내지 736의 예상되는 아미노산 서열을 암호화하는 서열번호 6과 적어도 70% 동일한 핵산 서열로부터 생성된 vp1 단백질; 서열번호 7 의 적어도 약 138번 내지 736번 아미노산의 예상되는 아미노산 서열을 암호화하는 핵산 서열로부터의 발현에 의 해 생성된 AAVhu68 vp2 단백질, 서열번호 6의 적어도 412번 내지 2211번 뉴클레오타이드를 포함하는 서열로부터 생성된 vp2 단백질 또는 서열번호 7의 적어도 약 138번 내지 736번 아미노산의 예상되는 아미노산 서열을 암호 화하는 서열번호 6의 적어도 412번 내지 2211번 뉴클레오타이드와 적어도 70% 동일한 핵산 서열로부터 생성된 vp2 단백질; 및/또는 서열번호 7의 적어도 약 203번 내지 736번 아미노산의 예상되는 아미노산 서열을 암호화하 는 핵산 서열로부터의 발현에 의해 생성된 AAVhu68 vp3 단백질, 서열번호 6의 적어도 607번 내지 2211번 뉴클레 오타이드를 포함하는 서열로부터 생성된 vp3 단백질 또는 서열번호 7의 적어도 약 203번 내지 736번 아미노산의 예상되는 아미노산 서열을 암호화하는 서열번호 6의 적어도 607번 내지 2211번 뉴클레오타이드와 적어도 70% 동 일한 핵산 서열로부터 생성된 vp3 단백질을 포함한다. AAVhu68 vp1, vp2 및 vp3 단백질은 전형적으로 전장 vp1 아미노산 서열(1번 내지 736번 아미노산)을 암호화하는 동일한 핵산 서열에 의해 암호화되는 대안적인 스플라이스 변이체로서 발현된다. 선택적으로, vp1-암호화 서열 은 vp1, vp2 및 vp3 단백질을 발현시키기 위해 단독으로 사용된다. 대안적으로, 이 서열은 vp1-고유 영역(약 1 번 aa 내지 약 137번 aa) 및/또는 vp2-고유 영역(약 1번 aa 내지 약 202번 aa)이 없는 AAVhu68 vp3 아미노산 서열(약 203번 내지 736번 aa)을 암호화하는 핵산 서열, 또는 이에 상보적인 가닥, 상응하는 mRNA 또는 tRNA(예 를 들어, 서열번호 6의 약 607번 뉴클레오타이드(nt) 내지 약 2211번 nt로부터 번역된 mRNA), 또는 서열번호 7 의 203번 내지 736번 aa를 암호화하는 서열번호 6과 적어도 70% 내지 적어도 99%(예를 들어, 적어도 85%, 적어 도 90%, 적어도 95%, 적어도 97%, 적어도 98% 또는 적어도 99%) 동일한 서열 중 하나 이상과 공동 발현될 수 있 다. 추가적으로 또는 대안적으로, vp1-암호화 및/또는 vp2-암호화 서열은 vp1-고유 영역(약 1번 내지 약 137번 aa)이 없는 서열번호 7의 AAVhu68 vp2 아미노산 서열(약 138번 내지 736번 aa)을 암호화하는 핵산 서열, 또는 이에 상보적인 가닥, 상응하는 mRNA 또는 tRNA(예를 들어, 서열번호 6의 412번 내지 2211번 nt로부터 번역된 mRNA), 또는 서열번호 7의 약 138번 내지 736번 aa을 암호화하는 서열번호 6과 적어도 70% 내지 적어도 99%(예 를 들어, 적어도 85%, 적어도 90%, 적어도 95%, 적어도 97%, 적어도 98% 또는 적어도 99%) 동일한 서열과 공동 발현될 수 있다. 본 명세서에 개시된 바와 같이, rAAVhu68은 서열번호 7의 vp1 아미노산 서열을 암호화하는 AAVhu68 핵산 서열로 부터 캡시드를 발현하는 생산 시스템에서 생성되는 rAAVhu68 캡시드 및 선택적으로, 예를 들어, vp1 및/또는 vp2-고유 영역이 없는 vp 3 단백질을 암호화하는 추가적인 핵산 서열을 갖는다. 단일 핵산 서열 vp1을 사용하는 생산으로부터 생성된 rAAVhu68은 vp1 단백질, vp2 단백질 및 vp3 단백질의 이종 집단을 생성한다. 더욱 상세하 게는, AAVhu68 캡시드는 서열번호 7의 예상되는 아미노산 잔기로부터 변형을 갖는 vp1 단백질 내, vp2 단백질내 및 vp3 단백질 내 하위집단을 포함한다. 이들 하위집단은 최소한 탈아마이드화된 아스파라긴(N 또는 Asn) 잔 기를 포함한다. 예를 들어, 아스파라긴 - 글리신 쌍의 아스파라긴은 고도로 탈아마이드화되어 있다. 일 실시형태에서, AAVhu68 vp1 핵산 서열은 서열번호 6의 서열 또는 이에 상보적인 가닥, 예를 들어, 상응하는 mRNA 또는 tRNA를 갖는다. 소정의 실시형태에서, vp2 및/또는 vp3 단백질은, 예를 들어, 선택된 발현 시스템에 서 vp 단백질의 비를 변경하기 위해 vp1과 상이한 핵산 서열로부터 추가적으로 또는 대안적으로 발현될 수 있다. 소정의 실시형태에서, vp1-고유 영역(약 1번 aa 내지 약 137번 aa) 및/또는 vp2-고유 영역(약 1번 aa 내 지 약 202번 aa)이 없는 서열번호 7의 AAVhu68 vp3 아미노산 서열(약 203번 내지 736번 aa)을 암호화하는 핵산 서열, 또는 이에 상보적인 가닥, 상응하는 mRNA 또는 tRNA(서열번호 6의 약 607번 nt 내지 약 2211번 nt)가 또 한 제공된다. 소정의 실시형태에서, vp1-고유 영역(약 1번 내지 약 137번 aa)이 없는 서열번호 7(약 138번 내지 736번 aa)의 AAVhu68 vp2 아미노산 서열을 암호화하는 핵산 서열, 또는 이에 상보적인 가닥, 상응하는 mRNA 또 는 tRNA(서열번호 6의 412번 내지 2211번 nt)가 또한 제공된다. 그러나, 서열번호 7의 아미노산 서열을 암호화하는 다른 핵산 서열이 rAAVhu68 캡시드를 생성하는데 사용하기 위해 선택될 수 있다. 소정의 실시형태에서, 핵산 서열은 서열번호 6의 핵산 서열 또는 서열번호 7을 암호화하 는 서열번호 6과 적어도 70% 내지 99% 동일한, 적어도 75%, 적어도 80%, 적어도 85%, 적어도 90%, 적어도 95%, 적어도 97%, 적어도 99% 동일한 서열을 갖는다. 소정의 실시형태에서, 핵산 서열은 서열번호 6의 핵산 서열 또 는 서열번호 7의 vp2 캡시드 단백질(약 138번 내지 736번 aa)을 암호화하는 서열번호 6의 약 412번 nt 내지 약 2211번 nt와 적어도 70% 내지 99%, 적어도 75%, 적어도 80%, 적어도 85%, 적어도 90%, 적어도 95%, 적어도 97%, 적어도 99% 동일한 서열을 갖는다. 소정의 실시형태에서, 핵산 서열은 서열번호 6의 약 607번 nt 내지 약 2211번 nt의 핵산 서열 또는 서열번호 7의 vp3 캡시드 단백질(약 203번 내지 736번 aa)을 암호화하는 서열번호 6의 607번 nt 내지 약 2211번 nt와 적어도 70% 내지 99%, 적어도 75%, 적어도 80%, 적어도 85%, 적어도 90%, 적어도 95%, 적어도 97%, 적어도 99% 동일한 서열을 갖는다. DNA(게놈 또는 cDNA) 또는 RNA(예를 들어, mRNA)를 포함하여 이러한 AAVhu68 캡시드를 암호화하는 핵산 서열을 설계하는 것은 당업계의 기술 범위 내에 있다. 소정의 실시형태에서, AAVhu68 vp1 캡시드 단백질을 암호화하는 핵산 서열은 서열번호 6에 제공된다. 그 전문이 참조에 의해 본 명세서에 원용되어 있는 WO 2018/160582 참조. 소정의 실시형태에서, AAVhu68 캡시드는 서열번호 6의 핵산 서열 또는 본 명세서에 개시된 바와 같은 변형(예를 들어, 탈아마이드화된 아미노산)이 있는 서열번호 7의 vp1 아미노산 서열을 암호화하는 서열의 적어도 70%, 적 어도 75%, 적어도 80%, 적어도 85%, 적어도 90%, 적어도 95%, 적어도 97%, 적어도 99%를 사용하여 생성된다. 소 정의 실시형태에서, vp1 아미노산 서열은 서열번호 7로 재현된다. 본 명세서에서 사용되는 바와 같이 vp 캡시드 단백질을 지칭하는데 사용되는 경우, 용어 \"이종\" 또는 이의 임의 의 문법적 변형은, 예를 들어, 상이한 변형된 아미노산 서열이 있는 vp1, vp2 또는 vp3 단량체(단백질)를 갖는 동일하지 않은 요소로 이루어진 집단을 지칭한다. 서열번호 7은 AAVhu68 vp1 단백질의 암호화된 아미노산 서열 을 제공한다. vp1, vp2 및 vp3 단백질(대안적으로, 아이소형으로 불림)과 관련하여 사용될 때 용어 \"이종\"은 캡 시드 내 vp1, vp2 및 vp3 단백질의 아미노산 서열의 차이를 지칭한다. AAV 캡시드는 vp1 단백질 내, vp2 단백질 내 및 vp3 단백질 내에 예상되는 아미노산 잔기로부터 변형이 있는 하위집단을 포함한다. 이들 하위집단은 최소 한 소정의 탈아마이드화된 아스파라긴(N 또는 Asn) 잔기를 포함한다. 예를 들어, 소정의 하위집단은 아스파라긴 - 글리신 쌍에서 적어도 1개, 2개, 3개 또는 4개의 고도로 탈아마이드화된 아스파라긴(N) 위치를 포함하고, 선 택적으로 다른 탈아마이드화된 아미노산을 더 포함하되, 탈아마이드화는 아미노산 변화 및 다른 선택적 변형을 초래한다. 본 명세서에서 사용되는 바와 같이, vp 단백질의 \"하위집단\"은 달리 명시되지 않는 한, 공통적으로 적어도 하나 의 정의된 특징을 가지고 참조 그룹의 모든 구성원보다 적은 적어도 하나의 그룹 구성원으로 이루어지는 vp 단 백질의 그룹을 지칭한다. 예를 들어, vp 단백질의 \"하위집단\"은 달리 명시되지 않는 한, 적어도 하나의 vp1 단백질 및 조립된 AAV 캡 시드의 모든 vp1 단백질보다 적다. vp3 단백질의 \"하위집단\"은 달리 명시되지 않는 한, 하나의 vp3 단백질 내지 조립된 AAV 캡시드의 모든 vp3 단백질보다 적은 단백질일 수 있다. 예를 들어, vp1 단백질은 vp 단백질의 하위집단일 수 있고; vp2 단백질은 vp 단백질의 별도의 하위집단일 수 있으며, vp3은 조립된 AAV 캡시드에서 vp 단백질의 추가의 하위집단이다. 또 다른 예에서, vp1, vp2 및 vp3 단백질은, 예를 들어, 아스파라긴-글리신 쌍 에서, 상이한 변형, 예를 들어, 적어도 1개, 2개, 3개 또는 4개의 고도로 탈아마이드화된 아스파라긴을 가지는 하위집단을 포함할 수 있다.달리 명시되지 않는 한, 고도로 탈아마이드화된 것은 참조 아미노산 위치에서 예상되는 아미노산 서열과 비교하 여 적어도 45%의 탈아마이드화, 적어도 50%의 탈아마이드화, 적어도 60%의 탈아마이드화, 적어도 65%의 탈아마 이드화, 적어도 70%, 적어도 75%, 적어도 80%, 적어도 85%, 적어도 90%, 적어도 95%, 적어도 97%, 적어도 99% 또는 최대 약 100%의 탈아마이드화를 지칭한다(예를 들어, 서열번호 7(AAVhu68)의 넘버링을 기준으로 57번 아미 노산에서 아스파라긴의 적어도 80%는 총 vp1 단백질을 기준으로 탈아마이드화될 수 있고, 총 vp1, vp2 및 vp3 단백질을 기준으로 탈아마이드화될 수 있음). 이와 같은 백분율은 2D-겔, 질량 분석 기법 또는 기타 적합한 기 법을 사용하여 결정될 수 있다. 이론에 얽매이지 않고, AAV 캡시드의 vp 단백질에서 적어도 고도로 탈아마이드화된 잔기의 탈아마이드화는 본질 적으로 주로 비-효소적이며, 선택된 아스파라긴 및 더 적은 정도로 글루타민 잔기를 탈아마이드화하는 캡시드 단백질 내의 작용기에 의해 야기되는 것으로 여겨진다. 대부분의 탈아마이드화 vp1 단백질의 효율적인 캡시드 조립은 이러한 이벤트가 캡시드 조립 후에 발생하거나 또는 개별 단량체(vp1, vp2 또는 vp3)의 탈아마이드화가 구조적으로 잘 견디며 조립 역학에 크게 영향을 미치지 않음을 나타낸다. 일반적으로 세포 진입 전에 내부적으 로 위치하는 것으로 간주되는 vp1-고유(VP1-u) 영역(약 1번 내지 137번 aa)의 광범위한 탈아마이드화는 VP 탈아 마이드화가 캡시드 조립 전에 발생할 수 있음을 시사한다. N의 탈아마이드화는 C-말단 잔기의 백본 질소 원자가 Asn의 측쇄 아마이드기 탄소 원자에 친핵성 공격을 수행함으로써 발생할 수 있다. 중간체 고리-폐쇄 석신이미드 잔류물이 형성되는 것으로 여겨진다. 그런 다음, 석신이미드 잔류물은 빠른 가수분해를 수행하여 최종 생성물인 아스파르트산(Asp) 또는 아이소 아스파르트산(IsoAsp)을 생성한다. 따라서, 소정의 실시형태에서, 아스파라긴(N 또는 Asn)의 탈아마이드화는 Asp 또는 IsoAsp를 생성하며, 이는, 예를 들어, 아래에 예시된 바와 같이 석신이미 드 중간체를 통해 상호전환될 수 있다."}
{"patent_id": "10-2021-7039381", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "본 명세서에 제공된 바와 같이, vp1, VP2 또는 VP3에서 각각 탈아마이드화된 N은 독립적으로 아스파르트산 (Asp), 아이소아스파르트산(isoAsp), 아스파테이트 및/또는 Asp와 isoAsp의 상호전환 배합물(blend) 또는 이들 의 조합일 수 있다. 임의의 적합한 비의 α- 및 아이소아스파르트산이 존재할 수 있다. 예를 들어, 소정의 실시 형태에서, 비는 10:1 대 1:10 아스파르트산 대 아이소아스파르트산, 약 50:50 아스파르트산:아이소아스파르트산 또는 약 1:3 아스파르트산:아이소아스파르트산 또는 또 다른 선택된 비일 수 있다. 소정의 실시형태에서, 하나 이상의 글루타민(Q)은 글루탐산(Glu), 즉, α-글루탐산, γ-글루탐산(Glu), 또는 일 반적인 글루타린이미드 중간체를 통해 상호전환될 수 있는 α- 및 γ-글루탐산의 배합물로 탈아마이드화될 수 있다. 임의의 적합한 비의 α- 및 γ-글루탐산이 존재할 수 있다. 예를 들어, 소정의 실시형태에서, 비는 10:1 대 1:10 α 대 γ, 약 50:50 α:γ 또는 약 1:3 α:γ 또는 또 다른 선택된 비일 수 있다. 따라서, rAAV는 적어도 하나의 고도로 탈아마이드화된 아스파라긴을 포함하는 최소한 적어도 하나의 하위집단을 포함하는, 탈아마이드화된 아미노산을 갖는 vp1, vp2 및/또는 vp3 단백질의 rAAV 캡시드 내의 하위집단을 포함 한다. 또한, 다른 변형은 특히 선택된 아스파르트산(D 또는 Asp) 잔기 위치에서의 이성질체화를 포함할 수 있다. 또 다른 실시형태에서, 변형은 Asp 위치에서의 아마이드화를 포함할 수 있다. 소정의 실시형태에서, AAV 캡시드는 적어도 4개 내지 적어도 약 25개의 탈아마이드화된 아미노산 잔기 위치를 갖는 vp1, vp2 및 vp3의 하위집단을 포함하며, 이 중 적어도 1% 내지 10%가 vp 단백질의 암호화된 아미노산 서 열과 비교하여 탈아마이드화된다. 이들 대부분은 N 잔기일 수 있다. 그러나, Q 잔기도 또한 탈아마이드화될 수 있다. 소정의 실시형태에서, rAAV는 실시예 11에 제공되며 참조에 의해 본 명세서에 원용되어 있는 표에 제시된 위치 에서 2개, 3개, 4개 이상의 탈아마이드화된 잔기의 조합을 포함하는 하위집단을 갖는 vp1, vp2 및 vp3 단백질을 갖는 AAV 캡시드를 갖는다. rAAV에서의 탈아마이드화는 2D 겔 전기영동 및/또는 질량 분석법(MS) 및/또는 단백 질 모델링 기법을 사용하여 결정될 수 있다. 온라인 크로마토그래피는 NanoFlex 공급원이 있는 Q Exactive HF (써모 피셔 사이언티픽(Thermo Fisher Scientific))에 결합되어 있는 어클레임 펩맵 칼럼(Acclaim PepMap column) 및 Thermo UltiMate 3000 RSLC 시스템(써모 피셔 사이언티픽)을 이용하여 수행될 수 있다. MS 데이터 는 서베이 스캔(200 m/z 내지 2000 m/z)으로부터 아직 시퀀싱되지 않은 가장 풍부한 전구체 이온을 동적으로 선 택하는 Q Exactive HF에 대한 데이터-의존적 상위 20개의 방법을 사용하여 수집된다. 시퀀싱은 예측 자동 이득 제어(predictive automatic gain control)로 결정된 1e5 이온의 목표 값으로 더 높은 에너지 충돌 해리 단편화 를 통해 수행되고, 전구체의 단리는 4 m/z의 창(또는 기간)으로 수행되었다. 서베이 스캔은 m/z 200에서 120,000의 분해능으로 획득되었다. HCD 스펙트럼에 대한 분해능은 m/z 200에서 30,000으로 설정될 수 있으며, 이때 최대 이온 주입 시간은 50㎳이고, 정규화된 충돌 에너지는 30이다. S-렌즈 RF 수준은 분해로부터 펩타이드 가 차지하는 m/z 영역의 최적 전송을 제공하기 위해 50으로 설정될 수 있다. 전구체 이온은 단편화 선택에서 단 일의 할당되지 않은 또는 6개 이상의 전하 상태로 제외될 수 있다. BioPharma Finder 1.0 소프트웨어(써모 피셔 사이언티픽)가 획득된 데이터의 분석에 사용될 수 있다. 펩타이드 맵핑을 위해, 고정된 변형으로 카바미도메틸 화가 설정되고; 다양한 변형, 즉, 10-ppm 질량 정확도, 높은 프로테이스 특이성 및 MS/MS 스펙트럼에 대한 0.8 의 신뢰 수준으로 산화, 탈아마이드화 및 인산화가 설정된 단일 항목 단백질 FASTA 데이터베이스를 사용하여 검 색이 수행된다. 적합한 프로테이스의 예는, 예를 들어, 트립신 또는 키모트립신을 포함할 수 있다. 탈아마이드 화가 온전한 분자의 질량에 +0.984 Da(-OH와 -NH2기 사이의 질량 차이)를 추가하기 때문에, 탈아마이드화된 펩 타이드의 질량 분광학적 확인은 비교적 간단하다. 특정 펩타이드의 탈아마이드화 백분율은 탈아마이드화 펩타이 드의 질량 면적을 탈아마이드화 펩타이드 및 천연 펩타이드의 면적의 합으로 나눈 것으로 결정된다. 가능한 탈 아마이드화 부위의 수를 고려할 때, 상이한 부위에서 탈아마이드화되는 등비중(isobaric) 종은 단일 피크에서 함께 이동할 수 있다. 결과적으로, 여러 잠재적 탈아마이드화 부위가 있는 펩타이드에서 비롯되는 단편 이온을 사용하여 탈아마이드화의 다중 부위를 찾거나 상기 부위가 구별될 수 있다. 이러한 경우에, 관찰된 동위원소 패 턴 내의 상대 강도를 사용하여 상이한 탈아마이드화된 펩타이드 이성질체의 상대 풍부도가 구체적으로 결정될수 있다. 이러한 방법은 모든 이성질체 종에 대한 단편화 효율이 동일하고 탈아마이드화 부위에 독립적이라고 가정한다. 당업자는 이러한 예시적인 방법에 대한 다수의 변형이 사용될 수 있음을 이해할 것이다. 예를 들어, 적합한 질량 분석기는, 예를 들어, Waters Xevo 또는 애질런트 6530과 같은 사중극자 비행시간 질량 분석기 (QTOF) 또는 Orbitrap Fusion 또는 Orbitrap Velos(써모 피셔)와 같은 오비트랩 기기를 포함할 수 있다. 적합 하게는 액체 크로마토그래피 시스템은, 예를 들어, Waters의 Acquity UPLC 시스템 또는 애질런트 시스템(1100 또는 1200 시리즈)를 포함한다. 적합한 데이터 분석 소프트웨어는, 예를 들어, MassLynx(워터스(Waters)), Pinpoint 및 Pepfinder(써모 피셔 사이언티픽), Mascot(매트릭스 사이언스(Matrix Science)), Peaks DB(바이오 인포매틱스 솔루션즈(Bioinformatics Solutions))를 포함할 수 있다. 또 다른 기법은, 예를 들어, 문헌[X. Jin et al, Hu Gene Therapy Methods, Vol. 28, No. 5, pp. 255-267, 2017년 6월 16일 온라인 공개]에 기재되어 있 을 수 있다. 탈아마이드화 외에도, 한 아미노산이 다른 아미노산 잔기로 전환되지 않는 다른 변형이 발생할 수 있다. 이러한 변형은 아세틸화된 잔기, 이성질체화, 인산화 또는 산화를 포함할 수 있다. 탈아마이드화의 조절: 소정의 실시형태에서, AAV는 탈아마이드화를 감소시키기 위해 아스파라긴-글리신 쌍에서 글리신을 변화시키도록 변형된다. 다른 실시형태에서, 아스파라긴은 상이한 아미노산, 예를 들어, 더 느린 속도 로 탈아마이드화되는 글루타민; 또는 아마이드기가 없는 아미노산(예를 들어, 글루타민 및 아스파라긴은 아마이 드기를 포함함); 및/또는 아민기가 없는 아미노산(예를 들어, 라이신, 아르기닌 및 히스티딘은 아민기를 포함함)으로 변경된다. 본 명세서에서 사용되는 바와 같이, 아마이드 또는 아민 측기가 없은 아미노산은, 예를 들어, 글리신, 알라닌, 발린, 류신, 아이소류신, 세린, 트레오닌, 시스틴, 페닐알라닌, 타이로신 또는 트립토판 및/또는 프롤린을 지칭한다. 기재된 바와 같은 변형은 암호화된 AAV 아미노산 서열에서 발견되는 아스파라긴-글 리신 쌍 중 1개, 2개 또는 3개에 있을 수 있다. 소정의 실시형태에서, 이러한 변형은 4개의 아스파라긴 - 글리 신 쌍 모두에서 이루어지지 않는다. 따라서, 더 낮은 탈아마이드화률을 갖는 AAV 및/또는 조작된 AAV 변이체의 탈아마이드화를 감소시키는 방법이 제공된다. 추가적으로 또는 대안적인 하나 이상의 다른 아마이드 아미노산은 AAV의 탈아마이드화를 감소시키기 위해 비-아마이드 아미노산으로 변화될 수 있다. 소정의 실시형태에서, 본 명 세서에 개시된 바와 같은 돌연변이체 AAV 캡시드는 글리신이 알라닌 또는 세린으로 변화되도록 아르기닌 - 글리 신 쌍에 돌연변이를 포함한다. 돌연변이체 AAV 캡시드는 1개, 2개 또는 3개의 돌연변이체를 포함할 수 있되, 참 조 AAV는 본래 4개의 NG 쌍을 포함한다. 소정의 실시형태에서, AAV 캡시드는 1개, 2개, 3개 또는 4개의 이러한 돌연변이체를 포함할 수 있되, 참조 AAV 본래 5개의 NG 쌍을 포함한다. 소정의 실시형태에서, 돌연변이체 AAV 캡시드는 NG 쌍에 단일 돌연변이만을 포함한다. 소정의 실시형태에서, 돌연변이체 AAV 캡시드는 2개의 상이한 NG 쌍에 돌연변이를 포함한다. 소정의 실시형태에서, 돌연변이체 AAV 캡시드는 AAV 캡시드에서 구조적으로 별도 의 위치에 위치한 2개의 상이한 NG 쌍에 돌연변이를 포함한다. 소정의 실시형태에서, 돌연변이는 vp1-고유 영역 에 없다. 소정의 실시형태에서, 돌연변이 중 하나는 vp1-고유 영역에 있다. 선택적으로, 돌연변이체 AAV 캡시드 는 NG 쌍에 변형을 포함하지 않지만, NG 쌍 외부에 위치한 하나 이상의 아스파라긴 또는 글루타민에서 탈아마이 드화를 최분해하거나 또는 제거하는 돌연변이를 포함한다. AAVhu68 캡시드 단백질에서, 4개의 잔기(N57, N329, N452, N512)는 일상적으로 70% 초과의 탈아마이드화 수준을 나타내며, 대부분의 경우 다양한 로트에 걸쳐 90% 초과이다. 추가적인 아스파라긴 잔기(N94, N253, N270, N304, N409, N477 및 Q599)는 또한 다양한 로트에 걸쳐 최대 약 20%의 탈아마이드화 수준을 나타낸다. 탈아마이드화 수준은 처음에 트립신 분해를 사용하여 확인되었고, 키모트립신 분해로 검증되었다. AAVhu68 캡시드는 서열번호 7의 예상되는 아미노산 잔기로부터 변형을 갖는 vp1 단백질 내, vp2 단백질 내 및 vp3 단백질 내에 하위집단을 포함한다. 이들 하위집단은 최소한 소정의 탈아마이드화된 아스파라긴(N 또는 Asn) 잔기를 포함한다. 예를 들어, 소정의 하위집단은 서열번호 7의 아스파라긴 - 글리신 쌍에서 적어도 1개, 2개, 3 개 또는 4개의 고도로 탈아마이드화된 아스파라긴(N) 위치를 포함하며, 선택적으로 다른 탈아마이드화된 아미노 산을 더 포함하되, 탈아마이드화는 아미노산 변화 및 다른 선택적 변형을 초래한다. 서열번호 8은 탈아마이드화 되거나 또는 그렇지 않으면 변형된 아미노산의 일부 백분율을 가질 수 있는 위치를 예시하는 변형된 AAVhu68 캡 시드의 아미노산 서열을 제공한다. 이들 및 다른 변형의 다양한 조합이 본 명세서에 기재되어 있다. 본 명세서에서 사용되는 바와 같이, \"AAV9 캡시드\"는 다수의 AAV9 vp 단백질로 구성된 자가-조립된 AAV 캡시드 이다. AAV9 vp 단백질은 전형적으로 GenBank 등록: AAS99264의 vp1 아미노산 서열을 암호화하는 서열번호 9의 핵산 서열 또는 이에 대해 적어도 70%, 적어도 75%, 적어도 80%, 적어도 85%, 적어도 90%, 적어도 95%, 적어도 97%, 적어도 99%인 서열에 의해 암호화되는 대안적인 스플라이스 변이체로 발현된다. 소정의 실시형태에서, \"AAV9 캡시드\"는 AAS99264와 99% 동일하거나 또는 서열번호 10과 99% 동일한 아미노산 서열을 갖는 AAV를 포함한다. 또한, US7906111 및 WO 2005/033321 참조. 본 명세서에서 사용되는 바와 같은 \"AAV9 변이체\"는, 예를 들 어, WO2016/049230, US 8,927,514, US 2015/0344911 및 US 8,734,809에 기재된 것을 포함한다. 캡시드를 생성하는 방법, 이에 대한 코딩 서열 및 rAAV 바이러스 벡터의 생성 방법이 기재된 바 있다. 예를 들 어, 문헌[Gao, et al, Proc. Natl. Acad. Sci. U.S.A. 100, 6081-6086] 및 US 2013/0045186A1 참조. 핵산 또는 이의 단편을 지칭할 때 용어 \"실질적인 상동성\" 또는 \"실질적인 유사성\"은 적절한 뉴클레오타이드 삽 입 또는 결실을 가지고 또 다른 핵산(또는 이의 상보적 가닥)과 최적으로 정렬될 때, 정렬된 서열의 적어도 약 95% 내지 99%의 뉴클레오타이드 서열 동일성이 있음을 나타낸다. 바람직하게는, 상동성은 전장 서열, 또는 이의 오픈 리딩 프레임, 또는 적어도 15개의 뉴클레오타이드 길이인 또 다른 적합한 단편에 걸쳐 있다. 적합한 단편 의 예는 본 명세서에 기재되어 있다. 핵산 서열과 관련하여 용어 \"서열 동일성\", \"서열 동일성 백분율\" 또는 \"동일성 백분율\"은 최대 일치성을 위해 정렬될 때 동일한 2개 서열 내의 잔기를 지칭한다. 서열 동일성 비교 길이는 게놈의 전장에 걸쳐 있을 수 있거 나, 유전자 코딩 서열의 전장, 또는 적어도 약 500개 내지 5000개의 뉴클레오타이드의 단편이 바람직하다. 그러 나, 더 작은 단편 사이의 동일성, 예를 들어, 적어도 약 9개의 뉴클레오타이드, 보통 적어도 약 20개 내지 24개 의 뉴클레오타이드, 적어도 약 28개 내지 32개의 뉴클레오타이드, 적어도 약 36개 이상의 뉴클레오타이드의 동 일성이 또한 바람직할 수 있다. 유사하게는, \"서열 동일성 백분율\"은 단백질 또는 이의 단편의 전장에 걸쳐 아 미노산 서열에 대해 용이하게 결정될 수 있다. 적합하게는, 단편은 길이가 적어도 약 8개의 아미노산이고, 최대 약 700개의 아미노산일 수 있다. 적합한 단편의 예는 본 명세서에 기재되어 있다. 아미노산 또는 이의 단편을 지칭할 때 용어 \"실질적인 상동성\" 또는 \"실질적인 유사성\"은 적절한 아미노산 삽입 또는 결실을 가지고 또 다른 아미노산(또는 이의 상보적 가닥)과 최적으로 정렬될 때, 정렬된 서열의 적어도 약 95% 내지 99%의 아미노산 서열 동일성이 있음을 나타낸다. 바람직하게는, 상동성은 전장 서열, 또는 이의 단백 질, 예를 들어, cap 단백질, rep 단백질 또는 길이가 적어도 8개의 아미노산, 또는 더 바람직하게는 적어도 15 개의 아미노산인 단편에 걸쳐 있다. 적합한 단편의 예는 본 명세서에 기재되어 있다. 용어 \"고도로 보존된\"은 적어도 80%의 동일성, 바람직하게는 적어도 90%의 동일성, 더 바람직하게는 97% 초과의 동일성을 의미한다. 동일성은 당업자에게 알려진 알고리즘 및 컴퓨터 프로그램에 의지하여 당업자에 의해 용이 하게 결정된다. 일반적으로, 2개의 상이한 아데노-연관 바이러스 사이의 \"동일성\", \"상동성\" 또는 \"유사성\"을 지칭할 때, \"동일 성\", \"상동성\" 또는 \"유사성\"은 \"정렬된\" 서열에 관하여 결정된다. \"정렬된\" 서열 또는 \"정렬\"은 종종 참조 서 열과 비교하여 누락되거나 추가적인 염기 또는 아미노산에 대한 교정을 포함하는, 다수의 핵산 서열 또는 단백 질(아미노산) 서열을 지칭한다. 예에서, AAV 정렬은 참조점으로서 공개된 AAV9 서열을 사용하여 수행된다. 정렬 은 공개적으로 또는 상업적으로 이용 가능한 다양한 다중 서열 정렬 프로그램(Multiple Sequence Alignment Program) 중 임의의 것을 사용하여 수행된다. 이와 같은 프로그램의 예는 \"Clustal Omega\", \"Clustal W\", \"CAP Sequence Assembly\", \"MAP\", 및 \"MEME\"를 포함하며, 이들은 인터넷 웹 서버를 통해 접근 가능하다. 이와 같은 프로그램에 대한 다른 공급원은 당업자에게 알려져 있다. 대안적으로, Vector NTI 유틸리티가 또한 사용된다. 또한, 위에 기재된 프로그램에 포함된 것을 포함하여, 뉴클레오타이드 서열 동일성을 측정하는 데 사용될 수 있 는 당업계에 알려진 다수의 알고리즘이 있다. 또 다른 예에서, 폴리뉴클레오타이드 서열은 GCG 버전 6.1의 프로 그램인 Fasta™를 사용하여 비교될 수 있다. Fasta™는 질의 서열과 검색 서열 사이의 최적의 중첩 영역의 정렬 및 서열 동일성 백분율을 제공한다. 예를 들어, 핵산 서열 사이의 서열 동일성 백분율은 참조에 의해 본 명세서 에 원용된 GCG 버전 6.1에서 제공되는 바와 같은 디폴트 매개변수(단어 크기 6, 스코어링 매트릭스에 대한 NOPAM 인자)와 함께 Fasta™를 사용하여 결정될 수 있다. 다중 서열 정렬 프로그램, 예를 들어, \"Clustal Omega\", \"Clustal X\", \"MAP\", \"PIMA\", \"MSA\", \"BLOCKMAKER\", \"MEME\", 및 \"Match-Box\" 프로그램은 또한 아미노 산 서열에 대해 이용 가능하다. 일반적으로 이들 프로그램 중 임의의 것은 디폴트 설정으로 사용되지만, 당업자 는 필요에 따라 이러한 설정을 변경할 수 있다. 대안적으로, 당업자는 적어도 참조 알고리즘 및 프로그램에 의 해 제공되는 바와 같은 동일성 또는 정렬 수준을 제공하는 또 다른 알고리즘 또는 컴퓨터를 이용할 수 있다. 예 를 들어, 문헌[J. D. Thomson et al, Nucl. Acids. Res., \"A comprehensive comparison of multiple sequence alignments\", 27:2682-2690 ] 참조. V. rAAV 아릴설파테이스 유전자(ARSA) 돌연변이와 관련되거나 또는 기능성 아릴설파테이스 A의 정상 수준의 결핍에 의해 야기되는 질환(예를 들어, 이염성 백질이영양증(MLD))의 치료를 필요로 하는 대상체에서 아릴설파테이스 유전자 (ARSA) 돌연변이와 관련되거나 또는 기능성 아릴설파테이스 A의 정상 수준의 결핍에 의해 야기되는 질환을 치료 하는데 유용한 치료적, 재조합 및 복제-결함 아데노-관련 바이러스(rAAV)가 본 명세서에 제공된다. rAAV는 바람 직하게는 복제-결함성이며, 반전 말단 반복부(ITR) 및 표적 세포에서 hARSA 발현을 지시하는 조절 서열의 제어 하에 기능성 인간 아릴설파테이스 A(hARSA)를 암호화하는 핵산 서열을 포함하는 벡터 게놈을 운반한다. 소정의 실시형태에서, hARSA 코딩 서열은 서열번호 1의 55번 뉴클레오타이드(nt) 내지 1521번 nt의 서열 또는 기능성 hARSA를 암호화하는 이에 대해 적어도 95% 내지 99.9% 동일한 서열을 포함한다. 소정의 실시형태에서, 벡터 게 놈은 반전 말단 반복부(ITR) 및 III부에 기재된 바와 같은 발현 카세트를 포함한다. 추가의 실시형태에서, rAAV 는 AAV 캡시드를 포함한다. AAV 캡시드는 표적 세포에 기초하여 선택될 수 있다. 소정의 실시형태에서, AAV 캡시드는 신경계(예를 들어, CNS 또는 PNS)에서 벡터 게놈의 전달에 적합하다. 소정의 실시형태에서, AAV 캡시드는 뉴런, 신경계 세포, 희소 돌기아교세포, 미세아교세포, 중추 신경계(CNS) 세포, CNS의 뉴런, 말초 신경계(PNS) 세포, 슈반 세포, PNS의 대식세포 또는 내장 기관의 세포(예를 들어, 신장 세포, 간 세포 및 담낭 세포)에서 벡터 게놈의 전달에 적합하 다. 소정의 실시형태에서, AAV 캡시드는 본 명세서에 개시된 바와 같은 또 다른 표적 세포에서 벡터 게놈의 전 달에 적합하다. 소정의 실시형태에서, AAV 캡시드는 cy02 캡시드, rh43 캡시드, AAV8 캡시드, rh01 캡시드, AAV9 캡시드, rh8 캡시드, rh10 캡시드, bb01 캡시드, hu37 캡시드, rh02 캡시드, rh20 캡시드, rh39 캡시드, rh64 캡시드, AAV6 캡시드, AAV1 캡시드, hu44 캡시드, hu48 캡시드, cy05 캡시드 hu11 캡시드, hu32 캡시드, pi2 캡시드 또는 이 들의 변이로부터 선택된다. 소정의 실시형태에서, AAV 캡시드는 AAV9 캡시드, AAVhu68 캡시드, AAV-PHP.B 캡시 드, hu31 캡시드, hu32 캡시드 또는 이들의 변이와 같은 클레이드 F 캡시드이다. 예를 들어, 각각 그 전문이 참 조에 의해 본 명세서에 원용되어 있는 2015년 4월 14일자로 공개된 WO 2005/033321, WO 2018/160582 및 US 2015/0079038 참조. 소정의 실시형태에서, AAV 캡시드는 비-클레이드 F 캡시드, 예를 들어, 클레이드 A, B, C, D 또는 E 캡시드이다. 소정의 실시형태에서, 비-클레이드 F 캡시드는 AAV1 또는 이들의 변이이다. 소정의 실시 형태에서, AAV 캡시드는 신경계 세포 이외의 표적 세포를 형질도입한다. 소정의 실시형태에서, AAV 캡시드는 클 레이드 캡시드(예를 들어, AAV1, AAV6), 클레이드 B 캡시드(예를 들어, AAV 2), 클레이드 C 캡시드(예를 들어, hu53), 클레이드 D 캡시드(예를 들어, AAV7) 또는 클레이드 E 캡시드(예를 들어, rh10)이다. 또한, 다른 AAV 캡 시드도 선택될 수 있다. 소정의 실시형태에서, rAAV는 벡터 게놈이 패키징되는 AAVhu68 캡시드를 포함한다. 소정의 실시형태에서, AAVhu68 캡시드는 서열번호 7의 예상되는 아미노산 서열을 암호화하는 서열로부터 생성된다. 자세한 내용은 V부를 참조. 소정의 실시형태에서, 벡터 게놈은 AAVhu68 게놈 서열을 함유하지 않기 때문에 AAVhu68 캡시드에 대해 완전히 외인성이다. 기능성 hARSA는 I부에 기재되어 있다. 소정의 실시형태에서, 기능성 hARSA는 신호 펩타이드 및 서열번호 2의 19 번 아미노산(aa) 내지 507번 aa의 서열을 갖는다. 소정의 실시형태에서, 천연 hARSA 신호 펩타이드, 예를 들어, 서열번호 2의 1번 aa 내지 18번 aa가 사용된다. 소정의 실시형태에서, 신호 펩타이드는 서열번호 4의 1번 aa 내 지 20번 aa의 아미노산 서열을 갖는다. 소정의 실시형태에서, 기능성 hARSA는 서열번호 2 또는 서열번호 4의 아 미노산 서열을 갖는다. 소정의 실시형태에서, hARSA 코딩 서열은 서열번호 1의 55번 뉴클레오타이드(nt) 내지 1521번 nt와 약 95% 내지 100% 동일하다. 소정의 실시형태에서, hARSA-코딩 서열은 서열번호 1 또는 서열번호 3이다. 추가의 실시형태에 서, hARSA 코딩 서열은 서열번호 2의 19번 아미노산(aa) 내지 507번 aa의 서열을 암호화한다. 또 다른 추가의 실시형태에서, hARSA 코딩 서열은 서열번호 2 또는 서열번호 4의 서열을 암호화한다. hARSA 코딩 서열에 대한 자세한 내용은 I부를 참조. 소정의 실시형태에서, 제어 서열은 신경계 세포에서 hARSA 발현을 지시한다. 소정의 실시형태에서, 제어 서열은 유비쿼터스 프로모터, 예를 들어, CB7 프로모터를 포함한다. 추가의 실시형태에서, 조절 요소는 코작 서열, 폴 리아데닐화 서열, 인트론, 인핸서 및 TATA 신호 중 하나 이상을 포함한다. 소정의 실시형태에서, 제어 서열은 다음 중 하나 이상을 포함한다: 닭 β-액틴(BA) 프로모터 및 인간 사이토메갈로바이러스 급초기 인핸서(CMV IE)(예를 들어, CB7 프로모터, 서열번호 5의 198번 nt 내지 862번 nt)로부터 유래되는 조절 요소, 닭 BA 스플라 이스 공여체 및 토끼 β-글로빈(rBG) 스플라이스 억셉터 요소(예를 들어, CI, 서열번호 5의 956번 nt 내지 1928번 nt)로 구성된 키메라 인트론 및 rBG 유전자(예를 들어, rBG, 서열번호 5의 3539번 nt 내지 3665번 nt)로부터 유래되는 폴리아데닐화(폴리A) 신호. 소정의 실시형태에서, 벡터 게놈은 서열번호 5의 1번 뉴클레오타이드(nt) 내지 3883번 nt의 서열을 갖는다. 자세한 내용은 III부를 참조. 소정의 실시형태에서, rAAV 또는 rAAV를 포함하는 조성물은 ARSA 돌연변이와 관련되거나 또는 기능성 아릴설파 테이스 A의 정상 수준의 결핍에 의해 야기되는 질환(예를 들어, MLD)의 증상을 개선하고/하거나 ARSA 돌연변이 와 관련되거나 또는 기능성 아릴설파테이스 A의 정상 수준의 결핍에 의해 야기되는 질환(예를 들어, MLD)의 진 행을 지연시키기 위해 이를 필요로 하는 대상체에 투여 가능하다. 자세한 내용은 II부를 참조. 소정의 실시형태에서, 본 명세서에 개시된 바와 같은 rAAV는 대수조 내로의 CT-유도 후두하 주사를 통한 것을 포함한 대수조내 주사(ICM)를 통해 환자에게 투여하기에 적합하다. 소정의 실시형태에서, 본 명세서에 개시된 바와 같은 rAAV는 7세 이하인 대상체에 투여하기에 적합하다. 소정의 실시형태에서, 본 명세서에 개시된 바와 같은 rAAV는 이염성 백질이영양증 또는 아릴설파테이스 A(ARSA) 유전자 돌연변이와 관련된 질환의 증상을 개선 하고/하거나 이염성 백질이영양증 또는 아릴설파테이스 A(ARSA) 유전자 돌연변이와 관련된 질환의 진행을 지연 시키기 위해 이를 필요로 하는 대상체에 투여하기에 적합하다. 자세한 내용은 II부 및 VIII부를 참조. 소정의 실시형태에서, 본 명세서에 개시된 바와 같은 rAAV는 단일 용량으로 투여된다. 소정의 실시형태에서, 벡터 게놈은 단일-가닥 AAV 벡터 게놈이다. 소정의 실시형태에서, rAAV 벡터는 자가-상보 성(sc) AAV 벡터 게놈을 포함하는 본 발명에서 이용될 수 있다. 필요한 조절 제어 요소는 rAAV를 받아들인 세포에서 이의 전사, 번역 및/또는 발현을 허용하는 방식으로 유전자 (예를 들어, hARSA 코딩 서열)에 작동 가능하게 연결된다. 본 명세서에서 사용되는 바와 같이, \"작동 가능하게 연결된\" 서열은 관심 있는 유전자와 인접한 발현 제어 서열 및 관심 있는 유전자를 제어하기 위해 트랜스로 또 는 떨어져서 작용하는 발현 제어 서열 둘 다를 포함한다. 이러한 제어 서열은 전형적으로, 예를 들어, 프로모터, 인핸서, 인트론, 폴리A, 자가-절단 링커(예를 들어, 퓨린, 퓨린-F2A, IRES) 중 하나 이상을 포함한다. 아래의 예는 hARSA의 발현을 위해 CB7 프로모터를 이용한다. 그러나, 소정의 실시형태에서, 다른 프 로모터 또는 추가적인 프로모터가 선택될 수 있다. 소정의 실시형태에서, 추가적인 또는 대안적인 프로모터 서 열은, 예를 들어, 선택된 5' ITR 서열과 코딩 서열 사이에 위치한 발현 제어 서열(제어 서열)의 일부로서 포함 될 수 있다. 구성적 프로모터, 조절 가능한 프로모터[예를 들어, WO 2011/126808 및 WO 2013/04943 참조], 조 직 특이적 프로모터 또는 생리적 자극에 반응하는 프로모터가 본 명세서에 기재된 벡터에 이용될 수 있다. 프로 모터(들)는 상이한 공급원, 예를 들어, 인간 사이토메갈로바이러스(CMV) 급초기 인핸서/프로모터, SV40 조기 인 핸서/프로모터, JC 폴리모바이러스 프로모터, 수초 염기성 단백질(MBP) 또는 신경교 원섬유성 산성 단백질 (GFAP) 프로모터, 단순 포진 바이러스(HSV-1) 잠복 관련 프로모터(LAP), 라우스 육종 바이러스(RSV) 긴말단 반 복부(LTR) 프로모터, 뉴런-특이적 프로모터(NSE), 혈소판 유래 성장 인자(PDGF) 프로모터, hSYN, 멜라닌-농축 호르몬(MCH) 프로모터, CBA, 기질 금속단백질 프로모터(MPP) 및 닭 베타-액틴 프로모터로부터 선택될 수 있다. 프로모터에 더하여, 벡터는 하나 이상의 다른 적절한 전사 개시 서열, 전사 종결 서열, 인핸서 서열, 스플라이 싱 및 폴리아데닐화(폴리A) 신호와 같은 효율적인 RNA 처리 신호; 세포질 mRNA를 안정화하는 서열, 예를 들어, WPRE; 번역 효율을 향상시키는 서열(즉, 코작 컨센서스 서열); 단백질 안정성을 향상시키는 서열; 및 원하는 경 우, 암호화된 생성물의 분비를 향상시키는 서열을 포함할 수 있다. 적합한 인핸서의 예는 CMV 인핸서이다. 다른 적합한 인핸서는 목적하는 표적 조직 적응증에 적절한 것을 포함한다. 일 실시형태에서, 제어 서열은 하나 이상 의 발현 인핸서를 포함한다. 일 실시형태에서, 제어 서열은 2개 이상의 발현 인핸서를 포함한다. 이들 인핸서는 동일할 수 있거나 또는 서로 상이할 수 있다. 예를 들어, 인핸서는 CMV 급초기 인핸서(서열번호 19)를 포함할 수 있다. 이 인핸서는 서로 인접하여 위치하는 두 개의 카피로 존재할 수 있다. 대안적으로, 인핸서의 이중 카 피는 하나 이상의 서열에 의해 분리될 수 있다. 또 다른 실시형태에서, 발현 카세트는, 예를 들어, 닭 베타-액 틴 인트론(서열번호 17)을 더 포함한다. 소정의 실시형태에서, 인트론은 인간 베타-글로빈 스플라이스 공여체 및 면역글로불린 G(IgG) 스플라이스 억셉터 요소로 구성된 하이브리드 인트론인 키메라 인트론(CI)이다. 다른 적합한 인트론은, 예를 들어, WO 2011/126808에 기재된 것과 같은 당업계에 공지된 것들을 포함한다. 적합한 폴 리A 서열의 예는, 예를 들어, SV40, SV50, 소 성장 호르몬(bGH), 인간 성장 호르몬 및 합성 폴리A를 포함한다. 선택적으로, mRNA를 안정화하기 위해 하나 이상의 서열이 선택될 수 있다. 이러한 서열의 예는 조작된 폴리A 서 열의 상류 및 코딩 서열의 하류일 수 있는 변형된 WPRE 서열이다(예를 들어, 문헌[MA Zanta-Boussif, et al, Gene Therapy 16: 605-619] 참조). 소정의 실시형태에서, WPRE 서열은 존재하지 않는다. 소정의 실시형태에서, hARSA 코딩 서열에 더하여, 또 다른 비-AAV 코딩 서열, 예를 들어, 펩타이드, 폴리펩타이 드, 단백질, 기능성 RNA 분자(예를 들어, miRNA, miRNA 저해제) 또는 관심 있는 다른 유전자 산물이 포함될 수있다. 유용한 유전자 산물은 miRNA를 포함할 수 있다. miRNA 및 다른 작은 간섭 핵산은 표적 RNA 전사체 절단/ 표적 메신저 RNA(mRNA)의 분해 또는 번역 억제를 통해 유전자 발현을 조절한다. miRNA는 전형적으로 최종 19개 내지 25개의 비-번역된 RNA 생성물로 고유하게 발현된다. miRNA는 표적 mRNA의 3' 비번역 영역(UTR)과의 서열- 특이적 상호작용을 통해 활성을 나타낸다. 이러한 내인성으로 발현된 miRNA는 헤어핀 전구체를 형성하고, 후속 적으로 miRNA 듀플렉스로 처리되고, \"성숙\" 단일 가닥 miRNA 분자로 처리된다. 이 성숙 miRNA는 성숙 miRNA에 대한 상보성을 기반으로, 예를 들어, 3' UTR 영역에서 표적 mRNA의 표적 부위를 식별하는 다중단백질 복합체인 miRISC를 안내한다. 벡터의 AAV 서열은 전형적으로 시스-작용 5' 및 3' 반전 말단 반복부(ITR) 서열을 포함한다(예를 들어, 문헌[B. J. Carter, in \"Handbook of Parvoviruses\", ed., P. Tijsser, CRC Press, pp. 155 168 ] 참조). ITR 서열은 약 145개의 염기쌍(bp) 길이이다. 바람직하게는, 실질적으로 ITR을 암호화하는 전체 서열이 분자에 사용 되지만, 이들 서열의 어느 정도의 약간의 변형은 허용된다. 이들 ITR 서열을 변형시키는 능력은 당업계의 기술 범위 내에 있다(See, 예를 들어, 문헌[Sambrook et al, \"Molecular Cloning. A Laboratory Manual\", 2d ed., Cold Spring Harbor Laboratory, New York ; and K. Fisher et al., J. Virol., 70:520 532 ]과 같은 교재). 본 발명에 사용되는 이러한 분자의 예는 선택된 이식유전자 서열 및 관련 조절 요소가 5' 및 3' AAV ITR 서열의 측면에 있는 이식유전자를 포함하는 \"시스-작용\" 플라스미드이다. 일 실시형태에서, ITR은 캡시 드를 제공하는 것과 다른 AAV로부터 유래한다. 일 실시형태에서, ITR 서열은 AAV2로부터 유래한다. ΔITR이라고 하는 5' ITR의 단축된 버전은 D-서열 및 말단 분해능 부위(trs)가 삭제된 것으로 설명되어 있다. 다른 실시형태 에서, 전장 AAV 5' 및 3' ITR이 사용된다. 그러나, 다른 AAV 공급원으로부터의 ITR이 선택될 수 있다. ITR의 공 급원은 AAV2이고 AAV 캡시드는 또 다른 AAV 공급원으로부터 유래하는 경우, 생성된 벡터는 유사형(pseudotype d)이라고 할 수 있다. 그러나, 이들 요소의 다른 구성이 적합할 수 있다. 소정의 실시형태에서, AAV.프로모터.선택적 인핸서.선택적 인트론.hARSA 또는 hARSAco.폴리A라고 하는 5' AAV ITR - 프로모터 - 선택적 인핸서 - 선택적 인트론 - hARSA 코딩 서열- 폴리A - 3' ITR을 포함하는 벡터 게놈을 구축하였다. 소정의 실시형태에서, ITR은 AAV2로부터 유래한다. 소정의 실시형태에서, 하나 이상의 프로모터가 존재한다. 소정의 실시형태에서, 인핸서는 벡터 게놈에 존재한다. 소정의 실시형태에서, 하나 이상의 인핸서가 존재한다. 소정의 실시형태에서, 인트론은 벡터 게놈에 존재한다. 소정의 실시형태에서, 인핸서 및 인트론이 존 재한다. 소정의 실시형태에서, 인트론은 인간 베타-글로빈 스플라이스 공여체 및 면역글로불린 G(IgG) 스플라이 스 억셉터 요소로 구성되는 하이브리드 인트론인 키메라 인트론(CI)이다. 소정의 실시형태에서, 폴리A는 SV40 폴리 A(즉, 시미안 바이러스 40(SV40) 후기 유전자로부터 유래되는 폴리아데닐화(폴리A) 신호)이다. 소정의 실 시형태에서, 폴리A는 토끼 베타-글로빈(RBG) 폴리 A이다. 소정의 실시형태에서, 벡터 게놈은 5' AAV ITR - CB7 프로모터 - hARSA 코딩 서열 - 폴리 A - 3' ITR을 포함한다. 본 명세서에서 사용되는 바와 같이, 벡터 게놈 또는 벡터 게놈을 포함하는 rAAV는 AAV.프로모터(선택적).코작 (선택적).인트론(선택적).hARSA 코딩 서열(예를 들어, hARSA, hARSAco). miRNA(선택적).폴리A(선택적).스터퍼 (선택적)로 본 명세서에 예시된다. 소정의 실시형태에서, rAAV는 AAV캡시드.프로모터(선택적).코작(선택적).인 트론(선택적).hARSA 코딩 서열. miRNA(선택적).폴리A(선택적).스터퍼(선택적)로 본 명세서에 예시된다. 또 다른 양태에서, rAAV를 생산하는데 유용한 생산 시스템이 제공된다. 이 시스템에서, AAVhu68 캡시드 단백질 을 암호화하는 핵산 서열, 본 명세서에 개시된 바와 같은 벡터 게놈 및 벡터 게놈을 AAV 캡시드 내로 패키징하 기에 충분한 AAV rep 기능 및 헬퍼 기능을 포함하는 세포를 배양하였다. 소정의 실시형태에서, 벡터 게놈은 서 열번호 5의 1번 nt 내지 3883번 nt의 서열을 갖는다. 소정의 실시형태에서, 세포 배양물은 인간 배아 신장 293 세포 배양물이다. 소정의 실시형태에서, AAV rep는 AAVhu68과 다른 AAV, 예를 들어, AAV2로부터 유래한다. 소정 의 실시형태에서, AAV rep 코딩 서열 및 cap 유전자는 동일한 핵산 분자 상에 있되, 선택적으로 rep 서열과 cap 유전자 사이에 스페이서가 존재한다. 추가의 실시형태에서, 스페이서는 atgacttaaaccaggt(서열번호 24)이다. AAV 바이러스 벡터(예를 들어, 재조합(r) AAV)를 생성하는데 사용하기 위해, 벡터 게놈은 패키징 숙주 세포에 전달되는 임의의 적합한 벡터, 예를 들어, 플라스미드에 운반될 수 있다. 본 발명에 유용한 플라스미드는 무엇 보다도 원핵생물 세포, 곤충 세포, 포유동물 세포에서 시험관내 복제 및 패키징에 적합하도록 조작될 수 있다. 적합한 형질감염 기법 및 패키징 숙주 세포는 공지되어 있고/있거나 당업자에 의해 용이하게 설계될 수 있다. 예시적인 생산 과정이 도 6 내지 도 7에 제공되어 있다. 소정의 실시형태에서, 플라스미드는 서열번호 5의 서열 을 갖는다. 벡터로서 사용하기에 적합한 AAV를 생성하고 단리하는 방법은 당업계에 공지되어 있다. 일반적으로, 예를 들어, 각각 그 전문이 참조에 의해 본 명세서에 원용되어 있는 문헌[Grieger & Samulski, 2005, Adeno-associated virus as a gene therapy vector: Vector development, production and clinical applications, Adv. Biochem. Engin/Biotechnol. 99: 119-145; Buning et al., 2008, Recent developments in adeno-associated virus vector technology, J. Gene Med. 10:717-733]; 및 아래에 인용된 참고문헌을 참고. 유전자를 비리온으 로 패키징하기 위해, ITR은 유전자를 포함하는 핵산 분자와 동일한 구성에서 시스로(in cis) 요구되는 유일한 AAV 구성요소이다. cap 및 rep 유전자는 트랜스로(in trans) 공급될 수 있다. 일 실시형태에서, 선택된 유전자 요소는 형질감염, 전기천공법, 리포솜 전달, 막 융합 기법, 고속 DNA-코팅된 펠릿, 바이러스 감염 및 원형질 융합을 포함하는 임의의 적합한 방법에 의해 AAV 패키징 세포에 전달될 수 있다. 안정한 AAV 패키징 세포가 또한 만들어질 수 있다. 이러한 작제물을 만들기 위해 사용되는 방법은 핵산 조작의 숙련가에게 공지되어 있으며, 유전 공학, 재조합 공학 및 합성 기법을 포함한다. 예를 들어, 문헌 [Molecular Cloning: A Laboratory Manual, ed. Green and Sambrook, Cold Spring Harbor Press, Cold Spring Harbor, NY ] 참조. 용어 \"AAV 중간체\" 또는 \"AAV 벡터 중간체\"는 내부에 패키징된 원하는 게놈 서열이 결여된 조립된 rAAV 캡시드 를 지칭한다. 이들은 또한 \"빈\" 캡시드로 칭해질 수 있다. 이와 같은 캡시드는 발현 카세트의 검출 가능한 게놈 서열을 포함하지 않거나, 유전자 산물의 발현을 달성하기에 불충분한 단지 부분적으로 패키징된 게놈 서열만을 포함할 수 있다. 이들 빈 캡시드에는 관심 있는 유전자를 숙주 세포로 전달하는 기능이 없다. 본 명세서에 기재된 재조합 아데노-연관 바이러스(AAV)는 알려진 기법을 사용하여 생성될 수 있다. 예를 들어, WO 2003/042397호; WO 2005/033321호, WO 2006/110689호; US 7588772 B2호 참조. 이와 같은 방법은 AAV 캡시드 단백질을 암호화하는 핵산 서열; 기능성 rep 유전자; 최소한 AAV 반전 말단 반복부(ITR) 및 이식유전자로 구성 되는 발현 카세트; 및 AAV 캡시드 단백질로 발현 카세트의 패키징을 허용하기에 충분한 헬퍼 기능을 포함하는 숙주 세포를 배양하는 단계를 포함한다. 캡시드를 생성하는 방법, 이에 대한 코딩 서열 및 rAAV 바이러스 벡터 의 생성 방법은, 예를 들어, 문헌[Gao, et al, Proc. Natl. Acad. Sci. U.S.A. 100 , 6081-6086 ] 및 US 2013/0045186A1를 참조한다. 일 실시형태에서, 재조합 AAVhu68을 생성하는데 유용한 생산 세포 배양물이 제공된다. 이러한 세포 배양물은 숙 주 세포에서 AAVhu68 캡시드 단백질을 발현하는 핵산; AAVhu68 캡시드로 패키징하기에 적합한 핵산 분자, 예를 들어, AAV ITR 및 숙주 세포에서 유전자의 발현을 지시하는 제어 서열에 작동 가능하게 연결된 유전자를 암호화 하는 비-AAV 핵산 서열을 포함하는 벡터 게놈; 및 재조합 AAVhu68 캡시드로 벡터 게놈을 패키징하기에 충분한 AAV rep 기능 및 아데노바이러스 헬퍼 기능을 포함한다. 일 실시형태에서, 세포 배양물은 포유동물 세포(예를 들어, 특히 인간 배아 신장 293 세포) 또는 곤충 세포(예를 들어, 스포돕테라 프루기페르다(Spodoptera frugiperda)(Sf9) 세포)로 구성된다. 소정의 실시형태에서, 바큘로바이러스는 패키징 벡터 게놈을 재조합 AAVhu68 캡시드로 패키징하는데 필요한 헬퍼 기능을 제공한다. 선택적으로, rep 기능은 AAVhu68 이외의 AAV에 의해 제공된다. 소정의 실시형태에서, rep 기능의 적어도 일부는 AAVhu68로부터 유래한다. 또 다른 실시형태에서, rep 단백질은, 예를 들어, AAV1 rep 단백질, AAV2 rep 단백질, AAV3 rep 단백질, AAV4 rep 단백질, AAV5 rep 단백질, AAV6 rep 단백질, AAV7 rep 단백질, AAV8 rep 단백질; 또는 rep 78, rep 68, rep 52, rep 40, rep68/78 및 rep40/52; 또는 이들의 단편; 또는 또 다른 공급원이지만 이들로 제한되지 않는 AAVhu68rep 이외의 이종 rep 단백질이다. 임의의 이러한 AAVhu68 또는 돌연변이체 AAV 캡 시드 서열은 숙주 세포에서 이들의 발현을 지시하는 외인성 조절 서열의 제어하에 있을 수 있다. 일 실시형태에서, 세포는 적합한 세포 배양물(예를 들어, HEK 293 또는 Sf9) 또는 현탁액에서 제조된다. 본 명 세서에 기재된 유전자 요법 벡터를 제조하는 방법은 당업계에 잘 알려진 방법, 예컨대, 유전자 요법 벡터의 생 성에 사용되는 플라스미드 DNA의 생성, 벡터의 생성 및 벡터의 정제를 포함한다. 일부 실시형태에서, 유전자 요 법 벡터는 AAV 벡터이고, 생성된 플라스미드는 AAV 벡터 게놈 및 관심 있는 유전자를 암호화하는 AAV 시스-플라 스미드, AAV rep와 cap 유전자를 포함하는 AAV 트랜스-플라스미드 및 아데노바이러스 헬퍼 플라스미드이다. 벡 터 생성 과정은 세포 배양의 개시, 세포 계대, 세포 접종, 플라스미드 DNA를 이용한 세포의 형질감염, 무혈청 배지로의 형질감염후 배지 교환 및 벡터-포함 세포 및 배양 배지의 수확과 같은 방법 단계를 포함할 수 있다. 수확된 벡터-포함 세포 및 배양 배지는 본 명세서에서 미정제(crude) 세포 수확물로 지칭된다. 또 다른 시스템 에서, 유전자 요법 벡터는 바큘로바이러스-기반 벡터를 이용하는 감염에 의해 곤충 세포로 도입된다. 이러한 생 성 시스템에 대한 검토를 위해, 일반적으로, 예를 들어, 문헌[Zhang et al., 2009, \"Adenovirus-adeno- associated virus hybrid for large-scale recombinant adeno-associated virus production,\" Human GeneTherapy 20:922-929]을 참조하며, 이의 각각의 내용 은 그 전문이 참조에 의해 본 명세서에 원용된다. 이들 및 다른 AAV 생성 시스템을 제조하고 사용하는 방법은 또한 다음 미국 특허에 기재되어 있으며, 이들 각각의 내용 은 그 전문이 참조에 의해 본 명세서에 원용된다: 제5,139,941호; 제5,741,683호; 제6,057,152호; 제6,204,059 호; 제6,268,213호; 제6,491,907호; 제6,660,514호; 제6,951,753호; 제7,094,604호; 제7,172,893호; 제 7,201,898호; 제7,229,823호; 및 제7,439,065호. 미정제 세포 수확물은 이후에 방법 단계, 예컨대, 벡터 수확물의 농축, 벡터 수확물의 정용여과, 벡터 수확물의 미세유동화, 벡터 수확물의 뉴클레이스 분해, 미세유동화 중간체의 여과, 크로마토그래피에 의한 미정제물 정제, 초원심분리에 의한 미정제물 정제, 접선 유동 여과에 의한 완충액 교환 및/또는 벌크 벡터를 제조하기 위 한 제형화 및 여과를 거칠 수 있다. 높은 염 농도에서 2 단계의 친화성 크로마토그래피 정제 후 음이온 교환 수지 크로마토그래피를 사용하여 벡터 의약품을 정제하고 빈 캡시드를 제거한다. 이러한 방법은 WO 2017/160360, 2016년 12월 9일자로 출원된 국제 특 허 PCT/US2016/065970, 및 이의 우선권 문서인 2016년 4월 13일자로 출원된 미국 출원 제62/322,071호 및 명칭 이 \"Scalable Purification Method for AAV9\"인 2015년 12월 11일자로 출원된 미국 특허 제62/226,357호에 보 다 상세하게 기재되어 있으며, 이들은 본 명세서에 참조에 의해 원용된다. 빈 입자 및 전(전체) 입자 함량을 계산하기 위해, 선택된 샘플(예를 들어, 본 명세서의 예에서 이오딕사놀 구배 -정제된 제제, 여기서 게놈 카피(GC)의 # = 입자의 #)에 대한 VP3 밴드 부피를 로딩된 GC 입자에 대해 플롯팅한 다. 생성된 선형 방정식(y = mx+c)을 사용하여 테스트 물질 피크의 밴드 부피에서 입자 수를 계산한다. 그 다음 로딩된 20㎕당 입자의 수(pt)에 50을 곱하여 입자(pt)/㎖를 제공한다. pt/㎖를 GC/㎖로 나눈 값은 게놈 카피에 대한 입자의 비율(pt/GC)을 제공한다. pt/㎖-GC/㎖는 빈 pt/㎖를 제공한다. 빈 pt/㎖를 pt/㎖로 나누고 100을 곱하여 빈 입자의 백분율을 제공한다. 일반적으로, 패키징된 게놈이 있는 AAV 벡터 입자 및 빈 캡시드를 분석하는 방법은 당업계에 알려져 있다. 예를 들어, 문헌[Grimm et al., Gene Therapy 6:1322-1330; Sommer et al., Molec. Ther. 7:122- 128] 참조. 변성된 캡시드를 테스트하기 위해, 방법은 처리된 AAV 스톡을, 세 가지 캡시드 단백질을 분리할 수 있는 임의의 겔, 예를 들어, 완충액에 3% 내지 8% Tris-아세테이트를 포함하는 구배 겔로 이루어진 SDS-폴리아 크릴아마이드 겔 전기영동에 적용하는 단계, 그 다음 샘플 물질이 분리될 때까지 겔을 실행하는 단계 및 겔을 나일론 또는 나이트로셀룰로스 막, 바람직하게는 나일론에 블롯팅하는 단계를 포함한다. 그 다음, 항-AAV 캡시 드 항체를 변성 캡시드 단백질에 결합하는 일차 항체, 바람직하게는 항-AAV 캡시드 단일클론 항체, 가장 바람직 하게는 B1 항-AAV-2 단일클론 항체로서 사용된다(문헌[Wobus et al., J. Virol. 74:9281-9293]). 그 다 음, 일차 항체에 결합하고, 일차 항체, 보다 바람직하게는 이에 공유 결합된 검출 분자를 포함하는 항-IgG 항체, 가장 바람직하게는 서양고추냉이 퍼옥시데이스에 공유 결합된 양 항-마우스 IgG 항체와의 결합을 검출하 기 위한 수단을 포함하는 이차 항체를 사용한다. 결합을 검출하기 위한 방법은 일차 항체 및 이차 항체 사이의 결합을 반-정량적으로 결정하는 데 사용되며, 바람직하게는 방사성 동위원소 방출, 전자기 방사 또는 비색 변화 를 검출할 수 있는 검출 방법, 가장 바람직하게는 화학발광 검출 키트가 사용된다. 예를 들어, SDS-PAGE의 경우, 칼럼 분획으로부터 샘플을 취하고, 환원제(예를 들어, DTT)를 포함하는 SDS-PAGE 로딩 완충액에서 가열될 수 있고, 캡시드 단백질은 미리 주조된(pre-cast) 구배 폴리아크릴아마이드 겔(예를 들어, Novex) 상에서 분해 되었다. 은 염색은 제조업체의 지침에 따라 SilverXpress(인비트로젠(Invitrogen), 캐나다 소재)를 사용하거나 다른 적합한 염색 방법, 즉, SYPRO 루비 또는 쿠마시 염색을 사용하여 수행될 수 있다. 일 실시형태에서, 칼럼 분획 중 AAV 벡터 게놈(vg)의 농도는 정량적 실시간 PCR(Q-PCR)에 의해 측정될 수 있다. 샘플을 희석하고 DNase I(또는 또 다른 적합한 뉴클레이스)로 분해하여 외인성 DNA를 제거한다. 뉴클레이스의 불활성화 후, 샘플을 추 가로 희석하고 프라이머 및 프라이머 사이의 DNA 서열에 특이적인 TaqMan™ 형광 프로브를 사용하여 증폭시킨다. 정의된 형광 수준(역치 주기, Ct)에 도달하는 데 필요한 주기 수를 Applied Biosystems Prism 7700 서열 검출 시스템에서 각 샘플에 대해 측정한다. AAV 벡터에 포함된 것과 동일한 서열을 포함하는 플라스 미드 DNA를 이용하여 Q-PCR 반응에서 표준 곡선을 생성한다. 샘플로부터 얻은 주기 역치(Ct) 값을 사용하여 이 를 플라스미드 표준 곡선의 Ct 값으로 정규화함으로써 벡터 게놈 역가를 결정한다. 디지털 PCR에 기반한 종말점 분석도 또한 사용될 수 있다. 일 양태에서, 광역 세린 프로테이스, 예를 들어 프로테이네이스 K(예컨대, 퀴아젠으로부터 상업적으로 입수 가 능한 것)를 이용하는 최적화된 q-PCR 방법이 사용된다. 더욱 상세하게는, 최적화된 qPCR 게놈 역가 검정은 DNase I 분해 후 샘플을 프로테이네이스 K로 희석하고 프로테이네이스 K로 처리한 다음 열 불활성화시킨다는 점 을 제외하고, 표준 검정과 유사하다. 적합하게는 샘플은 샘플 크기와 동일한 양의 프로테이네이스 K 완충액으로희석된다. 프로테이네이스 K 완충액은 2배 이상으로 농축될 수 있다. 전형적으로, 프로테아나제 K 처리는 약 0.2 ㎎/㎖이지만, 0.1 ㎎/㎖ 내지 약 1 ㎎/㎖로 다양할 수 있다. 처리 단계는 일반적으로 약 55℃에서 약 15분 동안 수행되지만, 더 낮은 온도(예를 들어, 약 37℃ 내지 약 50℃)에서 더 긴 기간(예를 들어, 약 20분 내지 약 30분)에 걸쳐, 또는 더 높은 온도(예를 들어, 최대 약 60℃)에서 더 짧은 기간(예를 들어, 약 5 내지 10분) 동 안 수행될 수 있다. 유사하게는, 열 불활성화는 일반적으로 약 95℃에서 약 15분 동안이지만, 온도가 더 낮아지 고(예를 들어, 약 70 내지 약 90℃) 시간이 연장될 수 있다(예를 들어, 약 20분 내지 약 30분). 그 다음 샘플을 희석하고(예를 들어, 1000배), 표준 검정에 기재된 바와 같이 TaqMan 분석을 수행한다. 추가적으로, 또는 대안적으로, 액적 디지털 PCR(droplet digital PCR: ddPCR)이 사용될 수 있다. 예를 들어, ddPCR에 의해 단일-가닥 및 자가-상보성 AAV 벡터 게놈 역가를 결정하는 방법이 설명된 바 있다. 예를 들어, 문 헌[M. Lock et al, Hu Gene Therapy Methods, Hum Gene Ther Methods. 2014 Apr;25:115-25. doi: 10.1089/hgtb.2013.131. Epub 2014 Feb 14] 참조."}
{"patent_id": "10-2021-7039381", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "요약하면, 게놈-결핍 rAAVhu68 중간체로부터 패키징된 게놈 서열을 갖는 rAAVhu68 입자를 분리하는 방법은 재조 합 rAAVhu68 바이러스 입자 및 AAVhu68 캡시드 중간체를 포함하는 현탁액을 고속 액체 크로마토그래피에 적용하 는 단계를 포함하며, 여기서 rAAVhu68 바이러스 입자 및 rAAVhu68 중간체는 pH 약 10.2에서 평형화된 강한 음이 온 교환 수지에 결합되고, 약 260 나노미터(㎚) 및 약 280㎚에서 자외선 흡광도에 대해 용출액을 모니터링하면 서 염 구배가 적용된다. rAAVhu68에 대해 덜 최적이지만, pH는 약 10.0 내지 10.4의 범위일 수 있다. 이 방법에 서, AAVhu68 전체 캡시드는 A260/A280 비율이 변곡점에 도달할 때 용출되는 분획으로부터 수집된다. 일 예에서, 친화성 크로마토그래피 단계의 경우, 정용여과된 생성물이 AAV2/hu68 혈청형을 효율적으로 포획하는 Capture Select™ Poros- AAV2/9 친화성 수지(라이프 테크놀로지스(Life Technologies))에 적용될 수 있다. 이러한 이 온 조건 하에서, 상당한 비율의 잔류 세포 DNA 및 단백질이 칼럼을 통해 흐르는 한편, AAV 입자가 효율적으로 포획된다. rAAV.hARSA는 적합한 생리학적으로 상용성인 조성물(예를 들어, 완충 식염수)에 현탁된다. 이 조성물은 저장을 위해 동결되고, 나중에 해동되며, 선택적으로 적합한 희석제로 희석될 수 있다. 대안적으로, 벡터는 동결 및 해 동 단계를 거치지 않고 환자에게 전달하기에 적합한 조성물로 제조될 수 있다. 본 명세서에서 사용되는 바와 같이, 용어 \"NAb 역가\"는 표적화된 에피토프(예를 들어, AAV)의 생리적 효과를 중 화시키는 중화 항체(예를 들어, 항-AAV Nab)가 생성되는 정도의 측정값이다. 항-AAV NAb 역가는, 예를 들어, 본 명세서에 참조에 의해 원용되어 있는 문헌[Calcedo, R., et al., Worldwide Epidemiology of Neutralizing Antibodies to Adeno-Associated Viruses. Journal of Infectious Diseases, 2009. 199: p. 381-390]에 기 술된 바와 같이 측정될 수 있다. 약어 \"sc\"는 자가-상보성을 지칭한다. \"자가-상보성 AAV\"는 재조합 AAV 핵산 서열에 의해 운반되는 코딩 영역이 분자 내 이중-가닥 DNA 주형을 형성하도록 설계된 작제물을 지칭한다. 감염시, 제2 가닥의 세포 매개 합성을 기 다리지 않고 scAAV의 2개의 상보적인 반쪽이 회합하여 즉각적인 복제 및 전사 준비가 된 하나의 이중 가닥 DNA(dsDNA) 단위를 형성한다. 예를 들어, 문헌[D M McCarty et al, \"Self-complementary recombinant adeno- associated virus (scAAV) vectors promote efficient transduction independently of DNA synthesis\", Gene Therapy, (August 2001), Vol 8, Number 16, Pages 1248-1254] 참조. 자가-상보성 AAV는, 예를 들어, 미국 특 허 제6,596,535호; 제7,125,717호; 및 제7,456,683호에 기술되어 있으며, 이들 각각은 그 전문이 참조에 의해 본 명세서에 원용된다. \"복제-결함 바이러스\" 또는 \"바이러스 벡터\"는 관심 있는 유전자를 포함하는 발현 카세트가 바이러스 캡시드 또 는 외피에 패키징되어 있는 합성 또는 인공 바이러스 입자를 지칭하며, 여기서 또한 바이러스 캡시드 또는 외피 에 패키징되어 있는 임의의 바이러스 게놈 서열은 복제-결함이고; 즉, 자손 비리온을 생성할 수 없지만 표적 세 포를 감염시키는 능력은 보유한다. 일 실시형태에서, 바이러스 벡터의 게놈은 복제에 필요한 효소를 암호화하는 유전자를 포함하지 않지만(게놈은 인공 게놈의 증폭 및 패키징에 필요한 신호가 측면에 있는 관심 있는 유전자 만을 포함하는 \"거트리스(gutless)\"가 되도록 조작될 수 있음), 이들 유전자는 생성 동안 공급될 수 있다. 따라 서, 복제에 필요한 바이러스 효소가 존재하는 경우를 제외하고 자손 비리온에 의한 복제 및 감염이 일어나지 못 하므로 유전자 요법에서 사용하기에 안전한 것으로 여겨진다. 많은 경우에, rAAV 입자는 DNase 저항성이라고 지칭된다. 그러나, 이러한 엔도뉴클레이스(DNase)에 추가적으로, 오염된 핵산을 제거하기 위해 다른 엔도뉴클레이스 및 엑소뉴클레이스가 또한 본 명세서에 기재된 정제 단계에 서 사용될 수 있다. 이와 같은 뉴클레이스는 단일 가닥 DNA 및/또는 이중-가닥 DNA 및 RNA를 분해하도록 선택될수 있다. 이러한 단계는 단일 뉴클레이스 또는 상이한 표적에 대한 뉴클레이스의 혼합물을 포함할 수 있으며, 엔도뉴클레이스 또는 엑소뉴클레이스일 수 있다. 용어 \"뉴클레이스-저항성\"은 AAV 캡시드가 유전자를 숙주 세포에 전달하도록 설계된 발현 카세트 주위에 완전히 조립되어 있고, 생산 과정에서 존재할 수 있는 오염된 핵산을 제거하도록 설계된 뉴클레이스 인큐베이션 단계 동안 분해(소화)로부터 이러한 패키징된 게놈 서열을 보호한다는 것을 나타낸다. VI. 다른 벡터 일 양태에서, ARSA 돌연변이와 관련되거나 또는 기능성 아릴설파테이스 A의 정상 수준의 결핍에 의해 야기되는 질환(예를 들어, MLD)의 치료를 필요로 하는 대상체에서 ARSA 돌연변이와 관련되거나 또는 기능성 아릴설파테이 스 A의 정상 수준의 결핍에 의해 야기되는 질환을 치료하는데 유용한 벡터가 본 명세서에 제공된다. 벡터는 표 적 세포에서 hARSA 발현을 지시하는 조절 서열의 제어하에 기능성 인간 아릴설파테이스 A(hARSA)를 암호화하는 핵산 서열을 운반한다. 소정의 실시형태에서, hARSA 코딩 서열은 서열번호 1과 약 95% 내지 100% 동일하다. 추 가적으로 또는 대안적으로, 기능성 hARSA 단백질은 서열번호 2의 아미노산 서열을 갖는다. 소정의 실시형태에서, hARSA-코딩 서열은 서열번호 1이다. 소정의 실시형태에서, 벡터 또는 벡터를 포함하는 조성물은 ARSA 돌연변이와 관련되거나 또는 기능성 아릴설파테이스 A의 정상 수준의 결핍에 의해 야기되는 질환(예를 들 어, MLD)의 증상을 개선하고/하거나 ARSA 돌연변이와 관련되거나 또는 기능성 아릴설파테이스 A의 정상 수준의 결핍에 의해 야기되는 질환(예를 들어, MLD)의 진행을 지연시키기 위해 이를 필요로 하는 대상체에 투여될 수 있다. 소정의 실시형태에서, 벡터는 발현 카세트를 포함한다. 소정의 실시형태에서, 발현 카세트는 hARSA 발현을 지시 하는 조절 서열의 제어하에 기능성 인간 아릴설파테이스 A(hARSA)를 암호화하는 핵산 서열을 포함한다. 소정의 실시형태에서, 기능성 hARSA 단백질은 신호 펩타이드 및 서열번호 2의 19번 아미노산(aa) 내지 507번 aa의 아미 노산 서열을 포함한다. 소정의 실시형태에서, 신호 펩타이드는 서열번호 2의 1번 aa 내지 18번 aa의 아미노산 서열 또는 서열번호 4의 1번 aa 내지 20번 aa의 아미노산 서열을 갖는다. 소정의 실시형태에서, hARSA 코딩 서 열은 서열번호 1의 55번 뉴클레오타이드(nt) 내지 1521번 nt의 서열 또는 기능성 hARSA를 암호화하는 서열과 적 어도 95% 내지 99.9% 동일한 서열을 갖는다. 소정의 실시형태에서, hARSA 코딩 서열은 서열번호 1 또는 서열번 호 3이다. 자세한 내용은 I부 및 III부를 참조. 소정의 실시형태에서, 벡터는 재조합 파보바이러스, 재조합 렌티바이러스, 재조합 레트로바이러스 또는 재조합 아데노바이러스로부터 선택되는 바이러스 벡터; 또는 네이키드 DNA, 네이키드 RNA, 무기 입자, 지질 입자, 중합 체-기반 벡터 또는 키토산-기반 제형으로부터 선택되는 비-바이러스 벡터이다. 선택된 벡터는 형질감염, 전기천 공법, 리포솜 전달, 막 융합 기법, 고속 DNA-코팅된 펠릿, 바이러스 감염 및 원형질 융합을 포함하는 임의의 적 합한 방법에 의해 전달될 수 있다. 이러한 작제물을 만드는데 사용되는 방법은 핵산 조작 숙련자에게 공지되어 있으며, 유전공학, 재조합 공학 및 합성 기법을 포함한다. 예를 들어, 문헌[Sambrook et al, Molecular Cloning: A Laboratory Manual, Cold Spring Harbor Press, Cold Spring Harbor, NY] 참조. 소정의 실시형태에서, 벡터는 대수조 내로의 CT-유도 후두하 주사를 통한 것을 포함하는 대수조내 주사(ICM)를 통해 환자에게 투여하기에 적합하다. 소정의 실시형태에서, 벡터는 7세 이하인 대상체에 투여하기에 적합하다. 소정의 실시형태에서, 벡터는 아릴설파테이스 A(ARSA) 유전자 돌연변이와 관련된 이염성 백질이영양증 또는 질 환의 증상을 개선하고/하거나 아릴설파테이스 A(ARSA) 유전자 돌연변이와 관련된 이염성 백질이영양증 또는 질 환의 진행을 지연시키기 위해 이를 필요로 하는 대상체에 투여하기에 적합하다. 소정의 실시형태에서, 벡터는 단일 용량으로 투여된다. 자세한 내용은 II부 및 VIII부를 참조. \"복제-결함 바이러스\" 또는 \"바이러스 벡터\"는 관심 있는 유전자(예를 들어, hARSA 코딩 서열)을 포함하는 발현 카세트가 바이러스 캡시드 또는 외피에 패키징되어 있는 합성 또는 인공 바이러스 입자를 지칭하며, 여기서 또 한 바이러스 캡시드 또는 외피에 패키징되어 있는 임의의 바이러스 게놈 서열은 복제-결함이고; 즉, 이들은 자 손 비리온을 생성할 수 없지만 표적 세포를 감염시킬 수 있는 능력을 보유한다. 일 실시형태에서, 바이러스 벡 터의 게놈은 복제에 필요한 효소를 암호화하는 유전자를 포함하지 않지만(게놈은 인공 게놈의 증폭 및 패키징에 필요한 신호가 측면에 있는 관심 있는 유전자만을 포함하는 \"거트리스(gutless)\"가 되도록 조작될 수 있음), 이 들 유전자는 생성 동안 공급될 수 있다. 따라서, 복제에 필요한 바이러스 효소가 존재하는 경우를 제외하고 자 손 비리온에 의한 복제 및 감염이 일어나지 못하므로 유전자 요법에서 사용하기에 안전한 것으로 여겨진다. 이 러한 복제-결함 바이러스는 아데노-관련 바이러스(AAV), 아데노바이러스, 렌티바이러스(통합 또는 비-통합) 또 는 또 다른 적합한 바이러스 공급원일 수 있다.VII. 조성물 추가의 양태에서, 본 명세서에 개시된 바와 같은 rAAV 또는 벡터 및 수성 현탁 매질을 포함하는 조성물이 본 명 세서에 제공된다. 소정의 실시형태에서, 제형 완충액 및 기재된 바와 같은 rAAV 또는 벡터를 포함하는 수성 조 성물이 제공된다. 소정의 실시형태에서, 제형 완충액은 완충 식염수, 및 소듐, 칼슘, 마그네슘, 포타슘 또는 이 들의 혼합물 중 하나 이상; 및 계면활성제를 포함하는 인공 뇌척수액을 포함한다. 소정의 실시형태에서, 제형 완충액은 약 0.0005% 내지 약 0.001%의 계면활성제를 포함한다. 소정의 실시형태에서, 조성물의 pH는 7.2 내지 7.8이다. 소정의 실시형태에서, AAV.CB7.CI.hARSAco.rBG 의약품은 본 명세서에 개시된 바와 같은 비-복제 재조 합 아데노관련 바이러스(rAAV) 벡터 및 제형 완충액으로 구성된다. 소정의 실시형태에서, 제1항 내지 제10항 중 어느 하나에 따른 rAAV 및 제형 완충액을 포함하는 수성 약제학적 조성물이 제공된다. 소정의 실시형태에서, 제형 완충액은 완충 식염수, 및 소듐, 칼슘, 마그네슘, 포타슘 또는 이들의 혼합물 중 하나 이상을 포함하는 인공 뇌척수액; 및 계면활성제를 포함한다. 소정의 실시형태에서, 계면 활성제 약제학적 조성물의 0.0005% 내지 약 0.001%로 존재한다. 소정의 실시형태에서, 조성물의 pH는 7.5 내지 7.8의 범위이다. 소정의 실시형태에서, 제형 완충액은 정맥내 전달, 척수강내 투여 또는 뇌실내 투여에 적합하 다. 소정의 실시형태에서, 기재된 바와 같은 벡터 및 제형 완충액을 포함하는 약제학적 조성물이 제공된다. 소정의 실시형태에서, 제형 완충액은 정맥내 전달, 척수강내 투여 또는 뇌실내 투여에 적합하다. 소정의 실시형태에서, 조성물은 대수조 내로의 CT-유도 후두하 주사를 통한 것을 포함하는 대수조내 주사(ICM) 를 통해 환자에게 투여하기에 적합하다. 소정의 실시형태에서, 조성물은 7세 이하인 대상체에 투여하기에 적합 하다. 소정의 실시형태에서, 조성물은 아릴설파테이스 A(ARSA) 유전자 돌연변이와 관련된 이염성 백질이영양증 또는 질환의 증상을 개선하고/하거나 아릴설파테이스 A(ARSA) 유전자 돌연변이와 관련된 이염성 백질이영양증 또는 질환의 진행을 지연시키기 위해 이를 필요로 하는 대상체에 투여하기에 적합하다. 소정의 실시형태에서, 조성물은 단일 용량으로 투여된다. 소정의 실시형태에서, 조성물은 ㎖당 적어도 2.50×1013 GC rAAV를 갖는다. 적어도 하나의 rAAV 스톡(예를 들어, rAAVhu68 스톡 또는 돌연변이체 rAAVhu68 스톡) 및 선택적 담체, 부형제 및/또는 보존제를 포함하는 조성물이 본 명세서에 제공된다. rAAV 스톡은 농도 및 투여량 단위의 논의에서 하기 기재된 양과 동일한 복수의 rAAV 벡터를 지칭한다. 본 명세서에서 사용되는 바와 같이, \"담체\"는 임의의 및 모든 용매, 분산 매질, 비히클, 코팅제, 희석제, 항균 제 및 항진균제, 등장화제 및 흡수 지연제, 완충제, 담체 용액, 현탁액, 콜로이드 등을 포함한다. 약제학적 활 성 물질을 위한 이와 같은 매질 및 작용제의 사용은 당업게에 잘 알려져 있다. 보충 활성 성분이 또한 조성물에 포함될 수 있다. 어구 \"약학적으로 허용 가능한\"은 숙주에게 투여될 때 알레르기 반응 또는 유사한 부반응을 나 타내지 않는 분자 실체 및 조성물을 지칭한다. 전달 비히클, 예컨대, 리포솜, 나노캡슐, 마이크로입자, 마이크 로스피어, 지질 입자, 소포 등이 본 발명의 조성물을 적합한 숙주 세포로 도입하는 데 사용될 수 있다. 특히, rAAV 벡터로 전달되는 벡터 게놈은 지질 입자, 리포솜, 소포, 나노스피어, 또는 나노입자 등에 캡슐화된 전달을 위해 제형화될 수 있다. 일 실시형태에서, 조성물은 대상체에게 전달하기에 적합한 최종 제형을 포함하고, 예를 들어 생리학적으로 양립 가능한 pH 및 염 농도로 완충된 수성 액체 현탁액이다. 선택적으로, 하나 이상의 계면활성제가 제형에 존재한다. 또 다른 실시형태에서, 조성물은 대상체에 투여하기 위해 희석되는 농축물로서 수송될 수 있다. 다른 실시형태에서, 조성물은 동결건조되고 투여시 재구성될 수 있다. 적합한 계면활성제 또는 계면활성제의 조합물이 무독성인 비이온성 계면활성제 중에서 선택될 수 있다. 일 실시 형태에서, 예를 들어, 중성 pH를 가지고 평균 분자량이 8400인 Pluronic® F68[BASF](폴록사머(Poloxamer) 188 로도 알려짐)과 같은 일차 하이드록실기로 종결되는 이작용성 블록 공중합체 계면활성제가 선택된다. 다른 계면 활성제 및 다른 폴록사머, 즉, 폴리옥시에틸렌(폴리(에틸렌 옥사이드))의 2개의 친수성 사슬이 측면에 있는 폴 리옥시프로필렌(폴리(프로필렌 옥사이드))으로 구성된 비이온성 삼중블록 공중합체, SOLUTOL HS 15(마크로골-15 하이드록시스테아레이트), LABRASOL(폴리옥시 카프릴릭 글리세라이드), 폴리옥시 10 올레일 에터, TWEEN(폴리옥 시에틸렌 소르비탄 지방산 에스터), 에탄올 및 폴리에틸렌 글리콜이 선택될 수 있다. 일 실시형태에서, 제형은 폴록사머를 포함한다. 이러한 공중합체는 일반적으로 문자 \"P\"(폴록사머의 경우)와 그 다음의 세 자리 숫자로 명명되며; 처음 2자리 숫자×100은 폴리옥시프로필렌 코어의 대략적인 분자량을 나타내고, 마지막 숫자×10은 폴리옥시에틸렌 함량 백분율을 나타낸다. 일 실시형태에서, 폴록사머 188이 선택된다. 일 실시형태에서, 계면활성제는 현탁액의 최대 약 0.0005% 내지 약 0.001%(중량비 기준, w/w%)의 양으로 존재할 수 있다. 또 다른 실시 형태에서, 계면활성제는 현탁액의 최대 약 0.0005% 내지 약 0.001%(부피비 기준, v/v%)의 양으로 존재할 수 있 다. 다른 실시형태에서, 계면활성제는 현탁액의 최대 약 0.0005% to 약 0.001%의 양으로 존재할 수 있되, n%는 현탁액의 100㎖당 n 그램을 나타낸다. 또 다른 실시형태에서, 계면활성제는 양 현탁액의 최대 약 0.0005% 내지 약 0.001%(부피에 대한 중량비 기준, v/w%)의 양으로 존재할 수 있다. 본 명세서에서 사용되는 바와 같이, 소정의 실시형태에서, 농도를 언급할 때 \"%\"는 중량비, 예를 들어, 용매의 중량에 대한 물질(용매를 통해 용액에 용해됨) 중량의 백분율 또는 용액의 중량에 대한 물질(용매를 통해 용액 에 용해됨) 중량의 백분율이다. 소정의 실시형태에서, 농도를 언급할 때 \"%\"는 부피비, 예를 들어, 용매의 부피 에 대한 물질(용매를 통해 용액에 용해됨) 부피의 백분율 또는 용액의 부피에 대한 물질(용매를 통해 용액에 용 해됨) 부피의 백분율이다. 소정의 실시형태에서, 농도를 언급할 때 \"%\"는 용매 또는 용액 100㎖당 물질(용매를 통해 용액에 용해됨)의 그램을 나타낸다. 소정의 실시형태에서, 농도를 언급할 때 \"%\"는 부피에 대한 중량비, 예를 들어, 용매의 부피에 대한 물질(용매를 통해 용액에 용해됨) 중량의 백분율 또는 용액의 부피에 대한 물질 (용매를 통해 용액에 용해됨) 중량의 백분율이다. 벡터는 세포를 형질감염시키고 과도한 이상 반응 없이 또는 의학적으로 허용 가능한 생리학적 효과와 함께 치료 적 이익을 제공하는 충분한 수준의 유전자 전달 및 발현을 제공하기에 충분한 양으로 투여되며, 이는 의학 업계 의 당업자에 의해 결정될 수 있다. 종래의 약학적으로 허용 가능한 투여 경로는 목적하는 기관(예를 들어, 뇌, CSF, 간(선택적으로 간동맥을 통함), 폐, 심장, 눈, 신장)으로의 직접 전달, 경구, 흡입, 비강내, 기관내, 척수 강내, 기관내, 동맥내, 안내, 정맥내, 근육내, 피하, 피내, 뇌실질내(intraparenchymal), 뇌실내, 척추강내, ICM, 요추 천자 및 다른 비경구 투여 경로를 포함하지만, 이들로 제한되지 않는다. 원하는 경우 투여 경로는 조 합될 수 있다. 바이러스 벡터의 투여량은 주로 치료될 병태, 환자의 연령, 체중 및 건강상태와 같은 요인에 따라 달라지므로, 환자마다 다를 수 있다. 예를 들어, 바이러스 벡터의 치료적으로 유효한 인간 투여량은 일반적으로 약 1×109 내 지 1×1016 벡터 게놈 카피의 농도를 포함하는 약 25 마이크로리터 내지 약 1000 마이크로리터에서 약 100㎖의 용액의 범위이다. 소정의 실시형태에서, 약 1㎖ 내지 약 15㎖ 또는 약 2.5㎖ 내지 약 10㎖ 또는 약 5㎖의 현탁 액의 부피가 전달된다. 소정의 실시형태에서, 약 1㎖, 약 2㎖, 약 3㎖, 약 4㎖, 약 5㎖, 약 6㎖, 약 7㎖, 약 8 ㎖, 약 9㎖, 약 10㎖, 약 11㎖, 약 12㎖, 약 13㎖, 약 14㎖ 또는 약 15㎖의 현탁액의 부피가 전달된다. 소정의 실시형태에서, 약 8.9×1012 내지 2.7×1014 GC 총 용량이 이 부피로 투여된다. 소정의 실시형태에서, 약 1.1× 1010 GC/뇌 질량 g 내지 약 3.3×1011 GC/뇌 질량 g의 용량이 이 부피로 투여된다. 소정의 실시형태에서, 뇌 질 량 그램당 약 3.0×109, 약 4.0×109, 약 5.0×109, 약 6.0×109, 약 7.0×109, 약 8.0×109, 약 9.0×109, 약 1.0×1010, 약 1.1×1010, 약 1.5×1010, 약 2.0×1010, 약 2.5×1010, 약 3.0×1010, 약 3.3×1010, 약 3.5×1010, 약 4.0×1010, 약 4.5×1010, 약 5.0×1010, 약 5.5×1010, 약 6.0×1010, 약 6.5×1010, 약 7.0×1010, 약 7.5× 1010, 약 8.0×1010, 약 8.5×1010, 약 9.0×1010, 약 9.5×1010, 약 1.0×1011, 약 1.1×1011, 약 1.5×1011, 약 2.0×1011, 약 2.5×1011, 약 3.0×1011, 약 3.3×1011, 약 3.5×1011, 약 4.0×1011, 약 4.5×1011, 약 5.0×1011, 약 5.5×1011, 약 6.0×1011, 약 6.5×1011, 약 7.0×1011, 약 7.5×1011, 약 8.0×1011, 약 8.5×1011, 약 9.0× 1011 GC의 용량이 이 부피로 투여된다."}
{"patent_id": "10-2021-7039381", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "투여량은 임의의 이상 반응에 대한 치료적 이익의 균형을 맞추기 위해 조정될 것이며, 이와 같은 투여량은 재조 합 벡터가 이용되는 치료적 적용에 따라 달라질 수 있다. 이식유전자 생성물의 발현 수준은 바이러스 벡터, 바 람직하게는 미니유전자를 함유하는 AAV 벡터를 생성하는 투여 빈도를 결정하기 위해 모니터링될 수 있다. 선택적으로, 치료적 목적을 위해 기재된 것과 유사한 투여 양생법이 본 발명의 조성물을 사용한 면역화에 이용될 수 있다. 복제-결함 바이러스 조성물은 약 1.0×109 GC 내지 약 1.0×1016 GC(대상체를 치료하기 위해)의 범위(범위 내의 모든 정수 또는 분수의 양을 포함함) 및 바람직하게는, 인간 환자의 경우 1.0×1012 GC 내지 1.0×1014 GC인 복 제-결함 바이러스의 양을 포함하도록 투여 단위로 제형화될 수 있다. 일 실시형태에서, 조성물은 용량당 적어도 1×109, 2×109, 3×109, 4×109, 5×109, 6×109, 7×109, 8×109 또는 9×109 GC(범위 내의 모든 정수 또는 분수 의 양을 포함함)를 포함하도록 제형화된다. 또 다른 실시형태에서, 조성물은 용량당 적어도 1×1010, 2×1010, 3 ×1010, 4×1010, 5×1010, 6×1010, 7×1010, 8×1010 또는 9×1010 GC(범위 내의 모든 정수 또는 분수의 양을 포함 함)를 포함하도록 제형화된다. 또 다른 실시형태에서, 조성물은 용량당 적어도 1×1011, 2×1011, 3×1011, 4× 1011, 5×1011, 6×1011, 7×1011, 8×1011 또는 9×1011 GC(범위 내의 모든 정수 또는 분수의 양을 포함함)를 포함 하도록 제형화된다. 또 다른 실시형태에서, 조성물은 용량당 적어도 1×1012, 2×1012, 3×1012, 4×1012, 5× 1012, 6×1012, 7×1012, 8×1012 또는 9×1012 GC(범위 내의 모든 정수 또는 분수의 양을 포함함)를 포함하도록 제 형화된다. 또 다른 실시형태에서, 조성물은 용량당 적어도 1×1013, 2×1013, 3×1013, 4×1013, 5×1013, 6×1013, 7×1013, 8×1013 또는 9×1013 GC(범위 내의 모든 정수 또는 분수의 양을 포함함)를 포함하도록 제형화된다. 또 다른 실시형태에서, 조성물은 용량당 적어도 1×1014, 2×1014, 3×1014, 4×1014, 5×1014, 6×1014, 7×1014, 8× 1014 또는 9×1014 GC(범위 내의 모든 정수 또는 분수의 양을 포함함)를 포함하도록 제형화된다. 또 다른 실시형 태에서, 조성물은 용량당 적어도 1×1015, 2×1015, 3×1015, 4×1015, 5×1015, 6×1015, 7×1015, 8×1015 또는 9 ×1015 GC(범위 내의 모든 정수 또는 분수의 양을 포함함)를 포함하도록 제형화된다. 일 실시형태에서, 인간 적 용의 경우, 용량은 1×1010 내지 약 1×1012 GC의 범위(범위 내의 모든 정수 또는 분수의 양을 포함함)일 수 있 다. 위의 이들 용량은 치료될 영역의 크기, 사용되는 바이러스 역가, 투여 경로, 및 목적하는 방법의 효과에 따라 약 25 마이크로리터 내지 약 1000 마이크로리터, 또는 더 높은 부피 범위(범위 내의 모든 숫자를 포함함)의 다 양한 부피의 담체, 부형제 또는 완충액 제형으로 투여될 수 있다. 일 실시형태에서, 담체, 부형제 또는 완충액 의 부피는 적어도 약 25㎕이다. 일 실시형태에서, 부피는 약 50㎕이다. 또 다른 실시형태에서, 부피는 약 75㎕ 이다. 또 다른 실시형태에서, 부피는 약 100㎕이다. 또 다른 실시형태에서, 부피는 약 125㎕이다. 또 다른 실시 형태에서, 부피는 약 150㎕이다. 또 다른 실시형태에서, 부피는 약 175㎕이다. 또 다른 실시형태에서, 부피는 약 200㎕이다. 또 다른 실시형태에서, 부피는 약 225㎕이다. 또 다른 실시형태에서, 부피는 약 250㎕이다. 또 다른 실시형태에서, 부피는 약 275㎕이다. 또 다른 실시형태에서, 부피는 약 300㎕이다. 또 다른 실시형태에서, 부피는 약 325㎕이다. 또 다른 실시형태에서, 부피는 약 350㎕이다. 또 다른 실시형태에서, 부피는 약 375㎕이 다. 또 다른 실시형태에서, 부피는 약 400㎕이다. 또 다른 실시형태에서, 부피는 약 450㎕이다. 또 다른 실시형 태에서, 부피는 약 500㎕이다. 또 다른 실시형태에서, 부피는 약 550㎕이다. 또 다른 실시형태에서, 부피는 약 600㎕이다. 또 다른 실시형태에서, 부피는 약 650㎕이다. 또 다른 실시형태에서, 부피는 약 700㎕이다. 또 다른 실시형태에서, 부피는 약 700㎕ 내지 1000㎕이다. 소정의 실시형태에서, 용량은 약 1×109 GC/뇌 질량 g 내지 약 1×1012 GC/뇌 질량 g의 범위일 수 있다. 소정의 실시형태에서, 용량은 약 1×1010 GC/뇌 질량 g 내지 약 1×1012 GC/뇌 질량 g의 범위일 수 있다. 소정의 실시형 태에서, 용량은 약 3×1010 GC/뇌 질량 g 내지 약 5×1011 GC/뇌 질량 g의 범위일 수 있다. 일 실시형태에서, 바이러스 작제물은 적어도 약 적어도 1×109 GC 내지 약 1×1015 또는 약 1×1011 내지 5×1013 GC의 용량으로 전달될 수 있다. 이들 용량 및 농도의 적합한 전달 부피는 당업자에 의해 결정될 수 있다. 예를 들어, 약 1㎕ 내지 150㎖의 부피가 선택될 수 있으며, 성인의 경우 더 많은 부피가 선택될 수 있다. 전형적으로, 신생아의 경우 적합한 부피는 약 0.5㎖ 내지 약 10㎖이고, 더 나이가 든 유아의 경우 약 0.5㎖ 내 지 약 15㎖가 선택될 수 있다. 걸음마를 배우는 아이의 경우 약 0.5㎖ 내지 약 20㎖의 부피가 선택될 수 있다. 어린이의 경우, 최대 약 30㎖의 부피가 선택될 수 있다. 십대 초반 및 십대의 경우, 최대 약 50㎖의 부피가 선택될 수 있다. 또 다른 실시형태에서, 환자는 선택된 약 5㎖ 내지 약 15㎖, 또는 약 7.5㎖ 내지 약 10㎖ 부피로 척수강내 투여를 받을 수 있다. 다른 적합한 부피 및 투여량이 결정될 수 있다. 투여량은 임의의 이상 반응에 대한 치료적 이익의 균형을 맞추기 위해 조정될 수 있으며, 이와 같은 투여량은 재조합 벡터가 이용되는 치료적 적용에 따라 달라질 수 있다. 위에 기재된 재조합 벡터는 공개된 방법에 따라 숙주 세포에 전달될 수 있다. 바람직하게는 생리학적으로 양립 가능한 담체에 현탁된 rAAV는 인간 또는 비인간 포유동물 환자에게 투여될 수 있다. 소정의 실시형태에서, 인간 환자에의 투여를 위해, rAAV는 식염수, 계면활성제, 및 생리학적으로 양립 가능한 염 또는 염의 혼합물을 포함 하는 수용액에 적합하게 현탁된다. 적합하게는, 제형은 생리학적으로 허용 가능한 pH, 예를 들어, pH 6 내지 9, 또는 pH 6.5 내지 7.5, pH 7.0 내지 7.7, 또는 pH 7.2 내지 7.8의 범위로 조정된다. 뇌척수액의 pH는 약 7.28 내지 약 7.32이므로, 척수강내 전달을 위해 이 범위 내의 pH가 바람직할 수 있는 반면; 정맥내 전달을 위해서는, 약 6.8 내지 약 7.2의 pH가 바람직할 수 있다. 그러나, 가장 광범위한 범위 내의 다른 pH 및 이러한 하위범위가 다른 전달 경로를 위해 선택될 수 있다. 또 다른 실시형태에서, 조성물은 담체, 희석제, 부형제 및/또는 보조제를 포함한다. 적합한 담체는 전달 바이러 스가 지시되는 적응증을 고려하여 당업자에 의해 용이하게 선택될 수 있다. 예를 들어, 적합한 한 가지 담체는 식염수를 포함하며, 이는 다양한 완충 용액(예를 들어, 포스페이트 완충 식염수)과 함께 제형화될 수 있다. 다 른 예시적인 담체는 멸균 식염수, 락토스, 수크로스, 칼슘 포스페이트, 젤라틴, 덱스트란, 아가, 펙틴, 땅콩유, 참깨유 및 물을 포함한다. 완충액/담체는 rAAV가 주입 튜브에 달라붙는 것을 방지하지만 생체내에서 rAAV 결합 활성을 방해하지 않는 성분을 포함하여야 한다. 적합한 계면활성제 또는 계면활성제의 조합물이 무독성인 비이 온성 계면활성제 중에서 선택될 수 있다. 일 실시형태에서, 중성 pH를 가지고 평균 분자량이 8400인 폴록사머 188(상품명 Pluronic® F68 [BASF], Lutrol® F68, Synperonic® F68, Kolliphor® P188로도 알려져 있음)과 같은 일차 하이드록실기로 종결되는 이작용성 블록 공중합체 계면활성제가 선택된다. 다른 계면활성제 및 다른 폴록 사머, 즉, 폴리옥시에틸렌(폴리(에틸렌 옥사이드))의 2개의 친수성 사슬이 측면에 있는 폴리옥시프로필렌(폴리 (프로필렌 옥사이드))의 중심 소수성 사슬로 구성된 비이온성 삼중블록 공중합체, SOLUTOL HS 15(마크로골-15 하이드록시스테아레이트), LABRASOL(폴리옥시 카프릴릭 글리세라이드), 폴리옥시-올레일 에터, TWEEN(폴리옥시 에틸렌 소르비탄 지방산 에스터), 에탄올 및 폴리에틸렌 글리콜이 선택될 수 있다. 일 실시형태에서, 제형은 폴 록사머를 포함한다. 이러한 공중합체는 일반적으로 문자 \"P\"(폴록사머의 경우)와 그 다음의 세 자리 숫자로 명 명되며; 처음 2자리 숫자×100은 폴리옥시프로필렌 코어의 대략적인 분자량을 나타내고, 마지막 숫자×10은 폴 리옥시에틸렌 함량 백분율을 나타낸다. 일 실시형태에서, 폴록사머 188이 선택된다. 계면활성제는 현탁액의 최 대 약 0.0005% 내지 약 0.001%의 양으로 존재할 수 있다. 일 예에서, 제형은, 예를 들어, 물 중 소듐 클로라이드, 소듐 바이카보네이트, 덱스트로스, 마그네슘 설페이트 (예를 들어, 마그네슘 설페이트·7H2O), 포타슘 클로라이드, 칼슘 클로라이드(예를 들어, 칼슘 클로라이드· 2H2O), 이염기성 소듐 포스페이트 및 이들의 혼합물 중 하나 이상을 포함하는 완충 식염수 용액을 포함할 수 있 다. 적합하게는, 척추강내 전달의 경우, 삼투압농도는 뇌척수액과 양립 가능한 범위(예를 들어, 약 275 내지 약 290) 내에 있으며; 예를 들어, emedicine.medscape.com/article/2093316-overview를 참조한다. 선택적으로, 척 추강내 전달의 경우, 상업적으로 입수 가능한 희석제가 현탁화제로서, 또는 또 다른 현탁화제 및 다른 선택적인 부형제와 함께 사용될 수 있다. 예를 들어, Elliotts B® 용액[루카레 메디컬(Lukare Medical)] 참조. 각각 10㎖의 Elliotts B 용액은 다음을 포함한다: 소듐 클로라이드, USP - 73㎎; 소듐 바이카보네이트, USP - 19㎎; 덱스트로스, USP 8㎎; 마그네슘 설 페이트·7H2O, USP 3㎎; 포타슘 클로라이드, USP- 3㎎; 칼슘 클로라이드·2H2O, USP - 2㎎; 소듐 포스페이트, 이염기성·7H2O, USP- 2㎎; 주사용수, USP qs 10㎖. 전해질의 농도: 소듐 149 mEq/리터; 바이카보네이트 22.6 mEq/리터; 포타슘 4.0 mEq/리터; 클로라이드 132 mEq/리터; 칼슘 2.7 mEq/리터; 설페이트 2.4 mEq/리터; 마그네슘 2.4 mEq/리터; 포스페이트 1.5 mEq/리터.성분의 분자식과 분자량은 다음과 같다:"}
{"patent_id": "10-2021-7039381", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "Elliotts B 용액의 pH는 6 내지 7.5이고, 삼투압은 (계산된) 리터당 288 mOs㏖이다. 소정의 실시형태에서, rAAVhu68.hARSA를 포함하는 조성물은 6.8 내지 8 또는 7.2 내지 7.8 또는 7.5 내지 8의 범위의 pH에서 전달된 다. 척추강내 전달을 위해, 7.5 초과, 예를 들어, 7.5 내지 8 또는 7.8의 pH가 바람직할 수 있다. 소정의 실시형태에서, 제형은 소듐 바이카보네이트를 포함하지 않는 완충 식염수 수용액을 포함할 수 있다. 이 러한 제형은 물 중 소듐 포스페이트, 소듐 클로라이드, 포타슘 클로라이드, 칼슘 클로라이드, 마그네슘 클로라 이드 및 이들의 혼합물 중 하나 이상을 포함하는 완충 식염수 수용액, 예컨대, Harvard 완충액을 포함할 수 있 다. 수용액은 이전에 상표명 Lutrol® F68로 판매되었던 BASF로부터 상업적으로 입수 가능한 폴록사머인 Kolliphor® P188을 더 포함할 수 있다. 수용액의 pH는 7.2일 수 있다. 또 다른 실시형태에서, 제형은 1mM 소듐 포스페이트(Na3PO4), 150mM 소듐 클로라이드(NaCl), 3mM 포타슘 클로라 이드(KCl), 1.4mM 칼슘 클로라이드(CaCl2), 0.8mM 마그네슘 클로라이드(MgCl2) 및 0.001% 폴록사머(예를 들어, Kolliphor®) 188(pH 7.2)을 포함하는 완충 식염수 수용액을 포함할 수 있다. 예를 들어, harvardapparatus.com/harvard-apparatus-perfusion-fluid.html 참조. 소정의 실시형태에서, Harvard 완충액은 Harvard 완충액으로 관찰되는 더 나은 pH 안정성으로 인해 선호된다. 아래 표는 Harvard 완충액과 Elliot B 완 충액의 비교를 제공한다."}
{"patent_id": "10-2021-7039381", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "소정의 실시형태에서, 제형 완충액은 Pluronic F68이 포함된 인공 CSF이다. 다른 실시형태에서, 제형은 하나 이 상의 투과 증진제를 포함할 수 있다. 적합한 투과 증진제의 예는, 예를 들어, 만니톨, 소듐 글리코콜레이트, 소 듐 타우로콜레이트, 소듐 데옥시콜레이트, 소듐 살리실레이트, 소듐 카프릴레이트, 소듐 카프레이트, 소듐 라우 릴 설페이트, 폴리옥시에틸렌-9-라우렐 에터 또는 EDTA를 포함할 수 있다. 선택적으로, 본 발명의 조성물은 rAAV 및 담체(들)에 추가적으로, 다른 종래의 약제학적 성분, 예컨대, 보존제 또는 화학적 안정화제를 포함할 수 있다. 적합한 예시적인 보존제는 클로로뷰탄올, 포타슘 소르베이트, 소르브 산, 설퍼 다이옥사이드, 프로필 갈레이트, 파라벤, 에틸 바닐린, 글리세린, 페놀 및 파라클로로페놀을 포함한다. 적합한 화학적 안정화제는 젤라틴 및 알부민을 포함한다. 본 발명에 따른 조성물은 위에 정의된 바와 같은 약제학적으로 허용 가능한 담체를 포함할 수 있다. 적합하게는, 본 명세서에 기재된 조성물은 약제학적으로 적합한 담체에 현탁되고/되거나 주사, 삼투 펌프, 척수 강내 카테터를 통한 대상체에의 전달, 또는 다른 장치 또는 경로에 의한 전달을 위해 설계된 적합한 부형제와 혼합된 유효량의 하나 이상의 AAV를 포함한다. 일 예에서, 조성물은 척수강내 전달을 위해 제형화된다. 본 명세서에서 사용되는 바와 같이, 용어 \"척수강내 전달\" 또는 \"척수강내 투여\"는 약물이 뇌척수액(CSF)에 도 달하도록, 척추관, 보다 구체적으로 지주막하공간으로의 주사를 통한 약물에 대한 투여 경로를 지칭한다. 척수 강내 전달은 요추 천자, 뇌실내(측뇌실내(ICV)를 포함함), 후두하/수조내, 및/또는 C1-2 천자를 포함할 수 있다. 예를 들어, 물질은 요추 천자를 통해 지주막하 공간 전체에의 확산을 위해 도입될 수 있다. 또 다른 예에 서, 주사는 대수조 내로 이루어질 수 있다. 본 명세서에서 사용되는 바와 같이, 용어 \"수조내 전달\" 또는 \"수조내 투여\"는 대수조 소뇌연수(cisterna magna cerebellomedularis)의 뇌척수액으로 직접, 보다 구체적으로 후두하 천자를 통한 또는 대수조로의 직접 주사 또 는 영구적으로 위치한 튜브를 통한 약물에 대한 투여 경로를 지칭한다. 소정의 실시형태에서, 최종 제형 완충액은 완충 식염수, 및 소듐, 칼슘, 마그네슘, 포타슘 또는 이들의 혼합물 중 하나 이상을 포함하는 인공 뇌척수액; 및 계면활성제를 포함한다. 소정의 실시형태에서, 계면활성제는 현탁 액의 약 0.0005% w/w 내지 약 0.001% w/w이다. 소정의 실시형태에서, 계면활성제는 Pluronic F68이다. 소정의 실시형태에서, Pluronic F68은 현탁액의 약 0.0001%의 양으로 존재한다. 소정의 실시형태에서, 조성물은 척추강 내 전달을 위해 pH가 7.5 내지 7.8이다. 소정의 실시형태에서, 본 명세서에 기재된 조성물의 처리는 동물 및/또는 인간 환자에서 DRG 감각 뉴런의 최소 내지 경증의 무증상 변성을 가지며, 감각 신경 독성 및 잠재성 감각 뉴런 병변과 관련하여 내약성이 우수하다. 소정의 실시형태에서, 본 명세서에 기재된 조성물은 처리된 대상체에서 기능적 및 임상적 결과를 개선하는데 유 용하다. 이러한 결과는 조성물의 투여 후 약 30일, 약 60일, 약 90일, 약 4개월, 약 5개월, 약 6개월, 약 7개월, 약 8개월, 약 9개월, 약 10개월, 약 11개월, 약 12개월, 약 13개월, 약 14개월, 약 15개월, 약 16개월, 약 17개월, 약 18개월, 약 19개월, 약 20개월, 약 21개월, 약 22개월, 약 23개월, 약 24개월, 약 2.5년, 약 3 년, 약 3.5년, 약 4년, 약 4.5년 그리고 나서 매년 최대 약 5년에 측정될 수 있다. 측정 빈도는 약 1개월마다, 약 2개월마다, 약 3개월마다, 약 4개월마다, 약 5개월마다, 약 6개월마다, 약 7개월마다, 약 8개월마다, 약 9개 월마다, 약 10개월마다, 약 11개월마다 또는 약 12개월마다일 수 있다.소정의 실시형태에서, 본 명세서에 기재된 조성물은 처리하지 않은 대조군과 비교하여 처리된 대상체에서 측정 된 약력학적 및 임상적 효능을 나타낸다. 소정의 실시형태에서, 약력학적 효능, 임상적 효능, 기능적 결과, 임상적 결과, 질환 개선 또는 질환 진행이 다 음 중 하나 이상을 통해 평가될 수 있다: ARSA의 농도 및/또는 수준 및/또는 생물학적 활성(예를 들어, 혈청 또 는 CSF에서), 소변 설파타이드, CNS 수초화(탈수초화 로딩 및 패턴), MRI에 의해 측정된 백질 위축, 뉴런 대사 산물 N-아세틸아스파테이트(NAA), 미오-이노시톨(mI), 콜린(Cho) 및/또는 락테이트(Lac) 수준(예를 들어, 양성 자 자기공명 분광법(MRS)에 의해 측정됨), CSF 설파타이드 및 리소-설파타이드 수준, 시각적 유발 전위(VEP), 뇌간 청각 유발 반응(BAER), 담낭벽 비후(예를 들어, 초음파 평가를 통해); 운동 기능(예를 들어, 이염성 백질 이영양증(GMFC-MLD) 또는 대근육 운동 기능 측정(GMFM)을 위한 대근육 운동 기능 분류에 의해 측정됨), 운동 마 일스톤을 유지하거나 또는 획득하는 유아의 달성시 연령, 상실시 연령 및 백분율에 의해 평가되는 운동 마일스 톤 달성(세계 보건 기구[WHO] 기준에 의해 정의됨), 인지 기능(예를 들어, 문헌[유아 발달의 베일리 척도[BSID- III], 어린이용 웩슬러 지능 척도, 제5판 [WISC-V]]에 의해 측정되는 전체 지능 지수[IQ] 및 서브-도메인 IQ), 수명(환자에 비해), 신경학적 임상적 검사(NCE), 척골 신경, 비골 신경, 정중 신경, 비복 신경의 신경 전도 속 도(NCV), 증상 일지에 의해 포착된 발작의 발병 연령 및 빈도, 행동 기능(예를 들어, 바인랜드 적응행동 검사, 3판(바인랜드-III)에 의해 측정됨), 로어 랜스키 수행 인덱스, 소아 삶의 질 측정도구(예를 들어, PedsQL 및 PedsQL-IS) 및 후견인/부모 삶의 질. 소정의 실시형태에서, 약력학적 효능, 임상적 효능, 기능적 결과, 임상적 결과, 질환 개선 또는 질환 진행은 비 정상적 특성(예를 들어 바이오마커 활성, 전기생리학적 활성 및/또는 영상 매개변수) 및 임상적 관찰(예를 들어, 대근육 및 소근육 운동 기능, 인지 및 언어 발달, 신경학적 검사 결과, 행동 및 마일스톤 발달 및 후견인 /부모-보고 결과 및 감소된 삶의 질 평가)로 평가될 수 있다. 다른 질환 개선 또는 질환 진행이 평가될 수 있고, II부 및 VIII부를 참조하며, 이의 관련 부문은 그 전체가 참조에 의해 본 명세서에 원용된다. 대안적으로 또는 추가적으로, 약력학적 효능, 임상적 효능, 기능적 결과 또는 임상적 결과는 바이오마커, 예를 들어, rAAVhu68.hARSAco의 약력학적 및 생물학적 활성을 포함할 수 있다. IIX. 방법 또 다른 양태에서, ARSA 돌연변이와 관련되거나 또는 기능성 아릴설파테이스 A의 정상 수준의 결핍에 의해 야기 되는 질환(예를 들어, MLD)이 있는 대상체를 치료하거나, 또는 ARSA 돌연변이와 관련되거나 또는 기능성 아릴설 파테이스 A의 정상 수준의 결핍에 의해 야기되는 질환(예를 들어, MLD)의 증상을 개선하거나, 또는 ARSA 돌연변 이와 관련되거나 또는 기능성 아릴설파테이스 A의 정상 수준의 결핍에 의해 야기되는 질환(예를 들어, MLD)의 진행을 지연시키는 방법이 제공된다. 방법은 유효량의 본 명세서에 개시된 바와 같은 rAAV 또는 벡터를 이를 필 요로 하는 대상체에 투여하는 단계를 포함한다. 소정의 실시형태에서, 벡터 또는 rAAV는 대수조내 주사(ICM), 예를 들어, 대수조 내로의 CT-유도 후두하 주사를 통해 환자에게 투여될 수 있다. 소정의 실시형태에서, 7세 이 하인 이염성 백질이영양증이 있는 환자에게 투여될 수 있는 벡터 또는 조성물이 제공된다. 소정의 실시형태에서, 방법은 rAAV 또는 벡터를 인간 환자에게 단일 용량으로 전달하는 단계를 포함한다. 소정의 실시 형태에서, rAAV는 뇌 질량의 그램당 3.00×1010 게놈 카피(GC)(GC/g) 내지 1.00×1012 GC/뇌 질량의 g의 용량으 로 투여된다. 소정의 실시형태에서, 투여 후, 대상체의 질환 증상은 개선되고/되거나 질환 진행은 지연된다. 신경계-지향 AAV 유전자 요법은 생체내에서 주로 뉴런을 표적으로 하지만, 교차-교정 가능성은 대부분의 유전자 요법 벡터에 의해 생체내에서 형질도입될 수 없는 ARSA-결핍 수초화 세포를 교정할 수 있는 가능성을 열어준다 (문헌[Cearley et al., 2008; Lawlor et al., 2009]). 소정의 실시형태에서, 본 명세서에서 \"유효량\"은 MLD 증상의 개선 및/또는 MLD 진행의 지연을 달성하는 양이다. 벡터는 세포를 형질감염시키고 과도한 이상 반응 없이 또는 의학적으로 허용 가능한 생리학적 효과와 함께 치료 적 이익을 제공하는 충분한 수준의 유전자 전달 및 발현을 제공하기에 충분한 양으로 투여되며, 이는 의학 업계 의 당업자에 의해 결정될 수 있다. 종래의 약학적으로 허용 가능한 투여 경로는 목적하는 기관(예를 들어, 뇌, CSF, 간(선택적으로 간동맥을 통함), 폐, 심장, 눈, 신장)으로의 직접 전달, 경구, 흡입, 비강내, 기관내, 척수 강내, 기관내, 동맥내, 안내, 정맥내, 근육내, 피하, 피내, 뇌실질내, 뇌실내, 척추강내, ICM, 요추 천자 및 다 른 비경구 투여 경로를 포함하지만, 이들로 제한되지 않는다. 원하는 경우 투여 경로는 조합될 수 있다. 바이러스 벡터(예를 들어, rAAV)의 투여량은 주로 치료될 병태, 환자의 연령, 체중 및 건강상태와 같은 요인에 따라 달라지므로, 환자마다 다를 수 있다. 예를 들어, 바이러스 벡터의 치료적으로 유효한 인간 투여량은 일반적으로 약 1×109 내지 1×1016 벡터 게놈 카피의 농도를 포함하는 약 25 마이크로리터 내지 약 1000 마이크로리 터에서 약 100㎖의 용액의 범위이다. 소정의 실시형태에서, 약 1㎖ 내지 약 15㎖ 또는 약 2.5㎖ 내지 약 10㎖ 또는 약 5㎖의 현탁액의 부피가 전달된다. 소정의 실시형태에서, 약 1㎖, 약 2㎖, 약 3㎖, 약 4㎖, 약 5㎖, 약 6㎖, 약 7㎖, 약 8㎖, 약 9㎖, 약 10㎖, 약 11㎖, 약 12㎖, 약 13㎖, 약 14㎖ 또는 약 15㎖의 현탁액의 부피가 전달된다. 소정의 실시형태에서, 약 8.9×1012 내지 2.7×1014 GC 총 용량이 이 부피로 투여된다. 소정의 실시형 태에서, 약 1.1 x1010 GC/뇌 질량 g 내지 약 3.3×1011 GC/뇌 질량 g의 용량이 이 부피로 투여된다. 소정의 실시 형태에서, 뇌 질량 그램당 약 3.0×109, 약 4.0×109, 약 5.0×109, 약 6.0×109, 약 7.0×109, 약 8.0×109, 약 9.0×109, 약 1.0×1010, 약 1.1×1010, 약 1.5×1010, 약 2.0×1010, 약 2.5×1010, 약 3.0×1010, 약 3.3×1010, 약 3.5×1010, 약 4.0×1010, 약 4.5×1010, 약 5.0×1010, 약 5.5×1010, 약 6.0×1010, 약 6.5×1010, 약 7.0× 1010, 약 7.5×1010, 약 8.0×1010, 약 8.5×1010, 약 9.0×1010, 약 9.5×1010, 약 1.0×1011, 약 1.1×1011, 약 1.5×1011, 약 2.0×1011, 약 2.5×1011, 약 3.0×1011, 약 3.3×1011, 약 3.5×1011, 약 4.0×1011, 약 4.5×1011, 약 5.0×1011, 약 5.5×1011, 약 6.0×1011, 약 6.5×1011, 약 7.0×1011, 약 7.5×1011, 약 8.0×1011, 약 8.5× 1011, 약 9.0×1011 GC의 용량이 이 부피로 투여된다. 투여량은 임의의 이상 반응에 대한 치료적 이익의 균형을 맞추기 위해 조정되며, 이와 같은 투여량은 재조합 벡 터가 이용되는 치료적 적용에 따라 달라질 수 있다. 이식유전자 생성물의 발현 수준은 바이러스 벡터, 바람직하 게는 미니유전자를 함유하는 AAV 벡터를 생성하는 투여 빈도를 결정하기 위해 모니터링될 수 있다. 선택적으로, 치료적 목적을 위해 기재된 것과 유사한 투여 양생법이 본 발명의 조성물을 사용한 면역화에 이용될 수 있다. 복제-결함 바이러스 조성물은 약 1.0×109 GC 내지 약 1.0×1016 GC(대상체를 치료하기 위해)의 범위(범위 내의 모든 정수 또는 분수의 양을 포함함) 및 바람직하게는, 인간 환자의 경우 1.0×1012 GC 내지 1.0×1014 GC인 복 제-결함 바이러스의 양을 포함하도록 투여 단위로 제형화될 수 있다. 일 실시형태에서, 조성물은 용량당 적어도 1×109, 2×109, 3×109, 4×109, 5×109, 6×109, 7×109, 8×109 또는 9×109 GC(범위 내의 모든 정수 또는 분수 의 양을 포함함)를 포함하도록 제형화된다. 또 다른 실시형태에서, 조성물은 용량당 적어도 1×1010, 2×1010, 3 ×1010, 4×1010, 5×1010, 6×1010, 7×1010, 8×1010 또는 9×1010 GC(범위 내의 모든 정수 또는 분수의 양을 포함 함)를 포함하도록 제형화된다. 또 다른 실시형태에서, 조성물은 용량당 적어도 1×1011, 2×1011, 3×1011, 4× 1011, 5×1011, 6×1011, 7×1011, 8×1011 또는 9×1011 GC(범위 내의 모든 정수 또는 분수의 양을 포함함)를 포함 하도록 제형화된다. 또 다른 실시형태에서, 조성물은 용량당 적어도 1×1012, 2×1012, 3×1012, 4×1012, 5× 1012, 6×1012, 7×1012, 8×1012 또는 9×1012 GC(범위 내의 모든 정수 또는 분수의 양을 포함함)를 포함하도록 제 형화된다. 또 다른 실시형태에서, 조성물은 용량당 적어도 1×1013, 2×1013, 3×1013, 4×1013, 5×1013, 6×1013, 7×1013, 8×1013 또는 9×1013 GC(범위 내의 모든 정수 또는 분수의 양을 포함함)를 포함하도록 제형화된다. 또 다른 실시형태에서, 조성물은 용량당 적어도 1×1014, 2×1014, 3×1014, 4×1014, 5×1014, 6×1014, 7×1014, 8× 1014 또는 9×1014 GC(범위 내의 모든 정수 또는 분수의 양을 포함함)를 포함하도록 제형화된다. 또 다른 실시형 태에서, 조성물은 용량당 적어도 1×1015, 2×1015, 3×1015, 4×1015, 5×1015, 6×1015, 7×1015, 8×1015 또는 9 ×1015 GC(범위 내의 모든 정수 또는 분수의 양을 포함함)를 포함하도록 제형화된다. 일 실시형태에서, 인간 적용의 경우, 용량은 체중 kg당 1×1010 내지 약 1×1015 GC의 범위(범위 내의 모든 정수 또는 분수의 양을 포함함)일 수 있다. 일 실시형태에서, 유효량의 벡터는 체중 kg당 약 1×109, 2×109, 3×109, 4×109, 5×109, 6×109, 7×109, 8× 109 또는 9×109 GC(범위 내의 모든 정수 또는 분수의 양을 포함함)이다. 또 다른 실시형태에서, 유효량의 벡터 는 체중 kg당 약 1×1010, 2×1010, 3×1010, 4×1010, 5×1010, 6×1010, 7×1010, 8×1010 또는 9×1010 GC(범위 내의 모든 정수 또는 분수의 양을 포함함)이다. 또 다른 실시형태에서, 유효량의 벡터는 체중 kg당 약 1×1011, 2 ×1011, 3×1011, 4×1011, 5×1011, 6×1011, 7×1011, 8×1011 또는 9×1011 GC(범위 내의 모든 정수 또는 분수의 양을 포함함)이다. 또 다른 실시형태에서, 유효량의 벡터는 체중 kg당 약 1×1012, 2×1012, 3×1012, 4×1012, 5 ×1012, 6×1012, 7×1012, 8×1012 또는 9×1012 GC(범위 내의 모든 정수 또는 분수의 양을 포함함)이다. 또 다른 실시형태에서, 유효량의 벡터는 체중 kg당 약 1×1013, 2×1013, 3×1013, 4×1013, 5×1013, 6×1013, 7×1013, 8 ×1013 또는 9×1013 GC(범위 내의 모든 정수 또는 분수의 양을 포함함)이다. 또 다른 실시형태에서, 유효량의 벡 터는 체중 kg당 약 1×1014, 2×1014, 3×1014, 4×1014, 5×1014, 6×1014, 7×1014, 8×1014 또는 9×1014 GC(범위 내의 모든 정수 또는 분수의 양을 포함함)이다. 또 다른 실시형태에서, 유효량의 벡터는 체중 kg당 약 1×1015, 2×1015, 3×1015, 4×1015, 5×1015, 6×1015, 7×1015, 8×1015 또는 9×1015 GC(범위 내의 모든 정수 또는 분수의 양을 포함함)이다. 일 실시형태에서, 인간 적용의 경우, 용량은 뇌 질량 그램(g)당 1×1010 내지 약 1×1015 GC 범위(범위 내의 모 든 정수 또는 분수의 양을 포함함)일 수 있다. 일 실시형태에서, 벡터의 유효량은 뇌 질량 그램(g)당 약 1× 109, 2×109, 3×109, 4×109, 5×109, 6×109, 7×109, 8×109 또는 9×109 GC(범위 내의 모든 정수 또는 분수의 양을 포함함)이다. 또 다른 실시형태에서, 벡터의 유효량은 뇌 질량 그램(g)당 약 1×1010, 2×1010, 3×1010, 4 ×1010, 5×1010, 6×1010, 7×1010, 8×1010 또는 9×1010 GC(범위 내의 모든 정수 또는 분수의 양을 포함함)이다. 또 다른 실시형태에서, 벡터의 유효량은 뇌 질량 그램(g)당 약 1×1011, 2×1011, 3×1011, 4×1011, 5×1011, 6× 1011, 7×1011, 8×1011 또는 9×1011 GC(범위 내의 모든 정수 또는 분수의 양을 포함함)이다. 또 다른 실시형태에 서, 벡터의 유효량은 뇌 질량 그램(g)당 약 1×1012, 2×1012, 3×1012, 4×1012, 5×1012, 6×1012, 7×1012, 8× 1012 또는 9×1012 GC(범위 내의 모든 정수 또는 분수의 양을 포함함)이다. 또 다른 실시형태에서, 벡터의 유효량 은 뇌 질량 그램(g)당 약 1×1013, 2×1013, 3×1013, 4×1013, 5×1013, 6×1013, 7×1013, 8×1013 또는 9×1013 GC(범위 내의 모든 정수 또는 분수의 양을 포함함)이다. 또 다른 실시형태에서, 벡터의 유효량은 뇌 질량 그램 (g)당 약 1×1014, 2×1014, 3×1014, 4×1014, 5×1014, 6×1014, 7×1014, 8×1014 또는 9×1014 GC(범위 내의 모든 정수 또는 분수의 양을 포함함)이다. 또 다른 실시형태에서, 벡터의 유효량은 뇌 질량 그램(g)당 약 1×1015, 2 ×1015, 3×1015, 4×1015, 5×1015, 6×1015, 7×1015, 8×1015 또는 9×1015 GC(범위 내의 모든 정수 또는 분수의 양을 포함함)이다. 위의 이들 용량은 치료될 영역의 크기, 사용되는 바이러스 역가, 투여 경로, 및 목적하는 방법의 효과에 따라 약 25 마이크로리터 내지 약 1000 마이크로리터, 또는 더 높은 부피 범위(범위 내의 모든 숫자를 포함함)의 다 양한 부피의 담체, 부형제 또는 완충액 제형으로 투여될 수 있다. 일 실시형태에서, 담체, 부형제 또는 완충액 의 부피는 적어도 약 25㎕이다. 일 실시형태에서, 부피는 약 50㎕이다. 또 다른 실시형태에서, 부피는 약 75㎕ 이다. 또 다른 실시형태에서, 부피는 약 100㎕이다. 또 다른 실시형태에서, 부피는 약 125㎕이다. 또 다른 실시 형태에서, 부피는 약 150㎕이다. 또 다른 실시형태에서, 부피는 약 175㎕이다. 또 다른 실시형태에서, 부피는 약 200㎕이다. 또 다른 실시형태에서, 부피는 약 225㎕이다. 또 다른 실시형태에서, 부피는 약 250㎕이다. 또 다른 실시형태에서, 부피는 약 275㎕이다. 또 다른 실시형태에서, 부피는 약 300㎕이다. 또 다른 실시형태에서, 부피는 약 325㎕이다. 또 다른 실시형태에서, 부피는 약 350㎕이다. 또 다른 실시형태에서, 부피는 약 375㎕이 다. 또 다른 실시형태에서, 부피는 약 400㎕이다. 또 다른 실시형태에서, 부피는 약 450㎕이다. 또 다른 실시형 태에서, 부피는 약 500㎕이다. 또 다른 실시형태에서, 부피는 약 550㎕이다. 또 다른 실시형태에서, 부피는 약 600㎕이다. 또 다른 실시형태에서, 부피는 약 650㎕이다. 또 다른 실시형태에서, 부피는 약 700㎕이다. 또 다른 실시형태에서, 부피는 약 700㎕ 내지 1000㎕이다. 소정의 실시형태에서, 용량은 약 1×109 GC/뇌 질량 g 내지 약 1×1012 GC/뇌 질량 g의 범위일 수 있다. 소정의 실시형태에서, 용량은 약 1×1010 GC/뇌 질량 g 내지 약 3×1011 GC/뇌 질량 g의 범위일 수 있다. 소정의 실시형 태에서, 용량은 약 1×1010 GC/뇌 질량 g 내지 약 2.5×1011 GC/뇌 질량 g의 범위일 수 있다. 소정의 실시형태에서, 용량은 약 5×1010 GC/뇌 질량 g의 범위일 수 있다. 일 실시형태에서, 바이러스 작제물은 적어도 약 적어도 1×109 GC 내지 약 1×1015 또는 약 1×1011 내지 5×1013 GC의 용량으로 전달될 수 있다. 이들 용량 및 농도의 적합한 전달 부피는 당업자에 의해 결정될 수 있다. 예를 들어, 약 1㎕ 내지 150㎖의 부피가 선택될 수 있으며, 성인의 경우 더 많은 부피가 선택될 수 있다. 전형적으로, 신생아의 경우 적합한 부피는 약 0.5㎖ 내지 약 10㎖이고, 더 나이가 든 유아의 경우 약 0.5㎖ 내 지 약 15㎖가 선택될 수 있다. 걸음마를 배우는 아이의 경우 약 0.5㎖ 내지 약 20㎖의 부피가 선택될 수 있다. 어린이의 경우, 최대 약 30㎖의 부피가 선택될 수 있다. 십대 초반 및 십대의 경우, 최대 약 50㎖의 부피가 선 택될 수 있다. 또 다른 실시형태에서, 환자는 선택된 약 5㎖ 내지 약 15㎖, 또는 약 7.5㎖ 내지 약 10㎖ 부피로 척수강내 투여를 받을 수 있다. 다른 적합한 부피 및 투여량이 결정될 수 있다. 투여량은 임의의 이상 반응에 대한 치료적 이익의 균형을 맞추기 위해 조정될 수 있으며, 이와 같은 투여량은 재조합 벡터가 이용되는 치료적 적용에 따라 달라질 수 있다. 위에 기재된 재조합 벡터는 공개된 방법에 따라 숙주 세포에 전달될 수 있다. 바람직하게는 생리학적으로 양립 가능한 담체에 현탁된 rAAV는 인간 또는 비인간 포유동물 환자에게 투여될 수 있다. 소정의 실시형태에서, 인간 환자에의 투여를 위해, rAAV는 식염수, 계면활성제, 및 생리학적으로 양립 가능한 염 또는 염의 혼합물을 포함 하는 수용액에 적합하게 현탁된다. 적합하게는, 제형은 생리학적으로 허용 가능한 pH, 예를 들어, pH 6 내지 9, 또는 pH 6.5 내지 7.5, pH 7.0 내지 7.7, 또는 pH 7.2 내지 7.8의 범위로 조정된다. 뇌척수액의 pH는 약 7.28 내지 약 7.32이므로, 척수강내 전달을 위해 이 범위 내의 pH가 바람직할 수 있는 반면; 정맥내 전달을 위해서는, 약 6.8 내지 약 7.2의 pH가 바람직할 수 있다. 그러나, 가장 광범위한 범위 내의 다른 pH 및 이러한 하위범위가 다른 전달 경로를 위해 선택될 수 있다. 소정의 실시형태에서, 본 명세서에 기재된 조성물의 처리는 동물 및/또는 인간 환자에서 DRG 감각 뉴런의 최소 내지 경증의 무증상 변성을 가지며, 감각 신경 독성 및 잠재성 감각 뉴런 병변과 관련하여 내약성이 우수하다. 소정의 실시형태에서, rAAV, 벡터, 조성물 및 방법에 대해 제안된 집단은 증상 발병이 7세 미만이고, 예측 가능 한 및 급격한 저하가 합리적인 추적관찰 기간 내에 기능적 결과의 강력한 연구 설계 및 평가를 지지하는 조기 발병 후기 유아기형 및 조기 유년기형 MLD가 있는 대상체로 구성된다. rAAV, 벡터, 조성물 또는 방법을 통한 치료는 기저 병리를 안정화하여 질환 발병을 예방하고, 정상 또는 거의 정상에 가까운 운동 및 인지 발달을 가능하게 하거나 또는 실질적으로 능력의 상실(예컨대, 후천적 발달 및 운 동 마일스톤) 및 질환 진행을 예방 또는 지연시키는 것을 포함하는 질환 증상 개선 및 질환 진행 지연을 위한 것이다. 증상 전 환자는 이 치료를 받을 자격이 있다. AAV.hARSAco 및 ICM ROA의 AAVhu68 캡시드는 수초-생성 희소돌기아교세포의 작은 하위집단인 피질 뉴런, PNS로 돌출된 엑손이 있는 운동 뉴런 및 척수 및 말초 신경 모두로 돌출된 엑손이 있는 DRG 감각 뉴런을 효과적으로 형질도입시킨다. CNS와 PNS 모두에서 광범위한 형질도입 프로파일을 고려할 때, ARSA 효소 교차-교정은 HSCGT 또는 HSCT로 해결되지 않는 많은 MLD 환자에서 관찰되는 CNS 발현 및 말초 신경병증을 모두 치료할 수 있다. MLD의 특성을 고려해볼 때, CNS 손상은 대부분 비가역적이며 조기 발병 집단에서 질환 진행이 빠른 것으로 생각 되므로, 본 명세서에 개시된 바와 같은 rAAV, 벡터, 조성물 또는 방법은 질환이 없거나 또는 경증 내지 중등도 질환이 있는 환자에게 가장 큰 이점을 제공한다. ICM-전달된 AAV 유전자 요법, 예컨대, AAV. hARSAco는 투여 후 3주까지 CSF에서 최고 ARSA 발현과 함께 HSC-기반 요법에 비해 빠른 동적 발병(kinetic onset)을 보여준다(실시 예 참조). 그 결과, AAVhARSAco는 이미 질환의 일부 임상적 징후가 있는 환자에서도 질환 진행을 중단할 수 있 다. 따라서, 경증 내지 중등도의 징후 및 증상이 있는 조기 발병 MLD 환자는 보행이 가능하고 독립적으로 적어 도 10보를 걸을 수 있는 환자에서 경미한 보행 이상, 운동 마일스톤 획득의 명백한 지연(WHO 기준에 기초하여 주어진 마일스톤의 달성에 있어서 연령에 대해 95번째 초과의 백분위수로 정의됨(문헌[Wijnhoven et al., 2004)]) 및 신경학적 검사에서 가벼운 징후가 있는 환자를 포함하여 본 명세서에 개시된 바와 같은 rAAV, 벡터, 조성물 또는 방법(\"치료\"로 지칭됨)에 의한 치료에 적합할 것이다. 위루술(gastrostomy)이 필요한 섭식 장애, 발작의 발생, 낮은 인지 기능, 신경학적 검사(예컨대, 매우 활발한 반사, 심한 긴장 저하 또는 사지 경련, 심한 연하곤란, 운동장애 또는 운동실조)에서 발견된 심각한 이상과 같 은 경증 내지 중등도의 증상이 있는 환자에서 일반적으로 발견되지 않는 질환 진행의 지표를 포함하며, 시력 또 는 청력 상실은 시험에서 제외된다. 소정의 실시형태에서, 이러한 질환 진행의 지연은 낮은 수준의 임상적 기능에서 질환의 안정화로 나타난다. 소정의 실시형태에서, 방법의 약력학적 및 효능 결과는 진정 및/또는 LP가 필요한 경우를 제외하고, 2년의 단기 추적 기간 동안 1개월, 3개월 및 6개월에 측정된 다음 6개월마다 측정된다. 장기 추적관찰 단계 동안, 평가 빈 도는 12개월에 한 번으로 줄어든다. 초기 2년 동안의 초기 시점과 6개월 간격도 또한 치료를 받지 않은 조기 발 병 MLD 환자에서 질환 진행의 빠른 속도를 고려하여 선택되었다. 소정의 실시형태에서, 질환 증상의 개선 또는 질환 진행의 진행은 대근육 운동 기능의 평가를 통해 나타난다. GMFC-MLD는 MLD 환자에서 대근육 운동 기능 및 시간에 따른 저하의 표준화된 평가를 위한 검증되고, 신뢰할 수 있는 간단한 도구이다(문헌[Kehrer et al., 2011b]). 이는 뇌성마비가 있는 유아에서 운동 기능을 평가하고, 유 아의 운동 기능을 자가-주도적 움직임의 차이에 따라 다섯 가지 수준 중 하나로 분류하는 유사한 도구를 모델링 한 것이다(문헌[Palisano et al., 2006]). Kehrer et al.은 분류 시스템을 MLD 환자와 관련되도록 하며 수준 간의 구분이 MLD가 있는 유아의 일상 생활에서 의미가 있는 것으로 간주되는 분류 시스템을 제공하도록 조정된 다(하기 표)(문헌[Kehrer et al., 2011a; Kehrer et al., 2011b]). GMFC-MLD는 MLD의 자연사를 설명하고(문헌 [Kehrer et al., 2011a]), 치료적 개입 후 운동 기능을 평가하는데(문헌[Sessa et al., 2016]) 사용되었다. GMFC-MLD의 잠재적인 한계 중 하나는 도구가 18개월 이상의 유아에 대해 검증되었다는 것이며, 이는 유아가 일 반적으로 걷는 법을 배우는 연령 상한을 나타내기 때문이다(문헌[Lsargo et al., 1985; WHO, 2006]). 그러나, 도구는 이 연령 이전에 걷기 마일스톤을 달성한 유아에게 계속 적용될 것이다."}
{"patent_id": "10-2021-7039381", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "GMFM은 질환 증상의 개선 또는 질환 진행의 지연을 평가하기 위한 측정으로 포함된다. 이는 뇌성마비가 있는 유 아에서 개입 후 시간 경과에 따른 대근육 운동 기능의 변화를 측정하도록 설계되고 검증된 표준화된 관찰 도구 이다(문헌[Russell et al., 1989; Lundkvist Josenby et al., 2009; Alotaibi et al., 2014]). GMFM은 다섯 가지 기능 영역: 눕기 및 구르기, 앉기, 기어가기 및 무릎 꿇기, 서있기 및 걷기, 달리기 및 점프에 걸쳐 그룹 화된 운동 기능을 평가하는 88개-항목의 도구이다. 참조 곡선은 또한 5세까지 척도에서 가장 어려운 능력(걷기, 달리기, 점프)을 습득하는 건강한 유아를 위해 개발되었다(문헌[Palisano et al., 2006]). 도구는 MLD가 있는 유아에 대해서 검증되지는 않았지만, HSC-GT를 받은 조기 발병 MLD 환자에게 증상 전 단계에서 치료를 받은 대 상체에서 (거의) 정상적인 대근육 운동 발달을 나타내는데 유용한 것으로 입증되었다(문헌[Sessa et al., 2016; Fumagalli et al., 2017]). 88개 항목 도구의 장점 중 하나는 운동 기능의 다양한 양태에 대한 많은 양의 정보"}
{"patent_id": "10-2021-7039381", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "가 포함되어 있고, 하위-영역이 별도로 요약되고 보고될 수 있다는 점이다. 고원 효과(plateau effect)로 인해, 시간 경과에 따라 대근육 운동 기능의 유지 또는 상실을 여전히 보여줄 수 있지만, 도구는 연구 등록 전에 이미 최대 GMFM 점수에 도달했을 수 있는(즉, 새로운 능력의 습득을 측정할 수 없는) 나이가 많은 조기 유년기형 환 자에게 정보를 제공하지 않을 수 있다. 말초 신경병증은 이러한 환자에서 미세 및 대근육 운동 기능장애를 악화시킬 수 있는 MLD의 일반적이고, 고통스 러우며 점진적으로 쇠약해지는 징후이다(문헌[(Gieselmann and Krageloh-Mann, 2010; van Rappard et al., 2015]). HSC-기반 치료는 말초 신경병증을 실질적으로 개선하지 않는 것으로 보인다(문헌[Boucher et al., 2015; van Rappard et al., 2016]). 뉴런, DRG 및 말초 신경 엑손 세포를 형질도입하는 AAV.hARSAco의 능력은 뇌 및 말초 신경 기능장애 내에서 ARSA 효소의 발현을 가능하게 한다. 말초 신경병증의 임상적 징후를 평가하기 위해 신경학적 검사가 수행될 수 있으며, 대표적인 운동 및 감각 신경(비골 신경, 정중 신경, 척골 신경 및 비 복 신경)에 대한 신경 전도 연구가 수행될 수 있다. MLD는 주로 탈수초성 질환이므로, 신경 전도 속도는 질환의관련 신경생리학적 매개변수로 간주되고(문헌[Biffi et al., 2008]) 측정될 수 있다. 운동 마일스톤 발달은 대상체 등록 당시의 연령과 질환의 단계에 따라 다르다. 등록시 대상체의 연령에 따라, 대상체는 소정의 운동 능력을 달성하였거나 또는 운동 마일스톤 발달의 징후를 아직 나타내지 않았을 수 있다."}
{"patent_id": "10-2021-7039381", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "평가는 모든 마일스톤에 대한 성취 연령 및 손실 연령을 추적할 것이다. 운동 마일스톤 달성은 아래 표에 요약 된 WHO 기준에 따라 6개의 총 마일스톤에 대해 정의될 것이다."}
{"patent_id": "10-2021-7039381", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "신경인지 및 행동 징후는 질환 증상의 개선 또는 질환 진행의 지연을 나타내기 위해 평가될 수 있다. 이러한 징 후를 평가하는 것은 행동 및 인지 증상이 운동 기능장애와 동시에 발생할 수 있는 질환의 중요한 징후인 조기 유년기형 MLD가 있는 유아에게 특히 중요하다. 임상적 척도는 인지, 언어 및 운동 기능의 발달 및 변화에 대한 AAV.hARSAco의 효과를 정량화하는데 사용될 수 있고, 이는 BSID-III 및 WISC-V를 사용하여 평가될 수 있으며, 환자의 추정된 발달 연령에 따라 연령에 적절한 평가 도구로 전환된다. 결과는 전형적으로 발달 중인 유아 및 치료를 받지 않은 유아의 기준(norm)과 비교될 수 있다. 제안된 각각의 측정값은 이전에 MLD 집단에서 사용되었 었다(문헌[Clarke et al., 1989; Boucher et al., 2015; Sessa et al., 2016]). BSID-III: 이 척도는 주로 1개월 내지 42개월 영유아의 발달을 평가하는데 사용된다(문헌[Albers and Grieve, 2007]). 이는 표준화된 일련의 발달 놀이 과제로 구성된다. 성공적으로 완성된 항목의 원 점수를 척도 점수와 및 종합 점수로 변환한 다음 해당 점수를 동일한 연령의 전형적으로 발달하는 유아에서 얻은 기준과 비 교하여 발달 지수를 도출한다. BSID-III에는 세 가지 주요 하위테스트가 있다. 인지 척도는 친숙하고 및 친숙하 지 않은 물건에 대한 주의, 떨어진 물건 찾기 및 가상 놀이(pretend play)와 같은 항목을 포함한다. 언어 척도 는 언어의 이해와 표현(예를 들어, 지시를 따르고 물건에 이름을 붙일 수 있는 능력)을 평가한다. 운동 척도는 대근육 운동 및 소근육 운동 능력(예를 들어, 잡기, 앉기, 블록 쌓기 및 계단 오르기)을 측정한다. 따라서, BSID-III은 GMFCMLD 및 GMFM을 보완하기 위해 추가적인 운동 기능 정보를 제공할 수 있다. WISC-V: 이 척도는 개별적으로 시행되는 지능 테스트 또는 6세 내지 16세의 유아이다. 이는 어린이의 일반적 인 지적 능력을 나타내는 전체 IQ(Full Scale IQ)를 생성하고, 다음 다섯 가지의 기본 지수 점수를 제공한다: 언어 이해 지수(Verbal Comprehension index), 시지각 지수(Visual Spatial index), 유동 추론 지수(Fluid Reasoning index), 작업 기억 지수(Working Memory index) 및 처리 속도 지수(Processing Speed index). 이들 지수는 별개의 인지 영역에서 어린이의 능력을 나타낸다. 생존은 질환 증상의 개선 또는 질환 진행의 지연에 대한 측정값으로서 포함된다. 현재 수준의 지지적 치료로 생 존이 두 번째 10년까지 연장될 수 있지만(문헌[Gomez-Ospina, 2017]), 후기 유아기형 MLD로 진단된 대부분의 환 자는 생후 첫 5년 이내에 사망할 것으로 예상되며, 5년 생존율은 25%이다(문헌[Mahmood et al., 2010]). 따라서, 5년의 추적관찰은 후기 유아기형 집단에서 생존 혜택을 입증하기에 충분할 수 있지만, 조기 유년기형 코호트에서 생존을 평가하기에는 충분히 길지 않을 수 있다. 중요하게는, 개선된 수준의 지지적 치료로, 조기 발병 MLD가 있는 유아는 매우 낮은 수준의 기능에도 불구하고 이제 10세 이상으로 생존할 수 있다. 발작은 일반적으로 조기 발병 집단에서 나타나는 증상은 아니지만, 질환의 후기 단계의 특징이다(문헌 [(Gieselmann and Krageloh-Mann, 2010; Mahmood et al., 2010]). 발작의 발병을 예방하거나 또는 지연시키거 나, 또는 발작 이벤트의 빈도를 줄일 수 있는지 여부를 평가할 수 있는 발작 활동(발작의 발병, 빈도, 시간 및 유형)을 기록하기 위해 부모에게 일기를 유지하도록 요청할 수 있다. 부모와 환자의 삶의 질과 함께 적응 행동의 측정은 이전에 MLD 환자에게 사용되었던 도구를 사용하여 질환 증상 의 개선 또는 질환 진행의 지연을 나타내기 위해 평가될 수 있다(문헌[Martin et al., 2013; Boucher et al., 2015; Sessa et al., 2016]): 바인랜드-III: 5개의 영역에 걸쳐 출생에서부터 성인기(0세 내지 90세)까지의 적응 행동을 평가한다: 의사 소 통, 일상 생활 능력, 사회화, 운동 능력 및 부적응 행동. 바인랜드-II에서 바인랜드-III으로의 개선은 발달 장 애에 대한 더 나은 이해를 가능하게 하는 질문을 포함한다. PedsQOL 및 PedsQL-IS: 중증 소아 질환의 경우와 마찬가지로, 가족의 질환 부담도 상당하다. 소아용 삶의 질 목록(Pediatric Quality of Life Inventory)™은 유아 및 이들의 부모의 삶의 질을 평가하는 검증된 도구이다 (부모 대리 보고서에 따름). 건강한 유아 및 청소년에서 검증되었으며, 다양한 소아 질환에서 사용되고 있다(문 헌[Iannaccone et al., 2009; Absoud et al., 2011; Consolaro and Ravelli, 2016]). 따라서, PedsQL은 AAV.hARSAco가 환자 및 이들의 가족의 삶의 질에 미치는 영향을 평가하기 위해 포함되었다. 이는 유아 2세 이상 의 유아의 부모에게 적용될 수 있으므로, 5년 이상의 추적관찰 기간에 걸쳐 유아의 연령에 따라 유익한 정보가 될 수 있다. 소아용 삶의 질 목록™ 유아 척도(문헌[Varni et al., 2011])는 1개월 내지 24개월 사이의 건강하 고 아픈 유아를 위해 건강-관련 삶의 질을 측정하도록 설계된 부모에 의해 완성되는 검증된 모듈식 도구이다. 이는 또한 5세 이상의 유아에 의한 자가-보고 기능도 제공한다. 로어 랜스키 수행 인덱스: 개인의 기능적 상태를 측정하고, 정상적인 일상 활동을 수행하는 능력을 나타내는 점수를 제공하는 척도이다. 질환 병리에 대한 본 명세서에 개시된 바와 같은 rAAV(예를 들어, AAV.hARSAco), 벡터, 조성물 또는 방법의 효 과는 수초화의 변화, 수초화와 관련된 기능적 결과 및 잠재적인 질환 바이오마커를 포함하는 질환 증상의 개선 또는 질환 진행의 지연을 나타내기 위해 측정될 수 있다. MLD의 주요 특징인 중추 및 말초 탈수초화는 rAAV 투여 후 질환 증상의 개선 또는 질환 진행의 지연을 나타내기 위해 검사될 수 있다. 중추 탈수초화는 백질 영역의 MRI 측정에 의해 추적될 수 있으며, 변화는 질환 상태 및 진행의 지표이다(문헌[(Gieselmann and Krageloh-Mann, 2010; Martin et al., 2012; van Rappard et al., 2015]). MRI에 의해 검출된 중추 탈수초화는 대근육 운동 기능장애의 정도와 양의 상관관계가 있다(문헌 [Groeschel et al., 2011]). 말초 탈수초화는 운동 신경(비골, 경골 및 척골 신경) 및 감각 신경(비복 및 정중 신경)에 대한 NCV 연구를 통해 간접적으로 측정될 수 있으며, 이는 또한 말초 신경병증의 판독값도 제공한다. NCV 연구는 생물학적으로 활성인 수초의 변화(즉, F-파 및 말단 잠복기, 진폭 또는 반응의 존재 또는 부재)를 나타내는 변동을 모니터링한다. 총 탈수초화 점수 및 뇌 백질 위축을 측정하는 것 외에도, NAA, mI, Cho 및 Lac를 포함한 다양한 뇌 뉴런 대사 산물이 양성자 MRS를 사용하여 시간 경과에 따라 측정될 수 있다. NAA 수준이 대근육 운동 기능과 강력한 상관 관계가 있다는 증거가 있으며, NAA 신호 강도는 질환 진행이 진행됨에 따라 감소된다(문헌[Kruse et al., 1993;Dali et al., 2010]). 추가적으로, 양성자 MRS 연구는 MLD 질환 진행 동안 NAA/크레아티닌 비의 감소 및 Cho/ 크레아티닌 비와 mI 및 Lac 수준의 증가를 보여주었다(문헌[Martin et al., 2012]). 따라서, 뉴런 대사산물은 질환 증상의 개선 또는 질환 진행의 지연을 나타내는 바이오마커로 평가될 수 있다. 말초 신경 및 CSF 설파타이드 및 리소설파타이드 축적이 전기생리학적 매개변수의 이상 및 비복 신경의 대규모 수초화 섬유 손실과 상관관계가 있다는 증거가 있다(문헌[Dali et al., 2015]). 따라서, CSF(리소)-설파타이드 수준은 PNS의 질환 중증도를 반영할 수 있으며, 말초 신경계에 대한 요법의 영향을 평가하기 위한 마커를 제공 할 수 있다. CSF 설파타이드 및 리소-설파타이드 수준은 질환 증상의 개선 또는 질환 진행의 지연을 나타내기 위해 포함될 수 있다. 발작과 유사하게, 시력 상실은 조기 발병 MLD에서 흔히 나타나는 증상은 아니지만, 질환의 후기 단계에서 나타 난다(문헌[Gieselmann and Krageloh-Mann, 2010; van Rappard et al., 2015]). VEP의 사용을 통해 시력 상실을 추적하는 것은 시력 상실을 지연시키거나 또는 예방하기 위해 본 명세서에 개시된 바와 같은 rAAV의 능력을 평 가할 기회를 제공한다. VEP는 중심 시각 장애 또는 상실의 지표로서 시각 자극에 대한 반응을 객관적으로 측정 하는데 사용될 수 있다. 청력 상실은 질환이 진행되는 동안에도 흔히 발생하며, BAER 검사를 통해 청각 이상의 징후가 조기에 측정될 수 있다. 내장 조직에서 MLD의 후유증 중 하나는 담낭 벽에의 설파타이드 침착을 포함하며, 담낭 벽이 두꺼워지고 및 용 종이 발생하여 외과적 개입이 필요할 수 있고, 이는 초음파에 의해 시각화될 수 있다(문헌[Rodriguez-Waitkus et al., 2011; Kim et al., 2017]). 담낭 이상은 MLD에서 흔히 발견되고, 환자가 담낭 암종에 걸리기 쉽게 하 며(문헌[van Rappard et al., 2016]), MLD의 모든 하위유형에서 발생한다. 소정의 실시형태에서, 하기에 열거된 검정은 질환 증상의 개선 및/또는 질환 진행의 지연을 나타내기 위해 수행 될 수 있다: 혈액학, 혈청 화학, 응고, LFT; 소변검사; HepB/HepC/HIV 혈청학; 혈청 바이오마커(ARSA); 혈청 및 소변에서의 벡터 DNA; 혈청 항-AAVhu68 nAb; ELISpot(캡시드 및 ARSA); CSF 수집 및 평가; LP(CSF를 수집용); CSF 세포학 및 화학; CSF 질환 바이오마커(ARSA, 설파타이드, 리소-설파타이드); CSF 항-AAVhu68 nAb; CSF에서의 벡터 DNA; 신체 검사(신장 및 체중 포함); 신경학적 검사; 활력 징후; ECGd; 감각 신경 전도 연구; GMFC-MLD; GMFM; BSID-IIIe; WISC-V; 바인랜드-IIIe; 로어 랜스키 수행 인덱스; PedsQL; PedsQL-IS; 후견인/부모 QoL 평가; 운 동 마일스톤 평가; 증상 일지 작성에 대한 훈련; 증상 일지의 검토; 영상 평가; MRI; MRS; NCV 측정; 및 VEP. 관련 약어는 아래에 열거되어 있다: AAVhu68, 아데노-관련 바이러스 혈청형 hu68; AE, 이상 반응; ARSA, 아릴설파테이스 A; BAER, 뇌간 청각 유발 반응; BSID-III, 영유아 발달의 베일리 척도, 제3판; CSF, 뇌척수액; DNA, 데옥시리보핵산; ECG, 심전도; ELISpot, 효소-연결 면역점; GMFC-MLD, 이염성 백질이영양증의 대근육 운동 기능 분류; GMFM, 대근육 운동 기능 측정; HepB, B형 간염; HepC, C형 간염; HIV, 인간 면역결핍 바이러스; ICM, 대수조내; LFT, 간 기능 테스트; LP, 요추 천자; MRI, 자기 공명 영상; MRS, 자기공명 분광법; nAb, 중화 항체; NCV, 신경 전도 속도; PedsQL/PedQL-IS, 소아용 삶의 질 목록; QoL, 삶의 질; VEP, 시각적 유발 전위; 바인랜드-III, 바인랜드 적응 행동 검사, 제3판; WISC-V, 유아용 웩슬러 지능 척도, 제5판. rAAV, 벡터, 조성물 및 방법은 둘 다 MLD 환자에서 영향을 받는 CNS 및 PNS 둘 다에 투여된 수일 이내에 ARSA 효소의 초-생리학적 수준을 제공한다. AAVhu68 캡시드 및 ICM 경로는 뉴런, DRG 및 말초 신경 엑손 세포의 우수 한 형질도입의 관찰을 기반으로 선택되었다. 수초화 세포의 벡터 형질도입은 제한적이지만, 교차-교정 가능성은 희소돌기아교세포에 의한 효소 흡수를 허용할 것이다. 또한, AAV 벡터 및 ARSA 효소는 엑손을 따라 수송되어, 뇌 내에서 그리고 말초로 치료적 효소의 발현을 확장할 수 있다. X. 약제학적 조성물을 뇌척수액에 전달하기 위한 장치 및 방법 소정의 실시형태에서, AAV.CB7.CI.hARSAco.rBG는 컴퓨터 단층촬영-(CT-) 유도 후두하 주사를 통해 대수조(대수 조내[ICM])에 단일 용량으로 투여된다. 단일유전자 CNS 질환의 많은 동물 모델이 AAV-매개성 유전자 전달을 사용하여 성공적으로 치료되었으며, 1세대 AAV 벡터를 사용한 여러 초기 인간 연구는 뇌로의 벡터 전달의 안전성을 입증하였다(문헌[Janson et al., 2002; Mandel and Burger, 2004; Kaplitt et al., 2007; Mittermeyer et al., 2012; Bartus et al., 2014]). 그러나, 이들 벡터의 낮은 효율은 동물 모델에서의 효능이 임상적 혜택으로 전환되는 것을 방지하였다. 2세대AAV 벡터의 출현으로, 뇌로의 유전자 전달의 가능성이 크게 향상되었다. 특히, AAV9와 같은 일부 클레이드 F 분 리주는 극도로 효율적인 뇌 형질도입을 보여주었다(문헌[Gray et al., 2013; Haurigot et al., 2013; Hinderer et al., 2014; Bell et al., 2015]). 이러한 보다 효율적인 벡터를 사용하여, 유전자 요법은 여러 가지 신경학 적 장애를 치료할 가능성이 크게 향상되었으며, 2세대 벡터를 이용하는 여러 프로그램이 임상에서 진행되었다 (문헌[Haurigot et al., 2013; Hinderer et al., 2014; Bell et al., 2015; Gurda et al., 2016; Hinderer et al., 2016]). CNS 유전자 전달에 대한 초기 연구는 1세대 AAV 벡터의 낮은 유전자 전달 효율뿐만 아니라, 이용 가능한 전달 방법의 한계로 인해 문제가 있었다. 대부분의 초기 비-임상적 및 임상적 연구는 뇌 또는 척수의 실질 (parenchyma)로의 직접 벡터 주사를 이용하였다(문헌[Vite et al., 2005; Worgall et al., 2008; Colle et al., 2010; Ellinwood et al., 2011; Tardieu et al., 2014]). 이러한 방법은 주사 부위 근처에서 강력한 형질 도입을 생성하지만, 광범위한 이식유전자 전달을 달성하기 위해 많은 수의 벡터 주사가 필요하였기 때문에 CNS 전반에 걸쳐 세포에 영향을 미치는 질환에 대해 이 접근법으로 바꾸는 것은 어려웠다. CNS 유전자 전달에 대한 추가적인 장애물은 뇌실질내 벡터 주사가 주사 부위에서 염증을 촉발할 수 있다는 발견이었고, 이는 이식유전자 제품에 대한 적응 면역 반응을 촉진할 수 있었다(문헌[Worgall et al., 2008; Colle et al., 2010; Ellinwood et al., 2011; Ciesielska et al., 2013]). CNS의 넓은 영역을 보다 안전하고 효과적으로 표적화하기 위해 두 가지 대안적인 벡터 전달 방법이 개발되었다. 첫 번째는 AAV9를 포함한 일부 AAV 벡터가 IV 전달 후 CNS 내에서 세포를 형질도입할 수 있다는 발견을 기반으 로 하였다(문헌[Foust et al., 2009]). 그러나, IV 벡터 전달에는 두 가지 중요한 제한이 있다. 첫째, CNS로의 벡터 침투의 낮은 효율은 치료적 수준의 이식유전자 발현을 달성하기 위해 매우 많은 벡터 용량을 필요로 하며, 이는 전신 독성의 위험을 증가시키고 많은 환자 집단을 위해 제조하는 것이 가능하지 않을 수 있는 벡터의 양을 잠재적으로 필요로 한다(문헌[Gray et al., 2011; Hinderer et al., 2014; Gurda et al., 2016]). 둘째, IV 벡 터 전달 후 CNS로의 유전자 전달은 벡터 캡시드에 대한 기존의 NAb에 의해 크게 제한된다(문헌[Gray et al., 2011]). 인간에서 AAV NAb의 높은 유병률을 감안할 때, 이는 IV AAV 치료에 대한 후보가 아닌 상당한 환자 집단 을 남긴다. CNS를 표적으로 하는 IV AAV의 한계를 피하기 위해, IT 벡터 전달이 대안적인 접근법으로 개발되었 다. 벡터 분산을 위한 비히클로서 CSF를 사용하면, IT ROA는 단일 최소 침습적 주사로 CNS 및 PNS 전체에 걸쳐 이식유전자 전달을 달성할 수 있는 가능성이 있다. 동물 연구는 혈액-뇌 장벽을 통과할 필요를 없애줌으로써, IT 전달이 IV 접근법에 필요한 것보다 훨씬 더 낮은 벡터 용량으로 실질적으로 보다 효율적인 CNS 유전자 전달 로 이어진다는 것을 입증하였다(문헌[Gray et al., 2011; Hinderer et al., 2014]). 항체는 CSF에서 매우 낮은 수준으로 존재하기 때문에, IT 벡터 전달은 AAV 캡시드에 대한 기존의 NAb에 의해 영향을 받지 않아, 이 접근법 을 더 넓은 환자 집단에 적용할 수 있다(문헌[Haurigot et al., 2013]). IT AAV 전달은 CSF 접근을 위한 여러 가지 경로를 사용하여 수행될 수 있다. 요추 천자(LP)가 CSF에 접근하기 위한 가장 일반적인 방법이므로, NHP에 서 AAV 투여를 위한 경로로 평가되었다. LP를 통한 CSF 내로의 AAV9 벡터의 전달은 대수조의 수준에서 벡터를 더 우수하게 주사하는 것과 비교하여 뇌 및 척수의 세포를 형질도입하는데 적어도 10-배 덜 효율적인 것으로 밝 혀졌다(문헌[Hinderer et al., 2014]). NHP에서 단일 ICM 주사로 달성된 우수한 뇌 형질도입으로 인해 이 ROA가 AAV.CB7.CI.hARSAco.rBG의 임상적 연구 를 위해 선택되었다. 한때 일반적인 절차였던 ICM 주사(후두하 천자로도 알려짐)는 뇌간 또는 주변 혈관 손상의 사례로 인해 사전 영상화 시대에 결국 LP로 대체되었다(문헌[Saunders and Riordan, 1929]). 오늘날, 절차는 실 시간 CT 안내에 따라 수행될 수 있어, 바늘 삽입 동안 수질, 척추 동맥 및 후하소뇌 동맥과 같은 중요한 구조를 시각화할 수 있다(문헌[Pomerantz et al., 2005; Hinderer et al., 2014]). 일 양태에서, 본 명세서에 제공된 벡터는 이 부문에서 제공되고 참조에 의해 본 명세서에 원용되어 있는 WO 2018/160582에 기술되어 있는 방법 및/또는 장치를 통해 척추강내로 투여될 수 있다. 대안적으로, 다른 장치 및 방법이 선택될 수 있다. 소정의 실시형태에서, 방법은 환자의 대수조 내로 척수 바늘을 통한 CT-유도 후두하 주사의 단계를 포함한다. 본 명세서에서 사용되는 바와 같이, 용어 컴퓨터 단층촬영(Computed Tomography: CT)은 축을 따라 만들어진 일 련의 평면 단면 이미지로부터 신체 구조의 3차원 이미지를 컴퓨터로 구성하는 방사선촬영을 지칭한다. 치료 당일, 적절한 농도의 rAAVhu68.hARSAco가 준비된다. 적절한 농도의 5.6㎖의 rAAVhu68.hARSAco가 들어 있 는 주사기가 시술실로 전달된다. 연구 약물 투여를 위해 다음 직원들이 있다: 마취의 및 호흡기 기술자(들); 간 호사 및 보조의사; CT(또는 수술실) 기술자; 부위 검색 코디네이터. 약물 투여 전, 미리 결정된 부피의 CSF를제거하기 위해 요추 천자가 수행된 다음, 대수조의 관련 해부학적 시각화를 돕기 위해 척추강내로(IT) 아이오딘 화 조영제가 주사된다. 정맥내(IV) 조영제는 척추강내 조영제에 대한 대안으로 바늘 삽입 전 또는 도중에 투여 될 수 있다. IV 또는 IT 조영제를 사용할 것인지 결정하는 것은 중재 방사선 전문의의 재량이다. 대상체가 마취 되고, 삽관되어 테이블에 배치된다. 주사 부위가 준비되고, 멸균 기법을 사용하여 멸균한 천으로 덮어진다. 척 수 바늘(22 G 내지 25 G)은 형광투시 안내하에 대수조로 전진된다. 바늘 배치를 돕기 위해 더 큰 유도 바늘이 사용될 수 있다. 바늘 위치의 확인 후, 확장 세트가 척수 바늘에 부착되고 CSF로 채워진다. 중재 방사선 전문의 의 재량에 따라, 조영제 물질이 들어 있는 주사기가 확장 세트에 연결되고, 대수조에 바늘이 위치하는지 확인하 기 위해 소량이 주사될 수 있다. 바늘 위치가 CT 안내 +/- 조영제 주사에 의해 확인된 후, 5.6㎖의 rAAVhu68.hARSAco가 들어 있는 주사기가 확장 세트에 연결된다. 주사기 내용물은 1분 내지 2분에 걸쳐 천천히 주사되어, 5.0㎖의 부피를 전달한다. 바늘은 대상체로부터 천천히 제거된다. 일 실시형태에서, 용량은 CSF 구획의 크기의 근사치를 제공하는 뇌 질량에 따라 조정될 수 있다. 추가의 실시형 태에서, 용량 변환은 뇌 질량을 기준으로, 성인 마우스의 경우 0.4g, 어린 레서스 마카크의 경우 90g 및 4개월 내지 18개월 유아의 경우 800g이다. 다음 표는 뮤린 MED 연구, NHP 독성학 연구 및 등가의 인간 용량에 대한 예 시적인 용량을 제공한다."}
{"patent_id": "10-2021-7039381", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 11, "content": "소정의 실시형태에서, rAAVhu68.hARSAco 벡터는 단일 용량으로 대상체에 투여된다. 소정의 실시형태에서, 다중 용량(예를 들어, 2회 용량)이 바람직할 수 있다. 예를 들어, 6개월 미만의 유아의 경우, 다중 용량 전달된 수일, 수주 또는 수개월 간격으로 다중 용량이 전달되는 것이 바람직할 수 있다. 소정의 실시형태에서, rAAVhu68.hARSAco 벡터의 단일 용량은 약 1×109 GC 내지 약 3×1011 GC이다. 소정의 실시 형태에서, rAAVhu68.HARSA의 용량은 1×1010 GC/뇌 질량 내지 3.33×1011 GC/뇌 질량이다. 다른 실시형태에서, 상이한 용량이 선택될 수 있다. 조성물은 약 1×109 게놈 카피(GC) 내지 약 5×1013 GC(체중 70㎏의 평균 대상체를 치료하기 위해) 범위인 AAV의 양을 함유하도록 투여 단위로 제형화될 수 있다. 일 실시형태에서, 약 15㎖(또는 그 이하) 내지 약 40㎖의 CSF 가 제거되고, 벡터가 CSF와 혼합되고/되거나 상용성인 담체에 현탁되어 대상체에 전달되는 척수 천자가 수행된 다. 일 예에서, 벡터 농도는 약 3×10 13 GC이지만, 다른 양은 약 1×109 GC, 약 5×109 GC, 약 1×1010 GC, 약 5 ×1010 GC, 약 1×1011 GC, 약 5×1011 GC, 약 1×1012 GC, 약 5×1012 GC 또는 약 1.0×1013 GC와 같다. 공동-요법은 본 명세서에 제공된 rAAVhu68.hARSAco 조성물과 함께 전달될 수 있다. 본 출원의 앞 부분에 기재된 바와 같은 공동-요법은 참조에 의해 본 명세서에 원용된다. 단어 \"포함하다(comprise)\", \"포함하다(comprises)\" 및 \"포함하는(comprising)\"은 배타적이 아니라 포괄적으로 해석되어야 한다. 단어 \"구성되다\", \"구성되는\" 및 이의 변형은 포괄적이 아니라 배타적으로 해석되어야 한다. 명세서의 다양한 실시형태가 \"포함하는\" 언어를 사용하여 제시되지만, 다른 상황 하에서 관련된 실시형태도 또 한 \"~로 구성되는\" 또는 \"~로 본질적으로 구성되는\" 언어를 사용하여 해석 및 설명되는 것으로 의도된다. 용어 \"발현\"은 가장 광범위한 의미로 본 명세서에서 사용되며 RNA 또는 RNA 및 단백질의 생성을 포함한다. RNA 와 관련하여, 용어 \"발현\" 또는 \"번역\"은 특히 펩타이드 또는 단백질의 생성과 관련된다. 발현은 일시적일 수 있거나 안정적일 수 있다. 본 명세서에서 사용되는 바와 같이, \"발현 카세트\"는 코딩 서열, 프로모터를 포함하고, 이에 대한 다른 제어 서 열을 포함할 수 있는 핵산 분자를 지칭한다. 특정 실시형태에서, 벡터 게놈은 2개 이상의 발현 카세트를 포함할 수 있다. 다른 실시형태에서, 용어 \"이식유전자\"는 \"발현 카세트\"와 상호교환적으로 사용될 수 있다. 전형적으로, 이와 같은 바이러스 벡터를 생성하기 위한 발현 카세트는 바이러스 게놈의 신호 및 본 명세서에 기재된 것 과 같은 다른 발현 제어 서열의 패키징의 측면에 있는 본 명세서에 기재된 유전자 산물에 대한 코딩 서열을 포 함한다. 단백질 또는 핵산과 관련하여 사용될 때 용어 \"이종\"은 단백질 또는 핵산이 자연에서 서로 동일한 관계에서 발 견되지 않는 2개 이상의 서열 또는 하위서열을 포함함을 나타낸다. 예를 들어, 새로운 기능성 핵산을 만들기 위 해 배열된 관련되지 않은 유전자로부터의 2개 이상의 서열을 가지는 핵산은 전형적으로 재조합으로 생성된다. 예를 들어, 일 실시형태에서, 핵산은 상이한 유전자로부터 코딩 서열의 발현을 지시하도록 배열된 하나의 유전 자 유래의 프로모터를 가진다. 따라서, 코딩 서열과 관련하여, 프로모터는 이종성이다. 본 명세서에서 사용되는 바와 같이, \"유효량\"은 벡터 게놈으로부터 일정 양의 유전자 산물을 표적 세포에 전달 하고 표적 세포에서 발현하는 rAAV 조성물의 양을 지칭한다. 유효량은 인간 환자가 아닌 동물 모델을 기준으로 결정될 수 있다. 적합한 뮤린 또는 NHP 모델의 예가 본 명세서에 기재되어 있다. 본 발명의 맥락에서 용어 \"번역\"은 리보솜에서의 과정에 관한 것이되, mRNA 가닥은 단백질 또는 펩타이드를 생 성하기 위해 아미노산 서열의 조립을 제어한다. 단수형 용어는 하나 이상을 지칭하며, 예를 들어, \"인핸서\"는 하나 이상의 인핸서(들)를 나타내는 것으로 이해 된다는 점에 유의하여야 한다. 이와 같이, 단수형 용어, \"하나 이상\" 및 \"적어도 하나\"는 본 명세서에서 상호교 환적으로 사용된다. 위에 기재된 바와 같이, 수치를 변경하기 위해 사용될 때 용어 \"약\"은 달리 명시되지 않는 한 ±10%의 변동을 의미한다. 본 명세서에서 달리 정의되지 않는 한, 본 명세서에서 사용된 기술 및 과학 용어는 본 출원에서 사용되는 많은 용어에 대한 일반적인 지침을 당업자에게 제공하는 공개된 텍스트를 참조하여 당업자에 의해 일반적으로 이해되 는 것과 동일한 의미를 갖는다. 실시예 다음 실시예는 단지 예시적인 것이며, 본 발명을 제한하려는 것이 아니다. 벡터 AAVhu68.CB7.CI.hARSAco.rBG(AAV.CB7.CI.hARSAco.rBG 또는 AAVhu68.hARSAco 또는 AAV.hARSAco로도 지칭됨)를 CSF에 전달하여 치료적 ARSA 발현 수준을 달성하고 MLD의 여러 바이오마커를 구제한다. AAV.CB7.CI.hARSAco.rBG의 여러 개념 증명 약리학적 연구를 건강한 야생형 마우스에서 수행하였다. 건강한 마우 스 및 비인간 영장류(NHP)에서의 비-임상적 연구는 AAV.CB7.CI.hARSAco.rBG의 CSF 전달이 CNS, PNS 및 CSF에서 ARSA의 과발현을 초래한다는 것을 입증하였다(실시예 1 내지 4). 실시예 2는 AAV.CB7.CI.hARSAco.rBG의 뇌실내 (ICV) 투여가 건강한 야생형 마우스의 뇌에서 효소적으로 활성인 ARSA의 발현을 유도한다는 것을 입증하였다. 실시예 3은 ARSA의 관찰된 발현이 MLD 환자에서 ARSA 결핍에 의해 영향을 받는 두 가지 주요 세포 유형인 피질 뉴런 및 희소돌기아교세포 둘 다의 형질도입 및/또는 교차-교정으로부터 부분적으로 발생한다는 것을 입증하였 다. ARSA의 잠재적인 치료적 수준은 또한 크기-관련 동물, 사이노몰구스 마카크(실시예 4)에서 얻었으며, 효능 연구는 생체내 및/또는 시험관내 MLD 질환 모델에서 수행하였다. 용량 범위를 테스트하는 추가 실험을 건강한 성체 사이노몰구스 마카크에서 수행하였으며, 이는 항-인간 ARSA(hARSA) 항체의 유도에도 불구하고, 뇌, 척수 및 DRG의 뉴런이 AAV.CB7.CI.hARSAco.rBG의 ICM 투여 후 적어도 6주 동안 ARSA의 강력한 발현을 나타내었다는 것을 입증하였다(실시예 4). 기준선 CSF ARSA 활성 수준의 2배가 또한 처리 2주 후에 관찰되었으며(실시예 4), 이는 조기 발병 MLD 환자에서 ARSA의 치료적 발현 수준을 달성할 가능성을 시사한다. MED 연구에서의 후속 사용을 위해 MLD의 새로운 마우스 모델(실험 5)에서 AAV.CB7.CI.hARSAco.rBG의 약리학 및 독성을 평가하기 위해 실험을 또한 수행하였다(실시예 6). MLD 환자-유래 세포주에서 질환 바이오마커를 감소시 키기 위한 AAV.CB7.CI.hARSAco.rBG의 효능을 테스트하기 위한 시험관내 모델을 조사하였다(실시예 7). 추가로, 실시예 8은 어린 레서스 마카크에서의 AAV.CB7.CI.hARSAco.rBG의 약리학 및 독성학 연구를 제공한다. 실시예 10 은 소아 MLD 집단에서 AAV.CB7.CI.hARSAco.rBG의 시험을 보여준다. 실시예 1 - AAV.hARSAco 벡터 AAV.hARSAco의 구성요소가 아래 표에 예시되어 있다."}
{"patent_id": "10-2021-7039381", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 12, "content": "AAV2 반전 말단 반복부가 측면에 있는 사이토메갈로바이러스 인핸서(CB7; 서열번호 16)와 함께 닭 베타 액틴 프 로모터로부터 발현된 인간 ARSA(서열번호 1 및 서열번호 3)에 대한 코딩 서열을 포함하는 시스-플라스미드로부 터 벡터를 구축하였다. 벡터를 부착 HEK 293 세포의 삼중 형질감염에 의해 AAV 혈청형 hu68 캡시드(WO 2018/160582)에 패키징하고, 문 헌[Lock, M., et al. Rapid, Simple, and Versatile Manufacturing of Recombinant Adeno-Associated Viral Vectors at Scale. Human Gene Therapy 21, 1259-1271 ]에 이전에 기재된 바와 같이 아이오딕사놀 구배 원신분리에 의해 정제하였다. 더욱 상세하게는, AAV.CB7.CI.hARSAco.rBG는 AAV 시스 플라스미드(pENN.AAV.CB7.CI.hARSAco.rBG.KanR), AAV2 rep 및 AAVhu68 캡 유전자를 암호화하는 AAV 트랜스 플라스미드(pAAV2/hu68.KanR) 및 헬퍼 아데노바이러스 플라 스미드(pAdΔF6.KanR)로 HEK293 제조용 세포 은행(working cell bank: WCB) 세포를 삼중 플라스미드 형질감염 시켜 생성하였다. AAV.CB7.CI.hARSAco.rBG 패키징된 벡터 게놈의 크기는 3883개의 염기(서열번호 5의 1번 nt 내 지 3883번 nt)이다. 시스 플라스미드(도 2)는 다음의 벡터 게놈 서열 요소를 포함한다: 반전 말단 반복부(ITR): ITR은 벡터 게놈의 모든 구성요소의 측면에 있는 AAV2(130개 염기쌍 [bp], GenBank: NC_001401)로부터 유래된 동일하고 역상보적인 서열이다. ITR은 AAV 및 아데노바이러스 헬퍼 기능이 트랜스로 제공될 때 벡터 DNA 복제 기점 및 벡터 게놈에 대한 패키징 신호 둘 다로서 기능한다. 이와 같이, ITR 서열은 벡터 게놈 복제 및 패키징에 필요한 유일한 시스 서열을 나타낸다. 인간 사이토메갈로바이러스 급초기 인핸서(CMV IE): 인간-유래 사이토메갈로바이러스(382bp, GenBank: K03104.1)로부터 얻은 이러한 인핸서 서열은 하류 이식유전자의 발현을 증가시킨다. 닭 β-액틴(BA) 프로모터(서열번호 18): 이러한 유비쿼터스 프로모터(281bp, GenBank: X00182.1)는 임의의 세포 유형에서 이식유전자 발현을 구동시키기 위해 선택되었다. 키메라 인트론(CI): 하이브리드 인트론은 닭 BA 스플라이스 공여체(973bp, GenBank: X00182.1) 및 토끼 β-글로 빈 스플라이스 억셉터 요소로 구성된다. 인트론은 전사되지만, 스플라이싱에 의해 성숙 메신저 리보핵산(mRNA) 으로부터 제거되어 양쪽에 있는 서열을 함께 모은다. 발현 카세트에서 인트론의 존재는 핵에서 세포질로 mRNA의 수송을 촉진하므로, 번역을 위한 mRNA의 정상 수준(steady level)의 축적을 향상시키는 것으로 나타났다. 이는 증가된 수준의 유전자 발현을 위한 유전자 백터의 일반적인 특징이다. 코딩 서열: 인간 ARSA 유전자(서열번호 1 또는 서열번호 3)의 조작된 상보적 데옥시리보핵산(cDNA)은 설페이트 화된 갈락토스핑고리피드인 갈락토실세라마이드-3-O-설페이트 및 갈락토실스핑고신-3-O-설페이트(1527bp; 509개 아미노산[aa], GenBank: NP_000478.3)의 탈황(desulfation)을 담당하는 라이소솜 효소인 아릴설파테이스 A를 암호화한다. 토끼 β-글로빈 폴리아데닐화 신호(rBG 폴리A): rBG 폴리A 신호(127bp, GenBank: V00882.1)는 시스로 이식유전 자 mRNA의 효율적인 폴리아데닐화를 촉진한다. 이러한 요소는 전사 종결, 초기(nascent) 전사체의 3' 말단에서의 특정 절단 이벤트 및 긴 폴리아데닐 꼬리의 추가에 대한 신호로 기능한다. 플라스미드의 모든 구성 요소는 직접 시퀀싱에 의해 확인하였다. AAV2/hu68 트랜스 플라스미드(도 3)는 pAAV2/hu68.KanR이다. 길이는 8030bp이며, AAV 벡터 게놈의 복제 및 패 키징에 필요한 네 개의 야생형 AAV2 레플리케이스(Rep) 단백질을 암호화한다. pAAV2/hu68.KanR 플라스미드는 또 한 AAV 벡터 게놈을 수용하기 위해 AAV 혈청형 hu68의 비리온 셸로 조립되는 세 개의 야생형 AAVhu68 비리온 단 백질 캡시드(Cap) 단백질을 암호화한다. 신규한 AAVhu68 서열은 인간 심장 조직 DNA로부터 얻었다. pAAV2/hu68.KanR 트랜스 플라스미드를 생성하기 위해, 플라스미드 pAAV2/9n(pBluescript KS 벡터로부터 유래된 플라스미드 백본 상의 야생형 AAV2 rep 및 AAV9 cap 유전자를 암호화함)으로부터 AAV9 cap 유전자를 제거하고 AAVhu68 cap 유전자로 대체하였다. 암피실린 저항성(AmpR) 유전자를 또한 카나마이신 저항성(KanR) 유전자로 대 체하여, pAAV2/hu68.KanR을 생성하였다. 이 클로닝 전략은 AAV p5 프로모터 서열(일반적으로 rep 발현을 유도함)을 rep의 5' 말단에서 cap의 3' 말단으로 재배치하여, rep의 상류에 절단된 p5 프로모터를 남겼다. 이 절단된 프로모터는 rep의 발현을 하향조절하여, 결과적으로 벡터 생산을 최대화하는 역할을 한다. 플라스미드의 모든 구성 요소는 직접 시퀀싱에 의해 검증하였다. 플라스미드 pAdDeltaF6(KanR)(도 4)를 구축하였으며, 크기는 15,770bp이다. 플라스미드는 AAV 복제에 중요한 아 데노바이러스 게놈의 영역; 즉, E2A, E4 및 VA RNA(아데노바이러스 E1 기능은 HEK293 세포에 의해 제공됨)를 포 함한다. 그러나, 플라스미드는 다른 아데노바이러스 복제 또는 구조 유전자를 포함하지 않는다. 플라스미드는 아데노바이러스 ITR과 같은 복제에 중요한 시스 요소를 포함하지 않는다; 따라서, 감염성 아데노바이러스는 생 성되지 않을 것으로 예상된다. 플라스미드는 Ad5(pBHG10, pBR322-기반 플라스미드)의 E1, E3-결실된 분자 클론 으로부터 유래되었다. 불필요한 아데노바이러스 유전자의 발현을 제거하고 아데노바이러스 DNA의 양을 32kb에서 12kb로 줄이기 위해 Ad5에 결실을 도입하였다(도 5a). 마지막으로, 암피실린 저항성 유전자를 카나마이신 저항 성 유전자로 대체하여 pAdeltaF6(KanR)을 생성하였다(도 5b). HEK293 세포에 존재하는 E1과 함께 이 플라스미드 에 남겨진 E2, E4 및 VA 아데노바이러스 유전자는 AAV 벡터 생산에 필요하다. HEK293 세포의 일시적인 형질감염 후 하류 정제에 의해 AAV.CB7.CI.hARSAco.rBG를 제조하였다. 제조 공정 흐름 도는 도 6 및 도 7에 도시되어 있다. 제품의 준비에 들어가는 주요 시약은 다이어그램의 왼쪽에 표시되어 있고, 및 공정 품질 평가는 다이어그램의 오른쪽에 표시되어 있다. 각 생산 및 정제 단계에 대한 설명도 또한 제공되 어 있다. 제품 제조는 단위 작업의 선형 흐름을 따르며, 달리 명시되지 않는 한 일회용 폐쇄 바이오프로세싱 시 스템을 이용한다. 세포 시딩에서 수확물 수집에 이르기까지 세포 배양을 포함한 생산 공정의 모든 단계는 멸균 된, 일회용 튜브 및 백 어셈블리를 사용하여 무균적으로 수행하였다. 코닝 플랫웨어(T-플라스크, CellSTACKs [CS-10] 및/또는 HYPERStacks [HS-36])를 사용하여 세포를 증식시켰다. 세포를 생물반응기(들)에서 형질감염시 켰으며, 모든 개방형 조작은 ISO 클래스 5 환경의 클래스 II 생물학적 안전성 캐비닛(class II biological safety cabinet: BSC)에서 수행하였다. 정제 과정은 가능한 경우 폐쇄 시스템에서 수행하였다. AAV.CB7.CI.hARSAco.rBG에 대한 제조 공정을 개발하였으며, 플라스미드 DNA를 이용한 인간 배아 신장 293(HEK293) 세포의 일시적 형질감염을 포함한다. 생산에 사용된 HEK293 제조용 세포 은행(WCB)을 FDA 및 국제 의약품 규제조화위원회(International Council for Harmonisation: ICH) 지침에 자세히 설명된 바와 같이 테스 트하고 인증 받았다. 임상 개발을 지원하기 위해, 단일 배취 또는 다중배취의 벌크 원료의약품(bulk drug substance: BDS)을 생물반응기에서 HEK293 세포의 폴리에틸렌이민-(PEI-) 매개성 삼중 형질감염에 의해 생산하 였다. 수확된 AAV 물질을 가능한 경우 일회용 폐쇄 바이오프로세싱 시스템에서 정화, 접선 유동 여과(TFF), 친 화성 크로마토그래피 및 음이온 교환 크로마토그래피에 의해 순차적으로 정제하였다. 생성물은 척추강내 최종 제형 완충액(ITFFB; 0.001% Pluronic F-68을 포함한 인공 CSF)으로 제형화하였다. BDS 배취 또는 배취를 동결 시킨 다음 해동하고, 필요한 경우 풀링하여 목표 농도로 조정하고, 0.22㎛ 필터를 통해 멸균 여과하고, 바이알 을 채웠다. 두 개의 상이한 생물반응기를 사용하였다: 소규모 또는 파일럿-규모의 생물반응기 및 대규모 생물반응기. 소규 모 생물반응기는 대규모 생물반응기에 대해서 세포 성장을 위한 동일한 베드 높이를 갖는 선형적으로 확장된 생 물반응기이다. 소규모 생물반응기와 대규모 생물반응기의 사용은 최소한의 공정 및 물질 영향으로 확장 가능한 제조를 가능하게 한다. 대규모 생물반응기 및/또는 소규모 생물반응기는 독성학 로트(들)의 생산에 이용된다. 대규모 생물반응기는 임상 시험 및 허가에 이용될 우수 의약품 제조 관리 기준(good manufacturing practice: GMP) 원료의약품(DS) 로트(들)의 생산에 사용된다. 대규모 GMP 생산 배취 크기는 의약품(DP) 공급에 필요한 벡 터 양을 충족시키기 위해 필요한 경우 다중 배취를 계획하고 풀링하여 생성된다. AAV.CB7.CI.hARSAco.rBG에 대한 제조 공정은 제품이 IND를 가능하게 하는 비-임상적 연구에서 임상 개발로 그리고 허가를 통해 이동함에 따 라 크게 변경되지 않은 상태로 유지된다. 제품 품질에 영향을 미치는 것으로 가정된 공정 매개변수는 수정되지 않는다. GMP 제조를 위해 이용되는 PEI 및 플라스미드 DNA는 GMP-Source™ 또는 INDReady™ 등급 물질이지만, HEK293 WCB를 포함한 대부분의 중요한 원료 물질은 동일하게 유지된다. 대규모 생물반응기를 통한 스케일-업 제조 공정이 구현됨에 따라, 현재 생물반응기 플랫폼에 결합된 제조 경험 을 기반으로 공정 변경과 관련된 임의의 잠재적인 영향을 비교동등성 검사(comparability testing)를 통해 처리 하여 제품의 동일성, 순도, 효능 및 안전성에 변화가 없는지 확인하였다. 업데이트된 절차 또는 새로운 물질로 제조된 새로운 로트를 이전의 로트와 비교하기 위해 수행되는 비교동등성 검사는 분석 증명서(certificate of analysis: COA)에 포함된 테스트의 하위집단으로 구성된다. 새로운 로트는 이전에 확립된 사양을 충족하며, 비 교동등성 평가에 포함된 임의의 테스트(하기 표)는 유사한 방법론 및 가능한 경우 동일한 테스트 장소를 사용하 여 완료된다."}
{"patent_id": "10-2021-7039381", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 13, "content": "세포 배양물 및 수확물 제조 공정은 다음 4개의 주요 제조 단계를 포함한다: (a) 세포 시딩 및 증식, (b) 일시 적 형질감염, (c) 벡터 수확 및 (d) 벡터 정화. 이러한 공정의 설정은 개요 프로세스 다이어그램에 도시되어 있 다(도 6). 이러한 각 공정에 대한 일반적인 설명은 아래에 나와 있다. (a) 세포 시딩 및 증식 완전히 특성화된 HEK293 세포주를 생산 공정에 사용하였다. WCB를 생성하였다. 벡터 생산에 사용되는 세포 배양 물은 하나 또는 두 개의 해동된 WCB 바이알에서 시작하여 표준제조기록서(Master Batch Record: MBR) 문서에 따 라 증식시켰다. 조직 배양 플라스틱을 사용하여 세포를 증식시켜 DS 배취당 벡터 생산을 위한 대규모 생물반응 기 용기 표면적에 시딩하기 위해 충분한 세포 질량이 생성될 수 있게 하였다. 세포를 10% 감마 조사된 뉴질랜드 산 태아 소 혈청(FBS)이 보충된 둘베코의 변형된 이글 배지(DMEM)로 구성된 배지에서 배양하였다. 세포는 부착- 의존성이었으며, 세포 분리는 동물 성분이 포함되지 않은 세포 분리 시약인 TrypLE™ Select를 사용하여 달성하 였다. 세포 시딩은 멸균된 일회용 바이오프로세싱 백 및 튜브 세트를 사용하여 달성하였다. 반응기는 온도, pH 및 용존 산소(DO)로 제어하였다. (b) 일시적 형질감염 대략 4일의 성장(DMEM 배지 + 10% FBS) 후, 세포 배양 배지를 신선한 무혈청 DMEM 배지로 교체하고, 세포를 PEI-기반 형질감염 방법을 사용하여 3개의 생산 플라스미드로 형질감염시켰다. 생산 미생물 오염도에서 사용되 는 모든 플라스미드는 추적 가능성, 문서 관리 및 재료 분리를 보장하기 위해 사회적 기반시설 활용 통제와 함께 위에 기재된 바와 같은 CMO 품질 시스템의 맥락에서 생산하였다. 충분한 플라스미드 DNA 형질감염 복합체를 BSC에서 제조하여 최대 500㎡(BDS 배취당)을 형질감염시켰다. 처음에, 시스(벡터 게놈) 플라스미드, 트랜스(rep 및 cap 유전자) 플라스미드 및 헬퍼 플라스미드를 GMP-등급 PEI(PEIPro HQ, 폴리플러스 트랜스펙션 에스에이 (PolyPlus Transfection SA))와 최적의 비로 포함하는 DNA/PEI 혼합물을 제조하였다. 이 플라스미드 비는 소규 모 최적화 연구에서 AAV 생산에 최적인 것으로 결정되었다. 잘 혼합한 후, 용액을 실온에서 최대 25분 동안 방 치한 다음, 무혈청 배지를 첨가하여 반응을 중지시키고, 마지막으로 생물반응기에 첨가하였다. 반응기는 온도 및 DO로 제어하였으며, 세포는 5일 동안 인큐베이션하였다. (c) 벡터 수확 형질감염된 세포 및 배지를 생물반응기에서 배지를 무균적으로 펌핑함으로써 일회용 바이오프로세싱 백을 사용 하여 생물반응기로부터 수확하였다. 수확 후, 세제, 엔도뉴클레이스 및 MgCl2(엔도뉴클레이스의 보조 인자)를 첨 가하여 벡터를 방출시키고, 패키징되지 않은 DNA를 분해하였다. 생성물(일회용 바이오프로세싱 백 내)을 형질감 염 절차의 결과로 수확물에 존재하는 잔류 세포 및 플라스미드 DNA의 효소적 분해에 충분한 시간을 제공하기 위 해 온도가 조절되는 일회용 믹서에서 37℃에서 2시간 동안 인큐베이션하였다. 이 단계를 수행하여 최종 벡터 DP 에서 잔류 DNA의 양을 최소화하였다. 인큐베이션 후, NaCl을 500mM의 최종 농도로 첨가하여 여과 및 하류 TFF 동안 생성물을 회수하였다. (d) 벡터 정화 연동 펌프로 구동되는 멸균된 폐쇄 튜브 및 백 세트로 직렬로 연결된 사전-필터 및 심층 필터 캡슐(1.2/0.22 ㎛)를 사용하여 생성물로부터 세포 및 세포 찌꺼기를 제거하였다. 정화는 하류 필터 및 크로마토그래피 칼럼이 오염으로부터 보호되도록 하고, 미생물 오염(bioburden) 감소 여과는 필터 트레인의 끝에서 상류 생산 공정 동 안 잠재적으로 도입된 임의의 미생물 오염이 하류 정제 전에 제거되도록 한다. 정제 공정은 4개의 주요 제조 단계를 포함한다: (a) TFF에 의한 농축 및 완충액 교환, (b) 친화성 크로마토그래 피, (c) 음이온 교환 크로마토그래피 및 (d) TFF에 의한 농축 및 완충액 교환. 이들 공정 단계는 개요 프로세스 다이어그램에 도시되어 있다(도 6). 이들 각 공정에 대한 일반적인 설명은 아래에 제공되어 있다. (a) 대규모 접선 유동 여과 정화된 생성물의 부피 감소(20-배)는 맞춤형 멸균, 폐쇄 바이오프로세싱 튜브, 백 및 막 세트를 사용하여 TFF에 의해 달성하였다. TFF의 원리는 적합한 다공성(100kDa)의 막에 평행한 압력하에 용액을 흐르게 하는 것이다. 차 압은 더 작은 크기의 분자를 막을 통해 효과적으로 폐기물 흐름으로 유도하는 동시에 막 공극보다 큰 분자를 유 지한다. 용액을 재순환시킴으로써, 평행 흐름이 막 표면을 휩쓸고, 막에 결합하여 막 기공 오염 및 생성물 손실 을 방지한다. 적절한 막 기공 크기 및 표면적을 선택함으로써, 목적하는 분자를 유지 및 농축시키면서 액체 샘 플의 부피를 빠르게 줄일 수 있다. TFF 적용시 정용여과는 새로운 완충액을 첨가하여 액체가 막을 통과하고 폐 기물 흐름과 동일한 속도로 샘플을 재순환시키는 것을 포함한다. 정용여과의 부피가 증가함에 따라, 재순환 샘 플로부터 제거되는 소분자의 양이 증가한다. 이러한 정용여과는 정화된 생성물을 적절하게 정제할 수 있지만, 후속 친화성 칼럼 크로마토그래피 단계와 양립 가능한 완충액 교환도 달성한다. 따라서, 농축을 위해 100kDa, PE(폴리에터설폰) 막을 사용한 다음, 20mM Tris(pH 7.5) 및 400mM NaCl로 구성된 완충액의 최소 4 통과부피 (diavolume)로 정용여과하였다. 이어서, 정용여과된 생성물을 1.2/0.22㎛ 심층 필터 캡슐로 추가로 정화시켜 임 의의 침전된 물질을 제거하였다. (b) 친화성 크로마토그래피 정용여과된 생성물을 AAVhu68 혈청형을 효율적으로 포획하는 Poros™ 포획-Select™ AAV 친화성 수지(라이프 테 크놀로지스)에 적용하였다. 이러한 이온 조건하에, 상당한 백분율의 잔류 세포 DNA 및 단백질을 칼럼을 통해 흘 리고, AAV 입자를 효율적으로 포획하였다. 적용 후, 칼럼을 5 부피의 저염 엔도뉴클레이스 용액(250 U/㎖ 엔도 뉴클레이스, 20mM Tris(pH 7.5), 40mM NaCl 및 1.5mM MgCl2)으로 처리하여 임의의 남아 있는 숙주 세포 및 플라 스미드 핵산을 제거하였다. 칼럼을 세척하여 추가적인 공급 불순물을 제거한 후, 낮은 pH 단계 용리(400mM NaCl, 20mM 소듐 시트레이트(pH 2.5))를 수행하여 중화 완충액(200mM Bis-Tris 프로페인(pH 10.2))의 1/10 부 피로 수집하여 즉시 중화하였다. (c) 음이온 교환 크로마토그래피 빈 AAV 입자를 포함한 공정 중 불순물의 추가의 감소를 달성하기 위해, Poros-AAV 용리 풀(pool)을 50-배(20mM Bis-Tris 프로판, 0.001% Pluronic F-68(pH 10.2)) 희석하여 이온 강도를 줄이고, CIMultus™ QA 모노리스 매 트릭스(비아 세퍼레이션스(BIA Separations))에 결합시켰다. 저염 세척 후, 벡터 생성물을 60 칼럼 부피 NaCl 선형 염 구배(10mM 내지 180mM NaCl)를 사용하여 용리하였다. 이러한 얕은 염 구배는 벡터 게놈이 없는 캡시드 입자(빈 입자)와 벡터 게놈을 포함하는 입자(전체 입자)를 효과적으로 분리하고, 전체 입자에 대해 농축된 제조 물을 생성한다. 전체 입자 피크 용리액을 수집하고 중화시켰다. 피크 면적을 평가하고, 대략적인 벡터 수율을 결정하기 위해 이전의 데이터와 비교하였다. (d) 중공 섬유 접선 유동 여과에 의한 농축 및 완충액 교환 풀링된 음이온 교환 중간체를 TFF를 사용하여 농축하고 완충액을 교환하였다. 이 단계에서, 100kDa의 막 중공 섬유 TFF 막을 사용하였다. 이 단계 동안, 생성물은 목표 농도가 된 다음 ITFFB(0.001% Pluronic F-68이 포함된 인공 CSF)로 완충액이 교환된다. 테스트를 위해 샘플을 제거하였다(도 7). 벌크 원료의약품(BDS)을 멸균 여과하고(0.22㎛), 멸균 용기에 보관하 고, 최종 충전을 위해 출하될 때까지 검역소에서 -60℃ 이하에서 냉동시켰다. 냉동된 벌크 원료의약품을 해동하고, 풀링하고 최종 제형 완충액(FFB)을 사용하여 목표 농도(TFF를 통한 희석 또는 농축 단계)로 조정하였다. 제품을 0.22㎛ 필터를 통해 최종 여과하고, 크림프 밀봉 마개가 있는 멸균 웨스 트 파마슈티컬의(West Pharmaceutical) 크리스탈 제니스(고리형 올레핀 중합체) 바이알에 채웠다. 라벨이 붙은 바이알을 -60℃ 이하에서 보관하였다. 시스, 트랜스 및 헬퍼 플라스미드의 세균 마스터 세포 은행(bacterial master cell bank: BMCB) 글리세롤 스톡 을 형질전환된 Stbl2™ 대장균 세포의 1ℓ의 하룻밤 동안의 배양물로부터의 1㎖을 동일한 부피의 멸균 50% 글리 세롤과 혼합하여 만들었다. 작제물당 BMCB 글리세롤 스톡의 2개의 0.5㎖ 분취량을 혼합물로부터 준비하고, -80 ℃에서 날젠(Nalgene) 극저온 바이알에 보관하였다. BMCB 글리세롤 스톡을 확인하기 위해, 증폭된 플라스미드 DNA를 제한 효소 분해 후 겔 전기영동을 포함하는 사내 구조 분석 및 퀴아젠(Qiagen)에서 Sanger 시퀀싱에 의한 전체-플라스미드 서열 분석을 수행하였다. 플라스미드 DNA 제조업체로 배송하기 위한 세균 제조용 세포 은행 (BWCB) 글리세롤 스톡 분취량을 준비하기 위해, 3㎖의 배양물을 BMCB 글리세롤 스톡으로부터 접종하고 밤새 성 장시켰다. 다음으로, 하룻밤 동안의 1㎖의 배양물을 사용하여 위에 기재된 바와 같이 BWCB 글리세롤 스톡 분취 량을 준비하였다. 새로운 BWCB 글리세롤 스톡 분취량을 나머지 2㎖의 하룻밤 동안의 세균 배양물로부터 추출된 DNA에 대한 전술한 구조 분석에 의해 확인하였다. 플라스미드 DNA 제조업체로부터 받은 BWCB 글리세롤 스톡은 -80℃에서 프로젝트별 위치에 보관하였다. 냉동된 BWCB 글리세롤 스톡을 긁어서 생산 배양물을 접종하였다. 우수 의약품 제조 관리 기준(GMP) 벡터 제조를 위한 원료 물질로서 사용되는 플라스미드는 GMP 시설로서 자격이 없는 시설에서 생산하였지만; 플라스미드는 현재 우수 의약품 제조 관리 기준(cGMP) 중간체에 대한 요구 사항을 충족하도록 설계된 방식으로 생산하였다. 플라스미드 생산은 전용 성분 및 전용 제품군에서 수행하였다. 생산 절차 및 감독은 다음 표에 포착된 엄격한 출하 기준을 충족하는 고순도 DNA로 일관된 품질의 제품을 보장하기 위해 수행하였다. 플라스미드의 생산에 사용된 성분은 \"동물 성분이 없는(animal-free)\"(구성 제품에 대한 각 공급업체로부터의 COA 기준) 것이며, 공정에 사용되는 모든 구성요소(발효 플라스크, 용기, 막, 수지, 칼럼, 튜 브 및 플라스미드와 접촉하는 임의의 구성요소)는 단일 플라스미드 전용이며 TSE/BSEfree 인증을 받았다. PolyFlo® 수지, 칼럼 및 구성요소는 단일 플라스미드 제조 전용으로 조달하였다. 플라스미드의 발효, 용해 및 정제는 플라스미드명이 표시된 전용실에서 발생한다. 다른 플라스미드는 해당 방에서 동시에 처리하지 않았다. 방과 장비는 각각의 플라스미드 생산 캠페인 사이에 청소하였다. 재조합 벡터의 생산에 사용하기 전에, 제조된 각 플라스미드를 차세대 시퀀싱(NGS)을 사용하여 완전시 시퀀싱하여 다른 플라스미드에 의한 오염을 배제하고, 멸균성 및 마이코플라스마의 존재 여부에 대해 테스트하였다. 약리학/독성학을 위한 벡터의 생산에 사용된 모든 플라스미드 DNA는 퓨어신(Puresyn)의 Premium-Research Ready 프로그램을 통해 만들었다. 퓨어신의 Premium-Research Ready 프로그램은 세정과 분리 절차 및 일회용 구성요소 를 사용하여 생산되지만 전용실에서 생산되지는 않는다. HEK293 세포는 원래 전단된 아데노바이러스 유형 5(Ad5) DNA로 HEK 세포를 형질전환함으로써 생성되었다(문헌 [Graham et al., 1977]). 세포는 rAAV 생산에 필요한 E1A 및 E1B 유전자 산물을 발현한다. HEK293 세포는 고도 로 형질감염되어, 플라스미드 DNA 형질감염시 높은 수준의 rAAV를 생성한다. 벡터 게놈 동일성: DNA 시퀀싱 AAV 벡터(2.00×1011 GC)를 Baseline Zero 엔도뉴클레이스 및 플라스미드 Safe DNAse로 처리하여 환경에서 캡슐 화되지 않은 DNA를 제거한 다음 1× 포스페이트-완충 식염수(PBS) 및 0.5% 소듐 도데실 설페이트(SDS)에서 95℃ 에서 10분 동안 인큐베이션하여 벡터 게놈을 변성시켰다. 그 뒤에 변성된 벡터 게놈을 열순환기에서 0.6℃/분의 속도로 24℃로 천천히 냉각시켜 어닐링하고, QIAquick PCR 정제 키트(퀴아젠)를 사용하여 정화(cleaned up)하고, Covaris 초음파분쇄기에서 평균 크기 500bp로 전단하였다. DNA 전단은 High Sensitivity DNA reagent 키트(애질런트(Agilent))가 포함된 2100 Bioanalyzer에서 평가하였다. 전단된 DNA는 제조업체의 프로토콜에 따 라 NEBNextUltraII 라이브러리 키트를 사용하여 NGS 라이브러리로 준비하고, 크기를 선택하고, Agencourt AMPure XP 비드(벡크만 쿨터(Beckman Coulter))로 정화하였다. 이어서, 개별 NGS 라이브러리를 다시 Bioanalyzer에서 단편 크기 분포에 대해 분석하고, 동일한 몰 농도에서 풀링하기 전에 Qubit® 3.0 형광측정계 로 정량화하였다. Illumina의 Miseq 시스템 변성 및 희석 라이브러리 지침에 따라 최종 풀링된 라이브러리의 농 도를 Qubit® 3.0 형광측정계로 측정하고, 변성시키고, 8pM으로 희석하였다. PhiX 대조군은 최종 라이브러리에 서 10%로 급등하였다(스파이킹된). MiSeq 시퀀서에서 Illumina MiSeq Nano Reagent 키트 V2(250bp 쌍-말단)를 사용하여 시퀀싱을 수행하였다. NGS 정렬 접근법을 사용하여 위에 기재된 바와 같이 데이터 분석을 수행하였다. 시퀀싱 판독값은 MiSeq 컴퓨터에 의해 자동으로 역-다중화되고 어댑터-트리밍되었다. 각 플라스미드에 대한 트 리밍된 판독값을 상응하는 참조 서열에 대해 정렬하고, 서열 변이체를 BBTools 생물정보학 소프트웨어 제품군 (sourceforge.net/projects/bbmap)을 사용하여 불러들였다. 추가적으로, BBMap(jgi.doe.gov/data-and- tools/bbtools/)을 사용하여 VCF 및 BAM 파일을 생성하였다. VCF 파일을 사용자 정의 UNIX 스크립트에 의해 추 가로 구문 분석하여 단순화된 탭으로 구분된 표를 생성하였다(CHROM, REF, ALT, QUAL, TYPE, DEPTH, AF, RAF, SB, DP4 필드만 유지). BAM 파일은 적절한 NGS 정렬을 보장하기 위해 IGV Integrated Genomic Viewer 소프트웨 어(software.broadinstitute.org/software/igv/)에서 시각적으로 검사하였다. NGS 정렬 접근법과 병행하여, NOVOPlasty(github.com/ndierckx/NOVOPlasty)를 사용하여 길고 원형화된 서열을 구축하기 위해 데노보(de novo) 조립을 수행하였다. 정렬 접근법에서 간과될 수 있는 대규모 서열 배열을 특성화하기 위해 데노보 서열을 원래의 벡터 게놈 참조 서열에 대해 정렬하였다.벡터 캡시드 동일성: VP1의 AAV 캡시드 질량 분석법 AAV 캡시드 단백질의 펩타이드 분석을 기반으로 펜실베니아 대학 및 바이오프록시미티 엘엘씨(Bioproximity, LLC)에서 개발된 새로운 검정을 사용하여 DP의 AAVhu68 혈청형의 확인을 달성하였다. 방법은 vp의 트립신 분해 에 이어 Q-Exactive Orbitrap 질량 분석기에서 탠덤 질량 분석법(MS)을 특성화하여 캡시드 단백질 펩타이드를 시퀀싱하는 것을 포함한다. 탠덤 질량 스펙트럼 시퀀싱 및 표적화된 MS 방법으로부터의 스펙트럼 라이브러리를 사용하여 특정 AAV 바이러스 입자 혈청형을 고유하게 식별할 수 있는 시그니처 펩타이드에 대해 검정하였다. 8 개의 혈청형(AAVhu68, AAV1, AAV2, AAV6, AAV8, AAV9, AAVrh10 및 AAVhu37)에 특이적인 시그니처 펩타이드의 은행을 테스트 물품의 분해에 의해 생성된 탠덤 질량 스펙트럼에 대해 스크리닝하였다. 양성 식별을 위해, 단일 혈청형으로부터의 시그니처 펩타이드(들)만이 검출되하였다. 게놈 카피 역가 AAV 벡터에 대한 GC 역가를 결정하기 위한 ddPCR-기반 기법이 개발되었다(문헌[Lock et al., 2014]). 참조 표준 은 파일럿 실행 중에 생성하였고, 검정의 적격성을 평가하는데 사용하였다. 방법은 실용적이고, qPCR과 동등하 거나 또는 더 나은 역가를 보고하며, 플라스미드 표준 곡선을 필요로 하지 않는다. 사용된 검정은 DNase I을 이 용한 분해 후, 캡슐화된 벡터 GC를 측정하기 위한 ddPCR 분석을 포함한다. DNA 검출은 이러한 동일한 영역에 혼 성화하는 형광 태그된 프로브와 함께 폴리A 영역을 표적으로 하는 서열-특이적 프라이머를 사용하여 달성하였다. 다수의 표준, 검증 샘플 및 대조군(배경 및 DNA 오염용)을 검정에 도입하였다. 이 검정은 파일럿 참조 표준을 사용하여 검증하였다. 검정은 민감도, 검출 한계(limit of detection: LOD), 적격성 범위, 및 검정 내 및 검정간 정밀도를 포함하는 검정 매개변수를 확립하고 정의함으로써 검증하였다. 내부 AAVhu68 참조 로트 를 확립하고 사용하여 자격 연구를 수행하였다. 감염 단위 역가 감염 단위(infectious unit: IU) 검정을 사용하여 RC32 세포(rep2 발현 HeLa 세포)에서 rAAV 벡터의 생산적 흡 수 및 복제를 결정하였다. 이전에 공개된 것과 유사하게 96-웰 종점 형식을 사용하였다. 간략하게는, RC32 세포 를 rAAV BDS의 연속 희석물 및 rAAV의 각 희석물의 12개의 복제물이 포함된 Ad5의 균일한 희석물로 동시 감염시 켰다. 감염 72시간 후, 세포를 용해시키고, qPCR을 수행하여 투입량(input)에 대한 rAAV 벡터 증폭을 검출하였 다. 종점 희석 50% 조직 배양 감염량(tissue culture infectious dose: TCID50) 계산(Spearman-Karber)을 수행 하여 IU/㎖ 단위로 표시되는 복제 역가를 결정하였다. \"감염력\" 값은 각 입자의 세포와의 접촉, 수용체 결합, 내재화, 핵으로의 수송 및 게놈 복제에 따라 달라지므로, 사용된 세포주에서 검정 기하학 및 적절한 수용체 및 결합 후 경로의 존재에 의해 영향을 받는다. 수용체 및 결합 후 경로는 불멸화된 세포주에서 유지되지 않으므로, 감염력 검정 역가는 존재하는 \"감염성\" 입자의 수의 절대적인 척도가 아니다. 그러나, 캡슐화된 (encapsidated) GC 대 \"감염 단위\"의 비(GC/IU 비로 기재됨)는 로트간 제품 일관성의 척도로서 사용될 수 있다. 입자 함량 분석 분석용 초원심분리기(analytical ultracentrifuge: AUC)에서 측정된 침강 속도는 응집체, 기타 미량 성분을 검 출할 수 있을 뿐만 아니라 다양한 침강 계수를 기반으로 하는 다양한 입자 종의 상대적인 양에 대한 우수한 정 량을 제공한다. 이는 길이와 시간의 기본 단위를 기반으로 하는 절대적 방법으로, 참조로서 표준 분자가 필요하 지 않다. 벡터 샘플을 광학 경로 길이가 12mM인 2-채널 차콜-에폰 센터피스(two-channel charcoal-epon centerpiece)의 셀에 로딩하였다. 제공된 희석 완충액을 각 셀의 참조 채널에 로딩하였다. 그런 다음, 로딩된 세포를 AN-60Ti 분석 로터에 넣고, 흡광도 및 RI 검출기가 장착된 벡크만-쿨터 프로테옴랩(Beckman-Coulter ProteomeLab)의 XL-I 분석 초원심분리기에 로딩하였다. 20℃에서 완전한 온도 평형 후, 로터를 분당 12,000 회 전(RPM)의 최종 실행 속도에 이르게 하였다. 280㎚ 스캔에서의 흡광도를 대략 5.5시간 동안 대략 3분마다 기록 하였다(각 샘플에 대해 총 110회 스캔). 미가공 데이터를 c(들) 방법을 사용하여 분석하고, 분석 프로그램 SEDFIT에서 구현하였다. 그 결과 생성된 크기 분포가 그래프로 표시되고, 피크가 통합되었다. 각 피크와 관련된 백분율 값은 모든 피크 아래 전체 면적의 피크 면적 비율을 나타내며, 280㎚에서 생성된 미가공 데이터를 기반 으로 한다. 많은 실험실에서 이들 값을 사용하여 전체:빈 비를 계산한다. 그러나, 빈 입자 및 전체 입자가 이 파장에서 상이한 흡광 계수를 가지므로, 미가공 데이터는 그에 따라 조정될 수 있다. 흡광 계수 조정 전후의 빈 입자와 전체 단량체 피크 값의 비를 사용하여 전체:빈 비를 결정하고, 두 비를 모두 기록하였다. 숙주 세포 DNA qPCR 검정을 사용하여 잔류 HEK293 DNA를 검출하였다. \"비-관련 DNA\"로 스파이킹한 후, 대략 1㎖의 생성물로부 터 총 DNA(비-관련, 벡터 및 잔류 게놈 DNA)를 추출하였다. HCDNA를 qPCR 표적화 18S rDNA를 사용하여 정량화하 였다. 검출된 DNA의 양을 스파이킹된 비-관련 DNA의 회수를 기반으로 정규화하였다. 3개의 상이한 앰플리콘 크 기를 테스트하여 잔류 HCDNA의 크기 스펙트럼을 확립하였다. 숙주 세포 단백질 ELISA를 수행하여 오염된 숙주 HEK293 세포 단백질의 수준을 측정하였다. 공급업체에서 제공한 지침에 따라 사 이그누스 테크놀로지스(Cygnus Technologies)의 HEK293 숙주 세포 단백질 2세대 ELISA 키트를 사용하였다. 복제-가능 AAV 검정 생산 과정에서 잠재적으로 발생할 수 있는 복제-가능 AAV2/hu68(rcAAV)의 존재에 대해 샘플을 분석하였다. 세포 -기반 증폭에 이어 실시간 qPCR(caphu68 표적)에 의한 rcAAV DNA의 검출로 구성되는 3-계대 검정을 개발하였다. 세포-기반 구성요소는 HEK293 세포(P1)의 단일층을 테스트 샘플 및 야생형 인간 Ad5의 희석물과 접종하는 것으 로 구성된다. 테스트된 생성물의 최대량은 벡터 생성물의 1.00×1010 GC이다. 아데노바이러스의 존재로 인해, rcAAV는 세포 배양에서 증폭된다. 2일 후, 세포 용해물을 생성하고, Ad5를 열-불활성화시켰다. 이어서, 정화된 용해물을 제2차 세포(P2) 상에 옮겨 민감도를 향상시켰다(다시 Ad5가 존재하는 경우). 2일 후, 세포 용해물을 생성하고, Ad5를 열-불활성화시켰다. 이어서, 정화된 용해물을 제3차 세포(P3) 상에 옮겨 민감도를 최대화시켰 다(다시 Ad5가 존재하는 경우). 2일 후, 세포를 용해시켜 DNA를 방출시킨 다음, qPCR을 수행하여 AAVhu68 cap 서열을 검출하였다. Ad5-의존적 방식의 AAVhu68 cap 서열의 증폭은 rcAAV의 존재를 나타낸다. AAV2 rep 및 AAVhu68 cap 유전자를 포함하는 AAV2/hu68 대리 양성 대조군을 사용하면 검정의 LOD를 결정할 수 있다(0.1 IU, 1 IU, 10 IU 및 100 IU). rAAV의 연속 희석물(1.00×1010 GC, 1.00×109 GC, 1.00×108 GC 및 1.00×107 GC)을 사용하여, 테스트 샘플에 존재하는 rcAAV의 대략적인 양을 정량화할 수 있다. 테스트 방법을 수행하였다. 시험관내 효능 ddPCR GC 역가를 유전자 발현과 관련시키기 위해, 시험관내 상대적 효능 생물학적 검정을 수행하였다. 간략하게 는, 세포를 96-웰 플레이트에서 평판배양하고, 37℃/5% CO2에서 밤새 인큐베이션하였다. 다음날, 세포를 연속 희석된 AAV 벡터로 감염시키고, 37℃/5% CO2에서 최대 3일 동안 인큐베이션하였다. 배양 기간이 끝나면, 세포 배양 배지를 수집하고, 비색 기질의 절단을 기반으로 ARSA 활성에 대해 검정하였다. 검정의 최적화가 진행중이 다. 총 단백질, 캡시드 단백질, 단백질 순도 및 캡시드 단백질 비 벡터 샘플을 먼저 바이신코닌산(bicinchoninic acid: BCA) 검정을 사용하여 소 혈청 알부민(BSA) 단백질 표준 곡선에 대한 총 단백질에 대해 정량화하였다. 결정은 키트에 제공된 Micro-BCA 시약과 같은 양의 샘플의 혼합에 의해 이루어졌다. 동일한 절차를 BSA 표준 희석에 적용하였다. 혼합물을 60℃에서 인큐베이션하고, 562㎚에서 흡광도를 측정하였다. 4-매개변수 맞춤을 사용하여 알려진 농도의 표준 흡광도로부터 표준 곡선을 생성하였다. 알 수 없는 샘플은 4-매개변수 회귀에 따라 정량화하였다. rAAV 순도의 반-정량적 결정을 제공하기 위해, 샘플을 게놈 역가에 대해 정규화하고, 5.00×109 GC를 환원 조건 하에 소듐 도데실 설페이트 폴리아크릴아마이드 겔 전기영동(SDS-PAGE)에 의해 분리하였다. 그런 다음, SDS- PAGE 겔을 SYPRO Ruby 염료로 염색하였다. 임의의 불순물 밴드를 농도계로 정량화하였다. 3개의 AAV-특이적 단 백질(VP1, VP2 및 VP3)에 추가로 나타나는 염색된 밴드는 단백질 불순물로 간주하였다. 불순물 질량 백분율뿐만 아니라 오염물질 밴드의 대략적인 분자량을 보고하였다. SDS-PAGE 겔을 또한 사용하여 VP1, VP2 및 VP3 단백질 을 정량화하고 이들의 비를 결정하였다. 감염 단위에 대한 게놈 카피의 비 GC/IU 비는 제품 일관성의 척도이다. ddPCR 역가(GC/㎖)를 \"감염 단위\"(IU/㎖)로 나누어 계산된 GC/IU 비를 얻 었다. 실시예 2 - 마우스에서의 개념 증명 약리학 및 용량 범위 연구 마우스에 ICV 주사 후 AAVhu68.hARSAco 벡터의 효능을 확립하기 위해 실험을 수행하였다. 건강한 6주령 내지 8 주령 C57BL6/J 마우스를 이 개념 증명(POC) 실험을 위해 선택하였다. 마우스의 작은 크기로 인해 ICM을 통해 AAV 벡터를 안정적으로 주사하기 어렵기 때문에 ICV 경로를 선택하였다. 연령은 과거 데이터 및 이 연령의 마우스에 ICV 주사를 수행한 이전의 경험을 기반으로 선택되었다(문헌[Hinderer et al., 2016]). 21일 부검 시점은 마우스에서 다른 ICV-투여된 AAV 벡터에 대한 이전의 경험을 기반으로 안정적인 이식유전자 발현을 포착하기 위 해 선택되었다(문헌[Hinderer et al., 2016]). C57BL6/J 야생형 마우스에 AAVhu68.CB7.CI.hARSAco.rBG 벡터를 1.00×1010 GC의 저용량 또는 1.00×1011 GC의 고용량으로 우뇌실에 단일 ICV 주사를 통해 CSF에 투여하였다. 용량은 다른 LSD 마우스 모델에서 ICV-투여된 AAV 벡터의 이전의 용량 범위 연구를 기반으로 선택되었다(문헌[Hinderer et al., 2016]). 대조군으로서, 연령 이 일치하는 C57BL6/J 마우스에 비히클(PBS)을 우뇌실에 단일 ICV 주사로 주사하여 기준선 ARSA 활성 수준을 얻 었다. 투여 21일 후에, 마우스를 부검하고, 인공 기질인 4-나이트로카테콜 설페이트의 절단을 기반으로 한 비색 검정을 사용하여 뇌, 간 및 혈청 샘플로부터의 투석된 단백질 추출물에서 ARSA 활성 수준을 정량화하였다. 뇌는 MLD의 치료를 위한 핵심 표적 조직이기 때문에, ARSA 활성 수준은 AAVhu68.CB7.CI.hARSAco.rBG 벡터 투여 21일 후에 왼쪽 대 오른쪽 대뇌반구에서 측정하였다. ARSA 활성은 PBS 처리된 대조군과 비교하여 AAVhu68.CB7.CI.hARSAco.rBG 벡터의 저용량(1.00×1010 GC) 또는 고용량(1.00×1011 GC)을 투여한 마우스의 뇌에 서 각각 12% 및 31% 더 높았다. 더욱이, AAVhu68.CB7.CI.hARSAco.rBG-처리된 동물에 대해 우반구와 좌반구 사 이의 ARSA 활성 수준의 명백한 차이는 관찰되지 않았다(도 8). 이러한 결과는 AAVhu68.CB7.CI.hARSAco.rBG 벡 터의 단일 일방적 ICV 주사를 통한 CSF로의 전달이 두 대뇌반구의 세포를 형질도입하고/하거나 CSF로 방출된 순 환하는 ARSA 효소를 통한 교차-교정을 촉진하기에 충분하였음을 시사한다. AAV.CB7.CI.HARSACO.RBG의 두 용량은 야생형 마우스에 ICV 투여 후 뇌에서 효소적으로 활성인 ARSA 효소의 과발현을 초래한다. 신경계 외부 조직에서 기능적 ARSA 효소 활성을 정량화하기 위해, AAVhu68.CB7.CI.hARSAco.rBG 벡터 투여 21일 후에 혈청 및 간 샘플을 얻었다. PBS-처리된 대조군의 기준선 수준과 비교하여, 혈청에서 ARSA 활성 수준은 저 용량(1.00×1010 GC) 또는 고용량(1.00×1011 GC)의 AAVhu68.CB7.CI.hARSAco.rBG 벡터를 투여한 마우스에서 각각 30% 및 151% 더 높았다(도 9a). 간에서, ARSA 활성 수준은 저용량(1.00×1010 GC) 또는 고용량(1.00×1011 GC)의 AAVhu68.CB7.CI.hARSAco.rBG 벡터를 투여한 마우스에서 각각 11-배 및 28-배 더 높았다(도 9b). 이러한 결과는 뇌 이외에도, CSF-전달된 AAVhu68.CB7.CI.hARSAco.rBG 벡터가 특히 간에서 말초 기관 시스템의 형질도입 및/또 는 교차-교정된 세포를 가질 수 있음을 시사한다. 효소적으로 활성인 ARSA의 과발현은 또한 AAV.CB7.CI.hARSAco.rBG의 두 용량 모두에서 간 및 혈청에서도 검출된다."}
{"patent_id": "10-2021-7039381", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 14, "content": "요약하면, 이 실험은 마우스에서 AAVhu68.CB7.CI.hARSAco.rBG 벡터의 단일 일방적 ICV 주사가 21일 이내에 뇌의 양쪽 반구에서 효소적으로 활성인 ARSA 효소의 용량-의존적 발현을 초래함을 확인시켜 주었다. 기능성 ARSA 효 소는 또한 혈청 및 간에 존재하며, 이는 AAVhu68.CB7.CI.hARSAco.rBG 벡터가 말초 기관시스템에서 형질도입되었 음을 시사한다. 그러나, 본 발명자들이 ARSA 활성을 야생형 기준선 수준 이상의 과발현으로 측정하였기 때문에, 이러한 과발현은 이 결과를 잠재적으로 효과적인 치료적 용량으로 번역하는 것을 방해하였다. 따라서, 용량 범 위를 확인하기 위해 Arsa-/- 마우스에서 MED 연구를 수행하였다(실시예 4). 실시예 3 - 마우스에서 세포 지향성(tropism) 연구 ARSA 효소의 CNS 발현 프로파일을 야생형 마우스에서 벡터의 ICV 투여 후 평가하였다. AAVhu68은 주로 뉴런을 형질도입하는 것으로 나타났으며, 수초-생성 희소돌기아교세포에 국재화되는지 여부를 결정하기 위해 실험을 수 행하였다. ARSA의 희소돌기아교세포-특이적 발현은 MLD 환자에서 영향을 받는 주요 세포 유형의 교차-교정 가능 성을 지원한다. 이 연구를 위해, C-말단 HA 펩타이드로 태그된 인간의 조작된 ARSA 효소를 암호화하는 AAVhu68.CB7.CI.hARSAco.rBG와 유사한 AAVhu68 벡터인 AAVhu68.CB7.CI.hARSAcoHA.rBG를 사용하였다. 이론적으 로 항-ARSA 항체는 야생형 동물에서 내인성 뮤린 ARSA과 교차 반응할 수 있기 때문에, 항-헤마글루티닌(HA) 항 체를 사용하여 ICV 투여 후 ARSA 발현을 평가하였다. 이 유사한 AAVhu68 벡터의 투여 후 관찰된 ARSA 발현 프로 파일은 AAVhu68.CB7.CI.hARSAco.rBG 투여 후 ARSA 발현을 나타낼 것으로 예상된다. 성체 C57BL6/J 야생형 마우스(6주령 내지 8주령)에 AAVhu68.CB7.CI.hARSAcoHA.rBG를 1.00×1010 GC의 저용량 또 는 1.00×1011 GC의 고용량으로 CSF에 ICV-투여하였다. 벡터 투여 21일 후, 마우스를 부검하고, 희소돌기아교세 포에서 ARSA의 발현을 평가하기 위해(희소돌기아교세포 전사 인자 2(OLIG2)의 발현에 의해 확인됨) 피질 및 피 질하 백질을 포함한 뇌 샘플을 얻었다. 벡터 용량, 마우스 계통, 연령 및 부검 시점은 실시예 2를 반영하도록 선택하였으며, 이들 영역은 ICV 투여 후에 일관되게 형질도입되고 MLD를 치료하기 위한 표적에 대한 주요 조직이기 때문에 피질 및 피질하 백질을 조사하였다. 저용량(1.00×1010 GC)을 투여한 결과 피질 및 피질하 백질에서 최소한의 수의 ARSA 발현 세포가 생성되었다. 대 조적으로, 고용량(1.00×1011 GC)을 투여한 동물은 피질 및 피질하 백질에서 더 많은 수의 ARSA를 발현하는 세포 를 나타내었다. 더욱이, ARSA-발현 희소돌기아교세포의 농축이 많은 수의 ARSA-양성 OLIG2-음성 세포(추정상의 뉴런)를 포함하는 뇌 영역에서 관찰되었다(도 10). 희소돌기아교세포는 전형적으로 AAVhu68에 의해 최소한으로 형질도입되기 때문에, ARSA 발현의 이러한 세포 분포 패턴은 이웃 뉴런에 의한 희소돌기아교세포의 교차-교정이 발생하였음을 시시한다. 이들 데이터는 AAVhu68.CB7.CI.hARSAco.rBG가 MLD 환자에서 영향을 받는 CNS 및 PNS의 뉴런 및 수초화 세포 모두에 ARSA 효소 분비의 오래 지속되는 공급원을 제공할 수 있다는 가능성을 뒷받침한다."}
{"patent_id": "10-2021-7039381", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 15, "content": "요약하면, 이 실험은 야생형 마우스에서 AAVhu68.CB7.CI.hARSAco.rBG와 유사한 벡터의 ICV 투여 후 21일까지, ARSA 효소가 MLD의 치료를 위한 핵심 표적 세포 유형인 뇌의 뉴런 및 희소돌기아교세포 모두에 성공적으로 전달 되었음을 입증하였다. HA-태그된 ARSA를 발현하는 형질도입된 세포는 일방적 ICV 투여 후 뇌의 양측에서 관찰되 었다. 두 주요 표적 세포인 뉴런 및 희소돌기아교세포는 모두 ARSA를 발현하였다. 실시예 4 - 사이노몰구스 마카크에서 파일럿 용량 범위 연구. 이 연구는 AAVhu68.CB7.CI.hARSAco.rBG 벡터의 ICM 투여 후 비-인간 영장류(NHP)에서 기준선 수준 이상으로 CSF의 ARSA 활성 수준을 증가시키는데 필요한 용량 범위를 결정하기 위한 파일럿 연구였다. 생체외 렌티바이러 스 HSC-GT의 1/2상 시험으로부터의 결과는 CSF에서 정상 수준의 ARSA 활성의 달성이 조기 발병 MLD 환자에 대한 좋은 결과와 상관관계가 있음을 보여주었다(문헌[Sessa et al., 2016]). HSC-GT는 ARSA를 분비하는 CNS-상주 세포로부터의 교차-교정에 의존한다는 점에서 이 실시예에 기재된 치료적 접근법과 유사하기 때문에, NHP에서 ARSA의 CSF 수준이 AAVhu68.CB7.CI.hARSAco.rBG 벡터의 잠재적인 효능을 예측할 것이라고 추론되었다. AAVhu68.CB7.CI.hARSAco.rBG 벡터를 성체 사이노몰구스 마카크에 3.00×1012 GC(저용량), 1.00×1013 GC(중간 용 량) 또는 3.00×1013 GC(고용량)의 용량으로 ICM으로 투여하였다. AAVhu68.CB7.CI.hARSAco.rBG 투여 후 42일 동 안 CSF 및 혈청을 수집하여(CSF 수집을 위한 30일 제외) ARSA 활성 수준의 역학 및 억제성 항-ARSA 항체의 존재 를 평가하였다. AAVhu68.CB7.CI.hARSAco.rBG의 용량은 NHP에서 분비 가능한 단백질을 발현하는 ICM-투여된 벡터 에 대한 이전의 경험을 기반으로 선택되었다(문헌[Hordeaux et al., 2018]). AAVhu68.CB7.CI.hARSAco.rBG 처리 후 42일 동안 샘플 수집 시점은 이식유전자 발현이 IT AAV 투여 후 14일까지 검출될 수 있다는 이전의 경험에 기초하여 ARSA 활성 수준에 대한 안정적인 안정기(plateau)를 포착할 것으로 예상되었다(문헌[Hinderer et al., 2014; Hinderer et al., 2018]). AAVhu68.CB7.CI.hARSAco.rBG의 중간-용량(1.00×1013 GC) 또는 고용량(3.00×1013 GC)의 투여는 기준선 수준 이 상으로 CSF ARSA 활성을 증가시켰다. ARSA 활성은 처리 후 7일 내지 14일에 최고조에 달했으며, 후속적으로 처 리 후 35일 내지 42일에 기준선 수준으로 회복되었다. 최고점에서, ARSA 활성은 중간-용량 또는 고용량을 투여 받은 각각의 NHP에 대해 기준선의 적어도 두 배였으며, 이는 AAVhu68.CB7.CI.hARSAco.rBG가 ARSA-결핍 MLD 환 자에게 투여될 때 정상 ARSA 수준을 회복할 수 있음을 시사한다. 대조적으로, 저용량(3.00×1012 GC)의 AAVhu68.CB7.CI.hARSAco.rBG는 ARSA 활성 수준을 증가시키는데 효과가 없었다(도 11). AAVhu68.CB7.CI.hARSAco.rBG 투여 후 14일 후 ARSA 활성 수준의 관찰된 감소는 억제성 항-hARSA 항체의 생성으 로 인한 것일 수 있다. 분석은 CSF에서, 항-hARSA 항체의 증가가 처리 후 3주까지 일부 동물에서 관찰되었음을 보여주었다. 42일까지, 모든 동물은 상승된 항-hARSA 항체를 나타내었고, 더 높은 항체 수준은 더 높은 용량의 AAVhu68.CB7.CI.hARSAco.rBG와 상관관계가 있는 것으로 나타났다(도 12a). 혈청에서는, AAVhu68.CB7.CI.hARSAco.rBG 투여 후 21일 내지 28일까지 일부 동물에서 순환하는 항-hARSA 항체의 증가가 명 백하였다. 42일까지, 대부분의 동물이 상승된 항-hARSA 항체를 나타내었지만, CSF와는 달리 혈청 수준은 AAVhu68.CB7.CI.hARSAco.rBG의 용량과 상관관계가 있는 것으로 보이지 않았다(도 12b). 이러한 결과는 AAVhu68.CB7.CI.hARSAco.rBG 투여 후 14일에 관찰된 ARSA 활성의 감소가 CSF- 및 혈청-순환 항-hARSA 항체의 유도로 인한 것이었음을 시사한다. AAVhu68.CB7.CI.hARSAco.rBG 이식유전자 생성물에 대한 체액성 반응(즉, 항hARSA 항체의 생성) 외에도, 세포독 성 T세포 반응을 통한 형질도입된 세포의 제거가 CSF에서 ARSA 활성의 손실에 기여했을 수도 있다. 이러한 가능 성을 해결하기 위해, ARSA 발현의 포괄적인 평가를 위해 처리 42일 후에 부검된 NHP로부터 CNS, PNS 및 말초 조직을 수확하였다. 고용량의 AAVhu68.CB7.CI.hARSAco.rBG(3.00×1013 GC)를 투여한 NHP에서, 인간 ARSA 효소를 발현하는 형질도입 된 세포는 피질(도 13e, 도 13f, 도 13g, 도 13i 및 도 13j), 해마(도 13h), 시상(도 13k) 및 소뇌(도 13l)를 포함한 뇌 전체에서 검출되었다. 경추(도 14g), 흉부(도 14h) 및 요추(도 14i) DRG와 함께 경추(도 14d), 흉부 (도 14e) 및 요추(도 14f) 척수의 세포도 또한 인간 ARSA 효소를 발현하였다. 이러한 발견은 이식유전자 생성물 에 대한 체액성 면역 반응에도 불구하고, 형질도입된 세포가 AAVhu68.CB7.CI.hARSAco.rBG 투여 후 적어도 42일 동안 표적 조직 내에서 여전히 지속되어 뉴런 및 수초-생성 세포를 교정하는데 필요할 수 있는 ARSA를 생성함을 시사한다. 이들 데이터는 AAVhu68.CB7.CI.hARSAco.rBG가 MLD 환자의 CNS 및 PNS 모두에 치료적 수준의 ARSA를 제공할 수 있다는 가능성을 뒷받침한다. AAVhu68.CB7.CI.hARSAco.rBG(3.00×1013 GC)의 고용량에서 최소에서 중등도의 등 감각 축삭병증이 성공적인 ICM 유전자 전달 후 일반적으로 관찰되는 것과 일치하는 것으로 관찰되었다. 연구 동안 동물에서 말초 신경병증의 임상적 징후는 관찰되지 않았다. AAVhu68.CB7.CI.hARSAco.rBG의 저용량(3.00×1012 GC) 또는 중간-용량(1.00× 1013 GC)을 투여한 NHP에 대한 조직병리 슬라이드를 생성하고, 분석을 수행하였다. 누적적으로, 이 연구는 AAVhu68.CB7.CI.hARSAco.rBG의 ICM 투여 후 14일까지, NHP의 CSF에서 총 ARSA 활성 수 준이 2배 이상 증가함을 보여주었다. CSF ARSA 활성 수준은 인간 ARSA 이식유전자에 대한 항체의 생성으로 인해 이후 28일 동안 대략 기준선 수준으로 복귀하였다. 그러나, 뇌 및 척수 전반에 걸쳐 형질도입된 세포는 PNS(예 를 들어, DRG 및 운동 뉴런)로 돌출된 세포를 포함하여 42일의 연구 기간 동안 여전히 지속되었다. 임상적 징후 가 없이 고용량(3.00×1013 GC)에서 축삭병증이 관찰되었으며, 이는 ICM AAV 투여 후 이전의 발견과 일치하였다. 이들 데이터는 ARSA를 MLD 환자의 CNS 및 PNS의 결함성 뉴런 및 수초-생성 세포에 전달하기 위한 AAVhu68.CB7.CI.hARSAco.rBG의 사용을 뒷받침한다. ARSA의 과발현은 CSF 및 표적 조직(CNS, PNS)의 MD 및 HD에서 달성되었다. LD는 차선책이었다. 실시예 5 - Arsa-/- 마우스 모델. MLD의 자연 발생적 동물 모델은 문헌에 보고되어 있지 않다. 독일의 볼크마르 기젤만(Volkmar Gieselmann) 그룹 에서 만든 두 개의 실험실-생성 마우스 모델이 있다(문헌[Hess et al., 1996; Ramakrishnan et al., 2007]). 연구를 위해 이러한 공개된 계통을 얻는데 어려움이 있기 때문에, 클러스터링된 규칙적으로 간격을 둔 짧은 회 문 반복부(clustered regularly interspaced short palindromic repeat: CRISPR)-관련 단백질 9(CRISPR-Cas9) 유전자 편집 기술을 사용하여 MLD 마우스 모델을 생성하였다. 세 가지 상이한 실험실-생성 마우스 모델의 비교 는 아래 표에 제공된다."}
{"patent_id": "10-2021-7039381", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 16, "content": "A. 비-탈수초성 MLD 마우스(Arsa-/-) 고전적인 MLD 마우스 모델(문헌에서 \"비-탈수초성 MLD 마우스\"로도 지칭됨)은 1.3kb 네오마이신 카세트의 Arsa 유전자의 4번 엑손으로의 삽입을 통한 상동 재조합을 통해 개발되었다. 이러한 삽입은 검출 가능한 Arsa mRNA 및 기능성 단백질이 결여된 동형접합 Arsa-/- 마우스로 유전자의 완전한 넉아웃을 초래하였다. 이들 마우스에는 MLD 환자에서 설명된 바와 유사한 CNS, PNS, 신장 및 간에서의 진행성 설파타이드 축적이 발생한다. 그러나, 축 적 및 관련 표현형은 인간 환자와 비교할 때 진행이 더 느리며, 마우스의 중간 연령(6개월 내지 12개월령) 즈음 에 나타난다. 증가된 설파타이드 수준은 생화학적 분석을 사용하여 6개월까지 검출될 수 있지만(문헌 [Ramakrishnan et al., 2007]), 상당한 조직학적 설파타이드 염색은 10개월령 내지 12개월령까지만 관찰할 수 있다(문헌[Gieselmann et al., 1998]). Arsa-/- 마우스에서 측정할 수 있는 가장 일관된 신경학적 증상은 보행 패턴의 이상(발자국 분석에 기반함) 및 감소된 운동 협응(로타로드 성능에 의해 측정됨)(문헌[Gieselmann et al., 1998; Matzner et al., 2009; Stroobants et al., 2011])이며, 이들은 일반적으로 6개월령 내지 10개월령 후에 나타난다. 인간 MLD 환자와 대조적으로, Arsa-/- 마우스의 CNS 또는 PNS에서 탈수초화는 발견되지 않으며, 이는 놀랍게도 이들 동물에 대해 관찰된 경증 표현형 및 정상적인 수명을 설명한다 B. 탈수초성(악화된) MLD 마우스(tg/Arsa-/-) 느린 설파타이드 축적은 Arsa-/- 마우스에서 관찰된 지연된 질환 발병 및 탈수초화의 결여를 설명하는 것으로 가 정되었다(문헌[Ramakrishnan et al., 2007]). 이 가설을 해결하기 위해, 탈수초화를 나타내는 유전적으로 악화 된 MLD의 마우스 (문헌에서 \"탈수초성 MLD 마우스\"로 지칭됨) 모델을 개발하였다. 이 계통은 수초-생성 세포에 서 GAL3ST1 효소를 과발현하는 이식유전자(tg)를 보유하는 마우스와 Arsa-/- 마우스를 교배하여 만들었다. GAL3ST1은 설파타이드의 생합성에 관여하며, 이중 돌연변이체 마우스(tg/Arsa-/-)는 Arsa-/- 마우스와 비교할 때 조직에 약 2배 더 많은 설파타이드를 축적한다. tg/Arsa-/- 마우스는 친알코올성 조직학적 염색에 의해 검출된 CNS 및 PNS에서의 설포지질의 증가된 축적, 손상된 신경 전도, 및 PNS 및 정도는 덜하지만 CNS에서의 감소된 수 초화(문헌[Ramakrishnan et al., 2007])를 나타내며, 이들 모두는 인간 환자의 MLD의 주요 특징이다. 그러나, 이러한 발견의 출현은 인간 환자의 질환 진행과 비교할 때 지연되었으며, 특징은 약 6개월령에서 시작되는 성체 마우스에서 나타난다. 구체적으로, 연구자들은 생화학적 검정을 사용하여 6개월령까지 설파타이드 축적을 설명 하였으며, 다른 모든 표현형은 17개월령 내지 22개월령까지 발생하였다. 설파타이드 축적 및 후속 탈수초화의 지연은 tg/Arsa-/- 마우스에서 관찰된 정상 수명의 이유일 가능성이 있으며, 이는 MLD 환자의 단축된 수명과 대 조된다. C. 신규한 MLD 마우스 모델 AAVhu68.CB7.CI.hARSAco.rBG의 약리학적 활성을 MLD의 생체내 및 시험관내 모델 모두에서 평가하였다. 생체내 모델의 경우, 신규한 Arsa-/-(+/- AAV-PH.B-GAL3ST1) 마우스 모델을 생성하였으며, 이는 공개된 생체내 모델 (Arsa-/- [단일 돌연변이] 및 tg/ Arsa-/- [이중 돌연변이])의 이용 가능성이 제한된 것으로 특징지어진다. 새로 운 마우스 모델은 MLD 환자에서 관찰된 표현형, 특히 보행 이상 및 감소된 운동 협응과 함께 중추 신경계(CNS), 말초 신경계(PNS), 신장 및 간의 세포에서의 설파타이드 축적과 유사한 표현형을 포함하여 고전적인 Arsa-/- 마 우스의 자연사에 필적하는 자연사를 나타내는 것으로 평가되고 있다. 새로운 Arsa-/- 마우스 계통을 CRISPR/Cas9 배아 미세 주입을 사용하여 생성하였다. 1105bp 내지 1133bp 길이의 2번 내지 4번 엑손이 결실된 4개체의 파운더(founder)를 생성하였다. 4개체의 파운더 모두 C57BL/6J 야생형 마 우스와 한 번 교배하였고, 결실된 대립유전자를 F1 세대에 성공적으로 전달하였다. F1 세대 보인자(carrier)를 C57BL6/J 배경으로 한 번 더 교배하여 임의의 원치 않는 표적외 편집을 추가로 약화(dilute)시켰다. 4개체의 계 통은 모두 4개체의 Arsa-/- 마우스 계통을 생성하고 특성화하기 위해 번식되는 F2 세대 보인자를 생산하였다. 최 초의 Arsa-/- 마우스가 태어났다. 이용된 유전공학 전략은 여러 가이드 RNA를 사용하여 15번 염색체에 위치한 마우스 Arsa 유전자를 표적으로 하 여 2번 엑손부터 4번 엑손까지의 표적화된 결실을 촉진한다. 고전적인 Arsa-/- 모델은 널(널) 대립유전자를 생성 하기 위해 네오마이신 카세트의 상동 재조합을 이용하는 반면, CRISPR/Cas9 유전자 편집은 이전의 유전자 표적 화 방법보다 짧은 시간에 유사한 표현형으로 완전한 넉아웃을 생성할 것으로 예상된다.공개된 Arsa-/- 마우스 모델과 달리, 탈수초화는 새로운 Arsa-/- 마우스 계통에서 관찰되지 않을 것으로 예상된다. 따라서, 설파타이드-합성 효소인 갈락토스-3-O-설포트랜스퍼레이스-1(GAL3ST1)이 과발현되어 설파타 이드 축적이 증가된 Arsa-/- 마우스의 또 다른 모델을 개발하였다. 설파타이드 축적의 증가는 고전적인 Arsa-/- 마우스 모델과 유사한 PNS의 탈수초화, 손상된 신경 전도 및 마비로 이어져야 한다. 이러한 특징은 MLD 환자에 서 관찰된다. 탈수초화가 악화된 조건하에서 관찰될 수 있는지 여부를 결정하기 위해 tg/Arsa-/- 마우스와 유사 하게 GAL3ST1을 과발현하는 마우스도 또한 생성하였다. 그러나, 이중 돌연변이체를 생성하는 대신, AAV-PHP.B 벡터를 사용하여 GAL3ST를 과발현시켰다(AAVPHP.B.CB7.GAL3ST1co.rBG [AAV-PH.B.GAL3ST1]). AAV.PHP.B 캡시드 는 C57BL6/J 마우스에서 전신(IV) 주사 후 강력한 CNS 지향성을 나타내기 때문에 선택되었다(문헌[Deverman et al., 2016; Hordeaux et al., 2019]). 이 접근법은 혼합된 유전적 배경은 종종 F2 세대에서 혼란스러운 신경행 동 이상을 초래하여 순수한 유전적 배경에서 재현할 수 없기 때문에, 유전적 배경이 다른 이중 형질전환 마우스 를 번식시키는 문제를 방지한다. 따라서, 이들 마우스는 동종 배경의 실험적 이점이 추가되어 CNS에서 높은 수 준으로 GAL3ST1을 과발현할 것으로 예상된다. 자연사 연구는 다음 표현형 기준(질환 중증도가 높은 순서대로 나열)에 따라 수행하였다: 1. CNS 및 말초 조직에서 잔류 ARSA 활성의 감소 또는 부재의 입증; 2. CNS, PNS, 신장 및 간에서 설파타이드 축적의 입증; 3. 조직병리학에 대한 탈수초화의 입증; 4. 탈수초화와 일치하는 행동 표현형의 입증. Arsa-/- 마우스 또는 AAV-PH.B.GAL3ST1-매개성 악화된 Arsa-/- 마우스 또는 둘 모두를 약리학 및 MED 연구를 위해 선택하였다. 결정은 위의 표현형 기준을 가장 많이 충족하는 것 이외에, Arsa+/- 보인자의 교배로부터 Arsa-/- 마 우스의 최상의 번식 능력과 백분율을 나타내는 마우스 계통을 기반으로 하였다. 대략 8주령의 마우스를 마우스 동물 사육장에 적응시킨지 1주일 후에 자연사 연구에 등록하였다. 계통당 최소 6 마리의 Arsa-/- 수컷(M)과 6마리의 Arsa-/- 암컷(F)을 평가하고, 야생형 한배새끼와 비교하였다. (문헌[Guyenet et al., 2010])으로부터 채택한 채점 시스템을 사용하여 운동실조의 발달에 대해 마우스를 매주 모니터링하였다. 동물의 무게를 측정하고, 운동 협응(로타로드 검정), 악력 및 감각 결손의 징후(핫 플레이트 검정)에 대해 매월 평가하였다. CatWalk™ 보행 분석 시스템을 사용하여 2개월마다 보행 분석을 완료하였다. 6 개월령에, 각 코호트의 하위집단(Arsa-/-: N=3 M, 3 F; 야생형: N=1 M, 1 F)을 부검하고, 뇌, 신장, 간, 좌골 신 경 및 척수에서 ARSA 효소 활성, 탈수초화 및 설파타이드 축적을 평가하였다. 나머지 마우스는 이들 계통의 자 연사를 완전히 특성화하고 지연-발병 탈수초화의 가능성을 모니터링하기 위해 더 오랜 기간 동안 추적하였다. 지연되거나 또는 없는 탈수초화 표현형이 관찰될 수 있다. 각 계통의 마우스의 하위집단을 설파타이드-합성 효 소 GAL3ST1을 암호화하는 AAV-PHP.B 벡터(AAV-PHP.B.CB7.GAL3ST1co.rBG)의 IV 볼루스로 처리하여 설파타이드 합성률을 증가시켰다. tg/Arsa-/- 마우스에서와 같이, GAL3ST1의 과발현은 인간에서 관찰되는 질환 진행과 더 유 사한 시간 경과에 따른 탈수초화를 나타내는 더 빠른 축적 과부하 및 악화된 질환 모델을 생성할 수 있다. 모든 마우스에 대해 자연사 연구에서 Arsa-/- 마우스와 병행하여 일반적인 건강 및 운동실조를 모니터링하기 위해 매 주 임상적 관찰을 하였다. 각 코호트로부터의 마우스의 하위집단(Arsa-/-: N=3 M, 3 F; Arsa+/+: N=1 M, 1 F)을 6 개월령에 부검하여 설파타이드 축적 및 탈수초화를 평가하였다. 실시예 6 - Arsa-/- 마우스에서 AAVhu68.CB7.CI.hARSAco.rBG의 최소 유효량(MED)의 확인 실시예 5에서 확인된 Arsa-/- 마우스 계통을 선택하여 ICV-투여된 AAV.CB7.CI.hARSAco.rBG의 MED 연구를 수행하 였다. 주사시 연령, 삶의 매개변수 및 부검시 연령은 다른 실시예에서 정의된 가장 관련성이 높은 질환 바이오 마커를 기반으로 한다. GLP NHP 독성학 연구를 위해 제조된 독성 벡터 로트를 사용하여 MED 연구를 수행하였다. 연구는 MED, 약리학 및 조직병리학(효능 및 안전성)을 결정하기 위해 네 가지 용량 수준을 평가한다. 용량 수준은 야생형 마우스 실시 예 2 및 실시예 3에서의 파일럿 용량 범위 및 인간으로 환산했을 때 가능한 최대 용량을 기준으로 선택하였다.ICV 주사의 연령은 자연사 연구 결과에 기초하여 결정하였다. 동물을 주사 후 적절한 시점에 희생시켜 약리학 및 효능 판독값을 얻고, 연령이 일치하는 대조군이 투여된 ITFFB와 비교하였다. 부검 시점은 실시예 5에 기초하 여 결정하였으며, 공개된 Arsa-/- 모델의 자연사에 기초하여 마우스가 대략 5개월령 내지 12개월령일 때 수행될 수 있다. 그러나, 부검 시점은 자연사 연구의 결과 및 측정된 종점에 기초하여 연장될 수 있다. 효능 종점은 실 시예 5로부터의 결과에 기초하여 정의되며, 운동실조 점수, 체중, 로타로드에서의 운동 협응 및 핫플레이트에서 의 감각 기능과 같은 검정을 포함할 수 있다. 만족스러운 신경행동 종점이 없는 경우, ARSA 활성 수준, 설파타 이드 축적 및 조직병리학이 MED를 정의하는데 사용되는 기준이될 수 있다. 실시예 5는 AAV-PHP.B-매개성 GAL3ST1 과발현(설파타이드 과부하)을 사용하여 신뢰할 수 있는 악화된 모델을 확 인하고, 악화된 마우스에 대한 하나의 연구 대상군(arm)을 각 용량 수준에서 수행하였다. 시차 투여시 발생할 수 있는 교차-반응성 NAb의 생성을 피하기 위해 이들 마우스에 연구 제0일에 AAV.PHP.B.GAL3ST1의 IV-투여 용량 과 AAV.CB7.CI.hARSAco.rBG의 ICV-투여 용량을 동시에 투여하였다. 연구 설계는 아래 표에 제시되어 있다:"}
{"patent_id": "10-2021-7039381", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 17, "content": "실시예 7 - 개념 증명 약리학적 연구를 위해 환자-유래 세포를 사용한 시험관내 질환 모델의 특성화. AAV.CB7.CI.hARSAco.rBG의 생체내 연구를 보완하기 위해, 시험관내 질환 모델을 사용하여 AAV-매개성 ARSA 유전 자 전달의 효능을 평가하였다. 최근, 결함이 있는 신경교 및 뉴런 분화뿐만 아니라 라이소솜 구획 확장, 설파타 이드 축적, 산화 스트레스 및 세포자멸사와 같은 MLD의 여러 특징을 개괄하는 MLD 환자-유래 iPSC-기반 모델이특성화되었다(문헌[Frati et al., 2018]). 1개의 환자-유래 세포주(RIKEN 세포 은행 참조 HPS0240)뿐만 아니라 2개의 CRISPR-Cas9 ARSA 넉아웃 iPSC 클론을 특성화하였다. 적절한 세포주를 확인하였다. AAV 벡터 투여 후 질 환 바이오마커 구제의 정도를 평가하였다. AAVhu68 캡시드는 배양에서 세포를 제대로 형질도입하지 않는 것으로 알려져 있기 때문에, 이들 연구를 위해 AAV.CB7.CI.hARSAco.rBG이거나 또는 이와 유사한 ARSA-암호화 벡터 게놈 을 전달하기 위해 상이한 AAV 혈청형을 사용할 수 있다. 신경 전구 세포 단계는 산화 스트레스 또는 문헌[Frati et al.]에 기술된 바와 같은 형태적 변화의 측면 에서 임의의 결정적 표현형을 나타내지 않았으며, 분화된 세포(뉴런 및 희소돌기아교세포)는 공개된 연구에서 더 두드러진 설파타이드 축적 표현형을 보여주었기 때문에 조사 중이다. 신뢰할 수 있는 설파타이드 축적을 통 해, AAV-매개성 ARSA 형질도입을 사용하여 표현형 구제를 테스트하였다. AAVhu68 캡시드는 배양에서 세포를 제 대로 형질도입하지 않는 것으로 알려져 있기 때문에, AAV.CB7.CI.hARSAco.rBG이거나 또는 이와 유사한 ARSA-암 호화 벡터 게놈을 전달하기 위해 상이한 혈청형의 캡시드를 사용할 수 있다. AAV.CB7.CI.hARSAco.rBG의 약리학적 활성을 뒷받침하기 위해 생체내 마우스 모델(들)(실시예 6)과 전술한 MLD의 시험관내 모델 중 하나 이상으로부터의 데이터를 사용하였다. 실시예 8 - 비인간 영장류에서의 독성학 연구. AAV.CB7.CI.hARSAco.rBG의 비-GLP 파일럿 용량 범위 연구에서 6년령 내지 8년령의 성체 사이노몰구스 마카크를 사용하였다. 어린 레서스 마카크(1년령 내지 2년령)를 AAV.CB7.CI.hARSAco.rBG의 독성학 연구를 위해 선택하였 다. 편의상(동물의 이용 가능성), 두 가지 상이한 종의 NHP를 사용하였다. 레서스와 사이노몰구스 마카크 사이 에 AAV ICM 투여 후 형질도입 프로파일에는 차이가 없었다. 성체 사이노몰구스 마카크 및 어린 레서스 마카크는 모두 유사한 해부학적 및 생리학적 특징을 갖고, 의도된 유아기형 임상적 집단의 CNS 해부학을 복제하며, 임상 적 ROA(ICM)를 사용하여 처리될 수 있다. 해부학 및 ROA의 유사성은 대표적인 벡터 분포 및 형질도입 프로파일 을 생성할 수 있으며, 이를 통해 마우스에서 가능한 것보다 더 정확한 독성의 평가가 가능하다. 또한, 설치류 모델에서보다 NHP에서 더 엄격한 신경학적 평가가 수행되어 CNS 독성을 보다 민감하게 검출할 수 있다. 완료된 비-임상적 약리학적 연구는 AAV.CB7.CI.hARSAco.rBG의 ICV 투여 후 건강한 마우스의 뇌에서 뉴런 및 수 초-생성 희소돌기아교세포 모두의 형질도입 및/또는 교차-교정을 통한 ARSA 효소의 AAV-매개성 전달 가능성을 입증하였다. 임상적 경로(ICM)를 통해 AAV.CB7.CI.hARSAco.rBG를 투여한 사이노몰구스 마카크에서의 약리학적 연구는 처리 후 처음 14일 동안 CSF에서 ARSA 활성이 적어도 2배 내인성 수준으로 증가함을 보여주었다. 뇌척수 액(CSF)에서 정상 수준의 ARSA 활성의 달성은 발명자들에 의해 의도된 환자 집단(조기 발병 MLD 환자)에 대한 좋은 결과와 상관관계가 있기 때문에(문헌[Sessa et al., 2016]), AAV.CB7.CI.hARSAco.rBG는 MLD 환자의 CSF에 치료적 수준의 ARSA를 전달할 가능성이 있다. 또한, 이는 AAV.CB7.CI.hARSAco.rBG 투여 후 적어도 42일 동안, ARSA를 발현하는 형질도입되고/되거나 교차-교정된 세포는 PNS로 돌출된 세포(척수 운동 뉴런 및 배근신경절 [DRG])를 포함하여 뇌 및 척수 전반에 걸쳐 광범위하게 지속됨을 보여주었다. 따라서, AAV.CB7.CI.hARSAco.rBG 는 MLD 환자에서 영향을 받는 CNS 및 PNS의 뉴런 및 수초화 세포 모두에 분비된 ARSA 효소의 오래 지속되는 공 급원을 제공할 가능성이 있다. 이 약리학적 연구를 확장하고 안전성 데이터를 수집하기 위해, AAV.CB7.CI.hARSAco.rBG의 180일 GLP-준수 독성 학 연구를 의도된 임상적 투여 경로(ROA)를 사용하여 어린 레서스 마카크에서 수행하였다. 다른 AAV 벡터를 레 서스 마카크의 CSF로 척추강내(IT) 전달하면 주사 후 2주 내지 3주에 최고 이식유전자 발현이 발생하고 이어서 90일까지 이식유전자 발현에서 안정적인 안정기가 이어진다. 본 발명자들은 ARSA 발현의 최고점이 사이노몰구스 마카크에서 ICM 투여 후 14일에 관찰된다는 것을 입증하였다. 따라서, 180일 시점은 이식유전자 생성물에 대한 최대 노출 기간 동안 발생하는 임의의 독성을 평가하기에 충분하다. 또한, 180일 동안의 평가는 주사 절차 또는 테스트 물품에 대한 선천적 면역 반응뿐만 아니라 벡터 캡시드 또는 이식유전자 생성물에 대한 적응 면역 반응 으로 인한 즉각적인 독성을 검출하는데에도 적합하다. ICM 투여 후 AAV.CB7.CI.hARSAco.rBG의 독성을 조사하기 위해 어린 레서스 마카크(대략 1년령 내지 2년령)에서 180일의 GLP-준수 안전성 연구를 수행하였다. 180일의 평가 기간은 분비된 이식유전자 생성물이 ICM AAV 투여 후 안정적인 안정기 수준에 도달하는데 충분한 시간을 허용하기 때문에 선택되었다. 투여 연령은 CNS 해부학적"}
{"patent_id": "10-2021-7039381", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 18, "content": "측면에서 의도된 유아기형 집단을 대표하도록 선택되었다. 연구 설계는 아래 표에 요약되어 있다."}
{"patent_id": "10-2021-7039381", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 19, "content": "어린 레서스 마카크에 AAV.CB7.CI.hARSAco.rBG: 3.0×1012 GC, 1.0×1013 GC 또는 3.0×1013 GC(용량당 N=3)의 세 가지 용량 수준 중 하나를 투여하였다. 추가적인 유년기형 마카크(N=2)에 대조군으로서 비히클(ITFFB)을 투 여하였다. AAV.CB7.CI.hARSAco.rBG 용량 수준은 뇌 질량(마우스의 경우 0.4g, 레서스 마카크의 경우 90g으로 가 정함)에 의해 척도화될 때 MED 연구에서 평가된 것과 동등하도록 선택하였다. 기재된 것과 동일한 벡터 전달 장 치를 사용하여 NHP에 투여하였다. 기본 신경학적 검사, 임상 병리학(차등이 있는 세포 계수, 임상 화학 및 응고 패널), CSF 화학 및 CSF 세포학을 수행하였다. AAV.CB7.CI.hARSAco.rBG 또는 비히클 투여 후, 고통 및 비정상적 행동의 징후에 대해 동물을 매일 모니터링하였다. 혈액 및 CSF 임상적 병리 평가 및 신경학적 검사는 AAV.CB7.CI.hARSAco.rBG 또는 비히클 투여 후 30일일 동안 매주, 그리고 그 후 30일마다 수행하였다. 기준선 및 그 이후 각 30일 시점에서, 항-AAVhu68 NAb, 및 AAVhu68과 AAV.CB7.CI.hARSAco.rBG 이식유전자 생성물에 대한 세포독성 T 림프구 반응을 인터페론 감 마(IFN-γ) 효소-연결 면역점(ELISpot) 검정에 의해 평가하였다. AAV.CB7.CI.hARSAco.rBG 또는 비히클 투여 후 90일에, 동물의 50%(그룹 1 내지 그룹 4)를 안락사시키고, 뇌, 척수, DRG, 말초 신경, 심장, 간, 비장, 신장, 폐, 생식 기관, 부신 및 림프절을 포함하지만 이들로 제한되지 않는 포괄적인 조직의 목록에 대해 병리조직학적 분석을 수행하였다. 장기의 무게를 적절하게 측정하였다. 순환구획(말초 혈액 단핵 세포)으로부터 림프구를 채취하고, 부검시 이들 장기에서 캡시드 및 이식유전자 생성물 모 두에 반응성인 T 세포의 존재에 대해 CNS-배수 림프절을 평가하였다. 그룹 1 내지 그룹 4를 안락사시키고 90일 (AAV.CB7.CI.hARSAco.rBG 또는 비히클 투여 후 180일) 후, 나머지 동물(그룹 5 내지 그룹 8)을 안락사시키고, 위와 같이 병리조직학적 분석을 수행하였다. 벡터 생체분포를 위한 조직, CSF 및 혈청은 벡터 배설을 평가하기 위해 소변 및 대변과 함께 수확 및 보관하였 다. 유년기형 마카크에서 동일한 캡시드 및 ROA를 사용하여 조직 샘플의 qPCR을 평가하였다. ICM 벡터 투여는 CSF 구획 내에서 즉각적인 벡터 분포를 초래하고, 효능 및 독성은 모두 CNS 벡터 노출과 관련 이 있다. 따라서, 용량은 뇌 질량에 따라 조정되며, 이는 CSF 구획의 크기의 근사치를 제공한다. 용량 변환은 성체 마우스의 경우 뇌 질량 0.4g(문헌[Gu et al., 2012]), 어린 레서스 마카크의 경우 90g(문헌[Herndon et al., 1998]) 및 4개월 내지 12개월의 인간 유아의 경우 800g(문헌[Dekaban, 1978])을 기준으로 하였다. 동등한 인간 용량은 아래 표에 나타내었다."}
{"patent_id": "10-2021-7039381", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 20, "content": "실시예 9 - 비-임상적 아데노-관련 바이러스 연구에서 감각 뉴런 독성. AAV.CB7.CI.hARSAco.rBG 독성학 연구에서 나타나는 DRG 감각 뉴런의 최소에서 경증의 무증상 변성을 줄이기 위 해, 벡터 게놈을 drg-탈표적화 miRNA 서열을 포함하는 벡터 게놈을 구축하였다. rAAV 벡터 게놈은 5'에서 3'로, CB7 프로모터, 조작된 hARSA 코딩 서열, 스페이서에 의해 분리되고 각각의 스페이서는 (A) GGAT; (B) CACGTG; 또는 (C) GCATGC 및 rBG 폴리 A 중 하나 이상으로부터 독립적으로 선택되는 4개의 연속적인 miRNA183(AGTGAATTCTACCAGTGCCATA의 서열 포함, 서열번호 20)으로 구성하였다. 이 벡터 게놈은 AAV.CB7.CI.hARSAco.miRNA183.rBG로 불리는 반면, 이 벡터 게놈 및 AAVhu68 캡시드를 포함하는 rAAV는 AAVhu68.CB7.CI.hARSAco.miRNA183.rBG로 불린다. 이 벡터 게놈을 포함하는 rAAV 벡터의 생산을 실시예 1에 기 재된 방법과 유사하게 수행하였다. AAVhu68.CB7.CI.hARSAco.miRNA183.rBG의 효능 및 독성을 실시예 2 내지 실 시예 8 및 실시예 10에 기술된 방법 및 모델을 사용하여 테스트하였다. 실시예 10 - 인간을 대상으로 한 첫 임상시험. ARSA 효소 결핍에 의해 야기된 조기 발병(후기 유아기형 또는 조기 유년기형) MLD가 있는 소아 환자(생후 4개월 이상)에서 단일 ICM 주사로 투여된 AAV.CB7.CI.hARSAco.rBG의 1/2상, 다기관, 오픈-라벨, 단일-암, 용량 증량 연구를 수행하였다. 안전성 및 내약성, 약력학적 및 임상적 효능을 2년에 걸쳐 평가하였으며, 모든 대상체는 안 전성 및 내약성, 약력학, 질환 진행 및 임상적 결과의 장기 평가를 위해 AAV.CB7.CI.hARSAco.rBG의 투여 후 5년 동안 추적하였다. 연구는 대략 -35일부터 -1일까지 각각의 잠재적인 대상체의 적격성을 결정하기 위한 스크리닝 단계로 구성된다. 대상체 적격성 및 어린이가 연구에 참여하도록 하는 부모/보호자의 의지를 확인한 후, 대상체에서 뇌 MRI, CSF 수집을 위한 LP, 채혈, 소변 수집, 활력, ECG, 신체 검사, 신경학적 검사 및 임상적 평가를 포함한 기준선 평가 를 하였다. 기준선 평가를 -1일 및 0일에 행하고, 적격성은 AAV.CB7.CI.hARSAco.rBG의 투여 전에 기준선에서 재 확인하였다. 치료 단계 동안, 대상체는 제0일의 아침에 병원에 입원하였다. 대상체는 제0일에 단일 ICM 용량의 AAV.CB7.CI.hARSAco.rBG를 투여 받았으며, 관찰을 위해 투여 후 적어도 24시간 동안 병원에 남아있었다. 후속 연구 방문은 투여 후 7일, 14일, 30일, 3개월 및 6개월에 이루어지며, 투여 후 처음 2년 동안은 6개월마다 이루 어진다. 장기 추적관찰(Long-term follow-up: LTFU) 방문은 투여 후 12개월에서 5년까지의 빈도로 추가 3년 동안 이루어진다. AAV.CB7.CI.hARSAco.rBG의 단일 용량은 아래 표시된 용량 수준 중 하나로 투여하였다. 코호트 1(저용량): 3명의 자격이 있는 대상체(대상체 #1 내지 #3)를 순차적으로 등록하고, 제1 대상체와 제2 대 상체 사이에 4주의 안전성 관찰 기간을 두고 저용량의 AAV.CB7.CI.hARSAco.rBG를 투여하였다. SRT가 관찰되지 않는 경우, 코호트 1의 제3 대상체에게 AAV.CB7.CI.hARSAco.rBG를 투여한지 4주 후에 안전 위원회에서 모든 이 용 가능한 안전성 데이터를 평가하였다. 코호트 2(고용량): 3명의 자격이 있는 대상체(대상체 #4 내지 #6)를 순차적으로 등록하고, 제4 대상체와 제5 대 상체 사이에 4주의 안전성 관찰 기간을 두고 고용량의 AAV.CB7.CI.hARSAco.rBG를 투여하였다. SRT가 관찰되지 않는 경우, 안전 위원회는 코호트 1의 대상체로부터의 안전성 데이터를 포함하여 대상체 #6에게 AAV.CB7.CI.hARSAco.rBG를 투여한지 4주 후에 모든 이용 가능한 안전성 데이터를 평가한다. 코호트 3(MTD, 최대 허용 용량): 안전 위원회의 긍정적인 권장 사항으로, 6명의 추가적인 대상체(대상체 #7 내 지 #12)를 등록하고, MTD에서 단일 ICM 용량 AAV.CB7.CI.hARSAco.rBG를 투여하였다. 이 코호트의 대상체에 대 한 투여는 각 대상체 사이에 4주의 안전성 관찰 기간으로 시차를 두지 않았다. 고용량 또는 저용량 코호트에 총 9명의 대상체의 등록이 등록되었고, 총 12명의 대상체(모든 용량에 걸쳐)가 등 록되었다. 인간 대상체에 대해 선택된 고용량이 NHP에서 등가의 MTD의 30% 내지 50%가 되도록 안전역(safety margin)을 적용하였다. 저용량은 동물 연구에서 동일한 규모의 MED를 초과하는 용량인 경우 선택된 고용량보다 전형적으로 2배 내지 3배 적다. 내약성이 있다는 조건하에, 더 높은 용량이 유리할 것으로 예상된다. 조기 발병 MLD는 일단 증상이 나타나면 매우 빠른 질환 경과를 특징으로 하기 때문에, 코호트 1(저용량) 및 코 호트 2(고용량)에서 제1 환자의 투여 후 30일에 해당 대상체에 대한 조사자의 유익성-위해성 평가에 기초하여 대상체의 동시 등록을 허용하기 위해 연구를 수행하였다. 이 경우에, 코호트에서 제2 환자와 제3 환자 사이의 투여 기간은 급성 독성, 알레르기 반응 및 절차-관련 이벤트에 대해 환자를 관찰하기 위해 적어도 24시간이 될 것이다. 질환의 희귀성을 감안할 때, 두 명의 대상체가 동시에 치료를 위해 나타날 확률은 낮은 것으로 간주된 다. 제안된 접근법의 근거는 환자가 빠른 질환 진행을 경험했기 때문에 치료 기간을 놓칠 위험이 코호트에서 다 음 환자에게 투여하기 전 안전성 추적 관찰의 잠재적인 이점보다 더 크다는 것이다. 환자가 등록과 치료 사이에 상당한 질환 진행을 경험하는 이러한 시나리오는 HSC-GT로 치료받은 일부 조기 발병 MLD 환자에서 관찰된 불량 한 결과의 가능한 원인으로 인용되었으며(문헌[Sessa et al., 2016]), 빠른 질환 진행의 위험이 있는 환자의 즉 각적인 확인 및 치료의 필요성을 강조한다. ARSA 효소 결핍에 의한 조기 발병(후기 유아기형 또는 조기 유년기형) MLD가 있는 소아 환자(4개월 이상)는 충 족되지 않은 요구가 가장 높은 집단을 나타낸다. 본 발명자들의 제안된 FIH 시험에 등록된 MLD 환자는 0/0(검출 가능한 기능성 효소가 생성되지 않은 2개의 널 ARSA 대립유전자) 또는 0/R(여전히 소량의 설파타이드를 분해할 수 있는 잔류 기능 활성을 갖는 효소를 암호화하는 하나의 널 ARSA 대립유전자 및 하나의 \"잔류\" ARSA 대립유전 자(R)에 대한 이형접합) 유전자형을 가질 수 있다. 이들은 운동 및 인지 장애 모두에서 빠른고 예측 가능한 감 소로 치명적인 질환 경과를 보여 질환 발병 후 몇 년 이내에 사망에 이르게 된다. 질환-완화적 치료는 대부분의 조기 발병 환자에게 사용할 수 없다. 조혈 줄기 세포 이식(HSCT)은 이 집단에서 혜택을 제공하지 않는 반면, 유 전자 요법을 사용한 조혈 줄기 세포(HSC-GT)는 조기 발병 집단의 소수를 구성하는 증상 전 환자에게만 효과적인 연구 치료제이다. 일차 종점은 AAV.CB7.CI.hARSAco.rBG의 안전성 및 내약성을 평가한다. 이차 또는 탐색적 종점은 약동학적 및 약 력학적 특성(이식유전자 발현, 바이오마커 활성 및 영상 매개변수) 및 임상적 효능 결과(대작동 및 소근육 운동 기능, 인지 및 언어 발달, 신경학적 검사 결과, 행동 및 마일스톤 발달 및 부모-보고 결과 및 삶의 질 평가)를 포함한다. 질환 진행의 예방 또는 안정화를 측정하기 위해 효능 종점 및 추적관찰 시기를 선택하였다. 따라서, 본 발명자에 의해 제안된 FIH 시험에서 담낭 병리를 안전성 신호 및 탐색적 종점으로 모니터링하였다. AE 및 SAE, 활력 징후 및 신체 검사, 신경학적 검사, 심전도(ECG), 감각 신경 전도 연구(DRG 독성 평가용), 실 험실 평가(혈청 화학, 혈액학, 응고 연구, 간 기능 테스트[LFT], 소변검사 및 CSF 화학 및 세포학) 및/또는 벡 터의 면역원성 및 이식유전자 생성물의 평가를 통해 단일 ICM 용량의 투여 후 24개월 동안 AAV.CB7.CI.hARSAco.rBG의 안전성 및 내약성을 평가하는 것. 이염성 백질이영양증(GMFC-MLD)에 대한 대근육 운동 기능 분류로 측정되는 치료 후 2년 동안 대근육 운동 기능 에 대한 AAV.CB7.CI.hARSAco.rBG의 효과를 평가하는 것. AAV.CB7.CI.hARSAco.rBG의 효능에 대한 추가적인 측정은 다음을 포함한다: 다음 종점: CSF 및 혈청에서 ARSA의 수준을 기반으로 단일 ICM 용량의 투여 후 2년 동안 AAV.CB7.CI.hARSACO.RBG의 약력학적 및 생물학적 활성을 평가하는 것; 대근육 운동 기능 측정(GMFM), 인지 기능 장애(유아 발달의 베일리 척도[BSID-III], 유아용 웩슬러 지능 척도, 제5판 [WISC-V]에 의해 측정되는 전체 지능 지수[IQ] 및 서브-도메인 IQ), 생존, 신경학적 임상 검사(NCE), 척 골, 비골, 정중, 비복 신경의 NCV, 운동 마일스톤을 유지하거나 획득하는 유아의 달성시 연령, 상실시 연령 및 백분율에 의해 평가되는 운동 마일스톤 달성(세계 보건 기구[WHO] 기준에 의해 정의됨)에 의해 측정되는 단일 ICM 용량의 투여 후 2년 동안 AAV.CB7.CI.hARSAco.rBG의 효능을 평가하는 것; 증상 일지에 의해 포착된 발작의 발병 연령 및 빈도, 바인랜드 적응행동 검사, 제3판(바인랜드-III), 로어 랜스 키 수행 인덱스, 소아용 삶의 질 목록(PedsQL 및 PedsQL-IS), 후견인/부모 삶의 질에 의해 측정되는 단일 ICM 용량의 투여 후 2년 동안 AAV.CB7.CI.hARSAco.rBG의 효능을 추가로 평가하는 것; MRI에 의해 측정된 CNS 수초화(탈수초화 로딩 및 패턴) 및 백질 위축, 양성자 자기공명 분광법(MRS)에 의해 측 정된 뉴런 대사산물 N-아세틸아스파테이트(NAA), 미오-이노시톨(mI), 콜린(Cho) 및 락테이트(Lac) 수준, CSF 설 파타이드 및 리소-설파타이드 수준, 시각적 유발 전위(VEP), 뇌간 청각 유발 반응(BAER), 담낭벽 비후의 초음파 평가에 의해 측정된 단일 ICM 용량의 투여 후 2년 동안 AAV.CB7.CI.hARSAco.rBG의 약력학적 효과를 추가로 평가 하는 것. 포함 기준은 다음을 포함한다: (i) 정상 범위 미만의 ARSA 활성과 및 알려진 또는 신규한 돌연변이인 두 가지 질환을 유발하는 ARSA 대립유전 자의 확인을 기반으로 하는 MLD의 문서화된 생화학적 및 분자적 진단. 신규한 돌연변이(들)의 경우에, 24시간 소변 수집은 상승된 설파타이드 수준을 보여야 한다; (ii) 4개월 이상; (iii) 증상 전 대상체는 다음을 가져야만 함: 증상 발병의 연령이 7세 미만인 MLD(지표 사례(index case))의 영향을 받은 연상의 형제자매. 대상체는 지표 사 례의 증상 발병 연령 및 다음의 ARSA 유전자형에 기초하여 후기 유아기형, 조기 유년기형 또는 중기 후기 유아 기형/조기 유년기형으로 분류된다: 후기 유아기형: 30개월 이하의 지표 사례에서 증상 발병 및 유전형은 전형적 으로 0/0; 조기 유년기형: 30개월 초과 및 7세 미만의 지표 사례에서 증상 발병, 유전형은 전형적으로 0/R; 중 기 후기 유아기형/조기 유년기형: 7세 미만의 지표 사례에서 증상이 발병하지만, 지표 사례를 후기 유아기형 또 는 조기 유년기형으로 명확하게 특성화할 수 없음 또는 MLD가 영향을 받는 형제자매가 없는 증상 전 어린이에서 진단되는 경우(예를 들어, 우연히 또는 가능한 경우 신 생아 스크리닝을 통해), 이용 가능한 전체 데이터는 대상체가 유전자 요법의 혜택을 받을 가능성이 있는 조기 발병 변이형 MLD가 있고, 대상체가 7세 미만인 경우 의뢰자 의료 모니터에 의해 논의 및 승인 후에 대상체가 자 격이 있는 것으로 간주될 수 있음을 강력하게 시사한다; (iv) 증상이 있는 후기 유아기형 대상체는 다음과 같은 MLD의 경증 임상적 또는 신경학적 징후가 있는 경우 자 격이 있다: 독립적인 서기 또는 걷기 달성의 지연과 같은 운동 마일스톤의 예상된 달성의 지연(WHO 마일스톤 범위에서 95번 째 초과의 백분위수) 및/또는 증가된 톤, 경련 또는 반사항진(hyperreflexia)을 포함하지만 이들로 제한되지 않는 NCE의 경미한 이상. 대상체 가 독립적인 걷기를 달성한 경우, 대상체가 독립적으로 적어도 10보를 걸을 수 있다면 경미한 운동실조의 징후 가 허용된다; (v) 증상이 있는 조기 유년기형 대상체는 증가된 톤, 경련, 반사항진 또는 보행 보조가 필요하지 않은 경미한 보행 이상을 포함하지만 이들로 제한되지 않는 NCE에 대해 경증/중등도 이상이 있는 경우 자격이 있다; (vi) 부모/후견인이 서명하고 날짜를 기재한 동의서. 제외 기준은 다음을 포함한다: 달성된 운동 마일스톤의 퇴행의 증거; 보행 보조가 필요한 보행 대상체; 총 IQ 70 미만에 기반한 인지 결손이 있는 EJ MLD 대상체; 연구자의 의견으로, 연구 결과의 해석을 혼란스럽게 할 수 있는 MLD에 기인하지 않는 임의의 임상적으로 유의한 신경인지 결손; 인간 면역결핍 바이러스(HIV) 또는 C형 간염(HepC)에 대해 양성 테스트 결과를 보인 환자; 대상체를 과도한 위험에 처하게 하거나 또는 연구 제품 안전성 또는 효능 결과의 평가 및 해석을 방해할 것으로 확인되는 임의의 현재 또는 이전의 병태 또는 신체 검사 또는 실험실 테스트; 형광투시 영상에 대한 금기사항을 포함하여, ICM 투여 절차에 대한 임의의 금기사항; MRI 또는 LP에 대한 임의의 금기사항; 스크리닝 전 4주 이내 또는 임상 연구에 사용된 연구 제품의 반감기 5일 이내 중 더 긴 기간 이내에 연구 제품 을 사용한 임의의 다른 임상적 연구에 등록; 이전에 동종이계 HSCT를 받았고, 공여자 기원의 잔류 세포의 증거가 있음; 이전의 유전자 요법. 투여 경로 및 절차는 아래에 자세히 설명되어 있다. AAV.CB7.CI.hARSAco.rBG는 대수조에 실시간 CT-유도 후두하 주사를 통해 제0일에 입원한 대상체에 단일 용량으 로 투여하였다. 제0일에, 적절한 역가의 5.6㎖의 AAV.CB7.CI.hARSAco.rBG가 들어 있는 주사기를 조사 약국(Investigational Pharmacy)에 의해 준비하고, 절차실로 전달하였다. 연구 약물 투여 전, 대상체를 마취하고, 삽관하고, 주사 부위를 프렙하고 멸균 기법을 사용하여 천으로 덮었다. LP를 수행하여 미리결정된 부피의 CSF를 제거한 후, 대수조의 관련 해부학적 시각화를 돕기 위해 아이오딘화 조 영제를 IT 주입하였다. IV 조영제는 IT 조영제에 대한 대안으로 바늘 삽입 전 또는 도중에 투여될 수 있다. IV 또는 IT 조영제를 사용하기 위한 결정은 절차를 수행하는 중재 방사선 전문의의 재량에 달려 있다. 척수 바늘 (22 내지 25 G)을 CT-형광투시 안내하에 대수조로 전진시켰다. 바늘 배치를 돕기 위해 더 큰 유도 바늘을 사용 할 수 있다. 바늘 배치의 확인 후, 확장 세트를 척수 바늘에 부착하고 CSF를 채웠다. 중재 방사선 전문의의 재 량에 따라, 조영제 물질이 들어 있는 주사기를 확장 세트에 연결하고, 대수조에 바늘이 위치하는지 확인하기 위 해 소량을 주입할 수 있다. 바늘 배치가 확인되면, AAV.CB7.CI.hARSAco.rBG가 들어 있는 주사기를 확장 세트에 연결하였다. 주사기 내용물을 1분 내지 2분에 걸쳐 천천히 주입하여 5.0㎖의 부피를 제공하였다. 이상 반응(Adverse Event: AE) 및 중대한 이상 반응(Serious Adverse Event: SAE)의 수집을 포함한 안전성 평 가, 신체 및 신경학적 검사, 활력 징후, 임상적 실험실 테스트(혈청 화학, 혈액학, 응고, LFT, 소변검사), ECG, 신경 전도 연구 및 CSF 세포학 및 화학(세포 수, 단백질, 글루코스)을 수행하였다. 코호트 1에서는 처음 3명의 대상체 이후에 그리고 코호트 2에서는 처음 3명의 대상체 이후에 안전성 평가를 수행하였다. 2차 및 탐색적 종점에 대해 통계학적 비교를 수행하였다. 각 시점에서의 측정을 각 대상체에 대한 기준선 값뿐 만 아니라 연령이 일치하는 건강한 대조군으로부터의 데이터 및 각 종점에 대해 이용 가능한 경우 비교 가능한 코호트 특징을 갖는 MLD 환자로부터의 자연사 데이터와 비교하였다."}
{"patent_id": "10-2021-7039381", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 21, "content": "모든 데이터는 대상체 데이터 목록에 표시되어 있다. 범주형 변수는 빈도와 백분율을 사용하여 요약하고, 연속 적인 변수는 기술 통계(결측되지 않은 관측값의 수, 평균, 표준 편차, 중앙값, 최소값 및 최대값)를 사용하여"}
{"patent_id": "10-2021-7039381", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 22, "content": "요약하였다. 그래픽 디스플레이가 적절하게 표시되어 있다. 실시예 11 - AAVhu68 + 탈아마이드화. 변형에 대해 AAVhu68을 분석하였다. 간략하게는, 이 연구와 관련이 없는 벡터 게놈을 사용하여 AAVhu68 벡터를 생성하였으며, 각각은 293 세포에서 종래의 삼중 형질감염 방법을 사용하여 생성하였다. 이들 기법의 일반적인 설명에 대해서는, 예를 들어, 문헌[Bell CL, et al., The AAV9 receptor and its modification to improve in vivo lung gene transfer in mice. J Clin Invest. 2011;121:2427-2435]을 참조한다. 간략하게는, AAV2 반전 말단 반복부가 측면에 위치하는 패키징될 서열(닭 β-액틴 프로모터로부터 발현된 이식유전자, 인트론 및 시미 안 바이러스 40(SV40) 후기 유전자로부터 유래된 폴리 A)을 암호화하는 플라스미드를 AAV2 rep 유전자 및 AAVhu68 cap 유전자 및 아데노바이러스 헬퍼 플라스미드(pAdΔF6)를 암호화하는 플라스미드로 HEK293 세포를 삼 중 형질감염시켜 패키징하였다. 생성된 AAV 바이러스 입자는 CsCl 구배 원심분리를 사용하여 정제하고, 농축시 키고, 추후에 사용하기 위해 냉동시킬 수 있다. 변성 및 알킬화: 100㎍의 해동된 바이러스 제조물(단백질 용액)에 2㎕의 1M 다이티오트레이톨(DTT) 및 2㎕의 8M 구아니딘 하이드로클로라이드(GndHCl)를 첨가하고, 90℃에서 10분 동안 인큐베이션하였다. 용액을 실온으로 냉 각시킨 다음, 5㎕의 새롭게 제조된 1M 아이오도아세트아마이드(IAM)를 첨가하고, 암실에서 실온에서 30분 동안 인큐베이션하였다. 30분 후, 1㎕의 1M DTT를 첨가하여 알킬화 반응을 중지시켰다. 분해: 변성된 단백질 용액에 최종 GndHCl 농도를 800mM로 희석하는 부피로 20mM 암모늄 바이카보네이트(pH 7.5 내지 8)를 첨가하였다. 1:20 트립신 대 단백질 비에 대한 트립신 용액을 첨가하고, 37℃에서 밤새 인큐베이션하 였다. 분해 후, TFA를 최종 0.5%까지 첨가하여 분해 반응을 중지시켰다. 질량 분석법: 대략 1 마이크로그램의 합한 분해 혼합물을 UHPLC-MS/MS로 분석하였다. LC는 UltiMate 3000 RSLCnano System(써모 사이언티픽(Thermo Scientific))에서 수행하였다. 이동상 A는 0.1%의 폼산이 포함된 MilliQ 물이다. 이동상 B는 0.1% 폼산이 포함된 아세토나이트릴이다. LC 구배는 15분에 걸쳐 4% B에서 6% B로, 그 다음 25분 동안 10% B로(총 40분), 그 다음 46분 동안 30% B로(총 86분) 실행하였다. 샘플은 칼럼에 직접 로 딩하였다. 칼럼 크기는 75㎝×15um I.D.이고, 2 마이크론 C18 배지(어클레임 펩맵)로 팩킹하였다. LC를 공급원 을 이용하는 NanoFlex 전자분무 이온화를 통해 사중극-Orbitrap 질량 분석기(Q-Exactive HF, 써모 사이언티픽) 에 연결하였다. 칼럼을 35℃로 가열하고, 2.2㎸의 전자분무 전압을 인가하였다. 질량 분석기는 상위 20개 이온 에서 탠덤 질량 스펙트럼을 획득하도록 프로그래밍하였다. 전체 MS 분해능은 120,000이고, MS/MS 분해능은 30,000이다. 정규화된 충돌 에너지는 30으로, 자동 이득 제어는 1e5로, max fill MS은 100㎳, max fill MS/MS 는 50㎳로 설정하였다. 데이터 처리: 질량 분석기 미가공 데이터 파일은 BioPharma Finder 1.0(써모 사이언티픽)으로 분석하였다. 간략 하게는, 모든 검색에는 10ppm 전구체 질량 내성, 5ppm 단편 질량 내성, 트립신 절단, 최대 1개의 누락된 절단, 시스테인 알킬화의 고정된 변형, 메티오닌/트립토판 산화의 가변 변형, 아스파라긴/글루타민 탈아마이드화, 인 산화, 메틸화 및 아마이드화가 필요하였다.다음 표에서, T는 트립신을 지칭하고, C는 키모트립신을 지칭한다."}
{"patent_id": "10-2021-7039381", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 23, "content": "AAVhu68 캡시드 단백질의 경우, 4개의 잔기(N57, N329, N452, N512)는 일상적으로 70% 초과의 탈아마이드화 수 준을 나타내며, 대부분의 경우 다양한 로트에서 90% 초과이다. 또한, 추가적인 아스파라긴 잔기(N94, N253, N270, N304, N409, N477 및 Q599)도 다양한 로트에서 최대 약 20%의 탈아마이드화 수준을 나타낸다. 탈아마이드 화 수준은 처음에 트립신 분해를 사용하여 확인되었고, 키모트립신 분해로 검증되었다. 성체 레서스 마카크에 AAVhu68.CB7.CI.eGFP.WPRE.rBG(3.00×1013 GC)를 ICM-투여하고, 28일 후에 부검하여 벡터 형질도입을 평가하였다. AAVhu68의 형질도입은 뇌의 광범위한 영역에서 관찰되었다. 따라서, AAVhu68 캡시드는 CNS에서 교차-교정의 가능성을 제공한다.참조:"}
{"patent_id": "10-2021-7039381", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 24, "content": "(서열 목록 자유 텍스트) 숫자 식별자 <223> 하에서 자유 텍스트를 포함하는 서열에 대해 하기 정보가 제공된다."}
{"patent_id": "10-2021-7039381", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 25, "content": "본 명세서에 인용된 모든 문서는 참조에 의해 본 명세서에 원용된다. 2019년 5월 3일자로 출원된 미국 출원 가 특허 제62/843,091호는 그 전문이 이의 서열 목록과 함께 참조에 의해 원용된다. \"UPN-18- 8585PCT_SeqListing_ST25.txt\"로 표지된 본 명세서와 함께 제출된 서열 목록과 그 안의 서열 및 텍스트는 참조 에 의해 원용된다. 본 발명이 특정 실시형태를 참조하여 설명되었지만, 본 발명의 정신을 벗어나지 않고 수정이 이루어질 수 있음을 이해할 것이다. 이러한 수정은 첨부된 청구범위의 범위 내에 속하는 것으로 의도된다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9a 도면9b 도면10 도면11 도면12a 도면12b 도면13 도면14 서 열 목 록 SEQUENCE LISTING <110> The Trustees of the University of Pennsylvania"}
{"patent_id": "10-2021-7039381", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 26, "content": "<120> Compositions Useful in Treatment of Metachromatic Leukodystrophy <130> WO 2020/227166 <140> PCT/US2020/031207 <141> 2020-05-20 <150> US 62/843,091 <151> 2019-05-03 <160> 24 <170> PatentIn version 3.5 <210> 1 <211> 1521 <212> DNA <213> Artificial Sequence <220><223> Engineered hARSA coding sequence <220><221> CDS <222> .. <223> Engineered hARSA coding sequence<400> 1 atg gga gcc cct aga tct ctg ctg ctg gct ctg gct gct gga ctg gca 48 Met Gly Ala Pro Arg Ser Leu Leu Leu Ala Leu Ala Ala Gly Leu Ala 1 5 10 15 gtt gcc aga cct cct aac atc gtg ctg atc ttc gcc gac gat ctc ggc 96 Val Ala Arg Pro Pro Asn Ile Val Leu Ile Phe Ala Asp Asp Leu Gly 20 25 30 tac ggc gat ctg ggc tgt tac gga cac ccc agc agc acc aca cct aac 144 Tyr Gly Asp Leu Gly Cys Tyr Gly His Pro Ser Ser Thr Thr Pro Asn 35 40 45 ctg gat caa ctt gcc gct ggc ggc ctg aga ttc acc gat ttc tac gtg 192 Leu Asp Gln Leu Ala Ala Gly Gly Leu Arg Phe Thr Asp Phe Tyr Val 50 55 60 ccc gtg tct ctg tgc acc cct tct aga gct gct ctg ctg aca ggc aga 240 Pro Val Ser Leu Cys Thr Pro Ser Arg Ala Ala Leu Leu Thr Gly Arg 65 70 75 80 ctc cct gtg cgg atg gga atg tat cct ggc gtg ctg gtg cct agc tct 288 Leu Pro Val Arg Met Gly Met Tyr Pro Gly Val Leu Val Pro Ser Ser 85 90 95 aga ggc gga ctg cct ctg gaa gaa gtg aca gtt gcc gaa gtg ctg gcc 336 Arg Gly Gly Leu Pro Leu Glu Glu Val Thr Val Ala Glu Val Leu Ala 100 105 110 gcc aga gga tat ctg act ggc atg gcc gga aag tgg cac ctc gga gtt 384 Ala Arg Gly Tyr Leu Thr Gly Met Ala Gly Lys Trp His Leu Gly Val 115 120 125 gga cca gaa ggc gct ttt ctg cct cct cac cag ggc ttc cac cgg ttt 432 Gly Pro Glu Gly Ala Phe Leu Pro Pro His Gln Gly Phe His Arg Phe 130 135 140 ctg ggc atc cct tac tct cac gat cag ggc ccc tgc cag aac ctg acc 480 Leu Gly Ile Pro Tyr Ser His Asp Gln Gly Pro Cys Gln Asn Leu Thr 145 150 155 160 tgt ttt cct cct gcc aca cct tgc gac ggc ggc tgt gat caa gga ctg 528 Cys Phe Pro Pro Ala Thr Pro Cys Asp Gly Gly Cys Asp Gln Gly Leu 165 170 175 gtg cca att cct ctg ctg gcc aac ctg agc gtg gaa gct caa cct cct 576 Val Pro Ile Pro Leu Leu Ala Asn Leu Ser Val Glu Ala Gln Pro Pro 180 185 190 tgg ctg cca gga ctg gaa gcc cgg tat atg gcc ttc gct cac gac ctg 624 Trp Leu Pro Gly Leu Glu Ala Arg Tyr Met Ala Phe Ala His Asp Leu 195 200 205 atg gcc gac gct cag aga cag gac aga cca ttc ttc ctg tac tac gcc 672 Met Ala Asp Ala Gln Arg Gln Asp Arg Pro Phe Phe Leu Tyr Tyr Ala 210 215 220 agc cac cac aca cac tac cct cag ttt agc ggc cag agc ttc gcc gag 720 Ser His His Thr His Tyr Pro Gln Phe Ser Gly Gln Ser Phe Ala Glu 225 230 235 240 aga tct ggc aga gga cct ttc ggc gac agc ctg atg gaa ctg gat gcc 768 Arg Ser Gly Arg Gly Pro Phe Gly Asp Ser Leu Met Glu Leu Asp Ala 245 250 255 gct gtg ggc aca ctg atg aca gcc atc gga gat ctg gga ctg ctg gaa 816 Ala Val Gly Thr Leu Met Thr Ala Ile Gly Asp Leu Gly Leu Leu Glu 260 265 270 gag aca ctg gtc atc ttc acc gcc gac aac ggc ccc gag aca atg aga 864 Glu Thr Leu Val Ile Phe Thr Ala Asp Asn Gly Pro Glu Thr Met Arg 275 280 285 atg agc aga ggc ggc tgt agc ggc ctg ctg aga tgt ggc aag ggc acc 912 Met Ser Arg Gly Gly Cys Ser Gly Leu Leu Arg Cys Gly Lys Gly Thr 290 295 300 aca tat gaa ggc ggc gtg aga gaa cct gct ctg gcc ttt tgg cct ggc 960 Thr Tyr Glu Gly Gly Val Arg Glu Pro Ala Leu Ala Phe Trp Pro Gly 305 310 315 320 cat att gct cca ggc gtg aca cac gag ctg gcc tct tct ctg gat ctg 1008 His Ile Ala Pro Gly Val Thr His Glu Leu Ala Ser Ser Leu Asp Leu 325 330 335 ctg cct aca ctg gca gct ctt gct ggt gct ccc ctg cct aat gtg acc 1056 Leu Pro Thr Leu Ala Ala Leu Ala Gly Ala Pro Leu Pro Asn Val Thr 340 345 350 ctg gat ggc ttc gat ctg agc cca ctg ctg ctc ggc aca ggc aag tct 1104 Leu Asp Gly Phe Asp Leu Ser Pro Leu Leu Leu Gly Thr Gly Lys Ser 355 360 365 cca aga cag agc ctg ttc ttc tac cct agc tac ccc gac gaa gtg cgg 1152 Pro Arg Gln Ser Leu Phe Phe Tyr Pro Ser Tyr Pro Asp Glu Val Arg 370 375 380 gga gtg ttt gcc gtg cgg acc gga aag tat aag gcc cac ttc ttc acc 1200 Gly Val Phe Ala Val Arg Thr Gly Lys Tyr Lys Ala His Phe Phe Thr 385 390 395 400 caa ggc agc gcc cac tct gac acc aca gct gat cct gct tgt cac gcc 1248 Gln Gly Ser Ala His Ser Asp Thr Thr Ala Asp Pro Ala Cys His Ala 405 410 415 agc tct agc ctg aca gcc cat gaa cct cca ctg ctg tac gac ctg agc 1296 Ser Ser Ser Leu Thr Ala His Glu Pro Pro Leu Leu Tyr Asp Leu Ser 420 425 430 aag gac ccc ggc gag aac tac aat ctg ctt ggc gga gtt gcc ggc gct 1344 Lys Asp Pro Gly Glu Asn Tyr Asn Leu Leu Gly Gly Val Ala Gly Ala 435 440 445 aca cct gaa gtt ctg cag gcc ctg aaa cag ctc cag ctg ctg aaa gcc 1392 Thr Pro Glu Val Leu Gln Ala Leu Lys Gln Leu Gln Leu Leu Lys Ala 450 455 460 cag ctg gac gct gcc gtg aca ttt gga cct agt cag gtg gcc aga ggc 1440 Gln Leu Asp Ala Ala Val Thr Phe Gly Pro Ser Gln Val Ala Arg Gly 465 470 475 480 gag gat cct gct ctg cag atc tgt tgt cac cct ggc tgc aca ccc aga 1488 Glu Asp Pro Ala Leu Gln Ile Cys Cys His Pro Gly Cys Thr Pro Arg 485 490 495 cct gcc tgc tgt cat tgt cct gat cca cac gcc 1521 Pro Ala Cys Cys His Cys Pro Asp Pro His Ala 500 505 <210> 2 <211> 507 <212> PRT <213> Artificial Sequence <220><223> Synthetic Construct <400> 2 Met Gly Ala Pro Arg Ser Leu Leu Leu Ala Leu Ala Ala Gly Leu Ala 1 5 10 15 Val Ala Arg Pro Pro Asn Ile Val Leu Ile Phe Ala Asp Asp Leu Gly 20 25 30 Tyr Gly Asp Leu Gly Cys Tyr Gly His Pro Ser Ser Thr Thr Pro Asn 35 40 45 Leu Asp Gln Leu Ala Ala Gly Gly Leu Arg Phe Thr Asp Phe Tyr Val 50 55 60 Pro Val Ser Leu Cys Thr Pro Ser Arg Ala Ala Leu Leu Thr Gly Arg 65 70 75 80 Leu Pro Val Arg Met Gly Met Tyr Pro Gly Val Leu Val Pro Ser Ser 85 90 95 Arg Gly Gly Leu Pro Leu Glu Glu Val Thr Val Ala Glu Val Leu Ala 100 105 110 Ala Arg Gly Tyr Leu Thr Gly Met Ala Gly Lys Trp His Leu Gly Val 115 120 125 Gly Pro Glu Gly Ala Phe Leu Pro Pro His Gln Gly Phe His Arg Phe 130 135 140 Leu Gly Ile Pro Tyr Ser His Asp Gln Gly Pro Cys Gln Asn Leu Thr 145 150 155 160 Cys Phe Pro Pro Ala Thr Pro Cys Asp Gly Gly Cys Asp Gln Gly Leu 165 170 175 Val Pro Ile Pro Leu Leu Ala Asn Leu Ser Val Glu Ala Gln Pro Pro 180 185 190 Trp Leu Pro Gly Leu Glu Ala Arg Tyr Met Ala Phe Ala His Asp Leu 195 200 205 Met Ala Asp Ala Gln Arg Gln Asp Arg Pro Phe Phe Leu Tyr Tyr Ala 210 215 220 Ser His His Thr His Tyr Pro Gln Phe Ser Gly Gln Ser Phe Ala Glu 225 230 235 240 Arg Ser Gly Arg Gly Pro Phe Gly Asp Ser Leu Met Glu Leu Asp Ala 245 250 255 Ala Val Gly Thr Leu Met Thr Ala Ile Gly Asp Leu Gly Leu Leu Glu 260 265 270 Glu Thr Leu Val Ile Phe Thr Ala Asp Asn Gly Pro Glu Thr Met Arg 275 280 285 Met Ser Arg Gly Gly Cys Ser Gly Leu Leu Arg Cys Gly Lys Gly Thr 290 295 300 Thr Tyr Glu Gly Gly Val Arg Glu Pro Ala Leu Ala Phe Trp Pro Gly 305 310 315 320 His Ile Ala Pro Gly Val Thr His Glu Leu Ala Ser Ser Leu Asp Leu 325 330 335 Leu Pro Thr Leu Ala Ala Leu Ala Gly Ala Pro Leu Pro Asn Val Thr 340 345 350 Leu Asp Gly Phe Asp Leu Ser Pro Leu Leu Leu Gly Thr Gly Lys Ser 355 360 365 Pro Arg Gln Ser Leu Phe Phe Tyr Pro Ser Tyr Pro Asp Glu Val Arg 370 375 380 Gly Val Phe Ala Val Arg Thr Gly Lys Tyr Lys Ala His Phe Phe Thr 385 390 395 400 Gln Gly Ser Ala His Ser Asp Thr Thr Ala Asp Pro Ala Cys His Ala 405 410 415 Ser Ser Ser Leu Thr Ala His Glu Pro Pro Leu Leu Tyr Asp Leu Ser 420 425 430 Lys Asp Pro Gly Glu Asn Tyr Asn Leu Leu Gly Gly Val Ala Gly Ala 435 440 445 Thr Pro Glu Val Leu Gln Ala Leu Lys Gln Leu Gln Leu Leu Lys Ala 450 455 460 Gln Leu Asp Ala Ala Val Thr Phe Gly Pro Ser Gln Val Ala Arg Gly 465 470 475 480 Glu Asp Pro Ala Leu Gln Ile Cys Cys His Pro Gly Cys Thr Pro Arg 485 490 495 Pro Ala Cys Cys His Cys Pro Asp Pro His Ala 500 505 <210> 3 <211> 1527 <212> DNA <213> Artificial Sequence <220><223> Engineered hARSA coding sequence <220><221> CDS <222> .. <223> Engineered hARSA coding sequence <400> 3 atg tct atg gga gcc cct aga tct ctg ctg ctg gct ctg gct gct gga 48 Met Ser Met Gly Ala Pro Arg Ser Leu Leu Leu Ala Leu Ala Ala Gly 1 5 10 15 ctg gca gtt gcc aga cct cct aac atc gtg ctg atc ttc gcc gac gat 96 Leu Ala Val Ala Arg Pro Pro Asn Ile Val Leu Ile Phe Ala Asp Asp 20 25 30 ctc ggc tac ggc gat ctg ggc tgt tac gga cac ccc agc agc acc aca 144 Leu Gly Tyr Gly Asp Leu Gly Cys Tyr Gly His Pro Ser Ser Thr Thr 35 40 45 cct aac ctg gat caa ctt gcc gct ggc ggc ctg aga ttc acc gat ttc 192 Pro Asn Leu Asp Gln Leu Ala Ala Gly Gly Leu Arg Phe Thr Asp Phe 50 55 60 tac gtg ccc gtg tct ctg tgc acc cct tct aga gct gct ctg ctg aca 240 Tyr Val Pro Val Ser Leu Cys Thr Pro Ser Arg Ala Ala Leu Leu Thr 65 70 75 80 ggc aga ctc cct gtg cgg atg gga atg tat cct ggc gtg ctg gtg cct 288 Gly Arg Leu Pro Val Arg Met Gly Met Tyr Pro Gly Val Leu Val Pro 85 90 95 agc tct aga ggc gga ctg cct ctg gaa gaa gtg aca gtt gcc gaa gtg 336 Ser Ser Arg Gly Gly Leu Pro Leu Glu Glu Val Thr Val Ala Glu Val 100 105 110 ctg gcc gcc aga gga tat ctg act ggc atg gcc gga aag tgg cac ctc 384 Leu Ala Ala Arg Gly Tyr Leu Thr Gly Met Ala Gly Lys Trp His Leu 115 120 125 gga gtt gga cca gaa ggc gct ttt ctg cct cct cac cag ggc ttc cac 432 Gly Val Gly Pro Glu Gly Ala Phe Leu Pro Pro His Gln Gly Phe His 130 135 140 cgg ttt ctg ggc atc cct tac tct cac gat cag ggc ccc tgc cag aac 480 Arg Phe Leu Gly Ile Pro Tyr Ser His Asp Gln Gly Pro Cys Gln Asn 145 150 155 160 ctg acc tgt ttt cct cct gcc aca cct tgc gac ggc ggc tgt gat caa 528 Leu Thr Cys Phe Pro Pro Ala Thr Pro Cys Asp Gly Gly Cys Asp Gln 165 170 175 gga ctg gtg cca att cct ctg ctg gcc aac ctg agc gtg gaa gct caa 576 Gly Leu Val Pro Ile Pro Leu Leu Ala Asn Leu Ser Val Glu Ala Gln 180 185 190 cct cct tgg ctg cca gga ctg gaa gcc cgg tat atg gcc ttc gct cac 624 Pro Pro Trp Leu Pro Gly Leu Glu Ala Arg Tyr Met Ala Phe Ala His 195 200 205 gac ctg atg gcc gac gct cag aga cag gac aga cca ttc ttc ctg tac 672Asp Leu Met Ala Asp Ala Gln Arg Gln Asp Arg Pro Phe Phe Leu Tyr 210 215 220 tac gcc agc cac cac aca cac tac cct cag ttt agc ggc cag agc ttc 720 Tyr Ala Ser His His Thr His Tyr Pro Gln Phe Ser Gly Gln Ser Phe 225 230 235 240 gcc gag aga tct ggc aga gga cct ttc ggc gac agc ctg atg gaa ctg 768 Ala Glu Arg Ser Gly Arg Gly Pro Phe Gly Asp Ser Leu Met Glu Leu 245 250 255 gat gcc gct gtg ggc aca ctg atg aca gcc atc gga gat ctg gga ctg 816 Asp Ala Ala Val Gly Thr Leu Met Thr Ala Ile Gly Asp Leu Gly Leu 260 265 270 ctg gaa gag aca ctg gtc atc ttc acc gcc gac aac ggc ccc gag aca 864 Leu Glu Glu Thr Leu Val Ile Phe Thr Ala Asp Asn Gly Pro Glu Thr 275 280 285 atg aga atg agc aga ggc ggc tgt agc ggc ctg ctg aga tgt ggc aag 912 Met Arg Met Ser Arg Gly Gly Cys Ser Gly Leu Leu Arg Cys Gly Lys 290 295 300 ggc acc aca tat gaa ggc ggc gtg aga gaa cct gct ctg gcc ttt tgg 960 Gly Thr Thr Tyr Glu Gly Gly Val Arg Glu Pro Ala Leu Ala Phe Trp 305 310 315 320 cct ggc cat att gct cca ggc gtg aca cac gag ctg gcc tct tct ctg 1008 Pro Gly His Ile Ala Pro Gly Val Thr His Glu Leu Ala Ser Ser Leu 325 330 335 gat ctg ctg cct aca ctg gca gct ctt gct ggt gct ccc ctg cct aat 1056 Asp Leu Leu Pro Thr Leu Ala Ala Leu Ala Gly Ala Pro Leu Pro Asn 340 345 350 gtg acc ctg gat ggc ttc gat ctg agc cca ctg ctg ctc ggc aca ggc 1104 Val Thr Leu Asp Gly Phe Asp Leu Ser Pro Leu Leu Leu Gly Thr Gly 355 360 365 aag tct cca aga cag agc ctg ttc ttc tac cct agc tac ccc gac gaa 1152 Lys Ser Pro Arg Gln Ser Leu Phe Phe Tyr Pro Ser Tyr Pro Asp Glu 370 375 380 gtg cgg gga gtg ttt gcc gtg cgg acc gga aag tat aag gcc cac ttc 1200 Val Arg Gly Val Phe Ala Val Arg Thr Gly Lys Tyr Lys Ala His Phe 385 390 395 400 ttc acc caa ggc agc gcc cac tct gac acc aca gct gat cct gct tgt 1248 Phe Thr Gln Gly Ser Ala His Ser Asp Thr Thr Ala Asp Pro Ala Cys 405 410 415 cac gcc agc tct agc ctg aca gcc cat gaa cct cca ctg ctg tac gac 1296 His Ala Ser Ser Ser Leu Thr Ala His Glu Pro Pro Leu Leu Tyr Asp 420 425 430 ctg agc aag gac ccc ggc gag aac tac aat ctg ctt ggc gga gtt gcc 1344 Leu Ser Lys Asp Pro Gly Glu Asn Tyr Asn Leu Leu Gly Gly Val Ala 435 440 445 ggc gct aca cct gaa gtt ctg cag gcc ctg aaa cag ctc cag ctg ctg 1392 Gly Ala Thr Pro Glu Val Leu Gln Ala Leu Lys Gln Leu Gln Leu Leu 450 455 460 aaa gcc cag ctg gac gct gcc gtg aca ttt gga cct agt cag gtg gcc 1440 Lys Ala Gln Leu Asp Ala Ala Val Thr Phe Gly Pro Ser Gln Val Ala 465 470 475 480 aga ggc gag gat cct gct ctg cag atc tgt tgt cac cct ggc tgc aca 1488 Arg Gly Glu Asp Pro Ala Leu Gln Ile Cys Cys His Pro Gly Cys Thr 485 490 495 ccc aga cct gcc tgc tgt cat tgt cct gat cca cac gcc 1527 Pro Arg Pro Ala Cys Cys His Cys Pro Asp Pro His Ala 500 505 <210> 4 <211> 509 <212> PRT <213> Artificial Sequence<220><223> Synthetic Construct <400> 4 Met Ser Met Gly Ala Pro Arg Ser Leu Leu Leu Ala Leu Ala Ala Gly 1 5 10 15 Leu Ala Val Ala Arg Pro Pro Asn Ile Val Leu Ile Phe Ala Asp Asp 20 25 30 Leu Gly Tyr Gly Asp Leu Gly Cys Tyr Gly His Pro Ser Ser Thr Thr 35 40 45 Pro Asn Leu Asp Gln Leu Ala Ala Gly Gly Leu Arg Phe Thr Asp Phe 50 55 60 Tyr Val Pro Val Ser Leu Cys Thr Pro Ser Arg Ala Ala Leu Leu Thr 65 70 75 80 Gly Arg Leu Pro Val Arg Met Gly Met Tyr Pro Gly Val Leu Val Pro 85 90 95 Ser Ser Arg Gly Gly Leu Pro Leu Glu Glu Val Thr Val Ala Glu Val 100 105 110 Leu Ala Ala Arg Gly Tyr Leu Thr Gly Met Ala Gly Lys Trp His Leu 115 120 125 Gly Val Gly Pro Glu Gly Ala Phe Leu Pro Pro His Gln Gly Phe His 130 135 140 Arg Phe Leu Gly Ile Pro Tyr Ser His Asp Gln Gly Pro Cys Gln Asn 145 150 155 160 Leu Thr Cys Phe Pro Pro Ala Thr Pro Cys Asp Gly Gly Cys Asp Gln 165 170 175 Gly Leu Val Pro Ile Pro Leu Leu Ala Asn Leu Ser Val Glu Ala Gln 180 185 190 Pro Pro Trp Leu Pro Gly Leu Glu Ala Arg Tyr Met Ala Phe Ala His 195 200 205 Asp Leu Met Ala Asp Ala Gln Arg Gln Asp Arg Pro Phe Phe Leu Tyr 210 215 220 Tyr Ala Ser His His Thr His Tyr Pro Gln Phe Ser Gly Gln Ser Phe 225 230 235 240 Ala Glu Arg Ser Gly Arg Gly Pro Phe Gly Asp Ser Leu Met Glu Leu 245 250 255 Asp Ala Ala Val Gly Thr Leu Met Thr Ala Ile Gly Asp Leu Gly Leu 260 265 270 Leu Glu Glu Thr Leu Val Ile Phe Thr Ala Asp Asn Gly Pro Glu Thr 275 280 285 Met Arg Met Ser Arg Gly Gly Cys Ser Gly Leu Leu Arg Cys Gly Lys 290 295 300 Gly Thr Thr Tyr Glu Gly Gly Val Arg Glu Pro Ala Leu Ala Phe Trp 305 310 315 320 Pro Gly His Ile Ala Pro Gly Val Thr His Glu Leu Ala Ser Ser Leu 325 330 335 Asp Leu Leu Pro Thr Leu Ala Ala Leu Ala Gly Ala Pro Leu Pro Asn 340 345 350 Val Thr Leu Asp Gly Phe Asp Leu Ser Pro Leu Leu Leu Gly Thr Gly 355 360 365 Lys Ser Pro Arg Gln Ser Leu Phe Phe Tyr Pro Ser Tyr Pro Asp Glu 370 375 380 Val Arg Gly Val Phe Ala Val Arg Thr Gly Lys Tyr Lys Ala His Phe 385 390 395 400 Phe Thr Gln Gly Ser Ala His Ser Asp Thr Thr Ala Asp Pro Ala Cys 405 410 415 His Ala Ser Ser Ser Leu Thr Ala His Glu Pro Pro Leu Leu Tyr Asp 420 425 430 Leu Ser Lys Asp Pro Gly Glu Asn Tyr Asn Leu Leu Gly Gly Val Ala 435 440 445 Gly Ala Thr Pro Glu Val Leu Gln Ala Leu Lys Gln Leu Gln Leu Leu 450 455 460 Lys Ala Gln Leu Asp Ala Ala Val Thr Phe Gly Pro Ser Gln Val Ala 465 470 475 480 Arg Gly Glu Asp Pro Ala Leu Gln Ile Cys Cys His Pro Gly Cys Thr 485 490 495 Pro Arg Pro Ala Cys Cys His Cys Pro Asp Pro His Ala 500 505 <210> 5 <211> 7141 <212> DNA <213> Artificial Sequence <220><223> Production plasmid for AAV. CB7,CI.hARSAco.RBG <220><221> repeat_region <222> .. <223> 5' ITR <220><221> promoter <222> .. <223> CMV IE promoter <220><221> promoter <222> .. <223> CB promoter <220><221> TATA_signal <222> .. <223> TATA <220><221> Intron <222> .. <223> chicken beta-actin intron <220><221> misc_feature <222> .. <223 > Engineered ARSA coding sequence (hARSAco) <220><221> polyA_signal <222> .. <223> Rabbit globin poly A <220><221> repeat_region <222> .. <223> 3' ITR <220><221> rep_origin<222> .. <223> f1 ori <220><221> rep_origin <222> .. <223> pUC origin of replication <220><221> misc_feature <222> .. <223> Kan-r <400> 5 ctgcgcgctc gctcgctcac tgaggccgcc cgggcaaagc ccgggcgtcg ggcgaccttt 60 ggtcgcccgg cctcagtgag cgagcgagcg cgcagagagg gagtggccaa ctccatcact 120 aggggttcct tgtagttaat gattaacccg ccatgctact tatctaccag ggtaatgggg 180 atcctctaga actatagcta gtcgacattg attattgact agttattaat agtaatcaat 240 tacggggtca ttagttcata gcccatatat ggagttccgc gttacataac ttacggtaaa 300 tggcccgcct ggctgaccgc ccaacgaccc ccgcccattg acgtcaataa tgacgtatgt 360 tcccatagta acgccaatag ggactttcca ttgacgtcaa tgggtggagt atttacggta 420 aactgcccac ttggcagtac atcaagtgta tcatatgcca agtacgcccc ctattgacgt 480 caatgacggt aaatggcccg cctggcatta tgcccagtac atgaccttat gggactttcc 540 tacttggcag tacatctacg tattagtcat cgctattacc atggtcgagg tgagccccac 600 gttctgcttc actctcccca tctccccccc ctccccaccc ccaattttgt atttatttat 660 tttttaatta ttttgtgcag cgatgggggc gggggggggg ggggggcgcg cgccaggcgg 720 ggcggggcgg ggcgaggggc ggggcggggc gaggcggaga ggtgcggcgg cagccaatca 780 gagcggcgcg ctccgaaagt ttccttttat ggcgaggcgg cggcggcggc ggccctataa 840 aaagcgaagc gcgcggcggg cgggagtcgc tgcgcgctgc cttcgccccg tgccccgctc 900 cgccgccgcc tcgcgccgcc cgccccggct ctgactgacc gcgttactcc cacaggtgag 960 cgggcgggac ggcccttctc ctccgggctg taattagcgc ttggtttaat gacggcttgt 1020 ttcttttctg tggctgcgtg aaagccttga ggggctccgg gagggccctt tgtgcggggg 1080 gagcggctcg gggggtgcgt gcgtgtgtgt gtgcgtgggg agcgccgcgt gcggctccgc 1140 gctgcccggc ggctgtgagc gctgcgggcg cggcgcgggg ctttgtgcgc tccgcagtgt 1200 gcgcgagggg agcgcggccg ggggcggtgc cccgcggtgc ggggggggct gcgaggggaa 1260 caaaggctgc gtgcggggtg tgtgcgtggg ggggtgagca gggggtgtgg gcgcgtcggt 1320cgggctgcaa ccccccctgc acccccctcc ccgagttgct gagcacggcc cggcttcggg 1380 tgcggggctc cgtacggggc gtggcgcggg gctcgccgtg ccgggcgggg ggtggcggca 1440 ggtgggggtg ccgggcgggg cggggccgcc tcgggccggg gagggctcgg gggaggggcg 1500 cggcggcccc cggagcgccg gcggctgtcg aggcgcggcg agccgcagcc attgcctttt 1560 atggtaatcg tgcgagaggg cgcagggact tcctttgtcc caaatctgtg cggagccgaa 1620 atctgggagg cgccgccgca ccccctctag cgggcgcggg gcgaagcggt gcggcgccgg 1680 caggaaggaa atgggcgggg agggccttcg tgcgtcgccg cgccgccgtc cccttctccc 1740 tctccagcct cggggctgtc cgcgggggga cggctgcctt cgggggggac ggggcagggc 1800 ggggttcggc ttctggcgtg tgaccggcgg ctctagagcc tctgctaacc atgttcatgc 1860 cttcttcttt ttcctacagc tcctgggcaa cgtgctggtt attgtgctgt ctcatcattt 1920 tggcaaagaa ttcacgcgtg aattcggtac cacaggccac catgtctatg ggagccccta 1980 gatctctgct gctggctctg gctgctggac tggcagttgc cagacctcct aacatcgtgc 2040 tgatcttcgc cgacgatctc ggctacggcg atctgggctg ttacggacac cccagcagca 2100 ccacacctaa cctggatcaa cttgccgctg gcggcctgag attcaccgat ttctacgtgc 2160 ccgtgtctct gtgcacccct tctagagctg ctctgctgac aggcagactc cctgtgcgga 2220 tgggaatgta tcctggcgtg ctggtgccta gctctagagg cggactgcct ctggaagaag 2280 tgacagttgc cgaagtgctg gccgccagag gatatctgac tggcatggcc ggaaagtggc 2340 acctcggagt tggaccagaa ggcgcttttc tgcctcctca ccagggcttc caccggtttc 2400 tgggcatccc ttactctcac gatcagggcc cctgccagaa cctgacctgt tttcctcctg 2460 ccacaccttg cgacggcggc tgtgatcaag gactggtgcc aattcctctg ctggccaacc 2520 tgagcgtgga agctcaacct ccttggctgc caggactgga agcccggtat atggccttcg 2580 ctcacgacct gatggccgac gctcagagac aggacagacc attcttcctg tactacgcca 2640 gccaccacac acactaccct cagtttagcg gccagagctt cgccgagaga tctggcagag 2700 gacctttcgg cgacagcctg atggaactgg atgccgctgt gggcacactg atgacagcca 2760 tcggagatct gggactgctg gaagagacac tggtcatctt caccgccgac aacggccccg 2820 agacaatgag aatgagcaga ggcggctgta gcggcctgct gagatgtggc aagggcacca 2880 catatgaagg cggcgtgaga gaacctgctc tggccttttg gcctggccat attgctccag 2940 gcgtgacaca cgagctggcc tcttctctgg atctgctgcc tacactggca gctcttgctg 3000 gtgctcccct gcctaatgtg accctggatg gcttcgatct gagcccactg ctgctcggca 3060caggcaagtc tccaagacag agcctgttct tctaccctag ctaccccgac gaagtgcggg 3120 gagtgtttgc cgtgcggacc ggaaagtata aggcccactt cttcacccaa ggcagcgccc 3180 actctgacac cacagctgat cctgcttgtc acgccagctc tagcctgaca gcccatgaac 3240 ctccactgct gtacgacctg agcaaggacc ccggcgagaa ctacaatctg cttggcggag 3300 ttgccggcgc tacacctgaa gttctgcagg ccctgaaaca gctccagctg ctgaaagccc 3360 agctggacgc tgccgtgaca tttggaccta gtcaggtggc cagaggcgag gatcctgctc 3420 tgcagatctg ttgtcaccct ggctgcacac ccagacctgc ctgctgtcat tgtcctgatc 3480 cacacgcctg atgaacagcc tgaggctcga ggacggggtg aactacgcct gaggatccga 3540 tctttttccc tctgccaaaa attatgggga catcatgaag ccccttgagc atctgacttc 3600 tggctaataa aggaaattta ttttcattgc aatagtgtgt tggaattttt tgtgtctctc 3660 actcggaagc aattcgttga tctgaatttc gaccacccat aatacccatt accctggtag 3720 ataagtagca tggcgggtta atcattaact acaaggaacc cctagtgatg gagttggcca 3780 ctccctctct gcgcgctcgc tcgctcactg aggccgggcg accaaaggtc gcccgacgcc 3840 cgggctttgc ccgggcggcc tcagtgagcg agcgagcgcg cagccttaat taacctaatt 3900 cactggccgt cgttttacaa cgtcgtgact gggaaaaccc tggcgttacc caacttaatc 3960 gccttgcagc acatccccct ttcgccagct ggcgtaatag cgaagaggcc cgcaccgatc 4020 gcccttccca acagttgcgc agcctgaatg gcgaatggga cgcgccctgt agcggcgcat 4080 taagcgcggc gggtgtggtg gttacgcgca gcgtgaccgc tacacttgcc agcgccctag 4140 cgcccgctcc tttcgctttc ttcccttcct ttctcgccac gttcgccggc tttccccgtc 4200 aagctctaaa tcgggggctc cctttagggt tccgatttag tgctttacgg cacctcgacc 4260 ccaaaaaact tgattagggt gatggttcac gtagtgggcc atcgccctga tagacggttt 4320 ttcgcccttt gacgttggag tccacgttct ttaatagtgg actcttgttc caaactggaa 4380 caacactcaa ccctatctcg gtctattctt ttgatttata agggattttg ccgatttcgg 4440 cctattggtt aaaaaatgag ctgatttaac aaaaatttaa cgcgaatttt aacaaaatca 4500 tgtgagcaaa aggccagcaa aaggccagga accgtaaaaa ggccgcgttg ctggcgtttt 4560 tccataggct ccgcccccct gacgagcatc acaaaaatcg acgctcaagt cagaggtggc 4620 gaaacccgac aggactataa agataccagg cgtttccccc tggaagctcc ctcgtgcgct 4680 ctcctgttcc gaccctgccg cttaccggat acctgtccgc ctttctccct tcgggaagcg 4740 tggcgctttc tcatagctca cgctgtaggt atctcagttc ggtgtaggtc gttcgctcca 4800 agctgggctg tgtgcacgaa ccccccgttc agcccgaccg ctgcgcctta tccggtaact 4860 atcgtcttga gtccaacccg gtaagacacg acttatcgcc actggcagca gccactggta 4920acaggattag cagagcgagg tatgtaggcg gtgctacaga gttcttgaag tggtggccta 4980 actacggcta cactagaaga acagtatttg gtatctgcgc tctgctgaag ccagttacct 5040 tcggaaaaag agttggtagc tcttgatccg gcaaacaaac caccgctggt agcggtggtt 5100 tttttgtttg caagcagcag attacgcgca gaaaaaaagg atctcaagaa gatcctttga 5160 tcttttctac ggggtctgac gctcagtgga acgaaaactc acgttaaggg attttggtca 5220 tgagattatc aaaaaggatc ttcacctaga tccttttgat cctccggcgt tcagcctgtg 5280 ccacagccga caggatggtg accaccattt gccccatatc accgtcggta ctgatcccgt 5340 cgtcaataaa ccgaaccgct acaccctgag catcaaactc ttttatcagt tggatcatgt 5400 cggcggtgtc gcggccaaga cggtcgagct tcttcaccag aatgacatca ccttcctcca 5460 ccttcatcct cagcaaatcc agcccttccc gatctgttga actgccggat gccttgtcgg 5520 taaagatgcg gttagctttt acccctgcat ctttgagcgc tgaggtctgc ctcgtgaaga 5580 aggtgttgct gactcatacc aggcctgaat cgccccatca tccagccaga aagtgaggga 5640 gccacggttg atgagagctt tgttgtaggt ggaccagttg gtgattttga acttttgctt 5700 tgccacggaa cggtctgcgt tgtcgggaag atgcgtgatc tgatccttca actcagcaaa 5760 agttcgattt attcaacaaa gccgccgtcc cgtcaagtca gcgtaatgct ctgccagtgt 5820 tacaaccaat taaccaattc tgattagaaa aactcatcga gcatcaaatg aaactgcaat 5880 ttattcatat caggattatc aataccatat ttttgaaaaa gccgtttctg taatgaagga 5940 gaaaactcac cgaggcagtt ccataggatg gcaagatcct ggtatcggtc tgcgattccg 6000 actcgtccaa catcaataca acctattaat ttcccctcgt caaaaataag gttatcaagt 6060 gagaaatcac catgagtgac gactgaatcc ggtgagaatg gcaaaagctt atgcatttct 6120 ttccagactt gttcaacagg ccagccatta cgctcgtcat caaaatcact cgcatcaacc 6180 aaaccgttat tcattcgtga ttgcgcctga gcgagacgaa atacgcgatc gctgttaaaa 6240 ggacaattac aaacaggaat cgaatgcaac cggcgcagga acactgccag cgcatcaaca 6300 atattttcac ctgaatcagg atattcttct aatacctgga atgctgtttt cccggggatc 6360 gcagtggtga gtaaccatgc atcatcagga gtacggataa aatgcttgat ggtcggaaga 6420 ggcataaatt ccgtcagcca gtttagtctg accatctcat ctgtaacatc attggcaacg 6480 ctacctttgc catgtttcag aaacaactct ggcgcatcgg gcttcccata caatcgatag 6540 attgtcgcac ctgattgccc gacattatcg cgagcccatt tatacccata taaatcagca 6600 tccatgttgg aatttaatcg cggcctcgag caagacgttt cccgttgaat atggctcata 6660 acaccccttg tattactgtt tatgtaagca gacagtttta ttgttcatga tgatatattt 6720 ttatcttgtg caatgtaaca tcagagattt tgagacacca tgttctttcc tgcgttatcc 6780cctgattctg tggataaccg tattaccgcc tttgagtgag ctgataccgc tcgccgcagc 6840 cgaacgaccg agcgcagcga gtcagtgagc gaggaagcgg aagagcgccc aatacgcaaa 6900 ccgcctctcc ccgcgcgttg gccgattcat taatgcagct ggcacgacag gtttcccgac 6960 tggaaagcgg gcagtgagcg caacgcaatt aatgtgagtt agctcactca ttaggcaccc 7020 caggctttac actttatgct tccggctcgt atgttgtgtg gaattgtgag cggataacaa 7080 tttcacacag gaaacagcta tgaccatgat tacgccagat ttaattaagg ccttaattag 7140 g 7141 <210> 6 <211> 2211 <212> DNA <213> Artificial Sequence <220><223> AAVhu68 vp1 <220><221> CDS <222> .. <400> 6 atg gct gcc gat ggt tat ctt cca gat tgg ctc gag gac aac ctc agt 48 Met Ala Ala Asp Gly Tyr Leu Pro Asp Trp Leu Glu Asp Asn Leu Ser 1 5 10 15 gaa ggc att cgc gag tgg tgg gct ttg aaa cct gga gcc cct caa ccc 96 Glu Gly Ile Arg Glu Trp Trp Ala Leu Lys Pro Gly Ala Pro Gln Pro 20 25 30 aag gca aat caa caa cat caa gac aac gct cgg ggt ctt gtg ctt ccg 144 Lys Ala Asn Gln Gln His Gln Asp Asn Ala Arg Gly Leu Val Leu Pro 35 40 45 ggt tac aaa tac ctt gga ccc ggc aac gga ctc gac aag ggg gag ccg 192 Gly Tyr Lys Tyr Leu Gly Pro Gly Asn Gly Leu Asp Lys Gly Glu Pro 50 55 60 gtc aac gaa gca gac gcg gcg gcc ctc gag cac gac aag gcc tac gac 240 Val Asn Glu Ala Asp Ala Ala Ala Leu Glu His Asp Lys Ala Tyr Asp 65 70 75 80 cag cag ctc aag gcc gga gac aac ccg tac ctc aag tac aac cac gcc 288Gln Gln Leu Lys Ala Gly Asp Asn Pro Tyr Leu Lys Tyr Asn His Ala 85 90 95 gac gcc gag ttc cag gag cgg ctc aaa gaa gat acg tct ttt ggg ggc 336 Asp Ala Glu Phe Gln Glu Arg Leu Lys Glu Asp Thr Ser Phe Gly Gly 100 105 110 aac ctc ggg cga gca gtc ttc cag gcc aaa aag agg ctt ctt gaa cct 384 Asn Leu Gly Arg Ala Val Phe Gln Ala Lys Lys Arg Leu Leu Glu Pro 115 120 125 ctt ggt ctg gtt gag gaa gcg gct aag acg gct cct gga aag aag agg 432 Leu Gly Leu Val Glu Glu Ala Ala Lys Thr Ala Pro Gly Lys Lys Arg 130 135 140 cct gta gag cag tct cct cag gaa ccg gac tcc tcc gtg ggt att ggc 480 Pro Val Glu Gln Ser Pro Gln Glu Pro Asp Ser Ser Val Gly Ile Gly 145 150 155 160 aaa tcg ggt gca cag ccc gct aaa aag aga ctc aat ttc ggt cag act 528 Lys Ser Gly Ala Gln Pro Ala Lys Lys Arg Leu Asn Phe Gly Gln Thr 165 170 175 ggc gac aca gag tca gtc ccc gac cct caa cca atc gga gaa cct ccc 576 Gly Asp Thr Glu Ser Val Pro Asp Pro Gln Pro Ile Gly Glu Pro Pro 180 185 190 gca gcc ccc tca ggt gtg gga tct ctt aca atg gct tca ggt ggt ggc 624 Ala Ala Pro Ser Gly Val Gly Ser Leu Thr Met Ala Ser Gly Gly Gly 195 200 205 gca cca gtg gca gac aat aac gaa ggt gcc gat gga gtg ggt agt tcc 672 Ala Pro Val Ala Asp Asn Asn Glu Gly Ala Asp Gly Val Gly Ser Ser 210 215 220 tcg gga aat tgg cat tgc gat tcc caa tgg ctg ggg gac aga gtc atc 720 Ser Gly Asn Trp His Cys Asp Ser Gln Trp Leu Gly Asp Arg Val Ile 225 230 235 240 acc acc agc acc cga acc tgg gcc ctg ccc acc tac aac aat cac ctc 768 Thr Thr Ser Thr Arg Thr Trp Ala Leu Pro Thr Tyr Asn Asn His Leu 245 250 255 tac aag caa atc tcc aac agc aca tct gga gga tct tca aat gac aac 816 Tyr Lys Gln Ile Ser Asn Ser Thr Ser Gly Gly Ser Ser Asn Asp Asn 260 265 270 gcc tac ttc ggc tac agc acc ccc tgg ggg tat ttt gac ttc aac aga 864 Ala Tyr Phe Gly Tyr Ser Thr Pro Trp Gly Tyr Phe Asp Phe Asn Arg 275 280 285 ttc cac tgc cac ttc tca cca cgt gac tgg caa aga ctc atc aac aac 912 Phe His Cys His Phe Ser Pro Arg Asp Trp Gln Arg Leu Ile Asn Asn 290 295 300 aac tgg gga ttc cgg cct aag cga ctc aac ttc aag ctc ttc aac att 960 Asn Trp Gly Phe Arg Pro Lys Arg Leu Asn Phe Lys Leu Phe Asn Ile 305 310 315 320 cag gtc aaa gag gtt acg gac aac aat gga gtc aag acc atc gct aat 1008 Gln Val Lys Glu Val Thr Asp Asn Asn Gly Val Lys Thr Ile Ala Asn 325 330 335 aac ctt acc agc acg gtc cag gtc ttc acg gac tca gac tat cag ctc 1056 Asn Leu Thr Ser Thr Val Gln Val Phe Thr Asp Ser Asp Tyr Gln Leu 340 345 350 ccg tac gtg ctc ggg tcg gct cac gag ggc tgc ctc ccg ccg ttc cca 1104 Pro Tyr Val Leu Gly Ser Ala His Glu Gly Cys Leu Pro Pro Phe Pro 355 360 365 gcg gac gtt ttc atg att cct cag tac ggg tat cta acg ctt aat gat 1152 Ala Asp Val Phe Met Ile Pro Gln Tyr Gly Tyr Leu Thr Leu Asn Asp 370 375 380 gga agc caa gcc gtg ggt cgt tcg tcc ttt tac tgc ctg gaa tat ttc 1200 Gly Ser Gln Ala Val Gly Arg Ser Ser Phe Tyr Cys Leu Glu Tyr Phe 385 390 395 400 ccg tcg caa atg cta aga acg ggt aac aac ttc cag ttc agc tac gag 1248Pro Ser Gln Met Leu Arg Thr Gly Asn Asn Phe Gln Phe Ser Tyr Glu 405 410 415 ttt gag aac gta cct ttc cat agc agc tat gct cac agc caa agc ctg 1296 Phe Glu Asn Val Pro Phe His Ser Ser Tyr Ala His Ser Gln Ser Leu 420 425 430 gac cga ctc atg aat cca ctc atc gac caa tac ttg tac tat ctc tca 1344 Asp Arg Leu Met Asn Pro Leu Ile Asp Gln Tyr Leu Tyr Tyr Leu Ser 435 440 445 aag act att aac ggt tct gga cag aat caa caa acg cta aaa ttc agt 1392 Lys Thr Ile Asn Gly Ser Gly Gln Asn Gln Gln Thr Leu Lys Phe Ser 450 455 460 gtg gcc gga ccc agc aac atg gct gtc cag gga aga aac tac ata cct 1440 Val Ala Gly Pro Ser Asn Met Ala Val Gln Gly Arg Asn Tyr Ile Pro 465 470 475 480 gga ccc agc tac cga caa caa cgt gtc tca acc act gtg act caa aac 1488 Gly Pro Ser Tyr Arg Gln Gln Arg Val Ser Thr Thr Val Thr Gln Asn 485 490 495 aac aac agc gaa ttt gct tgg cct gga gct tct tct tgg gct ctc aat 1536 Asn Asn Ser Glu Phe Ala Trp Pro Gly Ala Ser Ser Trp Ala Leu Asn 500 505 510 gga cgt aat agc ttg atg aat cct gga cct gct atg gcc agc cac aaa 1584 Gly Arg Asn Ser Leu Met Asn Pro Gly Pro Ala Met Ala Ser His Lys 515 520 525 gaa gga gag gac cgt ttc ttt cct ttg tct gga tct tta att ttt ggc 1632 Glu Gly Glu Asp Arg Phe Phe Pro Leu Ser Gly Ser Leu Ile Phe Gly 530 535 540 aaa caa gga act gga aga gac aac gtg gat gcg gac aaa gtc atg ata 1680 Lys Gln Gly Thr Gly Arg Asp Asn Val Asp Ala Asp Lys Val Met Ile 545 550 555 560 acc aac gaa gaa gaa att aaa act acc aac cca gta gca acg gag tcc 1728 Thr Asn Glu Glu Glu Ile Lys Thr Thr Asn Pro Val Ala Thr Glu Ser 565 570 575 tat gga caa gtg gcc aca aac cac cag agt gcc caa gca cag gcg cag 1776 Tyr Gly Gln Val Ala Thr Asn His Gln Ser Ala Gln Ala Gln Ala Gln 580 585 590 acc ggc tgg gtt caa aac caa gga ata ctt ccg ggt atg gtt tgg cag 1824 Thr Gly Trp Val Gln Asn Gln Gly Ile Leu Pro Gly Met Val Trp Gln 595 600 605 gac aga gat gtg tac ctg caa gga ccc att tgg gcc aaa att cct cac 1872 Asp Arg Asp Val Tyr Leu Gln Gly Pro Ile Trp Ala Lys Ile Pro His 610 615 620 acg gac ggc aac ttt cac cct tct ccg ctg atg gga ggg ttt gga atg 1920 Thr Asp Gly Asn Phe His Pro Ser Pro Leu Met Gly Gly Phe Gly Met 625 630 635 640 aag cac ccg cct cct cag atc ctc atc aaa aac aca cct gta cct gcg 1968 Lys His Pro Pro Pro Gln Ile Leu Ile Lys Asn Thr Pro Val Pro Ala 645 650 655 gat cct cca acg gct ttc aac aag gac aag ctg aac tct ttc atc acc 2016 Asp Pro Pro Thr Ala Phe Asn Lys Asp Lys Leu Asn Ser Phe Ile Thr 660 665 670 cag tat tct act ggc caa gtc agc gtg gag att gag tgg gag ctg cag 2064 Gln Tyr Ser Thr Gly Gln Val Ser Val Glu Ile Glu Trp Glu Leu Gln 675 680 685 aag gaa aac agc aag cgc tgg aac ccg gag atc cag tac act tcc aac 2112 Lys Glu Asn Ser Lys Arg Trp Asn Pro Glu Ile Gln Tyr Thr Ser Asn 690 695 700 tat tac aag tct aat aat gtt gaa ttt gct gtt aat act gaa ggt gtt 2160 Tyr Tyr Lys Ser Asn Asn Val Glu Phe Ala Val Asn Thr Glu Gly Val 705 710 715 720 tat tct gaa ccc cgc ccc att ggc acc aga tac ctg act cgt aat ctg 2208 Tyr Ser Glu Pro Arg Pro Ile Gly Thr Arg Tyr Leu Thr Arg Asn Leu 725 730 735 taa 2211 <210> 7 <211> 736 <212> PRT <213> Artificial Sequence <220><223> Synthetic Construct <400> 7 Met Ala Ala Asp Gly Tyr Leu Pro Asp Trp Leu Glu Asp Asn Leu Ser 1 5 10 15 Glu Gly Ile Arg Glu Trp Trp Ala Leu Lys Pro Gly Ala Pro Gln Pro 20 25 30 Lys Ala Asn Gln Gln His Gln Asp Asn Ala Arg Gly Leu Val Leu Pro 35 40 45 Gly Tyr Lys Tyr Leu Gly Pro Gly Asn Gly Leu Asp Lys Gly Glu Pro 50 55 60 Val Asn Glu Ala Asp Ala Ala Ala Leu Glu His Asp Lys Ala Tyr Asp 65 70 75 80 Gln Gln Leu Lys Ala Gly Asp Asn Pro Tyr Leu Lys Tyr Asn His Ala 85 90 95 Asp Ala Glu Phe Gln Glu Arg Leu Lys Glu Asp Thr Ser Phe Gly Gly 100 105 110 Asn Leu Gly Arg Ala Val Phe Gln Ala Lys Lys Arg Leu Leu Glu Pro 115 120 125 Leu Gly Leu Val Glu Glu Ala Ala Lys Thr Ala Pro Gly Lys Lys Arg 130 135 140 Pro Val Glu Gln Ser Pro Gln Glu Pro Asp Ser Ser Val Gly Ile Gly 145 150 155 160 Lys Ser Gly Ala Gln Pro Ala Lys Lys Arg Leu Asn Phe Gly Gln Thr 165 170 175 Gly Asp Thr Glu Ser Val Pro Asp Pro Gln Pro Ile Gly Glu Pro Pro 180 185 190 Ala Ala Pro Ser Gly Val Gly Ser Leu Thr Met Ala Ser Gly Gly Gly 195 200 205 Ala Pro Val Ala Asp Asn Asn Glu Gly Ala Asp Gly Val Gly Ser Ser 210 215 220 Ser Gly Asn Trp His Cys Asp Ser Gln Trp Leu Gly Asp Arg Val Ile 225 230 235 240 Thr Thr Ser Thr Arg Thr Trp Ala Leu Pro Thr Tyr Asn Asn His Leu 245 250 255 Tyr Lys Gln Ile Ser Asn Ser Thr Ser Gly Gly Ser Ser Asn Asp Asn 260 265 270 Ala Tyr Phe Gly Tyr Ser Thr Pro Trp Gly Tyr Phe Asp Phe Asn Arg 275 280 285 Phe His Cys His Phe Ser Pro Arg Asp Trp Gln Arg Leu Ile Asn Asn 290 295 300 Asn Trp Gly Phe Arg Pro Lys Arg Leu Asn Phe Lys Leu Phe Asn Ile 305 310 315 320 Gln Val Lys Glu Val Thr Asp Asn Asn Gly Val Lys Thr Ile Ala Asn 325 330 335 Asn Leu Thr Ser Thr Val Gln Val Phe Thr Asp Ser Asp Tyr Gln Leu 340 345 350 Pro Tyr Val Leu Gly Ser Ala His Glu Gly Cys Leu Pro Pro Phe Pro 355 360 365 Ala Asp Val Phe Met Ile Pro Gln Tyr Gly Tyr Leu Thr Leu Asn Asp 370 375 380 Gly Ser Gln Ala Val Gly Arg Ser Ser Phe Tyr Cys Leu Glu Tyr Phe 385 390 395 400 Pro Ser Gln Met Leu Arg Thr Gly Asn Asn Phe Gln Phe Ser Tyr Glu 405 410 415 Phe Glu Asn Val Pro Phe His Ser Ser Tyr Ala His Ser Gln Ser Leu 420 425 430 Asp Arg Leu Met Asn Pro Leu Ile Asp Gln Tyr Leu Tyr Tyr Leu Ser 435 440 445 Lys Thr Ile Asn Gly Ser Gly Gln Asn Gln Gln Thr Leu Lys Phe Ser 450 455 460 Val Ala Gly Pro Ser Asn Met Ala Val Gln Gly Arg Asn Tyr Ile Pro 465 470 475 480 Gly Pro Ser Tyr Arg Gln Gln Arg Val Ser Thr Thr Val Thr Gln Asn 485 490 495 Asn Asn Ser Glu Phe Ala Trp Pro Gly Ala Ser Ser Trp Ala Leu Asn 500 505 510 Gly Arg Asn Ser Leu Met Asn Pro Gly Pro Ala Met Ala Ser His Lys 515 520 525 Glu Gly Glu Asp Arg Phe Phe Pro Leu Ser Gly Ser Leu Ile Phe Gly 530 535 540 Lys Gln Gly Thr Gly Arg Asp Asn Val Asp Ala Asp Lys Val Met Ile 545 550 555 560 Thr Asn Glu Glu Glu Ile Lys Thr Thr Asn Pro Val Ala Thr Glu Ser 565 570 575 Tyr Gly Gln Val Ala Thr Asn His Gln Ser Ala Gln Ala Gln Ala Gln 580 585 590 Thr Gly Trp Val Gln Asn Gln Gly Ile Leu Pro Gly Met Val Trp Gln 595 600 605 Asp Arg Asp Val Tyr Leu Gln Gly Pro Ile Trp Ala Lys Ile Pro His 610 615 620 Thr Asp Gly Asn Phe His Pro Ser Pro Leu Met Gly Gly Phe Gly Met 625 630 635 640 Lys His Pro Pro Pro Gln Ile Leu Ile Lys Asn Thr Pro Val Pro Ala 645 650 655 Asp Pro Pro Thr Ala Phe Asn Lys Asp Lys Leu Asn Ser Phe Ile Thr 660 665 670 Gln Tyr Ser Thr Gly Gln Val Ser Val Glu Ile Glu Trp Glu Leu Gln 675 680 685 Lys Glu Asn Ser Lys Arg Trp Asn Pro Glu Ile Gln Tyr Thr Ser Asn 690 695 700 Tyr Tyr Lys Ser Asn Asn Val Glu Phe Ala Val Asn Thr Glu Gly Val 705 710 715 720 Tyr Ser Glu Pro Arg Pro Ile Gly Thr Arg Tyr Leu Thr Arg Asn Leu 725 730 735 <210> 8 <211> 736 <212> PRT <213> Artificial Sequence <220><223> modified hu68vp1 <220><221> MISC_FEATURE <222> .. <223> Xaa may be W (Trp, tryptophan), or oxidated W. <220><221> MISC_FEATURE <222> .. <223> Xaa may be Asn, or deamidated to Asp, isoAsp, or Asp/isoAsp <220><221> MISC_FEATURE <222> .. <223> Xaa may be Asn, or deamidated to Asp, isoAsp, or Asp/isoAsp <220><221> MISC_FEATURE <222> .. <223> Xaa may be Asn, or deamidated to Asp, isoAsp, or Asp/isoAsp <220><221> MISC_FEATURE <222> .. <223> Xaa may be Asn, or deamidated to Asp, isoAsp, or Asp/isoAsp <220><221> MISC_FEATURE <222> .. <223 > Xaa may be D (asp, aspartic acid), or isomerized D. <220><221> MISC_FEATURE <222> .. <223> Xaa may be D (asp, aspartic acid), or isomerized D.<220><221> misc_feature <222> .. <223> Xaa can be any naturally occurring amino acid <220><221> MISC_FEATURE <222> .. <223> Xaa may be S (Ser, serine), or Phosphorilated S <220><221> MISC_FEATURE <222> .. <223> Xaa may be S (Ser, serine), or Phosphorylated S <220><221> MISC_FEATURE <222 > .. <223> Xaa may be W (Trp, tryptophan), or oxidated W (e.g., kynurenine). <220><221> MISC_FEATURE <222> .. <223> Xaa may be Asn, or deamidated to Asp, isoAsp, or Asp/isoAsp <220><221> MISC_FEATURE <222> .. <223> Xaa represents Q, or Q deamidated to glutamic acid (alpha-glutamic acid), gamma-glutamic acid (Glu), or a blend of alpha- and gamma-glutamic acid <220><221> MISC_FEATURE <222> .. <223> Xaa may be Asn, or deamidated to Asp, isoAsp, or Asp/isoAsp <220><221> MISC_FEATURE <222> .. <223> Xaa represents D (Asp, aspartic acid) or amindated D to N (Asn, asparagine) <220><221> MISC_FEATURE <222> .. <223> Xaa may be Asn, or deamidated to Asp, isoAsp, or Asp/isoAsp <220><221> MISC_FEATURE <222> .. <223> Xaa may be W (Trp, tryptophan), or oxidated W (e.g., kynurenine).<220><221> MISC_FEATURE <222> .. <223> Xaa may be Asn, or deamidated to Asp, isoAsp, or Asp/isoAsp <220><221> MISC_FEATURE <222> .. <223> Xaa may be Asn, or deamidated to Asp, isoAsp, or Asp/isoAsp <220><221> MISC_FEATURE <222> .. <223> Xaa may be Asn, or deamidated to Asp, isoAsp, or Asp/isoAsp <220><221> MISC_FEATURE <222> .. <223> Xaa may be K (lys, lysine), or acetylated K <220><221> MISC_FEATURE <222> .. <223> Xaa may be Asn, or deamidated to Asp, isoAsp, or Asp/isoAsp <220><221> MISC_FEATURE <222> .. <223> Xaa may be D (asp, aspartic acid), or isomerized D. <220><221> MISC_FEATURE <222> .. <223> Xaa may be M (Met, Methionine), or oxidated M. <220><221> MISC_FEATURE <222> .. <223> Xaa may be Asn, or deamidated to Asp, isoAsp, or Asp/isoAsp <220><221> MISC_FEATURE <222> .. <223> Xaa may be M (Met, Methionine), or oxidated M. <220><221> MISC_FEATURE <222> .. <223> Xaa may be Asn, or deamidated to Asp, isoAsp, or Asp/isoAsp <220><221> MISC_FEATURE <222> ..<223> Xaa may be Asn, or deamidated to Asp, isoAsp, or Asp/isoAsp <220><221> MISC_FEATURE <222> .. <223> Xaa may be S (Ser, serine), or Phosphorylated S <220><221> MISC_FEATURE <222> .. <223> Xaa may be Asn, or deamidated to Asp, isoAsp, or Asp/isoAsp <220><221> MISC_FEATURE <222> .. <223> Xaa may be Asn, or deamidated to Asp, isoAsp, or Asp/isoAsp <220><221> MISC_FEATURE <222> .. <223> Xaa may be M (Met, Methionine), or oxidated M. <220><221> MISC_FEATURE <222> .. <223> Xaa may be M (Met, Methionine), or oxidated M. <220><221> MISC_FEATURE <222> .. <223> Xaa may be M (Met, Methionine), or oxidated M. <220><221> MISC_FEATURE <222> .. <223> Xaa may be T (Thr, threonine), or Phosphorylated T <220><221> MISC_FEATURE <222> .. <223> Xaa may be S (Ser, serine), or Phosphorylated S <220><221> MISC_FEATURE <222> .. <223> Xaa represents Q, or Q deamidated to glutamic acid (alpha-glutamic acid), gamma-glutamic acid (Glu), or a blend of alpha- and gamma-glutamic acid <220><221> MISC_FEATURE <222> ..<223> Xaa may be M (Met, Methionine), or oxidated M. <220><221> MISC_FEATURE <222> .. <223> Xaa may be W (Trp, tryptophan), or oxidated W (e.g., kynurenine). <220><221> MISC_FEATURE <222> .. <223> Xaa may be Asn, or deamidated to Asp, isoAsp, or Asp/isoAsp <220><221> MISC_FEATURE <222> .. <223> Xaa may be M (Met, Methionine), or oxidated M. <220><221> MISC_FEATURE <222> .. <223> Xaa may be Asn, or deamidated to Asp, isoAsp, or Asp/isoAsp <220><221> MISC_FEATURE <222> .. <223> Xaa may be Asn, or deamidated to Asp, isoAsp, or Asp/isoAsp <220><221> MISC_FEATURE <222> .. <223> Xaa may be K (lys, lysine), or acetylated K <220><221> MISC_FEATURE <222> .. <223> Xaa may be K (lys, lysine), or acetylated K <220><221> MISC_FEATURE <222> .. <223> Xaa may be K (lys, lysine), or acetylated K <220><221> MISC_FEATURE <222> .. <223> Xaa may be W (Trp, tryptophan), or oxidated W. <220><221> MISC_FEATURE <222> .. <223> Xaa may be Asn, or deamidated to Asp, isoAsp, or Asp/isoAsp <220><221> MISC_FEATURE <222> ..<223> Xaa may be Asn, or deamidated to Asp, isoAsp, or Asp/isoAsp <400> 8 Met Ala Ala Asp Gly Tyr Leu Pro Asp Trp Leu Glu Asp Asn Leu Ser 1 5 10 15 Glu Gly Ile Arg Glu Trp Xaa Ala Leu Lys Pro Gly Ala Pro Gln Pro 20 25 30 Lys Ala Xaa Gln Gln His Gln Asp Asn Ala Arg Gly Leu Val Leu Pro 35 40 45 Gly Tyr Lys Tyr Leu Gly Pro Gly Xaa Gly Leu Asp Lys Gly Glu Pro 50 55 60 Val Xaa Glu Ala Asp Ala Ala Ala Leu Glu His Asp Lys Ala Tyr Asp 65 70 75 80 Gln Gln Leu Lys Ala Gly Asp Asn Pro Tyr Leu Lys Tyr Xaa His Ala 85 90 95 Xaa Ala Glu Phe Gln Glu Arg Leu Lys Glu Xaa Thr Ser Phe Gly Gly 100 105 110 Xaa Leu Gly Arg Ala Val Phe Gln Ala Lys Lys Arg Leu Leu Glu Pro 115 120 125 Leu Gly Leu Val Glu Glu Ala Ala Lys Thr Ala Pro Gly Lys Lys Arg 130 135 140 Pro Val Glu Gln Xaa Pro Gln Glu Pro Asp Ser Ser Val Gly Ile Gly 145 150 155 160 Lys Ser Gly Ala Gln Pro Ala Lys Lys Arg Leu Asn Phe Gly Gln Thr 165 170 175 Gly Asp Thr Glu Ser Val Pro Asp Pro Gln Pro Ile Gly Glu Pro Pro 180 185 190 Ala Ala Pro Ser Gly Val Gly Ser Leu Thr Met Ala Ser Gly Gly Gly 195 200 205 Ala Pro Val Ala Asp Asn Asn Glu Gly Ala Asp Gly Val Gly Ser Ser 210 215 220 Ser Gly Asn Trp His Cys Asp Ser Gln Trp Leu Gly Asp Arg Val Ile 225 230 235 240 Thr Thr Ser Thr Arg Thr Xaa Ala Leu Pro Thr Tyr Xaa Asn His Leu 245 250 255 Tyr Lys Xaa Ile Ser Asn Ser Thr Ser Gly Gly Ser Ser Xaa Asp Asn 260 265 270 Ala Tyr Phe Gly Tyr Ser Thr Pro Trp Gly Tyr Phe Asp Phe Asn Arg 275 280 285 Phe His Cys His Phe Ser Pro Arg Xaa Trp Gln Arg Leu Ile Asn Xaa 290 295 300 Asn Xaa Gly Phe Arg Pro Lys Arg Leu Xaa Phe Lys Leu Phe Xaa Ile 305 310 315 320 Gln Val Lys Glu Val Thr Asp Asn Xaa Gly Val Xaa Thr Ile Ala Xaa 325 330 335 Asn Leu Thr Ser Thr Val Gln Val Phe Thr Asp Ser Asp Tyr Gln Leu 340 345 350 Pro Tyr Val Leu Gly Ser Ala His Glu Gly Cys Leu Pro Pro Phe Pro 355 360 365 Ala Asp Val Phe Met Ile Pro Gln Tyr Gly Tyr Leu Thr Leu Asn Xaa 370 375 380 Gly Ser Gln Ala Val Gly Arg Ser Ser Phe Tyr Cys Leu Glu Tyr Phe 385 390 395 400 Pro Ser Gln Xaa Leu Arg Thr Gly Xaa Asn Phe Gln Phe Ser Tyr Glu 405 410 415 Phe Glu Asn Val Pro Phe His Ser Ser Tyr Ala His Ser Gln Ser Leu 420 425 430 Asp Arg Leu Xaa Asn Pro Leu Ile Asp Gln Tyr Leu Tyr Tyr Leu Ser 435 440 445 Lys Thr Ile Xaa Gly Ser Gly Gln Asn Gln Gln Thr Leu Lys Phe Ser 450 455 460 Val Ala Gly Pro Ser Asn Met Ala Val Gln Gly Arg Xaa Tyr Ile Pro 465 470 475 480 Gly Pro Ser Tyr Arg Gln Gln Arg Val Ser Thr Thr Val Thr Gln Asn 485 490 495 Asn Asn Xaa Glu Phe Ala Trp Pro Gly Ala Ser Ser Trp Ala Leu Xaa 500 505 510 Gly Arg Xaa Ser Leu Xaa Asn Pro Gly Pro Ala Xaa Ala Ser His Lys 515 520 525 Glu Gly Glu Asp Arg Phe Phe Pro Leu Ser Gly Ser Leu Ile Phe Gly 530 535 540 Lys Gln Gly Thr Gly Arg Asp Asn Val Asp Ala Asp Lys Val Xaa Ile 545 550 555 560 Thr Asn Glu Glu Glu Ile Lys Thr Xaa Asn Pro Val Ala Thr Glu Ser 565 570 575 Tyr Gly Gln Val Ala Thr Asn His Gln Xaa Ala Gln Ala Gln Ala Gln 580 585 590 Thr Gly Trp Val Gln Asn Gln Gly Ile Leu Pro Gly Xaa Val Trp Gln 595 600 605 Asp Arg Asp Val Tyr Leu Gln Gly Pro Ile Xaa Ala Lys Ile Pro His 610 615 620 Thr Asp Gly Xaa Phe His Pro Ser Pro Leu Met Gly Gly Phe Gly Xaa 625 630 635 640 Lys His Pro Pro Pro Gln Ile Leu Ile Lys Xaa Thr Pro Val Pro Ala 645 650 655 Asp Pro Pro Thr Ala Phe Xaa Lys Asp Xaa Leu Asn Ser Phe Ile Thr 660 665 670 Gln Tyr Ser Thr Gly Gln Val Ser Val Glu Ile Glu Trp Glu Leu Gln 675 680 685 Xaa Glu Asn Ser Xaa Arg Xaa Asn Pro Glu Ile Gln Tyr Thr Ser Asn 690 695 700 Tyr Tyr Lys Ser Xaa Asn Val Glu Phe Ala Val Asn Thr Glu Gly Val 705 710 715 720 Tyr Ser Glu Pro Arg Pro Ile Gly Thr Arg Tyr Leu Thr Arg Xaa Leu 725 730 735 <210> 9 <211> 2211 <212> DNA <213> Artificial Sequence <220><223> AAV9 vp1 coding sequence <400> 9 atggctgccg atggttatct tccagattgg ctcgaggaca accttagtga aggaattcgc 60 gagtggtggg ctttgaaacc tggagcccct caacccaagg caaatcaaca acatcaagac 120 aacgctcgag gtcttgtgct tccgggttac aaataccttg gacccggcaa cggactcgac 180 aagggggagc cggtcaacgc agcagacgcg gcggccctcg agcacgacaa ggcctacgac 240 cagcagctca aggccggaga caacccgtac ctcaagtaca accacgccga cgccgagttc 300 caggagcggc tcaaagaaga tacgtctttt gggggcaacc tcgggcgagc agtcttccag 360 gccaaaaaga ggcttcttga acctcttggt ctggttgagg aagcggctaa gacggctcct 420 ggaaagaaga ggcctgtaga gcagtctcct caggaaccgg actcctccgc gggtattggc 480 aaatcgggtg cacagcccgc taaaaagaga ctcaatttcg gtcagactgg cgacacagag 540 tcagtcccag accctcaacc aatcggagaa cctcccgcag ccccctcagg tgtgggatct 600 cttacaatgg cttcaggtgg tggcgcacca gtggcagaca ataacgaagg tgccgatgga 660 gtgggtagtt cctcgggaaa ttggcattgc gattcccaat ggctggggga cagagtcatc 720 accaccagca cccgaacctg ggccctgccc acctacaaca atcacctcta caagcaaatc 780 tccaacagca catctggagg atcttcaaat gacaacgcct acttcggcta cagcaccccc 840 tgggggtatt ttgacttcaa cagattccac tgccacttct caccacgtga ctggcagcga 900 ctcatcaaca acaactgggg attccggcct aagcgactca acttcaagct cttcaacatt 960 caggtcaaag aggttacgga caacaatgga gtcaagacca tcgccaataa ccttaccagc 1020 acggtccagg tcttcacgga ctcagactat cagctcccgt acgtgctcgg gtcggctcac 1080 gagggctgcc tcccgccgtt cccagcggac gttttcatga ttcctcagta cgggtatctg 1140 acgcttaatg atggaagcca ggccgtgggt cgttcgtcct tttactgcct ggaatatttc 1200 ccgtcgcaaa tgctaagaac gggtaacaac ttccagttca gctacgagtt tgagaacgta 1260 cctttccata gcagctacgc tcacagccaa agcctggacc gactaatgaa tccactcatc 1320 gaccaatact tgtactatct ctcaaagact attaacggtt ctggacagaa tcaacaaacg 1380 ctaaaattca gtgtggccgg acccagcaac atggctgtcc agggaagaaa ctacatacct 1440ggacccagct accgacaaca acgtgtctca accactgtga ctcaaaacaa caacagcgaa 1500 tttgcttggc ctggagcttc ttcttgggct ctcaatggac gtaatagctt gatgaatcct 1560 ggacctgcta tggccagcca caaagaagga gaggaccgtt tctttccttt gtctggatct 1620 ttaatttttg gcaaacaagg aactggaaga gacaacgtgg atgcggacaa agtcatgata 1680 accaacgaag aagaaattaa aactactaac ccggtagcaa cggagtccta tggacaagtg 1740 gccacaaacc accagagtgc ccaagcacag gcgcagaccg gctgggttca aaaccaagga 1800 atacttccgg gtatggtttg gcaggacaga gatgtgtacc tgcaaggacc catttgggcc 1860 aaaattcctc acacggacgg caactttcac ccttctccgc tgatgggagg gtttggaatg 1920 aagcacccgc ctcctcagat cctcatcaaa aacacacctg tacctgcgga tcctccaacg 1980 gccttcaaca aggacaagct gaactctttc atcacccagt attctactgg ccaagtcagc 2040 gtggagatcg agtgggagct gcagaaggaa aacagcaagc gctggaaccc ggagatccag 2100 tacacttcca actattacaa gtctaataat gttgaatttg ctgttaatac tgaaggtgta 2160 tatagtgaac cccgccccat tggcaccaga tacctgactc gtaatctgta a 2211 <210> 10 <211> 736 <212> PRT <213> Artificial Sequence <220><223> Encoded AAV9 vp1 amino acid sequence <400> 10 Met Ala Ala Asp Gly Tyr Leu Pro Asp Trp Leu Glu Asp Asn Leu Ser 1 5 10 15 Glu Gly Ile Arg Glu Trp Trp Ala Leu Lys Pro Gly Ala Pro Gln Pro 20 25 30 Lys Ala Asn Gln Gln His Gln Asp Asn Ala Arg Gly Leu Val Leu Pro 35 40 45 Gly Tyr Lys Tyr Leu Gly Pro Gly Asn Gly Leu Asp Lys Gly Glu Pro 50 55 60 Val Asn Ala Ala Asp Ala Ala Ala Leu Glu His Asp Lys Ala Tyr Asp 65 70 75 80 Gln Gln Leu Lys Ala Gly Asp Asn Pro Tyr Leu Lys Tyr Asn His Ala 85 90 95 Asp Ala Glu Phe Gln Glu Arg Leu Lys Glu Asp Thr Ser Phe Gly Gly 100 105 110 Asn Leu Gly Arg Ala Val Phe Gln Ala Lys Lys Arg Leu Leu Glu Pro 115 120 125 Leu Gly Leu Val Glu Glu Ala Ala Lys Thr Ala Pro Gly Lys Lys Arg 130 135 140 Pro Val Glu Gln Ser Pro Gln Glu Pro Asp Ser Ser Ala Gly Ile Gly 145 150 155 160 Lys Ser Gly Ala Gln Pro Ala Lys Lys Arg Leu Asn Phe Gly Gln Thr 165 170 175 Gly Asp Thr Glu Ser Val Pro Asp Pro Gln Pro Ile Gly Glu Pro Pro 180 185 190 Ala Ala Pro Ser Gly Val Gly Ser Leu Thr Met Ala Ser Gly Gly Gly 195 200 205 Ala Pro Val Ala Asp Asn Asn Glu Gly Ala Asp Gly Val Gly Ser Ser 210 215 220 Ser Gly Asn Trp His Cys Asp Ser Gln Trp Leu Gly Asp Arg Val Ile 225 230 235 240 Thr Thr Ser Thr Arg Thr Trp Ala Leu Pro Thr Tyr Asn Asn His Leu 245 250 255 Tyr Lys Gln Ile Ser Asn Ser Thr Ser Gly Gly Ser Ser Asn Asp Asn 260 265 270 Ala Tyr Phe Gly Tyr Ser Thr Pro Trp Gly Tyr Phe Asp Phe Asn Arg 275 280 285 Phe His Cys His Phe Ser Pro Arg Asp Trp Gln Arg Leu Ile Asn Asn 290 295 300 Asn Trp Gly Phe Arg Pro Lys Arg Leu Asn Phe Lys Leu Phe Asn Ile 305 310 315 320 Gln Val Lys Glu Val Thr Asp Asn Asn Gly Val Lys Thr Ile Ala Asn 325 330 335 Asn Leu Thr Ser Thr Val Gln Val Phe Thr Asp Ser Asp Tyr Gln Leu 340 345 350 Pro Tyr Val Leu Gly Ser Ala His Glu Gly Cys Leu Pro Pro Phe Pro 355 360 365 Ala Asp Val Phe Met Ile Pro Gln Tyr Gly Tyr Leu Thr Leu Asn Asp 370 375 380 Gly Ser Gln Ala Val Gly Arg Ser Ser Phe Tyr Cys Leu Glu Tyr Phe 385 390 395 400 Pro Ser Gln Met Leu Arg Thr Gly Asn Asn Phe Gln Phe Ser Tyr Glu 405 410 415 Phe Glu Asn Val Pro Phe His Ser Ser Tyr Ala His Ser Gln Ser Leu 420 425 430 Asp Arg Leu Met Asn Pro Leu Ile Asp Gln Tyr Leu Tyr Tyr Leu Ser 435 440 445 Lys Thr Ile Asn Gly Ser Gly Gln Asn Gln Gln Thr Leu Lys Phe Ser 450 455 460 Val Ala Gly Pro Ser Asn Met Ala Val Gln Gly Arg Asn Tyr Ile Pro 465 470 475 480 Gly Pro Ser Tyr Arg Gln Gln Arg Val Ser Thr Thr Val Thr Gln Asn 485 490 495 Asn Asn Ser Glu Phe Ala Trp Pro Gly Ala Ser Ser Trp Ala Leu Asn 500 505 510 Gly Arg Asn Ser Leu Met Asn Pro Gly Pro Ala Met Ala Ser His Lys 515 520 525 Glu Gly Glu Asp Arg Phe Phe Pro Leu Ser Gly Ser Leu Ile Phe Gly 530 535 540 Lys Gln Gly Thr Gly Arg Asp Asn Val Asp Ala Asp Lys Val Met Ile 545 550 555 560 Thr Asn Glu Glu Glu Ile Lys Thr Thr Asn Pro Val Ala Thr Glu Ser 565 570 575 Tyr Gly Gln Val Ala Thr Asn His Gln Ser Ala Gln Ala Gln Ala Gln 580 585 590 Thr Gly Trp Val Gln Asn Gln Gly Ile Leu Pro Gly Met Val Trp Gln 595 600 605 Asp Arg Asp Val Tyr Leu Gln Gly Pro Ile Trp Ala Lys Ile Pro His 610 615 620 Thr Asp Gly Asn Phe His Pro Ser Pro Leu Met Gly Gly Phe Gly Met 625 630 635 640 Lys His Pro Pro Pro Gln Ile Leu Ile Lys Asn Thr Pro Val Pro Ala 645 650 655 Asp Pro Pro Thr Ala Phe Asn Lys Asp Lys Leu Asn Ser Phe Ile Thr 660 665 670 Gln Tyr Ser Thr Gly Gln Val Ser Val Glu Ile Glu Trp Glu Leu Gln 675 680 685 Lys Glu Asn Ser Lys Arg Trp Asn Pro Glu Ile Gln Tyr Thr Ser Asn 690 695 700 Tyr Tyr Lys Ser Asn Asn Val Glu Phe Ala Val Asn Thr Glu Gly Val 705 710 715 720 Tyr Ser Glu Pro Arg Pro Ile Gly Thr Arg Tyr Leu Thr Arg Asn Leu 725 730 735 <210> 11 <211> 2211 <212> DNA <213> Artificial Sequence <220><223> AAVhu31 vp1 coding sequence <400> 11 atggctgccg atggttatct tccagattgg ctcgaggaca accttagtga aggaattcgc 60 gagtggtggg ctttgaaacc tggagcccct caacccaagg caaatcaaca acatcaagac 120 aacgctcgag gtcttgtgct tccgggttac aaataccttg gacccggcaa cggactcgac 180 aagggggagc cggtcaacgc agcagacgcg gcggccctcg agcacgacaa ggcctacgac 240 cagcagctca aggccggaga caacccgtac ctcaagtaca accacgccga cgccgagttc 300 caggagcggc tcaaagaaga tacgtctttt gggggcaacc tcgggcgagc agtcttccag 360 gccaaaaaga ggcttcttga acctcttggt ctggttgagg aagcggctaa gacggctcct 420ggaaagaaga ggcctgtaga gcagtctcct caggaaccgg actcctccgc gggtattggc 480 aaatcgggtg cacagcccgc taaaaagaga ctcaatttcg gtcagactgg cgacacagag 540 tcagtcccag accctcaacc aatcggagaa cctcccgcag ccccctcagg tgtgggatct 600 cttacaatgg cttcaggtgg tggcgcacca gtggcagaca ataacgaagg tgccgatgga 660 gtgggtagtt cctcgggaaa ttggcattgc gattcccaat ggctggggga cagagtcatc 720 accaccagca cccgaacctg ggccctgccc acctacaaca atcacctcta caagcaaatc 780 tccaacagca catctggagg atcttcaaat gacaacgcct acttcggcta cagcaccccc 840 tgggggtatt ttgacttcaa cagattccac tgccacttct caccacgtga ctggcagcga 900 ctcatcaaca acaactgggg attccggcct aagcgactca acttcaagct cttcaacatt 960 caggtcaaag aggttacgga caacaatgga gtcaagacca tcgccaataa ccttaccagc 1020 acggtccagg tcttcacgga ctcagactat cagctcccgt acgtgctcgg gtcggctcac 1080 gagggctgcc tcccgccgtt cccagcggac gttttcatga ttcctcagta cgggtatctg 1140 acgcttaatg atggaagcca ggccgtgggt cgttcgtcct tttactgcct ggaatatttc 1200 ccgtcgcaaa tgctaagaac gggtaacaac ttccagttca gctacgagtt tgagaacgta 1260 cctttccata gcagctacgc tcacagccaa agcctggacc gactaatgaa tccactcatc 1320 gaccaatact tgtactatct ctcaaagact attaacggtt ctggacagaa tcaacaaacg 1380 ctaaaattca gtgtggccgg acccagcaac atggctgtcc agggaagaaa ctacatacct 1440 ggacccagct accgacaaca acgtgtctca accactgtga ctcaaaacaa caacagcgaa 1500 tttgcttggc ctggagcttc ttcttgggct ctcaatggac gtaatagctt gatgaatcct 1560 ggacctgcta tggccagcca caaagaagga gaggaccgtt tctttccttt gtctggatct 1620 ttaatttttg gcaaacaagg aactggaaga gacaacgtgg atgcggacaa agtcatgata 1680 accaacgaag aagaaattaa aactactaac ccggtagcaa cggagtccta tggacaagtg 1740 gccacaaacc accagagtgc ccaagcacag gcgcagaccg gctgggttca aaaccaagga 1800 atacttccgg gtatggtttg gcaggacaga gatgtgtacc tgcaaggacc catttgggcc 1860 aaaattcctc acacggacgg caactttcac ccttctccgc tgatgggagg gtttggaatg 1920 aagcacccgc ctcctcagat cctcatcaaa aacacacctg tacctgcgga tcctccaacg 1980 gccttcaaca aggacaagct gaactctttc atcacccagt attctactgg ccaagtcagc 2040 gtggagatcg agtgggagct gcagaaggaa aacagcaagc gctggaaccc ggagatccag 2100 tacacttcca actattacaa gtctaataat gttgaatttg ctgttaatac tgaaggtgta 2160 tatagtgaac cccgccccat tggcaccaga tacctgactc gtaatctgta a 2211 <210> 12<211> 736 <212> PRT <213> Artificial Sequence <220><223> Encoded AAVhu31 vp1 amino acid sequence <400> 12 Met Ala Ala Asp Gly Tyr Leu Pro Asp Trp Leu Glu Asp Thr Leu Ser 1 5 10 15 Glu Gly Ile Arg Gln Trp Trp Lys Leu Lys Pro Gly Pro Pro Pro Pro 20 25 30 Lys Pro Ala Glu Arg His Lys Asp Asp Ser Arg Gly Leu Val Leu Pro 35 40 45 Gly Tyr Lys Tyr Leu Gly Pro Gly Asn Gly Leu Asp Lys Gly Glu Pro 50 55 60 Val Asn Ala Ala Asp Ala Ala Ala Leu Glu His Asp Lys Ala Tyr Asp 65 70 75 80 Gln Gln Leu Lys Ala Gly Asp Asn Pro Tyr Leu Lys Tyr Asn His Ala 85 90 95 Asp Ala Glu Phe Gln Glu Arg Leu Lys Glu Asp Thr Ser Phe Gly Gly 100 105 110 Asn Leu Gly Arg Ala Val Phe Gln Ala Lys Lys Arg Leu Leu Glu Pro 115 120 125 Leu Gly Leu Val Glu Glu Ala Ala Lys Thr Ala Pro Gly Lys Lys Arg 130 135 140 Pro Val Glu Gln Ser Pro Gln Glu Pro Asp Ser Ser Ala Gly Ile Gly 145 150 155 160 Lys Ser Gly Ser Gln Pro Ala Lys Lys Lys Leu Asn Phe Gly Gln Thr 165 170 175 Gly Asp Thr Glu Ser Val Pro Asp Pro Gln Pro Ile Gly Glu Pro Pro 180 185 190 Ala Ala Pro Ser Gly Val Gly Ser Leu Thr Met Ala Ser Gly Gly Gly 195 200 205 Ala Pro Val Ala Asp Asn Asn Glu Gly Ala Asp Gly Val Gly Ser Ser 210 215 220 Ser Gly Asn Trp His Cys Asp Ser Gln Trp Leu Gly Asp Arg Val Ile 225 230 235 240 Thr Thr Ser Thr Arg Thr Trp Ala Leu Pro Thr Tyr Asn Asn His Leu 245 250 255 Tyr Lys Gln Ile Ser Asn Ser Thr Ser Gly Gly Ser Ser Asn Asp Asn 260 265 270 Ala Tyr Phe Gly Tyr Ser Thr Pro Trp Gly Tyr Phe Asp Phe Asn Arg 275 280 285 Phe His Cys His Phe Ser Pro Arg Asp Trp Gln Arg Leu Ile Asn Asn 290 295 300 Asn Trp Gly Phe Arg Pro Lys Arg Leu Asn Phe Lys Leu Phe Asn Ile 305 310 315 320 Gln Val Lys Glu Val Thr Asp Asn Asn Gly Val Lys Thr Ile Ala Asn 325 330 335 Asn Leu Thr Ser Thr Val Gln Val Phe Thr Asp Ser Asp Tyr Gln Leu 340 345 350 Pro Tyr Val Leu Gly Ser Ala His Glu Gly Cys Leu Pro Pro Phe Pro 355 360 365 Ala Asp Val Phe Met Ile Pro Gln Tyr Gly Tyr Leu Thr Leu Asn Asp 370 375 380 Gly Gly Gln Ala Val Gly Arg Ser Ser Phe Tyr Cys Leu Glu Tyr Phe 385 390 395 400 Pro Ser Gln Met Leu Arg Thr Gly Asn Asn Phe Gln Phe Ser Tyr Glu 405 410 415 Phe Glu Asn Val Pro Phe His Ser Ser Tyr Ala His Ser Gln Ser Leu 420 425 430 Asp Arg Leu Met Asn Pro Leu Ile Asp Gln Tyr Leu Tyr Tyr Leu Ser 435 440 445 Lys Thr Ile Asn Gly Ser Gly Gln Asn Gln Gln Thr Leu Lys Phe Ser 450 455 460 Val Ala Gly Pro Ser Asn Met Ala Val Gln Gly Arg Asn Tyr Ile Pro 465 470 475 480 Gly Pro Ser Tyr Arg Gln Gln Arg Val Ser Thr Thr Val Thr Gln Asn 485 490 495 Asn Asn Ser Glu Phe Ala Trp Pro Gly Ala Ser Ser Trp Ala Leu Asn 500 505 510 Gly Arg Asn Ser Leu Met Asn Pro Gly Pro Ala Met Ala Ser His Lys 515 520 525 Glu Gly Glu Asp Arg Phe Phe Pro Leu Ser Gly Ser Leu Ile Phe Gly 530 535 540 Lys Gln Gly Thr Gly Arg Asp Asn Val Asp Ala Asp Lys Val Met Ile 545 550 555 560 Thr Asn Glu Glu Glu Ile Lys Thr Thr Asn Pro Val Ala Thr Glu Ser 565 570 575 Tyr Gly Gln Val Ala Thr Asn His Gln Ser Ala Gln Ala Gln Ala Gln 580 585 590 Thr Gly Trp Val Gln Asn Gln Gly Ile Leu Pro Gly Met Val Trp Gln 595 600 605 Asp Arg Asp Val Tyr Leu Gln Gly Pro Ile Trp Ala Lys Ile Pro His 610 615 620 Thr Asp Gly Asn Phe His Pro Ser Pro Leu Met Gly Gly Phe Gly Met 625 630 635 640 Lys His Pro Pro Pro Gln Ile Leu Ile Lys Asn Thr Pro Val Pro Ala 645 650 655 Asp Pro Pro Thr Ala Phe Asn Lys Asp Lys Leu Asn Ser Phe Ile Thr 660 665 670 Gln Tyr Ser Thr Gly Gln Val Ser Val Glu Ile Glu Trp Glu Leu Gln 675 680 685 Lys Glu Asn Ser Lys Arg Trp Asn Pro Glu Ile Gln Tyr Thr Ser Asn 690 695 700 Tyr Tyr Lys Ser Asn Asn Val Glu Phe Ala Val Ser Thr Glu Gly Val 705 710 715 720 Tyr Ser Glu Pro Arg Pro Ile Gly Thr Arg Tyr Leu Thr Arg Asn Leu 725 730 735 <210> 13 <211> 2211 <212> DNA <213> Artificial Sequence <220><223> AAVhu32 vp1 coding sequence <400> 13 atggctgccg atggttatct tccagattgg ctcgaggaca ctctctctga aggaataaga 60 cagtggtgga agctcaaacc tggcccacca ccaccaaagc ccgcagagcg gcataaggac 120 gacagcaggg gtcttgtgct tcctgggtac aagtacctcg gacccggcaa cggactcgac 180 aagggggagc cggtcaacgc agcagacgcg gcggccctcg agcacgacaa ggcctacgac 240 cagcagctca aggccggaga caacccgtac ctcaagtaca accacgccga cgccgagttc 300 caggagcggc tcaaagaaga tacgtctttt gggggcaacc tcgggcgagc agtcttccag 360 gccaaaaaga ggcttcttga acctcttggt ctggttgagg aagcggctaa gacggctcct 420 ggaaagaaga ggcctgtaga gcagtctcct caggaaccgg actcctccgc gggtattggc 480 aaatcgggtt cacagcccgc taaaaagaaa ctcaatttcg gtcagactgg cgacacagag 540 tcagtccccg accctcaacc aatcggagaa cctcccgcag ccccctcagg tgtgggatct 600 cttacaatgg cttcaggtgg tggcgcacca gtggcagaca ataacgaagg tgccgatgga 660 gtgggtagtt cctcgggaaa ttggcattgc gattcccaat ggctggggga cagagtcatc 720 accaccagca cccgaacctg ggccctgccc acctacaaca atcacctcta caagcaaatc 780 tccaacagca catctggagg atcttcaaat gacaacgcct acttcggcta cagcaccccc 840 tgggggtatt ttgacttcaa cagattccac tgccacttct caccacgtga ctggcagcga 900 ctcatcaaca acaactgggg attccggcct aagcgactca acttcaagct cttcaacatt 960 caggtcaaag aggttacgga caacaatgga gtcaagacca tcgccaataa ccttaccagc 1020 acggtccagg tcttcacgga ctcagactat cagctcccgt acgtgctcgg gtcggctcac 1080 gagggctgcc tcccgccgtt cccagcggac gttttcatga ttcctcagta cgggtatctg 1140 acgcttaatg atgggagcca ggccgtgggt cgttcgtcct tttactgcct ggaatatttc 1200 ccgtcgcaaa tgctaagaac gggtaacaac ttccagttca gctacgagtt tgagaacgta 1260cctttccata gcagctacgc tcacagccaa agcctggacc gactaatgaa tccactcatc 1320 gaccaatact tgtactatct ctcaaagact attaacggtt ctggacagaa tcaacaaacg 1380 ctaaaattca gcgtggccgg acccagcaac atggctgtcc agggaagaaa ctacatacct 1440 ggacccagct accgacaaca acgtgtctca accactgtga ctcaaaacaa caacagcgaa 1500 tttgcttggc ctggagcttc ttcttgggct ctcaatggac gtaatagctt gatgaatcct 1560 ggacctgcta tggccagcca caaagaagga gaggaccgtt tctttccttt gtctggatct 1620 ttaatttttg gcaaacaagg aactggaaga gacaacgtgg atgcggacaa agtcatgata 1680 accaacgaag aagaaattaa aactactaac ccggtagcaa cggagtccta tggacaagtg 1740 gccacaaacc accagagtgc ccaagcacag gcgcagaccg gctgggttca aaaccaagga 1800 atacttccgg gtatggtttg gcaggacaga gatgtgtacc tgcaaggacc catttgggcc 1860 aaaattcctc acacggacgg caactttcac ccttctccgc taatgggagg gtttggaatg 1920 aagcacccgc ctcctcagat cctcatcaaa aacacacctg tacctgcgga tcctccaacg 1980 gctttcaata aggacaagct gaactctttc atcacccagt attctactgg ccaagtcagc 2040 gtggagattg agtgggagct gcagaaggaa aacagcaagc gctggaaccc ggagatccag 2100 tacacttcca actattacaa gtctaataat gttgaatttg ctgttaatac tgaaggtgta 2160 tatagtgaac cccgccccat tggcaccaga tacctgactc gtaatctgta a 2211 <210> 14 <211> 736 <212> PRT <213> Artificial Sequence <220><223> Encoded AAVhu32 vp1 amino acid sequence <400> 14 Met Ala Ala Asp Gly Tyr Leu Pro Asp Trp Leu Glu Asp Thr Leu Ser 1 5 10 15 Glu Gly Ile Arg Gln Trp Trp Lys Leu Lys Pro Gly Pro Pro Pro Pro 20 25 30 Lys Pro Ala Glu Arg His Lys Asp Asp Ser Arg Gly Leu Val Leu Pro 35 40 45 Gly Tyr Lys Tyr Leu Gly Pro Gly Asn Gly Leu Asp Lys Gly Glu Pro 50 55 60 Val Asn Ala Ala Asp Ala Ala Ala Leu Glu His Asp Lys Ala Tyr Asp 65 70 75 80 Gln Gln Leu Lys Ala Gly Asp Asn Pro Tyr Leu Lys Tyr Asn His Ala 85 90 95 Asp Ala Glu Phe Gln Glu Arg Leu Lys Glu Asp Thr Ser Phe Gly Gly 100 105 110 Asn Leu Gly Arg Ala Val Phe Gln Ala Lys Lys Arg Leu Leu Glu Pro 115 120 125 Leu Gly Leu Val Glu Glu Ala Ala Lys Thr Ala Pro Gly Lys Lys Arg 130 135 140 Pro Val Glu Gln Ser Pro Gln Glu Pro Asp Ser Ser Ala Gly Ile Gly 145 150 155 160 Lys Ser Gly Ser Gln Pro Ala Lys Lys Lys Leu Asn Phe Gly Gln Thr 165 170 175 Gly Asp Thr Glu Ser Val Pro Asp Pro Gln Pro Ile Gly Glu Pro Pro 180 185 190 Ala Ala Pro Ser Gly Val Gly Ser Leu Thr Met Ala Ser Gly Gly Gly 195 200 205 Ala Pro Val Ala Asp Asn Asn Glu Gly Ala Asp Gly Val Gly Ser Ser 210 215 220 Ser Gly Asn Trp His Cys Asp Ser Gln Trp Leu Gly Asp Arg Val Ile 225 230 235 240 Thr Thr Ser Thr Arg Thr Trp Ala Leu Pro Thr Tyr Asn Asn His Leu 245 250 255 Tyr Lys Gln Ile Ser Asn Ser Thr Ser Gly Gly Ser Ser Asn Asp Asn 260 265 270 Ala Tyr Phe Gly Tyr Ser Thr Pro Trp Gly Tyr Phe Asp Phe Asn Arg 275 280 285 Phe His Cys His Phe Ser Pro Arg Asp Trp Gln Arg Leu Ile Asn Asn 290 295 300 Asn Trp Gly Phe Arg Pro Lys Arg Leu Asn Phe Lys Leu Phe Asn Ile 305 310 315 320 Gln Val Lys Glu Val Thr Asp Asn Asn Gly Val Lys Thr Ile Ala Asn 325 330 335 Asn Leu Thr Ser Thr Val Gln Val Phe Thr Asp Ser Asp Tyr Gln Leu 340 345 350 Pro Tyr Val Leu Gly Ser Ala His Glu Gly Cys Leu Pro Pro Phe Pro 355 360 365 Ala Asp Val Phe Met Ile Pro Gln Tyr Gly Tyr Leu Thr Leu Asn Asp 370 375 380 Gly Ser Gln Ala Val Gly Arg Ser Ser Phe Tyr Cys Leu Glu Tyr Phe 385 390 395 400 Pro Ser Gln Met Leu Arg Thr Gly Asn Asn Phe Gln Phe Ser Tyr Glu 405 410 415 Phe Glu Asn Val Pro Phe His Ser Ser Tyr Ala His Ser Gln Ser Leu 420 425 430 Asp Arg Leu Met Asn Pro Leu Ile Asp Gln Tyr Leu Tyr Tyr Leu Ser 435 440 445 Lys Thr Ile Asn Gly Ser Gly Gln Asn Gln Gln Thr Leu Lys Phe Ser 450 455 460 Val Ala Gly Pro Ser Asn Met Ala Val Gln Gly Arg Asn Tyr Ile Pro 465 470 475 480 Gly Pro Ser Tyr Arg Gln Gln Arg Val Ser Thr Thr Val Thr Gln Asn 485 490 495 Asn Asn Ser Glu Phe Ala Trp Pro Gly Ala Ser Ser Trp Ala Leu Asn 500 505 510 Gly Arg Asn Ser Leu Met Asn Pro Gly Pro Ala Met Ala Ser His Lys 515 520 525 Glu Gly Glu Asp Arg Phe Phe Pro Leu Ser Gly Ser Leu Ile Phe Gly 530 535 540 Lys Gln Gly Thr Gly Arg Asp Asn Val Asp Ala Asp Lys Val Met Ile 545 550 555 560 Thr Asn Glu Glu Glu Ile Lys Thr Thr Asn Pro Val Ala Thr Glu Ser 565 570 575 Tyr Gly Gln Val Ala Thr Asn His Gln Ser Ala Gln Ala Gln Ala Gln 580 585 590 Thr Gly Trp Val Gln Asn Gln Gly Ile Leu Pro Gly Met Val Trp Gln 595 600 605 Asp Arg Asp Val Tyr Leu Gln Gly Pro Ile Trp Ala Lys Ile Pro His 610 615 620 Thr Asp Gly Asn Phe His Pro Ser Pro Leu Met Gly Gly Phe Gly Met 625 630 635 640 Lys His Pro Pro Pro Gln Ile Leu Ile Lys Asn Thr Pro Val Pro Ala 645 650 655 Asp Pro Pro Thr Ala Phe Asn Lys Asp Lys Leu Asn Ser Phe Ile Thr 660 665 670 Gln Tyr Ser Thr Gly Gln Val Ser Val Glu Ile Glu Trp Glu Leu Gln 675 680 685 Lys Glu Asn Ser Lys Arg Trp Asn Pro Glu Ile Gln Tyr Thr Ser Asn 690 695 700 Tyr Tyr Lys Ser Asn Asn Val Glu Phe Ala Val Asn Thr Glu Gly Val 705 710 715 720 Tyr Ser Glu Pro Arg Pro Ile Gly Thr Arg Tyr Leu Thr Arg Asn Leu 725 730 735 <210> 15 <211> 423 <212> PRT <213> Homo sapiens <400> 15 Met Gly Met Tyr Pro Gly Val Leu Val Pro Ser Ser Arg Gly Gly Leu 1 5 10 15 Pro Leu Glu Glu Val Thr Val Ala Glu Val Leu Ala Ala Arg Gly Tyr 20 25 30 Leu Thr Gly Met Ala Gly Lys Trp His Leu Gly Val Gly Pro Glu Gly 35 40 45 Ala Phe Leu Pro Pro His Gln Gly Phe His Arg Phe Leu Gly Ile Pro 50 55 60 Tyr Ser His Asp Gln Gly Pro Cys Gln Asn Leu Thr Cys Phe Pro Pro 65 70 75 80 Ala Thr Pro Cys Asp Gly Gly Cys Asp Gln Gly Leu Val Pro Ile Pro 85 90 95 Leu Leu Ala Asn Leu Ser Val Glu Ala Gln Pro Pro Trp Leu Pro Gly 100 105 110 Leu Glu Ala Arg Tyr Met Ala Phe Ala His Asp Leu Met Ala Asp Ala 115 120 125 Gln Arg Gln Asp Arg Pro Phe Phe Leu Tyr Tyr Ala Ser His His Thr 130 135 140 His Tyr Pro Gln Phe Ser Gly Gln Ser Phe Ala Glu Arg Ser Gly Arg 145 150 155 160 Gly Pro Phe Gly Asp Ser Leu Met Glu Leu Asp Ala Ala Val Gly Thr 165 170 175 Leu Met Thr Ala Ile Gly Asp Leu Gly Leu Leu Glu Glu Thr Leu Val 180 185 190 Ile Phe Thr Ala Asp Asn Gly Pro Glu Thr Met Arg Met Ser Arg Gly 195 200 205 Gly Cys Ser Gly Leu Leu Arg Cys Gly Lys Gly Thr Thr Tyr Glu Gly 210 215 220 Gly Val Arg Glu Pro Ala Leu Ala Phe Trp Pro Gly His Ile Ala Pro 225 230 235 240 Gly Val Thr His Glu Leu Ala Ser Ser Leu Asp Leu Leu Pro Thr Leu 245 250 255 Ala Ala Leu Ala Gly Ala Pro Leu Pro Asn Val Thr Leu Asp Gly Phe 260 265 270 Asp Leu Ser Pro Leu Leu Leu Gly Thr Gly Lys Ser Pro Arg Gln Ser 275 280 285 Leu Phe Phe Tyr Pro Ser Tyr Pro Asp Glu Val Arg Gly Val Phe Ala 290 295 300 Val Arg Thr Gly Lys Tyr Lys Ala His Phe Phe Thr Gln Gly Ser Ala 305 310 315 320 His Ser Asp Thr Thr Ala Asp Pro Ala Cys His Ala Ser Ser Ser Leu 325 330 335 Thr Ala His Glu Pro Pro Leu Leu Tyr Asp Leu Ser Lys Asp Pro Gly 340 345 350 Glu Asn Tyr Asn Leu Leu Gly Gly Val Ala Gly Ala Thr Pro Glu Val 355 360 365 Leu Gln Ala Leu Lys Gln Leu Gln Leu Leu Lys Ala Gln Leu Asp Ala 370 375 380 Ala Val Thr Phe Gly Pro Ser Gln Val Ala Arg Gly Glu Asp Pro Ala 385 390 395 400 Leu Gln Ile Cys Cys His Pro Gly Cys Thr Pro Arg Pro Ala Cys Cys 405 410 415 His Cys Pro Asp Pro His Ala 420 <210> 16 <211> 666 <212> DNA <213> Artificial Sequence <220><223> chicken beta actin promoter with a cytomegalovirus enhancer (CB7) <400> 16 ctagtcgaca ttgattattg actagttatt aatagtaatc aattacgggg tcattagttc 60 atagcccata tatggagttc cgcgttacat aacttacggt aaatggcccg cctggctgac 120 cgcccaacga cccccgccca ttgacgtcaa taatgacgta tgttcccata gtaacgccaa 180 tagggacttt ccattgacgt caatgggtgg actatttacg gtaaactgcc cacttggcag 240 tacatcaagt gtatcatatg ccaagtacgc cccctattga cgtcaatgac ggtaaatggc 300 ccgcctggca ttatgcccag tacatgacct tatgggactt tcctacttgg cagtacatct 360 acgtattagt catcgctatt accatggtcg aggtgagccc cacgttctgc ttcactctcc 420 ccatctcccc cccctcccca cccccaattt tgtatttatt tattttttaa ttattttgtg 480cagcgatggg ggcggggggg gggggggggc gcgcgccagg cggggcgggg cggggcgagg 540 ggcggggcgg ggcgaggcgg agaggtgcgg cggcagccaa tcagagcggc gcgctccgaa 600 agtttccttt tatggcgagg cggcggcggc ggcggcccta taaaaagcga agcgcgcggc 660 gggcgg 666 <210> 17 <211> 973 <212> DNA <213> Artificial sequence <220><223> chicken beta-actin intron <400> 17 gtgagcgggc gggacggccc ttctcctccg ggctgtaatt agcgcttggt ttaatgacgg 60 cttgtttctt ttctgtggct gcgtgaaagc cttgaggggc tccgggaggg ccctttgtgc 120 ggggggagcg gctcgggggg tgcgtgcgtg tgtgtgtgcg tggggagcgc cgcgtgcggc 180 tccgcgctgc ccggcggctg tgagcgctgc gggcgcggcg cggggctttg tgcgctccgc 240 agtgtgcgcg aggggagcgc ggccgggggc ggtgccccgc ggtgcggggg gggctgcgag 300 gggaacaaag gctgcgtgcg gggtgtgtgc gtgggggggt gagcaggggg tgtgggcgcg 360 tcggtcgggc tgcaaccccc cctgcacccc cctccccgag ttgctgagca cggcccggct 420 tcgggtgcgg ggctccgtac ggggcgtggc gcggggctcg ccgtgccggg cggggggtgg 480 cggcaggtgg gggtgccggg cggggcgggg ccgcctcggg ccggggaggg ctcgggggag 540 gggcgcggcg gcccccggag cgccggcggc tgtcgaggcg cggcgagccg cagccattgc 600 cttttatggt aatcgtgcga gagggcgcag ggacttcctt tgtcccaaat ctgtgcggag 660 ccgaaatctg ggaggcgccg ccgcaccccc tctagcgggc gcggggcgaa gcggtgcggc 720 gccggcagga aggaaatggg cggggagggc cttcgtgcgt cgccgcgccg ccgtcccctt 780 ctccctctcc agcctcgggg ctgtccgcgg ggggacggct gccttcgggg gggacggggc 840 agggcggggt tcggcttctg gcgtgtgacc ggcggctcta gagcctctgc taaccatgtt 900 catgccttct tctttttcct acagctcctg ggcaacgtgc tggttattgt gctgtctcat 960 cattttggca aag 973 <210> 18 <211> 282 <212> DNA <213> Artificial sequence<220><223> CB promoter <400> 18 tggtcgaggt gagccccacg ttctgcttca ctctccccat ctcccccccc tccccacccc 60 caattttgta tttatttatt ttttaattat tttgtgcagc gatgggggcg gggggggggg 120 gggggcgcgc gccaggcggg gcggggcggg gcgaggggcg gggcggggcg aggcggagag 180 gtgcggcggc agccaatcag agcggcgcgc tccgaaagtt tccttttatg gcgaggcggc 240 ggcggcggcg gccctataaa aagcgaagcg cgcggcgggc gg 282 <210> 19 <211> 382 <212> DNA <213> Artificial sequence <220><223> CMV Immediate early Promoter <400> 19 ctagtcgaca ttgattattg actagttatt aatagtaatc aattacgggg tcattagttc 60 atagcccata tatggagttc cgcgttacat aacttacggt aaatggcccg cctggctgac 120 cgcccaacga cccccgccca ttgacgtcaa taatgacgta tgttcccata gtaacgccaa 180 tagggacttt ccattgacgt caatgggtgg actatttacg gtaaactgcc cacttggcag 240 tacatcaagt gtatcatatg ccaagtacgc cccctattga cgtcaatgac ggtaaatggc 300 ccgcctggca ttatgcccag tacatgacct tatgggactt tcctacttgg cagtacatct 360 acgtattagt catcgctatt ac 382 <210> 20 <211> 22 <212> DNA <213> Artificial Sequence <220><223> miR183 <400> 20 agtgaattct accagtgcca ta 22 <210> 21 <211> 23 <212> DNA <213> Artificial Sequence <220><223> miRNA target sequence <400> 21agcaaaaatg tgctagtgcc aaa 23 <210> 22 <211> 24 <212> DNA <213> Artificial Sequence <220><223> miRNA target sequence <400> 22 agtgtgagtt ctaccattgc caaa 24 <210> 23 <211> 23 <212> DNA <213> Artificial Sequence <220><223> miRNA target sequence <400> 23 agggattcct gggaaaactg gac 23 <210> 24 <211> 16 <212> DNA <213> Artificial Sequence <220><223> Spacer <400> 24 atgacttaaa ccaggt 16"}
{"patent_id": "10-2021-7039381", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 조작된 hARSA 코딩 서열(서열번호 1, 즉, 서열번호 3의 7번 nt 내지 1527번 nt 및 서열번호 5의 1968번 nt 내지 3488번 nt)을 제공한다. 도 2는 AAV.CB7.CI.hARSAco.rBG 벡터 게놈의 선형 맵을 제공한다. 벡터 게놈은 유비쿼터스 CB7 프로모터의 제어 하에 인간 ARSA(hARSAco)의 조작된 버전을 발현하기 위한 것이다. CB7은 CMV IE 인핸서와 닭 BA 프로모터 사이 의 하이브리드로 구성된다. ARSA, 아릴설파테이스 A; BA, β-액틴; CMV IE, 사이토메갈로바이러스 급초기; ITR, 반전 말단 반복부; 폴리A, 폴리아데닐화; 및 rBG, 토끼 β-글로빈. 도 3은 pENN.AAV.CB7.CI.hARSAco.rBG.KanR로 지칭되는 시스 플라스미드의 선형 맵을 제공한다. BA, β액틴; bp, 염기쌍; CMV IE, 사이토메갈로바이러스 급초기; hARSAco, 인간 아릴설파테이스 A(조작됨); ITR, 반전 말단 반복부; KanR, 카나마이신 저항성; Ori, 복제 기점; 폴리A, 폴리아데닐화; rBG, 토끼 β-글로빈. 도 4는 트랜스 플라스미드 pAAV2/hu68.KanR의 선형 맵을 제공한다. AAV2, 아데노-관련 바이러스 혈청형 2; AAVhu68, 아데노-관련 바이러스 혈청형 hu68; bp, 염기쌍; Cap, 캡시드; KanR, 카나마이신 저항성; Ori, 복제 기점; Rep, 레플리케이스. 도 5a 및 도 5b는 아데노바이러스 헬퍼 플라스미드 pAdDeltaF6(KanR)을 제공한다. 도 5a는 중간체 pAdΔF1 및 pAdΔF5를 통해 모 플라스미드 pBHG10로부터의 헬퍼 플라스미드 pAdΔF6의 유도를 보여준다. 도 5b는 pAdΔF6의 암피실린 저항성 유전자가 카나마이신 저항성 유전자로 대체되어 pAdΔF6(Kan)이 생성되었음을 보여준다. 도 6은 AAVhu68.hARSAco 벡터를 생산하기 위한 제조 공정 흐름도를 제공한다. AAV, 아데노-관련 바이러스; AEX, 음이온 교환; CRL, 찰스 리버 래보래토리즈; ddPCR, 액적 디지털 중합효소 연쇄 반응; DMEM, 둘베코 변형 이글 배지; DNA, 데옥시리보핵산; FFB, 최종 제형 완충액; GC, 게놈 카피; HEK293, 인간 배아 신장 293 세포; ITFFB, 척수강내 최종 제형 완충액; PEI, 폴리에틸렌이민; SDS-PAGE, 소듐 도데실 설페이트 폴리아크릴아마이드 겔 전기영동; TFF, 접선 유동 여과; USP, 미국 약전; WCB, 제조용 세포 은행. 도 7은 AAVhu68.hARSAco 벡터에 대한 제조 공정 흐름도를 제공한다. Ad5, 아데노바이러스 혈청형 5; AUC, 분석 적 초원심분리; BDS, 대량 원료의약품; BSA, 소 혈청 알부민; CZ, 크리스탈 제니스(Crystal Zenith); ddPCR, 액적 디지털 중합효소 연쇄 반응; E1A, 초기 영역 1A(유전자); ELISA, 효소-결합 면역흡착 측정법; FDP, 완제 의약품; GC, 게놈 카피; HEK293, 인간 배아 신장 293 세포; ITFFB, 척수강내 최종 제형 완충액; KanR, 카나마이 신 내성(유전자); MS, 질량분석법; NGS, 차세대 염기서열분석; qPCR, 정량적 중합효소 연쇄 반응; SDS-PAGE, 소 듐 도데실 설페이트 폴리아크릴아마이드 겔 전기영동; TCID50 50% 조직 배양 감염 용량; UPLC, 초고성능 액체 크 로마토그래피; USP, 미국 약전. 도 8은 AAVhu68.CB7.CI.hARSAco.rBG 벡터의 뇌실내 투여 후 마우스의 좌측 및 우측 대뇌반구에서의 ARSA 효소 활성을 보여준다. 6주령의 C57BL6/J 야생형 마우스에 1.00×1010 GC(저용량) 또는 1.00×1011 GC(고용량)(N=5/그 룹)의 용량의 AAVhu68.CB7.CI.hARSAco.rBG 벡터를 단일 ICV 주사로 우뇌실에 투여하였다. 주령이 일치하는 C57BL6/J 야생형 마우스에 대조군(N=4)으로서 PBS를 ICV로 우뇌실에 투여하였다. 마우스를 21일 후에 부검하고, 좌측 및 우측 대뇌반구에서 ARSA 효소 활성을 발색 기질인 4-나이트로카테콜 설페이트(n㏖/㎎/hr)의 가수분해 속도를 기준으로 측정하였다. ARSA, 아릴설파테이스 A(단백질); GC, 게놈 카피; ICV, 뇌실내; N, 동물의 수; PBS, 포스페이트완충 식염수. 자세한 내용은 실시예 2 참조. 도 9a 내지 도 9b는 AAVhu68.CB7.CI.hARSAco.rBG 벡터의 뇌실내 투여 후 마우스의 간 및 혈청에서의 ARSA 효소 활성을 보여준다. 6주령의 C57BL6/J 야생형 마우스에 1.00×1010 GC(저용량) 또는 1.00×1011 GC(고용량)(N=5/그 룹)의 용량의 AAVhu68.CB7.CI.hARSAco.rBG 벡터를 단일 ICV 주사로 우뇌실에 투여하였다. 연령이 일치하는 C57BL6/J 야생형 마우스에 대조군(N=4)으로서 PBS를 ICV로 우뇌실에 투여하였다. 마우스를 21일 후에 부검하고, 도 9a의 혈청 및 도 9b의 간에서의 ARSA 효소 활성을 발색 기질인 4-나이트로카테콜 설페이트(n㏖/㎎/hr)의 가 수분해 속도를 기준으로 측정하였다. ARSA, 아릴설파테이스 A(단백질); GC, 게놈 카피; ICV, 뇌실내; N, 동물의 수; PBS, 포스페이트-완충 식염수. 도 10은 마우스에 AAVhu68.CB7.CI.hARSAcoHA.rBG를 뇌실내 투여한 후 뇌에서 뉴런 및 희소돌기아교세포로의 ARSA의 전달을 보여준다. 6주령의 C57BL6/J 야생형 마우스에 1.00×1010 GC(저용량) 또는 1.00×1011 GC(고용 량)(N=5/그룹)의 용량의 AAVhu68.CB7.CI.hARSAcoHA.rBG를 단일 ICV 주사로 우뇌실에 투여하였다. 연령이 일치 하는 C57BL6/J 야생형 마우스에 대조군(N=5)으로서 PBS를 ICV로 우뇌실에 투여하였다. 마우스를 21일 후에 부검 하고, 뇌 조직을 얻었다. ARSA(녹색: 플루오레세인 아이소티오사이아네이트-접합된 이차 항체로 검출된 항-HA 일차 항체) 및 희소돌기아교세포(적색: 테트라메틸로다민-접합된 이차 항체로 검출된 항-OLIG2 일차 항체)를 시 각화하기 위해 조직을 절단하고 면역염색하였다. 뇌 피질의 대표적인 이미지는 500ms 노출로 20× 배율로 표시 된다. 잘라내어 확대한 보기(하단 행)는 ARSA를 발현하는 피질하 백질로부터의 희소돌기아교세포를 보여준다. ARSA, 아릴설파테이스 A(단백질); GC, 게놈 카피; HA, 헤마글루티닌; ICV, 뇌실내; N, 동물의 수; OLIG2, 희소 돌기아교세포 전사 인자 2; PBS, 포스페이트-완충 식염수. 도 11은 AAVhu68.CB7.CI.hARSAco.rBG의 대수조내 투여 후 비인간 영장류의 뇌척수액에서의 ARSA 활성 수준을 보 여준다. 성체 사이노몰구스 마카크에 3.00×1012 GC(LD), 1.00×1013 GC(MD) 또는 3.00×1013 GC(HD)(N=2/그룹)의 용량의 AAVhu68.CB7.CI.hARSAco.rBG를 단일 ICM으로 투여하였다. AAVhu68.CB7.CI.hARSAco.rBG 투여 후(제0일), CSF를 7일, 14±1일, 21±1일, 35±1일 및 42±2일에 수집하였다. ARSA 활성을 발색 기질인 4-나이트로카테콜설페이트(n㏖/[시간*㎖])의 가수분해 속도에 의해 측정하였다. ICM 투여 전 각 개체의 기준선 ARSA 활성 수준으 로 정의된 내인성 마카크 ARSA 활성은 AAVhu68.CB7.CI.hARSAco.rBG 투여로 인한 ARSA 활성을 얻기 위해 차감하 였다. 점선은 각 개체에 대한 기준선 ARSA 활성 수준을 나타낸다. ARSA, 아릴설파테이스 A(단백질); CSF, 뇌척 수액; GC, 게놈 카피; HD, 고용량; ICM, 대수조내, LD, 저용량; MD, 중간-용량; N, 동물의 수. 범례의 화살표는 각 시험을 나타내는데 사용된다. 도 12a 및 도 12b는 AAVhu68.CB7.CI.hARSAco.rBG의 대수조내 투여 후 비인간 영장류의 뇌척수액 및 혈청에서의 항-ARSA 항체 수준을 제공한다. 성체 사이노몰구스 마카크에 3.00×1012 GC(LD), 1.00×1013 GC(MD) 또는 3.00× 1013 GC(HD)(N=2/그룹)의 용량의 AAVhu68.CB7.CI.hARSAco.rBG를 제0일에 단일 ICM으로 투여하였다. 처리하지 않 은 연령이 일치하는 사이노몰구스 마카크를 대조군(N=2)으로 사용하였다. AAVhu68.CB7.CI.hARSAco.rBG의 투여 후(제0일), CSF를 7일, 14±1일, 21±1일, 35±1일 및 42±2일에 수집하였다. 혈청을 7일, 14±1일, 21±1일, 28±1일, 35±1일 및 42±2일에 수집하였다. 항-hARSA 항체 수준(450㎚에서 흡광도)을 측정하기 위해 재조합 인 간 ARSA로 미리-코팅된 플레이트를 사용하여 CSF(희석 1:20, 도 12a) 및 혈청(희석 1:1000, 도 12b)에 대해 간 접 ELISA를 수행하였다. 점선은 처리하지 않은 대조군에서의 흡광도 평균을 나타낸다. ARSA, 아릴설파테이스 A (단백질); CSF, 뇌척수액; ELISA, 효소-연결 면역흡착 검정; GC, 게놈 카피; hARSA, 인간 아릴설파테이스 A; HD, 고용량; ICM, 대수조내, LD, 저용량; MD, 중간 용량; N, 동물의 수. 범례의 화살표는 각 시험을 나타내는데 사용된다. 도 13a 내지 도 13l은 AAVhu68.CB7.CI.hARSAco.rBG의 대수조내 투여 후 비인간 영장류의 뇌에서의 인간 ARSA 발현을 보여준다. 성체 사이노몰구스 마카크에 3.00×1013 GC(HD)(N=2)의 용량의 AAVhu68.CB7.CI.hARSAco.rBG를 단일 ICM으로 투여하였다. 처리하지 않은 연령이 일치하는 사이노몰구스 마카크는 대조군(N=2)으로 사용하였다. AAVhu68.CB7.CI.hARSAco.rBG 투여 후 42±2일에 동물을 부검하고, 인간 ARSA를 인식하는 항체를 사용한 면역조 직화학 염색(갈색 침전물)을 위해 뇌를 얻었다. 한 마리의 AAVhu68.CB7.CI.hARSAco.rBG-처리된 동물에 대한 뇌 의 피질(도 13e, 도 13f, 도 13g, 도 13i 및 도 13j), 해마(도 13h), 시상(도 13k) 및 소뇌(도 13l)를 통한 절 편의 대표적인 이미지가 신호 비교를 위해 처리하지 않은 대조군(도 13a, 도 13b, 도 13c 및 도 13d)으로부터의 절편과 함께 표시된다. ARSA, 아릴설파테이스 A(단백질); GC, 게놈 카피; HD, 고용량; ICM, 대수조내; N, 동물 의 수. 도 14a, 도 14b, 도 14c, 도 14d, 도 14e, 도 14f, 도 14g, 도 14h 및 도 14i는 AAVhu68.CB7.CI.hARSAco.rBG의 대수조내 투여 후 비인간 영장류의 척수 및 배근신경절에서의 인간 ARSA 발현을 제공한다. 성체 사이노몰구스 마카크에 3.00×1013 GC(HD)(N=2)의 용량의 AAVhu68.CB7.CI.hARSAco.rBG를 단일 ICM으로 투여하였다. 처리하지 않은 연령이 일치하는 사이노몰구스 마카크는 대조군(N=2)으로 사용하였다. AAVhu68.CB7.CI.hARSAco.rBG 투여 후 42±2일에 동물을 부검하고, 인간 ARSA를 인식하는 항체를 사용한 면역조직화학 염색(갈색 침전물)을 위해 경추, 흉부 및 요추 척수 및 DRG의 절편을 얻었다. 한 마리의 AAVhu68.CB7.CI.hARSAco.rBG-처리된 동물(도 14d, 도 14e, 도 14f, 도 14g, 도 14h 및 도 14i)에 대한 절편의 대표적인 이미지는 신호 비교를 위해 처리하지 않은 대조군(도 14a, 도 14b 및 도 14c)으로부터의 절편과 함께 표시된다. ARSA, 아릴설파테이스 A(단백질); GC, 게놈 카피; HD, 고용량; ICM, 대수조내; N, 동물의 수."}
