{"patent_id": "10-2023-0004672", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0116687", "출원번호": "10-2023-0004672", "발명의 명칭": "AI 음성인식 기반의 개인 건강 정보 예측 시스템", "출원인": "(주)비바이노베이션", "발명자": "박한"}}
{"patent_id": "10-2023-0004672", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "AI 음성인식을 기반으로 하는 개인 건강 정보 예측 시스템에 있어서,사용자의 주요 증상과 관련한 사용자 음성 신호에 대한 텍스트 변환 데이터를 제1 예측 모델에 적용하여 소증상별 확률 값을 예측하고, 상기 소증상 별 확률 값을 제2 예측 모델에 적용하여 대증상 별 확률 값을 예측하는 증상 예측부;가장 높은 확률 값으로 도출된 대증상에 대한 하위 소증상들을 후보 목록으로 제시 후 사용자로부터 해당하는복수의 소증상을 선택받는 제1 설문부;선택된 복수의 소증상을 질병 예측 모델에 입력하여, 입력 데이터와 연관된 복수의 예상 질병 및 상기 복수의예상 질병과 가장 연관도 높은 대증상을 예측하는 질병 예측부; 상기 복수의 예상 질병과 가장 연관도 높은 대증상에 대한 하위 소증상들을 후보 목록으로 제시 후 해당되는 복수의 소증상을 선택받는 제2 설문부; 및상기 제1 및 제2 설문부에 의해 선택받은 전체 소증상들을 상기 질병 예측 모델에 입력하여 사용자의 n개의 예상 질병을 최종 도출하는 제어부를 포함하는 개인 건강 정보 예측 시스템."}
{"patent_id": "10-2023-0004672", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 제1 및 제2 설문부는,복수의 대증상 별로 그에 대한 하위 소증상들의 목록을 기 저장한 데이터베이스로부터 해당 대증상에 대응된 하위의 소증상들의 목록을 추출하여 후보 목록으로 제시하는 개인 건강 정보 예측 시스템."}
{"patent_id": "10-2023-0004672", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,사용자 단말을 통해 사용자의 주요 증상과 관련한 사용자 음성 신호를 입력받아 텍스트 변환하는 음성 신호 처리부를 더 포함하는 개인 건강 정보 예측 시스템."}
{"patent_id": "10-2023-0004672", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 3에 있어서,상기 음성 신호 처리부는,입력된 음성 신호에 해당한 문장을 텍스트 변환하여 형태소를 분리 후 정수 인코딩한 다음 패딩(Padding) 처리하는 개인 건강 정보 예측 시스템."}
{"patent_id": "10-2023-0004672", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서,상기 제어부는,상기 최종 도출한 n개의 예상 질병을 상기 사용자 단말에 질병 예측 결과로 제공하는 개인 건강 정보 예측 시스템."}
{"patent_id": "10-2023-0004672", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 1에 있어서,공개특허 10-2023-0116687-3-상기 제어부는,입력된 소증상들을 상기 질병 예측 모델을 통해 딥러닝 분석하여 도출된 복수의 후보 질병별 확률 값 중에서 높은 확률 값의 상위 n개의 후보 질병을 내림차순으로 정렬하여 제공하는 개인 건강 정보 예측 시스템."}
{"patent_id": "10-2023-0004672", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 1에 있어서,상기 질병 예측 모델은,입력된 복수의 소증상들을 딥러닝 분석하여 후보 질병별 확률 값을 출력하는 제1 모델과, 상기 제1 모델로부터입력받은 복수의 후보 질병별 확률 값을 딥러닝 분석하여 복수의 대증상별 확률 값을 출력하는 제2 모델을 포함하는 개인 건강 정보 예측 시스템."}
{"patent_id": "10-2023-0004672", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 1에 있어서,상기 대증상에 대한 하위 소증상들은 상기 대증상과 관련한 동반 증상, 증상 발현 부위에 관한 정보를 포함하는개인 건강 정보 예측 시스템."}
{"patent_id": "10-2023-0004672", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 1에 있어서,상기 최종 도출된 예상 질병을 토대로 사용자에게 진료과를 추천하는 추천부를 더 포함하는 개인 건강 정보 예측 시스템."}
{"patent_id": "10-2023-0004672", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 1에 있어서,사용자 단말에 실행 가능한 모바일 앱과 연동하도록 구현되는 개인 건강 정보 예측 시스템."}
{"patent_id": "10-2023-0004672", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 AI 음성인식 기반의 개인 건강 정보 예측 시스템에 관한 것이다. 본 발명에 따르면, AI 음성인식을 기 반으로 하는 개인 건강 정보 예측 시스템에 있어서, 사용자의 주요 증상과 관련한 사용자 음성 신호에 대한 텍스 트 변환 데이터를 제1 예측 모델에 적용하여 소증상 별 확률 값을 예측하고, 상기 소증상 별 확률 값을 제2 예측 (뒷면에 계속)"}
{"patent_id": "10-2023-0004672", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 AI 음성인식 기반의 개인 건강 정보 예측 시스템에 관한 것으로, 보다 상세하게는 사용자의 주요 증 상과 관련된 사용자 음성 신호를 입력받아 인공지능을 통해 분석하여 사용자의 예상 질병을 도출하여 제공할 수 있는 AI 음성인식 기반의 개인 건강 정보 예측 시스템에 관한 것이다."}
{"patent_id": "10-2023-0004672", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근들어 환자의 생체 정보나 각종 증상에 대한 데이터를 인공지능을 기반으로 분석하여 환자의 예상 질환을 예 상하거나 매칭해주는 시스템에 대한 연구 개발이 활발히 진행 중에 있다. 그 중에서 각종 센서를 통해 환자로부터 수집된 생체 신호나 운동 상태 등을 분석하여 건강 상태를 검진하고 질 병을 예측하는 시스템이 개시된 바 있다. 그런데, 해당 시스템의 경우 생체 신호에 기반한 점에서 예측 결과에 대한 신뢰성은 있는 편이지만, 환자로부터 생체 신호를 수집하기 위한 별도의 센서 장치가 요구되며, 생체 신호 측정을 통해서는 진단이 불가능한 부위나 질환의 경우에는 질병 예측이 어려운 한계점이 존재한다. 아울러, 이러한 점에 따라, 환자가 직접 병원 등의 의료기관을 방문하기 전에, 추가적인 센서 없이도 모바일 단 말 상에서 환자의 현재 증상 정보를 수집하고 이를 기반으로 예상 질병을 도출하여 적합한 진료과를 추천할 수 있는 비대면 방식의 의료 진단 시스템이 요구된다. 본 발명의 배경이 되는 기술은 한국공개특허 제10-2022-0068858호(2022.05.26 공개)에 개시되어 있다."}
{"patent_id": "10-2023-0004672", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "발명의 내용"}
{"patent_id": "10-2023-0004672", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 사용자의 주요 증상과 관련한 음성 신호를 분석하여 사용자의 예상 질병을 도출할 수 있는 AI 음성인 식 기반의 개인 건강 정보 예측 시스템을 제공하는데 목적이 있다."}
{"patent_id": "10-2023-0004672", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명은, AI 음성인식을 기반으로 하는 개인 건강 정보 예측 시스템에 있어서, 사용자의 주요 증상과 관련한 사용자 음성 신호에 대한 텍스트 변환 데이터를 제1 예측 모델에 적용하여 소증상 별 확률 값을 예측하고, 상기 소증상 별 확률 값을 제2 예측 모델에 적용하여 대증상 별 확률 값을 예측하는 증상 예측부와, 가장 높은 확률 값으로 도출된 대증상에 대한 하위 소증상들을 후보 목록으로 제시 후 사용자로부터 해당하는 복수의 소증상을 선택받는 제1 설문부와, 선택된 복수의 소증상을 질병 예측 모델에 입력하여, 입력 데이터와 연관된 복수의 예 상 질병 및 상기 복수의 예상 질병과 가장 연관도 높은 대증상을 예측하는 질병 예측부, 상기 복수의 예상 질병 과 가장 연관도 높은 대증상에 대한 하위 소증상들을 후보 목록으로 제시 후 해당되는 복수의 소증상을 선택받 는 제2 설문부, 및 상기 제1 및 제2 설문부에 의해 선택받은 전체 소증상들을 상기 질병 예측 모델에 입력하여 사용자의 n개의 예상 질병을 최종 도출하는 제어부를 포함하는 개인 건강 정보 예측 시스템을 제공한다. 또한, 상기 제1 및 제2 설문부는, 복수의 대증상 별로 그에 대한 하위 소증상들의 목록을 기 저장한 데이터베이 스로부터 해당 대증상에 대응된 하위의 소증상들의 목록을 추출하여 후보 목록으로 제시할 수 있다. 또한, 상기 개인 건강 정보 예측 시스템은, 사용자 단말을 통해 사용자의 주요 증상과 관련한 사용자 음성 신호 를 입력받아 텍스트 변환하는 음성 신호 처리부를 더 포함할 수 있다. 또한, 상기 음성 신호 처리부는, 입력된 음성 신호에 해당한 문장을 텍스트 변환하여 형태소를 분리 후 정수 인 코딩한 다음 패딩(Padding) 처리할 수 있다. 또한, 상기 제어부는, 상기 최종 도출한 n개의 예상 질병을 상기 사용자 단말에 질병 예측 결과로 제공할 수 있 다. 또한, 상기 제어부는, 입력된 소증상들을 상기 질병 예측 모델을 통해 딥러닝 분석하여 도출된 복수의 후보 질 병별 확률 값 중에서 높은 확률 값의 상위 n개의 후보 질병을 내림차순으로 정렬하여 제공할 수 있다. 또한, 상기 질병 예측 모델은, 입력된 복수의 소증상들을 딥러닝 분석하여 후보 질병별 확률 값을 출력하는 제1 모델과, 상기 제1 모델로부터 입력받은 복수의 후보 질병별 확률 값을 딥러닝 분석하여 복수의 대증상별 확률 값을 출력하는 제2 모델을 포함할 수 있다. 또한, 상기 대증상에 대한 하위 소증상들은 상기 대증상과 관련한 동반 증상, 증상 발현 부위에 관한 정보를 포 함할 수 있다. 또한, 상기 개인 건강 정보 예측 시스템은, 상기 최종 도출된 예상 질병을 토대로 사용자에게 진료과를 추천하 는 추천부를 더 포함할 수 있다. 또한, 상기 개인 건강 정보 예측 시스템은, 사용자 단말에 실행 가능한 모바일 앱과 연동하도록 구현될 수 있다."}
{"patent_id": "10-2023-0004672", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 사용자의 주요 증상과 관련한 사용자 음성 신호를 인공지능을 기반으로 분석하여 사용자의 예상 질병을 최종적으로 도출하여 제공할 수 있다. 또한, 예측 질병을 토대로 하여 사용자에게 병원 방문을 위 한 진료과를 추천해줄 수 있다."}
{"patent_id": "10-2023-0004672", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "그러면 첨부한 도면을 참고로 하여 본 발명의 실시 예에 대하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시 예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였 다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\"되어 있는 경우도 포함한다. 또한 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아 니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 도 1은 본 발명의 실시예에 따른 AI 음성인식 기반의 개인 건강 정보 예측 시스템의 구성을 나타낸 도면이다. 도 1에 나타낸 것과 같이, 본 발명의 실시예에 따른 AI 음성인식 기반의 개인 건강 정보 예측 시스템은 증 상 예측부, 제1 설문부, 질병 예측부, 제2 설문부 및 제어부를 포함하며, 음성 신호 처리부, 추천부 및 데이터베이스를 더 포함할 수 있다. 각 부(110~150,170,180)의 동작 및 각 부 간의 데이터 흐름은 제어부에 의해 제어될 수 있다. 먼저, 음성 신호 처리부는 사용자 단말을 통해 사용자의 주요 증상과 관련한 사용자 음성 신호를 입력 받아 텍스트 변환할 수 있다. 여기서 사용자 단말은 마이크 신호 입력 및 처리가 가능한 프로세스를 내장한 스마트폰, 노트북, 패드, 태블릿 OC, 데스크탑 등을 포함할 수 있다. 여기서 음성 신호 처리부는 입력된 음성 신호에 해당한 문장을 텍스트 변환하여 형태소 분리를 진행 후 분 리한 형태소를 정수 인코딩(Integer Encoding)한 다음 패딩(Padding) 처리하여 제공할 수 있다. 간단한 예로, '나 오늘 배가 너무 아파, 머리도 아파'라는 음성 신호가 들어오면 이를 텍스트 변환 후 각 형태소를 분리하고 정수 인코딩을 거친 후 모든 데이터의 길이를 설정 길이로 맞춰주기 위한 패딩 작업을 거치게 된다. 음성 신호를 텍스트 변환하는 음성 신호 처리 기법은 기존에 다양하게 개시되어 있으므로, 본 발명의 실시예에 서는 기 공지된 다양한 데이터 전처리 기법이 활용될 수 있다. 형태소 분리는 KoNLPy라는 한국어 정보 처리를 위한 파이썬 패키지가 활용될 수 있다. 음성 신호 처리부는 사용자의 주요 증상과 관련한 사용자 음성 신호에 대한 텍스트 변환 데이터를 증상 예 측부로 전달할 수 있다. 증상 예측부는 텍스트 변환 데이터로부터 사용자에게 예상되는 소증상을 예 측하고 이를 기반으로 대증상을 예측할 수 있다. 구체적으로, 증상 예측부는 사용자의 주요 증상과 관련한 사용자 음성 신호에 대한 텍스트 변환 데이터를 기 학습된 제1 예측 모델에 적용하여 소증상 별 확률 값을 예측하고, 소증상 별 확률 값을 기 학습된 제2 예측 모델에 적용하여 대증상 별 확률 값을 예측할 수 있다. 도 2는 특정 질병에 대증상 및 그에 대한 소증상을 예시적으로 설명한 도면이다. 이러한 도 2는 상기도 감염 질 환과 연관된 대증상과 그 하위의 소증상 종류를 예시하고 있다. 도 2와 같이, 대증상에 대한 하위 소증상들은 대증상과 관련한 동반 증상 및 증상 발현 부위에 관한 정보를 포 함할 수 있다. 예를 들어 대증상이 두통인 경우, 그에 대한 하위의 소증상들은 피부열감, 고열, 발열, 오한, 왼 쪽 통증, 오른쪽 통증, 찌릿찌릿 등을 포함할 수 있다. 이러한 증상 예측부는 두 개의 증상 예측 모델을 포함하여 구현될 수 있으며, 그 중에서 제1 예측 모델은 소증상 예측 모듈로서 사용자 음성 신호에 대한 텍스트 변환 데이터를 입력받아 딥러닝 분석하여 사용자의 질병 과 관련된 소증상을 예측할 수 있으며, 제2 예측 모델은 대증상 예측 모듈로서 소증상 예측 결과를 입력받아 딥 러닝 분석하여 사용자의 질병과 관련된 대증상을 예측할 수 있다. 여기서 제1 예측 모델은 사전에 학습되며 다양한 질병과 증상 사례를 가진 복수의 환자로부터 입력된 환자의 주 요 증상과 관련한 음성 신호의 텍스트 변환 데이터와 해당 환자가 가진 적어도 하나의 소증상들에 대한 데이터 를 이용하여 사전 학습될 수 있다. 아울러, 제2 예측 모델은 환자의 적어도 하나의 소증상들에 대한 데이터와해당 환자가 가진 대증상 정보를 이용하여 사전 학습될 수 있다. 도 3은 본 발명의 실시예에 따른 증상 예측 모델을 구체적으로 나타낸 도면이다. 도 3과 같이, 증상 예측부 에 포함된 제1 예측 모델은 사용자 음성 신호를 자연어 처리한 텍스트 변환 데이터로부터 소증상을 분류할 수 있는데, 구체적으로 입력된 텍스트 변환 데이터를 딥러닝 분석하여 복수의 소증상 별로 예상되는 확 률 값을 각각의 출력 노드를 통해 출력할 수 있다. 제2 예측 모델은 제1 예측 모델의 예측 결과를 입 력받아 딥러닝 분석하여 복수의 대증상 별로 예상되는 확률 값을 각각의 출력 노드를 통해 출력할 수 있다. 제1 예측 모델은 텍스트 변환 데이터를 구성한 각 단어를 복수의 입력 노드를 통해 입력받아 머신 러닝 학 습하여 복수의 출력 노드를 통해서 복수의 소증상 별 예측 값을 출력하여 전달할 수 있다. 본 발명의 실시예는 음성 신호에 대한 데이터들을 임베딩하여 인코딩 후 사전 훈련시킬 수 있다. 도 4는 본 발명의 실시예에 따른 제1 예측 모델의 동작을 예시적으로 설명한 도면이다. 도 4와 같이, 제1 예측 모델은 BERT 모델을 활용할 수 있다. 이러한 제1 예측 모델은 KoNLPy 도구를 통해 토큰화 과정을 거친 데이터를 입력받아 학습할 수 있다. 문장에 대한 토큰화된 데이터는 Tok1, Tok2, …, TokN 등으로 표현될 수 있다. 여기서, 도 4의 왼쪽 그림은 두 문장에 대한 토큰화된 데이터를 입력받아 연관성을 맞추는 학습을 수행하여 라 벨을 분류하는 것을 예시한 것이고, 우측 그림은 단일 문장에 대한 토큰화된 텍스트 데이터를 입력받아 라벨(소 증상)을 분류하는 것을 예시하며, 출력 레이어에서는 각각의 소증상 별로 확률값을 제공할 수 있다. BERT 모델은 자체적으로 대량의 데이터를 스스로 읽고 학습하는 방식으로, 단어의 문맥, 관계 등을 파악하여 결 과를 분류 또는 예측하는 인공지능 기반의 자연어 처리 모델에 해당한다. 이를 통해 제1 예측 모델은 음성 신호에서 변환된 텍스트의 여러 문맥 정보와 사용자의 여러 소증상 간의 관계를 인공지능 학습할 수 있다. 또한, 학습이 완료된 이후에는 입력된 음성 신호에 대한 텍스트 변환 데이터를 이용하여 사용자의 소증상을 분 류할 수 있으며, 보다 구체적으로 소증상 별로 확률 값을 제공할 수 있다. 확률 값이 높은 소증상일수록 해당 문장과 연관도가 높은 소증상에 해당할 수 있다. 본 발명의 실시예의 경우 BERT 모델은 성모 병원에서 받은 대량의 corpos로 pre-trained한 모델을 활용하였다. BERT로 Training한 corpora의 설명에 대한 예시는 표 1에 있다. 표 1"}
{"patent_id": "10-2023-0004672", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "물론 이는 단지 하나의 실시예로서 본 발명이 반드시 상술한 데이터에 의해 학습되는 것으로 한정되지 않는다. 또한 본 발명의 실시예에서 제2 예측 모델은 Bi-LSTM(양방향 LSTM)과 CRF가 결합된 구조로 구현될 수 있다. 이 러한 제2 예측 모델은 제1 예측 모델로부터 전달받은 데이터를 머신 러닝 학습하여 복수의 출력 노드를 통하여 대증상 별 예측 값을 출력할 수 있다. 제1 설문부는 제1 예측 모델에서 출력된 대증상 별 확률 값 중에서 가장 높은 확률 값으로 도출된 대 증상을 확인하고, 확인된 대증상에 대한 하위 소증상들을 선택지 형태로 사용자 단말에게 후보 목록으로 제 시 후 사용자로부터 해당하는 복수의 소증상을 선택받도록 한다. 이때, 제1 설문부는 복수의 대증상 별로 그에 대한 하위 소증상들의 목록을 기 저장한 데이터베이스 로부터 해당 대증상에 대응된 하위의 소증상들의 목록을 추출하여 후보 목록으로 제시할 수 있다. 사용자는 사용자 단말 상에 설문으로 제공된 하위 소증상들의 후보 목록 중에서 현재 자신에게 해당하는 소 증상들을 선택하며, 이때 사용자의 상태에 따라 현재 제공된 후보 목록 중 전부 또는 일부 목록이 선택될 수 있 다. 또한 제1 설문부는 사용자 단말을 통해 선택받은 소증상 데이터들을 질병 예측부로 전달할 수 있다. 질병 예측부는 선택된 복수의 소증상을 기 학습된 질병 예측 모델에 입력하여, 입력 데이터와 연관된 복수 의 예상 질병 및 복수의 예상 질병과 가장 연관도 높은 대증상을 예측할 수 있다. 여기서, 질병 예측부는 입력된 복수의 소증상들을 딥러닝 분석하여 후보 질병별 확률 값을 출력하는 제1 모델과, 제1 모델로부터 입력받은 복수의 후보 질병별 확률 값을 딥러닝 분석하여 복수의 대증상별 확률 값을 출력하는 제2 모델을 포함할 수 있다. 이를 위해 제1 모델과 제2 모델은 사전 학습되고 입력된 데이터를 머신 러닝 분석하여 그로부터 예상되는 질병을 분류 또는 예측하거나, 분류된 예상 질병들을 머신 러닝 분석하여 역 으로 그로부터 예상되는 대증상을 분류하거나 예측할 수 있다. 질병 예측부는 제2 모델에서 도출된 결과로부터 복수의 예상 질병과 가장 연관도 높은 대증상을 확인하고 이를 제2 설문부로 제공할 수 있다. 이때 가장 연관도 높은 대증상은 앞서 증상 예측부에서 초기 도 출된 대증상과 동일할 수도 있고 상이할 수도 있다. 제2 설문부를 복수의 예상 질병과 가장 연관도 높은 대증상을 확인하고 확인된 대증상에 대한 하위 소증상 들을 후보 목록으로 제시 후 해당되는 복수의 소증상을 선택받을 수 있다. 이때 제2 설문부는 제1 설문부 와 같이 데이터베이스로부터 해당 대증상에 대응된 하위의 소증상들의 목록을 추출하여 후보 목록으 로 제공할 수 있다. 이와 같이 제1 및 제2 설문부는 데이터 베이스와 연동하여 사용자로부터 사용자의 현 재 상태와 유관한 소증상들을 피드백받을 수 있다. 또한 2회에 걸친 피드백을 통해서 예측 모델의 정확도를 높 일 수 있다. 이러한 본 발명에 따르면, 사용자의 피드백 정보가 인공지능 학습에 반영됨으로써 보다 정확한 질 병 예측이 가능하게 한다. 다음으로, 제어부는 제1 및 제2 설문부에 의해 선택받은 전체 소증상들을 질병 예측 모델에 입력하여 사용자의 n개의 예상 질병을 최종 도출할 수 있다. 제어부는 제1 및 제2 설문부에 의해 선택받은 전체 소증상들의 데이터를 앞서 설명한 질병 예측 모델 에 다시 입력하여 제1 모델로부터 n개의 예상 질병을 최종 도출하여 제공할 수 있다. 제어부는 최종 도출한 n개의 예상 질병을 사용자 단말을 통해 질병 예측 결과로 제공할 수 있다. 이때, 제어부는 입력된 소증상들을 질병 예측 모델을 통해 딥러닝 분석하여 도출된 복수의 후보 질병별 확 률 값 중에서 높은 확률 값의 상위 n개의 후보 질병을 내림차순으로 정렬하여 제공할 수 있다. 예를 들어 n이 3 인 경우 가능성 높은 상위 3개의 후보 질병을 내림차순으로 제공할 수 있다. 아울러, 추천부는 이렇게 최종 도출된 예상 질병을 토대로 사용자에게 진료과를 추천할 수 있다. 이때, n 개의 후보 질병 각각 별로 그에 대응된 진료과 추천할 수 있으며, 사용자 단말의 위치를 기반으로 해당 진료과 가 존재한 인근 병원 목록을 추가로 제공할 수 있다. 이러한 본 발명의 실시예에 따른 개인 건강 정보 예측 시스템은 사용자 단말에 실행 가능한 모바일 앱과 연동하도록 구현될 수 있다. 또한, 개인 건강 정보 예측 시스템은 관련 서비스를 제공하는 서버에 해당할 수 있으며, 사용자 단말과 네트워크 연결되어 음성 기반의 건강 정보 예측 서비스 플랫폼을 제공할 수 있다. 이러한 본 발명은 사용자의 현재 주요 증상에 관한 음성 정보와 설문 정보를 바탕으로 사용자에게 어떤 질병이 의심되는지 예측해줄 수 있으며, 나아가 적어도 하나의 병원과 연동하여 예측된 질병과 관련된 진료과 및 병원 정보를 추천해 줄 수 있다. 도 5는 본 발명의 실시예에 따른 개인 건강 정보 예측 프로세스를 설명한 도면이다. 먼저, 건강 정보 예측 시스템의 음성 신호 처리부는 사용자 단말로부터 사용자의 주요 증상에 관 한 음성 신호를 입력받아 이를 텍스트 변환할 수 있다(S1). 변환 결과는 증상 예측부로 전달된다. 증상 예측부는 덱트스 변환된 음성 신호 데이터를 딥러닝 분석하여 소증상을 예측하고 이로부터 대증상을 예측할 수 있다(S2). 증상 예측부는 텍스트 변환된 음성 신호를 사전 학습된 제1 예측 모델에 적용하여 사 용자의 음성 신호와 연관된 소증상을 예측하고 예측 결과를 제2 예측 모델에 적용하여 그와 연관된 대증상을 예측할 수 있다. 이때 대증상 라벨 별로 확률 값을 제공하여 가장 높은 확률의 대증상 정보는 제1 설문부에 서 활용된다. 제1 설문부는 증상 예측부를 통한 대증상 예측 결과를 통해 사용자 설문 및 응답을 진행할 수 있다 (S3). 이때, 제1 설문부는 증상 예측부에서 가장 높은 확률로 분류된 대증상에 관한 하위 소증상들의 정보를 데이터베이스로부터 독출하여 사용자 설문을 위한 후보 목옥으로 제시하고 사용자로부터 해당하는 소증상들을 선택받을 수 있다. 사용자에 의해 선택된 소증상들에 대한 정보는 질병 예측부로 전달될 수 있 다. 질병 예측부는 제1 설문부에서 응답된 소증상들을 기 학습된 질병 예측 모델에 입력하여 소증상들과 연관된 복수의 예상 질병 및 이러한 복수의 예상 질병과 관련도 높은 대증상을 예측할 수 있다(S4). 가장 연관 도 높은 대증상 정보는 제2 설문부로 전달될 수 있다. 다음으로, 제2 설문부는 질병 예측부에서 가장 높은 확률로 도출된 대증상에 대한 하위 소증상들의 정보를 데이터베이스로부터 독출하여 사용자 설문을 위한 후보 목록으로 제시하고 해당되는 소증상들을 선 택지를 통해 선택받을 수 있다(S5). 다음으로, 제어부는 앞서 S3 단계 및 S5 단계에서 사용자 설문을 통해 응답받은 전체 소증상들을 질병 예 측 모델에 입력하여, 사용자의 n개의 예상 질병을 최종 도출할 수 있다(S6). 이때 각 단계에서 설문 응답된 소 증상들을 조합하여 모델에 입력할 수 있으며 중복된 소증상들은 취합될 수 있다. 또한, 제어부는 최종 도출한 예상 질병 결과를 사용자 단말로 출력하여 제공할 수 있다(S7). 이때 n개 의 예상 질병을 확률 값이 높은 순으로 정렬하여 내림차순으로 제공할 수 있다. 또한, 제어부는 예상 질병과 관련한 진료과를 사용자에게 추천 제공할 수 있다(S8). 이때 유관한 병원 정 보도 함께 제공할 수 있다. 이상과 같은 본 발명에 따르면, 사용자의 주요 증상과 관련한 사용자 음성 신호를 인공지능을 기반으로 분석하 여 사용자의 예상 질병을 최종적으로 도출하여 제공할 수 있다. 또한, 예측 질병을 토대로 하여 사용자에게 병 원 방문을 위한 진료과를 추천해줄 수 있다. 본 발명은 도면에 도시된 실시 예를 참고로 설명되었으나 이는 예시적인 것에 불과하며, 본 기술 분야의 통상의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 다른 실시 예가 가능하다는 점을 이해할 것이다. 따라서, 본 발명의 진정한 기술적 보호 범위는 첨부된 특허청구범위의 기술적 사상에 의하여 정해져야 할 것이다."}
{"patent_id": "10-2023-0004672", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 AI 음성인식 기반의 개인 건강 정보 예측 시스템의 구성을 나타낸 도면이다. 도 2는 특정 질병에 대증상 및 그에 대한 소증상을 예시적으로 설명한 도면이다. 도 3은 본 발명의 실시예에 따른 증상 예측 모델을 구체적으로 나타낸 도면이다. 도 4는 본 발명의 실시예에서 제1 예측 모델의 동작을 예시한 도면이다. 도 5는 본 발명의 실시예에 따른 개인 건강 정보 예측 프로세스를 설명한 도면이다."}
