{"patent_id": "10-2021-0136785", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0053361", "출원번호": "10-2021-0136785", "발명의 명칭": "입력 이미지를 기반으로 인터넷 쇼핑몰에 전시되는 상품 이미지를 생성하는 방법, 장치 및 컴", "출원인": "(주)라스트일마일", "발명자": "박희성"}}
{"patent_id": "10-2021-0136785", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "하나 이상의 프로세서 및 상기 프로세서에서 수행 가능한 명령들을 저장하는 하나 이상의 메모리를 포함하는 컴퓨팅 장치에서 구현되는 입력 이미지를 기반으로 인터넷 쇼핑몰에 전시되는 상품 이미지를 생성하는 방법에 있어서,유저 계정으로부터 입력 이미지를 수신하는 경우, 상기 수신된 입력 이미지 내에 위치한 적어도 하나의 객체를식별하여, 상기 식별된 적어도 하나의 객체를 추출하는 객체 추출 단계;상기 객체 추출 단계의 기능 수행이 완료되면, 기 저장된 배경 데이터 베이스에서 상기 추출된 적어도 하나의객체에 기반한 복수 개의 배경 이미지를 검색하여, 상기 검색된 복수 개의 배경 이미지 각각에 상기 추출된 적어도 하나의 객체를 합성하는 배경 합성 단계; 및상기 검색된 복수 개의 배경 이미지 각각에 상기 추출된 적어도 하나의 객체의 합성이 완료됨에 따라 합성 이미지의 생성이 완료되는 경우, 상기 생성된 합성 이미지를 인터넷 쇼핑몰의 상품 리스트에 삽입되는 이미지 타입인 제1 타입 또는 인터넷 쇼핑몰의 상품 상세 페이지에 삽입되는 이미지 타입인 제2 타입 중 하나의 타입에 대응되도록 편집하여, 인터넷 쇼핑몰에 전시되는 상품 이미지를 생성하는 상품 이미지 생성 단계;를 포함하는 것을 특징으로 하는 입력 이미지를 기반으로 인터넷 쇼핑몰에 전시되는 상품 이미지를 생성하는 방법."}
{"patent_id": "10-2021-0136785", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 객체 추출 단계는,상기 유저 계정으로부터 상기 입력 이미지를 수신하는 경우, 기 저장된 객체 인식 알고리즘을 기반으로 상기 수신된 입력 이미지를 분석하여, 상기 분석된 입력 이미지 내의 적어도 하나의 객체를 식별하여 추출하는 객체 식별 단계; 및상기 입력 이미지에서 상기 적어도 하나의 객체가 추출되는 경우, 상기 추출된 적어도 하나의 객체에 대한 검토를 상기 유저 계정에게 요청하여, 상기 유저 계정에 의해 상기 추출된 적어도 하나의 객체에 대한 검토가 완료되면, 상기 적어도 하나의 객체를 이용하여 상기 배경 합성 단계를 시작하도록 요청하는 합성 요청 단계;를 포함하는 것을 특징으로 하는 입력 이미지를 기반으로 인터넷 쇼핑몰에 전시되는 상품 이미지를 생성하는 방법."}
{"patent_id": "10-2021-0136785", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 배경 합성 단계는,상기 합성 요청 단계의 기능 수행이 완료되는 경우, 기 저장된 인공지능 알고리즘을 기반으로, 상기 적어도 하나의 객체에 대응되는 상품의 종류, 상기 적어도 하나의 객체에 대응되는 상품의 선호도, 상기 적어도 하나의객체에 대응되는 상품의 사용 계절 및 상기 적어도 하나의 객체에 대응되는 상품의 트렌드 중 적어도 하나를 분석하는 객체 분석 단계;상기 객체 분석 단계에 의해 상기 적어도 하나의 객체에 대응되는 상품에 대한 분석이 완료되는 경우, 상기 상품에 대한 분석 결과 값을 기반으로, 상기 적어도 하나의 객체와의 적합도가 지정된 수치 이상인 복수 개의 배경 이미지를 기 저장된 배경 데이터 베이스에서 검색하여, 상기 유저 계정에게 검색된 복수 개의 배경 이미지를추천하는 배경 이미지 추천 단계;상기 유저 계정으로부터 상기 추천된 복수 개의 배경 이미지 중 적어도 하나를 선택하는 제1 입력을 수신하는공개특허 10-2023-0053361-3-경우, 상기 수신된 제1 입력에 기반한 적어도 하나의 배경 이미지에 상기 적어도 하나의 객체를 합성하여, 상기합성 이미지를 생성하는 제1 합성 단계; 및상기 유저 계정으로부터 상기 제1 입력이 아닌 다른 배경 이미지를 제공받는 제2 입력을 수신하는 경우, 상기제2 입력에 기반한 다른 배경 이미지에 상기 적어도 하나의 객체를 합성하여, 상기 합성 이미지를 생성하는 제2합성 단계;를 포함하는 것을 특징으로 하는 입력 이미지를 기반으로 인터넷 쇼핑몰에 전시되는 상품 이미지를생성하는 방법."}
{"patent_id": "10-2021-0136785", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 객체 분석 단계는,상기 제1 합성 단계 및 상기 제2 합성 단계 중 하나가 완료됨에 따라 상기 합성 이미지의 생성이 완료되는경우, 상기 기 저장된 인공지능 알고리즘을 기반으로 상기 합성 이미지를 분석하여, 상기 분석된 합성 이미지를표현하는 키워드를 키워드 데이터 베이스에서 추출하는 것을 특징으로 하는 입력 이미지를 기반으로 인터넷 쇼핑몰에 전시되는 상품 이미지를 생성하는 방법."}
{"patent_id": "10-2021-0136785", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 기 저장된 인공지능 알고리즘은,상기 적어도 하나의 객체와 대응되는 상품의 종류와 동일한 종류의 다른 상품의 선호도 데이터, 사용 계절 데이터, 판매량 데이터 및 트렌드 데이터 중 적어도 하나를 학습 데이터로써 머신 러닝하여, 업데이트 되는 것을 특징으로 하는 입력 이미지를 기반으로 인터넷 쇼핑몰에 전시되는 상품 이미지를 생성하는 방법."}
{"patent_id": "10-2021-0136785", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 상품 이미지 생성 단계는,상기 합성 이미지의 생성이 완료된 상태에서, 상기 유저 계정으로부터 상기 합성 이미지를 상기 제1 타입에 대응되는 이미지로 편집하도록 요청하는 입력을 수신하는 경우, 제1 타입 이미지 생성 프로세스를 시작하는 제1타입 프로세스 시작 단계;상기 제1 타입 이미지 생성 프로세스가 시작되는 경우, 상기 합성 이미지를 상기 인터넷 쇼핑몰에서 요구하는썸네일 이미지의 규격으로 변경하거나 상기 인터넷 쇼핑몰에서 제공하는 복수 개의 상품에 대한 제품 리스트 중하나에 삽입하기 위한 규격으로 변경하는 썸네일 규격 편집 단계; 및상기 썸네일 규격 편집 단계가 완료되는 경우, 규격 변경이 완료된 합성 이미지를 이미지 호스팅 등록하고, 호스팅 등록된 합성 이미지의 HTML 코드를 생성하여, 상기 인터넷 쇼핑몰에 썸네일 이미지로 등록하는 썸네일 이미지 등록 단계;를 포함하는 것을 특징으로 하는 입력 이미지를 기반으로 인터넷 쇼핑몰에 전시되는 상품 이미지를 생성하는 방법."}
{"patent_id": "10-2021-0136785", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5항에 있어서,상기 상품 이미지 생성 단계는,상기 합성 이미지의 생성이 완료된 상태에서, 상기 유저 계정으로부터 상기 합성 이미지를 상기 제2 타입에 대공개특허 10-2023-0053361-4-응되는 이미지로 편집하도록 요청하는 입력을 수신하는 경우, 제2 타입 이미지 생성 프로세스를 시작하는 제2타입 프로세스 시작 단계;상기 제2 타입 이미지 생성 프로세스가 시작되는 경우, 상기 합성 이미지를 상기 인터넷 쇼핑몰에서 요구하는상세 페이지에 삽입되는 이미지의 규격으로 변경하는 페이지 규격 편집 단계; 및상기 페이지 규격 편집 단계의 수행이 완료되는 경우, 규격 변경이 완료된 합성 이미지를 이미지 호스팅 등록하고, 호스팅 등록된 합성 이미지의 HTML 코드를 생성하여, 상기 인터넷 쇼핑몰의 상세 페이지에 삽입되는 이미지로 등록하는 페이지 이미지 등록 단계;를 포함하는 것을 특징으로 하는 입력 이미지를 기반으로 인터넷 쇼핑몰에 전시되는 상품 이미지를 생성하는 방법."}
{"patent_id": "10-2021-0136785", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 페이지 이미지 등록 단계는,상기 페이지 이미지 등록 단계 수행 시, 상기 유저 계정에게 상기 객체 분석 단계에서 추출된 키워드를 제공하여, 상기 유저 계정으로 하여금 상기 제공된 키워드를 통해 상기 인터넷 쇼핑몰에 등록될 상기 적어도 하나의객체에 대응되는 상품을 설명하는 설명 정보를 작성하도록 요청하여, 상기 유저 계정에 의해 작성된 설명 정보를 상기 합성 이미지 내에 입력하는 것을 특징으로 하는 입력 이미지를 기반으로 인터넷 쇼핑몰에 전시되는 상품 이미지를 생성하는 방법."}
{"patent_id": "10-2021-0136785", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "하나 이상의 프로세서 및 상기 프로세서에서 수행 가능한 명령들을 저장하는 하나 이상의 메모리를 포함하는 컴퓨팅 장치에서 구현되는 입력 이미지를 기반으로 인터넷 쇼핑몰에 전시되는 상품 이미지를 생성하는 장치에 있어서,유저 계정으로부터 입력 이미지를 수신하는 경우, 상기 수신된 입력 이미지 내에 위치한 적어도 하나의 객체를식별하여, 상기 식별된 적어도 하나의 객체를 추출하는 객체 추출부;상기 객체 추출부의 기능 수행이 완료되면, 기 저장된 배경 데이터 베이스에서 상기 추출된 적어도 하나의 객체에 기반한 복수 개의 배경 이미지를 검색하여, 상기 검색된 복수 개의 배경 이미지 각각에 상기 추출된 적어도하나의 객체를 합성하는 배경 합성 단계; 및상기 검색된 복수 개의 배경 이미지 각각에 상기 추출된 적어도 하나의 객체의 합성이 완료됨에 따라 합성 이미지의 생성이 완료되는 경우, 상기 생성된 합성 이미지를 인터넷 쇼핑몰의 상품 리스트에 삽입되는 이미지 타입인 제1 타입 또는 인터넷 쇼핑몰의 상품 상세 페이지에 삽입되는 이미지 타입인 제2 타입 중 하나의 타입에 대응되도록 편집하여, 인터넷 쇼핑몰에 전시되는 상품 이미지를 생성하는 상품 이미지 생성부;를 포함하는 것을특징으로 하는 입력 이미지를 기반으로 인터넷 쇼핑몰에 전시되는 상품 이미지를 생성하는 장치."}
{"patent_id": "10-2021-0136785", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "컴퓨터-판독가능 기록매체로서,상기 컴퓨터-판독가능 기록매체는, 컴퓨팅 장치로 하여금 이하의 단계들을 수행하도록 하는 명령들을 저장하며,상기 단계들은;유저 계정으로부터 입력 이미지를 수신하는 경우, 상기 수신된 입력 이미지 내에 위치한 적어도 하나의 객체를식별하여, 상기 식별된 적어도 하나의 객체를 추출하는 객체 추출 단계;상기 객체 추출 단계의 기능 수행이 완료되면, 기 저장된 배경 데이터 베이스에서 상기 추출된 적어도 하나의객체에 기반한 복수 개의 배경 이미지를 검색하여, 상기 검색된 복수 개의 배경 이미지 각각에 상기 추출된 적어도 하나의 객체를 합성하는 배경 합성 단계; 및공개특허 10-2023-0053361-5-상기 검색된 복수 개의 배경 이미지 각각에 상기 추출된 적어도 하나의 객체의 합성이 완료됨에 따라 합성 이미지의 생성이 완료되는 경우, 상기 생성된 합성 이미지를 인터넷 쇼핑몰의 상품 리스트에 삽입되는 이미지 타입인 제1 타입 또는 인터넷 쇼핑몰의 상품 상세 페이지에 삽입되는 이미지 타입인 제2 타입 중 하나의 타입에 대응되도록 편집하여, 인터넷 쇼핑몰에 전시되는 상품 이미지를 생성하는 상품 이미지 생성 단계;를 포함하는 것을 특징으로 하는 컴퓨터-판독가능 기록매체."}
{"patent_id": "10-2021-0136785", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 하나 이상의 프로세서 및 상기 프로세서에서 수행 가능한 명령들을 저장하는 하나 이상의 메모리를 포 함하는 컴퓨팅 장치에서 구현되는 입력 이미지를 기반으로 인터넷 쇼핑몰에 전시되는 상품 이미지를 생성하는 방 법에 있어서, 유저 계정으로부터 입력 이미지를 수신하는 경우, 상기 수신된 입력 이미지 내에 위치한 적어도 하 (뒷면에 계속)"}
{"patent_id": "10-2021-0136785", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 입력 이미지를 기반으로 인터넷 쇼핑몰에 전시되는 상품 이미지를 생성하는 방법에 관한 것으로서, 구체적으로는 유저 계정으로부터 상품을 촬영한 입력 이미지를 수신하는 경우, 수신된 이미지 내의 적어도 하나 의 객체를 인식 및 추출하고, 기 저장된 인공지능 알고리즘을 통해 추출된 적어도 하나의 객체를 합성시킬 배경 이미지를 데이터 베이스에서 검색하여, 검색된 배경 이미지에 적어도 하나의 객체를 합성하고, 인터넷 쇼핑몰에 서 요구하는 규격에 대응되도록 편집하여, 인터넷 쇼핑몰에 전시되는 상품 이미지를 생성하는 기술에 관한 것이다."}
{"patent_id": "10-2021-0136785", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "코로나 바이러스(covid-19)로 촉발된 비대면 시대에서 온라인 쇼핑 시장의 규모는 급속도로 성장하고 있다. 통 계청에 따르면 2020년 온라인 쇼핑 시장 규모는 사상 최대치인 161조원 대로 집계되고 있다. 또한, 청년층의 쇼 핑몰 창업에 대한 관심도 증가함에 따라 온라인 쇼핑 시장의 규모는 점차적으로 증가될 것으로 전망하고 있다. 그러나, 온라인 쇼핑 시장에 처음 진입하는 판매자는 상품을 판매하기 위한 전반적인 작업(예: 촬영, 상세 페이 지 제작)에 많은 시간과 비용을 투자하게 되는데, 온라인 쇼핑 시장 특성 상 초반에 투자 대비 매출이 발생하지 않아, 대부분의 판매자들이 손해가 막심하다. 이에 따라, 온라인 쇼핑 플랫폼을 개발하는 기업들은 상품 판매에 소모되는 시간 및 비용을 절감하기 위한 다양한 기술들을 개발하고 있다. 일 예로서, 한국등록특허 10-1952371(원클릭 쇼핑몰 상품 등록 관리에 의한 쇼핑몰 서비스 제공 장치 및 그 방 법)에는 개별 쇼핑몰 운영자가 상품을 쇼핑몰에 등록하기 위한 사진 촬영, 이미지 편집 작업, 텍스트 입력 작업 등의 상품 정보 등록 작업을 원 클릭으로 수행하도록 하는 기술이 개시되어 있다. 그러나, 상술한 기술에서는 단순히 촬영한 사진을 일반적인 툴을 사용해 편집하는 기술만이 개시되어 있을 뿐, 유저 계정으로부터 상품을 촬영한 입력 이미지를 수신하는 경우, 수신된 이미지 내의 적어도 하나의 객체를 인 식 및 추출하고, 기 저장된 인공지능 알고리즘을 통해 추출된 적어도 하나의 객체를 합성시킬 배경 이미지를 데 이터 베이스에서 검색하여, 검색된 배경 이미지에 적어도 하나의 객체를 합성하고, 인터넷 쇼핑몰에서 요구하는 규격에 대응되도록 편집하여, 인터넷 쇼핑몰에 전시되는 상품 이미지를 생성하는 기술이 개시되어 있지 않아, 이를 해결할 수 있는 기술의 필요성이 대두되고 있다."}
{"patent_id": "10-2021-0136785", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "이에 본 발명은, 유저 계정으로부터 상품을 촬영한 입력 이미지를 수신하는 경우, 수신된 이미지 내의 적어도 하나의 객체를 인식 및 추출하고, 기 저장된 인공지능 알고리즘을 통해 추출된 적어도 하나의 객체를 합성시킬 배경 이미지를 데이터 베이스에서 검색하여, 검색된 배경 이미지에 적어도 하나의 객체를 합성하고, 인터넷 쇼 핑몰에서 요구하는 규격에 대응되도록 편집하여, 인터넷 쇼핑몰에 전시되는 상품 이미지를 생성하고, 생성된 이 미지를 인터넷 쇼핑몰에 등록함으로써, 인터넷 쇼핑 시장에서 활동하고 있는 판매자가 소모하는 시간과 비용을 절감시키는 것에 그 목적이 있다."}
{"patent_id": "10-2021-0136785", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 하나 이상의 프로세서 및 상기 프로세서에서 수행 가능한 명령들을 저장하는 하나 이상의 메모리를 포함하는 컴퓨팅 장치에서 구현되는 입력 이미지를 기반으로 인터넷 쇼핑몰에 전시되는 상품 이미지를 생성하는 방법에 있어서, 유저 계정으로부터 입력 이미지를 수신하는 경우, 상기 수신된 입력 이미지내에 위치한 적어도 하나의 객체를 식별하여, 상기 식별된 적어도 하나의 객체를 추출하는 객체 추출 단계; 상 기 객체 추출 단계의 기능 수행이 완료되면, 기 저장된 배경 데이터 베이스에서 상기 추출된 적어도 하나의 객 체에 기반한 복수 개의 배경 이미지를 검색하여, 상기 검색된 복수 개의 배경 이미지 각각에 상기 추출된 적어 도 하나의 객체를 합성하는 배경 합성 단계; 및 상기 검색된 복수 개의 배경 이미지 각각에 상기 추출된 적어도 하나의 객체의 합성이 완료됨에 따라 합성 이미지의 생성이 완료되는 경우, 상기 생성된 합성 이미지를 인터넷 쇼핑몰의 상품 리스트에 삽입되는 이미지 타입인 제1 타입 또는 인터넷 쇼핑몰의 상품 상세 페이지에 삽입되는 이미지 타입인 제2 타입 중 하나의 타입에 대응되도록 편집하여, 인터넷 쇼핑몰에 전시되는 상품 이미지를 생성 하는 상품 이미지 생성 단계;를 포함하는 것을 특징으로 한다. 상기 객체 추출 단계는, 상기 유저 계정으로부터 상기 입력 이미지를 수신하는 경우, 기 저장된 객체 인식 알고 리즘을 기반으로 상기 수신된 입력 이미지를 분석하여, 상기 분석된 입력 이미지 내의 적어도 하나의 객체를 식 별하여 추출하는 객체 식별 단계; 및 상기 입력 이미지에서 상기 적어도 하나의 객체가 추출되는 경우, 상기 추 출된 적어도 하나의 객체에 대한 검토를 상기 유저 계정에게 요청하여, 상기 유저 계정에 의해 상기 추출된 적 어도 하나의 객체에 대한 검토가 완료되면, 상기 적어도 하나의 객체를 이용하여 상기 배경 합성 단계를 시작하 도록 요청하는 합성 요청 단계;를 포함하는 것이 바람직하다. 상기 배경 합성 단계는, 상기 합성 요청 단계의 기능 수행이 완료되는 경우, 기 저장된 인공지능 알고리즘을 기 반으로, 상기 적어도 하나의 객체에 대응되는 상품의 종류, 상기 적어도 하나의 객체에 대응되는 상품의 선호도, 상기 적어도 하나의 객체에 대응되는 상품의 사용 계절 및 상기 적어도 하나의 객체에 대응되는 상품의 트렌드 중 적어도 하나를 분석하는 객체 분석 단계; 상기 객체 분석 단계에 의해 상기 적어도 하나의 객체에 대 응되는 상품에 대한 분석이 완료되는 경우, 상기 상품에 대한 분석 결과 값을 기반으로, 상기 적어도 하나의 객 체와의 적합도가 지정된 수치 이상인 복수 개의 배경 이미지를 기 저장된 배경 데이터 베이스에서 검색하여, 상 기 유저 계정에게 검색된 복수 개의 배경 이미지를 추천하는 배경 이미지 추천 단계; 상기 유저 계정으로부터 상기 추천된 복수 개의 배경 이미지 중 적어도 하나를 선택하는 제1 입력을 수신하는 경우, 상기 수신된 제1 입 력에 기반한 적어도 하나의 배경 이미지에 상기 적어도 하나의 객체를 합성하여, 상기 합성 이미지를 생성하는 제1 합성 단계; 및 상기 유저 계정으로부터 상기 제1 입력이 아닌 다른 배경 이미지를 제공받는 제2 입력을 수 신하는 경우, 상기 제2 입력에 기반한 다른 배경 이미지에 상기 적어도 하나의 객체를 합성하여, 상기 합성 이 미지를 생성하는 제2 합성 단계;를 포함하는 것이 가능하다. 상기 객체 분석 단계는, 상기 제1 합성 단계 및 상기 제2 합성 단계 중 하나가 완료됨에 따라 상기 합성 이미지 의 생성이 완료되는 경우, 상기 기 저장된 인공지능 알고리즘을 기반으로 상기 합성 이미지를 분석하여, 상기 분석된 합성 이미지를 표현하는 키워드를 키워드 데이터 베이스에서 추출하는 것이 가능하다. 상기 기 저장된 인공지능 알고리즘은, 상기 적어도 하나의 객체와 대응되는 상품의 종류와 동일한 종류의 다른 상품의 선호도 데이터, 사용 계절 데이터, 판매량 데이터 및 트렌드 데이터 중 적어도 하나를 학습 데이터로써 머신 러닝하여, 업데이트 되는 것이 가능하다. 상기 상품 이미지 생성 단계는, 상기 합성 이미지의 생성이 완료된 상태에서, 상기 유저 계정으로부터 상기 합 성 이미지를 상기 제1 타입에 대응되는 이미지로 편집하도록 요청하는 입력을 수신하는 경우, 제1 타입 이미지 생성 프로세스를 시작하는 제1 타입 프로세스 시작 단계; 상기 제1 타입 이미지 생성 프로세스가 시작되는 경우, 상기 합성 이미지를 상기 인터넷 쇼핑몰에서 요구하는 썸네일 이미지의 규격으로 변경하거나 상기 인터넷 쇼핑몰에서 제공하는 복수 개의 상품에 대한 제품 리스트 중 하나에 삽입하기 위한 규격으로 변경하는 썸네일 규격 편집 단계; 및 상기 썸네일 규격 편집 단계가 완료되는 경우, 규격 변경이 완료된 합성 이미지를 이미지 호스팅 등록하고, 호스팅 등록된 합성 이미지의 HTML 코드를 생성하여, 상기 인터넷 쇼핑몰에 썸네일 이미지로 등록하는 썸네일 이미지 등록 단계;를 포함하는 것이 가능하다. 상기 상품 이미지 생성 단계는, 상기 합성 이미지의 생성이 완료된 상태에서, 상기 유저 계정으로부터 상기 합 성 이미지를 상기 제2 타입에 대응되는 이미지로 편집하도록 요청하는 입력을 수신하는 경우, 제2 타입 이미지 생성 프로세스를 시작하는 제2 타입 프로세스 시작 단계; 상기 제2 타입 이미지 생성 프로세스가 시작되는 경우, 상기 합성 이미지를 상기 인터넷 쇼핑몰에서 요구하는 상세 페이지에 삽입되는 이미지의 규격으로 변경하 는 페이지 규격 편집 단계; 및 상기 페이지 규격 편집 단계의 수행이 완료되는 경우, 규격 변경이 완료된 합성 이미지를 이미지 호스팅 등록하고, 호스팅 등록된 합성 이미지의 HTML 코드를 생성하여, 상기 인터넷 쇼핑몰의 상세 페이지에 삽입되는 이미지로 등록하는 페이지 이미지 등록 단계;를 포함하는 것이 가능하다. 상기 페이지 이미지 등록 단계는, 상기 페이지 이미지 등록 단계 수행 시, 상기 유저 계정에게 상기 객체 분석 단계에서 추출된 키워드를 제공하여, 상기 유저 계정으로 하여금 상기 제공된 키워드를 통해 상기 인터넷 쇼핑 몰에 등록될 상기 적어도 하나의 객체에 대응되는 상품을 설명하는 설명 정보를 작성하도록 요청하여, 상기 유 저 계정에 의해 작성된 설명 정보를 상기 합성 이미지 내에 입력하는 것이 가능하다. 본 발명의 일 실시예에 따른 하나 이상의 프로세서 및 상기 프로세서에서 수행 가능한 명령들을 저장하는 하나 이상의 메모리를 포함하는 컴퓨팅 장치에서 구현되는 입력 이미지를 기반으로 인터넷 쇼핑몰에 전시되는 상품 이미지를 생성하는 장치에 있어서, 유저 계정으로부터 입력 이미지를 수신하는 경우, 상기 수신된 입력 이미지 내에 위치한 적어도 하나의 객체를 식별하여, 상기 식별된 적어도 하나의 객체를 추출하는 객체 추출부; 상기 객체 추출부의 기능 수행이 완료되면, 기 저장된 배경 데이터 베이스에서 상기 추출된 적어도 하나의 객체에 기 반한 복수 개의 배경 이미지를 검색하여, 상기 검색된 복수 개의 배경 이미지 각각에 상기 추출된 적어도 하나 의 객체를 합성하는 배경 합성 단계; 및 상기 검색된 복수 개의 배경 이미지 각각에 상기 추출된 적어도 하나의 객체의 합성이 완료됨에 따라 합성 이미지의 생성이 완료되는 경우, 상기 생성된 합성 이미지를 인터넷 쇼핑몰 의 상품 리스트에 삽입되는 이미지 타입인 제1 타입 또는 인터넷 쇼핑몰의 상품 상세 페이지에 삽입되는 이미지 타입인 제2 타입 중 하나의 타입에 대응되도록 편집하여, 인터넷 쇼핑몰에 전시되는 상품 이미지를 생성하는 상 품 이미지 생성부;를 포함하는 것을 특징으로 한다. 본 발명의 일 실시예에 따른 컴퓨터-판독가능 기록매체로서, 상기 컴퓨터-판독가능 기록매체는, 컴퓨팅 장치로 하여금 이하의 단계들을 수행하도록 하는 명령들을 저장하며, 상기 단계들은; 유저 계정으로부터 입력 이미지를 수신하는 경우, 상기 수신된 입력 이미지 내에 위치한 적어도 하나의 객체를 식별하여, 상기 식별된 적어도 하 나의 객체를 추출하는 객체 추출 단계; 상기 객체 추출 단계의 기능 수행이 완료되면, 기 저장된 배경 데이터 베이스에서 상기 추출된 적어도 하나의 객체에 기반한 복수 개의 배경 이미지를 검색하여, 상기 검색된 복수 개 의 배경 이미지 각각에 상기 추출된 적어도 하나의 객체를 합성하는 배경 합성 단계; 및 상기 검색된 복수 개의 배경 이미지 각각에 상기 추출된 적어도 하나의 객체의 합성이 완료됨에 따라 합성 이미지의 생성이 완료되는 경우, 상기 생성된 합성 이미지를 인터넷 쇼핑몰의 상품 리스트에 삽입되는 이미지 타입인 제1 타입 또는 인터 넷 쇼핑몰의 상품 상세 페이지에 삽입되는 이미지 타입인 제2 타입 중 하나의 타입에 대응되도록 편집하여, 인 터넷 쇼핑몰에 전시되는 상품 이미지를 생성하는 상품 이미지 생성 단계;를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2021-0136785", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명인 입력 이미지를 기반으로 인터넷 쇼핑몰에 전시되는 상품 이미지를 생성하는 방법은, 유저 계정으로부 터 인터넷 쇼핑몰에 등록할 상품을 촬영한 입력 이미지를 수신하는 경우, 수신된 입력 이미지를 분석하여 분석 된 입력 이미지 내의 적어도 하나의 객체를 추출하고, 추출된 적어도 하나의 객체에 대응되는 배경 이미지를 검 색하며, 검색된 배경 이미지에 추출된 적어도 하나의 객체를 합성할 수 있다. 배경 이미지에 적어도 하나의 객체를 합성하여 합성 이미지의 생성을 완료하는 경우, 인터넷 쇼핑몰에서 요구하 는 썸 네일 이미지 및 상세 페이지 이미지 중 적어도 하나의 이미지에 대응되는 규격으로 합성 이미지를 편집함 으로써, 복수 개의 인터넷 쇼핑몰에서 요구하는 상품 이미지를 생성 및 등록할 수 있다."}
{"patent_id": "10-2021-0136785", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는, 다양한 실시 예들 및/또는 양상들이 이제 도면들을 참조하여 개시된다. 하기 설명에서는 설명을 목 적으로, 하나이상의 양상들의 전반적 이해를 돕기 위해 다수의 구체적인 세부사항들이 개시된다. 그러나, 이러 한 양상(들)은 이러한 구체적인 세부사항들 없이도 실행될 수 있다는 점 또한 본 발명의 기술 분야에서 통상의 지식을 가진 자에게 인식될 수 있을 것이다. 이후의 기재 및 첨부된 도면들은 하나 이상의 양상들의 특정한 예 시적인 양상들을 상세하게 기술한다. 하지만, 이러한 양상들은 예시적인 것이고 다양한 양상들의 원리들에서의 다양한 방법들 중 일부가 이용될 수 있으며, 기술되는 설명들은 그러한 양상들 및 그들의 균등물들을 모두 포함 하고자 하는 의도이다. 본 명세서에서 사용되는 \"실시 예\", \"예\", \"양상\", \"예시\" 등은 기술되는 임의의 양상 또는 설계가 다른 양상 또는 설계들보다 양호하다거나, 이점이 있는 것으로 해석되지 않을 수도 있다. 또한, \"포함한다\" 및/또는 \"포함하는\"이라는 용어는, 해당 특징 및/또는 구성요소가 존재함을 의미하지만, 하나 이상의 다른 특징, 구성요소 및/또는 이들의 그룹의 존재 또는 추가를 배제하지 않는 것으로 이해되어야 한다. 또한, 제 1, 제 2 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소들은 상기 용어들에 의해 한정되지는 않는다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제 1 구성요소는 제 2 구 성요소로 명명될 수 있고, 유사하게 제 2 구성요소도 제 1 구성요소로 명명될 수 있다. 및/또는 이라는 용어는 복수의 관련된 기재된 항목들의 조합 또는 복수의 관련된 기재된 항목들 중의 어느 항목을 포함한다. 또한, 본 발명의 실시 예들에서, 별도로 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여 기서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해 되는 것과 동일한 의미를 가지고 있다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기 술의 문맥 상 가지는 의미와 일치하는 의미를 가지는 것으로 해석되어야 하며, 본 발명의 실시 예에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 도 1은 본 발명의 일 실시예에 따른 입력 이미지를 기반으로 인터넷 쇼핑몰에 전시되는 상품 이미지를 생성하는 방법을 설명하기 위한 순서도이다. 도 1을 참조하면, 하나 이상의 프로세서 및 상기 프로세서에서 수행 가능한 명령들을 저장하는 하나 이상의 메 모리를 포함하는 컴퓨팅 장치에서 구현되는 입력 이미지를 기반으로 인터넷 쇼핑몰에 전시되는 상품 이미지를 생성하는 방법은 객체 추출 단계(S101 단계), 배경 합성 단계(S103 단계) 및 상품 이미지 생성 단계(S105 단 계)를 포함할 수 있다. S101 단계에서, 상기 하나 이상의 프로세서(이하, 프로세서로 칭함)는 유저 계정으로부터 입력 이미지를 수신하 는 경우, 상기 수신된 입력 이미지 내에 위치한 적어도 하나의 객체를 식별하여, 상기 식별된 적어도 하나의 객 체를 추출할 수 있다. 상기 프로세서는 상기 수신된 입력 이미지 내에서 적어도 하나의 객체를 식별하기 위해 기 저장된 객체 인식 알고리즘을 기반으로, 상기 수신된 입력 이미지를 분석하여, 분석 결과에 따라 적어도 하 나의 객체를 식별하고, 식별된 적어도 하나의 객체를 추출할 수 있다. 상기 프로세서가 객체를 식별 및 추출하 기 위한 자세한 설명은 도 2에서 설명하도록 한다. 일 실시예에 따르면, 상기 입력 이미지는, 상기 유저 계정이 인터넷 쇼핑몰을 통해 판매하기 위해 상품을 촬영 한 이미지일 수 있다. 상기 적어도 하나의 객체는 상기 입력 이미지 내에 위치한 상품을 포함할 수 있으며, 상 품뿐만 아니라 상품을 부각하기 위한 모델과 다른 제품을 포함할 수 있다. 일 실시예에 따르면, 상기 프로세서는 상기 적어도 하나의 객체의 추출이 완료되면, 상기 배경 합성 단계(S103 단계)를 수행할 수 있다. S103 단계에서, 상기 프로세서는 상기 객체 추출 단계(S101 단계)의 수행이 완료되면, 기 저장된 배경 데이터 베이스에서 상기 추출된 적어도 하나의 객체에 기반한 복수 개의 배경 이미지를 검색하여, 상기 검색된 복수 개 의 배경 이미지 각각에 상기 추출된 적어도 하나의 객체를 합성할 수 있다. 일 실시예에 따르면, 상기 프로세서는 상기 기 저장된 배경 데이터 베이스에서 상기 복수 개의 배경 이미지를 검색 시, 기 저장된 인공지능 알고리즘을 통해 상기 적어도 하나의 객체에 대한 분석을 실시하여, 상기 적어도하나의 객체에 대응되는 복수 개의 배경 이미지를 검색할 수 있다. 이에 따라, 상기 프로세서는 상기 검색된 복 수 개의 배경 이미지에 상기 적어도 하나의 객체를 합성함으로써, 합성 이미지를 생성할 수 있다. 일 실시예에 따르면, 상기 프로세서는 상기 복수 개의 배경 이미지 각각에 상기 적어도 하나의 객체의 합성을 완료하는 경우, 상품 이미지 생성 단계(S105 단계)를 수행할 수 있다. S105 단계에서, 상기 프로세서는 상기 검색된 복수 개의 배경 이미지 각각에 상기 추출된 적어도 하나의 객체의 합성이 완료됨에 따라 합성 이미지의 생성이 완료되는 경우, 상기 생성된 합성 이미지를 인터넷 쇼핑몰의 상품 리스트에 삽입되는 이미지 타입인 제1 타입 또는 인터넷 쇼핑몰의 상품 상세 페이지에 삽입되는 이미지 타입인 제2 타입 중 하나의 타입에 대응되도록 편집할 수 있다. 일 실시예에 따르면, 상기 프로세서는 상기 합성 이미지의 편집을 완료함으로써, 인터넷 쇼핑몰에 전시되는 상 품 이미지를 생성할 수 있다. 상기 합성 이미지는 상기 복수 개의 배경 이미지 중 적어도 하나에 상기 적어도 하나의 객체가 합성됨으로써, 생성되는 이미지로써, 인터넷 쇼핑몰에서 요구하는 규격에 대응되도록 수정하기 이전의 이미지일 수 있다. 즉, 상기 상품 이미지는 상기 합성 이미지를 인터넷 쇼핑몰에서 요구하는 규격에 따라 편집 완료한 이미지로써, 인터넷 쇼핑몰에 전시되어, 인터넷 쇼핑몰에 접속하는 다른 유저 계정들에게 제공되는 이미지일 수 있다. 보다 정확하게, 본 명세서에 개시되는 본 발명의 기술적 특징들은, 판매자가 네이버, 쿠팡 및 11번가와 같은 쇼 핑 플랫폼에 상품을 등록하거나 개인 쇼핑몰에 상품을 등록 시, 판매자의 시간과 비용을 획기적으로 절감하기 위한 목적을 가지는 특징들을 개시할 수 있다. 도 2는 본 발명의 일 실시예에 따른 입력 이미지를 기반으로 인터넷 쇼핑몰에 전시되는 상품 이미지를 생성하는 방법의 객체 추출 단계를 설명하기 위한 순서도이다. 도 2를 참조하면, 하나 이상의 프로세서 및 상기 프로세서에서 수행 가능한 명령들을 저장하는 하나 이상의 메 모리를 포함하는 컴퓨팅 장치에서 구현되는 입력 이미지를 기반으로 인터넷 쇼핑몰에 전시되는 상품 이미지를 생성하는 방법은 객체 추출 단계(예: 도 1의 객체 추출 단계(S101 단계))를 포함할 수 있다. 일 실시예에 따르면, 상기 하나 이상의 프로세서(이하, 프로세서로 칭함)는 유저 계정으로부터 입력 이미지를 수신하는 경우, 수신된 입력 이미지 내에서 적어도 하나의 객체를 식별 및 추출할 수 있다. 일 실시예에 따르면, 상기 객체 추출 단계는 상기 입력 이미지 내에서 상기 적어도 하나의 객체를 식별 및 추출 하기 위한 단계인 객체 식별 단계(S201 단계) 및 합성 요청 단계(S203 단계)를 포함할 수 있다. S201 단계에서, 상기 프로세서는 상기 유저 계정으로부터 상기 입력 이미지를 수신하는 경우, 기 저장된 객체 인식 알고리즘을 기반으로 상기 수신된 입력 이미지를 분석할 수 있다. 상기 프로세서는 상기 수신된 입력 이미 지를 분석하여, 상기 분석된 입력 이미지 내의 적어도 하나의 객체를 식별할 수 있다. 일 실시예에 따르면, 상기 기 저장된 객체 인식 알고리즘은 CNN(Convolutional Neural Network) 알고리즘, R- CNN(Region Convolutional Neural Network) 알고리즘, Fast R-CNN(Fast Region Convolutional Neural Network) 알고리즘, RFCN(Region based Fully Convolutional Neural Network) 알고리즘, YOLO(You Only Look Once) 알고리즘 및 SSD(Single Shot Detector) 알고리즘 중 적어도 하나를 포함할 수 있으며, 이미지 또는 영상 내의 객체를 인식할 수 있는 알고리즘이면 이에 한정되지 않는다. 예를 들어, 상기 프로세서는 상기 기 저장된 객체 인식 알고리즘으로써, 상기 RFCN 알고리즘을 이용하여, 상기 입력 이미지 내에 위치한 적어도 하나의 객체를 인식할 수 있다. 상기 프로세서는 입력 이미지 내에서 위치 정 보를 포함하고 있는 스코어 맵(score map)을 이용하여, 상품의 위치를 정확하고 효율적으로 찾아낼 수 있다. 상 기 스코어 맵은 CNN 알고리즘을 통해 추출된 특징 맵(feature map)으로부터 획득되며, 각 스코어 맵은 입력된 이미지 내 특정 위치의 정보를 포함할 수 있다. 이에 따라, 상기 프로세서는 특정 위치의 정보를 이용하여 특정 위치마다 분류 결과를 얻어내고, 이 결과를 종합하여 최종적으로 특정 위치 내의 객체를 식별하여 분류할 수 있 다. 즉, 상기 프로세서는 상기 객체 식별 단계(S201)를 통해 상기 기 저장된 객체 인식 알고리즘을 기반으로, 상기 입력 이미지 내의 적어도 하나의 객체를 식별하고, 식별된 적어도 하나의 객체를 추출할 수 있다. 일 실시예에 따르면, 상기 프로세서는 상기 입력 이미지 내에서 적어도 하나의 객체의 추출을 완료하는 경우, 합성 요청 단계(S203 단계)를 수행할 수 있다.S203 단계에서, 상기 프로세서는 상기 입력 이미지에서 상기 적어도 하나의 객체가 추출되는 경우, 상기 추출된 적어도 하나의 객체에 대한 검토를 상기 유저 계정에게 요청할 수 있다. 일 실시예에 따르면, 상기 프로세서는 상기 객체 식별 단계(S201)에서 추출된 적어도 하나의 객체가 배경 이미 지에 삽입되는 객체인지를 인식하지 못할 수 있다. 더불어, 상기 입력 이미지 내에 포함된 적어도 하나의 객체 가 인터넷 쇼핑몰에서 판매할 상품뿐만이 아니라, 상품을 사용하고 있는 모델이거나 상품의 기능을 부각하기 위 한 제품을 포함할 수 있다. 이에 따라, 상기 프로세서는 상기 입력 이미지 내에서 추출된 적어도 하나의 객체를 배경 이미지에 합성하기 위하여, 상기 추출된 적어도 하나의 객체를 상기 유저 계정에게 제공하여, 상기 유저 계정으로부터 상기 추출된 적어도 하나의 객체가 상기 배경 이미지와 합성될 객체인지를 검토 받을 수 있다. 일 실시예에 따르면, 상기 프로세서는 상기 유저 계정에 의해 상기 추출된 적어도 하나의 객체(예: 검토 전 적 어도 하나의 객체(제1 객체))에 대한 검토가 완료되는 경우, 적어도 하나의 객체(예: 검토 후 적어도 하나의 객 체(제2 객체))를 이용하여 배경 합성 단계(예: 도 1의 배경 합성 단계(S103))를 시작할 수 있다. 즉, 상기 프로 세서는 상기 입력 이미지 내에서 추출된 적어도 하나의 객체가 배경 이미지와 합성될 객체인지를 상기 유저 계 정으로 하여금 검토하도록 하고, 상기 유저 계정으로부터 상기 검토 결과에 기반한 적어도 하나의 객체가 입력 되는 경우, 상기 적어도 하나의 하나의 객체를 이용하여 다음 단계를 수행할 수 있다. 다른 실시예에 따르면, 상기 프로세서는 이미지뿐만 아니라 유저 계정으로부터 동영상을 수신하는 경우, 상기 수신된 동영상 내의 객체를 식별 및 추출할 수 있다. 이 때, 상기 프로세서가 상기 동영 상 내에서 객체를 식별 및 추출 시, 유저 계정으로부터 식별할 객체를 선택하는 입력을 수신할 수 있다. 상기 프로세서는 유저 계정으 로부터 식별할 객체를 선택하는 입력을 수신한 경우, 상기 입력에 대응되는 객체를 상기 동영상 내에서 추출할 수 있다. 도 3은 본 발명의 일 실시예에 따른 입력 이미지를 기반으로 인터넷 쇼핑몰에 전시되는 상품 이미지를 생성하는 장치의 배경 합성부를 설명하기 위한 순서도이다. 도 3을 참조하면, 하나 이상의 프로세서 및 상기 프로세서에서 수행 가능한 명령들을 저장하는 하나 이상의 메 모리를 포함하는 컴퓨팅 장치에서 구현되는 입력 이미지를 기반으로 인터넷 쇼핑몰에 전시되는 상품 이미지를 생성하는 장치는 배경 합성부를 포함할 수 있다. 일 실시예에 따르면, 상기 배경 합성부는 도 1에서 언급된 배경 합성 단계(S103)에서 수행되는 동일한 기 능을 수행하는 구성일 수 있다. 즉, 상기 배경 합성부는, 입력 이미지 내에서 적어도 하나의 객체(301a) 추출이 완료되는 경우, 기 저장된 배경 데이터 베이스에서 상기 추출된 적어도 하나의 객체(301a)에 기반한 복 수 개의 배경 이미지(301b)를 검색하여, 상기 검색된 복수 개의 배경 이미지(301b) 각각에 상기 추출된 적어도 하나의 객체(301a)를 합성할 수 있다. 일 실시예에 따르면, 상기 배경 합성부는 상기 언급한 기능들을 수행하기 위한 객체 분석부(미도시), 배경 이미지 추천부(미도시), 제1 합성부(미도시) 및 제2 합성부(미도시)를 포함할 수 있다. 일 실시예에 따르면, 상기 객체 분석부는 합성 요청부의 기능 수행이 완료되는 경우, 기 저장된 인공지능 알고 리즘을 기반으로 상기 적어도 하나의 객체(301a)에 대응되는 상품의 종류, 상기 적어도 하나의 객체(301a)에 대 응되는 상품의 선호도, 상기 적어도 하나의 객체(301a)에 대응되는 상품의 사용 계절 및 상기 적어도 하나의 객 체(301a)에 대응되는 상품의 트렌드, 상기 적어도 하나의 객체(301a)에 대응되는 상품의 색상 및 크기 중 적어 도 하나를 분석할 수 있다. 이 때, 상기 합성 요청부는 도 2에서 언급되는 합성 요청 단계(S203)와 동일한 기능 을 수행하는 구성일 수 있다. 일 실시예에 따르면, 상기 기 저장된 인공지능 알고리즘은 CNN(convolutional neural network) 알고리즘 및 RNN(recurrent neural network) 알고리즘을 포함하고 있어, 상기 객체 분석부가 상기 기 저장된 인공지능 알고 리즘을 통해 적어도 하나의 객체(301a)에 대응되는 상품을 분석하는 것은 당연할 것이다. 예를 들어, 상기 객체 분석부는 상기 합성 요청부의 기능 수행이 완료되는 경우, 상기 기 저장된 인공지능 알고 리즘을 통해 적어도 하나의 객체(301a)인 \"코트\"를 분석할 수 있다. 이 때, 상기 객체 분석부는 상기 기 저장된 인공지능 알고리즘을 통해 상기 적어도 하나의 객체(301a)를 분석하여, 적어도 하나(301a)의 객체의 종류가 \"의 류\"인 것을 확인할 수 있다. 상기 객체 분석부는 상기 기 저장된 인공지능 알고리즘을 통해 상기 적어도 하나의 객체를 분석하여, \"코트\"의 선호도가 \"버버리>스튜디오 톰보이>막스마라>잇미샤\"인 것을 확인할 수 있다. 상기 객체 분석부는 상기 기 저장된 인공지능 알고리즘을 통해 상기 적어도 하나의 객체(301a)를 분석하여, \"코트\"의사용 계절이 늦가을부터 봄까지인 것을 확인할 수 있다. 상기 객체 분석부는 상기 기 저장된 인공지능 알고리즘 을 통해 상기 적어도 하나의 객체(301a)를 분석하여, \"코트\"의 현재 트렌드가 \"롱 코트\"인 것을 확인할 수 있다. 이 때, 기 저장된 인공지능 알고리즘은 학습 데이터 베이스에 저장된 복수 개의 학습 데이터를 머신 러닝 하여, 입력 이미지 내의 적어도 하나의 객체(301a)를 분석할 수 있다. 일 실시예에 따르면, 상기 기 저장된 인공지능 알고리즘은 적어도 하나의 객체(301a)와 대응되는 상품의 종류와 동일한 종류의 다른 상품의 선호도 데이터, 사용 계절 데이터, 판매량 데이터 및 트렌드 데이터 중 적어도 하나 를 학습 데이터로써 머신 러닝하여, 업데이트될 수 있다. 즉, 상기 기 저장된 인공지능 알고리즘은 상기 학습 데이터 베이스에 저장된 복수 개의 상품 각각에 대한 선호도 데이터, 사용 계절 데이터, 판매량 데이터 및 트렌 드 데이터 중 적어도 하나를 포함하는 빅 데이터를 학습 데이터로 활용하여, 머신 러닝을 수행할 수 있다. 다른 실시예에 따르면, 상기 학습 데이터 베이스에는 복수 개의 상품 만이 아니라 모델에 대한 빅 데이터(예: 모델에 대한 연령 별 선호도 데이터, 모델에 대한 패션 스타일 데이터, 모델에 대한 상품 별 선호도 데이터 등)를 포함할 수 있다. 이에 따라, 상기 객체 분석부는 상기 기 저장된 인공지능 알고리즘을 통해 적어도 하나 의 객체를 분석하여, 적어도 하나의 객체가 \"코트를 입고 있는 모델\"인 경우, \"코트\"뿐만 아니라 \"모델\"에 대한 분석을 진행할 수 있다. 일 실시예에 따르면, 상기 배경 이미지 추천부는 상기 객체 분석부에 의해 상기 적어도 하나의 객체(301a)에 대 응되는 상품에 대한 분석이 완료되는 경우, 상기 상품에 대한 분석 결과 값을 기반으로, 상기 적어도 하나의 객 체와의 적합도가 지정된 수치 이상인 복수 개의 배경 이미지(301b)를 기 저장된 배경 데이터 베이스에서 검색할 수 있다. 상기 배경 이미지 추천부는 상기 복수 개의 배경 이미지(301b)의 검색이 완료되는 경우, 상기 유저 계 정에게 검색된 복수 개의 배경 이미지(301b)를 추천할 수 있다. 일 실시예에 따르면, 상기 분석 결과 값은, 상기 객체 분석부가 기 저장된 인공지능 알고리즘을 통해 적어도 하 나의 객체(301a)에 대응되는 상품을 분석하여 획득한 정보일 수 있다. 보다 정확하게, 상기 배경 이미지 추천부 는 상기 기 저장된 인공지능 알고리즘을 통해 상기 분석 결과 값에 기반한 복수 개의 배경 이미지(301b)를 상기 기 저장된 배경 데이터 베이스에서 검색할 수 있다. 즉, 상기 기 저장된 인공지능 알고리즘은 복수 개의 상품 및 모델 중 적어도 하나에 기반한 배경 이미지(301b)를 검색 가능한 알고리즘일 수 있으며, 상기 배경 합성부에 서 수행되는 기능 전반적인 과정에서 활용되는 알고리즘일 수 있다. 예를 들어, 상기 배경 이미지 추천부는, 상기 객체 분석부에 의해 분석된 \"코트\"에 대한 분석 결과 값(예: 코트 의 선호도, 코트의 사용 계절 및 코트의 트렌드)을 상기 기 저장된 인공지능 알고리즘을 통해 분석하여, 상기 기 저장된 배경 데이터 베이스에서 모던한 카페 배경, 낙엽이 많은 공원 배경 등의 복수 개의 배경을 검색해 상 기 유저 계정에게 추천할 수 있다. 다른 예를 들어, 상기 배경 이미지 추천부는, 상기 객체 분석부에 의해 분석된 \"코트\" 및 \"모델\"에 대한 분석 결과 값(예: 코트의 선호도, 모델 별 선호 연령 대, 코트의 색상)을 상기 기 저장된 인공지능 알고리즘을 통해 분석하여, 상기 기 저장된 배경 데이터 베이스에서 \"베이지 색 롱 코트를 착장한 20~30대 여성들이 선호하는 모 델\"과의 적합도가 지정된 수치 이상인 낙엽이 많은 수목원 배경, 노을이 보이는 해변 배경, 고층 빌딩이 많은 도심가 등의 배경 이미지를 검색할 수 있다. 일 실시예에 따르면, 상기 제1 합성부는 상기 유저 계정으로부터 상기 배경 이미지 추천부에 의해 추천된 복수 개의 배경 이미지(301b) 중 적어도 하나를 선택하는 제1 입력을 수신하는 경우, 상기 수신된 제1 입력에 기반한 적어도 하나의 배경 이미지(301b)에 상기 적어도 하나의 객체(301a)를 합성하여, 합성 이미지(301c)를 생성할 수 있다. 즉, 상기 제1 합성부는 상기 유저 계정에게 추천된 복수 개의 배경 이미지(301b) 중 상기 유저 계정에 의해 적어도 하나가 선택되면, 상기 유저 계정에 의해 선택된 배경 이미지(301b)에 상기 적어도 하나의 객체 (301a)를 합성하는 기능을 수행할 수 있다. 일 실시예에 따르면, 상기 제2 합성부는 상기 유저 계정으로부터 제1 입력이 아닌 다른 배경 이미지를 제공받는 제2 입력을 수신하는 경우, 상기 제2 입력에 기반한 다른 배경 이미지에 상기 적어도 하나의 객체를 합성하여, 합성 이미지를 생성할 수 있다. 일 실시예에 따르면, 상기 객체 분석부는 상기 제1 합성부 및 상기 제2 합성부 중 하나가 완료됨에 따라 상기 합성 이미지의 생성이 완료되는 경우, 상기 기 저장된 인공지능 알고리즘을 기반으로, 상기 합성 이미지를 분석 할 수 있다. 상기 객체 분석부는 상기 합성 이미지의 분석을 완료하면, 상기 분석된 합성 이미지를 표현하는 키 워드를 키워드 데이터 베이스에서 추출할 수 있다. 상기 객체 분석부가 상기 기 저장된 인공지능 알고리즘을 기반으로, 상기 합성 이미지를 분석하여, 상기 합성 이미지를 표현하는 키워드를 추출하는 자세한 설명은 도 4에 서 설명하도록 한다. 도 4는 본 발명의 일 실시예에 따른 입력 이미지를 기반으로 인터넷 쇼핑몰에 전시되는 상품 이미지를 생성하는 방법의 기 저장된 인공지능 알고리즘을 설명하기 위한 도면이다. 도 4를 참조하면, 하나 이상의 프로세서 및 상기 프로세서에서 수행 가능한 명령들을 저장하는 하나 이상의 메 모리를 포함하는 컴퓨팅 장치에서 구현되는 입력 이미지를 기반으로 인터넷 쇼핑몰에 전시되는 상품 이미지를 생성하는 방법은 기 저장된 인공지능 알고리즘을 통해 입력 이미지 내의 적어도 하나의 객체를 분석하거나 분석 된 적어도 하나의 객체에 기반한 복수 개의 배경 이미지를 검색할 수 있다. 상기 적어도 하나의 객체에 대한 설 명은 도 1 내지 도 3을 참고하도록 한다. 일 실시예에 따르면, 상기 기 저장된 인공지능 알고리즘은 학습 데이터 베이스(예: 도 3의 학습 데이터 베 이스) 및 키워드 데이터 베이스 중 적어도 하나에 저장되어 있는 데이터들을 학습 데이터로 활용하여, 업데이트될 수 있다. 일 실시예에 따르면, 상기 학습 데이터 베이스는 외부 서버(예: 통계 기관의 서버)의 데이터 베이스일 수 있다. 즉, 상기 기 저장된 인공지능 알고리즘은 외부 서버로부터 실시간으로 데이터를 수신받아, 수신된 데이터를 머신러닝하여 업데이트될 수 있다. 이 때, 상기 학습 데이터 베이스에 저장되어 있는 데이터는 적어도 하나의 객체와 대응되는 상품의 종류와 동일한 종류의 다른 상품의 선호도 데이터, 사용 계절 데이터, 판매량 데이터 및 트렌드 데이터 및 배경 이미지 데이터 중 적어도 하나를 포함할 수 있다. 일 실시예에 따르면, 상기 기 저장된 인공지능 알고리즘은 키워드 데이터 베이스로부터 합성 이미지 (예: 도 3의 합성 이미지)에 기반한 키워드를 추출할 수 있다. 이 때, 상기 키워드 데이터 베이스는 외부 서버 (예: 네이버 블로그)로부터 추출할 수 있다. 예를 들어, 상기 기 저장된 인공지능 알고리즘은 네이버 블로 그에 개시되어 있는 개시 글과 특정 상품에 대한 이미지, 해당 개시 글에 기재된 댓글 등을 확인하고, 확인된 내용을 기반으로 머신러닝을 수행하여 업데이트됨에 따라, 합성 이미지와 관련된 키워드를 상기 외부 서버로부 터 추출할 수 있다. 보다 정확하게, 상기 기 저장된 인공지능 알고리즘은 제1 합성부(예: 도 3의 제1 합성부) 및 제2 합성부 (예: 도 3의 제2 합성부) 중 하나의 기능 수행이 완료됨에 따라 생성되는 합성 이미지를 분석하고, 분석된 합성 이미지를 표현하는 키워드를 상기 키워드 데이터 베이스에서 추출할 수 있다. 이 때, 추출되는 키워드는, 사용 자가 인터넷 포털 사이트에서 해당 키워드를 입력하여 검색 진행 시, 상기 합성 이미지를 등록하고 있는 인터넷 쇼핑몰을 사용자에게 검색 결과로써 제공하기 위한 태그 역할의 기능을 포함할 수 있다. 도 5는 본 발명의 일 실시예에 따른 입력 이미지를 기반으로 인터넷 쇼핑몰에 전시되는 상품 이미지를 생성하는 장치의 상품 이미지 생성부를 설명하기 위한 도면이다. 도 5를 참조하면, 하나 이상의 프로세서 및 상기 프로세서에서 수행 가능한 명령들을 저장하는 하나 이상의 메 모리를 포함하는 컴퓨팅 장치에서 구현되는 입력 이미지를 기반으로 인터넷 쇼핑몰에 전시되는 상품 이미지를 생성하는 장치는 상품 이미지 생성부를 포함할 수 있다. 상기 상품 이미지 생성부 도 1에서 언급된 상품 이미지 생성 단계(S105 단계)에서 수행되는 기능과 동일한 기능을 수행하는 구성일 수 있다. 일 실시예에 따르면, 상기 상품 이미지 생성부는 검색된 복수 개의 배경 이미지 각각에 입력 이미지 내에 서 추출된 적어도 하나의 객체의 합성이 완료됨에 따라 합성 이미지(505a)의 생성이 완료되는 경우, 상기 생성 된 합성 이미지(505a)를 인터넷 쇼핑몰의 상품 리스트에 삽입되는 이미지 타입인 제1 타입 또는 인터넷 쇼핑몰 의 상품 상세 페이지에 삽입되는 이미지 타입인 제2 타입 중 하나의 타입에 대응되도록 편집할 수 있다. 도 5에서는 상기 상품 이미지 생성부가 상기 합성 이미지(505a)를 제1 타입에 대응되는 이미지 타입으로 편집하는 방법에 대해서 설명하도록 한다. 일 실시예에 따르면, 상기 상품 이미지 생성부는 상술한 기능을 수행하기 위한 구성인 제1 타입 프로세스 시작부, 썸네일 규격 편집부 및 썸네일 이미지 등록부를 포함할 수 있다. 일 실시예에 따르면, 상기 제1 타입 프로세스 시작부는 제1 합성부(예: 도 3의 제1 합성부) 및 제2 합성부 (예: 도 3의 제2 합성부) 중 하나에 의해 상기 합성 이미지의 생성이 완료된 상태에서, 유저 계정으로부터 상기 합성 이미지(505a)를 상기 제1 타입에 대응되는 이미지로 편집하도록 요청하는 입력을 수신하는 경우, 제1 타입이미지 생성 프로세스를 시작할 수 있다. 일 실시예에 따르면, 상기 제1 타입 이미지 생성 프로세스는 상기 합성 이미지(505a)를 인터넷 쇼핑몰에서 요구 하는 썸 네일 이미지의 규격으로 편집하기 위한 프로세스일 수 있다. 상기 썸 네일 이미지는 인터넷 쇼핑몰에서 상품을 판매하기 위해 등록되는 상품의 대표 이미지를 의미할 수 있다. 일 실시예에 따르면, 상기 제1 타입 프로세스 시작부는 상기 합성 이미지(505a)를 인터넷 쇼핑몰에서 제공 하는 규격으로 변경하기 위해 유저 계정으로부터 쇼핑몰 링크(예: 네이버의 스마트 스토어, 쿠팡, 11번가의 링 크)를 입력 받을 수 있다. 상기 제1 타입 프로세스 시작부는 쇼핑몰 링크가 입력되면, 기 저장된 쇼핑몰 데이터 베이스에 저장된 복수 개의 쇼핑몰 규격 정보 중 상기 입력된 쇼핑몰 링크에 대응되는 쇼핑몰 규격 정보 를 검색하고, 검색된 쇼핑몰 규격 정보를 통해 썸네일 이미지에 대한 규격을 확인할 수 있다. 일 실시예에 따르면, 상기 썸네일 규격 편집부는 상기 제1 타입 이미지 생성 프로세스가 시작되는 경우, 상기 합성 이미지(505a)를 인터넷 쇼핑몰에서 요구하는 썸네일 이미지의 규격으로 변경하거나 인터넷 쇼핑몰에 서 제공하는 복수 개의 상품에 대한 제품 리스트 중 하나에 삽입하기 위한 규격으로 변경할 수 있다. 예를 들어, 상기 썸네일 규격 편집부는 상기 제1 타입 이미지 생성 프로세스가 시작되는 경우, 상기 합성 이미지(505a)를 네이버 스마트 스토어에서 요구하는 썸네일 이미지의 규격으로 편집할 수 있다. 보다 정확하게 상기 썸네일 규격 편집부는 상기 합성 이미지(505a)의 사이즈를 640x640픽셀 사이즈의 정사각형 형태로 편 집할 수 있다. 상기 썸네일 규격 편집부는 상기 합성 이미지(505a)의 용량을 4MB미만으로 압축할 수 있다. 상기 썸네일 규격 편집부는 상기 합성 이미지(505a)의 파일 형식을 jpg, jpeg, gif, png 중 하나로 변경할 수 있다. 더불어, 상기 썸네일 규격 편집부는 상기 합성 이미지(505a)의 누끼를 편집하거나 일부 영역을 삭제, 색 전환, 부분 강조할 수 있다. 일 실시예에 따르면, 상기 썸네일 규격 편집부는 합성 이미지(505a)의 규격이 변경 완료되면, 인터넷 쇼핑 몰에서 제공하는 복수 개의 상품에 대한 제품 리스트 중 하나에 삽입하기 위하여, 상기 합성 이미지(505a)의 규 격을 상기 제품 리스트에 삽입되기 위한 규격으로 변경할 수 있다. 상기 제품 리스트는 복수 개의 판매자가 등 록한 상품들에 대한 대략적인 이미지와 정보가 포함된 리스트일 수 있다. 일 실시예에 따르면, 상기 썸네일 이미지 등록부는 상기 썸네일 규격 편집부의 기능 수행이 완료되는 경우, 규 격 변경이 완료된 합성 이미지(505a)를 이미지 호스팅 등록할 수 있다. 상기 썸네일 이미지 등록부는 상기 합성 이미지(505a)의 이미지 호스팅 등록이 완료되는 경우, 상기 호스팅 등록된 합성 이미지(505a)의 HTML 코드를 생 성하여, 상기 인터넷 쇼핑몰에 썸네일 이미지로 등록할 수 있다. 일 실시예에 따르면, 상기 이미지 호스팅은 대용량 파일로 인해 트래픽(traffic)이 자주 초과되는 사용자들에게 파일의 저장 및 링크를 목적으로 제공하기 위한 이미지 및 파일에 대한 링크 전용 호스팅 서비스일 수 있다. 이 때, 이미지 호스팅된 합성 이미지는 HTML(Hypertext Markup Language) 코드로 생성하고, 사용자는 상기 생성된 HTML 코드를 통해 합성 이미지(505a)를 시청할 수 있다. 즉, 상기 썸네일 이미지 등록부는 상기 HTML 코드를 통 해 인터넷 쇼핑몰의 대표 이미지 등록 항목(505b)에 상기 합성 이미지(505a)를 썸네일 이미지로써 등록할 수 있 다. 다른 실시예에 따르면, 상기 상품 이미지 생성부는 도 2에서 언급된 동영상을 기반으로 추출된 객체에 기 반한 상품 이미지를 생성할 수 있다. 즉, 상기 상품 이미지 생성부는 동영상 내에서 객체의 추출이 완료되 면, 추출된 객체를 기반으로, 상기 제1 타입 프로세스 시작부, 상기 썸네일 규격 편집부 및 상기 썸 네일 이미지 등록부 중 적어도 하나의 기능을 수행하여, 썸 네일 이미지를 생성할 수 있다. 도 6은 본 발명의 일 실시예에 따른 입력 이미지를 기반으로 인터넷 쇼핑몰에 전시되는 상품 이미지를 생성하는 장치의 상품 이미지 생성부를 설명하기 위한 다른 도면이다. 도 6을 참조하면, 하나 이상의 프로세서 및 상기 프로세서에서 수행 가능한 명령들을 저장하는 하나 이상의 메 모리를 포함하는 컴퓨팅 장치에서 구현되는 입력 이미지를 기반으로 인터넷 쇼핑몰에 전시되는 상품 이미지를 생성하는 장치는 상품 이미지 생성부(예: 도 5의 상품 이미지 생성부)를 포함할 수 있다. 상기 상품 이미지 생성부 도 1에서 언급된 상품 이미지 생성 단계(S105 단계)에서 수행되는 기능과 동일한 기능을 수 행하는 구성일 수 있다. 일 실시예에 따르면, 상기 상품 이미지 생성부는 검색된 복수 개의 배경 이미지 각각에 입력 이미지 내에 서 추출된 적어도 하나의 객체의 합성이 완료됨에 따라 합성 이미지의 생성이 완료되는 경우, 상기 생성된 합성이미지를 인터넷 쇼핑몰의 상품 리스트에 삽입되는 이미지 타입인 제1 타입 또는 인터넷 쇼핑몰의 상품 상세 페 이지에 삽입되는 이미지 타입인 제2 타입 중 하나의 타입에 대응되도록 편집할 수 있다. 도 6에서는 상기 상품 이미지 생성부가 상기 합성 이미지를 제2 타입에 대응되는 이미지 타입으로 편집하 는 방법에 대해서 설명하도록 한다. 일 실시예에 따르면, 상기 상품 이미지 생성부는 상술한 기능을 수행하기 위한 구성인 제2 타입 프로세스 시작부, 페이지 규격 편집부 및 페이지 이미지 등록부를 포함할 수 있다. 일 실시예에 따르면, 상기 제2 타입 프로세스 시작부는 합성 이미지의 생성이 완료된 상태에서, 유저 계정 으로부터 상기 합성 이미지를 제2 타입에 대응되는 이미지로 편집하도록 요청하는 입력을 수신하는 경우, 제2 타입 이미지 생성 프로세스를 시작할 수 있다. 일 실시예에 따르면, 상기 제2 타입 이미지 생성 프로세스는 상기 합성 이미지를 인터넷 쇼핑몰에서 요구하는 상세 페이지에 삽입되는 이미지의 규격으로 편집하기 위한 프로세스일 수 있다. 상기 상세 페이지에 삽입되는 이미지는 상품에 대한 기능 정보 및 디자인 정보를 인터넷 쇼핑몰에 접속하는 사용자에게 제공하기 위하여, 상 품을 홍보하기 위한 목적을 가지는 이미지일 수 있다. 일 실시예에 따르면, 상기 제2 타입 프로세스 시작부는 상기 합성 이미지를 인터넷 쇼핑몰에서 요구하는 상세 페이지에 삽입되는 이미지의 규격으로 변경하기 위해 유저 계정으로부터 쇼핑몰 링크(예: 네이버의 스마트 스토어, 쿠팡, 11번가의 링크)를 입력 받을 수 있다. 상기 제2 타입 프로세스 시작부는 쇼핑몰 링크가 입 력되면, 기 저장된 쇼핑몰 데이터 베이스(예: 도 4의 기 저장된 쇼핑몰 데이터 베이스)에 저장된 복수 개의 쇼 핑몰 규격 정보 중 상기 입력된 쇼핑몰 링크에 대응되는 쇼핑몰 상세 페이지 규격 정보를 검색하고, 검색된 쇼 핑몰 상세 페이지 규격 정보를 통해 상세 페이지에 삽입되는 이미지에 대한 규격을 확인할 수 있다. 일 실시예에 따르면, 상기 페이지 규격 편집부는 상기 제2 타입 이미지 생성 프로세스가 시작되는 경우, 상기 합성 이미지를 인터넷 쇼핑몰에서 요구하는 상세 페이지에 삽입되는 이미지의 규격으로 변경할 수 있다. 예를 들어, 상기 페이지 규격 편집부는 상기 제2 타입 이미지 생성 프로세스가 시작되는 경우, 상기 합성 이미지를 네이버 스마트 스토어에서 요구하는 상세 페이지에 삽입되는 이미지의 규격으로 편집할 수 있다. 보다 정확하게 상기 페이지 규격 편집부는 상기 합성 이미지의 해상도를 720dpi로 편집할 수 있다. 상기 페이지 규격 편집부는 상기 합성 이미지의 사이즈를 860x860픽셀 사이즈의 정사각형 형태로 편집할 수 있다. 상기 페이지 규격 편집부는 상기 합성 이미지의 파일 형식을 jpg, jpeg, gif, png 중 하나로 변경할 수 있다. 더불어, 상기 페이지 규격 편집부는 상기 합성 이미지의 누끼를 편집하거나 일부 영역을 삭제, 색 전환, 부분 강조할 수 있다. 일 실시예에 따르면, 상기 페이지 이미지 등록부는 상기 페이지 규격 편집부의 기능 수행이 완료되는 경우, 규격 변경이 완료된 합성 이미지를 이미지 호스팅 등록하고, 호스팅 등록된 합성 이미지의 HTML(Hypertext Markup Language) 코드를 생성하여, 상기 인터넷 쇼핑몰의 상세 페이지에 삽입되는 이미지로 등 록할 수 있다. 일 실시예에 따르면, 상기 페이지 이미지 등록부는 유저 계정에게 객체 분석부(예: 도 3의 객체 분석부)에 의해 추출된 키워드를 제공할 수 있다. 보다 정확하게, 상기 페이지 이미지 등록부는 합성 이미지의 규격 을 변경 시, 상기 객체 분석부에 의해 추출된 키워드를 유저 계정에게 제공하여, 유저 계정으로 하여금 상기 제 공된 키워드를 통해 인터넷 쇼핑몰에 등록될 적어도 하나의 객체 대응되는 상품을 설명하는 설명 정보를 작성하 도록 요청할 수 있다. 일 실시예에 따르면, 상기 페이지 이미지 등록부는 상기 유저 계정에 의해 상기 설명 정보의 작성이 완료 되면, 상기 작성된 설명 정보를 상기 합성 이미지 내에 입력할 수 있다. 상기 설명 정보는 상기 상품에 대한 기 능, 디자인, 사용 방법을 상기 상품을 구매하는 사용자에게 제공하기 위한 정보일 수 있다. 예를 들어, 상기 페이지 이미지 등록부는, 상기 객체 분석부에 의해 상기 적어도 하나의 객체에 대응되는 상품에 대한 키워드인 \"데일리 템\", \"꾸안꾸룩\"이 키워드 데이터 베이스에서 추출된 상태에서, 상기 합성 이미 지를 인터넷 쇼핑몰에서 요구하는 상세 페이지에 삽입되는 이미지로 편집하는 경우, 추출된 \"데일리 템\", \"꾸안 꾸룩\" 키워드를 유저 계정에게 제공할 수 있다. 유저 계정은 제공받은 키워드를 통해 적어도 하나의 객체에 대 응되는 상품에 대한 설명 정보(예: 가볍게 툭! 꾸안꾸룩, 완벽한 데일리 템으로 ~)를 작성할 수 있다. 상기 예와 관련하여, 상기 페이지 이미지 등록부는 상기 유저 계정에 의해 설명 정보의 작성이 완료되면, 상기 완료된 설명 정보를 합성 이미지의 규격 변경 시 반영할 수 있다. 이 때, 상기 페이지 이미지 등록부(60 5)는 합성 이미지에 삽입될 설명 정보의 규격(예: 폰트, 크기 및 색상)을 인터넷 쇼핑몰의 상세 페이지의 규격 에 대응되도록 편집하여, 규격이 편집된 설명 정보를 합성 이미지에 삽입할 수 있다. 다른 예를 들어, 상기 페이지 이미지 등록부는 합성 이미지에 설명 정보 삽입 시, 상기 객체 분석부가 분 석한 적어도 하나의 객체에 대응되는 상품이 합성되어 있는 합성 이미지를 포함하는 일 영역에 상기 설명 정보 를 삽입할 수 있다. 즉, 상기 페이지 이미지 등록부는 복수 개의 합성 이미지 중 상기 키워드에 대응되는 이미지에 상기 설명 정보를 자동으로 삽입함으로써, 상세 페이지를 제공하는 사용자의 가독성을 향상시킬 수 있 다. 또한, 상기 페이지 이미지 등록부는 합성 이미지에 설명 정보 삽입 시, 유저 계정에게 합성 이미지에 삽입 되는 설명 정보의 위치 및 규격 편집을 요청하여, 상기 유저 계정으로 하여금 합성 이미지에 삽입되는 설명 정 보의 편집 작업을 수행하도록 요청할 수 있다. 다른 실시예에 따르면, 상기 상품 이미지 생성부는 도 2에서 언급된 동영상을 기반으로 추출된 객체에 기 반한 상품 이미지를 생성할 수 있다. 즉, 상기 상품 이미지 생성부는 동영상 내에서 객체의 추출이 완료되 면, 추출된 객체를 기반으로, 상기 제2 타입 프로세스 시작부, 상기 페이지 규격 편집부 및 상기 페 이지 이미지 등록부 중 적어도 하나의 기능을 수행하여, 상세 페이지에 삽입되는 이미지를 생성할 수 있다. 도 7은 본 발명의 일 실시 예에 따른 컴퓨팅 장치의 내부 구성의 일 예를 설명하기 위한 도면이다. 도 7은 본 발명의 일 실시 예에 따른 컴퓨팅 장치의 내부 구성의 일 예를 도시하였으며, 이하의 설명에 있어서, 상술한 도 1 내지 6에 대한 설명과 중복되는 불필요한 실시 예에 대한 설명은 생략하기로 한다. 도 9에 도시한 바와 같이, 컴퓨팅 장치은 적어도 하나의 프로세서(processor), 메모리 (memory), 주변장치 인터페이스(peripEHRal interface), 입/출력 서브시스템(I/O subsystem), 전력 회로 및 통신 회로를 적어도 포함할 수 있다. 이때, 컴퓨팅 장치 은 촉각 인터페이스 장치에 연결된 유저 단말이기(A) 혹은 전술한 컴퓨팅 장치(B)에 해당될 수 있다. 메모리는, 일례로 고속 랜덤 액세스 메모리(high-speed random access memory), 자기 디스크, 에스램 (SRAM), 디램(DRAM), 롬(ROM), 플래시 메모리 또는 비휘발성 메모리를 포함할 수 있다. 메모리는 컴퓨팅 장치의 동작에 필요한 소프트웨어 모듈, 명령어 집합 또는 그밖에 다양한 데이터를 포함할 수 있다. 이때, 프로세서나 주변장치 인터페이스 등의 다른 컴포넌트에서 메모리에 액세스하는 것 은 프로세서에 의해 제어될 수 있다. 주변장치 인터페이스는 컴퓨팅 장치의 입력 및/또는 출력 주변장치를 프로세서 및 메모리 에 결합시킬 수 있다. 프로세서는 메모리에 저장된 소프트웨어 모듈 또는 명령어 집합을 실행하여 컴퓨팅 장치을 위한 다양한 기능을 수행하고 데이터를 처리할 수 있다. 입/출력 서브시스템은 다양한 입/출력 주변장치들을 주변장치 인터페이스에 결합시킬 수 있다. 예를 들어, 입/출력 서브시스템은 모니터나 키보드, 마우스, 프린터 또는 필요에 따라 터치스크린이나 센서 등의 주변장치를 주변장치 인터페이스에 결합시키기 위한 컨트롤러를 포함할 수 있다. 다른 측면에 따르면, 입/출력 주변장치들은 입/출력 서브시스템을 거치지 않고 주변장치 인터페이스에 결합될 수도 있다. 전력 회로는 단말기의 컴포넌트의 전부 또는 일부로 전력을 공급할 수 있다. 예를 들어 전력 회로 는 전력 관리 시스템, 배터리나 교류(AC) 등과 같은 하나 이상의 전원, 충전 시스템, 전력 실패 감지 회 로(power failure detection circuit), 전력 변환기나 인버터, 전력 상태 표시자 또는 전력 생성, 관리, 분배 를 위한 임의의 다른 컴포넌트들을 포함할 수 있다. 통신 회로는 적어도 하나의 외부 포트를 이용하여 다른 컴퓨팅 장치와 통신을 가능하게 할 수 있다. 또는 상술한 바와 같이 필요에 따라 통신 회로는 RF 회로를 포함하여 전자기 신호(electromagnetic signal)라고도 알려진 RF 신호를 송수신함으로써, 다른 컴퓨팅 장치와 통신을 가능하게 할 수도 있다. 이러한 도 7의 실시 예는, 컴퓨팅 장치의 일례일 뿐이고, 컴퓨팅 장치은 도 9에 도시된 일부 컴 포넌트가 생략되거나, 도 9에 도시되지 않은 추가의 컴포넌트를 더 구비하거나, 2개 이상의 컴포넌트를 결합시키는 구성 또는 배치를 가질 수 있다. 예를 들어, 모바일 환경의 통신 단말을 위한 컴퓨팅 장치는 도 9에 도시 된 컴포넌트들 외에도, 터치스크린이나 센서 등을 더 포함할 수도 있으며, 통신 회로에 다양한 통신방식 (WiFi, 3G, LTE, Bluetooth, NFC, Zigbee 등)의 RF 통신을 위한 회로가 포함될 수도 있다. 컴퓨팅 장치(1000 0)에 포함 가능한 컴포넌트들은 하나 이상의 신호 처리 또는 어플리케이션에 특화된 집적 회로를 포함하는 하드 웨어, 소프트웨어, 또는 하드웨어 및 소프트웨어 양자의 조합으로 구현될 수 있다. 본 발명의 실시 예에 따른 방법들은 다양한 컴퓨팅 장치를 통하여 수행될 수 있는 프로그램 명령(instruction) 형태로 구현되어 컴퓨터 판독 가능 매체에 기록될 수 있다. 특히, 본 실시 예에 따른 프로그램은 PC 기반의 프 로그램 또는 모바일 단말 전용의 어플리케이션으로 구성될 수 있다. 본 발명이 적용되는 애플리케이션은 파일 배포 시스템이 제공하는 파일을 통해 이용자 단말에 설치될 수 있다. 일 예로, 파일 배포 시스템은 이용자 단말 이기의 요청에 따라 상기 파일을 전송하는 파일 전송부(미도시)를 포함할 수 있다. 이상에서 설명된 장치는 하드웨어 구성요소, 소프트웨어 구성요소, 및/또는 하드웨어 구성요소 및 소프트웨어구 성요소의 조합으로 구현될 수 있다. 예를 들어, 실시 예들에서 설명된 장치 및 구성요소는, 예를 들어, 프로세 서, 콘트롤러, ALU(arithmetic logic unit), 디지털 신호 프로세서(digital signal processor), 마이크로컴퓨 터, FPGA(field programmable gate array), PLU(programmable logic unit), 마이크로프로세서, 또는 명령 (instruction)을 실행하고 응답할 수 있는 다른 어떠한 장치와 같이, 하나 이상의 범용 컴퓨터 또는 특수 목적 컴퓨터를 이용하여 구현될 수 있다. 처리 장치는 운영 체제(OS) 및 상기 운영 체제상에서 수행되는 하나 이상의 소프트웨어 애플리케이션을 수행할 수 있다. 또한, 처리 장치는 소프트웨어의 실행에 응답하여, 데이터를 접근, 저장, 조작, 처리 및 생성할 수도 있다. 이해의 편의를 위하여, 처리 장치는 하나가 사용되는 것으로 설명된 경 우도 있지만, 해당 기술 분야에서 통상의 지식을 가진 자는, 처리 장치가 복수 개의 처리 요소(processing element) 및/또는 복수 유형의 처리 요소를 포함할 수 있음을 알 수 있다. 예를 들어, 처리 장치는 복수 개의 프로세서 또는 하나의 프로세서 및 하나의 콘트롤러를 포함할 수 있다. 또한, 병렬 프로세서(parallel processor)와 같은, 다른 처리 구성(processing configuration)도 가능하다. 소프트웨어는 컴퓨터 프로그램(computer program), 코드(code), 명령(instruction), 또는 이들 중 하나 이상의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결합적으로 (collectively) 처리 장치를 명령할 수 있다. 소프트웨어 및/또는 데이터는, 처리 장치에 의하여 해석되거나 처 리 장치에 명령 또는 데이터를 제공하기 위하여, 어떤 유형의 기계, 구성요소(component), 물리적 장치, 가상장 치(virtual equipment), 컴퓨터 저장 매체 또는 장치에 영구적으로, 또는 일시적으로 구체화(embody)될 수 있다. 소프트웨어는 네트워크로 연결된 컴퓨팅 장치상에 분산되어서, 분산된 방법으로 저장되거나 실행될 수도 있다. 소프트웨어 및 데이터는 하나 이상의 컴퓨터 판독 가능 기록 매체에 저장될 수 있다. 실시 예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 실시 예를 위하여 특별히 설계 되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가 능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD- ROM, DVD와 같은 광 기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체 (magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도 록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 상기된 하드웨어 장치는 실시예의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도 록 구성될 수 있으며, 그 역도 마찬가지이다. 이상과 같이 실시 예들이 비록 한정된 실시 예와 도면에 의해 설명되었으나, 해당 기술 분야에서 통상의 지식을 가진 자라면 상기의 기재로부터 다양한 수정 및 변형이 가능하다. 예를 들어, 설명된 기술들이 설명된 방법과 다른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형 태로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성 될 수 있다. 그러므로, 다른 구현들, 다른 실시 예들 및 특허청구범위와 균등한 것들도 후술하는 특허청구범위 의 범위에 속한다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7"}
{"patent_id": "10-2021-0136785", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 입력 이미지를 기반으로 인터넷 쇼핑몰에 전시되는 상품 이미지를 생성하는 방법을 설명하기 위한 순서도이다. 도 2는 본 발명의 일 실시예에 따른 입력 이미지를 기반으로 인터넷 쇼핑몰에 전시되는 상품 이미지를 생성하는 방법의 객체 추출 단계를 설명하기 위한 순서도이다. 도 3은 본 발명의 일 실시예에 따른 입력 이미지를 기반으로 인터넷 쇼핑몰에 전시되는 상품 이미지를 생성하는 장치의 배경 합성부를 설명하기 위한 순서도이다. 도 4는 본 발명의 일 실시예에 따른 입력 이미지를 기반으로 인터넷 쇼핑몰에 전시되는 상품 이미지를 생성하는 방법의 기 저장된 인공지능 알고리즘을 설명하기 위한 도면이다. 도 5는 본 발명의 일 실시예에 따른 입력 이미지를 기반으로 인터넷 쇼핑몰에 전시되는 상품 이미지를 생성하는 장치의 상품 이미지 생성부를 설명하기 위한 도면이다. 도 6은 본 발명의 일 실시예에 따른 입력 이미지를 기반으로 인터넷 쇼핑몰에 전시되는 상품 이미지를 생성하는 장치의 상품 이미지 생성부를 설명하기 위한 다른 도면이다.도 7은 본 발명의 일 실시 예에 따른 컴퓨팅 장치의 내부 구성의 일 예를 설명하기 위한 도면이다."}
