{"patent_id": "10-2021-0193412", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0102922", "출원번호": "10-2021-0193412", "발명의 명칭": "복수의 콘텐츠를 표시하는 전자 장치 및 그 동작 방법", "출원인": "삼성전자주식회사", "발명자": "유하연"}}
{"patent_id": "10-2021-0193412", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치가 복수의 콘텐츠를 표시하는 방법에 있어서,상기 전자 장치가 제1 표시 모드로 동작하는 동안, 복수의 콘텐츠를 표시하기 위한 멀티 뷰 기능의 실행을 식별하는 단계;상기 멀티 뷰 기능에서 제공될 멀티 뷰 레이아웃의 유형을 식별하는 단계;상기 멀티 뷰 레이아웃의 유형이 제2 표시 모드에 대응하면, 상기 전자 장치의 디스플레이를 회전시키는 단계;상기 디스플레이가 회전됨에 따라, 상기 전자 장치의 표시 모드를 제2 표시 모드로 전환하는 단계; 및상기 멀티 뷰 레이아웃을 이용하여, 상기 제2 표시 모드에서 복수의 콘텐츠를 표시하는 단계를 포함하되,상기 제1 표시 모드는 가로 모드 및 세로 모드 중 어느 하나이고, 상기 제2 표시 모드는 다른 하나인 것인, 방법."}
{"patent_id": "10-2021-0193412", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 멀티 뷰 레이아웃의 유형은,가로 유형 및 세로 유형을 포함하는, 방법."}
{"patent_id": "10-2021-0193412", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 방법은,적어도 하나의 멀티 뷰 레이아웃 중에서, 실행시킬 멀티 뷰 레이아웃을 선택하는 입력을 수신하는 단계를 더 포함하고,상기 멀티 뷰 레이아웃의 유형을 식별하는 단계는,상기 선택된 멀티 뷰 레이아웃의 유형을 식별하는 단계를 포함하는, 방법."}
{"patent_id": "10-2021-0193412", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 방법은,상기 실행된 멀티 뷰 레이아웃이 기 저장된 멀티 뷰 레이아웃과 동일한지 여부를 비교하는 단계; 및상기 비교의 결과에 기초하여, 상기 실행된 멀티 뷰 레이아웃을 맞춤형 멀티 뷰 레이아웃으로 저장하기 위한 사용자 인터페이스를 표시하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2021-0193412", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2항에 있어서,상기 방법은,상기 실행된 멀티 뷰 레이아웃이 기 저장된 멀티 뷰 레이아웃과 동일한지 여부를 비교하는 단계; 및상기 실행된 멀티 뷰 레이아웃이 상기 기 저장된 멀티 뷰 레이아웃과 다른 경우, 상기 실행된 멀티 뷰 레이아웃을 저장하는 단계를 더 포함하는, 방법.공개특허 10-2023-0102922-3-청구항 6 제2항에 있어서,상기 방법은,상기 멀티 뷰 기능의 실행이 식별됨에 따라, 맞춤형 멀티 뷰 레이아웃을 생성하기 위한 사용자 인터페이스를 표시하는 단계;사용자 입력에 기초하여, 상기 멀티 뷰 기능에서 제공될 맞춤형 멀티 뷰 레이아웃을 생성하는 단계; 및상기 생성된 맞춤형 멀티 뷰 레이아웃을 저장하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2021-0193412", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 멀티 뷰 레이아웃의 유형을 식별하는 단계는,상기 맞춤형 멀티 뷰 레이아웃이 저장되면, 상기 맞춤형 멀티 뷰 레이아웃의 유형을 식별하는 단계를 포함하는,방법."}
{"patent_id": "10-2021-0193412", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제3항에 있어서,상기 방법은,상기 멀티 뷰 기능의 실행이 식별됨에 따라, 상기 실행시킬 멀티 뷰 레이아웃을 선택하는 상기 입력을 수신하기위해, 상기 적어도 하나의 멀티 뷰 레이아웃의 썸네일을 표시하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2021-0193412", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 적어도 하나의 멀티 뷰 레이아웃은,상기 전자 장치에 사전 설정된 멀티 뷰 레이아웃 및 사용자에 의해 생성된 맞춤형 멀티 뷰 레이아웃 중 적어도하나로 구성되며,상기 멀티 뷰 레이아웃의 썸네일을 표시하는 단계는,상기 사전 설정된 멀티 뷰 레이아웃의 썸네일 및 상기 맞춤형 멀티 뷰 레이아웃의 썸네일을 구분하여 표시하는단계를 포함하는, 방법."}
{"patent_id": "10-2021-0193412", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제2항에 있어서,상기 방법은,상기 전자 장치가 상기 제1 표시 모드로 동작하는 동안 상기 전자 장치에서 표시되는 싱글 콘텐츠를 식별하는단계를 더 포함하고,상기 복수의 콘텐츠를 표시하는 단계는,상기 싱글 콘텐츠 및 상기 싱글 콘텐츠에 관련된 하나 이상의 콘텐츠로 구성되는, 상기 복수의 콘텐츠를 표시하는 단계를 포함하는, 방법."}
{"patent_id": "10-2021-0193412", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "복수의 콘텐츠를 표시하는 전자 장치에 있어서,디스플레이;공개특허 10-2023-0102922-4-하나 이상의 인스트럭션을 저장하는 메모리; 및상기 메모리에 저장된 상기 하나 이상의 인스트럭션을 실행하는 프로세서를 포함하고,상기 프로세서는, 상기 하나 이상의 인스트럭션을 실행함으로써,상기 전자 장치가 제1 표시 모드로 동작하는 동안, 복수의 콘텐츠를 표시하기 위한 멀티 뷰 기능의 실행을 식별하고,상기 멀티 뷰 기능에서 제공될 멀티 뷰 레이아웃의 유형을 식별하고,상기 멀티 뷰 레이아웃의 유형이 제2 표시 모드에 대응하면, 상기 디스플레이를 회전시키고,상기 디스플레이가 회전됨에 따라, 상기 전자 장치의 표시 모드를 제2 표시 모드로 전환하고,상기 멀티 뷰 레이아웃을 이용하여, 상기 제2 표시 모드에서 복수의 콘텐츠를 표시하도록 상기 디스플레이를 제어하되,상기 제1 표시 모드는 가로 모드 및 세로 모드 중 어느 하나이고, 상기 제2 표시 모드는 다른 하나인 것인, 전자 장치."}
{"patent_id": "10-2021-0193412", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 멀티 뷰 레이아웃의 유형은,가로 유형 및 세로 유형을 포함하는, 전자 장치."}
{"patent_id": "10-2021-0193412", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 프로세서는, 상기 하나 이상의 인스트럭션을 실행함으로써,적어도 하나의 멀티 뷰 레이아웃 중에서, 실행시킬 멀티 뷰 레이아웃을 선택하는 입력을 수신하고,상기 선택된 멀티 뷰 레이아웃의 유형을 식별하는, 전자 장치."}
{"patent_id": "10-2021-0193412", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12항에 있어서,상기 프로세서는, 상기 하나 이상의 인스트럭션을 실행함으로써,상기 실행된 멀티 뷰 레이아웃이 기 저장된 멀티 뷰 레이아웃과 동일한지 여부를 비교하고,상기 비교의 결과에 기초하여, 상기 실행된 멀티 뷰 레이아웃을 맞춤형 멀티 뷰 레이아웃으로 저장하기 위한 사용자 인터페이스를 표시하도록 상기 디스플레이를 제어하는, 전자 장치."}
{"patent_id": "10-2021-0193412", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제12항에 있어서,상기 프로세서는, 상기 하나 이상의 인스트럭션을 실행함으로써,상기 실행된 멀티 뷰 레이아웃이 기 저장된 멀티 뷰 레이아웃과 동일한지 여부를 비교하고,상기 실행된 멀티 뷰 레이아웃이 상기 기 저장된 멀티 뷰 레이아웃과 다른 경우, 상기 실행된 멀티 뷰 레이아웃을 저장하는, 전자 장치."}
{"patent_id": "10-2021-0193412", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제12항에 있어서,상기 프로세서는, 상기 하나 이상의 인스트럭션을 실행함으로써,공개특허 10-2023-0102922-5-상기 멀티 뷰 기능의 실행이 식별됨에 따라, 맞춤형 멀티 뷰 레이아웃을 생성하기 위한 사용자 인터페이스를 표시하도록 상기 디스플레이를 제어하고,사용자 입력에 기초하여, 상기 멀티 뷰 기능에서 제공될 맞춤형 멀티 뷰 레이아웃을 생성하고,상기 생성된 맞춤형 멀티 뷰 레이아웃을 저장하는, 전자 장치."}
{"patent_id": "10-2021-0193412", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서,상기 프로세서는, 상기 하나 이상의 인스트럭션을 실행함으로써,상기 맞춤형 멀티 뷰 레이아웃이 저장되면, 상기 맞춤형 멀티 뷰 레이아웃의 유형을 식별하는, 전자 장치."}
{"patent_id": "10-2021-0193412", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제13항에 있어서,상기 프로세서는, 상기 하나 이상의 인스트럭션을 실행함으로써,상기 멀티 뷰 기능의 실행이 식별됨에 따라, 상기 실행시킬 멀티 뷰 레이아웃을 선택하는 상기 입력을 수신하기위해, 상기 적어도 하나의 멀티 뷰 레이아웃의 썸네일을 표시하는, 전자 장치."}
{"patent_id": "10-2021-0193412", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에 있어서,상기 적어도 하나의 멀티 뷰 레이아웃은,상기 전자 장치에 사전 설정된 멀티 뷰 레이아웃 및 사용자에 의해 생성된 맞춤형 멀티 뷰 레이아웃 중 적어도하나로 구성되며,상기 프로세서는, 상기 하나 이상의 인스트럭션을 실행함으로써,상기 사전 설정된 멀티 뷰 레이아웃의 썸네일 및 상기 맞춤형 멀티 뷰 레이아웃의 썸네일을 구분하여 표시하도록 상기 디스플레이를 제어하는, 전자 장치."}
{"patent_id": "10-2021-0193412", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제1항 내지 제10항 중 어느 한 항의 방법을 컴퓨터에서 실행시키기 위한 프로그램을 기록한 컴퓨터로 읽을 수있는 기록매체."}
{"patent_id": "10-2021-0193412", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "전자 장치가 복수의 콘텐츠를 표시하는 방법이 제공된다. 상기 방법은, 상기 전자 장치가 제1 표시 모드로 동작 하는 동안, 복수의 콘텐츠를 표시하기 위한 멀티 뷰 기능의 실행을 식별하는 단계; 상기 멀티 뷰 기능에서 제공 될 멀티 뷰 레이아웃의 유형을 식별하는 단계; 상기 멀티 뷰 레이아웃의 유형이 제2 표시 모드에 대응하면, 상기 전자 장치의 디스플레이를 회전시키는 단계; 상기 디스플레이가 회전됨에 따라, 상기 전자 장치의 표시 모드를 제2 표시 모드로 전환하는 단계; 및 상기 멀티 뷰 레이아웃을 이용하여, 상기 제2 표시 모드에서 복수의 콘텐츠 를 표시하는 단계를 포함할 수 있으며, 상기 제1 표시 모드는 가로 모드 및 세로 모드 중 어느 하나이고, 상기 제2 표시 모드는 다른 하나인 것일 수 있다."}
{"patent_id": "10-2021-0193412", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는, 복수의 콘텐츠를 표시 가능한 멀티 뷰 기능을 제공하는 전자 장치 및 그 동작 방법에 관한 것이다."}
{"patent_id": "10-2021-0193412", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근, 콘텐츠의 종류가 다양해짐에 따라, TV 등의 디스플레이를 포함하는 전자 장치에서는 가로 모드 및 세로 모드를 지원한다. 또한, 일부 전자 장치에서는, 하나의 디스플레이 내에 복수의 화면 구성으로 복수의 콘텐츠를 제공하는, 멀티 뷰 기능이 제공된다. 멀티 뷰 기능에서 제공되는 복수의 콘텐츠는, 가로 방향의 콘텐츠, 세로 방향의 콘텐츠 및 가로 방향 및 세로 방향의 콘텐츠의 조합으로 구성될 수 있으며, 다양한 종류의 콘텐츠를 하 나의 디스플레이에서 복수의 화면 구성으로 제공하기 위해, 멀티 뷰 레이아웃의 구성 또한 다양해질 수 있다. 사용자가 전자 장치에서 제공되는 다양한 멀티 뷰 레이아웃을 이용함에 있어서 사용자 편의를 제공하는, 복수의 콘텐츠를 표시하는 방법이 요구된다."}
{"patent_id": "10-2021-0193412", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "발명의 내용"}
{"patent_id": "10-2021-0193412", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "개시된 실시예들은, 표시하고자 하는 콘텐츠의 구성에 따라 전자 장치의 표시 모드를 적응적으로 변경하여 복수 의 콘텐츠를 표시할 수 있는, 전자 장치 및 그 동작 방법에 관한 것이다."}
{"patent_id": "10-2021-0193412", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 측면에 따르면, 전자 장치가 복수의 콘텐츠를 표시하는 방법을 제공할 수 있다. 상기 방법은, 상 기 전자 장치가 제1 표시 모드로 동작하는 동안, 복수의 콘텐츠를 표시하기 위한 멀티 뷰 기능의 실행을 식별하 는 단계; 상기 멀티 뷰 기능에서 제공될 멀티 뷰 레이아웃의 유형을 식별하는 단계; 상기 멀티 뷰 레이아웃의 유형이 제2 표시 모드에 대응하면, 상기 전자 장치의 디스플레이를 회전시키는 단계; 상기 디스플레이가 회전됨 에 따라, 상기 전자 장치의 표시 모드를 제2 표시 모드로 전환하는 단계; 및 상기 멀티 뷰 레이아웃을 이용하여, 상기 제2 표시 모드에서 복수의 콘텐츠를 표시하는 단계를 포함할 수 있으며, 상기 제1 표시 모드는 가로 모드 및 세로 모드 중 어느 하나이고, 상기 제2 표시 모드는 다른 하나인 것일 수 있다. 상기 멀티 뷰 레이아웃의 유형은, 가로 유형 및 세로 유형을 포함할 수 있다. 상기 방법은, 적어도 하나의 멀티 뷰 레이아웃 중에서, 실행시킬 멀티 뷰 레이아웃을 선택하는 입력을 수신하는 단계를 더 포함하고, 상기 멀티 뷰 레이아웃의 유형을 식별하는 단계는, 상기 선택된 멀티 뷰 레이아웃의 유형 을 식별하는 단계를 포함할 수 있다. 상기 방법은, 상기 실행된 멀티 뷰 레이아웃이 기 저장된 멀티 뷰 레이아웃과 동일한지 여부를 비교하는 단계; 및 상기 비교의 결과에 기초하여, 상기 실행된 멀티 뷰 레이아웃을 맞춤형 멀티 뷰 레이아웃으로 저장하기 위한 사용자 인터페이스를 표시하는 단계를 더 포함할 수 있다. 상기 방법은, 상기 실행된 멀티 뷰 레이아웃이 기 저장된 멀티 뷰 레이아웃과 동일한지 여부를 비교하는 단계; 및 상기 실행된 멀티 뷰 레이아웃이 상기 사전 설정된 멀티 뷰 레이아웃과 다른 경우, 상기 실행된 멀티 뷰 레 이아웃을 저장하는 단계를 더 포함할 수 있다. 상기 방법은, 상기 멀티 뷰 기능의 실행이 식별됨에 따라, 맞춤형 멀티 뷰 레이아웃을 생성하기 위한 사용자 인 터페이스를 표시하는 단계; 사용자 입력에 기초하여, 상기 멀티 뷰 기능에서 제공될 맞춤형 멀티 뷰 레이아웃을 생성하는 단계; 및 상기 생성된 맞춤형 멀티 뷰 레이아웃을 저장하는 단계를 더 포함할 수 있다. 상기 멀티 뷰 레이아웃의 유형을 식별하는 단계는, 상기 맞춤형 멀티 뷰 레이아웃이 저장되면, 상기 맞춤형 멀 티 뷰 레이아웃의 유형을 식별하는 단계를 포함할 수 있다. 상기 방법은, 상기 멀티 뷰 기능의 실행이 식별됨에 따라, 상기 실행시킬 멀티 뷰 레이아웃을 선택하는 상기 입 력을 수신하기 위해, 상기 적어도 하나의 멀티 뷰 레이아웃의 썸네일을 표시하는 단계를 더 포함할 수 있다. 상기 적어도 하나의 멀티 뷰 레이아웃은, 상기 전자 장치에 사전 설정된 멀티 뷰 레이아웃 및 사용자에 의해 생 성된 맞춤형 멀티 뷰 레이아웃 중 적어도 하나로 구성되며, 상기 멀티 뷰 레이아웃의 썸네일을 표시하는 단계는, 상기 사전 설정된 멀티 뷰 레이아웃의 썸네일 및 상기 맞춤형 멀티 뷰 레이아웃의 썸네일을 구분하여 표시하는 단계를 포함할 수 있다. 상기 방법은, 상기 전자 장치가 상기 제1 표시 모드로 동작하는 동안 상기 전자 장치에서 표시되는 싱글 콘텐츠 를 식별하는 단계를 더 포함하고, 상기 복수의 콘텐츠를 표시하는 단계는, 상기 싱글 콘텐츠 및 상기 싱글 콘텐 츠에 관련된 하나 이상의 콘텐츠로 구성되는, 상기 복수의 콘텐츠를 표시하는 단계를 포함할 수 있다. 본 개시의 일 측면에 따르면, 복수의 콘텐츠를 표시하는 전자 장치를 제공할 수 있다. 상기 전자 장치는, 디스 플레이; 하나 이상의 인스트럭션을 저장하는 메모리; 및 상기 메모리에 저장된 상기 하나 이상의 인스트럭션을 실행하는 프로세서를 포함하고, 상기 프로세서는, 상기 하나 이상의 인스트럭션을 실행함으로써, 상기 전자 장 치가 제1 표시 모드로 동작하는 동안, 복수의 콘텐츠를 표시하기 위한 멀티 뷰 기능의 실행을 식별하고, 상기 멀티 뷰 기능에서 제공될 멀티 뷰 레이아웃의 유형을 식별하고, 상기 멀티 뷰 레이아웃의 유형이 제2 표시 모드 에 대응하면, 상기 디스플레이를 회전시키고, 상기 디스플레이가 회전됨에 따라, 상기 전자 장치의 표시 모드를 제2 표시 모드로 전환하고, 상기 멀티 뷰 레이아웃을 이용하여, 상기 제2 표시 모드에서 복수의 콘텐츠를 표시 하도록 상기 디스플레이를 제어할 수 있으며, 상기 제1 표시 모드는 가로 모드 및 세로 모드 중 어느 하나이고, 상기 제2 표시 모드는 다른 하나인 것일 수 있다.본 개시의 일 측면에 따르면, 전자 장치가 복수의 콘텐츠를 표시하는, 전술한 방법들 중 어느 하나를 실행시키 기 위한 프로그램이 기록된 컴퓨터 판독 가능 기록매체를 제공할 수 있다."}
{"patent_id": "10-2021-0193412", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에서 사용되는 용어에 대해 간략히 설명하고, 본 명세서의 실시예들에 대해 구체적으로 설명하기로 한 다. 본 개시에서 사용되는 용어는 본 개시의 실시예들에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적 인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 발명의 설명 부분에서 상세히 그 의미를 기재할 것이다. 따라서 본 개시에서 사용되는 용어는 단순한 용어의 명칭이 아닌,그 용어가 가지는 의미와 본 개시의 전반에 걸친 내용을 토대로 정의되어야 한다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 용어들은 본 명세서에 기재된 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가질 수 있다. 또한, 본 명세서에서 사용되는 '제1' 또는 '제2' 등과 같이 서수를 포함하는 용어는 다양한 구성 요소들을 설명하는데 사용할 수 있지만, 상기 구성 요소들은 상기 용 어들에 의해 한정되어서는 안 된다. 상기 용어들은 하나의 구성 요소를 다른 구성 요소로부터 구별하는 목적으 로만 사용된다. 명세서 전체에서 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있음을 의미한다. 또한, 명세서에 기재된 \"부\", \"모듈\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어 또는 소 프트웨어로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 아래에서는 첨부한 도면을 참고하여 본 개시의 실시예에 대하여 개시된 내용들이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 개시는 여러 가지 상이한 형태로 구 현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 개시를 명확하게 설명하기 위해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호 를 붙였다. 도 1은 본 개시의 일 실시예에 따른 전자 장치가 복수의 콘텐츠를 표시하는 동작을 개략적으로 설명하기 위한 도면이다. 개시된 실시예에서, 전자 장치는 디스플레이를 포함하여 영상 및/또는 동영상을 출력하는 장치일 수 있다. 예를 들어, 전자 장치는 스마트 TV, 스마트폰, 태블릿 PC, 랩탑 PC, 액자형 디스플레이 등을 포함 할 수 있다. 다만, 이에 한정되는 것은 아니며, 전자 장치는 디스플레이를 포함하는 다양한 종류 및 형태 의 전자 장치로 구현될 수 있다. 개시된 실시예에서, 전자 장치의 디스플레이는 가로 모드 및 세로 모드의 표시 모드를 제공할 수 있도록, 회전 가능한 디스플레이일 수 있다. 표시 모드 중 가로 모드는 전자 장치의 디스플레이가 가로 방향의 길 이가 세로 방향의 길이보다 길게 되도록 배치된 상태를 말하고, 세로 모드는 전자 장치의 디스플레이가 세로 방향의 길이가 가로 방향의 길이보다 길게 되도록 배치된 상태를 말한다. 전자 장치는 전자 장치에 포함된 모터를 이용하여 디스플레이를 회전시키거나, 전자 장치의 디스플레이에 부착 가능한 회전 모듈을 제어함으로써 디스플레이를 회전시킬 수 있다. 개시된 실시예에서, 멀티 뷰 레이아웃이란 전자 장치의 디스플레이에 복수의 화면을 구성하여 복수의 콘 텐츠를 표시하기 위한 레이아웃을 말한다. 멀티 뷰 레이아웃은 가로 유형 및 세로 유형의 멀티 뷰 레이아웃으로 구별될 수 있다. 가로 유형 멀티 뷰 레이아웃은 전자 장치의 가로 모드에서 복수의 콘텐츠를 제공하기 위 한 레이아웃을 말한다. 가로 유형 멀티 뷰 레이아웃에 포함되는 복수의 화면들은, 가로 화면 또는 세로 화면을 포함할 수 있다. 세로 유형 멀티 뷰 레이아웃은, 전자 장치의 세로 모드에서 복수의 콘텐츠를 제공하기 위한 레이아웃을 말한다. 세로 유형 멀티 뷰 레이아웃에 포함되는 복수의 화면들은, 가로 화면 또는 세로 화면 을 포함할 수 있다. 일 실시예에서, 전자 장치는 멀티 뷰 레이아웃을 이용하여 복수의 콘텐츠를 동시에 표시할 수 있다. 이 경우, 전자 장치의 현재 표시 모드와 멀티 뷰 레이아웃의 유형이 대응하지 않으면, 전자 장치는 디 스플레이를 자동으로 회전시키고, 회전된 디스플레이에서 멀티 뷰 레이아웃을 이용하여 복수의 콘텐츠를 표시할 수 있다. 일 실시예에서, 전자 장치는 가로 모드로 동작하는 동안, 멀티 뷰 기능이 실행되면 멀티 뷰 메뉴를 표시할 수 있다. 전자 장치는 멀티 뷰 기능 실행을 위한 사용자 입력에 따라서 멀티 뷰 기능을 실행할 수 있다. 전자 장치는 멀티 뷰 메뉴 내에 멀티 뷰 레이아웃을 선택할 수 있도록 하는 메뉴 항목을 제공 할 수 있다. 전자 장치는 멀티 뷰 메뉴에서 제공된 멀티 뷰 레이아웃 항목을 선택하는 사용자 입력 을 수신하면, 선택된 멀티 뷰 레이아웃 항목에 대응하는 멀티 뷰 레이아웃을 이용하여 복수의 콘텐츠를 표시할 수 있다. 도 1에서는, 선택된 멀티 뷰 레이아웃이 세로 유형의 멀티 뷰 레이아웃인 경우를 예시로 설명한다. 또한, 세로 유형의 멀티 뷰 레이아웃이 제1 화면 및 제2 화면으로 구성되는 경우를 예시로 설명한다. 일 실시예에서, 가로 모드로 동작 중인 전자 장치에서 세로 유형의 멀티 뷰 레이아웃이 선택되면, 전자 장치는 전자 장치의 표시 모드가 가로 모드에서 세로 모드로 전환되도록 디스플레이를 회전시 킬 수 있다. 전자 장치는 세로 모드에서, 세로 유형의 멀티 뷰 레이아웃을 이용하여, 복수의 콘텐츠 를 제공할 수 있다. 전자 장치는 세로 유형의 멀티 뷰 레이아웃의 제1 화면에서 제1 콘텐츠를 표시 하고, 제2 화면에서 제2 콘텐츠를 표시할 수 있다. 전자 장치가 멀티 뷰 레이아웃을 이용하여 복수의 콘텐츠를 표시하는 구체적인 동작들은, 후술하는 도면 들과 그에 대응하는 설명들을 참조하면 보다 상세하게 이해될 것이다. 도 2는 본 개시의 일 실시예에 따른 전자 장치에서 제공되는, 멀티 뷰 레이아웃의 유형들을 설명하기 위한 도면 이다. 일 실시예에서, 전자 장치는 다양한 구성의 멀티 뷰 레이아웃을 제공할 수 있다. 예를 들어, 전자 장치 는 복수의 콘텐츠 표시가 가능한 복수의 화면들로 구성되는, 멀티 뷰 레이아웃을 제공할 수 있다. 일 실시예에서, 멀티 뷰 레이아웃은 복수의 유형이 있을 수 있다. 일 실시예에서, 멀티 뷰 레이아웃은 가로 유형 멀티 뷰 레이아웃일 수 있다. 가로 유형 멀티 뷰 레이아웃 은, 전자 장치의 표시 모드 중 가로 모드에 대응되는 멀티 뷰 레이아웃 유형이다. 가로 유형 멀티 뷰 레이아웃은 복수의 화면들을 포함할 수 있다. 예를 들어, 2 이상의 화면들이 가로 유형 멀티 뷰 레이아 웃에 포함될 수 있다. 일 실시예에서, 가로 유형 멀티 뷰 레이아웃에 포함되는 복수의 화면들 각각은, 가로 및/또는 세로 화면일 수 있다. 즉, 가로 유형 멀티 뷰 레이아웃은, 복수의 화면들을 포함하는 전체의 멀티 뷰 화면이 가로로 긴 화면일 뿐, 가로 유형 멀티 뷰 레이아웃에 포함되는 각각의 화면들의 가로/세로 여부는 관계가 없다. 일 실시예에서, 멀티 뷰 레이아웃은 세로 유형 멀티 뷰 레이아웃일 수 있다. 세로 유형 멀티 뷰 레이아웃 은, 전자 장치의 표시 모드 중 세로 모드에 대응되는 멀티 뷰 레이아웃 유형이다. 세로 유형 멀티 뷰 레이아웃은 복수의 화면들을 포함할 수 있다. 예를 들어, 2 이상의 화면들이 세로 유형 멀티 뷰 레이아 웃에 포함될 수 있다. 일 실시예에서, 세로 유형 멀티 뷰 레이아웃에 포함되는 복수의 화면들 각각은, 가로 및/또는 세로 화면일 수 있다. 즉, 세로 유형 멀티 뷰 레이아웃은, 복수의 화면들을 포함하는 전체의 멀티 뷰 화면이 세로로 긴 화면일 뿐, 세로 유형 멀티 뷰 레이아웃에 포함되는 각각의 화면들의 가로/세로 여부는 관계가 없다. 가로 유형 멀티 뷰 레이아웃 및 세로 유형 멀티 뷰 레이아웃의 구체적인 화면 구성들에 대해서는, 도 7에 대한 설명에서 더 서술한다. 도 3은 본 개시의 일 실시예에 따른 전자 장치의 표시 모드들 및 각각의 표시 모드들에 따른 전자 장치의 동작 을 설명하기 위한 도면이다. 일 실시예에서, 전자 장치는 제1 표시 모드로 동작하는 동안, 멀티 뷰 기능의 실행을 식별할 수 있다. 전 자 장치는 멀티 뷰 기능의 실행이 식별되면, 멀티 뷰 기능에서 제공될 멀티 뷰 레이아웃의 유형을 식별할 수 있다. 멀티 뷰 레이아웃의 유형은, 예를 들어, 가로 유형 및 세로 유형을 포함할 수 있다. 전자 장치는 멀티 뷰 레이아웃의 유형이 제2 표시 모드에 대응하면, 전자 장치의 디스플레이를 회 전시키고, 전자 장치의 표시 모드를 제2 표시 모드로 전환할 수 있다. 일 실시예에서, 전자 장치의 제1 표시 모드는 가로 모드 및 세로 모드 중 어느 하나일 수 있으며, 제2 표시 모드는 다른 하나일 수 있다. 예를 들어, Case #1을 참조하면, 제1 표시 모드는 가로 모드이고, 제2 표시 모드는 세로 모드일 수 있다. 전자 장치는, 전자 장치가 가로 모드로 동작하는 동안, 멀티 뷰 기능의 실행을 식별하고, 멀티 뷰 기능에서 제공될 멀티 뷰 레이아웃의 유형을 식별할 수 있다. 일부 실시예에서, 전자 장치에서 제공 되는 멀티 뷰 레이아웃은 하나 이상일 수 있다. 멀티 뷰 레이아웃이 복수개인 경우, 전자 장치(200 0)는 복수의 멀티 뷰 레이아웃 중에서 실행시킬 멀티 뷰 레이아웃을 선택하는 입력을 수신할 수 있다. Case #1의 경우, 멀티 뷰 레이아웃의 유형은 전자 장치의 세로 모드에 대응하는, 세로 유형의 멀티 뷰 레이아웃일 수 있다. 전자 장치는 멀티 뷰 레이아웃이 세로 모드에 대응하므로, 세로 방향의 디스플레이가 되도록 전자 장치의 디스플레이를 회전시킬 수 있다. 전자 장치는 세로 모드에서, 멀티 뷰 레이아웃을 이용하여 복수의 콘텐츠를 표시할 수 있다. 예를 들어, 전자 장치는 세로 모드에서, 제1 콘텐츠 및 제2 콘텐츠를 표시할 수 있다. 다른 예에서, Case #2를 참조하면, 제1 표시 모드는 세로 모드이고, 제2 표시 모드는 가로 모드일 수 있다. 전자 장치는, 전자 장치가 세로 모드로 동작하는 동안, 멀티 뷰 기능의 실행을 식별하고, 멀 티 뷰 기능에서 제공될 멀티 뷰 레이아웃의 유형을 식별할 수 있다. 일부 실시예에서, 전자 장치에 서 제공되는 멀티 뷰 레이아웃은 하나 이상일 수 있다. 멀티 뷰 레이아웃이 복수개인 경우, 전자 장 치는 복수의 멀티 뷰 레이아웃 중에서 실행시킬 멀티 뷰 레이아웃을 선택하는 입력을 수신할 수 있다. Case #2의 경우, 멀티 뷰 레이아웃의 유형은 전자 장치의 가로 모드에 대응하는, 가로 유형의 멀티 뷰 레이아웃일 수 있다. 전자 장치는 멀티 뷰 레이아웃이 가로 모드에 대응하므로, 가로 방향의 디스플레이가 되도록 전자 장치의 디스플레이를 회전시킬 수 있다. 전자 장치는 가로 모드 에서, 멀티 뷰 레이아웃을 이용하여 복수의 콘텐츠를 표시할 수 있다. 예를 들어, 전자 장치는 가로 모드에서 제1 콘텐츠 및 제2 콘텐츠를 표시할 수 있다. Case #1 및 Case #2의 예시를 통해, 전자 장치가 제1 표시 모드에서 동작하다가 제2 표시 모 드로 전환되는 동작을 설명하였다. 위 예시에서 알 수 있듯이, 제1 표시 모드 및 제2 표시 모드는 서로 다른 표 시 모드를 구별하기 위해 서수를 이용하였을 뿐이다. 즉, 제1 표시 모드가 가로 모드이면 제2 표시 모드는 세로 모드이고, 제1 표시 모드가 세로 모드이면 제2 표시 모드는 가로 모드이다. 이하에서 기술되는 실시예들에서, 제1 표시 모드는 가로 모드 및 세로 모드 중 어느 하나일 수 있으며, 제2 표 시 모드는 다른 하나일 수 있다. 보다 명확한 설명을 위하여 각각의 실시예들에서, 예시로 사용되는 제1 표시 모드가 무엇인지 언급할 것이다. 도 4는 본 개시의 일 실시예에 따른 전자 장치가 복수의 콘텐츠를 표시하는 동작을 설명하기 위한 흐름도이다. 단계 S410에서, 일 실시예에 따른 전자 장치는 전자 장치가 제1 표시 모드로 동작하는 동안, 복수의 콘텐 츠를 표시하기 위한 멀티 뷰 기능의 실행을 식별한다. 전자 장치의 멀티 뷰 기능 다양한 방식을 통해 실 행될 수 있다. 예를 들어, 전자 장치는 전자 장치와 무선 및/또는 유선으로 연결된 다른 장치(예를 들어, 스마트폰, 퍼스널 컴퓨터 등)로부터 멀티 뷰 기능의 실행 명령/신호를 수신할 수 있다. 다른 예에서, 전 자 장치는 전자 장치의 제어를 위한 장치(예를 들어, 리모컨 등)으로부터 멀티 뷰 기능의 실행 명 령/신호를 수신할 수 있다. 다른 예에서, 전자 장치는 전자 장치의 입력 인터페이스(예를 들어, 터 치 스크린 등)으로부터 멀티 뷰 기능의 실행 입력을 수신할 수 있다. 단계 S420에서, 일 실시예에 따른 전자 장치는 멀티 뷰 기능에서 제공될 멀티 뷰 레이아웃의 유형을 식별 한다. 멀티 뷰 레이아웃의 유형은 가로 유형 및 세로 유형을 포함할 수 있다. 일 실시예에서, 전자 장치에서 제공되는 멀티 뷰 레이아웃은 하나 이상일 수 있다. 전자 장치에 저 장된 멀티 뷰 레이아웃이 하나인 경우, 전자 장치는 그 멀티 뷰 레이아웃의 유형을 식별할 수 있다. 전자 장치에 저장된 멀티 뷰 레이아웃이 둘 이상인 경우, 전자 장치는 멀티 뷰 레이아웃을 선택하는 사 용자 입력을 수신하고, 선택된 멀티 뷰 레이아웃의 유형을 식별할 수 있다. 단계 S430에서, 일 실시예에 따른 전자 장치는 멀티 뷰 레이아웃의 유형이 제2 표시 모드에 대응하면, 전 자 장치의 디스플레이를 회전시킨다. 일 실시예에서, 식별된 멀티 뷰 레이아웃의 유형은 제2 표시 모드에 대응되는 유형일 수 있다. 전자 장치(200 0)가 제1 표시 모드로 동작하는 도중에 멀티 뷰 기능이 실행되었고, 멀티 뷰 레이아웃의 유형이 제2 표시 모드 에 대응되므로, 디스플레이를 회전시킬 수 있다. 여기서, 디스플레이의 회전이란 표시 모드를 전환하기 위한 회 전으로, 예를 들어, 가로 모드에서 세로 모드로 회전 또는 세로 모드에서 가로 모드로 회전을 말한다. 일 실시예에서, 식별된 멀티 뷰 레이아웃의 유형은 제1 표시 모드에 대응되는 유형일 수 있다. 전자 장치(200 0)는 제1 표시 모드로 동작하는 도중에 멀티 뷰 기능이 실행되었고, 멀티 뷰 레이아웃의 유형이 제1 표시 모드 에 대응되므로, 디스플레이를 회전시킬 필요 없이 멀티 뷰 기능을 제공할 수 있다. 즉, 전자 장치는 멀티 뷰 레이아웃의 유형이 제1 표시 모드에 대응하면, 전자 장치는 후술하는 단계들을 수행하지 않고 제1 표 시 모드에 대응하는 멀티 뷰 레이아웃을 이용하여 제1 표시 모드에서 복수의 콘텐츠를 즉시 제공할 수 있다. 단계 S440에서, 일 실시예에 따른 전자 장치는 디스플레이가 회전됨에 따라, 전자 장치의 표시 모드를 제 2 표시 모드로 전환한다. 이는, 식별된 멀티 뷰 레이아웃의 유형이 제2 표시모드에 대응하는 유형이므로, 제2표시 모드에서 멀티 뷰 레이아웃을 이용하기 위함이다. 단계 S450에서, 일 실시예에 따른 전자 장치는 상기 멀티 뷰 레이아웃을 이용하여, 상기 제2 표시 모드에 서 복수의 콘텐츠를 표시한다. 전자 장치는 제2 표시 모드에 대응하는 멀티 뷰 레이아웃을 이용하여 제2 표시 모드에서 복수의 콘텐츠를 제공할 수 있다. 복수의 콘텐츠는 둘 이상의 콘텐츠일 수 있다. 멀티 뷰 레이아 웃에 표시될 복수의 콘텐츠들의 크기, 방향 등은, 멀티 뷰 레이아웃의 구성에 따라 결정된다. 예를 들어, 복수 의 콘텐츠 각각은 서로 다른 크기의 화면으로 제공될 수 있다. 또한, 복수의 콘텐츠 각각은 서로 다른 방향(예 를 들어, 가로 또는 세로)으로 제공될 수 있다. 도 5는 본 개시의 일 실시예에 따른 전자 장치에서 제공되는, 복수의 콘텐츠를 설명하기 위한 도면이다. 도 5를 설명함에 있어서, 멀티 뷰 레이아웃의 유형이 가로 유형임을 예시로 설명한다. 일 실시예에서, 전자 장치는 멀티 뷰 레이아웃을 이용하여 복수의 콘텐츠를 제공할 수 있다. 멀티 뷰 레 이아웃에서 제공되는 복수의 콘텐츠는, 애플리케이션들 및/또는 소스들로부터 제공되는 것일 수 있다. 일 실시예에서, 애플리케이션들은 콘텐츠를 제공 가능한 애플리케이션들일 수 있다. 애플리케이션들 은 예를 들어, OTT(Over The Top) 미디어 서비스 애플리케이션, 비디오 애플리케이션, 게임 애플리케이션 등을 포함할 수 있으나, 이에 한정되는 것은 아니다. 일 실시예에서, 소스들은 전자 장치에 연결되어 사용되는 다른 종류의 전자 장치들을 말하며, 전자 장치로 입력 콘텐츠를 제공한다. 소스들은 예를 들어, 게임 콘솔, 셋탑 박스, 데스크탑 PC, 랩탑 PC 등일 수 있으나, 이에 한정되는 것은 아니다. 일 실시예에서, 멀티 뷰 레이아웃은 4개의 가로 화면을 포함하여, 4개의 콘텐츠를 제공하는 레이아웃일 수 있다. 4개의 콘텐츠 각각에 대응하는 화면들을 제1 화면 내지 제4 화면으로 지칭한다. 예를 들어, 멀티 뷰 레이아웃의 제1 화면은 라이브 TV 애플리케이션일 수 있다. 제1 화면은 TV 애플리케이 션을 이용하여 라이브 방송 콘텐츠를 제공한다. 멀티 뷰 레이아웃의 제2 화면은 스마트폰일 수 있다. 제2 화면은 스마트폰을 소스로 연결하여 스마트폰 화면 미러링 등의 콘텐츠를 제공한다. 멀티 뷰 레이아웃 의 제3 화면은 비디오 애플리케이션일 수 있다. 제3 화면은 비디오 애플리케이션을 이용하여 동영상 콘텐츠를 제공한다. 멀티 뷰 레이아웃의 제4 화면은 USB 카메라일 수 있다. 제4 화면은 USB 카메라를 소스로 연결하여 라이브 카메라 등의 콘텐츠를 제공한다. 한편, 전술한 제1 화면 내지 제4 화면은 멀티 뷰 레이아웃을 설명하기 위한 예시일 뿐이다. 멀티 뷰 레이아웃에 표시되는 화면은 2 이상의 화면을 서로 다른 크기 및 방향으로 조합한 어떠한 구성도 가능하며, 각각의 화면에 애플리케이션 및/또는 소스로부터 제공되는 콘텐츠가 표시된다. 도 6은 본 개시의 일 실시예에 따른 전자 장치가 멀티 뷰 기능을 실행하는 방법을 설명하기 위한 도면이다. 일 실시예에서, 전자 장치는 리모컨을 통해 멀티 뷰 기능의 실행을 위한 명령/신호를 수신할 수 있 다. 일 실시예에서, 멀티 뷰 기능은 음성 입력에 의해 실행될 수 있다. 전자 장치의 사용자는 리모컨 의 음성 명령 버튼을 누르고, 멀티 뷰 실행을 위한 음성 입력(예를 들어, ‘멀티 뷰 기능 켜줘’)을 입력할 수 있다. 전자 장치는 음성 입력을 수신함에 따라, 멀티 뷰 기능을 실행시킬 수 있다. 멀티 뷰 기능이 실행되면, 전자 장치는 멀티 뷰 메뉴를 표시할 수 있다. 멀티 뷰 메뉴의 상세한 구 성들에 대해서는, 도 13을 참조하여 보다 상세하게 서술한다. 일 실시예에서, 멀티 뷰 기능은 리모컨의 멀티 뷰 버튼 클릭에 의해 실행될 수 있다. 전자 장치 의 리모컨이 멀티 뷰 기능 실행을 위한 전용 버튼을 지원하는 경우, 사용자는 리모컨의 멀티 뷰 버튼을 누를 수 있다. 전자 장치는 멀티 뷰 버튼 클릭이 식별됨에 따라, 멀티 뷰 기능을 실행시 킬 수 있다. 멀티 뷰 기능이 실행되면, 전자 장치는 멀티 뷰 메뉴를 표시할 수 있다. 일 실시예에서, 멀티 뷰 기능은 설정 메뉴 중에서 멀티 뷰 메뉴 선택에 의해 실행될 수 있다. 전자 장치 의 사용자는 리모컨의 홈버튼을 누를 수 있다. 전자 장치는 홈 버튼 클릭이 식별됨에 따라, 홈 화면으로 진입하고, 이후 전자 장치의 기능 메뉴를 실행하는 요청에 따라, 기능 메뉴를 표시할 수 있 다. 기능 메뉴는 예를 들어, 설정, 연결된 디바이스들, 멀티 뷰, 채팅 등을 포함할 수 있으나, 이에 한정되는것은 아니다. 전자 장치는 멀티 뷰 메뉴 선택이 식별됨에 따라, 멀티 뷰 기능을 실행시킬 수 있다. 멀티 뷰 기능이 실행되면, 전자 장치는 멀티 뷰 메뉴를 표시할 수 있다. 한편, 도 6에서는 전자 장치의 멀티 뷰 메뉴 실행이 리모컨에 의해 실행되는 것을 예시로 설명하였 으나, 멀티 뷰 메뉴 실행 방법은 이에 한정되는 것은 아니다. 예를 들어, 전자 장치의 입력 인터페이스를 통한 사용자 입력, 전자 장치에 연결된 다른 디바이스로부터의 멀티 뷰 실행 요청 등에 기초하여, 다른 방식으로 멀티 뷰 메뉴가 실행될 수도 있다. 도 7은 본 개시의 일 실시예에 따른 전자 장치에서 제공되는, 멀티 뷰 레이아웃들을 설명하기 위한 도면이다. 일 실시예에서, 멀티 뷰 레이아웃은 복수개일 수 있다. 멀티 뷰 레이아웃이 복수개인 경우, 전자 장치는 멀티 뷰 메뉴의 복수개의 멀티 뷰 레이아웃을 카드 형태(이하, 멀티 뷰 카드) 함께 표시할 수 있다. 일부 실시예에서, 멀티 뷰 카드란 멀티 뷰 레이아웃 내에 표시될 콘텐츠/앱/소스 등에 대한 정보 없이, 멀티 뷰 레이 아웃의 화면 구성만을 나타낸 형태일 수 있다. 일 실시예에서, 전자 장치가 복수개의 멀티 뷰 레이아웃을 멀티 뷰 메뉴에 멀티 뷰 카드로 표시할 때, 멀티 뷰 카드는 멀티 뷰 레이아웃의 유형을 반영한 것일 수 있다. 예를 들어, 가로 유형의 멀티 뷰 레이아웃들은, 멀티 뷰 메뉴에서 가로형 멀티 뷰 카드로 표시될 수 있다. 이와 유사하게, 세로 유형의 멀티 뷰 레이아웃들은, 멀티 뷰 메뉴에서 세로형 멀티 뷰 카드로 표시될 수 있다. 일 실시예에서, 전자 장치가 복수개의 멀티 뷰 레이아웃을 멀티 뷰 메뉴에 멀티 뷰 카드로 표시할 때, 멀티 뷰 카드는 멀티 뷰 레이아웃 내 화면 구성을 나타내는 것일 수 있다. 예를 들어, 멀티 뷰 레이아웃이 N개의 화면으로 구성되는 경우, 전자 장치는 멀티 뷰 레이아웃을 소정 비율로 축소하여, 멀티 뷰 레이아 웃이 실행되었을 때의 화면 구성이 멀티 뷰 메뉴에서 식별 가능하도록, 멀티 뷰 카드를 표시할 수 있다. 일 실시예에서, 전자 장치가 복수개의 멀티 뷰 레이아웃을 멀티 뷰 메뉴에 멀티 뷰 카드 형태로 표 시할 때, 멀티 뷰 레이아웃의 식별이 용이하도록 멀티 뷰 레이아웃의 명칭이 함께 표시될 수 있다. 멀티 뷰 레이아웃의 명칭은 전자 장치에서 미리 결정된 것이거나, 사용자에 의해 직접 명명된 것일 수 있 다. 예를 들어, 전자 장치에서 스포츠에 관련된 콘텐츠 시청을 위한 멀티 뷰 레이아웃을 제공하는 경우, 멀티 뷰 레이아웃의 명칭 ‘스포츠’가 멀티 뷰 카드와 함께 표시될 수 있다. 이와 유사하게, 전자 장치 의 사용자가 홈 워크아웃에 관련된 콘텐츠 시청을 위한 멀티 뷰 레이아웃을 생성하고, 생성된 멀티 뷰 레 이아웃의 명칭을 ‘홈 워크아웃’으로 명명한 경우, 멀티 뷰 레이아웃의 명칭 ‘홈 워크아웃’이 멀 티 뷰 카드와 함께 표시될 수 있다. 일 실시예에서, 전자 장치는 멀티 뷰 메뉴에 표시된 적어도 하나의 멀티 뷰 레이아웃 중에서, 실행 시킬 멀티 뷰 레이아웃을 선택하는 사용자 입력을 수신할 수 있다. 예를 들어, 전자 장치가 제1 표시 모 드로 동작하는 동안, 실행시킬 멀티 뷰 레이아웃을 선택하는 사용자 입력이 수신될 수 있다. 전자 장치는 선택된 멀티 뷰 레이아웃의 유형을 식별할 수 있다. 이 경우, 선택된 멀티 뷰 레이아웃의 유형이 제2 표시 모드 에 대응하면, 전자 장치는 디스플레이를 회전시키고, 표시 모드를 제2 표시 모드로 전환하고, 선택된 멀 티 뷰 레이아웃을 이용하여 제2 표시 모드에서 복수의 콘텐츠를 표시할 수 있다. 도 8은 본 개시의 일 실시예에 따른 전자 장치가 맞춤형 멀티 뷰 레이아웃을 생성하는 동작을 설명하기 위한 흐 름도이다. 일 실시예에서, 전자 장치에서 실행되는 멀티 뷰 기능은, 전자 장치에 기 저장된 멀티 뷰 레이아웃 일 수 있다. 기 저장된 멀티 뷰 레이아웃은 예를 들어, 전자 장치에서 기본으로 제공되는, 사전 설정된 멀티 뷰 레이아웃 또는 사용자가 생성한 멀티 뷰 레이아웃을 포함할 수 있다. 또는, 전자 장치에 저장되 어 있지 않은 새로운 멀티 뷰 레이아웃이 사용자에 의해 설정되어 실행 중일 수 있다. 전자 장치는 멀티 뷰 기능이 실행 중인 때 이후의 어느 한 시점에, 맞춤형 멀티 뷰 레이아웃을 생성하기 위한 동작들을 수행할 수 있다. 예를 들어, 전자 장치는 실행 중이던 멀티 뷰 기능이 종료되면, 맞춤형 멀티 뷰 레이아웃을 생성할 수 있다. 단계 S810에서, 일 실시예에 따른 전자 장치는 실행된 멀티 뷰 레이아웃이 기 저장된 멀티 뷰 레이아웃과 동일한지 여부를 식별한다. 일 실시예에서, 전자 장치는 기 저장된 멀티 뷰 레이아웃의 실행된 것이 아닌, 사용자에 의해 직접 멀티 뷰 레이아웃이 구성되어 실행된 경우, 실행된 멀티 뷰 레이아웃을 전자 장치에 기 저장된 멀티 뷰 레이아 웃과 비교할 수 있다. 전자 장치는 기 저장된 멀티 뷰 레이아웃이 실행된 경우, 실행된 멀티 뷰 레이아웃 을 기 저장된 멀티 뷰 레이아웃과 비교하지 않는다. 전자 장치는 실행된 멀티 뷰 레이아웃이 기 저장된 멀티 뷰 레이아웃과 동일한 경우, 단계를 종료할 수 있다. 전자 장치는 실행된 멀티 뷰 레이아웃이 기 저 장된 멀티 뷰 레이아웃과 동일하지 않은 경우, 단계 S820을 수행할 수 있다. 단계 S820에서, 일 실시예에 따른 전자 장치는 실행된 멀티 뷰 레이아웃을 맞춤형 멀티 뷰 레이아웃으로 저장할지 여부를 사용자에게 질문할 수 있다. 전자 장치는 실행된 멀티 뷰 레이아웃을 저장하기 위한 사 용자 인터페이스를 표시할 수 있다. 단계 S830에서, 일 실시예에 따른 전자 장치는 실행된 멀티 뷰 레이아웃을 맞춤형 멀티 뷰 레이아웃으로 저장한다. 전자 장치는 맞춤형 멀티 뷰 레이아웃을 저장할지 여부의 질문에 대한 사용자 답변이 ‘예’인 경우, 실행된 멀티 뷰 레이아웃을 맞춤형 멀티 뷰 레이아웃으로 저장할 수 있다. 도 9는 본 개시의 일 실시예에 따른 전자 장치가 자동으로 맞춤형 멀티 뷰 레이아웃을 생성하는 동작을 설명하 기 위한 흐름도이다. 일 실시예에서, 전자 장치는 도 8에서 전술한 실시예인 맞춤형 멀티 뷰 레이아웃을 생성하여 저장하는 사 용자와의 인터랙션 없이 자동으로 수행할 수 있다. 단계 S910에서, 일 실시예에 따른 전자 장치는 실행된 멀티 뷰 레이아웃이 기 저장된 멀티 뷰 레이아웃과 동일한지 여부를 식별한다. 단계 S910의 동작은 단계 S810에 대응되므로, 동일한 설명은 생략한다. 단계 S920에서, 일 실시예에 따른 전자 장치는 실행된 멀티 뷰 레이아웃을 맞춤형 멀티 뷰 레이아웃으로 저장한다. 전자 장치는 맞춤형 멀티 뷰 레이아웃을 저장할지 여부에 대한 사용자 입력이 없더라도, 실행 된 멀티 뷰 레이아웃을 맞춤형 멀티 뷰 레이아웃으로 저장할 수 있다. 도 10은 본 개시의 일 실시예에 따른 전자 장치가 맞춤형 멀티 뷰 레이아웃을 이용하여 복수의 콘텐츠를 제공하 는 동작을 설명하기 위한 흐름도이다. 도 10을 설명함에 있어서, 맞춤형 멀티 뷰 레이아웃의 유형이 가로 유형임을 예시로 설명한다. 전자 장치(200 0)가 맞춤형 멀티 뷰 레이아웃을 생성하는 동작은, 도 8 및 도 9에 대한 설명에서 기술하였으므로, 동일 한 설명은 생략한다. 도 10을 참조하면, 일 실시예에 따른 전자 장치는 사용자가 리모컨의 멀티 뷰 버튼을 누름에 따라 멀티 뷰 기능을 실행할 수 있다. 일 실시예에서, 전자 장치는 가로 모드로 동작 중일 수 있다. 가로 모드로 동작하는 동안 멀티 뷰 기능의 실행이 식별되면, 전자 장치는 멀티 뷰 메뉴를 표시할 수 있다. 일부 실시예에서, 멀티 뷰 메뉴에는 전술 한 실시예들에 따라 생성된 맞춤형 멀티 뷰 레이아웃이 표시될 수 있다. 전자 장치는 맞춤형 멀티 뷰 레이아웃을 멀티 뷰 메뉴에 표시할 때, 멀티 뷰 레이아웃에 대한 정보(예를 들어, 최근 생성)를 함께 표시할 수 있다. 전자 장치는 맞춤형 멀티 뷰 레이아웃을 실행할 수 있다. 일부 실시예에서, 전자 장치에 저장된 멀티 뷰 레이아웃이 복수개인 경우, 전자 장치는 맞춤형 멀티 뷰 레이아웃을 선택하는 사용자 입력에 기초하여 맞춤형 멀티 뷰 레이아웃을 실행할 수 있다. 전자 장치는, 전자 장치가 가로 모드로 동작 중이고, 맞춤형 멀티 뷰 레이아웃의 유형이 가로 유형이므로, 전자 장치 의 디스플레이를 회전시키지 않고, 가로 모드에서 맞춤형 멀티 뷰 레이아웃을 이용하여 복수의 콘 텐츠를 표시할 수 있다. 일 실시예에서, 전자 장치는 세로 모드로 동작 중일 수 있다. 세로 모드로 동작하는 동안 멀티 뷰 기능의 실행이 식별되면, 전자 장치는 멀티 뷰 메뉴를 표시할 수 있다. 전자 장치는 맞춤형 멀티 뷰 레이 아웃을 실행할 수 있다. 전자 장치는, 전자 장치가 세로 모드로 동작 중이고, 맞춤형 멀티 뷰 레이아웃의 유형이 가로 유형이므로, 전자 장치의 디스플레이를 회전시킬 수 있다. 전자 장치 는 디스플레이가 회전됨에 따라, 전자 장치의 표시 모드를 가로 모드로 전환하고, 가로 모드에서 맞춤형 멀티 뷰 레이아웃을 이용하여 복수의 콘텐츠를 표시할 수 있다. 도 11은 본 개시의 일 실시예에 따른 전자 장치가 사용자 입력에 기초하여 맞춤형 멀티 뷰 레이아웃을 생성하고 복수의 콘텐츠를 표시하는 동작을 설명하기 위한 흐름도이다.도 11의 단계 S1110 이전에, 도 4의 단계 S410이 수행될 수 있다. 즉, 전자 장치는 제1 표시 모드로 동작 하는 동안, 멀티 뷰 기능의 실행을 식별할 수 있다. 단계 S1110에서, 일 실시예에 따른 전자 장치는 맞춤형 멀티 뷰 레이아웃을 생성하기 위한 사용자 인터페 이스를 표시할 수 있다. 일부 실시예에서, 전자 장치는, 전자 장치에 저장된 멀티 뷰 레이아웃이 존재하지 않는 경우, 맞춤형 멀티 뷰 레이아웃을 생성하기 위한 사용자 인터페이스를 표시할 수 있다. 일부 실 시예에서, 전자 장치는 맞춤형 인터페이스 생성을 위한 사용자 입력에 기초하여, 맞춤형 멀티 뷰 레이아 웃을 생성하기 위한 사용자 인터페이스를 표시할 수 있다. 단계 S1120에서, 일 실시예에 따른 전자 장치는 사용자 입력에 기초하여, 멀티 뷰 기능에서 제공될 맞춤 형 멀티 뷰 레이아웃을 생성한다. 전자 장치가 사용자 입력에 기초하여 맞춤형 멀티 뷰 레이아웃을 생성 하는 구체적인 동작들은, 도 12를 참조하여 더 기술한다. 단계 S1130에서, 일 실시예에 따른 전자 장치는 생성된 맞춤형 멀티 뷰 레이아웃을 저장한다. 전자 장치 는 맞춤형 멀티 뷰 레이아웃을 생성한 이후에, 전자 장치에서 멀티 뷰 기능이 실행되면 맞춤형 멀 티 뷰 레이아웃을 맞춤형 멀티 뷰 메뉴에 표시할 수 있다. 단계 S1140에서, 일 실시예에 따른 전자 장치는 맞춤형 멀티 뷰 레이아웃의 유형을 식별할 수 있다. 전자 장치는 생성된 맞춤형 멀티 뷰 레이아웃의 유형이 가로 유형인지 세로 유형인지 여부를 식별할 수 있다. 전자 장치는 단계 S1140을 수행한 후, 도 4의 단계 S430을 수행할 수 있다. 일 실시예에서, 전자 장치는 생성된 맞춤형 멀티 뷰 레이아웃의 유형이 전자 장치의 현재 표시 모 드와 대응되지 않는 경우, 전자 장치의 디스플레이를 회전시키고, 전자 장치의 화면 표시 모드를 전환할 수 있다. 전자 장치는 전환된 화면 표시 모드에서 맞춤형 멀티 뷰 레이아웃을 이용하여 복수의 콘 텐츠를 표시할 수 있다. 도 12는 본 개시의 일 실시예에 따른 전자 장치가 사용자 입력에 기초하여 맞춤형 멀티 뷰 레이아웃을 생성하는 동작을 설명하기 위한 도면이다. 일 실시예에서, 전자 장치에서 제공되는 멀티 뷰 메뉴는, 맞춤형 멀티 뷰 레이아웃 생성 항목 을 포함할 수 있다. 전자 장치는 맞춤형 멀티 뷰 레이아웃 생성 항목을 선택하는 사용자 입 력이 수신되면, 맞춤형 멀티 뷰 레이아웃을 생성하기 위한 사용자 인터페이스를 표시할 수 있다. 전자 장치가 사용자 입력에 기초하여 맞춤형 멀티 뷰 레이아웃을 생성하는 동작은, 단계 S1210 내지 S1240을 포함할 수 있다. 단계 S1210은, 맞춤형 멀티 뷰 레이아웃 생성을 위한 템플릿 선택 단계이다. 일 실시예에 따른 전자 장치(200 0)는 멀티 뷰 레이아웃의 템플릿을 선택 가능한 사용자 인터페이스를 표시할 수 있다. 일부 실시예에서, 전자 장치는 전자 장치에 저장된 추천 템플릿을 표시하고, 추천 템플릿 중 하나를 선택하는 사용자 입력 을 수신할 수 있다. 일부 실시예에서, 전자 장치는 사용자로부터 새로운 템플릿을 생성하는 사용자 입력 을 수신할 수 있다. 단계 S1210에서, 제1 화면과 제2 화면으로 구성되는, 세로 유형 멀티 뷰 레이아웃이 선택된 것을 예시로 설명한다. 단계 S1220은, 맞춤형 멀티 뷰 레이아웃에 표시될 제1 콘텐츠를 선택하는 단계이다. 일 실시예에 따른 전자 장 치는 멀티 뷰 레이아웃 내의 제1 화면에 표시될 제1 콘텐츠를 선택하는 사용자 입력을 수신할 수 있다. 콘텐츠는 애플리케이션 또는 소스로부터 제공되는 콘텐츠일 수 있다. 예를 들어, 선택된 제1 콘텐츠는 라이브 TV 애플리케이션에서 제공되는 콘텐츠일 수 있다. 단계 S1230은, 맞춤형 멀티 뷰 레이아웃에 표시될 제2 콘텐츠를 선택하는 단계이다. 일 실시예에 따른 전자 장 치는 멀티 뷰 레이아웃 내의 제2 화면에 표시될 제2 콘텐츠를 선택하는 사용자 입력을 수신할 수 있다. 예를 들어, 선택된 제2 콘텐츠는 삼성 TV 애플리케이션에서 제공되는 콘텐츠일 수 있다. 단계 S1240은, 맞춤형 멀티 뷰 레이아웃을 저장하는 단계이다. 전자 장치는 제1 화면에 제1 콘텐츠가 표 시되고, 제2 화면에 제2 콘텐츠가 표시되도록 구성된, 맞춤형 멀티 뷰 레이아웃을 저장할 수 있다. 맞춤형 멀티 뷰 레이아웃이 저장되면, 전자 장치는 단계 S1250 및/또는 S1252를 수행할 수 있다. 단계 S1250에서, 전자 장치는 맞춤형 멀티 뷰 레이아웃을 저장함에 따라, 멀티 뷰 화면으로 진입한다. 일 부 실시예에서, 전자 장치는 맞춤형 멀티 뷰 레이아웃의 유형을 식별할 수 있다. 전자 장치는 맞춤 형 멀티 뷰 레이아웃의 유형 및 전자 장치의 현재 표시 모드에 기초하여, 전자 장치의 디스플레이를 회전시킬 수 있다. 예를 들어, 저장된 맞춤형 멀티 뷰 레이아웃의 유형이 세로 유형이므로, 전자 장치(200 0)의 현재 표시 모드가 가로 모드이면, 전자 장치는 디스플레이를 회전시켜 표시 모드를 세로 모드로 전 환함으로써 멀티 뷰 화면으로 진입할 수 있다. 전자 장치가 맞춤형 멀티 뷰 레이아웃을 저장함에 따라 멀 티 뷰 화면으로 진입하는 동작은, 도 4의 단계 S430 내지 단계 S450과 유사한 방식으로 수행될 수 있다. 단계 S1252에서, 전자 장치는 멀티 뷰 메뉴에 표시될 맞춤형 멀티 뷰 카드를 생성한다. 전자 장치 는 맞춤형 멀티 뷰 레이아웃이 저장되면, 맞춤형 멀티 뷰 레이아웃이 이용 가능하도록 맞춤형 멀티 뷰 메뉴에 표시될 맞춤형 멀티 뷰 카드를 생성할 수 있다. 도 13은 본 개시의 일 실시예에 따른 전자 장치에서 제공되는, 멀티 뷰 메뉴의 구성을 설명하기 위한 도면이다. 일 실시예에서, 전자 장치는 멀티 뷰 기능이 실행되면, 멀티 뷰 메뉴를 표시할 수 있다. 일 실시예에서, 멀티 뷰 메뉴는 적어도, 멀티 뷰 레이아웃의 썸네일, 멀티 뷰 기능에서 사용될 앱/ 소스들(예를 들어, 비디오 애플리케이션, TV 애플리케이션, 음악 애플리케이션, OTT 애플리 케이션, 인터넷 애플리케이션, 스마트폰 소스 및 USB 카메라 소스 등), 맞춤형 멀티 뷰 레이아웃 생성 항목을 포함할 수 있다. 멀티 뷰 레이아웃의 썸네일은 멀티 뷰 레이아웃의 화면 구성 및 멀티 뷰 레이아웃의 각각의 화면에서 제 공될 콘텐츠에 관련된 썸네일을 포함할 수 있다. 일 실시예에서, 전자 장치는 멀티 뷰 메뉴 내에서 멀티 뷰 레이아웃의 썸네일을 표시할 수 있다. 전자 장치는 멀티 뷰 기능의 실행이 식별됨에 따라, 실행시킬 멀티 뷰 레이아웃을 선택하는 사용자 입력을 수신하기 위해, 멀티 뷰 메뉴에 멀티 뷰 썸네일을 표시할 수 있다. 전자 장치는 멀티 뷰 썸네일을 선택하는 사용자 입력이 수신되면, 멀티 뷰 썸네일에 대응하 는 멀티 뷰 레이아웃을 이용하여 복수의 콘텐츠를 표시할 수 있다. 일부 실시예에서, 전자 장치는 멀티 뷰 썸네일에 대응하는 멀티 뷰 레이아웃의 유형을 식별하고, 멀티 뷰 레이아웃의 유형 및 전자 장치 의 현재 표시 모드에 기초하여 전자 장치의 디스플레이를 회전시킬 수 있다. 이는 전술하였으므로, 동일한 설명은 생략한다. 일 실시예에서, 전자 장치는 멀티 뷰 기능에서 사용될 앱/소스들(예를 들어, 비디오 애플리케이션, TV 애플리케이션, 음악 애플리케이션, OTT 애플리케이션, 인터넷 애플리케이션, 스마 트폰 소스 및 USB 카메라 소스 등)을 선택하는 사용자 입력에 기초하여, 멀티 뷰 화면을 제공할 수 있다. 예를 들어, 전자 장치는 비디오 애플리케이션 및 USB 카메라 소스를 선택하는 사용자 입력에 기초하여, 멀티 뷰 레이아웃의 제1 화면에는 비디오 애플리케이션으로부터 제공되는 제1 콘텐츠를 표시하고, 제2 화면에는 USB 카메라 소스로부터 제공되는 제2 콘텐츠를 표시할 수 있다. 일부 실시예에서, 전자 장치는 실행된 멀티 뷰 레이아웃이 전자 장치에 저장되어 있지 않은 새로운 멀티 뷰 레이아웃인 경우, 실행된 멀티 뷰 레이아웃을 저장할 수 있다. 이는, 도 8 및 도 9에 대한 설명에서 전술하 였으므로, 동일한 설명은 생략한다. 일 실시예에서, 전자 장치는 맞춤형 멀티 뷰 레이아웃 생성 항목을 선택하는 사용자 입력에 기초하 여, 맞춤형 멀티 뷰 레이아웃을 생성할 수 있다. 이는, 도 11 및 도 12에 대한 설명에서 전술하였으므로, 동일 한 설명은 생략한다. 도 14는 본 개시의 일 실시예에 따른 전자 장치가 사전 설정된 멀티 뷰 레이아웃을 이용하는 동작을 설명하기 위한 도면이다. 도 14를 설명함에 있어서, 전자 장치의 제1 표시 모드는 가로 모드이고, 제2 표시 모드는 세로 모드인 것 을 예시로 설명한다. 도 14의 예시에서, 전자 장치는 제1 표시 모드인 가로 모드로 동작 중이다. 일 실시예에서, 전자 장치는 전자 장치에 사전 설정된 멀티 뷰 레이아웃을 사용자에게 제공할 수 있다. 일부 실시예에서, 사전 설정된 멀티 뷰 레이아웃은, 제공되는 콘텐츠의 주제에 따라 분류되어 사전 설정 된 것일 수 있다. 예를 들어, 멀티 뷰 레이아웃의 주제는, 스포츠에 관련된 복수의 콘텐츠를 주제로 하는 ‘스 포츠’, 집에서 할 수 있는 운동에 관련된 복수의 콘텐츠를 주제로 하는 ‘홈 워크아웃’ 등을 포 함할 수 있다. 일 실시예에서, 전자 장치는 멀티 뷰 레이아웃의 주제가 선택되면, 선택된 주제에 관련된 하나 이상의 멀 티 뷰 레이아웃을 표시할 수 있다. 전자 장치는 하나 이상의 멀티 뷰 레이아웃 중에서 어느 하나를 선택 하는 사용자 입력을 수신할 수 있다. 예를 들어, 전자 장치는 스포츠 주제에 대하여, 제1 멀티 뷰 레이아 웃 내지 제5 멀티 뷰 레이아웃을 표시할 수 있다. 여기서, 제4 멀티 뷰 레이아웃은, 세로 유형의 멀티 뷰 레이아웃이며, 제1 화면에서는 가로 화면의 라이브 TV 콘텐츠가 제공되고, 제2 화면에서는 세로 화면의 스마트 폰 소스 콘텐츠가 제공되는 레이아웃일 수 있다. 일 실시예에서, 사용자가 제4 멀티 뷰 레이아웃을 선택하면, 전자 장치는 선택된 제4 멀티 뷰 레이 아웃의 유형을 식별할 수 있다. 이 경우, 제4 멀티 뷰 레이아웃의 유형이 세로 유형이므로, 제4 멀티 뷰 레이아웃의 유형은 전자 장치의 제2 표시 모드(세로 모드)에 대응한다. 전자 장치는 디스플레이를 세로로 회전시킬 수 있다. 전자 장치는 디스플레이가 세로로 회전됨에 따라, 전자 장치의 표시 모드를 제2 표시 모드로 전환하고, 제4 멀티 뷰 레이아웃을 이용하여, 제2 표시 모드에서 복수의 콘텐츠를 표시할 수 있다. 예를 들어, 제1 화면에서 제공되는 제1 콘텐츠는 라이브 TV의 콘텐츠인 축구 경기 중계이고, 제2 화면에서 제공되는 제2 콘텐츠는 스마트폰 소스의 콘텐츠인 축구 경기 와 관련된 정보(예를 들어, 경기 시간, 스코어 등)일 수 있다. 도 15는 본 개시의 일 실시예에 따른 전자 장치에서 제공되는, 멀티 뷰 메뉴의 다른 구성을 설명하기 위한 도면 이다. 일 실시예에서, 전자 장치는 멀티 뷰 레이아웃을 멀티 뷰 레이아웃의 종류별로 구분하여 표시할 수 있다. 일부 실시예에서, 멀티 뷰 레이아웃은, 전자 장치에서 기본으로 제공되는 사전 설정된 멀티 뷰 레이아웃, 전자 장치에서 전술한 실시예들을 통해 생성되는 맞춤형 멀티 뷰 레이아웃으로 구분될 수 있다. 일 실시예에서, 전자 장치는 멀티 뷰 메뉴 내에서 사전 설정된 멀티 뷰 레이아웃 및 맞춤형 멀티 뷰 레이아웃을 구별하여 표시할 수 있다. 멀티 뷰 메뉴에 표시되는 사전 설정된 멀티 뷰 레이 아웃은 복수개일 수 있다. 또한, 멀티 뷰 메뉴에 표시되는 맞춤형 멀티 뷰 레이아웃은 복수 개일 수 있다. 전자 장치는 사전 설정된 멀티 뷰 레이아웃 또는 맞춤형 멀티 뷰 레이아웃을 선택하는 사용 자 입력에 기초하여, 선택된 멀티 뷰 레이아웃을 이용하여 복수의 콘텐츠를 표시할 수 있다. 일부 실시예에서, 선택된 멀티 뷰 레이아웃의 유형이 전자 장치의 현재 표시 모드에 대응하지 않는 경우, 전자 장치 는 디스플레이를 회전시킬 수 있다. 이는 전술한 실시예들에서 이미 설명하였으므로, 동일한 설명은 생략한다. 도 16은 본 개시의 일 실시예에 따른 전자 장치가 멀티 뷰 모드로 복수의 관련된 콘텐츠를 제공하는 동작을 설 명하기 위한 흐름도이다. 단계 S1610에서, 일 실시예에 따른 전자 장치는 전자 장치가 제1 표시 모드로 동작하는 동안, 전자 장치에서 표시되는 싱글 콘텐츠를 식별한다. 일 실시예에서, 전자 장치는 멀티 뷰 모드가 아닌 일반 모드로 동작하면서, 싱글 콘텐츠를 표시 중일 수 있다. 이 경우, 전자 장치는 표시 중인 싱글 콘텐츠를 식별할 수 있다. 예를 들어, 전자 장치는 전 자 장치에서 표시 중인 싱글 콘텐츠가 A 영화임을 식별할 수 있다. 일 실시예에서, 전자 장치는 전자 장치에서 표시 중인 싱글 콘텐츠에 관련된 정보를 획득할 수 있 다. 콘텐츠에 관련된 정보는 예를 들어, 콘텐츠 명, 콘텐츠의 회차 정보, 콘텐츠의 장르, 콘텐츠 제작사, 콘텐 츠가 방영되는 채널 정보, 콘텐츠가 방영되는 시간 등을 포함할 수 있으나, 이에 한정되는 것은 아니며, 콘텐츠 의 특징과 관련된 다양한 정보들을 포함할 수 있다. 예를 들어, 전자 장치는 전자 장치에서 표시 중인 콘텐츠가 ‘영화 A’인 경우, 영화 명, 장르, 상영 시간, 상영 등급, 관객 수, 출연진 등의 콘텐츠와 관련 된 정보를 획득할 수 있다. 단계 S1620에서, 일 실시예에 따른 전자 장치는 전자 장치가 제1 표시 모드로 동작하는 동안, 복수 의 콘텐츠를 표시하기 위한 멀티 뷰 기능의 실행을 식별한다. 전자 장치가 싱글 콘텐츠를 표시하는 도중 에, 멀티 뷰 기능의 실행이 식별되면, 전자 장치는 단계 S1630 내지 S1660을 더 수행하여 복수의 콘텐츠를 표시 할 수 있다. 단계 S1620은 도 4의 단계 S410에 대응하므로, 동일한 설명은 생략한다. 단계 S1630에서, 일 실시예에 따른 전자 장치는 멀티 뷰 기능에서 제공될 멀티 뷰 레이아웃의 유형을 식 별한다. 일부 실시예에서, 멀티 뷰 기능에서 제공될 멀티 뷰 레이아웃은, 전자 장치에서 제공되는 사전설정된 멀티 뷰 레이아웃일 수 있다. 단계 S1630은 도 4의 단계 S420에 대응하므로, 동일한 설명은 생략한다. 단계 S1640에서, 일 실시예에 따른 전자 장치는 멀티 뷰 레이아웃의 유형이 제2 표시 모드에 대응하면, 전자 장치의 디스플레이를 회전시킨다. 단계 S1640은 도 4의 단계 S430에 대응하므로, 동일한 설명은 생 략한다. 단계 S1650에서, 일 실시예에 따른 전자 장치는 디스플레이가 회전됨에 따라, 전자 장치의 표시 모 드를 제2 표시 모드로 전환한다. 단계 S1650은 도 4의 단계 S440에 대응하므로, 동일한 설명은 생략한다. 단계 S1660에서, 일 실시예에 따른 전자 장치는 멀티 뷰 레이아웃을 이용하여, 제2 표시 모드에서, 싱글 콘텐츠 및 싱글 콘텐츠에 관련된 하나 이상의 콘텐츠로 구성되는 복수의 콘텐츠를 표시한다. 전자 장치는 싱글 콘텐츠에 관련된 정보에 기초하여, 멀티 뷰 레이아웃에서 제공될 콘텐츠들을 결정할 수 있다. 예를 들어, 단계 S1610에서 설명한 것과 같이 싱글 콘텐츠가 ‘영화 A’라면, 멀티 뷰 레이아웃의 제1 화면에는 ‘영화 A’ 가 표시되고, 제2 화면에는 ‘영화 A’와 관련된 정보를 포함하는 콘텐츠가 표시되고, 제3 화면에는 ‘영화 A’ 관련된 또다른 정보를 표시하는 또다른 콘텐츠가 표시될 수 있다. 전자 장치가 싱글 콘텐츠 및 싱글 콘텐츠와 관련된 하나 이상의 콘텐츠로 구성되는 복수의 콘텐츠를 표시 하는 실시예를 도 17을 참조하여 더 설명한다. 도 17은 본 개시의 일 실시예에 따른 전자 장치가 멀티 뷰 모드로 복수의 관련된 콘텐츠를 제공하는 동작을 설 명하기 위한 도면이다. 도 17을 설명함에 있어서, 전자 장치의 제1 표시 모드가 가로 모드이고 제2 표시 모드가 세로 모드인 것을 예시 로 설명한다. 일 실시예에서, 전자 장치는 전자 장치가 가로 모드로 동작하는 동안, 전자 장치에서 표시되 는 싱글 콘텐츠를 식별할 수 있다. 예를 들어, 전자 장치에서 표시 중인 싱글 콘텐츠가 스포츠 콘텐츠인 축구 경기 중계임을 식별할 수 있다. 일부 실시예에서, 전자 장치는 콘텐츠에 관련된 정보인 채널 명, 축 구 경기 정보(팀 정보, 선수 정보, 경기 시간 정보 등)등을 획득할 수 있다. 일 실시예에서, 전자 장치는 전자 장치가 가로 모드로 동작하는 동안, 복수의 콘텐츠를 표시하기 위한 멀티 뷰 기능의 실행을 식별할 수 있다. 전자 장치는 멀티 뷰 기능의 실행이 식별됨에 따라, 전자 장치에서 제공될 멀티 뷰 레이아웃의 유형을 식별할 수 있다. 전자 장치에서 제공 가능한 멀티 뷰 레이아웃이 복수개인 경우, 전자 장치는 멀티 뷰 레이아웃을 선택하는 사용자 입력을 수신하고, 선택된 멀티 뷰 레이아웃의 유형을 식별할 수 있다. 일부 실시예에서, 전자 장치에서 제공 가능한 멀티 뷰 레이 아웃이 복수개인 경우, 전자 장치는 자동으로 적합한 어느 하나의 멀티 뷰 레이아웃을 선택하고, 선택된 멀티 뷰 레이아웃의 유형을 식별할 수 있다. 일 실시예에서, 식별된 멀티 뷰 레이아웃의 유형은, 세로 유형일 수 있다. 일 실시예에서, 전자 장치는 멀티 뷰 레이아웃의 유형이 세로 유형에 대응되므로, 전자 장치의 디 스플레이를 회전시킬 수 있다. 전자 장치는 전자 장치의 디스플레이가 세로로 회전됨에 따라, 전자 장치의 표시 모드를 세로 모드로 전환할 수 있다. 전자 장치는 멀티 뷰 레이아웃을 이용하여, 세로 모드에서, 싱글 콘텐츠 및 싱글 콘텐츠에 관련된 하나 이상의 콘텐츠로 구성되는 복수의 콘텐츠를 표시할 수 있다. 예를 들어, 전자 장치는 제1 화면에 축구 경기 중계 콘텐츠를 표시하고, 제2 화면 다른 축구 경기들을 시청할 수 있는 추천 동영상들을 나타 내는 콘텐츠를 표시하고, 제3 화면에 현재 진행 중인 축구 경기에 관련된 정보를 나타내는 콘텐츠를 표시 할 수 있다. 도 18은 본 개시의 일 실시예에 따른 전자 장치의 구성을 도시한 블록도이다. 도 18을 참조하면, 일 실시예에 따른 전자 장치는 통신부, 수신부, 디스플레이, 메모 리 및 프로세서를 포함할 수 있다. 통신부는 프로세서의 제어에 의해 다른 전자 장치들과 데이터 통신을 수행할 수 있다. 통신부 는 예를 들어, 유선 랜, 무선 랜(Wireless LAN), 와이파이(Wi-Fi), 블루투스(Bluetooth), 지그비 (zigbee), WFD(Wi-Fi Direct), 적외선 통신(IrDA, infrared Data Association), BLE (Bluetooth Low Energy), NFC(Near Field Communication), 와이브로(Wireless Broadband Internet, Wibro), 와이맥스(WorldInteroperability for Microwave Access, WiMAX), SWAP(Shared Wireless Access Protocol), 와이기그 (Wireless Gigabit Alliances, WiGig) 및 RF 통신을 포함하는 데이터 통신 방식 중 적어도 하나를 이용하여 다 른 전자 장치와의 데이터 통신을 수행할 수 있는, 통신 회로를 포함할 수 있다. 수신부는 프로세서의 제어에 의해 전자 장치의 외부로부터 이미지, 비디오, 오디오 등을 수 신할 수 있다. 수신부는 예를 들어, HDMI 포트(High-Definition Multimedia Interface port, 컴포넌트 잭(component jack), PC 포트(PC port), 디스플레이 포트(Display port) 및 USB 포트(USB port) 중 적어도 하나를 포함할 수 있다. 디스플레이는 프로세서의 제어에 의해 전자 장치의 화면에 영상 신호를 출력할 수 있다. 전 자 장치는 멀티 뷰 레이아웃을 이용하여 디스플레이에 복수의 콘텐츠를 표시할 수 있다. 일 실시예 에서, 디스플레이는 가로 디스플레이 및 세로 디스플레이로 회전 가능한 디스플레이일 수 있다. 일부 실 시예에서, 프로세서는 전자 장치에 포함되는 모터(미도시)를 제어함으로써, 디스플레이를 회 전시킬 수 있다. 일부 실시예에서, 프로세서는 통신부를 이용하여 전자 장치의 디스플레이 에 부착된 회전 모듈(미도시)에 제어 명령을 전송함으로써, 디스플레이를 회전시킬 수 있다. 메모리는 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), 멀티미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등)를 포함할 수 있으며, 롬(ROM, Read-Only Memory), EEPROM(Electrically Erasable Programmable Read-Only Memory), PROM(Programmable Read-Only Memory), 자기 메모리, 자기 디스크, 광디스크 중 적어도 하나를 포함하는 비 휘 발성 메모리 및 램(RAM, Random Access Memory) 또는 SRAM(Static Random Access Memory)과 같은 휘발성 메모 리를 포함할 수 있다. 일 실시예에 따른 메모리는 복수의 콘텐츠를 표시하기 위해 동작하도록 하는 하나 이상의 인스트럭션 또 는 프로그램을 저장할 수 있다. 일부 실시예에서, 메모리에는 전자 장치에 설치된 하나 이상의 애 플리케이션들이 저장될 수 있다. 애플리케이션들은 예를 들어, OTT(Over The Top) 미디어 서비스 애플리케이션, 비디오 애플리케이션, 게임 애플리케이션 등일 수 있다. 일부 실시예에서, 메모리는 하나 이상의 멀티 뷰 레이아웃이 저장될 수 있다. 하나 이상의 멀티 뷰 레이아웃은 예를 들어, 전자 장치에서 기본으로 제공되 는, 사전 설정된 멀티 뷰 레이아웃 또는 사용자가 생성한 멀티 뷰 레이아웃을 포함할 수 있다. 프로세서는 전자 장치의 전반적인 동작들을 제어할 수 있다. 예를 들어, 프로세서는 메모리 에 저장된 프로그램의 하나 이상의 명령어들(instructions)을 실행함으로써, 전자 장치가 멀티 뷰 레이아웃을 이용하여 복수의 콘텐츠를 표시하기 위한 전반적인 동작들을 제어할 수 있다. 프로세서는 예를 들어, 중앙 처리 장치(Central Processing Unit), 마이크로 프로세서(microprocessor), 그래픽 처리 장치(Graphic Processing Unit), ASICs(Application Specific Integrated Circuits), DSPs(Digital Signal Processors), DSPDs(Digital Signal Processing Devices), PLDs(Programmable Logic Devices), FPGAs(Field Programmable Gate Arrays), 애플리케이션 프로세서(Application Processor), 신경망 처리 장치(Neural Processing Unit) 또는 인공지능 모델의 처리에 특화된 하드웨어 구조로 설계된 인공지능 전 용 프로세서 중 적어도 하나로 구성될 수 있으나, 이에 제한되는 것은 아니다. 일 실시예에서, 프로세서는 디스플레이의 현재 표시 모드를 식별할 수 있다. 예를 들어, 프로세서 는 디스플레이가 가로 모드 또는 세로 모드임을 식별할 수 있다. 일 실시예에서, 프로세서는 멀티 뷰 기능을 실행할 수 있다. 프로세서는 전자 장치와 무선 및/또는 유선으로 연결된 다른 장치(예를 들어, 스마트폰, 퍼스널 컴퓨터 등)로부터 멀티 뷰 기능의 실행 명령/ 신호를 수신하거나, 전자 장치의 제어를 위한 장치(예를 들어, 리모컨 등)으로부터 멀티 뷰 기능의 실행 명령/신호를 수신하거나, 전자 장치의 입력 인터페이스(예를 들어, 터치 스크린 등)으로부터 멀티 뷰 기 능의 실행 입력을 수신할 수 있다. 일 실시예에서, 프로세서는 실행될 멀티 뷰 레이아웃의 유형과, 디스플레이의 현재 표시 모드를 비 교할 수 있다. 예를 들어, 실행될 멀티 뷰 레이아웃의 유형이 디스플레이의 현재 표시 모드에 대응하면, 프로세서는 디스플레이를 회전시키지 않고, 멀티 뷰 레이아웃에서 복수의 콘텐츠가 표시되도록 할 수 있다. 또한, 실행될 멀티 뷰 레이아웃의 유형이 디스플레이의 현재 표시 모드와 상이한 표시 모드에 대응하 면, 프로세서는 디스플레이를 회전시키고, 회전된 디스플레이에 대응되도록 표시 모드를 전환하고,전환된 표시 모드의 멀티 뷰 레이아웃에서 복수의 콘텐츠가 표시되도록 할 수 있다. 일 실시예에서, 프로세서가 디스플레이를 회전시키는 것은, 전자 장치에 포함되는 모터(미도 시)를 제어함으로써 달성되거나, 전자 장치의 디스플레이에 부착된 회전 모듈(미도시)에 제어 명령 을 전송함으로써 달성될 수 있다. 프로세서가 디스플레이의 표시 모드 및 멀티 뷰 레이아웃의 유형에 기초하여 디스플레이를 회전시키고, 복수의 콘텐츠를 표시하는 구체적인 동작들은, 전술한 도면 및 그에 대한 설명들에서 상세하게 설 명하였으므로, 동일한 설명은 생략한다. 한편, 도 18에 도시된 전자 장치의 블록도는, 일 실시예를 위한 블록도이다. 블록도의 각 구성요소는 실 제 구현되는 각 장치의 사양에 따라 통합, 추가 또는 생략될 수 있다. 즉 필요에 따라 2 이상의 구성요소가 하 나의 구성요소로 합쳐지거나, 혹은 하나의 구성요소가 2 이상의 구성요소로 세분되어 구성될 수 있다. 또한, 각 블록에서 수행하는 기능은 실시예들을 설명하기 위한 것이며, 그 구체적인 동작이나 장치는 본 발명의 권리범위 를 제한하지 아니한다. 일 실시예에 따른 전자 장치의 동작 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이 터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 본 발명을 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가능 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체 (magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장 하고 수행하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지 는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코 드를 포함한다. 컴퓨터 판독 가능 매체는, 비일시적(non-transitory) 기록매체의 형태로 제공될 수 있다. 여기 서, 비일시적 기록매체는 실재(tangible)하는 장치이고, 신호(signal)(예: 전자기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 기록매체에 반영구적으로 저장되는 경우와 임시적으로 저장되는 경우를 구 분하지 않는다. 예로, '비일시적 저장매체'는 데이터가 임시적으로 저장되는 버퍼를 포함할 수 있다. 또한, 개시된 실시예들에 따른 전자 장치의 동작 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 S/W 프로그램, S/W 프로그램이 저장된 컴퓨터로 읽을 수 있는 저장 매체를 포함할 수 있다. 예를 들어, 컴퓨터 프로그램 제품은 전자 장치의 제조사 또는 전자 마켓을 통해 전자적으로 배포되는 S/W 프로그램 형태의 상품(예, 다운로더블 앱)을 포함할 수 있다. 전자적 배포를 위하여, S/W 프로그램의 적어도 일 부는 저장 매체에 저장되거나, 임시적으로 생성될 수 있다. 이 경우, 저장 매체는 제조사의 서버, 전자 마켓의 서버, 또는 SW 프로그램을 임시적으로 저장하는 중계 서버의 저장 매체가 될 수 있다. 컴퓨터 프로그램 제품은, 서버 및 클라이언트 장치로 구성되는 시스템에서, 서버의 저장매체 또는 클라이언트 장치의 저장매체를 포함할 수 있다. 또는, 서버 또는 클라이언트 장치와 통신 연결되는 외부 장치(예, 스마트폰)가 존재하는 경우, 컴퓨터 프로그램 제품은 외부 장치의 저장매체를 포함할 수 있다. 또는, 컴퓨터 프 로그램 제품은 서버로부터 클라이언트 장치 또는 외부 장치로 전송되거나, 외부 장치로부터 클라이언트 장치로 전송되는 S/W 프로그램 자체를 포함할 수 있다. 이 경우, 서버, 클라이언트 장치 및 외부 장치 중 하나가 컴퓨터 프로그램 제품을 실행하여 개시된 실시예들에 따른 방법을 수행할 수 있다. 또는, 서버, 클라이언트 장치 및 외부 장치 중 둘 이상이 컴퓨터 프로그램 제품을 실행하여 개시된 실시예들에 따른 방법을 분산하여 실시할 수 있다. 예를 들면, 서버(예로, 클라우드 서버 또는 인공 지능 서버 등)가 서버에 저장된 컴퓨터 프로그램 제품을 실행 하여, 서버와 통신 연결된 클라이언트 장치가 개시된 실시예들에 따른 방법을 수행하도록 제어할 수 있다. 이상에서 실시예들에 대하여 상세하게 설명하였지만 본 발명의 권리범위는 이에 한정되는 것은 아니고 다음의 청구범위에서 정의하고 있는 본 발명의 기본 개념을 이용한 당업자의 여러 변형 및 개량 형태 또한 본 발명의 권리범위에 속한다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13 도면14 도면15 도면16 도면17 도면18"}
{"patent_id": "10-2021-0193412", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시예에 따른 전자 장치가 복수의 콘텐츠를 표시하는 동작을 개략적으로 설명하기 위한 도면이다. 도 2는 본 개시의 일 실시예에 따른 전자 장치에서 제공되는, 멀티 뷰 레이아웃의 유형들을 설명하기 위한 도면 이다. 도 3은 본 개시의 일 실시예에 따른 전자 장치의 표시 모드들 및 각각의 표시 모드들에 따른 전자 장치의 동작 을 설명하기 위한 도면이다. 도 4는 본 개시의 일 실시예에 따른 전자 장치가 복수의 콘텐츠를 표시하는 동작을 설명하기 위한 흐름도이다. 도 5는 본 개시의 일 실시예에 따른 전자 장치에서 제공되는, 복수의 콘텐츠를 설명하기 위한 도면이다. 도 6은 본 개시의 일 실시예에 따른 전자 장치가 멀티 뷰 기능을 실행하는 방법을 설명하기 위한 도면이다. 도 7은 본 개시의 일 실시예에 따른 전자 장치에서 제공되는, 멀티 뷰 레이아웃들을 설명하기 위한 도면이다. 도 8은 본 개시의 일 실시예에 따른 전자 장치가 맞춤형 멀티 뷰 레이아웃을 생성하는 동작을 설명하기 위한 흐 름도이다. 도 9는 본 개시의 일 실시예에 따른 전자 장치가 자동으로 맞춤형 멀티 뷰 레이아웃을 생성하는 동작을 설명하 기 위한 흐름도이다. 도 10은 본 개시의 일 실시예에 따른 전자 장치가 맞춤형 멀티 뷰 레이아웃을 이용하여 복수의 콘텐츠를 제공하 는 동작을 설명하기 위한 흐름도이다. 도 11은 본 개시의 일 실시예에 따른 전자 장치가 사용자 입력에 기초하여 맞춤형 멀티 뷰 레이아웃을 생성하고 복수의 콘텐츠를 표시하는 동작을 설명하기 위한 흐름도이다. 도 12는 본 개시의 일 실시예에 따른 전자 장치가 사용자 입력에 기초하여 맞춤형 멀티 뷰 레이아웃을 생성하는 동작을 설명하기 위한 도면이다. 도 13은 본 개시의 일 실시예에 따른 전자 장치에서 제공되는, 멀티 뷰 메뉴의 구성을 설명하기 위한 도면이다. 도 14는 본 개시의 일 실시예에 따른 전자 장치가 사전 설정된 멀티 뷰 레이아웃을 이용하는 동작을 설명하기 위한 도면이다. 도 15는 본 개시의 일 실시예에 따른 전자 장치에서 제공되는, 멀티 뷰 메뉴의 다른 구성을 설명하기 위한 도면 이다. 도 16은 본 개시의 일 실시예에 따른 전자 장치가 멀티 뷰 모드로 복수의 관련된 콘텐츠를 제공하는 동작을 설 명하기 위한 흐름도이다. 도 17은 본 개시의 일 실시예에 따른 전자 장치가 멀티 뷰 모드로 복수의 관련된 콘텐츠를 제공하는 동작을 설 명하기 위한 도면이다. 도 18은 본 개시의 일 실시예에 따른 전자 장치의 구성을 도시한 블록도이다."}
