{"patent_id": "10-2023-0042180", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0146955", "출원번호": "10-2023-0042180", "발명의 명칭": "보행 가능 로봇의 고자유도 하지 구동 시스템", "출원인": "한국기술교육대학교 산학협력단", "발명자": "김용재"}}
{"patent_id": "10-2023-0042180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "고관절부;상기 고관절부의 하측에 연결되며 상기 고관절부의 동작에 따라 일체로 작동되는 대퇴부부;상기 대퇴부부의 하단에 결합되는 무릎 관절부;상기 무릎 관절부에 결합되며 상기 무릎 관절부의 작동에 따라 일체로 동작되는 종아리부;상기 종아리부의 하단에 결합되며, 피치축과 롤축을 기준으로 회동 가능하도록 마련되는 발 몸체부;상기 발 몸체부의 타측에 결합되며 피치축을 기준으로 회동 가능하도록 마련되는 발가락부;를 포함하며,상기 종아리부, 발 몸체부 및 발가락부의 동작이 서로 연동되는 것을 특징으로 하는 보행 가능 로봇의 고자유도하지 구동 시스템."}
{"patent_id": "10-2023-0042180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 대퇴부부는 상기 종아리부, 발 몸체부 및 발가락부의 작동을 위한 무릎 구동기, 발목 구동부 및 발가락 구동기를 포함하는 것을 특징으로 하는 보행 가능 로봇의 고자유도 하지 구동 시스템."}
{"patent_id": "10-2023-0042180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 무릎 관절부는 상기 피치축을 기준으로 각각 독립적으로 회동 가능하게 결합되는 무릎 풀리, 발목 풀리 및발가락 풀리를 포함하는 것을 특징으로 하는 보행 가능 로봇의 고자유도 하지 구동 시스템."}
{"patent_id": "10-2023-0042180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 종아리부는 상기 무릎 풀리와 일체로 회동될 수 있도록 고정 결합되며, 상기 무릎 구동기의 출력이 상기 벨트를 통해 상기 무릎 풀리로 전달되어 상기 무릎 풀리가 회전 작동됨으로써상기 종아리부가 작동되는 것을 특징으로 하는 보행 가능 로봇의 고자유도 하지 구동 시스템."}
{"patent_id": "10-2023-0042180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 종아리부는 상기 무릎 풀리에 고정 결합되어 일체로 회동되는 종아리 프레임과, 일측이 상기 발목 풀리에연결되고 타측이 상기 발 몸체부의 일측에 연결되는 통합 발목 연결링크를 포함하는 것을 특징으로 하는 보행가능 로봇의 고자유도 하지 구동 시스템."}
{"patent_id": "10-2023-0042180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2024-0146955-3-제4항에 있어서,상기 종아리부는 상기 무릎 풀리에 고정 결합되어 일체로 회동되는 종아리 프레임과, 상기 종아리 프레임의 하단 영역에 결합되는 발목용 지지 링크와, 일측이 상기 발목 풀리에 연결되고 타측이 상기 발목용 지지 링크에연결되는 제1 발목 연결링크와, 일측이 상기 발목용 지지 링크에 연결되고 타측이 상기 발 몸체부의 일측에 연결되는 제2 발목 연결링크를 포함하는 것을 특징으로 하는 보행 가능 로봇의 고자유도 하지 구동 시스템."}
{"patent_id": "10-2023-0042180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 발목 구동부의 출력이 상기 발목 풀리, 제1 내지 제2 발목 연결링크를 통해 상기 발 몸체에 전달됨으로써상기 발 몸체를 구동시키는 출력으로 작용됨과 동시에,상기 발목 풀리, 제1 발목 연결링크 및 발목용 지지 링크를 통해 상기 종아리부의 프레임에 전달됨으로써 상기종아리부를 작동시키는 출력으로 작용되는 것을 특징으로 하는 보행 가능 로봇의 고자유도 하지 구동 시스템."}
{"patent_id": "10-2023-0042180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서,상기 발 몸체부가 피치축과 롤축을 기준으로 회동 가능하도록 상기 발목용 지지 링크와 상기 제1 발목 연결링크는 레볼루트 조인트로 연결되고, 상기 발목용 지지 링크와 상기 제2 발목 연결링크는 볼 소켓 조인트로 연결되며, 상기 제2 발목 연결링크와 상기 발 몸체부는 유니버셜 조인트로 연결되는 것을 특징으로 하는 보행 가능 로봇의 고자유도 하지 구동 시스템."}
{"patent_id": "10-2023-0042180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서,상기 발목 구동부는 상기 발 몸체부를 작동시키기 위한 내측 발목 구동기 및 외측 발목 구동기를 포함하고,상기 발목 풀리는 상기 내측 발목 구동기 및 외측 발 발목 구동기에 출력을 전달하기 위하여 벨트를 통해 각각연결되는 내측 발목 풀리 및 외측 발목 풀리를 가지며,상기 종아리부의 발목용 지지 링크, 제1 발목 연결링크 및 제2 발목 연결링크는 상기 발 몸체부의 내측 및 외측작동을 위한 상기 내측 발목 풀리 및 외측 발목 풀리에 대응되도록 각각 2개씩 마련되는 것을 특징으로 하는 보행 가능 로봇의 고자유도 하지 구동 시스템."}
{"patent_id": "10-2023-0042180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 내측 발목 구동기 및 외측 발목 구동기와 각각 연결된 상기 내측 발목 풀리 및 외측 발목 풀리가 각각 독립적으로 회전 작동됨으로써 상기 발 몸체부가 내측 또는 외측을 향해 차동 구동될 수 있는 것을 특징으로 하는보행 가능 로봇의 고자유도 하지 구동 시스템."}
{"patent_id": "10-2023-0042180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 종아리부는 일측이 상기 발가락 풀리에 연결되고 타측이 상기 발 몸체부의 일측을 향해 연장되는 통합 발가락 연결링크와, 상기 발 몸체부에 회동 가능하게 결합되되 일측이 상기 발가락 연결 링크와 연결되는 제3 발공개특허 10-2024-0146955-4-가락 연결링크와, 일측이 상기 제3 발가락 연결 링크와 연결되고 타측이 상기 발가락부에 연결되는 제4 발가락연결 링크를 포함하는 것을 특징으로 하는 보행 가능 로봇의 고자유도 하지 구동 시스템."}
{"patent_id": "10-2023-0042180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항에 있어서,상기 종아리부는 상기 종아리 프레임의 하단 영역에 결합되어 상기 발가락부를 작동하기 위한 발가락용 지지 링크와, 일측이 상기 발가락 풀리에 연결되고 타측이 상기 발가락용 지지 링크에 연결되는 제1 발가락연결링크와, 일측이 상기 발가락용 지지 링크에 연결되고 타측이 상기 발 몸체부의 일측을 향해 연장되는 제2발가락 연결링크와, 상기 발 몸체부에 회동 가능하게 결합되되 일측이 상기 제2 발가락 연결 링크와 연결되는제3 발가락 연결링크와, 일측이 상기 제3 발가락 연결 링크와 연결되고 타측이 상기 발가락부에 연결되는 제4발가락 연결 링크를 포함하는 것을 특징으로 하는 보행 가능 로봇의 고자유도 하지 구동 시스템."}
{"patent_id": "10-2023-0042180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 발가락 구동기의 출력이 상기 발가락 풀리, 제1 발가락 연결 링크, 발가락용 지지 링크, 제2 내지 제4 발가락 연결 링크를 통해 상기 발가락부에 전달됨으로써 상기 발가락부를 작동시키는 출력으로 작용됨과 동시에,상기 발가락 풀리, 제1 발가락 연결 링크, 제2 내지 3 발가락 연결 링크를 통해 상기 발 몸체부에 전달됨으로써상기 발 몸체부를 작동시키는 출력으로 작용됨과 동시에,상기 발가락 풀리, 제1 발가락 연결 링크, 발가락용 지지 링크를 통해 상기 종아리 프레임에 전달됨으로써 상기종아리 프레임을 작동시키는 출력으로 작용되는 것을 특징으로 하는 보행 가능 로봇의 고자유도 하지 구동 시스템."}
{"patent_id": "10-2023-0042180", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 보행 가능 로봇의 고자유도 하지 구동 시스템에 관한 것으로, 더욱 상세하게는, 향상된 보행 성능을 위해 각 관절부에 자유도를 제공하고, 무릎 관절부, 발목 관절부 및 발가락 관절부가 서로 연동 구동되는 보행 가능 로봇의 고자유도 하지 구동 시스템에 관한 것이다. 본 발명에 따른 보행 가능 로봇의 고자유도 하지 구동 (뒷면에 계속)"}
{"patent_id": "10-2023-0042180", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 보행 가능 로봇의 고자유도 하지 구동 시스템에 관한 것으로, 더욱 상세하게는, 향상된 보행 성능을 위해 각 관절부에 자유도를 제공하고, 무릎 관절부, 발목 관절부 및 발가락 관절부가 서로 연동 구동되는 보행 가능 로봇의 고자유도 하지 구동 시스템에 관한 것이다."}
{"patent_id": "10-2023-0042180", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "로봇 기술은 비약적인 발전을 지속해 왔으며 최근 인공지능 및 융합기술 발전과 고령화, 삶의 질 향상을 요구하 는 사회적 수요에 대응하여 사회 전반에 걸쳐서 로봇의 활용이 확대되기 시작되고, 로봇기술은 보다 편리하고 안전한 인간의 생활을 가능하게 해주고 있다. 또한, 인간형 로봇의 개발로 두 발로 걷고 뛰는 인간형 보행 로봇에 대한 관심이 증대 되었고, 이로 인해 산업 용 로봇 중심이었던 로봇 개발에서 인간과 같이 행동하고 감각하는 인간형 로봇 개발로 점차 확대되고 있다. 이러한 분위기에 발맞추어 국내외에서 다수의 기술 개발이 이루어지고 있으며, 관련하여 다수의 특허 등이 공개 되고 있는데, 일 예로서 한국 등록특허 제10-2445308호(발명의 명칭:다족 로봇용 다리 유닛)은 고관절에 장착되 는 적층되어 구비되는 한 쌍의 고관절 구동모터, 슬관절 구동모터, 적층된 상기 고관절 구동모터 및 상기 슬관 절 구동모터가 장착되며, 상기 고관절 구동모터에 의해 회전 구동되는 모터 프레임, 상기 모터 프레임에 체결되 어 상기 모터 프레임과 함께 회전 구동되는 제1 연결링크, 상기 제1 연결링크의 단부에 회전 가능하게 체결되어 상기 제1 연결링크와 제1 슬관절을 형성하는 제2연결링크, 상기 제2 연결링크의 단부에 회전 가능하게 연결되어 상기 제2 연결링크와 제2 슬관절을 형성하며, 단부에 지면 지지를 위한 족유닛이 구비되는 제3 연결링크 및 상 기 슬관절 구동모터에 의하여 상기 제1 슬관절 및 상기 제2 슬관절을 함께 신전 또는 굴곡 구동하기 위한 구동 링크를 포함하는 다족 로봇용 다리 유닛에 대해 개시하고 있으며, 한국 등록특허 제10-1344871(발명의 명칭:로 봇용 다리 및 이를 구비한 로봇)은 로봇용 다리 및 이를 구비한 로봇에 관한 것으로서, 상기 로봇용 다리는, 로봇의 위치 이동에 사용되는 다리에 있어서, 상기 로봇의 몸체에 회전운동 가능하게 결합되는 제1부재, 상기 제1 부재에 직선왕복운동 가능하게 결합되는 제2부재, 상기 제1부재에 대하여 회전 가능하게 결합되는 크랭크축, 일 단부가 상기 크랭크축에 결합되는 크랭크암, 일단부는 상기 크랭크암의 타단부에 회전 가능하게 결합되며, 타단 부는 상기 제2부재에 회전가능하게 결합되는 컨넥팅로드를 포함하여 구성되는 로보용 다리 및 이를 구비한 로봇 에 대해 개시하고 있다. 그런데 종래의 이러한 기술을 살펴보면, 일반적으로 인간은 다자유도의 다리와 발가락 구조로 다리를 자유롭게 움직이거나 보행할 수 있으나, 종래의 대부분의 보행 로봇은 6자유도의 다리로 보행하는 구조로, 발가락에 대한 자유도를 포함하지 않으며, 일부 보행 로봇에서는 발가락의 자유도를 포함하는 구조를 시도하고 있으나, 이는 매우 제한적이고, 구조가 복잡해지고 충격에 취약하며 뚜렷한 보행 성능 향상 효과를 얻기 어려운 단점이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국 등록특허 제10-2445308호(공고일 : 2022.09.15) (특허문헌 0002) 한국 등록특허 제10-1344871호(공고일 : 2013.12.18)"}
{"patent_id": "10-2023-0042180", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 본 발명은 전술한 종래 기술의 문제점을 해결하기 위한 것으로서, 각 관절에 자유도를 부과함으로써 인 간과 유사한 하지 구조 및 동작 구조를 가지도록 하여 고자유도를 구현하며, 어느 한 관절부에 인가되는 구동력 이 다른 관절부에 함께 인가됨으로써 무릎 관절부, 발목 관절부 및 발가락 관절부의 동작이 서로 연동되어 보행 성능이 향상되고, 보행에 적합한 구조 및 메커니즘을 갖는 보행 가능 로봇의 고자유도 하지 구동 시스템을 제공 하는 데에 목적이 있다."}
{"patent_id": "10-2023-0042180", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 목적을 달성하기 위하여 본 발명에 따른 보행 가능 로봇의 고자유도 하지 구동 시스템은 고관절부, 상기 고관절부의 하측에 연결되며 상기 고관절부의 회동에 따라 일체로 동작됨으로써 요축, 피치축, 롤축을 기 준으로 움직임이 가능하도록 마련되는 대퇴부부, 피치축을 기준으로 회동 가능하도록 마련되는 풀리 모듈을 가 지며, 상기 대퇴부부의 하단에 결합되는 무릎 관절부, 상기 무릎 관절부에 결합되며 상기 무릎 관절부의 풀리 모듈의 작동에 따라 일체로 동작되는 종아리부, 상기 종아리부의 하단에 결합되며, 피치축과 롤축을 기준으로 회동 가능하도록 마련되는 발 몸체부, 상기 발 몸체부의 타측에 결합되며 피치축을 기준으로 회동 가능하도록 마련되는 발가락부를 포함하며, 상기 종아리부, 발 몸체부 및 발가락부의 동작이 서로 연동되는 것을 특징으로 한다. 여기서, 상기 대퇴부부는 상기 종아리부, 발 몸체부 및 발가락부의 작동을 위한 무릎 구동기, 발목 구동부 및 발가락 구동기를 포함하고, 상기 무릎 관절부의 풀리 모듈은 상기 피치축을 기준으로 각각 독립적으로 회동 가 능하게 결합되는 무릎 풀리, 발목 풀리 및 발가락 풀리를 포함할 수 있다. 또한, 상기 종아리부는 상기 무릎 풀리에 고정 결합되어 일체로 회동되고, 상기 무릎 구동기와 상기 무릎 풀리는 벨트에 의해 연결되며, 상기 무릎 구동기의 출력이 상기 벨트를 통해 상 기 무릎 풀리로 전달되어 상기 무릎 풀리가 회전 작동됨으로써 상기 종아리부가 작동되는 것을 특징으로 한다. 또한, 상기 종아리부는 상기 무릎 풀리에 고정 결합되어 일체로 회동되는 종아리 프레임과, 상기 종아리 프레임 의 하단 영역에 결합되는 발목용 지지 링크와, 일측이 상기 발목 풀리에 연결되고 타측이 상기 발목용 지지 링 크에 연결되는 제1 발목 연결링크와, 일측이 상기 발목용 지지 링크에 연결되고 타측이 상기 발 몸체부의 일측 에 연결되는 제2 발목 연결링크를 포함하며, 상기 발목 구동부의 출력이 상기 발목 풀리, 제1 내지 제2 발목 연 결링크를 통해 상기 발 몸체에 전달됨으로써 상기 발 몸체를 구동시키는 출력으로 작용됨과 동시에, 상기 발목 풀리, 제1 발목 연결링크 및 발목용 지지 링크를 통해 상기 종아리부의 프레임에 전달됨으로써 상기 종아리부를작동시키는 출력으로 작용될 수 있다. 또한, 상기 발 몸체부가 피치축과 롤축을 기준으로 회동 가능하도록 상기 발목용 지지 링크와 상기 제1 발목 연 결링크는 레볼루트 조인트(Revolute Joint, RJ)로 연결되고, 상기 발목용 지지 링크와 상기 제2 발목 연결링크 는 볼 소켓 조인트(Ball Socket Joint, BJ)로 연결되며, 상기 제2 발목 연결링크와 상기 발 몸체부는 유니버셜 조인트(Universal Joint, UJ)로 연결될 수 있다. 또한, 상기 발목 구동부는 내측 발목 구동기 및 외측 발목 구동기를 포함하고, 상기 발목 풀리는 상기 내측 발 목 구동기 및 외측 발 발목 구동기와 각각 벨트를 통해 연결되는 내측 발목 풀리 및 외측 발목 풀리를 가지며, 상기 종아리부의 지지 링크, 제1 발목 연결링크 및 제2 발목 연결링크는 상기 내측 발목 풀리 및 외측 발목 풀 리에 대응되도록 각각 2개씩 마련되며, 상기 내측 발목 구동기 및 외측 발목 구동기와 각각 연결된 상기 내측 발목 풀리 및 외측 발목 풀리가 각각 독립적으로 회전 작동됨으로써 상기 발 몸체부가 내측 또는 외측을 향해 차동 구동될 수 있다. 또한, 상기 종아리부는 상기 종아리 프레임의 하단 영역에 결합되는 발가락용 지지 링크와, 일측이 상기 발가락 풀리에 연결되고 타측이 상기 발가락용 지지 링크에 연결되는 제1 발가락 연결링크와, 일측이 상기 발가락용 지 지 링크에 연결되고 타측이 상기 발몸체부의 일측을 향해 연장되는 제2 발가락 연결링크와, 상기 발 몸체에 회 동 가능하게 결합되되 일측이 상기 제2 발가락 연결 링크와 연결되는 제3 발가락 연결링크와, 일측이 상기 제3 발가락 연결 링크와 연결되고 타측이 상기 발가락부에 연결되는 제4 발가락 연결 링크를 포함하며, 상기 발가락 구동기의 출력이 상기 발가락 풀리, 제1 발가락 연결 링크, 발가락용 지지 링크, 제2 내지 제4 발가락 연결 링 크를 통해 상기 발가락부에 전달됨으로써 상기 발가락부를 작동시키는 출력으로 작용됨과 동시에, 상기 발가락 풀리, 제1 발가락 연결 링크, 제2 내지 3 발가락 연결 링크를 통해 상기 발 몸체부에 전달됨으로써 상기 발 몸 체부를 작동시키는 출력으로 작용됨과 동시에, 상기 발가락 풀리, 제1 발가락 연결 링크, 발가락용 지지 링크를 통해 상기 종아리 프레임에 전달됨으로써 상기 종아리 프레임을 작동시키는 출력으로 작용될 수 있다."}
{"patent_id": "10-2023-0042180", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의한 보행 가능 로봇의 고자유도 하지 구동 시스템에 의하면 무릎 관절, 발목 관절 및 발가락 관절을 가짐으로써 인간의 보행과 유사한 넓은 가동각 및 관절 자유도를 가질 수 있다. 또한, 복수 개의 풀리(pulley)가 벨트에 의해 각각 연결되고, 풀리와 복수 개의 링크가 연속적으로 연결되어 있 어, 각 구동기의 출력에 의해 발목 관절부가 차동 구동됨으로써 보행 안정성 및 보행 능력이 향상될 수 있다. 또한, 각 구동기의 출력이 무릎 관절부를 작동시키는 회전력으로 작용함과 동시에 발목 관절부 및 발가락 관절 부의 작동을 위한 회전력으로 작동됨으로써 각 관절부가 연동 구동되므로 보행 안정성 향상, 소모 에너지 절감, 보행 능력이 향상될 수 있다. 또한, 구동을 위한 각 구동기가 모두 대퇴부부 프레임 내부에 배치되어 하지 구동 시스템의 경량화 및 충격 내 구성이 향상될 수 있다."}
{"patent_id": "10-2023-0042180", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명에 관한 설명은 구조적 내지 기능적 설명을 위한 실시예에 불과하므로, 본 발명의 권리범위는 본문에 설 명된 실시예에 의하여 제한되는 것으로 해석되어서는 아니 된다. 즉, 실시예는 다양한 변경이 가능하고 여러 가 지 형태를 가질 수 있으므로 본 발명의 권리범위는 기술적 사상을 실현할 수 있는 균등물들을 포함하는 것으로이해되어야 한다. 또한, 본 발명에서 제시된 목적 또는 효과는 특정 실시예가 이를 전부 포함하여야 한다거나 그러한 효과만을 포함하여야 한다는 의미는 아니므로, 본 발명의 권리범위는 이에 의하여 제한되는 것으로 이해 되어서는 아니 될 것이다. 한편, 본 출원에서 서술되는 용어의 의미는 다음과 같이 이해되어야 할 것이다. \"제1\", \"제2\" 등의 용어는 하나의 구성요소를 다른 구성요소로부터 구별하기 위한 것으로, 이들 용어들에 의해 권리범위가 한정되어서는 아니 된다. 예를 들어, 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제2 구성요소로 명명될 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한 복수의 표현을 포함하는 것으로 이해되어야 하고, \"포함 하다\" 또는 \" 가지다\" 등의 용어는 실시된 특징, 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것이 존재함을 지정하려는 것이며, 하나 또는 그 이상의 다른 특징이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이 들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 여기서 사용되는 모든 용어들은 다르게 정의되지 않는 한, 본 발명이 속하는 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가진다. 일반적으로 사용되는 사전에 정의되어 있는 용어들은 관 련 기술의 문맥상 가지는 의미와 일치하는 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한 이 상적이거나 과도하게 형식적인 의미를 지니는 것으로 해석될 수 없다. 또한, 본 발명에서 정의하는 시스템이란 프로세서, 메모리에 의해 수행되고 메모리에 저장되는 소프트웨어 및 하드웨를 포함하여 구성될 수 있다. 본 발명은 향상된 보행 성능을 위해 각 관절부에 자유도를 제공하고, 무릎 관절부, 발목 관절부 및 발가락 관절 부가 서로 연동 구동됨으로써 보행 안정성 및 보행 성능을 극대화한 보행 가능 로봇의 고자유도 하지 구동 시스 템에 관한 것이다. 이를 위해 본 발명의 실시예에 따른 보행 가능 로봇의 고자유도 하지 구동 시스템은 구동기에서 발생되는 출력 에 의한 작동이 서로 연동되도록 구성되어 있으며, 이하 도 1 내지 도 8를 참고하여 본 발명의 보행 가능 로봇 의 고자유도 하지 구동 시스템의 각각의 구성 및 연동되는 구성에 관하여 설명한다. 각 구성 및 연동 구동에 대한 설명 및 이해의 용이성을 위하여 우선, 전체 구성 및 각각의 구성에 관하여 설명 한 후 다음으로 어떻게 출력 또는 작동이 연동되는지에 관하여 순서대로 설명하도록 한다. 도 1은 본 발명의 일 실시예에 따른 보행 가능 로봇의 고자유도 하지 구동 시스템의 사시도이다. 도 1에 도시된 바와 같이 본 발명의 일 실시예에 따른 보행 가능 로봇의 고자유도 하지 구동 시스템은 고관절부 , 대퇴부부, 무릎 관절부, 종아리부, 발 몸체부, 발가락부를 포함한다. 고관절부는 로봇의 몸체와 결합되는 구성으로, 본 발명에 따른 보행가능 로봇의 고자유도 하지 구동 시스 템이 적용되는 객체가 본 인간과 유사한 형태를 가진 로봇 종류라면 허리 영역 하측에 결합되는 구성이다. 이러한 고관절부는 본 발명에 따른 보행 가능 로봇의 고자유도 하지 구동 시스템을 다른 객체, 예를 들면 다른 어떠한 로봇의 상체부,와 연결시키는 구성이며, 도 3에 도시된 바와 같이, 요축, 피치축, 롤축을 기준으로 움직임(회동)이 가능하도록 구성된다. 좀 더 자세하게는, 도 2에 도시된 바와 같이, 고관절부는 요축 방향의 회전 관절, 피치축 방향의 회전 관 절, 롤축 방향의 회전 관절을 포함하여 3 자유도(Degree Of Freedom, DOF)를 가진다. 여기서, 도 2을 참조하여 무릎 관절부, 발 몸체부 및 발가락부의 움직임에 대한 자유도를 먼저 설명하자면, 무릎 관절부는 피치축을 기준으로 회동될 수 있도록 1 자유도를 가지며, 발 몸체부는 피 치축 및 롤축을 기준으로 회동될 수 있도록 2 자유도를 가지며, 발가락부는 피치축을 기준으로 회동될 수 있도록 1 자유도를 가진다. 한편, 이러한 각각의 회동은 개별적으로 이루어질 수 있으며, 이에 대한 상세한 회동 가동 범위는 표 1과 같다. 표 1 Joint Range of Motion(deg) Hip yaw -45 ~ 90 Hip roll -120 ~ 60Hip pitch -45 ~ 45 Knee pitch 0 ~ 150 Ankle pitch -50 ~ 50 Ankle roll -30 ~ 30 Toe pitch -60 ~ 20 대퇴부부는, 도 1 내지 도 3b에 도시된 바와 같이, 고관절부부 하측에 연결 고정되어 고관절부 의 회동에 따라 일체로 움직임이 가능하도록 마련된다. 대퇴부부는, 도 3a에 도시된 바와 같이, 무릎 관절부의 작동을 위한 무릎 구동기, 발 몸체부 의 작동을 위한 발목 구동부 및 발가락부의 작동을 위한 발가락 구동기를 포함하며, 발목 구동부는 발 몸체부의 롤축 기준 회동 작동을 제어하기 위한 내측 발목 구동기와 외측 발목 구 동기를 포함한다. 여기서, 내측 발목 구동기와 외측 발목 구동기는, 도 3b 및 도 3c에 도시된 바와 같이, 발가락 구동 기를 사이에 두고 서로 소정 간격을 두고 대칭으로 위치할 수 있으며, 따라서 후술하겠지만, 발가락 구동 기와 연결되는 링크를 기준으로 내측 발목 구동기 및 외측 발목 구동기와 각각 연결되는 링크가 내측 및 외측에서 각각 구동됨으로써 발 몸체부가 롤축을 기준으로 회동될 수 있다. 대퇴부부의 무릎 구동기, 내측 발목 구동기, 외측 발목 구동기, 발가락 구동기는 무 릎 관절부로 동력을 전달할 수 있는데, 무릎 관절부로 동력을 전달하는 구성의 제1 실시예로서 각각 벨트를 통해 후술할 무릎 관절부의 풀리 모듈로 동력을 전달할 수 있으며, 이때 대퇴부부는, 도 3a 내지 도 3c에 도시된 바와 같이, 각 벨트의 텐션 조절을 위한 복수 개의 풀리를 포함할 수 있다. 참고 로, 상기 풀리는 아이들링 풀리(idling pulley)일 수 있다. 한편, 이에 한정되지 않고, 도시되지는 않았지만, 무릎 관절부로 동력을 전달하는 구성은, 제2 실시예로서, 벨트 및 풀리가 아닌, 다른 수단, 예를 들면 링크를 통해 상기 각각의 구동기에서 상기 무릎 관절 부로 각각 동력을 전달할 수도 있다. 여기서, 설명의 용이함을 위해 상기 무릎 관절부로 동력을 전달하는 구성의 제1 실시예를 기준으로 설명하면, 무릎 관절부는 대퇴부부 하단에 결합되고, 피치축을 기준으로 회동 가능하도록 마련되는 풀리 모듈 을 포함할 수 있다. 상기 풀리 모듈은, 도 3b 및 도 3c에 도시된 바와 같이, 각각 독립적으로 회동 가능하게 결합되는 무릎 풀 리, 발목 풀리, 발가락 풀리를 포함하는데, 여기서 발목 풀리는 내측 발목 풀리와 외 측 발목 풀리를 포함한다. 무릎 풀리는 무릎 구동기와 벨트 연결되어 무릎 구동기의 출력에 의해 작동되고, 내측 발목 풀 리는 내측 발목 구동기와 벨트 연결되어 내측 발목 구동기의 출력에 의해 작동되며, 외측 발목 풀리는 외측 발목 구동기와 벨트 연결되어 외측 발목 구동기의 출력에 의해 작동된다. 또한, 발가락 풀리는 발가락 구동기와 벨트 연결되어 발가락 구동기의 출력에 의해 작동된다. 종아리부는 무릎 풀리에 고정 결합되며, 상기 무릎 풀리의 회동에 따라 일체로 회동되는데, 이 를 위해서 종아리부는, 도 4a에 도시된 바와 같이, 무릎 풀리에 고정 결합되어 일체로 회동하는 종아 리 프레임을 포함한다. 따라서, 무릎 구동기에서 발생되는 출력은 벨트를 통해 무릎 풀리로 전달되며, 이러한 무릎 풀리 가 회전될 때 종아리부가 일체로 회동됨으로써 상기 종아리부가 동작될 수 있다. 한편, 종아리부는, 도 4a에 도시된 바와 같이, 상기 종아리 프레임 하단 영역에 결합되는 발목용 지 지 링크와, 일측이 상기 발목 풀리와 연결되고 타측이 상기 발목용 지지 링크에 연결되는 제1 발목 연결링크와, 일측이 상기 발목용 지지 링크에 연결되고 타측이 상기 발 몸체부의 일측에 연결되는 제2 발목 연결링크을 포함한다. 이러한 구성은 발 몸체부를 피치축을 기준으로 회동 작동시키기 위한 구성으로, 이를 간략하게 표현하면 도 4b와 같다.따라서, 도 4b를 참조하여 출력 전달 경로를 설명하면, 발목 구동부에서 발생되는 출력은 벨트를 통해 발 목 풀리으로 전달되고, 발목 풀리가 회전함에 따라 상기 출력은 순서대로 제1 발목 연결 링크, 지지 링크, 제2 발목 연결링크을 통해 발 몸체부로 전달된다. 따라서, 제1 실시예로서, 도 7에 도시된 바와 같이, 발목 구동부가 일방향으로 구동되면 도 7에 도시된 화 살표와 같이 제1 발목 연결 링크, 지지 링크, 제2 발목 연결링크 및 발 몸체부로 순서대로 출력이 전달되면서 각 구성이 작동된다. 한편, 상기 출력은 지지 링크를 통해 종아리 프레임에도 동시에 전달되며, 따라서, 발목 구동을 위한 출력이 종아리부에도 전달됨으로써 발 몸체부 및 종아리부에 인가되는 출력이 연동될 수 있으며, 따라서 동작 또한 연동된다. 한편, 다른 실시예로서, 도시되지는 않았지만 상기의 구성을 단순화시켜 구성할 수도 있다. 이를 설명하면, 상 기 종아리부는 상기 무릎 풀리와 일체로 회동될 수 있도록 고정 결합되며, 상기 무릎 구동기의 출력이 상기 벨트를 통해 상기 무릎 풀리로 전달되어 상기 무릎 풀리가 회전 작동됨으로써 상기 종아 리부가 작동되도록 할 수도 있다. 이러한 구성은 전술한 제1 실시예에서 지지링크를 없애고, 제1 발목 연결 링크와 제2 발목 연결링크 를 통합 발목 연결 링크(미도시)라는 하나의 링크로 구성하도록 한 것이며, 이렇게 간단하게 구성하는 것 도 가능하다. 한편, 전수한 제1 실시예에서의 구성을 좀 더 자세히 설명하면, 도 4b에 도시된 각 구성은 후술할 발가락부 를 작동시키기 위한 링크 구조를 가운데 두고 양쪽으로, 즉 내측 및 외측에 각각 하나씩 두 개가 마련될 수 있다. 즉, 하나의 종아리부에 도 4b에 도시된 각 구성이 2개가 배치되며, 사람처럼 두 발로 서서 이동할 수 있도 록 본 발명에 따른 보행 가능 로봇의 고자유도 하지 구동 시스템이 2개가 마련되는 경우에 설명의 편의상, 서로 인접하는 위치에 배치되는 쪽을 내측, 그 반대 방향에 배치되는 쪽을 외측으로 구분하였다. 따라서, 엄밀하게 얘기하자면, 도 4c에 도시된 바와 같이, 후술할 발가락부를 작동시키기 위한 발가락 구 동기, 발가락 풀리 및 후술할 링크 구조를 사이에 두고, 내측에는 순서대로 내측 발목 구동기, 내측 발목 풀리, 내측에 배치되는 제1 발목 연결 링크, 지지 링크, 제2 발목 연결링크가 배치되고, 외측에는 순서대로 외측 발목 구동기, 외측 발목 풀리, 외측에 배치되는 제1 발목 연결 링 크(430'), 지지 링크(420'), 제2 발목 연결링크(440')가 배치되는 것이다. 따라서, 발 몸체부는 이러한 구성에 의하여 피치축을 기준으로 회동 작동이 가능한데, 이때 상기 구조가 발 몸체부의 양쪽에 각각 연결되어 있기 때문에 실질적으로 전술한 피치축만을 기준으로 회동 작동하려면 내측 발목 구동기와 외측 발목 구동기가 동기화되어 함께 위치 제어가 되어야만 한다. 한편, 발 몸체부가, 도 4d에 도시된 바와 같이, 바닥면에 안정적으로 지지되어야 하는 경우 롤축을 기준으 로 회동될 필요가 있을 경우도 있다. 이 경우에 내측 발목 구동기와 외측 발목 구동기가 각각 다르게 구동될 수 있으며, 따라서, 도 4e에 도시된 바와 같이, 발 몸체부가 외측으로 기울어질 필요가 있는 경우 내측에 배치되는 링크 구조는 하방으로 이동하고, 외측에 배치되는 링크 구조는 방방으로 이동하도록 내측 발목 구동기와 외측 발목 구동기를 구동시키면 된다. 이와 반대의 경우에는, 도시되지는 않았지만, 반대로 내측 발목 구동기와 외측 발목 구동기를 구동시 킴으로써 발 몸체부가 내측으로 기울어지도록 할 수도 있다. 따라서, 내측 발목 구동기 및 외측 발목 구동기와 각각 연결된 상기 내측 발목 풀리 및 외측 발 목 풀리가 각각 독립적으로 회전 작동됨으로써 발 몸체부가 내측 또는 외측을 향해 차동 구동될 수 있다. 한편, 이때 발 몸체부로 출력을 전달하고, 발 몸체부가 피치축 및 롤축을 기준을 기준으로 모두 회동 작동이 가능하도록 각 연결부는 회전이 가능한 구조의 조인트로 연결될 수 있다. 조인트에 대한 일 실시예로서, 발목용 지지 링크와 상기 제1 발목 연결 링크는 레볼루트 조인트로 연 결되고, 상기 발목용 지지 링크와 상기 제2 발목 연결링크은 볼 소켓 조인트로 연결되고, 상기 제2 발목 연결링크와 상기 발 몸체부는 유니버셜 조인트로 연결될 수 있다.한편, 종아리부는, 제2 실시예로서, 도 4a에 도시된 바와 같이, 상기 종아리 프레임 하단 영역에 결 합되는 발가락용 지지 링크와, 일측이 발가락 풀리에 연결되고 타측이 발가락용 지지 링크에 연 결되는 제1 발가락 연결링크와, 일측이 발가락용 지지 링크에 연결되고 타측이 상기 발 몸체부 의 일측을 향해 연장되는 제2 발가락 연결링크와, 상기 발 몸체부에 회동 가능하게 결합되되 일측이 제2 발가락 연결 링크와 연결되는 제3 발가락 연결링크와, 일측이 제3 발가락 연결 링크와 연결 되고 타측이 발가락부에 연결되는 제4 발가락 연결 링크를 포함할 수 있다. 이러한 구성은 발가락부를 피치축을 기준으로 회동 작동시키기 위한 구성으로, 이를 간략하게 표현하면 도 5a 및 도 5b와 같다. 따라서, 도 5a를 참조하여 출력 전달 경로를 설명하면, 발가락 구동기에서 발생되는 출력은 벨트를 통해 발가락 풀리으로 전달되고, 발가락 풀리가 회전함에 따라 상기 출력은 순서대로 발가락 풀리, 제1 발가락 연결 링크, 발가락용 지지 링크, 제2 발가락 연결 링크, 제3 발가락 연결 링크 , 제4 발가락 연결 링크를 통해 상기 발가락부에 전달됨으로써 발가락부를 작동시키는 출력으로 작용된다. 이를 도면을 참조하여 설명하면, 도 8에 도시된 바와 같이, 발가락 구동기가 일 방향으로 작동되면, 도시 된 화살표와 같이 각 구성이 작동되면서 발가락부가 동작된다. 동시에, 제3 발가락 연결 링크가 발 몸체부에도 연결되어 있기 때문에, 상기 출력은 순서대로 발가락 풀리, 제1 발가락 연결 링크, 발가락용 지지 링크, 제2 발가락 연결 링크, 제3 발가락 연 결 링크를 통해 발 몸체부를 작동시키는 출력으로도 작용된다. 이와 동시에, 발가락용 지지 링크가 종아리 프레임에 연결되어 있기 때문에, 상기 출력은 순서대로 발가락 풀리, 제1 발가락 연결 링크, 발가락용 지지 링크를 통해 상기 종아리 프레임에 전 달됨으로써 종아리 프레임을 작동시키는 출력으로도 작용된다. 한편, 발가락 구동기의 발생되는 출력이 발가락부만을 작동시키는 것이 아니라, 상기 구성을 통해 발 몸체부와 종아리 프레임에도 동시에 전달됨으로써 출력이 연동될 수 있으며, 따라서 동작 또한 연동 된다. 한편, 이러한 발가락부 연동과 관련된 다른 실시예로서, 상기 종아리부는 일측이 상기 발가락 풀리 에 연결되고 타측이 상기 발 몸체부의 일측을 향해 연장되는 통합 발가락 연결링크와, 상기 발 몸체 부에 회동 가능하게 결합되되 일측이 상기 발가락 연결 링크와 연결되는 제3 발가락 연결링크와, 일 측이 상기 제3 발가락 연결 링크와 연결되고 타측이 상기 발가락부에 연결되는 제4 발가락 연결 링크 를 포함하도록 구성될 수도 있다. 이러한 구성은 전술한 제2 실시예에서 지지링크를 없애고, 제1 발가락 연결 링크와 제2 발가락 연결 링크를 통합 발가락 연결 링크(미도시)라는 하나의 링크로 구성하도록 한 것이며, 이렇게 간단하게 구성하 는 것도 가능하다. 한편, 제2 실시예에서, 출력을 전달하기 위한 링크 구조를 형성하기 위하여 여러가지 조인트가 적용될 수 있는 데, 일 예로서, 발가락용 지지 링크와 제1 발가락 연결링크는 레볼루트 조인트로 연결되고, 상기 발 가락용 지지 링크와 제2 발가락 연결 링크는 볼 소켓 조인트로 연결되며, 제2 발가락 연결 링크(47 0)와 제3 발가락 연결 링크는 유니버셜 조인트로 연결되고, 일측이 발 본체부와 연결되고 타측이 발 가락 연결 링크는 제3 발가락 연결 링크 및 일측이 발가락부와 연결되고 타측이 제3 발가락 연 결 링크와 연결되는 제4 발가락 연결 링크는 각각 레볼루트 조인트로 연결될 수 있다. 발 몸체부는 피치과 롤축을 기준으로 회동 가능하도록 상기 종아리부 하단에 결합되며, 전술한 바와 같이, 발목 구동부에 의해 작동된다. 발가락부는 발 몸체부의 타측에 피치축을 기준으로 회동 가능하도록 결합되며, 전술한 바와 같이, 발 가락 구동기에 의해 작동된다. 이상으로 본 발명에 따른 보행 가능 로봇의 고자유도 하지 구동 시스템의 각 구성에 관하여 설명하였으며, 이하 도 6을 참조하여 보행 작동시 어떻게 출력이 연동되는지에 관하여 설명한다. 또한, 도 6은 보행주기에 따라 발생하는 힘의 방향과 관절의 토크 방향을 간략화하고, 보행 단계 에 따른 무릎 관절부 및 발 몸체부, 발가락부에서 발생하는 힘의 방향에 대해서 설명하고 있다. 보행주기는 입각기(stance phase)와 유각기(swing phase)의 2단계로 구분되며, 유각기 단계에서 입각기 단계로 진행될 때 뒷축딛기(heel contact)에서 무릎 관절부는 굽혀지고 발 몸체부는 지면을 딛는 방향으로 동작하게 되며, 입각기 단계에서 유각기 단계로 진행될 때 발가락 떼기(toe off)단계에서 무릎 관절부은 펴지고 발 몸체부와 발가락부는 지면을 딛는 방향으로 동작하게 된다. 일반적으로 인간이 보행 할 때에 보행 주기에 따라 관절의 동작 방향은 변하지만, 로봇의 보행할 때에는 동작 방향과는 관계없이 체중을 지지하고 지면을 차는 방향으로 큰 힘이 필요하다. 더욱 구체적으로, 뒷축딛기 단계에서 발목부가 지면과 반대방향으로 토크를 발생시키나, 뒷축딛기를 제외한 입 각기 단계에서 무릎 관절부은 펴지고 발 몸체부 및 발가락부은 지면을 딛는 방향으로 힘을 발생 시켜 보행하게 된다. 따라서, 본 발명에서 제안하는 메커니즘은 지면을 밀어내는 방향으로 힘을 출력하는데 적합한 구조를 나타내고 있으므로, 인간의 보행과 유사한 형태로 보행에 적합한 관절 구조를 나타내는 것으로 구현될 수 있다. 이상으로 본 발명에 따른 보행 가능 로봇의 고자유도 하지 구동 시스템에 관하여 설명하였으며, 사용자는 이러 한 하지 구동 시스템을 로봇에 적용함으로써 무릎 관절, 발목 관절 및 발가락 관절을 가짐으로써 인간의 보행과 유사한 넓은 가동각 및 관절 자유도를 가지는 보행 가능 로봇의 고자유도 하지 구동 시스템을 구현할 수 있다. 또한, 각 구동기의 출력이 무릎 관절부를 작동시키는 회전력으로 작용함과 동시에 발몸체부 및 발가 락부의 작동을 위한 회전력으로 작동되어 연동 구동됨으로 보행 안정성 향상, 소모 에너지 절감, 보행 능 력이 향상된 보행 가능 로봇의 고자유도 하지 구동 시스템을 구현할 수 있다. 또한, 구동을 위한 각 구동기가 모두 대퇴부부 프레임 내부에 배치되어 하지 구동 시스템의 경량화 및 충 격 내구성이 향상된 보행 가능 로봇의 고자유도 하지 구동 시스템을 구현할 수 있다. 이상으로 본 발명에 따른 보행 가능 로봇의 고자유도 하지 구동 시스템에 관하여 설명하였으며, 앞서 설명한 본 발명의 설명에서는 본 발명의 바람직한 실시예들을 참조하여 설명하였지만, 해당 기술 분야의 숙련된 당업자 또 는 해당 기술 분야에 통상의 지식을 갖는 자라면 본 발명의 특허청구범위에 기재된 본 발명의 사상 및 기술영역 으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수정 및 변경시킬 수 있음을 이해할 수 있을 것이다."}
{"patent_id": "10-2023-0042180", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 보행 가능 로봇의 고자유도 하지 구동 시스템의 사시도이다. 도2는 도 1에 도시된 보행 가능 로봇의 고자유도 하지 구동 시스템의 자유도 회전축을 설명하기 위한 도면이다. 도 3a 내지 도 5b는 도 1에 도시된 보행 가능 로봇의 고자유도 하지 구동 시스템의 구조를 설명하기 위한 도면 이다. 도 6은 보행주기에 따라 발생하는 힘의 방향과 관절의 토크 방향을 간략화한 도면이다. 도 7 내지 도 8은 도 1에 도시된 보행 가능 로봇의 고자유도 하지 구동 시스템의 작동 연동을 설명하기 위한 도 면이다."}
