{"patent_id": "10-2021-0157267", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0071265", "출원번호": "10-2021-0157267", "발명의 명칭": "역사정보와 연계된 도서 추천 시스템", "출원인": "최종천", "발명자": "최종천"}}
{"patent_id": "10-2021-0157267", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "역사정보와 연관된 도서를 추천하는 방법에 있어서,상기 역사정보와 연관된 도서 추천 방법은,상기 역사정보와 연관된 도서 추천 요청을 수신하면,추상적인 개념으로 나타나는 역사적 문맥정보로부터 단어를 추출하여 역사적으로 연관된 인물정보를 구체화하는단계;국가 전거데이터베이스로부터 구체화된 상기 인물정보를 추출하는 단계;상기 인물정보로부터 인물의 출생연도와 사망연도에 대응하는 생몰년 정보를 추출하는 단계;상기 생몰년 정보에 기초하여 과거에 발생한 일련의 다수의 역사정보를 추출하는 단계;상기 일련의 다수의 역사정보에 기초하여 연관된 다수의 다른 역사정보를 추출하는 단계;상기 생몰년 정보를 가진 인물과 다수의 다른 생몰년 정보를 가진 인물을 추천인물로 결정하는 단계; 및상기 국가 전거데이터베이스로부터 역사정보 타임라인 유사도를 기준으로 상기 추천인물과 연관된 도서를 추천하는 단계;를포함하는 것을 특징으로 하는,역사정보와 연관된 도서를 추천하는 방법."}
{"patent_id": "10-2021-0157267", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 역사적으로 연관된 인물정보를 구체화하는 단계는,상기 역사적 문맥정보에 포함된 단어 사이의 거리(유사도)를 기 설정된 알고리즘을 통해 측정하는 단계;상기 역사적 문맥정보에 포함된 단어 사이의 거리(유사도)에 기초하여,상기 단어에 대한 단어 가중치를 부여하는 단계;상기 단어 가중치를 기초하여, 상기 역사적으로 연관된 인물정보를 리스팅(listing)하는 단계; 및리스팅된 상기 역사적으로 연관된 인물정보 중에서 상기 단어 가중치가 높은 순으로 정렬되되 설정된 개수만큼상기 역사적으로 연관된 인물정보를 추출하는 단계;를포함하는 것을 특징으로 하는,역사정보와 연관된 도서를 추천하는 방법."}
{"patent_id": "10-2021-0157267", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서,상기 역사적 문맥정보에 단어 가중치를 부여하는 단계는,상기 단어 사이의 거리가 가까운(의미가 유사한) 단어가 상기 역사적 문맥정보에 포함되어 있으면 높은 가중치(0.6~1)를 부여하고,그렇지 않으면 상기 역사적 문맥정보에 낮은 가중치(0~0.5)를 부여하는 것을 특징으로 하는,공개특허 10-2023-0071265-3-역사정보와 연관된 도서를 추천하는 방법."}
{"patent_id": "10-2021-0157267", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서,상기 추천도서에 대한 정보를 제공하는 단계는,상기 추천인물의 생몰년에 기반하되,상기 추천인물에 대한 일화와 역할에 대응하는 해설을 도출하여 제공하는 것을 특징으로 하는,국가 전거데이터베이스를 활용한 역사정보와 연계된 도서 추천 서비스를 제공하는 방법."}
{"patent_id": "10-2021-0157267", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "역사정보와 연관된 도서를 추천하는 시스템에 있어서,상기 역사정보와 연관된 도서를 추천하는 시스템은,상기 역사정보와 연관된 도서 추천 요청을 수신하는 수신부;추상적인 개념으로 나타나는 역사적 문맥정보로부터 단어를 추출하여 역사적으로 연관된 인물정보를 추출하는인물정보 추출부;상기 인물정보를 기초하여, 상기 인물정보에 대한 생몰년 정보를 추출하는 생몰년 정보 추출부;상기 생몰년 정보에 기초하여, 상기 역사정보와 연관된 다른 역사정보를 추출하는 역사정보 추출부;상기 역사정보 및/또는 상기 다른 역사정보에 기초하여, 다수의 생몰년 정보를 가진 다수의 인물을 추천인물로결정하는 추천인물 결정부; 및상기 추천인물에 기초하여, 추천인물과 연관된 도서를 추천하는 도서추천부;를포함하는 것을 특징으로 하는,역사정보와 연관된 도서를 추천하는 시스템."}
{"patent_id": "10-2021-0157267", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시예는 역사정보와 연계된 도서 추천 서비스 시스템 및 이를 이용한 역사정보와 연계된 도서 추 천 서비스 추천 방법에 관한 것으로, 더욱 상세하게는 공공데이터를 기반으로 역사 속 인물, 사건, 지명과 연관 성을 인공지능기술로 분석하여 온톨로지를 구성하여 교사, 학생, 학부모, 독서지도자와 같은 역사 학습과 연관된 사람들은 물론 일반인을 대상으로 역사정보과 연계된 도서 추천 서비스 및 이를 이용한 역사정보와 연계된 도서 추천 시스템에 관한 것이다."}
{"patent_id": "10-2021-0157267", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 역사정보와 연계된 도서 추천 서비스 시스템 및 이를 이용한 역사정보와 연계된 도서 추천 서비스 추 천 방법에 관한 것으로, 더욱 상세하게는 공공데이터를 기반으로 역사 속 인물, 사건, 지명과 연관성을 인공지 능기술로 분석하여 온톨로지를 구성하여 교사, 학생, 학부모, 독서지도자와 같은 역사 학습과 연관된 사람들은 물론 일반인을 대상으로 역사정보과 연계된 도서 추천 서비스 시스템에 관한 것이다."}
{"patent_id": "10-2021-0157267", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "2012년 정부는 정부3.0을 발표하며 정부가 보유하고 구축한 정보를 적극적으로 개방하고 공유하고 있으나, 실제 로 공공데이터 활용 분야를 살펴보면 안전한 사회, 국민의 생활, 경제 활성화, 스마트 행정 위주로 전개되고 있 고, 도서, 공연, 전시, 축제, 영화 등 문화예술 및 산업분야의 문화와 관련된 공공데이터는 문화, 예술 관련 최 신 공연 소식, 동영상 등 단순 역사적 사료만 제공하고 있는 실정이다. 선행기술문헌 특허문헌 (특허문헌 0001) 등록특허 제10-2187053호"}
{"patent_id": "10-2021-0157267", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "발명의 내용"}
{"patent_id": "10-2021-0157267", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점을 해결하기 위하여 고안된 것으로서, 추상적인 개념으로 나타나는 역사적 문맥정 보로부터 단어를 추출하여 역사적으로 연관된 인물정보를 구체화하여 국가 전거데이터베이스로부터 구체화된 인 물정보를 추출하고 추출된 인물정보로부터 인물의 출생연도와 사망연도에 대응하는 생몰년 정보를 추출하여 추 출된 생몰년 정보에 기초하여 과거에 발생한 일련의 다 수 역사정보를 추출하고 일련의 다수의 역사정보에 기초 하여 연관된 다 수의 다른 역사정보를 추출하여 생몰년 정보를 가진 인물과 다 수의 다른 생몰년 정보를 가진 인물을 추천인물로 결정하되 역사정보 타임라인 유사도를 기준으로 역사정보와 연계된 도서 추천 서비스 시스템 및 이를 이용한 역사정보와 연계된 도서 추천 서비스 추천 방법을 제공하는 것이다. 본 발명이 이루고자 하는 기술적 과제는 이상에서 언급한 기술적 과제로 제한되지 않으며, 언급되지 않은 또 다 른 기술적 과제들은 아래의 기재로부터 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0157267", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 기술적 과제를 달성하기 위하여, 본 발명의 일실시예는 역사정보와 연관된 도서를 추천하는 시스템에 있어 서, 상기 역사정보와 연관된 도서를 추천하는 시스템은, 역사정보와 연관된 도서 추천 요청을 수신하는 수신부; 추상적인 개념으로 나타나는 역사적 문맥정보로부터 단어를 추출하여 역사적으로 연관된 인물정보를 추출하는 인물정부 추출부; 상기 인물정보를 기초하여, 상기 인물정보에 대한 생몰년 정보를 추출하는 생몰년 정보 추출 부; 상기 생몰년 정보에 기초하여, 상기 역사정보와 연관된 다른 역사정보를 추출하는 역사정보 추출부; 사기 역사정보 및/또는 상기 다른 역사정보에 기초하여, 다수의 생몰년 정보를 가진 다수의 인물을 추천인물로 결정 하는 추천인물 결정부; 및 상기 추천인물에 기초하여 추천인물과 연관된 도서를 추천하는 도서추천부;를 포함할 수 있다. 상기 기술적 과제를 달성하기 위하여, 본 발명의 다른 실시예에 따른 시스템은 도서 정보를 제공하기 위한 도서 정보 제공 서버에 있어서, 도서 정보 제공 방법을 수행하기 위한 프로그램이 기록된 메모리; 및 상기 프로그램 을 실행하기 위한 프로세서를 포함하며, 상기 프로세스는, 상기 프로그램의 실행에 의해, 역사와 연관된 도서별 역사 이미지를 수집하고, 상기 수집된 역사 이미지에 기반하여 각 도서의 도서 식별 정보를 설정하여 데이터베 이스에 저장하고, 각 도서의 내용에 대한 복합현실 콘텐츠, 홍보 영상, 공연 영상, 리뷰 정보, 도서관 대출 정 보 중 어느 하나 이상의 도서 정보를 상기 도서 식별 정보와 매칭하여 상기 데이터베이스에 저장하며, 카메라가 구비된 사용자 단말과 연동하여 도서 정보를 제공하기 위한 어플리케이션을 제공하고, 상기 사용자 단말에 의해 상기 어플리케이션이 실행됨에 따라 도서의 역사 이미지 정보가 획득되면, 상기 도서의 역사 이미지 정보에 기 반하여 도서 식별 정보를 추출하고, 상기 데이터베이스에서 상기 추출된 도서 식별 정보와 매칭되는 도서 정보 를 추출하여 상기 사용자 단말에 제공하는 서버;를 포함할 수 있다."}
{"patent_id": "10-2021-0157267", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따르면, 본 발명의 역사정보와 연계된 도서 추천 서비스 시스템 및 이를 이용한 역사정보와 연계된 도서 추천 서비스 추천 방법은 역사와 연관된 인물의 생몰년 정보를 이용하여 해당 역사와 연관된 인물 의 생몰년 을 포함하는 다른 역사 정보를 확인할 수 있고, 다른 역사정보에 해당하는 생몰년 을 가진 인물의 도 서에 대한 정보를 제공하여 하나의 역사적 사건, 주장 및 문제에 해당하는 도서를 서로 다른 시각에서 교차검증 하는 것에 장점이 있다."}
{"patent_id": "10-2021-0157267", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과는 상기한 효과로 한정되는 것은 아니며, 본 발명의 설명 또는 청구범위에 기재된 발명의 구성으 로부터 추론 가능한 모든 효과를 포함하는 것으로 이해되어야 한다."}
{"patent_id": "10-2021-0157267", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 첨부한 도면을 참조하여 본 발명을 설명하기로 한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며, 따라서 여기에서 설명하는 실시예로 한정되는 것은 아니다. 그리고 도면에서 본 발명을 명확 하게 설명하기 위해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유 사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결(접속, 접촉, 결합)\"되어 있다고 할 때, 이는 \"직접적으로 연 결\"되어 있는 경우뿐 아니라, 그 중간에 다른 부재를 사이에 두고 \"간접적으로 연결\"되어 있는 경우도 포함한다. 또한 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 구비할 수 있다는 것을 의미한다. 본 명세서에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도 가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 명세서에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들 을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요 소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 이하 첨부된 도면을 참고하여 본 발명의 실시예를 상세히 설명하기로 한다. 도 1은 본 발명의 일 실시예에 따른 역사정보와 연관된 도서를 추천하는 시스템의 전체적인 구성을 나타내 는 구성도이다. 도 1을 참조하면 본 발명에 따른 역사정보와 연관된 도서를 추천하는 시스템은 사용자 단말기, 네트 워크을 통해 연결된 서버(또는 인공지능 서버);를 포함하고, 필요시 서버에 연결되고 여러가지 공공데이터로부터 수집된 데이터가 저장되어 있는 데이터베이스을 포함할 수 있다. 이때, 상기 서버 는 , 도서 정보 제공 방법을 수행하기 위한 프로그램이 기록된 메모리(미도시); 및 상기 프로그램을 실행하기 위한 프로세서(미도시)를 포함하며, 상기 프로세스는, 상기 프로그램의 실행에 의해, 역사와 연관된 도서별 역 사 이미지를 수집하고, 상기 수집된 역사 이미지에 기반하여 각 도서의 도서 식별 정보를 설정하여 데이터베이 스에 저장하고, 각 도서의 내용에 대한 복합현실 콘텐츠, 홍보 영상, 공연 영상, 리뷰 정보, 도서관 대출 정보 중 어느 하나 이상의 도서 정보를 상기 도서 식별 정보와 매칭하여 상기 데이터베이스에 저장하며, 카메라가 구비된 사용자 단말과 연동하여 도서 정보를 제공하기 위한 어플리케이션을 제공하고, 상기 사용자 단 말에 의해 상기 어플리케이션이 실행됨에 따라 도서의 역사 이미지 정보가 획득되면, 상기 도서의 역사 이미지 정보에 기반하여 도서 식별 정보를 추출하고, 상기 데이터베이스에서 상기 추출된 도서 식별 정보와 매칭되는 도서 정보를 추출하여 상기 사용자 단말에 제공하는 역할을 할 수 있다. 도 2는 본 발명의 일 실시예에 따른 역사정보와 연관된 도서를 추천하는 시스템을 기능별로 나타낸 기능 블록도 이다. 도 2를 참조하면, 발명에 따른 역사정보와 연관된 도서를 추천하는 시스템은 역사정보와 연관된 도서 추천 요청을 수신하는 수신부; 추상적인 개념으로 나타나는 역사적 문맥정보로부터 단어를 추출하여 역사적으로 연관된 인물정보를 추출하는 인물정보 추출부; 인물정보를 기초하여, 상기 인물정보에 대한 생몰년 정보를 추출하는 생몰년 정보 추출 부; 인물의 생몰년 정보에 기초하여, 역사정보와 연관된 다른 역사정보를 추출하는 역사정보 추출부; 역사정보 및/또는 다른 역사정보에 기초하여, 다수의 생몰년 정보를 가진 다수의 인물을 추천인물로 결정하는 추천인물 결정부; 및 추천인물에 기초하여, 추천인물과 연관된 도서를 추천하는 도서추천부;를 포함 할 수 있다. 도 3 내지 도 5는 본 발명의 다른 실시예에 따른 NFT (Non-Fungible Token)를 활용한 역사정보와 연관된 도서를 추천하는 시스템을 기능별로 나타낸 기능 블록도이다. 도 3 내지 도 5를 참조하면 텍스트, 이미지 , 오디오 및 동영상 중 적어도 어느 하나를 포함하는 디지털 콘텐츠 를 NFT(Non-Fungible Token)로 기록할 수 있다."}
{"patent_id": "10-2021-0157267", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "전술한 본 발명의 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가 지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본 발명의 범위는 후술하는 청구범위에 의하여 나타내어지며, 청구범위의 의미 및 범위 그리고 그 균등 개념으 로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2021-0157267", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 역사정보와 연관된 도서를 추천하는 시스템의 전체적인 구성을 나타내는 구 성도이다. 도2는 본 발명의 일 실시예에 따른 역사정보와 연관된 도서를 추천하는 시스템을 기능별로 나타낸 기능 블록도 이다. 도 3은 본 발명의 다른 실시예에 따른 역사정보와 연관된 도서를 추천하는 시스템의 예를 도시하는 이미지이다.도 4 는 본 발명의 다른 실시예에 따른 역사정보 수집을 기능별로 나타낸 기능 블록도이다. 도 5 는 본 발명의 다른 실시예에 따른 역사정보 서비스를 기능별로 나타낸 기능 블록도이다."}
