{"patent_id": "10-2024-7017090", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0105399", "출원번호": "10-2024-7017090", "발명의 명칭": "준설 시스템 및 준설 방법", "출원인": "그란포스 에이에스", "발명자": "타예비, 다부드"}}
{"patent_id": "10-2024-7017090", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "하부 표면으로부터 침수된 입상 물질(granular material)을 제거하기 위한 준설(dredging) 시스템에 있어서, 상기 준설 시스템은:- 입상 물질(1)을 제거하기 위한 준설 로봇(3);- 상기 준설 로봇(3)으로부터 제거된 입상 물질을 하역(offloading)하기 위한 도킹 스테이션(4) - 상기 도킹 스테이션(4)은, 상기 하부 표면에 대해 부착됨 -; 및- 상기 도킹 스테이션(4)으로부터 제거된 입상 물질을 원격 위치로 이송하는 라이저 파이프(riser pipe, 5)를포함하는, 준설 시스템."}
{"patent_id": "10-2024-7017090", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 준설 로봇(3)은 바텀 크롤러(bottom crawler) 또는 수중용 드론(submersible drone)인, 준설 시스템."}
{"patent_id": "10-2024-7017090", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항 또는 제2항에 있어서,상기 준설 로봇(3)은 입상 물질(1)을 제거하기 위한 적어도 하나의 흡입 헤드(3b)를 포함하는, 준설 시스템."}
{"patent_id": "10-2024-7017090", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 흡입 헤드(3b)는 하나 이상의 유동화(fluidizing) 노즐을 포함하는, 준설 시스템."}
{"patent_id": "10-2024-7017090", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항 내지 제4항 중 어느 한 항에 있어서,상기 준설 로봇(3)은, 상기 침수된 입상 물질(1)을 루스닝(loosening)하기 위한 하나 이상의 전단 요소(3i)를포함하되,상기 하나 이상의 전단 요소(3i)가 톱니, 블레이드, 나이프, 회전 블레이드, 스파이크 롤러 및/또는 고압 유체제트를 방출하기 위한 노즐을 포함하는, 준설 시스템."}
{"patent_id": "10-2024-7017090", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항 내지 제5항 중 어느 한 항에 있어서,상기 준설 로봇(3)은, 제거된 입상 물질의 일시적인 보관을 위한 탱크(3e)를 포함하는, 준설 시스템."}
{"patent_id": "10-2024-7017090", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 준설 로봇(3)은, 상기 준설 로봇(3)에 전원을 공급하기 위한 배터리(3h)를 포함하는, 준설 시스템."}
{"patent_id": "10-2024-7017090", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항 또는 제7항에 있어서,상기 준설 로봇(3)에 전원을 공급하기 위해, 상기 준설 로봇(3)에 연결되는 송전선(power line)을 더 포함하는,공개특허 10-2024-0105399-3-준설 시스템."}
{"patent_id": "10-2024-7017090", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항 내지 제5항 중 어느 한 항에 있어서,상기 준설 로봇(3)으로부터 제거된 입상 물질을 하역하기 위한 엄빌리컬 라인(umbilical line, 5)을 더 포함하되,상기 엄빌리컬 라인(5)이, 상기 준설 로봇(3)을 상기 도킹 스테이션(4)과 연결하는, 준설 시스템."}
{"patent_id": "10-2024-7017090", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 엄빌리컬 라인(5)은, 상기 준설 로봇(3)에 전원을 공급하기 위한 송전선을 포함하고, 통합된 통신 선, 압축된 가스 선, 적어도 하나의 유압 선 및/또는 윤활 선 중 선택적으로 하나 이상을 포함하는, 준설 시스템."}
{"patent_id": "10-2024-7017090", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항 내지 제10항 중 어느 한 항에 있어서,상기 준설 로봇(3)은, 반자동적으로 및/또는 자동적으로 원격 제어함으로써 상기 준설 로봇(3)을 작업시키도록구성된 제어 유닛(3g)를 포함하는, 준설 시스템."}
{"patent_id": "10-2024-7017090", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1항 내지 제11항 중 어느 한 항에 있어서,상기 준설 로봇(3)은, 수중 포지셔닝 시스템을 포함하는, 준설 시스템."}
{"patent_id": "10-2024-7017090", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제1항 내지 제12항 중 어느 한 항에 있어서,상기 라이저 파이프(5)를 통해 제거된 입상 물질을 이송하기 위한 이송 수단(5d)을 더 포함하는, 준설 시스템."}
{"patent_id": "10-2024-7017090", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 이송 수단(5d)은 슬러리 펌프(slurry pump), 이덕터(eductor) 또는 컴프레서(compressor)를 포함하되, 상기 이송 수단(5d)이 선택적으로 부스터 펌프를 더 포함하는, 준설 시스템."}
{"patent_id": "10-2024-7017090", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제1항 내지 제14항 중 어느 한 항에 있어서,복수의 도킹 스테이션(4)을 포함하되, 둘 이상의 도킹 스테이션(4)이 연결 파이프(7)를 통해 라이저 파이프(5)에 연결되는, 준설 시스템."}
{"patent_id": "10-2024-7017090", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제1항 내지 제15항 중 어느 한 항에 있어서,복수의 준설 로봇(3)을 포함하는, 준설 시스템."}
{"patent_id": "10-2024-7017090", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제1항 내지 제16항 중 어느 한 항에 있어서,하나 이상의 준설 로봇(3)의 동시 도킹을 위해, 여러 개의 도킹 커플링(4a)을 가지는 적어도 하나의 도킹 스테이션(4)을 포함하는, 준설 시스템.공개특허 10-2024-0105399-4-청구항 18 채굴 작업, 해안 보강 작업, 인공 반도 또는 인공 섬의 건설, 장비의 고정 또는 케이블 또는 파이프의 부설, 좌초 또는 침몰된 선박의 인양 작업, 인공 댐 뒤로부터 또는 광산 또는 터널로부터 입상 물질의 제거, 선박, 컨테이너 또는 베이슨(basin)으로부터의 입상 물질의 제거 및/또는 수로, 강, 호수, 항구 또는 해상 항로와 같은 물길 준설 작업을 위한, 제1항 내지 제17항 중 어느 한 항의 준설 시스템의 사용."}
{"patent_id": "10-2024-7017090", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "침수된 입상 물질(1)의 준설을 위한 방법에 있어서,- 제1항 내지 제16항 중 어느 한 항에 따른 준설 시스템을 제공하는 단계;- 상기 준설 로봇(3)을 사용하여 입상 물질(1)을 제거하는 단계;- 제거된 입상 물질을 상기 준설 로봇(3)으로부터 상기 도킹 스테이션(4)으로 하역하는 단계; 및- 제거된 입상 물질을 상기 라이저 파이프(5)를 통해 상기 도킹 스테이션(4)으로부터 원격 위치로 이송하는 단계를 포함하는, 방법."}
{"patent_id": "10-2024-7017090", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서,하나 이상의 시간 간격동안, 하나 이상의 준설 위치에서, 적어도 하나의 준설 시스템이 입상 물질(1)을 제거하도록 지시하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2024-7017090", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은, 하부 표면으로부터 침수된 입상 물질을 제거하기 위한 준설(dredging) 시스템에 관한 것이다. 준 설 시스템은 입상 물질을 제거하기 위한 준설 로봇 및 준설 로봇으로부터 제거된 입상 물질을 하역하기 위한 도킹 스테이션을 포함한다. 도킹 스테이션은, 하부에 부착되고 연결된다. 준설 시스템은, 도킹 스테 이션으로부터 제거된 입상 물질을 원격 위치로 이송하는 라이저 파이프를 더 포함한다. 본 발명은 또한 침 수된 입상 물질의 준설을 위한 방법에 관한 것이다."}
{"patent_id": "10-2024-7017090", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은, 입상 물질(granular material)의 준설, 특히 준설 시스템 및 준설을 위한 방법에 관한 것이다."}
{"patent_id": "10-2024-7017090", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "유체 아래에 부분적으로 또는 완전히 침수된 입상 물질 덩어리로부터의 입상 물질 준설 또는 발굴은, 다양한 환 경에서 필요할 수 있다. 예를 들어, 정기적인 준설은, 뱃길을 개방된 상태로 유지하기 위해, 산업 베이슨 (basin)을 쌓인 입상 물질이 없는 상태로 유지하기 위해 또는 댐의 뒤로부터 쌓인 입상 물질을 제거하기 위해 필요할 수 있다. 해저 채굴은, 원하는 물질을 회수하기 위해 입상 물질의 발굴을 필요로 할 수 있다. 취약한 해 안선의 보강 또는 인공 섬의 건설은, 보통 연안의 더 먼 위치에서 대량의 입상 물질을 발굴하는 것을 필요로 한 다. (부분적으로) 침수된 장비의 고정은, 입상 물질을 포함하는 해저 내의 구멍 또는 도랑의 발굴을 필요로 할 수 있다. 마지막으로, 대량의 입상 물질의 준설은, 얕은 물에서 움직이지 못하게 된 선박을 풀어주는 데 필요할 수 있다. 알려진 준설 장비는, 바지선(barge) 또는 특수 제작된 준설 배와 같은 선박 상에 장착될 수 있다. 준설 장비는, 이후 선박에 의해 준설 위치로 옮겨질 수 있다. 준설 중에, 선박은 준설 위치에서 머무르거나, 진행중인 준설 작업에 따라 이동한다. 선박-장착된 준설의 단점은, 해상 교통에 대해 선박이 부분적으로 또는 완전히 준설 위 치를 막을 수 있다는 것이다. 예를 들어, 항만 베이슨이나 좁은 수로에서는, 접근성이 떨어지면 부정적인 경제 적 효과를 일으킬 수 있다. 일부 준설 위치는, 준설 위치가 너무 깊거나 너무 얕기 때문에, 선박-장착된 준설 장비로도 접근 불가능할 수 있다. 선박-장착된 준설의 다른 단점은, 관련된 물류 및 비용이다. 선박-기반의 준설 시스템은, 보통 선박 및/또는 준 설 장비를 조종하기 위한 작업 승무원을 필요로 한다. 따라서, 준설이 비쌀 수 있고, 복잡한 물류, 특히 오래 걸리고 원격 위치에서 수행되는 준설 작업을 위한 복잡한 물류를 필요로 할 수 있다. 준설이 간헐적으로만 필요 한 지역에는, 준설 작업이 시작되기 전에 선박-장착된 준설 장비 및 작업 승무원이 자리에 와야 하고, 따라서"}
{"patent_id": "10-2024-7017090", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "물류가 더 복잡해진다.발명의 내용"}
{"patent_id": "10-2024-7017090", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "그러므로, 알려진 시스템의 단점을 극복하고, 준설 작업에 관련된 물류가 단순화될 수 있으면서도 선박에 의해 준설 위치를 막을 필요가 없는 방식으로 작업할 수 있는 개선된 준설 시스템에 대해 명백한 수요가 있다."}
{"patent_id": "10-2024-7017090", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명은, 청구항 제1항에 따른 준설 시스템에 관한 것이다. 또한, 본 발명은 청구항 제18항에 따른 준설 시스 템의 사용 및 청구항 제19항에 따른 준설을 위한 방법에 관한 것이다."}
{"patent_id": "10-2024-7017090", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은, 알려진 시스템의 단점을 극복하고, 준설 작업에 관련된 물류가 단순화될 수 있으면서도 선박에 의해 준설 위치를 막을 필요가 없는 방식으로 작업할 수 있는 개선된 준설 시스템을 제공하는 효과가 있다."}
{"patent_id": "10-2024-7017090", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 1, "content": "도 1a 및 도 1b는, 본 발명의 제1 실시예에 따라, 하부 표면으로부터 침수된 입상 물질을 제거하기 위한 준 설 시스템을 개략적으로 도시한다. 동일한 참조 번호는, 도 1a 및 도 1b 양쪽에서 동일한 부분을 지칭하고, 다 른 모든 도면에 대해서도 동일한 참조 번호는 동일한 부분을 지칭한다. 침수된 입상 물질은, 유체 아래에 서 부분적으로 침수되거나 완전히 침수될 수 있다. 유체는, 해수, 담수, 폐수, 액체 또는 기체 탄화수소, 산 업용 유체, 액체-기체 혼합물, 기체 또는 이들의 혼합물일 수 있다. 입상 물질은 점토, 유사(silt), 모래, 자갈(gravel) 또는 이들의 혼합물일 수 있다. 이에 더해 또는 대안적으로, 입상 물질은 금속, 플라스틱, 바 이오매스(biomass), 나무, 음식 물질, 세라믹, 콘크리트, 유리, 미네랄, 결정화 물질, 합성물 또는 이들의 혼합 물을 포함하는 입자를 포함할 수 있다. 준설 시스템이 항만 베이슨 내에서 사용될 때, 예를 들어, 입상 물질 은 모래를 포함할 수 있고 유체는 해수를 포함할 수 있다. 준설 시스템은, 입상 물질을 제거하기 위한 준설 로봇 및 준설 로봇으로부터 제거된 입상 물질을 하역하 기 위한 도킹 스테이션을 포함한다. 제거된 입상 물질은, 입상 물질과 유체의 혼합물을 포함할 수 있 다. 준설 로봇은, 바텀 크롤러(도 1a 참조)를 포함할 수 있다. 바텀 크롤러는 하부 표면 상에서 주행하도록 구성된다. 대안적으로, 준설 로봇은, ROV(Remotely-operated vehicle)와 같은 수중용 드론(도 1b 참조)을 포함할 수 있다. 수중용 드론은 유체 내로 잠수하도록 구성된다. 유리하게는, 준설 로봇을 도킹 스테이션과 함께 활용함으로써, 준설 위치에서 선박-장착된 준설 장비를 포지셔닝하는 것을 회피할 수 있으며, 따라서 번거로운 물류를 피할 수 있다. 더 유리하게는, 해상 교통이 있는 준설 위치에서, 상기 해상 교통이 방해받지 않고 계속될 수 있다. 도 2에 더 자세하게 개략적으로 도시된 도킹 스테이션은, 하부 표면에 부착된다. 도킹 스테이션은 부분적 으로 또는 완전히 유체 내로 침수된다. 도킹 스테이션은 베이스(4b)를 포함할 수 있다. 베이스(4b)는, 하 부 표면(도 1a)에 부분적으로 또는 완전히 매립되거나, 자체 중량에 의해 하부 표면 상에 놓일 수 있다. 대안적 으로, 도킹 스테이션은 하부 표면에 부착되는 앵커 라인(도 1의 줄무늬 라인)을 포함할 수 있다. 후자의 경 우, 도킹 스테이션은 플로트(도 1b)에 의해 수직으로 유지될 수 있다. 도킹 스테이션은 준설 위치로부터 멀리 떨어져 위치할 수 있다. 이는, 항구나 뱃길과 같이, 해양 교통이 있는 지역에서 준설 작업에 유리할 수 있 다. 대안적으로, 도킹 스테이션은 준설 위치에 위치될 수 있다. 이는, 인공 섬 건설이나 해저 채굴과 같이, 입상 물질의 지속적인 제거 또는 입상 물질의 대량 제거가 필요한 준설 작업에 유리할 수 있다. 도킹 스테이션 은, 제거된 입상 물질의 흐름을 제어하기 위한 제어 밸브(4c)를 포함하고, 제거된 입상 물질의 흐름은 제어 밸브(4c)를 통과한다. 도킹 스테이션은, 제거된 입상 물질을 필터링하기 위한 하나 이상의 필터(4d)를 더 포 함할 수 있다. 도킹 스테이션은 하우징(4e)을 포함한다. 하우징은 스테인레스 스틸과 같은 금속 재료, 또는 폴리머-금속 복합체 또는 유리 섬유-폴리머 복합체와 같은 복합 재료를 포함할 수 있다. 도킹 스테이션은, 적어도 하나의 센서(4f) 및 선택적으로 제어 유닛(4g)을 포함할 수 있다. 적어도 하나의 센서(4f)는, 압력 센서, 근접 센서(proximity sensor), 수중 음파 탐지기(sonar), 온도 센서, 유량계 및/또는 광학 센서를 포함할 수 있다. 압력 센서는, 도킹 스테이션 내부의 유체 압력 또는 도킹 스테이션 외부의 유체 압력을 모니터링할 수 있다. 근접 센서는, 도킹 스테이션에 대한 준설 로봇의 근접도를 모니터링할 수 있다. 광학 센서는 하나 이상의 수중 카메라를 포함할 수 있다. 온도 센서는 도킹 스테이션 내부의 온도 또는 도킹 스테이션 외부의 온도를 모니터링할 수 있다. 유량계는 도킹 스테이션 내부의 유량 속도 또는 도킹 스테이션 외부의 유량 속도를 모니터링할 수 있다. 도킹 스테이션은, 수중 카메라의 가시성 향상을 위한 하나 이상의 투광등(floodlight, 4h)을 더 포함할 수 있다. 제어 유닛(4g)은 CPU, 통신 모듈 및 메모리 유 닛을 포함한다. 제어 유닛(4g)은, 원격 명령 센터로 센서 신호를 전송하고, 원격 명령 센터로부터 명령 신호를 수신할 수 있다. 제어 유닛(4g)은, 준설 로봇으로부터 센서 신호를 수신 및/또는 준설 로봇에 명령 신호 를 전송할 수 있다. 예를 들어, 제어 유닛(4g)은, 적어도 하나의 센서(4f)로부터 센서 신호를 획득하고, 획득된 센서 신호를 기반으로 준설 로봇에 명령 신호를 전송할 수 있다. 또한, 제어 유닛은, 준설 로봇 또는 적 어도 하나의 센서(4f)로부터 수신한 센서 신호를 기반으로 하여, 원격 명령 센터에 경고 신호를 보낼 수 있다. 이후, 원격 작업자는 준설 시스템의 오작동, 유지 관리 요구사항 및/또는 작업 문제에 대해 경고받을 수 있다. 도킹 스테이션은, 제거된 입상 물질, 유체 및/또는 도킹 스테이션 주변 환경의 물리적 및/또는 화학적 특성 을 모니터링하기 위한 분석 유닛(4i)을 더 포함할 수 있다. 예를 들어, 분석 유닛(4i)은 평균 입자 직경, 입자 밀도, 오염의 존재 및/또는 광물과 같은 표적 물질의 존재를 판단할 수 있다. 준설 시스템은, 제거된 입상 물질을 도킹 스테이션으로부터 원격 위치로 이송하기 위한 라이저 파이프를 더 포함한다. 원격 위치는, 부유 베이슨, 해저 베이슨, 선박 기반 베이슨, 차량 기반 베이슨 또는 육상 베이슨 과 같은, 입상 물질을 위한 고정식 또는 이동식 베이슨을 포함할 수 있다. 유리하게는, 제거된 입상 물질은 추 가 사용, 프로세싱, 필터링 또는 폐기를 위해 이동 베이슨 내에서 위치로 운반될 수 있다. 대안적으로, 원격 위 치는 건설 위치 또는 침전 위치를 포함할 수 있다. 유리하게는, 제거된 입상 물질은, 건축 재료로 사용되는 위 치 또는 임시적이거나 영구적으로 배치되는 위치로 직접 옮겨질 수 있다. 라이저 파이프는 신축성이 있을 수 있다. 라이저 파이프는, 도킹 스테이션에 전력을 공급하기 위한 송전선(5a)(도 2의 점선임)을 포함할 수 있다. 라이저 파이프는, 통신 및 제어 신호를 전송 및 수신하기 위한 통신 선(5b)을 더 포함할 수 있다. 통 신 선(5b)은 예를 들어 광섬유 케이블을 포함할 수 있다. 라이저 파이프는 제거된 입상 물질의 흐름을 조절 하기 위한 하나 이상의 제어 밸브(5c)를 포함할 수 있다. 준설 시스템은, 라이저 파이프를 통해 제거된 입상 물질을 도킹 스테이션으로부터 원격 위치로 이송하기 위한 이송 수단(5d)을 포함할 수 있다. 이송 수단(5d) 은 수중 도킹 시스템에 통합될 수 있고, 육지에 위치할 수 있거나 선박에 장착될 수 있다. 이송 수단(5d)은 슬러리 펌프를 포함할 수 있다. 대안적으로, 이송 수단(5d)은 이덕터(eductor)를 포함하는 벤튜리 시스템, 또는 컴프레서(compressor)를 포함하는 가스 리프트 시스템을 포함할 수 있다. 대안적으로 또는 추가적으로, 이송 수 단(5d)은 부스터 펌프를 포함할 수 있다. 유리하게는, 부스터 펌프를 더 활용함으로써, 제거된 입상 물질은 넓 은 유체 깊이로부터 라이저 파이프를 통해 이송될 수 있다. 도 3a에 개략적으로 도시된 준설 로봇은, 추진 수단(3a)을 포함한다. 추진 수단(3a)은, 하나 이상의 전기 모 터(도시되지 않음), 추력 모터 또는 수중 제트 모터에 의해 구동될 수 있다. 도 3a에 도시된 바와 같이, 바텀크롤러를 포함하는 준설 로봇의 경우. 추진 수단(3a)은 하나 이상의 무한 벨트(endless belt) 또는 복수의 휠을 포함한다. 유리하게는, 바텀 크롤러가 무거운 입상 물질 적재물을, 준설 위치로부터 도킹 스테이션까지 운 반할 수 있다. 더 유리하게는, 바텀 크롤러는 침수거나 부분적으로 침수된 양쪽, 또는 침수되지 않은 준설 위치 에 접근할 수 있다. 수중용 드론(도시되지 않음)을 포함하는 준설 로봇의 경우, 추진 수단(3a)은 하나 이상의 프로펠러, 스크류, 추력 모터 및/또는 수중 제트 모터를 포함한다. 수중용 드론은, 적어도 하나의 방향타 (rudder) 및/또는 하나 이상의 핀 및 선택적으로 수중용 드론의 부력을 조절하기 위한 밸러스트(ballast) 시스 템을 더 포함할 수 있다. 유리하게는, 수중용 드론은 향상된 기동성을 제공하여 준설 로봇이 하부 표면의 장애 물 위로 자유롭게 이동할 수 있도록 한다. 더 유리하게는, 수중용 드론은, 예를 들어 유지 관리 목적을 위해, 표면으로 더 쉽게 옮겨질 수 있다는 장점이 있다. 준설 로봇은, 흡입을 수단으로 하여 입상 물질을 제거하기 위한 적어도 하나의 흡입 헤드(3b)를 포함한다. 적어도 하나의 흡입 헤드(3b)는 로봇 암(3d) 상에 장착될 수 있다. 유리하게는, 흡입 헤드는 정밀하게 제어되고 /되거나 제거될 입상 물질 위에 배치될 수 있다. 대안적으로, 적어도 하나의 흡입 헤드(3b)는 준설 로봇에 고정 방식으로 장착될 수 있다. 적어도 하나의 흡입 헤드(3b)는 준설 로봇의 전면에 위치될 수 있다. 유리하 게는, 이후 준설 로봇이 특정 위치 위로 이동하기 전에, 적어도 하나의 흡입 헤드가 입상 물질을 제거한다. 대 안적으로 또는 추가적으로, 적어도 하나의 흡입 헤드(3b)는 준설 로봇의 후방 측에 위치될 수 있다. 유리하 게는, 입상 물질이 흡입 헤드에 의해 제거되기 이전에, 준설 로봇이 입상 물질 위로 이동하는 동안, 입상 물질 이 먼저 루스닝될 수 있다(아래 설명됨). 더 대안적으로 또는 추가적으로, 적어도 하나의 흡입 헤드(3b)는, 준 설 로봇의 측면 및/또는 준설 로봇의 아래쪽에 위치될 수 있다. 준설 로봇은, 반자동적으로 및/또는 자동적으로 원격 제어에 의해 준설 로봇을 작업시키기 위해 구성된 제어 유닛(3g)을 포함할 수 있다. 제어 유닛(3g)은 하나 이상의 CPU를 포함할 수 있다. 제어 유닛(3g)은, 도킹 스테이션 및/또는 원격 명령 센터와 통신하기 위한 통신 수단을 더 포함할 수 있다. 원격 명령 센터는 선박 기반이거나 육상 기반일 수 있다. 준설 로봇은 수중 포지셔닝 시스템(도시되지 않음)을 더 포함할 수 있다. 수중 포지셔닝 시스템은 제어 유닛(3g)에 연결된다. 수중 포지셔닝 시스템은, 도플러 기반 시스템, 초단거리 베 이스라인 시스템, 또는 수중 GPS를 포함할 수 있다. 준설 시스템은, 수중 포지셔닝 시스템을 위한 하나 이상의 비콘 또는 네비게이션 노드를 더 포함할 수 있다. 비콘은, 도킹 스테이션과 준설 위치 사이에 상이한 간격으 로 배치될 수 있다. 준설 로봇은, 압력 센서, 자이로스코프, 온도 센서, 수중 음파 탐지기, 깊이 센서 및/또 는 광학 센서와 적어도 하나의 센서(도시되지 않음)를 더 포함할 수 있다. 광학 센서는 바람직하게는 하나 이상 의 수중 카메라를 포함할 수 있다. 준설 로봇은, 수중 카메라의 가시성 및/또는 준설 로봇의 가시성을 개 선하기 위해, 하나 이상의 투광등(도시되지 않음)을 더 포함할 수 있다. 적어도 하나의 센서는 제어 유닛(3g)에 결합된다. 유리하게는, 제어 유닛, 수중 포지셔닝 시스템 및 적어도 하나의 센서는, 준설 로봇이 하부 표면 위 로 및/또는 유체 내에서 이동하고 선택적으로 도킹 스테이션에 도킹할 수 있도록 한다. 제어 유닛(3g)은, 수중 포지셔닝 시스템 및/또는 적어도 하나의 센서로부터 수신된 데이터를 기반으로 하여, 원격 명령 센터에 경 고 신호를 전송하도록 구성될 수 있다. 이에 따라, 원격 작업자는 오작동, 유지 관리 요구 사항 또는 작업 문제 에 대해 경고를 받을 수 있다. 준설 로봇은, 입상 물질 및/또는 유체의 물리적 및/또는 화학적 특성을 모 니터링하도록 구성된 분석 유닛(도시되지 않음)을 더 포함할 수 있다. 분석 유닛은, 예를 들어 평균 입자 직경, 입자 밀도, 입자 모양, 오염의 존재 및/또는 광물과 같은 표적 물질의 존재를 판단하도록 구성될 수 있다. 준설 로봇은, 입상 물질를 루스닝 하기 위해 하나 이상의 전단 요소(3i)를 포함할 수 있다. 유리하게는, 루스닝된 입상 물질은 더 쉽게 유동화될 수 있고 결과적으로 적어도 하나의 흡입 헤드에 의해 제거될 수 있다. 하나 이상의 전단 요소(3i)는, 톱니, 블레이드 또는 나이프와 같은 수동 전단 요소를 포함할 수 있다. 대안적으 로 또는 추가적으로, 하나 이상의 전단 요소(3i)는 회전 블레이드, 진동 요소, 스파이크 롤러, 또는 고압 유체 제트를 방출하기 위한 노즐과 같은 능동 전단 요소를 포함할 수 있다. 능동 전단 요소는 진동, 맥동(pulsate) 또는 회전 운동으로 구동되도록 구성될 수 있다. 능동 전단 요소는 전기적으로 또는 유압식으로 구동될 수 있다. 하나 이상의 전단 요소는, 접이식 블레이드와 같은 접이식 전단 요소일 수 있다. 접이식 블레이드의 전개 는, 전기적으로 또는 유압식으로 구동될 수 있다. 유리하게는, 하나 이상의 전단 요소는 필요할 때 전개될 수 있고 필요하지 않을 때 접혀질 수 있다. 하나 이상의 전단 요소(3i)는, 흡입 헤드 및/또는 준설 로봇에 장착 된 별도의 암 상에 제공될 수 있다. 암은, 하나 이상의 전단 요소(3i)의 움직임을 제어하도록 구성된 로봇 암일 수 있다. 대안적으로, 암은 고정된 암일 수 있다. 준설 로봇은, 가압된 유체를 입상 물질 내로 방출하여 입상 물질을 유동화하고 루스닝하기 위한, 하나 이상 의 유동화 노즐을 더 포함할 수 있다. 유리하게는, 유동화된 입상 물질이 흡입 헤드를 통해 더 쉽게 제거된다.하나 이상의 유동화 노즐은 흡입 헤드(3b)에 장착될 수 있다. 하나 이상의 유동화 노즐은, 예를 들어 흡입 헤드 (3b) 내부, 흡입 헤드(3b) 외부 상 및/또는 흡입 헤드(3b)로부터 돌출되는 하나 이상의 암 상에 배치될 수 있다. 대안적으로, 및/또는 추가적으로, 하나 이상의 유동화 노즐은, 준설 로봇으로부터 돌출된 하나 이상의 암과 같은 준설 로봇의 다른 곳에 배치될 수 있다. 유리하게는, 입상 물질의 유동화는, 따라서 입상 물질을 보다 효율적으로 제거하는 것을 달성하는 데 필요한 방식으로 제어될 수 있다. 하나 이상의 유동화 노즐은, 유 동화 노즐로부터 방출되는 유체를 제공하고 가압하기 위해, 유체 입구 및 펌프(아래에 설명됨)에 연결될 수 있 다. 유체 입구는 외부 유체 소스에 결합될 수 있다. 대안적으로, 유체 입구는 주변 유체로부터 유체를 흡입 하도록 구성될 수 있다. 예를 들어, 산업 폐수 베이슨 내의 준설 시스템의 경우, 유동화 노즐에 의해 방출되는 가압 유체는 베이슨 내에 포함된 폐수를 포함할 수 있다. 준설 로봇은, 준설 로봇이 움직이지 못하게 되었을 때 풀어주기 위한 해제 시스템(3j)을 더 포함할 수 있 다. 예를 들어, 준설 로봇은 유동화된 입상 물질 덩어리 내에 부분적으로 가라앉거나 장애물로 인해 움직이지 못하게 될 수 있다. 해제 시스템은, 팽창 가능한 백, 팽창 가능한 부유 장치, 유압 해제 요소, 또는 고압 제트 를 방출하기 위한 하나 이상의 노즐을 포함할 수 있다. 팽창 가능한 백은 준설 로봇의 하부에 위치할 수 있 다. 팽창 가능한 백은, 팽창되면서 준설 로봇을 하부 표면으로부터 밀어내어, 준설 로봇을 하부 표면으로 부터 풀어주도록 구성된다. 팽창 가능한 부양 장치는, 준설 로봇의 측면 또는 상부에 위치할 수 있다. 팽창 가능한 부양 장치는, 팽창되었을 때, 준설 로봇을 들어올려 준설 로봇을 하부 표면으로부터 풀어주도록 구성된다. 준설 시스템은, 팽창 가능한 백 또는 팽창 가능한 부양 장치를 팽창시키기 위한 압축된 가스 소스를 포함할 수 있다. 압축된 가스의 소스는, 준설 로봇에 통합된 압축된 가스 홀더를 포함할 수 있다. 유압 해제 요소는, 준설 로봇의 측면 및/또는 하부에 위치된 하나 이상의 유압 작동식 암을 포함할 수 있다. 유압 작동 식 암은, 전개되었을 때, 준설 로봇을 하부 표면으로부터 멀어지게 밀어내어, 준설 로봇을 하부 표면으로 부터 풀어주도록 구성된다. 준설 로봇은, 도 3b 에 개략적으로 도시된 것과 같이, 다수의 흡입 헤드(3b)를 포함할 수 있다. 다수의 흡입 헤드(3b)는, 준설 로봇의 동일한 측면 상에 위치하거나 상이한 측면 상에 위치할 수 있다. 예를 들어, 하나 이상의 흡입 헤드는 전면에 위치할 수 있고, 하나 이상의 흡입 헤드(3b)는 준설 로봇의 각각의 측면에 위치 할 수 있다(도 3 참조). 유리하게는, 넓은 영역을 한번에 덮을 수 있어, 대량의 입상 물질이 제거될 수 있다. 대안적으로, 하나 이상의 흡입 헤드(3b)는 준설 로봇의 전방에 위치될 수 있고, 하나 이상의 흡입 헤드(3b) 는 준설 로봇의 후방에 위치될 수 있다. 유리하게는, 이에 따라 준설 로봇이 작동되는 동일한 위치에 이 중 흡입이 적용될 수 있다. 추가적으로 또는 대안적으로, 다수의 흡입 헤드는 준설 로봇의 양쪽 측면 또는 및/또는 준설 로봇의 하부에 위치될 수 있다. 도 1a 및 도 1b에 도시된 제1 실시예에 따르면, 준설 로봇은, 입상 물질을 제거하기 위한 준설 위치와 제거 된 입상 물질을 하역하기 위한 도킹 스테이션 사이를 왕복하도록 구성될 수 있다. 유리하게는, 준설 로봇은 큰 작업 범위를 가지고, 장애물을 피해 하부 표면 상 또는 유체 내를 쉽게 탐색할 수 있다. 이 실시예에서, 준설 로봇은, 내부 펌프(3c)와 같이 흡입 헤드(3b)에 흡입을 가하는 수단을 포함한다. 내부 펌프(3c)는 바람 직하게는 슬러리 펌프를 포함한다. 슬러리 펌프는 유체와 고체 입자의 혼합물을 펌핑하도록 구성된다. 준설 로 봇은, 제거된 입상 물질의 임시적인 저장을 위해, 적어도 하나의 흡입 헤드(3b)에 연결된 탱크(3e)를 더 포 함한다. 흐름 선(도시되지 않음)은 흡입 헤드(3b)를 펌프(3c) 및 탱크(3e)와 연결한다. 이 실시예에서, 준설 로 봇은 커플링(3k)을 더 포함한다. 커플링(3k)은, 준설 로봇이 도킹 스테이션에 도킹될 때, 도킹 스테이 션에 제공된 도킹 커플링(4a)과 연결되도록 구성된다. 도킹 스테이션은, 도킹 커플링(4a)을 통해 탱크 (3e)로부터 제거된 입상 물질을 하역하도록 구성된다. 유리하게는, 제거된 입상 물질을 임시로 저장함으로써, 작업 유연성이 달성된다. 이는 준설 로봇이 침수된 장애물 주위를 탐색해야 하거나, 준설 위치가 도킹 스테이션 에서 멀리 떨어져 있는 경우에 특히 유리하다. 이러한 상황에서, 준설 로봇과 도킹 스테이션 사이의 영구적인 연결은, 준설 로봇의 움직임을 막을 수 있다. 준설 로봇은, 도 3a에 도시된 것과 같이, 오버플로 출구(3f)를 더 포함할 수 있다. 오버플로 출구(3f)는, 오 버플로 덕트를 통해 흐르는 유체로부터 입자를 필터링하기 위한, 필터를 포함할 수 있다. 유리하게는, 유체가 탱크 밖으로 흐를 수 있는 반면에, 입상 물질은 탱크 내에 억제되어 있다. 이에 따라, 입상 물질이 압축될 수 있고, 탱크 내에 저장되는 입상 물질의 양이 증가될 수 있다. 더 유리하게는, 유체가 탱크 밖으로 흐르도록 함 으로써, 탱크가 과하게 채워지는 것이 방지될 수 있다. 오버플로 출구(3f)는, 오버플로 출구(3f)를 개폐하기 위 한 오버플로 제어 밸브(3f')를 포함할 수 있다. 준설 로봇은, 준설 로봇에 전원을 제공하기 위한 배터리 (3h)를 더 포함할 수 있다. 이 경우, 도킹 커플링(4a)은, 준설 로봇이 도킹 스테이션에 도킹될 때 배터리(3h)를 충전하기 위한, 전기적 출구(4a)를 포함한다. 유리하게는, 이에 따라 더 큰 작동 자유도가 달성된다. 대 안적으로 또는 추가적으로, 준설 시스템은 준설 로봇에 연결되어 전력을 공급하는 송전선(도시되지 않음)을 포함할 수 있다. 송전선은 도킹 스테이션에 연결될 수 있다. 대안적으로, 송전선은 육상 전력 소스 또는 선 박 기반 전력 소스와 같은 외부 전력 소스에 직접 결합될 수 있다. 선택적으로, 송전선은 유체 내의 송전선의 무게를 보상하기 위해 부유 요소를 포함할 수 있다. 유리하게는, 송전선을 활용함으로써, 준설 로봇에 지속적으 로 전력이 공급될 수 있다. 선택적으로, 송전선은, 준설 로봇과 데이터 및 명령 신호를 주고 받기 위한 광섬 유 케이블과 같은 통신 선을 포함할 수 있다. 더 선택적으로, 도킹 커플링(4a)는, 준설 로봇이 도킹 스테이 션에 도킹될 때, 준설 로봇의 제어 유닛(3g)과 통신하기 위한 통신 포트를 포함한다. 예를 들어, 준설 지 시는, 도킹 중에 제어 유닛(3g)에 업로드될 수 있다. 또한, 준설 로봇으로부터의 센서 데이터는, 도킹 중에 도킹 스테이션 및/또는 원격 명령 센터에 다운로드될 수 있다. 도 4a에 개략적으로 도시된 흐름 구성을 참조하면, 입상 물질 제어 밸브(3c')는, 입상 물질 및 유체를 포 함하는 제거된 입상 물질의 탱크(3e)로의 흐름을 제어하기 위해, 흡입 헤드(3b)와 탱크(3e) 사이에 제공된다. 탱크에는, 탱크(3e)로부터 도킹 스테이션으로 입상 물질을 하역하기 위한 하역 선(3q)이 제공된다. 하역 선 (3q)은, 탱크(3e)로부터 입상 물질의 흐름을 제어하기 위한, 하역 제어 밸브(3q')를 포함한다. 펌프(3n)에 결합 된 유체 입구(3m)가 제공될 수 있다. 유체 입구(3m)는, 입자 또는 다른 오염물을 필터링하기 위한 필터(도시되 지 않음)를 포함할 수 있다. 유체 입구(3m)는, 탱크(3e) 내로 연장되는 적어도 하나의 노즐(3r)에 연결된다. 바 람직하게는 둘 이상의 노즐(3r)이 제공된다. 유체 입구(3m)로부터 탱크(3e) 내의 적어도 하나의 노즐(3r)로의 흐름을 제어하기 위해, 유체 제어 밸브(3n')가 제공된다. 유체 입구(3m)는, 하나 이상의 유동화 또는 제팅 (jetting) 노즐에 더 연결될 수 있다. 유체 입구(3m)로부터 하나 이상의 유동화 또는 제팅 노즐로의 흐름을 제 어하기 위해 추가 유체 제어 밸브(3n'')가 제공된다. 작업에서, 입상 물질 제거가 시작되고 입상 물질 제어 밸브(3c')가 개방된다. 이후, 내부 펌프(3c)에 의해 흡입 이 가해지며, 입상 물질이 흡입 헤드(3b)에 의해 흡입되어 탱크(3e) 내에 쌓이도록 한다. 선택적으로, 유체 제 어 밸브(3n'')가 개방되고, 펌프(3n)에 의해 가압된 유체가 유체 입구(3m)로부터 유동화 또는 제팅 노즐로 펌핑 되어 흡입 헤드 주위의 입상 물질을 유동화한다. 유리하게는, 이에 따라 흡입 헤드를 통한 입상 물질의 제거가 개선된다. 입상 물질의 제거 동안, 하역 선(3q)을 통한 탱크로부터의 돌발적인 하역을 방지하기 위해, 하역 제 어 밸브(3q')가 폐쇄된다. 오버플로우 제어 밸브(3f')는, 입상 물질의 제거 중에 개방되어, 제거된 입상 물질과 함께 탱크(3e)에 쌓인 유체가 탱크(3e)로부터 빠져나가도록 한다. 유리하게는, 탱크 내의 입상 물질이 압축 되어, 더 많은 양의 입상 물질이 탱크 내에 저장될 수 있도록 한다. 탱크(3e)가 채워지면, 입상 물질의 제거가 정지되고 입상 물질 제어 밸브(3c'), 유체 제어 밸브(3n') 및 오버플로 제어 밸브(3f')가 폐쇄된다. 이후, 준설 로봇은 준설 위치로부터 도킹 스테이션으로 이동한다. 도킹 스테이션에서 도킹되면 하역이 시작된다. 하역 제어 밸브(3q')가 개방되고, 입상 물질이 하역 선(3q)을 통해 도킹 스테이션으로 하역된다. 선택적으로, 유체 제어 밸브(3n')가 개방되고, 탱크(3e) 내에 모인 입상 물질을 유동화하도록, 펌프(3n)에 의해 유체 입구(3m)로부터 적어도 하나의 노즐(3r)로 유체가 펌핑된다. 유리하게는, 유동화된 입상 물질은, 탱크로부 터 더 쉽게 하역될 수 있다. 하역 중에, 입상 물질 제어 밸브(3c') 및 오버플로 제어 밸브(3f')는 폐쇄된 상태 로 유지되어, 흡입 헤드(3b) 또는 오버플로 출구(3f)를 통한 입상 물질의 원치 않는 배출이 피해지도록 한다. 하역은, 외부 펌프(도시되지 않음)에 의해 구동되어 하역 선(3q)에 흡입을 가할 수 있다. 대안적으로 또는 추가 적으로, 하역은 적어도 하나의 노즐(3r)로부터 방출되고 펌프(3n)에 의해 구동되는 가압 유체에 의해 구동될 수 있다. 가압된 유체는, 탱크(3e) 내에 과압력을 생성하여, 하역 선(3q)을 통해 유동화된 입상 물질을 구동시킨다. 더 대안적으로, 하역은 컴프레서(도시되지 않음)에 의해 탱크(3e)에 제공되는 가압된 가스에 의해 구동될 수 있다. 가압된 가스는, 탱크(3e) 내에 과압력을 생성하여, 하역 선(3q)을 통해 유동화된 입상 물질을 구동시킨다. 도 4b를 참조하면, 제1 실시예의 대안적인 흐름 구성에서, 하역은 내부 펌프(3c)에 의해 구동된다. 하역 선(3 q)은 내부 펌프(3c)에 연결된다. 하역 선(3q)은 추가적인 하역 제어 밸브(3q'')를 포함한다. 하역 제어 밸브 (3q') 및 추가 하역 제어 밸브(3q'')는, 각각 내부 펌프(3c)의 상류 및 하류에 배치된다. 또한, 추가 입상 물질 제어 밸브(3c'')가 제공된다. 입상 물질 제어 밸브(3c') 및 추가 입상 물질 제어 밸브(3c'')는, 각각 내부 펌프 (3c)의 상류 및 하류에 배치된다. 흐름 구성의 다른 요소는, 도 4b에 도시된 구성 및 도 4a를 참조하여 위에 설 명된 것과 동일하다. 작업에서, 입상 물질 제어 밸브(3c'), 추가 입상 물질 제어 밸브(3c'') 및 선택적으로 추가 유체 제어 밸브 (3n'')는, 입상 물질의 제거 중에 개방된다. 하역 제어 밸브(3q') 및 추가 하역 제어 밸브(3q'')는, 입상 물질의 제거 동안 폐쇄된다. 이후, 내부 펌프(3c)는, 입상 물질 제어 밸브(3c') 및 추가 입상 물질 제어 밸브(3 c'')를 포함하는 흐름 라인을 통해, 제거된 입상 물질을 흡입 헤드(3b)로부터 탱크(3e) 내로 펌핑한다. 하역 동 안, 입상 물질 제어 밸브(3c'), 추가 입상 물질 제어 밸브(3c'') 및 추가 유체 제어 밸브(3n'')가 폐쇄된다. 하 역 제어 밸브(3q')는 하역 중에 개방된다. 또한, 유체 제어 밸브(3n')가 개방되어, 펌프(3n)에 의해 구동되는 가압된 유체가 탱크(3e) 내의 입상 물질을 유동화하도록 할 수 있다. 결과적으로, 유동화된 입상 물질은, 내부 펌프(3c)에 의해 가해진 흡입에 의해 구동되어, 탱크(3e)로부터 하역된다. 추가적으로 또는 대안적으로, 오버플 로 제어 밸브(3f')는 하역 중에 폐쇄될 수 있다. 오버플로 제어 밸브(3f')를 닫힌 상태로 유지함으로써, 가압된 유체에 의해 구동되는 탱크(3e) 내에 과압력이 발생할 수 있다. 과압력은 유동화된 입상 물질의 하역을 더 구동 한다. 도 5a에 개략적으로 도시된 것과 같은 본 발명의 제2 실시예에 따르면, 준설 시스템은, 준설 로봇을 도킹 스 테이션에 연결하는 엄빌리컬 라인을 포함한다. 엄빌리컬 라인은, 제거된 입상 물질을 준설 로봇으 로부터 도킹 스테이션으로 하역하기 위한 신축성 있는 튜브를 포함한다. 유리하게는, 엄빌리컬 라인을 활용 함으로써, 준설 로봇은 연속적으로 작동할 수 있으며, 대량의 입상 물질을 중단 없이 제거할 수 있다. 입상 물 질. 도 5b에 도시된 바와 같이, 엄빌리컬 라인은, 도킹 스테이션으로부터 준설 로봇에 전력을 공급하기 위 한 송전선을 포함할 수 있다. 유리하게는, 송전선을 활용함으로써 배터리 팩을 생략할 수 있어 준설 로봇의 무 게를 줄일 수 있다. 엄빌리컬 라인은, 도킹 스테이션과 준설 로봇 사이에서 데이터 및 명령 신호를 전 송 및 수신하기 위해, 광섬유 케이블과 같은 통신 선을 더 포함할 수 있다. 엄빌리컬 라인은, 로봇 암(3d)의 유압 작업 구동, 접이식 전단 요소(3i)의 유압 전개 및/또는 입상 물질 제어 밸브(3c'), 오버플로 제어 밸브 (3f'), 유체 제어 밸브(3n') 및/또는 하역 제어 밸브(3q')와 같은 준설 로봇의 하나 이상의 제어 밸브의 유 압 작업을 위한 하나 이상의 유압 선을 더 포함할 수 있다. 엄빌리컬 라인은, 해제 시스템(3j)에 압축된 가 스를 제공하기 위한 압축된 가스 선을 더 포함할 수 있다. 엄빌리컬 라인은, 준설 로봇에 윤활제를 제공 하기 위한 윤활 선을 더 포함할 수 있다. 윤활제는 펌프, 제어 밸브 또는 로봇 암과 같은 준설 로봇의 하나 이상의 이동 요소에 공급될 수 있다. 이 실시예에서, 라이저 파이프는 대응되는 하나 이상의 유압 선, 압축 된 가스 선 및/또는 윤활 선을 포함할 수 있다. 제2 실시예에서, 이송 수단(5d)은, 라이저 파이프를 통해 흡입 헤드(3b)로부터 제거된 입상 물질의 연속적인 하역을 위해, 적어도 하나의 부스터 펌프를 더 포함할 수 있다. 부스터 펌프는 도킹 스테이션에 포함될 수 있고, 육지에 위치하거나 선박에 장착될 수 있다. 유리하게는, 추가 부스터 펌프를 활용함으로써, 제거된 입상 물질이 더 깊은 유체 깊이로부터 하역될 수 있다. 제2 실시예에서, 준설 시스템은 엄빌리컬 라인을 감고 풀기 위한 릴(6a)을 포함할 수 있다. 릴(6a)은, 준설 로봇(도 5a에 도시됨), 별도의 프레임(도 5a에 도시됨) 또는 도킹 스테이션 상에 장착될 수 있다. 준설 로봇이 수중용 드론을 포함하는 경우, 릴(6a)은 도킹 스테이션 상에 장착되는 것이 바람직하다. 별도의 프레임은 하부 표면에 고정될 수 있다. 대안적으로, 엄빌리컬 라인은 하부 표면에 감겨지지 않은 상태로 배 치될 수 있다. 마지막으로, 엄빌리컬 라인은 도킹 스테이션에 결합하기 위한 커플링(6b)을 포함할 수 있 다. 커플링은, 엄빌리컬 라인과 도킹 스테이션 사이에 유체-방지 연결을 제공한다. 커플링(6b)은, 신축성 있는 튜브를 위한 연결 요소를 포함할 수 있다. 추가적으로, 커플링(6b)은 송전선, 통신 선, 하나 이상의 유압 선, 압축된 가스 선 및/또는 윤활 선을 위한 연결 요소를 포함할 수 있다. 커플링에는, 고장 표시기가 제공되어 원격 작업자에게 연결 고장을 알릴 수 있다. 커플링은, 도킹 스테이션으로의 제거된 입상 물질의 흐름을 제 어하기 위한 제어 밸브를 포함할 수 있다. 제1 실시예 및 제2 실시예에 따르면, 준설 시스템은 하나 이상의 준설 로봇을 포함할 수 있다. 작업에서, 하 나 이상의 준설 로봇은 하나 이상의 준설 위치 사이를 왕복할 수 있다. 유리하게는, 이에 따라 준설 시스템은 효율적으로 넓은 영역을 커버할 수 있고 높은 입상 물질 제거율이 달성될 수 있다. 이 구성은, 항만이나 해상 교통을 위한 수로와 같이 입상 물질을 자주 제거해야 하는 영역에 특히 유리할 수 있다. 추가적으로 또는 대안 적으로, 준설 시스템은, 도 6에 개략적으로 도시된 바와 같이, 다수의 도킹 스테이션 및 하나 이상의 준설 로봇을 포함할 수 있다. 다수의 도킹 스테이션은 하나의 라이저 파이프에 연결될 수 있다. 연결 파이 프는 다수의 도킹 스테이션을 연결할 수 있다. 하역된 입상 물질은, 연결 파이프를 통해 도킹 스테이션 으로부터 라이저 파이프로 운반된다. 연결 파이프는, 라이저 파이프로부터 도킹 스테이션으로 전력을 공급하기 위한 송전선을 포함한다. 연결 파이프는, 통신 선, 하나 이상의 유압 선, 압축된 가스 선및/또는 윤활 선을 더 포함할 수 있다. 대안적으로, 여러 개의 라이저 파이프가 제공될 수 있으며, 연결 파이프에 의해 각각의 라이저 파이프 에 연결된 하나 이상의 도킹 스테이션이 제공될 수 있다. 하나 이상의 준설 로봇은, 특정 도킹 스테이 션 또는 임의의 도킹 스테이션에서 도킹되도록 구성될 수 있다. 각각의 준설 로봇의 이동 및 입상 물질의 제 거를 제어하기 위해, 중앙 제어 시스템이 제공될 수 있다. 유리하게는, 다수의 도킹 스테이션을 가지는 구성은, 큰 항만, 해상 교통을 위한 연장된 길이의 수로 또는 큰 해저 채굴 작업과 같은 넓은 준설 지역을 효율적으로 커버할 수 있다. 더 유리하게는, 여러 도킹 스테이션을 연결함으로써, 표면에서 필요한 입상 물질의 추출 지점 이 줄어들 수 있으므로, 시스템이 더 효율적이게 된다. 본 발명에 따른 준설 시스템은, 해저 채굴, 해안 보강 또는 인공 반도 또는 인공 섬의 건설, 침수되거나 부분적 으로 침수된 장비의 고정, 연안 케이블의 부설을 위한 도랑의 발굴, 좌초된 선박 주위의 입상 물질 준설, 댐으 로부터 또는 인공 베이슨으로부터 쌓인 입상 물질의 제거 또는 수로, 강, 호수, 항구 또는 해상 항로와 같은 물 길로부터 입상 물질 제거를 위해 사용될 수 있다. 입상 물질을 제거하기 위한 방법은, 본 발명에 따라 준설 로봇, 도킹 스테이션 및 라이저 파이프를 포 함하는 준설 시스템을 제공하는 단계, 준설 로봇을 사용하여 입상 물질을 제거하는 단계, 제거된 입상 물 질을 준설 로봇으로부터 도킹 스테이션으로 하역하는 단계; 및 제거된 입상 물질을 라이저 파이프를 통해 도킹 스테이션으로부터 원격 위치로 이송하는 단계를 포함한다. 방법은, 적어도 하나의 준설 시스템이 준설 작업을 실행하도록 지시하는 단계를 더 포함할 수 있다. 적어도 하나의 준설 시스템에 지시하는 단계는, 반자동적으로 또는 자동적으로 원격 제어에 의해 준설 작업을 실행하도록 준설 로봇의 제어 유닛(3g)에 지시 하는 단계를 포함할 수 있다. 원격 제어에 의해 준설 작업을 수행할 때, 육상 기반 또는 선박 기반의 작업자는 원격으로 준설 로봇의 작업을 제어할 수 있다. 수중 포지셔닝 시스템 및/또는 적어도 하나의 센서는, 준설 로봇을 원격으로 작업시키는데 필 요한 정보를 작업자에게 제공할 수 있다. 좌초된 선박 주변의 준설 작업과 같은 복잡한 작업에는, 원격 제어에 의해 준설 작업을 실행하는 것이 유리할 수 있다. 반자동적으로 또는 자동적으로 준설 작업을 실행할 때, 지시 는 통신 선을 통해 제어 장치(3g)에 업로드될 수 있다. 바람직하게는, 준설 로봇은 반자동적으로 또는 자동 적으로 준설 작업을 수행하도록 구성된 기계 지능을 포함한다. 이에 따라, 준설 로봇은 하부 표면을 통해 준 설 위치로 이동할 수 있고, 작업자 입력을 최소화하거나 작업자 입력을 요구하지 않으면서, 준설 위치에서 입상 물질을 제거하고 도킹 스테이션으로 돌아와 입상 물질을 하역할 수 있다. 수중 포지셔닝 시스템 및/또는 적어도 하나의 센서로부터의 데이터는, 작업을 검증하기 위해 제어 유닛(3g)에 의해 사용될 수 있고/있거나, 추후 사용 을 위해 원격 스테이션에 다운로드될 수 있다. 원격 스테이션은 육상 기반이거나 선박 기반일 수 있다. 준설 작업을 실행하는 것은, 제한된 시간 간격 동안 연속적으로 또는 일정한 시간 간격으로 준설 작업을 실행하 는 것을 포함할 수 있다. 준설 작업은, 기설정된 준설 영역 및/또는 작업자 제어된 영역을 더 커버할 수 있다. 일 방법에 따르면, 하나 이상의 준설 로봇은 다수의 도킹 스테이션 사이를 일정한 간격으로 또는 연속적 으로 왕복할 수 있다. 도킹 스테이션은 서로 어느 정도 거리를 두고 배치될 수 있다. 이러한 방법은, 항만, 수로 또는 항로에서 유리할 수 있다. 항구의 각각의 베이슨 내에는, 도킹 스테이션이 제공될 수 있다. 수로 에는, 도킹 스테이션이 고정된 간격을 가지고 제공될 수 있다. 하나 이상의 준설 로봇은, 하나의 도킹 스 테이션에서 다음 도킹 스테이션으로 자동적으로 또는 반자동적으로 이동할 수 있으며, 도킹 스테이션 의 영역 또는 그 사이의 영역에 축적된 입상 물질을 제거한다. 이에 따라, 해상 교통을 방해하지 않는 상태에서, 넓은 지역에 걸쳐 축적된 입상 물질을 정기적으로 또는 연속적으로 제거할 수 있다. 대안적인 방법에 따르면, 하나 이상의 준설 로봇은 준설 위치와 도킹 스테이션 사이를 왕복할 수 있다. 이러한 방법은, 제 한된 지역에서 대량의 입상 물질을 제거해야 하는 해저 채굴 작업, 해안 보강 또는 인공 섬이나 반도 생성에 유 리할 수 있다. 도 7은 위에서 설명된 실시예를 도시하지만, 하나의 라이저 파이프에 연결된 각각의 도킹 스테이션이, 여 러 개의 준설 로봇이 하나의 도킹 스테이션에 연결될 수 있도록 하는 여러 개의 도킹 커플링(4a)을 포함 할 수 있다. 도 7의 해결책, 여러 준설 로봇이 하나의 도킹 스테이션에서 동시에 입상 물질을 하역 및/또는 충전할 수 있도록 한다. 도 6에 도시된 것과 같이, 여러 개의 도킹 스테이션이 여러 개의 도킹 커플링(4a)을 포 함할 수도 있다. 시스템은, 단일 도킹 커플링(4a)을 갖는 도킹 스테이션과 여러 개의 도킹 커플링(4a)을 갖 는 도킹 스테이션의 조합을 포함할 수도 있다. 청구항은, 준설 로봇으로부터 제거된 입상 물질을 하역하기 위한 도킹 스테이션이, 하부 표면에 부착되거 나 하부 표면에 대해 부착 및 고정된다는 것을 주장한다. 하부 표면에는, 인공 덕트 및 수로의 하부도 포함되며, 하부 표면이라는 용어에는 벽, 계단, 레지(ledge), 선반 모양의 지층, 제방, 강둑, 언덕, 해저면, 부 두, 항구, 기둥, 기반 등으로 불릴 수 있는 표면이 포함될 수 있다. 위와 같이 표현된 하부 표면은, 파도, 해류, 움직임, 조수 등의 요소에 영향을 받지 않는 고정되고 영구적인 위치를 제공한다. 도면 8a 내지 8f는, 도킹 스테이션이 위치되는 장소 역할을 할 수 있는 자연적이거나 인공적인 다양한 구조물을 도시한다. 도 8a는 해저면을 도시하고, 도 8b는 선반 모양의 지층 또는 레지을 도시하며, 도 8c는 측면 구조물 상의 브래킷을 도시하고, 도 8e는 부두 또는 채널의 벽을 도시하며, 도 8f는 측면 구조물에서 수면 위의 부착물을 도시한다. \"하부 표면에 부착\" 된다는 표현은, 이러한 모든 시나리오를 포괄하도록 의 도되었다."}
{"patent_id": "10-2024-7017090", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1a는, 바텀 크롤러(bottom crawler)를 포함하는 제1 실시예에 따른 준설 시스템을 개략적으로 도시한다. 도 1b는, 수중용 드론(submersible drone)을 포함하는 제1 실시예에 따른 대안적인 준설 시스템을 개략적으로 도시한다. 도2는, 본 발명에 따른 도킹 스테이션을 개략적으로 도시한다. 도 3a는, 본 발명에 따른 준설 로봇의 측면도를 개략적으로 도시한다. 도 3b는, 본 발명에 따른 준설 로봇의 정면도를 개략적으로 도시한다. 도 4a는, 본 발명에 따른 하나의 흐름 구성(flow configuration)을 개략적으로 도시한다. 도 4b는, 본 발명에 따른 다른 하나의 흐름 구성을 개략적으로 도시한다. 도 5a는, 엄빌리컬 라인(umbilical line)을 포함하는 제2 실시예에 따른 준설 시스템을 개략적으로 도시한다. 도 5b는, 송전선(power line)을 포함하는 엄빌리컬 라인을 포함하는 제2 실시예에 따른 대안적인 준설 시스템을 개략적으로 도시한다. 도 6은, 본 발명에 따른 복수의 도킹 스테이션을 가지는 준설 시스템을 개략적으로 도시한다. 도 7은, 본 발명에 따른 여러 개의 도킹 커플링을 가지는 준설 시스템을 개략적으로 도시한다."}
