{"patent_id": "10-2022-0087210", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0010640", "출원번호": "10-2022-0087210", "발명의 명칭": "스마트 팩토리를 위한 광학 시스템 관리 프로그램 및 광학 시스템 관리 방법", "출원인": "에이아이루덴스 주식회사", "발명자": "김정규"}}
{"patent_id": "10-2022-0087210", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "광학 시스템으로부터 수십된 영상 데이터를 수집하는 수집 단계;수집된 영상 데이터를 가공하는 데이터 가공 단계; 및수집된 영상 데이터를 표시하는 표시 단계;를 포함하고,상기 표시 단계는,실시간으로 수집된 영상 데이터와 불량 제품을 촬영한 화상을 병렬적으로 동시에 표시하는 단계인,컴퓨터 판독가능 저장 매체에 저장된 광학 시스템 관리 프로그램."}
{"patent_id": "10-2022-0087210", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,입력 신호에 따라서 광학 시스템의 설정값이 변경되는 단계인 조작 단계;를 더 포함하는,컴퓨터 판독가능 저장 매체에 저장된 광학 시스템 관리 프로그램."}
{"patent_id": "10-2022-0087210", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 조작 단계는,광학 시스템의 조리개, 셔터스티드, 조명 위치 및 렌즈 종류 중 적어도 하나를 설정할 수 있는 단계인,컴퓨터 판독가능 저장 매체에 저장된 광학 시스템 관리 프로그램."}
{"patent_id": "10-2022-0087210", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 표시 단계는,불량 제품을 촬영한 화상을 미리 정해진 배율로 조정하여 표시하는 단계인,컴퓨터 판독가능 저장 매체에 저장된 광학 시스템 관리 프로그램."}
{"patent_id": "10-2022-0087210", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 표시 단계는,이전 제품의 불량 부위를 현재 제품의 불량 부위와 오버랩되게 표시하는 단계인,컴퓨터 판독가능 저장 매체에 저장된 광학 시스템 관리 프로그램.공개특허 10-2024-0010640-3-청구항 6 제5항에 있어서,상기 표시 단계는,이전 제품의 불량 부위와 현재 제품의 불량 부위의 선명도를 다르게 표시하는 단계인,컴퓨터 판독가능 저장 매체에 저장된 광학 시스템 관리 프로그램."}
{"patent_id": "10-2022-0087210", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "광학 시스템으로부터 수십된 영상 데이터를 수집하는 수집 단계;수집된 영상 데이터를 가공하는 데이터 가공 단계; 및수집된 영상 데이터를 표시하는 표시 단계;를 포함하고,상기 표시 단계는,실시간으로 수집된 영상 데이터와 불량 제품을 촬영한 화상을 병렬적으로 동시에 표시하는 단계인,광학 시스템 관리 방법."}
{"patent_id": "10-2022-0087210", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 헬스정보 검색 시스템은, 헬스와 관련된 정보를 검색하고자 하는 사용자의 검색 정 보를 사용자 단말기로부터 수집하는 수집 모듈; 상기 검색 정보를 자연어 처리하여 산출된 분석 정보를 기초로 상기 검색 정보에 대응되는 헬스 정보로서 결과 정보를 산출하는 검색 모듈; 및 상기 결과 정보를 게시 정보와 상품 정보로 구분하여 사용자의 단말기에 각각의 정보가 개별적으로 동시에 표시될 수 있는 인터페이스를 산출하 는 인터페이스 모듈;을 포함하고, 상기 검색 모듈은, 인공지능을 이용하여 생성된 분석 모델을 이용하여 분석 정 보 및 결과 정보를 산출할 수 있다."}
{"patent_id": "10-2022-0087210", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 스마트 팩토리를 효율적으로 운영하기 위해서 스마트 팩토리에 설치되는 광학 시스템 관리 프로그램 및 광학 시스템 관리 방법에 대한 것이다."}
{"patent_id": "10-2022-0087210", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "스마트 팩토리는 설계·개발, 제조 및 유통·물류 등 생산과정에 디지털 자동화 솔루션이 결합된 정보통신기술 (ICT)을 적용하여 생산성, 품질, 고객만족도를 향상시키는 지능형 생산공장을 말한다. 스마트 팩토리는 다양한 생산 공정들을 자동화하였지만, 가장 제품 생산률 증대에 효과를 주는 공정은 불량품 체크, 관리 및 공정 간의 자재 이동 관리이다. 기존에는 불량품을 체크하기 위해서 사람이 직접하거나, 촬영 이미지를 활용하여 불량품을 판단하고 있으나, 기존의 방법으로는 정확도가 다소 낮은 문제가 존재하였다. 구체적으로 기존에는 불량품을 검 지하는데 적절한 이미지를 촬영하는 광학 시스템의 셋팅을 수동, TRAIAL-ERROR 방식으로 진행하여야 했다. 다만, 이러한 방식은 광학 시스템의 하드웨어적인 구성, 촬영 방법 및 조명 상태를 계속해서 변경하여햐 하기 때문에 많은 인력과 시간이 투여되는 문제가 존재하였다. 이를 해결하기 위해, 자동 광학 시스템을 개발하여, 운영하고 있으나, 이러한 광학 시스템을 효과적으로 통제, 제어 및 모니터링하는 프로그램이 부재하여, 효과적인 광학 시스템 관리가 어려운 문제가 존재하였다."}
{"patent_id": "10-2022-0087210", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상술한 문제점을 해결하기 위한 것으로, 스마트 팩토리용 광학 시스템을 효과적으로 관리, 운영할 수 있는 광학 시스템 관리 프로그램 및 광학 시스템 관리 방법을 제공하고자 한다. 다만, 본 실시예가 이루고자 하는 기술적 과제는 상기된 바와 같은 기술적 과제들로 한정되지 않으며, 또 다른 기술적 과제들이 존재할 수 있다."}
{"patent_id": "10-2022-0087210", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 컴퓨터 판독가능 저장 매체에 저장된 광학 시스템 관리 프로그램은, 광학 시스템으 로부터 수십된 영상 데이터를 수집하는 수집 단계; 수집된 영상 데이터를 가공하는 데이터 가공 단계; 및 수집 된 영상 데이터를 표시하는 표시 단계;를 포함하고, 상기 표시 단계는, 실시간으로 수집된 영상 데이터와 불량 제품을 촬영한 화상을 병렬적으로 동시에 표시하는 단계일 수 있다. 또한, 입력 신호에 따라서 광학 시스템의 설정값이 변경되는 단계인 조작 단계;를 더 포함할 수 있다. 또한, 상기 조작 단계는, 광학 시스템의 조리개, 셔터스티드, 조명 위치 및 렌즈 종류 중 적어도 하나를 설정할 수 있는 단계일 수 있다. 또한, 상기 표시 단계는, 불량 제품을 촬영한 화상을 미리 정해진 배율로 조정하여 표시하는 단계일 수 있다. 또한, 상기 표시 단계는, 이전 제품의 불량 부위를 현재 제품의 불량 부위와 오버랩되게 표시하는 단계일 수 있 다. 또한, 상기 표시 단계는, 이전 제품의 불량 부위와 현재 제품의 불량 부위의 선명도를 다르게 표시하는 단계일 수 있다. 본 발명의 일 실시예에 따른 광학 시스템 관리 방법은, 광학 시스템으로부터 수십된 영상 데이터를 수집하는 수 집 단계; 수집된 영상 데이터를 가공하는 데이터 가공 단계; 및 수집된 영상 데이터를 표시하는 표시 단계;를 포함하고, 상기 표시 단계는, 실시간으로 수집된 영상 데이터와 불량 제품을 촬영한 화상을 병렬적으로 동시에 표시하는 단계일 수 있다."}
{"patent_id": "10-2022-0087210", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 컴퓨터 판독가능 저장 매체에 저장된 광학 시스템 관리 프로그램은, 스마트 팩토리의 관리 효 율성을 증대시킬 수 있다. 또한, 사용의 편의성을 극대화할 수 있다. 또한, 비용 절감할 수 있다."}
{"patent_id": "10-2022-0087210", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "다만, 본 발명의 효과가 상술한 효과들로 제한되는 것은 아니며, 언급되지 아니한 효과들은 본 명세서 및 첨부"}
{"patent_id": "10-2022-0087210", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 3, "content": "된 도면으로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확히 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0087210", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 도면을 참조하여 본 발명의 구체적인 실시예를 상세하게 설명한다. 다만, 본 발명의 사상은 제시되 는 실시예에 제한되지 아니하고, 본 발명의 사상을 이해하는 당업자는 동일한 사상의 범위 내에서 다른 구성요 소를 추가, 변경, 삭제 등을 통하여, 퇴보적인 다른 발명이나 본 발명 사상의 범위 내에 포함되는 다른 실시예 를 용이하게 제안할 수 있을 것이나, 이 또한 본원 발명 사상 범위 내에 포함된다고 할 것이다. 본 발명의 일 실시예에 따른 광학 시스템 관리 프로그램은 컴퓨팅 시스템상에서 구현될 수 있다. 컴퓨터 판독 가능 저장 매체에 저장된 컴퓨터 프로그램이 컴퓨팅 시스템 상에 설치되어, 상기 데이터 백업 방법 이 구현될 수 있다. 본 발명에서 언급하는 컴퓨팅 시스템은 정보 처리 연산을 처리할 수 있는 장치를 의미할 수 있다. 일례로, 컴퓨팅 장치는 데스크탑 컴퓨터, 노트북, 스마트폰, PDA(Personal Digital Assistants), PMP(Portable Multimedia Player), 휴대용 단말기 등이 포함되는 이동 단말기 및/또는 스마트 TV 등이 포함될 수 있다. 다만, 이에 한정하는 것은 아니고, 상기 광학 시스템 관리 프로그램이 클라우드 형태로 상기 컴퓨팅 시스템에 제공되어, 컴퓨팅 시스템에서 광학 시스템 관리 방법에 구현될 수 있다. 컴퓨팅 시스템을 별도의 서버를 운영할 수 있으며, 광학 시스템 관리 프로그램이 구현되는데 필요한 정보들을 수집하고 저장하고, 관리할 수 있다. 본 발명에서 언급하는 서버는 서버의 서버 환경을 수행하기 위한 다른 구성들이 포함될 수도 있다. 서버는 임의 의 형태의 장치는 모두 포함할 수 있다. 일례로, 서버는 디지털 기기로서, 랩탑 컴퓨터, 노트북 컴퓨터, 데스크톱 컴퓨터, 웹 패드, 이동 전화기와 같이 프로세서를 탑재하고 메모리를 구비한 연산 능력을 갖춘 디지털 기기일 수 있다. 일례로, 서버는 웹 서버일 수 있다. 다만, 이에 한정하지 않고, 서버의 종류는 통상의 기술자에게 자명한 수준 에서 다양하게 변경 가능하다. 도 1은 본 발명의 일 실시예에 따른 광학 시스템 관리 프로그램의 구성도이다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 광학 시스템 관리 프로그램은 모니터링 모듈, 경고 모 듈, 조작 모듈, 표시 모듈 및 저장 모듈로서 이루어질 수 있다. 모니터링 모듈은 광학 시스템으로부터 수십된 영상 데이터를 수집할 수 있다. 데이터를 실시간으로 수집될 수도 있고, 소정 간격의 시간을 두고 수집될 수 있다. 이를 위해, 모니터링 모듈은 광학 시스템과 유/무선으로 통신 가능하게 연결될 수 있다. 본 발명에서 언급하는 온라인 네트워크라 함은 유선 공중망, 무선 이동 통신망, 또는 휴대 인터넷 등과 통합된 코어 망일 수도 있고, TCP/IP 프로토콜 및 그 상위 계층에 존재하는 여러 서비스, 즉 HTTP(Hyper Text Transfer Protocol), HTTPS(Hyper Text Transfer Protocol Secure), Telnet, FTP(File Transfer Protocol), DNS(Domain Name System), SMTP(Simple Mail Transfer Protocol) 등을 제공하는 전 세계적인 개방형 컴퓨터 네 트워크 구조를 의미할 수 있으며, 이러한 예에 한정하지 않고 다양한 형태로 데이터를 송수신할 수 있는 데이터 통신망을 포괄적으로 의미하는 것이다. 일례로, 통신 모듈은 셀룰러 모듈, WiFi 모듈, 블루투스 모듈, GNSS 모듈, NFC 모듈, RF 모듈, 5G 모듈, LTE 모 듈, NB-IOT 모듈 및/또는 LoRa 모듈을 포함할 수 있다. 다만, 이에 한정하지 않고, 통신 모듈이 포함하는 모듈은 통상의 기술자에게 자명한 수준에서 다양하게 변형 가 능하다. 모니터링 모듈은 광학 시스템 뿐만 아니라, 스마트 팩토리에 설치된 센서 모듈로부터 실시간적으로 공장 내 환 경 정보를 수집할 수 있다. 센서 모듈은, 예를 들면, 물리량을 계측하거나 전자 장치의 작동 상태를 감지하여, 계측 또는 감지된 정보를 전 기 신호로 변환할 수 있다. 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가 속도 센서, 그립 센서, 근접 센서, 컬러 센서(예: RGB(red, green, blue) 센서), 생체 센서, 온/습도 센서, 조 도 센서, 또는 UV(ultra violet) 센서 중의 적어도 하나를 포함할 수 있다. 추가적으로 또는 대체적으로, 센서 모듈은, 예를 들면, 후각 센서, 일렉트로마이오그라피 센서, 일렉트로엔씨팔로그램 센서, 일렉트로카디오그램 센서, IR(infrared) 센서, 홍채 센서 또는 지문 센서를 포함할 수 있다. 센서 모듈은 그 안에 속한 적어도 하나 이상의 센서들을 제어하기 위한 제어 회로를 더 포함할 수 있다. 어떤 실시예에서는, 전자 장치는 프로세서의일부로서 또는 별도로, 센서 모듈을 제어하도록 구성된 프로세서를 더 포함하여, 프로세서가 슬립(sleep) 상태 에 있는 동안, 센서 모듈을 제어할 수 있다. 저장 모듈은 광학 시스템 관리 방법이 구현되는데 필요한 정보들을 저장할 수 있다. 일례로, 저장 모듈은 내장 메모리 및/또는 외장 메모리를 포함할 수 있다. 일례로, 내장 메모리는 휘발성 메모리(예: DRAM, SRAM, 또는 SDRAM 등), 비휘발성 메모리(예: OTPROM(one time programmable ROM), PROM, EPROM, EEPROM, mask ROM, flash ROM, 플래시 메모리, 하드 드라이브, 또는 솔리드 스테이트 드라이브 (SSD) 중 적어도 하나를 포함할 수 있다 외장 메모리는 플래시 드라이브(flash drive), 예를 들면, CF(compact flash), SD(secure digital), Micro-SD, Mini-SD, xD(extreme digital), MMC(multi-media card) 또는 메모리 스틱 등을 포함할 수 있다. 저장 모듈에는 컴퓨팅 시스템이 동작, 운영되면서 발생되는 데이터들이 저장될 수 있다. 경고 모듈은 수집된 영상 데이터를 기초로 불량 제품이 존재하는지 여부를 판단하는 모듈일 수 있다. 이를 위해서, 영상을 기초로 불량 제품을 분석하는 분석 모델이 설치되어 있을 수 있다. 일례로, 분석 모델은 딥 러닝(deep learning)을 통해서 생성될 수 있다. 다만, 이에 한정하지 않고, 분석 모델의 생성 방법은 통상의 기술자에게 자명한 수준에서 다양하게 변형 가능하 다. 조작 모듈은 광학 시스템을 수동으로 조작할 수 있는 기능을 제공할 수 있다. 인터페이스를 통해 사용자가 광학 시스템을 조정하는 신호를 생성하면, 조작 모듈은 해당 신호를 광학 시스템으 로 전달하여, 광학 시스템을 실시간으로 제어할 수 있다. 인공지능에 의해 최적의 환경 설정을 하였지만, 사용자의 경험과 직감을 통해 더욱 좋은 광학 시스템 환경을 셋 팅할 수 있기 때문에, 수동 제어 기능이 필수적일 수 있다. 도 2는 본 발명의 일 실시예에 따른 광학 시스템 관리 프로그램이 제공하는 인터페이스를 도시한 도면이다. 도 2를 참조하면, 표시 모듈은 경고 모듈이 분석한 불량 제품에 대한 이미지를 컴퓨팅 장치의 디스플레이에 표 시될 수 있는 인터페이스를 생성할 수 있다. 표시 모듈은 광학 시스템을 구현하는데 필요한 필요한 환경설정을 지정하고, 변경할 수 있는 인터페이스를 산출 할 수 있다. 해당 인터페이스(T11, T12)는 컴퓨팅 시스템의 디스플레이부 상에 표시될 수 있다. 일례로, 표시 모듈에서 생성되는 인터페이스에는 현재 실시간으로 광학 시스템에서 수집되는 영상(X10) 및 불량 제품으로 인식된 화상(X11)이 표시될 수 있다. 상기 인터페이스에는 실시간으로 수집된 영상 데이터와 불량 제품을 촬영한 화상을 병렬적으로 동시에 표시될 수 있다. 여기서, 불량 제품 이미지에는 이전 제품의 불량 부위를 현재 제품의 불량 부위와 오버랩되게 표시할 수 있다. 그로써, 사용자는 어느 부분에 계속적으로 제품 어느 곳에 불량이 발생하는지는 손쉽게 파악할 수 있다. 또한, 인터페이스에는 이전 제품의 불량 부위(P11)와 현재 제품의 불량 부위(P12)의 선명도를 다르게 표시할 수 있다. 일례로, 인터페이스에는 이전 제품의 불량 부위보다 현재 제품의 불량 부위를 더욱 선명하게 표시될 수 있다. 인터페이스에는 광학 시스템의 설정된 상태가 표시될 수 있고, 광학 시스템의 설정을 수동으로 변경할 수 있는 조작이미지들이 표시될 수 있다. 본 발명의 일 실시예에 따른 광학 시스템 관리 방법은, 광학 시스템으로부터 수십된 영상 데이터를 수집하는 수 집 단계, 수집된 영상 데이터를 가공하는 데이터 가공 단계 및 수집된 영상 데이터를 표시하는 표시 단계를 포 함할 수 있다. 여기서, 상기 표시 단계는 실시간으로 수집된 영상 데이터와 불량 제품을 촬영한 화상을 병렬적으로 동시에 표 시하는 단계일 수 있다. 또한, 상기 광학 시스템 관리 방법은, 입력 신호에 따라서 광학 시스템의 설정값이 변경되는 단계인 조작 단계 를 더 포함할 수 있다. 또한, 상기 조작 단계는, 광학 시스템의 조리개, 셔터스티드, 조명 위치 및 렌즈 종류 중 적어도 하나를 설정할 수 있는 단계일 수 있다. 또한, 상기 표시 단계는, 불량 제품을 촬영한 화상을 미리 정해진 배율로 조정하여 표시하는 단계일 수 있다. 또한, 상기 표시 단계는, 이전 제품의 불량 부위를 현재 제품의 불량 부위와 오버랩되게 표시하는 단계일 수 있 다. 또한, 상기 표시 단계는, 이전 제품의 불량 부위와 현재 제품의 불량 부위의 선명도를 다르게 표시하는 단계일 수 있다. 첨부된 도면은 본 발명의 기술적 사상을 보다 명확하게 표현하기 위해, 본 발명의 기술적 사상과 관련성이 없거 나 떨어지는 구성에 대해서는 간략하게 표현하거나 생략하였다. 상기에서는 본 발명에 따른 실시예를 기준으로 본 발명의 구성과 특징을 설명하였으나 본 발명은 이에 한정되지"}
{"patent_id": "10-2022-0087210", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "않으며, 본 발명의 사상과 범위 내에서 다양하게 변경 또는 변형할 수 있음은 본 발명이 속하는 기술분야의 당 업자에게 명백한 것이며, 따라서 이와 같은 변경 또는 변형은 첨부된 특허청구범위에 속함을 밝혀둔다."}
{"patent_id": "10-2022-0087210", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 광학 시스템 관리 프로그램의 구성도 도 2는 본 발명의 일 실시예에 따른 광학 시스템 관리 프로그램이 제공하는 인터페이스를 도시한 도면"}
