{"patent_id": "10-2022-0010228", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0107073", "출원번호": "10-2022-0010228", "발명의 명칭": "발열량을 고려하여 차량에서의 통신을 제어하는 전자 장치, 및 방법", "출원인": "삼성전자주식회사", "발명자": "이유선"}}
{"patent_id": "10-2022-0010228", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "마스터 차량 및 적어도 하나의 슬레이브 차량이 참여하는 군집 주행에서, 상기 마스터 차량의 통신을 제어하는전자 장치에 있어서,이동 통신 방법에 따라 기지국을 통해 데이터를 송수신하는 이동 통신 모듈;다른 전자 장치와 D2D (Device-to-Device) 통신 방법으로 데이터를 송수신하는 D2D 통신 모듈; 및상기 D2D 통신 모듈을 이용하여, 상기 이동 통신 모듈이 상기 기지국과의 통신을 통해 수신한 데이터를 상기 적어도 하나의 슬레이브 차량에 전달하는 제어 모듈을 포함하되,상기 제어 모듈은,상기 이동 통신 모듈의 온도가 임계 온도 이상이면, 상기 적어도 하나의 슬레이브 차량 중 상기 기지국과의 통신을 위한 새로운 마스터 차량을 선택하는, 전자 장치."}
{"patent_id": "10-2022-0010228", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 새로운 마스터 차량이 선택됨에 따라 상기 마스터 차량은 슬레이브 역할을 수행하고,상기 제어 모듈은,상기 D2D 통신 모듈을 이용하여, 상기 마스터 차량이 필요로 하는 데이터의 요청을 상기 새로운 마스터 차량의전자 장치로 전송하는, 전자 장치."}
{"patent_id": "10-2022-0010228", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 D2D 통신 모듈은,상기 기지국으로부터 상기 적어도 하나의 슬레이브 차량으로 전송되는 신호의 성능 지표 값을 상기 적어도 하나의 슬레이브 차량으로부터 수신하고,상기 제어 모듈은,상기 수신된 성능 지표 값을 고려하여, 상기 적어도 하나의 슬레이브 차량 중 상기 새로운 마스터 차량을 선택하는, 전자 장치."}
{"patent_id": "10-2022-0010228", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 D2D 통신 모듈은,상기 적어도 하나의 슬레이브 차량에 장착된 이동 통신 모듈의 온도 정보를 상기 적어도 하나의 슬레이브 차량으로부터 수신하고,상기 제어 모듈은,상기 적어도 하나의 슬레이브 차량 중 상기 이동 통신 모듈의 온도가 가장 낮은 슬레이브 차량을 상기 새로운공개특허 10-2023-0107073-3-마스터 차량으로 선택하는, 전자 장치."}
{"patent_id": "10-2022-0010228", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 제어 모듈은,상기 적어도 하나의 슬레이브 차량 각각에 대해, 다른 차량과의 거리의 평균을 산출하고,상기 적어도 하나의 슬레이브 차량 중 상기 산출된 평균이 가장 작은 슬레이브 차량을 상기 새로운 마스터 차량으로 선택하는, 전자 장치."}
{"patent_id": "10-2022-0010228", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 제어 모듈은,상기 적어도 하나의 슬레이브 차량 각각에 대해, 상기 이동 통신 방법의 통신 차단 가능성을 판단하고,상기 적어도 하나의 슬레이브 차량 중 상기 통신 차단 가능성이 가장 낮은 슬레이브 차량을 상기 새로운 마스터차량으로 선택하는, 전자 장치."}
{"patent_id": "10-2022-0010228", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 통신 차단 가능성은,적어도 하나의 슬레이브 차량과 앞 차량 사이의 거리, 상기 앞 차량의 높이, 상기 적어도 하나의 슬레이브 차량에 장착된 안테나 모듈의 높이, 및 상기 적어도 하나의 슬레이브 차량의 이동 통신 방법을 위한 빔(beam)의 진행 방향 중 적어도 하나에 기반하여 판단되는, 전자 장치."}
{"patent_id": "10-2022-0010228", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 제어 모듈은,기지국으로부터 수신되는 데이터를 수신할 슬레이브 차량의 정보, 슬레이브 차량이 필요로 하는 데이터를 위해접속하여야 할 외부 장치의 주소 정보, 및 슬레이브 차량이 필요로 하는 데이터 중 기 수신한 데이터의 크기 정보 중 적어도 하나를 상기 새로운 마스터 차량으로 전송하는, 전자 장치."}
{"patent_id": "10-2022-0010228", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 제어 모듈은,상기 기지국을 통해 기 설정된 크기 이상의 데이터의 수신이 필요하면, 상기 적어도 하나의 슬레이브 차량 중상기 기지국과의 통신을 위한 새로운 마스터 차량을 선택하는, 전자 장치."}
{"patent_id": "10-2022-0010228", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "공개특허 10-2023-0107073-4-제9항에 있어서,상기 새로운 마스터 차량이 선택됨에 따라, 상기 새로운 마스터 차량과 기존 마스터 차량이 데이터의 송수신을위해 기지국과 통신하는, 전자 장치."}
{"patent_id": "10-2022-0010228", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서,상기 제어 모듈은,제 1 슬레이브 차량으로 전달하여야 하는 제 1 데이터의 우선 순위와 제 2 슬레이브 차량으로 전달하여야 하는제 2 데이터의 우선 순위를 비교하고,상기 제 1 데이터의 우선 순위가 상기 제 2 데이터의 우선 순위보다 높은 경우, 상기 D2D 통신 모듈을 이용하여상기 제 1 데이터를 상기 제 1 슬레이브 차량으로 전달한 후, 상기 제 2 데이터를 상기 제 2 슬레이브 차량으로전달하는, 전자 장치."}
{"patent_id": "10-2022-0010228", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "마스터 차량 및 적어도 하나의 슬레이브 차량이 참여하는 군집 주행에서, 상기 마스터 차량에 장착되어 동작하는 전자 장치에 의한 통신 제어 방법에 있어서,이동 통신 방법에 따라 기지국과 통신을 하여 데이터를 수신하는 단계;상기 기지국을 통해 수신한 데이터를 D2D (Device-to-Device) 통신 방법에 따라 상기 적어도 하나의 슬레이브차량의 전자 장치로 전송하는 단계; 및상기 이동 통신 방법을 위한 이동 통신 모듈의 온도가 임계 온도 이상이면, 상기 적어도 하나의 슬레이브 차량중 상기 기지국과의 통신을 위한 새로운 마스터 차량을 선택하는 단계를 포함하는, 통신 제어 방법."}
{"patent_id": "10-2022-0010228", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 새로운 마스터 차량이 선택됨에 따라 상기 마스터 차량은 슬레이브 역할을 수행하고,상기 통신 제어 방법은,상기 마스터 차량이 필요로 하는 데이터의 요청을, 상기 D2D 통신 방법에 따라 상기 새로운 마스터 차량의 전자장치로 전송하는 단계를 더 포함하는, 통신 제어 방법."}
{"patent_id": "10-2022-0010228", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12항에 있어서,상기 통신 제어 방법은,기지국으로부터 수신되는 데이터를 수신할 슬레이브 차량의 정보, 슬레이브 차량이 필요로 하는 데이터를 위해접속하여야 할 외부 장치의 주소 정보, 및 슬레이브 차량이 필요로 하는 데이터 중 기 수신한 데이터의 크기 정보 중 적어도 하나를 상기 새로운 마스터 차량으로 전송하는 단계를 더 포함하는, 통신 제어 방법."}
{"patent_id": "10-2022-0010228", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제12항의 방법을 컴퓨터에서 수행하기 위한 프로그램이 기록된 컴퓨터로 읽을 수 있는 기록매체.공개특허 10-2023-0107073-5-"}
{"patent_id": "10-2022-0010228", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "마스터 차량 및 적어도 하나의 슬레이브 차량이 참여하는 군집 주행에서, 마스터 차량의 통신을 제어하는 전자 장치에 있어서, 이동 통신 방법에 따라 기지국을 통해 데이터를 송수신하는 이동 통신 모듈; 다른 전자 장치와 D2D 통신 방법으로 데이터를 송수신하는 D2D 통신 모듈; 및 D2D 통신 모듈을 이용하여, 이동 통신 모듈이 기지국 과의 통신을 통해 수신한 데이터를 적어도 하나의 슬레이브 차량에 전달하는 제어 모듈을 포함하되, 제어 모듈은, 이동 통신 모듈의 온도가 임계 온도 이상이면, 적어도 하나의 슬레이브 차량 중 기지국과의 통신을 위한 새로운 마스터 차량을 선택하는, 일 실시예에 다른 전자 장치가 개시된다."}
{"patent_id": "10-2022-0010228", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 차량의 전장 분야에 관한 것으로서, 보다 구체적으로, 차량에 장착되어 차량에서의 통신을 제어하는 전자 장치 및 이에 의한 방법에 관한 것이다."}
{"patent_id": "10-2022-0010228", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "군집 주행이란, 복수의 차량들이 군집 대형을 형성하고, V2X(vehicle-to-everything) 통신을 통해 서로 정보를 교환하면서 주행하는 것을 의미한다. 군집 주행의 구현 방식에 따라, 선두 차량(또는 리더 차량)은 전문 드라이버가 운전하고, 추종 차량(또는 멤버 차량)은 레이더, 카메라 등의 센서를 통해 얻은 앞 차량과의 거리, 차선 정보, 및 앞 차량의 주행 경로 정보 등 을 이용하여 완전 자율주행 상태로 선두 차량을 추종할 수 있다. 물류 운송 시장의 급속한 성장과 함께 대형 화물차의 운행이 활발해지고 있는데, 물류 운송량 확대에 따른 비용 을 절감하고, 사고 안전성 및 생산성을 향상시키기 위해 군집 주행에 대한 연구가 진행되고 있다. 효율적인 군집 주행을 위해서는 군집 주행에 참여하는 차량들의 안정적인 통신이 요구되는데, 빠른 데이터의 송 수신이 가능한 28GHz 내지 100GHz의 밀리미터파(mmWave) 대역 기반의 5G 이동통신은 군집 주행의 요구 사항을 만족시켜 줄 것으로 예상된다. 밀리미터파(mmWave) 대역은 6GHz 이하의 기존 대역에 비해 이용할 수 있는 연속적인 넓은 대역폭이 존재하므로, 대용량의 데이터를 빠르게 송수신할 수 있으나, 대용량 데이터의 빠른 처리로 인해 통신 모듈에 가해지는 부하 가 커지므로, 군집 주행에 참여하는 차량들에 대한 통신 환경을 안정적으로 유지시켜주는 방안이 요구된다."}
{"patent_id": "10-2022-0010228", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "일 실시예에 따른 전자 장치 및 이에 의한 통신 제어 방법은, 이동 통신 방법을 지속적으로 사용함에 따라 전자 장치에 대해 가해질 수 있는 부하를 감소시키는 것을 과제로 한다. 또한, 일 실시예에 따른 전자 장치 및 이에 의한 통신 제어 방법은, 전자 장치의 과다한 발열로 인해 전자 장치 가 파손됨으로써 차량의 통신이 중단되는 상황을 방지하는 것을 과제로 한다. 또한, 일 실시예에 따른 전자 장치 및 이에 의한 통신 제어 방법은, 대용량 데이터를 안정적으로 송수신하는 것 을 과제로 한다."}
{"patent_id": "10-2022-0010228", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시예에 따른 마스터 차량의 통신을 제어하는 전자 장치에 있어서, 이동 통신 방법에 따라 기지국을 통해 데이터를 송수신하는 이동 통신 모듈; 다른 전자 장치와 D2D (Device-to-Device) 통신 방법으로 데이터를 송수 신하는 D2D 통신 모듈; 및 상기 D2D 통신 모듈을 이용하여, 상기 이동 통신 모듈이 상기 기지국과의 통신을 통 해 수신한 데이터를 적어도 하나의 슬레이브 차량에 전달하는 제어 모듈을 포함하되, 상기 제어 모듈은, 상기 이동 통신 모듈의 온도가 임계 온도 이상이면, 상기 적어도 하나의 슬레이브 차량 중 상기 기지국과의 통신을 위한 새로운 마스터 차량을 선택할 수 있다. 일 실시예에서, 상기 새로운 마스터 차량이 선택됨에 따라 상기 마스터 차량은 슬레이브 역할을 수행하고, 상기 제어 모듈은, 상기 D2D 통신 모듈을 이용하여, 상기 마스터 차량이 필요로 하는 데이터의 요청을 상기 새로운 마스터 차량의 전자 장치로 전송할 수 있다. 일 실시예에서, 상기 D2D 통신 모듈은, 상기 기지국으로부터 상기 적어도 하나의 슬레이브 차량으로 전송되는 신호의 성능 지표 값을 상기 적어도 하나의 슬레이브 차량으로부터 수신하고, 상기 제어 모듈은, 상기 수신된 성능 지표 값을 고려하여, 상기 적어도 하나의 슬레이브 차량 중 상기 새로운 마스터 차량을 선택할 수 있다. 일 실시예에서, 상기 D2D 통신 모듈은, 상기 적어도 하나의 슬레이브 차량에 장착된 이동 통신 모듈의 온도 정 보를 상기 적어도 하나의 슬레이브 차량으로부터 수신하고, 상기 제어 모듈은, 상기 적어도 하나의 슬레이브 차량 중 상기 이동 통신 모듈의 온도가 가장 낮은 슬레이브 차량을 상기 새로운 마스터 차량으로 선택할 수 있다. 일 실시예에서, 상기 제어 모듈은, 상기 적어도 하나의 슬레이브 차량 각각에 대해, 다른 차량과의 거리의 평균 을 산출하고, 상기 적어도 하나의 슬레이브 차량 중 상기 산출된 평균이 가장 작은 슬레이브 차량을 상기 새로 운 마스터 차량으로 선택할 수 있다. 일 실시예에서, 상기 제어 모듈은, 상기 적어도 하나의 슬레이브 차량 각각에 대해, 상기 이동 통신 방법의 통 신 차단 가능성을 판단하고, 상기 적어도 하나의 슬레이브 차량 중 상기 통신 차단 가능성이 가장 낮은 슬레이 브 차량을 상기 새로운 마스터 차량으로 선택할 수 있다. 일 실시예에서, 상기 통신 차단 가능성은, 적어도 하나의 슬레이브 차량과 앞 차량 사이의 거리, 상기 앞 차량 의 높이, 상기 적어도 하나의 슬레이브 차량에 장착된 안테나 모듈의 높이, 및 상기 적어도 하나의 슬레이브 차 량의 이동 통신 방법을 위한 빔(beam)의 진행 방향 중 적어도 하나에 기반하여 판단될 수 있다. 일 실시예에서, 상기 제어 모듈은, 기지국으로부터 수신되는 데이터를 수신할 슬레이브 차량의 정보, 슬레이브 차량이 필요로 하는 데이터를 위해 접속하여야 할 외부 장치의 주소 정보, 및 슬레이브 차량이 필요로 하는 데 이터 중 기 수신한 데이터의 크기 정보 중 적어도 하나를 상기 새로운 마스터 차량으로 전송할 수 있다. 일 실시예에서, 상기 제어 모듈은, 상기 기지국을 통해 기 설정된 크기 이상의 데이터의 수신이 필요하면, 상기 적어도 하나의 슬레이브 차량 중 상기 기지국과의 통신을 위한 새로운 마스터 차량을 선택할 수 있다. 일 실시예에서, 상기 새로운 마스터 차량이 선택됨에 따라, 상기 새로운 마스터 차량과 기존 마스터 차량이 데 이터의 송수신을 위해 기지국과 통신할 수 있다. 일 실시예에서, 상기 제어 모듈은, 제 1 슬레이브 차량으로 전달하여야 하는 제 1 데이터의 우선 순위와 제 2 슬레이브 차량으로 전달하여야 하는 제 2 데이터의 우선 순위를 비교하고, 상기 제 1 데이터의 우선 순위가 상 기 제 2 데이터의 우선 순위보다 높은 경우, 상기 D2D 통신 모듈을 이용하여 상기 제 1 데이터를 상기 제 1 슬 레이브 차량으로 전달한 후, 상기 제 2 데이터를 상기 제 2 슬레이브 차량으로 전달할 수 있다. 다른 실시예에 따른 전자 장치에 의한 통신 제어 방법에 있어서, 이동 통신 방법에 따라 기지국과 통신을 하여 데이터를 수신하는 단계; 상기 기지국을 통해 수신한 데이터를 D2D (Device-to-Device) 통신 방법에 따라 적어 도 하나의 슬레이브 차량의 전자 장치로 전송하는 단계; 및 상기 이동 통신 방법을 위한 이동 통신 모듈의 온도 가 임계 온도 이상이면, 상기 적어도 하나의 슬레이브 차량 중 상기 기지국과의 통신을 위한 새로운 마스터 차 량을 선택하는 단계를 포함할 수 있다. 일 실시예에서, 상기 새로운 마스터 차량이 선택됨에 따라 상기 마스터 차량은 슬레이브 역할을 수행하고, 상기 통신 제어 방법은, 상기 마스터 차량이 필요로 하는 데이터의 요청을, 상기 D2D 통신 방법에 따라 상기 새로운 마스터 차량의 전자 장치로 전송하는 단계를 더 포함할 수 있다. 일 실시예에서, 상기 통신 제어 방법은, 기지국으로부터 수신되는 데이터를 수신할 슬레이브 차량의 정보, 슬레 이브 차량이 필요로 하는 데이터를 위해 접속하여야 할 외부 장치의 주소 정보, 및 슬레이브 차량이 필요로 하 는 데이터 중 기 수신한 데이터의 크기 정보 중 적어도 하나를 상기 새로운 마스터 차량으로 전송하는 단계를 더 포함할 수 있다."}
{"patent_id": "10-2022-0010228", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "일 실시예에 따른 전자 장치 및 이에 의한 통신 제어 방법은, 이동 통신 방법을 지속적으로 사용함에 따라 전자 장치에 대해 가해질 수 있는 부하를 감소시킬 수 있다. 또한, 일 실시예에 따른 전자 장치 및 이에 의한 통신 제어 방법은, 전자 장치의 과다한 발열로 인해 전자 장치 가 파손됨으로써 차량의 통신이 중단되는 상황을 방지할 수 있다. 또한, 일 실시예에 따른 전자 장치 및 이에 의한 통신 제어 방법은, 대용량 데이터를 안정적으로 송수신할 수 있다."}
{"patent_id": "10-2022-0010228", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시는 다양한 변경을 가할 수 있고 여러 가지 실시예를 가질 수 있는 바, 특정 실시예들을 도면에 예시하고, 이를 상세한 설명을 통해 설명하고자 한다. 그러나, 이는 본 개시의 실시 형태에 대해 한정하려는 것 이 아니며, 본 개시는 여러 실시예들의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하 는 것으로 이해되어야 한다. 실시예를 설명함에 있어서, 관련된 공지 기술에 대한 구체적인 설명이 본 개시의 요지를 불필요하게 흐릴 수 있 다고 판단되는 경우 그 상세한 설명을 생략한다. 또한, 본 개시의 설명 과정에서 이용되는 숫자(예를 들어, 제 1, 제 2 등)는 하나의 구성요소를 다른 구성요소와 구분하기 위한 식별 기호에 불과하다. 본 개시에서, \"a, b 또는 c 중 적어도 하나\" 표현은 \" a\", \" b\", \" c\", \"a 및 b\", \"a 및 c\", \"b 및 c\", \"a, b 및 c 모두\", 혹은 그 변형들을 지칭할 수 있다. 또한, 본 개시에서, 일 구성요소가 다른 구성요소와 \"연결된다\" 거나 \"접속된다\" 등으로 언급된 때에는, 상기 일 구성요소가 상기 다른 구성요소와 직접 연결되거나 또는 직접 접속될 수도 있지만, 특별히 반대되는 기재가 존재하지 않는 이상, 중간에 또 다른 구성요소를 매개하여 연결되거나 또는 접속될 수도 있다고 이해되어야 할 것이다. 또한, 본 개시에서 '~부(유닛)', '모듈' 등으로 표현되는 구성요소는 2개 이상의 구성요소가 하나의 구성요소로 합쳐지거나 또는 하나의 구성요소가 보다 세분화된 기능별로 2개 이상으로 분화될 수도 있다. 또한, 이하에서설명할 구성요소 각각은 자신이 담당하는 주기능 이외에도 다른 구성요소가 담당하는 기능 중 일부 또는 전부의 기능을 추가적으로 수행할 수도 있으며, 구성요소 각각이 담당하는 주기능 중 일부 기능이 다른 구성요소에 의 해 전담되어 수행될 수도 있음은 물론이다. 도 1은 일 실시예에 따른 군집 주행 중인 차량들(11, 12, 13)의 통신 환경을 설명하기 위한 도면이다. 군집 주행에 참여하는 차량들(11, 12, 13)은 주행에 필요한 데이터를 획득하여야 한다. 예를 들어, 차량들(11, 12, 13)은 주행 경로 정보, 주변 장애물 정보 및 앞 차량과의 거리 정보 등을 획득하여 주행에 따른 비용을 절 감하고, 예기치 않은 사고를 방지할 수 있다. 데이터의 송수신을 위해 차량들(11, 12, 13)은 소정의 통신 방법을 이용할 수 있으며, 일 예시에서 차량들(11, 12, 13)은 이동 통신 방법에 따라 기지국과 통신하면서 데이터를 획득할 수 있다. 다만, 군집 주행에 참여 하는 모든 차량들(11, 12, 13)이 기지국과 통신하는 경우, 네트워크의 활용성 및 비용 측면에서 효율성이 떨어질 수 있다. 따라서, 차량들(11, 12, 13) 중 소수의 차량(예를 들어, 차량)만 기지국을 통해 데이터를 송수신하고, 다른 차량들(예를 들어, 차량(12, 13))은 소수의 차량으로부터 데이터를 수신하는 통신 환경이 군집 주행에 적 합할 수 있다. 이하에서, 기지국과 통신을 하는 차량을 마스터 역할을 하는 차량 또는 마스터 차량으로 참조할 수 있고, 마스터 차량으로부터 데이터를 수신하는 차량을 슬레이브 역할을 하는 차량 또는 슬레이브 차량으로 참조할 수 있다. 슬레이브 차량은 기지국과 직접적으로 통신하지 않을 수 있다. 도 1을 참조하면, 가장 앞선 차량이 마스터 차량이고, 마스터 차량을 뒤따르고 있는 차량들(12, 13)이 슬레이브 차량일 수 있다. 군집 주행에 참여하는 차량들(11, 12, 13) 중 마스터 차량은 미리 결정되어 있을 수 있다. 가장 앞선 차량 이 마스터 차량이고, 그 이외의 차량들(12, 13)이 슬레이브 차량이라는 것은 하나의 예시일 뿐, 군집 주행 중에 있는 여러 차량들(11, 12, 13) 중 맨 뒤 차량이 마스터 차량으로 결정될 수도 있다. 마스터 차량은 이동 통신 방법에 따른 기지국과의 통신을 통해 데이터를 송수신한다. 마스터 차량 은 수신하고자 하는 데이터의 요청을 기지국으로 전송하고, 외부 장치(예를 들어, 서버)로부터 기지국 을 통해 데이터를 수신할 수 있다. 마스터 차량이 이용하는 이동 통신 방법은, 예를 들어, mmWave 대역 기반의 5G 이동 통신, sub-6 대역 기반 의 5G 이동 통신, 4G 이동 통신 또는 3G 이동 통신을 포함할 수 있다. 슬레이브 차량들(12, 13)은 수신하고자 하는 데이터의 요청을 D2D 통신 방법에 따라 마스터 차량으로 전송 한다. 마스터 차량은 슬레이브 차량들(12, 13)이 필요로 하는 데이터를 기지국을 통해 수신한 뒤, D2D 통신 방법에 따라 슬레이브 차량들(12, 13)로 전달할 수 있다. 일 실시예에서, D2D 통신 방법은 WiFi Direct 통신, 블루투스 통신, LTE 기반의 D2D 통신 등을 포함할 수 있는 데, 이는 하나의 예시일 뿐, D2D 통신 방법은 기지국이나 AP(access point) 등의 네트워크 인프라를 거치 지 않고, 장치 간의 직접 통신을 가능케하는 다양한 통신 방법을 포함할 수 있다. 도 1에 도시된 통신 환경에 따르면, 마스터 차량에게 가해지는 부하가 커짐에 따라, 마스터 차량의 통 신 모듈의 성능이 저하되거나, 심한 경우 통신 모듈의 파손이 발생할 가능성이 있다. 따라서, 마스터-슬레이브 통신 환경을 유지하면서, 마스터 차량에게 가해지는 부하를 감소시킬 수 있는 방안이 필요하다. 특히, 28GHz 내지 100GHz의 mmWave 대역은 6GHz 이하의 기존 대역(sub-6 대역)에 비해 이용할 수 있는 연속적인 넓은 대역폭이 존재하므로, 데이터의 빠른 송수신이 가능하지만, 빠른 통신 속도로 인해 장시간 이용시 통신 모 듈의 발열이 심해질 수 있다. 이하에서는, 마스터 차량(또는 현재 차량)에 장착되어 동작하는 전자 장치가 마스터 차량의 통신을 제 어하여 마스터 차량에 대해 집중되는 부하를 감소시키는 실시예들에 대해 설명한다. 도 2는 일 실시예에 따른 전자 장치의 구성을 도시하는 도면이다. 도 2를 참조하면, 전자 장치는 제어 모듈, 이동 통신 모듈, D2D(Device-to-Device) 통신 모듈 및 메모리를 포함할 수 있다. 구현예에 따라, 전자 장치는 온도 센서를 더 포함할 수 있다. 제어 모듈, 이동 통신 모듈 및 D2D 통신 모듈은 프로세서로 구현될 수 있다. 프로세서는 ECU (electronic control unit)로 참조될 수도 있다. 제어 모듈, 이동 통신 모듈 및 D2D 통신 모듈은 메모리에 저장된 적어도 하나의 인스트럭 션에 따라 동작할 수 있다. 제어 모듈은 이동 통신 모듈 및 D2D 통신 모듈의 동작을 제어한다. 제어 모듈은 데이터를 송수신하는데 이용할 통신 방법을 선택하고, 선택한 통신 방법에 따라 이동 통신 모 듈 및/또는 D2D 통신 모듈을 동작시킬 수 있다. 이하에서, 제어 모듈이 소정 통신 방법에 따라 데이터를 송수신한다 할 때, 이는 제어 모듈이 이동 통신 모듈 및/또는 D2D 통신 모듈을 제어하여 데이터를 송수신하는 것으로 이해될 수 있다. 또한, 이하에서, 마스터 차량과 슬레이브 차량이 어떤 동작을 수행한다고 할 때, 이는 마스터 차량의 전자 장치 와 슬레이브 차량의 전자 장치가 해당 동작을 수행하는 것으로 이해될 수 있다. 온도 센서는, 예를 들어, 써모미터(thermometer)를 포함할 수 있다. 온도 센서는 이동 통신 모듈 의 온도를 센싱한다. 일 실시예에서, 온도 센서는 이동 통신 모듈을 구현하는 프로세서의 온도 및/또는 안테나 모듈의 온도를 센싱할 수 있다. 제어 모듈은 온도 센서에 의해 센싱된 이동 통신 모듈의 온도를 고려하여 통신 방법을 제어할 수 있다. 전술한 바와 같이, 마스터 차량은 이동 통신 모듈을 이용하여 기지국을 통해 데이터를 송수신하는데, 이동 통신 모듈의 온도가 높아지면, 제어 모듈은 이동 통신 방법에 따른 통신을 중단하거나, 이동 통 신 방법에 따라 송수신할 데이터량을 감소시킬 수 있다. 이동 통신 모듈은 기지국과 이동 통신 방법으로 데이터를 송수신한다. 이동 통신 방법은 mmWave 대역 기반의 5G 통신 방법, 6Ghz 이하의 대역(sub-6 대역) 기반의 5G 통신 방법, 4G 통신 방법 또는 3G 통신 방법을 포함할 수 있다. 이동 통신 모듈은 안테나 모듈을 포함할 수 있다. 안테나 모듈에서는 이동 통신 방법을 위한 빔 이 생성될 수 있다. 빔의 진행 방향이나 빔의 형상 등을 조절하는 것을 빔 포밍이라 한다. D2D 통신 모듈은 다른 차량의 전자 장치와의 D2D 통신을 통해 데이터를 송수신한다. 일 실시예에서, D2D 통신 방법은 WiFi Direct 통신, 블루투스 통신, LTE 기반의 D2D 통신 등을 포함할 수 있는 데, 이는 하나의 예시일 뿐, D2D 통신 방법은 기지국이나 AP(access point) 등의 네트워크 인프라를 거치 지 않고, 장치 간의 직접 통신을 가능케하는 다양한 통신 방법을 포함할 수 있다. 이하에서, 도 3을 참조하여 전자 장치의 동작에 대해 상세히 설명한다. 도 3은 일 실시예에 따른 전자 장치에 의한 통신 제어 방법을 설명하기 위한 순서도이다. S310 단계에서, 전자 장치의 제어 모듈은 이동 통신 모듈을 이용하여 이동 통신 방법에 따라 기 지국을 통해 데이터를 송수신한다. 제어 모듈은 마스터 차량에 해당하는 현재 차량이 필요로 하는 데이터와 슬레이브 차량들이 필요로 하 는 데이터의 요청을 기지국으로 전송하고, 기지국으로부터 현재 차량과 슬레이브 차량들이 필요로 하는 데이터를 수신할 수 있다. 슬레이브 차량들은 자신들이 필요로 하는 데이터의 요청을 D2D 통신 방법에 따라 전자 장치의 D2D 통신 모 듈로 전송할 수 있다. S320 단계에서, 제어 모듈은 D2D 통신 모듈을 이용하여 D2D 통신 방법에 따라 슬레이브 차량들의 전 자 장치로 데이터를 전송한다. 제어 모듈은 슬레이브 차량들이 요청하였던 데이터를 기지국으로부터 수신하여 슬레이브 차량들의 전 자 장치로 전송할 수 있다. S330 단계에서, 제어 모듈은 온도 센서에 의해 센싱된 이동 통신 모듈의 온도가 미리 설정된 임 계 온도 이상이면, 슬레이브 차량들 중 새로운 마스터 차량을 선택한다. 일 실시예에서, 온도 센서는 지속적으로 이동 통신 모듈의 온도를 센싱하고, 센싱 결과를 제어 모듈 로 전달할 수 있다. 슬레이브 차량들 중 소정의 기준에 따라 새로운 마스터 차량으로 선택된 슬레이브 차량에 대해, 제어 모듈(21 0)은 새로운 마스터 차량으로 선택되었다는 메시지를 전송할 수 있고, 메시지를 수신한 슬레이브 차량은 마스터 역할을 수행할 수 있다. 새로운 마스터 차량은, 기존 마스터 차량(즉, 현재 차량)과 마찬가지로, 이동 통신 방법에 따라 기지국(2 0)을 통해 데이터를 송수신하고, 기지국을 통해 수신한 데이터를 D2D 통신 방법에 따라 슬레이브 차량들에 게 전달할 수 있다. 새로운 마스터 차량이 선택됨에 따라, 제어 모듈은 새로운 마스터 차량이 슬레이브 차량들을 위해 획득하 여야 하는 데이터의 정보를 새로운 마스터 차량에게 전송할 수 있다. 이는, 기존 마스터 차량이 슬레이브 차량 들을 위해 획득하여야 하는 데이터를 기지국으로부터 완전히 수신하지 못한 경우를 위한 것이다. 일 실시예에서, 제어 모듈은 기지국으로부터 수신되는 데이터를 필요로 하는 슬레이브 차량의 정보, 데이터를 수신하기 위해 접속하여야 할 외부 장치의 주소 정보, 및 현재 차량이 기 수신한 데이터의 크기 정보 중 적어도 하나를 새로운 마스터 차량에게 전송할 수 있다. 예를 들어, 현재 차량이 특정의 슬레이브 차량을 위한 A 데이터를 40% 획득한 이후에 새로운 마스터 차량이 선택되었다면, 제어 모듈은 A 데이터를 필요로 하는 슬레이브 차량의 정보, A 데이터를 획득하기 위해 접 속하여야 할 외부 장치의 주소 정보, 및 현재 차량이 A 데이터를 40%만큼 수신하였다는 정보를 새로운 마스 터 차량으로 전송함으로써, 새로운 마스터 차량이 A 데이터를 연속하여 수신하게 할 수 있다. 새로운 마스터 차량이 선택되는 경우, 군집 주행 중인 차량들의 통신 환경에 변화가 발생하게 되는데, 이에 대 해 도 4 및 도 5를 참조하여 설명한다. 도 4 및 도 5는 일 실시예에 따라 새로운 마스터 차량이 선택됨에 따라 군집 주행 중인 차량들의 통신 환경이 변경됨을 나타내는 도면이다. 일 실시예에서, 기존 마스터 차량, 즉 현재 차량의 역할은 슬레이브로 전환될 수 있다. 이에 따라, 제어 모 듈은 현재 차량이 필요로 하는 데이터의 요청을 D2D 통신 방법에 따라 새로운 마스터 차량의 전자 장 치로 전송할 수 있다. 도 4를 참조하면, 마스터 차량에 해당하는 현재 차량, 제 1 슬레이브 차량 및 제 2 슬레이브 차량 이 군집 주행 중에 있을 때, 제어 모듈은 현재 차량의 이동 통신 모듈의 온도가 상승함에 따라 기지국과의 이동 통신을 중단할 수 있다. 제 2 슬레이브 차량이 새로운 마스터 차량으로 선택되는 경우, 새로운 마스터 차량의 전자 장치는 이동 통 신 방법에 따라 기지국과 데이터를 송수신할 수 있다. 현재 차량과 제 1 슬레이브 차량은 자신들이 필요로 하는 데이터 요청을 D2D 통신 방법에 따라 새로운 마스터 차량으로 전송하고, 새로운 마스터 차량은 기지국을 통해 수신한 데이터를 D2D 통신 방법에 따라 현 재 차량과 제 1 슬레이브 차량으로 전송할 수 있다. 새로운 마스터 차량의 전자 장치는, 이동 통신 모듈의 온도가 임계 온도 이상이면, 현재 차량과 제 1 슬레 이브 차량 중에서 새로운 마스터 차량을 선택하고, 기지국과의 이동 통신을 중단할 수 있다. 그리고, 새로운 마스터 차량은 기지국과의 이동 통신에 따라 데이터를 송수신할 수 있다. 즉, 일 실시예에서는, 이동 통신 모듈의 온도를 기반으로 마스터 역할을 하는 차량을 계속적으로 변경하므로, 마스터 차량에 집중되는 부하를 감소시킬 수 있고, 이동 통신 모듈의 파손을 방지할 수 있다. 다음으로, 도 5를 참조하면, 새로운 마스터 차량이 선택되더라도 기존 마스터 차량, 즉 현재 차량은 마스터 역할을 계속 유지할 수도 있다. 다시 말하면, 새로운 마스터 차량이 선택되더라도, 제어 모듈은 이동 통신 방법에 따라 기지국을 통해 데이터를 송수신하고, 기지국을 통해 수신된 데이터를 D2D 통신 방법에 따라 슬레이브 차량에게 전달할 수있다. 기존 마스터 차량과 새로운 마스터 차량이 모두 마스터 역할을 수행함에 따라 슬레이브 차량들 중 일부는 기존 마스터 차량에게 필요 데이터의 요청을 전송하고, 슬레이브 차량들 중 다른 일부는 새로운 마스터 차량에게 필 요 데이터의 요청을 전송할 수 있다. 이에 의하면, 기존 마스터 차량이 기지국으로부터 수신하여야 할 데이 터의 크기가 감소하기 때문에, 이동 통신 모듈에 가해지는 부하가 감소할 수 있다. 즉, 마스터 역할을 하는 하나의 차량에게 집중되는 부하를 다른 마스터 차량에게도 분산시킴으로써 이동 통신 모듈의 발열에 의한 파손을 방지할 수 있는 것이다. 도 5에 도시된 바와 같이, 마스터 차량에 해당하는 현재 차량, 제 1 슬레이브 차량, 제 2 슬레이브 차 량 및 제 3 슬레이브 차량이 군집 주행 중에 있을 때, 제어 모듈은 현재 차량의 이동 통신 모 듈의 온도가 상승함에 따라 제 2 슬레이브 차량을 새로운 마스터 차량으로 선택할 수 있다. 제 2 슬레이브 차량이 새로운 마스터 차량으로 선택되면, 제어 모듈은 새로운 마스터 차량이 담당하여 야 할 슬레이브 차량의 정보를 새로운 마스터 차량으로 전송할 수 있다. 예를 들어, 현재 차량은 새로운 마스터 차량으로 선택된 제 2 슬레이브 차량이 제 3 슬레이브 차량(1 4)을 담당하여야 한다는 메시지를 제 2 슬레이브 차량으로 전송할 수 있다. 현재 차량은 제 1 슬레이브 차량을 담당할 수 있다. 다른 예로, 현재 차량은 필요 데이터의 요청을 새로운 마스터 차량으로 선택된 제 2 슬레이브 차량으로 전송하라는 메시지를 제 3 슬레이브 차량으로 전송할 수도 있다. 제 3 슬레이브 차량은 자신이 필요로 하는 데이터의 요청을 제 2 슬레이브 차량으로 전송하고, 제 2 슬 레이브 차량은 기지국을 통해 수신한 데이터를 제 3 슬레이브 차량으로 전송할 수 있다. 제 1 슬레이브 차량은 자신이 필요로 하는 데이터의 요청을 현재 차량으로 전송하고, 현재 차량은 기지국을 통해 수신한 데이터를 제 1 슬레이브 차량으로 전송할 수 있다. 일 실시예에서, 제어 모듈은 새로운 마스터 차량이 담당하여야 할 슬레이브 차량의 정보를 새로운 마스터 차량으로 전송하면서, 슬레이브 차량을 위해 수신하여야 하는 데이터의 정보를 함께 전송할 수 있다. 여기서, 데이터의 정보는, 데이터를 수신하기 위해 접속하여야 할 외부 장치의 주소 정보, 및 현재 차량이 기 수신 한 데이터의 크기 정보 중 적어도 하나를 포함할 수 있다. 이는, 기존 마스터 차량(현재 차량)이, 슬레이브 차량이 필요로 하는 데이터를 기지국을 통해 수신하는 중에 새로운 마스터 차량이 선택되는 경우를 위한 것 이다. 일 실시예에서, 현재 차량이 마스터 역할을 유지하는 경우, 제어 모듈은 차량들의 위치를 고려하여, 슬레이브 차량들을 기존 마스터 차량이 담당하여야 하는 슬레이브 차량과 새로운 마스터 차량이 담당하여야 하 는 슬레이브 차량으로 구분할 수 있다. 일 예로, 제어 모듈은, 새로운 마스터 차량과 기존 마스터 차량 중 기존 마스터 차량에 더 가까운 슬레이 브 차량들을 기존 마스터 차량이 담당하는 것으로 결정하고, 새로운 마스터 차량에 더 가까운 슬레이브 차량들 은 새로운 마스터 차량이 담당하는 것으로 결정할 수 있다. 통신 주체들 사이의 거리가 가까울수록 D2D 통신 속 도가 향상되므로, 제어 모듈은 각각의 마스터 차량과 슬레이브 차량들 사이의 거리를 기반으로, 각각의 마 스터 차량이 담당할 슬레이브 차량을 결정하는 것이다. 다른 예로, 제어 모듈은 새로운 마스터 차량이 선택되었다는 메시지를 슬레이브 차량들에게 전송함으로써, 슬레이브 차량들이 스스로 마스터 차량을 선택하게 할 수도 있다. 이 경우, 슬레이브 차량들은 마스터 차량들과 의 거리를 고려하여 자신이 필요로 하는 데이터를 요청할 마스터 차량을 선택하거나, D2D 통신에 따른 신호 세 기가 더 큰 마스터 차량으로 필요 데이터의 요청을 전송할 수 있다. 이하에서는, 도 6 내지 도 10을 참조하여, 현재 차량의 전자 장치가 슬레이브 차량들 중 새로운 마스 터 차량을 선택하는 방법에 대해 설명한다. 도 6은 일 실시예에 따른 새로운 마스터 차량을 선택하는 방법을 설명하기 위한 도면이다. 일 실시예에서, 전자 장치는 슬레이브 차량들로부터 새로운 마스터 차량을 선택하는데 필요한 정보들을 수 신하고, 수신된 정보를 고려하여 새로운 마스터 차량을 선택할 수 있다.새로운 마스터 차량을 선택하는데 필요한 정보는, 각각의 슬레이브 차량이 기지국으로부터 수신한 신호(예 를 들어, 레퍼런스 신호)의 성능 지표 값, 및 이동 통신 모듈의 온도 정보 중 적어도 하나를 포함할 수 있다. 도 6을 참조하면, 마스터 차량은 신호의 성능 지표 값 및/또는 이동 통신 모듈의 온도 정보를 고려하여 제 2 슬레이브 차량을 새로운 마스터 차량으로 선택할 수 있다. 신호의 성능 지표 값은, 예를 들어, RSRP (Reference Signal Receive Power), RSSI (Recevice Signal Strength Indicator), RSRQ (Reference Signal Receive Qaulity) 및 SINR (Signal-to-noise and INterference Ratio) 중 적어도 하나를 포함할 수 있으나, 이에 한정되는 것은 아니다. 일 실시예에서, 제어 모듈은 슬레이브 차량들로부터 수신된 성능 지표 값들을 고려하여 슬레이브 차량들 중 새로운 마스터 차량을 선택할 수 있다. 예를 들어, 제어 모듈은 가장 높은 성능 지표 값에 대응하는 슬 레이브 차량을 새로운 마스터 차량으로 선택할 수 있다. 새로운 마스터 차량으로 선택된 슬레이브 차량의 경우, 기지국과 이동 통신 방법에 따라 통신을 하므로, 제어 모듈은 이동 통신 방법의 효율이 가장 좋은 슬 레이브 차량을 새로운 마스터 차량으로 선택할 수 있다. 다른 실시예에서, 제어 모듈은 슬레이브 차량들로부터 수신된 이동 통신 모듈의 온도 정보를 고려하여, 가 장 낮은 온도의 이동 통신 모듈을 장착하고 있는 슬레이브 차량을 새로운 마스터 차량으로 선택할 수 있다. 이 는, 가장 낮은 온도의 이동 통신 모듈을 장착하고 있는 슬레이브 차량의 경우, 장시간에 걸쳐 대용량의 데이터 를 처리할 능력이 있는 것으로 판단되기 때문이다. 또 다른 실시예에서, 제어 모듈은 슬레이브 차량들로부터 수신된 성능 지표 값들과 이동 통신 모듈의 온도 정보를 모두 고려하여 새로운 마스터 차량을 선택할 수도 있다. 예를 들어, 제어 모듈은 성능 지표 값이 임계 값 이상이면서, 이동 통신 모듈의 온도가 미리 설정된 온도 이하인 슬레이브 차량을 새로운 마스터 차량으 로 선택할 수 있다. 다른 예로, 제어 모듈은 슬레이브 차량들로부터 수신된 성능 지표 값들과 이동 통신 모듈의 온도들을 산술 조합하여 슬레이브 차량들 각각의 마스터 차량으로서의 적합도를 산출하고, 적합도가 가 장 높은 슬레이브 차량을 새로운 마스터 차량으로 선택할 수도 있다. 이 경우, 적합도는, 성능 지표 값이 높을 수록, 이동 통신 모듈의 온도가 낮을수록 높게 산출될 수 있다. 도 7(a) 및 도 7(b)는 다른 실시예에 따른 새로운 마스터 차량을 선택하는 방법을 설명하기 위한 도면이다. 제어 모듈은 군집 주행에 참여하고 있는 차량들 사이의 거리를 기반으로 새로운 마스터 차량을 선택할 수 도 있다. 구체적으로, 제어 모듈은 슬레이브 차량들 각각에 대해, 다른 차량들과의 거리의 평균 값을 산출하고, 가 장 작은 평균 값을 갖는 슬레이브 차량을 새로운 마스터 차량으로 선택할 수 있다. 도 7(a)를 참조하면, 현재 차량과 제 1 슬레이브 차량 사이의 거리는 d1이고, 제 1 슬레이브 차량 과 제 2 슬레이브 차량 사이의 거리는 d2이다. 또한, 제 2 슬레이브 차량과 제 3 슬레이브 차량 사 이의 거리는 d3이고, 제 3 슬레이브 차량과 제 4 슬레이브 차량 사이의 거리는 d4이다. 두 대의 차량 사이에 하나 이상의 차량이 존재한다면, 중간에 위치하는 차량의 길이도 고려되어야 한다. 따라서, 마스터 차량 과 제 2 슬레이브 차량 사이의 거리는 d1+d2+제 1 슬레이브 차량의 길이로 산출될 수 있다. 일 실시예에서, 제어 모듈은 각각의 슬레이브 차량과 앞 차량 사이의 차간 거리를 확인하고, 확인된 차간 거리 및 슬레이브 차량들의 길이를 고려하여 새로운 마스터 차량을 선택할 수 있다. 이를 위해 일 실시예에서, 슬레이브 차량들은 센서(예를 들어, 카메라 센서, 적외선 센서, LiDAR 센서 등)를 통해 확인된 앞 차량과의 거 리 정보를 D2D 통신 방법에 따라 현재 차량의 제어 모듈로 전송할 수 있다. 도 7(b)는 차량들 사이의 거리를 나타내는 표로서, 마스터 차량의 경우, 제 1 슬레이브 차량, 제 2 슬레이 브 차량, 제 3 슬레이브 차량 및 제 4 슬레이브 차량 각각과 1m, 6m, 10m 및 13m만큼 떨어져 있고, 제 1 슬레이브 차량의 경우, 마스터 차량(즉, 현재 차량), 제 2 슬레이브 차량, 제 3 슬레이 브 차량 및 제 4 슬레이브 차량 각각과 1m, 3m, 7m 및 10m만큼 떨어져 있는 것을 알 수 있다. 제 2 슬레이브 차량의 경우, 마스터 차량(현재 차량), 제 1 슬레이브 차량, 제 3 슬레이브 차량 및 제 4 슬레이브 차량 각각과 6m, 3m, 2m 및 5m만큼 떨어져 있으며, 이들 거리의 평균 값은 4m로서 다른 슬레이브 차량들에 대해 산출되는 평균 값보다 작으므로, 제어 모듈은, 제 2 슬레이브 차량을 새 로운 마스터 차량으로 선택할 수 있다.전술한 바와 같이, 마스터 차량은 기지국으로부터 수신한 데이터를 D2D 통신 방법에 따라 슬레이브 차량들 로 전송하는데, 기지국 등을 기반으로 하지 않는 D2D 통신 방법은 통신 거리가 짧을수록 통신 속도에서 우 수하다. 따라서, 다른 차량들과의 거리들의 평균 값이 가장 작은 슬레이브 차량을 새로운 마스터 차량으로 선택 함으로써, D2D 통신 방법에 따른 통신 효율이 극대화될 수 있다. 일 실시예에서, 제어 모듈은 새로운 마스터 차량의 선택을 위해 이동 통신 방법에 대한 차단 가능성을 고 려할 수도 있다. 구체적으로, 제어 모듈은 슬레이브 차량들 각각에 대해 이동 통신 방법의 통신 차단 가능성을 판단하고, 통신 차단 가능성이 가장 낮은 슬레이브 차량을 새로운 마스터 차량으로 선택할 수 있다. 마스터 역할을 하는 차량은 이동 통신 방법에 따라 기지국과 통신을 하여야 하므로, 이동 통신에 대한 차단 가능성이 낮은 슬레이브 차량을 새로운 마스터 차량으로 선택함으로써, 원활한 통신이 가능하게 할 수 있다. 일 실시예에서, 제어 모듈은 슬레이브 차량과 슬레이브 차량의 앞 차량 사이의 거리, 앞 차량의 높이, 슬 레이브 차량에 장착된 안테나 모듈의 높이, 슬레이브 차량의 이동 통신 방법을 위한 빔(beam)의 진행 방향, 및 기지국으로부터 슬레이브 차량으로 전송되는 신호의 성능 지표 값 중 적어도 하나에 기반하여 각각의 슬레 이브 차량의 통신 차단 가능성을 판단할 수 있다. 제어 모듈이 슬레이브 차량들의 통신 차단 가능성을 판단하는 방법에 대해 도 8 내지 도 10을 참조하여 설 명한다. 도 8 및 도 9는 군집 주행 중인 차량에 대한 통신 차단 가능성을 판단하는 방법을 설명하기 위한 도면이다. 도 8 및 도 9는 현재 차량을 뒤따르고 있는 제 1 슬레이브 차량에 대한 통신 차단 가능성을 설명하기 위한 도면이지만, 다른 슬레이브 차량들에 대해서도 동일하게 적용될 수 있다. 이동 통신 방법에 따른 통신을 위해서는 빔이 통신 타겟을 지향해야 하므로, 일반적으로 빔은 기지국을 지 향할 수 있다. 따라서, 빔의 진행 방향에 장애물이 위치하는 경우 통신 차단 가능성이 있는 것으로 판단될 수 있다. 도 8을 참조하면, 제 1 슬레이브 차량의 주변 장애물, 예를 들어, 현재 차량은 제 1 슬레이브 차량(1 2)의 정면에 위치하나, 빔의 진행 방향은 좌측 상부 방향이므로, 제어 모듈은 제 1 슬레이브 차 량에 대해 통신 차단 가능성이 낮은 것으로 판단할 수 있다. 다음으로, 도 9를 참조하면, 현재 차량은 제 1 슬레이브 차량의 정면에 위치하고, 빔의 진행 방향 은 우측 상부 방향을 지향한다. 빔의 진행 방향에 현재 차량이 존재하므로, 제어 모듈(21 0)은 제 1 슬레이브 차량에 대한 통신 차단 가능성이 높은 것으로 판단할 수 있다. 제어 모듈은 슬레이브 차량들 각각의 빔의 진행 방향과 슬레이브 차량들 각각의 앞 차량이 위치하는 방향 사이의 각도를 고려하여 새로운 마스터 차량을 선택할 수 있다. 예를 들어, 제어 모듈은 빔의 진행 방향과 앞 차량이 위치하는 방향 사이의 각도가 가장 큰 슬레이브 차량을 새로운 마스터 차량으로 선택할 수 있다. 다음으로, 도 10(a) 및 도 10(b)을 참조하여 다른 실시예에 따라 군집 주행 중인 차량에 대한 통신 차단 가능성 을 판단하는 방법을 설명한다. 통신 차단 가능성은 앞 차량의 크기 및 앞 차량과의 거리에 많은 영향을 받게 된다. 예를 들어, 앞 차량의 크기 가 크거나, 앞 차량과의 거리가 짧을수록 이동 통신 방법의 통신 차단 가능성이 높아지게 된다. 왜냐하면, 앞 차량이 이동 통신 방법에 따라 송수신되는 신호를 차단할 수 있기 때문이다. 도 10(a)를 참조하면, 현재 차량의 높이는 h1이고, 제 1 슬레이브 차량에 장착된 안테나 모듈의 높 이는 h2이고, 현재 차량과 제 1 슬레이브 차량 사이의 거리는 d이다. 제어 모듈은 d가 작아질수록 제 1 슬레이브 차량에 대한 통신 차단 가능성이 높은 것으로 판단할 수 있다. 또한, 제어 모듈은 h1과 h2 사이의 차이(즉, h1-h2)가 클수록 제 1 슬레이브 차량에 대한 통신 차단 가능성이 높은 것으로 판단할 수 있다. 도 10(b)는 현재 차량과 제 1 슬레이브 차량 사이의 거리(d)에 따른 통신 차단 가능성을 나타내는 그래 프이다.도 10(b)에서 'a'는 h1-h2가 미리 결정된 값보다 클 때의 통신 차단 가능성을 나타내고, 'b'는 h1-h2가 미리 결 정된 값 이하일 때의 통신 차단 가능성을 나타낼 수 있다. 그리고, 'c'는 h1-h2가 0이하일 때, 즉, 제 1 슬레이 브 차량에 장착된 안테나 모듈의 높이가 현재 차량의 높이와 동일하거나, 더 클 때의 통신 차단 가 능성을 나타낼 수 있다. 도 10(b)를 참조하면, 두 차량 사이의 거리가 멀어지고, h1-h2가 작아질수록 통신 차단 가능성이 낮아지는 것을 알 수 있다. 제어 모듈은 각각의 슬레이브 차량에 대해, 앞 차량과의 거리 및/또는 안테나 모듈의 장착 높이와 앞 차량의 높이 사이의 차이를 고려하여 통신 차단 가능성을 산출하고, 통신 차단 가능성이 가장 낮은 슬레이브 차 량을 새로운 마스터 차량으로 선택할 수 있다. 도 6 내지 도 10을 참조하여 설명한 바와 같이, 제어 모듈이 새로운 마스터 차량을 선택하는데 있어, 기지 국으로부터 각각의 슬레이브 차량으로 전송되는 신호의 성능 지표 값, 각각의 슬레이브 차량에 장착된 이동 통신 모듈의 온도, 빔의 진행 방향과 앞 차량이 위치하는 방향 사이의 각도, 슬레이브 차량과 앞 차량 사이의 거리, 및 슬레이브 차량에 장착된 안테나 모듈의 높이와 앞 차량의 높이 사이의 차이가 고려될 수 있다. 일 실시예에서, 제어 모듈은 기지국으로부터 각각의 슬레이브 차량으로 전송되는 신호의 성능 지표 값, 각각의 슬레이브 차량에 장착된 이동 통신 모듈의 온도, 빔의 진행 방향과 앞 차량이 위치하는 방향 사이의 각도, 슬레이브 차량과 앞 차량 사이의 거리, 및 안테나 모듈의 높이와 앞 차량의 높이 사이의 차이(h1-h2) 중 적어도 두 개의 값들을 산술 조합하여 각각의 슬레이브 차량의 마스터 차량으로서의 적합도를 산출할 수 있 다. 제어 모듈은 가장 높은 적합도를 갖는 슬레이브 차량을 새로운 마스터 차량으로 선택할 수 있다. 이 경우, 마스터 차량으로서의 적합도는, 신호의 성능 지표 값, 빔의 진행 방향과 앞 차량이 위치하는 방향 사이의 각도, 슬레이브 차량과 앞 차량 사이의 거리에 비례하고, 이동 통신 모듈의 온도 및 안테나 모듈의 높이와 앞 차량의 높이 사이의 차이(h1-h2)에 반비례할 수 있다. 도 11(a) 및 도 11(b)는 일 실시예에 따라 제 1 슬레이브 차량이 필요로 하는 데이터와 제 2 슬레이브 차량 이 필요로 하는 데이터의 우선 순위를 고려하여 현재 차량이 데이터를 전달하는 과정을 설명하기 위한 도면이다. 일 실시예에서, 제어 모듈은 기지국으로부터 수신되는 데이터를 슬레이브 차량들로 전달하는데 있어 데이터의 우선 순위를 고려할 수 있다. 도 11(a)는 데이터의 종류에 따른 우선 순위를 나타내는 표로서, 도시된 바와 같이, 안전 데이터는 1순위, 주행 데이터는 2순위, 유저 데이터는 3순위로 우선 순위가 설정될 수 있다. 데이터의 종류에 따른 우선 순위는 다양 하게 변경될 수 있다. 안전 데이터는 예를 들어, 주변 장애물에 대한 데이터, 보행자에 대한 데이터, 사고 발생 여부에 대한 데이터 등 차량의 사고 가능성과 관련성이 높은 데이터를 포함할 수 있다. 주행 데이터는, 예를 들어, 주행 경로 데이터(또는 내비게이션 데이터), 날씨 데이터 등 차량의 편리한 주행에 도움을 주는 데이터를 포함할 수 있다. 유저 데이터는 차량의 운전자가 요청한 데이터로서, 예를 들어, 동영상 데이터, 음악 데이터, 운전자가 접속한 웹 페이지 데이터 등을 포함할 수 있다. 도 11(b)를 참조하면, 현재 차량의 제어 모듈은 제 1 슬레이브 차량으로부터 유저 데이터의 요청 이 수신되고, 제 2 슬레이브 차량으로부터 안전 데이터의 요청이 수신된 경우, 우선 순위가 더 높은 안전 데이터를 D2D 통신 방법에 따라 제 2 슬레이브 차량으로 전달한 후, 유저 데이터를 D2D 통신 방법에 따라 제 1 슬레이브 차량으로 전달할 수 있다. 즉, 제어 모듈은 안전과 관련된 데이터를 우선적으로 슬레이브 차량으로 전달함으로써, 예기치 못한 사고 의 발생을 빠르게 대비할 수 있다. 한편, 앞서서는 이동 통신 모듈의 온도가 임계 온도 이상일 때, 제어 모듈이 새로운 마스터 차량을 선택하는 것으로 설명하였다. 일 실시예에서, 제어 모듈은 기지국으로부터 수신하여야 하는 데이터의 크기가 기 설정된 크기 이상일 때(또는 하이 쓰루풋이 필요할 때) 새로운 마스터 차량을 선택할 수도 있다. 일 실시예에서, 제어 모듈은 기지국으로부터 수신하여야 하는 데이터의 크기에 따라 복수의 마스터 차 량을 선택할 수도 있다. 하나의 마스터 차량이 대용량의 데이터를 처리하기 어려운 경우(예를 들어, 대용량 동영상의 스트리밍 서비스가 필요한 경우 등), 새로운 마스터 차량을 포함하는 복수의 마스터 차량이 대용량의 데이터를 나눠 처리함으로써, 기존 마스터 차량에게 집중되는 부하를 분산시킬 수 있다. 새로운 마스터 차량을 선택하는 방법에 대해서는 전술하였으므로, 여기서는 상세한 설명을 생략한다. 기존 마스터 차량은 새로운 마스터 차량이 수신하여야 하는 데이터의 정보를 새로운 마스터 차량에게 전송하고, 기존 마스터 차량과 새로운 마스터 차량이 함께 마스터 역할을 할 수 있다. 도 12는 일 실시예에 따른 통신 제어 방법의 흐름도이다. S1210 단계에서, 마스터 차량의 전자 장치는 이동 통신 방법에 따른 기지국과의 통신을 통해 데이터를 송수신한다. 전자 장치는 마스터 차량이 필요로 하는 데이터와 슬레이브 차량들이 필요로 하는 데이터의 요청을 기지국 으로 송신하고, 이에 대한 응답으로 데이터를 기지국으로부터 수신할 수 있다. S1220 단계에서, 전자 장치는 기지국으로부터 수신한 데이터를 D2D 통신 방법에 따라 제 1 슬레이브 차량과 제 2 슬레이브 차량으로 전송한다. S1230 단계에서, 전자 장치는 이동 통신 모듈의 온도가 임계 온도 이상인지를 판단하고, 이동 통신 모듈의 온도가 임계 온도 미만이라면, S1210 단계 내지 S1230 단계를 반복한다. 이동 통신 모듈의 온도가 임계 온도 이상인 경우, S1240 단계에서, 전자 장치는 제 1 슬레이브 차량 과 제 2 슬레이브 차량 중 새로운 마스터 차량을 선택한다. 제 1 슬레이브 차량이 새로운 마스터 차량으로 선택된 경우, S1250 단계에서, 전자 장치는 마스터 차량으로 선택되었다는 메시지를 제 1 슬레이브 차량으로 전송한다. 일 실시예에서, 전자 장치는 기지국으로부터 획득하는 데이터를 수신할 차량 정보, 데이터를 수신하기 위해 접속하여야 할 외부 장치의 주소 정보, 및 현재 차량이 기 수신한 데이터의 크기 정보 중 적어도 하나 를 제 1 슬레이브 차량으로 전송할 수 있다. S1260 단계에서, 제 1 슬레이브 차량은 이동 통신 방법에 따라 기지국과 데이터를 송수신하고, S1270 단계에서, 기지국으로부터 수신한 데이터를 슬레이브 차량으로 전환된 기존 마스터 차량의 전자 장치 와, 제 2 슬레이브 차량으로 전송한다. 도 12에 도시된 흐름도는 기존 마스터 차량의 역할이 슬레이브로 전환된 경우에 대한 것으로서, 기존 마스터 차 량이 마스터 역할을 유지하는 경우에 대해서는 도 13을 참조하여 설명한다. 도 13은 다른 실시예에 따른 통신 제어 방법의 흐름도이다. S1310 단계에서, 마스터 차량의 전자 장치는 이동 통신 방법에 따라 기지국과 데이터를 송수신한다. 전자 장치는 마스터 차량이 필요로 하는 데이터와 슬레이브 차량들이 필요로 하는 데이터의 요청을 기지국 으로 전송하고, 이에 대한 응답으로 데이터를 기지국으로부터 수신할 수 있다. S1320 단계에서, 전자 장치는 기지국으로부터 수신한 데이터를 D2D 통신 방법에 따라 제 1 슬레이브 차량, 제 2 슬레이브 차량 및 제 3 슬레이브 차량으로 전송한다. S1330 단계에서, 전자 장치는 이동 통신 모듈의 온도가 임계 온도 이상인지를 판단하고, 이동 통신 모듈의 온도가 임계 온도 미만이라면, S1310 단계 및 S1330 단계를 반복한다. 이동 통신 모듈의 온도가 임계 온도 이상인 경우, S1340 단계에서, 전자 장치는 제 1 슬레이브 차량 , 제 2 슬레이브 차량 및 제 3 슬레이브 차량 중 새로운 마스터 차량을 선택한다. 제 1 슬레이브 차량이 새로운 마스터 차량으로 선택된 경우, S1350 단계에서, 전자 장치는 마스터 차량으로 선택되었다는 메시지를 제 1 슬레이브 차량으로 전송한다.일 실시예에서, 전자 장치는 기지국으로부터 획득하는 데이터를 수신할 슬레이브 차량의 정보, 해당 데이터를 수신하기 위해 접속하여야 할 외부 장치의 주소 정보, 및 현재 차량이 기 수신한 데이터의 크기 정보 중 적어도 하나를 제 1 슬레이브 차량으로 전송할 수 있다. 일 실시예에서, 전자 장치는 제 2 슬레이브 차량과 제 3 슬레이브 차량 중 제 1 슬레이브 차 량이 담당하여야 할 슬레이브 차량이 무엇인지를 나타내는 정보를 제 1 슬레이브 차량으로 전송할 수 있다. S1360 단계에서, 제 1 슬레이브 차량은 기지국과 이동 통신 방법에 따라 데이터를 송수신하고, S1370 단계에서, 기지국으로부터 수신한 데이터를 자신이 담당하고 있는 제 2 슬레이브 차량으로 전송한다. S1380 단계에서, 기존 마스터 차량의 전자 장치는 기지국과 이동 통신 방법에 따라 데이터를 송수신하 고, S1390 단계에서, 기지국으로부터 수신한 데이터를 자신이 담당하고 있는 제 3 슬레이브 차량으로 전송한다. 도 13은 이동 통신 모듈의 온도가 임계 온도 이상일 때 S1340 단계에서 전자 장치가 새로운 마스터 차량을 선택하는 것으로 도시하고 있으나, 구현예에 따라, 전자 장치는 미리 설정된 크기 이상의 데이터의 수신이 필요한 경우에도 새로운 마스터 차량을 선택할 수 있다. 즉, 대용량 데이터의 수신이 필요한 경우, 기존 마스터 차량과 새로운 마스터 차량이 함께 데이터를 수신 및 전달함으로써, 하나의 마스터 차량에 집중되는 부 하를 분산할 수 있다. 개시된 실시예에 있어서, 제어 모듈, 이동 통신 모듈 및 D2D 통신 모듈에서 수행되는 동작들 중 적어도 하나는 인공지능(AI: Artificial Intelligence) 기술을 이용하여 수행될 수 있다. 인공 지능(AI) 기술을 이용하여 수행되는 동작은 이하에서 도 14를 참조하여 상세히 설명한다. 도 14는 일 실시예에서 인공 지능 기술을 이용하여 수행되는 동작을 설명하기 위한 도면이다. 구체적으로, 전자 장치에서 수행되는 i) 새로운 마스터 차량의 선택이 필요한지를 판단하는 동작, ii) 몇 대의 마스터 차량을 선택하여야 하는지를 판단하는 동작, iii) 어느 차량을 새로운 마스터 차량으로 선택할지를 결정하는 동작, 및 iv) D2D 통신에 따라 데이터를 어떤 순서로 전송할지를 결정하는 동작 중 적어도 하나(이하, 전자 장치의 동작)는, 신경망(neural network)을 통한 연산을 수행하는 인공지능(AI: Artificial Intelligence) 기술을 이용하여 수행될 수 있다. 예를 들어, 서버(미도시)와 차량 사이의 통신 상태에 근거하여 인공지능 기반으로 수행될 수 있다. 인공 지능 기술(이하, 'AI 기술')은 신경망(Neural Network)을 통한 연산을 기반으로 입력 데이터를 분석 및/또 는 분류 등과 같은 처리를 하여 목적하는 결과를 획득하는 기술이다. 이러한 AI 기술은 알고리즘을 활용하여 구현될 수 있다. 여기서, AI 기술을 구현하기 위한 알고리즘 또는 알고 리즘의 집합을 신경망(Neural Network)이라 한다. 신경망은 데이터를 입력받고, 전술한 분석 및/또는 분류를 위 한 연산을 수행하여, 결과 데이터를 출력할 수 있다. 신경망이 입력 데이터에 대응되는 결과 데이터를 정확하게 출력하기 위해서는, 신경망을 학습(training)시킬 필요가 있다. 여기서, '학습(training)'은 신경망에 대한 입 력 데이터들을 분석하는 방법, 입력 데이터들을 분류하는 방법, 및/또는 입력 데이터들에서 결과 데이터 생성에 필요한 특징을 추출하는 방법 등을 신경망이 스스로 발견 또는 터득할 수 있도록 훈련시키는 것을 의미할 수 있 다. 구체적으로, 학습 과정을 통하여, 신경망은 학습 데이터를 학습(training)하여 신경망 내부의 가중치 값(또 는 파라미터)들을 최적화할 수 있다. 그리고, 최적화된 가중치 값을 가지는 신경망을 통하여, 입력 데이터를 처 리함으로써, 목적하는 결과를 출력한다. 신경망은 연산을 수행하는 내부의 레이어(layer)인 은닉 레이어(hidden layer)의 개수가 복수일 경우, 즉 연산 을 수행하는 신경망의 심도(depth)가 증가하는 경우, 심층 신경망으로 분류될 수 있다. 신경망의 예로는, CNN (Convolutional Neural Network), DNN (Deep Neural Network), RNN (Recurrent Neural Network), RBM (Restricted Boltzmann Machine), DBN (Deep Belief Network), BRDNN(Bidirectional Recurrent Deep Neural Network) 및 심층 Q-네트워크 (Deep Q-Networks) 등이 있으며, 전술한 예에 한정되지 않는다. 또한, 신경망은 세분화될 수 있다. 예를 들어, CNN 신경망은 DCNN(Deep Convolution Neural Network) 또는 캡스넷(Capsnet) 신 경망(미도시) 등으로 세분화 될 수 있다. 'AI 모델'은 입력 데이터를 수신하고 목적하는 결과를 출력하도록 동작하는 적어도 하나의 레이어를 포함하는 신경망을 의미할 수 있다. 또한, 'AI 모델'은 신경망을 통한 연산을 수행하여 목적하는 결과를 출력하는 알고리즘, 복수의 알고리즘의 집합, 알고리즘(또는 알고리즘의 집합)을 실행하기 위한 프로세서(processor), 알고리즘 (또는 알고리즘의 집합)을 실행하기 위한 소프트웨어, 또는 알고리즘(또는 알고리즘의 집합)을 실행하기 위한 하드웨어를 의미할 수 있다. 도 14를 참조하면, 신경망은 학습 데이터(training data)를 입력받아 트레이닝(training)될 수 있다. 그 리고, 학습된 신경망은 입력단으로 입력 데이터(예를 들어, 차량과 관련된 정보(예를 들어, 차량의 속도, 차량 내 ECU의 부하, ECU의 온도 등), 차량 주변의 정보, 차량의 현재 위치에서 이용할 수 있는 네트워크와 관련된 정보(예를 들어, 네트워크의 타입, 이용 가능한 대역폭, 대역폭에서 송수신되는 신호의 퀄리 티) 등)를 입력받고, 입력단, 은닉 레이어(hidden layer) 및 출력단은 입력 데이터 및 이전 레이어로부터 전달된 데이터를 분석하여 출력 데이터를 출력하기 위한 연산을 수행할 수 있다. 도 14에서는 은닉 레이어가 한 개인 것으로 도시되어 있으나, 이는 예시일 뿐이고, 은닉 레이어는 복수 개일 수 있다. 일 예로, 신경망은 차량과 관련된 정보 및/또는 차량 주변의 정보에 근거하여, 어느 경우에 새로운 마스 터 차량을 선택하여야 하는지를 판단하는 방법을 학습할 수 있다. 학습이 완료된 신경망은, 차량과 관련 된 정보 및/또는 차량 주변의 정보를 입력받고, 새로운 마스터 차량의 선택이 필요한지를 판단할 수 있다. 다른 예로, 신경망은 여러 차량들 중 새로운 마스터 차량을 선택하는 방법, 및 D2D 통신에 따라 데이터를 어느 순서로 전송할지를 결정하는 방법 중 적어도 하나에 대해 학습할 수 있다. 개시된 실시예에서, 전자 장치의 동작을 수행하는 신경망은 제어 모듈(예를 들어, 도 2의 210) 내에 구현 될 수 있다. 또는, 전술한 전자 장치의 동작을 수행하는 신경망은 전자 장치와 구별된 별도의 전자 장치(미도시) 또는 프로세서(미도시) 내에 구현될 수 있다. 전술한 신경망을 통한 연산은 일 실시예에 따른 전자 장치와 무선 통신 네트워크를 통하여 통신할 수 있는 서버(미도시)에서 수행될 수도 있다. 전자 장치와 서버(미도시) 간의 통신은 도 15 및 도 16을 참조하여 설명한다. 도 15는 차량에 장착된 전자 장치와 서버를 도시하는 일 실시예에 따른 도면이다. 개시된 실시예에서, i) 새로운 마스터 차량의 선택이 필요한지를 판단하는 동작, ii) 몇 대의 마스터 차량을 선 택하여야 하는지를 판단하는 동작, iii) 어느 차량을 새로운 마스터 차량으로 선택할지를 결정하는 동작, 및 iv) D2D 통신에 따라 데이터를 어떤 순서로 전송할지를 결정하는 동작 중 적어도 하나는 서버에서 수행되 고, 수행 결과가 차량에 위치하는 전자 장치로 전송될 수 있다. 서버는 통신 네트워크를 통하여 전자 장치와 데이터를 송수신하며 데이터를 처리할 수 있다. 일 실시예에서, 차량에 장착된 별도의 전자 장치가 서버로부터 i) 새로운 마스터 차량의 선택이 필요한지 를 판단하는 동작, ii) 몇 대의 마스터 차량을 선택하여야 하는지를 판단하는 동작, iii) 어느 차량을 새로운 마스터 차량으로 선택할지를 결정하는 동작, 및 iv) D2D 통신에 따라 데이터를 어떤 순서로 전송할지를 결정하 는 동작 중 적어도 하나에 대한 결과를 수신하고, 수신된 결과를 전자 장치로 전달할 수도 있다. 이 경우, 전자 장치는 수신된 결과에 따라 동작할 수 있다. 서버는 통신 네트워크를 통하여 전자 장치와 데이터를 송수신하며 데이터를 처리하는 서버, 서버 시 스템, 서버 기반의 장치 등을 포함할 수 있다. 도 16을 참조하면, 서버는 전자 장치와 통신하는 통신 모듈, 및 적어도 하나의 인스트럭션을 수행하는 프로세서를 포함한다. 일 예로, 서버의 프로세서는 차량과 관련된 정보 및/또는 차량 주변의 정보를 입력받고, 새로운 마스터 차량을 선택할 필요성이 있는지를 판단할 수 있다. 통신 모듈은 새로운 마스터 차량을 선 택하여야 한다는 정보를 전자 장치로 전송할 수 있다. 다른 예로, 서버의 프로세서는 여러 차량들 중 새로운 마스터 차량으로 동작할 차량을 선택할 수 있다. 통신 모듈은 새로운 마스터 차량으로 동작할 차량의 정보를 전자 장치로 전송할 수 있다. 개시된 실시예에서, 서버는 도 14를 참조하여 설명한 신경망을 통한 연산을 수행하여 전자 장치 의 동작을 수행할 수 있다. 구체적으로, 서버는 AI 모델을 훈련시키고, 훈련된 AI 모델을 저장하고 있을 수 있다. 그리고, 서버는 훈련된 AI 모델을 이용하여 전술한 전자 장치의 동작을 수행할 수 있 다. 일반적으로, 전자 장치는 메모리 저장 용량, 연산의 처리 속도, 학습 데이터 셋의 수집 능력 등이 서버 에 비하여 제한적일 수 있다. 따라서, 대용량 데이터의 저장 및 대용량의 연산량이 필요한 동작은 서버 에서 수행한 후, 통신 네트워크를 통하여 필요한 데이터 및/또는 AI 모델을 전자 장치에 전송할 수 있다. 그러면, 전자 장치는 대용량의 메모리 및 빠른 연산 능력을 갖는 프로세서 없이도, 서버를 통 하여 필요한 데이터 및/또는 AI 모델을 수신하여 이용함으로써, 빠르고 용이하게 필요한 동작을 수행할 수 있다. 개시된 실시예에서, 서버는 도 14에서 설명한 신경망을 포함할 수 있다. 구체적으로, 서버에 포함되는 신경망은 전술한 전자 장치의 동작을 위한 연산을 수행할 수 있다. 전자 장치의 통신 모듈(예를 들어, 도 2에 도시된 이동통신 모듈 또는 D2D 통신 모듈)은 무선 통신 네트워크를 통해서 외부 장치와 통신을 수행한다. 여기서, 외부 장치는 전자 장치가 필요 로 하는 연산 중 적어도 하나를 수행하거나, 전자 장치가 필요로 하는 데이터 등을 송신할 수 있는 서버 를 포함할 수 있다. 통신 모듈은, 근거리 통신 모듈, 유선 통신 모듈, 이동 통신 모듈, 방송 수신 모듈 등과 같은 적어도 하나 의 통신 모듈을 포함한다. 여기서, 통신 모듈은 방송 수신을 수행하는 튜너, 블루투스, WLAN(Wireless LAN)(Wi-Fi), Wibro(Wireless broadband), Wimax(World Interoperability for Microwave Access), CDMA, WCDMA, 인터넷, 3G, 4G, 5G 및/또는 밀리미터파(mmwave)를 이용한 통신 방식과 같은 통신 규격을 따르는 네트워 크를 통하여 데이터 송수신을 수행할 수 있는 통신 모듈을 포함한다. 예를 들어, 통신 모듈이 밀리미터파(mmWAVE)를 이용하여 통신을 수행하면, 대용량의 데이터를 빠르게 송수 신할 수 있다. 구체적으로, 차량은 밀리미터파를 이용하여 대용량의 데이터를 빠르게 수신하고, 차량의 안전에 필요한 데이터(예를 들어, 자율 주행에 필요한 데이터, 네비게이션 서비스를 위해 필요한 데이터 등), 사용자 이용 컨텐츠(예를 들어, 영화, 음악 등) 등을 빠르게 제공함으로써, 차량의 안전성 및/또는 사용자 의 편리성을 증가시킬 수 있다. 통신 모듈은 3G, 4G, 및/또는 5G 등의 통신 규격에 따르는 통신 네트워크를 통하여 원거리에 위치하는 다 른 장치(예를 들어, 서버)와 통신을 수행할 수 있다. 여기서, 원거리에 위치하는 다른 장치와 통신을 수 행하는 통신 모듈을 '원거리 통신 모듈'이라 참조할 수 있다. 서버의 통신 모듈은 전자 장치와 통신을 하게 하는 하나 이상의 구성요소를 포함할 수 있다. 통신 모듈의 구체적인 구성은, 전술한 통신 모듈의 구성과 동일하게 대응되므로, 상세한 설명은 생 략한다. 예를 들어, 통신 모듈은 인터넷, 3G, 4G, 및/또는 5G 등의 통신 규격에 따르는 통신 네트워크를 통하여 원거리에 위치하는 다른 장치(예를 들어, 전자 장치)와 통신을 수행할 수 있다. 프로세서는 서버의 전반적인 동작을 제어한다. 예를 들어, 프로세서는, 서버의 적어도 하나의 인스트럭션, 및 프로그램들 중 적어도 하나를 실행함으로써, 요구되는 동작들을 수행할 수 있다. DB는 메모리(미도시)를 포함할 수 있으며, 메모리(미도시) 내에 서버가 소정 동작을 수행하기 위해 서 필요한 적어도 하나의 인스트럭션, 프로그램, 데이터 중 적어도 하나를 저장할 수 있다. 또한, DB는 서버가 신경망에 따른 연산을 수행하기 위해서 필요한 데이터들을 저장할 수 있다. 개시된 실시예에서, 서버는 도 14에서 설명한 신경망을 저장하고 있을 수 있다. 신경망은 프 로세서 및 DB 중 적어도 하나에 저장될 수 있다. 서버가 저장하는 신경망은 학습이 완 료된 신경망일 수 있다. 개시된 실시예에서, 서버는 내부적으로 포함하는 신경망을 이용하여 전술한 전자 장치의 동작을 수 행하고, 수행된 결과로 도출된 데이터를 통신 모듈를 통하여 전자 장치의 통신 모듈로 전송할 수 있다. 또한, 서버는 학습이 완료된 신경망을 통신 모듈을 통하여 전자 장치의 통신 모듈로 전 송할 수 있다. 그러면, 전자 장치는 학습이 완료된 신경망을 획득 및 저장하고, 신경망을 통하여 목적하는 출력 데이터를 획득할 수 있다. 도 17은 일부 실시예에 따른 전자 장치에 포함된 프로세서의 블록도이다. 도 17을 참조하면, 일부 실시예에 따른 프로세서는 데이터 학습부 및 데이터 인식부를 포함할 수 있다. 데이터 학습부는 전자 장치의 동작을 위한 기준을 학습할 수 있다. 예를 들어, 데이터 학습부는 전자 장치의 동작을 위해 어떤 데이터를 이용할 지, 데이터를 이용하여 전자 장치의 동작을 어떻게 수행할 지에 관한 기준을 학습할 수 있다. 데이터 학습부는 학습에 이용될 데이터를 획득하고, 획득된 데이터를 후술할 데이터 인식 모델에 적용함 으로써, 전자 장치의 동작을 위한 기준을 학습할 수 있다. 데이터 인식부는 차량과 관련된 정보, 차량 주변의 정보 및 차량의 현재 위치에서 이용 가능 한 네트워크와 관련된 정보 중 적어도 하나에 기초하여 전자 장치의 동작을 수행할 수 있다. 데이터 인식 모델에 의해 출력된 결과 값은, 데이터 인식 모델을 갱신하는데 이용될 수 있다. 데이터 학습부 및 데이터 인식부 중 적어도 하나는, 적어도 하나의 하드웨어 칩 형태로 제작되어 전자 장치에 탑재될 수 있다. 예를 들어, 데이터 학습부 및 데이터 인식부 중 적어도 하나는 인공 지능(AI; artificial intelligence)을 위한 전용 하드웨어 칩 형태로 제작될 수도 있고, 또는 기존의 범용 프로세서(예: CPU 또는 application processor) 또는 그래픽 전용 프로세서(예: GPU)의 일부로 제작되어 전술한 전자 장치에 탑재될 수도 있다. 데이터 학습부 및 데이터 인식부는 하나의 전자 장치에 탑재될 수도 있으며, 또는 별개의 장 치들에 각각 탑재될 수도 있다. 예를 들어, 데이터 학습부 및 데이터 인식부 중 하나는 전자 장치 에 포함되고, 나머지 하나는 서버에 포함될 수 있다. 또한, 데이터 학습부 및 데이터 인식부 는 유선 또는 무선으로 통하여, 데이터 학습부가 구축한 모델 데이터를 데이터 인식부로 제 공할 수도 있고, 데이터 인식부로 입력된 데이터가 추가 학습 데이터로서 데이터 학습부로 제공될 수도 있다. 한편, 데이터 학습부 및 데이터 인식부 중 적어도 하나는 소프트웨어 모듈로 구현될 수 있다. 데이 터 학습부 및 데이터 인식부 중 적어도 하나가 소프트웨어 모듈(또는, 인스터력션(instruction) 포 함하는 프로그램 모듈)로 구현되는 경우, 소프트웨어 모듈은 컴퓨터로 읽을 수 있는 판독 가능한 비일시적 판독 가능 기록매체(non-transitory computer readable media)에 저장될 수 있다. 또한, 이 경우, 적어도 하나의 소 프트웨어 모듈은 OS(Operating System)에 의해 제공되거나, 소정의 애플리케이션에 의해 제공될 수 있다. 또는, 적어도 하나의 소프트웨어 모듈 중 일부는 OS(Operating System)에 의해 제공되고, 나머지 일부는 소정의 애플 리케이션에 의해 제공될 수 있다. 도 18은 일부 실시예에 따른 데이터 학습부의 블록도이다. 도 18을 참조하면, 일부 실시예에 따른 데이터 학습부는 데이터 획득부(1710-1), 전처리부(1710-2), 학습 데이터 선택부(1710-3), 모델 학습부(1710-4) 및 모델 평가부(1710-5)를 포함할 수 있다. 데이터 획득부(1710-1)는 전자 장치의 동작에 필요한 데이터를 획득할 수 있다. 데이터 획득부(1710-1)는 전자 장치의 동작의 학습을 위하여 필요한 데이터를 획득할 수 있다. 전처리부(1710-2)는 학습을 위해 획득된 데이터를 전처리할 수 있다. 전처리부(1710-2)는 후술할 모델 학습부 (1710-4)가 전자 장치의 동작을 위한 학습을 위하여 데이터를 이용할 수 있도록, 데이터를 기 설정된 포맷 으로 가공할 수 있다. 학습 데이터 선택부(1710-3)는 전처리된 데이터 중에서 학습에 필요한 데이터를 선택할 수 있다. 선택된 데이터 는 모델 학습부(1710-4)에 제공될 수 있다. 학습 데이터 선택부(1710-3)는 전자 장치의 동작을 위한 기 설 정된 기준에 따라, 전처리된 데이터 중에서 학습에 필요한 데이터를 선택할 수 있다. 또한, 학습 데이터 선택부 (1710-3)는 후술할 모델 학습부(1710-4)에 의한 학습에 의해 기 설정된 기준에 따라 데이터를 선택할 수도 있다.모델 학습부(1710-4)는 전자 장치의 동작을 어떻게 수행할 지에 관한 기준을 학습할 수 있다. 또한, 모델 학습부(1710-4)는 전자 장치의 동작을 위하여 어떤 학습 데이터를 이용해야 하는 지에 대한 기준을 학습할 수도 있다. 또한, 모델 학습부(1710-4)는 전자 장치의 동작에 이용되는 데이터 인식 모델을 학습 데이터를 이용하여 학습시킬 수 있다. 이 경우, 데이터 인식 모델은 미리 구축된 모델일 수 있다. 예를 들어, 데이터 인식 모델은 기본 학습 데이터(예를 들어, 샘플 데이터 등)를 입력 받아 미리 구축된 모델일 수 있다. 데이터 인식 모델은, 인식 모델의 적용 분야, 학습의 목적 또는 장치의 컴퓨터 성능 등을 고려하여 구축될 수 있다. 데이터 인식 모델은, 예를 들어, 신경망(Neural Network)을 기반으로 하는 모델일 수 있다. 예컨대, CNN(Convolutional Neural Network), DNN(Deep Neural Network), RNN(Recurrent Neural Network), BRDNN(Bidirectional Recurrent Deep Neural Network)과 같은 모델이 데이터 인식 모델로서 사용될 수 있으나, 이에 한정되지 않는다. 다양한 실시예에 따르면, 모델 학습부(1710-4)는 미리 구축된 데이터 인식 모델이 복수 개가 존재하는 경우, 입 력된 학습 데이터와 기본 학습 데이터의 관련성이 큰 데이터 인식 모델을 학습할 데이터 인식 모델로 결정할 수 있다. 이 경우, 기본 학습 데이터는 데이터의 타입 별로 기 분류되어 있을 수 있으며, 데이터 인식 모델은 데이 터의 타입 별로 미리 구축되어 있을 수 있다. 예를 들어, 기본 학습 데이터는 학습 데이터가 생성된 지역, 학습 데이터가 생성된 시간, 학습 데이터의 크기, 학습 데이터의 장르, 학습 데이터의 생성자, 학습 데이터 내의 오 브젝트의 종류 등과 같은 다양한 기준으로 기 분류되어 있을 수 있다. 또한, 모델 학습부(1710-4)는, 예를 들어, 오류 역전파법(error back-propagation) 또는 경사 하강법(gradient descent)을 포함하는 학습 알고리즘 등을 이용하여 데이터 인식 모델을 학습시킬 수 있다. 또한, 모델 학습부(1710-4)는, 예를 들어, 학습 데이터를 입력 값으로 하는 지도 학습(supervised learning)을 통하여, 데이터 인식 모델을 학습시킬 수 있다. 또한, 모델 학습부(1710-4)는, 예를 들어, 별다른 지도없이 전 자 장치의 동작을 위해 필요한 데이터의 종류를 스스로 학습함으로써, 전자 장치의 동작을 수행하기 위한 기준을 발견하는 비지도 학습(unsupervised learning)을 통하여, 데이터 인식 모델을 학습시킬 수 있다. 또한, 모델 학습부(1710-4)는, 예를 들어, 강화 학습(reinforcement learning)을 통하여, 데이터 인식 모델을 학습시킬 수 있다. 또한, 데이터 인식 모델이 학습되면, 모델 학습부(1710-4)는 학습된 데이터 인식 모델을 저장할 수 있다. 이 경 우, 모델 학습부(1710-4)는 학습된 데이터 인식 모델을 데이터 인식부를 포함하는 전자 장치의 메모 리에 저장할 수 있다. 또는, 모델 학습부(1710-4)는 학습된 데이터 인식 모델을 전자 장치와 유선 또 는 무선 네트워크로 연결되는 서버의 메모리에 저장할 수도 있다. 이 경우, 학습된 데이터 인식 모델이 저장되는 메모리는, 예를 들면, 전자 장치의 적어도 하나의 다른 구 성요소에 관계된 명령 또는 데이터를 함께 저장할 수도 있다. 또한, 메모리는 소프트웨어 및/또는 프로그램을 저장할 수도 있다. 프로그램은, 예를 들면, 커널, 미들웨어, 어플리케이션 프로그래밍 인터페이스(API) 및/또는 어플리케이션 프로그램(또는 \"어플리케이션\") 등을 포함할 수 있다. 모델 평가부(1710-5)는 데이터 인식 모델에 평가 데이터를 입력하고, 평가 데이터로부터 출력되는 인식 결과가 소정 기준을 만족하지 못하는 경우, 모델 학습부(1710-4)로 하여금 다시 학습하도록 할 수 있다. 이 경우, 평가 데이터는 데이터 인식 모델을 평가하기 위한 기 설정된 데이터일 수 있다. 예를 들어, 모델 평가부(1710-5)는 평가 데이터에 대한 데이터 인식 모델의 인식 결과 중에서, 인식 결과가 정 확하지 않은 평가 데이터의 개수 또는 비율이 미리 설정된 임계치를 초과하는 경우 소정 기준을 만족하지 못한 것으로 평가할 수 있다. 예컨대, 소정 기준이 비율 2%로 정의되는 경우, 데이터 인식 모델이 총 1000개의 평가 데이터 중의 20개를 초과하는 평가 데이터에 대하여 잘못된 인식 결과를 출력하는 경우, 모델 평가부(1710-5)는 데이터 인식 모델이 적합하지 않은 것으로 평가할 수 있다. 한편, 학습된 데이터 인식 모델이 복수 개가 존재하는 경우, 모델 평가부(1710-5)는 각각의 학습된 데이터 인식 모델에 대하여 소정 기준을 만족하는지를 평가하고, 소정 기준을 만족하는 모델을 최종 데이터 인식 모델로서 결정할 수 있다. 이 경우, 소정 기준을 만족하는 모델이 복수 개인 경우, 모델 평가부(1710-5)는 평가 점수가 높은 순으로 미리 설정된 어느 하나 또는 소정 개수의 모델을 최종 데이터 인식 모델로서 결정할 수 있다. 한편, 데이터 학습부 내의 데이터 획득부(1710-1), 전처리부(1710-2), 학습 데이터 선택부(1710-3), 모델 학습부(1710-4) 및 모델 평가부(1710-5) 중 적어도 하나는, 적어도 하나의 하드웨어 칩 형태로 제작되어 전자 장치에 탑재될 수 있다. 예를 들어, 데이터 획득부(1710-1), 전처리부(1710-2), 학습 데이터 선택부(1710- 3), 모델 학습부(1710-4) 및 모델 평가부(1710-5) 중 적어도 하나는 인공 지능(AI; artificial intelligence) 을 위한 전용 하드웨어 칩 형태로 제작될 수도 있고, 또는 기존의 범용 프로세서(예: CPU 또는 application processor) 또는 그래픽 전용 프로세서(예: GPU)의 일부로 제작되어 전술한 전자 장치에 탑재될 수도 있다. 또한, 데이터 획득부(1710-1), 전처리부(1710-2), 학습 데이터 선택부(1710-3), 모델 학습부(1710-4) 및 모델 평가부(1710-5)는 하나의 전자 장치에 탑재될 수도 있으며, 또는 별개의 장치들에 각각 탑재될 수도 있다. 예를 들어, 데이터 획득부(1710-1), 전처리부(1710-2), 학습 데이터 선택부(1710-3), 모델 학습부(1710-4) 및 모델 평가부(1710-5) 중 일부는 전자 장치에 포함되고, 나머지 일부는 서버에 포함될 수 있다. 또한, 데이터 획득부(1710-1), 전처리부(1710-2), 학습 데이터 선택부(1710-3), 모델 학습부(1710-4) 및 모델 평가부(1710-5) 중 적어도 하나는 소프트웨어 모듈로 구현될 수 있다. 데이터 획득부(1710-1), 전처리부(1710- 2), 학습 데이터 선택부(1710-3), 모델 학습부(1710-4) 및 모델 평가부(1710-5) 중 적어도 하나가 소프트웨어 모듈(또는, 인스터력션(instruction) 포함하는 프로그램 모듈)로 구현되는 경우, 소프트웨어 모듈은 컴퓨터로 읽을 수 있는 판독 가능한 비일시적 판독 가능 기록매체(non-transitory computer readable media)에 저장될 수 있다. 또한, 이 경우, 적어도 하나의 소프트웨어 모듈은 OS(Operating System)에 의해 제공되거나, 소정의 애플리케이션에 의해 제공될 수 있다. 또는, 적어도 하나의 소프트웨어 모듈 중 일부는 OS(Operating System)에 의해 제공되고, 나머지 일부는 소정의 애플리케이션에 의해 제공될 수 있다. 도 19는 일부 실시예에 따른 데이터 인식부의 블록도이다. 도 19를 참조하면, 일부 실시예에 따른 데이터 인식부는 데이터 획득부(1720-1), 전처리부(1720-2), 인식 데이터 선택부(1720-3), 인식 결과 제공부(1720-4) 및 모델 갱신부(1720-5)를 포함할 수 있다. 데이터 획득부(1720-1)는 전자 장치의 동작에 필요한 데이터를 획득할 수 있으며, 전처리부(1720-2)는 획 득한 데이터를 전처리할 수 있다. 전처리부(1720-2)는 후술할 인식 결과 제공부(1720-4)가 전자 장치의 동 작을 위해 데이터를 이용할 수 있도록, 획득된 데이터를 기 설정된 포맷으로 가공할 수 있다. 인식 데이터 선택부(1720-3)는 전처리된 데이터 중에서 전자 장치의 동작에 필요한 데이터를 선택할 수 있 다. 선택된 데이터는 인식 결과 제공부(1720-4)에게 제공될 수 있다. 또한, 인식 데이터 선택부(1720-3)는 모델 학습부(1710-4)에 의한 학습에 의해 기 설정된 기준에 따라 데이터를 선택할 수도 있다. 인식 결과 제공부(1720-4)는 선택된 데이터를 데이터 인식 모델에 적용하여 전자 장치의 동작을 수행할 수 있다. 인식 결과 제공부(1720-4)는 데이터의 인식 목적에 따른 인식 결과를 제공할 수 있다. 인식 결과 제공부 (1720-4)는 인식 데이터 선택부(1720-3)에 의해 선택된 데이터를 입력 값으로 이용함으로써, 선택된 데이터를 데이터 인식 모델에 적용할 수 있다. 또한, 인식 결과는 데이터 인식 모델에 의해 결정될 수 있다. 모델 갱신부(1720-5)는 인식 결과 제공부(1720-4)에 의해 제공되는 인식 결과에 대한 평가에 기초하여, 데이터 인식 모델이 갱신되도록 할 수 있다. 예를 들어, 모델 갱신부(1720-5)는 인식 결과 제공부(1720-4)에 의해 제공 되는 인식 결과를 모델 학습부(1710-4)에게 제공함으로써, 모델 학습부(1710-4)가 데이터 인식 모델을 갱신하도 록 할 수 있다. 한편, 데이터 인식부 내의 데이터 획득부(1720-1), 전처리부(1720-2), 인식 데이터 선택부(1720-3), 인식 결과 제공부(1720-4) 및 모델 갱신부(1720-5) 중 적어도 하나는, 적어도 하나의 하드웨어 칩 형태로 제작되어 전자 장치에 탑재될 수 있다. 예를 들어, 데이터 획득부(1720-1), 전처리부(1720-2), 인식 데이터 선택부 (1720-3), 인식 결과 제공부(1720-4) 및 모델 갱신부(1720-5) 중 적어도 하나는 인공 지능(AI; artificial intelligence)을 위한 전용 하드웨어 칩 형태로 제작될 수도 있고, 또는 기존의 범용 프로세서(예: CPU 또는 application processor) 또는 그래픽 전용 프로세서(예: GPU)의 일부로 제작되어 전자 장치에 탑재될 수도 있다. 또한, 데이터 획득부(1720-1), 전처리부(1720-2), 인식 데이터 선택부(1720-3), 인식 결과 제공부(1720-4) 및 모델 갱신부(1720-5)는 하나의 전자 장치에 탑재될 수도 있으며, 또는 별개의 장치들에 각각 탑재될 수도 있다. 예를 들어, 데이터 획득부(1720-1), 전처리부(1720-2), 인식 데이터 선택부(1720-3), 인식 결과 제공부 (1720-4) 및 모델 갱신부(1720-5) 중 일부는 전자 장치에 포함되고, 나머지 일부는 서버에 포함될수 있다. 또한, 데이터 획득부(1720-1), 전처리부(1720-2), 인식 데이터 선택부(1720-3), 인식 결과 제공부(1720-4) 및 모델 갱신부(1720-5) 중 적어도 하나는 소프트웨어 모듈로 구현될 수 있다. 데이터 획득부(1720-1), 전처리부 (1720-2), 인식 데이터 선택부(1720-3), 인식 결과 제공부(1720-4) 및 모델 갱신부(1720-5) 중 적어도 하나가 소프트웨어 모듈(또는, 인스터력션(instruction) 포함하는 프로그램 모듈)로 구현되는 경우, 소프트웨어 모듈은 컴퓨터로 읽을 수 있는 판독 가능한 비일시적 판독 가능 기록매체(non-transitory computer readable media)에 저장될 수 있다. 또한, 이 경우, 적어도 하나의 소프트웨어 모듈은 OS(Operating System)에 의해 제공되거나, 소정의 애플리케이션에 의해 제공될 수 있다. 또는, 적어도 하나의 소프트웨어 모듈 중 일부는 OS(Operating System)에 의해 제공되고, 나머지 일부는 소정의 애플리케이션에 의해 제공될 수 있다. 도 20은 일부 실시예에 따른 전자 장치 및 서버가 서로 연동함으로써 데이터를 학습하고 인식하는 예시를 나타내는 도면이다. 도 20을 참조하면, 서버는 전자 장치의 동작을 위한 기준을 학습할 수 있으며, 전자 장치는 서 버에 의한 학습 결과에 기초하여 전자 장치의 동작을 수행할 수 있다. 이 경우, 서버의 데이터 학습부는 도 18에 도시된 데이터 학습부의 기능을 수행할 수 있다. 서버의 데이터 학습부는 소정의 상황을 판단하기 위하여 어떤 데이터를 이용할 지에 관한 기준을 학습할 수 있다. 또한, 데이터 학습부는 데이터를 이용하여 전자 장치의 동작에 대한 기준을 학습할 수 있다. 데이터 학습부는 학습에 이용될 데이터를 획득하고, 획득된 데이터를 데이터 인식 모델에 적용 함으로써, 전자 장치의 동작을 위한 기준을 학습할 수 있다. 또한, 전자 장치의 인식 결과 제공부(1720-4)는 인식 데이터 선택부(1720-3)에 의해 선택된 데이터를 서버 에 의해 생성된 데이터 인식 모델에 적용하여 전자 장치의 동작을 수행할 수 있다. 예를 들어, 인식 결과 제공부(1720-4)는 인식 데이터 선택부(1720-3)에 의해 선택된 데이터를 서버로 전송하고, 서버 가 인식 데이터 선택부(1720-3)에 의해 선택된 데이터를 인식 모델에 적용하여 전자 장치의 동작을 수행할 것을 요청할 수 있다. 또한, 인식 결과 제공부(1720-4)는 서버에 의해 수행된 동작의 결과 정보를 서버로부터 수신할 수 있다. 또는, 전자 장치의 인식 결과 제공부(1720-4)는 서버에 의해 생성된 인식 모델을 서버로부터 수신하고, 수신된 인식 모델을 이용하여 전자 장치의 동작을 수행할 수 있다. 이 경우, 전자 장치의 인식 결과 제공부(1720-4)는 인식 데이터 선택부(1720-3)에 의해 선택된 데이터를 서버로부터 수신된 데 이터 인식 모델에 적용하여 전자 장치의 동작을 수행할 수 있다. 한편, 상술한 본 개시의 실시예들은 컴퓨터에서 실행될 수 있는 프로그램으로 작성가능하고, 작성된 프로그램은 기기로 읽을 수 있는 저장매체에 저장될 수 있다. 기기로 읽을 수 있는 저장매체는, 비일시적(non-transitory) 저장매체의 형태로 제공될 수 있다. 여기서, ‘비 일시적 저장매체'는 실재(tangible)하는 장치이고, 신호(signal)(예: 전자기파)를 포함하지 않는다는 것을 의미 할 뿐이며, 이 용어는 데이터가 저장매체에 반영구적으로 저장되는 경우와 임시적으로 저장되는 경우를 구분하 지 않는다. 예로, '비일시적 저장매체'는 데이터가 임시적으로 저장되는 버퍼를 포함할 수 있다. 일 실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어를 통해 또는 두개의 사용자 장치들(예: 스마트폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품(예: 다운 로더블 앱(downloadable app))의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 이상, 본 개시의 기술적 사상을 바람직한 실시예를 들어 상세하게 설명하였으나, 본 개시의 기술적 사상은 상기 실시예들에 한정되지 않고, 본 개시의 기술적 사상의 범위 내에서 당 분야에서 통상의 지식을 가진 자에 의하여 여러 가지 변형 및 변경이 가능하다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13 도면14 도면15 도면16 도면17 도면18 도면19 도면20"}
{"patent_id": "10-2022-0010228", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 따라 군집 주행 중인 차량들의 통신 환경을 설명하기 위한 도면이다. 도 2는 일 실시예에 따른 전자 장치의 구성을 도시하는 도면이다.도 3은 일 실시예에 따른 전자 장치에 의한 통신 제어 방법을 설명하기 위한 순서도이다. 도 4는 일 실시예에 따라 새로운 마스터 차량이 선택됨에 따라 군집 주행 중인 차량들의 통신 환경이 변경됨을 나타내는 도면이다. 도 5는 다른 실시예에 따라 새로운 마스터 차량이 선택됨에 따라 군집 주행 중인 차량들의 통신 환경이 변경됨 을 나타내는 도면이다. 도 6은 일 실시예에 따른 새로운 마스터 차량을 선택하는 방법을 설명하기 위한 도면이다. 도 7(a) 및 도 7(b)는 다른 실시예에 따른 새로운 마스터 차량을 선택하는 방법을 설명하기 위한 도면이다. 도 8은 일 실시예에 따라 군집 주행 중인 차량에 대한 통신 차단 가능성을 판단하는 방법을 설명하기 위한 도면 이다. 도 9는 일 실시예에 따라 군집 주행 중인 차량에 대한 통신 차단 가능성을 판단하는 방법을 설명하기 위한 도면 이다. 도 10(a) 및 도 10(b)는 다른 실시예에 따라 군집 주행 중인 차량에 대한 통신 차단 가능성을 판단하는 방법을 설명하기 위한 도면이다. 도 11(a) 및 도 11(b)는 일 실시예에 따라 제 1 슬레이브 차량과 제 2 슬레이브 차량이 필요로 하는 데이터의 우선 순위를 고려하여 현재 차량이 데이터를 전달하는 과정을 설명하기 위한 도면이다. 도 12는 일 실시예에 따른 통신 제어 방법의 흐름도이다. 도 13은 다른 실시예에 따른 통신 제어 방법의 흐름도이다. 도 14는 일 실시예에서 인공 지능 기술을 이용하여 수행되는 동작을 설명하기 위한 도면이다. 도 15는 차량에 장착된 전자 장치와 서버를 도시하는 일 실시예에 따른 도면이다. 도 16은 서버, 및 서버와 연동하여 동작하는 전자 장치를 나타내는 도면이다. 도 17은 일 실시예에 따른 전자 장치에 포함된 프로세서의 블록도이다. 도 18은 일 실시예에 따른 데이터 학습부의 블록도이다. 도 19는 일 실시예에 따른 데이터 인식부의 블록도이다. 도 20은 일 실시예에 따른 전자 장치 및 서버가 서로 연동함으로써 데이터를 학습하고 인식하는 예시를 나타내 는 도면이다."}
