{"patent_id": "10-2020-0174840", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0084895", "출원번호": "10-2020-0174840", "발명의 명칭": "온디바이스 기반 데이터 분석 시스템 및 방법", "출원인": "한국전자기술연구원", "발명자": "강정훈"}}
{"patent_id": "10-2020-0174840", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "외부로부터 제공받은 다수의 측정데이터를 수집하고 수집된 측정데이터에 대한 전처리 및 분석을 수행하여 분석결과를 시각화 대쉬보드로 전달하는 온디바이스 처리장치를 포함하되,상기 온디바이스 처리장치는,수집된 측정데이터의 크기와 온디바이스 자원 사용율의 비교 결과를 토대로 온디바이스 자원 사용율을 초과하는수집된 측정데이터를 클라우드 서버로 전달하도록 구비되는 것을 특징으로 하는 온디바이스 기반 데이터 분석시스템."}
{"patent_id": "10-2020-0174840", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 온디바이스 처리장치는 외부로부터 제공받은 다수의 측정데이터를 수집하는 측정데이터 수집부;수집된 측정데이터의 크기가 온디바이스 자원 사용율의 소정 범위 내에 존재하는 지를 비교하는 제1 비교부; 및상기 비교 결과 측정데이터의 크기가 온디바이스 자원 사용율의 소정 범위 내에 존재하는 경우 측정데이터를 단위 시간별 단위 크기로 측정데이터를 분할한 다음 분할된 측정데이터에 대해 전처리 및 분석하는 제1 처리부를포함하는 것을 특징으로 하는 온디바이스 기반 데이터 분석 시스템."}
{"patent_id": "10-2020-0174840", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 온디바이스 처리장치는상기 측정데이터의 크기가 온디바이스 자원 사용율의 소정 범위 내에 존재하지 아니한 경우 측정데이터의 크기를 온디바이스 자원 사용율의 상기 소정 범위의 하한치와 비교하는 제2 비교부; 및상기 측정데이터의 크기가 온디바이스 자원 사용율의 상기 소정 범위의 하한치 미만인 경우 수집된 측정데이터의 노이즈 제거 및 전처리를 수행하는 제2 처리부를 더 포함하는 것을 특징으로 하는 온디바이스 기반 데이터분석 시스템."}
{"patent_id": "10-2020-0174840", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 온디바이스 처리장치는 상기 제2 처리부의 상기 노이즈 제거 및 전처리 수행이 정상인 지를 판단하는 제1 판단부; 및 제1 판단부 결과 노이즈 제거 및 전처리 수행이 정상이 아닌 경우 기 구축된 인공지능 모델 기반으로 학습하여분할된 측정데이터에 대한 노이즈 제거 및 전처리를 수행하는 제3 처리부를 더 포함하는 것을 특징으로 하는 온디바이스 기반 데이터 분석 시스템."}
{"patent_id": "10-2020-0174840", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 온디바이스 처리장치는상기 인공지능 모델 기반으로의 학습 수행이 정상인 지를 판단하는 제2 판단부를 더 포함하고,제2 판단부의 판단 결과 인공지능 기반의 학습이 정상이 아닌 경우 또는 상기 측정데이터의 크기가 온디바이스자원 사용율의 소정 범위의 상한치 이상인 경우 수집된 측정데이터를 클라우드 서버로 전달하는 통신부를 더 포함하는 것을 특징으로 하는 온디바이스 기반 데이터 분석 시스템."}
{"patent_id": "10-2020-0174840", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2022-0084895-3-외부로부터 제공된 다수의 측정데이터를 수집하는 측정데이터 수집단계; 및상기 수집된 측정데이터의 크기와 기 정해진 온디바이스 자원 사용율을 비교하고 비교 결과를 토대로 수집된 측정데이터의 크기가 온디바이스 자원 사용율의 소정 범위 내에 존재하는 지를 판단하는 제1 비교단계; 및상기 수집된 측정데이터의 크기가 온디바이스 자원 사용율의 소정 범위 내에 존재하는 경우 수집된 측정데이터의 전처리 및 분석을 수행하는 제1 처리단계를 포함하는 것을 특징으로 하는 온디바이스 기반 데이터 분석방법."}
{"patent_id": "10-2020-0174840", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 제1 비교단계에서,수집된 측정데이터의 크기가 온디바이스 자원 사용율의 소정 범위 내에 존재하지 아니한 경우 수집된 측정데이터의 크기를 온디바이스 자원 사용율의 소정 범위의 하한치와 비교하는 제2 비교단계; 및상기 측정데이터의 크기가 온디바이스 자원 사용율의 소정 범위의 하한치 미만인 경우 수집된 측정데이터의 노이즈 제거 및 전처리를 수행하는 제2 처리단계를 더 포함하는 것을 특징으로 하는 온디바이스 기반 데이터 분석방법."}
{"patent_id": "10-2020-0174840", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 제2 처리단계에서측정데이터의 노이즈 제거 및 전처리가 정상인 지를 판단하는 제1 판단단계; 및상기 측정데이터의 노이즈 제거 및 전처리가 정상이 아닌 경우 측정데이터에 대해 인공지능 모델 기반의 학습을수행하여 측정데이터의 노이즈 제거 및 전처리를 수행하는 제3 처리단계를 더 포함하는 것을 특징으로 하는 온디바이스 기반 데이터 분석 방법."}
{"patent_id": "10-2020-0174840", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서, 상기 제1 판단단계에서, 수집된 측정데이터에 대한 인공지능 모델 학습이 정상적으로 수행되는 지를 판단하는 제2 판단단계; 및 수집된 측정데이터에 대한 인공지능 모델 학습이 정상적으로 수행되지 아니한 경우 수집된 측정데이터를 클라우드 서버로 전달하는 통신 단계를 더 포함하는 것을 특징으로 하는 온디바이스 기반 데이터 분석 방법."}
{"patent_id": "10-2020-0174840", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제6항 내지 제9항 중 한 중의 온디바이스 기반 데이터 분석 방법을 실행하기 위한 프로그램이 기록되고 컴퓨터에서 판단 가능한 기록매체."}
{"patent_id": "10-2020-0174840", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 기술은 온디바이스 기반 데이터 분석 시스템 및 방법이 개시된다. 본 발명의 구체적인 예에 따르면, 유저 요 청에 의거 센서, 공정, 또는 각종 장비로부터 수집된 측정데이터의 크기가 온디바이스 자원 사용율의 소정 범위 의 상한치 이상인 경우 수집된 측정데이터를 클라우드 서버로 전달하여 클라우드 기반으로 측정데이터에 대한 노 이즈 제거, 전처리 및 분석을 수행하고, 측정데이터의 크기가 온디바이스 자원 사용율의 소정 범위 내에 존재하 거나 하한치 미만인 경우 온디바이스 기반으로 측정데이터에 대한 노이즈 제거, 전처리 및 분석을 수행함에 따라, 온디바이스 및 클라우스 서버 간의 분산 처리가 가능하고 이에 클라우드 서버의 부하를 감소할 수 있다."}
{"patent_id": "10-2020-0174840", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 온디바이스 기반 데이터 분석 시스템 및 방법에 관한 것으로서, 보다 상세하게는 유저 요청에 의거 수집된 측정데이터의 크기가 온디바이스 자원 사용율을 초과하는 경우 수집된 측정데이터를 클라우드 서버로 전 달함에 따라 클라우드 서버의 부하를 감소할 수 있도록 한 기술에 관한 것이다."}
{"patent_id": "10-2020-0174840", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "클라우드(cloud) 컴퓨팅(computing)은 한곳에 모인 비교적 큰 컴퓨팅 자원을 효율적으로 활용함으로써 비용을 절감할 수 있는 컴퓨팅 모델을 의미한다. 클라우드 서비스 제공자(Cloud Service Provider; CSP)는 컴퓨팅 자원 을 클라우드 사용자(Cloud Customer)들의 요구에 맞게 제공함으로써 자신의 컴퓨팅 자원을 효율적으로 사용한다. 클라우드 사용자는 클라우드 컴퓨팅을 통해 자신의 컴퓨팅 환경을 구축할 필요 없이 원하는 만큼의 컴퓨팅 자원 을 사용할 수 있고, 사용량에 따라 클라우드 제공자에게 비용을 지불할 수 있다. 클라우드 컴퓨팅은 매우 유망한 컴퓨팅 모델로서, 전세계 클라우드 시장 규모가 2009년에 약 800억 달러에 이르 렀으며, 2010년에는 1095억 달러로 성장할 만큼, 앞으로 대부분의 컴퓨팅 모델은 클라우드 컴퓨팅 모델로 변경 될 것으로 예측되고 있다. 그러나, 클라우드 컴퓨팅 방식에서의 전처리 및 분석은 클라우드 서버에 의거 처리되는데, 갈수록 늘어나는 데 이터의 처리를 위해 데이터를 저장하기 위한 저장소가 증가되며, 또한 늘어나는 데이터를 처리하여야 하는 분석 성능도 더 높아져야 한다. 이에 데이터 량의 증가에 따라 하드웨어의 구축비용이 증가하는 한계에 도달하였다. 이에 본 출원인은 유저 요청에 의거 센서, 공정, 또는 각종 장비로부터 수집된 측정데이터의 크기가 온디바이스 자원 사용율을 초과하는 경우 수집된 측정데이터를 클라우드 서버로 전달함에 따라 클라우드 서버의 부하를 감 소할 수 있는 방안을 제안하고자 한다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허 제10-2182606호(온-디바이스 모델을 사용하는 스마트 응답들)"}
{"patent_id": "10-2020-0174840", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 유저 요청에 의거 센서, 공정, 또는 각종 장비로부터 수집된 측정데이터의 크기가 온디바이스 자원 사용율을 초과하는 경우 수집된 측정데이터를 클라우드 서버로 전달함에 따라 클라우드 서버의 부하를 감소할 수 있는 온디바이스 기반 데이터 분석 시스템 및 방법을 제공하고자 한다. 이에 본 발명은 클라우드 서버와 온디바이스 처리장치의 분산 처리에 의거 분석 결과를 실시간으로 제공함에 따 라 이에 분석 결과를 실시간으로 확인할 수 있는 온디바이스 기반 데이터 분석 시스템 및 방법을 제공하고자 한 다. 본 발명의 목적은 이상에서 언급한 목적으로 제한되지 않으며, 언급되지 않은 본 발명의 다른 목적 및 장점들은 하기의 설명에 의해서 이해될 수 있으며, 본 발명의 실시예에 의해 보다 분명하게 알게 될 것이다. 또한, 본 발 명의 목적 및 장점들은 특허청구 범위에 나타낸 수단 및 그 조합에 의해 실현될 수 있음을 쉽게 알 수 있을 것 이다."}
{"patent_id": "10-2020-0174840", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 한 실시예에 따른 온디바이스 기반 데이터 분석 시스템은 외부로부터 제공받은 다수의 측정데이터를 수집하고 수집된 측정데이터에 대한 전처리 및 분석을 수행하여 분석 결과를 시각화 대쉬보드로 전달하는 온디바이스 처리장치를 포함하되, 상기 온디바이스 처리장치는, 수집된 측정데이터의 크기와 온디바이스 자원 사용율의 비교 결과를 토대로 온디바이스 자원 사용율을 초과하는 수집된 측정데이터를 클라우드 서버로 전달하도록 구비되는 것을 일 특징으로 한다. 바람직하게 상기 온디바이스 처리장치는 외부로부터 제공받은 다수의 측정데이터를 수집하는 측정데이터 수집부; 수집된 측정데이터의 크기가 온디바이스 자원 사용율의 소정 범위 내에 존재하는 지를 비교하는 제1 비교부; 상기 비교 결과 측정데이터의 크기가 온디바이스 자원 사용율의 소정 범위 내에 존재하는 경우 측정데이터를 단 위 시간별 단위 크기로 측정데이터를 분할한 다음 분할된 측정데이터에 대해 전처리 및 분석하는 제1 처리부를 포함할 수 있다.바람직하게 상기 온디바이스 처리장치는 상기 측정데이터의 크기가 온디바이스 자원 사용율의 소정 범위 내에 존재하지 아니한 경우 측정데이터의 크기 를 온디바이스 자원 사용율의 상기 소정 범위의 하한치와 비교하는 제2 비교부; 및 상기 측정데이터의 크기가 온디바이스 자원 사용율의 상기 소정 범위의 하한치 미만인 경우 수집된 측정데이터 의 노이즈 제거 및 전처리를 수행하는 제2 처리부를 더 포함하도록 구비될 수 있다. 바람직하게 상기 온디바이스 처리장치는 상기 제2 처리부의 상기 노이즈 제거 및 전처리 수행이 정상인 지를 판단하는 제1 판단부; 및 제1 판단부 결과 노이즈 제거 및 전처리 수행이 정상이 아닌 경우 기 구축된 인공지능 모델 기반으로 학습하여 분할된 측정데이터에 대한 노이즈 제거 및 전처리를 수행하는 제3 처리부를 더 포함하도록 구비될 수 있다. 바람직하게 상기 온디바이스 처리장치는 상기 인공지능 모델 기반으로의 학습 수행이 정상인 지를 판단하는 제2 판단부를 더 포함하고, 제2 판단부의 판단 결과 인공지능 기반의 학습이 정상이 아닌 경우 또는 상기 측정데이터의 크기가 온디바이스 자원 사용율의 소정 범위의 상한치 이상인 경우 수집된 측정데이터를 클라우드 서버로 전달하는 통신부를 더 포 함할 수 있다. 본 발명의 다른 실시 양태에 의거한 온디바이스 기반 데이터 분석 방법은 외부로부터 제공된 다수의 측정데이터를 수집하는 측정데이터 수집단계; 및 상기 수집된 측정데이터의 크기와 기 정해진 온디바이스 자원 사용율을 비교하고 비교 결과를 토대로 수집된 측 정데이터의 크기가 온디바이스 자원 사용율의 소정 범위 내에 존재하는 지를 판단하는 제1 비교단계; 및 상기 수집된 측정데이터의 크기가 온디바이스 자원 사용율의 소정 범위 내에 존재하는 경우 수집된 측정데이터 의 전처리 및 분석을 수행하는 제1 처리단계를 포함하는 것을 일 특징으로 한다. 바람직하게 상기 제1 비교단계에서, 수집된 측정데이터의 크기가 온디바이스 자원 사용율의 소정 범위 내에 존재하지 아니한 경우 수집된 측정데이 터의 크기를 온디바이스 자원 사용율의 소정 범위의 하한치와 비교하는 제2 비교단계; 및 상기 측정데이터의 크기가 온디바이스 자원 사용율의 소정 범위의 하한치 미만인 경우 수집된 측정데이터의 노 이즈 제거 및 전처리를 수행하는 제2 처리단계를 더 포함할 수 있다. 바람직하게 상기 제2 처리단계에서 측정데이터의 노이즈 제거 및 전처리가 정상인 지를 판단하는 제1 판단단계; 및 상기 측정데이터의 노이즈 제거 및 전처리가 정상이 아닌 경우 측정데이터에 대해 인공지능 모델 기반의 학습을 수행하여 측정데이터의 노이즈 제거 및 전처리를 수행하는 제3 처리단계를 더 포함할 수 있다. 바람직하게 상기 제1 판단단계에서, 수집된 측정데이터에 대한 인공지능 모델 학습이 정상적으로 수행되는 지를 판단하는 제2 판단단계; 및 수집된 측정데이터에 대한 인공지능 모델 학습이 정상적으로 수행되지 아니한 경우 수집된 측정데이터를 클라 우드 서버로 전달하는 통신 단계를 더 포함할 수 있다."}
{"patent_id": "10-2020-0174840", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이러한 특징에 따르면 유저 요청에 의거 센서, 공정, 또는 각종 장비로부터 수집된 측정데이터의 크기가 온디바 이스 자원 사용율의 소정 범위의 상한치 이상인 경우 수집된 측정데이터를 클라우드 서버로 전달하여 클라우드 기반으로 측정데이터에 대한 노이즈 제거, 전처리 및 분석을 수행하고, 측정데이터의 크기가 온디바이스 자원 사용율의 소정 범위 내에 존재하거나 하한치 미만인 경우 온디바이스 기반으로 측정데이터에 대한 노이즈 제거, 전처리 및 분석을 수행함에 따라, 온디바이스 및 클라우스 서버 간의 분산 처리가 가능하고 이에 클라우드 서버 의 부하를 감소할 수 있다. 또한 일 실시예에 의거, 분석 결과를 시각화 대쉬보드를 통해 실시간으로 확인할 수 있는 효과를 가진다."}
{"patent_id": "10-2020-0174840", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 도면을 참조하여 본 발명의 실시예들을 보다 상세하게 설명한다. 본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 후술되어 있는 실시예들을 참 조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서로 다른 다 양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하고, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구 항의 범주에 의해 정의될 뿐이다. 본 명세서에서 사용되는 용어에 대해 간략히 설명하고, 본 발명에 대해 구체적으로 설명하기로 한다. 본 발명에서 사용되는 용어는 본 발명에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수 있 다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 발명의 설명 부분에서 상세 히 그 의미를 기재할 것이다. 따라서 본 발명에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가지 는 의미와 본 발명의 전반에 걸친 내용을 토대로 정의되어야 한다. 명세서 전체에서 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있음을 의미한다. 또한, 명세서에서 사용되는 \"부\"라는 용어는 소프트웨어, FPGA 또는 ASIC과 같은 하드웨어 구성요소를 의미하며, \"부\"는 어떤 역할들을 수 행한다. 그렇지만 \"부\"는 소프트웨어 또는 하드웨어에 한정되는 의미는 아니다. \"부\"는 어드레싱할 수 있는 저 장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 \"부\"는 소프트웨어 구성요소들, 객체지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태 스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로 코드, 회로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레 이들 및 변수들을 포함한다. 구성요소들과 \"부\"들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 \"부\"들 로 결합되거나 추가적인 구성요소들과 \"부\"들로 더 분리될 수 있다. 아래에서는 첨부한 도면을 참고하여 본 발명의 실시예에 대하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관계없는 부분은 생략한다. 도 1은 일 실시예의 온디바이스 기반 데이터 분석 시스템의 구성도이고, 도 2는 도 1의 온디바이스 처리장치의 세부 구성도이다. 도 1 및 도 2를 참조하면, 일 실시예에 따른 온디바이스 기반 데이터 분석 시스템은, 유저 요청에 의거 센서, 공정, 또는 각종 장비로부터 수집된 측정데이터의 크기가 기 정해진 온디바이스 자원 사용율의 소정 범위의 상 한치 이상인 경우 수집된 측정데이터를 클라우드 서버로 전달하는 구성을 갖추며, 이에 일 실시예의 시스템은 온디바이스 처리장치 및 클라우드 서버를 포함할 수 있다. 여기서 센서 및 각종 장비로부터 수집된 측정데이터는 기계로봇, 전자전기, 자동차/항공/조선해양, 철강/화학/ 섬유, 뿌리산업 분야 등의 산업 데이터이고, 공정으로 수집된 측정데이터는 제조 산업 데이터를 이용하여 결과 도출 및 개산사항 적용이 가능한 스마트 공장 데모 공장 및 대표공장 데이터를 활용한 데이터로부터 확보할 수있다. 한편, 온디바이스 처리장치와 클라우드 서버는 도 1에 도시된 바와 같이 분리시켜 구성하고, 분리된 이들 구성간 무선통신 또는 유선통신을 통해 연결되는 구조로 형성될 수 있고, 다른 례로, 온디바이스 처리장치 와 클라우드 서버는 전선 또는 커넥터 등을 통해 직접 연결되는 장치일 수 있으며 이를 한정하지 아 니한다. 온디바이스 처리장치는 센서, 공정, 및 장비, IoT 기반으로부터 수집된 측정데이터, 예를 들어, 정보, 사 진, 및 비디오 등의 비정형 데이터를 가공 처리 분석하고 분석 결과를 시각화 대쉬보드에 의거 확인할 수 있고, 다른 례로 분석 결과를 웹 기반으로 전달받은 유저 단말에 의거 확인할 수 있다. 즉, 온디바이스 처리장치는 스마트 공장 반도체 공정화 같은 실제 산업 현장에서 밀리초(ms), 나노초(ns) 단위로 발생하는 다종의 대용량 시계열 데이터를 실제 산업 현장에서 고속 처리한다. 이에 통신망을 통한 측정 데이터의 수신시간 및 트래픽이 절감되고, 효율성 및 비용 절감된다. 이에 일 실시예는 측정데이터와 온디바이 스 자원 사용율을 토대로 온디바이스 처리장치에서 처리할 수 있는 크기의 측정데이터는 온디바이스 처리 장치에서 처리하고, 처리할 수 없는 크기의 측정데이터는 클라우드 서버로 전달한다. 여기서, 온디바이스 자원 사용율은 온디바이스의 CPU 및 RAM 등으로 설정되며, 온디바이스 자원 사용율로 설정되는 온디바이스의 CPU 및 RAM 용량은 당업자에 의거 이미 적용하고 있는 값들을 적용할 수 있으며, 본 명세서 상에서는 온디바이 스 자원 사용율에 적용하는 온디바이스의 CPU 및 RAM 용량을 구체적으로 명시하지 않지만, 당업자의 수준에서 이해되어야 할 것이다. 이에 온디바이스 처리장치는 수집된 측정데이터의 크기와 기 정해진 온디바이스 자원 사용율을 비교하고 비교 결과에 따라 온디바이스 기반으로 수집된 측정데이터를 처리하는 기능을 수행하며, 여기서, 온디바이스 처 리장치는, 제1 비교부, 제1 처리부, 제2 비교부, 제2 처리부, 제1 판단부, 제3 처리부, 제2 판단부, 및 통신부로 구비된다. 제1 비교부는 측정데이터와 온디바이스 자원 사용율과 비교한다. 일 례로 수집된 측정데이터의 크기가 온 디바이스 자원 사용율의 소정 범위(30% ~ 70%) 이면 수집된 측정데이터는 제1 처리부로 전달된다. 제1 처리부는 수집된 측정데이터를 단위 시간별 단위 크기로 분할한 다음 분할된 단위 시간별 단위 크기의 측정데이터를 노이즈 제거, 전처리, 및 분석을 수행한다. 한편, 제2 비교부는 제1 비교부의 비교 결과 수집된 측정데이터의 크기가 온디바이스 자원 사용율의 소정 범위(30% ~ 70%)의 하한치(30%) 미만인 지를 판단하고 수집된 측정데이터의 크기가 온디바이스 자원 사용 율의 소정 범위(30% ~ 70%)의 하한치(30%) 미만이면, 수집된 측정데이터는 제2 처리부로 전달된다. 제2 처리부는 측정데이터의 노이즈 제거 및 전처리를 수행한다. 즉, 즉 제1 처리부는 통계학적 분석 및 정규분포, Z 스코어 등과 같은 알고리즘으로 측정데이터의 노이즈를 제거한 다음 전처리 과정을 수행한다. 제1 판단부는 제2 처리부에서 측정데이터의 노이즈 제거 및 전처리가 정상적으로 수행되었는 지를 판 단하고 판단 결과는 제3 처리부로 전달된다. 제3 처리부는 제1 판단부의 판단 결과 측정데이터 의 노이즈 제거 및 전처리가 비정상적으로 수행인 경우 인공지능 기반의 학습을 수행하여 측정데이터에 대한 노 이즈 제거 및 전처리를 수행한다. 한편, 제1 판단부의 판단 결과 측정데이터의 노이즈 제거 및 전처리가 정상적으로 수행인 경우 제2 처리부 는 측정데이터에 대한 노이즈 제거 및 전처리를 계속 수행한다. 제2 판단부는, 제3 처리부에서 인공지능 기반의 측정데이터의 노이즈 제거 및 전처리가 정상적으로 수행되었는 지를 판단하고 판단 결과 측정데이터의 노이즈 제거 및 전처리가 정상적으로 수행인 경우 제3 처리 부의 인공지능 기반의 학습을 수행하여 측정데이터에 대한 노이즈 제거 및 전처리를 수행한다. 여기서, 측 정데이터의 노이즈 제거 및 전처리가 정상적으로 수행되었는 지를 판단은 각 처리항목에 대한 허용 범위로 결정 되고, 이러한 허용 범위는 이미 적용하고 있는 값들을 적용할 수 있으며, 본 명세서 상에서는 각 처리 항목 별 허용 범위들을 구체적으로 명시하지 않지만, 당업자의 수준에서 이해되어야 할 것이다. 한편, 제2 판단부의 판단 결과 인공지능 기반의 측정데이터의 노이즈 제거 및 전처리가 비정상적으로 수행 인 경우 통신부는 측정데이터를 통신망을 통해 클라우드 서버로 전달한다. 이에 클라우드 서버는 데이터 저장 및 저장, 데이터 처리 및 전처리 또는 인공지능 기반의 학습 및 분석을 수행하는 알고리즘 및 데이터베이스를 포함하여 온디바이스 처리장치로부터 전달받은 측정데이터를 전달받 아 처리한다. 즉, 클라우드 서버는 수신된 측정데이터에 대해 기 구축된 학습 모델을 통해 노이즈 제거 및 전처리하거나, 인공지능 모델을 통해 처리 및 분석하고 분석 결과로 학습 모델 또는 인공지능 모델의 학습 데이 터를 생성하고 생성된 학습 데이터를 온디바이스 처리장치로 배포한다. 이에 일 실시예는 대용량의 측정데이터에 대해 온디바이스와 클라우드 서버 간의 인터랙션을 통해 분산 처리가 가능하고 체계적인 분석 및 학습이 가능하며 이에 분석 결과를 시각화 대쉬보드를 통해 실시간으로 확인할 수 있다. 도 3은 도 2에 도시된 온디바이스 처리장치의 동작 과정을 보인 전체 흐름도로서, 도 3을 참조하여 다른 실시예의 온디바이스 기반 데이터 분석 방법을 설명한다. 우선 단계(S11)에서, 일 실시예의 제1 비교부는 측정데이터와 온디바이스 자원 사용율과 비교하고, 비교 결과 수집된 측정데이터의 크기가 온디바이스 자원 사용율의 소정 범위(30% ~ 70%) 이면 수집된 측정데이터는 제1 처리부로 전달된다. 그리고 단계(S12)에서, 일 실시예의 제1 처리부는 수집된 측정데이터를 단위 시간별 단위 크기로 분할한 다음 분할된 단위 시간별 단위 크기의 측정데이터를 노이즈 제거, 전처리, 및 분석을 수행한다. 한편, 단계(S13)에서, 일 실시예의 제2 비교부는 제1 비교부의 비교 결과 수집된 측정데이터의 크기 가 온디바이스 자원 사용율의 소정 범위(30% ~ 70%)의 하한치(30%) 미만인 지를 판단한다. 단계(S14)(S15)에서, 일 실시예의 제2 처리부는 수집된 측정데이터의 크기가 온디바이스 자원 사용율의 소 정 범위(30% ~ 70%)의 하한치(30%) 미만인 경우 수집된 측정데이터에 대한 노이즈 제거 및 전처리를 수행한다. 노이즈 제거 및 전처리 수행 중 단계(S16)(S17)에서, 일 실시예의 제1 판단부는 측정데이터에 대한 노이즈 제거 및 전처리가 정상적으로 수행되는 지를 판단하고 판단 결과 측정데이터에 대한 노이즈 제거 및 전처리가 정상적으로 수행되지 아니한 경우 일 실시예의 제3 처리부는 기 구축된 인공지능 모델 기반의 학습을 통해 노이즈 제거 및 전처리를 수행한다. 그리고 단계(S18)(S19)에서, 일 실시예의 제2 판단부는 인공지능 모델 기반의 학습을 통해 노이즈 제거 및 전처리가 정상적으로 수행되는 지를 판단하고 판단 결과 인공지능 모델 기반의 학습을 통해 노이즈 제거 및 전 처리가 정상적으로 수행되지 아니한 경우 측정데이터를 클라우드 서버로 전송한다. 이 후 온디바이스 처리장치 및 클라우드 서버 중 적어도 하나의 처리 결과는 시각화 대쉬보드에 의거 확인된다. 이에 일 실시예는 유저 요청에 의거 센서, 공정, 또는 각종 장비로부터 수집된 측정데이터의 크기가 온디바이스 자원 사용율의 소정 범위의 상한치 이상인 경우 수집된 측정데이터를 클라우드 서버로 전달하여 클라우드 기반 으로 측정데이터에 대한 노이즈 제거, 전처리 및 분석을 수행하고, 측정데이터의 크기가 온디바이스 자원 사용 율의 소정 범위 내에 존재하거나 하한치 미만인 경우 온디바이스 기반으로 측정데이터에 대한 노이즈 제거, 전 처리 및 분석을 수행함에 따라, 온디바이스 및 클라우스 서버 간의 분산 처리가 가능하고 이에 클라우드 서버의 부하를 감소할 수 있다. 산업상 이용가능성 따르면 유저 요청에 의거 센서, 공정, 또는 각종 장비로부터 수집된 측정데이터의 크기가 온디바이스 자원 사용 율의 소정 범위의 상한치 이상인 경우 수집된 측정데이터를 클라우드 서버로 전달하여 클라우드 기반으로 측정 데이터에 대한 노이즈 제거, 전처리 및 분석을 수행하고, 측정데이터의 크기가 온디바이스 자원 사용율의 소정 범위 내에 존재하거나 하한치 미만인 경우 온디바이스 기반으로 측정데이터에 대한 노이즈 제거, 전처리 및 분 석을 수행함에 따라, 온디바이스 및 클라우스 서버 간의 분산 처리가 가능하고 이에 클라우드 서버의 부하를 감 소할 수 있는 온디바이스 기반 데이터 분석 시스템 및 방법에 대한 운용의 정확성 및 신뢰도 측면, 더 나아가 성능 효율 면에 매우 큰 진보를 가져올 수 있으며, 온디바이스 칩, 클라우드 서버 등의 시판 또는 영업의 가능 성이 충분할 뿐만 아니라 현실적으로 명백하게 실시할 수 있는 정도이므로 산업상 이용가능성이 있는 발명이다.도면 도면1 도면2 도면3"}
{"patent_id": "10-2020-0174840", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 명세서에서 첨부되는 다음의 도면들은 본 발명의 바람직한 실시 예를 예시하는 것이며, 후술하는 발명의 상 세한 설명과 함께 본 발명의 기술사상을 더욱 이해시키는 역할을 하는 것이므로, 본 발명은 그러한 도면에 기재 된 사항에만 한정되어 해석되어서는 아니된다. 도 1은 일 실시예의 온디바이스 기반 데이터 분석 시스템의 구성도이다. 도 2는 일 실시예의 온디바이스 처리장치의 세부 구성도이다. 도 3은 다른 실시예의 온디바이스 기반 데이터 분석과정을 보인 전체 흐름도이다."}
