{"patent_id": "10-2023-0138294", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0054992", "출원번호": "10-2023-0138294", "발명의 명칭": "이중 게이트 TFT 기반의 전하 저장형 시냅스 소자와 시냅스 어레이", "출원인": "서울시립대학교 산학협력단", "발명자": "김 윤"}}
{"patent_id": "10-2023-0138294", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "복수 개의 상부 워드 라인(TWL: top word line);상기 TWL과 교차하는 방향으로 위치한 복수 개의 비트 라인(BL: bit line); 및상기 TWL의 아래에 상기 BL과 평행하게 배치된 복수 개의 센싱 라인(SL: sensing line)과 복수 개의 하부 워드라인(BWL: bottom word line)을 포함하여 구성되되,상기 BWL의 각 라인은 상기 BL의 하나와 상기 SL의 하나 사이에 같은 높이로 배치된 것을 특징으로 하는 시냅스어레이."}
{"patent_id": "10-2023-0138294", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 TWL과 교차하는 상기 BL, 상기 BWL 및 상기 SL의 위치에 복수 개의 Memcapacitive 소자가 형성되고,상기 복수 개의 Memcapacitive 소자 중 상기 TWL의 하나를 공유하며 이웃하게 배치된 2개의 Memcapacitive 소자로 시냅스 소자를 구성하는 것을 특징으로 하는 시냅스 어레이."}
{"patent_id": "10-2023-0138294", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 Memcapacitive 소자는 상기 BWL의 하나로 형성된 하부 게이트(Bottom gate);상기 하부 게이트 상에 하부 게이트 절연막을 사이에 두고 양측에 상기 BWL과 같은 높이로 배치된 상기 BL의 하나로 형성된 드레인 전극(Drain)과 상기 SL의 하나로 형성된 소스 전극(Source);상기 드레인 전극과 상기 하부 게이트 절연막 및 상기 소스 전극 상에 구비된 활성층(Active layer);상기 활성층 상에 구비된 전하 저장층(Charge trap layer); 및상기 전하 저장층 상에 구비된 상기 TWL의 하나로 형성된 상부 게이트(Top gate)를 포함하여 구성된 것을 특징으로 하는 시냅스 어레이."}
{"patent_id": "10-2023-0138294", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 드레인 전극과 상기 소스 전극은 각각 상기 하부 게이트의 일측을 감싸는 돌출된 전극 구조를 갖고,상기 활성층은 상기 돌출된 전극 구조를 감싸며 형성된 것을 특징으로 하는 시냅스 어레이."}
{"patent_id": "10-2023-0138294", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 2 항에 있어서,상기 BL, 상기 BWL 및 상기 SL는 각각 상기 시냅스 소자가 컨덕턴스(conductance, G) 또는 전기용량(capacitance, C)으로 표현되는 시냅스 가중치(w)를 또는 하여 potentiation 동작과공개특허 10-2025-0054992-3-depression 동작을 수행하도록 구비된 것을 특징으로 하는 시냅스 어레이."}
{"patent_id": "10-2023-0138294", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 의한 시냅스 어레이를 동작하는 방법에 있어서,상기 potentiation 동작은 상기 시냅스 소자를 구성하는 2개의 Memcapacitive 소자 중 하나( 또는 소자)의 컨덕턴스 또는 전기용량을 증가시키고, 나머지 하나( 또는 소자)의 컨덕턴스 또는 전기용량은 고정하거나, 반대로 전자( 또는 소자)의 컨덕턴스 또는 전기용량은 고정하고, 후자( 또는 소자)의 컨덕턴스 또는 전기용량을 감소시키는 방식으로 이루어지도록 한 것을 특징으로 하는 동작 방법."}
{"patent_id": "10-2023-0138294", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 5 항에 의한 시냅스 어레이를 동작하는 방법에 있어서,상기 depression 동작은 상기 시냅스 소자를 구성하는 2개의 Memcapacitive 소자 중 하나( 또는 소자)의컨덕턴스 또는 전기용량을 감소시키고, 나머지 하나( 또는 소자)의 컨덕턴스 또는 전기용량은고정하거나, 반대로 전자( 또는 소자)의 컨덕턴스 또는 전기용량은 고정하고, 후자( 또는 소자)의컨덕턴스 또는 전기용량을 증가시키는 방식으로 이루어지도록 한 것을 특징으로 하는 동작 방법."}
{"patent_id": "10-2023-0138294", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 5 항에 의한 시냅스 어레이를 동작하는 방법에 있어서,상기 potentiation 동작은 상기 시냅스 소자를 구성하는 2개의 Memcapacitive 소자 중 하나( 또는 소자)가 HHI(Hot-Hole Injection) 또는 FN tunneling으로 이레이즈(erase)하고, 나머지 하나( 또는 소자)는 HEI(Hot-Electron Injection) 또는 FN tunneling으로 프로그램(program)될 때 이루어지도록 하고, 상기depression 동작은 상기 potentiation 동작과 반대로 될 때 이루어지도록 한 것을 특징으로 하는 동작 방법."}
{"patent_id": "10-2023-0138294", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1 항 내지 제 5 항 중 어느 한 항에 의한 시냅스 어레이를 동작하는 방법에 있어서,상기 TWL에 전압 형태의 입력 신호(VTWL,i)를 병렬적으로 인가하여 시냅스 소자가 가지는 컨덕턴스(G+i,n 및 G-i,n)로 표현된 시냅스 가중치(w=G+i,n-G-i,n)와 벡터-행렬 곱(Vector-Matrix Multiplication, VMM)을 통해 아래 수식,으로 연산을 수행한 다음, 상기 BL에 전류 형태의 출력 신호(Output In)로 출력 뉴런으로 전달하는 것을 특징으로 하는 동작 방법.공개특허 10-2025-0054992-4-청구항 10 제 1 항 내지 제 5 항 중 어느 한 항에 의한 시냅스 어레이를 동작하는 방법에 있어서,상기 BWL에 전압 형태의 입력 신호(VBWL,i)를 병렬적으로 인가하여 시냅스 소자가 가지는 전기용량(C+m,i 및 C-m,i)로 표현된 시냅스 가중치(w=C+m,i-C-m,i)와 벡터-행렬 곱(Vector-Matrix Multiplication, VMM)을 통해 아래 수식,으로 연산을 수행한 다음, 상기 TWL에 전압 형태의 출력 신호(VTWL,m)로 출력 뉴런으로 전달하는 것을 특징으로하는 동작 방법."}
{"patent_id": "10-2023-0138294", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 시냅스 어레이와 그 동작 방법에 관한 것으로, 소스 전극과 드레인 전극 사이에 하부 게이트 전극을 둔 이중 게이트 TFT 기반의 전하 저장형 시냅스 소자 및 스냅스 어레이로 인공 신경망에서의 에너지 소모를 획기 적으로 줄여 연산 에너지 효율을 극대화할 수 있고, 전류 합산 기반 벡터-행렬 곱 연산뿐 아니라 용량성 결합 (capacitive coupling)을 이용하는 전압 합산 기반 벡터-행렬 곱 연산도 가능하여 범용적 인공 신경망을 구현할 수 있는 효과가 있다. 본 발명은 과학기술정보통신부의 차세대지능형반도체기술개발(소자) 과제(신소자 시냅스에 최적화된 고정확 및 저전력 SNN 시스템 개발, 과제고유번호: 1711192346)와 함께 서울특별시 서울기술연구원 2022년도 캠퍼스타운 기 술매칭 지원사업(산화물 트랜지스터 기반 반도체 교육 키트 개발)을 통해 개발된 기술이다."}
{"patent_id": "10-2023-0138294", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 시냅스 소자와 시냅스 어레이에 관한 것으로 더욱 상세하게는 이중 게이트를 가지는 박막 트랜지스터 (TFT) 기반 전하 저장형 시냅스 소자, 시냅스 소자로 구성된 어레이의 구조 및 동작 방법에 관한 것이다."}
{"patent_id": "10-2023-0138294", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "폰노이만 아키텍처(von-Neumann architecture)를 기반으로 하는 종래의 컴퓨팅 시스템에서는 메모리(memory)와 중앙처리장치(central processing unit)가 분리된 구조에서 동일한 버스(bus)를 통하여 순차적으로 명령의 전달 과 수행이 이루어진다. 순차적 데이터 처리를 수행하는 폰노이만 아키텍처는 대규모 데이터 처리를 필요로 하는 인공지능 응용을 저전력으로 빠르게 처리하기 위한 병렬 연산의 이점을 취하기 어렵다. 이를 해결하기 위해 생 물 신경계의 뉴런(neuron)과 시냅스(synapse)를 하드웨어적으로 모방하는 뉴로모픽 시스템(neuromorphic system)이 최근 각광받고 있다. 뉴로모픽 시스템은 수많은 뉴런과 시냅스들이 병렬적으로 연결되어 있어 병렬적으로 데이터 연산을 수행할 수 있어 연산 속도와 전력소모를 획기적으로 낮출 수 있다는 장점이 있다. 시냅스는 이전 뉴런(pre-neuron)의 축색 돌기(axon)와 이후 뉴런(post-neuron)의 수상돌기(dendrite) 사이의 접합부를 의미하며, 신경전달물질의 분비 및 흡착을 통해 이전 뉴런에서 전달되는 전기적 신호를 이후 뉴런으로 전달하는 역할을 수행한다. 이때 시냅스 가 가지는 시냅스 가중치(synaptic weight)라는 연결강도에 따라 이후 뉴런으로 전달되는 전기적 신호의 크기가 조정된다. 이러한 시냅스를 모사하는 시냅스 소자(synaptic device)를 반도체 메모리 소자로 구현할 수 있다. 시냅스 소자를 반도체 메모리 소자로 구현할 경우, 시냅스 가중치는 메모리소자의 컨덕턴스로 표현된다. 컨덕턴 스로 표현 가능한 저장되고 조정 가능한 시냅스 가중치를 모사하기 위하여 다양한 비휘발성 메모리에 대한 연구 가 진행되고 있다. SRAM(Static Random-Access Memory), RRAM(Resistive Random-Access Memory), PCM(Phase- Change Memory), STT-MRAM(Spin-Transfer Torque Random-Access Memory), FG Memory(Floating-Gate Memory), CTF (Charge-Trap Flash) 메모리 등의 메모리 소자를 이용하여 시냅스의 동작 특성을 구현할 수 있다. 이 중 CTF 메모리는 성숙한 기술도를 바탕으로 상용화된 소자로 우수한 retention 특성과 정교한 멀티레벨 구현이 가 능하다는 장점을 가진다. 상기 언급한 종래의 비휘발성 메모리 어레이 기반 시냅스 어레이를 구성하는 시냅스 소자는 각각 분리된 column line을 통하여 뉴런회로와 연결되어 있다. 시냅스 가중치의 음의 영역을 표현하기 위하여 두 개의 메모리 소자 로 하나의 시냅스 소자를 구성할 수 있다. 시냅스 소자의 컨덕턴스는 전압 형태의 입력과 벡터-행렬 곱(vector- matrix multiplication, VMM) 연산이 수행되어 시냅스 소자와 연결된 column line을 통하여 전류 형태로 합산 된다.전류 합산 기반 VMM 연산을 수행하는 시냅스 소자는 시냅스 가중치가 ‘0’이더라도 입력전압이 인가되면 반도 체 메모리 소자에 전류가 흐르기 때문에 일정 수준의 전력 소모가 지속적으로 발생한다는 단점이 있다. 이러한 전류 합산 기반 VMM 연산을 기반으로 하는 시냅스 어레이의 단점을 해결하여 전력 소모량을 더욱 줄이기 위하여 선행기술로 용량성 결합(capacitive coupling)을 통한 전압 합산 기반 VMM 연산이 가능한 시냅스 어레이가 제안 된 바 있다(한국 특허공개 제10-2023-0122842 참조). 본 발명은 과학기술정보통신부의 차세대지능형반도체기술개발(소자) 과제(신소자 시냅스에 최적화된 고정확 및 저전력 SNN 시스템 개발, 과제고유번호: 1711192346)와 함께 서울특별시 서울기술연구원 2022년도 캠퍼스타운 기술매칭 지원사업(산화물 트랜지스터 기반 반도체 교육 키트 개발)을 통해 개발된 기술이다."}
{"patent_id": "10-2023-0138294", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명에서는 이중 게이트 구조의 박막 트랜지스터(TFT)를 기반으로 하는 전하 저장형 시냅스 소자를 제안하고, 전류 합산 기반 VMM 연산뿐만 아니라 용량성 결합(capacitive coupling)을 통한 전압 합산 기반 VMM 연산이 모두 가능한 시냅스 어레이의 구조 및 동작 방법을 제안한다."}
{"patent_id": "10-2023-0138294", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위하여, 본 발명에 의한 시냅스 어레이는 복수 개의 상부 워드 라인(TWL: top word line); 상기 TWL과 교차하는 방향으로 위치한 복수 개의 비트 라인(BL: bit line); 및 상기 TWL의 아래에 상기 BL과 평행하게 배치된 복수 개의 센싱 라인(SL: sensing line)과 복수 개의 하부 워드 라인(BWL: bottom word line)을 포함하여 구성되되, 상기 BWL의 각 라인은 상기 BL의 하나와 상기 SL의 하나 사이에 같은 높이로 배치 된 것을 특징으로 한다. 상기 TWL과 교차하는 상기 BL, 상기 BWL 및 상기 SL의 위치에 복수 개의 Memcapacitive 소자가 형성되고, 상기 복수 개의 Memcapacitive 소자 중 상기 TWL의 하나를 공유하며 이웃하게 배치된 2개의 Memcapacitive 소자로 시 냅스 소자를 구성할 수 있다. 상기 Memcapacitive 소자는 상기 BWL의 하나로 형성된 하부 게이트(Bottom gate); 상기 하부 게이트 상에 하부 게이트 절연막을 사이에 두고 양측에 상기 BWL과 같은 높이로 배치된 상기 BL의 하나로 형성된 드레인 전극 (Drain)과 상기 SL의 하나로 형성된 소스 전극(Source); 상기 드레인 전극과 상기 하부 게이트 절연막 및 상기 소스 전극 상에 구비된 활성층(Active layer); 상기 활성층 상에 구비된 전하 저장층(Charge trap layer); 및 상기 전하 저장층 상에 구비된 상기 TWL의 하나로 형성된 상부 게이트(Top gate)를 포함하여 구성될 수 있다. 상기 드레인 전극과 상기 소스 전극은 각각 상기 하부 게이트의 일측을 감싸는 돌출된 전극 구조를 갖고, 상기 활성층은 상기 돌출된 전극 구조를 감싸며 형성될 수 있다. 상기 BL, 상기 BWL 및 상기 SL는 각각 상기 시냅스 소자가 컨덕턴스(conductance, G) 또는 전기용량 (capacitance, C)으로 표현되는 시냅스 가중치(w)를 또는 하여 potentiation 동작과 depression 동작을 수행하도록 구비될 수 있다. 본 발명의 일 실시예에 의한 시냅스 어레이의 동작 방법은 상기 시냅스 어레이에서, 상기 potentiation 동작은 상기 시냅스 소자를 구성하는 2개의 Memcapacitive 소자 중 하나( 또는 소자)의 컨덕턴스 또는 전기용량 을 증가시키고, 나머지 하나( 또는 소자)의 컨덕턴스 또는 전기용량은 고정하거나, 반대로 전자( 또 는 소자)의 컨덕턴스 또는 전기용량은 고정하고, 후자( 또는 소자)의 컨덕턴스 또는 전기용량을 감소 시키는 방식으로 이루어지도록 한 것을 특징으로 한다. 본 발명의 다른 실시예에 의한 시냅스 어레이의 동작 방법은 상기 시냅스 어레이에서, 상기 depression 동작은 상기 시냅스 소자를 구성하는 2개의 Memcapacitive 소자 중 하나( 또는 소자)의 컨덕턴스 또는 전기용량 을 감소시키고, 나머지 하나( 또는 소자)의 컨덕턴스 또는 전기용량은 고정하거나, 반대로 전자( 또 는 소자)의 컨덕턴스 또는 전기용량은 고정하고, 후자( 또는 소자)의 컨덕턴스 또는 전기용량을 증가 시키는 방식으로 이루어지도록 한 것을 특징으로 한다.본 발명의 다른 실시예에 의한 시냅스 어레이의 동작 방법은 상기 시냅스 어레이에서, 상기 TWL에 전압 형태의 입력 신호(VTWL,i)를 병렬적으로 인가하여 시냅스 소자가 가지는 컨덕턴스(G+ i,n 및 G- i,n)로 표현된 시냅스 가중치 (w=G+ i,n-G- i,n)와 벡터-행렬 곱(Vector-Matrix Multiplication, VMM)을 통해 아래 수식,"}
{"patent_id": "10-2023-0138294", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "으로 연산을 수행한 다음, 상기 BL에 전류 형태의 출력 신호(Output In)로 출력 뉴런으로 전달하는 것을 특징으 로 한다. 본 발명의 다른 실시예에 의한 시냅스 어레이의 동작 방법은 상기 시냅스 어레이에서, 상기 BWL에 전압 형태의 입력 신호(VBWL,i)를 병렬적으로 인가하여 시냅스 소자가 가지는 전기용량(C+ m,i 및 C- m,i)로 표현된 시냅스 가중치 (w=C+ m,i-C- m,i)와 벡터-행렬 곱(Vector-Matrix Multiplication, VMM)을 통해 아래 수식,"}
{"patent_id": "10-2023-0138294", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 3, "content": "으로 연산을 수행한 다음, 상기 TWL에 전압 형태의 출력 신호(VTWL,m)로 출력 뉴런으로 전달하는 것을 특징으로 한다."}
{"patent_id": "10-2023-0138294", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 소스 전극과 드레인 전극 사이에 하부 게이트 전극을 둔 이중 게이트 TFT 기반의 전하 저장형 시냅스 소자 및 스냅스 어레이로 인공 신경망에서의 에너지 소모를 획기적으로 줄여 연산 에너지 효율을 극대화할 수 있고, 전류 합산 기반 벡터-행렬 곱 연산뿐 아니라 용량성 결합(capacitive coupling)을 이용하는 전압 합산 기 반 벡터-행렬 곱 연산도 가능하여 범용적 인공 신경망을 구현할 수 있는 효과가 있다."}
{"patent_id": "10-2023-0138294", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하며 본 발명의 바람직한 실시예에 대하여 설명한다. 본 발명의 일 실시예에 의한 시냅스 어레이는, 도 1에 예시된 바와 같이, 복수 개의 상부 워드 라인(TWL: top word line, 110, 120, 130, 140); 상기 TWL과 교차하는 방향으로 위치한 복수 개의 비트 라인(BL: bit line,211, 212, 221, 222); 및 상기 TWL의 아래에 상기 BL과 평행하게 배치된 복수 개의 센싱 라인(SL: sensing line, 311, 312, 321, 322)과 복수 개의 하부 워드 라인(BWL: bottom word line, 411, 412, 421, 422)을 포함 하여 구성된다. 여기서, 상기 BWL의 각 라인은, 도 2(b)로 참조되는 바와 같이, 예컨대 BWL+은 상기 BL의 하나인 BL+(22 1)과 상기 SL의 하나인 SL+ 사이에서 BL+ 및 SL+과 같은 높이로, BWL-은 상기 BL의 다른 하 나인 BL-과 상기 SL의 다른 하나인 SL- 사이에서 BL- 및 SL-과 같은 높이로 각각 배치된다. 상기와 같이 구성됨으로써, 상기 TWL과 교차하는 상기 BL, 상기 BWL 및 상기 SL의 위치에 박막 트랜지스터(TFT) 기반의 전하 저장형 Memcapacitive 소자(10, 20)가 복수 개 형성하게 된다. 또한, 상기 복수 개의 Memcapacitive 소자 중 상기 TWL의 하나(예컨대, 110)를 공유하며 이웃하게 배치된 2개의 Memcapacitive 소자(예컨대, 10과 20)로 시냅스 소자를 구성할 수 있다. 즉, 본 발명의 시냅스 소자는 컨덕턴스(conductance, G)와 전기용량(capacitance, C)을 조절하고 유지할 수 있는 2개의 Memcapacitive 소자 (10과 20)로 구성할 수 있는 점에 그 특징이 있다. 또한, 본 발명의 시냅스 소자(Memcapacitive Synaptic device, 30)는 TWL의 하나(예컨대, 110)를 공유하며 이웃하게 배치된 2개의 Memcapacitive 소자(10과 20)로 구 성됨으로써, 도 1의 배치도(layout)로 참조되듯이, 단위 시냅스 소자는 24F2 크기로 구현할 수 있는 장점이 있다. 상기 Memcapacitive 소자(예컨대, 10)는, 도 3으로 참조되는 바와 같이, 상기 BWL의 하나로 형성된 하부 게이트 (Bottom gate, 421); 상기 하부 게이트 상에 하부 게이트 절연막을 사이에 두고 양측에 상기 BWL과 같 은 높이로 배치된 상기 BL의 하나로 형성된 드레인 전극(Drain, 221)과 상기 SL의 하나로 형성된 소스 전극 (Source, 321); 상기 드레인 전극과 상기 하부 게이트 절연막 및 상기 소스 전극 상에 구비된 활성층(Active layer, 14); 상기 활성층 상에 구비된 전하 저장층(Charge trap layer, 16); 및 상기 전하 저장층 상에 구비된 상기 TWL의 하나로 형성된 상부 게이트(Top gate, 110)를 포함하여 구성될 수 있다. 상기와 같이, 하부 게이트를 드레인 전극과 소스 전극 사이에 서로 같은 높이로 형성함으로써, 본 발명의 Memcapacitive 소자(10, 20)는 박막 트랜지스터(TFT) 형태로 구현할 수 있는 점에 그 특징이 있다. 상기 전하 저장층은 실시예에 따라, 도 3과 같이, Charge trap layer의 아래와 위에 각각 Tunneling layer 및 Barrier layer를 더 둘 수 있다. 또한, 상기 드레인 전극과 상기 소스 전극도 실시예에 따라, 도 3과 같이, 각각 하부 게이트의 일측을 감싸는 돌출된 전극 구조(221a, 321a)를 갖고, 상기 활성층은 상기 돌출된 전극 구조(221a, 321a)를 감싸며 형성될 수 있다. 이렇게 함으로써, 활성층의 면적을 크게 하여 Memcapacitive 소자로서 메모리와 커 패시터 성능을 고양시킬 수 있는 장점이 있다. 상기 BL, 상기 BWL 및 상기 SL는 각각 시냅스 소자가 컨덕턴스(G) 또는 전기용량(C)으로 표현되는 시냅스 가중치(w)를 또는 하여 potentiation 동작과 depression 동작을 수행하도록, 도 1과 같이, 상기 BL은 BL+1, BL-1, ..., BL+n, BL-n으로, 상기 SL은 SL+1, SL-1, ..., SL+n, SL- n으로, 상기 BWL은 BWL+1, BWL-1, ..., BWL+n, BL-n으로 각각 구비될 수 있다. 이 경우, m개의 상부 워드 라인(110, 120, 130, 140; TWL1, TWL2, ..., TWLm-1, TWLm)으로 형 성되는 시냅스 소자는 m x n 개가 된다. 즉, 시냅스 소자는 m x n 행렬 형태로 배치되고, 임의 시냅스 소자(Sij)는 상부 워드 라인 하나(TWLi)와 교차하는 BL+j, SL+j 및 BWL+j에 위치하는 Memcapacitive 소자(M+ij) 와 BL-j, SL-j 및 BWL-j에 위치하는 Memcapacitive 소자(M-ij)로 구성하게 된다. 여기서, M+ij 소자는 또는 소자로, M-ij 소자로, 또는 소자로 불릴 수 있다. 따라서, 본 발명에 의한 시냅스 소자는 시냅스 가중치(w)를 컨덕턴스(conductance, G)와 전기용량 (capacitance, C)으로 표현할 수 있게 된다. 이는 박막 트랜지스터(TFT) 형태의 Memcapacitive 소자는 전하 저 장층에 저장된 전하량을 조절하여 컨덕턴스(G)와 전기용량(C)을 조절할 수 있기 때문이다. 시냅스 소자를 구성하는 각각의 Memcapacitive 소자가 가지는 컨덕턴스를 배치에 따라 , 로 정의하면 시냅스 소자의 시냅스 가중치는 로 표현할 수 있다. 이를 통해 소자의 컨덕턴스 기반으로 음의 가중치와 양의 가중치 모두 구현할 수 있는 시냅스 가중치를 표현할 수 있게 된다. 시냅스 소자는 Memcapacitive 소자의 전 기용량(C)으로도 시냅스 가중치를 표현할 수 있다. Memcapacitive 소자(10, 20)의 상부 게이트 전극과 활 성층(14 또는 24) 간의 형성되는 커패시터(CTGI, 124)와 활성층과 하부 게이트 전극(421 또는 422) 간의 형성되 는 커패시터(CBGI, 424)가 직렬 연결되어 있는 형태와 같으므로, Memcapacitive 소자의 전기용량(Cmemcapacitor)은 다음 수학식 1과 같게 된다. 수학식 1"}
{"patent_id": "10-2023-0138294", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "수학식 1에서, CBGI가 CTGI 대비 매우 크면 Memcapacitive 소자의 전기용량은 CTGI로 근사할 수 있다. 이 경우, Memcapacitive 소자의 전기용량의 조절은 CTGI를 조절하여 수행할 수 있다. CTGI는 전하 저장층에 저장된 전 자 혹은 정공에 따라 조절할 수 있다. 시냅스 소자를 구성하는 각각의 Memcapacitive 소자가 가지는 멀티레벨의 전기용량을 배치에 따라 , 라고 표현하면, 시냅스 소자가 갖는 시냅스 가중치는 로 표현할 수 있게 된다. 다음, 도 4 및 도 5를 참조하며 본 발명의 시냅스 어레이의 동작 방법에 대하여 설명한다. 본 발명의 시냅스 어레이는 인공신경망을 구현하는 뉴로모픽 시스템을 구성하게 되므로, 시냅스 어레이의 동작 은 뉴로모픽 시스템의 동작과 관련된다. 뉴로모픽 시스템의 동작은 크게 학습(training)과 추론(inference)으로 나눌 수 있다. 학습은 일종의 프로그램 동작으로 올바른 출력값을 얻기 위하여 시냅스 어레이를 구성하는 각 소 자의 시냅스 가중치를 조절하는 과정이다. 추론은 일종의 읽기 동작으로 주어진 입력에 대하여 출력값을 확인하 는 과정이다. 시냅스 어레이의 동작은 프로그램(program) 동작과 읽기(read) 동작으로 수행할 수 있다. 이 두 동작을 본 발명 의 시냅스 어레이로 수행할 때, 도 4와 같이, 시냅스 어레이를 구성하는 시냅스 소자를 4단자의 트랜지스터 형태로 이용할 수 있는 트랜지스터 모드(Transistor mode, 도 4(a) 참조)와 2단자의 memcapacitor 형태로 이용 할 수 있는 Memcapacitive 모드(Memcapacitive mode, 도 4(b) 참조)의 2가지 모드로 동작할 수 있다. 2개 모드 모두 프로그램 동작을 통한 학습과 읽기 동작을 통한 추론이 가능하다. 본 발명의 프로그램 동작은 시냅스 어레이의 시냅스 소자를 구성하는 Memcapacitive 소자의 컨덕턴스(G) 또는 전기용량(C)을 조절하는 동작이다. 이를 통해 시냅스 소자의 가중치를 조절하여 인공 신경망의 학습을 수행 할 수 있게 된다. 시냅스 가중치를 조절하기 위해, 종래의 CTF 메모리의 멀티 레벨을 구현하는 방식인 전하 저 장층의 전자 또는 정공의 주입 방식을 이용할 수 있다. 전하 저장층에 주입된 전하량을 세밀하게 조절하여 멀티 레벨의 컨덕턴스 혹은 멀티레벨의 전기용량을 구현할 수 있다. 전하 저장층에 전자 또는 정공을 주입하는 대표적인 방법으로 HCI(Hot-Carrier Injection)를 이용한 방식과 FN tunneling(Fowler-Nordheim tunneling)을 이용한 방식이 있다. 먼저 HCI를 이용한 방식은 HEI(Hot-Electron Injection) program과 HHI(Hot-Hole Injection) erase로 나눌 수 있다. HEI program은 고안한 소자의 게이트 전극에 양의 전압(VPGM,HCI), 드레인 전극에 양의 전압(VDRAIN,HCI), 소스 전극에 0 V를 인가하여 전하 저장층에 전자 를 주입할 수 있고, HHI erase는 게이트 전극에 음의 전압(VERS,HCI)을 인가하고, 드레인 전극에 양의 전압 (VDRAIN,HCI), 소스 전극에 0 V를 인가하여 전하 저장층에 정공을 주입할 수 있다. FN tunneling을 이용한 방식은 FN program과 FN erase로 나눌 수 있다. FN program은 게이트 전극에 양의 전압(VPGM,FN), 드레인 전극에 0 V를 인가하고 소스 전극은 0 V 혹은 float하여 전하 저장층에 전자를 주입할 수 있고, FN erase는 게이트 전극에 음 의 전압(VERS,FN), 드레인 전극에 0 V를 인가하고 소스 전극은 0 V 혹은 float하여 전하 저장층에 정공을 주입할 수 있다. 상기 언급한 방식을 활용하여 본 발명의 시냅스 소자를 구성하는 Memcapacitive 소자의 컨덕턴스와 전기용량을 조절하는 방법의 예는 다음과 같다. 시냅스 소자를 구성하는 Memcapacitive 소자가 n-channel을 기반으로 한 소 자라고 가정하였을 때, HEI 혹은 FN tunneling을 이용해 전하 저장층에 전자를 주입하는 program을 수행하면 소자의 문턱전압이 증가하게 된다. 따라서 소자의 컨덕턴스는 감소하고 전기용량 또한 감소하게 된다. 반면, HHI 혹은 FN tunneling을 이용하여 전하 저장층에 정공을 주입하는 erase를 수행하면 문턱전압의 감소로 인해 컨덕 턴스는 증가하고 전기용량 또한 증가하게 된다. 본 발명의 시냅스 소자의 가중치 증가 혹은 감소를 위한 동작 전압 인가 방식 설정 시, program 혹은 erase에 따른 컨덕턴스 혹은 전기용량의 변화 방향이 동일하므로 시냅스 가중치를 표현하는 요소에 따른 개별 방식을 고려하지 않아도 된다. 통상적으로 FN tunneling을 이용한 program 및 erase가 HCI 방식을 이용한 program 및 erase보다 전력 소모가 낮다고 알려져 있다. 하지만 종래의 NOR 형태의 어레이에서는 FN tunneling을 이용한 개별 소자의 program 및 erase를 하기가 힘들어 개별 시냅스 소자의 가중치를 조절해야 하는 시냅스 어레이에서는 이용하기가 힘든 단점 이 있다. 본 발명의 시냅스 어레이는 TWL, BWL과 분리된 SL과 BL을 이용하여 HCI 방식뿐만 아니라, FN tunneling을 이용한 개별 Memcapacitive 소자의 program 및 erase가 가능하여 인공 신경망 설계에서 전류 신호 기반 혹은 전압 신호 기반의 설계가 모두 가능한 범용성을 가진 장점이 있다. 아래 표 1은 상기 언급한 어레이를 구성하는 Memcapacitive 소자를 개별적으로 선택하여 HCI 혹은 FN tunneling 을 이용한 program 혹은 erase하기 위한 방법을 보여준다. 표 1 시냅스 어레이의 트랜지스터 모드에서 Memcapactive 소자의 컨덕턴스와 전기용량 조절을 위한 동작 전압 Hot-Carrier Injection FN tunneling HEI program HHI erase FN program FN erase 선택 TWL VPGM,HCI VERS,HCI VPGM,FN VERS,FN 비선택 TWL 0 V 0 V 0 V 0 V 선택 BWL 0 V 0 V 0 V 0 V 비선택 BWL 0 V 0 V VPGM,FN/2 VERS,FN/2 선택 BL VDRAIN,HCI VDRAIN,HCI 0 V 0 V 비선택 BL 0 V 0 V Float Float 선택 SL 0 V 0 V 0 V 0 V 비선택 SL 0 V 0 V Float Float 먼저, HCI 방식을 이용하기 위해서는 선택한 소자의 상부 게이트와 연결된 ‘선택 TWL’에 VPGM,HCI(program 목적) 혹은 VERS,HCI(erase 목적)의 전압을 인가하고, 선택하지 않은 TWL들은 0 V 를 인가한다. 선택한 BWL, 선택 하지 않은 BWL들은 모두 0 V를 인가하고 선택한 BL에 VDRAIN,HCI, 선택하지 않은 BL들은 0 V를 인가한다. SL들은 모두 0 V를 인가한다. 이를 통해 선택한 Memcapacitive 소자만 program 혹은 erase를 할 수 있으며 인접한 다른 소자들은 program 혹은 erase되지 않는다. FN tunneling 방식을 이용한 선택 소자의 program 혹은 erase 방법 은 다음과 같다. 선택한 소자의 상부 게이트와 연결된 TWL에 VPGM,FN(program 목적) 혹은 VERS,FN(erase 목적)의 전 압을 인가하고 선택하지 않은 TWL들은 0 V를 인가한다. 선택한 BWL은 0 V, 선택하지 않은 BWL들은 VPGM,FN/2 혹은 VERS,FN/2의 전압을 인가한다. 선택한 BL은 0 V, 선택하지 않은 BL들은 float시키고, 선택한 SL은 0 V, 선택하지 않은 SL들은 float 시켜준다. 이와 같이 동작 전압을 인가하여 선택한 소자만을 FN tunneling을 이용하여 program 혹은 erase 할 수 있다. 상기 내용을 바탕으로 시냅스 소자의 가중치가 증가하는 potentiation 동작과 가중치가 감소하는 depression 동 작을 수행할 수 있다. 시냅스 소자를 두 개의 n-channel Memcapacitive 소자로 구성하였다고 가정하였을 때, potentiation 동작과 depression 동작을 위한 program/erase 조건은 아래 표 2와 같다. 표 2 시냅스 소자의 potentiation 및 depression 동작을 위한 program 및 erase 조건 Potentiation(시냅스 가중치 증가) Depression(시냅스 가중치 감소) G + 혹은 C + G - 혹은 C - G + 혹은 C + G - 혹은 C - HHI 혹은 FN tunneling erase고정 HEI 혹은 FN tunneling program고정 고정 HEI 혹은 FN tunneling program고정 HHI 혹은 FN tunneling erase HHI 혹은 FN tunneling eraseHEI 혹은 FN tunneling programHEI 혹은 FN tunneling programHHI 혹은 FN tunneling erase 시냅스 가중치는 혹은 로 표현할 수 있다. 표 2의 , 는 시냅스 소자를 구성하는 Memcapacitive 소자들 중 1개의 소자의 컨덕턴스 혹은 전기용량은 고정하고, 나머지 1개 소자의 컨덕턴스 혹은 전기용량을 증가시키거나 감소시켜 시냅스 가중치 w를 조절하게 할 수 있다. 따라서, 본 발명에서 potentiation 동작은 혹은 소자의 컨덕턴스 혹은 전기용량을 증가시키고, 혹은 의 컨덕턴스 혹은 전기용량은 고정하여 시냅스 가중치 w를 증가하는 방식으로, depression 동작은 혹은 소자의 컨덕턴스 혹은 전기용량을 감소시키고, 혹은 의 컨덕턴스 혹은 전기용량은 고정하여 시냅스 가중치 w를 감소하는 방식으로 할 수 있다. 상기 시냅스 가중치를 증가시키기 위한 다른 방법으로 혹은 소자의 컨덕턴스 혹은 전기용량은 고정하고, 혹은 의 컨덕턴스 혹은 전기용량을 감소시키는 방법이 있다. 상기 시냅스 가중치를 감소시키기 위한 다른 방법으로는 혹은 소자의 컨덕턴스 혹은 전기용량은 고정하고, 혹은 의 컨덕턴스 혹은 전기용량을 증가시키는 방법이 있다. 표 2의 은 potentiation을 위해 시냅스 소자의 혹은 소자는 erase 동작을 수행하고, 혹은"}
{"patent_id": "10-2023-0138294", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "소자는 program 동작을 수행하여 가중치 w를 증가시키는 방법을, depression을 위해 시냅스 소자의 혹은 소자는 program 동작을 수행하고, 혹은 소자는 erase 동작을 수행하여 가중치 w를 감소시키는 방법 을 각각 보여준다. 상기 설명한 방식은 n-channel 소자에 국한되지 않으며, 활성층을 구성하는 반도체 물질의 타입에 따라 program 혹은 erase를 적절히 선택하여 응용할 수 있다. 인공 신경망의 성능을 극대화하기 위하여 시냅스 소자는 정확하고 세밀한 가중치 업데이트가 필수적이다. 상기 언급한 시냅스 가중치 조절에서 시냅스 소자의 가중치를 정확히 조절하기 위하여 쓰기 확인(write-verify) 방식 을 통해 각 시냅스 소자의 가중치를 확인하고 potentiation 혹은 depression 정도를 설정 후 가중치 갱신 (weight update)을 수행할 수 있다. 이 방법은 개별 시냅스 소자의 시냅스 가중치를 읽을 수 있어야 한다. 이를 위한 개별 시냅스 소자의 읽기 동작 전압 방법은 아래 표 3과 같다. 표 3 개별 시냅스 소자의 시냅스 가중치를 읽기 위한 동작 전압 컨덕턴스 기반 시냅스 가중치를 가진 Random cell read전기용량 기반 시냅스 가중치를 가진 Random cell read 선택 TWL VREAD VREAD 비선택 TWL 0 V 0 V 선택 BWL 0 V 0 V 비선택 BWL 0 V 0 V 선택 BL 0 V float 비선택 BL 0 V float 선택 SL VSENSE float 비선택 SL VSENSE float 표 3과 같이, Memcapacitive 소자를 program 혹은 erase 하지 않는 크기의 읽기 전압 VREAD를 선택한 소자에 연 결된 TWL을 통해 상부 게이트에 인가하여 주고, 선택하지 않은 TWL들은 0 V를 인가하여 선택하지 않은 소자들은turn-off 상태를 유지한다. memcapactive 소자의 컨덕턴스를 확인하기 위해서는 BL들을 통해 전달되는 전류값을 확인하여야 하고, 전기용량을 확인하기 위해서는 BL들의 용량성 커플링(capacitive coupling)에 의한 전압값을 확인하여야 한다. 먼저, 컨덕턴스를 확인하기 위해서는 모든 BWL과 BL에 0 V를 인가하고, 모든 SL에는 소자의 전류를 흘려주기 위한 VSENSE를 인가하여 선택된 소자의 소스 전극과 드레인 전극 사이의 전류가 흐르게 해준다. 이를 통해 선택한 TWL에 연결된 Memcapacitive 소자들은 전류가 흘러 각 소자의 연결된 BL을 통하여 전류가 흐 르게 되고 BL의 출력단에 위치한 page buffer를 통하여 각 소자의 전류값을 저장한다. 전기용량을 확인하기 위해서는 모든 BWL에 0 V를 인가하고, 모든 SL들과 BL들을 float시킨다. 소자의 소스 전극 과 드레인 전극 사이의 전류가 흐르지 않도록 하여 Memcapacitive 소자의 전기용량(Cmemcapacitor)를 유지시키고, 선택한 TWL에 연결된 Memcapacitive 소자들은 읽기 전압 신호 VREAD를 입력 받아 각 소자의 연결된 BL을 통하여 용량성 커플링을 통해 각 소자의 전기용량이 BL의 출력단에 위치한 page buffer에 저장된다. 이를 통해 전기용 량으로 표현하는 가중치의 정확한 값의 판단과 정확한 가중치 갱신이 가능하다. Page buffer에 저장된 전류값 혹은 전압값을 기준으로 하여 각 소자의 program 혹은 erase 정도를 결정하고, 표 1의 개별 소자 program 및 erase 방법을 통해 시냅스 가중치를 갱신한다. 그 후, 다시 한번 각각의 소자들의 시 냅스 가중치를 읽어 정확한 가중치 갱신이 수행되었는지를 확인하고, 학습을 통해 설정된 시냅스 가중치를 시냅 스 어레이 내 모든 소자가 가질 수 있을 때까지 위 과정을 반복한다. 본 발명의 시냅스 어레이의 또 다른 동작인 읽기 동작을 통해 시냅스 어레이에 전압 형태의 입력 신호를 병렬적 으로 인가하여 시냅스 소자가 가지는 컨덕턴스 혹은 전기용량으로 표현된 시냅스 가중치와 벡터-행렬 곱 (Vector-Matrix Multiplication, VMM) 연산을 수행할 수 있다. VMM 연산을 거쳐 전류 혹은 전압 형태의 출력 신호로 출력 뉴런으로 전달되고, 이를 통해 인공 신경망의 추론을 수행할 수 있다. 본 발명의 시냅스 어레이의 트랜지스터 모드는 전압 입력 신호와 시냅스 어레이 내 시냅스 소자들의 컨덕턴스의 VMM 연산을 통한 전류합산 형태의 출력값을 확인한다. 이는 입력이 TWL로 들어왔을 때, BL을 통하여 출력 뉴런 에서 합쳐진 전류 출력값을 읽는 과정이다. 이때, 도 4(a)의 트랜지스터 모드에서 I1 ... In은 출력 뉴런이며, 각 출력 뉴런의 출력값은 입력 신호와 해당하는 시냅스 소자들의 시냅스 가중치 곱의 합으로 계산된다. n번째 출력 뉴런 In의 출력값은 아래의 수학식 2와 같이 계산할 수 있다. 수학식 2"}
{"patent_id": "10-2023-0138294", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "G +와 G - Memcapacitive 소자 각각은 BL+와 BL-와 연결되어 있으며, BL+와 BL-를 통해 출력되는 전류값은 각각 I+, I-이다. 출력 뉴런에서 I+와 I-의 뺄셈을 통하여 최종 출력값이 나온다. 이러한 VMM 연산을 위한 트랜지스터 모드의 동작 전압 구성은 아래 표 4와 같다. 표 4 트랜지스터 모드에서의 VMM 연산을 위한 동작 전압 Vector-Matrix Multiplication in Transistor mode TWL 1...m VINPUT 선택 BWL 0 V 비선택 BWL 0 V 선택 BL 0 V 비선택 BL 0 V 선택 SL VSENSE비선택 SL VSENSE 모든 시냅스 소자의 상부 게이트 전극에 입력 신호인 VINPUT을 인가하고, 소스 전극에 연결된 SL 모두에 VSENSE를 인가한다. BWL들은 0 V를 인가하고, BL들에는 0 V를 인가한다. 옴의 법칙을 따라 입력 신호 VINPUT과 시냅스 소자 를 구성하는 Memcapacitive 소자의 컨덕턴스가 곱해져 결정되는 전류가 키르히호프의 전류 법칙을 따라 각각의 BL에서 전류가 모두 합쳐진다. 각 BL에서 합쳐진 전류는 출력 뉴런에서 계산된다. Memcapacitive 모드에서는 BWL로 입력 신호가 입력되고 TWL을 통해 출력된다. 각각의 TWL은 출력 뉴런(V1, ..., Vm)과 연결되어 있다. BWL 입력 신호가 시냅스 어레이로 입력될 경우, floating 상태의 TWL은 용량성 커플링에 의해 전압이 상승되게 된다. 이때, BWL과 TWL간의 용량성 커플링은 Memcapacitive 소자의 전기용량에 의해 결정 된다. 이러한 용량성 커플링을 이용하여 이전 뉴런에서 이후 뉴런으로 전달되는 전기적 신호의 정도를 결정하는 시냅스 가중치를 전기용량으로 표현할 수 있다. Memcapacitive 모드에서 모든 Memcapacitive 소자는 활성층에 전도성 채널(channel)이 형성되지 않도록 공핍 모드(depletion mode)로 사용한다. 이는 Memcapacitive 소자의 상부 게이트 전극 혹은 하부 게이트 전극에 전압 이 인가되었을 때 전도성 채널의 형성을 막아 TWL 단위의 용량성 커플링을 이용한 VMM 연산을 수행하기 위함이 다. Memcapacitive 소자의 구조, 구성 물질, 동작 전압 조건에 따라 용량성 커플링을 이용할 수 있는 동작은 변 경될 수 있으며 용량성 커플링을 이용한 전압합산 형태의 VMM 연산을 수행하는 모든 방식은 본 발명에서 제안한 방식과 동일하다. 도 5는 Memcapacitive 모드의 VMM 연산 수행 과정을 나타낸다. 먼저, depletion mode의 Memcapacitive 소자와 연결된 BL과 SL을 모두 open시켜 floating 상태로 만든다. 이를 통해 Memcapacitive 소자들은 charge sharing 을 통하여 단일 TWL과 연결된다. 그 후, BWL+ 및 BWL-와 연결된 Memcapacitive 소자에 각각 VBWL 와 -VBWL 전압을 인가한다. 각 출력 뉴런에 입력되는 VMM 연산값 VTWL은 입력 신호와 해당하는 시냅스 소자들의 시냅스 가중치 곱 의 합으로 계산된다. 이때, m번째 TWL의 전압은 아래 수학식 3과 같이 변하게 된다. 수학식 3"}
{"patent_id": "10-2023-0138294", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "여기서, Ctotal,m은 m번째 TWL의 전체 전기용량으로, 기생 전기용량 및 단일 TWL에 연결된 모든 Memcapacitive 소 자의 전기용량을 포함한다. 와 는 각각 i번째 BWL과 m번째 TWL에 위치한 양과 음의 시냅스 가중치를 전 기용량으로 표현한 값이다. n개의 BWL과 m번째 TWL의 전체 전기용량 대비 시냅스 가중치에 입력 전압을 곱한 값 들의 합이 VTWL,m이다. VTWL,m은 TWL과 연결된 출력 뉴런에 입력되고, 출력 뉴런은 전압 합산 기반 VMM 연산값인 VTWL을 판단하고 연산 결과인 Voutput을 출력한다. BWL에 입력하는 입력 신호는 VBWL+와 VBWL- 전압을 포함한다. TWL 이러한 입력신호 각각은 양과 음의 전압에 국한 되지 않고 사용 조건에 따라 다양하게 구성할 수 있다. 위 동작은 Memcapacitive 모드의 출력 뉴런의 동작의 일 례로, 위 동작 과정으로 제한되지 않는다. Memcapacitive 소자의 전기용량을 기반으로 하여 시냅스 소자의 시냅 스 가중치를 구현하는 방식에 따라 다양한 형태의 회로 및 방식을 통하여 전압 기반의 VMM 연산 처리 동작을 구 현할 수 있는 경우 동일한 형태라고 볼 수 있다. 부호의 설명10, 20: Memcapacitive 소자 30: 시냅스 소자 110, 120, 130, 140: 상부 워드 라인 211, 212, 221, 222: 비트 라인 311, 312, 321, 322: 센싱 라인 411, 412, 421, 422: 하부 워드 라인"}
{"patent_id": "10-2023-0138294", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 의한 이중 게이트를 가지는 전하 저장형 TFT 구조를 기반으로 하는 두 개의 Memcapacitive 소자로 시냅스 소자를 구현하고, 각 시냅스 소자의 연결을 보여주는 시냅스 어레이 회로도이다. 도 2는 도 1을 구현한 일 모형도 및 AA'선 단면도이다. 도 3은 본 발명의 일 실시예에 의한 이중 게이트를 가지는 전하 저장형 TFT 구조를 기반으로 하는 Memcapacitive 소자의 구조를 보여주는 개념도이다. 도 4는 본 발명의 일 실시예에 의한 시냅스 어레이의 동작 모드를 보여주는 개념도이다. 도 5는 본 발명의 일 실시예에 의한 시냅스 어레이의 전압합산 기반의 VMM 연산을 수행하는 Memcapacitive 모드 동작을 보여주는 개념도이다."}
