{"patent_id": "10-2020-0185948", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0094589", "출원번호": "10-2020-0185948", "발명의 명칭": "스마트 볼록거울", "출원인": "강재석", "발명자": "강재석"}}
{"patent_id": "10-2020-0185948", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "주변에 방사된 적외선으로부터 인체를 감지하는 적외선 센서;초음파를 보내어 인체를 감지하는 초음파 센서;주변의 조도를 감지하는 조도센서;상기 적외선 센서와 상기 초음파 센서로부터 감지된 인체감지신호를 수신하고, 상기 조도 센서로부터 감지된 조도신호를 수신하여 저장하는 서버;인체가 감지되지 않을 때 상기 서버로부터 점등신호를 수신하여 점등하고, 인체가 감지될 때 상기 서버로부터소등신호를 수신하여 소등하는 적어도 하나의 제1 엘이디;상기 적외선 센서 또는 상기 초음파 센서가 인체를 감지할 때 상기 점등신호를 수신하여 점멸하고, 상기 조도센서가 감지한 조도가 설정조도 이하인 상태에서 인체가 감지되면 상기 서버로부터 인체감지신호를 수신하여 점멸하는 적어도 하나의 제2 엘이디;상기 조도센서가 감지한 조도가 설정 조도 이하일 때 상기 서버로부터 점등신호를 수신하여 점등하는 적어도 하나의 제3 엘이디; 및반사면이 볼록하며, 상기 제1 내지 제3 엘이디에 의해 둘러싸여지도록 중앙에 배치된 볼록거울를 포함하는 것을 특징으로 하는 스마트 볼록거울."}
{"patent_id": "10-2020-0185948", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 적외선 센서, 상기 초음파 센서 및 상기 조도센서에 전기적으로 연결되고, 상기 적외선 센서, 상기 초음파센서 또는 상기 조도센서 중 적어도 하나에 상용전원이 차단되었을 때 전원을 공급하는 무정전 전원공급장치를더 포함하는 것을 특징으로 하는 스마트 볼록거울."}
{"patent_id": "10-2020-0185948", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,딥러닝을 통한 사물인식 알고리즘을 이용하여 인체를 감지하는 지능형 카메라를 더 포함하는 것을 특징으로 하는 스마트 볼록거울."}
{"patent_id": "10-2020-0185948", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 스마트 볼록거울의 상부에는 상기 제1 내지 제3 엘이디에서 발광한 광이 위쪽으로 확산되는 것을 방지하기위한 차단막이 더 구비된 것을 특징으로 하는 스마트 볼록거울."}
{"patent_id": "10-2020-0185948", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 제1 내지 제3 엘이디는 상기 사물 인터넷 기술을 통해 차량 내부의 네비게이션 또는 RFID 하이패스와 연동하는 것을 특징으로 하는 스마트 볼록거울.공개특허 10-2022-0094589-3-청구항 6 제1항에 있어서,상기 스마트 볼록거울은 진입하는 경로의 사각지대에 설치된 것을 특징으로 하는 스마트 볼록거울."}
{"patent_id": "10-2020-0185948", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 스마트 볼록거울은 상기 사각지대 내에 배치된 가로등, 신호등 또는 전봇대 중에서 어느 하나에 설치된 것을 특징으로 하는 스마트 볼록거울."}
{"patent_id": "10-2020-0185948", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 제1 엘이디는 녹색 엘이디이고, 상기 제2 엘이디는 적색 엘이디이고, 상기 제3 엘이디는 노란색 엘이디인것을 특징으로 하는 스마트 볼록거울."}
{"patent_id": "10-2020-0185948", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 스마트 볼록거울에 관한 것으로, 주변에 방사된 적외선으로부터 인체를 감지하는 적외선 센서; 초음파 를 보내어 인체를 감지하는 초음파 센서; 주변의 조도를 감지하는 조도센서; 적외선 센서와 상기 초음파 센서로 부터 감지된 인체감지신호를 수신하고, 조도 센서로부터 감지된 조도신호를 수신하여 저장하는 서버; 인체가 감 (뒷면에 계속)"}
{"patent_id": "10-2020-0185948", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 스마트 볼록거울에 관한 것으로, 특히 아날로그 방식의 볼록거울에 디지털 센서들과 엘이디를 부착하 여 운전자에게 사각지대의 교통상황을 알림으로써 사고위험을 방지하는 스마트 볼록거울에 관한 것이다."}
{"patent_id": "10-2020-0185948", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "이 배경기술 부분에 기재된 사항은 발명의 배경에 대한 이해를 증진시키기 위하여 작성된 것으로서, 이 기술이 속하는 분야에서 통상의 지식을 가진 자에게 이미 알려진 종래 기술이 아닌 사항을 포함할 수 있다. 도로교통에서 원칙적으로는 불법 주정차를 금지하는 것이 가장 좋지만, 불법 주정차를 금지하는 것은 현재로서 는 어렵다. 여기에는 다양한 이유가 있다. 우선 멀리서 학교에 등교하거나 하교하는 학생의 경우 학부모가 부득이하게 어린이 보호구역 내에 차를 주차 및 정차 하는 경우가 잦고, 도로교통법에 따라 어린이 보호구역의 주 통학로에는 노상 주차장을 운영할 수 없지만, 주택가 주차장 부족 문제로 부득이하게 노상 주차장 형태로 거주자 우선 주차구역을 운영하는 경우도 많기 때문 이다. 이 외에도 정부는 시민신고제도를 도입하고 특별단속을 실시하고, 단속구간을 확대하는 등 많은 노력을 하고 있 다. 그러나, 그에 따른 민원이 발생하는 경우와 시민신고제도의 허점(1분 동안 기다렸다가 디시 촬영해야하는 점, 1 분 이하의 정차는 방지할 수 없음)으로 인해 불법 주정차를 완벽히 근절하기는 어려운 실정이다. 선행기술문헌 특허문헌"}
{"patent_id": "10-2020-0185948", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "(특허문헌 0001) 한국등록특허공보 제10-1674709호 발명의 내용"}
{"patent_id": "10-2020-0185948", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "전술한 종래기술의 문제점을 해결하기 위한 것으로, 본 발명은 운전자에게 보다 넓은 시야와 인체감지정보를 제 공하여 교통사고를 대비함에 있어 심리적 안정감을 줄 수 있는 스마트 볼록거울을 제공하는 것을 목적으로 한다. 또한, 본 발명은 사각지대에 있는 아이들이 돌발행동을 할 경우에도 운전자가 미리 대처하여 교통사고를 예방할 수 있는 스마트 볼록거울을 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2020-0185948", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 스마트 볼록거울은, 주변에 방사된 적외선으로부터 인체를 감지하는 적외선 센서; 초음파를 보내어 인체를 감지하는 초음파 센서; 주변의 조도를 감지하는 조도센서; 적외선 센서와 초음파 센서 로부터 감지된 인체감지신호를 수신하고, 조도 센서로부터 감지된 조도신호를 수신하여 저장하는 서버; 인체가 감지되지 않을 때 서버로부터 점등신호를 수신하여 점등하고, 인체가 감지될 때 서버로부터 소등신호를 수신하 여 소등하는 적어도 하나의 제1 엘이디; 적외선 센서 또는 초음파 센서가 인체를 감지할 때 점등신호를 수신하 여 점멸하고, 조도센서가 감지한 조도가 설정조도 이하인 상태에서 인체가 감지되면 서버로부터 인체감지신호를 수신하여 점멸하는 적어도 하나의 제2 엘이디; 조도센서가 감지한 조도가 설정 조도 이하일 때 서버로부터 점등 신호를 수신하여 점등하는 적어도 하나의 제3 엘이디; 및 반사면이 볼록하며, 제1 내지 제3 엘이디에 의해 둘러 싸여지도록 중앙에 배치된 볼록거울를 포함한다. 여기서, 적외선 센서, 초음파 센서 및 조도센서에 전기적으로 연결되고, 적외선 센서, 초음파 센서 또는 조도센 서 중 적어도 하나에 상용전원이 차단되었을 때 전원을 공급하는 무정전 전원공급장치를 더 포함한다. 또한, 딥러닝을 통한 사물인식 알고리즘을 이용하여 인체를 감지하는 지능형 카메라를 더 포함한다. 또한, 스마트 볼록거울의 상부에는 제1 내지 제3 엘이디에서 발광한 광이 위쪽으로 확산되는 것을 방지하기 위 한 차단막이 더 구비될 수 있다. 또한, 제1 내지 제3 엘이디는 사물 인터넷 기술을 통해 차량 내부의 네비게이션 또는 RFID 하이패스와 연동한다. 또한, 스마트 볼록거울은 진입하는 경로의 사각지대에 설치된다. 또한, 스마트 볼록거울은 사각지대 내에 배치된 가로등, 신호등 또는 전봇대 중에서 어느 하나에 설치된다. 또한, 제1 엘이디는 녹색 엘이디이고, 제2 엘이디는 적색 엘이디이고, 제3 엘이디는 노란색 엘이디이다."}
{"patent_id": "10-2020-0185948", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 운전자에게 보다 넓은 시야와 인체감지정보를 제공하여 교통사고를 대비함에 있어 심리적 안 정감을 줄 수 있다. 또한, 본 발명에 따르면, 사각지대에 있는 아이들이 돌발행동을 할 경우에도 운전자가 미리 대처하여 교통사고 를 예방할 수 있다."}
{"patent_id": "10-2020-0185948", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 후술되어 있는 실시예들을 참 조하면 명확해질 것이다. 그러나, 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서로 다른 다"}
{"patent_id": "10-2020-0185948", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "양한 형태로 구현될 수 있다. 단지 실시예들은 본 발명의 개시가 완전하도록 하고, 본 발명이 속하는 기술분야 에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 도 1은 본 발명의 일 실시예에 따른 스마트 볼록거울의 설치된 상황을 나타낸 개략도이고, 도 2는 본 발명의 일 실시예에 따른 스마트 볼록거울에 어린이가 비추어진 상태를 나타낸 개략도이다. 도 1을 참조하면, 스마트 볼록거울(smart convex mirror, 1000)은 어린이가 다니는 초등학교 등이 위치한 곳의 횡단보도 근처의 높은 위치에 설치된다. 볼록거울은 횡단보도에 서 있는 어린이를 반사하기 위해 어린이가 서 있는 곳을 향하도록 설치된다. 이와 같은 볼록거울이 설치되지 않은 상황에서 횡단보도 앞에 특정 차량이 불법 주정차하는 경우 불 법 주정차한 특정 차량의 근처에 있는 다른 차량은 키가 작은 어린이를 볼 수 없는 경우가 발생한다(화 살표 참조). 이때, 어린이가 횡단보도를 건너는 상황에서 차량이 주행하게 되는 일이 발생한다면 사고로 이어질 수 있다. 그러나, 스마트 볼록거울이 설치된다면, 어린이가 횡단보도 앞에 서 있을 경우 적색 엘이디 또는 노란색 엘이디의 점등 또는 점멸로 인해 도 2에 도시된 바와 같이 운전자가 스마트 볼록거울에 비추어진 어린이 의 모습을 보게 되어 사고를 방지할 수 있게 된다. 이와 같은 스마트 볼록거울은 진입하는 경로의 사각지대에 설치된다. 특히, 스마트 볼록거울은 사 각지대 내에 배치된 가로등, 신호등 또는 전봇대 중에서 어느 하나에 설치될 수 있다. 도 1에서는 신호등에 스마트 볼록거울이 설치된 것을 예로 들어 설명하였다. 가로등, 신호등 또는 전봇대에 스마트 볼록거울을 설치할 경우에는, 전선을 별도로 설치하지 않고도 배선 을 통해 스마트 볼록거울에 전원이 공급되도록 할 수 있는 이점이 있다. 도 3은 본 발명의 일 실시예에 따른 스마트 볼록거울의 정면도이고, 도 4는 본 발명의 일 실시예에 따른 스마트 볼록거울의 사시도이며, 도 5는 본 발명의 일 실시에에 따른 스마트 볼록거울을 동작시키는 각 구성의 전기적 연결상태를 나타낸 블록도이다. 도 3 및 도 5를 참조하면, 스마트 볼록거울은 적외선 센서, 초음파 센서, 조도 센서, 서 버, 제1 엘이디, 제2 엘이디, 제3 엘이디, 볼록거울, 지능형 카메라, 차단막 및 무정전 전원공급장치(Uninterruptable Power Supply, UPS, 920)를 포함할 수 있다. 적외선 센서, 초음파 센서, 조도 센서, 서버 및 무정전 전원공급장치는 스마트 볼록 거울의 외관으로 보이지 않기 때문에 도 3 및 도 4에는 도시되지 않았다. 적외선 센서는 주변에 방사된 적외선으로부터 인체를 감지한다. 적외선 센서는 외부 물질로부터 방사 된 적외선이 내부의 자발 분극을 갖는 물질의 분극을 변화시켜 외부 자유 전하를 발생시킴으로써 물질을 감지하 는 원리를 갖는다. 적외선의 파장은 가시광선의 파장보다 길며 극초단파보다 짧은 0.7μm~1mm의 전자기파이다. 적외선은 눈으로는 볼 수 없고 일반적으로 공기 가운데에서 산란되기 어려우며, 가시광선보다 투과력이 강하다.초음파 센서는 초음파를 보내어 인체를 감지한다. 초음파 센서는 초음파의 특성을 이용하거나 초음파 를 보내어 거리, 두께 및 움직임 따위를 검출하는 원리를 갖는다. 사람의 귀에 소리로 들리는 한계 주파수 이상 이어서 들을 수 없으며, 파장이 작고 지향성이 강하다. 조도 센서는 주변의 조도를 감지한다. 서버는 적외선 센서와 초음파 센서로부터 감지된 인체감지신호를 수신하고, 조도 센서로부 터 감지된 조도신호를 수신하여 저장한다. 제1 엘이디는 인체가 감지되지 않을 때 서버로부터 점등신호를 수신하여 점등하고, 인체가 감지될 때 서버로부터 소등신호를 수신하여 소등한다. 제1 엘이디는 적어도 하나일 수 있다. 제2 엘이디는 적외선 센서 또는 초음파 센서가 인체를 감지할 때 점등신호를 수신하여 점멸하고, 조도센서가 감지한 조도가 설정조도 이하인 상태에서 인체가 감지되면 서버로부터 인체감 지신호를 수신하여 점멸한다. 제2 엘이디는 적어도 하나일 수 있다. 제2 엘이디의 점멸은 사람이 있 다는 것을 알림으로써 1차적으로 주위를 집중시키는 역할을 한다. 이때, 운전자가 주행방향으로 점진적으로 접 근하면서 스마트 볼록거울을 통해 주변상황을 자율적으로 판단할 수 있게 된다. 제3 엘이디는 조도센서가 감지한 조도가 설정 조도 이하일 때 서버로부터 점등신호를 수신하여 점등한다. 제3 엘이디는 적어도 하나일 수 있다. 제3 엘이디는 야간 등의 주위 식별이 어려운 상황에서 이를 운 전자가 시선을 집중하게 하는 역할을 한다. 이 경우에는 어린이뿐만 아니라 성인의 교통사고까지도 방지할 수 있게 된다. 위에서 설명한 제1 엘이디는 녹색 엘이디이고, 제2 엘이디는 적색 엘이디이고, 제3 엘이디는 노 란색 엘이디일 수 있다. 제1 내지 제3 엘이디(500, 600, 700)는 서로 다른 색이라면 이에 한정되지 않고 다른 색깔로 구현될 수 있음은 물론이다. 볼록거울은 반사면이 볼록하며, 제1 내지 제3 엘이디(500, 600, 700)에 의해 둘러싸여지도록 중앙에 배치 된다. 볼록거울은 구면의 바깥쪽에서 빛을 반사하게 하는 구면 거울이며, 빛이 비추어진 물체의 반대쪽에 는 작고 바로 선 허상이 생긴다. 지능형 카메라는 딥러닝(deep learning)을 통한 사물인식 알고리즘을 이용하여 인체를 감지한다. 딥러닝은 머신러닝의 한 분야로 인간 두뇌 신경망 구조를 모방한 인공신경망에 바탕을 둔 기술로서 공지된 사항이므로, 더 상세한 설명은 생략하기로 한다. 차단막은 스마트 볼록거울의 상부에 배치되며, 제1 내지 제3 엘이디(500, 600, 700)에서 발광한 광이 위쪽 으로 확산되는 것을 방지한다. 광이 위쪽으로 확산되면 운전자의 눈에 도달하지 않기 때문이다. 무정전 전원공급장치는 적외선 센서, 초음파 센서 및 조도센서에 전기적으로 연결되고, 적 외선 센서, 초음파 센서 또는 조도센서 중 적어도 하나에 상용 교류전원이 차단되었을 때 전원을 공급한다. 평상시에는 상용 교류전원에서 정류장치, 역변환 장치, 변형 보정장치 따위를 거쳐 부하 로 교류를 공급하며, 다시 정류장치의 출력에 축전지를 접속하여 부동 동작을 시킴으로써 정전시에는 이 축전지 에서 변환기를 거쳐서 계속 전력을 공급하는 장치이다. 위에서 설명한 제1 내지 제3 엘이디(500, 600, 700)는 사물 인터넷 기술을 통해 차량 내부의 네비게이션 또는 RFID 하이패스와 연동하도록 할 수 있다. 한편, 스마트 볼록거울과는 별도로 차량의 내부에는 경고장치가 설치될 수 있으며, 지능형 카메라와 사물 인터넷 기술을 통해 연결되어, 지능형 카메라가 인체를 감지할 때 경고음을 발생시킬 수 있다. 도 6은 본 발명의 일 실시예에 따른 특정 상황에서의 녹색 엘이디, 적색 엘이디 및 노란색 엘이디의 점멸, 점등 및 소등의 상태를 나타낸 것이다. 도 6을 참조하면, 평상시(인체가 감지되지 않을 때)에는 녹색 엘이디가 점등되어 있고, 적색 엘이디와 노란색 엘이디는 소등되어 있다. 이 상태에서, 적외선 센서 또는 초음파 센서가 인체를 감지할 때 적색 엘이디는 점멸하고, 녹색 엘이디는 소등 된다.만약, 조도센서가 감지한 조도가 설정조도 이하인 상태에서(설정조도 이하로 어두워질 때) 인체가 감지되면 적 색 엘이디는 점멸하고, 노란색 엘이디는 점등한다. 도 1 내지 도 6를 통해 살펴본 본 발명의 일 실시예에 따른 스마트 볼록거울은, 종래의 아날로그 방식의 볼록거 울에 디지털 센서들과 엘이디를 부착하여 운전자에게 사각지대의 교통상황을 알림으로써 사고위험을 방지하였다 는 점에서 큰 의미가 있다. 전술한 본 발명의 실시예들은 이해를 돕기 위하여 도면에 도시된 실시예들을 참고로 설명되었으나, 이는 예시적 인 것에 불과하며, 당해 분야에서 통상적 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 타 실시예가 가 능하다는 점을 이해할 것이다. 따라서, 본 발명의 진정한 기술적 보호 범위는 첨부된 청구범위에 의해 정해져야 할 것이다."}
{"patent_id": "10-2020-0185948", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 스마트 볼록거울의 설치된 상황을 나타낸 개략도이다. 도 2는 본 발명의 일 실시예에 따른 스마트 볼록거울에 어린이가 비추어진 상태를 나타낸 개략도이다. 도 3은 본 발명의 일 실시예에 따른 스마트 볼록거울의 정면도이다.도 4는 본 발명의 일 실시예에 따른 스마트 볼록거울의 사시도이다. 도 5는 본 발명의 일 실시에에 따른 스마트 볼록거울을 동작시키는 각 구성의 전기적 연결상태를 나타낸 블록도 이다. 도 6은 본 발명의 일 실시예에 따른 특정 상황에서의 녹색 엘이디, 적색 엘이디 및 노란색 엘이디의 점멸, 점등 및 소등의 상태를 나타낸 것이다."}
