{"patent_id": "10-2017-0002322", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2018-0081280", "출원번호": "10-2017-0002322", "발명의 명칭": "자전거용 동적 타이어 압력 센서 시스템", "출원인": "우 치엔-첸", "발명자": "찌-유앙 시앙"}}
{"patent_id": "10-2017-0002322", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "자전거의 타이어 내부 또는 타이어 상에 설치된 동적 타이어 압력 센서 장치 를 포함하는 자전거용 동적 타이어압력 센서 시스템:상기 동적 타이어 압력 센서 장치는 다음을 포함한다:일정 시간 동안의 적어도 하나의 타이어 압력의 웨이브 패턴들을 갖는 타이어 압력 변화 데이터의 검출을 위한적어도 하나의 타이어 압력 센서 모듈;프로세싱 모듈에 상기 타이어 압력 변화 데이터를 전송하는 상기 타이어 압력 센서 모듈에 전기적으로 연결되어상기 타이어 압력 센서 모듈의 작동을 제어하고, 상기 타이어 압력 변화 데이터에 따라 타이어 압력의 웨이브패턴들 중에서 타이어 압력 피크들을 분석함으로써, 주행하는 자전거의 페달 카덴스 및 페달 답력을 계산하는프로세싱 모듈;상기 프로세싱 모듈로부터 계산된 결과들을 전송하기 위해 상기 프로세싱 모듈에 전기적으로 연결된 송신 모듈;및 상기 송신 모듈로부터 계산된 결과들을 수신하여, 상기 계산된 결과들을 실시간 스포츠 정보로서 디스플레이하는 사용자 수신 캐리어."}
{"patent_id": "10-2017-0002322", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 프로세싱 모듈은 자전거의 페달 카덴스의 계산을 위해 일정 시간 동안의 타이어 압력의 웨이브 패턴들 중에서 적어도 2개의 타이어 압력 피크들 사이의 기간을 검색하는 페달 카덴스 분석 유닛을 더 포함하는 동적 타이어 압력 센서 시스템."}
{"patent_id": "10-2017-0002322", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 프로세싱 모듈은 사이클리스트에 의해 적용된 페달 답력의 계산을 위해 일정 시간 동안의 타이어 압력의웨이브 패턴들 중에서 타이어 압력 피크들의 크기를 검색하는 페달 답력 분석 유닛을 더 포함하는 동적 타이어압력 센서 시스템."}
{"patent_id": "10-2017-0002322", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 사용자 수신 캐리어는 상기 송신 모듈로부터 계산된 결과들을 수신하여, 상기 계산된 결과를 실시간 스포츠 정보로서 디스플레이하기 위한 어플리케이션 프로그램이 설치된 휴대용 지능 장치일 수 있는 동적 타이어 압력 센서 시스템."}
{"patent_id": "10-2017-0002322", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "자전거의 타이어 내부 또는 타이어 상에 설치된 동적 타이어 압력 센서 장치 를 포함하는 자전거용 동적 타이어압력 센서 시스템:상기 동적 타이어 압력 센서 장치는 다음을 포함한다:일정 시간 동안의 적어도 하나의 타이어 압력의 웨이브 패턴들을 갖는 타이어 압력 변화 데이터를 검출하기 위한 적어도 하나의 타이어 압력 센서 모듈;프로세싱 모듈에 타이어 압력 변화 데이터를 전송하는 상기 타이어 압력 센서 모듈에 전기적으로 연결되어 상기공개특허 10-2018-0081280-3-타이어 압력 센서 모듈의 작동을 제어하는 프로세싱 모듈;상기 프로세싱 모듈로부터 수신된 타이어 압력 변화 데이터의 전송을 위해 상기 프로세싱 모듈에 전기적으로 연결된 송신 모듈; 및상기 송신 모듈로부터 타이어 압력 변화 데이터를 수신하여 실시간 스포츠 정보를 디스플레이/제공하고, 상기타이어 압력 변화 데이터에 따라 타이어 압력의 웨이브 패턴들 중에서 타이어 압력 피크들을 분석함으로써 주행하는 자전거의 페달 카덴스 및 페달 답력을 계산하는 사용자 수신 캐리어."}
{"patent_id": "10-2017-0002322", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 사용자 수신 캐리어는, 상기 송신 모듈로부터의 타이어 압력 변화 데이터의 수신, 상기 타이어 압력 변화데이터를 근거로 한 데이터 오퍼레이션, 및 페달 카덴스 및 페달 답력과 같은 실시간 스포츠 정보의 디스플레이를 위한 어플리케이션 프로그램이 설치된 휴대용 지능 장치일 수 있는 동적 타이어 압력 센서 시스템."}
{"patent_id": "10-2017-0002322", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 어플리케이션 프로그램은 자전거의 페달 카덴스의 계산을 위해 일정 시간 동안의 타이어 압력의 웨이브 패턴들 중에서 적어도 2개의 타이어 압력 피크들 사이의 기간을 검색하는 페달 카덴스 분석 유닛을 더 포함하는동적 타이어 압력 센서 시스템."}
{"patent_id": "10-2017-0002322", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서,상기 어플리케이션 프로그램은 사이클리스트에 의해 적용된 페달 답력의 계산을 위해 일정 시간 동안의 타이어압력의 웨이브 패턴들 중에서 타이어 압력 피크들의 크기를 검색하는 페달 답력 분석 유닛을 더 포함하는 동적타이어 압력 센서 시스템."}
{"patent_id": "10-2017-0002322", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "자전거용 동적 타이어 압력 센서 시스템은 동적 타이어 압력 센서 장치 및 사용자 수신 캐리어를 포함하고, 여기 에서 상기 동적 타이어 압력 센서 장치는 적어도 하나의 타이어 압력 센서 모듈, 프로세싱 모듈 및 송신 모듈을 포함한다: 상기 타이어 압력 센서 모듈은 상기 프로세싱 모듈에 타이어 압력 변화 데이터를 전송하고; 상기 프로 세싱 모듈은 독립적으로 데이터 오퍼레이션을 수행하거나, 또는 사이클링하는 동안에 페달 카덴스 및 페달 답력 을 분석하기 위해 데이터 오퍼레이션을 위해 송신 모듈로부터 사용자 수신 캐리어에 타이어 압력 변화 데이터를 전송하고, 그리고 상기 사용자 수신 캐리어에서 실시간 스포츠 정보를 제공/디스플레이한다."}
{"patent_id": "10-2017-0002322", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 자전거용 동적 타이어 압력 센서 시스템, 특히 사이클링하는 동안에 실시간 스포츠 정보의 분석 및 사용자 수신 캐리어에서의 스포츠 정보의 디스플레이를 위해 자전거의 타이어 내부 또는 타이어 상에 설치되는 동적 압력 센서 시스템에 관한 것이다."}
{"patent_id": "10-2017-0002322", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "페달 답력(pedaling forces) 또는 페달 카덴스(pedaling cadences)를 측정하기 위하여, 페달, 하부 브래킷 쉘, 체인 휠, 허브 또는 크랭크와 같은 자전거 프레임 내부의 주요 부품 상에 설치되는 센서는 페달 답력을 직접 측 정하기 위해 스트레인 게이지 또는 압전 변환기를 필요로 하거나, 페달 답력을 간접적으로 측정하기 위해서 토 오크 변환기(torque transducer)를 필요로 한다. 그러나, 제조가 용이하지 않을 뿐만 아니라 설치가 어려운 기 존 센서는 자전거의 모든 모델들에 적용할 수가 없고, 전압 출력의 제어가 불편한 결함이 있다. 기계적 주행 조건들에 관한 관점에서, 크랭크는 360° 이상의 힘이 가해지는 이상적이고 효과적인 부품일 것이다. 그러나, 기계와 다른 인간은 다리 근육이 앞으로 또는 아래로 페달을 움직이는 것이 효과적이며 익숙하다. 그러나, 뒤로 또는 위로 페달링하는데 익숙하지 않은 인간은 보통 피곤함을 느낄 수 있다. 이러한 배경과는 다 르게, 효과적으로 잘 훈련된 인간은 모든 방향에서 다른 페달 답력을 적용함으로써 페달링 훈련을 잘 수행할 것 이다. 예를 들어, 3시 위치(90°)에서 회전되는 크랭크에 적용된 접선방향의 페달 답력은 지면과 직각을 이루며, 일반 적으로 효과적이다. 상대적으로, 상기 접선방향의 페달 답력은 9시 위치(270°)에서 회전되는 크랭크에는 적용 되기 어렵고, 부정적인 영향은 사이클리스트의 다리 무게로 인해 최고조에 달하게 된다. 페달링의 효율을 위해,최대 힘의 적용 지점은 약 3시 위치의 주변이어야 한다; 그러나, 사이클리스트의 다리는 9시 위치에서 페달링하 는 동안 부드럽게 운동하지 못할 수 있다. 페달링의 효율은 상기 두가지의 요인에 의해 영향을 받는다. 상기에서 언급한 바와 같이, 센서 감지 기술에 기반하여 측정된 페달 답력 및 페달링 속도는 직접적으로 인공적 요인들에 의해 영향을 받는다. 또한, 페달 답력 및 페달 카덴스의 검출을 위한 기존 센서들은 설치의 어려움 및 전압 출력 제어의 불편함과 같은 단점들을 가지므로 보편적 부품이 아니며, 당분야 기술자에 의해 보정될 필요 가 있다."}
{"patent_id": "10-2017-0002322", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "그러므로, 타이어 내부 또는 타이어 상에 설치된 동적 타이어 압력 센서 장치는, 고객의 비용 감소, 자전거의 감소된 중량, 및 자전거 프레임의 외부 손상 부재를 위해, 페달 속도 미터 및 다이나모미터와 같은 다수의 센서 들을 대체하는 타이어 압력 센서 모듈을 포함한다. 이와 같이, 자전거용 동적 타이어 압력 센서 시스템은 바람 직한 해법일 수 있다."}
{"patent_id": "10-2017-0002322", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명은, 모든 타입의 자전거의 타이어 내부 또는 타이어 상에 설치되어, 사이클링하는 동안에 페달 카덴스의 실시간 분석을 위한 고주파 데이터 수집, 및 계산된 결과들을 사용자 수신 캐리어에서 실시간 스포츠 정보로서 디스플레이하는 것을 특징으로 하는 자전거용 동적 타이어 압력 센서 시스템에 관한 것이다. 본 발명은 양쪽 발에 의해 적용되는 페달 답력의 광범위한 측정, 다양한 모델의 자전거에 대한 쉬운 설치 및 경 량 센서와 같은 다른 장점들의 특징을 갖는 자전거용 동적 타이어 압력 센서 시스템에 관한 것이다. 자전거용 동적 타이어 압력 센서 시스템은 자전거의 타이어 내부 또는 타이어 상에 설치된 동적 타이어 압력 센 서 장치를 포함하고, 상기 동적 타이어 압력 센서 장치는 다음을 포함한다: 자전거에 대해 일정 시간 동안의 적어도 하나의 타이어 압력의 웨이브 패턴을 갖는 타이어 압력 변화 데이터의 검출을 위한 적어도 하나의 타이어 압력 센서 모듈(tire pressure sensor module); 프로세싱 모듈에 상기 타이어 압력 변화 데이터를 전송하는 상기 타이어 압력 센서 모듈에 전기적으로 연결되어 상기 타이어 압력 센서 모듈의 작동을 제어하고, 상기 타이어 압력 변화 데이터에 따라 타이어 압력의 웨이브 패턴들 중에서 타이어 압력 피크들을 분석함으로써, 주행하는 자전거의 페달 카덴스 및 페달 답력을 계산하는 프로세싱 모듈(processing module); 상기 프로세싱 모듈로부터 계산된 결과들을 전송하기 위해 상기 프로세싱 모듈에 전기적으로 연결된 송신 모듈 (transmission module); 및 상기 송신 모듈로부터 계산된 결과들을 수신하여, 상기 계산된 결과들을 실시간 스포츠 정보로서 디스플레이하 는 사용자 수신 캐리어(user receiving carrier). 구체적으로, 상기 프로세싱 모듈은 자전거의 페달 카덴스의 계산을 위해 일정 시간 동안의 타이어 압력의 웨이 브 패턴들 중에서 적어도 2개의 타이어 압력 피크들 사이의 기간을 검색하는 페달 카덴스 분석 유닛을 더 포함 한다. 구체적으로, 상기 프로세싱 모듈은 사이클리스트에 의해 적용된 페달 답력의 계산을 위해 일정 시간 동안의 타 이어 압력의 웨이브 패턴들 중에서 타이어 압력 피크들의 크기를 검색하는 페달 답력 분석 유닛을 더 포함한다. 구체적으로, 상기 사용자 수신 캐리어는 상기 송신 모듈로부터 계산된 결과들을 수신하여, 상기 계산된 결과를 실시간 스포츠 정보로서 디스플레이하기 위한 어플리케이션 프로그램이 설치된 휴대용 지능 장치(hand-held intelligent device)일 수 있다. 자전거용 동적 타이어 압력 센서 시스템은 자전거의 타이어 내부에 설치된 동적 타이어 압력 센서 장치를 포함 하고, 상기 동적 타이어 압력 센서 장치는 다음을 포함한다: 일정 시간 동안의 적어도 하나의 타이어 압력의 웨이브 패턴들을 갖는 타이어 압력 변화 데이터를 검출하기 위 한 적어도 하나의 타이어 압력 센서 모듈; 프로세싱 모듈에 타이어 압력 변화 데이터를 전송하는 상기 타이어 압력 센서 모듈에 전기적으로 연결되어 상기 타이어 압력 센서 모듈의 작동을 제어하는 프로세싱 모듈; 상기 프로세싱 모듈로부터 수신된 타이어 압력 변화 데이터의 전송을 위해 상기 프로세싱 모듈에 전기적으로 연 결된 송신 모듈; 및 상기 송신 모듈로부터 상기 타이어 압력 변화 데이터를 수신하여 실시간 스포츠 정보를 디스플레이/제공하고, 상기 타이어 압력 변화 데이터에 따라 타이어 압력의 웨이브 패턴들 중에서 타이어 압력 피크들을 분석함으로써 주행하는 자전거의 페달 카덴스 및 페달 답력을 계산하는 사용자 수신 캐리어. 구체적으로, 상기 사용자 수신 캐리어는, 상기 송신 모듈로부터의 타이어 압력 변화 데이터의 수신, 상기 타이 어 압력 변화 데이터를 근거로 한 데이터 오퍼레이션, 및 페달 카덴스 및 페달 답력과 같은 실시간 스포츠 정보 의 디스플레이를 위한 어플리케이션 프로그램이 설치된 휴대용 지능 장치일 수 있다. 구체적으로, 상기 어플리케이션 프로그램은 자전거의 페달 카덴스의 계산을 위해 일정 시간 동안의 타이어 압력 의 웨이브 패턴들 중에서 적어도 2개의 타이어 압력 피크들 사이의 기간을 검색하는 페달 카덴스 분석 유닛을 더 포함할 수 있다. 구체적으로, 상기 어플리케이션 프로그램은 사이클리스트에 의해 적용된 페달 답력의 계산을 위해 일정 시간 동 안의 타이어 압력의 웨이브 패턴들 중에서 타이어 압력 피크들의 크기를 검색하는 페달 답력 분석 유닛을 더 포 함할 수 있다."}
{"patent_id": "10-2017-0002322", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "자전거용 동적 타이어 압력 센서 시스템에 관한 기술 내용들, 특징들 및 효과들은 바람직한 구체예들 및 첨부한 도면들에 명확하게 제시되어 있다. 도 1, 도 2 및 도 3은 각각 자전거용 동적 타이어 압력 센서 시스템의 전체 구조의 개략도, 동적 타이어 압력 센서 장치의 내부 구조의 개략도, 및 프로세싱 모듈의 내부 구조에 대한 개략도이다. 도 1 내지 도 3에 나타낸 바와 같이, 자전거용 동적 타이어 압력 센서 시스템은 동적 타이어 압력 센서 장치 및 사용자 수신 캐리어 를 포함하고, 여기에서 상기 동적 타이어 압력 센서 장치는 일정 시간 동안의 적어도 하나의 타이어 압력 의 웨이브 패턴을 갖는 자전거의 타이어 압력 변화 데이터를 검출하기 위한 적어도 하나의 타이어 압력 센서 모듈, 프로세싱 모듈 및 송신 모듈을 포함한다. 상기 프로세싱 모듈은 상기 프로세싱 모듈에 타이어 압력 변화 데이터를 전송하는 타이어 압력 센서 모 듈과 전기적으로 연결되어 압력 센서 모듈의 작동을 제어하고; 페달 카덴스 분석 유닛 및 페달 답력 분석 유닛을 더 포함하는 프로세싱 모듈은 타이어 압력 변화 데이터에 의해 주행하는 자전거의 페달 카덴스 및 페달 답력을 계산할 수 있다. 상기 페달 카덴스 분석 유닛은 자전거의 페달 카덴스의 계산을 위해 일정한 시간 동안의 타이어 압력의 웨 이브 패턴들 중에서 적어도 2개의 타이어 압력 피크들 사이의 기간을 검색할 수 있고; 상기 페달 답력 분석 유 닛은 사이클리스트에 의해 적용된 페달 답력의 계산을 위해 일정 시간 동안의 타이어 압력의 웨이브 패턴 들 중에서 타이어 압력 피크들의 크기를 검색할 수 있다. 상기 프로세싱 모듈은 계산된 페달 카덴스 및 페달 답력을 사용자 수신 캐리어에 전송하고, 상기 사용자 수신 캐리어에서 상기 송신 모듈을 통해 실시간 스포츠 정보가 디스플레이된다. 상기 사용자 수신 캐리어는 실시간 스포츠 정보를 제공하고 디스플레이하기 위한 어플리케이션 프로그램(2 1)이 설치된 휴대용 지능 장치일 수 있다. 선택적으로는, 도 4에 나타낸 바와 같이, 상기 어플리케이션 프로그 램에는 페달 카덴스 분석 유닛 및 페달 답력 분석 유닛이 제공되고, 이들은 페달 카덴스 분석 유 닛 및 페달 답력 분석 유닛과 같이 작동하므로, 그에 대한 설명은 생략한다. 페달 카덴스 및 페달 답력을 계산하기 위한 기능을 갖는 프로세싱 모듈 및 어플리케이션 프로그램 모두 를 위하여, 상기 프로세싱 모듈은 독립적으로 페달 카덴스 및 페달 답력을 계산하거나, 또는 페달 카덴스 및 페달 답력을 계산하는 어플리케이션 프로그램으로 타이어 압력 변화 데이터를 전송한다. 페달 카덴스 및 페달 답력만을 계산하는 기능을 갖는 상기 프로세싱 모듈의 경우, 페달 카덴스 및 페달 답 력은 독립적으로 상기 프로세싱 모듈에 의해 계산되고, 상기 어플리케이션 프로그램으로 전송된다. 페달 카덴스 및 페달 답력만을 계산하는 기능을 갖는 상기 어플리케이션 프로그램의 경우, 타이어 압력 변 화 데이터는 상기 어플리케이션 프로그램에서의 페달 카덴스 및 페달 답력의 계산을 위해 상기 프로세싱 모 듈에 의해 상기 어플리케이션 프로그램으로 전송된다. 도 5에 나타낸 바와 같이, 자전거의 타이어 내부 또는 타이어 상에 설치되는 상기 동력 타이어 압력 센서 장치는 도 6a(지면과 접촉하여 압축 상태로 유지되는(유지되지 않는) 타이어의 순간 압력 상승(완 화)에 기인함)에 나타낸 바와 같이 일정한 시간 동안의 적어도 하나의 타이어 압력의 웨이브 패턴을 갖는 타이 어 압력 변화 데이터를 검출할 수 있다. 도 6a는 복수의 타이어 압력 피크들을 나타낸 것이고; 도 6b는 타이어 압력의 웨이브 패턴들을 갖는 타이어 압 력 피크들의 크기를 확대하여 상세하게 나타낸 것이며, 여기에서 하나의 타이어 압력 피크는 사이클리스트가 1 회 페달을 밟는 것을 의미하며, Pt는 2개의 타이어 압력 피크들 사이의 기간이고, 그리고 CAD는 CAD=30×(1÷ Pt)의 식(단위: RPM; 30: 분 당 회전수로 전환된 초 당 회전 수에 대한 단위 전환 계수)에 따른 페달 카덴스이 다. 고유 압력 값(Pa)에 대응되는 단일 (최대) 타이어 압력 피크를 사용하여, 일정 시간 동안의 타이어 압력의 웨이 브 패턴들 중 전체 타이어 압력 피크들은 F=k×△P+R의 식(F: 페달 답력; k: 보정 계수(correction coefficient) (단위: N/Pa); △P: 타이어 압력 변화 (최대 타이어 압력 (일정 시간 동안의 단일 타이어 압력 피 크에서의 압력의 크기) - 평균 타이어 압력 (일정 시간 동안의 전체 타이어 압력 피크들의 평균 값)); R: 보정 계수)에 따른, 사이클리스트에 의해 자전거에 적용되는 페달 답력을 계산하기 위한 기초가 되는 압력(Pa)의 고 유 크기들과 일치된다. 다른 종래의 기술들과는 대조적으로, 본 발명의 자전거용 동적 타이어 압력 센서 시스템은 하기와 같은 장점들 을 갖는다: 타이어 내부 또는 타이어 상에 설치되는 동적 타이어 압력 센서 장치는, 복수의 파라미터들의 통합에 근거 하여 자전거의 속도를 검출하는 타이어 압력 센서 모듈을 포함하고, 페달링 속도계 및 다이나모미터와 같은 다 양한 센서들을 대체하여 고객의 비용을 줄이고, 자전거의 하중을 감소시키며, 자전거 프레임의 외관이 손상되지 않게 한다. 모든 타입의 자전거의 타이어 내부 또는 타이어 상에 설치될 수 있는 동적 타이어 압력 센서 시스템은, 실 시간 분석을 위한 고주파 데이터 수집, 및 웨이브 패턴 변화(웨이브 진폭 변화)에 근거하여 사이클링 동안의 페 달 카덴스의 계산 및 계산된 결과들을 사용자 수신 캐리어에서 실시간 스포츠 정보로서 디스플레이하는 것을 특 징으로 한다. 자전거용 동적 타이어 압력 센서 시스템은, 양쪽 발에 의해 적용된 페달 답력의 광범위한 측정, 다양한 타 입의 자전거에 대한 설치 용이성, 경량 센서, 및 출력 전압의 보정 불필요성과 같은 다른 장점들을 갖는 것을 특징으로 한다. 상술한 바람직한 구체예들은 본 발명의 자전거용 동적 타이어 압력 센서 시스템의 범위를 제한하기 위한 예로서 여겨져서는 안된다. 본 발명의 사상 및 범위를 벗어나지 않으면서 상기 기술적 특징들 및 구체예들을 숙지한 당분야 기술자들에 의 해 이루어진 부분적인 변경들 및 변형들은 본 발명의 특허 명세서의 청구항들에 포함되는 것으로 인식되어야 한 다."}
{"patent_id": "10-2017-0002322", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 자전거용 동적 타이어 압력 센서 시스템의 전체 구조에 대한 개략도이다. 도 2는 자전거용 동적 타이어 압력 센서 시스템 내의 동적 타이어 압력 센서 장치의 내부 구조에 대한 개략도이 다. 도 3은 자전거용 동적 타이어 압력 센서 시스템의 동적 타이어 압력 센서 장치 내의 프로세싱 모듈의 내부 구조 에 대한 개략도이다. 도 4는 다른 구체예로서 자전거용 동적 타이어 압력 센서 시스템의 동적 타이어 압력 센서 장치 내의 사용자 수 신 캐리어의 내부 구조에 대한 개략도이다. 도 5는 자전거용 동적 타이어 압력 센서 시스템 내의 동적 타이어 압력 센서 장치의 어플리케이션에 대한 개략 도이다. 도 6a는 자전거용 동적 타이어 압력 센서 시스템 내의 동적 타이어 압력 센서 장치로부터의 타이어 압력의 웨이 브 패턴들에 대한 개략도이다. 도 6b는 자전거용 동적 타이어 압력 센서 내의 동적 타이어 압력 센서 장치를 통한 타이어 압력의 분석에 대한 개략도이다."}
