{"patent_id": "10-2018-0134754", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0052628", "출원번호": "10-2018-0134754", "발명의 명칭": "지능형 개인 비서에 대한 위치 분류", "출원인": "하만인터내셔날인더스트리스인코포레이티드", "발명자": "바르자티아 미낙시"}}
{"patent_id": "10-2018-0134754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "에 있어서,상기 공간 특유 응답은 상기 매칭된 저장된 공간 임펄스 응답의 상기 공간 프로파일에 특유한 오디오 설정들을포함하는, 디바이스."}
{"patent_id": "10-2018-0134754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 공간 샘플은 미리 결정된 양의 시간의 지수적 주파수 스윕(sweep)을 포함하는, 디바이스."}
{"patent_id": "10-2018-0134754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,상기 샘플 공간 임펄스 응답은 시간에 걸친 복수의 진폭들을 포함하는, 디바이스."}
{"patent_id": "10-2018-0134754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 3에 있어서,상기 프로세서는, 상기 샘플 응답의 상기 진폭들의 미리 정의된 양이 상기 저장된 응답의 진폭들과 매칭되는 것에 응답하여 상기 샘플 공간 임펄스 응답(room impulse response; RIR)이 상기 저장된 공간 임펄스 응답들 중하나와 매칭된다는 것을 결정하도록 더 구성되는, 디바이스."}
{"patent_id": "10-2018-0134754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 3에 있어서,상기 프로세서는, 상기 샘플 응답의 상기 진폭들 중 다수가 상기 저장된 응답의 진폭들과 매칭되는 것에 응답하여 상기 샘플 공간 임펄스 응답이 상기 저장된 공간 임펄스 응답들 중 하나와 매칭된다는 것을 결정하도록 더구성되는, 디바이스."}
{"patent_id": "10-2018-0134754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 1에 있어서,상기 공간 특유 응답은 상기 매칭된 저장된 공간 임펄스 응답의 상기 공간 프로파일에 기초한 상기 마이크로폰에서의 상황 정보적인 가청 출력 응답들을 포함하는, 디바이스. 공개특허 10-2019-0052628-3-청구항 7"}
{"patent_id": "10-2018-0134754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "에 있어서,상기 공간 특유 응답은 상기 매칭된 저장된 속성의 상기 공간 프로파일에 기초한 상기 마이크로폰에서의 상황정보적인 가청 출력 응답들을 포함하는, 디바이스."}
{"patent_id": "10-2018-0134754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 8에 있어서,상기 공간 샘플은 미리 결정된 양의 시간의 지수적 주파수 스윕을 포함하는, 디바이스."}
{"patent_id": "10-2018-0134754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 8에 있어서,상기 샘플 공간 속성은 샘플 공간 임펄스 응답을 포함하는, 디바이스."}
{"patent_id": "10-2018-0134754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 10에 있어서,상기 샘플 공간 임펄스 응답은 시간에 걸친 복수의 진폭들을 포함하는, 디바이스."}
{"patent_id": "10-2018-0134754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 11에 있어서,상기 프로세서는, 상기 샘플 응답의 상기 진폭들의 미리 정의된 양이 상기 저장된 속성의 진폭들과 매칭되는 것에 응답하여 상기 샘플 속성이 상기 저장된 속성들 중 하나와 매칭된다는 것을 결정하도록 더 구성되는, 디바이스."}
{"patent_id": "10-2018-0134754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 11에 있어서,상기 프로세서는, 상기 샘플 응답의 상기 진폭들 중 다수가 상기 저장된 속성의 진폭들과 매칭되는 것에 응답하여 상기 샘플 속성이 상기 저장된 속성들 중 하나와 매칭된다는 것을 결정하도록 더 구성되는, 디바이스.공개특허 10-2019-0052628-4-청구항 14"}
{"patent_id": "10-2018-0134754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "청구항 8에 있어서,상기 공간 특유 응답은 상기 매칭된 저장된 속성의 상기 공간 프로파일에 특유한 오디오 설정들을 포함하는, 디바이스."}
{"patent_id": "10-2018-0134754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "개인 비서 디바이스의 위치를 결정하고 상기 위치에 특유한 설정들을 적용하기 위한 방법으로서,샘플 공간 임펄스 응답을 갖는 공간 샘플을 수신하는 단계; 상기 샘플 공간 임펄스 응답을 이전에 저장된 공간 임펄스 응답들 중 적어도 하나와 비교하는 단계;상기 샘플 공간 임펄스 응답이 상기 저장된 공간 임펄스 응답들 중 하나와 매칭되는지 여부를 결정하는 단계;및 상기 매칭된 저장된 공간 임펄스 응답과 연관된 공간 특유 응답을 적용하는 단계를 포함하는, 방법."}
{"patent_id": "10-2018-0134754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "청구항 16에 있어서,상기 샘플 공간 임펄스 응답은 시간에 걸친 복수의 진폭들을 포함하는, 방법."}
{"patent_id": "10-2018-0134754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "청구항 17에 있어서,상기 샘플 공간 임펄스 응답이 상기 저장된 공간 임펄스 응답들 중 하나와 매칭되는지 여부를 결정하는 단계는상기 샘플 응답의 상기 진폭들의 미리 정의된 양이 상기 저장된 응답의 진폭들과 매칭되는지 여부를 결정하는단계를 포함하는, 방법."}
{"patent_id": "10-2018-0134754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "청구항 17에 있어서,상기 샘플 공간 임펄스 응답이 상기 저장된 공간 임펄스 응답들 중 하나와 매칭되는지 여부를 결정하는 단계는상기 샘플 응답의 상기 진폭들 중 다수가 상기 저장된 응답의 진폭들과 매칭되는지 여부를 결정하는 단계를 포함하는, 방법."}
{"patent_id": "10-2018-0134754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "청구항 16에 있어서,상기 공간 특유 응답은 상기 매칭된 저장된 공간 임펄스 응답에 기초한 마이크로폰에서의 상황 정보적인 가청출력 응답들을 포함하는, 방법."}
{"patent_id": "10-2018-0134754", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "개인 비서 디바이스의 위치를 결정하고 위치에 특유한 설정들을 적용하도록 구성된 개인 비서 디바이스는, 자극 잡음을 방출하도록 구성된 적어도 하나의 스피커, 자극 잡음에 기초하여 공간 샘플을 획득하도록 구성된 적어도 하나의 마이크로폰으로서, 공간 샘플은 샘플 공간 임펄스 응답을 포함하는, 적어도 하나의 마이크로폰, 및 복수 의 공간 프로파일들을 유지하도록 구성된 메모리로서, 각각의 공간 프로파일은 공간 위치, 저장된 공간 임펄스 응답, 및 공간 특유 응답을 포함하는, 메모리를 포함할 수 있다. 프로세서는, 공간 샘플을 수신하고, 샘플 공간 임펄스 응답을 저장된 공간 임펄스 응답들 중 적어도 하나의 비교하며, 샘플 공간 임펄스 응답이 저장된 공간 임 펄스 응답들 중 하나와 매칭되는지 여부를 결정하고, 매칭된 저장된 공간 임펄스 응답의 공간 프로파일과 연관된 공간 특유 응답을 적용하도록 구성될 수 있다. CPC특허분류 H04R 5/027 (2013.01)명 세 서 청구범위 청구항 1 개인 비서(personal assistant) 디바이스의 위치를 결정하고 상기 위치에 특유한 설정들을 적용하도록 구성된 개인 비서 디바이스로서, 자극 잡음을 방출하도록 구성된 적어도 하나의 스피커; 상기 자극 잡음에 기초하여 공간(room) 샘플을 획득하도록 구성된 적어도 하나의 마이크로폰으로서, 상기 공간 샘플은 샘플 공간 임펄스 응답을 포함하는, 상기 적어도 하나의 마이크로폰; 복수의 공간 프로파일들을 유지하도록 구성된 메모리로서, 각각의 공간 프로파일은 공간 위치, 저장된 공간 임 펄스 응답, 및 공간 특유 응답을 포함하는, 상기 메모리; 프로세서로서, 상기 공간 샘플을 수신하고; 상기 샘플 공간 임펄스 응답을 상기 저장된 공간 임펄스 응답들 중 적어도 하나와 비교하며; 상기 샘플 공간 임펄스 응답이 상기 저장된 공간 임펄스 응답들 중 하나와 매칭되는지 여부를 결정하고; 및 상기 매칭된 저장된 공간 임펄스 응답의 상기 공간 프로파일과 연관된 상기 공간 특유 응답을 적용하도록 구성 되는, 상기 프로세서를 포함하는, 디바이스. 청구항 2 청구항 1에 있어서, 상기 공간 샘플은 미리 결정된 양의 시간의 지수적 주파수 스윕(sweep)을 포함하는, 디바이스. 청구항 3 청구항 1에 있어서, 상기 샘플 공간 임펄스 응답은 시간에 걸친 복수의 진폭들을 포함하는, 디바이스. 청구항 4 청구항 3에 있어서, 상기 프로세서는, 상기 샘플 응답의 상기 진폭들의 미리 정의된 양이 상기 저장된 응답의 진폭들과 매칭되는 것 에 응답하여 상기 샘플 공간 임펄스 응답(room impulse response; RIR)이 상기 저장된 공간 임펄스 응답들 중 하나와 매칭된다는 것을 결정하도록 더 구성되는, 디바이스. 청구항 5 청구항 3에 있어서, 상기 프로세서는, 상기 샘플 응답의 상기 진폭들 중 다수가 상기 저장된 응답의 진폭들과 매칭되는 것에 응답하 여 상기 샘플 공간 임펄스 응답이 상기 저장된 공간 임펄스 응답들 중 하나와 매칭된다는 것을 결정하도록 더 구성되는, 디바이스. 청구항 6 청구항 1에 있어서, 상기 공간 특유 응답은 상기 매칭된 저장된 공간 임펄스 응답의 상기 공간 프로파일에 기초한 상기 마이크로폰 에서의 상황 정보적인 가청 출력 응답들을 포함하는, 디바이스. 청구항 7 청구항 1에 있어서, 상기 공간 특유 응답은 상기 매칭된 저장된 공간 임펄스 응답의 상기 공간 프로파일에 특유한 오디오 설정들을 포함하는, 디바이스. 청구항 8 개인 비서 디바이스의 위치를 결정하고 상기 위치에 특유한 설정들을 적용하도록 구성된 개인 비서 디바이스로 서, 자극 잡음을 방출하도록 구성된 적어도 하나의 스피커; 상기 자극 잡음에 기초하여 샘플 공간 속성을 포함하는 공간 샘플을 획득하도록 구성된 적어도 하나의 마이크로 폰; 복수의 공간 프로파일들을 유지하도록 구성된 메모리로서, 각각의 공간 프로파일은 공간 위치, 저장된 공간 속 성들, 및 공간 특유 응답을 포함하는, 상기 메모리; 프로세서로서, 상기 공간 샘플을 수신하고; 상기 샘플 공간 속성을 상기 저장된 공간 속성들 중 적어도 하나의 비교하며; 상기 샘플 공간 속성이 상기 저장된 공간 속성들 중 하나와 매칭되는지 여부를 결정하고; 및 상기 저장된 공간 속성의 상기 공간 프로파일과 연관된 상기 공간 특유 응답을 적용하도록 구성되는, 상기 프로 세서를 포함하는, 디바이스. 청구항 9 청구항 8에 있어서, 상기 공간 샘플은 미리 결정된 양의 시간의 지수적 주파수 스윕을 포함하는, 디바이스. 청구항 10 청구항 8에 있어서, 상기 샘플 공간 속성은 샘플 공간 임펄스 응답을 포함하는, 디바이스. 청구항 11 청구항 10에 있어서, 상기 샘플 공간 임펄스 응답은 시간에 걸친 복수의 진폭들을 포함하는, 디바이스. 청구항 12 청구항 11에 있어서, 상기 프로세서는, 상기 샘플 응답의 상기 진폭들의 미리 정의된 양이 상기 저장된 속성의 진폭들과 매칭되는 것 에 응답하여 상기 샘플 속성이 상기 저장된 속성들 중 하나와 매칭된다는 것을 결정하도록 더 구성되는, 디바이 스. 청구항 13 청구항 11에 있어서, 상기 프로세서는, 상기 샘플 응답의 상기 진폭들 중 다수가 상기 저장된 속성의 진폭들과 매칭되는 것에 응답하 여 상기 샘플 속성이 상기 저장된 속성들 중 하나와 매칭된다는 것을 결정하도록 더 구성되는, 디바이스.청구항 14 청구항 8에 있어서, 상기 공간 특유 응답은 상기 매칭된 저장된 속성의 상기 공간 프로파일에 기초한 상기 마이크로폰에서의 상황 정보적인 가청 출력 응답들을 포함하는, 디바이스. 청구항 15 청구항 8에 있어서, 상기 공간 특유 응답은 상기 매칭된 저장된 속성의 상기 공간 프로파일에 특유한 오디오 설정들을 포함하는, 디 바이스. 청구항 16 개인 비서 디바이스의 위치를 결정하고 상기 위치에 특유한 설정들을 적용하기 위한 방법으로서, 샘플 공간 임펄스 응답을 갖는 공간 샘플을 수신하는 단계; 상기 샘플 공간 임펄스 응답을 이전에 저장된 공간 임펄스 응답들 중 적어도 하나와 비교하는 단계; 상기 샘플 공간 임펄스 응답이 상기 저장된 공간 임펄스 응답들 중 하나와 매칭되는지 여부를 결정하는 단계; 및 상기 매칭된 저장된 공간 임펄스 응답과 연관된 공간 특유 응답을 적용하는 단계를 포함하는, 방법. 청구항 17 청구항 16에 있어서, 상기 샘플 공간 임펄스 응답은 시간에 걸친 복수의 진폭들을 포함하는, 방법. 청구항 18 청구항 17에 있어서, 상기 샘플 공간 임펄스 응답이 상기 저장된 공간 임펄스 응답들 중 하나와 매칭되는지 여부를 결정하는 단계는 상기 샘플 응답의 상기 진폭들의 미리 정의된 양이 상기 저장된 응답의 진폭들과 매칭되는지 여부를 결정하는 단계를 포함하는, 방법. 청구항 19 청구항 17에 있어서, 상기 샘플 공간 임펄스 응답이 상기 저장된 공간 임펄스 응답들 중 하나와 매칭되는지 여부를 결정하는 단계는 상기 샘플 응답의 상기 진폭들 중 다수가 상기 저장된 응답의 진폭들과 매칭되는지 여부를 결정하는 단계를 포 함하는, 방법. 청구항 20 청구항 16에 있어서, 상기 공간 특유 응답은 상기 매칭된 저장된 공간 임펄스 응답에 기초한 마이크로폰에서의 상황 정보적인 가청 출력 응답들을 포함하는, 방법. 발명의 설명"}
{"patent_id": "10-2018-0134754", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시의 측면들은 전반적으로 복수의 개별적인 단계들을 갖는 순차적인 활동들을 수행하는데 사용하기 위한 개인 비서(personal assistant)에 관한 것이다."}
{"patent_id": "10-2018-0134754", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "개인 비서 디바이스 및 음성 에이전트 디바이스가 점차 대중화되고 있다. 이러한 디바이스들은, 사용자 오디오 명령들에 응답하는 인공 지능을 구현하는 음성 제어형 개인 비서들을 포함할 수 있다. 음성 에이전트 디바이스 들의 일부 예들은 아마존 에코(Amazon Echo) 및 에코 닷(Echo Dot), 구글 엣 홈(Google At Home) 등을 포함할 수 있다. 이러한 음성 에이전트들은 이들의 프로세서들과의 메인 인터페이스로서 음성 명령들을 사용할 수 있다. 오디오 명령들은 디바이스 내의 하나 이상의 마이크로폰에서 수신될 수 있다. 그런 다음, 오디오 명령들 을 명령의 구현을 위하여 프로세서로 송신될 수 있다."}
{"patent_id": "10-2018-0134754", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "개인 비서 디바이스의 위치를 결정하고 위치에 특유한 설정들을 적용하도록 구성된 개인 비서 디바이스는, 자극 (stimulus)을 방출하도록 구성된 적어도 하나의 스피커, 자극에 기초하여 공간 샘플(room sample)을 획득하도록 구성된 적어도 하나의 마이크로폰으로서, 공간 샘플은 샘플 공간 임펄스 응답을 포함하는, 적어도 하나의 마이 크로폰, 및 복수의 공간 프로파일들을 유지하도록 구성된 메모리로서, 각각의 공간 프로파일은 공간 위치, 저장 된 공간 임펄스 응답, 및 공간 특유 응답을 포함하는, 메모리를 포함할 수 있다. 프로세서는, 공간 샘플을 수신 하고, 샘플 공간 임펄스 응답을 저장된 공간 임펄스 응답들 중 적어도 하나의 비교하며, 샘플 공간 임펄스 응답 이 저장된 공간 임펄스 응답들 중 하나와 매칭되는지 여부를 결정하고, 매칭된 저장된 공간 임펄스 응답의 공간 프로파일과 연관된 공간 특유 응답을 적용하도록 구성될 수 있다. 개인 비서 디바이스의 위치를 결정하고 위치에 특유한 설정들을 적용하도록 구성된 개인 비서 디바이스는, 자극 잡음을 방출하도록 구성된 적어도 하나의 스피커, 자극 잡음에 기초하며 샘플 공간 속성을 포함하는 공간 샘플 을 획득하도록 구성된 적어도 하나의 마이크로폰, 및 복수의 공간 프로파일들을 유지하도록 구성된 메모리로서, 각각의 공간 프로파일은 공간 위치, 저장된 공간 속성들, 및 공간 특유 응답을 포함하는, 메모리를 포함할 수 있다. 프로세서는, 공간 샘플을 수신하고, 샘플 공간 속성을 저장된 공간 속성들 중 적어도 하나의 비교하며, 샘플 공간 속성이 저장된 공간 속성들 중 하나와 매칭되는지 여부를 결정하고, 저장된 공간 속성의 공간 프로파 일과 연관된 공간 특유 응답을 적용하도록 구성될 수 있다. 개인 비서 디바이스의 위치를 결정하고 위치에 특유한 설정들을 적용하기 위한 방법은, 샘플 공간 임펄스 응답 을 갖는 공간 샘플을 수신하는 단계, 샘플 공간 임펄스 응답을 이전에 저장된 공간 임펄스 응답들 중 적어도 하 나와 비교하는 단계, 샘플 공간 임펄스 응답이 저장된 공간 임펄스 응답들 중 하나와 매칭되는지 여부를 결정하 는 단계, 및 매칭된 저장된 공간 임펄스 응답과 연관된 공간 특유 응답을 적용하는 단계를 포함할 수 있다."}
{"patent_id": "10-2018-0134754", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "필요한 정도로 본 발명의 상세한 실시예들이 본원에 개시되지만; 그러나, 개시된 실시예들은 단지 본 발명의 예 이며, 다양하고 대안적인 형태들로 구현될 수 있다는 것이 이해되어야만 한다. 도면들은 반드시 축적이 맞추어 지지는 않으며; 특정 컴포넌트들의 세부사항들을 도시하기 위하여 일부 특징들이 과장되거나 또는 축소될 수 있 다. 따라서, 본원에서 개시되는 특정한 구조적 및 기능적 세부사항들은 제한적으로 해석되지 않아야 하며, 단지 본 발명을 다양하게 이용하는 것을 당업자에게 교시하기 위한 대표적인 기반으로서 해석되어야 한다. 개인 비서 디바이스들은, 사용자 오디오 명령들에 응답하는 인공 지능을 구현하는 음성 제어형 개인 비서들을 포함할 수 있다. 음성 에이전트 디바이스들의 일부 예들은 아마존 에코(Amazon Echo) 및 에코 닷(Echo Dot), 구 글 엣 홈(Google At Home) 등을 포함할 수 있다. 이러한 음성 에이전트들은 이들의 프로세서들과의 메인 인터페 이스로서 음성 명령들을 사용할 수 있다. 오디오 명령들은 디바이스 내의 마이크로폰에서 수신될 수 있다. 그런 다음, 오디오 명령들을 명령의 구현을 위하여 프로세서로 송신될 수 있다. 일부 예들에 있어서, 오디오 명령들 은 아마존 에코 및 닷, 구글 엣 홈, 등에 의해 사용되는 것들과 같은 클라우드 기반 프로세서로 외부로 송신될 수도 있다. 흔히, 이러한 개인 비서 디바이스들은 휴대용이며, 주택 내에서 하나의 공간으로부터 다른 공간으로 이동될 수 있다. 개인 비서 디바이스의 위치는 가치가 있는 상황 정보(context)를 제공할 수 있으며, 디바이스가 그것이 제공하는 정보를 더 양호하게 조정하는 것을 가능하게 할 수 있다. 예를 들어, 개인의 음악 선호성이 디바이스 가 침실 또는 홈 짐(home gym)에 위치되어 있는지 여부에 기초하여 변화할 수 있다. 추가적으로, 사용자에 의해 수신되는 명령들은 디바이스의 위치에 기초하여 개인 비서 디바이스에 의해 상이하게 해석될 수 있다. 디바이스 가 뒤쪽 파티오(back patio) 상에 있을 때 \"피자 먹자\"는 \"피자를 주문하자\"로 해석될 수 있다. 반면 디바이스 가 부엌에 있는 동안 동일한 명령은 \"피자를 만들자, 레피시를 불러줘\"로서 해석될 수 있다. 이러한 위치 기반 정보 및 서비스들은 사용자에게 더 양호한 사용자 경험을 제공할 수 있다. 마이크로폰에서 획득된 공간 샘플에 기초하여 개인 비서 디바이스의 위치 또는 공간을 결정하도록 구성된 시스 템에 본원에서 설명된다. 공간 샘플은 알려진 공간 응답들과 비교할 수 있는 공간 응답들 및 속성들을 포함한다. 공간 응답이 알려진 응답과 매칭되는 경우, 디바이스는 알려진 응답과 연관된 공간에 기초하여 그것 의 위치를 인식할 수 있다. 디바이스는 알려진 응답을 가지고 동일한 카테고리로 분류될 수 있다. 이러한 상대 적으로 한결 같고 번거롭지 않은 방법은, 디바이스가 주택 전체에 걸쳐 이동되는 것을 가능하게 하고 상황 정보 기반 설정들이 위치에 기반하여 적용되는 것을 가능하게 한다. 카메라들을 사용하여 공간 위치를 결정하는 방법 들과는 대조적으로, 본원에서 개시되는 시스템은 덜 거슬리고, 더 많은 프라이버시를 가능하게 하며, 더 작은 데이터 크기에 기인하여 연산하기에 더 용이하다. 추가로, 공간을 식별하기 위하여 공간 응답을 사용함으로써, 가시선 제약들이 존재하지 않는다. 도 1은 예시적인 지능형 개인 비서 디바이스를 포함하는 시스템을 예시한다. 개인 비서 디바이스 는 마이크로폰 또는 다른 오디오 입력부를 통해 오디오를 수신하고, 아날로그 디지털(A/D) 컨버터 를 통해 오디오 프로세서에 의해 식별되도록 또는 달리 프로세싱되도록 오디오를 전달한다. 오디오 프로세서는 또한, 하나 이상의 라우드스피커(loudspeaker)들에 의한 재생을 위하여 디지털 아날로그 (D/A) 컨버터 및 증폭기를 통해 전달될 수 있는 스피치(speech) 또는 다른 오디오 출력을 생성한다. 개인 비서 디바이스는 또한 오디오 프로세서에 연결되며 다양한 공간 프로파일들을 관리하도록 구성된 제어기를 포함한다. 제어기는 또한 통신 네트워크와의 개인 비서 디바이스의 통신을 가능하게 하기 위하여 무선 트 랜시버(transceiver)와 인터페이스한다. 다수의 예들에 있어서, 제어기는 또한 사용자 입력을 수신하 기 위한 하나 이상의 인간 기계 인터페이스(Human Machine Interface; HMI) 제어부들뿐만 아니라 시각적 출력을 제공하기 위한 디스플레이 스크린에 연결된다. 예시된 시스템이 단지 예일 뿐이며, 더 많은, 더 적은, 및/또는 상이하게 위치된 엘리먼트들이 사용될 수 있다는 것을 주의해야만 한다. A/D 컨버터는 마이크로폰으로부터 오디오 입력 신호들을 수신한다. A/D 컨버터는 오디오 프로세 서에 의해 추가적인 프로세싱을 위하여 수신된 신호들을 아날로그 포맷으로부터 디지털 포맷의 디지털 신 호로 변환한다. 단지 하나가 도시되었지만, 하나 이상의 오디오 프로세서들이 개인 비서 디바이스 내에 포함될 수 있 다. 오디오 프로세서들은, 컴퓨터 프로세서, 마이크로프로세서, 디지털 신호 프로세서, 또는 논리적인 연 산들을 수행할 수 있는 임의의 다른 디바이스, 일련의 디바이스들 또는 다른 메커니즘들과 같은 오디오 및/또는 비디오 신호들을 프로세싱할 수 있는 하나 이상의 컴퓨팅 디바이스들일 수 있다. 오디오 프로세서들은 메모리에 저장된 명령어들을 실행하기 위하여 메모리와 함께 동작할 수 있다. 명령어들은 소프트웨어, 펌웨어, 컴퓨터 코드, 또는 이들의 어떤 조합의 형태일 수 있으며, 오디오 프로세서에 의해 실행될 때 개 인 비서 디바이스의 오디오 인식 및 오디오 생성 기능을 제공할 수 있다. 명령어들은 추가적으로 수신된 오디오의 인식/분류 프로세싱 이전에 오디오 클린업(cleanup)(예를 들어, 잡음 감소, 필터링 등)을 제공할 수 있다. 메모리는, 휘발성 메모리, 비-휘발성 메모리, 전자 메모리, 자기 메모리, 광학 메모리, 또는 데이터 저장 디바이스의 임의의 다른 형태와 같은 하나 이상의 데이터 저장 디바이스들의 임의의 형태일 수 있다. 명령 어들에 더하여, 텍스트 데이터로부터의 스피치의 생성을 위한 발음 어휘(phonetic vocabulary)와 같은 동작 파 라미터들 및 데이터가 또한 메모리에 저장될 수 있다. D/A 컨버터는 오디오 프로세서로부터 디지털 출력 신호를 수신하고, 이를 디지털 포맷으로부터 아날 로그 포맷의 출력 신호로 변환한다. 그런 다음, 출력 신호들은 추가적인 프로세싱을 위하여 증폭기 또는 다른 아날로그 컴포넌트들에 의한 사용을 위하여 이용가능하게 만들어질 수 있다. 증폭기는, 상대적으로 작은 크기의 오디오 입력 신호들을 수신하고 상대적으로 큰 크기의 유사한 오디오 신호들을 출력하는 임의의 회로 또는 독립형 디바이스일 수 있다. 오디오 입력 신호들은 증폭기에 의해 수 신될 수 있으며, 하나 이상의 라우드스피커들에 대한 하나 이상의 연결들 상에 출력될 수 있다. 오디오 신 호들의 진폭의 증폭에 더하여, 증폭기는, 라우드스피커들로 제공되기 위한 준비 단계에서 위상을 시 프트(shift)하거나, 주파수 등화(frequency equalization)를 조정하거나, 지연을 조정하거나 또는 오디오 신호 들의 임의의 다른 형태의 조작 또는 조정을 수행하기 위한 신호 프로세싱 성능을 포함할 수 있다. 예를 들어, 라우드스피커들은, 디바이스가 디스플레이 스크린을 갖지 않거나 또는 사용자가 디바이스를 보 는 것을 수반하지 않는 상호작용을 희망할 때, 명령의 주된 매체일 수 있다. 신호 프로세싱 기능은 추가적으로 또는 대안적으로 오디오 프로세서의 영역 내에서 나타날 수 있다. 또한, 증폭기는 라우드스피커들 로 제공되는 오디오 신호들의 볼륨, 밸런스 및/또는 페이드(fade)를 조정하기 위한 성능을 포함할 수 있다. 제어기는 공간 프로파일에 기초하여 라우드스피커들로 제공되는 이러한 오디오 신호들을 조정할 수 있다. 대안적인 예에 있어서, 예컨대, 라우드스피커들이 헤드폰들의 세트의 형태일 때, 또는 오디오 출력 채널들 이 다른 오디오 디바이스, 예컨대 오디오 저장 디바이스 또는 추가적인 오디오 프로세서 디바이스에 대한 입력 들로서 역할 할 때, 증폭기가 생략될 수도 있다. 또 다른 예들에 있어서, 라우드스피커들이 증폭기 를 포함할 수 있으며, 그 결과 라우드스피커들은 자체-출력형(self-powered)이다. 라우드스피커들은 다양한 크기들일 수 있으며, 다양한 주파수 범위들에 걸쳐 동작할 수 있다. 라우드스피 커들의 각각은 단일 트랜스듀서(transducer)를 포함할 수 있거나, 또는 다른 경우들에 있어서 다수의 트랜 스듀서들을 포함할 수 있다. 라우드스피커들은 또한 서브우퍼, 우퍼, 중간 음역 및 트위터(tweeter)와 같 은 상이한 주파수 범위들에서 동작될 수도 있다. 다수의 라우드스피커들이 개인 비서 디바이스 내에 포함될 수 있다. 제어기는 본원에서 설명되는 개인 비서 디바이스의 기능들의 수행을 지원하는 다양한 유형들의 컴퓨 팅 장치를 포함할 수 있다. 일 예에 있어서, 제어기는 컴퓨터 명령어들을 실행하도록 구성된 하나 이상의 프로세서들, 및 컴퓨터-실행가능 명령어들 및/또는 데이터가 유지될 수 있는 저장 매체(또는 저장부 )를 포함할 수 있다. 컴퓨터-판독가능 저장 매체(프로세서-판독가능 매체 또는 저장부로도 지칭됨)는, 컴퓨터에 의해(예를 들어, 프로세서(들)에 의해) 판독될 수 있는 데이터(예를 들어, 명령어 들)를 제공하는데 참여하는 임의의 비-일시적인(예를 들어, 유형적인) 매체를 포함한다. 일반적으로, 프로세서 는, 예를 들어, 저장부 등으로부터 메모리로 명령어들 및/또는 데이터를 수신하고, 데이터를 사용하 여 명령어들을 실행하여 본원에서 설명되는 프로세스들 중 하나 이상을 포함하는 하나 이상의 프로세스들을 수 행한다. 컴퓨터-실행가능 명령어들은, 비제한적으로 그리고 독립적으로 또는 조합으로, 자바, C, C++, C#, 어셈 블리, 포트란, 파스칼, 비주얼 베이직, 파이썬, 자바 스크립트, 펄, PL/SQL, 등을 포함하는 다양한 프로그래밍 언어들 및/또는 기술들을 사용하여 생성된 컴퓨터 프로그램들로부터 컴파일링(compile)되거나 또는 번역될 수 있다. 도시된 바와 같이, 제어기는 통신 네트워크를 통해 제어기와 다른 네트워크로 연결된 디바이스 들 사이의 통신을 가능하게 하도록 구성된 무선 트랜시버 또는 다른 네트워크 하드웨어를 포함할 수 있다. 하나의 가능성으로서, 무선 트랜시버는 셀룰러 전화 네트워크를 통해 데이터를 통신하도록 구성된 셀룰러 네트워크 트랜시버일 수 있다. 다른 가능성으로서, 무선 트랜시버는 통신 네트워크를 액세스하기 위하여 근거리 무선 네트워크에 접속하도록 구성된 Wi-Fi 트랜시버일 수 있다. 제어기는 개인 비서 디바이스와의 사용자 상호작용을 제공하기 위하여 인간 기계 인터페이스(HMI) 제 어부들로부터 입력을 수신할 수 있다. 예를 들어, 제어기는 제어기의 기능들을 호출하도록 구성 된 하나 이상의 버튼들 또는 다른 HMI 제어부들과 상호작용할 수 있다. 제어기는 또한, 예를 들어, 비디오 제어기를 이용하여 사용자들에게 시각적 출력을 제공하도록 구성된 하나 이상의 디스플레이들을 드 라이브하거나 또는 달리 이와 통신할 수 있다. 일부 경우들에 있어서, 디스플레이(본원에서 디스플레이 스 크린으로도 지칭됨)는 비디오 제어기를 통해 사용자 터치 입력을 수신하도록 추가로 구성된 터치 스크린일 수도 있으며, 반면 다른 경우들에 있어서, 디스플레이는 터치 입력 성능이 없는 단순한 디스플레이일 수도 있다. 공간 프로파일들은 가상(virtual) 비서가 위치될 수 있는 복수의 위치들을 포함한다. 예를 들어, 공간 프 로파일들은, 부엌, 침실, 사무실, 홈 짐, 옥외 공간, 거실 등을 포함하는 주택의 공간의 각각에 대한 프로 파일을 포함할 수 있다. 각각의 공간은, 디바이스가 그 위치에 위치될 때 오디오 신호에 적용되는 특정한 오디오 설정들과 연관될 수 있다. 즉, 오디오 설정들이 각각의 공간에 대하여 특유할 수 있다. 예를 들어, 옥외 공간과 연관된 시작 음악 장르 및 볼륨은 댁내 사무실과 연관된 것보다 더 시끄러울 수 있다. 등화, 필터링, 등 과 같은 다른 오디오 프로세싱 속성들이 그 위치에 대한 공간 프로파일 내에서 정의되고 각각의 공간에 대하여 특유할 수 있다. 디바이스는 모조 부엌 또는 거실과 같은 다양한 기본 공간 응답들을 탑재할 수 있다. 사용자가 그의 또는 그녀의 집에서 디바이스를 개시할 때, 디바이스는 대략적으로 공간을 침실, 부엌, 거실 등으로 분류 할 수 있다. 디바이스는 트레이닝 모드로 동작할 수 있으며, 공간 응답들, 수신된 오디오 명령들로부터 공 간에 대하여 더 많은 것을 천천히 학습할 수 있다. 추가적으로 또는 대안적으로, 사용자는 \"여기는 내 거실이야\"라고 말함으로써 공간을 분류할 수 있다. 각각의 공간은 개인 비서 디바이스의 마이크로폰으로부터 수집된 공간 샘플에 의해 식별될 수 있다. 공간 샘플은 디바이스의 기동 시에 수집될 수 있다. 자극 잡음이 라우드스피커로부터 방출될 수 있으며, 그 후에 공간 샘플이 기록될 수 있다. 공간 샘플은 대략 20초의 기록된 오디오 신호를 포함할 수 있으며, 프로 세서로 송신될 수 있다. 공간 샘플은 20Hz로부터 20kHz까지의 지수적 주파수 스윕(logarithmic frequency sweep), 광대역 랜덤 잡음 자극, 및/또는 합성된 음악일 수 있다. 일 예에 있어서, 공간 샘플은 고유 공간 임펄스 응답(room impulse response; RIR)을 포함할 수 있다. 이러한 응답들은 각각의 공간에 대하여 고유할 수 있으며, 따라서 디바이스가 다양한 위치들 사이에서 이동될 때 공간 을 식별하기 위하여 사용될 수 있다. RIR들은 진폭 포락선(즉, 시간에 걸친 진폭)을 포함할 수 있다. 공간의 RIR는 공간 내의 디바이스의 정확한 위치에 따라 약간 변화할 수 있다. 그러나, 2개의 상이한 공간들의 RIR은 극적으로 변화할 수 있다. 이 때문에, 공간 샘플에 의해 획득된 RIR은 디바이스의 위치 또는 공간을 분류하거나 또는 식별하기 위하여 사용될 수 있다. 예를 들어, 공간 샘플의 샘플 RIR은 저장된 RIR들과 비교될 수 있다. 특정한 수의 샘플 응답의 진폭들이 알려진 공간과 연관된 저장된 응답의 진폭들 정렬되거나 또는 매칭 되는 경우, 공간이 저장된 응답에 기초하여 식별될 수 있다. 이는 본원에서 더 상세하게 논의된다. 다른 예들에 있어서, 공간 샘플은, 사용자가 디바이스가 어떤 공간에 위치되어 있는지를 언급하는 경우의, 예를 들어, \"부엌에\"라고 언급하는 경우의 공간의 명시적인 신원을 포함할 수 있다. 다른 예에 있어서, 공간 샘 플은 공간 크기를 결정할 뿐만 아니라, 전형적으로 공간과 연관된 주변 잡음, 예컨대, 물이 흐르는 소리, 사무 실에서의 타이핑, 침실에서의 코골기, 또는 냉장고가 작동되는 소리를 식별하기 위하여 분석될 수 있다. 또한, 다수의 스피커들이 다수의 RIR들의 마이크-스피커 쌍들을 형성할 수 있는 상태로 증강된 데이터세트/입력 샘플 다중 마이크로폰들을 갖는 것이 가능하다. 이러한 RIR들의 각각은 프로세서에서 앙상블 분류 시스템 내로 공급될 수 있으며, 여기에서 각각의 분류기는 디바이스가 어떠한 공간에 있는지에 대한 표 (vote)를 획득한다. 최종 결정은 일반적으로 이러한 개별적인 표들의 가중된 결과이다. 대안적으로, 입력 샘플 공간 차원(space dimension)이 N으로부터 N*M으로 증가될 수 있으며, 여기에서 N은 단일 RIR 내의 포인트들의 수(즉, 단일 RIR의 차원수(dimensionality))이고 M은 마이크-스피커 쌍들의 수이다. 그런 다음 N*M-D 입력 공간 에 대하여 분류기가 작용한다. 이는, 이러한 디바이스들이 보통 다수의 마이크로폰들 및 스피커들(트위터, 서브우퍼, 스테레오 채널들)을 갖기 때문에 가능하다. 도 2는 복수의 공간들을 포함하는 예시적인 주택을 예시한다. 공간들은, 예를 들어, 침실(202- 1), 댁내 사무실(202-2), 부엌(202-3), 거실(202-4), 옥외 공간 또는 파티오(202-5)를 포함할 수 있다. 다양한 다른 공간들 및 위치들이 이해될 수 있고 포함될 수 있다. 예를 들어, 홈 짐, 지하실 등이 또한 주택 내에 포함될 수 있다. 개인 비서 디바이스는 주택 전체에 걸쳐 하나의 공간으로부터 다른 공간으로 이동될 수 있다. 도 2에 도시된 예에 있어서, 디바이스는 댁내 사무실(202-2) 내에 위치된다. 이상에서 설명된 바와 같이, 각각의 공간은 공간 프로파일과 연관될 수 있다. 각각의 공간은 고유 RIR을 가질 수 있다. RIR는 공간 의 레이아웃, 크기, 창문들의 수, 천장의 높이, 특정 공간 내에 전형적으로 존재하는 다양한 배경 잡음들 등에 의해 영향을 받을 수 있다. 프로세서는 마이크로폰에 의해 획득된 공간 샘플을 분석함으로써 RIR를 도출할 수 있다. 도 3은 공간 프로파일들의 예시적인 차트를 예시한다. 각각의 공간은 그와 연관된 하나 이상의 분류 메커니즘(또는 속성들)을 가질 수 있다. 예를 들어, 하나의 분류 메커니즘은 그 공간에 특 유한 저장된 RIR을 포함할 수 있다. 분류 메커니즘들은 또한 저장된 주변 잡음, 저장된 공간 크 기, 및 저장된 사용자에 의한 공간의 표현 신원(express identification)을 포함할 수 있다. 이러한 분류 메커니즘들의 각각이 디바이스의 현재 위치를 식별하기 위하여 사용될 수 있다. 개인 비서 디바이스의 개시 또는 전원 인가 시에, 라우드스피커가 자극 잡음을 방출할 수 있다. 자극 잡음 은 짧은 고주파수 처프(chirp) 또는 다른 핑(ping)일 수 있다. 그 후에 마이크로폰이 오디오 응답을 캡처 (즉, 공간 샘플을 캡처)할 수 있다. 공간 샘플은 특정한 양의 시간에 걸친 주변 잡음을 포함할 수 있다. 예를 들어, 공간 샘플은 개시 또는 기동 이후 20 초 동안의 주변 잡음을 기록할 수 있다. 주변 잡음은 공간을 분류하 기 위하여 프로세서에 의해 사용될 수 있다. 프로세서는 분류 메커니즘들 중 하나 이상에 기초 하여 공간을 분류할 수 있다. 예를 들어, 프로세서는 공간 샘플의 RIR을 공간 프로파일들 중 하나의 유사한 RIR와 매칭시킬 수 있다. RIR을 정렬함으로써, 프로세서는 디바이스가 그 공간에 있을 가능성 이 가장 크다는 것을 결정하고 이어서 공간 특유 응답을 적용할 수 있다. 주변 잡음은 연속적으로 또는 주 기적으로 수집될 수 있다. 공간 특유 응답은, 오디오 설정들, 조명 응답들, 및 상황 정보 오디오 출력 응답들과 같은 디바이스의 위치에 따라 상이한 상황 정보를 가질 수 있는 다양한 응답들을 포함할 수 있다. 오디오 설정 들은 음악의 선호 장르, 시작 볼륨 등과 같은 음악 변수들을 포함할 수 있다. 오디오 설정들은 또한 공간에 특유한 잡음 감소 및 압축 설정들을 포함할 수 있다. 이상에서 설명된 바와 같이, 댁내 사무실(202-2)에 서 음악의 하나의 장르가 선호되고 전형적으로 플레이될 수 있으며, 반면 부엌(202-3)에서는 다른 장르가 선호 될 수 있다. 특유 조명 응답들이 또한 각각의 공간과 연관될 수 있다. 사용자들은 공간 내의 조명들에게 턴 오프, 턴 온, 디밍(dim) 등을 명령할 수 있다. 이러한 명령들의 수신 시에, 개인 비서 디바이스는 수신된 명령들 을 수행하기 위하여 명령들을 다양한 조명들로 송신할 수 있다. 이러한 조명 응답들은, 개인 비서가 위치 된 공간 내의 조명들을 조정하는 것으로 한정될 수 있다. 예를 들어, 개인 비서 디바이스가 댁내 사무실 (202-2) 내에 있다고 결정되는 동안, 사용자로부터 수신되는 임의의 조명 명령들은 오로지 댁내 사무실(202-2) 내의 조명들에만 기인할 수 있다. 개인 비서 디바이스는 사용자로부터 다른 명령들을 수신할 수 있으며, 특정 공간에 기초하여 상황 정보적 인 오디오 출력 응답들을 제공할 수 있다. 예를 들어, 사용자는 \"피자 먹자\"라고 말할 수 있다. 이러한 예 시적인 명령에 대한 공간 특유 응답들은 개인 비서 디바이스가 위치된 공간에 따라 변화할 수 있다. 예를 들어, 부엌에서, 개인 비서 디바이스는 이러한 명령을 사용자가 피자를 만들기를 원하는 것이라고 해 석할 수 있다. 결과적으로 디바이스는 피자에 대한 레시피를 구술함으로써 응답할 수 있다. 반면, 디바이 스가 파티오(202-5) 상에 위치된 경우, 디바이스는 사용자가 피자를 주문할 수 있게 함으로써 응답을 제공할 수 있다. 예를 들어, 디바이스는 지역 피자 배달 레스토랑에 대한 전화 번호를 방출할 수 있다. 도 4는 다양한 공간들에 대한 예시적인 RIR들의 예시적인 차트를 예시한다. 차트에 의해 명확한 바와 같이, RIR들은 공간마다 변화하며, 각각의 공간은 다양한 진폭들에서 고유 응답을 갖는다. 측정들은 각기 2-피 트 직경의 원 내에서 약간 상이한 위치들에서 이루어질 수 있다. 예를 들어, 부엌 측정들 1, 2, 3은 모두 서로 의 2 피트 내에 존재한다. 마이크로폰에 의해 획득된 공간 샘플에 기초하여, 프로세서는 수신된 공간 샘플 에 기초하여 공간을 식별할 수 있다. 예를 들어, 공간 샘플의 샘플 RIR의 진폭들이 저장된 RIR들의 진폭들과 비 교될 수 있다. 특정한 수의 샘플 응답의 진폭들이 알려진 공간과 연관된 저장된 응답의 것과 정렬되거나 또는매칭되는 경우, 공간이 저장된 응답에 기초하여 식별될 수 있다. 일 예에 있어서, 매칭되지 않는 것보다 더 많 은 샘플 응답 및 저장된 응답의 진폭들이 매칭되는 경우(즉, 진폭들 중 다수가 매칭되는 경우), 프로세서 는, 응답들이 유사하다는 것을 결정할 수 있으며 따라서 공간을 공간 프로파일에 기초하여 저장된 응답에 할당된 공간으로서 그 공간을 분류할 수 있다. 다른 예에 있어서, 임펄스 응답들과 매칭되기 위하여 요구되는 샘플들의 미리 정의된 수는 유한한 수, 예컨대 10일 수 있다. 또 다른 예에 있어서, 공간은, 샘플 응답과 최대 진폭 매칭들을 갖는 저장된 응답에 기초하여 분류될 수 있다. 추가로, 원시(raw) 측정된 RIR의 상이한 주파수들에서 진폭들을 사용하는 간단한 k-최인접 이웃 분류 알고리즘 (k-nearest neighbor classification algorithm)이 사용될 수 있다. 이러한 예에 있어서, 새로운 측정 RIR과 그것의 최인접 이웃 사이의 유클리드 거리가 RIR이 대응하는 공간 라벨을 결정하기 위하여 사용될 수 있다. 추 가로, 프로세서는 오로지 분류를 위하여 관련이 있는 것으로 여겨지는 주파수들만을, 즉, 공간들 사이에서 는 변화하지만 공간들 내에서는 크게 변화하지 않는 주파수들만을 사용할 수도 있다. 프로세서는 1kHz보다 더 높은 주파수들을 배제할 수 있으며, 이는 이러한 영역에서 응답이 상당히 작은 변화들을 가지고 변화할 수 있기 때문이다. 다양한 저장된 RIR들의 진폭들을 정렬하는 것에 더하여, 프로세서는 또한 디바이스의 위치를 분류하 기 위하여 K-평균 클러스터링(K-means clustering)과 같은 클러스터링 알고리즘들뿐만 아니라 서포트 벡터 머신 (Support Vector Machine; SVM)들, 신경망들 등과 같은 고급 기계 학습 알고리즘들을 구현할 수 있다. 특히, RIR들은 디바이스의 배치에 따라 공간 주위에서 변화할 수 있다. 예를 들어, 디바이스는 공간 의 중심뿐만 아니라 벽 근처에도 위치될 수 있다. RIR 매칭 알고리즘들은 RIR를 저장된 응답과 연관시키기 위하여 위치 둔감성(insensitive)일 수 있다. 공간 크기 및 주변 잡음과 같은 추가적인 메커니즘들의 사용이 RIR를 분류하는 것을 도울 수 있다. 프로세서는 동일한 공간 내의 상이한 위치에 대하여 동일한 라 벨을 찾기 위하여 학습할 수 있다. 프로세서는 심층 신경망(Deep Neural Network; DNN)들을 사용할 수 있 으며, 공간 크기는 DNN이 공간 크기를 학습할 것으로 예상되기 때문에 덜 중요할 수 있다. 다수의 저장된 응답들이 단일 공간과 연관될 수 있으며, 따라서 각각이 그 공간에 대한 상이한 위치들을 캡처할 수 있다. 공간 크기는, 공간 둘레의 벽들에 대응하며 공간의 크기와 연관되는 공간 내의 이산적인 에코(echo)들에 의해 결정될 수 있다. 공간 크기가 고려된 이후에, 반향 테일(reverberant tail)의 지속기간이 공간의 음 향적 반사율 및 평활도의 표시를 제공할 수 있다(예를 들어, 가구를 갖는 혼잡한 공간은 공간 내에 가구가 없는 경우보다 더 짧은 반향 테일을 가질 것이다. 유사하게, 단단한 목재로 만들어진 공간은 그것의 바닥 및 벽들이 카펫 및 커튼으로 덧대진 공간보다 더 긴 테일을 가질 것이다.) 도 5는 분류 메커니즘 및 공간 프로파일들을 사용하여 분류하거나 또는 식별하기 위한 개인 비서 디 바이스에 대한 예시적인 프로세스를 예시한다. 프로세스는 블록에서 시작한다. 블록에서, 프로세서는 마이크로폰으로부터 공간 샘플 을 수신한다. 이상에서 설명된 바와 같이, 공간 샘플은 디바이스의 전원 인가 시에 마이크로폰에 의 해 캡처되는 오디오 신호일 수 있다. 마이크로폰은 미리 결정된 양의 시간 동안 공간 샘플을 캡처할 수 있 다. 일 예에 있어서, 미리 결정된 양의 시간은 대략 3 초일 수 있다. 프로세서는 마이크로폰으로부터 공간 샘플을 수신할 수 있다. 블록에서, 프로세서는 수신된 공간 샘플에 기초하여 공간을 식별할 수 있다. 도 3과 관련하여 이상에 서 설명된 바와 같은 몇몇 속성들 또는 분류 메커니즘들이 공간을 식별하기 위하여 사용될 수 있다. 이러 한 속성들은 이하에서 블록들(510, 520, 530, 및 540)과 관련하여 더 상세하게 설명된다. 전반적으로, 프 로세서는 마이크로폰으로부터 공간 샘플을 통해 수신된 샘플 속성들을 저장된 속성들과 비교할 수 있 다. 샘플 속성들과 저장된 속성들 중 하나가 매칭될 때, 프로세서는 매칭된 속성들과 연관된 공간 프로파 일 및 연관된 공간 특유 응답들을 적용할 수 있다. 블록 내에서, 프로세서는, 블록에서, 공간 샘플이 공간의 표현 신원을 포함하는지 여부를 결정 할 수 있다. 표현 신원은 사용자가 말한 공간의 명칭을 포함할 수 있다. 예를 들어, 기동 시에, 사용자는 \"부엌 에\" 또는 \"사무실\"이라고 말할 수 있다. 프로세서는 이러한 사용자에 의한 표현 신원을 주택 내의 공간 또 는 위치의 전형적인 명칭으로서 인식할 수 있다. 프로세서가 표현 신원을 인식하는 경우, 프로세스는 블록으로 진행한다. 그렇지 않은 경우, 프로세스는 블록으로 진행한다. 블록에서, 프로세서는 표현 신원이 차트 내의 공간 프로파일들 내의 저장된 신원들 중 하 나와 매칭되는지 여부를 결정할 수 있다. 예를 들어, 프로세서는 명령 \"부엌\"을 인식할 때 부엌(202-3)에 대한 공간 프로파일을 인식하고 식별할 수 있다. 반면, 표현 신원이 \"지하실\"과 같은 구절 또는 명칭을 포함하 는 경우, 이러한 표현 신원이 저장된 신원들 중 하나와 매칭되지 않기 때문에 프로세서는 공간 프로파일을 인식하지 못할 수 있다. 프로세서가 표현 신원과 공간 프로파일들 내의 공간의 신원과 매칭시키거나 또는 인식하는 경우, 프로세스는 블록으로 진행한다. 그렇지 않은 경우, 프로세스는 블록 으로 진행한다. 블록에서, 프로세서는, 표현 신원과 공간 프로파일들 중 하나의 저장된 신원과의 매칭에 응답하 여, 이러한 공간 프로파일에 기초하여 공간을 식별하거나 또는 분류할 수 있다. 블록에서, 프로세서는 매칭된 공간 프로파일과 연관된 공간 특유 응답들을 적용할 수 있다. 따라서, 이상의 예에 있어서, 부엌과 연관된 공간 응답들이 상황 정보적인 공간-특유 정보 및 응답 들을 제공하기 위하여 적용될 수 있다. 블록에서, 프로세서는 공간 샘플의 RIR를 분석할 수 있다. 이는 공간 샘플의 지수적 스윕의 특정 진 폭들을 결정하는 것을 포함할 수 있다. 블록에서, 프로세서는 공간 샘플의 RIR가 공간 프로파일들의 저장된 RIR와 매칭되는지 여부를 결정할 수 있다. 이상에서 설명된 바와 같이, 이는 샘플 RIR과 저장된 RIR의 진폭들에 기초할 수 있다. 샘플 RIR이 저장된 RIR들 중 하나와 매칭되는 경우, 프로세스는 블록으로 진행한다. 그렇지 않은 경우, 프 로세스는 블록으로 진행한다. 블록에서, 프로세서는, RIR와 공간 프로파일들의 저장된 RIR의 매칭에 응답하여, 저장된 RIR의 공간 프로파일에 기초하여 공간을 식별할 수 있다. 블록에서, 프로세서는 주변 잡음들로부터 공간 샘플을 분석할 수 있다. 설명된 바와 같이, 냉장고가 작동되는 소리, 물이 흐르는 소리와 같은 특정한 주변 잡음들이 식별될 수 있다. 프로세서가 공간 샘플이 인식이 가능한 주변 잡음들을 포함한다고 결정하는 경우, 프로세스는 블록으로 진행한다. 그렇지 않 은 경우, 프로세스는 블록으로 진행한다. 블록에서, 프로세서는 공간 프로파일들 중 임의의 공간 프로파일이 이러한 주변 잡음들을 포함하거나 또는 이와 연관되는지 여부를 결정할 수 있다. 예를 들어, 프로세서는 공간 샘플이 냉장고가 작동되는 소 리와 유사한 잡음을 포함한다는 것을 결정할 수 있다. 따라서, 주변 잡음은 부엌(202-3)과 연관될 수 있다. 프 로세서가 식별된 주변 잡음을 공간 프로파일 중 하나와 매칭시키는 경우, 프로세스는 블록(53 4)으로 진행한다. 그렇지 않은 경우, 프로세스는 블록으로 진행한다. 블록에서, 프로세서는, 주변 잡음과 저장된 주변 잡음의 매칭에 응답하여, 매칭된 주변 잡음의 공간 프로파일에 기초하여 공간을 식별할 수 있다. 블록에서, 프로세서는 공간 샘플에 기초하여 공간의 크기를 결정할 수 있다. 이상에서 설명된 바와 같이, 공간의 크기는 초기 반사들의 타이밍으로부터 추론될 수 있다. 반사들이 더 빠를 수록, 공간이 더 작다. 블록에서, 프로세서는 공간 크기가 저장된 공간 크기와 매칭되는지 여부를 결정할 수 있다. 그런 경 우, 프로세스는 블록으로 진행한다. 그렇지 않은 경우, 프로세스는 블록으로 진행한다. 블록에서, 프로세서는, 공간 크기와 저장된 공간 크기의 매칭에 응답하여, 매칭된 공간 크기의 공간 프로파일에 기초하여 공간을 식별할 수 있다. 블록에서, 프로세서는, 공간 샘플에 기초하여 공간을 식별하는 것을 실패하는 것에 응답하여, 공간 샘플에 기초하여 새로운 공간 프로파일을 생성할 수 있다. 즉, 새로운 공간이 생성될 수 있으며, 공간 응 답들은 공간 샘플에 의해 획득되는 것들일 수 있다. 블록, 및 블록들(510, 520, 530, 및 540)의 메커니즘들을 참조하며, 이러한 메커니즘들 중 하 나 이상이 디바이스의 위치를 결정하기 위하여 사용될 수 있다. 프로세스가, 다른 메커니즘이 공간을 식별하기 위하여 사용될 수 없는 이후에 하나의 메커니즘이 사용되는 것(예를 들어, 블록들(512, 522, 및 524) 참조)을 예시하지만, 2개 이상의 메커니즘들이 공간 신원을 검증하고 정확성을 증가시키기 위하여 동시에 또는 거의 동시에 사용될 수도 있다. 2개 이상의 메커니즘을 사용하는 것은 프로세서가 분류에 있어 서 확실성을 증가시키는 것을 가능하게 한다. 도 5에 도시된 예와 유사한 다른 예에 있어서, 메커니즘들의 계층이 정의될 수 있으며 저장부에 유지될 수 있다. 예를 들어, 프로세서는 공간을 식별하기 위하여 먼저 표현 신원을 살펴볼 수 있다. 다음으로, 프로 세서는 RIR를 살펴보고, 그런 다음 주변 잡음을, 그런 다음 공간 크기를 살펴볼 수 있다. 프로세서는 또한 연역적 분석을 형성할 수 있다. 즉, 소거의 프로세스에 의해, 프로세서는 디바이스 가 어떠한 공간 내에 있는지를 추정하거나 또는 추론할 수 있다. 예를 들어, 공간 샘플을 통해 수신된 주 변 잡음이 냉장고가 작동되는 소리를 포함하지 않는 경우, 부엌이 배제될 수 있는 등이다. 이상에서 공간 샘플 이 공간의 분류 이전에 획득되는 것으로서 설명되었지만, 공간 샘플들은 연속적으로 또는 주기적으로 획득될 수 도 있다. 주변 잡음은 시간에 따라 변화할 수 있다. 예를 들어, 냉장고가 연속적으로 작동하지 않을 수도 있으 며, 따라서 냉장고가 작동되는 소리들이 초기 공간 샘플 내에 포함되지 않을 수 있다. 그러나, 몇 분 후에, 냉 장고가 작동할 수 있으며, 따라서 후속 공간 샘플은 분류의 목적들을 위하여 이러한 주변 잡음을 식별할 수 있 다. 따라서, 공간 특유의 고도로 표적화된 응답들이 가상 비서 디바이스에 의해 주어질 수 있다. 공간 샘플을 분석 함으로써, 디바이스는 가능성이 있는 위치 또는 공간을 결정하고, 명령들에 대한 가청 답변들, 오디오 설정들 등을 포함하는 것의 응답들을 조정할 수 있다. 이상에서 예시적인 실시예들이 설명되었지만, 이러한 실시예들이 본 발명의 가능한 모든 형태들을 설명하도록 의도되지 않는다. 오히려, 본 명세서에서 사용된 단어들은 제한적이 아니라 설명적인 단어들이며, 본 발명의 사 상 및 범위로부터 벗어나지 않고 다양한 변화들이 이루어질 수 있다는 것이 이해되어야만 한다. 추가적으로, 실 시예들을 다양하게 구현하는 특징들이 본 발명의 추가적인 실시예들을 형성하기 위하여 결합될 수 있다.도면 도면1 도면2 도면3 도면4 도면5"}
{"patent_id": "10-2018-0134754", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 개시의 실시예들은 첨부된 청구항들에서의 독특한 구성요소들과 함께 언급된다. 그러나, 다양한 실시예들의 다른 특징들이 첨부된 도면들과 함께 다음의 상세한 설명을 참조함으로써 더 명백해지고 가장 잘 이해될 것이다. 도 1은 하나 이상의 실시예들에 따른 예시적인 지능형 개인 비서 디바이스를 포함하는 시스템을 예시한다. 도 2는 복수의 공간들을 포함하는 예시적인 주택을 예시한다. 도 3은 공간 프로파일들의 예시적인 차트를 예시한다. 도 4는 예시적인 RIR들의 예시적인 차트를 예시한다. 도 5는 분류 메커니즘 및 공간 프로파일들을 사용하여 분류하거나 또는 식별하기 위한 개인 비서 디바이스에 대 한 예시적인 프로세스를 예시한다."}
