{"patent_id": "10-2019-0116997", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0116195", "출원번호": "10-2019-0116997", "발명의 명칭": "전자 디바이스 및 이를 제작하는 방법", "출원인": "엘지전자 주식회사", "발명자": "이해선"}}
{"patent_id": "10-2019-0116997", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "외부의 신호가 통과할 수 있는 커버;상기 커버의 일 측에 마련되고, 상기 외부의 신호가 통과하는 제1 개구부가 형성되는 회로기판; 및 상기 회로기판의 일 측에 마련되고, 상기 제1 개구부에 대응하는 위치에 마련되어 상기 외부의 신호를 수신하는센서부가 구비되는 센싱유닛을 포함하는 전자 디바이스."}
{"patent_id": "10-2019-0116997", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 커버와 상기 회로기판 사이에 마련되고, 상기 외부의 신호가 통과하지 못하는 차단부재를 더 포함하고,상기 차단부재는 상기 제1 개구부에 대응하는 위치에 제2 개구부가 형성되어 상이 외부의 신호를 통과시키는 전자 디바이스."}
{"patent_id": "10-2019-0116997", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항에 있어서,상기 센싱유닛은 상기 제1 개구부 주위에 고정되는 고정부와, 상기 제1 개구부 내측에 노출되는 개방부를 포함하고,상기 센서부는 상기 개방부에 마련되는 전자 디바이스."}
{"patent_id": "10-2019-0116997", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1 항에 있어서,상기 커버의 내측 면과 이에 마주보는 상기 회로기판의 일 면 사이의 거리는 상기 커버의 내측 면과 이에 마주보는 상기 센서부의 일 면 사이의 거리보다 가까운 전자 디바이스."}
{"patent_id": "10-2019-0116997", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2 항에 있어서,상기 차단부재의 일 면은 이에 마주보는 상기 회로기판의 일 면에 접촉하는 전자 디바이스."}
{"patent_id": "10-2019-0116997", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제2 항에 있어서,상기 차단부재는 상기 회로기판의 일 면 상에 적층되는 전자 디바이스."}
{"patent_id": "10-2019-0116997", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제2 항에 있어서,상기 차단부재는 상기 커버의 내측 면 상에 적층되는 전자 디바이스."}
{"patent_id": "10-2019-0116997", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 2항에 있어서,상기 커버는 상기 차단부재가 배치되는 영역의 두께 보다 상기 제2 개구부에 대응하는 영역의 두께가 더 두껍게마련되고,공개특허 10-2019-0116195-3-상기 커버의 상기 제2 개구부에 대응하는 영역과 상기 차단부재의 내측 면은 동일 평면을 형성하는 전자 디바이스."}
{"patent_id": "10-2019-0116997", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1 항에 있어서,상기 센싱유닛은 상기 제1 개구부에 삽입되고, 상기 외부의 신호가 통과할 수 없는 차단 돌출부를 더 구비하고,상기 센서부는 상기 차단 돌출부의 내측에 마련되는 전자 디바이스."}
{"patent_id": "10-2019-0116997", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9 항에 있어서,상기 차단 돌출부 내측에는 상기 외부의 신호가 통과할 수 없는 차단코팅이 마련되는 전자 디바이스."}
{"patent_id": "10-2019-0116997", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9 항에 있어서,상기 차단 돌출부는 내측에 요입되는 홈이 형성되고, 상기 센서부는 상기 홈의 바닥면에 마련되는 전자 디바이스."}
{"patent_id": "10-2019-0116997", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1 항에 있어서,상기 센서부가 마련되는 상기 센싱유닛의 일 면은 상기 커버와 마주보는 면에 대향하는 상기 회로기판의 일 측면 보다 상기 커버에 가깝게 위치하는 전자 디바이스."}
{"patent_id": "10-2019-0116997", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12 항에 있어서,상기 센싱유닛은 상기 제1 개구부 내측에 삽입되는 삽입부가 마련되고, 상기 삽입부의 단부에 상기 센서부가 마련되는 전자 디바이스."}
{"patent_id": "10-2019-0116997", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13 항에 있어서,상기 센싱유닛은 상기 삽입부 주위에 방사 방향으로 둘출되고 상기 회로기판의 일 측면에 고정되는 고정부를 더구비하는 전자 디바이스."}
{"patent_id": "10-2019-0116997", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제1 항에 있어서,상기 전자 디바이스는 상기 외부의 신호를 수신하여 사용자의 신체일부의 위치 정보를 전달하여 증강 현실에 이용하는 것을 특징으로 하는,전자 디바이스."}
{"patent_id": "10-2019-0116997", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "외부의 신호를 수신하여 사용자의 신체 일부의 위치 정보를 전달하는 적어도 하나의 외부 컨트롤러와, 상기 외부 컨트롤러의 위치 정보를 화면에 표시하는 디스플레이장치를 포함하는 전자 디바이스에 있어서, 상기 외부 컨트롤러는,상기 외부의 신호가 통과할 수 있는 커버;상기 커버의 일 측에 마련되고, 상기 외부의 신호가 통과하는 제1 개구부가 형성되는 회로기판; 및 공개특허 10-2019-0116195-4-상기 회로기판의 일 측에 마련되고, 상기 제1 개구부에 대응하는 위치에 마련되어 상기 외부의 신호를 수신하는센서부가 구비되는 센싱유닛을 포함하는 전자 디바이스."}
{"patent_id": "10-2019-0116997", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16 항에 있어서,상기 디스플레이장치는 헤드 마운티드 디스플레이(HMD)인 전자 디바이스."}
{"patent_id": "10-2019-0116997", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "외부의 신호를 수신하는 전자 디바이스를 제작하는 방법에 있어서,상기 외부의 신호가 통과할 수 있는 커버를 사출 방식으로 형성하고,상기 커버의 일 면에 상기 외부의 신호가 통과하지 못하는 차단부재를 이중사출 방식으로 형성하되, 상기 차단부재에 상기 외부의 신호가 통과할 수 있는 윈도우가 마련되도록 개구를 형성하고,개구부가 형성된 회로기판의 일 면에 센서부를 구비하는 센싱유닛을 고정하되, 상기 센서부를 상기 개구부에 대응하는 위치에 배치하고;상기 커버 또는 상기 차단부재 중 어느 하나와 상기 회로기판을 결합하되, 상기 회로기판의 상기 센싱유닛이 고정되는 면에 대향하는 면이 상기 차단부재에 근접하도록 배치하는 전자 디바이스를 제작하는 방법."}
{"patent_id": "10-2019-0116997", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18 항에 있어서,상기 전자 디바이스는 상기 외부의 신호를 수신하여 사용자의 신체 일부의 위치 정보를 전달하여 증강 현실에이용하는 것을 특징으로 하는,전자 디바이스를 제작하는 방법."}
{"patent_id": "10-2019-0116997", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "전자 디바이스가 개시된다. 본 발명에 따른 전자 디바이스는 외부의 신호가 통과할 수 있는 커버와, 커버의 일 측에 마련되고 외부의 신호가 통과하는 제1 개구부가 형성되는 회로기판과, 회로기판의 일 측에 마련되고 제1 개 구부에 대응하는 위치에 마련되어 외부의 신호를 수신하는 센서부가 구비되는 센싱유닛을 포함한다. 본 발명의 전자 디바이스는 인공 지능(Artificial Intelligence) 모듈, 로봇, 증강현실(Augmented Reality, AR) 장치, 가 상현실(virtual reality, VR) 장치, 5G 서비스와 관련된 장치 등과 연계될 수 있다."}
{"patent_id": "10-2019-0116997", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 전자 디바이스에 관한 것이다. 보다 상세하게, VR(Virtual Reality), AR(Augmented Reality), MR(Mixed Reality) 등에 사용되는 전자 디바이스와 이를 제작하는 방법에 관한 것이다."}
{"patent_id": "10-2019-0116997", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "가상 현실(Virtual Reality, VR)은 컴퓨터 등을 사용한 인공적인 기술로 만들어낸 실제와 유사하지만 실제가 아 닌 어떤 특정한 환경이나 상황 혹은 그 기술 자체를 말한다. 증강 현실(Augmented Reality, AR)은 실제 환경에 가상 사물이나 정보를 합성하여 원래의 환경에 존재하는 사물 처럼 보이도록 하는 기술을 말한다. 혼합현실 (Mixed Reality, MR) 혹은 혼성현실 (Hybrid reality)은 가상 세계와 현실 세계를 합쳐서 새로운 환 경이나 새로운 정보를 만들어 내는 것을 말한다. 특히, 실시간으로 현실과 가상에 존재하는 것 사이에서 실시간 으로 상호작용할 수 있는 것을 말할 때 혼합 현실이라 한다. 이때, 만들어진 가상의 환경이나 상황 등은 사용자의 오감을 자극하며 실제와 유사한 공간적, 시간적 체험을 하 게 함으로써 현실과 상상의 경계를 자유롭게 드나들게 한다. 또한 사용자는 이러한 환경에 단순히 몰입할 뿐만 아니라 실재하는 디바이스를 이용해 조작이나 명령을 가하는 등 이러한 환경 속에 구현된 것들과 상호작용이 가 능하다."}
{"patent_id": "10-2019-0116997", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "최근, 이러한 기술분야에 사용되는 장비(gear)에 대한 연구가 활발히 이루어지고 있다. 위의 가상현실, 증강현실 또는 혼합현실을 구현하기 위해서는 디스플레이용 디바이스나 조작용 디바이스에 다양 한 센서류를 설치해야 한다. 특히, 디바이스의 위치 정보를 제어부에 보내기 위해서 광 센서 등이 설치될 필요 가 있는데, 기존 디바이스에 광 센서를 설치하기 위해서는 센서가 장착되는 회로기판을 지지하기 위해 별도의프레임을 설치해야 하기 때문에 부피와 무게가 증가하는 문제가 있다."}
{"patent_id": "10-2019-0116997", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 VR(Virtual Reality), AR(Augmented Reality), MR(Mixed Reality) 등에 사용되는 전자 디바이스를 사용함에 있어, 센서가 장착되는 회로기판이 커버에 지지되기 때문에 별도의 프레임이 필요치 않는 전자 디바이 스를 제공하는데, 그 목적이 있다. 또한, 커버 내측면에 광 차단용 페인트를 스프레이하는데 공정 시간이 오래 걸리고 불량률이 증가하는 문제를 해결할 수 있는 전자 디바이스의 제작방법을 제공하는데, 그 목적이 있다."}
{"patent_id": "10-2019-0116997", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 일 실시예에 따른 전자 디바이스는 외부의 신호가 통과할 수 있는 커버; 상기 커버의 일 측에 마련되고, 상 기 외부의 신호가 통과하는 제1 개구부가 형성되는 회로기판; 및 상기 회로기판의 일 측에 마련되고, 상기 제1 개구부에 대응하는 위치에 마련되어 상기 외부의 신호를 수신하는 센서부가 구비되는 센싱유닛을 포함한다. 이 때, 상기 커버와 상기 회로기판 사이에 마련되고, 상기 외부의 신호가 통과하지 못하는 차단부재를 더 포함 하고, 상기 차단부재는 상기 제1 개구부에 대응하는 위치에 제2 개구부가 형성되어 상이 외부의 신호를 통과시 킬 수 있다. 또한, 상기 센싱유닛은 상기 제1 개구부 주위에 고정되는 고정부와, 상기 제1 개구부 내측에 노출되는 개방부를 포함하고, 상기 센서부는 상기 개방부에 마련될 수 있다. 한편, 상기 커버의 내측 면과 이에 마주보는 상기 회로기판의 일 면 사이의 거리는 상기 커버의 내측 면과 이에 마주보는 상기 센서부의 일 면 사이의 거리보다 가까울 수 있다. 이 때, 상기 차단부재의 일 면은 이에 마주보는 상기 회로기판의 일 면에 접촉할 수 있다. 또는 상기 차단부재는 상기 회로기판의 일 면 상에 적층될 수 있다. 또는 상기 차단부재는 상기 커버의 내측 면 상에 적층될 수 있다. 한편, 상기 커버는 상기 차단부재가 배치되는 영역의 두께 보다 상기 제2 개구부에 대응하는 영역의 두께가 더 두껍게 마련되고, 상기 커버의 상기 제2 개구부에 대응하는 영역과 상기 차단부재의 내측 면은 동일 평면을 형 성할 수 있다. 또한, 상기 센싱유닛은 상기 제1 개구부에 삽입되고, 상기 외부의 신호가 통과할 수 없는 차단 돌출부를 더 구 비하고, 상기 센서부는 상기 차단 돌출부의 내측에 마련될 수 있다. 여기서 상기 차단 돌출부 내측에는 상기 외부의 신호가 통과할 수 없는 차단코팅이 마련될 수 있다. 그리고 상기 차단 돌출부는 내측에 요입되는 홈이 형성되고, 상기 센서부는 상기 홈의 바닥면에 마련될 수 있다. 또한, 상기 센서부가 마련되는 상기 센싱유닛의 일 면은 상기 커버와 마주보는 면에 대향하는 상기 회로기판의 일 측면 보다 상기 커버에 가깝게 위치할 수 있다. 이 때, 상기 센싱유닛은 상기 제1 개구부 내측에 삽입되는 삽입부가 마련되고, 상기 삽입부의 단부에 상기 센서 부가 마련될 수 있다. 여기서 상기 센싱유닛은 상기 삽입부 주위에 방사 방향으로 둘출되고 상기 회로기판의 일 측면에 고정되는 고정 부를 더 구비할 수 있다. 또한, 본 발명의 다른 측면에 의하면, 외부의 신호를 수신하여 사용자의 신체 일부의 위치 정보를 전달하는 적 어도 하나의 외부 컨트롤러와, 상기 외부 컨트롤러의 위치 정보를 화면에 표시하는 디스플레이장치를 포함하는 전자 디바이스에 있어서, 상기 외부 컨트롤러는, 상기 외부의 신호가 통과할 수 있는 커버; 상기 커버의 일 측 에 마련되고, 상기 외부의 신호가 통과하는 제1 개구부가 형성되는 회로기판; 및 상기 회로기판의 일 측에 마련 되고, 상기 제1 개구부에 대응하는 위치에 마련되어 상기 외부의 신호를 수신하는 센서부가 구비되는 센싱유닛을 포함하는 전자 디바이스가 제공될 수 있다. 이 때, 상기 디스플레이장치는 헤드 마운티드 디스플레이(HMD)일 수 있다. 본 발명의 또 다른 측면에 의하면, 외부의 신호를 수신하는 전자 디바이스를 제작하는 방법에 있어서, 상기 외 부의 신호가 통과할 수 있는 커버를 사출 방식으로 형성하고, 상기 커버의 일 면에 상기 외부의 신호가 통과하 지 못하는 차단부재를 이중사출 방식으로 형성하되, 상기 차단부재에 상기 외부의 신호가 통과할 수 있는 윈도 우가 마련되도록 개구를 형성하고, 개구부가 형성된 회로기판의 일 면에 센서부를 구비하는 센싱유닛을 고정하 되, 상기 센서부를 상기 개구부에 대응하는 위치에 배치하고; 상기 커버 또는 상기 차단부재 중 어느 하나와 상 기 회로기판을 결합하되, 상기 회로기판의 상기 센싱유닛이 고정되는 면에 대향하는 면이 상기 차단부재에 근접 하도록 배치하는 전자 디바이스를 제작하는 방법이 제공될 수 있다. 이 때, 상기 전자 디바이스는 상기 외부의 신호를 수신하여 사용자의 신체 일부의 위치 정보를 전달하여 증강 현실에 이용하는 것을 특징으로 할 수 있다."}
{"patent_id": "10-2019-0116997", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 전자 디바이스는 센서가 장착되는 회로기판이 커버에 직접 지지될 수 있으므로, 별도이 프레임 이 필요치 않아 부피와 무게가 감소할 수 있다. 또한, 본 발명의 실시예들 중 적어도 하나에 의하면, 커버 내측 면에 신호 차단부재를 제공하기 위해 스프레이 공정을 실시할 필요가 없어 공정 시간이 단축되고 불량률이 감소할 수 있다. 또한, 본 발명의 실시예들 중 적어도 하나에 의하면, 커버와 회로기판 사이에 마련되는 별도의 차단부재 층을 삭제할 수 있어 공정 시간이 단축되고 보다 얇은 두께의 장치를 제공할 수 있다. 또한, 본 발명의 실시예들 중 적어도 하나에 의하면, 회로기판의 개구 내에 센서부가 삽입됨으로써 장비의 두께 를 얇게 할 수 있다."}
{"patent_id": "10-2019-0116997", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 명세서에 개시된 실시예를 상세히 설명하되, 도면 부호에 관계없이 동일하거 나 유사한 구성요소는 동일한 참조 번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 본 명세서에 개시된 실시예를 설명함에 있어서 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되 어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이해되어야 할 것이다.또한, 본 명세서에 개시된 실시예를 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 명세서에 개 시된 실시예의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 또한, 첨부된 도면은 본 명세 서에 개시된 실시예를 쉽게 이해할 수 있도록 하기 위한 것일 뿐, 첨부된 도면에 의해 본 명세서에 개시된 기술 적 사상이 제한되지 않으며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하 는 것으로 이해되어야 한다. [5G 시나리오] 5G의 세 가지 주요 요구 사항 영역은 개선된 모바일 광대역 (Enhanced Mobile Broadband, eMBB) 영역, 다량의 머신 타입 통신 (massive Machine Type Communication, mMTC) 영역 및 초-신뢰 및 저 지연 통신 (Ultra-reliable and Low Latency Communications, URLLC) 영역을 포함한다. 일부 사용 예(Use Case)는 최적화를 위해 다수의 영역들이 요구될 수 있고, 다른 사용 예는 단지 하나의 핵심 성능 지표 (Key Performance Indicator, KPI)에만 포커싱될 수 있다. 5G는 이러한 다양한 사용 예들을 유연하 고 신뢰할 수 있는 방법으로 지원하는 것이다. eMBB는 기본적인 모바일 인터넷 액세스를 훨씬 능가하게 하며, 풍부한 양방향 작업, 클라우드 또는 증강현실에 서 미디어 및 엔터테인먼트 애플리케이션을 커버한다. 데이터는 5G의 핵심 동력 중 하나이며, 5G 시대에서 처음 으로 전용 음성 서비스를 볼 수 없을 수 있다. 5G에서, 음성은 단순히 통신 시스템에 의해 제공되는 데이터 연 결을 사용하여 응용 프로그램으로서 처리될 것이 기대된다. 증가된 트래픽 양(volume)을 위한 주요 원인들은 콘 텐츠 크기의 증가 및 높은 데이터 전송률을 요구하는 애플리케이션 수의 증가이다. 스트리밍 서비스 (오디오 및 비디오), 대화형 비디오 및 모바일 인터넷 연결은 더 많은 장치가 인터넷에 연결될수록 더 널리 사용될 것이다. 이러한 많은 응용 프로그램들은 사용자에게 실시간 정보 및 알림을 푸쉬하기 위해 항상 켜져 있는 연결성이 필 요하다. 클라우드 스토리지 및 애플리케이션은 모바일 통신 플랫폼에서 급속히 증가하고 있으며, 이것은 업무 및 엔터테인먼트 모두에 적용될 수 있다. 그리고, 클라우드 스토리지는 상향링크 데이터 전송률의 성장을 견인 하는 특별한 사용 예이다. 5G는 또한 클라우드의 원격 업무에도 사용되며, 촉각 인터페이스가 사용될 때 우수한 사용자 경험을 유지하도록 훨씬 더 낮은 단-대-단(end-to-end) 지연을 요구한다. 엔터테인먼트 예를 들어, 클라 우드 게임 및 비디오 스트리밍은 모바일 광대역 능력에 대한 요구를 증가시키는 또 다른 핵심 요소이다. 엔터테 인먼트는 기차, 차 및 비행기와 같은 높은 이동성 환경을 포함하는 어떤 곳에서든지 스마트폰 및 태블릿에서 필 수적이다. 또 다른 사용 예는 엔터테인먼트를 위한 증강현실 및 정보 검색이다. 여기서, 증강현실은 매우 낮은 지연과 순간적인 데이터 양을 필요로 한다. 또한, 가장 많이 예상되는 5G 사용 예 중 하나는 모든 분야에서 임베디드 센서를 원활하게 연결할 수 있는 기능 즉, mMTC에 관한 것이다. 2020년까지 잠재적인 IoT 장치들은 204 억 개에 이를 것으로 예측된다. 산업 IoT는 5G 가 스마트 도시, 자산 추적(asset tracking), 스마트 유틸리티, 농업 및 보안 인프라를 가능하게 하는 주요 역 할을 수행하는 영역 중 하나이다. URLLC는 주요 인프라의 원격 제어 및 자체-구동 차량(self-driving vehicle)과 같은 초 신뢰 / 이용 가능한 지 연이 적은 링크를 통해 산업을 변화시킬 새로운 서비스를 포함한다. 신뢰성과 지연의 수준은 스마트 그리드 제 어, 산업 자동화, 로봇 공학, 드론 제어 및 조정에 필수적이다. 다음으로, 다수의 사용 예들에 대해 보다 구체적으로 살펴본다. 5G는 초당 수백 메가 비트에서 초당 기가 비트로 평가되는 스트림을 제공하는 수단으로 FTTH (fiber-to-the- home) 및 케이블 기반 광대역 (또는 DOCSIS)을 보완할 수 있다. 이러한 빠른 속도는 가상현실과 증강현실뿐 아 니라 4K 이상(6K, 8K 및 그 이상)의 해상도로 TV를 전달하는데 요구된다. VR(Virtual Reality) 및 AR(Augmented Reality) 애플리케이션들은 거의 몰입형(immersive) 스포츠 경기를 포함한다. 특정 응용 프로그램 은 특별한 네트워크 설정이 요구될 수 있다. 예를 들어, VR 게임의 경우, 게임 회사들이 지연을 최소화하기 위 해 코어 서버를 네트워크 오퍼레이터의 에지 네트워크 서버와 통합해야 할 수 있다. 자동차(Automotive)는 차량에 대한 이동 통신을 위한 많은 사용 예들과 함께 5G에 있어 중요한 새로운 동력이 될 것으로 예상된다. 예를 들어, 승객을 위한 엔터테인먼트는 동시의 높은 용량과 높은 이동성 모바일 광대역을 요구한다. 그 이유는 미래의 사용자는 그들의 위치 및 속도와 관계없이 고품질의 연결을 계속해서 기대하기 때 문이다. 자동차 분야의 다른 활용 예는 증강현실 대시보드이다. 이는 운전자가 앞면 창을 통해 보고 있는 것 위 에 어둠 속에서 물체를 식별하고, 물체의 거리와 움직임에 대해 운전자에게 말해주는 정보를 겹쳐서 디스플레이 한다. 미래에, 무선 모듈은 차량들 간의 통신, 차량과 지원하는 인프라구조 사이에서 정보 교환 및 자동차와 다른 연결된 디바이스들(예를 들어, 보행자에 의해 수반되는 디바이스들) 사이에서 정보 교환을 가능하게 한다. 안전 시스템은 운전자가 보다 안전한 운전을 할 수 있도록 행동의 대체 코스들을 안내하여 사고의 위험을 낮출 수 있게 한다. 다음 단계는 원격 조종되거나 자체 운전 차량(self-driven vehicle)이 될 것이다. 이는 서로 다 른 자체 운전 차량들 사이 및 자동차와 인프라 사이에서 매우 신뢰성이 있고, 매우 빠른 통신을 요구한다. 미래 에, 자체 운전 차량이 모든 운전 활동을 수행하고, 운전자는 차량 자체가 식별할 수 없는 교통 이상에만 집중하 도록 할 것이다. 자체 운전 차량의 기술적 요구 사항은 트래픽 안전을 사람이 달성할 수 없을 정도의 수준까지 증가하도록 초 저 지연과 초고속 신뢰성을 요구한다. 스마트 사회(smart society)로서 언급되는 스마트 도시와 스마트 홈은 고밀도 무선 센서 네트워크로 임베디드될 것이다. 지능형 센서의 분산 네트워크는 도시 또는 집의 비용 및 에너지-효율적인 유지에 대한 조건을 식별할 것이다. 유사한 설정이 각 가정을 위해 수행될 수 있다. 온도 센서, 창 및 난방 컨트롤러, 도난 경보기 및 가전 제품들은 모두 무선으로 연결된다. 이러한 센서들 중 많은 것들이 전형적으로 낮은 데이터 전송 속도, 저전력 및 저비용이다. 하지만, 예를 들어, 실시간 HD 비디오는 감시를 위해 특정 타입의 장치에서 요구될 수 있다. 열 또는 가스를 포함한 에너지의 소비 및 분배는 고도로 분산화되고 있어, 분산 센서 네트워크의 자동화된 제어 가 요구된다. 스마트 그리드는 정보를 수집하고 이에 따라 행동하도록 디지털 정보 및 통신 기술을 사용하여 이 런 센서들을 상호 연결한다. 이 정보는 공급 업체와 소비자의 행동을 포함할 수 있으므로, 스마트 그리드가 효 율성, 신뢰성, 경제성, 생산의 지속 가능성 및 자동화된 방식으로 전기와 같은 연료들의 분배를 개선하도록 할 수 있다. 스마트 그리드는 지연이 적은 다른 센서 네트워크로 볼 수도 있다. 건강 부문은 이동 통신의 혜택을 누릴 수 있는 많은 응용 프로그램을 보유하고 있다. 통신 시스템은 멀리 떨어 진 곳에서 임상 진료를 제공하는 원격 진료를 지원할 수 있다. 이는 거리에 대한 장벽을 줄이는데 도움을 주고, 거리가 먼 농촌에서 지속적으로 이용하지 못하는 의료 서비스들로의 접근을 개선시킬 수 있다. 이는 또한 중요 한 진료 및 응급 상황에서 생명을 구하기 위해 사용된다. 이동 통신 기반의 무선 센서 네트워크는 심박수 및 혈 압과 같은 파라미터들에 대한 원격 모니터링 및 센서들을 제공할 수 있다. 무선 및 모바일 통신은 산업 응용 분야에서 점차 중요해지고 있다. 배선은 설치 및 유지 비용이 높다. 따라서, 케이블을 재구성할 수 있는 무선 링크들로의 교체 가능성은 많은 산업 분야에서 매력적인 기회이다. 그러나, 이 를 달성하는 것은 무선 연결이 케이블과 비슷한 지연, 신뢰성 및 용량으로 동작하는 것과, 그 관리가 단순화될 것이 요구된다. 낮은 지연과 매우 낮은 오류 확률은 5G로 연결될 필요가 있는 새로운 요구 사항이다. 물류(logistics) 및 화물 추적(freight tracking)은 위치 기반 정보 시스템을 사용하여 어디에서든지 인벤토리 (inventory) 및 패키지의 추적을 가능하게 하는 이동 통신에 대한 중요한 사용 예이다. 물류 및 화물 추적의 사 용 예는 전형적으로 낮은 데이터 속도를 요구하지만 넓은 범위와 신뢰성 있는 위치 정보가 필요하다. 본 명세서에서 후술할 본 발명은 전술한 5G의 요구 사항을 만족하도록 각 실시예를 조합하거나 변경하여 구현될 수 있다. 도 1은 AI 장치의 일 실시예를 나타내는 개념도이다. 도 1을 참조하면, AI 시스템은 AI 서버, 로봇, 자율주행 차량, XR 장치, 스마트폰 또는 가전 중에서 적어도 하나 이상이 클라우드 네트워크와 연결된다. 여기서, AI 기술이 적용된 로봇, 자율주행 차량, XR 장치, 스마트폰 또는 가전 등을 AI 장치(11 내지 15)라 칭할 수 있다. 클라우드 네트워크는 클라우드 컴퓨팅 인프라의 일부를 구성하거나 클라우드 컴퓨팅 인프라 안에 존재하는 네트워크를 의미할 수 있다. 여기서, 클라우드 네트워크는 3G 네트워크, 4G 또는 LTE(Long Term Evolution) 네트워크 또는 5G 네트워크 등을 이용하여 구성될 수 있다. 즉, AI 시스템을 구성하는 각 장치들(11 내지 15, 20)은 클라우드 네트워크를 통해 서로 연결될 수 있다. 특히, 각 장치들(11 내지 15, 20)은 기지국을 통해서 서로 통신할 수도 있지만, 기지국을 통하지 않고 직접 서 로 통신할 수도 있다. AI 서버는 AI 프로세싱을 수행하는 서버와 빅 데이터에 대한 연산을 수행하는 서버를 포함할 수 있다. AI 서버는 AI 시스템을 구성하는 AI 장치들인 로봇, 자율주행 차량, XR 장치, 스마트폰 또 는 가전 중에서 적어도 하나 이상과 클라우드 네트워크을 통하여 연결되고, 연결된 AI 장치들(11 내지15)의 AI 프로세싱을 적어도 일부를 도울 수 있다. 이 때, AI 서버는 AI 장치(11 내지 15)를 대신하여 머신 러닝 알고리즘에 따라 인공 신경망을 학습시킬 수 있고, 학습 모델을 직접 저장하거나 AI 장치(11 내지 15)에 전송할 수 있다. 이 때, AI 서버는 AI 장치(11 내지 15)로부터 입력 데이터를 수신하고, 학습 모델을 이용하여 수신한 입력 데이터에 대하여 결과 값을 추론하고, 추론한 결과 값에 기초한 응답이나 제어 명령을 생성하여 AI 장치(11 내 지 15)로 전송할 수 있다. 또는, AI 장치(11 내지 15)는 직접 학습 모델을 이용하여 입력 데이터에 대하여 결과 값을 추론하고, 추론한 결 과 값에 기초한 응답이나 제어 명령을 생성할 수도 있다. <AI+로봇> 로봇은 AI 기술이 적용되어, 안내 로봇, 운반 로봇, 청소 로봇, 웨어러블 로봇, 엔터테인먼트 로봇, 펫 로 봇, 무인 비행 로봇 등으로 구현될 수 있다. 로봇은 동작을 제어하기 위한 로봇 제어 모듈을 포함할 수 있고, 로봇 제어 모듈은 소프트웨어 모듈 또는 이를 하드웨어로 구현한 칩을 의미할 수 있다. 로봇은 다양한 종류의 센서들로부터 획득한 센서 정보를 이용하여 로봇의 상태 정보를 획득하거나, 주 변 환경 및 객체를 검출(인식)하거나, 맵 데이터를 생성하거나, 이동 경로 및 주행 계획을 결정하거나, 사용자 상호작용에 대한 응답을 결정하거나, 동작을 결정할 수 있다. 여기서, 로봇은 이동 경로 및 주행 계획을 결정하기 위하여, 라이다, 레이더, 카메라 중에서 적어도 하나 이상의 센서에서 획득한 센서 정보를 이용할 수 있다. 로봇은 적어도 하나 이상의 인공 신경망으로 구성된 학습 모델을 이용하여 상기한 동작들을 수행할 수 있다. 예컨대, 로봇은 학습 모델을 이용하여 주변 환경 및 객체를 인식할 수 있고, 인식된 주변 환경 정보 또는 객체 정보를 이용하여 동작을 결정할 수 있다. 여기서, 학습 모델은 로봇에서 직접 학습되거나, AI 서 버 등의 외부 장치에서 학습된 것일 수 있다. 이 때, 로봇은 직접 학습 모델을 이용하여 결과를 생성하여 동작을 수행할 수도 있지만, AI 서버 등의 외부 장치에 센서 정보를 전송하고 그에 따라 생성된 결과를 수신하여 동작을 수행할 수도 있다. 로봇은 맵 데이터, 센서 정보로부터 검출한 객체 정보 또는 외부 장치로부터 획득한 객체 정보 중에서 적어 도 하나 이상을 이용하여 이동 경로와 주행 계획을 결정하고, 구동부를 제어하여 결정된 이동 경로와 주행 계획 에 따라 로봇을 주행시킬 수 있다. 맵 데이터에는 로봇이 이동하는 공간에 배치된 다양한 객체들에 대한 객체 식별 정보가 포함될 수 있다. 예 컨대, 맵 데이터에는 벽, 문 등의 고정 객체들과 화분, 책상 등의 이동 가능한 객체들에 대한 객체 식별 정보가 포함될 수 있다. 그리고, 객체 식별 정보에는 명칭, 종류, 거리, 위치 등이 포함될 수 있다. 또한, 로봇은 사용자의 제어/상호작용에 기초하여 구동부를 제어함으로써, 동작을 수행하거나 주행할 수 있 다. 이 때, 로봇은 사용자의 동작이나 음성 발화에 따른 상호작용의 의도 정보를 획득하고, 획득한 의도 정 보에 기초하여 응답을 결정하여 동작을 수행할 수 있다. <AI+자율주행> 자율주행 차량은 AI 기술이 적용되어, 이동형 로봇, 차량, 무인 비행체 등으로 구현될 수 있다. 자율주행 차량은 자율주행 기능을 제어하기 위한 자율주행 제어 모듈을 포함할 수 있고, 자율주행 제어 모 듈은 소프트웨어 모듈 또는 이를 하드웨어로 구현한 칩을 의미할 수 있다. 자율주행 제어 모듈은 자율주행 차량 의 구성으로써 내부에 포함될 수도 있지만, 자율주행 차량의 외부에 별도의 하드웨어로 구성되어 연결 될 수도 있다. 자율주행 차량은 다양한 종류의 센서들로부터 획득한 센서 정보를 이용하여 자율주행 차량의 상태 정보 를 획득하거나, 주변 환경 및 객체를 검출(인식)하거나, 맵 데이터를 생성하거나, 이동 경로 및 주행 계획을 결 정하거나, 동작을 결정할 수 있다. 여기서, 자율주행 차량은 이동 경로 및 주행 계획을 결정하기 위하여, 로봇과와 마찬가지로, 라이다, 레이더, 카메라 중에서 적어도 하나 이상의 센서에서 획득한 센서 정보를 이용할 수 있다. 특히, 자율주행 차량은 시야가 가려지는 영역이나 일정 거리 이상의 영역에 대한 환경이나 객체는 외부 장 치들로부터 센서 정보를 수신하여 인식하거나, 외부 장치들로부터 직접 인식된 정보를 수신할 수 있다. 자율주행 차량은 적어도 하나 이상의 인공 신경망으로 구성된 학습 모델을 이용하여 상기한 동작들을 수행 할 수 있다. 예컨대, 자율주행 차량은 학습 모델을 이용하여 주변 환경 및 객체를 인식할 수 있고, 인식된 주변 환경 정보 또는 객체 정보를 이용하여 주행 동선을 결정할 수 있다. 여기서, 학습 모델은 자율주행 차량 에서 직접 학습되거나, AI 서버 등의 외부 장치에서 학습된 것일 수 있다. 이 때, 자율주행 차량은 직접 학습 모델을 이용하여 결과를 생성하여 동작을 수행할 수도 있지만, AI 서버 등의 외부 장치에 센서 정보를 전송하고 그에 따라 생성된 결과를 수신하여 동작을 수행할 수도 있다. 자율주행 차량은 맵 데이터, 센서 정보로부터 검출한 객체 정보 또는 외부 장치로부터 획득한 객체 정보 중 에서 적어도 하나 이상을 이용하여 이동 경로와 주행 계획을 결정하고, 구동부를 제어하여 결정된 이동 경로와 주행 계획에 따라 자율주행 차량을 주행시킬 수 있다. 맵 데이터에는 자율주행 차량이 주행하는 공간(예컨대, 도로)에 배치된 다양한 객체들에 대한 객체 식별 정 보가 포함될 수 있다. 예컨대, 맵 데이터에는 가로등, 바위, 건물 등의 고정 객체들과 차량, 보행자 등의 이동 가능한 객체들에 대한 객체 식별 정보가 포함될 수 있다. 그리고, 객체 식별 정보에는 명칭, 종류, 거리, 위치 등이 포함될 수 있다. 또한, 자율주행 차량은 사용자의 제어/상호작용에 기초하여 구동부를 제어함으로써, 동작을 수행하거나 주 행할 수 있다. 이 때, 자율주행 차량은 사용자의 동작이나 음성 발화에 따른 상호작용의 의도 정보를 획득 하고, 획득한 의도 정보에 기초하여 응답을 결정하여 동작을 수행할 수 있다. <AI+XR> XR 장치는 AI 기술이 적용되어, HMD(Head-Mount Display), 차량에 구비된 HUD(Head-Up Display), 텔레비전, 휴대폰, 스마트 폰, 컴퓨터, 웨어러블 디바이스, 가전 기기, 디지털 사이니지, 차량, 고정형 로봇이 나 이동형 로봇 등으로 구현될 수 있다. XR 장치는 다양한 센서들을 통해 또는 외부 장치로부터 획득한 3차원 포인트 클라우드 데이터 또는 이미지 데이터를 분석하여 3차원 포인트들에 대한 위치 데이터 및 속성 데이터를 생성함으로써 주변 공간 또는 현실 객 체에 대한 정보를 획득하고, 출력할 XR 객체를 렌더링하여 출력할 수 있다. 예컨대, XR 장치는 인식된 물체 에 대한 추가 정보를 포함하는 XR 객체를 해당 인식된 물체에 대응시켜 출력할 수 있다. XR 장치는 적어도 하나 이상의 인공 신경망으로 구성된 학습 모델을 이용하여 상기한 동작들을 수행할 수 있다. 예컨대, XR 장치는 학습 모델을 이용하여 3차원 포인트 클라우드 데이터 또는 이미지 데이터에서 현 실 객체를 인식할 수 있고, 인식한 현실 객체에 상응하는 정보를 제공할 수 있다. 여기서, 학습 모델은 XR 장치 에서 직접 학습되거나, AI 서버 등의 외부 장치에서 학습된 것일 수 있다. 이 때, XR 장치는 직접 학습 모델을 이용하여 결과를 생성하여 동작을 수행할 수도 있지만, AI 서버 등 의 외부 장치에 센서 정보를 전송하고 그에 따라 생성된 결과를 수신하여 동작을 수행할 수도 있다. <AI+로봇+자율주행> 로봇은 AI 기술 및 자율주행 기술이 적용되어, 안내 로봇, 운반 로봇, 청소 로봇, 웨어러블 로봇, 엔터테인 먼트 로봇, 펫 로봇, 무인 비행 로봇 등으로 구현될 수 있다. AI 기술과 자율주행 기술이 적용된 로봇은 자율주행 기능을 가진 로봇 자체나, 자율주행 차량과 상호작 용하는 로봇 등을 의미할 수 있다. 자율주행 기능을 가진 로봇은 사용자의 제어 없이도 주어진 동선에 따라 스스로 움직이거나, 동선을 스스로 결정하여 움직이는 장치들을 통칭할 수 있다. 자율주행 기능을 가진 로봇 및 자율주행 차량은 이동 경로 또는 주행 계획 중 하나 이상을 결정하기 위 해 공통적인 센싱 방법을 사용할 수 있다. 예를 들어, 자율주행 기능을 가진 로봇 및 자율주행 차량은 라이다, 레이더, 카메라를 통해 센싱된 정보를 이용하여, 이동 경로 또는 주행 계획 중 하나 이상을 결정할 수 있다.자율주행 차량과 상호작용하는 로봇은 자율주행 차량(100b100a)와과 별개로 존재하면서, 자율주행 차량 의 내부 또는 외부에서 자율주행 기능에 연계되거나, 자율주행 차량에 탑승한 사용자와 연계된 동작을 수행할 수 있다. 이 때, 자율주행 차량과 상호작용하는 로봇은 자율주행 차량을를 대신하여 센서 정보를 획득하여 자율주행 차량에 제공하거나, 센서 정보를 획득하고 주변 환경 정보 또는 객체 정보를 생성하여 자율주행 차량에 제공함으로써, 자율주행 차량의 자율주행 기능을 제어하거나 보조할 수 있다. 또는, 자율주행 차량과 상호작용하는 로봇은 자율주행 차량에 탑승한 사용자를 모니터링하거나 사 용자와의 상호작용을 통해 자율주행 차량의 기능을 제어할 수 있다. 예컨대, 로봇은 운전자가 졸음 상 태인 경우로 판단되는 경우, 자율주행 차량의 자율주행 기능을 활성화하거나 자율주행 차량의 구동부의 제어를 보조할 수 있다. 여기서, 로봇이 제어하는 자율주행 차량의 기능에는 단순히 자율주행 기능뿐만 아니라, 자율주행 차량의 내부에 구비된 네비게이션 시스템이나 오디오 시스템에서 제공하는 기능도 포함될 수 있다. 또는, 자율주행 차량과 상호작용하는 로봇은 자율주행 차량의 외부에서 자율주행 차량에 정보 를 제공하거나 기능을 보조할 수 있다. 예컨대, 로봇은 스마트 신호등과 같이 자율주행 차량에 신호 정 보 등을 포함하는 교통 정보를 제공할 수도 있고, 전기 차량의 자동 전기 충전기와 같이 자율주행 차량과 상호작용하여 충전구에 전기 충전기를 자동으로 연결할 수도 있다. <AI+로봇+XR> 로봇은 AI 기술 및 XR 기술이 적용되어, 안내 로봇, 운반 로봇, 청소 로봇, 웨어러블 로봇, 엔터테인먼트 로봇, 펫 로봇, 무인 비행 로봇, 드론 등으로 구현될 수 있다. XR 기술이 적용된 로봇은 XR 영상 내에서의 제어/상호작용의 대상이 되는 로봇을 의미할 수 있다. 이 경우, 로봇은 XR 장치와 구분되며 서로 연동될 수 있다. XR 영상 내에서의 제어/상호작용의 대상이 되는 로봇은 카메라를 포함하는 센서들로부터 센서 정보를 획득 하면, 로봇 또는 XR 장치는 센서 정보에 기초한 XR 영상을 생성하고, XR 장치는 생성된 XR 영상을 출력할 수 있다. 그리고, 이러한 로봇은 XR 장치를 통해 입력되는 제어 신호 또는 사용자의 상호작용에 기초하여 동작할 수 있다. 예컨대, 사용자는 XR 장치 등의 외부 장치를 통해 원격으로 연동된 로봇의 시점에 상응하는 XR 영상을 확인할 수 있고, 상호작용을 통하여 로봇의 자율주행 경로를 조정하거나, 동작 또는 주행을 제어하거나, 주 변 객체의 정보를 확인할 수 있다. <AI+자율주행+XR> 자율주행 차량은 AI 기술 및 XR 기술이 적용되어, 이동형 로봇, 차량, 무인 비행체 등으로 구현될 수 있다. XR 기술이 적용된 자율주행 차량은 XR 영상을 제공하는 수단을 구비한 자율주행 차량이나, XR 영상 내에서 의 제어/상호작용의 대상이 되는 자율주행 차량 등을 의미할 수 있다. 특히, XR 영상 내에서의 제어/상호작용의 대상이 되는 자율주행 차량은 XR 장치와 구분되며 서로 연동될 수 있다. XR 영상을 제공하는 수단을 구비한 자율주행 차량은 카메라를 포함하는 센서들로부터 센서 정보를 획득하고, 획득한 센서 정보에 기초하여 생성된 XR 영상을 출력할 수 있다. 예컨대, 자율주행 차량은 HUD를 구비하여 XR 영상을 출력함으로써, 탑승자에게 현실 객체 또는 화면 속의 객체에 대응되는 XR 객체를 제공할 수 있다. 이 때, XR 객체가 HUD에 출력되는 경우에는 XR 객체의 적어도 일부가 탑승자의 시선이 향하는 실제 객체에 오버 랩되도록 출력될 수 있다. 반면, XR 객체가 자율주행 차량의 내부에 구비되는 디스플레이에 출력되는 경우 에는 XR 객체의 적어도 일부가 화면 속의 객체에 오버랩되도록 출력될 수 있다. 예컨대, 자율주행 차량은 차로, 타 차량, 신호등, 교통 표지판, 이륜차, 보행자, 건물 등과 같은 객체와 대응되는 XR 객체들을 출력할 수 있다. XR 영상 내에서의 제어/상호작용의 대상이 되는 자율주행 차량은 카메라를 포함하는 센서들로부터 센서 정 보를 획득하면, 자율주행 차량 또는 XR 장치는 센서 정보에 기초한 XR 영상을 생성하고, XR 장치는 생성된 XR 영상을 출력할 수 있다. 그리고, 이러한 자율주행 차량은 XR 장치 등의 외부 장치를 통해 입력되는 제어 신호 또는 사용자의 상호작용에 기초하여 동작할 수 있다. [확장현실 기술] 확장현실(XR: eXtended Reality)은 가상현실(VR: Virtual Reality), 증강현실(AR: Augmented Reality), 혼합현 실(MR: Mixed Reality)을 총칭한다. VR 기술은 현실 세계의 객체나 배경 등을 CG 영상으로만 제공하고, AR 기술 은 실제 사물 영상 위에 가상으로 만들어진 CG 영상을 함께 제공하며, MR 기술은 현실 세계에 가상 객체들을 섞 고 결합시켜서 제공하는 컴퓨터 그래픽 기술이다. MR 기술은 현실 객체와 가상 객체를 함께 보여준다는 점에서 AR 기술과 유사하다. 그러나, AR 기술에서는 가상 객체가 현실 객체를 보완하는 형태로 사용되는 반면, MR 기술에서는 가상 객체와 현실 객체가 동등한 성격으로 사용된다는 점에서 차이점이 있다. XR 기술은 HMD(Head-Mount Display), HUD(Head-Up Display), 휴대폰, 태블릿 PC, 랩탑, 데스크탑, TV, 디지털 사이니지 등에 적용될 수 있고, XR 기술이 적용된 장치를 XR 장치(XR Device)라 칭할 수 있다. 이하에서는 본 발명의 실시예에 따른 확장현실을 제공하는 전자 디바이스에 대해 설명하기로 한다. 도 2는 본 발명의 일 실시예에 따른 확장현실 전자 디바이스의 구성을 나타내는 블럭도이다. 도 2를 참조하면, 확장현실 전자 디바이스는 무선 통신부, 입력부, 센싱부, 출력부, 인터 페이스부, 메모리, 제어부 및 전원 공급부 등을 포함할 수 있다. 도 2에 도시된 구성요소들은 전자 디바이스를 구현하는데 있어서 필수적인 것은 아니어서, 본 명세서 상에서 설명되는 전자 디바이스 는 위에서 열거된 구성요소들 보다 많거나, 적은 구성요소들을 가질 수 있다. 보다 구체적으로, 위 구성요소들 중 무선 통신부는, 전자 디바이스와 무선 통신 시스템 사이, 전자 디 바이스와 다른 전자 디바이스 사이, 또는 전자 디바이스와 외부서버 사이의 무선 통신을 가능하게 하는 하나 이상의 모듈을 포함할 수 있다. 또한, 상기 무선 통신부는, 전자 디바이스를 하나 이상의 네트워 크에 연결하는 하나 이상의 모듈을 포함할 수 있다. 이러한 무선 통신부는, 방송 수신 모듈, 이동통신 모듈, 무선 인터넷 모듈, 근거리 통신 모듈, 위치정보 모 듈 중 적어도 하나를 포함할 수 있다. 입력부는, 영상 신호 입력을 위한 카메라 또는 영상 입력부, 오디오 신호 입력을 위한 마이크로폰 (microphone), 또는 오디오 입력부, 사용자로부터 정보를 입력받기 위한 사용자 입력부(예를 들어, 터치키 (touch key), 푸시키(mechanical key) 등)를 포함할 수 있다. 입력부에서 수집한 음성 데이터나 이미지 데 이터는 분석되어 사용자의 제어명령으로 처리될 수 있다. 센싱부는 전자 디바이스 내 정보, 전자 디바이스를 둘러싼 주변 환경 정보 및 사용자 정보 중 적어 도 하나를 센싱하기 위한 하나 이상의 센서를 포함할 수 있다. 예를 들어, 센싱부는 근접센서(proximity sensor), 조도 센서(illumination sensor), 터치 센서(touch sensor), 가속도 센서(acceleration sensor), 자기 센서(magnetic sensor), 중력 센서(G-sensor), 자이로스코 프 센서(gyroscope sensor), 모션 센서(motion sensor), RGB 센서, 적외선 센서(IR 센서: infrared sensor), 지문인식 센서(finger scan sensor), 초음파 센서(ultrasonic sensor), 광 센서(optical sensor, 예를 들어, 촬영수단), 마이크로폰(microphone), 배터리 게이지(battery gauge), 환경 센서(예를 들어, 기압계, 습도계, 온 도계, 방사능 감지 센서, 열 감지 센서, 가스 감지 센서 등), 화학 센서(예를 들어, 전자 코, 헬스케어 센서, 생체 인식 센서 등) 중 적어도 하나를 포함할 수 있다. 한편, 본 명세서에 개시된 전자 디바이스는, 이러한 센서들 중 적어도 둘 이상의 센서에서 센싱되는 정보들을 조합하여 활용할 수 있다. 출력부는 시각, 청각 또는 촉각 등과 관련된 출력을 발생시키기 위한 것으로, 디스플레이부, 음향 출력부, 햅팁 모듈, 광 출력부 중 적어도 하나를 포함할 수 있다. 디스플레이부는 터치 센서와 상호 레이어 구조를 이루 거나 일체형으로 형성됨으로써, 터치 스크린을 구현할 수 있다. 이러한 터치 스크린은, 증강현실 전자 디바이스 와 사용자 사이의 입력 인터페이스를 제공하는 사용자 입력수단으로써 기능함과 동시에, 증강현실 전자 디 바이스와 사용자 사이의 출력 인터페이스를 제공할 수 있다. 인터페이스부는 전자 디바이스에 연결되는 다양한 종류의 외부장치와의 통로 역할을 수행한다. 인터페 이스부를 통해 전자 디바이스는 외부장치로부터 가상현실 또는 증강현실 컨텐츠를 제공받을 수 있고, 다양한 입력 신호, 센싱 신호, 데이터를 주고받음으로써, 상호 인터랙션을 수행할 수 있다. 예를 들어, 인터페이스부는 유/무선 헤드셋 포트(port), 외부 충전기 포트(port), 유/무선 데이터 포트 (port), 메모리 카드(memory card) 포트, 식별 모듈이 구비된 장치를 연결하는 포트(port), 오디오 I/O(Input/Output) 포트(port), 비디오 I/O(Input/Output) 포트(port), 이어폰 포트(port) 중 적어도 하나를 포함할 수 있다. 또한, 메모리는 전자 디바이스의 다양한 기능을 지원하는 데이터를 저장한다. 메모리는 전자 디바 이스에서 구동되는 다수의 응용 프로그램(application program 또는 애플리케이션(application)), 전자 디 바이스의 동작을 위한 데이터들, 명령어들을 저장할 수 있다. 이러한 응용 프로그램 중 적어도 일부는, 무 선 통신을 통해 외부 서버로부터 다운로드 될 수 있다. 또한 이러한 응용 프로그램 중 적어도 일부는, 전자 디 바이스의 기본적인 기능(예를 들어, 전화 착신, 발신 기능, 메시지 수신, 발신 기능)을 위하여 출고 당시부 터 전자 디바이스상에 존재할 수 있다. 제어부는 응용 프로그램과 관련된 동작 외에도, 통상적으로 전자 디바이스의 전반적인 동작을 제어한다. 제어부는 위에서 살펴본 구성요소들을 통해 입력 또는 출력되는 신호, 데이터, 정보 등을 처리할 수 있다. 또한, 제어부는 메모리에 저장된 응용 프로그램을 구동함으로써 구성요소들 중 적어도 일부를 제어하여 사여 사용자에게 적절한 정보를 제공하거나 기능을 처리할 수 있다. 나아가, 제어부는 응용 프로그램의 구 동을 위하여 전자 디바이스에 포함된 구성요소들 중 적어도 둘 이상을 서로 조합하여 동작시킬 수 있다. 또한, 제어부는 센싱부에 포함된 자이로스코프 센서, 중력 센서, 모션 센서 등을 이용하여 전자 디바이 스나 사용자의 움직임을 감지할 수 있다. 또는 제어부는 센싱부에 포함된 근접센서, 조도센서, 자 기센서, 적외선 센서, 초음파 센서, 광 센서 등을 이용하여 전자 디바이스나 사용자 주변으로 다가오는 대 상체를 감지할 수도 있다. 그 밖에도, 제어부는 전자 디바이스와 연동하여 동작하는 컨트롤러에 구비된 센서들을 통해서도 사용자의 움직임을 감지할 수 있다. 또한, 제어부는 메모리에 저장된 응용 프로그램을 이용하여 전자 디바이스의 동작(또는 기능)을 수 행할 수 있다. 전원 공급부는 제어부의 제어 하에서, 외부의 전원 또는 내부의 전원을 인가받아 전자 디바이스에 포함된 각 구성요소들에 전원을 공급한다. 전원 공급부는 배터리를 포함하며, 배터리는 내장형 또는 교체가 능한 형태로 마련될 수 있다. 위 각 구성요소들 중 적어도 일부는, 이하에서 설명되는 다양한 실시 예들에 따른 전자 디바이스의 동작, 제어, 또는 제어방법을 구현하기 위하여 서로 협력하여 동작할 수 있다. 또한, 전자 디바이스의 동작, 제어, 또는 제 어방법은 메모리에 저장된 적어도 하나의 응용 프로그램의 구동에 의하여 전자 디바이스 상에서 구현될 수 있다. 이하, 본 발명의 일 예로서 설명되는 전자 디바이스는 HMD(Head Mounted Display)에 적용되는 실시예를 기준으 로 설명한다. 그러나 본 발명에 따른 전자 디바이스의 실시예에는 휴대폰, 스마트 폰(smart phone), 노트북 컴 퓨터(laptop computer), 디지털방송용 단말기, PDA(personal digital assistants), PMP(portable multimedia player), 네비게이션, 슬레이트 PC(slate PC), 태블릿 PC(tablet PC), 울트라북(ultrabook), 및 웨어러블 디바 이스(wearable device) 등이 포함될 수 있다. 웨어러블 디바이스에는 HMD 이외에도 워치형 단말기(smart watch) 등이 포함될 수 있다. 도 3은 본 발명의 일 실시예에 따른 증강현실 전자 디바이스의 사시도이다. 도 3을 참조하면, 증강현실 전자 디바이스는 글래스 타입(smart glass)으로 마련될 수 있다. 글래스 타입의 전 자 디바이스는 인체의 두부에 착용 가능하도록 구성되며, 이를 위한 프레임부(케이스, 하우징 등)을 구비할 수 있다. 프레임부는 착용이 용이하도록 플렉서블 재질로 형성될 수 있다. 프레임부는 두부에 지지되며, 각종 부품들이 장착되는 공간을 마련한다. 도시된 바와 같이, 프레임부(10 1)에는 제어부, 음향 출력부 등과 같은 전자부품이 장착될 수 있다. 또한, 프레임부에는 좌안 및 우 안 중 적어도 하나를 덮는 렌즈가 착탈 가능하게 장착될 수 있다. 제어부는 전자 디바이스에 구비되는 각종 전자부품을 제어하도록 이루어진다. 본 도면에서는, 제어 부가 일측 두부 상의 프레임부에 설치된 것을 예시하고 있다. 하지만, 제어부의 위치는 이에 한정되 지 않는다. 디스플레이부는 헤드 마운티드 디스플레이(Head Mounted Display, HMD) 형태로 구현될 수 있다. HMD 형태 란, 두부에 장착되어, 사용자의 눈 앞에 직접 영상을 보여주는 디스플레이 방식을 말한다. 사용자가 글래스 타 입의 전자 디바이스를 착용하였을 때, 사용자의 눈 앞에 직접 영상을 제공할 수 있도록, 디스플레이부 는 좌안 및 우안 중 적어도 하나에 대응되게 배치될 수 있다. 본 도면에서는, 사용자의 우안을 향하여 영 상을 출력할 수 있도록, 디스플레이부가 우안에 대응되는 부분에 위치한 것을 예시하고 있다. 디스플레이부는 프리즘을 이용하여 디스플레이 영역에 이미지를 투사할 수 있다. 또한, 사용자가 투사된 이미지와 전방의 일반 시야(사용자가 눈을 통하여 바라보는 범위)를 함께 볼 수 있도록, 프리즘은 투광성으로 형성될 수 있다. 이처럼, 디스플레이부를 통하여 출력되는 영상은, 일반 시야와 오버랩(overlap)되어 보일 수 있다. 전자 디바이스는 이러한 디스플레이의 특성을 이용하여 현실의 이미지나 배경에 가상 이미지를 겹쳐서 하나의 영상으로 보여주는 증강현실(Augmented Reality, AR)을 제공할 수 있다. 촬영수단는 좌안 및 우안 중 적어도 하나에 인접하게 배치되어, 전방의 영상을 촬영하도록 형성된다. 촬영 수단이 눈에 인접하여 위치하므로, 촬영수단은 사용자가 바라보는 장면을 영상으로 획득할 수 있다. 본 도면에서는, 촬영수단이 제어 모듈에 구비된 것을 예시하고 있으나, 반드시 이에 한정되는 것은 아니다. 촬영수단은 상기 프레임부에 설치될 수도 있으며, 복수 개로 구비되어 입체 영상을 획득하 도록 이루어질 수도 있다. 글래스 타입의 전자 디바이스는 제어명령을 입력 받기 위하여 조작되는 사용자 입력부를 구비할 수 있다. 사용자 입력부는 터치, 푸시 등 사용자가 촉각으로 느끼면서 조작하게 되는 방식(tactile manner), 직접 터치하지 않은 상태에서 사용자의 손의 움직임을 인식하는 제스처 방식(gesture manner), 또는 음성 명령 을 인식하는 방식을 포함하여 다양한 방식이 채용될 수 있다. 본 도면에서는, 프레임부 또는 제어 모듈에 푸시 및 터치 입력 방식의 사용자 입력부가 구비된 것을 예시하고 있다. 또한, 글래스 타입의 전자 디바이스에는 사운드를 입력 받아 전기적인 음성 데이터로 처리하는 마이크로폰 및 음향을 출력하는 음향 출력부가 구비될 수 있다. 음향 출력부는 일반적인 음향 출력 방식 또는 골 전도 방식으로 음향을 전달하도록 이루어질 수 있다. 음향 출력부가 골전도 방식으로 구현되는 경우, 사용 자가 전자 디바이스를 착용시, 음향 출력부는 두부에 밀착되며, 두개골을 진동시켜 음향을 전달하게 된다. 도 3은 본 발명의 일 실시예에 따른 증강현실 전자 디바이스의 사시도이다. 도면을 참조하면, 증강현실 전자 디바이스는 글래스 타입(smart glass)으로 마련될 수 있다. 글래스 타입의 전 자 디바이스는 인체의 두부에 착용 가능하도록 구성되며, 이를 위한 프레임부(케이스, 하우징 등)을 구비할 수 있다. 프레임부는 착용이 용이하도록 플렉서블 재질로 형성될 수 있다. 프레임부는 두부에 지지되며, 각종 부품들이 장착되는 공간을 마련한다. 도시된 바와 같이, 프레임부(10 1)에는 제어부, 음향 출력부 등과 같은 전자부품이 장착될 수 있다. 또한, 프레임부에는 좌안 및 우 안 중 적어도 하나를 덮는 렌즈가 착탈 가능하게 장착될 수 있다. 제어부는 전자 디바이스에 구비되는 각종 전자부품을 제어하도록 이루어진다. 본 도면에서는, 제어 부가 일측 두부 상의 프레임부에 설치된 것을 예시하고 있다. 하지만, 제어부의 위치는 이에 한정되 지 않는다. 디스플레이부는 헤드 마운티드 디스플레이(Head Mounted Display, HMD) 형태로 구현될 수 있다. HMD 형태 란, 두부에 장착되어, 사용자의 눈 앞에 직접 영상을 보여주는 디스플레이 방식을 말한다. 사용자가 글래스 타 입의 전자 디바이스를 착용하였을 때, 사용자의 눈 앞에 직접 영상을 제공할 수 있도록, 디스플레이부는 좌안 및 우안 중 적어도 하나에 대응되게 배치될 수 있다. 본 도면에서는, 사용자의 우안을 향하여 영 상을 출력할 수 있도록, 디스플레이부가 우안에 대응되는 부분에 위치한 것을 예시하고 있다. 디스플레이부는 프리즘을 이용하여 디스플레이 영역에 이미지를 투사할 수 있다. 또한, 사용자가 투사된 이미지와 전방의 일반 시야(사용자가 눈을 통하여 바라보는 범위)를 함께 볼 수 있도록, 프리즘은 투광성으로 형성될 수 있다. 이처럼, 디스플레이부를 통하여 출력되는 영상은, 일반 시야와 오버랩(overlap)되어 보일 수 있다. 전자 디바이스는 이러한 디스플레이의 특성을 이용하여 현실의 이미지나 배경에 가상 이미지를 겹쳐서 하나의 영상으로 보여주는 증강현실(Augmented Reality, AR)을 제공할 수 있다. 촬영수단는 좌안 및 우안 중 적어도 하나에 인접하게 배치되어, 전방의 영상을 촬영하도록 형성된다. 촬영 수단이 눈에 인접하여 위치하므로, 촬영수단은 사용자가 바라보는 장면을 영상으로 획득할 수 있다. 본 도면에서는, 촬영수단이 제어 모듈에 구비된 것을 예시하고 있으나, 반드시 이에 한정되는 것은 아니다. 촬영수단은 상기 프레임부에 설치될 수도 있으며, 복수 개로 구비되어 입체 영상을 획득하 도록 이루어질 수도 있다. 글래스 타입의 전자 디바이스는 제어명령을 입력 받기 위하여 조작되는 사용자 입력부를 구비할 수 있다. 사용자 입력부는 터치, 푸시 등 사용자가 촉각으로 느끼면서 조작하게 되는 방식(tactile manner), 직접 터치하지 않은 상태에서 사용자의 손의 움직임을 인식하는 제스처 방식(gesture manner), 또는 음성 명령 을 인식하는 방식을 포함하여 다양한 방식이 채용될 수 있다. 본 도면에서는, 프레임부 또는 제어 모듈에 푸시 및 터치 입력 방식의 사용자 입력부가 구비된 것을 예시하고 있다. 또한, 글래스 타입의 전자 디바이스에는 사운드를 입력 받아 전기적인 음성 데이터로 처리하는 마이크로폰 및 음향을 출력하는 음향 출력부가 구비될 수 있다. 음향 출력부는 일반적인 음향 출력 방식 또는 골 전도 방식으로 음향을 전달하도록 이루어질 수 있다. 음향 출력부가 골전도 방식으로 구현되는 경우, 사용 자가 전자 디바이스를 착용시, 음향 출력부는 두부에 밀착되며, 두개골을 진동시켜 음향을 전달하게 된다. 도 4는 가상현실 전자 디바이스를 사용하는 모습을 나타내는 도면이고, 도 5는 본 발명의 다른 실시예에 따른 가상현실 전자 디바이스의 사시도이다. 그리고 도 6은 가상현실 전자 디바이스에 사용되는 컨트롤러를 나타내는 도면이다. 도면을 참조하면, 가상현실 전자 디바이스는 사용자의 머리에 장착되는 가상현실 전자 디바이스와, 사용자 가 파지하여 조작할 수 있는 컨트롤러(210: 210a, 210b)를 포함할 수 있다. 가상현실 전자 디바이스는 인체의 두부에 착용되어 지지되는 헤드유닛과, 헤드유닛에 결합되어 사용자의 눈 앞에 가상의 이미지 또는 영상을 표시하는 디스플레이유닛을 포함한다. 도면에는 헤드유닛 과 디스플레이유닛이 별개의 유닛으로 구성되어 서로 결합되는 것으로 도시되지만, 이와 달리 디스플 레이유닛은 헤드유닛에 일체로 구성될 수도 있다. 헤드유닛은 중량감이 있는 디스플레이유닛의 무게를 분산시킬 수 있도록 사용자의 머리를 감싸는 구 조를 채택할 수 있다. 그리고 각기 다른 사용자의 두상 크기에 맞출 수 있도록 길이 가변되는 밴드 등이 구비될 수 있다. 디스플레이유닛은 헤드부에 결합되는 커버부와 디스플레이 패널을 내측에 수용하는 디스플레이 부를 구성한다. 커버부는 고글 프레임이라고도 불리며, 전체적으로 터브 형상(tub shape)일 수 있다. 커버부는 내부 에 공간이 형성되고 전면에 사용자의 안구의 위치에 대응되는 개구가 형성된다. 디스플레이부는 커버부의 전면 프레임에 장착되고, 사용자의 양 안에 대응되는 위치에 마련되어 화면 정보(영상 또는 이미지 등)를 출력한다. 디스플레이부에서 출력되는 화면정보는 가상현실 컨텐츠뿐만 아니 라, 카메라 등 촬영수단을 통해 수집되는 외부 이미지를 포함한다. 그리고 디스플레이부에 출력되는 가상현실 컨텐츠는 전자 디바이스 자체에 저장된 것이거나 또는 외 부장치에 저장된 것일 수 있다. 예를 들어, 화면정보가 전자 디바이스에 저장된 가상 공간 영상인 경 우, 전자 디바이스는 상기 가상 공간의 영상을 처리하기 위한 이미지 프로세싱 및 렌더링 처리를 수행하고, 이미지 프로세싱 및 렌더링 처리 결과 생성된 화상 정보를 디스플레이부를 통해 출력할 수 있다. 반면, 외부장치에 저장된 가상 공간 영상인 경우, 외부장치가 이미지 프로세싱 및 렌더링 처리 를 수행하고, 그 결과 생성된 화상 정보를 전자 디바이스에 전송해줄 수 있다. 그러면 전자 디바이스(10 0)는 외부장치로부터 수신된 3D 화상 정보를 디스플레이부를 통해 출력할 수 있다. 디스플레이부는 커버부의 개구 전방에 마련되는 디스플레이 패널을 포함하고, 디스플레이 패널은 LCD 또는 OLED 패널일 수 있다. 또는 디스플레이부는 스마트폰의 디스플레이부일 수 있다. 즉, 커버부의 전방에 스마트폰이 탈착될 수 있는 구조를 채택할 수 있다. 그리고 디스플레이유닛의 전방에는 촬영수단과 각종 센싱유닛이 설치될 수 있다. 촬영수단(예를 들어, 카메라)는 전방의 영상을 촬영(수신, 입력)하도록 형성되고, 특히 사용자가 바라보는 장면을 영상으로 획득할 수 있다. 도 5에서는 촬영수단이 디스플레이부의 중앙 위치에 한 개 마련되 는 것을 도시하였으나, 이와 달리 서로 대칭되는 위치에 두 개 이상 마련될 수도 있다. 복수의 촬영수단을 구비하는 경우 입체 영상을 획득할 수도 있다. 촬영수단으로부터 획득되는 외부 이미지에 가상 이미지를 결합한 이미지가 디스플레이부를 통해 표시될 수 있다. 센싱유닛은 자이로스코프 센서, 모션 센서 또는 IR 센서 등을 포함할 수 있다. 센싱유닛은 사용자의 위치 또는 움직임을 감지하거나, 주변 대상체를 감지할 수 있다. 도 5에서는 센싱유닛이 디스플레이부 의 대칭되는 위치에 복수로 마련되는 것을 도시하였으나, 이와 달리 하나의 센싱유닛이 구비되거나 디스플레이부 이외의 위치에 구비될 수 있다. 센싱유닛에 대해서는 뒤에서 보다 상세히 설명하기로 한다. 그리고 디스플레이유닛의 후방에는 안면패드(facial pad, 204)가 설치될 수 있다. 안면패드는 사용자 의 안구 주위에 밀착되고, 쿠션감이 있는 소재로 마련되어 사용자의 얼굴에 편안한 착용감을 제공한다. 그리고 안면패드는 사람의 얼굴 전면 윤곽에 대응하는 형상을 지니면서도 플렉서블한 소재로 마련되어 각기 다른 사용자의 얼굴 형상에도 안면에 밀착될 수 있어 외부 빛이 눈으로 침입하는 것을 차단할 수 있다. 그 밖에도 가상현실 전자 디바이스는 제어명령을 입력 받기 위하여 조작되는 사용자 입력부, 그리고 음향 출력부와 제어부가 구비될 수 있다. 이에 대한 설명은 전과 동일하므로 생략한다. 또한, 가상현실 전자 디바이스는 가상현실 전자 디바이스를 통해 표시되는 가상 공간 영상과 관련된 동작 을 제어하기 위한 컨트롤러(210: 210a, 210b)가 주변장치로 구비될 수 있다. 컨트롤러는 사용자가 양손에 쉽게 그립(grip)할 수 있는 형태로 마련되고, 외측면에는 사용자 입력을 수신 하기 위한 터치패드(또는 트랙패드), 버튼 등이 구비될 수 있다. 컨트롤러는 전자 디바이스와 연동하여 디스플레이부에 출력되는 화면을 제어하는데 사용될 수 있다. 컨트롤러는 사용자가 쥐는(grip) 그립부와, 그립부로부터 연장되며 다양한 센서들과 마이 크로 프로세서가 내장된 헤드부를 포함하여 구성될 수 있다. 그립부는 사용자가 쉽게 쥘 수 있도록 세로로 긴 바 형태로 이루어지고 헤드부는 링 형태로 이루어질 수 있다. 그리고 컨트롤러는 사용자 입력부과 센싱유닛를 포함할 수 있다. 컨트롤러의 그립부에는 사용자 입력부가 마련될 수 있다. 사용자 입력부는 예를 들어, 그 립부의 일 측에 배치된 키들과, 그립부의 일 측에 구비된 터치패드(트랙 패드), 트리거 버튼 등을 포 함할 수 있다. 그리고 컨트롤러의 헤드부에는 센싱유닛이 마련될 수 있다. 센싱유닛은 자이로스코프 센서, 모션 센서 또는 IR 센서 등을 포함할 수 있다. 센싱유닛은 사용자의 위치 또는 움직임을 감지하거나, 주변 대상체를 감지할 수 있다. 예를 들어, IR 센서는 후술하는 위치추적장치로부터 방사되는 빛을 수신하여서, 사용자 동작을 추적하는데 사용된다. 모션 추적 센서는 3축의 가속도 센서와, 3축의 자이로스 코프, 디지털 모션 프로세서를 하나의 집합체로 포함하여 구성될 수 있다. 도 6에서는 센싱유닛이 헤드부 전방의 대칭되는 위치에 복수로 마련되는 것을 도시하였으나, 이와 달 리 하나의 센싱유닛이 구비되거나 헤드부 이외의 위치에 구비될 수 있다.그리고 컨트롤러는 전자 디바이스의 제어부로부터 수신되는 신호에 대응하는 피드백을 수행할 수 있 다. 예를 들어, 컨트롤러는 진동, 소리, 또는 광 등을 통해 사용자에게 피드백 신호를 전달할 수 있다. 한편, 사용자는 컨트롤러 조작을 통해 전자 디바이스에 구비된 촬영수단을 통해 확인되는 외부 환경 이미지에 접근할 수 있다. 즉, 사용자는 가상 공간 체험 중에도 전자 디바이스를 벗지 않고 컨트롤러 의 조작을 통해 외부 환경을 즉시 확인할 수 있다. 가상현실 전자 디바이스는 위치추적장치를 더 포함할 수 있다. 위치추적장치는 라이트하우스 (lighthouse) 시스템라는 위치추적(positional tracking) 기술을 적용하여 가상현실 전자 디바이스 또는 컨트롤러의 위치를 검출하고, 이를 이용하여 사용자의 360도 모션을 추적하는데 도움을 준다. 도 4를 참조하면, 위치추적시스템은 닫힌 특정 공간내에 하나 이상의 위치추적장치 장치(220: 220a, 220b)를 설 치함으로써 구현될 수 있다. 복수의 위치추적장치는 인식 가능한 공간 범위가 극대화될 수 있는 위치, 예 를 들어 대각선 방향으로 서로 마주보는 위치에 설치될 수 있다. 전자 디바이스 또는 컨트롤러는 복수의 위치추적장치에 포함된 LED 또는 레이저 방출기들로부터 방사되는 빛을 수신하고, 해당 빛이 수신된 위치와 시간 간의 상관관계에 기초하여, 닫힌 특정 공간 내에서의 사용자의 위치를 정확하게 판단할 수 있다. 이를 위해, 위치추적장치에는 IR 램프와 2축의 모터가 각각 포 함될 수 있으며, 이를 통해 가상현실 전자 디바이스 또는 컨트롤러와 신호를 주고받는다. 또한, 가상현실 전자 디바이스는 외부장치와 유/무선 통신을 수행할 수 있다. 가상현실 전자 디바이스 는 연결된 외부장치(230, 예를 들어, PC, 스마트폰, 또는 태블릿 등)에 저장된 가상 공간 영상을 수신하여 사용자에게 표시할 수 있다. 한편, 이상 설명한 컨트롤러와 위치추적장치는 필수 구성은 아니므로, 본 발명의 실시예에서는 생략 될 수 있다. 예를 들어, 가상현실 전자 디바이스에 설치된 사용자 입력부가 컨트롤러를 대신할 수 있 고, 가상현실 전자 디바이스에 설치된 센싱유닛으로부터 자체적으로 위치 정보를 판단할 수 있다. 다음으로, 도 7 내지 도 12를 참조하여, 본 발명의 일 실시예인 전자 디바이스에 대해 설명하기로 한다. 도 7과 도 8을 참조하면, 전자 디바이스는 외부의 신호가 통과하는 커버와, 커버의 내부에 마련 되고 전자회로가 형성되는 회로기판과, 회로기판의 하측에 마련되고 외부의 신호를 수신하는 센싱유 닛을 포함한다. 커버는 전자 디바이스의 아웃라인을 형성하고, 내부 공간에 마련되는 전자회로 등의 구성을 외부의 충격 등으로부터 보호한다. 커버로 둘러싸이는 내부 공간에는 마이크로 프로세서와 다양한 센싱유닛 들이 수용될 수 있다. 회로기판은 마이크로 프로세서와 센싱유닛을 연결하는 회로가 형성되는 기판으로, 휘어지거나 구부러 질 수 있는 연성 회로기판(Flexible printed circuit board)으로 마련될 수 있다. 그리고 회로기판은 종류에 따라 소스 회로기판과 컨트롤 회로기판을 포함하고, 소스 회로기판과 컨트롤 회 로기판은 FFC(flexible flat cable)나 FPC(flexible printed circuit)와 같은 연성 케이블을 통해 연결될 수 있다. 센싱유닛은 전자 디바이스 내 정보, 전자 디바이스를 둘러싼 주변 환경 정보 및 사용자 정보 중 적어도 하 나를 센싱하기 위한 하나 이상의 센서를 포함할 수 있다. 예를 들어, 센싱유닛은 근접센서(proximity sensor), 조도 센서(illumination sensor), 터치 센서(touch sensor), 가속도 센서(acceleration sensor), 자 기 센서(magnetic sensor), 중력 센서(G-sensor), 자이로스코프 센서(gyroscope sensor), 모션 센서(motion sensor), RGB 센서, 적외선 센서(IR 센서: infrared sensor), 지문인식 센서(finger scan sensor), 초음파 센 서(ultrasonic sensor), 광 센서(optical sensor, 예를 들어, 촬영수단), 마이크로폰(microphone), 배터리 게 이지(battery gauge), 환경 센서(예를 들어, 기압계, 습도계, 온도계, 방사능 감지 센서, 열 감지 센서, 가스 감지 센서 등), 화학 센서(예를 들어, 전자 코, 헬스케어 센서, 생체 인식 센서 등) 중 적어도 하나를 포함할 수 있다. 회로기판에 장착된 제어유닛(마이크로 프로세서)은 센싱유닛에 포함된 자이로스코프 센서, 중력 센서, 모션 센서, 적외선 센서(IR 센서) 또는 광 센서 등을 이용하여 전자 디바이스나 사용자의 위치 또는움직임을 감지할 수 있다. 여기서 모션 센서는 3축의 가속도 센서와, 3축의 자이로스코프, 디지털 모션 프로세 서를 하나의 집합체로 포함하여 구성될 수 있다. 예를 들어, 전자 디바이스가 사용자의 두부에 장착되는 HMD인 경우에는 제어유닛은 센싱유닛으로부터 인식되는 신호를 통해 사용자의 위치 또는 이동에 대한 정보를 얻고, 이 정보를 처리하여 디스플레이부에 영상 정보로 표시할 수 있다. 또는 전자 디바이스가 HMD와 연동되는 컨트롤러인 경우에는 제어유닛은 센싱유닛으로부터 인식되는 신호를 통해 컨트롤러를 쥐고 있는 손의 위치 또는 이동에 대한 정보를 얻고, 이 정보를 HMD 또는 외부 장치에 유선 또는 무선으로 전달할 수 있다. 또한, 제어유닛은 센싱유닛에 포함된 근접센서, 조도센서, 자기센서, 적외선 센서, 초음파 센서, 광 센서 등을 이용하여 전자 디바이스나 사용자 주변으로 다가오는 대상체를 감지할 수도 있다. 이하에서는 센싱유닛을 광 센서(IR 센서 포함)를 기준으로 설명한다. 그러나 앞에서 나열된 다양한 종류의 센서들이 사용될 수 있음은 물론이다. 광 센서는 위치추적장치로부터 방사되는 빛을 수신하여서, 사용자 동작을 추적하는데 사용될 수 있다. 또는 외 부의 빛을 수신하여, 관련 정보를 통해 HMD의 디스플레이에 연동시킬 수 있다. 그리고 광 센서는 적외선 필터로 덮여 외부 환경으로부터 보호될 수 있다. 한편, 전자 디바이스는 회로기판을 고정시키기 위한 프레임을 추가로 포함할 수 있다. 프레임 은 회로기판 보다는 강성이 있는 소재로 마련될 수 있으며, 커버의 내부 굴곡에 대응되는 형상 으로 제공되거나, 커버로부터 이격되어 회로기판이 커버에 간섭되지 않도록 배치될 수 있다. 도 7은 본 발명의 비교 실시예에 따른 전자 디바이스를 나타내는 단면도이다. 비교 실시예에 따른 전자 디바이스는 커버 아래의 내부 공간에 회로기판과 센싱유닛이 배 치되되, 회로기판을 지지하는 프레임을 추가로 구비한다. 구체적으로, 프레임 상에 회로기판을 밀착하여 고정시키고, 회로기판의 일 지점에 센싱유닛 을 장착한다. 센싱유닛은 외부 신호를 수신하는 센서부와, 센서부를 회로기판에 장착 하는 고정부를 포함한다. 고정부는 플랜지 형상으로 마련되어 회로기판에 견고하게 고정될 수 있고, 중앙 부위에 센서부 가 삽입되는 홈을 구비할 수 있다. 센서부는 고정부의 홈에 삽입되고 상부가 개방된 상태로 마련되어 외부 신호(레이저 또는 적외선 등의 광 신호)가 수신될 수 있다. 예를 들어, 센서부는 포토다이오드(Photo Diode)일 수 있다. 그리고 고정부는 센서부와 회로기판의 회로를 연결되는 배선을 구비할 수 있으며, 배선과 회로 를 통해 마이크로 프로세서에 신호를 전달할 수 있다. 회로기판의 상부에는 커버가 배치된다. 이 때, 커버는 센서부와 일정 간격 이격되는 위치 에 고정된다. 이를 위해, 프레임과 커버는 센싱유닛이 간섭되지 않을 정도의 간격을 두고 서로 결합될 수 있다. 프레임과 커버는 볼트 또는 핀 구조를 이용하여 일정 간격을 유지한 채 견고하게 결합할 수 있으며, 이를 위해 리브(Rib)와 보스(Boss) 구조가 형성될 수 있다. 광 신호는 커버를 통해 센서부에 전달되어야 하므로, 커버는 광 투과 재질로 마련될 수 있다. 커버 전체가 광 투과 재질로 마련될 수도 있지만, 센서부가 위치하는 영역의 커버만 광 투과 재 질로 마련되는 것도 가능하다. 여기에서는 광 신호를 예로 들었지만, 이외의 외부 신호의 경우에도 커버를 투과하여 신호가 전달될 수 있다. 또는 광 신호 이외의 외부 신호(화학물질 등)의 경우, 커버에 형성되는 개구(미도시)를 통해 외부 신호가 진입할 수도 있다. 이 경우, 외부 오염물질 또는 수분 등으로부터 센싱유닛을 보호하기 위해 커버의 개구는 필터부재(미도시)로 채워질 수 있다. 한편, 센싱유닛의 센싱 효율을 증가시키기 위해서는 센서부로 광 신호가 들어오는 경로를 제외하고는 광 신호가 차단되는 것이 바람직하다. 이를 위해, 커버의 하면에는 센서부에 광 신호가 입사하는 영 역을 제외하고 차단부재가 마련될 수 있다. 즉, 차단부재는 커버의 하면에 마련되되, 센서부에 대응되는 위치에 개구가 형성될 수 있다. 차단부재는 광 투과율이 낮은 소재가 이용될 수 있다. 또는 외부 신호가 광 신호가 아닌 경우에도 외부 신 호 투과율이 낮은 소재를 이용할 수 있다. 이상으로 설명한 비교 실시예에 따른 전자 디바이스는 몇 가지 문제를 내포하고 있다. 첫째, 회로기판을 견고하게 지지하기 위해 별도의 프레임이 구비되어야 하는데, 보통 프레임 을 구성하는 소재의 무게가 크고, 프레임의 두께만큼 전자 디바이스의 부피가 증가하게 된다. 따라 서 점차 가볍고 작아지는 전자 디바이스의 추세에 방해가 된다. 둘째, 커버 배면에 차단부재를 형성하기 위해 스프레이 방식을 이용하는데, 스프레이 공정 시간이 오 래 걸리고 불량율이 높아 수율에 악영향을 미치게 된다. 전자 디바이스가 소형화되면서 커버에 굴곡 이 많아지게 되고, 프레임과 커버를 결합하기 위해 커버 배면에 리브와 보스 구조를 형성해야 하기 때문에 필름 구조의 차단부재를 부착하는 방식으로 제작하기가 어렵다. 이러한 이유로 스프레이 방식 을 사용할 수밖에 없는데, 스프레이 방식을 사용하기 위해서는 센서부가 위치하는 영역에 마스킹(maskin g)을 한 후 블랙 페인트(black paint) 등을 분사하여야 한다. 그러나 앞서 설명한 바와 같이 리브와 보스 구조 등에 의해 마스킹을 견고하게 하는 것이 어려워 공정 시간이 늘어나고 불량률이 증가하게 된다. 이하에서는 위와 같은 문제점을 해결하는 본 발명의 실시예들에 대해 설명하기로 한다. 도 8은 본 발명의 제1 실시예에 따른 전자 디바이스(500-1)를 나타내는 단면도이다. 도 7에 도시된 비교 실시예와 비교하면, 도 8에 도시된 전자 디바이스(500-1)는 커버의 저부에 회로 기판(800-1)이 배치되고, 회로기판(800-1)의 저부에 센싱유닛이 배치된다는 점에서 차이가 있다. 본 발명의 제1 실시예에 따른 전자 디바이스(500-1)는 커버의 저부에 회로기판(800-1)이 지지되는 구조를 채택함으로써 회로기판(800-1)을 지지하기 위한 별도의 프레임(1000, 도 7 참조)이 불필요하게 된다. 따라서 프 레임이 차지하는 부피만큼 소형화가 가능하고, 프레임의 무게만큼 가볍게 할 수 있다. 회로기판(800-1)은 커버에 접촉된 상태로 지지될 수 있다. 해당 접촉은 면 접촉 또는 다중 포인트 접촉을 포함할 수 있다. 회로기판(800-1)은 커버에 기계적 결합구조로 고정디어 지지될 수 있을 뿐만 아니라 접착 제 또는 접착필름을 이용하여 부착될 수도 있다. 이러한 구조를 채용함으로써 도 7에 도시된 비교 실시예서 서 로 이격된 커버와 프레임을 기계적으로 결합하기 위해 리브와 보스 구조를 형성했어야 하는 것과 달 리, 커버 저면에 별도의 복잡한 구조가 불필요하게 된다. 따라서 커버 저면에 회로기판(800-1)을 안 정적으로 지지시키는 것이 용이하다. 다만, 본 발명의 제1 실시예에 따른 전자 디바이스(500-1)는 센싱유닛이 회로기판(800-1)의 저부에 결합되 기 때문에 센서부에 외부 신호가 유입될 수 있는 경로가 필요하다. 이를 위해, 회로기판(800-1)은 내측에 개구를 포함한다. 구체적으로, 회로기판(800-1)은 센싱유닛에 대응하는 영역에 관통되는 개구를 형성하고, 센싱유닛 은 회로기판(800-1)의 개구 주위에 고정될 수 있다. 구체적으로, 센싱유닛은 회로기판(800-1)의 개구 내측에 위치하여 커버와 개구를 통해 유 입되는 외부 신호를 수신하는 센서부와, 개구 주위로 연장되어 고정되는 고정부를 포함한다. 예 를 들어, 고정부는 회로기판(800-1)의 너비 방향으로 연장되는 플랜지 형상일 수 있고, 고정부는 회 로기판(800-1)에 나사 또는 핀 결합구조로 결합되거나 접착제로 고정될 수 있다. 전자 디바이스는 커버와 회로기판(800-1) 사이에 차단부재를 더 포함할 수 있다. 차단부재는 필름 형태로 마련될 수 있다. 이 경우, 차단부재는 커버의 하면에 부착되거나 회로 기판(800-1)의 상면에 부착될 수 있다. 위에서 설명한 바와 같이 커버 하면의 형상이 단순해지면서 차단부 재를 마련하기 위해 스프레이 방식을 사용할 필요없이 필름 방식으로 시공하면서 제작 공정을 단순화하고 불량 발생율을 현저히 줄일 수 있다. 또는 차단부재는 커버와 일체로 형성될 수 있다. 여기서 일체로 형성된다는 의미는 기계적 결합을 하 거나 별도의 접착제를 이용하여 부착하는 것이 아니라, 제작 공정 상(예를 들어, 사출 공정) 차단부재가 커버에 견고하게 고정될 수 있음을 의미한다. 예를 들어, 커버는 광투과 레진(resin)을 이용하여 제작되고, 차단부재는 커버의 일 면에 비투과 레진을 이용하여 일체화시킬 수 있다. 차단부재를 커버에 일체화시키는 방법으로 이중 사출 공정이 사용될 수 있다. 이하, 도 9를 참조하여 해당 공정을 설 명하기로 한다. 도 9는 이중 사출 공정으로 전자 디바이스(500-1)를 제작하는 공정을 설명하기 위한 도면이다. 도 9의 (a)를 참조하면, 광투과 레진을 소재로 하고, 사출 공정을 통해 커버를 제작한다. 도 9의 (b)를 참 조하면, 커버의 일 면에 비투과 레진을 이용하여 이중 사출 공법으로 차단부재를 형성한다. 차단부재 는 이중 사출 공정 동안에 커버에 일체로 형성될 수 있다. 이 때, 비투과 레진은 센싱유닛(90 0)이 배치되는 영역에 개구를 형성하도록 사출된다. 이처럼, 이중 사출 공정을 이용함으로써 개구를 형성하기 위해 별도 마스킹 공정을 추가할 필요가 없다. 마지막으로, 도 9의 (c)를 참조하면, 차단부재의 일면에 회로기판(800-1)을 결합하고, 회로기판(800-1)의 개구부에 센싱유닛을 결합함으로써 공정이 완료될 수 있다. 도 10은 본 발명의 제2 실시예에 따른 전자 디바이스(500-2)를 나타내는 단면도이다. 도 10을 참조하면, 본 발명의 제2 실시예에 따른 전자 디바이스(500-2)는 커버(600-1)가 차단부재(700-1)가 형 성되는 영역과 센싱유닛이 배치되는 영역이 서로 다른 이중 구조로 형성될 수 있다. 구체적으로, 커버 (600-1)는 차단부재(700-1)가 마련되는 영역이 내측으로 요입되고, 요입된 영역에 차단부재(700-1)가 마련될 수 있다. 동일한 의미로, 커버(600-1)는 센싱유닛이 배치되는 위체에 대응되는 영역이 돌출되고, 돌출부 주위 로 차단부재(700-1)가 마련될 수 있다. 도 10에 도시된 방법으로 이중 사출하는경우, 도 9와 같은 방법으로 이중 사출하는 것과 비교하여, 커버(600- 1)와 차단부재(700-1)가 차지하는 두께가 감소한다는 장점이 있다. 도 11은 본 발명의 제3 실시예에 따른 전자 디바이스(500-3)를 나타내는 단면도이다. 도 11을 참조하면, 본 발명의 제3 실시예에 따른 전자 디바이스(500-3)는 센싱유닛(900-1)이 센서부 주위 에 차단 돌출부를 구비함으로써, 커버와 회로기판(800-1) 사이에 별도의 차단부재(700, 도 8 참조)를 사용하지 않을 수 있다. 구체적으로, 커버의 일 면에 개구가 형성되는 회로기판(800-1)이 결합되고, 회로기판(800-1)의 개구 내에 센싱유닛(900-1)의 차단 돌출부가 삽입 결합될 수 있다. 차단 돌출부는 비투과 재질로 마 련되거나, 내측에 비투과 재질이 코팅될 수 있다. 차단 돌출부는 보스 형상으로 마련될 수 있다. 예를 들어, 회로기판(800-1)의 개구는 원통 형상일 수 있고, 차단 돌출부는 일정한 두께를 가지는 원통 형상일 수 있다. 이 때, 차단 돌출부의 단부는 커버 에 밀착할 수 있고, 차단 돌출부에 비투과 재질이 코팅되는 경우 커버를 마주보면 면에도 비투 과 재질이 코팅될 수 있다. 센서부는 차단 돌출부 내부의 공간으로 유입되는 외부 신호를 수신할 수 있다. 본 발명의 제3 실시예에 따른 전자 디바이스(500-3)는 시트 형상의 차단부재(700, 도 8 참조)를 생략함으로써 전체적인 두께를 감소시킬 수 있고, 제작 공정시간을 단축할 수 있다. 도 12는 본 발명의 제4 실시예에 따른 전자 디바이스(500-4)를 나타내는 단면도이다. 도 12를 참조하면, 본 발명의 제4 실시예에 따른 전자 디바이스(500-4)는 센싱유닛(900-2)에서 센서부가 배치되는 영역이 회로기판(800-1)의 개구 내측으로 삽입될 수 있다. 구체적으로, 센싱유닛(900-2)은 회로 기판(800-1)의 개구에 삽입되는 돌출 삽입부와, 돌출 삽입부의 일 측에서 외측으로 연장되어 회 로기판(800-1)에 고정되는 고정부를 포함한다. 예를 들어, 회로기판(800-1)의 개구는 원통 형상일 수 있고, 돌출 삽입부는 일 면에 센서부가 마련되는 원통 형상일 수 있다. 이 때, 센서부는 커버 와 일정 거리를 두고 배치될 수 있다. 본 발명의 제4 실시예에 따른 전자 디바이스(500-4)는 센서부가 회로기판(800-1)의 개구 내측에 배치 됨으로써 전체적인 두께를 감소시킬 수 있다. 앞에서 설명된 본 발명의 어떤 실시예들 또는 다른 실시예들은 서로 배타적이거나 구별되는 것은 아니다. 앞서 설명된 본 발명의 어떤 실시예들 또는 다른 실시예들은 각각의 구성 또는 기능이 병용되거나 조합될 수 있다.예를 들어 특정 실시예 및/또는 도면에 설명된 A 구성과 다른 실시예 및/또는 도면에 설명된 B 구성이 결합될 수 있음을 의미한다. 즉, 구성 간의 결합에 대해 직접적으로 설명하지 않은 경우라고 하더라도 결합이 불가능하 다고 설명한 경우를 제외하고는 결합이 가능함을 의미한다. 상기의 상세한 설명은 모든 면에서 제한적으로 해석되어서는 아니되고 예시적인 것으로 고려되어야 한다. 본 발 명의 범위는 첨부된 청구항의 합리적 해석에 의해 결정되어야 하고, 본 발명의 등가적 범위 내에서의 모든 변경 은 본 발명의 범위에 포함된다."}
{"patent_id": "10-2019-0116997", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 AI 장치의 일 실시예를 나타내는 개념도이다. 도 2는 본 발명의 일 실시예에 따른 확장현실 전자 디바이스의 구성을 나타내는 블럭도이다. 도 3은 본 발명의 일 실시예에 따른 증강현실 전자 디바이스의 사시도이다. 도 4는 가상현실 전자 디바이스를 사용하는 모습을 나타내는 도면이다. 도 5는 본 발명의 다른 실시예에 따른 가상현실 전자 디바이스의 사시도이다. 도 6은 가상현실 전자 디바이스에 사용되는 컨트롤러를 나타내는 도면이다. 도 7은 본 발명의 비교 실시예에 따른 전자 디바이스를 나타내는 단면도이다. 도 8은 본 발명의 제1 실시예에 따른 전자 디바이스를 나타내는 단면도이다. 도 9는 이중 사출 공정으로 전자 디바이스를 제작하는 공정을 설명하기 위한 도면이다. 도 10은 본 발명의 제2 실시예에 따른 전자 디바이스를 나타내는 단면도이다. 도 11은 본 발명의 제3 실시예에 따른 전자 디바이스를 나타내는 단면도이다. 도 12는 본 발명의 제4 실시예에 따른 전자 디바이스를 나타내는 단면도이다."}
