{"patent_id": "10-2022-0017847", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0121237", "출원번호": "10-2022-0017847", "발명의 명칭": "메타버스 포털 서비스 시스템", "출원인": "강성운", "발명자": "강성운"}}
{"patent_id": "10-2022-0017847", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "메타버스 포털 서비스 시스템에 있어서, 그 내부에 특이점을 유일한 시작점으로 하는 3차원 가상우주가 생성되고, 상기 특이점을 중심으로 3차원 가상우주 상에 개별 메타버스 생태계를 행성으로써 구현한 메타버스 행성;상기 메타버스 행성에 관한 객관적 정보가 행성의 크기와 특이점으로부터의 거리와 같은 물리적 정보를 사용하여 그래픽 및 문자로 명시되는 메타버스 포털서비스 인터페이스; 각 메타버스 행성 내 각 공간 및 각 메타버스 행성 간 가상의 우주공간에 위치하는 사물인터넷장치; 각 메타버스 행성 내 각 공간 및 각 메타버스 행성 간 가상의 우주공간에 위치하는 아바타;상기 메타버스 포털서비스 인터페이스 상에 그래픽 및 문자로써 구현되는 제반 정보를 출력하는 데이터를 저장한 본부;상기 본부와 네트워크망을 통해 연결된 메타버스 서비스 사업자;사용자에 의한 정보의 입출력을 지원하는 사용자 조작부; 및상기 사물인터넷장치마다 고유한 장치 아이디 부여를 위한 규범으로서 메타버스 사물인터넷 주소부여체계를 가지는 것을 특징으로 하는 메타버스 포털 서비스 시스템."}
{"patent_id": "10-2022-0017847", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 특이점을 정점으로 위로부터 계층적으로 구분되는 메타버스 행성 단계와, 지역 단계와, 장소 및 제조업자단계와, 사물인터넷장치 단계로 불연속적인 계층 공간 구분으로써 고유성이 특정되는 사물인터넷장치; 상기 사물인터넷장치에 대하여 상기 계층 공간 구분에 따른 고유성에 의한 위치식별자의 조합에 의거하여 부여되는 고유의 장치 아이디; 및 상기의 계층 공간 구분에 따른 고유성 구분을 위하여 상기 특이점을 기준으로 상부 공간에서 이격된 하부 공간으로의 불연속성과 도약을 나타내기 위한 수단으로써 상기 매 계층 공간 구분 간에 부가되는 특수기호로 구성되는 메타버스 사물인터넷 주소부여체계를 가지는 것을 특징으로 하는 메타버스 포털 서비스 시스템."}
{"patent_id": "10-2022-0017847", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 메타버스 사물인터넷 주소부여체계에 의하여 고유의 장치 아이디를 부여받은 사물인터넷장치가 네트워크망을 통해 메타버스 외부의 현실세계에 존재하는 사용자 조작부와 직접 통신이 가능하고;상기 사용자 조작부와의 연결을 통해 사용자의 제어를 받음으로써 메타버스 내 멀티미디어 정보를 전송하고, 만약 인공지능 기능이 부여된 경우 아바타와 상기 사용자 간 통신이 가능하고;상기 고유의 장치 아이디를 부여받은 사물인터넷장치가, 동일 메타버스 생태계 내지 타 메타버스 생태계 내 설치된 사물인터넷장치와 통신이 가능하도록 하는 상기 메타버스 사물인터넷 주소부여체계를 가지는 것을 특징으로 하는 메타버스 포털 서비스 시스템."}
{"patent_id": "10-2022-0017847", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 사업자에 의해 제공되는 여런 메타버스 서비스에 관한 산재한 정보를 3차원 인터페이스의 포털 사이트 구축을 통해 제공하고, 메타버스 내 사물인터넷장치에 고유 아이디를 부여를 통해 가상의 사물인터넷장치에 대한 조작을 가능하도록 하는 메타버스 포털 서비스 시스템에 관한 것이다."}
{"patent_id": "10-2022-0017847", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 사업자에 의해 제공되는 여런 메타버스 서비스에 관한 산재한 정보를 3차원 인터페이스의 포털 사이 트 구축을 통해 제공하고, 메타버스 내 사물인터넷장치에 고유 아이디를 부여를 통해 가상의 사물인터넷장치에 대한 조작을 가능하도록 하는 메타버스 포털 서비스 시스템에 관한 것이다."}
{"patent_id": "10-2022-0017847", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "현실공간에서 네트워크에 연결되는 사물인터넷장치의 증가 못지않게, 가상공간인 메타버스 서비스 내에서 현실 의 사물인터넷 수단을 가상화함으로써 현실을 구현하려는 수요가 존재한다. 또한, 메타버스 서비스를 제공하는 사이트에 대한 통합정보를 제공하는 포털 서비스가 없고, 가상세계 내에서 각 메타버스 생태계 간 소통을 위한 고유주소 체계 및 규범 또한 존재하지 않는다. 또한, 메타버스 생태계의 자율적 최적화 욕구와 인공지능 기술이 접합된다면, 메타버스 내 개별 구성원들은 지 능을 가지고 타 생태계와의 소통에 대한 수요가 증가할 것이므로, 이에 관한 선행 기술과 규범 마련이 시급하다. 선행기술문헌 특허문헌 (특허문헌 0001) JP 03677268 B2"}
{"patent_id": "10-2022-0017847", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 기존 기술의 한계를 개선하기 위해 안출된 것으로, 메타버스 생태계 자체의 최적화 시도 와 인공지능 기술이 접합될 경우 소통 강화를 시도할 것이므로, 메타버스 서비스를 통합적으로 관리하는 인터페 이스를 제공하는 포털 서비스를 제공하고, 각 메타버스 서비스 내 사물인터넷장치마다 부여되는 고유 주소체계 마련을 통해 타 메타버스 생태계 간 소통 강화와 보안을 위한 수단과 규범을 마련하는 것을 목적으로 한다."}
{"patent_id": "10-2022-0017847", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기의 목적을 이루고 종래 기술의 문제점을 해결하기 위한 본 발명에 관한 메타버스 포털서비스 시스템은, 사 용자 편의를 위해 각 메타버스 생태계가 3차원 가상우주 상에서 행성으로 구현되어 표시되는 메타버스 포털서비 스 인터페이스과, 네트워크를 통해 상기 메타버스 포털서비스를 관리하는 본부와, 네트워크망을 통해 상기 본부 와 연결되는 메타버스 서비스 사업자 및 사용자 조작부와, 별도의 규범인 메타버스 사물인터넷 주소부여체계로 구성된다. 본 발명의 일측을 이루는 메타버스 포털서비스 인터페이스는, 각 메타버스 서비스가 3차원 가상우주 상에 존재 하는 행성으로 구현되는 메타버스 행성과, 각 메타버스 행성 내 존재하는 아바타 및 사물인터넷장치와, 상기 메 타버스 행성으로 구현된 메타버스 서비스의 정점에 위치함으로써 가상우주의 시작점에 해당하는 특이점 (singularity)으로 구성된다. 본 발명의 또 다른 일측을 이루는 본부는, 상기 본부 내의 서버로 구성되며, 상기 서버는 메타버스 사업자에 관 한 포털 정보를 제공하기 위해 관련 정보를 저장하는 메타버스 서비스 사업자 테이블과, 메타버스 서비스 내 각 종 사물인터넷 장치에 관한 장치 정보 및 장치 아이디가 체계적으로 기록되는 장치아이디 테이블로 구성된다."}
{"patent_id": "10-2022-0017847", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "각 메타버스 생태계를 현실공간과 이어주는 가교가 되는 온라인 네트워크 부분을 상위 체계에 두고, 당해 상위 체계를 정점으로 하여 각 메타버스 서비스 사업자가 제공하는 메타버스 생태계를 구현한 메타버스 행성으로 분 기되며, 각 메타버스 생태계 내에 생성되는 각 가상세계로부터 다시 분기되는 지역 및 장소에 위치한 사물인터 넷 장치에 대하여 메타버스 사물인터넷 주소부여체계에 의거한 식별 가능한 고유 주소인 장치 아이디가 부여되 도록 할 수 있다. 또한, 본 발명에 따르면 상기의 수단으로써 생성되는 개별 메타버스 생태계가 3차원의 가상우주 내에 위치하게 되므로, 이러한 사용자 편의를 제고하는 인터페이스 제공을 통해 상기 인터페이스 내에서 구현되는 개별 메타버스 생태계의 확장과 특성에 관한 정보를 행성의 크기와 색상과 설명박스와 상기 특이점으로부터의 거리와 같은 물리적 특성을 통해 시각적으로 명료하게 구현할 수 있다. 또한, 본 발명에 따르면 상기의 수단으로써 가상의 우주 공간 내에서 이루어지는 각 메타버스 생태계의 확장 뿐 아니라 상기 특이점을 정점으로 하는 네트워크 구조 하에서 메타버스 사물인터넷 주소부여체계를 통해 각 생태 계 간 통신은 물론, 가상공간 내 메타버스 생태계와 현실공간 내 사용자 간 양방향 통신 역시 가능하게 함으로 써, 인공지능 기능 도입으로 인하여 가상공간 내 객체들 간 소통에 한정됨으로써 초래될 수도 있는 시스템적 편 향이나 보안상 결함을 방지하도록 할 수 있다. 또한, 본 발명에 따르면 상기 본부의 제어 하에 있는 상기 특이점이 계층적 구조에서 유일하게 정점의 지위를 가지는 가상우주 내 네트워크 구성을 통해, 인공지능에 의해 자율적으로 확장을 도모하는 메타버스 생태계에 의 하거나, 혹은 상기 메타버스 사물인터넷 주소부여체계를 악용할 목적으로 각 메타버스 생태계를 우회한 현실세 계에 대한 보안 위협에 대처하기 위한 보안준칙을 제공할 수 있다."}
{"patent_id": "10-2022-0017847", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면들 및 첨부된 도면들에 기재된 내용들을 참조하여 본 발명의 바람직한 실시예를 상세하게 설 명하지만, 본 발명이 실시예들에 의하여 제한되거나 한정되는 것은 아니다. 각 도면에 제시된 동일한 참조부호 는 동일한 부재를 나타낸다. 도 1에서 보듯, 본 발명에 의한 메타버스 포털서비스 시스템은, 사용자 편의를 위해 개별 메타버스 서비스가 가상우주 상에 존재하는 메타버스 행성으로 구현된 인터페이스인 메타버스 포털서비스 인터페이스와, 상기 메타버스 포털서비스 인터페이스에 표시되는 정보와 데이터를 저장 및 출력하고 관리하는 본부와, 네트 워크망을 통해 상기 본부와 연결되는 메타버스 서비스 사업자 및 사용자에 의한 입출력 수단인 사용자 조작부로 구성된다. 또한, 본 발명의 일측을 이루는 상기 메타버스 포털서비스 인터페이스는, 본 발명에 의하여 사용자 편의를 위한 인터페이스로 구현되는 3차원 가상우주의 좌표계가 시작되는 좌표인 x=0, y=0, z=0을 의미하는 특이점 과, 상기 특이점을 기준으로 가상우주 상 공간에 행성의 형태로 각 메타버스 서비스가 구현된 메타버스 행성 (78~80)과, 상기 메타버스 행성(78~80) 상에 존재하는 아바타와, 상기 메타버스 행성(78~80) 상에 존재하 는 사물인터넷기기(31~36)로 구성된다. 또한, 모든 메타버스 행성(78~80)은 상기 메타버스 포털서비스 인터페이스가 적용된 화상이 사용자 조작부 상 디스플레이 장치에 표시된다. 각 메타버스 행성(78~80)은 개별 메타버스 생태계를 나타내며, 상기 특이 점을 중심으로 하는 가상의 행성이 생성되는 경우 본 메타버스 포털 서비스 시스템에 의해 확장되는 독자적 생태계 구성도 가능하다. 또한, 본 발명의 일측을 이루는 상기 본부는, 상기 메타버스 포털서비스 인터페이스에 표시되는 화상을 출력하기 위한 데이터를 저장하고 사물인터넷장치의 고유정보와 장치 아이디를 맵핑 처리하는 서버가 내부 에 설치되고, 상기 서버 내부에는 사물인터넷장치(31~36)의 고유정보 및 장치 아이디 데이터가 체계적으로 기록되는 장치아이디 테이블과, 메타버스 서비스를 제공하는 사업자에 관한 정보 및 설정사항이 체계적으 로 기록되는 메타버스 서비스 사업자 테이블이 설치된다. 또한, 본 발명의 또 다른 일측을 이루는 메타버스 서비스 사업자 및 사용자 조작부는, 네트워크망을 통 해 상기 본부와 연결된다. 메타버스 서비스 사업자는, 신청에 의해 상기 본부 내 서버에 관련 정보를 등록할 수 있고, 본부의 조작에 의해 관련 정보를 수집한 후 등록할 수도 있다. 도 2에서 보듯, 본 발명에 의한 상기 메타버스 사물인터넷 주소부여체계는, 상기 특이점을 정점으로 위로 부터 각각 계층적으로 구분된 공간을 의미하는 메타버스 행성 단계, 지역 단계, 장소 및 제조업자 단계, 사물인 터넷장치 단계로 구분하여 고유 아이디를 부여하며, 상기와 같은 순서대로 상부에서 하부의 단계로 불연속적으 로 도약할 때마다 소정의 특수기호로 그 구분을 나타낸다. 일례를 들면, 제79호 메타버스 행성의 제A9호 지역의 제p5803호 장소 내에 설치된 제34호 감시카메라 사물 인터넷장치의 장치 아이디는 79:A9:p5803:34가 부여되고, 타 메타버스 행성의 제XG호 구역에서 제tg9w2 호 제조업자에 의해 가상의 상품으로 창출된 휴대전화 사물인터넷 장치는 78:XG:tg9w2:4A가 부여된다. 상기 의 예는 특이점을 정점으로 하는 계층적 구조와, 기호적 수단에 의거한 계층별 주소의 구분이 이루어져야 함 을 명시한 것이다. 또한, 메타버스 생태계 내 사물인터넷장치(31~36)에 대하여 고유한 장치 아이디 부여를 통해 메타버스 내에 설 치된 사물인터넷장치(31~36)를 개별 메타버스 생태계 간은 물론, 현실공간에 존재하는 사용자가 접속하여 감시 카메라를 관찰하고, 전자렌지를 작동시키고, 자동차를 조종하고, 휴대전화를 통해 메타버스 내부의 타 사용자와 통화를 실시하거나, 인공지능이 부여된 아바타와의 직접 통화가 가능하다. 산업상 이용가능성 본 발명은 상기와 같은 기존 기술의 한계를 개선하기 위해 안출된 것으로, 메타버스 생태계 자체의 최적화 시도 와 인공지능 기술이 접합될 경우, 확장을 위한 수단으로써 소통 강화를 시도할 것이므로, 메타버스 서비스를 통 합적으로 관리하는 인터페이스를 제공하는 포털 서비스와, 개별 메타버스 서비스 내 사물인터넷장치마다 부여되 는 고유 주소체계 부여를 통해 서로 다른 메타버스 생태계 간 소통 강화와 제어를 위한 기술적 근거 및 보안 준 칙을 제공할 수 있다."}
{"patent_id": "10-2022-0017847", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 관한 메타버스 포털서비스 시스템에 관한 개념도를 도시한 것이다. 도 2는 본 발명에 관한 메타버스 사물인터넷 주소부여체계에 관한 개념도를 도시한 것이다."}
