{"patent_id": "10-2008-7012346", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2008-0077134", "출원번호": "10-2008-7012346", "출원인": "크로스트리스 메디칼, 인코포레이티드", "발명자": "린, 콴, 쿠"}}
{"patent_id": "10-2008-7012346", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "슈피리어 부(superior portion), 인피리어 부(inferior portion) 및 상기 슈피리어 부와 인피리어 부를 한정하는 세퍼래이션 플래인(separation plane)을 갖는 골절되거나 콜랩스된(collapsed) 척추체를 치료하기 위한 디바이스에 있어서, 인테리어 홀딩 부(interior holding portion) 및 플렉서블 벽(flexible wall)을 갖는 해제가능하게 폐쇄된 필링 부재(releasably closed filling member)-상기 플렉서블 벽에는 제거가능한 봉합선들(sutures)로 폐쇄될 수있는 말단 단부의 개구부(opening)가 제공됨-;상기 필링 부재에 연결되는 샤프트 부; 및상기 홀딩 부와 연통하는 주입 부를 포함하며, 상기 필링 부재는 상기 세퍼래이션 플래인 내로 삽입하기에 적합한 콜랩스된 상태, 및 탄성 변형 없이 얻어지는사전-선택된 기하학적 구조를 갖는 확장된 상태를 갖고, 이에 의해 상기 척추체의 상기 슈피리어 부 및 인피리어 부는 다공성 뼈의 파괴적 콤팩션(destructive compaction) 없이 재정렬되고, 필러 재료가 상기 필링 부재와실질적으로 같은 사전-선택된 형상으로 경화되고 상기 척추체 내에서 유지되는 상기 필링 부재 내로 주입되는상기 필러 재료에 의해 지지되며, 이어서 상기 봉합선들의 제거 시 상기 필링 부재의 적출(withdraw)이 이어지는 것을 특징으로 하는 디바이스."}
{"patent_id": "10-2008-7012346", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 상기 세퍼래이션 플래인은 골절술(osteotomy)을 이용하여 형성되는 플래인을 포함하는 것을 특징으로 하는 디바이스."}
{"patent_id": "10-2008-7012346", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서, 척추체 내로 상기 필링 부재를 삽입하는 것은 그 안에서의 특정 방위 및 배치 중 1 이상을 포함하는 위치에서이루어져 척추 뼈 정렬의 제어되는 회복을 제공하는 것을 특징으로 하는 디바이스."}
{"patent_id": "10-2008-7012346", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서, 상기 필링 부재의 사전-선택된 형상은 색(sac), 볼, 실린더, 콘 및 직사각형 칼럼으로 이루어진 그룹 중 여하한의 기하학적 형태를 포함하는 것을 특징으로 하는 디바이스."}
{"patent_id": "10-2008-7012346", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서, 상기 필링 부재의 사전-선택된 형상은 선택된 척추체 또는 척추체의 영역에 적합한 것을 특징으로 하는 디바이스."}
{"patent_id": "10-2008-7012346", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서, 상기 디바이스는 상기 척추체의 슈피리어 부 및 인피리어 부에 연속적인 지지능력을 제공하는 것을 특징으로 하는 디바이스."}
{"patent_id": "10-2008-7012346", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "척추체 치료 방법에 있어서, - 2 -공개특허 10-2008-0077134상기 척추체의 인테리어에 접근하는 단계;상기 척추체의 슈피리어 부 및 인피리어 부를 한정하는 세퍼래이션 플래인을 생성하는 단계;상기 세퍼래이션 플래인 내로 사전-선택된 기하학적 구조를 갖는 확장가능한 디바이스를 도입시키는 단계; 및상기 척추체 인테리어 내에 보이드들(voids)을 생성시키거나 뼈를 콤팩팅하지 않고, 상기 디바이스 내로 필러재료를 주입하여 상기 척추체의 상기 인피리어 부에 대해 상기 슈피리어 부를 재위치시키는 단계를 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2008-7012346", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서, 상기 슈피리어 부 및 상기 인피리어 부는 상기 척추체의 종판들을 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2008-7012346", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 7 항에 있어서, 상기 척추체의 슈피리어 부 및 인피리어 부의 상대적인 재위치설정은 상기 종판들이 상기 재위치설정 이전 보다서로에 대해 평행하게 실질적으로 더 가까워지도록 하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2008-7012346", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 7 항에 있어서, 상기 척추체의 슈피리어 부 및 인피리어 부의 재위치설정 단계는 상기 부분들의 정렬 및 방위를 원래 상태 또는원하는 상태로 복원시키는 것을 특징으로 하는 방법."}
{"patent_id": "10-2008-7012346", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 7 항에 있어서, 상기 척추체의 인테리어에 접근되고 있고 척추 뼈가 재위치설정되고 있는 동안 연속적인 지지능력이 제공되는것을 특징으로 하는 방법."}
{"patent_id": "10-2008-7012346", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "콜랩스된 척추 뼈 치료용 서지컬 키트(surgical kit)에 있어서, 상기 척추체의 슈피리어 부 및 인피리어 부를 분리하는 플래인을 생성하기 위하여 뼈를 통해 나아가는 커팅 수단을 갖는 척추체의 인테리어에 접근하는 골절술 툴;인테리어 홀딩 부 및 말단 단부에 개구부를 갖는 플렉서블 벽으로 이루어진 사전-선택된 터미널 형상을 갖는 확장가능한 디바이스; 및사전-선택된 형상으로 척추 뼈 지지구조체를 형성하기 위해 경화될 수 있는 주입가능한 필러 재료를 포함하는것을 특징으로 하는 서지컬 키트."}
{"patent_id": "10-2008-7012346", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 12 항에 있어서, 상기 척추체의 슈피리어 부 및 인피리어 부는 서로에 대해 재위치설정되는 상기 척추체의 종판들을 포함하는 것을 특징으로 하는 서지컬 키트."}
{"patent_id": "10-2008-7012346", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 12 항에 있어서, 상기 확장가능한 디바이스는 선택된 척추체 또는 척추체의 영역에 적합한 사전-선택된 형상을 갖는 것을 특징으로 하는 서지컬 키트. - 3 -공개특허 10-2008-0077134청구항 15 척추 뼈의 인테리어에 지지능력을 제공하는 디바이스에 있어서, 척추체의 슈피리어 부 및 인피리어 부를 한정하는 세퍼래이션 플래인을 점유하는 경우 사전-선택된 기하학적 형상을 갖는 지지구조체를 포함하고, 상기 지지구조체는 선택적으로 적출가능하고 확장가능한 디바이스 내로 삽입될 수 있는 비-고체 형태를 가져, 상기 슈피리어 부 및 인피리어 부가 다공성 뼈의 콤팩션 없이 재정렬될 수 있도록 하는 것을 특징으로 하는 디바이스."}
{"patent_id": "10-2008-7012346", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "척추 뼈 용 지지구조체에 있어서, 척추체의 인테리어에 접근하는 단계;골절술 툴을 이용하여 상기 척추체의 슈피리어 부 및 인피리어 부를 한정하는 세퍼래이션 플래인을 생성하는 단계;상기 세퍼래이션 플래인 내에 위치되고 사전-선택된 기하학적 구조를 갖는 확장가능한 디바이스 내로 필러 재료를 주입하는 단계; 및상기 슈피리어 부 및/또는 상기 인피리어 부가 다공성 뼈의 콤팩션 없이 재정렬된 후에 상기 척추체로부터 확장가능한 디바이스를 제거하는 단계의 프로세스에 의해 얻어지는 것을 특징으로 하는 척추 뼈 용 지지구조체. 명 세 서기 술 분 야관련 출원들에 대한 원용 <1>본 출원은 2005년 11월 23일에 \"Devices and Methods for the Treatment of Bone Fracture\"라는 제목으로 출원 <2>된 미국특허 가출원 제 60/739,209 호의 35 U.S.C. §119 (e) 하의 혜택을 청구하며, 이 문헌은 전체적으로 본명세서에서 인용 참조 된다. 본 발명은 골절 치료와 관련하여 사용하기 위한 의학적 디바이스들 및 방법들에 관한 것이다. <3>배 경 기 술손상되거나 및/또는 약화된 척추뼈 및 쿠셔닝/연결 조직들을 위한 기존의 치료 체제들(treatment regimens)은 <4>감염의 우려가 있는(invasive) 절차들이며, 이는 환자에게 상당한 트라우마(trauma)를 야기한다. 감염 우려가최소화된 절차에서 골절된 척추뼈들을 치료하기 위한 시도로 2 가지 외과적 기술들이 개발되어 왔다.이러한 기술들 중 한 가지 기술, 즉 경피적 척추성형술(vertebroplasty)은 11-게이지 척추 바늘(11-gage <5>spinal needle) 또는 캐뉼라 디바이스(cannular device)를 통해 유동성 보강 재료, 통상적으로 폴리메틸메타크릴레이트[polymethylmethacrylate:PMMA-통상적으로 본시멘트(bone cement)라 알려짐]를 부상당한 척추체(vertebral body) 내로 주입하는 것과 관련되어 있다. 시멘트 주입 후 조금 뒤, 액체 충전 재료는 중합되고 경도(hardness)가 증가되어, 척추체를 내부적으로 바람직하게 지지하고, 통증을 경감시키며 주입된 척추체의 콜랩스(collapse)를 방지한다. 척추 골절 치료를 위한 또 다른 기술, 즉 경피적 척추후굴풍선복원술(kyphoplasty)은 경피적 척추성형술에 대해 <6>보다 최근에 개발된 수정기술이다. 경피적 척추후굴풍선복원술[볼룬-어시스트 경피적 척추성형술(balloon-assisted vertebroplasty)로도 알려짐]에서는, 확장가능한 디바이스가 손상된 척추체 내로 삽입된 후 뼈 내에서확장된다. 확장가능한 디바이스의 제거시, 이 절차는 뼈 내에 간극(void)을 생성하며, 처리 절차의 차별화된(distinct) 부분으로서 상기 간극은 본시멘트 또는 다른 부하 지지 재료로 충전되어 골절된 뼈의 부하-지지능력을 제공한다. 사실상, 상기 절차는 내부적 \"캐스트(cast)\"를 생성시켜, 뼈가 추가적으로 골절되거나 및/또는 콜랩스되는 것을 방지한다. 발명의 상세한 설명본 발명의 실시예들은 콜랩스로부터 초래된 척추뼈 변형의 치료를 위한 디바이스들 및 방법들을 제공한다. 본 <7>- 4 -공개특허 10-2008-0077134발명의 일 실시예에 따르면, 상기 디바이스는 필러 재료로 충전되는 경우 최종의 사전-선택된 크기 및 형상으로확장될 수 있는 필링 부재(filling member)를 포함한다. 필링 부재는 골절술 툴들(osteotomy tools)을 사용하여척추체를 가로질러 커팅함으로써 생성되는 척추체 내의 세퍼래이션 플래인(separation plane)을 따라 초기 콜랩스된 구조 내에 배치된다. 필링 부재의 확장은 세퍼래이션 플래인에 의하여 형성된 척추체의 슈피리어 부들(superior portions)과 인피리어 부들(inferior portions)이 재정렬되고 전체 또는 부분적으로 원래의 상태로복원되도록 한다. 필링 부재는 뼈의 내부로부터 제거되어, 확장된 필링 부재의 사전-선택된 기하학적 구조를 갖는 경화된 필러 재료로 이루어진 지지 구조체를 남긴다. 본 발명의 일 실시형태에 따르면, 필링 부재의 확장 및제거는 다공성(cancellous) 뼈의 콤팩션(compaction) 또는 척추뼈 내부에 지지되지 않는 보이드들 또는 캐비티들의 생성 없이 이루어진다. 본 발명의 또 다른 실시형태의 실시예에서, 슈피리어 부, 인피리어 부 및 슈피리어 부와 인피리어 부를 형성하 <8>는 세퍼래이션 플래인을 갖는 척추뼈 처리 용 디바이스는 인테리어 홀딩 부 및 말단부에 개구부가 제공되는 플렉서블 벽을 갖는 해제가능하게 폐쇄되는 필링 부재, 상기 필링 부재에 연결되는 샤프트 부 및 상기 홀딩부와연통되는 주입 부를 포함한다. 필링 부재는 세퍼래이션 플래인 내로 삽입하기 위한 콜랩스 상태 및 사전선택된기하학적 구조를 갖는 확장된 상태를 갖는다. 필링 부재 내로 주입되는 필러 재료는 필링 부재의 확장 및 다공성 뼈의 파괴적 콤팩션이 없는 척추체의 슈피리어 및 인피리어 부들의 재정렬을 가져온다. 슈피리어 및 인피리어 부들은 필링 부재와 실질적으로 같은 사전선택된 형상 내로 경화되고 필러 부재가 빠지고 난 뒤 척추체 내에남아 있을 수 있는 필러 재료에 의하여 지지된다. 실시형태의 또 다른 실시예에서, 본 발명은 먼저 척추체 내부에 접근시키는 단계 및 척추체의 슈피리어 및 인피 <9>리어 부를 형성하는 세퍼래이션 플래인을 생성하는 단계를 포함하는 척추체 치료를 위한 방법을 제공한다. 이실시예에 따르면, 사전선택된 기하학적 구조를 갖는 확장가능한 디바이스가 세퍼래이션 플래인 내로 도입되고,필러 재료가 상기 디바이스 내로 주입되어, 척추체의 인피리어 부에 대해 슈피리어 부를 재위치설정한다. 척추체의 슈피리어 및 인피리어 부들의 재위치설정은 척추체의 인테리어 내에 보이드들을 생성하거나 또는 뼈를 콤팩팅(compacting)하지 않고 이루어진다. 본 발명은 또 다른 실시예에서, 척추체의 인테리어에 접근하고 척추체의 슈피리어 및 인피리어 부를 분리하는 <10>플래인을 생성하기 위한 골절술 툴, 인테리어 유지 부 및 말단 단부에 개구부를 갖는 플렉서블 벽으로 이루어진사전선택된 터미널 형상을 갖는 확장가능한 디바이스, 및 사전선택된 형상을 갖는 지지구조체를 형성하기 위하여 경화될 수 있는 주입가능한 필러 재료를 포함하는 척추체 치료 용 서지컬 키트(surgical kit)를 제공한다. 본 발명의 또 다른 실시예에서, 척추체 인테리어 내에서의 지지를 제공하기 위한 디바이스는 척추체의 슈피리어 <11>및 인피리어 부를 형성하는 세퍼래이션 플래인을 점유하는 경우 사전선택된 기하학적 구조를 갖는 지지구조체를포함한다. 이 실시예에 따르면, 지지구조체는 선택적으로 적출가능하고 확장가능한 디바이스 내에 비고체 형태로 주입되어, 다공성 뼈의 콤팩션 없이 슈피리어 및 인피리어 부들이 재정렬될 수 있도록 한다. 본 발명의 추가 실시예에서, 척추 뼈를 위한 지지구조체는 먼저 척추체의 인테리어에 접근하는 단계 및 상기 척 <12>추체의 슈피리어 부 및 인피리어 부를 형성하는 세퍼래이션 플래인을 생성하기 위하여 골절술을 이용하는 단계로 이루어진 프로세스에 의하여 얻어진다. 필러 재료는 세퍼래이션 플래인 내에 위치되고 사전선택된 기하학적구조를 갖는 확장가능한 디바이스 내로 주입된다. 상기 확장가능한 디바이스는 슈피리어 부 및/또는 인피리어부가 다공성 뼈의 콤팩션 없이 재정렬된 후에 척추체로부터 제거되어, 지지구조체를 남긴다. 실 시 예다양한 실시예들 및 실시형태들에서, 본 발명은 사전결정된 형태, 볼륨 또는 공간 방위의 안정화 물체 또는 다 <17>른 지지구조체(60)(이하, 집합적으로 제한 없이 \"지지구조체\"라 지칭함)를 척추체(3) 또는 다른 뼈 내에 형성및/또는 배치하는데 사용하는 해제가능하게 폐쇄되고 선택적으로 적출가능한 디바이스 및 방법을 제공한다. 지지구조체(60)가 형성될 경우 다공성이거나 골절되거나 그렇지 않으면 병에 걸린 뼈를 치료하는데, 예컨대 슈피리어(2) 및 인피리어(4) 척추 종판의 상대적인 위치설정의 부분적 또는 완전한 복원에 유용할 수 있으며, 이에의해 상기 병에 걸린 척추로부터 초래될 수 있는 척추 후만증 또는 다른 척골 이상들(spinal conditions)에 유용할 수 있다. 본 발명의 실시형태들에 따르면, 개업의는 적출가능한 디바이스의 생성 또는 선택을 통해 지지구조체(60)의 예측가능한 형태 또는 기하학적 구조를 선택하거나 제공할 수 있다. 다른 실시예들에서, 지지구조체(60)의 형성을 위한 디바이스는 온전하게 남겨질 수 있으며, 여기서 상기 그것은 재흡수될 수도 있다. 도 1-3은 골절된 상태에서, 척추체(3)의 상부(2)에서 콜랩스되는 다공성이거나 그렇지 않으면 병에 걸린 척추체 <18>- 5 -공개특허 10-2008-0077134(3)를 나타내고 있다. 이러한 콜랩스는 골다공증을 앓고 있는 이들에게 영향을 미치는 압박 골절로부터 초래될수 있다. 이러한 골절을 치료하기 위하여, 본 발명의 일 실시형태의 실시예에서는 척추체(1) 내에 해제가능하게폐쇄된 필링 부재(10)가 삽입된다. 필링 부재(10) 및 그 사용 방식은 제한 없이, 계류중인 다음의 미국특허출원들: 2003년 9월 2일에 \"Extractable Filler for Inserting Medicine into Animal Tissue\"라는 제목으로 출원된10/652,470; 2003년 9월 2일에 \"Extractable Filler for Inserting Medicine into Animal Tissue\"라는 제목으로 출원된 10/651,988; 2004년 9월 27일에 \"Extractable Filler for Inserting Medicine into VertebralBody\"라는 제목으로 출원된 10/949,217; 그리고 다음의 가출원: 2005년 7월 5일에 \"Devices and Methods forthe Treatment of Bone Fracture\"라는 제목으로 출원된 60/697,260; 2005년 7월 7일에 \"Device for Deliveryof Bone Void Filling Materials\"라는 제목으로 출원된 60/697,146[이들 출원 모두는 공동 양도 계약(commonobligation of assignment)의 대상이 되며 본 명세서에서 인용참조되고 있음]에 기술된 여하한의 타입으로 이루어질 수 있다. 필수적인 것은 아니지만, 필링 부재(10)의 배치가 이루어지고, 반척추체(3)의 슈피리어 부(2)와인피리어 부(4) 사이에 세퍼래이션 플래인(35)의 생성된다. 척추체(3) 내의 세퍼래이션 플래인(35)의 존재는 비-골다공증 뼈의 트라우마 유발 골절(trauma induced fracture)의 조건에서 필링 부재(10)에 반응하는 척추 종판들의 정렬을 고려한 것이다. 척추체(3) 내의 세퍼래이션 플래인(35)의 존재는 다공성 뼈(40)의 파괴적(destructive) 콤팩션이 없는 척추 종판들의 정렬을 고려한 것이다. 일 실시예에서, 필링 부재(10)는 홀딩 부(20) 및 플렉서블 벽(30)을 포함한다. 홀딩 부(20) 및 플렉서블 벽(3 <19>0)은 배슬(vessel) 구조체를 구성할 수 있다. 플렉서블 벽(30)은 투과적이거나 밀폐형일 수 있다. 이는 몇몇 실시예들에서 필링 부재(10) 모두 또는 그 일부가 남겨질 수 있다면 바이오업저버블(bioabsorbable) 재료로 이루어질 수 있다. 필링 부재(10)는 일 단부에서 샤프트 부에 연결될 수 있다. 이것은 척추체(3)내의 통로 내로 삽입되거나 또는 본 발명에 따른 세퍼래이션 플래인(35) 내로 삽입될 수 있다. 본 발명의 특정 실시형태 실시예의한 가지 특징은 필링 부재(10)가 척추체(3)와 관련된 방위로 배치될 수 있다는 것이다. 이 경우에, 결과적으로나타나는 지지구조체(60)의 형상에는 회복된 척추체(70)에 대해 사전선택된 방위가 제공될 수 있다. 필링 부재(10)가 통로나 세퍼래이션 플래인(35) 내로 삽입되고 나면, 필러 재료(50)가 필링 부재(10) 내로 주입된다. 필러 재료(50)는 척추체(3) 내에 보이드가 생성되지 않고 필링 부재(10)의 사전선택된 형상 및 방위로가두어진다. 세퍼래이션 플래인(35)의 형성체는 척추체(3)를 슈피리어 부(2)와 인피리어 부(4)로 나눌 수 있다.필러 재료(50)는 뼈에 사용하기에 적합한 어떠한 인공생체성분(biocompatible) 재료로도 이루어질 수 있다. 필링 부재(10)는 본 발명의 일 실시형태에 따라 필러 재료(50)가 주입되면 예측가능한 형상으로 확장된다. 본 <20>발명의 일 실시형태에 따르면, 확장은 필링 부재(10)가 구성되는 재료의 탄성 변형 없이 콜랩스 상태로부터 확장된 상태로의 전이와 관련되어 있다. 다른 실시예들에서, 상기 재료는 1 이상의 영역들로 스트레칭될 수 있다.이와는 무관하게 본 발명의 일 실시형태에서, 필링 부재(10)는 원하는 정도까지 채워졌을 때를 가정하면 사전선택된 \"터미널\" 형태를 가질 수도 있다. 또한, 본 발명의 일 실시형태에서, 필링 부재(10)의 1 이상의 실시형태가 사전선택될 수도 있다. 제한 없는 일 예시를 위해, 필링 부재(10)의 리딩 에지(leading edge)는 척추체(3)의원하는 정도의 높이 복원을 달성하기 위하여 사전선택된 높이 및/또는 다른 치수를 가질 수 있다. 필링 부재(10)가 예측가능한 형상으로 확장되면, 슈피리어 부(2)는 척추체(3)에 대한 높이를 바람직하게 복원시키기 위하여 점진적으로 재위치될 수 있다. 이렇게 하는 과정에서 또는 높이가 충분히 복원되지 않는 경우에도, 척추체(3)의 슈피리어 부(2) 및 인피리어 부(4)와 각각 연관된 종판들은 서로에 대해 실질적으로 평행한 방위로 적어도 부분적으로 또는 몇몇 경우에는 완전히 복원될 수 있다. 척추 높이 및/또는 종판 평행 위치의 전체 또는 부분적인 복원을 가져오는 치료는 다공성 뼈(40) 또는 다른 내부 척추 뼈의 콤팩션이 없거나 최소의 콤팩션만 발생되는 본 발명의 일 실시형태에 따라 달성될 수 있다. 다른 실시예들에서 콤팩션이 일어난다면, 다공성 뼈(40)의 콤팩션의 특정 방향은 전문의에 의해 선택되는 예측가능한 형상의 필링 부재(10)에 의해 지정될 수 있다. 척추체(3) 내로 삽입되는 경우의 필링 부재(10)의 사용은, 계류중이거나 공동으로 소유되는 출원들 중 하나에 <21>기술된 것과 같은 본 발명의 실시형태에 따르면 척추체(30)의 복원 동안 연속적인 지지능력을 제공한다. 이와유사하게, 본 발명의 일 실시형태에 따르면 보이드들이나 캐비티들이나 여타 중공의 형성체 또는 여타 지지되지않는 공간들, 또는 척추체(3) 내의 기존 통로의 증가되는 볼륨에 대한 필요성이 부분적으로 또는 완전히 회피될수 있다. 셋팅에 앞서 필링 재료(50) 내의 유체 정역학적 압력 또는 세팅 동안과 그 후의 증가된 강도는 이러한연속적인 구조적 지지능력을 제공한다. 다른 실시예들에서, 이러한 연속적인 지지는, 반드시 고체일 필요가 없거나 본 명세서에 기술 및 나타낸 퇴적된(deposited) 지지구조체들(60)의 특성들을 갖는 다른 메커니즘들을 통해 제공될 수도 있다. 필링 부재(10)가 예측가능한 형상으로 확장되고 나면, 그 다음 필러 재료(50)는 점성이증가되는 한편 지지능력을 제공하기 위해 경화된다. 필러 재료(50)의 점성이 증가되고 나면, 필러 부재(10)는본 발명의 실시형태에 따라 뼈 내에 지지되지 않는 보이드의 형성 없이 척추체(3)로부터 제거될 수 있다. 보다- 6 -공개특허 10-2008-0077134높은 점성 또는 고체화된 필러 재료(50)로부터 기인한 지지구조체(60)는 회복된 척추체(70) 내에서 유지된다. 본 발명의 또 다른 실시형태의 실시예에서, 필러 부재(10)는 (사전선택되거나 또는 예측가능한 형상의 가정에 <22>의해 달성되거나 또는 달성되지 않을 수 있는) 사전선택된 볼륨으로 확장될 수 있다. 본 발명의 이 실시예에 따르면, 필러 재료(50)의 사전선택된 볼륨은 필러 부재(10) 내로 주입되거나 그렇지 않으면 퇴적된다. 필러 부재(10)는 사전결정된 볼륨으로 확장되어, 척추체(3) 슈피리어 부(2)의 적어도 일부(subset)의 제어되는 재배치를제공한다. 필링 부재(10)가 사전결정된 볼륨으로 확장되고 나면, 필러 재료(50)는 점성이 증가하고 고체화가 이루어진다. 필러 재료(50)의 점성이 증가되거나 고체화가 이루어지는 경우, 필러 부재(10)는 본 발명의 실시형태의 실시예에서 뼈 내에 지지되지 않는 보이드의 형성 없이 척추체(3)로부터 제거된다. 본 발명의 실시형태의 일실시예에서, 필러 재료(50)로부터 기인하며, 사전선택된 형태, 볼륨 및 공간적 방위를 갖는 지지구조체(60)는회복된 척추체(70) 내에서 유지된다. 본 발명의 일 실시예에서, 디바이스는 척추체(3) 내로 삽입되는 해제가능하게 폐쇄된 필링 부재(10)를 <23>포함한다. 필링 부재(10)는 플렉서블 벽(30) 및 인테리어 홀딩 부(20)를 포함할 수 있다. 홀딩 부(20)의 말단단부에서, 봉합선들(sutures)에 의해 임시로 폐쇄되는 개구부(opening)가 제공될 수도 있다. 홀딩 부(20) 내로필러 재료(50)를 주입한 후의 봉합선들의 제거는 개구부가 노출되도록 하고 필러 부재(10)가 척추체로부터 적출되도록 한다. 본 발명의 실시형태의 일 실시예에서, 필링 부재(10)는 예측가능하거나 여타 사전선택된 형태, 볼륨 및/또는 방 <24>위를 가지며 척추체(3) 내의 구멍으로 삽입된다. 그 다음, 필러 재료(50), 예컨대 본 시멘트(그러나 이것으로제한되지는 않음)가 주입 포트를 통해 필러 부재(10) 홀딩 부(20) 내로 주입된다. 주입 포트를 통해 필러 재료(50)가 삽입되면, 필링 부재(10)가 확장되고, 이에 의해 척추체(3)의 슈피리어 부(2) 및 인피리어 부(4) 모두또는 그 중 몇몇을 제어되고 연속적으로 지지되는 방식으로 재배치시킨다. 확장은 필러 부재(10)의 사전선택되거나 예측가능한 형태가 생성될 때까지 계속된다. 여기서, 필러 재료(50)는 본 발명의 실시형태에 따라 필링 부재(10)의 예측가능한 형태와 실질적으로 동일한 예측가능한 형태를 갖는 형상으로 고체화된다. 필러 재료(50)가고체화되고 나면, 필링 부재(10)는 척추체(3)로부터 제거될 수 있다. 고체화된 필러 재료로부터 기인한 고체 지지구조체(60)는, 본 발명의 실시형태에 따르면 회복된 척추체(70)를 위한 지지능력을 제공하기 위해 척추체(3)내에서 유지된다. 본 발명의 다른 실시형태들에서, 지지구조체(60)는 사전선택된 형상, 볼륨, 공간적 방위 또는여타 물리적 특징 중 1 이상의 특징을 갖는다.본 발명의 또 다른 실시형태의 일 실시예에서, 필링 부재(10)는 척추체(3) 내의 입구 통로와 인접한 세퍼래이션 <25>플래인(35) 내로 삽입된다. 세퍼래이션 플래인(35)은 기존의 외과적 기술들, 골절술 수단들 또는 당업계에서 알려지거나 개발될 다른 방법들을 이용하여 생성될 수 있다. 세퍼래이션 플래인(35)이 생성된 후에, 척추체(3)는2 개의 부분, 세퍼래이션 플래인(35) 위의 제 1 부분[슈피리어 부(2)] 및 세퍼래이션 플래인 아래의 제 2 부분[인피리어 부(4)]을 포함한다. 필링 부재(10) 내에 필러 재료를 주입하는 것은 척추체(3)의 슈피리어 부분(2)과인피리어 부분(4)의 분리를 가져온다. 필러 재료(50)는 필링 부재(10)가 사전선택된 형태, 볼륨 및/또는 방위로확장될 때까지 필링 부재(10) 내로 주입되거나 상기 필링 부재 내에 배치된다. 확장은 다공성 뼈(40)의 콤팩션또는 입구 통로의 볼륨 증가 없이 이루어진다. 본 발명의 실시형태의 일 실시예에서는, 확장 동안 필링 부재(10)가 척추체(3)를 위한 연속적인 지지능력을 제공한다. 그 다음, 필러 재료(50)는 또 다른 실시예의 실시형태에서 필링 부재(10)의 예측가능한 형태와 동일한 예측가능한 형태, 볼륨 및/또는 방위 또는 실질적으로 같은 형태, 볼륨 및/또는 방위로 이루어진 형상 또는 기하학적 구조로 고체화된다. 필러 재료(50)가 고체화되고 나면,필링 부재(10)가 척추체(3)로부터 제거될 수 있다. 고체화된 필러 재료로부터 기인한 지지구조체(60)는 회복된척추체(7)를 위한 지지능력을 제공하기 위해 척추체 내에 남겨진다. 본 발명의 실시형태의 일 실시예에 따른 필링 부재(10)는 확장 시 사전결정된 볼륨을 갖는다. 이 실시예에서, <26>필러 재료(50)는 주입되는 필러 재료(50)의 양이 확장 시 필링 부재(10)의 사전결정된 볼륨에 도달할 때까지 필링 부재(10) 내로 주입된다. 그 다음, 필러 재료(50)가 고체화되고 필러 부재(10)는 척추체(3)로부터 제거된다.고체화된 필러 재료로부터 기인한 고체 지지구조체(60)는 회복된 척추체(70)를 위한 지지능력을 제공하기 위해척추체(3) 내에 남겨진다. 본 발명의 또 다른 실시예에서, 필링 부재(10)는 척추체(3)를 위해 최대화된 회복 및 안정성을 고려한 특정 방 <27>위로 세퍼래이션 플래인(35) 내에 삽입된다. 이 실시예에서, 필링 부재(10)의 예측가능한 형태 및 척추체(3) 내의 필링 부재(10)의 배치는 생성되는 지지구조체(60)를 척추체(3) 내에서 특정 방위로 배치시키도록 선택된다.척추체(3)에 대한 이러한 특정한 방위는 특정 위치에서의 높이 복원을 도울 뿐만 아니라 회복된 척추체(70)를- 7 -공개특허 10-2008-0077134위해 최대의 지지능력을 제공하는 위치에 상기 지지구조체(60)를 배치시킨다. 본 발명 특정 실시형태의 실시예들의 또 다른 특징은 필링 부재(10) 및 생성되는 지지구조체(60)가 예측가능한 <28>형태를 갖는다는 것이다. 예측가능한 형태는 색(sac), 볼, 실린더, 콘, 직사각형 칼럼 또는 여타 기하학적 형태일 수 있다. 또한, 예측가능한 형태들은 필요한 높이 복원의 정도를 가장 잘 처리하기 위해 개개의 환자에 대해특수하게 설계될 수 있다. 예측가능한 형태의 일 예는, 보다 작은 면적의 단면을 갖는 실린더의 일 단부와 비교하여 그 대향되는 단부에서는 척추체의 콜랩스된 부분에 보다 가까운 위치에서 보다 큰 면적의 단면을 갖는 실린더이다. 대안적으로 예측가능한 형태는 실질적으로 관형(tubular)일 수 있다. 이 형태에서, 필러 부재 홀딩부의 길이방향 축선에 수직한 단면들은 실질적으로 타원형이고, 주입 부로부터 홀딩 부의 대향되는 단부로 이어지는 방향을 따라 증가되는 면적들을 갖는다. 대안적으로, 예측가능한 형태는 2 개의 개별적인 기하학적 형태들의 조합일 수 있다. 예를 들어, 예측가능한 형태는 일 단부에서는 직사각형 칼럼이고 다른 단부에서는 관형의형상일 수 있다. 직사각형 칼럼은 최대 높이 손실의 지점에서 보다 강한 지지능력을 제공하는 한편, 관형 형상부는 척추체(3)의 나머지 부분을 따라 보다 균일한 지지능력을 제공할 수 있다. 본 발명의 다양한 실시형태들의 다른 목적들, 장점들 및 실시예들은 후속 청구범위의 범위 내에 있으며, 당업자 <29>라면 명확히 이해할 수 있을 것이다. 예를 들어(그러나 제한 없이), 구조적 또는 기능적 요소들이 재 배치되거나, 본 발명과 일관되게 방법 단계들이 재배열될 수 있다. 또한, 본 발명의 실시예들은 골절술적 척추 압축 골절 또는 다른 등뼈 골절의 치료에 대해 기술되었으나, 본 발명에 따른 유사한 원리들 및 그들을 채용하는 시스템과 방법들은 다른 예에도 적용될 수 있으며, 이는 구체적으로 상세하게 설명하지 않더라도 후속 청구범위의범주 내에 포함된다. 도면의 간단한 설명본 발명은 후속하는 실시예 및 도면에 도시된 예시들을 참조하면 보다 쉽게 이해될 수 있으며, 상기 도면들은 <13>개략적이고 원래의 스케일대로 표현되어 있지 않다. 도 1은 본 발명의 일 실시예에 따른 골절되거나, 다공성이거나 그렇지 않으면 병에 걸린 척추체를 치료하기 위 <14>한 해제가능하게 폐쇄된 장치 및 방법의 실시형태를 나타낸 도이다. 도시된 바와 같이, 상기 장치는 배치되어있으나 채워지지 않은 상태이다. 도 2는 배치되고 부분적으로 채워진 상태의 도 1의 해제가능하게 폐쇄된 장치 및 척추체의 치료에 사용하기 위 <15>한 방법의 추가 실시형태를 나타내고 있다. 도 3은 회복된 척추체 내에서 유지되는 지지구초체를 나타내고 있다. <16>도면 도면1- 8 -공개특허 10-2008-0077134 도면2 도면3- 9 -공개특허 10-2008-0077134"}
{"patent_id": "10-2008-7012346", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은, 척추체의 슈피리어 부 및 인피리어 부를 분리하는 플래인 내에 배치되고 필러 재료의 주입을 통한 상 기 플래인을 따른 필링 부재의 확장 시 안정화 및 재정렬을 촉진하도록 배향될 수 있는 한편, 척추체 인테리어 내에서의 뼈의 콤팩팅을 최소화하거나 지지되지 않는 보이드의 생성을 최소화하는, 해제가능하게 폐쇄되고 제거 가능한 필링 부재를 포함하는 척추 뼈 치료 용 디바이스에 관한 것이다."}
{"patent_id": "10-2008-7012346", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "관련 출원들에 대한 원용 <1> 본 출원은 2005년 11월 23일에 \"Devices and Methods for the Treatment of Bone Fracture\"라는 제목으로 출원 <2> 된 미국특허 가출원 제 60/739,209 호의 35 U.S.C. §119 (e) 하의 혜택을 청구하며, 이 문헌은 전체적으로 본 명세서에서 인용 참조 된다. 본 발명은 골절 치료와 관련하여 사용하기 위한 의학적 디바이스들 및 방법들에 관한 것이다. <3>"}
{"patent_id": "10-2008-7012346", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "손상되거나 및/또는 약화된 척추뼈 및 쿠셔닝/연결 조직들을 위한 기존의 치료 체제들(treatment regimens)은 <4> 감염의 우려가 있는(invasive) 절차들이며, 이는 환자에게 상당한 트라우마(trauma)를 야기한다. 감염 우려가 최소화된 절차에서 골절된 척추뼈들을 치료하기 위한 시도로 2 가지 외과적 기술들이 개발되어 왔다. 이러한 기술들 중 한 가지 기술, 즉 경피적 척추성형술(vertebroplasty)은 11-게이지 척추 바늘(11-gage <5> spinal needle) 또는 캐뉼라 디바이스(cannular device)를 통해 유동성 보강 재료, 통상적으로 폴리메틸메타크 릴레이트[polymethylmethacrylate:PMMA-통상적으로 본시멘트(bone cement)라 알려짐]를 부상당한 척추체 (vertebral body) 내로 주입하는 것과 관련되어 있다. 시멘트 주입 후 조금 뒤, 액체 충전 재료는 중합되고 경 도(hardness)가 증가되어, 척추체를 내부적으로 바람직하게 지지하고, 통증을 경감시키며 주입된 척추체의 콜랩 스(collapse)를 방지한다. 척추 골절 치료를 위한 또 다른 기술, 즉 경피적 척추후굴풍선복원술(kyphoplasty)은 경피적 척추성형술에 대해 <6> 보다 최근에 개발된 수정기술이다. 경피적 척추후굴풍선복원술[볼룬-어시스트 경피적 척추성형술(balloon- assisted vertebroplasty)로도 알려짐]에서는, 확장가능한 디바이스가 손상된 척추체 내로 삽입된 후 뼈 내에서 확장된다. 확장가능한 디바이스의 제거시, 이 절차는 뼈 내에 간극(void)을 생성하며, 처리 절차의 차별화된 (distinct) 부분으로서 상기 간극은 본시멘트 또는 다른 부하 지지 재료로 충전되어 골절된 뼈의 부하-지지능력 을 제공한다. 사실상, 상기 절차는 내부적 \"캐스트(cast)\"를 생성시켜, 뼈가 추가적으로 골절되거나 및/또는 콜 랩스되는 것을 방지한다. 발명의 상세한 설명 본 발명의 실시예들은 콜랩스로부터 초래된 척추뼈 변형의 치료를 위한 디바이스들 및 방법들을 제공한다. 본 <7> - 4 -공개특허 10-2008-0077134발명의 일 실시예에 따르면, 상기 디바이스는 필러 재료로 충전되는 경우 최종의 사전-선택된 크기 및 형상으로 확장될 수 있는 필링 부재(filling member)를 포함한다. 필링 부재는 골절술 툴들(osteotomy tools)을 사용하여 척추체를 가로질러 커팅함으로써 생성되는 척추체 내의 세퍼래이션 플래인(separation plane)을 따라 초기 콜랩 스된 구조 내에 배치된다. 필링 부재의 확장은 세퍼래이션 플래인에 의하여 형성된 척추체의 슈피리어 부들 (superior portions)과 인피리어 부들(inferior portions)이 재정렬되고 전체 또는 부분적으로 원래의 상태로 복원되도록 한다. 필링 부재는 뼈의 내부로부터 제거되어, 확장된 필링 부재의 사전-선택된 기하학적 구조를 갖 는 경화된 필러 재료로 이루어진 지지 구조체를 남긴다. 본 발명의 일 실시형태에 따르면, 필링 부재의 확장 및 제거는 다공성(cancellous) 뼈의 콤팩션(compaction) 또는 척추뼈 내부에 지지되지 않는 보이드들 또는 캐비티 들의 생성 없이 이루어진다. 본 발명의 또 다른 실시형태의 실시예에서, 슈피리어 부, 인피리어 부 및 슈피리어 부와 인피리어 부를 형성하 <8> 는 세퍼래이션 플래인을 갖는 척추뼈 처리 용 디바이스는 인테리어 홀딩 부 및 말단부에 개구부가 제공되는 플 렉서블 벽을 갖는 해제가능하게 폐쇄되는 필링 부재, 상기 필링 부재에 연결되는 샤프트 부 및 상기 홀딩부와 연통되는 주입 부를 포함한다. 필링 부재는 세퍼래이션 플래인 내로 삽입하기 위한 콜랩스 상태 및 사전선택된 기하학적 구조를 갖는 확장된 상태를 갖는다. 필링 부재 내로 주입되는 필러 재료는 필링 부재의 확장 및 다공 성 뼈의 파괴적 콤팩션이 없는 척추체의 슈피리어 및 인피리어 부들의 재정렬을 가져온다. 슈피리어 및 인피리 어 부들은 필링 부재와 실질적으로 같은 사전선택된 형상 내로 경화되고 필러 부재가 빠지고 난 뒤 척추체 내에 남아 있을 수 있는 필러 재료에 의하여 지지된다. 실시형태의 또 다른 실시예에서, 본 발명은 먼저 척추체 내부에 접근시키는 단계 및 척추체의 슈피리어 및 인피 <9> 리어 부를 형성하는 세퍼래이션 플래인을 생성하는 단계를 포함하는 척추체 치료를 위한 방법을 제공한다. 이 실시예에 따르면, 사전선택된 기하학적 구조를 갖는 확장가능한 디바이스가 세퍼래이션 플래인 내로 도입되고, 필러 재료가 상기 디바이스 내로 주입되어, 척추체의 인피리어 부에 대해 슈피리어 부를 재위치설정한다. 척추 체의 슈피리어 및 인피리어 부들의 재위치설정은 척추체의 인테리어 내에 보이드들을 생성하거나 또는 뼈를 콤 팩팅(compacting)하지 않고 이루어진다. 본 발명은 또 다른 실시예에서, 척추체의 인테리어에 접근하고 척추체의 슈피리어 및 인피리어 부를 분리하는 <10> 플래인을 생성하기 위한 골절술 툴, 인테리어 유지 부 및 말단 단부에 개구부를 갖는 플렉서블 벽으로 이루어진 사전선택된 터미널 형상을 갖는 확장가능한 디바이스, 및 사전선택된 형상을 갖는 지지구조체를 형성하기 위하 여 경화될 수 있는 주입가능한 필러 재료를 포함하는 척추체 치료 용 서지컬 키트(surgical kit)를 제공한다. 본 발명의 또 다른 실시예에서, 척추체 인테리어 내에서의 지지를 제공하기 위한 디바이스는 척추체의 슈피리어 <11> 및 인피리어 부를 형성하는 세퍼래이션 플래인을 점유하는 경우 사전선택된 기하학적 구조를 갖는 지지구조체를 포함한다. 이 실시예에 따르면, 지지구조체는 선택적으로 적출가능하고 확장가능한 디바이스 내에 비고체 형태 로 주입되어, 다공성 뼈의 콤팩션 없이 슈피리어 및 인피리어 부들이 재정렬될 수 있도록 한다. 본 발명의 추가 실시예에서, 척추 뼈를 위한 지지구조체는 먼저 척추체의 인테리어에 접근하는 단계 및 상기 척 <12> 추체의 슈피리어 부 및 인피리어 부를 형성하는 세퍼래이션 플래인을 생성하기 위하여 골절술을 이용하는 단계 로 이루어진 프로세스에 의하여 얻어진다. 필러 재료는 세퍼래이션 플래인 내에 위치되고 사전선택된 기하학적 구조를 갖는 확장가능한 디바이스 내로 주입된다. 상기 확장가능한 디바이스는 슈피리어 부 및/또는 인피리어 부가 다공성 뼈의 콤팩션 없이 재정렬된 후에 척추체로부터 제거되어, 지지구조체를 남긴다. 실 시 예 다양한 실시예들 및 실시형태들에서, 본 발명은 사전결정된 형태, 볼륨 또는 공간 방위의 안정화 물체 또는 다 <17> 른 지지구조체(이하, 집합적으로 제한 없이 \"지지구조체\"라 지칭함)를 척추체 또는 다른 뼈 내에 형성 및/또는 배치하는데 사용하는 해제가능하게 폐쇄되고 선택적으로 적출가능한 디바이스 및 방법을 제공한다. 지 지구조체가 형성될 경우 다공성이거나 골절되거나 그렇지 않으면 병에 걸린 뼈를 치료하는데, 예컨대 슈피 리어 및 인피리어 척추 종판의 상대적인 위치설정의 부분적 또는 완전한 복원에 유용할 수 있으며, 이에 의해 상기 병에 걸린 척추로부터 초래될 수 있는 척추 후만증 또는 다른 척골 이상들(spinal conditions)에 유 용할 수 있다. 본 발명의 실시형태들에 따르면, 개업의는 적출가능한 디바이스의 생성 또는 선택을 통해 지지구 조체의 예측가능한 형태 또는 기하학적 구조를 선택하거나 제공할 수 있다. 다른 실시예들에서, 지지구조체 의 형성을 위한 디바이스는 온전하게 남겨질 수 있으며, 여기서 상기 그것은 재흡수될 수도 있다. 도 1-3은 골절된 상태에서, 척추체의 상부에서 콜랩스되는 다공성이거나 그렇지 않으면 병에 걸린 척추체 <18> - 5 -공개특허 10-2008-0077134를 나타내고 있다. 이러한 콜랩스는 골다공증을 앓고 있는 이들에게 영향을 미치는 압박 골절로부터 초래될 수 있다. 이러한 골절을 치료하기 위하여, 본 발명의 일 실시형태의 실시예에서는 척추체 내에 해제가능하게 폐쇄된 필링 부재가 삽입된다. 필링 부재 및 그 사용 방식은 제한 없이, 계류중인 다음의 미국특허출원 들: 2003년 9월 2일에 \"Extractable Filler for Inserting Medicine into Animal Tissue\"라는 제목으로 출원된 10/652,470; 2003년 9월 2일에 \"Extractable Filler for Inserting Medicine into Animal Tissue\"라는 제목으 로 출원된 10/651,988; 2004년 9월 27일에 \"Extractable Filler for Inserting Medicine into Vertebral Body\"라는 제목으로 출원된 10/949,217; 그리고 다음의 가출원: 2005년 7월 5일에 \"Devices and Methods for the Treatment of Bone Fracture\"라는 제목으로 출원된 60/697,260; 2005년 7월 7일에 \"Device for Delivery of Bone Void Filling Materials\"라는 제목으로 출원된 60/697,146[이들 출원 모두는 공동 양도 계약(common obligation of assignment)의 대상이 되며 본 명세서에서 인용참조되고 있음]에 기술된 여하한의 타입으로 이루 어질 수 있다. 필수적인 것은 아니지만, 필링 부재의 배치가 이루어지고, 반척추체의 슈피리어 부와 인피리어 부 사이에 세퍼래이션 플래인의 생성된다. 척추체 내의 세퍼래이션 플래인의 존재는 비 -골다공증 뼈의 트라우마 유발 골절(trauma induced fracture)의 조건에서 필링 부재에 반응하는 척추 종판 들의 정렬을 고려한 것이다. 척추체 내의 세퍼래이션 플래인의 존재는 다공성 뼈의 파괴적 (destructive) 콤팩션이 없는 척추 종판들의 정렬을 고려한 것이다. 일 실시예에서, 필링 부재는 홀딩 부 및 플렉서블 벽을 포함한다. 홀딩 부 및 플렉서블 벽(3 <19> 0)은 배슬(vessel) 구조체를 구성할 수 있다. 플렉서블 벽은 투과적이거나 밀폐형일 수 있다. 이는 몇몇 실 시예들에서 필링 부재 모두 또는 그 일부가 남겨질 수 있다면 바이오업저버블(bioabsorbable) 재료로 이루 어질 수 있다. 필링 부재는 일 단부에서 샤프트 부에 연결될 수 있다. 이것은 척추체내의 통로 내로 삽 입되거나 또는 본 발명에 따른 세퍼래이션 플래인 내로 삽입될 수 있다. 본 발명의 특정 실시형태 실시예의 한 가지 특징은 필링 부재가 척추체와 관련된 방위로 배치될 수 있다는 것이다. 이 경우에, 결과적으로 나타나는 지지구조체의 형상에는 회복된 척추체에 대해 사전선택된 방위가 제공될 수 있다. 필링 부재 가 통로나 세퍼래이션 플래인 내로 삽입되고 나면, 필러 재료가 필링 부재 내로 주입된다. 필 러 재료는 척추체 내에 보이드가 생성되지 않고 필링 부재의 사전선택된 형상 및 방위로 가두어진다. 세퍼래이션 플래인의 형성체는 척추체를 슈피리어 부와 인피리어 부로 나눌 수 있다. 필러 재료는 뼈에 사용하기에 적합한 어떠한 인공생체성분(biocompatible) 재료로도 이루어질 수 있다. 필링 부재는 본 발명의 일 실시형태에 따라 필러 재료가 주입되면 예측가능한 형상으로 확장된다. 본 <20> 발명의 일 실시형태에 따르면, 확장은 필링 부재가 구성되는 재료의 탄성 변형 없이 콜랩스 상태로부터 확 장된 상태로의 전이와 관련되어 있다. 다른 실시예들에서, 상기 재료는 1 이상의 영역들로 스트레칭될 수 있다. 이와는 무관하게 본 발명의 일 실시형태에서, 필링 부재는 원하는 정도까지 채워졌을 때를 가정하면 사전선 택된 \"터미널\" 형태를 가질 수도 있다. 또한, 본 발명의 일 실시형태에서, 필링 부재의 1 이상의 실시형태 가 사전선택될 수도 있다. 제한 없는 일 예시를 위해, 필링 부재의 리딩 에지(leading edge)는 척추체의 원하는 정도의 높이 복원을 달성하기 위하여 사전선택된 높이 및/또는 다른 치수를 가질 수 있다. 필링 부재 가 예측가능한 형상으로 확장되면, 슈피리어 부는 척추체에 대한 높이를 바람직하게 복원시키기 위하 여 점진적으로 재위치될 수 있다. 이렇게 하는 과정에서 또는 높이가 충분히 복원되지 않는 경우에도, 척추체 의 슈피리어 부 및 인피리어 부와 각각 연관된 종판들은 서로에 대해 실질적으로 평행한 방위로 적어 도 부분적으로 또는 몇몇 경우에는 완전히 복원될 수 있다. 척추 높이 및/또는 종판 평행 위치의 전체 또는 부 분적인 복원을 가져오는 치료는 다공성 뼈 또는 다른 내부 척추 뼈의 콤팩션이 없거나 최소의 콤팩션만 발 생되는 본 발명의 일 실시형태에 따라 달성될 수 있다. 다른 실시예들에서 콤팩션이 일어난다면, 다공성 뼈(4 0)의 콤팩션의 특정 방향은 전문의에 의해 선택되는 예측가능한 형상의 필링 부재에 의해 지정될 수 있다. 척추체 내로 삽입되는 경우의 필링 부재의 사용은, 계류중이거나 공동으로 소유되는 출원들 중 하나에 <21> 기술된 것과 같은 본 발명의 실시형태에 따르면 척추체의 복원 동안 연속적인 지지능력을 제공한다. 이와 유사하게, 본 발명의 일 실시형태에 따르면 보이드들이나 캐비티들이나 여타 중공의 형성체 또는 여타 지지되지 않는 공간들, 또는 척추체 내의 기존 통로의 증가되는 볼륨에 대한 필요성이 부분적으로 또는 완전히 회피될 수 있다. 셋팅에 앞서 필링 재료 내의 유체 정역학적 압력 또는 세팅 동안과 그 후의 증가된 강도는 이러한 연속적인 구조적 지지능력을 제공한다. 다른 실시예들에서, 이러한 연속적인 지지는, 반드시 고체일 필요가 없 거나 본 명세서에 기술 및 나타낸 퇴적된(deposited) 지지구조체들의 특성들을 갖는 다른 메커니즘들을 통 해 제공될 수도 있다. 필링 부재가 예측가능한 형상으로 확장되고 나면, 그 다음 필러 재료는 점성이 증가되는 한편 지지능력을 제공하기 위해 경화된다. 필러 재료의 점성이 증가되고 나면, 필러 부재는 본 발명의 실시형태에 따라 뼈 내에 지지되지 않는 보이드의 형성 없이 척추체로부터 제거될 수 있다. 보다 - 6 -공개특허 10-2008-0077134높은 점성 또는 고체화된 필러 재료로부터 기인한 지지구조체는 회복된 척추체 내에서 유지된다. 본 발명의 또 다른 실시형태의 실시예에서, 필러 부재는 (사전선택되거나 또는 예측가능한 형상의 가정에 <22> 의해 달성되거나 또는 달성되지 않을 수 있는) 사전선택된 볼륨으로 확장될 수 있다. 본 발명의 이 실시예에 따 르면, 필러 재료의 사전선택된 볼륨은 필러 부재 내로 주입되거나 그렇지 않으면 퇴적된다. 필러 부재 는 사전결정된 볼륨으로 확장되어, 척추체 슈피리어 부의 적어도 일부(subset)의 제어되는 재배치를 제공한다. 필링 부재가 사전결정된 볼륨으로 확장되고 나면, 필러 재료는 점성이 증가하고 고체화가 이 루어진다. 필러 재료의 점성이 증가되거나 고체화가 이루어지는 경우, 필러 부재는 본 발명의 실시형태 의 실시예에서 뼈 내에 지지되지 않는 보이드의 형성 없이 척추체로부터 제거된다. 본 발명의 실시형태의 일 실시예에서, 필러 재료로부터 기인하며, 사전선택된 형태, 볼륨 및 공간적 방위를 갖는 지지구조체는 회복된 척추체 내에서 유지된다. 본 발명의 일 실시예에서, 디바이스는 척추체 내로 삽입되는 해제가능하게 폐쇄된 필링 부재를 <23> 포함한다. 필링 부재는 플렉서블 벽 및 인테리어 홀딩 부를 포함할 수 있다. 홀딩 부의 말단 단부에서, 봉합선들(sutures)에 의해 임시로 폐쇄되는 개구부(opening)가 제공될 수도 있다. 홀딩 부 내로 필러 재료를 주입한 후의 봉합선들의 제거는 개구부가 노출되도록 하고 필러 부재가 척추체로부터 적출 되도록 한다. 본 발명의 실시형태의 일 실시예에서, 필링 부재는 예측가능하거나 여타 사전선택된 형태, 볼륨 및/또는 방 <24> 위를 가지며 척추체 내의 구멍으로 삽입된다. 그 다음, 필러 재료, 예컨대 본 시멘트(그러나 이것으로 제한되지는 않음)가 주입 포트를 통해 필러 부재 홀딩 부 내로 주입된다. 주입 포트를 통해 필러 재료 가 삽입되면, 필링 부재가 확장되고, 이에 의해 척추체의 슈피리어 부 및 인피리어 부 모두 또는 그 중 몇몇을 제어되고 연속적으로 지지되는 방식으로 재배치시킨다. 확장은 필러 부재의 사전선택되 거나 예측가능한 형태가 생성될 때까지 계속된다. 여기서, 필러 재료는 본 발명의 실시형태에 따라 필링 부 재의 예측가능한 형태와 실질적으로 동일한 예측가능한 형태를 갖는 형상으로 고체화된다. 필러 재료가 고체화되고 나면, 필링 부재는 척추체로부터 제거될 수 있다. 고체화된 필러 재료로부터 기인한 고체 지 지구조체는, 본 발명의 실시형태에 따르면 회복된 척추체를 위한 지지능력을 제공하기 위해 척추체 내에서 유지된다. 본 발명의 다른 실시형태들에서, 지지구조체는 사전선택된 형상, 볼륨, 공간적 방위 또는 여타 물리적 특징 중 1 이상의 특징을 갖는다. 본 발명의 또 다른 실시형태의 일 실시예에서, 필링 부재는 척추체 내의 입구 통로와 인접한 세퍼래이션 <25> 플래인 내로 삽입된다. 세퍼래이션 플래인은 기존의 외과적 기술들, 골절술 수단들 또는 당업계에서 알 려지거나 개발될 다른 방법들을 이용하여 생성될 수 있다. 세퍼래이션 플래인이 생성된 후에, 척추체는 2 개의 부분, 세퍼래이션 플래인 위의 제 1 부분[슈피리어 부] 및 세퍼래이션 플래인 아래의 제 2 부분 [인피리어 부]을 포함한다. 필링 부재 내에 필러 재료를 주입하는 것은 척추체의 슈피리어 부분과 인피리어 부분의 분리를 가져온다. 필러 재료는 필링 부재가 사전선택된 형태, 볼륨 및/또는 방위로 확장될 때까지 필링 부재 내로 주입되거나 상기 필링 부재 내에 배치된다. 확장은 다공성 뼈의 콤팩션 또는 입구 통로의 볼륨 증가 없이 이루어진다. 본 발명의 실시형태의 일 실시예에서는, 확장 동안 필링 부재 가 척추체를 위한 연속적인 지지능력을 제공한다. 그 다음, 필러 재료는 또 다른 실시예의 실시형태 에서 필링 부재의 예측가능한 형태와 동일한 예측가능한 형태, 볼륨 및/또는 방위 또는 실질적으로 같은 형 태, 볼륨 및/또는 방위로 이루어진 형상 또는 기하학적 구조로 고체화된다. 필러 재료가 고체화되고 나면, 필링 부재가 척추체로부터 제거될 수 있다. 고체화된 필러 재료로부터 기인한 지지구조체는 회복된 척추체를 위한 지지능력을 제공하기 위해 척추체 내에 남겨진다. 본 발명의 실시형태의 일 실시예에 따른 필링 부재는 확장 시 사전결정된 볼륨을 갖는다. 이 실시예에서, <26> 필러 재료는 주입되는 필러 재료의 양이 확장 시 필링 부재의 사전결정된 볼륨에 도달할 때까지 필 링 부재 내로 주입된다. 그 다음, 필러 재료가 고체화되고 필러 부재는 척추체로부터 제거된다. 고체화된 필러 재료로부터 기인한 고체 지지구조체는 회복된 척추체를 위한 지지능력을 제공하기 위해 척추체 내에 남겨진다. 본 발명의 또 다른 실시예에서, 필링 부재는 척추체를 위해 최대화된 회복 및 안정성을 고려한 특정 방 <27> 위로 세퍼래이션 플래인 내에 삽입된다. 이 실시예에서, 필링 부재의 예측가능한 형태 및 척추체 내 의 필링 부재의 배치는 생성되는 지지구조체를 척추체 내에서 특정 방위로 배치시키도록 선택된다. 척추체에 대한 이러한 특정한 방위는 특정 위치에서의 높이 복원을 도울 뿐만 아니라 회복된 척추체를 - 7 -공개특허 10-2008-0077134위해 최대의 지지능력을 제공하는 위치에 상기 지지구조체를 배치시킨다. 본 발명 특정 실시형태의 실시예들의 또 다른 특징은 필링 부재 및 생성되는 지지구조체가 예측가능한 <28> 형태를 갖는다는 것이다. 예측가능한 형태는 색(sac), 볼, 실린더, 콘, 직사각형 칼럼 또는 여타 기하학적 형태 일 수 있다. 또한, 예측가능한 형태들은 필요한 높이 복원의 정도를 가장 잘 처리하기 위해 개개의 환자에 대해 특수하게 설계될 수 있다. 예측가능한 형태의 일 예는, 보다 작은 면적의 단면을 갖는 실린더의 일 단부와 비교 하여 그 대향되는 단부에서는 척추체의 콜랩스된 부분에 보다 가까운 위치에서 보다 큰 면적의 단면을 갖는 실 린더이다. 대안적으로 예측가능한 형태는 실질적으로 관형(tubular)일 수 있다. 이 형태에서, 필러 부재 홀딩 부의 길이방향 축선에 수직한 단면들은 실질적으로 타원형이고, 주입 부로부터 홀딩 부의 대향되는 단부로 이어 지는 방향을 따라 증가되는 면적들을 갖는다. 대안적으로, 예측가능한 형태는 2 개의 개별적인 기하학적 형태들 의 조합일 수 있다. 예를 들어, 예측가능한 형태는 일 단부에서는 직사각형 칼럼이고 다른 단부에서는 관형의 형상일 수 있다. 직사각형 칼럼은 최대 높이 손실의 지점에서 보다 강한 지지능력을 제공하는 한편, 관형 형상 부는 척추체의 나머지 부분을 따라 보다 균일한 지지능력을 제공할 수 있다. 본 발명의 다양한 실시형태들의 다른 목적들, 장점들 및 실시예들은 후속 청구범위의 범위 내에 있으며, 당업자 <29> 라면 명확히 이해할 수 있을 것이다. 예를 들어(그러나 제한 없이), 구조적 또는 기능적 요소들이 재 배치되거 나, 본 발명과 일관되게 방법 단계들이 재배열될 수 있다. 또한, 본 발명의 실시예들은 골절술적 척추 압축 골 절 또는 다른 등뼈 골절의 치료에 대해 기술되었으나, 본 발명에 따른 유사한 원리들 및 그들을 채용하는 시스 템과 방법들은 다른 예에도 적용될 수 있으며, 이는 구체적으로 상세하게 설명하지 않더라도 후속 청구범위의 범주 내에 포함된다."}
