{"patent_id": "10-2021-0082471", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0000264", "출원번호": "10-2021-0082471", "발명의 명칭": "폴더블 디스플레이를 포함하는 전자 장치", "출원인": "삼성전자주식회사", "발명자": "배재현"}}
{"patent_id": "10-2021-0082471", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "폴더블 전자 장치에 있어서,상기 폴더블 전자 장치의 전면에 배치되는 플렉서블 디스플레이;상기 폴더블 전자 장치의 외관을 형성하여 일 축을 중심으로 폴딩이 가능한 하우징, 상기 하우징은 상기 플렉서블 디스플레이의 가장자리를 따라 형성되는 베젤(bezel)을 포함함;상기 플렉서블 디스플레이 상에 적층되는 박형 윈도우; 및상기 박형 윈도우와 상기 플렉서블 디스플레이의 다른 구성을 점착시키는 점착제가 도포되는 점착층을포함하고,상기 점착제는 제1 점착제 및 상기 제1 점착제와 구별되며 점착력이 약화될 수 있는 제2 점착제를 포함하고,상기 점착층은: 상기 제1 점착제가 도포되는 제1 영역, 및상기 제1 영역의 가장자리를 따라 형성되고, 상기 베젤에 상응하는 일 영역에 상기 제2 점착제가 도포되는 제2영역을 포함하는, 폴더블 전자 장치."}
{"patent_id": "10-2021-0082471", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 폴딩축과 인접한 상기 점착층의 상기 제2 영역은 상기 제1 영역의 가장자리의 일부를 커버함으로써 상기제1 영역을 상기 박형 윈도우에 고정하는, 폴더블 전자 장치."}
{"patent_id": "10-2021-0082471", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,상기 제2 영역은 제1 크기의 폭을 가지는 제1 부분과 상기 제1 크기보다 작은 제2 크기의 폭을 가지는 제2 부분을 포함하고,상기 제1 부분은 상기 폴딩축을 중심으로 인접하게 형성되는, 폴더블 전자 장치."}
{"patent_id": "10-2021-0082471", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서,상기 제2 영역은 제1 크기의 폭을 가지는 제1 부분과 상기 제1 크기보다 큰 제2 크기의 폭을 가지는 제2 부분을포함하고,상기 제2 영역의 상기 제2 부분은 폴딩축을 중심으로 인접하게 형성되며, 상기 폴딩축을 중심으로 인접한 상기제1 영역의 가장자리의 일부를 커버함으로써 상기 제1 영역을 상기 박형 윈도우에 고정하는, 폴더블 전자 장치."}
{"patent_id": "10-2021-0082471", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서,상기 제2 점착제는 열에 의해 발포되어 점착력이 약화되는, 폴더블 전자 장치."}
{"patent_id": "10-2021-0082471", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 1에 있어서,공개특허 10-2023-0000264-3-상기 제2 점착제는 UV(ultraviolet ray)에 의해 접착력이 약화되는 모노머(monomer) 또는 올리고머(oligomer)중 적어도 하나를 포함하는, 폴더블 전자 장치."}
{"patent_id": "10-2021-0082471", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 1에 있어서,상기 제1 점착제는 점착력이 약화될 수 있는 점착제를 포함하고,상기 제1 점착제는 제1 크기의 점착력을 가지며, 상기 제2 점착제는 상기 제1 크기보다 큰 제2 크기의 점착력을가지는, 폴더블 전자 장치."}
{"patent_id": "10-2021-0082471", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 1에 있어서,상기 박형 윈도우는 투명한 재질로 형성되는, 폴더블 전자 장치."}
{"patent_id": "10-2021-0082471", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 1에 있어서,상기 제1 영역의 경계면과 상기 제2 영역이 베젤에 의해 커버되는, 폴더블 전자 장치."}
{"patent_id": "10-2021-0082471", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 1에 있어서,상기 점착층에 의하여 상기 박형 윈도우 상에 점착되는 보호층(protect layer)을 포함하는, 폴더블 전자 장치."}
{"patent_id": "10-2021-0082471", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 1에 있어서,상기 폴딩축 상에 형성되는 상기 제2 영역은 상기 디스플레이 및 상기 박형 윈도우의 가장자리를 둘러싸는 영역까지 형성되어, 상기 디스플레이 및 상기 박형 윈도우를 고정시키는, 폴더블 전자 장치."}
{"patent_id": "10-2021-0082471", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "폴더블 전자 장치에 있어서,상기 폴더블 전자 장치의 전면에 배치되는 플렉서블 디스플레이;상기 폴더블 전자 장치의 외관을 형성하고, 일 축을 중심으로 폴딩이 가능한 하우징, 상기 하우징은 상기 플렉서블 디스플레이의 가장자리를 따라 형성되는 베젤(bezel)을 포함함; 상기 플렉서블 디스플레이 상에 적층되는 복수의 박형 윈도우, 상기 복수의 윈도우는:상기 플렉서블 디스플레이와 점착되는 제1 윈도우, 및상기 제1 윈도우 상에 점착되고, 일 면이 상기 폴더블 전자 장치의 외부로 노출되는 제2 윈도우를 포함함; 및 상기 플렉서블 디스플레이와 상기 복수의 윈도우 사이에 배치되어 상기 플렉서블 디스플레이와 상기 복수의 윈도우를 점착시키는 점착제가 도포되는 점착층을 포함하고,상기 점착제는 제1 점착제 및 상기 제1 점착제와 구별되고 점착력이 약화될 수 있는 제2 점착제를 포함하고,상기 점착층은:상기 제1 점착제가 도포되는 제1 영역, 및상기 제1 영역의 가장자리를 따라 형성되고, 상기 베젤에 상응하는 일 영역에 상기 제2 점착제가 도포되는 제2영역을 포함하는, 폴더블 전자 장치."}
{"patent_id": "10-2021-0082471", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "공개특허 10-2023-0000264-4-청구항 12에 있어서,상기 점착층은 상기 플렉서블 디스플레이와 상기 제1 윈도우를 점착시키는 제1 점착층 및 상기 제1 윈도우와 상기 제2 윈도우를 점착시키는 제2 점착층을 포함하고,상기 제1 점착층의 제2 점착제는 UV(ultraviolet ray)에 의해 접착력이 약화되는 모노머(monomer) 또는 올리고머(oligomer) 중 적어도 하나를 포함하며,상기 제2 점착층의 제2 점착제는 열에 의해 발포되어 점착력이 약화되는 점착제를 포함하는, 폴더블 전자 장치."}
{"patent_id": "10-2021-0082471", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 12에 있어서,상기 베젤에 의하여 상기 점착층의 상기 제1 영역과 상기 제2 영역의 경계가 커버되는, 폴더블 전자 장치."}
{"patent_id": "10-2021-0082471", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "청구항 13에 있어서,상기 제2 점착층의 상기 제2 점착제에 의하여 외부로 노출되는 상기 제2 윈도우만 선택적으로 분리 가능한, 폴더블 전자 장치."}
{"patent_id": "10-2021-0082471", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "에 있어서,상기 점착층에 의하여 상기 박형 윈도우 상에 점착되는 보호층(protect layer)을 포함하는, 폴더블 전자 장치."}
{"patent_id": "10-2021-0082471", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "청구항 16에 있어서,상기 폴딩축과 인접한 상기 점착층의 상기 제2 영역은 상기 제1 영역의 가장자리의 일부를 커버함으로써 상기제1 영역을 상기 박형 윈도우에 고정하는, 폴더블 전자 장치."}
{"patent_id": "10-2021-0082471", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "청구항 16에 있어서,상기 제2 점착제는 열에 의해 발포되어 점착력이 약화되는, 폴더블 전자 장치."}
{"patent_id": "10-2021-0082471", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "청구항 16에 있어서,상기 박형 윈도우는 투명한 재질로 형성되는, 폴더블 전자 장치.공개특허 10-2023-0000264-5-청구항 20"}
{"patent_id": "10-2021-0082471", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 다양한 실시 예에 따른, 폴더블 전자 장치는 상기 폴더블 전자 장치의 전면에 배치되는 플렉서블 디스 플레이, 상기 폴더블 전자 장치의 외관을 형성하여 일 축을 중심으로 폴딩이 가능한 하우징, 상기 하우징은 상기 플렉서블 디스플레이의 가장자리를 따라 형성되는 베젤(bezel)을 포함하고, 상기 플렉서블 디스플레이 상에 적층 되는 박형 윈도우, 및 상기 박형 윈도우와 상기 플렉서블 디스플레이의 다른 구성을 점착시키는 점착제가 도포되 는 점착층을 포함하고, 상기 점착제는 제1 점착제 및 상기 제1 점착제와 구별되며 점착력이 약화될 수 있는 제2 점착제를 포함하고, 상기 점착층은 상기 제1 점착제가 도포되는 제1 영역, 및 상기 제1 영역의 가장자리를 따라 형성되고, 상기 베젤에 상응하는 일 영역에 상기 제2 점착제가 도포되는 제2 영역을 포함할 수 있다. 이 외에도 명세서를 통해 파악되는 다양한 실시 예가 가능하다."}
{"patent_id": "10-2021-0082471", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 문서에서 개시되는 다양한 실시 예들은, 폴더블 디스플레이를 포함하는 전자 장치에 관한 것이다."}
{"patent_id": "10-2021-0082471", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전자 장치의 발달에 따라 다양한 디스플레이를 포함하는 전자 장치가 개발되고 있다. 최근에는 새롭고 다양한 기능을 원하는 사용자의 요구에 부합하기 위해 다양한 형태의 디스플레이가 개발되고 있다. 대표적인 예로 접히 고 펼쳐지는(folding and unfolding) 폴더블 디스플레이를 포함하는 전자 장치가 있다. 또한, 디스플레이는 전자 장치의 외관을 형성하므로 외부의 충격에 쉽게 손상될 수 있다. 따라서 일반적으로 디 스플레이를 포함하는 전자 장치는 단일 또는 복수개의 윈도우를 포함함으로써 디스플레이를 보호할 수 있다."}
{"patent_id": "10-2021-0082471", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "디스플레이를 포함하는 전자 장치는 디스플레이의 보호를 위해 복수의 윈도우가 포함될 수 있다. 외부의 충격으 로 디스플레이 장치에 포함된 윈도우들 중 적어도 하나의 윈도우만 파손된 경우 손상된 윈도우만 교체하면 디스 플레이가 수리될 수 있다. 다만, 윈도우는 디스플레이 장치의 다른 구성과 분리되지 않도록 접착될 수 있다. 이 에 디스플레이를 구성하는 모듈 전체를 교체해야 하며, 그로 인해 교체 비용이 증가하고 교체된 디스플레이는 재생이 어려운 문제가 발생할 수 있다. 상기 교체 문제를 해결하기 위해 접착력이 약한 점착제를 사용하는 경우에는 실생활에서 복수의 윈도우와 디스 플레이가 자연적으로 분리되는 문제가 발생할 수 있다."}
{"patent_id": "10-2021-0082471", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 다양한 실시 예에 따른, 폴더블 전자 장치는 상기 폴더블 전자 장치의 전면에 배치되는 플렉서블 디 스플레이, 상기 폴더블 전자 장치의 외관을 형성하여 일 축을 중심으로 폴딩이 가능한 하우징, 상기 하우징은 상기 플렉서블 디스플레이의 가장자리를 따라 형성되는 베젤(bezel)을 포함하고, 상기 플렉서블 디스플레이 상 에 적층되는 박형 윈도우, 및 상기 박형 윈도우와 상기 플렉서블 디스플레이의 다른 구성을 점착시키는 점착제 가 도포되는 점착층을 포함하고, 상기 점착제는 제1 점착제 및 상기 제1 점착제와 구별되며 점착력이 약화될 수 있는 제2 점착제를 포함하고, 상기 점착층은 상기 제1 점착제가 도포되는 제1 영역, 및 상기 제1 영역의 가장자 리를 따라 형성되고, 상기 베젤에 상응하는 일 영역에 상기 제2 점착제가 도포되는 제2 영역을 포함할 수 있다. 본 개시의 다양한 실시 예에 따른, 폴더블 전자 장치는 상기 폴더블 전자 장치의 전면에 배치되는 플렉서블 디 스플레이, 상기 폴더블 전자 장치의 외관을 형성하고, 일 축을 중심으로 폴딩이 가능한 하우징, 상기 하우징은 상기 플렉서블 디스플레이의 가장자리를 따라 형성되는 베젤(bezel)을 포함하고, 상기 플렉서블 디스플레이 상 에 적층되는 복수의 박형 윈도우, 상기 복수의 윈도우는 상기 플렉서블 디스플레이와 점착되는 제1 윈도우, 및 상기 제1 윈도우 상에 점착되고, 일 면이 상기 폴더블 전자 장치의 외부로 노출되는 제2 윈도우를 포함하고, 상 기 플렉서블 디스플레이와 상기 복수의 윈도우 사이에 배치되어 상기 플렉서블 디스플레이와 상기 복수의 윈도 우를 점착시키는 점착제가 도포되는 점착층을 포함하고, 상기 점착제는 제1 점착제 및 상기 제1 점착제와 구별 되고 점착력이 약화될 수 있는 제2 점착제를 포함하고, 상기 점착층은 상기 제1 점착제가 도포되는 제1 영역, 및 상기 제1 영역의 가장자리를 따라 형성되고, 상기 베젤에 상응하는 일 영역에 상기 제2 점착제가 도포되는 제2 영역을 포함할 수 있다. 본 개시의 다양한 실시 예에 따른, 폴더블 전자 장치는 상기 폴더블 전자 장치의 전면에 배치되는 플렉서블 디 스플레이, 상기 폴더블 전자 장치의 외관을 형성하여 일 축을 중심으로 폴딩이 가능한 하우징, 상기 하우징은 상기 플렉서블 디스플레이의 가장자리를 따라 형성되는 베젤(bezel)을 포함하고, 상기 플렉서블 디스플레이 상 에 적층되는 박형 윈도우, 및 상기 박형 윈도우와 상기 플렉서블 디스플레이의 다른 구성을 점착시키는 점착제 가 도포되는 점착층을 포함하고, 상기 점착제는 제1 점착제 및 상기 제1 점착제와 구별되며 점착력이 약화될 수 있는 제2 점착제를 포함하고, 상기 점착층은 상기 제1 점착제가 도포되며 외부로 노출되는 제1 영역, 및 상기 베젤에 의해 가려지며 상기 제1 영역의 가장자리를 따라 형성되고, 상기 제2 점착제가 도포되는 제2 영역을 포 함할 수 있다."}
{"patent_id": "10-2021-0082471", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 문서에 개시되는 다양한 실시 예에 따르면, 폴더블 전자 장치의 플렉서블 디스플레이 상에는 두 종류의 점착 제가 도포되는 점착층이 포함될 수 있다. 상기 점착제의 점착력을 달리함으로써 플렉서블 디스플레이상에서 파 손된 윈도우가 용이하게 교체될 수 있다. 예를 들어, 파손된 윈도우만을 선택적으로 교체할 수 있다. 이를 통해 부품의 수명이 증가하고 전자 장치의 품질이 향상될 수 있다. 또한 다양한 실시 예에 따르면, 두 종류의 점착제는 점착층에 배치되는 영역을 달리하여 도포될 수 있다. 도포 되는 영역을 달리함으로써 점착층에 점착되는 특정 윈도우가 용이하게 교체될 수 있다. 예를 들어, 일부 영역에 지정된 조건(예를 들어, 지정된 온도 또는 레이저 조사)에서 점착력이 약화되는 점착제가 배치되고, 나머지 영 역에 투명 점착제가 배치될 수 있다. 이를 통해, 점착제로 인한 디스플레이 영역의 손실을 방지하면서도 자연 분리 문제 및 교체 비용의 문제가 해결될 수 있다. 또한, 다양한 실시 예에 따르면 두 종류의 점착제가 형성하는 구조를 이용하여 점착제 간의 결합력이 향상된 폴 더블 디스플레이가 제공될 수 있다. 이를 통해 전자 장치를 사용하는 과정에서 발생하는 윈도우의 자연 분리가 방지될 수 있다. 이 외에, 본 문서를 통해 직접적 또는 간접적으로 파악되는 다양한 효과들이 제공될 수 있다."}
{"patent_id": "10-2021-0082471", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 다양한 실시 예가 첨부된 도면을 참조하여 기재된다. 그러나, 이는 본 발명을 특정한 실시 형 태에 대해 한정하려는 것이 아니며, 본 발명의 실시 예의 다양한 변경(modification), 균등물(equivalent), 및/ 또는 대체물(alternative)을 포함하는 것으로 이해되어야 한다. 도 1은 일 실시 예에 따른 펼쳐진 상태(unfolded state)의 전자 장치를 도시한다. 도 2는 일 실시 예에 따른 접힌 상태(folded state)의 전자 장치를 도시한다. 도 1은 일 실시 예에 따른, 펼쳐진 상태(unfolded state)의 전자 장치를 도시한다. 도 2는 일 실시 예에 따른, 접힌 상태(folded state)의 전자 장치를 도시한다. 도 1 및 도 2를 함께 참조하면, 일 실시 예에서, 전자 장치는, 폴더블 하우징(이하, 줄여서 \"하우 징\") 및 하우징에 의해 형성된 공간 내에 배치된 플렉서블(flexible) 또는 폴더블(foldable) 디스플 레이(이하, 줄여서, \"디스플레이\")를 포함할 수 있다. 본 문서에서는 디스플레이가 배치된 면을 제1 면 또는 전자 장치의 전면으로 정의한다. 그리고 전면의 반대 면을 제2 면 또는 전자 장치의 후 면으로 정의한다. 또한 전면과 후면 사이의 공간을 둘러싸는 면을 제3 면 또는 전자 장치의 측면으로 정의 한다. 일 실시 예에서, 하우징은 도 1의 펼침 상태에서, 실질적으로 직사각형의 형상을 가질 수 있다. 예를 들어, 하우징은 지정된 폭(W1) 및 상기 지정된 폭(W1) 보다 긴 지정된 길이(L1)를 가질 수 있다. 또 다른 예로, 하우징은 지정된 폭(W1) 및 상기 지정된 폭(W1)과 실질적으로 동일하거나, 보다 짧은 지정된 길이 (L1)를 가질 수 있다. 예를 들어, 상기 지정된 폭(W1)은 디스플레이의 폭일 수 있다. 일 실시 예에서, 전 자 장치의 하우징은 상기 직사각형의 긴 가장자리(예: 도 1에서 전자 장치의 하우징의 가 장자리들 중 y 축 방향을 향하는 가장자리)와 실질적으로 평행한 폴딩 축(A)을 기준으로 접히거나 펼쳐질 수 있 다. 일 실시 예에서, 하우징은, 제1 하우징, 제2 하우징, 및 연결부를 포함할 수 있다. 연결부 는 제1 하우징 및 제2 하우징 사이에 배치될 수 있다. 연결부는 제1 하우징 및 제2 하우징과 결합될 수 있고, 제1 하우징 및/또는 제2 하우징은 연결부(또는 폴딩 축(A))를 중심으로 회전할 수 있다. 일 실시 예에서, 제1 하우징은 제1 측면 부재 및 제1 후면 커버를 포함할 수 있다. 일 실시 예에서, 제2 하우징은 제2 측면 부재 및 제2 후면 커버를 포함할 수 있다. 일 실시 예에서, 제1 측면 부재는 제1 하우징의 가장자리를 따라 연장될 수 있고, 전자 장치의 측면의 적어도 일부분을 형성할 수 있다. 제1 측면 부재는 도전성 물질(예: 금속)로 형성된 적어도 하나 의 도전성 부분을 포함할 수 있다. 상기 도전성 부분은 RF 신호를 송신 및/또는 수신하기 위한 안테나 방사체로 동작할 수 있다. 제1 측면 부재와 유사하게, 제2 측면 부재는 전자 장치의 측면의 일부분을 형성할 수 있고, 제2 측면 부재의 적어도 일부분은 도전성 물질로 형성되어 안테나 방사체로 동작할 수 있다. 일 실시 예에서, 제1 측면 부재 및 제2 측면 부재는 폴딩 축(A)을 중심으로 양측에 배치되고, 폴딩 축(A)에 대하여 실질적으로 대칭인 형상을 가질 수 있다. 일 실시 예에서, 제1 측면 부재 및 제2 측면 부재가 서로 이루는 각도나 거리는 전자 장치의 상태가 펼침 상태인지, 접힘 상태인지, 또는 중간 상태인지 여부에 따라 달라질 수 있다. 일 실시 예에서, 하우징은 디스플레이를 수용하는 리세스를 형성할 수 있다. 상기 리세스는 디스플레 이의 형상과 대응될 수 있다. 일 실시 예에서, 센서 영역은 제2 하우징의 일 코너에 인접하여 소정 영역을 가지도록 형성될 수 있 다. 다만 센서 영역의 배치, 형상, 및 크기는 도시된 예시에 한정되지 아니한다. 예를 들어, 다른 실시 예 에서 센서 영역은 하우징의 다른 코너 혹은 상단 코너와 하단 코너 사이의 임의의 영역에 제공될 수 있다. 또 다른 예로, 센서 영역은 생략될 수도 있다. 예를 들어, 센서 영역에 배치되는 부품들 (components)은 디스플레이의 하부에 배치되거나, 하우징의 다른 위치에 배치될 수 있다. 일 실시 예 에서, 전자 장치에 내장된 다양한 기능을 수행하기 위한 부품들(components)이 센서 영역을 통해, 또 는 센서 영역에 마련된 하나 이상의 개구(opening)를 통해 전자 장치의 전면에 노출될 수 있다. 다양 한 실시 예에서, 상기 부품들은 다양한 종류의 센서들을 포함할 수 있다. 상기 센서는, 예를 들어, 전면카메라, 리시버 또는 근접 센서 중 적어도 하나를 포함할 수 있다. 일 실시 예에서, 제1 후면 커버는 전자 장치의 후면에서 제1 하우징에 배치될 수 있다. 제1 후 면 커버는 실질적으로 직사각형인 가장자리를 가질 수 있다. 제1 후면 커버와 유사하게, 상기 제2 후면 커버는 전자 장치의 후면에서 제2 하우징에 배치될 수 있다. 일 실시 예에서, 제1 후면 커버 및 제2 후면 커버는 상기 폴딩 축(A)을 중심으로 실질적으로 대칭 적인 형상을 가질 수 있다. 다만, 제1 후면 커버 및 제2 후면 커버가 반드시 상호 대칭적인 형상을 가지는 것은 아니며, 다른 실시 예에서, 전자 장치는 다양한 형상의 제1 후면 커버 및/또는 제2 후 면 커버를 포함할 수 있다. 또 다른 실시 예에서, 제1 후면 커버는 제1 측면 부재와 일체로 형성될 수 있고, 제2 후면 커버는 제2 측면 부재와 일체로 형성될 수 있다. 일 실시 예에서, 제1 후면 커버, 제2 후면 커버, 제1 측면 부재, 및 제2 측면 부재는 전자 장치의 다양한 부품들(예: 인쇄회로기판, 또는 배터리)이 배치될 수 있는 공간을 형성할 수 있다. 일 실시 예에서, 전자 장치의 후면에는 하나 이상의 부품(components)이 배치되거나 시각적으로 노출될 수 있다. 예를 들어, 제1 후면 커버의 적어도 일 영역을 통해 서브 디스플레이의 적어도 일부가 시각적 으로 노출될 수 있다. 예를 들어, 서브 디스플레이는 제1 후면 커버의 전체 영역을 통해 시각적으로 노출될 수 있으나, 서브 디스플레이가 노출되는 영역이 상술한 예시에 한정되는 것은 아니다. 다른 예를 들어, 제2 후면 커버의 적어도 일 영역을 통해 후면 카메라가 시각적으로 노출될 수 있다. 또 다른 예로, 전자 장치의 후면의 일 영역에 후면 카메라가 배치될 수 있다. 전자 장치의 하우징은 도 1 및 2에 도시된 형태 및 결합으로 제한되지 않으며, 다른 형상이나 부품의 조합 및/또는 결합에 의해 구현될 수 있다. 도 2를 참조하면, 연결부는 제1 하우징 및 제2 하우징이 상호 회전 가능하도록 구현될 수 있다. 예를 들어, 연결부는 제1 하우징 및 제2 하우징과 결합된 힌지 구조를 포함할 수 있다. 일 실시 예에서, 연결부는 제1 측면 부재와 제2 측면 부재 사이에 배치되어, 내부 부품(예를 들어, 상 기 힌지 구조)을 가리기 위한 힌지 커버를 포함할 수 있다. 일 실시 예에서, 힌지 커버는, 상기 전자 장치의 상태(펼침 상태(flat state) 또는 접힘 상태(folded state))에 따라, 제1 측면 부재 및 제2 측면 부재의 일부에 의해 가려지거나, 외부로 노출될 수 있다. 예를 들어, 힌지 커버는, 상기 전자 장치의 상태(펼침 상태(flat state) 또는 접힘 상태(folded state)에 따라, 외부로 노출되는 영역의 크기 가 변경될 수 있다. 일례로, 도 1에 도시된 바와 같이 전자 장치가 펼침 상태인 경우, 힌지 커버의 적어도 일부는 제1 측 면 부재 및 제2 측면 부재에 의해 가려져 노출되지 않을 수 있다. 일례로, 도 2에 도시된 바와 같 이 전자 장치가 접힘 상태인 경우, 힌지 커버는 제1 측면 부재 및 제2 측면 부재 사이에 서 외부로 노출될 수 있다. 일례로, 제1 측면 부재 및 제2 측면 부재가 소정의 각도를 이루는(folded with a certain angle) 중간 상태(intermediate state)인 경우, 힌지 커버의 일부는 제1 측면 부재 및 제2 측면 부재 의 사이에서 외부로 일부 노출될 수 있다. 다만 이 경우 힌지 커버가 노출되는 면적은 도 2의 완전 히 접힌 상태보다 적을 수 있다. 일 실시 예에서, 디스플레이는, 하우징에 의해 형성된 공간 상에 배치될 수 있다. 예를 들어, 디스플 레이는 하우징에 의해 형성되는 리세스 상에 안착되며, 전자 장치의 전면의 대부분을 형성할 수 있다. 예를 들어, 전자 장치의 전면은 디스플레이 및 디스플레이에 인접한 제1 측면 부재(101 1)의 일부 영역 및 제2 측면 부재의 일부 영역을 포함할 수 있다. 또 다른 예로, 전자 장치의 후면 은 제1 후면 커버, 제1 후면 커버에 인접한 제1 측면 부재의 일부 영역, 제2 후면 커버 및 제2 후면 커버에 인접한 제2 측면 부재의 일부 영역을 포함할 수 있다. 일 실시 예에서, 디스플레이는, 적어도 일부 영역이 평면 또는 곡면으로 변형될 수 있는 플렉서블 디스플 레이(flexible display)를 포함할 수 있다. 일 실시 예에서, 디스플레이는 폴딩 영역, 제1 영역 및 제2 영역을 포함할 수 있다. 폴딩 영역은 폴딩 축(A)을 따라 연장될 수 있고, 폴딩 영역 을 기준으로 일측(예: 도 1에 도시된 폴딩 영역의 좌측)에 제1 영역이 배치될 수 있고, 타측(예: 도 1에 도시된 폴딩 영역의 우측)에 제2 영역이 배치될 수 있다. 또 다른 예로, 제1 영역 은 제1 하우징에 배치되는 영역이고, 제2 영역은 제2 하우징에 배치되는 영역일 수 있다.폴딩 영역은 연결부에 배치되는 영역일 수 있다. 도 1 및 도 2에 도시된 디스플레이의 영역 구분은 예시적인 것이며, 디스플레이는 구조 또는 기능에 따라 복수(예를 들어, 4개 이상 혹은 2개)의 영역으로 구분될 수도 있다. 일례로, 도 1에 도시된 실시 예에서는 폴딩 영역 또는 폴딩 축(A)에 의해 디스플레이의 영역들이 구분될 수 있으나, 다른 실시 예에서 디스 플레이는 다른 폴딩 영역 또는 다른 폴딩 축을 기준으로 영역이 구분될 수도 있다. 일 실시 예에서, 제1 영역과 제2 영역은 폴딩 영역을 중심으로 전체적으로 대칭인 형상을 가질 수 있다. 다만, 제2 영역은, 제1 영역과 달리, 센서 영역의 존재에 따라 컷(cut)된 노치 (notch)를 포함할 수 있으나, 이외의 영역에서는 상기 제1 영역과 대칭적인 형상을 가질 수 있다. 예를 들 어, 제1 영역과 제2 영역은 서로 대칭적인 형상을 갖는 부분과, 서로 비대칭적인 형상을 갖는 부분을 포함할 수 있다. 이하, 전자 장치의 상태(예: 펼침 상태 및 접힘 상태)에 따른 제1 측면 부재 및 제2 측면 부재 의 동작과 디스플레이의 각 영역을 설명한다. 일 실시 예에서, 전자 장치가 펼침 상태(예: 도 1)인 경우, 제1 측면 부재 및 제2 측면 부재 는 약 180도의 각도를 이루며 실질적으로 동일 방향을 향하도록 배치될 수 있다. 디스플레이의 제1 영역 의 표면과 제2 영역의 표면은 서로 약 180도를 형성하며, 실질적으로 동일한 방향(예: 전자 장치의 전면 방향)을 향할 수 있다. 예를 들어, 폴딩 영역은 제1 영역 및 제2 영역과 동일 평면을 형성 할 수 있다. 일 실시 예에서, 전자 장치가 접힘 상태(예: 도 2)인 경우, 제1 측면 부재 및 제2 측면 부재 는 서로 마주보게 배치될 수 있다. 디스플레이의 제1 영역의 표면과 제2 영역의 표면은 서로 좁 은 각도(예: 0도에서 10도 사이)를 형성하며, 서로 마주볼 수 있다. 폴딩 영역은 적어도 일부가 소정의 곡 률을 가지는 곡면으로 이루어질 수 있다. 일 실시 예에서, 전자 장치가 중간 상태인 경우, 제1 측면 부재 및 제2 측면 부재는 서로 소 정의 각도(a certain angle)로 배치될 수 있다. 디스플레이의 제1 영역의 표면과 제2 영역의 표면은 접힘 상태보다 크고 펼침 상태보다 작은 각도를 형성할 수 있다. 폴딩 영역은 적어도 일부가 소정 의 곡률을 가지는 곡면으로 이루어질 수 있으며, 이 때의 곡률은 접힘 상태(folded state)인 경우보다 작을 수 있다. 본 문서에 개시된 다양한 전자 장치는, 디스플레이의 확장이 가능한 전자 장치로서 하우징 내에 배 치된 디스플레이의 적어도 일부분이 펼쳐진 상태로 움직일 수 있는 슬라이딩 타입(sliding type)의 롤러블 (rollable) 전자 장치 또는 하우징 내에 배치된 디스플레이의 적어도 일부분이 롤러에 의해 말아질 수 있는 롤 링 타입(rolling type)의 롤러블(rollable) 전자 장치를 포함할 수 있다. 도 3은 일 실시 예에 따른, 전자 장치의 디스플레이의 적층 구조를 도시한 도면이다. 도 3의 폴더블 전자 장치는 전술한 도 1 및 도 2의 전자 장치에 대응할 수 있다. 예를 들어, 전자 장 치는 도 1 및 도 2의 전자 장치를 구성하는 컴포넌트의 일부 또는 전부를 포함할 수 있다. 일 실시 예에 따르면, 폴더블 전자 장치는 하우징, 플렉서블 디스플레이, 박형 윈도우 및 점착 층을 포함할 수 있다. 일 실시 예에 따르면, 하우징은 전술한 하우징(도 1의 100)에 대응될 수 있다. 예를 들어, 하우징은 도 1의 하 우징의 구성 일부 또는 전부를 포함할 수 있다. 일 실시 예에 따르면, 하우징은 폴더블 전자 장치의 외관을 형성하여 일 축을 중심으로 폴딩이 가능하게 형성될 수 있다. 이하 상기 일 축은 후술하는 폴딩축과 대응될 수 있다. 일 실시 예에 따르면, 하우징은 베젤(bezel)을 포함할 수 있다. 예를 들어, 베젤은 하우징의 전자 장 치의 측면을 형성하는 부분으로부터 연장되어 형성될 수 있다. 베젤은 하우징에 디스플레이를 고정하 기 위하여 디스플레이 모듈의 가장자리 부분을 따라서 배치될 수 있다. 일 실시 예에 따르면, 베젤은 디스플레이의 적층 구조를 둘러싸며 형성될 수 있다. 일 실시 예에 따 르면, 베젤은 디스플레이의 가장자리를 따라서 둘러싸도록 형성됨으로써 디스플레이의 측면을 보호할 수 있다. 일 실시 예에 따르면, 플렉서블 디스플레이는 하우징(도 1의100)의 적어도 일 면에 배치될 수 있다. 일 실시 예에 따르면, 후술하는 플렉서블 디스플레이는 전술한 도 1의 디스플레이와 대응될 수 있다. 일 실시 예에 따르면, 박형 윈도우는 플렉서블 디스플레이상에 적층 될 수 있다. 일 실시 예에 따르 면, 박형 윈도우는 투명한 재질로 형성될 수 있다. 예를 들어, 박형 윈도우는 유리 재질 또는 투명 플라스틱 재질 중 적어도 하나를 포함할 수 있다. 일 실시 예에 따르면, 상기 점착층은 상기 박형 윈도우와 상기 플렉서블 디스플레이의 적어도 일부를 점착시킬 수 있다. 예를 들어, 점착층에 의해서 상기 박형 윈도우상에는 상기 플렉서블 디스플레이 상에 적층된 보 호층(protect layer)이 점착될 수 있다. 일 실시 예에 따르면 상기 보호층은 상기 박형 윈도우 또는 상기 플렉서블 디스플레이의 파손을 방지할 수 있다. 일 실시 예에 따르면, 점착층상에는 점착제가 도포될 수 있다. 일 실시 예에 따르면, 점착층은 제1 영역 및 제2 영역을 포함할 수 있다. 일 실시 예에 따르면, 점착제는 제1 점착제 와 제2 점착제를 포 함할 수 있다. 일 실시 예에 따르면 제1 영역에는 제1 점착제가 도포될 수 있으며, 제2 영역에는 제2 점착제가 도포 될 수 있다. 제1 점착제와 제2 점착제는 그 성질이 서로 상이한 점착제로 구성될 수 있다. 일 실시 예에 따르면, 제2 영역은 점착층의 가장자리에 형성될 수 있으며, 제1 영역은 점착층 의 중심부에 형성될 수 있다. 예를 들어, 제2 영역은 점착층의 중심부에 형성된 상기 제1 영역 의 가장자리를 둘러싸여 형성될 수 있다. 다만, 상기 제1 영역과 상기 제2 영역이 형성되는 범위는 이에 한정되지 않는다. 예를 들어, 상기 제 2 영역이 중심부에 형성될 수 있다. 일 실시 예에 따르면, 제1 점착제는 제1 크기의 점착력을 가질 수 있으며, 제2 점착제는 제1 점착제의 제1 크기 보다 큰 제2 크기의 점착력을 가질 수 있다. 예를 들어, 제1 점착제는 0gf/25mm 내지 10gf/25mm 범위내에서 제1 크기의 점착력을 가질 수 있으며, 제2 점착제는 상기 제1 크기보다 큰 10gf/25mm 내지 500gf/25mm 범위내에서 제2 크기의 점착력을 가질 수 있다. 일 실시 예에 따르면, 제2 크기의 점착력을 가진 제2 점착제가 도포되는 제 2 영역은 박형 윈도우와 보호층을 점착시킬 수 있다. 일 실시 예에 따르면, 제1 크기의 점착력을 가진 제1 점착제가 도포되는 제1 영역은 상기 박형 윈도우 와 보호층이 분리되는 것을 차단할 수 있다. 예를 들면, 점착제의 점착력이 감소함에 따라서 제1 영 역은 박형 윈도우와 보호층이 분리되는 것을 차단할 수 있다. 일 실시 예에 따르면, 제2 점착제는 제1 점착제와 달리 점착력이 약화될 수 있다. 예를 들어, 제2 점착제는 UV(ultraviolet ray) 또는 열에 의해 점착력이 약화될 수 있다. 일 실시 예에 따르면, 제2 점착제는 UV에 의해 접착력이 약화되는 모노머(monomer) 또는 올리고머(oligomer) 중 적어도 하나를 포함할 수 있다. 또 다른 일 실시 예에 따르면, 제2 점착제는 열에 의해 발포되어 점착력이 약화 될 수 있다. 일 실시 예에 따르면, 제2 점착제가 도포되는 상기 제2 영역은 UV 또는 열에 의해 점착력이 0gf/25mm에 수렴할 수 있다. 다만, 점착력이 약화될 수 있는 점착제는 제2 점착제에 한정하지 않는다. 예를 들어, 제1 점착제도 열에 의해 발포되어 점착력이 약화될 수 있다. 일 실시 예에 따르면, 제2 영역의 점착력이 0gf/25mm에 수렴함으로써, 박형 윈도우와 보호층은 용이하게 분리될 수 있다. 일 실시 예에 따르면, 박형 윈도우와 보호층이 용이하게 분리됨으로써 보호층은 박형 윈도우 의 교체 없이 용이하게 교체될 수 있다. 일 실시 예에 따르면, 베젤과 디스플레이의 적층 구조의 일 영역은 일 축(예: z축)으로 바로 볼 때 중첩 (overlap)될 수 있다. 일 실시 예에 따르면, 상기 베젤의 일 축상(예: z축상)으로 상기 중첩되는 영역은 제2 영역의 적어도 일부와 상응할 수 있다. 예를 들어, 전자 장치의 외관을 형성되는 베젤은 제2 영역의 전체를 커버할 수 있다. 또 다른 일 실시 예에 따르면, 베젤이 제2 영역의 전체를 커버함으로서 베젤은 제1 영역과 제2 영역의 경계면을 가릴 수 있다. 이를 통해 제1 영역과 제2 영역의 경계면은 전자 장치의 외 부에 노출되지 않을 수 있다. 일 실시 예에 따르면, 제2 영역에 도포되는 제2 점착제는 제1 점착제에 비해 투명도가 낮을 수 있다. 따라서, 디스플레이 상에 제2 점착제가 배치된 제2 영역은 디스플레이 를 통해서 출력되는 화면이 제2 점착제에 의해 적어도 일부가 차단되거나 제2 점착제가 디스플레이의 외부에서 보일 수 있다. 따라서, 제2 점착제는 베젤에 의해서 커버되는 제2 영역 내에 배치될 수 있다. 다만, 베젤이 커버하는 영역은 이에 한정하지 않는다. 예를 들어, 베젤은 제1 영역의 일부까지 커버될 수 있거나 제2 영역의 일부만을 커버할 수 있다. 일 실시 예에 따르면, 제1 점착제는 제1 투과율을 가지며, 제2 점착제는 제2 투과율을 가질 수 있다. 일 실시 예에 따르면 제1 점착제가 도포되는 제1 영역은 플렉서블 디스플레이에 위치하며 외부에 노출될 수 있다. 따라서 일 실시예에 따른, 제1 점착제의 제1 투과율은 90% 내지 100% 범위내에서 형성될 수 있다. 일 실시 예에 따르면, 제2 점착제가 도포되는 제2 영역은 상기 베젤에 의해서 커버될 수 있다. 예를 들어, 제2 영역은 상기 베젤에 가려져 외부에 노출되지 않을 수 있다. 따라서 일 실시 예에 따른, 제 2 점착제의 투과율은 0% 내지 100% 범위내에서 자유롭게 형성될 수 있다. 일 실시 예에 따른, 점착층 및 점착제와 관련된 구체적인 실시예는 도 4, 도 5, 도 6을 참조하여 후술한다. 도 4는 일 실시 예에 따른, 디스플레이의 점착층을 도시한 도면이다. 도 5은 일 실시 예에 따른, 디스플레이의 A-A'면을 도시하는 도면이다. 도 6은 다른 일 실시 예에 따른, 디스플레이의 B-B'면을 도시하는 도면이다. 도 4는 일 실시 예에 따른, 상기 점착층의 점착제가 도포된 영역을 도시하는 도면이다. 일 실시 예에 따르 면, 점착층에는 제1 점착제 및 제2 점착제가 도포될 수 있다. 일 실시 예에 따르면, 점착층은 제1 영역 및 제2 영역을 포함할 수 있다. 일 실시 예에 따르면, 제1 영역상에는 제1 점착제가 도포될 있으며, 제2 영역상에는 제2 점착제가 도 포될 수 있다. 일 실시 예에 따르면, 제2 영역은 제1 영역의 가장자리를 따라 적어도 일 영역에 도포 될 수 있다. 예를 들어, 제1 영역은 일 평면(예: xy평면)상에서 사각형 형태로 도포될 수 있으며, 제2 영역은 제1 영역의 가장자리를 둘러싸며 사각형 형태로 형성될 수 있다. 다만, 제1 영역 과 제2 영역이 도포되는 형태는 이에 한정하지 않는다. 예를 들어, 원 또는 타원과 같은 다양한 형태로 형성될 수 있다. 또한 제2 영역은 제1 영역의 일부의 가장자리를 둘러싸며 형성 될 수 있다. 도 4를 참고하면, 일 실시 예에 따른, A-A'축은 전자 장치의 폴딩축을 의미할 수 있다. 일 실시 예에 따르 면, B-B'축은 전자 장치의 상기 폴딩축의 수직이 되는 축(이하 “비폴딩축”)을 의미할 수 있다. 이하 후술하는 A-A'축은 폴딩축이며, B-B'축은 비폴딩축을 의미할 수 있다. 도 5는 일 실시 예에 따른, 전자 장치의 폴딩축(AA')의 디스플레이 상의 적층 구조를 도시하는 도면 이다. 일 실시 예에 따르면, 폴딩축(AA')상에서 전자 장치는 디스플레이, 박형 윈도우, 점착층, 및 보호층을 포함할 수 있다. 일 실시 예에 따르면, 점착층은 제1 점착제가 도포되는 제1 영역이 포함할 수 있으며, 제1 영역(53 1)의 양 끝 단의 일 영역에는 제2 점착제가 도포되는 제2 영역을 포함할 수 있다. 도 5를 참고하면, 일 실시 예에 따른, 폴딩축(AA')을 중심으로 형성된 제2 영역은 상기 디스플레이 및 상기 박형 윈도우의 가장자리를 둘러싸는 영역까지 형성될 수 있다. 일 실시 예에 따르면, 제2 영역 의 일 면은 점착층에서 제1 방향(예: -z 방향)으로 연장될 수 있다. 예를 들어, 제2 영역의 일 부는 제1 방향(예: -z 방향)으로 연장되어 디스플레이 및 박형 윈도우의 측면부를 감싸는 형태로 형 성될 수 있다.일 실시 예에 따르면, 제2 영역이 상기 디스플레이 및 상기 박형 윈도우의 측면을 감싸며 형성 됨으로써, 제2 영역은 디스플레이 및 박형 윈도우의 측면을 보호할 수 있다. 또한, 일 실시 예에 따르면, 제2 영역은 디스플레이 및 박형 윈도우를 베젤에 고정할 수 있다. 일 실시 예에 따르면, 측면부를 감싸며 형성된 제2 영역은 전자 장치의 반복되는 폴딩 (folding)에 의한 디스플레이 또는 박형 윈도우가 분리되는 것을 차단할 수 있다. 도 6은 일 실시 예에 따른, 전자 장치의 비폴딩축(BB')의 디스플레이상의 적층 구조를 도시하는 도면 이다. 일 실시 예에 따르면, 비폴딩축(BB')상의 전자 장치는 디스플레이, 박형 윈도우, 점착층 , 및 보호층을 포함할 수 있다. 일 실시 예에 따르면, 도 5의 점착층과 달리 도 6의 점착층의 제2 영역은 일 방향(예: -z방향) 으로 연장되지 않을 수 있다. 예를 들어, 제2 영역은 점착층상에만 형성될 수 있다. 도 7은 일 실시 예에 따른, 디스플레이의 점착층의 단면을 도시하는 도면이다. 일 실시 예에 따르면, 도 7은 전자 장치의 점착층의 단면을 의미할 수 있다. 일 실시 예에 따르면, 점착층은 제1 영역과 제2 영역을 포함할 수 있다. 예를 들어, 제1 영역 의 가장자리를 둘러싸고 제1 영역의 양 끝단에 제2 영역이 형성될 수 있다. 일 실시 예에 따르면, 중심축(C)은 점착층의 제1 축(예: z축)상의 중심을 의미할 수 있다. 여기서, 중심축 (C)은 점착층의 중심에 위치하여야 하는 것으로 한정되는 것을 의미하는 것은 아니며, 점착층 내부의 임의 의 다른 높이를 의미하는 것으로 해석될 수도 있다. 제2 영역의 제1 방향(예: +z 방향)을 향하는 면은 상단면이라고 언급될 수 있으며 제2 영역의 제2 방 향(예: -z 방향)을 향하는 면은 하단면이라고 언급될 수 있다. 일 실시 예에 따르면, 점착층의 단면은 제1 구조 또는 제2 구조로 형성될 수 있다. 일 실시 예에 따르면, 제1 구조는 제1 단면을 포함할 수 있다. 제1 구조는 제2 점착제가 배치된 제2 영역의 폭이 균일하게 형성된 구조일 수 있다. 일 실시 예에 따르면, 제2 구조는 제2 단면, 제3 단면, 제4 단면, 제5 단면, 제6 단 면, 제7 단면, 제8 단면 및 제9 단면을 포함할 수 있다. 일 실시 예에 따르면, 제1 단면은 제1 영역과 제2 영역이 일 축(예: Z축)상으로 평행하게 형성 될 수 있다. 일 실시 예에 따르면, 제1 단면은 제1 영역과 제2 영역의 경계면이 점착층에 수직으로 형성될 수 있다. 일 실시 예에 따르면, 제2 영역은 점착층의 중심축(C)으로부터 제 1 축(예: z축)방향으로 제2 영역의 폭이 일정하게 연장되어 형성될 수 있다. 일 실시 예에 따르면, 제2 단면은 제2 영역이 제1 영역의 일부를 커버하는 단면으로 형성될 수 있다. 일 실시 예에 따르면 제2 단면의 제2 영역은 사다리꼴 형태로 형성될 수 있다. 예를 들어, 제2 영역의 폭은 중심축(C)으로부터 제1 방향(예: +z 방향)으로 멀어질수록 점진적으로 넓어질 수 있다. 예를 들어, 중심축(C)을 기준으로 제2 영역은 상단부가 하단부 보다 넓은 형상일 수 있다. 일 실시 예에 따르면, 상단부가 더 점진적으로 넓어지며 형성되는 제2 영역은 제1 영역을 상기 박형 윈도우(도3의 320)상에 물리적으로 구속할 수 있다. 이를 통해, 제2 영역은 제1 영역의 들뜸을 방지할 수 있다. 일 실시 예에 따르면, 제3 단면은 제2 단면의 역으로(inverse) 형성될 수 있다. 예를 들어 제2 영역 의 폭은 중심축(C)으로부터 제2 방향(예: -z 방향)으로 점진적으로 넓어질 수 있다. 예를 들어, 중심축 (C)을 기준으로 제2 영역은 하단부가 상단부보다 넓은 형상일 수 있다. 일 실시 예에 따르면, 제2 영역 의 하단부가 넓게 형성됨으로써, 점착층은 박형 윈도우상에 강하게 고정될 수 있다. 일 실시 예에 따르면, 제4 단면은 제2 단면과 제3 단면이 혼합되어 형성될 수 있다. 일 실시 예 에 따르면, 제4 단면에서 제2 영역의 폭은 중심축(C)에서 대칭되어 상단부 및 하단부로 연장될수록 점진적으로 넓어지며 형성될 수 있다. 예를 들어, 상단부에서 중심축(C)으로 갈수록 제2 영역의 폭은 점진 적으로 좁아지다가 중심축(C)에서 하단부로 갈수록 제2 영역의 폭은 점진적으로 증가할 수 있다. 일 실시 예에 따르면, 상단부와 하단부의 제2 영역의 폭은 중심축을 기준으로 하여 대칭으로 형성될 수 있다. 일 실시 예에 따르면, 제5 단면은 제4 단면의 역으로 형성될 수 있다. 일 실시 예에 따르면, 제5 단 면에서 제2 영역의 폭은 중심축(C)에서 상단부 및 하단부로 연장될수록 점진적으로 좁아지며 형성될 수 있다. 예를 들어, 상단부에서 중심축(C)으로 갈수록 제2 영역의 폭은 점진적으로 넓어지다가 중심축 (C)에서 하단부로 갈수록 제2 영역의 폭은 점진적으로 좁아질 수 있다. 일 실시 예에 따르면, 상단부와 하단부의 제2 영역의 폭은 중심축을 기준으로 하여 대칭으로 형성될 수 있다. 일 실시 예에 따르면, 제6 단면은 제2 영역의 폭이 서로 다른 두 개의 층을 가지는 점착층의 단 면을 도시한 것이다. 일 실시 예에 따르면, 제2 단면과 달리 제6 단면의 제2 영역에서 점착층 의 상단 측에 형성된 층의 제2 영역의 폭은 하단 측에 형성된 층의 제2 영역의 폭보다 넓게 형 성될 수 있다. 일 실시 예에 따르면, 중심축(C)을 기준으로 상단부와 인접하게 형성된 제2 영역의 폭은 하 단부와 인접하게 형성된 제2 영역의 폭보다 두껍게 형성될 수 있다. 예를 들어, 제2 영역의 단면은 역 L형상(inverted-L)으로 형성될 수 있다. 다른 일 실시 예에 따르면, 제7 단면은 폭이 서로 다른 두 개의 층을 가지는 점착층의 단면을 도시한 것이다. 일 실시 예에 따르면, 제7 단면은 제6 단면의 역으로(inverse) 형성될 수 있다. 일 실시 예 에 따르면, 제3 단면과 달리 제7 단면의 제2 영역에서 점착층의 하단 측에 형성된 층의 제 2 영역의 폭은 상단 측에 형성된 층의 제2 영역의 폭보다 넓게 형성될 수 있다. 일 실시 예에 따르면, 중심축(C)을 기준으로 하단부와 인접하게 형성된 제2 영역의 폭은 상단부와 인접하게 형성된 제2 영역의 폭보다 두껍게 형성될 수 있다. 예를 들어, 제2 영역의 단면은 L형상으로 형성될 수 있다. 다른 일 실시 예에 따르면, 제8 단면은 폭이 서로 다른 두 개의 층을 가지는 점착층의 단면을 도시한 것이다. 일 실시 예에 따르면, 제8 단면은 제6 단면과 제7 단면이 혼합되어 형성될 수 있다. 일 실시 예 에 따르면, 제8 단면의 제2 영역의 폭은 중심축(C)을 기준으로 점착층의 상단부 및 하단부에 인 접하여 두껍게 형성될 수 있다. 일 실시 예에 따르면, 중심축(C)으로부터 이격되고 점착층의 상단 및 하단 측에 형성된 층의 제2 영역의 폭은 중심축(C)에 인접하여 형성된 층의 제2 영역의 폭보다 넓게 형성 될 수 있다. 예를 들어, 제8 단면의 제2 영역의 단면은 C형상으로 형성될 수 있다. 다른 일 실시 예에 따르면, 제9 단면은 폭이 서로 다른 두 개의 층을 가지는 점착층의 단면을 도시한 것이다. 일 실시 예에 따르면, 제9 단면은 제8 단면의 역으로(inverse) 형성될 수 있다. 일 실시 예에 따르면, 제9 단면의 제2 영역의 폭은 중심축(C)에 인접하여 두껍게 형성될 수 있다. 일 실시 예에 따르면, 중심축(C)으로부터 인접하여 형성된 층의 제2 영역의 폭은 중심축(C)으로부터 이격되고 점착층 의 상단 및 하단 측에 형성된 층의 제2 영역의 폭보다 넓게 형성될 수 있다. 예를 들어, 제9 단면 의 제2 영역의 단면은 T형상으로 형성될 수 있다. 다만, 제2 구조는 상기 제1 단면 내지 상기 제9 단면중 어느 하나에 한정하지 않는다. 예를 들 어, 점착층의 단면은 제3 단면과 제6 단면이 혼합되어 형성될 수 있다. 도 8은 일 실시 예에 따른, 디스플레이의 점착층을 도시하는 도면이다. 일 실시 예에 따르면, 도 8은 점착층의 차등 경계 구조(도7의 720)를 도시하는 도면이다. 도 8을 참고하면, 일 실시 예에 따른, 점착층은 제1 영역과 제2 영역을 포함할 수 있다. 일 실 시 예에 따르면, 제1 영역과 제2 영역의 전체 경계면은 제2 구조(도 7의 720)들 중 적어도 하나 로 형성될 수 있다. 일 실시 예에 따르면, 상기 경계면이 제2 구조로 형성됨으로써 제2 영역은 제1 영역을 박 형 윈도우(도 3의 321)상에 고정할 수 있다. 예를 들어, 제2 영역과 제1 영역의 경계면은 제2 단면(도 7의 712)으로 형성될 수 있다. 일 실시 예에 따르면, 상기 경계면이 제2 단면으로 형성됨으로써 제2 영역은 제1 영역을 구조적으로 고정할 수 있다. 일 실시 예에 따르면, 구조적으로 고정함으로써 제2 영역은 제1 영역이 박형 윈도우로부터 분리되는 것을 차단할 수 있다. 다만, 이에 한정되는 것은 아니며, 일 실시 예에 따르면, 경계면은 제1 구조로 형성될 수도 있다. 도 9은 다른 일 실시 예에 따른, 디스플레이의 점착층을 도시하는 도면이다. 일 실시 예에 따르면, 도 9는 점착층의 영역별 제2 구조(도7의 720)를 도시하는 도면이다. 일 실시 예에 따르면, A-A'축은 폴딩축을 의미할 수 있으며, B-B'축은 비폴딩축을 의미할 수 있다. 일 실시 예 에 따르면, 제1 영역과 제2 영역의 경계면은 폴딩축(AA')을 중심으로 하는 제1 경계면과 제1 경계면에 수직이며 비폴딩축(BB')을 중심으로 하는 제2 경계면을 포함할 수 있다. 일 실시 예에 따르면, 제2 경계면은 제1 단면을 포함할 수 있으며, 제1 경계면은 제2 구조를 포함할 수 있다. 예를 들어, 제1 경계면은 제2 단면으로 형성될 수 있다. 일 실시 예에 따르면, 폴딩축(AA”)에 인접한 제1 영역과 제2 영역은 제1 경계면의 제2 단면에 의하여 강하게 결합될 수 있다. 일 실시 예에 따르면, 상기 제2 구조에 의해서, 제2 영역은 제1 영역이 폴딩(folding)에 의한 점착층의 박형 윈도우(도 3의 321)로부터 분리되는 것을 차단할 수 있다. 도 10은 다른 일 실시 예에 따른, 디스플레이의 점착층을 도시하는 도면이다. 일 실시 예에 따르면, 도 10는 점착층의 다른 영역별 차등 경계 구조를 도시하는 도면이다. 일 실시 예에 따르면 제1 영역과 제2 영역의 경계면은 폴딩축(AA')에 수직인 제1 면(예: xz평면)과 제1 면에 수직하며 폴딩축(AA')에 평행한 제2 면(예: yz평면)을 포함할 수 있다. 일 실시 예에 따르면, 상기 제1 면(예: xz평면)은 폴딩축(AA')과 인접하며 비폴딩축(BB')과 평행한 제1 경계면 과 폴딩축(AA')으로부터 이격되며 비폴딩축(BB')과 평행한 제2 경계면을 포함할 수 있다. 일 실시 예에 따르면, 상기 제2 면(예: yz평면)은 폴딩축(AA')과 평행한 제3 경계면을 포함할 수 있다. 일 실시 예에 따르면, 제2 경계면 및 제3 경계면은 제1 단면을 포함할 수 있다. 일 실시 예에 따르면, 제1 경계면은 제2 구조를 포함할 수 있다. 예를 들어, 제1 경계면은 제2 단면을 포함할 수 있다. 일 실시 예에 따르면, 도 9의 제1 경계면과 달리 제2 구조가 형성되는 범위가 감소함으로써, 점착층 은 용이하게 제작가능한 구조를 가질 수 있다. 도 11은 다른 일 실시 예에 따른, 디스플레이의 점착층을 도시하는 도면이다. 일 실시 예에 따르면, 도 11는 점착층의 차등 폭 구조를 도시하는 도면이다. 일 실시 예에 따르면 제2 영역은 제1 부분, 제2 부분, 및 제3 부분을 포함할 수 있다. 일 실시 예에 따르면, 제1 영역과 제2 영역의 경계면은 폴딩축(AA')에 수직인 제1 면(예: xz 평면)과 제1 면에 수직하며 폴딩축(AA')에 평행한 제2 면(예: yz평면)을 포함할 수 있다. 일 실시 예에 따르면, 제1 면(예: xy평면)은 제1 부분과 제2 부분을 포함할 수 있으며, 제2 면(예: yz평면)은 제3 부분을 포함할 수 있다. 일 실시 예에 따르면, 제1 부분 내지 제3 부분은 제2 영역의 폭을 의미할 수 있다. 일 실시 예에 따르면, 제1 부분은 폴딩축(AA')과 인접하며 제1 면 상에 형성될 수 있다. 일 실시 예에 따 르면, 제2 부분은 폴딩축(AA')과 이격되어 제1 면상에 형성될 수 있다. 일 실시 예에 따르면, 제1 부분과 제2 부분 및 제3 부분은 다른 폭으로 형성될 수 있다. 일 실시 예에 따르면, 제1 부분은 제1 크기의 폭을 가질 수 있으며, 제2 부분 및 제3 부분은 제1 크기보다 작은 제2 크기의 폭을 가질 수 있다. 예를 들어, 제2 영역의 제1 부분은 전자 장치의 내부를 향하는 방향으로 연장되어 넓게 형성될 수 있다. 일 실시 예에 따르면, 제1 부분이 폴딩축(AA')에 인접하게 형성됨으로써, 제1 부분은 반복된 전자 장치의 폴딩 동작에 의한 점착층이 박형 윈도우(도 3의 321)로부터 들뜨는 문제를 방지할 수 있다. 도 12은 다른 일 실시 예에 따른, 디스플레이의 점착층을 도시하는 도면이다. 일 실시 예에 따르면, 도 12는 점착층의 제2 구조와 차등 폭 구조가 혼합된 구조를 도시하는 도면이 다. 일 실시 예에 따르면, 제2 영역은 제1 부분, 제2 부분, 및 제3 부분을 포함할 수 있 다. 일 실시 예에 따르면 제1 영역과 제2 영역의 경계면은 폴딩축(AA')에 수직인 제1 면(예: xz평면)과 제1 면에 수직하며 폴딩축(AA')에 평행한 제2 면(예: yz평면)을 포함할 수 있다. 일 실시 예에 따르면, 제1 면(예: xy평면)은 제1 부분과 제2 부분을 포함할 수 있으며, 제2 면(예: yz평면)은 비폴딩축(BB')을 중심으로 하는 제3 부분을 포함할 수 있다. 일 실시 예에 따르면, 제1 부분 은 폴딩축(AA')과 인접한 제1 면에 형성될 수 있으며, 제2 부분은 폴딩축(AA')과 이격되어 제1 면 에 형성될 수 있다. 일 실시 예에 따르면, 제1 부분 내지 제3 부분은 제2 영역의 폭을 의미 할 수 있다. 일 실시 예에 따르면, 폴딩축(AA')에 인접한 제1 부분은 도 10의 제2 구조와 도 11의 차등 폭 구조 가 혼합된 구조로 형성될 수 있다. 예를 들어, 제1 부분은 제2 영역상의 제1 크기의 폭을 가질 수 있으며, 제2 부분 및 제3 부 분은 상기 제1 크기보다 작은 제2 크기의 폭을 가질 수 있다. 또한 일 실시 예에 따르면, 제2 부분 및 제3 부분은 제1 단면(도 7의 711)을 포함할 수 있다. 일 실시 예에 따르면, 제1 부분은 제2 구조를 포함할 수 있다. 예를 들어 제1 부분의 경계면 은 도 7의 제2 단면을 포함할 수 있다. 일 실시 예에 따르면, 제1 부분이 넓은 폭으로 형성되며 제2 단면을 포함함으로써, 제1 부분은 전자 장치의 폴딩 동작에 의한 점착층이 들뜨는 문제를 방 지할 수 있다. 도 13은 일 실시 예에 따른, 디스플레이의 적층 구조를 도시하는 도면이다. 도 13을 참고하면, 일 실시예에 따른 전자 장치(도 1의 113)의 플렉서블 디스플레이상에 적층된 복수의 윈도우와 점착층을 도시한 도면이다. 일 실시 예에 따르면, 전자 장치는 플렉서블 디스플레이, 복수의 윈도우, 복수의 점착층 , 하우징(도 1의 100)을 포함할 수 있다. 일 실시 예에 따르면, 전자 장치의 외관을 형성하는 하우징은 제2 윈도우 상의 베젤 영역 에 상응하는 위치에 배치되는 베젤을 포함할 수 있다. 일 실시 예에 따르면, 복수의 윈도우는 플렉 서블 디스플레이상에 점착되는 제1 윈도우와 상기 제1 윈도우에 점착되며 외부에 노출되는 제2 윈도우를 포함할 수 있다. 일 실시 예에 따르면, 상기 복수의 점착층은 상기 플렉서블 디스플레이와 상기 제1 윈도우를 점착시키는 제1 점착층과 상기 제1 윈도우와 상기 제2 윈도우를 점착시키는 제2 점착층 을 포함할 수 있다. 일 실시 예에 따르면, 복수의 점착층은 제1 점착제가 도포되는 제1 영역(1331,1333)과 제2 점착제가 도포 되는 제2 영역(1332,1334)을 포함할 수 있다. 일 실시 예에 따르면, 상기 제2 영역(1332,1334)은 베젤 영역 을 포함할 수 있다. 일 실시 예에 따르면, 상기 제2 영역(1332,1334)은 상기 제1 영역(1331,1333)의 가 장자리를 따라 형성될 수 있다. 일 실시 예에 따르면, 상기 베젤 영역 상에 배치되는 베젤은 상기 제2 영 역(1332, 1334)과 상기 제1 영역(1331,1333)의 경계면을 커버할 수 있다. 일 실시 예에 따르면, 점착층은 제1 점착제와 점착력이 약화될 수 있는 제2 점착제에 의해 도포될 수 있 다. 예를 들어, 제1 영역(1331, 1333)은 제1 점착제에 의해 도포될 수 있으며, 제2 영역(1332, 1334)은 제2 점 착제에 의해 도포될 수 있다. 일 실시 예에 따르면, 제1 점착층의 제2 영역은 UV(ultraviolet ray)에 의해 접착력이 약화되는 모노머(monomer) 또는 올리고머(oligomer)중 적어도 하나를 포함하는 제2 점착제에 의해 도포될 수 있다. 일 실 시 예에 따르면, 제2 점착층의 제2 영역은 열에 의해 발포되어 점착력이 약화되는 제2 점착제에 의 해 도포될 수 있다. 다만, 제2 점착제가 도포되는 점착층의 순서와 구성은 이에 한정되지 않는다. 예를 들어, 제1 점착층 은 열에 의해 발포되어 점착력이 약화되는 제2 점착제에 의해 도포될 수 있다. 일 실시 예에 따르면, 복수의 윈도우는 점착력이 약화될 수 있는 제2 점착제에 의해 선택적으로 분리 수 있다. 예를 들어, 상기 제2 점착층의 상기 제2 영역의 점착력은 UV에 의하여 약화할 수 있다. 일 실시 예에 따르면, 이를 통해, 제2 점착층에 부착된 제2 윈도우는 전자 장치로부터 선택적 으로 분리될 수 있다. 일 실시 예에 따르면, 복수의 윈도우중 적어도 하나를 전자 장치로부터 선택 적 분리함으로써 파손된 윈도우가 용이하게 교체될 수 있다. 다만, 점착력이 약화될 수 있는 점착제는 제2 점착제에 한정하지 않는다. 예를 들어 제1 점착제도 점착력이 약 화될 수 있다. 도 14는 일 실시 예에 따른, 점착층의 공정과정을 설명하기 위한 도면이다. 도 14를 참고하면, 일 실시 예에 따르면 공정 1401은 점착층 중 제2 영역의 절단공정 과정을 포함 할 수 있다. 일 실시 예에 따르면, 공정 1401은 칼날이 점착층을 절단하는 절단 방향의 경사도를 조절하 여 제2 영역의 적어도 일부를 절단하는 공정을 포함할 수 있다. 일 실시 예에 따르면, 공정 1402는 공정1401에 의해서 절단된 제2 영역을 사전에 도포된 제1 영역 에 결합하는 공정을 포함할 수 있다. 예를 들어, 공정 1402는 라미네이션(lamination)공정을 포함할 수 있다. 또 다른 일 실시 예에 따르면, 공정 1403은 공정 1401에 의해서 절단된 제2 영역을 박형 윈도우상 에 도포 한 후, 제1 영역을 제2 영역의 사이에 도포하는 공정을 포함할 수 있다. 일 실시 예에 따르면, 점착층의 공정과정은 공정 1401 및 공정 1402를 포함하거나, 공정 1401 및 공정 1403을 포함할 수 있다. 도 15는 일 실시 예에 따른 네트워크 환경 내의 전자 장치를 도시한 도면이다. 도 15는 다양한 실시 예들에 따른 네트워크 환경 내의 전자 장치의 블록도이다. 도 15를 참조하면, 네트워크 환경에서 전자 장치는 제1 네트워크(예: 근거리 무선 통신 네트워크)를 통하여 전 자 장치와 통신하거나, 또는 제2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장치 또는 서버와 통신할 수 있다. 일 실시 예에 따르면, 전자 장치는 서버를 통하여 전자 장치와 통신할 수 있다. 일 실시 예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈, 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스 , 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈, 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시 예에서는, 전자 장 치에는 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어떤 실시 예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데 이터 처리 또는 연산을 수행할 수 있다. 일 실시 예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로 세서는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘 발성 메모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비 휘발성 메모리에 저장할 수 있다. 일 실시 예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서 (예: 그래픽 처리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거 나, 지정된 기능에 특화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세 서를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로 세서와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센 서 모듈, 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일 실시 예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관 련 있는 다른 구성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일 실시 예 에 따르면, 보조 프로세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능이 수행 되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi-supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경 망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted Boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포 함할 수 있다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관 련된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도 로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일 실시 예에 따르면, 리시버는 스피 커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레 이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로를 포함할 수 있다. 일 실시 예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일 실시 예에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰) 를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태)를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일 실시 예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일 실시 예에 따르면, 인터페이스 는, 예를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일 실시 예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커 넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일 실시 예에 따르면, 햅틱 모듈은, 예를 들 면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다.카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일 실시 예에 따르면, 카메라 모듈은 하나 이상의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일 실시 예에 따르면, 전력 관리 모듈은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일 실시 예에 따르면, 배 터리는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있 다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버 ) 간의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접 (예: 유선) 통신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일 실시 예 에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제1 네트워크(예: 블루투스, WiFi 다이렉트(wireless fidelity direct) 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워크) 또는 제2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워 크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈 은 가입자 식별 모듈에 저장된 가입자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제1 네트워크 또는 제2 네트워크와 같은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중 입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔포밍, 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일 실시 예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 피크 데이터 레이트(peak data rate)(예: 20Gbps 이상), mMTC 실현을 위한 손실 커버리지(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운 링크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일 실시 예에 따르면, 안테나 모듈은 기판(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일 실시 예에 따르면, 안테나 모듈은 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제1 네트워크 또는 제2 네트워크와 같은 통신 네트 워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복 수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모듈 과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시 예에 따르면, 방사체 이외에 다른 부품 (예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양 한 실시 예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일 실시 예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제1 면(예: 아래 면)에 또는 그에 인접하여 배치 되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제2 면(예: 윗면 또는 측면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있는 복수 의 안테나들(예: 어레이 안테나)을 포함할 수 있다.상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일 실시 예에 따르면, 명령 또는 데이터는 제2 네트워크에 연결된 서버를 통해서 전자 장치(150 1)와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(1502, 또는 1504) 각각은 전자 장치와 동일한 또는 다른 종류의 장치일 수 있다. 일 실시 예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(1502, 1504, 또는 1508) 중 하나 이상의 외부의 전자 장치들에 서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시 키는 대신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치 로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답 의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴 퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시 예 에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학 습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일 실시 예에 따르면, 외부의 전자 장치 또는 서버 는 제2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반 으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 다양한 실시 예에 따른, 폴더블 전자 장치는 상기 폴더블 전자 장치의 전면에 배치되는 플렉서블 디스플레이, 상기 폴더블 전자 장치의 외관을 형성하여 일 축을 중심으로 폴딩이 가능한 하우징, 상기 하우징은 상기 플렉서 블 디스플레이의 가장자리를 따라 형성되는 베젤(bezel)을 포함하고, 상기 플렉서블 디스플레이 상에 적층되는 박형 윈도우 및 상기 박형 윈도우와 상기 플렉서블 디스플레이의 다른 구성을 점착시키는 점착제가 도포되는 점 착층을 포함하고, 상기 점착제는 제1 점착제 및 상기 제1 점착제와 구별되며 점착력이 약화될 수 있는 제2 점착 제를 포함하고, 상기 점착층은 상기 제1 점착제가 도포되는 제1 영역, 및 상기 제1 영역의 가장자리를 따라 형 성되고, 상기 베젤에 상응하는 일 영역에 상기 제2 점착제가 도포되는 제2 영역을 포함할 수 있다. 일 실시 예에 따르면, 상기 폴딩축과 인접한 상기 점착층의 상기 제2 영역은 상기 제1 영역의 가장자리의 일부 를 커버함으로써 상기 제1 영역을 상기 박형 윈도우에 고정할 수 있다. 일 실시 예에 따르면, 상기 제2 영역은 제1 크기의 폭을 가지는 제1 부분과 상기 제1 크기보다 작은 제2 크기의 폭을 가지는 제2 부분을 포함하고, 상기 제1 부분은 상기 폴딩축을 중심으로 인접하게 형성될 수 있다. 일 실시 예에 따르면, 상기 제2 영역은 제1 크기의 폭을 가지는 제1 부분과 상기 제1 크기보다 큰 제2 크기의 폭을 가지는 제2 부분을 포함하고, 상기 제2 영역의 상기 제2 부분은 폴딩축을 중심으로 인접하게 형성되며, 상 기 폴딩축을 중심으로 인접한 상기 제1 영역의 가장자리의 일부를 커버함으로써 상기 제1 영역을 상기 박형 윈 도우에 고정할 수 있다. 일 실시 예에 따르면, 상기 제2 점착제는 열에 의해 발포되어 점착력이 약화될 수 있다. 일 실시 예에 따르면, 상기 제2 점착제는 UV(ultraviolet ray)에 의해 접착력이 약화되는 모노머(monomer) 또는 올리고머(oligomer) 중 적어도 하나를 포함할 수 있다. 일 실시 예에 따르면, 상기 제1 점착제는 점착력이 약화될 수 있는 점착제를 포함하고, 상기 제1 점착제는 제1 크기의 점착력을 가지며, 상기 제2 점착제는 상기 제1 크기보다 큰 제2 크기의 점착력을 가질 수 있다. 일 실시 예에 따르면, 상기 박형 윈도우는 투명한 재질로 형성될 수 있다. 일 실시 예에 따르면, 상기 제1 영역의 경계면과 상기 제2 영역이 베젤에 의해 커버될 수 있다. 일 실시 예에 따르면, 상기 점착층에 의하여 상기 박형 윈도우 상에 점착되는 보호층(protect layer)을 포함할 수 있다. 일 실시 예에 따르면, 상기 폴딩축 상에 형성되는 상기 제2 영역은 상기 디스플레이 및 상기 박형 윈도우의 가 장자리를 둘러싸는 영역까지 형성되어, 상기 디스플레이 및 상기 박형 윈도우를 고정시킬 수 있다. 다양한 실시 예에 따른, 폴더블 전자 장치는 상기 폴더블 전자 장치의 전면에 배치되는 플렉서블 디스플레이, 상기 폴더블 전자 장치의 외관을 형성하고, 일 축을 중심으로 폴딩이 가능한 하우징, 상기 하우징은 상기 플렉 서블 디스플레이의 가장자리를 따라 형성되는 베젤(bezel)을 포함하고, 상기 플렉서블 디스플레이 상에 적층되 는 복수의 박형 윈도우, 상기 복수의 윈도우는 상기 플렉서블 디스플레이와 점착되는 제1 윈도우, 및 상기 제1 윈도우 상에 점착되고, 일 면이 상기 폴더블 전자 장치의 외부로 노출되는 제2 윈도우를 포함하고, 상기 플렉서 블 디스플레이와 상기 복수의 윈도우 사이에 배치되어 상기 플렉서블 디스플레이와 상기 복수의 윈도우를 점착 시키는 점착제가 도포되는 점착층을 포함하고, 상기 점착제는 제1 점착제 및 상기 제1 점착제와 구별되고 점착 력이 약화될 수 있는 제2 점착제를 포함하고, 상기 점착층은 상기 제1 점착제가 도포되는 제1 영역, 및 상기 제 1 영역의 가장자리를 따라 형성되고, 상기 베젤에 상응하는 일 영역에 상기 제2 점착제가 도포되는 제2 영역을 포함할 수 있다. 일 실시 예에 따르면, 상기 점착층은 상기 플렉서블 디스플레이와 상기 제1 윈도우를 점착시키는 제1 점착층 및 상기 제1 윈도우와 상기 제2 윈도우를 점착시키는 제2 점착층을 포함하고, 상기 제1 점착층의 제2 점착제는 UV(ultraviolet ray)에 의해 접착력이 약화되는 모노머(monomer) 또는 올리고머(oligomer) 중 적어도 하나를 포함하며, 상기 제2 점착층의 제2 점착제는 열에 의해 발포되어 점착력이 약화되는 점착제를 포함할 수 있다. 일 실시 예에 따르면, 상기 베젤에 의하여 상기 점착층의 상기 제1 영역의 경계면과 상기 제2 영역이 커버될 수 있다. 일 실시 예에 따르면, 상기 제2 점착층의 상기 제2 점착제에 의하여 외부로 노출되는 상기 제2 윈도우만 선택적 으로 분리 가능할 수 있다. 다양한 실시 예에 따른, 폴더블 전자 장치는 상기 폴더블 전자 장치의 전면에 배치되는 플렉서블 디스플레이, 상기 폴더블 전자 장치의 외관을 형성하여 일 축을 중심으로 폴딩이 가능한 하우징, 상기 하우징은 상기 플렉서 블 디스플레이의 가장자리를 따라 형성되는 베젤(bezel)을 포함하고, 상기 플렉서블 디스플레이 상에 적층되는 박형 윈도우 및 상기 박형 윈도우와 상기 플렉서블 디스플레이의 다른 구성을 점착시키는 점착제가 도포되는 점 착층을 포함하고, 상기 점착제는 제1 점착제 및 상기 제1 점착제와 구별되며 점착력이 약화될 수 있는 제2 점착 제를 포함하고, 상기 점착층은 상기 제1 점착제가 도포되며 외부로 노출되는 제1 영역, 및 상기 베젤에 의해 가 려지며 상기 제1 영역의 가장자리를 따라 형성되고, 상기 제2 점착제가 도포되는 제2 영역을 포함할 수 있다. 일 실시 예에 따르면, 상기 폴딩축과 인접한 상기 점착층의 상기 제2 영역은 상기 제1 영역의 가장자리의 일부 를 커버함으로써 상기 제1 영역을 상기 박형 윈도우에 고정할 수 있다. 일 실시 예에 따르면, 상기 제2 점착제는 열에 의해 발포되어 점착력이 약화될 수 있다. 일 실시 예에 따르면, 상기 박형 윈도우는 투명한 재질로 형성될 수 있다. 일 실시 예에 따르면, 상기 점착층에 의하여 상기 박형 윈도우 상에 점착되는 보호층(protect layer)을 포함할 수 있다. 본 문서에 개시된 다양한 실시 예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시 예에 따른 전자 장치는 전술한 기기들에 한정 되지 않는다. 본 문서의 다양한 실시 예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시 예들로 한정하려는 것이 아니며, 해당 실시 예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한 다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아 이템에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구 들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \" 제1\", \"제2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하 기 위해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제1) 구성요소가 다른(예: 제2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소 에 직접적으로(예: 유선으로), 무선으로, 또는 제3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 다양한 실시 예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포 함할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부가 될 수 있다. 예를 들면, 일 실시 예에 따르면, 모듈은 ASIC(application-specific integrated circui t)의 형태로 구현될 수 있다. 본 문서의 다양한 실시 예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨 어(예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행 될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형태로 제공될 수 있다. 여기서, '비일시적'은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전 자기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경 우와 임시적으로 저장되는 경우를 구분하지 않는다. 일 실시 예에 따르면, 본 문서에 개시된 다양한 실시 예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래 될 수 있다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: CD-ROM(compact disc read only memory))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어™)를 통해 또는 두 개의 사용자 장치들(예: 스마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경 우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시 예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상 의 다른 구성요소들 또는 동작들이 추가될 수 있다. 추가적으로 또는 대체적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시 예들에 따르면, 모듈, 프로그램 또는 다른 구 성요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13 도면14 도면15"}
{"patent_id": "10-2021-0082471", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시 예에 따른 펼쳐진 상태(unfolded state)의 전자 장치를 도시한다. 도 2는 일 실시 예에 따른 접힌 상태(folded state)의 전자 장치를 도시한다. 도 3은 일 실시 예에 따른, 전자 장치의 디스플레이의 적층 구조를 도시한 도면이다. 도 4는 일 실시 예에 따른, 디스플레이의 점착층을 도시한 도면이다. 도 5은 일 실시 예에 따른, 디스플레이의 A-A'면을 도시하는 도면이다. 도 6은 다른 일 실시 예에 따른, 디스플레이의 B-B'면을 도시하는 도면이다. 도 7은 일 실시 예에 따른, 디스플레이의 점착층의 단면을 도시하는 도면이다. 도 8은 일 실시 예에 따른, 디스플레이의 점착층을 도시하는 도면이다. 도 9은 다른 일 실시 예에 따른, 디스플레이의 점착층을 도시하는 도면이다. 도 10은 다른 일 실시 예에 따른, 디스플레이의 점착층을 도시하는 도면이다. 도 11은 다른 일 실시 예에 따른, 디스플레이의 점착층을 도시하는 도면이다. 도 12는 다른 일 실시 예에 따른, 디스플레이의 점착층을 도시하는 도면이다. 도 13은 일 실시 예에 따른, 디스플레이의 적층 구조를 도시하는 도면이다. 도 14는 일 실시 예에 따른, 점착층의 공정과정을 설명하기 위한 도면이다. 도 15은 일 실시 예에 따른 네트워크 환경 내의 전자 장치를 도시한 도면이다. 도면의 설명과 관련하여, 동일 또는 유사한 구성요소에 대해서는 동일 또는 유사한 참조 부호가 사용될 수 있다."}
