{"patent_id": "10-2015-0023689", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2016-0100760", "출원번호": "10-2015-0023689", "발명의 명칭": "어플리케이션을 설치하는 전자 장치 및 그 제어 방법", "출원인": "삼성전자주식회사", "발명자": "임범택"}}
{"patent_id": "10-2015-0023689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,통신 모듈;상기 통신 모듈과 전기적으로 연결된 프로세서; 및상기 프로세서와 전기적으로 연결된 메모리를 포함하며,상기 메모리는, 실행시에, 상기 프로세서가,적어도 하나의 어플리케이션 프로그램이 동작할 수 있는 제 1 환경 및 제 2 환경을 제공하고,상기 제 1 환경에서만 동작하는 제 1 어플리케이션을 설치하고,상기 제 1 환경 및 제 2 환경 중 적어도 하나에서 선택적으로 동작하는 제 2 어플리케이션을 설치하고,상기 제 2 어플리케이션이 상기 제 1 환경에서 동작 중에 발생된 제 1 데이터에 대하여는, 상기 제 1 어플리케이션에 의한 접근을 허용하고,상기 제 2 어플리케이션이 상기 제 2 환경에서 동작 중에 발생된 제 2 데이터에 대하여는, 상기 제 1 어플리케이션에 의한 접근을 허용하지 않고,상기 제 1 어플리케이션이 상기 제 1 환경에서 동작 중에 발생된 제 3 데이터에 대하여는, 상기 제 2 어플리케이션에 의한 접근을 허용하며, 상기 제 2 어플리케이션을 설치할 때, 사용자의 입력 없이, 상기 제 2 어플리케이션을, 적어도 상기 제 2 환경에 할당하는 인스트럭션들을 저장하는 것을 특징으로 하는 장치."}
{"patent_id": "10-2015-0023689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 제 2 어플리케이션은, 상기 제 2 환경과 연관된 어플리케이션인지 여부를 지시하는 메타데이터를 포함하는전자 장치."}
{"patent_id": "10-2015-0023689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 프로세서는, 상기 메타데이터에 근거하여, 상기 전자 장치에 미생성된 제 2 환경을 생성하는 전자 장치."}
{"patent_id": "10-2015-0023689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 2 항에 있어서,상기 메타데이터는, 특정 데이터, 상기 제 2 어플리케이션의 보안 레벨 및 보안을 위한 인증 관련 데이터 중 적어도 하나를 포함하는 전자 장치."}
{"patent_id": "10-2015-0023689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4 항에 있어서,상기 프로세서는, 상기 보안 레벨에 따라서 보안을 위한 제 2 환경에 상기 제 2 어플리케이션을 할당할지 여부를 판단하는 전자 장치."}
{"patent_id": "10-2015-0023689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2016-0100760-3-제 1 항에 있어서,상기 통신 모듈은, 보안 서버로 상기 제 2 어플리케이션에 대한 인증 요청을 송신하고, 상기 보안 서버로부터상기 인증 요청에 응답하는 인증 결과를 수신하는 전자 장치."}
{"patent_id": "10-2015-0023689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서,상기 프로세서는, 상기 인증 결과에 근거하여, 상기 제 2 어플리케이션을 상기 제 2 환경에 할당 여부를 결정하고, 상기 결정된 할당 여부에 따라서 상기 제 2 어플리케이션을 상기 제 2 환경에 할당하는 전자 장치."}
{"patent_id": "10-2015-0023689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 6 항에 있어서,상기 인증 요청은, 인증을 위한 보안 키 및 상기 보안 키에 의하여 암호화된 값 중 적어도 하나를 포함하는 전자 장치."}
{"patent_id": "10-2015-0023689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1 항에 있어서,상기 프로세서는, 상기 제 1 환경 및 상기 제 2 환경에 할당된 어플리케이션의 실행을 위한 실행 아이콘을 단일화면에 표시하도록 제어하는 전자 장치."}
{"patent_id": "10-2015-0023689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 1 항에 있어서,상기 제 2 환경은, 사용자 식별자 별로 대응되는 전자 장치."}
{"patent_id": "10-2015-0023689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "적어도 하나의 어플리케이션 프로그램이 동작할 수 있는 제 1 환경 및 제 2 환경을 제공하는 동작;상기 제 1 환경에서만 동작하는 제 1 어플리케이션을 설치하는 동작;상기 제 1 환경 및 제 2 환경 중 적어도 하나에서 선택적으로 동작하는 제 2 어플리케이션을 설치하고,상기 제 2 어플리케이션이 상기 제 1 환경에서 동작 중에 발생된 제 1 데이터에 대하여는, 상기 제 1 어플리케이션에 의한 접근을 허용하고,상기 제 2 어플리케이션이 상기 제 2 환경에서 동작 중에 발생된 제 2 데이터에 대하여는, 상기 제 1 어플리케이션에 의한 접근을 허용하지 않고,상기 제 1 어플리케이션이 상기 제 1 환경에서 동작 중에 발생된 제 3 데이터에 대하여는, 상기 제 2 어플리케이션에 의한 접근을 허용하는 동작; 및 상기 제 2 어플리케이션을 설치할 때, 사용자의 입력 없이, 상기 제 2 어플리케이션을, 적어도 상기 제 2 환경에 할당하는 동작을 포함하는 전자 장치의 제어 방법."}
{"patent_id": "10-2015-0023689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11항에 있어서,상기 제 2 어플리케이션은, 상기 제 2 환경과 연관된 어플리케이션인지 여부를 지시하는 메타데이터를 포함하는전자 장치의 제어 방법."}
{"patent_id": "10-2015-0023689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 12 항에 있어서,공개특허 10-2016-0100760-4-상기 메타데이터에 근거하여, 상기 전자 장치에 미생성된 제2환경을 생성하는 동작을 더 포함하는 전자 장치의 제어 방법."}
{"patent_id": "10-2015-0023689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 12 항에 있어서,상기 메타데이터는, 특정 데이터, 상기 제 1 어플리케이션의 보안 레벨 및 보안을 위한 인증 관련 데이터 중 적어도 하나를 포함하는 전자 장치의 제어 방법."}
{"patent_id": "10-2015-0023689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 14 항에 있어서,상기 보안 레벨에 따라서 보안을 위한 상기 제2환경에 상기 제 2 어플리케이션을 할당할지 여부를 판단하는 동작을 더 포함하는 전자 장치의 제어 방법."}
{"patent_id": "10-2015-0023689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "어플리케이션을 제작하는 전자 장치의 제어 방법에 있어서,어플리케이션 식별자 및 보안 키를 획득하는 동작;보안 서버로 상기 어플리케이션 식별자 및 상기 보안 키를 송신하는 동작;샌드 박스에서 실행하는 어플리케이션인지 여부를 지시하는 메타데이터를 포함하는 어플리케이션을 제작하는 동작; 및상기 제작된 어플리케이션 및 상기 보안 키를 어플리케이션 마켓으로 송신하는 동작을 포함하는 전자 장치의 제어 방법."}
{"patent_id": "10-2015-0023689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "전자 장치에 있어서,통신 모듈;상기 통신 모듈과 전기적으로 연결된 프로세서; 및상기 프로세서와 전기적으로 연결된 메모리를 포함하며,상기 메모리는, 실행시에, 상기 프로세서가,적어도 하나의 어플리케이션 프로그램이 동작할 수 있는 제 1 영역, 및 상기 제 1 영역과 동작 환경이 적어도일부 상이한 제 2 영역을 제공하고,상기 제 1 영역에서, 사용자의 제 1 입력에 적어도 일부 응답하여, 상기 통신 모듈을 통하여, 외부 서버에 의하여 제공되는 어플리케이션 마켓에 접속하고,상기 제 1 영역에서, 사용자의 제 2 입력에 적어도 일부 응답하여, 상기 어플리케이션 마켓으로부터 선택된 제1 어플리케이션을 다운로드하고,상기 다운로드된 제 1 어플리케이션을 상기 전자 장치에 설치하고,사용자의 입력 없이, 상기 다운로드된 제 1 어플리케이션을 상기 제 2 영역에 할당하도록 하는 인스트럭션들을저장하는 것을 특징으로 하는 장치."}
{"patent_id": "10-2015-0023689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 17 항에 있어서,상기 통신 모듈은, 제 1 어플리케이션에 대한 인증 요청을 보안 서버로 송신하고, 상기 인증 요청에 응답하여공개특허 10-2016-0100760-5-상기 보안 서버로부터 도메인 식별자를 수신하는 전자 장치."}
{"patent_id": "10-2015-0023689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 17 항에 있어서,상기 프로세서는, 상기 수신된 도메인 식별자에 대응하는 상기 제 2 영역에 상기 제 1 어플리케이션을 할당하는전자 장치."}
{"patent_id": "10-2015-0023689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 18 항에 있어서,상기 인증 요청은, 인증을 위한 보안 키 및 상기 보안 키에 의하여 암호화된 값 중 적어도 하나를 포함하는 전자 장치."}
{"patent_id": "10-2015-0023689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제 17 항에 있어서,상기 통신 모듈은, 상기 제 1 어플리케이션에 연관되는 도메인 식별자를 상기 제 1 어플리케이션과 함께 상기어플리케이션 마켓으로부터 수신하는 전자 장치."}
{"patent_id": "10-2015-0023689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제 21 항에 있어서,상기 프로세서는, 상기 수신된 도메인 식별자에 대응하는 상기 제 2 영역에 상기 제 1 어플리케이션을 할당하는전자 장치."}
{"patent_id": "10-2015-0023689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제 18 항 또는 제 21 항에 있어서,상기 프로세서는, 상기 수신된 도메인 식별자에 대응하는 관리용 도메인 식별자와 상기 관리용 도메인 식별자사이의 연관 정보를 저장하도록 제어하는 전자 장치."}
{"patent_id": "10-2015-0023689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제 18 항 또는 제 21 항에 있어서,상기 프로세서는, 상기 수신된 도메인 식별자에 대응하는 도메인이 존재하는지를 판단하는 전자 장치."}
{"patent_id": "10-2015-0023689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제 24 항에 있어서,상기 프로세서는, 상기 수신된 도메인 식별자에 대응하는 상기 제 2 영역이 존재하면, 상기 대응하는 상기 제 2영역에 상기 제 1 어플리케이션을 할당하고, 상기 수신된 도메인 식별자에 대응하는 도메인이 존재하지 않으면,상기 수신된 도메인 식별자에 대응하는 상기 제 2 영역을 생성하고, 생성된 상기 제 2 영역에 상기 제 1 어플리케이션을 할당하는 전자 장치."}
{"patent_id": "10-2015-0023689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "제 17 항에 있어서,상기 프로세서는, 상기 제 2 영역과 연관된, 상기 제 1 어플리케이션에 대한 명령을 수행하는 전자 장치."}
{"patent_id": "10-2015-0023689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "제 17 항에 있어서,상기 프로세서는, 상기 제 1 어플리케이션을, 제 1 환경 또는 제 2 환경 내에 할당하는 전자 장치.공개특허 10-2016-0100760-6-청구항 28 제 17 항에 있어서,상기 프로세서는, 상기 제 1 어플리케이션을 삭제하는 경우에, 상기 제 1 어플리케이션에 대응하는 상기 제 2영역과 연관되는 어플리케이션이 존재하는지를 판단하여, 상기 판단 결과에 따라 상기 제 2 영역의 유지 여부를결정하는 전자 장치."}
{"patent_id": "10-2015-0023689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "제 17 항에 있어서,상기 프로세서는, 상기 제 1 어플리케이션이 상기 제 2 영역에 할당되는지 여부를 지시하는 메타데이터를 확인하고, 상기 확인 결과에 따라서 상기 제 1 어플리케이션을 상기 제 2 영역에 할당하는 전자 장치."}
{"patent_id": "10-2015-0023689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_30", "content": "제 16 항에 있어서,상기 통신 모듈은, 상기 제 1 어플리케이션과 연관된 제 2 어플리케이션을 다운로드받는 전자 장치."}
{"patent_id": "10-2015-0023689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_31", "content": "제 30 항에 있어서,상기 프로세서는, 상기 제 2 어플리케이션을 상기 제 2 영역에 할당하는 전자 장치."}
{"patent_id": "10-2015-0023689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_32", "content": "전자 장치의 제어 방법에 있어서,적어도 하나의 어플리케이션 프로그램이 동작할 수 있는 제 1 영역, 및 상기 제 1 영역과 동작 환경이 적어도일부 상이한 제 2 영역을 제공하는 동작;상기 제 1 영역에서, 사용자의 제 1 입력에 적어도 일부 응답하여, 통신 모듈을 통하여, 외부 서버에 의하여 제공되는 어플리케이션 마켓에 접속하는 동작;상기 제 1 영역에서, 사용자의 제 2 입력에 적어도 일부 응답하여, 상기 어플리케이션 마켓으로부터 선택된 제1 어플리케이션을 다운로드하는 동작;상기 다운로드된 제 1 어플리케이션을 상기 전자 장치에 설치하는 동작; 및사용자의 입력 없이, 상기 다운로드된 제 1 어플리케이션을 상기 제 2 영역에 할당하도록 하는 동작을 포함하는 전자 장치의 제어 방법."}
{"patent_id": "10-2015-0023689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_33", "content": "제 32 항에 있어서,제 1 어플리케이션에 대한 인증 요청을 보안 서버로 송신하고, 상기 인증 요청에 응답하여 상기 보안 서버로부터 도메인 식별자를 수신하는 동작을 더 포함하는 전자 장치의 제어 방법."}
{"patent_id": "10-2015-0023689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_34", "content": "제 33 항에 있어서,상기 제 1 어플리케이션을 상기 제 2 영역에 할당하도록 하는 동작은, 상기 수신된 도메인 식별자에 대응하는상기 제 2 영역에 상기 제 1 어플리케이션을 할당하는 전자 장치의 제어 방법."}
{"patent_id": "10-2015-0023689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_35", "content": "공개특허 10-2016-0100760-7-제 32 항에 있어서,상기 제 1 어플리케이션에 연관되는 도메인 식별자를 상기 제 1 어플리케이션과 함께 상기 어플리케이션 마켓으로부터 수신하는 동작을 더 포함하는 전자 장치의 제어 방법."}
{"patent_id": "10-2015-0023689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_36", "content": "제 35 항에 있어서,제 1 어플리케이션을 상기 제 2 영역에 할당하도록 하는 동작은, 상기 수신된 도메인 식별자에 대응하는 상기제 2 영역에 상기 제 1 어플리케이션을 할당하는 전자 장치의 제어 방법."}
{"patent_id": "10-2015-0023689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_37", "content": "제 33 항 또는 제 35 항에 있어서,상기 수신된 도메인 식별자에 대응하는 관리용 도메인 식별자와 상기 관리용 도메인 식별자 사이의 연관 정보를저장하는 동작을 더 포함하는 전자 장치의 제어 방법."}
{"patent_id": "10-2015-0023689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_38", "content": "제 33 항 또는 제 35 항에 있어서,상기 수신된 도메인 식별자에 대응하는 도메인이 존재하는지를 판단하는 동작을 더 포함하는 전자 장치의 제어 방법."}
{"patent_id": "10-2015-0023689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_39", "content": "제 38 항에 있어서,상기 수신된 도메인 식별자에 대응하는 상기 제 2 영역이 존재하면, 상기 대응하는 상기 제 2 영역에 상기 제 1어플리케이션을 할당하고, 상기 수신된 도메인 식별자에 대응하는 도메인이 존재하지 않으면, 상기 수신된 도메인 식별자에 대응하는 상기 제 2 영역을 생성하고, 생성된 상기 제 2 영역에 상기 제 1 어플리케이션을 할당하는 동작을 더 포함하는 전자 장치의 제어 방법."}
{"patent_id": "10-2015-0023689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_40", "content": "제 32 항에 있어서,제 1 어플리케이션을 상기 제 2 영역에 할당하도록 하는 동작은, 상기 제 1 어플리케이션이 상기 제 2 영역에할당되는지 여부를 지시하는 메타데이터를 확인하고, 상기 확인 결과에 따라서 상기 제 1 어플리케이션을 상기제 2 영역에 할당하는 전자 장치의 제어 방법."}
{"patent_id": "10-2015-0023689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_41", "content": "제 32 항에 있어서,상기 제 1 어플리케이션과 연관된 제 2 어플리케이션을 다운로드받는 동작을 더 포함하는 전자 장치의 제어 방법."}
{"patent_id": "10-2015-0023689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_42", "content": "제 41 항에 있어서,상기 제 2 어플리케이션을 상기 제 2 영역에 할당하는 동작공개특허 10-2016-0100760-8-을 더 포함하는 전자 장치의 제어 방법."}
{"patent_id": "10-2015-0023689", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "전자 장치의 제어 방법이 개시된다. 본 발명의 다양한 실시예에 따른 전자 장치의 제어 방법은, 샌드 박스에서 실행하는 어플리케이션인지 여부를 지시하는 제 1 어플리케이션을 수신하는 동작 및 상기 샌드 박스에서 실행하 는 어플리케이션인지 여부에 따라서, 상기 제 1 어플리케이션을 상기 샌드 박스에 할당하는 동작을 포함할 수 있 다."}
{"patent_id": "10-2015-0023689", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 어플리케이션을 설치하는 전자 장치 및 그 제어 방법에 관한 것으로, 더욱 상세하게 어플리케이션을 다운로드하고 다운로드된 어플리케이션을 설치 및 실행하는 전자 장치 및 그 제어 방법에 관한 것이다."}
{"patent_id": "10-2015-0023689", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "사용자들 간에 무선 통신을 제공하는 이동 단말기들이 개발되어 있다. 기술의 진보에 따라, 무선 단말기들은 이제 단순한 전화 통화를 벗어나 많은 부가의 사양들을 제공하고 있다. 예컨대, 이동 단말기들은 이제 알람, 단문 메시지 서비스(short messaging service; SMS), 멀티미디어 메시지 서비스(multimedia message service; MMS), E-메일, 게임, 근거리 통신의 원격 제어, 탑재된 디지털 카메라를 사용한 이미지 캡처링 기능, 오디오 및 비디오 콘텐츠 제공을 위한 멀티미디어 기능, 스케줄링 기능, 및 기타 유사한 기능들과 같은 부가 기능들을 제 공하고 있다. 또한, 이동 단말기들은 전술한 기능들을 제공할 수 있거나 또는 이동 단말기들 상의 다른 기능들을 제공할 수 있는 애플리케이션들을 다운로드, 설치 및 실행할 수 있다. 예컨대, 그러한 애플리케이션들은 음악 재생 애플 리케이션, 비디오 재생 애플리케이션, 포토 갤러리 애플리케이션, 게임 애플리케이션, 소셜 네트워킹 애플리케 이션, 인터넷 브라우징 애플리케이션, 파일 관리 애플리케이션, 클라우드 서비스 애플리케이션, 및 임의의 다른 유사한 애플리케이션들을 포함할 수 있다. 한편, 이동 단말기의 운영 체제(operating system; OS), 예컨대 안드로이드 OS 또는 임의의 다른 유사한 OS는 애플리케이션들을 샌드박스(sandbox)에 포함되는 그룹으로 분류하여 실행 시에 또는 런타임 하는 경우에 샌드박 스 내의 애플리케이션들과 그 애플리케이션들에 대한 각각의 애플리케이션 데이터 및 코드 실행이 이동 단말기 의 나머지 것들과 분리되도록 할 수 있다. 이에 따라, 샌드박스 내의 애플리케이션들이 샌드박스에 포함된 다 른 애플리케이션들과만 공유되도록 할 수 있다."}
{"patent_id": "10-2015-0023689", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상술한 샌드 박스는 보안 권한을 가진 관리자에 의하여 설정될 수 있다. 더욱 상세하게는, 보안 권한을 가진 관리자가 OS에 로그인한 경우에, 전자 장치는 어플리케이션을 관리자의 명령에 근거하여 샌드 박스에 포함시킬 수 있다. 즉, 기존의 샌드 박스는, 보안 권한을 가진 관리자에 의하여 설정될 뿐, 전자 장치가 어플리케이션 설치 시점에, 어플리케이션 관련 데이터를 판단하여 샌드 박스내에 할당될 지 여부를 결정하는 기술에 대하여서 는 개시된 바가 없다. 이에 따라, 어플리케이션 개발자 또는 어플리케이션 제공자는 어플리케이션이 설치 및 실행되는 전자 장치내 독 립 공간, 예를 들어 샌드 박스를 보장 받을 수 없었다. 즉, 전자 장치가 어플리케이션 관련 데이터만에 기초하 여 샌드 박스 내의 할당하는 기술 개발이 요청되는 실정이다. 본 발명은 상술한 문제점 또는 다른 문제점을 해결하면서, 상술한 기술 개발 요청에 응답하여 안출된 것이다."}
{"patent_id": "10-2015-0023689", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 다양한 실시예에서, 전자 장치는, 통신 모듈; 상기 통신 모듈과 전기적으로 연결된 프로세서; 및 상 기 프로세서와 전기적으로 연결된 메모리를 포함하며, 상기 메모리는, 실행시에, 상기 프로세서가, 적어도 하나 의 어플리케이션 프로그램이 동작할 수 있는 제 1 환경 및 제 2 환경을 제공하고, 상기 제 1 환경에서만 동작하 는 제 1 어플리케이션을 설치하고, 상기 제 1 환경 및 제 2 환경 중 적어도 하나에서 선택적으로 동작하는 제 2 어플리케이션을 설치하고, 상기 제 2 어플리케이션이 상기 제 1 환경에서 동작 중에 발생된 제 1 데이터에 대하 여는, 상기 제 1 어플리케이션에 의한 접근을 허용하고, 상기 제 2 어플리케이션이 상기 제 2 환경에서 동작 중 에 발생된 제 2 데이터에 대하여는, 상기 제 1 어플리케이션에 의한 접근을 허용하지 않고, 상기 제 1 어플리케이션이 상기 제 1 환경에서 동작 중에 발생된 제 3 데이터에 대하여는, 상기 제 2 어플리케이션에 의한 접근을 허용하며, 상기 제 2 어플리케이션을 설치할 때, 사용자의 입력 없이, 상기 제 2 어플리케이션을, 적어도 상기 제 2 환경에 할당하는 인스트럭션들을 저장할 수 있다. 본 발명의 다양한 실시예에서, 전자 장치의 제어 방법은, 적어도 하나의 어플리케이션 프로그램이 동작할 수 있 는 제 1 환경 및 제 2 환경을 제공하는 동작, 상기 제 1 환경에서만 동작하는 제 1 어플리케이션을 설치하는 동 작, 상기 제 1 환경 및/또는 제 2 환경에서 선택적으로 동작하는 제 2 어플리케이션을 설치하는 동작, 상기 제 2 어플리케이션이 상기 제 1 환경에서 동작 중에 발생된 제 1 데이터에 대하여는, 상기 제 1 어플리케이션에 의 한 접근을 허용하는 동작, 상기 제 2 어플리케이션이 상기 제 2 환경에서 동작 중에 발생된 제 2 데이터에 대하 여는, 상기 제 1 어플리케이션에 의한 접근을 허용하지 않는 동작, 상기 제 1 어플리케이션이 상기 제 1 환경에 서 동작 중에 발생된 제 3 데이터에 대하여는, 상기 제 2 어플리케이션에 의한 접근을 허용하는 동작, 및 상기 제 2 어플리케이션을 설치할 때, 사용자의 입력 없이, 상기 제 2 어플리케이션을, 적어도 상기 제 2 환경에 할 당하는 동작을 포함할 수 있다. 본 발명의 다양한 실시예에서, 전자 장치는, 통신 모듈; 상기 통신 모듈과 전기적으로 연결된 프로세서; 및 상 기 프로세서와 전기적으로 연결된 메모리를 포함하며, 상기 메모리는, 실행시에, 상기 프로세서가, 적어도 하나 의 어플리케이션 프로그램이 동작할 수 있는 제 1 영역, 및 상기 제 1 영역과 동작 환경이 적어도 일부 상이한 제 2 영역을 제공하고, 상기 제 1 영역에서, 사용자의 제 1 입력에 적어도 일부 응답하여, 상기 통신 모듈을 통 하여, 외부 서버에 의하여 제공되는 어플리케이션 마켓에 접속하고, 상기 제 1 영역에서, 사용자의 제 2 입력에 적어도 일부 응답하여, 상기 어플리케이션 마켓으로부터 선택된 제 1 어플리케이션을 다운로드하고, 상기 다운 로드된 제 1 어플리케이션을 상기 전자 장치에 설치하고, 사용자의 입력 없이, 상기 다운로드된 제 1 어플리케 이션을 상기 제 2 영역에 할당하도록 하는 인스트럭션들을 저장할 수 있다. 본 발명의 다양한 실시예에서, 전자 장치의 제어 방법은, 적어도 하나의 어플리케이션 프로그램이 동작할 수 있 는 제 1 영역, 및 상기 제 1 영역과 동작 환경이 적어도 일부 상이한 제 2 영역을 제공하는 동작; 상기 제 1 영 역에서, 사용자의 제 1 입력에 적어도 일부 응답하여, 상기 통신 모듈을 통하여, 외부 서버에 의하여 제공되는 어플리케이션 마켓에 접속하는 동작; 상기 제 1 영역에서, 사용자의 제 2 입력에 적어도 일부 응답하여, 상기 어플리케이션 마켓으로부터 선택된 제 1 어플리케이션을 다운로드하는 동작; 및 상기 다운로드된 제 1 어플리케 이션을 상기 전자 장치에 설치하는 동작; 사용자의 입력 없이, 상기 다운로드된 제 1 어플리케이션을 상기 제 2 영역에 할당하도록 하는 동작을 포함할 수 있다. 본 발명의 다양한 실시예에서, 전자 장치는, 제 1 어플리케이션을 수신하는 통신 모듈; 및 상기 제 1 어플리케 이션을 설치하고, 상기 제 1 어플리케이션에 대응하는 도메인에 상기 제 1 어플리케이션을 할당하는 프로세서를 포함할 수 있다. 본 발명의 다양한 실시예에서, 전자 장치의 제어 방법은, 제 1 어플리케이션을 수신하는 동작; 및 상기 제 1 어 플리케이션을 설치하고, 상기 제 1 어플리케이션에 대응하는 도메인에 상기 제 1 어플리케이션을 할당하는 동작 을 포함할 수 있다."}
{"patent_id": "10-2015-0023689", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 다양한 실시예에 따라서 어플리케이션 다운로드 및 설치 시, 샌드 박스 내에 어플리케이션을 할당하 는 전자 장치 및 그 제어 방법이 제공될 수 있다. 이에 따라, 어플리케이션 개발자 또는 어플리케이션 제작자 는, 어플리케이션이 설치 및 실행되는 독립 공간, 예를 들어 샌드 박스 또는 도메인을 보장받을 수 있다. 아울 러, 어플리케이션내에 샌드 박스 또는 도메인에 할당 및 실행이 되어야 함을 지시하는 정보가 구현됨에 따라서, 전자 장치는 어플리케이션을 독립 공간에서 관리할 수 있다. 이에 따라, 사용자가 특정 어플리케이션에 대응하 여 직접 샌드 박스를 설정할 필요 없이, 해당 어플리케이션이 다운로드 시부터 샌드 박스 내에 할당될 수 있다."}
{"patent_id": "10-2015-0023689", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 개시의 다양한 실시예가 첨부된 도면을 참조하여 기재된다. 그러나, 이는 본 개시를 특정한 실시 형태 에 대해 한정하려는 것이 아니며, 본 개시의 실시예의 다양한 변경(modification), 균등물(equivalent), 및/또 는 대체물(alternative)을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해 서는 유사한 참조 부호가 사용될 수 있다. 본 문서에서, “가진다,” “가질 수 있다,”“포함한다,” 또는 “포함할 수 있다” 등의 표현은 해당 특징(예: 수치, 기능, 동작, 또는 부품 등의 구성요소)의 존재를 가리키며, 추가적인 특징의 존재를 배제하지 않는다. 본 문서에서, “A 또는 B,”“A 또는/및 B 중 적어도 하나,”또는 “A 또는/및 B 중 하나 또는 그 이상”등의 표현은 함께 나열된 항목들의 모든 가능한 조합을 포함할 수 있다. 예를 들면, “A 또는 B,” “ A 및 B 중 적 어도 하나,”또는 “ A 또는 B 중 적어도 하나”는, 적어도 하나의 A를 포함, 적어도 하나의 B를 포함, 또는 적어도 하나의 A 및 적어도 하나의 B 모두를 포함하는 경우를 모두 지칭할 수 있다. 다양한 실시예에서 사용된 “제 1,”“제 2,”“첫째,”또는“둘째,”등의 표현들은 다양한 구성요소들을, 순서 및/또는 중요도에 상관없이 수식할 수 있고, 해당 구성요소들을 한정하지 않는다. 상기 표현들은 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 수 있다. 예를 들면, 제 1 사용자 기기와 제 2 사용자 기기는, 순서 또 는 중요도와 무관하게, 서로 다른 사용자 기기를 나타낼 수 있다. 예를 들면, 본 개시의 권리 범위를 벗어나지 않으면서 제 1 구성요소는 제 2 구성요소로 명명될 수 있고, 유사하게 제 2 구성요소도 제 1 구성요소로 바꾸어 명명될 수 있다. 어떤 구성요소(예: 제 1 구성요소)가 다른 구성요소(예: 제 2 구성요소)에 \"(기능적으로 또는 통신적으로) 연결 되어((operatively or communicatively) coupled with/to)\" 있다거나 \"접속되어(connected to)\" 있다고 언급된 때에는, 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로 연결되거나, 다른 구성요소(예: 제 3 구성요소)를 통하여 연결될 수 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소(예: 제 1 구성요소)가 다 른 구성요소(예: 제 2 구성요소)에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 상기 어 떤 구성요소와 상기 다른 구성요소 사이에 다른 구성요소(예: 제 3 구성요소)가 존재하지 않는 것으로 이해될 수 있다. 본 문서에서 사용된 표현 “~하도록 구성된(또는 설정된)(configured to)”은 상황에 따라, 예를 들면, “~에 적합한(suitable for),” “~하는 능력을 가지는(having the capacity to),” “~하도록 설계된(designed t o),” “~하도록 변경된(adapted to),” “~하도록 만들어진(made to),”또는 “~를 할 수 있는(capable of)” 과 바꾸어 사용될 수 있다. 용어 “~하도록 구성(또는 설정)된”은 하드웨어적으로 “특별히 설계된 (specifically designed to)”것만을 반드시 의미하지 않을 수 있다. 대신, 어떤 상황에서는, “~하도록 구성된 장치”라는 표현은, 그 장치가 다른 장치 또는 부품들과 함께 “~할 수 있는” 것을 의미할 수 있다. 예를 들면, 문구 “A, B, 및 C를 수행하도록 구성(또는 설정)된 프로세서”는 해당 동작을 수행하기 위한 전용 프로 세서(예: 임베디드 프로세서), 또는 메모리 장치에 저장된 하나 이상의 소프트웨어 프로그램들을 실행함으로써, 해당 동작들을 수행할 수 있는 범용 프로세서(generic-purpose processor)(예: CPU 또는 application processor)를 의미할 수 있다. 본 문서에서 사용된 용어들은 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 다른 실시예의 범위를 한정 하려는 의도가 아닐 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 개시의 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가질 수 있다. 일반적으로 사용되는 사전에 정 의된 용어들은 관련 기술의 문맥 상 가지는 의미와 동일 또는 유사한 의미를 가지는 것으로 해석될 수 있으며, 본 문서에서 명백하게 정의되지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 경우에 따 라서, 본 문서에서 정의된 용어일지라도 본 개시의 실시예들을 배제하도록 해석될 수 없다. 본 개시의 다양한 실시예들에 따른 전자 장치는, 예를 들면, 전자 장치는 스마트폰(smartphone), 태블릿 PC(tablet personal computer), 이동 전화기(mobile phone), 화상 전화기, 전자북 리더기(e-book reader), 데스크탑 PC(desktop personal computer), 랩탑 PC(laptop personal computer), 넷북 컴퓨터(netbook computer), 워크스테이션(workstation), 서버, PDA(personal digital assistant), PMP(portable multimedia player), MP3 플레이어, 모바일 의료기기, 카메라(camera), 또는 웨어러블 장치(wearable device)(예: 스마트 안경, 머리 착용형 장치(head-mounted-device(HMD)), 전자 의복, 전자 팔찌, 전자 목걸이, 전자 앱세서리 (appcessory), 전자 문신, 스마트 미러, 또는 스마트 와치(smart watch))중 적어도 하나를 포함할 수 있다. 어떤 실시예들에서, 전자 장치는 스마트 가전 제품(smart home appliance)일 수 있다. 스마트 가전 제품은, 예 를 들면, 텔레비전, DVD(digital video disk) 플레이어, 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스(set-top box), 홈 오토매이션 컨트롤 패널(home automation control panel), 보안 컨트롤 패널(security control panel), TV 박스(예: 삼성 HomeSync™, 애플TV™, 또는 구글 TV™), 게임 콘솔(예: Xbox™, PlayStation™), 전자 사전, 전자 키, 캠코더(camcorder), 또는 전자 액자 중 적어도 하나를 포함할 수 있다. 다른 실시예에서, 전자 장치는, 각종 의료기기(예: 각종 휴대용 의료측정기기(혈당 측정기, 심박 측정기, 혈압 측정기, 또는 체온 측정기 등), MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 또는 초음파기 등), 네비게이션(navigation) 장치, GPS 수신기(global positioning system receiver), EDR(event data recorder), FDR(flight data recorder), 자동차 인포테인먼트 (infotainment) 장치, 선박용 전자 장비(예: 선박용 항법 장치, 자이로 콤파스 등), 항공 전자기기(avionics), 보안 기기, 차량용 헤드 유닛(head unit), 산업용 또는 가정용 로봇, 금융 기관의 ATM(automatic teller’s machine), 상점의 POS(point of sales), 또는 사물 인터넷 장치(internet of things)(예: 전구, 각종 센서, 전 기 또는 가스 미터기, 스프링클러 장치, 화재경보기, 온도조절기(thermostat), 가로등, 토스터(toaster), 운동 기구, 온수탱크, 히터, 보일러 등) 중 적어도 하나를 포함할 수 있다. 어떤 실시예에 따르면, 전자 장치는 가구(furniture) 또는 건물/구조물의 일부, 전자 보드(electronic board), 전자 사인 수신 장치(electronic signature receiving device), 프로젝터(projector), 또는 각종 계측 기기(예: 수도, 전기, 가스, 또는 전파 계측 기기 등) 중 적어도 하나를 포함할 수 있다. 다양한 실시예에서, 전자 장치는 전술한 다양한 장치들 중 하나 또는 그 이상의 조합일 수 있다. 어떤 실시예에 따른 전자 장치는 플렉서블 전자 장치일 수 있다. 또한, 본 개시의 실시예에 따른 전자 장치는 전술한 기기들에 한정되지 않으며, 기술 발전에 따른 새로운 전자 장치를 포함할 수 있다. 이하, 첨부 도면을 참조하여, 다양한 실시예에 따른 전자 장치가 설명된다. 본 문서에서, 사용자라는 용어는 전 자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공지능 전자 장치)를 지칭할 수 있다. 도 1을 참조하여, 다양한 실시예에서의, 네트워크 환경 내의 전자 장치가 개시된다. 상기 전자 장치 는 버스, 프로세서, 메모리, 입출력 인터페이스, 디스플레이 및 통신 인터페이 스를 포함할 수 있다. 어떤 실시예에서는, 전자 장치는, 상기 구성요소들 중 적어도 하나를 생략하거 나 다른 구성 요소를 추가적으로 구비할 수 있다. 상기 버스는, 예를 들면, 상기 구성 요소들(120~170)을 서로 연결하고, 상기 구성요소들 간의 통신(예: 제 어 메시지 및/또는 데이터)을 전달하는 회로를 포함할 수 있다. 상기 프로세서는, 중앙처리장치(central processing unit(CPU)), 어플리케이션 프로세서(application processor(AP)), 또는 커뮤니케이션 프로세서(communication processor(CP)) 중 하나 또는 그 이상을 포함할 수 있다. 상기 프로세서은, 예를 들면, 상기 전자 장치의 적어도 하나의 다른 구성요소들의 제어 및 /또는 통신에 관한 연산이나 데이터 처리를 실행할 수 있다. 상기 프로세서는 제어부(controller)라고 칭 하거나, 상기 제어부를 그 일부로서 포함할 수도 있다. 상기 메모리는, 휘발성 및/또는 비휘발성 메모리를 포함할 수 있다. 상기 메모리는, 예를 들면, 상 기 전자 장치의 적어도 하나의 다른 구성요소에 관계된 명령 또는 데이터를 저장할 수 있다. 한 실시예에 따르면, 상기 메모리는 소프트웨어 및/또는 프로그램을 저장할 수 있다. 상기 프로그램은, 예를 들면, 커널, 미들웨어, 어플리케이션 프로그래밍 인터페이스(application programming interface(API)), 및/또는 어플리케이션 프로그램(또는 “어플리케이션”) 등을 포함할 수 있다. 상 기 커널, 미들웨어, 또는 API의 적어도 일부는, 운영 시스템(operating system(OS))라 불릴 수 있다. 상기 커널은, 예를 들면, 다른 프로그램들(예: 미들웨어, API, 또는 어플리케이션 프로그램 )에 구현된 동작 또는 기능을 실행하는 데 사용되는 시스템 리소스들(예: 버스, 프로세서, 또는 메모리 등)을 제어 또는 관리할 수 있다. 또한, 상기 커널은 상기 미들웨어, 상기 API, 또 는 상기 어플리케이션 프로그램에서 상기 전자 장치의 개별 구성요소에 접근함으로써, 시스템 리소스 들을 제어 또는 관리할 수 있는 인터페이스를 제공할 수 있다. 상기 미들웨어는, 예를 들면, 상기 API 또는 상기 어플리케이션 프로그램이 상기 커널과 통신하여 데이터를 주고받을 수 있도록 중개 역할을 수행할 수 있다. 또한, 상기 미들웨어는 상기 어플리 케이션 프로그램로부터 수신된 작업 요청들과 관련하여, 예를 들면, 상기 어플리케이션 프로그램 중 적어도 하나의 어플리케이션에 상기 전자 장치의 시스템 리소스(예: 버스, 프로세서, 또는 메모 리 등)를 사용할 수 있는 우선 순위를 배정하는 등의 방법을 이용하여 작업 요청에 대한 제어(예: 스케쥴 링 또는 로드 밸런싱)을 수행할 수 있다. 상기 API는, 예를 들면, 상기 어플리케이션이 상기 커널 또는 상기 미들웨어에서 제공되는 기능을 제어하기 위한 인터페이스로, 예를 들면, 파일 제어, 창 제어, 화상 처리, 또는 문자 제어 등을 위한 적 어도 하나의 인터페이스 또는 함수(예: 명령어)를 포함할 수 있다. 본 명세서에서, 어플리케이션은 어플리케이션 프로그램이라고 칭할 수도 있다. 상기 입출력 인터페이스은, 예를 들면, 사용자 또는 다른 외부 기기로부터 입력된 명령 또는 데이터를 상 기 전자 장치의 다른 구성요소(들)에 전달할 수 있는 인터페이스의 역할을 할 수 있다. 또한, 상기 입출력 인터페이스은 상기 전자 장치의 다른 구성요소(들)로부터 수신된 명령 또는 데이터를 사용자 또는 다 른 외부 기기로 출력할 수 있다. 상기 디스플레이는, 예를 들면, 액정 디스플레이(LCD), 발광 다이오드(LED) 디스플레이, 유기 발광 다이오 드(OLED) 디스플레이, 또는 마이크로 전자기계 시스템(microelectromechanical systems(MEMS)) 디스플레이, 또 는 전자종이(electronic paper) 디스플레이를 포함할 수 있다. 상기 디스플레이은, 예를 들면, 사용자에게 각종 콘텐츠(예: 텍스트, 이미지, 비디오, 아이콘, 또는 심볼 등)을 표시할 수 있다. 상기 디스플레이는, 터치 스크린을 포함할 수 있으며, 예를 들면, 전자 펜 또는 사용자의 신체의 일부를 이용한 터치, 제스쳐, 근접, 또는 호버링 입력을 수신할 수 있다. 상기 통신 인터페이스은, 예를 들면, 상기 전자 장치와 외부 장치(예: 제 1 외부 전자 장치, 제 2 외부 전자 장치, 또는 어플리케이션 마켓) 간의 통신을 설정할 수 있다. 예를 들면, 상기 통신 인 터페이스은 무선 통신 또는 유선 통신을 통해서 네트워크에 연결되어 상기 외부 장치(예: 제 2 외부 전자 장치 또는 어플리케이션 마켓)와 통신할 수 있다. 상기 무선 통신은, 예를 들면, 셀룰러 통신 프로토콜로서, 예를 들면, LTE, LTE-A, CDMA, WCDMA, UMTS, WiBro, 또는 GSM 등 중 적어도 하나를 사용할 수 있다. 상기 유선 통신은, 예를 들면, USB(universal serial bus), HDMI(high definition multimedia interface), RS-232(recommended standard 232), 또는 POTS(plain old telephone service) 등 중 적어도 하나를 포함할 수 있다. 상기 네트워크 162는 통신 네트워크 (telecommunications network), 예를 들면, 컴퓨터 네트워크(computer network)(예: LAN 또는 WAN), 인터넷, 또는 전화 망(telephone network) 중 적어도 하나를 포함할 수 있다. 상기 제 1 및 제 2 외부 전자 장치(102, 104) 각각은 상기 전자 장치와 동일한 또는 다른 종류의 장치일 수 있다. 한 실시예에 따르면, 상기 어플리케이션 마켓는 하나 또는 그 이상의 서버들의 그룹을 포함할 수 있다. 다양한 실시예에 따르면, 상기 전자 장치에서 실행되는 동작들의 전부 또는 일부는 다른 하나 또는 복수의 전자 장치(예: 전자 장치(102, 104), 또는 어플리케이션 마켓)에서 실행될 수 있다. 한 실시예에 따르면, 상기 전자 장치가 어떤 기능이나 서비스를 자동으로 또는 요청에 의하여 수행해야 할 경우에, 상 기 전자 장치는 상기 기능 또는 상기 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 그와 연관 된 적어도 일부 기능을 다른 장치(예: 전자 장치(102, 104), 또는 어플리케이션 마켓)에게 요청할 수 있다. 상기 다른 전자 장치(예: 전자 장치(102, 104), 또는 어플리케이션 마켓)는 상기 요청된 기능 또는 추가 기능을 실행하고, 그 결과를 상기 전자 장치로 전달할 수 있다. 상기 전자 장치는 수신된 결과 를 그대로 또는 추가적으로 처리하여 상기 요청된 기능이나 서비스를 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 본 발명의 다양한 실시예에서, 통신 모듈은 상술한 바와 같이, 프로세서와 전기적으로 연결될 수 있 다. 아울러, 프로세서는 메모리와 전기적으로 연결될 수 있다. 한편, 메모리는 프로세서가 하기의 동작들을 수행하도록 하는 인스트럭션들을 포함할 수 있다. 본 발명의 다양한 실시예에서 인스트 럭션들은, 적어도 하나의 어플리케이션 프로그램이 동작할 수 있는 제 1 환경 및 제 2 환경을 제공하는 동작, 상기 제 1 환경에서만 동작하는 제 1 어플리케이션을 설치하는 동작, 상기 제 1 환경 및 제 2 환경 중 적어도 하나에서 선택적으로 동작하는 제 2 어플리케이션을 설치하는 동작, 상기 제 2 어플리케이션이 상기 제 1 환경 에서 동작 중에 발생된 제 1 데이터에 대하여는, 상기 제 1 어플리케이션에 의한 접근을 허용하는 동작, 상기 제 2 어플리케이션이 상기 제 2 환경에서 동작 중에 발생된 제 2 데이터에 대하여는, 상기 제 1 어플리케이션에 의한 접근을 허용하지 않는 동작, 상기 제 1 어플리케이션이 상기 제 1 환경에서 동작 중에 발생된 제 3 데이터 에 대하여는, 상기 제 2 어플리케이션에 의한 접근을 허용하는 동작, 상기 제 2 어플리케이션을 설치할 때, 사 용자의 입력 없이, 상기 제 2 어플리케이션을, 적어도 상기 제 2 환경에 할당하는 동작을 포함할 수 있다. 본 발명의 다양한 실시예에서, 상기 제 2 어플리케이션은, 상기 제 2 환경과 연관된 어플리케이션인지 여부를 지시하는 메타데이터를 포함할 수 있다. 본 발명의 다양한 실시예에서, 상기 프로세서는, 상기 메타데이터에 근거하여, 상기 전자 장치에 미생성된 제 2 환경을 생성할 수 있다. 본 발명의 다양한 실시예에서, 상기 메타데이터는, 특정 데이터, 상기 제 2 어플리케이션의 보안 레벨 및 보안 을 위한 인증 관련 데이터 중 적어도 하나를 포함할 수 있다. 본 발명의 다양한 실시예에서, 상기 프로세서는, 상기 보안 레벨에 따라서 보안을 위한 제 2 환경에 상기 제 2 어플리케이션을 할당할지 여부를 판단할 수 있다. 본 발명의 다양한 실시예에서, 상기 통신 모듈은, 보안 서버로 상기 제 2 어플리케이션에 대한 인증 요청 을 송신하고, 상기 보안 서버로부터 상기 인증 요청에 응답하는 인증 결과를 수신할 수 있다. 본 발명의 다양한 실시예에서, 상기 프로세서는, 상기 인증 결과에 근거하여, 상기 제 2 어플리케이션을 상기 제 2 환경에 할당 여부를 결정하고, 상기 결정된 할당 여부에 따라서 상기 제 2 어플리케이션을 상기 제 2 환경에 할당할 수 있다. 본 발명의 다양한 실시예에서, 상기 인증 요청은, 인증을 위한 보안 키 및 상기 보안 키에 의하여 암호화된 값 중 적어도 하나를 포함할 수 있다. 본 발명의 다양한 실시예에서, 상기 프로세서는, 상기 제 1 환경 및 상기 제 2 환경에 할당된 어플리케이 션의 실행을 위한 실행 아이콘을 단일 화면에 표시하도록 제어할 수 있다. 본 발명의 다양한 실시예에서, 상기 제 2 환경은, 사용자 식별자 별로 대응될 수 있다. 본 발명의 다양한 실시예에서, 통신 모듈은 상술한 바와 같이, 프로세서와 전기적으로 연결될 수 있 다. 아울러, 프로세서는 메모리와 전기적으로 연결될 수 있다. 한편, 메모리는 프로세서(12 0)가 하기의 동작들을 수행하도록 하는 인스트럭션들을 포함할 수 있다. 본 발명의 다양한 실시예에서 인스트 럭션들은, 적어도 하나의 어플리케이션 프로그램이 동작할 수 있는 제 1 영역, 및 상기 제 1 영역과 동작 환경 이 적어도 일부 상이한 제 2 영역을 제공하는 동작을 포함할 수 있다. 여기에서, 제 2 영역은 예를 들어 도메 인일 수 있으며, 제 1 영역은 도메인 이외의 영역으로 일반 영역 또는 샌드 박스 영역 등의 도메인 이외의 영역 일 수 있다. 도메인과 관련하여서는 더욱 상세하게 후술하도록 한다. 본 발명의 다양한 실시예에서 인스트럭션 들은, 상기 제 1 영역에서, 사용자의 제 1 입력에 적어도 일부 응답하여, 상기 통신 모듈을 통하여, 외부 서버 에 의하여 제공되는 어플리케이션 마켓에 접속하는 동작을 포함할 수 있다. 본 발명의 다양한 실시예에서 인스 트럭션들은, 상기 제 1 영역에서, 사용자의 제 2 입력에 적어도 일부 응답하여, 상기 어플리케이션 마켓으로부 터 선택된 제 1 어플리케이션을 다운로드하는 동작을 포함할 수 있다. 본 발명의 다양한 실시예에서 인스트럭션 들은, 상기 다운로드된 제 1 어플리케이션을 상기 전자 장치에 설치하는 동작을 포함할 수 있다. 본 발명의 다 양한 실시예에서 인스트럭션들은, 사용자의 입력 없이, 상기 다운로드된 제 1 어플리케이션을 상기 제 2 영역에 할당하는 동작을 포함할 수 있다. 본 발명의 다양한 실시예에서, 상기 통신 모듈은, 제 1 어플리케이션에 대한 인증 요청을 보안 서버로 송 신하고, 상기 인증 요청에 응답하여 상기 보안 서버로부터 도메인 식별자를 수신할 수 있다. 본 발명의 다양한 실시예에서, 상기 프로세서는, 상기 수신된 도메인 식별자에 대응하는 상기 제 2 영역에 상기 제 1 어플리케이션을 할당할 수 있다.본 발명의 다양한 실시예에서, 상기 인증 요청은, 인증을 위한 보안 키 및 상기 보안 키에 의하여 암호화된 값 중 적어도 하나를 포함할 수 있다. 본 발명의 다양한 실시예에서, 상기 통신 모듈은, 상기 제 1 어플리케이션에 연관되는 도메인 식별자를 상 기 제 1 어플리케이션과 함께 상기 어플리케이션 마켓으로부터 수신할 수 있다. 본 발명의 다양한 실시예에서, 상기 프로세서는, 상기 수신된 도메인 식별자에 대응하는 상기 제 2 영역에 상기 제 1 어플리케이션을 할당할 수 있다. 본 발명의 다양한 실시예에서, 상기 프로세서는, 상기 수신된 도메인 식별자에 대응하는 관리용 도메인 식 별자와 상기 관리용 도메인 식별자 사이의 연관 정보를 저장하도록 제어할 수 있다. 본 발명의 다양한 실시예에서, 상기 프로세서는, 상기 수신된 도메인 식별자에 대응하는 도메인이 존재하 는지를 판단할 수 있다. 본 발명의 다양한 실시예에서, 상기 프로세서는, 상기 수신된 도메인 식별자에 대응하는 상기 제 2 영역이 존재하면, 상기 대응하는 상기 제 2 영역에 상기 제 1 어플리케이션을 할당하고, 상기 수신된 도메인 식별자에 대응하는 도메인이 존재하지 않으면, 상기 수신된 도메인 식별자에 대응하는 상기 제 2 영역을 생성하고, 생성 된 상기 제 2 영역에 상기 제 1 어플리케이션을 할당할 수 있다. 본 발명의 다양한 실시예에서, 상기 프로세서는, 상기 제 2 영역과 연관된, 상기 제 1 어플리케이션에 대 한 명령을 수행할 수 있다. 본 발명의 다양한 실시예에서, 상기 프로세서는, 상기 제 1 어플리케이션을, 일반 영역 또는 샌드 박스 내 에 설치할 수 있다. 본 발명의 다양한 실시예에서, 상기 프로세서는, 상기 제 1 어플리케이션을 삭제하는 경우에, 상기 제 1 어플리케이션에 대응하는 상기 제 2 영역과 연관되는 어플리케이션이 존재하는지를 판단하여, 상기 판단 결과에 따라 상기 제 2 영역의 유지 여부를 결정할 수 있다. 본 발명의 다양한 실시예에서, 상기 프로세서는, 상기 제 1 어플리케이션이 상기 제 2 영역에 할당되는지 여부를 지시하는 메타데이터를 확인하고, 상기 확인 결과에 따라서 상기 제 1 어플리케이션을 상기 제 2 영역에 할당할 수 있다. 본 발명의 다양한 실시예에서, 상기 통신 모듈은, 상기 제 1 어플리케이션과 연관된 제 2 어플리케이션을 다운로드받으며, 상기 프로세서는, 상기 제 2 어플리케이션을 상기 제 2 영역에 할당할 수 있다. 도 2는 본 발명의 다양한 실시예에 따른 프로그램 모듈의 블록도이다. 한 실시예에 따르면, 상기 프 로그램 모듈(예: 프로그램)은 전자 장치(예: 전자 장치)에 관련된 자원을 제어하는 운영 체제 (operation system(OS)) 및/또는 운영 체제 상에서 구동되는 다양한 어플리케이션(예: 어플리케이션 프로그램 )을 포함할 수 있다. 상기 운영 체제는, 예를 들면, 안드로이드(android), iOS, 윈도우즈(windows), 심비 안(symbian), 타이젠(tizen), 또는 바다(bada) 등이 될 수 있다. 프로그램 모듈은 커널, 미들웨어, API(application programming interface), 및/또는 어 플리케이션을 포함할 수 있다. 상기 프로그램 모듈의 적어도 일부는 전자 장치 상에 프리로드 (preload) 되거나, 서버(예: 서버 106)로부터 다운로드(download) 가능하다. 상기 커널(예: 도 1의 커널)은, 예를 들면, 시스템 리소스 매니저 또는 디바이스 드라이버(22 3)를 포함할 수 있다. 상기 시스템 리소스 매니저는 시스템 리소스의 제어, 할당, 또는 회수 등을 수행할 수 있다. 한 실시예에 따르면, 상기 시스템 리소스 매니저는 프로세스 관리부, 메모리 관리부, 또는 파일 시스템 관리부 등을 포함할 수 있다. 상기 디바이스 드라이버는, 예를 들면, 디스플레이 드라이버, 카메라 드라이버, 블루투스 드라이버, 공유 메모리 드라이버, USB 드라이버, 키패드 드라이버, WIFI 드라이버, 오디오 드라이버, 또는 IPC(inter-process communication) 드라이버를 포함할 수 있다. 상기 미들웨어는, 예를 들면, 상기 어플리케이션이 공통적으로 필요로 하는 기능을 제공하거나, 상기 어플리케이션이 전자 장치 내부의 제한된 시스템 자원을 효율적으로 사용할 수 있도록 상기 API를 통 해 다양한 기능들을 상기 어플리케이션으로 제공할 수 있다. 한 실시예에 따르면, 상기 미들웨어(예: 미들웨어)는 런타임 라이브러리, 어플리케이션 매니저(application manager), 윈도우 매니저 (window manager), 멀티미디어 매니저(multimedia manager), 리소스 매니저(resourcemanager), 파워 매니저(power manager), 데이터베이스 매니저(database manager), 패키지 매니 저(package manager), 연결 매니저(connectivity manager), 통지 매니저(notification manager), 위치 매니저(location manager), 그래픽 매니저(graphic manager), 또는 보안 매니 저(security manager) 중 적어도 하나를 포함할 수 있다. 상기 런타임 라이브러리는, 예를 들면, 상기 어플리케이션이 실행되는 동안에 프로그래밍 언어를 통 해 새로운 기능을 추가하기 위해 컴파일러가 사용하는 라이브러리 모듈을 포함할 수 있다. 상기 런타임 라이브 러리는 입출력 관리, 메모리 관리, 또는 산술 함수에 대한 기능 등을 수행할 수 있다. 상기 어플리케이션 매니저는, 예를 들면, 상기 어플리케이션 중 적어도 하나의 어플리케이션의 생명 주기(life cycle)를 관리할 수 있다. 상기 윈도우 매니저는 화면에서 사용하는 GUI 자원을 관리할 수 있다. 상기 멀티미디어 매니저는 다양한 미디어 파일들의 재생에 필요한 포맷을 파악하고, 해당 포맷에 맞 는 코덱(codec)을 이용하여 미디어 파일의 인코딩(encoding) 또는 디코딩(decoding)을 수행할 수 있다. 상기 리 소스 매니저는 상기 어플리케이션 중 적어도 어느 하나의 어플리케이션의 소스 코드, 메모리 또는 저 장 공간 등의 자원을 관리할 수 있다. 상기 파워 매니저는, 예를 들면, 바이오스(BIOS: basic input/output system) 등과 함께 동작하여 배터리 (battery) 또는 전원을 관리하고, 전자 장치의 동작에 필요한 전력 정보 등을 제공할 수 있다. 상기 데이터베이 스 매니저는 상기 어플리케이션 중 적어도 하나의 어플리케이션에서 사용할 데이터베이스를 생성, 검 색, 또는 변경할 수 있다. 상기 패키지 매니저는 패키지 파일의 형태로 배포되는 어플리케이션의 설치 또 는 업데이트를 관리할 수 있다. 상기 연결 매니저는, 예를 들면, WIFI 또는 블루투스 등의 무선 연결을 관리할 수 있다. 상기 통지 매니저 는 도착 메시지, 약속, 근접성 알림 등의 사건(event)을 사용자에게 방해되지 않는 방식으로 표시 또는 통 지할 수 있다. 상기 위치 매니저는 전자 장치의 위치 정보를 관리할 수 있다. 상기 그래픽 매니저는 사용자에게 제공될 그래픽 효과 또는 이와 관련된 사용자 인터페이스를 관리할 수 있다. 상기 보안 매니저(25 2)는 시스템 보안 또는 사용자 인증 등에 필요한 제반 보안 기능을 제공할 수 있다. 한 실시예에 따르면, 전자 장치(예: 전자 장치)가 전화 기능을 포함한 경우, 상기 미들웨어는 상기 전자 장치의 음성 또는 영상 통화 기능을 관리하기 위한 통화 매니저(telephony manager)를 더 포함할 수 있다. 상기 미들웨어는 전술한 구성요소들의 다양한 기능의 조합을 형성하는 미들웨어 모듈을 포함할 수 있다. 상기 미들웨어는 차별화된 기능을 제공하기 위해 운영 체제의 종류 별로 특화된 모듈을 제공할 수 있다. 또한, 상기 미들웨어는 동적으로 기존의 구성요소를 일부 삭제하거나 새로운 구성요소들을 추가할 수 있다. 상기 API(예: API)는, 예를 들면, API 프로그래밍 함수들의 집합으로, 운영 체제에 따라 다른 구성으 로 제공될 수 있다. 예를 들면, 안드로이드 또는 iOS의 경우, 플랫폼 별로 하나의 API 셋을 제공할 수 있으며, 타이젠(tizen)의 경우, 플랫폼 별로 두 개 이상의 API 셋을 제공할 수 있다. 상기 어플리케이션(예: 어플리케이션 프로그램)은, 예를 들면, 홈, 다이얼러, SMS/MMS 373, IM(instant message), 브라우저, 카메라, 알람, 컨택트, 음성 다이얼, 이 메일, 달력, 미디어 플레이어, 앨범, 또는 시계, 건강 관리(health care)(예: 운동 량 또는 혈당 등을 측정), 또는 환경 정보 제공(예: 기압, 습도, 또는 온도 정보 등을 제공) 등의 기능을 제공 할 수 있는 하나 이상의 어플리케이션을 포함할 수 있다. 한 실시예에 따르면, 상기 어플리케이션은 상기 전자 장치(예: 전자 장치)와 외부 전자 장치(예: 전 자 장치(102, 104)) 사이의 정보 교환을 지원하는 어플리케이션(이하, 설명의 편의 상, “정보 교환 어플리케이 션”)을 포함할 수 있다. 상기 정보 교환 어플리케이션은, 예를 들면, 상기 외부 전자 장치에 특정 정보를 전달 하기 위한 알림 전달(notification relay) 어플리케이션, 또는 상기 외부 전자 장치를 관리하기 위한 장치 관리 (device management) 어플리케이션을 포함할 수 있다. 예를 들면, 상기 알림 전달 어플리케이션은 상기 전자 장치의 다른 어플리케이션(예: SMS/MMS 어플리케이션, 이 메일 어플리케이션, 건강 관리 어플리케이션, 또는 환경 정보 어플리케이션 등)에서 발생된 알림 정보를 외부 전자 장치(예: 전자 장치(102, 104))로 전달하는 기능을 포함할 수 있다. 또한, 상기 알림 전달 어플리케이션은, 예를 들면, 외부 전자 장치로부터 알림 정보를 수신하여 사용자에게 제공할 수 있다. 상기 장 치 관리 어플리케이션은, 예를 들면, 상기 전자 장치와 통신하는 외부 전자 장치(예: 전자 장치(102, 104))의적어도 하나의 기능(예: 외부 전자 장치 자체(또는, 일부 구성 부품)의 턴-온/턴-오프 또는 디스플레이의 밝기 (또는, 해상도) 조절), 상기 외부 전자 장치에서 동작하는 어플리케이션 또는 상기 외부 전자 장치에서 제공되 는 서비스(예: 통화 서비스 또는 메시지 서비스)를 관리(예: 설치, 삭제, 또는 업데이트)할 수 있다. 한 실시예에 따르면, 상기 어플리케이션은 상기 외부 전자 장치(예: 전자 장치(102, 104))의 속성(예: 전 자 장치의 속성으로서, 전자 장치의 종류가 모바일 의료 기기)에 따라 지정된 어플리케이션(예: 건강 관리 어플 리케이션)을 포함할 수 있다. 한 실시예에 따르면, 상기 어플리케이션은 외부 전자 장치(예: 서버 106 또 는 전자 장치(102, 104))로부터 수신된 어플리케이션을 포함할 수 있다. 한 실시예에 따르면, 상기 어플리케이 션은 프리로드 어플리케이션(preloaded application) 또는 서버로부터 다운로드 가능한 제3자 어플리케이 션(third party application)을 포함할 수 있다. 도시된 실시예에 따른 프로그램 모듈의 구성요소들의 명 칭은 운영 체제의 종류에 따라서 달라질 수 있다. 다양한 실시예에 따르면, 상기 프로그램 모듈의 적어도 일부는 소프트웨어, 펌웨어, 하드웨어, 또는 이들 중 적어도 둘 이상의 조합으로 구현될 수 있다. 상기 프로그램 모듈의 적어도 일부는, 예를 들면, 프로세 서(예: AP 210)에 의해 구현(implement)(예: 실행)될 수 있다. 상기 프로그램 모듈의 적어도 일부는 하나 이상의 기능을 수행하기 위한, 예를 들면, 모듈, 프로그램, 루틴, 명령어 세트(sets of instructions) 또는 프 로세스 등을 포함할 수 있다. 도 3a 및 3b는 본 발명의 다양한 실시예에 따른 전자 장치에서 설정되는 샌드 박스 영역의 개념을 설명하기 위 한 블록도이다. 도 3a에 도시된 바와 같이, 어플리케이션 계층에는 일반 영역, 제 1 샌드 박스 및 제 2 샌드 박 스가 정의될 수 있다. 어플리케이션 계층은 어플리케이션이 설치되고 실행되는 계층일 수 있으며, 어플리케이션 실행에 필요한 데이터를 저장 및 처리할 수 있는 영역으로 설정될 수 있다. 어플리케이션 계층은 미들웨어 계층과 데이터를 송수신할 수 있다. 한편, 어플리케이션 계층내에는 일반 영역, 제 1 샌드 박스 및 제 2 샌드 박스이 설정될 수 있다. 샌드 박스는 구현에 따라서 보안 영역 또는 컨테이너(container) 등으로 명명될 수도 있다. 일반 영 역, 제 1 샌드 박스 및 제 2 샌드 박스 각각은 사용자 식별자에 따라 설정될 수 있다. 예를 들 어, 일반 영역은 사용자 식별자 \"0\"에 대응될 수 있으며, 제 1 샌드 박스는 사용자 식별자 \"200\"에 대응될 수 있으며, 제 2 샌드 박스는 사용자 식별자 \"201\"에 대응될 수 있다. 상술한 식별자의 숫자는 단 순히 예시적인 것이다. 일반 영역에는 샌드 박스에 할당될 필요가 없는 어플리케이션이 할당될 수 있다. 예를 들어, 제 3 어플리 케이션은 보안 처리가 요구되지 않는 어플리케이션일 수 있으며, 이에 따라 샌드 박스에 할당될 필요가 없 는 어플리케이션일 수 있다. 도 3a에 도시된 바와 같이, 제 3 어플리케이션은 설치되어, 어플리케이션 계 층의 일반 영역에 할당될 수 있다. 제 3 어플리케이션은 샌드 박스에 할당된 어플리케이션과는 대조적으로, 다른 어플리케이션과 데이터 및 코드 실행을 공유할 수 있다. 한편, 더욱 상세하게 후술할 것으로, 본 발명의 다양한 실시예에서, 일반 영역, 샌드 박스 등은 “환경”으로 명명될 수 있다. 제 1 어플리케이션은 설치되어 제 1 샌드 박스에 할당될 수 있다. 샌드 박스에는 일반 영역과 구분 되어 보안 처리가 요구되는 어플리케이션이 할당 또는 실행될 수 있다. 예를 들어, 제 1 어플리케이션은 보안 처리가 필요한 데이터를 입출력할 수 있으며, 보안 처리가 필요한 제 1 어플리케이션의 데이터는 제 1 샌드 박스에 대응하는 리소스에서 저장 또는 처리될 수 있다. 제 2 어플리케이션은 설치되어 제 2 샌드 박스에 할당될 수 있다. 제 2 어플리케이션은 예를 들어 보안 처리가 요구되면서, 제 1 어플리케이 션과 데이터가 공유되어서는 안 되는 어플리케이션일 수 있다. 전자 장치는 제 1 어플리케이션 및 제 2 어플리케이션 사이의 데이터 및 코드 실행 공유를 방지하기 위하여, 제 1 어플리케이션을 제 1 샌드 박스에 할당하고, 제 2 어플리케이션을 제 2 샌드 박스에 분리하여 할당할 수 있다. 한편, 일반 영역에는 제 1 어플리케이션 및 제 2 어플리케이션이 할당될 수도 있다. 예를 들어, 제 1 어플리케이션 및 제 2 어플리케이션은 보안 모드가 아닌 일반 모드에서 동작할 수도 있다. 이 경우, 전자 장치는 제 1 어플리케이션 및 제 2 어플리케이션을, 샌드 박스뿐만 아니 라 일반 영역에도 할당할 수 있다. 이에 따라, 전자 장치는 일반 모드에서 제 1 어플리케이션 및 제 2 어플리케이션을 실행할 수 있다. 일반 모드에서는 제 1 어플리케이션은 제 2 어플리케이션 또는 제 3 어플리케이션과 데이터 및 코드 실행을 공유할 수 있다. 전자 장치는 아울러, 보안 모드에서 제 1 어플리케이션 및 제 2 어플리케이션을 실행할 수도 있다. 보안 모드에서는 상술한 바 와 같이 제 1 어플리케이션은 제 2 어플리케이션 또는 제 3 어플리케이션과 데이터 및 코드 실 행을 공유하지 않을 수 있다. 일반 영역에 할당된 제 1 어플리케이션 및 제 1 샌드 박스에 할 당된 제 1 어플리케이션은 동일한 패키지 식별자 또는 동일한 어플리케이션 식별자를 가지면서, 상이한 사 용자 식별자를 가질 수 있어, 상이한 어플리케이션으로 동작할 수 있다. 한편, 전자 장치는 어플리케이션에 대한 실행을 위한 화면, 예를 들어 런처 어플리케이션 화면을 표시할 수 있다. 본 발명의 다양한 실시예에 따른 전자 장치는 일반 영역, 제 1 샌드 박스 및 제 2 샌 드 박스에 할당된 어플리케이션을 모두 포함하는 어플리케이션 실행을 위한 화면을 표시할 수 있다. 이 경우에는, \"0\"의 사용자 식별자가 제 1 어플리케이션을 실행하는 경우에는 일반 영역에 할당된 제 1 어플 리케이션을 일반 모드에서 실행시킬 수 있다. 아울러, \"200\"의 사용자 식별자가 제 1 어플리케이션을 실 행하는 경우에는 제 1 샌드 박스에 할당된 제 1 어플리케이션을 보안 모드에서 실행시킬 수 있다. 미들웨어는, 특정 모듈의 요청에 의하여 전자 장치의 세팅을 조정하며, 샌드 박스 생성 및 어플리케 이션 할당을 수행할 수 있다. 샌드 박스 매니저는 샌드 박스의 생성 및 삭제를 관리할 수 있다. 어플리케이션 매니저는 어플리케 이션의 설치 및 실행을 관리할 수 있으며, 어플리케이션의 할당 위치를 결정할 수 있다. 예를 들어, 어플리케 이션 매니저는 제 1 어플리케이션의 할당 위치를 제 1 샌드 박스로 결정할 수 있으며, 다운로드 시 제 1 어플리케이션을 제 1 샌드 박스에 할당할 수 있다. 또 다른 실시예에서는, 도 3b에 도시된 바와 같이, 샌드 박스 에이전트가 제 1 어플리케이션의 할당 위치를 결정할 수 있다. 예를 들어, 샌 드 박스 에이전트는 어플리케이션의 메타데이터를 참조하여 제 1 샌드 박스 내의 할당을 결정할 수 있다. 샌드 박스 에이전트는 어플리케이션의 할당 위치를 포함한 설치 요청을 어플리케이션 매니저 로 출력할 수 있다. 어플리케이션 매니저는 샌드 박스 에이전트로부터 입력된 설치 요청에 따 라 제 1 어플리케이션을 설치하면서, 제 1 샌드 박스 내에 할당할 수 있다. 본 발명의 다양한 실시 예에서, 어플리케이션 매니저는 제 1 어플리케이션을 일반 영역에 할당할 수 있다. 어플리케이 션 매니저는 미들웨어에 하나의 모듈로 구성되거나 또는 하나 이상의 모듈로 나누어져 구성될 수도 있다. 한편, 샌드 박스 에이전트는 보안 서버로의 인증 요청 송신 및 인증 결과 수신을 수행할 수도 있다. 본 발명의 다양한 실시예에서, 전자 장치는 플랫폼(platform) 계층에 어플리케이션을 설치하고, 영역 별로 사용자 데이터 세트를 저장하고 이용할 수 있다. 영역을 변경하는 과정에서, 전자 장치는 사용자 변경을 수행할 수 있는 그래픽 사용자 인터페이스를 제공할 수 있다. 본 발명의 다양한 실시예에서, 그래픽 사용자 인 터페이스는 사용자 식별자 및 패스워드를 입력하는 창을 포함할 수 있으며, 로그인된 사용자 식별자에 대응하는 영역을 활성화할 수 있다. 본 발명의 다양한 실시예에서, 어플리케이션 매니저는 제 1 어플리케이션이 수신되면, 샌드 박스에서 실행 하는 어플리케이션인지 여부를 판단할 수 있다. 상기 전자 장치는 상기 샌드 박스에서 실행하는 어플리케 이션인지 여부에 따라서, 상기 제 1 어플리케이션을 설치 및 할당할 수 있다. 또 다른 실시예에서는, 상술한 바와 같이 샌드 박스 에이전트가 제 1 어플리케이션이 수신되면 샌드 박스에서 실행하는 어플리케이션인지 여부를 판단할 수 있다. 샌드 박스는 상기 샌드 박스에서 실행하는 어플리케이션인지 여부에 따라서 샌드 박스 에이전트는 제 1 어플리케이션의 샌드 박스 내 할당을 어플리케이션 매니저에 요청할 수 있다. 어플 리케이션 매니저는 샌드 박스 에이전트로부터의 설치 요청에 따라, 제 1 어플리케이션을 샌드 박스에 할당할 수도 있다. 상기 제 1 어플리케이션은, 샌드 박스에서 실행하는 어플리케이션인지 여부를 지시하는 메타데이터를 포함할 수 있다. 샌드 박스 매니저는 상기 메타데이터에 근거하여, 상기 전자 장치에 미생성된 샌드 박스를 생성할 수 있다. 또 다른 실시예에서, 샌드 박스 에이전트는 상기 메타데이터에 근거하여, 상기 전자 장치에 미생성 된 샌드 박스를 생성을 샌드 박스 매니저에 요청할 수 있다. 샌드 박스 매니저는 샌드 박스 에이전 트로부터의 요청에 따라 미생성된 샌드 박스를 생성할 수 있다. 샌드 박스 에이전트는, 보안 서버로 상기 제 1 어플리케이션에 대한 인증 요청을 송신하고, 상기 보안 서 버로부터 상기 인증 요청에 응답하는 인증 결과를 수신할 수 있다.도 4a 내지 4c는 본 발명의 다양한 실시예에 따른 어플리케이션 설치 방법의 흐름도를 도시한다. 우선, 도 4a를 참조하면, 410 동작에서, 전자 장치는 제 1 어플리케이션을 다운로드받을 수 있다. 예를 들어, 전자 장치는 어플리케이션 마켓으로부터 제 1 어플리케이션을 다운로드받을 수 있다. 420 동작에서, 전자 장치는 다운로드받은 제 1 어플리케이션을 설치하고, 일반 영역에 할당할 수 있다. 하나의 실시예에서는, 전자 장치는 수신된 어플리케이션을 우선적으로 일반 영역에 할당할 수 있다. 430 동작에서, 전자 장치는 다운로드받은 제 1 어플리케이션이 샌드 박스에서 실행하는 어플리케이션인지 여부를 판단할 수 있다. 본 발명의 다양한 실시예에서, 제 1 어플리케이션은, 샌드 박스에서 실행하는지 여부 를 나타내는 메타데이터를 포함할 수 있다. 예를 들어, 제 1 어플리케이션이 안드로이드 OS에 근거하여 제작된 경우에는, AndoroidManifest.xml 파일 내에 특정 데이터를 삽입한 형태로 메타데이터를 포함할 수 있다. 다만, 상술한 안드로이드 OS 관련 예는 단순히 예시적인 것으로, 본 발명의 다양한 실시예에 따른 전자 장치는 다양한 OS에 근거하여 제작된 어플리케이션에 대하여서도, 샌드 박스에서 실행하는 어플리케이션인지 여부를 포 함하는 메타데이터를 확인 및 관리할 수 있다. 전자 장치는 제 1 어플리케이션의 메타데이터를 확인함으로써 다운로드받은 제 1 어플리케이션이 샌드 박 스에서 실행하는 어플리케이션인지 여부를 판단할 수 있다. 예를 들어, 제 1 어플리케이션이 안드로이드 OS에 근거하여 제작된 경우에는, 제 1 어플리케이션의 AndoroidManifest.xml 파일 내에 특정 데이터가 포함된지 여부 를 판단함으로써 다운로드받은 제 1 어플리케이션이 샌드 박스에서 실행하는 어플리케이션인지 여부를 판단할 수 있다. 제 1 어플리케이션이 샌드 박스에서 실행하는 어플리케이션인 경우에는, 440 동작에서 전자 장치는 샌드 박스에 제 1 어플리케이션을 할당할 수 있다. 예를 들어, 도 5a에 도시된 바와 같이, 전자 장치는 일반 영역에 제 1 어플리케이션을 우선 할 당하며, 제 1 샌드 박스에 제 1 어플리케이션을 할당할 수 있다. 이 경우, 전자 장치는, 제 1 어플리케이션의 일반 모드에 대응하는 데이터를 일반 영역에 대응하는 리소스에 할당할 수 있으며, 제 1 어플리케이션의 보안 모드에 대응하는 데이터를 제 1 샌드 박스에 대응하는 리소스에 할당할 수 있다. 제 1 어플리케이션이 샌드 박스에서 실행하는 어플리케이션이 아닌 경우에는, 제 1 어플리케이션을 일반 영역에 만 할당할 수 있다. 예를 들어, 도 5b에 도시된 바와 같이, 전자 장치는 일반 영역에 제 1 어플리케이션을 할당할 수 있다. 이 경우, 전자 장치는, 제 1 어플리케이션의 일반 모드에 대응하는 데이터를 일반 영역에 대응하는 리소스에 할당할 수 있다. 제 1 어플리케이션이 실행되는 경우에는, 제 1 어플리케이션의 데이터 및 코드 실행을 다른 어플리케이션과 공유될 수 있다. 도 4b는 본 발명의 다양한 실시예에 따른 어플리케이션 설치 방법의 흐름도를 도시한다. 410 동작에서, 전자 장치는 제 1 어플리케이션을 다운로드받을 수 있다. 420 동작에서, 전자 장치는 제 1 어플리케이션을 설치하고, 일반 영역에 할당할 수 있다. 425 동작에서, 전자 장치는 제 1 어플리케 이션의 메타데이터를 확인할 수 있다. 전자 장치는 제 1 어플리케이션의 파일 중 삽입된 특정 데이터로 메타데이터를 확인할 수 있다. 본 발명의 다양한 실시예에서, 메타데이터는 어플리케이션이 보안 영역에 할당 되어야 하는지 여부와 관련된 것으로, 직접적으로 보안 영역에 할당되어야 하는지 여부를 나타낼수도 있거나 또 는 보안 레벨의 형태로 구현될 수도 있다. 430 동작에서, 전자 장치는 제 1 어플리케이션이 보안 영역에 할당하는 어플리케이션인지 여부를 판단할 수 있다. 예를 들어, 메타데이터가 직접적으로 보안 영역에 할당되어야 하는 것을 나타내는 경우에는, 전자 장 치는 제 1 어플리케이션을 보안 영역에 할당하는 것으로 판단할 수 있다. 또는, 메타데이터가 보안 레벨 인 경우에는, 전자 장치는 확인된 보안 레벨에 따라 제 1 어플리케이션이 보안 영역에 할당하는 어플리케 이션인지 여부를 판단할 수도 있다. 한편, 440 동작에 대하여서는, 도 4a를 참조하여 상세하게 설명하였기 때 문에 여기에서의 더 이상의 설명은 생략하도록 한다. 도 4c는 본 발명의 다양한 실시예에 따른 어플리케이션 설치 방법의 흐름도를 도시한다. 410 동작에서, 전자 장치는 제 1 어플리케이션을 다운로드받아 설치할 수 있다. 450 동작에서는, 전자 장 치는 제 1 어플리케이션이 샌드 박스에서 실행하는 어플리케이션인지 여부를 판단할 수 있다. 제 1 어플리케이션이 샌드 박스에서 실행하는 어플리케이션으로 판단된 경우에는, 460 동작에서 전자 장치는 일반 영역 및 샌드 박스에 제 1 어플리케이션을 할당할 수 있다. 제 1 어플리케이션이 샌드 박스에서 실행하는 어플 리케이션이 아닌 것으로 판단된 경우에는, 470 동작에서 전자 장치는 일반 영역에 제 1 어플리케이션을 할 당할 수 있다. 도 6a는 본 발명의 다양한 실시예에 따른 어플리케이션 설치 방법의 흐름도를 도시한다. 611 동작에서, 보안 서버는 어플리케이션 마켓과 어플리케이션 리스트를 공유할 수 있다. 하나의 실 시예에서, 보안 서버는 어플리케이션 마켓에 업로드되는 어플리케이션과 어플리케이션에 대응하는 보 안 키 사이의 연관 정보를, 어플리케이션 마켓 또는 다른 외부 엔티티로부터 수신할 수 있다. 표 1은 본 발명의 다양한 실시예에 따른 어플리케이션과 보안 키 사이의 연관 정보의 예시이다. 표 1 어플리케이션 보안 키 제 1 어플리케이션 akbidll 제 2 어플리케이션 vnei3 제 3 어플리케이션 villlwo5 613 동작에서, 보안 서버는 예를 들어 표 1과 같은 어플리케이션 리스트를 저장할 수 있다. 615 동작에서, 전자 장치는 어플리케이션 마켓으로부터 어플리케이션을 다운로드받아 설치할 수 있다. 아울러, 전자 장치는 어플리케이션 마켓으로부터 보안 키를 다운로드받을 수 있다. 여기에서, 보안 서버에 저장된 보안 키 및 전자 장치가 수신하는 보안 키는 상이하거나 또는 서로 동 일할 수도 있다. 본 발명의 다양한 실시예에서, 보안 서버에 저장된 보안 키 및 전자 장치가 수신하 는 보안 키는 다양한 암호화/복호화 알고리즘에서 이용 가능한 키 값일 수 있다. 하나의 예에서, 전자 장치 는 제 1 어플리케이션과 \"akbidll\"의 보안 키를 어플리케이션 마켓으로부터 다운로드 받는 것을 상정 하도록 한다. 한편, 제 1 어플리케이션은 샌드 박스에서 실행하는 것을 지시하는 메타데이터를 포함할 수 있다. 상술한 바와 같이, 메타데이터는 샌드 박스에서 실행하는 것을 지시하는 데이터, 보안 레벨일 수 있거나 또는 보안 키가 메타데이터로 이용될 수도 있다. 617 동작에서, 전자 장치는 메타데이터를 확인할 수 있으며, 확인 결과에 따라 다운로드받은 제 1 어플리 케이션이 샌드 박스에서 실행하는 어플리케이션인지 여부를 판단할 수 있다. 예를 들어, 전자 장치는 메 타데이터에 직접 지시된 제 1 어플리케이션이 샌드 박스에서 실행하는 것을 나타내는 데이터에 근거하여 판단할 수 있다. 또는, 전자 장치는 제 1 어플리케이션의 보안 레벨에 따라서, 제 1 어플리케이션이 샌드 박스에 서 실행하는 것을 판단할 수 있다. 또는, 전자 장치는 제 1 어플리케이션과 함께 수신된 보안 키에 근거 하여, 제 1 어플리케이션이 샌드 박스에서 실행하는 것을 판단할 수도 있다. 619 동작에서, 전자 장치는 보안 서버로 제 1 어플리케이션에 대한 인증 요청을 송신할 수 있다. 예 를 들어, 인증 요청은, 제 1 어플리케이션의 식별자 및 보안 키를 포함할 수 있다. 여기에서, 제 1 어플리케이 션의 식별자는 어플리케이션 패키지 명칭 또는 어플리케이션 등록 번호 등의 다양한 정보로 구현될 수 있으며, 어플리케이션을 식별할 수 있는 데이터라면 제한이 없음을 당업자는 용이하게 이해할 수 있을 것이다. 다른 실 시예에서, 인증 요청은 보안 키를 이용한 암호화된 값을 포함할 수도 있다. 전자 장치는 어플리케이션 마 켓으로부터 수신된 보안 키에 다양한 암호화 알고리즘을 적용하여, 암호화된 값을 생성할 수 있다. 전자 장치는 어플리케이션 식별자 및 암호화된 값을 포함한 인증 요청을 송신할 수도 있다. 또 다른 예에서, 어플리케이션 개발자는 보안 키로 어플리케이션을 사이닝(signing)할 수 있으며, 보안 서버는 사이닝 여부 를 확인함으로써 인증을 수행할 수도 있다. 본 발명의 다양한 실시예에서, 샌드 박스 에이전트는 보안 서버 와 인증 요청 송신 및 인증 결과 수신을 수행할 수 있다. 621 동작에서, 보안 서버는 인증 요청에 응답하는 인증 결과를 전자 장치로 송신할 수 있다. 보안 서버는 인증 요청에 포함된 어플리케이션 식별자 및 보안 키를, 저장하고 있는 어플리케이션 리스트와 비 교함으로써, 인증을 수행할 수 있다. 또는, 보안 서버는 인증 요청에 포함된 암호화된 값을, 기저장된 보 안 키를 이용하여 복호화하여 인증을 수행할 수도 있다. 보안 서버는, 제 1 어플리케이션에 대한 인증 성 공 또는 실패를 판단할 수 있다. 보안 서버는 인증 성공 또는 실패 결과를 포함하는 인증 결과를 전자 장 치로 송신할 수 있다.623 동작에서, 전자 장치는 인증 결과를 확인할 수 있다. 625 동작에서, 전자 장치는 인증 결과에 따라 제 1 어플리케이션을 할당할 수 있다. 예를 들어, 인증이 성공한 경우에는, 전자 장치는 제 1 어플 리케이션을 일반 영역과 샌드 박스에 할당할 수 있다. 또는, 전자 장치는 제 1 어플리케이션을 샌드 박스 에 할당할 수도 있다. 하나의 실시예에서, 메타데이터는 할당되어야 하는 샌드 박스의 사용자 식별자 정보를 더 포함할 수도 있으며, 전자 장치는 메타데이터를 참조하여 해당 샌드 박스에 제 1 어플리케이션을 할당 할 수 있다. 또는, 메타데이터가 샌드 박스의 사용자 식별자 정보를 포함하지 않은 실시예에서는, 전자 장치 는 메타데이터를 이용하여 제 1 어플리케이션을 할당할 샌드 박스를 결정하고, 결정된 샌드 박스에 제 1 어플리케이션을 할당할 수도 있다. 전자 장치는 제 1 어플리케이션이 할당될 샌드 박스가 미생성된 경우 에는, 샌드 박스를 생성하여 제 1 어플리케이션을 할당할 수도 있다. 한편, 인증이 실패한 경우에는, 전자 장 치는 제 1 어플리케이션을 일반 영역에 할당할 수 있다. 한편, 도 6의 실시예에서는, 보안 서버 및 어플리케이션 마켓이 상이한 엔티티로 도시되어 있지만, 보안 서버 및 어플리케이션 마켓은 하나의 엔티티로 구현될 수도 있다. 도 6b는 본 발명의 다양한 실시예에 따른 어플리케이션 업로드 과정의 흐름도를 도시한다. 641 동작에서, 개발자용 전자 장치는 어플리케이션 식별자 및 보안 키를 획득할 수 있다. 예를 들어, 개 발자용 전자 장치는 플랫폼 운영자와의 계약을 통하여 어플리케이션 식별자 및 보안 키를 획득할 수 있다. 이 경우, 어플리케이션 식별자 및 보안 키를 라이선스 키로 명명할 수도 있다. 643 동작에서, 개발자용 전자 장치는 어플리케이션 식별자 및 보안 키를 보안 서버로 송신할 수 있다. 645 동작에서, 보안 서버는 수신된 어플리케이션 식별자 및 보안 키를 등록할 수 있다. 이에 따라, 보안 서버는 어플리케이션 식별자 및 보안 키 사이의 연관 정보를 저장할 수 있다. 보안 서버(60 1)는 도 6a에서 상술한 바와 같이, 전자 장치로부터 수신된 인증 요청을 미리 저장한 어플리케이션 식별자 및 보안 키 사이의 연관 정보를 이용하여 인증할 수 있다. 647 동작에서, 개발자용 전자 장치는 어플리케이션을 제작할 수 있다. 649 동작에서, 개발자용 전자 장치 는 어플리케이션에 메타데이터를 추가할 수 있으며, 메타데이터는 상술한 바와 같이 샌드 박스에서 실행하 는지 여부를 지시하는 데이터일 수 있다. 651 동작에서, 개발자용 전자 장치는 어플리케이션 마켓에 어플리케이션 및 보안 키를 송신할 수 있 다. 653 동작에서, 어플리케이션 마켓은 수신된 어플리케이션 및 보안 키를 등록할 수 있다. 추후, 어플 리케이션 마켓은 전자 장치로부터 어플리케이션 다운로드 요청을 받으면, 이에 대응하여 어플리케이 션 및 보안 키를 전자 장치로 송신할 수 있다. 도 7은 본 발명의 다양한 실시예에 따른 전자 장치의 제어 방법의 흐름도를 도시한다. 710 동작에서, 전자 장치는 제 1 어플리케이션을 다운로드받아 설치할 수 있다. 715 동작에서, 전자 장치는 제 1 어플리케이션을 일반 영역에 할당할 수 있다. 720 동작에서, 전자 장치는 제 1 어플리케이션이 샌드 박스에서 실행하는 어플리케이션인지 여부를 판단할 수 있다. 하나의 실시예에서, 전자 장치는 제 1 어플리케이션에 포함된 메타데이터를 이용하여, 제 1 어 플리케이션이 샌드 박스에서 실행하는 어플리케이션인지 여부를 판단할 수 있다. 제 1 어플리케이션이 샌드 박스에서 실행하는 어플리케이션인 것으로 판단되면, 730 동작에서 전자 장치는 제 1 어플리케이션을 할당할 샌드 박스가 존재하는지 여부를 판단할 수 있다. 상술한 바와 같이, 메타데이터는 할당되어야 하는 샌드 박스의 사용자 식별자 정보를 더 포함할 수도 있으며, 전자 장치는 메타데이터를 참 조하여 해당 샌드 박스에 제 1 어플리케이션을 할당할 수 있다. 또는, 메타데이터가 샌드 박스의 사용자 식별 자 정보를 포함하지 않은 실시예에서는, 전자 장치는 메타데이터를 이용하여 제 1 어플리케이션을 할당할 샌드 박스를 결정하고, 결정된 샌드 박스에 제 1 어플리케이션을 할당할 수도 있다. 이에 따라, 전자 장치 는 확인된 샌드 박스가 이미 전자 장치에 할당되어 있는지 여부를 판단할 수 있다. 예를 들어, 도 8a에서와 같이, 전자 장치는 제 1 어플리케이션을 할당할 샌드 박스가 제 1 샌드 박스(32 0)인 것으로 판단할 수 있다. 전자 장치는 제 1 샌드 박스가 이미 생성되어 있는지 여부를 판단 할 수 있다. 하나의 실시예에서, 전자 장치에서 정의된 어플리케이션 매니저는 어플리케이션 계층에 제 1 샌드 박스가 생성되었는지 여부를 판단할 수 있다. 도 8a의 실시예에서는, 제 1샌드 박스가 미생성된 것을 상정하도록 한다. 샌드 박스가 생성되어 있지 않으면, 740 동작에서 전자 장치는 미생성된 샌드 박스를 생성할 수 있다. 예 를 들어, 도 8b에서와 같이, 전자 장치에서 정의된 샌드 박스 매니저는 제 1 샌드 박스를 생성 할 수 있다. 샌드 박스가 생성되면, 750 동작에서 전자 장치는 생성되거나 또는 기 존재하였던 샌드 박스에 제 1 어플 리케이션을 할당할 수 있다. 본 발명의 다양한 실시예에서, 도 8b에 도시된 바와 같이, 전자 장치 는 일반 영역에 우선 제 1 어플리케이션을 할당하면서, 샌드 박스에 제 1 어플리케이션을 할당할 수도 있다. 한편, 제 1 어플리케이션이 샌드 박스에서 실행하는 어플리케이션이 아닌 것으로 판단되면, 전자 장치는 일반 영역에만 제 1 어플리케이션을 할당할 수 있다. 한편, 다른 실시예에서는, 전자 장치는 어플리케이션을 아무 영역에도 할당하지 않고, 우선 어플리케이션 이 샌드 박스에서 실행하는 어플리케이션인지 여부부터 판단할 수도 있다. 전자 장치는 어플리케이션이 샌드 박스에 실행하는 것으로 판단되면 일반 영역 및 샌드 박스에 어플리케이션을 할당하고, 어플리케이션이 샌 드 박스에 실행하지 않는 것으로 판단되면 일반 영역에 어플리케이션을 할당할 수 있다. 760 동작에서 전자 장치는 일반 영역에 제 1 어플리케이션을 할당할 수 있다. 도 9a 내지 9h는 본 발명의 다양한 실시예 및 비교예에 따른 전자 장치의 화면을 설명하기 위한 개념도들을 도 시한다. 도 9a를 참조하면, 전자 장치는 일반 영역에서 메뉴 화면을 표시할 수 있다. 여기에서, 메뉴 화면 은 런처 어플리케이션에 의한 화면으로, 구현에 따라 런처 어플리케이션 실행 화면으로 명명될 수도 있다. 전자 장치는 적어도 하나의 어플리케이션 실행 아이콘(901,902,903)을 표시할 수 있다. 예를 들어, 전자 장치는 갤러리 어플리케이션의 실행 아이콘, 플래너 어플리케이션의 실행 아이콘 및 어플리케이 션 마켓 어플리케이션의 실행 아이콘을 표시할 수 있다. 이 경우, 전자 장치는 일반 영역에 갤 러리 어플리케이션, 플래너 어플리케이션 및 어플리케이션 마켓 어플리케이션을 기설치할 수 있 다. 한편, 전자 장치는 어플리케이션 마켓 어플리케이션의 실행 아이콘의 지정에 따른 실행 명 령을 획득할 수 있다. 도 9b를 참조하면, 전자 장치는 실행 명령에 따라 어플리케이션 마켓 어플리케이션을 실행할 수 있다. 전 자 장치는 어플리케이션 마켓 어플리케이션의 실행 화면을 표시할 수 있으며, 실행 화면에는 어플리케이션 마켓에 업로드된 어플리케이션(911,913)과 다운로드 명령 오브젝트(912,914)가 포함될 수 있다. 예를 들어, 전 자 장치가 “A 은행 어플리케이션”을 다운로드하는 경우를 상정하도록 한다. 사용자는 다운로드 명 령 오브젝트를 지정할 수 있다. 전자 장치는 이에 대응하여 어플리케이션 마켓으로부터 “A 은행 어 플리케이션”을 다운로드할 수 있다. 도 9c는 “A 은행 어플리케이션”의 다운로드 진행 상황 을 표시하는 전자 장치의 개념도이다. 다운로드가 완료되면, 전자 장치는 다운로드된 어플리케이션 을 설치할 수 있다. 본 발명의 다양한 실시예에서, 도 9d에서와 같이, 전자 장치는 어플리케이션을 일반 영역에 할 당할 수 있다. 한편, 전자 장치는 어플리케이션이 제 1 샌드 박스에서 실행하는 어플리케이션 인지 여부를 판단할 수 있다. 예를 들어, 전자 장치는 어플리케이션의 메타데이터를 확인함으로써 샌 드 박스에서 실행하는 어플리케이션인지 여부를 판단할 수 있다. 다운로드된 어플리케이션이 샌드 박스에 서 실행하는 어플리케이션인 것으로 판단되면, 전자 장치는 도 9e에서와 같이, 즉 제 1 샌드 박스에 제 1 어플리케이션를 할당할 수 있다. 아울러, 전자 장치는 설치된 어플리케이션 실행 아이콘 을 메뉴 화면 상에 더 표시할 수 있다. 이후, 실행 아이콘이 지정되면, 전자 장치는 “A 은행 어플리케이션”을 제 1 샌드 박스, 즉 샌드 박스에서 실행할 수 있다. 예를 들어, 전자 장치는 “A 은행 어플리케이션”으로부터의 데이터 및 코드 실행을 제 1 샌드 박스 밖에 할당된 어플리케이션과 공유 하지 않을 수 있다. 본 발명의 다양한 실시예에서, 전자 장치는 제 1 어플리케이션과 연관된 제 2 어플리케이션을 함께 다운로 드받을 수도 있다. 예를 들어, 도 9f 및 9g에 도시된 바와 같이, 전자 장치는 “A 은행 어플리케이션”과 연관된 “A 카드 어플리케이션”을 함께 다운로드받을 수 있다. 전자 장치는 다운로드받은 “A 카드 어플 리케이션”을 일반 영역에 할당하고, 아울러 “A 카드 어플리케이션”을 제 1 샌드 박스에할당할 수 있다. 본 발명의 다양한 실시예에서, 제 2 어플리케이션은 제 1 어플리케이션과 동일한 샌드 박스에서 실행하는 것일 수 있다. 이에 따라, 전자 장치는 “A 카드 어플리케이션”을 제 1 샌드 박스에 설치 및 할당 할 수 있다. 아울러, 전자 장치는 설치된 어플리케이션 실행 아이콘을 메뉴 화면 상에 더 표시 할 수 있다. 이후, 실행 아이콘이 지정되면, 전자 장치는 “A 카드 어플리케이션”을 제 1 샌 드 박스, 즉 샌드 박스에서 실행할 수 있다. 예를 들어, 전자 장치는 “A 카드 어플리케이션”으로 부터의 데이터 및 코드 실행을 제 1 샌드 박스에 할당되지 않은 다른 어플리케이션들과 공유하지 않을 수 있다. 한편, 전자 장치는 “A 카드 어플리케이션”으로부터의 입출력 데이터는 “A 은행 어플리케이션” 과 공유할 수 있다. 제 2 어플리케이션은 제 1 어플리케이션과 연관된 어플리케이션으로, 예를 들어 동일한 어 플리케이션 개발자에 의하여 개발된 어플리케이션, 제 1 어플리케이션의 실행 시 요구되는 인증, 암호 등과 관 련된 어플리케이션 등일 수 있으며, 그 종류에는 제한이 없을 수 있다. 제 2 어플리케이션은 제 1 어플리케이 션과 동일한 샌드 박스에서 실행하는 것으로, 예를 들어 동일한 도메인 식별자에 대응하는 어플리케이션일 수 있다. 도 9h는 본 발명과의 비교를 위한 비교예에 의한 전자 장치의 화면(910,920)을 도시한다. 비교예에 의한 전자 장치는 일반 영역에 대응하는 화면을 표시할 수 있다. 일반 영역에 대응하는 화면은, 일반 영 역에 할당된 어플리케이션에 대한 실행 아이콘(971,972,973)을 포함할 수 있다. 일반 영역에 대응하는 화면 은 예를 들어 일반 영역에 할당된 런처 어플리케이션의 실행 화면일 수 있다. 예를 들어, 비교예에서는 일반 영역은 \"0\"의 사용자 식별자에 대응할 수 있으며, 일반 영역에 대응하는 화면은 \"0\"의 사용자 식별자 를 가진 사용자가 로그인한 경우의 화면일 수 있다. 한편, 비교예에서 샌드 박스는 \"200\"의 사용자 식별자에 대응할 수 있다. 비교예에 의한 전자 장치는 \"200\"의 사용자 식별자를 가진 사용자가 로그인한 경우에는 제 1 샌드 박스에 대응하는 화면을 표시할 수 있다. 도 9a에 도시된 바와 같이, 제 1 샌드 박스에 대응하는 화면에는 제 1 샌드 박스에 할당된 어플리 케이션 실행 아이콘(981,982)이 포함될 수 있다. 일반 영역에 대응하는 제 1 어플리케이션 실행 아이콘 (971,972,973)과 대조를 위하여, 비교예에 의한 전자 장치는 “!” 표시와 같은 추가 식별 오브젝트를 제 1 어플리케이션 실행 아이콘(981,982)과 함께 표시할 수 있다. 상술한 바와 같이, 비교예에 의한 전자 장치 는 사용자 별로 대응하는 화면(970,980)을 상이하게 표시할 수 있다. 이에 따라, 사용자는 예를 들어 어 플리케이션을 보안 모드에서 실행하기 위하여, \"200\"의 사용자 식별자로 로그인하는 명령을 추가적으로 입력하 여야 한다. 이와는 대조적으로, 본 발명의 다양한 실시예에 따른 전자 장치는 도 9g에서와 같이 일반 영역 및 샌드 박 스에 할당된 모든 어플리케이션에 대한 실행 아이콘을 단일 화면에 표시할 수 있으며, 메타데이터를 확인함으로 써 어플리케이션의 실행 영역을 일반 영역 및 샌드 박스 영역 중 하나로 결정할 수 있다. 이에 따라, 사용자로 부터 특정한 추가 명령을 수신하지 않아도, 전자 장치는 샌드 박스에서 어플리케이션을 실행할 수 있다. 도 10은 본 발명의 다양한 실시예에 따른 전자 장치의 제어 방법의 흐름도를 도시한다. 도 10을 참조하면, 1010 동작에서 전자 장치는 제 1 어플리케이션을 다운로드받아 설치할 수 있다. 하나 의 실시예에서, 전자 장치는 제 1 어플리케이션의 보안 레벨을 수신할 수 있다. 예를 들어, 전자 장치 는 어플리케이션 마켓으로부터 보안 레벨을 포함하는 제 1 어플리케이션 패키지를 수신할 수 있다. 보안 레벨은 제 1 어플리케이션의 메타데이터에 포함될 수도 있다. 또는, 전자 장치는 제 1 어플리케이션과 별 개로 보안 레벨을 수신할 수도 있다. 1011 동작에서, 전자 장치는 일반 영역에 제 1 어플리케이션을 할당할 수 있다. 1013 동작에서, 전자 장치는 제 1 어플리케이션의 보안 레벨을 확인할 수 있다. 예를 들어, 전자 장치 는 어플리케이션 패키지 내의 보안 레벨을 확인하거나 또는 메타데이터를 확인하거나 또는 별도로 수신된 보안 레벨을 확인할 수 있다. 1015 동작에서, 전자 장치는 보안 영역에 할당하는 어플리케이션인지 여부를 판단할 수 있다. 예를 들어, 전자 장치는 확인된 보안 레벨에 근거하여 제 1 어플리케이션이 보안 영역에 할당하는 어플리케이션인지 여부를 판단할 수 있다. 본 발명의 다양한 실시예에서, 전자 장치는 보안 레벨과 샌드 박스 사이의 연관 정보를 미리 저장할 수 있다. 예를 들어, 전자 장치는 표 2와 같은 연관 정보를 미리 저장할 수 있다. 표 2 보안 레벨 어플리케이션 할당 영역 0 일반 영역 1 일반 영역, 제 1 샌드 박스 2 일반 영역, 제 2 샌드 박스 보안 영역에 할당하는 어플리케이션으로 판단되면, 1030 동작에서 전자 장치는 일반 영역 및 보안 영역에 대응하는 샌드 박스에 제 1 어플리케이션을 할당할 수 있다. 보안 영역에 할당하는 어플리케이션으로 판단되지 않으면, 전자 장치는 일반 영역에만 제 1 어플리케이션을 할당할 수 있다. 한편, 상술한 표 2에서는 보안 레벨이 0,1,2 등의 Boolean 값으로 표현되어 있으나, 이는 단순히 예시적인 것으로 보안 레벨의 형식에는 제한 이 없음을 당업자는 용이하게 이해할 수 있을 것이다. 예를 들어, 전자 장치가 제 1 어플리케이션 및 제 2 어플리케이션을 다운로드받은 것을 상정하도록 한다. 이 경우, 전자 장치는 제 1 어플리케이션의 보안 레벨이 1이며, 제 2 어플리케이션의 보안 레벨이 2인 것 을 확인할 수 있다. 전자 장치는, 예를 들어 표 2와 같은 보안 레벨 및 할당 영역 사이의 연관 정보에 근 거하여, 제 1 어플리케이션의 할당 영역을 일반 영역 및 제 1 샌드 박스로 결정할 수 있다. 전자 장치는, 예를 들어 표 2와 같은 보안 레벨 및 할당 영역 사이의 연관 정보에 근거하여, 제 2 어플리케이션의 할당 영역을 일 반 영역 및 제 2 샌드 박스로 결정할 수 있다. 이에 따라, 도 11에서와 같이, 전자 장치는 제 1 어플리케 이션을 결정된 영역, 즉 일반 영역 및 제 1 샌드 박스에 할당할 수 있다. 전자 장치는 제 2 어플리케이션을 결정된 영역, 즉 일반 영역 및 제 2 샌드 박스에 할당할 수 있다. 한편, 다른 실시예에서는, 전자 장치는 어플리케이션을 아무 영역에도 할당하지 않고, 우선 보안 레벨부터 확인할 수도 있다. 전자 장치는 확인된 보안 레벨에 대응하여 일반 영역 및 샌드 박스 중 적어도 하나에 어플리케이션을 할당할 수 있다. 상술한 바에서는, 본 발명의 다양한 실시예에 따른 어플리케이션의 샌드 박스 할당 방법에 대하여 설명하였다. 상술한 바와 같이, 본 발명의 다양한 실시예에서는 어플리케이션의 다양한 메타데이터를 확인함으로써, 샌드 박 스에 할당할지 여부를 판단할 수 있는 전자 장치가 제공될 수 있다. 이에 따라, 전자 장치의 사용자 또는 보안 관리자가 아닌 어플리케이션 개발자 또는 제공자가, 어플리케이션의 샌드 박스 할당 여부를 결정할 수 있다. 이하에서는, 상술한 바에 따라 샌드 박스에 할당된 어플리케이션의 실행 방법 및 관련되는 전자 장치의 동작에 대하여 설명하도록 한다. 도 12는 본 발명의 다양한 실시예에 따른 어플리케이션의 실행을 설명하기 위한 개념도를 도시한다. 도 12의 실시예에서, 전자 장치는 제 1 어플리케이션을 일반 영역 및 제 1 샌드 박스에 할당하고, 제 2 어플리케이 션을 일반 영역 및 제 2 샌드 박스에 할당한 경우를 상정하도록 한다. 아울러, 전자 장치는 일반 영역을 사용자 식별자 \"0\"에 대응시키고, 제 1 샌드 박스를 사용자 식별자 \"200\"에 대응시키고, 제 2 샌드 박스를 사용 자 식별자 \"201\"에 대응시킨 것을 상정하도록 한다. 도 12에 도시된 바와 같이, 전자 장치는 일반 영역, 제 1 샌드 박스 및 제 2 샌드 박스에 할당된 모든 어 플리케이션에 대한 실행 아이콘(931,932)을 포함하는 화면을 표시할 수 있다. 전자 장치는 실행 아 이콘에 대한 터치 제스처와 같은 어플리케이션 실행 명령을 획득할 수 있다. 제 1 어플리케이션 실행 아이콘이 지정된 경우, 전자 장치는 제 1 어플리케이션을 실행할 수 있다. \"0\"의 사용자 식별자를 가지는 사용자가 로그인한 경우에는, 전자 장치는 일반 모드에서 제 1 어플리케이 션을 실행할 수 있다. 즉, 전자 장치는 일반 영역에 할당된 제 1 어플리케이션을 실행할 수 있다. \"20 0\"의 사용자 식별자를 가지는 사용자가 로그인한 경우에는, 전자 장치는 보안 모드에서 제 1 어플리케이션 을 실행할 수 있다. 즉, 전자 장치는 보안 영역에 할당된 제 1 어플리케이션을 실행할 수 있다. 이에 따 라, 사용자로부터 특정한 추가 명령을 수신하지 않아도, 전자 장치는 샌드 박스에서 어플리케이션을 할당 할 수 있다. 도 13은 본 발명의 다양한 실시예에 따른 어플리케이션 실행 방법의 흐름도를 도시한다. 1310 동작에서, 전자 장치는 제 1 어플리케이션 실행 명령을 획득할 수 있다. 예를 들어, 도 12에서와 같 이, 전자 장치는 제 1 어플리케이션 실행 아이콘을 표시하고, 표시된 실행 아이콘에 대한 터치 제스처와같은 지정을, 어플리케이션 실행 명령으로 획득할 수 있다. 1320 동작에서, 전자 장치는 제 1 어플리케이션이 샌드 박스에서 실행하는 어플리케이션인지 여부를 판단 할 수 있다. 본 발명의 다양한 실시예에서, 어플리케이션은 샌드 박스에서 실행하는지 여부를 지시하는 메타데 이터를 포함할 수 있다. 예를 들어, 메타데이터는 직접적으로 샌드 박스에서 실행하는지 여부를 지시하는 데이 터일 수 있으며, 또는 보안 레벨일 수도 있다. 상술한 바와 같이, 어플리케이션은 다운로드되는 시점에서 메타 데이터를 포함할 수 있거나 또는 전자 장치는 어플리케이션을 다운로드받는 경우에 해당 메타데이터를 함 께 수신할 수 있다. 전자 장치는 수신한 메타데이터를 저장할 수 있으며, 추후 실행 시점에서 메타데이터 를 다시 참조할 수 있다. 본 발명의 다양한 실시예에서, 샌드 박스에 할당하는 어플리케이션인지 여부를 지시 하는 메타데이터와 샌드 박스에 실행하는 어플리케이션인지 여부를 지시하는 메타데이터는 동일할 수 있다. 또 다른 실시예에서는 전자 장치는 어플리케이션 설치 시점에서 메타데이터를 생성할 수도 있다. 이 경우, 메타데이터는 어플리케이션 패키지에 포함될 수 있으며, 설치 시점에서 메타데이터가 생성될 수도 있다. 전자 장치는 실행 시점에서 메타데이터를 참조할 수 있다. 이 경우에는, 샌드 박스에 할당하는 어플리케 이션인지 여부를 지시하는 메타데이터와 샌드 박스에 실행하는 어플리케이션인지 여부를 지시하는 메타데이터는 상이할 수도 있다. 제 1 어플리케이션이 샌드 박스에서 실행하는 어플리케이션인 것으로 판단되면, 1330 동작에서 전자 장치 는 일반 영역 및 샌드 박스 중 하나의 영역에서 제 1 어플리케이션을 실행할 수 있다. 본 발명의 다양한 실시 예에 따라서 전자 장치는 제 1 어플리케이션이 실행되는 영역을 일반 영역 및 샌드 박스 중 하나로 결정할 수 있다. 하나의 실시예에서는 전자 장치는 샌드 박스에서 실행하는 어플리케이션인 경우에는, 해당 어플리케이션의 샌드 박스 내에서의 실행을 강제(enforce)할 수 있으며, 이를 강제 모드(enforce mode)로 명명할 수 있다. 강 제 모드에서는, 전자 장치는 제 1 어플리케이션을 샌드 박스에서 실행할 수 있다. 샌드 박스가 미생성되 거나 할당의 지연 시간 때문에 제 1 어플리케이션이 아직 샌드 박스에 생성되지 않은 경우에는, 전자 장치(10 1)는 제 1 어플리케이션의 실행을 대기 또는 중단할 수 있다. 또는, 전자 장치는 제 1 어플리케이션의 샌 드 박스 내의 실행이 불가하다는 취지를 표시하면서, 일반 영역에서의 실행 여부를 문의할 수도 있다. 전자 장 치는 일반 영역에서의 실행 명령이 획득되면, 제 1 어플리케이션을 일반 영역에서 실행할 수 있다. 또 다른 실시예에서, 전자 장치는 제 1 어플리케이션의 실행 영역을 문의할 수도 있다. 예를 들어, 전자 장치는 제 1 어플리케이션의 실행 영역을 일반 영역 또는 샌드 박스 중 하나로 결정할 수 있는 그래픽 사 용자 인터페이스를 표시할 수 있으며, 두 영역 중 하나의 선택 명령을 획득할 수 있다. 전자 장치는 획득 된 선택 명령에 따라 제 1 어플리케이션을 일반 영역 또는 샌드 박스 중 하나에서 실행할 수 있다. 이와 관련 하여서는 도 20을 참조하여 더욱 상세하게 후술하도록 한다. 제 1 어플리케이션이 샌드 박스에서 실행하는 어플리케이션이 아닌 것으로 판단되면, 1340 동작에서 전자 장치 는 일반 영역에서 제 1 어플리케이션을 실행할 수 있다. 도 14는 어플리케이션 실행 과정을 설명하는 개념도이다. 도 14에 도시된 바와 같이, 일반 영역에 할당된 런처 어플리케이션은 어플리케이션 실행 명령을 획 득할 수 있다. 더욱 상세하게, 런처 어플리케이션은 전자 장치의 일반 영역, 제 1 샌드 박스 및 제 2 샌드 박스에 할당된 모든 어플리케이션에 대한 실행 아이콘을 표시할 수 있다. 실행 아이콘이 지 정되면, 런처 어플리케이션은 실행 아이콘에 대응하는 숏컷(shortcut) 정보를 확인할 수 있다. 숏컷 정 보는 어플리케이션의 패키지 명칭과 같이 어플리케이션을 구분할 수 있는 유일한 값을 포함할 수 있다. 런처 어플리케이션은 확인된 숏컷 정보에 대응하여 제 1 어플리케이션의 실행에 필요한 정보를 확인하고, 확인 된 정보와 함께 어플리케이션 매니저에 실행 요청을 출력할 수 있다. 어플리케이션 매니저는 실행 요청을 입력받으며, 해당 어플리케이션이 샌드 박스에서 실행하는 어플 리케이션인지 여부를 판단할 수 있다. 하나의 실시예에서, 어플리케이션 매니저는 어플리케이션의 메타데 이터를 확인함으로써 해당 어플리케이션이 샌드 박스에서 실행하는 어플리케이션인지 여부를 판단할 수 있다. 예를 들어, 어플리케이션 매니저는 사용자 모드를 식별하는 확인 모듈(check module)을 더 포함할 수도 있 으며, 확인 모듈이 해당 어플리케이션이 샌드 박스에서 실행하는 어플리케이션인지 여부를 판단할 수 있다. 예 를 들어, 제 1 어플리케이션이 안드로이드 OS에 근거하여 제작된 경우에는, 어플리케이션 매니저는 AndroidManifest.xml 파일에 특정 데이터가 포함된지 여부에 따라 해당 어플리케이션이 샌드 박스에서 실행하는어플리케이션인지 여부를 판단할 수 있다. 한편, 상술한 바와 같이 어플리케이션 매니저는 제 1 어플리케이션을 샌드 박스에서 실행할지 여부를 문의 할 수 있다. 어플리케이션 매니저는 제 1 어플리케이션 실행할 때마다 샌드 박스에서 실행 여부를 문의할 수도 있으며, 또는 제 1 어플리케이션의 최초 실행시에 문의할 수도 있다. 또는, 어플리케이션 매니저는 사용자로의 문의 및 응답 없이, 제 1 어플리케이션을 샌드 박스에서 실행하도록 제어할 수도 있다. 본 발명의 다양한 실시예에서, 어플리케이션 매니저는 어플리케이션 실행 시에도 인증 결과를 참조할 수도 있다. 상술한 바와 같이, 본 발명의 다양한 실시예에 따른 전자 장치는 어플리케이션 다운로드시에 보안 서버(미도시)로 인증 요청을 송신하고, 인증 결과를 수신하여 저장할 수 있다. 어플리케이션 매니저는 어 플리케이션 실행 시에 저장된 인증 결과를 참조하여, 어플리케이션의 샌드 박스 실행 여부를 결정할 수도 있다. 어플리케이션 매니저는 어플리케이션 실행 시에 저장된 인증 결과를 참조하여, 어플리케이션을 일반 영역 에서 실행할지, 샌드 박스에서 실행할지 또는 어플리케이션을 실행하지 않을지를 결정할 수 있다. 도 15는 본 발명의 다양한 실시예에 따른 어플리케이션 실행 방법의 흐름도를 도시한다. 1510 동작에서, 전자 장치는 제 1 어플리케이션 실행 명령을 획득할 수 있다. 1520 동작에서, 전자 장치 는 제 1 어플리케이션 메타데이터를 확인할 수 있다. 본 발명의 다양한 실시예에서는, 제 1 어플리케이션 는 샌드 박스 영역에서 실행할지 여부를 나타내는 메타데이터를 포함하거나 또는 어플리케이션 매니저는 제 1 어플리케이션에 대응하는 메타데이터를 관리할 수 있다. 예를 들어, 메타데이터는 특정 데이터, 보안 레벨 또 는 인증 결과로 구현될 수 있다. 1530 동작에서, 전자 장치는 제 1 어플리케이션이 보안 영역에서 실행 또는 할당하는 어플리케이션인지 여 부를 판단할 수 있다. 제 1 어플리케이션이 보안 영역에서 실행하는 어플리케이션인 것으로 판단되면, 1540 동 작에서 전자 장치는 보안 영역에서 제 1 어플리케이션을 실행할 수 있다. 제 1 어플리케이션이 보안 영역 에서 실행하는 어플리케이션인 것으로 판단되지 않으면, 1550 동작에서 전자 장치는 일반 영역에서 제 1 어플리케이션을 실행할 수 있다. 특히, 하나의 실시예에서, 전자 장치는 별도의 사용자 전환 없이 보안 영역에서 제 1 어플리케이션을 실행할 수 있다. 다른 실시예에서는, 전자 장치는 별도의 사용자 전환을 위한 과정을 수행한 이후에 보안 영역에서 제 1 어플리케이션을 실행할 수 있다. 도 16은 본 발명의 다양한 실시예에 따른 강제 모드를 설명하기 위한 흐름도를 도시한다. 1610 동작에서, 전자 장치는 제 1 어플리케이션에 강제 모드를 설정할 수 있다. 상술한 바와 같이, 강제 모드는 제 1 어플리케이션을 샌드 박스에서만 실행하도록 하는 모드일 수 있다. 예를 들어, 어플리케이션 매니 저는 제 1 어플리케이션에 강제 모드를 설정할 수 있다. 1620 동작에서, 전자 장치는 제 1 어플리케이션 실행 명령을 획득할 수 있다. 1630 동작에서, 전자 장치는 제 1 어플리케이션이 보안을 위한 샌드 박스에 할당된지 여부를 판단할 수 있 다. 제 1 어플리케이션이 샌드 박스에 할당된 경우에는, 1640 동작에서 전자 장치는 제 1 어플리케이션을 샌드 박스에서 실행할 수 있다. 제 1 어플리케이션이 샌드 박스에 할당되지 않은 경우에는, 1650 동작에서 전 자 장치는 제 1 어플리케이션을 실행하지 않을 수 있다. 또는, 전자 장치는 제 1 어플리케이션의 샌 드 박스에의 할당을 대기하였다가, 할당 이후에 제 1 어플리케이션을 샌드 박스에서 실행할 수 있다. 예를 들 어, 도 17에서와 같이, 어플리케이션 매니저는 제 1 샌드 박스 내의 제 1 어플리케이션이 할당된지 여부를 판단할 수 있다. 도 18은 본 발명의 다양한 실시예에 따른 어플리케이션의 샌드 박스내 할당된지 여부를 판단하는 방법의 흐름도 를 도시한다. 1810 동작에서, 전자 장치는 제 1 어플리케이션에 대한 인증 결과를 확인할 수 있다. 상술한 바와 같이, 본 발명의 다양한 실시예에 따른 전자 장치는 어플리케이션 다운로드시에 보안 서버(미도시)로 인증 요청 을 송신하고, 인증 결과를 수신하여 저장할 수 있다. 전자 장치는 저장된 인증 결과를 참조하여, 어플리 케이션의 적법한 설치 여부를 판단할 수 있다. 인증 결과가 성공적인 경우에는, 전자 장치는 제 1 어플리 케이션이 적법하게 설치 및 할당된 것으로 판단할 수 있다. 인증 결과가 실패인 경우에는, 전자 장치는 제 1 어플리케이션이 샌드 박스에 할당되지 않은 것으로 판단할 수 있다. 1820 동작에서, 전자 장치는 제 1 샌드 박스에 제 1 어플리케이션 데이터 저장 여부를 확인할 수 있다. 예를 들어, 어플리케이션 매니저는 샌드 박스에 대응하는 전자 장치의 리소스에, 제 1 어플리케이션 데이터가 저장되는지 여부를 판단할 수 있다. 샌드 박스에 제 1 어플리케이션 데이터가 저장된 것으로 판단되면, 전자 장치는 제 1 어플리케이션이 샌드 박스에 할당된 것으로 판단할 수 있다. 샌드 박스에 제 1 어플리 케이션 데이터가 저장되지 않은 것으로 판단되면, 전자 장치는 제 1 어플리케이션이 샌드 박스에 할당되지 않은 것으로 판단할 수 있다. 도 19는 본 발명의 다양한 실시예에 따른 어플리케이션 실행 방법의 흐름도를 도시한다. 도 19의 실시예는 도 20을 참조하여 더욱 상세하게 설명하도록 한다. 도 20은 본 발명의 다양한 실시예에 따른 전자 장치의 화면을 설명하기 위한 개념도를 도시한다. 1910 동작에서, 전자 장치는 제 1 어플리케이션 실행 명령을 획득할 수 있다. 예를 들어, 전자 장치(10 1)는 도 20에서와 같이 어플리케이션 실행 아이콘(931,932)을 포함하는 화면을 표시할 수 있다. 전자 장치 는, 예를 들어 제 1 어플리케이션 실행 아이콘에 대한 터치 제스처를 획득할 수 있다. 1920 동작에서, 전자 장치는 제 1 어플리케이션이 샌드 박스에서 실행하는 어플리케이션인지 여부를 판단 할 수 있다. 예를 들어, 전자 장치는 제 1 어플리케이션의 메타데이터를 참조하여, 제 1 어플리케이션이 샌드 박스에서 실행하는 어플리케이션인지 여부를 판단할 수 있다. 제 1 어플리케이션이 샌드 박스에서 실행하는 어플리케이션인 것으로 판단되면, 1930 동작에서 전자 장치 는 일반 영역 및 샌드 박스 중 하나를 선택받을 수 있다. 예를 들어, 전자 장치는 도 20에서와 같은 사용 자 그래픽 인터페이스를 표시할 수 있다. 본 발명의 다양한 실시예에 따른 사용자 그래픽 인터페이스 는 제 1 어플리케이션을 실행할 영역에 대한 선택 창일 수 있다. 사용자 그래픽 인터페이스는 일 반 모드 또는 보안 모드 중 하나를 선택받을 수 있다. 1940 동작에서, 전자 장치는 획득된 선택에 대응하여 제 1 어플리케이션을 일반 영역 및 샌드 박스 중 어 느 하나의 영역에서 실행할 수 있다. 제 1 어플리케이션이 샌드 박스에서 실행하는 어플리케이션이 아닌 것으로 판단되면, 1950 동작에서 전자 장치 는 일반 영역에서 제 1 어플리케이션을 실행할 수 있다. 도 21a은 본 발명의 다양한 실시예에 따른 전자 장치의 제어 방법의 흐름도를 도시한다. 2110 동작에서, 전자 장치는 적어도 하나의 어플리케이션 프로그램이 동작할 수 있는 제 1 환경, 예를 들 어 일반 영역 및 상기 일반 영역과 동작 환경이 적어도 일부 상이한 제 2 환경, 예를 들어 샌드 박스를 제공할 수 있다. 2120 동작에서, 전자 장치는 상기 제 1 환경에서, 사용자의 제 1 입력에 적어도 일부 응답하여, 통신 모듈 을 통하여, 외부 서버에 의하여 제공되는 어플리케이션 마켓에 접속할 수 있다. 2130 동작에서, 전자 장치는 상기 제 1 환경에서, 사용자의 제 2 입력에 적어도 일부 응답하여, 상기 어플 리케이션 마켓으로부터 선택된 제 1 어플리케이션을 다운로드하여 설치할 수 있다. 2140 동작에서, 전자 장치는 상기 설치된 제 1 어플리케이션을 상기 제 1 환경에 할당할 수 있다. 2150 동작에서, 전자 장치는 사용자의 입력 없이, 상기 설치된 제 1 어플리케이션을 상기 제 2 환경에 할 당할 수 있다. 본 발명의 다양한 실시예에서, 상기 제 1 어플리케이션은, 상기 제 2 환경에서 실행하는 어플리케이션인지 여부 를 지시하는 메타데이터를 포함할 수 있다. 본 발명의 다양한 실시예에서, 전자 장치는 상기 메타데이터에 근거하여, 상기 전자 장치에 미생성된 제 2 환경을 생성할 수 있다. 상기 메타데이터는, 특정 데이터, 상기 제 1 어플리케이션의 보안 레벨 및 보안을 위한 인증 관련 데이터 중 적 어도 하나를 포함할 수 있다. 본 발명의 다양한 실시예에서, 전자 장치는 상기 보안 레벨에 따라서 보안을 위한 상기 제 2 환경에 상기 제 1 어플리케이션을 할당할지 여부를 판단할 수 있다. 본 발명의 다양한 실시예에서, 전자 장치는 보안 서버로 상기 제 1 어플리케이션에 대한 인증 요청을 송신 하고, 상기 보안 서버로부터 상기 인증 요청에 응답하는 인증 결과를 수신할 수 있다. 본 발명의 다양한 실시예에서, 전자 장치는 상기 인증 결과에 근거하여, 상기 제 1 어플리케이션을 상기 제 2 환경에 할당 여부를 결정할 수 있으며, 상기 결정된 할당 여부에 따라서 상기 제 1 어플리케이션을 상기제 2 환경에 할당할 수 있다. 상기 인증 요청은, 인증을 위한 보안 키 및 상기 보안 키에 의하여 암호화된 값 중 적어도 하나를 포함할 수 있다. 본 발명의 다양한 실시예에서, 전자 장치는 상기 제 1 환경 및 상기 제 2 환경에 할당된 어플리케이션의 실행을 위한 실행 아이콘을 단일 화면에 표시하는 동작을 더 포함할 수 있다. 상기 제 2 환경은, 사용자 식별 자 별로 대응될 수 있다. 도 21b는 본 발명의 다양한 실시예에 따른 전자 장치의 제어 방법의 흐름도를 도시한다. 2161 동작에서, 전자 장치는 적어도 하나의 어플리케이션 프로그램이 동작할 수 있는 제 1 환경 및 제 2 환경을 제공할 수 있다. 2162 동작에서, 전자 장치는 상기 제 1 환경에서만 동작하는 제 1 어플리케이션을 설치할 수 있다. 2163 동작에서, 전자 장치는 상기 제 1 환경 및 제 2 환경 중 적어도 하나에서 선택적으로 동작하는 제 2 어플 리케이션을 설치할 수 있다. 2164 동작에서, 전자 장치는 상기 제 2 어플리케이션이 상기 제 1 환경에서 동작 중에 발생된 제 1 데이터 에 대하여는, 상기 제 1 어플리케이션에 의한 접근을 허용할 수 있다. 2165 동작에서, 전자 장치는 상기 제 2 어플리케이션이 상기 제 2 환경에서 동작 중에 발생된 제 2 데이터에 대하여는, 상기 제 1 어플리케이션에 의한 접근을 허용하지 않을 수 있다. 2166 동작에서, 전자 장치는 상기 제 1 어플리케이션이 상기 제 1 환 경에서 동작 중에 발생된 제 3 데이터에 대하여는, 상기 제 2 어플리케이션에 의한 접근을 허용할 수 있다. 2167 동작에서, 전자 장치는 상기 제 2 어플리케이션을 설치할 때, 사용자의 입력 없이, 상기 제 2 어플리 케이션을, 적어도 상기 제 2 환경에 할당할 수 있다. 본 발명의 다양한 실시예에서, 상기 제 2 어플리케이션은, 상기 제 2 환경과 연관된 어플리케이션인지 여부를 지시하는 메타데이터를 포함할 수 있다. 본 발명의 다양한 실시예에서, 전자 장치는 상기 메타데이터에 근 거하여, 상기 전자 장치에 미생성된 제 2 환경을 생성할 수 있다. 상기 메타데이터는, 특정 데이터, 상기 제 2 어플리케이션의 보안 레벨 및 보안을 위한 인증 관련 데이터 중 적 어도 하나를 포함할 수 있다. 본 발명의 다양한 실시예에서, 전자 장치는 상기 보안 레벨에 따라서 보안을 위한 상기 제 2 환경에 상기 제 2 어플리케이션을 할당할지 여부를 판단할 수 있다. 본 발명의 다양한 실시예에서, 전자 장치는 보안 서버로 상기 제 2 어플리케이션에 대한 인증 요청을 송신 하고, 상기 보안 서버로부터 상기 인증 요청에 응답하는 인증 결과를 수신할 수 있다. 본 발명의 다양한 실시예에서, 전자 장치는 상기 인증 결과에 근거하여, 상기 제 2 어플리케이션을 상기 제 2 환경에 할당 여부를 결정할 수 있으며, 상기 결정된 할당 여부에 따라서 상기 제 2 어플리케이션을 상기 제 2 환경에 할당할 수 있다. 상기 인증 요청은, 인증을 위한 보안 키 및 상기 보안 키에 의하여 암호화된 값 중 적어도 하나를 포함할 수 있다. 본 발명의 다양한 실시예에서, 전자 장치는 상기 제 1 환경 및 상기 제 2 환경에 할당된 어플리케이션의 실행을 위한 실행 아이콘을 단일 화면에 표시하는 동작을 더 포함할 수 있다. 상기 제 2 환경은, 사용자 식별 자 별로 대응될 수 있다. 도 22는 본 발명의 다양한 실시예에 따른 전자 장치의 제어 방법의 흐름도를 도시한다. 2210 동작에서, 전자 장치는 적어도 하나의 어플리케이션 프로그램이 동작할 수 있는 제 1 환경, 및 상기 일반 영역과 동작 환경이 적어도 일부 상이한 제 2 환경을 제공할 수 있다. 2220 동작에서, 전자 장치는 상기 입출력 인터페이스를 통하여 제 1 어플리케이션의 실행 명령을 획득하면, 상기 제 1 어플리케이션이 상기 제 2 환경에서 실행하는 어플리케이션인지를 판단할 수 있다. 2230 동작에서, 전자 장치는 상기 제 1 어플리케이션이 상기 제 2 환경에서 실행하는 어플리케이션인 것으 로 판단되면, 상기 제 2 환경에서 상기 제 1 어플리케이션을 실행할 수 있다. 본 발명의 다양한 실시예에서, 전자 장치는 상기 제 1 어플리케이션의 실행 아이콘을 표시할 수 있으며, 상기 표시된 제 1 어플리케이션의 실행 아이콘의 지정을 획득할 수 있다.본 발명의 다양한 실시예에서, 상기 제 1 환경 및 제 2 환경은, 사용자 식별 정보 별로 대응될 수 있다. 본 발명의 다양한 실시예에서, 전자 장치는, 상기 제 1 어플리케이션이 포함하는, 상기 제 2 환경에서 실 행하는지 여부를 지시하는 메타데이터를 확인할 수 있다. 상기 메타데이터는, 상기 제 1 어플리케이션의 제작 시 상기 제 1 어플리케이션에 삽입되는 데이터, 상기 제 1 어플리케이션의 보안 레벨 및 상기 제 1 어플리케이 션의 인증 결과 중 적어도 하나를 포함할 수 있다. 본 발명의 다양한 실시예에서, 전자 장치는 상기 제 2 환경에, 상기 제 1 어플리케이션이 할당된지 여부를 판단할 수 있다. 본 발명의 다양한 실시예에서, 전자 장치는 상기 제 2 환경에 상기 제 1 어플리케이션이 할당되지 않은 경 우에는, 상기 제 1 어플리케이션을 실행하지 않거나 또는 상기 제 1 환경에서 상기 제 1 어플리케이션을 실행할 수 있다. 본 발명의 다양한 실시예에서, 전자 장치는 상기 제 2 환경에 상기 제 1 어플리케이션이 할당된 경우에는, 상기 제 2 환경에서 상기 제 1 어플리케이션을 실행할 수 있다. 본 발명의 다양한 실시예에서, 전자 장치는 상기 제 2 환경에, 상기 제 1 어플리케이션의 데이터가 저장된 지를 판단할 수 있다. 본 발명의 다양한 실시예에서, 전자 장치는 제 1 환경 및 상기 제 2 환경 중 하나를 선택받으며, 상기 선 택된 영역에서 상기 제 1 어플리케이션을 실행할 수도 있다. 도 23은 본 발명의 다양한 실시예에 따른 전자 장치에서 설정되는 도메인의 개념을 설명하기 위한 블록도이다. 도 23에 도시된 바와 같이, 제 1 샌드 박스 내에는 제 1 도메인 및 제 2 도메인이 설정될 수 있다. 상술한 바와 같이, 제 1 샌드 박스는 사용자 식별자에 따라 설정될 수 있다. 한편, 제 1 어플리케 이션, 제 2 어플리케이션, 제 3 어플리케이션 및 제 4 어플리케이션는 제 1 샌드 박스 에 할당되면서, 제 1 어플리케이션 및 제 2 어플리케이션은 제 1 도메인에 할당될 수 있으며, 제 3 어플리케이션 및 제 4 어플리케이션은 제 2 도메인에 할당될 수 있다. 본 발 명의 다양한 실시예에 의한 전자 장치는 제 1 도메인에 할당된 제 1 어플리케이션 및 제 2 어 플리케이션의 입출력 데이터에 제 는 콘텍스트로 구현될 수 있으며, 예를 들어 하기와 같을 수 있다. \"$ ls -lZ /home drwx------ kdj kdj system_u:object_r:user_home_dir_t kdj drwx------ fedora fedora root:object_r:user_home_dir_t fedora $ ls -Z /etc/passwd -rw-r--r-- root root system_u:object_r:etc_t /etc/passwd $ \" 상기와 같이, 본 발명의 다양한 실시예에 따른 전자 장치는 특정 도메인에 할당된 어플리케이션의 입출력 데이터의 콘텍스트에 \"_t\"와 같은 접미사를 부가함으로써, 특정 도메인에 설치 및 할당된 어플리케이션임을 나 타낼 수 있다. 한편,\"_t\"와 같은 접미사는 단순히 예시적인 것으로, 본 발명의 다양한 실시예에 따른 전자 장 치는 특정 도메인에 설치 및 할당된 어플리케이션의 입출력 데이터의 콘텍스트에 다양한 방식으로 도메인 관련 표시를 부가할 수 있다. 전자 장치는 제 1 도메인의 어플리케이션 실행시 입출력되는 데이터를 제 2 도메인의 어플리 케이션과 분리시킬 수 있다. 예를 들어, 전자 장치는 도메인 단위로 도메인 내부 또는 외부 간 파일 읽기 /쓰기 권한, 시스템 메시지나 OS의 인텐트(intent) 송수신 여부를 제어할 수 있다. 이에 따라, 제 1 도메인 에 할당된 어플리케이션과 제 2 도메인에 할당된 어플리케이션은 데이터 및 코드 실행을 공유하지 않을 수 있다. 한편, 일반 영역에는, 제 5 어플리케이션 및 에이전트가 할당될 수 있다. 본 발명의 다양한 실시예에서, 에이전트는 어플리케이션의 할당 위치를 결정할 수 있다. 예를 들어, 에이전트는 어 플리케이션의 메타데이터를 참조하여 도메인에 할당할 지 여부를 결정할 수 있다. 에이전트는 어플리케이션의 할당 위치를 포함한 설치 요청을 도메인 매니저로 출력할 수 있다. 도메인 매니저는 에이전트 로부터 입력된 설치 요청에 따라 어플리케이션을 설치하면서, 도메인에 할당할 수 있다. 한편, 에이전트 는 보안 서버로의 인증 요청 송신 및 도메인 식별자 수신을 수행할 수도 있다. 도메인 매니저는 도메인의 생성 및 삭제를 수행할 수 있다. 본 발명의 다양한 실시예에서, 도메인 매니저 는 Security Enhanced 기능에 근거하여 도메인의 생성 및 삭제를 수행할 수 있다. 한편, 도메인 매니저 는 어플리케이션이나 파일의 데이터 처리 영역을 특정 도메인에 할당할 수 있다. 본 발명의 다양한 실시예에서, 특정 도메인에 어플리케이션을 할당한다는 것 또는 특정 도메인에서 어플리케이 션이 실행한다는 것은, 설치되는 어플리케이션을 특정 도메인에 속하는 어플리케이션의 목록에 추가, 예를 들어, 데이터베이스를 갱신함으로써, 설치되는 어플리케이션이 할당된 도메인의 정책(policy)에 적용, 예를 들 어, 정책에 기반하여 어플리케이션이 동작되도록 하는 것으로 이해될 수 있을 것이다. 에이전트는 도메 인에서 실행하는 어플리케이션에 대한 인증을 수행하며, 인증에 따라 획득되는 도메인 식별자를 도메인 매니저 로 출력할 수 있다. 한편, 도메인 매니저는 샌드 박스 매니저와 동일한 엔티티로 구현될 수도 있다. 본 발명의 다양한 실시예에서, 도메인 매니저는 샌드 박스 매니저와 서로 대체될 수도 있다. 도 24a는 본 발명의 다양한 실시예에 따른 어플리케이션 설치 방법의 흐름도를 도시한다. 2410 동작에서, 전자 장치는 제 1 어플리케이션을 다운로드 받을 수 있다. 예를 들어, 전자 장치는 어플리케이션 마켓으로부터 제 1 어플리케이션을 다운로드받을 수 있다. 한편, 본 발명의 다양한 실시예에서는, 전자 장치는 일반적인 어플리케이션 다운로드 과정 이외에도, P2P 통신, 이메일 전송, 외부 메모리의 접속을 통한 전송 등의 다양한 경로로 어플리케이션을 획득할 수도 있다. 2420 동작에서, 전자 장치는 다운로드받은 제 1 어플리케이션이 도메인에서 실행하는 어플리케이션인지 여 부를 판단할 수 있다. 본 발명의 다양한 실시예에서, 제 1 어플리케이션은, 도메인에서 실행하는지 또는 도메 인에 할당되는지의 여부 중 적어도 하나를 나타내는 메타데이터를 포함할 수 있다. 예를 들어, 제 1 어플리케 이션이 안드로이드 OS에 근거하여 제작된 경우에는, AndoroidManifest.xml 파일 내에 특정 데이터를 삽입한 형 태로 메타데이터를 포함할 수 있다. 다만, 상술한 안드로이드 OS 관련 예는 단순히 예시적인 것으로, 본 발명 의 다양한 실시예에 따른 전자 장치는 다양한 OS에 근거하여 제작된 어플리케이션에 대하여서도, 도메인에 서 실행하는 어플리케이션인지 여부를 포함하는 메타데이터를 확인 및 관리할 수 있다. 다양한 실시예에서, 상 술한 메타데이터는 단순한 플래그 형태로 구현될 수도 있으며, 전자 장치는 해당 메타데이터를 확인함에 따라 제 1 어플리케이션이 도메인에서 실행하는 어플리케이션인지 여부를 판단할 수 있다. 전자 장치는 제 1 어플리케이션의 메타데이터를 확인함으로써 다운로드받은 제 1 어플리케이션이 도메인에 서 실행하는 어플리케이션인지 여부를 판단할 수 있다. 예를 들어, 제 1 어플리케이션이 안드로이드 OS에 근거 하여 제작된 경우에는, 제 1 어플리케이션의 AndoroidManifest.xml 파일 내에 특정 데이터가 포함된지 여부를 판단함으로써 다운로드받은 제 1 어플리케이션이 도메인에서 실행하는 어플리케이션인지 여부를 판단할 수 있다. 제 1 어플리케이션이 도메인에서 실행하는 어플리케이션인 경우에는, 2430 동작에서 전자 장치는 제 1 어 플리케이션을 설치하고 도메인에 할당할 수 있다. 본 발명의 다양한 실시예에서는, 전자 장치는 일반 영 역에 제 1 어플리케이션을 할당하면서, 일반 영역에서 설정된 도메인에 제 1 어플리케이션을 할당할 수 있다. 또는, 전자 장치는 제 1 샌드 박스에 제 1 어플리케이션을 할당하면서, 제 1 샌드 박스에서 설정된 도메인 에 제 1 어플리케이션을 할당할 수도 있다. 예를 들어, 도 25a에 도시된 바와 같이, 전자 장치는 제 1 도메인에 제 1 어플리케이션을 할 당할 수 있다. 전자 장치는 제 1 샌드 박스에 제 1 도메인을 설정할 수 있다. 이 경우, 전자 장치는, 제 1 어플리케이션의 데이터를 제 1 도메인에 할당할 수 있다. 예를 들어, 전자 장치(10 1)는 제 1 어플리케이션의 데이터에 제 1 도메인의 식별자를 부가하여 처리할 수 있다. 한편, 다른 실시 예에서는, 전자 장치는 일반 영역에 제 1 도메인을 생성하고, 생성된 제 1 도메인에 제 1 어플리케이션을 할당할 수도 있다. 제 1 어플리케이션이 도메인에서 실행하는 어플리케이션이 아닌 경우에는, 440 동작에서 전자 장치는 일반 영역 또는 샌드 박스에 제 1 어플리케이션을 할당할 수 있다. 즉, 전자 장치는 도메인에 제 1 어플리케이션을 할당하지 않을 수 있다. 예를 들어, 도 25b에 도시된 바와 같이, 전자 장치는 일반 영역에 제 1 어플리케이션을 할당할 수 있다. 이 경우, 전자 장치는, 제 1 어플리케이션의 일반 모드에 대응하는 데이터를 일반 영역에 대응하는 리소스에 할당할 수 있다. 아울러, 제 1 도메인에 다른 어플리케이션이 할당된 경우에는, 전자 장치는 제 1 어플리케이션의 데이터 및 코드 실행을 제 1 도메인에 할당된 다른 어플리케이션으로부 터 격리시킬 수 있다. 한편, 또 다른 실시예에서, 전자 장치는 제 1 어플리케이션을 제 1 샌드 박스 내에 할당하되, 제 1 도메인 에 할당하지 않을 수 있다. 제 1 어플리케이션이 실행되는 경우에는, 제 1 어플리케이션의 데이터 및 코드 실행이 제 1 도메인 밖에 할당된 다른 어플리케이션과 공유될 수 있다. 도 24b는 본 발명의 다양한 실시예에 따른 어플리케이션 설치 방법의 흐름도를 도시한다. 2410 동작에서, 전자 장치는 제 1 어플리케이션을 다운로드받을 수 있다. 2413 동작에서, 전자 장치(10 1)는 제 1 어플리케이션의 메타데이터를 확인할 수 있다. 전자 장치는 제 1 어플리케이션의 파일 중 삽입 된 특정 데이터로 메타데이터를 확인할 수 있다. 본 발명의 다양한 실시예에서, 메타데이터는 어플리케이션이 도메인에 할당되어야 하는지 여부 또는 어플리케이션이 도메인에서 실행하는지의 여부(예를 들어, 도메인의 정 책에 기반하여 어플리케이션을 실행 또는 동작하는)와 관련된 것으로, 직접적으로 보안 영역에 할당되어야 하는 지 여부를 나타낼수도 있거나 또는 보안 레벨의 형태로 구현될 수도 있다. 2415 동작에서, 전자 장치는 제 1 어플리케이션이 도메인에 할당되었는지 여부 및 도메인에서 실행하는, 예를 들어, 도메인의 정책에 기반하여 앱을 실행하는 어플리케이션인지 여부 중 적어도 하나를 판단할 수 있다. 예를 들어, 메타데이터가 직접적으로 도메인에 할당 및 실행되어야 하는 것을 나타내는 경우에는, 전자 장치 는 제 1 어플리케이션을 도메인에 할당하는 것으로 판단할 수 있다. 또는, 메타데이터가 보안 레벨인 경 우에는, 전자 장치는 확인된 보안 레벨에 따라, 예를 들어, 보안 레벨의 낮음 또는 높음에 따라 제 1 어플 리케이션이 도메인에 할당하는 어플리케이션인지 여부를 판단할 수도 있다. 한편, 2430 동작 및 2440 동작에 대하여서는, 도 24a를 참조하여 상세하게 설명하였기 때문에 여기에서의 더 이상의 설명은 생략하도록 한다. 도 26은 본 발명의 다양한 실시예에 따른 어플리케이션 설치 방법의 흐름도를 도시한다. 2611 동작에서, 보안 서버는 어플리케이션 마켓과 어플리케이션 리스트를 공유할 수 있다. 하나의 실시예에서, 보안 서버는 어플리케이션 마켓에 업로드되는 어플리케이션, 어플리케이션에 대응하는 보안 키와 도메인 식별자 사이의 연관 정보를, 어플리케이션 마켓 또는 다른 외부 엔티티로부터 수신할 수 있다. 표 3은 본 발명의 다양한 실시예에 따른 어플리케이션, 보안 키와 도메인 식별자 사이의 연관 정보 의 예시이다. 표 3 어플리케이션 도메인 식별자 보안 키 제 1 어플리케이션 abc akbidll 제 2 어플리케이션 Def vnei3 제 3 어플리케이션 Ghi villlwo5 2613 동작에서, 보안 서버는 예를 들어 표 3과 같은 어플리케이션 리스트를 저장할 수 있다. 2615 동작에서, 전자 장치는 어플리케이션 마켓으로부터 어플리케이션을 다운로드받을 수 있다. 아 울러, 전자 장치는 어플리케이션 마켓으로부터 보안 키를 다운로드받을 수 있다. 여기에서, 보안 서버에 저장된 보안 키 및 전자 장치가 수신하는 보안 키는 상이하거나 또는 서로 동일할 수도 있다. 본 발명의 다양한 실시예에서, 보안 서버에 저장된 보안 키 및 전자 장치가 수신하는 보안 키는 다양한 암호화/복호화 알고리즘에서 이용 가능한 키 값일 수 있다. 하나의 예에서, 전자 장치는 제 1 어플리케이션과 \"akbidll\"의 보안 키를 어플리케이션 마켓으로부터 다운로드 받는 것을 상정하도록 한 다. 한편, 제 1 어플리케이션은 도메인에서 실행하는 것을 지시하는 메타데이터를 포함할 수 있다. 상술한 바 와 같이, 메타데이터는 도메인에서 실행하는 것을 지시하는 데이터, 보안 레벨일 수 있거나 또는 보안 키가 메타데이터로 이용될 수도 있다. 2617 동작에서, 전자 장치는 메타데이터를 확인할 수 있으며, 확인 결과에 따라 다운로드받은 제 1 어플리 케이션이 도메인에서 실행하는 어플리케이션인지 여부를 판단할 수 있다. 예를 들어, 전자 장치는 메타데 이터에 직접 지시된 제 1 어플리케이션이 도메인에서 실행하는 것을 나타내는 데이터에 근거하여 판단할 수 있 다. 또는, 전자 장치는 제 1 어플리케이션의 보안 레벨에 따라서, 제 1 어플리케이션이 도메인에서 실행 하는 것을 판단할 수 있다. 또는, 전자 장치는 제 1 어플리케이션과 함께 수신된 보안 키에 근거하여, 제 1 어플리케이션이 도메인에서 실행하는 것을 판단할 수도 있다. 2619 동작에서, 전자 장치는 보안 서버로 제 1 어플리케이션에 대한 인증 요청을 송신할 수 있다. 예를 들어, 인증 요청은, 제 1 어플리케이션의 식별자 및 보안 키를 포함할 수 있다. 여기에서, 제 1 어플리케 이션의 식별자는 어플리케이션 패키지 명칭 또는 어플리케이션 등록 번호 등의 다양한 정보로 구현될 수 있으며, 어플리케이션을 식별할 수 있는 데이터라면 제한이 없음을 당업자는 용이하게 이해할 수 있을 것이다. 다른 실시예에서, 인증 요청은 보안 키를 이용한 암호화된 값을 포함할 수도 있다. 전자 장치는 어플리케 이션 마켓으로부터 수신된 보안 키에 다양한 암호화 알고리즘을 적용하여, 암호화된 값을 생성할 수 있다. 전자 장치는 어플리케이션 식별자 및 암호화된 값을 포함한 인증 요청을 송신할 수도 있다. 또 다 른 예에서, 어플리케이션 개발자는 보안 키로 어플리케이션을 사이닝(signing)할 수 있으며, 보안 서버는 사이닝 여부를 확인함으로써 인증을 수행할 수도 있다. 본 발명의 다양한 실시예에서, 도메인 에이전트는 보안 서버와 인증 요청 송신 및 인증 결과 또는 도메인 식별자 수신을 수행할 수 있다. 또는, 보안 서버 는 어플리케이션 식별자만을 확인하여, 이에 대응하여 도메인 식별자를 반환할 수도 있다. 또는, 인증이 실패한 경우에는, 보안 서버는 에러 메시지를 송신할 수도 있다. 2621 동작에서, 보안 서버는 인증 요청에 응답하는 도메인 식별자를 전자 장치로 송신할 수 있다. 보안 서버는 인증 요청에 포함된 어플리케이션 식별자 및 보안 키를, 저장하고 있는 어플리케이션 리스트 와 비교함으로써, 인증을 수행할 수 있다. 또는, 보안 서버는 인증 요청에 포함된 암호화된 값을, 기저 장된 보안 키를 이용하여 복호화하여 인증을 수행할 수도 있다. 보안 서버는, 제 1 어플리케이션에 대한 인증 성공 또는 실패를 판단할 수 있다. 보안 서버는 인증 성공 시에, 제 1 어플리케이션에 대응하는 식 별자를 전자 장치로 송신할 수 있다. 2623 동작에서, 전자 장치는 도메인 식별자를 확인할 수 있다. 2625 동작에서, 전자 장치는 도메인 식별자에 대응하는 도메인에 제 1 어플리케이션을 할당할 수 있다. 예를 들어, 도메인 식별자에 대응하는 도메 인이 기존재하는 경우에는, 전자 장치는 제 1 어플리케이션을 해당 도메인에 할당할 수 있다. 또는, 전자 장치는 도메인 식별자에 대응하는 도메인이 기존재하지 않는 경우에는, 전자 장치는 우선 도메인을 생성하고, 생성된 도메인에 제 1 어플리케이션을 할당할 수 있다. 한편, 인증이 실패한 경우에는, 전자 장치는 제 1 어플리케이션을 일반 영역 또는 샌드 박스에 할당할 수 있다. 이 경우, 전자 장치는 제 1 어플리케이션을 도메인에 할당하지 않을 수 있다. 한편, 도 26의 실시예에서는, 보안 서버 및 어플리케이션 마켓이 상이한 엔티티로 도시되어 있지만, 보안 서버 및 어플리케이션 마켓은 하나의 엔티티로 구현될 수도 있다. 도 27은 본 발명의 다양한 실시예에 따른 전자 장치의 제어 방법의 흐름도를 도시한다. 2710 동작에서, 전자 장치는 제 1 어플리케이션을 다운로드받을 수 있다. 2720 동작에서, 전자 장치는 제 1 어플리케이션이 도메인에서 실행하는 어플리케이션인지 여부를 판단할 수 있다. 하나의 실시예에서, 전자 장치는 제 1 어플리케이션에 포함된 메타데이터를 이용하여, 제 1 어 플리케이션이 도메인에서 실행하는 어플리케이션인지 여부를 판단할 수 있다. 제 1 어플리케이션이 도메인에서 실행하는 어플리케이션인 것으로 판단되면, 2730 동작에서 전자 장치는 제 1 어플리케이션을 설치 및 할당할 도메인이 존재하는지 여부를 판단할 수 있다. 상술한 바와 같이, 전자 장 치는 보안 서버 또는 어플리케이션 마켓으로부터 도메인 식별자를 획득할 수 있으며, 전자 장치는 메 타데이터를 참조하여 획득된 도메인 식별자에 대응하는 도메인에 제 1 어플리케이션을 할당할 수 있다. 이에 따라, 전자 장치는 확인된 도메인이 이미 전자 장치에 설정되어 있는지 여부를 판단할 수 있다. 예를 들어, 도 28a에서와 같이, 전자 장치는 제 1 어플리케이션에 대응하는 제 1 도메인 식별자를 획득한 것을 상정하도록 한다. 전자 장치는 제 1 도메인이 이미 설정되어 있는지 여부를 판단할 수있다. 하나의 실시예에서, 전자 장치에서 정의된 어플리케이션 매니저는 어플리케이션 계층에 제 1 도메인이 설치 및 할당되었는지 여부를 판단할 수 있다. 도 28a의 실시예에서는, 제 1 도메 인이 미생성된 것을 상정하도록 한다. 도메인이 생성되어 있지 않으면, 2740 동작에서 전자 장치는 미생성된 도메인을 생성할 수 있다. 예를 들 어, 도 28b에서와 같이, 전자 장치에서 정의된 도메인 매니저는 제 1 도메인을 생성할 수 있다. 도메인이 생성되면, 2750 동작에서 전자 장치는 생성되거나 또는 기 존재하였던 도메인에 제 1 어플리케이 션을 할당할 수 있다. 본 발명의 다양한 실시예에서, 도 28b에 도시된 바와 같이, 전자 장치는 제 1 도메인에 제 1 어플리케이션을 할당할 수도 있다. 한편, 제 1 어플리케이션이 도메인에서 실행하는 어플리케이션이 아닌 것으로 판단되면, 2760 동작에서 전자 장 치는 일반 영역 또는 샌드 박스 등의 도메인 이외에 제 1 어플리케이션을 할당할 수 있다. 도 29a 내지 29g는 본 발명의 다양한 실시예에 따른 전자 장치의 화면을 설명하기 위한 개념도를 도시한다. 도 29a를 참조하면, 전자 장치는 제 1 영역에서 메뉴 화면을 표시할 수 있다. 여기에서, 메뉴 화면 은 런처 어플리케이션에 의한 화면으로, 구현에 따라 런처 어플리케이션 실행 화면으로 명명될 수도 있다. 아울러, 제 1 영역은, 제 1 도메인 이외의 영역을 의미할 수 있다. 전자 장치는 적어도 하나의 어 플리케이션 실행 아이콘(2901,2902,2903)을 표시할 수 있다. 예를 들어, 전자 장치는 갤러리 어플리케이 션의 실행 아이콘, 플래너 어플리케이션의 실행 아이콘 및 어플리케이션 마켓 어플리케이션의 실행 아이콘을 표시할 수 있다. 이 경우, 전자 장치는 일반 영역에 갤러리 어플리케이션, 플 래너 어플리케이션 및 어플리케이션 마켓 어플리케이션을 기설치할 수 있다. 한편, 전자 장치 는 어플리케이션 마켓 어플리케이션의 실행 아이콘의 지정에 따른 실행 명령을 획득할 수 있 다. 상술한 바와 같이, 제 2 영역은 도메인일 수 있으며, 제 1 영역은 도메인 이외의 영역일 수 있다. 한편, 제 1 및 2 환경은 예를 들어 사용자 식별자별로 구분되는 영역으로, 제 1 및 2 영역과는 차이가 있을 수 있다. 도 29b를 참조하면, 전자 장치는 실행 명령에 따라 어플리케이션 마켓 어플리케이션을 실행할 수 있다. 전자 장치는 어플리케이션 마켓 어플리케이션의 실행 화면을 표시할 수 있으며, 실행 화면에는 어플리케이 션 마켓에 업로드된 어플리케이션(2911,2913)과 다운로드 명령 오브젝트(2912,2914)가 포함될 수 있다. 예를 들어, 전자 장치가 \"A 은행 어플리케이션\"을 다운로드하는 경우를 상정하도록 한다. 사용자는 다운 로드 명령 오브젝트를 지정할 수 있다. 전자 장치는 이에 대응하여 어플리케이션 마켓으로부터 \"A 은행 어플리케이션\"을 다운로드할 수 있다. 도 29c는 \"A 은행 어플리케이션\"의 다운로드 진행 상 황을 표시하는 전자 장치의 개념도이다. 다운로드가 완료되면, 전자 장치는 다운로드된 어플리케이션을 설치할 수 있다. 본 발명의 다양한 실시예에서, 도 29d 또는 29e에서와 같이, 전자 장치는 어플리케이션을 일반 영역 또는 제 1 샌드 박스에 할당할 수 있다. 한편, 전자 장치는 어플리케이션이 도메인에서 실행하는 어플리케이션인지 여부를 판단할 수 있다. 예를 들어, 전자 장치는 어플리케이션의 메타데이터를 확인함으로써 도메인에서 실행하는 어플리케 이션인지 여부를 판단할 수 있다. 여기에서, 도메인을 제 2 영역으로 명명할 수 있으며, 상술한 제 1 영역과 구별될 수 있다. 즉, 전자 장치는 어플리케이션이 제 2 영역에서 실행하는 어플리케이션인지 여부 를 판단할 수 있다. 도 29d 또는 29e에서와 같이, 어플리케이션이 도메인에서 실행하는 어플리케이션인 것으로 판단되면, 전 자 장치는 제 1 도메인에 어플리케이션을 할당할 수 있다. 전자 장치는 도메인을 생성하거나 또는 기생성된 도메인에 어플리케이션을 할당할 수 있다. 아울러, 전자 장치는 설치된 어플리케이션 실행 아이콘을 메뉴 화면 상에 더 표시할 수 있다. 이후, 실행 아이콘(292 1)이 지정되면, 전자 장치는 “A 은행 어플리케이션”을 도메인, 즉 제 2 영역에서 실행할 수 있다. 예를 들어, 전자 장치는 “A 은행 어플리케이션”으로부터의 입출력 데이터에 도메인 식별자를 부가하는 방식으 로, 제 2 영역에 할당되지 않은 어플리케이션들과 격리시킬 수 있다. 본 발명의 다양한 실시예에서, 전자 장치는 제 1 어플리케이션과 연관된 제 2 어플리케이션을 함께 다운로 드받을 수도 있다. 예를 들어, 도 29f 및 29g에 도시된 바와 같이, 전자 장치는 “A 은행 어플리케이션” 과 연관된 “A 카드 어플리케이션”을 함께 다운로드받을 수 있다. 전자 장치는 다운로드받은 “A 카드어플리케이션”를 일반 영역 또는 제 1 샌드 박스에 할당하고, 제 1 도메인에 할당할 수 있다. 본 발명의 다양한 실시예에서, 제 2 어플리케이션은 제 1 어플리케이션과 동일한 도메인에서 실행하는 것일 수 있다. 이에 따라, 전자 장치는 “A 카드 어플리케이션”을 제 1 도메인에 할당할 수 있다. 아울러, 전자 장치는 할당된 어플리케이션 실행 아이콘을 메뉴 화면 상에 더 표시할 수 있다. 이후, 실행 아이콘이 지정되면, 전자 장치는 “A 카드 어플리케이션”을 도메인, 즉 제 2 영 역에서 실행할 수 있다. 예를 들어, 전자 장치는 “A 카드 어플리케이션”으로부터의 입출력 데이터에 도 메인 식별자를 부가하는 방식으로, 제 2 영역에 할당되지 않은 어플리케이션들과 격리시킬 수 있다. 한편, 전 자 장치는 “A 카드 어플리케이션”으로부터의 입출력 데이터는 “A 은행 어플리케이션”과 공유할 수 있 다. 제 2 어플리케이션은 제 1 어플리케이션과 연관된 어플리케이션으로, 예를 들어 동일한 어플리케이션 개발 자에 의하여 개발된 어플리케이션, 제 1 어플리케이션의 실행 시 요구되는 인증, 암호 등과 관련된 어플리케이 션 등일 수 있으며, 그 종류에는 제한이 없을 수 있다. 제 2 어플리케이션은 제 1 어플리케이션과 동일한 도메 인에서 실행하는 것으로, 예를 들어 동일한 도메인 식별자에 대응하는 어플리케이션일 수 있다. 도 30은 본 발명의 다양한 실시예에 따른 전자 장치의 제어 방법의 흐름도를 도시한다. 도 30을 참조하면, 3010 동작에서 전자 장치는 제 1 어플리케이션을 다운로드받을 수 있다. 하나의 실시 예에서, 전자 장치는 제 1 어플리케이션의 보안 레벨을 수신할 수 있다. 예를 들어, 전자 장치는 어 플리케이션 마켓으로부터 보안 레벨을 포함하는 제 1 어플리케이션 패키지를 수신할 수 있다. 보안 레벨은 제 1 어플리케이션의 메타데이터에 포함될 수도 있다. 또는, 전자 장치는 제 1 어플리케이션과 별개로 보안 레벨을 수신할 수도 있다. 3013 동작에서, 전자 장치는 제 1 어플리케이션의 보안 레벨을 확인할 수 있다. 예를 들어, 전자 장치 는 어플리케이션 패키지 내의 보안 레벨을 확인하거나 또는 메타데이터를 확인하거나 또는 별도로 수신된 보안 레벨을 확인할 수 있다. 3015 동작에서, 전자 장치는 도메인에 할당하는 어플리케이션인지 여부 및/또는 도메인에서 실행되는 어 플리케이션인지의 여부를 판단할 수 있다. 예를 들어, 전자 장치는 확인된 보안 레벨에 근거하여 제 1 어 플리케이션이 도메인에 할당 또는 도메인에서 실행하는 어플리케이션인지 여부를 판단할 수 있다. 본 발명의 다양한 실시예에서, 전자 장치는 보안 레벨과 도메인 사이의 연관 정보를 미리 저장할 수 있다. 예를 들 어, 전자 장치는 표 4와 같은 연관 정보를 미리 저장할 수 있다. 표 4 보안 레벨 도메인 식별자 할당 영역 0 abc 일반 영역 1 def 제 1 샌드 박스 2 ghi 제 2 샌드 박스 보안 영역에 할당하는 어플리케이션으로 판단되면, 3030 동작에서 전자 장치는 보안 레벨에 대응하는 도메 인에 제 1 어플리케이션을 설치 및 할당할 수 있다. 예를 들어, 보안 레벨이 0인 것으로 판단되면 전자 장치 는 일반 영역내의 도메인에 제 1 어플리케이션을 할당하며, 보안 레벨이 1인 것으로 판단되면 전자 장치 는 제 1 샌드 박스내의 도메인에 제 1 어플리케이션을 할당하며, 보안 레벨이 2인 것으로 판단되면 전자 장치는 제 2 샌드 박스내의 도메인에 제 1 어플리케이션을 할당할 수 있다. 도메인에서 실행하는 어플리케이션으로 판단되지 않으면, 3040 동작에서 전자 장치는 일반 영역 또는 샌드 박스에 제 1 어플리케이션을 할당할 수 있다. 이 경우, 전자 장치는 일반 영역 또는 샌드 박스에 제 1 어 플리케이션을 할당하되, 특정 도메인 내에 할당하지는 않을 수 있다. 한편, 상술한 표 2에서는 보안 레벨이 0,1,2 등의 Boolean 값으로 표현되어 있으나, 이는 단순히 예시적인 것으로 보안 레벨의 형식에는 제한이 없음 을 당업자는 용이하게 이해할 수 있을 것이다. 예를 들어, 전자 장치가 제 1 어플리케이션 및 제 2 어플리케이션을 다운로드받은 것을 상정하도록 한다. 이 경우, 전자 장치는 제 1 어플리케이션의 보안 레벨이 1이며, 제 2 어플리케이션의 보안 레벨이 2인 것 을 확인할 수 있다. 전자 장치는, 예를 들어 표 2와 같은 보안 레벨 및 도메인 식별자 사이의 연관 정보 에 근거하여, 제 1 어플리케이션의 할당 영역을 제 1 도메인인 것으로 결정할 수 있다. 전자 장치는, 예를 들 어 표 2와 같은 보안 레벨 및 도메인 식별자 사이의 연관 정보에 근거하여, 제 2 어플리케이션의 할당 영역을제 2 도메인인 것으로 결정할 수 있다. 이 경우, 전자 장치는 도메인 식별자를 도메인 별로 생성할 수도 있으며, 또는 상술한 바와 같이 보안 서 버로 인증 요청을 송신하여, 이에 응답하여 도메인 식별자를 수신할 수도 있다. 도 31은 본 발명의 다양한 실시예에 따른 전자 장치의 제어 방법의 흐름도를 도시한다. 3110 동작에서, 전자 장치는 어플리케이션 마켓으로부터 어플리케이션 및 도메인 식별자를 다운로드 받을 수 있다. 즉, 전자 장치는 추가적인 보안 서버가 아닌 어플리케이션 마켓으로부터 도메 인 식별자를 다운로드받을 수 있다. 3120 동작에서, 전자 장치는 수신한 도메인 식별자를 확인할 수 있다. 3130 동작에서, 전자 장치는 도메인 식별자에 대응하는 도메인에 어플리케이션을 할당할 수 있다. 전자 장치는 도메인 식별자에 대응하는 도메인이 미존재한 경우에는, 도메인을 생성하여 어플리케이션을 할당할 수 있다. 전자 장치는 이미 생성된 도메인에 어플리케이션을 할당할 수도 있다. 즉, 상술한 바와 같이, 본 발명의 다양한 실시예에 따른 전자 장치는 어플리케이션 다운로드 시점에서 도 메인 식별자를 수신할 수 있으며, 수신된 도메인 식별자에 대응하는 도메인에 어플리케이션을 할당할 수 있다. 도 32는 본 발명의 다양한 실시예에 따른 도메인 식별자의 생성 방법의 흐름도를 도시한다. 본 발명의 다양한 실시예에서, 보안 서버 또는 어플리케이션 마켓은 도메인 식별자를 생성할 수 있다. 한편, 다른 실시예에서는, 전자 장치가 도메인 식별자를 생성할 수도 있다. 3210 동작에서, 전자 장치는 도메인 식별자 생성 규칙을 로드할 수 있다. 도메인 식별자는 전체 보안 서 버 또는 전체 시스템에서 유일(unique)하게 관리되어야 하므로, 보안 서버, 어플리케이션 마켓(602 및 전 자 장치 중 적어도 하나는 어플리케이션마다 유일한 도메인 식별자를 생성하기 위한 도메인 식별자 생성 규칙을 이용할 수 있다. 3220 동작에서, 보안 서버, 어플리케이션 마켓 및 전자 장치 중 적어도 하나는 시간 별 요청 순, 특정 랜덤 넘버 생성 방법 등의 다양한 방식에 따라 유일한 도메인 식별자를 생성할 수 있다. 보안 서버 , 어플리케이션 마켓 및 전자 장치 중 적어도 하나는 요청 시점에 도메인 식별자를 생성할 수 도 있으며, 또는 도메인 식별자를 미리 생성하여 저장하였다가 요청 시점에 제공할 수도 있다. 한편, 어플리케 이션 내에 도메인 식별자 생성 정책이 포함된 경우에는, 보안 서버, 어플리케이션 마켓 및 전자 장 치 중 적어도 하나는 도메인 식별자 생성 정책에 따라서 도메인 식별자를 생성할 수도 있다. 3230 동작에서, 보안 서버, 어플리케이션 마켓 및 전자 장치 중 적어도 하나는 동일한 도메인 식별자가 존재하는지 여부를 판단할 수 있다. 예를 들어, 보안 서버, 어플리케이션 마켓 및 전자 장치 중 적어도 하나는 관리하고 있는 도메인 식별자 중에서 생성된 도메인 식별자와 동일한 것이 있는지 를 판단할 수 있다. 동일한 도메인 식별자가 있는 것으로 판단되면, 3240 동작에서 보안 서버, 어플리케이션 마켓 및 전자 장치 중 적어도 하나는 다른 규칙을 로드하여 도메인 식별자를 다시 생성할 수 있다. 동일한 도메인 식별자가 없는 것으로 판단되면, 즉 도메인 식별자가 중복되지 않는 경우에는, 3250 동작에서 보 안 서버, 어플리케이션 마켓 및 전자 장치 중 적어도 하나는 어플리케이션에 도메인 식별자를 연관시켜 저장할 수 있다. 도메인 식별자가 중복되는 경우에는, 3240 동작에서 보안 서버, 어플리케이션 마켓 및 전자 장치 중 적어도 하나는 생성된 도메인 식별자를 제공할 수도 있다. 도 33은 본 발명의 다양한 실시예에 따른 도메인 식별자 생성 방법의 흐름도를 도시한다. 3310 동작에서, 전자 장치는 제 1 어플리케이션 및 암호화된 도메인 식별자를 다운로드받을 수 있다. 예 를 들어, 전자 장치는 어플리케이션 마켓으로부터 제 1 어플리케이션을 다운로드받으면서, 암호화된 도메인 식별자를 수신할 수 있다. 도메인 식별자는, 높은 보안성을 요구할 수 있으며, 이에 따라 다운로드 시 점에서 암호화된 상태로 송신될 수 있다. 또는, 보안 서버는 전자 장치로부터의 인증 요청에 대응 하여, 인증 이후 암호화된 도메인 식별자를 송신할 수도 있다. 3320 동작에서, 전자 장치는 수신된 암호화된 도메인 식별자를 복호화하여 도메인 식별자를 획득할 수 있 다. 전자 장치는 암호/복호 알고리즘을 저장할 수 있으며, 수신된 암호화된 도메인 식별자를 복호화할 수있다. 3330 동작에서, 전자 장치는 제 1 어플리케이션을 설치하면서, 도메인 식별자에 대응하는 도메인에 제 1 어플리케이션을 할당할 수 있다. 도 34는 본 발명의 다양한 실시예에 따른 도메인 내에서의 어플리케이션 실행의 흐름도를 도시한다. 3410 동작에서, 전자 장치는 제 1 도메인 내에서 제 1 어플리케이션을 실행할 수 있다. 상술한 바와 같이, 전자 장치는 제 1 도메인에 제 1 어플리케이션을 설치 및 할당할 수 있으며, 어플리케이션 실행 명 령이 획득되면 제 1 도메인 내에서 제 1 어플리케이션을 실행할 수 있다. 3420 동작에서, 전자 장치는 제 1 어플리케이션의 입출력 데이터에 제 1 도메인 식별자를 부가할 수 있다. 예를 들어, 상술한 바와 같이, 전자 장치는 입출력 데이터의 콘텍스트에 \"_t\"와 같은 접미사를 부가함으로 써, 특정 도메인에 할당된 어플리케이션임을 나타낼 수 있다. 아울러, 전자 장치는 제 1 도메인 식별자가 부가된 입출력 데이터를 제 1 도메인에 할당된 어플리케이션과 공유할 수 있으며, 제 1 도메인외에 할당된 어플 리케이션과는 공유하지 않을 수 있다. 한편, 3420 동작이 3410 동작 이후에 도시된 것은 단순히 예시적인 것으 로, 본 발명의 다양한 실시예에 의한 전자 장치는 제 1 어플리케이션의 입출력 데이터에 제 1 도메인 식별 자를 부가하고, 어플리케이션을 실행할 수도 있다. 상술한 바에 따라서, 전자 장치는 제 1 도메인 내에서 실행되는 제 1 어플리케이션의 데이터 및 리소스를 제 1 도메인 외에 할당되는 어플리케이션과는 공유하지 않으며, 제 1 도메인 내에 할당된 어플리케이션과는 공 유할 수 있다. 도 35는 본 발명의 다양한 실시예에 따른 어플리케이션 삭제 과정의 흐름도를 도시한다. 도 35의 실시예는 도 36a 및 36b를 참조하여 더욱 상세하게 설명하도록 한다. 도 36a 및 36b는 본 발명의 다양한 실시예에 따른 프 로그램 모듈의 블록도이다. 3510 동작에서, 전자 장치는 어플리케이션 삭제 명령을 획득할 수 있다. 예를 들어, 도 16a에 도시된 바 와 같이, 전자 장치는 제 1 도메인에 할당되었던 제 1 어플리케이션을 삭제할 수 있다. 3520 동작에서, 전자 장치는 도메인 데이터베이스를 갱신할 수 있다. 예를 들어, 전자 장치는 하기 표 5와 같은 데이터베이스를 관리할 수 있다. 표 5 도메인 식별자 도메인 명칭 제 1 어플리케이션 제 2 어플리케이션 dTdfTQ3N 0114535 0123847 - TdwEB2E4 0065678 0034728 0048573 d34DGeTd 0127495 0062874 0032929 도메인 식별자는, 전자 장치가 획득한 도메인 식별자일 수 있다. 아울러, 전자 장치는 획득한 도메 인 식별자에 대응하여 도메인 명칭을 생성하여 관리할 수 있다. 전자 장치는 도메인 명칭에 대응하는 도 메인에 할당된 어플리케이션을 관리할 수도 있다. 예를 들어, 전자 장치는 \"0114535\"의 도메인 명칭을 가 지는 제 1 도메인내에 제 1 어플리케이션을 할당함을 관리할 수 있다. 한편, 전자 장치는 제 1 어플리케이션 삭제에 따라 도메인 데이터베이스를 갱신할 수 있으며, 갱신된 도메 인 데이터베이스는 하기 표 6과 같을 수 있다. 표 6 도메인 식별자 도메인 명칭 제 1 어플리케이션제 2 어플리케이션 dTdfTQ3N 0114535 - - TdwEB2E4 0065678 - 0048573 d34DGeTd 0127495 - 0032929 3530 동작에서, 전자 장치는 어플리케이션이 할당되지 않은 도메인을 삭제할 수 있다. 예를 들어, 도 36b 에서와 같이, 도메인 매니저는 제 1 도메인을 삭제할 수 있다.3540 동작에서, 전자 장치는 도메인 데이터베이스를 갱신할 수 있다. 예를 들어, 갱신된 도메인 데이터베 이스는 하기 표 7과 같을 수 있다. 표 7 도메인 식별자 도메인 명칭 제 1 어플리케이션 제 2 어플리케이션 TdwEB2E4 0065678 - 0048573 d34DGeTd 0127495 - 0032929 상기와 같이, \"0114535\"의 도메인 명칭을 가지는 도메인에는 어플리케이션이 할당되지 않을 수 있으며, 전자 장 치는 \"0114535\"의 도메인 명칭을 가지는 도메인을 삭제할 수 있다. 도 37은 본 발명의 다양한 실시예에 따른 전자 장치의 제어 방법의 흐름도를 도시한다. 3710 동작에서, 전자 장치는 적어도 하나의 어플리케이션 프로그램이 동작할 수 있는 제 1 영역, 및 상기 제 1 영역과 동작 환경이 적어도 일부 상이한 제 2 영역을 제공할 수 있다. 예를 들어, 제 2 영역은 도메인일 수 있으며, 제 1 영역은 도메인과 구별되는 도메인 이외의 영역일 수 있다. 3720 동작에서, 전자 장치는 상기 제 1 영역에서, 사용자의 제 1 입력에 적어도 일부 응답하여, 통신 모듈 을 통하여, 외부 서버에 의하여 제공되는 어플리케이션 마켓에 접속할 수 있다. 3730 동작에서, 전자 장치는 상기 제 1 영역에서, 사용자의 제 2 입력에 적어도 일부 응답하여, 상기 어플 리케이션 마켓으로부터 선택된 제 1 어플리케이션을 다운로드할 수 있다. 3740 동작에서, 전자 장치는 상기 다운로드된 제 1 어플리케이션을 상기 전자 장치에 설치할 수 있다. 3750 동작에서, 전자 장치는 사용자의 입력 없이, 상기 다운로드된 제 1 어플리케이션을 상기 제 2 영역에 할당할 수 있다. 본 발명의 다양한 실시예에서, 전자 장치는 제 1 어플리케이션에 대한 인증 요청을 보안 서버로 송신하고, 상기 인증 요청에 응답하여 상기 보안 서버로부터 도메인 식별자를 수신할 수 있다. 본 발명의 다양한 실시예에서, 전자 장치는, 상기 수신된 도메인 식별자에 대응하는 상기 제 2 영역에 상 기 제 1 어플리케이션을 할당할 수 있다. 본 발명의 다양한 실시예에서, 상기 인증 요청은, 인증을 위한 보안 키 및 상기 보안 키에 의하여 암호화된 값 중 적어도 하나를 포함할 수 있다. 본 발명의 다양한 실시예에서, 전자 장치는 상기 제 1 어플리케이션에 연관되는 도메인 식별자를 상기 제 1 어플리케이션과 함께 상기 어플리케이션 마켓으로부터 수신할 수도 있다. 전자 장치는, 상기 수신된 도 메인 식별자에 대응하는 상기 제 2 영역에 상기 제 1 어플리케이션을 할당할 수 있다. 본 발명의 다양한 실시예에서, 전자 장치는 상기 수신된 도메인 식별자에 대응하는 관리용 도메인 식별자 와 상기 관리용 도메인 식별자 사이의 연관 정보를 저장할 수 있다. 본 발명의 다양한 실시예에서, 전자 장치는 상기 수신된 도메인 식별자에 대응하는 도메인이 존재하는지를 판단할 수 있다. 본 발명의 다양한 실시예에서, 전자 장치는 상기 수신된 도메인 식별자에 대응하는 상기 제 2 영역이 존재 하면, 상기 대응하는 상기 제 2 영역에 상기 제 1 어플리케이션을 할당하고, 상기 수신된 도메인 식별자에 대응 하는 도메인이 존재하지 않으면, 상기 수신된 도메인 식별자에 대응하는 상기 제 2 영역을 생성하고, 생성된 상 기 제 2 영역에 상기 제 1 어플리케이션을 할당할 수 있다. 본 발명의 다양한 실시예에서, 전자 장치는 상기 제 2 영역과 연관된, 상기 제 1 어플리케이션에 대한 명 령을 수행할 수 있다. 본 발명의 다양한 실시예에서, 전자 장치는, 상기 제 1 어플리케이션을, 일반 영역 또는 샌드 박스 내에 할당할 수 있다. 본 발명의 다양한 실시예에서, 전자 장치는 상기 제 1 어플리케이션을 삭제하는 경우에, 상기 제 1 어플리 케이션에 대응하는 상기 제 2 영역과 연관되는 어플리케이션이 존재하는지를 판단하여, 상기 판단 결과에 따라 상기 제 2 영역의 유지 여부를 결정할 수 있다.본 발명의 다양한 실시예에서, 전자 장치는, 상기 제 1 어플리케이션이 상기 제 2 영역에 할당되는지 여부 를 지시하는 메타데이터를 확인하고, 상기 확인 결과에 따라서 상기 제 1 어플리케이션을 상기 제 2 영역에 할 당할 수 있다. 본 발명의 다양한 실시예에서, 전자 장치는 상기 제 1 어플리케이션과 연관된 제 2 어플리케이션을 다운로 드받을 수 있다. 본 발명의 다양한 실시예에서, 전자 장치는 상기 제 2 어플리케이션을 상기 제 2 영역에 할당할 수 있다. 도 38은 본 발명의 다양한 실시예에 따른 전자 장치의 블록도이다. 상기 전자 장치는, 예를 들면, 도 1에 도시된 전자 장치의 전체 또는 일부를 포함할 수 있다. 예를 들면, 도 1에 도시된 전자 장치 는 도 17에 도시된 전자 장치의 전체 또는 일부를 포함할 수 있다. 상기 전자 장치는 하나 이 상의 어플리케이션 프로세서(AP: application processor), 통신 모듈, SIM(subscriber identification module) 카드, 메모리, 센서 모듈, 입력 장치, 디스플레이, 인 터페이스, 오디오 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 인디케이터 , 및 모터를 포함할 수 있다. 상기 AP는, 예를 들면, 운영 체제 또는 응용 프로그램을 구동하여 상기 AP에 연결된 다수의 하드웨 어 또는 소프트웨어 구성요소들을 제어할 수 있고, 각종 데이터 처리 및 연산을 수행할 수 있다. 상기 AP(381 0)는, 예를 들면, SoC(system on chip) 로 구현될 수 있다. 한 실시예에 따르면, 상기 AP는 GPU(graphic processing unit) 및/또는 이미지 신호 프로세서(image signal processor)를 더 포함할 수 있다. 상기 AP는 도 1에 도시된 구성요소들 중 적어도 일부(예: 셀룰러 모듈)를 포함할 수도 있다. 상기 AP는 다른 구성요소들(예: 비휘발성 메모리) 중 적어도 하나로부터 수신된 명령 또는 데이터를 휘발성 메 모리에 로드(load)하여 처리하고, 다양한 데이터를 비휘발성 메모리에 저장(store)할 수 있다. 상기 통신 모듈은, 도 1의 상기 통신 모듈과 동일 또는 유사한 구성을 가질 수 있다. 상기 통신 모 듈은, 예를 들면, 셀룰러 모듈, WIFI 모듈, BT 모듈, GPS 모듈, NFC 모듈 및 RF(radio frequency) 모듈를 포함할 수 있다. 상기 셀룰러 모듈은, 예를 들면, 통신망을 통해서 음성 통화, 영상 통화, 문자 서비스, 또는 인터넷 서비 스 등을 제공할 수 있다. 한 실시예에 따르면, 상기 셀룰러 모듈은 가입자 식별 모듈(예: SIM 카드 )을 이용하여 통신 네트워크 내에서 전자 장치의 구별 및 인증을 수행할 수 있다. 한 실시예에 따 르면, 상기 셀룰러 모듈은 상기 AP가 제공할 수 있는 기능 중 적어도 일부 기능을 수행할 수 있다. 한 실시예에 따르면, 상기 셀룰러 모듈은 커뮤니케이션 프로세서(CP: communication processor)를 포함할 수 있다. 상기 WIFI 모듈, 상기 BT 모듈, 상기 GPS 모듈 또는 상기 NFC 모듈 각각은, 예를 들 면, 해당하는 모듈을 통해서 송수신되는 데이터를 처리하기 위한 프로세서를 포함할 수 있다. 어떤 실시예에 따 르면, 셀룰러 모듈, WIFI 모듈, BT 모듈, GPS 모듈 또는 NFC 모듈 중 적어도 일부(예: 두 개 이상)는 하나의 integrated chip(IC) 또는 IC 패키지 내에 포함될 수 있다. 상기 RF 모듈는, 예를 들면, 통신 신호(예: RF 신호)를 송수신할 수 있다. 상기 RF 모듈는, 예를 들면, 트랜시버(transceiver), PAM(power amp module), 주파수 필터(frequency filter), LNA(low noise amplifier), 또는 안테나 등을 포함할 수 있다. 다른 실시예에 따르면, 셀룰러 모듈, WIFI 모듈, BT 모듈, GPS 모듈 또는 NFC 모듈 중 적어도 하나는 별개의 RF 모듈을 통하여 RF 신호를 송 수신할 수 있다. 상기 SIM 카드는, 예를 들면, 가입자 식별 모듈을 포함하는 카드 및/또는 내장 SIM(embedded SIM)을 포함 할 수 있으며, 고유한 식별 정보(예: ICCID(integrated circuit card identifier)) 또는 가입자 정보(예: IMSI(international mobile subscriber identity))를 포함할 수 있다. 상기 메모리(예: 메모리)는, 예를 들면, 내장 메모리 또는 외장 메모리를 포함할 수 있 다. 상기 내장 메모리는, 예를 들면, 휘발성 메모리(예: DRAM(dynamic RAM), SRAM(static RAM), 또는 SDRAM(synchronous dynamic RAM) 등), 비휘발성 메모리(non-volatile Memory)(예: OTPROM(one time programmable ROM), PROM(programmable ROM), EPROM(erasable and programmable ROM), EEPROM(electrically erasable and programmable ROM), mask ROM, flash ROM, 플래시 메모리(예: NAND flash 또는 NOR flash 등),하드 드라이브, 또는 솔리드 스테이트 드라이브(solid state drive(SSD)) 중 적어도 하나를 포함할 수 있다. 상기 외장 메모리는 flash drive, 예를 들면, CF(compact flash), SD(secure digital), Micro-SD(micro secure digital), Mini-SD(mini secure digital), xD(extreme digital), 또는 메모리 스틱(memory stick) 등 을 더 포함할 수 있다. 상기 외장 메모리는 다양한 인터페이스를 통하여 상기 전자 장치와 기능적 으로 및/또는 물리적으로 연결될 수 있다. 상기 센서 모듈은, 예를 들면, 물리량을 계측하거나 전자 장치의 작동 상태를 감지하여, 계측 또는 감지된 정보를 전기 신호로 변환할 수 있다. 상기 센서 모듈은, 예를 들면, 제스처 센서(3840A), 자이로 센서(3840B), 기압 센서(3840C), 마그네틱 센서(3840D), 가속도 센서(3840E), 그립 센서(3840F), 근접 센서 (3840G), color 센서(3840H)(예: RGB(red, green, blue) 센서), 생체 센서(3840I), 온/습도 센서(3840J), 조도 센서(3840K), 또는 UV(ultra violet) 센서(3840M) 중의 적어도 하나를 포함할 수 있다. 추가적으로 또는 대체적 으로, 상기 센서 모듈은, 예를 들면, 후각 센서(E-nose sensor), EMG 센서(electromyography sensor), EEG 센서(electroencephalogram sensor), ECG 센서(electrocardiogram sensor), IR(infrared) 센서, 홍채 센 서 및/또는 지문 센서를 포함할 수 있다. 상기 센서 모듈은 그 안에 속한 적어도 하나 이상의 센서들을 제어하기 위한 제어 회로를 더 포함할 수 있다. 어떤 실시예에서는, 전자 장치는 AP의 일부로서 또 는 별도로, 센서 모듈을 제어하도록 구성된 프로세서를 더 포함하여, 상기 AP가 슬립(sleep) 상태 에 있는 동안, 센서 모듈을 제어할 수 있다. 상기 입력 장치은, 예를 들면, 터치 패널(touch panel), (디지털) 펜 센서(pen sensor), 키 (key), 또는 초음파(ultrasonic) 입력 장치를 포함할 수 있다. 상기 터치 패널은, 예를 들 면, 정전식, 감압식, 적외선 방식, 또는 초음파 방식 중 적어도 하나의 방식을 사용할 수 있다. 또한, 상기 터 치 패널은 제어 회로를 더 포함할 수도 있다. 상기 터치 패널은 택타일 레이어(tactile layer)를 더 포함하여, 사용자에게 촉각 반응을 제공할 수 있다. 상기(디지털) 펜 센서는, 예를 들면, 터치 패널의 일부이거나, 별도의 인식용 쉬트(sheet)를 포함할 수 있다. 상기 키는, 예를 들면, 물리적인 버튼, 광학식 키, 또는 키패드를 포함할 수 있다. 상기 초음파 입 력 장치는 초음파 신호를 발생하는 입력 도구를 통해, 전자 장치에서 마이크(예: 마이크)로 음파를 감지하여 데이터를 확인할 수 있다. 상기 디스플레이(예: 디스플레이)은 패널, 홀로그램 장치, 또는 프로젝터을 포함 할 수 있다. 상기 패널은, 도 1의 디스플레이과 동일 또는 유사한 구성을 포함할 수 있다. 상기 패 널은, 예를 들면, 유연하게(flexible), 투명하게(transparent), 또는 착용할 수 있게(wearable) 구현될 수 있다. 상기 패널은 상기 터치 패널과 하나의 모듈로 구성될 수도 있다. 상기 홀로그램 장치 은 빛의 간섭을 이용하여 입체 영상을 허공에 보여줄 수 있다. 상기 프로젝터는 스크린에 빛을 투 사하여 영상을 표시할 수 있다. 상기 스크린은, 예를 들면, 상기 전자 장치의 내부 또는 외부에 위치할 수 있다. 한 실시예에 따르면, 상기 디스플레이은 상기 패널, 상기 홀로그램 장치, 또는 프 로젝터를 제어하기 위한 제어 회로를 더 포함할 수 있다. 상기 인터페이스는, 예를 들면, HDMI(high-definition multimedia interface), USB(universal serial bus), 광 인터페이스(optical interface), 또는 D-sub(D-subminiature)를 포함할 수 있다. 상기 인터페이스는, 예를 들면, 도 1에 도시된 통신 인터페이스에 포함될 수 있다. 추가적으 로 또는 대체적으로, 상기 인터페이스는, 예를 들면, MHL(mobile high-definition link) 인터페이스, SD(secure digital) 카드/MMC(multi-media card) 인터페이스, 또는 IrDA(infrared data association) 규격 인 터페이스를 포함할 수 있다. 상기 오디오 모듈은, 예를 들면, 소리(sound)와 전기 신호를 쌍방향으로 변환시킬 수 있다. 상기 오디오 모듈의 적어도 일부 구성요소는, 예를 들면, 도 1 에 도시된 입출력 인터페이스에 포함될 수 있다. 상기 오디오 모듈은, 예를 들면, 스피커, 리시버, 이어폰, 또는 마이크 등을 통해 입력 또는 출력되는 소리 정보를 처리할 수 있다. 상기 카메라 모듈은, 예를 들면, 정지 영상 및 동영상을 촬영할 수 있는 장치로서, 한 실시예에 따르면, 하나 이상의 이미지 센서(예: 전면 센서 또는 후면 센서), 렌즈, ISP(image signal processor), 또는 플래쉬 (flash)(예: LED 또는 xenon lamp)를 포함할 수 있다. 상기 전력 관리 모듈은, 예를 들면, 상기 전자 장치의 전력을 관리할 수 있다. 한 실시예에 따르면, 상기 전력 관리 모듈은 PMIC(power management integrated circuit), 충전 IC(charger integrated circuit), 또는 배터리 또는 연료 게이지(battery or fuel gauge)를 포함할 수 있다. 상기 PMIC는, 유선 및/또는 무선 충전 방식을 가질 수 있다. 무선 충전 방식은, 예를 들면, 자기공명 방식, 자기유도 방식 또는 전자기파 방식 등을 포함하며, 무선 충전을 위한 부가적인 회로, 예를 들면, 코일 루프, 공진 회로, 또는 정류기 등을 더 포함할 수 있다. 상기 배터리 게이지는, 예를 들면, 상기 배터리의 잔량, 충전 중 전압, 전류, 또는 온도를 측정할 수 있다. 상기 배터리는, 예를 들면, 충전식 전지(rechargeable battery) 및/ 또는 태양 전지(solar battery)를 포함할 수 있다. 상기 인디케이터는 상기 전자 장치 혹은 그 일부(예: AP)의 특정 상태, 예를 들면, 부팅 상 태, 메시지 상태 또는 충전 상태 등을 표시할 수 있다. 상기 모터는 전기적 신호를 기계적 진동으로 변환 할 수 있고, 진동(vibration), 또는 햅틱(haptic) 효과 등을 발생시킬 수 있다. 도시되지는 않았으나, 상기 전 자 장치는 모바일 TV 지원을 위한 처리 장치(예: GPU)를 포함할 수 있다. 상기 모바일 TV 지원을 위한 처 리 장치는, 예를 들면, DMB(digital multimedia broadcasting), DVB(digital video broadcasting), 또는 미디 어 플로우(media flow) 등의 규격에 따른 미디어 데이터를 처리할 수 있다. 상기 전자 장치의 전술한 구성요소들 각각은 하나 또는 그 이상의 부품(component)으로 구성될 수 있으며, 해당 구성 요소의 명칭은 전자 장치의 종류에 따라서 달라질 수 있다. 다양한 실시예에서, 전자 장치는 전술한 구성 요소 중 적어도 하나를 포함하여 구성될 수 있으며, 일부 구성요소가 생략되거나 또는 추가적인 다른 구성요소 를 더 포함할 수 있다. 또한, 다양한 실시예에 따른 전자 장치의 구성 요소들 중 일부가 결합되어 하나의 개체 (entity)로 구성됨으로써, 결합되기 이전의 해당 구성 요소들의 기능을 동일하게 수행할 수 있다. 본 문서에서 사용된 용어 “모듈”은, 예를 들면, 하드웨어, 소프트웨어 또는 펌웨어(firmware) 중 하나 또는 둘 이상의 조합을 포함하는 단위(unit)를 의미할 수 있다. “모듈”은, 예를 들면, 유닛(unit), 로직(logic), 논리 블록(logical block), 부품(component), 또는 회로(circuit) 등의 용어와 바꾸어 사용(interchangeably use)될 수 있다. “모듈”은, 일체로 구성된 부품의 최소 단위 또는 그 일부가 될 수 있다. “모듈”은 하나 또 는 그 이상의 기능을 수행하는 최소 단위 또는 그 일부가 될 수도 있다. “모듈”은 기계적으로 또는 전자적으 로 구현될 수 있다. 예를 들면,“모듈”은, 알려졌거나 앞으로 개발될, 어떤 동작들을 수행하는 ASIC(application-specific integrated circuit) 칩, FPGAs(field-programmable gate arrays) 또는 프로그램 가능 논리 장치(programmable-logic device) 중 적어도 하나를 포함할 수 있다. 다양한 실시예에 따른 장치(예: 모듈들 또는 그 기능들) 또는 방법(예: 동작들)의 적어도 일부는, 예컨대, 프로 그램 모듈의 형태로 컴퓨터로 읽을 수 있는 저장매체(computer-readable storage media)에 저장된 명령어로 구 현될 수 있다. 상기 명령어는, 프로세서(예: 프로세서)에 의해 실행될 경우, 상기 하나 이상의 프로세서가 상기 명령어에 해당하는 기능을 수행할 수 있다. 컴퓨터로 읽을 수 있는 저장매체는, 예를 들면, 상기 메모리 가 될 수 있다. 상기 컴퓨터로 판독 가능한 기록 매체는, 하드디스크, 플로피디스크, 마그네틱 매체(magnetic media)(예: 자기 테이프), 광기록 매체(optical media)(예: CD-ROM(compact disc read only memory), DVD(digital versatile disc), 자기-광 매체(magneto-optical media)(예: 플롭티컬 디스크(floptical disk)), 하드웨어 장치(예: ROM(read only memory), RAM(random access memory), 또는 플래시 메모리 등) 등을 포함할 수 있다. 또한, 프 로그램 명령에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴 퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함할 수 있다. 상술한 하드웨어 장치는 다양한 실시예의 동 작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지다. 다양한 실시예에 따른 모듈 또는 프로그램 모듈은 전술한 구성요소들 중 적어도 하나 이상을 포함하거나, 일부 가 생략되거나, 또는 추가적인 다른 구성요소를 더 포함할 수 있다. 다양한 실시예에 따른 모듈, 프로그램 모듈 또는 다른 구성요소에 의해 수행되는 동작들은 순차적, 병렬적, 반복적 또는 휴리스틱(heuristic)한 방법으로 실행될 수 있다. 또한, 일부 동작은 다른 순서로 실행되거나, 생략되거나, 또는 다른 동작이 추가될 수 있다. 본 발명의 다양한 실시예에 따르면, 명령들을 저장하고 있는 저장 매체에 있어서, 상기 명령들은 적어도 하나의 프로세서에 의하여 실행될 때에 상기 적어도 하나의 프로세서로 하여금 적어도 하나의 동작을 수행하도록 설정 된 것으로서, 상기 적어도 하나의 동작은, 적어도 하나의 어플리케이션 프로그램이 동작할 수 있는 제 1 영역, 및 상기 제 1 영역과 동작 환경이 적어도 일부 상이한 제 2 영역을 제공하는 동작, 상기 제 1 영역에서, 사용자 의 제 1 입력에 적어도 일부 응답하여, 상기 통신 모듈을 통하여, 외부 서버에 의하여 제공되는 어플리케이션 마켓에 접속하는 동작, 상기 제 1 영역에서, 사용자의 제 2 입력에 적어도 일부 응답하여, 상기 어플리케이션마켓으로부터 선택된 제 1 어플리케이션을 다운로드하는 동작, 상기 다운로드된 제 1 어플리케이션을 상기 전자 장치에 설치하는 동작, 사용자의 입력 없이, 상기 다운로드된 제 1 어플리케이션을 상기 제 2 영역에 할당하는 동작을 포함할 수 있다. 그리고 본 문서에 개시된 실시예는 개시된, 기술 내용의 설명 및 이해를 위해 제시된 것이며, 본 개시의 범위를 한정하는 것은 아니다. 따라서, 본 개시의 범위는, 본 개시의 기술적 사상에 근거한 모든 변경 또는 다양한 다 른 실시예를 포함하는 것으로 해석되어야 한다."}
{"patent_id": "10-2015-0023689", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 다양한 실시예에 따른 전자 장치를 포함하는 네트워크 환경을 도시한다. 도 2는 본 발명의 다양한 실시예에 따른 프로그램 모듈의 블록도이다. 도 3a 및 3b는 본 발명의 다양한 실시예에 따른 프로그램 모듈의 블록도이다. 도 4a 내지 4c는 본 발명의 다양한 실시예에 따른 어플리케이션 설치 방법의 흐름도를 도시한다.도 5a 및 5b는 본 발명의 다양한 실시예에 따른 프로그램 모듈의 블록도이다. 도 6a는 본 발명의 다양한 실시예에 따른 어플리케이션 설치 방법의 흐름도를 도시한다. 도 6b는 본 발명의 다양한 실시예에 따른 어플리케이션 업로드 과정의 흐름도를 도시한다. 도 7은 본 발명의 다양한 실시예에 따른 전자 장치의 제어 방법의 흐름도를 도시한다. 도 8a 및 8b는 본 발명의 다양한 실시예에 따른 프로그램 모듈의 블록도이다. 도 9a 내지 9h는 본 발명의 다양한 실시예 및 비교예에 따른 전자 장치의 화면을 설명하기 위한 개념도들을 도 시한다. 도 10은 본 발명의 다양한 실시예에 따른 전자 장치의 제어 방법의 흐름도를 도시한다. 도 11은 본 발명의 다양한 실시예에 따른 프로그램 모듈의 블록도이다. 도 12는 본 발명의 다양한 실시예에 따른 어플리케이션의 실행을 설명하기 위한 개념도를 도시한다. 도 13은 본 발명의 다양한 실시예에 따른 어플리케이션 실행 방법의 흐름도를 도시한다. 도 14는 어플리케이션 실행 과정을 설명하는 개념도이다. 도 15는 본 발명의 다양한 실시예에 따른 어플리케이션 실행 방법의 흐름도를 도시한다. 도 16은 본 발명의 다양한 실시예에 따른 강제 모드를 설명하기 위한 흐름도를 도시한다. 도 17은 본 발명의 다양한 실시예에 따른 프로그램 모듈의 블록도이다. 도 18은 본 발명의 다양한 실시예에 따른 어플리케이션의 샌드 박스내 설치된지 여부를 판단하는 방법의 흐름도 를 도시한다. 도 19는 본 발명의 다양한 실시예에 따른 어플리케이션 실행 방법의 흐름도를 도시한다. 도 20은 본 발명의 다양한 실시예에 따른 전자 장치의 화면을 설명하기 위한 개념도를 도시한다. 도 21a 및 21b는 본 발명의 다양한 실시예에 따른 전자 장치의 제어 방법의 흐름도를 도시한다. 도 22는 본 발명의 다양한 실시예에 따른 전자 장치의 제어 방법의 흐름도를 도시한다. 도 23은 본 발명의 다양한 실시예에 따른 전자 장치에서 설정되는 도메인의 개념을 설명하기 위한 블록도이다. 도 24a는 본 발명의 다양한 실시예에 따른 어플리케이션 설치 방법의 흐름도를 도시한다. 도 24b는 본 발명의 다양한 실시예에 따른 어플리케이션 설치 방법의 흐름도를 도시한다. 도 25a 및 25b는 본 발명의 다양한 실시예에 따른 프로그램 모듈의 블록도이다. 도 26은 본 발명의 다양한 실시예에 따른 어플리케이션 설치 방법의 흐름도를 도시한다. 도 27은 본 발명의 다양한 실시예에 따른 전자 장치의 제어 방법의 흐름도를 도시한다. 도 28a 및 28b는 본 발명의 다양한 실시예에 따른 프로그램 모듈의 블록도이다. 도 29a 내지 29g는 본 발명의 다양한 실시예에 따른 전자 장치의 화면을 설명하기 위한 개념도들을 도시한다. 도 30은 본 발명의 다양한 실시예에 따른 전자 장치의 제어 방법의 흐름도를 도시한다. 도 31은 본 발명의 다양한 실시예에 따른 전자 장치의 제어 방법의 흐름도를 도시한다. 도 32는 본 발명의 다양한 실시예에 따른 도메인 식별자의 생성 방법의 흐름도를 도시한다. 도 33은 본 발명의 다양한 실시예에 따른 도메인 식별자 생성 방법의 흐름도를 도시한다. 도 34는 본 발명의 다양한 실시예에 따른 도메인 내에서의 어플리케이션 실행의 흐름도를 도시한다. 도 35는 본 발명의 다양한 실시예에 따른 어플리케이션 삭제 과정의 흐름도를 도시한다. 도 36a 및 36b는 본 발명의 다양한 실시예에 따른 프로그램 모듈의 블록도이다.도 37은 본 발명의 다양한 실시예에 따른 전자 장치의 제어 방법의 흐름도를 도시한다. 도 38은 본 발명의 다양한 실시예에 따른 전자 장치의 블록도이다."}
