{"patent_id": "10-2020-0023303", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0108565", "출원번호": "10-2020-0023303", "발명의 명칭": "가상 콘텐츠 생성 방법", "출원인": "최갑천", "발명자": "최갑천"}}
{"patent_id": "10-2020-0023303", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "제1 단계에서 서버는 모델의 문자, SMS, 음성이 녹음된 MP3 파일, 사진, 동영상 중 적어도 하나를 포함하는 모델 콘텐츠를 입력받고,제2 단계에서 상기 서버는 상기 모델 콘텐츠로부터 문자 특징, 음성 특징, 이미지 특징, 동영상 특징 중 적어도하나를 포함하는 모델 특징을 추출하며,사용자가 상기 모델과 의사 소통을 원하는 제3 단계 이후에서, 상기 서버는 딥 러닝 또는 인공 지능으로 동작되고, 상기 사용자는 사용자 콘텐츠를 상기 서버에 입력하며, 상기 서버는 상기 사용자 콘텐츠로부터 상기 사용자의 심리 상태를 측정한 사용자 상태를 판단하며, 상기 서버는 상기 모델 특징 또는 상기 사용자 상태를 이용하여 상기 모델 콘텐츠를 가상 콘텐츠로 변형하는 가상 콘텐츠 생성 방법."}
{"patent_id": "10-2020-0023303", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 사용자 콘텐츠와 상기 가상 콘텐츠가 대화형으로 상호 교감되고,상기 서버는 상기 교감 결과를 입력받아 상기 모델 콘텐츠, 모델 특징, 사용자 상태 중 적어도 하나를 업데이트하며, 상기 가상 콘텐츠를 또 다른 가상 콘텐츠로 재변형하여 상기 단말기에 출력하는 가상 콘텐츠 재생 방법."}
{"patent_id": "10-2020-0023303", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 문자는 글, 문자, 문서나 저장 매체를 통하여 보여줄 수 있는 기록 중 적어도 하나를 포함하고, 상기 음성은 목소리, 노래, 흥얼거림, 귀로 들을 수 있는 모든 소리 중 적어도 하나를 포함하며,상기 이미지는 형상, 얼굴, 신체, 움직임 중 적어도 하나를 포함하고,상기 서버에 마련된 인공 지능은 상기 모델 데이터로부터 상기 문자, 음성, 이미지 중 적어도 하나에 관한 상기모델 특징을 추출하고 상기 사용자 상태에 따라 상기 가상 콘텐츠를 재조합하는 가상 콘텐츠 생성 방법."}
{"patent_id": "10-2020-0023303", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 서버는,상기 모델 콘텐츠가 문자일 때 상기 모델 특징을 인식하는 문자 인식 모델은, 인쇄되거나 손으로 쓴 문자를 자동으로 판독하거나 식별하여 상기 서버가 이해할 수 있는 코드로 전환하고,상기 모델 콘텐츠가 이미지 또는 동영상일 때, 상기 모델의 얼굴, 신체, 형상 중 적어도 하나의 이미지 또는 동영상을 상기 인공 지능을 이용해 상기 가상 콘텐츠로서 재합성하는 가상 콘텐츠 생성 방법."}
{"patent_id": "10-2020-0023303", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 서버는 상기 모델 콘텐츠 또는 모델 특징을 그룹별로 구분하고, 공개특허 10-2021-0108565-3-상기 모델 콘텐츠를 제1 그룹 모델 콘텐츠 내지 제N 그룹 모델 콘텐츠로 분류하거나(여기서, 상기 N은 자연수),상기 모델 특징을 제1 그룹 모델 특징 내지 제N 그룹 모델 특징으로 분류하며,상기 서버는 각 그룹별로 상기 모델 콘텐츠 또는 모델 특징을 분류하기 위하여 모델 신상 정보 또는 사용자 신상 정보를 참조하는 가상 콘텐츠 생성 방법."}
{"patent_id": "10-2020-0023303", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 서버는 상기 모델 콘텐츠 또는 모델 특징이 특정 모델의 것이 맞는지 여부를 판단하기 위하여 모델 매칭도를 계산하고, 상기 모델 매칭도가 기준값 이상이면 상기 모델 콘텐츠 또는 모델 특징이 정확한 정보임을 확인하는 가상 콘텐츠 생성 방법."}
{"patent_id": "10-2020-0023303", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 서버는 상기 모델 콘텐츠 또는 모델 특징의 그룹 분류시, 분류 정확성을 판단하기 위하여 그룹 매칭도를계산하고, 상기 그룹 매칭도가 기준값 이상이면 상기 모델 콘텐츠 또는 모델 특징이 모델 신상 정보에 부합되는정확한 정보임을 확인하는 가상 콘텐츠 생성 방법."}
{"patent_id": "10-2020-0023303", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 사용자 콘텐츠의 입력 전에, 상기 서버는 상기 모델 콘텐츠 또는 모델 신상 정보를 입력받고, 상기 모델콘텐츠 또는 상기 모델 특징의 그룹을 분류하여 기억부에 저장하며,상기 서버는 상기 사용자 콘텐츠가 입력되면 상기 기억부에 저장된 상기 모델 특징을 활용하여 상기 사용자 상태에 매칭되는 상기 모델 특징을 추출하고, 상기 추출된 모델 특징을 토대로 상기 가상 콘텐츠를 대화형으로 생성하는 가상 콘텐츠 생성 방법."}
{"patent_id": "10-2020-0023303", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명에 따르면, 제1 단계에서 서버는 모델의 문자, SMS, 음성이 녹음된 MP3 파일, 사진, 동영상 중 적어도 하 나를 포함하는 모델 콘텐츠를 입력받고, 제2 단계에서 상기 서버는 상기 모델 콘텐츠로부터 문자 특징, 음성 특 징, 이미지 특징, 동영상 특징 중 적어도 하나를 포함하는 모델 특징을 추출하며, 사용자가 상기 모델과 의사 소 통을 원하는 제3 단계 이후에서, 상기 서버는 딥 러닝 또는 인공 지능으로 동작되고, 상기 사용자는 사용자 콘텐 츠를 상기 서버에 입력하며, 상기 서버는 상기 사용자 콘텐츠로부터 상기 사용자의 심리 상태를 측정한 사용자 상태를 판단하며, 상기 서버는 상기 모델 특징 또는 상기 사용자 상태를 이용하여 상기 모델 콘텐츠를 가상 콘텐 츠로 변형할 수 있다."}
{"patent_id": "10-2020-0023303", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 모델의 백데이터 및 인공 지능을 기초로 모델의 가상 콘텐츠를 생성하는 방법에 관한 것이다."}
{"patent_id": "10-2020-0023303", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "사용자는 자신이 선호하는 모델과 실시간으로 상담을 받거나 모델과 상호 교감을 하고 싶어한다. 종래에는 모델 이 가까이 접근할 수 없는 상황일 때, 모델의 콘텐츠를 사용자의 환경에 맞춤식으로 제공할 수 있는 방법이 없 었다."}
{"patent_id": "10-2020-0023303", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 사용자가 억세스하기 힘든 모델의 문자, 음성, 동영상 중 적어도 하나를 사용자 환경에 맞게 재생성 하는 방법에 관한 것이다."}
{"patent_id": "10-2020-0023303", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 따르면, 제1 단계에서 서버는 모델의 문자, SMS, 음성이 녹음된 MP3 파일, 사진, 동영상 중 적어도 하나를 포함하는 모델 콘텐츠를 입력받고, 제2 단계에서 상기 서버는 상기 모델 콘텐츠로부터 문자 특징, 음성 특징, 이미지 특징, 동영상 특징 중 적어도 하나를 포함하는 모델 특징을 추출하며, 사용자가 상기 모델과 의사 소통을 원하는 제3 단계 이후에서, 상기 서버는 딥 러닝 또는 인공 지능으로 동작되고, 상기 사용자는 사용자 콘텐츠를 상기 서버에 입력하며, 상기 서버는 상기 사용자 콘텐츠로부터 상기 사용자의 심리 상태를 측정한 사 용자 상태를 판단하며, 상기 서버는 상기 모델 특징 또는 상기 사용자 상태를 이용하여 상기 모델 콘텐츠를 가 상 콘텐츠로 변형할 수 있다."}
{"patent_id": "10-2020-0023303", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "사용자가 특정한 상황에 처했을 때, 슬플 때, 기쁠 때, 고민이 많을 때, 선택의 순간 중 적어도 하나에 있어서, 사용자는 모델로부터 도움이나 조언을 얻을 수 있다. 사용자는 모델이 세상을 떠나거나, 연락을 할 수 없거나, 원격지에 있을 경우 상호 교감이 어려울 때, 모델이 접근 가능한 시점에서의 영상과 음성을 저장한 모델의 원본 데이터를 사용자가 원할 때 그대로 재생 또는 다른 콘텐츠로 재조합할 수 있다. 따라서, 의사 교환 방식이 일방적인 문제점, 모델의 일방적 의사 표현인 문제점, 모노 드라마인 문제점, 사용자 와 모델이 대화를 할 수 없는 문제점, 사용자가 모델로부터 조언을 구할 수 없는 문제점을 해결할 수 있다."}
{"patent_id": "10-2020-0023303", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "사용자는 자신이 선호하는 사람과의 소중한 추억을 그리워할 수 있다. 사용자는 추모하는 사람과 원하는 시점에 서 접속할 수 있기를 원할 수 있다. 사용자는 자신에게 영향을 끼친 사람이나 흠모하는 사람으로서 고인, 부모님, 가족, 연인 등을 떠올릴 때가 많 다. 사람들은 따뜻하고 편안한 부모님이나 배우자에 대한 좋은 기억을 가지고 있다. 이하에서 '모델(model)'은 소울 모델(soul model), 추모하고자 하는 고인, 생존 중인 롤 모델, 멘토, 돌아가신 부모님, 생존 중인 부모님, 배우자, 가족, 연인, 친구, 애완 동물 중 적어도 하나일 수 있다. 사용자가 특정한 상황에 처했을 때, 슬플 때, 기쁠 때, 고민이 많을 때, 선택의 순간 중 적어도 하나에 있어서, 사용자는 모델로부터 도움이나 조언을 얻고 싶어하며 따뜻한 말 한마디를 기대할 수 있다. 그러나, 모델이 세상 을 떠나거나, 연락을 할 수 없거나, 원격지에 있을 경우 상호 교감이 어려울 수 있다. 비교 실시예로서, 모델의 생존시의 영상과 음성을 저장한 콘텐츠 데이터를 사용자가 원할 때 그대로 재생할 수 있다. 그러나, 의사 교환 방식이 일방적인 문제점, 모델의 일방적 의사 표현인 문제점, 모노 드라마인 문제점, 사용자와 모델이 대화를 할 수 없는 문제점, 사용자가 모델로부터 조언을 구할 수 없는 문제점이 있을 수 있다. 본 발명의 서버는 딥러닝 기술 또는 인공 지능을 이용할 수 있다. 제1 단계에서, 서버는 모델 콘텐츠 또는 모델 신상 정보를 입력받을 수 있다. 모델 콘텐츠는 모델의 문서, SMS, 음성, 사진, 동영상 중 적어도 하나를 포함할 수 있다. 모델 신상 정보는 모델 콘텐츠를 제외한 것으로서, 예를 들어 모델의 이름, 국적, 성별 구분, 나이, 직업, 인종, 주소, 좋아하는 음식, 좋아하는 색상 중 적어도 하나를 포함하는 모델의 모든 신상 정보를 의미할 수 있다. 제2 단계에서, 서버는 모델 콘텐츠로부터 문자 특징, SMS 특징, 음성 특징, 이미지 특징, 동영상 특징 중 적어 도 하나를 포함하는 모델 특징을 추출할 수 있다. 만약, 모델 콘텐츠에 한 종류의 모델 특징만 존재하는 경우, 하나의 모델 콘텐츠에 대하여 하나의 모델 특징이 추출될 수 있다. 예를 들어 어떤 모델의 전화 음성을 녹음한 모델 콘텐츠로부터 그 모델의 목소리를 모델 특징 으로 추출하는 경우이다. 이때 서버는 기쁠 때의 목소리와 슬플 때의 목소리를 구분하지 않고 단순히 목소리 그 자체를 하나의 모델 특징으로 추출할 수 있다. 한편, 모델 콘텐츠에 여러 종류의 모델 특징이 존재하는 경우, 하나의 모델 콘텐츠에 대하여 복수의 모델 특징 이 추출될 수 있다. 예를 들어, 어떤 모델의 사진으로부터 그 모델의 표정을 추출하는 경우, 서버는 어느 하나 의 사진이 기쁠 때의 사진으로 판단되면 기쁠 때의 표정을 추출하며, 그 사진이 슬플 때의 사진으로 판단되면 슬플 때의 표정을 추출할 수 있다. 모델 특징이 여러 개 추출되는 경우에 이를 그룹별로 분류하는 것이 필요할 수 있다. 서버는 기쁠 때의 표정과 슬플 때의 표정을 구분하고 각 표정을 그룹별 모델 특징으로 추출할 수 있다. 서버는 모델 콘텐츠를 그룹별로 구분하며, 모델 콘텐츠를 제1 그룹 모델 콘텐츠 내지 제N 그룹 모델 콘텐츠로 분류할 수 있다. 여기서, N은 자연수이며, 한 개의 모델 콘텐츠가 될 수 있고, 2 이상의 모델 콘텐츠일 수 있다. 서버는 모델 특징을 그룹별로 구분하며, 모델 특징을 제1 그룹 모델 특징 내지 제N 그룹 모델 특징으로 분류할 수 있다. 제1 그룹 모델 콘텐츠 ~ 제N 그룹 모델 콘텐츠 또는 제1 그룹 모델 특징 ~ 제N 그룹 모델 특징을 구분하는 기준 이 되는 그룹은, 모델의 감정(예를 들어 특정 모델의 기쁠 때 사진과 슬플 때 사진) 또는 모델의 나이(예를 들 어 특정 모델의 젊은 시절의 사진과 늙은 시절의 사진) 중 적어도 하나를 포함할 수 있다. 서버는 모델이 심리적으로 기쁜 상태를 제1 그룹, 슬픈 상태를 제2 그룹으로 정의할 수 있다. 서버는 모델의 젊은 시절 콘텐츠(사진)이면 제1 그룹 모델 콘텐츠, 늙은 시절 콘텐츠(사진)이면 제2 그룹 모델 콘텐츠로 그룹 을 분류할 수 있다. 서버는 다양한 모델 콘텐츠를 분석하고 젋은 시절의 제1 그룹에 해당하는 제1 그룹 모델 콘텐츠와 늙은 시절의 제2 그룹에 해당하는 제2 그룹 모델 콘텐츠로 구분할 수 있다. 서버는 각 그룹별로 모델 콘텐츠를 분류하기 위하여 모델 신상 정보(예를 들어 모델의 나이, 성별 구분, 사용자 와의 상호 관계)를 참조할 수 있다. 모델 특징이 제1 그룹 모델 콘텐츠로부터 추출된 것이면 제1 그룹 모델 특징이 될 수 있다. 제2 그룹 모델 콘텐 츠로부터 모델 특징을 추출하면 제2 모델 특징이 될 수 있다. 서버는 각 그룹별로 모델 특징을 추출하기 위하여 모델 신상 정보(예를 들어 모델의 나이, 성별 구분, 사용자와의 상호 관계)을 참조할 수 있다. 다음은 모델 매칭도와 그룹 매칭도를 설명한다. 서버는 모델 콘텐츠 또는 모델 특징이 특정 모델의 것이 맞는지 여부를 판단하기 위하여 모델 매칭도를 계산할 수 있다. 서버는 모델 콘텐츠 또는 모델 특징의 그룹 분류시, 분류 정확성을 판단하기 위하여 그룹 매칭도를 계산할 수 있다. 예를 들어, 모델 콘텐츠가 모델을 포함하여 여러 명이 웃으면서 찍힌 사진일 때, 모델 신상 정보가 연령 30대라 면 30대 연령에 맞는 부분만 추출한 후 해당 모델(30대 연령)의 제1 그룹 모델 특징(웃는 모습)으로 분류할 수 있다. 30대 모델에 대응되는 30대의 모델 특징을 추출하기 위하여 모델 신상 정보인 연령 30대 여부를 이용하여 모델 매칭도를 계산할 수 있다. 서버는 모델 콘텐츠를 추출한 후 모델 신상 정보를 참조하여 그 모델 콘텐츠가 해당 모델의 것이 맞는지 모델 매칭도를 계산할 수 있다. 모델 매칭도가 기준값 이상이면 모델 콘텐츠 또는 모 델 특징이 잘 추출된 것으로 판단할 수 있다. 또한, 웃는 모습인지 판단하여 제1 그룹 모델 콘텐츠가 맞는지 그룹 매칭도를 계산할 수 있다. 그룹 매칭도가 기준값 이상이면 그룹 분류가 잘 된 것으로 판단할 수 있다.서버는 모델 콘텐츠를 그룹별로 분류하고, 분류시 모델 신상 정보를 참조할 수 있으며, 분류된 모델 콘텐츠가 해당 그룹에 속하는지 그룹 매칭도를 계산할 수 있다. 서버는 모델 콘텐츠로부터 제1 그룹 모델 콘텐츠 및 제2 그룹 모델 콘텐츠를 분류할 수 있고, 분류 기준은 모델 신상 정보에 의할 수 있으며, 제1 그룹 모델 콘텐츠가 제1 그룹이 맞는지 그룹 매칭도를 계산할 수 있다. 서버는 모델 매칭도 또는 그룹 매칭도가 기준값 이상이면 모 델 콘텐츠 또는 모델 특징을 모델 신상 정보에 부합되는 정확한 정보임을 확인할 수 있다. 서버는 분류된 모델 콘텐츠로부터 모델 특징을 추출시 모델 특징을 그룹별로 분류할 수 있다. 서버는 각 그룹별 로 모델 특징을 분류하기 위하여 모델 신상 정보를 참조할 수 있다. 예를 들어, 서버는 입력받은 모델 콘텐츠로서 모델의 웃는 사진을 입력받았다면, 웃는 사진이므로 제1 그룹으로 분류할 수 있다. 웃는 사진에서 특징점으로서 미소 짓는 입술, 미소 짓는 눈 주위 이미지를 제1 그룹 모델 특징 으로 추출할 수 있다. 이때, 사진에 찍힌 모델의 성별이 남성인지 여성인지 여부 그리고 20대인지 60대인지 모델 신상 정보를 참고하 고, 만약 20대 여성이라면, 긴 머리를 손으로 쓸어올리는 사진의 일부분을 그 모델의 제1 그룹 모델 특징으로 추출할 수 있다. 제3 단계에서, 서버는 사용자 콘텐츠를 입력받을 수 있다. 사용자 콘텐츠는 사용자의 문서, SMS, 음성, 사진, 동영상 중 적어도 하나를 포함할 수 있다. 제4 단계에서, 서버는 사용자 신상 정보나 상호 관계를 입력받을 수 있다. 사용자 신상 정보는 사용자 콘텐츠를 제외한 것으로서, 예를 들어 사용자의 성별 구분, 나이, 직업, 인종, 주소, 좋아하는 음식, 좋아하는 색상, 모델과의 상호 관계 등을 포함하는 사용자의 모든 신상 정보를 의미할 수 있다. 상호 관계는 사용자와 모델의 관계로 정의될 수 있다. 사용자에 대하여 모델이 추모하고자 하는 고인, 생존 중 인 롤 모델, 멘토, 돌아가신 부모님, 생존 중인 부모님, 배우자, 가족, 연인, 친구, 애완 동물 중 어떤 관계에 해당하는가 하는 것이 상호 관계일 수 있다. 상호 관계는 사용자에 의하여 직접 서버에 입력되거나, 사용자 신상 정보와 모델 신상 정보를 매칭시켜 서버가 계산하거나, 사용자 로그인 정보에 기록된 상수값일 수 있다. 제5 단계에서 서버는 사용자 신상 정보를 참조하며, 사용자 콘텐츠로부터 사용자 상태를 판단할 수 있다. 사용 자 상태는 사용자의 감정, 사용자의 욕구, 사용자의 대화 의도, 사용자의 로그인 시간, 사용자의 서버 사용 빈 도, 사용자의 과거 대화 내용 중 적어도 하나로부터 파악될 수 있다. 제6 단계에서 서버는 사용자 상태에 매칭되는 가상 콘텐츠를 생성할 수 있다. 가상 콘텐츠는 사용자 콘텐츠와 함께 대화형으로 단말기에 디스플레이 될 수 있다. 도 2를 참조하면, 서버는 사용자 상태가 보통 상태이며 일상적인 대화를 원하는 것으로 판단할 수 있다. 서버는 보통 상태에 매칭되는 가상 콘텐츠를 생성하여 단말기에 출력할 수 있다. 단말기에는 사용자 가 입력한 사용자 콘텐츠와 가상 콘텐츠가 대화형으로 표시될 수 있다. 서버는 사용자 상태에 매칭되는 제1 그룹 모델 특징 내지 제N 그룹 모델 특징 중 적어도 하나를 선택하고, 선택된 그룹 모델 특징에 매칭되는 새로운 모델 콘텐츠로서 가상 콘텐츠를 생성할 수 있다. 단말기에는 사용자 콘텐츠와 가상 콘텐츠가 대화형으로 표시될 수 있다. 도 1을 참조하면, 서버에 입력된 모델 콘텐츠, 서버에 입력된 모델 신상 정보, 서버에 의하여 그룹 분류된 모델 콘텐츠, 서버에 의하여 그룹 분류된 모델 특징 중 적어도 하나는 기억부에 저장될 수 있다. 서버는 모델 콘텐츠 또는 모델 신상 정보를 사용자 콘텐츠 입력 전에 미리 입력받고, 모델 콘텐츠의 그룹 분류 또는 모델 특징의 그룹 분류를 미리 완료하여 기억부에 저장할 수 있다. 서버는 사용자 콘텐츠가 입력되면 기억부에 저장된 모델 특징을 활용하여 사용자 상태에 매칭되는 모 델 특징을 찾고, 모델 특징을 토대로 가상 콘텐츠를 대화형으로 생성할 수 있다. 사용자 콘텐츠와 가상 콘텐츠가 대화형으로 상호 교감되므로, 서버는 교감 결과를 입력받는 상태일 수 있 고 서버는 계속 학습할 수 있다. 서버는 모델 콘텐츠, 모델 특징, 사용자 상태 중 적어도 하나를 계 속 업데이트하며, 가상 콘텐츠를 또 다른 가상 콘텐츠로 재변형할 수 있다. 즉, 교감 결과는 또 다른 변수가 되 며, 이에 따라 가상 콘텐츠의 최적화는 상호 교감 중에도 계속 연산될 수 있다. 사용자가 모델과 의사 소통을 원하는 시점에서, 서버는 딥 러닝 또는 인공 지능으로 동작되고, 사용자의 심리 상태를 반영한 사용자 상태를 반복적으로 업데이트하며, 사용자 상태대로 모델 콘텐츠를 가상 콘텐츠로 반 복적으로 업데이트할 수 있다. 사용자는 모델 콘텐츠를 재생성한 가상 콘텐츠를 사용자 자신의 사용자 콘텐츠와 상호 교감하면서 심리적 안정 과 위로를 느낄 수 있다. 문자는 글, 문자, 문서나 저장 매체를 통하여 보여줄 수 있는 기록 중 적어도 하나를 포함할 수 있다. 음성은 목소리, 노래, 흥얼거림, 귀로 들을 수 있는 모든 소리 중 적어도 하나를 포함할 수 있다. 이미지는 형상, 얼굴, 신체, 움직임 중 적어도 하나를 포함할 수 있다. 동영상은 음성과 동영상이 조합된 것일 수 있다. 서버에 마련된 인공 지능은 모델 콘텐츠로부터 문자, 음성, 이미지 중 적어도 하나를 추출하고 사용자 상 태에 따라 가상 콘텐츠를 재조합할 수 있다. 모델의 생전의 영상과 음성을 포함하는 모델 콘텐츠를 인공 지능(AI)을 이용하여 가상 콘텐츠로 가공할 수 있다. 사용자에게 상황별 커뮤니케이션, SMS, 음성 통화, 이미지 전송, 영상 통화 등을 제공하므로, 사용자의 행복을 줄 수 있다. 모델은 남아있는 가족들을 위해서, 사용자 콘텐츠가 입력되는 제1 시점 이전에 미리 자신의 모델 특징을 인공 지능화된 서버에 학습시킬 수 있다. 서버는 사용자 콘텐츠 또는 사용자 신상 정보를 직접 학습하고 모델을 대리하여 사용자와 대화할 수 있다. 최근 혼자 사는 인구가 증가하고 있으며, 많은 사람들이 외로움을 느끼고 있다. 이런 사람들을 위해 모델의 정 보 또는 사용자 자신의 정보를 서버에 미리 학습시켜 사용자의 심리 상태에 맞는 대화를 수행할 수 있다. 현재 통신사에서 판매하는 대화형 AI와는 다르다, 이것들은 사용자의 출력 명령에 대한 단순 재생만 가능할 뿐 이다. 모델 콘텐츠가 문자일 때, 모델 콘텐츠로부터 모델 특징을 인식하는 문자 인식 모델은, 인쇄되거나 손으로 쓴 문자를 자동으로 판독하거나 식별하여 서버가 이해할 수 있는 코드로 전환할 수 있다. 모델 콘텐츠가 이미지 또는 동영상일 때, 딥페이크(Deepfakes)모델은 특정 모델의 얼굴, 신체, 형상 중 적어도 하나에 관한 이미지 또는 동영상을 인공 지능 또는 인공 지능 알고리즘을 이용해 가상 콘텐츠로 재합성할 수 있 다. 모델의 음색, 억양, 어조, 끊어 읽기 중 적어도 하나를 포함하는 모델 특징을 인공 지능이 학습하고 모델 콘텐 츠를 모델 특징에 맞게 합성 또는 변형하여 상황에 맞춤형으로 변형된 가상 콘텐츠를 생성할 수 있다. 모델에 대한 학습데이터 수집은 다음과 같다. 모델이 생전에 살아 있을 때 또는 임종전에 모델의 대화 목소리, 얼굴, 그 동안 써왔던 문자 등을 서버가 수집 또는 학습할 수 있다. 서버의 학습 데이터가 많을수록 정확도가 올라갈 수 있다. 이를 위해서 자체 앱 배포, 웹 페이지 등을 오픈하여 모델의 학습 데이터를 수집할 수 있다. 서버 사용자에 대한 서비스 방식은 다음과 같다. 사용자는 서버에 접속되는 스마트폰 앱이나 웹 페이지를 활용할 수 있다. 사용자는 서버에 접속되는 앱을 이용하여 SMS를 보내거나 통화, 영상 통화 등을 할 수 있다. 사용자가 신청한 모델의 모습, 억양, 목소리 로 사용자는 모델과 통화랄 수 있다. 서버의 과금 방식은 SMS 회당 요금, 통화, 영상 통화 30초당 요금으로 산정할 수 있다. 서버의 사용자 서비스 제공시 다음을 고려할 수 있다. 모델에 대한 데이터 수집량에 따라 서버의 서 비스 질이 다를 수 있다. 기본적인 생활 대화가 가능한 수준의 모델 콘텐츠의 제공이 필요할 수 있다. 모델 또 는 고인에 대한 그리워하는 마음으로 이야기하는 것은 가능하지만, 서버는 정치나 경제 등의 높은 수준의 대화를 제공할 수는 없다.부호의 설명 100...단말기 200...서버 300...기억부"}
{"patent_id": "10-2020-0023303", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 가상 콘텐츠 생성 방법을 시계열적으로 도시한 흐름도이다. 도 2는 본 발명의 사용자 콘텐츠와 가상 콘텐츠가 단말기에서 대화형 SMS로 표시되는 상태를 도시한다."}
