{"patent_id": "10-2020-0109528", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0028473", "출원번호": "10-2020-0109528", "발명의 명칭": "가변 구조를 지닌 매트리스 장치", "출원인": "경북보건대학교 산학협력단", "발명자": "안소희"}}
{"patent_id": "10-2020-0109528", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "부분적으로 가변되는 구조를 지닌 매트리스 장치에 있어서:쿠션부재(10)를 외피재(12)로 감싼 본체;상기 본체의 중앙 부분에 수용되고, 양단에 힌지축(25)을 지닌 고정프레임(20);상기 고정프레임(20)의 일단과 타단에 힌지축(25)을 개재하여 회동 가능하게 연결되는 가동프레임(30);상기 본체에서 둔부와 발목 중에 적어도 어느 하나의 자세변동을 유발하는 보조수단(40); 및상기 가동프레임(30)과 상기 보조수단(40)을 설정된 알고리즘으로 제어하는 제어기(50);를 포함하여 이루어지는것을 특징으로 하는 가변 구조를 지닌 매트리스 장치."}
{"patent_id": "10-2020-0109528", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 가동프레임(30)은 회전 가능하게 지지되는 회동축(34), 회동축(34)에 연결되는 회동암(35), 회동축(34)의회전을 유발하는 회동모터(37)를 구비하는 것을 특징으로 하는 가변 구조를 지닌 매트리스 장치."}
{"patent_id": "10-2020-0109528", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,상기 보조수단(40)은 둔부의 자세변동을 위한 요홈부(41)에 EAP 인공근육(43)을 갖추고, 발목의 자세변동을 위한 부양부(45)에 부양모터(47)를 갖추는 것을 특징으로 하는 가변 구조를 지닌 매트리스 장치."}
{"patent_id": "10-2020-0109528", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서,상기 제어기(50)는 본체에 일정한 간격으로 배치되는 압력센서(52)와 온도센서(54)의 신호로 사용자의 자세를판단하고, 이에 대응하여 설정된 패턴으로 본체의 주기적 변형을 유발하는 것을 특징으로 하는 가변 구조를 지닌 매트리스 장치."}
{"patent_id": "10-2020-0109528", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 부분적으로 가변되는 구조를 지닌 매트리스 장치에 있어서: 쿠션부재를 외피재로 감싼 본체; 상기 본체의 중앙 부분에 수용되고, 양단에 힌지축을 지닌 고정프레임; 상기 고정프레임의 일단과 타단에 힌지축을 개재하여 회동 가능하게 연결되는 가동프레임; 상기 본체에서 둔부와 발목 중에 적어도 어느 하나의 자세변동을 유발하는 보조수단; 및 상기 가동프레임과 상기 보조수단을 설정된 알고리 즘으로 제어하는 제어기;를 포함하여 이루어지는 것을 특징으로 한다. 이에 따라, 거동이 불편한 노약자 등이 장기간 사용하는 매트리스로서 유체나 에어에 대한 의존도를 낮추는 대신 사용자의 신체를 다양한 자세로 변동시켜 욕창 방지의 신뢰성을 높이는 효과가 있다."}
{"patent_id": "10-2020-0109528", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 매트리스 장치에 관한 것으로서, 보다 구체적으로는 거동이 불편한 노약자 등이 장시간 누워서 지낼 수 있는 가변 구조를 지닌 매트리스 장치에 관한 것이다."}
{"patent_id": "10-2020-0109528", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "고령자는 물론 노졸증, 뇌성마비, 근육병 등을 앓고 있는 환자들은 장시간 매트리스에 누워서 지내다 보면 신체 의 돌출 부위에서 지속적인 압력이 작용하여 욕창이 발생하기 쉽다. 욕창이 심한 경우 뼈가 드러날 정도로 고통 을 유발하면서 패혈증 등 합병증으로 사망에까지 이를 수 있다. 통상 에어펌프가 장착된 매트리스를 사용하여 주기적으로 공기를 넣었다 뺐다 하면서 특정 부위에 지속적인 압박이 가해지는 현상을 완화 내지 방지한다. 매트리스의 욕창 방지 기능과 관련되어 한국 공개특허공보 제2012-0077420호(선행문헌 1), 한국 등록특허공보 제2080181호(선행문헌 2) 등의 선행기술문헌을 참조할 수 있다. 선행문헌 1은 매트리스의 튜브 그룹들끼리 상호 독립적으로 유체를 공급 및 배출할 수 있도록 된 유체 공급부; 튜브 그룹들에 대한 유체압력을 검출하는 센서부; 튜브그룹들에 인가되는 유체압력이 가변되게 유체 공급부를제어하는 제어유니트;를 구비한다. 이에, 체압이 평균압력이 유지되도록 제어함으로써 체압을 최적으로 분산시 키는 효과를 기대한다. 선행문헌 2는 에어매트, 복수의 압력측정센서, 에어공급부, 제어유닛을 구비하는 다층 에어셀 구조의 매트리스 에 있어서, 에어매트 하부에 형성되는 쿠션용 지지매트와, 적층된 에어매트와 지지매트를 커버하도록 둘레부에 개폐부가 형성된 커버부재를 포함되어 구성된다. 이에, 최적의 체압조건을 분석/입력하여 욕창 발생을 사전 제 거하는 효과를 기대한다. 그러나, 상기한 선행문헌에 의하면 유체나 에어를 주요 구성으로 하므로 마모와 누출에 의한 기능 저하로 급작 스런 욕창 악화의 우려가 크다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국 공개특허공보 제2012-0077420호 \" 욕창 방지 메트리스 및 그 구동방법\" (공개일자 : 2012.07.10.) (특허문헌 0002) 한국 공개특허공보 제2012-0113827호 \"다층 에어셀 구조를 가진 지능형 욕창예방 매트리스\" (공개일자 : 2012.10.16.)"}
{"patent_id": "10-2020-0109528", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상기와 같은 종래의 문제점들을 개선하기 위한 본 발명의 목적은, 거동이 불편한 노약자 등이 장기간 사용하는 매트리스로서 유체나 에어에 대한 의존도를 낮추는 대신 사용자의 신체를 다양한 자세로 변동시키는 가변 구조 를 지닌 매트리스 장치를 제공하는 데 있다."}
{"patent_id": "10-2020-0109528", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위하여, 본 발명은 부분적으로 가변되는 구조를 지닌 매트리스 장치에 있어서: 쿠션부재 를 외피재로 감싼 본체; 상기 본체의 중앙 부분에 수용되고, 양단에 힌지축을 지닌 고정프레임; 상기 고정프레 임의 일단과 타단에 힌지축을 개재하여 회동 가능하게 연결되는 가동프레임; 상기 본체에서 둔부와 발목 중에 적어도 어느 하나의 자세변동을 유발하는 보조수단; 및 상기 가동프레임과 상기 보조수단을 설정된 알고리즘으 로 제어하는 제어기;를 포함하여 이루어지는 것을 특징으로 한다. 본 발명의 세부 구성에 의하면, 상기 가동프레임은 회전 가능하게 지지되는 회동축, 회동축에 연결되는 회동암, 회동축의 회전을 유발하는 회동모터를 구비하는 것을 특징으로 한다. 본 발명의 세부 구성에 의하면, 상기 보조수단은 둔부의 자세변동을 위한 요홈부에 EAP 인공근육을 갖추고, 발 목의 자세변동을 위한 부양부에 부양모터를 갖추는 것을 특징으로 한다. 본 발명의 세부 구성에 의하면, 상기 제어기는 본체에 일정한 간격으로 배치되는 압력센서와 온도센서의 신호로 사용자의 자세를 판단하고, 이에 대응하여 설정된 패턴으로 본체의 주기적 변형을 유발하는 것을 특징으로 한다."}
{"patent_id": "10-2020-0109528", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상과 같이 본 발명에 의하면, 거동이 불편한 노약자 등이 장기간 사용하는 매트리스로서 유체나 에어에 대한 의존도를 낮추는 대신 사용자의 신체를 다양한 자세로 변동시켜 욕창 방지의 신뢰성을 높이는 효과가 있다."}
{"patent_id": "10-2020-0109528", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면에 의거하여 본 발명의 실시예를 상세하게 설명하면 다음과 같다. 본 발명에 따르면 부분적으로 가변되는 구조를 지닌 매트리스 장치에 관하여 제안한다. 매트리스의 부분적 가변 은 누워 있는 사용자의 신체의 적어도 일부에 대한 자세변동을 의미한다. 자세변동은 사용자의 의지와 관계없이 신체의 돌출 부위에서 지속적인 압력이 작용하지 않도록 하기 위함이다. 본 발명에 따른 매트리스 본체는 쿠션부재를 외피재로 감싼 구조를 이루고 있다. 도 1을 참조하면, 매트리스 본체를 구성하는 쿠션부재와 외피재를 부분적으로 절개하여 나타낸다. 쿠션 부재는 사용자의 체중을 탄성적으로 지탱하는 재질이면서 후술하는 기능품을 수용하는 공간을 갖춘다. 외피 재는 사용자의 피부와 접촉되는 부분으로서 내마모성과 더불어 신축성이 요구된다. 외피재는 영역에 따 라 물성을 차등적으로 적용할 수도 있다. 한편, 본체의 쿠션부재는 종래의 욕창 방지용 매트리스와 같은 에어포켓을 더 구비할 수 있다. 에어포 켓은 에어펌프(도시 생략)와 배관으로 연결되어 신선한 공기를 제공한다. 또한, 본 발명에 따르면 상기 본체의 중앙 부분에 수용되는 고정프레임이 양단에 힌지축을 지닌 구조를 이루고 있다. 도 1에서, 고정프레임이 매트리스 본체에서 사용자의 둔부를 지지하도록 대략 중앙에 수용된 상태를 나타낸 다. 고정프레임은 한 쌍의 판재로 형성하여 본체의 일측과 타측으로 대향하도록 배치한다. 힌지축은 고 정프레임의 대향하는 간격을 유지하는 동시에 후술하는 가동프레임과 연결된다. 또한, 본 발명에 따르면 가동프레임이 상기 고정프레임의 일단과 타단에 힌지축을 개재하여 회동 가능하게 연결되는 구조를 이루고 있다. 도 1에서, 가동프레임의 상체회동부와 하체회동부가 매트리스 본체에서 사용자의 상체와 하체를 각 각 지지하도록 고정프레임에 연결된 상태를 나타낸다. 상체회동부와 하체회동부도 고정프레임 처럼 한 쌍의 판재로 형성하여 본체의 일측과 타측으로 대향하도록 배치한다. 쿠션부재와 외피재는 상 체회동부와 하체회동부의 회동에 연동하여 사용자 신체의 자세에 대한 변화를 유발한다. 본 발명의 세부 구성에 의하면, 상기 가동프레임은 회전 가능하게 지지되는 회동축, 회동축에 연결 되는 회동암, 회동축의 회전을 유발하는 회동모터를 구비하는 것을 특징으로 한다. 도 1 및 도 2를 참조하면, 고정프레임의 양단에 연결된 가동프레임의 상체회동부와 하체회동부(3 2)가 회동축, 회동암, 회동모터로 구??되는 상태를 나타낸다. 회동축은 가동프레임 상에 힌지축과 평행하게 배치된다. 회동축 상에는 회동암이 연동하도록 고정된다. 회동암의 단부에 는 마찰저항을 줄이기 위한 베어링이나 롤러를 갖출 수 있다. 회동모터는 모터를 기반으로 하고 기어나 링 크를 포함하여 구성된다. 회동모터는 회동축의 일단에 연결될 수도 있지만 양단에 연결되는 것이 작동 신뢰성과 내구성 측면에서 유리하다. 어느 경우에나 회동모터의 회전으로 회동축이 회전하면 회동암 이 연동하여 가동프레임의 승강을 유발한다. 도 2(a)처럼 상체회동부의 회동암이 회전되면 부호 31′의 자세로 사용자의 상체를 상승시켜 접촉 압력 을 저하시킨다. 반대로 도 2(b)처럼 하체회동부의 회동암이 회전되면 부호 32′의 자세로 사용자의 하 체를 상승시켜 접촉 압력을 저하시킨다. 물론 상체회동부와 하체회동부를 동시에 상승시키는 자세변동 도 가능하다. 또한, 본 발명에 따르면 보조수단이 상기 본체에서 둔부와 발목 중에 적어도 어느 하나의 자세변동을 유발 하는 구조를 이루고 있다. 도 2와 같이 가동프레임의 승강에 의한 자세변동이 이루어지더라도 둔부와 발꿈치에 대한 압력 변동은 크지 않을 수 있다. 보조수단은 둔부의 압력 완화를 위한 구성 및 발목의 자세변동으로 발꿈치의 압력 완화를 위 한 구성 중의 적어도 어느 하나를 수행한다.본 발명의 세부 구성에 의하면, 상기 보조수단은 둔부의 자세변동을 위한 요홈부에 EAP 인공근육을 갖추고, 발목의 자세변동을 위한 부양부에 부양모터를 갖추는 것을 특징으로 한다. 도 3을 참조하면, 보조수단을 구성하는 요홈부와 부양부를 동시에 나타낸다. 요홈부는 매트리 스 본체의 쿠션부재에 반구형 홈을 형성하고 외피재의 저면으로 EAP 인공근육을 배치한다. 물론 외 피재를 일부 제거하고 EAP 인공근육이 드러나도록 설치할 수도 있다. EAP 인공근육은 격자형으로 형성하고 전기적 회로로 연결한다. EAP 인공근육은 전기 신호가 없는 동안 외피재의 저면에 밀착된 상 태로 유지된댜. EAP 인공근육에 설정된 전기 신호가 입력되면 부호 43′처럼 반구형 홈으로 낙하되어 둔부 의 압력을 저하시킨다. 부양부는 매트리스의 본체의 쿠션부재와 외피재 사이에 설치되고 부양모터 의 상단에 부양대를 연결한 간단한 구성으로 형성 가능하다. 부양모터는 솔레노이드로 대체될 수도 있 다. 부양모터가 가동되면 사용자의 발목이 상승되어 발꿈치의 압력을 저하시킨다. 또한, 본 발명에 따르면 제어기가 상기 가동프레임과 상기 보조수단을 설정된 알고리즘으로 제어하 는 구조를 이루고 있다. 도 4를 참조하면, 제어기가 구동부를 개재하여 가동프레임의 회동모터 및 보조수단의 부양 부와 부양모터에 연결된 상태를 나타낸다. 제어기는 마이크로프로세서, 메모리, 입출력인터페이스 를 탑재한 마이컴 회로로 구성한다. 제어 알고리즘은 제어기의 메모리에 프로그램과 데이터 형태로 저장되 고 실행된다. 본 발명의 세부 구성에 의하면, 상기 제어기는 본체에 일정한 간격으로 배치되는 압력센서와 온도센서 의 신호로 사용자의 자세를 판단하고, 이에 대응하여 설정된 패턴으로 본체의 주기적 변형을 유발하는 것을 특징으로 한다. 도 4에서, 제어기의 입력인터페이스에 압력센서와 온도센서가 연결된 상태를 나타낸다. 압력센서 와 온도센서는 매트리스의 쿠션부재와 외피재 사이에 격자 형태로 배치하는 것이 좋다. 제어기 는 압력센서와 온도센서의 신호로 사용자가 바로 누운 상태인지, 옆으로 누운 상태인지, 상체와 하 체가 굽어진 상태인지 판단한다. 사용자가 바로 누운 상태라면 상체회동부, 하체회동부, 보조수단 은 정상적인 패턴으로 반복하면서 가동된다. 사용자의 자세가 그렇지 않다면 상체회동부, 하체회동부, 보조수단은 선택적으로 가동된다. 본 발명은 기재된 실시예에 한정되는 것이 아니고, 본 발명의 사상 및 범위를 벗어나지 않고 다양하게 수정 및 변형할 수 있음이 이 기술의 분야에서 통상의 지식을 가진 자에게 자명하다. 따라서 그러한 변형예 또는 수정예 들은 본 발명의 특허청구범위에 속한다 해야 할 것이다."}
{"patent_id": "10-2020-0109528", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 장치가 설치된 매트리스의 모식도 도 2는 본 발명에 따른 가동프레임의 작동을 나타내는 모식도도 3은 본 발명에 따른 보조수단의 구조를 나타내는 모식도 도 4는 본 발명에 따른 제어기 회로 연결을 나타내는 블록도"}
