{"patent_id": "10-2000-0032956", "section": "특허_기본정보", "subsection": "특허정보", "content": {"출원번호": "10-2000-0032956", "출원인": "어플라이드 머티어리얼스, 인코포레이티드    조셉 제이. 스위니", "발명자": "도탄,노암"}}
{"patent_id": "10-2000-0032956", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "이전에 생성된 결함 지도에 근거하여 목적물 표면 상의 결함을 검사하기 위한 장치로서,상기 목적물을 수용하기 위한 스테이지와,광비임을 제공하는 조사원을 포함하고, 상기 결함 지도에 포함된 정보에 근거하여 상기 목적물 표면의 선택된 부분을 향해 상기 광비임을 주사하는 광학 현미경과,상기 광학 현미경에 연결되어 있고 상기 광비임에 의해 조사된 결함을 검출하기 위한 광센서와,규정된 축선을 따라 비임 입자를 촛점에 포커싱시키기 위한 입자 비임 이미징 시스템과, 그리고상기 재검출된 결함을 상기 촛점 부근에 위치시키는 이송 시스템을 포함하며,상기 재검출된 결함이 입자 비임 이미징 시스템을 사용하여 연속적으로 재검사될 수 있는 장치."}
{"patent_id": "10-2000-0032956", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서, 상기 이송 시스템은 제 1축선을 따라 상기 스테이지를 이동시키기 위한 제 1모터식 베이스 및 제 2축선을 따라 상기 스테이지를 이동시키기 위한 제 2모터식 베이스를 포함하며,상기 제 1 및 제 2축선은 실질적으로 서로 수직하며 평면을 한정하는 장치."}
{"patent_id": "10-2000-0032956", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항에 있어서, 상기 현미경은 밝은 영역 모드, 어두운 영역 모드, 및 상기 밝은 영역 모드와 상기 어두운 영역 모드의 조합 영역에서 작용하도록 구성되어 있는 장치."}
{"patent_id": "10-2000-0032956", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1항에 있어서, 상기 입자 비임 시스템에 의해 검사된 결함을 분류하기 위한 컴퓨터 시스템을 더 포함하는 장치."}
{"patent_id": "10-2000-0032956", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4항에 있어서, 상기 컴퓨터 시스템은 상기 현미경에 의해 이미지된 결함을 더 분류하도록 구성된 장치."}
{"patent_id": "10-2000-0032956", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1항에 있어서, 상기 조사원은 레이저를 포함하는 장치."}
{"patent_id": "10-2000-0032956", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 3항에 있어서, 상기 현미경에 작동가능하게 접속되고, 상기 어두운 영역 모드 및 상기 밝은 영역 모드를 발생시키기 위해 규정된 조사 형태를 선택적으로 형성하기 위한 모드 선택기를 더 포함하는 장치."}
{"patent_id": "10-2000-0032956", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7항에 잇어서, 상기 모드 선택기는 상기 현미경의 조사 경로 내로 삽입가능한 필터를 포함하는 장치."}
{"patent_id": "10-2000-0032956", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 7항에 있어서, 상기 조사원은 밝은 영역을 조사하기 위한 램프식 광원 및 어두운 영역을 조사하기 위한 레이저원을 포함하는 장치."}
{"patent_id": "10-2000-0032956", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9항에 있어서, 상기 어두운 영역의 조사는 경사진 각도로 상기 목적물 표면에 도달하는 장치."}
{"patent_id": "10-2000-0032956", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 1항에 있어서, 상기 목적물 표면을 향해 경사진 각도로 보조 광원을 주사하기 위한 제 2조사원을 더 포함하는 장치."}
{"patent_id": "10-2000-0032956", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 1항에 있어서, 상기 목적물 표면을 상기 입자 이미징 시스템의 촛점에 자동적으로 유지시키기 위한 포커싱 시스템을 더 포함하는 장치."}
{"patent_id": "10-2000-0032956", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 12항에 있어서, 상기 포커싱 시스템은, 포커싱 비임을 발생시키기 위한 간섭 광원과,제 1입사점에서 상기 목적물 표면을 가격하는 포커싱 비임을 상기 촛점을 통해 상기 목적물 표면을 향해 16-10공개특허특2001-0007394주사하기 위한 포커싱 미러와,상기 제 1입사점 부근에 위치한 제 2입사점에서 상기 목적물 표면의 후방으로 상기 포커싱 비임을 반사시키기 위한 반사 미러와, 그리고상기 목적물 표면과 상기 촛점 사이의 거리를 검출하고 상기 목적물 표면과 상기 촛점이 정렬하도록 상기 스테이지를 수직하게 조절하기 위한 이미지 정렬 시스템을 포함하는 장치."}
{"patent_id": "10-2000-0032956", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13항에 있어서, 상기 입자 비임 이미징 시스템이 결함을 이미지화할 때 상기 포커싱 시스템을 선택적으로 작동시키고 상기 현미경이 작동 중일 때 상기 포커싱 시스템을 작동 해제시키는 선택 메카니즘을 더 포함하는 장치."}
{"patent_id": "10-2000-0032956", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 14항에 있어서, 상기 선택 메카니즘은 상기 현미경의 주사 경로 내로 삽입가능한 미러를 포함하는 장치."}
{"patent_id": "10-2000-0032956", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 14항에 있어서, 상기 선택 메카니즘은 상기 현미경의 주사 경로 내에 위치된 통시적 미러를 포함하는 장치."}
{"patent_id": "10-2000-0032956", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 1항에 있어서, 상기 센서가 칼라 CCD인 장치."}
{"patent_id": "10-2000-0032956", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 3항에 있어서, 상기 밝은 영역 모드 및 상기 어두운 영역 모드 상으로의 조사는 색코드형이며, 상기 센서가 칼라 CCD인 장치."}
{"patent_id": "10-2000-0032956", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 1항에 있어서, 상기 결함 지도로부터의 결함 좌표 및 상기 현미경으로부터의 스테이지 좌표를 수용하고 상기 결함 지도의 기록 에러를 계산하는 에러 계산기를 더 포함하는 장치."}
{"patent_id": "10-2000-0032956", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 19항에 있어서, 시스템 ID와 관련하여 상기 기록 에러를 저장하고 상기 시스템 ID를 갖는 소정의 결함 지도에 상기 기록 에러를 적용하는 에러 메모리를 더 포함하는 장치."}
{"patent_id": "10-2000-0032956", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "이미 생성된 결함 지도에 근거하여 목적물 표면 상의 결함을 검사하는 방법으로서,결함을 재검출하기 위해 결함 지도로부터의 좌표에 근거하여 상기 목적물 표면의 선택된 부분을 광학 현미경으로 관찰하는 단계와, 상기 재검출된 결함의 위치에 대응하는 스테이지 좌표를 결정하는 단계와,상기 결함 지도 및 상기 스테이지 좌표로부터 기록된 에러를 계산하는 단계와,상기 재검출된 결함을 입자 비임 이미징 시스템의 촛점 부근에 위치시키기 위해 상기 목적물 표면을 이동시키는 단계와, 그리고상기 입자 비임 이미징 시스템을 사용하여 상기 재검출된 결함을 검사하는 단계를 포함하는 방법."}
{"patent_id": "10-2000-0032956", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제 21항에 있어서, 상기 목적물 표면의 선택된 부분을 광학 현미경으로 관찰하는 단계는 어두운 영역 조사로 상기 목적물 표면을 조사하는 단계를 포함하는 방법."}
{"patent_id": "10-2000-0032956", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제 22항에 있어서, 밝은 영역 모드로 상기 현미경을 작동시킴으로써 상기 결함의 확대된 광학 이미지를 얻는 단계를 더 포함하는 방법."}
{"patent_id": "10-2000-0032956", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제 21항에 있어서, 상기 결함의 어두운 영역 이미지와 어두운 영역 이미지의 복합적인 이미지를 형성하기 위해 상기 목적물 표면의 상기 선택된 부분 상에 밝은 영역 조사와 어두운 영역 조사를 동시에 적용하는 단계를 포함하는 방법."}
{"patent_id": "10-2000-0032956", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "전자비임 현미경을 사용하여 웨이퍼 표면 상의 결함을 검사하는 방법으로서,검사될 웨이퍼 상의 지정된 영역의 리스트를 작성하는 단계와,상기 지정된 영역의 전자비임으로 스캐닝을 수행하기 위해 상기 지정된 영역의 리스트를 상기 현미경으16-11공개특허특2001-0007394로 제공하는 단계와,상기 지정된 영역 내의 결함을 검출하기 위해 다이 대 다이 검사를 수행하는 단계와, 그리고이전 단계들을 기초로 하여 결함 지도를 작성하는 단계를 포함하는 방법."}
{"patent_id": "10-2000-0032956", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "제 25항에 있어서, 상기 지정된 영역의 리스트는 모조 결함 지도의 형태로 작성되는 방법.도면 도면1 도면216-12공개특허특2001-0007394 도면3 도면416-13공개특허특2001-0007394 도면5 도면616-14공개특허특2001-0007394 도면716-15공개특허특2001-0007394 도면816-16공개특허특2001-0007394"}
{"patent_id": "10-2000-0032956", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 목적물을 검사하기 위한 장치 및 방법에 관한 것이다. 본 발명에 따른 장치는 목적물을 수용 하는 스테이지, 광학 현미경, 및 주사식 전자 현미경(SEM)을 포함한다. 광학 현미경은 목적물 표면 상 의 이미 작도된 결함을 재검출하기 위해 사용되며, 목적물 표면의 선택된 부분을 향해 광비임을 주사하 는 조사원을 포함한다. 광학 현미경은 밝은 필드 조사 및 어두운 필드 조사 중 어느 하나 또는 이들 모 두를 발생시키도록 구성되어 있다. 일단 결함이 재검출되면, 결함이 SEM에 의해 검사될 수 있는 위치에 놓이도록 이송 시스템은 스테이지를 소정의 위치로 이동시킨다. 이러한 장치는 SEM에 의해 관찰된 결함 을 자동적으로 포커싱시키고, 결함의 변화하는 원근감을 얻기 위해 스테이지를 회전시킨다."}
{"patent_id": "10-2000-0032956", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "의 숙련자에 의해 부분적으로 명료해지거나, 또는 본 발명의 실시예 의해 얻어 질 수 있다. 본 발명의 이러한 장점들은 첨부된 청구범위에 부분적으로 지적된 수단이나 이들의 조합에 의해 실현되고 달성될 수 있다. 이후, 동일한 구성부품에 대해 동일한 도면부호를 병기한 첨부 도면을 참조하여 설명한다. 이하에 반도체 웨이퍼 검사 시스템, 특히 결함을 재검출하고 평가하기 위해 사용된 검사 시스템의 예들 에 관해 기술할 것이다. 그렇지만, 본 발명은 포토마스크, 자기 디스크, 광학 디스크, 미러 등과 같은 재료를 검사하는데 사용되는 다른 시스템에 적용될 수 있다. 도 1은 본 발명의 예시적인 실시예에 따라 제조된 웨이퍼 검사 시스템의 평면도이다. 도 1의 웨이 퍼 검사 시스템은 이송 시스템에 연결된 스테이지를 수용하는 진공 챔버를 포함하 고 있다. 광학 현미경은 진공 챔버 내의 윈도우를 통해 광학 이미지를 제공하며, 입자 비임 이미징 시스템은 진공 챔버 내에 위치된 목적물의 입자 비임 기초 이미지를 제공한다. 스테이지는 예컨대 반도체 웨이퍼와 같은 목적물이 위치될 수도 있는 플랫포옴으로써 구성된 다. 이송 시스템은 X-축선과 같은 제 1축선을 따라 반도체 웨이퍼의 위치를 조절하기 위한 제 1모터식 베이스를 포함하고 있다. 이송 시스템은 또한 Y-축선과 같은 제 2축선을 따라 반 도체 웨이퍼의 위치를 조절하기 위한 제 2모터식 베이스를 포함하고 있다. 제 1 및 제 2모터 식 베이스(126,128)는 예컨대 전기 모터(도시되지 않음)와 같은 여러 형태의 구동 시스템을 사용하여 소 정의 경로를 따라 작동되도록 제어될 수 있다. 따라서, 스테이지 상에 위치된 반도체 웨이퍼 는 X-축선과 Y-축선에 의해 한정된 평면을 따라 이동할 수 있다. 종래 기술에서 공지된 바와 같이, 스 테이지는 또한 예비설정 방향으로 반도체 웨이퍼를 고정시키기 위한 적절한 잠금 유닛(도시되 지 않음)을 포함할 수 있다. 웨이퍼 검사 시스템은 스테이지의 수직한 위치를 조절하기 위한 수직한 변위 유닛을 포 함할 수 있다. 수직한 변위 유닛은 예컨대 모터에 의해 작동되는 리프트를 포함할 수 있다. 추가로, 다수의 수직한 변위 유닛이 사용될 수 있으며, 이러한 환경에서는 X-Y 평면이 Z-축 선을 따라 조절하는 동안 실질적으로 편평하게 유지되도록 모터의 작동을 동기시키기 위해 회로가 제공될 수 있다. 수직한 변위 유닛은 또한 광학 현미경 또는 SEM 중 어느 하나에 의해 관찰될 때, 반도체 웨이퍼의 이미지의 포커싱을 조력하는 역할을 한다. 물론, 전자 칼럼에서의 전 압을 변화시키고 또는 목적물 및/또는 다른 광학 요소를 조절시키는 것과 같은 포커싱을 위한 다른 방법 이 사용될 수 있다. 16-3공개특허특2001-0007394광학 현미경은 조사원, 준반사 미러, 렌즈, 및 편향 미러를 포함하고 있다. 조사원은 예컨대 막스 본(Max Born) 및 에밀 울프(Emil Wolf)가 쓴 1980년 페르가몬 출판사(Pergamon Press)의 광학 원리(Principles of Optics)에 개시된 바와 같은 고정식 또는 가변식 스 폿 크기를 갖는 비임을 생성할 수 있는 쾰러(Kohler)형 조사 램프의 형태일 수 있다. 이러한 조사 원은 또한 고정식 또는 가변식 스폿 크기의 비임을 생성할 수 있는 레이저의 형태일 수 있다. 선 택적으로, 비임 팽창기(도시되지 않음)는 비임의 스폿 크기를 증가시키기 위해 사용될 수 있다. 조사원에 의한 비임의 출력이 목적물의 표면을 가격하고 X-Y 평면에 실질적으로 수직한 조사 경로를 따라 반사되도록, 준반사 미러가 위치된다. 도 1에 도시된 바와 같이, 웨이퍼 검사 시스템은 제 1광학 윈도우를 포함할 수 있는데, 이러한 제 1광학 윈도우를 통해 광학 현미경(즉, 광학 현미경이 진공 챔버의 외측에 위치된 경우)에 의해 관찰될 수 있다. 선택적으로, 광학 현미경은 진공 챔버 내로 연장될 수 있다. 본 발명의 개시된 실시예에 따르면, 조사원에는 예컨대 밝은 영역 조사, 어두운 영역 조사, 또는 이들 모두와 같은 여러 형태의 광필드의 선택을 허용하는 광필드 선택기가 제공된다. 도 2를 더 참조하면, 광필드 선택기의 여러 작동 형태가 도시되어 있다. 광영역 선택기는 투명 영역 및 불투명 영역의 여러 기하학적 구역을 포함할 수 있다. 광영역 선택기의 각각의 형태는 특정한 광영역을 형성한다. 예컨대, 광영역 선택기의 외부 부분이 불투명한 경우에는, 제 1비임(144A)이 광영역 선택기의 중앙을 통과하여 밝은 영역 조사를 발생시킬 것이다. 광영역 선택 기의 중앙 부분이 불투명한 경우에는, 제 2비임(144B)이 광영역 선택기의 둘레부를 통과하여 어두운 영역 조사를 발생시킬 것이다. 선택적으로, 광영역 선택기은 투명한 영역들 사이에 배치된 환형의 불투명한 부분을 포함함으로써, 밝은 영역 또는 어두운 영역 조사의 조합을 형성할 수 있다. 선택적으로, 광영역 선택기는 다른 여러 방식으로 수행될 수 있다. 광영역 선택기는 전술된 광패턴의 통로를 허용하도록 비임 전방에 물리적으로 위치될 수 있다. 추가로, 광영역 선택기는 투명 영역 및 불투명 영역 대신에 상이한 칼라 필터의 영역을 포함할 수 있다. 예컨대, 영역은 파랑 및 초록 필터와 같은 제 1칼라 필터로써 구성될 수 있다. 다음으로, 영역은 예컨대 빨강 필터와 같은 제 2칼라 필터로써 구성될 수 있다. 또한, 상이한 칼라의 결합된 영역 이외에, 광영역 선택기는 분극 필터의 형태일 수 있으며, 여기서 영역(152,154)은 조사원에 의해 출력된 비임을 분극화시키도록 구성된다. 필터는 종종 밝은 영역 조사 및 어 두운 조사 영역이 동시에 사용될 때 이미지를 분해하는데 효과가 있는 것으로 증명되었다. 도 1에 도시된 바와 같이, 밝은 영역 조사가 사용되는 경우, 제 1비임(144A)은 준반사 미러로부터 반사되고, 렌즈를 통과하여 반도체 웨이퍼의 표면 상에 포커싱된다. 어두운 영역 조사가 사 용되는 경우, 제 2비임(144B)이 준반사 미러로부터 반사되고, 렌즈 둘레를 통과한다. 편향 미러는 광학 현미경의 원뿔형 부분 내에 위치되어서, 반도체 웨이퍼의 표면을 향하는 제 2비임(144B)을 경사진 각도로 반사한다. 선택적으로, 포커싱 미러는 반도체 웨이퍼의 선택된 영역 상의 포커싱점으로 비임이 포커싱되도록 포물선형태를 가질 수 있다. 경사각은 일반적으로 어떠한 반사광도 렌즈를 통과하지 않도록 선택된다. 도 1은 본 발명의 작동을 도시하는 것을 목적으로 하 므로, 경사각의 기하학적 방위를 정확하게 도시하지 않았다. 밝은 영역 조사 동안, 제 1비임(144A)은 반도체 웨이퍼의 표면을 가격하고, 조사 경로를 따라 렌즈를 향해 반사된다. 반사된 제 1비임(144A)은 준반사 미러를 통과하여, 예컨대 CCD(Charge Coupled Device)와 같은 이미징 유닛에 의해 수용된다. 이미징 유닛은 제 1비임(144A)을 수집하고, 반도체 웨이퍼의 선택된 부분을 나타내는 밝은 영역 이미지를 형성한다. 그렇지만, 어두운 영역 조사 동안, 제 2비임(144B)의 경사각은 통상적으로 웨이퍼 검사 시스템의 렌즈를 통과하지 않는 반사된 제 2비임(144B)을 형성한다. 그렇지만, 반도체 웨이퍼의 표먼 상에 존재하는 입자 또는 투명한 증착층 내에 매설된 입자는 제 2비임(144B)을 산란시키고 렌즈를 향해 반사된다. 반사된 제 2비임(144B)은 렌즈에 의해 조준되고, 준반사 미러를 통과한다. 이미징 유닛은 또한 제 2비임(144B)을 수집하고, 반도체 웨이퍼의 선택된 부분의 어두운 영역 을 형성한다. 이미징 유닛은 이미지를 필터링하기 위한 필터(156, 도시되지 않음)을 포함할 수 있다. 특히, 이 미징 유닛에 포함된 필터는 예컨대 광영역 선택기에 사용된 분극 필터에 대응한다. 예컨대, 특별한 형태의 분극 필터가 제 1비임(144A)을 발생시키기 위해 사요될 때, 밝은 영역 이미지를 형성하기 위해 유사한 분극 필터가 이미징 유닛에 의해 사용된다. 유사하게, 특별한 형태의 분극 필터가 제 2비임(144B)을 발생시키기 위해 사용될 때, 대응하는 분극 필터는 어두운 필터 이미지를 형성하기 위해 이미징 유닛에 의해 사용된다. 광영역 선택기가 칼라 필터의 형태인 경우, 이미징 유닛은 바 람직하게는 칼라 CCD가 되도록 선택된다. 종래의 칼라 CCD가 파랑, 초록, 및 빨강에 대한 개별적인 출 력을 제공하기 때문에, 이는 고유의 필터링 작용은 수행할 수 있다. 예컨대, 조사 선택기의 밝은 영역 필터가 초록/파랑이고, 어두운 영역 필터가 빨강인 경우, CCD의 초록/파랑 출력은 밝은 영역 이미 지를 형성하는 반면, CCD의 빨강 출력은 어두운 영역 이미지를 형성할 것이다. 전술한 바와 같이, 필터 의 사용은 밝은 영역 및 어두운 영역 조사 모두를 사용하여 이미지를 용이하게 분리할 수 있도록 한다. 도 1에 도시된 바와 같이, 웨이퍼 검사 시스템은 또한 주사식 전자 현미경(SEM)과 같은 입자 비임 이미징 시스템을 포함하고 있다. SEM 및 높은 해상도에서의 이들의 사용은 이미 공지되어 있으므 로, 여기서는 상세하게 기술하지 않을 것이다. SEM은 전자총 및 예컨대 대략 60°의 저착색 원뿔형 목적물 렌즈(도시되지 않음)를 갖춘 전자 광학 칼럼을 포함하고 있다. 전자총 및 전 자 광학 칼럼은 입자 비임(즉, 전자 비임)을 형성한다. 전자 비임은 전자 비임 축선을 따라 주사되고 촛점으로 수렴한다. 전자는 일반적으로 조사될 샘플로 주사되어서, 샘플을 관통하고 2차 후방산란 전자를 발생시킨다. 검출기(도시되지 않음)는 이후 샘플의 이미지를 발생시키기 위해 2차 후 방산란 전자를 수집하기 위해 사용된다. 16-4공개특허특2001-0007394도 1에 도시된 웨이퍼 검사 시스템은 반도체 웨이퍼에 대해 이미 작도된 결함을 확인하고 분 류하기 위해 사용된 검사 공정을 현저하게 간략화시킨다. 예컨대, 검사 공정 동안, 반도체 웨이퍼 상의 잠재 결함을 신속하게 확인하고 웨이퍼 결함 지도를 형성하기 위해 검사 현미경이 사용된다. 검사 현미경은 속도 및 검출 감도 모두가 최적화되어야 한다. 결과적으로, 비교적 저해상도(즉, 큰 픽셀 크 기 또는 비임폭)이 사용되어야 한다. 생성된 결함 지도는 잠재 결함의 위치를 확인하기 위한 좌표의 리 스트를 포함한다. 그렇지만, 작도된 잠재 결함의 좌표의 정확성은 반도체 웨이퍼를 신속하게 주사 하기 위해 사용된 큰 관찰 영역에 기인하여 정확하지 못하다. 예컨대, 결함이 큰 스폿 크기를 사용하여 위치될 때, 스폿 크기 내에서 결함이 실제로 위치된 지점을 알 수 없으므로, 결함은 용이하게 재검출될 수 없다. 필수적으로, 종래의 웨이퍼 검사 시스템에 의해 발생된 결함 지도는 반도체 웨이퍼를 주 사하기 위해 사용된 스폿의 좌표를 작도한다. 따라서, 단지 SEM을 사용하는 검사 기구를 사용하여 결함 을 신속하게 재출하는 것은 어렵다. 그렇지만, SEM 이미징 시스템은 콘트라스트 대 노이즈비가 낮은 문 제점이 있다. 따라서, 결함 위치가 부정확하게 나타나는 큰 관찰 영역이 사용될 때, 작은 결함은 거의 검출되지 않을 것이다. 도 1에 도시한 본 발명의 실시예에 따라서, 결함 지도의 발생을 이미 탐지하고 있는 반도체 웨이퍼 는 스테이지상에 놓여지고 먼저 광학 현미경을 사용해서 검사된다. 광학 현미경은 잠재 적인 결함의 위치에 대응하는 좌표를 수용하고 이런 위치들을 검사하여 결함의 존재를 확인한다. 이런 과정에 따라서, 잠재적인 결함을 함유하는 영역만이 검사된다. 양호하게, 광학 현미경은 결정 지도 를 생성하는 탐지 과정 동안에 사용된 조사 형태와 유사한 조사 형태(illumination type)를 사용한다. 예를 들어, 대부분의 결함 지도는 어두운 영역 조사를 사용하는 탐지 현미경을 사용함으로써 발생된다. 따라서, 본 발명의 웨이퍼 검사 시스템의 광학 현미경내의 어두운 영역 조사를 사용하면 결함 지도로부터의 잠재적인 결함이 재검출되어지는 가능성이 증가한다. 본 발명의 광학 현미경은 양호 하게 결함 지도를 발생하는데 사용된 탐지 현미경보다 매우 높은 해상도를 포함한다. 그러므로, 결함이 한번 확인되면, 정확한 좌표는 웨이퍼 검사 시스템으로 결정될 수 있다. 상술한 바와 같이, 본 웨이퍼 검사 시스템의 스테이지는 제각기 X 및 Y 축선을 따라서 스테이지를 이동하는 기능을 하는 제 1 및 제 2 모터식 베이스(126,128)를 포함한다. 따라서, 한 결함 위치가 광학 현미경을 사용해서 발견되고 정확한 좌표가 그 위치에서 결정되면, 이런 좌표는 제 1 및 제 2 모터 식 베이스(126,128)의 이동을 제어하는데 사용되어 SEM의 광학 축선에 반도체 웨이퍼를 정렬한다. 광학 현미경이 탐지 현미경보다 높은 해상도를 가지므로, SEM의 광학 축선에 대해 서 결함이 위치설정되어지는 정확도는 크게 개선된다. 이러한 개선으로, 결함은 정상적으로 SEM의 검사 영역내에 위치설정될 것이므로, 결함을 배치하기 위해서 반도체 웨이퍼의 확장된 서치의 필요 성을 제거한다. 본 발명의 한 실시예에 따라서, 광학 현미경내에 사용된 조사원은 밝은 영역 조사를 발생하기 위해서 비임만이 생성하도록 형상되어 있다. 이런 실시예에 따라서, 라이트 영역 선택기는 정 상적으로 편광자 또는 칼라 필터의 형태를 사용하고 있다. 변경적으로, 밝은 영역 조사를 발생하기 위한 규정된 스폿 크기를 가진 레이저가 사용될 수 있다. 다음으로, 레이저와 같은 제 2 조사원은 웨이 퍼 검사 시스템의 진공 챔버 외측에 배치되어 있다. 제 2 조사원은 보조 윈도우를 통해서 반도체 웨이퍼의 선택된 부분에 보조 비임을 안내하도록 위치설정되어 있다. 더욱이, 보조 비임은 상술한 바와 같이, 경사 각으로 안내된다. 이런 장치는 더욱이 제 1 조사원로부 터 반도체 웨이퍼의 선택된 부분에 제 2 비임(144B)을 안내하는 굴절 미러의 필요성을 제거한 다. 제 2 조사원으로부터 나온 보조 비임이 반도체 웨이퍼의 표면을 치면, 정상적으로 반사되어 광학 윈도우를 통과하지 않는다. 그러나, 상술한 바와 같이, 반도체 웨이퍼의 표면 상에 또는 근방에 있는 약간의 입자의 존재는 렌즈에 다시 반사되어 이미징 유닛에 의해 영상 화되는 분산 광(scattered light)을 만들 것이다. 제 2 조사원은 또한 두 타겟을 달성하는데 도움 을 주는 다수의 광원일 수 있다. 먼저, 작은 입자로부터의 분산 광의 량은 증가될 수 있다. 다음으로, 다수의 광원은 증착층(결함이 없는)상에 큰 금속 결정립으로부터 방향성 분산을 여과할 수 있으며, 작은 결함으로부터의 광 분산이 대개 보다 균일하게 분산되면 광원은 한 방향으로 광을 주로 분산한다. 여러 조사 방향으로부터 발생된 이미지를 비교함으로써, 결정립이 실질적으로 여과될 수 있다. 이들 광원은 한 번에 한번 전환되든지 또는 여러 칼라일 수 있다. 이전의 예에서와 같이, 제 1 및 제 2 조사원(136,168)으로부터 제공된 광은 밝음과 어두움 영역 이미지사이를 구별할 수 있도록 여러 특성이 주어질 수 있다. 예를 들어, 제 1 조사원으로부터 나온 광이 청색/녹색으로 여과되고 조사원 에서 나온 광은 적색이며, 그 다음에 CCD의 다양한 칼라 출력은 밝음 및 어두운 영역 이미지를 동시에 얻는데 사용될 수 있다. 본 발명의 웨이퍼 검사 시스템은 CMP 층과 같은, 또한 반도체 웨이퍼의 투명한 절연층내에 또 는 아래에 매립되어 있는 입자를 검출할 수 있는 능력을 증가한다. 도3은 반도체 웨이퍼의 일부분 및 입자의 예시 위치를 도시한다. 반도체 웨이퍼는 증착과 같은 적절한 기술을 사용해서 여기 에 형성되어진 층을 포함한다. 도 2에 도시한 바와 같이, 입자는 반도체 웨이퍼상의 다 양한 위치에서 발견될 수 있다. 특히, 입자(174A)는 층의 표면상에 위치설정되며, 입자(178B)는 층내에 들어 있으며, 입자(174C)는 층 아래에 들어 있다. SEM이 광을 이용하는 광학 시스템에 투시될 수 있는 표면 아래에 깊이 매립되어 있는 입자를 검출할 수 없다는 것은 잘 알려져 있다. 더욱이, SEM을 사용해서 분류하기에 어려운 결함의 다양한 다른 형태들이 있다. 예를 들어, 층 두께의 변화는 종종 결함으로써 보고될 수 있다. 또한, SEM에 의해 사용된 전자 비임의 스폿 크기를 초과하는 큰 결함은 검출될 수 있다. 그러나, 상술한 결함 형태는 광학 검사 시스템을 사용해서 검출될 수 있다. 본 발명의 상술한 실시예에 따라서, 광학 현미경이 반도체 웨이퍼의 표면상의 결함의 위치를 알아내면, 동일한 결함은 SEM에 의해서 계속적으로 검사되어 가능하게 분류될 것이다. SEM이 광학 현미경에 의해 보고된 좌표의 부근내의 결함의 위치를 알아낼 수 없다면, 결함은 다시 광학 16-5공개특허특2001-0007394현미경을 사용해서 검사된다. 예를 들어, 어두운 영역 조사를 사용하는 영역의 검사가 결함의 존재 를 확인하고, 그리고 나서 밝은 영역 조사가 높은 확대하에서 사용될 수 있어 결함을 보고 결함이 반도 체 웨이퍼의 표면 아래에 매립된 입자의 형태인지를 확인한다. 광학 현미경과 입자 비임 이미징 시스템의 조합의 장점이 결함의 재검출에 대해서 기술하였을지라도, 다 양한 추가의 장점을 얻을 수 있음을 생각할 수 있다. 예를 들어, 본 발명의 장치는 또한 결함 분류에 대 한 장점을 가진다. 특히, 어플라이드 머티어리얼스사로부터 이용가능한 SEM Vision과 같은 SEM 검사 시 스템은 위치된 결함을 검사하고 이들을 특정 결함류로 분류한다. SEM Vision에서, 전자 컬럼에 의해 얻 어진 이미지는 컴퓨터 시스템내에서 분석되어 규정된 결함류를 결정한다. 그러나, 상술한 바와 같이, 결 함이 CMP층과 같은 층내에 매립되면, SEM 기초 이미지를 사용해서 결함을 분류하는 것은 어려울 것이다. 유사하게, SEM 기초 이미지를 사용해서 결함을 분류하는 것이 어려운, 두께의 작은 변화는 광학 이미지 내의 칼라 변화로서 나타날 수 있다. 그러므로, 본 발명의 한 실시예에 따라서, 컴퓨터 시스템은 SEM Vision에서 했던 것과 같이, SEM에 연결되고, 또한 이미징 유닛(도 1에 도시한 바와 같이)에 연결되어 있다. 컴퓨터 시스 템은 전자-베이스 이미징 유닛으로 볼수 없는 결함을 자동적으로 검사하기 위한 광학 이미지 를 사용한다. 이런 실시예에 따라서, 이미징 유닛은 컴퓨터 시스템로 전달되어지는 디지탈 데 이터(즉, 디지탈 이미지)로 해상 이미지를 전환한다. 컴퓨터 시스템은 디지탈 이미지를 검사하고 이의 특성을 분석하여 결함이 특정 결함류에 할당하도록 한다. 도 4는 본 발명의 변경 실시예에 따라서 구성된 웨이퍼 검사 시스템을 도시한다. 도 4의 웨이퍼 검 사 시스템은 도 1에 도시한 시스템의 성분을 대부분 포함하며, 그러므로 이런 성분은 더 이상 상세 하게 설명하지 않겠다. 도 4의 웨이퍼 검사 시스템은 반도체 웨이퍼의 표면과 SEM의 광 학 축선을 자동적으로 정렬하는 활성 광학 촛점 시스템을 포함하는 점에서 도 1과 다르다. 더욱이, 웨이퍼 검사 시스템은 회전 축선 둘레로 스테이지를 회전하기 위한 피봇 기구를 포 함한다. 따라서, 본 발명의 웨이퍼 검사 시스템은 다양한 각도에서 반도체 웨이퍼를 볼 수 있 다. 변경적으로, 전자 컬럼은 미국 특허 제 5,329,125 호에 기술한 바와 같이 경사지게 할 수 있 다. 도 4를 참조하면, 웨이퍼 검사 시스템은 진공 챔버, 스테이지, 광학 현미경, 이미 징 유닛, 입자 비임 이미징 시스템 및 변환 시스템을 포함한다. 스테이지는 반도체 웨이퍼이 위치될 수 있는 플랫폼으로써 형상되어 있다. 스테이지는 예를 들어 X-Y 평면을 따 라서, 반도체 웨이퍼의 위치를 조정하기 위한 제 1 및 제 2 모터식 베이스(426, 428)를 포함한다. 웨이퍼 검사 시스템은 스테이지의 수직 위치를 변경하기 위한 하나 이상의 수직 변위 유닛을 포함한다. 각 수직 변위 유닛은 예를 들어, 모터 또는 피에조에 의해서 작동되는 리프트(432A)를 포함한다. 도 1에 대해서 상술한 바와 같이, 수직 변위 유닛은 광학 현미경 또는 SEM에 의해 볼 때 반도체 웨이퍼의 이미지를 촛점맞추는데 도움을 주지만, 다른 종래의 촛점 기구에 의해 교체될 수 있다. 광학 현미경은 조사원, 준반사 밀러, 렌즈 및 편향 미러(도시 생략)를 포함한다. 조사원은 다시 고정식 또는 가변식 스폿 크기의 비임을 생성할 수 있다. 도 1의 실시예와 유 사하게, 비임 확장기는 비임의 스폿 크기를 증가하는데 사용될 수 있다. 준반사 미러는 조사원에 의해 출력된 비임이 웨이퍼의 표면을 치고 X-Y 평면에 거의 수직인 조사 통로를 따 라서 반사되도록 위치설정된다. 조사원에는 예를 들어, 밝은 영역 조사, 어두운 영역 조사 또는 양자 모두와 같은, 다양한 광영역 의 선택을 허용하는 광영역 선택기가 제공될 수 있다. 도시의 목적으로, 단지 하나의 비임가 도시되어 있다. 상술한 바와 같이, 밝은 영역 조사가 사용되면, 비임은 준반사 미러로부터 반 사하며 렌즈를 통과하며, 반도체 웨이퍼의 표면상에 촛점맞추어진다. 밝은 영역 조사 동안, 비임은 반도체 웨이퍼의 표면을 치고 조사 통로를 따라서 렌즈를 향해 다시 반사된다. 반사된 비임은 준반사 미러를 통과하고 예를 들어, CCD와 같은 이미징 유닛에 의해 수용된다. 이미징 유닛은 비임을 수집하고 반도체 웨이퍼의 선택된 부 분을 나타내는 밝은 영역 이미지를 발생한다. 누구나 알 수 있듯이, 어두운 영역 조사는 도 1에 대해서 기술한 동일한 방법으로 작동한다. 이미징 유닛은 이미지들을 형성하기 위해 광영역 선택기에 사용되는 필터에 대응하여, 필터( 도시되지 않음)를 포함하도록 형성된다. 예를들어, 음극 및 양극의 필터들(도시 안됨)은 밝은 영역 및 어두운 영역 이미지들을 형성하는데 사용될수 있다. 또한, 이전에 기술된바와 같이, 칼라 CCD가 사용될 수 있다. 컴퓨터 시스템이 반도체 웨치퍼의 선택된 부분에서 탐지된 결함을 자동적으로 조사 하고, 상기 결함을 위한 특정의 결함 글라스를 지정하는 이미징 유닛에 연결될수 있다. 웨이퍼 검사 시스템은 입자 비임 이미징 시스템(예를들어, SEM)을 포함한다. 상기 SEM은 전자총과, 낮은 색채의 거의 60°의 원뿔형 대물렌즈를 갖는 전자 광학 칼럼을 포함한다. 상 기 전자총 및 전자 광학 칼럼은 전자 비임을 형성한다. 전자 비임은 전자 비임 축선을 따라 이동하며 촛점 포인트에 모아지게 된다. 포커싱 시스템은 포커싱 미러, 반사 미러, 이미지 위치 탐지기, 및 Z-축선의 제어기를 포함한다. 포커싱 시스템은 포커싱 미러에서 포커싱 비임을 항하게 하는 조사 원을 이용한다. 도 4에 도시된바와 같이, 포커싱 미러는 조사 통로를 따라 위치되며, SEM의 촛점 포인트를 항해 포커싱 비임을 항하게 된다. 포커싱 미러는 도 4에 도시 된 위치로 부터 이동가능하게 형성된다. 상세히 기술하면, 광학 현미경을 사용하는 반도체 웨이퍼 의 조사중에, 포커싱 미러는 조사원으로 부터의 비임이 반도체 웨이퍼의 표면상에 형성되도록 이동된다. 반도체 웨이퍼가 SEM에 의해서 조사되도록 이동될때, 포커싱 미러 16-6공개특허특2001-0007394는 도 4에 도시된 바와 같이 자동적으로 위치된다. 다양한 다른 형상이 포커싱 미러의 사용을 용이 하게 하는데 이용될수 있다. 반사 미러는 곡률중심이 SEM의 촛점 포인트에 형성되고 위치설정된다. 포커싱 비임 이 SEM의 촛점 포인트를 통해 통과할때, 제 1 경사 포인트에서 반도체 웨이퍼의 표면을 타격한다. 이때, 포커싱 비임은 반사 미러를 향하게 되며, 반도체 웨이퍼의 표면에 되돌 아오게 된다. 반사된 포커싱의 비임들은 제 1 경사 포인트에 인접한 제 2 경사 포인트에서 반도체 웨이퍼의 표면과 충돌하게 된다. 상기 포커싱의 비임은 이미지가 이미징 유닛에 의해서 해소되도록 반-반사 미러를 통해 포커싱 미러를 통해 반사된다. 이미징 유닛에 의해서 해결되 는 이미지는 이미지 위치 탐지기에 출력되며, 기준 프레임과 비교된다. 예를들어 기준 프레임 은 목적물이 SEM(의 촛점 포인트에 정확히 위치될때, 포커싱의 비임의 위치에 대응할수 있다. 이때. 이미징 유닛으로 부터 수용되는 이미지는 SEM(의 촛점 포인트에 위치되었는 지를 결정하기 위해 기준 프레임에 비교된다. 도 5에는, 이미지 위치 탐지기가 본 발명의 바람직한 실시예에 따른 웨이퍼 검사 시스템에 능 동적으로 포커싱되는 방식이 도시되어 있다. 상기 이미지 위치 탐지기는 이미징 유닛으로 부 터 반도체 웨이퍼의 일부에 대응하는 포커싱 이미지를 수용한다. 포커싱 이미지는 이미 지 위치 탐지기의 기준 프레임위로 중첩된다. 이때, 이미지 위치 탐지기는 기준 프레임과 포커싱 이미지의 에지사이의 차이가 있는지를 결정한다. 이러한 차이는 SEM의 촛점 포인트 및 반도체 웨이퍼의 표면사이의 거리에 대응한다. 포커싱 이미지가 기준 프 레임에 정렬된다면, 반도체 웨이퍼는 SEM의 촛점 포인트에 정확히 위치된다. 기준 프레임 및 포커싱 이미지사이의 거리는 Z축선 제어기에 전송되는 촛점의 편차에 대 응된다. Z축선 제어기는 반도체 웨이퍼 및 반사 미러의 위치를 조정하기 위해 수직 변위 유닛의 모터를 작동하는 제어 전압을 발생하도록 촛점 편차를 이용한다. 이러한 공정은 이미 징 유닛으로 부터 수용되는 포커싱 이미지가 기준 프레임에 정확히 정렬되는 것을 이미 지 위치 탐지기가 결정할때 까지 반복된다. 이러한 실시예에 따르면, 반도체 웨이퍼의 선택된 위치가 포커싱된 이미지를 발생하기 위해 SEM에 의해 해상되는 숫자가 크게 감소된다. 정상작동중에, 반도체 웨이퍼는 표면이 SEM의 촛점 포인트와 적당히 정렬되는 것이 결정 될 때까지 포커싱 시스템를 이용하여 조정된다. 반도체 웨이퍼의 선택된 부분은 SEM을 이용하 여 조사되며, 미세한 촛점의 조정이 이루어진다. 도 4에 도시된 본 발명의 실시예에 따르면, 보조 리프 트(432B)는 수직 변위 유닛의 일부로 구성되며, 모터에 의해서 제어가능하다. 이러한 실시예 에 따르면, 보조 리프트(432B)의 작동은 반사 미러의 곡률 중심이 SEM의 촛점 포인트에 항상 있도록 리프트(432A)와 정확히 동시에 움직인다. 본 발명의 다른 실시예에 따르면, 조사원은 광학 현미경에 의해서 결함의 조사를 위해 밝은 영역 및 어두운 영역을 발생하는데 단독으로 사용된다. 레이저는 포커싱 비임으로서 이용되는 본래 의 비임을 발생하기 위해 대부분 제공된다. 이러한 실시예는 포커싱 미러를 필요없게 한다. 대신에 다수의 비임 스플리터는 반도체 웨이퍼의 표면을 항해 포커싱 비임에 바로 이용된다. 상 기 비임 스플리터는 레이저에 의해서 발생된 포커싱 비임을 반사하도록 구성되지만, 조 사장치로 부터비임을 통과시키기도 한다. 자동-촛점 센서가 반사된 포커싱 비임를 수용하기 위해 제공되어, 반도체 웨이퍼의 선택된 부분이 SEM의 촛점 포인트에 위치설정 되는지를 결정한다. 상기 자동-촛점 센서는 수직 변위 시스템의 제어 작동을 위해 이미징 유 닛 및 이미지 위치 탐지기에 이미지를 제공하도록 구성된다. 선택적으로, 수직 변위 시스템은 Z-축선을 따라 스테이지를 소정의 포인트로 위치설정하도록 구성될수 있다. 자동 촛 점 센서는 소정의 포인트 각각에 결함의 이미지를 조사하도록 구성되며, 이미징 유닛에 최적 으로 포커싱되는 이미지를 선택한다. 정상작동중에, 반도체 웨이퍼는 표면이 SEM의 촛점 포인트와 적당히 정렬되는 것이 결정 될때 까지 포커싱 시스템를 이용하여 조정된다. 반도체 웨이퍼의 선택된 부분은 SEM을 이용하 여 조사되며, 미세한 촛점의 조정이 이루어진다. 도 4에 도시된 본 발명의 실시예에 따르면, 보조 리프 트(432B)는 Z-축선을 따라 반사 미러를 이동하도록 제공된다. 상기 보조 리프트(432B)는 수직 변위 유닛의 일부로 구성되며, 모터에 의해서 제어가능하다. 이러한 실시예에 따르면, 보조 리프트(432B)의 작동은 반사 미러의 곡률 중심이 SEM의 촛점 포인트에 항상 있도록 리프 트(432A)와 정확히 동시에 움직인다. 본 발명의 다른 실시예에 따르면, 조사원은 광학 현미경에 의해서 결함의 조사를 위해 밝은 영역 및 어두운 영역을 발생하는데 단독으로 사용된다. 레이저는 포커싱 비임으로서 이용되는 본래 의 비임을 발생하기 위해 대부분 제공된다. 이러한 실시예는 포커싱 미러를 필요없게 한다. 대신 에, 비임 스플리터는 반도체 웨이퍼의 표면을 항해 포커싱 비임에 바로 이용된다. 상기 비임 스플리터는 레이저에 의해서 발생된 포커싱 비임을 반사하도록 구성되지만, 조사장 치로 부터 비임을 통과시키기도 한다. 자동-촛점 센서가 반사된 포커싱 비임를 수 용하기 위해 제공되어, 반도체 웨이퍼의 선택된 부분이 SEM의 촛점 포인트에 위치설정되 는지를 결정한다. 상기 자동-촛점 센서는 수직 변위 시스템의 작동을 제어하기 위해 이미징 유닛 및 이미지 위치 탐지기에 이미지를 제공하도록 구성된다. 선택적으로, 수직 변위 시스 템은 Z-축선을 따라 스테이지를소정의 포인트로 위치설정하도록 구성될수 있다. 자동 촛점 센 서는 소정의 포인트 각각에 결함의 이미지를 조사하도록 구성되며, 이미징 유닛에 최적으로 포커싱되는 이미지를 선택한다. 도 6에는, 본 발명의 실시예에 따라 제조된 웨이퍼 검사 시스템을 이용하여 반도체 웨이퍼의 조사 중에 수행되는 공정을 설명하는 프로우차트가 도시되어 있다. 상기 공정에서, 단계(S600)에서, 반도체 웨이퍼는 스테이지 위해 놓여지며, 적절히 장착된다. 단계(S610)에서, 반도체 웨이퍼는 웨이퍼 검사 시"}
{"patent_id": "10-2000-0032956", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 2, "content": "16-7공개특허특2001-0007394스템의 좌표시스템에 정렬된다. 본 기술분야에서 공지된바와 같이, 이러한 정렬은 종래의 예비-정렬기 및 다른 정렬 매카니즘을 이용하여 이루어질수 있다. 단계(S612)에서, 웨이퍼의 결함 지도를 경감하는 제 1 탐지위치가 웨이퍼 검사 시스템(400. 예를들어 스테이지 좌표)의 좌표시스템에 병진이동된다. 자동 화된 제 1 및 제 2 베이스들은 선택된 결함이 광학 현미경에 의해서 동일시 되도록 웨이퍼를 위치설정하 는데 이용된다. 단계(S614)에서, 결함은 웨이퍼 검사 시스템에 의해서 다시 탐지된다. 상세히 기술하면, 탐지는 어두운 영역의 조사를 이용하여 광학 현미경에 의해서 조사되며, 이러한 조면방식은 웨이퍼 결함 지도를 형성하 는데 사용되는 조사기구에 의해서 이루어진다. 단계(S616)에서, 광영역 선택기는 영역 조사를 밝게하기 위해 어두운 영역 조사으로 부터 스위치하는데 이용된다. 단계(S618)에서, 결함의 좌표들은 스테이지 좌 표를 이용하여 업테이트된다. 점선을 사용하여 나타난바와 같이, 결함은 단계(S620)에서 어두운 영역 및 밝은 영역조사를 사용하여 재검토된다. 상술된바와 같이, 상기 재검토는 색채 또는 극성 필터들과 같은 다양한 필터들을 이용하는 것이 용이하다. 단계(S622)에서, 조사될 추가의 결함이 있는지를 결정한다. 추가의 결함이 있다면, 단계(S624)에서 상기 결함의 조사를 위해 스테이지가 위치된다. 이때, 단계(S614)로 되돌아가게 된다. 추가의 결함이 없다면, 단계 S626로 진행하게 된다. 단계(S626)에서, 결함의 위치는 SEM과 정렬된다. 이것은 결함이 SEM의 광 축선에 거의 정렬되도록 제 1 및 제 2 자동화된 베이스가 이동하는 스테이지 좌표를 이용함으로써 달성된다. 필요한 경우, SEM을 이 용하여 보았을 때 반도체 웨이퍼의 이미지를 포커싱시키기 위하여 스테이이지의 높이가 단계(S628)에서 조정될 수 있다. 본 발명의 특정한 실시예에 따라, 자동 포커싱 장치는 스테이지의 위치를 조정하기 위 하여 이용될 수 있다. 이 같은 상기 케이승스인 경우, 그때 제어부는 스테이지의 높이가 자동적으로 제 어되는 블록을 제어하기 위하여 통과한다. 단계(S630)에서, 결함이 분류된다. 이 단계는 결함을 검사하기 위하여 컴퓨터 시스템의 이용에 대응하 며, 예정된 결함 타입과 비교하며, 결함을 분류한다. 결함이 SEM 기초 이미지(SEM-based image)에서 명 백한 경우, 분류는 SEM 기초 이미지를 배타적으로 이용하여 수행될 수 있다. 그러나, 결함이 분류에 대 해 명백하지 않은 경우, 광 이미지는 분류를 수행 또는 강화하기 위하여 이용될 수 있다. SEM 기초 이 미지만을 이용한 분류가 불충분한 것이 결정되었을 때 광 이미지는 단계, 또는 단계후 얻을 수 있다. 단계(S632)에서, 검사하기 위하여 남아 있는 임의의 추가적 결함이 있는지 결정된다. 추가적 결함이 있는 경우, 그때 스테이지는 반도체 웨이퍼가 단계(S634)에서 다음 결함의 위치에서 SEM 아래 배 치되도록 이동하며, 제어부는 단계(S626)으로 복귀된다. 그러나 추가적 결함이 없는 경우, 그때 재검사 공정은 단계(S640)에서 종결된다. 본 발명에 따른 상기 시스템은 결함 지도로부터 검사 시스템의 시스템 에러를 신속히 제거하기 위하여 이용될 수 있다. 특히, 재감지되는 결함의 수는 단계(S622)에서 카운트된다. 상기 수가 예정된 수에 도달할 때, 즉 재감지된 결함의 좌표 업데이트가 통상적인 변화를 찾기 위하여 검사된다. 예를 들면, 모든 좌표가 특별한 회전, 알파 및 이동(translation; dx, dy)에 대해 교정되는 경우, 그때 이것은 시스 템 에러에 귀착되며 특별한 결함 지도에서 모든 결함의 좌표는 회전 에러에 대해 교정된다. 회전 및 이 동 오프셋은 동일한 검사 기구로 검사되는 웨이퍼를 위하여 다시 저장 및 이용될 수 있다. 검사 기구 ID는 재검사 기구로 전달되는 정보의 부분이며 그럼으로써 측정된 시스템 에러는 특정된 검사 기구와 관 련될 수 있다. 도 7은 검사 기구에 의하여 생성된 결함 오프셋이 본 발명의 웨이퍼 재검사 시스템에 의하여 교정되는 방식이 도시된 흐름도이다. 단계(S700)에서, 반도체 웨이퍼는 스테이지상에 배치되며, 결함의 위치에 대응하는 데이터(즉, 결함 지도)는 웨이퍼 재검사 시스템으로 전달된다. 전술된 바와 같이, 결함 지도 는 검사 기구에 의하여 미리 확인된 잠재적 결함의 좌표를 포함한다. 또한 웨이퍼 검사 시스템으로 전 달되는 데이터는 반도체 웨이퍼를 위한 결함 지도를 생성하기 위하여 이용되는 검사 기구를 확인하는 검 사 기구 ID를 포함한다. 단계(S710)에서, 반도체 웨이퍼는 웨이퍼 재검사 시스템의 좌표 축선에 예비 정렬된다. 결함 오프셋(즉 결함 카운트)를 결정하기 위하여 이용되는 결함의 수는 단계(S712)에서 한정된다. 단계(S714)에서, 웨 이퍼 재검사 시스템은 제 1 결함을 재감지한다.(즉, 예를 들면 광학 현미경을 이용하여) 단계(S716)에 서, 결함이 성공적으로 재감지되었는지 여부를 결정한다. 결함이 성공적으로 재감지되지 않은 경우, 그 대 제어부는 단계(S714)로 복귀되는데, 단계(S714)에서는 예를 들면 결합된 밝은 영역 및 어두운 영역 조사와 같은 추가적 시도가 결함을 재감지하기 위하여 적용된다. 결함이 성공적으로 재감지된 경우, 그 때 제어부는 단계(S718)를 통과하며, 단계(S718)에서는 결함 좌표가 웨이퍼 재검사 시스템의 좌표에 대 해 상대적으로 업데이트된다. 단계(S720)에서, (단계 S712에서 선택된) 감지 카운트에 대응하는 감지의 수가 재감지되는지 여부를 결 정한다. 재감지된 결함의 수가 결함 카운트보다 적은 경우, 그때 제어부는 결함 지도에서 다음 결함이 재감지되는 단계(S714)로 복귀된다. 개감지된 결함의 수가 감지 카운트와 동일한 경우, 그때 제어부는 단계(S722)로 통과한다. 단계(S722)에서, 결함 오프셋은 반도체 웨이퍼를 위해 계산된다. 전술된 바와 같이, 결함 오프셋은 겸사 기구의 시스템 에러에 귀착되는 회전 및 이동 변위의 전형이다. 이 같은 일 실시예에 따라, 결함 오프셋이 계산될 때, 이 같은 오프셋은 반도체 웨이퍼를 위한 남아있는 모든 결함 위치에서 시스템 에러를 교정하기 위하여 적용된다. 특히, 시스템 에러에 대한 교정은 대응 하는 검사 시스템 ID과 함께 컴퓨터에서와 같은 메모리부에서 지속된다. 또한, 동일한 검사 기구 가 다중 반도체 웨이퍼를 위한 결함 지도를 생성하기 위하여 이용되는 경우, 그때 동일한 결함 오프셋은 메모리부로부터 교정되며 동일한 시스템 ID을 구비한 결함 지도를 가진 모든 반도체 웨이퍼에서 시스템 에러를 교정하기 위하여 적용된다. 본 발명의 실시예에 따라, 웨이퍼 재검사 시스템은 현재 검사되는 반도체 웨이퍼를 위한 결함 지도를 생성하기 위하여 이용되는 특정한 검사 기구를 결정하기 위하여 전달 된 데이터를 포함하는 검사 기구 ID를 검사할 수 있다. 검사 기구 ID가 결함 오프셋이 계산되는 결함 지도를 생성하기 위하여 이용되는 검사 기구의 검사 기구 ID와 정합된다면, 그때 동일한 결함 오프셋이 16-8공개특허특2001-0007394현재의 반도체 웨이퍼에 포함된 시스템 에러를 교정하기 위하여 적용될 수 있다. 이 같은 일 실시예는 결함 오프셋이 동일한 검사 기구에 의하여 검사되는 개별적인 반도체 웨이퍼 또는 다중 반도체 웨이퍼가 계산되어야 하는 때의 수를 최소화시키는 장점을 가진다. 도 8은 본 발명의 또 다른 특별한 방법의 흐름도이다. 특히, 이 실시예에 따라, 본 발명의 시스템은 결 함에 대하여 기판을 검사하기 위하여 이용될 수 있다. 즉, 임의의 공정 결함이 현재의 광학 시스템에 의하여 감지가능하지 않다는 것은 공지되어 있다. 그러므로, 미국 캘리포니아의 샌어제어 소재의 KLA에 의하여 판매되는 에스이엠스펙(SEMSpec) 시스템과 같은 시스템은 광학 검사 시스템을 이용하여 감지될 수 없는 결함을 감지하기 위하여 전체 웨이퍼를 전자 비임으로 스캔하기 위하여 이용된다. 에스이엠스 펙 시스템은 미국 특허 출원 제 5,578,821호 및 제 5,502,306호에 상술된다. 그러나, 에스이엠스펙은 매우 비싸며 매우 느린 시스템이므로 하루에 하나 또는 두개의 웨이퍼만을 스캔할 수 있다.(광학 시스템 에 의하여 시간당 30 내지 60개의 웨이퍼를 감지하는데에 반하여) 도 8에 도시된 실시예는 현재 이용된 느 것보다 더 낮은 비용 및 더 빠른 스캔률에서 매우 빠른 전자 비임에 기초한 검사 시스템을 제공한다. 본질적으로, 도 8의 실시예는 기판의 전자 비임에 기초한 스캔닝을 수행하며 결함을 감지 하기 위하여 지적인 선택(intelligent selection)을 이용한다. 즉, 회로 설계자는 결함을 가지도록 손상된 회로상의 영역이 있는 장소를 일반적으로 안다. 예를 들면, 밀집 패턴을 가지는 영역, 많은 접촉공을 가진 영역, 라인의 브리징을 가지는 가능성으로 서로 밀접한 많은 전도 라인을 가지는 영역 등이다. 정보를 이용하 여, 설계자는 주의깊게 검사되어야 하는 회로, 즉 웨이퍼상의 영역이 지적으로 선택될 수 있다. 정보를 이용하여, 설계자는 단계에 예시된 바와 같이, 스캔되는 영역에 대한 좌표를 설정할 수 있다. 바 람직한 실시예에서, 이것은 \"인공적인\" 또는 \"합성의\" 결함 지도를 작성함으로써 달성된다. 즉, 결함을 가지는 것으로 의심되는 스캔되는 영역은 상기 영역들을 검사하기 위하여 시스템을 명령하는 인공적인 결함 지도를 작성함으로써 한정된다. 시스템이 세트 스캔 영역, 또는 인공적인 결함 지도를 수용할 때, 광학 현미경의 우선적으로 동작하는, 즉 접합부에서 통로 \"예\"를 선택하는 동작, 또는 입자 현미경으로 직접 스캐닝하는, 즉 접합부에서 \"아니오\"를 선택하는 옵션(option)을 가진다. 통로 \"예\"가 선택된 경우, 광학 현미경은 결함 지도(단계 820)에 따라 기판을 스캔하기 위하여 이용된다. 그때, 결함 지도는 광학 현미경에 의하여 생성되며, 임의의 발견된 결함(단계 830)을 나타낸다. 그후, 또는 통로 \"아니오\"가 접 합부에서 선택되는 경우, 세트 스캔 영역은 단계 840에서 입자 현미경에 의하여 스캔된다. 입자 현미경에 의하여 얻은 이미지의 다이 대 다이 비교(die-to-die comparison)를 이용하여, 새로운 결함 지 도는 컴퓨터(단계 850)에 의하여 생성된다. 다이 대 다이 비교는 예를 들면 SEM버젼에 의하여, 즉 각각의 지적된 위치에 대하여 현재 수행되는 방법에 따라 수행되며, 인접 다이상의 대응 위치가 이미지 되며, 이미지는 불일치를 감지하기 위하여 비교된다. 이 후자의 결함 지도는 입자 비임 현미경의 높은 선명도에 기초하기 때문에 매우 정확하다는 것이 인정된다. 필요한 모든 것이 결함 지도인 경우, 공정 은 여기에서 정지된다. 발견된 결함에 대한 추가적 정보가 찾아진다면, 공정은 단계으로 계속되며, 입자 현미경을 이용하 여 각각의 결함의 확대된 이미지가 얻어진다. 그때, 단계에서, 컴퓨터는 전술된 바와 같이 자동 결함 분류(ADC)를 수행할 수 있다. 비록 본 발명이 반도체 웨이퍼상의 결함의 검사에 대하여 상술되었지만, 이 같은 장치는 다양한 다른 재 료 및 표면에 관련하여 용이하게 이용될 수 있다. 예를 들면, 본 발명은 포토마스크, 자기 다스크, 광 학 디스크, 거울 등을 검사하기 위하여 이용될 수 있다. 더욱이, 본 발명은 제조 공정의 다양한 스테이 지동안 반도체 재료를 검사하기 위하여 이용될 수 있다. 특히, 본 발명은 패턴이 형성되거나 패턴이 형 성되지 않은 반도체 웨이퍼의 검사에 동일하게 응용가능하다. 본 발명은 반도체와 같은 목적물의 표면상(또는 근처)의 결함을 신속하고 정확하게 재감지하며 분류하기 위한 능력을 유용하게 제공한다. 이것은 광학 현미경 및 SEM을 포함하는 재료 재검사 시스템을 이용하 여 달성된다. 광학 현미경은 반도체 웨이퍼에 대해 결함 지도를 생성하기 위하여 이용되는 조사 영역에 유사한 조사조사조사조사 수 있도록 구성된다. 이 같은 구성은 결함의 정확하고 유효한 재감지를 허용 한다. 시스템은 모든 결함이 광학 현미경에 의하여 감지되었을 때 반도체 웨이퍼를 SEM과 정렬하기 위 하여 이동하는 이동 시스템을 포함한다. SEM은 재감지 및 분류가 되도록 결함의 높은 선명도 확대를 제 공한다. 또한 본 발명은 결함에 SEM의 촛점을 맞추기 위해 스테이지를 자동적으로 조정하는 실제적인 광학 포커싱 시스템을 제공한다. 더욱이, 피봇팅 시스템은 회전 축선에 대하여 스테이지의 회전 및 상 이한 투시(perspective)로부터 결함의 감지를 제공한다. 이 같은 구성의 하나의 장점은 광학 현미경을 이용하여 결함을 정확하게 재감지할 수 있다는 것이다. 또한, 결함이 재감지되었을 때, SEM에 의한 검사를 위하여 정확하게 배치될 수 있다. 그러므로, SEM의 관점의 제한된 영역을 이용하여 큰 영역을 임의로 찾기 위한 요구가 제거된다. 더욱이, 시스템은 특별 한 검사 시스템의 시스템 에러를 계산할 수 있으며 자동적으로 이 같은 시스템으로부터 수용된 결함 지 도로 교정을 적용한다. 본 발명의 또 다른 장점은 SEM에 의하여 이미지될 수 없는 결함을 분류할 수 있 다는 것이며, 따라서 재감지 공정동안 분류되지 않는 결함의 수를 최소화한다. 본 발명을 설명하였지만, 가장 실용적이고 양호한 실시예라 생각되는 것과 관련하여 본 발명은 전술된 실시예에 한정되지 않는 것으로 이해해야 하며, 첨부된 특허청구범위의 범주 및 사상내에 포함된 다양한 변화 및 등등한 구성을 포함하는 것으로 이해해야 한다."}
