{"patent_id": "10-2007-0120072", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2009-0053295", "출원번호": "10-2007-0120072", "출원인": "주식회사 에스원", "발명자": "안와르 애드하모비치 이마토브"}}
{"patent_id": "10-2007-0120072", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사람 얼굴 피사체에 대한 적응형 탐지, 추적, 위치 선정 및 품질 평가에 기반하는 비디오 감시방법으로서, a)최소 하나 이상의 비디오 카메라들로부터 얻은 2D 이미지에 기초한 3D 화면에 대한 원거리 정보 수집을 행하는 단계;b)보정모드로 화면 이미지를 분석하고 화면 복잡도를 평가하여 화면 모델을 형성하는 단계;c)보정 모드로 화면 모델의 품질을 평가하고 피사체 탐지 및 추적 방법 적용전략선택 결정을 수행하는 단계;d)실시간 작동 모드로 화면 모델을 고려하여 인간과 유사한 피사체를 탐지하고 관심지역 모델을 생성하는단계;e)관심지역 모델의 품질을 평가하는 단계;f)관심 지역 모델, 머리 모델, 얼굴 모델, 얼굴 정밀 모델, 추적 모델에 대한 품질 평가에 따라 사람 얼굴 피사체에 대한 탐지 및 추적 방법 적용 전략을 선택하는 단계;g)실시간 탐지 작동 모드로 다양한 수준의 위치에서 사람의 얼굴 등급을 상세 인식하면서, 피사체를 탐지하고머리 모델, 얼굴 모델, 얼굴 정밀 모델을 형성하는 단계;h)추적 피사체 모델을 형성하는 단계;i)실시간 추적 작동 모드로 피사체를 추적하는 단계;j)머리 모델, 얼굴 모델, 얼굴 정밀 모델, 추적 피사체 모델, 관심 지역 모델의 품질을 평가하는 단계;k)품질 평가 결과에 따라 여러 모델 중 최소한 한 개를 기초로, 목표로 하는 얼굴 피사체 탐지 및 추적 방법에대한 새로운 적용 전략 선택 결정을 수행하는 단계를 포함하는비디오 감시 방법."}
{"patent_id": "10-2007-0120072", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 화면 모델 형성을 위해서정적인 배경 피사체의 탐지를 이용하는비디오 감시 방법."}
{"patent_id": "10-2007-0120072", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 화면 모델 형성을 위해서정기적으로 변동하는 배경 피사체의 탐지를 이용하는비디오 감시 방법."}
{"patent_id": "10-2007-0120072", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 화면 모델 형성을 위해서, 피사체 발견 확률 평가 결과를 이용하는비디오 감시 방법."}
{"patent_id": "10-2007-0120072", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "- 3 -공개특허 10-2009-0053295제1항에 있어서,상기 화면 복잡도 평가는,입수된 노이즈 피사체 카드와, 사람얼굴 피사체 발견 확률카드에 기초하여 화면모델을 형성하기 위해 화면 복잡도를 분석하는비디오 감시 방법."}
{"patent_id": "10-2007-0120072", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 피사체 발견 및 추적방법에 대한 초기 적응및 선택은 화면 모델 평가를 이용하여 수행되는비디오 감시 방법."}
{"patent_id": "10-2007-0120072", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,인간과 유사한 피사체를 탐지하기 위하여,인간의 신체 일부 탐지를 이용하고, 보정단계에서 제작되어 있는 화면 모델을 사용하는비디오 감시 방법."}
{"patent_id": "10-2007-0120072", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,인간과 유사한 피사체 탐지를 위하여,이전 카드에 제작된 관심 지역 모델을 이용하는비디오 감시 방법."}
{"patent_id": "10-2007-0120072", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서, 관심지역 모델의 품질을 평가할 때, 포커싱, 조명, 이미지, 변동하는 특징의 이미지, 이미지 구성 요소 뿐만 아니라, 이미지의 기하학적 특성 인자들도 고려하는비디오 감시 방법"}
{"patent_id": "10-2007-0120072", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,피사체 탐지 및 추적방법 적응과 선택은관심 지역 모델 품질 평가를 이용하여 수행되는비디오 감시 방법."}
{"patent_id": "10-2007-0120072", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서,탐지 방법 전략 선택은,초기 위치 선정 방법, 정밀 위치 선정 및 사람의 얼굴 등급의 상세화 방법, 얼굴 요소의 고정밀 위치 선정 방법의 3개의 저장소 중 최소한 한개에서 최적의 탐지 방법을 선택하여 수행되는- 4 -공개특허 10-2009-0053295비디오 감시 방법."}
{"patent_id": "10-2007-0120072", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,피사체의 초기 위치 선정 방법 저장소에는가버 변환을 이용하는 필터링 알고리즘이 포함되는비디오 감시 방법."}
{"patent_id": "10-2007-0120072", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서,피사체 정밀 위치 선정 및 사람의 얼굴 등급 구분 저장소에는,아키텍쳐 SNOW를 지닌 인공 신경망을 적용하는 것에 기초한 탐지 알고리즘이 포함되는비디오 감시 방법."}
{"patent_id": "10-2007-0120072", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서,얼굴 요소 고정밀 위치선정 방법 저장소에는,주변 탐지 방법 및 대칭 동작기에 기초한 얼굴 특징 탐지 알고리즘이 포함되는비디오 감시 방법."}
{"patent_id": "10-2007-0120072", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제1항에 있어서, 탐지 방법 전략 선택은 이전 카드에서 얻은 머리 모델, 얼굴 모델, 정밀 얼굴 모델 평가에 기초하여 수행되며,머리 위치 선정, 머리 모델 품질 평가, 얼굴 위치 선정, 얼굴 모델 품질 평가, 얼굴 요소 위치 선정, 정밀 얼굴모델 품질 평가의 방법들을 순차적으로 적용하여 달성되는비디오 감시 방법."}
{"patent_id": "10-2007-0120072", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제1항에 있어서,머리모델, 얼굴 모델, 정밀 얼굴 모델에 따라 신속하게 얼굴을 탐지하기 위해, 추적 피사체 모델이 형성된 후 다음 카드에서는 피사체들에 대해 추적 방법만 사용되는비디오 감시 방법."}
{"patent_id": "10-2007-0120072", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제1항에 있어서,추적 피사체 모델 품질 평가후,탐지 방법과 추적 방법 중에서 적용을 선택하는비디오 감시 방법."}
{"patent_id": "10-2007-0120072", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "- 5 -공개특허 10-2009-0053295사람 얼굴 피사체에 대한 적응형 탐지, 추적, 위치 선정 및 품질 평가에 기반하는 비디오 감시 시스템으로서,최소 1개 이상의 비디오 카메라로부터 3D 화면정보를 수집하는 원격 정보 수집 장치;배경 피사체 탐지, 정기적으로 변동하는 피사체 탐지, 피사체 발견 확률 카드 평가 블록, 화면 복잡도 분석 블록을 포함하는 화면의 노이즈 피사체 적응 장치상기 화면 노이즈 피사체 적응 장치의 작업 결과를 수신하고, 관심지역 포착 블록과 사람 신체 검색기 블록을포함하는 인간 유사 피사체 탐지 장치;상기 인간 유사 피사체 탐지 장치로부터의 정보를 처리하고 그 결과를 피사체 탐지 및 추적 방법 선택 장치로전송하는 모델 품질 평가 장치;사람의 머리와 얼굴 초기 위치 선정 방법 저장소, 정밀 위치 선정과 얼굴 등급 상세화 방법 저장소, 얼굴 요소고정밀 위치 선정 저장소를 포함하고,얼굴 피사체 탐지 장치로 선택된 향후 처리 전략에 대한 결정을 전송하는피사체 탐지 및 추적 방법 선택 장치;머리, 얼굴, 얼굴 요소 위치 선정 블록을 포함하고, 형성된 모델 형태로 탐지 결과를 얼굴 피사체 추적 장치로전송하는 얼굴 피사체 탐지 장치;상기 피사체 탐지 및 추적 방법 선택 장치로부터 데이터를 수신하고 추적 피사체 모델을 형성하며 추적 인자를평가하고 상기 모델 품질 평가 장치와 함께 연결되어 있는 얼굴 피사체 추적 장치를 포함하는비디오 감시 시스템.명 세 서발명의 상세한 설명 기 술 분 야본 발명은 비디오 감시 시스템 및 방법에 관한 것으로, 자동 비디오 감시 기술에 적용이 가능하다. <1> 배 경 기 술현대 사회의 특징 중 하나는 기존 비디오 감시 시스템의 자동화에 대한 요구가 증가하고, 새로운 차원의 지능 <2>형 시스템 제작의 증가가 요구되는데 있다. 구체적인 사항은 다음과 같다.-지능형 비디오 감시: <3>1)감시구역에 있는 다수의 사람이 존재하는 복잡한 조건에서 유사한 피사체 발견 <4>2)감시구역에 있는 사람의 얼굴을 감시하고 탐색 <5>3)사람의 신체, 머리, 얼굴의 특징을 탐지하고, 키, 머리크기, 얼굴크기, 얼굴의 인체측정학적 특징과 같은 독 <6>특한 생물측정학적 특성을 평가4)피사체의 운동 궤적을 구분 <7>-개인의 생물측정학적 식별 <8>1)향후 인식을 목적으로 얼굴 형상을 구분하고 저장함 <9>2)감시된 피사체의 목록을 작성하는 과제 <10>3)생물측정학적 특성에 기초하여 접근 제어(access control)를 구성 <11>-해당 화면에서 상황 형식 구분 <12>1)신분증 자동 검사소와 같은 군중들이 모인 장소에서 소통량 향상 <13>2)지정된 형식의 상황 발생시 실시간 통지, 복면 강도 출현과 같은 범죄상황 식별 <14>한편, 미국특허 6,593,852(이하 특허 1이라 한다)는 모니터링 및 비디오 탐지 시스템에 적용하기 위해 그 움직 <15>임의 궤적을 분석하는 방법으로 침입자를 탐지하는 방법을 제안하고 있다. 본 방법으로는 사람의 이동 궤적 감- 6 -공개특허 10-2009-0053295시, 탐지, 저장, 분석이 가능하고 얼굴을 탐지하며, 탐지된 얼굴 형태와 궤적에 대한 인식을 수행한다. 그러나본 방법은 사람이 적은 장소와 복잡하지 않은 화면에서만 사람을 탐지할 수 있었다.미국 특허 6,700,999(이하 특허 2라 한다)는 여러 사람을 탐색, 탐지하는 방법과 시스템을 제안하고 있다. 그 <16>러나 이 방법은 주변 화면의 변화에 적응하는 능력을 지니고 있지 않다.미국 특허 6,917,703은 가버 적응필터의 기반을 응용하는 방법으로 얼굴 탐지 알고리즘 향상 방법과 시스템을 <17>제안하고 있다. 그러나 이 필터는 포커스가 맞지 않는 형상과 복잡도가 높은 화면에서는 얼굴을 감지하지 못한다.또한 종래 많은 군중들이 모여 있는 화면을 비록하여 복잡도가 높은 화면을 분석하기 위해 제안된 기술들도 있 <18>었으나, 이미지의 품질을 평가할 수 없고 실시간 이미지 특징에 따라 적합한 탐지 알고리즘을 선택할 수 없었다. 발명의 내용 해결 하고자하는 과제따라서 본 발명이 해결하고자 하는 기술적 과제는, 피사체를 신뢰성 있게 탐지하고 추적하되, 구조적으로 복잡 <19>한 화면, 특히 지하철, 공항, 대형 마트등과 같은 많은 사람들이 모인 장소에서 우선적으로 사람의 얼굴을 탐지하고 추적할 수 있도록 하는데 있다. 과제 해결수단상기 기술적 과제를 달성하기 위해서는 생물측정학적 안전 시스템을 비롯하여 보안 시스템의 추가 확보가 요청 <20>되며, 이를 위한 다음과 같은 기술들을 통합하여 시스템의 정밀도, 신뢰성, 적응능력을 향상시켜야 한다.●비디오 잠복 감시 <21>●화면에서 노이즈 피사체 구분 및 화면 복잡도 분석 <22>●탐색 피사체의 이미지와 모델의 품질 평가 계산에 기초하여 적응형 얼굴 탐지 방법 선택 <23>●감시구역 내 사람 탐지 <24>●3가지 얼굴 탐지 알고리즘 베이스를 사용하며, 여기에서 각 알고리즘은 각기 다른 세부 묘사 수준에 일치하 <25>며, 머리, 얼굴, 얼굴의 특징과 같이 피사체를 구분하는 용도를 지닌다.●피사체 움직임 탐지 <26>상기 기술적 과제를 달성하기 위한 본 발명의 특징에 따른 비디오 감시 방법은, 3D 화면상의 사람 얼굴 피사체 <27>에 대해 적응 탐지, 위치 지정, 품질 평가 방법에 의해 달성되는 것으로, 최소 하나 이상의 비디오 카메라들로부터 얻은 2D이미지에 기초하여 3D화면에 대한 정보를 원거리로 수집하는 단계; 보정 모드(calibration mode)로 이미지 화면을 분석하고 화면의 복잡도를 평가하여 화면 모델을 형성하고, 피사체들에 대한 탐지와 추적 방법 적용전략선택에 대한 결정을 내리는 단계; 실시간 작동모드로 사람과 유사한 피사체를 탐지하고 관심 지역의 모델을 생성하는 단계; 관심 지역 모델을 평가하는 단계; 관심지역 모델, 머리 모델, 얼굴 모델, 얼굴 정밀모델, 탐지 모델에 대한 품질 평가에 따라 사람 얼굴 피사체에 대한 탐지 및 적용 전략을 선택하는 단계; 실시간 탐지 작동 모드로 다양한 수준의 위치에서 사람의 얼굴 등급을 상세 인식 하면서, 피사체를 탐지하고 머리모델, 얼굴 모델, 얼굴 정밀 모델을 형성하는 단계; 추적 피사체 모델을 형성하는 단계; 실시간 추적 작동 모드로 피사체를 추적하는 단계; 머리 모델, 얼굴 모델, 얼굴 정밀 모델, 추적 피사체 모델, 관심 지역 모델의품질을 평가하는 단계를 포함하며, 품질 평가 결과에 따라 모델들 중 최소한 하나에 의해 목표로 하는 사람 피사체 탐지 및 추적 방법에 대해 새로운 적용전략선택결정을 내리는 단계를 포함한다.또, 상기 기술적 과제를 달성하기 위한 본 발명의 특징에 따른 비디오 감시 시스템은, 3D화면에서 사람 얼굴 <28>피사체에 대한 적응 탐지, 추적, 위치 선정에 대해 개선된 시스템으로 실현되는데, 최소 1개 이상의 비디오 카메라 도움을 받는 3D 화면 정보의 원격 수집 장치; 상기 원격 수집 장치로부터 비디오 카메라 자료를 전달받는인간과 유사한 피사체 탐지 장치; 배경 피사체 탐지 블록, 정기적으로 변화하는 피사체 탐지 블록, 피사체 발견 확률 카드의 평가 블록 및 화면 복잡도 분석 블록을 포함하는 화면 노이즈 피사체에 대한 적응 장치; 화면노이즈 피사체에 대한 적응 장치와 원격 수집 장치의 작업 결과를 수신하며, 관심 지역 포착 블록 및 사람의- 7 -공개특허 10-2009-0053295신체 검색기 블록을 포함하는 인간과 유사한 피사체 탐지 장치; 인간과 유사한 피사체 탐지 장치로부터의 정보를 처리하고 피사체 탐지 및 추적 방법 선택 장치로 결과를 전송하는 모델 품질 평가 장치; 사람의 머리와 얼굴의 초기 위치 선정 방법 저장소, 얼굴 정밀 위치 선정 및 얼굴 등급 상세화 방법 저장소, 얼굴 요소들의 고정밀 위치선정 저장소를 포함하여, 이후 처리 전략에 대한 결정을 얼굴 피사체 탐지 장치에 전송하는 피사체탐지 및 추적 방법 선택 장치; 머리, 얼굴, 얼굴 요소들의 위치선정 블록을 포함하고 탐지 결과를 형성된 모델형태로 얼굴 피사체 추적 장치에 전송하는 얼굴 피사체 탐지 장치; 탐지 및 추적 방법 선택 장치의 데이터를수신하고 추적 대상 모델을 생성하여 추적 인자를 평가하고, 모델 품질 평가 장치와 결합된 얼굴 피사체 추적장치를 포함한다. 효 과상술한 바와 같이 본 발명에 따르면, 사람의 얼굴 발견, 정밀 위치 선정, 인자측정하고, 인체 측정학적 요소들 <29>의 과정을 자동화할 수 있다. 그 결과 다음과 같은 효과가 예상된다.-지능형 비디오 감시: <30>●감시 지역 특성을 나타내는 2D 이미지 정보의 자동 수집 <31>●사람에 대한 신속한 발견 및 추적 수행 <32>●노이즈와 엄폐물이 있는 조건에서 군중속에서 개인을 구분 <33>●얼굴, 눈, 입 등 사람의 머리부분에 있는 구성 요소들의 발견, 얼굴 크기와 같은 생물측정학적 요인, 얼굴의 <34>인체측정학적 요인들의 측증●피사체의 이동 궤적 포착, 움직임 특성 분석 <35>●대규모로 작동하는 시스템의 경우, 접근 제어 시스템이 부하가 높은 채털의 상태 식별 <36>-생물측정학적 인물 식별: <37>●사용자의 생물측정학적 형태를 추출하여 추적하고 표준을 제작 <38>본 발명이 지니고 있는 가장 뚜렷한 개선점은 다음과 같다. <39>●캡쳐 이미지 및 화면 구성 환경에 대한 적응을 위하여 다중 탐색을 적용하여 복잡한 환경에서 사람의 얼굴과 <40>얼굴 요소의 탐지 품질 향상●탐색 지역의 순차적 축소 및 현재 화면에서 가장 효율적인 탐지 알고리즘을 자동으로 선택하는 시스템의 선 <41>택에 의해 시스템의 생산성 향상●탐지방법을 다음 3그룹으로 구분함으로써 시스템 생산성 향상: 영역을 축소하고 얼굴 크기를 평가하는 초기 <42>위치 선정 방법, 정밀 위치 선정 및 등급 세분화 방법, 고정밀 위치 선정 방법.●시스템을 추적모드로 전환하여 시스템의 생산성 향상 <43>조명, 노이즈, 사람 얼굴 표면에 피사체가 존재하는 경우, 조건에 대한 높은 적응 수준은 이미지에 대한 탐지 <44>및 위치선정 알고리즘 저장소를 적용함으로써 달성된다.기타 본 발명의 장점은 다음과 같다. <45>●이미지 캡쳐 및 화면 구성 조건에 대한 얼굴 및 얼굴요소들의 탐지 적응성 향상 <46>●다양한 카메라 앵글의 경우, 안경, 콧수염, 턱수염과 같은 얼굴 표면에 피사체가 있는 경우에도 얼굴 및 얼 <47>굴 요소의 탐지 과정을 안정화●탐지 시스템의 생산성 향상 <48>●정보성, 얼굴 유사성, 신뢰성, 정밀성과 같은 지표들을 통합하는 탐지 결과의 품질 평가 계산 <49> 발명의 실시를 위한 구체적인 내용아래에서는 첨부한 도면을 참고로 하여 본 발명의 실시예에 대하여 본 발명이 속하는 기술분야에서 통상의 지 <50>식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 발명은 여러가지 상이한 형태로 구현- 8 -공개특허 10-2009-0053295될 수 있으며, 여기에서 설명하는 실시예에 한정되지는 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기위해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다.명세서 전체에서, 어떤 부분이 어떤 구성 요소를 포함한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다 <51>른 구성요소를 제외하는 것이 아니라, 다른 구성 요소를 더 포함할 수 있는 것을 의미한다. 이제 본 발명의 실시예를 중심으로 도면을 참고로 하여 상세하게 설명한다. <52>도 1에는 본 발명의 실시예에 따른 비디오 감시 시스템의 구성 요소들과 개별 장치들의 상호 작용 도식이 나타 <53>나 있다.본 시스템읜 다음과 같은 구성 요소들을 포함할 수 있다. <54>1 : 한 개 또는 여러개의 카메라 <55>2 : 비디오 카메라와 같이 최소한 하나 이상의 얼굴 광센서로부터 화면 정보를 원격 수집하는 원격 정보 수집 <56>장치3 : 화면 노이즈 피사체 적응 장치는 배경 피사체 탐지 블록(3.2), 정기적으로 변화하는 피사체 탐지 <57>블록(3.3), 피사체 발견 확률 카드 평가 블록(3.4), 화면 복잡도 분석 블록(3.5)을 포함한다. 이 장치는 시스템 보정모드(Calibration mode)로 기능하면서 정적, 동적 배경 요소 분석에 기초하여 하면 데이터를 처리하고,일반화된 감시 화면 모델(3.1)을 생성하는데, 이 모델은 발생 가능한 노이즈 피사체 형태 카드와 화면에서의얼굴 출현 확률 카드를 포함한다. 이 장치는 화면 특성을 고려하여 피사체의 탐지 및 추적 방법 적용에 대한초기 전략을 선택할 수 있다.4 : 인간 유사 피사체 탐지 장치는 관심지역 포착 블록(4.2), 사람의 신체 검색기 블록(4.3)을 포함할 수 <58>있다. 본 장치는 실시간 모드로 작동하면서 화면 모델을 고려하여 관심 지역 포착, 사람의 신체에 있는 피사체검출을 통해 사람의 얼굴 탐색 지역을 감소시킨다. 본 장치는 현재 프레임에서 검출된 관심 지역 모델(4.1)을디스플레이할 수 있다.5 : 모델 품질 평가 장치는 다음 모델을 처리하고 그 품질평가 결과를 처리한다. 해당 모델에는 화면 모델, 관 <59>심 지역 모델, 머리 모델, 얼굴 모델, 정밀 얼굴 모델, 추적 대상 모델이 있다. 본 장치는 실시간 모드로 기능하면서 분석되는 모델 자체의 구조와 해당 모델 제작의 표본이 된 이미지 부분의 특징을 나타내는 일련의 인자들의 값을 계산할 수 있다. 계산된 인자의 평가는 해당 저장소로부터 그 다음 얼굴의 위치 선정 방법을 선택하기 위해서 필수적이다피사.6 : 피사체 탐지 및 추적 방법 선택 장치는 초기 머리와 얼굴 위치 선정 방법의 저장소(6.1), 정밀 위치 선정 <60>및 얼굴 등급 세분화 방법 저장소(6.2), 얼굴 요소들의 고정밀 위치 선정 방법 저장소(6.3)을 포함할 수 있다.이 장치는 현재 프레임을 효율적으로 처리할 목적으로 탐지 알고리즘 적응화를 위한 용도를 가지고 있으며, 화면의 이미지 특성과 해당 프레임에서 이미 발견된 피사체 특성을 고려하여 사람의 향후 위치 선정 방법을 선택할 수 있다. 피사체 탐지 방법 적용의 정밀 전략에 의해 장치가 작동하게 된다.7 : 얼굴 피사체 탐지 장치는 머리 위치 선정 블록(7.1), 얼굴 위치 선정 블록(7.2), 얼굴 구성 요소 위치 선 <61>정 블록(7.3)을 포함할 수 있다. 본 장치는 피사체 탐지 및 추적 방법 선택 장치에 의해 선택된 알고리즘을 적용하는 방법으로 해당하는 상세화 수준으로 피사체를 탐지할 수 있다. 위치 선정된 피사체 모델(7.4, 7.5,7.6)은 본 장치의 결과물이다.8 : 얼굴 피사체 추적 장치는 현재 프레임에서의 추적 대상 추적 및 인자 평가 블록(8.1) 및 다음 프레임에서 <62>추적 대상 생성기(8.2)를 포함할 수 있다. 본 장치는 추적 대상 목록을 작성하고 하나 또는 여러개의 추적 피사체 추적 및 인자 평가 블록(8.1)을 활성화시키고, 그 작동 결과에 따라 추적 피사체를 구분하고 분류하되 우선적으로 관심지역에서 사람의 신체를 구분 분류하며, 이런식으로 추적 피사체 모델(8.3)을 생성할 수 있다.이 때 감시 지역에 대한 원격 정보 수집 장치(2)는 최소한 한개의 광학 센서 예를 들면 비디오 카메라 1의 형 <63>태로부터 정보를 수집할 수 있다.화면의 노이즈 피사체 적응 장치(3)는 시스템 장치 및 보정단계에서 필수적이다. 이 장치는 시스템이 사용되는 <64>주변 특성에 적응할 수 있다. 적응 과정은 시스템이 감시 화면, 조명 조건, 광학 센서 튜닝, 원격 정보수집 장치를 분석할 때 지정된 시간 간격에 따라 실시된다. 이러한 분석의 목적은 배경 및 노이즈 확률이 가장 높은- 9 -공개특허 10-2009-0053295피사체의 인자들에 대한 평가, 피사체 출현 확률카드의 제작, 감시 화면의 복잡도 등급 결정, 사람 얼굴 발견방법 초기 적용 전략 선정에 있다. 화면의 노이즈 피사체 적응 장치(3)가 기능하는 과정에서 다음과 같은 블록들이 활성화된다. <65>●배경 피사체 탐지 블록(3.2)는 초기 이미지와 필터링 결과 얻은 카드들을 분석하면서 화면의 배경에서 고정 <66>되어 있는 요소들을 구분할 수 있다. 이 블록은 여러 개이 정적 배경형상들을 처리, 구분, 저장할 수 있다.●정기적으로 변동하는 피사체 탐지 블록(3.3)은 화면에서 정기적 움직임을 구분할 수 있다. <67>●피사체 발견 확률카드 평가 블록(3.4)는 화면의 이미지가 평이한 각 지역에 사람의 얼굴이 그 곳에 존재할 <68>확률을 지정할 수 있다. 지정된 카드는 화면에서 피사체의 움직임 인자 분석 및 초기 이미지 필터링 및 구분에따라 형성된다.●화면 복잡도 분석 블록(3.5)은 감시되는 화면의 구조적 복잡도를 특징짓는 종합적 평가를 산출할 수 있다(배 <69>경 피사체, 움직이는 피사체의 평균개수, 조명 조건, 피사체의 이동 인자 등). 이 계산은 가버 변환 및 주변필터링을 이용하여 얻은 정적, 동적 배경 피사체 검출 블록(3.2, 3.3)과 별도의 카드 분석 작업의 결과이다.위에 설명한 블록들의 데이터는 감시 화면 모델(3.1)을 형성하기 위해 일반화되는데 모델에는 노이즈 피사체와 <70>형상카드, 정보 관심 지역이 형상 가크, 화면 복잡도 평가 카드가 포함된다. 이 모델(3.1)은 화면의 특성을 고려하여 얼굴의 피사체 탐색 및 추적 방법 적용의 초기전략 선택에 사용된다.인간 유사 피사체 발견 장치(4)는 현재 프레임에서 감지지역을 평가하고 다수의 관심 정보 지역을 결정할 수 <71>있다. 장치(4)는 관심지역 포착 블록(4.2)과 사람 신체 검색기 블록(4.3)을 활성화 시킨다.관심 지역 포착 블록(4.2)은 화면에서 관심지역을 구분하고, 변경 사항을 발견하는 방법으로 얼굴이 피사체 탐 <72>색 지역을 축소시킬 수 있다. 관심 지역 구분 방법은 다음과 같은 절차로 구성된다.●이전 화면의 기본 데이터와 노이즈 피사체 카드 데이터와 화면 데이터를 비교한다. <73>●화면에서 변경 지역을 구분한다. <74>●사람 출현 확률카드를 분석하는 방법으로 관심 피사체 출현 가능성이 있는 관심지역들을 비교한다. <75>사람 신체 검색기 블록(4.3)은 시스템 보정 단계에서 감시 화면에 적응된 낮은 단계의 필터 시스템을 해당 구 <76>역에 적용하는 방법으로 사람의 전신을 검출할 수 있다. 사람 신체 검색기 블록(4.3)의 정보는 관심 지역 포착 블록(4.2)의 데이터와 함께 결정 채택 시스템에 전송되 <77>는데, 이 시스템은 탐지 지역에 한개 또는 여러개의 인간 유사 피사체 존재에 대하여 판단을 내리고 그 위치,크기, 형태, 구조와 관련된 정보를 통합하는 관심지역 모델(4.1)을 생성할 수 있다.모델 품질 평가 장치(5)는 각 단계에서 처리 작업을 수행하고 다음과 같은 모델 중 하나를 분석할 수 있다. <78>●관심지역 모델(4.1) <79>●머리모델(7.4) <80>●얼굴모델(7.5) <81>●얼굴의 인체측정학적 지점에 대한 정보를 수록하고 있는 얼굴 정밀 모델(7.6) <82>●추적 피사체 모델(8.3) <83>각 모델은 해당 피사체의 위치, 형태, 크기, 구조에 대한 정보를 수록하고 있다. 머리, 얼굴, 얼굴 특성에 대 <84>하여 추적 모드를 시작할 경우 일반 모델 정보와 피사체 이동 특성을 통합하는 추적 대상 모델이 생성된다. 모델 분석은 그에 해당하는 이미지 부분의 분석과 함께 공동으로 이루어진다. 이러한 분석을 수행하는 목적은 해당 저장소로부터 현재 프레임에 가장 적합한 탐지 및 위치 선정 알고리즘을 <85>선택하기 위한 검출 피사체의 이미지 특성과 인자계산에 있다.관심 지역 모델의 품질 특성 평가는 해당 이미지 부분에 대한 다음과 같은 인자값의 계산 결과에 의해 이루어 <86>진다.●명암 <87>- 10 -공개특허 10-2009-0053295●대비(contrast) <88>●포커싱(focusing) 개수 <89>●피사체 조명 타입 <90>머리 모델 품질 특성의 평가는 다음과 같은 인자를 계산하게 된다. <91>●이미지 단편의 명도 <92>●이미지 단편의 대비 <93>●포커싱 개수 <94>●머리 피사체의 조명 타입 <95>●머리 카메라 앵글의 평가 <96>●얼굴 유사성 계수 평가 <97>얼굴 모델 품질 특성을 평가하기 위하여 다음과 같은 인자들을 계산한다. <98>●이미지 단편의 명도 <99>●이미지 단편의 대비 <100>●포커싱 개수 <101>●얼굴 피사체의 조명 타입 <102>●얼굴 카메라 앵글의 평가 <103>●얼굴 일부를 가린 부수적 피사체의 존재여부 평가 <104>●얼굴 유사성 계수 평가 <105>얼굴 정밀 모델 품질특성 평가는 다음과 같은 인자를 계산할 수 있다. <106>●이미지 단편의 명도 <107>●이미지 단편의 대비 <108>●포커싱 개수 <109>●얼굴 피사체의 조명 타입 <110>●얼굴 카메라 앵글의 정밀 평가 <111>●얼굴 유사헝 계수 정밀 평가 <112>●인자를 위한 얼굴 개별 부분(눈,코)의 유효성 평가 <113>피사체 탐지 및 추적 방법 선택 장치(6)는 현재 프레임의 효율적인 처리를 위하여, 즉 현재 화면상태에 따라서 <114>탐지 전력을 세밀화하기 위하여 탐지 알고리즘을 적합화하기 위한 것이며, 정해진 조건에 대하여 가장 적합한이미지 분석 및 분류 알고리즘을 자동으로 선택하는 시스템이다. 선택은 기존에 있는 저장소에서 수행된다. 본 장치의 기반은 미리 학습된 아키텍쳐 SNoW(D.Roth, M-H Yang and N Ahuja, \"SNoW-기반 얼굴 감지기\", 신경 <115>처리 정보 시스템의 발전 12(NIPS 12), MIT Press, Cambridge, MA, pp.855-861, 2000 [5] 참조)를 지닌 신경망셋트이고 그 각각은 위에 언급된 모델들 중 하나 및 3개의 저장소와 짝을 이룬다.신경망 입구에는 해당 모델과 이미지의 품질평가 벡터가 연결된다. 신경망 출구는 해당 저장소에서 나온 알고 <116>리즘 인덱스 셋트로, 이것은 해당 이미지의 향후 위치 선정 과정을 수행하기에 가장 적합하게 구성되어 있다.알고리즘은 3개의 저장소로 분류된다. <117>●초기 머리와 얼굴 위치 선정 방법 저장소(6.1)-이러한 그룹화 방법은 이미지에 대하여 관심구역 분석을 하기 <118>위한 것이며, 머리의 좌표와 크기를 측정하는 방법으로 사람의 얼굴 위치에 대하여 근접한 평가를 수행할 수있다.- 11 -공개특허 10-2009-0053295●얼굴의 정밀 위치 선정 및 등급 세분화 방법 저장소(6.2)- 이 그룹의 알고리즘은 검출된 얼굴에 근접한 지역 <119>에서 수행되는데, 이미지에 대하여 얼굴의 정밀 위치 선정을 수행하고, 사진이나 밀랍인형이 아닌 실제 사람의얼굴을 구분하기 위해 발견된 피사체를 분류한다.●얼굴 요소 고정밀 위치 선정 방법 저장소(6.3)- 이러한 것에 기반한 방법들을 정확하게 위치가 선정된 얼굴 <120>부위에 적용할 수 있다. 그 용도는 눈썹 경계, 눈꼬리, 눈 중앙, 콧날, 입가와 같은 피사체, 얼굴의 인체측정학적 특성을 정밀하게 검출하는 것이다.이 단계에서 선택된 방법과 알고리즘은 얼굴 피사체 탐지 장치(7)로 전달되거나, 시스템이 추적 모드에 있을 <121>경우에는 얼굴 피사체 추적 장치(8)로 전달된다.얼굴 피사체 탐지 장치(7)는 이전 단계에서 선택된 알고리즘을 적용하는 방법으로 피사체와 이미 존재하는 해 <122>당 모델의 검출 수행한다. 이러한 알고리즘은 머리, 얼굴, 얼굴요소들의 위치 선정 블록(7.1, 7.2, 7.3) 각각에 의해 수행된다. 알고리즘 적용 결과에 따라 위치 선정된 피사체의 모델이 만들어진다. 이렇게 얻은 모델은추적 대상 생성을 위해 얼굴 피사체 추적 장치(8)로 전달된다.얼굴 피사체 추적 장치(8)는 이전 프레임과 피사체의 움직임 정보를 이용하여 목표하는 피사체를 신속하게 탐 <123>지한다.1)이미 발견된 프레임에서 피사체의 특성을 나타내는 기준점들을 구분한다. <124>2)많은 지점들의 광학적 흐름을 분석하고 운동 인자를 계산한다. <125>3)다음 프레임에서 기준 지점 주변의 가장 확률이 높은 해당 지점 한개를 탐색한다. <126>4)지점들의 일관성을 확인하고, 탐지된 피사체의 확실성이 낮을 경우 검출 블록의 절차를 가동시킨다. <127>추적 과정이 종료되면 추적 대상 생성기(8.2)는 다음 프레임에서 추적을 하기 위해 추적 피사체 모델(8.3)을 <128>생성할 수 있다.열거한 모든 장치들은 독립적으로 별도의 프로세서에서 실현될 수 있으며 예를 들어서 디지털 시그널 프로세서 <129>에서 구현될 수 있다.본 기술의 적용범위는 무엇보다도 다음과 같은 과제를 해결하는 시스템이 될 수 있다. <130>●사용자 식별: 본 방법은 현재 화면 조건에 검출 알고리즘을 적합화시킴으로써 접근제어 시스템의 정밀도와 <131>생산성을 향상시킨다.●인간-기계의 인터페이스 장치 제어, 예를 들어 사람의 몸짓을 사용하여 컴퓨터 제어 <132>●로보트 시력 <133>●화상회의 <134>본 장치를 실현하는데 선호되는 방식은 자동 지능형 비디오 감시 시스템, 생물 측정학 시스템을 비록한 보안 <135>경비 시스템 등에 얼굴에 따라 개인을 탐지하고 인식하는 품질을 향상시키기 위한 목적으로 사용하는 것이다.실험, 샘플 기기는 2D 이미지 센서와 최소한 한개 또는 여러개의 신호처리기로 구성되는 장치 기판 형태로 구 <136>현될 수도 있다.도면의 간단한 설명도 1은 본 발명의 실시예에 따른 비디오 감시 시스템의 구성 요소들과 개별 장치들의 상호 작용을 나타낸 그림 <137>이다.- 12 -공개특허 10-2009-0053295도면 도면1- 13 -공개특허 10-2009-0053295"}
{"patent_id": "10-2007-0120072", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 비디오 감시 시스템 및 방법은 3D화면의 사람얼굴 피사체에 대한 적응형 탐지, 추적, 위치선정, 품질 평가에 기초하고 있으며 다음과 같이 구성된다. 최소한 비디오 카메라들중 하나로부터 얻은 2D 이미지에 기초하여 3D 화 면에 대한 정보를 원거리로 수집한다 보정모드로 이미지 화면을 분석하고, 화면의 복잡도를 평가하여 화면 모델 을 형성하여 피사체들에 대한 탐지와 추적방법 적용전략선택에 대한 결정을 내린다. 실시간 작동 모드로 화면 모 델을 고려하여 사람과 유사한 피사체를 탐지하고 관심지역의 모델을 생성한다. 관심 지역 모델의 품질을 평가한 다. 관심지역 모델, 머리 모델, 얼굴 모델, 정밀 모델, 탐지 모델의 품질 평가에 따라 사람 얼굴 피사체에 대한 탐지 및 추적방법 적용 전략을 선택한다. 실시간 탐지 작동 모드로 다양한 수준의 위치에서 사람의 얼굴 등급을 상세 인식하면서 피사체를 탐지하고, 머리 모델, 얼굴 모델, 얼굴 정밀 모델을 형성한다. 추적 피사체 모델을 형 성한다. 실시간 추적 작동 모드로 피사체를 추적한다. 머리모델, 얼굴 모델, 얼굴 정밀모델, 추적 피사체 모델, 관심지역 모델의 품질을 평가한다. 품질 평가에 따라 최소한 모델들 중 하나에 의해 얼굴 피사체 탐지 및 추적 방법의 새로운 적용 전략 선택 결정을 내린다."}
{"patent_id": "10-2007-0120072", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 비디오 감시 시스템 및 방법에 관한 것으로, 자동 비디오 감시 기술에 적용이 가능하다. <1>"}
{"patent_id": "10-2007-0120072", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "현대 사회의 특징 중 하나는 기존 비디오 감시 시스템의 자동화에 대한 요구가 증가하고, 새로운 차원의 지능 <2> 형 시스템 제작의 증가가 요구되는데 있다. 구체적인 사항은 다음과 같다. -지능형 비디오 감시: <3> 1)감시구역에 있는 다수의 사람이 존재하는 복잡한 조건에서 유사한 피사체 발견 <4> 2)감시구역에 있는 사람의 얼굴을 감시하고 탐색 <5> 3)사람의 신체, 머리, 얼굴의 특징을 탐지하고, 키, 머리크기, 얼굴크기, 얼굴의 인체측정학적 특징과 같은 독 <6> 특한 생물측정학적 특성을 평가 4)피사체의 운동 궤적을 구분 <7> -개인의 생물측정학적 식별 <8> 1)향후 인식을 목적으로 얼굴 형상을 구분하고 저장함 <9> 2)감시된 피사체의 목록을 작성하는 과제 <10> 3)생물측정학적 특성에 기초하여 접근 제어(access control)를 구성 <11> -해당 화면에서 상황 형식 구분 <12> 1)신분증 자동 검사소와 같은 군중들이 모인 장소에서 소통량 향상 <13> 2)지정된 형식의 상황 발생시 실시간 통지, 복면 강도 출현과 같은 범죄상황 식별 <14> 한편, 미국특허 6,593,852(이하 특허 1이라 한다)는 모니터링 및 비디오 탐지 시스템에 적용하기 위해 그 움직 <15> 임의 궤적을 분석하는 방법으로 침입자를 탐지하는 방법을 제안하고 있다. 본 방법으로는 사람의 이동 궤적 감 - 6 -공개특허 10-2009-0053295시, 탐지, 저장, 분석이 가능하고 얼굴을 탐지하며, 탐지된 얼굴 형태와 궤적에 대한 인식을 수행한다. 그러나 본 방법은 사람이 적은 장소와 복잡하지 않은 화면에서만 사람을 탐지할 수 있었다. 미국 특허 6,700,999(이하 특허 2라 한다)는 여러 사람을 탐색, 탐지하는 방법과 시스템을 제안하고 있다. 그 <16> 러나 이 방법은 주변 화면의 변화에 적응하는 능력을 지니고 있지 않다. 미국 특허 6,917,703은 가버 적응필터의 기반을 응용하는 방법으로 얼굴 탐지 알고리즘 향상 방법과 시스템을 <17> 제안하고 있다. 그러나 이 필터는 포커스가 맞지 않는 형상과 복잡도가 높은 화면에서는 얼굴을 감지하지 못한 다. 또한 종래 많은 군중들이 모여 있는 화면을 비록하여 복잡도가 높은 화면을 분석하기 위해 제안된 기술들도 있 <18> 었으나, 이미지의 품질을 평가할 수 없고 실시간 이미지 특징에 따라 적합한 탐지 알고리즘을 선택할 수 없었 다."}
{"patent_id": "10-2007-0120072", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "발명의 내용 해결 하고자하는 과제 따라서 본 발명이 해결하고자 하는 기술적 과제는, 피사체를 신뢰성 있게 탐지하고 추적하되, 구조적으로 복잡 <19> 한 화면, 특히 지하철, 공항, 대형 마트등과 같은 많은 사람들이 모인 장소에서 우선적으로 사람의 얼굴을 탐 지하고 추적할 수 있도록 하는데 있다. 과제 해결수단 상기 기술적 과제를 달성하기 위해서는 생물측정학적 안전 시스템을 비롯하여 보안 시스템의 추가 확보가 요청 <20> 되며, 이를 위한 다음과 같은 기술들을 통합하여 시스템의 정밀도, 신뢰성, 적응능력을 향상시켜야 한다. ●비디오 잠복 감시 <21> ●화면에서 노이즈 피사체 구분 및 화면 복잡도 분석 <22> ●탐색 피사체의 이미지와 모델의 품질 평가 계산에 기초하여 적응형 얼굴 탐지 방법 선택 <23> ●감시구역 내 사람 탐지 <24> ●3가지 얼굴 탐지 알고리즘 베이스를 사용하며, 여기에서 각 알고리즘은 각기 다른 세부 묘사 수준에 일치하 <25> 며, 머리, 얼굴, 얼굴의 특징과 같이 피사체를 구분하는 용도를 지닌다. ●피사체 움직임 탐지 <26> 상기 기술적 과제를 달성하기 위한 본 발명의 특징에 따른 비디오 감시 방법은, 3D 화면상의 사람 얼굴 피사체 <27> 에 대해 적응 탐지, 위치 지정, 품질 평가 방법에 의해 달성되는 것으로, 최소 하나 이상의 비디오 카메라들로 부터 얻은 2D이미지에 기초하여 3D화면에 대한 정보를 원거리로 수집하는 단계; 보정 모드(calibration mode) 로 이미지 화면을 분석하고 화면의 복잡도를 평가하여 화면 모델을 형성하고, 피사체들에 대한 탐지와 추적 방 법 적용전략선택에 대한 결정을 내리는 단계; 실시간 작동모드로 사람과 유사한 피사체를 탐지하고 관심 지역 의 모델을 생성하는 단계; 관심 지역 모델을 평가하는 단계; 관심지역 모델, 머리 모델, 얼굴 모델, 얼굴 정밀 모델, 탐지 모델에 대한 품질 평가에 따라 사람 얼굴 피사체에 대한 탐지 및 적용 전략을 선택하는 단계; 실시 간 탐지 작동 모드로 다양한 수준의 위치에서 사람의 얼굴 등급을 상세 인식 하면서, 피사체를 탐지하고 머리 모델, 얼굴 모델, 얼굴 정밀 모델을 형성하는 단계; 추적 피사체 모델을 형성하는 단계; 실시간 추적 작동 모 드로 피사체를 추적하는 단계; 머리 모델, 얼굴 모델, 얼굴 정밀 모델, 추적 피사체 모델, 관심 지역 모델의 품질을 평가하는 단계를 포함하며, 품질 평가 결과에 따라 모델들 중 최소한 하나에 의해 목표로 하는 사람 피 사체 탐지 및 추적 방법에 대해 새로운 적용전략선택결정을 내리는 단계를 포함한다. 또, 상기 기술적 과제를 달성하기 위한 본 발명의 특징에 따른 비디오 감시 시스템은, 3D화면에서 사람 얼굴 <28> 피사체에 대한 적응 탐지, 추적, 위치 선정에 대해 개선된 시스템으로 실현되는데, 최소 1개 이상의 비디오 카 메라 도움을 받는 3D 화면 정보의 원격 수집 장치; 상기 원격 수집 장치로부터 비디오 카메라 자료를 전달받는 인간과 유사한 피사체 탐지 장치; 배경 피사체 탐지 블록, 정기적으로 변화하는 피사체 탐지 블록, 피사체 발 견 확률 카드의 평가 블록 및 화면 복잡도 분석 블록을 포함하는 화면 노이즈 피사체에 대한 적응 장치; 화면 노이즈 피사체에 대한 적응 장치와 원격 수집 장치의 작업 결과를 수신하며, 관심 지역 포착 블록 및 사람의 - 7 -공개특허 10-2009-0053295신체 검색기 블록을 포함하는 인간과 유사한 피사체 탐지 장치; 인간과 유사한 피사체 탐지 장치로부터의 정보 를 처리하고 피사체 탐지 및 추적 방법 선택 장치로 결과를 전송하는 모델 품질 평가 장치; 사람의 머리와 얼 굴의 초기 위치 선정 방법 저장소, 얼굴 정밀 위치 선정 및 얼굴 등급 상세화 방법 저장소, 얼굴 요소들의 고 정밀 위치선정 저장소를 포함하여, 이후 처리 전략에 대한 결정을 얼굴 피사체 탐지 장치에 전송하는 피사체 탐지 및 추적 방법 선택 장치; 머리, 얼굴, 얼굴 요소들의 위치선정 블록을 포함하고 탐지 결과를 형성된 모델 형태로 얼굴 피사체 추적 장치에 전송하는 얼굴 피사체 탐지 장치; 탐지 및 추적 방법 선택 장치의 데이터를 수신하고 추적 대상 모델을 생성하여 추적 인자를 평가하고, 모델 품질 평가 장치와 결합된 얼굴 피사체 추적 장치를 포함한다. 효 과 상술한 바와 같이 본 발명에 따르면, 사람의 얼굴 발견, 정밀 위치 선정, 인자측정하고, 인체 측정학적 요소들 <29> 의 과정을 자동화할 수 있다. 그 결과 다음과 같은 효과가 예상된다. -지능형 비디오 감시: <30> ●감시 지역 특성을 나타내는 2D 이미지 정보의 자동 수집 <31> ●사람에 대한 신속한 발견 및 추적 수행 <32> ●노이즈와 엄폐물이 있는 조건에서 군중속에서 개인을 구분 <33> ●얼굴, 눈, 입 등 사람의 머리부분에 있는 구성 요소들의 발견, 얼굴 크기와 같은 생물측정학적 요인, 얼굴의 <34> 인체측정학적 요인들의 측증 ●피사체의 이동 궤적 포착, 움직임 특성 분석 <35> ●대규모로 작동하는 시스템의 경우, 접근 제어 시스템이 부하가 높은 채털의 상태 식별 <36> -생물측정학적 인물 식별: <37> ●사용자의 생물측정학적 형태를 추출하여 추적하고 표준을 제작 <38> 본 발명이 지니고 있는 가장 뚜렷한 개선점은 다음과 같다. <39> ●캡쳐 이미지 및 화면 구성 환경에 대한 적응을 위하여 다중 탐색을 적용하여 복잡한 환경에서 사람의 얼굴과 <40> 얼굴 요소의 탐지 품질 향상 ●탐색 지역의 순차적 축소 및 현재 화면에서 가장 효율적인 탐지 알고리즘을 자동으로 선택하는 시스템의 선 <41> 택에 의해 시스템의 생산성 향상 ●탐지방법을 다음 3그룹으로 구분함으로써 시스템 생산성 향상: 영역을 축소하고 얼굴 크기를 평가하는 초기 <42> 위치 선정 방법, 정밀 위치 선정 및 등급 세분화 방법, 고정밀 위치 선정 방법. ●시스템을 추적모드로 전환하여 시스템의 생산성 향상 <43> 조명, 노이즈, 사람 얼굴 표면에 피사체가 존재하는 경우, 조건에 대한 높은 적응 수준은 이미지에 대한 탐지 <44> 및 위치선정 알고리즘 저장소를 적용함으로써 달성된다. 기타 본 발명의 장점은 다음과 같다. <45> ●이미지 캡쳐 및 화면 구성 조건에 대한 얼굴 및 얼굴요소들의 탐지 적응성 향상 <46> ●다양한 카메라 앵글의 경우, 안경, 콧수염, 턱수염과 같은 얼굴 표면에 피사체가 있는 경우에도 얼굴 및 얼 <47> 굴 요소의 탐지 과정을 안정화 ●탐지 시스템의 생산성 향상 <48> ●정보성, 얼굴 유사성, 신뢰성, 정밀성과 같은 지표들을 통합하는 탐지 결과의 품질 평가 계산 <49> 발명의 실시를 위한 구체적인 내용"}
{"patent_id": "10-2007-0120072", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 3, "content": "아래에서는 첨부한 도면을 참고로 하여 본 발명의 실시예에 대하여 본 발명이 속하는 기술분야에서 통상의 지 <50> 식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 발명은 여러가지 상이한 형태로 구현 - 8 -공개특허 10-2009-0053295될 수 있으며, 여기에서 설명하는 실시예에 한정되지는 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부 호를 붙였다. 명세서 전체에서, 어떤 부분이 어떤 구성 요소를 포함한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다 <51> 른 구성요소를 제외하는 것이 아니라, 다른 구성 요소를 더 포함할 수 있는 것을 의미한다. 이제 본 발명의 실시예를 중심으로 도면을 참고로 하여 상세하게 설명한다. <52> 도 1에는 본 발명의 실시예에 따른 비디오 감시 시스템의 구성 요소들과 개별 장치들의 상호 작용 도식이 나타 <53> 나 있다. 본 시스템읜 다음과 같은 구성 요소들을 포함할 수 있다. <54> 1 : 한 개 또는 여러개의 카메라 <55> 2 : 비디오 카메라와 같이 최소한 하나 이상의 얼굴 광센서로부터 화면 정보를 원격 수집하는 원격 정보 수집 <56> 장치 3 : 화면 노이즈 피사체 적응 장치는 배경 피사체 탐지 블록(3.2), 정기적으로 변화하는 피사체 탐지 <57> 블록(3.3), 피사체 발견 확률 카드 평가 블록(3.4), 화면 복잡도 분석 블록(3.5)을 포함한다. 이 장치는 시스 템 보정모드(Calibration mode)로 기능하면서 정적, 동적 배경 요소 분석에 기초하여 하면 데이터를 처리하고, 일반화된 감시 화면 모델(3.1)을 생성하는데, 이 모델은 발생 가능한 노이즈 피사체 형태 카드와 화면에서의 얼굴 출현 확률 카드를 포함한다. 이 장치는 화면 특성을 고려하여 피사체의 탐지 및 추적 방법 적용에 대한 초기 전략을 선택할 수 있다. 4 : 인간 유사 피사체 탐지 장치는 관심지역 포착 블록(4.2), 사람의 신체 검색기 블록(4.3)을 포함할 수 <58> 있다. 본 장치는 실시간 모드로 작동하면서 화면 모델을 고려하여 관심 지역 포착, 사람의 신체에 있는 피사체 검출을 통해 사람의 얼굴 탐색 지역을 감소시킨다. 본 장치는 현재 프레임에서 검출된 관심 지역 모델(4.1)을 디스플레이할 수 있다. 5 : 모델 품질 평가 장치는 다음 모델을 처리하고 그 품질평가 결과를 처리한다. 해당 모델에는 화면 모델, 관 <59> 심 지역 모델, 머리 모델, 얼굴 모델, 정밀 얼굴 모델, 추적 대상 모델이 있다. 본 장치는 실시간 모드로 기능 하면서 분석되는 모델 자체의 구조와 해당 모델 제작의 표본이 된 이미지 부분의 특징을 나타내는 일련의 인자 들의 값을 계산할 수 있다. 계산된 인자의 평가는 해당 저장소로부터 그 다음 얼굴의 위치 선정 방법을 선택하 기 위해서 필수적이다피사. 6 : 피사체 탐지 및 추적 방법 선택 장치는 초기 머리와 얼굴 위치 선정 방법의 저장소(6.1), 정밀 위치 선정 <60> 및 얼굴 등급 세분화 방법 저장소(6.2), 얼굴 요소들의 고정밀 위치 선정 방법 저장소(6.3)을 포함할 수 있다. 이 장치는 현재 프레임을 효율적으로 처리할 목적으로 탐지 알고리즘 적응화를 위한 용도를 가지고 있으며, 화 면의 이미지 특성과 해당 프레임에서 이미 발견된 피사체 특성을 고려하여 사람의 향후 위치 선정 방법을 선택 할 수 있다. 피사체 탐지 방법 적용의 정밀 전략에 의해 장치가 작동하게 된다. 7 : 얼굴 피사체 탐지 장치는 머리 위치 선정 블록(7.1), 얼굴 위치 선정 블록(7.2), 얼굴 구성 요소 위치 선 <61> 정 블록(7.3)을 포함할 수 있다. 본 장치는 피사체 탐지 및 추적 방법 선택 장치에 의해 선택된 알고리즘을 적 용하는 방법으로 해당하는 상세화 수준으로 피사체를 탐지할 수 있다. 위치 선정된 피사체 모델(7.4, 7.5, 7.6)은 본 장치의 결과물이다. 8 : 얼굴 피사체 추적 장치는 현재 프레임에서의 추적 대상 추적 및 인자 평가 블록(8.1) 및 다음 프레임에서 <62> 추적 대상 생성기(8.2)를 포함할 수 있다. 본 장치는 추적 대상 목록을 작성하고 하나 또는 여러개의 추적 피 사체 추적 및 인자 평가 블록(8.1)을 활성화시키고, 그 작동 결과에 따라 추적 피사체를 구분하고 분류하되 우 선적으로 관심지역에서 사람의 신체를 구분 분류하며, 이런식으로 추적 피사체 모델(8.3)을 생성할 수 있다. 이 때 감시 지역에 대한 원격 정보 수집 장치는 최소한 한개의 광학 센서 예를 들면 비디오 카메라 1의 형 <63> 태로부터 정보를 수집할 수 있다. 화면의 노이즈 피사체 적응 장치는 시스템 장치 및 보정단계에서 필수적이다. 이 장치는 시스템이 사용되는 <64> 주변 특성에 적응할 수 있다. 적응 과정은 시스템이 감시 화면, 조명 조건, 광학 센서 튜닝, 원격 정보수집 장 치를 분석할 때 지정된 시간 간격에 따라 실시된다. 이러한 분석의 목적은 배경 및 노이즈 확률이 가장 높은 - 9 -공개특허 10-2009-0053295피사체의 인자들에 대한 평가, 피사체 출현 확률카드의 제작, 감시 화면의 복잡도 등급 결정, 사람 얼굴 발견 방법 초기 적용 전략 선정에 있다. 화면의 노이즈 피사체 적응 장치가 기능하는 과정에서 다음과 같은 블록들이 활성화된다. <65> ●배경 피사체 탐지 블록(3.2)는 초기 이미지와 필터링 결과 얻은 카드들을 분석하면서 화면의 배경에서 고정 <66> 되어 있는 요소들을 구분할 수 있다. 이 블록은 여러 개이 정적 배경형상들을 처리, 구분, 저장할 수 있다. ●정기적으로 변동하는 피사체 탐지 블록(3.3)은 화면에서 정기적 움직임을 구분할 수 있다. <67> ●피사체 발견 확률카드 평가 블록(3.4)는 화면의 이미지가 평이한 각 지역에 사람의 얼굴이 그 곳에 존재할 <68> 확률을 지정할 수 있다. 지정된 카드는 화면에서 피사체의 움직임 인자 분석 및 초기 이미지 필터링 및 구분에 따라 형성된다. ●화면 복잡도 분석 블록(3.5)은 감시되는 화면의 구조적 복잡도를 특징짓는 종합적 평가를 산출할 수 있다(배 <69> 경 피사체, 움직이는 피사체의 평균개수, 조명 조건, 피사체의 이동 인자 등). 이 계산은 가버 변환 및 주변 필터링을 이용하여 얻은 정적, 동적 배경 피사체 검출 블록(3.2, 3.3)과 별도의 카드 분석 작업의 결과이다. 위에 설명한 블록들의 데이터는 감시 화면 모델(3.1)을 형성하기 위해 일반화되는데 모델에는 노이즈 피사체와 <70> 형상카드, 정보 관심 지역이 형상 가크, 화면 복잡도 평가 카드가 포함된다. 이 모델(3.1)은 화면의 특성을 고 려하여 얼굴의 피사체 탐색 및 추적 방법 적용의 초기전략 선택에 사용된다. 인간 유사 피사체 발견 장치는 현재 프레임에서 감지지역을 평가하고 다수의 관심 정보 지역을 결정할 수 <71> 있다. 장치는 관심지역 포착 블록(4.2)과 사람 신체 검색기 블록(4.3)을 활성화 시킨다. 관심 지역 포착 블록(4.2)은 화면에서 관심지역을 구분하고, 변경 사항을 발견하는 방법으로 얼굴이 피사체 탐 <72> 색 지역을 축소시킬 수 있다. 관심 지역 구분 방법은 다음과 같은 절차로 구성된다. ●이전 화면의 기본 데이터와 노이즈 피사체 카드 데이터와 화면 데이터를 비교한다. <73> ●화면에서 변경 지역을 구분한다. <74> ●사람 출현 확률카드를 분석하는 방법으로 관심 피사체 출현 가능성이 있는 관심지역들을 비교한다. <75> 사람 신체 검색기 블록(4.3)은 시스템 보정 단계에서 감시 화면에 적응된 낮은 단계의 필터 시스템을 해당 구 <76> 역에 적용하는 방법으로 사람의 전신을 검출할 수 있다. 사람 신체 검색기 블록(4.3)의 정보는 관심 지역 포착 블록(4.2)의 데이터와 함께 결정 채택 시스템에 전송되 <77> 는데, 이 시스템은 탐지 지역에 한개 또는 여러개의 인간 유사 피사체 존재에 대하여 판단을 내리고 그 위치, 크기, 형태, 구조와 관련된 정보를 통합하는 관심지역 모델(4.1)을 생성할 수 있다. 모델 품질 평가 장치는 각 단계에서 처리 작업을 수행하고 다음과 같은 모델 중 하나를 분석할 수 있다. <78> ●관심지역 모델(4.1) <79> ●머리모델(7.4) <80> ●얼굴모델(7.5) <81> ●얼굴의 인체측정학적 지점에 대한 정보를 수록하고 있는 얼굴 정밀 모델(7.6) <82> ●추적 피사체 모델(8.3) <83> 각 모델은 해당 피사체의 위치, 형태, 크기, 구조에 대한 정보를 수록하고 있다. 머리, 얼굴, 얼굴 특성에 대 <84> 하여 추적 모드를 시작할 경우 일반 모델 정보와 피사체 이동 특성을 통합하는 추적 대상 모델이 생성된다. 모 델 분석은 그에 해당하는 이미지 부분의 분석과 함께 공동으로 이루어진다. 이러한 분석을 수행하는 목적은 해당 저장소로부터 현재 프레임에 가장 적합한 탐지 및 위치 선정 알고리즘을 <85> 선택하기 위한 검출 피사체의 이미지 특성과 인자계산에 있다. 관심 지역 모델의 품질 특성 평가는 해당 이미지 부분에 대한 다음과 같은 인자값의 계산 결과에 의해 이루어 <86> 진다. ●명암 <87> - 10 -공개특허 10-2009-0053295●대비(contrast) <88> ●포커싱(focusing) 개수 <89> ●피사체 조명 타입 <90> 머리 모델 품질 특성의 평가는 다음과 같은 인자를 계산하게 된다. <91> ●이미지 단편의 명도 <92> ●이미지 단편의 대비 <93> ●포커싱 개수 <94> ●머리 피사체의 조명 타입 <95> ●머리 카메라 앵글의 평가 <96> ●얼굴 유사성 계수 평가 <97> 얼굴 모델 품질 특성을 평가하기 위하여 다음과 같은 인자들을 계산한다. <98> ●이미지 단편의 명도 <99> ●이미지 단편의 대비 <100> ●포커싱 개수 <101> ●얼굴 피사체의 조명 타입 <102> ●얼굴 카메라 앵글의 평가 <103> ●얼굴 일부를 가린 부수적 피사체의 존재여부 평가 <104> ●얼굴 유사성 계수 평가 <105> 얼굴 정밀 모델 품질특성 평가는 다음과 같은 인자를 계산할 수 있다. <106> ●이미지 단편의 명도 <107> ●이미지 단편의 대비 <108> ●포커싱 개수 <109> ●얼굴 피사체의 조명 타입 <110> ●얼굴 카메라 앵글의 정밀 평가 <111> ●얼굴 유사헝 계수 정밀 평가 <112> ●인자를 위한 얼굴 개별 부분(눈,코)의 유효성 평가 <113> 피사체 탐지 및 추적 방법 선택 장치는 현재 프레임의 효율적인 처리를 위하여, 즉 현재 화면상태에 따라서 <114> 탐지 전력을 세밀화하기 위하여 탐지 알고리즘을 적합화하기 위한 것이며, 정해진 조건에 대하여 가장 적합한 이미지 분석 및 분류 알고리즘을 자동으로 선택하는 시스템이다. 선택은 기존에 있는 저장소에서 수행된다. 본 장치의 기반은 미리 학습된 아키텍쳐 SNoW(D.Roth, M-H Yang and N Ahuja, \"SNoW-기반 얼굴 감지기\", 신경 <115> 처리 정보 시스템의 발전 12(NIPS 12), MIT Press, Cambridge, MA, pp.855-861, 2000 [5] 참조)를 지닌 신경망 셋트이고 그 각각은 위에 언급된 모델들 중 하나 및 3개의 저장소와 짝을 이룬다. 신경망 입구에는 해당 모델과 이미지의 품질평가 벡터가 연결된다. 신경망 출구는 해당 저장소에서 나온 알고 <116> 리즘 인덱스 셋트로, 이것은 해당 이미지의 향후 위치 선정 과정을 수행하기에 가장 적합하게 구성되어 있다. 알고리즘은 3개의 저장소로 분류된다. <117> ●초기 머리와 얼굴 위치 선정 방법 저장소(6.1)-이러한 그룹화 방법은 이미지에 대하여 관심구역 분석을 하기 <118> 위한 것이며, 머리의 좌표와 크기를 측정하는 방법으로 사람의 얼굴 위치에 대하여 근접한 평가를 수행할 수 있다. - 11 -공개특허 10-2009-0053295●얼굴의 정밀 위치 선정 및 등급 세분화 방법 저장소(6.2)- 이 그룹의 알고리즘은 검출된 얼굴에 근접한 지역 <119> 에서 수행되는데, 이미지에 대하여 얼굴의 정밀 위치 선정을 수행하고, 사진이나 밀랍인형이 아닌 실제 사람의 얼굴을 구분하기 위해 발견된 피사체를 분류한다. ●얼굴 요소 고정밀 위치 선정 방법 저장소(6.3)- 이러한 것에 기반한 방법들을 정확하게 위치가 선정된 얼굴 <120> 부위에 적용할 수 있다. 그 용도는 눈썹 경계, 눈꼬리, 눈 중앙, 콧날, 입가와 같은 피사체, 얼굴의 인체측정 학적 특성을 정밀하게 검출하는 것이다. 이 단계에서 선택된 방법과 알고리즘은 얼굴 피사체 탐지 장치로 전달되거나, 시스템이 추적 모드에 있을 <121> 경우에는 얼굴 피사체 추적 장치로 전달된다. 얼굴 피사체 탐지 장치는 이전 단계에서 선택된 알고리즘을 적용하는 방법으로 피사체와 이미 존재하는 해 <122> 당 모델의 검출 수행한다. 이러한 알고리즘은 머리, 얼굴, 얼굴요소들의 위치 선정 블록(7.1, 7.2, 7.3) 각각 에 의해 수행된다. 알고리즘 적용 결과에 따라 위치 선정된 피사체의 모델이 만들어진다. 이렇게 얻은 모델은 추적 대상 생성을 위해 얼굴 피사체 추적 장치로 전달된다. 얼굴 피사체 추적 장치는 이전 프레임과 피사체의 움직임 정보를 이용하여 목표하는 피사체를 신속하게 탐 <123> 지한다. 1)이미 발견된 프레임에서 피사체의 특성을 나타내는 기준점들을 구분한다. <124> 2)많은 지점들의 광학적 흐름을 분석하고 운동 인자를 계산한다. <125> 3)다음 프레임에서 기준 지점 주변의 가장 확률이 높은 해당 지점 한개를 탐색한다. <126> 4)지점들의 일관성을 확인하고, 탐지된 피사체의 확실성이 낮을 경우 검출 블록의 절차를 가동시킨다. <127> 추적 과정이 종료되면 추적 대상 생성기(8.2)는 다음 프레임에서 추적을 하기 위해 추적 피사체 모델(8.3)을 <128> 생성할 수 있다. 열거한 모든 장치들은 독립적으로 별도의 프로세서에서 실현될 수 있으며 예를 들어서 디지털 시그널 프로세서 <129> 에서 구현될 수 있다. 본 기술의 적용범위는 무엇보다도 다음과 같은 과제를 해결하는 시스템이 될 수 있다. <130> ●사용자 식별: 본 방법은 현재 화면 조건에 검출 알고리즘을 적합화시킴으로써 접근제어 시스템의 정밀도와 <131> 생산성을 향상시킨다. ●인간-기계의 인터페이스 장치 제어, 예를 들어 사람의 몸짓을 사용하여 컴퓨터 제어 <132> ●로보트 시력 <133> ●화상회의 <134> 본 장치를 실현하는데 선호되는 방식은 자동 지능형 비디오 감시 시스템, 생물 측정학 시스템을 비록한 보안 <135> 경비 시스템 등에 얼굴에 따라 개인을 탐지하고 인식하는 품질을 향상시키기 위한 목적으로 사용하는 것이다. 실험, 샘플 기기는 2D 이미지 센서와 최소한 한개 또는 여러개의 신호처리기로 구성되는 장치 기판 형태로 구 <136> 현될 수도 있다."}
