{"patent_id": "10-2015-0155183", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2017-0052984", "출원번호": "10-2015-0155183", "발명의 명칭": "사용자의 위치를 결정하는 전자 장치 및 그 제어 방법", "출원인": "삼성전자주식회사", "발명자": "박선응"}}
{"patent_id": "10-2015-0155183", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,제 1 방향으로 배치된 복수 개의 픽셀을 포함하는 센서;상기 센서에 전기적으로 연결된 프로세서; 및상기 프로세서에 전기적으로 연결된 메모리를 포함하며,상기 메모리는, 실행시에 상기 프로세서가,상기 센서에서 센싱된 센싱 데이터를 이용하여 사용자의 위치 정보를 판단하고,상기 사용자의 위치 정보에 대응하는 동작을 수행하는 인스트럭션을 저장하는 전자 장치."}
{"patent_id": "10-2015-0155183", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 메모리는, 실행시에 상기 프로세서가,상기 센싱 데이터를 이용하여, 상기 복수 개의 픽셀을 배경에 대응하는 픽셀과 인물에 대응하는 픽셀로 분리하고,상기 인물에 대응하는 픽셀에 기초하여 상기 사용자의 위치 정보를 판단하는 인스트럭션을 저장하는 전자 장치."}
{"patent_id": "10-2015-0155183", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 메모리는, 실행시에 상기 프로세서가,상기 센싱 데이터로부터 특징점을 판단하고,상기 판단된 특징점에 기초하여 상기 복수 개의 픽셀을 상기 배경에 대응하는 픽셀과 상기 인물에 대응하는 픽셀로 분리하는 인스트럭션을 저장하는 전자 장치."}
{"patent_id": "10-2015-0155183", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 2 항에 있어서,상기 메모리는, 실행시에 상기 프로세서가,상기 인물에 대응하는 픽셀의 위치에 기초하여, 상기 사용자의 좌우 방향 위치 또는 상하 방향 위치를 판단하는인스트럭션을 저장하는 전자 장치."}
{"patent_id": "10-2015-0155183", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 2 항에 있어서,상기 메모리는, 실행시에 상기 프로세서가,상기 인물에 대응하는 픽셀의 개수에 기초하여, 상기 사용자 및 상기 전자 장치 사이의 거리 정보를 판단하는인스트럭션을 저장하는 전자 장치."}
{"patent_id": "10-2015-0155183", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2017-0052984-3-제 2 항에 있어서,상기 센서의 상기 복수 개의 픽셀 각각은 복수 개의 서브 픽셀을 포함하며,상기 메모리는, 실행시에 상기 프로세서가,상기 인물에 대응하는 픽셀 각각의 복수 개의 서브 픽셀에서 센싱된 센싱 데이터의 차이에 기초하여, 상기 사용자 및 상기 전자 장치 사이의 거리 정보를 판단하는 인스트럭션을 저장하는 전자 장치."}
{"patent_id": "10-2015-0155183", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 2 항에 있어서,상기 센서는, 상기 제 1 방향으로 배치된 복수 개의 픽셀을 포함하는 제 1 픽셀 어레이와, 상기 제 1 방향으로배치된 또 다른 복수 개의 픽셀을 포함하는 제 2 픽셀 어레이를 포함하고,상기 메모리는, 실행시에 상기 프로세서가,상기 제 1 픽셀 어레이 중 인물에 대응하는 픽셀 및 상기 제 2 픽셀 어레이 중 인물에 대응하는 픽셀 사이의 차이에 기초하여, 상기 사용자 및 상기 전자 장치 사이의 거리 정보를 판단하는 인스트럭션을 저장하는 전자장치."}
{"patent_id": "10-2015-0155183", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서,상기 메모리는, 실행시에 상기 프로세서가,상기 제 1 픽셀 어레이 중 인물에 대응하는 픽셀 및 상기 제 2 픽셀 어레이 중 인물에 대응하는 픽셀에 대하여스테레오 비전(stereo vision) 기법을 적용하고, 적용 결과에 기초하여 상기 사용자 및 상기 전자 장치 사이의거리 정보를 판단하는 인스트럭션을 저장하는 전자 장치."}
{"patent_id": "10-2015-0155183", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 2 항에 있어서,상기 메모리는, 상기 센싱 데이터와 관련된 참조용 데이터베이스를 미리 저장하고,실행시에 상기 프로세서가,상기 센싱 데이터와 상기 참조용 데이터베이스를 비교하고,상기 비교 결과를 이용하여 상기 사용자의 위치 정보를 판단하는 인스트럭션을 저장하는 전자 장치."}
{"patent_id": "10-2015-0155183", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9 항에 있어서,상기 메모리는, 실행시에 상기 프로세서가,상기 센싱 데이터 및 상기 참조용 데이터베이스 사이의 차 영상을 생성하고,상기 차 영상의 복수 개의 픽셀을 배경에 대응하는 픽셀과 인물에 대응하는 픽셀로 분리하고,상기 인물에 대응하는 픽셀에 기초하여 상기 사용자의 위치 정보를 판단하는 인스트럭션을 저장하는 전자 장치."}
{"patent_id": "10-2015-0155183", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 2 항에 있어서,상기 센서는, 시간의 흐름에 따라서 복수 개의 센싱 데이터를 센싱하고,상기 메모리는, 실행시에 상기 프로세서가,상기 시간의 흐름에 따라 센싱된 복수 개의 센싱 데이터 각각을 이용하여, 상기 복수 개의 픽셀을 배경에 대응하는 픽셀과 인물에 대응하는 픽셀로 분리하고,공개특허 10-2017-0052984-4-상기 인물에 대응하는 픽셀의 시간의 흐름에 따른 변경에 기초하여, 상기 사용자의 이동 정보를 판단하는 인스트럭션을 저장하는 전자 장치."}
{"patent_id": "10-2015-0155183", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 1 방향으로 배치된 복수 개의 픽셀을 포함하는 전자 장치의 제어 방법에 있어서,상기 복수 개의 픽셀에서 센싱된 센싱 데이터를 이용하여 사용자의 위치 정보를 판단하는 동작; 및상기 사용자의 위치 정보에 대응하는 동작을 수행하는 동작을 포함하는 전자 장치의 제어 방법."}
{"patent_id": "10-2015-0155183", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 12 항에 있어서,상기 사용자의 위치 정보를 판단하는 동작은,상기 센싱 데이터를 이용하여, 상기 복수 개의 픽셀을 배경에 대응하는 픽셀과 인물에 대응하는 픽셀로 분리하는 동작; 및상기 인물에 대응하는 픽셀에 기초하여 상기 사용자의 위치 정보를 판단하는 동작을 포함하는 전자 장치의 제어 방법."}
{"patent_id": "10-2015-0155183", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13 항에 있어서,상기 사용자의 위치 정보를 판단하는 동작은,상기 센싱 데이터로부터 특징점을 판단하는 동작; 및상기 판단된 특징점에 기초하여 상기 복수 개의 픽셀을 상기 배경에 대응하는 픽셀과 상기 인물에 대응하는 픽셀로 분리하는 동작을 포함하는 전자 장치의 제어 방법."}
{"patent_id": "10-2015-0155183", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 13 항에 있어서,상기 사용자의 위치 정보를 판단하는 동작은,상기 인물에 대응하는 픽셀의 위치에 기초하여, 상기 사용자의 좌우 방향 위치 또는 상하 방향 위치를 판단하는전자 장치의 제어 방법."}
{"patent_id": "10-2015-0155183", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 13 항에 있어서,상기 사용자의 위치 정보를 판단하는 동작은,상기 인물에 대응하는 픽셀의 개수에 기초하여, 상기 사용자 및 상기 전자 장치 사이의 거리 정보를 판단하는전자 장치의 제어 방법."}
{"patent_id": "10-2015-0155183", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 13 항에 있어서,상기 복수 개의 픽셀 각각은 복수 개의 서브 픽셀을 포함하며,상기 사용자의 위치 정보를 판단하는 동작은,상기 인물에 대응하는 픽셀 각각의 복수 개의 서브 픽셀에서 센싱된 센싱 데이터의 차이에 기초하여, 상기 사용공개특허 10-2017-0052984-5-자 및 상기 전자 장치 사이의 거리 정보를 판단하는 전자 장치의 제어 방법."}
{"patent_id": "10-2015-0155183", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 13 항에 있어서,상기 전자 장치는, 상기 제 1 방향으로 배치된 복수 개의 픽셀을 포함하는 제 1 픽셀 어레이와, 상기 제 1 방향으로 배치된 또 다른 복수 개의 픽셀을 포함하는 제 2 픽셀 어레이를 포함하고,상기 사용자의 위치 정보를 판단하는 동작은,상기 제 1 픽셀 어레이 중 인물에 대응하는 픽셀 및 상기 제 2 픽셀 어레이 중 인물에 대응하는 픽셀 사이의 차이에 기초하여, 상기 사용자 및 상기 전자 장치 사이의 거리 정보를 판단하는 전자 장치의 제어 방법."}
{"patent_id": "10-2015-0155183", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 18 항에 있어서,상기 사용자의 위치 정보를 판단하는 동작은,상기 제 1 픽셀 어레이 중 인물에 대응하는 픽셀 및 상기 제 2 픽셀 어레이 중 인물에 대응하는 픽셀에 대하여스테레오 비전(stereo vision) 기법을 적용하는 동작; 및상기 적용 결과에 기초하여 상기 사용자 및 상기 전자 장치 사이의 거리 정보를 판단하는 동작을 포함하는 전자 장치의 제어 방법."}
{"patent_id": "10-2015-0155183", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 13 항에 있어서,상기 사용자의 위치 정보를 판단하는 동작은,상기 센싱 데이터와 참조용 데이터베이스를 비교하는 동작; 및상기 비교 결과를 이용하여 상기 사용자의 위치 정보를 판단하는 동작을 포함하는 전자 장치의 제어 방법."}
{"patent_id": "10-2015-0155183", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제 20 항에 있어서,상기 사용자의 위치 정보를 판단하는 동작은,상기 센싱 데이터 및 상기 참조용 데이터베이스 사이의 차 영상을 생성하는 동작;상기 차 영상의 복수 개의 픽셀을 배경에 대응하는 픽셀과 인물에 대응하는 픽셀로 분리하는 동작; 및상기 인물에 대응하는 픽셀에 기초하여 상기 사용자의 위치 정보를 판단하는 동작을 포함하는 전자 장치의 제어 방법."}
{"patent_id": "10-2015-0155183", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제 13 항에 있어서,상기 복수 개의 픽셀 각각은, 시간의 흐름에 따라서 복수 개의 센싱 데이터를 센싱하고,상기 사용자의 위치 정보를 판단하는 동작은,상기 시간의 흐름에 따라 센싱된 복수 개의 센싱 데이터 각각을 이용하여, 상기 복수 개의 픽셀을 배경에 대응하는 픽셀과 인물에 대응하는 픽셀로 분리하는 동작; 및상기 인물에 대응하는 픽셀의 시간의 흐름에 따른 변경에 기초하여, 상기 사용자의 이동 정보를 판단하는 동작공개특허 10-2017-0052984-6-을 포함하는 전자 장치의 제어 방법."}
{"patent_id": "10-2015-0155183", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "전자 장치는, 제 1 방향으로 배치된 복수 개의 픽셀을 포함하는 센서, 상기 센서에 전기적으로 연결된 프로세서 및 상기 프로세서에 전기적으로 연결된 메모리를 포함하며, 상기 메모리는, 실행시에 상기 프로세서가, 상기 센 서에서 센싱된 센싱 데이터를 이용하여 사용자의 위치 정보를 판단하고, 상기 사용자의 위치 정보에 대응하는 동 작을 수행하는 인스트럭션을 저장할 수 있다."}
{"patent_id": "10-2015-0155183", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 사용자의 위치를 결정하는 전자 장치 및 그 제어 방법에 관한 것으로, 더욱 상세하게는 결정된 사용 자의 위치에 대응하는 동작을 수행하는 전자 장치 및 그 제어 방법에 관한 것이다."}
{"patent_id": "10-2015-0155183", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "종래에는, 실내에서 사용자의 위치를 인식하는 방법으로서 카메라를 이용하는 방법과 센서를 이용하는 방법이 제안된 바 있다. 카메라를 이용하는 방법의 경우, 종래의 전자 장치는 영상을 실시간으로 입력받아, 영상처리 기술을 통해 사용자를 구분한다. 또한, 종래의 전자 장치는 두 대의 카메라를 이용하여 전자 장치로부터 사용 자까지의 거리나 각도 등의 정교한 정보를 계산할 수 있다. 종래의 전자 장치, 예를 들어 TV는 상부 베젤의 중 앙부분에 배치된 카메라를 포함하며, 카메라를 이용하여 획득한 영상을 이용하여 사용자의 위치 정보를 결정할 수 있다. 센서를 이용하는 방법의 경우, 종래의 전자 장치는 광량 센서나 초음파 센서를 이용하며 사용자의 유 무 또는 사용자로부터 전자 장치까지의 거리를 결정할 수 있다. 센서를 이용하는 방법은 비용적인 측면에서 유 리하다."}
{"patent_id": "10-2015-0155183", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "카메라를 이용하는 방법의 경우, 영상 처리를 위해 상대적으로 고가의 하드웨어와 연산량이 요구된다. 아울러, 전자 장치가 카메라를 포함하여야 하므로, 설치 공간이 요구되어 소형화에 불리하다. 또한, 최근들어 전자 장 치의 해킹이 빈번하게 발생하고 있으며, 카메라를 이용한 전자 장치가 해킹된 경우 사용자의 사생활이 침해될 가능성이 존재한다. 센서를 이용하는 방법의 경우, 정확도와 해상도가 낮아 단순한 사용자 유무 판단만이 가능 하다. 따라서, 양 방법의 단점을 보완하여, 사생활 침해 가능성을 줄이면서 더욱 상세한 사용자의 위치 정보를 획득할 수 있는 전자 장치 및 그 제어 방법의 개발이 요청되는 바이다."}
{"patent_id": "10-2015-0155183", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 다양한 실시예에 의한 전자 장치는, 제 1 방향으로 배치된 복수 개의 픽셀을 포함하는 센서; 상기 센 서에 전기적으로 연결된 프로세서; 및 상기 프로세서에 전기적으로 연결된 메모리를 포함하며, 상기 메모리는, 실행시에 상기 프로세서가, 상기 센서에서 센싱된 센싱 데이터를 이용하여 사용자의 위치 정보를 판단하고, 상 기 사용자의 위치 정보에 대응하는 동작을 수행하는 인스트럭션을 저장할 수 있다. 본 발명의 다양한 실시예에 따라서, 제 1 방향으로 배치된 복수 개의 픽셀을 포함하는 전자 장치의 제어 방법은, 상기 복수 개의 픽셀에서 센싱된 센싱 데이터를 이용하여 사용자의 위치 정보를 판단하는 동작; 및 상 기 사용자의 위치 정보에 대응하는 동작을 수행하는 동작을 포함할 수 있다."}
{"patent_id": "10-2015-0155183", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 다양한 실시예에 따라서, 사생활 침해 가능성을 줄이면서 더욱 상세한 사용자의 위치 정보를 획득할 수 있는 전자 장치 및 그 제어 방법의 개발이 제공될 수 있다. 특히, 센서 어레이는 소형화가 가능하여 배치의 위치가 상대적으로 제한적이지 않아, 사용자의 위치 정보가 요구되는 어떠한 지점에도 배치될 수 있다."}
{"patent_id": "10-2015-0155183", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 문서의 다양한 실시예가 첨부된 도면을 참조하여 기재된다. 그러나, 이는 본 문서에 기재된 기술을 특 정한 실시 형태에 대해 한정하려는 것이 아니며, 본 문서의 실시예의 다양한 변경(modifications), 균등물 (equivalents), 및/또는 대체물(alternatives)을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 본 문서에서, \"가진다,\" \"가질 수 있다,\" \"포함한다,\" 또는 \"포함할 수 있다\" 등의 표현은 해당 특징(예: 수치, 기능, 동작, 또는 부품 등의 구성요소)의 존재를 가리키며, 추가적인 특징의 존재를 배제하지 않는다. 본 문서에서, \"A 또는 B,\" \"A 또는/및 B 중 적어도 하나,\" 또는 \"A 또는/및 B 중 하나 또는 그 이상\"등의 표현 은 함께 나열된 항목들의 모든 가능한 조합을 포함할 수 있다. 예를 들면, \"A 또는 B,\" \"A 및 B 중 적어도 하나,\" 또는 \"A 또는 B 중 적어도 하나\"는, 적어도 하나의 A를 포함, 적어도 하나의 B를 포함, 또는 적어도 하나의 A 및 적어도 하나의 B 모두를 포함하는 경우를 모두 지칭할 수 있다. 본 문서에서 사용된 \"제 1,\" \"제 2,\" \"첫째,\" 또는 \"둘째,\"등의 표현들은 다양한 구성요소들을, 순서 및/또는 중요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구성요소들 을 한정하지 않는다. 예를 들면, 제 1 사용자 기기와 제 2 사용자 기기는, 순서 또는 중요도와 무관하게, 서로 다른 사용자 기기를 나타낼 수 있다. 예를 들면, 본 문서에 기재된 권리 범위를 벗어나지 않으면서 제 1 구성요 소는 제 2 구성요소로 명명될 수 있고, 유사하게 제 2 구성요소도 제 1 구성요소로 바꾸어 명명될 수 있다. 어떤 구성요소(예: 제 1 구성요소)가 다른 구성요소(예: 제 2 구성요소)에 \"(기능적으로 또는 통신적으로) 연결 되어((operatively or communicatively) coupled with/to)\" 있다거나 \"접속되어(connected to)\" 있다고 언급된 때에는, 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로 연결되거나, 다른 구성요소(예: 제 3 구성요소)를 통하여 연결될 수 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소(예: 제 1 구성요소)가 다 른 구성요소(예: 제 2 구성요소)에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 상기 어 떤 구성요소와 상기 다른 구성요소 사이에 다른 구성요소(예: 제 3 구성요소)가 존재하지 않는 것으로 이해될 수 있다. 본 문서에서 사용된 표현 \"~하도록 구성된(또는 설정된)(configured to)\"은 상황에 따라, 예를 들면, \"~에 적합 한(suitable for),\" \"~하는 능력을 가지는(having the capacity to),\" \"~하도록 설계된(designed to),\" \"~하도 록 변경된(adapted to),\" \"~하도록 만들어진(made to),\" 또는 \"~를 할 수 있는(capable of)\"과 바꾸어 사용될 수 있다. 용어 \"~하도록 구성된(또는 설정된)\"은 하드웨어적으로 \"특별히 설계된(specifically designed to)\" 것만을 반드시 의미하지 않을 수 있다. 대신, 어떤 상황에서는, \"~하도록 구성된 장치\"라는 표현은, 그 장치가 다른 장치 또는 부품들과 함께 \"~할 수 있는\" 것을 의미할 수 있다. 예를 들면, 문구 \"A, B, 및 C를 수행하도록 구성된(또는 설정된) 프로세서\"는 해당 동작을 수행하기 위한 전용 프로세서(예: 임베디드 프로세서), 또는 메 모리 장치에 저장된 하나 이상의 소프트웨어 프로그램들을 실행함으로써, 해당 동작들을 수행할 수 있는 범용 프로세서(generic-purpose processor)(예: CPU 또는 application processor)를 의미할 수 있다. 본 문서에서 사용된 용어들은 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 다른 실시예의 범위를 한정 하려는 의도가 아닐 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 용어들은 본 문서에 기재된 기술 분야에서 통상 의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가질 수 있다. 본 문서에 사용된 용어들 중 일반적인 사전에 정의된 용어들은, 관련 기술의 문맥상 가지는 의미와 동일 또는 유사한 의미로 해석될 수 있으 며, 본 문서에서 명백하게 정의되지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 경우에 따라서, 본 문서에서 정의된 용어일지라도 본 문서의 실시예들을 배제하도록 해석될 수 없다. 본 문서의 다양한 실시예들에 따른 전자 장치는, 예를 들면, 스마트폰(smartphone), 태블릿 PC(tablet personal computer), 이동 전화기(mobile phone), 영상 전화기, 전자책 리더기(e-book reader), 데스크탑 PC(desktop personal computer), 랩탑 PC(laptop personal computer), 넷북 컴퓨터(netbook computer), 워크스테이션 (workstation), 서버, PDA(personal digital assistant), PMP(portable multimedia player), MP3 플레이어, 모바일 의료기기, 카메라(camera), 또는 웨어러블 장치(wearable device) 중 적어도 하나를 포함할 수 있다. 다 양한 실시예에 따르면, 웨어러블 장치는 액세서리형(예: 시계, 반지, 팔찌, 발찌, 목걸이, 안경, 콘택트 렌즈, 또는 머리 착용형 장치(head-mounted-device(HMD)), 직물 또는 의류 일체형(예: 전자 의복), 신체 부착형(예: 스킨 패드(skin pad) 또는 문신), 또는 생체 이식형(예: implantable circuit) 중 적어도 하나를 포함할 수 있 다. 한편, 전자 장치는 무선으로 무선 전력 송신기로부터 전력을 수신할 수도 있으며, 이에 따라 전자 장치는 무선 전력 수신기로 명명될 수 있다. 어떤 실시예들에서, 전자 장치는 가전 제품(home appliance)일 수 있다. 가전 제품은, 예를 들면, 텔레비전, DVD(digital video disk) 플레이어, 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스(set-top box), 홈 오토매이션 컨트롤 패널(home automation control panel), 보안 컨트롤 패널 (security control panel), TV 박스(예: 삼성 HomeSyncTM, 애플TVTM, 또는 구글 TVTM), 게임 콘솔(예: XboxTM, PlayStationTM), 전자 사전, 전자 키, 캠코더(camcorder), 또는 전자 액자 중 적어도 하나를 포함할 수 있다. 다른 실시예에서, 전자 장치는, 각종 의료기기(예: 각종 휴대용 의료측정기기(혈당 측정기, 심박 측정기, 혈압 측정기, 또는 체온 측정기 등), MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 또는 초음파기 등), 네비게이션(navigation) 장치, 위성 항법 시스템 (GNSS(global navigation satellite system)), EDR(event data recorder), FDR(flight data recorder), 자동 차 인포테인먼트(infotainment) 장치, 선박용 전자 장비(예: 선박용 항법 장치, 자이로 콤파스 등), 항공 전자 기기(avionics), 보안 기기, 차량용 헤드 유닛(head unit), 산업용 또는 가정용 로봇, 금융 기관의 ATM(automatic teller's machine), 상점의 POS(point of sales), 또는 사물 인터넷 장치(internet of things) (예: 전구, 각종 센서, 전기 또는 가스 미터기, 스프링클러 장치, 화재경보기, 온도조절기(thermostat), 가로등, 토스터(toaster), 운동기구, 온수탱크, 히터, 보일러 등) 중 적어도 하나를 포함할 수 있다. 어떤 실시예에 따르면, 전자 장치는 가구(furniture) 또는 건물/구조물의 일부, 전자 보드(electronic board), 전자 사인 수신 장치(electronic signature receiving device), 프로젝터(projector), 또는 각종 계측기기(예: 수도, 전기, 가스, 또는 전파 계측 기기 등) 중 적어도 하나를 포함할 수 있다. 다양한 실시예에서, 전자 장치는 전술한 다양한 장치들 중 하나 또는 그 이상의 조합일 수 있다. 어떤 실시예에 따른 전자 장치는 플렉서블 전자 장치일 수 있다. 또한, 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되지 않으며, 기술 발전에 따른 새로운 전자 장치를 포함할 수 있다. 이하, 첨부 도면을 참조하여, 다양한 실시예에 따른 전자 장치가 설명된다. 본 문서에서, 사용자라는 용어는 전 자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공지능 전자 장치)를 지칭할 수 있다. 도 1을 참조하여, 다양한 실시예에서의, 네트워크 환경 내의 전자 장치가 기재된다. 전자 장치 는 버스, 프로세서, 메모리, 입출력 인터페이스, 디스플레이, 및 통신 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장치는, 구성요소들 중 적어도 하나를 생략하거나 다른 구성요 소를 추가적으로 구비할 수 있다. 버스는, 예를 들면, 구성요소들(110-170)을 서로 연결하고, 구성요소들 간의 통신(예: 제어 메시지 및/또 는 데이터)을 전달하는 회로를 포함할 수 있다. 프로세서는, 중앙처리장치(central processing unit(CPU)), 어플리케이션 프로세서(application processor(AP)), 또는 커뮤니케이션 프로세서(communication processor(CP)) 중 하나 또는 그 이상을 포함할 수 있다. 프로세서는, 예를 들면, 전자 장치의 적어도 하나의 다른 구성요소들의 제어 및/또는 통신 에 관한 연산이나 데이터 처리를 실행할 수 있다. 메모리는, 휘발성 및/또는 비휘발성 메모리를 포함할 수 있다. 메모리는, 예를 들면, 전자 장치(10 1)의 적어도 하나의 다른 구성요소에 관계된 명령 또는 데이터를 저장할 수 있다. 한 실시예에 따르면, 메모리 는 소프트웨어 및/또는 프로그램을 저장할 수 있다. 프로그램은, 예를 들면, 커널, 미들웨 어, 어플리케이션 프로그래밍 인터페이스(application programming interface(API)), 및/또는 어플 리케이션 프로그램(또는 \"어플리케이션\") 등을 포함할 수 있다. 커널, 미들웨어, 또는 API(14 5)의 적어도 일부는, 운영 시스템(operating system(OS))으로 지칭될 수 있다. 커널은, 예를 들면, 다른 프로그램들(예: 미들웨어, API, 또는 어플리케이션 프로그램)에 구현된 동작 또는 기능을 실행하는 데 사용되는 시스템 리소스들(예: 버스, 프로세서, 또는 메모리 등)을 제어 또는 관리할 수 있다. 또한, 커널은 미들웨어, API, 또는 어플리케이션 프로 그램에서 전자 장치의 개별 구성요소에 접근함으로써, 시스템 리소스들을 제어 또는 관리할 수 있는 인터페이스를 제공할 수 있다. 미들웨어는, 예를 들면, API 또는 어플리케이션 프로그램이 커널과 통신하여 데이터를 주 고받을 수 있도록 중개 역할을 수행할 수 있다. 또한, 미들웨어는 어플리케이션 프로그램으로부터 수신된 하나 이상의 작업 요청들을 우선 순위에 따 라 처리할 수 있다. 예를 들면, 미들웨어는 어플리케이션 프로그램 중 적어도 하나에 전자 장치(10 1)의 시스템 리소스(예: 버스, 프로세서, 또는 메모리 등)를 사용할 수 있는 우선 순위를 부여 할 수 있다. 예컨대, 미들웨어는 상기 적어도 하나에 부여된 우선 순위에 따라 상기 하나 이상의 작업 요 청들을 처리함으로써, 상기 하나 이상의 작업 요청들에 대한 스케쥴링 또는 로드 밸런싱 등을 수행할 수 있다. API는, 예를 들면, 어플리케이션이 커널 또는 미들웨어에서 제공되는 기능을 제어하기 위 한 인터페이스로, 예를 들면, 파일 제어, 창 제어, 영상 처리, 또는 문자 제어 등을 위한 적어도 하나의 인터페 이스 또는 함수(예: 명령어)를 포함할 수 있다. 입출력 인터페이스는, 예를 들면, 사용자 또는 다른 외부 기기로부터 입력된 명령 또는 데이터를 전자 장 치의 다른 구성요소(들)에 전달할 수 있는 인터페이스의 역할을 할 수 있다. 또한, 입출력 인터페이스 는 전자 장치의 다른 구성요소(들)로부터 수신된 명령 또는 데이터를 사용자 또는 다른 외부 기기로 출력할 수 있다. 디스플레이는, 예를 들면, 액정 디스플레이(liquid crystal display(LCD)), 발광 다이오드(light- emitting diode(LED)) 디스플레이, 유기 발광 다이오드(organic light-emitting diode(OLED)) 디스플레이, 또 는 마이크로 전자기계 시스템(microelectromechanical systems(MEMS)) 디스플레이, 또는 전자종이(electronic paper) 디스플레이를 포함할 수 있다. 디스플레이는, 예를 들면, 사용자에게 각종 콘텐츠(예: 텍스트, 이 미지, 비디오, 아이콘, 또는 심볼 등)을 표시할 수 있다. 디스플레이는, 터치 스크린을 포함할 수 있으며,예를 들면, 전자 펜 또는 사용자의 신체의 일부를 이용한 터치, 제스쳐, 근접, 또는 호버링 입력을 수신할 수 있다. 통신 모듈은, 예를 들면, 전자 장치와 외부 장치(예: 제 1 외부 전자 장치, 제 2 외부 전자 장 치, 또는 서버) 간의 통신을 설정할 수 있다. 예를 들면, 통신 모듈은 무선 통신 또는 유선 통 신을 통해서 네트워크에 연결되어 외부 장치(예: 제 2 외부 전자 장치 또는 서버)와 통신할 수 있다. 센서는 제 1 방향으로 나열되는 복수 개의 픽셀을 포함할 수 있으며, 이에 따라 1차원 이미지에 대응하는 센싱 데이터를 센싱하여, 프로세서로 출력할 수 있다. 센서에 대한 더욱 상세한 설명은 후술하도록 한다. 무선 통신은, 예를 들면, 셀룰러 통신 프로토콜로서, 예를 들면, LTE(long-term evolution), LTE-A(LTE Advance), CDMA(code division multiple access), WCDMA(wideband CDMA), UMTS(universal mobile telecommunications system), WiBro(Wireless Broadband), 또는 GSM(Global System for Mobile Communications) 등 중 적어도 하나를 사용할 수 있다. 또한, 무선 통신은, 예를 들면, 근거리 통신을 포 함할 수 있다. 근거리 통신은, 예를 들면, WiFi(wireless fidelity), 블루투스(Bluetooth), NFC(near field communication), 또는 GNSS(global navigation satellite system) 등 중 적어도 하나를 포함할 수 있다. GNSS는 사용 지역 또는 대역폭 등에 따라, 예를 들면, GPS(Global Positioning System), Glonass(Global Navigation Satellite System), Beidou Navigation Satellite System(이하 \"Beidou\") 또는 Galileo, the European global satellite-based navigation system 중 적어도 하나를 포함할 수 있다. 이하, 본 문서에서는, \"GPS\"는 \"GNSS\"와 혼용되어 사용(interchangeably used)될 수 있다. 유선 통신은, 예를 들면, USB(universal serial bus), HDMI(high definition multimedia interface), RS-232(recommended standard232), 또는 POTS(plain old telephone service) 등 중 적어도 하나를 포함할 수 있다. 네트워크는 통신 네트워크 (telecommunications network), 예를 들면, 컴퓨터 네트워크(computer network)(예: LAN 또는 WAN), 인터넷, 또는 전화 망(telephone network) 중 적어도 하나를 포함할 수 있다. 제 1 및 제 2 외부 전자 장치(102, 104) 각각은 전자 장치와 동일한 또는 다른 종류의 장치일 수 있다. 한 실시예에 따르면, 서버는 하나 또는 그 이상의 서버들의 그룹을 포함할 수 있다. 다양한 실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 다른 하나 또는 복수의 전자 장치(예: 전자 장치 (102,104), 또는 서버에서 실행될 수 있다. 한 실시예에 따르면, 전자 장치가 어떤 기능이나 서비스 를 자동으로 또는 요청에 의하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시 키는 대신에 또는 추가적으로, 그와 연관된 적어도 일부 기능을 다른 장치(예: 전자 장치(102, 104), 또는 서버 )에게 요청할 수 있다. 다른 전자 장치(예: 전자 장치(102, 104), 또는 서버)는 요청된 기능 또는 추 가 기능을 실행하고, 그 결과를 전자 장치로 전달할 수 있다. 전자 장치는 수신된 결과를 그대로 또 는 추가적으로 처리하여 요청된 기능이나 서비스를 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 본 발명의 다양한 실시예에서, 상기 메모리는, 실행시에 상기 프로세서가, 상기 센서에서 센싱된 센 싱 데이터를 이용하여 사용자의 위치 정보를 판단하고, 상기 사용자의 위치 정보에 대응하는 동작을 수행하는 인스트럭션을 저장할 수 있다. 본 발명의 다양한 실시예에서, 상기 메모리는, 실행시에 상기 프로세서가, 상기 센싱 데이터를 이용 하여, 상기 복수 개의 픽셀을 배경에 대응하는 픽셀과 인물에 대응하는 픽셀로 분리하고, 상기 인물에 대응하는 픽셀에 기초하여 상기 사용자의 위치 정보를 판단하는 인스트럭션을 저장할 수 있다. 본 발명의 다양한 실시예에서, 상기 메모리는, 실행시에 상기 프로세서가, 상기 센싱 데이터로부터 특징점을 판단하고, 상기 판단된 특징점에 기초하여 상기 복수 개의 픽셀을 상기 배경에 대응하는 픽셀과 상기 인물에 대응하는 픽셀로 분리하는 인스트럭션을 저장할 수 있다. 본 발명의 다양한 실시예에서, 상기 메모리는, 실행시에 상기 프로세서가, 상기 인물에 대응하는 픽 셀의 위치에 기초하여, 상기 사용자의 좌우 방향 위치 또는 상하 방향 위치를 판단하는 인스트럭션을 저장할 수 있다. 본 발명의 다양한 실시예에서, 상기 메모리는, 실행시에 상기 프로세서가, 상기 인물에 대응하는 픽 셀의 개수에 기초하여, 상기 사용자 및 상기 전자 장치 사이의 거리 정보를 판단하는 인스트럭션을 저장할 수있다. 본 발명의 다양한 실시예에서, 상기 센서의 상기 복수 개의 픽셀 각각은 복수 개의 서브 픽셀을 포함하며, 상기 메모리는, 실행시에 상기 프로세서가, 상기 인물에 대응하는 픽셀 각각의 복수 개의 서브 픽셀 에서 센싱된 센싱 데이터의 차이에 기초하여, 상기 사용자 및 상기 전자 장치 사이의 거리 정보를 판단하는 인 스트럭션을 저장할 수 있다. 본 발명의 다양한 실시예에서, 상기 센서는, 상기 제 1 방향으로 배치된 복수 개의 픽셀을 포함하는 제 1 픽셀 어레이와, 상기 제 1 방향으로 배치된 또 다른 복수 개의 픽셀을 포함하는 제 2 픽셀 어레이를 포함하고, 상기 메모리는, 실행시에 상기 프로세서가, 상기 제 1 픽셀 어레이 중 인물에 대응하는 픽셀 및 상기 제 2 픽셀 어레이 중 인물에 대응하는 픽셀 사이의 차이에 기초하여, 상기 사용자 및 상기 전자 장치 사이의 거 리 정보를 판단하는 인스트럭션을 저장할 수 있다. 본 발명의 다양한 실시예에서, 상기 메모리는, 실행시에 상기 프로세서가, 상기 제 1 픽셀 어레이 중 인물에 대응하는 픽셀 및 상기 제 2 픽셀 어레이 중 인물에 대응하는 픽셀에 대하여 스테레오 비전(stereo vision) 기법을 적용하고, 적용 결과에 기초하여 상기 사용자 및 상기 전자 장치 사이의 거리 정보를 판단하는 인스트럭션을 저장할 수 있다. 본 발명의 다양한 실시예에서, 상기 메모리는, 상기 센싱 데이터와 관련된 참조용 데이터베이스를 미리 저 장하고, 실행시에 상기 프로세서가, 상기 센싱 데이터와 상기 참조용 데이터베이스를 비교하고, 상기 비교 결과를 이용하여 상기 사용자의 위치 정보를 판단하는 인스트럭션을 저장할 수 있다. 본 발명의 다양한 실시예에서, 상기 메모리는, 실행시에 상기 프로세서가, 상기 센싱 데이터 및 상기 참조용 데이터베이스 사이의 차 영상을 생성하고, 상기 차 영상의 복수 개의 픽셀을 배경에 대응하는 픽셀과 인 물에 대응하는 픽셀로 분리하고, 상기 인물에 대응하는 픽셀에 기초하여 상기 사용자의 위치 정보를 판단하는 인스트럭션을 저장할 수 있다. 본 발명의 다양한 실시예에서, 상기 센서는, 시간의 흐름에 따라서 복수 개의 센싱 데이터를 센싱하고, 상 기 메모리는, 실행시에 상기 프로세서가, 상기 시간의 흐름에 따라 센싱된 복수 개의 센싱 데이터 각 각을 이용하여, 상기 복수 개의 픽셀을 배경에 대응하는 픽셀과 인물에 대응하는 픽셀로 분리하고, 상기 인물에 대응하는 픽셀의 시간의 흐름에 따른 변경에 기초하여, 상기 사용자의 이동 정보를 판단하는 인스트럭션을 저장 할 수 있다. 도 2는 다양한 실시예에 따른 전자 장치의 블록도이다. 전자 장치는, 예를 들면, 도 1에 도시된 전자 장치의 전체 또는 일부를 포함할 수 있다. 전자 장치는 하나 이상의 프로세서(예: AP(application processor)), 통신 모듈, 가입자 식별 모듈, 메모리, 센서 모듈, 입력 장치, 디스플레이, 인터페이스, 오디오 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 인디케이터, 및 모터 를 포함할 수 있다. 프로세서는, 예를 들면, 운영 체제 또는 응용 프로그램을 구동하여 프로세서에 연결된 다수의 하드웨 어 또는 소프트웨어 구성요소들을 제어할 수 있고, 각종 데이터 처리 및 연산을 수행할 수 있다. 프로세서(21 0)는, 예를 들면, SoC(system on chip) 로 구현될 수 있다. 한 실시예에 따르면, 프로세서는 GPU(graphic processing unit) 및/또는 이미지 신호 프로세서(image signal processor)를 더 포함할 수 있다. 프로세서 는 도 2에 도시된 구성요소들 중 적어도 일부(예: 셀룰러 모듈)를 포함할 수도 있다. 프로세서 는 다른 구성요소들(예: 비휘발성 메모리) 중 적어도 하나로부터 수신된 명령 또는 데이터를 휘발성 메모리에 로드(load)하여 처리하고, 다양한 데이터를 비휘발성 메모리에 저장(store)할 수 있다. 통신 모듈은, 도 1의 통신 모듈과 동일 또는 유사한 구성을 가질 수 있다. 통신 모듈은, 예를 들면, 셀룰러 모듈, WiFi 모듈, 블루투스 모듈, GNSS 모듈(예: GPS 모듈, Glonass 모듈, Beidou 모듈, 또는 Galileo 모듈), NFC 모듈 및 RF(radio frequency) 모듈를 포함할 수 있다. 셀룰러 모듈은, 예를 들면, 통신망을 통해서 음성 통화, 영상 통화, 문자 서비스, 또는 인터넷 서비스 등 을 제공할 수 있다. 한 실시예에 따르면, 셀룰러 모듈은 가입자 식별 모듈(예: SIM 카드)을 이용하여 통신 네트워크 내에서 전자 장치의 구별 및 인증을 수행할 수 있다. 한 실시예에 따르면, 셀룰러 모듈 은 프로세서가 제공할 수 있는 기능 중 적어도 일부 기능을 수행할 수 있다. 한 실시예에 따르면, 셀 룰러 모듈은 커뮤니케이션 프로세서(CP: communication processor)를 포함할 수 있다.WiFi 모듈, 블루투스 모듈, GNSS 모듈 또는 NFC 모듈 각각은, 예를 들면, 해당하는 모듈 을 통해서 송수신되는 데이터를 처리하기 위한 프로세서를 포함할 수 있다. 어떤 실시예에 따르면, 셀룰러 모듈 , WiFi 모듈, 블루투스 모듈, GNSS 모듈 또는 NFC 모듈 중 적어도 일부(예: 두 개 이상)는 하나의 integrated circuit(IC) 또는 IC 패키지 내에 포함될 수 있다. RF 모듈은, 예를 들면, 통신 신호(예: RF 신호)를 송수신할 수 있다. RF 모듈은, 예를 들면, 트랜시 버(transceiver), PAM(power amp module), 주파수 필터(frequency filter), LNA(low noise amplifier), 또는 안테나 등을 포함할 수 있다. 다른 실시예에 따르면, 셀룰러 모듈, WiFi 모듈, 블루투스 모듈, GNSS 모듈 또는 NFC 모듈 중 적어도 하나는 별개의 RF 모듈을 통하여 RF 신호를 송수신할 수 있다. 가입자 식별 모듈은, 예를 들면, 가입자 식별 모듈을 포함하는 카드 및/또는 내장 SIM(embedded SIM)을 포 함할 수 있으며, 고유한 식별 정보(예: ICCID(integrated circuit card identifier)) 또는 가입자 정보(예: IMSI(international mobile subscriber identity))를 포함할 수 있다. 메모리(예: 메모리)는, 예를 들면, 내장 메모리 또는 외장 메모리를 포함할 수 있다. 내장 메모리는, 예를 들면, 휘발성 메모리(예: DRAM(dynamic RAM), SRAM(static RAM), 또는 SDRAM(synchronous dynamic RAM) 등), 비휘발성 메모리(non-volatile Memory)(예: OTPROM(one time programmable ROM), PROM(programmable ROM), EPROM(erasable and programmable ROM), EEPROM(electrically erasable and programmable ROM), mask ROM, flash ROM, 플래시 메모리(예: NAND flash 또는 NOR flash 등), 하드 드라이브, 또는 솔리드 스테이트 드라이브(solid state drive(SSD)) 중 적어도 하나를 포함할 수 있다. 외장 메모리는 플래시 드라이브(flash drive), 예를 들면, CF(compact flash), SD(secure digital), Micro-SD(micro secure digital), Mini-SD(mini secure digital), xD(extreme digital), MMC(multi-media card) 또는 메모리 스틱(memory stick) 등을 더 포함할 수 있다. 외장 메모리는 다양한 인터페이스를 통하 여 전자 장치와 기능적으로 및/또는 물리적으로 연결될 수 있다. 센서 모듈은, 예를 들면, 물리량을 계측하거나 전자 장치의 작동 상태를 감지하여, 계측 또는 감지된 정보를 전기 신호로 변환할 수 있다. 센서 모듈은, 예를 들면, 제스처 센서(240A), 자이로 센서(240B), 기 압 센서(240C), 마그네틱 센서(240D), 가속도 센서(240E), 그립 센서(240F), 근접 센서(240G), 컬러(color) 센 서(240H)(예: RGB(red, green, blue) 센서), 생체 센서(240I), 온/습도 센서(240J), 조도 센서(240K), 또는 UV(ultra violet) 센서(240M) 중의 적어도 하나를 포함할 수 있다. 추가적으로 또는 대체적으로(additionally or alternatively), 센서 모듈은, 예를 들면, 후각 센서(E-nose sensor), EMG 센서(electromyography sensor), EEG 센서(electroencephalogram sensor), ECG 센서(electrocardiogram sensor), IR(infrared) 센서, 홍채 센서 및/또는 지문 센서를 포함할 수 있다. 센서 모듈은 그 안에 속한 적어도 하나 이상의 센서들을 제어하기 위한 제어 회로를 더 포함할 수 있다. 어떤 실시예에서는, 전자 장치는 프로세서의 일부로 서 또는 별도로, 센서 모듈을 제어하도록 구성된 프로세서를 더 포함하여, 프로세서가 슬립(sleep) 상태에 있는 동안, 센서 모듈을 제어할 수 있다. 입력 장치는, 예를 들면, 터치 패널(touch panel),(디지털) 펜 센서(pen sensor), 키 (key), 또는 초음파(ultrasonic) 입력 장치를 포함할 수 있다. 터치 패널은, 예를 들면, 정전 식, 감압식, 적외선 방식, 또는 초음파 방식 중 적어도 하나의 방식을 사용할 수 있다. 또한, 터치 패널은 제어 회로를 더 포함할 수도 있다. 터치 패널은 택타일 레이어(tactile layer)를 더 포함하여, 사용자에게 촉각 반응을 제공할 수 있다. (디지털) 펜 센서는, 예를 들면, 터치 패널의 일부이거나, 별도의 인식용 쉬트(sheet)를 포함할 수 있다. 키는, 예를 들면, 물리적인 버튼, 광학식 키, 또는 키패드를 포함할 수 있다. 초음파 입력 장치는 마 이크(예: 마이크)를 통해, 입력 도구에서 발생된 초음파를 감지하여, 상기 감지된 초음파에 대응하는 데이 터를 확인할 수 있다. 디스플레이(예: 디스플레이)는 패널, 홀로그램 장치, 또는 프로젝터를 포함할 수 있 다. 패널은, 도 1의 디스플레이와 동일 또는 유사한 구성을 포함할 수 있다. 패널은, 예를 들면, 유연하게(flexible), 투명하게(transparent), 또는 착용할 수 있게(wearable) 구현될 수 있다. 패널 은 터치 패널과 하나의 모듈로 구성될 수도 있다. 홀로그램 장치는 빛의 간섭을 이용하여 입체 영상을 허공에 보여줄 수 있다. 프로젝터는 스크린에 빛을 투사하여 영상을 표시할 수 있다. 스크린은, 예 를 들면, 전자 장치의 내부 또는 외부에 위치할 수 있다. 한 실시예에 따르면, 디스플레이는 패널, 홀로그램 장치, 또는 프로젝터를 제어하기 위한 제어 회로를 더 포함할 수 있다. 인터페이스는, 예를 들면, HDMI(high-definition multimedia interface), USB(universal serial bus), 광 인터페이스(optical interface), 또는 D-sub(D-subminiature)를 포함할 수 있다. 인 터페이스는, 예를 들면, 도 1에 도시된 통신 모듈에 포함될 수 있다. 추가적으로 또는 대체적으로 (additionally and alternatively), 인터페이스는, 예를 들면, MHL(mobile high-definition link) 인터페 이스, SD(secure digital) 카드/MMC(multi-media card) 인터페이스, 또는 IrDA(infrared data association) 규 격 인터페이스를 포함할 수 있다. 오디오 모듈은, 예를 들면, 소리(sound)와 전기 신호를 쌍방향으로 변환시킬 수 있다. 오디오 모듈의 적어도 일부 구성요소는, 예를 들면, 도 1 에 도시된 입출력 인터페이스에 포함될 수 있다. 오디오 모듈 은, 예를 들면, 스피커, 리시버, 이어폰, 또는 마이크 등을 통해 입력 또는 출력되는 소리 정보를 처리할 수 있다. 카메라 모듈은, 예를 들면, 정지 영상 및 동영상을 촬영할 수 있는 장치로서, 한 실시예에 따르면, 하나 이상의 이미지 센서(예: 전면 센서 또는 후면 센서), 렌즈, ISP(image signal processor), 또는 플래시 (flash)(예: LED 또는 xenon lamp 등)를 포함할 수 있다. 전력 관리 모듈은, 예를 들면, 전자 장치의 전력을 관리할 수 있다. 한 실시예에 따르면, 전력 관리 모듈은 전력 관리 집적회로(power management integrated circuit), 충전 IC(charger integrated circuit), 또는 배터리 또는 연료 게이지(battery or fuel gauge)를 포함할 수 있다. 전력 관리 집적회로는, 유선 및/또는 무선 충전 방식을 가질 수 있다. 무선 충전 방식은, 예를 들면, 자기공명 방식, 자기유도 방식 또 는 전자기파 방식 등을 포함하며, 무선 충전을 위한 부가적인 회로, 예를 들면, 코일 루프, 공진 회로, 또는 정 류기 등을 더 포함할 수 있다. 배터리 게이지는, 예를 들면, 배터리의 잔량, 충전 중 전압, 전류, 또는 온 도를 측정할 수 있다. 배터리는, 예를 들면, 충전식 전지(rechargeable battery) 및/또는 태양 전지 (solar battery)를 포함할 수 있다. 인디케이터는 전자 장치 또는 그 일부(예: 프로세서)의 특정 상태, 예를 들면, 부팅 상태, 메시 지 상태 또는 충전 상태 등을 표시할 수 있다. 모터는 전기적 신호를 기계적 진동으로 변환할 수 있고, 진 동(vibration), 또는 햅틱(haptic) 효과 등을 발생시킬 수 있다. 도시되지는 않았으나, 전자 장치는 모바 일 TV 지원을 위한 처리 장치(예: GPU)를 포함할 수 있다. 모바일 TV 지원을 위한 처리 장치는, 예를 들면, DMB(digital multimedia broadcasting), DVB(digital video broadcasting), 또는 미디어플로(mediaFloTM) 등 의 규격에 따른 미디어 데이터를 처리할 수 있다. 도 3은 다양한 실시예에 따른 프로그램 모듈의 블록도이다. 한 실시예에 따르면, 프로그램 모듈(예: 프로 그램)은 전자 장치(예: 전자 장치)에 관련된 자원을 제어하는 운영 체제(operating system(OS)) 및/ 또는 운영 체제 상에서 구동되는 다양한 어플리케이션(예: 어플리케이션 프로그램)을 포함할 수 있다. 운 영 체제는, 예를 들면, 안드로이드(android), iOS, 윈도우즈(windows), 심비안(symbian), 타이젠(tizen), 또는 바다(bada) 등이 될 수 있다. 프로그램 모듈은 커널, 미들웨어, 어플리케이션 프로그래밍 인터페이스(application programming interface (API)), 및/또는 어플리케이션을 포함할 수 있다. 프로그램 모듈의 적 어도 일부는 전자 장치 상에 프리로드(preload) 되거나, 외부 전자 장치(예: 전자 장치(102, 104), 서버 등)로부터 다운로드(download) 가능하다. 커널(예: 커널)은, 예를 들면, 시스템 리소스 매니저 및/또는 디바이스 드라이버를 포함할 수 있다. 시스템 리소스 매니저는 시스템 리소스의 제어, 할당, 또는 회수 등을 수행할 수 있다. 한 실시 예에 따르면, 시스템 리소스 매니저는 프로세스 관리부, 메모리 관리부, 또는 파일 시스템 관리부 등을 포 함할 수 있다. 디바이스 드라이버는, 예를 들면, 디스플레이 드라이버, 카메라 드라이버, 블루투스 드라이 버, 공유 메모리 드라이버, USB 드라이버, 키패드 드라이버, WiFi 드라이버, 오디오 드라이버, 또는 IPC(inter- process communication) 드라이버를 포함할 수 있다. 미들웨어는, 예를 들면, 어플리케이션이 공통적으로 필요로 하는 기능을 제공하거나, 어플리케이션 이 전자 장치 내부의 제한된 시스템 자원을 효율적으로 사용할 수 있도록 API를 통해 다양한 기능들 을 어플리케이션으로 제공할 수 있다. 한 실시예에 따르면, 미들웨어(예: 미들웨어)는 런타임 라이브러리, 어플리케이션 매니저(application manager), 윈도우 매니저(window manager), 멀티미디어 매니저(multimedia manager), 리소스 매니저(resource manager), 파워 매니저(power manager), 데이터베이스 매니저(database manager), 패키지 매니저(package manager), 연결 매 니저(connectivity manager), 통지 매니저(notification manager), 위치 매니저(location manager), 그래픽 매니저(graphic manager), 또는 보안 매니저(security manager) 중 적어도 하나를 포함할 수 있다. 런타임 라이브러리는, 예를 들면, 어플리케이션이 실행되는 동안에 프로그래밍 언어를 통해 새로운 기능을 추가하기 위해 컴파일러가 사용하는 라이브러리 모듈을 포함할 수 있다. 런타임 라이브러리는 입출 력 관리, 메모리 관리, 또는 산술 함수에 대한 기능 등을 수행할 수 있다. 어플리케이션 매니저는, 예를 들면, 어플리케이션 중 적어도 하나의 어플리케이션의 생명 주기(life cycle)를 관리할 수 있다. 윈도우 매니저는 화면에서 사용하는 GUI 자원을 관리할 수 있다. 멀티미디어 매 니저는 다양한 미디어 파일들의 재생에 필요한 포맷을 파악하고, 해당 포맷에 맞는 코덱(codec)을 이용하 여 미디어 파일의 인코딩(encoding) 또는 디코딩(decoding)을 수행할 수 있다. 리소스 매니저는 어플리케 이션 중 적어도 어느 하나의 어플리케이션의 소스 코드, 메모리 또는 저장 공간 등의 자원을 관리할 수 있 다. 파워 매니저는, 예를 들면, 바이오스(BIOS: basic input/output system) 등과 함께 동작하여 배터리 (battery) 또는 전원을 관리하고, 전자 장치의 동작에 필요한 전력 정보 등을 제공할 수 있다. 데이터베이스 매 니저는 어플리케이션 중 적어도 하나의 어플리케이션에서 사용할 데이터베이스를 생성, 검색, 또는 변경할 수 있다. 패키지 매니저는 패키지 파일의 형태로 배포되는 어플리케이션의 설치 또는 업데이트를 관리할 수 있다. 연결 매니저는, 예를 들면, WiFi 또는 블루투스 등의 무선 연결을 관리할 수 있다. 통지 매니저는 도 착 메시지, 약속, 근접성 알림 등의 사건(event)을 사용자에게 방해되지 않는 방식으로 표시 또는 통지할 수 있 다. 위치 매니저는 전자 장치의 위치 정보를 관리할 수 있다. 그래픽 매니저는 사용자에게 제공될 그 래픽 효과 또는 이와 관련된 사용자 인터페이스를 관리할 수 있다. 보안 매니저는 시스템 보안 또는 사용 자 인증 등에 필요한 제반 보안 기능을 제공할 수 있다. 한 실시예에 따르면, 전자 장치(예: 전자 장치)가 전화 기능을 포함한 경우, 미들웨어는 전자 장치의 음성 또는 영상 통화 기능을 관리하기 위한 통화 매니 저(telephony manager)를 더 포함할 수 있다. 미들웨어는 전술한 구성요소들의 다양한 기능의 조합을 형성하는 미들웨어 모듈을 포함할 수 있다. 미들웨 어는 차별화된 기능을 제공하기 위해 운영 체제의 종류 별로 특화된 모듈을 제공할 수 있다. 또한, 미들웨 어는 동적으로 기존의 구성요소를 일부 삭제하거나 새로운 구성요소들을 추가할 수 있다. API(예: API)는, 예를 들면, API 프로그래밍 함수들의 집합으로, 운영 체제에 따라 다른 구성으로 제 공될 수 있다. 예를 들면, 안드로이드 또는 iOS의 경우, 플랫폼 별로 하나의 API 셋을 제공할 수 있으며, 타이 젠(tizen)의 경우, 플랫폼 별로 두 개 이상의 API 셋을 제공할 수 있다. 어플리케이션(예: 어플리케이션 프로그램)은, 예를 들면, 홈, 다이얼러, SMS/MMS, IM(instant message), 브라우저, 카메라, 알람, 컨택트, 음성 다이얼, 이메일 , 달력, 미디어 플레이어, 앨범, 또는 시계, 건강 관리(health care)(예: 운동량 또 는 혈당 등을 측정), 또는 환경 정보 제공(예: 기압, 습도, 또는 온도 정보 등을 제공) 등의 기능을 수행할 수 있는 하나 이상의 어플리케이션을 포함할 수 있다. 한 실시예에 따르면, 어플리케이션은 전자 장치(예: 전자 장치)와 외부 전자 장치(예: 전자 장치 (102, 104)) 사이의 정보 교환을 지원하는 어플리케이션(이하, 설명의 편의 상, \"정보 교환 어플리케이션\")을 포함할 수 있다. 정보 교환 어플리케이션은, 예를 들면, 외부 전자 장치에 특정 정보를 전달하기 위한 알림 전 달(notification relay) 어플리케이션, 또는 외부 전자 장치를 관리하기 위한 장치 관리(device management) 어플리케이션을 포함할 수 있다. 예를 들면, 알림 전달 어플리케이션은 전자 장치의 다른 어플리케이션(예: SMS/MMS 어플리케이션, 이메일 어플 리케이션, 건강 관리 어플리케이션, 또는 환경 정보 어플리케이션 등)에서 발생된 알림 정보를 외부 전자 장치 (예: 전자 장치(102, 104))로 전달하는 기능을 포함할 수 있다. 또한, 알림 전달 어플리케이션은, 예를 들면, 외부 전자 장치로부터 알림 정보를 수신하여 사용자에게 제공할 수 있다. 장치 관리 어플리케이션은, 예를 들면, 전자 장치와 통신하는 외부 전자 장치(예: 전자 장치(102, 104))의 적어 도 하나의 기능(예: 외부 전자 장치 자체(또는, 일부 구성 부품)의 턴-온/턴-오프 또는 디스플레이의 밝기(또는, 해상도) 조절), 외부 전자 장치에서 동작하는 어플리케이션 또는 외부 전자 장치에서 제공되는 서비 스(예: 통화 서비스 또는 메시지 서비스 등)를 관리(예: 설치, 삭제, 또는 업데이트)할 수 있다. 한 실시예에 따르면, 어플리케이션은 외부 전자 장치(예: 전자 장치(102, 104))의 속성(에 따라 지정된 어 플리케이션(예: 모바일 의료 기기의 건강 관리 어플리케이션 등)을 포함할 수 있다. 한 실시예에 따르면, 어플 리케이션은 외부 전자 장치(예: 서버 또는 전자 장치(102, 104))로부터 수신된 어플리케이션을 포함 할 수 있다. 한 실시예에 따르면, 어플리케이션은 프리로드 어플리케이션(preloaded application) 또는 서 버로부터 다운로드 가능한 제3자 어플리케이션(third party application)을 포함할 수 있다. 도시된 실시예에 따른 프로그램 모듈의 구성요소들의 명칭은 운영 체제의 종류에 따라서 달라질 수 있다. 다양한 실시예에 따르면, 프로그램 모듈의 적어도 일부는 소프트웨어, 펌웨어, 하드웨어, 또는 이들 중 적 어도 둘 이상의 조합으로 구현될 수 있다. 프로그램 모듈의 적어도 일부는, 예를 들면, 프로세서(예: 프로 세서)에 의해 구현(implement)(예: 실행)될 수 있다. 프로그램 모듈의 적어도 일부는 하나 이상의 기 능을 수행하기 위한, 예를 들면, 모듈, 프로그램, 루틴, 명령어 세트(sets of instructions) 또는 프로세스 등 을 포함할 수 있다. 도 4a 및 4b는 본 발명의 다양한 실시예에 따른 전자 장치의 개념도를 도시한다. 도 4a 및 4b의 전자 장치 는 TV의 형태로 구현될 수 있으나, 그 구현 형태에는 제한이 없음을 당업자는 용이하게 이해할 수 있을 것 이다. 전자 장치는 디스플레이 및 센서를 포함할 수 있다. 센서는 1 × N(N은 자연수)의 픽셀(181 내지 187)을 가지는 어레이로 구현될 수 있다. 이에 따라, 센서는 1차원 이미지를 획득할 수 있 다. 일반적인 카메라 모듈은 A × B의 픽셀을 가질 수 있다. 여기에서, A는 가로축 방향의 픽셀 개수이며, B 는 세로축 방향의 픽셀 개수일 수 있으며, A, B는 자연수일 수 있다. 일반적인 카메라 모듈은 A × B의 픽셀 각각으로부터 출력되는 센싱 정보를 이용하여, 외부 환경에 대한 2차원 이미지를 획득할 수 있다. 이와는 대조 적으로, 본 발명의 다양한 실시예에 의한 센서는 가로축 방향 또는 세로축 방향 중 어느 하나의 방향으로 의 픽셀의 수가 1개인 1차원의 픽셀 어레이를 포함함에 따라서, 외부 환경에 대한 1차원 이미지를 획득할 수 있 다. 본 발명의 다양한 실시예에 따라서 획득된 1차원 이미지는 2차원 이미지에 비하여 그 정보의 양이 현격하 게 작기 때문에 연산량이 감축될 수 있다. 특히, 1차원 이미지는 정보의 양이 제한적이므로, 사생활 침해가 예 방될 수 있다. 1차원 이미지는 2차원 이미지에서의 하나의 라인에 불과하므로, 1차원 이미지가 노출된다 하더 라도 사용자의 사생활이 노출된 가능성은 작다. 본 발명의 다양한 실시예에서, 센서는 리니어(linear) CCD 또는 리니어(linear) CMOS 소자를 포함할 수 있 다. 리니어 CCD 또는 리니어 CMOS는 초소형으로 가늘고 긴 모양이기 때문에 아주 얇은 공간에도 설치가 가능하 다. 또한, 리니어 CCD 또는 리니어 CMOS는 저전력이면서 상대적으로 카메라 대비 가격이 저렴하다. 또한, 리 니어 CCD 또는 리니어 CMOS는 광량센서나 초음파센서와 같이 물체 유무와 거리 같은 단순한 정보를 제공하는 것 이 아니라, 입력되는 정보를 실시간으로 분석하여 사용자의 움직임을 감지할 수도 있다. 본 발명의 다양한 실시예에 따른 센서는 사용자(401,402)를 촬영하여 1차원 이미지를 획득할 수 있다. 예 를 들어, 센서의 각 픽셀(181 내지 187)은 입사되는 광(light)을 전기적인 신호로 변환하여 출력할 수 있 으며, 전기적인 신호의 특성(예를 들어, 전압, 전류 또는 전력)은 입사되는 광량에 관계될 수 있다. 이에 따라, 센서는 각 픽셀(181 내지 187)에 대응하는 휘도 정보를 획득하여 1차원 이미지를 획득할 수 있다. 즉, 1차원 이미지는 휘도 정보를 포함할 수 있다. 한편, 본 발명의 다양한 실시예에서, 1차원 이미지에 반영되 는 정보는 휘도 정보에 제한되지 않으며, 그 종류에는 제한이 없다. 전자 장치는 획득된 휘도 정보를 포 함하는 1차원 이미지를 분석하여 사용자(401,402)의 위치 정보를 획득할 수 있다. 예를 들어, 전자 장치 는 사용자(401,402)의 위치, 사용자(401,402)로부터 전자 장치까지의 거리 또는 사용자(401,402)의 움직임 정보 중 적어도 하나를 포함하는 사용자의 위치 정보를 획득할 수 있다. 전자 장치는 사용자(401,402)의 위치를 결정하는 과정에서, 사용자(401,402)의 수 또한 함께 결정할 수도 있다. 본 발명의 다양한 실시예에서, 전자 장치는 사용자(401,402)의 위치 정보에 대응하는 동작을 수행할 수 있 다. 예를 들어, 전자 장치가 TV로 구현되는 경우에는, 사용자(401,402)의 위치 정보에 따라 디스플레이 의 방향을 조정하거나 또는 디스플레이의 굴곡을 조정할 수도 있으며, 이에 대하여서는 더욱 상세하 게 후술하도록 한다. 한편, 센서는 일차원의 픽셀 어레이를 포함한다는 점에서, 상대적으로 얇고 긴 형태로 구현될 수 있으며, 이에 따라 전자 장치의 베젤과 같은 부분에 용이하게 배치될 수 있다.한편, 도 4b의 실시예에서는, 전자 장치는 복수 개의 센서(180a,180b)를 포함할 수 있다. 더욱 상세하게, 센서(180a) 및 센서(180b) 각각은 1 × N(N은 자연수)의 픽셀을 가지는 어레이로 구현될 수 있다. 센서(180a) 및 센서(180b) 각각의 센서의 수는 동일할 수 있거나 또는 상이할 수도 있다. 센서(180a) 및 센서(180b) 사이 의 거리는 센서(180a) 및 센서(180b) 각각의 촬영각에 따라 결정될 수 있으나, 제한은 없다. 전자 장치는 복수 개의 센서(180a,180b) 각각으로부터 획득되는 1차원 이미지를 이용하여 사용자(401,402,403)의 위치 정보 를 결정할 수 있다. 특히, 전자 장치는 복수 개의 센서(180a,180b) 각각으로부터 획득되는 1차원 이미지 를 비교함으로써, 사용자(401,402,403)로부터 전자 장치까지의 거리 정보를 결정할 수도 있다. 한편, 본 문서에서 센서는 픽셀 어레이 형태로 구현될 수 있으므로, 센서 어레이로 명명될 수도 있다. 상술한 바에 따라서, 본 발명의 다양한 실시예에 따른 전자 장치는 1차원 이미지를 획득 및 분석함으로써 사용자의 위치 정보를 결정할 수 있다. 전자 장치가 1차원 이미지를 이용함으로써, 연산량이 감소할 수 있으며, 사생활 침해가 예방될 수 있다. 특히, 1차원 이미지 획득을 위한 센서는 1차원으로 배열되는 픽셀 어 레이로 구현될 수 있기 때문에, 비교적 좁은 공간에도 배치될 수 있어, 전자 장치의 경량화 및 소형화에도 유리 할 수 있다. 도 5는 본 발명의 다양한 실시예에 따른 전자 장치의 제어 방법의 흐름도를 도시한다. 510 동작에서, 전자 장치는 픽셀 어레이로부터의 센싱 데이터를 획득할 수 있다. 본 발명의 다양한 실시 예에서, 센싱 데이터는 픽셀 각각으로 입사되는 광량과 관계된 전기적인 신호 또는 전기적인 신호의 특성(예를 들어, 전압, 전류 또는 전력)일 수 있다. 또는 센싱 데이터는 전기적인 신호를 변환한 휘도 등의 변환된 정보 일 수도 있다. 520 동작에서, 전자 장치는 센싱 데이터에 기초하여 사용자 위치 정보를 결정할 수 있다. 전자 장치(10 1)는 1차원 어레이 픽셀 각각으로부터의 센싱 데이터에 기초하여 사용자 위치 정보를 결정할 수 있다. 예를 들 어, 전자 장치는 1차원 어레이 픽셀 각각으로부터의 센싱 데이터를 이용하여 1차원 이미지를 획득할 수 있 다. 전자 장치는 1차원 이미지 중 사용자에 대응하는 영역과 배경에 대응하는 영역을 분리할 수 있으며, 사용자에 대응하는 영역의 위치를 판단할 수 있다. 530 동작에서, 전자 장치는 결정된 사용자 위치 정보에 대응하는 동작을 수행할 수 있다. 예를 들어, 전 자 장치는 사용자에 대응하는 영역의 위치와 동작 사이의 관계 정보를 미리 저장할 수 있다. 또는, 전자 장치는 사용자에 대응하는 픽셀의 위치와 동작 사이의 관계 정보를 미리 저장할 수 있다. 표 1은 본 발명 의 다양한 실시예에 따른 관계 정보의 예시이다. 표 1 사용자 위치 동작 (-100) 정면을 기준으로 -30°만큼 디스플레이 회전 화면을 정면으로 조정 정면을 기준으로 30°만큼 디스플레이 회전 표 1의 실시예에 따른 관계 정보는, 사용자 위치에 따른 전자 장치의 디스플레이의 회전에 대한 관계 정보 일 수 있다. 예를 들어, 센서로부터의 센싱 데이터의 분석 결과 사용자가 (-100,0)에 위치한 것으로 판단되면, 전자 장치는 디스플레이를 정면을 기준으로 -30°만큼 회전할 수 있다. 표 1에서의 좌표는 1차원 이미지 에서의 좌표일 수 있거나 또는 픽셀의 좌표일 수도 있다. 본 발명의 다양한 실시예에서, 전자 장치는 예 를 들어 표 1과 같은 관계 정보에 기초하여 사용자 위치 정보에 대응하여 동작을 수행할 수도 있지만, 다른 실 시예에서는, 전자 장치는 사용자 위치 정보를 이용하여 회전 각도를 연산하고, 연산 결과를 이용하여 디스 플레이를 회전시킬 수도 있다. 도 6a 내지 6c는 본 발명의 다양한 실시예에 따른 다양한 사용자 위치 정보를 결정하는 방법을 설명하기 위한 흐름도들을 도시한다. 도 6a를 참조하면, 610 동작에서, 전자 장치는 센서, 예를 들어 픽셀 어레이를 구성하는 복수 개의 픽셀 각각에서 센싱된 센싱 데이터를 획득할 수 있다. 620 동작에서, 전자 장치는 획득된 센싱 데이터를 이용하여 배경-인물 분리를 수행할 수 있다. 상술한 바 와 같이, 전자 장치는 1차원 이미지를 획득할 수 있으며, 1차원 이미지에서 배경에 대응하는 영역과 인물에 대응하는 영역을 분리할 수 있다. 본 발명의 다양한 실시예에서, 전자 장치는 1차원 이미지에서 특징 점을 판단할 수 있으며, 판단된 특징점을 이용하여 배경에 대응하는 영역과 인물에 대응하는 영역을 분리할 수 있다. 하나의 실시예에서, 전자 장치는 센싱 데이터의 수치(예를 들어, 휘도)가 이웃하는 픽셀과 기설정 된 임계치를 초과하는 차이를 가지는 픽셀을 특징점(예를 들어, 에지(edge))으로 판단할 수 있다. 전자 장치 는 특징점으로 판단된 픽셀을 경계점으로 판단할 수도 있으며, 경계점을 기준으로 한 측의 영역을 배경에 대응하는 영역으로 판단하고, 경계점을 기준으로 다른 측의 영역을 인물에 대응하는 영역으로 판단할 수도 있다. 한편, 전자 장치가 센싱 데이터를 이용하여 배경-인물 분리를 수행하는 방식에는 제한이 없다. 예 를 들어, 전자 장치는 SVM(support vector machine) 기법 등의 다양한 영상 처리 기법을 이용하여 배경- 인물 분리를 수행할 수 있다. 630 동작에서, 전자 장치는 인물로 분류되는 픽셀의 위치에 기초하여 사용자 위치 정보를 획득할 수 있다. 640 동작에서, 전자 장치는 결정된 사용자 위치 정보에 대응하는 동작을 수행할 수 있다. 도 6b는 본 발명의 다양한 실시예에 따른 사용자의 좌우 위치를 판단하는 방법을 설명하기 위한 흐름도를 도시 한다. 도 6b의 실시예는 도 7a 및 7b를 참조하여 더욱 상세하게 설명하도록 한다. 도 7a 및 7b는 본 발명의 다양한 실시예에 따른 사용자의 좌우 위치를 판단하는 방법을 설명하기 위한 개념도를 도시한다. 도 6b의 610 동작 및 620 동작은 도 6a를 참조하여 상술하였기 때문에, 여기에서의 더 이상의 설명은 생략하도 록 한다. 631 동작에서, 전자 장치는 인물로 분류되는 픽셀의 위치에 기초하여 사용자의 좌우 위치 정보를 획득할 수 있다. 예를 들어, 도 7a에서와 같이, 사용자가 전자 장치의 무게중심을 기준으로 상대적으로 좌 측에 위치할 수 있다. 이 경우, 전자 장치는 복수 개의 픽셀(711 내지 721)을 포함하는 센서로부터 센싱 데이터를 획득할 수 있다. 전자 장치는 센싱 데이터를 분석하여 인물로 분류되는 영역(711 내지 714)과 배경으로 분류되는 영역(715 내지 721)을 분리할 수 있다. 사용자가 상대적으로 좌측에 위치함에 따라서, 사용자는 센서의 상대적으로 좌측에 배치된 픽셀(711 내지 714)에서 촬영될 수 있다. 즉, 전자 장치는 사용자가 상대적으로 좌측에 위치한 1차원 이미지를 획득할 수 있다. 전자 장치는 1차 원 이미지에서 사용자의 좌우 위치를 판단할 수도 있다. 한편, 도 7b에서와 같이, 사용자가 전자 장치의 무게중심을 기준으로 상대적으로 우측에 위치할 수 있다. 이 경우, 전자 장치는 복수 개의 픽셀(711 내지 721)을 포함하는 센서로부터 센싱 데이터를 획득할 수 있다. 전자 장치는 센싱 데이터를 분석하여 인물로 분류되는 영역(718 내지 721)과 배경으로 분류되는 영역(711 내지 717)을 분리할 수 있다. 사용자가 상대적으로 우측에 위치함에 따라서, 사용자 는 센서의 상대적으로 우측에 배치된 픽셀(718 내지 721)에서 촬영될 수 있다. 즉, 전자 장치는 사 용자가 상대적으로 우측에 위치한 1차원 이미지를 획득할 수 있다. 전자 장치는 1차원 이미지에서 사용자의 좌우 위치를 판단할 수도 있다. 642 동작에서, 전자 장치는 결정된 사용자의 좌우 위치 정보에 대응하는 동작을 수행할 수 있다. 예 를 들어, 전자 장치는 사용자가 상대적으로 좌측에 위치한 것으로 판단된 경우에는, 디스플레이를 좌 측으로 회전시킴으로써, 좌측에 위치한 사용자가 디스플레이를 정면으로 시청할 수 있도록 할 수도 있다. 한편, 상술한 바에서는 전자 장치가 사용자의 좌우 위치 정보를 판단하는 실시예가 설명되었지만 이 는 단순히 예시적인 것이다. 본 발명의 다양한 실시예에서, 전자 장치는 상하 방향의 픽셀 어레이를 포함 하는 센서를 포함할 수도 있으며, 이 경우에는 전자 장치는 사용자의 상하 위치 정보를 판단할 수도 있다. 도 6c는 본 발명의 다양한 실시예에 따른 사용자의 좌우 위치를 판단하는 방법을 설명하기 위한 흐름도를 도시 한다. 도 6c의 실시예는 도 7a 및 7c를 참조하여 더욱 상세하게 설명하도록 한다. 도 7a 및 7c는 본 발명의 다양한 실시예에 따른 사용자의 좌우 위치를 판단하는 방법을 설명하기 위한 개념도를 도시한다. 도 6c의 610 동작 및 620 동작은 도 6a를 참조하여 상술하였기 때문에, 여기에서의 더 이상의 설명은 생략하도 록 한다. 632 동작에서, 전자 장치는 인물로 분류되는 픽셀의 위치에 기초하여 사용자 및 전자 장치 사이의 거리 정 보를 획득할 수 있다. 예를 들어, 도 7a에서와 같이, 사용자는 전자 장치의 표면을 기준으로 d1의 거리만큼 떨어져 위치할 수 있다. 이 경우, 전자 장치는 복수 개의 픽셀(711 내지 721)을 포함하는 센서 로부터 센싱 데이터를 획득할 수 있다. 전자 장치는 센싱 데이터를 분석하여 인물로 분류되는 영역(711 내지 714)과 배경으로 분류되는 영역(715 내지 721)을 분리할 수 있다. 사용자 및 전자 장치 사이의 거리 가 d1인 점에서, 사용자는 상대적으로 다수의 픽셀(711 내지 714)에서 촬영될 수 있다. 즉, 전자 장치 는 사용자가 상대적으로 크게 촬영된 1차원 이미지를 획득할 수 있다. 전자 장치는 사용자 의 크기 또는 인물로 분류되는 영역(711 내지 714)의 개수에 기초하여 사용자 및 전자 장치 사이의 거리 정보를 판단할 수 있다. 예를 들어, 도 7c에서와 같이, 사용자는 전자 장치의 표면을 기준으로 d2의 거리만큼 떨어져 위치할 수 있다. 이 경우, 전자 장치는 복수 개의 픽셀(711 내지 721)을 포함하는 센서로부터 센싱 데이터 를 획득할 수 있다. 전자 장치는 센싱 데이터를 분석하여 인물로 분류되는 영역(711 내지 712)과 배경으 로 분류되는 영역(713 내지 721)을 분리할 수 있다. 사용자 및 전자 장치 사이의 거리가 d2인 점에서, 사용자 는 상대적으로 소수의 픽셀(711 내지 712)에서 촬영될 수 있다. 즉, 전자 장치는 사용자가 상 대적으로 작게 촬영된 1차원 이미지를 획득할 수 있다. 전자 장치는 사용자의 크기 또는 인물로 분 류되는 영역(711 내지 712)의 개수에 기초하여 사용자 및 전자 장치 사이의 거리 정보를 판단할 수 있다. 사용자 및 전자 장치 사이의 거리가 클수록 1차원 이미지 내의 사용자의 크기 또는 인물로 분류되는 영역 (711 내지 712)의 개수는 작을 수 있으며, 사용자 및 전자 장치 사이의 거리가 작을수록 1차원 이미지 내의 사 용자의 크기 또는 인물로 분류되는 영역(711 내지 714)의 개수는 클 수 있다. 전자 장치는 1차원 이미지 내의 사용자의 크기 또는 사용자에 대응하는 픽셀의 개수와, 사용자 및 전자 장 치 사이의 거리에 대한 연관 정보를 미리 저장할 수 있다. 예를 들어, 전자 장치는 표 2와 같은 연관 정 보를 저장할 수 있다. 표 2 사용자에 대응하는 픽셀의 개수 사용자 및 전자 장치 사이의 거리 a1 d1 a2 d2 a3 d3 전자 장치는 표 2와 같은 연관 정보를 이용하여, 사용자 및 전자 장치 사이의 거리를 판단할 수 있다. 642 동작에서, 전자 장치는 결정된 사용자 및 전자 장치 사이의 거리 정보에 대응하는 동작을 수행할 수 있다. 예를 들어, 전자 장치는 거리 정보에 대응하여 디스플레이의 굴곡 정도를 조정할 수 있다. 상술한 바와 같이, 전자 장치는 픽셀 어레이를 포함하는 하나의 센서로부터의 센싱 데이터를 이용하여, 사 용자의 좌우 위치 정보 또는 사용자 및 전자 장치 사이의 거리 정보와 같은 다양한 사용자의 위치 정보를 판단 할 수 있다. 한편, 본 발명의 다양한 실시예에서, 픽셀 어레이의 각 픽셀은, 2PD(photodiode)와 같은 위상 픽셀(phase pixel)로 구현될 수도 있다. 더욱 상세하게, 픽셀 어레이의 하나의 픽셀은 2개의 서브픽셀을 포함할 수 있으며, 2개의 서브픽셀에서 검출되는 광량은 상이할 수 있다. 전자 장치는 하나의 서브 픽셀에서 센싱되 는 센싱 데이터와 다른 서브 픽셀에서 센싱되는 센싱 데이터 사이의 차이에 기초하여, 사용자 및 전자 장치 사이의 거리를 판단할 수 있다. 전자 장치는 위상 픽셀을 포함하는 픽셀 어레이로부터의 센싱 데이 터를 이용하여, 사용자의 좌우 방향 위치 정보 및 사용자와 전자 장치 사이의 거리 정보를 판단할 수 있다. 도 8은 본 발명의 다양한 실시예에 따른 전자 장치의 제어 방법을 설명하기 위한 흐름도를 도시한다. 도 8의 실시예는 도 9a 내지 9h를 참조하여 더욱 상세하게 설명하도록 한다. 도 9a 내지 9h는 본 발명의 다양한 실시 예에 따른 픽셀 어레이의 인물-배경 분리 결과를 설명하기 위한 개념도들을 도시한다. 810 동작에서, 전자 장치는 제 1 시점에서, 픽셀 어레이를 구성하는 복수 개의 픽셀 각각에서 센싱된 센싱 데이터를 획득할 수 있다. 820 동작에서, 전자 장치는 제 1 시점에 대응하는 제 1 사용자 위치 정보를 결 정할 수 있다. 830 동작에서, 전자 장치는 제 2 시점에서, 픽셀 어레이를 구성하는 복수 개의 픽셀 각각 에서 센싱된 센싱 데이터를 획득할 수 있다. 840 동작에서, 전자 장치는 제 2 시점에 대응하는 제 2 사용 자 위치 정보를 결정할 수 있다. 즉, 전자 장치는 시간의 흐름에 따라서 복수 개의 1차원 이미지를 획득 할 수 있다.850 동작에서, 전자 장치는 제 1 사용자 위치 정보 및 제 2 사용자 위치 정보를 이용하여 사용자 이동 정 보를 결정할 수 있다. 860 동작에서, 전자 장치는 결정된 사용자 이동 정보에 대응하는 동작을 수행할 수 있다. 예를 들어, 전자 장치는 제 1 시점에 복수 개의 픽셀(911 내지 928)을 포함하는 센서로부터의 센싱 데이터 를 이용하여 인물-배경 분리를 수행할 수 있다. 전자 장치는, 도 9a에서와 같이, 제 1 시점에서는 모든 픽셀(911 내지 928)을 배경으로 분리할 수 있다. 전자 장치는 제 2 시점에 복수 개의 픽셀(911 내지 92 8)을 포함하는 센서로부터의 센싱 데이터를 이용하여 인물-배경 분리를 수행할 수 있다. 전자 장치는, 도 9b에서와 같이, 제 2 시점에서는 픽셀(912 내지 914)을 인물 영역으로 분리하고, 나머지 픽셀(911,915 내지 928)을 배경 영역으로 분리할 수 있다. 전자 장치는 제 3 시점에 복수 개의 픽셀(911 내지 928)을 포함하 는 센서로부터의 센싱 데이터를 이용하여 인물-배경 분리를 수행할 수 있다. 전자 장치는, 도 9c에서와 같이, 제 3 시점에서는 픽셀(916 내지 919)을 인물 영역으로 분리하고, 나머지 픽셀(911 내지 915, 920 내지 928)을 배경 영역으로 분리할 수 있다. 전자 장치는 제 4 시점에 복수 개의 픽셀(911 내지 928)을 포함하 는 센서로부터의 센싱 데이터를 이용하여 인물-배경 분리를 수행할 수 있다. 전자 장치는, 도 9d에서와 같이, 제 4 시점에서는 픽셀(919 내지 923)을 인물 영역으로 분리하고, 나머지 픽셀(911 내지 918, 924 내지 928)을 배경 영역으로 분리할 수 있다. 즉, 전자 장치는 인물 영역, 즉 사용자의 위치가 시간의 흐름에 따라 상대적으로 우측으로 변경됨을 판단할 수 있으며, 사용자의 이동 정보가 우측으로 이동인 것으로 판단할 수 있다. 전자 장치는 우측으로의 이동 정보에 대응하는 동작을 수행할 수 있다. 예를 들어, 전자 장치 는 디스플레이를 사용자의 위치에 실시간으로 대응하여 회전시킬 수도 있다. 한편, 본 발명의 다양한 실 시예에서, 전자 장치는 사용자의 이동 정보를 소요된 시간으로 나눔으로써 사용자의 이동 속력 등의 정보 를 획득할 수도 있다. 상술한 바와 같이, 본 발명의 다양한 실시예에 따른 전자 장치는 좌우 방향 또는 상하 방향의 사용자의 이동 정보를 판단할 수 있다. 한편, 전자 장치는 사용자 및 전자 장치 사이 방향으로의 사용자의 이동 정보를 판단할 수도 있다. 전자 장치는, 도 9e에서와 같이, 제 1 시점에서는 픽셀(918 내지 921)을 인물 영역으로 분리하고, 나머지 픽셀 (911 내지 917 및 922 내지 928)을 배경 영역으로 분리할 수 있다. 전자 장치는 제 2 시점에 복수 개의 픽셀(911 내지 928)을 포함하는 센서로부터의 센싱 데이터를 이용하여 인물-배경 분리를 수행할 수 있다. 전자 장치는, 도 9f에서와 같이, 제 2 시점에서는 픽셀(918 내지 923)을 인물 영역으로 분리하고, 나머지 픽셀 (911 내지 917 및 924 내지 928)을 배경 영역으로 분리할 수 있다. 전자 장치는 제 3 시점에 복수 개의 픽셀(911 내지 928)을 포함하는 센서로부터의 센싱 데이터를 이용하여 인물-배경 분리를 수행할 수 있다. 전자 장치는, 도 9g에서와 같이, 제 3 시점에서는 픽셀(915 내지 925)을 인물 영역으로 분리하고, 나머지 픽셀 (911 내지 914, 926 내지 928)을 배경 영역으로 분리할 수 있다. 전자 장치는 제 4 시점에 복수 개의 픽 셀(911 내지 928)을 포함하는 센서로부터의 센싱 데이터를 이용하여 인물-배경 분리를 수행할 수 있다. 전자 장치는, 도 9h에서와 같이, 제 4 시점에서는 픽셀(914 내지 928)을 인물 영역으로 분리하고, 나머지 픽셀 (911 내지 913)을 배경 영역으로 분리할 수 있다. 즉, 전자 장치는 인물 영역, 즉 사용자의 위치가 시간 의 흐름에 따라 상대적으로 다수의 픽셀이 사용자에 대응하는 것으로 판단할 수 있다. 전자 장치는 사용 자가 시간의 흐름에 따라 전자 장치쪽으로 접근한다는 사용자의 이동 정보를 판단할 수 있다. 전자 장치 는 접근의 이동 정보에 대응하는 동작을 수행할 수 있다. 예를 들어, 전자 장치는 디스플레이의 굴 곡을 사용자의 접근에 실시간으로 대응하여 조정할 수 있다. 한편, 본 발명의 다양한 실시예에서, 전자 장치 는 사용자의 이동 정보를 소요된 시간으로 나눔으로써 사용자의 이동 속력 등의 정보를 획득할 수도 있다. 도 10은 본 발명의 다양한 실시예에 따른 복수 개의 픽셀 어레이를 포함하는 전자 장치의 제어 방법을 설명하기 위한 흐름도를 도시한다. 도 10의 실시예는 도 11a 및 11b를 참조하여 더욱 상세하게 설명하도록 한다. 도 11a 및 11b는 복수 개의 픽셀 어레이를 포함하는 전자 장치의 동작을 설명하기 위한 개념도들을 도시한다. 1010 동작에서, 전자 장치는 제 1 픽셀 어레이를 구성하는 복수 개의 픽셀 각각에서 센싱된 제 1 센싱 데 이터를 획득할 수 있다. 예를 들어, 도 11a에서와 같이, 전자 장치는 제 1 픽셀 어레이 및 제 2 픽 셀 어레이를 포함할 수 있다. 제 1 픽셀 어레이는 1차원으로 배열된 복수 개의 픽셀을 포함할 수 있으며, 제 2 픽셀 어레이는 1차원으로 배열된 복수 개의 픽셀을 포함할 수 있다. 제 1 픽셀 어레이 및 제 2 픽셀 어레이는 전자 장치의 특정 방향을 누락없이 촬영할 수 있도록 배치될 수 있다. 예를 들어, 제 1 픽셀 어레이 및 제 2 픽셀 어레이 사이의 거리는 제 1 픽셀 어레이 및 제 2 픽셀 어레이 각각의 촬영각을 고려하여 설정될 수 있다. 한편, 도 11a의 실시예에서는 사용자 가 전자 장치의 표면을 기준으로 D3만큼 떨어져 있으며, 전자 장치의 무게중심을 지나는 축을기준으로 X1만큼 좌측으로 떨어져 있는 것을 상정하도록 한다. 전자 장치는 도 11b에서와 같은 제 1 센싱 데이터를 획득할 수 있다. 도 11b에서는 제 1 센싱 데이터가 인물-배경 분리 작업까지 수행된 결 과가 도시되어 있지만, 전자 장치는 우선, 제 1 어레이의 픽셀별(1141 내지 1151)로부터 휘도 또는 전기적인 특성과 같은 로(raw) 데이터를 획득한 이후에, 로 데이터에 인물-배경 분리 작업을 수행하여 제 1 센 싱 데이터를 획득할 수 있음을 당업자는 용이하게 이해할 수 있을 것이다. 1020 동작에서, 전자 장치는 제 2 픽셀 어레이를 구성하는 복수 개의 픽셀 각각에서 센싱된 제 2 센싱 데 이터를 획득할 수 있다. 전자 장치는 예를 들어, 도 11b에서와 같은 제 2 센싱 데이터를 획득할 수 있다. 도 11b에서는 제 2 센싱 데이터 또한 인물-배경 분리 작업까지 수행된 결과가 도시되어 있지만, 전자 장치는 우선, 제 2 어레이의 픽셀별(1161 내지 1171)로부터 휘도 또는 전기적인 특성과 같은 로(raw) 데이터를 획득한 이후에, 로 데이터에 인물-배경 분리 작업을 수행하여 제 2 센싱 데이터를 획득 할 수 있음을 당업자는 용이하게 이해할 수 있을 것이다. 1030 동작에서, 전자 장치는 제 1 센싱 데이터 및 제 2 센싱 데이터를 이용하여 사용자의 좌우 위치 정보 를 획득할 수 있다. 예를 들어, 전자 장치는, 도 11b와 같은 제 1 센싱 데이터에서 픽셀(1141 내지 1147)을 배경 영역으로 분리하며, 픽셀(1148 내지 1151)을 인물 영역으로 분리할 수 있다. 전자 장치는, 도 11b와 같은 제 2 센싱 데이터에서 픽셀(1163 내지 1171)을 배경 영역으로 분리하며, 픽셀(1161 내지 1162)을 인물 영역으로 분리할 수 있다. 전자 장치는 제 1 픽셀 어레이를 기준으로 한 사용자 의 위치를 판단할 수 있으며, 제 2 픽셀 어레이를 기준으로 한 사용자의 위치를 판단할 수 있다. 본 발명의 다양한 실시예에 의한 전자 장치는 제 1 픽셀 어레이를 기준으로 한 사용자(113 0)의 위치 및 제 2 픽셀 어레이를 기준으로 한 사용자의 위치를 이용하여, 예를 들어 무게중심을 통과하는 축을 기준으로 한 사용자의 위치를 판단할 수 있다. 또 다른 실시예에서, 전자 장치는 제 1 센싱 데이터 및 제 2 센싱 데이터를 이용하여 곧바로 무게중심을 통과하는 축을 기준으로 한 사용자의 위치를 판단할 수도 있다. 1040 동작에서, 전자 장치는 제 1 센싱 데이터 및 제 2 센싱 데이터를 스테레오 비전 기법에 적용하여, 사 용자와 전자 장치 사이의 거리 정보를 획득할 수 있다. 도 11a에 도시된 바와 같이, 제 1 픽셀 어레이 및 제 2 픽셀 어레이는 전자 장치 내에서 배치된 위치가 상이하므로, 제 1 픽셀 어레이를 기 준으로 한 사용자의 상대적인 위치가 제 2 픽셀 어레이를 기준으로 한 사용자의 상대적인 위 치와 상이할 수 있다. 이에 따라, 도 11b에 도시된 바와 같이, 제 1 픽셀 어레이로부터 센싱된 제 1 센 싱 데이터는 제 2 픽셀 어레이로부터 센싱된 제 2 센싱 데이터와 상이할 수 있다. 본 발명 의 다양한 실시예에서, 전자 장치는 제 1 센싱 데이터 및 제 2 센싱 데이터를 비교할 수 있으 며, 비교 결과에 기초하여 사용자로부터 전자 장치 사이의 거리가 D3인 것을 판단할 수 있다. 전자 장치는 양안에 대응하는 복수 개의 카메라에서 촬영된 복수 개의 이미지를 이용하여 거리를 분석하는 이미 지 분석 기술, 예를 들어 스테레오 비전(stereo vision) 등의 다양한 이미지 분석 기술을 이용하여 사용자 및 전자 장치 사이의 거리를 판단할 수 있으며, 거리 분석에 이용되는 이미지 분석 기술에는 제한 이 없다. 1050 동작에서, 전자 장치는 결정된 사용자의 좌우 위치 정보 및 사용자와 전자 장치 사이의 거리 정보 중 적어도 하나에 대응하는 동작을 수행할 수 있다. 상술한 바와 같이, 본원 발명의 다양한 실시예에 따른 전자 장치는 복수 개의 픽셀 어레이로부터의 센싱 데이터를 이용하여 더욱 정확한 사용자 위치 정보를 판단할 수도 있다. 도 12는 본 발명의 다양한 실시예에 따른 데이터베이스를 이용한 전자 장치의 제어 방법을 설명하기 위한 흐름 도를 도시한다. 도 12의 실시예는 도 13a 내지 13d를 참조하여 더욱 상세하게 설명하도록 한다. 도 13a 내지 13d는 본 발명의 다양한 실시예에 따른 전자 장치의 데이터베이스를 이용한 사용자의 위치 정보 판단을 설명하 기 위한 개념도들을 도시한다. 1210 동작에서, 전자 장치는 픽셀 어레이를 구성하는 복수 개의 픽셀 각각에서 센싱된 센싱 데이터를 획득 할 수 있다. 1220 동작에서, 전자 장치는 획득된 센싱 데이터와 미리 저장된 참조용 데이터베이스를 이용 하여 배경-인물 분리를 수행할 수 있다. 1230 동작에서, 전자 장치는 인물로 분류되는 픽셀의 위치에 기 초하여 사용자 위치 정보를 획득할 수 있다. 1240 동작에서, 전자 장치는 결정된 사용자 위치 정보에 대 응하는 동작을 수행할 수 있다.예를 들어, 도 13a에서와 같이, 전자 장치는 픽셀 어레이를 포함할 수 있다. 예를 들어, 전자 장치 는 TV로 구현될 수 있으며, 홈(home) 환경에 배치될 수 있다. 한편, 전자 장치의 전방에는 홈(home) 환경에 포함되는 다른 가구들(1301,1302)이 배치될 수 있다. 예를 들어, 전자 장치의 상대적으로 전방 우 측에는 소파가 배치될 수 있으며, 전자 장치의 상대적으로 전방 좌측에는 탁자가 배치될 수 있다. 전자 장치는 사용자가 없는 환경, 즉 평소의 환경에 대하여 촬영을 수행할 수 있다. 더욱 상세하 게, 전자 장치는 픽셀 어레이를 이용하여 평소의 환경을 촬영한 1차원 이미지를 데이터베이스로서 미리 저장할 수 있다. 도 13b는 전자 장치가 평소의 환경을 촬영한 1차원 이미지의 예시이다. 도 13b에 도시된 바와 같이, 1차원 이미지는 각 픽셀(1311 내지 1324)별로 로(raw) 데이터, 예를 들어 휘도 값을 포함할 수 있 다. 휘도 값은 0~255의 값 중 어느 하나의 자연수일 수 있다. 도 13b에 도시된 바와 같이, 1차원 이미지 의 픽셀(1316 내지 1318)이 이웃하는 픽셀들에 비하여 상대적으로 작은 값을 가질 수 있으며, 이는 소파 가 이미지 내에 포함된 결과일 수 있다. 아울러, 1차원 이미지의 픽셀(1323 내지 1324)이 이웃하 는 픽셀들에 비하여 상대적으로 작은 값을 가질 수 있으며, 이는 탁자가 이미지 내에 포함된 결과일 수 있다. 도 13c는 사용자가 전자 장치의 전방에 위치한 경우를 상정한 개념도를 도시한다. 도 13c에 도시된 바와 같이, 사용자는 소파와 탁자 사이에 위치할 수 있다. 이 경우, 전자 장치는 픽셀 어레이를 이용하여, 도 13d에와 같은 1차원 이미지 또는 센싱 데이터를 획득할 수 있다. 획득된 1 차원 이미지는 픽셀(1349 내지 1352) 각각이 17,14,5,9와 같은 상대적으로 낮은 휘도값을 가질 수 있으며, 이는 사용자가 이미지 내에 포함된 결과일 수 있다. 도 13c에서와 같이, 사용자가 픽셀 (1349 내지 1352)의 위치에서 촬영됨에 따라, 소파에 대응되는 픽셀(1346 내지 1348)과 사용자에 대한 픽셀(1349 내지 1352)의 구분이 어려울 수 있다. 상술한 바와 같이, 본 발명의 다양한 실시예에 따른 전 자 장치는 인물-배경을 분리하는 과정에서, 특징점을 경계점으로 이용하는 방식으로 인물-배경을 분리할 수 있다. 하지만, 도 13d에 도시된 바와 같이, 소파에 대응되는 픽셀(1346 내지 1348)과 사용자에 대한 픽셀(1349 내지 1352)의 휘도값의 차이가 상대적으로 작을 수 있다. 이 경우, 전자 장치는 예를 들 어 픽셀 또는 픽셀을 특징점으로 분류할 수 없어, 정확한 사용자의 위치를 판단할 수 없다. 전자 장치는 미리 저장된 데이터베이스 및 획득된 센싱 데이터 사이의 비교 결과에 기초하여 인물-배경 분 리를 수행할 수 있다. 예를 들어, 도 13d에 도시된 바와 같이, 전자 장치는 미리 저장된 평소 환경에 대 한 1차원 이미지를 획득된 1차원 이미지와 비교할 수 있다. 본 발명의 다양한 실시예에서, 전자 장치는 두 이미지(1310,1340)에 대한 차 영상(diffenrence image)을 획득할 수 있다. 차 영상 은 두 이미지(1310,1340)의 픽셀별 차이를 값으로 포함하는 이미지일 수 있다. 예를 들어, 차 영상 의 픽셀은 데이터베이스의 1차원 이미지의 픽셀의 값 5와 획득된 1차원 이미지 의 픽셀의 값 5의 차이인 0의 값을 가질 수 있다. 차 영상의 픽셀은, 데이터베이스의 1차원 이미지의 픽셀의 값 94와 획득된 1차원 이미지의 픽셀의 값 17의 차이인 77의 값을 가 질 수 있다. 차 영상의 픽셀은, 데이터베이스의 1차원 이미지의 픽셀의 값 109와 획 득된 1차원 이미지의 픽셀의 값 14의 차이인 95의 값을 가질 수 있다. 차 영상의 픽셀 은, 데이터베이스의 1차원 이미지의 픽셀의 값 135와 획득된 1차원 이미지의 픽셀 의 값 5의 차이인 130의 값을 가질 수 있다. 차 영상의 픽셀은, 데이터베이스의 1차원 이미 지의 픽셀의 값 141과 획득된 1차원 이미지의 픽셀의 값 9의 차이인 132의 값을 가질 수 있다. 차 영상의 픽셀은 데이터베이스의 1차원 이미지의 픽셀의 값 15와 획득된 1 차원 이미지의 픽셀의 값 15의 차이인 0의 값을 가질 수 있다. 이에 따라, 차 영상의 픽셀 은 이웃하는 픽셀과 상대적으로 큰 차이를 가질 수 있으며, 픽셀은 이웃하는 픽셀과 상대적으로 큰 차이를 가질 수 있다. 전자 장치는 차 영상의 픽셀 및 픽셀을 특징점으 로 분류할 수 있으며, 픽셀(1369 내지 1372)을 인물에 대응하는 영역으로 분류하고, 픽셀(1361 내지 1368, 1373 내지 1374)을 배경으로 분류할 수 있다. 상술한 바와 같이, 본 발명의 다양한 실시예에 의한 전자 장치는, 차 영상과 같은, 데이터베이스와 획득된 센싱 데이터와의 비교 결과를 이용하여 보다 정확한 사용자의 위치 정보를 판단할 수 있다. 본 발명의 다양한 실시예에서, 전자 장치는 주변 환경을 모니터링할 수 있다. 전자 장치는 주기적 또는 비주기적으로 주변 환경을 센서 어레이를 이용하여 촬영할 수 있으며, 촬영된 이미지를 데이터베이 스로 저장할 수 있다. 즉, 전자 장치는 데이터베이스를 갱신할 수 있으며, 이에 따라 주변 환경의 변화를반영하여, 사용자의 위치 정보를 보다 정확하게 판단할 수 있다. 도 14a 및 14b는 본 발명의 다양한 실시예에 따른 전자 장치의 배치를 설명하기 위한 개념도들을 도시한다. 도 14a에 도시된 바와 같이, 전자 장치는 다른 전자 장치로부터 분리되어 구현될 수도 있다. 예를 들어, 본 발명의 다양한 실시예에 의한 전자 장치는 복수 개의 센서를 포함하는 센서 어레이 및 센서 어 레이로부터 센싱된 데이터를 송신할 수 있는 통신 모듈만을 포함할 수도 있다. 이 경우, 전자 장치 는 1차원 어레이를 구성하는 센서 및 통신 모듈만을 포함함으로써 저전력으로 구동될 수 있으며, IoT(internet of things) 환경 구축에 유리할 수 있다. 이 경우, 전자 장치의 통신 모듈(미도시)은 다 양한 방식의 무선 통신을 위한 스택(stack)을 포함할 수 있으며, 무선 통신 방식에는 제한이 없다. 전자 장치는 픽셀 어레이에서 센싱된 센싱 데이터를 전자 장치로 송신할 수 있다. 전자 장 치는 수신된 센싱 데이터를 이용하여 전자 장치를 기준으로 한 사용자의 위치 정보를 판단할 수 있다. 전자 장치는, 전자 장치와 전자 장치 사이의 위치 관계를 미리 저장할 수 도 있으며, 위치 관계 및 수신된 센싱 데이터를 이용하여 전자 장치를 기준으로 한 사용자의 위치 정보를 판단할 수도 있다. 전자 장치는 수신된 센싱 데이터와 전자 장치를 기준으로 한 사용자의 위치 정보의 관계 정보를 미리 저장할 수도 있으며, 저장된 관계 정보를 이용하여 전자 장치 를 기준으로 한 사용자의 위치 정보를 판단할 수 있다. 도 14b는 본 발명의 다양한 실시예에 따른 홈 네트워크 환경의 개념도를 도시한다. 도 14b에 도시된 바와 같이, 홈 네트워크에는 적어도 하나의 전자 장치(1441,1442,1443)가 포함될 수 있 다. 아울러, 홈 네트워크에는 적어도 하나의 픽셀 어레이(1451,1452,1453,1454)가 배치될 수 있다. 적 어도 하나의 전자 장치(1441,1442,1443)와 적어도 하나의 픽셀 어레이(1451,1452,1453,1454)는 서로 통신을 수 행할 수 있으며, 데이터를 송수신할 수 있다. 예를 들어, 적어도 하나의 픽셀 어레이(1451,1452,1453,1454) 각 각은 센싱 데이터를 적어도 하나의 전자 장치(1441,1442,1443) 각각으로 송신할 수 있다. 적어도 하나의 전자 장치(1441,1442,1443) 각각은 수신된 센싱 데이터를 이용하여, 사용자의 위치 정보를 판단할 수 있다. 예를 들어, 적어도 하나의 전자 장치(1441,1442,1443) 각각은 사용자가 이동하는 것을 판단할 수 있다. TV는 사용자의 이동에 대응하여 디스플레이를 조정할 수 있으며, 에어컨은 사용자의 이동에 대응하여 바람의 송출 방향을 조정할 수 있으며, 전등은 사용자의 이동에 대응하여 빛의 조 사 방향을 조정할 수 있다. 상술한 바와 같이, 적어도 하나의 픽셀 어레이(1451,1452,1453,1454)는 센서 어레이 및 통신 모듈만을 포함할 수 있으며, 이에 따라 도 14b에서와 같이 홈 네트워크의 다수 부분에 배치될 수 있다. 적어도 하나의 픽 셀 어레이(1451,1452,1453,1454)는 탈부착이 가능할 수도 있다. 도 15는 본 발명의 다양한 실시예에 따른 전자 장치의 제어 방법을 설명하기 위한 흐름도를 도시한다. 1510 동작에서, 제 1 전자 장치(101-1)는 픽셀 어레이를 구성하는 복수 개의 픽셀 각각에서 센싱된 센싱 데이터 를 획득할 수 있다. 제 1 전자 장치(101-1)는 복수 개의 픽셀을 포함하는 픽셀 어레이를 포함할 수 있다. 아 울러, 제 1 전자 장치(101-1)는 센싱 데이터를 송신할 수 있는 통신 모듈을 포함할 수 있다. 1520 동작에서, 제 1 전자 장치(101-1)는 센싱 데이터를 송신할 수 있다. 1530 동작에서, 제 2 전자 장치(101-2)는 수신된 센싱 데이터를 이용하여 사용자 위치 정보를 획득할 수 있다. 제 2 전자 장치(101-2)는, 수신된 센싱 데이터와 제 2 전자 장치(101-2)를 기준으로 한 사용자의 위치 정보 사 이의 연관 정보를 미리 저장할 수 있다. 제 2 전자 장치(101-2)는 수신된 센싱 데이터와 연관 정보를 이용하여, 제 2 전자 장치(101-2)를 기준으로 한 사용자의 위치 정보를 결정할 수 있다. 1540 동작에서, 제 2 전자 장치(101-2)는 결정된 사용자 위치 정보에 대응하는 동작을 수행할 수 있다. 상술한 바와 같이, 본 발명의 다양한 실시예에 따른 전자 장치는 복수 개의 픽셀을 포함하는 픽셀 어레이에서 센싱된 센싱 데이터를 다른 전자 장치로 송신할 수 있다. 아울러, 본 발명의 다양한 실시예에 따른 전자 장치 는 다른 전자 장치로부터 수신된 센싱 데이터, 예를 들어 1차원 이미지를 이용하여, 전자 장치를 기준으로 한 사용자의 위치 정보를 판단할 수 있다. 도 16은 본 발명의 다양한 실시예에 따른 전자 장치의 개념도를 도시한다. 도 16에 도시된 바와 같이, 본 발명 의 다양한 실시예에 따른 전자 장치는 세로 방향으로 연장되는 픽셀 어레이를 포함하는 센서를 포함 할 수도 있다. 이 경우, 전자 장치는 사용자의 상하 방향의 위치 정보를 판단할 수도 있으며, 사용자의상하 방향의 위치 정보에 대응하는 동작을 수행할 수 있다. 예를 들어, 전자 장치는 상하 방향의 픽셀 어 레이를 포함하는 센서로부터의 센싱 데이터를 이용하여, 사용자의 시선을 판단할 수 있으며, 사용자의 시 선의 높이에 따라 틸팅(tilting) 정도를 조정할 수 있다. 아울러, 전자 장치는 좌우 방향의 픽셀 어레이 및 상하 방향의 픽셀 어레이 중 적어도 하나를 포함할 수도 있으며, 이 경우 사용자의 위치를 추적함으로써 사용자의 모션을 인식할 수도 있다. 좌우 방향의 픽셀 어레이 를 포함한 경우에는, 전자 장치는 좌우 방향의 사용자 모션을 인식할 수 있다. 상하 방향의 픽셀 어레이 를 포함한 경우에는, 전자 장치는 상하 방향의 사용자 모션을 인식할 수 있다. 좌우 방향의 픽셀 어레이 및 상하 방향의 픽셀 어레이를 포함한 경우에는, 2차원 사용자 모션을 인식할 수 있다. 아울러, 상술한 바와 같이, 전자 장치는 사용자 및 전자 장치 사이의 거리 또한 판단할 수 있으며, 이에 따라 3차원 사용 자 모션을 인식할 수도 있다. 도 17 내지 21은 본 발명의 다양한 실시예에 따른 사용자의 위치 정보에 따른 전자 장치의 동작을 설명하기 위 한 개념도들을 도시한다. 도 17을 참조하면, 전자 장치는 디스플레이를 포함할 수 있다. 여기에서, 디스플레이는 굴곡 지게 형성될 수 있다. 전자 장치는 디스플레이의 굴곡 정도를 조정할 수 있으며, 이에 따라 제 1 굴곡 정도를 가지도록 디스플레이를 조정할 수 있으며, 제 2 굴곡 정도를 가지도록 디스플레이를 조정할 수 있으며, 제 3 굴곡 정도를 가지도록 디스플레이를 조정할 수 있다. 한편, 전자 장치는 1차원 픽셀 어레이를 포함하는 센서에서 센싱된 센싱 데이터를 이용하여, 사용자(171 1)의 위치 정보를 판단할 수 있다. 상술한 바와 같이, 전자 장치는 하나의 픽셀 어레이로부터의 센싱 데 이터를 이용하여 사용자와 전자 장치 사이의 거리 정보를 판단할 수 있다. 더욱 상세하게, 전자 장 치는 픽셀 어레이 중 인물로 분류되는 픽셀의 개수 또는 1차원 이미지 상의 인물의 크기에 기초하여 사용 자와 전자 장치 사이의 거리 정보를 판단할 수 있다. 또는, 전자 장치는 복수 개의 픽셀 어레 이 각각에서 센싱된 센싱 데이터를 이용하여, 사용자와 전자 장치 사이의 거리 정보를 판단할 수 있 다. 더욱 상세하게, 전자 장치는 복수 개의 픽셀 어레이 각각에서 센싱된 센싱 데이터 사이의 차이를 이 용하여, 사용자와 전자 장치 사이의 거리 정보를 판단할 수 있다. 도 17의 실시예에서는, 전자 장치는 사용자가 전자 장치를 향하여 접근하는 것, 즉 사용자 및 전자 장치 사이의 거리가 감소하는 이동 정보를 판단할 수 있다. 이에 대응하여, 전자 장치 는 디스플레이의 굴곡 정도를 조정할 수 있다. 한편, 전자 장치는 사용자의 이동 정보를 이용하여 사용자 행동 패턴을 분석할 수도 있다. 전자 장치는 분석된 행동 패턴에 기초하여 사용자를 식별할 수도 있으며, 사용자별 특성을 이용하여 광고를 추천하거나 제공할 수 있다. 또한, 전자 장치는 사용자 및 전자 장치 사이의 거리에 기초하여 TV의 디스플레이 밝기를 조정 한다든지 또는 턴 온/오프를 제어한다든지의 다양한 서비스를 제공할 수 있다. 도 18을 참조하면, 전자 장치는 굴곡 정도가 조정가능한 디스플레이를 포함할 수 있다. 전자 장치는 제 1 굴곡 정도를 가지도록 디스플레이를 조정할 수 있으며, 제 2 굴곡 정도를 가지도록 디스플레이 를 조정할 수 있다. 전자 장치는 사용자(1821,1822,1823)의 수를 판단할 수 있다. 본 발명의 다양한 실시예에서, 전자 장치 는 센싱 데이터를 이용하여 인물-배경 분리를 수행할 수 있다. 전자 장치는 인물로 분류된 영역의 개수에 따라서 사용자의 수를 판단할 수 있다. 예를 들어, 전자 장치는 도 18의 좌측에서와 같이, 사용자 (1821,1822,1823)가 3명인 것으로 판단할 수 있으며, 사용자의 수에 따라 디스플레이의 굴곡 정도를 조정 할 수 있다. 한편, 도 18의 우측에서와 같이, 전자 장치는 사용자가 한 명인 것으로 판단할 수도 있으며, 사용자의 수에 따라 디스플레이의 굴곡 정도를 조정할 수 있다. 한편, 전자 장치는 사용자의 수를 기초로 프로그램을 추천한다든지 또는 시청 유무 또는 시청자 수를 여론 조사로 활용할 수도 있다. 도 19를 참조하면, 전자 장치는 회전이 가능한 디스플레이를 포함할 수 있다. 전자 장치는 사용자 의 이동 정보를 판단할 수 있다. 예를 들어, 전자 장치는, 도 19에서와 같이, 사용자 가 상대적으로 좌측으로 이동한다는 정보를 판단할 수 있다. 전자 장치는 사용자의 이동 정보에 기초하여 디스플레이를 회전시킬 수 있다. 전자 장치는 사용자가 디스플레이를 정면으로 바라보도록 디스플레이를 회전시킬 수 있다. 도 20을 참조하면, 전자 장치는 픽셀 어레이를 포함할 수 있다. 한편, 전자 장치는 복수 개의 스피커(2011,2012)를 포함할 수 있다. 전자 장치는 픽셀 어레이에서 센싱된 센싱 데이터를 이용하 여 사용자의 위치 정보를 판단할 수 있다. 전자 장치는 사용자의 위치 정보를 이용하여 복수 개의 스피커(2011,2012)의 빔 포밍(beam forming)(2031,2032) 방향을 판단할 수 있다. 전자 장치는 사용 자의 위치에 빔 포밍(2031,2032)이 형성되도록 스피커(2011,2012)의 음성 출력 딜레이를 조정할 수 있다. 한편, 본 발명의 다양한 실시예에서, 전자 장치는 스피커(2011,2012) 대신 복수 개의 마이크를 포함할 수 도 있다. 전자 장치는 판단된 사용자의 위치 정보를 이용하여 마이크의 빔 포밍 방향을 결정할 수도 있으 며, 이에 따라 보다 정확한 사용자의 음성을 획득할 수 있다. 도 21을 참조하면, 전자 장치는 픽셀 어레이에서 센싱된 센싱 데이터를 이용하여 사용자의 위치 정 보를 판단할 수 있다. 전자 장치는 사용자의 위치 정보를 이용하여 바람의 송출 방향을 조정 할 수 있다. 도 17 내지 21은, 사용자의 위치 정보에 대응한 다양한 동작을 설명하였으며, 이는 단순히 예시적인 것으로, 사 용자의 위치 정보에 근거하여 수행될 수 있는 동작이라면 제한이 없음을 당업자는 용이하게 이해할 수 있을 것 이다. 본 발명의 다양한 실시예에서, 제 1 방향으로 배치된 복수 개의 픽셀을 포함하는 전자 장치의 제어 방법은, 상 기 복수 개의 픽셀에서 센싱된 센싱 데이터를 이용하여 사용자의 위치 정보를 판단하는 동작; 및 상기 사용자의 위치 정보에 대응하는 동작을 수행하는 동작을 포함할 수 있다. 본 발명의 다양한 실시예에서, 상기 사용자의 위치 정보를 판단하는 동작은, 상기 센싱 데이터를 이용하여, 상 기 복수 개의 픽셀을 배경에 대응하는 픽셀과 인물에 대응하는 픽셀로 분리하는 동작; 및 상기 인물에 대응하는 픽셀에 기초하여 상기 사용자의 위치 정보를 판단하는 동작을 포함할 수 있다. 본 발명의 다양한 실시예에서, 상기 사용자의 위치 정보를 판단하는 동작은, 상기 센싱 데이터로부터 특징점을 판단하는 동작; 및 상기 판단된 특징점에 기초하여 상기 복수 개의 픽셀을 상기 배경에 대응하는 픽셀과 상기 인물에 대응하는 픽셀로 분리하는 동작을 포함할 수 있다. 본 발명의 다양한 실시예에서, 상기 사용자의 위치 정보를 판단하는 동작은, 상기 인물에 대응하는 픽셀의 위치 에 기초하여, 상기 사용자의 좌우 방향 위치 또는 상하 방향 위치를 판단할 수 있다. 본 발명의 다양한 실시예에서, 상기 사용자의 위치 정보를 판단하는 동작은, 상기 인물에 대응하는 픽셀의 개수 에 기초하여, 상기 사용자 및 상기 전자 장치 사이의 거리 정보를 판단할 수 있다. 본 발명의 다양한 실시예에서, 상기 복수 개의 픽셀 각각은 복수 개의 서브 픽셀을 포함하며, 상기 사용자의 위 치 정보를 판단하는 동작은, 상기 인물에 대응하는 픽셀 각각의 복수 개의 서브 픽셀에서 센싱된 센싱 데이터의 차이에 기초하여, 상기 사용자 및 상기 전자 장치 사이의 거리 정보를 판단할 수 있다. 본 발명의 다양한 실시예에서, 상기 전자 장치는, 상기 제 1 방향으로 배치된 복수 개의 픽셀을 포함하는 제 1 픽셀 어레이와, 상기 제 1 방향으로 배치된 또 다른 복수 개의 픽셀을 포함하는 제 2 픽셀 어레이를 포함하고, 상기 사용자의 위치 정보를 판단하는 동작은, 상기 제 1 픽셀 어레이 중 인물에 대응하는 픽셀 및 상기 제 2 픽 셀 어레이 중 인물에 대응하는 픽셀 사이의 차이에 기초하여, 상기 사용자 및 상기 전자 장치 사이의 거리 정보 를 판단할 수 있다. 본 발명의 다양한 실시예에서, 상기 사용자의 위치 정보를 판단하는 동작은, 상기 제 1 픽셀 어레이 중 인물에 대응하는 픽셀 및 상기 제 2 픽셀 어레이 중 인물에 대응하는 픽셀에 대하여 스테레오 비전(stereo vision) 기 법을 적용하는 동작; 및 상기 적용 결과에 기초하여 상기 사용자 및 상기 전자 장치 사이의 거리 정보를 판단하 는 동작을 포함할 수 있다. 본 발명의 다양한 실시예에서, 상기 사용자의 위치 정보를 판단하는 동작은, 상기 센싱 데이터와 참조용 데이터 베이스를 비교하는 동작; 및 상기 비교 결과를 이용하여 상기 사용자의 위치 정보를 판단하는 동작을 포함할 수 있다. 본 발명의 다양한 실시예에서, 상기 사용자의 위치 정보를 판단하는 동작은, 상기 센싱 데이터 및 상기 참조용 데이터베이스 사이의 차 영상을 생성하는 동작; 상기 차 영상의 복수 개의 픽셀을 배경에 대응하는 픽셀과 인물에 대응하는 픽셀로 분리하는 동작; 및 상기 인물에 대응하는 픽셀에 기초하여 상기 사용자의 위치 정보를 판단 하는 동작을 포함할 수 있다. 본 발명의 다양한 실시예에서, 상기 복수 개의 픽셀 각각은, 시간의 흐름에 따라서 복수 개의 센싱 데이터를 센 싱하고, 상기 사용자의 위치 정보를 판단하는 동작은, 상기 시간의 흐름에 따라 센싱된 복수 개의 센싱 데이터 각각을 이용하여, 상기 복수 개의 픽셀을 배경에 대응하는 픽셀과 인물에 대응하는 픽셀로 분리하는 동작; 및 상기 인물에 대응하는 픽셀의 시간의 흐름에 따른 변경에 기초하여, 상기 사용자의 이동 정보를 판단하는 동작 을 포함할 수 있다. 상기 전자 장치의 전술한 구성요소들 각각은 하나 또는 그 이상의 부품(component)으로 구성될 수 있으며, 해당 구성 요소의 명칭은 전자 장치의 종류에 따라서 달라질 수 있다. 다양한 실시예에서, 전자 장치는 전술한 구성 요소 중 적어도 하나를 포함하여 구성될 수 있으며, 일부 구성요소가 생략되거나 또는 추가적인 다른 구성요소 를 더 포함할 수 있다. 또한, 다양한 실시예에 따른 전자 장치의 구성 요소들 중 일부가 결합되어 하나의 개체 (entity)로 구성됨으로써, 결합되기 이전의 해당 구성 요소들의 기능을 동일하게 수행할 수 있다. 본 문서에서 사용된 용어 “모듈”은, 예를 들면, 하드웨어, 소프트웨어 또는 펌웨어(firmware) 중 하나 또는 둘 이상의 조합을 포함하는 단위(unit)를 의미할 수 있다. “모듈”은, 예를 들면, 유닛(unit), 로직(logic), 논리 블록(logical block), 부품(component), 또는 회로(circuit) 등의 용어와 바꾸어 사용(interchangeably use)될 수 있다. “모듈”은, 일체로 구성된 부품의 최소 단위 또는 그 일부가 될 수 있다. “모듈”은 하나 또 는 그 이상의 기능을 수행하는 최소 단위 또는 그 일부가 될 수도 있다. “모듈”은 기계적으로 또는 전자적으 로 구현될 수 있다. 예를 들면,“모듈”은, 알려졌거나 앞으로 개발될, 어떤 동작들을 수행하는 ASIC(application-specific integrated circuit) 칩, FPGAs(field-programmable gate arrays) 또는 프로그램 가능 논리 장치(programmable-logic device) 중 적어도 하나를 포함할 수 있다. 다양한 실시예에 따른 장치(예: 모듈들 또는 그 기능들) 또는 방법(예: 동작들)의 적어도 일부는, 예컨대, 프로 그램 모듈의 형태로 컴퓨터로 읽을 수 있는 저장매체(computer-readable storage media)에 저장된 명령어로 구 현될 수 있다. 상기 명령어는, 프로세서(예: 프로세서)에 의해 실행될 경우, 상기 하나 이상의 프로세서가 상기 명령어에 해당하는 기능을 수행할 수 있다. 컴퓨터로 읽을 수 있는 저장매체는, 예를 들면, 상기 메모리 가 될 수 있다. 상기 컴퓨터로 판독 가능한 기록 매체는, 하드디스크, 플로피디스크, 마그네틱 매체(magnetic media)(예: 자기 테이프), 광기록 매체(optical media)(예: CD-ROM(compact disc read only memory), DVD(digital versatile disc), 자기-광 매체(magneto-optical media)(예: 플롭티컬 디스크(floptical disk)), 하드웨어 장치(예: ROM(read only memory), RAM(random access memory), 또는 플래시 메모리 등) 등을 포함할 수 있다. 또한, 프 로그램 명령에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴 퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함할 수 있다. 상술한 하드웨어 장치는 다양한 실시예의 동 작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지다. 다양한 실시예에 따른 모듈 또는 프로그램 모듈은 전술한 구성요소들 중 적어도 하나 이상을 포함하거나, 일부 가 생략되거나, 또는 추가적인 다른 구성요소를 더 포함할 수 있다. 다양한 실시예에 따른 모듈, 프로그램 모듈 또는 다른 구성요소에 의해 수행되는 동작들은 순차적, 병렬적, 반복적 또는 휴리스틱(heuristic)한 방법으로 실행될 수 있다. 또한, 일부 동작은 다른 순서로 실행되거나, 생략되거나, 또는 다른 동작이 추가될 수 있다. 본 발명의 다양한 실시예에 따르면, 명령들을 저장하고 있는 저장 매체에 있어서, 상기 명령들은 적어도 하나의 프로세서에 의하여 실행될 때에 상기 적어도 하나의 프로세서로 하여금 적어도 하나의 동작을 수행하도록 설정 된 것으로서, 상기 적어도 하나의 동작은, 복수 개의 픽셀에서 센싱된 센싱 데이터를 이용하여 사용자의 위치 정보를 판단하는 동작; 및 상기 사용자의 위치 정보에 대응하는 동작을 수행하는 동작을 포함할 수 있다. 그리고 본 문서에 개시된 실시예는 개시된, 기술 내용의 설명 및 이해를 위해 제시된 것이며, 본 개시의 범위를 한정하는 것은 아니다. 따라서, 본 개시의 범위는, 본 개시의 기술적 사상에 근거한 모든 변경 또는 다양한 다 른 실시예를 포함하는 것으로 해석되어야 한다.도면 도면1 도면2 도면3 도면4a 도면4b 도면5 도면6a 도면6b 도면6c 도면7a 도면7b 도면7c 도면8 도면9a 도면9b 도면9c 도면9d 도면9e 도면9f 도면9g 도면9h 도면10 도면11a 도면11b 도면12 도면13a 도면13b 도면13c 도면13d 도면14a 도면14b 도면15 도면16 도면17 도면18 도면19 도면20 도면21"}
{"patent_id": "10-2015-0155183", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 다양한 실시예에 따른 전자 장치 및 네트워크의 블록도를 도시한다. 도 2는 다양한 실시예에 따른 전자 장치의 블록도이다.도 3은 다양한 실시예에 따른 프로그램 모듈의 블록도이다. 도 4a 및 4b는 본 발명의 다양한 실시예에 따른 전자 장치의 개념도를 도시한다. 도 5는 본 발명의 다양한 실시예에 따른 전자 장치의 제어 방법의 흐름도를 도시한다. 도 6a 내지 6c는 본 발명의 다양한 실시예에 따른 다양한 사용자 위치 정보를 결정하는 방법을 설명하기 위한 흐름도들을 도시한다. 도 7a 및 7b는 본 발명의 다양한 실시예에 따른 사용자의 좌우 위치를 판단하는 방법을 설명하기 위한 개념도를 도시한다. 도 7c는 본 발명의 다양한 실시예에 따른 사용자와 전자 장치 사이의 거리를 판단하는 방법을 설명하기 위한 개 념도를 도시한다. 도 8은 본 발명의 다양한 실시예에 따른 전자 장치의 제어 방법을 설명하기 위한 흐름도를 도시한다. 도 9a 내지 9h는 본 발명의 다양한 실시예에 따른 픽셀 어레이의 인물-배경 분리 결과를 설명하기 위한 개념도 들을 도시한다. 도 10은 본 발명의 다양한 실시예에 따른 복수 개의 픽셀 어레이를 포함하는 전자 장치의 제어 방법을 설명하기 위한 흐름도를 도시한다. 도 11a 및 11b는 복수 개의 픽셀 어레이를 포함하는 전자 장치의 동작을 설명하기 위한 개념도들을 도시한다. 도 12는 본 발명의 다양한 실시예에 따른 데이터베이스를 이용한 전자 장치의 제어 방법을 설명하기 위한 흐름 도를 도시한다. 도 13a 내지 13d는 본 발명의 다양한 실시예에 따른 전자 장치의 데이터베이스를 이용한 사용자의 위치 정보 판 단을 설명하기 위한 개념도들을 도시한다. 도 14a 및 14b는 본 발명의 다양한 실시예에 따른 전자 장치의 배치를 설명하기 위한 개념도들을 도시한다. 도 15는 본 발명의 다양한 실시예에 따른 전자 장치의 제어 방법을 설명하기 위한 흐름도를 도시한다. 도 16은 본 발명의 다양한 실시예에 따른 전자 장치의 개념도를 도시한다. 도 17 내지 21은 본 발명의 다양한 실시예에 따른 사용자의 위치 정보에 따른 전자 장치의 동작을 설명하기 위 한 개념도들을 도시한다."}
