{"patent_id": "10-2020-7031808", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0139237", "출원번호": "10-2020-7031808", "발명의 명칭": "품질 관리를 위한 라만 분광법 및 머신 러닝", "출원인": "브라스켐 아메리카, 인크.", "발명자": "구즈만 칼도조 구스타보 에이"}}
{"patent_id": "10-2020-7031808", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "중합체의 라만 스펙트럼에 기초하여 중합체의 품질을 결정하는 방법으로서,중합체 특성 컴퓨팅 장치에 의해, 라만 분광기로부터 중합체 샘플의 라만 스펙트럼을 수득하는 단계로서, 여기서 라만 스펙트럼은 하나 이상의 중합체 특성 또는 특징에 해당하는 화학적 및 구조적 지문의 복수의 피크 및밸리를 포함하는 단계;중합체 특성 컴퓨팅 장치에 의해, 상기 수득된 화학적 및 구조적 지문을 저장된 중합체 특성 및 특징 데이터와비교함으로써 하나 이상의 중합체 특성 또는 특징을 컴퓨팅하는 단계로서, 여기서 컴퓨팅 단계는 중합체 특성컴퓨팅 장치에 의해 하나 이상의 훈련된 머신 러닝 알고리즘을 실행함으로써 수행되는 단계; 및중합체 특성 컴퓨팅 장치에 의해, 하나 이상의 컴퓨팅된 중합체 특성 또는 특징에 기초하여 중합체 샘플의 품질이 소정의 품질 임계값을 충족하는지 여부를 결정하는 단계를 포함하는, 중합체의 라만 스펙트럼에 기초하여 중합체의 품질을 결정하는 방법."}
{"patent_id": "10-2020-7031808", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 컴퓨팅 단계 전에, 중합체 특성 컴퓨팅 장치에 의해, 수득된 화학적 및 구조적 지문의 피크 및/또는 밸리를 관련 중합체 특징 또는 비관련 중합체 특징으로서 분류하는 단계를 더 포함하는 것인 결정방법."}
{"patent_id": "10-2020-7031808", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 컴퓨팅 단계 전에, 중합체 특성 컴퓨팅 장치에 의해, 중합체 샘플의 수득된 라만 스펙트럼을 하나 이상의 훈련된 머신 러닝 알고리즘에 의해 판독가능한 포맷으로 변환하는 단계를 더 포함하는 것인결정 방법."}
{"patent_id": "10-2020-7031808", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 결정 단계 후에, 중합체 특성 컴퓨팅 장치에 의해, 하나 이상의 컴퓨팅된 중합체 특성 또는 특징을 보고하는 단계를 더 포함하는 것인 결정 방법."}
{"patent_id": "10-2020-7031808", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 중합체 샘플이 폴리올레핀을 포함하는 것인 결정 방법."}
{"patent_id": "10-2020-7031808", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 폴리올레핀이 폴리프로필렌인 결정 방법."}
{"patent_id": "10-2020-7031808", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 중합체 샘플이 펠렛 형태인 결정 방법."}
{"patent_id": "10-2020-7031808", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 하나 이상의 중합체 특성은 분자량, 용융 유속, 층상 두께, 결정도, 자일렌 솔루블, 하나 이상의 인장 특성 및 하나 이상의 압축 특성으로 이루어진 군으로부터 선택되는 하나 이상의 특성이고; 하나 이상의중합체 특징은 존재하는 경우 하나 이상의 첨가제의 양 및 존재하는 경우 하나 이상의 공단량체의 양으로 이루어진 군으로부터 선택되는 하나 이상의 특징인 결정 방법."}
{"patent_id": "10-2020-7031808", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서, 중합체 특성 컴퓨팅 장치에 의해, 하나 이상의 컴퓨팅된 중합체 특성 또는 특징에 기초하여 중공개특허 10-2020-0139237-3-합체 생산 공정을 조정하는 단계를 추가로 포함하는 것인 결정 방법."}
{"patent_id": "10-2020-7031808", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서, 상기 하나 이상의 훈련된 머신 러닝 알고리즘은 중합체 특성 컴퓨팅 장치에 의해, 복수의 공지된 중합체 샘플 각각에 대해 라만 스펙트럼 및 측정된 중합체 특성 및 특징을 수신하는 단계;중합체 특성 컴퓨팅 장치에 의해, 상기 수신된 라만 스펙트럼의 구조적 및 화학적 지문의 하나 이상의 피크 및/또는 밸리를 측정된 중합체 특성 및 특징과 연관시켜 중합체 특성 및 특징 데이터의 적어도 일부를 형성하는 단계;중합체 특성 컴퓨팅 장치에 의해, 구조적 및 화학적 지문의 연관된 하나 이상의 피크 및/또는 밸리를 인식하고중합체 특성 및 특징을 컴퓨팅하는 것을 학습하도록 하나 이상의 머신 러닝 알고리즘을 실행하는 단계;중합체 특성 컴퓨팅 장치에 의해, 컴퓨팅된 중합체 특성 및 특징과 측정된 중합체 특성 및 특징 사이의 임의의오류를 최소화하기 위해 하나 이상의 하이퍼파라미터를 조정하는 단계; 및중합체 특성 컴퓨팅 장치에 의해, 적어도 실행 단계 및 조정 단계를 반복하여 하나 이상의 훈련된 머신 러닝 알고리즘을 형성하는 단계에 의해 훈련되는 것인 결정 방법."}
{"patent_id": "10-2020-7031808", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서, 중합체 특성 컴퓨팅 장치에 의해, 하나 이상의 앙상블 기술로 하나 이상의 훈련된 머신 러닝알고리즘을 향상시키는 단계를 더 포함하는 것인 방법."}
{"patent_id": "10-2020-7031808", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항에 있어서, 중합체 특성 컴퓨팅 장치에 의해, 적어도 실행 단계 및 조정 단계를 반복함으로써 하나 이상의 훈련된 머신 러닝 알고리즘을 리파이닝하는 단계를 더 포함하는 것인 방법."}
{"patent_id": "10-2020-7031808", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "적어도 하나의 프로세서에 의해 실행될 때 상기 프로세서가라만 분광기로부터 중합체 샘플의 라만 스펙트럼을 수득하는 단계로서, 여기서 라만 스펙트럼은 하나 이상의 중합체 특성 또는 특징에 해당하는 화학적 및 구조적 지문의 복수의 피크 및 밸리를 포함하는 단계;수득된 화학적 및 구조적 지문을 저장된 중합체 특성 및 특징 데이터와 비교함으로써 하나 이상의 중합체 특성또는 특징을 컴퓨팅하는 단계로서, 여기서 컴퓨팅 단계는 하나 이상의 훈련된 머신 러닝 알고리즘을 실행함으로써 수행되는 단계; 및하나 이상의 컴퓨팅된 중합체 특성 또는 특징에 기초하여, 중합체 샘플의 품질이 소정의 품질 임계값을 충족하는지 여부를 결정하는 단계를 포함하는 단계들을 수행하게 하는 머신 실행가능 코드를 포함하는, 중합체의 라만 스펙트럼에 기초하여 중합체의 품질을 결정하기 위한 명령이 저장된 비일시적 컴퓨터 판독가능 매체."}
{"patent_id": "10-2020-7031808", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서, 상기 컴퓨팅 단계 전에, 중합체 특성 컴퓨팅 장치에 의해, 수득된 화학적 및 구조적 지문의피크 및/또는 밸리를 관련 중합체 특징 또는 비관련 중합체 특징으로서 분류하는 단계를 더 포함하는 것인매체."}
{"patent_id": "10-2020-7031808", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제13항에 있어서, 상기 결정 단계 후에, 중합체 특성 컴퓨팅 장치에 의해, 하나 이상의 컴퓨팅된 중합체 특성또는 특징을 보고하는 단계를 더 포함하는 것인 매체.공개특허 10-2020-0139237-4-청구항 16 제13항에 있어서, 중합체 샘플이 폴리올레핀을 포함하는 것인 매체."}
{"patent_id": "10-2020-7031808", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제13항에 있어서, 하나 이상의 중합체 특성은 분자량, 용융 유속, 층상 두께, 결정도, 자일렌 솔루블, 하나 이상의 인장 특성 및 하나 이상의 압축 특성으로 이루어진 군으로부터 선택되는 하나 이상의 특성이고; 하나 이상의 중합체 특징은 존재하는 경우 하나 이상의 첨가제의 양 및 존재하는 경우 하나 이상의 공단량체의 양으로 이루어진 군으로부터 선택되는 하나 이상의 특징인 매체."}
{"patent_id": "10-2020-7031808", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제13항에 있어서, 상기 수득 단계 전에, 하나 이상의 머신 러닝 알고리즘을 훈련시키는 단계를 더 포함하고, 상기 훈련 단계는복수의 공지된 중합체 샘플 각각에 대해 라만 스펙트럼 및 측정된 중합체 특성 및 특징을 수신하는 단계;수신된 라만 스펙트럼의 구조적 및 화학적 지문의 하나 이상의 피크 및/또는 밸리를 측정된 중합체 특성 및 특징과 연관시켜 중합체 특성 및 특징 데이터의 적어도 일부를 형성하는 단계;구조적 및 화학적 지문의 연관된 하나 이상의 피크 및/또는 밸리를 인식하고 중합체 특성 및 특징을 컴퓨팅하는것을 학습하도록 하나 이상의 머신 러닝 알고리즘을 실행하는 단계;컴퓨팅된 중합체 특성 및 특징과 측정된 중합체 특성 및 특징 사이의 임의의 오류를 최소화하기 위해 하나 이상의 하이퍼파라미터를 조정하는 단계; 및적어도 실행 단계 및 조정 단계를 반복하여 하나 이상의 훈련된 머신 러닝 알고리즘을 형성하는 단계를 포함하는 것인 매체."}
{"patent_id": "10-2020-7031808", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "중합체 특성 컴퓨팅 장치로서,프로세서;메모리를 포함하고, 상기 메모리는라만 분광기로부터 중합체 샘플의 라만 스펙트럼을 수득하는 단계로서, 여기서 라만 스펙트럼은 하나 이상의 중합체 특성 또는 특징에 해당하는 화학적 및 구조적 지문의 복수의 피크 및 밸리를 포함하는 단계;수득된 화학적 및 구조적 지문을 저장된 중합체 특성 및 특징 데이터와 비교함으로써 하나 이상의 중합체 특성또는 특징을 컴퓨팅하는 단계로서, 여기서 컴퓨팅 단계는 하나 이상의 훈련된 머신 러닝 알고리즘을 실행함으로써 수행되는 단계; 및하나 이상의 컴퓨팅된 중합체 특성 또는 특징에 기초하여, 중합체 샘플의 품질이 소정의 품질 임계값을 충족하는지 여부를 결정하는 단계를 포함하는 상기 메모리에 저장된 프로그래밍된 명령을 실행하도록 구성된 상기 프로세서에 연결되는, 중합체특성 컴퓨팅 장치."}
{"patent_id": "10-2020-7031808", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서, 상기 프로세서는, 상기 컴퓨팅 단계 전에 중합체 특성 컴퓨팅 장치에 의해 상기 수득된 화학적 및 구조적 지문의 피크 및/또는 밸리를 관련 중합체 특징 또는 비관련 중합체 특징으로서 분류하는 단계를더 포함하는 상기 메모리에 저장된 프로그래밍된 명령을 실행하도록 추가로 구성되는 것인 장치."}
{"patent_id": "10-2020-7031808", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제19항에 있어서, 상기 프로세서는, 상기 결정 단계 후에 중합체 특성 컴퓨팅 장치에 의해 상기 하나 이상의 컴퓨팅된 중합체 특성 또는 특징을 보고하는 단계를 더 포함하는 상기 메모리에 저장된 프로그래밍된 명령을 실행공개특허 10-2020-0139237-5-하도록 추가로 구성되는 것인 장치."}
{"patent_id": "10-2020-7031808", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제19항에 있어서, 중합체 샘플이 폴리올레핀을 포함하는 것인 장치."}
{"patent_id": "10-2020-7031808", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제19항에 있어서, 하나 이상의 중합체 특성은 분자량, 용융 유속, 층상 두께, 결정도, 자일렌 솔루블, 하나 이상의 인장 특성 및 하나 이상의 압축 특성으로 이루어진 군으로부터 선택되는 하나 이상의 특성이고; 하나 이상의 중합체 특징은 존재하는 경우 하나 이상의 첨가제의 양 및 존재하는 경우 하나 이상의 공단량체의 양으로 이루어진 군으로부터 선택되는 하나 이상의 특징인 장치."}
{"patent_id": "10-2020-7031808", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제19항에 있어서, 상기 프로세서는, 상기 수득 단계 전에 하나 이상의 머신 러닝 알고리즘을 훈련시키는 단계를더 포함하는 상기 메모리에 저장된 프로그래밍된 명령을 실행하도록 추가로 구성되고, 상기 훈련 단계는복수의 공지된 중합체 샘플 각각에 대해 라만 스펙트럼 및 측정된 중합체 특성 및 특징을 수신하는 단계;수신된 라만 스펙트럼의 구조적 및 화학적 지문의 하나 이상의 피크 및/또는 밸리를 측정된 중합체 특성 및 특징과 연관시켜 중합체 특성 및 특징 데이터의 적어도 일부를 형성하는 단계;구조적 및 화학적 지문의 연관된 하나 이상의 피크 및/또는 밸리를 인식하고 중합체 특성 및 특징을 컴퓨팅하는것을 학습하도록 하나 이상의 머신 러닝 알고리즘을 실행하는 단계;컴퓨팅된 중합체 특성 및 특징과 측정된 중합체 특성 및 특징 사이의 임의의 오류를 최소화하기 위해 하나 이상의 하이퍼파라미터를 조정하는 단계; 및적어도 실행 단계 및 조정 단계를 반복하여 하나 이상의 훈련된 머신 러닝 알고리즘을 형성하는 단계를 포함하는 것인 장치."}
{"patent_id": "10-2020-7031808", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시 내용은 중합체, 더 구체적으로는 폴리올레핀의 품질을 결정하기 위한 방법에 관한 것이다. 이 방법은 중 합체 특성 및/또는 특징을 컴퓨팅하기 위해 라만 분광법 및 인공 지능을 수반한다."}
{"patent_id": "10-2020-7031808", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "우선권 주장 본 출원은 35 U.S.C. §119(e)하에 본원에 그 전문이 참조로 포함되어 있는 2018년 4월 6일 출원된 미국 가출원 62/653,791호를 우선권으로 주장한다. 발명의 분야 본 발명은 일반적으로 중합체, 더 구체적으로 폴리올레핀의 품질을 결정하는 방법에 관한 것이다. 본 방법은 라 만 분광법 및 인공 지능을 수반한다."}
{"patent_id": "10-2020-7031808", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "중합체 제조 공정에서, 중합체의 품질은 일반적으로 실험실에서 시험되며, 여기서 용융 흐름, 자일렌 솔루블, 밀도 및 기계적 특성과 같은 중합체 특성은 ASTM 절차에 따라 측정된다. 전체 샘플링 및 시험 프로세스는 몇 시 간이 걸릴 수 있다. 중합체가 사양을 충족하지 않으면, 제조 로트가 거부되고 프로세스 엔지니어가 수정 조치를 취한다. 그래서, 이 프로세스는 비용이 많이 들고 수고스럽고 느리다. 또한, 제조 공장의 생산 속도가 일반적으 로 높기 때문에, 몇 시간의 지연 시간은 임의의 문제가 감지되기 전에 몇 톤의 제품이 수집된다는 것을 의미한 다. 따라서, 비용을 절감하고 프로세스 엔지니어에게 빠르고 신뢰할 수 있는 피드백을 제공하기 위해 품질 관리 프 로세스를 가속시켜야 한다는 미충족된 필요성이 당업계에 존재한다."}
{"patent_id": "10-2020-7031808", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "발명의 요약 본 발명의 한 측면은, 중합체의 라만 스펙트럼에 기초하여 중합체의 품질을 결정하는 방법에 관한 것으로, 이 방법은 (i) 중합체 특성 컴퓨팅 장치에 의해, 라만 분광기로부터 중합체 샘플의 라만 스펙트럼을 수득하는 단계 로서, 여기서 라만 스펙트럼은 하나 이상의 중합체 특성 또는 특징에 해당하는 화학적 및 구조적 지문의 복수의 피크 및 밸리를 포함하는 단계; (ii) 중합체 특성 컴퓨팅 장치에 의해, 수득된 화학적 및 구조적 지문을 저장된 중합체 특성 및 특징 데이터와 비교함으로써 하나 이상의 중합체 특성 또는 특징을 컴퓨팅하는 단계로서, 여기 서 컴퓨팅 단계는 중합체 특성 컴퓨팅 장치에 의해 하나 이상의 훈련된 머신 러닝 알고리즘을 실행함으로써 수 행되는 단계; 및 (iii) 중합체 특성 컴퓨팅 장치에 의해, 하나 이상의 컴퓨팅된 중합체 특성 또는 특징에 기초 하여, 중합체 샘플의 품질이 소정의 품질 임계값을 충족하는지 여부를 결정하는 단계를 포함한다. 본 발명의 다른 측면은, 프로세서 및 메모리를 포함하는 중합체 특성 컴퓨팅 장치에 관한 것으로, 여기서 메모 리는 (i) 라만 분광기로부터 중합체 샘플의 라만 스펙트럼을 수득하는 단계로서, 여기서 라만 스펙트럼은 하나 이상의 중합체 특성 또는 특징에 해당하는 화학적 및 구조적 지문의 복수의 피크 및 밸리를 포함하는 단계; (ii) 수득된 화학적 및 구조적 지문을 저장된 중합체 특성 및 특징 데이터와 비교함으로써 하나 이상의 중합체 특성 또는 특징을 컴퓨팅하는 단계로서, 여기서 컴퓨팅 단계는 하나 이상의 훈련된 머신 러닝 알고리즘을 실행 함으로써 수행되는 단계; 및 (iii) 하나 이상의 컴퓨팅된 중합체 특성 또는 특징에 기초하여, 중합체 샘플의 품 질이 소정의 품질 임계값을 충족하는지 여부를 결정하는 단계를 포함하는 상기 메모리에 저장된 프로그래밍된 명령을 실행하도록 구성된 상기 프로세서에 연결된다. 본 발명의 다른 측면은, 적어도 하나의 프로세서에 의해 실행될 때 프로세서가 (i) 라만 분광기로부터 중합체 샘플의 라만 스펙트럼을 수득하는 단계로서, 여기서 라만 스펙트럼은 하나 이상의 중합체 특성 또는 특징에 해 당하는 화학적 및 구조적 지문에서의 복수의 피크 및 밸리를 포함하는 단계; (ii) 수득된 화학적 및 구조적 지 문을 저장된 중합체 특성 및 특징 데이터와 비교함으로써 하나 이상의 중합체 특성 또는 특징을 컴퓨팅하는 단 계로서, 여기서 컴퓨팅 단계는 하나 이상의 훈련된 머신 러닝 알고리즘을 실행함으로써 수행되는 단계; 및 (iii) 하나 이상의 컴퓨팅된 중합체 특성 또는 특징에 기초하여, 중합체 샘플의 품질이 소정의 품질 임계값을 충족하는지 여부를 결정하는 단계를 포함하는 단계들을 수행하게 하는 머신 실행가능 코드를 포함하는, 중합체 의 라만 스펙트럼에 기초하여 중합체의 품질을 결정하기 위한 명령이 저장되어 있는 비일시적 컴퓨터 판독가능 매체에 관한 것이다."}
{"patent_id": "10-2020-7031808", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "발명의 상세한 설명 라만 분광법은, 재현 가능하고 샘플 준비가 필요하지 않으며 구조적 및 화학적 정보를 포함하는 선명하고 잘 분 해된 피크와 밸리를 갖는 스펙트럼을 제공하기 때문에 고분자 재료에 대한 매력적인 분석 기술이다. 라만 분광 법은 단색 레이저광을 사용하며 비탄성 산란에 의존한다. 레이저광은 중합체의 분자 진동과 상호 작용하여 레이 저 광자의 에너지를 이동시킨다. 최근의 고성능 홀로그래픽 필터 및 파장-안정화된 레이저 소스의 개발은 저주파수 라만 영역(즉, THz 주파수 대)에 대한 접근을 가능하게 한다. 도 1 참조. 이 영역에서 중합체 사슬은 긴 음향 모드(LAM)로 진동한다. 이러 한 진동은 약 0.1∼10 ps 시간 척도에서 발생하며 약 0.3∼3.0 THz 또는 10 cm-1 내지 100 cm-1에서 스펙트럼을 나타낸다. 또한, 이러한 진동은 사슬 길이(Mw, 용융 흐름), 층상 두께(결정도, 자일렌 솔루블 %) 및 응력 필드 (기계적 특성)와 같은 구조적 매개변수와 연관될 수 있다. 라만 스펙트럼의 구조적 및 화학적 정보가 풍부함에도 불구하고, 라만 스펙트럼을 중합체의 특성/특징과 신뢰성 있게 연관시키는 매개변수 모델을 생성하는 것은 어렵다. 주된 어려움은 데이터 차원이다. 스펙트럼의 각 지점 은 특정 파장에서 기록된 강도를 나타낸다. 따라서, 라만 데이터 세트는 그 구성 스펙트럼의 각 지점에 대해 하 나의 속성을 가지며 일반적인 라만 스펙트럼은 1,000∼3,000 쌍의 데이터 포인트(약 3,000 차원)를 가진다. 일 반적으로 관련 대역은 재료의 분광학적 거동에 대한 전문 지식을 기반으로 수동으로 선택되고 나머지 정보는 버 려진다. 따라서, 이 수동 스펙트럼 평가는 온라인 제품 특성화에 적합하지 않다. 게다가, 스펙트럼 데이터는 용융 유속, 밀도, 분자량 분포와 같은 중합체 특성과 연관될 수 있지만, 이 정보는 단순히 스펙트럼을 보고 시각적으로 관 찰하는 것에 의해서는 쉽게 알 수 없다. 대신에, 본 개시된 방법은 인공 지능, 보다 구체적으로는 머신 러닝 기술을 사용하여, 라만 스펙트럼으로부터 관련 중합체 특성/특징을 예측할 수 있는 모델을 개발한다. 또한 온라인 비파괴 핑거프린트법과 인공 지능을 사 용함으로써 제품 사양의 실시간 추정을 얻을 수 있으므로, 품질 관리를 위해 종래의 실험실 장비를 사용하는 것 과 관련된 시간과 비용을 줄일 수 있다. 따라서, 본 발명의 한 측면은, 중합체의 라만 스펙트럼에 기초하여 중합체의 품질을 결정하는 방법에 관한 것으 로, 이 방법은 (i) 중합체 특성 컴퓨팅 장치에 의해, 라만 분광기로부터 중합체 샘플의 라만 스펙트럼을 수득하 는 단계로서, 여기서 라만 스펙트럼은 하나 이상의 중합체 특성 또는 특징에 해당하는 화학적 및 구조적 지문의 복수의 피크 및 밸리를 포함하는 단계; (ii) 중합체 특성 컴퓨팅 장치에 의해, 수득된 화학적 및 구조적 지문을 저장된 중합체 특성 및 특징 데이터와 비교함으로써 하나 이상의 중합체 특성 또는 특징을 컴퓨팅하는 단계로서, 여기서 컴퓨팅 단계는 중합체 특성 컴퓨팅 장치에 의해 하나 이상의 훈련된 머신 러닝 알고리즘을 실 행함으로써 수행되는 단계; 및 (iii) 중합체 특성 컴퓨팅 장치에 의해, 하나 이상의 컴퓨팅된 중합체 특성 또는 특징에 기초하여, 중합체 샘플의 품질이 소정의 품질 임계값을 충족하는지 여부를 결정하는 단계를 포함한다. 중합체 샘플의 라만 스펙트럼의 수득은 (예컨대, 중합체 특성 컴퓨팅 장치에 프로그래밍되어) 자동으로 또는 수 동으로 개시될 수 있다. 하나 이상의 중합체 특성 또는 특징을 컴퓨팅하기 위한 예시적인 알고리즘은 로지스틱 회귀, 나이브 베이, 신경 망, 딥 러닝, 및 커널 지원 벡터 머신 회귀, 가우시안 프로세스 및 커널 릿지 회귀와 같은 커널 머신 방법을 포 함하지만 이에 한정되지 않다. 이들 알고리즘의 조합도 사용할 수 있다. 머신 러닝 알고리즘의 훈련에서는, 알려진 샘플의 라만 스펙트럼을 수득하고, 알려진 샘플의 중합체 특성/특징 을 실험실에서 측정한다. 중합체 특성/특징은 당업자에게 공지된 방법으로 측정될 수 있다. 예컨대, 샘플의 용 융 유속은 230℃에서 2.16 kg의 하중을 사용하여 ASTM D1238에 따라 측정될 수 있다. 특정 수의 보정 샘플이 필 요하지 않다. 당업자는 모델의 성능 및 추가 보정 데이터를 사용한 성능의 증분 변화를 기반으로 적절한 수의 보정 샘플을 결정할 수 있다. 측정된 중합체 특성/특징은 모델이 컴퓨팅할 것들을 포함한다. 이어서 측정된 중 합체 특성/특징 및 수득된 라만 스펙트럼은 중합체 특성 컴퓨팅 장치에 입력한다. 원하는 중합체 특성을 위해, 측정된 중합체 특성/특징 및 샘플에 대한 각각의 라만 스펙트럼 데이터를 포함하는 데이터 세트는 API(application programming interface) 또는 그래픽 사용자 인터페이스로 액세스할 수 있는테이블 형식의 머신 판독가능 데이터베이스로 수집된다. 대부분의 머신 러닝 방법은 일반적으로 입력 변수가 0 평균 및 단위 분산을 갖지 않으면 제대로 수행되지 않으 므로, 입력 변수는 일반적으로 0 평균 및 1과 같은 표준 편차를 얻기 위해 스케일링된다. 즉, 데이터는 머신 러 닝 알고리즘이 판독할 수 있도록 변환된다. 이 프로세스는 특징 엔지니어링 또는 변수 엔지니어링이라고 알려져 있다. 수집 및 특징/변수 엔지니어링 단계 동안, 그 중 일부는 관련이 없더라도 많은 가능한 변수가 생성된다. 예컨대, 원래의 특징들 사이에 기본적인 산술 연산을 적용함으로써 새 변수를 생성할 수 있다. 특징/변수 엔지 니어링 프로세스는 또한 누락된 값을 갖는 예를 삭제하거나 또는 누락된 값을 주어진 변수의 평균으로 대체하는 것 및 이상값을 식별하고 제거하는 것을 포함할 수 있다. 적절한 특징 엔지니어링 작업이 식별되면, \"데이터 변 환 파이프라인\"을 작성하여 동일한 변수 작업을 머신 러닝 알고리즘에 제시되는 데이터에 적용할 수 있다. 데이 터는 측정된 중합체 특성/특성을 가진 알려진 샘플 또는 알려지지 않은 샘플로부터 얻을 수 있다. 훈련 단계의 다음 단계는 특징 선택 및 차원 감소를 수반한다. 특정 입력 특징은 관련성이 높거나(임의의 다른 특징에 없는 정보를 갖거나), 관련성이 있거나, 관련성이 낮거나(임의의 다른 특징에 포함된 일부 정보) 또는 관련이 없을 수 있다. 특징 선택 동안, 관련성이 높은 특징의 하위 집합이 모델 구성에 사용된다. 이 단계에서, 하나 이상의 피크 및/또는 밸리를 측정된 특성/특징과 연관시켜 중합체 특성 및 특징 데이터의 일부를 형성한다. 예컨대, 810 cm-1, 841 cm-1, 900 cm-1, 974 cm-1, 999 cm-1, 1152 cm-1, 1168 cm-1, 1220 cm-1, 1329 cm- 1, 1359 cm-1, 1436 cm-1 및 1459 cm-1에서의 피크는 폴리프로필렌의 결정도, 기계적 특성 및 입체 규칙성을 특성 화하는 데 유용할 수 있다(특정 중합체 특성에 기인하는 특정 피크에 대한 논의에 대해서는 Julio Banquet- Teran et al., Applied Spectroscopy, 2016, p. 1118-1127 참조). 106 cm-1, 171 cm-1, 250 cm-1, 320 cm-1, 398 cm-1, 460 cm-1 및 530 cm-1에서의 THz 저주파 대역을 사용하여 이소택틱 폴리프로필렌의 결정 변형(α, β 및 γ), 층상 두께, 기계적 특성, 나선 형태의 이소택틱 세그먼트 길이 및 공단량체 함량을 식별할 수 있다(유용한 대역에 대한 일반적인 설명에 대해서는 A Materny at al., Journal of Physics: Conference Series, 2017, p. 1-9 참조). 모델은 당업계에 알려진 방법을 사용하여 훈련될 수 있다. 예컨대, 수집된 데이터는 일반적으로 훈련 데이터 세 트(일반적으로 수집된 데이터의 약 80%)와 시험 데이터 세트(일반적으로 수집된 데이터의 약 20%)의 두 세트로 나뉜다. 훈련 데이터 세트는 모델을 개발하는 데 사용되며, 머신 러닝 알고리즘이 실행되어 훈련 데이터 세트를 분석하고 추론된 함수를 생성한다. 훈련 데이터 세트 샘플에 대해 선택된 중합체 특성/특징이 컴퓨팅되고 측정 되므로, 컴퓨팅된 값과 측정된 값을 비교하여 모델의 효과를 평가할 수 있다. 최적화 알고리즘은 일반적으로 경 험적 위험 또는 구조적 위험을 최소화하는 데 사용된다. 이는 (하이퍼매개변수라고 알려진) 추정된 함수 매개변 수를 조정하여 수행될 수 있으므로 알려진 출력과 모델 예측 사이의 오류가 최소화된다. 이어서, 훈련된 모델(즉, 머신 러닝 알고리즘)은 시험 데이터 세트로부터 중합체 특성/특징을 컴퓨팅하는 임무 를 맡는다. 이것은 모델의 일반화 능력을 평가하기 위해 수행된다. 이후 훈련된 모델을 알려지지 않은 샘플 스펙트럼에 적용하여 원하는 중합체 특성 또는 특징을 컴퓨팅할 수 있 다. 모델은 하나 이상의 중합체 특성/특징을 예측하도록 훈련될 수 있다. 일부 실시양태에서는, 각 중합체 특성/특 징에 대해 별도의 모델을 개발한다. 다른 실시양태에서는, 모델을 사용하여 다수의 중합체 특성/특징을 동시에 결정할 수 있다. 훈련된 모델은 앙상블 기술에 의해 더욱 향상될 수 있는데, 여기서 목표는 단일 추정기에 대한 일반화 가능성/ 견고성을 개선하기 위해 주어진 학습 알고리즘으로 구축된 여러 기본 추정기의 예측을 결합하는 것이다. 일부 앙상블 방법에는 배깅 방법, 무작위 트리 포레스트, 에이다부스트, 그래디언트 트리 부스팅 및 보팅 분류기가 포함된다. 일부 실시양태에서, 본 방법은, 컴퓨팅 단계 전에, 중합체 특성 컴퓨팅 장치에 의해, 수득된 화학적 및 구조적 지문의 피크 및/또는 밸리를 관련 중합체 특징 또는 비관련 중합체 특징으로 분류하는 단계를 추가로 포함한다. 하나의 예시적인 예로서, 810 cm-1, 974 cm-1 및 1168 cm-1에서의 피크는, 이들 피크가 폴리프로필렌의 결정도 및 입체 규칙성과 관련되기 때문에, 관련 중합체 특징으로 분류될 수 있다. 일부 실시양태에서, 본 방법은, 결정 단계 후에, 중합체 특성 컴퓨팅 장치에 의해, 하나 이상의 컴퓨팅된 중합 체 특성 또는 특징을 보고하는 단계를 추가로 포함한다. 예컨대, 하나 이상의 컴퓨팅된 중합체 특성 또는 특징 은 컴퓨터(예컨대, 데스크탑, 랩탑, 태블릿, 모바일 폰 및 스마트 시계)의 화면에 표시될 수 있다. 일부 실시양태에서, 본 방법은, 중합체 특성 컴퓨팅 장치에 의해, 적어도 공정 중 데이터를 사용하여 실행 단계 및 조정 단계를 반복함으로써 하나 이상의 훈련된 머신 러닝 알고리즘을 리파이닝하는 단계를 추가로 포함한다. 이후 머신 러닝 알고리즘은 제품 휠이 변경됨에 따라 지속적으로 리파이닝되므로 시간이 지남에 따라 그 예측능 이 향상된다. 중합체 특성 컴퓨팅 장치는, 하나 이상의 컴퓨팅된 중합체 특성 또는 특징에 기초하여, 중합체 샘플의 품질이 일반적으로 허용가능한 로트간 변동을 포함하는 소정의 품질 임계값을 충족하는지 여부를 결정할 수 있다. 하나 이상의 컴퓨팅된 중합체 특성 또는 특징이 허용가능한 범위 내에 있는 경우, 중합체 샘플은 품질 임계값을 충족하는 것으로 간주될 수 있으며, 중합체 생산 공정은 추가의 조정없이 계속될 수 있다. 하나 이상의 컴퓨팅된 중합체 특성 또는 특징이 허용 가능한 범위를 벗어나면, 중합체 샘플은 소정의 품질 임계 값을 충족하지 않는다. 따라서, 중합체 생산 공정에 대한 매개변수를 중합체 특성 컴퓨팅 장치에 의해 조정하여 원하는 특성 또는 특징을 갖는 중합체를 달성할 수 있다. 이들 매개 변수는 반응물(예컨대, 프로필렌, 에틸렌, 수소), 첨가제 및 중합 촉매의 양/농도; 온도; 및 압력을 포함하나 이에 한정되지 않는다. 라만 분광법 라만 분광법은 분자 특성화, 식별 및 정량화를 위한 잘 알려진 분석 도구이다. 라만 분광법은 분자 진동-회전 상태에 대한 정보를 얻기 위해 비공진 비이온화 방사선 소스, 일반적으로 레이저와 같은 가시광선 또는 근적외 선 방사선 소스로부터 비탄성적으로 산란된 방사선을 사용한다. 라만 스펙트럼은 폴리올레핀 샘플의 다양한 특 성과 직접 또는 간접적으로 관련된 정보를 포함한다. 라만 스펙트럼은 일반적으로 강도(임의 단위) 대 \"라만 이 동\"의 플롯으로서 도시되며, 여기서 라만 이동은 여기 방사선과 산란된 방사선 사이의 에너지 또는 파장 차이다. 라만 이동은 일반적으로 파수 단위(cm-1)로 보고된다. 수득된 라만 스펙트럼의 스펙트럼 범위는 특별히 제한되지 않지만, 유용한 범위는 일반적인 다원자 진동 주파수 범위에 해당하는 화학적 지문 영역 및 진동 모드 에 해당하는 구조적 지문 영역에서의 라만 이동(스토크 및/또는 안티스토크)을 포함한다. 스펙트럼 범위는 일반 적으로 약 -200 cm-1 내지 약 4,000 cm-1의 범위이다. 그러나, 유용한 스펙트럼 정보가 더 높은 주파수 영역에도 존재할 수 있음을 이해해야 한다. 예컨대, 배음 진동(고조파)은 4,000 cm-1 라만 이동 이상의 영역에서 라만 산 란에 기여한다. 따라서, 원한다면, 여기에 설명된 바와 같은 라만 스펙트럼의 수득 및 사용은 더 높은 주파수 스펙트럼 영역을 포함할 수 있다. 반대로, 수득된 스펙트럼 영역은 -200 cm-1 내지 4,000 cm-1 영역의 모두보다 작을 수 있다. 다수의 폴리올레핀 에 대하여, 화학적 지문에 유용한 라만 산란 강도 데이터의 대부분은 약 500 cm-1 내지 약 3,500 cm-1 또는 약 1,000 cm-1 내지 약 3,000 cm-1 범위의 영역에 존재하지만; 구조적 정보에 유용한 스펙트럼 영역의 데이터는 일반 적으로 약 -200 cm-1 내지 약 500 cm-1 범위의 영역에 존재한다. 수득된 영역은 또한 연속적일 필요가 없는 복수 의 하위 영역을 포함할 수 있다. 예컨대, 수득된 라만 스펙트럼 데이터는 종래 스펙트럼 대역으로서 식별된 영 역 및 종래 대역간으로서 식별된 영역 또는 비해상 영역을 포함하여 비교적 넓은 스펙트럼 영역에 걸쳐 복수의 주파수 또는 파장 이동, 산란 강도(x, y) 측정을 포함할 수 있다. 수득된 데이터의 주파수 간격은 기계 해상도 및 용량, 수득 시간, 데이터 분석 시간, 정보 밀도 및 당업자가 인 식하는 기타 요인을 고려하여 당업자가 용이하게 결정할 수 있다. 유사하게, 사용되는 신호 평균의 양은 기계 및 프로세스 효율성 및 한계에 기초하여 당업자가 용이하게 결정할 수 있다. 이제 도 2를 참조하면, 라만 데이터를 수집하고 처리하는 데 사용되는 기기는 일반적으로 라만 분광기, 레이저 소스, 저주파 필터, 중합체 생산 프로세스와 통신하는 라만 프로브 및 머신 러닝 알고리즘을 포함한다. 라만 분광기는 여기 방사선을 라만 프로브에 전달하는 여기 소스를 포함한다. 산란된 방사선은 라만 프로브 내 에 수집되고, 레일리 산란광이 필터링되고, 모노크로메이터를 통해 분산된다. 이후 분산된 라만 산란광은 검출 기 상에서 이미징된 다음 이하에서 더 설명되는 바와 같은 중합체 특성 컴퓨팅 장치에 의해 처리된다. 여기 소스 및 주파수는 당업계에 잘 알려진 고려 사항에 기초하여 용이하게 결정될 수 있다. 일반적으로 여기 소스는 주파수 배가 Nd:YAG 레이저(532 nm), 헬륨-네온 레이저(633 nm) 또는 고체 상태 다이오드 레이저(예컨대785 nm)와 같은 가시광선 또는 근적외선 레이저이다. 레이저는 펄스 또는 연속파(CW)일 수 있고, 원하는대로 편 광되거나 무작위로 편광되며, 바람직하게는 단일 모드이다. 원하는대로 더 낮거나 더 높은 전력을 사용할 수 있 지만 일반적인 여기 레이저는 100∼400 mW 전력(CW)을 가질 것이다. 레이저 이외의 광원이 사용될 수 있으며, 위에 나열된 것 이외의 파장 및 레이저 유형 및 매개변수도 사용될 수 있다. 라만 산란을 포함한 산란은 여기 주파수의 4승에 비례하며, 형광이 일반적으로 더 높은 주파수에서 상대적으로 약한 라만 신호를 압도한다는 실 질적인 제한을 받는다는 것은 잘 알려져 있다. 따라서, 더 높은 주파수(더 짧은 파장) 소스는 신호를 최대화하 는 데 바람직하고, 반면에 더 낮은 주파수(더 긴 파장) 소스는 형광을 최소화하는 데 바람직하다. 당업자는 이 들 고려 사항 및 모드 안정성, 유지 보수 시간 및 비용, 자본 비용, 및 당해 분야에서 잘 이해되는 기타 요인과 같은 기타 고려 사항에 기초하여 적절한 여기 소스를 쉽게 결정할 수 있다. 여기 방사선은 종래의 빔 조작 광학 장치 또는 광섬유 케이블과 같은 당업계에 공지된 임의의 편리한 수단에 의 해 라만 프로브 및 라만 프로브로부터 수집된 산란 방사선으로 전달될 수 있다. 온라인 공정 측정의 경우, 여기 방사선을 전달하고 산란된 방사선을 광섬유로 수집하는 것이 특히 편리하다. 일반적으로 사용되는 여기 방사선 이 광섬유로 쉽게 조작되므로, 여기 소스가 샘플링 영역으로부터 멀리 떨어져 배치될 수 있다는 것이 라만 분광 법의 특별한 이점이다. 특정 광섬유 프로브는 이하에 설명되지만, 당업자는 라만 시스템이 방사선 조작의 임의 의 특정 수단에 제한되지 않음을 인식할 것이다. 산란된 방사선은 후술하는 광섬유 프로브와 같은 당업계에 공지된 임의의 편리한 수단에 수집되고 분산된다. 수 집된 산란 방사선은 예컨대 저주파 필터를 통해 필터링되어 레일리 산란이 제거되고, 선택적으로 형광을 제거하 기 위해 필터링된 다음 블레이즈 격자 또는 홀로그래픽 격자와 같은 적절한 분산 요소를 사용하여 또는 (예컨대 푸리에 변환을 사용하여) 간섭적으로 주파수(파장)가 분산된다. 격자는 사용되는 검출기의 유형에 따라 고정되 거나 스캐닝될 수 있다. 모노크로메이터는 관련 필터 및 빔 조작 광학 장치와 함께 임의의 그러한 분산 요소일 수 있다. 분산된 라만 산란은 검출기 상에서 이미징된다. 검출기는 해상도, 적절한 주파수 범위에 대한 감도 및 응답 시 간과 같은 다양한 요인을 고려하여 당업자가 쉽게 선택할 수 있다. 일반적인 검출기는 일반적으로 다이오드 어 레이 또는 CCD(전하 결합 장치)와 같은 고정 분산 모노크로메이터와 함께 사용되는 어레이 검출기 또는 황화납 검출기 및 인듐-갈륨-비소 검출기와 같은 스캐닝-분산 모노크로메이터와 함께 일반적으로 사용되는 단일 원소 검출기를 포함한다. 어레이 검출기의 경우, 검출기는 각 검출기 요소에 해당하는 주파수(파장)가 알려지도록 보 정된다. 검출기 응답은 라만 스펙트럼을 구성하는 강도 (x, y) 데이터 포인트, 주파수 시프트 세트를 생성하는 데이터 서브시스템에 전달된다. 라만 프로브는 라만 분광기를 제조 공정에 연결한다. 위에서 언급한 바와 같이, 여기 방사선은 기존의 광학 또 는 광섬유 케이블을 사용하는 것과 같은 임의의 종래 수단에 의해 중합체 샘플로 전달되고 이로부터 수집될 수 있다. 라만 프로브는 기존의 라만 프로브, THz-라만 프로브, 또는 둘 다일 수 있다. 라만 프로브는 침지 광학 장치를 가지거나 가지지 않을 수 있다. 침지 광학 장치를 갖는 라만 프로브는 압출기의 용융 중합체 또는 용매 에 용해된 중합체와 같이 액체 샘플에 침지될 수 있다. 고체 샘플(예컨대 과립, 펠릿 또는 분말)의 샘플링을 위 해, 라만 프로브는 일반적으로 침지 광학 장치를 갖지 않는다. 라만 프로브는 일반적으로 중합체의 생산 공정에서 액세스 포인트에 배치된다. 예컨대, 액세스 포인트는 펠릿타 이저 직후 및/또는 퍼지 빈 직후와 같이 품질 관리를 위해 엔지니어가 중합체를 샘플링하는 위치에 가까울 수 있다. 라만 프로브는 파이프 내에 또는 액세스 포인트에 위치하는 작은 용기 내에 위치할 수 있다. 중합체 중합체는 단독중합체, 공중합체 또는 중합체 블렌드일 수 있다. 당업자가 이해하는 바와 같이, 용어 \"중합체\"는 동일하거나 상이한 종류의 단량체를 중합하여 제조된 중합체 화합물을 의미한다. 따라서, 일반 용어 \"중합체\"는 오직 한 유형의 단량체로부터 제조된 중합체를 의미하는 용어 \"단독중합체\"뿐만 아니라 둘 이상의 상이한 단량 체로부터 제조된 중합체를 의미하는 용어 \"공중합체\"도 포함한다. 본원에 사용될 때, 용어 \"블렌드\" 또는 \"중합 체 블렌드\"는 일반적으로 화학적으로 결합되지 않는 둘 이상의 중합체의 물리적 혼합물을 의미한다. 이러한 블 렌드는 혼화성일 수 있고 상 분리되거나 상 분리되지 않을 수 있다. 중합체 블렌드는 중합체의 형태에 의해 생 성되는 하나 이상의 도메인 구성을 포함할 수 있다. 도메인 구성은 X-선 회절, 투과 전자 현미경, 주사 투과 전 자 현미경, 주사 전자 현미경 및 원자력 현미경 또는 당업계에 공지된 다른 방법에 의해 결정될 수 있다. 중합체는 폴리올레핀일 수 있다. 예시적인 폴리올레핀은 폴리에틸렌, 폴리프로필렌, 폴리이소부틸렌, 및 이들의 단독중합체 및 공중합체를 포함하지만 이에 한정되지 않는다. 일부 실시양태에서, 폴리올레핀은 폴리프로필렌 단독중합체 또는 폴리프로필렌계 공중합체, 예컨대 충격 공중합체 또는 랜덤 중합체이다. 본원에서 사용될 때, 폴리프로필렌계 공중합체는 공중합체의 중량을 기준으로 50 중량% 이상의 프로필렌 단량체 단위를 함유하는 공중합체를 의미한다. 폴리프로필렌계 공중합체는 일반적으로 프로필렌과 하나 이상의 다른 선 형 α 올레핀, 분지형 α 올레핀 또는 고리형 올레핀을 중합하여 제조된다. α 올레핀 및 고리형 올레핀은 2 내 지 20 개의 탄소 원자, 2 내지 16 개의 탄소 원자, 또는 2 내지 12 개의 탄소 원자를 가질 수 있으며, 에틸렌, 1-부텐, 2-부텐, 1-펜텐, 3-메틸-1-부텐, 1-헥센, 4-메틸-1-펜텐, 3-메틸-1-펜텐, 4,6-디메틸-1-헵텐, 1-옥텐, 1-데센, 1-운데센, 1-도데센, 1-테트라데센, 1-헥사데센, 1-옥타데센, 1-에이코센, 노르보르넨, 테트라시클로도 데센 및 이들의 조합을 포함하나 이에 한정되지 않는다. 이들 올레핀은 각각 산소, 질소 및/또는 규소 원자와 같은 하나 이상의 헤테로원자를 함유할 수 있다. 폴리프로필렌계 공중합체는 선형 및/또는 분지형 중합체 사슬로 구성될 수 있다. 예시적인 폴리프로필렌계 공중 합체는 교대 공중합체, 주기적 공중합체, 블록 공중합체, 랜덤 공중합체 또는 충격 공중합체를 포함한다. 일부 실시양태에서, 폴리프로필렌계 공중합체는 랜덤 공중합체 또는 임의로 장쇄 분지를 함유하는 충격 공중합체이다. 본원에서 사용될 때, 용어 \"랜덤 공중합체\"는 상이한 유형의 단량체 단위가 중합체 분자에 통계 적으로 분포되어 있는 공중합체를 의미한다. 폴리프로필렌계 공중합체는 에틸렌 단량체 단위의 함량이 공중합체 의 총 중량을 기준으로 일반적으로 7 중량% 이하인 폴리프로필렌-폴리에틸렌 랜덤 공중합체일 수 있다. 본 명세서에서 사용될 때, 용어 \"충격 공중합체\"는 하나의 폴리올레핀이 연속 상(즉, 매트릭스)이고 엘라스토머 상이 그 안에 균일하게 분산된 헤테로상 폴리올레핀 공중합체를 의미한다. 충격 공중합체는 예컨대, 폴리프로필 렌 단독중합체가 연속 상이고 에틸렌 프로필렌 고무(EPR)와 같은 엘라스토머 상이 그 안에 균일하게 분포되어 있는 헤테로상 폴리프로필렌 공중합체를 포함한다. 충격 공중합체는 물리적 혼합이 아닌 반응기 내 공정으로부 터 얻어진다. 일부 실시양태에서, 폴리올레핀은 초저밀도 폴리에틸렌, 저밀도 폴리에틸렌, 선형 저밀도 폴리에틸렌, 중밀도 폴리에틸렌, 고밀도 폴리에틸렌 및 초고분자량 폴리에틸렌과 같은 폴리에틸렌 단독중합체 또는 에틸렌 비닐 아 세테이트 공중합체와 같은 폴리에틸렌계 공중합체이다. 중합체 특성 또는 특징 중합체 특성은, 분자량, 용융 유속, 층상 두께, 결정도, 자일렌 솔루블, 기계적 특성(예컨대, 인장 또는 압축 특성) 및 이들의 조합을 포함하는, 당업자가 라만 분광법을 통해 분석적으로 측정할 수 있는 중합체와 관련된 임의의 특성일 수 있다. 본원에서 사용될 때, 용어 \"분자량\"은 수 평균 분자량, 중량 평균 분자량 또는 Z-평균 분자량을 가리킬 수 있다. 기계적 특성은, 영률, 항복 인장 강도, 견인 항복 연신율 및 1% 시컨트에서의 굴곡 탄성률을 포함하는, 당업자 에게 알려진 중합체와 관련된 임의의 기계적 특성일 수 있다. 중합체 특징은 존재하는 경우 하나 이상의 첨가제(예컨대, 활석, 카올린, 유리 섬유)의 양 및 존재하는 경우 하 나 이상의 공단량체의 양일 수 있다. 당업자에게 알려진 다른 중합체 특징도 개시된 공정을 통해 결정될 수 있 다. 도 3에 도시된 바와 같이, 중합체 특성 컴퓨팅 장치는 프로세서 또는 중앙 처리 장치(CPU), 메모리, 임의의 구 성가능한 하드웨어 로직 및 버스 디바이스에 의해 함께 결합되는 통신 시스템을 포함하지만 중합체 특성 컴퓨팅 장치는 다른 구성으로 다른 유형 및 수의 요소를 포함할 수 있다. 이 예에서, 버스는 이 예에서 PCI Express 버 스이지만 다른 버스 유형 및 링크가 사용될 수 있다. 중합체 특성 컴퓨팅 장치 내의 프로세서는 본원에서 실시예를 참조하여 예시되고 설명되는 방법을 위해 메모리 에 저장된 하나 이상의 컴퓨터-실행가능 명령을 실행할 수 있지만, 프로세서는 다른 유형 및 수의 명령을 실행 하고 다른 유형 및 수의 작업을 수행할 수 있다. 프로세서는 AMD® 프로세서(들)와 같은 하나 이상의 프로세싱 코어를 갖는 하나 이상의 CPU 또는 범용 프로세서를 포함할 수 있지만, 다른 유형의 프로세서(들)(예컨대 Intel ®에서 생산되는 프로세서)를 사용할 수 있다. 중합체 특성 컴퓨팅 장치 내의 메모리는 RAM, ROM, 플래시 메모리, CD-ROM, 플로피 디스크, 하드 디스크 드라이 브(들), 솔리드 스테이트 메모리, DVD, 또는 당업자에게 공지된 임의의 다른 메모리 저장 유형 또는 장치(이의 조합 포함)와 같은 하나 이상의 유형의 저장 매체를 포함할 수 있다. 메모리는 프로세서에 의해 실행될 수 있는본원에서 실시예를 참조하여 예시되고 설명된 바와 같은 이 기술의 하나 이상의 비일시적 컴퓨터-판독가능 명령 을 저장할 수 있다. 도 4 및 5에 도시된 예시적인 흐름도는 프로세서에 의해 실행될 수 있는 및/또는 선택적인 구성가능한 로직의 구성된 논리에 의해 시행될 수 있는 메모리에 저장된 하나 이상의 비일시적 컴퓨터 또는 기 계 판독가능 명령으로서 구현되거나 표현될 수 있는 이 기술의 예시적인 단계 또는 동작을 나타낸다. 따라서, 중합체 특성 컴퓨팅 장치의 메모리는, 중합체 특성 컴퓨팅 장치에 의해 실행될 때, 중합체 특성 컴퓨팅 장치가 예컨대 전송, 수신 또는 그렇지 않으면 처리 메세지와 같은 동작을 수행하게 하고 도 4 및 5를 참조하여 설명되고 예시되는 다른 동작을 수행하게 하는 컴퓨터 실행가능 명령을 포함할 수 있는 하나 이상의 애플리케이 션을 저장할 수 있다. 애플리케이션(들)은 다른 애플리케이션의 모듈 또는 구성 요소로서 구현될 수 있고; 운영 체제 확장, 모듈, 플러그인 등으로 구현될 수 있으며; 다른 애플리케이션의 모듈 또는 구성 요소로 구현될 수 있고; 운영 체제 확장, 모듈, 플러그인 등으로 구현될 수 있으며; 클라우드 기반 컴퓨팅 환경에서 작동할 수 있 고; 클라우드 기반 컴퓨팅 환경에서 관리될 수 있는 가상 머신(들) 또는 가상 서버(들) 내에서 실행될 수 있다. 또한, 중합체 특성 컴퓨팅 장치 자체를 포함하는 애플리케이션(들)은 하나 이상의 특정 물리적 네트워크 컴퓨팅 장치에 연결되지 않고 클라우드 기반 컴퓨팅 환경에서 실행되는 가상 서버(들)에 위치할 수 있다. 또한, 애플리 케이션(들)은 중합체 특성 컴퓨팅 장치에서 실행되는 하나 이상의 가상 머신(VM)에서 실행될 수 있다. 다양한 실시양태 중 적어도 하나에서, 중합체 특성 컴퓨팅 장치에서 실행되는 가상 머신(들)은 하이퍼바이저에 의해 관 리되거나 감독될 수 있다. 중합체 특성 컴퓨팅 장치의 선택적인 구성가능한 하드웨어 논리 장치는 본원에서 실시예를 참조하여 예시되고 설명되는 바와 같이 이 기술의 하나 이상의 단계를 구현하도록 구성된 특수 하드웨어를 포함할 수 있다. 단지 예로서, 선택적인 구성가능 논리 하드웨어 장치는 필드 프로그래밍 가능한 게이트 어레이(\"FPGA\"), 필드 프로그 래밍 가능한 논리 장치(\"FPLD\"), 주문형 집적 회로(\"ASIC\") 및/또는 프로그래밍 가능한 논리 장치(\"PLU\") 중 하 나 이상을 포함할 수 있다. 중합체 특성 컴퓨팅 장치의 통신 시스템은, 중합체 특성 컴퓨팅 장치와, 하나 이상의 근거리 통신망(LAN) 및/또 는 광역 통신망(WAN)과 같은 통신망에 의해 모두 함께 연결된 분광기 사이에서 작동 가능하게 연결되고 통신하 는 데 사용되지만, 다른 유형 및 수의 통신망 또는 다른 디바이스 및 요소에 대해 다른 유형 및 수의 연결 및 구성을 가진 시스템이 사용될 수 있다. 오직 예로서, LAN 및 WAN과 같은 통신망은 TCP/IP 오버 이더넷 및 NFS, CIFS, SOAP, XML, LDAP 및 SNMP를 포함하는 산업 표준 프로토콜을 사용할 수 있지만 다른 유형 및 수의 통신망 이 사용될 수 있다. 이 실시예에서 중합체 특성 컴퓨팅 장치는 단일 장치를 포함하는 것으로 예시되어 있지만, 다른 예에서 중합체 특성 컴퓨팅 장치는 각각 하나 이상의 프로세서를 갖는 복수의 장치 또는 블레이드를 포함할 수 있으며, 각 프 로세서는 이 기술의 하나 이상의 단계를 구현하는 하나 이상의 프로세싱 코어를 갖는다. 이들 실시예에서, 하나 이상의 장치는 전용 통신 인터페이스 또는 메모리를 가질 수 있다. 하나 이상의 장치는 메모리, 통신 인터페이 스, 또는 하나 이상의 다른 통신 가능하게 결합된 장치의 다른 하드웨어 또는 소프트웨어 구성 요소를 이용할 수 있다. 다른 실시예에서 중합체 특성 컴퓨팅 장치를 함께 포함하는 하나 이상의 장치는 독립형 장치이거나 또 는 하나 이상의 다른 장치 또는 애플리케이션과 통합될 수 있다. 추가로, 이들 실시예에서 중합체 특성 컴퓨팅 장치의 하나 이상의 장치는 예컨대 하나 이상의 공용, 사설 또는 클라우드 네트워크를 포함하는 동일하거나 상 이한 통신망에 있을 수 있다. 각각의 시스템은 하나 이상의 범용 컴퓨터 시스템, 마이크로프로세서, 디지털 신호 프로세서 및 마이크로 컨트 롤러를 사용하여 편리하게 구현될 수 있으며, 본원에서 설명되고 예시된 바와 같이, 교시에 따라 프로그래밍되 고, 당업자에 의해 이해될 것이다. 예컨대, 중합체 특성 컴퓨팅 장치는 동일한 물리적 머신에서 가상 인스턴스로 작동하도록 구성될 수 있다. 또한, 둘 이상의 컴퓨팅 시스템 또는 장치가 시스템 또는 장치 중 임의의 하나를 대체할 수 있다. 따라서, 장치 및 시스템의 견고성과 성능을 높이기 위해 중복 및 복제와 같은 분산 처리의 원리와 이점도 원하는대로 구현될 수 있다. 프로세스는 또한 임의의 적절한 형태(예컨대 음성 및 모뎀)의 텔레트래픽, 무선 트래픽 미디어, 무선 트래픽 네트워크, 셀룰러 트래픽 네트워크, G3 트래픽 네트워크, 공중 교환 전화망(PSTN), 패킷 데이터 교환망 (PDN), 인터넷, 인트라넷 및 이들의 조합을 포함하는 임의의 적절한 인터페이스 메커니즘 및 트래픽 기술을 사 용하여 임의의 적절한 네트워크에 걸쳐 확장되는 컴퓨터 시스템(들)에서 구현될 수 있다. 프로세스는 또한, 프로세서(또는 구성가능한 하드웨어)에 의해 실행될 때 프로세서가 본원에서 설명되고 예시된 바와 같이 프로세스를 구현하는 데 필요한 단계를 수행하게 하는, 본원에서 설명되고 예시된 바와 같은 기술의하나 이상의 측면을 위해 저장된 명령을 갖는 비일시적 컴퓨터 판독가능 매체로서 구현될 수 있다. 따라서, 본 발명의 다른 측면은, 적어도 하나의 프로세서에 의해 실행될 때 프로세서가 (i) 라만 분광기로부터 중합체 샘플의 라만 스펙트럼을 수득하는 단계로서, 여기서 라만 스펙트럼은 하나 이상의 중합체 특성 또는 특 징에 해당하는 화학적 및 구조적 지문의 복수의 피크 및 밸리를 포함하는 단계; (ii) 수득된 화학적 및 구조적 지문을 저장된 중합체 특성 및 특징 데이터와 비교함으로써 하나 이상의 중합체 특성 또는 특징을 컴퓨팅하는 단계로서, 여기서 컴퓨팅 단계는 하나 이상의 훈련된 머신 러닝 알고리즘을 실행함으로써 수행되는 단계; 및 (iii) 하나 이상의 컴퓨팅된 중합체 특성 또는 특징에 기초하여, 중합체 샘플의 품질이 소정의 품질 임계값을 충족하는지 여부를 결정하는 단계를 포함하는 단계를 수행하게 하는 머신 실행가능 코드를 포함하는, 중합체의 라만 스펙트럼에 기초하여 중합체의 품질을 결정하기 위한 명령이 저장된 비일시적 컴퓨터 판독가능 매체에 관 한 것이다. 본 발명의 다른 측면은, 프로세서 및 메모리를 포함하는 중합체 특성 컴퓨팅 장치에 관한 것으로, 여기서 메모 리는 (i) 라만 분광기로부터 중합체 샘플의 라만 스펙트럼을 수득하는 단계로서, 여기서 라만 스펙트럼은 하나 이상의 중합체 특성 또는 특징에 해당하는 화학적 및 구조적 지문의 복수의 피크 및 밸리를 포함하는 단계; (ii) 수득된 화학적 및 구조적 지문을 저장된 중합체 특성 및 특징 데이터와 비교함으로써 하나 이상의 중합체 특성 또는 특징을 컴퓨팅하는 단계로서, 여기서 컴퓨팅 단계는 하나 이상의 훈련된 머신 러닝 알고리즘을 실행 함으로써 수행되는 단계; 및 (iii) 하나 이상의 컴퓨팅된 중합체 특성 또는 특징에 기초하여, 중합체 샘플의 품 질이 소정의 품질 임계값을 충족하는지 여부를 결정하는 단계를 포함하는 상기 메모리에 저장된 프로그래밍된 명령을 실행하도록 구성된 상기 프로세서에 연결된다. 본 발명의 추가적인 측면, 장점 및 특징은 본 명세서에 기재되어 있고, 부분적으로는 이하를 검토하여 당업자에 게 명백해지거나 또는 본 발명의 실시에 의해 학습될 수 있다. 본 출원에 개시된 발명은 측면, 장점 및 특징의 임의의 특정 세트 또는 조합으로 제한되지 않는다. 언급된 측면, 장점 및 특징의 다양한 조합이 본 출원에 개시 된 발명을 구성하는 것으로 고려된다. 실시예 본 출원에 개시된 바와 같이 라만 분광법 및 머신 러닝을 사용하여 추정된 특성이 아래 표 1에 나타낸 방법을 통해 수집된 실험실 데이터의 과거 측정값과 상관관계가 있음을 입증하기 위해 폴리프로필렌에 대해 시험을 수 행하였다. 도 6 내지 도 9에 나타낸 플롯은 라만 데이터를 기반으로 한 머신 러닝 알고리즘에 의해 결정된 주어 진 특성의 예측값 대 실험실에서 측정된 특성의 실제값을 보여준다. 특히, 도 6은 실험실에서 측정된 실제 용융 흐름 대비 라만 스펙트럼을 기반으로 하는 머신 러닝 알고리즘에 의해 예측된 용융 흐름을 나타내는 플롯을 보 여주는 것이고; 도 7은 실험실에서 측정된 실제 에틸렌 % 대비 라만 스펙트럼에 기반한 머신 러닝 알고리즘에 의해 예측된 에틸렌 %를 나타내는 플롯을 보여주는 것이며; 도 8은 실험실에서 측정된 실제 굴곡 탄성률 대비 라만 스펙트럼에 기반한 머신 러닝 알고리즘에 의해 예측된 굴곡 탄성률을 나타내는 플롯을 보여주는 것이고; 도 9는 실험실에서 측정된 실제 황색도 대비 라만 스펙트럼에 기반한 머신 러닝 알고리즘에 의해 예측된 황색도 를 나타내는 플롯을 보여준다. 각 플롯에서, 플롯의 중심선은 단지 눈을 안내하기 위한 것이며, 가운데 점선은 완벽한 예측을 나타내며, 흑색 선은 실험실 값에서 ±20% 편차의 간격을 나타낸다.표 1"}
{"patent_id": "10-2020-7031808", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 2, "content": "도 6 내지 도 9로부터 알 수 있는 바와 같이, 용융 흐름, 굴곡 탄성률, 황색도 및 에틸렌 함량을 포함하여 나타 낸 모든 특성에 대한 머신 러닝 예측은 선 안에 포함되어 예측된 특성이 실제 측정값보다 최대 20% 높거나 낮음 을 나타낸다. 도 6 내지 도 9에 도시된 결과에 기초하여, 당업자는 라만 데이터에 기초한 머신 러닝 알고리즘을 사용하는 개 시된 방법이 분자적(용융 흐름), 기계적(굴곡 탄성률), 조성적(에틸렌 %) 및 시각적(황색도) 특성을 포함하는 중합체의 몇 가지 주요 품질 제어 특성을 적어도 표시된 정확도로 추정할 수 있다고 결론을 내릴 수 있다. 어떤 특성만을 나타내었지만, 라만 데이터에 기반한 머신 러닝 알고리즘을 사용하는 개시된 방법은 다른 유사한 중합 체 특성을 예측할 수 있고 다른 폴리올레핀 또는 중합체 조성물에 유용할 것으로 예상된다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9"}
{"patent_id": "10-2020-7031808", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 테라헤르츠(THz) 주파수에 상응하는 저주파수 영역이 중합체에 대한 구조적 정보를 제공하고 고주파수 영역이 중합체의 화학적 지문을 제공함을 나타내는 라만 스펙트럼이다. 도 2는 배포 단계에서의 본 개시된 방법을 예시하는 블록도이다. 도 3은 중합체 특성 컴퓨팅 장치의 블록도이다. 도 4는 개시된 방법의 실행의 일 실시양태를 예시하는 흐름도이다. 도 5는 머신 러닝 알고리즘의 훈련의 일 실시양태를 예시하는 흐름도이다. 도 6은 라만 스펙트럼을 기반으로 하는 머신 러닝 알고리즘에 의해 예측되는 바와 같은 용융 흐름 대 실험실에 서 측정된 실제 용융 흐름을 나타내는 플롯을 도시한 것이다. 점선은 예측값과 실제값 사이의 완벽한 일치를 나 타낸다. 실선은 +/-20%의 편차를 나타낸다. 도 7은 라만 스펙트럼을 기반으로 하는 머신 러닝 알고리즘에 의해 예측되는 바와 같은 에틸렌 % 대 실험실에서 측정된 실제 에틸렌 %를 나타내는 플롯을 도시한 것이다. 점선은 예측값과 실제값 사이의 완벽한 일치를 나타낸 다. 실선은 +/-20%의 편차를 나타낸다. 도 8은 라만 스펙트럼을 기반으로 하는 머신 러닝 알고리즘에 의해 예측되는 바와 같은 굴곡 탄성률 대 실험실 에서 측정된 실제 굴곡 탄성률을 나타내는 플롯을 도시한 것이다. 점선은 예측값과 실제값 사이의 완벽한 일치 를 나타낸다. 실선은 +/-20%의 편차를 나타낸다. 도 9는 라만 스펙트럼을 기반으로 하는 머신 러닝 알고리즘에 의해 예측되는 바와 같은 황색도 대 실험실에서 측정된 황색도를 나타내는 플롯을 도시한 것이다. 점선은 예측값과 실제값 사이의 완벽한 일치를 나타낸다. 실 선은 +/-20%의 편차를 나타낸다."}
