{"patent_id": "10-2018-0154741", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0038835", "출원번호": "10-2018-0154741", "발명의 명칭": "이미지 센서 및 이미지 센싱 방법", "출원인": "삼성전자주식회사", "발명자": "강덕영"}}
{"patent_id": "10-2018-0154741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "이미지 센서에 있어서,서로 동일한 초점 거리를 가지는 복수의 렌즈 엘리먼트들을 포함하는 렌즈 어레이; 및상기 렌즈 어레이로부터 상기 초점 거리만큼 이격되고, 상기 렌즈 어레이를 통과한 빛을 센싱하는 복수의 센싱엘리먼트들을 포함하고,상기 복수의 렌즈 엘리먼트들 중 적어도 한 렌즈 엘리먼트의 렌즈 크기는 다른 렌즈 엘리먼트의 렌즈 크기와 다른,이미지 센서."}
{"patent_id": "10-2018-0154741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 복수의 렌즈 엘리먼트들은 렌즈 크기에 따라 복수의 렌즈 그룹들로 분류되고,서로 동일한 렌즈 그룹에 속하는 렌즈 엘리먼트들은 서로 동일한 렌즈 크기를 가지며,서로 다른 렌즈 그룹에 속하는 렌즈 엘리먼트들은 서로 다른 렌즈 크기를 가지는,이미지 센서."}
{"patent_id": "10-2018-0154741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 복수의 렌즈 그룹들의 각각에 속하는 렌즈 엘리먼트의 개수는, 상기 복수의 렌즈 엘리먼트들이 공유하는해상도에 기초하여 결정되는,이미지 센서."}
{"patent_id": "10-2018-0154741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,서로 동일한 렌즈 그룹에 속하는 렌즈 엘리먼트들은 서로에 대해 인접하도록 배치되는,이미지 센서."}
{"patent_id": "10-2018-0154741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2항에 있어서,상기 복수의 렌즈 그룹들 중 한 렌즈 그룹은,단일 렌즈 엘리먼트를 포함하는,이미지 센서."}
{"patent_id": "10-2018-0154741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 복수의 렌즈 엘리먼트들 중 한 렌즈 엘리먼트는 해당 렌즈 엘리먼트의 렌즈 크기보다 큰 렌즈 크기를 가지공개특허 10-2020-0038835-2-는 다른 렌즈 엘리먼트보다 상기 렌즈 어레이의 중심 위치에 가깝게 배치되고,상기 복수의 렌즈 엘리먼트들 중 한 렌즈 엘리먼트는 해당 렌즈 엘리먼트의 렌즈 크기보다 작은 렌즈 크기를 가지는 다른 렌즈 엘리먼트보다 상기 렌즈 어레이의 중심 위치로부터 멀게 배치되는이미지 센서."}
{"patent_id": "10-2018-0154741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 복수의 렌즈 엘리먼트들의 각각은,상기 렌즈 어레이에 대응하는 평면 상에서 상기 복수의 센싱 엘리먼트들에 대해 무작위로 배치되는,이미지 센서."}
{"patent_id": "10-2018-0154741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 복수의 렌즈 엘리먼트들의 각각은, 동일한 개수의 센싱 엘리먼트를 커버하는,이미지 센서."}
{"patent_id": "10-2018-0154741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 복수의 렌즈 엘리먼트들 중 적어도 하나의 렌즈 엘리먼트는,상기 복수의 센싱 엘리먼트들 중 적어도 하나의 센싱 엘리먼트에 대해 엇갈리도록(eccentric) 배치되는,이미지 센서."}
{"patent_id": "10-2018-0154741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 복수의 센싱 엘리먼트들에 의해 센싱된 센싱 정보에 기초하여, 상기 렌즈 어레이에 대응하는 시야각 중 중심 영역에 대해 그 주변 영역보다 높은 해상도로 이미지를 복원하는 프로세서를 더 포함하는 이미지 센서."}
{"patent_id": "10-2018-0154741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서,상기 복수의 센싱 엘리먼트들을 통해 센싱된 센싱 정보에 기초하여, 복안 시야 이미지(CEV image, compound eyevision image)를 획득하는 프로세서를 더 포함하는 이미지 센서."}
{"patent_id": "10-2018-0154741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 프로세서는,상기 복수의 센싱 엘리먼트들에서 센싱되는 라이트 필드 정보에 기초하여, 상기 복안 시야 이미지를재배열하는,이미지 센서."}
{"patent_id": "10-2018-0154741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "공개특허 10-2020-0038835-3-제11항에 있어서,상기 프로세서는,상기 복수의 센싱 엘리먼트들 및 상기 복수의 렌즈 엘리먼트들 간의 기하 구조에 기초하여, 상기 복안 시야 이미지로부터 장면 이미지를 복원하는, 이미지 센서."}
{"patent_id": "10-2018-0154741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서,상기 프로세서는,상기 복안 시야 이미지를 획득하기 전에 트레이닝이 완료된 이미지 복원 모델(image restoration model)에 기초하여, 상기 복안 시야 이미지로부터 장면 이미지를 복원하는,이미지 센서."}
{"patent_id": "10-2018-0154741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제1항에 있어서,상기 복수의 센싱 엘리먼트들을 통해 센싱된 센싱 정보로부터 사용자에 의해 지정된 줌 배율(zoom factor)에 대응하는 대상 정보(target information)를 선택하고, 상기 선택된 대상 정보로부터 장면 이미지를 복원하는 프로세서를 더 포함하는 이미지 센서."}
{"patent_id": "10-2018-0154741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 프로세서는,상기 센싱 정보로부터 상기 줌 배율에 대응하는 시야각에 대응하는 정보를 상기 대상 정보로서 선택하는,이미지 센서."}
{"patent_id": "10-2018-0154741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제1항에 있어서,상기 복수의 렌즈 엘리먼트들의 각각은,상기 빛을 굴절시켜서 상기 복수의 센싱 엘리먼트들을 포함하는 센싱 어레이 상의 지점에 초점(focal point)을형성하는,이미지 센서."}
{"patent_id": "10-2018-0154741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제1항에 있어서,각 렌즈 그룹에 의해 커버되는 센싱 영역에 속하는 센싱 엘리먼트들은,해당 렌즈 그룹의 시야각에 대응하는 광선들을 센싱하는,이미지 센서."}
{"patent_id": "10-2018-0154741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제1항에 있어서,상기 이미지 센서는,공개특허 10-2020-0038835-4-모바일 단말로 구현(implement)되는,이미지 센서."}
{"patent_id": "10-2018-0154741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "이미지 센싱 방법에 있어서,복수의 센싱 엘리먼트들이 서로 동일한 초점 거리를 가지는 복수의 렌즈 엘리먼트들을 통과한 빛을 센싱하는 단계; 및프로세서가 상기 복수의 센싱 엘리먼트들에 의해 센싱된 빛의 세기에 기초하여 장면 이미지를 복원하는 단계를 포함하고,상기 복수의 렌즈 엘리먼트들 중 적어도 한 렌즈 엘리먼트의 렌즈 크기는 다른 렌즈 엘리먼트의 렌즈 크기와 다른,이미지 센싱 방법."}
{"patent_id": "10-2018-0154741", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "이미지 센싱 방법 및 이미지 센서가 제공된다. 일 실시예에 따른 이미지 센서는, 동일한 초점 거리를 가지면서 다양한 렌즈 크기를 가지는 렌즈 엘리먼트들을 통해 수신된, 다양한 시야각에 대응하는 센싱 정보들을 이용하여 높은 배율에 대해 고해상도 이미지를 복원할 수 있다."}
{"patent_id": "10-2018-0154741", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "이하, 이미지를 센싱하는 기술이 제공된다."}
{"patent_id": "10-2018-0154741", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "광학 기술 및 영상 처리 기술의 발달로 인해, 멀티미디어 컨텐츠, 보안 및 인식 등 광범위한 분야에 촬영 장치 가 활용되고 있다. 예를 들어, 촬영 장치는 모바일 기기, 카메라, 차량 및 컴퓨터 등에 탑재되어, 영상을 촬영 하거나, 객체를 인식하거나, 기기를 제어하기 위한 데이터를 획득할 수 있다. 촬영 장치의 부피는 렌즈의 사이 즈, 렌즈의 초점 거리(focal length) 및 센서의 사이즈 등에 의해 결정될 수 있다. 예를 들어, 렌즈의 사이즈 와 센서의 사이즈에 기반하여 촬영 장치의 부피가 조절될 수 있다. 센서의 사이즈가 감소함에 따라, 센서에 입 사되는 광량이 감소할 수 있다. 이에 따라, 영상의 해상도가 낮아지거나, 저조도 환경에서의 촬영이 어려울 수 있다. 촬영 장치의 부피를 감소시키기 위해, 소형 렌즈들로 구성된 멀티 렌즈가 이용될 수 있다. 렌즈의 사이 즈가 감소할 경우, 렌즈의 초점 거리가 줄어들 수 있다. 따라서, 멀티 렌즈를 통해 촬영 장치의 부피가 감소할 수 있다."}
{"patent_id": "10-2018-0154741", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시예에 따른 이미지 센서는, 서로 동일한 초점 거리를 가지는 복수의 렌즈 엘리먼트들을 포함하는 렌즈 어 레이; 및 상기 렌즈 어레이로부터 상기 초점 거리만큼 이격되고, 상기 렌즈 어레이를 통과한 빛을 센싱하는 복 수의 센싱 엘리먼트들을 포함하고, 상기 복수의 렌즈 엘리먼트들 중 적어도 한 렌즈 엘리먼트의 렌즈 크기는 다 른 렌즈 엘리먼트의 렌즈 크기와 다를 수 있다. 상기 복수의 렌즈 엘리먼트들은 렌즈 크기에 따라 복수의 렌즈 그룹들로 분류되고, 서로 동일한 렌즈 그룹에 속 하는 렌즈 엘리먼트들은 서로 동일한 렌즈 크기를 가지며, 서로 다른 렌즈 그룹에 속하는 렌즈 엘리먼트들은 서 로 다른 렌즈 크기를 가질 수 있다. 상기 복수의 렌즈 그룹들의 각각에 속하는 렌즈 엘리먼트의 개수는, 상기 복수의 렌즈 엘리먼트들이 공유하는 해상도에 기초하여 결정될 수 있다. 서로 동일한 렌즈 그룹에 속하는 렌즈 엘리먼트들은 서로에 대해 인접하도록 배치될 수 있다. 상기 복수의 렌즈 그룹들 중 한 렌즈 그룹은, 단일 렌즈 엘리먼트를 포함할 수 있다. 상기 복수의 렌즈 엘리먼트들 중 한 렌즈 엘리먼트 는 해당 렌즈 엘리먼트의 렌즈 크기보다 큰 렌즈 크기를 가 지는 다른 렌즈 엘리먼트보다 상기 렌즈 어레이의 중심 위치에 가깝게 배치되고, 상기 복수의 렌즈 엘리먼트들 중 한 렌즈 엘리먼트 는 해당 렌즈 엘리먼트의 렌즈 크기보다 작은 렌즈 크기를 가지는 다른 렌즈 엘리먼트보다 상기 렌즈 어레이의 중심 위치로부터 멀게 배치될 수 있다. 상기 복수의 렌즈 엘리먼트들의 각각은, 상기 렌즈 어레이에 대응하는 평면 상에서 상기 복수의 센싱 엘리먼트 들에 대해 무작위로 배치될 수 있다. 상기 복수의 렌즈 엘리먼트들의 각각은, 동일한 개수의 센싱 엘리먼트를 커버할 수 있다. 상기 복수의 렌즈 엘리먼트들 중 적어도 하나의 렌즈 엘리먼트는, 상기 복수의 센싱 엘리먼트들 중 적어도 하나 의 센싱 엘리먼트에 대해 엇갈리도록(eccentric) 배치될 수 있다. 이미지 센서는 상기 복수의 센싱 엘리먼트들에 의해 센싱된 센싱 정보 에 기초하여, 상기 렌즈 어레이에 대응하 는 시야각 중 중심 영역에 대해 그 주변 영역보다 높은 해상도로 이미지를 복원하는 프로세서를 더 포함할 수 있다. 이미지 센서는 상기 복수의 센싱 엘리먼트들을 통해 센싱된 센싱 정보에 기초하여, 복안 시야 이미지(CEV image, compound eye vision image)를 획득하는 프로세서를 더 포함할 수 있다. 상기 프로세서는, 상기 복수의 센싱 엘리먼트들에서 센싱되는 라이트 필드 정보에 기초하여, 상기 복안 시야 이 미지를 재배열할 수 있다. 상기 프로세서는, 상기 복수의 센싱 엘리먼트들 및 상기 복수의 렌즈 엘리먼트들 간의 기하 구조에 기초하여, 상기 복안 시야 이미지로부터 장면 이미지를 복원할 수 있다. 상기 프로세서는, 상기 복안 시야 이미지를 획득하기 전에 트레이닝이 완료된 이미지 복원 모델(image restoration model)에 기초하여, 상기 복안 시야 이미지로부터 장면 이미지를 복원할 수 있다. 이미지 센서는 상기 복수의 센싱 엘리먼트들을 통해 센싱된 센싱 정보로부터 사용자에 의해 지정된 줌 배율 (zoom factor)에 대응하는 대상 정보(target information)를 선택하고, 상기 선택된 대상 정보로부터 장면 이미 지를 복원하는 프로세서를 더 포함할 수 있다. 상기 프로세서는, 상기 센싱 정보로부터 상기 줌 배율에 대응하는 시야각에 대응하는 정보를 상기 대상 정보로 서 선택할 수 있다. 상기 복수의 렌즈 엘리먼트들의 각각은, 상기 빛을 굴절시켜서 상기 복수의 센싱 엘리먼트들을 포함하는 센싱 어레이 상의 지점에 초점(focal point)을 형성할 수 있다. 각 렌즈 그룹에 의해 커버되는 센싱 영역에 속하는 센싱 엘리먼트들은, 해당 렌즈 그룹의 시야각에 대응하는 광 선들을 센싱할 수 있다. 상기 이미지 센서는, 모바일 단말로 구현(implement)될 수 있다. 일 실시예에 따른 이미지 센싱 방법은, 복수의 센싱 엘리먼트들이 서로 동일한 초점 거리를 가지는 복수의 렌즈 엘리먼트들을 통과한 빛을 센싱하는 단계; 및 프로세서가 상기 복수의 센싱 엘리먼트들에 의해 센싱된 빛의 세 기에 기초하여 장면 이미지를 복원하는 단계를 포함하고, 상기 복수의 렌즈 엘리먼트들 중 적어도 한 렌즈 엘리 먼트의 렌즈 크기는 다른 렌즈 엘리먼트의 렌즈 크기와 다를 수 있다."}
{"patent_id": "10-2018-0154741", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 실시예들을 첨부된 도면을 참조하여 상세하게 설명한다. 그러나, 특허출원의 범위가 이러한 실시예들에 의해 제한되거나 한정되는 것은 아니다. 각 도면에 제시된 동일한 참조 부호는 동일한 부재를 나타낸다. 아래 설명하는 실시예들에는 다양한 변경이 가해질 수 있다. 아래 설명하는 실시예들은 실시 형태에 대해 한정 하려는 것이 아니며, 이들에 대한 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 실시예에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 실시예를 한정하려는 의도가 아 니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수 개의 표현을 포함한다. 본 명세서에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 명세서 상에 기재된 특징, 숫자, 단계, 동작, 구성 요소, 부품 또는 이 들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성 요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 실시예가 속 하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일 반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥 상 가지는 의미와 일치하는 의 미를 가지는 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적 인 의미로 해석되지 않는다. 또한, 첨부 도면을 참조하여 설명함에 있어, 도면 부호에 관계없이 동일한 구성 요소는 동일한 참조 부호를 부 여하고 이에 대한 중복되는 설명은 생략하기로 한다. 실시예를 설명함에 있어서 관련된 공지 기술에 대한 구체 적인 설명이 실시예의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 도 1은 일 실시예에 따른 이미지 센서의 개괄적인 구조를 도시한 도면이다. 일 실시예에 따른 이미지 센서에 의하여 촬영 및 복원되는 이미지의 품질은 센싱 어레이에 포함된 센 싱 엘리먼트들의 수, 및 센싱 엘리먼트에 입사되는 광량에 의하여 결정될 수 있다. 예를 들어, 이미지의 해상 도는 센싱 어레이에 포함된 센싱 엘리먼트들의 수에 의하여 결정되고, 이미지의 감도는 센싱 엘리먼트에 입사되는 광량에 의하여 결정될 수 있다. 센싱 엘리먼트에 입사되는 광량은 센싱 엘리먼트의 사이즈에 기초하 여 결정될 수 있다. 센싱 엘리먼트의 사이즈가 클수록 센싱 엘리먼트에 입사되는 광량은 증가할 수 있고, 센싱 어레이의 동적 범위(dynamic range)가 증가할 수 있다. 따라서, 센싱 어레이에 포함된 센싱 엘리먼 트들의 수가 증가함에 따라 이미지 센서는 고해상도 이미지를 촬영할 수 있고, 센싱 엘리먼트의 사이즈가 증가함에 따라 이미지 센서는 저조도에서 고감도 이미지 촬영에 유리하게 작동할 수 있다. 이미지 센서의 부피는 렌즈 엘리먼트의 초점 거리(focal length)(f)에 의하여 결정될 수 있다. 보다 구체적으로, 이미지 센서의 부피는 렌즈 엘리먼트와 센싱 어레이 사이의 간격에 의하여 결정되 는데, 렌즈 엘리먼트에 의하여 굴절된 빛을 수집하기 위하여 센싱 어레이는 렌즈 엘리먼트(11 1)의 초점 거리(f)에 위치해야 하므로 이미지 센서에 포함된 렌즈 엘리먼트와 센싱 어레이는 렌 즈 엘리먼트의 초점 거리(f)만큼 이격되어 배치되어야 하기 때문이다. 렌즈 엘리먼트의 초점 거리 (f)는 이미지 센서의 시야각과 렌즈 엘리먼트의 사이즈(예를 들어, 렌즈 엘리먼트의 구경의 반 지름)에 의하여 결정된다. 예를 들어, 시야각이 고정될 경우 렌즈 엘리먼트의 사이즈에 비례하여 초점 거 리(f)가 길어진다. 또한, 렌즈 엘리먼트의 사이즈는 센싱 어레이의 사이즈에 기초하여 결정될 수 있 다. 예를 들어, 일정한 시야각 범위의 이미지를 촬영하기 위해서는, 센싱 어레이의 사이즈가 증가함에 따 라 렌즈 엘리먼트의 사이즈가 증가되어야 한다. 전술한 바에 의하면, 시야각 및 이미지의 해상도를 유지하면서 이미지의 감도를 증가시키려면, 이미지 센서 의 부피가 증가된다. 예를 들어, 이미지의 해상도를 유지하면서 이미지의 감도를 증가시키려면, 센싱 어 레이에 포함된 센싱 엘리먼트들의 수를 유지하면서 각 센싱 엘리먼트의 사이즈를 증가시켜야 하므로 센싱 어레이의 사이즈가 증가된다. 이 때, 시야각을 유지하려면, 센싱 어레이의 사이즈가 증가함에 따라 렌즈 엘리먼트의 사이즈가 증가하며 렌즈 엘리먼트의 초점 거리(f)가 길어지므로, 이미지 센서 의 부피가 증가된다. 이미지 센서의 부피를 감소시키기 위해, 센싱 어레이의 해상도를 유지하면서 센싱 엘리먼트의 사이즈 를 감소시키거나, 센싱 엘리먼트의 사이즈를 유지하면서 센싱 어레이의 해상도를 감소시키는 설계 방법들 이 고려될 수 있다. 다만, 센싱 어레이의 해상도를 유지하면서 센싱 엘리먼트의 사이즈를 감소시키는 경 우, 센싱 어레이의 사이즈가 감소하고 렌즈 엘리먼트의 초점 거리(f)가 짧아져 이미지 센서의 부피를 감소시킬 수 있으나, 이미지의 감도가 저하된다. 이 경우, 저조도 화질이 감소될 수 있다. 또한, 센싱 엘리먼트의 사이즈를 유지하면서 센싱 어레이의 해상도를 감소시키는 경우, 센싱 어레이의 사이즈가 감소하고 렌즈 엘리먼트의 초점 거리(f)가 짧아져 이미지 센서의 부피를 감소시킬 수 있으나, 이미지 의 해상도가 저하된다. 도 1을 참조하면, 이미지 센서는 렌즈 어레이 및 센싱 어레이를 포함한다. 렌즈 어레이는 렌즈 엘리먼트들을 포함하고, 센싱 어레이는 센싱 엘리먼트들을 포함한다. 일 실시예에 따르면, 렌즈 어레이에 포함된 렌즈 엘리먼트들 각각의 사이즈를 감소시킬수록, 다시 말해 렌 즈 어레이 상에서 동일한 넓이에 포함되는 렌즈들의 수를 증가시킬수록 렌즈 엘리먼트의 초점 거리 (f)는 작아질 수 있고, 이미지 센서의 두께는 감소할 수 있다. 이 경우, 이미지 센서는 각 렌즈 엘 리먼트에서 촬영된 저해상도 이미지들을 재배열(rearrange) 및 조합하여 고해상도 이미지를 복원할 수 있 다. 따라서, 렌즈 어레이에 포함된 렌즈들을 분할함으로써, 박형 카메라(thin camera)가 구현될 수 있다. 렌즈 어레이의 개별 렌즈 엘리먼트는 자신의 렌즈 크기(lens size)에 대응하는 센싱 어레이의 일정 센싱 영역을 커버할 수 있다. 센싱 어레이에서 렌즈 엘리먼트에 의해 커버되는 센싱 영역 은, 해당 렌즈 엘리먼트의 렌즈 크기에 따라 결정될 수 있다. 센싱 영역은, 일정한 시야각 범 위의 광선들이 해당 렌즈 엘리먼트를 통과한 후 도달하는 센싱 어레이의 상의 영역을 나타낼 수 있다. 센싱 영역의 크기는 센싱 영역의 중심으로부터 최외곽 지점까지의 거리 D로 표현될 수 있다. 다시 말해, 센싱 영역에 포함된 센싱 어레이 의 센싱 엘리먼트들에는 해당 개별 렌즈 엘리먼트 를 통과한 빛이 입사될 수 있다. 빛은 복수의 광선들을 포함할 수 있다. 광선은 광자 (photon)의 흐름에 대응할 수 있다. 일 실시예에 따르면 렌즈 크기는 렌즈의 직경에 대응할 수 있다. 센싱 어레이의 센싱 엘리먼트들 각각은 렌즈 어레이의 렌즈들을 통과한 광선에 기초하여 센싱 정보를 생성할 수 있다. 예를 들어, 센싱 엘리먼트는 렌즈 엘리먼트를 통해 입사되는 광선에 기초하여 센싱 정보를 생성할 수 있다. 이미지 센서는 센싱 어레이에 의해 출력된 센싱 정보에 기초 하여, 이미지 센서의 시야에 포함된 지점들에 관한 원본 신호(original signal)에 대응하는 세기 정보를 결정하고, 결정된 세기 정보에 기초하여 촬영 이미지를 복원할 수 있다. 또한, 센싱 엘리먼트는 임의의 색상을 센싱 하기 위한 색상 필터를 포함할 수도 있다. 센싱 엘리먼트 는 특정 색상에 대응하는 색상 값을 센싱 정보로서 생성할 수 있다. 센싱 어레이를 구성하는 복수의 센싱 엘리먼트들의 각각은 공간적으로 인접한 인접 센싱 엘리먼트와 다른 색상을 센싱하도록 배치될 수 있다. 다만, 센싱 엘리먼트의 색상 필터 및 배치를 이로 한정하는 것은 아니다. 센싱 정보의 다양성이 충분히 확보되어, 이미지 센서의 시야에 포함된 지점들에 대응하는 원본 신호 정보 와 센싱 정보 사이에 완전 랭크(full rank) 관계가 형성될 때, 센싱 어레이의 최대 해상도에 대응하는 촬 영 이미지가 도출될 수 있다. 센싱 정보의 다양성은 렌즈 어레이에 포함된 렌즈들의 수 및 센싱 어레이 에 포함된 센싱 엘리먼트들의 수와 같은 이미지 센서의 파라미터들에 기초하여 확보될 수 있다. 참고로, 도 1에 도시되지는 않았으나, 이미지 센서는 이미지를 복원하는데 사용되는 이미지 복원 모델을 저장하는 메모리, 및 이미지 복원 모델을 이용하여 이미지를 복원하는 프로세서를 포함할 수 있다. 일 실시예에 따른 이미지 센서는 이상적인 조건에서 벗어나는 다양한 노이즈 성분(noise component)에도 강인하게 이미지를 복원할 수 있다. 또한, 이미지 센서는 임의의 패턴(예를 들어, 베이어(Bayer) 패턴) 등과 무관하게 이미지를 복원할 수 있다. 아래에서 설명하는 실시예들은 이미지 센서가 다중 렌즈로 촬영된 다수의 저해상도 이미지를 이용하여 고해상도 이미지를 복원하는 동작을 설명한다. 후술하겠으나, 다수의 저해상도 이미지는 복안 시야 이미지의 형태로 나타날 수 있다. 도 2는 일 실시예에 따른 센싱 엘리먼트가 렌즈 엘리먼트를 통해 광선을 수신하는 모습을 도시한 도면이다. 상술한 바와 같이, 센싱 어레이는 개별 지점들(points)(X1 내지 X10)에 대응하는 광선들을 수신할 수 있다. 광선들은 렌즈 어레이를 통해 센싱 어레이에 의해 검출될 수 있다. 예를 들어, 개별 지점들 의 각각으로부터 복수의 광선들이 방출될 수 있다. 동일한 지점으로부터 방출된 광선들은 라이트 필드 (LF, light field)를 형성할 수 있다. 임의의 지점으로부터 방출된 라이트 필드는, 피사체(subject) 상의 임의 의 지점에서 반사된 광선들의 방향 및 세기를 나타내는 필드(field)일 수 있다. 예를 들어, 제1 지점(X1)으로 부터 방출된 광선들은 제1 라이트 필드를 형성할 수 있고, 제1 센싱 엘리먼트(S1), 제4 센싱 엘리먼트(S4), 및 제7 센싱 엘리먼트(S7)로 입사할 수 있다. 나머지 지점들(X2 내지 X10)의 각각으로부터 방출된 광선들도 각각 그에 대응하는 라이트 필드를 형성할 수 있다. 개별 지점들은 예를 들어, 임의의 객체(예를 들어, 피사체) 상의 지점들일 수 있다. 개별 지점들로부터 방출되는 광선들은, 예를 들어, 태양광 등이 객체로 부터 반사된 광선들일 수 있다. 설명의 편의를 위해, 도 2에서 렌즈 어레이는 3개의 렌즈 엘리먼트들을 포함하고, 센싱 어레이는 10개의 센싱 엘리먼트들(S1 내지 S10)을 포함하는 것으로 도시되었으나, 이로 한정하 는 것은 아니다. 센싱 엘리먼트들(S1 내지 S10)은 복수의 렌즈 엘리먼트들을 통과한 광선들을 중첩하여 센싱할 수 있다. 예를 들어, 도 2에 도시된 렌즈 어레이에서, 렌즈 엘리먼트로부터 센싱 어레이까지의 초점 거리가 감소될 수 있다. 따라서, 센싱 엘리먼트(S1)는 지점들(X1 내지 X3)로부터 방사된 광선들이 중첩된 센싱 정보(예를 들 어, 세기 값)를 생성할 수 있다. 이미지 센서는, 이미지를 복원하기 위하여, 이러한 중첩된 센싱 정보를 복원 할 필요가 있다. 도 2에 도시된 센싱 엘리먼트들(S1 내지 S10)에 의해 생성되는 센싱 정보는, 하기 수학식 1에 따라, 지점들 의 각각으로부터 입사되는 광선에 대응하는 원본 신호 정보(예를 들어, 세기 값)로 모델링될 수 있다. [수학식 1]"}
{"patent_id": "10-2018-0154741", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "상술한 수학식 1에서, S는 개별 센싱 엘리먼트에 의해 센싱되는 센싱 정보(예를 들어, 검출된 세기 값)를 지시 하는 행렬을 나타낼 수 있다. X는 개별 지점으로부터 센싱 엘리먼트들(S1 내지 S10)로 입사되는 광선에 대응하 는 신호 값(예를 들어, 입사된 광선의 색상 값)을 지시하는 행렬을 나타낼 수 있다. T는 변환 행렬로서 센싱 엘리먼트들(S1 내지 S10)에 의해 검출된 센싱 정보 및 입사되는 빛에 대응하는 신호 정보 간의 관계를 나타낼 수 있다. 도 2에 도시된 구조에서 개별 지점들(X1 내지 X10)에 대응하는 광선들, 렌즈들 및 센싱 엘리먼트들 (S1 내지 S10)은 하기 수학식 2와 같이 모델링될 수 있다. 하기 수학식 2에서 개별 지점들(X1 내지 X10)은 이 미지 센서로부터 무한 초점 위치(infinite focal point)에 배치된 것으로 모델링될 수 있다. 예를 들어, 개별 지점들(X1 내지 X10) 및 이미지 센서 간의 거리는 임계 거리보다 클 수 있다. [수학식 2]"}
{"patent_id": "10-2018-0154741", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "상술한 수학식 2에서 설명의 편의를 위하여, 개별 지점들(X1 내지 X10)의 각각에 대응하는 광선의 신호 정보(예 를 들어, 광선 세기 값)를 X1 내지 X10으로 표시하였다. 또한, 센싱 엘리먼트들(S1 내지 S10)에서 검출된 센싱 정보(예를 들어, 센싱 세기 값)도 S1 내지 S10으로 표시하였다. 일 실시예에 따르면, 센싱 어레이를 구성하는 센싱 엘리먼트들(S1 내지 S10)에 대응하는 센싱 정보(예를 들어, 색상 정보)와 개별 지점으로부터 입사되 는 광선들(X1 내지 X10)에 대응하는 원본 신호 간의 관계(예를 들어, 상술한 변환 행렬)는 상술한 렌즈 엘리먼 트와 센싱 엘리먼트 간의 배치, 렌즈 어레이를 구성하는 렌즈 엘리먼트들의 개수, 센싱 어레이를 구 성하는 센싱 엘리먼트들(S1 내지 S10)의 개수 등에 기초하여 결정될 수 있다. 참고로, 상술한 수학식 2는 개별 지점들(X1 내지 X10)이 이미지 센서로부터 무한 초점 위치인 경우를 설명한 것으로서, 개별 지점들(X1 내지 X10)이 이미지 센서로부터 유한 초점 위치(finite focal point)에 위치하는 경우, 각 센싱 엘리먼트에서 수신되는 원본 신호는 피사체 및 이미지 센서 간의 거리 및 이미지 센서의 기하 구조 등 에 따라 달라질 수 있다. 도 3은 일 실시예에 따른 센싱 엘리먼트의 수와 렌즈 엘리먼트의 수 간의 관계를 나타낸 도면이다. 일 실시예에 따르면 복수의 렌즈 엘리먼트들 중 적어도 하나의 렌즈 엘리먼트는, 복수의 센싱 엘리먼트들 중 적 어도 하나의 센싱 엘리먼트에 대해 엇갈리도록(eccentric) 배치될 수 있다. 예를 들어, 복수의 렌즈 엘리먼트 들 및 복수의 센싱 엘리먼트들은, 서로에 대해 엇갈려서 배치될 수 있다. 예를 들어, 렌즈 엘리먼트는 정수 개 수의 센싱 엘리먼트들을 커버하는 것이 아니라, 비정수(non-integer) 개수의 센싱 엘리먼트들을 커버할 수 있다. 일 실시예에 따른 멀티 렌즈 어레이 구조는 분수 정렬 구조(fractional alignment structure)로 구현될 수 있다. 멀티 렌즈 어레이 구조의 파라미터는, 센싱 엘리먼트들의 개수 및 렌즈 엘리먼트들의 개수이다. 렌 즈 엘리먼트들의 개수 L 및 센싱 엘리먼트들의 개수 P 간의 비율 P/L은 실수(real number)로 결정될 수 있다. 렌즈 엘리먼트들의 각각은 P/L에 대응하는 픽셀 오프셋과 동일한 개수의 센싱 엘리먼트들을 커버할 수 있다. 참고로, 도 3에서 각 렌즈 엘리먼트는 10/3개의 센싱 엘리먼트들을 커버하는 것으로 도시되었다. 상술한 바와 같이, 이미지 센서는, 각 렌즈 엘리먼트의 광학 중심 축(OCA, optical center axis)이 센싱 어레이 에 대해 서로 조금씩(slightly) 다른 배치를 가질 수 있다. 따라서, 렌즈 어레이의 각 렌즈 엘리먼트는 서로 다른 라이트 필드 정보를 수신한다. 각 렌즈 엘리먼트의 주 광선(chief ray)의 방향(direction)도 달라지게 되 므로, 이미지 센서는 광학적으로 보다 많은 센싱 정보를 획득할 수 있다. 따라서, 이미지 센서는 이와 같이 획 득된 다양한 센싱 정보를 통해 보다 고해상도의 이미지를 복원할 수 있다. 예를 들어, 렌즈 어레이에 포함된 렌즈 엘리먼트들이 동일한 렌즈 크기를 가지는 경우, 서로 소(relatively prime) 관계인 렌즈 어레이에 포함된 렌즈 엘리먼트들의 수와 센싱 어레이에 포함된 센싱 엘리먼트들의 수는 아 래의 수학식 3을 만족할 수 있다. [수학식 3]"}
{"patent_id": "10-2018-0154741", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "상술한 수학식 3에서 R은 센싱 어레이의 일축(one axis)에 대한 해상도를 나타내는 정수, P는 해당 센싱 어레이 의 일축에 대한 센싱 엘리먼트들의 개수를 나타내는 정수, L은 렌즈 어레이의 일축에 대한 렌즈 엘리먼트들의 개수를 나타내는 정수, N은 상술한 수학식 3을 충족시키기 위한 임의의 자연수를 나타낼 수 있다. 상술한 수학 식 3에서, R, P, 및 L은 각각 2차원 평면 상에서 임의의 한 축에 대한 개수를 나타낼 수 있다. 예를 들어, 해 상도 R은 이미지 센서에 의해 센싱될 수 있는 정보의 가로 축 또는 세로 축에 대한 해상도를 나타낼 수 있다. 가로 축 또는 세로 축에 대한 해상도 R은 해당 축에 따르는 센싱 엘리먼트들의 개수 P에 대응할 수 있다. L은 해당 축에 따르는 렌즈 엘리먼트들의 개수를 나타낼 수 있다. 따라서, 센싱 어레이의 전체 해상도는 RxR로 표 현될 수 있고, 센싱 어레이가 포함하는 센싱 엘리먼트들의 총 개수는 PxP일 수 있으며, 렌즈 어레이가 포함하는 렌즈 엘리먼트들의 총 개수는 LxL일 수 있다. 예를 들어, 도 3은 이미지 센서의 가로 축 또는 세로 축에 대한 단면도를 나타낼 수 있다. 임의의 한 축에 대 해, 렌즈 엘리먼트들의 개수 L은 3개이고, 센싱 엘리먼트의 개수 P는 10개로서, 서로 소 관계를 만족할 수 있다. 이때, 렌즈 엘리먼트 당 해당 축에 대해 10/3개의 센싱 엘리먼트를 커버할 수 있다. 도 3에서, 첫 번째 렌즈 엘리먼트는 0 내지 3+1/3 센싱 엘리먼트를 커버할 수 있다. 두 번째 렌즈 엘리먼트는 3+1/3 내지 6+2/3 센싱 엘리먼트를 커버할 수 있다. 마찬가지로, 마지막 렌즈 엘리먼트는 6+2/3 내지 10 센싱 엘리먼트를 커버할 수 있다. 즉, 각각의 렌즈 엘리먼트는 센싱 엘리먼트에서 1/L(렌즈의 수)만큼 불균형 (disparity)에 대응하는 부분(portion)을 더 커버할 수 있다. 일 실시예에 따르면 상술한 렌즈 어레이 및 센싱 어레이의 기하 구조에 따라, 각 렌즈 엘리먼트가 커버하는 센 싱 엘리먼트들은, 다른 렌즈 엘리먼트에 의해 커버되는 센싱 엘리먼트가 센싱하는 라이트 필드 정보와 동일하지않은 라이트 필드 정보를 센싱할 수 있다. 라이트 필드 정보는, 복수의 라이트 필드가 조합된 정보를 나타낼 수 있다. 예를 들어, 제1 센싱 엘리먼트(S1)은 도 2에 도시된 구조에서 제1 지점(X1)의 제1 라이트 필드, 제2 지점(X2)의 제2 라이트 필드, 및 제3 지점(X3)의 제3 라이트 필드의 조합으로 된 라이트 필드 정보를 센싱할 수 있다. 반면, 그에 인접한 제2 센싱 엘리먼트(S2)는 도 2에 도시된 구조에서 제4 라이트 필드, 제5 라이트 필드, 및 제6 라이트 필드의 조합으로 된 라이트 필드 정보를 센싱할 수 있다. 이와 같이, 각 센싱 엘리먼트는 다른 센싱 엘리먼트에서 센싱되는 라이트 필드 정보와 다른 라이트 필드 정보를 센싱할 수 있다. 예를 들어, 이미지 센서는, 라이트 필드 정보 간의 상관성에 기초하여, 촬영된 이미지의 픽셀들의 위치를 재배 열할 수 있다. 예를 들어, 이미지 센서는 복수의 센싱 엘리먼트들에서 서로 유사한 라이트 필드 정보를 센싱한 센싱 엘리먼트들의 픽셀들이 서로 인접하도록, 촬영된 이미지(예를 들어, 복안 시야 이미지)의 픽셀들을 재배열 할 수 있다. 예를 들어, 이미지 센서는 개별 센싱 엘리먼트에서 센싱된 신호의 세기 값을 지시하는 픽셀들을, 해당 센싱 엘 리먼트에서 센싱되는 라이트 필드 및 다른 센싱 엘리먼트에서 센싱되는 라이트 필드 정보 간의 유사도에 따라 재배열할 수 있다. 예를 들어, 두 센싱 엘리먼트들에서 센싱된 두 라이트 필드 정보가 서로 동일한 라이트 필 드를 많이 포함할수록, 두 라이트 필드 정보 간의 유사도가 높을 수 있다. 일 실시예에 따르면 이미지 센서는 광선을 반사하는 지점들이 이미지 센서로부터 무한 초점 위치에 배치된 것을 가정하고, 각 센싱 엘리먼트에서 센싱될 라이트 필드 정보를 결정할 수 있다. 예를 들어, 이미지 센서는, 이미 지 센서로부터 임계 거리(threshold distance)보다 먼 지점들(points)으로부터 방사되는 광선들 및 복수의 센싱 엘리먼트들 간의 위치 관계에 기초하여, 복수의 센싱 엘리먼트들의 각각에 대해 해당 센싱 엘리먼트에서 센싱되 는 라이트 필드를 방출하는 지점들을 결정할 수 있다. 임계 거리보다 먼 지점들은 무한 초점 위치에 있는 지점 이라고 지칭될 수도 있다. 이미지 센서는 공간적으로 서로 인접한 지점들에서 방출되는 라이트 필드에 대응하 는 픽셀들이 인접하도록 픽셀들을 재배열할 수 있다. 참고로, 도 2에서 개별 지점들(X1 내지 X10)은 무한 초점 거리에서 서로 인접한 순서대로 도시된 것일 수 있다. 예를 들어, 제1 지점(X1)은 제2 지점(X2)과 인접할 수 있고, 제2 지점(X2)은 제1 지점(X1) 및 제3 지점(X3)과 인접할 수 있다. 서로 인접한 두 지점들은, 예를 들어, 피사체에서 공간적으로 인접한 지점들일 수 있다. 재배열되기 이전의 센싱 엘리먼트들 중 제1 센싱 엘리먼트(S1)에서 센싱된 라이트 필드 정보 및 제8 센싱 엘리먼트(S8)에서 센싱된 라이트 필드 정보는 둘 다 제2 시점(X2) 및 제3 시점(X3)에 대응하는 라이트 필드를 포함할 수 있다. 따라서, 제1 센싱 엘리먼트(S1) 및 제8 센싱 엘리먼트(S8)는 서로 유사한 라이트 필드 정보를 센싱할 수 있다. 상술한 수학식 2를 서로 유사한 라이트 필드 정보에 대응하는 픽셀들이 인접하도록 재배열하 면, 아래 수학식 4과 같이 나타낼 수 있다. [수학식 4]"}
{"patent_id": "10-2018-0154741", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "상술한 수학식 4에 따라 재배열된 센싱 엘리먼트들은 도 3과 같이 도시될 수 있다. 제1 센싱 엘리먼트 (S1)는 제1 렌즈에 의해 커버되고, 제8 센싱 엘리먼트(S8)는 제3 렌즈에 의해 커버되며, 제5 센싱 엘리먼트(S 5)는 제2 렌즈에 의해 커버될 수 있다. 각 센싱 엘리먼트에서 센싱된 센싱 정보를 이미지를 구성하는 픽셀에 대응하므로, 서로 다른 렌즈를 통과한 광선들에 대응하는 센싱 정보들이 인접하도록, 이미지 센서는 픽셀들을 재배열할 수 있다. 일 실시예에 따르면 이미지 센서는 서로 소 조건 및 상술한 수학식 3을 만족하는 렌즈 어레이와 센싱 어레이에 의해 촬영된 이미지에 재배열 및 복원 등을 적용함으로써, 원본 장면에 보다 근접한 색상을 가진 고해상도 장면이미지(scene image)를 복원할 수 있다. 도 4는 일 실시예에 따른 렌즈 어레이에서 초점 거리 및 원하는 시야각에 따라 결정되는 렌즈 엘리먼트의 개수 및 크기를 도시한 도면이다. 일 실시예에 따른 이미지 센서는 상술한 바와 같이 렌즈 어레이 및 센싱 어레이를 포함할 수 있다. 렌즈 어레이는 복수의 렌즈 엘리먼트들을 포함할 수 있다. 복수의 렌즈 엘리먼트들 중 적어도 한 렌즈 엘 리먼트의 렌즈 크기는 다른 렌즈 엘리먼트의 렌즈 크기와 다를 수 있다. 예를 들어, 복수의 렌즈 엘리먼트들은 렌즈 크기에 따라 복수의 렌즈 그룹들로 분류될 수 있다. 렌즈 그룹은 렌즈 크기 별로 분류된 렌즈 엘리먼트들의 그룹을 나타낼 수 있다. 예를 들어, 서로 동일한 렌즈 그룹에 속하 는 렌즈 엘리먼트들은 서로 동일한 렌즈 크기를 가질 수 있고, 서로 다른 렌즈 그룹에 속하는 렌즈 엘리먼트들 은 서로 다른 렌즈 크기를 가질 수 있다. 이미지 센서는 다양한 시야각(FOV, field of view)을 가지는 렌즈 엘 리먼트들을 포함할 수 있다. 렌즈 엘리먼트의 시야각은 아래 수학식 5와 같이 나타낼 수 있다. [수학식 5]"}
{"patent_id": "10-2018-0154741", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "상술한 수학식 5에서, FOV는 시야각, D는 도 1에서 상술한 임의의 렌즈 엘리먼트에 의해 커버되는 센싱 영역의 크기, F는 초점 거리를 나타낼 수 있다. 일 실시예에 따른 이미지 센서는 모바일 단말로 구현될 수 있고, 모바일 단말의 폼 팩터를 충족하기 위해 초점 거리 F가 제한될 수 있다. 예를 들어, 초점 거리(F)는 모바일 단말의 두께보다 작을 수 있다. 이미지 센 서를 모바일 단말에 구현하기 위해, 렌즈 그룹들은 서로 동일한 초점 거리 F를 가지도록 설계될 수 있다. 반면, 각 렌즈 그룹의 시야각은 다른 렌즈 그룹의 시야각과 다르게 설계될 수 있다. 예를 들어, 이미지 센서는, 원거리 피사체의 정보를 획득하기 위해, 여러 시야각을 가지는 렌즈 그룹으로 구성 된 렌즈 어레이를 포함할 수 있다. 상술한 바와 같이 모든 렌즈 엘리먼트에 대해 초점 거리 F가 고 정되는 경우, 시야각 FOV가 달라지면 상술한 수학식 5에 따라 렌즈 엘리먼트에 의해 커버되는 센싱 영역의 크기 (예를 들어, 길이 D)가 달라질 수 있다. 달리 말해, 센싱 어레이 상의 임의의 영역을 커버하는 렌즈 그룹 의 줌 배율이 커지면 해당 렌즈 그룹에 속하는 렌즈 엘리먼트의 개수가 증가하도록 렌즈 어레이가 설계될 수 있고, 이러한 렌즈 어레이의 설계를 통해 해당 렌즈 그룹의 초점 길이는 일정하게 유지될 수 있다. 또 한, 해당 렌즈 그룹에 속하는 렌즈 엘리먼트들의 렌즈 크기는, 렌즈 그룹의 배율이 커질수록 감소할 수 있다. 해당 렌즈 그룹에 속하는 렌즈 엘리먼트들의 렌즈 크기는 해당 그룹에 속하는 렌즈 엘리먼트의 개수가 증가해도 감소할 수 있다. 따라서, 임의의 렌즈 그룹에 속하는 렌즈 엘리먼트들의 개수는, 해당 렌즈 그룹의 시야각 및 초점 길이에 따른 렌즈 크기에 기초하여 결정될 수 있다. 또한, 각 렌즈 그룹에서, 렌즈 어레이의 일축을 따라 나타나는 렌즈 엘리먼트의 개수는 아래 수학식 6을 충족할 수 있다. [수학식 6]"}
{"patent_id": "10-2018-0154741", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "상술한 수학식 6에서, Ri는 i번째 렌즈 그룹을 통해 센싱되는 이미지의 해상도, Li는 렌즈 어레이의 일축을 따라 나타나는 i번째 렌즈 그룹에 대응하는 렌즈 엘리먼트들의 개수, Ni는 임의의 자연수, M은 렌즈 어레이에 포함된 렌즈 그룹의 개수를 나타낼 수 있다. Ri, Li, Ni, 및 M은 1이상의 정수일 수 있다. i는 1이상 M이하의 정수일 수 있다. 따라서 i번째 렌즈 그룹에 속하는 제i 렌즈 엘리먼트들의 개수는 Li x Li일 수 있다. 도 4는 M=3인 렌즈 어레이의 단면도를 도시한 것으로서, 설명의 편의를 위해, 왼쪽부터 순서대로 제1 렌즈 그룹, 제2 렌즈 그룹, 제3 렌즈 그룹이라고 나타낼 수 있다. L1은 렌즈 어레이의 일축을 따라 제1 렌즈 그룹에 대응하는 따른 렌즈 엘리먼트들의 개수를 나타낼 수 있고, 도 4에 도시된 렌즈 어레이 에서 L1은 3일 수 있다. L2은 렌즈 어레이의 일축을 따라 제2 렌즈 그룹에 대응하는 렌즈 엘리먼트들의 개수로서, 도 4에 도시된 렌즈 어레이에서 L2은 9일 수 있다. L3는 렌즈 어레이의 일축을 따라 제3 렌 즈 그룹에 대응하는 렌즈 엘리먼트들의 개수로서, L3은 27일 수 있다. 도 3에서 상술한 바와 같이, 도 4 도 이미지 센서에 대해 임의의 한 축을 따른 단면도를 나타낸 것이므로, L1, L2, 및 L3는 해당 축을 따라 나타나 는 렌즈 엘리먼트들의 개수일 수 있다. 제1 렌즈 그룹에 속하는 제1 렌즈 엘리먼트들의 개수는 3x3=9개, 제2 렌즈 그룹에 속하는 제2 렌즈 엘리먼트들의 개수는 9x9=81개, 제3 렌즈 그룹에 속하는 제3 렌즈 엘리 먼트들의 개수는 27x27=729개일 수 있다. 제1 렌즈 그룹은 제1 시야각(예를 들어, 77도) 내의 광선들을 제1 센싱 엘리먼트로 전달할 수 있다. 제1 센싱 엘리먼트는 제1 렌즈 그룹에 속하는 제1 렌즈 엘리먼트에 의해 커버되는 센싱 엘리먼트를 나타낼 수 있고, 제1 렌즈 엘리먼트를 통과한 빛을 수신할 수 있다. 제1 센싱 엘리먼트는 제1 줌 배율(예를 들어, 1배)에 대응하는 정보를 센싱할 수 있다. 제2 렌즈 그룹은 제2 시야각(예를 들어, 30도) 내의 광선 들을 제2 센싱 엘리먼트로 전달할 수 있다. 제2 센싱 엘리먼트는 제2 렌즈 그룹에 속하는 제2 렌즈 엘리 먼트에 의해 커버되는 센싱 엘리먼트를 나타낼 수 있고, 제2 렌즈 엘리먼트를 통과한 빛을 수신할 수 있다. 제 2 센싱 엘리먼트는 제2 줌 배율(예를 들어, 3배)에 대응하는 정보를 센싱할 수 있다. 제3 렌즈 그룹은 제 3 시야각(예를 들어, 10도) 내의 광선들을 제3 센싱 엘리먼트로 전달할 수 있다. 제3 센싱 엘리먼트는 제 3 렌즈 그룹에 속하는 제3 렌즈 엘리먼트에 의해 커버되는 센싱 엘리먼트를 나타낼 수 있고, 제3 렌즈 엘 리먼트를 통과한 빛을 수신할 수 있다. 제3 센싱 엘리먼트는 제3 줌 배율(예를 들어, 9배)에 대응하는 정보를 센싱할 수 있다. 일 실시예에 따르면 이미지 센서는 단일 센서로 구현되거나, 동일 센싱 엘리먼트들로 구성된 복수의 센서로 구 현될 수 있다. 이 때, 이미지 센서에서 각 렌즈 그룹은 동일한 해상도를 지원하도록 설계될 수 있다. 예를 들 어, 각 렌즈 그룹에 의해 커버되는 센싱 영역은 다른 그룹과 동일한 개수의 센싱 엘리먼트 개수를 포함할 수 있 다. 이 경우, 렌즈 어레이의 일축에 따른 렌즈 엘리먼트들의 개수는 아래 수학식 7 내지 수학식 9를 충족 할 수 있다. [수학식 7]"}
{"patent_id": "10-2018-0154741", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "[수학식 8]"}
{"patent_id": "10-2018-0154741", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "[수학식 9]"}
{"patent_id": "10-2018-0154741", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "상술한 수학식 7에서, R은 모든 렌즈 그룹에 의해 공유되는 렌즈 어레이의 일축에 대응하는 해상도를 나타낼 수 있다. LM은 렌즈 어레이의 일축을 따라 M번째 렌즈 그룹에 대응하는 렌즈 엘리먼트들의 개수를 나타낼 수 있다. Li는 렌즈 어레이의 일축을 따라 i번째 렌즈 그룹에 대응하는 렌즈 엘리먼트들의 개수를 나타낼 수 있다. NM, Ni, 및 ai는 각각 임의의 자연수를 나타낼 수 있다. 복수의 렌즈 그룹들의 각각에 속하는 렌즈 엘리먼트의 개수 는, 복수의 렌즈 엘리먼트들이 공유하는 해상도에 기초하여 결정될 수 있다. 따라서, 상술한 수학식 9에 따라, 각 렌즈 그룹은 모든 렌즈 그룹이 공유하는 해상도를 가지면서도, 각 렌즈 엘리먼트에 의해 커버되는 센싱 엘리 먼트들의 개수와 서로소인 개수의 렌즈 엘리먼트들을 포함할 수 있다. 따라서, 일 실시예에 따른 이미지 센서는 서로 소와 수학식 9를 만족하는 렌즈 어레이와 센싱 어레이(42 0)에 의해 촬영된 이미지에 재배열 및 복원 등을 적용함으로써, 원본 장면에 보다 근접한 색상을 가진 고해상도 이미지를 복원할 수 있다. 예를 들어, 이미지 센서는, 센싱 엘리먼트들이 베이어(Bayer) 패턴으로 나열된 컬러 센서(예를 들어, 가시광선 대역에서, 적색, 녹색, 및 청색 채널의 이미지를 센싱하는 센서), 및 베이어 패턴으로 나열된 렌즈 엘리먼트들 을 사용한 카메라로부터 획득된 이미지를, 상술한 바와 같이 유사한 라이트 필드 순서에 따라 재배열할 수 있다. 이미지 센서는 균일한 컬러 패턴을 얻을 수 있으므로, 높은 퍼포먼스(higher performance)의 컬러 보간 (interpolation)을 제공할 수 있다.도 5는 렌즈 어레이에서 렌즈 엘리먼트들의 일 실시예에 따른 배치를 설명하는 도면이다. 일 실시예에 따르면 서로 동일한 렌즈 그룹에 속하는 렌즈 엘리먼트들은 서로에 대해 인접하도록 배치될 수 있 다. 도 5에서 제1 렌즈 크기를 가지는 제1 렌즈 그룹의 제1 렌즈 엘리먼트들은 서로 인접하여 배치될 수 있다. 나머지 렌즈 그룹들(512, 513, 514)의 각각에 속하는 렌즈 엘리먼트들도 서로 인접하여 배치될 수 있다. 도 5는 M=4인 경우로서, 렌즈 어레이가 4개의 렌즈 그룹들을 포함하는 구조를 탑뷰로 도시한다. 제1 렌즈 그룹은, L1=2로서, 2x2=4개의 렌즈 엘리먼트들을 포함할 수 있다. 제2 렌즈 그룹은, L2=4로서, 4x4=16개의 렌즈 엘리먼트들을 포함할 수 있다. 유사하게, 제3 렌즈 그룹은 64개의 렌즈 엘리먼트들을 포 함할 수 있고, 제4 렌즈 그룹은 256개의 렌즈 엘리먼트들을 포함할 수 있다. 도 5에서 설명의 편의를 위 하여, 이미지 센서는 단일 센서로 구현된 것으로 도시되었으나, 이로 한정하는 것은 아니고, 이미지 센서는 각 렌즈 그룹을 포함하는 4개의 이미지 센서로 구현될 수 있으며, 더 나아가, 서로 다른 종류의 이미지 센서(예를 들어, 개별 센싱 엘리먼트의 크기가 다른 센서)로 구현될 수도 있다. 참고로, 이미지 센서의 프로세서는 복수의 센싱 엘리먼트들을 통해 센싱된 센싱 정보에 기초하여, 복안 시야 이 미지(CEV image, compound eye vision image)를 획득할 수 있다. 본 명세서에서 복안 시야 이미지는, 곤충의 겹눈을 통해 관측된 것처럼, 동일하거나 유사한 장면을 중첩적으로 촬영한 이미지를 나타낼 수 있다. 예를 들 어, 이미지 센서는 어레이 형태로 배열된 복수의 렌즈들을 통해 복수의 센싱 엘리먼트들에서 수신된 광선의 세 기에 기초하여, 복안 시야 이미지를 획득할 수 있다. 예를 들어, 프로세서는, 제1 렌즈 그룹을 통해 수신된 빛을 센싱하여 획득된 2x2 개의 제1 그룹 이미지, 제2 렌즈 그룹을 통해 수신된 빛을 센싱하여 획득된 4x4 개의 제2 그룹 이미지, 제3 렌즈 그룹을 통 해 수신된 빛을 센싱하여 획득된 8x8 개의 제3 그룹 이미지, 및 제4 렌즈 그룹을 통해 수신된 빛을 센싱하 여 획득된 16x16 개의 제4 그룹 이미지를 포함하는 복안 시야 이미지를 생성할 수 있다. 프로세서는 도 3에서 상술한 바와 같이, 복수의 센싱 엘리먼트들에서 센싱되는 라이트 필드 정보에 기초하여, 복안 시야 이미지를 재 배열할 수 있다. 하기 도 6에서는, 도 5에 도시된 렌즈 어레이를 통해 장면에 대해 획득되는 센싱 정보를 설명한다. 도 6은 도 5에서 설명된 바와 같이 배치된 렌즈 엘리먼트들을 통해 센싱 엘리먼트들이 센싱하는 장면의 시야각 들을 설명하는 도면이다. 일 실시예에 따른 렌즈 어레이는 이미지 센서의 외부로부터 빛을 수신하여 센싱 어레이로 전달할 수 있다. 렌 즈 어레이의 각 렌즈 엘리먼트는 렌즈 크기에 따라 다른 시야각을 가질 수 있다. 예를 들어, 도 5에서 설명한 제1 렌즈 그룹에 속하는 제1 렌즈 엘리먼트는 제1 시야각, 제2 렌즈 그룹에 속하는 제2 렌즈 엘리먼트는 제2 시 야각, 제3 렌즈 그룹에 속하는 제3 렌즈 엘리먼트는 제3 시야각, 제4 렌즈 그룹에 속하는 제4 렌즈 엘리먼트는 제4 시야각을 가질 수 있다. 각 렌즈 그룹에 의해 커버되는 센싱 영역에 속하는 센싱 엘리먼트들은, 해당 렌즈 그룹의 시야각에 대응하는 광 선들을 센싱할 수 있다. 도 6은, 각 렌즈 그룹의 시야각 별로, 해당 렌즈 그룹에 의해 커버되는 센싱 엘리먼트 가 센싱하는 센싱 정보를 도시한다. 제1 렌즈 엘리먼트에 의해 커버되는 제1 센싱 엘리먼트는 제1 시야각에 대응하는 광선들을 제1 렌즈 엘리먼트를 통해 수신하여 제1 센싱 정보를 센싱할 수 있다. 제1 센싱 정보는 제1 시야각에 대응하는 영역(61 0)에 관해 센싱된 정보일 수 있다. 제2 센싱 엘리먼트는 제2 시야각에 대응하는 광선들을 제2 렌즈 엘리먼트를 통해 수신하여, 제2 센싱 정보를 센싱할 수 있다. 제2 센싱 정보는 제2 시야각에 대응하는 영역 에 대해 센싱된 정보일 수 있다. 제3 센싱 엘리먼트는 제3 시야각에 대응하는 광선들을 제3 렌즈 엘리먼 트를 통해 수신하여, 제3 센싱 정보를 센싱할 수 있다. 제3 센싱 정보는 제3 시야각에 대응하는 영 역에 대해 센싱된 정보일 수 있다. 또한, 제4 센싱 엘리먼트는 제4 시야각에 대응하는 광선들을 제4 렌즈 엘리먼트를 통해 수신하여 제4 센싱 정보를 센싱할 수 있다. 제4 센싱 정보는 제4 시야각에 대응하 는 영역에 대해 센싱된 정보일 수 있다. 도 6에 도시된 바와 같이, 전체 시야각(예를 들어, 제1 시야각)에 대응하는 영역 중 가장자리 영역에서는 제1 센싱 엘리먼트에 의해서만 센싱 정보가 수집되므로, 중심 영역(예를 들어, 제4 시야각에 대응하는 영역 )에 비해 수집되는 센싱 정보의 밀도가 낮다. 중심 영역에서는 제1 센싱 엘리먼트 내지 제4 센싱 엘리먼 트에 의해 센싱된 모든 센싱 정보가 수집되므로, 센싱 정보의 밀도가 높다. 따라서, 이미지 센서의프로세서는, 복수의 센싱 엘리먼트들에 의해 센싱된 센싱 정보에 기초하여, 렌즈 어레이에 대응하는 시야각 중 중심 영역에 대해 그 주변 영역보다 높은 해상도로 이미지를 복원할 수 있다. 더 나아가, 이미지 센서는 사용자로부터 줌 배율이 입력되는 경우에 응답하여, 입력된 줌 배율에 기초하여 확대 된 장면 이미지를 생성할 수 있다. 예를 들어, 이미지 센서는 복수의 센싱 엘리먼트들을 통해 센싱된 센싱 정 보로부터 사용자에 의해 지정된 줌 배율(zoom factor)에 대응하는 대상 정보(target information)를 선택할 수 있다. 이미지 센서는 센싱 정보로부터 줌 배율에 대응하는 시야각에 대응하는 정보를 대상 정보로서 선택할 수 있다. 이미지 센서는 선택된 대상 정보로부터 장면 이미지를 복원할 수 있다. 예를 들어, 도 6에서 제2 렌즈 그룹에 지정된 제2 시야각에 대응하는 줌 배율이 입력된 경우, 이미지 센서는 제2 시야각에 대응하는 영역 내에서 센싱된 센싱 정보를 이용하여, 장면 이미지를 복원할 수 있다. 장면 이미지의 복원 동작은 이미지 센서 의 기하 구조에 따른 픽셀 재배치 동작 또는 이미지 복원 모델을 이용하여 복안 시야 이미지로부터 출력 이미지 를 추정하는 동작 등을 포함할 수 있다. 따라서, 확대 이미지(예를 들어, 줌 배율이 증가하면서 시야각이 좁아진 이미지)를 복원할 때 해당 확대 이미지 에 대해 각 렌즈 엘리먼트에 의해 제공되는 시야각 영역이 중첩될 수 있다. 이러한 시야각 영역의 중첩으로 인 해, 이미지 센서는 여러 구조(예를 들어, 다양한 렌즈 크기)의 렌즈의 정보를 동시에 이용하여 보다 고해상도의 확대된 장면 이미지를 복원할 수 있다. 참고로, 도 6은 무한 초점 위치의 지점들로부터 반사 또는 방출된 광선들을 수신한 것을 가정한 것으로서, 유한 초점 위치로부터 광선이 수신될 경우 이미지 센서의 각 렌즈 그룹의 시야각 범위 영역이 달라질 수 있다. 도 7 내지 도 10은 렌즈 엘리먼트들의 다른 일 실시예에 따른 배치를 설명하는 도면이다. 도 7에 도시된 렌즈 어레이에서, 복수의 렌즈 그룹들 중 한 렌즈 그룹이 단일 렌즈 엘리먼트를 포함할 수 있다. 예를 들어, 제1 렌즈 그룹은 단일 렌즈 엘리먼트를 포함할 수 있다. 나머지 렌즈 그룹들(712, 713, 714)의 각각은 상술한 바와 같이 복수의 렌즈 엘리먼트들을 포함할 수 있다. 따라서, 이미지 센서는, 도 7에 도시된 구조의 렌즈 어레이를 통해 센싱된 센싱 정보에 기초하여, 광각 이미지의 화질 및 줌 배율에 대응하는 이미지의 화질이 모두 향상되도록, 장면 이미지를 복원할 수 있다. 도 8에 도시된 렌즈 어레이에서, 렌즈 엘리먼트들은 렌즈 크기에 따라 배열될 수 있다. 예를 들어, 복수 의 렌즈 엘리먼트들 중 한 렌즈 엘리먼트는 해당 렌즈 엘리먼트의 렌즈 크기보다 큰 렌즈 크기를 가지는 다른 렌즈 엘리먼트보다 렌즈 어레이의 중심 위치에 가깝게 배치될 수 있다. 또한, 복수의 렌즈 엘리먼트들 중 한 렌즈 엘리먼트는 해당 렌즈 엘리먼트의 렌즈 크기보다 작은 렌즈 크기를 가지는 다른 렌즈 엘리먼트보다 렌 즈 어레이의 중심 위치로부터 멀게 배치될 수 있다. 예를 들어, 4개의 렌즈 그룹들 중에서 가장 큰 제1 렌즈 크기를 가지는 제1 렌즈 그룹에 속하는 제1 렌즈 엘리 먼트들은 렌즈 어레이에서 가장 자리에 배치될 수 있다. 제1 렌즈 크기보다 작은 제2 렌즈 크기를 가지는 제2 렌즈 엘리먼트들은 제1 렌즈 엘리먼트들보다 중심 위치에 가깝게 배치될 수 있다. 제2 렌즈 크기보다 작은 제3 렌즈 크기를 가지는 제3 렌즈 엘리먼트들은 제2 렌즈 엘리먼트들보다 중심 위치에 가깝게 배치될 수 있다. 제3 렌즈 크기보다 작은 제4 렌즈 크기를 가지는 제4 렌즈 엘리먼트들은 중심 위치에 가장 가깝게 배치될 수 있다. 도 9에 도시된 렌즈 어레이는 도 8에 도시된 렌즈 어레이와 동일 또는 유사하게 배치된 렌즈 엘리먼트들을 포함할 수 있다. 도 9에서 일 실시예에 따른 복수의 렌즈 엘리먼트들의 각각은, 동일한 개수의 센싱 엘리먼트 를 커버할 수 있다. 예를 들어, 제1 렌즈 엘리먼트들의 각각은 4x4=16개의 센싱 엘리먼트들을 커버할 수 있다. 제2 렌즈 엘리먼트들, 제3 렌즈 엘리먼트들, 및 제4 렌즈 엘리먼트들도 동일하게 16개의 센싱 엘리먼트들을 커버할 수 있다. 이 경우, 센싱 어레이에서 센싱 엘리먼트의 크기(size)는 렌즈 엘리 먼트에 의해 커버되는 센싱 엘리먼트의 개수가 동일하도록 설계될 수 있다. 예를 들어, 제1 렌즈 엘리먼트들 에 의해 커버되는 제1 센싱 엘리먼트의 제1 센싱 크기(예를 들어, 픽셀 크기)보다, 제2 렌즈 엘리먼트들 에 의해 커버되는 제2 센싱 엘리먼트의 제2 센싱 크기가 작을 수 있다. 제3 센싱 엘리먼트의 제3 센싱 크 기는 제2 센싱 크기보다 작을 수 있고, 제4 센싱 엘리먼트의 제4 센싱 크기는 제3 센싱 크기보다 작을 수 있다. 본 명세서에서, 센싱 엘리먼트의 센싱 크기는, 예를 들어, 센싱 엘리먼트의 픽셀 피치(pixel pitch)를 나타낼 수 있다. 작은 시야각을 제공하는 렌즈 엘리먼트도 다른 렌즈 엘리먼트와 동일한 개수의 센싱 엘리먼트를 커버 하므로, 멀티 렌즈로 인한 해상도 저하의 정도가 감소하고, 복원되는 장면 이미지의 화질이 향상될 수 있다. 참고로, 설명의 편의를 위해, 도 9에서 각 렌즈 엘리먼트에 의해 커버되는 센싱 엘리먼트들의 개수가 정수로 도 시되었으나, 이로 한정하는 것은 아니고 도 3에서 상술한 바와 같이 각 렌즈 엘리먼트는 분수 개(fractional number)의 센싱 엘리먼트들을 커버할 수 있다. 도 10에 도시된 렌즈 어레이에서, 복수의 렌즈 엘리먼트들의 각각은, 렌즈 어레이에 대응하 는 평면 상에서 복수의 센싱 엘리먼트들에 대해 무작위로 배치될 수 있다. 복수의 렌즈 엘리먼트들은 렌 즈 크기 별로 상술한 수학식 9를 충족하는 개수로 구성될 수 있고, 렌즈 어레이의 평면 상에 무작위로 배 치될 수 있다. 무작위로 배치된 렌즈 배치들 중 일부 배치를 통해, 이미지 센서는 광각 뿐만 아니라 개별 렌즈 크기에 의해 지원되는 줌 배율들의 각각에 대해 균등하게 고해상도를 가지는 장면 이미지를 복원할 수 있다. 도 11은 일 실시예에 따른 이미지 센서의 구조를 도시한 블록도이다. 일 실시예에 따르면 이미지 센서는 렌즈 어레이, 센싱 어레이, 및 프로세서를 포함할 수 있다. 렌즈 어레이는 복수의 렌즈 엘리먼트들을 포함할 수 있다. 복수의 렌즈 엘리먼트들은 렌즈 평면 상에 배 치될 수 있다. 복수의 렌즈 엘리먼트들은 모두 동일하거나 유사한 초점 거리를 가질 수 있다. 본 명세서에서 서로 동일한 초점 거리를 가지도록 설계된 복수의 렌즈 엘리먼트들에 있어서, 복수의 렌즈 엘리먼트들의 초점 거리들은 제조 공차로 인해 미세한 차이를 나타낼 수도 있다. 예를 들어, 복수의 렌즈 엘리먼트들 각각의 초점 거리들 간의 차이는 서로 임계 오차 미만일 수 있다. 상술한 바와 같이, 복수의 렌즈 엘리먼트들 중 적어도 한 렌즈 엘리먼트의 렌즈 크기는 다른 렌즈 엘리먼트의 렌즈 크기와 다를 수 있다. 복수의 렌즈 엘리먼트들의 각 각은 빛을 굴절시켜서 복수의 센싱 엘리먼트들을 포함하는 센싱 어레이 상의 지점에 초점(focal point)을 형성할 수 있다. 센싱 어레이는 복수의 센싱 엘리먼트들을 포함할 수 있다. 복수의 센싱 엘리먼트들은 렌즈 평면과 평행 한 센싱 평면 상에 배치될 수 있다. 복수의 센싱 엘리먼트들은 렌즈 어레이로부터 초점 거리만큼 이격된 센싱 평면 상에 배치될 수 있다. 복수의 센싱 엘리먼트들의 각각은 렌즈 어레이를 통과한 빛을 센싱할 수 있다. 예를 들어, 복수의 센싱 엘리먼트들의 각각은 해당 센싱 엘리먼트를 커버하는 렌즈 엘리먼트를 통과 한 빛을 수신할 수 있다. 프로세서는 복수의 센싱 엘리먼트들에 의해 센싱된 빛의 세기 에 기초하여 장면 이미지를 복원할 수 있다. 예를 들어, 프로세서는 복수의 센싱 엘리먼트들을 통해 센싱된 센싱 정보에 기초하여, 복안 시야 이미지를 획득할 수 있다. 프로세서는 복안 시야 이미지로부터 장면 이미지를 복원할 수 있다. 장면 이 미지는 이미지 센서에 의해 출력되는 이미지로서, 원본 장면과 동일 또는 유사하게 복원된 이미지를 나타 낼 수 있다. 일 실시예에 따르면 프로세서는 복수의 센싱 엘리먼트들 및 복수의 렌즈 엘리먼트들 간의 기하 구조에 기 초하여, 복안 시야 이미지로부터 장면 이미지를 복원할 수 있다. 예를 들어, 프로세서는 도 3에서 상술 한 바와 같이, 복수의 센싱 엘리먼트들에서 서로 유사한 라이트 필드 정보를 센싱한 센싱 엘리먼트들의 픽셀들 이 서로 인접하도록, 촬영된 이미지(예를 들어, 복안 시야 이미지)의 픽셀들을 재배열할 수 있다. 다른 일 실시예에 따르면 프로세서는 복안 시야 이미지를 획득하기 전에 트레이닝이 완료된 이미지 복원 모델(image restoration model)에 기초하여, 복안 시야 이미지로부터 장면 이미지를 복원할 수 있다. 이미지 복원 모델은, 임의의 복안 시야 이미지로부터 장면 이미지를 출력하도록 설계된 모델로서, 기계 학습 구조일 수 있다. 예를 들어, 이미지 복원 모델은 뉴럴 네트워크 구조를 포함할 수 있다. 이미지 복원 모델은, 임의의 기 준 복안 시야 이미지로부터, 참값(ground truth)으로 주어진 기준 출력 이미지를 산출하도록 트레이닝될 수 있 다. 다만, 이미지 복원 모델을 이로 한정하는 것은 아니다. 도 12 및 도 13은 일 실시예에 따른 이미지 센서가 구현되는 기기의 예시를 도시하는 도면이다. 일 실시예에 따른 이미지 센서는 다양한 기술 분야에 적용될 수 있다. 이미지 센서는, 복수의 렌즈들로 구성되 는 렌즈 어레이 및 복수의 센싱 엘리먼트들로 구성되는 센서가 비교적 짧은 초점 거리로 이격되도록 설계될 수 있다. 따라서, 이미지 센서는, 고화질 촬영을 위해 센서의 크기가 크면서도, 초박형 카메라(ultra thin camera)로 구현될 수 있다. 이와 같이 이미지 센서는 멀티 렌즈 어레이 구조를 통해 보다 감소된 두께로 구현 될 수 있다. 이미지 센서는 AP, FPGA, Chip 등으로 구현되어 카메라의 이미지 신호 프로세서(Image Signal Processor)로서 구현될 수 있다. 더 나아가, 초박형 구조이면서도, 동일한 초점 거리와 함께 다양한 렌즈 크기를 가지는 렌즈 어레이를 이용하여, 이미지 센서는 복수의 줌 배율에 대한 센싱 정보를 획득할 수 있다. 따라서, 이미지 센서는 복수의 줌 배율에 대해서도 고해상도의 장면 이미지를 복원할 수 있다. 이미지 센서는, 모바일 단말로 구현(implement)될 수도 있다. 모바일 단말은 임의의 지리적 위치에 고정되지 않고 이동 가능한(movable) 단말로서, 예를 들어, 휴대 기기(portable device)(예를 들어, 스마트폰이나 태블릿 등과 같은 스마트 기기), 인공지능 스피커, 및 차량(vehicle) 등을 포함할 수 있다. 도 12 및 도 13은 모바일 단말의 예시로서, 모바일 단말을 이로 한정하는 것은 아니다. 도 12에 도시된 바와 같이, 예를 들어, 이미지 센서는 스마트폰의 전면 카메라 또는 후면 카메라에 적용 될 수 있다. 이미지 센서에서, 대형 풀 프레임 센서(Full Frame Sensor) 및 마이크로 렌즈 어레이 (Micro-lens Array)가 결합된 구조로 휴대폰 카메라에 적용될 수 있다. 예를 들어, 도 12에 도시된 바와 같이, 스마트 기기에 전면 카메라로서, 이미지 센서가 구현될 수 있다. 이미지 센서의 센서는 풀 프레임(full frame)으로 구현될 수 있고, 렌즈 어레이는 마이크로 렌즈(micro lens)로 구현될 수 있다. 또한, 박형 구조 또는 커브드(Curved) 구조로 차량용으로 구현될 수도 있다. 도 13에 도시된 바와 같이, 차량 에 곡선을 가지는 전면 카메라 또는 후면 카메라로서 이미지 센서가 구현될 수 있다. 다만, 이로 한정하는 것은 아니고, 이미지 센서는 DSLR 카메라, 드론(Drone), CCTV, 웹캠(Webcam)용 카메라, 360도 촬영 카메라, 영화 및 방송을 위한 카메라, 및 VR/AR 카메라 등에 사용될 수 있다. 더 나아가, 이미지 센서 는 유연하거나 연장될 수 있는 카메라(Flexible/Stretchable Camera), 곤충 눈 카메라, 컨택트 렌즈 타 입(Contact lens type) 카메라 등과 같은 다양한 분야에도 적용될 수 있다. 더 나아가, 이미지 센서는 연속된 프레임의 비디오 이미지(Video image)에서, 촬영된 다수의 프레임 정보를 이 용하여 해상도를 증가하는 멀티 프레임 고해상도 이미지 복원(Multi-frame Super Resolution image restoration)에도 적용될 수 있다. 이상에서 설명된 장치는 하드웨어 구성요소, 소프트웨어 구성요소, 및/또는 하드웨어 구성요소 및 소프트웨어 구성요소의 조합으로 구현될 수 있다. 예를 들어, 실시예들에서 설명된 장치 및 구성요소는, 예를 들어, 프로 세서, 콘트롤러, ALU(arithmetic logic unit), 디지털 신호 프로세서(digital signal processor), 마이크로컴 퓨터, FPA(field programmable array), PLU(programmable logic unit), 마이크로프로세서, 또는 명령 (instruction)을 실행하고 응답할 수 있는 다른 어떠한 장치와 같이, 하나 이상의 범용 컴퓨터 또는 특수 목적 컴퓨터를 이용하여 구현될 수 있다. 처리 장치는 운영 체제(OS) 및 운영 체제 상에서 수행되는 하나 이상의 소 프트웨어 애플리케이션을 수행할 수 있다. 또한, 처리 장치는 소프트웨어의 실행에 응답하여, 데이터를 접근, 저장, 조작, 처리 및 생성할 수도 있다. 이해의 편의를 위하여, 처리 장치는 하나가 사용되는 것으로 설명된"}
{"patent_id": "10-2018-0154741", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 11, "content": "경우도 있지만, 해당 기술분야에서 통상의 지식을 가진 자는, 처리 장치가 복수 개의 처리 요소(processing element) 및/또는 복수 유형의 처리 요소를 포함할 수 있음을 알 수 있다. 예를 들어, 처리 장치는 복수 개의 프로세서 또는 하나의 프로세서 및 하나의 콘트롤러를 포함할 수 있다. 또한, 병렬 프로세서(parallel processor)와 같은, 다른 처리 구성(processing configuration)도 가능하다. 소프트웨어는 컴퓨터 프로그램(computer program), 코드(code), 명령(instruction), 또는 이들 중 하나 이상의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결합적으로 (collectively) 처리 장치를 명령할 수 있다. 소프트웨어 및/또는 데이터는, 처리 장치에 의하여 해석되거나 처리 장치에 명령 또는 데이터를 제공하기 위하여, 어떤 유형의 기계, 구성요소(component), 물리적 장치, 가상 장치(virtual equipment), 컴퓨터 저장 매체 또는 장치, 또는 전송되는 신호 파(signal wave)에 영구적으로, 또는 일시적으로 구체화(embody)될 수 있다. 소프트웨어는 네트워크로 연결된 컴퓨터 시스템 상에 분산되어서, 분산된 방법으로 저장되거나 실행될 수도 있다. 소프트웨어 및 데이터는 하나 이상의 컴퓨터 판독 가능 기록 매체에 저장될 수 있다. 실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단 독으로 또는 조합하여 포함할 수 있다. 매체에 기록되는 프로그램 명령은 실시예를 위하여 특별히 설계되고 구 성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 상기된 하드웨 어 장치는 실시예의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지이다."}
{"patent_id": "10-2018-0154741", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 12, "content": "이상과 같이 실시예들이 비록 한정된 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가진 자라면 상기를 기초로 다양한 기술적 수정 및 변형을 적용할 수 있다. 예를 들어, 설명된 기술들이 설명된 방법과 다 른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태 로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다. 그러므로, 다른 구현들, 다른 실시예들 및 특허청구범위와 균등한 것들도 후술하는 특허청구범위의 범위에 속한 다."}
{"patent_id": "10-2018-0154741", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 따른 이미지 센서의 개괄적인 구조를 도시한 도면이다. 도 2는 일 실시예에 따른 센싱 엘리먼트가 렌즈 엘리먼트를 통해 광선을 수신하는 모습을 도시한 도면이다. 도 3은 일 실시예에 따른 센싱 엘리먼트의 수와 렌즈 엘리먼트의 수 간의 관계를 나타낸 도면이다. 도 4는 일 실시예에 따른 렌즈 어레이에서 초점 거리 및 원하는 시야각에 따라 결정되는 렌즈 엘리먼트의 개수 및 크기를 도시한 도면이다.도 5는 렌즈 어레이에서 렌즈 엘리먼트들의 일 실시예에 따른 배치를 설명하는 도면이다. 도 6은 도 5에서 설명된 바와 같이 배치된 렌즈 엘리먼트들을 통해 센싱 엘리먼트들이 센싱하는 장면의 시야각 들을 설명하는 도면이다. 도 7 내지 도 10은 렌즈 엘리먼트들의 다른 일 실시예에 따른 배치를 설명하는 도면이다. 도 11은 일 실시예에 따른 이미지 센서의 구조를 도시한 블록도이다. 도 12 및 도 13은 일 실시예에 따른 이미지 센서가 구현되는 기기의 예시를 도시하는 도면이다."}
