{"patent_id": "10-2021-7021787", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0042296", "출원번호": "10-2021-7021787", "발명의 명칭": "Mg2Si 단결정체, Mg2Si 단결정 기판, 적외선 수광 소자 및 Mg2Si 단결정체의 제조 방법", "출원인": "고쿠리츠 다이가쿠 호우징 이바라키 다이가쿠", "발명자": "우도노 하루히코"}}
{"patent_id": "10-2021-7021787", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "XRD로 측정된 결정 방위의 변동이, ±0.020°의 범위 내인 Mg2Si 단결정체."}
{"patent_id": "10-2021-7021787", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,XRD로 측정된 결정 방위의 변동이, ±0.016°의 범위 내인 Mg2Si 단결정체."}
{"patent_id": "10-2021-7021787", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항 또는 제2항에 있어서,B, Li, Al, Ag, P, As 및 Sb에서 선택되는 적어도 1종을 도펀트로서 포함하는 Mg2Si 단결정체."}
{"patent_id": "10-2021-7021787", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항 내지 제3항 중 어느 한 항에 기재된 Mg2Si 단결정체로 구성된 Mg2Si 단결정 기판."}
{"patent_id": "10-2021-7021787", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,기판 사이즈가 25㎜ 내지 150㎜인 Mg2Si 단결정 기판."}
{"patent_id": "10-2021-7021787", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항 내지 제3항 중 어느 한 항에 기재된 Mg2Si 단결정체를 구비한 적외선 수광 소자."}
{"patent_id": "10-2021-7021787", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "하기 공정 (1) 내지 (5)를 포함하는 제1항 내지 제3항 중 어느 한 항에 기재된 Mg2Si 단결정체의 제조 방법. (1) 적어도 Mg 및 Si를 포함하는 원료를 조제하는 원료 조제 공정, (2) 공정 (1)에서 조제한 원료를, 적어도 내측 표면이 BN 코트된 pBN제의 도가니 중에 충전하는 원료 충전공정, (3) 상기 도가니 전체를 가열하여, 공정 (2)에서 상기 도가니 중에 충전한 원료를 용융 화학 반응시키는 합성공정, (4) 공정 (3)에서 생성한 융액을 냉각하여 Mg2Si 단결정체를 석출시키는 공정, (5) 공정 (4)에서 석출한 Mg2Si 단결정체를 상기 도가니로부터 빼내는 공정."}
{"patent_id": "10-2021-7021787", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "결정 내에서의 소경각 입계의 발생이 양호하게 억제된 Mg2Si 단결정체를 제공한다. XRD로 측정된 결정 방위의 변동이, ±0.020°의 범위 내인 Mg2Si 단결정체."}
{"patent_id": "10-2021-7021787", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은, Mg2Si 단결정체, Mg2Si 단결정 기판, 적외선 수광 소자 및 Mg2Si 단결정체의 제조 방법에 관한 것이다."}
{"patent_id": "10-2021-7021787", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공지능(AI) 등에 관한 근년의 비약적인 기술 혁신에 수반하여, 사람의 눈이나 손을 대신해서 자동으로 감시, 제어를 행하는 시스템의 연구 개발도 정력적으로 행해지고 있다. 이와 같은 자동 감시, 자동 제어 시스템에 있 어서는, 광, 온도, 음성 등의 다양한 입력 정보를 기초로 적절한 응답 동작이 결정되므로, 입력 신호를 감지하 기 위한 하드웨어가 시스템 전체의 중에서도 중요한 역할을 하는 하나의 키 디바이스가 된다. 특히 광의 입력 신호를 감지한다고 하는 점에 있어서는, 사람의 눈을 대체하거나, 경우에 따라서는 사람의 눈으로 감지할 수 없 는 영역의 정보까지도 감지할 수 있는 디바이스를 사용함으로써, 고도인 자동 감시, 자동 제어를 실현하는 것이 가능해진다. 광의 입력 신호에 감응하는 디바이스로서는, 광의 신호를 전자적으로 처리하는 것이 가능한 전기 신호로 변환하 는 소자를 갖는 것을 들 수 있다. 그 기본적인 소자의 예로서, 반도체 재료를 사용한 광 검출 소자가 있다. 반도체 재료를 사용한 광 검출 소자는, 반도체 재료가 갖는 밴드 갭에 따라서 감응하는 파장 영역이 다르다. 야간의 자동 감시나 자동차의 자동 운전 등에도 대응할 수 있는 고도의 제어를 행하기 위해서는, 가시광 영역의 광이나 화상의 정보 이외에도 적외선 영역의 광에 관한 입력 정보가 필요해진다. 그로 인해, 적외선 영역에서 고감도로 광의 입력을 감지할 수 있는 적외선 수광 소자, 디바이스에 대한 요청은 강하고, 각종의 반도체 재료 를 사용한 적극적인 검토와 개발이 진행되고 있다. 광 검출 소자에 사용되는 재료로서, 마그네슘(Mg)과 실리콘(Si)으로 구성되는 화합물 반도체인 마그네슘 실리사 이드(Mg2Si)의 결정성 재료가 제안되어 있고, 지금까지 소정의 성과가 얻어지고 있다(비특허문헌 1, 2). 선행기술문헌 비특허문헌 (비특허문헌 0001) T. Akiyama et al., Proc. Asia-Pacific Conf. Semicond. Silicides Relat. Mater. 2016, JJAP Conf. Proc. Vol. 5, 2017, pp. 011102-1-011102-5 (비특허문헌 0002) K. Daitoku et al., Proc. Int. Conf. Su㎜er School Adv. Silicide Technol. 2014, JJAP Conf. Proc. Vol. 3, 2015, pp. 011103-1-011103-4"}
{"patent_id": "10-2021-7021787", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "Mg2Si 단결정체는, 실온에서 약 0.61eV의 금제 폭을 갖는 간접 천이형 반도체이므로, 근년 이용이 진행하는 단 파장 적외 영역(SWIR, 파장λ=0.9 내지 2.5㎛)의 적외 센서에 대한 응용을 기대할 수 있다. 그러나, 결정 내에 소경각 입계가 존재하면, 다양한 반도체 특성이 저하될 우려가 있다. 그로 인해, 결정 내에 소경각 입계가 발 생하는 것을 양호하게 억제하는 기술의 개발이 요망되고 있다. 본 개시의 기술은, 상술한 기술 과제를 해결하고자 하는 것이며, 결정 내에서의 소경각 입계의 발생이 양호하게 억제된 Mg2Si 단결정체를 제공하는 것을 하나의 목적으로 하는 것이며, 또한 당해 Mg2Si 단결정체로 구성된 Mg2Si 단결정 기판, 적외선 수광 소자를 제공하는 것을 다른 목적으로 하는 것이며, Mg2Si 단결정체의 제조 방법 을 제공하는 것을 또 다른 목적으로 하는 것이다."}
{"patent_id": "10-2021-7021787", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명자는, 예의 검토한 결과, Mg2Si 단결정체에 있어서의 결정 방위의 변동을 소정 범위로 제어함으로써, 상 기 과제를 해결할 수 있는 것을 발견하였다. 이와 같은 지견과 착상에 기초하여, 본 개시는 이하의 발명을 제공하는 것이다. 1) XRD로 측정된 결정 방위의 변동이, ±0.020°의 범위 내인 Mg2Si 단결정체. 2) XRD로 측정된 결정 방위의 변동이, ±0.016°의 범위 내인 1)에 기재된 Mg2Si 단결정체. 3) B, Li, Al, Ag, P, As 및 Sb에서 선택되는 적어도 1종을 도펀트로서 포함하는, 1) 또는 2)에 기재된 Mg2Si 단결정체. 4) 1) 내지 3) 중 어느 하나에 기재된 Mg2Si 단결정체로 구성된 Mg2Si 단결정 기판. 5) 기판 사이즈가 25㎜ 내지 150㎜인, 4)에 기재된 Mg2Si 단결정 기판. 6) 1) 내지 3) 중 어느 하나에 기재된 Mg2Si 단결정체를 구비한 적외선 수광 소자. 7) 하기 공정 내지 를 포함하는, 1) 내지 3) 중 어느 하나에 기재된 Mg2Si 단결정체의 제조 방법. 적어도 Mg 및 Si를 포함하는 원료를 조제하는 원료 조제 공정, 공정 에서 조제한 원료를, 적어도 내측 표면이 BN 코트된 pBN제의 도가니 중에 충전하는 원료 충전 공정, 상기 도가니 전체를 가열하여, 공정 에서 상기 도가니 중에 충전한 원료를 용융 화학 반응시키는 합성 공정, 공정 에서 생성한 융액을 냉각하여 Mg2Si 단결정체를 석출시키는 공정, 공정 에서 석출한 Mg2Si 단결정체를 상기 도가니로부터 빼내는 공정."}
{"patent_id": "10-2021-7021787", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 기술에 의하면, 결정 내에서의 소경각 입계의 발생이 양호하게 억제된 Mg2Si 단결정체를 제공하는 것 이 가능하게 된다."}
{"patent_id": "10-2021-7021787", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "(Mg2Si 단결정체) 본 개시의 기술에 관한 Mg2Si 단결정체는, XRD(X선 회절 장치)로 측정된 결정 방위의 변동이, ±0.020°의 범위 내가 되도록 제어되어 있다. 결정립계는 전위의 집합체로 간주할 수 있으므로, 그 성질을 전위의 성질로부터 예측할 수 있다. 이때 전위의 집합 밀도가 클수록 결정 방향의 차이가 커진다. 이 결정 방향의 차이가 작은 결정립계는 소경각 입계라고 불리고 있다. 본 개시의 기술에 관한 Mg2Si 단결정체와 같이, 결정 방위의 변동이, ±0.020°의 범위 내가 되어 있으면, 결정 내의 소경각 입계가 거의 보이지 않는다. 결정 내의 소경각 입계가 거의 존재하지 않거나, 또는, 전혀 존재하지 않으면, Mg2Si 내에서 발생한 전자-정공쌍이 재결합되기 어 려워지므로, Mg2Si 단결정체의 캐리어 수명 등 전기적 특성의 균질성이 향상된다. 본 개시의 기술에 관한 Mg2Si 단결정체는, XRD(X선 회절 장치)에 의해 측정된 결정 방위의 변동이, ±0.016°의 범위 내가 되도록 제어되어 있는 것이 바람직하고, ±0.01°의 범위 내가 되도록 제어되어 있는 것이 보다 바람직하고, 당해 결정 방위의 변동이 0°인 것이 더욱 보다 바람직하다. 본 개시의 기술에 관한 Mg2Si 단결정체는, B, Li, Al, Ag, P, As 및 Sb에서 선택되는 적어도 1종을 도펀트(불순 물)로서 포함해도 된다. 당해 Mg2Si 단결정체가 이들의 원소를 도펀트로서 포함함으로써, 캐리어 농도가 향상되 고, 반도체 디바이스로 했을 때의 도전성이나 I-V 특성이 양호해진다. 본 개시의 기술에 관한 Mg2Si 단결정체가, 도펀트로서 B를 포함하는 경우, 캐리어 농도가 1×1016㎝-3 이상 1× 1019㎝-3 이하가 되도록 포함하는 것이 바람직하고, 도펀트로서 Li를 포함하는 경우, 캐리어 농도가 1×1016㎝-3 이상 1×1019㎝-3 이하가 되도록 포함하는 것이 바람직하고, Al, Ag, P, As, Sb를 포함하는 경우, 모두 캐리어 농도가 1×1016㎝-3 이상 1×1019㎝-3 이하가 되도록 포함하는 것이 바람직하다. 본 개시의 기술에 관한 Mg2Si 단결정체는, 특별히 한정되지는 않지만, 후술하는 바와 같이 VB(수직 브리지맨)법, VGF(수직 온도 경사 응고)법 등의 융액 성장법에 의해 제조되는 경우가 많으므로, 원주상의 직동 부를 포함하는 형상을 갖고 있다. 또한, 당해 직동부의 직경이 25㎜ 내지 200㎜이다. (Mg2Si 단결정 기판) 본 개시의 기술에 관한 Mg2Si 단결정 기판은, 상술한 본 개시의 기술에 관한 Mg2Si 단결정체로 구성되어 있다. Mg2Si 단결정 기판의 사이즈(최대 직경)는 특별히 한정되지는 않지만, 25㎜ 내지 150㎜이어도 된다. 또한, Mg2Si 단결정 기판의 평면 형상은, 원형이어도 되고, 사각형 등의 직사각형이어도 된다. Mg2Si 단결정 기판의 두께는 특별히 한정되지는 않지만, 예를 들어, 200㎛ 내지 1000㎛인 것이 바람직하고, 300 ㎛ 내지 700㎛인 것이 보다 바람직하다. 특히 구경이 큰 경우, Mg2Si 단결정 기판이 300㎛ 미만이면 균열될 우 려가 있고, 1000㎛를 초과하면 모재의 단결정체가 쓸모없게 될 우려가 있다. (적외선 수광 소자) 본 개시의 기술에 관한 Mg2Si 단결정체를 사용하여 적외선 수광 소자를 제작할 수 있다. 적외선 수광 소자는, 특별히 한정되지는 않지만, 예를 들어 pn 접합 포토다이오드에 사용하는 p형 또는 n형의 광흡수 영역으로서 본 개시의 기술에 관한 Mg2Si 단결정체를 사용할 수 있다. 본 개시의 기술에 의하면, 다양한 반도체 특성이 양호 한 Mg2Si 단결정체를 제공하는 것이 가능하게 된다. 또한, 금제대 에너지 부근의 광흡수 계수가 증대되므로, 광 검출 감도를 높게 할 수 있다. 또한 에너지 갭(Eg)을 저감할 수 있으므로 수광 가능한 컷오프 파장을 신장 시키는 것이 가능하고, 보다 파장이 긴 적외광을 검출 가능한 적외선 수광 소자를 제작할 수 있다. 그로 인해, 당해 반도체 재료를 구비한 적외선 수광 소자를 제작함으로써, 적외선 영역의 센싱, 촬상을 목적으로 한 각종 디바이스의 열화를 억제할 수 있다. 그에 수반하여, 각종 화상 분석, 화상 진단 등의 기술, 나아가 그것들을 이용한 자동 감시, 자동 제어 기술과, 그것들의 기술을 사용한 산업 분야 등에도 큰 공헌을 기대할 수 있다. (Mg2Si 단결정체의 제조 방법) 본 개시의 기술에 관한 Mg2Si 단결정체는, 하기 공정 내지 를 포함하는 용융법에 의해 제조할 수 있다. 적어도 Mg 및 Si를 포함하는 원료를 조제하는 원료 조제 공정, 공정 에서 조제한 원료를, 적어도 내측 표면이 BN 코트된 pBN제의 도가니 중에 충전하는 원료 충전 공정, 상기 도가니 전체를 가열하여, 공정 에서 상기 도가니 중에 충전한 원료를 용융 화학 반응시키는 합성 공정, 공정 에서 생성한 융액을 냉각하여 Mg2Si 단결정체를 석출시키는 공정, 공정 에서 석출한 Mg2Si 단결정체를 상기 도가니로부터 빼내는 공정. 상술한 Mg2Si 단결정체의 제조 방법은, 특별히 한정되지는 않지만, 효율적으로 고순도의 단결정체를 제조할 수 있기 때문에, VB(수직 브리지맨)법, VGF(수직 온도 경사 응고)법 등의 융액 성장법에 의한 것이 바람직하다. 또한, 제조 장치는, 도가니 이외는 공지된 구성을 채용할 수 있다. 상기 공정 에서 조정하는 원료의 Mg, Si로서는, 고순도에 정제한 순도 4N(99.99%) 이상, 보다 바람직하게는 순도 5N(99.999%) 이상, 보다 바람직하게는 순도 6N(99.9999%) 이상의 평균 입경이 약 2 내지 3㎜의 청크 형상 의 입자를 바람직하게 사용할 수 있다. 통상적으로는 원료의 Mg 입자와 Si 입자의 합계는 원소비가 2:1이 되도 록 혼합한다. 또한, 도펀트를 포함하는 단결정체를 제작하는 경우는, 상기 공정 의 원료 조제 공정에서 원 료에 적량을 첨가해 둔다. 상기 공정 에서 사용하는 도가니는, pBN(열분해 질화붕소)제이며, BN(질화붕소)으로 내측 표면이 코트되어 있다. 여기서, BN 코트된 pBN제의 도가니란, pBN(열분해 질화붕소)제 도가니의 표면에 BN 미립자의 층이 형성 되어 있는 것이며, 예를 들어 pBN(열분해 질화붕소)제 도가니의 표면에 BN 미립자(오데크제의 「화이티·세븐」 등의 시판된 BN 코팅재)를 도포한 것 등을 나타낸다. 종래의 도가니는, 카본제 도가니, 또는, PG(열분해 흑 연)로 내측 표면이 코트된 카본제 도가니 등을 사용하고 있고, 도가니의 습윤성이 크고, 도가니 내에서 성장한 Mg2Si 단결정체가 도가니의 내측 표면에 고착되어 버리는 경우가 있었다. 이로 인해, 결정 성장 후의 냉각 시 에, 결정 내에 큰 응력이 가해져, 결정 내에 소경각 입계가 발생되기 쉬웠다. 이에 반해, 본 개시의 기술에 관 한 Mg2Si 단결정체의 제조 방법에서는, 상술한 바와 같이, 사용하는 도가니가, pBN(열분해 질화붕소)제이며, BN(질화붕소)으로 내측 표면이 코트되어 있으므로, 도가니의 습윤성이 작고, 도가니 내에서 성장한 Mg2Si 단결 정체가 도가니의 내측 표면에 고착되는 것을 양호하게 억제할 수 있다. 이로 인해, 결정 성장 후의 냉각 시에, 결정 내에 큰 응력이 가해지지 않고, 결정 내에 소경각 입계가 발생되는 것을 억제하고, Mg2Si 단결정체에 있어 서의 결정 방위의 변동이, ±0.020°의 범위 내가 되도록 제어할 수 있다. 상기 공정 의 합성 공정에서의 가열 시의 압력은 대기압이어도 되지만 3 기압 정도의 Ar 가스 중에서의 가열 이 바람직하다. 가열 온도는 1085℃(Mg2Si의 융점) 내지 1095℃이고, 예를 들어 합계로 약 15분 내지 14시간 정도 열처리한다. 1085℃ 이상의 온도로 가열함으로써, Mg와 Si가 용융된 Mg-Si 융액으로 된다. 상기 공정 의 합성 공정에서는, VB법에 있어서는, 도가니를 축방향 하측을 향하여 이동시킴으로써, VGF법에 있어서는 히터의 온도를 조절함으로써, 도가니의 축방향에 있어서 Mg2Si 종결정측의 온도가 상대적으로 낮고, Mg2Si 원료측의 온도가 상대적으로 높은 온도 구배를 형성한다. 이에 의해, 용융되어 있던 Mg2Si 원료는, Mg2Si 종결정측으로부터 순서대로 응고함으로써 Mg2Si 단결정이 성장한다. 결정 성장부의 원추부 및 직동부 내의 용융 되어 있던 Mg2Si 원료가 이 순서대로 모두 응고함으로써 Mg2Si 단결정체가 형성된다. 또한, 적외선 검출기를 만드는 데 있어서는, 검출기의 광흡수 영역에 본 개시의 기술에 관한 Mg2Si 단결정체로 이루어지는 반도체 재료의 단결정막을 사용할 수 있다. 이 경우, 분자선 에피택시법(MBE법), 유기 금속 화학 기상법(MOCVD법), 스퍼터 퇴적법 등 일반적으로 알려져 있는 반도체막의 성막 기술에서의 단결정막의 제작이 가 능하다. MBE법에서는 일반적으로는 진공 용기 내에서 Mg, Si를 증발시킨 분자선에 의해 동시에 공급하고, 그 조성비를 조정하여 Mg2Si를 소정의 기판 상에 퇴적한다. 이 퇴적시 중, 일반적으로는 기판을 가열한다. 가열 온도는 일 반적으로는 100℃ 이상에서 650℃(Mg의 융점 온도) 이하로 한다. 이 가열에 의해 기판 상에 퇴적한 분자가 반 응하여 단결정의 Mg2Si막이 성장한다. MOCVD법에서는 일반적으로는 반응 용기 내에서 Mg, Si를 포함하는 유기 금속 가스를 동시에 공급하고, 그 조성 비를 조정하여 Mg2Si를 소정의 기판 상에 퇴적한다. 이 퇴적시 중, 일반적으로는 기판을 가열한다. 가열 온도 는 일반적으로는 100℃ 이상에서 650℃(Mg의 융점 온도) 이하로 한다. 이 가열에 의해 기판 상에서 유기 금속 가스가 반응하여 단결정의 Mg2Si막이 성장한다. 스퍼터 퇴적법에서는 일반적으로는 반응 용기 내에서 Mg, Si를 포함하는 고체의 타깃을 Ar 이온 등에서 스퍼터 링함으로써 스퍼터 분자를 공급하고, 그 조성비를 조정하여 Mg2Si를 소정의 기판 상에 퇴적한다. 이 퇴적시 중, 일반적으로는 기판을 가열한다. 가열 온도는 일반적으로는 100℃ 이상에서 650℃(Mg의 융점 온도) 이하로한다. 이 가열에 의해 기판 상에서 스퍼터 분자가 반응하여 단결정의 Mg2Si막이 성장한다. 또한, 상기 실시 형태의 설명은, 본 발명을 설명하기 위한 것으로서, 특허 청구의 범위에 기재된 발명을 한정하 고, 또는 범위를 감축하는 것은 아니다. 또한, 본 발명의 각 부 구성은 상기 실시 형태에 한정되지는 않고, 특 허 청구의 범위에 기재된 기술적 범위 내에서 다양한 변형이 가능하다. [실시예] 이하, 본 개시의 기술적 내용을 실시예에 기초하여 구체적으로 설명한다. 이하의 실시예 기재는, 어디까지나 본 개시의 기술적 내용의 이해를 용이하게 하기 위한 구체예이며, 본 발명의 기술적 범위는 이들의 구체예에 의 해 제한되는 것이 아니다. -실시예 1- (Mg2Si 단결정체의 제작) 실시예 1에 관한 Mg2Si 단결정체의 제작은, VB(수직 브리지맨)법을 사용하였다. 먼저, 내경 19㎜φ 길이 10㎝ 의 pBN제 도가니를 준비하고, pBN제 도가니의 내측 표면으로의 BN 코트는, 오데크제의 BN 코팅재 「화이티·세 븐」을 두께 0.1㎜로 도포하고, 12시간의 자연 건조시킨 후, 200℃에서 가열 처리를 실시하여, BN 코트를 구비 한 pBN제 도가니를 준비하였다. 다음으로, 내측 표면이 BN 코트된 pBN제의 도가니에, 순도 6N의 Mg 입자[오사 카 아사히 메탈제, 청크재(평균 입경 2 내지 3㎜)], 순도 10N의 Si 입자[푸루우찌 가가꾸제, 청크재(평균 입경 2 내지 3㎜)]의 원료 혼합물을 충전하였다. 다음으로, 도가니를 도가니 보유 지지대에 적재하여, 560Torr의 Ar 가스와 함께 석영 앰플에 봉입하고, 이를 전 기로(저항 가열로)로 넣어, 1.5시간에 걸쳐서 1085℃(표시 온도)로 가열하였다. 또한 동일 온도에서 1.5시간 가열하여, 융해한 후, 10㎜/h의 성장 속도가 되도록 전기로를 상승시키고, 결정을 성장시켰다. 그 후, 자연 냉 각하고, 실온으로 된 시점에서 전기로로부터 도가니를 빼내고, 실시예 1에 관한 단결정체의 샘플을 얻었다. -비교예 1- 도가니로서, 내측 표면을 PG(열분해 흑연) 코트한 카본제 도가니를 사용한 것 이외는, 실시예 1과 마찬가지로 샘플을 제작하였다. -비교예 2- 도가니로서, 비교예 1의 PG(열분해 흑연) 코트 상에 추가로 BN 코트를 실시한 카본제 도가니를 사용한 것 이외 는, 실시예 1과 마찬가지로 샘플을 제작하였다. -비교예 3- 도가니로서, 내측 표면을 코트하고 있지 않은 pBN제 도가니를 사용한 것 이외는, 실시예 1과 마찬가지로 샘플을 제작하였다. -비교예 4- 도가니로서, 내측 표면을 코트하고 있지 않은 BN제 도가니를 사용한 것 이외는, 실시예 1과 마찬가지로 샘플을 제작하였다. -비교예 5- 도가니로서, 내측 표면을 SiC 코트한 카본제 도가니를 사용한 것 이외는, 실시예 1과 마찬가지로 샘플을 제작하 였다. (Mg2Si 단결정체의 조성) 실시예 1에 관한 단결정체의 샘플의 조성을, 형광 X선 분석 장치를 사용하여 측정한 결과, Mg2Si이었다. 또한, 비교예 1 내지 5에 관한 단결정체의 샘플의 조성을 마찬가지로 측정한 결과, Mg2Si이었다. (입계의 관찰) 각 샘플로부터, 두께 0.6㎜로 직경 11 내지 19㎜의 기판을 제작하고, 표면을 번수 #4000의 연마재로 연마하였다. 연마 후의 기판 표면의 외관 관찰 사진(도 1)을 얻어, 입계의 유무를 평가하였다. 도 1에 있어서, (a) PG가 비교예 1, (b) pBN이 비교예 3, (c) pBN+BN 코트가 실시예 1, (d) BN이 비교예 4, (e) SiC가 비교예 5, (f) PG+BN이 비교예 2를 나타낸다. 실시예 1에서는, 도가니의 내측 표면의 습윤성이 나쁘고, 성장한 결정체가 도가니에 고착되어 있지 않았기 때문 에, 결정 내에서의 소경각 입계의 발생이 양호하게 억제되어 있었다. 비교예 1 내지 5에서는, 모두 도가니의 내측 표면의 습윤성이 좋고, 성장한 결정체가 도가니에 고착하고, 냉각 중의 도가니와 Mg2Si 단결정의 열팽창률차 등에 기인하여 응력이 걸려, 결정 내에 결정 결함의 유발에 의해, 소 경각 입계의 발생이 발생하였다. 본 발명에 있어서의 실시예 1의 BN 코트를 구비한 pBN 도가니와, 비교예 3의 코트하고 있지 않은 pBN제 도가니, 비교예 4의 코트하고 있지 않은 BN제 도가니를 비교한 경우, BN 코트를 구비한 pBN제 도가니는, 이중 구조의 내 벽 표면이며 얇은 BN 코트층이 간섭재의 역할을 하고, 열팽창률차의 영향을 완화시키고, 원료 융액과 도가니 내 벽의 습윤성이 작아 억제되어, 소경각 입계의 발생이 양호하게 억제된다고 생각된다. (X선 회절 측정) 얻어진 단결정체의 샘플에 대하여 입사 X선의 스폿 사이즈 1㎜φ로 배면 반사 라우에 관찰을 행하였다. 실시예 1에서는 샘플 내의 어떠한 부분에서도 도 2의 (a)와 같이 단일의 회절 스폿이 얻어지고, 결정 전체에 있어서 소 경각 입계를 포함하지 않는 단결정인 것이 확인되었다. 한편, 비교예 1 내지 5에서는 단일의 회절 스폿이 보이 는 부분도 있었지만, 도 2의 (b)와 같은 회절 스폿이 이중으로 보이는 부분이 관찰되고, 결정면 내의 어딘가에 는 소경각 입계를 포함하는 단결정인 것이 확인되었다. X선 회절(XRD) 장치에 의해 로킹 커브 측정을 행한 결과, 실시예 1의 샘플에서는 도 3의 (a)에 도시한 바와 같 이 Mg2Si 440 회절에 있어서의 FWHM(반값 전폭)이 0.02°의 날카로운 단일 피크가 얻어지고, 샘플 내에서의 결 정 방위의 변동이, ±0.020°의 범위 내인 것이 확인되었다. 한편, 비교예 1 내지 5의 샘플에서는, 방위가 조 금 어긋난 소경각 입자로부터의 회절 피크가 복수 보이고 도 3의 (b)에 도시한 바와 같이, 최대 2°의 방위 어 긋남이 보였다. 실시예 2로서 도가니의 내경 25㎜φ 길이 10㎝이고, 내측 표면이 BN 코트된 pBN제의 도가니로 실시예 1과 마찬 가지로 Mg2Si 결정을 성장시켰다. 결정을 잘라내고, 연마한 기판의 표면 관찰 사진을 도 4에 도시한다. 직경 25㎜φ의 소경각 입계를 포함하지 않는 기판 결정이 얻어져 있다. 이 기판 결정의 로킹 커브 측정을 행한 결과, 도 5에 도시한 바와 같이 Mg2Si 400 회절에 있어서의 FWHM(반값 전폭)이 0.016°의 날카로운 단일 피크가 얻어지고, 샘플 내 전체에 걸쳐서 결정 방위의 변동이, ±0.020°의 범위 내인 것이 확인되었다. (I-V 특성의 측정) 실시예 2의 pBN+BN 코트 도가니에서의 기판 상 및 비교예 1의 PG 도가니에서의 기판 상에, Al을 열 확산하여 사 전에 이면 전극을 제작하고, 또한 Au 보호 전극을 이면에 마련하였다. 다음으로, 표면에 Ag 확산원(Ag) 및 Au 캡층(Au)을 진공 증착에 의해 퇴적하고, 열 확산시킨 후, 표면을 습식 에칭함으로써, 메사 구조를 형성하고, 이 에 의해 pn 접합 포토다이오드를 제작하였다. 이들 포토다이오드의 제조 공정의 개요를 도 6에 도시한다. 또한, 샘플의 I-V 특성을 도 7에 도시한다. 실시예 1의 기판 상의 디바이스에서는 역방향 전류 밀도가 충분히 낮고, 순방향 전류 밀도는 높아지고, -1V와 +0.5V의 전압 인가에 있어서의 정류비는 2300 이상으로 양호한 값을 나타냈다. 한편, 비교예 1의 기판 상에서 소경각 입계를 포함하는 부분에 제작된 포토다이오드에서는 정류성은 확인되었지만 정류비는 6으로 작다. 도 8에 동 포토다이오드의 수광 감도 특성을 나타낸다. 실시예 2의 기판 상의 포토다이오드는 비교예 1의 기판 상의 포토다이오드에 비교하여 대략 2 자릿수 높은 감도가 얻어져 있다. 도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8"}
{"patent_id": "10-2021-7021787", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 실시예 및 비교예에 관한, 연마 후의 기판 표면의 외관 관찰 사진이다. 도 2는 실시예 및 비교예에 관한, 배면 반사 라우에에 의한 결정성의 평가 사진이다. 도 3은 실시예 및 비교예에 관한, XRD차트이다. 도 4는 실시예에 관한, 기판의 표면 관찰 사진이다. 도 5는 실시예에 관한, XRD차트이다. 도 6은 실시예 및 비교예에 관한, 샘플의 제조 공정의 개요이다. 도 7은 실시예 및 비교예에 관한, 샘플의 I-V 특성을 나타내는 그래프이다. 도 8은 실시예 및 비교예에 관한, 샘플의 수광 감도 특성을 나타내는 그래프이다."}
