{"patent_id": "10-2009-0023608", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2010-0104898", "출원번호": "10-2009-0023608", "출원인": "한국전자통신연구원", "발명자": "김항기"}}
{"patent_id": "10-2009-0023608", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "의도한 게임 밸런싱 속성값 및 속성 변화 크기를 설정하는 단계와,상기 게임 밸런싱 속성값을 이용하여 게임을 플레이하는 단계와,상기 게임의 플레이 후에 게임 밸런싱 결과요소를 계산하는 단계와,상기 게임 밸런싱 속성값과 상기 게임 밸런싱 결과요소를 비교하는 단계와,상기 비교의 결과에 따라 상기 속성 변화 크기에 의거하여 상기 게임 밸런싱 속성값을 조정하는 단계를 포함하는 게임 밸런싱을 위한 프리셋 조절 방법."}
{"patent_id": "10-2009-0023608", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 프리셋 조절 방법은,게임 객체 밸런싱 속성의 중요도를 판단하는 단계를 더 포함하며,상기 조정하는 단계는, 판단한 상기 중요도에 따라 상기 게임 밸런싱 속성값을 조정하는게임 밸런싱을 위한 프리셋 조절 방법."}
{"patent_id": "10-2009-0023608", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 조정하는 단계는,게임 밸런싱 속성 리스트 후보를 설정하는 단계와,상기 게임 밸런싱 속성 리스트 후보에 포함된 상기 게임 객체 밸런싱 속성을 조절하는 단계와,상기 게임 밸런싱 결과 요소를 이용하여 밸런싱의 변화 정도를 측정하는 단계와,측정한 상기 변화 정도에 따라서 상기 게임 객체 밸런싱 속성의 상기 중요도를 결정하는 단계를 포함하는 게임 밸런싱을 위한 프리셋 조절 방법."}
{"patent_id": "10-2009-0023608", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 변화 정도를 측정하는 단계는, 미션 클리어 방식의 경우에 미션 클리어까지 걸리는 시간, 똑같은 행동을반복하는 시간, 플레이어의 의견 중에서 적어도 어느 하나를 상기 게임 밸런싱 결과 요소로 이용하는게임 밸런싱을 위한 프리셋 조절 방법."}
{"patent_id": "10-2009-0023608", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 3 항에 있어서,상기 변화 정도를 측정하는 단계는, 플레이어와 플레이어간 경쟁을 통한 승패 게임의 경우에 승패 결정이 걸리기까지 걸린 시간, 승패 확률, 승패 결정이 되었을 때 승자와 패자의 속성 차이, 플레이어의 의견 중에서 적어도 어느 하나를 상기 게임 밸런싱 결과 요소로 이용하는게임 밸런싱을 위한 프리셋 조절 방법."}
{"patent_id": "10-2009-0023608", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2010-0104898-3-제 2 항 또는 제 3 항에 있어서,상기 조정하는 단계는, 상기 게임 밸런싱 속성값을 상기 중요도에 따라서 중요한 것부터 변경하는게임 밸런싱 프리셋 자동 조절 방법."}
{"patent_id": "10-2009-0023608", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서,상기 프리셋 조절 방법은,상기 조정하는 단계의 수행 후에 상기 속성 변화 크기를 재설정하는 단계와,상기 플레이하는 단계와 상기 계산하는 단계 및 상기 비교하는 단계를 재수행하여 이 비교의 결과에 따라 상기재설정에 의한 상기 속성 변화 크기에 의거하여 상기 게임 밸런싱 속성값을 조정하는 단계를 포함하는 게임 밸런싱을 위한 프리셋 조절 방법."}
{"patent_id": "10-2009-0023608", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "사용자의 수준에 따른 게임 객체 속성의 프리셋을 설정하는 단계와,상기 사용자의 행동 패턴 또는 밸런싱 관련 속성을 수집하는 단계와,수집한 상기 행동 패턴 또는 상기 밸런싱 관련 속성을 이용하여 사용자의 수준을 판단하는 단계와,판단한 상기 사용자의 수준에 맞게 게임 객체 속성을 조절하는 단계를 포함하는 게임 밸런싱을 위한 런타임 게임 밸런싱 조절 방법."}
{"patent_id": "10-2009-0023608", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서,상기 판단하는 단계는, 미리 정의한 상기 행동 패턴으로 유추하는게임 밸런싱을 위한 런타임 게임 밸런싱 조절 방법."}
{"patent_id": "10-2009-0023608", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9 항에 있어서,상기 판단하는 단계는, 상기 미리 정의한 행동 패턴을 스크립트 또는 프로그램 코드로 구현하는게임 밸런싱을 위한 런타임 게임 밸런싱 조절 방법."}
{"patent_id": "10-2009-0023608", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 8 항에 있어서,상기 판단하는 단계는, 각 수준에 따라 상기 행동 패턴을 학습한 결과와 상기 행동 패턴을 실시간으로 수집한결과를 비교하는게임 밸런싱을 위한 런타임 게임 밸런싱 조절 방법."}
{"patent_id": "10-2009-0023608", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 8 항에 있어서,상기 판단하는 단계는, 상기 사용자의 수준을 파악하기 위한 미션을 두고 이 미션의 클리어 시간 또는 클리어할 때의 상기 행동 패턴에 따라 상기 사용자의 수준을 판단하는게임 밸런싱을 위한 런타임 게임 밸런싱 조절 방법.명 세 서공개특허 10-2010-0104898-4-발명의 상세한 설명 기 술 분 야본 발명은 게임 밸런싱을 위한 프리셋(preset) 조절 방법 및 런타임 게임 밸런싱 조절 방법에 관한 것으로서, [0001]더욱 상세하게는 게임의 밸런싱을 위한 프리셋 조절의 자동화 방법과 게임 서비스 중에 사용자 수준에 따른 밸런싱 조절의 자동화 방법에 관한 것이다.본 발명은 지식경제부와 정보통신연구진흥원의 IT성장동력기술개발 사업의 일환으로 수행한 연구로부터 도출된 [0002]것이다[과제관리번호 : 2006-S-044-03, 과제명 : 멀티코아 CPU 및 MPU기반 크롯플랫폼 게임기술 개발]. 배 경 기 술컴퓨터 게임에서 밸런싱(balancing), 즉 게임 객체 속성의 균형 조절은 게임 서비스에 있어서 중요한 요소 중의 [0003]하나이다.플레이어와 컴퓨터 간에 주어진 미션(mission)을 해결하기 위해 플레이를 진행하는 방식인 미션 클리어 방식의 [0004]게임의 경우에 게임을 플레이(play)하는 도중에 플레이어(player)의 수준에 비하여 너무 쉬우면 게임 플레이 시간이 짧아져서 흥미를 잃게 만들며, 너무 어려우면 게임 플레이 시간이 길어져 지루해지면서 몰입도가반감된다.또한, 플레이어와 플레이어간 경쟁을 통한 승패 게임의 경우에는 특정 속성을 가진 어느 한 쪽이 플레이어의 기 [0005]술이나 숙련도에 상관없이 우세하게 될 경우에 모두 다 그러한 속성을 사용하게 됨으로써 게임의 다양성이 무너지게 되고 몰입도가 반감된다.이렇게 게임의 몰입도에 중요한 역할을 하는 밸런싱이지만 종래에는 기획자 또는 개발자가 임의로 정하거나 많 [0006]은 게임 테스터를 통한 수작업을 통하여 조절하는 방식이 이용되고 있다. 발명의 내용 해결 하고자하는 과제종래 기술에 따른 수작업을 통한 밸런싱은 많은 시간과 비용이 소요되면서도 수작업의 특성상 여전히 밸런싱 조 [0007]절에 실패하는 경우가 발생하는 문제점이 있었다.본 발명은 이러한 종래 기술의 문제점을 해결하기 위해 제안한 것으로서, 게임의 밸런싱을 자동화함으로써 시간 [0008]및 비용을 줄이면서도 밸런싱 조절의 실패가 발생하지 않도록 한다. 이를 위해 게임 밸런싱의 프리셋을 조절하는 방법과 플레이하는 사용자의 수준을 파악하여 그에 맞춰 밸런싱을 조절하는 방법을 제시함으로써, 밸런싱 프리셋의 자동 조절이 가능하며, 게임 서비스 중에 사용자 수준에 따른 밸런싱 조절이 가능하다. 게임 개발 단계에서 밸런싱 조절을 자동화함으로써 밸런싱 조절에 따른 시간 및 비용을 절감할 수 있고, 기획자가 원하는 밸런싱을 제공함으로써 게임 플레이어가 기획자의 의도대로 재미와 몰입감을 느끼면서 플레이할 수 있게 한다. 서비스 단계에서는 사용자 수준에 따른 밸런싱을 제공함으로써 사용자의 수준에 따라서 초급자가 게임을 시작할 때에 접하는 어려움과 상급자가 플레이할 때 느끼는 지루함을 해소할 수 있다. 과제 해결수단본 발명의 제 1 관점으로서 게임 밸런싱을 위한 프리셋 조절 방법은, 의도한 게임 밸런싱 속성값 및 속성 변화 [0009]크기를 설정하는 단계와, 상기 게임 밸런싱 속성값을 이용하여 게임을 플레이하는 단계와, 상기 게임의 플레이후에 게임 밸런싱 결과요소를 계산하는 단계와, 상기 게임 밸런싱 속성값과 상기 게임 밸런싱 결과요소를 비교공개특허 10-2010-0104898-5-하는 단계와, 상기 비교의 결과에 따라 상기 속성 변화 크기에 의거하여 상기 게임 밸런싱 속성값을 조정하는단계를 포함한다.여기서, 상기 프리셋 조절 방법은, 게임 객체 밸런싱 속성의 중요도를 판단하는 단계를 더 포함하며, 상기 조정 [0010]하는 단계는, 판단한 상기 중요도에 따라 상기 게임 밸런싱 속성값을 조정한다.상기 조정하는 단계는, 게임 밸런싱 속성 리스트 후보를 설정하는 단계와, 상기 게임 밸런싱 속성 리스트 후보 [0011]에 포함된 상기 게임 객체 밸런싱 속성을 조절하는 단계와, 상기 게임 밸런싱 결과 요소를 이용하여 밸런싱의변화 정도를 측정하는 단계와, 측정한 상기 변화 정도에 따라서 상기 게임 객체 밸런싱 속성의 상기 중요도를결정하는 단계를 포함한다.상기 변화 정도를 측정하는 단계는, 미션 클리어 방식의 경우에 미션 클리어까지 걸리는 시간, 똑같은 행동을 [0012]반복하는 시간, 플레이어의 의견 중에서 적어도 어느 하나를 상기 게임 밸런싱 결과 요소로 이용한다.상기 변화 정도를 측정하는 단계는, 플레이어와 플레이어간 경쟁을 통한 승패 게임의 경우에 승패 결정이 걸리 [0013]기까지 걸린 시간, 승패 확률, 승패 결정이 되었을 때 승자와 패자의 속성 차이, 플레이어의 의견 중에서 적어도 어느 하나를 상기 게임 밸런싱 결과 요소로 이용한다.상기 조정하는 단계는, 상기 게임 밸런싱 속성값을 상기 중요도에 따라서 중요한 것부터 변경한다. [0014]상기 프리셋 조절 방법은, 상기 조정하는 단계의 수행 후에 상기 속성 변화 크기를 재설정하는 단계와, 상기 플 [0015]레이하는 단계와 상기 계산하는 단계 및 상기 비교하는 단계를 재수행하여 이 비교의 결과에 따라 상기 재설정에 의한 상기 속성 변화 크기에 의거하여 상기 게임 밸런싱 속성값을 조정하는 단계를 포함한다.본 발명의 제 2 관점으로서 게임 밸런싱을 위한 런타임 게임 밸런싱 조절 방법은, 사용자의 수준에 따른 게임 [0016]객체 속성의 프리셋을 설정하는 단계와, 상기 사용자의 행동 패턴 또는 상기 밸런싱 관련 속성을 수집하는 단계와, 수집한 상기 행동 패턴 또는 밸런싱 관련 속성을 이용하여 사용자의 수준을 판단하는 단계와, 판단한 상기사용자의 수준에 맞게 게임 객체 속성을 조절하는 단계를 포함한다.여기서, 상기 판단하는 단계는, 미리 정의한 상기 행동 패턴으로 유추하며, 상기 미리 정의한 행동 패턴을 스크 [0017]립트 또는 프로그램 코드로 구현한다.상기 판단하는 단계는, 각 수준에 따라 상기 행동 패턴을 학습한 결과와 상기 행동 패턴을 실시간으로 수집한 [0018]결과를 비교한다.상기 판단하는 단계는, 상기 사용자의 수준을 파악하기 위한 미션을 두고 이 미션의 클리어 시간 또는 클리어 [0019]할 때의 상기 행동 패턴에 따라 상기 사용자의 수준을 판단한다. 효 과본 발명에 의하면 밸런싱 프리셋을 자동 조절하며, 게임 서비스 중에 사용자 수준에 따라 밸런싱을 자동 조절한 [0020]다. 게임 개발 단계에서 밸런싱 조절을 자동화함으로써 밸런싱 조절에 따른 시간 및 비용을 절감하고, 기획자가원하는 밸런싱을 제공함으로써 게임 플레이어가 기획자의 의도대로 재미와 몰입감을 느끼면서 플레이할 수 있게한다. 서비스 단계에서는 사용자 수준에 따른 밸런싱을 제공함으로써 사용자의 수준에 따라서 초급자가 게임을시작할 때에 접하는 어려움과 상급자가 플레이할 때 느끼는 지루함을 해소하는 효과가 있다. 발명의 실시를 위한 구체적인 내용이하, 본 발명의 일부 실시예를 첨부된 도면들을 참조하여 상세히 설명한다. 아울러 본 발명을 설명함에 있어, [0021]관련된 공지 구성 또는 기능에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되는 경우에는 그상세한 설명을 생략한다.게임의 밸런싱 프리셋을 조절한다는 의미는 게임이 미리 정해진 사용자 수준(예 : 초급, 중급, 상급 등)을 기준 [0022]공개특허 10-2010-0104898-6-으로 너무 쉽거나 너무 어렵지 않고 기획자가 의도한 바와 같이 플레이 시간 및 난이도를 즐기면서 몰입감을 유지할 수 있게 수준에 따른 객체 속성을 미리 설정하여 저장해 두는 것이다.이를 위하여 게임 객체(object)의 속성(attribute)(게임 객체의 인공지능 포함)을 조절함으로써 밸런싱을 조절 [0023]하게 된다. 여기서 게임 객체라 함은 게임의 진행에 영향을 주는 모든 객체를 가리킨다. 예를 들어 블록격파 게임의 경우에는 블록, 슈팅 게임의 경우에는 무기 아이템, 롤플레잉게임(Role Playing Game: RPG)의 경우에는 주문 기술 등과 같이 게임 내부에서 진행하면서 조금이라도 진행에 영향을 줄 경우에 그것을 게임 객체라고 할 수있다. 게임 진행에 영향을 미치지 않는 객체(예 : 화면 밝기, 소리 크기 등)는 이에 포함하지 않는다. 게임 객체의 속성이라 함은 게임 객체에 부여된 성질을 뜻한다. 예를 들어 슈팅게임의 무기 피해도, HP(Hit Point) 등이 이에 속한다. 특정 게임 객체에 적용되는 인공지능도 종류에 따라서 하나의 속성으로 간주될 수 있다. 어떤것은 속성 하나만으로도(예 : 날씨, 시간 등) 게임에 영향을 줌으로써 게임 객체가 될 수 있다.인공지능을 게임 객체의 형태로 사용할 경우에는 인공지능 알고리즘 종류(예 : Neural Network : 1, hFSM : 2 [0024]등) 또는 인공지능의 동작에 필요한 속성을 값의 형태(예 : Input Layer : 10개, Hidden Layer : 7개, OutputLayer : 10개 등)로 표현하여 사용한다.본 발명에서는 밸런싱 자동화를 위한 프리셋 조절 방법과 밸런싱 조절 방법을 제공한다. 즉 게임 속성 조절을 [0025]통하여 원하는 상태의 밸런싱이 되도록 프리셋을 조절하는 프리셋 조절 방법과 게임을 플레이하면서 사용자의수준을 파악하고 그에 맞춰 밸런싱을 조절하는 밸런싱 조절 방법을 제시한다.도 1은 본 발명의 실시예에 따른 게임 밸런싱을 위한 프리셋 조절 방법과 런타임 게임 밸런싱 조절 방법을 수행 [0026]할 수 있는 밸런싱 조절 장치의 블록 구성도이다.이에 나타낸 바와 같이 본 발명을 위한 밸런싱 조절 장치는, 게임 객체의 밸런싱 속성 중요도를 계산하는 게임 [0027]밸런싱 속성 계산부(110)와, 게임 속성 조절을 통하여 원하는 상태의 밸런싱이 되도록 프리셋을 조절하는 프리셋 조절부(120)와, 게임 서비스 도중 실시간으로 플레이어의 수준을 파악하고 그에 적합하게 밸런싱을 조절하는런타임 게임 밸런싱 조절부(130) 등을 포함한다.이러한 게임 밸런싱 속성 계산부(110)와 프리셋 조절부(120) 및 런타임 게임 밸런싱 조절부(130)는 [0028]API(Application Programming Interface) 형태로 구현되어 하나의 게임 어플리케이션 속에 포함될 수도 있고외부에 별도의 어플리케이션으로 구현되어 플러그인 방식으로 동작할 수도 있다.게임 객체 밸런싱 속성 중요도라 함은 게임 객체 속성 중 그 속성을 변화시켰을 때 밸런싱이 변화하는 정도를 [0029]뜻한다. 따라서 게임 밸런싱 속성 중요도가 큰 속성의 경우 다른 속성을 조절하는 것보다 그 속성값을 조절함으로써 게임의 밸런싱이 크게 변하게 되고 따라서 밸런싱을 빠르게 잡아낼 수 있는 속성들이다.한편, 도 1의 밸런싱 조절 장치 중에서 게임 밸런싱 속성 계산부(110)를 제외하더라도 본 발명에 의해 밸런싱을 [0030]위한 속성을 자동으로 조절하는 결과를 도출할 수 있다. 즉 게임 객체 밸런싱 속성 중요도를 계산하지 않더라도게임 밸런싱 조절을 위한 시간이 조금 더 소요될 뿐 마찬가지로 밸런싱을 위한 속성을 자동으로 조절할 수있다.게임 밸런싱의 변화 감지는 다음과 같은 방법으로 알아낸다. [0031]플레이어와 컴퓨터 간에 주어진 과제(mission, quest)를 수행하기 위하여 플레이를 진행하는 미션 클리어 방식 [0032]의 게임의 경우에 밸런싱을 감지하는 요소로는 플레이어의 숙련도에 따라 미션 클리어까지 걸리는 시간, 똑같은행동을 반복하는 시간, 플레이어의 의견 등이 있다.플레이어와 플레이어간 경쟁을 통한 승패 게임의 경우에 밸런싱을 감지하는 요소로는 승패 결정이 걸리기까지 [0033]걸린 시간, 승패 확률, 승패 결정되었을 때 승자와 패자의 속성 차이(예를 들어, hit point의 차이), 플레이어의 의견 등이 있다.이러한 요소를 검사하여 밸런싱 결과 요소에 의한 값이 원래 의도했던 것과 다를 경우 밸런싱이 실패한 것이라 [0034]볼 수 있다. 그렇게 되면 게임의 재미가 반감되고, 해당 게임을 플레이하지 않게 된다. 따라서 의도된 밸런싱의값이 되도록 유지하여야 한다.공개특허 10-2010-0104898-7-이하, 도 2 및 도 3을 추가로 참조하여 본 발명의 실시예에 따른 게임 밸런싱을 위한 프리셋 조절 방법 및 런타 [0035]임 게임 밸런싱 조절 방법에 대해 살펴보기로 한다.본 발명의 실시예에 따른 게임 밸런싱을 위한 프리셋 조절 방법은 도 2에 나타낸 바와 같이, 게임 밸런싱 속성 [0036]리스트 후보를 설정하는 단계(S201)와, 설정한 게임 밸런싱 속성 리스트 후보에 포함된 게임 객체 밸런싱 속성을 조절하는 단계(S203)와, 게임 밸런싱 결과 요소를 이용하여 밸런싱의 변화 정도를 측정하는 단계(S205)와,측정한 변화 정도에 따라서 게임 객체 밸런싱 속성의 중요도를 결정하는 단계(S207)와, 의도한 게임 밸런싱 값을 미리 설정하는 단계(S209)와, 중요도에 따라 게임 밸런싱 값을 변경해 가며 게임 밸런싱 결과요소와 비교하는 단계(S211)와, 비교한 게임 밸런싱 값을 이용하여 게임 객체 밸런싱 속성을 조정하는 단계(S213) 등을 포함한다.먼저, 게임 밸런싱 속성 계산부(110)의 동작은 다음과 같다. [0037]게임 개발자는 게임 객체 밸런싱 속성이 될 수 있는 후보군(인공지능도 이에 포함된다)을 게임 밸런싱 속성 계 [0038]산부(110)에 등록 및 설정하고 이를 조절(set, get)할 수 있도록 함수 인터페이스(예, SetHP(), GetHP() 등)를제공한다(S201). 또한 플레이 후 앞서 언급한 밸런싱을 감지할 수 있는 요소(미션 클리어 시간, 승패 시간등)를 게임 밸런싱 속성 계산부(110)에게 보고할 수 있는 인터페이스를 제공한다.게임 밸런싱 속성 계산부(110)는 위에서 주어진 게임 속성 후보 리스트, 인터페이스를 이용하여 속성들을 조절 [0039](S203)하면서 밸런싱의 변화 정도를 조사 및 측정한다(S205). 이 때, 속성값의 변화에 따른 밸런싱의 변화 정도에 따라서 중요도가 결정된다. 특정 속성값을 변경시켰을 때 밸런싱 감지 요소들의 변화가 클 경우 그 속성의밸런싱 중요도를 높게 판단하고 속성값을 변경시켰을 때 밸런싱 감지 요소들의 변화가 작을 경우 중요도를 낮게판단한다(S207).프리셋 조절부(120)는 게임 밸런싱 속성 계산부(110)에 의해 게임 밸런싱 속성 중요도가 계산되고 나면 게임 속 [0040]성 조절을 통하여 원하는 밸런싱 상태가 되도록 한다.기획자 또는 개발자는 의도하는 최적 밸런싱 요소의 상태, 즉 의도한 게임 밸런싱 속성값을 프리셋 조절부(12 [0041]0)에게 인터페이스를 통하여 설정할 수 있으며, 단계 S217에서 이용하기 위해 속성 변화 크기의 초기값을 설정할 수 있다(S209). 이렇게 설정된 게임 밸런싱 속성값에 의해 게임이 플레이된다.그리고, 프리셋 조절부(120)는 게임을 플레이(S211)한 후에 게임 밸런싱 결과요소를 계산하며(S213), 계산한 게 [0042]임 밸런싱 결과요소와 단계 S209에서 설정한 게임 밸런싱 속성값을 비교한다(S215).단계 S215의 비교 결과, 게임 밸런싱 결과요소와 게임 밸런싱 속성값이 일치하면 게임 객체 밸런싱 속성값의 조 [0043]정을 수행하지 않고 종료하나, 게임 밸런싱 결과요소와 게임 밸런싱 속성값이 불일치하면 단계 S209에서 설정한속성 변화 크기의 초기값에 의거하여 게임 밸런싱 속성값을 조정한다(S217).다음으로, 단계 S217에서 게임 밸런싱 속성값의 조정을 위해 이용하는 속성 변화 크기를 재설정 한다. 즉, 속성 [0044]변화 크기를 줄인다(S219).이후, 단계 S211, S213, S215, S217, S219를 재수행하는데, 이러한 재수행은 게임 밸런싱 결과요소와 게임 밸런 [0045]싱 속성값이 일치할 때까지 수행한다. 물론, 단계 S219를 재수행할 때에는 이전 과정에서 재설정한 속성 변화크기 값을 이용하여 속성값을 조정한다.속성 변화 크기 값은 초기에는 크게 설정하여 크게 밸런싱이 변화하도록 하며, 반복할수록 속성 변화 크기 값을 [0046]줄여서 점차 원하는 값으로 수렴되게 한다. 여기서, 단계 S207에서 게임 객체 밸런싱 속성 중요도를 판단한 경우에는 게임 속성 밸런싱 중요도가 큰 것부터 먼저 바꾸어 가면서 최적 밸런싱이 되도록 조절하고, 그것으로 조절할 수 없는 미세한 밸런싱 요소 차이는 중요도가 높은 순에서 낮은 순으로 속성값을 변화시켜가면서 줄여 나간다. 속성 밸런싱 중요도가 낮을수록 밸런싱의 변화가 작으므로 미세조절이 가능하다. 물론 속성 밸런싱 중요도를 계산하지 않은 경우에는 무작위 또는 순서대로 속성값을 변화시킬 수 있다. 이와 같은 과정을 통해 프리셋조절부(120)는 게임 밸런싱 프리셋을 자동으로 조절한다.본 발명의 실시예에 따른 게임 밸런싱을 위한 런타임 게임 밸런싱 조절 방법은 도 3에 나타낸 바와 같이, 사용 [0047]자의 수준에 따른 게임 객체 속성의 프리셋을 설정하는 단계(S301)와, 사용자의 행동 패턴 또는 밸런싱 관련 속공개특허 10-2010-0104898-8-성(예컨대, 게임 클리어 시간 등)을 수집하는 단계(S303)와, 수집한 행동 패턴 또는 밸런싱 관련 속성을 이용하여 사용자의 수준을 판단하는 단계(S305)와, 판단한 사용자의 수준에 맞게 게임 객체 속성을 조절하는 단계(S307) 등을 포함한다.이와 같은 런타임 게임 밸런싱 조절 방법을 수행하는 런타임 게임 밸런싱 조절부(130)의 동작은 다음과 같다. [0048]런타임 게임 밸런싱 조절부(130)는 플레이어가 현재 게임에 대하여 초보자인지 숙련자인지, 게임 인터페이스 조 [0049]작이 익숙한지 등을 판단한다. 이와 같은 사용자의 수준 파악은 실시간으로 판단하며, 게임 플레이 초기에 수행하는 것이 바람직하나 게임이 어느 정도 진행 된 후에라도 가능하다.사용자의 수준을 파악하기 위해서는 여러 가지 방법이 있을 수 있다. [0050]첫 번째로 초기에 사용자의 행동 패턴을 몇 가지 테스트하여 그것으로 유추한다. 예를 들어 나이 많은 사용자가 [0051]마우스 더블 클릭이 미숙하다던 지, 반응이 느리다던 지, 키보드 조작이 미숙하다던 지 등의 게임 인터페이스의기본적인 조작 패턴에 대한 것을 미리 정의해 둘 수 있다. 또한 초보자들은 기획자가 미리 정의해두지 않은 방향으로 가고 미션을 클리어하는 데에 많은 시간을 들이기도 한다. 이러한 것들은 사용자의 수준을 판단하기 위한 여러 가지 실제 예이며 이러한 것들을 미리 스크립트 또는 프로그램 코드로 구현하여 수준 판단의 근거로 둘수 있다.두 번째 방법으로 각 수준에 따른 플레이어의 행동 패턴을 미리 학습해 두고 그 결과를 이용하는 것이다. 학습 [0052]이라 함은 플레이어의 행동 패턴을 저장해 두고 그 행동패턴을 신경망(neural network)이나 SVM(Support VectorMachine), 뉴로퍼지(neuro-fuzzy) 등 학습이 가능한 알고리즘을 이용하여 학습된 형태로 저장해 두고, 실시간으로 플레이어의 행동 패턴이 미리 학습된 패턴 중 어떤 수준과 가장 유사한지를 이용하여 파악하는 것이다.세 번째 방법으로 사용자의 수준을 파악하기 위한 미션(mission)을 두고 그 미션의 클리어 시간 및/또는 클리어 [0053]할 때의 사용자 행동 패턴을 보고 수준을 파악하고 그에 따라서 앞으로 진행할 게임에서의 밸런싱 설정에 참고하는 것이다.여러 가지 방법으로 사용자 수준을 판단하는 방법이 있을 수 있으며 기술한 세 가지 방법은 수준을 판단하는 방 [0054]법의 예시이다. 이처럼 사용자 수준에 따른 게임 객체 속성의 프리셋을 설정(S301)한 후에 사용자 행동 패턴을수집하며(S303), 수집한 사용자 행동 패턴을 토대로 사용자의 수준을 판단한다(S305).사용자의 수준은 간단하게는 상급, 중급, 하급으로 나눌 수 있으며, 더욱 자세하게 나눌 수도 있고, 예컨대 0에 [0055]서 1 사이의 실수값으로 사용자의 수준을 판단할 수도 있다.이렇게 사용자의 수준을 판단하고 나면 수준에 따른 밸런싱을 설정하게 된다. 밸런싱은 게임 객체 속성 조절(인 [0056]공지능의 조절 포함)에 의해서 결정된다(S307). 이는 플레이어의 수준에 따른 게임 객체 속성을 스크립트 또는데이터베이스 형태로 미리 정의해 두고 해당 플레이어의 수준이 판단되면 그에 맞게 선택하는 것이다. 앞에서설명한 게임 밸런싱 프리셋을 이용할 수도 있다.본 발명에 의한 게임 밸런싱을 위한 프리셋 조절 방법 및 런타임 게임 밸런싱 조절 방법은 컴퓨터 프로그램으로 [0057]작성 가능하다. 이 컴퓨터 프로그램을 구성하는 코드들 및 코드 세그먼트들은 당해 분야의 컴퓨터 프로그래머에의하여 용이하게 추론될 수 있다. 또한, 해당 컴퓨터 프로그램은 컴퓨터가 읽을 수 있는 정보저장매체(computerreadable media)에 저장되고, 컴퓨터에 의하여 읽혀지고 실행됨으로써 프리셋 조절 방법 및 런타임 게임 밸런싱조절 방법을 구현한다. 정보저장매체는 자기 기록매체, 광 기록매체 및 캐리어 웨이브 매체를 포함한다.지금까지 본 발명에 대하여 그 일부 실시예들을 중심으로 살펴보았다. 본 발명이 속하는 기술 분야에서 통상의 [0058]지식을 가진 자는 본 발명이 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 변형된 형태로 구현될 수 있음을 이해할 수 있을 것이다. 그러므로 개시된 실시예들은 한정적인 관점이 아니라 설명적인 관점에서 고려되어야 한다. 본 발명의 범위는 전술한 설명이 아니라 특허청구범위에 나타나 있으며, 그와 동등한 범위 내에 있는모든 차이점은 본 발명에 포함된 것으로 해석되어야 할 것이다.도면의 간단한 설명도 1은 본 발명의 실시예에 따른 게임 밸런싱을 위한 프리셋 조절 방법과 런타임 게임 밸런싱 조절 방법을 수행 [0059]공개특허 10-2010-0104898-9-할 수 있는 밸런싱 조절 장치의 블록 구성도,도 2는 본 발명의 실시예에 따른 게임 밸런싱을 위한 프리셋 조절 방법을 설명하기 위한 흐름도, [0060]도 3은 본 발명의 실시예에 따른 런타임 게임 밸런싱 조절 방법을 설명하기 위한 흐름도. [0061]<도면의 주요 부분에 대한 부호의 설명> [0062]110 : 게임 밸런싱 속성 계산부 [0063]120 : 프리셋 조절부 [0064]130 : 런타임 게임 밸런싱 조절부 [0065]도면 도면1공개특허 10-2010-0104898-10- 도면2공개특허 10-2010-0104898-11- 도면3공개특허 10-2010-0104898-12-"}
{"patent_id": "10-2009-0023608", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 게임 밸런싱을 위한 프리셋 조절 방법 및 런타임 게임 밸런싱 조절 방법에 관한 것으로, 밸런싱 프리 셋의 자동 조절이 가능하며, 게임 서비스 중에 사용자 수준에 따른 밸런싱 조절이 가능하도록 하여, 게임 개발 단계에서 밸런싱 조절을 자동화함으로써 밸런싱 조절에 따른 시간 및 비용을 절감하고, 기획자가 원하는 밸런싱 을 제공함으로써 게임 플레이어가 기획자의 의도대로 재미와 몰입감을 느끼면서 플레이할 수 있게 하며, 서비스 단계에서는 사용자 수준에 따른 밸런싱을 제공함으로써 사용자의 수준에 따라서 초급자가 게임을 시작할 때에 접 하는 어려움과 상급자가 플레이할 때 느끼는 지루함을 해소하는 이점이 있다."}
{"patent_id": "10-2009-0023608", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 게임 밸런싱을 위한 프리셋(preset) 조절 방법 및 런타임 게임 밸런싱 조절 방법에 관한 것으로서, 더욱 상세하게는 게임의 밸런싱을 위한 프리셋 조절의 자동화 방법과 게임 서비스 중에 사용자 수준에 따른 밸 런싱 조절의 자동화 방법에 관한 것이다. 본 발명은 지식경제부와 정보통신연구진흥원의 IT성장동력기술개발 사업의 일환으로 수행한 연구로부터 도출된 것이다[과제관리번호 : 2006-S-044-03, 과제명 : 멀티코아 CPU 및 MPU기반 크롯플랫폼 게임기술 개발]."}
{"patent_id": "10-2009-0023608", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "컴퓨터 게임에서 밸런싱(balancing), 즉 게임 객체 속성의 균형 조절은 게임 서비스에 있어서 중요한 요소 중의 하나이다. 플레이어와 컴퓨터 간에 주어진 미션(mission)을 해결하기 위해 플레이를 진행하는 방식인 미션 클리어 방식의 게임의 경우에 게임을 플레이(play)하는 도중에 플레이어(player)의 수준에 비하여 너무 쉬우면 게임 플레이 시 간이 짧아져서 흥미를 잃게 만들며, 너무 어려우면 게임 플레이 시간이 길어져 지루해지면서 몰입도가 반감된다. 또한, 플레이어와 플레이어간 경쟁을 통한 승패 게임의 경우에는 특정 속성을 가진 어느 한 쪽이 플레이어의 기 술이나 숙련도에 상관없이 우세하게 될 경우에 모두 다 그러한 속성을 사용하게 됨으로써 게임의 다양성이 무너 지게 되고 몰입도가 반감된다. 이렇게 게임의 몰입도에 중요한 역할을 하는 밸런싱이지만 종래에는 기획자 또는 개발자가 임의로 정하거나 많 은 게임 테스터를 통한 수작업을 통하여 조절하는 방식이 이용되고 있다."}
{"patent_id": "10-2009-0023608", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "발명의 내용 해결 하고자하는 과제 종래 기술에 따른 수작업을 통한 밸런싱은 많은 시간과 비용이 소요되면서도 수작업의 특성상 여전히 밸런싱 조 절에 실패하는 경우가 발생하는 문제점이 있었다. 본 발명은 이러한 종래 기술의 문제점을 해결하기 위해 제안한 것으로서, 게임의 밸런싱을 자동화함으로써 시간 및 비용을 줄이면서도 밸런싱 조절의 실패가 발생하지 않도록 한다. 이를 위해 게임 밸런싱의 프리셋을 조절하 는 방법과 플레이하는 사용자의 수준을 파악하여 그에 맞춰 밸런싱을 조절하는 방법을 제시함으로써, 밸런싱 프 리셋의 자동 조절이 가능하며, 게임 서비스 중에 사용자 수준에 따른 밸런싱 조절이 가능하다. 게임 개발 단계 에서 밸런싱 조절을 자동화함으로써 밸런싱 조절에 따른 시간 및 비용을 절감할 수 있고, 기획자가 원하는 밸런 싱을 제공함으로써 게임 플레이어가 기획자의 의도대로 재미와 몰입감을 느끼면서 플레이할 수 있게 한다. 서비 스 단계에서는 사용자 수준에 따른 밸런싱을 제공함으로써 사용자의 수준에 따라서 초급자가 게임을 시작할 때 에 접하는 어려움과 상급자가 플레이할 때 느끼는 지루함을 해소할 수 있다. 과제 해결수단 본 발명의 제 1 관점으로서 게임 밸런싱을 위한 프리셋 조절 방법은, 의도한 게임 밸런싱 속성값 및 속성 변화 크기를 설정하는 단계와, 상기 게임 밸런싱 속성값을 이용하여 게임을 플레이하는 단계와, 상기 게임의 플레이 후에 게임 밸런싱 결과요소를 계산하는 단계와, 상기 게임 밸런싱 속성값과 상기 게임 밸런싱 결과요소를 비교하는 단계와, 상기 비교의 결과에 따라 상기 속성 변화 크기에 의거하여 상기 게임 밸런싱 속성값을 조정하는 단계를 포함한다. 여기서, 상기 프리셋 조절 방법은, 게임 객체 밸런싱 속성의 중요도를 판단하는 단계를 더 포함하며, 상기 조정 하는 단계는, 판단한 상기 중요도에 따라 상기 게임 밸런싱 속성값을 조정한다. 상기 조정하는 단계는, 게임 밸런싱 속성 리스트 후보를 설정하는 단계와, 상기 게임 밸런싱 속성 리스트 후보 에 포함된 상기 게임 객체 밸런싱 속성을 조절하는 단계와, 상기 게임 밸런싱 결과 요소를 이용하여 밸런싱의 변화 정도를 측정하는 단계와, 측정한 상기 변화 정도에 따라서 상기 게임 객체 밸런싱 속성의 상기 중요도를 결정하는 단계를 포함한다. 상기 변화 정도를 측정하는 단계는, 미션 클리어 방식의 경우에 미션 클리어까지 걸리는 시간, 똑같은 행동을 반복하는 시간, 플레이어의 의견 중에서 적어도 어느 하나를 상기 게임 밸런싱 결과 요소로 이용한다. 상기 변화 정도를 측정하는 단계는, 플레이어와 플레이어간 경쟁을 통한 승패 게임의 경우에 승패 결정이 걸리 기까지 걸린 시간, 승패 확률, 승패 결정이 되었을 때 승자와 패자의 속성 차이, 플레이어의 의견 중에서 적어 도 어느 하나를 상기 게임 밸런싱 결과 요소로 이용한다. 상기 조정하는 단계는, 상기 게임 밸런싱 속성값을 상기 중요도에 따라서 중요한 것부터 변경한다. 상기 프리셋 조절 방법은, 상기 조정하는 단계의 수행 후에 상기 속성 변화 크기를 재설정하는 단계와, 상기 플 레이하는 단계와 상기 계산하는 단계 및 상기 비교하는 단계를 재수행하여 이 비교의 결과에 따라 상기 재설정 에 의한 상기 속성 변화 크기에 의거하여 상기 게임 밸런싱 속성값을 조정하는 단계를 포함한다. 본 발명의 제 2 관점으로서 게임 밸런싱을 위한 런타임 게임 밸런싱 조절 방법은, 사용자의 수준에 따른 게임 객체 속성의 프리셋을 설정하는 단계와, 상기 사용자의 행동 패턴 또는 상기 밸런싱 관련 속성을 수집하는 단계 와, 수집한 상기 행동 패턴 또는 밸런싱 관련 속성을 이용하여 사용자의 수준을 판단하는 단계와, 판단한 상기 사용자의 수준에 맞게 게임 객체 속성을 조절하는 단계를 포함한다. 여기서, 상기 판단하는 단계는, 미리 정의한 상기 행동 패턴으로 유추하며, 상기 미리 정의한 행동 패턴을 스크 립트 또는 프로그램 코드로 구현한다. 상기 판단하는 단계는, 각 수준에 따라 상기 행동 패턴을 학습한 결과와 상기 행동 패턴을 실시간으로 수집한 결과를 비교한다. 상기 판단하는 단계는, 상기 사용자의 수준을 파악하기 위한 미션을 두고 이 미션의 클리어 시간 또는 클리어 할 때의 상기 행동 패턴에 따라 상기 사용자의 수준을 판단한다. 효 과 본 발명에 의하면 밸런싱 프리셋을 자동 조절하며, 게임 서비스 중에 사용자 수준에 따라 밸런싱을 자동 조절한 다. 게임 개발 단계에서 밸런싱 조절을 자동화함으로써 밸런싱 조절에 따른 시간 및 비용을 절감하고, 기획자가 원하는 밸런싱을 제공함으로써 게임 플레이어가 기획자의 의도대로 재미와 몰입감을 느끼면서 플레이할 수 있게 한다. 서비스 단계에서는 사용자 수준에 따른 밸런싱을 제공함으로써 사용자의 수준에 따라서 초급자가 게임을 시작할 때에 접하는 어려움과 상급자가 플레이할 때 느끼는 지루함을 해소하는 효과가 있다. 발명의 실시를 위한 구체적인 내용 이하, 본 발명의 일부 실시예를 첨부된 도면들을 참조하여 상세히 설명한다. 아울러 본 발명을 설명함에 있어, 관련된 공지 구성 또는 기능에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명을 생략한다. 게임의 밸런싱 프리셋을 조절한다는 의미는 게임이 미리 정해진 사용자 수준(예 : 초급, 중급, 상급 등)을 기준 으로 너무 쉽거나 너무 어렵지 않고 기획자가 의도한 바와 같이 플레이 시간 및 난이도를 즐기면서 몰입감을 유 지할 수 있게 수준에 따른 객체 속성을 미리 설정하여 저장해 두는 것이다. 이를 위하여 게임 객체(object)의 속성(attribute)(게임 객체의 인공지능 포함)을 조절함으로써 밸런싱을 조절 하게 된다. 여기서 게임 객체라 함은 게임의 진행에 영향을 주는 모든 객체를 가리킨다. 예를 들어 블록격파 게 임의 경우에는 블록, 슈팅 게임의 경우에는 무기 아이템, 롤플레잉게임(Role Playing Game: RPG)의 경우에는 주 문 기술 등과 같이 게임 내부에서 진행하면서 조금이라도 진행에 영향을 줄 경우에 그것을 게임 객체라고 할 수 있다. 게임 진행에 영향을 미치지 않는 객체(예 : 화면 밝기, 소리 크기 등)는 이에 포함하지 않는다. 게임 객 체의 속성이라 함은 게임 객체에 부여된 성질을 뜻한다. 예를 들어 슈팅게임의 무기 피해도, HP(Hit Point) 등 이 이에 속한다. 특정 게임 객체에 적용되는 인공지능도 종류에 따라서 하나의 속성으로 간주될 수 있다. 어떤 것은 속성 하나만으로도(예 : 날씨, 시간 등) 게임에 영향을 줌으로써 게임 객체가 될 수 있다. 인공지능을 게임 객체의 형태로 사용할 경우에는 인공지능 알고리즘 종류(예 : Neural Network : 1, hFSM : 2 등) 또는 인공지능의 동작에 필요한 속성을 값의 형태(예 : Input Layer : 10개, Hidden Layer : 7개, Output Layer : 10개 등)로 표현하여 사용한다. 본 발명에서는 밸런싱 자동화를 위한 프리셋 조절 방법과 밸런싱 조절 방법을 제공한다. 즉 게임 속성 조절을 통하여 원하는 상태의 밸런싱이 되도록 프리셋을 조절하는 프리셋 조절 방법과 게임을 플레이하면서 사용자의 수준을 파악하고 그에 맞춰 밸런싱을 조절하는 밸런싱 조절 방법을 제시한다. 도 1은 본 발명의 실시예에 따른 게임 밸런싱을 위한 프리셋 조절 방법과 런타임 게임 밸런싱 조절 방법을 수행 할 수 있는 밸런싱 조절 장치의 블록 구성도이다. 이에 나타낸 바와 같이 본 발명을 위한 밸런싱 조절 장치는, 게임 객체의 밸런싱 속성 중요도를 계산하는 게임 밸런싱 속성 계산부와, 게임 속성 조절을 통하여 원하는 상태의 밸런싱이 되도록 프리셋을 조절하는 프리 셋 조절부와, 게임 서비스 도중 실시간으로 플레이어의 수준을 파악하고 그에 적합하게 밸런싱을 조절하는 런타임 게임 밸런싱 조절부 등을 포함한다. 이러한 게임 밸런싱 속성 계산부와 프리셋 조절부 및 런타임 게임 밸런싱 조절부는 API(Application Programming Interface) 형태로 구현되어 하나의 게임 어플리케이션 속에 포함될 수도 있고 외부에 별도의 어플리케이션으로 구현되어 플러그인 방식으로 동작할 수도 있다. 게임 객체 밸런싱 속성 중요도라 함은 게임 객체 속성 중 그 속성을 변화시켰을 때 밸런싱이 변화하는 정도를 뜻한다. 따라서 게임 밸런싱 속성 중요도가 큰 속성의 경우 다른 속성을 조절하는 것보다 그 속성값을 조절함으 로써 게임의 밸런싱이 크게 변하게 되고 따라서 밸런싱을 빠르게 잡아낼 수 있는 속성들이다. 한편, 도 1의 밸런싱 조절 장치 중에서 게임 밸런싱 속성 계산부를 제외하더라도 본 발명에 의해 밸런싱을 위한 속성을 자동으로 조절하는 결과를 도출할 수 있다. 즉 게임 객체 밸런싱 속성 중요도를 계산하지 않더라도 게임 밸런싱 조절을 위한 시간이 조금 더 소요될 뿐 마찬가지로 밸런싱을 위한 속성을 자동으로 조절할 수 있다. 게임 밸런싱의 변화 감지는 다음과 같은 방법으로 알아낸다. 플레이어와 컴퓨터 간에 주어진 과제(mission, quest)를 수행하기 위하여 플레이를 진행하는 미션 클리어 방식 의 게임의 경우에 밸런싱을 감지하는 요소로는 플레이어의 숙련도에 따라 미션 클리어까지 걸리는 시간, 똑같은 행동을 반복하는 시간, 플레이어의 의견 등이 있다. 플레이어와 플레이어간 경쟁을 통한 승패 게임의 경우에 밸런싱을 감지하는 요소로는 승패 결정이 걸리기까지 걸린 시간, 승패 확률, 승패 결정되었을 때 승자와 패자의 속성 차이(예를 들어, hit point의 차이), 플레이어 의 의견 등이 있다. 이러한 요소를 검사하여 밸런싱 결과 요소에 의한 값이 원래 의도했던 것과 다를 경우 밸런싱이 실패한 것이라 볼 수 있다. 그렇게 되면 게임의 재미가 반감되고, 해당 게임을 플레이하지 않게 된다. 따라서 의도된 밸런싱의 값이 되도록 유지하여야 한다.이하, 도 2 및 도 3을 추가로 참조하여 본 발명의 실시예에 따른 게임 밸런싱을 위한 프리셋 조절 방법 및 런타 임 게임 밸런싱 조절 방법에 대해 살펴보기로 한다. 본 발명의 실시예에 따른 게임 밸런싱을 위한 프리셋 조절 방법은 도 2에 나타낸 바와 같이, 게임 밸런싱 속성 리스트 후보를 설정하는 단계(S201)와, 설정한 게임 밸런싱 속성 리스트 후보에 포함된 게임 객체 밸런싱 속성 을 조절하는 단계(S203)와, 게임 밸런싱 결과 요소를 이용하여 밸런싱의 변화 정도를 측정하는 단계(S205)와, 측정한 변화 정도에 따라서 게임 객체 밸런싱 속성의 중요도를 결정하는 단계(S207)와, 의도한 게임 밸런싱 값 을 미리 설정하는 단계(S209)와, 중요도에 따라 게임 밸런싱 값을 변경해 가며 게임 밸런싱 결과요소와 비교하 는 단계(S211)와, 비교한 게임 밸런싱 값을 이용하여 게임 객체 밸런싱 속성을 조정하는 단계(S213) 등을 포함 한다. 먼저, 게임 밸런싱 속성 계산부의 동작은 다음과 같다. 게임 개발자는 게임 객체 밸런싱 속성이 될 수 있는 후보군(인공지능도 이에 포함된다)을 게임 밸런싱 속성 계 산부에 등록 및 설정하고 이를 조절(set, get)할 수 있도록 함수 인터페이스(예, SetHP(), GetHP() 등)를 제공한다(S201). 또한 플레이 후 앞서 언급한 밸런싱을 감지할 수 있는 요소(미션 클리어 시간, 승패 시간 등)를 게임 밸런싱 속성 계산부에게 보고할 수 있는 인터페이스를 제공한다. 게임 밸런싱 속성 계산부는 위에서 주어진 게임 속성 후보 리스트, 인터페이스를 이용하여 속성들을 조절 (S203)하면서 밸런싱의 변화 정도를 조사 및 측정한다(S205). 이 때, 속성값의 변화에 따른 밸런싱의 변화 정도 에 따라서 중요도가 결정된다. 특정 속성값을 변경시켰을 때 밸런싱 감지 요소들의 변화가 클 경우 그 속성의 밸런싱 중요도를 높게 판단하고 속성값을 변경시켰을 때 밸런싱 감지 요소들의 변화가 작을 경우 중요도를 낮게 판단한다(S207). 프리셋 조절부는 게임 밸런싱 속성 계산부에 의해 게임 밸런싱 속성 중요도가 계산되고 나면 게임 속 성 조절을 통하여 원하는 밸런싱 상태가 되도록 한다. 기획자 또는 개발자는 의도하는 최적 밸런싱 요소의 상태, 즉 의도한 게임 밸런싱 속성값을 프리셋 조절부(12 0)에게 인터페이스를 통하여 설정할 수 있으며, 단계 S217에서 이용하기 위해 속성 변화 크기의 초기값을 설정 할 수 있다(S209). 이렇게 설정된 게임 밸런싱 속성값에 의해 게임이 플레이된다. 그리고, 프리셋 조절부는 게임을 플레이(S211)한 후에 게임 밸런싱 결과요소를 계산하며(S213), 계산한 게 임 밸런싱 결과요소와 단계 S209에서 설정한 게임 밸런싱 속성값을 비교한다(S215). 단계 S215의 비교 결과, 게임 밸런싱 결과요소와 게임 밸런싱 속성값이 일치하면 게임 객체 밸런싱 속성값의 조 정을 수행하지 않고 종료하나, 게임 밸런싱 결과요소와 게임 밸런싱 속성값이 불일치하면 단계 S209에서 설정한 속성 변화 크기의 초기값에 의거하여 게임 밸런싱 속성값을 조정한다(S217). 다음으로, 단계 S217에서 게임 밸런싱 속성값의 조정을 위해 이용하는 속성 변화 크기를 재설정 한다. 즉, 속성 변화 크기를 줄인다(S219). 이후, 단계 S211, S213, S215, S217, S219를 재수행하는데, 이러한 재수행은 게임 밸런싱 결과요소와 게임 밸런 싱 속성값이 일치할 때까지 수행한다. 물론, 단계 S219를 재수행할 때에는 이전 과정에서 재설정한 속성 변화 크기 값을 이용하여 속성값을 조정한다. 속성 변화 크기 값은 초기에는 크게 설정하여 크게 밸런싱이 변화하도록 하며, 반복할수록 속성 변화 크기 값을 줄여서 점차 원하는 값으로 수렴되게 한다. 여기서, 단계 S207에서 게임 객체 밸런싱 속성 중요도를 판단한 경 우에는 게임 속성 밸런싱 중요도가 큰 것부터 먼저 바꾸어 가면서 최적 밸런싱이 되도록 조절하고, 그것으로 조 절할 수 없는 미세한 밸런싱 요소 차이는 중요도가 높은 순에서 낮은 순으로 속성값을 변화시켜가면서 줄여 나 간다. 속성 밸런싱 중요도가 낮을수록 밸런싱의 변화가 작으므로 미세조절이 가능하다. 물론 속성 밸런싱 중요 도를 계산하지 않은 경우에는 무작위 또는 순서대로 속성값을 변화시킬 수 있다. 이와 같은 과정을 통해 프리셋 조절부는 게임 밸런싱 프리셋을 자동으로 조절한다. 본 발명의 실시예에 따른 게임 밸런싱을 위한 런타임 게임 밸런싱 조절 방법은 도 3에 나타낸 바와 같이, 사용 자의 수준에 따른 게임 객체 속성의 프리셋을 설정하는 단계(S301)와, 사용자의 행동 패턴 또는 밸런싱 관련 속성(예컨대, 게임 클리어 시간 등)을 수집하는 단계(S303)와, 수집한 행동 패턴 또는 밸런싱 관련 속성을 이용하 여 사용자의 수준을 판단하는 단계(S305)와, 판단한 사용자의 수준에 맞게 게임 객체 속성을 조절하는 단계 (S307) 등을 포함한다. 이와 같은 런타임 게임 밸런싱 조절 방법을 수행하는 런타임 게임 밸런싱 조절부의 동작은 다음과 같다. 런타임 게임 밸런싱 조절부는 플레이어가 현재 게임에 대하여 초보자인지 숙련자인지, 게임 인터페이스 조 작이 익숙한지 등을 판단한다. 이와 같은 사용자의 수준 파악은 실시간으로 판단하며, 게임 플레이 초기에 수행 하는 것이 바람직하나 게임이 어느 정도 진행 된 후에라도 가능하다. 사용자의 수준을 파악하기 위해서는 여러 가지 방법이 있을 수 있다. 첫 번째로 초기에 사용자의 행동 패턴을 몇 가지 테스트하여 그것으로 유추한다. 예를 들어 나이 많은 사용자가 마우스 더블 클릭이 미숙하다던 지, 반응이 느리다던 지, 키보드 조작이 미숙하다던 지 등의 게임 인터페이스의 기본적인 조작 패턴에 대한 것을 미리 정의해 둘 수 있다. 또한 초보자들은 기획자가 미리 정의해두지 않은 방 향으로 가고 미션을 클리어하는 데에 많은 시간을 들이기도 한다. 이러한 것들은 사용자의 수준을 판단하기 위 한 여러 가지 실제 예이며 이러한 것들을 미리 스크립트 또는 프로그램 코드로 구현하여 수준 판단의 근거로 둘 수 있다. 두 번째 방법으로 각 수준에 따른 플레이어의 행동 패턴을 미리 학습해 두고 그 결과를 이용하는 것이다. 학습 이라 함은 플레이어의 행동 패턴을 저장해 두고 그 행동패턴을 신경망(neural network)이나 SVM(Support Vector Machine), 뉴로퍼지(neuro-fuzzy) 등 학습이 가능한 알고리즘을 이용하여 학습된 형태로 저장해 두고, 실시간으 로 플레이어의 행동 패턴이 미리 학습된 패턴 중 어떤 수준과 가장 유사한지를 이용하여 파악하는 것이다. 세 번째 방법으로 사용자의 수준을 파악하기 위한 미션(mission)을 두고 그 미션의 클리어 시간 및/또는 클리어 할 때의 사용자 행동 패턴을 보고 수준을 파악하고 그에 따라서 앞으로 진행할 게임에서의 밸런싱 설정에 참고 하는 것이다. 여러 가지 방법으로 사용자 수준을 판단하는 방법이 있을 수 있으며 기술한 세 가지 방법은 수준을 판단하는 방 법의 예시이다. 이처럼 사용자 수준에 따른 게임 객체 속성의 프리셋을 설정(S301)한 후에 사용자 행동 패턴을 수집하며(S303), 수집한 사용자 행동 패턴을 토대로 사용자의 수준을 판단한다(S305). 사용자의 수준은 간단하게는 상급, 중급, 하급으로 나눌 수 있으며, 더욱 자세하게 나눌 수도 있고, 예컨대 0에 서 1 사이의 실수값으로 사용자의 수준을 판단할 수도 있다. 이렇게 사용자의 수준을 판단하고 나면 수준에 따른 밸런싱을 설정하게 된다. 밸런싱은 게임 객체 속성 조절(인 공지능의 조절 포함)에 의해서 결정된다(S307). 이는 플레이어의 수준에 따른 게임 객체 속성을 스크립트 또는 데이터베이스 형태로 미리 정의해 두고 해당 플레이어의 수준이 판단되면 그에 맞게 선택하는 것이다. 앞에서 설명한 게임 밸런싱 프리셋을 이용할 수도 있다. 본 발명에 의한 게임 밸런싱을 위한 프리셋 조절 방법 및 런타임 게임 밸런싱 조절 방법은 컴퓨터 프로그램으로 작성 가능하다. 이 컴퓨터 프로그램을 구성하는 코드들 및 코드 세그먼트들은 당해 분야의 컴퓨터 프로그래머에 의하여 용이하게 추론될 수 있다. 또한, 해당 컴퓨터 프로그램은 컴퓨터가 읽을 수 있는 정보저장매체(computer readable media)에 저장되고, 컴퓨터에 의하여 읽혀지고 실행됨으로써 프리셋 조절 방법 및 런타임 게임 밸런싱 조절 방법을 구현한다. 정보저장매체는 자기 기록매체, 광 기록매체 및 캐리어 웨이브 매체를 포함한다. 지금까지 본 발명에 대하여 그 일부 실시예들을 중심으로 살펴보았다. 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자는 본 발명이 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 변형된 형태로 구현될 수 있 음을 이해할 수 있을 것이다. 그러므로 개시된 실시예들은 한정적인 관점이 아니라 설명적인 관점에서 고려되어 야 한다. 본 발명의 범위는 전술한 설명이 아니라 특허청구범위에 나타나 있으며, 그와 동등한 범위 내에 있는 모든 차이점은 본 발명에 포함된 것으로 해석되어야 할 것이다."}
