{"patent_id": "10-2021-0128686", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0045865", "출원번호": "10-2021-0128686", "발명의 명칭": "의료 영상에서 혈관 영역을 세그먼테이션하기 위한 방법 및 장치", "출원인": "주식회사 온택트헬스", "발명자": "하성민"}}
{"patent_id": "10-2021-0128686", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "의료 영상에서 혈관 영역을 결정하기 위한 방법에 있어서,상기 의료 영상을 획득하는 단계;상기 의료 영상에서 상기 혈관 영역에 대한 세그먼테이션(segmentation)을 수행함으로써 초기 세그먼테이션 결과를 생성하는 단계;상기 초기 세그먼테이션 결과에서 혈관의 적어도 하나의 끝점을 검출하는 단계; 및상기 적어도 하나의 끝점 및 혈관의 기하학적(geometric) 특성에 기반하여 누락된 혈관 영역을 복원하는 단계를포함하는 방법."}
{"patent_id": "10-2021-0128686", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 혈관의 기하학적 특성은, 하나의 점을 기준으로 방향 및 거리 별로 혈관이 존재할 수 있는 확률 값들을 지시하는 방법."}
{"patent_id": "10-2021-0128686", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,상기 누락된 혈관 영역을 복원하는 단계는,상기 적어도 하나의 끝점을 포함하는 패치 영상에 대해 추가 세그먼테이션을 수행하는 단계;상기 패치 영상에 대한 추가 세그먼테이션 결과 및 상기 혈관의 기하학적 특성을 결합함으로써 상기 혈관 영역을 연장하는 단계를 포함하는 방법."}
{"patent_id": "10-2021-0128686", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 3에 있어서,상기 혈관 영역을 연장하는 단계는,상기 적어도 하나의 끝점에 기반하여 혈류의 방향을 지시하는 벡터의 시작점을 결정하는 단계;상기 시작점에 기반하여 상기 벡터를 결정하는 단계;상기 혈관의 기하학적 특성을 나타내는 반원을 상기 벡터에 정렬하는 단계; 및상기 추가 세그먼테이션 결과에 포함되는 혈관 존재 확률 값들 및 상기 반원에 포함되는 확률 값들을 곱하는 단계를 포함하는 방법."}
{"patent_id": "10-2021-0128686", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 4에 있어서,공개특허 10-2023-0045865-3-상기 시작점은, 상기 적어도 하나의 끝점의 좌표들의 평균에 위치한 점을 포함하는 방법."}
{"patent_id": "10-2021-0128686", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 4에 있어서,상기 벡터는, 상기 시작점 및 하나의 다른점에 기반하여 결정되며,상기 다른점은, 상기 시작점으로부터 미리 정의된 거리에 위치한 점들의 좌표들의 평균에 위치한 점을포함하며,상기 거리는, 상기 혈관 영역을 경로로 하는 지오데식 거리(geodesic distance)를 포함하는 방법."}
{"patent_id": "10-2021-0128686", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 1에 있어서,상기 누락된 혈관 영역을 복원하는 단계는,복수의 말단부들 각각에 상기 혈관의 기하학적 특성을 나타내는 반원들을 배치하는 단계;복수의 반원들이 중첩되는 적어도 하나의 영역을 중심으로 패치 영상을 추출하는 단계; 및중첩에 관련된 반원들을 이용하여 상기 혈관 영역을 연장하는 단계를 포함하는 방법."}
{"patent_id": "10-2021-0128686", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 1에 있어서,상기 누락된 혈관 영역은, 패치 영상 추출, 상기 패치 영상에 대한 추가 세그먼테이션, 상기 혈관의 기하학적특성을 이용한 혈관 영역의 확장을 포함하는 동작들에 의해 복원되며,상기 동작들은, 상기 초기 세그먼테이션 결과에 포함되는 서브-세그먼트들(sub-segments)이 모두 연결될 때까지반복되는 방법."}
{"patent_id": "10-2021-0128686", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "의료 영상에서 혈관 영역을 결정하기 위한 장치에 있어서,상기 장치의 동작을 위한 명령어 집합을 저장하는 저장부; 및상기 저장부와 연결된 적어도 하나의 프로세서를 포함하며,상기 적어도 하나의 프로세서는, 상기 의료 영상을 획득하고,상기 의료 영상에서 상기 혈관 영역에 대한 세그먼테이션을 수행함으로써 초기 세그먼테이션 결과를 생성하고,상기 초기 세그먼테이션 결과에서 혈관의 적어도 하나의 끝점을 검출하고,상기 적어도 하나의 끝점 및 혈관의 기하학적 특성에 기반하여 누락된 혈관 영역을 복원하도록 제어하는 장치."}
{"patent_id": "10-2021-0128686", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "프로세서에 의해 동작되면 제1항 내지 제8항 중의 어느 한 항에 따른 방법을 실행하기 위해 매체에 저장된 프로그램.공개특허 10-2023-0045865-4-"}
{"patent_id": "10-2021-0128686", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 의료 영상에서 혈관 영역을 세그먼테이션하기 위한 것으로, 의료 영상에서 혈관 영역을 결정하기 위한 방법은, 상기 의료 영상을 획득하는 단계, 상기 의료 영상에서 상기 혈관 영역에 대한 세그먼테이션 (segmentation)을 수행함으로써 초기 세그먼테이션 결과를 생성하는 단계, 상기 초기 세그먼테이션 결과에서 혈 관의 적어도 하나의 끝점을 검출하는 단계, 및 상기 적어도 하나의 끝점 및 혈관의 기하학적(geometric) 특성에 기반하여 누락된 혈관 영역을 복원하는 단계를 포함할 수 있다."}
{"patent_id": "10-2021-0128686", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 영상에 대한 세그먼테이션(segmentation)에 관한 것으로, 특히, 의료 영상에서 혈관 영역을 세그먼테 이션하기 위한 방법 및 장치에 대한 것이다."}
{"patent_id": "10-2021-0128686", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "질병은 인간의 심신에 장애를 일으켜서 정상적인 기능을 저해하는 상태를 의미하는 것으로, 질병에 따라 인간은 고통을 받고 심지어 생을 유지하지 못할 수 있다. 따라서, 질병을 진단하고, 치료하고 나아가 예방하기 위한 다 양한 사회적 시스템 및 기술들이 인류의 역사와 함께 발전해왔다. 질병의 진단 및 치료에 있어서, 기술의 눈부 신 발전에 따라 다양한 도구들 및 방식들이 개발되어 왔지만, 아직까지, 종국적으로는 의사의 판단에 의존하고 있는 현실이다. 한편, 최근 인공지능(artificial intelligence, AI) 기술이 크게 발전하면서 다양한 분야에서 주목되고 있다. 특히, 방대한 양의 누적된 의료 데이터와, 영상 위주의 진단 데이터 등의 환경으로 인해, 의료 분야에 인공지능 알고리즘을 접목하려는 다양한 시도와 연구가 진행 중이다. 구체적으로, 질병을 진단, 예측하는 등 종래의 임상 적 판단에 머물러 있던 작업들을 인공지능 알고리즘을 이용하여 해결하려는 다양한 연구가 이루어지고 있다. 또 한, 진단 등을 위한 중간 과정으로서 의료 데이터를 처리하고 분석하는 작업을 인공지능 알고리즘을 이용하여 해결하려는 다양한 연구가 이루어지고 있다."}
{"patent_id": "10-2021-0128686", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 인공지능(artificial intelligence, AI) 알고리즘을 이용하여 혈관 촬영 영상으로부터 혈관 영역을 효과적으로 세그먼테이션하기 위한 방법 및 장치를 제공하기 위한 것이다. 본 발명은 초기 세그먼테이션에서 누락된 혈관 영역을 복원하기 위한 방법 및 장치를 제공하기 위한 것이다. 본 발명은 세그먼테이션된 혈관 영역을 말단부(end region)로부터 연장하기 위한 방법 및 장치를 제공하기 위한 것이다. 본 발명은 세그먼테이션에서 누락된 혈관 영역을 혈관의 기하학적(geometric) 특성에 기반하여 복원하기 위한 방법 및 장치를 제공하기 위한 것이다. 본 발명에서 이루고자 하는 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급하지 않은"}
{"patent_id": "10-2021-0128686", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "또 다른 기술적 과제들은 아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하 게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0128686", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시 예에 따른, 의료 영상에서 혈관 영역을 결정하기 위한 방법은, 상기 의료 영상을 획득하는 단계, 상기 의료 영상에서 상기 혈관 영역에 대한 세그먼테이션(segmentation)을 수행함으로써 초기 세그먼테이 션 결과를 생성하는 단계, 상기 초기 세그먼테이션 결과에서 혈관의 적어도 하나의 끝점을 검출하는 단계, 및 상기 적어도 하나의 끝점 및 혈관의 기하학적(geometric) 특성에 기반하여 누락된 혈관 영역을 복원하는 단계를 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 상기 혈관의 기하학적 특성은, 하나의 점을 기준으로 방향 및 거리 별로 혈관 이 존재할 수 있는 확률 값들을 지시할 수 있다. 본 발명의 일 실시 예에 따르면, 상기 누락된 혈관 영역을 복원하는 단계는, 상기 적어도 하나의 끝점을 포함하 는 영상의 일부에 대해 추가 세그먼테이션을 수행하는 단계, 상기 추가 세그먼테이션의 결과 및 상기 혈관의 기 하학적 특성을 결합함으로써 상기 혈관 영역을 연장하는 단계를 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 상기 혈관 영역을 연장하는 단계는, 상기 적어도 하나의 끝점에 기반하여 혈류 의 방향을 지시하는 벡터의 시작점을 결정하는 단계, 상기 시작점에 기반하여 상기 벡터를 결정하는 단계, 상기혈관의 기하학적 특성을 나타내는 반원을 상기 벡터에 정렬하는 단계, 및 상기 추가 세그먼테이션 결과에 포함 되는 혈관 존재 확률 값들 및 상기 반원에 포함되는 확률 값들을 곱하는 단계를 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 상기 시작점은, 상기 적어도 하나의 끝점의 좌표들의 평균에 위치한 점을 포함 할 수 있다. 본 발명의 일 실시 예에 따르면, 상기 벡터는, 상기 시작점 및 하나의 다른점(another point)에 기반하여 결정 되며, 상기 다른점은, 상기 시작점으로부터 미리 정의된 거리에 위치한 점들의 좌표들의 평균에 위치한 점을 포 함하며, 상기 거리는, 상기 혈관 영역을 경로로 하는 지오데식 거리(geodesic distance)를 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 상기 누락된 혈관 영역을 복원하는 단계는, 복수의 말단부들 각각에 상기 혈관 의 기하학적 특성을 나타내는 반원들을 배치하는 단계, 복수의 반원들이 중첩되는 적어도 하나의 영역을 중심으 로 패치 영상을 추출하는 단계, 및 중첩에 관련된 반원들을 이용하여 상기 혈관 영역을 연장하는 단계를 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 상기 누락된 혈관 영역은, 패치 영상 추출, 상기 패치 영상에 대한 추가 세그 먼테이션, 상기 혈관의 기하학적 특성을 이용한 혈관 영역의 확장을 포함하는 동작들에 의해 복원되며, 상기 동 작들은, 상기 초기 세그먼테이션 결과에 포함되는 서브-세그먼트들(sub-segments)이 모두 연결될 때까지 반복될 수 있다. 본 발명의 일 실시 예에 따른, 의료 영상에서 혈관 영역을 결정하기 위한 장치는, 상기 장치의 동작을 위한 명 령어 집합을 저장하는 저장부, 및 상기 저장부와 연결된 적어도 하나의 프로세서를 포함할 수 있다. 상기 적어 도 하나의 프로세서는, 상기 의료 영상을 획득하고, 상기 의료 영상에서 상기 혈관 영역에 대한 세그먼테이션을 수행함으로써 초기 세그먼테이션 결과를 생성하고, 상기 초기 세그먼테이션 결과에서 혈관의 적어도 하나의 끝 점을 검출하고, 상기 적어도 하나의 끝점 및 혈관의 기하학적 특성에 기반하여 누락된 혈관 영역을 복원하도록 제어할 수 있다. 본 발명의 일 실시 예에 따른, 매체에 저장된 프로그램은, 프로세서에 의해 동작되면 전술한 방법을 실행할 수 있다."}
{"patent_id": "10-2021-0128686", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "본 발명에 대하여 위에서 간략하게 요약된 특징들은 후술하는 본 발명의 상세한 설명의 예시적인 양상일 뿐이며, 본 발명의 범위를 제한하는 것은 아니다."}
{"patent_id": "10-2021-0128686", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 보다 정확하게 혈관 영역이 세그먼테이션(segmentation)될 수 있다. 본 발명에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효과들은"}
{"patent_id": "10-2021-0128686", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0128686", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 첨부한 도면을 참고로 하여 본 발명의 실시 예에 대하여 본 발명이 속하는 기술 분야에서 통상의 지 식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나, 본 발명은 여러 가지 상이한 형태로 구현 될 수 있으며 여기에서 설명하는 실시 예에 한정되지 않는다. 본 발명의 실시 예를 설명함에 있어서 공지 구성 또는 기능에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되는 경우에는 그에 대한 상세한 설명은 생략한다. 그리고, 도면에서 본 발명에 대한 설명과 관계없 는 부분은 생략하였으며, 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 본 발명은 영상에 대한 세그먼테이션(segmentation)에 관한 것으로, 구체적으로, 의료 영상에서 혈관 영역을 세 그먼테이션하기 위한 기술에 관한 것이다. 특히, 본 발명은 초기 세그먼테이션에서 누락된 혈관 영역을 복원하 기 위한 다양한 실시 예들을 제안한다. 도 1은 본 발명의 일 실시 예에 따른 시스템을 도시한다. 도 1을 참고하면, 시스템은 서비스 서버, 데이터 서버, 적어도 하나의 클라이언트 장치를 포함 한다. 서비스 서버는 인공지능 모델 기반의 서비스를 제공한다. 즉, 서비스 서버는 인공지능 모델을 이용하 여 학습 및 예측 동작을 수행한다. 서비스 서버는 네트워크를 통해 데이터 서버 또는 적어도 하나의 클라이언트 장치와 통신을 수행할 수 있다. 예를 들어, 서비스 서버는 데이터 서버로부터 인공 지능 모델을 훈련하기 위한 학습 데이터를 수신하고, 훈련을 수행할 수 있다. 서비스 서버는 적어도 하나 의 클라이언트 장치로부터 학습 및 예측(prediction) 동작에 필요한 데이터를 수신할 수 있다. 또한, 서비 스 서버는 적어도 하나의 클라이언트 장치에게 예측 결과에 대한 정보를 송신할 수 있다. 데이터 서버는 서비스 서버에 저장된 인공지능 모델의 훈련을 위한 학습 데이터를 제공한다. 다양한 실시 예들에 따라, 데이터 서버는 누구나 접근 가능한 공공 데이터를 제공하거나 또는 허가를 필요로 하는 데이터를 제공할 수 있다. 필요에 따라, 학습 데이터는 데이터 서버에 의해 또는 서비스 서버에 의해 전처리할 수 있다. 다른 실시 예에 따라, 데이터 서버는 생략될 수 있다. 이 경우, 서비스 서버는 외 부에서 훈련된 인공지능 모델을 사용하거나 또는 서비스 서버에 오프라인으로 학습 데이터가 제공될 수 있 다. 적어도 하나의 클라이언트 장치는 서비스 서버에 의해 운용되는 인공지능 모델에 관련된 데이터를 서 비스 서버와 송신 및 수신한다. 적어도 하나의 클라이언트 장치는 사용자에 의해 사용되는 장비이며, 사용자에 의해 입력되는 정보를 서비스 서버에게 송신하고, 서비스 서버로부터 수신되는 정보를 저장 하거나 사용자에게 제공(예: 표시)할 수 있다. 경우에 따라, 어느 하나의 클라이언트로부터 송신된 데이터에 기 반하여 예측 동작이 수행되고, 예측의 결과에 관련된 정보가 다른 클라이언트에게 제공될 수 있다. 적어도 하나 의 클라이언트 장치는 데스크탑 컴퓨터, 랩탑 컴퓨터, 스마트폰, 타블렛, 웨어러블 기기 등 다양한 형태의 컴퓨팅 장치일 수 있다. 도 1에 도시되지 아니하였으나, 시스템은 서비스 서버를 관리하기 위한 관리 장치를 더 포함할 수 있다. 관리 장치는 서비스를 관리하는 주체에 의해 사용되는 장치로서, 서비스 서버의 상태를 모니터링하거나, 서비스 서버의 설정을 제어한다. 관리 장치는 네트워크를 통해 서비스 서버에 접속하거나 또는 케이 블 연결을 통해 직접 연결될 수 있다. 관리 장치의 제어에 따라, 서비스 서버는 동작을 위한 파라미터를 설정할 수 있다.도 1을 참고하여 설명한 바와 같이, 서비스 서버, 데이터 서버, 적어도 하나의 클라이언트 장치 , 관리 장치 등이 네트워크를 통해 연결되고, 상호작용할 수 있다. 여기서, 네트워크는 유선 네트워크 및 무선 네트워크 중 적어도 하나를 포함할 수 있고, 셀룰러 네트워크, 근거리 네트워크, 광역 네트워크 중 어느 하나 또는 둘 이상의 조합으로 이루어질 수 있다. 예를 들어, 네트워크는 LAN(local area network), WLAN(wireless LAN), 블루투스(bluetooth), LTE(long term evolution), LTE-A(LTE-advanced), 5G(5th generation) 중 적어도 하나에 기반하여 구현될 수 있다. 도 2는 본 발명의 일 실시 예에 따른 질병 발생 가능성을 예측하는 장치의 구조를 도시한다. 도 2에 예시된 구 조는 도 1의 서비스 서버, 데이터 서버, 적어도 하나의 클라이언트 장치의 구조로 이해될 수 있 다. 도 2를 참고하면, 장치는, 통신부, 저장부, 제어부를 포함한다. 통신부는 네트워크에 접속하고, 다른 장치와 통신을 수행하기 위한 기능을 수행한다. 통신부는 유선 통신 및 무선 통신 중 적어도 하나를 지원할 수 있다. 통신을 위해, 통신부는 RF(radio frequency) 처리 회로, 디지털 데이터 처리 회로 중 적어도 하나를 포함할 수 있다. 경우에 따라, 통신부는 케이블을 연결 하기 위한 단자를 포함하는 구성요소로 이해될 수 있다. 통신부는 데이터, 신호를 송신 및 수신하기 위한 구성요소이므로, '송수신부(transceiver)'라 지칭될 수 있다. 저장부는 장치의 동작을 위해 필요한 데이터, 프로그램, 마이크로 코드, 명령어 집합, 어플리케이션 등을 저장한다. 저장부는 일시적 또는 비일시적 저장 매체로 구현될 수 있다. 또한, 저장부는 장치에 고정 되어 있거나, 또는 분리 가능한 형태로 구현될 수 있다. 예를 들어, 저장부는 콤팩트 플래시(compact flash, CF) 카드, SD(secure digital) 카드, 메모리 스틱(memory stick), 솔리드 스테이트 드라이브(solid- state drive; SSD) 및 마이크로(micro) SD 카드 등과 같은 낸드 플래시 메모리(NAND flash memory), 하드 디스 크 드라이브(hard disk drive; HDD) 등과 같은 마그네틱 컴퓨터 기억 장치 중 적어도 하나로 구현될 수 있다. 제어부는 장치의 전반적인 동작을 제어한다. 이를 위해, 제어부는 적어도 하나의 프로세서, 적어도 하나의 마이크로 프로세서 등을 포함할 수 있다. 제어부는 저장부에 저장된 프로그램을 실행하고, 통 신부를 통해 네트워크에 접속할 수 있다. 특히, 제어부는 후술하는 다양한 실시 예들에 따른 알고리 즘들을 수행하고, 후술하는 실시 예들에 따라 장치가 동작하도록 제어할 수 있다. 도 1 및 도 2를 참고하여 설명한 구조에 기반하여, 본 발명의 다양한 실시 예들에 따른 인공지능 알고리즘 기반 의 서비스가 제공될 수 있다. 여기서, 인공지능 알고리즘을 구현하기 위해 인공 신경망으로 이루어진 인공지능 모델이 사용될 수 있다. 인공 신경망의 구성 단위인 퍼셉트론(perceptron) 및 인공 신경망의 개념은 다음과 같 다. 퍼셉트론은 생물의 신경 세포를 모델링한 것으로서, 다수의 신호들을 입력으로 삼아 하나의 신호를 출력하는 구 조를 가진다. 도 3은 본 발명에 적용 가능한 인공지능 모델을 구성하는 퍼셉트론의 예를 도시한다. 도 3을 참고 하면, 퍼셉트론은 입력 값들(예: x1, x2, x3, …, xn) 각각 대하여 가중치들(302-1 내지 302-n)(예: w1j, w2j, w3j, …, wnj)을 곱한 후, 가중치 곱해진(weighted) 입력 값들을 변환 함수(transfer function)을 이용하여 합산한다. 합산 과정에서, 바이어스(bias) 값(예: bk)이 더해질 수 있다. 퍼셉트론은 변환 함수의 출력인 네트(net) 입력 값(예: netj)에 대하여 활성 함수(activation function)을 적용함으로써, 출력 값(예: o j)를 생성한다. 경우에 따라, 활성 함수은 임계치(예: θj)에 기반하여 동작할 수 있다. 활성 함수는 다양 하게 정의될 수 있다. 본 발명이 이에 제한되는 것은 아니나, 예를 들어, 활성 함수로서, 스텝 함수(step function), 시그모이드(sigmoid), Relu, Tanh 등이 사용될 수 있다. 도 3와 같은 퍼셉트론들이 나열되고, 레이어를 이룸으로써 인공 신경망이 설계될 수 있다. 도 4는 본 발명에 적 용 가능한 인공지능 모델을 구성하는 인공 신경망의 예를 도시한다. 도 4에서, 원으로 표현된 각 노드는 도 3의 퍼셉트론으로 이해될 수 있다. 도 4를 참고하면, 인공 신경망은 입력 레이어(input layer), 복수의 은닉 레이어(hidden layer)들(404a, 404b), 출력 레이어(output layer)를 포함한다. 예측을 수행하는 경우, 입력 레이어의 각 노드로 입력 데이터가 제공되면, 입력 데이터는 입력 레이어 , 은닉 레이어들(404a, 404b)을 이루는 퍼셉트론들에 의한 가중치 적용, 변환 함수 연산 및 활성 함수 연 산 등을 거쳐 출력 레이어까지 순전파(forward propagation)된다. 반대로, 훈련을 수행하는 경우, 출력 레 이어로부터 입력 레이어를 향한 역전파(backward propagation)를 통해 오차가 계산되고, 계산된 오차 에 따라 각 퍼셉트론에 정의된 가중치 값들이 갱신될 수 있다. 의료 데이터를 분석하는 작업은 질병의 진단 등을 위해 필수적이다. 예를 들어, 엑스레이, 초음파, CT(computerized tomography), MRI(magnetic resonance imaging), PET(positron emission tomography), SPET(single photon emission computed tomography) 등 다양한 형태의 의료 영상들이 분석의 대상이 될 수 있 다. 최근 인공지능 기술이 의료 영상을 분석하는데 널리 사용되고 있는데, 분석을 위해 영상에서 원하는 부분의 영역을 추출하는 세그먼테이션 기술이 흔히 사용된다. 본 발명에 따른 의료 영상에서 혈관 영역을 세그먼테이션하기 위한 방법 또는 이를 위한 장치는 예를 들어, 동 맥경화성 질환, 관상동맥질환 (coronary artery disease), 뇌혈관질환, 신혈관질환, 또는 말초혈관질환 (peripheral vascular disease, PVD) 등의 동맥 관련 질환, 거대세포 동맥염, 다카야수씨 동맥염, 가와사키병, 결절다발성 혈관염 동맥류 또는 동맥박리 등의 혈관염, 정맥류, 혈전정맥염 또는 정맥혈전증 등의 정맥 관련 질 환 중 하나의 검출, 검사 및 시술을 위해 사용될 수 있다. 예를 들어, 본 발명에 따른 의료 영상에서 혈관 영역 을 세그먼테이션하기 위한 방법 또는 이를 위한 장치는 혈관 형성술(angioplasty), 동맥류, 협심증(가슴 조임증), 대동맥 협착, 대동맥염, 부정맥, 동맥경화증, 동맥염, 죽상동맥경화증, 경동맥 질환, 대동맥의 축착, 관상 동맥 질환, 아이젠멩거 증후군(Eisenmenger's Syndrome), 색전증, 고혈압, 저혈압, 특발성 영아 동맥 석회 화, 가와사키병 (점막피부성 림프절 증후군, 점막피부성 림프절 질환, 영아 다발성동맥염), 대사 증후군, 미세 혈관 협심증, 결절성 동맥주위염(다발성동맥염, 결절성 다발성동맥염), 말초 혈관 질환, 중증 사지 허혈, 당뇨 병성 혈관병증, 정맥염, 폐동맥판 협착(폐 협착), 신동맥 협착, 신혈관성 고혈압, 무증상성 허혈, 타까야수동맥 염 (Takayasu's Arteritis), 팔로 사징후(Tetralogy of Fallot), 대혈관 전위증, 동맥 줄기, 정맥류성 궤양, 정맥류, 혈관염, 태아 좌심실 동맥류(Fetal left ventricular aneurysm), 신생아 뇌출혈, 쌍태아간 수혈 증후 군(Twin.twin transfusion syndrome), 태반 혈류 장애, 거미막하 출혈, 뇌내출혈, 기타 비외상성 두개내 출혈, 뇌경색증, 뇌전동맥의 폐쇄와 협착 또는 대뇌동맥의 폐쇄와 협착 중 하나의 검출, 검사 및 시술을 위해 사용될 수 있다. 또한, 본 발명에 따른 의료 영상에서 혈관 영역을 세그먼테이션하기 위한 방법 또는 이를 위한 장치는 기존 혈 관으로부터 새로운 혈관의 증식을 포함하는 생리 과정인 혈관형성(Angiogenesis)에 대한 검출, 검사 또는 시술 을 위해 사용될 수 있다. 상기한 혈관형성은 성장 및 발달에서뿐만 아니라, 상처 치유에서 정상적인 과정이다. 이는 또한, 잠재 상태에서 악성 상태로의 종양 전이에 있어서 기본 단계이기도 하다. 본 발명의 의료 영상에서 혈관 영역을 세그먼테이션하기 위한 방법 또는 이를 위한 장치를 통해, 세그멘테이션 시 영상에서 끊어져버린 혈관 또는 상기한 질환에 의해 영상에서 끊기거나 변형된 혈관을 처리하는 방법은 하기와 같다. 특히, 현 시대에 많은 사망의 원인이 되는 질병의 일 예로 관상 동맥 질환(coronary artery disease, CAD)이 있 다. 관상 동맥의 검사를 위해, 2차원 엑스레이 혈관 촬영(angiography) 영상화(imaging)가 주된(primary) 영상 화 방식(modality)으로 취급된다. 2차원 엑스레이 영상들로부터, 가치있는 의료 정보, 예를 들어, 관상 동맥 지 름, 혈류 속도 등이 진단을 위해 추출될 수 있다. 또한, 3차원 CT 영상에 2차원 엑스레이 영상을 등록함으로써, 2차원 엑스레이 영상들은 절차 안내를 위한 영상 기반의 보조 시스템의 구현을 위해 사용될 수도 있다. 나아가, 최근, 2차원 엑스레이 영상들로부터 부분적 예비 유량(fractoinal flow reserve)을 측정하기 위한 압력 값을 획 득하기 위해, CFD(computational fluid dynamics)가 적용되고 있다. 이러한 의학적 응용의 결과는 2차원 엑스 레이 영상들에서 관상 동맥에 대한 세그먼테이션의 성능에 크게 의존한다. 엑스레이 혈관 촬영 영상으로부터의 관상 동맥에 대한 세그먼테이션은 많은 어플리케이션들에서 기본적 단계에 해당한다. 그러나, 관상 동맥의 구조가 엑스레이 영상들에서 길고(elongated) 복잡한(complex) 트리 구조와 같 이 나타나기 때문에, 세그먼테이션 작업(task)은 어려움을 갖는다. 관상 동맥 질환을 가진 환자의 관상 동맥은 혈류를 방해하는 다양한 종류의 플라크(plaques)를 가지며, 관상 동맥 허혈(coronary ischemia)을 야기할 수 있 다. 혈류(bloodstream)에 조영제(contrast agent)를 투입함으로써, 차단된 영역의 위치를 확인하고, 관상 동맥 에 대한 영상의 강도를 강화할 수 있다. 그러나, 조영제의 투입은 엑스레이 영상에서, 누락된 동맥의 부분들로 인해, 관상 동맥이 조각나게(fragmented) 보여지는 것을 야기할 수 있다. 나아가, 심장 움직임(cardiac motion artifact), 영상 잡음, 관상 동맥 질병은 관상 동맥의 세그먼테이션을 더욱 어렵게 한다. 결론적으로, 영상 처리 알고리즘에 의해 세그먼테이션된 관상 동맥은 몇몇 조각난 부분들을 포함할 수 있다. 조각난 부분들을 포함하는 세그먼테이션 결과의 일 예는 도 5와 같다. 도 5는 의료 영상으로부터 세그먼테이션 된 혈관 영역의 일 예를 도시한다. 도 5에서, 흰색으로 표현된 영역이 혈관 영역을 지시하는 마스크(mask)이다. 도 5를 참고하면, 원본 영상으로부터 오류 없이 추출된 혈관 영역은 GT(ground truth) 영상과 같다. 하지만, 전술한 원인들에 의해, 출력 영상은 깨어진 부분들을 포함할 수 있다. 즉, 세그먼테이션 작업에 의해 생성된 마스크는 누락된(missing) 부분들을 포함한다. 이에 따라, 본 발명은 의료 영상으로부터 혈관(예: 관상 동맥 등)에 대응하는 영상의 일부(이하 '혈관 영역'이 라 칭함)를 추출하기 위한 방안을 제안한다. 다시 말해, 본 발명은 의료 영상으로부터 혈관 영역을 효과적으로 세그먼테이션하기 위한 다양한 실시 예들을 제시한다. 구체적으로, 본 발명은 분리된 부분들을 재연결 (reconnecting)함으로써 보다 혈관 영역을 추출하는 강건한 세그먼테이션 기술을 제시한다. 다양한 실시 예들에 따르면, 재연결 동작은 더 높은 확률로 누락된 영역(missing region)들을 도출하는 심층 신 경 망 기반 프레임워크에 기반한다. 여기서, 프레임워크는 글로벌(global) 및 로컬(local) 우도(likelihood) 함 수 및 기하학적 선험 확률 함수(geometric prior function)를 포함할 수 있다. 위와 같은 프레임워크에 기반한 세그먼테이션의 개념은 이하 도 6과 같다. 도 6은 본 발명의 일 실시 예에 따른 세그먼테이션의 개념을 도시한다. 도 6을 참고하면, 의료 영상을 포함하는 입력 데이터(예: 심장 엑스레이 영상)로부터 글로벌 특징(feature)를 추출하는 함수에 의해 초기(initial) 세그먼테이션 결과가 획득된다. 초기 세그먼테이션 결과에 포함된 마스크에서 혈관의 끝부분(tip point) 및 혈류의 방향이 검출된다. 이후, 재연결을 위한 후보 영역을 선택하기 위해, 혈관의 로컬 작용 (local behavior)을 표현하는 확률 분포 함수가 검출된 끝부분에서의 기하학적 선험 확률(geometric priors)로서 반원(semicircle) 내에 맵핑된다. 기하학적 선험 확률이 서로 중첩되는 영역이 후보 영역으로서 선택되고, 후보 영역에 대응되는 패치 (patch)에 대하여 혈관의 존재 확률 정보을 생성하기 위한 로컬 함수가 적용된다. 즉, 글로벌 함수의 출력에서 누락된 조각(fragments)에 대한 보상을 위한 후보 영역에서 보조적인 영상 분석 알고리즘(예: CNN)에 의해 지역적(local) 혈관 존재(vesselness) 확률이 얻어진다. 이후, 혈관의 존재 확률 정보 및 확률 분포 함수가 결합된다. 이에 따라 보강된 혈관 존재 확률이 제공되고, 초기 세그먼테이션 결과 대비 혈관 의 말단부가 연장된 출력 데이터가 생성된다. 이러한 일련의 동작들은, 결과가 수렴할때까지, 반복적으로 수행될 수 있다. 도 7은 본 발명의 일 실시 예에 따라 영상으로부터 혈관 영역을 세그먼테이션하는 절차의 예를 도시한다. 도 7 은 인공지능 모델을 이용하여 세그먼테이션을 수행하는 절차로서, 연산 능력을 가진 장치(예: 도 1의 서비스 서 버)의 동작 방법을 예시한다. 도 7을 참고하면, S701 단계에서, 장치는 혈관을 포함하는 영상을 획득한다. 혈관을 포함하는 영상은 대상자의 인체를 촬영함으로써 생성되며, 혈관을 나타내는 픽셀들, 혈관 외 주변의 다른 장기를 나타내는 픽셀들을 포함 할 수 있다. 예를 들어, 영상은 네트워크를 통해 수신될 수 있으며, 저장 장치로부터 또는 촬영 장비로부터 실 시간으로 수신될 수 있다. S703 단계에서, 장치는 영상에서 혈관 영역에 대한 세그먼테이션을 수행한다. 다시 말해, 장치는 영상에서 혈관 을 나타내는 픽셀들의 위치를 결정하고, 결정된 픽셀들의 위치를 지시하는 마스크를 생성할 수 있다. 세그먼테 이션을 위해, 장치는 훈련된 인공지능 모델을 이용할 수 있다. 예를 들어, 장치는 인공지능 모델에 의해 예측된 영상의 글로벌 특징에 기반하여 세그먼테이션을 수행될 수 있다. 글로벌 특징은 영상 내에서 픽셀 별 혈관 존재 확률을 포함할 수 있다. 이에 따라, 세그먼테이션 결과를 표현하는 이미지에 포함된 픽셀들 각각은 0 내지 1 사 이의 실수로 표현되는 확률 값을 가질 수 있다. S705 단계에서, 장치는 혈관의 적어도 하나의 끝점을 검출한다. 장치는 세그먼테이션의 결과에서 혈관의 말단부 (end region)를 지시하는 적어도 하나의 끝점을 검출할 수 있다. 혈관의 끝점이 존재하는 말단부는 비-말단부와 형태적 차이를 가진다. 따라서, 장치는 형태적 특징에 기반하여 적어도 하나의 혈관의 말단부를 검출하고, 적어 도 하나의 말단부에서 적어도 하나의 끝점을 결정할 수 있다.S707 단계에서, 장치는 혈관의 기하학적 특성에 기반하여 누락된 혈관 영역을 복원한다. 여기서, 혈관의 기하학 적 특성은 혈관의 진행 방향에 대한 확률 분포를 포함할 수 있다. 일 실시 예에 따라, 장치는 혈류의 방향을 추 정하고, 혈류의 방향 및 미리 정의된 혈관의 기하학적 특성에 대한 정보에 기반하여 혈관이 뻗어나아갈 수 있는 방향의 확률 분포를 확인하고, 확인된 확률 분포에 따라 혈관의 말단부로부터에서 혈관 영역을 연장할 수 있다. 예를 들어, 장치는 말단부를 포함하는 영상의 일부에 대한 추가 세그먼테이션을 수행하고, 추가 세그먼테이션 결과 및 혈관의 기하학적 특성을 결합함으로써 혈관 영역을 연장할 수 있다. 도 7을 참고하여 설명한 실시 예와 같이, 영상에 대한 세그먼테이션 결과에서 누락된 혈관 영역이 복원될 수 있 다. 이때, 전체 영상에 대한 세그먼테이션에 의해 얻어지는 혈관 영역은 복수의 서브-세그먼트들(sub- segments)을 포함할 수 있고, 이는 누락된 부분(missing part)의 존재를 암시하는 것으로 이해될 수 있다. 따라 서, 세그먼테이션의 결과가 복수의 서브-세그먼트들을 포함하지 아니하는 경우, 즉, 하나의 세그먼트로 혈관 영 역이 표현되는 경우, 누락된 부분이 없는 것으로 해석될 여지가 있다. 따라서, 다른 실시 예에 따라, 장치는 초 기 세그먼테이션에 의해 얻어진 혈관 영역이 단일 세그먼트로 구성되어 있는지 여부를 확인하고, 복수의 서브- 세그먼트들이 확인되는 경우, 혈관 영역의 복원을 위한 동작들(예: S705 단계, S707 단계의 동작들)을 수행할 수 있다. 혈관 영역의 복원을 위한 동작들은 반복적으로(iteratively) 수행되며, 반복(iteration)은 복수의 서 브-세그먼트들이 발생하지 아니하는 경우, 즉, 혈관 영역의 연장에 의해 복수의 서브-세그먼트들이 모두 연결되 는 경우에 중단될 수 있다. 도 8은 본 발명의 일 실시 예에 따라 세그먼테이션된 혈관 영역에서 혈관의 끝점 및 혈류 방향을 검출하는 절차 의 예를 도시한다. 도 8은 연산 능력을 가진 장치(예: 도 1의 서비스 서버)의 동작 방법을 예시한다. 도 8을 참고하면, S801 단계에서, 장치는 세그먼테이션 결과에서 영상 조각(fragmentation)들을 추출한다. 여기 서, 영상 조각들 각각은 혈관의 끝점을 검출하기 위해 인공지능 모델에 입력되는 데이터로서, 영상 조각들 각각 은 혈관 영역을 지시하는 마스크 중 적어도 일부를 포함하도록 추출된다. 본 S801 단계의 동작은 끝점을 검출하 기 위해 사용되는 인공지능 모델의 입력 레이어의 구조에 따른 것으로서, 경우에 따라 생략될 수 있다. S803 단계에서, 장치는 영상 조각들에 포함된 적어도 하나의 끝점을 검출한다. 여기서, 끝점은 세그먼테이션된 혈관 영역 내에 위치하는 혈관의 말단부의 경계에 위치하는 픽셀을 의미한다. 장치는 훈련된 인공지능 모델에 영상 조각들 각각을 입력 데이터로서 입력하고, 출력되는 특징 데이터에 기반하여 적어도 하나의 끝점을 검출할 수 있다. 즉, 인공지능 모델은 영상 조각들에서 특징 데이터를 생성하고, 특징 데이터에 기반하여 어느 픽셀들 이 혈관의 말단부를 나타내는지 분류할 수 있다. 예를 들어, 훈련된 인공지능 모델은 CNN 기반의 네트워크를 포 함할 수 있다. S805 단계에서, 장치는 적어도 하나의 끝점에 기반하여 혈류의 방향을 추정한다. 일 실시 예에 따라, 장치는 적 어도 하나의 끝점에 기반하여 혈류의 방향을 나타내는 벡터의 시작점을 결정하고, 시작점으로부터 혈관의 말단 부를 향해 혈류의 방향을 추정할 수 있다. 방향을 결정하기 위해, 적어도 2개의 점들의 결정이 요구된다. 2개의 점들을 결정하는 경우, 2개의 점들 중 하나는 검출된 시작점이며, 나머지 하나의 다른점은 혈관 영역의 내부에 서 끝점으로부터 약간 떨어진(slightly further away) 위치에 존재할 수 있다. 일 실시 예에 따라, 장치는 혈관 영역 내부에서 다른점을 결정하고, 시작점 및 다른점을 잇는 벡터를 혈류의 방향으로 결정할 수 있다. 즉, 다른 점을 선택하기 위해, 장치는 미리 정의된 범위 내에서 시작점으로부터의 지오데식 거리(geodesic distance)를 영역 확장(region growing) 기법을 이용하여 계산할 수 있다. 여기서, 지오데식 거리(geodesic distance)는 그 래프에서의 두 정점들이 놓여있는 평면 또는 공간을 따라 하나의 정점에서 다른 정점으로 이동하기 위한 최단 거리를 의미한다. 도 8을 참고하여 설명한 실시 예에 따라, 세그먼테이션된 혈관 영역에서 적어도 하나의 끝점이 검출되고, 적어 도 하나의 끝점에서의 혈류의 방향이 추정될 수 있다. 검출된 끝점 및 혈류의 방향의 보다 구체적인 예는 이하 도 9와 같다. 도 9는 본 발명의 일 실시 예에 따른 혈관의 끝점 검출의 예를 도시한다. 도 9에서, 세그먼테이션 결과는 바이 너리 마스크로 예시되었다. 하지만, 바이너리 마스크는 설명의 편의를 위한 것이며, 세그먼테이션 결과를 나타내는 이미지는, 바이너리 이미지가 아니라, 각 픽셀의 값이 0 내지 1 사이의 확률 값에 대응하는 이미지일 수 있다. 도 9를 참고하면, 세그먼테이션 결과에서 영상 조각이 추출되고, 영상 조각에서 끝점 검출 연산 이 수행된다. 이에 따라, 복수의 끝점들이 검출된다. 구체적으로, 영상 조각에서, 3개의 말단부들(952a, 952b, 952c)이 검출되었다. 3개의 말단부들(952a, 952b, 952c)를 구성하는 끝점들(예: 빨간색으로 표시된 픽셀 들)에 기반하여, 시작점들 p1 및 p2가 결정된다. 일 실시 예에 따라, 장치는 해당 말단부에서 검출된 끝점들의 좌표들의 평균에 위치한 점을 시작점으로 결정할 수 있다. 일 실시 예에 따라, 끝점들을 검출하기 위해, 훈련된 CNN 기반 인공지능 모델이 사용될 수 있다. 끝점들을 검출 하기 위한 인공지능 모델은 혈관 영역의 지역적 바이너리 패턴(local binary pattern)들을 이용하여 훈련될 수 있다. 예를 들어, 인공지능 모델은 20×20 크기의 입력 이미지를 수용하며, 64개 채널들 및 128개 채널들을 가 지는 2개의 컨볼루션 계층들(convolution layers)을 포함하고, 바이너리 분류를 위한 1024개 뉴런들, 256개 뉴 런들, 2개 뉴런들을 가진 완전 연결된 계층들(fully connected layers)을 포함할 수 있다. 따라서, 끝점을 검출 하기 위해, 장치는 패치 영상을 임계치를 이용하여 바이너리 마스크로 변환하고, 훈련된 인공지능 모델을 이용 하여 바이너리 마스크로부터 적어도 하나의 끝점을 검출할 수 있다. 또한, 도 9와 같이, 시작점들 p1 및 p2로부터 혈류의 방향을 나타내는 벡터들 및 이 결정될 수 있다. 벡 터들 및 를 결정하기 위해, 장치는 시작점 외 다른점을 결정한다. 일 실시 예에 따라, 장치는 시작점으 로부터 미리 정의된 거리 만큼 떨어진 점들 중 혈관 내부에 위치하는 점들을 식별한다. 여기서, 고려되는 거리 는 혈관 영역을 경로로 하는 지오데식 거리일 수 있다. 그리고, 장치는 식별된 점들에 기반하여 다른점을 선택 하고, 시작점 및 다른점을 잇는 벡터(예: , 등)를 혈류의 방향으로서 결정할 수 있다. 일 실시 예에 따 라, 장치는 식별된 점들의 좌표들의 평균에 존재하는 점을 다른점으로 결정할 수 있다. 도 10은 본 발명의 일 실시 예에 따라 세그먼테이션된 혈관 영역에서 누락된 부분을 복원하는 절차의 예를 도시 한다. 도 10은 연산 능력을 가진 장치(예: 도 1의 서비스 서버)의 동작 방법을 예시한다. 이하 도 10의 절 차는 하나의 패치 영상에 대한 동작들로 이해될 수 있으며, 복수의 패치 영상들이 추출되는 경우, 이하 도 10의 절차가 각 패치 영상에 대해 수행될 수 있다. 도 10을 참고하면, S1001 단계에서, 장치는 혈관의 말단부를 포함하는 패치 영상을 추출한다. 이를 위해, 장치 는 검출된 적어도 하나의 끝점을 중심으로 미리 정의된 크기만큼의 영역을 특정하고, 특정된 영역 내의 픽셀들 을 추출할 수 있다. 이에 따라, 패치 영상은 말단부를 포함할 수 있다. S1003 단계에서, 장치는 패치 영상 내에서 혈관 존재 확률(vesselness porbailities) 정보를 생성한다. 혈관 존 재 확률 정보는 패치 영상 내의 픽셀들 각각이 혈관 영역에 포함될 확률 값들을 포함한다. 혈관 존재 확률 정보 는 패치 영상와 동일한 크기의 영상 형태를 가지며, 픽셀 값을 이용하여 확률 값을 표현한다. 즉, 패치 영상의 (n,m) 위치의 픽셀이 혈관 영역에 포함될 확률은 혈관 존재 확률 정보를 나타내는 영상의 (n,m) 위치의 픽셀 값 에 의해 표현된다. 예를 들어, 혈관 존재 확률 정보는 세그먼테이션에 의해 생성될 수 있다. S1005 단계에서, 장치는 혈관 존재 확률 정보 및 혈관의 기하학적 특성 정보에 기반하여 혈관 영역을 연장한다. 여기서, 혈관의 기하학적 특성 정보는 미리 정의되며, 하나의 점을 기준으로 방향 및 거리 별로 혈관이 존재할 수 있는 확률 값들을 포함한다. 일 실시 예에 따라, 장치는 혈관 존재 확률 정보 및 혈관의 기하학적 특성 정보 를 결합함으로써 혈관 존재 확률 정보를 강화하고, 강화된 혈관 존재 확률 정보에 기반하여 혈관 영역을 연장할 수 있다. 예를 들어, 장치는 강화된 혈관 존재 확률 정보에서 임계치 이상의 확률 값을 가지는 적어도 하나의 픽셀을 혈관 영역에 포함시킴으로써 혈관 영역을 확장할 수 있다. 혈관 존재 확률 정보 및 혈관의 기하학적 특 성 정보를 결합하기 위해, 장치는 혈관의 기하학적 특성 정보를 혈류 방향에 정렬시키고, 정렬된 상태에서 동일 위치에 놓여진 혈관 존재 확률 정보의 확률 값 및 혈관의 기하학적 특성 정보의 확률 값을 곱할 수 있다. 도 10을 참고하여 설명한 바와 같이, 혈관의 기하학적 특성 정보에 기반하여 혈관 영역이 확장될 수 있다. 일 실시 예에 따라, 혈관의 기하학적 특성 정보는 도 11과 같이 정의될 수 있다. 도 11은 본 발명의 일 실시 예에 따른 누락된 부분을 복원하기 위해 사용되는 혈관의 기하학적 특성 정보의 예를 도시한다. 도 11은SIG(symmetric inverse Gaussion) 함수 형태의 기하학적 특성 정보를 예시한다. 도 11을 참고하면, 혈관의 기 하학적 특성 정보는 SIG 함수(1140a)의 형태로 정의될 수 있다. 예를 들어, SIG 함수(1140a)는 이하 [수학식 1]과 같이 정의될 수 있다. 수학식 1"}
{"patent_id": "10-2021-0128686", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "[수학식 1]에서, 는 평균(mean) μ 및 모양 파라미터(shape parameter) λ를 가지는 θ에 대한 SIG 함수, λ 및 Δx는 모양 파라미터, θ는 변수, μ는 평균을 의미한다. SIG 함수(1140a)의 대칭이 되는 중심 축은 혈류의 방향을 나타내는 벡터에 대응된다. SIG 함수(1140a)는 혈관 존재 확률 정보와 결합되기 위해 반원(semicircle)(1140b) 형태로 표현될 수 있다. 반원(1140b)은 각도 히스토 그램(angle histogram)이며, 이하 [수학식 2]와 같이 정의될 수 있다. 수학식 2"}
{"patent_id": "10-2021-0128686", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "[수학식 2]에서, Ψ(k)는 공간적 반원 영역(spatial semicircle domain), ρ는 반원의 반지름에 관련된 변수를 의미한다. 반원(1140b)은 혈류 방향 벡터의 방향으로 끝 점에 배치되고, 혈관 영역을 연장하기 위해 사용된다. 예를 들어, 반원(1140b) 형태로 표현된 혈관의 기하학적 특성 정보는 이하 도 12과 같이 활용될 수 있다. 도 12는 본 발명의 일 실시 예에 따른 누락된 혈관 영역의 복원의 예를 도시한다. 도 12를 참고하면, 영상 조각 에서 확인된 끝점들(1262a, 1262b)에 혈관의 기하학적 특성 정보를 나타내는 반원들(1264a, 1264b)이 혈 류 방향을 중심으로 배치된다. 그리고, 패치 영상에서 생성된 혈관 존재 확률 정보에서 끝점들(1262a, 1262b)이 식별된다. 영상 조각 및 패치 영상가 끝점들(1262a, 1262b)을 기준으로 결합되면, 연장된 혈관 영역을 나타내는 결과 영상이 얻어질 수 있다. 영상 조각 및 패치 영상의 결합 시, 패 치 영상에 표현된 확률 값들에 대하여, 영상 조각에 표현된 혈관 영역은 가중치 1로 작용하고, 반 원들(1264a, 1264b) 내의 컬러 값들은 컬러 값만큼의 가중치로 작용한다. 이에 따라, 결과 영상를 참고하 면, 혈관 존재 확률 정보 중 영상 조각의 혈관 영역에 중첩되는 부분은 그대로 출력되고, 혈관 영역의 밖 에서 반원들(1264a, 1264b)에 중첩되는 부분은 가중치 적용에 의해 조절된 값으로 출력된다. 이와 같이, 반원들 (1264a, 1264b)로 표현된 혈관의 기하학적 특성 정보는 혈관 존재 확률을 강화하기 위해 사용되므로, 혈관의 기 하학적 특성 정보는 기하학적 가중치 함수(geometric weight function)이라 지칭될 수 있다. 전술한 혈관 영역의 복원 동작을 코드로 표현하면, 이하 [표 1]과 같다. 표 1 [표 1]을 참고하면, 라인 1에서, 각 픽셀의 혈관 존재 확률이 맵(map) V에 포함된다. 라인 2에서, 맵 V로부터 반원 영역 Ψ'(k)가 얻어진다. 라인들 3 내지 8에서, 초기 세그먼테이션 결과 Cmain 내의 모든 픽셀들 중, 반원 영 역 Ψ'(k)에 포함되는 각 픽셀 Xij에 대하여, 패치 영상에 대한 혈관 존재 확률 값 Vijpatch를 생성하는 동작, 혈관 존재 확률 맵 Vijpatch 및 SIG 함수 fSIG(Xij)를 결합함으로써 값 Vij를 갱신하는 동작이, 더 이상 V가 갱신되지 아 니할 때 까지 반복된다. 여기서, 반원 영역 Ψ'(k)은 이하 [수학시 3]과 같이 계산될 수 있다. 수학식 3"}
{"patent_id": "10-2021-0128686", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "[수학식 3]에서, Ψ'(k)은 혈류 방향 벡터에 따라 회전된 반원 영역, Ψ(k)은 반원 영역, px(k) 및 py(k)는 혈류 방향 벡터의 시작점들을 의미한다. 전술한 바와 같이, 혈관의 기하학적 특성을 나타내는 반원 영역을 이용하여 혈관 영역이 연장될 수 있다. 혈관 영역의 연장은 검출된 말단부로부터 진행된다. 전술한 실시 예들에 따르면, 혈관 영역의 연장 동작은 모든 말단 부들에 대하여 수행될 수 있다. 하지만, 다른 실시 예에 따라, 혈관 영역의 연장 동작은 미리 정의된 규칙에 따 라 선택된 적어도 하나의 말단부에 대하여 수행될 수 있다. 일 실시 예에 따라, 혈관 영역의 연장 동작, 즉, 재연결 동작을 적용할 말단부를 선택하기 위한 규칙은, 복수의 반원들이 중첩되는 것을 포함할 수 있다. 예를 들어, 2개의 시작점들, 즉, 제1 시작점 및 제2 시작점에에 배치 된 2개의 반원들이 적어도 일부 중첩되는 경우, 중첩 영역을 중심으로 패치 영상이 추출되고, 추출된 패치 영상 에서 재연결 동작이 수행될 수 있다. 중첩 영역을 중심으로 추출된 패치 영상에서 재연결 동작이 수행되는 경우, 일 실시 예에 따라, 패치 영상에 포 함된 말단부 각각에서 혈관 영역이 연장될 수 있다. 다시 말해, 장치는 제1 시작점에 배치된 반원을 이용하여 재연결 동작을 수행하고, 제2 시작점에 배치된 반원에 기반하여 재연결을 수행할 수 있다. 다른 실시 예에 따라, 중첩 영역 내에서만 혈관 영역이 형성될 수 있다. 본 발명의 예시적인 방법들은 설명의 명확성을 위해서 동작의 시리즈로 표현되어 있지만, 이는 단계가 수행되는 순서를 제한하기 위한 것은 아니며, 필요한 경우에는 각각의 단계가 동시에 또는 상이한 순서로 수행될 수도 있 다. 본 발명에 따른 방법을 구현하기 위해서, 예시하는 단계에 추가적으로 다른 단계를 포함하거나, 일부의 단 계를 제외하고 나머지 단계를 포함하거나, 또는 일부의 단계를 제외하고 추가적인 다른 단계를 포함할 수도 있 다. 본 발명의 다양한 실시 예는 모든 가능한 조합을 나열한 것이 아니고 본 발명의 대표적인 양상을 설명하기 위한 것이며, 다양한 실시 예에서 설명하는 사항들은 독립적으로 적용되거나 또는 둘 이상의 조합으로 적용될 수도 있다. 또한, 본 발명의 다양한 실시 예는 하드웨어, 펌웨어(firmware), 소프트웨어, 또는 그들의 결합 등에 의해 구현 될 수 있다. 하드웨어에 의한 구현의 경우, 하나 또는 그 이상의 ASICs(Application Specific Integrated Circuits), DSPs(Digital Signal Processors), DSPDs(Digital Signal Processing Devices), PLDs(Programmable Logic Devices), FPGAs(Field Programmable Gate Arrays), 범용 프로세서(general processor), 컨트롤러, 마이크로 컨트롤러, 마이크로 프로세서 등에 의해 구현될 수 있다. 본 발명의 범위는 다양한 실시 예의 방법에 따른 동작이 장치 또는 컴퓨터 상에서 실행되도록 하는 소프트웨어 또는 머신-실행가능한 명령들(예를 들어, 운영체제, 애플리케이션, 펌웨어(firmware), 프로그램 등), 및 이러한 소프트웨어 또는 명령 등이 저장되어 장치 또는 컴퓨터 상에서 실행 가능한 비-일시적 컴퓨터-판독가능 매체 (non-transitory computer-readable medium)를 포함한다."}
{"patent_id": "10-2021-0128686", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시 예에 따른 시스템을 도시한다. 도 2는 본 발명의 일 실시 예에 따른 질병 발생 가능성을 예측하는 장치의 구조를 도시한다. 도 3은 본 발명에 적용 가능한 인공지능 모델을 구성하는 퍼셉트론(perceptron)의 예를 도시한다. 도 4는 본 발명에 적용 가능한 인공지능 모델을 구성하는 인공 신경망의 예를 도시한다. 도 5는 의료 영상으로부터 세그먼테이션(segmentation)된 혈관 영역의 일 예를 도시한다. 도 6은 본 발명의 일 실시 예에 따른 세그먼테이션의 개념을 도시한다. 도 7은 본 발명의 일 실시 예에 따라 영상으로부터 혈관 영역을 세그먼테이션하는 절차의 예를 도시한다. 도 8은 본 발명의 일 실시 예에 따라 세그먼테이션된 혈관 영역에서 혈관의 끝점(tip point) 및 혈류 방향을 검 출하는 절차의 예를 도시한다. 도 9는 본 발명의 일 실시 예에 따른 혈관의 끝점 검출의 예를 도시한다.도 10은 본 발명의 일 실시 예에 따라 세그먼테이션된 혈관 영역에서 누락된 부분을 복원하는 절차의 예를 도시 한다. 도 11은 본 발명의 일 실시 예에 따른 누락된 부분을 복원하기 위해 사용되는 혈관의 기하학적 특성 정보의 예 를 도시한다. 도 12는 본 발명의 일 실시 예에 따른 누락된 혈관 영역의 복원의 예를 도시한다."}
