{"patent_id": "10-2024-7038263", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0050774", "출원번호": "10-2024-7038263", "발명의 명칭": "고급 데이터 및 분석 관리 플랫폼", "출원인": "엠티엔 그룹 매니지먼트 서비스", "발명자": "브하우라, 리즈완 하룬"}}
{"patent_id": "10-2024-7038263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "데이터 관리 플랫폼으로서:벤치마크 데이터가 저장된 중앙 집중식 데이터베이스-중앙 집중식 데이터베이스는 하나 이상의 데이터 소스에서하나 이상의 데이터 세트를 수신하도록 구성되며, 중앙 집중식 데이터베이스는 하나 이상의 사용자가 중앙 집중식 데이터베이스에 원격으로 액세스할 수 있도록 허용함-;중앙 집중식 데이터베이스에 통신 방식으로 연결된 분석 모듈-분석 모듈은 하나 이상의 데이터 세트의 데이터분석을 허용하는 하나 이상의 분석 도구를 포함함-; 그리고중앙 집중식 데이터베이스에 통신적으로 결합된 모델 모듈-모델 모듈은 하나 이상의 데이터 세트에 대해 일련의명령어를 수행하기 위한 하나 이상의 알고리즘을 포함하되, 모델 모듈은 하나 이상의 데이터 세트를 벤치마크데이터와 비교하여 하나 이상의 데이터 세트에 대한 예측 정보를 갖는 하나 이상의 출력 데이터 세트를 도출함으로써 하나 이상의 알고리즘에 의해 훈련될 수 있음-;을 포함하는 데이터 관리 플랫폼."}
{"patent_id": "10-2024-7038263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 하나 이상의 데이터 소스는 하나 이상의 국가에 위치하는 하나 이상의 데이터웨어하우스인, 데이터 관리 플랫폼."}
{"patent_id": "10-2024-7038263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서, 하나 이상의 사용자가 네트워크 연결을 통해 중앙 집중식 데이터베이스에 원격으로 액세스하여 하나 이상의 데이터 소스로부터 하나 이상의 데이터 세트를 중앙 집중식 데이터베이스로 전송할 수 있도록구성되되, 네트워크 연결은 하나 이상의 사용자가 분석 도구를 포함하는 분석 모듈을 사용하여 하나 이상의 데이터 세트를 분석할 수 있도록 허용하고, 네트워크 연결은, 하나 이상의 사용자가 하나 이상의 데이터 세트를벤치마크 데이터와 비교하여 하나 이상의 데이터 세트에 대한 예측 정보를 갖는 출력 데이터 세트를 도출함으로써 하나 이상의 알고리즘을 포함하는 모델 모듈을 훈련시키는 것을 허용하는, 데이터 관리 플랫폼."}
{"patent_id": "10-2024-7038263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서, 하나 이상의 분석 도구를 포함하는 분석 모듈과 하나 이상의 알고리즘을 포함하는 모델 모듈이, 하나 이상의 데이터 세트를 분석하는 하나 이상의 분석 도구의 각 인스턴스와 하나 이상의 데이터 세트를벤치마크 데이터와 비교하여 하나 이상의 데이터 세트에 대한 예측 정보를 갖는 하나 이상의 출력 데이터 세트를 도출하는 하나 이상의 알고리즘에 의해 학습되는 모델 모듈의 각 인스턴스에 따라 동적으로 업데이트되고 진화하는, 데이터 관리 플랫폼."}
{"patent_id": "10-2024-7038263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서, 하나 이상의 분석 도구는 Tableau, 오라클 비즈니스 인텔리전스, IBM 코그노스 분석, SAS,마이크로소프트 파워 BI, 아마존 레드쉬프트, 구글 빅쿼리, 스노우플레이크, Alteryx, Cloudera, ApacheHadoop, Google Vertex AI, Microsoft Azure Synapse, Microsoft Data Explorer, CosmosDB, Redis, AzureCognitive Services, Azure Machine Learning, Spark, Databricks, Sqream, Confluent Kafka, Presto, Trino,Flare, HIDS 및 이들의 조합으로 구성된 그룹에서 선택되는, 데이터 관리 플랫폼."}
{"patent_id": "10-2024-7038263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 1에 있어서, 하나 이상의 알고리즘은 머신러닝 알고리즘, 인공지능 알고리즘, 딥러닝 알고리즘, 휴리스틱 알고리즘 및 이들의 조합으로 구성된 그룹에서 선택되는, 데이터 관리 플랫폼."}
{"patent_id": "10-2024-7038263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2025-0050774-3-청구항 1에 있어서, 하나 이상의 데이터 세트는 고객 음성 통화 사용, 고객 스크린 타임 사용, 고객 데이터 사용, 고객 메시징 사용, 고객 장치 하드웨어 사양, 고객 거래, 고객 상호 작용, 고객 행동, 고객 수익, 네트워크운영, 네트워크 사용, 네트워크 투자, 내부 운영, 판매 정보, 유통 정보, 에이전트 운영, 가맹점 운영, 에이전트 서비스, 가맹점 운영, B2B 제품, B2B 제품 서비스, 디지털 제품, OTT 애플리케이션, 고객 가치 관리, 가격책정, 운영 관리, 포트폴리오 관리, 고객 위치, 네트워크 위치, 네트워크 전송, 네트워크 구성, 사이버 보안 및이들의 조합으로 구성된 그룹으로부터 선택된 고객 사용 정보를 포함하는, 데이터 관리 플랫폼."}
{"patent_id": "10-2024-7038263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 1에 있어서, 예측 정보는 사용자별 상품 오퍼링을 도출하기 위한 고객 행동에 대한 정보를 포함하는, 데이터 관리 플랫폼."}
{"patent_id": "10-2024-7038263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 1에 있어서, 중앙 집중식 데이터베이스는 익명화된 데이터를 도출하기 위해 익명화된 하나 이상의 데이터 세트만을 수신하도록 구성되는, 데이터 관리 플랫폼."}
{"patent_id": "10-2024-7038263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 1에 있어서, 모델 모듈을 중앙 집중식 데이터베이스 외부에 위치 가능한 데이터베이스로 전송하기 위한데이터 전송 모듈을 더 포함하되, 하나 이상의 알고리즘을 포함하는 모델 모듈은 데이터베이스 상에서 이용 가능한 하나 이상의 데이터 세트에 적용되어 하나 이상의 데이터 세트에 대한 예측 정보를 갖는 출력 데이터 세트를 도출할 수 있는, 데이터 관리 플랫폼."}
{"patent_id": "10-2024-7038263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 10에 있어서, 모델 모듈은 저장 매체에 저장될 수 있는, 데이터 관리 플랫폼."}
{"patent_id": "10-2024-7038263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 11에 있어서, 저장 매체는 비일시적 저장 매체, 일시적 저장 매체 및 이들의 조합으로 구성된 그룹으로부터 선택되는, 데이터 관리 플랫폼."}
{"patent_id": "10-2024-7038263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 1에 있어서, 중앙 집중식 데이터베이스 외부에 위치 가능한 익명화 모듈을 더 포함하며, 익명화 모듈은:하나 이상의 데이터 소스에서 하나 이상의 데이터 세트를 수신하기 위한 데이터 모듈;익명화된 데이터를 도출하기 위해 하나 이상의 데이터 세트를 익명화하기 위한 익명화 알고리즘; 그리고익명화된 데이터를 중앙 집중식 데이터베이스로 전송하기 위한 전송 모듈을 포함하는, 데이터 관리 플랫폼"}
{"patent_id": "10-2024-7038263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 13에 있어서, 익명화된 데이터는 익명화된 데이터에 대한 예측 정보를 갖는 출력 데이터 세트를 도출하기 위해 익명화된 데이터를 중앙 집중식 데이터베이스에 저장된 벤치마크 데이터와 비교하는 하나 이상의 알고리즘에 의해 모델 모듈을 훈련시키는 데 사용되는, 데이터 관리 플랫폼."}
{"patent_id": "10-2024-7038263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "청구항14에 있어서, 모델 모듈은 익명화된 데이터에 의해 학습되도록 구성되고, 모델 모듈은 국가별 데이터 보호 및 개인정보 보호 규정을 준수하기 위해 선택된 위치에서 찾을 수 있는 하나 이상의 데이터 세트에적용되는, 데이터 관리 플랫폼."}
{"patent_id": "10-2024-7038263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "청구항 1에 있어서, 하나 이상의 데이터 세트에 대한 예측 정보를 수신하기 위해 모델 모듈에 통신적으로 결합되고, 더 나아가 하나 이상의 사용자 디바이스에 통신적으로 결합되는 인터페이스 모듈을 더 포함하여, 사용자디바이스가 하나 이상의 데이터 세트에 대한 예측 정보에 액세스하도록 하는, 데이터 관리 플랫폼. 공개특허 10-2025-0050774-4-청구항 17 익명화된 데이터로 모델을 학습하고 선택한 위치에 있는 하나 이상의 데이터 세트에 모델을 적용하는 방법으로서:벤치마크 데이터가 저장된 데이터베이스를 제공하는 단계-데이터베이스는 하나 이상의 데이터 소스로부터 데이터를 수신할 수 있음-;데이터베이스에 통신적으로 연결된 외부 데이터 소스를 제공하는 단계-외부 데이터 소스에 저장된 하나 이상의데이터 세트가 익명화된 데이터를 도출하기 위해 일련의 명령을 수행하여 익명화됨-;데이터베이스에 저장된 데이터를 분석할 수 있도록 하나 이상의 분석 도구를 사용하는 단계;익명화된 데이터를 벤치마크 데이터와 비교하여 하나 이상의 알고리즘으로 구성된 모델을 학습하는 단계;데이터베이스 외부에서 찾을 수 있는 하나 이상의 데이터 세트에 학습된 모델을 적용하여 하나 이상의 데이터세트에 대한 예측 정보를 도출하는 단계를 포함하는, 방법."}
{"patent_id": "10-2024-7038263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "청구항 17에 있어서, 모델을 저장 매체에 저장하는 단계를 더 포함하여, 모델을 저장 매체에 통신적으로 결합된하나 이상의 데이터 세트에 적용할 수 있도록 하는, 방법."}
{"patent_id": "10-2024-7038263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "디지털 관리 시스템으로서:하나 이상의 데이터 소스에서 얻을 수 있는 하나 이상의 데이터 세트를 저장할 수 있는 메모리에 통신적으로 결합된 프로세서를 포함하는 컴퓨팅 장치-메모리는 벤치마크 데이터를 저장함-;분석 도구를 포함하는 분석 모듈-분석 모듈은 메모리에 통신적으로 결합되고, 프로세서는 하나 이상의 데이터세트에 대한 분석 작업을 수행하기 위해 분석 도구에 대한 일련의 명령을 수행할 수 있음-; 그리고하나 이상의 알고리즘을 포함하는 모델 모듈-모델 모듈은 메모리에 통신적으로 결합되며, 모델 모듈은 하나 이상의 데이터 세트에 대한 예측 정보를 갖는 출력 데이터 세트를 도출하기 위해 벤치마크 데이터와 비교하여 하나 이상의 알고리즘을 적용하는 프로세서에 의해 훈련될 수 있음-;을 포함하는 디지털 관리 시스템."}
{"patent_id": "10-2024-7038263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "청구항 19에 있어서, 메모리는 비일시적 저장 매체, 일시적 저장 매체 및 이들의 조합으로 구성된 그룹으로부터 선택되는, 디지털 관리 시스템."}
{"patent_id": "10-2024-7038263", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "여러 사용자가 중앙 집중식 데이터베이스에 원격으로 액세스하고 분석 도구, 모델, 알고리즘을 사용하여 데이터 세트에서 예측 정보, 트렌드 등을 분석하고 추출할 수 있는 고급 데이터 관리 플랫폼, 방법 및 시스템이다. 또한 데이터 관리 플랫폼, 방법 및 시스템에는 익명화된 데이터로 데이터 분석 및 모델 학습을 할 수 있는 옵션이 포 함되어 있다. 이를 통해 훈련된 모델을 데이터 플랫폼 및/또는 시스템 외부에 위치한 데이터 세트에 적용하여 해 당 데이터 세트에 대한 예측 정보를 도출할 수 있다."}
{"patent_id": "10-2024-7038263", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 고급 데이터 및 분석 관리 플랫폼에 관한 것이다. 본 발명은 또한 고급 데이터 및 분석 관리 플랫폼 을 구현하기 위한 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2024-7038263", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "많은 기존 조직에서는 일정 기간이 지나면 데이터를 삭제하거나 기껏해야 장기 보관 및 기본 보고를 위해 기존 데이터 웨어하우스에 데이터를 보관하는 것이 표준 관행이다. 최근 몇 년 동안 조직들은 최신 유행어, 성공 사례, 출판물 및 세미나의 트렌드에 영향을 받아 부분적으로는 더 정교하고 발전된 방식으로 데이터를 다루기 시작했다. 이 과정의 일환으로, 많은 경우 임의적이기는 하지만 다 양한 '분석' 솔루션이나 도구에 더 많은 투자가 이루어지고 있다. 조직과 기술의 관점에서 볼 때, 조직이나 그룹 내의 여러 팀과 부서가 위의 '움직임'에 동참할 수 있으며, 일부 는 다소 소극적인 방식으로, 다른 일부는 다소 열정적으로, 많은 팀이나 부서가 공급업체(기존 및 신규)를 통해데이터 및 분석 도구에 투자하고 있다. 그 결과, 전사적으로 통일된 종합적인 엔드투엔드 솔루션이 아니라 데이터와 분석 리소스가 분산될 위험이 있다 (특히 대규모 조직에서). 이러한 분산된 시스템의 단점으로는 사일로화된 데이터 저장소(siloed data stores), 최적이 아닌 기본 분석 리소스, 조정되지 않은 호환되지 않는 작업으로 인한 결과의 저하, 조직 예산과 리소스 의 낭비 또는 중복, 기회 손실 등이 있다. 또한, 이러한 자의적이고 일관성 없는 이질적인 접근 방식과 축적된 수많은 자산은 새로운 조직 사일로를 만들거나 기존의 조직 사일로를 강화한다. 단일 '진실의 출처'와 단일 ' 데이터 지점'은 없으며, 이는 분석 리포지토리(repositories)와 참조에도 적용된다. 예를 들어, 하나의 핵심 성과 지표(KPI), 프로세스 또는 사용 사례가 같은 조직 내에서 여러 팀에 의해 서로 다르게 정의되고 구현될 수 있다. 이로 인해 예를 들어 동일한 KPI가 조직 전체와 외부(예: 투자자 및 규제 기관)에 서로 다른 값(수치)으 로 다르게 보고되는 결과를 초래할 수 있다. 이는 조직의 성과, 이미지, 거버넌스 및/또는 벤치마크에 해로운 영향을 미칠 수 있다. 분석에 대한 이러한 분산되고 상호 연관성이 없으며 조정되지 않은 접근 방식은 '서로'를 인식하지 못하기 때문 에 조직 내에서 공통의 효과와 목표를 향해 조화롭게 작동하는 대신 비조화적으로 작동한다. 실질적인 결과는 상호 약탈, 밀어내기 효과 등으로 인해 최적이 아니며 종종 부정적인 결과를 초래한다. 이와 관련하여 또 다른 중요한 문제는 데이터 과학 활동에 적합한 데이터의 종류와 양이 충분하지 않다는 것이다. 분석은 다양한 유형의 대량의 데이터와 정교한 분석 수단이 결합되어 있을 때 가장 효과적이다. 대규모 조직에서는 각 부서나 기능이 다른 부서나 기능에 의존하여 전체 조직의 고객에 대한 서비스를 제공할 수 있다. 마찬가지로 데이터 및 분석의 경우, 다양한 데이터와 외부 데이터 포인트를 융합하면 조직의 진정한 분석 잠재 력을 달성하는 데 도움이 될 수 있다. 중앙 집중식 전용 데이터 및 분석 플랫폼이 없는 사일로화된 접근 방식에서는 분석 자산(예: 머신 러닝(ML) 모 델)의 효율성과 예측력이 최적화되지 않을 수 있다. 이는 정확도와 영향력이 높지 않은 예측과 의사 결정으로 이어진다. 정확하고 완전한 데이터와 관련 에코시스템, 단일 개발 지점이 없기 때문에 이러한 분석 자산 중 상 당수는 조직에 도움이 되도록 생산화(비즈니스 또는 IT 시스템에서 구현)되지 않고 개인의 컴퓨터(예: 노트북의 로컬)에 남아 있을 수 있다. 당연히 이것은 위에서 이미 언급한 다른 문제와 함께 상당한 중복과 낭비를 초래 한다. 조직의 빅데이터 자산을 활용하여 상업적 가치를 창출하는 데 있어 흔히 실패하는 것은 일반적으로 ML 모델을 통해 훌륭하고 실행 가능한 인사이트를 창출하는 것이 아니라 이를 적용하는 데 있다는 사실이 밝혀졌다. 이러 한 모델을 생산적인 비즈니스 시스템으로 구축하는 것은 일반적으로 데이터 과학 팀이 실패하는 부분이며(모델 자체의 개발에 실패하는 것과는 반대로), 대부분의 리소스 노력이 집중될 수 있다. 위에서 살펴본 바와 같이, 이러한 문제 중 적어도 일부를 해결할 수 있는 종합적인 엔드투엔드 솔루션에 대한 필요성이 확인되었다. 발명가는 여러 분야에 걸친 다양한 업계 경험을 바탕으로 공개 도메인에서 솔루션을 찾 으려고 시도했지만 하나의 '기성품' 도구나 솔루션을 사용할 수 없다는 사실을 알게 되었다. 이러한 엔드투엔 드 솔루션을 만드는 데 필요한 요구 사항, 구성 요소, 프로세스 및 서비스가 다양하기 때문에 이는 놀라운 일이 아니었다. 이 분야에 대한 연구가 진행되어 왔고 일부 기업에서 구글의 \"콜로서스(Colossus)\" 및 \"빅테이블(Bigtable)\" 제 품과 같이 문제의 일부를 해결하는 제품/서비스를 개발했지만, 기존 기능은 제한적이며 필요한 종합적인 솔루션 을 제공하지 못한다. 특히, 본 출원인은 수많은 구성 요소, 서비스, 프로세스 및 기능이 조화롭게 상호 작용할 수 있으면서도 공급업체에 구애받지 않는 종합적인 분석 주기 솔루션을 찾지 못했다. 이러한 필요성을 해결하 기 위해 본 발명자는 본 발명을 개발했다."}
{"patent_id": "10-2024-7038263", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명에 따르면, 대체로 고급 데이터 및 분석 관리 플랫폼이 제공된다. 본 발명의 측면에는 아래에 설명되거 나 도면에 도시된 바와 같이 플랫폼의 일부를 형성하거나 플랫폼에 결합된 시스템 및 플랫폼의 운영 방법이 포 함될 수 있다."}
{"patent_id": "10-2024-7038263", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "고급 데이터 및 분석 관리 플랫폼은 참조하기 쉽도록 아래 및 일부 도면에서 약어 'ADAM'을 사용하여 지칭한다. ADAM 플랫폼은 조직(예: 회사 그룹 또는 여러 회사 그룹을 포함하는 조직) 전체의 모든 분석 자산(특히 고급 분 석 도구)에 대한 개발, 관리, 생산, 리포지토리 및 모니터링의 중앙 단일 소스를 제공하도록 구성된다. 아래 예시와 도면에서 조직은 운영 회사(OpCos)를 포함한 MTN이다. OpCos는 여러 국가에 분산되어 있을 수 있으며 일부 국가에서는 비즈니스가 운영되는 국가당 하나의 OpCos가 있을 수 있다. MTN에 대한 언급은 단지 예시일 뿐이며 ADAM 플랫폼은 다양한 산업과 조직에 적용될 수 있다는 점을 이해해 주시기 바란다. MTN의 경우 로컬/ 온프레미스 데이터 시스템(local/on-premise data systems)을 \"EVA\" 시스템이라고 할 수 있으며, 따라서 EVA 시스템과 ADAM 플랫폼의 통합에 대한 참조가 이루어진다. ADAM 플랫폼은 데이터 과학 워크벤치 및 자산 관리 플랫폼을 제공하여 조직의 데이터 활용 역량을 성숙시킬 수 있다. ADAM 플랫폼은 조직에서 데이터 과학을 확산하고, 네이티브 인재를 육성하며, 비즈니스 흐름을 강화하는 데 도움을 줄 수 있다. 플랫폼은 중앙에 위치하여 어디서나 쉽고 안전하게 액세스할 수 있어야 하며, 적절한 다양성과 양의 데이터(법 적으로 검증된 데이터)를 보유하고, 완전한 분석 리소스 에코시스템을 갖추고, 그룹 내 각 운영 회사에 연결되 어 있어야 하며, 그룹 내 온프레미스, 클라우드 또는 엣지(예: 쇼핑몰이나 공항 등) 또는 B2B 클라이언트에서 데이터 또는 분석 리소스를 생성, 재사용 및 산업화(자동화)할 수 있는 수단을 갖추고 있는 것이 바람직하다. 기본적으로 ADAM 플랫폼은 분석 팩토리 및/또는 서비스로서의 분석 플랫폼(예: 협업을 위한 원스톱 상점, 분석 코드 저장소, 모델 카탈로그, CICD(지속적인 통합, 지속적인 개발) 파이프라인, 중요한 조직 데이터 소스(포인 트), 분석 자산, 지원 분석 알고리즘, 언어 등)으로 기능하도록 구성할 수 있다. ADAM 플랫폼에는 다음 구성 요소/기능 중 하나 이상이 포함될 수 있다: · 대량의 다양한 조직 데이터와 외부 데이터를 하나의 논리적 위치에서 즉시 사용할 수 있음; · 다양한 분석 도구와 언어를 지원함; · 안전한 조직 내부 환경에서 심사를 거쳐 다운로드한 모델링 알고리즘 라이브러리에 액세스할 수 있음; · 다양한 종류의 분석(예: AI/ML/DL/휴리스틱/시뮬레이션 등)을 지원하는 기능; · 그룹 및 OpCos데이터 소스 시스템과 같은 다른 조직 엔티티에 연결할 수 있음; · 데이터를 업로드하고, 모델 코드를 다운로드하고, 모니터링을 위해 모델 성능을 다시 업로드하는 기능(예: CICD 파이프라인을 통해); 및/또는 · 실행 가능한 인사이트, 인사이트 기반 조치 및/또는 예측을 자동화하고 정기적으로 생성할 수 있도록 쉽게 생산화(산업화)할 수 있음. 이 플랫폼은 데이터 과학자부터 기초 분석가까지 모든 사용자가 어디서나 연결되고 액세스할 수 있는 광범위한 전사적 인프라의 일부인 환경에서 선호하는 기술, 프로그래밍 언어, 분석 알고리즘 라이브러리를 사용할 수 있 도록 지원한다. 데이터 과학자와 같은 사용자는 최소한의 설정만으로 중앙 데이터 레이크의 데이터 원본에 직 접 연결하여 비즈니스 생산성을 높일 수 있다. 따라서 이 플랫폼은 ML/AI 모델을 예로 들어, 대규모 조직에서 ML/AI의 가치를 '실현'할 수 있는 기술적 솔루션 을 제공한다. 본 발명의 실시예는 ADAM 플랫폼을 구현하기 위한 하나 이상의 컴퓨터 프로그램 제품으로 확장될 수 있으며, 컴 퓨터 프로그램 제품은 프로그램 명령어가 구현된 적어도 하나의 컴퓨터 판독 가능 저장 매체를 포함하고, 프로 그램 명령어는 적어도 하나의 컴퓨터에 의해 실행 가능하여 적어도 하나의 컴퓨터가 전술한 바와 같이 실질적으 로 기술을 수행하고 특징을 구현하도록 하는 것을 포함한다. 컴퓨터 판독 가능 저장 매체는 비일시적 저장 매체일 수 있다. 컴퓨터 프로그램 제품은 여러 장치 및 위치 등 에 걸쳐 구현될 수 있다. ADAM 플랫폼은 적합한 컴퓨터 또는 서버일 수도 있고 이를 포함할 수도 있다. 컴퓨터 ADAM 플랫폼은 통신 네트 워크를 통해 연결된 원격 처리 장치에 의해 작업이 수행되는 분산 클라우드 컴퓨팅 환경에서 구현될 수 있다. 분산 클라우드 컴퓨팅 환경에서 ADAM 플랫폼에 의해 실행되는 프로그램 모듈은 로컬 및 원격에 모두 위치할 수있다. 본 발명의 일 측면에 따르면, 다음을 포함하는 데이터 관리 플랫폼이 제공된다: 벤치마크 데이터가 저장된 중앙 집중식 데이터베이스-중앙 집중식 데이터베이스는 하나 이상의 데이터 소스에서 하나 이상의 데이터 세트를 수신하도록 구성되며, 중앙 집중식 데이터베이스는 하나 이상의 사용자가 중앙 집중 식 데이터베이스에 원격으로 액세스할 수 있도록 허용함-; 중앙 집중식 데이터베이스에 통신 방식으로 연결된 분석 모듈-분석 모듈은 하나 이상의 데이터 세트의 데이터 분석을 허용하는 하나 이상의 분석 도구를 포함함-; 그리고 중앙 집중식 데이터베이스에 통신적으로 결합된 모델 모듈-모델 모듈은 하나 이상의 데이터 세트에 대한 일련의 명령어를 수행하기 위한 하나 이상의 알고리즘을 포함하고, 모델 모듈은 하나 이상의 데이터 세트를 벤치마크 데이터와 비교하여 하나 이상의 데이터 세트에 대한 예측 정보를 갖는 하나 이상의 출력 데이터 세트를 도출함 으로써 하나 이상의 알고리즘에 의해 훈련될 수 있음-. 하나 이상의 데이터 소스는 하나 이상의 국가에 위치한 하나 이상의 데이터 웨어하우스일 수 있다. 하나 이상의 데이터 세트는 고객 데이터로 구성될 수 있다. 데이터 관리 플랫폼은, 하나 이상의 사용자가 네트워크 연결을 통해 중앙 집중식 데이터베이스에 원격으로 액세 스하여 하나 이상의 데이터 소스로부터 하나 이상의 데이터 세트를 중앙 집중식 데이터베이스로 전송하도록 구 성될 수 있으며, 네트워크 연결은 하나 이상의 사용자가 분석 툴을 포함하는 분석 모듈을 사용하여 하나 이상 의 데이터 세트를 분석하도록 허용할 수 있고, 네트워크 연결은, 하나 이상의 사용자가 하나 이상의 데이터 세 트를 벤치마크 데이터와 비교하여 하나 이상의 데이터 세트에 대한 예측 정보를 갖는 출력 데이터 세트를 도출 함으로써 하나 이상의 알고리즘을 포함하는 모델 모듈을 훈련시키는 것을 허용한다. 하나 이상의 분석 도구를 포함하는 분석 모듈 및 하나 이상의 알고리즘을 포함하는 모델 모듈은 하나 이상의 데 이터 세트를 분석하는 하나 이상의 분석 도구의 각 인스턴스와 하나 이상의 데이터 세트를 벤치마크 데이터와 비교하여 하나 이상의 데이터 세트에 대한 예측 정보를 갖는 하나 이상의 출력 데이터 세트를 도출함으로써 하 나 이상의 알고리즘에 의해 훈련되는 모델 모듈에 따라 동적으로 업데이트 및 진화할 수 있다. 동적 업데이트는 실시간으로 데이터를 업로드하는 것을 의미할 수 있다. 분석 모듈과 모델 모듈의 운영이 개선되어 분석 모듈은 데이터 분석을 개선하고 모델 모듈은 하나 이상의 데이 터 세트에 적용될 때 더 빠르고 강력한 예측 정보를 제공할 수 있게 될 것이다. 벤치마크 데이터는 벤치마크 데이터와 비교되는 하나 이상의 데이터 세트의 각 인스턴스에 따라 동적으로 업데 이트될 수 있다. 하나 이상의 알고리즘으로 구성된 모델 모듈을 학습하면 예측 정보가 도출된 각 후속 출력 데이터 세트의 속도 가 빨라지고 하나 이상의 데이터 세트와 관련된 추가 예측 인사이트가 포함될 수 있다. 데이터 관리 플랫폼은 데이터를 하나 이상의 벡터로 처리하기 위한 처리 모듈을 더 포함할 수 있다. 하나 이상의 벡터는 하나 이상의 사용 사례로 세분화될 수 있다. 각 사용 사례는 특정 용도로 사용하도록 구성할 수 있다. 각 목적은 특정 유형의 데이터에 벡터를 사용하는 것일 수 있다. 하나 이상의 벡터는 데이터 관리 플랫폼에 저장소로 저장되며, 하나 이상의 사용자는 하나 이상의 데이터 세트 에 하나 이상의 알고리즘으로 구성된 모델 모듈을 쉽게 적용하기 위해 저장소에 원격으로 액세스할 수 있다. 데이터 관리 플랫폼에 저장소로 저장된 하나 이상의 벡터의 가용성은 하나 이상의 알고리즘으로 구성된 모델 모 듈을 하나 이상의 국가에서 찾을 수 있는 하나 이상의 데이터 세트에 적용할 수 있도록 할 수 있다. 데이터 관리 플랫폼에 저장소로 저장된 하나 이상의 벡터를 사용하면 하나 이상의 알고리즘을 포함하는 모델 모 듈을 하나 이상의 데이터 세트에 적용하는 것이 하나 이상의 데이터 세트를 데이터 관리 플랫폼에 전송하는 것 보다 더 짧은 지연 시간으로 적용될 수 있다. 네트워크 연결은 보안 연결, 비공개 연결 또는 이 둘의 조합일 수 있다. 하나 이상의 데이터 소스는 하나 이상의 국가에서 찾을 수 있는 하나 이상의 데이터 웨어하우스일 수 있다. 중앙 집중식 데이터베이스는 익명화된 데이터를 도출하기 위해 익명화된 하나 이상의 데이터 세트만 수신하도록 구성할 수 있다. 하나 이상의 분석 도구는 Tableau, Oracle 비즈니스 인텔리전스, IBM 코그노스 애널리틱스, SAS, Microsoft 파 워 BI, Amazon Redshift, Google 빅쿼리, 스노우플레이크, 알터렉스, 클라우데라, 아파치 하둡, Google Vertex AI, Microsoft Azure Synapse, Microsoft Data Explorer, CosmosDB, Redis, Azure Cognitive Services, Azure Machine Learning, Spark, Databricks, Sqream, Confluent Kafka, Presto, Trino, Flare, HIDS 및 이들의 조 합으로 구성된 그룹에서 선택할 수 있다. 하나 이상의 알고리즘은 머신러닝 알고리즘, 인공지능 알고리즘, 딥러닝 알고리즘, 휴리스틱 알고리즘 및 이들 의 조합으로 구성된 그룹에서 선택될 수 있다. 하나 이상의 데이터 세트는 고객 음성 통화 사용, 고객 스크린 타임 사용, 고객 데이터 사용, 고객 메시징 사용, 고객 기기 하드웨어 사양, 고객 거래, 고객 상호 작용, 고객 행동, 고객 수익, 네트워크 운영, 네트워크 사용, 네트워크 투자, 내부 운영, 판매 정보, 유통 정보, 에이전트 운영, 가맹점 운영, 에이전트 서비스, 가맹 점 운영, B2B 제품, B2B 제품 서비스, 디지털 제품, OTT 애플리케이션, 고객 가치 관리, 가격 책정, 운영 관리, 포트폴리오 관리, 고객 위치, 네트워크 위치, 네트워크 전송, 네트워크 구성, 사이버 보안 및 이들의 조합우로 구성된 그룹에서 선택한 고객 사용 정보로 구성될 수 있다. 하나 이상의 데이터 세트는 음성, 인터넷, 데이터, 결제, 디지털 서비스, 기업 서비스, 네트워크 솔루션 및 이 들의 조합으로 구성된 고객의 사용과 관련된 고객 정보 중에서 선택할 수 있는 정보로 구성될 수 있다. 예측 정보에는 사용자별 상품 제안을 도출하기 위한 고객 행동에 대한 정보가 포함될 수 있다. 사용자별 상품 제공의 예는 모델 모듈 및 하나 이상의 알고리즘에 의해 고객에 대해 도출된 예측 정보와 연관된 하나 이상의 상품을 고객에게 제공하는 것일 수 있다. 사용자별 상품 제공의 보다 구체적인 예로는 음성 통화 시간, 데이터 또는 이들의 조합으로 구성된 하나 이상의 상품을 고객에게 추천할 수 있다. 예측 정보에는 고객이 제품 오퍼링을 구매할 가능성을 높이기 위해 선호하는 커뮤니케이션 형식을 나타내는 정 보가 포함될 수 있다. 데이터 관리 플랫폼은 모델 모듈을 중앙 집중식 데이터베이스 외부에 위치 가능한 데이터베이스로 전송하기 위 한 데이터 전송 모듈을 포함할 수 있으며, 하나 이상의 알고리즘을 포함하는 모델 모듈은 데이터베이스 상에서 이용 가능한 하나 이상의 데이터 세트에 적용되어 하나 이상의 데이터 세트에 대한 예측 정보를 갖는 출력 데이 터 세트를 도출할 수 있다. 데이터 전송 모듈은 학습된 모델 모듈과 하나 이상의 알고리즘을 컴퓨터 판독 가능한 저장 매체에 저장할 수 있 다. 컴퓨터에서 읽을 수 있는 저장 매체는 비일시적 저장 매체일 수 있다. 컴퓨터 판독 가능 저장 매체는 또한 하나 이상의 클라우드 스토리지 인스턴스 또는 단위, 원격 서버, 서로 통신 하는 복수의 프로세서, 컴퓨터 및 이들의 조합을 포함할 수 있는 원격 스토리지일 수도 있다. 모델 모듈은 하나 이상의 데이터 세트를 포함하는 모든 장치 또는 매체에 업로드될 수 있으며, 모델 모듈은 하 나 이상의 데이터 세트에 적용된다. 모델 모듈을 데이터 관리 플랫폼 외부에서 찾을 수 있는 위치에 업로드하면 지연 시간을 줄일 수 있다. 데이터 관리 플랫폼 외부에서 찾을 수 있는 위치에 모델 모듈을 업로드하면 해당 위치에서 하나 이상의 데이터 세트를 제거할 경우 하나 이상의 데이터 규정을 위반하게 되는 위치의 하나 이상의 데이터 세트에 모델 모듈을 적용할 수 있다. 모델 모듈을 데이터 관리 플랫폼 외부에서 찾을 수 있는 위치에 업로드하면 데이터 관리 플랫폼의 익명화된 데 이터로 학습된 모델 모듈이 해당 위치에서 하나 이상의 데이터 세트에 대한 예측 정보를 도출할 수 있으며, 예 측 정보는 해당 위치에서 하나 이상의 데이터 세트에 포함된 하나 이상의 고객을 위한 사용자별 상품 오퍼링을도출하는 데 사용될 수 있다. 데이터 관리 플랫폼은 중앙 집중식 데이터베이스 외부에서 찾을 수 있는 익명화 모듈을 더 포함할 수 있으며, 익명화 모듈은 다음을 포함할 수 있다: 하나 이상의 데이터 소스에서 하나 이상의 데이터 세트를 수신하기 위한 데이터 모듈; 익명화된 데이터를 도출하기 위해 하나 이상의 데이터 세트를 익명화하기 위한 익명화 알고리즘; 그리고 익명화된 데이터를 중앙 집중식 데이터베이스로 전송하기 위한 전송 모듈. 익명화된 데이터는 익명화된 데이터를 중앙 집중식 데이터베이스에 저장된 벤치마크 데이터와 비교하여 익명화 된 데이터에 대한 예측 정보를 갖는 출력 데이터 세트를 도출함으로써 하나 이상의 알고리즘으로 구성된 모델 모듈을 학습시키는 데 사용될 수 있다. 하나 이상의 알고리즘을 포함하는 모델 모듈은 익명화된 데이터에 의해 학습되도록 구성될 수 있으며, 모델 모 듈은 국가별 데이터 보호 및 개인정보 보호 규정을 준수하기 위해 선택한 위치에서 찾을 수 있는 하나 이상의 데이터 세트에 적용된다. 데이터 관리 플랫폼은 하나 이상의 데이터 세트가 저장된 외부 데이터 소스와 통신적으로 연결될 수 있으며, 외 부 데이터 소스는 플랫폼 외부에서 찾을 수 있다. 상기 데이터 소스에 저장된 하나 이상의 데이터 세트는 익명화 모듈에 의해 익명화되어 익명화된 데이터를 도출 할 수 있다. 하나 이상의 알고리즘을 포함하는 모델 모듈은 중앙 집중식 데이터베이스에 의해 수신되는 익명화 된 데이터에 의해 훈련될 수 있으며, 하나 이상의 알고리즘을 포함하는 훈련된 모델 모듈은 중앙 집중식 데이터 베이스 외부의 위치에서 찾을 수 있는 데이터 소스에서 찾을 수 있는 하나 이상의 데이터 세트에 적용될 수 있 다. 데이터 관리 플랫폼은 하나 이상의 데이터 세트에 대한 예측 정보를 수신하기 위해 모델 모듈과 통신 가능하게 결합되고, 하나 이상의 사용자 디바이스와 통신 가능하게 결합되어, 사용자 디바이스가 하나 이상의 데이터 세 트에 대한 예측 정보에 액세스할 수 있도록 하는 인터페이스 모듈을 더 포함할 수 있다. 본 발명의 두 번째 측면에 따르면, 익명화된 데이터로 모델을 훈련하고 선택된 위치에 위치한 하나 이상의 데이 터 세트에 모델을 적용하는 방법이 제공되며, 이 방법은 다음의 단계를 포함한다: 벤치마크 데이터가 저장된 데이터베이스를 제공-데이터베이스는 하나 이상의 데이터 소스로부터 데이터를 수신 할 수 있음; 데이터베이스에 통신적으로 연결된 외부 데이터 소스를 제공-외부 데이터 소스에 저장된 하나 이상의 데이터 세 트가 익명화된 데이터를 도출하기 위해 일련의 명령을 수행하여 익명화됨; 데이터베이스에 저장된 데이터를 분석할 수 있도록 하나 이상의 분석 도구를 사용함; 익명화된 데이터를 벤치마크 데이터와 비교하여 하나 이상의 알고리즘으로 구성된 모델을 학습함; 데이터베이스 외부에서 찾을 수 있는 하나 이상의 데이터 세트에 학습된 모델을 적용하여 하나 이상의 데이터 세트에 대한 예측 정보를 도출함. 이 방법은 모델을 저장 매체에 저장하는 단계를 포함할 수 있으며, 이 단계는 모델이 저장 매체에 통신적으로 연결된 임의의 소스에 위치한 하나 이상의 데이터 세트에 적용될 수 있도록 한다. 방법은 예측 정보를 사용하여 사용자별 상품 오퍼링을 도출하는 단계로 구성될 수 있다. 본 발명의 세 번째 측면에 따르면, 다음을 포함하는 디지털 관리 시스템이 제공된다: 하나 이상의 데이터 소스에서 얻을 수 있는 하나 이상의 데이터 세트를 저장할 수 있는 메모리에 통신적으로 결 합된 프로세서를 포함하는 컴퓨팅 장치-메모리는 벤치마크 데이터를 저장함; 분석 도구를 포함하는 분석 모듈-분석 모듈은 메모리에 통신적으로 결합되고, 프로세서는 하나 이상의 데이터 세트에 대한 분석 작업을 수행하기 위해 분석 도구에 대한 일련의 명령을 수행할 수 있음; 그리고 하나 이상의 알고리즘을 포함하는 모델 모듈-모델 모듈은 메모리에 통신적으로 결합되며, 모델 모듈은 하나 이 상의 데이터 세트에 대한 예측 정보를 갖는 출력 데이터 세트를 도출하기 위해 벤치마크 데이터와 비교하여 하나 이상의 알고리즘을 적용하는 프로세서에 의해 훈련될 수 있음. 메모리는 비일시적 저장 매체, 일시적 저장 매체 및 이들의 조합으로 구성된 그룹 중에서 선택할 수 있다. 본 발명의 네 번째 측면에 따르면, 컴퓨터가 실행될 때 컴퓨터가 컴퓨터 시스템을 사용하여 익명화된 데이터로 모델을 훈련시키고 선택된 위치에 위치한 데이터에 모델을 적용하는 방법을 수행하게 하는 명령어를 저장하는 컴퓨터 판독 가능 저장 매체가 제공되며, 방법은 다음의 단계를 포함한다: 벤치마크 데이터가 저장된 데이터베이스를 제공함-데이터베이스는 하나 이상의 데이터 소스로부터 데이터를 수 신할 수 있음; 데이터베이스에 통신적으로 연결된 외부 데이터 소스를 제공함-외부 데이터 소스에 저장된 하나 이상의 데이터 세트가 익명화된 데이터를 도출하기 위해 일련의 명령을 수행하여 익명화됨; 하나 이상의 분석 도구를 사용하여 데이터베이스에 저장된 데이터를 분석함; 익명화된 데이터를 벤치마크 데이터와 비교하여 하나 이상의 알고리즘으로 구성된 모델을 학습함; 데이터베이스 외부에서 찾을 수 있는 외부 데이터 세트에 학습된 모델을 적용하여 외부 데이터 세트에 대한 예 측 정보를 도출함."}
{"patent_id": "10-2024-7038263", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "다음의 설명은 본 발명의 실시예로서 제공되며, 본 발명과 관련된 원리를 예시하기 위한 것이며, 본 발명의 범 위를 한정하기 위한 것이 아니다. 본 발명의 결과를 달성하면서 그리고/또는 본 발명의 범위를 벗어나지 않으 면서 도시되고 설명된 실시예들에 대한 변경이 이루어질 수 있다. 또한, 본 발명의 일부 결과 또는 장점은 다 른 특징을 활용하지 않고 본 발명의 특징 중 일부를 선택함으로써 달성될 수 있음이 이해될 것이다. 따라서, 당 업자는 본 발명에 대한 수정 및 변형이 가능하고 특정 상황에서 바람직할 수도 있으며, 본 발명의 일부를 구성 할 수 있음을 인식할 것이다. 본 발명의 실시예는 엔드투엔드 분석 자산 수명 주기 관리를 위한 중앙 집중식 플랫폼인 '원스톱 상점'을 제공 한다. 이러한 자산의 예로는 ML 모델이 있다.도 1은 ADAM 플랫폼이 조직의 엔터프라이즈 데이터 시스템에 어떻게 통합될 수 있는지를 보여주는 모식도이다. 데이터는 다양한 소스에서 수신되어 텍스트, 비디오, 이미지 등 다양한 형식으로 저장된다. 일단 저장된 데이터 는 '구성 및 소비' 영역에 설명된 대로 일련의 작업을 통해 활용될 수 있다. 이러한 작업을 통해 데이터를 적절 한 포맷으로 변환하면 ADAM 플랫폼이 데이터와 상호 작용할 수 있게 된다. 이러한 일련의 작업과 데이터 변환은 전체 ADAM 플랫폼의 각 참여자 또는 기여자에 의해 수행되며, 위에서 설명한 대로 EVA 시스템이라고 한다. 중요 한 것은 각 위치 또는 국가 전체가 하나 이상의 고유한 데이터 세트를 제공하는 하나의 EVA 시스템이 된다는 것 이다. 데이터가 적절하게 저장되면, ADAM 플랫폼은 데이터에 대한 추가 작업을 수행할 수 있다. 이러한 작업에는 분석, 시각화, 모델링, ML, DL, AI, 휴리스틱 및 기타 알고리즘을 통한 데이터 세트의 학습, 하나 이상의 데이 터 세트와 관련된 분석 및 예측을 위한 ML, DL, AI, 휴리스틱 및 기타 알고리즘의 적용 등이 포함되나 이에 국 한되지 않는다. ADAM 플랫폼의 중요한 특징은 중앙 집중화를 통해 하나 이상의 조직 내 다양한 출처와 부문에서 수신한 다양한 데이터 세트를 플랫폼에 노출하고 학습시킬 수 있다는 점이다. 이를 통해 유사하고 고유한 데이터 세트의 결합, 통합 및/또는 '교차 수분(cross-pollination)'이 가능하며, 이를 통해 ADAM 플랫폼은 대부분 유사한 데이터 세 트로 학습된 플랫폼이나 모델로는 불가능했던 고유한 예측을 수행할 수 있다. 도 2는 ADAM 플랫폼이 EVA 시스템을 통해 익명화된 데이터(개인 식별 정보 또는 \"PII\" 데이터)와 상호 작용할 수 있는 방법을 보여주는 개략도이다. 첫째, 원시 데이터는 각 위치 또는 국가에서 EVA 시스템에 의해 수신, 수 집 또는 획득된다. 둘째, 원시 데이터는 EVA 시스템에서 수행하는 일련의 작업을 통해 익명화된다. 셋째, 익명 화된 데이터는 해당 위치 또는 국가에서 ADAM 플랫폼이 중앙에서 호스팅되는 클라우드 기반 서버로 이동 또는 전송된다. 넷째, 익명화된 데이터의 형식은 여전히 익명화된 데이터를 사용하여 ADAM 플랫폼이 쿼리하고 학습할 수 있도록 한다. 다섯째, 데이터를 상호 작용할 수 있는 다른 매체로 전송하거나 전송하는 일반적인 작업과 달 리 ADAM 플랫폼과 그 알고리즘 및/또는 모델은 각 개별 위치 또는 국가에 배포되어 실제 데이터를 분석하고 예 측할 수 있다. 여섯째, 분석 및 예측 결과는 사용 가능한 관련 데이터 세트의 결과로 각 개별 위치 또는 국가에 고유하며, 이를 통해 각 EVA 시스템(위치 또는 국가)에서 이러한 결과를 수익화할 수 있다. 각 국가로 데이터를 내보낼 경우 GDRP 또는 POPI와 같은 데이터 규정을 위반하거나 위반할 가능성이 있기 때문 에 이는 본 발명의 중요한 특징이다. 따라서 익명화된 데이터를 사용하여 ADAM 플랫폼과 관련 모델을 학습시킨 다음 각 위치에서 실제 데이터에 대해 ADAM 플랫폼과 관련 모델을 사용하여 분석을 얻고 예측을 수행하면 사용 자 개인 정보를 침해하지 않고 방대한 데이터 호수를 활용할 수 있다. 도 3은 ADAM 플랫폼을 '그룹 플랫폼'으로 배포하는 방법을 보여주는 개략도이다. 위의 도 2에서 설명한 대로 CICD를 통해 운영 중인 회사 데이터 시스템에 연결할 수 있다. 이 경우 IP 및 소유권 유지, 자산 재사용성, '한 번 구축하면 여러 개 배포(build once deploy many)'라는 접근 방식이 장점으로 작용할 수 있다. 본 발명의 실시예에서, ADAM 플랫폼은 모델 개발 프로세스를 테스트 및 프로덕션으로 촉진함으로써 위에서 언급 한 문제 및 단점이 발생하지 않도록 하는 것을 목표로 한다. ADAM과 같은 솔루션이 없다면, 조직의 리소스는 예 를 들어 오픈 소스(1인 또는 팀 노트북 기반) 솔루션을 사용하여 이러한 시스템을 구축해야 하는데, 이는 쉽게 사용할 수 있지만 신뢰성 및 확장성에 상당한 문제가 있는 경우가 많다. 또한 이러한 모델을 계속 운영하려면 상당한 노력이 필요하다. 이러한 개별 오픈 소스 기술 및 접근 방식을 통해 ML 모델을 생산화하기 위한 일반적인 추정치는 3개월을 초과 할 수 있지만, ADAM 플랫폼의 실시예에서는 동일한 리소스 풀을 사용하여 이를 2~3주로 단축할 수 있다. 이는 오늘날 기업이 수익률을 높이기 위해 필요로 하는 이러한 모델의 수를 고려할 때 매우 중요하다. 따라서 조직의 모델링 팀은 도면에 표시된 대로 플랫폼을 사용하여 조직의 수요를 따라잡을 수 있다. 이 플랫폼의 관리 및 구현의 몇 가지 주요 단계에는 다음이 포함될 수 있다: · 거버넌스 위원회 활용 · 혁신 허브, 협업 · 내부 클라우드 소스 · 분석 자산(예: 모델) 엔드투엔드 수명 주기 - AiOps 생성, 비교, 애자일 제공, 생산화, 측정, 재교육/재창조 등으로 이어지는 DevOpS/MLOpS. 플랫폼의 일부 기능/모듈에는 다음이 포함될 수 있다: · 분석 자산 카탈로그 · 분석 코드 리포지토리 · 자가 치유 모델 · 모델 관리 · 중앙 개발 및 모델 관리, 협업 환경 · 의사 결정 과학 워크벤치 - ML, DL뿐만 아니라 시뮬레이션, 예측, AI 등을 위한 워크벤치 · 개발 및 배포의 탈중앙화(한 번 만들고 많이 사용). · 조직의 데이터 웨어하우스(예: MTN EVA/DaaS) 준수 · 배치 또는 빈도 모델과 스트리밍 또는 실시간 처리 및 모델링. · 모델 알고리즘, 패키지 및 라이브 라이브러리 액세스 · 모델 상호 운용성 · 실행 · 의사 결정 · 규칙 · 권장 사항 본 발명의 실시예에서 다양한 사용자가 ADAM 플랫폼과 상호 작용할 수 있다: · 데이터 과학자 · 코더 - 예: R, Python, SAS Miner 등 · 모델/리스 관리자 · 소비자 - 예: 인사이트, Excel 기수, 비즈니스 분석가, 비즈니스 및 IT 시스템과 프로세스, 외부 B2B 파트너 등 도 4는 ADAM 플랫폼의 예시를 포함한 예시적인 데이터 시스템 아키텍처이다. 예시적인 ADAM 플랫폼에는 통신 및 기타 서비스 제공업체가 운영을 관리하고 비즈니스 기능을 지원하기 위해 일반적으로 사용하는 OSS(운영 지원 시스템) 및 BSS(비즈니스 지원 시스템) 소프트웨어 시스템과 관련된 데이터에 대한 액세스가 포함된다. 또한 ADAM 플랫폼을 사용하면 사용 가능한 데이터 소스 및 외부 데이터 소스에서 데이터를 시각화하고 가져올 수 있 다. 여러 API도 통합되어 즉시 사용할 수 있다. 그런 다음 지속적으로 추가 데이터 세트를 수신하는 대규모 데 이터 레이크를 포함한 다양한 데이터 세트에서 ADAM 모델을 학습하고 배포할 수 있으므로, ADAM 플랫폼과 모델 이 배포된 모든 후속 데이터 세트에 대해 보다 효율적으로 학습할 수 있다. 도 5는 ADAM 플랫폼과 온프레미스 시스템 간의 데이터 파이프라인을 보여준다. 위에서 설명한 대로 각 위치 또 는 국가의 온프레미스 데이터는 익명화된 데이터로 CI/CD(지속적 통합/지속적 배포)를 통해 ADAM 플랫폼으로 전 송되거나 업로드된다. 학습이 완료되면 실제 데이터에 대한 모델 코드를 다운로드하여 ADAM 플랫폼을 모든 사업 장에 배포할 수 있다. 도 6은 운영 중인 ADAM 플랫폼의 예시적인 개요를 보여준다. 비즈니스 시맨틱 계층(\"BSL\")에는 비즈니스 사용자 가 이미 생성된 지표와 KPI를 사용할 수 있는 큐레이팅되고 관리되는 데이터 위치가 포함된다. 도 7 - 9는 일련의 아키텍처 원칙을 준수하는 모범적인 ADAM 플랫폼의 세부 사항을 보여준다. 도 10은 본 발명의 실시예에서 사용될 수 있는 예시적인 논리 아키텍처의 개략도이다."}
{"patent_id": "10-2024-7038263", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "아래 표 1은 아키텍처의 각 구성 요소 계층이 ADAM 플랫폼을 구현하기 위해 제공할 수 있는 전반적인 책임을 나 타내는 예시적인 아키텍처 청사진의 다양한 계층을 요약한 것이다. 표 1 컴포넌트/레이어 설명 교육 데이터마트모델 학습/생성을 위한 익명화된 더미 필수/특정 EVA 데이터 스키마. AA 데이터마트 AA 데이터마트 - 모든 모델 생성을 위해 데이터마트에서 미리 만든 표준을 적용하고 새 로운 기능이 필요하면 업데이트하는 기능이다. 에셋 카탈로그 및 모델 라이브러리입력 세트 및 출력(예측) 변수, 빈도 등과 함께 생성된 모든 모델 목록이다. 한 번 사 용하면 다른 OpCo 및 현지화에 많은 유형을 재사용할 수 있다. 워크벤치 / IDE - 모델링 언어개발 프로세스 및 언어 표준화 - R, Python 등 단일 진실 데이터 리포지토리모델 마스터는 ADAM이 되고, 단일 정보 소스는 EVA가 된다. ADAM 제어/관리 플레인에 는 실제 데이터가 저장되지 않고 모델 학습을 위한 모델 라이브러리와 익명화된 데이터 만 저장된다. 모델 결과는 EVA에 저장된다. 데이터 및 분석사용자 플레인은 각 OpCo에서 모델을 EVA에 배포하고 EVA에서 실행한다. OpCo 다이내믹 스와 익명화된 데이터는 모델 생성을 위해 EVA에서 중앙 집중식 제어/관리 플레인으로 가져온다. 기술 인프라 ADAM 사용자 플레인 레이어는 온프레미스이다. 분석을 위한 단일 데이터 소스: 모든 모델 관리, 생성, 라이브러리, 재교육, OpCo에서 재사용을 위한 로컬라이제이션이 중앙 집중화된 위치에 있다. 이를 통해 GDRP 또는 POPI와 같은 현지 규제 요건을 위반하지 않도록 한다. ADAM 플랫폼은 제어/관리 플레인과 사용자 플레인의 두 가지 논리적 구성 요소로 나눌 수 있다. 제어/관리 플 레인은 중앙 집중화될 수 있으며, 예를 들어 조직의 그룹 수준에서 대부분의 ADAM 활동이 실행되고 연결된 모든 운영자가 사용할 수 있다. 경우에 따라 제어/관리 플레인에는 더미 또는 익명화된 데이터만 있을 수 있다. 일 부 OpCo는 ADAM 외부에서 개발될 수 있으며 모델을 ADAM으로 가져올 수 있다. 사용자 플레인에서는 ADAM 플랫 폼에서 개발된 모든 모델 또는 기타 분석 자산이 OpCo(또는 기타 로컬/온프레미스 지점)에서 로컬로 실행되도록 배포되며, 제어/관리 플레인은 모델의 성능과 정확도를 모니터링하도록 구성될 수 있다. 예를 들어 수출 금지 국가에 있는 법인의 경우, 개발된 모델은 ADAM의 제어 플레인에 연결할 필요 없이 로컬에서 실행될 수 있다. 도 11과 12는 MTN을 예로 들어 ADAM 플랫폼을 OpCo 엔티티에 통합하는 두 가지 예시적인 옵션을 보여준다. 기본 적으로 옵션 1은 파이버 네트워크 링과 네트워크 노드를 네트워크 토폴로지로 사용하고, 라우팅 기술인 MPLS(멀 티프로토콜 라벨 스위칭)와 함께 .NET 소프트웨어 프레임워크를 사용한다. 도 12의 옵션 2는 CI/CD를 소프트웨 어 개발 방법론으로 사용하여 코드 변경 사항을 코드 저장소에 커밋하여 소프트웨어를 빌드, 테스트 및 배포함 으로써 소프트웨어 개발 프로세스의 속도와 효율성을 개선하는 데 도움을 준다. 기본적으로 다음과 같은 옵션이 있다."}
{"patent_id": "10-2024-7038263", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "아래 표 2에는 ADAM 플랫폼의 몇 가지 대표적인 기능/모듈이 요약되어 있다. 표 2 # 기능 설명 1다중 사용자 여러 사용자가 동시에 시스템/플랫폼을 사용할 수 있다. 2클라이언트-서버 인터페이스웹/모바일 앱을 통해 전송된 클러스터에서 계산 및 처리가 이루어진다. 3드래그 앤 드롭 모델 개발시민 데이터 과학자가 드래그 앤 드롭을 통해 쉽게 모델을 개발할 수 있다. 4지속적 통합을 사용한 모델 패키징 및 배포모델을 REST 서비스/마이크로 서비스로 배포할 수 있다. 5모델 배포 Hadoop 클러스터 지원클러스터에서 모델 작업을 실행할 수 있다. 즉, 분산된 리소스를 활용 할 수 있다. 6모델 하이퍼 튜닝 및 그리드 검색모델 파라미터 최적화 지원 7앙상블 / 스태킹 모델 개발모델 스태킹 지원 8모델 모니터링 실행 중, 중지, 오류 등 라이브 모델의 상태 확인을 지원한다. 9모델 협업 개발 GitHub의 SVN을 통해 팀이 동일한 모델에서 작업할 수 있다. 10모델 개발 액세스 권한 제어모델 소유자가 액세스 제어 환경을 가질 수 있다. 11자동 데이터 정리/보관 이동사용하지 않는 데이터 보관 12병렬 진행 병렬 코드 작성 및 실행 허용13인공 지능 지원(최적화)ML을 넘어 인사이트에 대한 설정 작업을 끌어다 놓을 수 있다. 14GPU/TPU GPU/TPU에서 딥러닝 실행 지원 15기존 사용 사례 새로운 데이터 과학 플랫폼에서 쉽게 배포하기 16IDE 주피터랩/제플린 17데이터 구조화 및 비구조화 18프로그래밍 언어 오픈 소스 및 자동화 도구 19하드웨어 CPU; GPU; TPU 20모델 배포 여러 배포 옵션(예: MLFlowor 등가물) 21시스템 통합 비즈니스 애플리케이션과의 표준 기반 통합. Hadoop 등 기존 투자 활용 22조직(예: 그룹 수준) 표준조직에서 정한 표준을 준수한다. 운영 체제 및 환경 지원(클라우드, 온프레미스 또는 하이브리드 클라우 드). 보안 표준: 인증, 권한 부여 및 데이터 액세스. 플랫폼 배포의 유연성. 이 플랫폼은 협업, 내부 크라우드소싱, 자산 활용을 지원할 수 있으며, 그룹 본사 사무실, 운영 회사, 위성 유 닛, 고객 구내, 전 세계 공공장소 등 클라우드, 에지 및 온프레미스 로컬 배포와 분석 리소스 실행을 허용하도 록 구성할 수 있다. ADAM 플랫폼은 더 나아가 다음을 수행할 수 있다: · 회사의 내부 및 외부 고객과 운영 회사, 그룹 기능(CVM, 핀테크, 영업, 엔터프라이즈, 네트워크, 기술, 공공 (정부) 및 민간 파트너십)과 같은 파트너를 통합할 수 있다. · 기존의 업무 방식과 사용 사례를 개선하거나 향상시키고, 실시간 인사이트 및 경고 기반 조치, 데이터 기반 의사 결정과 같은 완전히 새로운 종류의 지능형 AI/ML 분석 솔루션을 제공함으로써 조직 내외부의 모든 비즈니 스 라인을 활성화하고 강화한다. · 데이터 과학자, 비즈니스 분석가, 비기술직 직원, 고위 경영진의 생산성과 효율성을 향상시킨다. · 데이터 및 분석에 대한 접근 방식을 변경하여 데이터 및 분석의 이점을 확산하는 데 도움이 되는 환경을 조 성함으로써 조직을 현대화하는 전략에 힘을 실어준다. 위에서 설명한 하나 이상의 기술은 도 13에 도시된 컴퓨터 시스템과 같은 하나 이상의 컴퓨터 시스템에서 또는 이를 사용하여 구현될 수 있다. 컴퓨터 시스템은 임의의 적합한 컴퓨터 또는 서버일 수 있거나 이를 포함할 수 있다. 컴퓨터 시스템은 통신 네트워크를 통해 연결된 원격 처리 장치들에 의해 작업이 수행되는 분산 클라우드 컴퓨팅 환경에서 구현될 수 있다. 분산 클라우드 컴퓨팅 환경에서, 컴퓨터 시스템에 의해 실행되는 프로그램 모듈은 로컬 및 원격 모두에 위치할 수 있다. 도 13에 도시된 예에서, 컴퓨터 시스템은 범용 컴퓨터의 특징을 갖는다. 이러한 구성 요소는 적어도 하나 의 프로세서, 메모리 및 메모리를 포함한 시스템의 다양한 구성 요소를 프로세서에 연결하는 버스를 포함할 수 있지만 이에 국한되지 않는다. 버스는 임의의 적합한 유형의 버스 구조 를 가질 수 있다. 컴퓨터 시스템은 이동식 및 비이동식 미디어, 휘발성 및 비휘발성 미디어와 같은 하나 이상의 상이한 유형의 판독 가능한 미디어를 포함할 수 있다. 따라서 메모리는 휘발성 메모리(예컨대, 랜덤 액세스 메모리(RAM) 및/또는 캐시 메모리)를 포함할 수 있으 며, 하드 드라이브와 같은 비이동식 비휘발성 미디어로부터 읽고 쓰도록 구성된 스토리지 시스템과 같은 다른 스토리지 미디어를 더 포함할 수 있다. 컴퓨터 시스템은 또한 적절한 비휘발성 미디어로부터 읽거나 적절한 비휘발성 미디어에 쓰기 위한 자기 디스크 드라이브 및/또는 광 디스크 드라이브(도시되지 않음)를 포함 하거나 이에 결합될 수 있음이 이해될 것이다. 이들은 하나 이상의 데이터 미디어 인터페이스를 통해 버스(10 6)에 연결될 수 있다. 메모리는 프로그램 모듈을 저장하도록 구성될 수 있다. 모듈들은 예를 들어, 운영 시스템, 하나 이상의 애플리케이션 프로그램, 다른 프로그램 모듈들, 및 프로그램 데이터를 포함할 수 있으며, 각 모듈들은 네트워킹 환경의 구현을 포함할 수 있다. 컴퓨터 시스템의 구성요소는 본 명세서에 설명된 바와 같이 본 발명의 실시예들의 기능 및/또는 방법론을 일반적으로 수행하는 모듈로 구현될 수 있다. 본 발명의 실시예들은 서로 통신적으로 결합될 수 있는 복수의 컴퓨터 시스템을 포함하거나 이에 의해 구현될 수 있음을 이해할 수 있을 것이다. 컴퓨터 시스템은 적어도 하나의 외부 장치와 통신 가능하게 결합될 수 있다. 예를 들어, 컴퓨터 시 스템은 모뎀, 키보드 및 디스플레이의 형태로 외부 장치와 통신할 수 있다. 이러한 통신은 적절한 입력/출력(I/O) 인터페이스를 통해 이루어질 수 있다. 컴퓨터 시스템은 또한 네트워크 인터페이스 장치(118/네트워크 어댑터)를 통해 적어도 하나의 네트워크(예 컨대, 인터넷 또는 로컬 영역 네트워크)와 통신하도록 구성될 수 있다. 네트워크 인터페이스 디바이스는 전술한 바와 같이, 버스를 통해 컴퓨터 시스템의 다른 요소들과 통신할 수 있다. 도 13에 표시되고 참조하여 설명된 구성 요소는 예시일 뿐이며, 다른 구성 요소가 표시된 구성 요소의 대안으로 또는 이와 함께 사용될 수 있음을 이해하게 될 것이다. 작업 예제 상기 도 1 내지 도 13의 가르침과 관련하여, 본 발명은 MTN의 다양한 OpCos 내에서 본 발명의 예시적인 적용을 사용하여 설명될 수 있다. 여러 국가의 EVA 시스템은 고객 행동, 소비 습관 등과 관련된 대규모 데이터 세트를 생성 및/또는 획득한다. 이 데이터는 각 EVA 시스템에 의해 익명화되어 ADAM 플랫폼에 업로드된다. 익명화된 데이터 세트에 대한 다양한 모 델, 알고리즘, 작업 및 추가 기능은 ADAM 모델에 의해 수행된다. 중요한 점은 익명화된 데이터 세트에 의해 ADAM 모델이 학습되는 각 인스턴스는 해당 데이터 세트와 다른 데이터 세트의 유사성에 관계없이 ADAM 모델이 지속적으로 학습됨에 따라 각 익명화된 데이터 세트에 대해 분석 및 예측을 수행할 수 있다는 것이다. 여기에는 중앙 집중화된 ADAM 모델의 고유한 특징 중 하나가 있다. 단순히 동질적인 데이터 세트에 의해 학습되는 것이 아니라 OpCos에서 제공하는 고유한 익명화된 데이터 세트에 의해 지속적으로 개선된다. ADAM 모델이 학습되면 모델 코드를 다운로드하여 각 EVA 시스템에 배포하여 실제 데이터에 사용할 수 있다. 특히 MTN OpCos와 관련하여 ADAM 모델을 다음과 같이 훈련한 후 배포했다: - 고객이 비활성 상태가 될 가능성이 높은 X일을 예측하여 이러한 고객을 개인화된 캠페인으로 타겟팅할 수 있 다; - 고객을 여러 세그먼트로 세분화하여 맞춤형 캠페인으로 고객을 타겟팅할 수 있다; - 고객의 데이터 사용 추세를 파악하여 적절한 시점에 맞춤형 캠페인으로 고객을 타겟팅한다. - 고객이 가정, 회사, 병원 또는 기타 조직에 있는지 여부와 같은 조직의 구성원인지 여부를 파악하여 맞춤형 캠페인으로 고객을 타겟팅할 수 있다. 이는 몇 가지 예에 불과하지만, 중요한 점은 서로 다른 섹터 및/또는 서로 다른 기능을 가진 여러 OpCos의 데이 터 집합을 사용하면 단순히 동질화된 데이터 집합을 사용하는 모델에서는 불가능했던 중요한 추세를 식별할 수 있다는 점이다. 추가 고려 사항 본 발명의 양상은 시스템, 방법 및/또는 컴퓨터 프로그램 제품으로 구체화될 수 있다. 따라서, 본 발명의 측면 은 하드웨어, 소프트웨어 및/또는 하드웨어와 소프트웨어의 조합의 형태를 취할 수 있으며, 이는 일반적으로 본 원에서 \"구성 요소\", \"유닛\", \"모듈\", \"시스템\", \"요소\" 등으로 지칭될 수 있다. 본 청구범위에서 사용되는 모듈은 하나 이상의 특정 작업을 수행할 수 있는 코드 또는 소프트웨어 프로그램의 집합으로 이해될 것이다. 각 모듈은 동일하거나 유사한 기능을 수행할 수 있는 복수의 소프트웨어 프로그램 또 는 코드를 포함한다는 것이 더 이해될 것이다. 통신적으로 결합된 것은 디바이스 또는 플랫폼 간의 정보, 명령 또는 데이터 교환을 의미하지만 이에 국한되지 않는다. 또한, 본 발명의 양상은 컴퓨터 판독 가능한 프로그램 코드가 구현된 하나 이상의 컴퓨터 판독 가능 저장 매체 에 구현된 컴퓨터 프로그램 제품의 형태를 취할 수 있다. 예를 들어, 컴퓨터 판독 가능 저장 매체는 전자, 자 기, 광학, 전자기, 적외선 또는 반도체 시스템, 장치 또는 장치 또는 이들의 임의의 적절한 조합일 수 있다.본 명세서의 맥락에서, 컴퓨터 판독 가능 저장 매체는 실행을 위해 또는 시스템, 장치 또는 장치와 관련하여 프 로그램을 저장할 수 있는 임의의 적절한 매체일 수 있다. 프로그램 코드/명령어는 단일 장치, 복수의 장치(예: 로컬 및 원격 장치), 단일 프로그램 또는 더 큰 시스템/패키지의 일부로 실행될 수 있다. 본 발명은 독립적인 컴퓨터 또는 컴퓨터 네트워크에 참여하는 프로세서를 포함하는 임의의 적절한 형태의 컴퓨 터 시스템 상에서 수행될 수 있다. 따라서, 본원에 개시된 방법 및/또는 시스템을 구현하는 명령어로 프로그램 된 컴퓨터 시스템, 본 발명의 양상을 수행하도록 프로그램된 컴퓨터 시스템 및/또는 범용 컴퓨터를 본 발명의 양상에 기초한 시스템으로 변환하기 위한 컴퓨터 판독 가능한 명령어를 저장하는 매체는 본 발명의 범위에 속할 수 있다. 도면에 포함된 차트 및/또는 도면은 본 발명의 하나 이상의 실시예에 따른 하나 이상의 시스템, 방법 및/또는 컴퓨터 프로그램 제품의 구현의 예를 예시한다. 도면들에서 하나 이상의 블록은 특정 논리 기능을 구현하기 위 한 하나 이상의 실행 가능한 명령어를 포함하는 코드의 구성요소, 세그먼트 또는 일부를 나타낼 수 있음을 이해 해야 한다. 일부 다른 실시예에서, 블록에서 식별되는 동작 또는 기능은 도면에 도시된 것과 다른 순서로 발생 하거나 동시에 발생할 수 있다. 도면에 도시된 블록 또는 단계는 시스템 구성요소 또는 컴퓨터 프로그램 명령어에 의해 구현될 수 있음을 이해 할 수 있을 것이다. 컴퓨터 또는 기타 장치의 프로세서를 통해 실행될 수 있는 명령어는 도면에 도시된 기능 또는 동작을 구현하기 위한 수단을 설정하거나 생성할 수 있도록 적절한 컴퓨터 또는 기타 장치의 프로세서에 제공될 수 있다."}
{"patent_id": "10-2024-7038263", "section": "도면", "subsection": "도면설명", "item": 1, "content": "이제 첨부된 도면을 참조하여 본 발명을 예시적으로 더욱 상세히 설명하겠다. 도면에서: 도 1은 ADAM 플랫폼이 조직의 엔터프라이즈 데이터 시스템에 통합되는 방식의 예를 보여주는 개략도이다. 도 2는 ADAM 플랫폼이 익명화된 데이터(개인 식별 정보 또는 \"PII\" 데이터)와 EVA 시스템을 통해 어떻게 상호 작용할 수 있는지를 보여주는 개략도이다. 도 3은 ADAM 플랫폼이 '그룹 플랫폼'으로 배포되는 방법을 보여주는 개략도이다. 도 4는 ADAM 플랫폼의 예시를 포함한 예시적인 데이터 시스템 아키텍처이다. 도 5는 ADAM 플랫폼과 온프레미스 시스템 간의 데이터 파이프라인을 보여주는 도면이다. 도 6은 운영 중인 ADAM 플랫폼의 예시적인 개요를 보여준다. 도 7은 첫 번째 아키텍처 원칙을 준수하는 모범적인 플랫폼의 준수 사항을 자세히 설명하는 표이다. 도 8은 두 번째 아키텍처 원칙을 준수하는 모범적인 플랫폼의 세부 사항을 보여주는 표이다. 도 9는 세 번째 아키텍처 원칙을 준수하는 모범적인 플랫폼의 사례를 자세히 설명하는 표이다. 도 10은 본 발명의 실시예에서 사용될 수 있는 예시적인 논리 아키텍처의 개략도이다. 도 11은 ADAM의 그룹 인스턴스를 조직의 운영 회사와 통합하는 첫 번째 옵션을 보여주는 개략도이다. 도 12는 ADAM의 그룹 인스턴스를 조직의 운영 회사와 통합하는 두 번째 옵션을 보여주는 개략도이다. 도 13은 본 발명의 다양한 측면에 따라 기능 및/또는 동작을 제공하기 위해 컴퓨터 프로그램 제품을 실행할 수 있는 예시적인 컴퓨터 시스템의 블록 구성도이다."}
