{"patent_id": "10-2023-0074239", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0113360", "출원번호": "10-2023-0074239", "발명의 명칭": "시설농장용 무인 재배 로봇시스템", "출원인": "전북대학교산학협력단", "발명자": "김형석"}}
{"patent_id": "10-2023-0074239", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "시설농장용 무인 재배 로봇시스템에 있어서,이동 가능하게 구성된 로봇본체부;상기 로봇본체부의 균형을 유지하기 위해 구성되는 로봇균형장치부;상기 로봇본체부에 장착되는 작업용로봇팔; 및상기 로봇본체부 및 상기 작업용로봇팔의 구동을 제어하고, 상기 로봇본체부의 균형이 유지되도록 상기 로봇균형장치부를 제어하며, 영상이나 소리신호를 인식하는 제어/신호처리/통신부;를 포함하는 것을 특징으로 하는 시설농장용 무인 재배 로봇시스템."}
{"patent_id": "10-2023-0074239", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 로봇본체부는,길이에 비해 폭이 좁게 형성되어 수용공간이 마련되고, 상기 제어/신호처리/통신부가 내장된 로봇바디;상기 로봇바디의 하부에 설치되고 바퀴구동부가 구비된 바퀴부; 및상기 작업용로봇팔, 상기 로봇균형장치부, 상기 바퀴구동부 및 상기 제어/신호처리/통신부의 구동을 위한 전원을 공급하는 전원공급부;를 포함하는 것을 특징으로 하는 시설농장용 무인 재배 로봇시스템."}
{"patent_id": "10-2023-0074239", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 로봇바디에 내장된 상기 제어/신호처리/통신부는 복수 개의 CPU와 복수의 고속 병렬처리용 GPU 및 메모리및 통신장치들로 구성된 하드웨어와 상기 로봇본체부에 설치된 엑츄에이터의 제어기능을 수행시키고, 소리나 영상 인식을 위한 인공지능 및 정보저장 기능과 고속통신기능을 수행시키는 소프트웨어로 구성된 것을 특징으로하는 시설농장용 무인 재배 로봇시스템."}
{"patent_id": "10-2023-0074239", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 바퀴부는, 작업로가 비포장인 경우에도 원활한 이동이 가능하도록 요철 표면을 갖는 타이어 바퀴가 전후로 배치되는 구조;또는 상기 작업로의 폭보다 서로 간에 간격이 좁게 좌우로 배치된 복수의 바퀴가 전후로 배치되는 구조;로 구성되는것을 특징으로 하는 시설농장용 무인 재배 로봇시스템.공개특허 10-2024-0113360-3-청구항 5 제1항에 있어서,상기 로봇균형장치부는,상기 로봇본체부의 기울기 정도 및 기울어진 방향을 감지하는 균형감지부;상기 로봇본체부 이동경로상의 천정에 이격 설치되는 한 쌍의 제1 천정레일 및 제2 천정레일; 상기 제1 천정레일 및 제2 천정레일에 이동 가능하게 설치되는 레일이동체;상기 레일이동체에 자유단이 결속되는 제1 로프 및 제2 로프; 및상기 제1 로프 및 제2 로프가 각각 결속, 권취되고 상기 제어/신호처리/통신부의 제어하에 구동되는 제1 로프장력제어모터 및 제2 로프장력제어모터;를 포함하는 것을 특징으로 하는 시설농장용 무인 재배 로봇시스템."}
{"patent_id": "10-2023-0074239", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 로봇균형장치부는 상기 로봇본체부의 폭보다 길이가 길게 형성되어 상기 로봇본체부의 폭 방향으로 설치되는 균형유지보조막대;를 더 구비하고,상기 제1 로프장력제어모터 및 제2 로프장력제어모터는 상기 균형유지보조막대의 일측 및 타측에 설치되는 것을특징으로 하는 시설농장용 무인 재배 로봇시스템."}
{"patent_id": "10-2023-0074239", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 균형감지부는, 상기 로봇본체부에 설치되고 감지된 신호를 상기 제어/신호처리/통신부에 인가하는 균형감지센서; 및 작업로의 중앙선과 평행하게 천정에 표시한 천정중앙선의 위치를 찾아 촬영할 수 있도록 상기 로봇균형장치부에설치되고 상기 로봇본체부의 균형 유지를 위한 촬영 영상을 상기 제어/신호처리/통신부에 제공하는 중앙선촬영카메라; 중에서 적어도 하나 이상을 포함하는 것을 특징으로 하는 시설농장용 무인 재배 로봇시스템."}
{"patent_id": "10-2023-0074239", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 작업용로봇팔은, 상기 로봇본체부의 일측 및 타측으로 배치되게 복수로 구성되고, 상기 로봇본체부에 설치되고 작업 위치로 이동되는 작업부이동수단 및, 상기 작업부이동수단에 접속되는 작업부를 포함하는 것을 특징으로 하는 시설농장용 무인 재배 로봇시스템."}
{"patent_id": "10-2023-0074239", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 작업부는 글리핑 및 언글리핑 동작을 수행하도록 구성된 글리퍼, 및 상기 글리퍼와 근접하여 설치되는 로봇팔카메라를 구비하고,상기 작업부이동수단은 선형이동링크본체와 상기 선형이동링크본체에서 출몰되는 또 다른 선형이동링크가 구비된 직선이동기구를 포함하는 것을 특징으로 하는 시설농장용 무인 재배 로봇시스템.공개특허 10-2024-0113360-4-청구항 10 제9항에 있어서,상기 직선이동기구는 전기식 선형엑츄에이터; 공압실린더를 구비한 공압이동기구; 유압실린더를 구비한 유압이동기구; 중에서 어느 하나로 구성되는 것을 특징으로 하는 시설농장용 무인 재배 로봇시스템."}
{"patent_id": "10-2023-0074239", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제8항에 있어서,상기 작업부는,상기 글리퍼의 상하방향 높낮이 조절이 가능하도록 상기 작업용로봇팔의 단부에 설치되는작업용선형엑츄에이터;상기 작업용로봇팔의 단부와 상기 작업용선형엑츄에이터 사이에 구비되는 관절부에 설치되고 상기 작업용선형엑츄에이터를 회전 시키는 작업용회전엑츄에이터; 분무 작용을 수행하도록 구성된 분사노즐을 구비한 분사수단; 및 종자의 식재 동작을 수행하는 종자 식재장치; 중에서 적어도 하나 이상이 더 구비되는 것을 특징으로 하는 시설농장용 무인 재배 로봇시스템."}
{"patent_id": "10-2023-0074239", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제8항에 있어서,상기 작업용로봇팔은 로봇팔 회전 장치부에 의해 상기 로봇본체부에 회전 가능하게 장착되는 것을 특징으로 하는 시설농장용 무인 재배 로봇시스템."}
{"patent_id": "10-2023-0074239", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제8항에 있어서,상기 작업용로봇팔은 상기 로봇본체부 일측에 배치되게 설치되는 일측 작업용로봇팔과, 상기 로봇본체부 타측에배치되는 타측 작업용로봇팔을 구비하고,상기 로봇팔회전장치부는, 상기 로봇본체부에 설치되는 지지축, 상기 지지축에 삽입되고 상기 일측 작업용로봇팔이 올려지는 제1 베어링, 상기 지지축에 삽입되고 상기 타측 작업용로봇팔이 올려지는 제2 베어링을 포함하는것을 특징으로 하는 시설농장용 무인 재배 로봇시스템."}
{"patent_id": "10-2023-0074239", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 로봇팔회전장치부는, 상기 일측 작업용로봇팔에 접속되는 제1 회전구동수단과, 상기 타측 작업용로봇팔에접속되는 제2 회전구동수단을 구비하되, 상기 제1 회전구동수단 및 제2 회전구동수단은 구동모터와, 상기 타측작업용로봇팔 및 일측 작업용로봇팔에 접속되고 상기 구동모터로부터 구동력을 전달받아 회전동작을 수행하는중공로터리 엑츄에이터 감속기를 포함하는 것을 특징으로 하는 시설농장용 무인 재배 로봇시스템."}
{"patent_id": "10-2023-0074239", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "공개특허 10-2024-0113360-5-제8항에 있어서,상기 작업용로봇팔은, 복수의 축이 관절부에 의해 연결되고 상기 복수의 축을 회전시키는 구동모터를 포함하는축구동부가 구비된 다관절 로봇팔로 구성되는 것을 특징으로 하는 시설농장용 무인 재배 로봇시스템."}
{"patent_id": "10-2023-0074239", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제5항 내지 제7항 중 어느 한 항에 있어서,상기 제어/신호처리/통신부는, 상기 균형감지부로부터 인가되는 감지신호를 기초로 상기 로봇본체부의 기울어진정도 및 기울어진 방향을 검출하고 상기 제1 로프장력제어모터 및 제2 로프장력제어모터의 구동에 따른 상기 제1 로프 및 제2 로프의 감김 및 풀림 동작을 통해 길이 및 장력 조절을 수행하여 상기 로봇본체부의 균형이 유지되도록 제어하는 것을 특징으로 하는 시설농장용 무인 재배 로봇시스템."}
{"patent_id": "10-2023-0074239", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제2항 내지 제15항 중 어느 한 항에 있어서,상기 제어/신호처리/통신부는 일측 및 타측으로 배치된 상기 작업용로봇팔의 자세와 상기 로봇본체부의 무게중심 위치의 상관관계를 인공지능에 의해 학습한 무게중심 학습모델을 저장하고, 상기 무게중심 학습모델을 기초로 상기 작업용로봇팔의 특정 자세에 대응하여 상기 로봇본체부의 무게중심의 위치를 산출하여, 상기 로봇본체부의 균형이 유지되도록 제어하는 것을 특징으로 하는 시설농장용 무인 재배 로봇시스템."}
{"patent_id": "10-2023-0074239", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제2항 내지 제14항 중 어느 한 항에 있어서.상기 제어/신호처리/통신부는 일측 및 타측으로 배치된 상기 작업용로봇팔의 돌출된 길이를 제어하여 상기 로봇본체부의 균형이 유지되도록 하는 것을 특징으로 하는 시설농장용 무인 재배 로봇시스템."}
{"patent_id": "10-2023-0074239", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제2항 내지 제15항 중 어느 한 항에 있어서상기 제어/신호처리/통신부는 일측 및 타측으로 배치된 상기 작업용로봇팔 중에서 상기 일측 작업용로봇팔에 설정된 중량 이상의 작업물체를 로딩하는 경우 상기 타측 작업용로봇팔에 상기 작업물체의 하중에 근접하는 균형하중체를 로딩한 상태에서 상기 로봇본체부의 균형이 유지되도록 제어하는 것을 특징으로 하는 시설농장용 무인재배 로봇시스템."}
{"patent_id": "10-2023-0074239", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 시설농장용 무인 재배 로봇시스템에 관한 것으로서, 더욱 상세하게는, 로봇의 폭이 좁아서 작업로가 협소하더라도 편리하고 효과적으로 사용할 수 있고, 로봇의 폭이 좁더라도 균형 유지 동작이 안정적으로 이루어 지며, 무 레일 방식으로 구성되어 경운 작업이 용이하고, 전기에너지를 구동원으로 적용함으로써 온실 내부의 공 기오염을 최소화할 수 있는 시설농장용 무인 재배 로봇시스템에 관한 것이다. 본 발명에 따른 시설농장용 무인 재배 로봇시스템은 시설농장용 무인 재배 로봇시스템에 있어서, 이동 가능하게 구성된 로봇본체부; 상기 로봇본체부에 장착되는 작업용로봇팔; 상기 로봇본체부의 균형을 유지하기 위해 구성되 는 로봇균형장치부; 및 상기 로봇본체부 및 상기 작업용로봇팔의 구동을 제어하고, 상기 로봇본체부의 균형이 유 지되도록 상기 로봇균형장치부를 제어하는 제어/신호처리/통신부;를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2023-0074239", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 시설농장용 무인 재배 로봇시스템에 관한 것으로서, 더욱 상세하게는, 로봇의 폭이 좁더라도 균형 유 지가 안정적으로 이루어지며, 무 레일 방식으로 구성되어 경운 작업이 용이하고, 전기에너지를 구동원으로 적용 함으로써 온실 내부의 공기오염을 최소화할 수 있는 시설농장용 무인 재배 로봇시스템에 관한 것이다."}
{"patent_id": "10-2023-0074239", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로, 시설 농업은 농업환경제어가 용이하고, 병해충 예방에 유리하며, 온도 조절까지 가능하여 농가소득 향상에 매우 큰 기여를 하고 있다. 그러나, 시설 농업은 많은 노동력이 요구되기 때문에 인부들에 대한 인건비 지출이 크고, 이에 따라 수익이 감 소하여 농업 인들의 도시 이주가 심화되고 있다. 뿐만 아니라, 또 고령화의 진행으로 인하여 농업노동인력은 더 욱 감소하게 되어, 농업의 지속에 어려움이 가중되고 있다. 본 발명은 농업의 이 같은 문제를 최근 발달된 인공지능과 로봇기술을 이용하여 해결하고자 하는 것이다. 시설농장의 대부분인 비닐하우스는 내부가 협소하고, 작업로의 폭도 좁아서 노지용의 4 바퀴형 로봇은 그 비닐 하우스 활용에 어려움이 있으므로, 협소한 작업로를 가진 시설농장에 적합한 특수로봇 시스템이 제안되고 있다. 최근 제안되고 있는 시설온실용 로봇에는 자율주행형 로봇과 시설온실 내부에 거치되는 갠트리 로봇이 있다. 자율주행형 로봇은 시설온실의 내부에서 작업용 로봇이 자율적으로 이동하면서 각종 작업을 수행하는 것이나 로 봇의 이동에 넓은 통로가 필요하여 이로 인해 시설온실의 재배량이 감소하게 되는 단점이 있다. 갠트리 로봇은 시설온실 내부에서 3 차원 공간을 이동하면서 작업을 수행하도록 구성되어 재배량에 영향을 끼치 지 않는 장점이 있지만, 시설온실에 일체형으로 설치됨에 따라 설치 및 해체 비용이 많이 소요되는 단점이 있다. 또한 상기 갠트리 로봇은 노면 상태나 시설온실이 설치된 지면의 경사도 등으로 인해 갠트리 로봇의 수평 이동 이 어려워지거나 직진성이 떨어지는 문제점이 있다. 더 중요한 단점은 비닐하우스의 동 간의 이동이 불가능하고, 이동레일이 작업에 장애요인으로 작용하는 등의 문제점이 있다. 종래 자율주행형 로봇이나 갠트리 로봇은 전술한 바와 같이 다양한 문제점을 가지고 있을 뿐만 아니라 협소한 작업로의 시설농장에서의 적용이 어려우므로 새로운 형태의 무인 재배 로봇이 절실히 요구되고 있는 실정에 있 다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허 제10-1657663호 \"농업용 이송로봇 시스템\" (특허문헌 0002) 한국등록특허 제10-1389012호 \"농업용 방제로봇\" (특허문헌 0003) 한국등록특허 제10-1968759호 \"농사 작업용 케이블 로봇\""}
{"patent_id": "10-2023-0074239", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기 내용에 착안하여 제안된 것으로, 로봇본체부의 폭이 좁아서 작업로가 협소하더라도 편리하고 효 과적으로 사용할 수 있고, 로봇본체부의 폭이 좁더라도 균형 유지 동작이 안정적으로 이루어져 작업성 및 안전 성이 향상되도록 한 시설농장용 무인 재배 로봇시스템을 제공하는데 그 목적이 있다. 본 발명의 다른 목적은, 무 레일 방식으로 구성되어 경운 작업이 용이하고, 전기에너지를 구동원으로 적용함으 로써 온실 내부의 공기오염을 최소화할 수 있도록 한 시설농장용 무인 재배 로봇시스템을 제공하는 것이다."}
{"patent_id": "10-2023-0074239", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위해, 본 발명에 따른 시설농장용 무인 재배 로봇시스템은 이동 가능하게 구성된 로봇본 체부; 상기 로봇본체부의 균형을 유지하기 위해 구성되는 로봇균형장치부; 상기 로봇본체부에 장착되는 작업용 로봇팔; 상기 로봇본체부 및 상기 작업용로봇팔의 구동을 제어하고, 상기 로봇본체부의 균형이 유지되도록 상기 로봇균형장치부를 제어하며, 영상이나 소리신호를 인식하는 제어/신호처리/통신부;를 포함하는 것을 특징으로 한다. 상기 로봇본체부는, 길이에 비해 폭이 좁게 형성되어 수용공간이 마련되고, 상기 제어/신호처리/통신부가 내장 된 로봇바디; 상기 로봇바디의 하부에 설치되고 바퀴구동부가 구비된 바퀴부; 및 상기 작업용로봇팔, 상기 로봇균형장치부, 상기 바퀴구동부 및 상기 제어/신호처리/통신부의 구동을 위한 전원을 공급하는 전원공급부;를 포 함하여 구성될 있다. 상기 로봇바디에 내장된 상기 제어/신호처리/통신부는 복수 개의 고성능 CPU와 복수의 고속 병렬처리용 GPU 및 메모리 및 고속 통신장치들로 구성된 하드웨어와 상기 로봇본체부에 설치된 엑츄에이터의 제어기능을 수행시키 고, 소리나 영상 인식을 위한 인공지능 및 정보저장 기능과 고속통신기능을 수행시키는 소프트웨어로 구성될 수 있다. 상기 바퀴부는, 작업로가 비포장인 경우에도 원활한 이동이 가능하도록 요철 표면을 갖는 타이어 바퀴가 전후로 배치되는 구조; 또는 상기 작업로의 폭보다 서로 간에 간격이 좁게 좌우로 배치된 복수의 바퀴가 전후로 배치되 는 구조;로 구성될 수 있다. 바람직하게, 상기 로봇균형장치부는, 상기 로봇본체부의 기울기 정도 및 기울어진 방향을 감지하는 균형감지부; 상기 로봇본체부 이동경로상의 천정에 이격 설치되는 한 쌍의 제1 천정레일 및 제2 천정레일; 상기 제1 천정레 일 및 제2 천정레일에 이동 가능하게 설치되는 레일이동체; 상기 레일이동체에 자유단이 결속되는 제1 로프 및 제2 로프; 및 상기 제1 로프 및 제2 로프가 각각 결속, 권취되고 상기 제어/신호처리/통신부의 제어하에 구동되 는 제1 로프장력제어모터 및 제2 로프장력제어모터;를 포함하여 구성될 수 있다. 상기 로봇균형장치부는 상기 로봇본체부의 폭보다 길이가 길게 형성되어 상기 로봇본체부의 폭 방향으로 설치되 는 균형유지보조막대;를 더 구비할 수 있다. 상기 제1 로프장력제어모터 및 제2 로프장력제어모터는 상기 균형유지보조막대의 일측 및 타측에 설치될 수 있 다. 상기 균형감지부는, 상기 로봇본체부에 설치되고 감지된 신호를 상기 제어/신호처리/통신부에 인가하는 균형감 지센서; 및 작업로의 중앙선과 평행하게 천정에 표시한 천정중앙선의 위치를 찾아 촬영할 수 있도록 상기 로봇 균형장치부에 설치되고 상기 로봇본체부의 균형 유지를 위한 촬영 영상을 상기 제어/신호처리/통신부에 제공하 는 중앙선촬영카메라; 중에서 적어도 하나 이상을 포함하여 구성될 수 있다. 상기 작업용로봇팔은, 상기 로봇본체부의 일측 및 타측으로 배치되게 복수로 구성되고, 상기 로봇본체부에 설치 되고 작업 위치로 이동되는 작업부이동수단 및, 상기 작업부이동수단에 접속되는 작업부를 포함하여 구성될 수 있다. 상기 작업부는 글리핑 및 언글리핑 동작을 수행하도록 구성된 글리퍼, 및 상기 글리퍼와 근접하여 설치되는 로 봇팔카메라를 구비할 수 있다. 상기 작업부이동수단은 선형이동링크본체와 상기 선형이동링크본체에서 출몰되는 또 다른 선형이동링크가 구비 된 직선이동기구를 포함하여 구성될 수 있다. 상기 직선이동기구는 전기식 선형엑츄에이터; 공압실린더를 구비한 공압이동기구; 유압실린더를 구비한 유압이 동기구; 중에서 어느 하나로 구성될 수 있다. 상기 작업부는, 상기 글리퍼의 상하좌우방향 및 높낮이 조절이 가능하도록 상기 작업용로봇팔의 단부에 설치되 는 작업용선형엑츄에이터; 상기 작업용로봇팔의 단부와 상기 작업용선형엑츄에이터 사이에 구비되는 관절부에 설치되고 상기 작업용선형엑츄에이터를 회전 시키는 작업용회전엑츄에이터; 분무 작용을 수행하도록 구성된 분 사노즐을 구비한 분사수단; 및 종자의 식재 동작을 수행하는 종자 식재장치; 중에서 적어도 하나 이상이 더 구 비될 수 있다. 상기 작업용로봇팔은 로봇팔 회전 장치부에 의해 상기 로봇본체부에 회전 가능하게 장착될 수 있다. 상기 작업용로봇팔은 상기 로봇본체부 일측에 배치되게 설치되는 일측 작업용로봇팔과, 상기 로봇본체부 타측에 배치되는 타측 작업용로봇팔을 구비할 수 있다. 상기 로봇팔회전장치부는, 상기 로봇본체부에 설치되는 지지축, 상기 지지축에 삽입되고 상기 일측 작업용로봇 팔이 올려지는 제1 베어링, 상기 지지축에 삽입되고 상기 타측 작업용로봇팔이 올려지는 제2 베어링을 포함하여 구성될 수 있다. 상기 로봇팔회전장치부는, 상기 일측 작업용로봇팔에 접속되는 제1 회전구동수단과, 상기 타측 작업용로봇팔에 접속되는 제2 회전구동수단을 구비하되, 상기 제1 회전구동수단 및 제2 회전구동수단은 구동모터와, 상기 타측작업용로봇팔 및 일측 작업용로봇팔에 접속되고 상기 구동모터로부터 구동력을 전달받아 회전동작을 수행하는 중공로터리 엑츄에이터 감속기를 포함하여 구성될 수 있다. 그리고, 상기 작업용로봇팔은, 복수의 축이 관절부에 의해 연결되고 상기 복수의 축을 회전시키는 구동모터를 포함하는 축구동부가 구비된 다관절 로봇팔로 구성될 수도 있다. 한편, 상기 제어/신호처리/통신부는, 상기 균형감지부로부터 인가되는 감지신호를 기초로 상기 로봇본체부의 기 울어진 정도 및 기울어진 방향을 검출하고 상기 제1 로프장력제어모터 및 제2 로프장력제어모터의 구동에 따른 상기 제1 로프 및 제2 로프의 감김 및 풀림 동작을 통해 길이 및 장력 조절을 수행하여 상기 로봇본체부의 균형 이 유지되도록 제어할 수 있다. 또 상기 제어/신호처리/통신부는 일측 및 타측으로 배치된 상기 작업용로봇팔의 자세와 상기 로봇본체부의 무게 중심 위치의 상관관계를 인공지능에 의해 학습한 무게중심 학습모델을 저장하고, 상기 무게중심 학습모델을 기 초로 상기 작업용로봇팔의 특정 자세에 대응하여 상기 로봇본체부의 무게중심의 위치를 산출하여, 상기 로봇본 체부의 균형이 유지되도록 제어할 수 있다. 그리고, 상기 제어/신호처리/통신부는 일측 및 타측으로 배치된 상기 작업용로봇팔의 돌출된 길이를 제어하여 상기 로봇본체부의 균형이 유지되도록 구성할 수 있다. 상기 제어/신호처리/통신부는 일측 및 타측으로 배치된 상기 작업용로봇팔 중에서 상기 일측 작업용로봇팔에 설 정된 중량 이상의 작업물체를 로딩하는 경우 상기 타측 작업용로봇팔에 상기 작업물체의 하중에 근접하는 균형 하중체를 로딩한 상태에서 상기 로봇본체부의 균형이 유지되도록 제어할 수 있다. 또, 상기 제어/신호처리/통신부는 소리나 영상 인식을 위한 인공지능을 수행시키는 기능과 외부와의 고속 통신 및 데이터들의 저장 기능도 담당하게 할 수 있다"}
{"patent_id": "10-2023-0074239", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 시설농장용 무인 재배 로봇시스템에 의하면, 로봇본체부의 폭이 좁아서 작업로가 협소하더라도 편리하고 효과적으로 사용할 수 있고, 로봇본체부의 폭이 좁아 농지의 잠식이 최소화 되므로 농작물의 생산량을 증가시킬 수 있을 뿐만 아니라 로봇의 폭이 좁더라도 균형 유지 동작이 안정적으로 이루어져 작업성 및 안전성 을 향상시킬 수 있는 효과가 있다. 본 발명에 따른 시설농장용 무인 재배 로봇시스템에 의하면, 무 레일 방식으로 구성됨에 따라 경운 작업이 용이 하고, 또한 무 레일에 의한 시설투자비를 절감할 수 있고 내연기관이 아니라 전기모터 구동방식을 적용함으로써 온실 내부의 공기오염을 최소화할 수 있는 효과가 있다."}
{"patent_id": "10-2023-0074239", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 바람직한 실시예를 첨부된 도면에 의거하여 상세히 설명하되 동일한 구성 요소에 대해서는 동 일한 참조번호가 부여하여 설명하도록 한다. 한편, 각각의 도면에서 일반적인 기술로부터 이 분야의 통상의 지식을 가진 자가 용이하게 알 수 있는 구성과 그에 대한 작용 및 효과에 대한 상세한 설명은 간략히 하거나 생략한다. 또한, 본 발명이 시설농장용 무인 재배 로봇시스템은 이해를 돕기 위해 주요 구성요소를 모식화 하거나 간략 화하여 도시한다. 도1 내지 도5d를 참조하면, 본 발명의 일 실시예에 따른 시설농장용 무인 재배 로봇시스템은 로봇본체부, 작 업용로봇팔(2a,2b), 로봇균형장치부, 상기 주요 구성의 구동을 제어하고 균형이 유지되도록 제어하며, 인공 지능을 이용하여 영상 및 소리를 인식 판단하는 제어/신호처리/통신부가 구비된 것으로서 로봇본체부의 폭이 좁아서 작업로가 협소하더라도 식물에 악영향을 주지 않으면서 편리하게 사용할 수 있고, 로봇본체부의 폭 이 좁더라도 균형 유지 동작이 안정적으로 이루어지도록 구성한 특징이 있다. 로봇본체부는 시설농장에 구름(회전)이동되는 구성요소로서 폭이 좁아 작업로가 협소하더라도 용이하게 이동 될 수 있도록 폭이 좁고 길이방향으로 긴 구조로 되어 있다. 로봇본체부는 대략 직육면체 형상의 함체로 구성된 로봇바디와, 로봇바디의 하부에 길이방향을 따라 구름(회전) 이동 동작을 수행하도록 설치되는 바퀴부가 구비되어 있다. 바퀴부는 로봇바디에 회전 가능하게 설치되는 바퀴와, 이 바퀴에 회전력을 인가하는 바퀴구동부 가 구비되어 있다. 그리고, 바퀴부는 구름동작을 통해 로봇본체부를 이동시킬 수 있다면 특별한 제한은 없지만, 좁은 작업로를 따라 이동할 수 있도록 1개 이상의 바퀴가 로봇본체부의 진행방향인 전후로 배치되는 구조로 구성된다. 이때, 바퀴는 작업로가 비포장인 경우에도 원활한 이동이 가능하도록 요철 표면을 갖는 타이어 바퀴로 구 성되는 것이 바람직하다. 또한 바퀴구동부는 통상 인휠 모터(In-Wheel Motor)로 호칭되는 것을 적용할 수 있는데, 이 인휠 모터는 바퀴 내에 모터를 포함하는 구동부품이 내장된 공지의 바퀴용 구동장치를 의미한다. 아울러 바퀴부는 고하중의 지지력이 요구되는 경우 전술한 방식 외에도 작업로의 폭보다 서로 간에 간격이 좁게 좌우로 배치된 복수의 바퀴가 전후로 배치되는 구조로도 구성할 수 있다. 로봇본체부는 로봇바디에 내장되어 외부와의 통신을 수행하는 통신모듈(미 도시)이 구비되어 있다. 통신모듈은 수집된 수집데이터를 통신하는 구성으로서 도시하지 않은 관리서버(미 도시), 외부 단말기 등과의 무선통신을 수행한다. 통신모듈은 LoRa, RF, LTE 기술 등으로 구현된 장치를 적용할 수도 있지만 대표적으로 WIFI 블루투스 무선 모듈로 구성될 수 있다. 로봇본체부는 작업용로봇팔(2a,2b), 로봇균형장치부, 바퀴구동부 및 통신모듈의 구동을 위한 전원을 공급 하는 2차전지모듈 등으로 구성된 전원공급부가 설치되어 있다. 한편, 제어/신호처리/통신부는 로봇 바디 내에 설치되는 복수 개의 고성능 CPU와 복수의 고속 병렬처리용 GPU들 및 메모리들로 구성된 하드웨어와 로봇에 설치된 모든 엑츄에이터들의 제어기능을 수행시키고, 소리나 영 상 인식을 위한 인공지능을 수행시키는 소프트웨어로 구성되고, 외부와의 고속 통신 및 데이터들의 저장도 담당 하게 할 수 있다. 더 자세하게는 로봇본체부 및 작업용로봇팔(2a,2b) 등의 구동을 제어하고, 로봇본체부의 균형이 유지되도 록 로봇균형장치부를 제어하는 기능을 수행하며, 복수 개의 고속 CPU와 GPU 및 메모리 등을 등을 장착하여 딥 러닝 또는 머신 러닝 등 인공지능을 실행할 수 있다. 여기서 인공지능은 식물이나 물체 영상이나 소리인식을 수행할 수 있으며, 작업용로봇팔의 자세와 로봇본체부의 무게중심 위치의 상관관계를 학습한 무게중심 학습모델 을 저장하고, 무게중심 학습모델을 기초로 작업용로봇팔의 특정 자세에 대응하여 로봇본체부의 무게중심의 위치 를 산출하여, 로봇본체부의 균형이 유지되도록 하는 제어 동작을 수행하게 한다. 한편, 작업용로봇팔(2a,2b)은 구성 수량에 특별한 제한은 없지만 본 실시예에서는 로봇본체부에 장착되어 식 물의 재배에 직접적으로 이용되는 구성요소로서 한 쌍으로 구성되되 로봇본체부에 일측 방향으로 배치되게 1개 가 설치되어 있고, 로봇본체부의 타측 방향으로 배치되게 1개가 설치되어 있다. 상기한 각 작업용로봇팔(2a,2b)은 로봇본체부에 설치되어 작업 위치로 이동되는 작업부이동수단, 작업부 이동수단에 접속되는 작업부, 및 작업부와 근접하여 설치되는 로봇팔 카메라를 구비한다.상기 작업부이동수단은 선형이동링크본체와 이 선형이동링크본체에서 출몰되는 또 다른 선형이동링크 가 구비된 직선이동기구로 구성될 수 있다. 직선이동기구는 로봇본체부에 설치되어 작업부를 전후진 시키는 구성요소로서, 전기식 선형엑츄에이터, 공압실린더를 구비한 공압이동기구, 유압실린더를 구비한 유압이동기구 등 다양한 전후진 이동수단을 선택하여 적용할 수 있다. 전기식 선형엑츄에이터는 선형엑츄에이터, 리니어 엑츄에이터, 1축 엑츄에이터, 전기 실린더 등으로 호칭되는 공지의 직선이동기구를 설치하여 구성할 수 있는 것으로서, 전술한 선형이동링크본체와, 선형이동링크본체 에서 전후진 동작되는 이동 로드부를 구비한다. 예컨대 선형이동링크본체는 통상 'LM가이드엑츄에이터'로 호칭되기도 하는 직선이동기구로서 주지된 바와 같이 스크류모터(미도시)에 의해 회전되도록 내장된 볼스크류(미도시)에 의해 슬라이더부재(미도시)가 가이드레 일(미도시)을 따라 전후진 되는 볼스크류 엑츄에이터로 구성될 수 있다. 이러한 볼스크류 엑츄에이터는 위치제 어가 정확하고 신속한 이동이 가능하므로 작업의 신속성 및 정확성을 도모할 수 있는 장점이 있다. 이동로드부는 볼스크류 엑츄에이터로 구성된 선형이동링크본체에 접속되어 전후진 되는 부재로서, 상 기한 슬라이더부재에 설치되는 이동바로 구성될 수 있다. 상기 작업부는 글리핑(Gripping, 파지) 및 언글리핑(Ungripping, 파지해지) 동작을 수행하도록 구성된 글리 퍼(글리핑수단,)가 구비되어 있다. 글리퍼는 구체적으로 도시하지는 않았으나 식물 재배에 필요한 도구 등의 글리핑 및 언글리핑 동작을 원활 하게 수행할 수 있다면 형태나 구조에 특별한 제한 없이 구성할 수 있다. 예컨대, 글리퍼는 마주보게 배치된 한 쌍의 그립과, 이 한 쌍의 그립을 작동시켜 글리핑 및 언글리핑 동작 을 수행하게 하는 글리핑작동장치(미도시)로 구성되어 있다. 보다 구체적으로 설명하면 글리핑작동장치는 슬라이더에 설치되어 그립을 벌리거나 모으는 동작을 수행하도록 작동력을 인가하는 구성요소로서, 전기식 엑츄에이터 등 다양한 장치로 구성할 수 있다. 예컨대, 글리핑작동장 치는 실린더바디에 비교적 행정거리가 짧은 2개의 슬라이더를 갖는 로드레스(rodless) 공압실린더로 구성될 수 있고, 이 2개의 슬라이더에 그립을 결속하여 그립을 벌리거나 모으는 동작을 수행하도록 구성할 수 있다. 그리고, 상기 작업부는 도면에 도시하지는 않았지만 분무 작용을 수행하도록 구성된 분사노즐을 구비한 분 사수단이나, 종자의 식재 동작을 수행하는 종자 식재장치(씨앗파종기)가 선택적으로 구비될 수 있다. 또한, 상기 작업부는 상하방향 높낮이조절이 가능하도록 각 작업용로봇팔(2a,2b)의 단부에 작업용선형엑츄 에이터가 설치될 수 있다. 여기서, 작업용선형엑츄에이터는 리니어 엑츄에이터 또는 전기 실린더로 호칭되 는 공지의 직선이동기구를 설치하여 구성하되, 전술한 작업부이동수단에 비해 행정거리가 짧은 것을 선택할 수 있다. 아울러 상기 작업부는 각 작업용로봇팔(2a,2b)의 이동로드부의 단 부와 작업용선형엑츄에이터 사 이에 관절부가 구비되어 있고, 이 관절부에는 작업용선형엑츄에이터를 회전운동(각 운동) 시킬 수 있도록 작업용회전엑츄에이터가 설치될 수 있다. 여기서, 작업용회전엑츄에이터는 로봇 등의 관절 부위에 적용되 는 통상의 로터리 엑츄에이터(rotary actuator) 등을 설치하는 방식으로 구성할 수 있다. 한편, 작업용로봇팔(2a,2b)은 복수 개가 상하로 배치되어 로봇팔회전 장치부에 의해 로봇본체부에 회전 가 능하게 장착될 수 있다. 예컨대, 작업용로봇팔(2a,2b)은 타측에 배치되는 타측 작업용로봇팔(2b)과, 일측 작업용로봇팔(2a)로 구성되어 있다. 상기 로봇팔회전장치부는 로봇본체부에 설치되는 지지축, 지지축에 삽입되고 일측 작업용로봇팔 (2a)이 올려지는 제1 베어링, 지지축에 삽입되고 타측 작업용로봇팔(2b)이 올려지는 제2 베어링을 구 비한다. 여기서 제1 베어링 및 제2 베어링은 고 하중을 지지할 수 있도록 스러스트 베어링으로 구성되는 바람직 하다. 그리고, 상기 로봇팔회전장치부는 일측 및 타측 작업용로봇팔에 독립적으로 회전력을 인가하는 로봇팔회전 구동수단(미도시)을 구비할 수 있다.로봇팔회전구동수단(미도시)은 일측 및 타측 작업용로봇팔(2a,2b)을 회전시킬 수 있는 수단이라면 특별한 제한 없이 적용할 수 있다. 예컨대, 로봇팔회전구동수단(미도시)은 일측 작업용로봇팔에 접속되는 제1 로봇팔회전구동수단(미도시)과, 타측 작업용로봇팔에 접속되는 제2 로봇팔회전구동수단(미도시)을 구비한다. 여기서 제1 및 제2 로봇팔회전 구동수단 (미도시)은 중공로터리 엑츄에이터로 호칭되는 회전엑츄에이터로 구성될 수 있다. 이러한 중공로터리 엑츄에이 터는 전원의 공급시에 정역 회전력을 생성하여 모터축을 통해 출력하는 구동모터와, 구동모터의 모터축을 통해 전달되는 회전력을 정해진 감속비로 감속하여 출력하는 중공로터리 엑츄에이터 감속기로 구성될 수 있다. 여기 서, 중공로터리 엑츄에이터 감속기는 로봇 분야 등에서 통상 '로터리 엑츄에이터 감속기' 등으로 약칭되기도 하 는 감속수단으로서 구동모터와 접속되고 내부에 감속용 기어 등이 내장된 감속 기어부와 이 감속 기어부에 형성 되고 중공부를 갖는 원형의 회전체로 구성되어 있다. 한편, 상기 작업용로봇팔은 전술한 직선이동기구로 구성된 형태 외에도 용접 로봇 등에 널리 적용되는 다관절 로봇팔로도 구성할 수 있다. 여기서 다관절 로봇팔은 복수의 축이 관절부에 의해 연결되고 이러한 복수의 축을 회전시키는 구동모터를 포함하는 축구동부가 구비된 공지의 다관절 로봇팔로 구성할 수 있다. 한편, 로봇균형장치부는 로봇본체부의 균형을 유지하기 위한 구성요소로서, 균형감지부, 제1 천정레 일 및 제2 천정레일, 레일이동체, 제1 로프 및 제2 로프, 제1 로프장력제어모터 및 제 2 로프장력제어모터를 구비한다. 균형감지부는 로봇본체부의 기울기 정도 및 기울어진 방향을 측정하는 감지수단으로서, 균형감지센서 와, 중앙선촬영카메라가 구비되어 있다. 균형감지센서는 로봇본체부에 설치되고 감지된 신호를 제어/신호처리/통신부에 인가하는 센서로서 기울기 감지센서 등으로 구성될 수 있다. 중앙선촬영카메라는 작업로의 중앙선과 평행하게 천정에 표시한 천정중앙선(C)의 위치를 찾아 촬영할 수 있도록 로봇본체부에 설치되어 로봇본체부 길이방향 중심선이 천정중앙선과 일치되도록 제어하며, 좌우 기울 어짐이 없이 균형을 유지하기 위한 촬영 영상을 제어/신호처리/통신부에 제공한다. 여기서, 중앙선촬영카메 라는 CCD카메라 등과 같은 디지털 카메라를 적용할 수 있다. 제1 천정레일 및 제2 천정레일은 로봇본체부의 이동경로상의 천정에 이격 설치되는 한 쌍의 레일로 서, 레일이동체의 구름(회전)이동이 가능한 구조용 형강재를 제1 로프 및 제2 로프의 설치 간격과 근사한 간격을 갖도록 온실 등의 시설농장 천정에 고정된 천정프레임(f)에 설치하는 방식으로 구성한다. 여기서 구조용 형강재는 대략 ㄷ자 단면을 갖는 형강의 양단에 내측으로 구름용 레일 턱이 돌출된 찬넬로 구성한다. 레일이동체는 제1 천정레일 및 제2 천정레일에 이동 가능하게 설치되는 것으로서, 회전축의 양단에 휠이 결합된 구름휠로 구성되어 있다. 제1 로프 및 제2 로프는 레일이동체의 회전축에 자유단이 결속되는 선형부재로서, 고강도 아라미드 사로 제작된 로프나 와이어 등으로 구성될 수 있다. 제1 로프장력제어모터 및 제2 로프장력제어모터는 제1 로프 및 제2 로프가 결속되어 권취되는 구성으로 제어/신호처리/통신부의 제어하에 구동되면서 제1 로프 및 제2 로프의 감김 동작과 풀림 동작을 수 행하도록 후술되는 균형유지보조막대의 일측 및 타측에 설치된다. 예컨대, 제1 로프장력제어모터 및 제2 로프장력제어모터는 제1 로프 및 제2 로프가 권취되는 윈치부와, 이 윈치부를 정.역 회전시키는 모터를 구비한 전동 윈치로 구성하되, 모터는 제어/신호처리/통신부의 제어하에 감김 및 풀림되는 길이의 조절을 세밀하게 제어할 수 있도록 제작된 것을 적용한다. 한편, 상기 로봇균형장치부는 로봇본체부의 폭보다 길이가 길게 형성되어 로봇본체부의 폭방향으로 설치 되는 균형유지보조막대를 구비한다. 균형유지보조막대는 사각 봉이나 평철 등과 같은 형강재를 로봇본체부 등에 설치하되, 강성을 보강 하기 위해 보강바에 의해 지지되도록 설치한다. 그리고, 도1에서 균형유지보조막대는 작업용로봇팔 (2a,2b)의 상부에 위치하도록 지지축에 설치된 형태를 도시하고 있지만, 설치위치는 이에 제한되는 것이 아니며 로봇본체부의 다양한 위치에 설치할 수 있다. 그리고, 본 발명의 일 실시예에 따른 시설농장용 무인 재배 로봇시스템은 도면에 도시하지는 않았으나 로봇본체 부 주행 시에 전후방을 촬영할 수 있는 카메라와, 조명을 위한 조명장치가 더 설치될 수 있다. 이하 본 발명의 일 실시예에 따른 시설농장용 무인 재배 로봇시스템의 작용을 간략하게 설명한다. 본 발명의 일 실시예에 따른 시설농장용 무인 재배 로봇시스템은 로봇본체부의 폭이 좁고 그 하부에 길이방 향을 따라 바퀴가 배치되어 있으므로 작업로가 협소하더라도 작물을 손상시키는 등의 악영향을 주지 않고 이동하면서 농작물의 재배과정을 편리하고 효율적으로 수행할 수 있다. 이러한, 로봇본체부는 온실과 같은 시설농장의 천정에 설치된 제1 천정레일 및 제2 천정레일의 레일 이동체와 로봇본체부 사이에 연결된 제1 로프 및 제2 로프의 장력에 의해 지지되므로 전도되지 않고 안전하게 이동할 수 있다. 그리고 로봇본체부가 제1 및 제2 천정레일(32,33) 내에서 구름 이동되는 레일이동체에 연결된 제1 로프 및 제2 로프에 지지되어 이동되는 과정에서 로봇본체부의 자세가 기울어지거나 작업과정에서 일측 및 타측 작업용로봇팔(2a,2b)의 돌출길이 변화에 따른 좌우 무게중심이 변동될 경우 균형감지부가 로봇본 체부의 기울기 정도 및 기울어진 방향을 감지하여 제어/신호처리/통신부에 인가함으로써 제1 로프장력제 어모터 및 제2 로프장력제어모터의 구동제어를 통해 균형을 유지할 수 있다. 보다 구체적으로 설명하면 제어/신호처리/통신부는 로봇본체부의 기울기 정도 및 기울어진 방향에 대한 감지신호를 균형감지센서로부터 인가 받거나, 중앙선촬영카메라에 의해 촬영되어 제공된 천정중앙선 (c)의 위치 영상데이터를 기초로 로봇본체부의 기울기 정도 및 기울어진 방향을 추출한 후 제1 로프장력제어 모터 및 제2 로프장력제어모터의 구동을 제어함으로써 제1 로프 및 제2 로프의 감김 및 풀림 동작을 수행하여 길이 및 장력을 조절하면서 로봇본체부의 균형을 안정적으로 유지할 수 있다. 한편, 본 발명의 일 실시예에 따른 시설농장용 무인 재배 로봇시스템은 이동과정이나 작업과정에서 균형유지 방 법으로서 전술한 균형감지부의 감지신호를 토대로 제1 및 제2 로프장력제어모터(37,39)의 구동을 제어하는 방법 외에도 이하에서 설명하는 여러 방법을 선택하거나 병행하여 적용할 수 있다. 먼저, 본 발명의 일 실시예에 따른 시설농장용 무인 재배 로봇시스템은 이동과정이나 작업과정에서 제어/신호 처리/통신부가 일측 및 타측으로 배치된 작업용로봇팔(2a,2b)의 자세와 로봇본체부의 무게중심 위치의 상 관관계를 학습한 무게중심 학습모델을 저장하고, 이와 같이 저장된 무게중심 학습모델을 기초로 작업용로봇팔의 특정 자세에 대응하여 로봇본체부의 무게중심 위치를 산출하여, 로봇본체부의 균형이 유지되도록 제어할 수 있다. 예컨대 일측 작업용로봇팔의 특정 자세에 있을 때 로봇본체부의 무게중심이 산출된 위치에 있도록, 타측 작업용로봇팔의 돌출 길이나 방향을 제어하거나, 제1 로프 및 제2 로프의 감김 및 풀림 동작을 통해 길 이 및 장력을 조절하도록 제1 로프장력제어모터 및 제2 로프장력제어모터의 구동 제어할 수 있다. 이와 같이 작업용로봇팔(2a,2b)의 자세와 로봇본체부의 무게중심 위치의 상관관계를 딥러닝 신경회로망에 의 해 학습한 무게중심 학습모델을 이용하여 균형을 유지하고자 할 경우, 제어/신호처리/통신부는 일측 및 타측으 로 배치된 작업용로봇팔의 자세와 무게중심 위치의 상관관계를 딥 러닝 또는 머신 러닝 하는 러닝 프로세서(미 도시)와, 이 러닝 프로세서에 의해 러닝된 상관관계 정보를 저장하는 메모리(미도시)를 더 구비할 수 있다. 한편, 제어/신호처리/통신부는 시설농장용 무인 재배 로봇시스템의 이동과정이나 작업과정에서 균형을 유지 하기 위한 다른 방법으로 일측 및 타측으로 배치된 작업용로봇팔의 돌출된 길이를 제어하여 로봇본체부의 균형 을 유지할 수 있다. 예컨대, 제어/신호처리/통신부는 하부 작업용로봇팔(2a)이 작업을 위해 일측으로 특정 길이만큼 돌출되게 작동시킬 경우 로봇본체부의 무게중심이 변경되지 않도록 타측 작업용로봇팔(2b)을 반대 방 향으로 돌출시키는 방식의 제어를 통해 로봇본체부의 균형을 유지할 수 있다. 이때, 제어/신호처리/통신부는 작업용로봇팔(2a,2b)의 자세에 대응하여 로봇본체부의 균형을 유지할 수 있는 무게중심의 위치를 저장한 제어 기준정보를 저장하고, 이 기준정보를 이용하여 제어할 수 있다. 또한, 제어/신호처리/통신부는 시설농장용 무인 재배 로봇시스템의 이동과정이나 작업과정에서 균형을 유지 하기 위한 또 다른 방법으로서, 일측 및 타측으로 배치된 작업용로봇팔(2a,2b) 중에서 일측 작업용로봇팔에 설 정된 중량 이상의 작업물체를 로딩하는 경우 타측 작업용로봇팔에 작업물체의 하중에 근접하는 균형추와 같은 균형하중체를 로딩한 상태에서 로봇본체부의 균형이 유지되도록 구동을 제어할 수 있다. 예컨대, 작업물체의 하 중이 설정된 중량 이상인 경우 입력부(미도시,제어/신호처리/통신부에 구비되는 입력용 터치패널이나, 스마트폰 과 같은 단말기 등)를 통해 제어/신호처리/통신부에 하중값을 입력하고 작업물체의 하중에 근접하는 균형추를 제공하여 줌으로써 제어/신호처리/통신부의 제어하에 일측 및 타측 작업용로봇팔이 균형하중체를 로딩함과 동시에 작업물체를 로딩하도록 구현할 수 있다. 이상에서 기재된 \"포함하다\", \"구성하다\" 또는 \"가지다\" 등의 용어는, 특별히 반대되는 기재가 없는 한, 해당 구성 요소가 내재할 수 있음을 의미하는 것이므로, 다른 구성 요소를 제외하는 것이 아니라 다른 구성 요소를 더 포함할 수 있는 것으로 해석되어야 한다. 기술적이거나 과학적인 용어를 포함한 모든 용어들은, 다르게 정의 되지 않는 한, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일 한 의미가 있다. 사전에 정의된 용어와 같이 일반적으로 사용되는 용어들은 관련 기술의 문맥상의 의미와 일치 하는 것으로 해석되어야 하며, 본 발명에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미 로 해석되지 않는다. 이상 설명한 본 발명의 일 실시예에 따른 시설농장용 무인 재배 로봇시스템의 구성 및 동작에 대해서 설명하였"}
{"patent_id": "10-2023-0074239", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "으나, 이는 예시적인 것으로서 본 기술분야에 통상의 지식을 가진 자는 본 발명의 기술적 사상을 벗어나지 않는 범위에서 전술한 실시예의 일부를 치환 및 변형하는 것이 가능함을 이해할 수 있을 것이다. 따라서 본 발명의 보호범위는 특허청구범위에 기재된 발명 및 그 균등 물에 미치는 것으로 이해되어야 할 것이다."}
{"patent_id": "10-2023-0074239", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도1은 본 발명의 일 실시예에 따른 시설농장용 무인 재배 로봇시스템의 전체적인 구성을 나타낸 구성도, 도2는 본 발명의 일 실시예에 따른 시설농장용 무인 재배 로봇시스템의 주요 구성요소를 확대하여 나타낸 구성 도, 도3은 본 발명의 일 실시예에 따른 시설농장용 무인 재배 로봇시스템의 개략적인 정면도, 도4는 본 발명의 일 실시예에 따른 시설농장용 무인 재배 로봇시스템의 로봇본체부를 설명하기 위한 단면도, 도5a 내지 도5d는 본 발명의 일 실시예에 따른 시설농장용 무인 재배 로봇시스템의 작동상태를 설명하기 위한 도면으로서, 도5a는 작업용로봇팔의 작동 전 상태를, 도5b는 작업용로봇팔이 작업을 위해 횡 방향을 향해 일자 형태로 펼쳐진 상태를, 도5c는 작업용로봇팔의 수축된 상태를, 도5d는 작업용로봇팔의 작업부에 대한 전 후진 상태 및 회전 상태를 나타낸 것이다."}
