{"patent_id": "10-2017-0135233", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2018-0072523", "출원번호": "10-2017-0135233", "발명의 명칭": "전자 장치 및 그 동작 방법", "출원인": "삼성전자주식회사", "발명자": "장준익"}}
{"patent_id": "10-2017-0135233", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,차량이 주행하는 중에, 상기 차량의 주행 상태 또는 상기 차량 주변의 다른 차량의 주행 상태를 감지하는 센싱부;하나 이상의 인스트럭션을 저장하는 메모리; 및상기 메모리에 저장된 상기 하나 이상의 인스트럭션을 실행하는 프로세서를 포함하고, 상기 프로세서는 상기 하나 이상의 인스트럭션을 실행함으로써, 상기 차량의 주행 상태 및 상기 차량 주변의 다른 차량의 주행 상태를 포함하는 상태 데이터를 획득하고, 적어도 하나의 데이터 인식 모델을 이용하여, 상기 획득된 상태 데이터에 기초하여, 상기 차량이 주행하는 중에소정 시간 후의 상기 차량의 위험 상황을 판단하는, 전자 장치."}
{"patent_id": "10-2017-0135233", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서, 상기 센싱부는,상기 차량을 운전 중인 운전자의 얼굴 표정, 시선 및 행동 중 적어도 하나를 포함하는 상기 운전자의 상태를 감지하고,상기 프로세서는 상기 하나 이상의 인스트럭션을 실행함으로써, 상기 운전자의 상태를 포함하는 상기 상태 데이터를 획득하는, 전자 장치."}
{"patent_id": "10-2017-0135233", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항에 있어서,상기 차량의 주행 상태는, 상기 차량의 운행 속도, 운행 가속도 및 운행 방향 중 적어도 하나를 포함하는, 전자 장치."}
{"patent_id": "10-2017-0135233", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1 항에 있어서,상기 센싱부는,상기 차량의 주변에서 주행 중인 다른 차량을 촬영한 영상을 획득하고, 상기 프로세서는 상기 하나 이상의 인스트럭션을 실행함으로써, 상기 다른 차량을 촬영한 영상으로부터 상기 다른 차량의 차량 정보를 획득하고, 상기 다른 차량의 차량 정보를 포함하는 상기 상태 데이터를 획득하는, 전자 장치.공개특허 10-2018-0072523-3-청구항 5 제1 항에 있어서,상기 센싱부는,상기 차량이 주행 중인 도로의 상태 또는 날씨 상태를 포함하는 주변 환경 상태를 감지하고, 상기 프로세서는 상기 하나 이상의 인스트럭션을 실행함으로써, 상기 주변 환경 상태를 포함하는 상기 상태 데이터를 획득하는, 전자 장치."}
{"patent_id": "10-2017-0135233", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1 항에 있어서,상기 프로세서는, 상기 하나 이상의 인스트럭션을 실행함으로써, 상기 적어도 하나의 데이터 인식 모델을 이용하여, 상기 판단된 차량의 위험 상황을 방지하기 위한 주행 가이드정보를 결정하는, 전자 장치."}
{"patent_id": "10-2017-0135233", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1 항에 있어서,상기 프로세서는, 상기 하나 이상의 인스트럭션을 실행함으로써, 상기 판단된 차량의 위험 상황 및 상기 판단된 차량의 위험 상황을 방지하기 위한 주행 가이드 정보 중 적어도하나를 디스플레이하는, 전자 장치."}
{"patent_id": "10-2017-0135233", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1 항에 있어서,상기 프로세서는, 상기 하나 이상의 인스트럭션을 실행함으로써, 상기 적어도 하나의 데이터 인식 모델을 이용하여, 상기 획득된 상태 데이터에 기초하여, 상기 차량의 주변에서주행 중인 다른 차량이 상기 차량에게 영향을 미칠 수 있는 위험도를 판단하는, 전자 장치."}
{"patent_id": "10-2017-0135233", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1 항에 있어서,상기 프로세서는, 상기 하나 이상의 인스트럭션을 실행함으로써, 상기 판단된 차량의 위험 상황을 방지하기 위한 주행 가이드 정보에 기초하여, 상기 차량의 주행 속도 및 주행방향 중 적어도 하나를 포함하는 주행 동작을 제어하는, 전자 장치."}
{"patent_id": "10-2017-0135233", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9 항에 있어서,상기 프로세서는, 상기 하나 이상의 인스트럭션을 실행함으로써, 상기 판단된 차량의 위험 상황의 위험도가 미리 정해진 임계치에 대응하는 경우, 운전자에 의한 상기 주행 동작의 제어를 차단하는, 전자 장치.공개특허 10-2018-0072523-4-청구항 11 제1 항에 있어서,상기 프로세서는, 상기 하나 이상의 인스트럭션을 실행함으로써, 상기 상태 데이터에 기초하여 판단된 상기 차량의 위험 상황과, 상기 위험 상황을 방지하기 위해 결정된 주행가이드 정보를 학습함에 따라, 상기 적어도 하나의 데이터 인식 모델을 업데이트하는, 전자 장치."}
{"patent_id": "10-2017-0135233", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1 항에 있어서,상기 프로세서는, 상기 하나 이상의 인스트럭션을 실행함으로써, 근접한 시점에 감지된 복수의 상태를 조합한 상태 데이터에 기초하여 판단된 상기 차량의 위험 상황을 학습함에따라, 상기 적어도 하나의 데이터 인식 모델을 업데이트하는, 전자 장치."}
{"patent_id": "10-2017-0135233", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "차량이 주행하는 중에, 상기 차량의 주행 상태 또는 상기 차량 주변의 다른 차량의 주행 상태를 감지하는 단계;상기 차량의 주행 상태 및 상기 차량 주변의 다른 차량의 주행 상태를 포함하는 상태 데이터를 획득하는 단계;및적어도 하나의 데이터 인식 모델을 이용하여, 상기 획득된 상태 데이터에 기초하여, 상기 차량이 주행하는 중에소정 시간 후의 상기 차량의 위험 상황을 판단하는 단계를 포함하는, 전자 장치의 동작 방법."}
{"patent_id": "10-2017-0135233", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13 항에 있어서, 상기 차량을 운전 중인 운전자의 얼굴 표정, 시선 및 행동 중 적어도 하나를 포함하는 상기 운전자의 상태를 감지하는 단계를 더 포함하고,상기 상태 데이터를 획득하는 단계는,상기 운전자의 상태를 포함하는 상기 상태 데이터를 획득하는 것인, 동작 방법."}
{"patent_id": "10-2017-0135233", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제13 항에 있어서,상기 차량의 주변에서 주행 중인 다른 차량을 촬영한 영상을 획득하는 단계; 및 상기 다른 차량을 촬영한 영상으로부터 상기 다른 차량의 차량 정보를 획득하는 단계를 더 포함하고, 상기 상태 데이터를 획득하는 단계는, 상기 다른 차량의 차량 정보를 포함하는 상기 상태 데이터를 획득하는 것인, 동작 방법."}
{"patent_id": "10-2017-0135233", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제13 항에 있어서,공개특허 10-2018-0072523-5-상기 적어도 하나의 데이터 인식 모델을 이용하여, 상기 판단된 차량의 위험 상황을 방지하기 위한 주행 가이드정보를 결정하는 단계를 더 포함하는, 동작 방법."}
{"patent_id": "10-2017-0135233", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제13 항에 있어서,상기 판단된 차량의 위험 상황 및 상기 판단된 차량의 위험 상황을 방지하기 위한 주행 가이드 정보 중 적어도하나를 디스플레이하는 단계를 더 포함하는, 동작 방법."}
{"patent_id": "10-2017-0135233", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제13 항에 있어서,상기 판단된 차량의 위험 상황을 방지하기 위한 주행 가이드 정보에 기초하여, 상기 차량의 주행 속도 및 주행방향 중 적어도 하나를 포함하는 주행 동작을 제어하는 단계를 더 포함하는, 동작 방법."}
{"patent_id": "10-2017-0135233", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제13 항에 있어서,근접한 시점에 감지된 복수의 상태를 조합한 상태 데이터에 기초하여 판단된 상기 차량의 위험 상황을 학습함에따라, 상기 적어도 하나의 데이터 인식 모델을 업데이트하는 단계를 더 포함하는, 동작 방법."}
{"patent_id": "10-2017-0135233", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "차량이 주행하는 중에, 상기 차량의 주행 상태 또는 상기 차량 주변의 다른 차량의 주행 상태를 감지하는 단계;상기 차량의 주행 상태 및 상기 차량 주변의 다른 차량의 주행 상태를 포함하는 상태 데이터를 획득하는 단계;및적어도 하나의 데이터 인식 모델을 이용하여, 상기 획득된 상태 데이터에 기초하여, 상기 차량이 주행하는 중에소정 시간 후의 상기 차량의 위험 상황을 판단하는 단계를 수행하도록 설정된 명령어들을 저장하는 기록 매체를포함하는, 컴퓨터 프로그램 제품."}
{"patent_id": "10-2017-0135233", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "전자 장치에 있어서,차량의 주행과 관련된 정보, 및 상기 차량의 주변에 위치한 다른 차량의 주행과 관련된 정보를 감지하는센싱부;메모리;상기 센싱부 및 상기 메모리를 제어하는 프로세서; 를 포함하고,상기 메모리는, 상기 전자 장치 실행 시, 상기 프로세서가,상기 센싱부가 감지한 상기 차량의 주행과 관련된 정보 및 상기 차량의 주변에 위치한 다른 차량의 주행과 관련된 정보를, 차량의 위험 상황을 추정하도록 설정된 데이터 인식 모델에 적용하여 상기 차량의 위험 상황을 추정하도록 설정된 명령어들을 저장하고,상기 차량의 위험 상황을 추정하도록 설정된 데이터 인식 모델은, 차량의 주행과 관련된 정보, 상기 차량의 주변에 위치한 다른 차량의 주행과 관련된 정보 및 위험 상황을 이용하여 학습된 데이터 인식 모델인, 전자 장치.공개특허 10-2018-0072523-6-"}
{"patent_id": "10-2017-0135233", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "전자 장치 및 그 동작 방법이 제공된다. 전자 장치는, 차량이 주행하는 중에, 차량의 주행 상태 또는 차량 주변 의 다른 차량의 주행 상태를 감지하는 센싱부, 하나 이상의 인스트럭션을 저장하는 메모리 및 메모리에 저장된 하나 이상의 인스트럭션을 실행하는 프로세서를 포함하고, 프로세서는 하나 이상의 인스트럭션을 실행함으로써, (뒷면에 계속)"}
{"patent_id": "10-2017-0135233", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 전자 장치 및 그 동작 방법에 관한 것으로서, 더욱 상세하게는, 차량의 운전을 보조하는 전자 장치 및 방법에 관한 것이다. 또한 본 개시는 딥러닝 등의 기계 학습 알고리즘을 활용하여 인간 두뇌의 인지, 판단 등의 기능을 모사하는 인 공 지능(Artificial Intelligence, AI) 시스템 및 그 응용 기술에 관련된 것이다."}
{"patent_id": "10-2017-0135233", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공지능 시스템은 인간 수준의 지능을 구현하는 컴퓨터 시스템이며, 기존 Rule 기반 스마트 시스템과 달리 기 계가 스스로 학습하고 판단하며 똑똑해지는 시스템이다. 인공지능 시스템은 사용할수록 인식률이 향상되고 사용 자 취향을 보다 정확하게 이해할 수 있게 되어, 기존 Rule 기반 스마트 시스템은 점차 딥러닝 기반 인공지능 시 스템으로 대체되고 있다. 인공 지능 기술은 기계학습(딥러닝) 및 기계학습을 활용한 요소 기술들로 구성된다. 기계학습은 입력 데이터들의 특징을 스스로 분류/학습하는 알고리즘 기술이며, 요소기술은 딥러닝 등의 기계학 습 알고리즘을 활용하여 인간 두뇌의 인지, 판단 등의 기능을 모사하는 기술로서, 언어적 이해, 시각적 이해, 추론/예측, 지식 표현, 동작 제어 등의 기술 분야로 구성된다. 인공지능 기술이 응용되는 다양한 분야는 다음과 같다. 언어적 이해는 인간의 언어/문자를 인식하고 응용/처리 하는 기술로서, 자연어 처리, 기계 번역, 대화시스템, 질의 응답, 음성 인식/합성 등을 포함한다. 시각적 이해 는 사물을 인간의 시각처럼 인식하며 처리하는 기술로서, 객체 인식, 객체 추적, 영상 검색, 사람 인식, 장면 이해, 공간 이해, 영상 개선 등을 포함한다. 추론 예측은 정보를 판단하여 논리적으로 추론하고 예측하는 기술 로서, 지식/확률 기반 추론, 최적화 예측, 선호 기반 계획, 추천 등을 포함한다. 지식 표현은 인간의 경험정보 를 지식데이터로 자동화 처리하는 기술로서, 지식 구축(데이터 생성/분류), 지식 관리(데이터 활용) 등을 포함 한다. 동작 제어는 차량의 자율 주행, 로봇의 움직임을 제어하는 기술로서, 움직임 제어(항법, 충돌, 주행), 조 작 제어(행동 제어) 등을 포함한다."}
{"patent_id": "10-2017-0135233", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "차량의 운전을 보조하는 전자 장치 및 방법을 제공하는 데 있다. 또한, 상기 방법을 컴퓨터에서 실행시키기 위 한 프로그램을 기록한 컴퓨터로 읽을 수 있는 기록매체를 제공하는 데 있다. 해결하려는 기술적 과제는 상기된 바와 같은 기술적 과제들로 한정되지 않으며, 또 다른 기술적 과제들이 존재할 수 있다."}
{"patent_id": "10-2017-0135233", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 측면에 따른 전자 장치는, 차량이 주행하는 중에, 차량의 주행 상태 또는 차량 주변의 다른 차량의 주행 상 태를 감지하는 센싱부, 하나 이상의 인스트럭션을 저장하는 메모리, 및 메모리에 저장된 하나 이상의 인스트럭 션을 실행하는 프로세서를 포함하고, 프로세서는 하나 이상의 인스트럭션을 실행함으로써, 차량의 주행 상태 및 차량 주변의 다른 차량의 주행 상태를 포함하는 상태 데이터를 획득하고, 적어도 하나의 데이터 인식 모델을 이 용하여, 획득된 상태 데이터에 기초하여, 차량이 주행하는 중에 소정 시간 후의 차량의 위험 상황을 판단할 수 있다. 다른 측면에 따른 전자 장치의 동작 방법은, 차량이 주행하는 중에, 차량의 주행 상태 또는 차량 주변의 다른 차량의 주행 상태를 감지하는 단계, 차량의 주행 상태 및 차량 주변의 다른 차량의 주행 상태를 포함하는 상태 데이터를 획득하는 단계, 및 적어도 하나의 데이터 인식 모델을 이용하여, 획득된 상태 데이터에 기초하여, 차 량이 주행하는 중에 소정 시간 후의 차량의 위험 상황을 판단하는 단계를 포함할 수 있다. 또 다른 측면에 따른 컴퓨터로 읽을 수 있는 기록매체는 상술한 방법을 컴퓨터에서 실행시키기 위한 프로그램을 기록한 기록매체를 포함한다."}
{"patent_id": "10-2017-0135233", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "실시 예들에서 사용되는 용어는 본 발명에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들 을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 발명의 설명 부분에서 상 세히 그 의미를 기재할 것이다. 따라서 본 발명에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가 지는 의미와 본 발명의 전반에 걸친 내용을 토대로 정의되어야 한다. 명세서 전체에서 어떤 부분이 어떤 구성요소를 “포함”한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다 른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있음을 의미한다. 또한, 명세서에 기재된 “…부”, “…모듈” 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어 또는 소프트웨어로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 아래에서는 첨부한 도면을 참고하여 본 발명의 실시 예에 대하여 본 발명이 속하는 기술 분야에서 통상의 지식 을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시 예에 한정되지 않는다. 이하에서는 도면을 참조하여 본 발명의 실시 예들을 상세히 설명한다. 본 명세서에서 차량은 차량의 운전을 보조 또는 제어하는 전자 장치(이하, 전자 장치)를 포함 할 수 있다. 도 1은 일 실시 예에 따른 차량의 운전을 보조하는 전자 장치가 동작하는 일 예를 도시하는 도면이다. 도 1을 참조하면, 일 실시 예에 따른 전자 장치는 차량의 주행 상태와 차량 주변에서 주행 중인 다 른 차량의 주행 상태를 감지할 수 있다. 예를 들어, 전자 장치는 차량이 직선 도로를 주행하는 중에 빈번하게 좌우로 흔들리는 운전 패턴(d11) 을 감지할 수 있다. 전자 장치는 차량을 운전하고 있는 운전자가 졸고 있는 상태임을 감지할 수 있 다. 또한, 전자 장치는 차량의 주변에서 주행 중인 다른 차량이 차량의 앞쪽으로 차선을 변경하 려는 주행 의도(d12)를 판단할 수 있다. 일 실시 예에 따른 전자 장치는 차량의 주행 상태와 다른 차량의 주행 상태를 토대로, 차량과 다 른 차량이 곧 충돌하는 위험 상황이 발생할 수 있음을 예측할 수 있다. 일 실시 예에 따라, 전자 장치 의 프로세서는, 차량 주행 중에 인식되는 다양한 상태들을 포함하는 상태 데이터에 기초하여 위험 상황 을 예측하기 위해, 뉴럴 네트워크(Neural Network)를 기반으로 하는 데이터 인식 모델을 이용할 수 있다. 일 실시 예에 따르면, 차량의 전자 장치는 차량이 주행하는 중 발생할 수 있는 위험 상황들을 예측 하여, 운전자에게 위험 상황을 알리고 위험 상황을 방지하기 위한 주행 가이드 정보를 미리 제공함으로써, 운전 자에게 보다 안전하고 편리한 운행 환경을 제공할 수 있다. 또한, 일 실시 예에 따르면, 차량의 전자 장치는 위험 상황들을 예측하여 주행 동작을 자율적으로 제어 함으로써, 보다 안전한 주행 환경을 제공할 수 있다. 예를 들어, 전자 장치는 차량의 주행 정지 또는 방향 전환 등의 주행 동작을 자율적으로 제어함으로써, 예측된 위험 상황을 미연에 방지할 수 있다. 도 2a는 일 실시 예에 따라 전자 장치의 동작 방법의 흐름도이다. 도 2a의 단계 S201에서, 일 실시 예에 따른 전자 장치는, 차량이 주행하는 중에, 차량의 주행 상태 또는 차량 주변의 다른 차량의 주행 상태를 감지할 수 있다. 일 실시 예에 따라, 차량의 주행 상태는, 차량의 주행 속도, 주행 가속도, 주행 방향 등을 포함할 수 있다. 일 실시 예에 따라, 가속도 센서, 자이로스코프 센서, IMU 등을 포함하는 센싱부는, 차량 의 주행 속도, 주행 가속도, 주행 방향 등을 감지할 수 있다. 또한, 일 실시 예에 따라, 차량 주변의 다른 차량의 주행 상태는, 다른 차량의 주행 속도, 주행 가속도, 주행 방향, 방향 전환 의도, 급정거, 급가속 등의 주행 패턴 등을 포함할 수 있다. 일 실시 예에 따라, RADAR 센서, LIDAR 센서, 이미지 센서 등을 포함하는 센싱부는, 차량 주변의 다른 차량, 도로 형태 등을 감지할 수 있다. 예를 들어, LIDAR 센서는 레이저 출력기를 이용하 여 레이저 빔을 출력하고, 적어도 하나의 레이저 수신기를 통해 객체로부터의 반사 신호를 획득함으로써, 주변 객체의 형태 및 거리, 지형 등을 감지할 수 있다. 또한, 일 실시 예에 따른 전자 장치의 센싱부는, 날씨(예컨대, 눈, 비, 안개 등으로 전방 시야 확보 가 어려운지 등), 도로의 노면 상태(노면이 미끄러운지 등), 도로 상황(예컨대, 공사 중인 구간인지, 도로가 일 차선으로 좁아지는 구간인지, 일방 통행 구간인지 등)을 감지할 수 있다. 또한, 일 실시 예에 따른 전자 장치의 센싱부는, 차량을 운전 중인 운전자의 상태를 감지할 수 있 다. 일 실시 예에 따라, 이미지 센서 등을 포함하는 센싱부는 운전자의 얼굴 표정, 시선, 행동 등을 감지 할 수 있다. 프로세서는 이미지 센서를 통해 감지된 운전자의 얼굴 표정을 통해 운전자가 졸음 상태 임을 판단할 수 있다. 예를 들어, 전자 장치의 프로세서는 운전자가 하품을 자주 하거나, 눈의 깜박 임 횟수가 증가하는 경우, 운전자가 졸음 상태인 것으로 판단할 수 있다. 운전자의 상태에 관해서는, 후술할 도 3 내지 도 4에 관한 설명에서 상술하기로 한다. 또한, 일 실시 예에 따른 전자 장치의 센싱부는, 차량의 주변에서 주행 중인 다른 차량을 촬영한 영 상을 획득할 수 있다. 일 실시 예에 따른 프로세서는 다른 차량을 촬영한 영상으로부터 다른 차량의 차량 정보를 획득할 수 있다. 일 실시 예에 따라, 차량 정보는, 차량의 차종, 연식, 사고율 등의 정보를 포함할 수 있다. 차량 정보에 관해서는, 후술할 도 6에 관한 설명에서 상술하기로 한다. 한편, 일 실시 예에 따라, 프로세서는, 운전자의 졸음 상태를 판단할 때, 데이터 인식 모델을 이용할 수도 있다. 프로세서는, 운전자가 일정 시간 내에 일정 횟수 이상으로 눈을 깜박이는 경우에, 운전자가 졸음 상 태인 것으로 판단하는 것으로 데이터 인식 모델을 학습시킬 수 있다. 프로세서는 학습된 데이터 인식 모델 을 이용하여 운전자의 졸음 상태를 판단할 수 있다. 단계 S202에서, 전자 장치의 프로세서는 차량의 주행 상태 및 차량 주변의 다른 차량의 주행 상태를 포함하는 상태 데이터를 획득할 수 있다. 일 실시 예에 따른 전자 장치의 프로세서는 근접한 시점에 감지된 복수의 상태들을 조합함으로써 상 태 데이터를 획득할 수 있다. 일 실시 예에 따라, 상태 데이터는, 차량이 주행하는 중 차량을 포함한 주변에서 감지될 수 있는 주행과 관련된 상태들을 포함할 수 있다. 일 실시 예에 따른 상태 데이터는, 차량의 주행 상태, 운전자의 상태, 차량 주변의 다른 차량의 주행 상태, 다른 차량의 차량 정보, 주변 환경 상태 등을 포함할 수 있다. 예를 들어, 상태 데이터는, 차량의 운전자가 스마트 폰을 조작하는 시점에, 수 백 미터 전방에 위치한 신호 등이 적색 신호로 변경되고, 차량의 속도가 감속되지 않는 상태를 포함할 수 있다. 단계 S203에서, 전자 장치는 적어도 하나의 데이터 인식 모델을 이용하여, 획득된 상태 데이터에 기초하여, 차량이 주행하는 중에 소정 시간 후의 차량의 위험 상황을 판단할 수 있다. 예를 들어, 전자 장치는, 차량의 운전자가 스마트 폰을 조작하는 상태를 감지한 시점에, 수 백 미터 전 방에 위치한 신호등이 적색 신호로 변경됨을 감지한 경우, 차량의 주행 속도가 감속되지 않는다면, 수 초 후 에 차량의 충돌 위험 상황이 발생할 수도 있음을 예측할 수 있다. 일 실시 예에 따른 전자 장치의 프로세서는 상태 데이터에 기초하여 위험 상황을 판단하기 위해, 적 어도 하나의 데이터 인식 모델을 이용할 수 있다. 일 실시 예에 따라, 프로세서는, DNN(Deep Neural Network), RNN(Recurrent Neural Network) 등의 뉴럴 네트워크(Neural Network)를 기반으로 하는 데이터 인식 모델을 이용할 수 있다. 일 실시 예에 따라, 프로세서는, 상태 데이터에 기초하여 판단된 위험 상황을 학습함에 따라, 데이터 인식 모델을 업데이트할 수 있다. 또한, 프로세서는 근접한 시점에 감지된 복수의 상태를 조합한 상태 데이터에 기초하여 판단된 위험 상황을 학습함에 따라, 데이터 인식 모델을 업데이트할 수 있다. 일 실시 예에 따르면, 전자 장치의 프로세서는 차량의 위험 상황을 예측함에 따라, 위험 상황을 대비할 수 있도록 운전자에게 알림을 제공하거나 차량의 주행 동작을 직접 제어함으로써, 운전자에게 보다 안전한 주행 환경을 제공할 수 있다. 도 2b는 다양한 실시예에 따른 제 1 프로세서(120a) 및 제 2 프로세서(120b)가 차량의 위험 상황을 추정하는 상 황을 설명하기 위한 흐름도이다. 일 실시예에 따르면, 전자 장치는 제 1 프로세서(120a) 및 제 2 프로세서(120b)를 포함할 수 있다. 제 1 프로세서(120a)는 전자 장치에 설치된 적어도 하나의 어플리케이션의 실행을 제어하고, 전자 장치 에 획득되는 이미지에 대한 그래픽 처리를 수행할 수 있다. 제 1 프로세서(120a)는 CPU(central processing unit), GPU(graphic processing unit), 통신칩, 및 센서 등의 기능이 통합 된 SoC(system on chip) 형태로 구현될 수 있다. 제 2 프로세서(120b)는 데이터 인식 모델을 이용하여 주행 중인 차량, 주변 차량, 및 주변 환경 정보로부터 위 험 상황을 추정하고, 주행 가이드 정보를 제공할 수 있다. 한편, 제 2 프로세서(120b)는 데이터 인식 모델을 이용한 위험 상황 예측 추정 기능을 수행하는 인공 지능(AI: artificial intelligence)을 위한 전용 하드웨어 칩 형태로 제작될 수 있다. 다양한 실시예에 따르면, 시각적 이해를 요소기술로 하는 데이터 인식 모델의 경우, 인공 지능(AI: artificial intelligence)을 위한 전용 하드 웨어 칩은 GPU를 포함할 수 있다. 또한, 전자 장치는 제 2 프로세서(120b)와 동일한 기능을 수행하는 제 3 프로세서, 제 4 프로세서 등을 더 포함할 수도 있다. 단계 S211에서, 제 1 프로세서(120a)는 차량의 주행 상태 및/또는 인접한 다른 차량의 주행 상태를 감지할 수 있다. 또한, 제 1 프로세서(120a)는 운전자의 상태, 다른 차량의 차량 정보, 및 주변 환경 정보를 감지할 수 있 다. 일 실시예에 따르면, 제 1 프로세서(120a)는 전자 장치에 포함된 가속도 센서, 자이로스코프 센서 , IMU, RADAR 센서, LIDAR 센서, 이미지 센서 등을 이용하여 차량의 주행 상태, 운 전자의 상태, 다른 차량의 주행 상태, 다른 차량의 차량 정보, 및 주변 환경 정보를 감지할 수 있다. 단계 S213에서, 제 1 프로세서(120a)는 차량의 상태 데이터 및/또는 다른 차량의 상태 데이터를 획득할 수 있다. 또한, 제 1 프로세서(120a)는 운전자의 상태, 다른 차량의 차량 정보, 및/또는 주변 환경 정보와 관련된 상태 데이터를 획득할 수 있다. 차량의 주행 상태는, 예를 들면, 주행 속도, 주행 가속도, 주행 방향, 급정거, 급가속 등을 포함할 수 있다. 운 전자의 상태는, 예를 들면, 얼굴 표정, 시선, 행동 등을 포함할 수 있다. 다른 차량의 주행 상태는, 예를 들면, 주행 속도, 주행 가속도, 주행 방향, 방향 전환 의도, 급정거, 급가속 등을 포함할 수 있다. 다른 차량의 상태 차량 정보는, 예를 들면, 차종, 연식, 잠재 사고율, 무게, 보험 이력 등을 포함할 수 있다. 주변 환경 정보는, 예를 들면, 도로의 차선 형태, 기상 상태, 노면 상태, 사고 다발 구간, 공사 구간, 보행자, 장애물 등을 포함할 수 있다. 단계 S215에서, 제 1 프로세서(120a)는 제 2 프로세서(120b)에게 획득한 상태 데이터에 기반한 위험 상황 추정 을 요청할 수 있다. 단계 S217에서, 제 2 프로세서(120b)는 데이터 인식 모델을 이용하여 차량의 위험 상황을 추정할 수 있다. 예를 들면, 제 1 프로세서(120a)는 운전자가 스마트 폰을 조작하는 상태 데이터와 차량의 전방에 위치한 신호등 이 적색으로 변경되는 상태 데이터를 제 2 프로세서(120b)로 전송할 수 있다. 제 2 프로세서(120b)는 데이터 인 식 모델을 이용하여 수신된 운전자, 및 신호등에 대한 상태 데이터에 기반하여 충돌 위험 상황이 있음을 추정할 수 있다. 단계 S219에서, 제 2 프로세서(120b)는 추정된 위험 상황을 제 1 프로세서(120a)로 전송할 수 있다. 도 2c는 다양한 실시예에 따른 제 1 프로세서(120a), 제 2 프로세서(120b), 제 3 프로세서(120c)가 차량의 위험 상황을 추정하는 상황을 설명하기 위한 흐름도이다. 일 실시예에 따르면, 전자 장치는 제 1 프로세서(120a), 제 2 프로세서(120b), 제 3 프로세서(120c)를 포 함할 수 있다. 제 3 프로세서(120c)는 데이터 인식 모델을 이용하여 차량의 위험 상황에 기반하여 주행 가이드 정보를 선정할 수 있다. 단계 S221에서, 제 1 프로세서(120a)는 전자 장치에 포함된 가속도 센서, 자이로스코프 센서, IMU, RADAR 센서, LIDAR 센서, 이미지 센서 등을 이용하여 차량의 주행 상태, 운전자의 상태, 다른 차량의 주행 상태, 다른 차량의 차량 정보, 및 주변 환경 정보를 감지할 수 있다. 단계 S223에서, 제 1 프로세서(120a)는 차량의 상태 데이터 및/또는 다른 차량의 상태 데이터를 획득할 수 있다. 또한, 제 1 프로세서(120a)는 운전자의 상태, 다른 차량의 차량 정보, 및/또는 주변 환경 정보와 관련된 상태 데이터를 획득할 수 있다. 단계 S225에서, 제 1 프로세서(120a)는 제 2 프로세서(120b)에게 획득한 차량의 상태 데이터에 기반한 위험 상 황 추정을 요청할 수 있다. 예를 들어, 제 1 프로세서(120a)는 스마트 폰을 조작하는 운전자에 대한 이미지를 상태 데이터로 하여 제 2 프로세서(120b)로 전송할 수 있다. 단계 S227에서, 제 2 프로세서(120b)는 데이터 인식 모델을 이용하여 차량의 위험 상황을 추정할 수 있다. 단계 S229에서, 제 1 프로세서(120a)는 제 3 프로세서(120c)에게 획득한 다른 차량의 상태 데이터에 기반한 위 험 상황 추정을 요청할 수 있다. 예를 들어, 제 1 프로세서(120a)는 차량의 전방에 위치한 신호등이 적색으로 변경되는 상황에 대한 정보를 상태 데이터로 하여 제 3 프로세서(120c)로 전송할 수 있다. 단계 S231에서, 제 3 프로세서(120c)는 데이터 인식 모델을 이용하여 차량의 위험 상황을 추정할 수 있다. 단계 S233에서, 제 2 프로세서(120b)는 추정한 차량의 위험 상황을 제 3 프로세서(120c)로 전송할 수 있다. 단계 S235에서, 제 3 프로세서(120c)는 데이터 인식 모델을 이용하여 종합적인 차량의 위험 상황을 추정할 수 있다. 예를 들어, 제 3 프로세서(120c)는 제 2 프로세서(120b)가 스마트 폰을 조작하는 운전자에 대한 이미지에 기반하여 추정한 위험 상황과, 제 3 프로세서(120c)가 차량의 전방에 위치한 신호등이 적색으로 변경되는 정보 에 기반하여 추정한 위험 상황에 기반하여 종합적인 차량의 위험 상황을 추정할 수 있다. 단계 S237에서 제 3 프로세서(120c)는 추정된 위험 상황을 제 1 프로세서(120a)로 전송할 수 있다. 도 2d는 다양한 실시예에 따른 전자 장치 및 서버가 차량의 위험 상황을 추정하는 상황을 설명하기 위한 흐름도이다. 일 실시예에 따르면, 전자 장치는 서버를 이용하여 차량의 위험 상황을 추정할 수 있다. 일 실시예에 따르면, 서버는 클라이언트 전자 장치들에게 서비스를 제공하는 컴퓨팅 장치일 수 있으며, 예를 들어, PC, 랩톱, 휴대폰, 마이크로 서버, GPS(global positioning system) 장치, 전자책 단말기, 가전기 기, 자동차 내의 전자 장치 및 기타 모바일 또는 비 모바일 컴퓨팅 장치일 수 있다. 그러나, 이에 제한되지 않 으며, 서버는 통신 기능 및 데이터 프로세싱 기능을 구비한 모든 종류의 기기를 포함할 수 있다. 또한, 전자 장치는 서버와 네트워크를 통해 통신 연결될 수 있다. 이 경우, 네트워크는 근거리 통신 망(Local Area Network; LAN), 광역 통신망(Wide Area Network; WAN), 부가가치 통신망(Value Added Network; VAN), 이동 통신망(mobile radio communication network), 위성 통신망 및 이들의 상호 조합을 포함할 수 있으 며, 전자 장치 및 서버가 서로 원활하게 통신을 할 수 있도록 하는 포괄적인 의미의 데이터 통신망 이며, 유선 인터넷, 무선 인터넷 및 모바일 무선 통신망을 포함할 수 있다. 이 경우, 전자 장치 및 서버 간에 데이터를 송/수신하기 위한 인터페이스가 정의될 수 있다. 예를 들면, 데이터 인식 모델에 적용할 학습 데이터를 인자 값(또는, 매개 값 또는 전달 값)으로 갖는 API((application program interface)가 정의될 수 있다. API는 어느 하나의 프로토콜(예로, 전자 장치에 서 정의된 프로토콜)에서 다른 프로토콜(예를 들면, 서버에서 정의된 프로토콜)의 어떤 처리를 위해 호출 할 수 있는 서브 루틴 또는 함수의 집합으로 정의될 수 있다. 즉, API를 통하여 어느 하나의 프로토콜에서 다른 프로토콜의 동작이 수행될 수 있는 환경이 제공될 수 있다. 단계 S251에서, 전자 장치는 차량의 주행 상태 및/또는 인접한 다른 차량의 주행 상태를 감지할 수 있다. 또한, 전자 장치는 운전자의 상태, 다른 차량의 차량 정보, 및 주변 환경 정보를 감지할 수 있다. 일 실시예에 따르면, 전자 장치는 가속도 센서, 자이로스코프 센서, IMU, RADAR 센서 , LIDAR 센서, 이미지 센서 등을 이용하여 차량의 주행 상태, 운전자의 상태, 다른 차량의 주행 상태, 다른 차량의 차량 정보, 및 주변 환경 정보를 감지할 수 있다. 단계 S253에서, 전자 장치는 차량의 상태 데이터 및/또는 다른 차량의 상태 데이터를 획득할 수 있다. 또 한, 전자 장치는 운전자의 상태, 다른 차량의 차량 정보, 및/또는 주변 환경 정보와 관련된 상태 데이터를획득할 수 있다. 단계 S255에서, 전자 장치는 서버에게 획득한 상태 데이터에 기반한 위험 상황 추정을 요청할 수 있 다. 단계 S257에서, 서버는 데이터 인식 모델을 이용하여 차량의 위험 상황을 추정할 수 있다. 예를 들면, 전자 장치는 운전자가 스마트 폰을 조작하는 상태 데이터와 차량의 전방에 위치한 신호 등이 적색으로 변경되는 상태 데이터를 서버로 전송할 수 있다. 서버는 데이터 인식 모델을 이용하여 수 신된 운전자, 및 신호등에 대한 상태 데이터에 기반하여 충돌 위험 상황이 있음을 추정할 수 있다. 단계 S259에서, 서버는 추정된 위험 상황을 전자 장치로 전송할 수 있다. 도 1 내지 도 2d는 일 실시 예를 설명하기 위해 도시한 것으로서 이에 한정되지 않는다. 이하, 도 3 내지 도 6을 참조하여, 상태 데이터에 포함되는 상태의 예시들을 구체적으로 설명하기로 한다. 도 3 내지 도 4는 일 실시 예에 따라 차량을 운전 중인 운전자의 상태를 설명하기 위한 도면이다. 일 실시 예에 따라, 상태 데이터는, 운전자의 상태를 포함할 수 있다. 일 실시 예에 따라, 이미지 센서를 포함하는 센싱부는, 차량을 운전 중인 운전자의 영상을 획득함 으로써, 운전자의 얼굴 표정, 시선 및 행동 중 적어도 하나를 포함하는 운전자의 상태를 감지할 수 있다. 도 3을 참조하면, 예를 들어, 전자 장치의 센싱부는 운전자가 운전 중에 소정 시간 내에 소정 횟 수 하품을 하는 행동을 감지할 수 있다. 또한, 예를 들어, 센싱부는 운전자가 운전 중에 수 초 이상 전방을 주시하지 않는 행동을 감지할 수 있다. 또한, 예를 들어, 센싱부는 운전자가 운전 중에 스마트 폰을 조작하는 행동을 감지할 수 있다. 도 4를 참조하면, 예를 들어, 전자 장치의 센싱부는, 운전자가 백미러(back mirror)를 주시(a41)하거 나, 우측 사이드 미러(side mirror)를 주시(a42)하는 운전자의 시선을 감지할 수 있다. 또한, 예를 들어, 센싱 부는 사용자가 핸들을 시계 방향으로 움직이는 행동(a43)을 감지할 수 있다. 일 실시 예에 따라, 전자 장치의 프로세서는, 감지된 운전자의 시선, 행동을 기초로, 운전자의 주행 의도를 판단할 수 있다. 예를 들어, 전자 장치의 프로세서는, 사용자가 우측 차로로 차선을 변경하고 자 하는 주행 의도를 판단할 수 있다. 도 5는 일 실시 예에 따른 차량의 주행 상태와 차량 주변의 다른 차량의 주행 상태를 설명하기 위한 도면이다. 일 실시 예에 따라, 상태 데이터는, 차량의 주행 상태와 다른 차량들(2, 3)의 주행 상태 등을 포함할 수 있 다. 일 실시 예에 따라, 주행 상태는, 차량의 운행 속도, 운행 가속도, 운행 방향, 급정거, 급가속 등의 주행 패턴 등을 포함할 수 있다. 도 5를 참조하면, 전자 장치의 센싱부는 차량의 주행 속도, 주행 가속도, 앞 차량과의 시간 간격, 거리 등을 포함하는 주행 상태(d51)를 감지할 수 있다. 예를 들어, 센싱부는 차량이 시속 80km/h의 속 도로, 앞 차와의 시간 간격 10sec으로, 전방으로 주행 중임을 판단할 수 있다. 또한, 센싱부는 차량의 옆 차로에서 주행 중인 다른 차량의 주행 상태(d52)를 감지할 수 있다. 예를 들어, 센싱부는 옆 차선에서 주행 중인 다른 차량이 시속 70km/h로 주행 중이고, 차량의 앞쪽으로 진입하려는 주행 방향 전환의 움직임을 감지할 수 있다. 또한, 센싱부는 차량의 앞에서 주행 중인 다른 차량의 주행 상태(d53)를 감지할 수 있다. 예를 들어, 센싱부는 차량의 앞 차량이 시속 70km/h로 주행 중임을 감지할 수 있다. 또한, 일 실시 예에 따라, 상태 데이터는, 주변 환경 상태를 포함할 수 있다. 일 실시 예에 따라, 전자 장치의 센싱부는, 차량의 주변 환경을 감지할 수 있다. 일 실시 예에 따라, 센싱부는 주행 중인 도로의 차선 형태 등을 감지할 수 있다. 예를 들어, 센싱부는 차량이 주행 중인 도로가 전방 수 백 미터 후부터, 2차선 도로가 1차선 도로로 좁아지는 구간임을 감지할 수 있다. 또한, 전자 장치의 센싱부는, 안개, 눈, 비 등에 의해 전방 시야 확보가 원활한지, 노면의 결빙, 사 고 다발 구간, 공사 구간 등을 판단할 수 있다. 또한, 센싱부는, 주행 경로 상의 보행자 또는 장애물 등을 감지할 수 있다. 도 6은 일 실시 예에 따른 차량 주변의 다른 차량들의 차량 정보를 설명하기 위한 도면이다. 일 실시 예에 따라, 상태 데이터는, 차량 정보를 포함할 수 있다. 일 실시 예에 따른 차량 정보는, 차종, 연식, 무게, 보험 이력, 잠재 사고율 등을 포함할 수 있다. 일 실시 예에 따라, 전자 장치의 센싱부는 차량의 주변에서 주행 중인 다른 차량을 촬영한 영상을 획득할 수 있다. 프로세서는 다른 차량을 촬영한 영상으로부터 다른 차량의 차량 정보를 획득할 수 있다. 도 6을 참조하면, 전자 장치는 차량의 앞쪽에서 주행 중인 다른 차량(61, 62, 63)을 인식할 수 있다. 전자 장치는 다른 차량(61, 62, 63)의 영상으로부터 차종, 연식 등을 추출할 수 있다. 또한, 전자 장치는 차량(61, 62, 63)의 영상을 서버로 전송하고, 서버로부터 차량의 차종, 연식 등을 포함 하는 차량 정보를 수신할 수 있다. 또한, 일 실시 예에 따라, 전자 장치는 차량 영상으로부터 추출된 차량 번호를 보험사 서버로 전송하고, 보험사 서버로부터 차량 번호에 대응하는 보험 사고 이력을 획득할 수 있다. 또한, 일 실시 예에 따라, 전자 장치는 차량 영상으로부터 추출된 차종, 연식 등에 관한 정보에 기초하여, 차량의 잠재 사고율을 판단할 수 있다. 또 다른 예로, 전자 장치는, 차량 영상을 서버로 전송하고, 서버로부터 차종, 연식 등에 관한 정보에 기초 하여 판단된 차량의 잠재 사고율에 관한 정보를 수신할 수 있다. 도 7은 일 실시 예에 따른 상태 데이터를 획득하는 방법을 설명하기 위한 도면이다. 도 7을 참조하면, 전자 장치의 프로세서는, 차량을 운전 중인 운전자의 상태와 다른 차량 의 주행 상태를 조합한 상태 데이터에 기초하여, 위험 상황을 판단할 수 있다. 일 실시 예에 따라, 전자 장치가 운전자의 졸음만을 감지한 때, 프로세서는 예측되는 위험 상황 의 위험도를 낮게 판단(예컨대, 위험도 3)할 수 있다. 또한, 전자 장치의 센싱부가 다른 차량이 차량의 앞쪽으로 진입하려는 의도만을 감지한 경우, 프로세서는 예측되는 위험 상황의 위험도를 낮게 판단(예컨대, 위험도 3)할 수 있다. 일 실시 예에 따라, 프로세서는 운전자의 졸음과 다른 차량의 차선 변경이 근접한 시점 내에 발생 하는 경우, 예측되는 위험 상황의 위험도를 높게 판단(예컨대, 위험도 7)할 수 있다. 예를 들어, 프로세서(12 0)는 다른 차량의 차선 변경으로 인해, 차량과 앞 차량과의 충돌 위험 상황을 예측하고, 위험도를 높 게 판단할 수 있다. 한편, 일 실시 예에 따라, 프로세서는 운전자의 졸음과 다른 차량의 차선 변경과 함께, 차량의 속도가 가속되는 것으로 감지하는 경우에는, 예측되는 위험 상황의 위험도를 더 높게 판단(예컨대, 위험도 10)할 수 있 다. 일 실시 예에 따라, 전자 장치의 프로세서는 근접한 시점에 감지된 복수의 상태를 조합한 상태 데이 터에 기초하여 위험 상황을 판단할 수 있다. 또한, 프로세서는 상태 데이터에 기초하여 판단된 위험 상황 을 학습함에 따라, 데이터 인식 모델을 업데이트 할 수 있다. 도 3 내지 도 7은 일 실시 예를 설명하기 위해 도시한 것으로서 이에 한정되지 않는다. 도 8a는 일 실시 예에 따라 주행 가이드 정보를 결정하는 방법의 흐름도이다. 단계 S801에서, 전자 장치의 프로세서는 상태 데이터를 획득할 수 있다. 단계 S801에 관해서는, 도2 의 단계 S202를 참조할 수 있다. 일 실시 예에 따른 상태 데이터에 관해서 도 3 내지 도 7에서 상술하였으므로 생략하기로 한다. 단계 S802에서, 전자 장치의 프로세서는, 획득된 상태 데이터에 기초하여, 차량의 위험 상황을 판단 할 수 있다. 단계 S802에 관해서는, 도 2의 단계 S203를 참조할 수 있다. 단계 S803에서, 전자 장치의 프로세서는, 위험 상황을 방지하기 위한 주행 가이드 정보를 결정할 수 있다.예를 들어, 전자 장치의 프로세서는, 앞 차량과의 충돌 위험 상황이 예측되면, 충돌 상황을 방지하기 위한 차량의 급정거 또는 방향 전환 등의 주행 가이드 정보를 결정할 수 있다. 일 실시 예에 따라, 프로세서는 위험 상황에 기초한 주행 가이드 정보를 결정하기 위해, 적어도 하나의 데 이터 인식 모델을 이용할 수 있다. 또한, 프로세서는 위험 상황을 방지하기 위해 결정된 주행 가이드 정보 를 학습함에 따라, 데이터 인식 모델을 업데이트할 수 있다. 단계 S804에서, 전자 장치의 프로세서는, 판단된 차량의 위험 상황 및 주행 가이드 정보 중 적어도 하나를 디스플레이 할 수 있다. 일 실시 예에 따라, 프로세서는 위험 상황 및 주행 가이드 정보 중 적어도 하나를, 차량의 헤드 업 디 스플레이(head-up display), CID(Central Information Display), 미러 디스플레이(mirror display), 통신부를 통해 연결된 기기의 디스플레이에 표시할 수 있으며, 이에 제한되지 않는다. 예를 들어, 프로세서는, 앞 차량과의 충돌 위험을 경고하는 알림 메시지를 헤드 업 디스플레이(head-up display)에 표시할 수 있다. 또한, 일 실시 예에 따라, 프로세서는 음향 출력부를 통해, 위험 상황 및 주행 가이드 정보 중 적어 도 하나를 음향으로 출력할 수 있다. 예를 들어, 프로세서는 주행 정지하라는 메시지를 음향으로 출력할 수 있다. 도 8b는 다양한 실시예에 따른 제 1 프로세서(120a) 및 제 2 프로세서(120b)가 차량의 위험 상황을 추정하고, 주행 가이드 정보를 선정하는 상황을 설명하기 위한 흐름도이다. 일 실시예에 따르면, 전자 장치는 제 1 프로세서(120a) 및 제 2 프로세서(120b)를 포함할 수 있다. 단계 S811에서, 제 1 프로세서(120a)는 차량의 주행 상태 및/또는 인접한 다른 차량의 주행 상태를 감지할 수 있다. 또한, 제 1 프로세서(120a)는 운전자의 상태, 다른 차량의 차량 정보, 및 주변 환경 정보를 감지할 수 있 다. 단계 S813에서, 제 1 프로세서(120a)는 차량의 상태 데이터 및/또는 다른 차량의 상태 데이터를 획득할 수 있다. 또한, 제 1 프로세서(120a)는 운전자의 상태, 다른 차량의 차량 정보, 및/또는 주변 환경 정보와 관련된 상태 데이터를 획득할 수 있다. 단계 S815에서, 제 1 프로세서(120a)는 제 2 프로세서(120b)에게 획득한 상태 데이터에 기반한 위험 상황 추정 및 주행 가이드 정보 선정을 요청할 수 있다. 단계 S817에서, 제 2 프로세서(120b)는 데이터 인식 모델을 이용하여 차량의 위험 상황을 추정할 수 있다. 단계 S819에서, 제 2 프로세서(120b)는 데이터 인식 모델을 이용하여 추정된 차량의 위험 상황에 적합한 주행 가이드 정보를 선정할 수 있다. 예를 들면, 제 1 프로세서(120a)는 운전자가 스마트 폰을 조작하는 상태 데이터와 차량의 전방에 위치한 신호등 이 적색으로 변경되는 상태 데이터를 제 2 프로세서(120b)로 전송할 수 있다. 제 2 프로세서(120b)는 데이터 인식 모델을 이용하여 수신된 운전자, 및 신호등에 대한 상태 데이터에 기반하여 충돌 위험 상황이 있음을 추정할 수 있다. 제 2 프로세서(120b)는 추정된 위험 상황을 데이터 인식 모델에 적용 하여 앞 차량과의 충돌 위험을 경고하는 알림을 선정할 수 있다. 단계 S821에서, 제 2 프로세서(120b)는 추정된 위험 상황 및 선정된 주행 가이드 정보를 제 1 프로세서(120a)로 전송할 수 있다. 제 1 프로세서(120a)는 수신된 위험 상황 및 주행 가이드 정보 중 적어도 하나를 차량의 헤 드 업 디스플레이(head-up display), CID(Central Information Display), 미러 디스플레이(mirror display), 통신부를 통해 연결된 기기의 디스플레이에 표시할 수 있다. 또한, 다양한 실시예에 따르면, 제 1 프로세서 (120a)는 주행 정지라는 메시지를 음향으로 출력할 수 있다. 도 8c는 다양한 실시예에 따른 제 1 프로세서(120a), 제 2 프로세서(120b), 제 3 프로세서(120c)가 차량의 위험 상황을 추정하고, 주행 가이드 정보를 선정하는 상황을 설명하기 위한 흐름도이다. 일 실시예에 따르면, 전자 장치는 제 1 프로세서(120a), 제 2 프로세서(120b), 제 3 프로세서(120c)를 포 함할 수 있다. 제 3 프로세서(120c)는 데이터 인식 모델을 이용하여 차량의 위험 상황에 기반하여 주행 가이드정보를 선정할 수 있다. 단계 S831에서, 제 1 프로세서(120a)는 차량의 주행 상태 및/또는 인접한 다른 차량의 주행 상태를 감지할 수 있다. 또한, 제 1 프로세서(120a)는 운전자의 상태, 다른 차량의 차량 정보, 및 주변 환경 정보를 감지할 수 있 다. 단계 S833에서, 제 1 프로세서(120a)는 차량의 상태 데이터 및/또는 다른 차량의 상태 데이터를 획득할 수 있다. 또한, 제 1 프로세서(120a)는 운전자의 상태, 다른 차량의 차량 정보, 및/또는 주변 환경 정보와 관련된 상태 데이터를 획득할 수 있다. 단계 S835에서, 제 1 프로세서(120a)는 제 2 프로세서(120b)에게 획득한 상태 데이터에 기반한 위험 상황 추정 을 요청할 수 있다. 단계 S837에서, 제 1 프로세서(120a)는 제 3 프로세서(120c)에게 차량의 위험 상황에 기반한 주행 가이드 정보 선정을 요청할 수 있다. 예를 들면, 제 1 프로세서(120a)는 운전자가 스마트 폰을 조작하는 상태 데이터와 차량의 전방에 위치한 신호등 이 적색으로 변경되는 상태 데이터를 제 3 프로세서(120c)로 전송할 수 있다. 단계 S839에서, 제 2 프로세서(120b)는 데이터 인식 모델을 이용하여 차량의 위험 상황을 추정할 수 있다. 예를 들면, 제 2 프로세서(120b)는 수신된 운전자, 및 신호등에 대한 상태 데이터를 데이터 인식 모델에 적용하 여 충돌 위험 상황이 있음을 추정할 수 있다. 단계 S841에서, 제 2 프로세서(120b)는 추정된 차량의 위험 상황을 제 3 프로세서(120c)로 전송할 수 있다. 단계 S843에서, 제 3 프로세서(120c)는 추정된 차량의 위험 상황을 데이터 인식 모델에 적용하여 주행 가이드 정보를 선정할 수 있다. 예를 들면, 제 3 프로세서(120c)는 추정된 위험 상황을 데이터 인식 모델에 적용하여 앞 차량과의 충돌 위험을 경고하는 알림을 선정할 수 있다. 단계 S845에서, 제 3 프로세서(120c)는 추정된 위험 상황 및 선정된 주행 가이드 정보를 제 1 프로세서(120a)로 전송할 수 있다. 제 1 프로세서(120a)는 수신된 위험 상황 및 주행 가이드 정보 중 적어도 하나를 차량의 헤 드 업 디스플레이(head-up display), CID(Central Information Display), 미러 디스플레이(mirror display), 통신부를 통해 연결된 기기의 디스플레이에 표시할 수 있다. 또한, 다양한 실시예에 따르면, 제 1 프로세서 (120a)는 주행 정지라는 메시지를 음향으로 출력할 수 있다. 도 8d는 다양한 실시예에 따른 전자 장치 및 서버가 차량의 위험 상황을 추정하고, 주행 가이드 정 보를 선정하는 상황을 설명하기 위한 흐름도이다. 일 실시예에 따르면, 전자 장치는 서버를 이용하여 차량의 위험 상황을 추정하고, 주행 가이드 정보 를 선정할 수 있다. 단계 S861에서, 전자 장치는 차량의 주행 상태 및/또는 인접한 다른 차량의 주행 상태를 감지할 수 있다. 또한, 전자 장치는 운전자의 상태, 다른 차량의 차량 정보, 및 주변 환경 정보를 감지할 수 있다. 단계 S863에서, 전자 장치는 차량의 상태 데이터 및/또는 다른 차량의 상태 데이터를 획득할 수 있다. 또 한, 전자 장치는 운전자의 상태, 다른 차량의 차량 정보, 및/또는 주변 환경 정보와 관련된 상태 데이터를 획득할 수 있다. 단계 S865에서, 전자 장치는 서버에게 획득한 상태 데이터에 기반한 위험 상황 추정 및 주행 가이드 정보 선정을 요청할 수 있다. 단계 S867에서, 서버는 데이터 인식 모델을 이용하여 차량의 위험 상황을 추정할 수 있다. 예를 들면, 전자 장치는 운전자가 스마트 폰을 조작하는 상태 데이터와 차량의 전방에 위치한 신호등이 적 색으로 변경되는 상태 데이터를 서버로 전송할 수 있다. 단계 S869에서, 서버는 데이터 인식 모델을 이용하여 추정된 차량의 위험 상황에 적합한 주행 가이드 정 보를 선정할 수 있다. 예를 들면, 서버는 데이터 인식 모델을 이용하여 수신된 운전자, 및 신호등에 대한 상태 데이터에 기반하 여 충돌 위험 상황이 있음을 추정할 수 있다. 서버는 추정된 위험 상황을 데이터 인식 모델에 적용하여 앞 차량과의 충돌 위험을 경고하는 알림을 선정할 수 있다. 단계 S871에서, 서버는 추정된 위험 상황 및 선정된 주행 가이드 정보를 전자 장치로 전송할 수 있 다. 전자 장치는 수신된 위험 상황 및 주행 가이드 정보 중 적어도 하나를 차량의 헤드 업 디스플레이 (head-up display), CID(Central Information Display), 미러 디스플레이(mirror display), 통신부를 통해 연 결된 기기의 디스플레이에 표시할 수 있다. 또한, 다양한 실시예에 따르면, 전자 장치는 주행 정지라는 메 시지를 음향으로 출력할 수 있다. 도 9는 일 실시 예에 따라 주행 가이드 정보를 사용자에게 제공하는 일 예를 도시한다. 도 9를 참조하면, 예를 들어, 차량이 제1 차로를 주행하는 중, 제2 차로로 주행 차로를 변경하고자 할 때, 운전자는 제3 차로에서 제2 차로로 이동하려는 차량을 미처 파악하지 못할 수 있으나, 전자 장치는 차선 변경 시의 위험 상황을 미리 판단하고 사용자에게 알릴 수 있다. 일 실시 예에 따라, 전자 장치는 운전자가 제2 차로로 차선을 변경하려는 주행 의도를 판단할 수 있다. 예 를 들어, 전자 장치는 운전자가 우측 사이드 미러를 주시하는 시선과 핸들이 시계 방향으로 움직임을 감지 할 수 있다. 전자 장치는, 차선을 변경하려는 주행 의도와, 차량의 주행 속도, 제3 차로에서 제2 차로 로 차선을 변경하려는 차량의 주행 속도, 차량 간의 시간 간격 등을 감지할 수 있다. 전자 장치는 감지된 상태에 기초하여, 제2 차로로 주행 차로를 변경하는 경우, 제3 차로에서 제2 차로로 이동하려는 차량과의 충동 위험 상황이 발생할 수 있음을 예측할 수 있다. 도 9를 참조하면, 예를 들어, 프로세서는 헤드 업 디스플레이(head-up display)에 차량의 위험 상황(예 컨대, “우측 차선 변경 위험!”)을 표시할 수 있다. 또한, 프로세서는 다른 차량과의 시간 간격(예컨 대, “1sec”)을 표시할 수 있다. 또한, 프로세서는 위험 상황을 방지 하기 위한 주행 가이드 정보(예컨대, “차선 유지!”)를 표시할 수 있다. 일 실시 예에 따르면, 전자 장치는 운전자가 미처 예측하지 못한 위험 상황을 미리 파악하여, 주행 가이드 정보를 알려줌으로써, 보다 안전한 주행 환경을 제공할 수 있다. 도 8 내지 도 9는 일 실시 예를 도시한 것으로서 이에 한정되지 않는다. 도 10은 일 실시 예에 따라 다른 차량의 위험도를 판단하는 방법의 흐름도이다. 도 11 내지 도 12는 일 실시 예 에 따라 다른 차량의 위험도를 사용자에게 제공하는 일 예를 도시한다. 도 10의 흐름도는 도 11 내지 도 12를 참조하여 설명하기로 한다. 도 10의 단계 S1001에서, 전자 장치의 프로세서는, 다른 차량의 주행 상태와 차량 정보를 포함하는 상태 데이터를 획득할 수 있다. 다른 차량의 주행 상태와 차량 정보를 획득하는 예에 대해서는 도5, 도 6 등에 관한 설명에서 상술하였으므로, 생략하기로 한다. 도 10의 단계 S1002에서, 전자 장치의 프로세서는, 획득된 상태 데이터에 기초하여, 다른 차량이 차 량에게 영향을 미칠 수 있는 위험도를 판단할 수 있다. 단계 S1003에서, 전자 장치의 프로세서는, 다 른 차량의 위험도를 디스플레이 할 수 있다. 도 11을 참조하면, 예를 들어, 차량과 반대 방향으로 주행 중인 트럭이 중앙선을 침범하여 주행 중일 수 있다. 이 때, 전자 장치의 프로세서는 차량의 앞 유리를 통해 전방으로 보이는 다른 차량들 (111, 112, 113, 114, 115) 중 중앙선을 침범하여 주행 중인 트럭의 위험도를 높게 판단하고, 헤드 업 디 스플레이에 위험도를 표시할 수 있다. 예컨대, 프로세서는 위험도를 숫자로 표시할 수 있고, 위험도에 따라 서로 구별되는 색깔로 표시할 수 있 다. 또한, 프로세서는 위험을 알리는 아이콘 등을 함께 표시할 수도 있으며, 이에 제한되지 않는다. 도 12를 참조하면, 일 실시 예에 따라, 프로세서는 주변에서 주행 중인 다른 차량(121, 122, 123)의 차량 정보에 기초하여, 다른 차량의 위험도를 판단할 수 있다. 예를 들어, 프로세서는 다른 차량의 보험 사고 이력, 차종, 연식에 기초한 잠재 사고율에 기초하여, 다른 차량의 위험도를 판단할 수 있다. 도 12에 도시한 바와 같이, 프로세서는 위험도를 막대 그래프로 표시할 수 있고, 위험도에 따라 서로 구별 되는 색깔로 표시할 수 있다. 예를 들어, 프로세서는 위험도가 높은 차량에 대응하도록 적색을 표시하고,위험도가 낮은 차량은 녹색으로 표시할 수 있다. 또한, 프로세서는 위험도가 높은 차량이 식별되도록 아이콘 등을 함께 표시할 수도 있다. 또한, 프로세서 는 각각의 차량의 위험도가 구별될 수 있도록 Heat map으로 표시할 수 있으며, 이에 제한되지 않는다. 또 다른 예로, 프로세서는 음향 출력부를 통해 다른 차량의 위험도를 음향으로 출력할 수도 있다. 도 10 내지 도 12는 일 실시 예를 도시한 것으로서 이에 한정되지 않는다. 도 13a는 일 실시 예에 따라 전자 장치가 차량의 주행 동작을 제어하는 방법의 흐름도이다. 단계 S1301에서, 전자 장치의 프로세서는, 적어도 하나의 데이터 인식 모델을 이용하여, 판단된 차량 의 위험 상황을 방지하기 위한 주행 가이드 정보를 결정할 수 있다. 단계 S1301은, 도 8의 단계 S803을 참조할 수 있다. 단계 S1302에서, 전자 장치의 프로세서는, 판단된 차량의 위험 상황의 위험도가 미리 정해진 임계치 에 대응하는 경우, 운전자에 의한 주행 동작의 제어를 차단할 수 있다. 일 실시 예에 따라, 프로세서는 예측되는 위험도가 높고 운전자의 운전 상태에 기초할 때 위험 상황을 방 지하는 것이 어려울 것으로 판단되면, 운전자가 차량의 동작을 제어하는 신호를 차단시킬 수 있다. 단계 S1303에서, 전자 장치의 프로세서는, 주행 가이드 정보에 기초하여, 차량의 주행 속도 및 주행 방향 중 적어도 하나를 포함하는 주행 동작을 제어할 수 있다. 예를 들어, 전자 장치는 충돌 위험 상황을 방지하기 위해, 브레이크를 동작시켜 차량을 급정지시킬 수 있다. 또한, 전자 장치는 충돌 위험 상황을 방지하기 위해, 주행 방향을 전환시킬 수 있다. 도 13b는 다양한 실시예에 따른 제 1 프로세서(120a) 및 제 2 프로세서(120b)가 차량의 주행 동작을 제어하는 상황을 설명하기 위한 흐름도이다. 일 실시예에 따르면, 전자 장치는 제 1 프로세서(120a) 및 제 2 프로세서(120b)를 포함할 수 있다. 단계 S1311에서, 제 1 프로세서(120a)는 차량의 주행 상태 및/또는 인접한 다른 차량의 주행 상태를 감지할 수 있다. 또한, 제 1 프로세서(120a)는 운전자의 상태, 다른 차량의 차량 정보, 및 주변 환경 정보를 감지할 수 있 다. 단계 S1313에서, 제 1 프로세서(120a)는 차량의 상태 데이터 및/또는 다른 차량의 상태 데이터를 획득할 수 있 다. 또한, 제 1 프로세서(120a)는 운전자의 상태, 다른 차량의 차량 정보, 및/또는 주변 환경 정보와 관련된 상 태 데이터를 획득할 수 있다. 단계 S1315에서, 제 1 프로세서(120a)는 제 2 프로세서(120b)에게 획득한 상태 데이터에 기반한 위험 상황 추정 및 주행 가이드 정보 선정을 요청할 수 있다. 예를 들면, 제 1 프로세서(120a)는 운전자가 스마트 폰을 조작하는 상태 데이터와 차량의 전방에 위치한 신호등 이 적색으로 변경되는 상태 데이터를 제 2 프로세서(120b)로 전송할 수 있다. 단계 S1317에서, 제 2 프로세서(120b)는 데이터 인식 모델을 이용하여 차량의 위험 상황을 추정할 수 있다. 예를 들면, 제 2 프로세서(120b)는 데이터 인식 모델을 이용하여 수신된 운전자, 및 신호등에 대한 상태 데이터 에 기반하여 충돌 위험 상황이 있음을 추정할 수 있다. 단계 S1319에서, 제 2 프로세서(120b)는 데이터 인식 모델을 이용하여 차량의 위험 상황에 대한 위험도 레벨을 추정할 수 있다. 위험도 레벨은, 예를 들면, 레벨 1부터 레벨 10까지 포함할 수 있다. 제 2 프로세서(120b)는 위험도 레벨이 레벨 7을 초과하면, 운전자가 차량의 동작을 제어하는 신호를 차단하고, 차량의 주행 속도 및 주행 방향 중 적어도 하나를 포함하는 주행 동작을 제어하는 주행 가이드 정보를 생성할 수 있다. 단계 S1321에서, 제 2 프로세서(120b)는 추정된 위험도 레벨이 기 설정된 레벨 이상이면, 운전자의 주행 제어를 차단하고, 차량의 주행 동작을 제어하는 주행 가이드 정보를 선정할 수 있다. 예를 들어, 제 2 프로세서(120b)는 운전자가 계속하여 스마트 폰을 조작하고, 적색 신호등과의 거리가 10m 이내 가 되면, 위험도 레벨을 레벨 8로 설정할 수 있다. 이 경우, 제 2 프로세서(120b)는 운전자가 차량의 동작을 제어하는 신호를 차단하고, 차량의 주행 속도를 줄이는 주행 가이드 정보를 생성할 수 있다.다양한 실시예에 따르면, 제 2 프로세서(120b)는 위험도 레벨이 8을 초과하면, 주행 방향을 변경하는 신호를 주 행 가이드 정보에 더 포함시킬 수 있다. 단계 S1323에서, 제 2 프로세서(120b)는 추정된 위험 상황 및 선정된 주행 가이드 정보를 제 1 프로세서(120a) 로 전송할 수 있다. 제 1 프로세서(120a)는 제 2 프로세서(120b)로부터 수신된 내용에 따라서 차량의 충돌을 방 지 하기 위해 차량의 주행 속도를 줄이도록 차량의 브레이크를 동작시킬 수 있다. 도 13c는 다양한 실시예에 따른 제 1 프로세서(120a), 제 2 프로세서(120b), 제 3 프로세서(120c)가 차량의 주 행 동작을 제어하는 상황을 설명하기 위한 흐름도이다. 일 실시예에 따르면, 전자 장치는 제 1 프로세서(120a), 제 2 프로세서(120b), 제 3 프로세서(120c)를 포 함할 수 있다. 제 3 프로세서(120c)는 차량의 위험 상황에 대한 위험도 레벨에 기반하여 주행 가이드 정보를 선 정할 수 있다. 단계 S1331에서, 제 1 프로세서(120a)는 차량의 주행 상태 및/또는 인접한 다른 차량의 주행 상태를 감지할 수 있다. 또한, 제 1 프로세서(120a)는 운전자의 상태, 다른 차량의 차량 정보, 및 주변 환경 정보를 감지할 수 있 다. 단계 1333에서, 제 1 프로세서(120a)는 차량의 상태 데이터 및/또는 다른 차량의 상태 데이터를 획득할 수 있다. 또한, 제 1 프로세서(120a)는 운전자의 상태, 다른 차량의 차량 정보, 및/또는 주변 환경 정보와 관련된 상태 데이터를 획득할 수 있다. 단계 S1335에서, 제 1 프로세서(120a)는 제 2 프로세서(120b)에게 획득한 상태 데이터에 기반한 위험 상황 추정 및 주행 가이드 정보 선정을 요청할 수 있다. 예를 들면, 제 1 프로세서(120a)는 운전자가 스마트 폰을 조작하는 상태 데이터와 차량의 전방에 위치한 신호등 이 적색으로 변경되는 상태 데이터를 제 2 프로세서(120b)로 전송할 수 있다. 단계 S1337에서, 제 1 프로세서(120a)는 제 3 프로세서(120c)에게 차량의 위험 상황에 대한 위험도 레벨에 기반 한 주행 가이드 정보 선정을 요청할 수 있다. 단계 S1339에서, 제 2 프로세서(120b)는 데이터 인식 모델을 이용하여 차량의 위험 상황을 추정할 수 있다. 예를 들면, 제 2 프로세서(120b)는 데이터 인식 모델을 이용하여 수신된 운전자, 및 신호등에 대한 상태 데이터 에 기반하여 충돌 위험 상황이 있음을 추정할 수 있다. 단계 S1341에서, 제 2 프로세서(120b)는 데이터 인식 모델을 이용하여 차량의 위험 상황에 대한 위험도 레벨을 추정할 수 있다. 위험도 레벨은, 예를 들면, 레벨 1부터 레벨 10까지 포함할 수 있다. 제 2 프로세서(120b)는 위험도 레벨이 레벨 7을 초과하면, 운전자가 차량의 동작을 제어하는 신호를 차단하고, 차량의 주행 속도 및 주행 방향 중 적어도 하나를 포함하는 주행 동작을 제어하는 주행 가이드 정보를 생성할 수 있다. 단계 S1343에서, 제 2 프로세서(120b)는 추정된 차량의 위험 상황 및 위험도 레벨을 제 3 프로세서(120c)로 전 송할 수 있다. 단계 S1345에서, 제 3 프로세서(120c)는 추정된 위험도 레벨이 기 설정된 레벨 이상이면, 운전자의 주행 제어를 차단하고, 차량의 주행 동작을 제어하는 주행 가이드 정보를 선정할 수 있다. 예를 들어, 제 3 프로세서(120c)는 운전자가 계속하여 스마트 폰을 조작하고, 적색 신호등과의 거리가 10m 이내 가 되면, 위험도 레벨을 레벨 8로 설정할 수 있다. 이 경우, 제 3 프로세서(120c)는 운전자가 차량의 동작을 제어하는 신호를 차단하고, 차량의 주행 속도를 줄이는 주행 가이드 정보를 생성할 수 있다. 단계 S1347에서, 제 3 프로세서(120c)는 추정된 위험 상황 및 선정된 주행 가이드 정보를 제 1 프로세서(120a) 로 전송할 수 있다. 제 1 프로세서(120a)는 제 3 프로세서(120c)로부터 수신된 내용에 따라서 차량의 충돌을 방 지 하기 위해 차량의 주행 속도를 줄이도록 차량의 브레이크를 동작시킬 수 있다. 도 13d는 다양한 실시예에 따른 전자 장치 및 서버가 차량의 주행 동작을 제어하는 상황을 설명하기 위한 흐름도이다. 일 실시예에 따르면, 전자 장치는 서버를 이용하여 차량의 주행 동작을 제어할 수 있다. 단계 S1361에서, 전자 장치는 차량의 주행 상태 및/또는 인접한 다른 차량의 주행 상태를 감지할 수 있다. 또한, 전자 장치는 운전자의 상태, 다른 차량의 차량 정보, 및 주변 환경 정보를 감지할 수 있다. 단계 S1363에서, 전자 장치는 차량의 상태 데이터 및/또는 다른 차량의 상태 데이터를 획득할 수 있다. 또 한, 전자 장치는 운전자의 상태, 다른 차량의 차량 정보, 및/또는 주변 환경 정보와 관련된 상태 데이터를 획득할 수 있다. 단계 S1365에서, 전자 장치는 서버에게 획득한 상태 데이터에 기반한 위험 상황 추정 및 주행 가이 드 정보 선정을 요청할 수 있다. 예를 들면, 전자 장치는 운전자가 스마트 폰을 조작하는 상태 데이터와 차량의 전방에 위치한 신호등이 적 색으로 변경되는 상태 데이터를 서버로 전송할 수 있다. 단계 S1367에서, 서버는 데이터 인식 모델을 이용하여 차량의 위험 상황을 추정할 수 있다. 예를 들면, 서버는 데이터 인식 모델을 이용하여 수신된 운전자, 및 신호등에 대한 상태 데이터에 기반하 여 충돌 위험 상황이 있음을 추정할 수 있다. 단계 S1369에서, 서버는 데이터 인식 모델을 이용하여 차량의 위험 상황에 대한 위험도 레벨을 추정할 수 있다. 위험도 레벨은, 예를 들면, 레벨 1부터 레벨 10까지 포함할 수 있다. 제 2 프로세서(120b)는 위험도 레벨 이 레벨 7을 초과하면, 운전자가 차량의 동작을 제어하는 신호를 차단하고, 차량의 주행 속도 및 주행 방 향 중 적어도 하나를 포함하는 주행 동작을 제어하는 주행 가이드 정보를 생성할 수 있다. 단계 S1371에서, 서버는 추정된 위험도 레벨이 기 설정된 레벨 이상이면, 운전자의 주행 제어를 차단하고, 차량의 주행 동작을 제어하는 주행 가이드 정보를 선정할 수 있다. 예를 들어, 서버는 운전자가 계속하여 스마트 폰을 조작하고, 적색 신호등과의 거리가 10m 이내가 되면, 위험도 레벨을 레벨 8로 설정할 수 있다. 이 경우, 서버는 운전자가 차량의 동작을 제어하는 신호를 차단하고, 차량의 주행 속도를 줄이는 주행 가이드 정보를 생성할 수 있다. 단계 S1373에서, 서버는 추정된 위험 상황 및 선정된 주행 가이드 정보를 전자 장치로 전송할 수 있 다. 전자 장치는 서버로부터 수신된 내용에 따라서 차량의 충돌을 방지 하기 위해 차량의 주행 속도 를 줄이도록 차량의 브레이크를 동작시킬 수 있다. 도 14는 일 실시 예에 따라 전자 장치가 차량의 주행 동작을 제어하는 일 예를 도시한다. 도 14에 도시한 바와 같이, 예를 들어, 전자 장치의 센싱부는, 차량이 주행하는 중, 전방에 위치 한 신호등의 적신호를 인식할 수 있다. 이 때, 전자 장치는 차량의 속도가 유지되고 있고 차량의 운 전자가 졸음 상태인 것으로 감지되면, 수 초 후에 앞 차량과의 충돌 위험 상황이 발생할 수 있음을 예측할 수 있다. 일 실시 예에 따른 프로세서는, 앞 차량과의 충돌 위험 상황을 방지하기 위한 주행 가이드 정보를 결 정할 수 있다. 예를 들어, 프로세서는 앞 차량과의 충돌을 방지하기 위해 주행 정지해야 할 것으로 판단할 수 있다. 일 실시 예에 따라, 프로세서는 브레이크 작동 및 제동 거리를 고려할 때 충돌 상황을 방지할 수 없는 임 계치에 도달한 것으로 판단하면, 차량의 브레이크를 동작시켜 급정지시킬 수 있다. 또한, 일 실시 예에 따라, 프로세서는 급정거하라는 경고 메시지(예컨대, “STOP!!”)를 헤드 업 디 스플레이에 표시할 수 있다. 또한, 프로세서는 음향 출력부를 통해 경고음을 출력할 수도 있다. 도 13 내지 14는 일 실시 예를 도시한 것으로서 이에 한정되지 않는다. 도 15는 일 실시예에 따른 전자 장치의 블록 구성도(block diagram)이다. 전자 장치는 일 실시 예에 따라, 센싱부 및 프로세서를 포함할 수 있다. 도 15에 도시된 전자 장치는 본 실시 예와 관련된 구성요소들만이 도시되어 있다. 따라서, 도 15에 도시된 구성요소들 외에 다"}
{"patent_id": "10-2017-0135233", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "른 범용적인 구성요소들이 더 포함될 수 있음을 본 실시 예와 관련된 기술분야에서 통상의 지식을 가진 자라면 이해할 수 있다. 일 실시 예에 따라, 센싱부는 차량이 주행하는 중에, 차량의 주행 상태 또는 차량 주변의 다른 차량의 주행 상태를 감지할 수 있다. 센싱부는 차량 또는 다른 차량의 주행 상태를 감지하기 위한 다수의 센서들을 포함할 수 있다. 예를 들 어, 센싱부는 LIDAR 센서 및 RADAR 센서와 같은 거리 센서, 및 카메라와 같은 이미지 센서를 포함할 수 있 다. 또한, 센싱부는 다수의 센서들의 위치 및/또는 배향을 수정하도록 구성되는 하나 이상의 액추에이터들을 포함할 수 있는 바, 차량의 전방, 후방, 및 측방 각각의 방향에 위치한 객체를 센싱할 수 있다. 또한, 센싱부는 이미지 센서(image sensor)를 이용하여 주변에 위치한 객체의 형태 및 차로의 형태 등을 센싱할 수 있다. 일 실시예에 따라, 프로세서는 적어도 하나의 프로세서로 구성될 수 있다. 일 실시 예에 따라, 프로세서는 차량의 주행 상태 및 차량 주변의 다른 차량의 주행 상태를 포함하 는 상태 데이터를 획득할 수 있다. 프로세서는 적어도 하나의 데이터 인식 모델을 이용하여, 획득된 상태 데이터에 기초하여, 차량이 주행하는 중에 소정 시간 후의 차량의 위험 상황을 판단할 수 있다. 또한, 프로세서는, 센싱부에 의해 감지된 차량을 운전 중인 운전자의 얼굴 표정, 시선 및 행동 중 적어도 하나를 포함하는 운전자의 상태를 포함하는, 상태 데이터를 획득할 수 있다. 또한, 프로세서는, 차량의 운행 속도, 운행 가속도 및 운행 방향 중 적어도 하나를 포함하는 차량의 주행 상태를 포함하는, 상태 데이터를 획득할 수 있다. 또한, 프로세서는, 다른 차량을 촬영한 영상으로부터 다른 차량의 차량 정보를 획득하고, 다른 차량의 차 량 정보를 포함하는 상태 데이터를 획득할 수 있다. 또한, 프로세서는, 센싱부에 의해 감지된 차량이 주행 중인 도로의 상태 또는 날씨 상태를 포함하 는 주변 환경 상태를 포함하는, 상태 데이터를 획득할 수 있다. 또한, 프로세서는, 적어도 하나의 데이터 인식 모델을 이용하여, 판단된 차량의 위험 상황을 방지하기 위 한 주행 가이드 정보를 결정할 수 있다. 또한, 프로세서는, 판단된 차량의 위험 상황 및 판단된 차량의 위험 상황을 방지하기 위한 주행 가이드 정 보 중 적어도 하나를 디스플레이할 수 있다. 또한, 프로세서는, 적어도 하나의 데이터 인식 모델을 이용하여, 획득된 상태 데이터에 기초하여, 차량 의 주변에서 주행 중인 다른 차량이 차량에게 영향을 미칠 수 있는 위험도를 판단할 수 있다. 또한, 프로세서는, 판단된 차량의 위험 상황을 방지하기 위한 주행 가이드 정보에 기초하여, 차량의 주 행 속도 및 주행 방향 중 적어도 하나를 포함하는 주행 동작을 제어할 수 있다. 또한, 프로세서는, 판단된 차량의 위험 상황의 위험도가 미리 정해진 임계치에 대응하는 경우, 운전자 에 의한 주행 동작의 제어를 차단할 수 있다. 또한, 프로세서는, 상태 데이터에 기초하여 판단된 차량의 위험 상황과, 위험 상황을 방지하기 위해 결 정된 주행 가이드 정보를 학습함에 따라, 적어도 하나의 데이터 인식 모델을 업데이트할 수 있다. 또한, 프로세서는, 근접한 시점에 감지된 복수의 상태를 조합한 상태 데이터에 기초하여 판단된 차량의 위험 상황을 학습함에 따라, 적어도 하나의 데이터 인식 모델을 업데이트할 수 있다. 도 16은 다른 실시예에 따른 전자 장치의 블록 구성도(block diagram)이다. 전자 장치는 센싱부, 프로세서, 출력부, 저장부, 입력부, 및 통신부를 포 함할 수 있다. 센싱부는 차량이 위치해 있는 주변 환경에 관한 정보를 감지하도록 구성되는 다수의 센서들을 포함할 수 있고, 센서들의 위치 및/또는 배향을 수정하도록 구성되는 하나 이상의 액추에이터들을 포함할 수 있다. 예 를 들어, 센싱부는 GPS(Global Positioning System), IMU(Inertial Measurement Unit), RADAR 센서, LIDAR 센서, 이미지 센서 및 Odometery 센서를 포함할 수 있다. 또한, 센싱부(11 0)는 온/습도 센서, 적외선 센서, 기압 센서, 근접 센서, 및 RGB 센서(illuminance sensor) 중 적어도 하나를 포함할 수 있으나, 이에 한정되는 것은 아니다. 각 센서들의 기능은 그 명칭으 로부터 당업자가 직관적으로 추론할 수 있으므로, 구체적인 설명은 생략하기로 한다.또한, 센싱부는 차량의 움직임을 센싱할 수 있는 움직임 센싱부를 포함할 수 있다. 움직임 센싱부 는 지자기 센서(Magnetic sensor), 가속도 센서(Acceleration sensor), 및 자이로스코프 센서 를 포함할 수 있다. GPS는 차량의 지리적 위치를 추정하도록 구성되는 센서일 수 있다. 즉, GPS는 지구에 대한 차량 의 위치를 추정하도록 구성되는 송수신기를 포함할 수 있다. IMU는 관성 가속도에 기초하여 차량의 위치 및 배향 변화들을 감지하도록 구성되는 센서들의 조합이 될 수 있다. 예를 들어, 센서들의 조합은, 가속도계들 및 자이로스코프들을 포함할 수 있다. RADAR 센서는 무선 신호를 사용하여 차량이 위치해 있는 환경 내의 물체들을 감지하도록 구성되는 센서 일 수 있다. 또한, RADAR 센서는, 물체들의 속도 및/또는 방향을 감지하도록 구성될 수 있다. LIDAR 센서는 레이저를 사용하여 차량이 위치해 있는 환경 내의 물체들을 감지하도록 구성되는 센서일 수 잇다. 보다 구체적으로, LIDAR 센서는 레이저를 방출하도록 구성되는 레이저 광원 및/또는 레이저 스캐 너와, 레이저의 반사를 검출하도록 구성되는 검출기를 포함할 수 잇다. LIDAR 센서는 코히런트(coherent) (예컨대, 헤티로다인 검출을 사용함) 또는 비코히런트(incoherent) 검출 모드에서 동작하도록 구성될 수 있다. 이미지 센서는 차량 외부의 환경을 기록하도록 구성되는 스틸 카메라 또는 비디오 카메라가 될 수 있다. 예를 들어, 이미지 센서는 다수의 카메라들을 포함할 수 있고, 다수의 카메라들은 차량의 내부 및 외부 상의 다수의 위치들에 배치될 수 있다. Odometery 센서는 차량의 위치를 추정하고, 이동 거리를 측정할 수 있다. 예를 들어, Odometery 센서 는 차량의 바퀴의 회전 수를 이용하여 차량의 위치 변화 값을 측정할 수 있다. 저장부는 마그네틱 디스크 드라이브, 광학 디스크 드라이브, 플래쉬 메모리를 포함할 수 있다. 또는 저장 부는 휴대 가능한 USB 데이터 저장 장치가 될 수 있다. 저장부는 본원과 관련되는 예들을 실행하기 위한 시스템 소프트웨어를 저장할 수 있다. 본원과 관련되는 예들을 실행하기 위한 시스템 소프트웨어는 휴대 가능한 저장 매체에 저장될 수 있다. 통신부는 다른 디바이스와 무선으로 통신하기 위한 적어도 하나의 안테나를 포함할 수 있다. 예를 들어, 통신부는 와이파이 또는 블루투스를 통해 무선으로 셀룰러 네트워크 또는 다른 무선 프로토콜 및 시스템과 통신하기 위해 이용될 수 있다. 프로세서에 의해 제어되는 통신부는 무선 신호를 송수신할 수 있다. 예를 들어, 프로세서는, 통신부가 셀룰러 네트워크와 무선 신호를 송수신하기 위해, 저장부에 포함된 프로그램을 실행시킬 수 있다. 입력부는 차량을 제어하기 위한 데이터를 입력하는 수단을 의미한다. 예를 들어, 입력부에는 키 패드(key pad), 돔 스위치 (dome switch), 터치 패드(접촉식 정전 용량 방식, 압력식 저항막 방식, 적외선 감지 방식, 표면 초음파 전도 방식, 적분식 장력 측정 방식, 피에조 효과 방식 등), 조그 휠, 조그 스위치 등이 있을 수 있으나 이에 한정되는 것은 아니다. 또한, 입력부는 마이크를 포함할 수 있는 바, 마이크는 차량의 탑승자로부터 오디오(예를 들어, 음성 명령)를 수신하도록 구성될 수 있다. 출력부는 오디오 신호 또는 비디오 신호를 출력할 수 있으며, 출력 장치는 디스플레이, 및 음향 출력부를 포함할 수 있다. 디스플레이는 액정 디스플레이(liquid crystal display), 박막 트랜지스터 액정 디스플레이(thin film transistor-liquid crystal display), 유기 발광 다이오드(organic light-emitting diode), 플렉시블 디스플레 이(flexible display), 3차원 디스플레이(3D display), 전기영동 디스플레이(electrophoretic display) 중에서 적어도 하나를 포함할 수 있다. 출력부의 구현 형태에 따라, 출력부는 디스플레이를 2개 이상 포함할 수도 있다. 음향 출력부는 통신부로부터 수신되거나 저장부에 저장된 오디오 데이터를 출력한다. 또한, 음 향 출력부에는 스피커(speaker), 버저(Buzzer) 등이 포함될 수 있다. 입력부 및 출력부는 네트워크 인터페이스를 포함할 수 있고, 터치 스크린으로 구현될 수 있다. 프로세서는, 저장부에 저장된 프로그램들을 실행함으로써, 센싱부, 통신부, 입력부, 저장부, 및 출력부를 전반적으로 제어할 수 있다.도 17은 일 실시예에 따른 차량의 블록 구성도(block diagram)이다. 차량은 일 실시 예에 따라, 전자 장치 및 주행 장치를 포함할 수 있다. 도 17에 도시된 차량은 본 실시 예와 관련된 구성요소들만이 도시되어 있다. 따라서, 도 17에 도시된 구성요소들 외에 다른 범용적인"}
{"patent_id": "10-2017-0135233", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "구성요소들이 더 포함될 수 있음을 본 실시 예와 관련된 기술분야에서 통상의 지식을 가진 자라면 이해할 수 있 다. 전자 장치는 센싱부 및 프로세서를 포함할 수 있다. 센싱부와 프로세서에 대한 설명은 도 15, 도 16에서 상술하였으므로, 생략하기로 한다. 주행 장치는 브레이크 유닛, 조향 유닛 및 스로틀을 포함할 수 있다. 조향 유닛은 차량의 방향을 조절하도록 구성되는 매커니즘들의 조합이 될 수 있다. 스로틀은 엔진/모터의 동작 속도를 제어하여, 차량의 속도를 제어하도록 구성되는 매커니즘들의 조합이 될 수 있다. 또한, 스로틀은 스로틀 개방량을 조절하여 엔진/모터로 유입되는 연료공기의 혼 합 가스 양을 조절할 수 있으며, 스로틀 개방량을 조절하여 동력 및 추력을 제어할 수 있다. 브레이크 유닛은 차량을 감속시키도록 구성되는 매커니즘들의 조합이 될 수 있다. 예를 들어, 브레이크 유닛은 휠/타이어의 속도를 줄이기 위해 마찰을 사용할 수 있다. 도 18은 일 실시예에 따른 프로세서의 블록도이다. 도 18은 일부 실시예에 따른 프로세서의 블록도이다. 도 18을 참조하면, 일부 실시예에 따른 프로세서는 데이터 학습부 및 데이터 인식부를 포함할 수 있다. 데이터 학습부는 상황 판단을 위한 기준을 학습할 수 있다. 데이터 학습부는 소정의 상황을 판단하 기 위하여 어떤 데이터를 이용할 지, 데이터를 이용하여 상황을 어떻게 판단할 지에 관한 기준을 학습할 수 있 다. 데이터 학습부는 학습에 이용될 데이터를 획득하고, 획득된 데이터를 후술할 데이터 인식 모델에 적 용함으로써, 상황 판단을 위한 기준을 학습할 수 있다. 데이터 인식부는 데이터에 기초한 상황을 판단할 수 있다. 데이터 인식부는 학습된 데이터 인식 모 델을 이용하여, 소정의 데이터로부터 상황을 인식할 수 있다. 데이터 인식부는 학습에 의한 기 설정된 기 준에 따라 소정의 데이터를 획득하고, 획득된 데이터를 입력 값으로 하여 데이터 인식 모델을 이용함으로써, 소 정의 데이터에 기초한 소정의 상황을 판단할 수 있다. 또한, 획득된 데이터를 입력 값으로 하여 데이터 인식 모 델에 의해 출력된 결과 값은, 데이터 인식 모델을 갱신하는데 이용될 수 있다. 데이터 학습부 및 데이터 인식부 중 적어도 하나는, 적어도 하나의 하드웨어 칩 형태로 제작되어 전자 장치에 탑재될 수 있다. 예를 들어, 데이터 학습부 및 데이터 인식부 중 적어도 하나는 인공 지능(AI; artificial intelligence)을 위한 전용 하드웨어 칩 형태로 제작될 수도 있고, 또는 기존의 범용 프로 세서(예: CPU 또는 application processor) 또는 그래픽 전용 프로세서(예: GPU)의 일부로 제작되어 전술한 각 종 전자 장치에 탑재될 수도 있다. 이 경우, 데이터 학습부 및 데이터 인식부는 하나의 전자 장치에 탑재될 수도 있으며, 또는 별개의 전자 장치들에 각각 탑재될 수도 있다. 예를 들어, 데이터 학습부 및 데이터 인식부 중 하나는 전 자 장치에 포함되고, 나머지 하나는 서버에 포함될 수 있다. 또한, 데이터 학습부 및 데이터 인식부 는 유선 또는 무선으로 통하여, 데이터 학습부가 구축한 모델 정보를 데이터 인식부로 제공 할 수도 있고, 데이터 인식부로 입력된 데이터가 추가 학습 데이터로서 데이터 학습부로 제공될 수 도 있다. 한편, 데이터 학습부 및 데이터 인식부 중 적어도 하나는 소프트웨어 모듈로 구현될 수 있다. 데이 터 학습부 및 데이터 인식부 중 적어도 하나가 소프트웨어 모듈(또는, 인스터력션(instruction) 포 함하는 프로그램 모듈)로 구현되는 경우, 소프트웨어 모듈은 컴퓨터로 읽을 수 있는 판독 가능한 비일시적 판독 가능 기록매체(non-transitory computer readable media)에 저장될 수 있다. 또한, 이 경우, 적어도 하나의 소 프트웨어 모듈은 OS(Operating System)에 의해 제공되거나, 소정의 애플리케이션에 의해 제공될 수 있다. 또는, 적어도 하나의 소프트웨어 모듈 중 일부는 OS(Operating System)에 의해 제공되고, 나머지 일부는 소정의 애플리케이션에 의해 제공될 수 있다. 도 19는 일 실시예에 따른 데이터 학습부의 블록도이다. 도 19는 일부 실시예에 따른 데이터 학습부의 블록도이다. 도 19를 참조하면, 일부 실시예에 따른 데이터 학습부는 데이터 획득부(1310-1), 및 모델 학습부(1310- 4)를 포함할 수 있다. 또한, 데이터 학습부는 전처리부(1310-2), 학습 데이터 선택부(1310-3), 및 모델 평가부(1310-5) 중 적어도 하나를 선택적으로 포함할 수 있다. 데이터 획득부(1310-1)는 상황 판단에 필요한 데이터를 획득할 수 있다. 데이터 획득부(1310-1)는 상황 판단을 위한 학습을 위하여 필요한 데이터를 획득할 수 있다. 일 실시 예에 따라, 데이터 획득부(1310-1)는 위험 상황 판단을 위해 필요한 차량의 주행 상태, 운전자의 상태, 다른 차량의 주행 상태, 다른 차량의 상태 정보, 및 주변 환경 정보 등을 감지함에 따라 상태 데이터를 획득할 수 있다. 또한, 데이터 획득부(1310-1)는 서버로부터 상태 데이터를 수신할 수도 있다. 일 실시예에 따르면, 차량의 주행 상태, 및 운전자의 상태는 사용자가 주행하고 있는 차의 정보를 의미할 수 있 다. 한편, 다른 차량의 주행 상태, 다른 차량의 상태 정보는 사용자가 주행하고 있는 차 이외의 차량에 대한 정 보를 의미할 수 있다. 예를 들어, 데이터 획득부(1310-1)는 차량의 주변 영상을 입력 받을 수 있다. 주변 영상은 복수의 이미지(또 는, 프레임(frame))들로 구성될 수 있다. 일 예로, 데이터 획득부(1310-1)는 데이터 학습부를 포함하는 전자 장치의 카메라, 또는 데이터 학습부를 포함하는 전자 장치와 통신 가능한 외부의 카메라(예로, CCTV 또는 블랙박스 등)를 통하여 동영상을 입력 받을 수 있다. 여기서, 카메라는 하나 이상의 이미지 센서(예: 전면 센서 또는 후면 센서), 렌즈, 이미지 시그널 프로세서(ISP), 또는 플래시(예: LED 또는 xenon lamp 등)를 포함 할 수 있다. 또한, 예컨대, 데이터 획득부(1310-1)는 다른 차량의 주행 상태, 차량 정보 등을 획득할 수 있다. 일 예로, 데 이터 획득부(1310-1)는 전자 장치의 입력 기기(예: 마이크로폰, 카메라 또는 센서 등)를 통해 데이터를 입력 받 을 수 있다. 또는, 데이터 획득부(1310-1)는 전자 장치와 통신하는 외부 장치를 통해 데이터를 획득할 수 있다. 모델 학습부(1310-4)는 데이터 인식 모델이 학습 데이터에 기초하여 상황을 어떻게 판단할 지에 관한 판단 기준 을 갖도록 학습할 수 있다. 또한, 모델 학습부(1310-4)는 데이터 인식 모델이 상황 판단을 위하여 어떤 학습 데이터를 이용해야 하는 지에 대한 선별 기준을 갖도록 학습할 수도 있다. 일 실시 예에 따라, 모델 학습부(1310-4)는 데이터 인식 모델이 차량의 주행 상태, 운전자의 상태, 및 주변 환 경 정보를 포함하는 차량의 주행과 관련된 정보와, 차량의 외부에 위치한 다른 차량의 주행 상태, 및 다른 차량 의 차량 정보를 포함하는 다른 차량의 주행과 관련된 정보 등을 포함하는 상태 데이터에 기초하여, 어떤 위험 상황(예: 위험 상황 여부 및/또는 위험도 레벨)을 판단할지에 관한 판단 기준을 갖도록 학습할 수 있다. 또한, 모델 학숩부(1310-4)는 판단한 위험 상황에 기초하여 어떤 주행 가이드 정보(예: 안내 정보 출력, 급정거, 방향 전환 등)를 제공할지에 관한 판단 기준을 갖도록 학습할 수 있다. 차량의 주행 상태는, 예를 들면, 주행 속도, 주행 가속도, 주행 방향, 급정거, 급가속 등을 포함할 수 있다. 운 전자의 상태는, 예를 들면, 얼굴 표정, 시선, 행동 등을 포함할 수 있다. 다른 차량의 주행 상태는, 예를 들면, 주행 속도, 주행 가속도, 주행 방향, 방향 전환 의도, 급정거, 급가속 등을 포함할 수 있다. 다른 차량의 상태 차량 정보는, 예를 들면, 차종, 연식, 잠재 사고율, 무게, 보험 이력 등을 포함할 수 있다. 주변 환경 정보는, 예를 들면, 도로의 차선 형태, 기상 상태, 노면 상태, 사고 다발 구간, 공사 구간, 보행자, 장애물 등을 포함할 수 있다. 또한, 모델 학습부(1310-4)는 상황 판단에 이용되는 데이터 인식 모델을 학습 데이터를 이용하여 학습시킬 수 있다. 이 경우, 데이터 인식 모델은 미리 구축된 모델일 수 있다. 예를 들어, 데이터 인식 모델은 기본 학습 데 이터(예를 들어, 샘플 이미지 등)을 입력 받아 미리 구축된 모델일 수 있다. 데이터 학습부는 데이터 인식 모델의 인식 결과를 향상시키거나, 데이터 인식 모델의 생성에 필요한 자원 또는 시간을 절약하기 위하여 전처리부(1310-2), 학습 데이터 선택부(1310-3), 및 모델 평가부 (1310-5)를 더 포함할 수 있다. 전처리부(1310-2)는 상황 판단을 위한 학습에 획득된 데이터가 이용될 수 있도록, 획득된 데이터를 전처리할 수 있다. 전처리부(1310-2)는 후술할 모델 학습부(1310-4)가 상황 판단을 위한 학습을 위하여 획득된 데이터를 이 용할 수 있도록, 획득된 데이터를 기 설정된 포맷으로 가공할 수 있다. 예를 들어, 전처리부(1310-2)는 입력된 동영상의 적어도 일부를 구성하는 복수의 이미지(또는 프레임(frame))들 각각에 포함된 공통 영역을 기초로, 복 수의 이미지들의 적어도 일부를 중첩하여 하나의 합성 이미지를 생성할 수 있다. 이 경우, 하나의 동영상에서 복수 개의 합성 이미지들이 생성될 수도 있다. 공통 영역은, 복수의 이미지들 각각에서 동일 또는 유사한 공통 오브젝트(예로, 물체, 동식물 또는 사람 등)를 포함한 영역이 될 수 있다. 또는, 공통 영역은, 복수의 이미지들 각각에서 색, 음영, RGB 값 또는 CMYK 값 등이 동일 또는 유사한 영역이 될 수 있다. 학습 데이터 선택부(1310-3)는 전처리된 데이터 중에서 학습에 필요한 데이터를 선택할 수 있다. 선택된 데이터 는 모델 학습부(1310-4)에 제공될 수 있다. 학습 데이터 선택부(1310-3)는 상황 판단을 위한 기 설정된 기준에 따라, 전처리된 데이터 중에서 학습에 필요한 데이터를 선택할 수 있다. 또한, 학습 데이터 선택부(1310-3)는 후술할 모델 학습부(1310-4)에 의한 학습에 의해 기 설정된 기준에 따라 데이터를 선택할 수도 있다. 예를 들어, 차량의 주행 경로 상에 영향을 미칠 수 있는 다른 차량, 장애물, 보행자 등에 관한 데이터가 선 택될 수 있다. 또한, 예를 들어, 차량을 운전 중인 운전자가 운전 이외의 행동을 하는 영상에 관한 데이터가 선택될 수 있다. 모델 평가부(1310-5)는 데이터 인식 모델에 평가 데이터를 입력하고, 평가 데이터로부터 출력되는 인식 결과가 소정 기준을 만족하지 못하는 경우, 모델 학습부(1310-4)로 하여금 다시 학습하도록 할 수 있다. 이 경우, 평가 데이터는 데이터 인식 모델을 평가하기 위한 기 설정된 데이터일 수 있다. 예를 들어, 모델 평가부(1310-5)는 평가 데이터에 대한 학습된 데이터 인식 모델의 인식 결과 중에서, 인식 결 과가 정확하지 않은 평가 데이터의 개수 또는 비율이 미리 설정된 임계치를 초과하는 경우 소정 기준을 만족하 지 못한 것으로 평가할 수 있다. 예컨대, 소정 기준이 비율 2%로 정의되는 경우, 학습된 데이터 인식 모델이 총 1000개의 평가 데이터 중의 20개를 초과하는 평가 데이터에 대하여 잘못된 인식 결과를 출력하는 경우, 모델 평 가부(1310-5)는 학습된 데이터 인식 모델이 적합하지 않은 것으로 평가할 수 있다. 한편, 학습된 데이터 인식 모델이 복수 개가 존재하는 경우, 모델 평가부(1310-5)는 각각의 학습된 동영상 인식 모델에 대하여 소정 기준을 만족하는지를 평가하고, 소정 기준을 만족하는 모델을 최종 데이터 인식 모델로서 결정할 수 있다. 이 경우, 소정 기준을 만족하는 모델이 복수 개인 경우, 모델 평가부(1310-5)는 평가 점수가 높은 순으로 미리 설정된 어느 하나 또는 소정 개수의 모델을 최종 데이터 인식 모델로서 결정할 수 있다. 데이터 인식 모델은, 인식 모델의 적용 분야, 학습의 목적 또는 장치의 컴퓨터 성능 등을 고려하여 구축될 수 있다. 데이터 인식 모델은, 예를 들어, 신경망(Neural Network)을 기반으로 하는 모델일 수 있다. 예컨대, DNN(Deep Neural Network), RNN(Recurrent Neural Network), BRDNN(Bidirectional Recurrent Deep Neural Network)과 같은 모델이 데이터 인식 모델로서 사용될 수 있으나, 이에 한정되지 않는다. 다양한 실시예에 따르면, 모델 학습부(1310-4)는 미리 구축된 데이터 인식 모델이 복수 개가 존재하는 경우, 입 력된 학습 데이터와 기본 학습 데이터의 관련성이 큰 데이터 인식 모델을 학습할 데이터 인식 모델로 결정할 수 있다. 이 경우, 기본 학습 데이터는 데이터의 타입 별로 기 분류되어 있을 수 있으며, 데이터 인식 모델은 데이 터의 타입 별로 미리 구축되어 있을 수 있다. 예를 들어, 기본 학습 데이터는 학습 데이터가 생성된 지역, 학습 데이터가 생성된 시간, 학습 데이터의 크기, 학습 데이터의 장르, 학습 데이터의 생성자, 학습 데이터 내의 오 브젝트의 종류 등과 같은 다양한 기준으로 기 분류되어 있을 수 있다. 또한, 모델 학습부(1310-4)는, 예를 들어, 오류 역전파법(error back-propagation) 또는 경사 하강법(gradient descent)을 포함하는 학습 알고리즘 등을 이용하여 데이터 인식 모델을 학습시킬 수 있다. 또한, 모델 학습부(1310-4)는, 예를 들어, 학습 데이터를 입력 값으로 하는 지도 학습(supervised learning)을 통하여, 데이터 인식 모델을 학습시킬 수 있다. 또한, 모델 학습부(1310-4)는, 예를 들어, 별다른 지도 없이 상 황 판단을 위해 필요한 데이터의 종류를 스스로 학습함으로써, 상황 판단을 위한 기준을 발견하는 비지도 학습 (unsupervised learning)을 통하여, 데이터 인식 모델을 학습시킬 수 있다. 또한, 모델 학습부(1310-4)는, 예 를 들어, 학습에 따른 상황 판단의 결과가 올바른 지에 대한 피드백을 이용하는 강화 학습(reinforcement learning)을 통하여, 데이터 인식 모델을 학습시킬 수 있다. 또한, 데이터 인식 모델이 학습되면, 모델 학습부(1310-4)는 학습된 데이터 인식 모델을 저장할 수 있다. 이 경 우, 모델 학습부(1310-4)는 학습된 데이터 인식 모델을 데이터 인식부를 포함하는 전자 장치의 메모리에 저장할 수 있다. 또는, 모델 학습부(1310-4)는 학습된 데이터 인식 모델을 후술할 데이터 인식부를 포함하는 전자 장치의 메모리에 저장할 수 있다. 또는, 모델 학습부(1310-4)는 학습된 데이터 인식 모델을 전자 장 치와 유선 또는 무선 네트워크로 연결되는 서버의 메모리에 저장할 수도 있다. 이 경우, 학습된 데이터 인식 모델이 저장되는 메모리는, 예를 들면, 전자 장치의 적어도 하나의 다른 구성요소 에 관계된 명령 또는 데이터를 함께 저장할 수도 있다. 또한, 메모리는 소프트웨어 및/또는 프로그램을 저장할 수도 있다. 프로그램은, 예를 들면, 커널, 미들웨어, 어플리케이션 프로그래밍 인터페이스(API) 및/또는 어플리 케이션 프로그램(또는 \"어플리케이션\") 등을 포함할 수 있다. 한편, 데이터 학습부 내의 데이터 획득부(1310-1), 전처리부(1310-2), 학습 데이터 선택부(1310-3), 모델 학습부(1310-4) 및 모델 평가부(1310-5) 중 적어도 하나는, 적어도 하나의 하드웨어 칩 형태로 제작되어 전자 장치에 탑재될 수 있다. 예를 들어, 데이터 획득부(1310-1), 전처리부(1310-2), 학습 데이터 선택부(1310-3), 모델 학습부(1310-4) 및 모델 평가부(1310-5) 중 적어도 하나는 인공 지능(AI; artificial intelligence)을 위 한 전용 하드웨어 칩 형태로 제작될 수도 있고, 또는 기존의 범용 프로세서(예: CPU 또는 application processor) 또는 그래픽 전용 프로세서(예: GPU)의 일부로 제작되어 전술한 각종 전자 장치에 탑재될 수도 있다. 또한, 데이터 획득부(1310-1), 전처리부(1310-2), 학습 데이터 선택부(1310-3), 모델 학습부(1310-4) 및 모델 평가부(1310-5)는 하나의 전자 장치에 탑재될 수도 있으며, 또는 별개의 전자 장치들에 각각 탑재될 수도 있다. 예를 들어, 데이터 획득부(1310-1), 전처리부(1310-2), 학습 데이터 선택부(1310-3), 모델 학습부(1310-4) 및 모델 평가부(1310-5) 중 일부는 전자 장치에 포함되고, 나머지 일부는 서버에 포함될 수 있다. 또한, 데이터 획득부(1310-1), 전처리부(1310-2), 학습 데이터 선택부(1310-3), 모델 학습부(1310-4) 및 모델 평가부(1310-5) 중 적어도 하나는 소프트웨어 모듈로 구현될 수 있다. 데이터 획득부(1310-1), 전처리부(1310- 2), 학습 데이터 선택부(1310-3), 모델 학습부(1310-4) 및 모델 평가부(1310-5) 중 적어도 하나가 소프트웨어 모듈(또는, 인스터력션(instruction) 포함하는 프로그램 모듈)로 구현되는 경우, 소프트웨어 모듈은 컴퓨터로 읽을 수 있는 판독 가능한 비일시적 판독 가능 기록매체(non-transitory computer readable media)에 저장될 수 있다. 또한, 이 경우, 적어도 하나의 소프트웨어 모듈은 OS(Operating System)에 의해 제공되거나, 소정의 애플리케이션에 의해 제공될 수 있다. 또는, 적어도 하나의 소프트웨어 모듈 중 일부는 OS(Operating System)에 의해 제공되고, 나머지 일부는 소정의 애플리케이션에 의해 제공될 수 있다. 도 20은 일 실시예에 따른 데이터 인식부의 블록도이다. 도 20은 일부 실시예에 따른 데이터 인식부의 블록도이다. 도 20을 참조하면, 일부 실시예에 따른 데이터 인식부는 데이터 획득부(1320-1), 및 인식 결과 제공부 (1320-4)를 포함할 수 있다. 또한, 데이터 인식부는 전처리부(1320-2), 인식 데이터 선택부(1320-3), 및 모델 갱신부(1320-5) 증 적어도 하나를 선택적으로 더 포함할 수 있다. 데이터 획득부(1320-1)는 상황 판단에 필요한 데이터를 획득할 수 있다. 인식 결과 제공부(1320-4)는 선택된 데이터를 데이터 인식 모델에 적용하여 상황을 판단할 수 있다. 인식 결과 제공부(1320-4)는 데이터의 인식 목적에 따른 인식 결과를 제공할 수 있다. 인식 결과 제공부(1320-4)는 인식 데이터 선택부(1320-3)에 의해 선택된 데이터를 입력 값으로 이용함으로써, 선택된 데이터를 데이터 인식 모델 에 적용할 수 있다. 또한, 인식 결과는 데이터 인식 모델에 의해 결정될 수 있다. 일 실시예에 따르면, 인식 결과 제공부(1320-4)는 차량의 주행 상태, 운전자의 상태, 다른 차량의 주행 상태, 다른 차량의 차량 정보, 및 주변 환경 정보 등을 포함하는 상태 데이터를 입력 값으로 하여 위험 상황(예: 위험 상황 여부 및/또는 위험도 레벨)을 추정할 수 있다. 또한, 인식 결과 제공부(1320-4)는 추정된 위험 상황을 입력값으로 하여 주행 가이드 정보를 제공할 수 있다. 일 실시 예에 따라, 인식된 차량의 위험 상황에 따른 주행 가이드 정보는, 텍스트, 음성, 동영상, 이미지 또 는 명령어(예로, 어플리케이션 실행 명령어, 모듈 기능 실행 명령어 등) 등으로 제공될 수 있다. 인식 결과 제 공부(1320-4)는 차량의 위험 상황에 따른 주행 가이드 정보로서, '충돌 위험', '중앙선 침범 위험' 등을 텍 스트, 음성, 동영상, 이미지 등으로 제공할 수 있다. 다양한 실시예에 따르면, 인식 결과 제공부(1320-4)는 추정된 차량의 위험 상황에 맞추어 차량을 제어하는 신호(예: 급정거, 방향 전환 등)를 생성할 수 있다. 데이터 인식부는 데이터 인식 모델의 인식 결과를 향상시키거나, 인식 결과의 제공을 위한 자원 또는 시 간을 절약하기 위하여, 전처리부(1310-2), 학습 데이터 선택부(1310-3), 및 모델 평가부(1310-5)를 더 포함할 수 있다. 전처리부(1320-2)는 상황 판단을 위해 획득된 데이터가 이용될 수 있도록, 획득된 데이터를 전처리할 수 있다. 전처리부(1320-2)는 후술할 인식 결과 제공부(1320-4)가 상황 판단을 위하여 획득된 데이터를 이용할 수 있도록, 획득된 데이터를 기 설정된 포맷으로 가공할 수 있다. 인식 데이터 선택부(1320-3)는 전처리된 데이터 중에서 상황 판단에 필요한 데이터를 선택할 수 있다. 선택된 데이터는 인식 결과 제공부(1320-4)에게 제공될 수 있다. 인식 데이터 선택부(1320-3)는 상황 판단을 위한 기 설정된 기준에 따라, 전처리된 데이터 중에서 일부 또는 전부를 선택할 수 있다. 또한, 인식 데이터 선택부 (1320-3)는 후술할 모델 학습부(1310-4)에 의한 학습에 의해 기 설정된 기준에 따라 데이터를 선택할 수도 있다. 모델 갱신부(1320-5)는 인식 결과 제공부(1320-4)에 의해 제공되는 인식 결과에 대한 평가에 기초하여, 데이터 인식 모델이 갱신되도록 할 수 있다. 예를 들어, 모델 갱신부(1320-5)는 인식 결과 제공부(1320-4)에 의해 제공 되는 인식 결과를 모델 학습부(1310-4)에게 제공함으로써, 모델 학습부(1310-4)가 데이터 인식 모델을 갱신하도 록 할 수 있다. 한편, 데이터 인식부 내의 데이터 획득부(1320-1), 전처리부(1320-2), 인식 데이터 선택부(1320-3), 인식 결과 제공부(1320-4) 및 모델 갱신부(1320-5) 중 적어도 하나는, 적어도 하나의 하드웨어 칩 형태로 제작되어 전자 장치에 탑재될 수 있다. 예를 들어, 데이터 획득부(1320-1), 전처리부(1320-2), 인식 데이터 선택부(1320- 3), 인식 결과 제공부(1320-4) 및 모델 갱신부(1320-5) 중 적어도 하나는 인공 지능(AI; artificial intelligence)을 위한 전용 하드웨어 칩 형태로 제작될 수도 있고, 또는 기존의 범용 프로세서(예: CPU 또는 application processor) 또는 그래픽 전용 프로세서(예: GPU)의 일부로 제작되어 전술한 각종 전자 장치에 탑재 될 수도 있다. 또한, 데이터 획득부(1320-1), 전처리부(1320-2), 인식 데이터 선택부(1320-3), 인식 결과 제공부(1320-4) 및 모델 갱신부(1320-5)는 하나의 전자 장치에 탑재될 수도 있으며, 또는 별개의 전자 장치들에 각각 탑재될 수도 있다. 예를 들어, 데이터 획득부(1320-1), 전처리부(1320-2), 인식 데이터 선택부(1320-3), 인식 결과 제공부 (1320-4) 및 모델 갱신부(1320-5) 중 일부는 전자 장치에 포함되고, 나머지 일부는 서버에 포함될 수 있다. 또한, 데이터 획득부(1320-1), 전처리부(1320-2), 인식 데이터 선택부(1320-3), 인식 결과 제공부(1320-4) 및 모델 갱신부(1320-5) 중 적어도 하나는 소프트웨어 모듈로 구현될 수 있다. 데이터 획득부(1320-1), 전처리부 (1320-2), 인식 데이터 선택부(1320-3), 인식 결과 제공부(1320-4) 및 모델 갱신부(1320-5) 중 적어도 하나가 소프트웨어 모듈(또는, 인스터력션(instruction) 포함하는 프로그램 모듈)로 구현되는 경우, 소프트웨어 모듈은 컴퓨터로 읽을 수 있는 판독 가능한 비일시적 판독 가능 기록매체(non-transitory computer readable media)에 저장될 수 있다. 또한, 이 경우, 적어도 하나의 소프트웨어 모듈은 OS(Operating System)에 의해 제공되거나, 소정의 애플리케이션에 의해 제공될 수 있다. 또는, 적어도 하나의 소프트웨어 모듈 중 일부는 OS(Operating System)에 의해 제공되고, 나머지 일부는 소정의 애플리케이션에 의해 제공될 수 있다. 도 21은 일 실시예에 따른 전자 장치 및 서버가 서로 연동함으로써 데이터를 학습하고 인식하는 예시를 나타내 는 도면이다. 도 21은 일부 실시 예에 따른 전자 장치 및 서버가 서로 연동함으로써 데이터를 학습하고 인식하는 예시를 나타내는 도면이다. 도 21을 참조하면, 서버는 상황 판단을 위한 기준을 학습할 수 있으며, 디바이스는 서버에 의한 학습 결과에 기초하여 상황을 판단할 수 있다. 이 경우, 서버의 모델 학습부는 도 19에 도시된 데이터 학습부의 기능을 수행할 수 있다. 서 버의 모델 학습부는 데이터 인식 모델이 소정의 상황을 판단하기 위하여 어떤 데이터를 이용할 지, 데이터를 이용하여 상황을 어떻게 판단할 지에 관한 기준을 갖도록 학습할 수 있다. 모델 학습부는 학습 에 이용될 데이터를 획득하고, 획득된 데이터를 후술할 데이터 인식 모델에 적용함으로써, 데이터 인식 모델이 상황 판단을 위한 판단 기준을 갖도록 학습할 수 있다. 또한, 전자 장치의 인식 결과 제공부(1320-4)는 인식 데이터 선택부(1320-3)에 의해 선택된 데이터를 서버 에 의해 생성된 데이터 인식 모델에 적용하여 상황을 판단할 수 있다. 예를 들어, 인식 결과 제공부 (1320-4)는 인식 데이터 선택부(1320-3)에 의해 선택된 데이터를 서버에게 전송하고, 서버가 인식 데이터 선택부(1320-3)에 의해 선택된 데이터를 인식 모델에 적용하여 상황을 판단할 것을 요청할 수 있다. 또 한, 인식 결과 제공부(1320-4)는 서버에 의해 판단된 상황에 관한 정보를 서버로부터 수신할 수 있 다. 예를 들어, 전자 장치는 차량의 주행 상태, 운전자의 상태, 주변 차량들의 주행 상태를 포함하는 상태 데이터를 서버에게 전송하고, 서버가 상태 데이터를 데이터 인식 모델에 적용하여 차량의 위험 상황을 판단할 것을 요청할 수 있다. 또한, 전자 장치는 서버에 의해 판단된 위험 상황에 관한 정보 를 서버로부터 수신할 수 있다. 또는, 전자 장치의 인식 결과 제공부(1320-4)는 서버에 의해 생성된 인식 모델을 서버로부터 수신하고, 수신된 인식 모델을 이용하여 상황을 판단할 수 있다. 이 경우, 전자 장치의 인식 결과 제공부 (1320-4)는 인식 데이터 선택부(1320-3)에 의해 선택된 데이터를 서버로부터 수신된 데이터 인식 모델에 적용하여 상황을 판단할 수 있다. 예를 들어, 전자 장치는 차량의 주행 상태, 운전자의 상태, 주변 차량들의 주행 상태를 포함하는 상태 데이터를, 서버로부터 수신된 데이터 인식 모델에 적용하여, 차량의 위험 상황을 판단할 수 있다. 상기 살펴 본 실시 예들에 따른 장치는 프로세서, 프로그램 데이터를 저장하고 실행하는 메모리, 디스크 드라이 브와 같은 영구 저장부(permanent storage), 외부 장치와 통신하는 통신 포트, 터치 패널, 키(key), 버튼 등과 같은 사용자 인터페이스 장치 등을 포함할 수 있다. 소프트웨어 모듈 또는 알고리즘으로 구현되는 방법들은 상 기 프로세서상에서 실행 가능한 컴퓨터가 읽을 수 있는 코드들 또는 프로그램 명령들로서 컴퓨터가 읽을 수 있 는 기록 매체 상에 저장될 수 있다. 여기서 컴퓨터가 읽을 수 있는 기록 매체로 마그네틱 저장 매체(예컨대, ROM(read-only memory), RAM(random-access memory), 플로피 디스크, 하드 디스크 등) 및 광학적 판독 매체(예 컨대, 시디롬(CD-ROM), 디브이디(DVD: Digital Versatile Disc)) 등이 있다. 컴퓨터가 읽을 수 있는 기록 매체 는 네트워크로 연결된 컴퓨터 시스템들에 분산되어, 분산 방식으로 컴퓨터가 판독 가능한 코드가 저장되고 실행 될 수 있다. 매체는 컴퓨터에 의해 판독가능하며, 메모리에 저장되고, 프로세서에서 실행될 수 있다. 개시된 실시예들은 컴퓨터로 읽을 수 있는 저장 매체(computer-readable storage media)에 저장된 명령어를 포 함하는 S/W 프로그램으로 구현될 수 있다. 컴퓨터는, 저장 매체로부터 저장된 명령어를 호출하고, 호출된 명령어에 따라 개시된 실시예에 따른 동작이 가 능한 장치로서, 개시된 실시예들에 따른 전자 장치를 포함할 수 있다. 컴퓨터로 읽을 수 있는 저장매체는, 비일시적(non-transitory) 저장매체의 형태로 제공될 수 있다. 여기서, '기 비일시적'은 저장매체가 신호(signal)를 포함하지 않으며 실재(tangible)한다는 것을 의미할 뿐 데이터가 저장 매체에 반영구적 또는 임시적으로 저장됨을 구분하지 않는다. 또한, 개시된 실시예들에 따른 제어 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공 될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있다. 컴퓨터 프로그램 제품은 S/W 프로그램, S/W 프로그램이 저장된 컴퓨터로 읽을 수 있는 저장 매체를 포함할 수 있다. 예를 들어, 컴퓨터 프로그램 제품은 전자 장치의 제조사 또는 전자 마켓(예, 구글 플레이 스토어, 앱 스 토어)을 통해 전자적으로 배포되는 S/W 프로그램 형태의 상품(예, 다운로더블 앱)을 포함할 수 있다. 전자적 배 포를 위하여, S/W 프로그램의 적어도 일부는 저장 매체에 저장되거나, 임시적으로 생성될 수 있다. 이 경우, 저 장 매체는 제조사의 서버, 전자 마켓의 서버, 또는 SW 프로그램을 임시적으로 저장하는 중계 서버의 저장매체가 될 수 있다. 컴퓨터 프로그램 제품은, 서버 및 전자 장치로 구성되는 시스템에서, 서버의 저장매체 또는 전자 장치의 저장매 체를 포함할 수 있다. 또는, 서버 또는 전자 장치와 통신 연결되는 제 3 장치(예, 스마트폰)가 존재하는 경우, 컴퓨터 프로그램 제품은 제 3 장치의 저장매체를 포함할 수 있다. 또는, 컴퓨터 프로그램 제품은 서버로부터 전 자 장치 또는 제 3 장치로 전송되거나, 제 3 장치로부터 전자 장치로 전송되는 S/W 프로그램 자체를 포함할 수 있다. 이 경우, 서버, 전자 장치 및 제 3 장치 중 하나가 컴퓨터 프로그램 제품을 실행하여 개시된 실시예들에 따른 방법을 수행할 수 있다. 또는, 서버, 전자 장치 및 제 3 장치 중 둘 이상이 컴퓨터 프로그램 제품을 실행하여개시된 실시예들에 따른 방법을 분산하여 실시할 수 있다. 예를 들면, 서버(예로, 클라우드 서버 또는 인공 지능 서버 등)가 서버에 저장된 컴퓨터 프로그램 제품을 실행 하여, 서버와 통신 연결된 전자 장치가 개시된 실시예들에 따른 방법을 수행하도록 제어할 수 있다. 또 다른 예로, 제 3 장치가 컴퓨터 프로그램 제품을 실행하여, 제 3 장치와 통신 연결된 전자 장치가 개시된 실 시예에 따른 방법을 수행하도록 제어할 수 있다. 제 3 장치가 컴퓨터 프로그램 제품을 실행하는 경우, 제 3 장 치는 서버로부터 컴퓨터 프로그램 제품을 다운로드하고, 다운로드 된 컴퓨터 프로그램 제품을 실행할 수 있다. 또는, 제 3 장치는 프리로드 된 상태로 제공된 컴퓨터 프로그램 제품을 실행하여 개시된 실시예들에 따른 방법 을 수행할 수도 있다. 본 실시 예는 기능적인 블록 구성들 및 다양한 처리 단계들로 나타내어질 수 있다. 이러한 기능 블록들은 특정 기능들을 실행하는 다양한 개수의 하드웨어 또는/및 소프트웨어 구성들로 구현될 수 있다. 예를 들어, 실시 예 는 하나 이상의 마이크로프로세서들의 제어 또는 다른 제어 장치들에 의해서 다양한 기능들을 실행할 수 있는, 메모리, 프로세싱, 로직(logic), 룩 업 테이블(look-up table) 등과 같은 직접 회로 구성들을 채용할 수 있다. 구성 요소들이 소프트웨어 프로그래밍 또는 소프트웨어 요소들로 실행될 수 있는 것과 유사하게, 본 실시 예는 데이터 구조, 프로세스들, 루틴들 또는 다른 프로그래밍 구성들의 조합으로 구현되는 다양한 알고리즘을 포함하 여, C, C++, 자바(Java), 어셈블러(assembler) 등과 같은 프로그래밍 또는 스크립팅 언어로 구현될 수 있다. 기 능적인 측면들은 하나 이상의 프로세서들에서 실행되는 알고리즘으로 구현될 수 있다. 또한, 본 실시 예는 전자 적인 환경 설정, 신호 처리, 및/또는 데이터 처리 등을 위하여 종래 기술을 채용할 수 있다. “매커니즘”, “ 요소”, “수단”, “구성”과 같은 용어는 넓게 사용될 수 있으며, 기계적이고 물리적인 구성들로서 한정되는 것은 아니다. 상기 용어는 프로세서 등과 연계하여 소프트웨어의 일련의 처리들(routines)의 의미를 포함할 수 있다."}
{"patent_id": "10-2017-0135233", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시 예에 따른 차량의 운전을 보조하는 전자 장치가 동작하는 일 예를 도시하는 도면이다. 도 2a는 일 실시 예에 따라 전자 장치의 동작 방법의 흐름도이다. 도 2b는 다양한 실시예에 따른 제 1 프로세서 및 제 2 프로세서가 차량의 위험 상황을 추정하는 상황을 설명하 기 위한 흐름도이다. 도 2c는 다양한 실시예에 따른 제 1 프로세서, 제 2 프로세서, 제 3 프로세서가 차량의 위험 상황을 추정하는 상황을 설명하기 위한 흐름도이다. 도 2d는 다양한 실시예에 따른 전자 장치 및 서버가 차량의 위험 상황을 추정하는 상황을 설명하기 위한 흐름도 이다. 도 3 내지 도 4는 일 실시 예에 따라 차량을 운전 중인 운전자의 상태를 설명하기 위한 도면이다. 도 5는 일 실시 예에 따른 차량의 주행 상태와 차량 주변의 다른 차량의 주행 상태를 설명하기 위한 도면이다. 도 6은 일 실시 예에 따른 차량 주변의 다른 차량들의 차량 정보를 설명하기 위한 도면이다 도 7은 일 실시 예에 따른 상태 데이터를 획득하는 방법을 설명하기 위한 도면이다. 도 8a는 일 실시 예에 따라 주행 가이드 정보를 결정하는 방법의 흐름도이다. 도 8b는 다양한 실시예에 따른 제 1 프로세서 및 제 2 프로세서가 차량의 위험 상황을 추정하고, 주행 가이드 정보를 선정하는 상황을 설명하기 위한 흐름도이다. 도 8c는 다양한 실시예에 따른 제 1 프로세서, 제 2 프로세서, 제 3 프로세서가 차량의 위험 상황을 추정하고, 주행 가이드 정보를 선정하는 상황을 설명하기 위한 흐름도이다. 도 8d는 다양한 실시예에 따른 전자 장치 및 서버가 차량의 위험 상황을 추정하고, 주행 가이드 정보를 선정하 는 상황을 설명하기 위한 흐름도이다. 도 9는 일 실시 예에 따라 주행 가이드 정보를 사용자에게 제공하는 일 예를 도시한다. 도 10은 일 실시 예에 따라 다른 차량의 위험도를 판단하는 방법의 흐름도이다. 도 11 내지 도 12는 일 실시 예에 따라 다른 차량의 위험도를 사용자에게 제공하는 일 예를 도시한다. 도 13a는 일 실시 예에 따라 전자 장치가 차량의 주행 동작을 제어하는 방법의 흐름도이다. 도 13b는 다양한 실시예에 따른 제 1 프로세서 및 제 2 프로세서가 차량의 주행 동작을 제어하는 상황을 설명하 기 위한 흐름도이다. 도 13c는 다양한 실시예에 따른 제 1 프로세서, 제 2 프로세서, 제 3 프로세서가 차량의 주행 동작을 제어하는 상황을 설명하기 위한 흐름도이다. 도 13d는 다양한 실시예에 따른 전자 장치 및 서버가 차량의 주행 동작을 제어하는 상황을 설명하기 위한 흐름 도이다. 도 14는 일 실시 예에 따라 전자 장치가 차량의 주행 동작을 제어하는 일 예를 도시한다. 도 15는 일 실시예에 따른 전자 장치의 블록 구성도(block diagram)이다. 도 16은 다른 실시예에 따른 전자 장치의 블록 구성도(block diagram)이다. 도 17은 일 실시예에 따른 차량의 블록 구성도(block diagram)이다. 도 18은 일 실시예에 따른 프로세서의 블록도이다. 도 19는 일 실시예에 따른 데이터 학습부의 블록도이다. 도 20은 일 실시예에 따른 데이터 인식부의 블록도이다. 도 21은 일 실시예에 따른 전자 장치 및 서버가 서로 연동함으로써 데이터를 학습하고 인식하는 예시를 나타내는 도면이다."}
