{"patent_id": "10-2023-0107548", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0026526", "출원번호": "10-2023-0107548", "발명의 명칭": "분자 구조 탐색 장치 및 방법", "출원인": "포스코홀딩스 주식회사", "발명자": "홍지숙"}}
{"patent_id": "10-2023-0107548", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "둘 이상의 원자들을 포함하는 임의의 분자 구조에 관한 데이터를 입력받는 입력부;상기 임의의 분자 구조에 관한 데이터 및 상기 임의의 분자의 상태량을 학습데이터로 사용하여 학습된 예측 모델을 사용하여 상기 입력된 임의의 분자 구조에 관한 데이터로부터 분자의 상태량을 예측하는 처리부;상기 처리부에서 상기 임의의 분자 구조에 대한 데이터로부터 예측한 상기 분자의 상태량이 임계값에 도달한 경우 탐색을 종료하고, 도달하지 못한 경우 새로운 임의의 분자 구조에 관한 데이터를 재탐색한 뒤 재탐색된 상기새로운 임의의 분자 구조에 관한 데이터를 상기 입력부로 보내는 탐색부; 및상기 분자의 상태량이 임계값에 도달하여 상기 탐색부에서 탐색이 종료된 경우 입력된 상기 임의의 분자 구조에대한 데이터를 출력하는 출력부;를 포함하는 분자 구조 탐색 장치."}
{"patent_id": "10-2023-0107548", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 분자의 상태량은 상기 임의의 분자 구조에서 분자의 총에너지 값을 포함하는 분자 구조 탐색 장치."}
{"patent_id": "10-2023-0107548", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 임의의 분자 구조에 관한 데이터는 상기 분자에 포함되는 원자들의 위치를 좌표 상에 표현한 좌표 값인 분자 구조 탐색 장치."}
{"patent_id": "10-2023-0107548", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 임의의 분자 구조에 대한 데이터는 상기 분자에 포함되는 원자들 중 적어도 하나인 중심 원자를 고정하고상기 중심 원자를 제외한 다른 원자의 위치를 변형하여 생성하는 분자 구조 탐색 장치."}
{"patent_id": "10-2023-0107548", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2항에 있어서,상기 처리부에서 상기 예측 모델의 학습은 상기 총에너지 값이 클수록 오차가 크도록 오차함수를 설정하고 경사하강법을 이용하여 매개변수 값을 결정하는 방식으로 이루어지는 분자 구조 탐색 장치."}
{"patent_id": "10-2023-0107548", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 예측 모델의 학습 과정에서 상기 오차함수에 제약사항을 반영한 오차함수가 더 추가되는 분자 구조 탐색장치.공개특허 10-2025-0026526-3-청구항 7 제2항에 있어서,상기 탐색부는 상기 학습된 예측 모델을 사용하여 상기 학습된 예측 모델에서 출력된 상기 분자의 총에너지 값이 최소값에 이르지 못한 경우 경사하강법을 이용하여 상기 새로운 임의의 분자 구조에 관한 데이터를 재탐색하고, 상기 분자의 총에너지 값이 최소값에 이른 경우 탐색을 종료하는 분자 구조 탐색 장치."}
{"patent_id": "10-2023-0107548", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "둘 이상의 원자들을 포함하는 임의의 분자 구조에 관한 데이터를 입력받는 입력단계;상기 임의의 분자 구조에 관한 데이터 및 상기 임의의 분자의 상태량을 학습데이터로 사용하여 학습된 예측 모델을 사용하여 상기 입력된 임의의 분자 구조에 관한 데이터로부터 분자의 상태량을 예측하는 처리단계;상기 처리단계에서 상기 임의의 분자 구조에 대한 데이터로부터 예측한 상기 분자의 상태량이 임계값에 도달한경우 탐색을 종료하고, 도달하지 못한 경우 새로운 임의의 분자 구조에 관한 데이터를 재탐색한 뒤 재탐색된 상기 새로운 임의의 분자 구조에 관한 데이터를 상기 입력단계로 보내는 탐색단계; 및상기 분자의 상태량이 임계값에 도달하여 상기 탐색단계에서 탐색이 종료된 경우 입력된 상기 임의의 분자 구조에 대한 데이터를 출력하는 출력단계;를 포함하는 분자 구조 탐색 방법."}
{"patent_id": "10-2023-0107548", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 분자의 상태량은 상기 임의의 분자 구조에서 분자의 총에너지 값을 포함하는 분자 구조 탐색 방법."}
{"patent_id": "10-2023-0107548", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에 있어서,상기 임의의 분자 구조에 관한 데이터는 상기 분자에 포함되는 원자들의 위치를 좌표 상에 표현한 좌표 값인 분자 구조 탐색 방법."}
{"patent_id": "10-2023-0107548", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 임의의 분자 구조에 대한 데이터는 상기 분자에 포함되는 원자들 중 적어도 하나인 중심 원자를 고정하고상기 중심 원자를 제외한 다른 원자의 위치를 변형하여 생성하는 분자 구조 탐색 방법."}
{"patent_id": "10-2023-0107548", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제9항에 있어서,상기 처리단계에서 상기 예측 모델의 학습은 상기 총에너지 값이 클수록 오차가 크도록 오차함수를 설정하고 경사하강법을 이용하여 매개변수 값을 결정하는 방식으로 이루어지는 분자 구조 탐색 방법."}
{"patent_id": "10-2023-0107548", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "공개특허 10-2025-0026526-4-제12항에 있어서,상기 예측 모델의 학습 과정에서 상기 오차함수에 제약사항을 반영한 오차함수가 더 추가되는 분자 구조 탐색방법."}
{"patent_id": "10-2023-0107548", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제9항에 있어서,상기 탐색단계는 상기 학습된 예측 모델을 사용하여 상기 학습된 예측 모델에서 출력된 상기 분자의 총에너지값이 최소값에 이르지 못한 경우 경사하강법을 이용하여 상기 새로운 임의의 분자 구조에 관한 데이터를 재탐색하고, 상기 분자의 총에너지 값이 최소값에 이른 경우 탐색을 종료하는 분자 구조 탐색 방법."}
{"patent_id": "10-2023-0107548", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "임의의 분자 구조에 관한 데이터, 분자의 총에너지 값, 예측 모델을 저장하는 메모리, 상기 예측 모델은 임의의분자 구조에 관한 데이터, 분자의 총에너지 값을 사용하여 임의의 분자 구조에 대한 데이터로부터 분자의 총에너지를 예측하는 인공신경망 기반 학습을 진행한 인공지능 모델임; 및상기 분자의 총에너지를 예측하는 작업이 요청되면, 상기 메모리에 저장된 인공신경망 기반 학습을 진행한 예측모델을 실행하여 임의의 분자 구조에 관한 데이터로부터 분자의 총에너지 값을 예측하며 예측된 값에 따라 상기임의의 분자 구조에 관한 데이터를 탐색 결과로 출력하거나 다른 분자의 정보를 재탐색하는 프로세서;를 포함하는 컴퓨터 장치."}
{"patent_id": "10-2023-0107548", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 실시예들에 의하면, 둘 이상의 원자들을 포함하는 임의의 분자 구조에 관한 데이터를 입력받고, 임의의 분자 구조에 관한 데이터 및 임의의 분자의 상태량을 학습데이터로 사용하여 학습된 예측 모델을 사용하여 입력된 임 의의 분자 구조에 관한 데이터로부터 분자의 상태량을 예측하며, 임의의 분자 구조에 대한 데이터로부터 예측한 분자의 상태량이 임계값에 도달한 경우 탐색을 종료하고, 도달하지 못한 경우 새로운 임의의 분자 구조에 관한 데이터를 재탐색한 뒤 재탐색된 새로운 임의의 분자 구조에 관한 데이터를 입력하며, 분자의 상태량이 임계값에 도달하여 탐색이 종료된 경우 입력된 임의의 분자 구조에 대한 데이터를 출력하는 분자 구조 탐색 장치 및 그 방 법을 제공한다."}
{"patent_id": "10-2023-0107548", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 안정한 상태를 갖는 분자 구조를 찾기 위한 분자 구조 탐색 장치 및 그 방법에 관한 것이다."}
{"patent_id": "10-2023-0107548", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "소재의 물성을 이해하고 예측하는데 있어서 우선적으로 분자구조를 정확하게 파악하는 것이 중요하다. 기존 계 산과학에서는 제일원리 계산을 통해 주어진 구조에서 각 원자들에 가해지는 힘을 계산하고, 만약 시스템에 포함 된 하나 이상의 원자가 사용자에 의해 주어진 값 이상의 힘을 받는 경우, 힘의 크기가 작아지는 방향으로 원자 의 위치를 수정하는 방식으로 분자의 구조를 예측해왔다. 그러나 제일원리 계산은 원자의 위치가 바뀔 때마다 해당 분자 구조에서 가장 낮은 에너지를 가지는 전자구조를 다시 계산하여야 하므로, 초기 입력 구조가 안정한 구조와 크게 다를 경우 계산 수행 시간이 매우 길어지거나 지역 최소값(local minima)에 수렴될 가능성이 있다. 따라서 초기 입력 구조가 수행 시간이나 결과에 영향을 미 쳐 구조가 잘 알려지지 않은 소재에 대해 적용할 때 어려움이 있다. 또한 제일원리 계산은 고려하는 시스템의 크기에 세제곱(N3)으로 계산량이 증가한다. 따라서 무거운 원소를 다 량 포함하거나 결함(defect)을 고려하는 계산 등 구조를 알고자 하는 분자의 크기가 클 경우, 제일원리 계산을 반복 수행하여 최적의 분자구조를 찾기 매우 어렵다."}
{"patent_id": "10-2023-0107548", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 실시예들은 안정한 상태를 갖는 분자 구조를 효율적으로 찾을 수 있는 분자 구조 탐색 장치 및 그 방법을 제 공한다."}
{"patent_id": "10-2023-0107548", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 실시예들은 둘 이상의 원자들을 포함하는 임의의 분자 구조에 관한 데이터를 입력받고, 임의의 분자 구조에 관한 데이터 및 임의의 분자의 상태량을 학습데이터로 사용하여 학습된 예측 모델을 사용하여 입력된 임의의 분자 구조에 관한 데이터로부터 분자의 상태량을 예측하며, 임의의 분자 구조에 대한 데이터로부터 예측한 분자 의 상태량이 임계값에 도달한 경우 탐색을 종료하고, 도달하지 못한 경우 새로운 임의의 분자 구조에 관한 데이 터를 재탐색한 뒤 재탐색된 새로운 임의의 분자 구조에 관한 데이터를 입력하며, 분자의 상태량이 임계값에 도 달하여 탐색이 종료된 경우 입력된 임의의 분자 구조에 대한 데이터를 출력하는 분자 구조 탐색 장치 및 그 방 법을 제공한다. 일 측면에서, 일 실시예에 따른 분자 구조 탐색 장치는 둘 이상의 원자들을 포함하는 임의의 분자 구조에 관한 데이터를 입력받는 입력부, 임의의 분자 구조에 관한 데이터 및 임의의 분자의 상태량을 학습데이터로 사용하여 학습된 예측 모델을 사용하여 입력된 임의의 분자 구조에 관한 데이터로부터 분자의 상태량을 예측하는 처리부, 처리부에서 임의의 분자 구조에 대한 데이터로부터 예측한 분자의 상태량이 임계값에 도달한 경우 탐색을 종료 하고, 도달하지 못한 경우 새로운 임의의 분자 구조에 관한 데이터를 재탐색한 뒤 재탐색된 새로운 임의의 분자 구조에 관한 데이터를 입력부로 보내는 탐색부 및 분자의 상태량이 임계값에 도달하여 탐색부에서 탐색이 종료 된 경우 입력된 임의의 분자 구조에 대한 데이터를 출력하는 출력부를 포함한다. 다른 측면에서, 다른 실시예에 따른 분자 구조 탐색 방법은 둘 이상의 원자들을 포함하는 임의의 분자 구조에 관한 데이터를 입력받는 입력단계, 임의의 분자 구조에 관한 데이터 및 임의의 분자의 상태량을 학습데이터로 사용하여 학습된 예측 모델을 사용하여 입력된 임의의 분자 구조에 관한 데이터로부터 분자의 상태량을 예측하 는 처리단계, 처리단계에서 상기 임의의 분자 구조에 대한 데이터로부터 예측한 분자의 상태량이 임계값에 도달 한 경우 탐색을 종료하고, 도달하지 못한 경우 새로운 임의의 분자 구조에 관한 데이터를 재탐색한 뒤 재탐색된 새로운 임의의 분자 구조에 관한 데이터를 입력단계로 보내는 탐색단계 및 분자의 상태량이 임계값에 도달하여 탐색단계에서 탐색이 종료된 경우 입력된 임의의 분자 구조에 대한 데이터를 출력하는 출력단계를 포함한다."}
{"patent_id": "10-2023-0107548", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 실시예들에 따른 분자 구조 탐색 장치 및 방법은 모델 학습에 필요한 데이터의 계산량을 줄여 안정한 상태를 갖는 분자 구조를 효율적으로 탐색할 수 있게 한다."}
{"patent_id": "10-2023-0107548", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 개시의 일부 실시예들을 예시적인 도면을 참조하여 상세하게 설명한다. 각 도면의 구성 요소들에 참조 부호를 부가함에 있어서, 동일한 구성 요소들에 대해서는 비록 다른 도면 상에 표시되더라도 가능한 한 동일한 부호를 가질 수 있다. 또한, 본 실시예들을 설명함에 있어, 관련된 공지 구성 또는 기능에 대한 구체적인 설명 이 본 기술 사상의 요지를 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명은 생략할 수 있다. 본 명세서 상 에서 언급된 \"포함한다\", \"갖는다\", \"이루어진다\" 등이 사용되는 경우 \"~만\"이 사용되지 않는 이상 다른 부분이 추가될 수 있다. 구성 요소를 단수로 표현한 경우에 특별한 명시적인 기재 사항이 없는 한 복수를 포함하는 경우를 포함할 수 있다. 또한, 본 개시의 구성 요소를 설명하는 데 있어서, 제1, 제2, A, B, (a), (b) 등의 용어를 사용할 수 있다. 이 러한 용어는 그 구성 요소를 다른 구성 요소와 구별하기 위한 것일 뿐, 그 용어에 의해 해당 구성 요소의 본질, 차례, 순서 또는 개수 등이 한정되지 않는다. 구성 요소들의 위치 관계에 대한 설명에 있어서, 둘 이상의 구성 요소가 \"연결\", \"결합\" 또는 \"접속\" 등이 된다 고 기재된 경우, 둘 이상의 구성 요소가 직접적으로 \"연결\", \"결합\" 또는 \"접속\" 될 수 있지만, 둘 이상의 구성 요소와 다른 구성 요소가 더 \"개재\"되어 \"연결\", \"결합\" 또는 \"접속\"될 수도 있다고 이해되어야 할 것이다. 여 기서, 다른 구성 요소는 서로 \"연결\", \"결합\" 또는 \"접속\" 되는 둘 이상의 구성 요소 중 하나 이상에 포함될 수 도 있다. 구성 요소들이나, 동작 방법이나 제작 방법 등과 관련한 시간적 흐름 관계에 대한 설명에 있어서, 예를 들어, \"~후에\", \"~에 이어서\", \"~다음에\", \"~전에\" 등으로 시간적 선후 관계 또는 흐름적 선후 관계가 설명되는 경우, \"바로\" 또는 \"직접\"이 사용되지 않는 이상 연속적이지 않은 경우도 포함할 수 있다. 한편, 구성 요소에 대한 수치 또는 그 대응 정보(예: 레벨 등)가 언급된 경우, 별도의 명시적 기재가 없더라도, 수치 또는 그 대응 정보는 각종 요인(예: 공정상의 요인, 내부 또는 외부 충격, 노이즈 등)에 의해 발생할 수 있는 오차 범위를 포함하는 것으로 해석될 수 있다. 본 발명의 상세한 설명 및 청구항들에 걸쳐 나타나는 '학습' 혹은 '러닝'은 절차에 따른 컴퓨팅(computing)을 통하여 기계 학습(machine learning)을 수행함을 일컫는 용어인바, 인간의 교육 활동과 같은 정신적 작용을 지 칭하도록 의도된 것이 아님을 통상의 기술자는 이해할 수 있을 것이다. 이하 도면을 참조해서 실시예들을 상세히 설명한다. 도 1은 일 실시예에 따른 분자 구조 탐색 장치의 블록도이다. 도 1을 참조하면, 일 실시예에 따른 분자 구조 탐색 장치는 둘 이상의 원자들을 포함하는 임의의 분자 구 조에 관한 데이터를 입력받는 입력부와 임의의 분자 구조에 관한 데이터 및 임의의 분자의 상태량을 학습 데이터로 사용하여 학습된 예측 모델을 사용하여 입력된 임의의 분자 구조에 관한 데이터로부터 분자의 상 태량을 예측하는 처리부, 처리부에서 임의의 분자 구조에 대한 데이터로부터 예측한 분자의 상태량이 임계값에 도달한 경우 탐색을 종료하고, 도달하지 못한 경우 새로운 임의의 분자 구조에 관한 데이터를 재탐색 한 뒤 재탐색된 새로운 임의의 분자 구조에 관한 데이터를 입력부로 보내는 탐색부 및 분자의 상태량 이 임계값에 도달하여 탐색부에서 탐색이 종료된 경우 입력된 임의의 분자 구조에 대한 데이터를 출력하는 출력부를 포함한다. 입력부는 둘 이상의 원자들을 포함하는 임의의 분자 구조에 관한 데이터를 입력받는다. 둘 이상의 원자들 을 포함하는 임의의 분자 구조에 관한 데이터는 임의의 분자에 포함되는 원자들의 위치를 좌표 상에 표현한 좌 표 값일 수 있다. 여기서 좌표는 3차원 직교 좌표계를 의미할 수 있으나 이에 한정되지는 않는다. 임의의 분자 구조에 관한 데이터는 분자 내에 존재하는 각 원자들을 좌표 상의 점으로 표현한 좌표 값의 집합일 수 있다. 처리부는 예측 모델을 포함하며, 예측 모델은 인공 신경망 기반의 학습을 진행한 모델일 수 있 다. 인공신경망은 인간의 뇌의 동작 원리를 모방하여, 복잡한 데이터를 분석하고 학습하는 머신러닝 알고리즘이다. 인공신경망은 입력층, 은닉층, 출력층으로 이루어져 있는 가장 기본적인 인공신경망 구조인 다층 퍼셉트론(MLP, Multilayer Perceptron)이나 이미지의 특징을 추출하기 위해 컨볼루션(convolution) 연산을 수행하고, 풀링 (pooling) 연산으로 차원을 축소하는 합성곱 신경망(CNN, Convolutional Neural Network), 순서가 있는 데이터 를 처리하는 데 사용되는 인공신경망 구조인 순환 신경망(RNN, Recurrent Neural Network), 문장을 나누어 처리 하고, 문장 내 단어들의 관계를 고려하여 예측을 수행하는데 사용되는 재귀 신경망(RNN, Recursive Neural Network) 등 어떤 인공신경망일 수 있으며, 데이터의 복잡도와 다양성에 따라 다양하게 변형될 수 있다. 처리부는 학습된 예측 모델을 사용하여 임의의 분자 구조에 대한 데이터로부터 분자의 상태량을 예측 한다. 이 때 분자의 상태량은 분자의 상태를 정량화할 수 있는 거시적인 특성을 말하며, 분자의 총에너지, 질량, 체적, 밀도와 같은 값을 포함할 수 있으며 어느 하나로 제한되지 않는다. 다만 설명의 편의를 위해서 이 하에서는 분자의 총에너지를 하나의 예시로 하여 설명한다. 탐색부는 예측 모델에서 예측한 분자의 상태량이 임계값에 도달하는지 여부를 판단한다. 임계값에 도 달하는 경우 분자의 상태량을 출력부를 통해 출력하며, 도달하지 못하는 경우에는 새로운 입력값을 재탐색 하여 입력부로 보낸다. 출력부는 탐색부에서 탐색이 종료된 경우 입력되었던 임의의 분자 구조에 대한 데이터를 출력한다. 도 2a는 입력데이터를 만들기 위해 H2O 분자와 CH6BN 분자에서 중심원자를 각각 고정하고 주변 원자의 위치를 변형한 분자 구조의 모식도이다. 도 2b는 H2O 분자에서 H 원자의 위치가 x, y, z좌표축에서 달라짐에 따라 H2O 분자의 총에너지 값이 달라지는 경향을 표현한 그래프이다. 도 2a 및 도 2b를 참조하면, 임의의 분자 구조에 관한 데이터는 전술한 것처럼 분자에 포함되는 원자들의 위치 를 좌표 상에 표현한 좌표 값일 수 있다. 이 때 분자 내에 포함되는 원자들 중에 존재하는 적어도 하나의 중심 원자를 선택하여 중심 원자의 좌표를 임의의 값으로 고정한다. 중심 원자는 임의로 결정할 수 있으며, 특정 분 자 구조내에 알려진 대칭성(symmetry)가 있으면 이를 고려하여 정할 수 있다. 도 2a의 (a), (b)를 참조하여 구체적으로 설명하면, 도 2a의 (a)는 H2O 분자의 모식도이다. H2O의 경우 수소(H) 원자와 산소(O) 원자가 선호하는 산화수가 각각 +1, -2 임을 고려할 때, 두 개의 수소원자가 산소원자에 결합하 여 거울 대칭성(mirror symmetry)을 가질 것을 예상할 수 있다. 이러한 경우 편의상 산소원자를 기준 원자, 즉 중심 원자로 하여 임의의 좌표 값을 부여할 수 있으며, 수소 원자는 산소 원자의 좌표 값으로부터 같은 거리만 큼 떨어진 곳의 좌표 값을 가질 수 있다. 도 2a의 (b)는 CH6BN 분자의 모식도이다. CH6BN의 경우 질소원자(N)가 가장 무거운 원자이고, 분자 구조의 중심 에 위치할 경우 산화수 측면에서 가장 안정될 것으로 예상되므로 질소원자를 중심 원자로 하여 임의의 좌표 값 을 부여할 수 있다. 이 때 각 분자 내에서 중심 원자를 고정하고 중심 원자 주변의 다른 원자들의 위치를 변형하게 되면 중심 원자 와 주변 원자와의 인력 및 반발력, 주변 원자들간의 인력 및 반발력으로 인해 각 원자의 에너지 및 분자가 가진 총에너지 값이 달라지게 된다. 도 2b를 참조하여 구체적으로 설명하면, H2O 분자의 경우 전술한 것처럼 산소 원자를 중심 원자로 설정할 수 있 는데, 산소 원자를 중심 원자로 설정하고 주변 원자인 수소 원자들을 좌표축을 따라 움직이게 되면, 수소 원자 의 에너지가 달라진다. 도 2b의 (a)의 경우 수소 원자를 x축을 따라 한방향으로 움직였을 때 수소 원자가 가진 에너지가 감소하는 경향을 나타낸다. 즉 수소 원자의 위치가 달라짐에 따라 수소 원자가 가진 에너지가 변하게 되며 결과적으로 H2O 분자가 가진 총에너지 값이 달라지게 된다. 이 때 분자가 가진 총에너지 값은 전자 구조를 계산하는 제일 원리 계산을 통해 수행될 수 있다. 도 2b의 (b), (c)는 각각 수소 원자를 y, z축을 따라 한방향 으로 움직였을 때 수소 원자가 가진 에너지가 다소 증가 또는 다소 감소하는 경향을 보여준다. (a)와 마찬가지 로 이 경우에도 수소 원자의 위치에 따라 수소원자가 가지는 에너지가 달라지고 결과적으로 H2O가 가지는 총에 너지 값이 달라지게 된다. 도 2a를 참조하면, (a)의 경우 수소 원자가 중심 원자인 산소 원자로부터 떨어진 거리와 위치를 바꾸어 줌으로 써 서로 다른 분자 구조에 대한 데이터들을 만들 수 있으며, 이렇게 만들어진 분자들의 총에너지 값은 서로 다 른 값을 가진다. (b)의 경우도 마찬가지로 탄소 원자(C)와 붕소 원자(B)가 중심 원자인 질소 원자로부터 떨어진 각도와 거리를 다르게 해줌으로써 서로 다른 분자 구조에 대한 데이터들을 만들 수 있으며, 이렇게 만들어진 분 자들의 총에너지 값은 서로 다른 값을 가진다. 도 2a 및 2b를 참조하여 설명한 서로 다른 구조를 가지는 임의의 분자 구조에 대한 데이터들 및 서로 다른 구조 를 갖는 분자들의 총에너지 값을 이용하여 예측 모델을 학습한다. 후술할 것처럼 중심원자를 고정해 놓고 주변 원자들의 좌표값만 변형한 데이터를 학습데이터로 사용하게 되므로 학습 데이터의 양을 줄일 수 있다는 장 점이 있다. 도 3a는 예측 모델의 학습과정을 표현한 개념도이다. 도 3a를 참조하면, 예측 모델은 전술한 것처럼 인공신경망 기반의 인공지능 모델일 수 있다. 이 때 인공신 경망은 입력노드와 출력노드, 히든노드를 포함하는데, 입력노드에는 임의의 분자의 구조에 대한 데이터가 입력된다. 설명의 편의를 위해 입력 노드가 한 개인 경우만 도시되었지만 분자의 종류와 변형된 분자 구조의 개 수에 따라 입력노드의 개수는 달라질 수 있다. 출력노드로는 분자의 총에너지 값이 출력되며 입력노드와 마찬가지로 분자의 종류와 변형된 분자 구조의 개수에 따라 출력노드의 개수는 달라질 수 있다. 히 든노드의 레이어들의 개수는 입력데이터인 임의의 분자의 구조에 대한 데이터의 개수와 출력데이터인 총에너지 값의 개수에 따라 임의로 정해질 수 있으며 도시된 것처럼 반드시 2개의 레이어와 4개의 히든노드를 가져야만 하는 것은 아니다. 예를 들어, 입력 및 출력 노드들의 개수가 적은 경우 히든노드의 레이어들의 개수가 적어도 충분히 최적화 성능을 나타낼 수 있으므로 적은 수의 레이어를 사용할 수도 있고, 입력 및 출력 노드들의 개수 가 큰 경우에는 히든노드의 레이어들의 개수를 늘릴 수 있다. 인공신경망의 히든 레이어에 있는 각 노드들에 전달되는 입력치에 가중치(weight)를 곱하고, 입력치와 가중치의 곱을 모두 합한 값에 편향(bias)을 더한 값이 히든 레이어에 있는 활성화 함수가 가지고 있는 임계치값과 비교 되어 그 합이 임계치 값보다 클 경우 노드들은 활성화되고, 임계치보다 작을 경우 노드들은 비활성화되는 방법 으로 신호가 전달된다. 이 때, 가중치와 편향은 초기에는 랜덤한 값으로 설정되지만, 경사하강법을 통해 예측값 과 실제값의 차이(오차함수)를 줄이는 방향으로 인공신경망이 학습된다. 이 때 가중치를 학습하는 과정은 아래 의 수학식 1로 표현할 수 있다. [수학식 1]"}
{"patent_id": "10-2023-0107548", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "수학식 1에서, w는 인공신경망의 가중치, L은 오차함수, F는 인공신경망, Xn은 학습데이터의 입력값(임의의 분 자 구조에 대한 데이터), Yn은 학습데이터의 출력값(분자의 총에너지값)을 말한다. 수학식 1에서 볼 수 있듯이, 예측 모델의 학습은 학습데이터 중 입력데이터로 임의의 분자 구조에 관한 데 이터를 사용하고, 학습데이터 중 출력데이터로 임의의 분자의 총에너지 값을 사용하여 이루어진다. 여기서 학습은 분자의 총에너지 값이 클수록 오차함수가 크도록 설정되고, 경사하강법을 이용하여 히든 레이어 의 매개변수 값을 결정하는 방식으로 이루어질 수 있다. 보다 구체적으로, 오차함수는 다음과 같이 수학식 2로 표현될 수 있다. [수학식 2]"}
{"patent_id": "10-2023-0107548", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "수학식 2에서 w는 인공신경망의 가중치, X는 학습데이터의 입력값(임의의 분자 구조에 대한 데이터)을 말한다. 여기서 오차함수 L은 평균 제곱 에러(Mean Squared Error)형태를 가질 수 있으며, 임의의 분자 구조에 대하여 제일 원리 계산을 통해 얻어진 실제 분자의 총에너지 값과 인공신경망이 예측한 분자의 총에너지 값의 차이를 제곱한 값을 오차함수로 사용함으로써, 예측값과 실제값의 차이가 클수록 오차함수가 크도록 설정되어 학습 기 울기를 높일 수 있다. 수학식 2와 같이 오차함수를 설정하고, 경사하강법을 이용하여 인공신경망이 실제값에 근접한 분자의 총에너지 값을 예측하도록 가중치 값을 학습할 수 있다. 가중치 값이 최종적으로 학습되면 예측 모델의 학습이 종료 된다. 도 3b는 예측 모델의 학습과정에서 제약함수를 오차함수로 반영하는 내용을 포함하는 흐름도이다. 도 3b를 참조하면, 예측 모델의 학습 과정은 전술한 것처럼 먼저 분자 구조에 대한 데이터와 총에너지 값 을 학습데이터로 준비하고, 오차함수에 제약사항을 반영한 오차함수를 더 추가할 수 있다. 즉 수학식 2에서 전술한 오차함수는 제약사항을 반영한 오차함수를 더 포함할 수 있다. 제약사항은 분자 구조가 물리적으로 가능한 구조를 갖도록 설정된 범위를 의미한다. 예를 들어 원자와 원자간 거리는 무한하게 떨어질 수 없고 현실에 존재하는 모든 분자 내의 원자들은 특정 범위내의 결합길이(bonding length)를 가지고 있으므로 특정한 결합길이의 범위는 제약사항에 해당할 수 있다.또한 일 예로 H2O 분자의 경우에는 제약사항은 아래의 수학식 3을 통하여 오차함수에 반영될 수 있다. [수학식 3]"}
{"patent_id": "10-2023-0107548", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "수학식 3에서 은 기준 원자의 좌표 값을 말하며, 은 대칭이 필요한 첫 번째 원자를 말하고, m은 (대칭조 건이 필요한 총 주변원자의 개수)-1의 값을 가진다. H2O 분자에서는 전술한 것처럼 산소원자와 첫번째 수소원자와의 거리 및 산소원자와 두번째 수소원자와의 거리 가 같아야 한다. 즉 분자의 총에너지 값을 계산해보지 않더라도 위와 같이 분자의 일부 구조가 물리적으로 추론 이 가능한 상황이라면 이를 제약사항으로 반영할 수 있다. 수학식 3의 오차함수는 각 수소원자와 산소원자간 거 리의 차이가 커질수록 그 값이 커지도록 한다. 위와 같이 제약사항을 반영한 오차함수를 추가로 설정할 경우, 학습 과정에서 사용되는 총 오차함수는 수학식 2 의 오차함수에 수학식 3의 오차함수를 더한 함수이다. 이렇게 총 오차함수를 이용하여 전술한 예측 모델의 학습을 진행할 경우, 특정 분자의 구조를 학습시키는 과정에서 다양한 분자의 구조에 대한 데이터를 입력 하는 대신 제약함수만을 오차함수에 반영하는 것으로도 특정 분자 구조의 학습이 가능해지므로 필요한 학습데이 터의 양을 줄일 수 있으며, 학습 속도를 높일 수 있다. 도 4a는 탐색부에서 분자의 총에너지 값이 최소값에 이를 때까지 입력값을 탐색하는 내용에 대한 흐름도이다. 도 4b는 탐색부에서 분자의 총에너지 값이 최소값에 이를 때까지 입력값을 탐색하는 과정을 표현한 그래프이다. 학습이 완료된 예측 모델은 임의의 분자 구조에 대한 데이터가 입력되면 임의의 분자의 총에너지 값을 예 측한다. 탐색부는 학습된 예측 모델을 사용하여 학습된 예측 모델에서 출력된 분자의 총에너지 값이 최 소값에 이르지 못한 경우 경사하강법을 이용하여 새로운 임의의 분자 구조에 관한 데이터를 재탐색하고, 분자의 총에너지 값이 최소값에 이른 경우 탐색을 종료한다. 도 4a를 참조하면, 입력부를 통해 임의의 분자 구조에 대한 데이터가 입력되고, 학습된 예측 모델 이 총에너지 값을 출력하면, 탐색부는 총에너지 값이 최소값에 이르렀는지 여부를 판단한 다. 이 때, 총에너지가 최소값에 이르지 않은 경우(206의 No) 새로운 임의의 분자 구조에 대한 데이터를 재탐색 하여 입력부로 보내어 상기의 과정을 반복하며, 총에너지가 최소값에 이른 경우(206의 Yes) 탐색을 종료한 다. 이 때 탐색 과정은 경사하강법을 통해 이루어지며, 아래의 수학식 4를 통해 설명할 수 있다. [수학식 4]"}
{"patent_id": "10-2023-0107548", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "수학식 4에서 x는 탐색하고자 하는 분자 구조에 대한 데이터이며, a는 학습률, 는 오차에 대한 편미 분 계수를 말한다. 수학식 4의 오차함수 Lmin은 아래의 수학식 5로 표현될 수 있다. [수학식 5]"}
{"patent_id": "10-2023-0107548", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "수학식 5에서 w는 학습이 완료된 인공신경망의 가중치, Xn은 탐색된 임의의 분자 구조에 대한 데이터, F는 인공 신경망을 말한다. 임의의 분자 구조에 대한 데이터를 예측 모델에 입력하여 총에너지 값이 예측값으로 출력되면 예측값과 제 일 원리 계산을 통해 얻은 실제 총에너지 값과의 오차를 수학식 5의 오차함수와 같이 표현하고, 수학식 5의 오 차함수가 최소값을 가질 때까지, 즉 예측된 분자의 총에너지 값이 실제 값에 근접하여 최소값을 갖게 될 때까지 임의의 분자 구조에 관한 데이터를 탐색하며, 이 때 새롭게 탐색되는 새로운 임의의 분자 구조에 관한 데이터는 수학식 4에서 보듯이 임의의 분자 구조에 관한 데이터에서 수학식 5의 오차함수를 임의의 분자 구조에 관한 데 이터로 미분한 값에 학습률을 곱한 값을 빼줌으로써 정해진다. 도 4b를 참조하면, 도 4b의 아래 평면(h1_1, h1_2평면)은 H2O분자에서 수소원자 하나의 좌표를 표현하고, 아래 평면에 수직한 면은 분자의 총에너지 값(Total Energy)을 표현하며 그려진 그래프는 임의의 수소 원자의 위치에 따른 H2O분자의 총에너지 값을 나타낸다. 총에너지 값이 최소값을 갖는 임의의 분자 구조에 대한 데이터를 탐색하기 위하여 임의의 시작점(임의의 수소원 자의 좌표 데이터)에서 탐색을 시작한다. 먼저 임의의 시작점을 학습된 예측 모델에 입력한 후 출력된 총 에너지 값이 최소값을 갖게 되는지 여부를 먼저 확인한다. 총에너지 값이 최소값을 갖는 경우 탐색은 종료되며, 최소값을 갖지 않는 경우 탐색이 시작된다. 이 때 수학식 5의 오차함수에 대한 편미분 값이 음의 값을 가지게 되는 경우에는 수학식 4에 따라서 기존에 입 력한 수소 원자의 좌표 데이터에 양의 값을 더해준 좌표 데이터를 탐색결과로 하며, 편미분 값이 양의 값을 가 지게 되는 경우에는 수학식 4에 따라 기존에 입력한 수소 원자의 좌표 데이터에 음의 값을 더해준 좌표 데이터 를 탐색 결과로 한다. 탐색 결과로 얻어진 새로운 수소 원자의 좌표 데이터는 다시 입력부를 통해 처리부의 학습된 예측 모 델에 입력되며, 예측 모델에서 출력된 총에너지 값이 실제 값에 근접하여 최소값을 갖게 되는 경우, 즉 수학식 5의 오차함수가 최소가 되는 경우 탐색이 종료되고, 이 때 입력되었던 좌표 데이터(10a)가 최적의 분 자 구조에 대한 데이터로 확정된다. 도 5는 다른 실시예에 따른 분자 구조 탐색 방법의 흐름도이다. 도 5를 참조하면, 다른 실시예에 따른 분자 구조 탐색 방법은 둘 이상의 원자들을 포함하는 임의의 분자 구조에 관한 데이터를 입력받는 입력단계(S210), 임의의 분자 구조에 관한 데이터 및 임의의 분자의 상태량을 학습데이터로 사용하여 학습된 예측 모델을 사용하여 입력된 임의의 분자 구조에 관한 데이터로부터 분자의 상 태량을 예측하는 처리단계(S220), 처리단계(S220)에서 임의의 분자 구조에 대한 데이터로부터 예측한 분자의 상 태량이 임계값에 도달한 경우 탐색을 종료하고, 도달하지 못한 경우 새로운 임의의 분자 구조에 관한 데이터를 재탐색한 뒤 재탐색된 새로운 임의의 분자 구조에 관한 데이터를 입력단계(S210)로 보내는 탐색단계(S230) 및 분자의 상태량이 임계값에 도달하여 탐색단계(S230)에서 탐색이 종료된 경우 입력된 임의의 분자 구조에 대한 데이터를 출력하는 출력단계(S240)를 포함한다. 전술한 것처럼, 분자의 상태량은 분자의 상태를 정량화할 수 있는 거시적인 특성을 말하며, 분자의 총에너지, 질량, 체적, 밀도와 같은 값을 포함할 수 있으며 어느 하나로 제한되지 않는다. 다만 설명의 편의를 위해서 이 하에서는 분자의 총에너지를 하나의 예시로 하여 설명한다. 도 1 내지 도 4를 참조하여 전술한 것처럼, 임의의 분자 구조에 관한 데이터는 전술한 것처럼 분자에 포함되는 원자들의 위치를 좌표 상에 표현한 좌표 값일 수 있다. 이 때 분자 내에 포함되는 원자들 중에 존재하는 적어도 하나의 중심 원자를 선택하여 중심 원자의 좌표를 임의의 값으로 고정한다. 중심 원자는 임의로 결정할 수 있으 며, 특정 분자 구조내에 알려진 대칭성(symmetry)가 있으면 이를 고려하여 정할 수 있다. 이 때 각 분자 내에서 중심 원자를 고정하고 중심 원자 주변의 다른 원자들의 위치를 변형하게 되면 중심 원자 와 주변 원자와의 인력 및 반발력, 주변 원자들간의 인력 및 반발력으로 인해 각 원자의 에너지 및 분자가 가진 총에너지 값이 달라지게 된다. 주변 원자들의 위치를 변형하여 얻은 서로 다른 구조를 가지는 임의의 분자 구조에 대한 데이터들 및 서로 다른 구조를 갖는 분자들의 총에너지 값을 이용하여 예측 모델을 학습한다. 후술할 것처럼 중심원자를 고정해 놓고 주변 원자들의 좌표값만 변형한 데이터를 학습데이터로 사용하게 되므로 학습 데이터의 양을 줄일 수 있다 는 장점이 있다. 예측 모델의 학습은 학습데이터 중 입력데이터로 임의의 분자 구조에 관한 데이터를 사용하고, 학습데이터 중 출력데이터로 임의의 분자의 총에너지 값을 사용하여 이루어진다. 여기서 학습은 분자의 총에너지 값이 클수록 오차함수가 크도록 설정되고, 경사하강법을 이용하여 히든 레이어 의 매개변수 값을 결정하는 방식으로 이루어질 수 있다. 임의의 분자 구조에 대하여 제일 원리 계산을 통해 얻어진 실제 분자의 총에너지 값과 인공신경망이 예측한 분 자의 총에너지 값의 차이를 제곱한 값을 오차함수로 사용함으로써, 예측값과 실제값의 차이가 클수록 오차함수 가 크도록 설정되어 학습 기울기를 높일 수 있다. 예측 모델의 학습 과정은 전술한 것처럼 먼저 분자 구조에 대한 데이터와 총에너지 값을 학습데이터로 준 비하고, 오차함수에 제약사항을 반영한 오차함수를 더 추가할 수 있다. 즉 수학식 2에서 전술한 오차함수는 제 약사항을 반영한 오차함수를 더 포함할 수 있다. 탐색단계(S230)는 학습된 예측 모델을 사용하여 학습된 예측 모델에서 출력된 분자의 총에너지 값이 최소값에 이르지 못한 경우 경사하강법을 이용하여 새로운 임의의 분자 구조에 관한 데이터를 재탐색하고, 분자 의 총에너지 값이 최소값에 이른 경우 탐색을 종료한다. 도 5를 참조하여 설명한 다른 실시예에 따른 분자 구조 탐색 방법은 도 1 내지 도 4를 참조하여 설명한 일 실시예에 따른 분자 구조 탐색 장치에서 설명한 내용들을 동일 또는 유사하게 적용할 수 있다. 본 실시예들에 따른 분자 구조 탐색 장치 및 그 방법은 모델 학습에 필요한 데이터의 계산량을 줄여 가장 안정 한 분자 구조를 효율적으로 탐색할 수 있다. 도 6은 본 발명의 실시예들에 따른 컴퓨팅 시스템의 구성도이다. 도 6을 참조하면, 컴퓨팅 시스템은 입력부, 메모리 및 프로세서를 포함할 수 있다. 메모리는 입력부에서 입력받은 임의의 분자 구조에 대한 데이터를 저장할 수 있으나, 별도의 대용량 스토리지 서버 등에 별도로 저장할 수도 있다. 메모리는 휘발성 메모리(e.g. SRAM, DRAM) 또는 비휘발성 메모리(e.g. NAND Flash)일 수 있다. 프로세서는 임의의 분자 구조에 대한 데이터 및 분자의 총에너지 값을 학습데이터로 하여 학습을 진행한 예측 모델에 임의의 분자 구조에 관한 데이터를 입력하여 총에너지 값을 최소로 하는 분자 구조를 예측한 다. 메모리는 인공신경망 기반 학습을 진행한 예측 모델을 저장한다. 총에너지 값이 최소가 되는 분자 구 조의 탐색 작업이 요청되면, 상기 메모리에 저장된 인공신경망 기반 학습을 진행한 예측 모델을 실행하여 총에 너지 값이 최소가 되는 분자 구조를 탐색하는 작업을 수행한다. 본 발명의 실시예들에 따른 컴퓨팅 시스템은 메모리 및 프로세서를 포함하는 컴퓨터 장치와 메 모리 및 프로세서를 포함하는 서버를 포함할 수 있다. 컴퓨터 장치와 서버는 네트워 크를 통해 유선 또는 무선으로 연결될 수 있다. 서버의 메모리는 전술한 인공신경망 기반 학습을 진행한 예측 모델을 저장할 수 있다. 총에너지 값이 최소가 되는 분자 구조의 탐색 작업이 요청(query)되면, 컴퓨터 장치의 프로세서는 메 모리에 저장된 임의의 분자 구조에 대한 데이터를 가져온다. 컴퓨터 장치의 메모리는 전술한 임 의의 분자 구조에 대한 데이터를 저장할 수 있다. 컴퓨터 장치의 메모리는 메모리에 저장된 임의의 분자 구조에 대한 데이터 및 이 요청(query)을 서버에 전송할 수 있다. 서버의 프로세서는 전송받은 임의의 분자 구조에 대한 데이터에 대하여 메모리에 저장된 인공신경망 기반 학습을 진행한 예측 모델을 실행하여 총에너지 값이 최소가 되는 분자 구조의 탐색 작업을 수행하여, 그 결과를 컴퓨터 장치에 전송할 수 있다. 도 6 및 도 7을 참조하여 설명한 컴퓨터 시스템에 대해서 아래에서 가능한 다양한 예들을 설명한다. 분자 구조 탐색 장치는 도 6에 도시한 컴퓨팅 시스템으로 구성할 수도 있고, GPU 프로세서와 일반 메 모리가 장착된 GPU 서버로 구성할 수도 있으나, 본 발명은 이에 제한되지 않는다. 전술한 분자 구조 탐색 장치는, 프로세서, 메모리, 사용자 입력장치, 프레젠테이션 장치 중 적어도 일부를 포함하는 컴퓨팅 장치에 의해 구현될 수 있다. 메모리는, 프로세서에 의해 실행되면 특정 태스크를 수행할 있도 록 코딩되어 있는 컴퓨터-판독가능 소프트웨어, 애플리케이션, 프로그램 모듈, 루틴, 인스트럭션 (instructions), 및/또는 데이터 등을 저장하는 매체이다. 프로세서는 메모리에 저장되어 있는 컴퓨터-판독가능 소프트웨어, 애플리케이션, 프로그램 모듈, 루틴, 인스트럭션, 및/또는 데이터 등을 판독하여 실행할 수 있다. 사용자 입력장치는 사용자로 하여금 프로세서에게 특정 태스크를 실행하도록 하는 명령을 입력하거나 특정 태스 크의 실행에 필요한 데이터를 입력하도록 하는 수단일 수 있다. 사용자 입력장치는 물리적인 또는 가상적인 키 보드나 키패드, 키버튼, 마우스, 조이스틱, 트랙볼, 터치-민감형 입력수단, 또는 마이크로폰 등을 포함할 수 있 다. 프레젠테이션 장치는 디스플레이, 프린터, 스피커, 또는 진동장치 등을 포함할 수 있다. 컴퓨팅 장치는 스마트폰, 태블릿, 랩탑, 데스크탑, 서버, 클라이언트 등의 다양한 장치를 포함할 수 있다. 컴퓨 팅 장치는 하나의 단일한 스탠드-얼론 장치일 수도 있고, 통신망을 통해 서로 협력하는 다수의 컴퓨팅 장치들로 이루어진 분산형 환경에서 동작하는 다수의 컴퓨팅 장치를 포함할 수 있다. 한편, 컴퓨팅 장치는 고전(classic) 컴퓨팅 장치가 아니라 양자(quantum) 컴퓨팅 장치일 수 있다. 양자 컴퓨팅 장치는 비트가 아닌 큐비트(Qubit) 단위로 연산을 수행한다. 큐비트는 0과 1이 동시에 중첩(superposition)되는 상태를 가질 수 있으며, M개의 큐비트가 있으면 동시에 2^M개의 상태를 표현할 수 있다. 양자 컴퓨팅 장치는 양자 연산을 수행하기 위해 하나 이상의 큐비트를 입력받아 지정된 연산을 수행하는 다양한 종류의 양자 게이트들(e.g. Pauli / Rotation / Hadamard / CNOT / SWAP / Toffoli)를 사용할 수 있고, 양자 게이트들을 조합하여 특수한 기능을 하는 양자 회로를 구성할 수 있다. 양자 컴퓨팅 장치는 기존의 인공 신경망(e.g. CNN, RNN)이 수행하는 기능을 적은 파라미터를 사용하면서도 더 빠른 속도로 수행할 수 있는 양자 인공 신경망(e.g. QCNN, QGRNN)을 사용할 수 있다. 또한 전술한 분자 구조 탐색 장치는, 프로세서를 구비하고, 또한 프로세서에 의해 실행되면 딥 러닝 모델 을 활용한 분자 구조 탐색 방법을 수행할 수 있도록 코딩된 컴퓨터 판독가능 소프트웨어, 애플리케이션, 프로그 램 모듈, 루틴, 인스트럭션, 및/또는 데이터 구조 등을 저장한 메모리를 구비하는 컴퓨팅 장치에 의해 실행될 수 있다. 상술한 본 실시예들은 다양한 수단을 통해 구현될 수 있다. 예를 들어, 본 실시예들은 하드웨어, 펌웨어 (firmware), 소프트웨어 또는 그것들의 결합 등에 의해 구현될 수 있다. 하드웨어에 의한 구현의 경우, 본 실시예들에 따른 딥 러닝 모델을 활용한 분자 구조 탐색 방법은 하나 또는 그 이상의 ASICs(Application Specific Integrated Circuits), DSPs(Digital Signal Processors), DSPDs(Digital Signal Processing Devices), PLDs(Programmable Logic Devices), FPGAs(Field Programmable Gate Arrays), 프로세서, 컨트롤러, 마이크로 컨트롤러 또는 마이크로 프로세서 등에 의해 구현될 수 있다. 예를 들어 실시예들에 따른 분자 구조 탐색 방법은 심층 신경망의 뉴런(neuron)과 시냅스(synapse)가 반도체 소 자들로 구현된 인공지능 반도체 장치를 이용하여 구현될 수 있다. 이때 반도체 소자는 현재 사용하는 반도체 소 자들, 예를 들어 SRAM이나 DRAM, NAND 등일 수도 있고, 차세대 반도체 소자들, RRAM이나 STT MRAM, PRAM 등일 수도 있고, 이들의 조합일 수도 있다. 실시예들에 따른 분자 구조 탐색 방법을 인공지능 반도체 장치를 이용하여 구현할 때, 딥 러닝 모델을 소프트웨 어로 학습한 결과(가중치)를 어레이로 배치된 시냅스 모방소자에 전사하거나 인공지능 반도체 장치에서 학습을 진행할 수도 있다. 펌웨어나 소프트웨어에 의한 구현의 경우, 본 실시예들에 따른 분자 구조 탐색 방법은 이상에서 설명된 기능 또 는 동작들을 수행하는 장치, 절차 또는 함수 등의 형태로 구현될 수 있다. 소프트웨어 코드는 메모리 유닛에 저 장되어 프로세서에 의해 구동될 수 있다. 메모리 유닛은 상기 프로세서 내부 또는 외부에 위치하여, 이미 공지 된 다양한 수단에 의해 프로세서와 데이터를 주고 받을 수 있다. 또한, 위에서 설명한 \"시스템\", \"프로세서\", \"컨트롤러\", \"컴포넌트\", \"모듈\", \"인터페이스\", \"모델\", 또는 \"유 닛\" 등의 용어는 일반적으로 컴퓨터 관련 엔티티 하드웨어, 하드웨어와 소프트웨어의 조합, 소프트웨어 또는 실 행 중인 소프트웨어를 의미할 수 있다. 예를 들어, 전술한 구성요소는 프로세서에 의해서 구동되는 프로세스, 프로세서, 컨트롤러, 제어 프로세서, 개체, 실행 스레드, 프로그램 및/또는 컴퓨터일 수 있지만 이에 국한되지 않는다. 예를 들어, 컨트롤러 또는 프로세서에서 실행 중인 애플리케이션과 컨트롤러 또는 프로세서가 모두 구 성 요소가 될 수 있다. 하나 이상의 구성 요소가 프로세스 및/또는 실행 스레드 내에 있을 수 있으며, 구성 요소들은 하나의 장치(예: 시스템, 컴퓨팅 디바이스 등)에 위치하거나 둘 이상의 장치에 분산되어 위치할 수 있다. 한편, 또 다른 실시예는 전술한 분자 구조 탐색 방법을 수행하는, 컴퓨터 기록매체에 저장되는 컴퓨터 프로그램 을 제공한다. 또한 또 다른 실시예는 전술한 분자 구조 탐색 방법을 실현시키기 위한 프로그램을 기록한 컴퓨터 로 읽을 수 있는 기록매체를 제공한다. 기록매체에 기록된 프로그램은 컴퓨터에서 읽히어 설치되고 실행됨으로써 전술한 단계들을 실행할 수 있다. 이와 같이, 컴퓨터가 기록매체에 기록된 프로그램을 읽어 들여 프로그램으로 구현된 기능들을 실행시키기 위하 여, 전술한 프로그램은 컴퓨터의 프로세서(CPU)가 컴퓨터의 장치 인터페이스(Interface)를 통해 읽힐 수 있는 C, C++, JAVA, 기계어 등의 컴퓨터 언어로 코드화된 코드(Code)를 포함할 수 있다. 이러한 코드는 전술한 기능들을 정의한 함수 등과 관련된 기능적인 코드(Function Code)를 포함할 수 있고, 전 술한 기능들을 컴퓨터의 프로세서가 소정의 절차대로 실행시키는데 필요한 실행 절차 관련 제어 코드를 포함할 수도 있다. 또한, 이러한 코드는 전술한 기능들을 컴퓨터의 프로세서가 실행시키는데 필요한 추가 정보나 미디어가 컴퓨터 의 내부 또는 외부 메모리의 어느 위치(주소 번지)에서 참조 되어야 하는지에 대한 메모리 참조 관련 코드를 더 포함할 수 있다. 또한, 컴퓨터의 프로세서가 전술한 기능들을 실행시키기 위하여 원격(Remote)에 있는 어떠한 다른 컴퓨터나 서 버 등과 통신이 필요한 경우, 코드는 컴퓨터의 프로세서가 컴퓨터의 통신 모듈을 이용하여 원격(Remote)에 있는 어떠한 다른 컴퓨터나 서버 등과 어떻게 통신해야만 하는지, 통신 시 어떠한 정보나 미디어를 송수신해야 하는 지 등에 대한 통신 관련 코드를 더 포함할 수도 있다. 이상에서 전술한 바와 같은 프로그램을 기록한 컴퓨터로 읽힐 수 있는 기록매체는, 일 예로, ROM, RAM, CD-ROM, 자기 테이프, 플로피디스크, 광 미디어 저장장치 등이 있으며, 또한 캐리어 웨이브(예를 들어, 인터넷을 통한 전송)의 형태로 구현되는 것도 포함할 수 있다. 또한 컴퓨터가 읽을 수 있는 기록매체는 네트워크로 연결된 컴퓨터 시스템에 분산되어, 분산방식으로 컴퓨터가 읽을 수 있는 코드가 저장되고 실행될 수 있다. 그리고, 본 발명을 구현하기 위한 기능적인(Functional) 프로그램과 이와 관련된 코드 및 코드 세그먼트 등은,"}
{"patent_id": "10-2023-0107548", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "기록매체를 읽어서 프로그램을 실행시키는 컴퓨터의 시스템 환경 등을 고려하여, 본 발명이 속하는 기술분야의 프로그래머들에 의해 용이하게 추론되거나 변경될 수도 있다. 도 5를 통해 설명된 분자 구조 탐색 방법은, 컴퓨터에 의해 실행되는 애플리케이션이나 프로그램 모듈과 같은 컴퓨터에 의해 실행 가능한 명령어를 포함하는 기록 매체의 형태로도 구현될 수 있다. 컴퓨터 판독 가능 매체는 컴퓨터에 의해 액세스될 수 있는 임의의 가용 매체일 수 있고, 휘발성 및 비휘발성 매체, 분리형 및 비분리형 매체를 모두 포함한다. 또한, 컴퓨터 판독가능 매체는 컴퓨터 저장 매체를 모두 포함할 수 있다. 컴퓨터 저장 매체는 컴퓨터 판독가능 명령어, 데이터 구조, 프로그램 모듈 또는 기타 데이터와 같은 정보의 저장을 위한 임 의의 방법 또는 기술로 구현된 휘발성 및 비휘발성, 분리형 및 비분리형 매체를 모두 포함한다. 전술한 분자 구조 탐색 방법은, 단말기에 기본적으로 설치된 애플리케이션(이는 단말기에 기본적으로 탑재된 플 랫폼이나 운영체제 등에 포함된 프로그램을 포함할 수 있다)에 의해 실행될 수 있고, 사용자가 애플리케이션 스 토어 서버, 애플리케이션 또는 해당 서비스와 관련된 웹 서버 등의 애플리케이션 제공 서버를 통해 마스터 단말 기에 직접 설치한 애플리케이션(즉, 프로그램)에 의해 실행될 수도 있다. 이러한 의미에서, 전술한 분자 구조 탐색 방법은 단말기에 기본적으로 설치되거나 사용자에 의해 직접 설치된 애플리케이션(즉, 프로그램)으로 구현 되고 단말기에 등의 컴퓨터로 읽을 수 있는 기록매체에 기록될 수 있다."}
{"patent_id": "10-2023-0107548", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "전술한 본 발명의 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가 지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본 발명의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으 로 해석되어야 한다. 이상의 설명은 본 개시의 기술 사상을 예시적으로 설명한 것에 불과한 것으로서, 본 개시가 속하는 기술 분야에 서 통상의 지식을 가진 자라면 본 기술 사상의 본질적인 특성에서 벗어나지 않는 범위에서 다양한 수정 및 변형 이 가능할 것이다. 또한, 본 실시예들은 본 개시의 기술 사상을 한정하기 위한 것이 아니라 설명하기 위한 것이 므로 이러한 실시예에 의하여 본 기술 사상의 범위가 한정되는 것은 아니다. 본 개시의 보호 범위는 아래의 청 구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술 사상은 본 개시의 권리 범위에 포함 되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2023-0107548", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 따른 분자 구조 탐색 장치의 블록도이다. 도 2a는 입력데이터를 만들기 위해 H2O 분자와 CH6BN 분자에서 중심원자를 각각 고정하고 주변 원자의 위치를 변형한 분자 구조의 모식도이다. 도 2b는 H2O 분자에서 H 원자의 위치가 x, y, z좌표축에서 달라짐에 따라 H2O 분자의 총에너지 값이 달라지는 경향을 표현한 그래프이다. 도 3a는 예측 모델의 학습과정을 표현한 개념도이다. 도 3b는 예측 모델의 학습과정에서 제약함수를 오차함수로 반영하는 내용을 포함하는 흐름도이다. 도 4a는 탐색부에서 분자의 총에너지 값이 최소값에 이를 때까지 입력값을 탐색하는 내용에 대한 흐름도이다. 도 4b는 탐색부에서 분자의 총에너지 값이 최소값에 이를 때까지 입력값을 탐색하는 과정을 표현한 그래프이다. 도 5는 다른 실시예에 따른 분자 구조 탐색 방법의 흐름도이다. 도 6은 또 다른 실시예에 따른 컴퓨팅 시스템의 구성도이다. 도 7은 또 다른 실시예에 따른 클라이언트-서버의 컴퓨터 시스템의 구성도이다."}
