{"patent_id": "10-2023-0132270", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0049619", "출원번호": "10-2023-0132270", "발명의 명칭": "보정 마스크 생성을 위한 시스템, 장치, 방법 및 컴퓨터 프로그램", "출원인": "세이지 주식회사", "발명자": "윤석호"}}
{"patent_id": "10-2023-0132270", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "보정 마스크를 생성하는 시스템에서,제1 이미지 및 제1 마스크에 기초하여 보정 마스크 생성 모델을 학습하는 학습기; 및상기 보정 마스크 생성 모델을 이용하여, 입력 이미지 및 입력 마스크로부터 상기 보정 마스크를 생성하는 생성기를 포함하며,상기 학습기는,상기 제1 마스크를 수신하고, 상기 제1 마스크를 변환 마스크(converted mask)로 변환하는 마스크 변환기;상기 제1 이미지 및 상기 변환 마스크를 수신하고, 상기 변환 마스크를 이용하여 상기 제1 이미지를 마스킹된(masked) 이미지로 변환하며, 상기 마스킹된 이미지 및 상기 변환 마스크를 연결(concatenate)하여 제1 다채널데이터 세트를 생성하는 제1 연산기;상기 제1 다채널 데이터 세트를 수신하고, 상기 마스킹된 이미지 중 변환 마스크 영역에 대응하는 영역의 픽셀값들을 재구성한 제2 이미지를 생성하는 이미지 변환기;상기 제1 마스크를 수신하고, 상기 제1 마스크 중 제1 마스크 영역을 포함하는 영역에 대응하는 경계 상자 영역을 포함하는 경계 상자 마스크를 생성하는 마스크 추출기;상기 제2 이미지 및 상기 경계 상자 마스크를 수신하고, 상기 제2 이미지 및 상기 경계 상자 마스크를 연결(concatenate)하여 제2 다채널 데이터 세트를 생성하는 제2 연산기; 및상기 제2 다채널 데이터 세트를 이용하여 상기 경계 상자 영역 내의 적어도 일부 영역에 대응하는 제2 마스크영역을 포함하는 제2 마스크를 생성하는 마스크 생성기를 포함하는, 시스템."}
{"patent_id": "10-2023-0132270", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서, 상기 학습기는,상기 제1 마스크와 상기 제2 마스크를 비교하여 손실(loss)을 산출하는 판별기를 더 포함하는, 시스템."}
{"patent_id": "10-2023-0132270", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서, 상기 학습기는 상기 손실에 기초하여 상기 보정 마스크 생성 모델을 학습하는, 시스템."}
{"patent_id": "10-2023-0132270", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2 항에 있어서, 상기 판별기는,상기 제1 마스크와 상기 제2 마스크를 비교하여, GAN(생성적 적대 신경망, generative adversarial network)손실을 산출하는 제1 판별기; 및상기 제1 마스크와 상기 제2 마스크를 비교하여, NLL(음의 로그 가능도, negative log-likelihood) 손실을 산출하는 제2 판별기를 포함하는, 시스템."}
{"patent_id": "10-2023-0132270", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1 항에 있어서, 상기 입력 이미지는 정상 이미지 및 결함 이미지 중 적어도 하나인, 시스템."}
{"patent_id": "10-2023-0132270", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1 항에 있어서, 상기 경계 상자 영역은 직사각 또는 정사각 형태인, 시스템.공개특허 10-2025-0049619-3-청구항 7 제1 항에 있어서, 상기 생성기는,상기 입력 마스크를 이용하여 입력 경계 상자 마스크를 생성하고, 상기 입력 이미지 및 상기 입력 경계 상자 마스크를 연결하여 입력 데이터 세트를 생성하며, 상기 입력 데이터 세트를 이용하여 상기 보정 마스크를 생성하는, 시스템."}
{"patent_id": "10-2023-0132270", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7 항에 있어서,상기 경계 상자 마스크 중 상기 입력 마스크의 입력 마스크 영역에 대응하는 영역은 경계 상자 마스크 영역에포함되는, 시스템."}
{"patent_id": "10-2023-0132270", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "보정 마스크를 생성하는 장치에서,적어도 하나의 인스트럭션(instruction)을 저장하는 메모리; 및상기 메모리 상에 저장된 상기 인스트럭션에 응답하여 상기 보정 마스크를 생성하기 위한 적어도 하나의 프로세스를 수행하는 프로세서를 포함하며,상기 프로세서는, 제1 이미지 및 제1 마스크를 수신하고, 상기 제1 마스크를 변환 마스크로 변환하며, 상기 제1마스크를 이용하여 상기 제1 이미지를 마스킹된(masked) 이미지로 변환하고, 상기 마스킹된 이미지 및 상기 제1마스크를 연결(concatenate)하여 제1 다채널 데이터 세트를 생성하며, 상기 마스킹된 이미지 중 변환 마스크 영역에 대응하는 영역의 픽셀 값들을 재구성한 제2 이미지를 생성하고, 상기 제1 마스크 중 제1 마스크 영역을 포함하는 영역에 대응하는 경계 상자 영역을 포함하는 경계 상자 마스크를 생성하며, 상기 제2 이미지 및 상기 경계 상자 마스크를 연결하여 제2 다채널 데이터 세트를 생성하고, 상기 제2 다채널 데이터 세트를 이용하여 상기경계 상자 영역 내의 적어도 일부 영역에 대응하는 제2 마스크 영역을 포함하는 제2 마스크를 생성하는, 장치."}
{"patent_id": "10-2023-0132270", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "컴퓨터 판독 가능 매체에 저장된 컴퓨터 프로그램으로서, 컴퓨터 시스템에 의해 실행될 때, 상기 컴퓨터 시스템이,제1 이미지 및 제1 마스크에 기초하여 보정 마스크 생성 모델을 학습하는 단계; 및상기 보정 마스크 생성 모델을 이용하여, 입력 이미지 및 입력 마스크로부터 상기 보정 마스크를 생성하는 단계를 포함하는 방법을 수행하도록 하는 명령어를 포함하며,상기 보정 마스크 생성 모델을 학습하는 단계는,상기 제1 마스크를 변환 마스크로 변환하는 단계;상기 제1 마스크를 이용하여 상기 제1 이미지를 마스킹된(masked) 이미지로 변환하며, 상기 마스킹된 이미지 및상기 변환 마스크를 연결(concatenate)하여 제1 다채널 데이터 세트를 생성하는 단계;상기 마스킹된 이미지 중 변환 마스크 영역에 대응하는 영역의 픽셀 값들을 재구성한 제2 이미지를 생성하는 단계;상기 제1 마스크 중 제1 마스크 영역을 포함하는 영역에 대응하는 경계 상자 영역을 포함하는 경계 상자 마스크를 생성하는 단계;상기 제2 이미지 및 상기 경계 상자 마스크를 연결하여 제2 다채널 데이터 세트를 생성하는 단계; 및상기 제2 다채널 데이터 세트를 이용하여 상기 경계 상자 영역 내의 적어도 일부 영역에 대응하는 제2 마스크영역을 포함하는 제2 마스크를 생성하는 단계;를 포함하는, 컴퓨터 프로그램."}
{"patent_id": "10-2023-0132270", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 일 실시예에 따른 시스템은, 보정 마스크를 생성하는 시스템으로서, 제1 이미지 및 제1 마스크에 기초 하여 보정 마스크 생성 모델을 학습하는 학습기 및 보정 마스크 생성 모델을 이용하여, 입력 이미지 및 입력 마 스크로부터 보정 마스크를 생성하는 생성기를 포함한다. 학습기는, 제1 마스크를 수신하고, 제1 마스크를 변환 (뒷면에 계속)"}
{"patent_id": "10-2023-0132270", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 보정 마스크 생성을 위한 시스템, 장치, 방법 및 컴퓨터 프로그램에 관한 것으로, 보다 상세하게는, 입력 마스크의 마스크 영역 내에 보정 마스크를 생성할 수 있는 보정 마스크 생성을 위한 시스템, 장치, 방법 및 컴퓨터 프로그램에 관한 것이다."}
{"patent_id": "10-2023-0132270", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근, 인공지능, 빅데이터, 사물 인터넷, 클라우드 컴퓨팅 등과 같은 기술들에 대한 관심이 높아지고 있다. 여 기서, 인공지능(Artificial Intelligent, AI)이란 인간의 지능이 필요하거나 인간이 분석할 수 있는 것보다 규 모가 큰 데이터를 이용하여 추론, 학습 및 행동할 수 있는 기술을 말한다. 최근 컴퓨팅 효율성 개선에 따라 인 공지능을 기반으로 한 컴퓨터 비전 기술이 빠르게 발전하고 있는 추세다. 컴퓨터 비전(Computer Vision) 기술은 컴퓨터와 시스템을 통해 이미지, 비디오 및 기타 시각적 입력에서 의미 있는 정보를 추출한 다음 이러한 정보를 바탕으로 작업을 실행하거나 추천하는 기술이다. 한편, 제품 생산에 있어서 생산품에 결함이 존재하는지 여부에 대한 검수가 필요하다. 최근, 생산라인의 자동화 등 비용 절감을 위한 노력들이 이루어지고 있으며, 이에 따라, 생산품의 품질 검수 자동화에 대한 관심도 높아 지고 있다. 예를 들면, 컴퓨터 비전을 기계나 로봇, 프로세서 또는 품질 제어에 응용하는 머신 비전(machine vision) 기술이 급격히 발전하는 추세이다."}
{"patent_id": "10-2023-0132270", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시의 일 목적은 보정 마스크를 생성하는데 사용되는 보정 마스크 생성 모델을 학습할 수 있는 보정 마스크 생성을 위한 시스템, 장치, 방법 및 컴퓨터 프로그램을 제공하는 것이다. 본 개시의 다른 일 목적은 적은 개수의 기준 이미지를 이용하여 보정 마스크 생성 모델을 학습할 수 있는 보정 마스크 생성을 위한 시스템, 장치, 방법 및 컴퓨터 프로그램을 제공하는 것이다. 본 개시의 또 다른 일 목적은 정상 이미지를 이용하지 않고도 보정 마스크 생성 모델을 학습할 수 있는 보정 마 스크 생성을 위한 시스템, 장치, 방법 및 컴퓨터 프로그램을 제공하는 것이다. 본 개시의 또 다른 일 목적은 사용자가 입력한 이미지 및 마스크의 결함 종류에 기반하여 학습함으로써 추론 시 에도 자연스러운 결함 종류에 대응하는 마스크를 생성하기 위한 시스템, 장치, 방법 및 컴퓨터 프로그램을 제공 하는 것이다. 본 개시의 또 다른 일 목적은 사용자가 러프하게(또는, 개략적으로) 입력한 마스크에 대해 입력된 마스크에 포 함된 결함의 종류와 결함의 구조를 분석하여 입력 마스크 영역 내에 자연스러운 마스크를 생성하기 위한 시스템, 장치, 방법 및 컴퓨터 프로그램을 제공하는 것이다. 본 개시의 목적들은 이상에서 언급한 목적들로 제한되지 않으며, 언급되지 않은 또 다른 목적들은 아래의 기재 로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0132270", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시예에 따른 시스템은, 보정 마스크를 생성하는 시스템으로서, 제1 이미지 및 제1 마스크에 기 초하여 보정 마스크 생성 모델을 학습하는 학습기 및 상기 보정 마스크 생성 모델을 이용하여, 입력 이미지 및 입력 마스크로부터 상기 보정 마스크를 생성하는 생성기를 포함할 수 있다. 상기 학습기는, 상기 제1 마스크를 수신하고, 상기 제1 마스크를 변환 마스크(converted mask)로 변환하는 마스크 변환기, 상기 제1 이미지 및 상 기 변환 마스크를 수신하고, 상기 변환 마스크를 이용하여 상기 제1 이미지를 마스킹된(masked) 이미지로 변환 하며, 상기 마스킹된 이미지 및 상기 변환 마스크를 연결(concatenate)하여 제1 다채널 데이터 세트를 생성하는 제1 연산기, 상기 제1 다채널 데이터 세트를 수신하고, 상기 마스킹된 이미지 중 변환 마스크 영역에 대응하는 영역의 픽셀 값들을 재구성한 제2 이미지를 생성하는 이미지 변환기, 상기 제1 마스크를 수신하고, 상기 제1 마 스크 중 제1 마스크 영역을 포함하는 영역에 대응하는 경계 상자 영역을 포함하는 경계 상자 마스크를 생성하는 마스크 추출기, 상기 제2 이미지 및 상기 경계 상자 마스크를 수신하고, 상기 제2 이미지 및 상기 경계 상자 마 스크를 연결(concatenate)하여 제2 다채널 데이터 세트를 생성하는 제2 연산기 및 상기 제2 다채널 데이터 세트를 이용하여 상기 경계 상자 영역 내의 적어도 일부 영역에 대응하는 제2 마스크 영역을 포함하는 제2 마스크를 생성하는 마스크 생성기를 포함할 수 있다. 본 개시의 일 실시예에 따른 장치는, 보정 마스크를 생성하는 장치로서, 적어도 하나의 인스트럭션 (instruction)을 저장하는 메모리 및 상기 메모리 상에 저장된 상기 인스트럭션에 응답하여 상기 보정 마스크를 생성하기 위한 적어도 하나의 프로세스를 수행하는 프로세서를 포함할 수 있다. 상기 프로세서는, 제1 이미지 및 제1 마스크를 수신하고, 상기 제1 마스크를 변환 마스크로 변환하며, 상기 제1 마스크를 이용하여 상기 제1 이미지를 마스킹된(masked) 이미지로 변환하고, 상기 마스킹된 이미지 및 상기 제1 마스크를 연결(concatenat e)하여 제1 다채널 데이터 세트를 생성하며, 상기 마스킹된 이미지 중 변환 마스크 영역에 대응하는 영역의 픽 셀 값들을 재구성한 제2 이미지를 생성하고, 상기 제1 마스크 중 제1 마스크 영역을 포함하는 영역에 대응하는 경계 상자 영역을 포함하는 경계 상자 마스크를 생성하며, 상기 제2 이미지 및 상기 경계 상자 마스크를 연결하 여 제2 다채널 데이터 세트를 생성하고, 상기 제2 다채널 데이터 세트를 이용하여 상기 경계 상자 영역 내의 적 어도 일부 영역에 대응하는 제2 마스크 영역을 포함하는 제2 마스크를 생성할 수 있다. 본 개시의 일 실시예에 따른 컴퓨터 프로그램은, 컴퓨터 판독 가능 매체에 저장된 컴퓨터 프로그램으로서, 컴퓨 터 시스템에 의해 실행될 때, 상기 컴퓨터 시스템이, 제1 이미지 및 제1 마스크에 기초하여 보정 마스크 생성 모델을 학습하는 단계 및 상기 보정 마스크 생성 모델을 이용하여, 입력 이미지 및 입력 마스크로부터 상기 보 정 마스크를 생성하는 단계를 포함하는 방법을 수행하도록 하는 명령어를 포함할 수 있다. 기타 실시예의 구체적인 사항들은 발명의 설명 및 도면에 포함되어 있다."}
{"patent_id": "10-2023-0132270", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 실시예에 따른 보정 마스크 생성을 위한 시스템, 장치, 방법 및 컴퓨터 프로그램에 있어서, 보정 마 스크 생성 시스템(또는, 전자 장치)은 보정 마스크 생성 모델을 학습하고, 학습된 보정 마스크 생성 모델을 이 용하여 보정 마스크를 생성할 수 있다. 여기서, 보정 마스크 생성 시스템(또는, 전자 장치)은 하나의 제1 이미 지(예를 들어, 결함 이미지 세그먼트를 포함하는 하나의 제1 이미지) 및 이에 상응하는 제1 마스크를 이용하여 보정 마스크 생성 모델을 학습할 수 있다. 즉, 본 개시의 실시예에 따른 보정 마스크 생성 시스템(또는, 전자 장치)은 기준 이미지(또는, 제1 이미지)로서 하나의 기준 이미지만을 이용하여 보정 마스크 생성 모델을 학습하 므로, 입력 데이터로서 정상 이미지를 이용하지 않고도 학습 동작을 수행할 수 있으며, 상대적으로 적은 개수의 기준 이미지를 이용하여 학습 동작을 수행할 수 있다. 이에 따라, 보정 마스크 생성 모델의 학습 동작이 보다 단순화될 수 있으며, 학습 시간이 최소화될 수 있다. 또한, 본 개시의 실시예들에 따른 보정 마스크 생성 시스 템(또는, 전자 장치)은 복수 개의 제1 이미지(또는, 기준 이미지)들 및 이에 상응하는 복수 개의 제1 마스크들 에 형성되는 결함의 종류에 기반하여 보정 마스크 생성 모델을 학습하므로, 다양한 결함에 대한 학습을 동시에 수행할 수 있다. 이와 같은 학습 과정에 기반하여, 보정 마스크 생성 시스템(또는, 전자 장치)이 학습(또는, 생성)된 보정 마스 크 생성 모델을 이용하여 보정 마스크(출력 마스크)를 생성함에 있어서, 보정 마스크 생성 시스템(또는, 전자 장치)은 하나의 입력 이미지 및 입력 마스크만을 이용하여 출력 마스크(또는, 보정 마스크)를 생성할 수 있다. 이에, 보정 마스크 생성 모델의 보정 마스크 생성 동작이 보다 단순화될 수 있고, 적은 개수의 입력 이미지 및 입력 마스크로부터 많은 개수의 보정 마스크(출력 마스크)가 생성될 수 있다. 또한, 본 개시의 실시예들에 따른 보정 마스크 생성을 위한 시스템, 장치, 방법 및 컴퓨터 프로그램에 있어서, 본 개시의 실시예에 따른 보정 마스크 생성 시스템(또는, 전자 장치)은 유저(또는, 사용자)가 러프하게(또는, 개략적으로) 입력한 입력 마스크 내부의 피사체의 구조와 결함의 종류를 고려하여 정밀한 출력 마스크(또는, 보 정 마스크)를 생성할 수 있다. 즉, 본 개시의 실시예에 따른 보정 마스크 생성 시스템(또는, 전자 장치)은 입력 마스크에 포함된 결함의 종류와 피사체(또는, 결함 이미지 세그먼트)의 구조에 기반하여 유저(또는, 사용자)가 러프하게(또는, 개략적으로) 그린(또는, 입력한) 영역(또는, 마스크 영역) 내부에 가장 자연스러운(또는, 있을 법한) 보정 마스크(또는, 출력 마스크)를 생성(또는, 형성)할 수 있다. 다만, 본 개시의 효과는 이상에서 예시된 내용에 의해 제한되는 것이 아니며, 더욱 다양한 효과들이 본 개시 내 에 포함되어 있으며, 본 개시의 사상 및 영역으로부터 벗어나지 않는 범위에서 다양하게 확장될 수 있을 것이다."}
{"patent_id": "10-2023-0132270", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "각 도면을 설명하면서 유사한 참조부호를 유사한 구성요소에 대해 사용하였다. 첨부된 도면에 있어서, 구조물들 의 치수는 본 개시의 명확성을 위하여 실제보다 확대하여 도시한 것이다. 도면에서 나타난 각 구성요소의 면적 및 두께는 설명의 편의를 위해 도시된 것이며, 본 개시에 도시된 구성요소의 면적 및 두께에 반드시 한정되는 것은 아니다. 제1, 제2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소들은 상기 용어들에 의 해 한정되어서는 안 된다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된 다. 예를 들어, 본 개시의 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유 사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 개시에서, \"포함하다\", \"가지다\", \"이루어진다\" 등의 용어는 명세서 상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 개시의 여러 실시예들의 각각 특징들이 부분적으로 또는 전체적으로 서로 결합 또는 조합 가능하고, 기술적 으로 다양한 연동 및 구동이 가능하며, 각 실시예들이 서로에 대하여 독립적으로 실시 가능할 수도 있고 연관 관계로 함께 실시할 수도 있다. 이하에서는 첨부된 도면을 참조하여 본 개시의 다양한 실시예들을 보다 상세히 설명하고자 한다. 도면 상의 동 일한 구성요소에 대해서는 동일한 참조부호를 사용하고 동일한 구성요소에 대해서는 중복된 설명은 생략한다. <본 개시의 실시예들에 따른 장치> 도 1은 본 개시의 다양한 실시예들에 따른 전자 장치를 나타내는 블록도이다. 도 1을 참조하면, 본 개시의 실시예들에 따른 전자 장치는 프로세서, 통신 모듈, 입력부, 표시부 및 메모리를 포함할 수 있다. 프로세서는, 예를 들어, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일 실시예에서, 데이터 처리 또는 연산의 적어도 일부로서, 프로세서 는 다른 구성요소(예: 입력부 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메모리에 저장할 수 있다. 예를 들어, 메모리는 휘발성 메모리 또는 비휘발성 메모리를 포함할 수 있다. 일 실시예에서, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있 다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서를 포함하는 경우, 보조 프로세서는 메인 프 로세서보다 저전력을 사용하거나, 지정된 기능에 특화되도록 설정될 수 있다. 실시예에 따라, 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있다. 프로세서는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습 (machine learning)을 통해 생성될 수 있다. 기계 학습은 다수의 파라미터로 구성된 모델을 이용하여 주어진 데 이터로 파라미터를 최적화하는 학습을 의미한다. 이러한 학습은, 예를 들어, 인공지능이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버를 통해 수행될 수도 있다. 인공지능 학습 패러다임은 다양한 학습 방식 및 접근법을 의미하는데, 예를 들어, 지도 학습(supervised learning), 비지도 학습(unsupervised learning), 준지도 학습(semisupervised learning), 강화 학습(reinforcement learning), 자기 주도 학습 (self-supervised learning) 또는 전이 학습(transfer learning)을 포함할 수 있다. 인공지능 학습 알고리즘은, 예를 들어, 선형 회귀(linear regression), 로지스틱 회귀(logistic regression), 의사 결정 트리 (decision trees), 랜덤 포레스트(random forest), 서포트 벡터 머신(support vector machines, SVM) 또는 인 공 신경망을 포함할 수 있으나, 전술한 예에 한정되지 않는다. 인공 신경망은 심층 신경망(deep neural network, DNN), 합성곱 신경망(convolutional neural network, CNN), 심층 합성곱 신경망(deep convolutional neural network, DCNN), 순환 신경망(recurrent neural network, RNN), 생성적 적대 신경망(generative adversarial networks, GAN), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks), 순방향 알고리즘 (feedforward algorithm) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인 공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공지능 모델은 하드웨어 구조 이외에, 추가 적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치 외의 전자 장치 또는 서버) 간의 직접 (예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서와 독립적으로 운영되고, 직접 통신(예: 유선 통신) 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일 실시예에서, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 블루투스(Bluetooth쪠), Wi-Fi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워크 또는 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트 워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크를 통하여 외부 전자 장치 와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 입력부는 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치의 외부(예: 사용자)로부터 수신할 수 있다. 입력부는, 예를 들면, 마이크, 마우스, 키보드, 키(예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 표시부는 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 표시부는, 예를 들면, 디스플레이(예: 표시 패널), 홀로그램 장치 또는 프로젝터를 포함할 수 있으며, 해당 장치를 제어하기 위 한 제어 회로를 더 포함할 수 있다. 추가적으로, 표시부는 사용자로부터 터치 입력을 인식하기 위하여 터 치 스크린을 더 포함할 수 있다. 일 실시예에서, 표시부는 사용자의 입력(예: 터치 입력 등)을 수신하기 위한 GUI(graphic user interface)를 표시할 수 있다. 메모리는 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 입력부)에 의해 사용되 는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및 이와 관련된 명 령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다.일 실시예에서, 메모리는 학습된 모델(예: 프로세서 또는 별도의 서버를 통해 학습된 모델)을 저장할 수 있다. 예를 들어, 메모리 상에 저장된 프로그램 중 적어도 일부는 학습된 모델일 수 있다. 이에 따라, 프로세서는 프로그램을 실행하여 학습된 모델을 이용할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플 리케이션을 포함할 수 있다. <본 개시의 실시예들에 따른 시스템> 도 2는 본 개시의 다양한 실시예들에 따른 보정 마스크 생성 시스템을 나타내는 블록도이다. 도 2를 참조하면, 본 개시의 실시예들에 따른 보정 마스크 생성 시스템은 학습기 및 생성기를 포함할 수 있다. 학습기는 인공지능 모델을 학습하는 구성으로서, 학습기는 보정 마스크 생성 모델을 학습할 수 있다. 여기서, 보정 마스크 생성 모델은 입력 이미지와 입력 마스크를 연결하여 입력 데이터 세트를 생성하고, 상기 입력 이미지 중 입력 마스크의 지정된 영역(예: 입력 마스크 영역)에 대응하는 영역을 포함하는 경계 상자 영역 (또는, 바운딩 박스(bounding box) 영역) 내의 적어도 일부 영역에 대응하는 보정 마스크(또는, 출력 마스크)를 생성하기 위한 인공지능 모델일 수 있다. 즉, 본 개시의 실시예들에 따른 보정 마스크 생성 시스템(예를 들어, 생성기)은 학습기에 의해 학습(또는, 생성)된 보정 마스크 생성 모델을 이용하여, 보정 마스크 를 생성할 수 있다. 본 개시에서, 경계 상자 영역(또는, 바운딩 박스(bounding box) 영역)은 컴퓨터 비전 기술 중 특히 객체 탐지 (object detection)와 관련하여 사용되는 개념으로, 경계 상자를 사용함으로써 특정 사물을 탐지하여 모델을 효 율적으로 학습할 수 있다. 경계 상자 영역(또는, 바운딩 박스 영역)은, 객체 탐지 모델에서 타겟 위치를 특정하 기 위해 사용될 수 있다. 예를 들어, 경계 상자는 X축과 Y축 상의 좌표 값을 이용하여 표현될 수 있다. 일 예로, 객체(또는, 타겟)을 둘러싸는 경계 상자 영역은 사각형으로 표현(예: (X 최소값, Y 최소값, X 최대값, Y 최대값))될 수 있다. 일 실시예에서, 학습기는 제1 이미지(또는, 기준 이미지) 및 제1 이미지에 상응하는 마스크(이하, \"제1 마 스크\"라 함)를 수신하고, 제1 이미지와 제1 마스크에 기초하여 보정 마스크 생성 모델을 학습할 수 있다. 예를 들어, 제1 이미지는 적어도 일부 영역에서 결함 이미지 세그먼트(segment)를 가지는 이미지(또는, 결함 이미 지)일 수 있다. 여기서, 결함 이미지 세그먼트란 특정 결함 유형(예: 얼룩(stain), 스크래치(scratch), 찍힘 (dent), 깨짐(crack), 그을음(soot) 등)에 대응하는 결함을 포함하는 이미지 세그먼트일 수 있다. 실시예에 따 라, 제1 이미지는 실제 적어도 일부에서 결함을 가지는 생산품의 이미지일 수 있으나, 본 개시의 실시예가 이에 제한되는 것은 아니다. 일 실시예에서, 학습기는 제1 이미지로서 하나의 제1 이미지, 예를 들어, 결함 이미지 세그먼트를 가지는 하나의 제1 이미지만을 이용하여 보정 마스크 생성 모델을 학습할 수 있다. 즉, 학습기는 입력 데이터로서 정상 이미지를 이용하지 않고도 하나의 제1 이미지와 제1 마스크만을 이용하여 보정 마스크 생성 모델을 학습할 수 있다. 생성기는 학습기에 의해 학습(또는, 생성)된 보정 마스크 생성 모델을 이용하여 보정 마스크(또는, 출력 마스크)를 생성할 수 있다. 예를 들어, 생성기는 입력 이미지와 입력 마스크를 수신하고, 상기 입력 이미지와 입력 마스크를 연결(concatenate)함으로써 입력 데이터 세트(dataset)를 생성하며, 입력 데이터 세트 에 포함되는 상기 입력 이미지 중 입력 마스크 영역에 대응하는 영역을 포함하는 경계 상자 영역 내의 적어도 일부 영역에 대응하는 보정 마스크(또는, 출력 마스크)를 생성할 수 있다. 여기서, 생성기의 동작에 따라, 보정 마스크는 적어도 일부 영역에서 입력 마스크와 상이한 이미지(또는, 상이한 이미지 세그먼트, 데이터)를 가질 수 있다. 예를 들어, 입력 마스크의 지정된 영역(예: 입력 마스크 영역)에 대응하는 영역 중 적어도 일부 영역, 예를 들어, 입력 마스크 영역 중 보정 마스크의 지정된 영역(예: 보정 마스크 영역)과 중첩하는 영역을 제외한 영역에서, 입력 마스크와 보정 마스크는 상이한 픽셀 값을 가질 수 있다. 일 실시예에서, 생성기는 상술한 입력 이미지 중 입력 마스크 영역에 대응하는 영역을 포함하는 경계 상자 영역 내의 적어도 일부 영역에 대응하고 일정한 형상을 가지며 특정 결함 유형(예: 얼룩(stain), 스크래치 (scratch), 찍힘(dent), 깨짐(crack), 그을음(soot) 등)에 따른 결함이 포함되는 가상의 마스크 세그먼트(예:가상의 결함 마스크 세그먼트)를 생성할 수 있다. 여기서, 가상의 마스크 세그먼트는 경계 상자 영역 내의 적어 도 일부 영역에 대응하는 영역에서는 결함 클래스(예: 얼룩 결함 클래스, 스크래치 결함 클래스, 찍힘 결함 클 래스, 그을음 결함 클래스 등) 인덱스(또는, 결함 유형 인덱스)로 채워지고, 경계 상자 영역 내의 적어도 일부 영역에 대응하는 영역 밖의 영역에서는 0으로 채워진 인덱스 마스크(index mask)일 수 있다. 한편, 이상에서 기술된 결함 이미지(또는, 가상 결함 이미지)란 상기 양품으로 판별된 생산품의 이미지와 적어 도 일부에서 상이한 픽셀 값을 가지는 이미지를 의미할 수 있다. 예를 들어, 결함 이미지(또는, 가상 결함 이미 지) 중 적어도 일부는 상술한 결함 유형들(예: 얼룩(stain), 스크래치(scratch), 찍힘(dent), 깨짐(crack), 그 을음(soot) 등) 중 적어도 하나에 대응하는 이미지 세그먼트(예: 결함 이미지 세그먼트)를 포함할 수 있다. 이와 같이, 본 개시의 실시예들에 따른 보정 마스크 생성 시스템은 학습기를 통해 보정 마스크 생성 모델을 학습하고, 생성기를 통해 보정 마스크 생성 모델을 이용하여 보정 마스크 생성 시스템에 입력 된 이미지(또는, 입력 이미지) 및 마스크(또는, 입력 마스크)를 기초로 보정 마스크(또는, 출력 마스크)를 생성 할 수 있다. 보정 마스크 생성 시스템, 예를 들어, 보정 마스크 생성 시스템에 포함되는 학습기의 보정 마스 크 생성 모델의 학습 동작 및 생성기의 보정 마스크 생성 동작에 대해서는 도 3 내지 도 8을 참조하여 보 다 구체적으로 설명하기로 한다. 실시예에 따라, 보정 마스크 생성 시스템은 학습기 및 생성기 외에 다른 구성을 더 포함할 수 있다. 예를 들어, 보정 마스크 생성 시스템은 통신 모듈(예: 도 1의 통신 모듈), 입력부(예: 도 1의 입력부), 표시부(예: 도 1의 표시부) 또는 메모리(예: 도 1의 메모리)를 더 포함할 수 있다. 일 예에서, 학습기를 통하여 학습된 모델(예: 보정 마스크 생성 모델)이 보정 마스크 생성 시스템의 메 모리(예: 도 1의 메모리)에 저장될 수 있다. 일 실시예에서, 도 1 및 도 2를 참조하면, 도 2의 보정 마스크 생성 시스템은 도 1을 참조하여 설명한 전 자 장치이거나 및/또는 전자 장치로서 구현될 수 있다. 예를 들어, 도 2에 도시된 학습기 및 생성기의 동작은 도 1에 도시된 프로세서에 의해 수행될 수 있다. 일 예로, 보정 마스크 생성 시스템은 프로세서(예: CPU)를 포함하며, 보정 마스크 생성 시 스템의 프로세서가 보정 마스크 생성 모델, 예를 들어, 메모리 상에 저장된 보정 마스크 생성 모델을 이용하여 보정 마스크 생성 시스템에 입력된 입력 이미지 및 입력 마스크를 기초로 보정 마스크를 생성할 수 있다. 다른 예로, 도 2에 도시된 학습기 및 생성기는 도 1에 도시된 프로세서에 포함되는 적어도 하나 의 프로세서이거나 및/또는 상기 적어도 하나의 프로세서에 의해 수행될 수 있다. 예를 들어, 학습기 및 생성기는 프로세서에 포함되는 적어도 하나의 보조 프로세서(예: GPU)이거나 및/또는 상기 적어도 하 나의 보조 프로세서에 의해 수행될 수 있다. 일 실시예에서, 학습기는 도 1을 참조하여 설명한 비지도 학습(unsupervised learning)의 학습방식 및 접 근법(또는, 학습 패러다임)에 기반하여 보정 마스크 생성 모델을 학습할 수 있다. 다만, 이는 단순히 예시적인 것으로, 본 개시의 실시예가 이에 제한되는 것은 아니며, 예를 들어, 학습기는 도 1을 참조하여 설명한 다 양한 인공지능 학습 패러다임을 이용하여 인공지능 모델을 학습할 수 있다. 또한, 일 실시예에서, 학습기는 도 1을 참조하여 설명한 인공지능 학습 알고리즘들 중 적어도 하나 및/또 는 인공 신경망들 중 적어도 하나를 이용하여 인공지능 모델을 학습할 수 있다. 예를 들어, 학습기는 합성 곱 신경망(convolutional neural network, CNN), 심층 합성곱 신경망(deep convolutional neural network, DCNN), 이미지 분할 알고리즘, 물체 감지 알고리즘, 생성적 적대 신경망(generative adversarial network, GAN)(또는, 적대적 생성 신경망), 시맨틱(semantic) 분할 알고리즘과 같은 인공지능 학습 알고리즘을 이용하여 보정 마스크 생성 모델을 학습할 수 있다. 일 예로, 학습기는 합성곱 신경망, 심층 합성곱 신경망(예: U- net 등) 및/또는 생성적 적대 신경망을 이용하여 보정 마스크 생성 모델을 학습할 수 있으나, 이는 단순히 예시 적인 것으로, 학습기는 다양한 인공지능 학습 알고리즘을 이용하여 보정 마스크 생성 모델을 학습할 수 있 다. 도 1 및 도 2를 참조하여 설명한 바와 같이, 본 개시의 실시예에 따른 보정 마스크 생성 시스템(또는, 전 자 장치)은 보정 마스크 생성 모델을 학습하고, 학습된 보정 마스크 생성 모델을 이용하여 보정 마스크를 생성할 수 있다. 여기서, 보정 마스크 생성 시스템(또는, 전자 장치)은 하나의 제1 이미지(예를들어, 결함 이미지 세그먼트를 포함하는 하나의 제1 이미지) 및 이에 상응하는 제1 마스크를 이용하여 보정 마 스크 생성 모델을 학습할 수 있다. 즉, 본 개시의 실시예에 따른 보정 마스크 생성 시스템(또는, 전자 장 치)은 기준 이미지(또는, 제1 이미지)로서 하나의 기준 이미지만을 이용하여 보정 마스크 생성 모델을 학 습하므로, 입력 데이터로서 정상 이미지를 이용하지 않고도 학습 동작을 수행할 수 있으며, 상대적으로 적은 개 수의 기준 이미지를 이용하여 학습 동작을 수행할 수 있다. 이에 따라, 보정 마스크 생성 모델의 학습 동작이 보다 단순화될 수 있다. 또한, 본 개시의 실시예에 따른 보정 마스크 생성 시스템(또는, 전자 장치)은 제1 이미지(또는, 기준 이미지) 및 이에 상응하는 제1 마스크에 형성되는 결함의 종류에 기반하여 보정 마스크 생성 모델을 학습하므로, 다양한 결함에 대한 학습을 동시에 수행할 수 있다. 이하에서는, 도 3 내지 도 8을 참조하여, 본 개시의 실시예들에 따른 보정 마스크 생성 시스템(또는, 전자 장치)의 동작(예: 보정 마스크 생성 모델 학습 동작 및/또는 보정 마스크 생성 동작)에 대해 보다 구체적 으로 설명하기로 한다. <학습기의 일 실시예> 도 3은 도 2의 보정 마스크 생성 시스템에 포함되는 학습기의 일 예를 나타내는 블록도이다. 도 4는 도 3의 학습기의 동작의 일 예를 설명하기 위한 도면이다. 도 2 및 도 3을 참조하면, 학습기는 제1 마스크(MSK1)(또는, 기준 마스크)를 제2 마스크(MSK2)(또는, 생성 마스크)로 변환, 즉 제1 마스크(MSK1)로부터 제2 마스크(MSK2)를 생성하는 동작을 반복적으로 수행함에 따라 보 정 마스크 생성 모델을 학습할 수 있다. 실시예에 따라, 도 3에 도시된 학습기의 동작은 인공지능 모델, 예를 들어, 보정 마스크 생성 모델을 학습하기 위한 훈련 동작으로 이해될 수 있다. 일 실시예에서, 학습기는 입력된 제1 이미지(IMG1)와 제1 마스크(MSK1)에 기초하여 보정 마스크 생성 모델 을 학습할 수 있다. 예를 들어, 학습기는 제1 마스크(MSK1)를 이용하여 변환 마스크(CMSK)로 변환하고, 상 기 변환 마스크(CMSK)를 이용하여 제1 이미지(IMG1)를 마스킹된(masked) 이미지로 변환하며, 상기 마스킹된 이 미지 및 상기 변환 마스크(CMSK)를 연결(concatenate)하여 제1 다채널 데이터 세트(MCDS1)를 생성하고, 상기 마 스킹된 이미지 중 변환 마스크 영역에 대응하는 영역의 픽셀 값들을 재구성한 제2 이미지(IMG2)를 생성하며, 상 기 제1 마스크(MSK1)를 이용하여 경계 상자 마스크(BBXMSK)를 생성하고, 상기 제2 이미지(IMG2) 및 상기 경계 상자 마스크(MMBMSK)를 연결(또는, 이용)하여 경계 상자 영역과 중첩하는 제2 마스크 영역을 포함하는 제2 마스 크(MSK2)를 생성(또는, 변환, 산출)하는 동작을 반복적으로 수행하며, 상기 제1 마스크(MSK1) 및 상기 제2 마스 크(MSK2)를 비교하여 손실(loss)을 산출하는 방식을 이용함으로써 보정 마스크 생성 모델을 학습할 수 있다. 예 를 들어, 상기 손실(loss)은 제1 마스크(MSK1) 및 제2 마스크(MSK2) 간의 픽셀 값의 차이를 나타내는 정보(예: 음의 로그 가능도(negative log-likelihood, NLL) 손실), 생성적 적대 신경망(generative adversarial network, GAN) 손실 중 적어도 하나를 포함할 수 있으나, 이는 단순히 예시적인 것으로, 학습기 의해 산출 되는 손실이 이에 제한되는 것은 아니다.여기서, 제1 마스크(MSK1)는 제1 이미지(IMG1)에 상응하며 일정한 크기 및 모양을 가지는 마스크(mask)(또는, 마스크 이미지)일 수 있다. 보다 구체적으로, 도 2를 참조하여 설명한 바 와 같이, 제1 이미지(IMG1)는 적어도 일부 영역에서 결함 이미지 세그먼트(예를 들어, 도 4의 결함 이미지 세그 먼트(DF))를 포함하며, 제1 마스크(MSK1)는 결함 이미지 세그먼트에 대응하는 마스크 영역(이하, \"제1 마스크 영역\"이라고 함)을 포함하는 마스크일 수 있다. 예를 들어, 결함 이미지 세그먼트가 배치되는 영역과 제1 마스 크(MSK1)의 제1 마스크 영역은 중첩할 수 있다. 일 예로, 제1 이미지(IMG1) 상에서 결함 이미지 세그먼트가 배 치(또는, 형성)되는 영역과 제1 마스크(MSK1)의 제1 마스크 영역은 실질적으로 동일한 영역일 수 있다. 이하에서는, 도 2 내지 도 4를 참조하여, 학습기가 제1 이미지(IMG1) 및 제1 마스크(MSK1)를 이용하여 보 정 마스크 생성 모델을 학습하는 것을 기준으로 본 개시의 다양한 실시예들을 설명하기로 한다.일 실시예에서, 학습기는 마스크 변환기, 제1 연산기, 이미지 변환기, 마스크 추출기, 제2 연산기 , 마스크 생성기 및 판별기를 포함할 수 있다. 한편, 도 3에서는 마스크 변환기, 제1 연산 기, 이미지 변환기, 마스크 추출기, 제2 연산기, 마스크 생성기 및 판별기가 각각 별도의 구성인 것으로 도시되어 있으나, 이는 단순히 설명의 편의를 위한 것으로, 본 개시의 실시예가 이 에 제한되는 것은 아니다. 예를 들어, 마스크 변환기, 제1 연산기, 이미지 변환기, 마스크 추출 기, 제2 연산기, 마스크 생성기 및 판별기 중 적어도 일부는 학습기 내에서 일체로구성될 수 있다. 일 실시예에서, 마스크 변환기는 제1 마스크(MSK1)를 이용하여 변환 마스크(CMSK)를 생성(또는, 산출, 출 력)할 수 있다. 예를 들어, 마스크 변환기는 외부(예를 들어, 사용자의 입력)로부터 제1 마스크(MSK1)를 수신한 후, 제1 마스크(MSK1)의 제1 마스크 영역(MA1)과 동일한 변환 마스크 영역(CMA)을 포함하는 변환 마스크 (CMSK)를 생성할 수 있다. 실시예에 따라, 변환 마스크(CMSK)는 제1 마스크(MSK1)가 마스크 변환기에 의해 변환된 마스크로 이해될 수 있다. 일 실시예에서, 제1 마스크(MSK1)는 제1 마스크 영역(MA1) 내에 존재하는 물리적 또는 화학적 결함(예: 얼룩 (stain), 스크래치(scratch), 찍힘(dent), 깨짐(crack), 그을음(soot) 등)의 형태(또는, 형상, 경계선)를 나타 내는 정보일 수 있다. 즉, 제1 이미지(IMG1) 상에 포함되는 결함 이미지 세그먼트의 형태(또는, 형상, 경계선) 와 제1 마스크(MSK1)의 형태(또는, 형상, 경계선)는 실질적으로 동일할 수 있다. 여기서, 상기 지정된 결함의 종류는 기설정된(또는, 사전에 지정된) 것이거나 외부 입력(예: 사용자 입력)에 의해 지정된 것일 수 있으나, 이에 제한되는 것은 아니다. 또한, 실시예에 따라, 전술한 지정된 결함의 종류는 학습기에 입력된 제1 이 미지(IMG1)에 포함되는 결함 이미지 세그먼트와 동일한 종류의 결함일 수 있으나, 이는 단순히 예시적인 것으로, 본 개시의 실시예가 이에 제한되는 것은 아니다. 일 실시예에서, 변환 마스크(CMSK)는 제1 이미지(IMG1)의 대상 이미지 세그먼트(TI) 중 결함 이미지 세그먼트 (DF)에 인접한 영역과 실질적으로 동일한 변환 마스크 영역(CMA)을 포함하는 마스크일 수 있다. 예를 들어, 변 환 마스크(CMSK)의 변환 마스크 영역(CMA)과 제1 이미지(IMG1) 중 제1 마스크 영역(MA1)에 대응하는 영역(예: 제1 이미지(IMG1)의 결함 이미지 세그먼트(DF))에 인접한(또는, 접하는) 영역의 픽셀 값들은 실질적으로 동일할 수 있다. 일 예로, 변환 마스크(CMSK)는 변환 마스크 영역(CMA)에 포함된 정상 이미지(또는, 정상 이미지 세그 먼트)와 제1 이미지(IMG1)의 결함 이미지 세그먼트(DF)에 인접한 영역이 실질적으로 동일한 픽셀 값들을 가지는 정상 마스크일 수 있다. 일 실시예에서, 변환 마스크(CMSK)는 이진(2진, binary) 형태의 데이터(예: binary mask)로서 마스킹된 이미지 중 제1 이미지(IMG1)의 결함 이미지 세그먼트(DF)에 대응하는 영역을 선택하거나 필터링하는 데 사용될 수 있다. 일 예로, 변환 마스크(CMSK)는 해당 마스크 영역(예를 들어, 변환 마스크 영역(CMA))의 경계 또는 내부가 0(또는, 1)으로 채워지고, 해당 마스크 영역의 외부는 1(또는, 0)로 채워진 이진(2진, binary) 형태의 이미지 (또는, 데이터)일 수 있다. 다만, 본 개시의 실시예가 이에 제한되는 것은 아니다. 예를 들어, 변환 마스크 (CMSK)는 RGB 색상, 즉, 적색(Red, R), 녹색(Green, G) 및 청색(Blue, B)을 가지는 마스크(예: RGB mask)일 수 도 있다. 일 실시예에서, 제1 연산기는 제1 이미지(IMG1)(또는, 입력 이미지) 및 변환 마스크(CMSK)를 수신하고, 제 1 이미지(IMG1) 및 변환 마스크(CMSK)에 기초하여 제1 다채널 데이터 세트(MCDS1)를 생성할 수 있다. 예를 들어, 제1 연산기는 변환 마스크(CMSK)를 이용하여 제1 이미지(IMG1)를 마스킹된(masked) 이미지로 변환 (또는, 생성)하고, 상기 마스킹된 이미지 및 변환 마스크(CMSK)를 연결(concatenate)하여 제1 다채널 데이터 세 트(MCDS1)를 생성할 수 있다. 제1 연산기에 대해 보다 구체적으로 설명하기 위해, 도 4를 더 참조하면, 일 실시예에서, 제1 연산기(21 2)는 변환 마스크(CMSK)를 이용하여, 제1 이미지(IMG1) 중 변환 마스크 영역(CMA)에 대응하는 영역의 내부가 변 환 마스크(CMSK)로 마스킹된(masked) 이미지(이하, \" 마스킹된 이미지(MI)\"라 함)를 생성할 수 있다. 예를 들어, 제1 연산기는 수신한 제1 이미지(IMG1)에 대하여, 제1 이미지(IMG1) 중 변환 마스크(CMSK)의 변환 마스크 영역(CMA)에 대응하는 영역의 픽셀 값들을 재구성(예: 변환 마스크(CMSK)로 마스킹)하여 마스킹된 이미지(MI)를 생성할 수 있다. 이에 따라, 도 4에 도시된 바와 같이, 마스킹된 이미지(MI)는, 제1 이미지(IMG1)를 기준으로 변환 마스크(CMS K)의 변환 마스크 영역(CMA)에 대응하는 영역(예: 변환 마스크 영역(CMA)과 중첩하는 영역)이 마스킹된 이미지 를 포함할 수 있다. 일 실시예에서, 제1 연산기는 마스킹된 이미지(MI), 변환 마스크 영역(CMA)을 포함하는 변환 마스크(CMS K)를 연결(concatenate)하여 제1 다채널 데이터 세트(MCDS1)를 생성(또는, 변환)할 수 있다. 예를 들어, 제1 연산기는 마스킹된 이미지(MI) 및 변환 마스크(CMSK)를 행 또는 열의 방향으로 연결 (concatenate)함으로써 복수 개의 채널(또는, 도메인)을 포함하는 제1 다채널 데이터 세트(MCDS1)를 생성할 수 있다. 일 예로, 도 4에 도시된 바와 같이, 마스킹된 이미지(MI)에 의해 제1 평면(예: z 축의 값이 a인 xy 평면)이 정의되고(예: 도 4에 도시된 제1 다채널 데이터 세트(MCDS1)에서 \"MI\"로 표시된 평면), 변환 마스크 (CMSK)에 의해 제2 평면(예: z 축의 값이 b인 xy 평면, 단, b는 a와 상이함)이 정의될 수 있으며(예: 도 4에 도 시된 제1 다채널 데이터 세트(MCDS1)에서 \"CMSK\"로 표시된 평면), 제1 연산기는 제1 평면 및 제2 평면과 각각 수직한 축 방향(예: z축 방향)으로 마스킹된 이미지(MI) 및 변환 마스크(CMSK)를 연결(concatenate)하여 복수 개의 채널(또는, 평면)을 포함하는 제1 다채널 데이터 세트(MCDS1)를 생성할 수 있다. 예를 들어, 제1 연산기는 요소별 연산(예: ADD 연산) 및/또는 채널별 연산(예: CONCAT 연산 또는 CONCAT 함수)를 이용하여, 마스킹된 이미지(MI) 및 변환 마스크(CMSK)에 대한 연결 작업(예: concatenate 작업)을 수행 함으로써 제1 다채널 데이터 세트(MCDS1)를 생성할 수 있다. 일 예로, 서로 상이한 채널(channel)을 가지는 마 스킹된 이미지(MI) 및 변환 마스크(CMSK)에 대응하여, 제1 연산기는 마스킹된 이미지(MI) 및 변환 마스크 (CMSK)에 대해 CONCAT 연산을 수행하여 제1 다채널 데이터 세트(MCDS1)를 생성할 수 있다. 다만, 이는 단순히 예시적인 것으로, 제1 연산기의 동작이 이에 제한되는 것은 아니다. 예를 들어, 제1 연산기는 element-wise summation, weighted summation 및 linear combination 중 적어도 하나를 이용하여 제1 다채널 데이터 세트(MCDS1)를 생성할 수도 있다. 이하에서는, 설명의 편의를 위하여, 마스킹된 이미지(MI) 및 변환 마스크(CMSK)가 상이한 채널을 가지며, 제1 연산기가 채널별 연산(예: CONCAT 연산 또는 CONCAT 함수)을 수행하여 제1 다채널 데이터 세트(MCDS1)를 생성하는 것을 기준으로 설명하기로 한다. 일 실시예에서, 제1 마스크(MSK1) 및 변환 마스크(CMSK)는 이진(2진, binary) 형태의 데이터(예: binary mas k)로서 제1 이미지(IMG1)의 특정 영역을 선택하거나 필터링하는 데 사용될 수 있다. 일 예로, 제1 마스크(MSK 1)는 해당 마스크 영역(예를 들어, 제1 마스크 영역(도 4의 MA1))의 경계 또는 내부가 0(또는, 1)으로 채워지고, 해당 마스크 영역의 외부는 1(또는, 0)로 채워진 이진(2진, binary) 형태의 이미지(또는, 데이터)일 수 있다. 또한, 변환 마스크(CMSK)는 해당 마스크 영역(예를 들어, 변환 마스크 영역(도 4의 CMA))의 경계 또는 내부가 0(또는, 1)으로 채워지고, 해당 마스크 영역의 외부는 1(또는, 0)로 채워진 이진(2진, binary) 형태의 이미지(또는, 데이터)일 수 있다. 다만, 본 개시의 실시예가 이에 제한되는 것은 아니다. 예를 들어, 제1 마스 크(MSK1_1) 및 변환 마스크(CMSK)는 RGB 색상, 즉, 적색(Red, R), 녹색(Green, G) 및 청색(Blue, B)을 가지는 마스크(예: RGB mask)일 수도 있다. 일 실시예에서, 이미지 변환기는 제1 다채널 데이터 세트(MCDS1)를 수신하고 제1 다채널 데이터 세트 (MCDS1)에 기초하여 제2 이미지(IMG2)를 생성할 수 있다. 예를 들어, 이미지 변환기는 제1 연산기가 생성한 제1 다채널 데이터 세트(MCDS1)를 수신하고, 제1 다채널 데이터 세트(MCDS1)로부터 학습기로 입력 된 데이터, 즉, 제1 이미지(IMG1) 중 결함 이미지 세그먼트(DF)가 결함 이미지 세그먼트(DF)에 인접한 영역과 실질적으로 동일한 이미지 세그먼트로 변환된 제2 이미지(IMG2)를 생성(또는, 출력)할 수 있다. 일 실시예에서, 이미지 변환기는 인공지능 모델(또는, 아키텍처)의 적어도 일부를 이용하여 제2 이미지 (IMG2)를 생성할 수 있다. 예를 들어, 이미지 변환기는 오토 인코더(auto-encoder), U-net(또는, 유-네트 워크) 또는 Adversarial Autoencoder(AAE) 등의 아키텍처(또는, 모델)을 이용하여 제2 데이터 세트(DTS2)로부 터 제2 이미지(IMG2_1)를 생성할 수 있다. 일 예로, 이미지 변환기는 오토 인코더(auto-encoder)와 동일한 및/또는 이와 실질적으로 동일한 동작을 수행할 수 있다. 구체적으로, 이미지 변환기는 입력된 제1 다채널 데이터 세트(MCDS1)에 대해 추상 피쳐(feature)로 압축(예: 차원을 축소함)하여 입력 데이터(즉, 이미지 변환기 로 입력된 제1 다채널 데이터 세트(MCDS1))를 내부 표현으로 변환함으로써 저차원(예: 1차원)의 데이터로 변환하고, 상기 변환된 내부 표현(즉, 입력된 제1 다채널 데이터 세트(MCDS1)가 변환된 저차원(예: 1차원)의 데 이터)을 출력으로 변환함으로써 고차원(예: 2차원)의 제2 이미지(IMG2)를 생성(또는, 복원, 디코딩)할 수 있다. 즉, 이미지 변환기는 입력된 제1 다채널 데이터 세트(MCDS1)를 재구성(reconstruction)하여 제2 이미지 (IMG2)를 생성할 수 있다. 일 실시예에서, 이미지 변환기는 상기 변환된 내부 표현(즉, 입력된 제1 다채널 데이터 세트(MCDS1)가 변 환된 저차원(예: 1차원)의 데이터)을 출력으로 변환함에 있어서, 제1 다채널 데이터 세트(MCDS1)에 포함된 변환 마스크(CMSK)에 대응하는 부분은 복원(또는, 디코딩)하지 않을 수 있다. 예를 들어, 이미지 변환기는 상기 내부 표현을 출력으로 변환하는 과정에서 변환 마스크(CMSK)에 대응하는 부분은 복원(또는, 디코딩)하지 않고, 이미지에 대응하는 부분(예: 마스킹된 이미지(MI)에 대응하는 부분)만을 복원(또는, 디코딩)함으로써 제2 이미 지(IMG2)를 생성할 수 있다. 도 4를 더 참조하면, 일 실시예에서, 이미지 변환기는 상기 내부 표현을 출력으로 변환하는 과정에서 변환 마스크(CMSK)를 참조하여, 이미지에 대응하는 부분(예: 마스킹된 이미지(MI)에 대응하는 부분)을 복원(또는, 디 코딩)함으로써 제2 이미지(IMG2)를 생성할 수 있다. 예를 들어, 전술한 바와 같이, 변환 마스크(CMSK)(또는, 정상 마스크)는 제1 이미지(IMG1) 상에 포함되는 결함 이미지 세그먼트(예: 결함 이미지 세그먼트(DF))의 형태와 대응하며 정상 이미지 세그먼트(예: 결함 마스크 영 역(CMA)에 포함되는 이미지)가 포함되는 변환 마스크 영역(CMA)을 포함하므로, 이미지 변환기는 상기 내부 표현 중 이미지에 대응하는 부분, 예를 들어, 마스킹된 이미지(MI)에 대응하는 부분을 복원(또는, 디코딩)할 때 변환 마스크 영역(CMA)에 대응하는 영역을 상기 정상 이미지 세그먼트의 형태로 치환(또는, 변환, 변경)함으로 써 이미지를 변환하여 제2 이미지(IMG2)를 생성할 수 있다. 즉, 제2 이미지(IMG2) 중 변환 마스크 영역(CMA)에 대응하는 영역에 포함되는 이미지 세그먼트(IS)는 정상 이미지 세그먼트일 수 있다. 일 실시예에서, 이미지 변환기가 생성하는 제2 이미지(IMG2)는 결함이 발생할 수 있는 위치에 대한 정보를 포함할 수 있다. 예를 들어, 도 4를 참조하면, 이미지 변환기가 생성(또는, 산출, 출력)한 제2 이미지 (IMG2)는 결함 이미지 세그먼트(DF)가 형성되는 영역에 대응하는 변환 마스크 영역(CMA)에 관한 정보를 포함할 수 있다. 여기서, 제2 이미지(IMG2)에 포함되는 변환 마스크 영역(CMA)에 관한 정보는 결함이 발생할 수 있는 위치에 대한 정보와 동일하거나 적어도 결함이 발생할 수 있는 위치에 대한 정보에 포함될 수 있다. 다만, 이상에서 설명한 이미지 변환기의 동작은 예시적인 것으로서, 이미지 변환기는 다양한 방식을 이용하여 제2 이미지(IMG2)를 생성(또는, 복원, 디코딩)할 수 있다. 일 실시예에서, 마스크 추출기는 제1 마스크(MSK1)를 이용하여 경계 상자 영역을 포함하는 경계 상자 마스 크(BBXMSK)를 생성(또는, 산출, 출력)할 수 있다. 예를 들어, 마스크 추출기는 제1 마스크(MSK1) 중 제1 마스크 영역(MA1)이 포함되는 영역에 대응하는 경계 상자 영역을 포함하는 경계 상자 마스크(BBXMSK)를 생성할 수 있다. 예를 들어, 마스크 추출기는 제1 마스크(MSK1)의 제1 마스크 영역(예: 도 4의 제1 마스크 영역 (MA1))이 포함(또는, 흡수)되는 영역에 대응하는 경계 상자 영역(예: 도 4의 경계 상자 영역(BBXMA))을 포함하 는 경계 상자 마스크(BBXMSK)를 생성(또는, 산출, 출력)할 수 있다. 일 예로, 마스크 추출기는 제1 마스크 (MSK1)를 수신하고, 제1 마스크(MSK1)의 마스킹 영역(예를 들어, 제1 마스크 영역(MA1))을 둘러싸는 직사각형의 경계 내부 영역에 대응하는 영역(예를 들어, 도 4의 경계 상자 영역(BBXMA))을 포함하는 경계 상자 마스크 (BBXMSK)를 생성(또는, 출력, 산출)할 수 있다. 여기서, 경계 상자 영역(BBXMA)은 경계 상자 마스크(BBXMSK) 중 경계 상자(bounding box) 및 그 내부의 영역을 의미할 수 있다. 일 실시예에서, 경계 상자 영역(예: 도 4의 경계 상자 영역(BBXMA))은 다양한 형상으로 제공될 수 있다. 예를 들어, 도 4에 도시된 바와 같이, 경계 상자 영역(BBXMA)은 서로 평행한 두 쌍의 변들을 가지는 직사각 형상으로 제공될 수 있으나, 본 개시의 실시예가 이에 한정되는 것은 아니다. 실시예에 따라, 직사각 형상으로 제공되는 경계 상자 영역(BBXMA)은 하나의 장 변과 하나의 단 변이 접하는 모서리부(또는, 모서리, 가장자리)가 라운드 형상을 가질 수도 있다. 다만, 본 개시의 실시예가 이에 제한되는 것은 아니며, 경계 상자 영역(BBXMA)은 정사 각 형상, 다각형 형상, 원의 형상 등의 다양한 평면 도형의 형상을 가질 수도 있다. 다시 도 3 및 도 4를 참조하면, 일 실시예에서, 제2 연산기는 제2 이미지(IMG2)(또는, 가상 정상 이미지) 및 경계 상자 마스크(BBXMSK)를 수신하고, 제2 이미지(IMG2) 및 경계 상자 마스크(BBXMSK)에 기초하여 제2 다채 널 데이터 세트(MCDS2)를 생성할 수 있다. 예를 들어, 제2 연산기는 이미지 변환기로부터 수신한 제2 이미지(IMG2) 및 마스크 추출기로부터 수신한 경계 상자 마스크(BBXMSK)를 연결(concatenate)하여 제2 다 채널 데이터 세트(MCDS2)를 생성할 수 있다. 실시 예에 따라, 제2 연산기의 구성은 도 3 및 도 4에 도시된 제1 연산기와 동일한 것으로 이해될 수 있다. 제2 연산기에 대해 보다 구체적으로 설명하기 위해, 도 4를 더 참조하면, 일 실시예에서, 제2 연산기(21 5)는 제2 이미지(IMG2) 및 경계 상자 영역(BBXMA)을 포함하는 경계 상자 마스크(BBXMSK)를 연결(concatenate) 하여 제2 다채널 데이터 세트(MCDS2)를 생성(또는, 변환)할 수 있다. 예를 들어, 제2 연산기는 제2 이미지(IMG2) 및 경계 상자 마스크(BBXMSK)를 행 또는 열의 방향으로 연결 (concatenate)함으로써 복수 개의 채널(또는, 도메인)을 포함하는 제2 다채널 데이터 세트(MCDS2)를 생성할 수 있다. 일 예로, 도 4에 도시된 바와 같이, 제2 이미지(IMG2)에 의해 제3 평면(예: z 축의 값이 c인 xy 평면)이 정의되고(예: 도 4에 도시된 제2 다채널 데이터 세트(MCDS2)에서 \"IMG2\"로 표시된 평면), 경계 상자 마스크 (BBXMSK)에 의해 제4 평면(예: z 축의 값이 d인 xy 평면, 단, d는 c와 상이함)이 정의될 수 있으며(예: 도 4에 도시된 제2 다채널 데이터 세트(MCDS2)에서 \"BBXMSK\"로 표시된 평면), 제2 연산기는 제3 평면 및 제4 평면과 각각 수직한 축 방향(예: z축 방향)으로 제2 이미지(IMG2) 및 경계 상자 마스크(BBXMSK)를 연결 (concatenate)하여 복수 개의 채널(또는, 평면)을 포함하는 제2 다채널 데이터 세트(MCDS2)를 생성할 수 있다. 예를 들어, 제2 연산기는 요소별 연산(예: ADD 연산) 및/또는 채널별 연산(예: CONCAT 연산 또는 CONCAT 함수)를 이용하여, 제2 이미지(IMG2) 및 경계 상자 마스크(BBXMSK)에 대한 연결 작업(예: concatenate 작업)을 수행함으로써 제2 다채널 데이터 세트(MCDS2)를 생성할 수 있다. 일 예로, 서로 상이한 채널(channel)을 가지는 제2 이미지(IMG2) 및 경계 상자 마스크(BBXMSK)에 대응하여, 제2 연산기는 제2 이미지(IMG2) 및 경계 상자 마스크(BBXMSK)에 대해 CONCAT 연산을 수행하여 제2 다채널 데이터 세트(MCDS2)를 생성할 수 있다. 다만, 이는 단순히 예시적인 것으로, 제2 연산기의 동작이 이에 제한되는 것은 아니다. 예를 들어, 제2 연산기는 element-wise summation, weighted summation 및 linear combination 중 적어도 하나를 이용하여 제2 다채널 데이터 세트(MCDS2)를 생성할 수도 있다. 이하에서는, 설명의 편의를 위하여, 제2 이미지(IMG2) 및 경계 상자 마스크(BBXMSK)가 상이한 채널을 가지며, 제2 연산기가 채널별 연산(예: CONCAT 연산 또는 CONCAT 함수)을 수행하여 제2 다채널 데이터 세트(MCDS 2)를 생성하는 것을 기준으로 설명하기로 한다. 일 실시예에서, 경계 상자 마스크(BBXMSK)는 이진(2진, binary) 형태의 데이터(예: binary mask)로서 제2 이미 지(IMG2)의 특정 영역을 선택하거나 필터링하는 데 사용될 수 있다. 일 예로, 경계 상자 마스크(BBXMSK)는 해당 마스크 영역(예를 들어, 경계 상자 영역(도 4의 BBXMA))의 경계 또는 내부가 0(또는, 1)으로 채워지고, 해당 마 스크 영역의 외부는 1(또는, 0)로 채워진 이진(2진, binary) 형태의 이미지(또는, 데이터)일 수 있다. 또한, 경 계 상자 마스크(BBXMSK)는 해당 마스크 영역(예를 들어, 경계 상자 영역(도 4의 BBXMA))의 경계 또는 내부가 0 (또는, 1)으로 채워지고, 해당 마스크 영역의 외부는 1(또는, 0)로 채워진 이진(2진, binary) 형태의 이미지(또 는, 데이터)일 수 있다. 다만, 본 개시의 실시예가 이에 제한되는 것은 아니다. 예를 들어, 경계 상자 마스크 (BBXMSK)는 RGB 색상, 즉, 적색(Red, R), 녹색(Green, G) 및 청색(Blue, B)을 가지는 마스크(예: RGB mask)일 수도 있다. 일 실시예에서, 마스크 생성기는 제2 다채널 데이터 세트(MCDS2)를 이용하여 제2 마스크(MSK2)를 생성할 수 있다. 예를 들어, 마스크 생성기는 제2 다채널 데이터 세트(MCDS2)를 수신한 후, 상기 제2 다채널 데이 터 세트(MCDS2)로부터 제2 마스크 영역(MA2)을 포함하는 제2 마스크(MSK2)를 생성할 수 있다. 일 실시예에서, 마스크 생성기는 제2 이미지(IMG2) 및 경계 상자 마스크(BBXMSK)를 포함하는 데이터 세트 를 이용하여 경계 상자 영역(BBXMA)과 중첩(또는, 포함)되는 제2 마스크 영역(MA2)을 포함하는 제2 마스크 (MSK2)를 생성할 수 있다. 예를 들어, 도 4를 더 참조하면, 마스크 생성기는 제2 연산기로부터 제2 이미지(IMG2) 및 경계 상자 마스크(BBXMSK)를 포함하는 제2 다채널 데이터 세트(MCDS2)를 수신한 후, 경계 상자 영역(BBXMA)과 대응되는 영역에 포함되는(또는, 속하는) 제2 마스크 영역(MA2)을 포함하는 제2 마스크(MSK2)를 생성(또는, 산출, 출력)할 수 있다. 일 예로, 마스크 생성기는 경계 상자 영역(BBXMA)과 중첩되면서 경계 상자 영역(BBXMA)을 둘러싸는 경계 상자(bounding box) 외부의 영역과는 중첩되지 않는 제2 마스크 영역(MA2)을 포함하는 제2 마스크(MSK2)를 생성할 수 있다. 즉, 마스크 생성기는 경계 상자 마스크(BBXMSK)의 경계 상 자 영역(BBXMA) 내부에 대응하는 마스크 영역을 포함하는 제2 마스크(MSK2)를 생성할 수 있다. 일 실시예에서, 마스크 생성기는 제1 이미지(IMG1)의 결함 이미지 세그먼트(DF)가 형성되는 영역에 실질적 으로 대응하는 마스킹 영역을 포함하는 제2 마스크(MSK2)를 생성할 수 있다. 예를 들어, 도 4를 참조하면, 마스크 생성기는 이미지 변환기가 생성한 제2 이미지(IMG2)와 제1 이미 지(IMG1)의 결함 이미지 세그먼트(DF)에 대응하는 이미지 세그먼트(IS)(또는, 제2 이미지(IMG2) 중 변환 마스크 영역(CMA)에 대응하는 영역)를 포함하는 영역과 대응하는 경계 상자 영역(BBXMA)을 포함하는 경계 상자 마스크 (BBXMSK)를 수신한 후, 상기 경계 상자 마스크(BBXMSK)의 경계 상자 영역(BBXMA) 중 적어도 일부 영역과 중첩하 는 제2 마스크 영역(MA2)을 포함하는 제2 마스크(MSK2)를 생성할 수 있다. 일 실시예에서, 경계 상자 마스크(BBXMSK) 중 제2 마스크(MSK2)의 제2 마스크 영역(MA2)과 중첩하는 영역은 경 계 상자 영역(BBXMA) 내부에만 존재할 수 있다. 달리 말하면, 제2 마스크 영역(MA2)은 제2 마스크(MSK2) 중 경 계 상자 마스크(BBXMSK) 상의 경계 상자 영역(BBXMA) 내부에 대응하는 영역에만 형성될 수 있다. 일 예로, 마스 크 생성기는 경계 상자 영역(BBXMA) 내부의 영역에 대응하는 제2 마스크(MSK2) 상의 영역에만 제2 마스크 영역(MA2)을 포함하는 제2 마스크(MSK2)를 생성(또는, 산출, 출력)할 수 있다. 즉, 마스크 생성기는 경계 상자 마스크(BBXMSK) 중 경계 상자 영역(BBXMA) 외부의 영역과 중첩되는 영역에는 제2 마스크 영역(MA2)을 포함하지 않는 제2 마스크(MSK2)를 생성(또는, 산출, 출력)할 수 있다. 다시 도 3을 참조하면, 판별기는 학습기가 외부로부터 수신한(또는, 보정 마스크 생성 시스템이 제1 이미지(IMG1)로부터 생성한) 제1 마스크(MSK1) 및 마스크 생성기가 생성한 제2 마스크(MSK2)를 수신한 후, 마스크 생성기의 제2 마스크(MSK2) 생성에 따른 데이터(data)의 손실(loss) 여부를 판별할 수 있다. 일 실시예에서, 판별기는 제1 마스크(MSK1) 및 제2 마스크(MSK2) 간의 손실을 산출(또는, 생성)함으로써 제2 마스크(MSK2) 생성에 따른 데이터 손실 여부를 판별할 수 있다. 예를 들어, 판별기는 제1 마스크 (MSK1) 및 제2 마스크(MSK2)를 비교하여 NLL(음의 로그 가능도, negative log-likelihood) 손실을 산출(또는, 생성)할 수 있다(예를 들어, NLL(negative log-likelihood) 손실 함수를 이용하여 손실을 산출 또는 생성함). 일 예로, 판별기는 제1 마스크(MSK1)와 제2 마스크(MSK2) 간의 픽셀 값의 차이에 기초하여 데이터 손실을 판별할 수 있다. 이와 같은 판별기의 동작에 의해, 보정 마스크 생성 모델이 제2 마스크(MSK2)를 생성(또 는, 복원, 디코딩)함에 있어서 마스크(예: 제1 마스크(MSK1))를 정확히 재현하는지 여부가 판별(또는, 검증, 학 습)될 수 있다. 일 실시예에서, 판별기는 제2 마스크(MSK2)에 대한 GAN(생성적 적대 신경망, generative adversarial network) 손실을 산출(또는, 생성)할 수 있다(예를 들어, GAN 손실 함수를 이용하여 손실을 산출 또는 생성함). 예를 들어, 판별기는 제1 마스크(MSK1)와 제2 마스크(MSK2)를 비교(또는, 판별)함으로써 GAN 손실을 산출 (또는, 생성)할 수 있다. 이와 같은 판별기의 동작에 의해, 보정 마스크 생성 모델이 제2 마스크(MSK2)를 생성(또는, 복원, 디코딩)함에 있어서 이미지를 사실적으로(예: 실제 이미지와 같이) 재현하는지 여부가 판별 (또는, 검증, 학습)될 수 있다. 다만, 판별기의 동작이 이에 제한되는 것은 아니며, 판별기는 다양한 방식을 이용하여 손실을 산출 (또는, 생성)할 수 있다. 일 실시예에서, 판별기는 제2 마스크(MSK2)에 대한 NLL 손실 및 GAN 손실을 동시 에 산출할 수 있다. 일 실시예에서, 판별기의 판별이 더 이상 진행되지 않는 경우, 학습기는 생성된 보정 마스크 생성 모 델을 메모리(예: 도 1의 메모리)에 저장할 수 있다. 예를 들어, 판별기가 생성한 제1 마스크(MSK1) 및 제2 마스크(MSK2) 간의 손실이 기준 값보다 작거나 같은 경우, 학습기는 생성된(또는, 학습이 완료된) 보정 마스크 생성 모델을 메모리(예: 도 1의 메모리)에 저장할 수 있다. 일 실시예에서, 학습기가 외부로부터 수신한(예: 사용자가 입력한) 제1 마스크(MSK1) 또는 학습기가 생성한 제1 마스크(MSK1)를 이용하여 모델을 학습할 수 있다. 예를 들어, 학습기는 보정 마스크 생성 시스템(또는, 전자 장치)에 포함되는 입력 장치(예: 도 1의 입력부)가 수신한 마스크(예: 사용자가 입력부를 통하여 직접 입력한 마스크)를 제1 마스크 (MSK1)로서 이용(또는, 수신)하여 보정 마스크 생성 모델을 학습할 수 있다. 다른 예로, 학습기는 보정 마스크 생성 시스템(또는, 전자 장치)에 포함되는 프로세서(예: 도 1 의 프로세서)가 제1 이미지(IMG1)로부터 생성한 제1 마스크(MSK1)를 이용(또는, 수신)하여 보정 마스크 생 성 모델을 학습할 수 있다. 일 예로, 보정 마스크 생성 시스템(또는, 전자 장치)에 포함되는 프로세 서(예: 도 1의 프로세서)는 제1 이미지(IMG1)를 분할(image segmentation)하고 객체를 검출(object detection)하는 다양한 공지의 기술(또는, 모델)을 이용하여 제1 이미지(IMG1)의 적어도 일부 영역에 대응되는 제1 마스크(MSK1)를 생성할 수 있다. 이상에서, 학습기는 1개의 제1 이미지(예: 도 3의 제1 이미지(IMG1)(또는, 입력 이미지)만을 이용해서 보 정 마스크 생성 모델을 학습하는 것으로 도시되었으나, 본 개시가 반드시 이에 한정되는 것은 아니다. 즉, 학습 기는 복수 개의 제1 이미지(예: 도 5의 제1 이미지(IMG1_1))들을 이용하여 보정 마스크 생성 모델을 학습 할 수 있다. 예를 들어, 학습기는 제1 결함 유형을 가지는 제1 이미지 및 제2 결함 유형을 가지는 제1 이 미지를 이용하여 제1 결함 유형에 대응하는 제2 마스크 및 제2 결함 유형에 대응하는 제2 마스크를 생성하는 동 작을 반복적으로 수행함으로써 복수의 제1 이미지(또는, 결함 이미지)에 대하여 보정 마스크 생성 모델을 학습 할 수 있다. 실시예에 따라, 학습기는 서로 다른 결함 클래스에 해당하는 이미지들에 대해 병렬적으로 학 습함으로써 보정 마스크 생성 모델을 생성할 수 있다. 이로 인해, 본 개시의 실시예들에 따른 보정 마스크 생성 시스템(또는, 전자 장치)은 다양한 결함에 대한 학습을 동시에 수행할 수 있다.<학습기의 다른 일 실시예> 도 5는 도 2의 보정 마스크 생성 시스템에 포함되는 학습기의 다른 일 예를 나타내는 블록도이다. 도 6은 도 5의 학습기의 동작의 다른 일 예를 설명하기 위한 도면이다. 도 2 및 도 5를 참조하면, 학습기(210_1)는 제1 마스크(MSK1_1)(또는, 기준 마스크)를 제2 마스크(MSK2_1)(또는, 생성 마스크)로 변환, 즉 제1 마스크(MSK1_1)로부터 제2 마스크(MSK2_1)를 생성하는 동작 을 반복적으로 수행함에 따라 보정 마스크 생성 모델을 학습할 수 있다. 실시예에 따라, 도 5에 도시된 학습기 (210_1)의 동작은 인공지능 모델, 예를 들어, 보정 마스크 생성 모델을 학습하기 위한 훈련 동작으로 이해될 수 있다.일 실시예에서, 학습기(210_1)는 입력된 제1 이미지(IMG1_1)와 제1 마스크(MSK1_1)에 기초하여 보정 마스 크 생성 모델을 학습할 수 있다. 예를 들어, 학습기(210_1)는 제1 마스크(MSK1_1)를 이용하여 제1 이미지 (IMG1_1)를 마스킹된(masked) 이미지로 변환하고, 상기 마스킹된 이미지 및 제1 마스크(MSK1_1)를 연결 (concatenate)하여 제1 데이터 세트(DTS1)를 생성하며, 제1 데이터 세트(DTS1) 중 제1 마스크(MSK1_1)를 변환 마스크(converted mask)(CMSK_1)로 변환하여 제2 데이터 세트(DTS2)를 생성하고, 상기 제2 데이터 세트(DTS2) 에 포함되는 마스킹된 이미지(MI_1) 중 변환 마스크 영역(CMA_1)에 대응하는 영역의 픽셀 값들을 재구성한 제2 이미지(IMG2_1)를 생성하며, 상기 제1 마스크(MSK1_1)로부터 경계 상자 영역(BBXMA_1)을 포함하는 경계 상자 마 스크(BBXMSK_1)를 생성하고, 상기 제2 이미지(IMG2_1) 및 상기 경계 상자 마스크(BBXMSK_1)를 연결 (concatenate)함으로써 제3 데이터 세트(DTS3)를 생성하며, 상기 제3 데이터 세트(DTS3)에 포함되는 상기 제2 이미지(IMG2_1) 중 상기 경계 상자 영역(BBXMA_1)에 대응하는 영역 내의 적어도 일부 영역에 대응하는 제2 마스 크 영역(MA2_1)을 포함하는 제2 마스크(MSK2_1)를 생성(또는, 변환, 산출)하는 동작을 반복적으로 수행하고, 제 1 마스크(MSK1_1) 및 제2 마스크(MSK2_1)를 비교하여 손실(loss)을 산출하는 방식을 이용함으로써 보정 마스크 생성 모델을 학습할 수 있다. 예를 들어, 상기 손실은 제1 마스크(MSK1_1)와 제2 마스크(MSK2_1) 간의 픽셀 값 의 차이를 나타내는 정보(예: 음의 로그 가능도(negative log-likelihood, NLL) 손실), 생성적 적대 신경망 (generative adversarial network, GAN) 손실 중 적어도 하나를 포함할 수 있으나, 이는 단순히 예시적인 것으 로, 학습기(210_1) 의해 산출되는 손실이 이에 제한되는 것은 아니다. 여기서, 제1 마스크(MSK1_1)는 제1 이미지(IMG1_1)에 상응하며 일정한 크기 및 모양을 가지는 마스크(mask)(또 는, 마스크 이미지)일 수 있다. 보다 구체적으로, 도 2를 참조하여 설명한 바와 같이, 제1 이미지(IMG1_1)는 적 어도 일부 영역에서 결함 이미지 세그먼트(예를 들어, 도 4의 결함 이미지 세그먼트(DF))를 포함하며, 제1 마스 크(MSK1_1)는 결함 이미지 세그먼트에 대응하는 마스크 영역(예: 제1 마스크 영역(MA1_1))을 포함하는 마스크일 수 있다. 예를 들어, 결함 이미지 세그먼트가 배치되는 영역과 제1 마스크(MSK1_1)의 제1 마스크 영역(MA1_1)은 중첩할 수 있다(예를 들어, 결함 이미지 세그먼트가 배치되는 영역과 제1 마스크(MSK1_1)의 제1 마스크 영역 (MA1_1)은 실질적으로 동일한 영역임). 이하에서는, 학습기(210_1)가 제1 이미지(IMG1_1) 및 제1 마스크(MSK1_1)를 이용하여 보정 마스크 생성 모델을 학습하는 것을 기준으로 본 개시의 다양한 실시예들을 설명하기로 한다. 일 실시예에서, 학습기(210_1)는 마스크 변환기(211_1), 제1 연산기(212_1),이미지 변환기(213_1), 마스크 추출 기(214_1), 제2 연산기(215_1), 마스크 생성기(216_1) 및 판별기(217_1)를 포함할 수 있다. 한편, 도 5에서는 마스크 변환기(211_1), 제1 연산기(212_1), 이미지 변환기(213_1), 마스크 추출기(214_1), 제2 연산기(215_1), 마스크 생성기(216_1) 및 판별기(217_1)가 각각 별도의 구성인 것으로 도시되어 있으나, 이는 단순히 설명의 편 의를 위한 것으로, 본 개시의 실시예가 이에 제한되는 것은 아니다. 예를 들어, 마스크 변환기(211_1), 제1 연 산기(212_1), 이미지 변환기(213_1), 마스크 추출기(214_1), 제2 연산기(215_1), 마스크 생성기(216_1) 및 판 별기(217_1) 중 적어도 일부는 학습기(210_1) 내에서 일체로 구성될 수 있다. 일 실시예에서, 제1 연산기(212_1)는 제1 이미지(IMG1_1)(또는, 입력 이미지) 및 제1 마스크(MSK1_1)(또는, 입 력 마스크)를 수신하고, 제1 이미지(IMG1_1) 및 제1 마스크(MSK1_1)에 기초하여 제1 데이터 세트(DTS1)를 생성 할 수 있다. 예를 들어, 제1 연산기(212_1)는 제1 마스크(MSK1_1)를 이용하여 제1 이미지(IMG1_1)를 마스킹된 (masked) 이미지(MI_1)로 변환(또는, 생성)하고, 상기 마스킹된 이미지(MI_1) 및 제1 마스크(MSK1_1)를 연결 (concatenate)하여 제1 데이터 세트(DTS1)를 생성할 수 있다. 제1 연산기(212_1)에 대해 보다 구체적으로 설명하기 위해, 도 6을 더 참조하면, 일 실시예에서, 제1 연산기 (212_1)는 제1 마스크(MSK1_1)를 이용하여, 제1 이미지(IMG1_1) 중 제1 마스크 영역(MA1_1)에 대응하는 영역의 내부가 제1 마스크(MSK1_1)로 마스킹된(masked) 이미지(예: 마스킹된 이미지(MI_1))를 생성할 수 있다.예를 들어, 제1 연산기(212_1)는 수신한 제1 이미지(IMG1_1)에 대하여, 제1 이미지(IMG1_1) 중 제1 마스크 (MSK1_1)의 제1 마스크 영역(MA1_1)에 대응하는 영역의 픽셀 값들을 재구성(예: 제1 마스크(MSK1_1)로 마스킹) 하여 마스킹된 이미지(MI_1)를 생성할 수 있다. 이에 따라, 도 6에 도시된 바와 같이, 마스킹된 이미지(MI_1)는, 제1 이미지(IMG1_1)를 기준으로 제1 마스크 (MSK1_1)의 제1 마스크 영역(MA1_1)에 대응하는 영역(예: 제1 마스크 영역(MA1_1)과 중첩하는 영역)이 마스킹된 이미지를 포함할 수 있다. 일 실시예에서, 제1 연산기(212_1)는 마스킹된 이미지(MI_1), 제1 마스크 영역(MA1_1)을 포함하는 제1 마스크 (MSK1_1)를 연결(concatenate)하여 제1 데이터 세트(DTS1)를 생성(또는, 변환)할 수 있다. 예를 들어, 제1 연산기(212_1)는 마스킹된 이미지(MI_1) 및 제1 마스크(MSK1_1)를 행 또는 열의 방향으로 연결 (concatenate)함으로써 복수 개의 채널(또는, 도메인)을 포함하는 제1 데이터 세트(DTS1)를 생성할 수 있다. 일 예로, 도 6에 도시된 바와 같이, 마스킹된 이미지(MI_1)에 의해 제5 평면(예: z 축의 값이 e인 xy 평면)이 정의 되고(예: 도 6에 도시된 제1 데이터 세트(DTS1)에서 \"MI_1\"로 표시된 평면), 제1 마스크(MSK1_1)에 의해 제6 평 면(예: z 축의 값이 f인 xy 평면, 단, f는 e와 상이함)이 정의될 수 있으며(예: 도 4에 도시된 제1 데이터 세트 (DTS1)에서 \"MSK1_1\"로 표시된 평면), 제1 연산기(212_1)는 제5 평면 및 제6 평면과 각각 수직한 축 방향(예: z 축 방향)으로 마스킹된 이미지(MI_1) 및 제1 마스크(MSK1_1)를 연결(concatenate)하여 복수 개의 채널(또는, 평 면)을 포함하는 제1 데이터 세트(DTS1)를 생성할 수 있다. 예를 들어, 제1 연산기(212_1)는 요소별 연산(예: ADD 연산) 및/또는 채널별 연산(예: CONCAT 연산 또는 CONCAT 함수)를 이용하여, 마스킹된 이미지(MI_1) 및 제1 마스크(MSK1_1)에 대한 연결 작업(예: concatenate 작업)을 수행함으로써 제1 데이터 세트(DTS1)를 생성할 수 있다. 일 예로, 서로 상이한 채널(channel)을 가지는 마스킹 된 이미지(MI_1) 및 제1 마스크(MSK1_1)에 대응하여, 제1 연산기(212_1)는 마스킹된 이미지(MI_1) 및 제1 마스 크(MSK1_1)에 대해 CONCAT 연산을 수행하여 제1 데이터 세트(DTS1)를 생성할 수 있다. 다만, 이는 단순히 예시 적인 것으로, 제1 연산기(212_1)의 동작이 이에 제한되는 것은 아니다. 예를 들어, 제1 연산기(212_1)는 element-wise summation, weighted summation 및 linear combination 중 적어도 하나를 이용하여 제1 데이터 세트(DTS1)를 생성할 수도 있다. 이하에서는, 설명의 편의를 위하여, 마스킹된 이미지(MI_1) 및 제1 마스크(MSK1_1)가 상이한 채널을 가지며, 제 1 연산기(212_1)가 채널별 연산(예: CONCAT 연산 또는 CONCAT 함수)을 수행하여 제1 데이터 세트(DTS1)를 생성 하는 것을 기준으로 설명하기로 한다. 일 실시예에서, 제1 마스크(MSK1_1)는 이진(2진, binary) 형태의 데이터(예: binary mask)로서 제1 이미지 (IMG1_1)의 특정 영역을 선택하거나 필터링하는 데 사용될 수 있다. 일 예로, 제1 마스크(MSK1_1)는 해당 마스 크 영역(예를 들어, 제1 마스크 영역(도 6의 MA1_1))의 경계 또는 내부가 0(또는, 1)으로 채워지고, 해당 마스 크 영역의 외부는 1(또는, 0)로 채워진 이진(2진, binary) 형태의 이미지(또는, 데이터)일 수 있다. 다만, 본 개시의 실시예가 이에 제한되는 것은 아니다. 예를 들어, 제1 마스크(MSK1_1)는 RGB 색상, 즉, 적색(Red, R), 녹색(Green, G) 및 청색(Blue, B)을 가지는 마스크(예: RGB mask)일 수도 있다. 일 실시예에서, 마스크 변환기(211_1)는 제1 데이터 세트(DTS1)를 이용하여 제2 데이터 세트(DTS2)를 생성(또는, 출력, 산출)할 수 있다. 예를 들어, 마스크 변환기(211_1)는 제1 연산기(212_1)로부터 마스킹된 이 미지(MI_1) 및 제1 마스크(MSK1_1)가 연결된 제1 데이터 세트(DTS1)를 수신하고, 제1 마스크(MSK1_1)를 변환 마 스크(CMSK_1)로 변환하며, 상기 마스킹된 이미지(MI_1) 및 상기 변환 마스크(CMSK_1)를 연결(concatenate)함으 로써 제2 데이터 세트(DTS2)를 생성할 수 있다(예를 들어, 제2 데이터 세트(DTS2)는 제1 데이터 세트(DTS1) 중 제1 마스크(MSK1_1)가 변환 마스크(CMSK_1)로 변환(또는, 치환)된 데이터 세트임). 일 실시예에서, 변환 마스크(CMSK_1)는 제1 이미지(IMG1_1) 중 결함 이미지 세그먼트(DF_1)에 인접한 영역과 실 질적으로 동일한 변환 마스크 영역(CMA_1)을 포함하는 마스크일 수 있다. 예를 들어, 변환 마스크(CMSK_1)의 변 환 마스크 영역(CMA_1)과 제1 이미지(IMG1_1) 중 제1 마스크 영역(MA1_1)에 대응하는 영역(예: 제1 이미지 (IMG1_1)의 결함 이미지 세그먼트(DF_1))에 인접한(또는, 접하는) 영역의 픽셀 값들은 실질적으로 동일할 수 있 다. 일 예로, 변환 마스크 영역(CMA_1)에 포함된 결함 이미지(또는, 결함 이미지 세그먼트)는 결함 이미지 세그 먼트(DF_1)와 실질적으로 동일한 결함 클래스(또는, 결함 유형)를 가지는 데이터(또는, 마스크)일 수 있다. 일 실시예에서, 변환 마스크(CMSK_1)는 이진(2진, binary) 형태의 데이터(예: binary mask)로서 마스킹된 이미 지 중 제1 이미지(IMG1_1)의 결함 이미지 세그먼트(DF_1)에 대응하는 영역을 선택하거나 필터링하는 데 사용될수 있다. 일 예로, 변환 마스크(CMSK_1)는 해당 마스크 영역(예를 들어, 변환 마스크 영역(도 4의 CMA_1))의 경 계 또는 내부가 0(또는, 1)으로 채워지고, 해당 마스크 영역의 외부는 1(또는, 0)로 채워진 이진(2진, binary) 형태의 이미지(또는, 데이터)일 수 있다. 다만, 본 개시의 실시예가 이에 제한되는 것은 아니다. 예를 들어, 변 환 마스크(CMSK_1)는 RGB 색상, 즉, 적색(Red, R), 녹색(Green, G) 및 청색(Blue, B)을 가지는 마스크(예: RGB mask)일 수도 있다. 일 실시예에서, 이미지 변환기(213_1)는 제2 데이터 세트(DTS2_1)를 수신하고 제2 데이터 세트(DTS2_1)에 기초 하여 제2 이미지(IMG2_1)를 생성할 수 있다. 예를 들어, 이미지 변환기(213_1)는 마스크 변환기(211_1)가 생성 한 제2 데이터 세트(DTS2)를 수신하고, 제2 데이터 세트(DTS2)로부터 학습기(210_1)로 입력된 데이터, 즉, 제1 이미지(IMG1_1) 중 결함 이미지 세그먼트(DF_1)가 결함 이미지 세그먼트(DF_1)에 인접한 영역과 실질적으로 동 일한 이미지 세그먼트로 변환된 제2 이미지(IMG2_1)를 생성(또는, 출력)할 수 있다. 일 실시예에서, 이미지 변환기(213_1)는 인공지능 모델(또는, 아키텍처)의 적어도 일부를 이용하여 제2 이미지 (IMG2_1)를 생성할 수 있다. 예를 들어, 이미지 변환기(213_1)는 오토 인코더(auto-encoder), U-net(또는, 유- 네트워크) 또는 Adversarial Autoencoder(AAE) 등의 아키텍처(또는, 모델)을 이용하여 제2 데이터 세트(DTS2) 로부터 제2 이미지(IMG2_1)를 생성할 수 있다. 일 예로, 이미지 변환기(213_1)는 오토 인코더(auto-encoder)와 동일한 및/또는 이와 실질적으로 동일한 동작을 수행할 수 있다. 구체적으로, 이미지 변환기(213_1)는 입력된 제2 데이터 세트(DTS2)에 대해 추상 피쳐(feature)로 압축(예: 차원을 축소함)하여 입력(즉, 이미지 변환기 (213_1)로 입력된 제2 데이터 세트(DTS2))을 내부 표현으로 변환함으로써 저차원(예: 1차원)의 데이터로 변환하 고, 상기 변환된 내부 표현(즉, 입력된 제2 데이터 세트(DTS2)가 변환된 저차원(예: 1차원)의 데이터)을 출력으 로 변환함으로써 고차원(예: 2차원)의 제2 이미지(IMG2_1)를 생성(또는, 복원, 디코딩)할 수 있다. 즉, 이미지 변환기(213_1)는 입력된 제2 데이터 세트(DTS2)를 재구성(reconstruction)하여 제2 이미지(IMG2_1)를 생성할 수 있다. 일 실시예에서, 이미지 변환기(213_1)는 상기 변환된 내부 표현(즉, 입력된 제2 데이터 세트(DTS2)가 변환된 저 차원(예: 1차원)의 데이터)을 출력으로 변환함에 있어서, 제2 데이터 세트(DTS2)에 포함된 변환 마스크(CMSK_ 1)에 대응하는 부분은 복원(또는, 디코딩)하지 않을 수 있다. 예를 들어, 이미지 변환기(213_1)는 상기 내부 표 현을 출력으로 변환하는 과정에서 변환 마스크(CMSK_1)에 대응하는 부분은 복원(또는, 디코딩)하지 않고, 이미 지에 대응하는 부분(예: 마스킹된 이미지(MI_1)에 대응하는 부분)만을 복원(또는, 디코딩)함으로써 제2 이미지 (IMG2_1)를 생성할 수 있다. 또한, 일 실시예에서, 이미지 변환기(213_1)는 상기 내부 표현을 출력으로 변환하는 과정에서 변환 마스크 (CMSK_1)를 참조하여, 이미지에 대응하는 부분(예: 마스킹된 이미지(MI_1)에 대응하는 부분)을 복원(또는, 디코 딩)함으로써 제2 이미지(IMG2_1)를 생성할 수 있다. 예를 들어, 전술한 바와 같이, 변환 마스크(CMSK_1)(또는, 정상 마스크)는 제1 이미지(IMG1_1) 상에 포함되는 결함 이미지 세그먼트(예: 결함 이미지 세그먼트(DF))의 형태와 대응하며 정상 이미지 세그먼트(예: 결함 마스 크 영역(CMA_1)에 포함되는 이미지)가 포함되는 변환 마스크 영역(CMA_1)을 포함하므로, 이미지 변환기(213_1) 는 상기 내부 표현 중 이미지에 대응하는 부분, 예를 들어, 마스킹된 이미지(MI_1)에 대응하는 부분을 복원(또 는, 디코딩)할 때 변환 마스크 영역(CMA_1)에 대응하는 영역을 상기 정상 이미지 세그먼트의 형태로 치환(또는, 변환, 변경)함으로써 이미지를 변환하여 제2 이미지(IMG2_1)를 생성할 수 있다. 즉, 제2 이미지(IMG2_1) 중 변 환 마스크 영역(CMA_1)에 대응하는 영역에 포함되는 이미지 세그먼트(IS_1)는 정상 이미지 세그먼트일 수 있다. 다만, 이상에서 설명한 이미지 변환기(213_1)의 동작은 예시적인 것으로서, 이미지 변환기(213_1)는 다양한 방 식을 이용하여 제2 이미지(IMG2_1)를 생성(또는, 복원, 디코딩)할 수 있다. 일 실시예에서, 마스크 추출기(214_1)는 제1 마스크(MSK1_1)를 이용하여 경계 상자 영역(BBXMA_1) 포함하는 경 계 상자 마스크(BBXMSK_1)를 생성(또는, 산출, 출력)할 수 있다. 예를 들어, 마스크 추출기(214_1)는 제1 마스 크(MSK1_1) 중 제1 마스크 영역(MA1_1)이 포함되는 영역에 대응하는 경계 상자 영역(BBXMA_1)을 포함하는 경계 상자 마스크(BBXMSK_1)를 생성할 수 있다. 예를 들어, 마스크 추출기(214_1)는 제1 마스크(MSK1_1)의 제1 마스 크 영역(예: 도 6의 제1 마스크 영역(MA1_1))이 포함(또는, 흡수)되는 영역에 대응하는 경계 상자 영역(예: 도 6의 경계 상자 영역(BBXMA_1))을 포함하는 경계 상자 마스크(BBXMSK_1)를 생성(또는, 산출, 출력)할 수 있다. 일 예로, 마스크 추출기(214_1)는 제1 마스크(MSK1_1)를 수신하고, 제1 마스크(MSK1_1)의 마스킹 영역(예를 들 어, 제1 마스크 영역(MA1_1))을 둘러싸는 직사각형의 경계 내부 영역에 대응하는 영역(예를 들어, 도 6의 경계 상자 영역(BBXMA_1))을 포함하는 경계 상자 마스크(BBXMSK_1)를 생성(또는, 출력, 산출)할 수 있다. 여기서, 경계 상자 영역(BBXMA_1)은 경계 상자 마스크(BBXMSK_1) 중 경계 상자(bounding box) 및 그 내부의 영역을 의미 할 수 있다. 일 실시예에서, 경계 상자 영역(예: 도 6의 경계 상자 영역(BBXMA_1))은 다양한 형상으로 제공될 수 있다. 예를 들어, 도 6에 도시된 바와 같이, 경계 상자 영역(BBXMA_1)은 서로 평행한 두 쌍의 변들을 가지는 직사각 형상으 로 제공될 수 있으나, 본 개시의 실시예가 이에 한정되는 것은 아니다. 실시예에 따라, 직사각 형상으로 제공되 는 경계 상자 영역(BBXMA_1)은 하나의 장 변과 하나의 단 변이 접하는 모서리부(또는, 모서리, 가장자리)가 라 운드 형상을 가질 수도 있다. 다만, 본 개시의 실시예가 이에 제한되는 것은 아니며, 경계 상자 영역(BBXMA_1) 은 정사각 형상, 다각형 형상, 원의 형상 등의 다양한 평면 도형의 형상을 가질 수도 있다. 다시 도 5 및 도 6을 참조하면, 일 실시예에서, 제2 연산기(215_1)는 제2 이미지(IMG2_1)(또는, 가상 정상 이미 지) 및 경계 상자 마스크(BBXMSK_1)를 수신하고, 제2 이미지(IMG2_1) 및 경계 상자 마스크(BBXMSK_1)에 기초하 여 제3 데이터 세트(DTS3)를 생성할 수 있다. 예를 들어, 제2 연산기(215_1)는 이미지 변환기(213_1)로부터 수 신한 제2 이미지(IMG2_1) 및 마스크 추출기(214_1)로부터 수신한 경계 상자 마스크(BBXMSK_1)를 연결 (concatenate)하여 제3 데이터 세트(DTS3)를 생성할 수 있다. 실시 예에 따라, 제2 연산기(215_1)의 구성은 도 5 및 도 6에 도시된 제1 연산기(212_1)와 동일한 것으로 이해될 수 있다. 제2 연산기(215_1)에 대해 보다 구체적으로 설명하기 위해, 도 6를 더 참조하면, 일 실시예에서, 제2 연산기 (215_1)는 제2 이미지(IMG2_1) 및 경계 상자 영역(BBXMA_1)을 포함하는 경계 상자 마스크(BBXMSK_1)를 연결 (concatenate)하여 제3 데이터 세트(DTS3)를 생성(또는, 변환)할 수 있다. 예를 들어, 제2 연산기(215_1)는 제2 이미지(IMG2_1) 및 경계 상자 마스크(BBXMSK_1)를 행 또는 열의 방향으로 연결(concatenate)함으로써 복수 개의 채널(또는, 도메인)을 포함하는 제3 데이터 세트(DTS3)를 생성할 수 있다. 일 예로, 도 6에 도시된 바와 같이, 제2 이미지(IMG2_1)에 의해 제7 평면(예: z 축의 값이 g인 xy 평면) 이 정의되고(예: 도 4에 도시된 제3 데이터 세트(DTS3)에서 \"IMG2_1\"로 표시된 평면), 경계 상자 마스크 (BBXMSK_1)에 의해 제8 평면(예: z 축의 값이 h인 xy 평면, 단, h는 g와 상이함)이 정의될 수 있으며(예: 도 6 에 도시된 제3 데이터 세트(DTS3)에서 \"BBXMSK_1\"로 표시된 평면), 제2 연산기(215_1)는 제7 평면 및 제8 평면 과 각각 수직한 축 방향(예: z축 방향)으로 제2 이미지(IMG2_1) 및 경계 상자 마스크(BBXMSK_1)를 연결 (concatenate)하여 복수 개의 채널(또는, 평면)을 포함하는 제3 데이터 세트(DTS3)를 생성할 수 있다. 예를 들어, 제2 연산기(215_1)는 요소별 연산(예: ADD 연산) 및/또는 채널별 연산(예: CONCAT 연산 또는 CONCAT 함수)를 이용하여, 제2 이미지(IMG2_1) 및 경계 상자 마스크(BBXMSK_1)에 대한 연결 작업(예: concatenate 작 업)을 수행함으로써 제3 데이터 세트(DTS3)를 생성할 수 있다. 일 예로, 서로 상이한 채널(channel)을 가지는 제2 이미지(IMG2_1) 및 경계 상자 마스크(BBXMSK_1)에 대응하여, 제2 연산기(215_1)는 제2 이미지(IMG2_1) 및 경계 상자 마스크(BBXMSK_1)에 대해 CONCAT 연산을 수행하여 제3 데이터 세트(DTS3)를 생성할 수 있다. 다만, 이는 단순히 예시적인 것으로, 제2 연산기(215_1)의 동작이 이에 제한되는 것은 아니다. 예를 들어, 제2 연산기 (215_1)는 element-wise summation, weighted summation 및 linear combination 중 적어도 하나를 이용하여 제 3 데이터 세트(DTS3)를 생성할 수도 있다. 이하에서는, 설명의 편의를 위하여, 제2 이미지(IMG2_1) 및 경계 상자 마스크(BBXMSK_1)가 상이한 채널을 가지 며, 제2 연산기(215_1)가 채널별 연산(예: CONCAT 연산 또는 CONCAT 함수)을 수행하여 제3 데이터 세트(DTS3)를 생성하는 것을 기준으로 설명하기로 한다. 일 실시예에서, 경계 상자 마스크(BBXMSK_1)는 이진(2진, binary) 형태의 데이터(예: binary mask)로서 제2 이 미지(IMG2_1)의 특정 영역을 선택하거나 필터링하는 데 사용될 수 있다. 일 예로, 경계 상자 마스크(BBXMSK_1) 는 해당 마스크 영역(예를 들어, 경계 상자 영역(도 6의 BBXMA_1))의 경계 또는 내부가 0(또는, 1)으로 채워지 고, 해당 마스크 영역의 외부는 1(또는, 0)로 채워진 이진(2진, binary) 형태의 이미지(또는, 데이터)일 수 있 다. 또한, 경계 상자 마스크(BBXMSK_1)는 해당 마스크 영역(예를 들어, 경계 상자 영역(도 6의 BBXMA_1))의 경 계 또는 내부가 0(또는, 1)으로 채워지고, 해당 마스크 영역의 외부는 1(또는, 0)로 채워진 이진(2진, binary) 형태의 이미지(또는, 데이터)일 수 있다. 다만, 본 개시의 실시예가 이에 제한되는 것은 아니다. 예를 들어, 경 계 상자 마스크(BBXMSK_1)는 RGB 색상, 즉, 적색(Red, R), 녹색(Green, G) 및 청색(Blue, B)을 가지는 마스크 (예: RGB mask)일 수도 있다. 일 실시예에서, 마스크 생성기(216_1)는 제3 데이터 세트(DTS3)를 이용하여 제2 마스크(MSK2_1)를 생성할 수 있 다. 예를 들어, 마스크 생성기(216_1)는 제3 데이터 세트(DTS3)를 수신한 후, 상기 제3 데이터 세트(DTS3)로부터 제2 마스크 영역(MA2_1)을 포함하는 제2 마스크(MSK2_1)를 생성할 수 있다. 일 실시예에서, 마스크 생성기(216_1)는 제2 이미지(IMG2_1) 및 경계 상자 마스크(BBXMSK_1)를 포함하는 데이터 세트(예: 제3 데이터 세트(DTS3))를 이용하여 경계 상자 영역(BBXMA_1)과 중첩(또는, 포함)되는 제2 마스크 영 역(MA2_1)을 포함하는 제2 마스크(MSK2_1)를 생성할 수 있다. 예를 들어, 도 6을 더 참조하면, 마스크 생성기 (216_1)는 제2 연산기(215_1)로부터 제2 이미지(IMG2_1) 및 경계 상자 마스크(BBXMSK_1)를 포함하는 제3 데이 터 세트(DTS3)를 수신한 후, 경계 상자 영역(BBXMA_1)과 대응되는 영역에 포함되는(또는, 속하는) 제2 마스크 영역(MA2_1)을 포함하는 제2 마스크(MSK2_1)를 생성(또는, 산출, 출력)할 수 있다. 일 예로, 마스크 생성기 (216_1)는 경계 상자 영역(BBXMA_1)과 중첩되면서 경계 상자 영역(BBXMA_1)을 둘러싸는 경계 상자(bounding box) 외부의 영역과는 중첩되지 않는 제2 마스크 영역(MA2_1)을 포함하는 제2 마스크(MSK2_1)를 생성할 수 있다. 즉, 마스크 생성기(216_1)는 경계 상자 마스크(BBXMSK_1)의 경계 상자 영역(BBXMA_1) 내부에 대응하는 마 스크 영역을 포함하는 제2 마스크(MSK2_1)를 생성할 수 있다. 일 실시예에서, 마스크 생성기(216_1)는 제1 이미지(IMG1_1)의 결함 이미지 세그먼트(DF_1)가 형성되는 영역에 실질적으로 대응하는 마스킹 영역을 포함하는 제2 마스크(MSK2_1)를 생성할 수 있다. 예를 들어, 도 6을 참조하면, 마스크 생성기(216_1)는 이미지 변환기(213_1)가 생성한 제2 이미지(IMG2_1)와 제 1 이미지(IMG1_1)의 결함 이미지 세그먼트(DF_1)에 대응하는 이미지 세그먼트(IS_1)(또는, 제2 이미지(IMG2_1) 중 변환 마스크 영역(CMA_1)에 대응하는 영역)를 포함하는 영역과 대응하는 경계 상자 영역(BBXMA_1)을 포함하 는 경계 상자 마스크(BBXMSK_1)를 수신한 후, 상기 경계 상자 마스크(BBXMSK_1)의 경계 상자 영역(BBXMA_1) 중 적어도 일부 영역과 중첩하는 제2 마스크 영역(MA2_1)을 포함하는 제2 마스크(MSK2_1)를 생성할 수 있다. 일 실시예에서, 경계 상자 마스크(BBXMSK_1) 중 제2 마스크(MSK2_1)의 제2 마스크 영역(MA2_1)과 중첩하는 영역 은 경계 상자 영역(BBXMA_1) 내부에만 존재할 수 있다. 달리 말하면, 제2 마스크 영역(MA2_1)은 제2 마스크 (MSK2_1) 중 경계 상자 마스크(BBXMSK_1) 상의 경계 상자 영역(BBXMA_1) 내부에 대응하는 영역에만 형성될 수 있다. 일 예로, 마스크 생성기(216_1)는 경계 상자 영역(BBXMA_1) 내부의 영역에 대응하는 제2 마스크(MSK2_1) 상의 영역에만 제2 마스크 영역(MA2_1)을 포함하는 제2 마스크(MSK2_1)를 생성(또는, 산출, 출력)할 수 있다. 즉, 마스크 생성기(216_1)는 경계 상자 마스크(BBXMSK_1) 중 경계 상자 영역(BBXMA_1) 외부의 영역과 중첩되는 영역에는 제2 마스크 영역(MA2_1)을 포함하지 않는 제2 마스크(MSK2_1)를 생성(또는, 산출, 출력)할 수 있다. 다시 도 5를 참조하면, 판별기(217_1)는 학습기(210_1)가 외부로부터 수신한(또는, 보정 마스크 생성 시스템 이 제1 이미지(IMG1_1)로부터 생성한) 제1 마스크(MSK1_1) 및 마스크 생성기(216_1)가 생성한 제2 마스크 (MSK2_1)를 수신한 후, 마스크 생성기(216_1)의 제2 마스크(MSK2_1) 생성에 따른 데이터(data)의 손실(loss) 여부를 판별할 수 있다. 일 실시예에서, 판별기(217_1)는 제1 마스크(MSK1_1) 및 제2 마스크(MSK2_1) 간의 손실을 산출(또는, 생성)함으 로써 제2 마스크(MSK2_1) 생성에 따른 데이터 손실 여부를 판별할 수 있다. 예를 들어, 판별기(217_1)는 제1 마 스크(MSK1_1) 및 제2 마스크(MSK2_1)를 비교하여 NLL(음의 로그 가능도, negative log-likelihood) 손실을 산 출(또는, 생성)할 수 있다(예를 들어, NLL(negative log-likelihood) 손실 함수를 이용하여 손실을 산출 또는 생성함). 일 예로, 판별기(217_1)는 제1 마스크(MSK1_1)와 제2 마스크(MSK2_1) 간의 픽셀 값의 차이에 기초하여 데이터 손실을 판별할 수 있다. 이와 같은 판별기(217_1)의 동작에 의해, 보정 마스크 생성 모델이 제2 마스크 (MSK2_1)를 생성(또는, 복원, 디코딩)함에 있어서 마스크(예: 제1 마스크(MSK1_1))를 정확히 재현하는지 여부가 판별(또는, 검증, 학습)될 수 있다. 일 실시예에서, 판별기(217_1)는 제2 마스크(MSK2_1)에 대한 GAN(생성적 적대 신경망, generative adversarial network) 손실을 산출(또는, 생성)할 수 있다(예를 들어, GAN 손실 함수를 이용하여 손실을 산출 또는 생성함). 예를 들어, 판별기(217_1)는 제1 마스크(MSK1_1)와 제2 마스크(MSK2_1)를 비교(또는, 판별)함으로써 GAN 손실을 산출(또는, 생성)할 수 있다. 이와 같은 판별기(217_1)의 동작에 의해, 보정 마스크 생성 모델이 제2 마스크 (MSK2_1)를 생성(또는, 복원, 디코딩)함에 있어서 이미지를 사실적으로(예: 실제 이미지와 같이) 재현하는지 여 부가 판별(또는, 검증, 학습)될 수 있다. 다만, 판별기(217_1)의 동작이 이에 제한되는 것은 아니며, 판별기(217_1)는 다양한 방식을 이용하여 손실을 산 출(또는, 생성)할 수 있다. 일 실시예에서, 판별기(217_1)는 제2 마스크(MSK2_1)에 대한 NLL 손실 및 GAN 손실 을 동시에 산출할 수 있다. 일 실시예에서, 판별기(217_1)의 판별이 더 이상 진행되지 않는 경우, 학습기(210_1)는 생성된 보정 마스크 생 성 모델을 메모리(예: 도 1의 메모리)에 저장할 수 있다. 예를 들어, 판별기(217_1)가 생성한 제1 마스크 (MSK1_1) 및 제2 마스크(MSK2_1) 간의 손실이 기준 값보다 작거나 같은 경우, 학습기(210_1)는 생성된(또는, 학 습이 완료된) 보정 마스크 생성 모델을 메모리(예: 도 1의 메모리)에 저장할 수 있다. 일 실시예에서, 학습기(210_1)가 외부로부터 수신한(예: 사용자가 입력한) 제1 마스크(MSK1_1) 또는 학습기 (210_1)가 생성한 제1 마스크(MSK1_1)를 이용하여 모델을 학습할 수 있다. 예를 들어, 학습기(210_1)는 보정 마스크 생성 시스템(또는, 전자 장치)에 포함되는 입력 장치(예: 도 1의 입력부)가 수신한 마스크(예: 사용자가 입력부를 통하여 직접 입력한 마스크)를 제1 마스크 (MSK1_1)로서 이용(또는, 수신)하여 보정 마스크 생성 모델을 학습할 수 있다. 다른 예로, 학습기(210_1)는 보정 마스크 생성 시스템(또는, 전자 장치)에 포함되는 프로세서(예: 도 1의 프로세서)가 제1 이미지(IMG1_1)로부터 생성한 제1 마스크(MSK1_1)를 이용(또는, 수신)하여 보정 마스 크 생성 모델을 학습할 수 있다. 일 예로, 보정 마스크 생성 시스템(또는, 전자 장치)에 포함되는 프 로세서(예: 도 1의 프로세서)는 제1 이미지(IMG1_1)를 분할(image segmentation)하고 객체를 검출(object detection)하는 다양한 공지의 기술(또는, 모델)을 이용하여 제1 이미지(IMG1_1)의 적어도 일부 영역에 대응되 는 제1 마스크(MSK1_1)를 생성할 수 있다. <이미지 변환기를 학습하기 위한 학습기의 일 실시예> 도 7은 도 3의 이미지 변환기를 학습하기 위한 학습기의 일 예를 나타내는 블록도이다. 도 7을 참조하면, 학습기는 제3 이미지(IMG3)(또는, 기준 이미지)를 제4 이미지(IMG4)(또는, 복원 이미지, 생성 이미지)로 변환, 즉 제3 이미지(IMG3)로부터 제4 이미지(IMG4)를 생성하는 동작을 반복적으로 수행함에 따 라 가상 이미지 생성 모델을 학습할 수 있다. 실시예에 따라, 도 7에 도시된 학습기의 동작은 인공지능 모 델, 예를 들어, 가상 이미지 생성 모델을 학습하기 위한 훈련 동작으로 이해될 수 있다. 일 실시예에서, 학습기는 입력된 제3 이미지(IMG3)와 제3 마스크(MSK3)에 기초하여 가상 이미지 생성 모델 을 학습할 수 있다. 예를 들어, 학습기는 제3 마스크(MSK3)를 이용하여 제4 마스크(MSK4)를 생성하고, 제3 마스크(MSK3)와 제4 마스크(MSK4)를 이용하여 제3 이미지(IMG3)를 마스킹된(masked) 이미지로 변환하며, 상기 마스킹된 이미지, 제3 마스크(MSK3) 및 제4 마스크(MSK4)를 연결(concatenate)하여 제3 다채널 데이터 세트 (MCDS3)를 생성하고, 제3 다채널 데이터 세트(MCDS3)로부터 제4 이미지(IMG4)를 생성(또는, 변환, 복원)하는 동 작을 반복적으로 수행하고, 제3 이미지(IMG3)와 제4 이미지(IMG4)를 비교하여 손실(loss)을 산출하는 방식을 이 용함으로써 가상 이미지 생성 모델을 학습할 수 있다. 예를 들어, 상기 손실은 제3 이미지(IMG3)와 제4 이미지 (IMG4) 간의 픽셀 값의 차이를 나타내는 정보(예: 재구성(reconstruction) 손실), 생성적 적대 신경망 (generative adversarial network, GAN) 손실 중 적어도 하나를 포함할 수 있으나, 이는 단순히 예시적인 것으 로, 학습기에 의해 산출되는 손실이 이에 제한되는 것은 아니다. 여기서, 제3 마스크(MSK3)는 제3 이미지(IMG3)에 상응하며 일정한 크기 및 모양을 가지는 마스크(mask)(또는, 마스크 이미지)일 수 있다. 보다 구체적으로, 제3 이미지(IMG3)는 적어도 일부 영역에서 결함 이미지 세그먼트 를 포함하며, 제3 마스크(MSK3)는 결함 이미지 세그먼트에 대응하는 마스크 영역(이하, \"제3 마스크 영역\"이라 함)을 포함하는 마스크일 수 있다. 예를 들어, 결함 이미지 세그먼트가 배치되는 영역과 제3 마스크(MSK3)의 제 3 마스크 영역은 중첩할 수 있다(예를 들어, 결함 이미지 세그먼트가 배치되는 영역과 제3 마스크(MSK3)의 제3 마스크 영역은 실질적으로 동일한 영역임). 한편, 이상에서는 학습기가 제4 마스크(MSK4)를 생성하여 학습하는 동작을 기준으로 설명하였으나, 본 개 시의 실시예가 이에 제한되는 것은 아니다. 예를 들어, 학습기는 제4 마스크(MSK4)를 별도로 생성하지 않 고, 즉, 제3 이미지(IMG3) 및 제3 마스크(MSK3)만을 이용하여 가상 이미지 생성 모델을 학습할 수 있다. 예를 들어, 학습기는 제3 이미지(IMG3)와 제3 마스크(MSK3)를 수신하고 제3 마스크(MSK3)를 이용하여 제3 이미 지(IMG3)를 마스킹된 이미지로 변환하며, 상기 마스킹된 이미지와 제3 마스크(MSK3)를 연결(concatenate)하여 다채널 데이터 세트를 생성하고, 상기 생성된 다채널 데이터 세트로부터 제4 이미지를 생성(또는, 변환, 복원) 하는 동작을 반복적으로 수행함으로써 가상 이미지 생성 모델을 학습할 수도 있다. 이하에서는, 학습기가 제3 마스크(MSK3)로부터 제4 마스크(MSK4)를 생성하고, 제3 이미지(IMG3), 제3 마스 크(MSK3) 및 제4 마스크(MSK4)를 이용하여 가상 이미지 생성 모델을 학습하는 것을 기준으로 본 개시의 다양한실시예들을 설명하기로 한다. 일 실시예에서, 학습기는 마스크 생성기, 연산기, 이미지 생성기 및 판별기를 포함할 수 있다. 한편, 도 7에서는 마스크 생성기, 연산기, 이미지 생성기 및 판별기가 각각 별도 의 구성인 것으로 도시되어 있으나, 이는 단순히 설명의 편의를 위한 것으로, 본 개시의 실시예가 이에 제한되 는 것은 아니다. 예를 들어, 마스크 생성기, 연산기, 이미지 생성기 및 판별기 중 적어도 일부는 학습기 내에서 일체로 구성될 수 있다. 일 실시예에서, 마스크 생성기는 제3 마스크(MSK3)를 수신하고, 제3 마스크(MSK3)에 기초하여 제4 마스크 (MSK4)를 생성할 수 있다. 예를 들어, 제3 마스크(MSK3) 및 제4 마스크(MSK4) 각각은 이진(2진, binary) 형태 의 데이터(예: binary mask)로서 제3 이미지(IMG3)의 특정 영역을 선택하거나 필터링하는 데 사용될 수 있다. 일 예로, 제3 마스크(MSK3) 및 제4 마스크(MSK4) 각각은 해당 마스크 영역(예를 들어, 제3 마스크 영역 또는 제 4 마스크 영역)의 경계 또는 내부가 0(또는, 1)으로 채워지고, 해당 마스크 영역의 외부는 1(또는, 0)로 채워진 이진(2진, binary) 형태의 이미지(또는, 데이터)일 수 있다. 다만, 본 개시의 실시예가 이에 제한되는 것은 아 니다. 예를 들어, 제3 마스크(MSK3) 및 제4 마스크(MSK4) 각각은 RGB 색상, 즉, 적색(Red, R), 녹색(Green, G) 및 청색(Blue, B)을 가지는 마스크(예: RGB mask)일 수도 있다. 일 실시예에서, 제3 마스크(MSK3)에 포함되는 제3 마스크 영역 및 제4 마스크(MSK4)에 포함되는 제4 마스크 영 역은 비중첩할 수 있다. 실시예에 따라, 제3 마스크(MSK3)의 제3 마스크 영역과 제4 마스크(MSK4)의 제4 마스크 영역에 포함되는 각 픽 셀의 위치 값(또는, 좌표 값) 중 적어도 하나의 픽셀의 위치 값이 동일한 경우, 제3 마스크 영역 및 제4 마스크 영역은 중첩(예를 들어, 적어도 일부가 중첩됨)되는 것으로 정의될 수 있다. 예를 들어, 서로 다른 채널 (channel)(또는, 도메인)을 가지는 제3 마스크(MSK3) 및 제4 마스크(MSK4)가 연결(concatenate)되어 하나의 데 이터 세트(dataset)를 구성할 때, 해당 데이터 세트 내에서 제3 마스크 영역의 제3 픽셀이 제3 마스크(MSK3) 내 에서 갖는 위치 값(예: 해당 평면 상의 위치 값)과 제4 마스크 영역의 제4 픽셀이 제4 마스크(MSK4) 내에서 갖 는 위치 값(예: 해당 평면 상의 위치 값)이 동일한 경우, 제3 마스크 영역 및 제4 마스크 영역은 중첩되는 것으 로 정의될 수 있다. 달리 말하면, 제3 마스크(MSK3)에 의해 하나의 평면(plane)이 정의되고, 제4 마스크(MSK4) 에 의해 다른 하나의 평면이 정의될 때, 제3 마스크 영역의 적어도 하나의 픽셀과 제4 마스크 영역의 적어도 하 나의 픽셀이 동일한 2차원 좌표 값을 갖는 경우를 제3 마스크 영역 및 제4 마스크 영역이 중첩되는 경우로 정의 할 수 있다. 또한, 실시예에 따라, 제3 마스크(MSK3)의 제3 마스크 영역과 제4 마스크(MSK4)의 제4 마스크 영역에 포함되는 픽셀들 중 어느 하나의 픽셀도 동일한 2차원 좌표 값을 갖지 않는 경우, 제3 마스크 영역 및 제4 마스크 영역은 중첩되지 않는 것(즉, 비중첩)으로 정의될 수 있다. 일 실시예에서, 제3 마스크(MSK3)와 제4 마스크(MSK4) 각각은 하나의 경계선(boundary)에 의해 정의되는 단일 (single) 영역을 포함할 수 있다. 다만, 이는 단순히 예시적인 것으로, 제3 마스크(MSK3)와 제4 마스크(MSK4) 중 적어도 하나는 복수의 경계선들 각각에 의해 정의되는 복수의 영역들을 포함할 수도 있다. 본 개시에서, 제3 마스크(MSK3)는 결함 마스크로 명명할 수 있고, 제4 마스크(MSK4)는 정상 마스크(또는, 랜덤 정상 마스크)로 명명할 수 있다. 예를 들어, 결함 마스크, 예를 들어, 제3 마스크(MSK3)는 제3 이미지(IMG3) 상에 존재하는 물리적 또는 화학적 결함(예: 얼룩(stain), 스크래치(scratch), 찍힘(dent), 깨짐(crack), 그을음(soot) 등)의 형태(또는, 형상, 경계선)를 나타내는 정보일 수 있다. 즉, 제3 이미지(IMG3) 상에 포함되는 결함 이미지 세그먼트의 형태(또는, 형상, 경계선)와 제3 마스크(MSK3)에 포함되는 제3 마스크 영역의 형태(또는, 형상, 경계선)는 실질적으로 동일 할 수 있다. 또한, 정상 마스크는 제3 이미지(IMG3) 상에서 상기 물리적 또는 화학적 결함을 제외한 영역 중 임의의 일부 영 역을 나타내는 정보일 수 있다. 즉, 정상 마스크, 예를 들어, 제4 마스크(MSK4)의 제4 마스크 영역은 결함 마스 크, 예를 들어, 제3 마스크(MSK3)의 제3 마스크 영역과 비중첩하므로, 정상 마스크는 제3 이미지(IMG3) 상에서 결함 이미지 세그먼트가 배치되는 영역과 비중첩하는 영역의 적어도 일부와 중첩하는 영역(예: 제4 마스크 영역)을 포함하는 것으로 이해될 수 있다. 일 실시예에서, 제3 마스크(MSK3)와 제4 마스크(MSK4)는 특정 위치(또는, 성분)에 대응하여 1의 값(또는, True 값)을 가지며, 나머지 위치(또는, 성분)에 대응하여 0의 값(또는, False 값)을 가지는 인덱스 마스크(indexmask) 또는 불리언 마스크(Boolean mask)일 수 있으나, 이는 단순히 예시적인 것으로 본 개시의 실시예가 이에 제한되는 것은 아니다. 일 실시예에서, 연산기는 제3 이미지(IMG3), 제3 마스크(MSK3) 및 제4 마스크(MSK4)를 수신하고, 제3 이미 지(IMG3), 제3 마스크(MSK3) 및 제4 마스크(MSK4)에 기초하여 제3 다채널 데이터 세트(MCDS3)를 생성할 수 있다. 예를 들어, 연산기는 제3 마스크(MSK3)와 제4 마스크(MSK4)를 이용하여 제3 이미지(IMG3)를 마스킹 된(masked) 이미지로 변환(또는, 생성)하고, 상기 마스킹된 이미지, 제3 마스크(MSK3) 및 제4 마스크(MSK4)를 연결(concatenate)하여 제3 다채널 데이터 세트(MCDS3)를 생성할 수 있다. 일 실시예에서, 연산기는 제3 마스크(MSK3) 및 제4 마스크(MSK4)를 이용하여, 제3 이미지(IMG3) 중 제3 마 스크 영역에 대응하는 영역의 내부가 제3 마스크(MSK3)로 마스킹되고(masked), 제4 마스크 영역에 대응하는 영 역의 내부가 제4 마스크(MSK4)로 마스킹된 이미지를 생성할 수 있다. 예를 들어, 연산기는 수신한 제3 이미지(IMG3)에 대하여, 제3 이미지(IMG3) 중 제3 마스크(MSK3)의 제3 마 스크 영역에 대응하는 영역의 픽셀 값들을 재구성(예: 제3 마스크(MSK3)로 마스킹)하고, 제3 이미지(IMG3) 중 제4 마스크(MSK4)의 제4 마스크 영역에 대응하는 영역의 픽셀 값을 재구성(예: 제4 마스크(MSK4)로 마스킹)하여 마스킹된 이미지를 생성할 수 있다. 이에 따라, 마스킹된 이미지는, 제3 이미지(IMG3)를 기준으로 제3 마스크(MSK3)의 제3 마스크 영역에 대응하는 영역(예: 제3 마스크 영역과 중첩하는 영역)이 마스킹되고, 제4 마스크(MSK4)의 제4 마스크 영역에 대응하는 영 역(예: 제4 마스크 영역과 중첩하는 영역)이 마스킹된 이미지를 포함할 수 있다. 일 실시예에서, 연산기는 마스킹된 이미지, 제3 마스크 영역을 포함하는 제3 마스크(MSK3) 및 제4 마스크 영역을 포함하는 제4 마스크(MSK4)를 연결(concatenate)하여 제3 다채널 데이터 세트(MCDS3)를 생성(또는, 변환)할 수 있다. 예를 들어, 연산기는 마스킹된 이미지, 제3 마스크(MSK3) 및 제4 마스크(MSK4)를 행 또는 열의 방향으로 연결(concatenate)함으로써 복수 개의 채널(또는, 도메인)을 포함하는 제3 다채널 데이터 세트(MCDS3)를 생성할 수 있다. 일 예로, 마스킹된 이미지에 의해 제9 평면(예: z 축의 값이 i인 xy 평면)이 정의되고, 제3 마스크 (MSK3)에 의해 제10 평면(예: z 축의 값이 j인 xy 평면, 단, j는 i와 상이함)이 정의되며, 제4 마스크(MSK4)에 의해 제11 평면(예: z 축의 값이 k인 xy 평면, 단, k는 i 및 j와 상이함)이 정의될 수 있으며, 연산기는 제9 평면, 제10 평면 및 제11 평면과 각각 수직한 축 방향(예: z축 방향)으로 마스킹된 이미지, 제3 마스크 (MSK3) 및 제4 마스크(MSK4)를 연결(concatenate)하여 복수 개의 채널(또는, 평면)을 포함하는 제3 다채널 데이 터 세트(MCDS3)를 생성할 수 있다. 예를 들어, 연산기는 요소별 연산(예: ADD 연산) 및/또는 채널별 연산(예: CONCAT 연산 또는 CONCAT 함 수)를 이용하여, 마스킹된 이미지, 제3 마스크(MSK3) 및 제4 마스크(MSK4)에 대한 연결 작업(예: concatenate 작업)을 수행함으로써 제3 다채널 데이터 세트(MCDS3)를 생성할 수 있다. 일 예로, 서로 상이한 채널(channel) 을 가지는 마스킹된 이미지, 제3 마스크(MSK3) 및 제4 마스크(MSK4)에 대응하여, 연산기는 마스킹된 이미 지, 제3 마스크(MSK3) 및 제4 마스크(MSK4)에 대해 CONCAT 연산을 수행하여 제3 다채널 데이터 세트(MCDS3)를 생성할 수 있다. 다만, 이는 단순히 예시적인 것으로, 연산기의 동작이 이에 제한되는 것은 아니다. 예를 들어, 연산기는 element-wise summation, weighted summation 및 linear combination 중 적어도 하나를 이용하여 제3 다채널 데이터 세트(MCDS3)를 생성할 수도 있다. 이하에서는, 설명의 편의를 위하여, 마스킹된 이미지, 제3 마스크(MSK3) 및 제4 마스크(MSK4)가 상이한 채널을 가지며, 연산기가 채널별 연산(예: CONCAT 연산 또는 CONCAT 함수)을 수행하여 제3 다채널 데이터 세트 (MCDS3)를 생성하는 것을 기준으로 설명하기로 한다. 일 실시예에서, 이미지 생성기는 제3 다채널 데이터 세트(MCDS3)를 수신하고 제3 다채널 데이터 세트 (MCDS3)에 기초하여 제4 이미지(IMG4)를 생성할 수 있다. 예를 들어, 이미지 생성기는 연산기가 생성 한 제3 다채널 데이터 세트(MCDS3)를 수신하고, 제3 다채널 데이터 세트(MCDS3)로부터 학습기로 입력된 데 이터, 즉, 제3 이미지(IMG3)의 픽셀 값들과 실질적으로 동일한 픽셀 값들을 가지는 제4 이미지(IMG4)를 생성할 수 있다. 일 실시예에서, 이미지 생성기는 인공지능 모델(또는, 아키텍처)의 적어도 일부를 이용하여 제4 이미지 (IMG4)를 생성할 수 있다. 예를 들어, 이미지 생성기는 오토 인코더(auto-encoder), U-net(또는, 유-네트 워크) 또는 Adversarial Autoencoder(AAE) 등의 아키텍처(또는, 모델)을 이용하여 제3 다채널 데이터 세트(MCDS3)로부터 제4 이미지(IMG4)를 생성할 수 있다. 일 예로, 이미지 생성기는 오토 인코더(auto- encoder)와 동일한 및/또는 이와 실질적으로 동일한 동작을 수행할 수 있다. 구체적으로, 이미지 생성기는 입력된 제3 다채널 데이터 세트(MCDS3)에 대해 추상 피쳐(feature)로 압축(예: 차원을 축소함)하여 입력(즉, 이 미지 생성기로 입력된 제3 다채널 데이터 세트(MCDS3))을 내부 표현으로 변환함으로써 저차원(예: 1차원) 의 데이터로 변환하고, 상기 변환된 내부 표현(즉, 입력된 제3 다채널 데이터 세트(MCDS3)가 변환된 저차원(예: 1차원)의 데이터)을 출력으로 변환함으로써 고차원(예: 2차원)의 제4 이미지(IMG4)를 생성(또는, 복원, 디코 딩)할 수 있다. 즉, 이미지 생성기는 입력된 제3 다채널 데이터 세트(MCDS3)를 재구성(reconstruction)하 여 제4 이미지(IMG4)를 생성할 수 있다. 일 실시예에서, 이미지 생성기는 상기 변환된 내부 표현(즉, 입력된 제3 다채널 데이터 세트(MCDS3)가 변 환된 저차원(예: 1차원)의 데이터)을 출력으로 변환함에 있어서, 제3 다채널 데이터 세트(MCDS3)에 포함된 제3 마스크(MSK3) 및 제4 마스크(MSK4)에 대응하는 부분은 복원(또는, 디코딩)하지 않을 수 있다. 예를 들어, 전술 한 바와 같이, 제3 다채널 데이터 세트(MCDS3)는 마스킹된 이미지, 제3 마스크(MSK3) 및 제4 마스크(MSK4)를 포 함하는데, 본 개시의 실시예들에 따른 학습기는 입력된 이미지(예: 제3 이미지(IMG3))로부터 가상의 이미 지(예: 제4 이미지(IMG4))를 생성하는 모델(예: 가상 이미지 생성 모델)을 학습하기 위한 것이므로, 이미지 생 성기는 상기 내부 표현을 출력으로 변환하는 과정에서 제3 마스크(MSK3)와 제4 마스크(MSK4)에 대응하는 부분은 복원(또는, 디코딩)하지 않고, 이미지에 대응하는 부분(예: 마스킹된 이미지에 대응하는 부분)만을 복원 (또는, 디코딩)함으로써 제4 이미지(IMG4)를 생성할 수 있다. 또한, 일 실시예에서, 이미지 생성기는 상기 내부 표현을 출력으로 변환하는 과정에서 제3 마스크(MSK3)와 제4 마스크(MSK4)를 참조하여, 이미지에 대응하는 부분(예: 마스킹된 이미지에 대응하는 부분)을 복원(또는, 디 코딩)함으로써 제4 이미지(IMG4)를 생성할 수 있다. 예를 들어, 전술한 바와 같이, 제3 마스크(MSK3)(또는, 결함 마스크)는 제3 이미지(IMG3) 상에 포함되는 결함 이미지 세그먼트의 형태에 대응하는 제3 마스크 영역을 포함하므로, 이미지 생성기는 상기 내부 표현 중 이미지에 대응하는 부분, 예를 들어, 마스킹된 이미지에 대응하는 부분을 복원(또는, 디코딩)할 때 제3 마스크 영역에 대응하는 영역을 상기 결함 이미지 세그먼트의 형태로 변환함으로써 이미지를 복원하여 제4 이미지 (IMG4)를 생성할 수 있다. 이때, 이미지 생성기는 지정된 결함의 종류에 대응하여 제3 마스크 영역에 대응 하는 영역의 이미지 세그먼트를 복원할 수 있다. 여기서, 상기 지정된 결함의 종류는 기설정된(또는, 사전에 지 정된) 것이거나 외부 입력(예: 사용자 입력)에 의해 지정된 것일 수 있으나, 이에 제한되는 것은 아니다. 또한, 실시예에 따라, 전술한 지정된 결함의 종류는 학습기에 입력된 제3 이미지(IMG3)에 포함되는 결함 이미지 세그먼트와 동일한 종류의 결함일 수 있으나, 이는 단순히 예시적인 것으로, 본 개시의 실시예가 이에 제한되는 것은 아니다. 일 실시예에서, 이미지 생성기는 상기 내부 표현 중 이미지에 대응하는 부분, 예를 들어, 마스킹된 이미지 에 대응하는 부분을 복원(또는, 디코딩)할 때 제3 마스크 영역에 대응하는 영역을 정상 이미지 세그먼트의 형태 로 변환함으로써 이미지를 복원하여 제4 이미지(IMG4)를 생성할 수 있다. 이와 같은 학습 과정에 따라, 가상 결 함 이미지뿐만 아니라 가상 정상 이미지를 생성하는 가상 이미지 생성 모델이 학습될 수 있다. 또한, 전술한 바와 같이, 제4 마스크(MSK4)(또는, 정상 마스크, 랜덤 정상 마스크)의 제4 마스크 영역은 제3 마 스크(MSK3)(또는, 결함 마스크)의 제3 마스크 영역과 비중첩하므로, 제3 이미지(IMG3) 중 제4 마스크 영역에 대 응하는 이미지 세그먼트는 정상 이미지 세그먼트일 수 있다. 이에, 이미지 생성기는 상기 내부 표현 중 이 미지에 대응하는 부분, 예를 들어, 마스킹된 이미지에 대응하는 부분을 복원(또는, 디코딩)할 때 제4 마스크 영 역에 대응하는 영역을 정상 이미지 세그먼트의 형태로 변환함으로써 이미지를 복원하여 제4 이미지(IMG4)를 생 성할 수 있다. 다만, 이상에서 설명한 이미지 생성기의 동작은 예시적인 것으로서, 이미지 생성기는 다양한 방식을 이용하여 제4 이미지(IMG4)를 생성(또는, 복원, 디코딩)할 수 있다. 판별기는 학습기가 외부로부터 수신한 제3 이미지(IMG3) 및 이미지 생성기가 생성한 제4 이미지 (IMG4)를 수신한 후, 이미지 생성기의 제4 이미지(IMG4) 생성에 따른 데이터(data)의 손실(loss) 여부를 판별할 수 있다. 일 실시예에서, 판별기는 제3 이미지(IMG3) 및 제4 이미지(IMG4) 간의 손실을 산출(또는, 생성)함으로써 제4 이미지(IMG4) 생성에 따른 데이터 손실 여부를 판별할 수 있다. 예를 들어, 판별기는 제3 이미지(IMG3) 및 제4 이미지(IMG4)를 비교하여 재구성(reconstruction) 손실을 산출(또는, 생성)할 수 있다(예를 들어, 재구성(reconstruction) 손실 함수를 이용하여 손실을 산출 또는 생성함). 일 예로, 판별기는 제3 이미지(IMG3)와 제4 이미지(IMG4) 간의 픽셀 값의 차이에 기초하여 데이터 손실을 판별할 수 있다. 이와 같은 판별기의 동작에 의해, 가상 이미지 생성 모델이 제4 이미지(IMG4)를 생성(또는, 복원, 디코딩)함에 있어 서 이미지(예: 제3 이미지(IMG3))를 정확히 재현하는지 여부가 판별(또는, 검증, 학습)될 수 있다. 일 실시예에서, 판별기는 제4 이미지(IMG4)에 대한 GAN(생성적 적대 신경망, generative adversarial network) 손실을 산출(또는, 생성)할 수 있다(예를 들어, GAN 손실 함수를 이용하여 손실을 산출 또는 생성함). 예를 들어, 판별기는 제3 이미지(IMG3)와 제4 이미지(IMG4)를 비교(또는, 판별)함으로써 GAN 손실을 산출 (또는, 생성)할 수 있다. 이와 같은 판별기의 동작에 의해, 가상 이미지 생성 모델이 제4 이미지(IMG4)를 생성(또는, 복원, 디코딩)함에 있어서 이미지를 사실적으로(예: 실제 이미지와 같이) 재현하는지 여부가 판별 (또는, 검증, 학습)될 수 있다. 다만, 판별기의 동작이 이에 제한되는 것은 아니며, 판별기는 다양한 방식을 이용하여 손실을 산출 (또는, 생성)할 수 있다. 일 실시예에서, 판별기의 판별이 더 이상 진행되지 않는 경우, 학습기는 생성된 가상 이미지 생성 모 델을 메모리(예: 도 1의 메모리)에 저장할 수 있다. 예를 들어, 판별기가 생성한 제3 이미지(IMG3) 및 제4 이미지(IMG4) 간의 손실이 기준 값보다 작거나 같은 경우, 학습기는 생성된(또는, 학습이 완료된) 가상 이미지 생성 모델을 메모리(예: 도 1의 메모리)에 저장할 수 있다. 일 실시예에서, 학습기가 외부로부터 수신한(예: 사용자가 입력한) 제3 마스크(MSK3) 또는 학습기가 생성한 제3 마스크(MSK3)를 이용하여 모델을 학습할 수 있다. 예를 들어, 학습기는 보정 마스크 생성 시스템(또는, 전자 장치)에 포함되는 입력 장치(예: 도 1의 입력부)가 수신한 마스크(예: 사용자가 입력부를 통하여 직접 입력한 마스크)를 제3 마스크 (MSK3)로서 이용(또는, 수신)하여 가상 이미지 생성 모델을 학습할 수 있다. 다른 예로, 학습기는 보정 마스크 생성 시스템(또는, 전자 장치)에 포함되는 프로세서(예: 도 1 의 프로세서)가 제3 이미지(IMG3)로부터 생성한 제3 마스크(MSK3)를 이용(또는, 수신)하여 가상 이미지 생 성 모델을 학습할 수 있다. 일 예로, 보정 마스크 생성 시스템(또는, 전자 장치)에 포함되는 프로세 서(예: 도 1의 프로세서)는 제3 이미지(IMG3)를 분할(image segmentation)하고 객체를 검출(object detection)하는 다양한 공지의 기술(또는, 모델)을 이용하여 제3 이미지(IMG3)의 적어도 일부 영역에 대응되는 제3 마스크(MSK3)를 생성할 수 있다. 한편, 도 3을 참조하여 설명한 학습기에 포함되는 이미지 변환기는 도 7을 참조하여 설명한 가상 이 미지 생성 모델을 이용하여 제1 다채널 데이터 세트(MCDS1)로부터 제2 이미지(IMG2)를 생성할 수 있다. 예를 들 어, 이미지 변환기는 가상 이미지 생성 모델을 이용하여 제1 다채널 데이터 세트(MCDS1) 중 변환 마스크 영역(CMA)에 대응하는 영역에 포함되는 이미지 세그먼트(예: 도 4의 결함 이미지 세그먼트(DF))를 정상 이미지 세그먼트(예: 도 4의 이미지 세그먼트(IS))로 변환할 수 있다. <생성기의 일 실시예> 도 8은 도 2의 보정 마스크 생성 시스템에 포함되는 생성기의 일 예를 나타내는 블록도이다. 도 9는 도 8의 생성기의 동작의 일 예를 설명하기 위한 도면이다. 도 10은 도 8의 생성기의 동작의 다른 일 예를 설명하기 위한 도면이다. 도 11은 도 8의 생성기의 동작의 또 다른 일 예를 설명하기 위한 도면이다. 도 3, 도 8 내지 도 11을 참조하면, 보정 마스크 생성 시스템에 포함되는 생성기는 입력 이미지(INP) 및 입력 마스크(IMSK)를 이용하여 출력 마스크(OMSK)를 생성할 수 있다. 즉, 보정 마스크 생성 시스템에 포함되는 생성기는 학습기에 의해 학습(또는, 생성)된 보정 마스크 생성 모델을 이용하여 입력 이미 지(INP)에 대한 추론(inference)을 수행함으로써 출력 마스크(OMSK)(또는, 보정 마스크)을 생성(또는, 산출, 변 환)할 수 있다. 예를 들어, 보정 마스크 생성 시스템에 포함되는 생성기는 도 3을 참조하여 설명한 학습기의 마스크 추출기, 제2 연산기 및 마스크 생성기의 구조, 구동 및/또는 기능 중 적어도 일부를 차용하여 구현될 수 있다. 일 실시예에서, 생성기는 입력 이미지(INP) 및 입력 마스크(IMSK)를 수신하고, 입력 마스크(IMSK)로부터 경계 상자 마스크(BMSK)를 생성하며, 입력 이미지 및 경계 상자 마스크(BMSK)를 연결(concatenate)하여 입력 데 이터 세트(또는, 다채널 데이터 세트)를 생성(또는, 산출, 출력)하고, 상기 입력 데이터 세트로부터 출력 마스 크(OMSK)를 생성할 수 있다. 한편, 이하에서 설명되는 생성기의 동작은 도 3 및 도 4를 참조하여 설명한 학습기(예: 마스크 생성기)의 동작 중 적어도 일부와 실질적으로 동일하거나 유사할 수 있다. 예를 들어, 학습기에 의해 학습된 마스크 생성기의 동작에 대응하여 보정 마스크 생성 모델이 학습(또는, 생성)되며, 생성기는 이와 같은 보정 마스크 생성 모델을 이용하여 출력 마스크(OMSK)(또는, 보정 마스 크)를 생성할 수 있다. 일 실시예에서, 생성기는 수신한 입력 마스크(IMSK)로부터 경계 상자 마스크(BMSK)를 생성할 수 있다. 예 를 들어, 생성기는 수신한 입력 마스크(IMSK)의 입력 마스크 영역을 포함하는 영역에 대응하는 경계 상자 영역을 포함하는 경계 상자 마스크를 생성할 수 있다.일 실시예에서, 생성기는 입력 이미지 및 경계 상자 마스크를 이용하여 입력 데이터 세트를 생성할 수 있다. 예를 들어, 생성기는 서로 다른 채널(또는, 도메 인)에 포함되는(또는, 속하는) 입력 이미지와 경계 상자 마스크를 연결(concatenate)하여 2개의 채널로 구성된 입력 데이터 세트를 생성(또는, 산출, 출력)할 수 있다. 실시 예에 따라, 입력 이미지(INP)는 결함 이미지(또는, 결함 이미지 세그먼트를 포함하는 이미지) 또는 정상 이미지일 수 있다. 일 실시예에서, 생성기는 상기 입력 데이터 세트로부터 출력 마스크(OMSK)를 생성할 수 있다. 예를 들어, 생성기는 입력 이미지 및 경계 상자 마스크가 포함된 입력 데이터 세트를 이용하여, 경계 상자 마스크의 경계 상자 영역에 대응하는 영역에 출력 마스크 영역을 포함하는 출력 마스크(OMSK)를 생성할 수 있다. 도 9를 더 참조하면, 일 실시예에서, 생성기는 하나의 입력 이미지(INP_1) 및 하나의 입력 마스크(IMSK_ 1)를 이용하여 출력 마스크(OMSK_1)를 생성할 수 있다. 예를 들어, 생성기는 입력 이미지(INP_1) 및 입력 마스크(IMSK_1)를 수신하고, 입력 마스크(IMSK_1)를 이용하여 입력 마스크 영역을 포함하는 영역에 대응하는 경 계 상자 영역(BMA_1)을 포함하는 경계 상자 마스크(BMSK_1)를 생성하며, 입력 이미지(INP_1) 및 경계 상자 마스 크(BMSK_1)를 연결(concatenate)하여 입력 데이터 세트(INDS_1)를 생성하고, 입력 데이터 세트(INDS_1)로부터 출력 마스크 영역(OMA_1) 내부에 이미지 세그먼트(IS_1)(예: 결함 이미지 세그먼트)를 포함하는 출력 마스크 (OMSK_1)를 생성할 수 있다. 도 10을 더 참조하면, 일 실시예에서, 생성기는 하나의 입력 이미지(INP_2) 및 두 개의 입력 마스크들 (IMSK1_2, IMSK2_2)을 포함하는 입력 마스크(IMSK_2)를 이용하여 출력 마스크(OMSK_2)를 생성할 수 있다. 예를 들어, 생성기는 입력 이미지(INP_2), 제1 입력 마스크(IMSK1_2) 및 제2 입력 마스크(IMSK2_2)를 수신하고, 제1 입력 마스크(IMSK1_2)를 이용하여 제1 경계 상자 영역(BMA1_2)을 포함하는 제1 경계 상자 마스크 (BMSK1_2)를 생성하며, 제2 입력 마스크(IMSK2_2)를 이용하여 제2 경계 상자 영역(BMA2_2)을 포함하는 제2 경계 상자 마스크(BMSK2_2)를 생성하고, 입력 이미지(INP_2), 제1 경계 상자 마스크(BMSK1_2) 및 제2 경계 상자 마스 크(BMSK2_2)를 연결(concatenate)하여 입력 데이터 세트(INDS_2)를 생성(또는, 산출, 출력)하며, 입력 데이터 세트(INDS_2)로부터 제1 출력 마스크 영역(OMA1_2) 내부에 제1 이미지 세그먼트(IS1_2)를 포함하고 제2 출력 마 스크 영역(OMA2_2) 내부에 제2 이미지 세그먼트(IS2_2)를 포함하는 출력 마스크(OMSK_2)를 생성할 수 있다. 다시 도 8을 참조하면, 일 실시예에서, 생성기는 입력 이미지(INP) 및 입력 마스크(IMSK)를 수신하고, 상 기 입력 이미지(INP) 및 입력 마스크(IMSK)를 연결(concatenate)하여 입력 데이터 세트를 생성하며, 상기 입력 데이터 세트로부터 출력 마스크(OMSK)를 생성할 수 있다. 다시 말하면, 생성기는 입력 마스크(IMSK)로부터 경계 상자 마스크를 생성하지 않고 입력 이미지(INP) 및 입력 마스크(IMSK)만을 이용하여 출력 마스크(OMSK)를 생성할 수 있다. 도 11을 더 참조하면, 일 실시예에서, 생성기는 입력 이미지(INP_3), 제1 입력 마스크(IMSK1_3) 및 제2 입 력 마스크(IMSK2_3)로부터 추출된 경계 상자 마스크(BMSK_3)를 이용하여 출력 마스크(OMSK_3)를 생성할 수 있다. 즉, 생성기가 수신한 제1 입력 마스크(IMSK1_3)의 제1 입력 마스크 영역(IMA_3)이 직사각 또는 정사 각 형태인 경우(즉, 제1 입력 마스크 영역(IMA_3)이 박스(box)의 형태인 경우), 생성기는 제1 입력 마스크 (IMSK1_3)로부터 경계 상자 마스크를 생성하지 않고, 입력 이미지(INP_3), 제1 입력 마스크(IMSK1_3) 및 제2 입 력 마스크(IMSK2_3)로부터 추출(또는, 생성)한 경계 상자 마스크(BMSK_3)만을 이용하여 출력 마스크(OMSK_3)를 생성할 수 있다.예를 들어, 생성기는 외부(예: 사용자의 입력)로부터 입력 이미지(INP_3), 제1 입력 마스크 영역(IMA_3)을 포함하는 제1 입력 마스크(IMSK1_3) 및 제2 입력 마스크(IMSK2_3)를 수신하고, 제2 입력 마스크(IMSK2_3)로부터 경계 상자 마스크(BMSK_3)를 생성하며, 입력 이미지(INP_3), 제1 입력 마스크(IMSK1_3), 경계 상자 마스크 (BMSK_3)를 연결(concatenate)하여 입력 데이터 세트(INDS_3)를 생성하고, 입력 데이터 세트(INDS_3)를 이용하 여 제1 입력 마스크 영역(IMA_3) 내의 적어도 일부 영역에 대응하는 제1 출력 마스크 영역(OMA1_3) 및 경계 상 자 영역(BMA_3) 내의 적어도 일부 영역에 대응하는 제2 출력 마스크 영역(OMA2_3)을 가지는 출력 마스크 (OMSK_3)를 생성할 수 있다. 즉, 생성기는 입력 이미지(INP_3), 제1 입력 마스크(IMSK1_3) 및 제2 입력 마스크(IMSK2_3)로부터 추출(또는, 변환)한 경계 상자 마스크(BMSK_3)를 이용하여, 제1 입력 마스크 영역 (IMA_3) 내부의 영역과는 중첩되면서 제1 입력 마스크 영역(IMA_3) 외부의 영역과는 중첩되지 않는 제1 출력 마 스크 영역(OMA1_3) 및 경계 상자 영역(BMA_3) 내부의 영역과는 중첩되면서 경계 상자 영역(BMA_3) 외부의 영역 과는 중첩되지 않는 제2 출력 마스크 영역(OMA2_3)을 포함하는 출력 마스크(OMSK_3)를 생성(또는, 출력)할 수 있다. 여기서, 생성기가 생성한 출력 마스크(OMSK_3)는 제1 출력 마스크 영역(OMA1_3) 내부에 제1 이미지 세그먼트(IS1_3)를 포함하고, 제2 출력 마스크 영역(OMA2_3) 내부에 제2 이미지 세그먼트(IS2_3)를 포함할 수 있다. 도 1 내지 도 11을 참조하여 설명한 바와 같이, 본 개시의 실시예에 따른 보정 마스크 생성을 위한 시스템, 장 치, 방법 및 컴퓨터 프로그램에 있어서, 보정 마스크 생성 시스템(또는, 전자 장치)은 보정 마스크 생성 모델을 학습하고, 학습된 보정 마스크 생성 모델을 이용하여 보정 마스크를 생성할 수 있다. 여기서, 보정 마스크 생성 시스템(또는, 전자 장치)은 하나의 제1 이미지(예를 들어, 결함 이미지 세그먼트를 포함하는 하나의 제1 이미지) 및 이에 상응하는 제1 마스크를 이용하여 보정 마스크 생성 모델을 학습할 수 있다. 즉, 본 개시의 실 시예에 따른 보정 마스크 생성 시스템(또는, 전자 장치)은 기준 이미지(또는, 제1 이미지)로서 하나의 기준 이 미지만을 이용하여 보정 마스크 생성 모델을 학습하므로, 입력 데이터로서 정상 이미지를 이용하지 않고도 학습 동작을 수행할 수 있으며, 상대적으로 적은 개수의 기준 이미지를 이용하여 학습 동작을 수행할 수 있다. 이에 따라, 보정 마스크 생성 모델의 학습 동작이 보다 단순화될 수 있으며, 학습 시간이 최소화될 수 있다. 또한, 본 개시의 실시예에 따른 보정 마스크 생성 시스템(또는, 전자 장치)은 제1 이미지(또는, 기준 이미지) 및 이에 상응하는 제1 마스크에 형성되는 결함의 종류에 기반하여 보정 마스크 생성 모델을 학습하므로, 다양한 결함에 대한 학습을 동시에 수행할 수 있다. 이와 같은 학습 과정에 기반하여, 본 개시의 실시예에 따른 보정 마스크 생성을 위한 시스템, 장치, 방법 및 컴 퓨터 프로그램에 있어서, 보정 마스크 생성 시스템(또는, 전자 장치)이 학습(또는, 생성)된 보정 마스크 생성 모델을 이용하여 보정 마스크(출력 마스크)를 생성함에 있어서, 보정 마스크 생성 시스템(또는, 전자 장치)은 하나의 입력 이미지 및 입력 마스크만을 이용하여 출력 마스크(또는, 보정 마스크)를 생성할 수 있다. 이에, 보 정 마스크 생성 모델의 보정 마스크 생성 동작이 보다 단순화될 수 있고, 적은 개수의 입력 이미지 및 입력 마 스크로부터 많은 개수의 보정 마스크(출력 마스크)가 생성될 수 있다. 또한, 본 개시의 실시예에 따른 보정 마스크 생성을 위한 시스템, 장치, 방법 및 컴퓨터 프로그램에 있어서, 본 개시의 실시예에 따른 보정 마스크 생성 시스템(또는, 전자 장치)은 유저(또는, 사용자)가 러프하게(또는, 개략 적으로) 입력한 입력 마스크 내부의 피사체의 구조와 결함의 종류를 고려하여 정밀한 출력 마스크(또는, 보정 마스크)를 생성할 수 있다. 즉, 본 개시의 실시예에 따른 보정 마스크 생성 시스템(또는, 전자 장치)은 입력 마 스크에 포함된 결함의 종류와 피사체(또는, 결함 이미지 세그먼트)의 구조에 기반하여 유저(또는, 사용자)가 러 프하게(또는, 개략적으로) 그린(또는, 입력한) 영역(또는, 마스크 영역) 내부에 가장 자연스러운(또는, 있을법 한) 보정 마스크(또는, 출력 마스크)를 생성(또는, 형성)할 수 있다. <본 개시의 실시예들에 따른 방법> 도 12는 본 개시의 다양한 실시예들에 따른 보정 마스크 생성 방법을 나타내는 순서도이다. 도 1 내지 도 12를 참조하면, 일 실시예에서, 도 12의 보정 마스크 생성 방법은 도 1 내지 도 11을 참조하여 설 명한 보정 마스크 생성 시스템(또는, 전자 장치) 상에서 수행될 수 있다. 예를 들어, 도 12의 보정 마스크 생성 방법은 도 1 내지 도 11을 참조하여 설명한 보정 마스크 생성 시스템(또는, 전자 장치) 의 동작과 실질적으로 동일할 수 있다. 이에, 중복되는 설명은 반복하지 않기로 한다. 도 12를 참조하면, 도 12의 보정 마스크 생성 방법은 보정 마스크 생성 모델을 학습하고, 학습된 보정 마스크 생성 모델에 기초하여 보정 마스크(또는, 출력 마스크)를 생성하는 단계를 포함할 수 있다. 일 실시예에서, 도 12의 보정 마스크 생성 방법은, 제1 이미지 및 제1 마스크에 기초하여 보정 마스크 생성 모 델을 학습(S1210)하는 단계를 포함할 수 있다. 예를 들어, 제1 이미지 및 제1 마스크에 기초하여 보정 마스크 생성 모델을 학습(S1210)하는 단계는, 도 1 내지 도 11을 참조하여 설명한 학습기(예: 도 2의 학습기)가 제1 이미지(예: 제1 이미지(IMG1)) 및 제1 마스크(예: 제1 마스크(MSK1))에 기초하여 보정 마스크 생성 모델을 학습하는 구성과 실질적으로 동일하거나 유사하므로, 중복되는 설명은 반복하지 않기로 한다. 일 실시예에서, 도 12의 보정 마스크 생성 방법은, 보정 마스크 생성 모델을 이용하여 입력 이미지 및 입력 마 스크로부터 보정 마스크(또는, 출력 마스크)를 생성(S1220)하는 단계를 포함할 수 있다. 예를 들어, 보정 마스 크 생성 모델을 이용하여 입력 이미지 및 입력 마스크로부터 보정 마스크를 생성(S1220)하는 단계는, 도 1 내지 도 11을 참조하여 설명한 생성기(예: 도 2의 생성기)가 입력 이미지(예: 입력 이미지(INP, INP_1, INP_2, INP_3)) 및 입력 마스크(예: 입력 마스크(IMSK, IMSK1_1, IMSK_2, IMSK_3))로부터 출력 마스크(OMSK, OMSK_1, OMSK_2, OMSK_3)(또는, 보정 마스크)를 생성하는 구성과 실질적으로 동일하거나 유사하므로, 중복되는 설명은 반복하지 않기로 한다. 도 13은 도 12의 보정 마스크 생성 방법의 일 예를 나타내는 순서도이다. 한편, 도 13에는 도 12의 보정 마스크 생성 방법에 포함되는 단계들 중 제1 이미지 및 제1 마스크에 기초하여 보정 마스크 생성 모델을 학습(S1210)하는 단계의 일 예를 나타내는 순서도가 도시되어 있다. 일 실시예에서, 도 12 및 도 13를 참조하면, 도 13의 보정 마스크 생성 방법(예: 도 12의 보정 마스크 생성 방 법에 포함되는 제1 이미지 및 제1 마스크에 기초하여 보정 마스크 생성 모델을 학습(S1210)하는 단계)은, 제1 마스크를 변환 마스크로 변환(S1211)하는 단계, 제1 마스크를 이용하여 제1 이미지를 마스킹된 이미지로 변환 (S1212)하는 단계, 마스킹된 이미지 및 변환 마스크를 연결하여 제1 다채널 데이터 세트를 생성(S1213)하는 단 계, 마스킹된 이미지 중 변환 마스크 영역에 대응하는 영역의 픽셀 값들을 재구성한 제2 이미지를 생성(S1214) 하는 단계, 제1 마스크 중 제1 마스크 영역을 포함하는 영역에 대응하는 경계 상자 영역을 포함하는 경계 상자 마스크를 생성(S1215)하는 단계, 제2 이미지 및 경계 상자 마스크를 연결하여 제2 다채널 데이터 세트를 생성 (S1216)하는 단계, 제2 다채널 데이터 세트를 이용하여 경계 상자 영역 내의 적어도 일부 영역에 대응하는 제2 마스크 영역을 포함하는 제2 마스크를 생성(S1217)하는 단계 및 제1 마스크와 제2 마스크를 비교함으로써 산출 된 손실에 기초하여 보정 마스크 생성 모델을 학습(S1218)하는 단계를 포함할 수 있다. 일 실시예에서, 제1 마스크를 변환 마스크로 변환(S1211)하는 단계는 도 1 내지 도 11을 참조하여 설명한 마스 크 변환기가 제1 마스크(MSK1)를 변환 마스크(CMSK)로 변환하는 구성과 실질적으로 동일하거나 유사하므로, 중복되는 설명을 반복하지 않기로 한다. 일 실시예에서, 마스킹된 이미지 및 제1 마스크를 연결하여 제1 다채널 데이터 세트를 생성(S1212)하는 단계는 도 1 내지 도 11을 참조하여 설명한 제1 연산기가 제1 이미지(IMG1)를 마스킹된 이미지(MI)로 변환하는 구 성과 실질적으로 동일하거나 유사하므로, 중복되는 설명은 반복하지 않기로 한다. 일 실시예에서, 마스킹된 이미지 및 변환 마스크를 연결하여 제1 다채널 데이터 세트를 생성(S1213)하는 단계는 도 1 내지 도 11을 참조하여 설명한 제1 연산기가 마스킹된 이미지(MI) 및 제1 마스크(MSK1)를 연결하여 제1 다채널 데이터 세트(MCDS1)를 생성하는 구성과 실질적으로 동일하거나 유사하므로, 중복되는 설명은 반복하 지 않기로 한다. 일 실시예에서, 마스킹된 이미지 중 변환 마스크 영역에 대응하는 영역의 픽셀 값들을 재구성한 제2 이미지를 생성(S1214)하는 단계는 도 1 내지 도 11을 참조하여 설명한 이미지 변환기가 마스킹된 이미지(MI) 중 변 환 마스크 영역(CMA)에 대응하는 영역의 픽셀 값들을 재구성한 제2 이미지(IMG2)를 생성하는 구성과 실질적으로 동일하거나 유사하므로, 중복되는 설명은 반복하지 않기로 한다. 일 실시예에서, 제1 마스크 중 제1 마스크 영역을 포함하는 영역에 대응하는 경계 상자 영역을 포함하는 경계 상자 마스크를 생성(S1215)하는 단계는 도 1 내지 도 11을 참조하여 설명한 마스크 추출기가 제1 마스크 (MSK1)로부터 제1 마스크 영역(MA1)을 포함하는 영역에 대응하는 경계 상자 영역(BBXMA)을 포함하는 경계 상자 마스크(BBXMSK)를 생성하는 구성과 실질적으로 동일하거나 유사하므로, 중복되는 설명은 반복하지 않기로 한다. 일 실시예에서, 제2 이미지 및 경계 상자 마스크를 연결하여 제2 다채널 데이터 세트를 생성(S1216)하는 단계는 도 1 내지 도 11을 참조하여 설명한 제2 연산기가 제2 이미지(IMG2) 및 경계 상자 마스크(BBXMSK)를 연결하여 제2 다채널 데이터 세트(MCDS2)를 생성하는 구성과 실질적으로 동일하거나 유사하므로, 중복되는 설명은 반복하지 않기로 한다. 일 실시예에서, 제2 다채널 데이터 세트를 이용하여 경계 상자 영역 내의 적어도 일부 영역에 대응하는 제2 마 스크 영역을 포함하는 제2 마스크를 생성(S1217)하는 단계는 도 1 내지 도 11을 참조하여 설명한 마스크 생성기 가 제2 다채널 데이터 세트(MCDS2)를 이용하여 경계 상자 영역(BBXMA) 내의 적어도 일부 영역에 대응하는 제2 마스크 영역(MA2)을 포함하는 제2 마스크(MSK2)를 생성하는 구성과 실질적으로 동일하거나 유사하므로, 중 복되는 설명은 반복하지 않기로 한다. 일 실시예에서, 제1 마스크와 제2 마스크를 비교함으로써 산출된 손실에 기초하여 보정 마스크 생성 모델을 학 습(S1218)하는 단계는 도 1 내지 도 11을 참조하여 설명한 학습기(예: 판별기)가 제1 마스크(MSK1)와 제2 마스크(MSK2)를 비교함으로써 산출된 손실(loss)에 기초하여 보정 마스크 생성 모델을 학습하는 구성과 실 질적으로 동일하거나 유사하므로, 중복되는 설명은 반복하지 않기로 한다. 한편, 도 12 및 도 13에 도시된 순서도에서, 각 단계의 순서는 제한되지 않으며, 실시예에 따라 적절히 변형 및 /또는 조정될 수 있다. 예를 들어, 각 단계의 순서가 변경되거나, 단계들 중 적어도 일부가 병렬적으로 수행되 거나 동시에 수행될 수 있다. 또한, 실시예에 따라, 단계들 중 적어도 일부가 생략되거나 다른 단계가 추가될 수 있다. <본 개시의 실시예들에 따른 컴퓨터 프로그램> 이상 설명된 본 개시에 따른 실시예들은 다양한 컴퓨터 구성요소를 통하여 수행될 수 있는 프로그램 명령어의 형태로 구현되어 컴퓨터 판독 가능한 기록 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능한 기록 매체는 프로 그램 명령어, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 컴퓨터 판독 가능 한 기록 매체에 기록되는 프로그램 명령어는 본 개시를 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프 트웨어 분야의 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가능한 기록 매체의 예에는, 하 드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체, CD-ROM, DVD와 같은 광기록 매체, 플롭티컬 디스 크(floptical disk)와 같은 자기-광 매체(magneto-optical media), 및 ROM, RAM, 플래시 메모리 등과 같은 프 로그램 명령어를 저장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함될 수 있다. 프로그램 명령어의 예에 는, 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드도 포함될 수 있다. 상기 하드웨어 장치는 본 개시에 따른 처리를 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지이다. 한편, 상술한 방법들(예: 도 12 및 도 13의 방법들) 중 적어도 일부는 하드웨어, 소프트웨어, 펌웨어, 미들웨어, 마이크로코드, 하드웨어 기술 언어, 또는 상기 중 둘 이상의 조합 중 하나에 의해 구현될 수 있다. 상술한 방법들 중 상기 적어도 일부가 소프트웨어, 펌웨어, 미들웨어 또는 마이크로 코드로 구현되는 경우, 필 요한 작업을 수행하기 위한 프로그램 코드 또는 코드 세그먼트는 저장 매체와 같은 기계 또는 컴퓨터 판독 가능 매체에 저장될 수 있으며, 이를 통해, 프로세서가 필요한 작업을 수행할 수 있다. <본 개시의 실시예들에 따른 다양한 효과> 이상에서 설명한 바와 같이, 본 개시의 실시예에 따른 보정 마스크 생성을 위한 시스템, 장치, 방법 및 컴퓨터 프로그램에 있어서, 보정 마스크 생성 시스템(또는, 전자 장치)은 보정 마스크 생성 모델을 학습하고, 학습된 보정 마스크 생성 모델을 이용하여 보정 마스크를 생성할 수 있다. 여기서, 보정 마스크 생성 시스템(또는, 전 자 장치)은 하나의 제1 이미지(예를 들어, 결함 이미지 세그먼트를 포함하는 하나의 제1 이미지) 및 이에 상응 하는 제1 마스크를 이용하여 보정 마스크 생성 모델을 학습할 수 있다. 즉, 본 개시의 실시예에 따른 보정 마스 크 생성 시스템(또는, 전자 장치)은 기준 이미지(또는, 제1 이미지)로서 하나의 기준 이미지만을 이용하여 보정 마스크 생성 모델을 학습하므로, 입력 데이터로서 정상 이미지를 이용하지 않고도 학습 동작을 수행할 수 있으 며, 상대적으로 적은 개수의 기준 이미지를 이용하여 학습 동작을 수행할 수 있다. 이에 따라, 보정 마스크 생 성 모델의 학습 동작이 보다 단순화될 수 있으며, 학습 시간이 최소화될 수 있다. 또한, 본 개시의 실시예에 따 른 보정 마스크 생성 시스템(또는, 전자 장치)은 제1 이미지(또는, 기준 이미지) 및 이에 상응하는 제1 마스크 에 형성되는 결함의 종류에 기반하여 보정 마스크 생성 모델을 학습하므로, 다양한 결함에 대한 학습을 동시에수행할 수 있다. 이와 같은 학습 과정에 기반하여, 본 개시의 실시예에 따른 보정 마스크 생성을 위한 시스템, 장치, 방법 및 컴 퓨터 프로그램에 있어서, 보정 마스크 생성 시스템(또는, 전자 장치)이 학습(또는, 생성)된 보정 마스크 생성 모델을 이용하여 보정 마스크(출력 마스크)를 생성함에 있어서, 보정 마스크 생성 시스템(또는, 전자 장치)은 하나의 입력 이미지 및 입력 마스크만을 이용하여 출력 마스크(또는, 보정 마스크)를 생성할 수 있다. 이에, 보 정 마스크 생성 모델의 보정 마스크 생성 동작이 보다 단순화될 수 있고, 적은 개수의 입력 이미지 및 입력 마 스크로부터 많은 개수의 보정 마스크(출력 마스크)가 생성될 수 있다. 또한, 본 개시의 실시예에 따른 보정 마스크 생성을 위한 시스템, 장치, 방법 및 컴퓨터 프로그램에 있어서, 본 개시의 실시예에 따른 보정 마스크 생성 시스템(또는, 전자 장치)은 유저(또는, 사용자)가 러프하게(또는, 개략 적으로) 입력한 입력 마스크 내부의 피사체의 구조와 결함의 종류를 고려하여 정밀한 출력 마스크(또는, 보정 마스크)를 생성할 수 있다. 즉, 본 개시의 실시예에 따른 보정 마스크 생성 시스템(또는, 전자 장치)은 입력 마 스크에 포함된 결함의 종류와 피사체(또는, 결함 이미지 세그먼트)의 구조에 기반하여 유저(또는, 사용자)가 러 프하게(또는, 개략적으로) 그린(또는, 입력한) 영역(또는, 마스크 영역) 내부에 가장 자연스러운(또는, 있을법 한) 보정 마스크(또는, 출력 마스크)를 생성(또는, 형성)할 수 있다. 다만, 본 개시의 효과는 이상에서 예시된 내용에 의해 제한되는 것이 아니며, 더욱 다양한 효과들이 본 개시 내 에 포함되어 있으며, 본 개시의 사상 및 영역으로부터 벗어나지 않는 범위에서 다양하게 확장될 수 있을 것이다. <본 개시의 다양한 실시예> 본 개시의 다양한 실시예들에 따른 시스템은 다음과 같이 설명될 수 있다. 본 개시의 일 실시예에 따른 시스템은, 보정 마스크를 생성하는 시스템으로서, 제1 이미지 및 제1 마스크에 기 초하여 보정 마스크 생성 모델을 학습하는 학습기 및 상기 보정 마스크 생성 모델을 이용하여, 입력 이미지 및 입력 마스크로부터 상기 보정 마스크를 생성하는 생성기를 포함할 수 있다. 상기 학습기는, 상기 제1 마스크를 수신하고, 상기 제1 마스크를 변환 마스크(converted mask)로 변환하는 마스크 변환기, 상기 제1 이미지 및 상 기 변환 마스크를 수신하고, 상기 변환 마스크를 이용하여 상기 제1 이미지를 마스킹된(masked) 이미지로 변환 하며, 상기 마스킹된 이미지 및 상기 변환 마스크를 연결(concatenate)하여 제1 다채널 데이터 세트를 생성하는 제1 연산기, 상기 제1 다채널 데이터 세트를 수신하고, 상기 마스킹된 이미지 중 변환 마스크 영역에 대응하는 영역의 픽셀 값들을 재구성한 제2 이미지를 생성하는 이미지 변환기, 상기 제1 마스크를 수신하고, 상기 제1 마 스크 중 제1 마스크 영역을 포함하는 영역에 대응하는 경계 상자 영역을 포함하는 경계 상자 마스크를 생성하는 마스크 추출기, 상기 제2 이미지 및 상기 경계 상자 마스크를 수신하고, 상기 제2 이미지 및 상기 경계 상자 마 스크를 연결(concatenate)하여 제2 다채널 데이터 세트를 생성하는 제2 연산기 및 상기 제2 다채널 데이터 세트 를 이용하여 상기 경계 상자 영역 내의 적어도 일부 영역에 대응하는 제2 마스크 영역을 포함하는 제2 마스크를 생성하는 마스크 생성기를 포함할 수 있다. 일 실시예에서, 상기 학습기는, 상기 제1 마스크와 상기 제2 마스크를 비교하여 손실(loss)을 산출하는 판별기 를 더 포함할 수 있다. 일 실시예에서, 상기 학습기는 상기 손실에 기초하여 상기 보정 마스크 생성 모델을 학습할 수 있다. 일 실시예에서, 상기 판별기는, 상기 제1 마스크와 상기 제2 마스크를 비교하여, GAN(생성적 적대 신경망, generative adversarial network) 손실을 산출하는 제1 판별기 및 상기 제1 마스크와 상기 제2 마스크를 비교 하여, NLL(음의 로그 가능도, negative log-likelihood) 손실을 산출하는 제2 판별기를 포함할 수 있다. 일 실시예에서, 상기 입력 이미지는 정상 이미지 및 결함 이미지 중 적어도 하나일 수 있다. 일 실시예에서, 상기 경계 상자 영역은 직사각 또는 정사각 형태일 수 있다. 일 실시예에서, 상기 생성기는, 상기 입력 마스크를 이용하여 입력 경계 상자 마스크를 생성하고, 상기 입력 이 미지 및 상기 입력 경계 상자 마스크를 연결하여 입력 데이터 세트를 생성하며, 상기 입력 데이터 세트를 이용 하여 상기 보정 마스크를 생성할 수 있다. 일 실시예에서, 상기 경계 상자 마스크 중 상기 입력 마스크의 입력 마스크 영역에 대응하는 영역은 경계 상자 마스크 영역에 포함될 수 있다. 본 개시의 일 실시예에 따른 장치는, 보정 마스크를 생성하는 장치로서, 적어도 하나의 인스트럭션 (instruction)을 저장하는 메모리 및 상기 메모리 상에 저장된 상기 인스트럭션에 응답하여 상기 보정 마스크를 생성하기 위한 적어도 하나의 프로세스를 수행하는 프로세서를 포함할 수 있다. 상기 프로세서는, 제1 이미지 및 제1 마스크를 수신하고, 상기 제1 마스크를 변환 마스크로 변환하며, 상기 제1 마스크를 이용하여 상기 제1 이미지를 마스킹된(masked) 이미지로 변환하고, 상기 마스킹된 이미지 및 상기 제1 마스크를 연결(concatenat e)하여 제1 다채널 데이터 세트를 생성하며, 상기 마스킹된 이미지 중 변환 마스크 영역에 대응하는 영역의 픽 셀 값들을 재구성한 제2 이미지를 생성하고, 상기 제1 마스크 중 제1 마스크 영역을 포함하는 영역에 대응하는 경계 상자 영역을 포함하는 경계 상자 마스크를 생성하며, 상기 제2 이미지 및 상기 경계 상자 마스크를 연결하 여 제2 다채널 데이터 세트를 생성하고, 상기 제2 다채널 데이터 세트를 이용하여 상기 경계 상자 영역 내의 적 어도 일부 영역에 대응하는 제2 마스크 영역을 포함하는 제2 마스크를 생성할 수 있다. 본 개시의 일 실시예에 따른 컴퓨터 프로그램은, 컴퓨터 판독 가능 매체에 저장된 컴퓨터 프로그램으로서, 컴퓨 터 시스템에 의해 실행될 때, 상기 컴퓨터 시스템이, 제1 이미지 및 제1 마스크에 기초하여 보정 마스크 생성 모델을 학습하는 단계 및 상기 보정 마스크 생성 모델을 이용하여, 입력 이미지 및 입력 마스크로부터 상기 보 정 마스크를 생성하는 단계를 포함하는 방법을 수행하도록 하는 명령어를 포함할 수 있다. 이상에서는 본 개시의 실시예들을 참조하여 설명하였지만, 해당 기술 분야의 숙련된 당업자는 청구범위에 기재 된 본 개시의 사상 및 영역으로부터 벗어나지 않는 범위 내에서 본 개시를 다양하게 수정 및 변경시킬 수 있음 을 이해할 수 있을 것이다."}
{"patent_id": "10-2023-0132270", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 다양한 실시예들에 따른 전자 장치를 나타내는 블록도이다. 도 2는 본 개시의 다양한 실시예들에 따른 보정 마스크 생성 시스템을 나타내는 블록도이다. 도 3은 도 2의 보정 마스크 생성 시스템에 포함되는 학습기의 일 예를 나타내는 블록도이다. 도 4는 도 3의 학습기의 동작의 일 예를 설명하기 위한 도면이다. 도 5는 도 2의 보정 마스크 생성 시스템에 포함되는 학습기의 다른 일 예를 나타내는 블록도이다. 도 6은 도 5의 학습기의 동작의 다른 일 예를 설명하기 위한 도면이다. 도 7은 도 3의 이미지 변환기를 학습하기 위한 학습기의 일 예를 나타내는 블록도이다. 도 8은 도 2의 보정 마스크 생성 시스템에 포함되는 생성기의 일 예를 나타내는 블록도이다. 도 9는 도 8의 생성기의 동작의 일 예를 설명하기 위한 도면이다. 도 10은 도 8의 생성기의 동작의 다른 일 예를 설명하기 위한 도면이다. 도 11은 도 8의 생성기의 동작의 또 다른 일 예를 설명하기 위한 도면이다. 도 12는 본 개시의 다양한 실시예들에 따른 보정 마스크 생성 방법을 나타내는 순서도이다. 도 13은 도 12의 보정 마스크 생성 방법의 일 예를 나타내는 순서도이다."}
