{"patent_id": "10-2016-0180262", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2018-0076125", "출원번호": "10-2016-0180262", "발명의 명칭": "무인 비행 장치의 제어 방법 및 무인 비행 장치를 제어하는 전자 장치", "출원인": "삼성전자주식회사", "발명자": "이종기"}}
{"patent_id": "10-2016-0180262", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "무인 비행 장치(unmanned aerial vehicle)를 제어하는 전자 장치에 있어서,무인 비행 장치와 무선 데이터를 송수신할 수 있는 통신 모듈;무인 비행 장치를 조작하기 위한 사용자 인터페이스를 출력하는 디스플레이;메모리;상기 통신 모듈, 상기 디스플레이, 상기 메모리와 전기적으로 연결되는 프로세서;를 포함하고,상기 프로세서는상기 무인 비행 장치의 제1 지점의 방향에 관한 정보를 상기 무인 비행 장치로부터 수신하고,상기 디스플레이에 상기 제1 지점의 방향에 대응하는 방향 표시 객체를 출력하고,상기 무인 비행 장치의 이동 또는 회전과 관련된 사용자 입력을 수신하는 경우, 상기 방향 표시 객체의 위치 및상기 사용자 입력에 대응하여 상기 무인 비행 장치를 상기 제1 지점을 기준으로 이동 또는 회전 시키는 제어 신호를 생성하고,상기 생성된 제어 신호를 상기 무인 비행 장치에 전송하도록 설정된 전자 장치."}
{"patent_id": "10-2016-0180262", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 프로세서는상기 무인 비행 장치의 동일 고도에서의 이동 또는 회전을 제어하기 위한 원형 UI를 상기 디스플레이에 출력하도록 설정된 전자 장치."}
{"patent_id": "10-2016-0180262", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 원형 UI는상기 무인 비행 장치의 동일 고도에서의 이동을 제어하는 원형의 방향 UI; 및상기 방향 UI를 원형 띠의 회전 UI를 포함하는 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2016-0180262", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 방향 표시 객체는상기 회전 UI와 겹쳐서 출력되거나 상기 회전 UI의 외부에 표시되는 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2016-0180262", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서, 상기 프로세서는 상기 방향 UI에 사용자의 터치 입력이 발생하는 경우, 상기 터치 입력의 이동 방향 및 이동 거리를 기반으로 상기 무인 비행 장치의 동일 고도에서의 이동을 조절하기 위한 제어 신호를 생성하는 전자 장치."}
{"patent_id": "10-2016-0180262", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 프로세서는 상기 방향 표시 객체의 위치와 상기 상기 터치 입력이 연장되는 방향을 기반으로 상기 이동 방향을 결정하는 전자 장치.공개특허 10-2018-0076125-3-청구항 7 제3항에 있어서, 상기 프로세서는 상기 회전 UI에 사용자의 터치 입력이 발생하는 경우, 상기 원형 UI의 중심에서, 상기 터치 입력의 이동 각도를기반으로 상기 무인 비행 장치의 동일 고도에서의 회전을 조절하기 위한 제어 신호를 생성하는 전자 장치."}
{"patent_id": "10-2016-0180262", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제3항에 있어서, 상기 프로세서는상기 회전 UI 상에서 또는 상기 회전 UI에 인접한 지점에서 더블 탭 입력이 발생하는 경우, 상기 원형 UI의 중심에서, 상기 표시 개체와 상기 더블탭 입력이 발생한 지점 사이의 각도를 기반으로 상기 무인 비행 장치의 동일 고도에서의 회전을 조절하기 위한 제어 신호를 생성하는 전자 장치."}
{"patent_id": "10-2016-0180262", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제3항에 있어서, 상기 프로세서는상기 방향 UI에서 시작된 사용자 입력이 상기 회전 UI까지 연장되고, 상기 사용자 입력이 상기 회전 UI 상에서진행 방향이 전환되는 경우, 상기 무인 비행 장치의 동일 고도에서의 이동 및 회전을 조절하기 위한 제어 신호를 생성하는 전자 장치."}
{"patent_id": "10-2016-0180262", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제2항에 있어서, 상기 프로세서는상기 원형 UI의 주변 영역에 상기 무인 비행 장치의 고도를 제어하기 위한 고도 UI를 출력하도록 설정된 전자장치."}
{"patent_id": "10-2016-0180262", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서, 상기 고도 UI는상기 원형 UI의 좌우 측면에서, 상하 방향으로 연장되는 형태를 가지고,사용자의 터치 입력에 의해 화면상에서 이동할 수 있는 이동 객체를 포함하는 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2016-0180262", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1항에 있어서,상기 디스플레이를 둘러싸는 회전이 가능한 회전형 베젤;을 더 포함하고,상기 프로세서는상기 무인 비행 장치의 동일 고도에서의 이동을 제어하기 위한 원형의 방향 UI를 출력하도록 설정된 전자 장치."}
{"patent_id": "10-2016-0180262", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서, 상기 프로세서는상기 회전형 베젤의 회전 방향 및 회전 각도를 기반으로 상기 무인 비행 장치의 동일 고도에서의 회전을 조절하기 위한 제어 신호를 생성하는 전자 장치."}
{"patent_id": "10-2016-0180262", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12항에 있어서, 상기 프로세서는상기 디스플레이에 멀티 터치 입력이 발생하는 경우, 상기 멀티 터치 입력을 기반으로 상기 무인 비행 장치의고도를 조절하기 위한 제어 신호를 생성하는 전자 장치."}
{"patent_id": "10-2016-0180262", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "공개특허 10-2018-0076125-4-제13항에 있어서, 상기 프로세서는줌 아웃(zoom-out) 입력이 발생하는 경우, 상기 무인 비행 장치의 고도를 높이기 위한 제어 신호를 생성하는 전자 장치."}
{"patent_id": "10-2016-0180262", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제13항에 있어서, 상기 프로세서는줌 아웃(zoom-in) 입력이 발생하는 경우, 상기 무인 비행 장치의 고도를 낮추기 위한 제어 신호를 생성하는 전자 장치."}
{"patent_id": "10-2016-0180262", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "무인 비행 장치(unmanned aerial vehicle)의 제어 방법에 있어서,상기 무인 비행 장치의 제1 지점의 방향에 관한 정보를 상기 무인 비행 장치로부터 수신하는 동작;디스플레이에 상기 제1 지점의 방향에 대응하는 방향 표시 객체를 출력하는 동작;상기 무인 비행 장치의 이동 또는 회전과 관련된 사용자 입력을 수신하는 동작;상기 방향 표시 객체의 위치 및 상기 사용자 입력에 대응하여 상기 무인 비행 장치를 상기 제1 지점을 기준으로이동 또는 회전 시키는 제어 신호를 생성하는 동작; 및상기 생성된 제어 신호를 상기 무인 비행 장치에 전송하는 동작;을 포함하는 방법."}
{"patent_id": "10-2016-0180262", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서, 상기 사용자 입력을 수신하는 동작은상기 무인 비행 장치의 동일 고도에서의 이동 또는 회전을 제어하기 위한 원형 UI를 상기 디스플레이에 출력하는 동작; 및상기 원형 UI에 상기 사용자 입력을 수신하는 동작;을 포함하는 방법."}
{"patent_id": "10-2016-0180262", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제17항에 있어서, 상기 사용자 입력을 수신하는 동작은상기 무인 비행 장치의 동일 고도에서의 이동 또는 회전을 제어하기 위한 원형 UI를 상기 디스플레이에 출력하는 동작; 및상기 원형 UI에 상기 사용자 입력을 수신하는 동작;을 포함하는 방법."}
{"patent_id": "10-2016-0180262", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서, 상기 원형 UI를 상기 디스플레이에 출력하는 동작은상기 무인 비행 장치의 동일 고도에서의 이동을 제어하는 원형의 방향 UI 및 상기 방향 UI를 원형 띠의 회전 UI를 출력하는 동작; 및상기 회전 UI와 겹쳐서 출력되거나 상기 회전 UI의 외부에 상기 방향 표시 객체를 출력하는 동작;을 포함하는방법."}
{"patent_id": "10-2016-0180262", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 문서의 다양한 실시 예에 따른 전자 장치는 무인 비행 장치(unmanned aerial vehicle)를 제어하고, 무인 비행 장치와 무선 데이터를 송수신할 수 있는 통신 모듈, 무인 비행 장치를 조작하기 위한 사용자 인터페이스를 출력 하는 디스플레이, 메모리, 상기 통신 모듈, 상기 디스플레이, 상기 메모리와 전기적으로 연결되는 프로세서를 포 (뒷면에 계속)"}
{"patent_id": "10-2016-0180262", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 문서의 다양한 실시 예는 무인 비행 장치를 제어하는 방법 및 무인 비행 장치를 제어하는 전자 장치에 관한 것이다."}
{"patent_id": "10-2016-0180262", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "무인 비행 장치(예: 드론)는 사람이 타지 않고, 무선 전파의 유도에 의해서 비행하는 장치일 수 있다. 무인 비 행 장치는 원래 군사적 목적으로 정찰, 감시 등의 용도로 개발되었으나, 최근에는 물건 배송, 사진 또는 영상 촬영 등의 용도로 활용 범위가 확대되고 있다. 무인 비행 장치는 별도의 조작 장치에서 발생되는 무선 제어 신호에 대응하여, 비행할 수 있다. 무인 비행 장치 는 조작 장치의 제어 신호에 따라 고도를 변경하거나, 동일 고도에서 이동/ 회전할 수 있다. 무인 비행 장치는 카메라 장치를 포함하는 경우, 사진 또는 동영상을 촬영할 수 있다."}
{"patent_id": "10-2016-0180262", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "종래 기술에 의한 무인 비행 장치(또는 드론 장치)를 제어하기 위해서는 조이스틱 형태의 조작 장치 또는 스마 트폰의 터치 버튼이 이용될 수 있다. 이 경우, 사용자는 조이스틱 입력 또는 터치 입력을 발생시켜, 무인 비행 장치를 원하는 위치로 이동시킬 수 있다. 종래 기술에 의한 무인 비행 장치의 조작 방식은 3차원 공간상에서 무인 비행 장치의 고도를 변경하거나, 이동/ 회전 시키기 위해서는 2개의 조이스틱을 복합적인 형태로 조작해야 하고, 무인 비행 장치의 이동 방향과 사용자 의 위치를 매칭하기 어려운 문제점이 있다. 또한, 종래 기술에 의한 무인 비행 장치는, 사용자가 무인 비행 장치에 장착된 카메라를 이용하여 이미지 또는 동영상을 촬영하는 경우, 원하는 구도의 이미지를 촬영하기 위해 조작 장치를 정밀하게 제어하여 무인 비행 장 치의 이동 방향, 고도 등을 결정해야 하는 문제점이 있다."}
{"patent_id": "10-2016-0180262", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 문서의 다양한 실시 예에 따른 전자 장치는 무인 비행 장치(unmanned aerial vehicle)를 제어하고, 무인 비 행 장치와 무선 데이터를 송수신할 수 있는 통신 모듈, 무인 비행 장치를 조작하기 위한 사용자 인터페이스를 출력하는 디스플레이, 메모리, 상기 통신 모듈, 상기 디스플레이, 상기 메모리와 전기적으로 연결되는 프로세서 를 포함하고, 상기 프로세서는 상기 무인 비행 장치의 제1 지점의 방향에 관한 정보를 상기 무인 비행 장치로부 터 수신하고, 상기 디스플레이에 상기 제1 지점의 방향에 대응하는 방향 표시 객체를 출력하고, 상기 무인 비행 장치의 이동 또는 회전과 관련된 사용자 입력을 수신하는 경우, 상기 방향 표시 객체의 위치 및 상기 사용자 입 력에 대응하여 상기 무인 비행 장치를 상기 제1 지점을 기준으로 이동 또는 회전 시키는 제어 신호를 생성하고, 상기 생성된 제어 신호를 상기 무인 비행 장치에 전송하도록 설정될 수 있다."}
{"patent_id": "10-2016-0180262", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 문서의 다양한 실시 예에 따른 무인 비행 장치의 제어 방법 및 무인 비행 장치를 제어하는 전자 장치는 막대 형의 고도 조절 UI와 원형의 이동/회전 UI를 이용하여, 직관적인 무인 비행 장치의 제어를 가능하게 할 수 있다. 본 문서의 다양한 실시 예에 따른 무인 비행 장치의 제어 방법 및 무인 비행 장치를 제어하는 전자 장치는 무인 비행 장치의 헤드 방향을 수신하고 화면상에 표시하여, 사용자가 무인 비행 장치의 방향을 쉽게 인식하고, 조작 할 수 있다. 본 문서의 다양한 실시 예에 따른 무인 비행 장치의 제어 방법 및 무인 비행 장치를 제어하는 전자 장치는 사용 자가 한 손으로 간편하게 무인 비행 장치를 조작하도록 할 수 있다."}
{"patent_id": "10-2016-0180262", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 다양한 실시 예가 첨부된 도면을 참조하여 기재된다. 그러나, 이는 본 발명을 특정한 실시 형 태에 대해 한정하려는 것이 아니며, 본 발명의 실시 예의 다양한 변경(modification), 균등물(equivalent), 및/ 또는 대체물(alternative)을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대 해서는 유사한 참조 부호가 사용될 수 있다. 본 문서에서, \"가진다\", \"가질 수 있다\", \"포함한다\", 또는 \"포함할 수 있다\" 등의 표현은 해당 특징(예: 수치, 기능, 동작, 또는 부품 등의 구성요소)의 존재를 가리키며, 추가적인 특징의 존재를 배제하지 않는다. 본 문서에서, \"A 또는 B\", \"A 또는/및 B 중 적어도 하나\", 또는 \"A 또는/및 B 중 하나 또는 그 이상\" 등의 표현 은 함께 나열된 항목들의 모든 가능한 조합을 포함할 수 있다. 예를 들면, \"A 또는 B\", \"A 및 B 중 적어도 하나\", 또는 \"A 또는 B 중 적어도 하나\"는, 적어도 하나의 A를 포함, 적어도 하나의 B를 포함, 또는 적어도 하나의 A 및 적어도 하나의 B 모두를 포함하는 경우를 모두 지칭할 수 있다. 본 문서에서 사용된 \"제1\", \"제2\", \"첫째\", 또는 \"둘째\" 등의 표현들은 다양한 구성요소들을, 순서 및/또는 중 요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구성요소들을 한정하지 않는다. 예를 들면, 제1 사용자 기기와 제2 사용자 기기는, 순서 또는 중요도와 무관하게, 서로 다른 사용자 기기를 나타낼 수 있다. 예를 들면, 본 문서에 기재된 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 바꾸어 명명될 수 있다. 어떤 구성요소(예: 제1 구성요소)가 다른 구성요소(예: 제2 구성요소)에 \"(기능적으로 또는 통신적으로) 연결되 어((operatively or communicatively) coupled with/to)\" 있다거나 \"접속되어(connected to)\" 있다고 언급된 때에는, 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로 연결되거나, 다른 구성요소(예: 제3 구성요 소)를 통하여 연결될 수 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소(예: 제1 구성요소)가 다른 구성 요소(예: 제2 구성요소)에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 상기 어떤 구성요 소와 상기 다른 구성요소 사이에 다른 구성요소(예: 제3 구성요소)가 존재하지 않는 것으로 이해될 수 있다. 본 문서에서 사용된 표현 \"~하도록 구성된(또는 설정된)(configured to)\"은 상황에 따라, 예를 들면, \"~에 적합 한(suitable for)\", \"~하는 능력을 가지는(having the capacity to)\", \"~하도록 설계된(designed to)\", \"~하도 록 변경된(adapted to)\", \"~하도록 만들어진(made to)\", 또는 \"~를 할 수 있는(capable of)\"과 바꾸어 사용될 수 있다. 용어 \"~하도록 구성(또는 설정)된\"은 하드웨어적으로 \"특별히 설계된(specifically designed to)\"것만 을 반드시 의미하지 않을 수 있다. 대신, 어떤 상황에서는, \"~하도록 구성된 장치\"라는 표현은, 그 장치가 다른 장치 또는 부품들과 함께 \"~할 수 있는\" 것을 의미할 수 있다. 예를 들면, 문구 \"A, B, 및 C를 수행하도록 구성 (또는 설정)된 프로세서\"는 해당 동작을 수행하기 위한 전용 프로세서(예: 임베디드 프로세서), 또는 메모리 장 치에 저장된 하나 이상의 소프트웨어 프로그램들을 실행함으로써, 해당 동작들을 수행할 수 있는 범용 프로세서 (generic-purpose processor)(예: CPU 또는 application processor)를 의미할 수 있다. 본 문서에서 사용된 용어들은 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 다른 실시 예의 범위를 한 정하려는 의도가 아닐 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 용어들은 본 문서에 기재된 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가질 수 있다. 본 문서에 사용된 용어 들 중 일반적인 사전에 정의된 용어들은 관련 기술의 문맥 상 가지는 의미와 동일 또는 유사한 의미로 해석될 수 있으며, 본 문서에서 명백하게 정의되지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 경우에 따라서, 본 문서에서 정의된 용어일지라도 본 문서의 실시 예들을 배제하도록 해석될 수 없다. 본 문서의 다양한 실시 예들에 따른 전자 장치는, 예를 들면, 스마트폰(smartphone), 태블릿 PC(tablet personal computer), 이동 전화기(mobile phone), 영상 전화기, 전자책 리더기(e-book reader), 데스크탑 PC (desktop PC), 랩탑 PC(laptop PC), 넷북 컴퓨터(netbook computer), 워크스테이션(workstation), 서버, PDA(personal digital assistant), PMP(portable multimedia player), MP3 플레이어, 모바일 의료기기, 카메라, 또는 웨어러블 장치(wearable device) 중 적어도 하나를 포함할 수 있다. 다양한 실시 예에 따르면 웨 어러블 장치는 엑세서리 형(예: 시계, 반지, 팔찌, 발찌, 목걸이, 안경, 콘택트 렌즈, 또는 머리 착용형 장치 (head-mounted-device(HMD)), 직물 또는 의류 일체 형(예: 전자 의복), 신체 부착 형(예: 스킨 패드(skin pad) 또는 문신), 또는 생체 이식 형(예: implantable circuit) 중 적어도 하나를 포함할 수 있다. 이하, 첨부 도면을 참조하여, 다양한 실시 예에 따른 무인 비행 장치 또는 전자 장치가 설명된다. 본 문서에서, 사용자라는 용어는 무인 비행 장치 또는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 다른 장치 (예: 인공지능 전자 장치)를 지칭할 수 있다. 도 1은 다양한 실시 예에 따른 무인 비행 장치 및 전자 장치를 나타낸다. 이하에서는 무인 비행 장치가 드 론 장치인 경우를 중심으로 논의하지만, 이에 한정되는 것은 아니다. 도 1을 참조하면, 무인 비행 장치는 전자 장치(또는 제어 장치, 조작 장치)를 통해 제어될 수 있다. 무인 비행 장치는 전자 장치에서 생성되는 제어 신호에 따라 고도가 변경되거나(Throttle), 동일 고 도에서 이동(Pitch & Roll) 또는 회전(Yaw)할 수 있다. 무인 비행 장치는 전자 장치와 지정된 무선 통신 방식(예: 블루투스, WiFi 등)에 따른 신호를 송수신할 수 있다. 다양한 실시 예에 따르면, 무인 비행 장치는 무인 비행 장치의 중심이 아닌 제1 지점(이하, 방향 설 정 지점)에 대한 위치 정보를 수집할 수 있다. 방향 설정 지점은 무인 비행 장치가 향하고 있는 방향을 결정하기 위해 이용되는 지점일 수 있다. 예를 들어, 방향 설정 지점은 무인 비행 장치가 헤드를 가지는 경우, 헤드에 인접한 지점일 수 있다. 다른 예를 들어, 방향 설정 지점은 무인 비행 장치가 카메라 장치를 가지는 경우, 카메라 장치에 인 접한 지점일 수 있다. 또 다른 예를 들어, 방향 설정 지점은 사용자에 의해 설정되거나, 제조 단계에서 미 리 설정된 지점일 수 있다. 또 다른 예에서, 방향 설정 지점은 지자계 센서, GPS 센서 등의 회로가 장착된 지점일 수 있다. 이하에서는, 방향 설정 지점이 무인 비행 장치의 헤드 위치인 경우를 중심으로 논의하지만, 이에 한 정되는 것은 아니다. 다양한 실시 예에 따르면, 무인 비행 장치는 방향 설정 지점의 위치 정보를 전자 장치에 전송할 수 있다. 예를 들어, 방향 설정 지점의 위치 정보는 방위각(예: 정북 방향 대비 각도), 위도, 경도, 기울 기 등에 관한 정보를 포함할 수 있다. 전자 장치는 방향 설정 지점에 대응하는 방향 표시 객체(이하, 방향 표시)를 디스플레이에 출력할 수 있다. 다양한 실시 예에 따르면, 무인 비행 장치는 카메라 장치(미도시)를 장착할 수 있다. 무인 비행 장치(10 1)는 카메라 장치를 통해 수집되는 이미지 데이터를 실시간으로 전자 장치 또는 외부 장치(예: 서버)에 전 송할 수 있다. 전자 장치는 사용자의 입력에 대응하는 제어 신호를 생성하여, 무인 비행 장치에 전송할 수 있다. 전 자 장치는 무선 통신(예: 블루투스, WiFi 등)을 통해 무인 비행 장치에 생성한 제어 신호를 송신할 수 있다. 다양한 실시 예서, 전자 장치는 디스플레이를 포함하는 전자 장치(예: 스마트폰, 태블릿 PC, 스마트 와치 등)일 수 있다. 다양한 실시 예에 따르면, 전자 장치는 무인 비행 장치를 제어하는 사용자 인터페이스를 디스플레이 에 출력할 수 있다. 전자 장치는 무인 비행 장치의 고도를 변경하거나(Throttle), 동일 고도에서 이동(Pitch & Roll) 또는 회전(Yaw)시키기 위한 사용자 인터페이스를 출력할 수 있다. 일 실시 예에서, 사용 자 인터페이스는 직선 형태의 막대 형태 또는 원형의 터치 버튼을 포함할 수 있다. 도 1에서는 상기 사용자 인터페이스가 터치 버튼을 통해 표시되는 경우를 예시적으로 도시하였으나, 이에 한정 되는 것은 아니다. 예를 들어, 상기 사용자 인터페이스는 물리 버튼을 이용하거나, 사용자의 동작 입력을 인식 하는 센서를 이용하거나, 베젤 또는 이동 휠 등을 이용하여 구현될 수 있다. 다양한 실시 예에 따르면, 전자 장치는 무인 비행 장치의 방향 설정 지점에 대응하는 방향 표시 를 디스플레이의 적어도 일부에 출력할 수 있다. 전자 장치는 무인 비행 장치로부터 방향 설정 지점의 위치 정보를 수신할 수 있다. 예를 들어, 방향 설정 지점의 위치 정보는 방위각(예: 정 북 방향 대비 각도), 위도, 경도, 무인 비행 장치의 기울기 등에 관한 정보를 포함할 수 있다. 전자 장치는 전자 장치가 향하는 방향(예: 디스플레이의 상단)과 방향 설정 지점의 방향 을 비교하여, 방향 표시가 출력될 위치를 결정할 수 있다. 방향 표시는 무인 비행 장치가 향하 는 방향과 사용자가 향하는 방향(또는 전자 장치의 상단이 향하는 방향)에 따라 디스플레이 상에서의 위치가 변경될 수 있다. 예를 들어, 무인 비행 장치가 정북 방향을 향하고, 사용자도 전자 장치를 포트레이트 모드로 파지하 고 정북 방향을 향하는 경우, 방향 표시는 전자 장치의 상단 방향을 향하도록 배치될 수 있다. 무인 비행 장치가 사용자의 조작 등에 의해 북서 방향으로 회전하고, 사용자(또는 전자 장치가 향하는 방 향은 고정되는 경우, 방향 표시는 반시계 방향으로 회전할 수 있다. 반대로, 무인 비행 장치가 향하 는 방향은 고정되고, 사용자(또는 전자 장치가 향하는 방향이 북동쪽으로 변경되는 경우, 방향 표시 는 마찬가지로 반시계 방향으로 회전할 수 있다. 전자 장치는 무인 비행 장치의 이동 또는 회전에 따라, 방향 설정 지점의 방향이 변경되는 경우, 방향 설정 지점의 방향에 대응하도록 방향 표시의 위치를 변경할 수 있다. 방향 설정 지점 의 출력에 관한 추가 정보는 별도 도면을 통해 제공될 수 있다. 도 1에서는 방향 표시가 삼각형의 포인트 형태로 도시되었으나, 이에 한정되는 것은 아니다. 예를 들어, 무인 비행 장치의 형태를 개략적으로 표현한 아이콘이 디스플레이의 일부에 표시될 수 있다. 무인 비 행 장치의 회전에 따라 해당 아이콘이 회전하여, 무인 비행 장치의 헤드 방향을 사용자가 인식하도록 할 수 있다. 방향 표시의 출력 및 사용자 인터페이스의 출력에 관한 추가 정보는 도 3 내지 도 15를 통해 제공될 수 있 다. 도 2는 다양한 실시 예에 따른 무인 비행 장치의 구성도이다. 도 2를 참조하면, 무인 비행 장치는 프로세서, 메모리, 이동 장치, 통신 회로, 위치 검출 회로, 및 카메라를 포함할 수 있다. 어떤 실시 예에서는, 무인 비행 장치는, 구성요소들 중 적어도 하나를 생략하거나 다른 구성 요소를 추가적으로 구비할 수 있다. 프로세서는, 중앙처리장치(central processing unit (CPU)), 어플리케이션 프로세서(application processor (AP)), 또는 커뮤니케이션 프로세서(communication processor (CP)) 중 하나 또는 그 이상을 포함할 수 있다. 프로세서는, 예를 들면, 무인 비행 장치의 적어도 하나의 다른 구성요소들의 제어 및/또는 통신에 관한 연산이나 데이터 처리를 실행할 수 있다. 프로세서는 이동 장치을 이용한 무인 비행 장 치의 이동, 카메라을 이미지의 촬영, 통신 회로을 이용한 전자 장치와의 데이터 송수신, 위치 검출 회로을 이용한 무인 비행 장치의 위치 인식, 촬영된 이미지 또는 위치 정보의 저장과 관련 된 연산을 수행할 수 있다. 메모리는, 휘발성 및/또는 비휘발성 메모리를 포함할 수 있다. 메모리는, 예를 들면, 무인 비행 장치 의 적어도 하나의 다른 구성요소에 관계된 명령 또는 데이터를 저장할 수 있다. 다양한 실시 예에 따르면, 메모리는 카메라을 통해 촬영된 이미지 및 각각의 이미지가 촬영된 위치 정보, 촬영 설정 정보를 저장할 수 있다. 이동 장치는 외부로 돌출된 적어도 하나 이상의 프로펠러 및 상기 프로펠러에 동력을 제공하는 모터를 포 함할 수 있다. 이동 장치는 프로세서의 제어 신호에 따라 모터 및 프로펠러를 구동하여, 제어 신호에따른 위치로 무인 비행 장치를 이동시킬 수 있다. 통신 회로는, 예를 들면, 무인 비행 장치와 전자 장치 간의 통신을 설정할 수 있다. 예를 들면, 통신 회로는 무선 통신(예: 블루투스, WiFi 등)을 통해 방향 설정 지점의 위치 정보를 전자 장치 에 전송할 수 있다. 또한, 통신 회로는 전자 장치로부터 고도 변경, 이동, 회전에 관한 제어 신 호를 수신할 수 있고, 프로세서로 수신한 제어 신호를 제공할 수 있다. 무선 통신은, 예를 들면, Wi-Fi(Wireless Fidelity), Bluetooth, NFC(Near Field Communication), 또는 GNSS 중 적어도 하나를 포함할 수 있다. 위치 검출 회로는 방향 설정 지점의 방향(예: 방위각, 기울기 등) 또는 위치(위도, 경도 등)에 관한 정보를 검출할 수 있다. 위치 검출 회로는 가속도 센서, 자이로 센서, 지자계 센서, GPS 센서 등을 포함할 수 있다. 위치 검출 회로에 수집된 정보는 통신 회로를 통해 전자 장치에 전송될 수 있다. 카메라은 프로세서의 제어에 따라 이미지를 촬영할 수 있다. 촬영된 이미지는 메모리에 저장되 거나 전자 장치로 전송될 수 있다. 도 3는 다양한 실시 예에 따른 이미지 촬영 방법을 나타내는 순서도이다. 도 3를 참조하면, 동작 310에서, 전자 장치는 무인 비행 장치의 제1 지점(또는 방향 설정 지점)(11 0)의 방향에 관한 정보를 무인 비행 장치로부터 수신할 수 있다. 상기 정보는 방위각, 위도, 경도, 기울기 등에 관한 정보를 포함할 수 있다. 동작 320에서, 전자 장치는 디스플레이에 방향 설정 지점의 방향에 대응하는 방향 표시를 출력할 수 있다. 예를 들어, 방향 표시는 원, 삼각형 등의 도형으로 표시되거나, 무인 비행 장치의 아이콘이 회전하는 형태일 수 있다. 동작 330에서, 전자 장치는 무인 비행 장치의 이동 또는 회전과 관련된 사용자 입력을 수신할 수 있 다. 전자 장치는 무인 비행 장치의 고도를 변경하거나(Throttle), 동일 고도에서 이동(Pitch & Roll) 또는 회전(Yaw)시키기 위한 사용자 인터페이스(이하, 제어 인터페이스)를 출력할 수 있다. 사용자는 제어 인터페이스를 통해 무인 비행 장치의 고도를 변경하거나(Throttle), 동일 고도에서 이동(Pitch & Roll) 또 는 회전(Yaw)시키기 위한 제어 신호를 발생시킬 수 있다. 동작 340에서, 전자 장치는 방향 표시의 위치 및 사용자 입력에 대응하여 방향 설정 지점을 기 준으로 무인 비행 장치를 이동 또는 회전 시키는 제어 신호를 생성할 수 있다. 상기 제어 신호는 사용자 입력(예: 스와이프 입력, 슬라이드 입력, 더블 탭 입력)의 발생 위치, 진행 방향, 진행 거리, 진행 속도, 진행 시간, 종료 지점, 종료 시간 등에 관한 정보를 포함할 수 있다. 동작 350에서, 전자 장치는 생성된 제어 신호를 무인 비행 장치에 전송할 수 있다. 무인 비행 장치 는 수신한 제어 신호를 기반으로 고도를 변경하거나, 동일 고도에서 이동/회전할 수 있다. 무인 비행 장치 는 수신한 제어 신호에 포함된 정보와 방향 설정 지점의 방향을 기반으로 이동하거나 회전할 수 있다. 다양한 실시 예에 따른 무인 비행 장치(unmanned aerial vehicle)의 제어 방법은 상기 무인 비행 장치의 제1 지 점의 방향에 관한 정보를 상기 무인 비행 장치로부터 수신하는 동작, 디스플레이에 상기 제1 지점의 방향에 대 응하는 방향 표시 객체를 출력하는 동작, 상기 무인 비행 장치의 이동 또는 회전과 관련된 사용자 입력을 수신 하는 동작, 상기 방향 표시 객체의 위치 및 상기 사용자 입력에 대응하여 상기 무인 비행 장치를 상기 제1 지점 을 기준으로 이동 또는 회전 시키는 제어 신호를 생성하는 동작 및 상기 생성된 제어 신호를 상기 무인 비행 장 치에 전송하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 사용자 입력을 수신하는 동작은 상기 무인 비행 장치의 동일 고도에서의 이동 또는 회전을 제어하기 위한 원형 UI를 상기 디스플레이에 출력하는 동작 및 상기 원형 UI에 상기 사용자 입력을 수신하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 사용자 입력을 수신하는 동작은 상기 무인 비행 장치의 동일 고도에서의 이동 또는 회전을 제어하기 위한 원형 UI를 상기 디스플레이에 출력하는 동작 및 상기 원형 UI에 상기 사용자 입력을 수신하는 동작을 포함할 수 있다. 상기 원형 UI를 상기 디스플레이에 출력하는 동작은 상기 무인 비행 장치의 동일 고도에서의 이동을 제어하는 원형의 방향 UI 및 상기 방향 UI를 원형 띠의 회전 UI를 출력하는 동작 및 상기 회전 UI와 겹쳐서 출력되거나 상기 회전 UI의 외부에 상기 방향 표시 객체를 출력하는 동작을 포함할 수 있 다. 도 4는 다양한 실시 예에 따른 무인 비행 장치를 제어하는 전자 장치의 디스플레이를 나타낸다. 도 4는 예시적 인 것으로 이에 한정되는 것은 아니다. 도 4를 참조하면, 무인 비행 장치를 제어하는 전자 장치의 디스플레이는 촬영 화면(live view) 및 제어 인터페이스를 포함할 수 있다. 촬영 화면은 무인 비행 장치의 카메라를 통해 수집되는 이미지를 출력할 수 있다. 사용자는 촬 영 화면를 통해 무인 비행 장치를 통해 촬영되고 있는 이미지를 확인하면, 원하는 구도의 사진 또는 동영상을 촬영하기 위해 무인 비행 장치을 이동시킬 수 있다. 제어 인터페이스는 무인 비행 장치의 이동, 회전, 고도 변경과 관련된 인터페이스(예: 이동 바, 터치 버튼)를 포함할 수 있다. 다양한 실시 예에 따르면, 제어 인터페이스는 고도 UI, 방향 UI, 회전 UI를 포함할 수 있 다. 고도 UI는 직선의 막대 형태일 수 있고, 방향 UI 및 회전 UI는 원형 또는 원형 띠 모양의 터치 버튼일 수 있다. 고도 UI, 방향 UI 및 회전 UI를 이용한 무인 비행 장치의 조작에 관 한 추가 정보는 도 5 내지 도 13을 통해 제공될 수 있다. 다양한 실시 예에 따르면, 제어 인터페이스는 추가적으로, 사진 또는 동영상의 촬영과 관련된 인터페이스 (예: 동영상 촬영 버튼(461a), 정지 영상 촬영 버튼(461b)), 비행 시작/비행 종료와 관련된 인터페이스(예: 착 륙 버튼) 등을 포함할 수 있다. 다양한 실시 예에 따르면, 제어 인터페이스는 무인 비행 장치의 방향 설정 지점에 대응하는 위 치를 표시하는 방향 표시를 포함할 수 있다. 일 실시 예에서, 방향 표시는 회전 UI 내부 또는 회전 UI에 인접한 지점에 배치될 수 있다. 제어 인터페이스가, 도 4와 같이, portrait 모드로 출력되는 경우, 사용자는 한 손을 이용하여 무인 비행 장치를 조작할 수 있다. 도 4에서는 portrait 모드의 출력 형태를 예시적으로 도시하였으나, 이에 한정되 는 것은 아니다. landscape 모드에서의 제어 인터페이스는 도 15를 통해 본다. 도 5는 다양한 실시 예에 따른 무인 비행 장치의 고도를 변경하는 조작 예시도이다. 도 5는 예시적인 것으로 이 에 한정되는 것은 아니다. 도 5를 참조하면, 화면 및 화면에서, 고도 UI는 방향 UI 및 회전 UI의 우측 또는 좌 측에 배치될 수 있다. 도 5에서는 고도 UI가 방향 UI 및 회전 UI의 좌측에 배치되는 형태를 예 시적으로 도시하였으나, 이에 한정되는 것은 아니다. 고도 UI는 상하 방향으로 연장되는 직선의 막대 형태일 수 있다. 고도 UI는 이동 객체(또는 이동 바 (bar))(430a)를 포함할 수 있다. 사용자 입력에 의해 이동 객체(430a)가 상하 방향으로 움직이는 경우, 이 동 객체(430a)의 진행 속도, 진행 거리 등에 관한 정보가 무인 비행 장치에 전송될 수 있다. 무인 비행 장치는 이동 객체(430a)의 진행 속도, 진행 거리 등에 관한 정보를 기반으로 고도를 변경할 수 있다. 예를 들어, 이동 객체(430a)가 상측으로 이동하는 경우, 무인 비행 장치는 이동 장치(예: 프로 펠러)를 제어하여 고도를 높일 수 있다. 반대로, 이동 객체(430a)가 하측으로 이동하는 경우, 무인 비행 장치 는 이동 장치을 제어하여 고도를 낮출 수 있다. 다양한 실시 예에 따르면, 사용자 입력이 고도 UI에 발생하고, 방향 UI 및 회전 UI에 발생 하지 않는 경우, 무인 비행 장치의 고도가 변경되는 중에, 방향 설정 지점이 향하는 방향은 일정하게 유지될 수 있다. 다양한 실시 예에 따르면, 사용자 입력이 종료(예: 터치 입력 종료)되면, 무인 비행 장치는 호버링 상태로 유지될 수 있다. 다양한 실시 예에 따르면, 사용자 입력에 따른 무인 비행 장치의 고도 변경이 완료되는 경우, 이동 객체(430a)는 고도 UI의 중심으로 복귀할 수 있다. 도 5에서는 고도 변경의 경우만을 설명하였으나, 멀티 터치 방식에 의해, 다른 UI와 함께 조작될 수도 있다(예: 고도 상승 중 회전). 도 6 내지 도 8은 다양한 실시 예에 따른 동일 고도에서 무인 비행 장치를 이동시키는 조작 예시도이다. 도 6 내지 도 8을 참조하면, 방향 UI는 회전 UI의 내부에 배치되는 원형의 터치 버튼일 수 있다. 사 용자 입력(610, 710, 810)에 의해 방향 UI가 화면상에서 이동하는 경우, 방향 UI의 이동 방향(방향 표시를 기준으로 할 수 있음), 이동 속도, 터치 지속 시간 등에 관한 정보를 포함하는 제어 신호가 생성될 수 있다. 전자 장치는 생성된 제어 신호를 무인 비행 장치에 전송할 수 있다. 무인 비행 장치는 방향 UI의 이동 방향, 이동 속도, 터치 지속 시간 등에 관한 제어 정보를 기반으로 동일 고도를 유지하면서 전진, 후진, 측면 이동 등 다양한 방향으로 이동할 수 있다. 도 6을 참조하면, 화면 및 화면에서, 사용자 입력에 의해 방향 UI는 제1 위치(640a)에서 제2 위치(640b)로 이동할 수 있다. 사용자 입력은 방향 표시과 동일한 위치(또는 겹치는 위치)에서 계속적으로 유지될 수 있다. 전자 장치는 방향 UI가 방향 표시와 동일한 방향으로 이동하였음을 나타내는 제어 신호를 무인 비행 장치에 송신할 수 있다. 전자 장치는 사용자 입력이 유지되는 동안 계속적으로 해당 제어 신호를 송신할 수 있다. 무인 비행 장치는 전자 장치로부터 수신한 제어 신호에 대응하여, 동일 고도를 유지한 상태에서, 방 향 설정 지점이 향하는 방향과 동일한 방향으로 이동할 수 있다. 사용자 입력의 터치 상태가 유지되 는 상태에서, 무인 비행 장치는 계속적으로 이동할 수 있고, 터치 상태가 종료되면, 호버링 상태(정지 상 태)를 유지할 수 있다. 도 7을 참조하면, 화면 및 화면에서, 사용자 입력에 의해 방향 UI는 제1 위치(740a)에서 제2 위치(740b)로 이동할 수 있다. 사용자 입력은 방향 표시과 반대되는 방향으로 이동하여 계속적으 로 유지될 수 있다. 전자 장치는 방향 UI가 방향 표시와 반대 방향으로 이동하였음을 나타내는 제어 신호를 무인 비 행 장치에 송신할 수 있다. 전자 장치는 사용자 입력이 유지되는 동안 계속적으로 해당 제어 신 호를 송신할 수 있다. 무인 비행 장치는 전자 장치로부터 수신한 제어 신호에 따라, 동일 고도를 유지한 상태에서, 방향 설 정 지점이 향하는 방향과 반대되는 방향으로 이동할 수 있다. 사용자 입력의 터치 상태가 유지되는 상태에서, 무인 비행 장치는 계속적으로 이동할 수 있고, 터치 상태가 종료되면, 호버링 상태(정지 상태) 를 유지할 수 있다. 도 8을 참조하면, 화면 및 화면에서, 사용자 입력에 의해 방향 UI는 제1 위치(840a)에서 제2 위치(840b)로 이동할 수 있다. 사용자 입력은 방향 표시와 지정된 각도를 이루는 상태에서 계속 적으로 유지될 수 있다. 전자 장치는 방향 UI가 방향 표시와 지정된 각도(예: -60도)를 이루는 상태로 이동하였음을 나 타내는 제어 신호를 무인 비행 장치에 송신할 수 있다. 전자 장치는 사용자 입력이 유지되는 동 안 계속적으로 해당 제어 신호를 송신할 수 있다. 무인 비행 장치는 전자 장치로부터 수신한 제어 신호에 따라, 동일 고도를 유지한 상태에서, 방향 설 정 지점과 지정된 각도(예: -60도)를 이루는 방향으로 이동할 수 있다. 사용자 입력의 터치 상태가 유지되는 상태에서, 무인 비행 장치는 계속적으로 이동할 수 있고, 터치 상태가 종료되면, 호버링 상태(정 지 상태)를 유지할 수 있다. 다양한 실시 예에 따르면, 터치 입력 종료 되면, 방향 UI는 제1 위치(640a, 740a, 840a)로 복귀될 수 있다. 다양한 실시 예에 따르면, 방향 UI에 대한 사용자 입력은 고도 조절을 위한 고도 UI에 대한 사용자 입력과 동시에 발생할 수 있다. 방향 표시과 사용자 입력(610, 710, 810)의 방향(예: 슬라이드 입력의 방향) 사이의 각도의 계산에 관한 추가 정보는 도 10b를 통해 제공될 수 있다. 도 9는 다양한 실시 예에 따른 동일 고도에서 무인 비행 장치를 회전시키는 조작 예시도이다. 도 9를 참조하면, 화면 및 화면에서, 회전 UI는 방향 UI의 외부를 둘러싸는 원형 띠 형태 의 터치 영역일 수 있다. 회전 UI와 방향 UI 사이에는 분리 영역가 배치될 수 있다. 사용자가 회전 UI의 일부를 터치하여 회전 입력을 발생시키는 경우, 회전 입력의 방향(방향 표시를 기준으로 할 수 있음), 진행 거리, 터치 지속 시간 등에 관한 정보를 포함하는 제어 신호가 생성될 수 있다. 전 자 장치는 생성된 제어 신호를 무인 비행 장치에 전송할 수 있다. 무인 비행 장치는 회전 입력의 방향(방향 표시를 기준으로 할 수 있음), 진행 거리, 터치 지속 시간 등에 관한 정보를 기반으로 동일 고도를 유지하면서 회전할 수 있다. 예를 들어, 회전 입력이 방향 표시에서 시작되어 시계 방향으로 90도 회전하는 입력인 경우, 무인 비 행 장치는 방향 설정 지점을 기준으로 시계 방향으로 90도 회전할 수 있다. 무인 비행 장치가 회전하는 경우, 방향 설정 지점의 위치가 변경될 수 있다. 무인 비행 장치는 변경된 방향 설정 지점의 위치 정보를 전자 장치에 전송할 수 있다. 전자 장치는 변경된 방향 설정 지점의 위치 정보에 대응하여, 방향 표시의 위치를 변경할 수 있다. 도 9에서는 시계 방향의 회전 입력을 예시적으로 도시하였으나, 이에 한정되는 것은 아니다. 예를 들어, 회전 입력이 반시계 방향으로 발생하는 경우, 무인 비행 장치는 방향 설정 지점을 기준으로 반 시계 방향으로 회전할 수 있다. 다양한 실시 예에 따르면, 회전 UI에 대한 사용자 입력은 고도 조절을 위한 고도 UI에 대한 사용자 입력과 발생할 수 있다. 회전 입력의 각도 계산에 관한 정보는 도 10b를 통해 제공될 수 있다. 도 10a는 다양한 실시 예에 따른 사용자 입력의 발생 위치에 따른 제어 신호의 생성 방식을 나타내는 예시도이 다. 도 10a를 참조하면, 전자 장치는 사용자의 터치 입력이 발생하는 위치에 따라, 무인 비행 장치의 방 향 이동, 회전 이동을 위한 제어 신호를 생성할 수 있다. 사용자 인터페이스에서, 방향 UI는 점을 중심으로 지정된 범위(예: 지름 2cm)의 원으로 형성될 수 있다. 전자 장치는 상기 범위 내에서 사용자의 이동 입력이 발생하고, 상기 범위 밖으로 이동 입 력이 연장되는 경우, 이동 입력의 방향(방향 표시를 기준으로 할 수 있음) 및 진행 거리를 기 반으로 제어 신호를 생성할 수 있다. 사용자 인터페이스에서, 회전 UI는 방향 UI의 외부를 둘러싸는 원형의 띠 형태일 수 있다. 회 전 UI와 방향 UI의 사이에는 분리 영역가 배치될 수 있다. 일 실시 예에서, 분리 영역에서 사용자의 회전 입력이 발생하는 경우, 별도의 제어 신호가 생성되지 않을 수 있다. 다른 일 실시 예에서, 분리 영역에서 사용자 입력이 발생하는 경우, 회전 UI와 방향 UI 중 상대적으로 가까운 UI에 대 한 입력으로 인식될 수 있다. 회전 UI 내에서 회전 입력이 발생하고, 방향 UI에 별도의 터치 입력이 발생하지 않은 경우, 방 향 표시를 기준으로 하는 회전 입력의 방향 및 회전 각도에 기반으로 제어 신호가 생성될 수 있다. 일 실시 예에 따르면, 사용자의 회전 입력이 발생하는 동안 계속적으로 무인 비행 장치가 회전하고, 사용자의 회전 입력이 종료(터치 입력 종료)되면, 무인 비행 장치는 회전을 멈추고, 호버링 상태로 진입할 수 있다. 다른 일 실시 예에서, 사용자의 회전 입력이 발생하여 종료(터치 입력 종료)되기 전까지, 무인 비행 장치는 호버링 상태를 유지하고, 회전 입력이 종료(터치 입력 종료)되면 회전 각 도를 반영하여, 무인 비행 장치가 회전할 수 있다. 다양한 실시 예에 따르면, 전자 장치는 사용자가 방향 표시을 터치하여 회전하는 경우, 무인 비행 장 치를 회전시키는 제어 신호를 생성하고, 회전 UI의 다른 영역에 입력을 발생시키는 경우, 별도의 동 작 없이 호버링 상태를 유지할 수 있다. 도 10b는 다양한 실시 예에 따른 사용자 입력에 따른 각도 환산을 설명한다. 도 10b에서는 무인 비행 장치(10 1)의 방향 설정 지점이 정북쪽을 향하는 경우를 중심으로 논의하지만, 이에 한정되는 것은 아니다.도 10b를 참조하면, 사용자 인터페이스에서, 사용자 입력이 방향 UI에서 발생하여 외부 방향 으로 진행되는 경우, 전자 장치는 방향 표시를 기준으로 사용자 입력의 이동 각도(A) 및 이동 거리(L)을 계산할 수 있다. 일 실시 예에서, 이동 각도(A)는 방향 표시를 기준으로 -180도 ~ +180도의 값을 가질 수 있다. 다른 일 실 시 예에서, 이동 각도(A)는 방향 표시를 기준으로 0도 ~ 360도의 값을 가질 수도 있다. 다양한 실시 예에 따르면, 이동 거리(L)는 지정된 범위(예: 방향 UI의 중심점에서 회전 UI의 외 부 경계까지의 범위) 사이의 값을 가질 수 있다. 전자 장치는 사용자 입력이 방향 UI에서 발생하는 경우, 이동 각도(A) 및 이동 거리(L)에 관한 정보를 포함하는 제어 신호를 생성할 수 있다. 전자 장치는 생성된 제어 신호를 무인 비행 장치에 전 송할 수 있다. 무인 비행 장치는 방향 설정 지점과 이동 각도(A)를 이루는 방향을 결정할 수 있다. 무인 비행 장치 는 결정된 방향으로 이동 거리(L)에 대응하는 거리만큼 이동할 수 있다. 예를 들어, 이동 거리(L)이 1cm 인 경우, 이동 각도(A)에 따라 결정된 방향으로 1m만큼 이동할 수 있다. 다양한 실시 예에 따르면, 사용자 입력의 이동 거리(L)가 Max값을 유지한 상태로 계속적으로 유지되는 경 우(예: 사용자 입력이 회전 UI에 인접한 지점에서 계속적으로 유지되는 경우), 무인 비행 장치(10 1)는 이동 각도(A)에 따라 결정된 방향으로 계속적으로 이동할 수 있다. 사용자 입력이 종료되었다는 제 어 신호를 수신하는 경우, 무인 비행 장치는 이동을 멈추고, 호버링 상태로 진입할 수 있다. 사용자 인터페이스에서, 사용자의 회전 입력이 회전 UI에서 발생하는 경우, 전자 장치는 회전 입력이 발생한 지점에서의 이동 각도(B)를 계산할 수 있다. 예를 들어, 이동 각도(B)는 회전 입력 이 시계 방향인 경우, 플러스 값을 가질 수 있고, 반 시계 방향인 경우, 마이너스 값을 가질 수 있다. 전자 장치는 회전 입력이 회전 UI에서 발생하는 경우, 이동 각도(B)에 관한 정보를 포함하는 제어 신호를 생성할 수 있다. 전자 장치는 생성된 제어 신호를 무인 비행 장치에 전송할 수 있다. 무인 비행 장치는 이동 각도(B)를 기반으로 회전할 수 있다. 무인 비행 장치는 이동 각도(B)가 마이 너스이면, 방향 설정 지점을 기준으로 반시계 방향으로 이동 각도(B)만큼 회전할 수 있다. 반대로, 무인 비행 장치는 이동 각도(B)가 플러스이면, 방향 설정 지점을 기준으로 시계 방향으로 이동 각도(B)만 큼 회전할 수 있다. 도 11은 다양한 실시 예에 따른 동일 고도에서의 복합 입력을 나타낸다. 도 11을 참조하면, 화면에서, 사용자의 복합 입력은 방향 UI에서 시작되고, 회전 UI에서 방향을 전환하여 계속될 수 있다. 사용자의 복합 입력에 의해, 전자 장치는 무인 비행 장치를 동일 고도에서 이동과 회전을 동시 에 시키는 제어신호를 생성할 수 있다. 복합 입력의 제1 부분에 대응하여, 이동 운동의 방향 및 거리가 결정될 수 있다. 제1 부분은 방향 UI의 중심에서 외부 방향(회전 UI를 향하는 방향)으로 형성될 수 있다. 복합 입력의 제2 부분에 대응하여, 회전 운동의 방향 및 각도가 결정될 수 있다. 제2 부분은 사용자가 제1 부분에서 터치 상태를 유지하면서, 시계 방향 또는 반시계 방향으로 입력의 방향을 전환하 는 부분일 수 있다. 다양한 실시 예에 따르면, 제2 부분은 곡선 또는 직선 형태일 수 있다. 전자 장치는 1) 이동 운동의 방향 및 거리, 2) 회전 운동의 방향 및 각도를 모두 포함하는 제어 신호를 생 성할 수 있다. 전자 장치는 생성된 제어 신호를 무인 비행 장치에 전송할 수 있다. 무인 비행 장치 는 수신할 제어 신호에 따라 이동 운동 및 회전 운동을 동시에 수행할 수 있다. 도 12는 다양한 실시 예에 따른 더블 탭 입력을 이용한 방향 전환을 나타낸다. 도 12를 참조하면, 전자 장치는 회전 UI(또는 회전 UI에 인접한 영역(예: 회전 UI의 외곽 영역 또는 분리 영역)에 더블 탭 입력이 발생한 경우, 방향 표시 및 더블 탭 입력이 발 생한 위치를 기준으로 무인 비행 장치를 회전하는 제어 신호를 생성할 수 있다.예를 들어, 더블 탭 입력이 방향 표시의 반대 방향의 회전 UI에서 발생하는 경우, 전자 장치 는 무인 비행 장치가 180도를 회전하도록 하는 제어 신호를 생성할 수 있다. 전자 장치는 생성 한 제어 신호를 무인 비행 장치에 전송할 수 있다. 무인 비행 장치는 수신한 제어 신호에 따라 방향 설정 지점이 반대 방향을 향하도록 180도 회전할 수 있다. 도 12에서는 180도 회전의 경우를 예시적으로 도시하였으나, 이에 한정되는 것은 아니다. 전자 장치는 방 향 표시와 더블 탭 입력이 발생한 지점 사이의 각도를 기반으로 다양한 각도로 회전하는 제어 신호 를 생성할 수 있다(도 13 참조). 도 13은 다양한 실시 예에 따른 더블 탭 입력의 각도 계산을 나타내는 예시도이다. 도 13을 참조하면, 사용자 인터페이스에서, 전자 장치는 회전 UI에, 더블 탭 입력이 발 생한 경우, 무인 비행 장치를 회전하는 제어 신호를 생성할 수 있다. 전자 장치는 방향 표시과 더블 탭 입력이 발생한 지점 사이의 각도(C)를 산출할 수 있다. 일 실시 예에서, 각도(C)는 -180도 에서 +180도 사이의 값을 가질 수 있다. 예를 들어, 더블 탭 입력이 방향 표시의 좌측에서 발생한 경우, 각도(C)는 마이너스 값을 가질 수 있고, 더블 탭 입력이 방향 표시 의 우측에서 발생한 경우, 각도(C)는 플러스 값을 가질 수 있다. 전자 장치는 각도(C)에 관한 정보를 포함하는 제어 신호를 생성하여, 무인 비행 장치에 전송할 수 있 다. 무인 비행 장치는 수신한 제어 신호에 대응하여 방향 설정 지점을 회전시킬 수 있다. 예를 들어, 각도(C)가 마이너스인 경우, 무인 비행 장치는 반시계 방향으로 회전하여, 방향 설정 지점 이 향하는 방향을 변경할 수 있다. 반대로, 각도(C)가 플러스인 경우, 무인 비행 장치는 시계 방향으 로 회전하여, 방향 설정 지점이 향하는 방향을 변경할 수 있다. 사용자 인터페이스에서, 전자 장치는 무인 비행 장치의 회전에 의해 방향 설정 지점이 향 하는 방향이 변경되는 경우, 이에 대응하여 방향 표시의 위치를 변경할 수 있다. 방향 표시는 더블 탭 입력이 발생한 지점을 향하는 상태로 변경될 수 있다. 도 14는 다양한 실시 예에 따른 디스플레이의 landscape 모드에서의 제어 인터페이스를 나타내는 예시도이다. 도 14를 참조하면, 제어 인터페이스는 전체 영역에서 배경 이미지로 출력되는 촬영 화면(live view)을 포함할 수 있다. 제어 인터페이스는 촬영 화면의 내부에, 고도 UI, 방향 UI, 및 회전 UI를 포함할 수 있다. 제어 인터페이스는 무인 비행 장치의 방향 설정 지 점에 대응하는 방향 표시를 포함할 수 있다. 사용자는 portrait 모드(도 4)와 달리, 양손을 이용하여 무인 비행 장치를 제어할 수 있다. 예를 들어, 사 용자는 오른손을 이용하여, 고도 UI을 조작하고, 왼손을 이용하여 방향 UI 및 회전 UI를 조 작할 수 있다. 제어 인터페이스는 추가적으로, 사진 또는 동영상의 촬영과 관련된 인터페이스(예: 동영상 촬영 버 튼, 정지 영상 촬영 버튼), 비행 시작/비행 종료와 관련된 인터페이스(예: 착륙 버튼) 등을 포함할 수 있 다. 제어 인터페이스는, 제어 인터페이스과 달리, 고도 UI가 화면의 좌측에 배치되고, 방향 UI 및 회전 UI가 화면의 우측에 배치될 수 있다. 사용자의 설정 또는 자동 설정에 따라, 고도 UI, 방향 UI, 회전 UI의 배치 위치는 변경될 수 있고, 이를 통해 사용자의 편의성이 향상될 수 있다. 도 15는 다양한 실시 예에 따른 원형 디스플레이를 가지는 전자 장치를 나타낸다. 도 15를 참조하면, 원형 디스플레이는 방향 UI 및 회전 UI, 방향 표시(무인 비행 장치 의 방향 설정 지점에 대응함)를 포함할 수 있다. 방향 UI와 회전 UI의 사이에는 분리 영 역가 배치될 수 있다. 방향 UI와 회전 UI의 동작 방식은 각각 도 4에서의 방향 UI 및 회전 UI의 동작 방식과 동일 또는 유사할 수 있다. 다양한 실시 예에 따르면, 회전 UI는 터치 영역이 아닌, 원형 디스플레이를 둘러싸는 회전식 베젤 로 구현될 수 있다. 사용자는 터치 입력 방식이 아닌 베젤을 물리적으로 회전하는 방식으로 회전 입력을 발생시킬 수 있다. 다양한 실시 예에 따르면, 원형 디스플레이는 멀티 터치 입력이 발생하는 경우, 무인 비행 장치의 고도 조절을 나타내는 UI를 출력할 수 있다. 예를 들어, 원형 디스플레이에 줌 아웃(zoom-out) 입력이 발 생하는 경우, 원형 디스플레이는 막대 형태의 고도 UI(미도시)를 출력할 수 있다, 줌 아웃 입력의 진행 거리에 따라 무인 비행 장치의 고도가 낮아지는 제어 신호가 생성될 수 있다. 반대로, 원형 디스플레이 에 줌 인(zoom-in) 입력이 발생하는 경우, 무인 비행 장치의 고도가 높아지는 제어 신호가 생성될 수 있다. 도 16는 다양한 실시 예에 따른 전자 장치의 블록도를 나타낸다. 도 16는 다양한 실시 예에 따른 전자 장치의 블록도이다. 전자 장치는, 예를 들면, 도 000에 도시된 전자 장치의 전체 또는 일부를 포함할 수 있다. 전자 장치는 하나 이상의 프로세서(예: AP), 통신 모듈, (가입자 식별 모듈, 메모리 , 센서 모듈, 입력 장치, 디스플레이, 인터페이스, 오디오 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 인디케이터, 및 모터를 포함할 수 있다. 프로 세서는, 예를 들면, 운영 체제 또는 응용 프로그램을 구동하여 프로세서에 연결된 다수의 하드웨어 또는 소프트웨어 구성요소들을 제어할 수 있고, 각종 데이터 처리 및 연산을 수행할 수 있다. 프로세서는, 예를 들면, SoC(system on chip) 로 구현될 수 있다. 한 실시 예에 따르면, 프로세서(161 0)는 GPU(graphic processing unit) 및/또는 이미지 신호 프로세서를 더 포함할 수 있다. 프로세서는 도 16에 도시된 구성요소들 중 적어도 일부(예: 셀룰러 모듈)를 포함할 수도 있다. 프로세서 는 다른 구성요소들(예: 비휘발성 메모리) 중 적어도 하나로부터 수신된 명령 또는 데이터를 휘발성 메모리에 로드)하여 처리하고, 결과 데이터를 비휘발성 메모리에 저장할 수 있다. 통신 모듈(예: 통신 인터페이스)와 동일 또는 유사한 구성을 가질 수 있다. 통신 모듈은, 예를 들면, 셀룰러 모듈, WiFi 모듈, 블루투스 모듈, GNSS 모듈, NFC 모듈 및 RF 모듈를 포함할 수 있다. 셀룰러 모듈은, 예를 들면, 통신망을 통해서 음성 통화, 영상 통화, 문 자 서비스, 또는 인터넷 서비스 등을 제공할 수 있다. 한 실시 예에 따르면, 셀룰러 모듈은 가입자 식별 모듈(예: SIM 카드)을 이용하여 통신 네트워크 내에서 전자 장치의 구별 및 인증을 수행할 수 있다. 한 실시 예에 따르면, 셀룰러 모듈은 프로세서가 제공할 수 있는 기능 중 적어도 일부 기능 을 수행할 수 있다. 한 실시 예에 따르면, 셀룰러 모듈은 커뮤니케이션 프로세서(CP)를 포함할 수 있다. 어떤 실시 예에 따르면, 셀룰러 모듈, WiFi 모듈, 블루투스 모듈, GNSS 모듈 또는 NFC 모듈 중 적어도 일부(예: 두 개 이상)는 하나의 integrated chip(IC) 또는 IC 패키지 내에 포함될 수 있다. RF 모듈은, 예를 들면, 통신 신호(예: RF 신호)를 송수신할 수 있다. RF 모듈은, 예를 들 면, 트랜시버, PAM(power amp module), 주파수 필터, LNA(low noise amplifier), 또는 안테나 등을 포함할 수 있다. 다른 실시 예에 따르면, 셀룰러 모듈, WiFi 모듈, 블루투스 모듈, GNSS 모듈 또는 NFC 모듈 중 적어도 하나는 별개의 RF 모듈을 통하여 RF 신호를 송수신할 수 있다. 가입자 식별 모 듈은, 예를 들면, 가입자 식별 모듈을 포함하는 카드 또는 임베디드 SIM을 포함할 수 있으며, 고유한 식 별 정보(예: ICCID(integrated circuit card identifier)) 또는 가입자 정보(예: IMSI(international mobile subscriber identity))를 포함할 수 있다. 메모리(예: 메모리)는, 예를 들면, 내장 메모리 또는 외장 메모리를 포함할 수 있다. 내장 메모리는, 예를 들면, 휘발성 메모리(예: DRAM, SRAM, 또는 SDRAM 등), 비휘발성 메모리(예: OTPROM(one time programmable ROM), PROM, EPROM, EEPROM, mask ROM, flash ROM, 플래시 메모리, 하드 드라이 브, 또는 솔리드 스테이트 드라이브 (SSD) 중 적어도 하나를 포함할 수 있다. 외장 메모리는 플래시 드라 이브(flash drive), 예를 들면, CF(compact flash), SD(secure digital), Micro-SD, Mini-SD, xD(extreme digital), MMC(multi-media card) 또는 메모리 스틱 등을 포함할 수 있다. 외장 메모리는 다양한 인터페 이스를 통하여 전자 장치와 기능적으로 또는 물리적으로 연결될 수 있다. 센서 모듈은, 예를 들면, 물리량을 계측하거나 전자 장치의 작동 상태를 감지하여, 계측 또는 감지 된 정보를 전기 신호로 변환할 수 있다. 센서 모듈은, 예를 들면, 제스처 센서(1640A), 자이로 센서 (1640B), 기압 센서(1640C), 마그네틱 센서(1640D), 가속도 센서(1640E), 그립 센서(1640F), 근접 센서 (1640G), 컬러(color) 센서(1640H)(예: RGB(red, green, blue) 센서), 생체 센서(1640I), 온/습도 센서 (1640J), 조도 센서(1640K), 또는 UV(ultra violet) 센서(1640M) 중의 적어도 하나를 포함할 수 있다. 추가적으로 또는 대체적으로, 센서 모듈은, 예를 들면, 후각(e-nose) 센서, 일렉트로마이오그라피(EMG) 센서, 일렉트로엔씨팔로그램(EEG) 센서, 일렉트로카디오그램(ECG) 센서, IR(infrared) 센서, 홍채 센서 및/또는 지문 센서를 포함할 수 있다. 센서 모듈은 그 안에 속한 적어도 하나 이상의 센서들을 제어하기 위한 제어 회 로를 더 포함할 수 있다. 어떤 실시 예에서는, 전자 장치는 프로세서의 일부로서 또는 별도로, 센 서 모듈을 제어하도록 구성된 프로세서를 더 포함하여, 프로세서가 슬립(sleep) 상태에 있는 동안, 센서 모듈을 제어할 수 있다. 입력 장치는, 예를 들면, 터치 패널, (디지털) 펜 센서, 키, 또는 초음파 입력 장치 를 포함할 수 있다. 터치 패널은, 예를 들면, 정전식, 감압식, 적외선 방식, 또는 초음파 방식 중 적어도 하나의 방식을 사용할 수 있다. 또한, 터치 패널은 제어 회로를 더 포함할 수도 있다. 터치 패널 은 택타일 레이어(tactile layer)를 더 포함하여, 사용자에게 촉각 반응을 제공할 수 있다. (디지털) 펜 센서는, 예를 들면, 터치 패널의 일부이거나, 별도의 인식용 쉬트를 포함할 수 있다. 키는, 예를 들면, 물리적인 버튼, 광학식 키, 또는 키패드를 포함할 수 있다. 초음파 입력 장치는 마이크(예: 마이크 )를 통해, 입력 도구에서 발생된 초음파를 감지하여, 상기 감지된 초음파에 대응하는 데이터를 확인할 수 있다. 디스플레이(예: 디스플레이)는 패널, 홀로그램 장치, 프로젝터, 및/또는 이들 을 제어하기 위한 제어 회로를 포함할 수 있다. 패널은, 예를 들면, 유연하게, 투명하게, 또는 착용할 수 있게 구현될 수 있다. 패널은 터치 패널과 하나 이상의 모듈로 구성될 수 있다. 한 실시 예에 따르 면, 패널은 사용자의 터치에 대한 압력의 세기를 측정할 수 있는 압력 센서(또는 포스 센서)를 포함할 수 있다. 상기 압력 센서는 터치 패널과 일체형으로 구현되거나, 또는 터치 패널과는 별도의 하나 이 상의 센서로 구현될 수 있다. 홀로그램 장치는 빛의 간섭을 이용하여 입체 영상을 허공에 보여줄 수 있다. 프로젝터는 스크린에 빛을 투사하여 영상을 표시할 수 있다. 스크린은, 예를 들면, 전자 장치 의 내부 또는 외부에 위치할 수 있다. 인터페이스는, 예를 들면, HDMI, USB, 광 인터 페이스(optical interface), 또는 D-sub(D-subminiature)를 포함할 수 있다. 인터페이스는, 예를 들면, 도 1에 도시된 통신 인터페이스에 포함될 수 있다. 추가적으로 또는 대체적으로, 인터페이스 는, 예를 들면, MHL(mobile high-definition link) 인터페이스, SD카드/MMC(multi-media card) 인터페이 스, 또는 IrDA(infrared data association) 규격 인터페이스를 포함할 수 있다. 오디오 모듈은, 예를 들면, 소리와 전기 신호를 쌍방향으로 변환시킬 수 있다. 오디오 모듈의 적어 도 일부 구성요소는, 예를 들면, 도 1 에 도시된 입출력 인터페이스에 포함될 수 있다. 오디오 모듈(168 0)은, 예를 들면, 스피커, 리시버, 이어폰, 또는 마이크 등을 통해 입력 또는 출력되 는 소리 정보를 처리할 수 있다. 카메라 모듈은, 예를 들면, 정지 영상 및 동영상을 촬영할 수 있는 장치 로서, 한 실시 예에 따르면, 하나 이상의 이미지 센서(예: 전면 센서 또는 후면 센서), 렌즈, 이미지 시그널 프 로세서(ISP), 또는 플래시(예: LED 또는 xenon lamp 등)를 포함할 수 있다. 전력 관리 모듈은, 예를 들면, 전자 장치의 전력을 관리할 수 있다. 한 실시 예에 따르면, 전력 관리 모듈은 PMIC(power management integrated circuit), 충전 IC, 또는 배터리 또는 연료 게이지를 포함할 수 있다. PMIC는, 유선 및 /또는 무선 충전 방식을 가질 수 있다. 무선 충전 방식은, 예를 들면, 자기공명 방식, 자기유도 방식 또는 전자 기파 방식 등을 포함하며, 무선 충전을 위한 부가적인 회로, 예를 들면, 코일 루프, 공진 회로, 또는 정류기 등 을 더 포함할 수 있다. 배터리 게이지는, 예를 들면, 배터리의 잔량, 충전 중 전압, 전류, 또는 온도를 측정할 수 있다. 배터리는, 예를 들면, 충전식 전지 및/또는 태양 전지를 포함할 수 있다. 인디케이터는 전자 장치 또는 그 일부(예: 프로세서)의 특정 상태, 예를 들면, 부팅 상태, 메시지 상태 또는 충전 상태 등을 표시할 수 있다. 모터는 전기적 신호를 기계적 진동으로 변환할 수 있 고, 진동, 또는 햅틱 효과 등을 발생시킬 수 있다. 전자 장치는, 예를 들면, DMB(digital multimedia broadcasting), DVB(digital video broadcasting), 또는 미디어플로(mediaFloTM) 등의 규격에 따른 미디어 데이 터를 처리할 수 있는 모바일 TV 지원 장치(예: GPU)를 포함할 수 있다. 본 문서에서 기술된 구성요소들 각각은 하나 또는 그 이상의 부품(component)으로 구성될 수 있으며, 해당 구성요소의 명칭은 전자 장치의 종류에 따라 서 달라질 수 있다. 다양한 실시 예에서, 전자 장치(예: 전자 장치)는 일부 구성요소가 생략되거나, 추가 적인 구성요소를 더 포함하거나, 또는, 구성요소들 중 일부가 결합되어 하나의 개체로 구성되되, 결합 이전의 해당 구성요소들의 기능을 동일하게 수행할 수 있다. 다양한 실시 예에 따른 전자 장치는 무인 비행 장치(unmanned aerial vehicle)를 제어할 수 있고, 무인 비행 장 치와 무선 데이터를 송수신할 수 있는 통신 모듈, 무인 비행 장치를 조작하기 위한 사용자 인터페이스를 출력하 는 디스플레이, 메모리, 상기 통신 모듈, 상기 디스플레이, 상기 메모리와 전기적으로 연결되는 프로세서를 포 함하고, 상기 프로세서는 상기 무인 비행 장치의 제1 지점의 방향에 관한 정보를 상기 무인 비행 장치로부터 수 신하고, 상기 디스플레이에 상기 제1 지점의 방향에 대응하는 방향 표시 객체를 출력하고, 상기 무인 비행 장치 의 이동 또는 회전과 관련된 사용자 입력을 수신하는 경우, 상기 방향 표시 객체의 위치 및 상기 사용자 입력에 대응하여 상기 무인 비행 장치를 상기 제1 지점을 기준으로 이동 또는 회전 시키는 제어 신호를 생성하고, 상기 생성된 제어 신호를 상기 무인 비행 장치에 전송하도록 설정될 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 상기 무인 비행 장치의 동일 고도에서의 이동 또는 회전을 제어하기 위한 원형 UI를 상기 디스플레이에 출력하도록 설정될 수 있다. 상기 원형 UI는 상기 무인 비행 장치의 동일 고 도에서의 이동을 제어하는 원형의 방향 UI 및 상기 방향 UI를 원형 띠의 회전 UI를 포함할 수 있다. 상기 방향 표시 객체는 상기 회전 UI와 겹쳐서 출력되거나 상기 회전 UI의 외부에 표시될 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 상기 방향 UI에 사용자의 터치 입력이 발생하는 경우, 상기 터치 입 력의 이동 방향 및 이동 거리를 기반으로 상기 무인 비행 장치의 동일 고도에서의 이동을 조절하기 위한 제어 신호를 생성할 수 있다. 상기 프로세서는 상기 방향 표시 객체의 위치와 상기 상기 터치 입력이 연장되는 방향 을 기반으로 상기 이동 방향을 결정할 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 상기 회전 UI에 사용자의 터치 입력이 발생하는 경우, 상기 원형 UI 의 중심에서, 상기 터치 입력의 이동 각도를 기반으로 상기 무인 비행 장치의 동일 고도에서의 회전을 조절하기 위한 제어 신호를 생성할 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 상기 회전 UI 상에서 또는 상기 회전 UI에 인접한 지점에서 더블 탭 입력이 발생하는 경우, 상기 원형 UI의 중심에서, 상기 표시 개체와 상기 더블탭 입력이 발생한 지점 사이의 각 도를 기반으로 상기 무인 비행 장치의 동일 고도에서의 회전을 조절하기 위한 제어 신호를 생성할 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 상기 방향 UI에서 시작된 사용자 입력이 상기 회전 UI까지 연장되고, 상기 사용자 입력이 상기 회전 UI 상에서 진행 방향이 전환되는 경우, 상기 무인 비행 장치의 동일 고도에서의 이동 및 회전을 조절하기 위한 제어 신호를 생성할 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 상기 원형 UI의 주변 영역에 상기 무인 비행 장치의 고도를 제어하 기 위한 고도 UI를 출력하도록 설정될 수 있다. 상기 고도 UI는 상기 원형 UI의 좌우 측면에서, 상하 방향으로 연장되는 형태를 가지고, 사용자의 터치 입력에 의해 화면상에서 이동할 수 있는 이동 객체를 포함할 수 있다. 다양한 실시 예에 따른 전자 장치는 상기 디스플레이를 둘러싸는 회전이 가능한 회전형 베젤을 더 포함하고, 상 기 프로세서는 상기 무인 비행 장치의 동일 고도에서의 이동을 제어하기 위한 원형의 방향 UI를 출력하도록 설 정될 수 있다. 상기 프로세서는 상기 회전형 베젤의 회전 방향 및 회전 각도를 기반으로 상기 무인 비행 장치의 동일 고도에서의 회전을 조절하기 위한 제어 신호를 생성할 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 상기 디스플레이에 멀티 터치 입력이 발생하는 경우, 상기 멀티 터 치 입력을 기반으로 상기 무인 비행 장치의 고도를 조절하기 위한 제어 신호를 생성할 수 있다. 상기 프로세서 는 줌 아웃(zoom-out) 입력이 발생하는 경우, 상기 무인 비행 장치의 고도를 높이기 위한 제어 신호를 생성할 수 있다. 상기 프로세서는 줌 아웃(zoom-in) 입력이 발생하는 경우, 상기 무인 비행 장치의 고도를 낮추기 위한 제어 신호를 생성할 수 있다. 본 문서에서 기술된 구성요소들 각각은 하나 또는 그 이상의 부품(component)으로 구성될 수 있으며, 해당 구성 요소의 명칭은 전자 장치의 종류에 따라서 달라질 수 있다. 다양한 실시 예에서, 전자 장치는 본 문서에서 기술 된 구성요소 중 적어도 하나를 포함하여 구성될 수 있으며, 일부 구성요소가 생략되거나 또는 추가적인 다른 구 성요소를 더 포함할 수 있다. 또한, 다양한 실시 예에 따른 전자 장치의 구성 요소들 중 일부가 결합되어 하나 의 개체(entity)로 구성됨으로써, 결합되기 이전의 해당 구성 요소들의 기능을 동일하게 수행할 수 있다. 본 문서에서 사용된 용어 \"모듈\"은, 예를 들면, 하드웨어, 소프트웨어 또는 펌웨어(firmware) 중 하나 또는 둘 이상의 조합을 포함하는 단위(unit)를 의미할 수 있다. \"모듈\"은, 예를 들면, 유닛(unit), 로직(logic), 논리 블록(logical block), 부품(component), 또는 회로(circuit) 등의 용어와 바꾸어 사용(interchangeably use)될 수 있다. \"모듈\"은, 일체로 구성된 부품의 최소 단위 또는 그 일부가 될 수 있다. \"모듈\"은 하나 또는 그 이상 의 기능을 수행하는 최소 단위 또는 그 일부가 될 수도 있다. \"모듈\"은 기계적으로 또는 전자적으로 구현될 수 있다. 예를 들면, \"모듈\"은, 알려졌거나 앞으로 개발될, 어떤 동작들을 수행하는 ASIC(application-specificintegrated circuit) 칩, FPGAs(field-programmable gate arrays) 또는 프로그램 가능 논리 장치 (programmable-logic device) 중 적어도 하나를 포함할 수 있다. 다양한 실시 예에 따른 장치(예: 모듈들 또는 그 기능들) 또는 방법(예: 동작들)의 적어도 일부는, 예컨대, 프 로그램 모듈의 형태로 컴퓨터로 읽을 수 있는 저장매체(computer-readable storage media)에 저장된 명령어로 구현될 수 있다. 상기 명령어가 프로세서에 의해 실행될 경우, 상기 하나 이상의 프로세서가 상기 명령어에 해 당하는 기능을 수행할 수 있다. 컴퓨터로 읽을 수 있는 저장매체는, 예를 들면, 메모리가 될 수 있다. 컴퓨터로 판독 가능한 기록 매체는, 하드디스크, 플로피디스크, 마그네틱 매체(magnetic media)(예: 자기테이프), 광기록 매체(optical media)(예: CD-ROM, DVD(Digital Versatile Disc), 자기-광 매체(magneto- optical media)(예: 플롭티컬 디스크(floptical disk)), 하드웨어 장치(예: ROM, RAM, 또는 플래시 메모리 등) 등을 포함할 수 있다. 또한, 프로그램 명령에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함할 수 있다. 상술한 하드웨어 장치는 다양한 실시 예의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지다. 다양한 실시 예에 따른 모듈 또는 프로그램 모듈은 전술한 구성요소들 중 적어도 하나 이상을 포함하거나, 일부 가 생략되거나, 또는 추가적인 다른 구성요소를 더 포함할 수 있다. 다양한 실시 예에 따른 모듈, 프로그램 모 듈 또는 다른 구성요소에 의해 수행되는 동작들은 순차적, 병렬적, 반복적 또는 휴리스틱(heuristic)한 방법으 로 실행될 수 있다. 또한, 일부 동작은 다른 순서로 실행되거나, 생략되거나, 또는 다른 동작이 추가될 수 있다. 그리고 본 문서에 개시된 실시 예는 개시된, 기술 내용의 설명 및 이해를 위해 제시된 것이며, 본 발명의 범위 를 한정하는 것은 아니다. 따라서, 본 문서의 범위는, 본 발명의 기술적 사상에 근거한 모든 변경 또는 다양한 다른 실시 예를 포함하는 것으로 해석되어야 한다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10a 도면10b 도면11 도면12 도면13 도면14 도면15 도면16"}
{"patent_id": "10-2016-0180262", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 다양한 실시 예에 따른 무인 비행 장치 및 전자 장치를 나타낸다. 도 2는 다양한 실시 예에 따른 무인 비행 장치의 구성도이다. 도 3는 다양한 실시 예에 따른 이미지 촬영 방법을 나타내는 순서도이다. 도 4는 다양한 실시 예에 따른 무인 비행 장치를 제어하는 전자 장치의 디스플레이를 나타낸다.도 5는 다양한 실시 예에 따른 무인 비행 장치의 고도를 변경하는 조작 예시도이다. 도 6 내지 도 8은 다양한 실시 예에 따른 동일 고도에서 무인 비행 장치를 이동시키는 조작 예시도이다. 도 9는 다양한 실시 예에 따른 동일 고도에서 무인 비행 장치를 회전시키는 조작 예시도이다. 도 10a는 다양한 실시 예에 따른 사용자 입력의 발생 위치에 인식 방식을 나타내는 예시도이다. 도 10b는 다양한 실시 예에 따른 사용자 입력에 따른 각도 환산을 설명한다. 도 11은 다양한 실시 예에 따른 동일 고도에서의 복합 입력을 나타낸다. 도 12는 다양한 실시 예에 따른 더블 탭 입력을 이용한 방향 전환을 나타낸다. 도 13은 다양한 실시 예에 따른 더블 탭 입력의 각도 계산을 나타내는 예시도이다. 도 14는 다양한 실시 예에 따른 디스플레이의 landscape 모드에서의 제어 인터페이스를 나타내는 예시도이다. 도 15는 다양한 실시 예에 따른 원형 디스플레이를 가지는 전자 장치를 나타낸다. 도 16는 다양한 실시 예에 따른 전자 장치의 블록도를 나타낸다."}
