{"patent_id": "10-2024-0087331", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0010538", "출원번호": "10-2024-0087331", "발명의 명칭": "환자정보 및 치료 정보에 대한 빅데이터 수집을 기반으로 한 환자 치료 서비스 제공 시스템", "출원인": "김지호", "발명자": "김지호"}}
{"patent_id": "10-2024-0087331", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "환자의 건강 팩터를 수집하여 빅데이터로 저장하는 정보 수집 모듈;을 포함하며, 이를 분석하여 맞춤형 치료 계획을 제공하는 환자 치료 서비스 제공 시스템에 있어서,머신러닝 및 딥러닝 알고리즘을 적용하여 팩터 간의 상관관계를 분석하고, 정상과 비정상 팩터를 구별하는 인공지능 모듈;상기 인공지능 모듈은 환자의 치료 과정에서 수집된 데이터를 바탕으로 지속적으로 치료 프로토콜을 개선하며,인터넷을 통해 다른 병원과 데이터를 공유하고 업데이트할 수 있는 기능을 포함하는 통신 모듈;을 포함하는 것을 특징으로 하는 환자 치료 서비스 제공 시스템."}
{"patent_id": "10-2024-0087331", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "빅데이터로 수집된 환자의 건강 팩터 데이터를 분석하여, 치료 성공률에 영향을 미치는 주요 팩터들을식별하고, 이러한 주요 팩터들을 개선하기 위한 맞춤형 치료 방법을 제시하는 환자 치료 서비스 제공 방법에 있어서,환자의 건강 팩터 데이터를 수집하는 단계;수집된 데이터를 빅데이터로 저장하는 단계;머신러닝 및 딥러닝 알고리즘을 적용하여 팩터 간의 상관관계를 분석하는 단계;분석 결과를 바탕으로 치료 성공률에 영향을 미치는 주요 팩터들을 식별하는 단계;식별된 주요 팩터들을 개선하기 위한 맞춤형 치료 방법을 제시하는 단계; 및환자에게 맞춤형 치료 계획을 제공하고, 치료 과정에서 수집된 데이터를 지속적으로 분석하여 치료 프로토콜을개선하는 단계;를 포함하는 것을 특징으로 하는 환자 치료 서비스 제공 방법."}
{"patent_id": "10-2024-0087331", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 환자의 다양한 건강 팩터를 빅데이터로 수집하고, 이를 바탕으로 머신러닝 및 딥러닝 기술을 적용하여 환자별 맞춤형 치료 계획을 제시하는 시스템을 제공한다. 이러한 시스템은 환자의 치료 성공률을 높이고, 치료 과정에서 발생할 수 있는 문제를 최소화할 수 있다."}
{"patent_id": "10-2024-0087331", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 의료업 및 의료 서비스, 전자통신 소프트웨어 관련 기술에 관한 것으로, 환자정보 및 치료 정보에 대 한 빅데이터 수집을 기반으로 한 머신러닝에 따른 환자 치료 서비스 제공 시스템 및 그에 대한 방법에 관한 것 이다."}
{"patent_id": "10-2024-0087331", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "의료 분야에서 환자의 다양한 건강 데이터와 치료 정보를 수집하고 분석하여 보다 개인화된 치료 계획을 수립하 는 것이 중요하다. 기존 시스템은 이러한 데이터를 체계적으로 수집하고 분석하는 데에 한계가 있었다. 이에 따 라, 본 발명은 빅데이터와 머신러닝을 활용하여 보다 효과적이고 개인화된 환자 치료 서비스를 제공할 수 있는 시스템을 제안한다."}
{"patent_id": "10-2024-0087331", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 환자의 건강 팩터와 치료 정보를 빅데이터로 수집하고, 이를 바탕으로 머신러닝 및 딥러닝 기 술을 적용하여 환자별 맞춤형 치료 계획을 제공하는 시스템 및 방법을 제안하는 것이다. 이를 통해 다음과 같은 구체적인 목적을 달성하고자 한다 개인화된 의료 서비스 제공: 환자의 개별적인 건강 상태와 특성을 고려한 맞춤형 치료 계획을 수립하여, 치료의 효과를 극대화하고 환자 만족도를 높인다. 치료 성공률 향상: 다양한 건강 팩터들 간의 상관관계를 분석하여, 치료 성공률에 영향을 미치는 주요 요인을 식별하고 이를 개선함으로써 치료 성공률을 높인다. 데이터 기반 의사결정 지원: 빅데이터와 머신러닝을 활용한 정밀한 분석을 통해 의사들이 보다 정확하고 효율적 인 치료 결정을 내릴 수 있도록 지원한다. 지속적인 치료 프로토콜 개선: 치료 과정에서 축적된 데이터를 지속적으로 분석하여, 최신의 치료 프로토콜을 개발하고 적용함으로써 의료 서비스의 질을 지속적으로 개선한다. 의료 데이터의 통합 관리: 환자의 건강 데이터를 체계적으로 수집, 저장, 분석하여 통합적으로 관리함으로써 의 료 정보의 활용성을 높이고, 타 병원 및 플랫폼과의 자료 공유를 통해 의료 협업을 강화한다. 예측 모델 수립: 환자의 치아 상태 및 전반적인 건강 상태를 예측하는 모델을 수립하여, 예방적 차원의 의료 서 비스를 제공하고 건강 문제를 사전에 관리할 수 있도록 한다."}
{"patent_id": "10-2024-0087331", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 의해 환자의 건강 팩터를 수집하여 빅데이터로 저장하고, 이를 분석하여 맞춤형 치료 계획을 제공하 는 환자 치료 서비스 제공 시스템이 개시될 수 있다. 상기 시스템은 머신러닝 및 딥러닝 알고리즘을 적용하여 팩터 간의 상관관계를 분석하고, 정상과 비정상 팩터를 구별하는 것을 특징으로 한다. 상기 시스템은 환자의 치료 과정에서 수집된 데이터를 바탕으로 지속적으로 치료 프로토콜을 개선하는 것을 특 징으로 한다. 상기 시스템은 인터넷을 통해 다른 병원과 데이터를 공유하고 업데이트할 수 있는 기능을 포함하는 것을 특징으 로 한다."}
{"patent_id": "10-2024-0087331", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 환자별 맞춤형 치료 계획을 제공함으로써 치료의 성공률을 높일 수 있다. 또한, 빅데이터와 머신러닝을 활용하여 보다 정밀하고 개인화된 의료 서비스를 제공할 수 있다. 또한, 환자의 건강 데이터를 체계적으로 수집하고 분석함으로써 의료 서비스의 품질을 향상시킬 수 있다. 본 발명에 따른 효과는 이상에서 제시된 내용에 의해 제한되지 않으며, 더욱 다양한 효과들이 본 명세서 내에 포함되어 있다."}
{"patent_id": "10-2024-0087331", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 개시의 일부 실시예들을 예시적인 도면을 참조하여 상세하게 설명한다. 각 도면의 구성 요소들에 참조 부호를 부가함에 있어서, 동일한 구성 요소들에 대해서는 비록 다른 도면상에 표시되더라도 가능한 한 동일한 부호를 가질 수 있다. 또한, 본 실시예들을 설명함에 있어, 관련된 공지 구성 또는 기능에 대한 구체적인 설명 이 본 기술 사상의 요지를 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명은 생략할 수 있다. 본 명세서 상 에서 언급된 \"포함한다\", \"갖는다\", \"이루어진다\" 등이 사용되는 경우 \"~만\"이 사용되지 않는 이상 다른 부분이 추가될 수 있다. 구성 요소를 단수로 표현한 경우에 특별한 명시적인 기재 사항이 없는 한 복수를 포함하는 경 우를 포함할 수 있다. 또한, 본 개시의 구성 요소를 설명하는 데 있어서, 제1, 제2, A, B, (a), (b) 등의 용어 를 사용할 수 있다. 이러한 용어는 그 구성 요소를 다른 구성 요소와 구별하기 위한 것일 뿐, 그 용어에 의해 해당 구성 요소의 본질, 차례, 순서 또는 개수 등이 한정되지 않는다. 구성 요소들의 위치 관계에 대한 설명에 있어서, 둘 이상의 구성 요소가 \"연결\", \"결합\" 또는 \"접속\" 등이 된다 고 기재된 경우, 둘 이상의 구성 요소가 직접적으로 \"연결\", \"결합\" 또는 \"접속\" 될 수 있지만, 둘 이상의 구성 요소와 다른 구성 요소가 더 \"개재\"되어 \"연결\", \"결합\" 또는 \"접속\"될 수도 있다고 이해되어야 할 것이다. 여 기서, 다른 구성 요소는 서로 \"연결\", \"결합\" 또는 \"접속\" 되는 둘 이상의 구성 요소 중 하나 이상에 포함될 수 도 있다. 구성 요소들이나, 동작 방법이나 제작 방법 등과 관련한 시간적 흐름 관계에 대한 설명에 있어서, 예를 들어, \"~후에\", \"~에 이어서\", \"~다음에\", \"~전에\" 등으로 시간적 선후 관계 또는 흐름적 선후 관계가 설명되는 경우, \"바로\" 또는 \"직접\"이 사용되지 않는 이상 연속적이지 않은 경우도 포함할 수 있다. 한편, 구성 요소에 대한 수치 또는 그 대응 정보(예: 레벨 등)가 언급된 경우, 별도의 명시적 기재가 없더라도, 수치 또는 그 대응 정보는 각종 요인(예: 공정상의 요인, 내부 또는 외부 충격, 노이즈 등)에 의해 발생할 수 있는 오차 범위를 포함하는 것으로 해석될 수 있다. 본 개시에서 상하 방향이 정의될 수 있다. 상하 방향은 지 면에 실질적으로 수직한 방향일 수 있다. 전후 방향은 상기 상하 방향에 수직한 일 방향일 수 있고, 좌우 방향 은 상기 상하 방향과 상기 전후 방향 모두에 수직한 방향일 수 있다. 이하 하기 도면을 참고하여 본 발명의 실 시 예에 따른 설명을 더욱 자세하게 하도록 한다. 도 1은 본 발명에 따른 환자 치료 서비스 제공 시스템의 개념도이고, 도 2는 본 발명에 따른 환자 치료 서비스 제공 시스템 및 그에 대한 방법의 개념도이며, 도 3은 본 발명에 따른 환자 치료 서비스 제공 방법의 순서도이 다. 1. 데이터 수집 본 발명에 따른 환자 치료 서비스 제공 시스템은 정보 수집 모듈을 활용하여 다양한 건강 팩터들을 체계 적으로 수집한다. 하나의 예로, 건강 팩터에는 흡연, 음주, 치주상태, 교합, 나이, 성별, 과거 병력, 골질, 출 혈, 복용중인 약, 키, 몸무게, 병리학적 상태, 임플란트 크기, 골 이식재, 염증성 질환 등이 포함된다. 해당 정 보 수집 모듈은 각 환자의 방문 시마다 최신 데이터를 갱신하고, 환자 기록에 추가한다. 정보 수집 모듈은 수집된 데이터를 빅데이터로 통합하여 환자 치료 서비스 제공 시스템 내에 저장한다. 하나의 예로 저장 과정에서 클라우드 기반의 데이터베이스를 이용할 수 있으며, 안전하고 효율적으로 데이터를 관리할 수 있도록 한다. 또한, 데이터의 무결성을 유지하고, 적절한 보안 조치를 통해 환자의 개인정보를 보호 한다. 본 발명에 따른 인공지능 모듈은 수집된 빅데이터를 바탕으로 빅데이터 분석 및 머신러닝을 적용한다. 따라 서 데이터 전처리 과정을 통해 수집된 데이터를 정제하고, 누락된 데이터를 보완하거나 이상치를 제거한다. 다 음으로 정제된 데이터를 분석에 적합한 형태로 변환한다. 다음으로 정제된 데이터를 바탕으로 머신러닝 및 딥러 닝 모델을 학습시킨다. 다음으로 팩터들 간의 상관관계를 분석하고, 전체 성공률에 미치는 영향을 정량적으로 평가한다. 다음으로 정상과 비정상 팩터를 구별하고, 중간 단계의 팩터는 단계별로 구분하여 배치한다. 본 발명에 따른 환자 치료 서비스 제공 시스템은 인공지능 모듈의 모델의 성능 평가 및 개선을 위해 학 습된 모델의 성능을 평가하고, 필요에 따라 모델을 개선한다. 새로운 데이터를 지속적으로 모델에 반영하여 모 델의 정확도를 높인다. 이에 따라 맞춤형 치료 계획이 수립되고 제공될 수 있는데, 분석된 데이터를 바탕으로 환자에게 최적의 치료 방법을 제시한다. 하나의 예로, 임플란트의 성공률을 높이기 위해 흡연 환자에게 금연 프 로그램을 추천하거나, 특정 약물을 복용하는 환자에게 대체 약물을 제안할 수 있다. 또한, 기존 사례와의 비교 하여 이전 유사 환자의 치료 방법과 결과를 참고하여, 환자에게 최적의 치료 계획을 수립한다. 이를 통해 보다 개인화된 치료 계획을 제공할 수 있다. 인공지능 모듈은 데이터 기반 프로토콜을 개선할 수 있는데, 치료 과정에서 수집된 데이터를 지속적으로 분 석하여, 새로운 치료 프로토콜을 개발한다. 이를 통해 치료의 효과를 극대화하고, 환자의 건강 상태를 지속적으 로 개선한다. 또한, 최신의 연구 결과와 임상 데이터를 반영하여 치료 프로토콜을 업데이트한다. 통신 모듈(3 0)은 해당 과정에서 인터넷을 통해 다른 병원과 데이터를 공유하고, 협력하여 인공지능 모듈에게 전달하고 최신의 치료 정보를 반영할 수 있도록 한다. 본 발명에 따른 환자 치료 서비스 제공 시스템은 인공지능 모듈을 활용하여 예측 모델 수립 및 예방적 의료 서비스 제공이 가능하다. 하나의 예로 환자의 치아 상태 및 전반적인 건강 상태를 예측하는 모델을 개발한 다. 이를 통해 잠재적인 건강 문제를 사전에 발견하고, 예방적 차원의 의료 서비스를 제공할 수 있다. 또한, 예 측 모델을 바탕으로 환자에게 예방적 치료 계획을 수립하여 제시한다. 하나의 예로, 특정 치주 질환의 발생 가 능성이 높은 환자에게는 정기적인 치주 관리 프로그램을 추천한다. 본 발명에 따른 환자 치료 서비스 제공 시스템은 사용자 친화적 인터페이스를 제공하는데, 의료진이 쉽게 사 용할 수 있는 사용자 친화적인 인터페이스를 제공한다. 이를 통해 데이터 입력, 분석 결과 확인, 치료 계획 수 립 등이 간편하게 이루어질 수 있도록 한다. 또한, 다양한 의료 시스템과의 통합을 통해 상호 운용성을 확보한 다. 이를 통해 환자의 의료 데이터를 효율적으로 관리하고, 필요한 경우 다른 의료 기관과의 협력을 강화할 수 있다. 본 발명은 방법으로 구현될 수 있다. 하나의 예로, 빅데이터로 수집된 환자의 건강 팩터 데이터를 분석하여, 치 료 성공률에 영향을 미치는 주요 팩터들을 식별하고, 이러한 주요 팩터들을 개선하기 위한 맞춤형 치료 방법을 제시하는 환자 치료 서비스 제공 방법은 환자의 건강 팩터 데이터를 수집하는 단계; 수집된 데이터를 빅데이터 로 저장하는 단계; 머신러닝 및 딥러닝 알고리즘을 적용하여 팩터 간의 상관관계를 분석하는 단계; 분석 결과를 바탕으로 치료 성공률에 영향을 미치는 주요 팩터들을 식별하는 단계; 식별된 주요 팩터들을 개선하기 위한 맞 춤형 치료 방법을 제시하는 단계; 및 환자에게 맞춤형 치료 계획을 제공하고, 치료 과정에서 수집된 데이터를 지속적으로 분석하여 치료 프로토콜을 개선하는 단계;를 포함하며 순차적으로 구현될 수 있다. 이상의 설명은 본 발명의 기술 사상을 예시적으로 설명한 것에 불과한 것으로서, 본 발명이 속하는 기술 분야에 서 통상의 지식을 가진 자라면 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 다양한 수정 및 변형이 가 능할 것이다. 따라서, 본 발명에 개시된 실시예들은 본 발명의 기술 사상을 한정하기 위한 것이 아니라 설명하 기 위한 것이고, 이러한 실시예에 의하여 본 발명의 기술사상의 범위가 한정되는 것은 아니다. 본 발명의 보호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술 사상은 본 발명의 권리범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2024-0087331", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 환자 치료 서비스 제공 시스템의 개념도이다. 도 2는 본 발명에 따른 환자 치료 서비스 제공 시스템 및 그에 대한 방법의 개념도이다. 도 3은 본 발명에 따른 환자 치료 서비스 제공 방법의 순서도이다. 위에서 참조된 도면들은 반드시 축적에 맞추어 도시된 것은 아니고, 본 개시의 기본 원리를 예시하는 다양한 선 호되는 특징들의 다소 간략한 표현을 제시하는 것으로 이해되어야 한다. 예를 들어, 특정 치수, 방향, 위치 및 형상을 포함하는 본 개시의 특정 설계 특징들이 특정 의도된 응용과 사용 환경에 의해 일부 결정될 것이다."}
