{"patent_id": "10-2016-0170042", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2018-0068411", "출원번호": "10-2016-0170042", "발명의 명칭": "무인 비행 전자 장치의 운행 제어 방법 및 이를 지원하는 전자 장치", "출원인": "삼성전자주식회사", "발명자": "김태균"}}
{"patent_id": "10-2016-0170042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,하우징;상기 하우징 상에 제공된 사용자 인터페이스;상기 하우징 내측에 배치되고 상기 하우징의 오리엔테이션(orientation)과 관련한 제1 데이터를 생성하는 적어도 하나의 제1 센서;상기 하우징 내측에 배치되고 상기 하우징의 위치와 관련한 제2 데이터를 생성하는 제2 센서;상기 하우징 내측에 위치한 무선 통신 회로;상기 하우징 내측에 위치하고 상기 사용자 인터페이스, 상기 적어도 하나의 제1 센서, 상기 제2 센서 및 상기무선 통신 회로와 전기적으로 연결되는 프로세서; 및상기 하우징 내측에 배치되고 상기 프로세서에 전기적으로 연결되는 메모리를 포함하고, 상기 메모리는, 실행시에, 상기 프로세서가 무선 통신 회로를 통해 무인 비행 장치와 무선 통신을 형성하고,상기 적어도 하나의 제1 센서로부터 제1 데이터를 수신하고,상기 수신된 제1 데이터의 적어도 일부를 기반으로 하우징의 오리엔테이션을 결정하고,상기 제 2 센서로부터 제 2 데이터를 수신하고,상기 수신된 제 2 데이터에 적어도 일부 기초하여, 상기 하우징의 위치를 결정하고,상기 오리엔테이션 및 위치에 적어도 일부 기반하여, 상기 무인 비행 장치가 머무르게 될 대기 공간을결정하고,상기 무선 통신 회로를 통해 상기 무인 비행 장치에 제어 신호를 전송하는 인스트럭션들(instructions)을 저장하며,상기 제어 신호는, 상기 무인 비행 장치가, 상기 결정된 대기 공간 내에서 머무르거나, 상기 대기 공간 내로 날아가도록 구성된 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2016-0170042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,위에서 보았을 때, 상기 대기 공간은 팬(fan) 모양을 가지는 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2016-0170042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 팬 모양은 상기 하우징의 위치에 또는 그 위치에 근접한 정점(vertex)을 포함하는 전자 장치."}
{"patent_id": "10-2016-0170042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 대기 공간은, 위에서 보았을 때, 상기 하우징의 위치로부터 서로 다른 방향들로 연장된 제1 가상 라인 및제2 가상라인 에 의해 정의되고,공개특허 10-2018-0068411-3-제1 가상 라인 및 제2 가상 라인은 상기 하우징의 위치에서 일정 각도를 형성하는 전자 장치."}
{"patent_id": "10-2016-0170042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,위에서 보았을 때, 상기 각도는 예각인 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2016-0170042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,위에서 보았을 때, 상기 각도는 40도 내지 180도의 범위인 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2016-0170042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 사용자 인터페이스는 디스플레이를 포함하고, 상기 인스트럭션들은 상기 프로세서가 상기 디스플레이의 오리엔테이션에 적어도 일부 기반하여 상기 하우징의 오리엔테이션을 결정하도록 설정된 전자 장치."}
{"patent_id": "10-2016-0170042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "전자 장치에 있어서,비행 장치와 통신 채널을 형성하는 통신 회로;위치 정보 및 자세 정보를 수집하는 센서;상기 비행 장치 운행 제어와 관련한 어플리케이션이 저장된 메모리; 및상기 통신 회로와 상기 센서 및 상기 메모리와 전기적으로 연결되는 프로세서;를 포함하고,상기 프로세서는상기 전자 장치의 위치 및 자세 정보에 기반하여 지정된 방향에 대해 상기 비행 장치가 운행할 수 있는 공간을정의한 유효 범위를 산출하도록 설정된 전자 장치."}
{"patent_id": "10-2016-0170042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 프로세서는상기 메모리에 저장된 설정 값을 획득하고, 획득된 설정 값에 따라, 상기 유효 범위의 크기 및 유효 범위의 형태 중 적어도 하나를 조정하도록 설정된 전자 장치."}
{"patent_id": "10-2016-0170042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 프로세서는상기 유효 범위의 형태와 관련한 설정 값에 따라, 상기 유효 범위를 다각 뿔 또는 원뿔의 형태로 조정하도록 설정된 전자 장치."}
{"patent_id": "10-2016-0170042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항에 있어서,상기 프로세서는상기 유효 범위 중 적어도 일부분이 지면으로부터 일정 높이 이상에서 상기 비행 장치가 운행되도록 설정하는전자 장치.공개특허 10-2018-0068411-4-청구항 12 제8항에 있어서,상기 프로세서는위치 또는 자세 중 적어도 하나가 변경되면, 변경된 위치 또는 자세에 대응하여 유효 범위를 재산출하고, 재산출된 유효 범위를 상기 비행 장치에 전송하도록 설정된 전자 장치."}
{"patent_id": "10-2016-0170042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제8항에 있어서,일정 촬영각을 기반으로 영상을 획득하는 카메라;를 더 포함하고,상기 프로세서는상기 카메라의 FOV를 상기 유효 범위로 설정하는 전자 장치."}
{"patent_id": "10-2016-0170042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제8항에 있어서,디스플레이;를 더 포함하고,상기 프로세서는상기 유효 범위를 지시하는 가상 객체를 상기 디스플레이 출력하도록 설정된 전자 장치."}
{"patent_id": "10-2016-0170042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제8항에 있어서,상기 프로세서는상기 비행 장치의 위치 정보를 수집하고, 상기 비행 장치가 상기 유효 범위 내에 있는지 확인하고, 상기 비행장치가 상기 유효 범위를 벗어난 경우, 상기 비행 장치가 상기 유효 범위 내 지정된 지점으로 이동하도록 제어정보를 자동 생성한 후, 상기 비행 장치에 전송하도록 설정된 전자 장치."}
{"patent_id": "10-2016-0170042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제8항에 있어서,상기 프로세서는현재 위치 및 자세 정보에 따라 실시간 산출된 유효 범위 정보를 상기 비행 장치에 전송하도록 설정된 전자 장치."}
{"patent_id": "10-2016-0170042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "전자 장치의 프로세서가 비행 장치와 통신 채널을 형성하는 동작;상기 전자 장치의 위치 정보 및 자세 정보를 수집하는 동작;획득된 상기 전자 장치의 위치 및 자세 정보에 기반하여 상기 전자 장치의 일 지점을 기준으로 지정된 방향에대해 상기 비행 장치가 운행할 수 있는 공간을 정의한 유효 범위를 산출하는 동작;상기 전자 장치가 상기 비행 장치의 위치 정보를 수집하는 동작;상기 전자 장치가 상기 비행 장치가 상기 유효 범위 내에 있는지 확인하는 동작;확인 결과에 따라 상기 비행 장치의 운행과 관련한 제어 정보를 상기 비행 장치에 전송하는 동작;을 포함하는무인 비행 장치의 운행 제어 방법."}
{"patent_id": "10-2016-0170042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "공개특허 10-2018-0068411-5-제17항에 있어서,상기 전송하는 동작은상기 비행 장치가 상기 유효 범위 밖에 있는 경우 상기 비행 장치를 상기 유효 범위의 지정된 지점으로 이동시키는 제어 정보를 자동으로 생성하여 상기 비행 장치에 전송하는 동작;을 포함하는 무인 비행 장치의 운행 제어방법."}
{"patent_id": "10-2016-0170042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제17항에 있어서,상기 전송하는 동작은상기 비행 장치가 상기 유효 범위 내에 있는 경우, 상기 전자 장치가 사용자 입력을 수집하는 동작;상기 사용자 입력에 대응하여 상기 비행 장치를 지정된 방향과 지정된 거리 및 지정된 속도로 이동시키는 제어정보를 생성하여 상기 비행 장치에 전송하는 동작;을 포함하는 무인 비행 장치의 운행 제어 방법."}
{"patent_id": "10-2016-0170042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제17항에 있어서,상기 산출하는 동작은상기 전자 장치의 메모리에 저장된 설정 값을 획득하는 동작;획득된 설정 값에 따라, 상기 유효 범위의 크기 및 유효 범위의 형태 중 적어도 하나를 조정하는 동작;을 포함하는 무인 비행 장치의 운행 제어 방법."}
{"patent_id": "10-2016-0170042", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 실시 예는 비행 장치와 통신 채널을 형성하는 통신 회로, 위치 정보 및 자세 정보를 수집하는 센서, 상기 비행 장치 운행 제어와 관련한 어플리케이션이 저장된 메모리 및 상기 통신 회로와 상기 센서 및 상기 메모 리와 전기적으로 연결되는 프로세서를 포함하고, 상기 프로세서는 현재 자신의 위치 및 자세 정보에 기반하여 지 정된 방향에 대해 상기 비행 장치가 운행할 수 있는 공간을 정의한 유효 범위를 산출하도록 설정된 전자 장치를 개시한다. 이 외에도 명세서를 통해 파악되는 다양한 실시 예가 가능하다."}
{"patent_id": "10-2016-0170042", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시 예는 무인 비행 전자 장치의 운행에 관한 것이다."}
{"patent_id": "10-2016-0170042", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "무인 비행 전자 장치(UAV, Unmanned aerial vehicle) 는 일반적으로 드론(Drone), 무인 항공 체계(UAS, unmanned aircraft system)등 다양한 형태의 이름으로 불리고 있으며, 조종사를 탑승하지 않고 지정된 임무를 수행할 수 있도록 제작한 비행체이다. 무인 비행 전자 장치는 원격 제어장치(remote controller)와 무선 연결되 어 원격 제어될 수 있다. 무인 비행 전자 장치 (UAV) 드론 (Drone)은 카메라를 이용한 항공 촬영과 농약 살포와 같은 산업용 및 레저용으로 활용되고 있다."}
{"patent_id": "10-2016-0170042", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "무인 비행 전자 장치는 장치 운행을 제어할 수 있는 스틱 또는 터치 패드 등을 포함하는 입력 장치를 제공하고 있다. 무인 비행 전자 장치는 입력 장치로부터 수신된 제어 정보에 따라 일정 방향으로 이동할 수 있다. 이 동 작에서, 무인 비행 전자 장치는 관성 운동을 하기 때문에, 사용자가 무인 비행 전자 장치를 인지하고 입력한 입 력 예상 범위와 실제 무인 비행 전자 장치가 움직이는 거리가 상이한 경우가 많고, 사용자가 입력한 무인 비행 전자 장치의 이동 예상 속도와 무인 비행 전자 장치의 실제 이동 속도가 상이한 경우가 많아서 능숙하지 못한 사용자가 무인 비행 전자 장치를 제어하는 것이 어려운 실정이다. 이에 따라, 무인 비행 전자 장치에 대한 조작 이 잘못된 경우 바로 잡기가 쉽지 않고, 더욱이 인명 피해가 발생할 수 있는 상황에 직면하거나 무인 비행 전자 장치가 소실되는 등의 피해가 발생할 수 있는 상황에 직면하더라도 적절한 대응을 하기 어려운 문제가 있었다. 본 발명의 다양한 실시예들은 제한 범위 내에서 무인 비행 전자 장치를 운행함으로써, 안정적인 무인 비행 전자 장치 조작을 지원하는 무인 비행 전자 장치의 운행 제어 방법 및 이를 지원하는 전자 장치를 제공할 수 있다.본 발명의 다양한 실시 예들은 무인 비행 전자 장치가 운행 가능한 제한 범위를 이용하여 무인 비행 전자 장치 가 안전 영역에 위치하도록 함으로써, 무인 비행 전자 장치의 조작 실수를 방지할 수 있도록 하는 무인 비행 전 자 장치의 운행 제어 방법 및 이를 지원하는 전자 장치를 제공할 수 있다."}
{"patent_id": "10-2016-0170042", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 다양한 실시 예에 따른 전자 장치는 하우징, 상기 하우징 상에 제공된 사용자 인터페이스, 상기 하우 징 내측에 배치되고 상기 하우징의 오리엔테이션(orientation)과 관련한 제1 데이터를 생성하는 적어도 하나의 제1 센서, 상기 하우징 내측에 배치되고 상기 하우징의 위치와 관련한 제2 데이터를 생성하는 제2 센서, 상기 하우징 내측에 위치한 무선 통신 회로, 상기 하우징 내측에 위치하고 상기 사용자 인터페이스, 상기 적어도 하 나의 제1 센서, 상기 제2 센서 및 상기 무선 통신 회로와 전기적으로 연결되는 프로세서 및 상기 하우징 내측에 배치되고 상기 프로세서에 전기적으로 연결되는 메모리를 포함하고, 상기 메모리는, 실행시에, 상기 프로세서가 무선 통신 회로를 통해 무인 비행 장치와 무선 통신을 형성하고, 상기 적어도 하나의 제1 센서로부터 제1 데이 터를 수신하고, 상기 수신된 제1 데이터의 적어도 일부를 기반으로 하우징의 오리엔테이션을 결정하고, 상기 제 2 센서로부터 제 2 데이터를 수신하고, 상기 수신된 제 2 데이터에 적어도 일부 기초하여, 상기 하우징의 위치 를 결정하고, 상기 오리엔테이션 및 위치에 적어도 일부 기반하여, 상기 무인 비행 장치가 머무르게 될 대기 공 간을 결정하고, 상기 무선 통신 회로를 통해 상기 무인 비행 장치에 제어 신호를 전송하는 인스트럭션들 (instructions)을 저장하며, 상기 제어 신호는, 상기 무인 비행 장치가, 상기 결정된 대기 공간 내에서 머무르 거나, 상기 대기 공간 내로 날아가도록 구성될 수 있다. 본 발명의 다양한 실시 예에 따른 무인 비행 장치 운행 제어 방법은 전자 장치의 프로세서가 비행 장치와 통신 채널을 형성하는 동작, 상기 전자 장치의 위치 정보 및 자세 정보를 수집하는 동작, 획득된 상기 전자 장치의 위치 및 자세 정보에 기반하여 상기 전자 장치의 일 지점을 기준으로 지정된 방향(또는 오리엔테이션)에 대해 상기 비행 장치가 운행할 수 있는 공간을 정의한 유효 범위를 산출하는 동작, 상기 전자 장치가 상기 비행 장치 의 위치 정보를 수집하는 동작, 상기 전자 장치가 상기 비행 장치가 상기 유효 범위 내에 있는지 확인하는 동작, 확인 결과에 따라 상기 비행 장치의 운행과 관련한 제어 정보를 상기 비행 장치에 전송하는 동작을 포함 할 수 있다."}
{"patent_id": "10-2016-0170042", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 다양한 실시 예들은 무인 비행 전자 장치를 제한된 범위 내에서 운행시킴으로써 안전한 운행 조작을 가능케하고, 이로 인한 인명 피해 발생 억제 및 무인 비행 전자 장치의 소실 문제 발생 방지 등을 지원할 수 있 다."}
{"patent_id": "10-2016-0170042", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 다양한 실시 예가 첨부된 도면을 참조하여 기재된다. 그러나, 이는 본 발명을 특정한 실시 형 태에 대해 한정하려는 것이 아니며, 본 발명의 실시 예의 다양한 변경(modification), 균등물(equivalent), 및/ 또는 대체물(alternative)을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대 해서는 유사한 참조 부호가 사용될 수 있다. 본 문서에서, \"가진다\", \"가질 수 있다\", \"포함한다\", 또는 \"포함할 수 있다\" 등의 표현은 해당 특징(예: 수치, 기능, 동작, 또는 부품 등의 구성요소)의 존재를 가리키며, 추가적인 특징의 존재를 배제하지 않는다. 본 문서에서, \"A 또는 B\", \"A 또는/및 B 중 적어도 하나\", 또는 \"A 또는/및 B 중 하나 또는 그 이상\" 등의 표현 은 함께 나열된 항목들의 모든 가능한 조합을 포함할 수 있다. 예를 들면, \"A 또는 B\", \"A 및 B 중 적어도 하나\", 또는 \"A 또는 B 중 적어도 하나\"는, 적어도 하나의 A를 포함, 적어도 하나의 B를 포함, 또는 적어도 하나의 A 및 적어도 하나의 B 모두를 포함하는 경우를 모두 지칭할 수 있다. 다양한 실시 예에서 사용된 \"제1\", \"제2\", \"첫째\", 또는 \"둘째\" 등의 표현들은 다양한 구성요소들을, 순서 및/ 또는 중요도에 상관없이 수식할 수 있고, 해당 구성요소들을 한정하지 않는다. 상기 표현들은 한 구성요소를 다 른 구성요소와 구분하기 위해 사용될 수 있다. 예를 들면, 제1 사용자 기기와 제2 사용자 기기는, 순서 또는 중 요도와 무관하게, 서로 다른 사용자 기기를 나타낼 수 있다. 예를 들면, 본 발명의 권리 범위를 벗어나지 않으 면서 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 바꾸어 명명될 수 있다. 어떤 구성요소(예: 제1 구성요소)가 다른 구성요소(예: 제2 구성요소)에 \"(기능적으로 또는 통신적으로) 연결되 어((operatively or communicatively) coupled with/to)\" 있다거나 \"접속되어(connected to)\" 있다고 언급된 때에는, 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로 연결되거나, 다른 구성요소(예: 제3 구성요 소)를 통하여 연결될 수 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소(예: 제1 구성요소)가 다른 구성 요소(예: 제2 구성요소)에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 상기 어떤 구성요 소와 상기 다른 구성요소 사이에 다른 구성요소(예: 제3 구성요소)가 존재하지 않는 것으로 이해될 수 있다. 본 문서에서 사용된 표현 \"~하도록 구성된(또는 설정된)(configured to)\"은 상황에 따라, 예를 들면, \"~에 적합 한(suitable for)\", \"~하는 능력을 가지는(having the capacity to)\", \"~하도록 설계된(designed to)\", \"~하도 록 변경된(adapted to)\", \"~하도록 만들어진(made to)\", 또는 \"~를 할 수 있는(capable of)\"과 바꾸어 사용될 수 있다. 용어 \"~하도록 구성(또는 설정)된\"은 하드웨어적으로 \"특별히 설계된(specifically designed to)\"것만 을 반드시 의미하지 않을 수 있다. 대신, 어떤 상황에서는, \"~하도록 구성된 장치\"라는 표현은, 그 장치가 다른 장치 또는 부품들과 함께 \"~할 수 있는\" 것을 의미할 수 있다. 예를 들면, 문구 \"A, B, 및 C를 수행하도록 구성 (또는 설정)된 프로세서\"는 해당 동작을 수행하기 위한 전용 프로세서(예: 임베디드 프로세서), 또는 메모리 장 치에 저장된 하나 이상의 소프트웨어 프로그램들을 실행함으로써, 해당 동작들을 수행할 수 있는 범용 프로세서(generic-purpose processor)(예: CPU 또는 application processor)를 의미할 수 있다. 본 문서에서 사용된 용어들은 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 다른 실시 예의 범위를 한 정하려는 의도가 아닐 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명의 기술 분야에서 통 상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가질 수 있다. 일반적으로 사용되는 사전 에 정의된 용어들은 관련 기술의 문맥 상 가지는 의미와 동일 또는 유사한 의미를 가지는 것으로 해석될 수 있 으며, 본 문서에서 명백하게 정의되지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 경우 에 따라서, 본 문서에서 정의된 용어일지라도 본 발명의 실시 예들을 배제하도록 해석될 수 없다. 본 발명의 다양한 실시 예들에 따른 전자 장치는, 예를 들면, 전자 장치는 스마트폰(smartphone), 태블릿 PC(tablet personal computer), 이동 전화기(mobile phone), 화상 전화기, 전자북 리더기(e-book reader), 데 스크탑 PC (desktop PC), 랩탑 PC(laptop PC), 넷북 컴퓨터(netbook computer), 워크스테이션(workstation), 서버, PDA(personal digital assistant), PMP(portable multimedia player), MP3 플레이어, 모바일 의료기기, 카메라 모듈, 또는 웨어러블 전자 장치(wearable device)(예: 스마트 안경, 머리 착용형 장치(head-mounted- device(HMD)), 전자 의복, 전자 팔찌, 전자 목걸이, 전자 앱세서리(appcessory), 전자 문신, 스마트 미러, 또는 스마트 와치(smart watch))중 적어도 하나를 포함할 수 있다. 어떤 실시 예들에서, 전자 장치는 스마트 가전 제품(smart home appliance)일 수 있다. 스마트 가전 제품은, 예 를 들면, 텔레비전, DVD 플레이어, 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스(set-top box), 홈 오토매이션 컨트롤 패널(home automation control panel), 보안 컨트롤 패널 (security control panel), TV 박스(예: 삼성 HomeSync™, 애플TV™, 또는 구글 TV™), 게임 콘솔(예: Xbox™, PlayStation™), 전자 사전, 전자 키, 캠코더, 또는 전자 액자 중 적어도 하나를 포함할 수 있다. 다른 실시 예에서, 전자 장치는, 각종 의료기기(예: 각종 휴대용 의료측정기기(혈당 측정기, 심박 측정기, 혈압 측정기, 또는 체온 측정기 등), MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 또는 초음파기 등), 네비게이션(navigation) 장치, GPS 수신기(global positioning system receiver), EDR(event data recorder), FDR(flight data recorder), 자동차 인포테인먼트 (infotainment) 장치, 선박용 전자 장비(예: 선박용 항법 장치, 자이로콤파스 등), 항공 전자기기(avionics), 보안 기기, 차량용 헤드 유닛(head unit), 산업용 또는 가정용 로봇, 금융 기관의 ATM(automatic teller's machine), 상점의 POS(point of sales), 또는 사물 인터넷 장치(internet of things)(예: 전구, 각종 센서, 전 기 또는 가스 미터기, 스프링클러 장치, 화재경보기, 온도조절기(thermostat), 가로등, 토스터(toaster), 운동 기구, 온수탱크, 히터, 보일러 등) 중 적어도 하나를 포함할 수 있다. 어떤 실시 예에 따르면, 전자 장치는 가구(furniture) 또는 건물/구조물의 일부, 전자 보드(electronic board), 전자 사인 수신 장치(electronic signature receiving device), 프로젝터(projector), 또는 각종 계측 기기(예: 수도, 전기, 가스, 또는 전파 계측 기기 등) 중 적어도 하나를 포함할 수 있다. 다양한 실시 예에서, 전자 장치는 전술한 다양한 장치들 중 하나 또는 그 이상의 조합일 수 있다. 어떤 실시 예에 따른 전자 장치는 플렉서블 전자 장치일 수 있다. 또한, 본 발명의 실시 예에 따른 전자 장치는 전술한 기기들에 한정되지 않으며, 기술 발전에 따른 새로운 전자 장치를 포함할 수 있다. 이하, 첨부 도면을 참조하여, 다양한 실시 예에 따른 전자 장치가 설명된다. 본 문서에서, 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치 (예: 인공지능 전자 장치)를 지칭할 수 있다. 도 1은 본 발명의 실시 예에 따른 무선 비행 장치 운행 환경의 한 예를 나타낸 도면이다. 도 1을 참조하면, 본 발명의 무선 비행 장치 운행 환경은 전자 장치(또는 제어 장치) 및 비행 장치 (또는 무인 비행 장치)를 포함할 수 있다. 다양한 실시 예에 따르면, 상기 무선 비행 전자 장치 운행 환경에서, 전자 장치를 기준으로 비행 장치 가 운전할 수 있는 유효 범위(또는 가상 펜스, 또는 안전 운행 유효 범위)가 설정되고, 상기 비행 장 치는 상기 유효 범위 내에서 동작할 수 있다. 본 발명의 운행 환경은 비행 장치의 운행 범위를 전자 장치 기준으로 제한함으로써, 전자 장치 움직임을 통해 간단한 비행 장치의 위치 결정을 수행하고, 비행 장치의 움직임 제어를 전자 장치 조작을 통해 수행할 수 있도록 지원할 수 있다. 이 에 따라, 인명 피해가 발생할 상황 또는 사용자가 희망하지 않는 지역으로 무인 비행 장치가 이동하는 상황 등 이 발생하는 시점에, 무인 비행 장치의 이동을 제한하거나, 사용자는 전자 장치의 자세를 틀어서 비행 장치의 이동을 변경하거나 이동을 제한할 수 있다. 다양한 실시 예에 따르면, 상기 비행 장치는 무인으로 운행되는 비행 전자 장치를 포함할 수 있다. 상기 비행 장치는 적어도 하나의 프로펠러를 포함할 수 있다. 상기 비행 장치는 상기 프로펠러의 동작에 따라 지상으로부터 일정 거리 이내에서 이동될 수 있다. 상기 비행 장치는 카메라 등의 장치를 더 포함할 수 있다. 상기 비행 장치는 상기 카메라를 이용하여 전자 장치 제어에 대응하여 영상을 촬영할 수 있 다. 상기 비행 장치는 촬영된 영상을 외부 장치(예: 전자 장치 또는 별도로 지정된 서버나 외부 전자 장치)에 전송할 수 있다. 본 발명의 다양한 실시 예에 따르면, 비행 장치는 전자 장치의 위치 및 자세에 대응하여 일정 유효 범위 내에서만 운행될 수 있다. 한 실시 예에 따르면, 상기 비행 장치는 전자 장치의 일정 지점이 향 하고 있는 방향 및 전자 장치가 위치한 지점을 기준으로 지정된 각도 범위 내에서 운행될 수 있다. 비행 장치는 전자 장치로부터 수신된 제어 정보(또는 운행 제어 정보)를 토대로 운행하는 중에 유효 범위 를 벗어나는 입력이 수신되면, 해당 유효 범위의 경계에서 호버링 상태를 유지할 수도 있다. 상기 비행 장치 는 안전 운행 기능 및 수동 운행 기능을 지원할 수 있다. 예를 들어, 안전 운행 기능이 선택되면, 상기 비 행 장치는 전자 장치를 기준으로 지정된 유효 범위 내에서 운행될 수 있다. 수동 운행 기능이 선택되 면, 상기 비행 장치는 전자 장치가 제공하는 제어 정보에 따라 유효 범위의 한계 없이 운행될 수 있 다. 다양한 실시 예에 따르면, 비행 장치는 전자 장치로부터 전자 장치의 위치 정보 및 자세 정보 를 수신할 수 있다. 비행 장치는 수신된 전자 장치의 위치 정보 및 자세 정보를 기반으로 유효 범위 를 산출할 수 있다. 비행 장치는 산출된 유효 범위 내에 있도록 운행할 수 있다. 다양한 실시 예에 따르면, 상기 전자 장치는 비행 장치와 통신 채널을 형성하고, 비행 장치에 제어 정보를 제공할 수 있다. 상기 제어 정보는 상기 비행 장치의 이동 방향, 이동 고도, 이동 속도, 운전 타입(예: 전자 장치를 조작하는 사용자를 촬영하는 셀피 타입, 또는 지정된 객체를 추적하며 촬영하는 추 적 타입) 등의 조절을 요청하는 정보를 포함할 수 있다. 상기 제어 정보는 전자 장치에 포함된 입력 장치 를 기반으로 입력된 사용자 입력에 따라 생성될 수 있다. 본 발명의 다양한 실시 예에 따르면, 상기 전자 장치는 위치 정보 및 자세 정보를 기반으로 비행 장치 가 운행될 유효 범위를 산출할 수 있다. 상기 전자 장치는 산출된 유효 범위 정보를 비행 장치 에 제공할 수 있다. 한 실시 예에 따르면, 전자 장치가 제1 방향(예: 정면 방향)으로 놓이면서 비행 장치 를 제어하고 있는 경우 제1 방향을 기준으로 좌우 설정된 반경 범위(예: 시야 범위)내로 유효 범위(또는 비행 구역)이 설정 될 수 있다. 다양한 실시 예에 따르면, 비행 장치를 제어 중, 전자 장치의 축이 이동(또는 자세가 변경)되어 지향 방향이 변경될 경우 전자 장치는 움직임의 양(예: 각도)을 감지하여 새 로운 지향 방향을 기준으로 다시 유효 범위를 설정할 수 있다. 본 발명의 무선 비행 장치 운행 환경에서는 전자 장치를 파지하고 있는 조종자의 지향 방향을 기준으로 새로 갱신된 유효 범위 내에서 비행 장치가 운 행됨으로써 조종자의 시선 범위 내에서 안전하게 운행될 수 있다. 도 2는 본 발명의 실시 예에 따른 전자 장치의 한 예를 나타낸 도면이다. 도 2를 참조하면, 본 발명의 전자 장치는 하우징을 포함하고, 상기 하우징 내측에 적어도 일부가 배치되는 입력 장치, 프로세서, 제1 메모리, 제1 센서, 디스플레이 및 제1 통신 회로를 포함할 수 있다. 다양한 실시 예에 따르면, 상기 입력 장치는 전자 장치의 사용자 입력에 따른 입력 신호를 생성할 수 있다. 상기 입력 장치는 예컨대, 스틱형 장치, 버튼형 장치, 또는 터치 패드형 장치 중 적어도 하나를 포 함할 수 있다. 상기 입력 장치는 터치스크린 디스플레이 패널의 형태로 제공되고, 비행 장치 제어와 관련한 적어도 하나의 가상 객체로 구현될 수 있다. 한 실시 예에 따르면, 상기 입력 장치는 안전 운행 기 능 또는 수동 운행 기능 선택과 관련한 사용자 입력 신호, 비행 장치의 운행과 관련한 사용자 입력 신호 (예: 상하측, 좌우측, 전후방, 대각선 방향 중 적어도 하나의 방향으로의 이동에 관한 신호), 또는 비행 장치 의 이동 속도 조절과 관련한 사용자 입력 신호 등을 사용자 입력에 대응하여 프로세서에 전달할 수 있다. 다양한 실시 예에 따르면, 상기 입력 장치는 특정 운행 타입(예: 셀피 타입, 추적 타입 등)을 선택 하는 입력 신호 등을 사용자 입력에 대응하여 프로세서에 전달할 수 있다. 다양한 실시 예에 따르면, 상기 전자 장치는 마이크 또는 스피커 등을 포함할 수 있다. 상기 마이크는 상기 입력 장치에 포함될 수있다. 마이크를 포함하는 입력 장치는 사용자 음성 입력을 획득하고, 획득된 음성 입력에 대한 음성 인식을 기 반으로, 입력 처리를 수행할 수 있다. 다양한 실시 예에 따르면, 상기 제1 메모리는 전자 장치 운용과 관련한 적어도 하나의 어플리케이션 또는 데이터를 저장할 수 있다. 한 실시 예에 따르면, 상기 제1 메모리는 상기 비행 장치 운행과 관 련한 운행 어플리케이션 프로그램을 저장할 수 있다. 상기 운행 어플리케이션 프로그램은 비행 장치와 통 신 채널(예: 블루투스 통신 채널 등)을 형성하는 명령어 셋(또는 명령어 그룹, 루틴 등), 사용자 입력에 대응하 여 안전 운행 기능 또는 수동 운행 기능을 활성화하는 명령어 셋, 안전 운행 기능 상태에서 자신의 위치 정보 및 자세 정보를 수집하는 명령어 셋, 수집된 위치 정보 및 자세 정보를 기반으로 유효 범위를 설정하는 명령어 셋, 또는 상기 유효 범위를 비행 장치에 전송하는 명령어 셋을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 어플리케이션 프로그램은 상기 위치 정보 및 자세 정보를 비행 장치에 전송하는 명령어 셋을 포함할 수 있다. 상기 어플리케이션 프로그램은 사용자 입력에 대응하여 비행 장치를 일정 방향으로 이동시키는 제어 정보를 비행 장치에 전송하는 명령어 셋을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 제1 센서는 전자 장치의 위치 정보 및 자세 정보를 수집하기 위한 적 어도 하나의 센서를 포함할 수 있다. 예컨대, 상기 제1 센서는 전자 장치의 위치 정보 수집과 관련한 위치 정보 수집 센서(예: GPS)를 포함할 수 있다. 상기 제1 센서는 전자 장치의 자세 정보를 수집하 는 자세 정보 수집 센서(예: 가속도 센서, 지자기 센서, 자이로 센서 등)를 포함할 수 있다. 상기 제1 센서 는 프로세서 제어에 대응하여 위치 정보 및 자세 정보를 수집하고, 이를 프로세서에 제공할 수 있다. 다양한 실시 예에 따르면, 상기 디스플레이는 전자 장치 운용과 관련한 적어도 하나의 화면을 출력할 수 있다. 한 실시 예에 따르면, 상기 디스플레이는 비행 장치 이동 제어와 관련한 가상 조작 객체를 출력할 수 있다. 상기 가상 조작 객체는 비행 장치의 좌우, 상하, 전후, 대각 방향 중 적어도 하나의 방향 으로의 이동을 지시하는 객체, 비행 장치의 이동 속도를 조절하는 객체, 비행 장치의 고도 조절과 관 련한 객체, 또는 비행 장치의 운행 타입을 결정하는 객체 등을 출력할 수 있다. 상기 디스플레이는 비행 장치의 안전 운행 기능 또는 수동 운행 기능 중 어느 하나를 선택할 수 있는 메뉴 또는 아이콘을 출 력할 수 있다. 한 실시 예에 따르면, 상기 디스플레이는 유효 범위에 대응하는 경계 이미지 또는 경계선 등을 출력할 수 있다. 상기 디스플레이는 전자 장치에 배치된 카메라가 촬영하는 영상을 출력할 수 있다. 상기 디스플레이는 비행 장치에 배치된 카메라가 촬영하는 영상을 출력할 수 있다. 다양한 실시 예에 따르면, 상기 제1 통신 회로는 전자 장치의 통신 기능을 지원할 수 있다. 한 실시 예에 따르면, 상기 제1 통신 회로는 비행 장치와 통신 채널을 형성할 수 있다. 제1 통신 회로는 근거리 통신 채널을 형성할 수 있는 회로를 포함할 수 있다. 상기 제1 통신 회로는 사용자 제어에 대응하 여, 안전 운행 기능 설정 또는 수동 운행 기능 설정과 관련한 제어 정보, 비행 장치의 이동 방향 또는 속 도 조절과 관련한 제어 정보, 또는 비행 장치의 운행 타입과 관련한 제어 정보 중 적어도 하나의 제어 정 보를 비행 장치에 전송할 수 있다. 본 발명의 실시 예에 따르면, 제1 통신 회로는 전자 장치의 현재 위치 정보 및 자세 정보를 비행 장치에 전송하거나, 또는 전자 장치의 현재 위치 정보 및 자세 정보를 바탕으로 산출된 유효 범위를 비행 장치에 전송할 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 상기 전자 장치의 제어와 관련한 신호의 처리 또는 전달 을 처리할 수 있다. 한 실시 예에 따르면, 상기 프로세서는 사용자 입력에 대응하여 전자 장치와 비 행 장치 간의 통신 채널 형성을 제어할 수 있다. 상기 프로세서는 사용자 입력에 대응하여 또는 설정 된 기능에 대응하여 안전 운행 기능 또는 수동 운행 기능 설정과 관련한 제어 신호를 비행 장치에 전송할 수 있다. 상기 프로세서는 전자 장치의 위치 정보 및 자세 정보를 기반으로 유효 범위를 산출할 수 있다. 상기 프로세서는 산출된 유효 범위를 비행 장치에 전달할 수 있다. 상기 프로세서는 비행 장치가 유효 범위 내에서 운행되도록 제어할 수 있다. 이와 관련하여, 상기 프로세서는 도 3에 도시 된 바와 같은 구성을 포함할 수 있다. 도 3은 본 발명의 실시 예에 따른 프로세서의 한 예를 나타낸 도면이다. 도 3을 참조하면, 본 발명의 실시 예에 따른 프로세서는 제1 센서 정보 수집 모듈, 유효 범위 조절 모듈, 또는 비행 장치 제어 모듈을 포함할 수 있다. 상기 제1 센서 정보 수집 모듈, 유효 범위 조절 모듈, 비행 장치 제어 모듈 중 적어도 하나는 상기 프로세서의 적어도 일부를 포함할 수 있다. 다양한 실시 예에 따르면, 상기 제1 센서 정보 수집 모듈, 유효 범위 조절 모듈, 비행 장치 제어 모듈 중 적어도 하나는 독립된 프로세서로 마련되고, 상기 프로세서과 통신하여 비행 장치 제어와 관련한 신호 처리를 수행할 수 있다. 다양한 실시 예에 따르면, 상기 제1 센서 정보 수집 모듈은 사용자 입력에 대응하여 위치 정보 수집 및 자 세 정보 수집을 처리할 수 있다. 예컨대, 상기 제1 센서 정보 수집 모듈은 비행 장치 운행과 관련하 여 비행 장치와 통신 채널이 형성되면, 전자 장치의 현재 위치 정보 및 자세 정보를 수집할 수 있다. 상기 제1 센서 정보 수집 모듈은 위치 정보 수집 센서(예: GPS) 및 가속도 센서(또는 지자기 센서나 자이 로 센서)를 활성화할 수 있다. 상기 제1 센서 정보 수집 모듈은 수집된 위치 정보 및 자세 정보를 유효 범 위 조절 모듈에 전달할 수 있다. 다양한 실시 예에 따르면, 상기 유효 범위 조절 모듈은 제1 센서 정보 수집 모듈로부터 위치 정보 및 자세 정보를 수신하면, 이를 기반으로 유효 범위를 산출할 수 있다. 상기 유효 범위 조절 모듈은 유효 범 위 산출과 관련한 사용자 설정을 확인할 수 있다. 예컨대, 전자 장치의 특정 방향(예: 사용자가 전자 장치 를 파지하고 있는 상태에서 전방)을 기준으로 지정된 각도 설정(예: 전방 기준 좌우 60도, 90도, 120도 등)이 있는지 확인할 수 있다. 별도의 사용자 설정이 없는 경우, 디폴트로 설정(예: 90도)을 유효 범위 산출에 이용할 수 있다. 다양한 실시 예에 따르면, 상기 유효 범위 조절 모듈은 유효 범위의 형태(예: 원뿔, 삼각 뿔, 사각기둥 등) 중 어느 하나의 설정이 있는지 확인할 수 있다. 별도의 설정이 없는 경우, 디폴트 설정(예: 원뿔 또는 삼각뿔 등)을 유효 범위 산출에 적용할 수 있다. 다양한 실시예에 따르면 유효 범위는 제어장치의 위 치 정보를 기반으로 상하 또는 좌우 영역에 대한 각각 독립적인 기준으로 형성될 수 있다. 예를 들어 상하 방향 은 지정된 높이 영역에 대한 범위가 될수 있으며, 좌우 방향은 설정된 각도에 따른 직선 또는 곡선 형태의 범위 로 설정될 수 있다. 상기 유효 범위 조절 모듈은 전자 장치로부터 멀어질 수 있는 비행 장치의 최대 이격 거리 설정 이 있는지 확인할 수 있다. 다양한 실시 예에 따르면, 상기 유효 범위 조절 모듈은 한계 범위 설정이 있는 지 확인할 수 있다. 상기 한계 범위는 예컨대, 비행 장치와의 통신 해제로 인하여 비행 장치 소실이 발생할 수 있는 상측으로 지정된 거리 이상 이동 불가 또는 사람과의 충돌 또는 지면과의 충돌 등이 일어날 수 있는 지면으로부터 일정 거리 이상 높이 이하로 운행 불가 등과 관련한 한계 범위를 포함할 수 있다. 다양한 실시 예에 따르면, 사용자는 상기 사용자 인터페이스를 통하여 유효 범위 관련 다양한 설정들을 입력할 수 있다. 예컨대, 상기 유효 범위 조절 모듈은 각도 설정, 유효 범위 형태 설정, 최대 이격 거리 설정, 또 는 상하측 중 적어도 한 방향으로의 이동 한계 범위 설정 중 적어도 하나의 설정 조작과 관련한 사용자 인터페 이스(예: 각도 설정 화면)을 디스플레이에 출력할 수 있다. 상기 유효 범위 조절 모듈은 산출된 유효 범위를 비행 장치에 실시간 전송할 수 있다. 다양한 실시 예에 따르면, 유효 범위 산출은 비행 장치(20 0)에서 수행될 수도 있다. 이 경우, 상술한 유효 범위 조절 모듈은 비행 장치의 비행 장치 프로세서 에 의해 동작하는 모듈이 될 수 있다. 다양한 실시 예에 따르면, 상기 비행 장치 제어 모듈은 사용자 입력에 대응하여 또는 설정된 스케줄 정보 에 대응하여 비행 장치와 통신 채널을 형성할 수 있다. 비행 장치 제어 모듈은 제1 통신 회로를 사용자 입력에 대응하여 활성화하고, 비행 장치의 시동, 초기 호버링 상태(예: 지면으로부터 일정 높이 떠 오른 상태에서 고정 상태) 등을 제어할 수 있다. 상기 비행 장치 제어 모듈은 사용자 입력에 대응하여 비 행 장치 운행과 관련한 제어 정보를 생성하고, 생성된 제어 정보를 비행 장치에 전송할 수 있다. 상 기 비행 장치 운행과 관련한 제어 정보는 예컨대, 비행 장치의 이동 방향 정보, 이동 속도 정보, 운 행 타입 정보, 또는 카메라 제어 등에 관한 정보를 포함할 수 있다. 도 4는 본 발명의 실시 예에 따른 비행 장치의 한 예를 나타낸 도면이다. 도 4를 참조하면, 본 발명의 실시 예에 따른 비행 장치는 하우징을 포함하고, 하우징의 내외측에 배치되는 비행 장치 프로세서, 제2 제1 메모리, 제2 센서, 제2 통신 회로 및 운동 모듈을 포 함할 수 있다. 다양한 실시 예에 따르면, 상기 제2 제1 메모리는 비행 장치 운행과 관련한 적어도 하나의 프로그램 또는 어플리케이션 또는 데이터 등을 저장할 수 있다. 한 실시 예에 따르면, 상기 제2 제1 메모리는 전자 장치로부터 수신된 제어 정보에 대응하여 비행 장치를 일정 방향으로 이동 또는 회전 시키는 등의 동 작 제어와 관련한 비행 어플리케이션을 저장할 수 있다. 상기 비행 어플리케이션은 예컨대, 전자 장치가 제공하는 제어 정보 수집과 관련한 명령어 셋, 수집된 제어 정보에서 이동 방향, 이동 속도, 운행 타입 정보를추출하는 명령어 세, 또는 추출된 정보에 따라 비행 장치를 이동시키는 명령어 셋 등을 포함할 수 있다. 상기 비행 어플리케이션은 전자 장치로부터 유효 범위 정보를 수신하고, 이에 따라 비행 장치의 운행 범위를 제안하는 명령어 셋 등을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 제2 센서는 상기 비행 장치의 현재 위치 정보를 수집할 수 있다. 상 기 제2 센서는 비행 장치의 고도 정보를 수집할 수 있다. 상기 제2 센서는 위치 정보 수집 센서 및 고도 센서 등을 포함할 수 있다. 상기 제2 센서는 수집된 위치 정보 및 고도 정보를 비행 장치 프로세 서에 전달할 수 있다. 다양한 실시 예에 따르면, 상기 제2 통신 회로는 전자 장치와 통신 채널을 형성할 수 있다. 한 실시 예에 따르면, 상기 제2 통신 회로는 근거리 통신 채널(예: 블루투스 통신 채널)을 전자 장치와 형성 할 수 있다. 상기 제2 통신 회로는 전자 장치로부터 페어링 요청 신호를 수신하고, 페어링 동작을 통 하여 블루투스 통신 채널을 형성할 수 있다. 상기 제2 통신 회로는 전자 장치로부터 전자 장치 의 위치 정보 및 자세 정보를 수신하거나, 유효 범위 정보를 수신할 수 있다. 상기 제2 통신 회로는 전자 장치로부터 운행 제어와 관련한 제어 정보를 수신할 수 있다. 상기 제2 통신 회로는 수신된 유효 범 위, 또는 제어 정보 등을 비행 장치 프로세서에 전달할 수 있다. 다양한 실시 예에 따르면, 상기 운동 모듈은 제어 정보에 기입된 방향 및 속도에 대응하여 비행 장치(20 0)를 이동시킬 수 있다. 상기 운동 모듈은 프로펠러, 모터 및 동작 제어기를 포함할 수 있 다. 상기 프로펠러는 예컨대, 적어도 1개 이상 배치될 수 있다. 상기 모터는 상기 프로펠러와 연결되고, 동작 제어기 제어에 따라 지정된 속도로 회전할 수 있다. 상기 동작 제어기는 비행 장치 프로세서의 제어에 대응하여 모터 또는 프로펠러를 제어하여 비행 장치를 지정된 방향과 지정된 속도로 이동되도록 제어할 수 있다. 다양한 실시 예에 따르면, 상기 비행 장치 프로세서는 비행 장치의 운행 제어와 관련한 제어 신호의 처리 또는 데이터의 전달과 처리를 수행할 수 있다. 예컨대, 상기 비행 장치 프로세서는 전자 장치로 부터 수신된 제어 정보를 기반으로 비행 장치를 지정된 방향과 속도로 이동시키도록 운동 모듈에 운 동 제어 신호를 전달할 수 있다. 본 발명의 실시 예에 따른 비행 장치 프로세서는 유효 범위 내에서 비행 장치가 운행되도록 제어할 수 있다. 상기 비행 장치 프로세서는 도 5에 도시된 바와 같은 구성을 포 함할 수 있다. 도 5는 본 발명의 실시 예에 따른 비행 장치 프로세서의 한 예를 나타낸 도면이다. 도 5를 참조하면, 본 발명의 비행 장치 프로세서는 제2 센서 정보 수집 모듈, 제어 정보 수집 모듈 및 운전 제어 모듈을 포함할 수 있다. 한 실시 예에 따르면, 상기 제2 센서 정보 수집 모듈, 제어 정보 수집 모듈 및 운전 제어 모듈 중 적어도 하나는 상기 비행 장치 프로세서의 적어도 일부를 포함할 수 있다. 또는, 상기 제2 센서 정보 수집 모듈, 제어 정보 수집 모듈 및 운전 제어 모 듈는 각각 하드웨어 프로세서로 마련되고, 상기 비행 장치 프로세서와 통신할 수 있다. 다양한 실시 예에 따르면, 상기 제2 센서 정보 수집 모듈은 상기 비행 장치의 위치 정보를 수집할 수 있다. 예를 들어, 상기 제2 센서 정보 수집 모듈은 GPS를 활성화하고, 비행 장치의 현재 위치 정보를 수집할 수 있다. 상기 제2 센서 정보 수집 모듈은 고도 센서를 활성화하고, 이를 기반으로 비행 장치(20 0)의 고도 정보를 수집할 수 있다. 상기 제2 센서 정보 수집 모듈은 수집된 위치 정보 및 고도 정보를 운 전 제어 모듈에 전달할 수 있다. 다양한 실시 예에 따르면, 제2 센서 정보 수집 모듈은 설정에 따라, 수집된 비행 장치의 위치 정보 및 고도 정보를 전자 장치에 제공할 수도 있다. 전자 장치에 전달된 비행 장치의 위치 정보 및 고도 정보는 유효 범위 내에서의 비행 장치의 위치 등을 시각 정보나 오디오 정보로서 나타내는데 이용될 수 있다. 다양한 실시 예에 따르면, 상기 제어 정보 수집 모듈은 전자 장치와 통신 채널을 형성하고, 전자 장 치로부터 제어 정보를 수집할 수 있다. 상기 제어 정보 수집 모듈은 수집된 제어 정보에서 비행 장치 운행과 관련한 정보를 추출하고, 추출된 정보를 운전 제어 모듈에 전달할 수 있다. 상기 제어 정보 수집 모듈은 전자 장치로부터 유효 범위 정보를 수신하고, 이를 운전 제어 모듈에 전달할 수 있 다. 상기 제어 정보 수집 모듈은 전자 장치로부터 전자 장치의 위치 정보 및 자세 정보를 수신 하고 이를 운전 제어 모듈에 전달할 수도 있다.다양한 실시 예에 따르면, 상기 운전 제어 모듈은 비행 장치의 운행과 관련한 기능 설정을 확인할 수 있다. 예컨대, 운전 제어 모듈은 전자 장치로부터 수신된 정보 중, 비행 장치의 안전 운행 기능 설정 값 또는 수동 운행 기능 설정 값을 확인할 수 있다. 상기 운전 제어 모듈은 안전 운행 기능이 설정된 경우, 유효 범위를 확인할 수 있다. 운전 제어 모듈은 전자 장치가 전달한 제어 정보를 기반으로 비 행 장치를 이동시키도록 제어할 수 있다. 예를 들어, 운전 제어 모듈은 비행 장치가 이동한 이 동 위치 또는 이동 고도가 상기 유효 범위를 벗어나는지 확인하고, 비행 장치가 유효 범위를 벗어나는 경 우, 유효 범위를 벗어나지 않도록 제어할 수 있다. 다양한 실시 예에 따르면,, 상기 운전 제어 모듈은 전자 장치로부터 위치 정보 및 자세 정보를 수신 한 경우, 제2 제1 메모리에 사전 저장된 유효 범위 설정 값(예: 각도 설정, 유효 범위 형태 설정, 최대 이 격 거리 설정, 상하측 중 적어도 한 방향으로의 이동 한계 범위 설정)을 확인하고, 이를 기반으로, 유효 범위를 산출할 수 있다. 상기 운전 제어 모듈은 유효 범위 내에서 비행 장치가 어디에 위치하는지에 대한 상 대적 거리 정보 등을 전자 장치에 제공할 수 있다. 도 6은 본 발명의 실시 예에 따른 무인 비행 장치 운행 환경에서의 장치 간 신호 흐름의 한 예를 나타낸 도면이 다. 도 6을 참조하면, 무인 비행 장치 운행과 관련하여, 동작 601에서, 전자 장치는 위치 정보를 수집할 수 있 다. 예컨대, 전자 장치는 GPS 등을 이용하여 자신의 위치 정보를 획득할 수 있다. 동작 603에서, 전자 장 치는 자세 정보를 획득할 수 있다. 예컨대, 전자 장치는 가속도 센서 또는 지자기 센서 등을 이용하 여 전자 장치의 특정 부분이 지향하는 방향각을 수집할 수 있다. 한 실시 예에 따르면, 상기 전자 장치 는 사용자가 파지한 상태에서 전방 측면이 향하는 방향각(예: 좌우 방위각 및 상하 고도 각도)을 획득할 수 있다. 다양한 실시 예에 따르면, 상기 전자 장치는 지정된 크기 이상의 움직임에 대응하여 유효 범위를 조정할 수 있다. 또는 상기 전자 장치는 일정 크기 이하(예: 손떨림 등에 대응하는 움직임)의 움직임을 무 시하고, 유효 범위를 변경하지 않도록 제어할 수 있다. 동작 605에서, 전자 장치는 유효 범위를 생성할 수 있다. 예컨대, 전자 장치는 제1 제1 메모리 에 저장된 사용자 설정 또는 정책 정보를 확인하고, 수집된 위치 정보와 자세 정보를 기반으로 유효 범위를 생 성할 수 있다. 상기 사용자 설정 또는 정책 정보 등은 전자 장치의 특정 지점이 향하는 방향을 기준으로 상하좌우 일정 각도, 또는 유효 범위의 형태 등을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 유효 범위는 전자 장치의 특정 지점을 기준 정북방향 기준 좌우-+30도가 될 수 있다. 한 실시 예에 따르면, 유효 범위는 전자 장치의 지향 방향 기준으로 좌우 90도 설정 될 수 있 으며, 보다 넓은 범위에서 비행을 원하는 사용자 입력에 대응하여 그 이상의 값이 설정될 수 있다. 유효 범위는 위치 정보 분석에 따라 해당 위치(예: 장애물이 많거나 실내 등)의 특성에 따라, 사용자가 선택할 수 있는 설정 폭이 달라질 수 있다. 동작 607에서, 전자 장치는 유효 범위를 비행 장치에 제공할 수 있다. 상기 전 자 장치는 비행 장치 간에 형성된 통신 채널을 기반으로 상기 유효 범위 정보를 비행 장치에 전 송할 수 있다. 동작 609에서, 비행 장치는 비행 장치의 위치 정보를 수집할 수 있다. 위치 정보 수집은 예컨대, 전 자 장치로부터 유효 좌표 범위를 수신한 이후에 수행될 수 있다. 비행 장치는 전자 장치와 통신 채널이 형성되면 일정 주기 또는 실시간으로 비행 장치의 위치 정보를 수집할 수 있다. 다양한 실시 예에 따르 면, 상기 비행 장치는 고도 센서를 이용하여 고도 정보를 수집할 수 있다. 동작 611에서, 비행 장치는 현재 자신의 위치가 유효 범위 이내인지 확인할 수 있다. 예컨대, 비행 장치 는 전자 장치를 기준으로 설정된 유효 범위 내에 자신의 위치 정보가 포함되는지 확인할 수 있다. 비 행 장치는 자신의 위치 정보가 전자 장치의 특정 지점 기준으로 유효 범위 중 좌우 유효 범위 내에 있는지 확인할 수 있다. 비행 장치는 자신의 고도 정보가, 전자 장치의 특정 지점 기준으로 유효 범 위 중 상하 유효 범위 내에 있는지 확인할 수 있다. 상기 비행 장치는 전자 장치와의 거리 값을 산출 하고, 전자 장치로부터 지정된 거리 이내에 있는지 확인할 수도 있다. 동작 611에서, 상기 비행 장치의 위치가 유효 범위 이내인 경우, 동작 613에서, 비행 장치는 정상 운 행을 수행할 수 있다. 전자 장치는 사용자 조작에 따른 제어 정보를 비행 장치에 제공하고, 비행 장 치는 수신된 제어 정보에 대응하여 운동할 수 있다. 비행 장치는 제어 정보에 따라, 위치가 변경되면, 현재 위치 정보를 수집하고, 유효 범위 이내인지 비교할 수 있다. 비행 장치는 현재 이동된 위치 정보가 유효 범위를 벗어난 경우 유효 범위 이내로 복귀하도록 동작할 수 있다. 동작 611에서, 상기 비행 장치의 위치가 유효 범위 이내가 아닌 경우, 동작 615에서, 비행 장치는 예 외 처리를 수행할 수 있다. 예컨대, 비행 장치는 전자 장치로부터 사용자 조작에 따른 운행 제어 정 보를 수신하더라도 유효 범위 이내로 이동하기 위한 운동을 선행적으로 처리할 수 있다. 예컨대, 현재 상기 비 행 장치의 위치에서 유효 범위 이내로 진입할 수 있는 가장 가까운 방향으로 이동할 수 있다. 이 동작에서, 비행 장치는 실시간으로 자신의 위치 정보를 수집하고, 현재 위치와 유효 범위 이내의 위치를 비교할 수 있다. 도 7은 본 발명의 실시 예에 따른 유효 범위의 한 예를 나타낸 도면이다. 도 7을 참조하면, 전자 장치의 제1 지점(예: 디스플레이가 상측으로 향한 상태에서 전자 장치의 전방 측면이 전방을 향하고 있는 상태에서, 유효 범위 도시된 바와 같이 사각뿔 형상으로 마련될 수 있다. 예컨 대, 유효 범위는 전자 장치의 제1 지점을 기준으로 상측 일정 각도에 배치된 제1 가상 펜스, 전 자 장치의 제1 지점을 기준으로 하측 일정 각도에 배치된 제2 가상 펜스, 전자 장치의 제1 지점 을 기준으로 좌측 일정 각도에 배치된 제3 가상 펜스, 또는 전자 장치의 제1 지점을 기준으로 우측 일정 각도에 배치된 제4 가상 펜스를 포함할 수 있다. 상기 제1 가상 펜스 및 제2 가상 펜스는 상하측 각도 조정에 대응하여 전자 장치의 지정된 지점을 기준으로 각도가 조정(예: 이전 상태보다 각도가 커지거나 또는 작아짐)될 수 있다. 상기 제3 가상 펜스 및 제4 가상 펜스는 좌우측 각도 조정에 대응 하여 전자 장치의 지정된 지점을 기준으로 각도가 조정(예: 이전 상태보다 각도가 커지거나 또는 작아짐) 될 수 있다. 전자 장치는 좌우 각도 조정 및 상하 각도 조정을 수행할 수 있는 사용자 인터페이스를 제공 할 수 있다. 다양한 실시 예에 따르면, 상기 제1 가상 펜스 및 제2 가상 펜스는 전자 장치의 지정된 지점을 기준으로 상하 대칭되게 배치될 수 있다. 상기 제3 가상 펜스 및 제4 가상 펜스는 전자 장치의 지정된 지점을 기준으로 좌우 대칭되게 배치될 수 있다. 다양한 실시 예에 따르면, 상기 제1 가상 펜스 및 제2 가상 펜스는 전자 장치의 지정된 지점 기준으로 비대칭될 수도 있다. 예컨대, 전자 장치의 지정된 지점에서의 수평면을 기준으로 수평면과 제1 가상 펜스 사이의 각도가 수평면과 제2 가상 펜스 사이의 각도보다 크게 설정될 수 있다. 다양한 실시 예에 따르면, 상기 제2 가상 펜스는 전자 장치 의 지정된 지점에 수평 각도를 이루도록 배치될 수 있다. 또는, 제2 가상 펜스는 사람과의 충돌을 방 지하기 위하여 지면으로부터 일정 높이(예: 2m)에 해당하는 수평면을 포함할 수 있다. 제3 가상 펜스 및 제4 가상 펜스는 전자 장치의 지정된 지점에서의 수직면을 기준으로 제3 가상 펜스와 수직면 사 이의 각도가 제4 가상 펜스와 수직면 사이의 각도와 동일하게 설정되거나 또는 서로 다른 값으로 설정될 수 있다. 다양한 실시 예에 따르면, 상기 전자 장치는 카메라를 포함할 수 있다. 전자 장치는 카메라가 촬영하 는 영상을 기준으로 유효 범위를 제공할 수 있다. 예컨대, 카메라가 촬영한 4개의 변을 가지는 사각뿔 범 위가 유효 범위로서 제공될 수 있다. 상기 전자 장치는 카메라가 획득하는 프리뷰 영상을 기반으로 상술한 제1 내지 제4 가상 펜스들(301, 302, 303, 304)을 제공할 수 있다. 상기 전자 장치는 각각의 펜스 들의 각도 조정과 관련한 화면 인터페이스를 제공할 수 있다. 사용자는 각각의 변에 해당하는 각도를 조정함으 로써, 유효 범위에 포함된 각 펜스들과 지정된 기준(예: 일정 지점에서의 수평면과 수직면) 사이의 각도를 조정할 수 있다. 상기 전자 장치는 프리뷰 영상을 제공하되, 각도 조정에 대응하여 표시되는 부분을 조정 하여 사용자가 조정한 각도에 따라 실제 비행 장치가 움직이게 될 유효 범위가 얼마나 되는지 보여줄 수 있다. 한 실시 에에 따르면, 전자 장치는 현재 촬영된 프리뷰 영상의 중심점에서의 수평선과 수직선을 기준으로, 제1 가상 펜스와 관련한 각도가 줄어들면, 제1 가상 펜스의 경계선을 줄어드는 각도에 대응하여 하향 조정하고, 하양 조정된 제1 가상 펜스의 경계선에 따라, 유효 범위에 포함되지 않는 영역의 표시 상 태를 변경(예: 암전 처리 또는 불투명 처리 등)할 수 있다. 다양한 실시 예에 따르면, 전자 장치는 프리뷰 영상이 출력된 디스플레이 상에서 발생하는 터치 이벤트(예: 핀치 줌)에 대응하여 유효 범위의 크기를 한 번에 조절할 수 있도록 지원할 수 있다. 설정된 유효 범위가 카메라 촬영 각도보다 작은 상태로 화면에 표시되 면, 사용자는 유효 범위에 대응하는 객체를 터치 드래그하여 위치 조정을 수행할 수도 있다. 다양한 실시 예에 따르면, 비행 장치는 전자 장치로부터 제1 거리(L1) 이내로 제한될 수 도 있다. 상기 비행 장치(20 0)와 전자 장치 간의 거리는 사용자 설정에 따라 변경될 수 있다.다양한 실시 예에 따르면, 상기 전자 장치는 유효 범위를 산출한 후, 비행 장치로부터 비행 장 치의 위치 정보 및 고도 정보를 수신할 수 있다. 상기 전자 장치는 산출된 유효 범위 및 비행 장치의 위치 정보와 고도 정보를 이용하여 비행 장치가 유효 범위 내에 있는지 확인할 수 있다. 다양한 실시 예에 따르면, 전자 장치는 비행 장치가 유효 범위의 경계선에 접근(예: 경계선으로 부터 지정된 거리 이내로 비행 장치가 위치)하는 경우, 지정된 방식의 안내 정보(예: 디스플레이의 화면 반전이나, 깜박임, 팝업, 오디오 안내 등)를 출력할 수 있다. 다양한 실시 예에 따르면, 전자 장치는 비행 장치가 유효 범위의 경계선을 기준으로 제1 범위 이내로 진입하는 경우, 비행 장치의 이동 속도 를 지정된 이하로 줄이도록 제어할 수 있다. 전자 장치는 비행 장치가 유효 범위의 경계선(예: 가상의 라인들) 기준으로 제2 범위 이내(예: 상기 제1 범위보다 경계선에 더 가까운 지정된 거리)로 진입하는 경우, 비행 장치의 이동을 중지(예: 호버링)하도록 제어할 수 있다. 상술한 비행 장치와 경계선 간의 거리에 따른 동작 제어는 비행 장치가 전자 장치로부터 수신된 유효 범위 정보를 기반으로 수행 할 수도 있다. 도 8은 본 발명의 실시 예에 따른 유효 범위의 다른 예를 나타낸 도면이다. 도 8을 참조하면, 전자 장치의 지정된 지점을 기준으로, 원뿔 형태의 유효 범위가 설정될 수 있다. 한 실시 예에 따르면, 전자 장치의 상측 측벽(디스플레이가 배치된 면을 전면으로 할 경우, 디스플레이의 상측에서 후면 방향을 넘어가는 사이에 배치된 측벽)의 중심점에서 가상의 수평면을 기준으로, 상하 지정된 각 도를 가지며 수직 단면이 삼각형 형상인 원뿔 형태의 유효 범위가 설정될 수 있다. 상기 전자 장치는 상기 원뿔의 수직 단면에 해당하는 삼각형의 각도를 조정할 수 있는 화면 인터페이스를 제공할 수 있다. 상기 전자 장치는 상기 수평면을 기준으로 상하로 구분되는 직각 삼각형의 각도를 서로 다르게 조정할 수 있는 화면 인터페이스를 제공할 수 있다. 상기 전자 장치와 비행 장치 간의 제2 거리(L2)는 비행 장치 가 전자 장치로부터 이격될 수 있는 최대 이격 거리가 될 수 있다. 상기 제2 거리(L2)는 사용자 입력 에 따라 조정될 수 있다. 상기 제2 거리(L2)는 상기 원뿔의 수직 단면에 해당하는 삼각형의 각도에 따라 조정될 수 있다. 예컨대, 삼각형의 각도가 상대적으로 작은 경우 상기 제2 거리(L2)는 상대적으로 늘어날 수 있고, 삼 각형의 각도가 상대적으로 큰 경우, 상기 제2 거리(L2)는 상대적으로 줄어들 수 있다. 다양한 실시 예에 따르면, 상기 전자 장치는 카메라를 포함하고, 상기 카메라를 이용하여 유효 범위 에 대한 정보를 디스플레이에 표시할 수 있다. 예컨대, 상기 전자 장치는 카메라가 촬영한 프리뷰 영 상을 디스플레이에 표시하고, 비행 장치가 위치할 수 있는 유효 범위를 원으로 표시할 수 있다. 상기 원으로 표시되는 유효 범위는 사용자 입력(예: 핀치 줌)에 대응하여 크기가 조정될 수 있다. 도 9는 본 발명의 실시 예에 따른 유효 범위 변경의 한 예를 나타낸 도면이다. 도 9를 참조하면, 901 상태에서와 같이, 전자 장치의 일 지점이 제1 방향(예: 도시된 도면 기준으로 상측 방향)을 향하고 있는 경우, 설정에 따라 제1 유효 범위(300a)가 설정될 수 있다. 예컨대, 전자 장치의 일 지점의 수직면을 기준으로 좌우 45도씩 또는 40~180도 사이의 임의의 각도에 해당하는 일정 범위가 제1 유효 범 위(300a)로 설정될 수 있다. 상기 전자 장치는 설정된 제1 유효 범위(300a)를 비행 장치에 제공할 수 있다. 상기 비행 장치는 상기 제1 유효 범위(300a) 내에서 운행될 수 있다. 다양한 실시 예에 따르면, 903 상태에서, 전자 장치는 사용자 조작(또는 전자 장치를 파지한 사용자 의 방향 전환)에 의하여 지향 방향이 제2 방향(예: 도시된 도면 기준으로 우측 방향)으로 변경될 수 있다. 전자 장치는 지향 방향이 변경되면, 변경된 제어 정보를 비행 장치에 제공할 수 있다. 상기 비행 장치 는 전자 장치가 제공한 제어 정보를 기반으로 제2 유효 범위(300b)를 확인하고, 제2 유효 범위(300 b)로 이동할 수 있다. 예를 들어, 비행 장치는 제1 유효 범위(300a) 내에서의 위치에 대응하는 제2 유효 범위(300b) 내의 위치로 이동할 수 있다. 예컨대, 비행 장치는 제1 유효 범위(300a)의 중심 일정 영역에 배치된 경우, 제2 유효 범위(300b)의 중심 일정 영역에 배치될 수 있다. 다양한 실시 예에 따르면, 상기 비행 장치는 유효 범위 변경 시, 변경된 유효 범위의 경계 영역(예: 제1 유효 범위(300a)와 제2 유효 범위 (300b)의 경계 영역 기준으로 제2 유효 범위(300b) 내의 경계 부근 영역) 부근으로 이동할 수도 있다. 비행 장 치 이동 설정이 경계 영역으로부터 지정된 거리 이상 이격되도록 설정된 경우, 비행 장치는 제1 유효 범위(300a)의 일정 영역에서 제2 유효 범위(300b)의 경계로부터 지정된 거리만큼 이격된 위치로 이동할 수 있다. 상기 비행 장치는 전자 장치의 방향 변경에 따라, 유효 범위가 갱신되면, 변경된 유효 범위로 이동함으로써, 조종자(또는 사용자)의 시야 내에서 안전한 운행을 수행할 수 있다. 도 10은 본 발명의 실시 예에 따른 유효 범위 변경의 다른 예를 나타낸 도면이다. 도 10을 참조하면, 1001 상태에서와 같이, 비행 장치는 전자 장치의 지정된 지점을 기준으로 제1 유 효 범위(300a) 내에서 운행될 수 있다. 예컨대, 비행 장치는 전자 장치로부터 위치 정보 및 자세 정 보를 수신하여 제1 유효 범위(300a)를 산출하고, 자신의 위치 정보와 비교할 수 있다. 비행 장치는 전자 장치와의 거리를 산출하고, 제1 유효 범위(300a)의 형태에 따라 고도 조정을 수행할 수도 있다. 예컨대, 제1 유효 범위(300a)가 도 8이나 도 9에서 설명한 바와 같이 전자 장치로부터 멀어질수록 유효 고도가 상 하로 커지는 형태이면, 비행 장치는 전자 장치와의 거리에 따라, 유효 고도 내에 배치되도록 이동할 수 있다. 1003 상태에서와 같이, 전자 장치의 일 지점이 향하는 방향이, 사용자 조작 또는 사용자 동작에 따라 일정 각도 회전될 수 있다. 전자 장치의 회전에 따라, 유효 범위가 변경되어 제2 유효 범위(300b)가 설정될 수 있다. 상기 비행 장치는 변경된 제2 유효 범위(300b) 정보 및 자신의 위치 정보를 비교하여, 제2 유효 범 위(300b) 내에 위치하는지 확인할 수 있다. 비행 장치는 도시된 바와 같이, 제2 유효 범위(300b)의 경계 내에 배치된 경우, 현재 상태를 유지할 수 있다. 다양한 실시 예에 따르면, 유효 범위의 경계 영역으로부터 일 정 거리 이격되도록 설정된 경우, 비행 장치는 제2 유효 범위(300b)의 좌측 경계로부터 우측으로 일정 거 리 이격된 위치로 이동될 수 있다. 다양한 실시 예에 따르면, 제2 유효 범위(300b) 설정 시, 전자 장치의 급격한 방향 전환으로 인하여 비행 장치가 제2 유효 범위(300b) 내에 위치하지 않은 경우, 비행 장치는 현재 위치에서 제2 유효 범위 (300b) 내로 진입할 수 있는 최단 거리를 이동할 수 있다. 비행 장치는 제2 유효 범위(300b)의 좌측 경계 영역에 배치될 수도 있다. 다양한 실시 예에 따르면, 사용자가 전자 장치를 일정 방향으로 회전함에 따라 유효 범위의 경계 영역이 이동하는 경우, 비행 장치는 이동되는 경계 영역을 따라 이동할 수 있다. 예를 들어, 사용자는 전자 장치의 조작 버튼을 이용하지 않고, 전자 장치가 지향하고 있는 방향을 변경하 여 비행 장치를 이동시킬수 도 있다. 도 11은 본 발명의 실시 예에 따른 유효 범위 변경의 또 다른 예를 나타낸 도면이다. 도 11을 참조하면, 1101 상태에서와 같이, 비행 장치는 안전 운행 기능 실행 상태에서, 전자 장치가 지향하는 제1 유효 범위(300a) 내에서 운행될 수 있다. 이 상태에서, 사용자가 전자 장치의 일정 지점의 지향 방향을 변경하여, 제1 유효 범위(300a)가 제2 유효 범위(300b)로 변경되면, 비행 장치는 제2 유효 범 위(300b) 내로 이동할 수 있다. 비행 장치는 제1 유효 범위(300a)에서의 상대적 위치를 제2 유효 범위 (300b)에서도 유지할 수 있다. 예컨대, 비행 장치는 제1 유효 범위(300a) 내에서 중앙 부분에 배치된 경우, 제2 유효 범위(300b)의 중앙 부분으로 이동할 수 있다. 다양한 실시 예에 따르면, 비행 장치는 유효 범위의 급격한 변화에 따라 제2 유효 범위(300b) 내에 포함되지 못한 경우, 제2 유효 범위(300b) 내로 이동할 수 있다. 전자 장치가 일정 속도로 방향이 변화되는 경우, 비행 장치는 유효 범위의 경계 영역을 따 라 이동할 수 있다. 다양한 실시 예에 따르면, 전자 장치는 수동 운행 기능을 기반으로 비행 장치의 움직임을 제어하다가, 사용자 입력에 따라, 안전 운행 기능을 실행할 수 있다. 이 경우, 전자 장치는 유효 범위를 산출하고, 이를 비행 장치에 제공할 수 있다. 비행 장치는 자신의 현재 위치가 유효 범위 내에 있지 않은 경우, 유효 범위 내로 이동할 수 있다. 비행 장치는 현재 위치에서 유효 범위로의 최단거리를 이동하 면서, 유효 범위의 경계 영역에 위치할 수 있다. 비행 장치는 유효 범위 내로 이동되데, 유효 범위의 중앙 영역까지 이동할 수도 있다. 도 12는 본 발명의 실시 예에 따른 카메라와 연결된 전자 장치의 유효 범위 운용의 한 예를 나타낸 도면이다. 도 12를 참조하면, 본 발명의 다양한 실시 예에 따른 웨어러블 장치는 사용자의 일정 부분에 착용될 수 있 다. 상기 웨어러블 장치는 카메라를 포함할 수 있다. 상기 웨어러블 장치는 카메라를 이용 하여 촬영된 영상을 이용하여 AR 환경을 제공할 수 있다. AR 환경은 예컨대, 웨어러블 장치가 카메라를 통해 촬영한 영상을 분석하고, 분석 결과에 따른 가상 객체들을 웨어러블 디스플레이 에 표시하는 환경을 포함할 수 있다. 이에 따라, 사용자는 웨어러블 장치를 기반으로 실제 비행 장치(20 0)를 확인하면서, 지정된 투명도를 가지는 웨어러블 디스플레이를 통해 가상 객체들을 확인할 수 있 다. 상술한 환경에서, 상기 웨어러블 디스플레이는 카메라가 촬영하는 촬영 환경을 기반으로 유효 범위 에 해당하는 가상 펜스 객체를 표시할 수 있다. 도시된 도면을 기준으로, 상기 가상 펜스 객체 는 4개의 테두리를 포함하는 객체가 될 수 있다. 상기 비행 장치는 상기 유효 범위에 해당하는 가상 펜스 객체 내에서 운행될 수 있다. 한 실시 예에 따르면, 상기 웨어러블 장치는 거리 조정과 관련한 웨어러블 입력 장치를 더 포함할 수 있다. 사용자는 상기 웨어러블 입력 장치를 조작하여, 웨어러블 장치와 상기 비행 장치 간의 이 격 거리를 조정할 수 있다. 상기 웨어러블 입력 장치는 사용자의 안구 영역에 착용되고, 사용자가 바라보 는 방향에 대응하여 유효 범위를 조정할 수 있다. 상기 비행 장치는 상기 유효 범위 변경에 따 라 이동하여 변경된 유효 범위 내에 위치할 수 있다. 사용자는 시야 조정을 위해 머리가 향하는 방향(실질적으 로 웨어러블 장치가 지향하는 방향)을 조정하여, 비행 장치의 이동 방향과 속도(머리 방향을 회전하 는 속도에 따라 비행 장치의 속도가 변경)를 조정할 수 있다. 웨어러블 장치는 웨어러블 입력 장치 조작을 기반으로 웨어러블 장치와 비행 장치의 이격 거리를 손쉽게 조정할 수 있다. 상기 웨어 러블 장치는 예컨대, 안경 타입의 전자 장치 또는 HMD 장치 등을 포함할 수 있다. 한 실시 예에 따르면, 상기 웨어러블 장치에 포함된 카메라는 조종자가 웨어러블 디스플레이를 통해 보는 화면과 유사하거나 같은 범위의 촬영 화면을 전기, 전자적으로 제공할 수 있다. 상기 웨어러블 장치 는 상기 카메라가 촬영하고 있는 비행 장치를 식별할 수 있다. 예컨대, 웨어러블 장치는 카메라가 지향하고 있는 방향에 배치된 비행 장치를 조종자가 운전하는 비행 장치로 인식할 수 있다. 상기 웨어러블 장치는 카메라를 통해 식별된 비행 장치의 현재 위치를 카메라의 FOV(field of view) 또는 촬영 범위 내에서 제어될 수 있는 제어 정보를 생성하고, 이를 비행 장치에 제공할 수 있다. 다양한 실시 예에 따르면, 웨어러블 장치는 카메라의 영상 분석을 통해 비행 장치가 FOV 경계로부터 일정 거리 이내에 진입하거나 경계에 이르면 비행 장치를 유효 범위 내로 이동시킬 수 있 는 제어 UI를 웨어러블 디스플레이에 출력하거나 알림을 지정된 방식의 안내 정보(예: 화면, 오디오, 햅틱 피드백 중 적어도 하나)로 출력할 수 있다. 도 13은 본 발명의 실시 예에 따른 카메라 기반 비행 장치의 유효 범위 운행과 관련하여, 장치들간의 신호 흐름 의 한 예를 나타낸 도면이다. 도 13을 참조하면, 동작 1301에서, 카메라를 포함한 전자 장치는 비행 장치와 페어링 동작을 수행할 수 있다. 예를 들어, 상기 전자 장치 및 비행 장치는 페어링 동작 수행과 관련한 무선 통신 회로(예: 근거리 통신 회로 또는 블루투스 통신 회로 등)를 포함할 수 있다. 상기 전자 장치 및 비행 장치 중 어느 하나의 장치는 사용자 입력 또는 스케줄 정보에 따라 대기 상태를 가지며, 나머지 장치는 사용자 입력에 대응하여 페어링 동작을 수행할 수 있다. 페어링 동작 완료 후, 전자 장치는 카메라의 FOV를 유효 범위로 설정하는 안전 운행 기능을 사용자 입력에 따라 또는 설정된 스케줄 정보에 따라 실행할 수 있다. 동작 1303에서, 전자 장치는 비행 장치 인식을 수행할 수 있다. 전자 장치는 카메라를 이용하여 지정된 방향을 촬영하거나 또는 지정된 방향에 대한 프리뷰 영상을 획득할 수 있다. 상기 전자 장치는 획 득된 영상 분석을 수행하여 비행 장치에 해당하는 객체가 검출되는지 확인할 수 있다. 상기 전자 장치 는 비행 장치와 관련한 이미지 정보를 메모리에 저장할 수 있다. 다양한 실시 예에 따르면, 상기 전 자 장치는 자신의 위치 정보 및 비행 장치의 위치 정보를 수집하고, 획득된 영상 내에서, 전자 장치 자신과 비행 장치 간의 위치와 일치하는 비행 장치를 식별할 수 있다. 상기 전자 장치는 위치 정보 비교를 기반으로 복수개의 비행 장치들이 있더라도 자신의 비행 장치를 검출할 수 있다. 동작 1305에서, 전자 장치는 비행 장치가 인식되면, 트래킹 동작을 수행할 수 있다. 동작 1307에서, 전자 장치는 비행 장치가 FOV 범위 이내에 있는지 확인할 수 있다. 예컨대, 전자 장치는 획득된 영상 분석을 통하여 비행 장치가 카메라가 촬영하는 영상 내에 포함되어 있는지 확인할 수 있다. 상 기 전자 장치는 비행 장치가 FOV 범위 내에 있는 경우, 제1 제어 정보를 비행 장치에 전달할 수 있다. 상기 전자 장치는 비행 장치가 FOV 범위 내에 없는 경우, 제2 제어 정보를 비행 장치에 전달할 수 있다. 상기 비행 장치는 동작 1301에서 전자 장치와 페어링 동작을 수행한 이후, 제어 정보 수신에 따라, 운행할 수 있다. 예컨대, 동작 1309에서와 같이, 비행 장치는 전자 장치로부터 제1 제어 정보를 수신 할 수 있다. 이 경우, 비행 장치는 동작 1311에서, 제어 정보(예: 제1 제어 정보)에 따라 정상 비행을 수 행할 수 있다. 정상 비행은 예컨대, 사용자가 입력한 지정된 방향 및 지정된 속도로 비행 장치가 이동하는 운행을 포함할 수 있다. 또는, 동작 1309에서와 같이, 비행 장치는 전자 장치로부터 제2 제어 정보를수신할 수 있다. 이 경우, 비행 장치는 동작 1311에서, 제어 정보(예: 제2 제어 정보)에 따라 예외 처리를 수행할 수 있다. 예외 처리는 예컨대, 사용자가 지정한 방향 및 지정한 속도에 관계 없이 카메라의 FOV를 벗어나지 않도록 동작하는 비행을 포함할 수 있다. 예를 들어, 비행 장치는 FOV의 우측 경계에 배치된 경 우, 비행 장치는 전자 장치로부터 우측으로의 이동을 요청받더라도 현재 상태를 유지할 수 있다. 상 기 전자 장치는 비행 장치의 우측 이동을 수행할 수 없음 안내하거나, 우측 이동을 위해서 수동 운행 기능을 실행할 것을 요청하는 정보를 출력할 수 있다. 도 14는 본 발명의 실시 예에 따른 카메라 기반의 유효 범위 운행과 관련하여 장치들간의 신호 흐름의 한 예를 나타낸 도면이다. 도 14를 참조하면, 카메라 기반의 유효 범위 운행과 관련한 시스템은 예컨대, 경계 설정 장치(예: 웨어러 블 전자 장치), 전자 장치(예: 비행 장치 컨트롤러), 또는 비행 장치를 포함할 수 있다. 동작 1401에서, 경계 설정 장치와 전자 장치는 페어링 동작을 수행하여 통신 채널을 형성할 수 있다. 상기 전자 장치는 비행 장치와 페어링 동작을 수행하여 통신 채널을 형성할 수 있다. 동작 1403에서, 경계 설정 장치는 사용자 입력에 대응하여 카메라를 활성화하고, 활성화된 카메라로 획득 된 영상(예: 프리뷰 영상 등)을 분석할 수 있다. 상기 경계 설정 장치는 영상 분석을 기반으로 상기 카메 라의 FOV(또는 카메라의 촬영 각도) 내에 비행 장치가 존재하는지 확인할 수 있다. 상기 경계 설정 장치 는 비행 장치를 인식할 수 있도록 비행 장치와 관련한 이미지(또는 이미지에서 추출한 특징점, 또는 특징점을 기반으로 생성된 모델)를 사전 저장하고, 저장된 이미지와 현재 획득된 이미지 분석을 통해 추출 된 정보들을 비교할 수 있다. 상기 경계 설정 장치는 카메라의 FOV를 유효 범위로서 설정할 수 있다. 비행 장치가 검출되면, 동작 1405에서, 경계 설정 장치는 비행 장치 트래킹을 수행할 수 있다. 예컨대, 경계 설정 장치는 전자 장치의 제어에 대응하여 비행 장치의 움직임을 추적할 수 있다. 동작 1407에서, 경계 설정 장치는 비행 장치의 움직임 정보가 FOV 경계를 벗어나는지 확인할 수 있다. 비행 장치가 카메라의 FOV 경계를 벗어난 경우, 동작 1409에서, 경계 설정 장치는 예외 처리 요청을 전자 장치에 전달할 수 있다. 경계 설정 장치는 FOV에 대응하는 유효 범위에 대한 정보와 FOV 상에서의 비행 장치 위치 정보를 전자 장치에 제공할 수 있다. 동작 1407에서, 경계 설정 장치로부터 예외 처리 요청을 수신하면, 동작 1411에서, 전자 장치는 예외 처리 요청 수신에 대한 노티(Notification)을 출력할 수 있다. 한 실시 예에 따르면, 전자 장치는 디스플 레이를 통하여 예외 처리 요청 수신과 관련한 시각 정보를 출력하거나, 또는 오디오 장치를 기반으로 예외 처리 요청 수신을 안내할 수 있다. 전자 장치는 예외 처리 요청 발생에 따른 지정된 패턴의 햅틱 피드백을 출력 할 수 있다. 동작 1413에서, 전자 장치는 예외 처리와 관련한 변경 제어 신호를 비행 장치에 전송할 수 있다. 상 기 변경 제어 신호는 예컨대, 상기 비행 장치를 FOV 이내로 이동시키기 위한 운전 제어 정보를 포함할 수 있다. 동작 1415에서, 비행 장치는 전자 장치로부터 변경 제어 신호를 수신하면, 비행 장치를 FOV 이내로 이동시키기 위한 동작을 수행할 수 있다. 비행 장치는 현재 위치에서 FOV 영역 중 가장 근접한 지점으로의 이동을 제어할 수 있다. 동작 1407에서, 비행 장치가 FOV 경계를 벗어나지 않은 경우, 동작 1417에서 경계 설정 장치는 정상 제어 정보를 전자 장치에 전달할 수 있다. 상기 전자 장치는 경계 설정 장치로부터 정상 제어 정보를 수신하면, 동작 1419에서 사용자 입력을 수신할 수 있다. 상기 사용자 입력은 예컨대, 비행 장치를 일정 방향으로 이동시키기 위한 입력을 포함할 수 있다. 동작 1421에서, 전자 장치는 사용자 입력에 따른 운전 제어 정보를 생성하고, 생성된 운전 제어 정보를 비행 장치에 전송할 수 있다. 동작 1423에서, 비행 장치는 수신된 운전 제어 정보에 따라 비행을 수행할 수 있다. 예컨대, 상기 비행 장치는 운전 제어 정보에 포함된 지정된 방향 및 속도에 따라 모터를 동작시켜 이동할 수 있다. 본 발명의 실시 예에 따른 유효 범위 운행 시스템은 사용자가 카메라 등을 포함한 안경 전자 장치(예: 경계 설 정 장치) 등을 착용하고, 비행 장치를 제어할 수 있는 컨트롤러(예: 전자 장치)를 조작하여, 비 행 장치를 조작하면서도, 안경 전자 장치를 이용하여 비행 장치의 움직임 범위를 제한함으로써, 보다 안전하게 비행 장치를 움직이면서도 세세한 조작을 컨트롤러를 이용하여 처리할 수 있도록 지원할 수 있다.도 15는 본 발명의 실시 예에 따른 유효 범위 운행과 관련한 화면 인터페이스의 한 예를 나타낸 도면이다. 도 15를 참조하면, 전자 장치는 디스플레이를 포함하고, 상기 디스플레이에 비행 장치와 관련한 유효 범위(또는 FOV)를 표시할 수 있다. 비행 장치는 유효 범위 내에서 이동할 수 있으 며, 도시된 바와 같이, 유효 범위의 우측 경계에 인접한 지역으로 이동할 수 있다. 이 경우, 디스플레이 는 도시된 바와 같이, 유효 범위의 우측 경계선에 해당하는 경계선 객체를 표시할 수 있다. 상 기 디스플레이는 비행 장치에 대응하는 가상 비행 객체를 디스플레이에 표시할 수 있다. 본 발명의 실시 예에 따른, 전자 장치는 가상 비행 객체가 경계선 객체(예: 우측 경계선 객 체)에 지정된 거리 이내로 접근하는 경우, 비행 장치를 유효 범위의 경계선으로부터 멀어지도록 제어 UI를 출력할 수 있다. 상기 제어 UI는 방향별 제어 객체들(예: Left, Right, Up, Down, 회전 등)을 포함할 수 있다. 상기 제어 UI에 포함된 제어 객체들 중 상기 비행 장치가 경계선으로부터 멀어질 수 있도록 조작 가능한 제어 객체는 다른 제어 객체와 다르게 표시될 수 있다. 예컨대, 경계선 관련 제어 객체는 하이라이트 되거나 다른 제어 객체와 다른 색으로 표시될 수 있다. 다양한 실시 예에 따르면, 전자 장치는 비행 장치와 통신 연결되면 제어 UI를 출력하고, 비행 장치가 유효 범위의 경계선에 접근 하는 경우, 제어 UI의 일부 제어 객체를 다른 제어 객체와 다르게 표시할 수도 있다. 제어 UI 조작에 따른 사용자 입력 신호가 수신되면, 전자 장치는 수신된 사용자 입력이 비행 장치 를 경계선으로부터 멀어지도록 하는 입력인지 확인하고, 멀어지도록 하는 입력이면, 해당 입력에 대응하는 제어 정보(또는 운전 제어 정보)를 비행 장치에 전송할 수 있다. 경계선을 넘어가는 입력(예: 비행 장치 를 우측으로 이동시키는 입력)이 수신되면, 전자 장치는 해당 입력 무효를 안내하고, 지정된 방향(예: 비행 장치의 좌측 이동)을 요청하는 안내 정보를 출력할 수 있다. 한 실시 예에 따르면, 상기 디스플레이에 출력되는 영상은 전자 장치에 포함된 카메라가 획득한 영상 이거나 또는 사용자가 착용한 웨어러블 전자 장치의 카메라가 촬영한 영상을 수신한 영상일 수 있다. 상기 웨어 러블 전자 장치의 움직임에 따라 카메라 촬영 각도가 변경되면, 상기 디스플레이는 변경된 카메라의 촬영 각도로 수집된 영상을 출력할 수 있다. 다양한 실시 예에 따르면, 비행 장치가 유효 범위의 경계선을 넘는 방향으로 이동 하여 경계선을 넘는 경우 또는 비행 장치가 카메라의 FOV 범위를 벗어난 경우 상기 전 자 장치는 넘어간 경계선 지점으로 비행 장치를 이동되도록 자동 제어할 수 있다. 예컨대, 비행 장치 는 바람 등의 환경적인 요인 또는 관성 운동(사용자 조작이 종료된 이후 관성에 의해 이동)으로 인해 사용 자 의도에 관계 없이 유효 범위를 벗어날 수 있다. 이 경우, 전자 장치는 해당 요인에 의하여 비행 장치가 유효 범위의 경계선을 넘게 되는 경우, 비행 장치를 경계선 내측으로 이동시키는 제어 정보를 생성하고, 이를 비행 장치에 제공할 수 있다. 비행 장치는 생성된 제어 정보를 기반으로 유효 범위 경계선 내측으로 이동할 수 있다. 다양한 실시 예에 따르면, 상기 디스플레이는 비행 장치에 대응하는 가상 비행 객체와 유효 범 위에 해당하는 범위 객체를 표시할 수 있다. 비행 장치가 유효 범위를 벗어난 경우, 사용자는 가상 비행 객체를 터치 앤 드래그하여, 범위 객체 내에 이동시키는 동작을 수행하면, 전자 장치는 해당 터치 동작에 대응하는 제어 정보를 자동 생성하여, 비행 장치에 제공할 수 있다. 다양한 실시 예에 따르면, 적어도 하나의 카메라를 포함한 전자 장치를 지정된 구조물에 거치하고, 해당 카메라 의 FOV를 비행 장치가 운행될 수 있는 유효 범위로 설정할 수도 있다. 전자 장치는 적어도 하나의 카 메라의 위치 정보, 카메라가 지향하고 있는 방향 정보 또는 카메라의 FOV를 획득하고, 획득된 정보를 기반으로 유효 범위를 설정할 수 있다. 다양한 실시 예에 따르면, 상기 전자 장치는 복수개의 카메라의 FOV, 카메라 의 위치 정보들을 획득하고, 카메라를 선택할 수 있는 선택 UI를 출력할 수 있다. 사용자는 선택 UI에서 지정된 카메라를 선택하고, 해당 카메라의 위치 정보 및 FOV 정보를 획득하여 이를 비행 장치에 제공할 수 있다. 상기 비행 장치는 자신의 위치 정보를 확인하고 상기 카메라의 위치 정보 및 FOV 정보를 기반으로 해당 카 메라에 해당하는 FOV 내로 자동 이동할 수 있다. 다양한 실시 예에 따르면, 상기 비행 장치는 근접 센서를 포함하고, 주변 장애물과의 충돌이 예상되는 경우, 이동을 중지할 수 있다. 다양한 실시 예에 따르면, 상기 적어도 하나의 카메라는 실내에 배치될 수 있다. 상기 카메라는 예컨대, IP 카 메라 등을 포함할 수 있다. 실내에 배치된 카메라는 FOV 정보를 전자 장치에 제공할 수 있다. 상기 전자 장치는 카메라의 FOV를 유효 범위로 설정하고, 비행 장치는 카메라의 FOV 내에서 운행할 수 있다. 비 행 장치는 근접 센서를 이용하여 근접도를 검사하고, 실내 구조물과 일정 거리 이내로 접근하는 경우 이동 을 중지하거나 호버링 상태(제자리에 부유한 상태)를 가질 수 있다. 상기 전자 장치는 연결된 카메라의FOV 관련 정보를 디스플레이에 출력하고, 사용자 조작에 대응하여 상기 FOV의 형태나 크기 또는 각도 등을 조정 하도록 지원할 수 있다. 다양한 실시 예에 따르면, 전자 장치(또는 제어 장치)는 하우징, 상기 하우징 상에 제공된 사용자 인터페이스 (예: 디스플레이), 상기 하우징 내측에 배치되고 상기 하우징의 오리엔테이션(orientation)과 관련한 제1 데이 터를 생성하는 적어도 하나의 제1 센서(예: 자세 정보를 수집하는 센서), 상기 하우징 내측에 배치되고 상기 하 우징의 위치와 관련한 제2 데이터를 생성하는 제2 센서(예: 위치 정보 수집 센서), 상기 하우징 내측에 위치한 무선 통신 회로(예: 상기 제1 통신 회로), 상기 하우징 내측에 위치하고 상기 사용자 인터페이스, 상기 적어도 하나의 제1 센서, 상기 제2 센서 및 상기 무선 통신 회로와 전기적으로 연결되는 프로세서(예: 상기 전자 장치 의 프로세서) 및 상기 하우징 내측에 배치되고 상기 프로세서에 전기적으로 연결되는 메모리(예: 상기 제1 메모 리)를 포함하고, 상기 메모리는, 실행시에, 상기 프로세서가 무선 통신 회로를 통해 무인 비행 장치와 무선 통 신을 형성하고, 상기 적어도 하나의 제1 센서로부터 제1 데이터를 수신하고, 상기 수신된 제1 데이터의 적어도 일부를 기반으로 하우징의 오리엔테이션을 결정하고, 상기 제 2 센서로부터 제 2 데이터를 수신하고, 상기 수신 된 제 2 데이터에 적어도 일부 기초하여, 상기 하우징의 위치를 결정하고, 상기 오리엔테이션 및 위치에 적어도 일부 기반하여, 상기 무인 비행 장치가 머무르게 될 대기 공간(예: 유효 범위)을 결정하고, 상기 무선 통신 회 로를 통해 상기 무인 비행 장치에 제어 신호를 전송하는 인스트럭션들(instructions)을 저장하며, 상기 제어 신 호는, 상기 무인 비행 장치가, 상기 결정된 대기 공간 내에서 머무르거나, 상기 대기 공간 내로 날아가도록 구 성될 수 있다. 다양한 실시 예에 따르면, 위에서 보았을 때, 상기 대기 공간은 팬(fan)(부채) 모양을 가질 수 있다. 다양한 실시 예에 따르면, 상기 팬 모양은 상기 하우징의 위치 또는 인접한 영역에 있는 정점(예: 상기 전자 장 치의 상부 측면의 중심점)을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 대기 공간은 위에서 보았을 때, 상기 하우징의 위치로부터 서로 다른 방향으로 연장된 제1 가상 라인 및 제2 가상라인 에 의해 정의되고, 제1 가상 라인 및 제2 가상 라인은 상기 하우징의 위 치에서 일정 각도로 형성될 수 있다. 예컨대, 상기 도 10 또는 도 15에 나타낸 바와 같이, 상기 대기 공간은 전 자 장치의 좌우 가상의 라인들로 구성될 수 있다. 다양한 실시 예에 따르면, 위에서 보았을 때, 상 각도는 예각인 것을 특징으로 한다. 다양한 실시 예에 따르면, 위에서 보았을 때, 상기 각도는 40도~180도 범위인 것을 특징으로 한다. 다양한 실시 예에 따르면, 상기 사용자 인터페이스는 디스플레이를 포함하고, 상기 명령어는 상기 프로세서가 상기 디스플레이의 방향 중 적어도 일부를 기반으로 상기 하우징의 방향을 결정하도록 설정될 수 있다. 상술한 다양한 실시 예에 따르면, 한 실시 예에 따른 제어 장치(또는 전자 장치는 비행 장치와 통신 채널을 형 성하는 통신 회로, 위치 정보 및 자세 정보를 수집하는 센서, 상기 비행 장치 운행 제어와 관련한 어플리케이션 이 저장된 메모리 및 상기 통신 회로와 상기 센서 및 상기 메모리와 전기적으로 연결되는 프로세서를 포함하고, 상기 프로세서는 현재 자신의 위치 및 자세 정보에 기반하여 지정된 방향에 대해 상기 비행 장치가 운행할 수 있는 공간을 정의한 유효 범위를 산출하도록 설정될 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 상기 메모리에 저장된 설정 값을 획득하고, 획득된 설정 값에 따라, 상기 유효 범위의 크기 및 유효 범위의 형태 중 적어도 하나를 조정하도록 설정될 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 상기 유효 범위의 형태와 관련한 설정 값에 따라, 상기 유효 범위를 다각 뿔 또는 원뿔의 형태로 조정하도록 설정될 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 상기 유효 범위 중 적어도 일부분이 지면으로부터 일정 높이 이상에 서 상기 비행 장치가 운행되도록 설정될 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 위치 또는 자세 중 적어도 하나가 변경되면, 변경된 위치 또는 자세 에 대응하여 유효 범위를 재산출하고, 재산출된 유효 범위를 상기 비행 장치에 전송하도록 설정될 수 있다. 다양한 실시 예에 따르면, 상기 전자 장치는 일정 촬영각을 기반으로 영상을 획득하는 카메라를 더 포함하고, 상기 프로세서는 상기 카메라의 FOV를 상기 유효 범위로 설정할 수 있다. 다양한 실시 예에 따르면, 상기 전자 장치는 디스플레이를 더 포함하고, 상기 프로세서는 상기 유효 범위를 지 시하는 가상 객체를 상기 디스플레이 출력하도록 설정될 수 있다.다양한 실시 예에 따르면, 상기 프로세서는 상기 비행 장치의 위치 정보를 수집하고, 상기 비행 장치가 상기 유 효 범위 내에 있는지 확인하고, 상기 비행 장치가 상기 유효 범위를 벗어난 경우, 상기 비행 장치가 상기 유효 범위 내 지정된 지점으로 이동하도록 제어 정보를 자동 생성한 후, 상기 비행 장치에 전송하도록 설정될 수 있 다. 다양한 실시 예에 따르면, 상기 프로세서는 현재 위치 및 자세 정보에 따라 실시간 산출된 유효 범위 정보를 상 기 비행 장치에 전송하도록 설정될 수 있다. 도 16은 본 발명의 한 실시 예에 따른 무인 비행 장치의 운행과 관련한 전자 장치 운용 방법의 한 예를 나타낸 도면이다. 도 16을 참조하면, 무인 비행 장치의 운행과 관련하여, 동작 1601에서, 전자 장치는 비행 장치 연결 을 수행할 수 있다. 예컨대, 전자 장치는 사용자 입력에 대응하여 비행 장치와의 페어링 동작을 수행 할 수 있다. 동작 1603에서, 이벤트가 발생하면, 상기 전자 장치는 안전 운행 기능과 관련한 이벤트 발생인지 확인할 수 있다. 예컨대, 전자 장치는 안전 운행 기능과 관련한 설정이 있는지 또는 안전 운행 기능 실행을 요청 하는 사용자 입력이 있는지 확인할 수 있다. 안전 운행 기능과 관련한 이벤트가 아니면, 동작 1605에서, 전자 장치는 설정 기능에 따른 운행을 제어할 수 있다. 예컨대, 전자 장치는 수동 운행 기능이 설정된 경 우, 사용자 입력에 따른 제어 정보를 생성하고, 이를 비행 장치에 제공하여, 사용자 조작에 따라 비행 장 치가 이동되도록 제어할 수 있다. 동작 1607에서, 전자 장치는 전자 장치의 위치 및 자세 정보를 수집하고, 비행 장치의 위치 정 보를 수집할 수 있다. 전자 장치는 위치 정보 수집 센서 및 가속도 센서 등을 활성화하고, 상기 위치 정보 및 자세 정보를 수집할 수 있다. 전자 장치는 비행 장치의 위치 정보를 비행 장치에 요청할 수 있다. 상기 전자 장치는 비행 장치의 고도 정보를 수집할 수 있다. 다양한 실시 예에 따르면, 비행 장치의 위치 정보 및 고도 정보 중 적어도 하나의 수집은 동작 1609 이후에 수행될 수도 있다. 동작 1609에서, 전자 장치는 설정에 따른 유효 범위를 계산할 수 있다. 예컨대, 전자 장치는 전자 장 치의 일정 지점을 기준으로, 지정된 방향에 대한 각도 범위 또는 면적 범위 또는 공간 범위 등을 설정에 따라 결정할 수 있다. 상기 설정은 예컨대, 전자 장치의 일정 지점을 기준으로 일 방향에 대한 각도 값을 포함할 수 있다. 상기 설정은 예컨대, 전자 장치의 일정 지점을 기준으로 일 방향에 대한 유효 범위의 형 태 값을 포함할 수 있다. 상기 설정은 예컨대, 전자 장치의 일정 지점을 기준으로 비행 장치의 최대 이격 거리 값을 포함할 수 있다. 동작 1611에서, 전자 장치는 비행 장치가 유효 범위 이내에 있는지 확인할 수 있다. 이와 관련하여, 전자 장치는 비행 장치의 위치 정보가 상기 유효 범위 내에 있는지 비교할 수 있다. 상기 전자 장치 는 유효 범위가 유효 고도를 포함한 경우, 비행 장치의 고도가 유효 고도 내에 있는지 확인할 수 있 다. 예를 들어, 상기 유효 고도는 상기 전자 장치에 가까울수록 유효 고도의 높이가 낮고, 멀어질수록 유 효 고도의 높이가 높아지는 형태를 포함할 수 있다. 다양한 실시 예에 따르면, 상기 유효 고도는 전자 장치 와의 이격 거리에 관계없이 동일(예: 2m 이상의 높이)하게 설정될 수도 있다. 비행 장치가 유효 범위 이내이면, 동작 1613에서, 전자 장치는 제1 제어 정보를 비행 장치에 전 송할 수 있다. 상기 제1 제어 정보는 예컨대, 비행 장치를 사용자 입력에 따라 이동시키기 위한 방향, 거 리, 또는 속도 정보를 포함할 수 있다. 비행 장치가 유효 범위 밖이면, 동작 1615에서, 전자 장치는 제2 제어 정보를 비행 장치에 전송할 수 있다. 상기 제2 제어 정보는 예컨대, 비행 장치를 중지시키 거나, 비행 장치를 유효 범위의 지정된 지점(예: 유효 범위의 경계선, 유효 범위의 경계선 내측, 유효 범 위의 경계선으로부터 내측으로 일정거리 이격된 지점, 유효 범위의 중앙 지점 등)으로 이동시키기 위한 이동 방 향, 거리, 또는 속도 등의 정보를 포함할 수 있다. 동작 1617에서, 전자 장치는 안전 운행 기능 종료 또는 비행 장치 조작 기능 종료와 관련한 이벤트가 발생하는지 확인할 수 있다. 해당 기능 종료와 관련한 이벤트 발생이 없으면, 동작 1603 이전으로 분기하여 이 하 동작을 재수행할 수 있다. 안전 운행 기능 종료와 관련한 이벤트 발생 시, 전자 장치는 동작 1605로 분 기하여 설정 기능에 따른 비행 장치의 운행 제어를 수행할 수 있다. 비행 장치 조작 기능 종료와 관 련한 이벤트가 발생하면, 전자 장치는 비행 장치를 지정된 지점(예: 최초 비행 장치가 출발한 지점)으로 돌아오도록 이동 방향과 거리 및 좌표 정보 등을 제공할 수 있다.상술한 설명에서는 전자 장치가 비행 장치의 유효 범위 내의 운행을 확인하고, 그에 따른 비행 장치 제어와 관련한 동작들을 설명하였으나, 본 발명이 이에 한정되는 것은 아니다. 예컨대, 상기 전자 장치 는 유효 범위 산출과 관련하여 자신의 위치 정보 및 자세 정보만을 수집하고 이를 비행 장치에 제공 할 수 있다. 상기 전자 장치는 자신의 위치 정보 및 자세 정보가 변경되면, 변경 시점의 위치 정보 및 자 세 정보를 다시 비행 장치에 전송하여 유효 범위를 갱신하도록 지원할 수 있다. 상기 전자 장치는 유 효 범위를 산출하고, 산출된 유효 범위를 비행 장치에 제공할 수도 있다. 상기 전자 장치는 자신의 위치 정보 및 자세 정보 중 적어도 하나가 변경되면, 변경된 유효 범위를 다시 산출하고, 산출된 유효 범위를 비행 장치에 제공할 수도 있다. 도 17은 본 발명의 실시 예에 따른 무인 비행 장치의 운행과 관련한 비행 장치 운용 방법의 한 예를 나타낸 도 면이다. 도 17을 참조하면, 무인 비행 장치의 운행과 관련하여, 동작 1701에서, 비행 장치는 전자 장치와 연 결될 수 있다. 예컨대, 비행 장치는 연결 대기 상태를 가지고, 전자 장치로부터 페어링 연결 요청에 대응하여 전자 장치와 페어링될 수 있다. 동작 1703에서, 비행 장치는 안전 운행 기능 설정이 있는지 또는 안전 운행 기능 실행을 요청하는 사용자 입력이 있는지 확인할 수 있다. 상기 비행 장치는 안전 운행 기능 설정 또는 입력이 없는 경우, 동작 1705에서, 수신 정보에 따른 운행을 제어할 수 있다. 예컨대, 비행 장 치는 디폴트로 전자 장치로부터 수신된 제어 정보를 기반으로 지정된 방향, 거리, 또는 속도로 운동 할 수 있다. 동작 1703에서, 안전 운행 기능과 관련한 설정이 있거나 사용자 입력이 발생하면, 동작 1707에서, 비행 장치 는 유효 범위 정보 및 위치 정보를 수집할 수 있다. 한 실시 예에 따르면, 상기 비행 장치는 유효 범 위 정보를 전자 장치로부터 수신할 수 있다. 상기 비행 장치는 전자 장치로부터 전자 장치(10 0)의 위치 정보 및 자세 정보와, 유효 범위와 관련한 설정 값을 수신할 수 있다. 상기 비행 장치는 수신된 전자 장치의 위치 정보 및 자세 정보, 또는 유효 범위 관련 설정 값을 기반으로 유효 범위를 산출할 수 있 다. 상기 비행 장치는 위치 정보 획득과 관련하여 위치 정보 수집 센서를 활성화할 수 있다. 상기 비행 장 치는 자신의 고도 정보를 수집할 수 있다. 동작 1709에서, 비행 장치는 자신의 현재 위치가 유효 범위 이내인지 확인할 수 있다. 비행 장치의 위치가 유효 범위 이내이면, 동작 1711에서, 비행 장치는 정상 운행을 수행할 수 있다. 예컨대, 비행 장치 는 전자 장치가 전달하는 제어 정보에 포함된 사용자 입력에 대응하여, 입력된 방향으로, 입력된 거 리만큼 이동하되, 또는 입력된 속도로 이동할 수 있다. 동작 1709에서, 비행 장치의 위치가 유효 범위 밖이면, 동작 1713에서, 비행 장치는 예외 처리를 수 행할 수 있다. 예컨대, 비행 장치는 유효 범위 내의 지정된 지점(예: 유효 범위의 경계선, 유효 범위의 경 계선 내측, 유효 범위의 경계선으로부터 내측으로 일정거리 이격된 지점, 유효 범위의 중앙 지점 등)으로 자동 이동할 수 있다. 이 동작을 수행하는 동안, 비행 장치는 전자 장치로부터 사용자 요청에 따라 지정된 방향으로의 이동을 지시하는 제어 정보가 유효 범위 밖에서 이루어지는 운행과 관련한 것인지 확인할 수 있다. 상기 제어 정보가, 유효 범위 밖에서 이루어지는 운행인 경우(또는 유효 범위 내로 이동하기 위한 동작과 관련 이 없는 경우), 비행 장치는 해당 제어 정보를 무시할 수 있다. 동작 1715에서, 비행 장치는 안전 운행 기능 종료와 관련한 이벤트 수신이 있는지 확인할 수 있다. 안전 운행 기능 종료 시, 비행 장치는 유효 범위 내에서의 운행을 종료할 수 있다. 상기 비행 장치는 안전 운행 기능 종료에 따라, 수동 운행 기능을 실행하고, 전자 장치의 사용자 입력에 따른 동작을 수행할 수 있다. 안전 운행 기능 종료와 관련한 이벤트 수신이 없는 경우, 비행 장치는 동작 1703 이전으로 분기하여 이하 동작을 재수행할 수 있다. 본 발명의 다양한 실시 예는 전자 장치(예: 컨트롤러 또는 Wearable 디바이스 등)기준으로 특정 유효 범위 내에 무인 비행 장치가 운행되도록 하여 조종자 시야에 벗어남 없이 안전한 비행 제어가 가능한 방법을 제공할 수 있 다. 본 발명의 다양한 실시 예들은 전자 장치 기준의 특정 유효 범위는 조종자의 시야 범위(예: 카메라의 FOV 이용)와 유사하게 관리되어 무인 비행체를 시야에서 벗어나지 않게 할 수 있다. 본 발명의 다양한 실시 예들은 전자 장치의 위치 또는 사용자의 조정 방향 변경에 따라 유효 범위를 동적으로 변경하여 비행 장치를 보다 손쉽 고 즉각적으로 운행시킬 수 있다. 본 발명의 다양한 실시 예에 따르면, 무선 비행 장치의 운행 제어 방법은 전자 장치의 프로세서가 비행 장치와 통신 채널을 형성하는 동작, 상기 전자 장치의 위치 정보 및 자세 정보를 수집하는 동작, 획득된 상기 전자 장 치의 위치 및 자세 정보에 기반하여 상기 전자 장치의 일 지점을 기준으로 지정된 방향에 대해 상기 비행 장치 가 운행할 수 있는 공간을 정의한 유효 범위를 산출하는 동작, 상기 전자 장치가 상기 비행 장치의 위치 정보를 수집하는 동작, 상기 전자 장치가 상기 비행 장치가 상기 유효 범위 내에 있는지 확인하는 동작, 확인 결과에 따라 상기 비행 장치의 운행과 관련한 제어 정보를 상기 비행 장치에 전송하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 전송하는 동작은 상기 비행 장치가 상기 유효 범위 밖에 있는 경우 상기 비행 장치를 상기 유효 범위의 지정된 지점으로 이동시키는 제어 정보를 자동으로 생성하여 상기 비행 장치에 전송하 는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 전송하는 동작은 상기 비행 장치가 상기 유효 범위 내에 있는 경우, 상기 전자 장치가 사용자 입력을 수집하는 동작, 상기 사용자 입력에 대응하여 상기 비행 장치를 지정된 방향과 지정된 거 리 및 지정된 속도로 이동시키는 제어 정보를 생성하여 상기 비행 장치에 전송하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 산출하는 동작은 상기 전자 장치의 메모리에 저장된 설정 값을 획득하는 동작, 획득된 설정 값에 따라, 상기 유효 범위의 크기 및 유효 범위의 형태 중 적어도 하나를 조정하는 동작을 포함할 수 있다. 도 18은 본 발명의 실시 예에 따른 무인 비행 전자 장치와 원격 제어기의 한 예를 나타낸 도면이다. 도 18을 참조하면, 본 발명의 실시 예에 따른 무인 비행 전자 장치는 몸체, 제어부, 전원 공 급부, 센서, 모터, 통신 회로, 또는 레코더를 포함할 수 있다. 상기 몸체 는 구동 장치(예: 제어부, 전원 공급부, 통신 회로가 실장된 회로 기판 등)가 안착되 는 하우징과, 상기 액추에이터나 센서를 고정시키는 지지대 등을 포함할 수 있다. 상기 전원 공급 부는 예컨대, 배터리 또는 배터리 팩을 포함할 수 있다. 상기 센서, 액추에이터 등은 센서 및 액추에이터 를 포함할 수 있다. 상기 레코더는 예컨대, 카메라 및 카메라의 영상을 저장하는 메모리 장치를 포함할 수 있다. 한 실시 예에 따르면, 상기 원격 제어기는 상기 무인 비행 전자 장치와 통신할 수 있는 통신 기능, 무인 비행 전자 장치의 상하 또는 좌우, 전후 등의 방향 전환을 제어할 수 있는 입력 수단, 상기 무인 비 행 전자 장치에 장착되는 카메라를 제어할 수 있는 제어 수단 등을 포함할 수 있다. 상기 원격 제어기 는 통신 회로, 조이스틱 또는 터치 패널 등을 포함할 수 있다. 상기 원격 제어기는 상기 무인 비행 전자 장치가 촬영한 영상을 출력할 수 있는 디스플레이를 포함할 수 있다. 도 19는 다양한 실시 예에 따른 무인 비행 전자 장치의 한 예를 나타낸 도면이다. 도 19를 참조하면, 본 발명의 실시 예에 따른 무인 비행 전자 장치는 짐벌 카메라 장치, 구동 장치 , 복수의 프로펠러들, 또는 복수의 모터들을 포함할 수 있다. 상기 짐벌 카메라 장치는 예컨대, 카메라 모듈, 짐벌 서브 회로 기판, 롤 모터(roll motor), 또는 피치 모터(pitch motor)을 포함할 수 있다. 상기 짐벌 서브 회로 기판은 자이 로 센서 및 각속도 센서, 또는 짐벌 모터 제어 회로를 포함할 수 있다. 상기 짐벌 모터 제어 회로 는 롤 모터 제어를 위한 제1 모터 드라이버, 또는 피치 모터 제어를 위한 제2 모터 드 라이버를 포함할 수 있다. 상기 구동 장치는 응용 프로세서, 메인 모터 제어 회로를 포함할 수 있다. 상기 구동 장치 는 상기 응용 프로세서에 의해 제어되는 메모리, 위치 정보 수집 센서(예: GPS), 또는 통신 회로(예: Wi-Fi, BT)를 포함할 수 있다. 상기 구동 장치는 상기 메인 모터 제어 회로에 의해 제어되는 적어도 하나의 센서 제어부, 복수의 모터들을 제어하는 복수의 모터 드라이버 회로들, 또는 복수의 모터 드라이버 회로들 을 제어하는 서브 모터 제어 회로들을 포함할 수 있다. 상기 구동 장치는 배터리 및 전원 제 어부를 포함할 수 있다. 상기 짐벌 카메라 장치 및 상기 구동 장치는 연성 기판(FPCB) 또는 도선으로 연결될 수 있다. 도 20은 다양한 실시 예에 따른 무인 비행 전자 장치의 다른 예를 나타낸 도면이다. 도 20을 참조하면, 무인 비행 전자 장치는 하나 이상의 프로세서(예: AP), 통신 모듈, 인터 페이스, 입력 장치, 센서 모듈, 메모리, 오디오 모듈, 인디케이터, 전력 관리 모듈, 배터리, 카메라 모듈, 이동 제어 모듈, 또는 짐벌 모듈을 포함할 수 있다. 프로세서는, 예를 들면, 운영 체제 또는 응용 프로그램을 구동하여 프로세서에 연결된 다수의 하드 웨어 또는 소프트웨어 구성요소들을 제어할 수 있고, 각종 데이터 처리 및 연산을 수행할 수 있다. 프로세서 는 운영 체제 또는 응용 프로그램을 구동하여 전자 장치의 비행 커멘드를 생성할 수 있다. 예를 들면, 프 로세서는 카메라 모듈 또는 센서 모듈, 통신 모듈로부터 수신한 데이터를 이용하여 이 동 커멘드를 생성할 수 있다. 상기 프로세서는 획득한 피사체의 상대적인 거리를 계산하여 이동 커맨드를 생성할 수 있으며, 피사체의 수직 좌표로 무인 촬영 장치의 고도 이동 커맨드를 생성할 수 있고, 피사체의 수평 좌표로 무인 촬영 장치의 수평 및 방위각 커맨드를 생성할 수 있다. 통신 모듈은, 예를 들면, 셀룰러 모듈, WiFi 모듈, 블루투스 모듈, GNSS(global navigation satellite system) 모듈, NFC 모듈 및 RF 모듈를 포함할 수 있다. 본 발명의 다 양한 실시 예에 따른 통신 모듈은 무인 비행 전자 장치의 제어 신호 수신 및 무인 비행 전자 장치 상태 정보, 영상 데이터 정보를 다른 전자 장치와 전송할 수 있다. RF 모듈은 통신 신호(예: RF 신호)를 송수신할 수 있다. RF 모듈은, 예를 들면, 트랜시버, PAM(power amp module), 주파수 필터, LNA(low noise amplifier), 또는 안테나 등을 포함할 수 있다. GNSS 모듈은 전자 장치의 이동 중 위도, 경도, 고도, 속도, heading 정보 등의 위치 정보(longitude, latitude, altitude, GPS speed, GPS heading)를 출력할 수 있다. 위치 정보는 GNSS 모듈을 통해 정확한 시간과 거리를 측정하여 위치를 계산할 수 있다. GNSS 모듈은 위도, 경도, 고도의 위치뿐만 아니라 3차원의 속도 정보와 함께 정확한 시간까지 획득할 수 있다. 일 실시 예에 따른 무인 비행 전자 장치는 통신 모듈을 통해 무인 촬영 장치의 실시간 이동 상태를 확인하기 위한 정보를 무인 비행 전자 장치로 전송할 수 있다. 인터페이스는, 다른 전자 장치와 데이터의 입출력을 위한 장치이다. 예를 들어 USB 또는 광인터페 이스, RS-232, RJ45를 이용하여, 다른 외부 기기로부터 입력된 명령 또는 데이터를 무인 비 행 전자 장치의 다른 구성요소(들)에 전달할 수 있다. 또는 인터페이스는 무인 비행 전자 장치의 다른 구성요소(들)로부터 수신된 명령 또는 데이터를 사용자 또는 다른 외부 기기로 출력할 수 있다. 입력 장치는, 예를 들어 터치 패널, 키, 초음파 입력 장치를 포함할 수 있다. 터치 패 널은, 예를 들면, 정전식, 감압식, 적외선 방식, 또는 초음파 방식 중 적어도 하나의 방식을 사용할 수 있다. 또한, 터치 패널은 제어 회로를 더 포함할 수도 있다. 키는, 예를 들면, 물리적인 버튼, 광 학식 키, 또는 키패드를 포함할 수 있다. 초음파 입력 장치는 마이크를 통해, 입력 도구에서 발생된 초음 파를 감지하여, 상기 감지된 초음파에 대응하는 데이터를 확인할 수 있다. 입력 장치를 통하여 무인 비행 전자 장치의 제어 입력을 수신할 수 있다. 예를 들어, 물리 전원 키가 눌러지면, 무인 비행 전자 장치의 전원을 차단 할 수 있다. 센서 모듈은 피사체의 모션 및/또는 제스처를 감지할 수 있는 제스처 센서(gesture sensor), 비행 하는 무인 촬영 장치의 각속도를 측정할 수 있는 자이로 센서(gyro sensor), 대기의 압력 변화 및/또는 기압을 측정할 수 있는 기압 센서(barometer), 지구 자기장을 측정할 수 있는 마그네틱 센서(지자 기 센서,terrestrial magnetism sensor, compass sensor), 비행하는 전자 장치의 가속도를 측정하는 가속도 센 서(acceleration sensor), 물체의 근접 상태, 파지 여부를 판단할 수 있는 그립 센서, 거리를 측 정하는 근접센서(초음파를 출력하여 물체에서 반사되는 신호를 측정하여 거리를 측정할 수 있는 초음파 센서(ultrasonic sensor)를 포함), 바닥 지형이나 무늬를 인지하여 위치를 산출할 수 있는 광학 센서 (OFS, 옵티컬 플로(optical flow)), 사용자의 인증을 위한 생체 센서, 온도 및 습도를 측정할 수 있는 온/습도 센서(temperature-humidity sensor), 조도를 측정할 수 있는 조도 센서, 자외선을 측정할 수 있는 UV(ultra violet) 센서들의 일부 또는 전부를 포함할 수 있다. 다양한 실시예에 따른 센 서 모듈은 무인 비행 전자 장치의 자세를 계산할 수 있다. 무인 비행 전자 장치의 자세 정보 를 이동 제어 모듈에 공유 할 수 있다. 메모리는 내장 메모리 및 외장 메모리를 포함할 수 있다. 무인 비행 전자 장치의 적어 도 하나의 다른 구성요소에 관계된 명령(command) 또는 데이터(data)를 저장할 수 있다. 메모리는 소프 트웨어(software) 및/또는 프로그램(program)을 저장할 수 있다. 프로그램은 커널(kernel), 미들웨어 (middleware), 어플리케이션 프로그래밍 인터페이스(application programming interface(API)) 및/또는 어플리케이션 프로그램 (또는 \"어플리케이션\") 등을 포함할 수 있다. 오디오 모듈은, 예를 들면, 소리와 전기 신호를 쌍방향으로 변환시킬 수 있다. 스피커, 마이크를 포함할 수 있으며, 입력 또는 출력되는 소리 정보를 처리할 수 있다. 인디케이터는 전자 장치 또는 그 일부(예: 프로세서)의 특정 상태, 예를 들면, 동작 상태, 또는 충전 상 태 등을 표시할 수 있다. 또는 전자 장치의 비행 상태, 동작 모드를 표시할 수 있다. 전력 관리 모듈은, 예를 들면, 전자 장치의 전력을 관리할 수 있다. 한 실시예에 따르면, 전력 관리 모듈 은 PMIC(power management integrated circuit), 충전 IC, 또는 배터리 또는 연료 게이지를 포함할 수 있다. PMIC는, 유선 및/또는 무선 충전 방식을 가질 수 있다. 무선 충전 방식은, 예를 들면, 자기공명 방식, 자기유도 방식 또는 전자기파 방식 등을 포함하며, 무선 충전을 위한 부가적인 회로, 예를 들면, 코일 루프, 공진 회로, 또는 정류기 등을 더 포함할 수 있다. 배터리 게이지는, 예를 들면, 배터리의 잔량, 충전 중 전압, 전류, 또는 온도를 측정할 수 있다. 배터리는, 예를 들면, 충전식 전지를 포함할 수 있다. 카메라 모듈은 무인 비행 전자 장치에 구성되거나 무인 비행 전자 장치가 짐벌을 포함할 경 우 짐벌 모듈에 구성 될 수 있다. 카메라 모듈은 렌즈, 이미지 센서, 이미지 처리부, 카메라 제어 부를 포함할 수 있다. 카메라 제어부는 프로세서에서 출력되는 구도정보 및/또는 카메라 제어정보에 기반하여 카메라 렌즈의 상하좌우 각도를 조절하여 피사체와의 구도 및/또는 카메라 앵글(촬영 각도)을 조절할 수 있다. 이미지 센서는 로우 드라이버, 픽셀 어레이 및 컬럼 드라이버 등을 포함할 수 있다. 이미지 처리부는 이미지 전 처리부, 이미지 후처리부, 정지 영상 코덱, 동영상 코덱 등을 포함할 수 있다. 이미지 처리부는 프로세서에 포 함될 수도 있다. 카메라 제어부는 포커싱 및 트래킹 등을 제어할 수 있다. 카메라 모듈은 촬영 모드에서 촬영 동작을 수행할 수 있다. 카메라 모듈은 무인 비행 전자 장치 의 움직임에 일정 부분 영향을 받을 수 있다. 무인 비행 전자 장치의 움직임에 따른 카메라 모듈 의 촬영 변화를 최소화 하기 위하여, 상기 카메라 모듈은 짐벌 모듈에 위치할 수 있다. 이동 제어 모듈은 무인 비행 전자 장치의 위치 및 자세 정보들을 이용하여 무인 비행 전자 장치 의 자세 및 이동을 제어할 수 있다. 이동 제어 모듈은 획득되는 위치 및 자세정보에 따라 무인 비 행 전자 장치의 롤(roll), 피치(pitch), 요(yaw), 트로틀(throttle) 등을 제어할 수 있다. 이동 제어 모 듈은 호버링 비행 동작 및 프로세서에 제공되는 자율 비행 커맨드(거리 이동, 고도 이동 수평 및 방위각 커맨드 등)에 기반하여 자율 비행 동작 제어, 수신된 사용자 입력 커맨드에 따른 비행 동작 제어를 할 수 있다. 예를 들어, 이동 모듈이 쿼드콥터인 경우 일 수 있으며, 복수의 서브 이동 제어 모듈(MPU, microprocessor unit), 모터 구동 모듈, 모터 모듈 및 프로펠러를 포함할 수 있다. 서브 이 동 제어 모듈(MPU)은 비행 동작 제어에 대응하여 프로펠러를 회전시키기 위한 제어 데이터를 출력 할 수 있다. 모터 구동 모듈은 이동 제어 모듈의 출력에 대응되는 모터 제어 데이터를 구동 신호로 변환하여 출력할 수 있다. 모터 모듈(또는 모터)은 각각 대응되는 모터 구동 모듈의 구동 신호에 기반하여 대응되는 프로펠러 회전을 제어할 수 있다. 짐벌 모듈은, 예를 들어 짐벌 제어 모듈, 자이로 센서, 가속도 센서, 짐벌 모터 구동 모듈, 모터를 포함할 수 있다. 카메라 모듈은 짐벌 모듈에 포함 될 수 있다. 짐벌 모듈은 무인 비행 전자 장치의 움직임에 따른 보상 데이터를 생성할 수 있다. 보상 데이터는 카메라 모듈의 피치 또는 롤의 적어도 일부를 제어하기 위한 데이터일 수 있다. 예를 들어, 롤 모터 및 피치 모 터는 무인 비행 전자 장치의 움직임에 따라 카메라 모듈의 롤 및 피치를 보상할 수 있다. 카 메라 모듈은 짐벌 모듈에 장착되어, 무인 비행 전자 장치(예를들면, 멀티콥터)의 회전(예: 피치 및 롤)에 의한 움직임을 상쇄시켜 카메라 모듈의 정립 상태로 안정화시킬 수 있다. 짐벌 모듈(360 0)은 무인 비행 전자 장치의 움직임에 관계없이 카메라 모듈을 일정한 기울기를 유지할 수 있도록 하여 안정적인 이미지를 촬영할 수 있다. 짐벌 제어 모듈은 자이로 센서 및 가속도 센서를 포함하는 센서 모듈을 포함 할 수 있다. 짐벌 제어 모듈은 자이로 센서 및 가속도 센서를 포 함하는 센서의 측정 값을 분석하여 짐벌 모터 구동 모듈의 제어 신호를 생성하고, 짐벌 모듈의 모 터를 구동할 수 있다. 도 21은 다양한 실시 예에 따른 무인 비행 전자 장치의 프로그램 모듈(플랫폼 구조)를 도시하는 도면이다. 도 21을 참조하면, 무인 비행 전자 장치는 어플리케이션 플랫폼(application platform) 또는 플라이트 플 랫폼(flight platform)을 포함할 수 있다. 무인 비행 전자 장치는 무선으로 연동하여 제어 신호를 받아 무인 비행 전자 장치의 구동 및 서비스 제공을 하기 위한 어플리케이션 플랫폼과 항법 알고리즘에 따라 비행을 제어하기 위한 플라이트 플랫폼 등을 적어도 하나 이상 포함할 수 있다. 어플리케이션 플랫폼은 전자장치의 구성 요소들의 통신 제어(connectivity), 영상 제어, 센서 제어, 충전 제어, 또는 사용자 어플리케이션에 따른 동작 변경 등을 수행할 수 있다. 어플리케이션 플랫폼은 프로세서에서 실행할 수 있다. 플라이트 플랫폼은 전자장치의 비행, 자세 제어 또는 항법 알고리즘을 실행할 수 있다. 플라이트 플랫 폼은 프로세서 또는 이동 제어 모듈에서 실행될 수 있다. 어플리케이션 플랫폼에서 통신, 영상, 센서, 충전 제어를 등을 수행하면서 플라이트 플랫폼에 조종 신호를 전달 할 수 있다. 다양한 실시 예에 따르면, 프로세서는 카메라 모듈을 통하여 촬영된 피사체를 이미지를 획득할 수 있다. 프로세 서는 획득한 이미지를 분석하여 무인 비행 전자 장치를 비행 조종하기 위한 커맨드를 생성할 수 있다. 예 를 들어, 프로세서는 획득되는 피사체의 크기 정보, 이동 상태, 촬영 장치와 피사체 간의 상대적인 거리 및 고 도, 방위각 정보를 생성할 수 있다. 산출된 정보를 이용하여, 무인 비행 전자 장치의 추적 비행(follow) 조종 신호를 생성할 수 있다. 플라이트 플랫폼은 수신한 조종 신호를 토대로 이동 제어 모듈을 제어하여 무인 비행 전자 장치를 비행(무인 비행 전자 장치의 자세 및 이동 제어)을 할 수 있다. 다양한 실시 예에 따르면, 프로세서는 GPS 모듈, 센서 모듈을 통해 무인 비행 전자 장치의 위치, 비행 자 세, 자세 각속도 및 가속도 등을 측정할 수 있다. GPS 모듈 및 센서 모듈의 출력 정보는 생성할 수 있으며, 전 자장치의 항법/자동 조종을 위한 조종 신호의 기본 정보가 될 수 있다. 무인 촬영 장치의 비행에 따른 기압 차 를 통해 고도를 측정할 수 있는 기압 센서, 저고도에서 정밀한 고도 측정을 수행하는 초음파 센서들의 정보도 기본 정보로 활용 될 수 있다. 그 외에도 원격 컨트롤러에서 수신한 조종 데이터 신호, 또는 무인 비행 전자 장 치의 배터리 상태정보 등도 조종 신호의 기본 정보로 활용 될 수 있다. 무인 비행 전자 장치는 예를 들어, 적어도 하나의 프로펠러들을 이용하여 비행할 수 있다. 프로펠러는 모 터의 회전력을 추진력을 변경할 수 있다. 무인 비행 전자 장치는 로터(rotor)의 수(프로펠러의 수)에 따 라, 4개이면 쿼드콥터, 6개이면 헥사콥터, 8개이면 옥토콥터라 칭할 수 있다. 전자장치는 수신한 조종 신호를 토대로 프로펠러를 제어 할 수 있다. 전자장치는 리프트/토크(lift/torque)의 두 가지 원리로 비행할 수 있다. 무인 비행 전자 장치는 회전을 위해 멀티 프로펠러의 반은 시계 방향 (clockwise; CW )으로 회전시키고 반은 반시계 방향(counter clockwise; CCW )로 회전 시킬 수 있다. 드론의 비행에 따른 3차원 좌표는 pitch(Y)/roll(X)/yaw(Z)에 결정될 수 있다. 전자장치는 전후/좌우로 기울임 (tilting)으로써 비행할 수 있다. 무인 비행 전자 장치를 기울이면 프로펠러 모듈(로터)에서 생성된 공기 의 흐름의 방향이 바뀌게 될 수 있다. 예를 들면, 무인 비행 전자 장치가 앞으로 숙이면 공기가 위아래로 흐를 뿐 아니라 약간 뒤 쪽으로 나가게 될 수 있다. 이로 인해 무인 비행 전자 장치는 공기 층이 뒤로 밀 리는 만큼 작용/반작용의 법칙에 따라 기체가 앞으로 전진할 수 있다. 무인 비행 전자 장치는 기울이는 방법은 해당 방향의 앞쪽은 속도를 줄이고 뒤쪽의 속도를 높여주면 될 수 있다. 이런 방법은 모든 방향에 대하 여 공통이기 때문에 모터 모듈(로터)의 속도 조절만으로 무인 비행 전자 장치를 기울여 이동시킬 수 있다. 무인 비행 전자 장치는 어플리케이션 플랫폼에서 생성된 조종 신호를 플라이트 플랫폼에서 수신하여, 모 터 모듈을 제어함으로써 무인 비행 전자 장치의 pitch(Y)/roll(X)/yaw(Z)을 자세 제어 및 이동 경로에 따 른 비행 제어를 할 수 있다. 본 문서에서 사용된 용어 \"모듈\"은, 예를 들면, 하드웨어, 소프트웨어 또는 펌웨어(firmware) 중 하나 또는 둘 이상의 조합을 포함하는 단위(unit)를 의미할 수 있다. \"모듈\"은, 예를 들면, 유닛(unit), 로직(logic), 논리 블록(logical block), 부품(component), 또는 회로(circuit) 등의 용어와 바꾸어 사용(interchangeably use)될 수 있다. \"모듈\"은, 일체로 구성된 부품의 최소 단위 또는 그 일부가 될 수 있다. \"모듈\"은 하나 또는 그 이상 의 기능을 수행하는 최소 단위 또는 그 일부가 될 수도 있다. \"모듈\"은 기계적으로 또는 전자적으로 구현될 수 있다. 예를 들면, \"모듈\"은, 알려졌거나 앞으로 개발될, 어떤 동작들을 수행하는 ASIC(application-specific integrated circuit) 칩, FPGAs(field-programmable gate arrays) 또는 프로그램 가능 논리 장치 (programmable-logic device) 중 적어도 하나를 포함할 수 있다. 다양한 실시 예에 따른 장치(예: 모듈들 또는 그 기능들) 또는 방법(예: 동작들)의 적어도 일부는, 예컨대, 프 로그램 모듈의 형태로 컴퓨터로 읽을 수 있는 저장매체(computer-readable storage media)에 저장된 명령어로 구현될 수 있다. 상기 명령어가 프로세서에 의해 실행될 경우, 상기 하나 이상의 프로세서가 상기 명령어에 해 당하는 기능을 수행할 수 있다. 컴퓨터로 읽을 수 있는 저장매체는, 예를 들면, 메모리가 될 수 있다. 컴퓨터로 판독 가능한 기록 매체는, 하드디스크, 플로피디스크, 마그네틱 매체(magnetic media)(예: 자기테이프), 광기록 매체(optical media)(예: CD-ROM, DVD(Digital Versatile Disc), 자기-광 매체(magneto- optical media)(예: 플롭티컬 디스크(floptical disk)), 하드웨어 장치(예: ROM, RAM, 또는 플래시 메모리 등) 등을 포함할 수 있다. 또한, 프로그램 명령에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함할 수 있다. 상술한 하드웨어 장치는 다양한 실시 예의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지다. 다양한 실시 예에 따른 모듈 또는 프로그램 모듈은 전술한 구성요소들 중 적어도 하나 이상을 포함하거나, 일부 가 생략되거나, 또는 추가적인 다른 구성요소를 더 포함할 수 있다. 다양한 실시 예에 따른 모듈, 프로그램 모 듈 또는 다른 구성요소에 의해 수행되는 동작들은 순차적, 병렬적, 반복적 또는 휴리스틱(heuristic)한 방법으 로 실행될 수 있다. 또한, 일부 동작은 다른 순서로 실행되거나, 생략되거나, 또는 다른 동작이 추가될 수 있다. 그리고 본 문서에 개시된 실시 예는 개시된, 기술 내용의 설명 및 이해를 위해 제시된 것이며, 본 발명의 범위 를 한정하는 것은 아니다. 따라서, 본 문서의 범위는, 본 발명의 기술적 사상에 근거한 모든 변경 또는 다양한 다른 실시 예를 포함하는 것으로 해석되어야 한다."}
{"patent_id": "10-2016-0170042", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시 예에 따른 무선 비행 장치 운행 환경의 한 예를 나타낸 도면이다. 도 2는 본 발명의 실시 예에 따른 전자 장치의 한 예를 나타낸 도면이다. 도 3은 본 발명의 실시 예에 따른 프로세서의 한 예를 나타낸 도면이다. 도 4는 본 발명의 실시 예에 따른 비행 장치의 한 예를 나타낸 도면이다. 도 5는 본 발명의 실시 예에 따른 비행 장치 프로세서의 한 예를 나타낸 도면이다. 도 6은 본 발명의 실시 예에 따른 무인 비행 장치 운행 환경에서의 장치 간 신호 흐름의 한 예를 나타낸 도면이 다. 도 7은 본 발명의 실시 예에 따른 유효 범위의 한 예를 나타낸 도면이다. 도 8은 본 발명의 실시 예에 따른 유효 범위의 다른 예를 나타낸 도면이다. 도 9는 본 발명의 실시 예에 따른 유효 범위 변경의 한 예를 나타낸 도면이다. 도 10은 본 발명의 실시 예에 따른 유효 범위 변경의 다른 예를 나타낸 도면이다. 도 11은 본 발명의 실시 예에 따른 유효 범위 변경의 또 다른 예를 나타낸 도면이다. 도 12는 본 발명의 실시 예에 따른 카메라와 연결된 전자 장치의 유효 범위 운용의 한 예를 나타낸 도면이다.도 13은 본 발명의 실시 예에 따른 카메라 기반 비행 장치의 유효 범위 운행과 관련하여, 장치들간의 신호 흐름 의 한 예를 나타낸 도면이다. 도 14는 본 발명의 실시 예에 따른 카메라 기반의 유효 범위 운행과 관련하여 장치들간의 신호 흐름의 한 예를 나타낸 도면이다. 도 15는 본 발명의 실시 예에 따른 유효 범위 운행과 관련한 화면 인터페이스의 한 예를 나타낸 도면이다. 도 16은 본 발명의 한 실시 예에 따른 무인 비행 장치의 운행과 관련한 전자 장치 운용 방법의 한 예를 나타낸 도면이다. 도 17은 본 발명의 실시 예에 따른 무인 비행 장치의 운행과 관련한 비행 장치 운용 방법의 한 예를 나타낸 도 면이다. 도 18은 본 발명의 실시 예에 따른 무인 비행 전자 장치와 원격 제어기의 한 예를 나타낸 도면이다. 도 19는 다양한 실시 예에 따른 무인 비행 전자 장치의 한 예를 나타낸 도면이다. 도 20은 다양한 실시 예에 따른 무인 비행 전자 장치의 다른 예를 나타낸 도면이다. 도 21은 다양한 실시 예에 따른 무인 비행 전자 장치의 프로그램 모듈(플랫폼 구조)를 도시하는 도면이다."}
