{"patent_id": "10-2023-0104880", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0127943", "출원번호": "10-2023-0104880", "발명의 명칭": "가상환경에 연결된 사용자 단말에게 알람을 제공하기위한 방법", "출원인": "(주) 어나더리얼", "발명자": "김현주"}}
{"patent_id": "10-2023-0104880", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "방법."}
{"patent_id": "10-2023-0104880", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 일 실시예에 따른 가상환경에 연결된 사용자 단말에게 알람을 제공하기 위한 방법이 개시된다. 상기 방법은, 상기 가상환경이 아닌 외부환경에서 발생된 신호를 획득하는 단계; 및 상기 신호에 대응하는 알람 정보 의 표시 기준을 정의하는 알람 표시 알고리즘에 기초하여, 상기 사용자 단말에서 상기 알람 정보가 표시되도록, 상기 알람 정보를 상기 가상환경 또는 상기 사용자 단말 중 적어도 하나로 전송하는 단계; 를 포함하는 방법일 수 있다."}
{"patent_id": "10-2023-0104880", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 정보 처리 분야에 관한 것으로, 보다 구체적으로 가상환경에 연결된 사용자 단말에게 알람을 제공하 기 위한 방법에 관한 것이다."}
{"patent_id": "10-2023-0104880", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "IoT(Internet of Things)기술의 발전으로 다양한 IoT 디바이스들이 상용화되고, 이러한 IoT 디바이스들은 서로 통신하고, 정보를 상호 교환하여 사용자에게 편리한 서비스들을 제공하고 있다. 예를 들어, 일반 가정에서 사용되는 IoT 디바이스에는 스마트TV, 스마트냉장고, 스마트청소기, 스마트세탁기, 스마트건조기, 스마트도어벨 등의 기기들이 있을 수 있다. 열거된 디바이스들은 서로 통신하여 각자의 정보를 다른 디바이스로 송신하고 그리고 다른 디바이스의 정보를 수신할 수 있다. 구체적으로 예를 들어, 스마트세탁 기는 빨래가 완료된 후, 빨래가 완료되었다는 정보를 스마트냉장고 등에 전송할 수 있다. 마찬가지로, 스마트도 어벨은 스마트도어벨을 클릭한 방문자가 있다는 정보를 스마트TV로 전송하여 스마트TV를 시청중인 사용자가 문 앞에 방문자가 있다는 알림을 받아볼 수 있게 한다. 위에 열거된 디바이스들의 동작으로 사용자는 사용자가 현 시점에서 사용하고 있지 않은 디바이스와 관련된 정 보를 현 시점에서 사용하고 있는 디바이스를 통해 수신할 수 있다. 컴퓨터 기술의 발전으로 IoT기술에 가상 현실(Virtual Reality), 증강 현실(Augmented Reality) 그리고 혼합 현실(Mixed Reality)등의 가상세계를 표현하는 기술이 융합되어 여러 산업 및 일상생활에 적용되고 있다. 이러한 가상세계를 표현하는 기술에는 가상세계를 가시화시켜줄 수 있는 디스플레이가 필요로 한다. 일례로, 사 용자가 안경처럼 머리에 착용할 수 있는 헤드 마운트 디스플레이(Head Mount Display), 스마트폰, 3D 디스플레 이 등의 디바이스가 가상세계를 가시화시켜줄 디스플레이로서 사용될 수 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허공보 제 10-2015-0007130 호"}
{"patent_id": "10-2023-0104880", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 전술한 배경기술에 대응하여 안출된 것으로, 가상환경에 연결된 사용자 단말에게 가상환경이 아닌 외 부환경에서 수신된 신호에 대응하는 알람을 제공하고자 한다. 본 개시의 기술적 과제들은 이상에서 언급한 기술적 과제로 제한되지 않으며, 언급되지 않은 또 다른 기술적 과 제들은 아래의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0104880", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시예에 따른 제 1 컴퓨팅 장치에 의해 수행되는, 가상환경에 연결된 사용자 단말에게 알람을 제 공하기 위한 방법이 개시된다. 상기 방법은, 상기 가상환경이 아닌 외부환경에서 발생된 신호를 획득하는 단계 및 상기 신호에 대응하는 알람 정보의 표시 기준을 정의하는 알람 표시 알고리즘에 기초하여, 상기 사용자 단말 의 상기 가상환경에서의 사용자 인터페이스 상에서 상기 알람 정보가 표시되도록, 상기 알람 정보를 상기 가상 환경을 제공하는 제 2 컴퓨팅 장치로 전송하는 단계를 포함할 수 있다. 일 실시예에 따른 상기 알람 표시 알고리즘은, 상기 사용자 단말로부터 획득되는 사전 결정된 우선순위, 상기 사용자의 위치 정보 또는 상기 사용자의 유형 정보 중 적어도 하나에 기초하여 사전 학습된 인공지능 기반의 모 델을 포함할 수 있다. 일 실시예에 따른 상기 우선순위는, 상기 사용자에 의해 사전 설정된 상기 알람 정보의 유형에 따른 중요도 등 급 및 상기 사용자에 의해 사전 설정된 상기 알람 정보의 유형에 따른 알람 정보를 제공하는 시점 중 적어도 하 나를 포함할 수 있다. 일 실시예에 따른 상기 사전 학습된 인공지능 기반의 모델은, 상기 사용자에 의해 설정된 우선순위를 포함하는 학습 데이터에 기초하여 사전 학습되고, 그리고 상기 사전 학습의 결과에 기초하여 상기 우선순위를 자동으로 결정할 수 있다. 일 실시예에 따른 상기 알람 정보의 유형에 따른 상기 중요도 등급은 상기 가상환경의 사용자 인터페이스 상에 서 설정 가능할 수 있다. 그리고 상기 알람 정보의 유형에 따른 상기 중요도 등급이 설정되는 경우, 상기 알람 정보의 유형 및 상기 알람 정보의 유형에 대응되는 중요도 등급에 기초하여, 상기 유형의 알람 정보가 상기 가 상환경을 제공하는 제 2 컴퓨팅 장치로 전송되는 시점이 결정될 수 있다. 일 실시예에 따른 상기 알람 표시 알고리즘은, 상기 사용자의 위치 정보와 상기 알람 정보의 유형에 대응하는 위치 정보 사이의 거리에 기초하여 상기 알람 정보의 표시 기준을 자동으로 정의할 수 있다. 일 실시예에 따른 상기 사용자의 유형 정보는, 상기 사용자 단말로부터 획득된 생체정보 또는 특정 제스쳐 (gesture)에 대응하는 사용자 인증이 완료된 후에 획득되는 사용자 개인 정보를 포함할 수 있다. 일 실시예에 따른 상기 사전 학습된 인공지능 기반의 모델은, 상기 사용자 단말이 연결된 가상환경에 기초하여 결정되는, 상기 가상환경의 특성을 나타내는 가상환경의 유형 정보에 추가로 기초하여 사전 학습될 수 있다. 일 실시예에 따른 상기 알람 정보의 표시 기준은, 상기 알람 정보의 상기 사용자 단말에 표시되는 시점에 대응 하는 알람 시간, 상기 중요도 등급에 기초한 스케줄링 순서, 상기 중요도 등급에 기초한 알람 횟수 및 상기 중 요도 등급에 기초한 상기 사용자 인터페이스 상에서 알람이 표시되는 방식에 대응하는 물리적 속성을 포함할 수 있다. 일 실시예에 따른 상기 사용자 단말이 상기 가상환경이 아닌 다른 가상환경에 연결된 상태에서도 상기 가상환경 과 연결되었을 때 적용되는 상기 알람 표시 알고리즘이 적용될 수 있다. 일 실시예에 따른 상기 방법은, 상기 사용자 단말로부터 상기 외부환경과 관련된 상기 신호를 생성한 제 3 컴퓨 팅 장치를 제어하기 위한 음성 또는 제스쳐를 획득하는 단계, 상기 획득된 음성 또는 제스쳐에 기초하여 상기 제 3 컴퓨팅 장치를 제어하기 위한 제어 정보를 생성하는 단계 및 상기 생성된 제어 정보를 상기 제 3 컴퓨팅 장치로 전송하는 단계를 더 포함할 수 있다. 본 개시의 또다른 실시예에 따른 가상환경에 연결된 사용자 단말에 의해 수행되는, 사용자에게 알람을 제공하기 위한 방법이 개시된다. 상기 방법은, 상기 가상환경이 아닌 외부환경에서 발생된 신호에 대응하는 알람 정보의 표시 기준을 정의하는 알람 표시 알고리즘에서 사용될 데이터를 생성하는 단계 및 상기 사용자 단말의 상기 가 상환경에서의 사용자 인터페이스 상에서 상기 알람 정보에 대응하는 알람을 출력하는 단계를 포함할 수 있다. 일 실시예에 따른 상기 데이터를 생성하는 단계는, 상기 알람 정보의 유형을 선택하는 제 1 사용자 액션을 획득 하는 단계, 상기 제 1 사용자 액션에 후속하여, 상기 알람 정보의 중요도 등급을 선택하는 제 2 사용자 액션을 획득하는 단계 및 상기 사용자의 개인 정보를 제공하기 위한 제 3 사용자 액션을 획득하는 단계에 기초하여 수 행될 수 있다.일 실시예에 따른 상기 제 1 사용자 액션은, 상기 알람 정보의 유형에 대응하는 명칭에 대한 호명하는 제 1 사 용자 액션 또는 상기 가상환경의 사용자 인터페이스 상에서 상기 가상환경의 포인터 객체에 의해 상기 알람 정 보의 유형에 대응하는 이미지 또는 좌표를 선택하는 제 1 사용자 액션을 포함할 수 있다. 일 실시예에 따른 상기 제 2 사용자 액션은, 상기 가상환경의 사용자 인터페이스 상에서 상기 가상환경의 포인 터 객체에 의해 상기 중요도 등급의 등급별 좌표 또는 정수로 표현된 특정 등급을 선택하는 제 2 사용자 액션 또는 상기 정수로 표현된 특정 등급에 대응하는 사용자의 음성 메시지를 제공하는 제 2 사용자 액션을 포함할 수 있다. 일 실시예에 따른 상기 데이터를 생성하는 단계는, 상기 외부환경과 관련된 상기 신호를 생성한 제 3 컴퓨팅 장 치를 제어하기 위한 제 4 사용자 액션을 획득하는 단계에 추가적으로 기초하여 수행될 수 있다. 본 개시의 또다른 실시예에 따른 가상환경이 아닌 외부환경에서 발생한 신호에 대응하는 알람을 제공하는 사용 자 단말이 개시된다. 상기 사용자 단말은, 상기 알람의 표시 기준을 정의하기 위한 알람 표시 알고리즘을 한정 하거나 상기 외부환경과 관련된 상기 신호를 생성한 제 3 컴퓨팅 장치를 제어하는 정보를 획득하는 입력부, 상 기 가상환경과 관련된 이미지 또는 영상, 상기 알람 및 상기 알람과 관련된 정보를 제공하는 출력부 및 상기 사 용자 단말의 동작을 제어하기 위한 적어도 하나의 프로세서를 포함할 수 있다. 그리고 상기 적어도 하나의 프로 세서는, 상기 가상환경이 아닌 외부환경에서 발생된 신호에 대응하는 알람 정보의 표시 기준을 정의하는 알람 표시 알고리즘에서 사용될 데이터를 생성하는 동작 및 상기 사용자 단말의 상기 가상환경에서의 사용자 인터페 이스 상에서 상기 알람 정보에 대응하는 알람을 출력하는 동작을 수행할 수 있다."}
{"patent_id": "10-2023-0104880", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 일 실시예에 따른 제 1 컴퓨팅 장치에 의해 수행되는, 가상환경에 연결된 사용자 단말에게 알람을 제 공하기 위한 방법이 개시된다. 상기 방법은, 상기 가상환경이 아닌 외부환경에서 발생된 신호를 획득하는 단계 및 상기 신호에 대응하는 알람 정보의 표시 기준을 정의하는 알람 표시 알고리즘에 기초하여, 상기 사용자 단말 의 상기 가상환경에서의 사용자 인터페이스 상에서 상기 알람 정보가 표시되도록, 상기 알람 정보를 상기 가상 환경을 제공하는 제 2 컴퓨팅 장치로 전송하는 단계를 포함할 수 있다. 일 실시예에 따른 상기 알람 표시 알고리즘은, 상기 사용자 단말로부터 획득되는 사전 결정된 우선순위, 상기 사용자의 위치 정보 또는 상기 사용자의 유형 정보 중 적어도 하나에 기초하여 사전 학습된 인공지능 기반의 모 델을 포함할 수 있다. 일 실시예에 따른 상기 우선순위는, 상기 사용자에 의해 사전 설정된 상기 알람 정보의 유형에 따른 중요도 등 급 및 상기 사용자에 의해 사전 설정된 상기 알람 정보의 유형에 따른 알람 정보를 제공하는 시점 중 적어도 하 나를 포함할 수 있다. 일 실시예에 따른 상기 사전 학습된 인공지능 기반의 모델은, 상기 사용자에 의해 설정된 우선순위를 포함하는 학습 데이터에 기초하여 사전 학습되고, 그리고 상기 사전 학습의 결과에 기초하여 상기 우선순위를 자동으로 결정할 수 있다. 일 실시예에 따른 상기 알람 정보의 유형에 따른 상기 중요도 등급은 상기 가상환경의 사용자 인터페이스 상에 서 설정 가능할 수 있다. 그리고 상기 알람 정보의 유형에 따른 상기 중요도 등급이 설정되는 경우, 상기 알람 정보의 유형 및 상기 알람 정보의 유형에 대응되는 중요도 등급에 기초하여, 상기 유형의 알람 정보가 상기 가 상환경을 제공하는 제 2 컴퓨팅 장치로 전송되는 시점이 결정될 수 있다. 일 실시예에 따른 상기 알람 표시 알고리즘은, 상기 사용자의 위치 정보와 상기 알람 정보의 유형에 대응하는 위치 정보 사이의 거리에 기초하여 상기 알람 정보의 표시 기준을 자동으로 정의할 수 있다. 일 실시예에 따른 상기 사용자의 유형 정보는, 상기 사용자 단말로부터 획득된 생체정보 또는 특정 제스쳐 (gesture)에 대응하는 사용자 인증이 완료된 후에 획득되는 사용자 개인 정보를 포함할 수 있다. 일 실시예에 따른 상기 사전 학습된 인공지능 기반의 모델은, 상기 사용자 단말이 연결된 가상환경에 기초하여 결정되는, 상기 가상환경의 특성을 나타내는 가상환경의 유형 정보에 추가로 기초하여 사전 학습될 수 있다. 일 실시예에 따른 상기 알람 정보의 표시 기준은, 상기 알람 정보의 상기 사용자 단말에 표시되는 시점에 대응 하는 알람 시간, 상기 중요도 등급에 기초한 스케줄링 순서, 상기 중요도 등급에 기초한 알람 횟수 및 상기 중 요도 등급에 기초한 상기 사용자 인터페이스 상에서 알람이 표시되는 방식에 대응하는 물리적 속성을 포함할 수 있다. 일 실시예에 따른 상기 사용자 단말이 상기 가상환경이 아닌 다른 가상환경에 연결된 상태에서도 상기 가상환경 과 연결되었을 때 적용되는 상기 알람 표시 알고리즘이 적용될 수 있다. 일 실시예에 따른 상기 방법은, 상기 사용자 단말로부터 상기 외부환경과 관련된 상기 신호를 생성한 제 3 컴퓨 팅 장치를 제어하기 위한 음성 또는 제스쳐를 획득하는 단계, 상기 획득된 음성 또는 제스쳐에 기초하여 상기 제 3 컴퓨팅 장치를 제어하기 위한 제어 정보를 생성하는 단계 및 상기 생성된 제어 정보를 상기 제 3 컴퓨팅 장치로 전송하는 단계를 더 포함할 수 있다. 본 개시의 또다른 실시예에 따른 가상환경에 연결된 사용자 단말에 의해 수행되는, 사용자에게 알람을 제공하기 위한 방법이 개시된다. 상기 방법은, 상기 가상환경이 아닌 외부환경에서 발생된 신호에 대응하는 알람 정보의 표시 기준을 정의하는 알람 표시 알고리즘에서 사용될 데이터를 생성하는 단계 및 상기 사용자 단말의 상기 가 상환경에서의 사용자 인터페이스 상에서 상기 알람 정보에 대응하는 알람을 출력하는 단계를 포함할 수 있다. 일 실시예에 따른 상기 데이터를 생성하는 단계는, 상기 알람 정보의 유형을 선택하는 제 1 사용자 액션을 획득 하는 단계, 상기 제 1 사용자 액션에 후속하여, 상기 알람 정보의 중요도 등급을 선택하는 제 2 사용자 액션을 획득하는 단계 및 상기 사용자의 개인 정보를 제공하기 위한 제 3 사용자 액션을 획득하는 단계에 기초하여 수 행될 수 있다. 일 실시예에 따른 상기 제 1 사용자 액션은, 상기 알람 정보의 유형에 대응하는 명칭에 대한 호명하는 제 1 사 용자 액션 또는 상기 가상환경의 사용자 인터페이스 상에서 상기 가상환경의 포인터 객체에 의해 상기 알람 정 보의 유형에 대응하는 이미지 또는 좌표를 선택하는 제 1 사용자 액션을 포함할 수 있다. 일 실시예에 따른 상기 제 2 사용자 액션은, 상기 가상환경의 사용자 인터페이스 상에서 상기 가상환경의 포인 터 객체에 의해 상기 중요도 등급의 등급별 좌표 또는 정수로 표현된 특정 등급을 선택하는 제 2 사용자 액션 또는 상기 정수로 표현된 특정 등급에 대응하는 사용자의 음성 메시지를 제공하는 제 2 사용자 액션을 포함할 수 있다. 일 실시예에 따른 상기 데이터를 생성하는 단계는, 상기 외부환경과 관련된 상기 신호를 생성한 제 3 컴퓨팅 장 치를 제어하기 위한 제 4 사용자 액션을 획득하는 단계에 추가적으로 기초하여 수행될 수 있다. 본 개시의 또다른 실시예에 따른 가상환경이 아닌 외부환경에서 발생한 신호에 대응하는 알람을 제공하는 사용 자 단말이 개시된다. 상기 사용자 단말은, 상기 알람의 표시 기준을 정의하기 위한 알람 표시 알고리즘을 한정 하거나 상기 외부환경과 관련된 상기 신호를 생성한 제 3 컴퓨팅 장치를 제어하는 정보를 획득하는 입력부, 상 기 가상환경과 관련된 이미지 또는 영상, 상기 알람 및 상기 알람과 관련된 정보를 제공하는 출력부 및 상기 사 용자 단말의 동작을 제어하기 위한 적어도 하나의 프로세서를 포함할 수 있다. 그리고 상기 적어도 하나의 프로 세서는, 상기 가상환경이 아닌 외부환경에서 발생된 신호에 대응하는 알람 정보의 표시 기준을 정의하는 알람 표시 알고리즘에서 사용될 데이터를 생성하는 동작 및 상기 사용자 단말의 상기 가상환경에서의 사용자 인터페 이스 상에서 상기 알람 정보에 대응하는 알람을 출력하는 동작을 수행할 수 있다."}
{"patent_id": "10-2023-0104880", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "다양한 실시예들 및/또는 양상들이 이제 도면들을 참조하여 개시된다. 하기 설명에서는 설명을 목적으로, 하나 이상의 양상들의 전반적 이해를 돕기 위해 다수의 구체적인 세부사항들이 개시된다. 그러나, 이러한 양상(들)은 이러한 구체적인 세부사항들 없이도 실행될 수 있다는 점 또한 본 개시의 기술 분야에서 통상의 지식을 가진 자 에게 감지될 수 있을 것이다. 이후의 기재 및 첨부된 도면들은 하나 이상의 양상들의 특정한 예시적인 양상들을 상세하게 기술한다. 하지만, 이러한 양상들은 예시적인 것이고 다양한 양상들의 원리들에서의 다양한 방법들 중 일부가 이용될 수 있으며, 기술되는 설명들은 그러한 양상들 및 그들의 균등물들을 모두 포함하고자 하는 의도 이다. 구체적으로, 본 명세서에서 사용되는 \"실시예\", \"예\", \"양상\", \"예시\" 등은 기술되는 임의의 양상 또는 설계가 다른 양상 또는 설계들보다 양호하다거나, 이점이 있는 것으로 해석되지 않을 수도 있다. 이하, 도면 부호에 관계없이 동일하거나 유사한 구성 요소는 동일한 참조 번호를 부여하고 이에 대한 중복되는 설명은 생략한다. 또한, 본 명세서에 개시된 실시예를 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명 이 본 명세서에 개시된 실시예의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 또한, 첨부 된 도면은 본 명세서에 개시된 실시예를 쉽게 이해할 수 있도록 하기 위한 것일 뿐, 첨부된 도면에 의해 본 명 세서에 개시된 기술적 사상이 제한되지 않는다. 본 개시내용에서의 제 1, 제 2, 또는 제 3 과 같이 제 N 으로 표현되는 용어들은 적어도 하나의 엔티티들을 구 분하기 위해 사용된다. 예를 들어, 제 1 과 제 2로 표현된 엔티티들은 서로 동일하거나 또는 상이할 수 있다. 비록 제 1, 제 2 등이 다양한 구성요소들을 서술하기 위해서 사용되나, 이들 구성요소들은 이들 용어에 의해 제 한되지 않음은 물론이다. 이들 용어들은 단지 하나의 구성요소를 다른 구성요소와 구별하기 위하여 사용하는 것 이다. 따라서, 이하에서 언급되는 제 1 구성요소는 본 발명의 기술적 사상 내에서 제 2 구성요소 일 수도 있음 은 물론이다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있 다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것이다. 또 일반적으로 사용되는 사전에 정의되어 있는 용어들은 명백하게 특별히 정의되어 있지 않는 한 이상적으로 또는 과도하게 해 석되지 않는다. 더불어, 용어 \"또는\"은 배타적 \"또는\"이 아니라 내포적 \"또는\"을 의미하는 것으로 의도된다. 즉, 달리 특정되지 않거나 문맥상 명확하지 않은 경우에, \"X는 A 또는 B를 이용한다\"는 자연적인 내포적 치환 중 하나를 의미하는 것으로 의도된다. 즉, X가 A를 이용하거나; X가 B를 이용하거나; 또는 X가 A 및 B 모두를 이용하는 경우, \"X는 A 또는 B를 이용한다\"가 이들 경우들 어느 것으로도 적용될 수 있다. 또한, 본 명세서에 사용된 \"및/또는\"이라 는 용어는 열거된 관련 아이템들 중 하나 이상의 아이템의 가능한 모든 조합을 지칭하고 포함하는 것으로 이해되어야 한다. 또한, \"포함한다\" 및/또는 \"포함하는\"이라는 용어는, 해당 특징 및/또는 구성요소가 존재함을 의미하지만, 하나 이상의 다른 특징, 구성요소 및/또는 이들의 그룹의 존재 또는 추가를 배제하지 않는 것으로 이해되어야 한다. 또한, 달리 특정되지 않거나 단수 형태를 지시하는 것으로 문맥상 명확하지 않은 경우에, 본 명세서와 청구범위 에서 단수는 일반적으로 \"하나 또는 그 이상\"을 의미하는 것으로 해석되어야 한다. 더불어, 본 명세서에서 사용되는 용어 \"정보\" 및 \"데이터\"는 종종 서로 상호교환 가능하도록 사용될 수 있다. 본 개시의 목적 및 효과, 그리고 그것들을 달성하기 위한 기술적 구성들은 첨부되는 도면과 함께 상세하게 후술 되어 있는 실시예들을 참조하면 명확해질 것이다. 본 개시를 설명하는데 있어서 공지 기능 또는 구성에 대한 구 체적인 설명이 본 개시의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명을 생략할 것이다. 그리고 후술되는 용어들은 본 개시에서의 기능을 고려하여 정의된 용어들로써 이는 사용자, 운용자의 의도 또는 관례 등에 따라 달라질 수 있다. 그러나 본 개시는 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있"}
{"patent_id": "10-2023-0104880", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "다. 단지 본 실시예들은 본 개시가 완전하도록 하고, 본 개시가 속하는 기술분야에서 통상의 지식을 가진 자에 게 개시의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 개시는 청구항의 범주에 의해 정의될 뿐이다. 그러므로 그 정의는 본 명세서 전반에 걸친 내용을 토대로 내려져야 할 것이다. 본 개시에서, 컴퓨팅 장치는 통상적인 서버일 수 있다. 여기서, 서버는 네트워크 자원(resource)을 사용자가 공 유하는 시스템으로 사용자가 필요한 만큼 대여하여 원하는 시점에 네트워크를 통해 사용하는 컴퓨팅 환경일 수 있다. 이러한 서버 기반의 시스템은 퍼블릭 클라우드(Public Cloud), 사설 클라우드(Private Cloud), 하이브리 드 클라우드(Hybrid Cloud), 커뮤니티 클라우드(Community Cloud)와 같은 배치모델(Deployment Model) 또는 IaaS(Infrastructure as a Service), PaaS(Platform as a Service), SaaS(Software as a Service)와 같은 서 비스 모델(Service Model) 등을 포함할 수 있다. 다만, 본 개시에서의 컴퓨팅 장치는 이러한 서버 기반 시스템에 한정되는 것은 아니며, 중앙 집중 방식 또는 엣 지 컴퓨팅 방식에서도 본 개시내용의 실시예에 따라 구현 가능할 것이다. 추가적으로, 구현 양태에 따라서, 컴 퓨팅 장치는 사용자 단말로 구현 가능할 수도 있다. 본 개시에서, 컴퓨팅 장치는 데이터베이스 서버를 의미할 수 있다. 이러한 데이터베이스 서버는 DBMS(DataBase Management System) 및 영구 저장 매체를 포함할 수 있다. DBMS는 컴퓨팅 장치에서 필요한 데이터를 검색, 삽입, 수정 및/또는 삭제 그리고 인덱스를 생성하고 인덱스에 액세스하는 것 등과 같은 데이터베이스의 임의의 형태의 동작들을 수행하는 것을 허용하기 위한 프로그램으로서, 전술한 바와 같이, 컴퓨팅 장치의 저장부에서 프로세서에 의하여 구현될 수 있다. 영구 저장 매체는, 예를 들어 자기(magnetic) 디스크, 광학(optical) 디스크 및 광자기(magneto-optical) 저장 디바이스뿐만 아니라 플래시 메모리 및/또는 배터리-백업 메모리에 기초한 저장 디바이스와 같은, 임의의 데이 터를 지속적으로 할 수 있는 비-휘발성(non-volatile) 저장 매체를 의미할 수 있다. 이러한 영구 저장 매체는 통신부와 같은 다양한 통신 수단을 통하여 컴퓨팅 장치의 프로세서 및 저장부와 통신할 수 있다. 추가적인 실시 예에서, 이러한 영구 저장 매체는 컴퓨팅 장치 외부에 위치하여 컴퓨팅 장치와 통신 가능할 수도 있다. 본 개시 내용의 일 실시예에 따라 영구 저장 매체 및 메모리는 저장부로 통칭될 수도 있다. 추가적인 실시예에서, 본 명 세서에서의 영구 저장 매체는 저장부와 상호교환 가능하게 사용될 수도 있다. 본 개시에서, 가상환경은 메타환경, 증강현실 또는 가상현실 등의 표현과 상호 호환 가능하게 사용될 수 있다. 이하에서는 메타환경 또는 가상현실 등과 같이 현실세계가 아닌 다른 환경에 대한 용어를 가상환경으로 통칭하 여 표현하기로 한다. 예를 들어, 가상환경은 컴퓨팅 장치에 의해 구현된 현실에 기초한 시각적 정보 및/또는 청각적 정보 등을 포함 하는 가상의 세계를 의미할 수 있다. 가상환경에 대한 일례로 가상 수술 시뮬레이션, 가상 교육 시스템, 가상 운전 프로그램, 가상 현실 게임, 가상 현실을 적용한 미디어 아트 등이 포함될 수 있다. 그리고 본 개시에서, 외부환경이란 가상환경이 아닌, 가상환경에 대조되는, 컴퓨팅 장치에 의해 구현되지 않는 현실의 세계를 의미할 수 있다. 외부환경에 대한 일례로 산, 강, 바다 등의 자연환경, 도시의 거리 및 건물의 내외부(구체적으로, 가 정에서의 각 방들, 문앞, 건물에서의 복도, 엘리베이터, 옥상 등)가 포함될 수 있다. 이하, 도 1 내지 도 8을 통해 컴퓨팅 장치 또는 사용자 단말이 가상환경에 연결된 사용자 단말 또는 사용자에게 가상환경이 아닌 외부환경에서 발생된 신호에 대한 알람을 제공하는 방법 및 예시들에 대해 설명한다. 도 1은 본 개시의 몇몇 실시예에 따른 가상환경에 연결된 사용자 단말에게 알람을 제공하는 일례의 구성도이다. 도 1을 참조하면, 제 1 컴퓨팅 장치, 제 2 컴퓨팅 장치 및 제 3 컴퓨팅 장치는 서로 통신하여 데이터를 송수신할 수 있다. 그리고 제 2 컴퓨팅 장치는 사용자 단말과 통신하여 데이터를 송수신할 수 있다. 구체적으로, 제 1 컴퓨팅 장치는 가상환경에 연결된 사용자 및/또는 사용자 단말에게 알람 또는 알람 정보를 제공하기 위한 장치로서, 제 3 컴퓨팅 장치로부터 외부환경에서 발생된 신호를 획득할 수 있다. 그 리고 제 1 컴퓨팅 장치는 외부에서 발생된 신호에 대응하는 알람 정보의 표시 기준을 정의하는 알람 표시 알고리즘에 기초하여, 알람 정보를 제 2 컴퓨팅 장치 및/또는 사용자 단말로 전송할 수 있다. 그리고 제 1 컴퓨팅 장치는 사용자 단말 또는 제 2 컴퓨팅 장치로부터 수신된 신호를 제 3 컴퓨팅 장치 로 전송할 수 있다. 제 1 컴퓨팅 장치가 알람 표시 알고리즘에 기초하여 알람 정보를 전송하는 구체 적인 방법은 이하 도 2 및 도 3을 통해 설명한다. 구체적으로, 제 2 컴퓨팅 장치는 사용자 단말에 가상환경을 제공하는 장치로서, 사용자에게 알람을 제공하기 위해 제 1 컴퓨팅 장치 또는 제 3 컴퓨팅 장치로부터 외부환경에서 발생된 신호 또는 외부 환경에서 발생된 신호에 대응하는 알람 정보를 획득할 수 있다. 사용자 단말은 제 2 컴퓨팅 장치에 액세스하여 가상환경을 경험할 수 있다. 제 2 컴퓨팅 장치는 사용자 단말로 알람 정보 또는 알람 정 보에 대응하는 신호를 전송할 수 있다. 제 2 컴퓨팅 장치가 외부환경에서 발생된 신호 또는 알람 정보를 획득하고 사용자 단말로 알람 정보 또는 알람 정보에 대응하는 신호를 전송하는 구체적인 방법은 이하 도 4 및 도 5를 통해 설명한다. 구체적으로, 제 3 컴퓨팅 장치는 외부환경에서 발생된 하나 이상의 신호를 획득할 수 있다. 제 3 컴퓨팅 장치가 획득하는 신호는 제 3 컴퓨팅 장치와 유선 또는 무선으로 연결된 별도의 사물인터넷 장치(미 도시), 예를 들어, 장치에는 CCTV(폐쇄회로텔레비전), 초인종, 화재경보기, 스마트폰 또는 스마트가전 등으로부 터 생성된 외부환경과 관련된 신호일 수 있다. 예를 들어, 외부환경과 관련된 신호는 CCTV에 이상 화면이 감지 된 경우, CCTV에 감지된 이상 화면에 대응하는 감지된 정보의 유형, 이상 화면이 담긴 동영상 및/또는 이상 화 면의 일순간을 캡처한 이미지 정보 등을 포함할 수 있다. 그리고 예를 들어, 외부환경과 관련된 신호는 스마트 폰으로부터 수신된 재난문자와 같은 외부환경에서 발생한 상황에 대한 경고 등을 포함하는 SMS(단문 메시지 서 비스)와 관련된 신호를 포함할 수 있다. 앞서 열거된 제 3 컴퓨팅 장치에 연결된 별도의 사물 인터넷 장치 및 제 3 컴퓨팅 장치가 획득하는 외부환경과 관련된 신호는 예시일 뿐, 본 개시의 사물 인터넷 장치 및 외 부환경과 관련된 신호는 이에 한정되지 않음을 당업자라면 명백히 알 것이다. 그리고 제 3 컴퓨팅 장치는 획득한 신호를 제 1 컴퓨팅 장치 및/또는 제 2 컴퓨팅 장치로 전송 할 수 있고, 전송된 신호에 대응하는 회신 및/또는 제어 등의 명령을 포함하는 신호를 제 1 컴퓨팅 장치 및/또는 제 2 컴퓨팅 장치로부터 수신할 수 있다. 앞서 열거된 제 3 컴퓨팅 장치가 제 1 컴퓨팅 장치 및/또는 제 2 컴퓨팅 장치와 신호를 송수신 하는 구체적인 설명은 이하 도 2 내지 도 7을 통해 설명한다. 구체적으로, 사용자 단말은 제 2 컴퓨팅 장치와 연결되어 사용자에게 가상환경을 제공하는 소프트웨 어 프로그램을 포함하는 컴퓨팅 장치 및/또는 하드웨어 장치로서, 사용자에게 외부환경과 관련된 알람 및 정보 를 제공할 수 있다. 예를 들어, 사용자 단말은 AR장치, VR장치, 디지털 TV, 데스크탑 컴퓨터, 디지털 사이 니지, 휴대폰, 스마트폰(smart phone), 노트북 컴퓨터(laptop computer), 디지털방송용 단말기, PDA(personal digital assistants), PMP(portable multimedia player), 네비게이션, 슬레이트 PC(slate PC), 태블릿 PC(tablet PC), 울트라북(ultrabook), 웨어러블 디바이스(wearable device, 예를 들어, 워치형 단말기 (smartwatch), 글래스형 단말기 (smart glass), HMD(head mounted display)) 등이 포함될 수 있다. 본 개시의 일 실시예에 따른 제 3 컴퓨팅 장치는 외부환경과 관련된 신호를 획득하여 제 1 컴퓨팅 장치 로 전송할 수 있다. 그리고 제 1 컴퓨팅 장치는 획득된 신호에 대응하는 알람 정보를 생성하여 제 2 컴퓨팅 장치 및/또는 제 2 컴퓨팅 장치에 연결된 사용자 단말로 전송할 수 있다. 그리고 사용자 단말은 가상환경에 연결된 사용자에게 획득된 알람 정보에 대응하는 알람을 제공할 수 있다. 사용자 단말이 사용자에게 외부환경과 관련된 알람을 제공하는 구체적인 방법은 이하 도 4 및 도 5를 통해 설명한다. 도 2는 몇몇 실시예에 따른 가상환경에 연결된 사용자 단말에게 알람을 제공하는 제 1 컴퓨팅 장치의 일례를 설 명하기 위한 블록 구성도이다. 도 2를 참조하면, 제 1 컴퓨팅 장치는 프로세서, 저장부 및 통신부를 포함할 수 있다. 다 만, 상술한 구성 요소들은 제 1 컴퓨팅 장치를 구현하는데 있어서 필수적인 것은 아니어서, 제 1 컴퓨팅 장치는 위에서 열거된 구성요소들 보다 많거나, 또는 적은 구성요소들을 가질 수 있다. 본 개시의 일 실시예에 따른 프로세서는 통상적으로 제 1 컴퓨팅 장치의 동작 및 데이터를 처리할 수 있는 모든 종류의 장치를 포함할 수 있다. 예를 들어, 프로그램 내에 포함된 코드 또는 명령으로 표현된 기능을 수행하기 위해 물리적으로 구조화된 회로를 갖는, 하드웨어에 내장된 데이터 처리 장치를 의미할 수 있다. 이와 같이 하드웨어에 내장된 데이터 처리 장치의 일 예로서, 마이크로프로세서 (microprocessor), 중앙처리장치 (central processing unit: CPU), 프로세서 코어(processor core), 멀티프로세서(multiprocessor), ASIC(application-specific integrated circuit), FPGA(field programmable gate array) 등의 처리 장치를 망 라할 수 있으나, 본 발명의 범위가 이에 한정되는 것은 아니다. 예를 들어, 프로세서는 제 1 컴퓨팅 장치의 통신부를 통해 입력 또는 출력되는 신호 또는 데이터 등 을 처리하거나 저장부에 데이터를 저장 또는 삭제함으로써, 데이터를 관리 또는 처리할 수 있다. 구체적으 로, 가상환경에 연결된 사용자 단말에게 알람을 제공하기 위한 과정에 필요한 프로그램 또는 데이터 등을 획득 할 수 있다. 그리고, 프로세서는 가상환경에 연결된 사용자 단말에게 알람을 제공하기 위한 프로그램 또는 데이터 등을 저장부에 저장할 수 있다. 즉, 프로세서는 위의 과정을 포함하는 가상환경에 연결된 사 용자 단말에게 알람을 제공하기 위한 전체 과정을 제어하며, 이에 한정되는 것은 아니다. 본 개시내용의 추가적인 실시예에서, 저장부는 제 1 컴퓨팅 장치와 별개인 다른 컴퓨팅 장치(예컨대, 다른 서버 또는 다른 사용자 단말)에 포함될 수도 있다. 이러한 경우, 제 1 컴퓨팅 장치는 다른 컴퓨팅 장 치와 통신하여, 다른 컴퓨팅 장치에 포함된 저장부로부터 원하는 데이터를 획득할 수 있다. 예를 들어, 저 장부를 포함하는 알람제공 서버(미도시)가 컴퓨팅 장치와 별개로 존재할 수 있으며, 제 1 컴퓨팅 장 치는 본 개시내용의 실시예들에 따른 방법을 수행하는데 있어서 필요한 데이터를 알람제공 서버로부터 획 득할 수 있다. 본 개시의 일 실시예에 따른 저장부는 메모리 및/또는 영구저장매체를 포함할 수 있다. 메모리는 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), 멀티미디어 카드 마이크로 타입 (multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 램(Random Access Memory, RAM), SRAM(Static Random Access Memory), 롬(Read-Only Memory, ROM), EEPROM(Electrically Erasable Programmable Read-Only Memory), PROM(Programmable Read-Only Memory), 자기 메모리, 자기 디스크, 광디스크 중 적어도 하나의 타입의 저장매체를 포함할 수 있으나, 본 발명의 범위가 이에 한정되는 것 은 아니다. 본 개시의 일 실시예에 따른 제 1 컴퓨팅 장치는 통신부를 통해 제 2 컴퓨팅 장치, 제 3 컴퓨팅 장치 및 사용자 단말과 통신하여 사용자에게 알람을 제공하기 위한 신호 또는 데이터를 획득할 수 있 다. 그리고 제 1 컴퓨팅 장치는 획득된 신호 또는 데이터에 대응하는 정보를 획득된 신호와 관련된 장치로 송신할 수 있다. 그리고 일 실시예에 따른 통신부는 네트워크 접속을 위한 유/무선 인터넷 모듈을 포함할 수 있다. 본 개시의 일 실시예에 따른 제 1 컴퓨팅 장치는 사용자 단말로부터 외부환경과 관련된 신호를 생성 한 제 3 컴퓨팅 장치를 제어하기 위한 음성 및/또는 제스쳐를 획득할 수 있다. 그리고 제 1 컴퓨팅 장치 는 획득된 음성 및/또는 제스쳐에 기초하여 제 3 컴퓨팅 장치를 제어하기 위한 제어 정보를 생성하고, 생성된 제어 정보를 통신부를 통해 제 3 컴퓨팅 장치로 전송할 수 있다. 구체적으로 제어 정보는 제 3 컴퓨팅 장치와 연결된 외부환경의 컴퓨팅 장치 또는 단말 등의 장치로부터 획득된 신호와 관 련되는 추가적인 정보를 전송할 것을 요구하는 정보 또는 외부환경의 컴퓨팅 장치 또는 단말의 동작을 한정하거 나 기 설정된 동작을 수행하도록 하는 제어 정보를 포함할 수 있다. 구체적으로, 사용자 단말은 기 설정된 예약어를 포함하는 음성메시지(예를 들어, \"지니야\", \"헤이 지니\" 등)를 획득할 수 있다. 그리고 사용자 단말은 제 3 컴퓨팅 장치를 제어하기 위한 음성메시지(예를 들 어, \"119에 전화를 걸어\", \"문을 열어\", \"TV를 꺼줘\" 등)을 획득할 수 있다. 또는, 사용자 단말은 기 설정된 예약어를 포함하는 제스쳐(손 또는 팔등의 신체 일부를 이용하여 허공에 Z 또는 N등의 기 설정된 예약어를 그리는 행위 등)를 획득할 수 있다. 그리고 사용자 단말은 제 3 컴퓨팅 장 치를 제어하기 위한 제스쳐(예를 들어, 사용자의 신체 일부를 이용하여 허공에 특정한 도형 등의 기 설정 된 예약어를 그리는 행위 또는, 사용자 인터페이스 상에서, 기 설정된 예약어를 획득한 이후에 명령을 획득하기 위해 그려진 이미지 등을 선택하는 행위)를 획득할 수 있다. 그리고, 사용자 단말은 획득된 음성메시지 또는 제스쳐에 대응하는 명령(신호 또는 데이터)을 제 2 컴퓨팅 장치를 거쳐 제 1 컴퓨팅 장치로 전송하고 제 1 컴퓨팅 장치는 획득된 명령을 제 3 컴퓨팅 장치 로 전송할 수 있다. 또는 사용자 단말은 명령을 제 3 컴퓨팅 장치로 직접 보낼 수 있다. *88그리고 명령을 획득한 제 3 컴퓨팅 장치는 명령에 대응하여, 제 3 컴퓨팅 장치에 연결된, 스마트 폰을 이용하여 119에 전화를 걸거나, 스마트도어벨을 이용하여 문을 열거나, 실행중인 장치(TV, 스피커, 가전제 품 등)를 중지시키거나 정지상태인 장치를 실행시키는 제어를 수행할 수 있다. 본 개시의 일 실시예에 따른 제 1 컴퓨팅 장치가 가상환경에 연결된 사용자 단말에게 알람을 제공하기 위 한 구체적인 방법은 이하 도 3을 통해 설명한다. 도 3은 본 개시의 몇몇 실시예에 따른 제 1 컴퓨팅 장치의 가상환경에 연결된 사용자에게 알람을 제공하는 일례 의 방법의 흐름도이다. 도 3을 참조하면, S110단계에서, 제 1 컴퓨팅 장치는 가상환경이 아닌 외부환경에서 발생된 신호를 획득할 수 있다. 구체적으로 예를 들어, 제 1 컴퓨팅 장치의 통신부는 제 3 컴퓨팅 장치로부터 외부환 경에서 발생된, CCTV에 화재가 감지되었다는 신호를 수신할 수 있다. 그리고 S120단계에서, 제 1 컴퓨팅 장치는 외부환경에서 발생된 신호에 대응하는 알람 정보의 표시 기준을 정의하는 알람 표시 알고리즘에 기초하여 사용자 단말의 가상환경에서의 사용자 인터페이스 상에서 알람 정보가 표시되도록 알람 정보를 가상환경을 제공하는 제 2 컴퓨팅 장치로 전송할 수 있다. 구체적으로 알람 표시 알고리즘은, 사용자 단말로부터 획득되는 사용자로부터 사전 설정된 알람 정보에 따 른 알람 표시 순서 및 알람을 제공하는 방법을 포함하는 우선순위, 사용자 단말의 위치를 포함하는 사용자 의 위치 정보 또는 사용자의 개인 정보를 포함하는 사용자의 유형 정보 중 적어도 하나에 기초하여 사전 학습된 인공지능 기반의 모델을 포함할 수 있다. 그리고 일 실시예에 따른 사전 학습된 인공지능 기반의 모델은 사전 학습의 결과에 기초하여 알람 정보의 알람 표시 우선순위를 자동으로 결정할 수 있다. 제 1 컴퓨팅 장치가 인공지능 기반의 모델을 활용하여 알람 표시의 우선순위를 생성하는 방법에 대한 구체적인 설명은 이하 도 8을 통해 자세히 설명한다. 구체적으로, 일 실시예에 따른 우선순위는 사용자로부터 사전 설정된 알람 정보의 유형에 따른 중요도 등급 및 사용자에 의해 사전 설정된 알람 정보의 유형에 따른 알람 정보를 제공하는 시점 중 적어도 하나를 포함할 수 있다. 일 실시예에 따른 알람 정보의 유형이란 외부환경에서 신호를 발생하는 장치의 특성에 대응되는 정보를 포함할 수 있다. 예를 들어, 알람 정보의 유형은 CCTV화면에 감지된 이상 신호, SMS, 긴급 재난 문자, 스마트도 어벨에 감지된 방문자 알림, 스마트 가전의 상태 또는 정보 알림 등을 포함할 수 있다. 일 실시예에 따른 알람 정보의 유형에 따른 중요도 등급은 가상환경의 사용자 인터페이스 상에서 설정 가능하며, 알람 정보의 유형에 따른 중요도 등급이 설정되는 경우, 알람 정보의 유형 및 알람 정보의 유형에 대응되는 중요도 등급에 기초하여, 복수의 알람 정보가 획득된 경우 각각의 중요도 등급을 비교하여 중요도 등급이 높은(즉, 상대적으로 더 중요한) 순서대로 먼저 알람이 제공될 수 있도록, 상기 유형의 알람 정보가 가상환경을 제공하는 제 2 컴퓨 팅 장치로 전송되는 시점이 결정될 수 있다. 중요도 등급이 사용자가 기 설정한 일정 등급 이하인 경우, 알람 정보는 제 2 컴퓨팅 장치로 전송되지 않을 수 있다. 사용자가 중요도 등급 및 알람 정보를 제공하는 시점을 설정하는 구체적인 예시는 이하 도 6을 통해서 자세히 설명한다. 구체적으로, 일 실시예에 따른 알람 표시 알고리즘은 사용자 단말의 위치 및/또는 사용자의 위치 정보와 알람 정보의 유형에 대응하는 위치 정보 사이의 거리에 기초하여 상기 알람 정보의 표시 기준을 자동으로 정의 할 수 있다. 예를 들어, 알람 정보의 유형에 대응하는 위치 정보는 CCTV의 위치, 스마트 가전의 위치 및 긴급재 난문자에 포함된 위치 정보 등의 외부환경에서 신호 또는 신호에 대응하는 정보를 생성하는 장치의 실제 위치를 의미할 수 있다. 그리고 알람 표시 알고리즘은 사용자 단말이 외부환경이 아닌 어떠한 가상환경에 연결되더라도 모두 동일 하게 적용될 수 있다. 구체적으로, 일 실시예에 따른 사용자의 유형 정보는 사용자 단말로부터 획득된 생체정보(지문, 안면, 홍 채 등의 사용자의 신체의 일부를 포함하는 정보) 또는 특정 제스쳐(gesture)에 대응하는 사용자 인증이 완료된 후에 획득되는 사용자 개인 정보 및 제 2 컴퓨팅 장치에서 구현중인 가상환경의 특징 정보(예를 들어, 가 상현실과 관련된 영화, 게임 등의 장르 정보)를 포함할 수 있다. 구체적으로, 일 실시예에 따른 상기 알람 정보의 표시 기준은 알람 정보의 사용자 단말에 표시되는 시점에 대응하는 알람 시간, 중요도 등급에 기초한 스케줄링 순서, 중요도 등급에 기초한 알람 횟수 및 중요도 등급에 기초한 사용자 인터페이스 상에서 알람이 표시되는 방식(또는, 알람 인터페이스)에 대응하는 물리적 속성을 포 함할 수 있다. 일 실시예에 따른 물리적 속성은 알람의 시각적 특징 및 청각적 특징을 포함하는 속성일 수 있다. 구체적으로, 시각적 특징은 사용자 단말의 디스플레이 등의 시각적 정보를 출력하는 사용자 인터페이스 상에서 출력되 는 알람의 크기(알람을 포함하는 직사각형, 타원 등의 도형의 픽셀 크기), RGB로 표현 가능한 색상 및 위치(사 용자 인터페이스 상에서의 특정한 좌표) 등의 정보를 포함할 수 있다. 그리고 청각적 특징은 사용자 단말 의 스피커 등의 청각적 정보를 출력하는 사용자 인터페이스 상에서 출력되는 소리의 크기(단계별 소리의 크기가 정해질 수 있음), 종류(예를 들어, 경고음, 경고 문구를 포함하는 음성메시지, 음악, 자연음 등), 소리의 출력 시간(초, 분 등의 시간 단위로 설정이 가능하거나 그리고/또는 사용자의 알람 해제 명령을 획득하는 시점까지 유지할 수 있음) 및 기 설정된 단위의 시간동안 출력되는 소리의 반복 횟수 등을 포함할 수 있다. 일 실시예에 따른 사용자 단말의 사용자 인터페이스 상에서 알람이 제공되는 구체적인 방법은 이하 도 4를 통해 자세히 설명한다. 도 4는 본 개시의 몇몇 실시예에 따른 가상환경에 연결된 사용자에게 알람을 제공하는 사용자 단말의 일례 를 설명하기 위한 블록 구성도이다. 도 4를 참조하면, 사용자 단말은 프로세서, 저장부, 입력부 및 출력부를 포함할 수 있다. 다만, 상술한 구성 요소들은 사용자 단말을 구현하는데 있어서 필수적인 것은 아니어서, 사용자 단 말은 열거된 구성요소들 보다 많거나, 또는 적은 구성요소들을 가질 수 있다. 본 개시의 일 실시예에 따른 사용자 단말의 프로세서는 통상적으로 사용자 단말의 동작 및 데이 터를 처리할 수 있는 모든 종류의 장치를 포함할 수 있다. 예를 들어, 프로그램 내에 포함된 코드 또는 명령으 로 표현된 기능을 수행하기 위해 물리적으로 구조화된 회로를 갖는, 하드웨어에 내장된 데이터 처리 장치를 의 미할 수 있다. 이와 같이 하드웨어에 내장된 데이터 처리 장치의 일 예로서, 마이크로프로세서 (microprocessor), 중앙처리장치(central processing unit: CPU), 프로세서 코어(processor core), 멀티프로세 서(multiprocessor), ASIC(application-specific integrated circuit), FPGA(field programmable gate array) 등의 처리 장치를 망라할 수 있으나, 본 발명의 범위가 이에 한정되는 것은 아니다. 예를 들어, 사용자 단말의 프로세서는 사용자 단말의 통신부를 통해 입력 또는 출력되는 신호 또는 데이터 등을 처리하거나 사용자 단말의 저장부에 데이터를 저장 또는 삭제함으로써, 데이터를 관리 또는 처리할 수 있다. 구체적으로, 가상환경에 연결된 사용자에게 알람을 제공하기 위한 과정에 필요한 프 로그램 또는 데이터 등을 획득할 수 있다. 그리고, 프로세서는 가상환경에 연결된 사용자에게 알람을 제공 하기 위한 프로그램 또는 데이터 등을 저장부에 저장할 수 있다. 그리고, 프로세서는 상기 가상환경 이 아닌 외부환경에서 발생된 신호에 대응하는 알람 정보의 표시 기준을 정의하는 알람 표시 알고리즘에서 사용 될 데이터를 생성하는 동작 및 사용자 단말의 가상환경에서의 사용자 인터페이스 상에서 알람 정보에 대응 하는 알람을 출력하는 동작을 수행할 수 있다. 즉, 프로세서는 위의 과정을 포함하는 가상환경에 연결된 사용자 단말에게 알람을 제공하기 위한 전체 과정을 제어하며, 이에 한정되는 것은 아니다. 본 개시내용의 추가적인 실시예에서, 저장부는 사용자 단말과 별개인 다른 컴퓨팅 장치(예컨대, 다른 서버 또는 다른 사용자 단말)에 포함될 수도 있다. 이러한 경우, 사용자 단말은 다른 컴퓨팅 장치와 통신 하여, 다른 컴퓨팅 장치에 포함된 저장부로부터 원하는 데이터를 획득할 수 있다. 예를 들어, 저장부(42 0)를 포함하는 가상환경제공 서버(미도시)가 사용자 단말과 별개로 존재할 수 있으며, 사용자 단말은 본 개시내용의 실시예들에 따른 방법을 수행하는데 있어서 필요한 데이터를 가상환경제공 서버로부터 획득할 수 있다.본 개시의 일 실시예에 따른 저장부는 메모리 및/또는 영구저장매체를 포함할 수 있다. 메모리는 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), 멀티미디어 카드 마이크로 타입 (multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 램(Random Access Memory, RAM), SRAM(Static Random Access Memory), 롬(Read-Only Memory, ROM), EEPROM(Electrically Erasable Programmable Read-Only Memory), PROM(Programmable Read-Only Memory), 자기 메모리, 자기 디스크, 광디스크 중 적어도 하나의 타입의 저장매체를 포함할 수 있으나, 본 발명의 범위가 이에 한정되는 것 은 아니다. 본 개시의 일 실시예에 따른 입력부는, 영상 신호 입력을 위한 카메라 또는 영상 입력부, 오디오 신호 입 력을 위한 마이크로폰(microphone), 각종 센서(예를 들어, 가속 센서, 자이로 센서, 압력 센서, RGB 센서 등) 또는 오디오 입력부, 사용자로부터 정보를 입력받기 위한 사용자 입력부(예를 들어, 터치키(touch key), 푸시키 (mechanical key) 등)를 포함할 수 있다. 입력부에서 수집한 음성 데이터나 이미지 데이터는 분석되어 사 용자 입력으로 처리될 수 있다. 예를 들어, 사용자에게 외부환경에 관한 알람을 제공하는 경우, 입력부는 알람의 표시 기준을 정의하기 위한 알람 표시 알고리즘을 한정하거나 외부환경과 관련된 신호를 생성한 제 3 컴 퓨팅 장치를 제어하는 정보를 획득할 수 있다. 입력부가 정보를 획득하는 구체적인 방법은 이하 도 6 을 통해 자세히 설명한다. 본 개시의 일 실시예에 따른 출력부는 시각, 청각 또는 촉각 등과 관련된 출력을 발생시키기 위한 것으로, 디스플레이부, 음향 출력부, 햅팁 모듈, 광 출력부 중 적어도 하나를 포함할 수 있다. 디스플레이부는 터치 센 서와 상호 레이어 구조를 이루거나 일체형으로 형성됨으로써, 터치 스크린을 구현할 수 있다. 이러한 터치 스크 린은, 사용자 단말과 사용자 사이의 입력 인터페이스를 제공하는 사용자 입력부로써 기능함과 동시에, 사 용자 단말과 사용자 사이의 출력 인터페이스를 제공할 수 있다. 예를 들어, 사용자에게 외부환경에 관한 알람을 제공하는 경우, 출력부는 가상환경과 관련된 그래픽, 이미지, 영상, 진동 및/또는 소리 등의 상기 알람 및 상기 알람과 관련된 정보를 제공할 수 있다. 출력부가 알람과 관련된 정보를 제공하는 구체적인 방법은 이하 도 7을 통해 자세히 설명한다. 본 개시의 일 실시예에 따른 사용자 단말이 가상환경에 연결된 사용자에게 알람을 제공하는 방법은 이하 도 5를 통해 자세히 설명한다. 도 5는 본 개시의 몇몇 실시예에 따른 사용자 단말의 가상환경에 연결된 사용자에게 알람을 제공하는 일례의 방 법의 흐름도이다. 도 5를 참조하면, S210단계에서 사용자 단말은 가상환경이 아닌 외부환경에서 발생된 신호에 대응하는 알 람 정보의 표시 기준을 정의하는 알람 표시 알고리즘에서 사용될 데이터를 생성할 수 있다. 구체적으로, 사용자 단말은 알람 표시 알고리즘에서 사용될 데이터를 생성하기 위해, 입력부를 통해 사용자가 알람 정보의 유형을 선택하는 제 1 사용자 액션을 획득할 수 있다. 그리고 사용자 단말은 입력부 를 통해 제 1 사용자 액션에 후속하는 사용자가 알람 정보의 중요도 등급을 선택하는 제 2 사용자의 액션 을 획득하고, 그리고 사용자가 사용자의 개인 정보를 제공하기 위한 제 3 사용자 액션을 획득할 수 있다. 그리 고 사용자 단말은 입력부를 통해 외부환경과 관련된 신호를 생성한 제 3 컴퓨팅 장치를 제어하 기 위한 제 4 사용자 액션을 획득할 수 있다. 구체적으로, 제 1 사용자 액션은 알람 정보의 유형에 대응하는 명칭에 대한 호명하는 사용자의 행위 또는 가상 환경의 사용자 인터페이스 상에서 가상환경의 포인터 객체에 의해 상기 알람 정보의 유형에 대응하는 이미지 또 는 좌표를 선택하는 사용자의 행위를 포함할 수 있다. 구체적으로, 제 2 사용자 액션은 가상환경의 사용자 인터페이스 상에서 가상환경의 포인터 객체에 의해 중요도 등급의 등급별 좌표 또는 정수로 표현된 특정 등급을 선택하는 사용자의 행위 또는 상기 정수로 표현된 특정 등 급에 대응하는 사용자의 음성 메시지를 제공하는 사용자의 행위를 포함할 수 있다. 구체적으로, 제 3 사용자 액션은 제 3 컴퓨팅 장치로부터 발생된 신호에 대한 추가적인 정보를 전송할 것 을 요구하는 명령에 대응하는 사용자의 행위를 포함할 수 있다. 예를 들어, 추가적인 정보란 CCTV로부터 화재가 발생했다는 정보 또는 침입 상황이 발생했다는 정보에 대응하는 화재 현장 또는 침입 상황의 영상 또는 이미지 일 수 있다. 그리고 추가적인 정보란 알람 정보의 신호에 대응하는 위치 정보, 시각 정보 등을 포함하는 알람 정보에 대응하는 외부환경 정보를 포함할 수 있다.구체적으로, 제 4 사용자 액션은 사용자 단말의 입력부를 통해 획득되는 제 3 컴퓨팅 장치를 제 어하기 위한 사용자의 제스쳐 또는 음성 등의 사용자의 행위로부터 얻어지는 정보를 포함할 수 있다. 그리고 예를 들어, 제 4 사용자 액션은 사용자의 개인 정보를 획득하기 위한 사용자 인증에 대응하는 사용자의 행위를 포함할 수 있다. 구체적으로, 사용자 인증에 대응하는 사용자의 행위는 사용자가 신체 일부를 기 설정된 패턴에 대응하게 움직이는 행위 또는 사용자가 기 설정한 목소리와 동일한 목소리로 발화하는 행위를 포함할 수 있다. 그리고 S220단계에서, 사용자 단말은 사용자 단말의 가상환경에서의 사용자 인터페이스 상에서 알람 정보에 대응하는 알람을 출력할 수 있다. 구체적으로, 사용자 단말은 제 2 컴퓨팅 장치 및/또는 제 1 컴퓨팅 장치로부터 알람 정보 및 알 람 정보에 대응하는 우선순위 등을 획득할 수 있다. 그리고 사용자 단말은 알람 정보에 대응하는 우선순위 에 포함된 정보에 기초한 알람을 사용자에게 제공할 수 있다. 도 6은 본 개시의 몇몇 실시예에 따른 알람을 제공하기 위한 알람 정보의 표시 기준을 정의하는 사용자 인터페 이스의 일례의 도시이다. 도 6을 참조하면, 사용자 단말의 출력부에서 디스플레이되는 사용자 인터페이스 상에는, 알람 정보의 표시 기준을 정의하기 위한 알람 설정 인터페이스가 포함될 수 있다. 구체적으로, 출력부는 외부환경 에서 발생된 신호에 대응하는 알람 정보의 유형(예를 들어, 유형1, 유형2 및 유형3을 포함)과 우선 순위의 중요도 등급 설정칸 및 알람 정보를 제공하는 시점 설정칸을 포함하는 알람 설정 인터페이스 를 출력할 수 있다. 본 개시의 일 실시예에 따른 사용자 단말은 알람 정보의 표시 기준을 정의하기 위해, 알람 설정 인터페이 스를 출력할 수 있다. 그리고 사용자 단말은 알람 설정 인터페이스상에서 가상환경의 포인터 객체 및/또는 사용자의 제스처에 의해 알람 정보의 유형에 대응하는 이미지 또는 좌표를 선택하는 제 1 사용자 액션 을 통해 유형1, 유형2 및 유형3 중 적어도 하나를 입력부를 통해 획득할 수 있다. 그리고 일 실시예에 따른 사용자 단말은 제 1 사용자 액션을 통해 선택된 유형에 대응하는, 중요도 등급 설정칸에 포함된 중요도 등급의 등급별 좌표 또는 정수로 표현된 특정 등급을 선택하는, 사용자가 신체 일 부를 기 설정된 모션(예를 들어, 손 및/또는 팔을 좌에서 우 또는 위에서 아래로 움직이는 모션 등)으로 움직이 는 제스쳐에 기초한 제 2 사용자 액션을 획득할 수 있다. 또는, 사용자 단말은 사용자가 정수로 표현된 특 정 등급을 발화하는 제 2 사용자 액션을 입력부를 통해 획득할 수 있다. 그리고 일 실시예에 따른 사용자 단말은 제 1 사용자 액션을 통해 선택된 유형에 대응하는, 알람 설정 인 터페이스상에서 알람 정보를 제공하는 시점 설정칸에 포함된, 앞서 선택된 알람 유형에 대응하는 시점 을 설정할 수 있는 그림 또는 좌표 등을 선택하는 제 2 사용자 액션 및 선택된 그림 또는 좌표로부터 알람 정보 를 제공하는 시점을 선택하는 제스쳐(예를 들어, 사용자가 신체 일부를 이용하여 숫자 및/또는 도형 등을 허공 에 그리는 모션 등)에 기초한 제 2 사용자 액션을 입력부를 통해 획득할 수 있다. 그리고 제 1 사용자 액션 및/또는 제 2 사용자 액션을 통해 획득된 알람 정보의 중요도 등급 및/또는 알람 정보 를 제공하는 시점에 기초하여 사전 학습된 인공지능 기반의 모델은 알람 표시 알고리즘을 통해 알람 정보의 우 선순위, 알람 정보를 제공하는 시점 및/또는 알람 정보를 표시하는 방식에 대응하는 물리적 속성 등을 자동으로 결정할 수 있다. 도 7은 본 개시의 몇몇 실시예에 따른 가상환경에 연결된 사용자에게 알람을 제공하는 사용자 인터페이스의 일 례의 도시이다. 도 7을 참조하면, 사용자 단말은 출력부를 통해, 가상환경에서의 사용자 인터페이스에 대응하는 메타 화면을 출력할 수 있다. 구체적으로, 메타화면은 가상환경에 대응하는 그래픽 정보를 포함할 수 있다. 그리고 메타화면은 알람 정보에 대응하는 알람(제 1 알람 및/또는 제 2 알람) 및/또는 외부환경 정 보 알람을 포함할 수 있다. 본 개시의 일 실시예에 따른 제 1 알람은 CCTV, 긴급재난문자 및/또는 화재감지기 등을 통해 획득된 화재 발생에 관한 알람일 수 있다. 그리고 제 2 알람은 CCTV 및/또는 스마트도어 등의 장치에서 획득된 침입 발 생에 관한 알람일 수 있다. 제 1 알람 및 제 2 알람은 인공지능 기반의 모델의 알람 표시 알고리즘에 의해 생성된 알람 표시 순서, 알람 표시 색상, 알람 표시 크기 및/또는 알람 표시 위치 등의 정보를 포함할 수있다. 예를 들어, 제 1 알람은 화재 발생에 관한 알람 정보의 유형으로, 도 6을 참조하여, 가장 높은 중요도 등급 을 포함할 수 있다. 그리고 제 2 알람은 제 1 알람보다 아래 단계의 중요도 등급을 포함할 수 있다. 따 라서, 제 1 알람은 제 2 알람보다 중요도가 더 높은 색상(예를 들어, 빨간색은 주황색보다 중요도가 높 고, 주황색은 노란색보다 중요도가 높을 수 있음)으로 표시될 수 있다. 그리고 제 1 알람은 제 2 알람 보다 더 긴 시간동안 표시될 수 있다. 그리고 제 1 알람 및/또는 제 2 알람은 사용자 단말이 사용 자로부터 알람을 확인했다는 제스쳐를 획득한 경우, 사용자 인터페이스 상에서 알람이 확인되지 않는, 알람이 해제된 상태가 될 수 있다. 본 개시의 일 실시예에 따른 외부환경 정보 알람은 알람 정보에 대응하는 외부환경의 추가적인 정보를 표시 하는 인터페이스 또는 도 5를 참조하여, 제 4 사용자 액션을 통해 획득되는 외부환경의 추가적인 정보를 포함할 수 있다. 예를 들어, 제 1 알람이 CCTV에서 획득된 화재 발생에 대응하는 알람인 경우, 사용자 단말은 화재 발 생 현장을 포함하는 화면을 요청하는 제 4 사용자 액션을 획득할 수 있다. 그리고 사용자 단말은 제 4 사 용자 액션에 대응하는 화재 발생 현장을 포함하는 외부환경 정보 알람을 획득하고 사용자 인터페이스 상에 서 출력할 수 있다. 그리고 사용자 단말은 화재 발생한 현장에 존재하는 소화장치의 실행을 명령하는 제 4 사용자 액션을 획득하고, 제 4 사용자 액션을 소화장치를 제어하는 제 3 컴퓨팅 장치로 전송할 수 있다. 본 개시의 다른 실시예에 따른 외부환경 정보 알람은 제 2 알람이 CCTV에서 획득된 침입 발생에 대응하 는 알람인 경우, 사용자 단말은 침입 발생 현장을 포함하는 화면을 요청하는 제 4 사용자 액션을 획득할 수 있다. 그리고 사용자 단말은 제 4 사용자 액션에 대응하는 침입 발생 현장을 포함하는 외부환경 정보 알람을 획득하고 사용자 인터페이스 상에서 출력할 수 있다. 그리고 사용자 단말은 침입 발생한 현장 에 존재하는 침입 경보 장치의 실행을 명령하는 제 4 사용자 액션을 획득하고, 제 4 사용자 액션을 침입 경보 장치를 제어하는 제 3 컴퓨팅 장치로 전송할 수 있다. 도 8은 본 개시의 몇몇 실시예에 따른 네트워크 함수를 나타낸 개략도이다. 도 8을 참조하면, 제 1 컴퓨팅 장치는 인공지능 기반의 모델을 포함할 수 있다. 일 실시예에서, 인공지능 기반의 모델은 네트워크를 포함할 수 있다. 본 개시에서 알람 표시 기준에 관련된 정 보를 입력받는 입력 뉴런들을 포함하는 입력 레이어, 하나 이상의 히든 레이어 및 벡터 공간 상에서의 알람 표 시 기준, 우선순위 등의 알람을 제공하는 기준에 관련된 정보를 출력하는 출력 뉴런을 포함하는 출력 레이어를 포함할 수 있다. 본 명세서에 걸쳐, 인공지능 기반의 모델, 인공지능 모델, 연산 모델, 신경망, 네트워크 함수, 뉴럴 네트워크 (neural network)는 동일한 의미로 사용될 수 있다. 신경망은 일반적으로 노드라 지칭될 수 있는 상호 연결된 계산 단위들의 집합으로 구성될 수 있다. 이러한 노드들은 뉴런(neuron)들로 지칭될 수도 있다. 신경망은 적어 도 하나 이상의 노드들을 포함하여 구성된다. 신경망들을 구성하는 노드(또는 뉴런)들은 하나 이상의 링크에 의 해 상호 연결될 수 있다. 입력 데이터가 인공지능 모델의 입력 레이어에 입력되기 전에, 본 개시내용의 일 실시예에 따른 전처리 기법들 이 수행될 수 있다. 예를 들어, 본 개시에서 입력 레이어에 입력되는 입력 데이터는 사용자 단말로부터 획 득된 사전 결정된 우선순위, 사용자의 위치 정보 또는 사용자의 유형 정보 중 적어도 하나가 될 수 있다. 신경망 내에서, 링크를 통해 연결된 하나 이상의 노드들은 상대적으로 입력 노드 및 출력 노드의 관계를 형성할 수 있다. 입력 노드 및 출력 노드의 개념은 상대적인 것으로서, 하나의 노드에 대하여 출력 노드 관계에 있는 임의의 노드는 다른 노드와의 관계에서 입력 노드 관계에 있을 수 있으며, 그 역도 성립할 수 있다. 상술한 바 와 같이, 입력 노드 대 출력 노드 관계는 링크를 중심으로 생성될 수 있다. 하나의 입력 노드에 하나 이상의 출 력 노드가 링크를 통해 연결될 수 있으며, 그 역도 성립할 수 있다. 하나의 링크를 통해 연결된 입력 노드 및 출력 노드 관계에서, 출력 노드의 데이터는 입력 노드에 입력된 데이 터에 기초하여 그 값이 결정될 수 있다. 여기서 입력 노드와 출력 노드를 상호 연결하는 링크는 가중치(weigh t)를 가질 수 있다. 가중치는 가변적일 수 있으며, 신경망이 원하는 기능을 수행하기 위해, 사용자 또는 알고리 즘에 의해 가변 될 수 있다. 예를 들어, 하나의 출력 노드에 하나 이상의 입력 노드가 각각의 링크에 의해 상호 연결된 경우, 출력 노드는 상기 출력 노드와 연결된 입력 노드들에 입력된 값들 및 각각의 입력 노드들에 대응하는 링크에 설정된 가중치에 기초하여 출력 노드 값을 결정할 수 있다. 상술한 바와 같이, 신경망은 하나 이상의 노드들이 하나 이상의 링크를 통해 상호 연결되어 신경망 내에서 입력 노드 및 출력 노드 관계를 형성한다. 신경망 내에서 노드들과 링크들의 개수 및 노드들과 링크들 사이의 연관관 계, 링크들 각각에 부여된 가중치의 값에 따라, 신경망의 특성이 결정될 수 있다. 예를 들어, 동일한 개수의 노 드 및 링크들이 존재하고, 링크들의 가중치 값이 상이한 두 신경망이 존재하는 경우, 두 개의 신경망들은 서로 상이한 것으로 인식될 수 있다. 신경망은 하나 이상의 노드들의 집합으로 구성될 수 있다. 신경망을 구성하는 노드들의 부분 집합은 레이어 (layer)를 구성할 수 있다. 신경망을 구성하는 노드들 중 일부는, 최초 입력 노드로부터의 거리들에 기초하여, 하나의 레이어(layer)를 구성할 수 있다. 예를 들어, 최초 입력 노드로부터 거리가 n인 노드들의 집합은, n 레 이어를 구성할 수 있다. 최초 입력 노드로부터 거리는, 최초 입력 노드로부터 해당 노드까지 도달하기 위해 거 쳐야 하는 링크들의 최소 개수에 의해 정의될 수 있다. 그러나, 이러한 레이어의 정의는 설명을 위한 임의적인 것으로서, 신경망 내에서 레이어의 차수는 상술한 것과 상이한 방법으로 정의될 수 있다. 예를 들어, 노드들의 레이어는 최종 출력 노드로부터 거리에 의해 정의될 수도 있다. 최초 입력 노드는 신경망 내의 노드들 중 다른 노드들과의 관계에서 링크를 거치지 않고 데이터가 직접 입력되 는 하나 이상의 노드들을 의미할 수 있다. 또는, 신경망 네트워크 내에서, 링크를 기준으로 한 노드 간의 관계 에 있어서, 링크로 연결된 다른 입력 노드들을 가지지 않는 노드들을 의미할 수 있다. 이와 유사하게, 최종 출 력 노드는 신경망 내의 노드들 중 다른 노드들과의 관계에서, 출력 노드를 가지지 않는 하나 이상의 노드들을 의미할 수 있다. 또한, 히든 노드는 최초 입력 노드 및 최후 출력 노드가 아닌 신경망을 구성하는 노드들을 의 미할 수 있다. 본 개시의 일 실시예에 따른 신경망은 입력 레이어의 노드의 개수가 출력 레이어의 노드의 개수와 동일할 수 있 으며, 입력 레이어에서 히든 레이어로 진행됨에 따라 노드의 수가 감소하다가 다시 증가하는 형태의 신경망일 수 있다. 또한, 본 개시의 다른 일 실시예에 따른 신경망은 입력 레이어의 노드의 개수가 출력 레이어의 노드의 개수 보다 적을 수 있으며, 입력 레이어에서 히든 레이어로 진행됨에 따라 노드의 수가 감소하는 형태의 신경망 일 수 있다. 또한, 본 개시의 또 다른 일 실시예에 따른 신경망은 입력 레이어의 노드의 개수가 출력 레이어의 노드의 개수보다 많을 수 있으며, 입력 레이어에서 히든 레이어로 진행됨에 따라 노드의 수가 증가하는 형태의 신경망일 수 있다. 본 개시의 또 다른 일 실시예에 따른 신경망은 상술한 신경망들의 조합된 형태의 신경망일 수 있다. 딥 뉴럴 네트워크(DNN: deep neural network, 심층신경망)는 입력 레이어와 출력 레이어 외에 복수의 히든 레이 어를 포함하는 신경망을 의미할 수 있다. 딥 뉴럴 네트워크를 이용하면 데이터의 잠재적인 구조(latent structures)를 파악할 수 있다. 즉, 이미지 또는 사진의 잠재적인 구조(예를 들어, 어떤 물체가 사진에 있는지 등)를 파악할 수 있다. 딥 뉴럴 네트워크는 컨볼루션 뉴럴 네트워크(CNN: convolutional neural network), 리 커런트 뉴럴 네트워크(RNN: recurrent neural network), 오토 인코더(auto encoder), GAN(Generative Adversarial Networks), 제한 볼츠만 머신(RBM: restricted boltzmann machine), 심층 신뢰 네트워크(DBN: deep belief network), Q 네트워크, U 네트워크, 샴 네트워크, 적대적 생성 네트워크(GAN: Generative Adversarial Network) 등을 포함할 수 있다. 전술한 딥 뉴럴 네트워크의 기재는 예시일 뿐이며 본 개시는 이에 제한되지 않는다. 본 개시의 일 실시예에서 네트워크 함수는 오토 인코더(autoencoder)를 포함할 수도 있다. 오토 인코더는 입력 데이터와 유사한 출력 데이터를 출력하기 위한 인공 신경망의 일종일 수 있다. 오토 인코더는 적어도 하나의 히 든 레이어를 포함할 수 있으며, 홀수 개의 히든 레이어가 입출력 레이어 사이에 배치될 수 있다. 각각의 레이어 의 노드의 수는 입력 레이어의 노드의 수에서 병목 레이어(인코딩)라는 중간 레이어로 축소되었다가, 병목 레이 어에서 출력 레이어(입력 레이어와 대칭)로 축소와 대칭되어 확장될 수도 있다. 오토 인코더는 비선형 차원 감 소를 수행할 수 있다. 입력 레이어 및 출력 레이어의 수는 입력 데이터의 전처리 이후에 차원과 대응될 수 있다. 오토 인코더 구조에서 인코더에 포함된 히든 레이어의 노드의 수는 입력 레이어에서 멀어질수록 감소하는 구조를 가질 수 있다. 병목 레이어(인코더와 디코더 사이에 위치하는 가장 적은 노드를 가진 레이어)의 노드의 수는 너무 작은 경우 충분한 양의 정보가 전달되지 않을 수 있으므로, 특정 수 이상(예를 들어, 입력 레이어의 절반 이상 등)으로 유지될 수도 있다. 뉴럴 네트워크는 교사 학습(supervised learning), 비교사 학습(unsupervised learning), 반교사학습(semi supervised learning), 또는 강화학습(reinforcement learning) 중 적어도 하나의 방식으로 학습될 수 있다.뉴럴 네트워크의 학습은 뉴럴 네트워크가 특정한 동작을 수행하기 위한 지식을 뉴럴 네트워크에 적용하는 과정 일 수 있다. 뉴럴 네트워크는 출력의 오류를 최소화하는 방향으로 학습될 수 있다. 뉴럴 네트워크의 학습에서 반복적으로 학 습 데이터를 뉴럴 네트워크에 입력시키고 학습 데이터에 대한 뉴럴 네트워크의 출력과 타겟의 에러를 계산하고, 에러를 줄이기 위한 방향으로 뉴럴 네트워크의 에러를 뉴럴 네트워크의 출력 레이어에서부터 입력 레이어 방향 으로 역전파(backpropagation)하여 뉴럴 네트워크의 각 노드의 가중치를 업데이트 하는 과정이다. 교사 학습의 경우 각각의 학습 데이터에 정답이 라벨링되어있는 학습 데이터를 사용하며(즉, 라벨링된 학습 데이터), 비교사 학습의 경우는 각각의 학습 데이터에 정답이 라벨링되어 있지 않을 수 있다. 즉, 예를 들어 데이터 분류에 관한 교사 학습의 경우의 학습 데이터는 학습 데이터 각각에 카테고리가 라벨링된 데이터 일 수 있다. 라벨링된 학습 데이터가 뉴럴 네트워크에 입력되고, 뉴럴 네트워크의 출력(카테고리)과 학습 데이터의 라벨을 비교함으로써 오 류(error)가 계산될 수 있다. 다른 예로, 데이터 분류에 관한 비교사 학습의 경우 입력인 학습 데이터가 뉴럴 네트워크 출력과 비교됨으로써 오류가 계산될 수 있다. 계산된 오류는 뉴럴 네트워크에서 역방향(즉, 출력 레이 어에서 입력 레이어 방향)으로 역전파 되며, 역전파에 따라 뉴럴 네트워크의 각 레이어의 각 노드들의 연결 가 중치가 업데이트 될 수 있다. 업데이트 되는 각 노드의 연결 가중치는 학습률(learning rate)에 따라 변화량이 결정될 수 있다. 입력 데이터에 대한 뉴럴 네트워크의 계산과 에러의 역전파는 학습 사이클(epoch)을 구성할 수 있다. 학습률은 뉴럴 네트워크의 학습 사이클의 반복 횟수에 따라 상이하게 적용될 수 있다. 예를 들어, 뉴럴 네트워크의 학습 초기에는 높은 학습률을 사용하여 뉴럴 네트워크가 빠르게 일정 수준의 성능을 확보하도록 하 여 효율성을 높이고, 학습 후기에는 낮은 학습률을 사용하여 정확도를 높일 수 있다. 뉴럴 네트워크의 학습에서 일반적으로 학습 데이터는 실제 데이터(즉, 학습된 뉴럴 네트워크를 이용하여 처리하 고자 하는 데이터)의 부분집합일 수 있으며, 따라서, 학습 데이터에 대한 오류는 감소하나 실제 데이터에 대해 서는 오류가 증가하는 학습 사이클이 존재할 수 있다. 과적합(overfitting)은 이와 같이 학습 데이터에 과하게 학습하여 실제 데이터에 대한 오류가 증가하는 현상이다. 예를 들어, 노란색 고양이를 보여 고양이를 학습한 뉴 럴 네트워크가 노란색 이외의 고양이를 보고는 고양이임을 인식하지 못하는 현상이 과적합의 일종일 수 있다. 과적합은 머신러닝 알고리즘의 오류를 증가시키는 원인으로 작용할 수 있다. 이러한 과적합을 막기 위하여 다양 한 최적화 방법이 사용될 수 있다. 과적합을 막기 위해서는 학습 데이터를 증가시키거나, 레귤라이제이션 (regularization), 학습의 과정에서 네트워크의 노드 일부를 비활성화하는 드롭아웃(dropout), 배치 정규화 레 이어(batch normalization layer)의 활용 등의 방법이 적용될 수 있다. 구체적으로, 인공지능 기반의 모델은 사용자 단말로부터 획득되는 사전 결정된 우선순위, 상기 사용자의 위치 정보 또는 상기 사용자의 유형 정보 중 적어도 하나를 학습 데이터로 사용할 수 있다. 그리고 인공지능 기 반의 모델은 사전 결정된 우선순위의 카테고리를 분류하여 중요 등급 레이블을 생성하고, 새로 획득된 외부환경 과 관련된 신호와 사전 결정된 우선순위의 카테고리의 유사도를 계산하여 유사도에 따른 중요 등급 레이블을 자 동으로 부여하도록 학습될 수 있다. 그리고 인공지능 기반의 모델은 사전 결정된 중요 등급 레이블, 사용자의 위치 정보 및/또는 사용자의 위치 정 보와 알람 정보에 포함된 위치 사이의 거리에 따른 중요도 점수를 부여하고, 중요도 점수가 높은 순서대로 알람 정보에 긴급순위를 부여하도록 학습될 수 있다. 그리고 사용자 단말은 복수의 외부환경과 관련된 신호를 획득한 경우, 긴급순위에 따른 알람 정보의 알람 표시 색상, 크기 등의 물리적 속성을 매칭시키고, 긴급순위에 기초한 알람 순서대로 사용자에게 알람을 제공하 도록 학습된 알람 표시 알고리즘에 기초하여 알람을 제공할 수 있다. 예를 들어, 사용자 단말은 사용자가 접속한 가상환경의 특성(게임의 유형, 디스플레이의 색상, 소리의 크 기 등) 또는 사용자의 나이 및 성별에 기초한 사용자의 신체사항 등을 포함하는 사용자의 유형 정보에 기초하여, 사용자가 알람에 대한 인지를 정확하게 할 수 있도록(밝은 화면의 가상환경에서는 검정색, 남색 등의 어두운 색상을 이용하여 알람을 제공하고, 어두운 화면의 가상환경에서는 노란색, 흰색 등의 밝은 색상을 이용 하여 알람을 제공하거나 그리고/또는 가상환경에서 발생되는 소리가 큰 경우, 진동 알람을 추가시키거나 더 큰 소리로 알람을 제공) 학습된 알람 표시 알고리즘에 기초하여 알람을 제공할 수 있다. 도 9는 본 개시의 몇몇 실시예들이 구현될 수 있는 예시적인 컴퓨팅 환경에 대한 일반적인 개략도이다. 도 9를 참조하면, 컴퓨터를 포함하는 본 개시의 여러가지 측면들을 구현하는 예시적인 환경이 나타내어져 있으며, 컴퓨터는 처리 장치, 시스템 메모리 및 시스템 버스를 포함한다. 시스템 버스는 시스템 메모리(이에 한정되지 않음)를 비롯한 시스템 컴포넌트들을 처리 장치에 연결시킨 다. 처리 장치는 다양한 상용 프로세서들 중 임의의 프로세서일 수 있다. 듀얼 프로세서 및 기타 멀티프 로세서 아키텍처도 역시 처리 장치로서 이용될 수 있다. 시스템 버스는 메모리 버스, 주변장치 버스, 및 다양한 상용 버스 아키텍처 중 임의의 것을 사용하는 로 컬 버스에 추가적으로 상호 연결될 수 있는 몇 가지 유형의 버스 구조 중 임의의 것일 수 있다. 시스템 메모리 는 판독 전용 메모리(ROM) 및 랜덤 액세스 메모리(RAM)를 포함한다. 기본 입/출력 시스템 (BIOS)은 ROM, EPROM, EEPROM 등의 비휘발성 메모리에 저장되며, 이 BIOS는 시동 중과 같은 때에 컴퓨터 내의 구성요소들 간에 정보를 전송하는 일을 돕는 기본적인 루틴을 포함한다. RAM은 또한 데이터 를 캐싱하기 위한 정적 RAM 등의 고속 RAM을 포함할 수 있다. 컴퓨터는 또한 내장형 하드 디스크 드라이브(HDD)(예를 들어, EIDE, SATA)－이 내장형 하드 디스크 드라이브는 또한 적당한 섀시(도시 생략) 내에서 외장형 용도로 구성될 수 있음－, 자기 플로피 디스크 드라이브(FDD)(예를 들어, 이동식 디스켓으로부터 판독을 하거나 그에 기록을 하기 위한 것임), 및 광 디스크 드라이브(예를 들어, CD-ROM 디스크를 판독하거나 DVD 등의 기타 고용량 광 매체로부터 판독을 하거나 그에 기록을 하기 위한 것임)를 포함한다. 하드 디스크 드라이브, 자기 디스크 드라이브 및 광 디스크 드라이브는 각각 하드 디스크 드라이브 인터페이스, 자기 디스크 드라이브 인 터페이스 및 광 드라이브 인터페이스에 의해 시스템 버스에 연결될 수 있다. 외장형 드라이 브 구현을 위한 인터페이스는 USB(Universal Serial Bus) 및 IEEE 1394 인터페이스 기술 중 적어도 하나 또는 그 둘 다를 포함한다. 이들 드라이브 및 그와 연관된 컴퓨터 판독가능 매체는 데이터, 데이터 구조, 컴퓨터 실행가능 명령어, 기타 등 등의 비휘발성 저장을 제공한다. 컴퓨터의 경우, 드라이브 및 매체는 임의의 데이터를 적당한 디지털 형 식으로 저장하는 것에 대응한다. 상기에서의 컴퓨터 판독가능 매체에 대한 설명이 HDD, 이동식 자기 디스크, 및 CD 또는 DVD 등의 이동식 광 매체를 언급하고 있지만, 당업자라면 집 드라이브(zip drive), 자기 카세트, 플래 쉬 메모리 카드, 카트리지, 기타 등등의 컴퓨터에 의해 판독가능한 다른 유형의 매체도 역시 예시적인 운영 환 경에서 사용될 수 있으며 또 임의의 이러한 매체가 본 개시의 방법들을 수행하기 위한 컴퓨터 실행가능 명령어 를 포함할 수 있다는 것을 잘 알 것이다. 운영 체제, 하나 이상의 애플리케이션 프로그램, 기타 프로그램 모듈 및 프로그램 데이터 를 비롯한 다수의 프로그램 모듈이 드라이브 및 RAM에 저장될 수 있다. 운영 체제, 애플리케이션, 모듈 및/또는 데이터의 전부 또는 그 일부분이 또한 RAM에 캐싱될 수 있다. 본 개시가 여러가지 상업적으 로 이용가능한 운영 체제 또는 운영 체제들의 조합에서 구현될 수 있다는 것을 잘 알 것이다. 사용자는 하나 이상의 유선/무선 입력 장치, 예를 들어, 키보드 및 마우스 등의 포인팅 장치를 통 해 컴퓨터에 명령 및 정보를 입력할 수 있다. 기타 입력 장치(도시 생략)로는 마이크, IR 리모콘, 조이스 틱, 게임 패드, 스타일러스 펜, 터치 스크린, 기타 등등이 있을 수 있다. 이들 및 기타 입력 장치가 종종 시스 템 버스에 연결되어 있는 입력 장치 인터페이스를 통해 처리 장치에 연결되지만, 병렬 포트, IEEE 1394 직렬 포트, 게임 포트, USB 포트, IR 인터페이스, 기타 등등의 기타 인터페이스에 의해 연결될 수 있 다. 모니터 또는 다른 유형의 디스플레이 장치도 역시 비디오 어댑터 등의 인터페이스를 통해 시스템 버스에 연결된다. 모니터에 부가하여, 컴퓨터는 일반적으로 스피커, 프린터, 기타 등등의 기타 주 변 출력 장치(도시 생략)를 포함한다. 컴퓨터는 유선 및/또는 무선 통신을 통한 원격 컴퓨터(들) 등의 하나 이상의 원격 컴퓨터로의 논리 적 연결을 사용하여 네트워크화된 환경에서 동작할 수 있다. 원격 컴퓨터(들)는 워크스테이션, 컴퓨팅 디 바이스 컴퓨터, 라우터, 퍼스널 컴퓨터, 휴대용 컴퓨터, 마이크로프로세서-기반 오락 기기, 피어 장치 또는 기 타 통상의 네트워크 노드일 수 있으며, 일반적으로 컴퓨터에 대해 기술된 구성요소들 중 다수 또는 그 전 부를 포함하지만, 간략함을 위해, 메모리 저장 장치만이 도시되어 있다. 도시되어 있는 논리적 연결은 근 거리 통신망(LAN) 및/또는 더 큰 네트워크, 예를 들어, 원거리 통신망(WAN)에의 유선/무선 연결을 포함한다. 이러한 LAN 및 WAN 네트워킹 환경은 사무실 및 회사에서 일반적인 것이며, 인트라넷 등의 전사적 컴 퓨터 네트워크(enterprise-wide computer network)를 용이하게 해주며, 이들 모두는 전세계 컴퓨터 네트워크, 예를 들어, 인터넷에 연결될 수 있다.LAN 네트워킹 환경에서 사용될 때, 컴퓨터는 유선 및/또는 무선 통신 네트워크 인터페이스 또는 어댑터 를 통해 로컬 네트워크에 연결된다. 어댑터는 LAN에의 유선 또는 무선 통신을 용이하 게 해줄 수 있으며, 이 LAN은 또한 무선 어댑터와 통신하기 위해 그에 설치되어 있는 무선 액세스 포인트를 포함하고 있다. WAN 네트워킹 환경에서 사용될 때, 컴퓨터는 모뎀을 포함할 수 있거나, WAN 상의 통신 컴퓨팅 디바이스에 연결되거나, 또는 인터넷을 통하는 등, WAN을 통해 통신을 설정 하는 기타 수단을 갖는다. 내장형 또는 외장형 및 유선 또는 무선 장치일 수 있는 모뎀은 입력 장치 인터 페이스를 통해 시스템 버스에 연결된다. 네트워크화된 환경에서, 컴퓨터에 대해 설명된 프로 그램 모듈들 또는 그의 일부분이 원격 메모리/저장 장치에 저장될 수 있다. 도시된 네트워크 연결이 예시 적인 것이며 컴퓨터들 사이에 통신 링크를 설정하는 기타 수단이 사용될 수 있다는 것을 잘 알 것이다. 컴퓨터는 무선 통신으로 배치되어 동작하는 임의의 무선 장치 또는 개체, 예를 들어, 프린터, 스캐너, 데 스크톱 및/또는 휴대용 컴퓨터, PDA(portable data assistant), 통신 위성, 무선 검출가능 태그와 연관된 임의 의 장비 또는 장소, 및 전화와 통신을 하는 동작을 한다. 이것은 적어도 Wi-Fi 및 블루투스 무선 기술을 포함한 다. 따라서, 통신은 종래의 네트워크에서와 같이 미리 정의된 구조이거나 단순하게 적어도 3개의 장치 사이의 애드혹 통신(ad hoc communication)일 수 있다. Wi-Fi(Wireless Fidelity)는 유선 없이도 인터넷 등으로의 연결을 가능하게 해준다. Wi-Fi는 이러한 장치, 예를 들어, 컴퓨터가 실내에서 및 실외에서, 즉 기지국의 통화권 내의 아무 곳에서나 데이터를 전송 및 수신할 수 있 게 해주는 셀 전화와 같은 무선 기술이다. Wi-Fi 네트워크는 안전하고 신뢰성 있으며 고속인 무선 연결을 제공 하기 위해 IEEE 802.11(a, b, g, 기타)이라고 하는 무선 기술을 사용한다. 컴퓨터를 서로에, 인터넷에 및 유선 네트워크(IEEE 802.3 또는 이더넷을 사용함)에 연결시키기 위해 Wi-Fi가 사용될 수 있다. Wi-Fi 네트워크는 비 인가 2.4 및 5GHz 무선 대역에서, 예를 들어, 11Mbps(802.11a) 또는 54 Mbps(802.11b) 데이터 레이트로 동작하 거나, 양 대역(듀얼 대역)을 포함하는 제품에서 동작할 수 있다. 본 개시의 기술 분야에서 통상의 지식을 가진 자는 정보 및 신호들이 임의의 다양한 상이한 기술들 및 기법들을 이용하여 표현될 수 있다는 것을 이해할 것이다. 예를 들어, 위의 설명에서 참조될 수 있는 데이터, 지시들, 명 령들, 정보, 신호들, 비트들, 심볼들 및 칩들은 전압들, 전류들, 전자기파들, 자기장들 또는 입자들, 광학장들 또는 입자들, 또는 이들의 임의의 결합에 의해 표현될 수 있다. 본 개시의 기술 분야에서 통상의 지식을 가진 자는 여기에 개시된 실시예들과 관련하여 설명된 다양한 예시적인 논리 블록들, 모듈들, 프로세서들, 수단들, 회로들 및 알고리즘 단계들이 전자 하드웨어, (편의를 위해, 여기에 서 소프트웨어로 지칭되는) 다양한 형태들의 프로그램 또는 설계 코드 또는 이들 모두의 결합에 의해 구현될 수 있다는 것을 이해할 것이다. 하드웨어 및 소프트웨어의 이러한 상호 호환성을 명확하게 설명하기 위해, 다양한 예시적인 컴포넌트들, 블록들, 모듈들, 회로들 및 단계들이 이들의 기능과 관련하여 위에서 일반적으로 설명되 었다. 이러한 기능이 하드웨어 또는 소프트웨어로서 구현되는지 여부는 특정한 애플리케이션 및 전체 시스템에 대하여 부과되는 설계 제약들에 따라 좌우된다. 본 개시의 기술 분야에서 통상의 지식을 가진 자는 각각의 특정 한 애플리케이션에 대하여 다양한 방식들로 설명된 기능을 구현할 수 있으나, 이러한 구현 결정들은 본 개시의 범위를 벗어나는 것으로 해석되어서는 안 될 것이다. 여기서 제시된 다양한 실시예들은 방법, 장치, 또는 표준 프로그래밍 및/또는 엔지니어링 기술을 사용한 제조 물품(article)으로 구현될 수 있다. 용어 제조 물품은 임의의 컴퓨터-판독가능 저장장치로부터 액세스 가능한 컴퓨터 프로그램, 캐리어, 또는 매체(media)를 포함한다. 예를 들어, 컴퓨터-판독가능 저장매체는 자기 저장 장 치(예를 들면, 하드 디스크, 플로피 디스크, 자기 스트립, 등), 광학 디스크(예를 들면, CD, DVD, 등), 스마트 카드, 및 플래쉬 메모리 장치(예를 들면, EEPROM, 카드, 스틱, 키 드라이브, 등)를 포함하지만, 이들로 제한되 는 것은 아니다. 또한, 여기서 제시되는 다양한 저장 매체는 정보를 저장하기 위한 하나 이상의 장치 및/또는 다른 기계-판독가능한 매체를 포함한다. 제시된 프로세스들에 있는 단계들의 특정한 순서 또는 계층 구조는 예시적인 접근들의 일례임을 이해하도록 한 다. 설계 우선순위들에 기반하여, 본 개시의 범위 내에서 프로세스들에 있는 단계들의 특정한 순서 또는 계층 구조가 재배열될 수 있다는 것을 이해하도록 한다. 첨부된 방법 청구항들은 샘플 순서로 다양한 단계들의 엘리 먼트들을 제공하지만 제시된 특정한 순서 또는 계층 구조에 한정되는 것을 의미하지는 않는다. 제시된 실시예들에 대한 설명은 임의의 본 개시의 기술 분야에서 통상의 지식을 가진 자가 본 개시를 이용하거 나 또는 실시할 수 있도록 제공된다. 이러한 실시예들에 대한 다양한 변형들은 본 개시의 기술 분야에서 통상의 지식을 가진 자에게 명백할 것이며, 여기에 정의된 일반적인 원리들은 본 개시의 범위를 벗어남이 없이 다른 실시예들에 적용될 수 있다. 그리하여, 본 개시는 여기에 제시된 실시예들로 한정되는 것이 아니라, 여기에 제시 된 원리들 및 신규 특징들과 일관되는 최광의의 범위에서 해석되어야 할 것이다. 예를 들어, 단일형으로 설명되 어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본 발명의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으 로 해석되어야 한다. 본 개시가 일반적으로 컴퓨팅 장치에 의해 구현될 수 있는 것으로 전술되었지만, 당업자라면 본 개시가 하나 이 상의 컴퓨터 상에서 실행될 수 있는 컴퓨터 실행가능 명령어 및/또는 기타 프로그램 모듈들과 결합되어 및/또는 하드웨어와 소프트웨어의 조합으로써 구현될 수 있다는 것을 잘 알 것이다. 일반적으로, 프로그램 모듈은 특정의 태스크를 수행하거나 특정의 추상 데이터 유형을 구현하는 루틴, 프로그램, 컴포넌트, 데이터 구조, 기타 등등을 포함한다. 또한, 당업자라면 본 개시의 방법이 단일-프로세서 또는 멀티프로세서 컴퓨터 시스템, 미니컴퓨터, 메인프레임 컴퓨터는 물론 퍼스널 컴퓨터, 핸드헬드(handheld) 컴퓨팅 장치, 마이크로프로세서-기반 또는 프로그램가능 가전 제품, 기타 등등(이들 각각은 하나 이상의 연관된 장치와 연결되어 동작할 수 있음)을 비롯한 다른 컴퓨터 시스템 구성으로 실시될 수 있다는 것을 잘 알 것이다. 본 개시의 설명된 실시예들은 또한 어떤 태스크들이 통신 네트워크를 통해 연결되어 있는 원격 처리 장치들에 의해 수행되는 분산 컴퓨팅 환경에서 실시될 수 있다. 분산 컴퓨팅 환경에서, 프로그램 모듈은 로컬 및 원격 메 모리 저장 장치 둘 다에 위치할 수 있다. 컴퓨터는 통상적으로 다양한 컴퓨터 판독가능 매체를 포함한다. 컴퓨터에 의해 액세스 가능한 매체는 그 어떤 것이든지 컴퓨터 판독가능 매체가 될 수 있고, 이러한 컴퓨터 판독가능 매체는 휘발성 및 비휘발성 매체, 일시 적(transitory) 및 비일시적(non-transitory) 매체, 이동식 및 비-이동식 매체를 포함한다. 제한이 아닌 예로서, 컴퓨터 판독가능 매체는 컴퓨터 판독가능 저장 매체 및 컴퓨터 판독가능 전송 매체를 포함할 수 있다. 컴퓨터 판독가능 저장 매체는 컴퓨터 판독가능 명령어, 데이터 구조, 프로그램 모듈 또는 기타 데이터와 같은 정보를 저장하는 임의의 방법 또는 기술로 구현되는 휘발성 및 비휘발성 매체, 일시적 및 비-일시적 매체, 이동 식 및 비이동식 매체를 포함한다. 컴퓨터 판독가능 저장 매체는 RAM, ROM, EEPROM, 플래시 메모리 또는 기타 메 모리 기술, CD-ROM, DVD(digital video disk) 또는 기타 광 디스크 저장 장치, 자기 카세트, 자기 테이프, 자 기 디스크 저장 장치 또는 기타 자기 저장 장치, 또는 컴퓨터에 의해 액세스될 수 있고 원하는 정보를 저장하는 데 사용될 수 있는 임의의 기타 매체를 포함하지만, 이에 한정되지 않는다. 컴퓨터 판독가능 전송 매체는 통상적으로 반송파(carrier wave) 또는 기타 전송 메커니즘(transport mechanis m)과 같은 피변조 데이터 신호(modulated data signal)에 컴퓨터 판독가능 명령어, 데이터 구조, 프로그램 모듈 또는 기타 데이터 등을 구현하고 모든 정보 전달 매체를 포함한다. 피변조 데이터 신호라는 용어는 신호 내에 정보를 인코딩하도록 그 신호의 특성들 중 하나 이상을 설정 또는 변경시킨 신호를 의미한다. 제한이 아닌 예로 서, 컴퓨터 판독가능 전송 매체는 유선 네트워크 또는 직접 배선 접속(direct-wired connection)과 같은 유선 매체, 그리고 음향, RF, 적외선, 기타 무선 매체와 같은 무선 매체를 포함한다. 상술된 매체들 중 임의의 것의 조합도 역시 컴퓨터 판독가능 전송 매체의 범위 안에 포함되는 것으로 한다. 전술한 본 발명은, 프로그램이 기록된 매체에 컴퓨터가 읽을 수 있는 코드로서 구현하는 것이 가능하다. 컴퓨터 가 읽을 수 있는 매체는, 컴퓨터 시스템에 의하여 읽혀질 수 있는 데이터가 저장되는 모든 종류의 기록장치를 포함한다. 컴퓨터가 읽을 수 있는 매체의 예로는, HDD(Hard Disk Drive), SSD(Solid State Disk), SDD(Silicon Disk Drive), ROM, RAM, CD-ROM, 자기 테이프, 플로피 디스크, 광 데이터 저장 장치 등이 있으며, 또한 캐리어 웨이브(예를 들어, 인터넷을 통한 전송)의 형태로 구현되는 것도 포함한다. 또한, 상기 컴퓨터는 단말기의 프로 세서를 포함할 수도 있다. 따라서, 상기의 상세한 설명은 모든 면에서 제한적으로 해석되어서는 아니되고 예시 적인 것으로 고려되어야 한다. 본 발명의 범위는 첨부된 청구항의 합리적 해석에 의해 결정되어야 하고, 본 발 명의 등가적 범위 내에서의 모든 변경은 본 발명의 범위에 포함된다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9"}
{"patent_id": "10-2023-0104880", "section": "도면", "subsection": "도면설명", "item": 1, "content": "다양한 양상들이 이제 도면들을 참조로 기재되며, 여기서 유사한 참조 번호들은 총괄적으로 유사한 구성요소들 을 지칭하는데 이용된다. 이하의 실시예에서, 설명 목적을 위해, 다수의 특정 세부사항들이 하나 이상의 양상들 의 총체적 이해를 제공하기 위해 제시된다. 그러나, 그러한 양상(들)이 이러한 특정 세부사항들 없이 실시될 수 있음은 명백할 것이다. 도 1은 본 개시의 몇몇 실시예에 따른 가상환경에 연결된 사용자 단말에게 알람을 제공하는 일례의 구성도이다. 도 2는 본 개시의 몇몇 실시예에 따른 가상환경에 연결된 사용자 단말에게 알람을 제공하는 제 1 컴퓨팅 장치의 일례를 설명하기 위한 블록 구성도이다. 도 3은 본 개시의 몇몇 실시예에 따른 제 1 컴퓨팅 장치의 가상환경에 연결된 사용자에게 알람을 제공하는 일례의 방법의 흐름도이다. 도 4는 본 개시의 몇몇 실시예에 따른 가상환경에 연결된 사용자에게 알람을 제공하는 사용자 단말의 일례를 설 명하기 위한 블록 구성도이다. 도 5는 본 개시의 몇몇 실시예에 따른 사용자 단말의 가상환경에 연결된 사용자에게 알람을 제공하는 일례의 방 법의 흐름도이다. 도 6은 본 개시의 몇몇 실시예에 따른 알람을 제공하기 위한 알람 정보의 표시 기준을 정의하는 사용자 인터페 이스의 일례의 도시이다. 도 7은 본 개시의 몇몇 실시예에 따른 가상환경에 연결된 사용자에게 알람을 제공하는 사용자 인터페이스의 일 례의 도시이다. 도 8은 본 개시의 몇몇 실시예에 따른 네트워크 함수를 나타낸 개략도이다. 도 9는 본 개시의 몇몇 실시예들이 구현될 수 있는 예시적인 컴퓨팅 환경에 대한 일반적인 개략도이다."}
