{"patent_id": "10-2022-0069720", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0169533", "출원번호": "10-2022-0069720", "발명의 명칭": "저압분전반 전조예측 무정전 진단시스템", "출원인": "사단법인 한국에너지기술연구조합", "발명자": "배석명"}}
{"patent_id": "10-2022-0069720", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "저압분전반을 단상다회로 진단장치, 삼상다회로 진단장치, 열화상 진단센서, 실시간 접지저항 계측장치를 이기종센서 통합 통신장치를 통하여 데이터를 취합하는 무정전 진단부(100),상기 무정전 진단부를 통해 취합된 데이터를 수신한 후 빅데이터 기반의 AI S/W로 분석하는 분석부(200),저압분전반 내부 및 연계된 저압 부하설비의 전기화재, 감전사고, 설비사고를 사전에 감지하여 담당자에게 통보하여 사전에 전기재해를 예방하는 사고감지부(300) 및고장여부 데이터를 수신하여 빅데이터화하여 저압용 누전차단기의 고장상태 확인을 주기적으로 원격 확인 및 관리하는 관제서버(400)를 포함하되,상기 분석부는 저압분전반 내부의 접속단자 발열을 실시간 측정한 데이터를 압축하여 이기종센서 통합 통신장치로 서버에 전송한 후 압축된 데이터를 원상으로 복원한 후 저압분전반 내부의 발열 분포를 빅데이터 기반으로분석하여 저압분전반의 내부 발열 및 단자 접속상태를 실시간으로 통보하는 것을 특징으로 하는 저압분전반 전조예측 무정전 진단시스템."}
{"patent_id": "10-2022-0069720", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 무정전 진단부(100)는 저압분전반의 분기별 전압, 과전류, 누설전류(저항성 포함), FFT(파형분리에 의한아-크 발생)을 실시간 계측 후 이기종센서 통합 통신장치로 서버에 측정 데이터를 전달하는 단상다회로 진단장치(110),저압분전반의 삼상 주회로 상별 전압 및 전류, 역률, 주파수, 전력량, 온도분포를 측정한 데이터를 이기종센서통합 통신장치를 통하여 서버에 전송하는 삼상다회로 진단장치(120),저압분전반 접지선의 접지저항값을 실시간으로 측정하여 접지선의 연속성 데이터를 이기종센서 통합 통신장치로서버에 전송하는 접지저항 계측장치(130),저압분전반 내부의 접속단자 발열을 실시간 측정한 데이터를 압축하여 이기종센서 통합 통신장치로 서버에 전송하는 열화상 진단장치(140)를 포함하여 이기종센서 통합 통신장치(150)를 통하여 데이터를 취합하는 것을 특징으로 하는 저압분전반 전조예측 무정전 진단시스템."}
{"patent_id": "10-2022-0069720", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 분석부(200)는 상기 저압분전반의 분기별 전압, 과전류, 누설전류(저항성 포함), FFT(파형분리에 의한 아-크 발생을 실시간 계측한 데이터를 분석하여 단상 저압 부하설비의 전기재해(전기화재, 감전사고, 설비사고) 발생을 사전에 예측하고 발생 원인을 이상전압, 과전류 및 노후 설비의 전기적으로 규명하여 대처할 수 있도록 하는 단상다회로 전조예측 무정전 진단모듈(210),저압분전반의 삼상 주회로 및 분기회로에 대한 상별 전압 및 전류, 역률, 주파수, 전력량, 온도분포를 측정한데이터를 분석하고 전압/전류 THD, 전류불평형률, 상별 누설전류(저항성) 스칼라합, 내부온도를 분석하여 삼상회로의 전기안전상태를 사전에 감지하여 통보하는 삼상다회로 전조예측 무정전 진단모듈(220),저압분전반 접지선의 접지저항값을 실시간으로 측정한 데이터를 토대로 접지저항값의 변화를 분석하여 접지선의공개특허 10-2023-0169533-3-연속성을 실시간으로 감지하여 통보하는 접지저항 전조예측 진단모듈(230),저압분전반 내부의 접속단자 발열을 실시간 측정한 데이터의 압축된 데이터를 원상으로 복원한 후 저압분전반내부의 발열 분포를 분석하여 저압분전반의 내부 발열 및 단자 접속상태를 실시간으로 감지하여 통보하는 열화상 전조예측 진단모듈(240)을 포함하는 것을 특징으로 하는 저압분전반 전조예측 무정전 진단시스템."}
{"patent_id": "10-2022-0069720", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 관제서버는 빅데이터를 기반으로 저압분전반의 단상 다회로 진단장치, 삼상 다회로 진단장치, 열화상 진단장치, 실시간 접지저항 계측장치를 이용하여 취합된 이상 현상 및 일반 데이터를 전처리한 후, 시계열 예측 모델 및 데이터를 바탕으로 분석한 데이터를 학습된 인공지능/머신러닝 모델을 이용한 판단 알고리즘으로 전기화재, 감전사고, 설비사고의 전기재해 위험 예측데이터 추출하여 경보로 알리는 것을 특징으로 하는 저압분전반전조예측 무정전 진단시스템."}
{"patent_id": "10-2022-0069720", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 저압분전반 전조예측 무정전 진단시스템에 관한 것으로, 저압분전반 및 저압 부하설비의 전기재해(전 기화재, 감전사고 설비사고 등)를 사전에 예측하고 예방하기 위한 저압분전반 전조예측 무정전 진단시스템에 관 한 것이다. 본 발명에 따르면, 저압분전반의 각 진단 데이터를 이기종센서 통합 통신장치를 통하여 수신한 후 빅 데이터 기반으로 분석하고, 저압분전반 내부 및 연계된 저압 부하설비의 전기화재, 감전사고, 설비사고를 사전에 감지하고 담당자에게 통보하여 사전에 전기재해를 예방하며, 고장여부 데이터를 수신하여 빅데이터화하여 저압용 누전차단기의 고장상태 확인을 주기적으로 원격 확인 및 관리함으로써, 빅데이터기반의 AI S/W을 활용한 전조예 측 무정전 진단시스템으로 저압분전반및 저압 부하설비의 전기재해(전기화재, 감전사고 설비사고 등)를 사전에 예측하고 예방하는 효과가 있다."}
{"patent_id": "10-2022-0069720", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 저압분전반 전조예측 무정전 진단시스템에 관한 것으로, 보다 상세하게는 저압분전반 및 저압 부하설 비의 전기재해(전기화재, 감전사고, 설비사고 등)를 사전에 예측하고 예방하기 위한 저압분전반 전조예측 무정 전 진단시스템에 관한 것이다."}
{"patent_id": "10-2022-0069720", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 배전반이나 분전반에 설치된 전기설비에서 절연사고나 부분방전 발생시 이를 감지하여 조속히 유지 보수를 시행하지 않을 경우, 감전사고나 전기화재 등이 발생할 수 있다. 상기 배전반이나 분전반을 구성하는 전기설비 또는 부하설비에서 부분방전, 누설전류 등이 발생하게 되면 전류 펄스, 열, 빛 등 다양한 현상이 발생하게 되며, 일반적으로 배전반 내의 부분방전을 이를 검출하기 위한 인덕턴 스 센서나 고주파CT 등을 배전반의 접지선에 취부하여, 접지선을 통해 흐르는 전류펄스를 측정하거나 광센서를 사용하여 부분방전시 수반되는 가시광선영역의 빛을 측정하는 방식 등을 적용하고 있다. 그러나 배전반이나 분전반에 적용되어 오던 일반적인 절연감시기법은 인입부로부터 유입되는 전류펄스 등의 각 종 노이즈신호와, 배전반의 관찰 창 또는 도어 개방시 유입되는 가시광선에 의해 오류가 쉽게 발생되므로 절연 사고나 부분방전현상등을 효과적으로 감지하기가 어려운 것이 현실이다. 선행기술문헌 특허문헌 (특허문헌 0001) 등록특허 제1336045호 (2013.11.27)"}
{"patent_id": "10-2022-0069720", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상술한 문제를 해결하고자 고안한 것으로, 빅데이터기반의 AI S/W을 활용한 전조예측 무정전 진단시 스템으로 저압분전반 및 저압 부하설비의 전기재해(전기화재, 감전사고, 설비사고 등)를 사전에 예측하고 예방 을 목적으로 한다."}
{"patent_id": "10-2022-0069720", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 따른 저압분전반 전조예측 무정전 진단시스템은 저압분전반을 단상다회로 진단장치, 삼상다회로 진단 장치, 열화상 진단센서, 실시간 접지저항 계측장치를 이용하여 데이터를 이기종센서 통합 통신장치를 통하여 취합하는 무정전 진단부, 상기 무정전 진단부를 통해 취합된 데이터를 수신한 후 빅데이터 기반의 AI S/W로 분석하는 분석부, 저압분전반 내부 및 연계된 저압 부하설비의 전기화재, 감전사고, 설비사고를 사전에 감 지하고 담당자에게 통보하여 사전에 전기재해를 예방하는 사고감지부 및 고장여부 데이터를 수신하여 빅데 이터화하여 저압용 누전차단기의 고장상태 확인을 주기적으로 원격 확인 및 관리하는 관제서버를 포함하되, 상기 분석부는 저압분전반 내부의 접속단자 발열을 실시간 측정한 데이터를 압축하여 이기종센서 통 합 통신장치로 서버에 전송한 후 압축된 데이터를 원상으로 복원한 후 저압분전반 내부의 발열 분포를 빅데이터 기반의 AI S/W로 분석하여 저압분전반의 내부 발열 및 단자 접속상태를 실시간으로 통보한다. 무정전 진단부는 저압분전반의 분기별 전압, 과전류, 누설전류(저항성 포함), FFT(파형분리에 의한 아-크 발생)을 실시간 계측 후 이기종센서 통합 통신장치로 서버에 측정 데이터를 전달하는 단상다회로 진단장치 , 저압분전반의 삼상 주회로 상별 전압 및 전류, 역률, 주파수, 전력량, 온도분포를 측정한 데이터를 이기 종센서 통합 통신장치를 통하여 서버에 전송하는 삼상다회로 진단장치, 저압분전반 접지선의 접지저항값을 실시간으로 측정하여 접지선의 연속성 데이터를 이기종센서 통합 통신장치로 서버에 전송하는 접지저항 계측장 치, 저압분전반 내부의 접속단자 발열을 실시간 측정한 데이터를 압축하여 이기종센서 통합 통신장치로 서 버에 전송하는 열화상 진단장치를 포함하여 이기종센서 통합 통신장치를 통하여 데이터를 취합한다. 분석부는 상기 저압분전반의 분기별 전압, 과전류, 누설전류(저항성 포함), FFT(파형분리에 의한 아-크 발 생을 실시간 계측한 데이터를 분석하여 단상 저압 부하설비의 전기재해(전기화재, 감전사고, 설비사고) 발생을 사전에 예측하고 발생 원인을 이상전압, 과전류 및 노후 설비 등의 전기적으로 규명하여 대처할 수 있도록 하는 단상다회로 전조예측 무정전 진단모듈, 저압분전반의 삼상 주회로 및 분기회로에 대한 상별 전압 및 전류, 역률, 주파수, 전력량, 온도분포를 측정한 데이터를 분석하고 전압/전류 THD, 전류불평형률, 상별 누설전류(저 항성 등) 스칼라합, 내부온도를 분석하여 삼상회로의 전기안전상태를 사전에 감지하여 통보하는 삼상다회로 전 조예측 무정전 진단모듈, 저압분전반 접지선의 접지저항값을 실시간으로 측정한 데이터를 토대로 접지저항 값의 변화를 분석하여 접지선의 연속성을 실시간으로 감지하여 통보하는 접지저항 전조예측 진단모듈, 저 압분전반 내부의 접속단자 발열을 실시간 측정한 데이터의 압축된 데이터를 원상으로 복원한 후 저압분전반 내 부의 발열 분포를 분석하여 저압분전반의 내부 발열 및 단자 접속상태를 실시간으로 감지하여 통보하는 열화상 전조예측 진단모듈을 포함한다. 관제서버는 빅데이터를 기반으로 저압분전반의 단상 다회로 진단장치, 삼상 다회로 진단장치, 열화상 진단장치, 실시간 접지저항 계측장치를 이용하여 취합된 이상 현상 및 일반 데이터를 전처리한 후, 시계열 예측 모델 및 데이터를 바탕으로 분석한 데이터를 학습된 인공지능/머신러닝 모델을 이용한 판단 알고리즘으로 전기화재, 감 전사고, 설비사고의 전기재해 위험 예측데이터 추출하여 경보로 알린다."}
{"patent_id": "10-2022-0069720", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따르면, 빅데이터기반의 AI S/W을 활용한 전조예측 무정전 진단시스템으로 저압분전반 및 저압 부하설비의 전기재해(전기화재, 감전사고 설비사고 등)를 사전에 예측하고 예방하는 효과가 있다."}
{"patent_id": "10-2022-0069720", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 실시예에서 제시되는 특정한 구조 내지 기능적 설명들은 단지 본 발명의 개념에 따른 실시예를 설명 하기 위한 목적으로 예시된 것으로, 본 발명의 개념에 따른 실시예들은 다양한 형태로 실시될 수 있다. 또한, 본 명세서에 설명된 실시예들에 한정되는 것으로 해석되어서는 아니 되며, 본 발명의 사상 및 기술 범위에 포함 되는 모든 변경물, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다.한편, 본 발명에서 제1 및/또는 제2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성 요소들은 상기 용어들에 한정되지는 않는다. 상기 용어들은 하나의 구성요소를 다른 구성요소들과 구별하는 목 적으로만, 예컨대 본 발명의 개념에 따른 권리 범위로부터 벗어나지 않는 범위 내에서, 제1 구성요소는 제2 구 성요소로 명명될 수 있고, 유사하게 제2 구성요소는 제1 구성요소로도 명명될 수 있다. 이하 첨부된 도면을 참조하여 본 발명의 실시예를 설명한다. 본 발명의 실시예를 설명함에 있어서, 관련된 공지 기능 혹은 구성에 대한 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우 그 설명을 생략하였 다. 도 1은 본 발명의 일 실시예에 따른 저압분전반 전조예측 무정전 진단시스템의 구성을 나타낸 도면이다. 도 1에 도시된 바와 같이, 저압분전반 전조예측 무정전 진단시스템은 무정전 진단부, 분석부, 사고감지부 , 관제서버를 포함한다. 무정전 진단부는 저압분전반을 단상다회로 진단장치, 삼상다회로 진단장치, 열화상 진단센서, 실시간 접지 저항 계측장치를 이기종센서 통합 통신장치를 통하여 데이터를 취합한다. 분석부는 무정전 진단부를 통해 취합된 데이터를 수신한 후 빅데이터 기반의 AI S/W로 분석한다. 본 실시 예에 따른 분석부는 저압분전반 내부의 접속단자 발열을 실시간 측정한 데이터를 압축하여 이기종센서 통합 통 신장치로 서버에 전송한 후 압축된 데이터를 원상으로 복원한 후 저압분전반 내부의 발열 분포를 빅데이터 기반 의 AI S/W로 분석하여 저압분전반의 내부 발열 및 단자 접속상태를 실시간으로 통보한다. 사고감지부는 저압분전반 내부 및 연계된 저압 부하설비의 전기화재, 감전사고, 설비사고를 사전에 감지하 여 담당자에게 통보하여 사전에 전기재해를 예방하기 위한 구성이다. 관제서버는 고장여부 데이터를 수신하여 빅데이터화하여 저압용 누전차단기의 고장상태 확인을 주기적으로 원격 확인 및 관리하기 위한 구성이다. 도 2는 본 발명의 일 실시예에 따른 저압분전반 전조예측 무정전 진단시스템의 무정전 진단부 구성을 나타낸 도 면이다. 도 2에 도시된 바와 같이, 무정전 진단부는 단상다회로 진단장치, 삼상다회로 진단장치, 접 지저항 계측장치, 열화상 진단장치를 포함하여 이기종센서 통합 통신장치를 통하여 데이터를 취합한 다. 단상다회로 진단장치는 저압분전반의 분기별 전압, 과전류, 누설전류(저항성 포함), FFT(파형분리에 의한 아-크 발생)을 실시간 계측 후 이기종센서 통합 통신장치로 서버에 측정 데이터를 전달한다. 삼상다회로 진단장치는 저압분전반의 삼상 주회로 상별 전압 및 전류, 역률, 주파수, 전력량, 온도분포를 측정한 데이터를 이기종센서 통합 통신장치를 통하여 서버에 전송한다. 접지저항 계측장치는 저압분전반 접지선의 접지저항값을 실시간으로 측정한 데이터를 이기종센서 통합 통 신장치로 서버에 전송한다. 열화상 진단장치는 저압분전반 내부의 접속단자 발열을 실시간 측정한 데이터를 압축하여 이기종센서 통합 통신장치로 서버에 전송한다. 이러한, 단상다회로 진단장치, 삼상다회로 진단장치, 접지저항 계측장치, 열화상 진단장치(14 0)를 포함하여 이기종센서 통합 통신장치를 통하여 데이터를 취합한다. 도 3은 본 발명의 일 실시예에 따른 저압분전반 전조예측 무정전 진단시스템의 분석부 구성을 나타낸 도면이다. 도 3에 도시된 바와 같이, 분석부는 단상다회로 전조예측 무정전 진단모듈, 삼상다회로 전조예측 무정전 진단모듈, 접지저항 전조예측 진단모듈, 열화상 전조예측 진단모듈을 포함한다. 단상다회로 전조예측 무정전 진단모듈은 저압분전반의 분기별 전압, 과전류, 누설전류(저항성 포함), FFT (파형분리에 의한 아-크 발생을 실시간 계측한 데이터를 분석하여 단상 저압 부하설비의 전기재해(전기화재, 감 전사고, 설비사고) 발생을 사전에 예측하고 발생 원인을 이상전압, 과전류 및 노후 설비 등의 전기적으로 규명 하여 대처할 수 있도록 한다. 삼상다회로 전조예측 무정전 진단모듈는 저압분전반의 삼상 주회로 및 분기회로에 대한 상별 전압 및 전류, 역률, 주파수, 전력량, 온도분포를 측정한 데이터를 분석하고 전압/전류 THD, 전류불평형률, 상별 누설전 류(저항성 등) 스칼라합, 내부온도를 분석하여 삼상회로의 전기안전상태를 사전에 감지하여 통보한다.접지저항 전조예측 진단모듈은 저압분전반 접지선의 접지저항값을 실시간으로 측정한 데이터를 토대로 접 지저항값의 변화를 분석하여 접지선의 연속성을 실시간으로 감지하여 통보한다. 열화상 전조예측 진단모듈은 저압분전반 내부의 접속단자 발열을 실시간 측정한 데이터의 압축된 데이터를 원상으로 복원한 후 저압분전반 내부의 발열 분포를 분석하여 저압분전반의 내부 발열 및 단자 접속상태를 실시 간으로 감지하여 통보한다. 도 4는 본 발명의 일 실시예에 따른 저압분전반 전조예측 무정전 진단시스템의 연결구성을 설명하기 위한 도면 이다. 도 4에 도시된 바와 같이, 본 실시예에 따른 삼상 다회로 진단장치, 단상 다회로 진단장치, 실시간 접지 저항 계측장치, 열화상 계측장치의 진단데이터를 이기종센서 통합 통신장치로 취합하여 빅데이터 기반 AI S/W로 분석하여 전기안전 확인 긴급출동을 위해 통보하도록 한다. 도 4의 신개념 삼상 다회로 진단장치는 삼상다회로 전조예측 무정전 진단모듈에 관한 것으로, 저압분전반 의 삼상 주회로 및 분기회로에 대한 상별 전압 및 전류, 역률, 주파수, 전력량, 온도분포를 측정한 데이터를 분 석하고 전압/전류 THD, 전류불평형률, 상별 누설전류(저항성 등) 스칼라합, 내부온도를 분석하여 삼상회로의 전 기안전상태를 사전에 감지하여 통보한다. 또한 도 4의 신개념 단상 다회로 진단장치는 단상 다회로 전조예측 무정전 진단모듈에 관한 것으로, 저압 분전반의 분기별 전압, 과전류, 누설전류(저항성 포함), FFT(파형분리에 의한 아-크 발생을 실시간 계측한 데이 터를 분석하여 단상 저압 부하설비의 전기재해(전기화재, 감전사고, 설비사고) 발생을 사전에 예측하고 발생 원 인을 이상전압, 과전류 및 노후 설비 등의 전기적으로 규명하여 대처할 수 있도록 한다. 도 4의 실시간 접지저항 계측장치는 접지저항 전조예측 진단모듈에 관한 것으로, 전류센서와 연결되는 전 류측정장치와, 전압출력(비접촉)을 전압측정장치가 제어장치와 연결되어 통신장치로 구성되어 저압분전반 접지 선의 접지저항값을 실시간으로 측정한 데이터를 토대로 접지저항값의 변화를 분석하여 접지선의 연속성을 실시 간으로 감지하여 통보한다. 도 4의 신개념 열화상 계측장치는 열화상 전조예측 진단모듈에 관한 것으로, 저압분전반 내부의 접속단자 발열을 실시간 측정한 데이터의 압축된 데이터를 원상으로 복원한 후 저압분전반 내부의 발열 분포를 분석하여 저압분전반의 내부 발열 및 단자 접속상태를 실시간으로 감지하여 통보한다. 본 실시예에 따른 저압분전반 전조예측 무정전 진단시스템은 도 4의 각 진단장치와 계측장치가 이기종센서 통합 통신장치와 유무선 통신으로 빅데이터 기반 AI S/W탑재 관제서버와 연결되고, 관제서버는 관리자 단말로 전기안 전 확인 긴급출동 명령을 전송한다. 본 실시예에 따른 저압분전반 전조예측 무정전 진단시스템은 빅데이터 기반의 AI S/W 탑재 관제서버는 저압분전 반의 신개념 단상다회로 진단장치, 삼상다회로 진단장치, 신개념 열화상 진단장치, 실시간 접지저항 계측장치를 이용하여 취합된 이상현상 및 일반 데이터를 전처리한 후 시계열 예측 모델 및 데이터를 바탕으로 분석한 데이 터를 학습된 인공지능/머신러닝 모델을 이용한 판단 알고리즘으로 전기화재, 감전사고, 설비사고 등의 전기재해 위험 예측데이터 추출하여 경보로 알리도록 한다. 이에 본 발명의 일 실시예에 따르면, 빅데이터 기반의 AI S/W을 활용한 전조예측 무정전 진단시스템으로 저압분 전반및 저압 부하설비의 전기재해(전기화재, 감전사고 설비사고 등)를 사전에 예측하고 예방하는 효과가 있다. 이상에서 설명한 본 발명은 전술한 실시예 및 첨부된 도면에 의해 한정되는 것이 아니고, 본 발명의 기술적 사 상을 벗어나지 않는 범위 내에서 여러 가지 치환, 변형 및 변경이 가능함은 당업자에게 명백할 것이다.도면 도면1 도면2 도면3 도면4"}
{"patent_id": "10-2022-0069720", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 저압분전반 전조예측 무정전 진단시스템의 구성을 나타낸 도면이다. 도 2는 본 발명의 일 실시예에 따른 저압분전반 전조예측 무정전 진단시스템의 무정전 진단부 구성을 나타낸 도 면이다. 도 3은 본 발명의 일 실시예에 따른 저압분전반 전조예측 무정전 진단시스템의 분석부 구성을 나타낸 도면이다. 도 4는 본 발명의 일 실시예에 따른 저압분전반 전조예측 무정전 진단시스템의 연결구성을 설명하기 위한 도면 이다."}
