{"patent_id": "10-2022-0134996", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0055208", "출원번호": "10-2022-0134996", "발명의 명칭": "참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방법, 장치 및 컴퓨터프로그", "출원인": "주식회사 나니아랩스", "발명자": "신동주"}}
{"patent_id": "10-2022-0134996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "컴퓨팅 장치에 의해 수행되는 생성적 디자인 방법에 있어서, 참조 데이터에 제너레이티브 디자인을 적용하여 상기 참조 데이터와 유사성을 가진 복수의 신규 디자인을 획득하는 과정을 포함하는, 생성적 디자인 방법."}
{"patent_id": "10-2022-0134996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 복수의 신규 디자인을 필터링하는 과정;필터링된 상기 복수의 신규 디자인에 기초하여 디자인 생성 모델을 이용해 생성된 복수의 추가 신규 디자인을획득하는 과정; 상기 복수의 추가 신규 디자인을 필터링하는 과정; 및 필터링된 상기 복수의 추가 신규 디자인을 상기 복수의 참조 데이터로 하여 상기 제너레이티브 디자인을 적용하여 상기 복수의 신규 디자인을 획득하는 과정을 더 포함하는, 생성적 디자인 방법."}
{"patent_id": "10-2022-0134996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 참조 데이터를 획득하는 과정을 더 포함하며, 상기 제1 참조 데이터는 2D 참조 데이터 또는 3D 참조 데이터를 포함하며, 상기 2D 참조 데이터는 형상 이미지 데이터, 패턴 데이터, 스켈레톤 데이터, 그래프 데이터, SDF 데이터(거리정보), 깊이 데이터, 음함수 데이터, Grammar 및 각 형태의 데이터에서 획득한 멀티뷰 데이터 중 적어도 하나를포함하며, 상기 3D 참조 데이터는 CAD 데이터, 복셀 데이터, Mesh 데이터, 포인트클라우드 데이터, Octree 데이터, 형상파라미터 데이터, 패턴 데이터, 스켈레톤 데이터, 그래프 데이터, SDF 데이터(거리 정보), 음함수 (함수식 또는딥러닝 모델) 중 적어도 하나를 포함하는, 생성적 디자인 방법."}
{"patent_id": "10-2022-0134996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 제너레이티브 디자인은 (i) SIMP, ESO, BESO, LevelSet, MMC 및 딥러닝 중 적어도 하나를 이용한 위상최적화 방법론, (ii) 치수 및 형상 최적화 방법론, 및 (iii) 파라매트릭 디자인 방법론 중 적어도 하나를 이용하는, 생성적 디자인 방법."}
{"patent_id": "10-2022-0134996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,(i) 상기 제너레이티브 디자인의 목적 함수를, 사용자가 입력한 요구사항에 대응하는 성능 함수 부분 및 상기 참조 데이터와 유사성을 결정하는 유사도 함수부분으로 구성하거나, 공개특허 10-2024-0055208-3-(ii) 상기 제너레이티브 디자인의 민감도 함수를,사용자가 입력한 요구사항에 대응하는 성능 함수를 미분한 부분 및 상기 참조 데이터와 유사성을 결정하는 유사도 함수 부분으로 구성하는, 생성적 디자인 방법"}
{"patent_id": "10-2022-0134996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제2항에 있어서,상기 복수의 신규 디자인 혹은 추가 신규 디자인을 필터링하는 과정은,신규 디자인의 성능 필터링 과정 및 유사성 필터링 과정 중 적어도 하나를 포함하며, 상기 성능 필터링 과정은 사용자가 설정한 요구사항의 평가를 통한 저성능 신규 디자인을 필터링하며, 상기 유사성 필터링 과정은 상기 신규 디자인의 형상이 존재하는 고차원 도메인 상에서 유사도를 평가하여 필터링하거나, 상기 신규 디자인의 형상을 저차원 도메인 상으로 매핑하여 유사도를 평가하여 필터링하는, 생성적디자인 방법."}
{"patent_id": "10-2022-0134996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제2항에 있어서, 상기 디자인 생성 모델은, 딥러닝 모델, Boolean 모델, Morphing 모델, Interpolation 모델 중 적어도 하나를포함하는, 생성적 디자인 방법."}
{"patent_id": "10-2022-0134996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 복수의 신규 디자인을 이용하여, 암시적 신경 표현 모델을 학습하고, 상기 복수의 신규 디자인를 저차원의연속적이며 파라메트릭한 공간(z)으로 맵핑하여 복수의 디자인 맵핑 데이터를 획득하는 과정; 및 상기 저차원의 연속적이며 파라메트릭한 공간(z)에서 상기 복수의 디자인 맵핑 데이터를 이용하여, 디자인 탐색과정, 디자인 보간 과정, 디자인 성능 예측 과정, 디자인 최적화 과정 및 디자인 역설계 과정 중 적어도 하나를포함하는, 생성적 디자인 방법."}
{"patent_id": "10-2022-0134996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 디자인 최적화 과정에서, 상기 저차원의 연속적이며 파라메트릭한 공간(z)에서 상기 복수의 디자인 맵핑 데이터에 대한 위상최적화 기법을 적용하여 위상최적화를 수행하는, 생성적 디자인 방법."}
{"patent_id": "10-2022-0134996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "프로세서;네트워크 인터페이스;메모리; 및상기 메모리에 로드(load)되고, 상기 프로세서에 의해 실행되는 컴퓨터 프로그램을 포함하되,상기 컴퓨터 프로그램은,제품에 대한 참조 데이터에 제너레이티브 디자인을 적용하여 상기 참조 데이터와 유사성을 가진 복수의 신규 디자인을 획득하는 인스트럭션을 포함하는, 생성적 디자인 장치."}
{"patent_id": "10-2022-0134996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "공개특허 10-2024-0055208-4-컴퓨팅 장치와 결합되어,제품에 대한 참조 데이터에 제너레이티브 디자인을 적용하여 상기 참조 데이터와 유사성을 가진 복수의 신규 디자인을 획득하는 과정을 실행시키기 위하여 컴퓨터로 판독가능한 기록매체에 저장된, 생성적 디자인 컴퓨터 프로그램."}
{"patent_id": "10-2022-0134996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "컴퓨팅 장치에 의해 수행되는 방법에 있어서,제품에 대한 복수의 디자인(X)를 암시적 신경 표현 모델을 이용해 저차원의 잠재공간(z)으로 맵핑하여 복수의디자인 맵핑 데이터(Z)를 획득하는 과정; 및상기 잠재공간(z)에서 상기 복수의 디자인 맵핑 데이터를 이용하여, 디자인 탐색 과정, 디자인 보간 과정, 디자인 성능 예측 과정, 디자인 최적화 과정 및 디자인 역설계 과정 중 적어도 하나를 포함하는, 생성적 디자인 방법."}
{"patent_id": "10-2022-0134996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 디자인 탐색 과정은, 상기 잠재공간(z)에서 상기 복수의 디자인 맵핑 데이터(Z) 중 제1 디자인 맵핑 데이터(Z1)를 탐색하고, 상기 제1 디자인 맵핑 데이터(Z1)에 대응하는 제1 디자인(X1)를 획득하는, 생성적 디자인 방법."}
{"patent_id": "10-2022-0134996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12항에 있어서,상기 디자인 보간 과정은, 상기 잠재공간(z)에서 상기 복수의 디자인 맵핑 데이터(Z) 중 N 개의 데이터를 선택해 보간 방법을 통해 제2 디자인 매핑 데이터(Z2)로 보간하고, 상기 보간된 제2 디자인 맵핑 데이터(Z2)에 대응하는 제2 디자인(X2)를 획득하는, 생성적 디자인 방법."}
{"patent_id": "10-2022-0134996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제12항에 있어서,상기 디자인 예측 과정은, 상기 잠재공간(z)의 상기 복수의 디자인 맵핑 데이터(Z) 및 상기 복수의 디자인 맵핑데이터(Z)에 대응하는 상기 복수의 디자인(X)의 성능 데이터(Y)로 학습된 성능 예측 모델을 이용해서, 제3 디자인(X3)에 대한 제3 디자인 맵핑 데이터(Z3)를 통해 예측 성능 데이터(Y3')를 예측하는, 생성적 디자인 방법."}
{"patent_id": "10-2022-0134996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제12항에 있어서,상기 디자인 최적화 과정은, 상기 복수의 디자인(X)의 성능 데이터(Y)에 기초해서, 상기 잠재공간(z) 내에서 제4 디자인(X4)에 대응하는 제4 디자인 맵핑 데이터(Z4)를 최적화하고, 최적화된 제4 디자인(X4')을 획득하는, 생성적 디자인 방법."}
{"patent_id": "10-2022-0134996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제12항에 있어서,상기 역설계 과정은, 상기 잠재공간(z)의 성능 데이터(Y) 및 상기 성능 데이터(Y)에 대응하는 상기 복수의 디자인 맵핑 데이터(Z)로 학습된 역 설계 모델을 이용해서, 제5 성능 데이터(Y5)에 대응하는 제5 디자인 맵핑 데이터(Z5)를 획득하고, 상기 제5 디자인 맵핑 데이터(Z5)에 대응하는 제5 디자인 데이터(X5)을 획득하는, 생성적 디자인 방법.공개특허 10-2024-0055208-5-"}
{"patent_id": "10-2022-0134996", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 실시예는, 컴퓨팅 장치에 의해 수행되는 생성적 디자인 방법에 있어서, 참조 데이터에 제너레이티브 디자인을 적용하여 상기 참조 데이터와 유사성을 가진 복수의 신규 디자인을 획득하는 과정을 포함하는, 생성적 디자인 방법을 제공할 수 있다."}
{"patent_id": "10-2022-0134996", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방법, 장치 및 컴퓨터프로그램에 관 한 것이다."}
{"patent_id": "10-2022-0134996", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "국내외 다양한 산업 분야에서 인공지능(AI)를 활용해 제품 개발 프로세스를 자동화하여, 제품 개발의 시간을 단 축하고 비용을 최소화하여 제품 경쟁력을 향상시키려고 노력하고 있다. 데이터가 부족한 환경에서 인공지능 모델을 학습하기 위해 합성데이터(Synthetic data)의 활용이 필수적이다. 합성데이터란 시뮬레이션 등 다양한 자동화 기술을 통해 인위적으로 생성된 데이터를 말한다. 그러나, 3D 엔지니어링 데이터의 경우는 다른 데이터에 비해 기술적인 노하우가 필요한 엔지니어링 도메인을 이 해하면서 물리적으로 의미있는 합성데이터를 생성해내야 하기 때문에, 실제 제품 개발 현장에서 인공지능 학습 에 사용할 수 있는 대량의 3D 엔지니어링 데이터의 구축에 어려움을 겪고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 등록특허공보 등록번호 제10-2079027호 (딥러닝 기술을 이용한 위상최적설계 방법)"}
{"patent_id": "10-2022-0134996", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 실시예는, 다품종 소량 생산이 필요한 제품과 심미성 고려가 필요한 제품의 다양한 디자인을 생성할 수 있는, 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방법, 장치 및 컴퓨터프로그램을 제 공하는데 목적을 가진다. 본 발명의 실시예는, 제품에 대한 소량의 참조 데이터 혹은 참조 데이터가 없는 경우라도 제품에 대한 복수의 신규 디자인을 자동적으로 생성할 수 있는, 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방 법, 장치 및 컴퓨터프로그램을 제공하는데 목적을 가진다. 본 발명의 실시예는, 3차원 제품에 대한 이미지 혹은 모델링으로 3차원 제품에 대한 신규 디자인을 제공할 수 있는, 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방법, 장치 및 컴퓨터프로그램을 제공하 는데 목적을 가진다. 본 발명의 실시예는, 모든 시드 데이터를 딥러닝을 통해 저차원의 잠재공간으로 맵핑한 후 잠재공간 내에서 맵 핑된 데이터를 처리하여, 인공지능 모델의 학습을 위한 합성 데이터를 생성할 수 있는, 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방법, 장치 및 컴퓨터프로그램을 제공하는데 목적을 가진다. 본 발명의 실시예는, 저차원 공간의 디자인 맵핑 데이터를 이용해 디자인 데이터를 실시간으로 생성 및 탐색할 수 있는, 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방법, 장치 및 컴퓨터프로그램을 제 공하는데 목적을 가진다. 본 발명의 일 실시예는, 참조 데이터를 이용해 제품 혹은 가상제품을 개발을 위한 2D/3D 합성 데이터인 신규 디 자인을 생성하는, 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방법, 장치 및 컴퓨터프로그 램을 제공하는데 목적을 가진다. 본 발명의 일 실시예는, 디자인 스페이스라 불리는 저차원 공간(z)에서 디자인 요구사항을 만족하는 다양한 디 자인을 탐색할 수 있는, 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방법, 장치 및 컴퓨터 프로그램을 제공하는데 목적을 가진다. 본 발명의 일 실시예는 제품의 공학적인 요구사항을 만족하는 디자인을 생성할 수 있는, 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방법, 장치 및 컴퓨터프로그램을 제공하는데 목적을 가진다. 본 발명의 일 실시예는, 생성된 신규 디자인을 CAE 해석 자동화를 통해 오토 라벨링할 수 있는 방법을 제공하는, 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방법, 장치 및 컴퓨터프로그램을 제 공하는데 목적을 가진다. 본 발명의 일 실시예는, 신규 디자인을 생성하고, 생성된 신규 디자인(예로, 3D 합성 데이터)를 이용해 학습된 인공지능 모델을 이용해 신규 디자인을 활용한 제품의 디자인 기술을 제공하는, 참조 데이터와 암시적 신경 표 현 기반의 최적화된 생성적 디자인 방법, 장치 및 컴퓨터프로그램을 제공하는데 목적을 가진다. 본 발명의 일 실시예는, 소량의 참조 데이터를 이용해 신규 디자인을 생성하고, 생성된 신규 디자인을 인공지 능 모델에 학습시킬 수 있는 딥 제너레이티브 디자인(Deep Generative Design) 서비스를 제공하는, 참조 데이터 와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방법, 장치 및 컴퓨터프로그램을 제공하는데 목적을 가진 다. 본 발명의 일 실시예는, 제조업 분야의 제품 개발 현장에서 발생하는 데이터의 부족 문제와 AI 전문가의 부족 문제를 동시에 해결할 수 있는, 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방법, 장치 및 컴퓨터프로그램을 제공하는데 목적을 가진다. 본 발명의 일 실시예는, 컨셉 디자인 단계에서 과거에 고려하지 못했던 새로운 디자인안을 효과적으로 탐색함과 동시에, 다양한 성능을 고려한 최적화된 디자인을 실시간에 가까운 빠른 속도로 제안할 수 있는, 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방법, 장치 및 컴퓨터프로그램을 제공하는데 목적을 가진다."}
{"patent_id": "10-2022-0134996", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시예는, 컴퓨팅 장치에 의해 수행되는 생성적 디자인 방법에 있어서, 참조 데이터에 제너레이티브 디자인을 적용하여 상기 참조 데이터와 유사성을 가진 복수의 신규 디자인을 획득하는 과정을 포함하는, 생성적 디자인 방법을 제공할 수 있다. 본 발명의 실시예는, 상기 복수의 신규 디자인을 필터링하는 과정; 필터링된 상기 복수의 신규 디자인에 기초하 여 디자인 생성 모델을 이용해 생성된 복수의 추가 신규 디자인을 획득하는 과정; 상기 복수의 추가 신규 디자 인을 필터링하는 과정; 및 필터링된 상기 복수의 추가 신규 디자인을 상기 복수의 참조 데이터로 하여 상기 제 너레이티브 디자인을 적용하여 상기 복수의 신규 디자인을 획득하는 과정을 더 포함하는, 생성적 디자인 방법을 제공할 수 있다. 본 발명의 실시예는, 상기 참조 데이터를 획득하는 과정을 더 포함하며, 상기 제1 참조 데이터는 2D 참조 데이 터 또는 3D 참조 데이터를 포함하며, 상기 2D 참조 데이터는 형상 이미지 데이터, 패턴 데이터, 스켈레톤 데이 터, 그래프 데이터, SDF 데이터(거리 정보), 깊이 데이터, 음함수 데이터, Grammar 및 각 형태의 데이터에서 획 득한 멀티뷰 데이터 중 적어도 하나를 포함하며, 상기 3D 참조 데이터는 CAD 데이터, 복셀 데이터, Mesh 데이터, 포인트클라우드 데이터, Octree 데이터, 형상 파라미터 데이터, 패턴 데이터, 스켈레톤 데이터, 그래프 데이터, SDF 데이터(거리 정보), 음함수 (함수식 또는 딥러닝 모델) 중 적어도 하나를 포함하는, 생성적 디자인 방법을 제공할 수 있다. 본 발명의 실시예는, 상기 제너레이티브 디자인은 (i) SIMP, ESO, BESO, LevelSet, MMC, 및 딥러닝 중 적어도 하나를 이용한 위상최적화 방법론, (ii) 치수 및 형상 최적화 방법론, 및 (iii) 파라매트릭 디자인 방법론 중 적어도 하나를 이용하는, 생성적 디자인 방법을 제공할 수 있다. 본 발명의 실시예는, 상기 제너레이티브 디자인의 목적 함수를, 사용자가 입력한 요구사항에 대응하는 성능 함 수 부분 및 상기 참조 데이터와 유사성을 결정하는 유사도 함수 부분으로 구성하는, 생성적 디자인 방법을 제공 할 수 있다. 본 발명의 실시예는, 상기 제너레이티브 디자인의 민감도 함수를, 사용자가 입력한 요구사항에 대응하는 성능 함수를 미분한 부분 및 상기 참조 데이터와 유사성을 결정하는 유사도 함수 부분으로 구성하는, 생성적 디자인방법을 제공할 수 있다. 본 발명의 실시예는, 상기 복수의 신규 디자인 혹은 추가 신규 디자인을 필터링하는 과정은, 신규 디자인의 성 능 필터링 과정 및 유사성 필터링 과정 중 적어도 하나를 포함하며, 상기 성능 필터링 과정은 사용자가 설정한 요구사항의 평가를 통한 저성능 신규 디자인을 필터링하며, 상기 유사성 필터링 과정은 상기 신규 디자인의 형 상이 존재하는 고차원 도메인 상에서 유사도를 평가하여 필터링하거나, 상기 신규 디자인의 형상을 저차원 도메 인 상으로 매핑하여 유사도를 평가하여 필터링하는, 생성적 디자인 방법을 제공할 수 있다. 본 발명의 실시예는, 상기 디자인 생성 모델은, 딥러닝 모델, Boolean 모델, Morphing 모델, Interpolation 모 델 중 적어도 하나를 포함하는, 생성적 디자인 방법을 제공할 수 있다. 본 발명의 실시예는, 상기 복수의 신규 디자인을 이용하여, 암시적 신경 표현 모델을 학습하고, 상기 복수의 신 규 디자인를 저차원의 연속적이며 파라메트릭한 공간(z)으로 맵핑하여 복수의 디자인 맵핑 데이터를 획득하는 과정; 및 상기 저차원의 연속적이며 파라메트릭한 공간(z)에서 상기 복수의 디자인 맵핑 데이터를 이용하여, 디 자인 탐색 과정, 디자인 보간 과정, 디자인 성능 예측 과정, 디자인 최적화 과정 및 디자인 역설계 과정 중 적 어도 하나를 포함하는, 생성적 디자인 방법을 제공할 수 있다. 본 발명의 실시예는, 상기 디자인 최적화 과정에서, 상기 저차원의 연속적이며 파라메트릭한 공간(z)에서 상기 복수의 디자인 맵핑 데이터에 대한 위상최적화 기법을 적용하여 위상최적화를 수행하는, 생성적 디자인 방법을 제공할 수 있다. 본 발명의 실시예는, 프로세서; 네트워크 인터페이스; 메모리; 및 상기 메모리에 로드(load)되고, 상기 프로세 서에 의해 실행되는 컴퓨터 프로그램을 포함하되, 상기 컴퓨터 프로그램은, 제품에 대한 참조 데이터에 제너레 이티브 디자인을 적용하여 상기 참조 데이터와 유사성을 가진 복수의 신규 디자인을 획득하는 인스트럭션을 포 함하는, 생성적 디자인 장치를 제공할 수 있다. 본 발명의 실시예는, 컴퓨팅 장치와 결합되어, 제품에 대한 참조 데이터에 제너레이티브 디자인을 적용하여 상 기 참조 데이터와 유사성을 가진 복수의 신규 디자인을 획득하는 과정을 실행시키기 위하여 컴퓨터로 판독가능 한 기록매체에 저장된, 생성적 디자인 컴퓨터 프로그램을 제공할 수 있다. 본 발명의 실시예는, 컴퓨팅 장치에 의해 수행되는 방법에 있어서, 제품에 대한 복수의 디자인(X)를 암시적 신 경 표현 모델을 이용해 저차원의 잠재공간(z)으로 맵핑하여 복수의 디자인 맵핑 데이터(Z)를 획득하는 과정; 및 상기 잠재공간(z)에서 상기 복수의 디자인 맵핑 데이터를 이용하여, 디자인 탐색 과정, 디자인 보간 과정, 디자 인 성능 예측 과정, 디자인 최적화 과정 및 디자인 역설계 과정 중 적어도 하나를 포함하는, 생성적 디자인 방 법을 제공할 수 있다. 본 발명의 실시예는, 상기 디자인 탐색 과정은, 상기 잠재공간(z)에서 상기 복수의 디자인 맵핑 데이터(Z) 중 제1 디자인 맵핑 데이터(Z1)를 탐색하고, 상기 제1 디자인 맵핑 데이터(Z1)에 대응하는 제1 디자인(X1)를 획득하 는, 생성적 디자인 방법을 제공할 수 있다. 본 발명의 실시예는, 상기 디자인 보간 과정은, 상기 잠재공간(z)에서 상기 복수의 디자인 맵핑 데이터(Z) 중 N 개의 데이터를 선택해 보간 방법을 통해 제2 디자인 매핑 데이터(Z2)로 보간하고, 상기 보간된 제2 디자인 맵핑 데이터(Z2)에 대응하는 제2 디자인(X2)를 획득하는, 생성적 디자인 방법을 제공할 수 있다. 본 발명의 실시예는, 상기 디자인 예측 과정은, 상기 잠재공간(z)의 상기 복수의 디자인 맵핑 데이터(Z) 및 상 기 복수의 디자인 맵핑 데이터(Z)에 대응하는 상기 복수의 디자인(X)의 성능 데이터(Y)로 학습된 성능 예측 모 델을 이용해서, 제3 디자인(X3)에 대한 제3 디자인 맵핑 데이터(Z3)를 통해 예측 성능 데이터(Y3')를 예측하는, 생성적 디자인 방법을 제공할 수 있다. 본 발명의 실시예는, 상기 디자인 최적화 과정은, 상기 복수의 디자인(X)의 성능 데이터(Y)에 기초해서, 상기 잠재공간(z) 내에서 제4 디자인(X4)에 대응하는 제4 디자인 맵핑 데이터(Z4)를 최적화하고, 최적화된 제4 디자인 (X4')을 획득하는, 생성적 디자인 방법을 제공할 수 있다. 본 발명의 실시예는, 상기 역설계 과정은, 상기 잠재공간(z)의 성능 데이터(Y) 및 상기 성능 데이터(Y)에 대응 하는 상기 복수의 디자인 맵핑 데이터(Z)로 학습된 역 설계 모델을 이용해서, 제5 성능 데이터(Y5)에 대응하는 제5 디자인 맵핑 데이터(Z5)를 획득하고, 상기 제5 디자인 맵핑 데이터(Z5)에 대응하는 제5 디자인 데이터(X5)을획득하는, 생성적 디자인 방법을 제공할 수 있다."}
{"patent_id": "10-2022-0134996", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예는, 참조 데이터의 종류에 상관없이 공학적 성능이 담보되면서 외적 심미감을 가지는 신규 디 자인을 제공하는, 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방법, 장치 및 컴퓨터프로그 램을 제공할 수 있다. 본 발명의 실시예는, 제품에 대한 2차원 혹은 2.5차원 데이터뿐만 아니라 제품에 대한 3차원 데이터를 참조 데 이터로 하여 제품에 대한 2차원 혹은 3차원 신규 디자인을 생성하는, 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방법, 장치 및 컴퓨터프로그램을 제공할 수 있다. 본 발명의 실시예는, 쉽게 수집 가능한 제품에 대한 2차원 데이터를 이용하여 제품에 대한 3차원 신규 디자인을 도출할 수 있는, 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방법, 장치 및 컴퓨터프로그 램을 제공할 수 있다. 본 발명의 실시예는, 제품에 대한 컨셉 디자인 시에 제품의 멀티뷰에 대한 참조 데이터를 반영하여 신규 디자인 이 가능한, 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방법, 장치 및 컴퓨터프로그램을 제공할 수 있다. 본 발명의 실시예는, 제품에 대한 성능을 만족하면서 사용자가 원하는 멀티뷰에 대한 심미성을 가지는 제품의 3 차원 신규 디자인을 제공하는, 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방법, 장치 및 컴퓨터프로그램을 제공할 수 있다. 본 발명의 실시예는, 모든 시드 데이터를 딥러닝을 통해 저차원의 잠재공간으로 맵핑한 후 잠재공간 내에서 맵 핑된 데이터를 처리하여, 인공지능 모델의 학습을 위한 합성 데이터를 생성할 수 있는, 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방법, 장치 및 컴퓨터프로그램을 제공할 수 있다. 본 발명의 실시예는, 저차원 공간의 디자인 맵핑 데이터를 이용해 디자인 데이터를 실시간으로 생성 및 탐색할 수 있는, 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방법, 장치 및 컴퓨터프로그램을 제 공할 수 있다. 본 발명의 일 실시예는, 참조 데이터를 이용해 제품 혹은 가상제품을 개발을 위한 2D/3D 합성 데이터인 신규 디 자인을 생성하는, 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방법, 장치 및 컴퓨터프로그 램을 제공할 수 있다. 본 발명의 일 실시예는, 디자인 스페이스라 불리는 저차원 공간(z)에서 디자인 요구사항을 만족하는 다양한 디 자인을 탐색할 수 있는, 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방법, 장치 및 컴퓨터 프로그램을 제공할 수 있다. 본 발명의 일 실시예는 제품의 공학적인 요구사항을 만족하는 디자인을 생성할 수 있는, 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방법, 장치 및 컴퓨터프로그램을 제공할 수 있다. 본 발명의 일 실시예는, 생성된 신규 디자인을 CAE 해석 자동화를 통해 오토 라벨링할 수 있는 방법을 제공하는, 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방법, 장치 및 컴퓨터프로그램을 제 공할 수 있다. 본 발명의 일 실시예는, 신규 디자인을 생성하고, 생성된 신규 디자인(예로, 3D 합성 데이터)를 이용해 학습된 인공지능 모델을 이용해 신규 디자인을 활용한 제품의 디자인 기술을 제공하는, 참조 데이터와 암시적 신경 표 현 기반의 최적화된 생성적 디자인 방법, 장치 및 컴퓨터프로그램을 제공할 수 있다. 본 발명의 일 실시예는, 소량의 참조 데이터를 이용해 신규 디자인을 생성하고, 생성된 신규 디자인을 인공지 능 모델에 학습시킬 수 있는 딥 제너레이티브 디자인(Deep Generative Design) 서비스를 제공하는, 참조 데이터 와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방법, 장치 및 컴퓨터프로그램을 제공할 수 있다. 본 발명의 일 실시예는, 제조업 분야의 제품 개발 현장에서 발생하는 데이터의 부족 문제와 AI 전문가의 부족 문제를 동시에 해결할 수 있는, 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방법, 장치 및컴퓨터프로그램을 제공할 수 있다. 본 발명의 일 실시예는, 컨셉 디자인 단계에서 과거에 고려하지 못했던 새로운 디자인안을 효과적으로 탐색함과 동시에, 다양한 성능을 고려한 최적화된 디자인을 실시간에 가까운 빠른 속도로 제안할 수 있는, 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방법, 장치 및 컴퓨터프로그램을 제공할 수 있다."}
{"patent_id": "10-2022-0134996", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 실시예들은 다양한 변경들을 가할 수 있으므로 실시예들을 도면에 예시하고 본 명세서에서 상세하게 설명하고자 한다. 그러나, 이는 본 발명의 실시예들을 특정한 형태들로 한정하려는 것이 아니며, 본 발명의 사 상 및 기술 범위에 포함되는 모든 변경, 균등물, 또는 대체물을 포함한다. 본 명세서에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명 세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함한다 (comprises)\" 및/또는 \"포함하는(comprising)\"은 언급된 구성요소 외에 하나 이상의 다른 구성요소의 존재 또는 추가를 배제하지 않는다. 명세서 전체에 걸쳐 동일한 도면 부호는 동일한 구성 요소를 지칭하며, \"및/또는\"은 언급된 구성요소들의 각각 및 하나 이상의 모든 조합을 포함한다. 비록 \"제1\", \"제2\" 등이 다양한 구성요소들을 서술하기 위해서 사용되나, 이들 구성요소들은 이들 용어에 의해 제한되지 않음은 물론이다. 이들 용어들은 단 지 하나의 구성요소를 다른 구성요소와 구별하기 위하여 사용하는 것이다. 따라서, 이하에서 언급되는 제1 구성 요소는 본 발명의 기술적 사상 내에서 제2 구성요소일 수도 있음은 물론이다. 본 명세서에서 A, B 및 C 중 적어 도 하나를 포함한다는 의미는 A, B, 및 C 중 1개 혹은 2개 이상의 다양한 조합을 모두 포함하는 것으로 한다. 예로, {A}, {B}, {C}, {A, B}, {A, C}, {B, C}, {A, B, C} 이다. 다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본 발명이 속하는 기술 분야의 통상의 기술자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것이다. 또한, 일반적으로 사용되 는 사전에 정의되어 있는 용어들은 명백하게 특별히 정의되어 있지 않는 한 이상적으로 또는 과도하게 해석되지 않는다. 명세서에서 사용되는 \"부\" 또는 \"모듈\"이라는 용어는 소프트웨어, FPGA 또는 ASIC과 같은 하드웨어 구성요소를 의미하며, \"부\" 또는 \"모듈\"은 어떤 역할들을 수행한다. 그렇지만 \"부\" 또는 \"모듈\"은 소프트웨어 또는 하드웨 어에 한정되는 의미는 아니다. \"부\" 또는 \"모듈\"은 어드레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 \"부\" 또는 \"모듈\"은 소 프트웨어 구성요소들, 객체지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성 요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌 웨어, 마이크로 코드, 회로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레이들 및 변수들을 포함한다. 구성요소들과 \"부\" 또는 \"모듈\"들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 \"부\" 또는 \"모듈\"들로 결합되거나 추가적인 구성요소들과 \"부\" 또는 \"모듈\"들로 더 분리될 수 있다. 공간적으로 상대적인 용어인 \"아래(below)\", \"아래(beneath)\", \"하부(lower)\", \"위(above)\", \"상부(upper)\" 등 은 도면에 도시되어 있는 바와 같이 하나의 구성요소와 다른 구성요소들과의 상관관계를 용이하게 기술하기 위 해 사용될 수 있다. 공간적으로 상대적인 용어는 도면에 도시되어 있는 방향에 더하여 사용시 또는 동작시 구성 요소들의 서로 다른 방향을 포함하는 용어로 이해되어야 한다. 예를 들어, 도면에 도시되어 있는 구성요소를 뒤 집을 경우, 다른 구성요소의 \"아래(below)\" 또는 \"아래(beneath)\"로 기술된 구성요소는 다른 구성요소의 \"위 (above)\"에 놓여질 수 있다. 따라서, 예시적인 용어인 \"아래\"는 아래와 위의 방향을 모두 포함할 수 있다. 구성 요소는 다른 방향으로도 배향될 수 있으며, 이에 따라 공간적으로 상대적인 용어들은 배향에 따라 해석될 수 있 다. 이하, 첨부된 도면을 참조하여 본 발명의 실시예에 따른 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성 적 디자인 방법, 장치 및 컴퓨터프로그램을 상세하게 설명한다. 도 1은 본 발명의 일 실시예에 따른 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 장치의 하 드웨어 구성도이다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 장치(이하, \"컴퓨팅 장치\")는 하나 이상의 프로세서, 프로세서에 의하여 수행되는 컴퓨터 프로그램을 로드(Load)하는 메모리, 통신 인터페이스 및 컴퓨터 프로그램을 저장하는 스토 리지를 포함할 수 있다. 여기서, 본 발명의 일 실시예에 따른 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 장치 는 도 1에 도시된 구성요소들에 의해 한정될 것은 아니며, 다른 범용적인 구성요소들을 더 포함할 수 있다. 다양한 실시예에서, 컴퓨팅 장치는 적어도 하나의 프로세서를 포함하는 모든 종류의 하드웨어 장치를 의미하는 것이고, 실시 예에 따라 해당 하드웨어 장치에서 동작하는 소프트웨어적 구성도 포괄하는 의미로서 이 해될 수 있다. 컴퓨팅 장치는 서버, 스마트폰, 태블릿 PC, 데스크톱, 노트북 및 각 장치에서 구동되는 사용자 클라이언트 및 애플리케이션을 모두 포함하는 의미로서 이해될 수 있으며, 또한 이에 제한되는 것은 아니다. 본 발명의 실시예에 따른 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방법의 각 과정들은 컴퓨팅 장치에 의하여 수행되는 것으로 설명되나, 각 과정의 주체는 이에 제한되는 것은 아니며, 실시 예 에 따라 각 과정들의 적어도 일부가 서로 다른 컴퓨팅 장치에서 수행될 수도 있다. 프로세서는 컴퓨팅 장치의 각 구성의 전반적인 동작을 제어한다. 프로세서는 CPU(Central Processing Unit), MPU(Micro Processor Unit), MCU(Micro Controller Unit), GPU(Graphic Processing Unit) 또는 본 발명의 기술 분야에 잘 알려진 임의의 형태의 프로세서를 포함하여 구성될 수 있다. 또한, 프로세서는 본 발명의 실시예에 따른 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자 인 방법을 실행하기 위한 적어도 하나의 애플리케이션 또는 프로그램에 대한 연산을 수행할 수 있으며, 컴퓨팅 장치는 하나 이상의 프로세서를 구비할 수 있다. 또한, 프로세서는 내부에서 처리되는 신호(또는, 데이터)를 일시적 및/또는 영구적으로 저장하는 램(RAM: Random Access Memory, 미도시) 및 롬(ROM: Read-Only Memory, 미도시)을 더 포함할 수 있다. 또한, 프로세서 는 그래픽 처리부, 램 및 롬 중 적어도 하나를 포함하는 시스템온칩(SoC: system on chip) 형태로 구현될 수 있다. 메모리는 각종 데이터, 명령 및/또는 정보를 저장한다. 메모리는 본 발명의 실시예에 따른 참조 데이 터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방법을 실행하기 위하여 스토리지로부터 컴퓨터 프 로그램을 로드할 수 있다. 메모리에 컴퓨터 프로그램이 로드되면, 프로세서는 컴퓨터 프로 그램을 구성하는 하나 이상의 인스트럭션들을 실행함으로써 상기 방법을 수행할 수 있다. 메모리는 RAM과 같은 휘발성 메모리로 구현될 수 있을 것이나, 본 개시의 기술적 범위가 이에 한정되는 것은 아니다. 버스(BUS)는 컴퓨팅 장치의 구성 요소 간 통신 기능을 제공한다. 버스(BUS)는 주소 버스(address Bus), 데 이터 버스(Data Bus) 및 제어 버스(Control Bus) 등 다양한 형태의 버스로 구현될 수 있다. 통신 인터페이스는 컴퓨팅 장치의 유무선 인터넷 통신을 지원한다. 또한, 통신 인터페이스는 인 터넷 통신 외의 다양한 통신 방식을 지원할 수도 있다. 예를 들어, 통신 인터페이스는, 근거리 통신, 이동 통신, 방송 통신 방식 중 적어도 하나를 지원할 수 있다. 이를 위해, 통신 인터페이스는 본 발명의 기술 분야에 잘 알려진 통신 모듈을 포함하여 구성될 수 있다. 몇몇 실시예에서, 통신 인터페이스는 생략될 수 도 있다. 스토리지는 컴퓨터 프로그램을 비 임시적으로 저장할 수 있다. 스토리지는 ROM(Read Only Memory), EPROM(Erasable Programmable ROM), EEPROM(Electrically Erasable Programmable ROM), 플래시 메모 리 등과 같은 비휘발성 메모리, 하드 디스크, 착탈형 디스크, 또는 본 발명이 속하는 기술 분야에서 잘 알려진 임의의 형태의 컴퓨터로 읽을 수 있는 기록 매체를 포함하여 구성될 수 있다. 컴퓨터 프로그램은 메모리에 로드될 때 프로세서로 하여금 본 발명의 실시예에 따른 참조 데이 터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방법을 수행하도록 하는 하나 이상의 인스트럭션들을 포 함할 수 있다. 즉, 프로세서는 상기 하나 이상의 인스트럭션들을 실행함으로써, 본 발명의 다양한 실시예 에 따른 상기 방법을 수행할 수 있다. 본 발명의 실시예에 따른 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방법의 과정들은 하 드웨어로 직접 구현되거나, 하드웨어에 의해 실행되는 소프트웨어 모듈로 구현되거나, 또는 이들의 결합에 의해 구현될 수 있다. 소프트웨어 모듈은 RAM(Random Access Memory), ROM(Read Only Memory), EPROM(Erasable Programmable ROM), EEPROM(Electrically Erasable Programmable ROM), 플래시 메모리(Flash Memory), 하드 디스크, 착탈형 디스크, CD-ROM, 또는 본 발명이 속하는 기술 분야에서 잘 알려진 임의의 형태의 컴퓨터 판독가 능 기록매체에 상주할 수도 있다. 본 발명의 실시예에 따른 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방법의 과정들은 하 드웨어인 컴퓨터와 결합되어 실행되기 위해 프로그램(또는 애플리케이션)으로 구현되어 매체에 저장될 수 있다. 본 발명의 구성 요소들은 소프트웨어 프로그래밍 또는 소프트웨어 요소들로 실행될 수 있으며, 이와 유사하게, 실시 예는 데이터 구조, 프로세스들, 루틴들 또는 다른 프로그래밍 구성들의 조합으로 구현되는 다양한 알고리 즘을 포함하여, C, C++, 자바(Java), 어셈블러(assembler) 등과 같은 프로그래밍 또는 스크립팅 언어로 구현될 수 있다. 기능적인 측면들은 하나 이상의 프로세서들에서 실행되는 알고리즘으로 구현될 수 있다. 이하에서, 본 발명의 실시예에 따른 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방법에 대 해 설명한다. 도 2은 본 발명의 일 실시예에 따른 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방법의 순 서도이다. 도 3은 본 발명의 실시예에 따른 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방 법의 구성 블록도이다. 도 4은 본 발명의 일 실시예에 따른 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방법의 개념도이다. 도 2를 참조하면, 본 발명의 일 실시예에 따른 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방법은, 디자인의 생성 과정(S10), 디자인의 탐색 과정(S20), 디자인의 예측 과정(S30), 디자인의 최적화 과정 (S40) 중 적어도 하나 혹은 2개 이상의 조합으로 구성될 수 있다. 도 3을 참조하면, 생성자(P10)는 디자인의 생성 과정(S10)을 수행할 수 있으며, 탐색자(P20)는 디자인의 탐색 과정(S20)을 수행할 수 있으며, 예측자(P30)는 디자인의 예측 과정(S30)을 수행할 수 있으며, 최적화자(P40)는 디자인의 최적화 과정(S40)을 수행할 수 있다. 본 발명의 실시예에 따른 생성자(P10), 탐색자(P20), 예측자(P30), 최적화자(P40) 중 적어도 하나는 하드웨어로 직접 구현되거나, 하드웨어에 의해 실행되는 소프트웨어 모듈로 구현되거나, 또는 이들의 결합에 의해 구현될수 있다 S10 과정에서, 생성자(P10)는 소량의 참조 데이터에 기초해 제너레이티브 디자인 기술을 이용하여 대량의 신규 디자인을 생성할 수 있다. 이 경우, 생성자(P10)는 사용자의 참조 데이터(혹은 과거 디자인 데이터)와 닮으면서 도 공학적으로 우수한 신규 디자인을 생성할 수 있다. S20과정에서, 탐색자(P20)는 고차원의 신규 디자인을 저차원의 잠재공간(Latent space)으로 맵핑하는 인공지능 모델을 학습할 수 있다. 인공지능 모델은 딥러닝 모델을 포함할 수 있다. 복수의 신규 디자인은 딥러닝 모델을 이용해 저차원의 잠재공간에서 복수의 디자인 맵핑 데이터로 맵핑될 수 있다. 디자인 맵핑 데이터는 저차원의 잠재공간에서 연속적인 값을 갖을 수 있다. 복수의 디자인 맵핑 데이터에 대응하는 잠재공간의 모든 점들은 각기 다른 복수의 디자인(예로, 3D 디자인안 들)으로 복원될 수 있다. 그렇기 때문에, 탐색자(P20)는 잠재공간에서 연속적인 값을 가지는 디자인 맵핑 데이 터들을 탐색하여 고차원의 디자인을 탐색할 수 있고, 잠재공간에서 근거리에 위치한 디자인 맵핑 데이터들에 기 초해 유사한 디자인들을 클러스터링할 수 있다. 이 경우 탐색된 디자인을 탐색 디자인으로 표현할 수 있다. 탐색자(P20)는 잠재공간에서 CAE 해석에 필요한 실험설계(DOE)를 통해 사용자가 필요한 신규 디자인을 실시간으 로 생성해 낼 수 있고, 잠재공간에서 더 효율적으로 최적화된 신규 디자인을 찾을 수 있다. S30과정에서, 예측자(P30)는 CAE 해석데이터 혹은 실험데이터를 입력으로 받아 잠재공간에서 성능을 예측하는 성능 예측 모델을 학슥할 수 있다. 이 경우 성능 예측 모델은 인공지능 모델로서, 딥러닝 모델을 포함할 수 있 다. 또는, 예측자(P30)는 실험설계(DOE)를 통해 생성된 신규 디자인과 실험설계 데이터를 입력으로 받아 잠재공 간에서 성능을 예측하는 성능 예측 모델을 학습할 수 있다. 이 경우, 예측자(P30)는 학습된 성능 예측 모델을 이용해 신규 디자인 및/또는 잠재공간에서 탐색할 수 있는 모 든 디자인 맵핑 데이터에 대한 성능을 실시간으로 예측할 수 있다. S40과정에서, 최적화자(P40)는 사용자가 원하는 요구사항(예로, 목표 성능)을 입력하면 잠재공간에서 최적화된 신규 디자인을 실시간으로 찾거나 생성하는 인공지능 모델을 학습할 수 있다. 인공지능 모델은 딥러닝 모델을 포함할 수 있다. 최적화자(P40)는 학습된 인공지능 모델을 이용해 실시간으로 최적화된 신규 디자인을 생성할 수 있으며, 제안된 최적 신규 디자인이 위치한 잠재공간의 주변에서 대응하는 최적 디자인 매핑 데이터를 미세 조정함으로써 더욱 최적화된 신규 디자인을 생성할 수 있다. 본 발명의 일 실시예에 따른 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방법은 딥러닝을 통해 신규 디자인(3D 데이터)을 잠재공간에서 연속적인 값인 디자인 맵핑 데이터로 표현하고, 잠재공간에서 디 자인 맵핑 데이터를 이용해 신규 디자인의 생성, 탐색, 예측, 최적화를 제공할 수 있다. 도 5는 본 발명의 실시예에 따른 디자인 생성 방법의 순서도이다. 도 4 및 도 5를 참조하면, 본 발명의 실시예에 따른 디자인 생성 방법(S10)은, 참조 데이터를 획득하는 과정 (S100), 제너레이티브 디자인에 의한 신규 디자인을 획득하는 과정(S200), 신규 디자인을 필터링하는 과정 (S300), 신규 디자인의 개수를 확인하는 과정(S400), 디자인 생성 모델에 의한 추가 신규 디자인을 획득하는 과 정(S500), 추가 신규 디자인을 필터링하고 추가 신규 디자인을 참조 데이터로 위 과정을 반복하는 과정(S600), 신규 디자인을 평가하는 과정(S700) 중 적어도 하나를 포함할 수 있다. 컴퓨팅 장치는 본 발명의 실시예에 따른 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방법을 통해 적은 개수의 참조 데이터를 이용해 상대적으로 많은 개수의 신규 디자인을 생성할 수 있다. 본 발명의 실시예에 따른 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방법은, 참조 데이터 를 이용해 제품의 신규 디자인을 생성하고, 평가할 수 있다. 여기서, 제품은 형상이나 외형을 가지는 어떠한 구 조물도 될 수 있다. 예로, 자동차, 자동차의 바퀴, 자동차의 바퀴 휠, 시계, 스마트폰, 다리, 건축물 등이 있다. 설명의 편의를 위해, 본 명세서에서는 자동차의 바퀴 휠을 기준으로 설명한다. 다만, 본 발명의 권리범위가 자 동차의 바퀴 휠에 한정될 것은 아니며, 디자인 가능한 모든 제품에 적용될 수 있다. S100 과정에서, 컴퓨팅 장치는 참조 데이터을 획득할 수 있다. 컴퓨팅 장치는 제품에 대한 참조 데이터를 획득할 수 있다. 컴퓨팅 장치는 통신 인터페이스를 통해 참조 데이터를 수신하거나, 스토리지에 저장된 참조 데이터를 획득할 수 있다. 참조 데이터(reference data)는 디자이너에 의해 도시되면서 엔지니어에 의해 디자인되어 심미적으로 성능적으 로 검증된 제품의 디자인을 포함할 수 있다. 또는, 참조 데이터는 시스템의 필수 요소가 포함된 기술 청사진을 말하며, 제3 자에 의해 복사될 수 있다. 제3자는 필요에 따라 참조 데이터를 개선하거나 수정할 수 있다. 참조 데이터는, 제품과 관련 없는 패턴 이미지(예로, Pattern Img), 2차원 제품에 대한 이미지(예로, Wheel Img), 2차원 제품에 대한 스켈레톤 이미지(예로, 2D Skel. Img), 3차원 제품에 대한 스켈레톤 이미지(예로, 3D Skel. Img), 3차원 제품에 대한 단면 이미지(예로, Cross Img), 3차원 제품에 대한 뷰 이미지(예로, View Img), 제품에 대한 흑백 이미지(예로, Black Img), 제품에 대한 칼라 이미지(예로, Color Img) 중 적어도 하나 를 포함할 수 있다. 참조 데이터는 2D 참조 데이터 또는 3D 참조 데이터를 포함할 수 있다. 이 경우, 2D 참조 데이터는 형상 이미지 데이터, 패턴 데이터, 스켈레톤 데이터, 그래프 데이터, SDF 데이터(거 리 정보), 깊이 데이터, 음함수 (함수식 또는 딥러닝 모델), Grammar 및 각 형태의 데이터에서 획득한 멀티뷰 데이터 중 적어도 하나를 포함할 수 있다. 또한, 3D 참조 데이터는 CAD 데이터, 복셀 데이터, Mesh 데이터, 포인트클라우드 데이터, Octree 데이터, 형상 파라미터 데이터, 패턴 데이터, 스켈레톤 데이터, 그래프 데이터, SDF 데이터(거리 정보), 음함수 (함수식 또는 딥러닝 모델) 중 적어도 하나를 포함할 수 있다. 참조 데이터는 신규 디자인을 생성하기 위해 시드로서 사용되기 때문에 시드 데이터라고 할 수 있다. 이하 명세서에서, 제품에 관한 디자인 혹은 디자인안의 용어는 컴퓨팅 장치의 입력 및 출력으로 표현될 수 있는 데이터를 의미한다. 이하에서, 본 발명의 실시예에 따른 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방법에서 참조 데이터를 획득하는 과정을 설명한다. 도 6은 본 발명의 실시예에 따른 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방법에서 참 조 데이터를 획득하는 과정의 순서도이다. 도 7(a) 내지 도 7(d)는 입력 데이터를 전처리하여 생성된 전처리된 이미지의 예시를 보여준다. 도 6을 참조하면, 본 발명의 실시예에 따른 참조 데이터를 획득하는 과정은, 입력 데이터를 획득하는 과정 (S210), 입력 데이터의 전처리 과정(S220), 전처리 이미지를 제공하는 과정(S230)을 포함할 수 있다. 여기서, 컴퓨팅 장치는 참조 데이터를 획득하는 과정을 통해 전처리 이미지를 참조 데이터로서 제공할 수 있다. 다만, 본 발명의 실시예에 따른 참조 데이터를 획득하는 과정이 위에 한정될 것은 아니며, 참조 데이터는 제품 에 관한 어떠한 종류의 데이터도 포함할 수 있다. 또한, 참조 데이터는 제품에 관련이 없는 패턴 이미지와 같은 데이터도 포함될 수 있다. S210 과정에서, 컴퓨팅 장치는 통신 인터페이스를 통해 입력 데이터를 수신하거나, 스토리지에 저장된 입력 데이터를 획득할 수 있다. 입력 데이터는 2차원 제품에 대한 이미지, 3차원 제품에 대한 이미지, 3 차원 제품에 대한 모델링 중 적어도 하나를 포함할 수 있다. S220 과정에서, 컴퓨팅 장치는 기 설정된 전처리 방법에 따라 입력 데이터를 전처리할 수 있다. 예를 들어, 기 설정된 전처리 방법은, 입력 데이터에서 패턴 이미지를 추출하는 방법, 스켈레톤 이미지를 추출하는 방법, 뷰 이미지를 추출하는 방법, 단면 이미지를 추출하는 방법, 칼라 이미지에서 흑백 이미지를 추출하는 방 법 중 적어도 하나를 포함할 수 있다. S221 과정에서, 도 7(a)를 참조하면, 컴퓨팅 장치는 기 설정된 전처리 방법에 따라서 입력 데이터(예로, 2 차원 제품에 대한 이미지, 3차원 제품에 대한 이미지, 및 3차원 제품에 대한 모델링 중 하나)에서 패턴 추출 모 델을 이용하여 패턴 이미지를 추출할 수 있다. S222 과정에서, 도 7(b)를 참조하면, 컴퓨팅 장치는 기 설정된 전처리 방법에 따라서 입력 데이터(예로, 2 차원 제품에 대한 이미지, 3차원 제품에 대한 이미지, 및 3차원 제품에 대한 모델링 중 하나)에서 스켈레톤 추 출 모델을 이용하여 2차원 제품에 대한 스켈레톤 이미지 혹은 3차원 제품에 대한 스켈레톤 이미지를 추출할 수있다. S223 과정에서, 도 7(c)를 참조하면, 컴퓨팅 장치는 기 설정된 전처리 방법에 따라서 입력 데이터(예로, 2 차원 제품에 대한 이미지, 3차원 제품에 대한 이미지, 및 3차원 제품에 대한 모델링)에서 뷰 추출 모델을 이용 하여 특정한 뷰에서 3차원 제품에 대한 뷰 이미지를 추출할 수 있다. 여기서, 3차원 제품에 대한 뷰 이미지는 3 차원 제품을 특정한 방향(뷰)에서 보았을 때 이미지를 의미할 수 있다. 나아가, 컴퓨팅 장치는 3차원 제품 에 대한 뷰 이미지를 추출하면서, 해당 특정 뷰에 대한 정보를 함께 제공할 수 있다(예로, [x,y,z]=[1,1,1]). S224 과정에서, 도 7(d)를 참조하면, 컴퓨팅 장치는 기 설정된 전처리 방법에 따라서 입력 데이터(예로, 2 차원 제품에 대한 이미지, 3차원 제품에 대한 이미지, 및 3차원 제품에 대한 모델링)에서 단면 추출 모델을 이 용하여 특정한 뷰 및 사용자의 입력에 따른 소정 깊이에서 3차원 제품에 대한 단면 이미지를 추출할 수 있다. 여기서, 3차원 제품에 대한 단면 이미지는 3차원 제품을 특정한 방향(뷰)에서 보면서, 사용자가 입력한 값에 따 른 깊이에서 3차원 제품이 가지는 단면에 대한 이미지를 의미할 수 있다. 나아가, 컴퓨팅 장치는 3차원 제 품에 대한 단면 이미지를 추출하면서, 해당 특정 뷰에 대한 정보 및 픽셀의 깊이에 대한 정보를 함께 제공할 수 있다 (예로, [x,y,z]=[0,0,1]). S225 과정에서, 컴퓨팅 장치는 기설정된 전처리 방법에 따라서 입력데이터(예로, 칼라 이미지)에서 이진 추출 모델을 이용해 제품에 대한 흑백 이미지(예로, 바이너리 이미지)를 추출할 수 있다. S220 과정에서, 컴퓨팅 장치는 입력 데이터에 대해 S221 과정 내지 S225 과정 중 하나 혹은 2개 이상을 각 각 병렬로 수행할 수 있으며, 2개 이상을 순차적으로 조합하여 수행할 수 있으며, 이를 통해서 전처리된 이미지 를 획득할 수 있다. S230 과정에서, 컴퓨팅 장치는 S100 과정에서 전처리된 이미지를 제공할 수 있으며, 전처리된 이미지는 참 조 데이터로서 사용될 수 있다. 다시 말해, 컴퓨팅 장치는 2차원 제품에 대한 이미지, 3차원 제품에 대한 이미지, 및 3차원 제품에 대한 모델링 중 적어도 하나를 포함하는 입력 데이터에 전처리 과정을 수행하여 참조 데이터로서 사용될 수 있도록 전처리된 이미지를 획득할 수 있다. 여기서, 전처리된 이미지는, 패턴 이미지(예로, Pattern Img), 2차원 제품에 대한 이미지(예로, Wheel Img), 2 차원 제품에 대한 스켈레톤 이미지(예로, 2D Skel. Img), 3차원 제품에 대한 스켈레톤 이미지(예로, 3D Skel. Img), 3차원 제품에 대한 단면 이미지(예로, Cross Img), 3차원 제품에 대한 뷰 이미지(예로, View Img), 제품 에 대한 흑백 이미지(예로, Black Img), 제품에 대한 칼라 이미지(예로, Color Img) 중 적어도 하나를 포함하거 나, 2개 이상의 조합을 포함할 수 있다. 예를 들어, 참조 데이터는 2차원 제품에 대한 바이너리 이미지 일 수 있으며, 상세히는 제품의 정면뷰를 흑백 바이너리로 변환한 이진 픽셀 이미지 일 수 있다. 예를 들어, 참조 데이터는 스켈레톤 이미지 일 수 있으며, 상 세히는 2차원(3차원) 제품에 대한 골격을 추출하여 스켈레톤화한 이미지일 수 있다. 다시 도 5를 참조하면, S200 과정에서, 컴퓨팅 장치는 제너레이티브 디자인에 의한 신규 디자인을 획득할 수 있다. 구체적으로, 컴퓨팅 장치는 참조 데이터에 기초해 제너레이티브 디자인을 적용함으로써 복수의 신규 디자인을 생성할 수 있다. 컴퓨팅 장치는 참조 데이터에 제너레이티브 디자인을 적용하여 참조 데이터와 유사성을 가진 복수의 신규 디자인을 획득할 수 있다. 제너레이티브 디자인은 (i) SIMP 모델, ESO 모델, BESO 모델, LevelSet 모델, MMC 모델, 및 딥러닝 모델 중 적 어도 하나를 이용한 위상최적화(Topology Optimization) 방법론, (ii) 치수 및 형상 최적화(Size/Shape Optimization) 방법론, 및 (iii) 파라매트릭 디자인(Parametric Design) 방법론 중 적어도 하나를 이용할 수 있다. 컴퓨팅 장치는 사용자가 선택한 제너레이티브 디자인 방법론에 대한 입력 신호 혹은 제품 별 기 설정된 제 너레이티브 디자인 방법론에 대한 설정 정보에 기초해 참조 데이터에 제너레이티브 디자인을 적용하여 복수의 신규 디자인을 생성하여 획득할 수 있다. 참조 데이터를 닮은 제너레이티브 디자인을 생성하는 방법은 두가지 중에 선택하여 사용할 수 있다. 첫째는 목 적 함수에 참조 데이터와 유사도(similarity)를 반영하는 방법이며, 둘째는 목적 함수를 미분한 민감도 함수에 참조 데이터와 유사도를 반영하는 방법이다. 우선 첫번째 방법인 목적함수에 유사도를 반영하는 방법을 소개한다. 제너레이티브 디자인의 목적 함수는, 사용 자가 디자인시 만족하여야 할 사항에 대응하는 성능 목적 함수 부분(PERF)과 참조 데이터와 유사성을 결정하는 유사도 부분(SIM)의 합으로 구성될 수 있다."}
{"patent_id": "10-2022-0134996", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "성능 목적 함수 부분(PERF)은 제품 성능에 관한 최적화 문제로, 제품에 대한 엔지니어링 성능, 제품의 제조성, 제품의 미관 등의 요소를 포함할 수 있다. 즉, 사용자가 설정한 요구사항을 의미할 수 있다. 유사도 목적 함수 부분(SIM)은 참조 데이터에 관한 유사도 최적화 문제로, 신규 디자인과 참조 데이터 사이의 유사성을 포함할 수 있다. 유사도 목적 함수 부분은 가중치( )에 의해 제너레이티브 디자인의 목적 함수 전체에 대한 영향도를 조절 할 수 있다. 두번째 방법인 민감도 함수에 유사도를 반영하는 방법을 소개한다. 민감도 함수는 사용자가 디자인시 만족하여 야 할 사항에 대응하는 성능 목적 함수 부분(PERF)를 미분한 부분과 참조 데이터와의 유사도 부분의 합으로 구 성될 수 있다."}
{"patent_id": "10-2022-0134996", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "민감도 함수는 목적함수의 변화율을 나타내며, 이 값을 반복적으로 계산하여 최적설계값을 찾게 된다. 이 때 참 조 데이터(참조 디자인)과 유사할 수록 민감도를 크게 하여 신규 디자인(생성 디자인)이 참조 데이터(참조디자 인)와 닮도록 유도할 수 있다. 이 때 가중치( )에 의해 제너레이티브 디자인의 참조 데이터(참조 디자인)의 영 향도를 조절할 수 있다. 정리하면, 본 발명의 제너레이티브 디자인은 목적함수에 유사도(SIM)를 부여하거나, 민감도함수에 유사도(SIM) 를 부여해 참조 데이터와 닮은 신규 디자인을 생성할 수 있으며 가중치( )에 의해 닮은 정도를 조절할 수 있다. 본 발명은 참조 데이터와 닮은 제너레이티브 디자인을 만들기 위해 목적함수 또는 민감도 함수에 변형을 주는 모든 생성적 디자인 방법을 포함한다. 다양한 실시예에서, 컴퓨팅 장치는 참조 데이터를 위상 최적화를 적용할 최적화 구역을 설정할 수 있다. 최적화 구역은 참조 데이터에서 제품에 대응하는 전체 구역일 수 있으며, 또는, 제품에서 반복되는 단위 구역일 수 있다. 또는, 컴퓨팅 장치는 적어도 하나의 매개변수(예로, 대칭 등분)에 기초해 참조 데이터에 최적화 구역을 결정할 수 있다. 여기서, 컴퓨팅 장치는 참조 데이터에서 최적화 구역을 추출하여 최적화 구역을 기준으로 위상 최적화를 적용할 수 있다. 여기서, 참조 데이터의 전체 혹은 일부에 기초해 위상 최적화를 수행함으로써, 참조 데이터의 전체 혹은 일부와 유사한 복수의 신규 디자인을 생성할 수 있다. 최적 디자인은 물체의 모양이나 치수를 최적화하는 형상 최적디자인(shape optimization), 재질을 최적화하는 물성 최적디자인(material optimization) 그리고 물체의 구조를 최적화하는 위상 최적디자인(topology optimization)로 구별될 수 있다. 특히, 위상 최적화는 물리기반으로 사용자의 디자인 요구사항을 만족시킬 수 있는 참조 데이터에 대한 최적화 문제로 정의된다. 본 발명에서 제안한 위상 최적화 문제는 디자인 성능 부분과 유사성 부분을 포함하는 목적 함수 또는 민감도 함 수를 도입함으로써, 참조 데이터와 유사한 공학적 성능을 가지면서 참조 데이터와 유사한 형상을 유지하는 복수 의 신규 디자인을 생성하는 것이다. 위상 최적화에 주로 사용되는 디자인 성능은 컴플라이언스(compliance)이며 이는 구조 강성과 반비례하는 지표이며 작을수록 좋은 성능이다. 위상 최적화 디자인은 재료를 어떻게 분산할 것인가에 대한 답으로 개발되었다. 제품의 구조물에 대한 강성과 관련된 컴플라이언스 최소화(compliance minimazation)는 참조 데이터에 대한 재디자인(redesign)를 수행한다. 일 예로서, 자동차 바퀴 휠에 대한 참조 데이터에 위상 최적화를 수행할 때 사용자는 적어도 하나의 매개변수를 변경하여 위상 최적화된 복수의 신규 디자인을 생성할 수 있다. 적어도 하나의 매개변수는 제품의 형상, 성능, 기능 등에 따라서 사용자가 지정할 수 있다.일 예로 자동차 바퀴 휠을 기준으로 할 때, 적어도 하나의 매개변수는 유사성 가중치, 힘 비율, 볼륨 비율, 대 칭 등분 등을 포함할 수 있다. 유사성 가중치(Similarity Weight)는 신규 디자인이 참조 데이터를 얼마나 닮을 지 결정하는 가중치이다. 힘 비율(Force Ratio)은 바퀴 휠의 수직력에 대한 전단력의 크기 비율이다. 볼륨 비율 (Volume Ratio)은 참조 데이터 대비 신규 디자인의 볼류 비율이다. 대칭 등분(Piece)은 바퀴 휠의 대칭 등분을 의미한다. 다양한 실시예에서, 자동차 바퀴 휠에 수직하게 가해지는 타이어 압력으로 표현되는 수직력(Normal force) 및 바퀴 휠의 점선 마찰력으로 표현되는 전단력(Shear force)은 2차원 자동차 바퀴 휠 디자인의 최적화에서 일반적 인 부하 조건으로 휠의 표면을 따라 균일하게 가해진다. 수직력에 대한 전단력의 힘 비율(Force ratio)은 자동 차 바퀴 휠에 위상 최적화를 적용한 신규 디자인시 변경할 수 있는 사용자 지정 매개변수이다. 다양한 실시예에서, 참조 데이터 대비 신규 디자인의 볼륨 비율(Volume Ratio)는 참조 데이터에 위상 최적화를 적용한 신규 디자인시 변경할 수 있는 사용자 지정 매개변수이다. 다양한 실시예에서, 참조 데이터 대비 신규 디자인의 닮음비(similarity)는 참조 데이터에 위상 최적화를 적용 한 신규 디자인시 변경할 수 있는 사용자 지정 매개변수이며 추천 값이 자동으로 제시될 수도 있다. 다양한 실시예에서, 참조 데이터에 대한 대칭 등분(Piece)은 참조 데이터에 위상 최적화를 적용한 신규 디자인 시 변경할 수 있는 사용자 지정 매개변수이다. 한편, 위상 최적화된 신규 디자인 및 참조 데이터 사이의 L1 Norm은 양 디자인들 사이의 유사성을 나타낸다. 한 편, 위상 최적화된 신규 디자인과 참조 데이터 사이의 유사성을 나타내는 부분은 제품의 디자인이 이산 문제에 관련된 경우 L1 Norm을 대신하여 크로스-엔트로피를 적용할 수 있다. 한편, 위상 최적화된 신규 디자인과 참조 데이터 사이의 유사성을 나타내는 부분은 제품의 디자인이 연속적인 문제에 관련된 경우 pixel-wise L1 Norm을 적용할 수 있다. 도 8은 패턴 이미지를 참조 데이터로 하여 생성된 신규 디자인의 다양한 예시를 도시한 것이다. 도 8을 참조하면, 다양한 실시예의 S200 과정에서, 컴퓨팅 장치는 패턴 이미지를 참조 데이터로 활용하여 제너레이티브 디자인(예로, 위상최적화, 치수 및 형상 최적화, 파라매트릭 디자인)을 진행하여 신규 디자인을 생성할 수 있다. 다양한 실시예에서, 제너레이티브 디자인으로 위상최적화 방법론을 적용할 경우에, 컴퓨팅 장치는 위상 최 적화 목적 함수에서 성능 부분을 통해서 제품의 공학적 성능을 담보하면서, 유사성 부분을 통해서 패턴 이미지 와 유사한 제품의 신규 디자인을 생성할 수 있다. 즉, 컴퓨팅 장치는 새롭게 디자인하고자 하는 제품에 대 한 참조 데이터(예로, 초기 바퀴 휠 이미지)가 없더라도 패턴 이미지를 참조 데이터로 사용하여 심미적으로 닯 은 제품에 대한 신규 디자인을 생성할 수 있다. 도 9는 스켈레톤 이미지를 참조 데이터로 하여 생성된 신규 디자인의 다양한 예시를 도시한 것이다. 도 9를 참조하면, 다양한 실시예의 S200 과정에서, 컴퓨팅 장치는 2차원 제품에 대한 스켈레톤 이미지(예 로, 2D Skel. Img) 혹은 3차원 제품에 대한 스켈레톤 이미지(예로, 3D Skel. Img)를 참조 데이터로 활용하여 제 너레이티브 디자인(예로, 위상최적화, 치수 및 형상 최적화, 파라매트릭 디자인)을 진행하여 신규 디자인을 생 성할 수 있다. 다양한 실시예에서, 제너레이티브 디자인으로 위상최적화 방법론을 적용할 경우에, 2차원(3차원) 제품에 대한 일반적인 이미지를 대신하여 2차원(3차원) 제품에 대한 스켈레톤 이미지를 사용함으로써, 2차원(3차원) 제품에 대한 일반적인 이미지에서 편중된 밀도(두께, 볼륨) 때문에 발생하는 영향을 신규 디자인에 미치지 않게 할 수 있다. 또한, 2차원(3차원) 제품에 대한 스켈레톤 이미지를 사용함으로써, 신규 디자인은 제품에 대한 밀도(두께, 볼륨) 분포가 편중되지 않을 수 있다. 다양한 실시예에서, 컴퓨팅 장치는 사용자 지정 매개변수인 볼륨 비율(Volume Ratio)에 따라 일정하게 증 가된 밀도(두께, 볼륨)을 가지는 제품에 대한 신규 디자인을 생성할 수 있다. 예를 들어, 큰 볼륨 비율을 가지는 신규 디자인은 작은 볼륨 비율을 가지는 신규 디자인 보다 상대적으로 증가 된 밀도(두께, 볼륨)을 가지는 제품에 대한 디자인을 제공할 수 있다. 도 10은 뷰 이미지 혹은 단면 이미지를 참조 데이터로 하여 생성된 신규 디자인의 다양한 예시를 도시한 것이다. 도 10의 상측에서 2개의 도면을 참조하면, 컴퓨팅 장치는 2차원 제품에 대한 이미지, 3차원 제품에 대한 이미지, 및 3차원 제품에 대한 모델링 중 하나에서 특정 방향의 뷰 이미지와 닮은 신규 디자인을 생성할 수 있 다. 여기서, 컴퓨팅 장치는 2차원 제품에 대한 이미지, 3차원 제품에 대한 이미지, 및 3차원 제품에 대한 모델 링 중 하나에서 뷰 추출 모델을 이용하여 특정 방향의 뷰 이미지(O1)를 추출할 수 있다. 또한, 컴퓨팅 장치 는 특정 방향 뷰에 대한 정보도 함께 추출할 수 있다. 여기서, 특정 방향 뷰에 대한 정보는 제품을 바라보 는 방향을 벡터로 표현한 것일 수 있다(예로, [x, y, z]=[1,1,1]). 나아가, 컴퓨팅 장치는 특정 방향의 뷰 이미지(O1)를 참조 데이터로서 위상 최적화를 적용하여 신규 디자 인(N1)를 생성할 수 있다. 이 경우 신규 디자인은 특정 방향 뷰 이미지와 동일한 방향 뷰와 유사한 디자인일 수 있다. 나아가, 컴퓨팅 장치는 복수의 뷰 방향에 대한 복수의 뷰 이미지(O1, O2)를 추출할 수 있으며, 복수의 뷰 이미지에 제너레이티브 디자인(예로, 위상최적화, 치수 및 형상 최적화, 파라매트릭 디자인)을 각각 적용하여 복수의 신규 디자인(N1, N2)를 생성할 수 있다. 여기서, 복수의 신규 디자인은 복수의 뷰 이미지 각각에 대응하는 위상 최적화된 디자인 일 수 있다. 이 경우, 위상 최적화의 목적함수는 복수의 뷰 이미지에 대응하는 유사성 부분을 갖도록 복수개로 형성되며, 복수의 위상 최적화의 목적함수 각각의 답을 찾음으로써, 복수의 신규 디자인을 구할 수 있다. 나아가, 컴퓨팅 장치는 복수의 뷰 방향에 대한 정보([1,1,1], [1,0,1])를 이용하여, 복수의 뷰 방향에 대 응하는 복수의 신규 디자인을 조합하여 2차원 제품에 대한 신규 이미지 혹은 3차원 제품에 대한 신규 모델링을 생성할 수 있다. 다양한 실시예에서, 컴퓨팅 장치는 복수의 뷰 방향에 대한 복수의 뷰 이미지(O1, O2)를 추출할 수 있으며, 복수의 뷰 이미지를 모두 함께 제너레이티브 디자인(예로, 위상최적화, 치수 및 형상 최적화, 파라매트릭 디자 인)을 적용하여 하나의 신규 디자인을 생성할 수 있다. 이 경우, 위상 최적화의 목적함수는 복수의 뷰 이미지에 대응하는 유사성 부분이 복수개로 형성되며, 복수의 유사성 부분(L1 distance term)이 존재하는 하나의 위상 최 적화의 목적함수의 답을 찾음으로써, 신규 디자인을 구할 수 있다. 한편, 도 10의 하측의 도면을 참조하면, 컴퓨팅 장치는 2차원 제품에 대한 이미지, 3차원 제품에 대한 이 미지, 및 3차원 제품에 대한 모델링 중 하나에서 특정 방향의 뷰에서 사용자 입력에 따른 소정 깊이에서 단면 이미지와 닮은 신규 디자인을 생성할 수 있다. 여기서, 컴퓨팅 장치는 2차원 제품에 대한 이미지, 3차원 제품에 대한 이미지, 및 3차원 제품에 대한 모델 링 중 하나에서 단면 추출 모델을 이용하여 특정 방향 및 소정 깊이에서 제품의 단면 이미지(O3)를 추출할 수 있다. 여기서, 제품에 대한 단면 이미지는 2차원 혹은 3차원 제품을 특정한 방향(뷰)에서 보면서, 사용자가 입 력한 값에 따른 깊이에서 제품이 가지는 단면에 대한 이미지를 의미할 수 있다. 또한, 컴퓨팅 장치는 특정 방향 뷰에 대한 정보 및 깊이에 대한 정보도 함께 추출할 수 있다. 여기서, 특 정 방향 뷰에 대한 정보는 제품을 바라보는 방향을 벡터로 표현한 것일 수 있다(예로, [x, y, z]=[0,0,1]). 깊 이에 대한 정보는 특정 방향 뷰를 기준으로 제품이 가지는 전체 깊이를 100%로 가정할 때 사용자로부터 가장 먼 제품의 부분을 100%로 정의하고, 가장 가까운 제품의 부분을0%로 정의할 수 있다(예로, depth = 50%). 나아가, 컴퓨팅 장치는 특정 방향 및 소정 깊이의 단면 이미지(O3)를 참조 데이터로서 제너레이티브 디자 인(예로, 위상최적화, 치수 및 형상 최적화, 파라매트릭 디자인)을 적용하여 신규 디자인(N3)를 생성할 수 있다. 이 경우 신규 디자인은 특정 방향 및 소정 깊이에서 제품의 단면 이미지와 동일한 방향 뷰 및 소정 깊이 와 유사한 디자인일 수 있다. 나아가, 컴퓨팅 장치는 특정 방향 및 복수의 깊이에 대한 복수의 단면 이미지(O3)를 추출할 수 있으며, 복 수의 단면 이미지에 제너레이티브 디자인(예로, 위상최적화, 치수 및 형상 최적화, 파라매트릭 디자인)을 각각 적용하여 복수의 신규 디자인(N3)를 생성할 수 있다. 여기서, 복수의 신규 디자인은 복수의 단면 이미지 각각에 대응하는 위상 최적화된 디자인 일 수 있다. 이 경우, 위상 최적화의 목적함수는 복수의 단면 이미지에 대응하도록 복수개로 형성되며, 복수의 위상 최적화의목적함수 각각의 답을 찾음으로써, 복수의 신규 디자인을 구할 수 있다. 나아가, 컴퓨팅 장치는 특정 방향 및 복수의 깊이에 대한 정보([0, 0, 1])를 이용하여, 복수의 깊이에 대 응하는 복수의 신규 디자인을 조합하여 2차원 제품에 대한 신규 이미지 혹은 3차원 제품에 대한 신규 모델링을 생성할 수 있다. 다양한 실시예에서, 컴퓨팅 장치는 복수의 깊이 방향에 대한 복수의 단면 이미지(O3)를 추출할 수 있으며, 복수의 단면 이미지를 모두 함께 위상 최적화를 적용하여 하나의 신규 디자인을 생성할 수 있다. 이 경우, 위상 최적화의 목적함수는 복수의 단면 이미지에 대응하는 유사성 부분이 복수개로 형성되며, 복수의 유사성 부분(L1 distance term)이 존재하는 하나의 위상 최적화의 목적함수의 답을 찾음으로써, 신규 디자인을 구할 수 있다. 다앙한 실시예에서, 컴퓨팅 장치는 제품에 대한 복수의 방향 뷰 및 복수의 깊이에서 추출된 뷰 단면 이미 지를 참조 데이터로서 제너레이티브 디자인(예로, 위상최적화, 치수 및 형상 최적화, 파라매트릭 디자인)을 적 용하여 복수의 신규 디자인을 생성할 수 잇다. 도 4 및 도 5를 참조하면, S300 과정에서, 컴퓨팅 장치는 복수의 신규 디자인을 필터링할 수 있다. S300 과정에서, 컴퓨팅 장치는 신규 디자인의 성능 필터링 과정 및 유사성 필터링 과정 중 적어도 하나를 수행할 수 있다. 다양한 실시예에서, 성능 필터링 과정에서, 컴퓨팅 장치는 사용자가 디자인시 설정한 요구사항에 기초해 신규 디자인을 평가할 수 있으며, 사용자가 설정한 여구사항에 미달하는 신규 디자인을 제외하는 과정을 수행할 수 있다. 이 경우 요구사항을 통과하지 못한 신규 디자인을 저성능 신규 디자인이라 한다. 다양한 실시예에서, 유사성 필터링 과정에서, 컴퓨팅 장치는 복수의 신규 디자인들 중 유사한 디자인을 제 외하는 필터링을 수행할 수 있다. 다양한 실시예에서, 컴퓨팅 장치는 신규 디자인의 형상이 존재하는 고차원 도메인 상에서 유사도를 평가할 수 있다. 컴퓨팅 장치는X 공간 필터링 과정을 수행할 수 있다. 여기서, 컴퓨팅 장치는 복수의 신규 디자인 중 2개의 거리를 X 공간에서 측정하고, 사이 거리가 기 설정된 제1 임계 값 보다 작은 경우 유사한 디자 인으로 보고 2개 중 적어도 하나를 제외할 수 있다. 이러한 과정은 모든 복수의 신규 디자인에 대해 수행될 수 있다. 여기서, X 공간은 신규 디자인의 형상이 그 자체로 존재하는 고차원 도메인을 의미한다. 즉, X 공간은 제 너레이티브 디자인으로 생성된 신규 디자인 자체를 의미한다. 다양한 실시예에서, 컴퓨팅 장치는 신규 디자인의 형상을 저차원 도메인 상으로 매핑하여 유사도를 평가할 수 있다. 컴퓨팅 장치는 Z 공간 필터링 과정을 수행할 수 있다. 여기서, 컴퓨팅 장치는 복수의 신규 디자인을 인코딩 모델을 이용하여 잠재 공간(Z-space) 상에 투영시켜 저차원의 특징 값을 추출하고, 두 디자인 의 저차원 특징 값의 거리를 측정하고, 사이 거리가 기 설정된 제2 임계 값 보다 작은 경우 유사한 디자인으로 보고 2개 중 적어도 하나를 제외할 수 있다. 이러한 과정은 모든 복수의 신규 디자인에 대해 수행될 수 있다. 여기서, Z 공간은 신규 디자인의 저차원 값이 매핑된 공간을 의미한다. S300 과정에서, 컴퓨팅 장치는 성능 필터링 과정 및 유사성 필터링 과정 중 하나 혹은 모두를 수행할 수 있다. 또한, 컴퓨팅 장치는 상술한 X 공간 필터링 과정 및 Z 공간 필터링 과정 중 하나 혹은 모두를 수행 할 수 있다. 다만, 본 발명의 필터링 과정이 이에 한정될 것은 아니며, 유사 디자인을 분류할 수 있는 다양한 필터링 방법이 적용될 수 있다. 도 4 및 도 5를 참조하면, S400 과정에서, 컴퓨팅 장치는 필터링된 신규 디자인의 개수가 기 설정된 임계 값을 넘는지 확인할 수 있다. 여기서, 컴퓨팅 장치는 필터된 신규 디자인의 수가 기 설정된 임계 값을 넘 지 않는 경우 다음 S500 과정을 수행할 수 있으며, 기 설정된 임계 값을 넘는 경우 다음 S700 과정을 수행할 수 있다. S500 과정에서, 컴퓨팅 장치는 신규 디자인에 디자인 생성 모델을 적용하여 추가 신규 디자인을 생성할 수 있다. 컴퓨팅 장치는 디자인 생성 모델을 학습시킬 수 있다. 일 예로서, 컴퓨팅 장치는 참조 데이터, 및 신 규 디자인 중 적어도 하나를 이용하여 새로운 추가 신규 디자인을 생성할 수 있는 디자인 생성 모델을 학습시킬 수 있다.여기서, 학습된 디자인 생성 모델은 참조 데이터 및 신규 디자인 중 적어도 하나에 의해 학습된 잠재공간(Z)을 가질 수 있다. 잠재공간(Z)은 참조 데이터 및 신규 디자인에 대비하여 축소된 차원을 가지며, 참조디자인 및 신 규 디자인을 축소된 차원(저차원) 상에 매핑되도록 표현할 수 있다. 다양한 실시예에서, 디자인 생성 모델은 디자인 데이터를 추출하여 잠재공간(Z)에 매핑해 주면서, 잠재공간(Z) 을 이용해 새로운 디자인을 할 수 있는 인공지능 모델로 구성될 수 있다. 디자인 생성 모델은 딥러닝을 이용한 모든 Generative Model로 구성될 수 있고, 일 예로서, 생성 모델은, Vanilla GAN, DCGAN, cGAN, WGAN, EBGAN, BEGAN, CycleGAN, DiscoGAN, StarGAN, SRGAN, SEGAN, SDF 기반 GAN, Shape GAN, PolyGen 모델 중 적어도 하나로 구성될 수 있다. 그러나, 디자인 생성 모델이 GAN 모델로 한정될 것 은 아니며, 새로운 디자인 데이터를 생성 또는 보간할 수 있는 딥러닝 기반 모든 Generative Model을 사용할 수 있다. 예를 들어, 디자인 생성 모델은 딥러닝 모델, Boolean 모델, Morphing 모델, Interpolation 모델 중 적 어도 하나를 포함할 수 있다. 컴퓨팅 장치는 학습된 생성 모델의 잠재공간(Z)을 이용하여 새로운 추가 신규 디자인을 생성할 수 있다. S600 과정에서, 컴퓨팅 장치는 추가 신규 디자인들 중 유사한 디자인을 제외하는 필터링을 수행할 수 있다. S600 과정은 S300 과정에서 설명한 필터링 과정이 그대로 적용될 수 있다. 나아가, 컴퓨팅 장치는 추가 신 규 디자인 혹은 필터링된 추가 신규 디자인을 참조 데이터로 사용하는 S100 과정을 수행할 수 있다. 여기서, 컴 퓨팅 장치는 추가 신규 디자인 혹은 필터링된 추가 신규 디자인을 이용해 패턴 이미지를 추출하거나, 스켈 레톤 이미지를 추출하는 등 전처리 과정을 수행할 수 있다. 컴퓨팅 장치는 추가 신규 디자인 및 필터링된 추가 신규 디자인을 이용해 제너레이티브 디자인을 적용해 신규 디자인을 생성하는 S200 과정을 반복할 수 있다. S700 과정에서, 컴퓨팅 장치는 신규 디자인을 평가할 수 있다. 컴퓨팅 장치는 신규 디자인을 해석한 신규 디자인 성능이 기 설정된 요구사항에 만족하는지 판단할 수 있 다. 요구사항은 사용자가 디자인 생성시 입력한 정보이거나, 제품 별로 기 설정된 정보일 수 있다. 여기서, 신규 디자인 성능은 사용자가 원하는 디자인 요구 사항에 대응하는 제1 해석 결과, 디자인에 대응하는 제품의 물리적 성능에 대응하는 제2 해석 결과, 디자인에 대응하는 제품을 제조할 때 고려되는 사항인 제조성에 대응하는 제3 해석 결과 중 적어도 하나를 포함할 수 있다. 이에 대응하여, 기 설정된 요구사항은 기 설정된 디자인 요구 사항에 대응하는 제1 요구 조건, 제품이 최소한으 로 가져야하는 기 설정된 물리적 성능에 대응하는 제2 요구 조건, 제품을 제조할 때 최소한으로 고려되는 사항 으로 기 설정된 제조성에 대응하는 제3 요구 조건 중 적어도 하나를 포함할 수 있다. 다양한 실시예에서, 컴퓨팅 장치는 신규 디자인의 제1 내지 제3 해석 결과 중 적어도 하나와 대응하는 제1 내지 제3 요구 조건 중 하나를 대비하여 요구 조건을 만족하는지 평가할 수 있다. 컴퓨팅 장치는 S100 내지 S600 과정을 반복적으로 수행할 수 있다. 여기서, 컴퓨팅 장치는 S400 과정 에서 필터링된 신규 디자인의 개수가 기 설정된 제3 임계 값 보다 많을 때까지 S100 내지 S600 과정을 반복적으 로 수행할 수 있다. 도 4 및 도 5를 참조하면, S800 과정에서, 컴퓨팅 장치는 신규 디자인을 저차원 공간에 표현하는 과정을 수행할 수 있다. 이후에서 설명의 편의를 위해 암시적 신경 표현 모델에 입력된 신규 디자인를 입력 디자인(Xi)이라하고, 출력된 출력 디자인(Xo)이라 한다. S800 과정에서, 컴퓨팅 장치는 복수의 신규 디자인(Xi)를 이용해 암시적 신경 표현(Implicit Neural Representation) 모델을 학습할 수 있다. 암시적 신경 표현 모델은 복수의 신규 디자인(Xi)를 저차원의 연속이며 파라메트릭한 공간(z) 상에 표현할 수 있으며, 이를 복수의 디자인 맵핑 데이터(Z)라 할 수 있다. 컴퓨팅 장치는 암시적 신경 표현 모델을 이용해 복수의 신규 디자인(Xi)를 저차원 공간(z) 상에 연속적인 값으로 표현할 수 있다. 디자인 맵핑 데이터(Z)는 신규 디자인(Xi)와 일대일 대응하는 저차원 공간(z) 상에 표현된 신규 디자인(Xi)의 정보를 가지며, 복수의 디자인 맵핑 데이터들(Z) 사이는 연속적인 값을 가지므로, 미분 가능하게 표현된다. 컴퓨팅 장치는 저차원의 연속적인 파라메트릭한 공간(z)에서 복수의 디자인 맵핑 데이터(Z)를 이용해 신규 디자인에 대한 탐색 과정, 디자인의 보간 과정, 디자인에 대한 성능 예측 과정, 디자인의 최적화 과정, 디자인 의 역설계 과정 중 적어도 하나를 수행할 수 있다. 컴퓨팅 장치는 암시적 신경 표현 모델을 이용해 연속하는 저차원 공간(z) 상에 표현되되, 신규 디자인(X i)에 대응하는 디자인 맵핑 데이터(Z)를 스토리지()에 저장할 수 있다. 신규 디자인(Xi)은 상술한 제너레이티브 디자인에 포함된 위상최적화, 치수 및 형상 최적화, 파라매트릭 디자인, 사용자 데이터 등 모든 시드 데이터를 포함할 수 있다. 컴퓨팅 장치는 모든 시드 데이터를 암시적 신경 표현 모델에 대한 딥러닝을 통해 저차원의 잠재공간(z)으 로 맵핑한 후 잠재공간(z) 내에서 디자인 맵핑 데이터(Z)를 가공하여 새로운 디자인 맵핑 데이터(Z')를 생성할 수 있다. 컴퓨팅 장치는 잠재공간(z)의 새로운 디자인 맵핑 데이터(Z')를 이용해 종래의 신규 디자인(Xi)과는 구별 되는 출력 디자인(Xo)를 생성할 수 있으며, 출력 디자인(Xo)는 새롭게 합성된 데이터이므로 합성 데이터라 할 수 있다. 이하에서 도 2 및 도 4를 참조하여, 디자인에 대한 탐색 과정, 디자인의 보간 과정, 디자인에 대한 성능 예측 과정, 디자인의 최적화 과정, 디자인의 역설계 과정에 대해 설명한다. S20 과정에서, 컴퓨팅 장치는 저차원 공간(z)에서 복수의 디자인 맵핑 데이터(Z) 중 제1 디자인 맵핑 데이 터(Z1)를 탐색하고, 제1 디자인 맵핑 데이터(Z1)에 대응하는 제1 디자인(X1)를 획득하는 디자인 탐색 과정을 수 행할 수 있다. 저차원 공간(z) 상에 표현된 디자인 맵핑 데이터(Z)는 연속적인 수치 값으로 표현되기 때문에 2차원 혹은 3차원 디자인 데이터로 표현되는 신규 디자인(X) 보다 탐색이 용이할 수 있다. 그러므로, 특정한 제1 디자인(X1)를 찾 기 위해, 저차원 공간(z) 상에서 제1 디자인(X1)에 대응하는 제1 디자인 맵핑 데이터(Z1)을 검색함으로써, 빠르 게 제1 디자인(X1)를 찾을 수 있다. 컴퓨팅 장치는 암시적 신경 표현 모델을 신규 디자인(X)으로 학습한 이후에는 잠재공간(z) 내에 표현된 디 자인 맵핑 데이터(Z)를 이용해 원하는 신규 디자인를 실시간으로 탐색할 수 있다. 도 11은 잠재공간에서 디자인 보간의 예시를 도시한 것이다. 도 11을 참조하면, S20과정에서, 컴퓨팅 장치는 저차원 공간(z)에서 복수의 디자인 맵핑 데이터(Z) 중 복 수의 제2 디자인 맵핑 데이터(Z1)를 보간하고, 보간된 제2 디자인 맵핑 데이터(Z1')에 대응하는 제2 디자인(X2) 를 획득하는 디자인 보간 과정을 수행할 수 있다. 다양한 실시예에서, 컴퓨팅 장치는 저차원 공간(z)에서 복수의 디자인 맵핑 데이터(Z) 중 N 개의 데이터 를 선택해 보간 방법을 통해 제2 디자인 매핑 데이터(Z2)로 보간하고, 보간된 제2 디자인 맵핑 데이터(Z2)에 대 응하는 제2 디자인(X2)를 획득하는 디자인 보간 과정을 수행할 수 있다. 다양한 실시예에서, 컴퓨팅 장치는 저차원 공간(z)에서 표현된 적어도 하나의 디자인 맵핑 데이터들에 보 간 방법(예로, 중간 값, 평균 값, 혹은 다른 가중치로 평균 등)을 적용하여 새롭운 디자인 맵핑 데이터를 생성 할 수 있다. 이러한 보간 과정은 저차원 공간(z) 내에서 이뤄지기 때문에 간단한 연산으로 수행될 수 있다. 종래의 경우, 제너레이티브 디자인으로 생성된 복수의 신규 디자인은 연속적인 디자인 스페이스에 표현될 수 없 다. 그렇기 때문에 디자인A와 디자인B의 중간에 위치한 디자인C를 생성할 수 없다. 하지만, 본 발명의 실시예는 저차원의 잠재공간(z)에서 모든 디자인에 대응하는 디자인 맵핑 데이터들을 보간하여 새로운 디자인을 표현할 수 있다. 즉, 컴퓨팅 장치는 암시적 신경 표현 모델을 신규 디자인(X)으로 학습한 이후에는 잠재공간(z) 내에 표현 된 디자인 맵핑 데이터(Z)를 이용해 원하는 신규 디자인를 실시간으로 생성할 수 있다. S30 과정에서, 컴퓨팅 장치는 저차원 공간(z)의 복수의 디자인 맵핑 데이터(Z) 및 복수의 디자인 맵핑 데 이터(Z)에 대응하는 복수의 디자인(X)의 성능 데이터(Y)로 학습된 성능 예측 모델을 이용해서, 제3 디자인(X3) 에 대한 제3 디자인 맵핑 데이터(Z3)를 통해 예측 성능 데이터(Y3')를 예측하는 디자인 예측 과정을 수행할 수 있다. 다시 말해, 디자인(X)에 대응하는 디자인 맵핑 데이터(Z)와 성능 데이터(Y)로 성능 예측 모델을 학습시킴으로써, 학습된 성층 예측 모델은 특정 디자인 맵핑 데이터를 입력으로 예측 성능 데이터를 출력할 수 있다. 컴퓨팅 장치는 디자인(X)와 각 디자인에 대응하는 성능 데이터(Y)를 학습 데이터로 성능 예측 모델을 학습 시킬 수 있다. 상세히는, 임시적 신경 표현 모델을 이용해 저차원 상에 표현된 디자인(X)의 디자인 맵핑 데이터 (Z)와 성능 데이터(Y)를 학습 데이터로 성능 예측 모델을 학습시킬 수 있다. 이 경우, 학습된 성능 예측 모델은 암시적 신경 표현 모델과 함께 새로운 디자인(X)에 대한 성능 데이터(Y')를 예측할 수 있다. 즉, 컴퓨팅 장치는 성능 예측 모델을 이용해 새로운 디자인(X)를 입력받아 새로운 디자인 의 제품의 성능을 예측할 수 있다. S40과정에서, 컴퓨팅 장치는 복수의 디자인(X)의 성능 데이터(Y)에 기초해서, 저차원 공간(z) 내에서 제4 디자인(X4)에 대응하는 제4 디자인 맵핑 데이터(Z4)를 최적화하고, 최적화된 제4 디자인 데이터(X4')를 획득하는 디자인 최적화 과정을 수행할 수 있다. 컴퓨팅 장치는 특정 디자인의 성능 데이터가 사용자가 원하는 요구사항을 만족하는 경우, 해당하는 디자인 에 대응하는 디자인 맵핑 데이터를 획득하고, 해당 디자인 매핑 데이터에 기초해 제4 디자인 맵핑 데이터(Z4)를 최적화하고, 최적화된 제4 디자인(X4')를 획득함으로써, 사용자가 원하는 요구사항을 가지도록 최적화된 제4 디 자인(X4')를 획득할 수 있다. 다양한 실시예에서, 컴퓨팅 장치는 저차원 공간(z)에서 복수의 디자인 맵핑 데이터에 대한 위상최적화 기 법을 적용하여 위상최적화를 수행할 수 있다. 종래의 자동 매개변수화 최적 디자인 기술은 3D 형상 최적화를 위해서 디자인자가 베이스 디자인을 바탕으로 매 개변수화를 수행하고, 최적화할 디자인변수를 정의해야 한다. 이로 인해 지엽적인 디자인 스페이스 내에서만 최 적 디자인을 찾을 수 있다. 하지만, 본 발명의 실시예는 잠재공간에서 3D 형상이 자동으로 매개변수화 되기 때 문에 오리지널 디자인 스페이스에서 최적디자인을 할 수 있다. S40과정에서, 컴퓨팅 장치는 저차원 공간(z)의 성능 데이터(Y) 및 성능 데이터(Y)에 대응하는 복수의 디자 인 맵핑 데이터(Z)로 학습된 역설계모델을 이용해서, 제5 성능 데이터(Y5)에 대응하는 제5 디자인 맵핑 데이터 (Z5)를 획득하고, 제5 디자인 맵핑 데이터(Z5)에 대응하는 제5 디자인(X5)을 획득하는 역설계 과정을 수행할 수 있다. 여기서, 역설계 모델은 사용자가 원하는 요구사항에 대한 성능 데이터(Y)를 입력하면, 요구사항을 만족하는 디 자인(X)를 출력할 수 있다. 컴퓨팅 장치는 특정 제품에 대해 원하는 성능 스펙을 입력받음으로써, 입력한 성능 스펙을 만족하는 특정 제품에 대한 디자인를 출력할 수 있다. 즉, 사용자는 제품의 성능 데이터만 알고 있 다면 제품의 디자인을 역설계 할 수 있다. 상술한 모든 모델은 인공지능 모델을 의미할 수 있다. 여기서, 인공지능 모델은 하나 이상의 네트워크 함수로 구성되며, 하나 이상의 네트워크 함수는 일반적으로 '노드'라 지칭될 수 있는 상호 연결된 계산 단위들의 집합 으로 구성될 수 있다. 이러한 '노드'들은 '뉴런(neuron)'들로 지칭될 수도 있다. 하나 이상의 네트워크 함수는 적어도 하나 이상의 노드들을 포함하여 구성된다. 하나 이상의 네트워크 함수를 구성하는 노드(또는 뉴런)들은 하나 이상의 '링크'에 의해 상호 연결될 수 있다. 인공지능 모델 내에서, 링크를 통해 연결된 하나 이상의 노드들은 상대적으로 입력 노드 및 출력 노드의 관계를 형성할 수 있다. 입력 노드 및 출력 노드의 개념은 상대적인 것으로서, 하나의 노드에 대하여 출력 노드 관계에 있는 임의의 노드는 다른 노드와의 관계에서 입력 노드 관계에 있을 수 있으며, 그 역도 성립할 수 있다. 전술 한 바와 같이, 입력 노드 대 출력 노드 관계는 링크를 중심으로 생성될 수 있다. 하나의 입력 노드에 하나 이상의 출력 노드가 링크를 통해 연결될 수 있으며, 그 역도 성립할 수 있다. 하나의 링크를 통해 연결된 입력 노드 및 출력 노드 관계에서, 출력 노드는 입력 노드에 입력된 데이터에 기초 하여 그 값이 결정될 수 있다. 여기서 입력 노드와 출력 노드를 상호 연결하는 노드는 가중치(weight)를 가질 수 있다. 가중치는 가변적일 수 있으며, 인공지능 모델이 원하는 기능을 수행하기 위해, 사용자 또는 알고리즘 에 의해 가변될 수 있다. 예를 들어, 하나의 출력 노드에 하나 이상의 입력 노드가 각각의 링크에 의해 상호 연 결된 경우, 출력 노드는 상기 출력 노드와 연결된 입력 노드들에 입력된 값들 및 각각의 입력 노드들에 대응하 는 링크에 설정된 가중치에 기초하여 출력 노드 값을 결정할 수 있다. 전술한 바와 같이, 인공지능 모델은 하나 이상의 노드들이 하나 이상의 링크를 통해 상호연결 되어 인공지능 모 델 내에서 입력 노드 및 출력 노드 관계를 형성한다. 인공지능 모델 내에서 노드들과 링크들의 개수 및 노드들 과 링크들 사이의 연관관계, 링크들 각각에 부여된 가중치의 값에 따라, 인공지능 모델의 특성이 결정될 수 있 다. 예를 들어, 동일한 개수의 노드 및 링크들이 존재하고, 링크들 사이의 가중치 값이 상이한 두 인공지능 모 델이 존재하는 경우, 두 개의 인공지능 모델들은 서로 상이한 것으로 인식될 수 있다. 인공지능 모델을 구성하는 노드들 중 일부는, 최초 입력 노드로부터의 거리들에 기초하여, 하나의 레이어 (layer)를 구성할 수 있다. 예를 들어, 최초 입력 노드로부터 거리가 n인 노드들의 집합은, n 레이어를 구성할 수 있다. 최초 입력 노드로부터 거리는, 최초 입력 노드로부터 해당 노드까지 도달하기 위해 거쳐야 하는 링크 들의 최소 개수에 의해 정의될 수 있다. 그러나, 이러한 레이어의 정의는 설명을 위한 임의적인 것으로서, 인공 지능 모델 내에서 레이어의 차수는 전술한 것과 상이한 방법으로 정의될 수 있다. 예를 들어, 노드들의 레이어 는 최종 출력 노드로부터 거리에 의해 정의될 수도 있다. 최초 입력 노드는 인공지능 모델 내의 노드들 중 다른 노드들과의 관계에서 링크를 거치지 않고 데이터가 직접 입력되는 하나 이상의 노드들을 의미할 수 있다. 또는, 인공지능 모델 네트워크 내에서, 링크를 기준으로 한 노 드 간의 관계에 있어서, 링크로 연결된 다른 입력 노드들 가지지 않는 노드들을 의미할 수 있다. 이와 유사하게, 최종 출력 노드는 인공지능 모델 내의 노드들 중 다른 노드들과의 관계에서, 출력 노드를 가지지 않 는 하나 이상의 노드들을 의미할 수 있다. 또한, 히든 노드는 최초 입력 노드 및 최후 출력 노드가 아닌 인공지 능 모델을 구성하는 노드들을 의미할 수 있다. 본 발명의 일 실시예에 따른 인공지능 모델은 입력 레이어의 노 드가 출력 레이어에 가까운 히든 레이어의 노드보다 많을 수 있으며, 입력 레이어에서 히든 레이어로 진행됨에 따라 노드의 수가 감소하는 형태의 인공지능 모델일 수 있다. 인공지능 모델은 하나 이상의 히든 레이어를 포함할 수 있다. 히든 레이어의 히든 노드는 이전의 레이어의 출력 과 주변 히든 노드의 출력을 입력으로 할 수 있다. 각 히든 레이어 별 히든 노드의 수는 동일할 수도 있고 상이 할 수도 있다. 입력 레이어의 노드의 수는 입력 데이터의 데이터 필드의 수에 기초하여 결정될 수 있으며 히든 노드의 수와 동일할 수도 있고 상이할 수도 있다. 입력 레이어에 입력된 입력 데이터는 히든 레이어의 히든 노 드에 의하여 연산될 수 있고 출력 레이어인 완전 연결 레이어(FCL: fully connected layer)에 의해 출력될 수 있다. 컴퓨팅 장치는 학습 데이터를 이용하여 인공지능 모델을 학습시킬 수 있다. 컴퓨팅 장치는 학습 데이 터 세트를 이용하여 인공지능 모델을 구성하는 하나 이상의 네트워크 함수에 대한 학습을 수행할 수 있다. 일 실시예에서, 컴퓨팅 장치는 학습 입력 데이터 세트 각각을 하나 이상의 네트워크 함수에 입력시키고, 하나 이상의 네트워크 함수로 연산된 출력 데이터 값을 특징 값으로 추출하고, 추출된 특징 값을 기초로 인공지 능 모델을 학습시킬 수 있다. 다른 실시예로, 컴퓨팅 장치는 학습 입력 데이터 세트 각각을 하나 이상의 네트워크 함수에 입력시키고, 하나 이상의 네트워크 함수로 연산된 출력 데이터 각각과 학습 입력 데이터 세트 각각의 레이블에 해당하는 학 습 출력 데이터 세트 각각을 비교하여 오차를 도출할 수 있다. 인공지능 모델의 학습에서 학습 입력 데이터는 하나 이상의 네트워크 함수의 입력 레이어에 입력될 수 있으며, 학습 출력 데이터는 하나 이상의 네트워크 함수의 출력과 비교될 수 있다. 컴퓨팅 장치는 학습 입력 데이 터에 대한 하나 이상의 네트워크 함수의 연산 결과와 학습 출력 데이터(레이블)의 오차에 기초하여 인공지능 모 델을 학습시킬 수 있다. 또한, 컴퓨팅 장치는 오차에 기초하여 하나 이상의 네트워크 함수의 가중치를 역전파 방식으로 조정할 수 있다. 즉, 컴퓨팅 장치는 학습 입력 데이터에 대한 하나 이상의 네트워크 함수의 연산 결과와 학습 출력 데이터의 오차에 기초하여 하나 이상의 네트워크 함수의 출력이 학습 출력 데이터에 가까워지도록 가중치를 조정할 수 있다. 컴퓨팅 장치는 하나 이상의 네트워크 함수의 학습이 사전 결정된 에폭 이상 수행된 경우, 검증 데이터를 이용하여 학습의 중단 여부를 결정할 수 있다. 사전 결정된 에폭은 전체 학습 목표 에폭의 일부일 수 있다. 검 증 데이터는 레이블링 된 학습 데이터 세트 중 적어도 일부로 구성될 수 있다. 즉, 컴퓨팅 장치는 학습 데 이터 세트를 통해 인공지능 모델의 학습을 수행하며, 인공지능 모델의 학습이 사전결정 된 에폭 이상 반복된 후, 검증 데이터를 이용하여 인공지능 모델의 학습 효과가 사전 결정된 수준 이상인지 여부를 판단할 수 있다. 예를 들어, 컴퓨팅 장치는 100개의 학습 데이터를 이용하여 목표 반복 학습 횟수가 10회인 학습을 수행하 는 경우, 사전결정 된 에폭인 10회의 반복 학습을 수행한 후, 10개의 검증 데이터를 이용하여 3회의 반복 학습 을 수행하여, 3회의 반복 학습 동안 인공지능 모델 출력의 변화가 사전결정 된 수준 이하인 경우 더 이상의 학 습이 무의미한 것으로 판단하고 학습을 종료할 수 있다. 즉, 검증 데이터는 인공지능 모델의 반복 학습에서 에 폭별 학습의 효과가 일정 이상인지 이하인지 여부에 기초하여 학습의 완료를 결정하는 데 이용될 수 있다. 전술 한 학습 데이터, 검증 데이터의 수 및 반복 횟수는 예시일 뿐이며 이에 한정되지 않는다. 컴퓨팅 장치는 테스트 데이터 세트를 이용하여 하나 이상의 네트워크 함수의 성능을 테스트하여 하나 이상 의 네트워크 함수의 활성화 여부를 결정함으로써, 인공지능 모델을 생성할 수 있다. 테스트 데이터는 인공지능 모델의 성능을 검증하기 위하여 사용될 수 있으며, 학습 데이터 세트 중 적어도 일부로 구성될 수 있다. 예를 들어, 학습 데이터 세트 중 70%는 인공지능 모델의 학습(즉, 레이블과 비슷한 결과값을 출력하도록 가중치를 조 정하기 위한 학습)을 위해 활용될 수 있으며, 30%는 인공지능 모델의 성능을 검증하기 위한 테스트 데이터로써 활용될 수 있다. 컴퓨팅 장치는 학습이 완료된 인공지능 모델에 테스트 데이터 세트를 입력하고 오차를 측정하여 사전 결정 된 성능 이상인지 여부에 따라 인공지능 모델의 활성화 여부를 결정할 수 있다. 컴퓨팅 장치는 학습이 완 료된 인공지능 모델에 테스트 데이터를 이용하여 학습 완료된 인공지능 모델의 성능을 검증하고 학습 완료된 인 공지능 모델의 성능이 사전결정 된 기준 이상인 경우 해당 인공지능 모델을 다른 어플리케이션에서 사용하도록 활성화할 수 있다. 또한, 인공지능 모델은 교사 학습(supervised learning), 비교사 학습(unsupervised learning), 및 반교사학습 (semi supervised learning) 중 적어도 하나의 방식으로 학습될 수 있다. 인공지능 모델의 학습은 출력의 오류 를 최소화하기 위한 것이다. 인공지능 모델의 학습에서 반복적으로 학습 데이터를 인공지능 모델에 입력시키고 학습 데이터에 대한 인공지능 모델의 출력과 타겟의 에러를 계산하고, 에러를 줄이기 위한 방향으로 인공지능 모델의 에러를 인공지능 모델의 출력 레이어에서부터 입력 레이어 방향으로 역전파(backpropagation)하여 인공 지능 모델의 각 노드의 가중치를 업데이트 하는 과정이다. 교사 학습의 경우 각각의 학습 데이터에 정답이 레이블링되어있는 학습 데이터를 사용하며(즉, 레이블링된 학습 데이터), 비교사 학습의 경우는 각각의 학습 데이터에 정답이 레이블링되어 있지 않을 수 있다. 즉, 예를 들어, 데이터 분류에 관한 교사 학습의 경우의 학습 데이터는 학습 데이터 각각에 카테고리가 레이블링 된 데이터 일 수 있다. 학습 데이터가 인공지능 모델에 입력되고, 인공지능 모델의 출력(카테고리)과 학습 데이터의 레이블을 비교함으로써 오류(error)가 계산될 수 있다. 다른 예로, 데이터 분류에 관한 비교사 학습의 경우 입력인 학습 데이터가 인공지능 모델 출력과 비교됨으로써 오류가 계산될 수 있다. 계산된 오류는 인공지능 모델에서 역방향(즉, 출력 레이어에서 입력 레이어 방향)으로 역전파 되며, 역전파에 따라 인공지능 모델의 각 레이어의 각 노드들의 연결 가중치가 업데이트 될 수 있다. 업데이트 되는 각 노드의 연결 가중치는 학습률(learning rate)에 따라 변화량이 결정될 수 있다. 입력 데이터 에 대한 인공지능 모델의 계산과 에러의 역전파는 학습 사이클(epoch)을 구성할 수 있다. 학습률은 인공지능 모 델의 학습 사이클의 반복 횟수에 따라 상이하게 적용될 수 있다. 예를 들어, 인공지능 모델의 학습 초기에는 높 은 학습률을 사용하여 인공지능 모델이 빠르게 일정 수준의 성능을 확보하도록 하여 효율성을 높이고, 학습 후 기에는 낮은 학습률을 사용하여 정확도를 높일 수 있다. 인공지능 모델의 학습에서 일반적으로 학습 데이터는 실제 데이터(즉, 학습된 인공지능 모델을 이용하여 처리하 고자 하는 데이터)의 부분집합일 수 있으며, 따라서, 학습 데이터에 대한 오류는 감소하나 실제 데이터에 대해 서는 오류가 증가하는 학습 사이클이 존재할 수 있다. 과적합(overfitting)은 이와 같이 학습 데이터에 과하게 학습하여 실제 데이터에 대한 오류가 증가하는 현상이다. 과적합은 머신러닝 알고리즘의 오류를 증가시키는 원 인으로 작용할 수 있다. 이러한 과적합을 막기 위하여 다양한 최적화 방법이 사용될 수 있다. 과적합을 막기 위해서는 학습 데이터를 증가시키거나, 레귤라이제이션(regularization), 학습의 과정에서 네트워크의 노드 일부 를 생략하는 드롭아웃(dropout) 등의 방법이 적용될 수 있다. 다양한 실시예에서, 인공지능 모델은 복수의 인공지능 모델을 포함할 수 있다. 복수의 인공지능 모델은 머신러 닝 모델인 랜덤 포레스트(random forest) 모델, 서포트벡터머신(SVM, Support vector machine) 등과 딥러닝 (Deep learning) 모델인 합성곱 신경망(CNN, Convolutional NN) 계열 모델, 순환 신경망(RNN, Recurrent Neural Network) 계열 모델 중 적어도 하나를 포함할 수 있으며, 3D 딥러닝에 특화된 PointNet계열 및 3D CNN 계열과 그래픽 신경망(Graph Neural Network, GNN)으로 구성될 수 있으며, 복수의 모델을 앙상블 할 수도 있다. 또한, 모든 모델들은 2D와 3D 데이터를 모두 활용 가능하다. 본 발명은 도면에 도시된 실시예를 참고로 설명되었으나 이는 예시적인 것에 불과하며, 본 기술 분야의 통상의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 타 실시예가 가능하다는 점을 이해할 것이다. 따라서, 본 발명의 진정한 기술적 보호 범위는 첨부된 등록청구범위의 기술적 사상에 의해 정해져야 할 것이다."}
{"patent_id": "10-2022-0134996", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 장치의 하 드웨어 구성도이다. 도 2은 본 발명의 일 실시예에 따른 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방법의 순 서도이다. 도 3은 본 발명의 실시예에 따른 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방법의 구성 블록도이다. 도 4은 본 발명의 일 실시예에 따른 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방법의 개 념도이다. 도 5는 본 발명의 실시예에 따른 디자인 생성 방법의 순서도이다. 도 6은 본 발명의 실시예에 따른 참조 데이터와 암시적 신경 표현 기반의 최적화된 생성적 디자인 방법에서 참 조 데이터를 획득하는 과정의 순서도이다. 도 7(a) 내지 도 7(d)는 입력 데이터를 전처리하여 생성된 전처리된 이미지의 예시를 보여준다. 도 8은 패턴 이미지를 참조 데이터로 하여 생성된 신규 디자인의 다양한 예시를 도시한 것이다. 도 9은 스켈레톤 이미지를 참조 데이터로 하여 생성된 신규 디자인의 다양한 예시를 도시한 것이다. 도 10은 뷰 이미지 혹은 단면 이미지를 참조 데이터로 하여 생성된 신규 디자인의 다양한 예시를 도시한 것이다. 도 11은 잠재공간에서 디자인 보간의 예시를 도시한 것이다."}
