{"patent_id": "10-2014-0103999", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2016-0019333", "출원번호": "10-2014-0103999", "발명의 명칭": "전자 장치용 커버 디바이스", "출원인": "삼성전자주식회사", "발명자": "김봉재"}}
{"patent_id": "10-2014-0103999", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "커버 디바이스에 있어서,전자 장치의 화면의 적어도 일부를 덮을 수 있는 커버부;상기 전자 장치를 상기 커버 디바이스에 장착하기 위한 접합부; 및상기 커버부와 상기 접합부 사이를 연결하고 휘어질 수 있는 연결부를 포함하되,상기 연결부는 내부에 배치되는 빈 공간을 포함하는 커버 디바이스."}
{"patent_id": "10-2014-0103999", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 빈 공간은 다수 개 형성되고,상기 다수 개의 빈 공간들 사이의 간극은 일정하거나 또는 일정하지 않는 커버 디바이스."}
{"patent_id": "10-2014-0103999", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항에 있어서,상기 빈 공간은 다수 개 형성되고,상기 다수 개의 빈 공간들은 서로 같은 형상 또는 서로 다른 형상을 포함하는 커버 디바이스."}
{"patent_id": "10-2014-0103999", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1항에 있어서,상기 연결부는 표면 상에 배치되는 홈을 더 포함하고,상기 홈은 상기 빈 공간에 대응하는 위치에 배치되는 커버 디바이스."}
{"patent_id": "10-2014-0103999", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4항에 있어서,상기 홈은 상기 연결부의 양쪽 면에 각각 배치되고,상기 빈 공간은 상기 홈들 사이에 배치되는 커버 디바이스."}
{"patent_id": "10-2014-0103999", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1항에 있어서,상기 커버 디바이스는 제 1 시트와 제 2 시트 사이에 제 3 시트를 부착하는 방식으로 성형되는 커버 디바이스.공개특허 10-2016-0019333-3-청구항 7 제 6항에 있어서상기 빈 공간은,상기 제 3 시트에 형성되는 커버 디바이스."}
{"patent_id": "10-2014-0103999", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 6항에 있어서,상기 제 1 시트 또는 상기 제 2 시트는,가죽 시트를 포함하는 커버 디바이스."}
{"patent_id": "10-2014-0103999", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 6항에 있어서,상기 제 3 시트는,열가소성수지를 포함하는 커버 디바이스."}
{"patent_id": "10-2014-0103999", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 6항에 있어서,상기 커버부는,상기 제 1 시트와 상기 제 2 시트 사이에 부착되는 열가소성 제 4 시트를 더 포함하는 커버 디바이스."}
{"patent_id": "10-2014-0103999", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 1항에 있어서,상기 커버부는,투명 창을 포함하는 커버 디바이스."}
{"patent_id": "10-2014-0103999", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 1 항에 있어서,상기 접합부,상기 전자 장치의의 외관을 형성하는 탈착 가능한 기기 케이스를 포함하는 커버 디바이스."}
{"patent_id": "10-2014-0103999", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 12항에 있어서,상기 탈착 가능한 기기 케이스는,공개특허 10-2016-0019333-4-배터리 커버를 포함하는 커버 디바이스."}
{"patent_id": "10-2014-0103999", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "커버 디바이스에 있어서,다층 시트를 포함하되,상기 다층 시트의 제 1 부분은 전자 장치의 화면의 적어도 일부를 덮을 수 있는 커버부를 포함하고,상기 다층 시트의 제 2 부분은 상기 전자 장치가 장착되는 접합부를 포함하며,상기 다층 시트의 제 3 부분은 상기 커버부와 상기 접합부 사이를 연결하고 휘어질 수 있는 연결부를 포함하되,상기 연결부는 내부에 배치되는 적어도 하나의 빈 공간을 포함하는 커버 디바이스."}
{"patent_id": "10-2014-0103999", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 14항에 있어서,상기 연결부는 표면 상에 배치되는 적어도 하나의 홈을 더 포함하고,상기 적어도 하나의 홈은 상기 적어도 하나의 빈 공간에 대응하는 위치에 배치되는 커버 디바이스."}
{"patent_id": "10-2014-0103999", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 15항에 있어서,상기 적어도 하나의 홈은,불박(heat printing)을 이용하여 형성되는 커버 디바이스."}
{"patent_id": "10-2014-0103999", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 14항에 있어서,상기 다층 시트는,제 1 가죽 시트;제 2 가죽 시트; 및상기 제 1 가죽 시트와 상기 제 2 가죽 시트 사이에 부착되는 제 1 열가소성 시트를 포함하는 커버 디바이스."}
{"patent_id": "10-2014-0103999", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 14항에 있어서,상기 커버부는,투명 창을 포함하는 커버 디바이스."}
{"patent_id": "10-2014-0103999", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 14항에 있어서,공개특허 10-2016-0019333-5-상기 커버부는,상기 전자 장치의 홀 센서가 반응 가능한 자석을 포함하는 커버 디바이스."}
{"patent_id": "10-2014-0103999", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 14항에 있어서,상기 접합부에 부착되고,상기 전자 장치의 외관을 형성하는 탈착 가능한 배터리 커버를 포함하는 커버 디바이스."}
{"patent_id": "10-2014-0103999", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 다양한 실시예에 따르면, 커버 디바이스는, 전자 장치의 화면의 적어도 일부를 덮을 수 있는 커버부와, 상기 전자 장치를 상기 커버 디바이스에 장착하기 위한 접합부 및 상기 커버부와 상기 접합부 사이를 연결하고 휘어질 수 있는 연결부를 포함하되, 상기 연결부는 내부에 배치되는 빈 공간을 포함할 수 있다. 다양한 다른 실시예들이 가능하다."}
{"patent_id": "10-2014-0103999", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시예는 전자 장치용 커버 디바이스에 관한 것이다."}
{"patent_id": "10-2014-0103999", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전자 통신 산업의 발달로 말미암아 전자 장치는 현대 사회의 필수품이 되어가면서, 빠르게 변화하는 정보 전달 의 중요한 수단이 되고 있다. 또한, 전자 장치는 GUI(Graphic User Interface) 시스템의 발달에 따라 양질의 디 스플레이를 적용하고 있다. 일반적으로, 전자 장치는 하나의 디스플레이를 갖추고, 이 디스플레이를 통하여 다양한 정보를 표시한다. 최근, 고해상도의 큰 화면을 선호하는 경향이 뚜렷해지면서, 전자 장치는 이를 만족하는 디스플레이를 적용하고 있다. 한편, 전자 장치의 경우, 휴대하는 과정에서 또는 사용 중에 발생할 수 있는 스크래치나 충격에 의한 파손을 방 지하기 위한 목적과 심미적인 목적으로 케이스, 또는 커버들이 사용되고 있다."}
{"patent_id": "10-2014-0103999", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "전자 장치의 스크래치나 파손을 방지하기 위해서 커버를 사용하고 있으나 디스플레이부를 보호하는 커버부를 일 정 시간 열어 두고 닫는 경우 커버부가 디스플레이부를 덮지 못하고 열리거나 반쯤 덮이는 경우가 있다. 본 발명의 다양한 실시예는 일측(예: 연결부)을 구부리는 방식으로 커버부를 회동시켜 전자 장치의 일면(예: 화 면)을 덮을 수 있는 커버 디바이스에서 연결부의 탄성 복원력을 저하시켜 의도하지 않게 커버부가 열린 상태로 배치되는 것을 막을 수 있다."}
{"patent_id": "10-2014-0103999", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따르면, 커버 디바이스는, 전자 장치의 화면의 적어도 일부를 덮을 수 있는 커버부와, 상기 전자 장치를 상기 커버 디바이스에 장착하기 위한 접합부 및 상기 커버부와 상기 접합부 사이를 연결하고 휘어질 수 있는 연결부를 포함하되, 상기 연결부는 내부에 배치되는 빈 공간을 포함할 수 있다. 본 발명의 다른 실시예에 따르면, 커버 디바이스는, 다층 시트를 포함하되, 상기 다층 시트의 제 1 부분은 전자 장치의 화면의 적어도 일부를 덮을 수 있는 커버부를 포함하고, 상기 다층 시트의 제 2 부분은 상기 전자 장치가 장착되는 접합부를 포함하며, 상기 다층 시트의 제 3 부분은 상기 커버부 와 상기 접합부부 사이를 연결하고 휘어질 수 있는 연결부를 포함하되, 상기 연결부는 내부에 배치되는 적어도 하나의 빈 공간을 포함할 수 있다."}
{"patent_id": "10-2014-0103999", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 다양한 실시예에 따르면, 연결부의 탄성 복원력에 의하여 커버부가 의도하지 않게 열린 상태로 배치 되는 것을 막아 전자 장치를 보호할 수 있다. 또한, 본 발명의 다양한 실시예에 따르면, 연결부의 탄성 복원력에 의하여 커버부가 의도하지 않게 열린 상태로 배치되는 것을 막아 사용자 기기의 화면 활성화를 저지할 수 있고, 이는 사용자 기기의 전력 소모를 줄일 수 있 는 효과를 가진다."}
{"patent_id": "10-2014-0103999", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 일 실시예가 첨부된 도면과 연관되어 기재된다. 본 발명의 일 실시예는 다양한 변경을 가할 수 있고 여러 가지 실시예를 가질 수 있는바, 특정 실시예들이 도면에 예시되고 관련된 상세한 설명이 기재되어 있 다. 그러나, 이는 본 발명의 일 실시예를 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 일 실시 예의 사상 및 기술 범위에 포함되는 모든 변경 및/또는 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유사한 참조 부호가 사용되었다. 본 발명의 일 실시예에서 사용될 수 있는“포함한다”또는 “포함할 수 있다” 등의 표현은 개시(disclosure)된 해당 기능, 동작 또는 구성요소 등의 존재를 가리키며, 추가적인 하나 이상의 기능, 동작 또는 구성요소 등을 제한하지 않는다. 또한, 본 발명의 일 실시예에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성 을 미리 배제하지 않는 것으로 이해되어야 한다. 본 발명의 일 실시예에서 “또는” 등의 표현은 함께 나열된 단어들의 어떠한, 그리고 모든 조합을 포함한다. 예를 들어, “A 또는 B”는, A를 포함할 수도, B를 포함할 수 도, 또는 A 와 B 모두를 포함할 수도 있다. 본 발명의 일 실시예에서 사용된 “제 1,”“제 2,”“첫째,”또는“둘째,”등의 표현들은 일 실시예들의 다양 한 구성요소들을 수식할 수 있지만, 해당 구성요소들을 한정하지 않는다. 예를 들어, 상기 표현들은 해당 구성 요소들의 순서 및/또는 중요도 등을 한정하지 않는다. 상기 표현들은 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 수 있다. 예를 들어, 제1 사용자 기기와 제 2 사용자 기기는 모두 사용자 기기이며, 서로 다른 사 용자 기기를 나타낸다. 예를 들어, 본 발명의 일 실시예의 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 상기 어떤 구성요소 가 상기 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 상기 어떤 구성요소와상기 다른 구성요소 사이에 새로운 다른 구성요소가 존재할 수도 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 상기 어떤 구성 요소와 상기 다른 구성요소 사이에 새로운 다른 구성요소가 존재하지 않는 것으로 이해될 수 있어야 할 것이다. 본 발명의 일 실시예에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명의 일 실 시예를 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함 한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명의 일 실시예가 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가 지고 있다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥 상 가지는 의미와 일치하는 의미를 가지는 것으로 해석되어야 하며, 본 발명의 일 실시예에서 명백하게 정의되지 않는 한, 이상적 이거나 과도하게 형식적인 의미로 해석되지 않는다. 본 발명의 일 실시예에 따른 전자 장치는, 통신 기능이 포함된 장치일 수 있다. 예를 들면, 전자 장치는 스마트 폰(smartphone), 태블릿 PC(tablet personal computer), 이동 전화기(mobile phone), 화상전화기, 전자북 리더 기(e-book reader), 데스크탑 PC(desktop personal computer), 랩탑 PC(laptop personal computer), 넷북 컴퓨 터(netbook computer), PDA(personal digital assistant), PMP(portable multimedia player), MP3 플레이어, 모바일 의료기기, 카메라(camera), 또는 웨어러블 장치(wearable device)(예: 전자 안경과 같은 head-mounted- device(HMD), 전자 의복, 전자 팔찌, 전자 목걸이, 전자 앱세서리(appcessory), 전자 문신, 또는 스마트 와치 (smart watch))중 적어도 하나를 포함할 수 있다. 어떤 실시예들에 따르면, 전자 장치는 통신 기능을 갖춘 스마트 가전 제품(smart home appliance)일 수 있다. 스마트 가전 제품은, 예를 들자면, 전자 장치는 텔레비전, DVD(digital video disk) 플레이어, 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스(set-top box), TV 박스(예를 들면, 삼성 HomeSyncTM, 애플TVTM, 또는 구글 TVTM), 게임 콘솔(game consoles), 전자 사전, 전자 키, 캠코더(camcorder), 또는 전자 액자 중 적어도 하나를 포함할 수 있다. 어떤 실시예들에 따르면, 전자 장치는 각종 의료기기(예: MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 초음파기 등), 네비게이션(navigation) 장치, GPS 수 신기(global positioning system receiver), EDR(event data recorder), FDR(flight data recorder), 자동차 인포테인먼트(infotainment) 장치, 선박용 전자 장비(예: 선박용 항법 장치 및 자이로 콤파스 등), 항공 전자기 기(avionics), 보안 기기, 차량용 헤드 유닛, 산업용 또는 가정용 로봇, 금융 기관의 ATM(automatic teller뭩 machine) 또는 상점의 POS(point of sales) 중 적어도 하나를 포함할 수 있다. 어떤 실시예들에 따르면, 전자 장치는 통신 기능을 포함한 가구(furniture) 또는 건물/구조물의 일부, 전자 보 드(electronic board), 전자 사인 입력장치(electronic signature receiving device), 프로젝터(projector), 또는 각종 계측기기(예: 수도, 전기, 가스, 또는 전파 계측 기기 등) 중 적어도 하나를 포함할 수 있다. 본 발 명의 일 실시예에 따른 전자 장치는 전술한 다양한 장치들 중 하나 또는 그 이상의 조합일 수 있다. 또한, 본 발명의 일 실시예에 따른 전자 장치는 플렉서블 장치일 수 있다. 또한, 본 발명의 일 실시예에 따른 전자 장치 는 전술한 기기들에 한정되지 않음은 당업자에게 자명하다. 이하, 첨부된 도면을 참조하여 일 실시예에 따른 전자 장치에 대해서 살펴본다. 일 실시예에서 이용되는 사용자 라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공지능 전자 장치)를 지칭할 수 있다. 도 1 내지 2는 본 발명의 다양한 실시예에 따른 전자 장치를 도시한다. 도 1 내지 2를 참조하면, 전자 장치는 커버 디바이스 및 사용자 기기를 포함할 수 있다. 커버 디바이스는 제 1 커버부, 연결부 및 제 2 커버부를 포함할 수 있다. 제 1 커버부는 평판 형으로 사용자 기기의 하면(300S2)을 커버할 수 있다. 제 1 커버부는 사용 자 기기와 연결될 수 있다. 제 1 커버부는 사용자 기기와 제 1 커버부 사이에 배치되는 설 치 판을 포함할 수 있다. 한 실시예에 따르면, 설치 판은 사용자 기기의 하면(300S2)을 구현하 는 기기 케이스(예: 배터리 커버)를 포함할 수 있다. 여기서, 설치 판은 사용자 기기의 도시하지 않 은 다른 기기 케이스(예: 하우징)에 체결 가능하다. 예를 들자면, 설치 판은 테두리 영역에 배치되는 다수의 후크들(hooks)을 포함하고, 사용자 기기의 다른 기기 케이스는 설치 판의 후크들과 스냅 핏(snap- fits) 결합 가능한 후크 체결 홈들(미도시)을 포함할 수 있다. 이밖에 제 1 커버부의 설치 판은 사용자 기기를 붙잡을 수 있는 다양한 실시예들을 포함할 수 있다. 또는, 제 1 커버부의 설치 판은 사용자 기기와 전기적으로 연결 가능한 적어도 하나의 부품을 포함할 수 있다. 예를 들자면, 설치 판은 도시하지 않은 안테나(예: NFC(Near Field Communication) 안테 나)를 포함할 수 있다. 또는, 제 1 커버부는, 도시하지 않았지만, 사용자 기기의 적어도 하나의 부품(예: 카메라, 플래시 또 는 스피커)에 대응하는 관통 홀을 포함할 수 있다. 연결부는 제 1 커버부와 제 2 커버부 사이를 연결할 수 있다. 후술하겠지만, 제 2 커버부 를 회동시켜 사용자 기기의 상면(300S1)을 덮게 하는 경우, 연결부는 휘어지고 사용자 기기의 측면(300S3)을 커버할 수 있다. 여기서, 연결부는 대체적으로 둥글게 휘어지거나, 또는 적어도 한 곳에서 각지게 휘어질 수도 있다. 연결부는 적어도 하나의 변형부를 포함할 수 있다. 적어도 하나의 변형부는 연결부에서 휘 어지기 용이한 부분을 가리킬 수 있다. 여기서, 적어도 하나의 변형부는 연결부에서 주변보다 얇은 두께를 가지는 부분을 포함할 수 있다. 적어도 하나의 변형부는 연결부에서 탄성 복원력이 약한 부분 을 포함할 수 있다. 한 실시예에 따르면, 적어도 하나의 변형부는 연결부의 표면에 배치되는 홈(221, 222)을 포함할 수 있다. 여기서, 홈(221, 222)은 부재에 오목하고 길게 팬 줄을 가리킬 수 있다. 도시된 바와 같이, 홈(221, 222)은 연결부의 양쪽 면 모두에 배치될 수 있다. 제 2 커버부는 연결부를 휘어 회동 가능하고, 사용자 기기의 상면(300S1)을 커버할 수 있다. 제 2 커버부는 사용자 기기의 상면(300S1)의 형상(예: 평면 또는 곡면)에 대응하는 형상을 포함할 수 있 다. 제 2 커버부는 사용자 기기의 상면(300S1)에 배치된 적어도 하나의 전자 부품(예: 스피커 301)에 대 응하는 관통 홀을 포함할 수 있다. 또는, 제 2 커버부는 투명 창(또는, 윈도우)를 포함할 수 있 다. 제 2 커버부가 사용자 기기의 상면(300S1)을 덮고 있더라도, 사용자 기기의 화면은 투 명 부를 통하여 비칠 수 있다. 또는, 제 2 커버부는 사용자 기기의 상면(300S1)에 배치된 버튼 (예: 홈 버튼)에 대응하는 홈을 포함할 수 있다. 버튼은 상면(300S1)에 대하여 돌출될 수 있고, 버튼의 돌출 부분은 제 2 커버부의 홈에 끼워질 수 있어, 제 2 커버부와 사용자 기기(30 0)의 상면(300S1) 사이의 간극을 줄이거나 밀착시킬 수 있다. 사용자 기기는 상면(300S1), 하면(300S2) 및 측면(300S3)을 포함할 수 있다. 상면(300S1)과 하면(300S2) 은 서로 대항하고, 측면(300S3)은 상면(300S1)과 하면(300S2) 사이를 연결할 수 있다. 상면(300S1), 하면 (300S2) 또는 측면(300S3)은 평면 또는 곡면을 포함할 수 있다. 예를 들자면, 사용자 기기의 상면(300S1) 또는 하면(300S2)은, 도시하지 않았지만, 볼록 또는 오목한 곡면을 포함할 수 있다. 또는, 사용자 기기는 플렉시블(flexible) 또는 웨어러블(wearable)할 수 있다. 사용자 기기는 스피커, 화면, 적어도 하나의 버튼, 적어도 하나의 센서, 카메라 , 마이크로폰 또는 소켓을 포함할 수 있다. 화면은 사용자 기기의 상면(300S1)에 배치될 수 있다. 한 실시예에 따르면, 화면은 디스플레이 패널(LCD(liquid-crystal display) 또는 AM-OLED(active-matrix organic light-emitting diode) 등)을 포함할 수 있다. 또는, 화면은 사용자 터치에 반응하는 터치 패널 또는 디지타이저(dizitizer)를 포함할 수 있다. 적어도 하나의 버튼은 사용자 기기의 상면(300S1)배치될 수 있다. 또는, 적어도 하나의 버튼은, 도시하지 않았지만, 사용자 기기의 측면(300S3)에 배치될 수도 있다. 한 실시예에 따르면, 적어도 하나의 버튼은 아래쪽으로 눌러지는 경우 이동되는 방식의 버튼 또는 터치 방식의 버튼을 포함할 수 있다. 적어도 하나의 센서는 사용자 기기의 내부 또는 일면(예: 상면 300S1, 하면 300S2 또는 하면 300S3) 에 배치될 수 있다. 적어도 하나의 센서는 물리 량을 계측하거나 사용자 기기의 작동 상태를 감지하 여, 계측 또는 감지된 정보를 전기 신호로 변환할 수 있다. 예를 들자면, 적어도 하나의 센서는 제스처 센 서, 근접 센서, 그립 센서, 자이로 센서, 가속도 센서, 지자기 센서, 기압 센서, 온/습도 센서, 홀(hall) 센서,RGB(red, green, blue) 센서, 조도 센서, 생체 센서(예: 심박 센서) 또는 UV(ultra violet) 센서를 포함할 수 있다. 적어도 하나의 센서는 커버 디바이스의 제 2 커버부의 개폐에 관한 데이터를 검출할 수 있다. 한 실시예에 따르면, 홀 센서는 사용자 기기의 상면(300S1)에 배치될 수 있다. 또한, 커버 디바이스 의 연결부 또는 제 2 커버부는 자석을 포함할 수 있다. 여기서, 커버 디바이스의 제 2 커버부가 회동되어 사용자 기기의 상면(300S1)을 덮는 경우, 사용자 기기의 홀 센서와 커버 디바이스의 자석은 서로 가까워지고, 사용자 기기의 홀 센서은 자석을 감지하고 이에 관한 검출 데이터를 도시하지 않은 프로세서(예: AP(Application Processor))로 제공할 수 있다. 이 밖에 다양한 센서(예: 조도 센서, 근접 센서 또는 이미지 센서 등)을 이용하여 커버 디바이스의 제 2 커버부 의 개폐를 감지할 수 있을 것이다. 한 실시예에 따르면, 사용자 기기는 커버 디바이스의 제 2 커버부의 개폐에 반응하여 화면(30 2)의 표시를 제어(예: 표시 영역 설정 또는 표시 모드 전환)할 수 있다. 예를 들자면, 사용자 기기는 제 2 커버부의 닫힘에 반응하여 화면의 일부 영역(예: 윈도우 132를 통하여 비칠 수 있는 크기의 영역)만 을 표시 영역으로 설정할 수 있다. 또는, 사용자 기기의 제 2 커버부의 열림에 반응하여 화면의 전체 영역을 표시 영역으로 설정할 수 있다. 다른 실시예에 따르면, 사용자 기기는 커버 디바이스의 제 2 커버부의 개폐에 반응하여 화면 의 터치 감도를 조절할 수도 있다. 예를 들자면, 사용자 기기는 제 2 커버부의 닫힘에 반응하여 화면의 터치 감도를 민감하게 조절하고, 제 2 커버부의 윈도우의 면에서의 사용자 터치를 감지 할 수 있다. 카메라는 사용자 기기의 상면(300S1)에 배치될 수 있다. 또는, 카메라는, 도시하지 않았지만, 사용자 기기의 하면(300S2) 또는 측면(300S3)에 배치될 수도 있다. 마이크로폰은 사용자 기기의 측면(300S3)에 배치될 수 있다. 또는, 마이크로폰은, 도시하지 않 았으나, 사용자 기기의 상면(300S1) 또는 하면(300S2)에 배치될 수도 있다. 소켓(예: USB 소켓, 충전잭 또는 통신잭 등)은 사용자 기기의 측면(300S2)에 배치될 수 있다. 또는, 사용자 기기는 도시하지 않았으나, 스타일러스(stylus)를 더 포함할 수 있다. 스타일러스는 사용자 기기의 측면(300S3)에 배치된 관통 홀(미도시)을 통하여 밖으로 이탈될 수 있다. 도 3은 본 발명의 다양한 실시예에 따른 전자 장치를 도시한다. 도 3을 참조하면, 커버 디바이스의 제 2 커버부는 연결부의 구부림을 이용하여 회동되고, 사용 자 기기의 상면(300S1)에 맞닿을 수 있다. 연결부의 적어도 하나의 변형부는 제 2 커버부 의 적어도 일부를 사용자 기기의 상면(300S1)으로부터 분리할 만큼의 탄성 복원력을 가지지 않을 수 있다. 또는, 커버 디바이스의 제 2 커버부는 연결부의 탄성 복원력을 억제할 수 있는 하중을 가질 수 있다. 따라서, 커버 디바이스의 제 2 커버부와 사용자 기기의 상면(300S1) 사이의 간극은 미세 할 수 있다. 도 4는 본 발명의 다양한 실시예에 따른 전자 장치를 도시한다. 도 4를 참조하면, 커버 디바이스의 제 2 커버부는 연결부를 휘어 회동되고, 제 1 커버부와 맞닿을 수 있다. 커버 디바이스의 연결부는 적어도 하나의 변형부로 인하여 용이하게 휘어질 수 있다. 도 5는 본 발명의 일 실시예에 따른 커버 디바이스의 연결부를 도시한다. 도 5를 참조하면, 커버 디바이스의 연결부는 내부의 일부는 빈 공간을 가지고 있고, 이는 적어 도 하나의 변형부가 될 수 있다. 한 실시예에 따르면, 커버 디바이스의 연결부는 사출을 이용하 여 적어도 하나의 변형부를 가질 수 있다. 다른 실시예에 따르면, 커버 디바이스의 연결부는 도 시하지 않은 다수의 시트들(sheets) 또는 레이어들(layers)을 포함할 수 있다. 여기서, 다수의 레이어들은 서로 다른 두께를 가지거나, 또는 서로 같은 두께를 가질 수 있다. 또는, 다수의 레이어들은 서로 다른 재질을 포함 할 수 있다. 또는, 다수의 레이어들은 서로 다른 물성(예: 탄성)을 포함할 수 있다. 연결부의 내부 빈 공 간은 다수의 레이어들 중 하나의 레이어에서 생략된 부분일 수 있다. 또는, 연결부의 내부 빈 공간은 다수의 레이어들에서 적어도 둘 이상의 레이어들에서 생략된 부분들의 조합일 수도 있다. 도 6은 본 발명의 일 실시예에 따른 커버 디바이스의 연결부를 도시한다. 도 6을 참조하면, 커버 디바이스의 연결부는 표면(120S1)에 배치되는 홈을 포함하고, 이는 적어 도 하나의 변형부가 될 수 있다. 홈은 도시하지 않았지만 양쪽 면들에 모두 배치될 수도 있다. 한 실 시예에 따르면, 적어도 하나의 변형부는 부재의 일면을 절삭하여 홈을 형성하는 방식으로 마련될 수 있다. 또는, 적어도 하나의 변형부는 불박(heat printing)을 이용하여 부재(예: 가죽)의 일면(120S1)에 오목 형 상(홈)을 형성하는 방식으로 마련될 수 있다. 여기서, 불박은 모양을 새긴 금속에 열을 가하고, 금속을 가 죽, 나무 등의 부재의 일면에 가압하는 방식으로 부재의 일면에 모양을 새기는 공법을 가리킨다. 도 7은 본 발명의 다양한 실시예에 따른 커버 디바이스를 도시한다. 도 7을 참조하면, 커버 디바이스는 제 1 시트, 제 2 시트 및 제 3 시트를 포함할 수 있다. 제 1 시트는 사용자 기기가 설치되는 면(710S1)을 포함할 수 있다. 제 1 시트는 가요성 또는 탄 성을 가질 수 있다. 또는, 제 1 시트는 일정한 두께를 가질 수 있다. 제 2 시트는 제 3 시트를 매개로 제 1 시트에 겹치게 결합될 수 있다. 제 2 시트는 가요성 또는 탄성을 가질 수 있다. 또는, 제 2 시트는 일정한 두께를 가질 수 있다. 또는, 제 2 시트는 제 1 시트와 서로 다른 두께 또는 서로 같은 두께를 가질 수 있다. 한 실시예에 따르면, 제 1 시트 및 제 2 시트는 가죽 시트를 포함할 수 있다. 제 1 시트와 제 3 세트 사이에 열가소성수지(예: 핫 멜트(hot melt)를 배치하고 열 융착하는 방식을 이용하여, 제 1 시트 와 제 2 시트를 연결하는 제 3 시트가 형성될 수 있다. 여기서, 제 3 시트는 제 1 커버부 , 연결부 및 제 2 커버부에 강성(rigidity)을 제공할 수 있다. 또한, 연결부에 배치되는 제 3 시트의 일부는 서로 분리되어 있는 다수의 부분들(731, 732, 733)을 포함할 수 있다. 다수의 부분들(731, 732, 733)은 서로 다르거나 또는 서로 같은 너비를 가질 수 있다. 또는, 다수의 부분들(731, 732, 733) 사이의 간극은 서로 다르거나 또는 일정할 수 있다. 또는, 연결부에 배치되는 제 1 시트의 일부는 표면(710S1)에 배치되는 다수의 제 1 홈들(711, 712, 713, 714)(예: 도 1의 601)을 포함할 수 있다. 다수의 제 1 홈들(711, 712, 713, 714)의 너비는 서로 다르거나 또는 일정할 수 있다. 또는, 다수의 제 1 홈들(711, 712, 713, 714)의 깊이는 서로 다르거나 또는 일정할 수 있 다. 또는, 다수의 제 1 홈들(711, 712, 713, 714)는 서로 다르거나 또는 서로 유사한 단면 형상(예: 사각형, 원 형 등)을 포함할 수 있다. 또는, 다수의 제 1 홈들(711, 712, 713, 714) 사이의 간극은 서로 다르거나 또는 일 정할 수 있다. 한 실시예에 따르면, 다수의 제 1 홈들(711, 712, 713, 714) 각각은 제 3 시트의 서로 분리 되어 있는 다수의 부분들(731, 732, 733) 사이의 빈 공간들(1G, 2G, 3G, 4G)에 대응하는 위치에 배치될 수 있다. 또는, 연결부에 배치되는 제 2 시트의 일부는 표면(720S1)에 배치되는 다수의 제 2 홈들(721, 722, 723, 724)을 포함할 수 있다. 다수의 제 2 홈들(721, 722, 723, 724)의 형상은 서로 다르거나 또는 일정할 수 있다. 또는, 다수의 제 2 홈들(721, 722, 723, 724) 사이의 간극은 서로 다르거나 또는 일정할 수 있다. 한 실 시예에 따르면, 다수의 제 2 홈들(721, 722, 723, 724) 각각은 제 3 시트의 서로 분리되어 있는 다수의 부 분들(731, 732, 733) 사이에 대응하는 위치에 배치될 수 있다. 한 실시예에 따르면, 제 1 시트의 제 1 홈들(711, 712, 713, 714) 및/또는 제 2 시트의 제 2 홈들 (721, 722, 723, 724)은 불박을 이용하여 형성될 수 있다.연결부의 적어도 하나의 변형부는 제 3 시 트의 다수의 부분들(731, 732, 733) 사이의 간극, 제 1 시트의 제 1 홈들(711, 712, 713, 714), 또 는 제 2 시트의 제 2 홈들(721, 722, 723, 724)을 포함할 수 있다. 도 8은 본 발명의 일 실시예에 따른 커버 디바이스의 연결부를 도시한다. 도 8을 참조하면, 제 1 시트의 제 1 홈 및 제 2 시트의 제 2 홈은 제 3 시트의 두 부분들(731, 732) 사이의 빈 공간에 대응하는 위치에 배치될 수 있다. 커버 디바이스의 연결부에서 제 1 시트의 제 1 홈 및 제 2 시트의 제 2 홈이 배치되는 부분은 주변보다 얇은 두께를 가지고 있고, 따라서 휘어지기 쉬운 부분이 될 수 있다.또한, 커버 디바이스의 연결부에서 제 3 시트의 두 부분들(731, 732) 사이는 분리되어 있고, 따 라서 휘어지기 쉬운 부분이 될 수 있다. 예를 들자면, 커버 디바이스의 연결부가 휘어지는 경우, 제 1 시트의 제 1 홈과 제 2 시트 의 제 2 홈은 변형될 수 있다. 도 9는 본 발명의 다양한 실시예에 따른 제 1 핫 멜트 시트를 도시한다. 도 9를 참조하면, 제 1 핫 멜트 시트는 제 2 커버부(도 1의 130)에 배치될 수 있다. 제 1 핫 멜트 시트 는 제 2 커버부의 관통 홀에 대응하는 관통 홀을 포함할 수 있다. 또한, 제 1 핫 멜트 시 트는 제 2 커버부의 윈도우에 대응하는 관통 홀을 포함할 수 있다. 또한, 제 1 핫 멜트 시 트는 테두리 영역에 배치되는 다수의 관통 홀들을 포함할 수 있다. 다수의 관통 홀들은 제 1 핫 멜트 시트와 다른 부재들 사이의 열 접착 위치를 결정하는데 사용될 수 있다. 제 1 핫 멜트 시트는 다른 부재들과 열 접착되고, 완성된 열 접착 시트에서 파선 바깥쪽 영역은 제거될 수 있다. 도 10은 본 발명의 다양한 실시예에 따른 제 2 핫 멜트 시트를 도시한다. 도 10을 참조하면, 제 2 핫 멜트 시트는 제 1 커버부(도 1의 110), 연결부(도 1의 120) 및 제 2 커버부 (도 1의 130) 모두에 배치될 수 있다. 제 2 핫 멜트 시트는 제 2 커버부의 관통 홀에 대응하는 관통 홀을 포함할 수 있다. 또한, 제 2 핫 멜트 시트는 제 2 커버부의 윈도우에 대응하 는 관통 홀을 포함할 수 있다. 또한, 제 2 핫 멜트 시트는 연결부에 배치되는 서로 분리된 부 분들(예: 도 7의 제 3 시트 730의 다수의 부분들 731, 732, 733)을 포함할 수 있다. 제 2 핫 멜트 시트 는 서로 분리된 부분들 사이의 빈 공간(1000G)을 포함할 수 있다. 또한, 제 2 핫 멜트 시트 는 테두리 영역에 배치되는 다수의 관통 홀들을 포함할 수 있다. 다수의 관통 홀들은 제 2 핫 멜 트 시트와 다른 부재들(예: 제 1 핫 멜트 시트 900) 사이의 열 접착 위치를 결정하는데 사용될 수 있다. 제 2 핫 멜트 시트는 다른 부재들과 열 접착되고, 완성 열 접착 시트에서 파선 바깥쪽 영역은 제거될 수 있다. 도 11은 본 발명의 다양한 실시예에 따른 커버 디바이스의 제작 공정을 도시한다. 도 11의 (a) 및 (b)를 참조하면, 열 접착 시트는 제 1 가죽 시트과 제 2 가죽 시트 사이에 제 1 핫 멜트 시트 및 제 2 핫 멜트 시트을 배치하고 열 접착을 이용하여 제작될 수 있다. 여기서, 제 1 핫 멜트 시트는 제 1 가죽 시트와 제 2 핫 멜트 시트 사이에 배치될 수 있다. 또한, 제 2 핫 멜트 시트는 제 1 핫 멜트 시트와 제 2 가죽 시트 사이에 배치될 수 있다. 제 2 핫 멜트 시트의 일부는 제 1 커버부에 배치될 수 있다. 또한, 제 2 핫 멜트 시트의 일부 는 연결부에 배치될 수 있다. 또한, 제 2 핫 멜트 시트의 일부는 제 1 핫 멜트 시트와 함께 제 2 커버부에 배치될 수 있다. 여기서, 제 2 커버부는 제 2 핫 멜트 시트의 일부와 제 1 핫 멜트 시트를 포함하고 있어, 연결부에 비하여 높은 강성 또는 큰 하중을 가질 수 있다. 또는, 제 2 커버부 는 제 1 커버부 보다 두꺼울 수 있다. 연결부는 제 1 가죽 시트와 제 2 가죽 시트 사이에 배치되는 제 2 핫 멜트 시트의 서로 분리된 빈 공간(1000G)을 포함할 수 있다. 제 2 핫 멜트 시트의 서로 분리된 부분들 사이의 빈 공간 (1000G)은 구부리기 용이한 부분이 될 수 있다. 도 11의 (c)를 참조하면, 열 접착 시트에서 불필요한 부분이 제거될 수 있다. 또는, 불필요한 부분을 제거 한 열 접착 시트의 테두리는 바느질을 이용하여 박음질되고, 미려함을 살릴 수 있다. 도 11의 (d)를 참조하면, 연결부에 해당하는 제 1 가죽 시트의 일면(1110S1)은 불박을 이용하여 다 수의 제 1 홈들을 가질 수 있다. 또한, 연결부에 해당하는 제 2 가죽 시트의 일면(1120S1)은 불박을 이용하여 다수의 제 1 홈들을 가질 수 있다. 여기서, 제 1 홈들 및 제 2 홈들은 제 2 핫 멜트 시트의 서로 분리된 부분들 사이의 간극에 대응하게 배치될 수 있다. 연결부의 제 1 홈들 및 제 2 홈들은 구부리기 용이한 부분이 될 수 있다. 본 발명의 일 실시예에 따르면, 커버 디바이스는, 전자 장치(예: 사용자 기기 300)의 화면의 적어도 일부를 덮을 수 있는 커버부(예: 제 2 커버부 130)와, 전자 장치를 커버 디바이스에 장착하기 위한 접합부(예: 제 1 커버부 110) 및 커버부와 접합부 사이를 연결하고 휘어질 수 있는 연결부를 포함할 수 있다. 여기서, 연결부는 내부에 배치되는 빈 공간(1G, 2G, 3G, 4G)을 포함할 수 있다. 본 발명의 일 실시예에 따르면, 빈 공간(1G, 2G, 3G, 4G)은 다수 개 형성되고, 다수 개의 빈 공간들(1G, 2G, 3G, 4G) 사이의 간극은 일정하거나 또는 일정하지 않을 수 있다. 본 발명의 일 실시예에 따르면, 빈 공간(1G, 2G, 3G, 4G)은 다수 개 형성되고, 다수 개의 빈 공간들(1G, 2G, 3G, 4G)은 서로 같은 형상 또는 서로 다른 형상을 포함할 수 있다. 본 발명의 일 실시예에 따르면, 연결부는 표면 상에 배치되는 홈(711, 712, 713, 714, 721, 722, 723, 724)을 더 포함할 수 있다. 여기서, 홈(711,712, 713, 714, 721, 722, 723, 724)은 빈 공간(1G, 2G, 3G, 4G)에 대응하는 위치에 배치될 수 있다. 본 발명의 일 실시예에 따르면, 홈(711, 712, 713, 714, 721, 722, 723, 724)은 연결부의 양쪽 면에 각각 배치 되고, 빈 공간(1G, 2G, 3G, 4G)은 두 홈들 사이에 배치될 수 있다. 본 발명의 일 실시예에 따르면, 커버 디바이스는 제 1 시트와 제 2 시트 사이에 제 3 시트(73 0)를 부착하는 방식으로 성형될 수 있다. 본 발명의 일 실시예에 따르면, 빈 공간(1G, 2G, 3G, 4G)은 제 3 시트에 형성될 수 있다. 본 발명의 일 실시예에 따르면, 제 1 시트 또는 제 2 시트는 가죽 시트(예: 제 1 가죽 시트 1110, 제 2 가죽 시트 1120)를 포함할 수 있다. 본 발명의 일 실시예에 따르면, 제 3 시트는 열가소성수지를 포함할 수 있다. 본 발명의 일 실시예에 따르면, 커버부(예: 제 2 커버부 120)는 제 1 시트와 제 2 시트 사이에 부착 되는 열가소성 제 4 시트(예: 제 1 핫 멜트 시트 900)를 더 포함할 수 있다. 본 발명의 일 실시예에 따르면, 커버부(예: 제 2 커버부 120)는 투명 창을 포함할 수 있다. 본 발명의 일 실시예에 따르면, 접합부(예: 제 1 커버부 110)는 전자 장치의 외관을 형성하는 탈착 가능한 기기 케이스를 포함할 수 있다. 여기서, 탈착 가능한 기기 케이스는 배터리 커버를 포함할 수 있다. 본 발명의 다른 실시예에 따르면, 커버 디바이스는, 다층 시트를 포함할 수 있다. 여기서, 다층 시트의 제 1 부분은 전자 장치(예: 사용자 기기 300)의 화면의 적어도 일부를 덮을 수 있는 커버부(예: 제 2 커버부 130)를 포함할 수 있다. 또한, 다층 시트의 제 2 부분은 전자 장치가 장착되는 접합부(예: 제 1 커버부 110)를 포함할 수 있다. 또한, 다층 시트의 제 3 부분은 커버부와 접합부 사이를 연결하고 휘어질 수 있는 연결부를 포함할 수 있다. 여기서, 연결부는 내부에 배치되는 적어도 하나의 빈 공간(1G, 2G, 3G, 4G)을 포함할 수 있다. 본 발명의 다른 실시예에 따르면, 연결부는 표면 상에 배치되는 홈(711, 712, 713, 714, 721, 722, 723, 724)을 더 포함할 수 있다. 여기서, 홈(711,712, 713, 714, 721, 722, 723, 724)은 빈 공간(1G, 2G, 3G, 4G)에 대응하는 위치에 배치될 수 있다. 본 발명의 다른 실시예에 따르면, 적어도 하나의 홈(711, 712, 713, 714, 721, 722, 723, 724)은 불박을 이용 하여 형성될 수 있다. 본 발명의 다른 실시예에 따르면, 다층 시트는, 제 1 가죽 시트와, 제 2 가죽 시트 및 제 1 가죽 시트와 제 2 가죽 시트 사이에 부착되는 제 1 열가소성 시트(예: 제 2 핫 멜트 시트 1000)를 포함 할 수 있다. 본 발명의 다른 실시예에 따르면, 커버부(예: 제 2 커버부 130)는 투명 창을 포함할 수 있다. 본 발명의 다른 실시예에 따르면, 커버부는 전자 장치의 홀 센서가 반응 가능한 자석을 포 함할 수 있다. 본 발명의 다른 실시예에 따르면, 접합부에 부착되고, 전자 장치의 외관을 형성하는 탈착 가능한 배 터리 커버를 더 포함할 수 있다. 본 발명의 다른 실시예에 따르면, 커버 디바이스는, 사용자 기기의 제 1 면(예: 하면 300S2)을 커버 할 수 있는 제 1 커버부와, 사용자 기기의 제 2 면(예: 상면 300S1)을 커버할 수 있는 제 2 커버부 및 제 1 커버부와 제 2 커버부 사이를 연결하는 연결부를 포함할 수 있다. 여기서, 제 2커버부는 연결부의 구부림을 이용하는 회전 방식으로 개폐 가능할 수 있다. 또한, 연결부는 적 어도 하나의 구부림 위치에 배치되는 내부 빈 공간(1G, 2G, 3G, 4G)을 포함할 수 있다. 본 발명의 다른 실시예에 따르면, 연결부는 적어도 하나의 구부림 위치에 배치되는 표면 상의 홈(711, 712, 713, 714, 721, 722, 723, 724)을 더 포함할 수 있다. 본 발명의 다른 실시예에 따르면, 연결부는 포개어진 다수의 시트들(710, 720, 730)을 포함하고, 적어도 하나의 구부림 위치에 배치되는 내부 빈 공간은 다수의 시트들 중 적어도 하나의 시트에 배치될 수 있다. 본 발명의 다른 실시예에 따르면, 제 2 커버부는 제 1 커버부와 다른 두께를 가질 수 있다. 본 발명의 다른 실시예에 따르면, 제 2 커버부는 제 1 커버부와 다른 무게를 가질 수 있다. 본 발명의 다른 실시예에 따르면, 사용자 기기의 제 2 면(300S2)은 화면을 포함할 수 있다. 본 발명의 다른 실시예에 따르면, 제 2 커버부는 투명 창을 포함할 수 있다. 본 발명의 다른 실시예에 따르면, 제 1 커버부는 사용자 기기의 외관을 형성하는 탈착 가능한 기기 케이스(예: 배터리 커버)를 포함할 수 있다. 한편 본 발명의 상세한 설명에서는 구체적인 실시 예에 관해 설명하였으나, 본 발명의 범위에서 벗어나지 않는 한도 내에서 여러 가지 변형이 가능하다. 그러므로 본 발명의 범위는 설명된 실시 예에 국한되어 정해져서는 아 니 되며 후술하는 특허청구의 범위뿐만 아니라 이 특허청구의 범위와 균등한 것들에 의해 정해져야 한다."}
{"patent_id": "10-2014-0103999", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1 내지 2는 본 발명의 다양한 실시예에 따른 전자 장치를 도시한다. 도 3은 본 발명의 다양한 실시예에 따른 전자 장치를 도시한다. 도 4는 본 발명의 다양한 실시예에 따른 전자 장치를 도시한다. 도 5는 본 발명의 일 실시예에 따른 커버 디바이스의 연결부를 도시한다. 도 6은 본 발명의 일 실시예에 따른 커버 디바이스의 연결부를 도시한다. 도 7은 본 발명의 다양한 실시예에 따른 커버 디바이스를 도시한다. 도 8은 본 발명의 일 실시예에 따른 커버 디바이스의 연결부를 도시한다. 도 9는 본 발명의 다양한 실시예에 따른 제 1 핫 멜트 시트를 도시한다. 도 10은 본 발명의 다양한 실시예에 따른 제 2 핫 멜트 시트를 도시한다. 도 11은 본 발명의 다양한 실시예에 따른 커버 디바이스의 제작 공정을 도시한다."}
