{"patent_id": "10-2017-0166144", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0066433", "출원번호": "10-2017-0166144", "발명의 명칭": "마이크로 홀이 형성된 차광 부재를 포함하는 전자 장치", "출원인": "삼성전자주식회사", "발명자": "강승구"}}
{"patent_id": "10-2017-0166144", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,투명 부재;상기 투명 부재의 아래(under)에 배치되고, 복수의 픽셀들을 포함하는 디스플레이 패널;상기 디스플레이 패널 아래에 배치되고, 상기 복수의 픽셀들 중 적어도 일부 픽셀에서 출력된 광 중 상기 투명부재의 적어도 일부 영역에 접촉된 외부 객체에 의해 반사된 반사광의 적어도 일부를 획득할 수 있는 생체센서; 및상기 디스플레이 패널 및 상기 생체 센서 사이에 배치되고, 복수의 마이크로 홀들이 적어도 일부 영역에 형성된차광 부재를 포함하고, 상기 마이크로 홀들이 형성된 상기 적어도 일부 영역은 상기 반사광의 상기 적어도 일부가 투과되도록 상기 생체 센서에 대면하여 형성된 전자 장치."}
{"patent_id": "10-2017-0166144", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "전자 장치에 있어서,제 1 방향으로 향하는 제 1 면 및 상기 제 1 방향의 반대인 제 2 방향으로 향하는 제 2 면을 포함하는 하우징으로서, 상기 하우징은 상기 제 1 면의 적어도 일부를 형성하는 투명 부재를 포함하는 하우징; 상기 하우징의 상기 제 1면 및 상기 제 2 면 사이에 배치되고, 상기 투명 부재를 통하여 외부로 정보를 표시하기 위한 디스플레이 장치;상기 디스플레이 장치 일면에 대면 배치되고, 상기 디스플레이 장치로부터 상기 제 2 방향으로 향하는 광을 차폐하는 차광 부재; 및상기 하우징의 상기 제 1 면 및 제 2 면 사이에 배치되고, 상기 투명 부재에 접촉하는 사용자의 지문을 센싱하는 생체 센서 모듈을 포함하고, 상기 생체 센서 모듈은, 상기 투명 부재를 향해 광을 방출하는 복수 개의 발광 소자들;상기 차광 부재의 일면과 대면 배치되며, 외부 객체에 의해 반사된 광을 센싱하는 이미지 센서; 및 상기 차광 부재 내부 또는 인접 영역에 형성되고, 상기 이미지 센서를 향하는 상기 반사광의 경로를 제공하는핀 홀 구조를 포함하는 전자 장치."}
{"patent_id": "10-2017-0166144", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서, 상기 생체 센서 모듈은 상기 디스플레이 장치에 의해 방출되는 광을 이용하여 사용자의 지문을 센싱하는 것을특징으로 하는 전자 장치."}
{"patent_id": "10-2017-0166144", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서, 공개특허 10-2019-0066433-3-상기 핀 홀 구조는,상기 이미지 센서와 대면되는 영역에 소정의 간격을 가지고 배열된 복수 개의 핀 홀들 및;상기 핀홀 들 사이에 각각 배치되고, 상기 반사 광의 간섭을 차단하는 복수 개의 격벽들을 포함하는 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2017-0166144", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4 항에 있어서,상기 이미지 센서는 소정 간극으로 배열된 복수 개의 수광 픽셀들을 포함하고, 상기 핀 홀 구조의 복수 개의 핀 홀들의 배열은 상기 복수 개의 수광 픽셀들의 배열에 대응되도록 배치된 것을특징으로 하는 전자 장치."}
{"patent_id": "10-2017-0166144", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 2항에 있어서,상기 투명 부재 위에서 볼 때, 상기 이미지 센서의 실질적으로 전체 면적이, 상기 디스플레이 장치와 중첩하는것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2017-0166144", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 4 항에 있어서,상기 복수 개의 발광 소자들에서 방출된 광은 상기 투명 부재를 통과하여 상기 제 1 방향을 향하는 제 1 경로를형성하고,상기 핀 홀 구조의 복수 개의 핀 홀들은 상기 사용자의 지문에 반사된 광이 상기 투명 부재를 통과하여 상기 이미지 센서를 향하도록 안내하는 제 2 경로를 형성하는 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2017-0166144", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서,상기 이미지 센서는 상기 제 2 경로를 통과한 광을 전달 받아, 상기 투명 부재에 접촉하는 사용자의 생체 정보를 감지하도록 구성된 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2017-0166144", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 5 항에 있어서, 상기 핀 홀 구조의 상기 복수 개의 격벽들은 상기 차광 부재와 동일한 두께를 가지고 동일 재질로 구성된 것을특징으로 하는 전자 장치."}
{"patent_id": "10-2017-0166144", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 5 항에 있어서, 공개특허 10-2019-0066433-4-상기 디스플레이 장치는 유기발광다이오드(OLEDs)를 포함하는 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2017-0166144", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 5 항에 있어서,상기 적어도 하나의 이미지 센서 또는 상기 전자 장치의 통신 모듈을 이용하여 사용자의 생체 정보를 획득하고,상기 전자 장치가 지원하는 복수의 서비스들 중에서 상기 생체 정보와 연관된 적어도 하나의 서비스를결정하고, 상기 결정된 적어도 하나의 서비스를 제공하도록 구성된 프로세서를 더 포함하는 것을 특징으로 하는전자 장치."}
{"patent_id": "10-2017-0166144", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 2 항에 있어서,상기 핀 홀 구조는, 상기 이미지 센서와 대면되는 영역에 소정의 간격을 가지고 배열된 복수 개의 핀 홀들 및상기 핀홀 들 사이에 각각 배치되고, 상기 반사 광의 간섭을 차단하는 복수 개의 격벽들을 포함하고,상기 이미지 센서는 소정 간극으로 배열된 복수 개의 수광 픽셀들을 포함하며,상기 복수 개의 핀 홀들의 각각의 중심은 상기 복수 개의 수광 픽셀들 각각의 중심과 동일 선상에 배치된 것을특징으로 하는 전자 장치."}
{"patent_id": "10-2017-0166144", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 2 항에 있어서,상기 핀 홀 구조는, 상기 이미지 센서와 대면되는 영역에 소정의 간격을 가지고 배열된 복수 개의 핀 홀들 및상기 핀홀 들 사이에 각각 배치되고, 상기 반사 광의 간섭을 차단하는 복수 개의 격벽들을 포함하고,상기 이미지 센서는 소정 간극으로 배열된 복수 개의 수광 픽셀들을 포함하며,상기 복수 개의 핀 홀들 각각은 상기 복수 개의 수광 픽셀들과 서로 1 : n(n>1, n은 정수)의 배열 관계를 가지는 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2017-0166144", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 3 항에 있어서, 상기 디스플레이 장치 및 상기 차광 부재 사이에 배치된 필름층을 더 포함하고,상기 핀 홀 구조는 상기 필름층과 동일층에 형성되고, 상기 이미지 센서와 대면되는 영역에 소정의 간격을 가지고 배열된 복수 개의 핀 홀들 및; 상기 핀홀 들 사이에 각각 배치되고, 상기 반사 광의 간섭을 차단하는 복수개의 격벽들을 포함하는 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2017-0166144", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 14 항에 있어서, 상기 차광 부재는 상기 핀 홀 구조와 대응되는 영역에 개구를 포함하고, 상기 개구의 적어도 일부에 상기 이미지 센서가 배치된 것을 특징으로 하는 전자 장치.공개특허 10-2019-0066433-5-청구항 16 생체 센서 모듈에 있어서,외부를 향해 광을 방출하는 복수 개의 발광 소자들;상기 복수 개의 발광 소자들의 배열의 적어도 일부와 대면 배치되고, 상기 방출된 광이 사용자의 신체에 반사된후, 상기 반사광을 센싱하는 이미지 센서; 및상기 복수의 발광 소자들 및 이미지 센서 사이에 배치되고, 상기 이미지 센서를 향하는 상기 반사광의 경로를가이드하는 핀 홀 구조를 포함하고, 상기 핀 홀 구조는,상기 이미지 센서와 대면되는 영역에 소정의 간격을 가지고 배열된 복수 개의 핀 홀들 및;상기 핀홀 들 사이에 각각 배치되고, 상기 반사 광의 간섭을 차단하는 복수 개의 격벽들을 포함하는 것을 특징으로 하는 생체 센서 모듈."}
{"patent_id": "10-2017-0166144", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 16 항에 있어서,상기 생체 센서 모듈은 디스플레이 장치를 포함하는 전자 장치 내부에 배치되고,상기 생체 센서 모듈의 발광 소자들은 상기 디스플레이 장치의 발광 소자들의 적어도 일부인 것을 특징으로 하는 생체 센서 모듈."}
{"patent_id": "10-2017-0166144", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 17 항에 있어서, 상기 이미지 센서는 소정 간극으로 배열된 복수 개의 수광 픽셀들을 포함하고, 상기 핀 홀 구조의 복수 개의 핀 홀들의 배열은 상기 복수 개의 수광 픽셀들의 배열에 대응되도록 배치된 것을특징으로 하는 생체 센서 모듈."}
{"patent_id": "10-2017-0166144", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 17 항에 있어서, 상기 복수 개의 핀 홀들은 적어도 하나의 수광 픽셀들과 대면 배치되는 것을 특징으로 생체 센서 모듈."}
{"patent_id": "10-2017-0166144", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 17 항에 있어서, 상기 디스플레이 장치 하부에는 일부 방향을 향하는 광을 차폐하는 차광 부재가 배치되고, 상기 핀 홀 구조의 복수 개의 격벽들은 상기 차광 부재와 동일한 두께를 가지고 동일 재질로 구성된 것을 특징으로 하는 생체 센서 모듈."}
{"patent_id": "10-2017-0166144", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 다양한 실시예에 따르면 전자 장치는, 투명 부재; 상기 투명 부재의 아래(under)에 배치되고, 복수의 픽셀들을 포함하는 디스플레이 패널; 상기 디스플 레이 패널 아래에 배치되고, 상기 복수의 픽셀들 중 적어도 일부 픽셀에서 출력된 광 중 상기 투명 부재의 적어 도 일부 영역에 접촉된 외부 객체에 의해 반사된 반사광의 적어도 일부를 획득할 수 있는 생체 센서; 및 상기 디 스플레이 패널 및 상기 생체 센서 사이에 배치되고, 복수의 마이크로 홀들이 적어도 일부 영역에 형성된 차광 부 재를 포함하고, 상기 마이크로 홀들이 형성된 상기 적어도 일부 영역은 상기 반사광의 상기 적어도 일부가 투과 되도록 상기 생체 센서에 대면하여 형성될 수 있다."}
{"patent_id": "10-2017-0166144", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시 예는, 생체 센서 모듈 및, 디스플레이 패널과 생체 센서 모듈 사이에 배치된 마이크로 홀이 형성된 차광 부재를 포함하는 전자 장치에 관한 것이다."}
{"patent_id": "10-2017-0166144", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전자 장치라 함은, 가전제품으로부터, 전자 수첩, 휴대용 멀티미디어 재생기, 이동통신 단말기, 태블릿 PC, 영 상/음향 장치, 데스크톱/랩톱 컴퓨터, 차량용 내비게이션 등, 탑재된 프로그램에 따라 특정 기능을 수행하는 장 치를 의미할 수 있다. 예를 들면, 이러한 전자 장치들은 저장된 정보를 음향이나 영상으로 출력할 수 있다. 전 자 장치의 집적도가 높아지고, 초고속, 대용량 무선통신이 보편화되면서, 최근에는, 이동통신 단말기와 같은 하 나의 전자 장치에 다양한 기능이 탑재될 수 있다. 예를 들면, 통신 기능뿐만 아니라, 게임과 같은 엔터테인먼트 기능, 음악/동영상 재생과 같은 멀티미디어 기능, 모바일 뱅킹 등을 위한 통신 및 보안 기능, 일정 관리나 전자 지갑 등의 기능이 하나의 전자 장치에 집약되고 있다. 통상적으로, 디스플레이 장치는 이미지나 영상 정보를 출력하는 장치로서, 정보 통신 기능이 탑재된 전자 장치 의 대부분에는 디스플레이 장치가 설치될 수 있다. 전기, 전자 기술의 발달에 힘입어 디스플레이 장치의 성능 또한 비약적으로 발전하여 그 화질이 현저히 개선되었고, 터치 패널 등이 통합되어 디스플레이 장치는 출력 장 치로서뿐만 아니라, 입력 장치로도 유용하게 활용되고 있다. 디스플레이 장치를 포함하는 전자 장치는, 터치 패널에 대한 입력에 기반하여, 입력의 수평적 요소(예: 위치, 움직임)를 산출하는 것 이외에도, 사용자의 신체 일부로부터 획득한 정보를 이용하여, 사용자를 인식하고 확인 할 수 있다. 특히, 사용자 인식을 위하여 지문, 음성, 얼굴, 손 또는 홍채와 같은 개인의 고유한 특징을 이용한 개인 인증 방법이 널리 사용되고 있다. 최근에는 휴대용 장치와 같은 전자 장치를 통해, 전화, 문자 메시지 전 송 서비스와 같은 통신 기능뿐 아니라, 금융, 보안 등 개인 정보가 활용되는 다양한 부가 기능이 제공되고 있으 며, 상기 전자 장치의 잠금 장치에 대한 필요성이 더욱 중요하게 부각되고 있다. 이러한 잠금 효과를 향상시키 기 위하여, 사용자의 생체 정보 인식을 통한 잠금 장치가 장착된 전자 장치가 본격적으로 개발되고 있다."}
{"patent_id": "10-2017-0166144", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "전자 장치는 다양한 방식의 터치 입력에 기반하여 상기 전자 장치의 일면에 입력된 터치 입력의 수평, 수직적 위치를 산출할 수 있다. 또한, 사용자를 인식할 수 있는 지문 인식 센서가 장착되어 있다. 상기 지문 인식 센서는 디스플레이 장치와 별개의 하드웨어 구조를 가지기 때문에 별도의 공간을 필요로 하고, 모바일 장치가 점점 소형화되고 슬림화 되면서 지문 인식 센서의 위치 및 공간의 제약이 생기게 되었다. 또한, 지문 인식과 같은 생체 정보를 감지하기 위해서, 사용자는 상기 센서와 근접하게 위치하여야 하고, 이로 인해 상기 지문 인식 센서가 전자 장치의 외부로 드러나 외관을 손상시킬 수 있었다. 본 발명의 다양한 실시예에 따르면, 전자 장치는 디스플레이 장치 및 투명 부재의 활성화 영역(active area) 내 에 위치한 생체 센서 모듈(예: 광학 지문 센서)을 이용하여 전자 장치의 실장 공간의 제약을 해결할 수 있다. 본 발명의 다양한 실시예에 따르면, 전자 장치는 생체 센서 모듈(예: 광학 지문 센서)을 이용하여 사용자의 지 문 정보를 감지함에 있어, 발광 소자로서 디스플레이 장치 내부에 배치된 발광 소자를 활용하고, 이미지 센서를 수광 소자로 활용하여 실장 공간 및 비용을 절약하고 감지 성능을 확보할 수 있다. 본 발명의 다양한 실시예에 따르면, 전자 장치의 생체 센서 모듈(예: 광학 지문 센서)은 전자 장치 내부에 핀 홀 구조(예: 마이크로 홀들)를 배치하여, 외관 시인성이 개성되고, 사용자의 지문을 인식하는 센싱 거리를 줄임 에 따라 센싱 성능을 확보할 수 있다."}
{"patent_id": "10-2017-0166144", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 다양한 실시예에 따르면 전자 장치는, 투명 부재; 상기 투명 부재의 아래(under)에 배치되고, 복수의 픽셀들을 포함하는 디스플레이 패널; 상기 디스 플레이 패널 아래에 배치되고, 상기 복수의 픽셀들 중 적어도 일부 픽셀에서 출력된 광 중 상기 투명 부재의 적 어도 일부 영역에 접촉된 외부 객체에 의해 반사된 반사광의 적어도 일부를 획득할 수 있는 생체 센서; 및 상기 디스플레이 패널 및 상기 생체 센서 사이에 배치되고, 복수의 마이크로 홀들이 적어도 일부 영역에 형성된 차광 부재를 포함하고, 상기 마이크로 홀들이 형성된 상기 적어도 일부 영역은 상기 반사광의 상기 적어도 일부가 투 과되도록 상기 생체 센서에 대면하여 형성될 수 있다. 본 발명의 다양한 실시예에 따르면 전자 장치는, 제 1 방향으로 향하는 제 1 면 및 상기 제 1 방향의 반대인 제 2 방향으로 향하는 제 2 면을 포함하는 하우징으 로서, 상기 하우징은 상기 제 1 면의 적어도 일부를 형성하는 투명 부재를 포함하는 하우징; 상기 하우징의 상 기 제 1면 및 상기 제 2 면 사이에 배치되고, 상기 투명 부재를 통하여 외부로 정보를 표시하기 위한 디스플레 이 장치; 상기 디스플레이 장치 일면에 대면 배치되고, 상기 디스플레이 장치의 제 2 방향으로 향하는 광을 차 폐하는 차광 부재; 및 상기 하우징의 상기 제 1 면 및 제 2 면 사이에 배치되고, 상기 투명 부재에 접촉하는 사 용자의 지문을 센싱하는 생체 센서 모듈을 포함할 수 있다. 상기 생체 센서 모듈은, 상기 투명 부재를 향해 광 을 방출하는 복수 개의 발광 소자들; 상기 차광 부재의 일면과 대면 배치되며, 외부 객체에 의해 반사된 광을 센싱하는 이미지 센서; 및 상기 차광 부재 내부 또는 인접 영역에 형성되고, 상기 이미지 센서를 향하는 상기 반사광의 경로를 제공하는 핀 홀 구조를 포함할 수 있다. 본 발명의 다양한 실시예에 따른 생체 센서 모듈에 있어서, 외부를 향해 광을 방출하는 복수 개의 발광 소자들; 상기 복수 개의 발광 소자들의 배열의 적어도 일부와 대면 배치되고, 상기 방출된 광이 사용자의 신체에 반사된 후, 상기 반사광을 센싱하는 이미지 센서; 및 상기 디스플 레이 장치 및 이미지 센서 사이에 배치되고, 상기 이미지 센서를 향하는 상기 반사광의 경로를 가이드하는 핀 홀 구조를 포함할 수 있다. 상기 핀 홀 구조는, 상기 이미지 센서와 대면되는 영역에 소정의 간격을 가지고 배 열된 복수 개의 핀 홀들; 및 상기 핀홀 들 사이에 각각 배치되고, 상기 반사 광의 간섭을 차단하는 복수 개의 격벽들을 포함할 수 있다."}
{"patent_id": "10-2017-0166144", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 다양한 실시 예에 따르면, 전자 장치는 디스플레이 장치 및 투명 부재의 활성화 영역(active area) 내에 위치한 생체 센서 모듈(예: 광학 지문 센서)을 이용하여 전자 장치의 실장 공간을 절약할 수 있다. 본 발명의 다양한 실시 예에 따르면, 생체 센서 모듈(예: 광학 지문 센서)을 이용하여 사용자의 지문 정보를 감 지함에 있어, 발광 소자로서 디스플레이 장치 내부에 배치된 발광 소자를 활용하고, 이미지 센서를 수광 소자로 활용하여 실장 공간 및 비용을 절약하고 감지 성능을 확보할 수 있다. 본 발명의 다양한 실시 예에 따르면, 전자 장치의 생체 센서 모듈(예: 광학 지문 센서)은 전자 장치 내부에 핀 홀 구조를 배치하여, 외관 시인성이 개성되고, 사용자의 지문을 인식하는 센싱 거리를 줄임에 따라 센싱 성능을 확보할 수 있다."}
{"patent_id": "10-2017-0166144", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 문서에 개시된 다양한 실시예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 컴퓨터 장치, 휴대용 통신 장치 (예: 스마트폰), 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치 중 적어도 하나를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되지 않는다. 본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술을 특정한 실시 형태에 대해 한정하 려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 및/또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 단수의 표현은 문맥 상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및/또는 B 중 적어도 하나\", \"A, B 또는 C\" 또는 \"A, B 및/또는 C 중 적어도 하나\" 등의 표현은 함께 나열된 항목들의 모 든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", \"첫째\" 또는 \"둘째\" 등의 표현들은 해당 구성요소들을, 순 서 또는 중요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구 성요소들을 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에 \"(기능적으로 또는 통신적 으로) 연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 상기 어떤 구성요소가 상기 다른 구성요소에 직접 적으로 연결되거나, 다른 구성요소(예: 제 3 구성요소)를 통하여 연결될 수 있다. 본 문서에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구성된 유닛을 포함하며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로 등의 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는 최소 단위 또는 그 일부가 될 수 있다. 예를 들면, 모듈은 ASIC(application-specific integrated circuit)으로 구성될 수 있다. 본 문서의 다양한 실시예들은 기기(machine)(예: 컴퓨터)로 읽을 수 있는 저장 매체(machine-readable storage media)(예: 내장 메모리 또는 외장 메모리)에 저장된 명령어를 포함하는 소프트웨어(예: 프로그램 )로 구현될 수 있다. 기기는, 저장 매체로부터 저장된 명령어를 호출하고, 호출된 명령어에 따라 동작이 가능한 장치로서, 개시된 실시예들에 따른 전자 장치(예: 전자 장치)를 포함할 수 있다. 상기 명령이 프로 세서(예: 프로세서)에 의해 실행될 경우, 프로세서가 직접, 또는 상기 프로세서의 제어하에 다른 구성요소 들을 이용하여 상기 명령에 해당하는 기능을 수행할 수 있다. 명령은 컴파일러 또는 인터프리터에 의해 생성 또 는 실행되는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장매체는, 비일시적(non-transitory) 저장매체의 형태로 제공될 수 있다. 여기서, '비일시적'은 저장매체가 신호(signal)를 포함하지 않으며 실재(tangible)한다 는 것을 의미할 뿐 데이터가 저장매체에 반영구적 또는 임시적으로 저장됨을 구분하지 않는다. 일시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD-ROM))의 형태로, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 온라인으로 배포될 수 있다. 온라인 배포의 경 우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의메모리와 같은 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시예들에 따른 구성 요소(예: 모듈 또는 프로그램) 각각은 단수 또는 복수의 개체로 구성될 수 있으며, 전술한 해당 서브 구성 요소들 중 일부 서브 구성 요소가 생략되거나, 또는 다른 서브 구성 요소가 다 양한 실시예에 더 포함될 수 있다. 대체적으로 또는 추가적으로, 일부 구성 요소들(예: 모듈 또는 프로그램)은 하나의 개체로 통합되어, 통합되기 이전의 각각의 해당 구성 요소에 의해 수행되는 기능을 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따르면, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작들은 순 차적, 병렬적, 반복적 또는 휴리스틱하게 실행되거나, 적어도 일부 동작이 다른 순서로 실행되거나, 생략되거나, 또는 다른 동작이 추가될 수 있다. 이하, 첨부 도면을 참조하여, 다양한 실시예에 따르면 전자 장 치가 설명된다. 본 문서에서, 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치 (예: 인공지능 전자 장치)를 지칭할 수 있다. 도 1은, 다양한 실시예들에 따르면, 네트워크 환경 내의 전자 장치의 블럭도이다. 도 1을 참조하면, 네트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신)를 통하여 전자 장치(10 2)와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신)를 통하여 전자 장치 또는 서버와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 서버를 통하여 전자 장치와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 프로세서, 메모리, 입력 장치, 음향 출력 장치, 표 시 장치, 오디오 모듈, 센서 모듈, 인터페이스, 햅틱 모듈, 카메라 조립체, 전 력 관리 모듈, 배터리, 통신 모듈, 가입자 식별 모듈, 및 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장치에는, 이 구성요소들 중 적어도 하나(예: 표시 장치 또는 카메라 조립체)가 생략되거나 다른 구성 요소가 추가될 수 있다. 어떤 실시예에서는, 예를 들면, 표시 장치 (예: 디스플레이)에 임베디드된 센서 모듈(예: 지문 센서, 홍채 센서, 또는 조도 센서)의 경우와 같이, 일 부의 구성요소들이 통합되어 구현될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 구동하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)을 제어할 수 있고, 다양한 데이 터 처리 및 연산을 수행할 수 있다. 프로세서는 다른 구성요소(예: 센서 모듈 또는 통신 모듈) 로부터 수신된 명령 또는 데이터를 휘발성 메모리에 로드하여 처리하고, 결과 데이터를 비휘발성 메모리 에 저장할 수 있다. 일실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또는 어 플리케이션 프로세서), 및 이와는 독립적으로 운영되고, 추가적으로 또는 대체적으로, 메인 프로세서보다 저전력을 사용하거나, 또는 지정된 기능에 특화된 보조 프로세서(예: 그래픽 처리 장치, 이미지 시그널 프 로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 여기서, 보조 프로세서는 메인 프로세서와 별개로 또는 임베디드되어 운영될 수 있다. 이런 경우, 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메 인 프로세서를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 수행) 상태에 있는 동안 메 인 프로세서와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 표시 장치, 센서 모듈, 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일실시예에 따 르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구성 요소(예: 카메라 조립체 또는 통신 모듈)의 일부 구성 요소로서 구현될 수 있다. 메모리 는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서모듈)에 의해 사용되는 다양한 데이터, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련된 명령에 대한 입력 데이터 또는 출 력 데이터를 저장할 수 있다. 메모리는, 휘발성 메모리 또는 비휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 저장되는 소프트웨어로서, 예를 들면, 운영 체제, 미들 웨어 또는 어 플리케이션을 포함할 수 있다. 입력 장치는, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신하기 위한 장치로서, 예를 들면, 마이크, 마우스, 또는 키보드를 포함할 수 있다. 음향 출력 장치는 음향 신호를 전자 장치의 외부로 출력하기 위한 장치로서, 예를 들면, 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용되는 스피커와 전화 수신 전용으로 사용되는 리시버를 포함할 수 있다. 일실시예에 따르면, 리시버는 스피커와 일체 또는 별도로 형성될 수 있다. 표시 장치는 전자 장치의 사용자에게 정보를 시각적으로 제공하기 위한 장치로서, 예를 들면, 디스플 레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로를 포함할 수 있다. 일실시예에 따르면, 표시 장치는 터치 회로(touch circuitry) 또는 터치에 대한 압력의 세기를 측정할 수 있는 압력 센서를 포함할 수 있다. 오디오 모듈은 소리와 전기 신호를 쌍방향으로 변환시킬 수 있다. 일실시예에 따르면, 오디오 모듈은, 입력 장치를 통해 소리를 획득하거나, 음향 출력 장치, 또는 전자 장치와 유선 또 는 무선으로 연결된 외부 전자 장치(예: 전자 장치(예: 스피커 또는 헤드폰))를 통해 소리를 출력할 수 있 다. 센서 모듈은 전자 장치의 내부의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센 서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 외부 전자 장치(예: 전자 장치)와 유선 또는 무선으로 연결할 수 있는 지정된 프로토콜 을 지원할 수 있다. 일실시예에 따르면, 인터페이스는 HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는 전자 장치와 외부 전자 장치(예: 전자 장치)를 물리적으로 연결시킬 수 있는 커넥 터, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또 는 전기 자극 장치를 포함할 수 있다. 카메라 조립체는 정지 영상 및 동영상을 촬영할 수 있다. 일실시예에 따르면, 카메라 조립체는 하나 이상의 렌즈, 이미지 센서, 이미지 시그널 프로세서, 또는 플래시를 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리하기 위한 모듈로서, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구성될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성 요소에 전력을 공급하기 위한 장치로서, 예를 들면, 재충 전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버)간의 유선 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되는, 유선 통신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일실시예에 따르면, 통신 모듈은 무선 통신 모듈 (예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함하고, 그 중 해당하는 통신 모듈을 이용하여 제 1 네트워크(예: 블루투스, WiFi direct 또는 IrDA(infrared data association) 같은 근거리 통신 네트워크) 또는 제 2 네트워크(예: 셀룰러 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부 전자 장치와 통신할 수 있다. 상술한 여러 종류의 통신 모듈은 하나의 칩으로 구현되거나 또는 각각 별도의 칩으로 구현될 수 있다. 일실시예에 따르면, 무선 통신 모듈은 가입자 식별 모듈에 저장된 사용자 정보를 이용하여 통신 네트 워크 내에서 전자 장치를 구별 및 인증할 수 있다. 안테나 모듈은 신호 또는 전력을 외부로 송신하거나 외부로부터 수신하기 위한 하나 이상의 안테나들을 포 함할 수 있다. 일시예에 따르면, 통신 모듈(예: 무선 통신 모듈)은 통신 방식에 적합한 안테나를 통 하여 신호를 외부 전자 장치로 송신하거나, 외부 전자 장치로부터 수신할 수 있다. 상기 구성요소들 중 일부 구성요소들은 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input/output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))를 통 해 서로 연결되어 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 전자 장치(102, 104) 각각은 전자 장치와 동일한 또는 다른 종류의 장치일 수 있다. 일실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부 는 다른 하나 또는 복수의 외부 전자 장치에서 실행될 수 있다. 일실시예에 따르면, 전자 장치가 어떤 기 능이나 서비스를 자동으로 또는 요청에 의하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체 적으로 실행시키는 대신에 또는 추가적으로, 그와 연관된 적어도 일부 기능을 외부 전자 장치에게 요청할 수 있 다. 상기 요청을 수신한 외부 전자 장치는 요청된 기능 또는 추가 기능을 실행하고, 그 결과를 전자 장치 로 전달할 수 있다. 전자 장치는 수신된 결과를 그대로 또는 추가적으로 처리하여 요청된 기능이나 서비스 를 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 또는 클라이언트-서버 컴퓨팅 기 술이 이용될 수 있다. 도 2는 본 발명의 다양한 실시예 중 하나에 따른, 전자 장치를 나타내는 사시도이다. 도 3은 본 발명의 다 양한 실시예 중 하나에 따른 전자 장치를 다른 방향에서 바라본 모습을 나타내는 사시도이다. 도 2 및 도 3에 나타난 전자 장치는 도 1의 전자 장치(예: 전자 장치)와 적어도 일부 또는 전부가 동 일한 전자 장치일 수 있다. 도 2 및 도 3에서, 3축 직교 좌표계의 'X'는 상기 전자 장치의 폭 방향, 'Y'는 상기 전자 장치의 길 이 방향, 'Z'는 상기 전자 장치의 두께 방향을 의미할 수 있다. 본 발명의 다양한 실시 예를 설명하기 위 해 기재된 \"제 1 방향(+Z)\"은 투명 부재의 일면으로부터 수직한 방향을 의미할 수 있고, \"제 2 방향(- Z)\"은 상기 \"제 1 방향(+Z)\"의 반대 방향을 의미할 수 있다. 다양한 실시예에 따르면, 상기 전자 장치는 하우징과, 디스플레이 장치를 포함할 수 있다. 상기 하우징은 제 1 방향(+Z)에 수직인 측면과 상기 제 1 방향(+Z)의 반대인 제 2 방향(-Z)으로 향하는 후면 을 포함할 수 있다. 상기 하우징은 제 1 방향(+Z)을 향하는 전면이 개방되어, 투명 부재가 상기 하우징의 개방된 전면을 폐쇄할 수 있다. 예를 들어, 상기 하우징의 제 1 방향(+Z)을 향하는 영역은 실질적으로 상기 투명 부재가 커버하고, 상기 하우징은 측면 및/또는 후면을 커버할 수 있다. 또 다 른 예로, 상기 하우징의 제 1 방향(+Z)을 향하는 일면은 상기 투명 부재의 가장자리 영역에 일부 형 성될 수 있다. 상기 전자 장치는, 예컨대, 상기 투명 부재의 일측 영역에 기계적으로 작동하는 버튼이나 터치 키 (11a, 11b, 11c)를 포함하는 키패드가 제공될 수 있다. 상기 터치 키(11a, 11b, 11c)는 사용자의 신체 접촉에 의해 입력 신호를 발생할 수 있다. 다양한 실시예에 따르면, 상기 키패드는 기계적인 버튼들만으로, 또는, 상기 터치 키들만으로 구현될 수도 있다. 또 다른 예로, 상기 키패드는, 기계적 버튼 방식과 터치 방식의 혼합 형태 로 구현될 수도 있다. 또한, 상기 키패드은 버튼들은 길게 또는 짧게 누르거나 터치하는 시간에 대응하여 디스 플레이 장치에 표현되는 화면을 다양하게 제공할 수 있다. 다양한 실시예에 따르면, 상기 하우징은 각종 전자 부품 등을 수용하기 위한 것으로서, 적어도 일부분이 도전성 재질로 이루어질 수 있다. 예컨대, 상기 하우징은 상기 전자 장치의 외측면을 형성하는 측벽 들을 포함할 수 있으며, 상기 전자 장치의 외관으로 드러나는 부분은 도전성을 가진 금속 재질로 제작될 수 있다. 상기 하우징의 내부로는 인쇄 회로기판(미도시) 및/또는 배터리가 수용될 수 있다. 다양한 실시예에 따르면, 상기 인쇄회로기판에는 단말의 회로, 예를 들면, Application Processor(AP), Communication Processor(CP), 메모리, RF Transceiver 중 적어도 하나를 실장할 수 있고, 신호라인(예: RF 신 호라인(signal line)을 포함할 수 있다. 예를 들어, 상기 인쇄 회로기판에는 프로세서(예: 도 1의 프로세서 , 통신 모듈(예: 도 1의 통신 모듈), 각종 인터페이스(예: 도 1의 인터페이스), 전력 관리 모듈 (예: 도 1의 전력 관리 모듈) 등이 집적회로 칩 형태로 장착될 수 있다. 또 한 예로, 제어 회로 또한 집적 회로 칩으로 구성되어 상기 인쇄 회로기판에 장착될 수 있다. 예를 들어, 상기 제어 회로는 상술한 프로세서 또 는 통신 모듈의 일부일 수 있다. 상기 하우징 내부로 배터리를 수용함으로써 전원을 확보할 수 있다. 다양한 실시예에 따르면, 상기 전자 장치의 투명 부재 상단 영역에는 제 1 카메라(12a)와, 광원부 (12b) 또는 홍채 카메라(12c)가 포함될 수 있다. 예를 들어, 광원부(12b)는 IR LED일 수 있으며, 상기 홍채 카메라(12c)는 상기 IR LED에서 나오는 적색 근적외선을 광원으로 활용하여 사용자의 눈을 촬영하여 홍채 정보를 인식할 수 있다. 또 다른 예에서, 상기 전자 장치의 전면 상단 영역에는, 광원부 표시등(12d) 및 조도 센 서 또는 근접 센서(12e)가 포함될 수 있다. 또 다른 예에서, 상기 전자 장치의 후면에는 제 2 카메라 (13a), 심박수 센서(HRM, heart rate monitor)(13d) 또는 플래시(flash)(13b)가 포함될 수 있으며, 상기 전자 장치 상부에는 마이크(13c)가 포함될 수 있다. 다양한 실시예에 따르면, 상기 디스플레이 장치는 투명 부재를 통해 노출될 수 있다. 상기 디스플레 이 장치는 적어도 부분적으로 무선 전파 또는 자기장을 투과하는 물질로 제작될 수 있으며, 상기 하우징 및 투명 부재 사이에서 상기 제 1 방향(+Z)을 향하도록 장착될 수 있다. 상기 디스플레이 장치는 강화 유리 재질의 투명 부재의 내측면에 장착되는 디스플레이 패널을 포함할 수 있다. 상기 투명 부 재와 디스플레이 패널 사이에는 터치 패널이 탑재될 수 있다. 예컨대, 상기 디스플레이 장치는 화면 을 출력하는 출력 장치이면서, 터치 스크린 기능이 탑재된 입력 장치로 활용될 수 있다. 다양한 실시예에 따르면, 전자 장치는 하우징의 후면을 보호하는 후면 커버를 포함할 수 있다. 상기 후면 커버는 상기 디스플레이 장치와 대향하는(opposite) 방향(제 2 방향(-Z))을 바라보게 장착 되며, 무선 전파 또는 자기장을 투과시킬 수 있는 재질, 예를 들면, 강화 유리나 합성 수지로 제작될 수 있다. 상기 후면 커버는 상기 하우징, 디스플레이 장치와 함께 상기 전자 장치의 외관을 이룰 수 있다. 도면에 상세히 도시하지는 않았으나, 다양한 실시예에 따르면, 상기 전자 장치의 내부로 배치되는 전자 부 품들의 배치나, 상기 하우징과 내부 전자 부품 사이의 결속 구조 등에 따라 상기 하우징 내표면에는 다양한 구조물들이 형성될 수 있다. 예를 들어, 상기 인쇄 회로기판에 장착된 집적회로 칩들을 수용하는 공간이 상기 하우징에 형성될 수 있다. 집적회로 칩들을 수용하는 공간은 홈 형태(recessed shape) 또는 집적회로 칩을 둘러싸는 리브(rib) 등으로 형성될 수 있다. 이하, 본 발명의 다양한 실시예에 따르면 상기 전자 장치에 구비되는 디스플레이 장치 및 센서를 구 체적으로 설명하면, 다음과 같다. 도 4는 본 발명의 다양한 실시예 중 하나에 따른, 전자 장치의 디스플레이 장치 및 생체 센서를 포함한 영역을 나타낸 단면도이다. 도 4 를 참조하면, 전자 장치(예: 도 2 및 도 3의 전자 장치)는 투명 부재, 상기 투명 부재로 적어도 일부가 노출되는 디스플레이 장치, 상기 디스플레이 장치 일면에 대면 배치되고 핀 홀 구조 를 포함하는 차광 부재, 상기 제공된 광의 적어도 일부를 수광하는 이미지 센서를 포함할 수 있 다. 상기 디스플레이 장치는 디스플레이 층, 유전층, 광학층 및 상기 이미지 센서와 전기적으로 연결된 인쇄회로기판 등을 포함할 수 있다. 도 4의 상기 디스플레이 장치의 구조는 도 2 및 도 3의 디스플레이 장치의 구조와 일부 또는 전부가 실질적으로 동일할 수 있다. 다양한 실시예에 따르면, 상기 투명 부재는 제 1 방향(+Z)을 향하는 제 1 면, 상기 제 1 방향(+Z)과 반대인 제 2 방향(-Z)을 향하는 제 2 면 및 상기 제 1 방향(+Z)과 수직인 제 3 방향을 향하는 측면을 포함 할 수 있다. 상기 투명 부재는 실질적으로 디스플레이 장치를 통해 사용자에게 이미지 및/또는 동영상을 제공하는 활성 영역(A1)과 상기 활성 영역(A1)으로부터 투명 부재의 가장자리로 연장된 비활성 영역(A2)을 포함할 수 있다. 상기 투명 부재 활성 영역(A1) 하부에는 상기 디스플레이 장치가 플랫한 상태로 배 치될 수 있으며, 상기 비활성 영역(A2) 하부에는 상기 디스플레이 장치의 적어도 일부가 벤딩된 상태로 배 치될 수 있다. 다양한 실시예에 따르면, 상기 디스플레이 장치는 상기 투명 부재를 통해 전면(예: 제 1 방향(+Z))으 로 노출될 수 있으며, 상기 디스플레이 층 및 플렉서블 인쇄회로기판을 포함할 수 있다. 상기 플렉서 블 인쇄회로기판은 디스플레이 층에 제어 신호를 보내는 제어 회로가 형성될 수 있다. 상기 디스플레 이 층(예를 들어, (능동형) 유기 발광 다이오드((active) organic light emitting diode)은 복수의 신호 선과 복수의 화소를 가지는 표시 소자층(333a) 및 디스플레이 층의 하부 판을 형성하도록 배치되고, 일면 에 디스플레이 배선층(333b)이 형성되도록 지지하는 지지 기판(333c)(예를 들어, 폴리이미드(PI))을 포함할 수있다. 상기 배선이 형성된 배선층(333b)은 제어 회로가 형성된 인쇄회로기판과 연결될 수 있다. 다양한 실시예에 따르면, 상기 투명 부재와 상기 표시 소자층(333a) 사이, 또는 상기 표시 소자층(333a) 내부에는 광학 부재 및/또는 터치 센서 패널이 탑재될 수 있다. 예를 들어, 상기 디스플레이 장치는 화면을 출력하는 출력 장치이면서, 터치 스크린 기능이 탑재된 입력 장치로 활용될 수 있다. 또 다른 예로, 상 기 표시 소자층(333a) 및/또는 터치 패널 사이에는 유전층이 배치될 수 있으며, 상기 표시 소자층 (333a) 하면에는 엠보 부재 및 또는 쿠션 부재 등을 포함하는 차광 부재가 배치될 수 있다. 일 실시예에 따르면, 상기 표시 소자층(333a)은 기판(미도시) 및 상기 기판 상에 형성된 발광 소자들(예: 복수 의 픽셀들)을 덮어 보호하는 봉지부재(미도시)를 포함할 수 있다. 상기 기판은 유리 또는 고분자 필름과 같은 투명한 절연 기판으로 형성될 수 있으며, 상기 기판이 고분자 필름으로 형성된 경우 플렉서블 기판을 포함할 수 있다. 상기 봉지부재는 유리, 고분자 필름, 또는 금속을 포함할 수 있다. 또 다른 예로, 상기 봉지부재는 복수 의 유기막과 복수의 무기막이 적어도 1회 교대로 반복 적층된 박막 봉지층으로 구성될 수 있다. 상기 봉지부재 는 복수의 발광 소자들(예: 복수의 픽셀(PE)들)을 밀봉하여 외부의 이물질(예를 들어, 수분 및/또는 산소)로부 터 복수의 발광 소자들을 보호할 수 있다. 다양한 실시예에 따르면, 상기 표시 소자층(333a)의 적어도 일부는 광을 제공하는 발광 소자들(3331a)을 포함할 수 있으며, 상기 발광 소자들(3331a), 상기 이미지 센서 및 상기 핀 홀 구조는 생체 센서 모듈 (예: 광학 지문 센서)를 형성할 수 있다. 예를 들어, 상기 표시 소자층(333a)의 발광 소자들(3331a)은 생체 센 서 모듈의 광원으로 활용될 수 있다. 상기 발광 소자들(3331a)은 표시 소자층(333a)에 배열된 복수의 픽셀 들로 구성될 수 있으며, 상기 제 1 방향(+Z)을 향하여 광을 제공하고, 상기 제공된 광은 상기 투명 부재의 활성 영역(A1)에 접촉한 사용자(U)의 신체(예를 들어, 지문)을 향할 수 있다. 상기 광은 상기 사용자의 지문의 골 및/또는 융선에 의해 반사되며, 상기 반사된 광은 장치 내부에 배치된 이미지 센서에 도달할 수 있다. 다양한 실시예에 따르면, 상기 투명 부재와 이미지 센서 사이에 배치된 디스플레이 장치는 유전 층 및 광학층을 포함할 수 있다. 상기 유전층은 투명 부재와 접촉 배치될 수 있으며, 예를 들어, 실리콘(silicon), 공기(Air), 폼(Foam), 멤브레인(Membrane), OCA(optical clear adhesive), 스폰지, 고 무, 잉크, 폴리머(PC, PET)를 포함할 수 있다. 상기 광학층은 상기 유전층 상부 및/또는 하부에 배치 될 수 있다. 상기 유전층은 상기 투명 부재 및/또는 광학층을 접착시키거나, 투명 부재 및/또는 광학층과 서로 다른 굴절률을 가지도록 제공되어 굴절률에 따라 경로가 변화된 광를 상기 센서로 전달할 수 있다. 다양한 실시예에 따르면, 상기 디스플레이 층의 지지 기판(332c) 상에 형성된 배선층(333b)은 활성 영역(A1) 거 쳐 상기 비활성 영역(A2)에서 벤딩되어 상기 플렉서블 인쇄회로기판 상에 배치될 수 있다. 상기 배선층 (333b)의 제 2 방향(-Z)을 향하는 면에는 디스플레이 IC(D-IC)(332c) 및/또는 터치센서패널 IC(TSP-IC)가 배치 될 수 있다. 상기 배선층(333b)은 플렉서블 인쇄회로필름(flexible printed circuit film) 또는 구동 칩을 구 비한 칩 온 필름(chip on film) 또는 테이프 케리어 패키지(tape carrier package)를 포함할 수 있다. 다양한 실시예에 따르면, 상기 광학층은 상기 디스플레이 층로부터 출력된 화면을 투과하는 것으로서, 상기 디스플레이 층에 적어도 하나로 적층될 수 있다. 예를 들어, 상기 광학층은, 상기 디 스플레이 패널로부터 출력되는 화면의 위상차 등을 보정하기 위한 광학 보상 필름 등을 포함할 수 있다. 또 다른 예로, 상기 디스플레이 장치가 터치 스크린 기능을 가지고 있다면, 사용자의 접촉 위치 등을 감지 하기 위한 인듐-주석 산화물(Indium-Tin Oxide film; ITO) 필름 또한 상기 광학층에 해당할 수 있다. 상 기 광학층은, 광학 보상 필름, 예를 들면, 편광 필름을 포함할 수 있다. 상기 광학 보상 필름은, 편광 기 능을 제공하는 폴리비닐알코올(polyvinyl alcohol; PVA) 필름의 양면에 각각 트리아세틸 셀룰로오스(tri-acetyl cellulose; TAC) 필름이 부착되며, 아울러, 표면측 TAC 필름은 표면 코팅층에 의해 보호된 구성일 수 있다. 다양한 실시예에 따르면, 상기 이미지 센서는 상기 디스플레이 장치 하부(예: 제 2 방향(-Z) 상)에 배치되며, 상기 투명 부재 및 상기 디스플레이 장치를 통과한 광을 전달받아, 사용자의 지문 정보를 센싱할 수 있다. 상기 이미지 센서는 인쇄회로기판 상면에 배치되며, 상기 인쇄 회로기판과 전 기적으로 연결될 수 있다. 일 실시예에 따른, 상기 이미지 센서는 상기 투명 부재 위에서 볼 때, 상기 이미지 센서의 실질 적으로 전체 면적이 상기 디스플레이 장치와 중첩할 수 있다. 또 다른 예로, 상기 이미지 센서의 실 질적인 전체 면적이 터치 센서 및/또는 압력 센서(미도시)와 중첩될 수 있다. 예를 들어, 상기 이미지 센서은 상기 디스플레이 장치의 적어도 일부 영역의 하부에 적층 배치될 수 있다. 사용자는 디스플레이 장치 상부에 형성된 상기 투명 부재의 적어도 일부 영역에 손가락(예: 지문)을 터치하고, 상기 이미 지 센서로 상기 사용자의 지문 정보와 같은 생체 정보를 제공할 수 있다. 상기 이미지 센서는 복수 개의 수광 픽셀들 및 지지판(미도시)을 포함할 수 있으며, 상기 지지판은 PET 등 폴리머 필름 또는 글래스 기판(glass substrate)일 수 있다. 다양한 실시예에 따르면, 상기 이미지 센서는 상기 투명 부재를 통과하는 광을 집속하며, 광 스캐닝 장치의 소형화를 위해서는 짧은 초점거리를 가지는 렌즈가 사용될 수 있다. 또 다른 예로, 상기 이미지 센서 는 스캐닝 되는 이미지의 크기에 대응하기 위하여 어레이 렌즈를 포함할 수 있으며, 이때 어레이 렌즈는 매트릭스 구조로 형성될 수 있다. 다양한 실시예에 따르면, 상기 이미지 센서 및 디스플레이 장치 사이에는 광의 산란을 억제하는 차광 부재가 배치되고, 상기 차광 부재에는 핀 홀 구조가 형성될 수 있다. 상기 차광 부재는 광 이 투명 부재 방향을 향하도록 조절하여 외부(예: 도 3의 전자 장치의 후면 방향)로 방출되는 광의 산란을 억제할 수 있다. 또 다른 예로, 상기 이미지 센서로 상기 투명 부재로부터 전달된 광을 제공 하기 위해서, 상기 차광 부재의 일 영역이 개구될 수 있다. 예를 들어, 상기 차광 부재는 상기 이미 지 센서와 대응되는 영역이 개구되어, 상기 투명 부재의 일 영역을 통해 제공된 광이 상기 이미지 센 서로 도달할 수 있는 공간을 제공할 수 있다. 일 실시예에 따르면, 상기 차광 부재는 디스플레이 장치 후면을 차폐하는 층으로 제공될 수 있으며, 예를 들어, 쿠션 부재, 엠보 부재 또는 구리 시트(CU sheet)일 수 있으며, 흑색의 칼라를 포함할 수 있다. 일 실시예에 따르면, 상기 차광 부재에 형성되거나, 상기 차광 부재와 인접하게 배치된 상기 핀 홀 구조는 상기 이미지 센서와 대면하는 영역에 복수 개의 핀 홀들이 배열된 형태일 수 있으며, 상 기 복수 개의 핀 홀들은 사용자의 지문에 반사된 광을 상기 이미지 센서로 전달하는 통로를 제공할 수 있다. 상기 핀 홀들은 마이크로 사이즈의 홀들(예: 마이크로 홀들)로 형성될 수 있다. 일 실시예에 따르면, 상기 핀 홀 구조는 상기 이미지 센서에 형성된 수광 픽셀들과 대응된 배열 형태로 형성될 수 있다. 예를 들어, 상기 핀 홀 구조에 형성된 핀 홀들의 배열은 일정한 간격으로 하 나 또는 그 이상의 수광 픽셀들과 대응되도록 배열될 수 있다. 또 다른 예로, 상기 핀 홀과 핀 홀 사이에 는 격벽이 마련되어, 상기 반사광이 상기 이미지 센서의 핀 홀과 대응되는 픽셀에 정확하게 가이드할 수 있다. 예를 들어, 상기 격벽은 인접한 픽셀에 제공될 수 있는 간섭 광(noise light)을 차단할 수 있다. 상기 격벽은 상기 차광 부재와 동일한 두께를 가지며, 동일한 재질로 구성될 수 있다. 예를 들어, 상 기 핀 홀 구조는 차광 부재에 적층되도록 구현할 수 있으며, 이는 차광 부재 합지 후에 미세 타 공 방법으로 구현할 수 있다. 도 5a는 본 발명의 다양한 실시예 중 하나에 따른, 디스플레이 장치의 발광 소자에서 방출되는 광의 경로를 나 타낸 도면이며, 도 5b는 도 5a의 발광된 광이 사용자의 신체에 반사되어, 센서의 수광 픽셀로 제공되는 광의 경 로를 나타낸 도면이다. 도 5a 및 도 5b를 참조하면, 전자 장치(예: 도 2 및 도 3의 전자 장치)는 투명 부재, 상기 투명 부재 로 적어도 일부가 노출되는 디스플레이 장치, 상기 디스플레이 장치 일면에 대면 배치되고 핀 홀 구조를 포함하는 차광 부재, 상기 제공된 광의 적어도 일부를 수광하는 이미지 센서를 포함 할 수 있다. 도 5a 및 도 5b의 상기 디스플레이 장치의 구조는 도 2 내지 도 4의 디스플레이 장치(220,330)의 구조와 일부 또는 전부가 실질적으로 동일할 수 있다 도 5a 및 5b를 참조하면, 상기 생체 센서 모듈의 광의 경로를 살펴보면, 상기 생체 센서 모듈는 디스 플레이 장치의 표시 소자층(도 4의 333a)에 형성되고, 광을 제공하는 발광 소자(도 4의 3331a), 상기 발광 소자의 적어도 일부와 대면 배치되고, 사용자의 지문에 반사된 광을 수광하는 이미지 센서 및 상기 발광 소자 및 이미지 센서 사이에 배치된 핀 홀 구조를 포함할 수 있다. 다양한 실시예에 따르면, 상기 디스플레이 장치의 발광 소자에서 제공된 광의 제 1 경로(L1)는 상기 투명 부재를 통과하여, 상기 투명 부재의 활성 영역에 접촉한 사용자의 지문을 향할 수 있다.(도 5a 참조)상기 광(L1)은 상기 사용자(U)의 지문의 골 및/또는 융선에 의해 반사되며, 상기 반사된 광의 제 2 경로(L2)는 핀 홀 구조를 거쳐 상기 이미지 센서에 도달할 수 있다.(도 5b 참조) 예를 들어, 상기 투명 부재 의 활성 영역(A1)에 배치된 사용자의 지문은 골 및/또는 융선 형상의 요철면을 가지게 되어, 상기 투명 부 재에 접촉하는 영역과 접촉하지 않는 영역으로 구분될 수 있다. 이때 사용자의 지문 중 투명 부재와 접촉하지 않는 영역에서는 전달된 광이 전반사되어 다시 진행하나, 사용자의 지문 중 투명 부재와 접촉하 는 영역에서는 광이 일부가 사용자의 지문 내로 흡수되고 일부는 산란 및 반사될 수 있다. 따라서, 사용자의 지 문과 접촉되지 않는 투명 부재에 입사되는 광은 전반사되어 상기 이미지 센서를 향하여 진행하나, 사 용자의 지문과 접촉되는 투명 부재에 입사되는 광은 흡수, 굴절되거나 산란되어 상기 이미지 센서로 진행하지 못한다. 일 실시예에 따른, 상기 광학 지문 센서부의 핀 홀 구조는 상기 차광 부재의 적어도 일부 영역 에 형성되고, 상기 이미지 센서와 적층되도록 구성할 수 있다. 상기 이미지 센서은 디스플레이 장치 와 인접 배치될 수 있다. 예를 들어, 상기 이미지 센서는 상기 디스플레이 장치의 후면의 적어 도 일부와 접촉 배치되어, 사용자의 지문 등에 반사된 광(L2)의 거리를 줄임에 따라, 이미지 센서의 수광 수광 픽셀들로 제공된 광의 집적량의 증가를 가져와 센서 성능을 극대화할 수 있다. 또 한 예로, 상기 핀 홀 구조는 미세 패턴의 가공을 통해, 상기 전자 장치의 투명 부재에서 바라볼 때, 상기 이미지 센서 가 시인되지 않아 미려한 디자인을 제공할 수 있다. 도 6은 본 발명의 다양한 실시예 중 하나에 따른, 핀 홀 구조(도 5의 360)의 핀 홀의 배열과 이에 대응된 이미지 센서의 수광 픽셀의 배열을 나타낸 도면이다. 도 6을 참조하면, 광학 지문 센서는 발광 소자들을 포함하는 디스플레이 장치, 수광 픽셀들을 포함하 는 이미지 센서 및 상기 디스플레이 장치 및 이미지 센서 사이에 배치되고, 상기 수광 픽셀들 로 도달하는 광의 경로를 제공하는 핀 홀 구조를 포함할 수 있다. 도 6의 디스플레이 장치, 이미지 센서 및 핀 홀 구조는 도 4 내지 도 5b의 디스플레이 장치 , 이미지 센서 및 핀 홀 구조의 구성과 일부 또는 전부가 동일할 수 있다. 다양한 실시예에 따르면, 상기 디스플레이 장치는 표시 소자층(도 4의 333a) 을 포함할 수 있으며, 상기 표시 소자층은 기판(미도시) 및 상기 기판 상에 형성된 복수의 화소를 덮어 보호하는 봉지부재(미도시)를 포함 할 수 있다. 상기 기판은 유리 또는 고분자 필름과 같은 투명한 절연 기판으로 형성될 수 있으며, 상기 기판이 고분자 필름으로 형성된 경우 플렉서블 기판을 포함할 수 있다. 상기 표시 소자층에 형성된 발광 소자들은 상기 제 1 방향(+Z)을 향하여 광을 제공하고, 상기 제공된 광은 상기 투명 부재의 활성 영역에 접촉한 사용자의 신체(예를 들어, 지문)을 향할 수 있다. 상기 광은 상기 사용자의 지문의 골 및/또는 융선에 의해 반사되며, 상 기 반사된 광은 장치 내부에 배치된 이미지 센서에 도달할 수 있다. 다양한 실시예에 따르면, 상기 이미지 센서는 상기 디스플레이 장치 하부(예: 제 2 방향(-Z) 상)에 배치되며, 상기 투명 부재 및 상기 디스플레이 장치를 통과한 광을 전달받아, 사용자의 지문 정보를 센싱할 수 있다. 상기 이미지 센서는 광을 수광할 수 있는 복수 개의 수광 픽셀들이 배열될 수 있다. 다양한 실시예에 따르면, 상기 이미지 센서 및 디스플레이 장치 사이에는 광의 산란을 억제하는 차광 부재가 배치되고, 상기 차광 부재에는 핀 홀 구조가 형성될 수 있다. 예를 들어, 상기 차광 부 재는 상기 이미지 센서에 대응하는 일 영역이 개구될 수 있으며, 상기 개구에 형성된 핀 홀 구조 는 상기 이미지 센서에 형성된 수광 픽셀들과 대응된 배열 형태를 가질 수 있다. 예를 들어, 상 기 핀 홀 구조에 형성된 핀 홀들(예: 마이크로 홀들)의 배열은 일정한 간격을 가지도록 배치되고, 상 기 복수 개의 수광 픽셀들 각각에 1 : 1 대응되도록 배열될 수 있다. 상기 복수 개의 핀 홀들 각각은 사용자의 지문에 반사된 광을 상기 이미지 센서로 전달하는 통로를 제공할 수 있다. 일 실시예에 따르면, 상기 핀 홀과 핀 홀 사이에는 격벽이 마련되어, 상기 반사광이 상기 핀 홀과 대응되 는 이미지 센서의 수광 픽셀에 정확하게 가이드할 수 있다. 상기 격벽은 서로 인접한 수광 픽셀에 제 공될 수 있는 간섭 광(noise light)을 차단할 수 있다. 상기 격벽은 하부의 이미지 센서에 배치된 수 광 픽셀들과 동일 선상에 배치되지 않도록, 상기 수광 픽셀들 사이 영역에 대응되도록 배치될 수 있다. 상 기 격벽은 상기 차광 부재와 동일한 두께를 가지며, 동일한 재질로 구성될 수 있다. 예를 들어, 상기 핀 홀 구조는 차광 부재에 적층되도록 구현할 수 있으며, 이는 차광 부재 합지 후에 미세 타공방법으로 구현할 수 있다. 도 7은 본 발명의 다양한 실시예들 중 하나에 따른, 핀 홀 구조의 핀 홀들의 배열과 이에 대응된 이미지 센서의 수광 픽셀들의 배열을 나타낸 도면이다. 도 7을 참조하면, 광학 지문 센서는 발광 소자들을 포함하는 디스플레이 장치, 수광 픽셀들을 포함하는 이 미지 센서 및 상기 디스플레이 장치 및 이미지 센서 사이에 배치되고, 상기 수광 픽셀들로 도달 하는 광의 경로를 제공하는 핀 홀 구조를 포함할 수 있다. 도 7의 디스플레이 장치, 이미지 센서 및 핀 홀 구조는 도 6의 디스플레이 장치, 이미지 센서 및 핀 홀 구조의 구성과 일부 또는 전부가 동일할 수 있다. 이하, 도 6과 차이점을 중심으로 설 명한다. 다양한 실시예에 따르면, 상기 디스플레이 장치는 표시 소자층을 포함할 수 있으며, 상기 표시 소자층에 형성된 발광 소자들은 상기 제 1 방향(+Z)을 향하여 광을 제공하고, 상기 제공된 광은 상기 투명 부재의 활성 영역에 접촉한 사용자의 신체(예를 들어, 지문)을 향할 수 있다. 상기 광은 상기 사용자의 지문의 골 및/ 또는 융선에 의해 반사되며, 상기 반사된 광은 장치 내부에 배치된 이미지 센서에 도달할 수 있다. 다양한 실시예에 따르면, 상기 이미지 센서는 상기 디스플레이 장치 하부(예: 제 2 방향(-Z) 상)에 배치되며, 상기 투명 부재 및 상기 디스플레이 장치를 통과한 광을 전달받아, 사용자의 지문 정보를 센싱할 수 있다. 상기 이미지 센서는 광을 수광할 수 있는 복수 개의 수광 픽셀들이 배열될 수 있다. 다양한 실시예에 따르면, 상기 이미지 센서 및 디스플레이 장치 사이에는 광의 산란을 억제하는 차광 부재가 배치되고, 상기 차광 부재에는 핀 홀 구조가 형성될 수 있다. 예를 들어, 상기 차광 부 재는 상기 이미지 센서에 대응하는 일 영역이 개구될 수 있으며, 상기 개구에 형성된 핀 홀 구조 는 상기 이미지 센서에 형성된 수광 픽셀들과 대응된 배열 형태를 가질 수 있다. 예를 들어, 상 기 핀 홀 구조에 형성된 핀 홀들(예: 마이크로 홀들)의 배열은 일정한 간격을 가지도록 배치될 수 있 다. 일 실시예에 따르면, 상기 핀 홀들 각각은 이미지 센서의 복수 개의 수광 픽셀들에 대응되도록 배치될 수 있다. 예를 들어, 상기 핀 홀 구조의 하나의 핀 홀 및 복수 개의 픽셀들이 1 : n(n > 1) 대응되 도록 배열될 수 있다. 상기 핀 홀 구조의 하나의 핀 홀은 복수 개의 픽셀 크기에 대응된 크기의 직경을 가 지도록 형성될 수 있다. 상기 복수 개의 핀 홀들 각각은 사용자의 지문에 반사된 광을 상기 이미지 센서 로 전달하는 통로를 제공할 수 있다. 일 실시예에 따르면, 상기 핀 홀과 핀 홀 사이에는 격벽이 마련되어, 상기 반사광이 상기 핀 홀과 대응되 는 이미지 센서의 복수 개의 픽셀들에 정확하게 가이드할 수 있다. 상기 격벽은 서로 인접한 수광 픽 셀에 제공될 수 있는 간섭 광(noise light)을 차단할 수 있다. 상기 격벽은 하부의 이미지 센서에 배 치된 수광 픽셀들과 동일 선상에 배치되지 않도록, 상기 픽셀들 사이 영역에 대응되도록 배치될 수 있다. 상기 격벽은 상기 차광 부재와 동일한 두께를 가지며, 동일한 재질로 구성될 수 있다. 예를 들어, 상기 핀 홀 구조는 차광 부재에 적층되도록 구현할 수 있으며, 이는 차광 부재 합지 후에 미세 타공 방법으로 구현할 수 있다. 도 8은 본 발명의 다양한 실시예들 중 하나에 따른, 핀 홀 구조의 핀 홀들의 배열과 이에 대응된 이미지 센서의 수광 픽셀들의 배열을 나타낸 도면이다. 도 8을 참조하면, 광학 지문 센서는 발광 소자들을 포함하는 디스플레이 장치, 수광 픽셀들을 포함하는 이 미지 센서 및 상기 디스플레이 장치 및 이미지 센서 사이에 배치되고, 상기 수광 픽셀들로 도달 하는 광의 경로를 제공하는 핀 홀 구조를 포함할 수 있다. 도 8의 디스플레이 장치, 이미지 센서 및 핀 홀 구조은 도 6의 디스플레이 장치, 이미지 센서 및 핀 홀 구조의 구성과 일부 또는 전부가 동일할 수 있다. 이하, 도 6과 차이점을 중심으로 설 명한다. 다양한 실시예에 따르면, 상기 디스플레이 장치는 표시 소자층을 포함할 수 있으며, 상기 표시 소자층에 형성된 발광 소자들은 상기 제 1 방향(+Z)을 향하여 광을 제공하고, 상기 제공된 광은 상기 투명 부재의 활성 영역에 접촉한 사용자의 신체(예를 들어, 지문)을 향할 수 있다. 상기 광은 상기 사용자의 지문의 골 및/ 또는 융선에 의해 반사되며, 상기 반사된 광은 장치 내부에 배치된 이미지 센서에 도달할 수 있다. 다양한 실시예에 따르면, 상기 이미지 센서는 상기 디스플레이 장치 하부(예: 제 2 방향(-Z) 상)에 배치되며, 상기 투명 부재 및 상기 디스플레이 장치를 통과한 광을 전달받아, 사용자의 지문 정보를 센싱할 수 있다. 상기 이미지 센서는 광을 수광할 수 있는 복수 개의 수광 픽셀들이 배열될 수 있다. 다양한 실시예에 따르면, 상기 이미지 센서 및 디스플레이 장치 사이에는 광의 산란을 억제하는 차광 부재가 배치되고, 상기 차광 부재에는 핀 홀 구조가 형성될 수 있다. 예를 들어, 상기 차광 부 재는 상기 이미지 센서에 대응하는 일 영역이 개구될 수 있으며, 상기 개구에 형성된 핀 홀 구조 는 상기 이미지 센서에 형성된 수광 픽셀들과 대응된 배열 형태를 가질 수 있다. 예를 들어, 상 기 핀 홀 구조에 형성된 핀 홀들(예: 마이크로 홀들)의 배열은 소정의 간격을 가지도록 배치될 수 있 다. 상기 핀 홀 구조에 형성된 핀 홀들의 크기 및 배열은 서로 다르게 형성될 수 있다. 일 실시예에 따르면, 상기 핀 홀들 각각은 이미지 센서의 복수 개의 수광 픽셀들에 대응되도록 배치될 수 있다. 예를 들어, 상기 핀 홀 구조의 하나의 홀 및 복수 개의 픽셀들이 1 : n(n ≥ 1) 대응되도 록 배열될 수 있다. 상기 핀 홀 구조의 하나의 핀 홀은 하나의 수광 픽셀 크기에 대응된 직격을 가지거나 는 복수 개의 수광 픽셀 크기에 대응된 크기의 직경을 가지도록 형성될 수 있다. 상기 복수 개의 핀 홀들 각각은 사용자의 지문에 반사된 광을 상기 이미지 센서로 전달하는 통로를 제공할 수 있다. 일 실시예에 따르면, 상기 핀 홀과 핀 홀 사이에는 격벽이 마련되어, 상기 반사광이 상기 핀 홀과 대응되 는 이미지 센서의 복수 개의 픽셀들에 가이드될 수 있다. 상기 격벽은 서로 인접한 수광 픽셀에 제공 될 수 있는 간섭 광(noise light)을 차단할 수 있다. 상기 격벽은 하부의 이미지 센서에 배치된 적어 도 하나의 수광 픽셀과 동일 선상에 배치될 수 있다. 상기 수광 픽셀과 동일 선상에 배치된 격벽은 일부 픽셀로 향하는 반사광이 수광을 제한할 수 있다. 상기 제한된 영역은 이미지 센서의 이미지 캡쳐시, 각 캡쳐된 이미지 들의 인터폴레이션(interpolation)으로 인하여 보상될 수 있다. 예를 들어, 전자 장치 내의 이미지 시그널 프로 세서(미도시)에 의하여, 상기 이미지 센서을 통하여 획득된 이미지 또는 메모리에 저장된 이미지에 대하여 이미 지 처리(예: 깊이 지도(depth map) 생성, 3차원 모델링, 파노라마 생성, 특징점 추출, 이미지 합성, 또는 이미 지 보상(예: 노이즈 감소, 해상도 조정, 밝기 조정, 블러링(blurring), 샤프닝(sharpening), 또는 소프트닝 (softening))을 수행할 수 있다. 일 실시예에 따르면, 상기 격벽은 상기 차광 부재와 동일한 두께를 가지며, 동일한 재질로 구성될 수 있다. 예를 들어, 상기 핀 홀 구조는 차광 부재에 적층되도록 구현할 수 있으며, 이는 차광 부재 합지 후에 미세 타공 방법으로 구현할 수 있다. 도 9는 본 발명의 일 실시예에 따른, 핀 홀 구조의 배치 및 이에 대응된 이미지 센서의 배치 관계를 나타낸 도면이다. 도 9를 참조하면, 광학 지문 센서는 발광 소자들을 포함하는 디스플레이 장치, 수광 픽셀들을 포함하는 이 미지 센서 및 상기 디스플레이 장치 및 이미지 센서 사이에 배치되고, 상기 수광 픽셀들로 도달 하는 광의 경로를 제공하는 핀 홀 구조를 포함할 수 있다. 도 9의 디스플레이 장치, 이미지 센서 및 핀 홀 구조은 도 4 내지 도 5b의 디스플레이 장치 , 이미지 센서 및 핀 홀 구조의 구성과 일부 또는 전부가 동일할 수 있다. 다양한 실시예에 따르면, 상기 디스플레이 장치는 표시 소자층을 포함할 수 있으며, 상기 표시 소자층에 형성된 발광 소자들은 상기 제 1 방향(+Z)을 향하여 광을 제공하고, 상기 제공된 광은 상기 투명 부재의 활성 영역에 접촉한 사용자의 신체(예를 들어, 지문)을 향할 수 있다. 상기 광은 상기 사용자의 지문의 골 및/ 또는 융선에 의해 반사되며, 상기 반사된 광은 장치 내부에 배치된 이미지 센서에 도달할 수 있다. 다양한 실시예에 따르면, 상기 디스플레이 장치 하부에는 광의 산란을 억제하는 차광 부재가 배치되 고, 상기 차광 부재의 적어도 일부와 동일 층에는 이미지 센서가 배치될 수 있다. 상기 차광 부재 는 광이 투명 부재 방향을 향하도록 조절하여 외부(예:도 3의 전자 장치의 후면 방향)로 방출되는 광 의 산란을 억제할 수 있다. 또 다른 예로, 상기 이미지 센서로 상기 투명 부재로부터 전달된 광을 제공하기 위해서, 상기 차광 부재의 일 영역이 개구될 수 있다. 예를 들어, 상기 차광 부재는 상기 이 미지 센서와 대응되는 영역이 개구되어, 상기 이미지 센서의 적어도 일부가 상기 개구에 배치될 수 있다. 상기 이미지 센서는 상기 디스플레이 장치의 적어도 일부와 인접 배치되어, 사용자의 지문 등 에 반사된 광의 거리를 줄임에 따라, 이미지 센서의 수광 픽셀들로 제공된 광의 집적량의 증가를 가져와 센서 성능을 극대화할 수 있다. 다양한 실시예에 따르면, 상기 이미지 센서 및 디스플레이 장치 사이에는 필름층이 배치되고, 상기 필름층에는 핀 홀 구조가 형성될 수 있다. 예를 들어, 상기 필름층은 상기 이미지 센서 에 대응하는 일 영역이 개구되어, 상기 투명 부재의 일 영역을 통해 제공된 광이 상기 이미지 센서 로 도달할 수 있는 공간을 제공할 수 있다. 일 실시예에 따르면, 상기 필름층은 상기 디스플레이 장치 및 차광 부재 사이에 접촉 배치될 수 있으며, 예를 들어, 실리콘(silicon), 공기(Air), 폼(Foam), 멤브레인(Membrane), OCA(optical clear adhesive), 스폰지, 고무, 잉크, 폴리머(PC, PET)를 포함할 수 있다. 일 실시예에 따르면, 상기 필름층에 형성된 상기 핀 홀 구조는 상기 이미지 센서와 대면하는 영 역에 복수 개의 핀 홀들(예: 마이크로 홀들)이 배열된 형태일 수 있으며, 상기 복수 개의 핀 홀들은 사용자의 지문에 반사된 광을 상기 이미지 센서로 전달하는 통로를 제공할 수 있다. 일 실시예에 따르면, 상기 핀 홀 구조는 상기 이미지 센서에 형성된 수광 픽셀들과 대응된 배열 형태 로 형성될 수 있다. 예를 들어, 상기 핀 홀 구조에 형성된 핀 홀들의 배열은 일정한 간격으로 하나 또는 그 이상의 수광 픽셀들과 대응되도록 배열될 수 있다. 상기 핀 홀과 핀 홀 사이에는 격벽이 마련되어, 상기 사용자에 지문에 반사된 광이 상기 핀 홀과 대응되는 이미지 센서의 적어도 하나의 픽셀에 정확 하게 가이드할 수 있다. 상기 격벽은 상기 차광 부재와 동일한 두께를 가지며, 동일한 재질로 구성될 수 있다. 예를 들어, 상기 핀 홀 구조는 차광 부재에 적층되도록 구현할 수 있으며, 이는 차광 부재 합지 후에 미세 타공 방법으로 구현할 수 있다. 본 발명의 다양한 실시예에 따르면 전자 장치는, 투명 부재(도 4의 310); 상기 투명 부재의 아래(under)에 배치되고, 복수의 픽셀들을 포함하는 디스플레이 패널 (도 4의 333); 상기 디스플레이 패널 아래에 배치되고, 상기 복수의 픽셀들(도 4의 3331a) 중 적어도 일부 픽셀 에서 출력된 광 중 상기 투명 부재의 적어도 일부 영역에 접촉된 외부 객체에 의해 반사된 반사광의 적어도 일 부를 획득할 수 있는 생체 센서(도 4의 301); 및 상기 디스플레이 패널 및 상기 생체 센서 사이에 배치되고, 복 수의 마이크로 홀들이 적어도 일부 영역에 형성된 차광 부재(도 4의 350)를 포함하고, 상기 마이크로 홀들이 형 성된 상기 적어도 일부 영역은 상기 반사광의 상기 적어도 일부가 투과되도록 상기 생체 센서에 대면하여 형성 될 수 있다. 본 발명의 다양한 실시예에 따른 전자 장치(도 2의 200)는, 제 1 방향으로 향하는 제 1 면 및 상기 제 1 방향의 반대인 제 2 방향으로 향하는 제 2 면을 포함하는 하우징 (도2의 200)으로서, 상기 하우징은 상기 제 1 면의 적어도 일부를 형성하는 투명 부재(도 4의 310)를 포함하는 하우징; 상기 하우징의 상기 제 1면 및 상기 제 2 면 사이에 배치되고, 상기 투명 부재를 통하여 외부로 정보를 표시하기 위한 디스플레이 장치(도 4의 330); 상기 디스플레이 장치 일면에 대면 배치되고, 상기 디스플레이 장 치로부터 상기 제 2 방향으로 향하는 광을 차폐하는 차광 부재(도 4의 350); 및 상기 하우징의 상기 제 1 면 및 제 2 면 사이에 배치되고, 상기 투명 부재에 접촉하는 사용자의 지문을 센싱하는 생체 센서 모듈(도 4의 301) 을 포함할 수 있다. 상기 생체 센서 모듈은, 상기 투명 부재를 향해 광을 방출하는 복수 개의 발광 소자들(도 4 의 3331a); 상기 차광 부재의 일면과 대면 배치되며, 외부 객체에 의해 반사된 광을 센싱하는 이미지 센서(도 4 의 370); 및 상기 차광 부재 내부 또는 인접 영역에 형성되고, 상기 이미지 센서를 향하는 상기 반사광의 경로 를 제공하는 핀 홀 구조(도 4의 360)를 포함할 수 있다. 다양한 실시예에 따르면, 상기 생체 센서 모듈은 상기 디스플레이 장치에 의해 방출되는 광을 이용하여 사용자 의 지문을 센싱할 수 있다. 다양한 실시예에 따르면, 상기 핀 홀 구조는, 상기 이미지 센서와 대면되는 영역에 소정의 간격을 가지고 배열 된 복수 개의 핀 홀들(도 4의 361) 및; 상기 핀홀 들 사이에 각각 배치되고, 상기 반사 광의 간섭을 차단하는복수 개의 격벽들(도 4의 363)을 포함할 수 있다. 다양한 실시예에 따르면, 상기 이미지 센서는 소정 간극으로 배열된 복수 개의 수광 픽셀들을 포함하고, 상기 핀 홀 구조의 복수 개의 핀 홀들의 배열은 상기 복수 개의 수광 픽셀들의 배열에 대응되도록 배치될 수 있다. 다양한 실시예에 따르면, 상기 투명 부재 위에서 볼 때, 상기 이미지 센서의 실질적으로 전체 면적이, 상기 디 스플레이 장치와 중첩할 수 있다. 다양한 실시예에 따르면, 상기 복수 개의 발광 소자들에서 방출된 광은 상기 투명 부재를 통과하여 상기 제 1 방향을 향하는 제 1 경로(도 5a의 L1)를 형성하고, 상기 핀 홀 구조의 복수 개의 핀 홀들은 상기 사용자의 지문 에 반사된 광이 상기 투명 부재를 통과하여 상기 이미지 센서를 향하도록 안내하는 제 2 경로(도 5b의 L2)를 형 성할 수 있다. 다양한 실시예에 따르면, 상기 이미지 센서는 상기 제 2 경로를 통과한 광을 전달 받아, 상기 투명 부재에 접촉 하는 사용자의 생체 정보를 감지하도록 구성될 수 있다. 다양한 실시예에 따르면, 상기 핀 홀 구조의 상기 복수 개의 격벽들은 상기 차광 부재와 동일한 두께를 가지고 동일 재질로 구성될 수 있다. 다양한 실시예에 따르면, 상기 디스플레이 장치는 유기발광다이오드(OLEDs)를 포함할 수 있다. 다양한 실시예에 따르면, 상기 적어도 하나의 이미지 센서 또는 상기 전자 장치의 통신 모듈을 이용하여 사용자 의 생체 정보를 획득하고, 상기 전자 장치가 지원하는 복수의 서비스들 중에서 상기 생체 정보와 연관된 적어도 하나의 서비스를 결정하고, 상기 결정된 적어도 하나의 서비스를 제공하도록 구성된 프로세서를 더 포함할 수 있다. 다양한 실시예에 따르면, 상기 핀 홀 구조는, 상기 이미지 센서와 대면되는 영역에 소정의 간격을 가지고 배열 된 복수 개의 핀 홀들 및 상기 핀홀 들 사이에 각각 배치되고, 상기 반사 광의 간섭을 차단하는 복수 개의 격벽 들을 포함하고, 상기 이미지 센서는 소정 간극으로 배열된 복수 개의 수광 픽셀들을 포함하며, 상기 복수 개의 핀 홀들의 각각의 중심은 상기 복수 개의 수광 픽셀들 각각의 중심과 동일 선상에 배치될 수 있 다. 다양한 실시예에 따르면, 상기 핀 홀 구조는, 상기 이미지 센서와 대면되는 영역에 소정의 간격을 가지고 배열 된 복수 개의 핀 홀들 및 상기 핀홀 들 사이에 각각 배치되고, 상기 반사 광의 간섭을 차단하는 복수 개의 격벽 들을 포함하고, 상기 이미지 센서는 소정 간극으로 배열된 복수 개의 수광 픽셀들을 포함하며, 상기 복수 개의 핀 홀들 각각은 상기 복수 개의 수광 픽셀들과 서로 1 : n(n>1,n은 정수)의 배열 관계를 가질 수 있다. 다양한 실시예에 따르면, 상기 디스플레이 장치(도 9의 730) 및 상기 차광 부재(도 9의 750) 사이에 배치된 필 름층(도 9의 780)을 더 포함하고, 상기 핀 홀 구조(도 9의 760)는 상기 필름층과 동일층에 형성되고, 상기 이미 지 센서(도 9의 770)와 대면되는 영역에 소정의 간격을 가지고 배열된 복수 개의 핀 홀들(도 9의 761) 및 상기 핀홀 들 사이에 각각 배치되고, 상기 반사 광의 간섭을 차단하는 복수 개의 격벽들(도 9의 763)을 포함할 수 있 다. 다양한 실시예에 따르면, 상기 차광 부재는 상기 핀 홀 구조와 대응되는 영역에 개구를 포함하고, 상기 개구의 적어도 일부에 상기 이미지 센서가 배치될 수 있다. 본 발명의 다양한 실시예에 따른 생체 센서 모듈은, 외부를 향해 광을 방출하는 복수 개의 발광 소자들; 상기 복수 개의 발광 소자들의 배열의 적어도 일부와 대면 배치되고, 상기 방출된 광이 사용자의 신체에 반사된 후, 상기 반사광을 센싱하는 이미지 센서; 및 상기 복수의 발광 소자들 및 이미지 센서 사이에 배치되고, 상기 이미지 센서를 향하는 상기 반사광의 경로를 가이드하는 핀 홀 구조를 포함할 수 있다. 상기 핀 홀 구조는, 상기 이미지 센서와 대면되는 영역에 소정의 간격을 가지고 배 열된 복수 개의 핀 홀들 및; 상기 핀홀 들 사이에 각각 배치되고, 상기 반사 광의 간섭을 차단하는 복수 개의 격벽들을 포함할 수 있다. 다양한 실시예에 따르면, 상기 생체 센서 모듈은 디스플레이 장치를 포함하는 전자 장치 내부에 배치되고, 상기 광학 지문 센서의 발광 소자들은 상기 디스플레이 장치의 발광 소자들의 적어도 일부일 수 있다.다양한 실시예에 따르면, 상기 이미지 센서는 소정 간극으로 배열된 복수 개의 수광 픽셀들을 포함하고, 상기 핀 홀 구조의 상기 복수 개의 핀 홀들의 배열은 상기 복수 개의 수광 픽셀들의 배열에 대응되도록 배치될 수 있 다. 다양한 실시예에 따르면, 상기 복수 개의 핀 홀들은 적어도 하나의 수광 픽셀들과 대면 배치될 수 있다. 다양한 실시예에 따르면, 상기 디스플레이 장치 하부에는 일부 방향을 향하는 광을 차폐하는 차광 부재가 배치 되고, 상기 핀 홀 구조의 복수 개의 격벽들은 상기 차광 부재와 동일한 두께를 가지고 동일 재질로 구성될 수 있다. 본 발명의 다양한 실시예에 따른 휴대용 전자 장치는, 복수 개의 발광 소자들이 배치된 디스플레이 장치; 상기 디스플레이 장치를 통해 외부 표시 정보를 제공하는 활 성 영역 및 상기 활성 영역으로부터 가장자리로 연장된 비활성 영역을 포함하는 투명 부재; 상기 활성 영역의 적어도 일부와 대면 배치되고, 상기 발광 소자들로부터 발광된 광이 사용자의 신체에 반사된 후, 상기 반사 광 을 센싱하는 센서; 및 상기 투명 부재 및 상기 센서 사이에 배치되고, 상기 센서를 향하는 상기 반사광의 경로 를 가이드하는 핀 홀 구조를 포함할 수 있다. 이상에서 설명한 본 발명의 다양한 실시예의 전자장치는 전술한 실시 예 및 도면에 의해 한정되는 것은 아니고,"}
{"patent_id": "10-2017-0166144", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "본 발명의 기술적 범위 내에서 여러 가지 치환, 변형 및 변경이 가능함은 본 발명이 속하는 기술분야에서 통상 의 지식을 가진 자에게 있어 명백할 것이다."}
{"patent_id": "10-2017-0166144", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 다양한 실시예에 따르면 네트워크 환경 내의 전자 장치를 나타낸 블럭도이다. 도 2는 본 발명의 다양한 실시예 중 하나에 따른, 전자 장치를 나타내는 사시도이다. 도 3은 본 발명의 다양한 실시예 중 하나에 따른 전자 장치를 다른 방향에서 바라본 모습을 나타내는 사시도이 다. 도 4는 본 발명의 다양한 실시예 중 하나에 따른, 전자 장치의 디스플레이 장치 및 센서를 포함한 영역을 나타낸 단면도이다. 도 5a는 본 발명의 다양한 실시예 중 하나에 따른, 디스플레이 장치의 발광 소자에서 방출되는 광의 경로를 나 타낸 도면이며, 도 5b는 도 5a의 발광된 광이 사용자의 신체에 반사되어, 센서의 수광 픽셀로 제공되는 광의 경 로를 나타낸 도면이다. 도 6은 본 발명의 다양한 실시예 중 하나에 따른, 핀 홀 구조의 핀 홀의 배열과 이에 대응된 이미지 센서 의 수광 픽셀들의 배열을 나타낸 도면이다. 도 7은 본 발명의 다양한 실시예들 중 하나에 따른, 핀 홀 구조의 핀 홀들의 배열과 이에 대응된 이미지 센서의 수광 픽셀들의 배열을 나타낸 도면이다. 도 8은 본 발명의 다양한 실시예들 중 하나에 따른, 핀 홀 구조의 핀 홀들의 배열과 이에 대응된 이미지 센서의 수광 픽셀들의 배열을 나타낸 도면이다. 도 9는 본 발명의 일 실시예에 따른, 핀 홀 구조의 배치 및 이에 대응된 이미지 센서의 배치 관계를 나타낸 도면이다."}
