{"patent_id": "10-2023-0034783", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0120602", "출원번호": "10-2023-0034783", "발명의 명칭": "이미지 센서를 통해서 이미지를 획득하는 전자 장치 및 그 동작 방법", "출원인": "삼성전자주식회사", "발명자": "박재형"}}
{"patent_id": "10-2023-0034783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서, 렌즈부 및 상기 렌즈부를 통과한 광 신호를 디지털 신호로 전환하는 이미지 센서를 포함하는 카메라;인스트럭션들을 저장하는 메모리; 및적어도 하나의 프로세서를 포함하고,상기 이미지 센서는 복수개의 수광 소자들, 복수개의 마이크로 렌즈들 및 복수개의 색상 채널들을 포함하는 색상 필터를 포함하며,상기 복수개의 수광 소자들은 M x N 배열로 하나의 제1 마이크로 렌즈에 대응되도록 배치된 복수개의 포토 다이오드들을 포함하고, M 또는 N 중 적어도 하나는 2 이상의 자연수이며,상기 적어도 하나의 프로세서는, 상기 인스트력션들을 실행 시에:상기 카메라를 이용하여 촬영할 영상의 해상도에 상응하는 촬영 모드를 결정하고,상기 결정된 촬영 모드가 제1 해상도에 상응하는 것에 기초하여, 상기 복수개의 포토 다이오드들 중 하나의 포토 다이오드에 상응하는 제1 수광 소자의 출력이 하나의 픽셀에 대응되도록 독출된 제1 데이터에 상응하는 제1원시 영상 데이터를 출력하도록 상기 이미지 센서를 제어하고,상기 제1 원시 영상 데이터를 기계 학습을 통해서 생성된 모델에 입력한 결과에 기초하여 상기 제1 해상도에 상응하는 제1 이미지를 획득하고,상기 결정된 촬영 모드가 상기 제1 해상도보다 낮은 제2 해상도에 상응하는 것에 기초하여, 상기 복수개의 포토다이오드들 중 적어도 둘 이상의 포토 다이오드들에 상응하는 제2 수광 소자들의 출력이 하나의 픽셀에 대응되도록 독출된 제2 데이터에 대해 적어도 하나의 영상 처리를 수행하여 획득된 제2 원시 영상 데이터를 출력하도록 상기 이미지 센서를 제어하고,상기 제2 원시 영상 데이터에 대한 영상 신호 처리를 수행하여 상기 제2 해상도에 상응하는 제2 이미지를 획득하도록 구성된, 전자 장치."}
{"patent_id": "10-2023-0034783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 제1 원시 영상 데이터는 상기 독출된 데이터의 색상 순서(color order)가 유지된 데이터를 포함하는, 전자장치."}
{"patent_id": "10-2023-0034783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서,상기 이미지 센서는, 베이어 패턴을 가지도록 상기 제2 데이터의 색상 순서를 변경하는 리모자이크 처리를 수행하여 상기 제2 원시 영상 데이터를 출력하도록 구성된, 전자 장치."}
{"patent_id": "10-2023-0034783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 2에 있어서,상기 이미지 센서는, 상기 카메라의 줌 배율 또는 상기 렌즈부의 초점 위치 중 적어도 하나에 기초하여 상기 제1 데이터를 교정하여 상기 제1 원시 영상 데이터를 출력하도록 구성된, 전자 장치."}
{"patent_id": "10-2023-0034783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2024-0120602-3-청구항 4에 있어서,상기 이미지 센서는, 상기 복수개의 포토 다이오드들에 대한 광의 분배 비율을 보상하여 상기 제1 데이터를 교정하도록 구성된, 전자 장치."}
{"patent_id": "10-2023-0034783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 1에 있어서,상기 전자 장치는 디스플레이를 더 포함하고,상기 적어도 하나의 프로세서는, 상기 인스트력션들을 실행 시에:상기 카메라를 이용하여 영상을 촬영하기 위한 카메라 어플리케이션을 실행하고,상기 실행된 카메라 어플리케이션에 기초하여 상기 해상도를 선택하기 위한 사용자 인터페이스를 포함하는 화면을 상기 디스플레이를 통해서 표시하며,상기 사용자 인터페이스에 기초하여 수신된 사용자 입력에 기초하여 결정된 촬영 모드에 기초하여 상기 이미지센서를 제어하도록 구성된, 전자 장치."}
{"patent_id": "10-2023-0034783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 1에 있어서,상기 이미지 센서의 상기 복수개의 마이크로 렌즈들은 상기 제1 마이크로 렌즈를 포함하는 네 개의 제2 마이크로 렌즈들이 상기 색상 필터 내의 하나의 색상 채널에 상응하도록 배치되고,상기 적어도 하나의 프로세서는, 상기 인스트력션들을 실행 시에:상기 결정된 촬영 모드가 상기 제2 해상도보다 낮은 제3 해상도에 상응하는 것에 기초하여, 상기 복수개의 수광소자들 중 상기 하나의 색상 채널에 상응하도록 배치된 포토 다이오드들에 상응하는 제3 수광 소자들의 출력이이미지의 하나의 픽셀에 대응되도록 독출된 제3 데이터에 대해 적어도 하나의 영상 처리를 수행하여 제3 원시데이터를 출력하도록 상기 이미지 센서를 제어하고,상기 제3 원시 영상 데이터에 대한 영상 처리 신호를 수행하여 상기 제3 해상도에 상응하는 제3 이미지를 획득하도록 구성된, 전자 장치."}
{"patent_id": "10-2023-0034783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 1에 있어서,상기 적어도 하나의 프로세서는, 상기 인스트력션들을 실행 시에:상기 결정된 촬영 모드가 상기 제1 해상도에 상응하는 동안 상기 영상 촬영과 연관된 상황에 대한 정보를 획득하고,상기 상황에 대한 정보가 지정된 상황에 상응하는 것에 기초하여, 상기 제1 원시 영상 데이터에 대한 영상 신호처리를 수행하여 상기 제1 이미지를 출력하고,상기 상황에 대한 정보가 상기 지정된 상황에 상응하지 않는 것에 기초하여, 상기 제1 원시 영상 데이터를 기계학습을 통해서 생성된 모델에 입력한 결과에 기초하여 상기 제1 해상도에 상응하는 제1 이미지를 획득하도록 구성된, 전자 장치."}
{"patent_id": "10-2023-0034783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 8에 있어서,상기 지정된 상황은 조도가 임계치 미만인 제1 상황, 촬영된 영상이 디포커스된 제2 상황, 또는 영상에 포함된고주파 성분이 임계치 미만인 제3 상황 중 적어도 하나를 포함하고,상기 제1 원시 영상 데이터에 대한 영상 신호 처리는 상기 제1 원시 영상 데이터의 픽셀들에 대한 비닝(binning) 처리 과정 또는 상기 제1 원시 영상 데이터의 패턴을 베이어 패턴으로 변환하는 리모자이크 과정 및공개특허 10-2024-0120602-4-이미지를 확대하는 업스케일링 과정을 포함하는, 전자 장치."}
{"patent_id": "10-2023-0034783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "이미지 센서를 포함하는 카메라를 포함하는 전자 장치를 동작하는 방법에 있어서,상기 이미지 센서는 M x N 배열로 하나의 제1 마이크로 렌즈에 대응되도록 배치된 복수개의 포토 다이오드들을포함하는 복수개의 수광 소자들을 포함하고, M 또는 N 중 적어도 하나는 2 이상의 자연수이며,상기 카메라를 이용하여 촬영할 영상의 해상도에 상응하는 촬영 모드를 결정하는 동작;상기 결정된 촬영 모드가 제1 해상도에 상응하는 것에 기초하여, 상기 복수개의 포토 다이오드들 중 하나의 포토 다이오드에 상응하는 제1 수광 소자의 출력이 하나의 픽셀에 대응되도록 독출된 제1 데이터에 상응하는 제1원시 영상 데이터를 출력하도록 상기 이미지 센서를 제어하는 동작;상기 제1 원시 영상 데이터를 기계 학습을 통해서 생성된 모델에 입력한 결과에 기초하여 상기 제1 해상도에 상응하는 제1 이미지를 획득하는 동작; 상기 결정된 촬영 모드가 상기 제1 해상도보다 낮은 제2 해상도에 상응하는 것에 기초하여, 상기 복수개의 포토다이오드들 중 적어도 둘 이상의 포토 다이오드들에 상응하는 제2 수광 소자들의 출력이 하나의 픽셀에 대응되도록 독출된 제2 데이터에 대해 적어도 하나의 영상 처리를 수행하여 획득된 제2 원시 영상 데이터를 출력하는동작; 및상기 제2 원시 영상 데이터에 대한 영상 신호 처리를 수행하여 상기 제2 해상도에 상응하는 제2 이미지를 획득하는 동작을 포함하는, 방법."}
{"patent_id": "10-2023-0034783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 10에 있어서,상기 제1 원시 영상 데이터는 상기 독출된 데이터의 색상 순서가 유지된 데이터를 포함하는, 방법."}
{"patent_id": "10-2023-0034783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 11에 있어서,상기 제2 원시 영상 데이터를 출력하는 동작은,상기 이미지 센서가 베이어 패턴을 가지도록 상기 제2 데이터의 색상 순서를 변경하는 리모자이크 처리를 수행하여 상기 제2 원시 영상 데이터를 획득하는 동작을 포함하는, 방법."}
{"patent_id": "10-2023-0034783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 11에 있어서,상기 제1 원시 영상 데이터를 출력하는 동작은,상기 이미지 센서가 상기 카메라의 줌 배율 또는 초점 위치 중 적어도 하나에 기초하여 상기 제1 데이터를 교정하는 동작을 포함하는, 방법."}
{"patent_id": "10-2023-0034783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 13에 있어서,상기 제1 데이터를 교정하는 동작은, 상기 포토 다이오드들에 대한 광의 분배 비율을 보상하는 동작을포함하는, 방법."}
{"patent_id": "10-2023-0034783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "청구항 10에 있어서,상기 촬영 모드를 결정하는 동작은,상기 카메라를 이용하여 영상을 촬영하기 위한 카메라 어플리케이션을 실행하는 동작,공개특허 10-2024-0120602-5-상기 실행된 카메라 어플리케이션에 기초하여 상기 해상도를 선택하기 위한 사용자 인터페이스를 포함하는 화면을 디스플레이하는 동작, 및상기 사용자 인터페이스에 기초하여 수신된 사용자 입력에 기초하여 촬영 모드를 결정하는 동작을 포함하는, 방법."}
{"patent_id": "10-2023-0034783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "청구항 10에 있어서,상기 방법은,상기 결정된 촬영 모드가 상기 제2 해상도보다 낮은 제3 해상도에 상응하는 것에 기초하여, 상기 이미지 센서의색상 필터에 포함된 하나의 색상 채널에 상응하도록 배치된 복수개의 포토 다이오드들에 상응하는 제3 수광 소자들의 출력이 하나의 픽셀에 대응되도록 독출된 제3 데이터에 기초하여 제3 원시 데이터를 출력하는 동작; 및상기 제3 원시 영상 데이터에 대한 영상 처리 신호를 수행하여 상기 제3 해상도에 상응하는 제3 이미지를 획득하는 동작을 더 포함하는, 방법."}
{"patent_id": "10-2023-0034783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "청구항 10에 있어서,상기 제1 이미지를 획득하는 동작은,상기 영상 촬영과 연관된 상황에 대한 정보를 획득하는 동작,상기 상황에 대한 정보가 지정된 상황에 상응하는 것에 기초하여, 상기 제1 원시 영상 데이터에 대한 영상 신호처리를 수행하여 상기 제1 이미지를 획득하는 동작, 및상기 상황에 대한 정보가 상기 지정된 상황에 상응하지 않는 것에 기초하여, 상기 제1 원시 영상 데이터를 기계학습을 통해서 생성된 모델에 입력한 결과에 기초하여 상기 제1 해상도에 상응하는 제1 이미지를 획득하는 동작을 포함하는, 방법."}
{"patent_id": "10-2023-0034783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "청구항 17에 있어서,상기 지정된 상황은 조도가 임계치 미만인 제1 상황, 촬영된 영상이 디포커스된 제2 상황, 또는 영상에 포함된고주파 성분이 임계치 미만인 제3 상황 중 적어도 하나를 포함하고,상기 제1 원시 영상 데이터에 대한 영상 신호 처리는 상기 제1 원시 영상 데이터의 픽셀들에 대한 비닝(binning) 처리 과정 또는 상기 제1 원시 영상 데이터의 패턴을 베이어 패턴으로 변환하는 리모자이크 과정 및이미지를 확대하는 업스케일링 과정을 포함하는, 방법."}
{"patent_id": "10-2023-0034783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "이미지 센서에 있어서,복수개의 수광 소자들;복수개의 마이크로 렌즈들; 및복수개의 색상 채널들을 포함하는 색상 필터를 포함하며,상기 복수개의 수광 소자들은 M x N 배열로 하나의 제1 마이크로 렌즈에 대응되도록 배치된 복수개의 포토 다이오드들을 포함하고, M 또는 N 중 적어도 하나는 2 이상의 자연수이며,상기 이미지 센서는:제1 해상도에 상응하는 제1 촬영 모드에 기초하여 동작하는 동안, 상기 복수개의 포토 다이오드들 중 하나의 포토 다이오드에 상응하는 제1 수광 소자의 출력이 하나의 픽셀에 대응되도록 독출된 제1 데이터에 상응하는 제1원시 영상 데이터를 출력하고,공개특허 10-2024-0120602-6-상기 제1 해상도보다 낮은 제2 해상도에 상응하는 제2 촬영 모드에 기초하여 동작하는 동안, 상기 복수개의 포토 다이오드들 중 적어도 둘 이상의 포토 다이오드들에 상응하는 제2 수광 소자들의 출력이 하나의 픽셀에 대응되도록 독출된 제2 데이터에 대해 적어도 하나의 영상 처리를 수행하여 획득된 제2 원시 영상 데이터를 출력하도록 구성된, 이미지 센서."}
{"patent_id": "10-2023-0034783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "청구항 19에 있어서,상기 제1 원시 영상 데이터는 상기 독출된 데이터의 색상 순서가 유지된 데이터를 포함하는, 전자 장치."}
{"patent_id": "10-2023-0034783", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "다양한 실시예들에 따른 전자 장치(electronic device)는 이미지 센서를 포함하는 카메라, 명령어들을 저장하는 메모리, 및 상기 통신 회로, 및 상기 메모리와 작동적으로 연결된 프로세서를 포함하고, 상기 프로세서는, 선택 된 촬영 모드에 따라서 영상 데이터를 출력하도록 이미지 센서를 제어하고, 촬영 모드에 따라서 출력된 영상 데 이터를 기계 학습된 모델에 기초하여 처리하거나 영상 신호 처리를 수행하여 이미지를 획득하도록 구성될 수 있 다. 그 외에도 다양한 실시 예들이 가능할 수 있다."}
{"patent_id": "10-2023-0034783", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 이미지 센서를 통해서 이미지를 획득하는 전자 장치 및 그 동작 방법에 관한 것이다."}
{"patent_id": "10-2023-0034783", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전자 장치는 광 신호를 전기적 신호로 변환하는 이미지 센서의 출력으로부터 이미지 데이터를 획득할 수 있다. 이미지 센서는 색상 필터와 수광 소자를 포함할 수 있다. 수광 소자는 특정 색상에 상응하는 색상 필터를 통과 한 광을 수신하고, 수신된 광에 상응하는 전기적 신호를 출력할 수 있다. 전자 장치는 이미지 센서에서 출력되 는 값에 기초하여 결정되는 화소 값들의 집합을 포함하는 이미지 데이터를 획득할 수 있다. 이미지 데이터의 화질은 이미지 데이터에 포함된 화소들의 수에 영향을 받으며, 보다 높은 화질을 가지는 이미지 데이터를 획득 하기 위해 높은 화소 개수를 가지는 이미지 데이터를 획득하기 위한 장치 및 방법들이 개발되고 있다. 수광 소자는 특정 색상의 색상 필터를 투과한 광을 수신하므로 하나의 수광 소자를 통해서 검출된 정보는 한 개 의 색상에 대응된다. 색상 필터는 최종적으로 획득되는 이미지가 색상을 표현할 수 있도록 하는 역할을 하나, 최종적으로 획득된 이미지가 이미지 센서에 배치된 전체 수광 소자의 수보다 낮은 해상도로 표현되도록 하는 원 인이 될 수 있다. 색상의 재현과 해상도는 서로 상충하는 (trade off) 관계에 놓일 수 있다. 해상도 감소를 줄이면서도 색상을 정확하게 재현하기 위한 패턴으로 베이어 패턴(bayer pattern)이 널리 사용되어 왔다. 상술한 정보는 본 개시에 대한 이해를 돕기 위한 목적으로 하는 배경 기술(related art)로 제공될 수 있다. 상 술한 내용 중 어느 것도 본 개시와 관련하여 종래 기술(prior art)로서 적용될 수 있는지에 관해서는 어떠한 주 장이나 결정이 제기되지 않는다."}
{"patent_id": "10-2023-0034783", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시예에서, 전자 장치는 렌즈부 및 상기 렌즈부를 통과한 광 신호를 디지털 신호로 전환하는 이미지 센서를 포함하는 카메라; 인스트럭션들을 저장하는 메모리; 및 적어도 하나의 프로세서를 포함할 수 있다. 상기 이미 지 센서는 복수개의 수광 소자들, 복수개의 마이크로 렌즈들 및 복수개의 색상 채널들을 포함하는 색상 필터를 포함할 수 있다. 상기 복수개의 수광 소자들은 M x N 배열로 하나의 제1 마이크로 렌즈에 대응되도록 배치된 복수개의 포토 다이오드들을 포함할 수 있다. M 또는 N 중 적어도 하나는 2 이상의 자연수일 수 있다. 상기 적어도 하나의 프로세서는, 상기 인스트력션들을 실행 시에, 상기 카메라를 이용하여 촬영할 영상의 해상도에 상응하는 촬영 모드를 결정하도록 구성될 수 있다. 상기 적어도 하나의 프로세서는, 상기 인스트력션들을 실행 시에, 상기 결정된 촬영 모드가 제1 해상도에 상응하는 것에 기초하여, 상기 복수개의 포토 다이오드들 중 하나 의 포토 다이오드에 상응하는 제1 수광 소자의 출력이 하나의 픽셀에 대응되도록 독출된 제1 데이터에 상응하는 제1 원시 영상 데이터를 출력하도록 상기 이미지 센서를 제어하도록 구성될 수 있다. 상기 적어도 하나의 프로 세서는, 상기 인스트력션들을 실행 시에, 상기 제1 원시 영상 데이터를 기계 학습을 통해서 생성된 모델에 입력 한 결과에 기초하여 상기 제1 해상도에 상응하는 제1 이미지를 획득하도록 구성될 수 있다. 상기 적어도 하나 의 프로세서는, 상기 인스트력션들을 실행 시에, 상기 결정된 촬영 모드가 상기 제1 해상도보다 낮은 제2 해상도에 상응하는 것에 기초하여, 상기 복수개의 포토 다이오드들 중 적어도 둘 이상의 포토 다이오드에 상응하는 제2 수광 소자들의 출력이 하나의 픽셀에 대응되도록 독출된 제2 데이터에 대해 적어도 하나의 영상 처리를 수 행하여 획득된 제2 원시 영상 데이터를 출력하도록 상기 이미지 센서를 제어할 수 있다. 상기 제2 원시 영상 데이터에 대한 영상 신호 처리를 수행하여 상기 제2 해상도에 상응하는 제2 이미지를 획득하도록 구성될 수 있 다. 일 실시예에 따라 이미지 센서를 포함하는 카메라를 포함하는 전자 장치를 동작하는 방법은, 상기 카메라를 이 용하여 촬영할 영상의 해상도에 상응하는 촬영 모드를 결정하는 동작을 포함할 수 있다. 상기 방법은 상기 결정 된 촬영 모드가 제1 해상도에 상응하는 것에 기초하여, 상기 이미지 센서의 복수개의 포토 다이오드들 중 하나 의 포토 다이오드에 상응하는 제1 수광 소자의 출력이 하나의 픽셀에 대응되도록 독출된 제1 데이터에 상응하는 제1 원시 영상 데이터를 출력하도록 상기 이미지 센서를 제어하는 동작을 포함할 수 있다. 상기 방법은, 상기 제1 원시 영상 데이터를 기계 학습을 통해서 생성된 모델에 입력한 결과에 기초하여 상기 제1 해상도에 상응하 는 제1 이미지를 획득하는 동작을 포함할 수 있다. 상기 방법은, 상기 결정된 촬영 모드가 상기 제1 해상도보 다 낮은 제2 해상도에 상응하는 것에 기초하여, 상기 복수개의 포토 다이오드들 중 적어도 둘 이상의 포토 다이 오드에 상응하는 제2 수광 소자들의 출력이 하나의 픽셀에 대응되도록 독출된 제2 데이터에 대해 적어도 하나의 영상 처리를 수행하여 획득된 제2 원시 영상 데이터를 출력하는 동작을 포함할 수 있다. 상기 방법은, 상기 제 2 원시 영상 데이터에 대한 영상 신호 처리를 수행하여 상기 제2 해상도에 상응하는 제2 이미지를 획득하는 동 작을 포함할 수 있다. 상기 이미지 센서는 M x N 배열로 하나의 제1 마이크로 렌즈에 대응되도록 배치된 복수 개의 포토 다이오드들을 포함하는 복수개의 수광 소자들을 포함할 수 있다. M 또는 N 중 적어도 하나는 2 이상 의 자연수일 수 있다. 일 실시예에 따른 이미지 센서는, 복수개의 수광 소자들; 복수개의 마이크로 렌즈들; 및 복수개의 색상 채널들 을 포함하는 색상 필터를 포함할 수 있다. 상기 복수개의 수광 소자들은 M x N 배열로 하나의 제1 마이크로 렌 즈에 대응되도록 배치된 복수개의 포토 다이오드들을 포함할 수 있다. M 또는 N 중 적어도 하나는 2 이상의 자 연수일 수 있다. 상기 이미지 센서는, 제1 해상도에 상응하는 제1 촬영 모드에 기초하여 동작하는 동안, 상기 복수개의 포토 다이오드들 중 하나의 포토 다이오드에 상응하는 제1 수광 소자의 출력이 하나의 픽셀에 대응되 도록 독출된 제1 데이터에 상응하는 제1 원시 영상 데이터를 출력하도록 구성될 수 있다. 상기 이미지 센서는, 상기 제1 해상도보다 낮은 제2 해상도에 상응하는 제2 촬영 모드에 기초하여 동작하는 동안, 상기 복수개의 포 토 다이오드들 중 적어도 둘 이상의 포토 다이오드들에 상응하는 제2 수광 소자들의 출력이 하나의 픽셀에 대응 되도록 독출된 제2 데이터에 대해 적어도 하나의 영상 처리를 수행하여 획득된 제2 원시 영상 데이터를 출력하 도록 구성될 수 있다. 일 실시예에 따른 컴퓨터로 판독 가능한 비일시적 기록매체는, 전자 장치가 실행 시에 상술한 방법을 수행하도 록 하는 컴퓨터 프로그램을 기록한 것일 수 있다."}
{"patent_id": "10-2023-0034783", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시에서, '픽셀'이라 함은 디지털 영상을 구성하는 최소 단위를 의미할 수 있다. 영상의 해상도는 그 영상 에 포함된 픽셀의 수로 나타낼 수 있다. 예를 들어, 영상이 a개의 행들과 b 개의 열들로 배열된 a x b 개의 픽 셀들로 구성된 경우, 영상의 해상도가 a x b 라고 지시될 수 있다. 도 1은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네 트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워크)를 통하여 전자 장 치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장치 또 는 서버 중 적어도 하나와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 서버를 통하여 전 자 장치와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈 , 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스, 연 결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈, 가입 자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장치에는, 이 구 성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어 떤 실시예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세서 는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메 모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메 모리에 저장할 수 있다. 일실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또 는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처 리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서 를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능에 특 화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있 다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구 성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일실시예에 따르면, 보조 프로 세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능 모델이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi- supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있 다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상 기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일실시예 에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일실시예에 따르면, 인터페이스는, 예 를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터 페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일실시예에 따르면, 카메라 모듈은 하나 이상 의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일실시예에 따르면, 전력 관리 모듈 은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다.배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일실시예에 따르면, 배터리 는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일실시예에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워 크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수 의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입 자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같 은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이 상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링 크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이 루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일실시예에 따르면, 안테나 모듈은 복수의 안테나들 (예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모 듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품 (예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일실시예에 따르면, 전자 장치에서 실행되는 동작들의전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요 청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일실시예에 따르면, 외부의 전자 장치 또는 서버는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 본 문서에 개시된 다양한 실시예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되 지 않는다. 본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위 해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적 으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 다양한 실시예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함 할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부 가 될 수 있다. 예를 들면, 일실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형 태로 구현될 수 있다. 본 문서의 다양한 실시예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어 (예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것 을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형 태로 제공될 수 있다. 여기서, ‘비일시적’은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전 자기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경 우와 임시적으로 저장되는 경우를 구분하지 않는다. 일실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory(CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치들(예:스마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨 터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같 은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상 의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따르면, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동 작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다. 도 2는, 다양한 실시예들에 따른, 카메라 모듈을 예시하는 블럭도이다. 도 2를 참조하면, 카메라 모 듈은 렌즈 어셈블리, 플래쉬, 이미지 센서, 이미지 스태빌라이저, 메모리(예: 버퍼 메모리), 또는 이미지 시그널 프로세서를 포함할 수 있다. 렌즈 어셈블리는 이미지 촬영의 대상 인 피사체로부터 방출되는 빛을 수집할 수 있다. 렌즈 어셈블리는 하나 또는 그 이상의 렌즈들을 포함할 수 있다. 일실시예에 따르면, 카메라 모듈은 복수의 렌즈 어셈블리들을 포함할 수 있다. 이런 경우, 카메라 모듈은, 예를 들면, 듀얼 카메라, 360도 카메라, 또는 구형 카메라(spherical camera)를 형성할 수 있다. 복수의 렌즈 어셈블리들 중 일부는 동일한 렌즈 속성(예: 화각, 초점 거리, 자동 초점, f 넘버(f number), 또는 광학 줌)을 갖거나, 또는 적어도 하나의 렌즈 어셈블리는 다른 렌즈 어셈블리의 렌즈 속성들과 다른 하나 이상의 렌즈 속성들을 가질 수 있다. 렌즈 어셈블리는, 예를 들면, 광각 렌즈 또는 망원 렌즈를 포함할 수 있다. 플래쉬는 피사체로부터 방출 또는 반사되는 빛을 강화하기 위하여 사용되는 빛을 방출할 수 있다. 일실시 예에 따르면, 플래쉬는 하나 이상의 발광 다이오드들(예: RGB(red-green-blue) LED, white LED, infrared LED, 또는 ultraviolet LED), 또는 xenon lamp를 포함할 수 있다. 이미지 센서는 피사체로부터 방출 또는 반사되어 렌즈 어셈블리를 통해 전달된 빛을 전기적인 신호로 변환함으로써, 상기 피사체에 대응하는 이미 지를 획득할 수 있다. 일실시예에 따르면, 이미지 센서는, 예를 들면, RGB 센서, BW(black and white) 센 서, IR 센서, 또는 UV 센서와 같이 속성이 다른 이미지 센서들 중 선택된 하나의 이미지 센서, 동일한 속성을 갖는 복수의 이미지 센서들, 또는 다른 속성을 갖는 복수의 이미지 센서들을 포함할 수 있다. 이미지 센서(23 0)에 포함된 각각의 이미지 센서는, 예를 들면, CCD(charged coupled device) 센서 또는 CMOS(complementary metal oxide semiconductor) 센서를 이용하여 구현될 수 있다. 이미지 스태빌라이저는 카메라 모듈 또는 이를 포함하는 전자 장치의 움직임에 반응하여, 렌즈 어셈블리에 포함된 적어도 하나의 렌즈 또는 이미지 센서를 특정한 방향으로 움직이거나 이미지 센서 의 동작 특성을 제어(예: 리드 아웃(read-out) 타이밍을 조정 등)할 수 있다. 이는 촬영되는 이미지에 대 한 상기 움직임에 의한 부정적인 영향의 적어도 일부를 보상하게 해 준다. 일실시예에 따르면, 이미지 스태빌라 이저는, 일실시예에 따르면, 이미지 스태빌라이저은 카메라 모듈의 내부 또는 외부에 배치된 자 이로 센서(미도시) 또는 가속도 센서(미도시)를 이용하여 카메라 모듈 또는 전자 장치의 그런 움직임 을 감지할 수 있다. 일실시예에 따르면, 이미지 스태빌라이저는, 예를 들면, 광학식 이미지 스태빌라이저 로 구현될 수 있다. 메모리는 이미지 센서을 통하여 획득된 이미지의 적어도 일부를 다음 이미지 처 리 작업을 위하여 적어도 일시 저장할 수 있다. 예를 들어, 셔터에 따른 이미지 획득이 지연되거나, 또는 복수 의 이미지들이 고속으로 획득되는 경우, 획득된 원본 이미지(예: Bayer-patterned 이미지 또는 높은 해상도의 이미지)는 메모리에 저장이 되고, 그에 대응하는 사본 이미지(예: 낮은 해상도의 이미지)는 디스플레이 모 듈을 통하여 프리뷰될 수 있다. 이후, 지정된 조건이 만족되면(예: 사용자 입력 또는 시스템 명령) 메모리 에 저장되었던 원본 이미지의 적어도 일부가, 예를 들면, 이미지 시그널 프로세서에 의해 획득되어 처리될 수 있다. 일실시예에 따르면, 메모리는 메모리의 적어도 일부로, 또는 이와는 독립적으로 운 영되는 별도의 메모리로 구성될 수 있다. 이미지 시그널 프로세서는 이미지 센서을 통하여 획득된 이미지 또는 메모리에 저장된 이미지 에 대하여 하나 이상의 이미지 처리들을 수행할 수 있다. 상기 하나 이상의 이미지 처리들은, 예를 들면, 깊이 지도(depth map) 생성, 3차원 모델링, 파노라마 생성, 특징점 추출, 이미지 합성, 또는 이미지 보상(예: 노이즈감소, 해상도 조정, 밝기 조정, 블러링(blurring), 샤프닝(sharpening), 또는 소프트닝(softening)을 포함할 수 있다. 추가적으로 또는 대체적으로, 이미지 시그널 프로세서는 카메라 모듈에 포함된 구성 요소들 중 적어도 하나(예: 이미지 센서)에 대한 제어(예: 노출 시간 제어, 또는 리드 아웃 타이밍 제어 등)를 수 행할 수 있다. 이미지 시그널 프로세서에 의해 처리된 이미지는 추가 처리를 위하여 메모리에 다시 저장 되거나 카메라 모듈의 외부 구성 요소(예: 메모리, 디스플레이 모듈, 전자 장치, 전 자 장치, 또는 서버)로 제공될 수 있다. 일실시예에 따르면, 이미지 시그널 프로세서는 프로세 서의 적어도 일부로 구성되거나, 프로세서와 독립적으로 운영되는 별도의 프로세서로 구성될 수 있다. 이미지 시그널 프로세서이 프로세서과 별도의 프로세서로 구성된 경우, 이미지 시그널 프로세 서에 의해 처리된 적어도 하나의 이미지는 프로세서에 의하여 그대로 또는 추가의 이미지 처리를 거 친 후 디스플레이 모듈를 통해 표시될 수 있다. 일실시예에 따르면, 전자 장치는 각각 다른 속성 또는 기능을 가진 복수의 카메라 모듈들을 포함할 수 있다. 이런 경우, 예를 들면, 상기 복수의 카메라 모듈들 중 적어도 하나는 광각 카메라이고, 적어도 다른 하나는 망원 카메라일 수 있다. 유사하게, 상기 복수의 카메라 모듈들 중 적어도 하나는 전면 카메라 이고, 적어도 다른 하나는 후면 카메라일 수 있다. 도 3은 일 실시예에 따른 전자 장치의 구성을 도시한 블록도이다. 일 실시예에 따른 전자 장치는 적어도 하나의 프로세서(예: 도 1의 프로세서), 메모리(예: 도 1 의 메모리), 또는 카메라(예: 도 1 및 도 2의 카메라 모듈) 중 적어도 하나를 포함할 수 있다. 전자 장치는 디스플레이(예: 도 1의 디스플레이 모듈)를 더 포함할 수도 있다. 디스플 레이는 전자 장치에 전결된 외부 디스플레이로 대체될 수도 있다. 일 실시예에서, 카메라는 광을 집광하기 위한 적어도 하나의 렌즈를 포함하는 렌즈부 및 렌즈부(38 1)를 통과한 광 신호를 디지털 신호로 전환하는 이미지 센서를 포함할 수 있다. 일 실시예에 따른 이미지 센서는 복수개의 수광 소자들, 복수개의 마이크로 렌즈들 및 복수개의 색상 채널들을 포함하는 색상 필터 를 포함할 수 있다. 복수개의 수광 소자들은 M개의 행과 N개의 열을 가지는 배열로 하나의 마이크로 렌즈에 대 응되도록 배치된 포토 다이오드들을 포함할 수 있다. 여기서, M 및 N은 각각 2 이상의 자연수일 수 있다. 일 실시예에서, 메모리는 적어도 하나의 프로세서에 의해서 실행될 수 있는 인스트럭션들 (instructions)을 저장할 수 있다. 적어도 하나의 프로세서는 메모리에 저장된 인스트럭션들을 실행 하여 연산을 수행하거나 전자 장치의 구성요소를 제어함으로써 전자 장치가 동작하도록 할 수 있다. 본 개시에서, 전자 장치의 동작은 적어도 하나의 프로세서가 인스트럭션들을 실행 시에 수행되는 것으로 이해될 수 있다. 일 실시예에서, 적어도 하나의 프로세서는 중앙 처리 장치(central processing unit, CPU), 이미지 시그널 프로세서(image signal processor, ISP)(예: 도 2의 이미지 시그널 프로세서 ), 그래픽 처리부(graphical processing unit, GPU), 또는 신경 처리 장치(neural processing unit, NPU) 중 적어도 하나를 포함할 수 있다. 예를 들어, 적어도 하나의 프로세서는 어플리케이션 프로세서를 포함할 수 있다. 일 실시예에서, 적어도 하나의 프로세서는, 카메라를 이용하여 촬영할 영상의 해상도에 상응하는 촬 영 모드를 결정할 수 있다. 예를 들어, 적어도 하나의 프로세서는 제1 해상도에 상응하는 제1 촬영 모드 또는 제2 해상도에 상응하는 제2 촬영 모드 중에서 어느 하나를 선택할 수 있다. 제1 촬영 모드는 제2 촬영 모 드보다 고해상도의 영상을 생성하는 촬영 모드일 수 있다. 예를 들어, 제1 해상도는 200 Mp (mega pixel)이고, 제2 해상도는 50 Mp 또는 12.5 Mp 중 어느 하나일 수 있다. 촬영 모드의 종류는 이에 한정되지 아니하며, 이미 지 센서의 구성에 따라 달라질 수 있다. 예를 들어, 적어도 하나의 프로세서는 제1 해상도에 상응하는 제 1 촬영 모드, 제2 해상도에 상응하는 제2 촬영 모드, 또는 제3 해상도에 상응하는 제3 촬영 모드 중에서 어느 하나를 선택할 수 있다. 여기서, 제1 해상도는 200 Mp이고, 제2 해상도는 50 Mp이고, 제3 해상도는 12.5 Mp일 수 있다. 일 실시예에서, 적어도 하나의 프로세서가 선택할 수 있는 촬영 모드의 수는 이보다 많을 수도 있다. 일 실시예에서, 적어도 하나의 프로세서는 이미지 센서가 선택된 촬영 모드에 기초하여 동작하도록 제어할 수 있다. 예를 들어, 이미지 센서는 제1 촬영 모드에 기초하여 복수개의 수광소자들 각각의 출력 이 하나의 픽셀에 대응되도록 독출(readout)된 제1 데이터에 상응하는 제1 원시(raw) 영상 데이터를 출력할 수 있다. 제1 원시 영상 데이터가 제1 데이터에 상응한다 함은 제1 원시 영상 데이터의 하나의 픽셀의 픽셀 값이 하나의 포토 다이오드에 상응하는 수광 소자로부터 독출된 값에 기초하여 결정된 것으로 이해될 수 있다. 이미지 센서는 카메라(예: 도 1의 카메라 모듈, 도 3의 카메라)의 줌 배율 또는 렌즈부(예: 도 3의 렌즈부)의 초점 위치 중 적어도 하나에 기초하여 제1 데이터를 교정하여(calibrate) 제1 원시 영상 데이터 를 출력할 수 있다. 이미지 센서는 제1 데이터를 교정하는 동작은 제1 데이터를 교정하여 피사체로부터 기인한 데이터의 편차 외의 다른 요인으로 인한 편차를 제거하기 위해 픽셀을 보상하는 동작을 포함할 수 있다. 이미지 센서는 제1 데이터를 교정하기 위해 미리 정해진 룩-업 테이블(look-up table)에 기초하여 제1 데 이터를 정적(static)으로 보상하거나, 주변 픽셀의 정보에 기초하여 제1 데이터를 동적으로 보정할 수 있다. 예를 들어, 헥사데카(hexadeca) 패턴을 가지는 이미지 센서는 4PD 구조, 테트라(tetra) 패턴, 청색 채널과 같은 라인에 배치된 녹색 채널과 적색 채널과 같은 라인에 배치된 녹색 채널 간에 발생하는 차이(Gb-Gr diff)로 인한 교정이 요구될 수 있다. 본 개시에서, 헥사데카 패턴은 동일한 색상 채널에 상응하도록 배치된 네 개의 마이크로렌즈들이 인접하여 배치되고, 하나의 마이크로 렌즈에 상응하도록 네 개의 포토 다이오드들이 배치되는 패턴이 반복되어 있는 것을 의미할 수 있다. 다른 색상의 동일한 마이크로 렌즈 및 포토 다이오드 패턴과 인접 하도록 배치된 어레이 형태로 구성될 수 있다. 본 개시에서, 4PD 구조는 하나의 마이크로 렌즈에 상응하도록 네 개의 포토 다이오드들이 배치되는 패턴을 의미할 수 있다. 본 개시에서, 테트라 패턴은 동일한 색상 채널에 상응하도록 배치된 네 개의 마이크로렌즈들이 인접하도록 배치되는 패턴이 반복되어 있는 것을 의미할 수 있다. 다른 색상의 동일한 마이크로 렌즈 및 포토 다이오드 패턴과 인접하도록 배치된 어레이 형태로 구성될 수 있다. 다만, 이는 복수개의 수광 소자들이 하나의 마이크로 렌즈에 대응되도록 배치된 예시를 설명하기 위한 것으로서, 이에 한정되지 아니한다. 일 실시예에서, 제1 촬영 모드에서 출력되는 제1 원시 영상 데이터는 적어도 하나의 프로세서(예, ISP)가 영상 신호 처리를 수행하기 위한 영상 처리가 수행되지 않은 데이터일 수 있다. 예를 들어, 제1 원시 영상 데 이터는 수광 소자들로부터 독출된 값들에 대해 리모자이크를 수행하지 않은 데이터일 수 있다. 즉, 제1 원시 영상 데이터는 이미지 센서의 색상 패턴이 가지는 색상 순서(color order)가 변경되지 않음으로써 색상 패 턴이 유지된 데이터일 수 있다. 일 실시예에서, 동일한 색상 채널에 대응되도록 배치된 마이크로 렌즈들이 서로 인접하여 배치되고, 하나의 마 이크로 렌즈에 복수개의 포토 다이오드들이 배치된 패턴을 가지는 이미지 센서가, 하나의 포토다이오드의 출력 을 하나의 픽셀에 대응시켜 출력하는 경우 리모자이크 동작을 통해서 원하는 품질의 이미지를 얻기 어렵다. 따 라서, 이 경우에는 일 실시예에 따른 전자 장치는 기계 학습을 이용하여 이미지를 생성할 수 있다. 일 실시예에서, 적어도 하나의 프로세서는 이미지 센서에서 출력된 제1 원시 영상 데이터를 이미지 센서와 적어도 하나의 프로세서를 연결하는 인터페이스(예: MIPI 프로토콜에 기반한 인터페이스)를 통해서 수신할 수 있다. 적어도 하나의 프로세서는 제1 원시 영상 데이터를 예측 모델에 입력할 수 있다. 예를 들어, 전자 장치에 포함된 CPU, GPU, NPU, ISP 또는 주변장치 중 적어도 하나를 이용하여 예측 모델 에 상응하는 신경망 연산을 수행할 수 있다. 예를 들어, 예측 모델은 예상되는 원시 영상 데이터(input image) 와, 이 원시 영상 데이터(input image)로부터 얻기를 원하는 결과물에 상응하는 이미지(ground truth(GT) image)를 학습하여 생성된 것일 수 있다. 이 경우 적어도 하나의 프로세서는 예측 모델에 제1 원시 영상 데이터를 입력하여 연산을 수행하여 예측 모델의 출력으로써 제1 이미지를 획득할 수 있다. 예를 들어, 예측 모델은 원시 영상 데이터와 원시 영상 데이터에 상응하는 베이어 패턴의 영상 데이터를 학습하여 생성된 것일 수 있다. 이 경우 적어도 하나의 프로세서는 예측 모델에 제1 원시 영상 데이터를 입력하여 리모자이크를 수행한 결과에 상응하는 베이어 패턴의 영상 데이터를 획득할 수 있다. 적어도 하나의 프로세서(예: ISP)(32 0)는 베이어 패턴의 영상 데이터에 대한 영상 처리(예: 디모자이크(demosaic))를 수행하여 제1 이미지를 획득할 수 있다. 복수개의 수광 소자들(예: 포토 다이오드들)이 하나의 마이크로 렌즈에 대응되도록 배치된 이미지 센 서의 경우 고해상도 모드로 독출된 원시 영상 데이터에 대해 기계학습이 아닌 처리 회로(예: ISP chain)을 통해 리모자이크 연산을 수행하는 경우 아티팩트가 제거되지 않고 MTF(modulation transfer function)값이 낮은 결과 가 출력될 수 있다. 그러나 기계 학습된 예측 모델을 이용하여 원시 영상 데이터로부터 이미지를 획득하는 경 우, 아티팩트가 감소되고 높은 MTF 값을 가지는 이미지가 획득될 수 있다. 일 실시예에서, 예측 모델의 출력은 다양하게 구현될 수 있다. 예를 들어, 예측 모델의 출력은 각종 필터나 이 미지 강화를 위한 후처리 과정을 완료한 RGB 도메인의 제1 이미지를 포함할 수 있다. 이 경우, 예측 모델은 원 시 영상 데이터와 원시 영상 데이터로부터 RGB 도메인의 이미지를 기계 학습 알고리즘을 통해서 학습하여 생성 된 것일 수 있다. 예를 들어, 예측 모델의 출력은 후처리 과정을 거치기 전의 데이터에 해당하는 YUV(Y Cb Cr) 영상을 포함할 수 있다. 이 경우, 예측 모델은 원시 영상 데이터와 원시 영상 데이터로부터 YUV 도메인의 이미 지를 기계 학습 알고리즘을 통해서 학습하여 생성된 것일 수 있다. 예를 들어, 예측 모델의 출력은 원시 영상데이터를 베이어 패턴으로 변환한 결과를 포함할 수 있다. 디모자이크(demosaic)의 후처리 과정(예: 화이트 밸 런스(white balance), 감마 보정(gamma correction), 색상 보정(color correction), 노이즈 저감(noise reduction), 샤프닝(sharpening))에 상응하는 연산은 예측 모델에 포함되지 않을 수 있으나, 디모자이크 (demosaic)에 상응하는 과정은 예측 모델에 의해 수행되는 것이 요구될 수 있다. 일 실시예에서, 이미지 센서는 제2 촬영 모드에 기초하여 복수개의 포토 다이오드들 중 둘 이상의 포토 다 이오드에 상응하는 수광 소자들의 출력이 하나의 픽셀에 대응되도록 독출된 제2 데이터에 상응하는 제2 원시 영 상 데이터를 출력할 수 있다. 예를 들어, 둘 이상의 수광 소자의 출력 값을 비닝(binning)하거나 출력된 값을 합산(sum)한 값에 기초하여 상기 제2 원시 영상 데이터의 하나의 픽셀 값을 구성할 수 있다. 제2 촬영 모드에 서 출력되는 제2 원시 영상 데이터는 적어도 하나의 영상 처리가 수행된 것일 수 있다. 예를 들어, 제2 원시 영상 데이터는 수광 소자들로부터 독출된 값들에 대해 리모자이크를 수행한 결과에 대응될 수 있다. 예를 들어 제2 원시 영상 데이터는 베이어 패턴을 가지는 영상 데이터일 수 있다. 일 실시예에서, 적어도 하나의 프로세서는 이미지 센서에서 출력된 제2 원시 영상 데이터를 이미지 센서와 적어도 하나의 프로세서를 연결하는 인터페이스를 통해서 수신할 수 있다. 적어도 하나의 프 로세서(예: ISP)는 제2 원시 영상 데이터에 대한 적어도 하나의 영상 신호 처리(예: 화이트 밸런스(white balance), 디모자이크(demosaic), 감마 보정(gamma correction), 색상 보정(color correction), 노이즈 저감 (noise reduction), 샤프닝(sharpening))를 수행하여 제2 이미지를 획득할 수 있다. 도 4는 일 실시예에 따른 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이미지 센서)의 구성을 개념 적으로 도시한 도면이다. 일 실시예에서, 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이미지 센서)는 마이크로 렌즈 배열 (micro lens array, MLA), 색상 필터(color filter), 수광부 및 연산부를 포함할 수 있다. 일 실시예에서, 마이크로 렌즈 배열은 렌즈부(예: 도 3의 렌즈부)를 통과하여 이미지 센서(예: 도 2 의 이미지 센서, 도 3의 이미지 센서)에 상을 맺는 빛 다발이 수광부의 수광 소자에 모아 지도록 구성될 수 있다. 마이크로 렌즈 배열을 통과한 빛 다발들은 색상 필터를 지나면서 특정 색상에 대응되는 대역 이외의 파장이 적어도 일부 차단될 수 있다. 색상 필터를 통과한 빛 다발들은 수광부의 수광 소자(예: 포토 다이오드)에 의해 감지될 수 있다. 수광부는 빛을 수신하면 전하를 생 성하여 전기적 신호로 변환하는 수광 소자와 수광 소자의 전하를 선택적으로 독출하는 회로를 포함할 수 있다. 수광부와 연산부 사이에는 수광부에서 독출된 신호를 디지털화하거나 노이즈를 저감시키기 위한 회로가 배치될 수 있다. 일 실시예에서, 연산부는 수광부에서 출력된 전기적 데이터를 가공하는 연산을 수행할 수 있다. 연산부는 연산 결과에 기초하여 획득된 데이터를 출력할 수 있다. 연산부의 출력은 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이미지 센서)의 출력이 될 수 있다. 일 실시예에서, 연산부는 전 기적 데이터를 가공하는 연산으로서 독출된 데이터를 교정(calibrate)하는 동작을 수행할 수 있다. 예를 들어, 연산부가 수행하는 연산은 광학적인 비대칭이나 센서의 상대적인 위치로 인한 픽셀 간의 편차를 줄 이는 연산, 아날로그 신호에서 발생한 잡음(noise)를 저감하는 연산, 결함(defect)을 제거하는 연산, 리모자이 크를 수행하는 연산, 또는 특정 응용분야(예: 근접 센서 기능, 타이밍 조절 기능, HDR 톤 매핑 기능)에 따른 연 산 중 적어도 하나를 포함할 수 있다. 연산부에서 출력된 센서 출력은 인터페이스를 통해서 적어도 하나의 프로세서(예: 어플리케이션 프로세서)로 입력될 수 있다. 도 5는 일 실시예에 따른 이미지 센서에 배치된 수광 소자, 마이크로 렌즈 및 색상 필터의 패턴에 대한 예 시를 도시한 도면이다. 일 실시예에서, 이미지 센서에 포함된 서로 인접하여 2 x 2 배열로 배치된 네 개의 마이크로 렌즈들(521, 522, 523, 524)이 색상 필터의 동일한 색상 채널(예: 녹색 채널)에 배치될 수 있다. 이미지 센서에 포함된 수광 소자들은 2 x 2 배열로 배치된 네 개의 포토 다이오드들이 하나의 마이크로 렌즈에 대응되도록 배 치될 수 있다. 예를 들어, 도 5를 참조하면, 제1 포토 다이오드, 제2 포토 다이오드 , 제3 포토 다 이오드 및 제4 포토 다이오드 는 제1 마이크로 렌즈에 대응되도록 배치될 수 있다. 제5 포토 다이오드 , 제6 포토 다이오드 , 제7 포토 다이오드 및 제8 포토 다이오드 는 제2 마이크 로 렌즈에 대응되도록 배치될 수 있다. 따라서, 서로 인접하여 4 x 4 배열로 배치된 열 여섯 개의 포토다이오드들이 하나의 색상 채널에 대응되도록 배치될 수 있다. 일 실시예에서, 이미지 센서는 도 5에 도시된 패턴이 반복적으로 배열되어 구성될 수 있다. 도 5에 도시된 패턴은 헥사데카(hexadeca) 패턴이라고 언급될 수 있다. 도 5에 도시된 패턴은 일 예시를 도시한 것이며, 이미 지 센서의 패턴은 해상도를 변경하여 동작할 수 있는 다른 패턴으로 대체될 수도 있다. 예를 들어, 도 5 에 도시된 인접한 마이크로 렌즈들이 서로 다른 색상 채널에 대응하도록 배치되고, 각 마이크로 렌즈에 네 개의 수광 소자들이 대응되도록 배치되며, 각 마이크로 렌즈에 대응되는 네 개의 수광 소자들을 비닝(binning) 연산 하면 베이어 패턴의 출력이 획득되도록 구성된 4PD 패턴이 사용될 수도 있다. 도 6은 일 실시예에 따른 이미지 센서(예: 도 3 및 5의 이미지 센서)에 포함된 픽셀들의 값을 출력하기 위 한 회로의 예시를 도시한 회로도이다. 일 실시예에서, 이미지 센서(예: 도 3 및 5의 이미지 센서)에 포함된 수광 소자들은 하나의 마이크로 렌즈 에 대응되도록 배치된 2x2 배열을 가지는 네 개의 포토 다이오드들 (예: 제1 포토 다이오드 , 제2 포토 다 이오드 , 제3 포토 다이오드 및 제4 포토 다이오드 )을 포함할 수 있다. 일 실시예에서, 하나 의 마이크로 렌즈에 다섯 개 이 포토 다이오드들이 대응되도록 배치될 수도 있다. 예를 들면, 3x3 배열을 가지 는 9개의 포토 다이오드들이 하나의 마이크로 렌즈에 대응되도록 배치될 수도 있다. 도 6을 참조하면, 하나의 마이크로 렌즈에 대응되도록 배치된 네 개의 포토 다이오드들(예: 제1 포토 다이오드 , 제2 포토 다이오드, 제3 포토 다이오드 및 제4 포토 다이오드)과 다른 마이크로 렌즈에 대응되도록 배치된 네 개의 포토 다이오드들(제5 포토 다이오드, 제6 포토 다이오드, 제7 포토 다이 오드 및 제8 포토 다이오드)은 하나의 부동 노드(floating diffusion node)에 연결될 수 있다. 포토 다이오드들(511, 512, 513, 514, 515, 516, 517, 518) 각각과 부동 노드 사이에는 스위치들(621, 622, 623, 624, 625, 626, 627, 628)이 연결될 수 있다. 예를 들어, 스위치들(621, 622, 623, 624, 625, 626, 627, 628)은 트랜지스터(예: 트랜지스터 게이트(transistor gate))를 포함할 수 있다. 일 실시예에 따르면, 노출 시간 동안 포토 다이오드들(511, 512, 513, 514, 515, 516, 517, 518)에 전하가 축 적될 수 있다. 전하가 축적되는 동안 스위치는 열린(opened) 상태를 유지함으로써 포토 다이오드와 부동 노드 가 연결되지 않도록 할 수 있다. 스위치가 닫히게(closed) 되면 포토 다이오드가 부동 노드에 연결 되면서 축적된 전하가 부동 노드로 이동할 수 있다. 예를 들어, 제1 포토 다이오드에 축적된 전하는 제1 스위치가 닫히게 되면 부동 노드로 이동할 수 있다. 부동 노드에 저장된 전하는 소스 팔로 워(source follower)를 통해서 독출되어 전기적 신호로 출력될 수 있다. 이미지 센서(예: 도 3 및 5의 이 미지 센서)는 부동 노드로 이동된 전하에 대응하는 아날로그(analog) 데이터를 획득할 수 있다. 예를 들어, 아날로그 데이터는 노출 시간 동안 적어도 하나의 포토 다이오드에 축적된 전하의 양에 대한 정보를 포함 할 수 있다. 일 실시예에서, 라인 선택기는 선택된 라인에 대한 아날로그 데이터를 출력하기 위해 온(on) 또는 오프 (off) 상태로 제어될 수 있다. 일 실시예에서, 이미지 센서(예: 도 3 및 5의 이미지 센서)는 원시 영상 데이터의 픽셀 값에 상응하는 아 날로그 데이터를 획득할 수 있다. 예를 들어, 이미지 센서(예: 도 3 및 5의 이미지 센서)는 스위치들 (621, 622, 623, 624, 625, 626, 627, 628)을 제어하여 포토 다이오드들(511, 512, 513, 514, 515, 516, 517, 518) 중 적어도 하나를 통해서 획득된 광량 데이터에 상응하는 아날로그 데이터를 획득할 수 있다. 이미지 센 서(예: 도 3 및 5의 이미지 센서)가 제1 스위치를 온(on) 시켜서 스위치가 닫히게 되면 이미지 센서 (예: 도 3 및 5의 이미지 센서)는 제1 포토 다이오드를 통해서 획득된 광량 데이터에 기초하여 아날 로그 데이터를 획득할 수 있다. 일 실시예에서, 이미지 센서(예: 도 3 및 5의 이미지 센서)는 아날로그 데이터를 획득한 이후 리셋 스위치 (예: 리셋 트랜지스터(reset transistor))를 온(on) 시켜서 부동 노드에 축적된 전하를 제거하는 리셋 동 작을 수행할 수 있다. 이미지 센서(예: 도 3 및 5의 이미지 센서)는 스위치들(621, 622, 623, 624, 625, 626, 627, 628)을 하나씩 순차적으로 온(on) 시키면서 리셋 동작을 시간차를 두고 교번하여 수행함으로써 포토 다이오드들(511, 512, 513, 514, 515, 516, 517, 518) 각각을 하나의 화소 값으로서 독출할 수 있다. 예를 들 어, 고화소(예: 200 Mp)의 영상을 생성하도록 하는 제1 촬영 모드에 기초하여 동작하는 경우, 이미지 센서(예: 도 3 및 5의 이미지 센서)는 포토 다이오드들(511, 512, 513, 514, 515, 516, 517, 518) 각각을 하나의 화소 값으로 독출할 수 있다.일 실시예에서, 제1 스위치, 제2 스위치, 제3 스위치 및 제4 스위치를 함께 온(on) 시키면 제1 포토 다이오드, 제2 포토 다이오드, 제3 포토 다이오드 및 제4 포토 다이오드에 축적 된 전하가 부동 노드로 이동하게 된다. 이 경우, 제1 포토 다이오드, 제2 포토 다이오드, 제3 포토 다이오드 및 제4 포토 다이오드에 상응하는 광량을 아날로그적으로 합산하여, 이미지 센서(예: 도 3 및 5의 이미지 센서)는 하나의 마이크로렌즈(예: 도 5의 제1 마이크로 렌즈)에 상응하는 광량 데이터를 획득할 수 있다. 예를 들어, 제1 촬영 모드보다 낮은 화소(예: 50 Mp)의 영상을 생성하도록 하는 제2 촬영 모드에 기초하여 동작하는 경우, 이미지 센서(예: 도 3 및 5의 이미지 센서)는 제1 포토 다이오드 , 제2 포토 다이오드, 제3 포토 다이오드 및 제4 포토 다이오드에 축적된 전하를 합산한 값을 하나의 화소 값으로 독출할 수 있다. 일 실시예에서, 스위치들(621, 622, 623, 624, 625, 626, 627, 628)을 함께 온(on) 시키면 포토 다이오드들 (511, 512, 513, 514, 515, 516, 517, 518)에 축적된 전하가 부동 노드로 이동하게 된다. 이 경우, 여덟 개의 포토 다이오드들(511, 512, 513, 514, 515, 516, 517, 518)에 상응하는 광량을 아날로그적으로 합산하여, 이미지 센서(예: 도 3 및 5의 이미지 센서)는 두 개의 마이크로 렌즈(예: 도 5의 제1 마이크로 렌즈 및 제2 마이크로 렌즈)에 상응하는 광량 데이터를 획득할 수 있다. 이미지 센서(예: 도 3 및 5의 이미지 센서)는 유사하게 인접한 마이크로 렌즈(예: 도 5의 제3 마이크로 렌즈 및 제4 마이크로 렌즈) 에 상응하는 광량 데이터를 획득한 후, 두 개의 마이크로 렌즈(예: 도 5의 제1 마이크로 렌즈 및 제2 마이 크로 렌즈)에 상응하는 광량 데이터와 합산하여 하나의 색상 채널(예: 도 5의 녹색 채널)에 상응하는 값을 하나의 픽셀 값으로 독출할 수 있다. 예를 들어, 제2 촬영 모드보다 낮은 화소(예: 12.5 Mp)의 영상을 생 성하도록 하는 제3 촬영 모드에 기초하여 동작하는 경우, 이미지 센서(예: 도 3 및 5의 이미지 센서)는 네 개의 마이크로 렌즈(예: 도 5의 제1 마이크로 렌즈, 제2 마이크로 렌즈, 제3 마이크로 렌즈 및 제4 마이크로 렌즈)에 상응하는 포토 다이오드들에 축적된 전하를 합산한 값을 하나의 화소 값으로 독출할 수 있다. 여기서, 독출되는 화소 값들은 베이어 패턴에 따른 색상 순서(color order)를 가질 수 있다. 일 실시예에서, 제2 스위치, 제4 스위치, 제6 스위치 및 제8 스위치가 오프(off)된 상태에 서 제1 스위치, 제3 스위치, 제5 스위치 및 제7 스위치를 온(on) 시키면 이미지 센서(예: 도 3 및 5의 이미지 센서)는 마이크로 렌즈 좌측 픽셀에 대한 휘도 값을 획득할 수 있다. 제1 스위치 , 제3 스위치, 제5 스위치 및 제7 스위치가 오프(off)된 상태에서 2 스위치, 제4 스 위치, 제6 스위치 및 제8 스위치를 온(on)시키면 우측 픽셀에 대한 휘도 값을 획득할 수 있다. 전자 장치(예: 도 1 및 3의 전자 장치)는 좌측 픽셀 값과 우측 픽셀 값의 상관관계에 기초하여 위상차 정 보를 획득할 수 있다. 다만, 이는 일 예시를 설명하기 위한 것으로서 좌측 픽셀 값과 우측 픽셀 값을 획득하는 방법은 이에 한정되지 아니한다. 예를 들어, 일 실시예에 따른 전자 장치(예: 도 1 및 3의 전자 장치)는 제1 포토 다이오드 및 제3 포토 다이오드에 상응하는 휘도 값과 제5 포토 다이오드 및 도7 포토 다이오드에 상응하는 휘도 값을 개별적인 좌측 픽셀 값으로 출력할 수도 있다. 열 여섯 개의 픽셀을 동적 화소 센서 배열(active pixel sensor array, APS)에서 각각 출력하는 제1 촬영 모드 는 가장 높은 해상도의 원시 영상 데이터가 출력될 수 있으나, 출력되는 데이터에 대해 리모자이크를 수행하더 라도 많은 아티팩트들이 발생할 수 있다. 도 7은 일 실시예에 따른 이미지 센서(예: 도 3 및 5의 이미지 센서)에 포함된 픽셀들의 값을 출력하기 위 한 회로의 다른 예시를 도시한 회로도이다. 일 실시예에서, 제1 포토 다이오드, 제2 포토 다이오드, 제3 포토 다이오드 및 제4 포토 다이오 드는 각각 제1 스위치, 제2 스위치, 제3 스위치 및 제4 스위치를 통해서 제1 부동 노드에 연결될 수 있다. 도 6에 도시된 회로도와 비교하여, 제5 포토 다이오드, 제6 포토 다이오드 , 제7 포토 다이오드 및 제8 포토 다이오드는 제1 포토 다이오드, 제2 포토 다이오드 , 제3 포토 다이오드 및 제4 포토 다이오드과 제1 부동 노드를 공유하지 않을 수 있다. 제 5 포토 다이오드, 제6 포토 다이오드, 제7 포토 다이오드 및 제8 포토 다이오드는 각각 제 5 스위치, 제6 스위치, 제7 스위치 및 제8 스위치를 통해서 제2 부동 노드에 연결될 수 있다. 일 실시예에서, 제1 포토 다이오드, 제2 포토 다이오드, 제3 포토 다이오드 또는 제4 포토 다이 오드 중 적어도 하나를 포함하는 라인의 데이터를 독출하기 위해 제1 선택기가 온(on)된 상태에서 제 1 부동 노드에 저장된 전하에 기초하여 제1 소스 팔로워를 통해서 아날로그 데이터가 출력될 수있다. 아날로그 데이터가 출력된 이후, 제1 리셋 스위치가 온(on) 되어 제1 부동 노드에 축적된 전 하를 제거할 수 있다. 일 실시예에서, 제5 포토 다이오드, 제6 포토 다이오드, 제7 포토 다이오드 및 제8 포토 다이오 드 중 적어도 하나를 포함하는 라인의 데이터를 독출하기 위해 제2 선택기가 온(on) 된 상태에서 제2 부동 노드에 저장된 전하에 기초하여 제2 소스 팔로워를 통해서 아날로그 데이터가 출력될 수 있다. 아날로그 데이터가 출력된 이후, 제2 리셋 스위치가 온(on) 되어 제2 부동 노드에 축적된 전하를 제 거할 수 있다. 도 8은 일 실시예에 따른 전자 장치(예: 도 1 및 3의 전자 장치)가 이미지를 획득하는 프로세스를 도시한 흐름도이다. 본 개시에서, 전자 장치(예: 도 1 및 3의 전자 장치)가 수행하는 동작은 적어도 하나의 프로세서(예: 도 1의 프로세서, 도 2의 이미지 시그널 프로세서, 도 3의 적어도 하나의 프로세서 )가 메모리(예: 도 1의 메모리, 도 3의 메모리)에 저장된 인스트럭션들을 실행하여 수행되는 것으로 이해될 수 있다. 일 실시예에 따른 전자 장치(예: 도 1 및 3의 전자 장치)는, 동작 810에서, 영상을 촬영하기 위한 촬영 모 드를 결정할 수 있다. 예를 들어, 전자 장치(예: 도 1 및 3의 전자 장치)는 촬영 모드를 선택하기 위한 사용자 입력을 수신하고, 수신된 사용자 입력에 기초하여 촬영 모드를 결정할 수 있다. 또는, 예를 들어, 전자 장치(예: 도 1 및 3의 전자 장치)는 디폴트(default) 설정에 기초하여 영상을 촬영하기 위한 촬영 모드를 결정할 수 있다. 또는, 예를 들어, 전자 장치(예: 도 1 및 3의 전자 장치)는 이전에 설정된 촬영 모드에 기초하여 영상을 촬영하기 위한 촬영 모드를 결정할 수 있다. 일 실시예에 따른 전자 장치(예: 도 1 및 3의 전자 장치)는, 동작 820에서, 결정된 촬영 모드가 제1 해상 도에 상응하는 제1 촬영 모드인지 여부를 판단할 수 있다. 결정된 촬영 모드가 제1 촬영 모드인 경우, 동작 831에서, 전자 장치(예: 도 1 및 3의 전자 장치)는 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이 미지 센서)가 제1 모드에 기반하여 제1 해상도에 상응하는 제1 원시 영상 데이터를 출력하도록 제어할 수 있다. 예를 들어, 전자 장치(예: 도 1 및 도 3의 전자 장치)는 200 Mp의 해상도에 상응하는 제1 원시 영 상 데이터를 출력하도록 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이미지 센서)를 제어할 수 있 다. 여기서, 제1 원시 영상 데이터는, 예를 들어, 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이미지 센서)의 수광부로부터 독출된 제1 데이터를 교정하되 리모자이크를 수행하지 않은 데이터일 수 있다. 동 작 831에서, 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이미지 센서)가 출력하는 제1 원시 영상 데이터는 하나의 포토 다이오드들에 상응하는 수광 소자의 출력이 하나의 픽셀에 대응되도록 구성된 것일 수 있 다. 일 실시예에서, 전자 장치(예: 도 1 및 3의 전자 장치)는 결정된 해상도에 따라서 이미지 센서가 원시 영 상 데이터를 출력하도록 할 수 있다. 예를 들어, 결정된 촬영 모드가 제1 해상도에 상응하는 제1 촬영 모드인 경우, 이미지 센서는 이미지 센서에 포함된 복수개의 포토 다이오드들 중 하나의 포토 다이오드에 상응하는 제1 수광 소자의 출력이 하나의 픽셀에 상응하는 제1 원시 영상 데이터를 출력하는 제1 모드에 기반하여 동작할 수 있다. 결정된 촬영 모드가 제1 해상도보다 낮은 제2 해상도에 상응하는 제2 촬영 모드인 경우, 이미지 센서는 이미지 센서에 포함된 복수개의 포토 다이오드들 중 적어도 둘 이상의 포토 다이오드(예: 하나의 마이크로 렌즈 에 대응되도록 배치된 M x N 배열의 포토 다이오드(511, 512, 513, 514), 또는 복수개의 마이크로 렌즈 (521, 522, 523, 524)에 대응되도록 배치된 포토 다이오드)에 상응하는 제2 수광소자들의 출력이 하나의 픽셀에 상응하는 제2 원시 영상 데이터를 출력하는 제2 모드에 기반하여 동작할 수 있다. 동작 832에서, 일 실시예에 따른 전자 장치(예: 도 1 및 3의 전자 장치)는 제1 원시 영상 데이터에 기초하 여 제1 해상도의 제1 이미지를 획득할 수 있다. 제1 이미지는, 예를 들어, 각 픽셀에 대한 RGB 값을 가지는 RGB 도메인의 영상일 수 있다. 일 실시예에서, 전자 장치(예: 도 1 및 3의 전자 장치)는 제1 원시 영상 데이터를 기계 학습에 기초하여 생성된 예측 모델에 입력하여 제1 이미지를 획득할 수 있다. 예를 들어, 전자 장치(예: 도 1 및 3의 전자 장치)는 예측 모델에 상응하는 연산을 수행하여 제1 이미지를 출력할 수 있다. 또는, 예를 들어, 전자 장치(예: 도 1 및 3의 전자 장치)는 예측 모델에 상응하는 연산을 수행하여 전자 장치(예: 도 1 및 3의 전자 장치)의 이미지 시그널 프로세서(예: 도 2의 이미지 시그널 프로세서)가 처리할 수 있는 데이터를 획득할 수도 있다. 전자 장치(예: 도 1 및 3의 전자 장치)는 예측 모델의 출력 에서 획득된 데이터에 대해 이미지 시그널 프로세서(예: 도 2의 이미지 시그널 프로세서)를 통한 영상 처 리를 수행하여 제1 이미지를 획득할 수도 있다.예측 모델은, 예를 들어, 정답지(ground truth) 영상에 대한 원시 영상 데이터를 인위적으로 생성하여 정답지 영상을 원시 영상 데이터에 대한 라벨(label)로서 저장하는 입력 데이터베이스를 기계 학습 모델에 입력함으로 써 생성될 수 있다. 또는, 예를 들어, 예측 모델은 원시 영상 데이터의 픽셀들을 비닝(binning)하여 정답지 영 상을 생성하고, 각 마이크로 렌즈 위치에 대한 샘플링을 통해서 구성된 입력 데이터베이스를 기계 학습 모델에 입력함으로써 생성될 수 있다. 다만, 상술한 예측 모델을 생성하는 방법들은 예시들에 불과하며 예측 모델을 생성하는 방법은 제한되지 아니한다. 결정된 촬영 모드가 제2 촬영 모드인 경우, 일 실시예에 따른 전자 장치(예: 도 1 및 3의 전자 장치)는, 동작 841에서, 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이미지 센서)가 제2 모드에 기반하여 제 2 해상도에 상응하는 제2 원시 영상 데이터를 출력하도록 제어할 수 있다. 예를 들어, 전자 장치(예: 도 1 및 3 의 전자 장치)는 50 Mp의 해상도에 상응하는 제2 원시 영상 데이터를 출력하도록 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이미지 센서)를 제어할 수 있다. 여기서, 제2 원시 영상 데이터는, 예를 들어, 리모자이크를 적용한 데이터일 수 있다. 동작 841에서, 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이 미지 센서)가 출력하는 제2 원시 영상 데이터는 복수 개의 포토 다이오드들에 상응하는 수광 소자들의 출 력이 하나의 픽셀에 대응되도록 구성된 것일 수 있다. 예를 들어, 복수 개의 포토 다이오드들의 개수는 하나의 마이크로 렌즈에 대응되도록 배치된 복수 개(예: M x N개)의 포토 다이오드들의 개수일 수 있다. 동작 842에서, 일 실시예에 따른 전자 장치(예: 도 1 및 3의 전자 장치)는 제2 원시 영상 데이터에 기초하 여 제2 해상도의 제2 이미지를 획득할 수 있다. 일 실시예에서, 전자 장치(예: 도 1 및 3의 전자 장치)는 제2 원시 영상 데이터에 대한 적어도 하나의 영상 신호 처리(예: 화이트 밸런스(white balance), 디모자이크 (demosaic), 감마 보정(gamma correction), 색상 보정(color correction), 노이즈 저감(noise reduction), 샤 프닝(sharpening))를 수행하여 제2 이미지를 획득할 수 있다. 제2 이미지는, 예를 들어, 각 픽셀에 대한 RGB 값을 가지는 RGB 도메인의 영상일 수 있다. 도 9는 일 실시예에 따른 전자 장치(예: 도 1 및 3의 전자 장치)의 이미지 센서(예: 도 2의 이미지 센서 , 도 3의 이미지 센서)에 포함된 수광 소자(예: 도 5의 포토 다이오드(511, 512, 513, 514))들에 할 당되는 렌즈 동공에 대한 개념도이다. 일 실시예에서, 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이미지 센서)는 제1 촬영 모드에 기초 하여 동작하는 동안 수광 소자들(예: 도 5 내지 7의 제1 포토 다이오드, 제2 포토 다이오드, 제3 포 토 다이오드, 제4 포토 다이오드, 제5 포토 다이오드, 제6 포토 다이오드, 제7 포토 다이 오드 및 제8 포토 다이오드)에 축적된 전하를 각각 순차적으로 독출하여 높은 화소수(예: 200Mp)를 가지는 제1 원시 영상 데이터를 출력할 수 있다. 그러나 도 5에 도시된 바와 같이 하나의 마이크로 렌즈에 복 수개의 포토 다이오드들이 대응되도록 배치된 경우 하나의 마이크로 렌즈에 입사된 빛을 복수개의 포토 다이오 드들이 나누어서 수신하게 된다. 렌즈에 빛이 입사되는 주요 방향은 이미지 센서(예: 도 2의 이미지 센서 , 도 3의 이미지 센서) 내에서의 위치 별로 다를 수 있으므로, 포토 다이오드 별로 광이 분할되는 비 율이 달라질 수 있다. 예를 들어, 도 9의 900을 참조하면, 네 개의 포토 다이오드에 빛이 분배되는 비율이 균등한 경우가 도시된다. 본 개시에서, 포토 다이오드에 빛이 분배된 영역은 동공 할당 영역(pupil allocated area)라고 언급될 수 있다. 도 9의 900을 참조하면, 좌상단 동공 할당 영역, 우상단 동공 할당 영역, 좌하단 동공 할당 영역 및 우하단 동공 할당 영역의 넓이가 실질적으로 균일하게 분배될 수 있다. 도 9의 910을 참조하면, 렌즈 동공이 좌상단 방향으로 편향될 수 있다. 렌즈 동공의 편향으로 인해서 좌상단 동공 할당 영역이 다른 동공 할당 영역들(912, 913, 914)보다 커지게 된다. 도 9의 920을 참조하면, 렌즈 동공이 우상단 방향으로 편향될 수 있다. 렌즈 동공의 편향으로 인해서 우상단 동공 할당 영역이 다른 동 공 할당 영역들(921, 923, 924)보다 커지게 된다. 도 9의 930을 참조하면, 렌즈 동공이 좌하단 방향으로 편향 될 수 있다. 렌즈 동공의 편향으로 인해서 좌하단 동공 할당 영역이 다른 동공 할당 영역들(931, 932, 934)보다 커지게 된다. 도 9의 940을 참조하면, 렌즈 동공이 우하단 방향으로 편향될 수 있다. 렌즈 동공의 편향으로 인해서 우하단 동공 할당 영역이 다른 동공 할당 영역들(941, 942, 943)보다 커지게 된다. 일 실시예에서, 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이미지 센서)는 각 포토 다이오드들에 대한 동공 할당 영역의 불균형을 교정한 결과에 기초하여 제1 원시 영상 데이터를 출력할 수 있다. 렌즈에 빛 이 입사되는 주요 방향은 카메라의 줌 배율이나 렌즈의 초점 위치에 의해서도 달라질 수 있으므로, 일 실시예에 따른 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이미지 센서)는 줌 배율이나 초점 위치에 기초하여 포토 다이오드들로부터 독출된 제1 데이터를 교정할 수 있다. 예를 들어, 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이미지 센서)는 줌 배율 또는 렌즈 위치 중 적어도 하나에 대한 정보를 입력 받아서 제 1 데이터를 교정하는 프로세서를 포함할 수 있다. 도 10은 일 실시예에 따른 전자 장치(예: 도 1 및 3의 전자 장치)가 촬영 모드를 선택하는 프로세스를 도 시한 흐름도이다. 도 10은 전자 장치(예: 도 1 및 3의 전자 장치)가 촬영 모드를 선택하는 동작에서 수행될 수 있다. 예를 들어, 도 10에 도시된 흐름도에 포함된 동작은 도 8의 동작 810을 수행하는 과정에서 실행될 수 있다. 동작 1010에서, 일 실시예에 따른 전자 장치(예: 도 1 및 3의 전자 장치)는 카메라 어플리케이션을 실행할 수 있다. 카메라 어플리케이션은 전자 장치(예: 도 1 및 3의 전자 장치)의 카메라(예: 도 1 및 2의 카메 라 모듈, 도 3의 카메라)를 통해서 영상을 촬영하는 서비스를 제공하는 어플리케이션을 포함할 수 있 다. 예를 들어, 카메라 어플리케이션은 정지 영상 및/또는 동영상을 촬영하여 저장하는 촬영 어플리케이션, 카 메라(예: 도 1 및 2의 카메라 모듈, 도 3의 카메라)를 통해서 촬영된 영상을 다른 카메라로 전송하는 영상 통화 어플리케이션, 또는 카메라(예: 도 1 및 2의 카메라 모듈, 도 3의 카메라)를 통해서 촬영 된 영상을 외부로 스트리밍하는 방송 어플리케이션 중 적어도 하나를 포함할 수 있다. 동작 1020에서, 일 실시예에 따른 전자 장치(예: 도 1 및 3의 전자 장치)는 실행된 카메라 어플리케이션에 기초하여 해상도를 선택하기 위한 사용자 인터페이스를 디스플레이(예: 도 1의 디스플레이 모듈, 도 3의 디스플레이)를 통해서 표시할 수 있다. 예를 들어, 도 11을 참조하면, 도 11은 일 실시예에 따른 전자 장치(예: 도 1 및 3의 전자 장치)가 표시하 는 해상도 선택 사용자 인터페이스를 포함하는 화면의 예시를 도시한 도면이다. 일 실시예에서, 전자 장치(예: 도 1 및 3의 전자 장치)는 해상도를 선택할 수 있는 적어도 하나의 항목을 포함하는 사용자 인터페이스를 포함하는 화면을 표시할 수 있다. 도 11을 참조하면, 해상도를 선택하기 위한 사용자 인터페이스는 제1 해상도 에 상응하는 제1 아이콘, 제2 해상도에 상응하는 제2 아이콘 또는 제3 해상도에 상응하는 제3 아이 콘 중 적어도 하나를 포함할 수 있다. 일 실시예에서, 전자 장치(예: 도 1 및 3의 전자 장치)는 사용자 입력(예: 터치 입력)에 기초하여 촬영 모 드를 결정할 수 있다. 예를 들어, 제1 아이콘이 표시된 위치에 상응하는 터치 입력이 수신된 경우 전자 장치는 200 Mp 의 해상도를 가지는 이미지를 생성하는 제1 촬영 모드를 결정할 수 있다. 제2 아이콘이 표시된 위치에 상응하는 터치 입력이 수신된 경우 전자 장치는 50 Mp의 해상도를 가지는 이미지를 생성하는 제2 촬영 모드를 결정할 수 있다. 제3 아이콘이 표시된 위치에 상응하는 터치 입력이 수신된 경우 전자 장치 는 12.5 Mp의 해상도를 가지는 이미지를 생성하는 제3 촬영 모드를 결정할 수 있다. 다만, 본 개시에서 제시된 해상도 값들은 예시에 불과하며 해상도 값은 변경될 수 있다. 동작 1030에서, 일 실시예에 따른 전자 장치(예: 도 1 및 3의 전자 장치)는 결정된 촬영 모드에 기초하여 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이미지 센서)를 제어할 수 있다. 동작 1030에서, 일 일시예에 따른 전자 장치(예: 도 1 및 3의 전자 장치)는 이미지 센서(예: 도 2의 이미지 센서, 도 3 의 이미지 센서)가 결정된 촬영 모드에 상응하는 이미지를 획득하기 위한 원시 영상 데이터를 출력하도록 제어할 수 있다. 예를 들어, 결정된 촬영 모드가 제1 촬영 모드인 경우, 전자 장치(예: 도 1 및 3의 전자 장치)는 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이미지 센서)가 각 수광 소자들(예: 도 5 내지 도 7의 제1 포 토 다이오드, 제2 포토 다이오드, 제3 포토 다이오드, 제4 포토 다이오드, 제5 포토 다이 오드, 제6 포토 다이오드, 제7 포토 다이오드, 제8 포토 다이오드)에 축적된 전하 값을 개 별적 및 순차적으로 독출하도록 제어할 수 있다. 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이미지 센 서)는 독출된 전하 값에 상응하는 픽셀들을 포함하는 제1 원시 영상 데이터를 출력할 수 있다. 제1 원시 영상 데이터에 포함된 픽셀들의 패턴은 베이어 패턴과 다를 수 있다. 예를 들어, 결정된 촬영 모드가 제2 촬영 모드인 경우, 전자 장치(예: 도 1 및 3의 전자 장치)는 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이미지 센서)의 2x2 배열의 포토 다이오드들에 상응하는 수광 소자들(예: 도 5 내지 도 7의 제1 포토 다이오드, 제2 포토 다이오드, 제3 포토 다이오드, 제4 포토 다이오드)에 축적된 전하를 하나의 부동 노드를 통해서 함께 독출할 수 있다. 이후, 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이미지 센서)는 다른 2x2 배열의 포토 다이오드들에 상응하는수광 소자들(예: 도 5 내지 도 7의 제5 포토 다이오드, 제6 포토 다이오드, 제7 포토 다이오드, 제8 포토 다이오드)에 축적된 전하를 함께 독출할 수 있다. 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이미지 센서)는 독출된 전하 값을 포함하는 데이터에 대해 리모자이크 처리를 수행하여 베이어 패 턴을 가지는 제2 원시 영상 데이터를 출력할 수 있다. 예를 들어, 결정된 촬영 모드가 제3 촬영 모드인 경우, 전자 장치(예: 도 1 및 3의 전자 장치)는 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이미지 센서)가 4x2 배열의 포토 다이오드들에 상응하는 수광 소자들(예: 도 5 내지 도 7의 제1 포토 다이오드, 제2 포토 다이오드, 제3 포토 다이오드, 제4 포토 다이오드, 제5 포토 다이오드, 제6 포토 다이오드, 제7 포토 다이오드, 제8 포토 다 이오드)에 축적된 전하 값을 함께 독출할 수 있다. 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이 미지 센서)는 독출된 결과를 아날로그-디지털 변환기(analog to digital convertor, ADC)를 통해서 제1 디지털 값으로 변환할 수 있다. 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이미지 센서)는 상기 제1 디지털 값을 인접한 4x2 배열로부터 획득된 제2 디지털 값(예: 도 5의 제3 마이크로 렌즈 및 제4 마이 크로 렌즈에 상응하는 포토 다이오드들로부터 독출된 값)과 디지털 합병(digital merge)하여 하나의 색상 채널(예: 도 5의 녹색 채널)에 대응되는 하나의 픽셀 값을 획득할 수 있다. 즉, 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이미지 센서)는 4x4 배열의 포토 다이오드들에 상응하는 수광 소자들을 통해서 검출된 값에 기초하여 하나의 픽셀 값을 획득할 수 있다. 도 5에 도시된 헥사데카 패턴의 경우, 색상 채널 별 로 픽셀 값을 획득하는 경우 픽셀 값들의 배치가 베이어 패턴을 따를 수 있다. 이 경우, 이미지 센서(예: 도 2 의 이미지 센서, 도 3의 이미지 센서)는 리모자이크 과정을 거치지 않고 베이어 패턴을 가지는 제3 원시 영상 데이터를 출력할 수 있다. 일 실시예에서, 전자 장치(예: 도 1 및 3의 전자 장치)는 선택된 촬영 모드에 기초하여 획득된 영상에 상 응하는 미리보기 화면을 디스플레이를 통해서 표시할 수 있다. 다만, 도 10은 전자 장치(예: 도 1 및 3의 전자 장치)가 촬영 모드를 선택하는 방법의 일 예시를 도시한 것이며, 전자 장치(예: 도 1 및 3의 전자 장치)가 촬영 모드를 선택하는 방법은 도 10에 도시된 흐름도 로 한정되어야 하는 것은 아니다. 예를 들어, 전자 장치(예: 도 1 및 3의 전자 장치)는 전자 장치 (예: 도 1 및 3의 전자 장치)에 포함된 센서(예: 도 1의 센서 모듈)를 통해서 획득된 정보가 미리 정 해진 조건을 만족하는지 여부에 기초하여 촬영 모드를 선택할 수도 있다. 도 12는 일 실시예에 따른 전자 장치(예: 도 1 및 3의 전자 장치)가 상황 정보에 기초하여 이미지를 획득 하는 프로세스를 도시한 흐름도이다. 도 12에 도시된 프로세스는 기계 학습된 모델에 기초하여 이미지를 획득하는 동작과 연관하여 수행될 수 있다. 예를 들어, 도 8의 동작 832을 수행하는 경우에 도 12에 도시된 프 로세스가 실행될 수 있다. 동작 1210에서, 일 실시예에 따른 전자 장치(예: 도 1 및 3의 전자 장치)는 영상 촬영과 관련된 상황 정보 를 분석할 수 있다. 영상 촬영과 관련된 상황 정보는 전자 장치(예: 도 1 및 3의 전자 장치)가 높은 화소 의 영상을 생성할 필요가 있는지 여부를 판단하기 위한 정보를 포함할 수 있다. 일 실시예에 따른 전자 장치 (예: 도 1 및 3의 전자 장치)는 카메라(예: 도 1 및 2의 카메라 모듈, 도 3의 카메라)를 통해서 촬영된 이미지 데이터 또는 별도의 센서(예: 도 1의 센서 모듈)을 통해서 상황 정보를 획득할 수 있다. 예를 들어, 전자 장치(예: 도 1 및 3의 전자 장치)는 이미지 데이터 또는 조도 센서를 이용하여 조도 값을 획득할 수 있다. 예를 들어, 전자 장치(예: 도 1 및 3의 전자 장치)는 이미지 데이터에 포함된 영상이 디 포커스(defocus)된 영상인지 여부에 대한 정보를 획득할 수 있다. 예를 들어, 전자 장치(예: 도 1 및 3의 전자 장치)는 이미지 데이터에 포함된 고주파 성분에 대한 정보를 획득할 수 있다. 예를 들어, 전자 장치(예: 도 1 및 3의 전자 장치)는 촬영되는 장면을 분류하기 위한 정보(예: 야경, 피사체 주변에 역광이 존재하는 장면)를 획득할 수 있다. 다만, 상황 정보의 예시는 이에 한정되지 아니한다. 도 8의 동작 832와 관련하여 제1 촬영 모드에 기초하여 영상을 촬영하는 경우 기계 학습을 통해서 생성된 모델 을 이용하여 높은 화질의 제1 이미지를 획득할 수도 있으나, 딥 러닝(deep learning)과 같은 연산은 연산량이 많을 수 있다. 따라서, 일 실시예에 따른 전자 장치(예: 도 1 및 3의 전자 장치)는 높은 화질이 요구되지 않는 상황에서는 기계 학습을 통해서 생성된 모델에 기반한 연산을 수행하지 않고 제1 이미지를 획득할 수도 있 다. 기계 학습을 통해서 생성된 모델을 이용한 연산이 필요한 지 여부를 판단하기 위해, 동작 1220에서 일 실 시예에 따른 전자 장치(예: 도 1 및 3의 전자 장치)는 상황 정보가 지정된 조건에 상응하는지 여부를 판단 할 수 있다.예를 들어, 전자 장치(예: 도 1 및 3의 전자 장치)는 조도 값이 임계치 미만인지 여부를 판단할 수 있다. 예를 들어, 전자 장치(예: 도 1 및 3의 전자 장치)는 촬영된 영상이 초점이 맞지 않은 영상인지 여부를 판 단할 수 있다. 예를 들어, 전자 장치(예: 도 1 및 3의 전자 장치)는 영상에 포함된 고주파 성분의 크기가 임계치 미만인지 여부를 판단할 수 있다. 예를 들어, 전자 장치(예: 도 1 및 3의 전자 장치)는 촬영된 영 상이 지정된 분류에 속하는 장면을 촬영한 것인지 여부를 판단할 수 있다. 다만, 지정된 조건의 예시는 이에 한정되지 아니한다. 일 실시예에서, 상황 정보가 지정된 조건에 상응하지 않는 경우, 전자 장치(예: 도 1 및 3의 전자 장치)는 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이미지 센서)에서 출력된 원시 영상 데이터를 기계 학 습된 모델에 입력하는 동작 1231을 수행할 수 있다. 일 실시예에 따른 전자 장치(예: 도 1 및 3의 전자 장치 )는 원시 영상 데이터가 입력된 모델에 따른 연산을 수행함으로써 획득된 출력에 기초하여 제1 이미지를 획득하는 동작 1233을 수행할 수 있다. 일 실시 예에서, 상황 정보가 지정된 조건에 상응하는 경우, 전자 장치(예: 도 1 및 3의 전자 장치)는 이 미지 센서(예: 도 2의 이미지 센서, 도 3의 이미지 센서)에서 출력된 원시 영상 데이터에 대한 영상 신호 처리를 수행하는 동작 1241을 수행할 수 있다. 여기서, 영상 신호 처리는 전자 장치(예: 도 1 및 3의 전 자 장치)에 포함된 영상 신호 처리 체인(ISP chain)에 의해 수행될 수 있다. 동작 1241에서 수행되는 영 상 신호 처리는 동작 1231에서 이용되는 기계 학습된 모델을 이용하지 않고 수행될 수 있다. 예를 들어, 동작 1241에서, 전자 장치(예: 도 1 및 3의 전자 장치)는 화이트 밸런스, 디모자이크, 감마 보정, 색상 보정, 노이즈 저감, 또는 샤프닝 중 적어도 하나를 수행하기 위한 영상 신호 체인에 기초하여 원시 영상 데이터에 대 한 영상 처리를 수행할 수 있다. 동작 1243에서, 전자 장치(예: 도 1 및 3의 전자 장치)는 동작 1241에서 수행된 영상 신호 처리의 결과에 기초하여 제1 이미지를 획득할 수 있다. 동작 1241에서, 일 실시예에 따른 전자 장치(예: 도 1 및 3의 전자 장치)에 의해 수행되는 영상 신호 처리 는 원시 영상 데이터를 디모자이크를 수행할 수 있는 데이터로 변환하는 동작을 포함할 수 있다. 원시 영상 데 이터를 변환하는 동작은 원시 영상 데이터에 포함된 픽셀들을 병합하는 또는 비닝(binning) 연산하는 동작을 포 함할 수 있다. 예를 들어, 도 5에 도시된 헥사데카 패턴을 가지는 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이미지 센서)에 포함된 하나의 포토 다이오드에 상응하는 수광 소자 하나의 출력을 하나의 픽셀 값 으로 구성하는 경우 해상도를 유지하면서 원하는 품질의 영상을 획득하기 어려울 수 있다. 그러나, 도 13에 도 시된 예시와 같이 픽셀들을 병합하여 처리하는 경우, 해상도는 낮아지지만 베이어 패턴의 영상을 획득할 수 있 다. 도 13은 일 실시예에 따른 전자 장치(예: 도 1 및 3의 전자 장치)가 이미지를 획득하기 위해 수행하는 영 상 신호 처리 과정을 개념적으로 도시한 도면이다. 일 실시예에서, 제1 촬영 모드에 기초하여 동작하는 동안, 도 5에 도시된 헥사데카 패턴을 가지는 이미지 센서 (예: 도 2의 이미지 센서, 도 3의 이미지 센서)는 제1 패턴을 가지는 제1 원시 영상 데이터를 출력할 수 있다. 예를 들어, 도 12의 동작 1231에서 기계 학습된 모델에 입력되는 제1 원시 영상 데이터는 제1 패턴을 가질 수 있다. 그러나, 동작 1241에서, 일 실시예에 따른 전자 장치(예: 도 1 및 3의 전자 장치 )는 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이미지 센서)가 출력하는 데이터의 패턴을 제 1 패턴으로부터 디모자이크를 수행할 수 있는 패턴(예: 패턴 또는 패턴)으로 변경하도록 할 수 있다. 예를 들어, 전자 장치(예: 도 1 및 3의 전자 장치)는 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이미지 센서)가 출력하는 제1 원시 영상 데이터가 제1 패턴 내에서 동일한 색상 채널에 대한 정보를 포함하는 4x4 배열의 픽셀들을 병합하는 베이어 병합(Bayer merge)을 수행하여 베이어 패턴에 상응하는 제2 패 턴을 가지도록 할 수 있다. 이 경우 패턴이 변경된 제1 원시 영상 데이터는 패턴의 변경 이전에 대비하 여 1/16의 해상도를 가질 수 있다. 따라서 전자 장치(예: 도 1 및 3의 전자 장치)는 패턴이 변경된 제1 원시 영상 데이터를 열 여섯배 확대(upscale)할 수 있다. 또는, 예를 들어, 전자 장치(예: 도 1 및 3의 전자 장치)는 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이미지 센서)가 출력하는 제1 원시 영상 데이터가 제1 패턴 내에서 동일한 색상 채널에 대한 정보를 포함하는 2x2 배열의 픽셀들을 병합하여 테트라(tetra) 패턴에 상응하는 제3 패턴을 가지도록 할 수 있다. 전자 장치(예: 도 1 및 3의 전자 장치)는 제3 패턴에 대하여 리모자이크를 수행하여 베이 어 패턴에 상응하는 제4 패턴을 가지도록 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이미지 센서)의 출력을 변경할 수 있다. 이 경우 패턴이 변경된 제1 원시 영상 데이터는 패턴의 변경 이전에 대비하 여 1/4의 해상도를 가질 수 있다. 따라서 전자 장치(예: 도 1 및 3의 전자 장치)는 패턴이 변경된 제1 원 시 영상 데이터를 네 배 확대(upscale)할 수 있다. 도 14는 일 실시예에 따른 전자 장치(예: 도 1 및 3의 전자 장치)가 이미지 센서(예: 도 2의 이미지 센서 , 도 3의 이미지 센서)의 동작에 관련된 세 가지 모드에 기초하여 이미지를 획득하는 프로세스를 도 시한 흐름도이다. 일 실시예에 따른 전자 장치(예: 도 1 및 3의 전자 장치)는, 동작 1410에서, 영상을 촬영하기 위한 촬영 모드를 결정할 수 있다. 예를 들어, 전자 장치(예: 도 1 및 3의 전자 장치)는 촬영 모드를 선택하기 위한 사용자 입력을 수신하고, 수신된 사용자 입력에 기초하여 촬영 모드를 결정할 수 있다. 또는, 예를 들어, 전자 장치(예: 도 1 및 3의 전자 장치)는 디폴트(default) 설정에 기초하여 영상을 촬영하기 위한 촬영 모드를 결정할 수 있다. 또는, 예를 들어, 전자 장치(예: 도 1 및 3의 전자 장치)는 이전에 설정된 촬영 모드에 기초하여 영상을 촬영하기 위한 촬영 모드를 결정할 수 있다. 일 실시예에 따른 전자 장치(예: 도 1 및 3의 전자 장치)는, 동작 1420에서 결정된 촬영 모드가 제1 해상 도에 상응하는 제1 촬영 모드인지 여부를 판단할 수 있다. 제1 해상도는, 예를 들어, 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이미지 센서)를 통해서 제공할 수 있는 최고 해상도에 상응할 수 있다. 다만, 이에 한정되지 아니한다. 결정된 촬영 모드가 제1 촬영 모드인 경우, 동작 1431에서, 전자 장치(예: 도 1 및 3 의 전자 장치)는 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이미지 센서)가 제1 해상도에 상 응하는 제1 원시 데이터를 출력하도록 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이미지 센서)를 제어할 수 있다. 여기서, 제1 원시 영상 데이터는, 예를 들어, 베이어 패턴에 상응하지 않는 패턴을 가지는 제 1 해상도의 원시 영상일 수 있다. 동작 1432에서, 일 실시예에 따른 전자 장치(예: 도 1 및 3의 전자 장치)는 제1 원시 영상 데이터에 기초 하여 제1 해상도의 제1 이미지를 획득할 수 있다. 일 실시예에서, 전자 장치(예: 도 1 및 3의 전자 장치(10 1))는 제1 원시 영상 데이터를 기계 학습에 기초하여 생성된 예측 모델에 입력한 결과에 기초하여 제1 이미지를 획득할 수 있다. 일 실시예에 따른 전자 장치(예: 도 1 및 3의 전자 장치)는 제1 이미지를 메모리(예: 도 1의 메모리, 도 3의 메모리)에 저장하거나, 외부 장치로 전송하거나, 디스플레이(예: 도 1의 디스플 레이 모듈, 도 3의 디스플레이)를 통해서 출력할 수 있다. 동작 1430에서, 결정된 촬영 모드가 제1 촬영 모드가 아닌 경우, 일 실시예에 따른 전자 장치(예: 도 1 및 3의 전자 장치)는 결정된 촬영 모드가 제2 촬영 모드인지 여부를 결정할 수 있다. 제2 촬영 모드는 제1 해상 도보다 낮은 제2 해상도에 상응할 수 있다. 도 14에서 도시된 흐름도는 동작 1420 및 동작 1430을 별도 로 도시하였으나, 이에 한정되지 아니한다. 예를 들어, 동작 1420 및 동작 1430은 결정된 촬영 모드가 제1 촬 영 모드인 경우 동작 1431을 수행하고, 제2 촬영 모드인 경우 동작 1441을 수행하고, 제3 촬영 모드인 경우 동 작 1451을 수행하는 동작으로 대체될 수 있다. 결정된 촬영 모드가 제2 촬영 모드인 경우, 일 실시예에 따른 전자 장치(예: 도 1 및 3의 전자 장치)는, 동작 1441에서, 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이미지 센서)가 제2 해상도에 상응하는 제2 원시 영상 데이터를 출력하도록 제어할 수 있다. 제2 원시 영상 데이터는, 예를 들어, 리모자이크 연산을 통해서 베이어 패턴을 가지도록 구성된 데이터를 포함할 수 있다. 동작 1442에서, 일 실시예에 따른 전자 장치(예: 도 1 및 3의 전자 장치)는 제2 원시 영상 데이터에 기초 하여 제2 해상도의 제2 이미지를 획득할 수 있다. 일 실시예에서, 전자 장치(예: 도 1 및 3의 전자 장치) 는 제2 원시 영상 데이터에 대한 적어도 하나의 영상 신호 처리를 수행하여 제2 이미지를 획득할 수 있다. 일 실시예에 따른 전자 장치(예: 도 1 및 3의 전자 장치)는 제2 이미지를 메모리(예: 도 1의 메모리, 도 3의 메모리)에 저장하거나, 외부 장치로 전송하거나, 디스플레이(예: 도 1의 디스플레이 모듈, 도 3 의 디스플레이)를 통해서 출력할 수 있다. 결정된 촬영 모드가 제3 촬영 모드인 경우(또는, 제1 촬영 모드 및 제2 촬영 모드가 아닌 경우), 일 실시예에 따른 전자 장치(예: 도 1 및 3의 전자 장치)는, 동작 1451에서, 이미지 센서(예: 도 2의 이미지 센서 , 도 3의 이미지 센서)가 제3 해상도에 상응하는 제3 원시 영상 데이터를 출력하도록 제어할 수 있다. 제3 촬영 모드는 제2 해상도보다 낮은 제3 해상도에 상응할 수 있다. 제3 원시 영상 데이터는, 예를 들 어, 수광 소자들의 출력 값을 아날로그적 및/또는 디지털적으로 병합하여 베이어 패턴을 가지도록 구성된 데이터를 포함할 수 있다. 동작 1452에서, 일 실시예에 따른 전자 장치(예: 도 1 및 3의 전자 장치)는 제3 원시 영상 데이터에 기초 하여 제3 해상도의 제3 이미지를 획득할 수 있다. 일 실시예에서, 전자 장치(예: 도 1 및 3의 전자 장치(10 1))는 제3 원시 영상 데이터에 대한 적어도 하나의 영상 신호 처리를 수행하여 제3 이미지를 획득할 수 있다. 일 실시예에 따른 전자 장치(예: 도 1 및 3의 전자 장치)는 제3 이미지를 메모리(예: 도 1의 메모리, 도 3의 메모리)에 저장하거나, 외부 장치로 전송하거나, 디스플레이(예: 도 1의 디스플레이 모듈, 도 3의 디스플레이)를 통해서 출력할 수 있다. 카메라 기술의 발달에 따라 이미지 센서에 포함되는 수광 소자의 집적도가 높아짐에 따라 서로 인접한 복수개의 수광 소자들이 색상 필터 내의 동일한 색상의 색상 채널에 대응되도록 배치될 수 있다. 이러한 구조를 가지는 이미지 센서는 둘 이상의 모드에 기초하여 동작할 수 있다. 이미지 센서는 각 수광 소자에서 검출되어 출력되 는 데이터에 대해 가지도록 비닝(binning)이나 합산(sum) 처리를 통해서 베이어 패턴을 가지도록 할 수 있다. 이미지 센서는 출력되는 데이터의 패턴을 변환하여 베이어 패턴을 가지도록 할 수 있다. 이미지 센서는 패턴을 변환하기 위해 색상 순서(color order)를 변경하고 변경된 색상의 값을 추측할 수 있다. 패턴을 변환하기 위해 색상 순서를 변경하고 변경된 색상의 값을 추측하는 동작을 리모자이크(remosaic)라고 언급할 수 있다. 그러나 특정 패턴(예: 헥사데카 패턴)의 경우에는 리모자이크를 수행한 결과에 의해 아티팩트(artifact)가 제거 된 영상을 얻기 어려울 수 있다. 또한, 높은 화질을 영상을 얻기 위해서는 변조 전달 함수(modulation transfer function, MTF)의 값을 확보하여야 한다. 그러나 특정 패턴의 경우에는 리모자이크를 수행하더라도 MTF 값을 확 보하기 어려울 수 있다. 본 문서에서 이루고자 하는 기술적 과제는 이상에서 언급한 기술적 과제로 제한되지 않으며, 언급되지 않은 또"}
{"patent_id": "10-2023-0034783", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "다른 기술적 과제들은 아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다. 일 실시예에서, 전자 장치(예: 도 1 및 3의 전자 장치)는 렌즈부(예: 도 3의 렌즈부) 및 상기 렌즈부 (예: 도 3의 렌즈부)를 통과한 광 신호를 디지털 신호로 전환하는 이미지 센서(예: 도 2의 이미지 센서 , 도 3의 이미지 센서)를 포함하는 카메라(예: 도 1의 카메라 모듈, 도 3의 카메라); 인스 트럭션들을 저장하는 메모리(예: 도 1의 메모리, 도 3의 메모리); 및 적어도 하나의 프로세서(예: 도 1의 프로세서, 도 2의 이미지 시그널 프로세서, 도 3의 적어도 하나의 프로세서)를 포함할 수 있다. 상기 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이미지 센서)는 복수개의 수광 소자들(예: 도 4의 수광부), 복수개의 마이크로 렌즈들(예: 도 4의 마이크로 렌즈 배열) 및 복수개의 색상 채널 들을 포함하는 색상 필터(예: 도 4의 색상 필터)를 포함할 수 있다. 상기 복수개의 수광 소자들(예: 도 4 의 수광부)은 M x N 배열로 하나의 제1 마이크로 렌즈(예: 도 5의 제1 마이크로 렌즈)에 대응되도록 배치된 복수개의 포토 다이오드들(예: 도 5의 제1 포토 다이오드, 제2 포토 다이오드, 제3 포토 다이 오드, 제4 포토 다이오드)을 포함하고, 대응되도록 배치될 수 있다. M 또는 N 중 적어도 하나는 2 이상의 자연수일 수 있다. 상기 적어도 하나의 프로세서(예: 도 1의 프로세서, 도 2의 이미지 시그널 프 로세서, 도 3의 적어도 하나의 프로세서)는, 상기 인스트력션들을 실행 시에, 상기 카메라(예: 도 1 의 카메라 모듈, 도 3의 카메라)를 이용하여 촬영할 영상의 해상도에 상응하는 촬영 모드를 결정하도 록 구성될 수 있다. 상기 적어도 하나의 프로세서(예: 도 1의 프로세서, 도 2의 이미지 시그널 프로세서 , 도 3의 적어도 하나의 프로세서)는, 상기 인스트력션들을 실행 시에, 상기 결정된 촬영 모드가 제1 해상도에 상응하는 것에 기초하여, 상기 복수개의 포토 다이오드들(예: 도 5의 제1 포토 다이오드, 제2 포 토 다이오드, 제3 포토 다이오드, 제4 포토 다이오드) 중 하나의 포토 다이오드에 상응하는 제 1 수광 소자의 출력이 하나의 픽셀에 대응되도록 독출된 제1 데이터에 상응하는 제1 원시 영상 데이터를 출력하 도록 상기 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이미지 센서)를 제어하도록 구성될 수 있다. 상기 적어도 하나의 프로세서(예: 도 1의 프로세서, 도 2의 이미지 시그널 프로세서, 도 3의 적어도 하나의 프로세서)는, 상기 인스트력션들을 실행 시에, 상기 제1 원시 영상 데이터를 기계 학습을 통해서 생성된 모델에 입력한 결과에 기초하여 상기 제1 해상도에 상응하는 제1 이미지를 획득하도록 구성될 수 있다. 상기 적어도 하나의 프로세서(예: 도 1의 프로세서, 도 2의 이미지 시그널 프로세서, 도 3의 적어도 하나의 프로세서)는, 상기 인스트력션들을 실행 시에, 상기 결정된 촬영 모드가 상기 제1 해상도보다 낮은 제2 해상도에 상응하는 것에 기초하여, 상기 복수개의 포토 다이오드들(예: 도 5의 제1 포토 다이오드, 제 2 포토 다이오드, 제3 포토 다이오드, 제4 포토 다이오드) 중 적어도 둘 이상의 포토 다이오드 들에 상응하는 제2 수광 소자들의 출력이 하나의 픽셀에 대응되도록 독출된 제2 데이터에 대해 적어도 하나의영상 처리를 수행하여 획득된 제2 원시 영상 데이터를 출력하도록 상기 이미지 센서(예: 도 2의 이미지 센서 , 도 3의 이미지 센서)를 제어할 수 있다. 상기 제2 원시 영상 데이터에 대한 영상 신호 처리를 수 행하여 상기 제2 해상도에 상응하는 제2 이미지를 획득하도록 구성될 수 있다. 일 실시예에서, 상기 제1 원시 영상 데이터는 상기 독출된 데이터의 색상 순서(color order)가 유지된 데이터를 포함할 수 있다. 일 실시예에서, 상기 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이미지 센서)는, 베이어 패턴을 가지도록 상기 제2 데이터의 색상 순서를 변경하는 리모자이크 처리를 수행하여 상기 제2 원시 영상 데이터를 출력하도록 구성될 수 있다. 일 실시예에서, 상기 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이미지 센서)는, 상기 카메라(예: 도 1의 카메라 모듈, 도 3의 카메라)의 줌 배율 또는 상기 렌즈부(예: 도 3의 렌즈부)의 초점 위치 중 적어도 하나에 기초하여 상기 제1 데이터를 교정하여 상기 제1 원시 영상 데이터를 출력하도록 구성될 수 있다. 일 실시예에서, 상기 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이미지 센서)는 상기 네 개의 포 토 다이오드들(예: 도 5의 제1 포토 다이오드, 제2 포토 다이오드, 제3 포토 다이오드, 제4 포 토 다이오드)에 대한 광의 분배 비율을 보상하여 상기 제1 데이터를 교정하도록 구성될 수 있다. 일 실시예에서, 상기 전자 장치(예: 도 1 및 3의 전자 장치)는 디스플레이(예: 도 1의 디스플레이 모듈 , 도 3의 디스플레이)를 포함할 수 있다. 상기 적어도 하나의 프로세서(예: 도 1의 프로세서, 도 2의 이미지 시그널 프로세서, 도 3의 적어도 하나의 프로세서)는, 상기 인스트력션들을 실행 시에, 상기 카메라(예: 도 1의 카메라 모듈, 도 3의 카메라)를 이용하여 영상을 촬영하기 위한 카메 라 어플리케이션을 실행하도록 구성될 수 있다. 상기 적어도 하나의 프로세서(예: 도 1의 프로세서, 도 2 의 이미지 시그널 프로세서, 도 3의 적어도 하나의 프로세서)는, 상기 인스트력션들을 실행 시에, 상 기 실행된 카메라 어플리케이션에 기초하여 상기 해상도를 선택하기 위한 사용자 인터페이스를 포함하는 화면을 상기 디스플레이(예: 도 1의 디스플레이 모듈, 도 3의 디스플레이)를 통해서 표시하도록 구성될 수 있다. 상기 적어도 하나의 프로세서(예: 도 1의 프로세서, 도 2의 이미지 시그널 프로세서, 도 3의 적어도 하나의 프로세서)는, 상기 인스트력션들을 실행 시에, 상기 사용자 인터페이스에 기초하여 수신된 사용자 입력에 기초하여 결정된 촬영 모드에 기초하여 상기 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이미지 센서)를 제어하도록 구성될 수 있다. 일 실시예에서, 상기 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이미지 센서)의 상기 복수개의 마 이크로 렌즈들은 상기 제1 마이크로 렌즈(예: 도 5의 제1 마이크로 렌즈)을 포함하는 네 개의 제2 마이크 로 렌즈들(예: 도 5의 제1 마이크로 렌즈, 제2 마이크로 렌즈, 제3 마이크로 렌즈 및 제4 마이 크로 렌즈)이 상기 색상 필터 내의 하나의 색상 채널(예: 도 5의 녹색 채널)에 상응하도록 배치될 수 있다. 상기 제2 원시 영상 데이터에 포함된 하나의 픽셀은 네 개의 포토 다이오드들(예: 도 5의 제1 포토 다이 오드, 제2 포토 다이오드, 제3 포토 다이오드, 제4 포토 다이오드)의 출력에 상응할 수 있 다. 상기 적어도 하나의 프로세서(예: 도 1의 프로세서, 도 2의 이미지 시그널 프로세서, 도 3의 적 어도 하나의 프로세서)는, 상기 인스트력션들을 실행 시에, 상기 결정된 촬영 모드가 상기 제2 해상도보다 낮은 제3 해상도에 상응하는 것에 기초하여, 상기 복수개의 수광 소자들(예: 도 4의 수광부) 중 상기 하나 의 색상 채널(예: 도 5의 녹색 채널)에 상응하도록 배치된 포토 다이오드들에 상응하는 제3 수광 소자들의 출력이 이미지의 하나의 픽셀에 대응되도록 독출된 제3 데이터에 대해 적어도 하나의 영상 처리를 수행하여 제3 원시 데이터를 출력하도록 상기 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이미지 센서)를 제어할 수 있다. 상기 적어도 하나의 프로세서(예: 도 1의 프로세서, 도 2의 이미지 시그널 프로세서, 도 3 의 적어도 하나의 프로세서)는, 상기 인스트력션들을 실행 시에, 상기 제3 원시 영상 데이터에 대한 영상 처리 신호를 수행하여 상기 제3 해상도에 상응하는 제3 이미지를 획득하도록 구성될 수 있다. 일 실시예에서, 상기 적어도 하나의 프로세서(예: 도 1의 프로세서, 도 2의 이미지 시그널 프로세서, 도 3의 적어도 하나의 프로세서)는, 상기 인스트력션들을 실행 시에, 상기 결정된 촬영 모드가 상기 제1 해상도에 상응하는 동안 상기 영상 촬영과 연관된 상황에 대한 정보를 획득하도록 구성될 수 있다. 상기 적어 도 하나의 프로세서(예: 도 1의 프로세서, 도 2의 이미지 시그널 프로세서, 도 3의 적어도 하나의 프 로세서)는, 상기 인스트력션들을 실행 시에, 상기 상황에 대한 정보가 지정된 상황에 상응하는 것에 기초 하여, 상기 제1 원시 영상 데이터에 대한 영상 신호 처리를 수행하여 상기 제1 이미지를 출력하도록 구성될 수있다. 상기 적어도 하나의 프로세서(예: 도 1의 프로세서, 도 2의 이미지 시그널 프로세서, 도 3의 적어도 하나의 프로세서)는, 상기 인스트력션들을 실행 시에, 상기 상황에 대한 정보가 상기 지정된 상황 에 상응하지 않는 것에 기초하여, 상기 제1 원시 영상 데이터를 기계 학습을 통해서 생성된 모델에 입력한 결과 에 기초하여 상기 제1 해상도에 상응하는 제1 이미지를 획득하도록 구성될 수 있다. 일 실시예에서, 상기 지정된 상황은 조도가 임계치 미만인 제1 상황, 촬영된 영상이 디포커스된 제2 상황, 또는 영상에 포함된 고주파 성분이 임계치 미만인 제3 상황 중 적어도 하나를 포함할 수 있다. 상기 제1 원시 영상 데이터에 대한 영상 신호 처리는 상기 제1 원시 영상 데이터의 픽셀들에 대한 비닝(binning) 처리 과정 또는 상 기 제1 원시 영상 데이터의 패턴을 베이어 패턴으로 변환하는 리모자이크 과정 및 이미지를 확대하는 업스케일 링 과정을 포함할 수 있다. 일 실시예에 따라 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이미지 센서)를 포함하는 카메라(예: 도 1의 카메라 모듈, 도 3의 카메라)를 포함하는 전자 장치(예: 도 1 및 3의 전자 장치)를 동작 하는 방법은, 상기 카메라(예: 도 1의 카메라 모듈, 도 3의 카메라)를 이용하여 촬영할 영상의 해상 도에 상응하는 촬영 모드를 결정하는 동작을 포함할 수 있다. 상기 방법은 상기 결정된 촬영 모드가 제1 해상도 에 상응하는 것에 기초하여, 상기 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이미지 센서)의 복수 개의 포토 다이오드들(예: 도 5의 제1 포토 다이오드, 제2 포토 다이오드, 제3 포토 다이오드, 제4 포토 다이오드) 중 하나의 포토 다이오드에 상응하는 제1 수광 소자의 출력이 하나의 픽셀에 대응되도 록 독출된 제1 데이터에 상응하는 제1 원시 영상 데이터를 출력하도록 상기 이미지 센서(예: 도 2의 이미지 센 서, 도 3의 이미지 센서)를 제어하는 동작을 포함할 수 있다. 상기 방법은, 상기 제1 원시 영상 데 이터를 기계 학습을 통해서 생성된 모델에 입력한 결과에 기초하여 상기 제1 해상도에 상응하는 제1 이미지를 획득하는 동작을 포함할 수 있다. 상기 방법은, 상기 결정된 촬영 모드가 상기 제1 해상도보다 낮은 제2 해상 도에 상응하는 것에 기초하여, 상기 복수개의 포토 다이오드들(예: 도 5의 제1 포토 다이오드, 제2 포토 다이오드, 제3 포토 다이오드, 제4 포토 다이오드) 중 적어도 둘 이상의 포토 다이오드에 상응 하는 제2 수광 소자들의 출력이 하나의 픽셀에 대응되도록 독출된 제2 데이터에 대해 적어도 하나의 영상 처리 를 수행하여 획득된 제2 원시 영상 데이터를 출력하는 동작을 포함할 수 있다. 상기 방법은, 상기 제2 원시 영 상 데이터에 대한 영상 신호 처리를 수행하여 상기 제2 해상도에 상응하는 제2 이미지를 획득하는 동작을 포함 할 수 있다. 상기 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이미지 센서)는 M x N 배열로 하나 의 제1 마이크로 렌즈)에 대응되도록 배치된 복수개의 포토 다이오드들(예: 도 5의 제1 포토 다이오드 , 제2 포토 다이오드, 제3 포토 다이오드, 제4 포토 다이오드)을 포함하는 복수개의 수광 소자들을 포함할 수 있다. M 또는 N 중 적어도 하나는 2 이상의 자연수일 수 있다. 일 실시예에서, 상기 제1 원시 영상 데이터는 상기 독출된 데이터의 색상 순서가 유지된 데이터를 포함할 수 있 다. 일 실시예에서, 상기 제2 원시 영상 데이터를 출력하는 동작은, 상기 이미지 센서(예: 도 2의 이미지 센서 , 도 3의 이미지 센서)가 베이어 패턴을 가지도록 상기 제2 데이터의 색상 순서를 변경하는 리모자이 크 처리를 수행하여 상기 제2 원시 영상 데이터를 획득하는 동작을 포함할 수 있다. 일 실시예에서, 상기 제1 원시 영상 데이터를 출력하는 동작은, 상기 이미지 센서(예: 도 2의 이미지 센서 , 도 3의 이미지 센서)가 상기 카메라(예: 도 1의 카메라 모듈, 도 3의 카메라)의 줌 배율 또는 카메라(예: 도 1의 카메라 모듈, 도 3의 카메라)의 렌즈부(예: 도 3의 렌즈부)의 초점 위 치 중 적어도 하나에 기초하여 상기 제1 데이터를 교정하는 동작을 포함할 수 있다. 일 실시예에서, 상기 제1 데이터를 교정하는 동작은, 상기 포토 다이오드들(예: 도 5의 제1 포토 다이오드 , 제2 포토 다이오드, 제3 포토 다이오드, 제4 포토 다이오드)에 대한 광의 분배 비율을 보상하는 동작을 포함할 수 있다. 일 실시예에서, 상기 촬영 모드를 결정하는 동작은, 상기 카메라(예: 도 1의 카메라 모듈, 도 3의 카메라 )를 이용하여 영상을 촬영하기 위한 카메라 어플리케이션을 실행하는 동작을 포함할 수 있다. 상기 촬영 모드를 결정하는 동작은, 상기 실행된 카메라 어플리케이션에 기초하여 상기 해상도를 선택하기 위한 사용자 인 터페이스를 포함하는 화면을 디스플레이하는 동작을 포함할 수 있다. 상기 촬영 모드를 결정하는 동작은, 상기 사용자 인터페이스에 기초하여 수신된 사용자 입력에 기초하여 촬영 모드를 결정하는 동작을 포함할 수 있다. 일 실시예에서, 상기 제2 원시 영상 데이터에 포함된 하나의 픽셀은 네 개의 포토 다이오드들(예: 도 5의 제1 포토 다이오드, 제2 포토 다이오드, 제3 포토 다이오드, 제4 포토 다이오드)의 출력에 상 응할 수 있다. 상기 방법은 상기 결정된 촬영 모드가 상기 제2 해상도보다 낮은 제3 해상도에 상응하는 것에 기 초하여, 상기 이미지 센서의 색상 필터에 포함된 하나의 색상 채널(예: 도 5의 녹색 채널)에 상응하도록 배치된 복수개의 포토 다이오드들에 상응하는 제3 수광 소자들의 출력이 하나의 픽셀에 대응되도록 독출된 제3 데이터에 기초하여 제3 원시 데이터를 출력하는 동작을 포함할 수 있다. 상기 방법은, 상기 제3 원시 영상 데 이터에 대한 영상 처리 신호를 수행하여 상기 제3 해상도에 상응하는 제3 이미지를 획득하는 동작을 포함할 수 있다. 일 실시예에서, 상기 제1 이미지를 획득하는 동작은, 상기 영상 촬영과 연관된 상황에 대한 정보를 획득하는 동 작을 포함할 수 있다. 상기 제1 이미지를 획득하는 동작은, 상기 상황에 대한 정보가 지정된 상황에 상응하는 것에 기초하여, 상기 제1 원시 영상 데이터에 대한 영상 신호 처리를 수행하여 상기 제1 이미지를 획득하는 동 작을 포함할 수 있다. 상기 제1 이미지를 획득하는 동작은, 상기 상황에 대한 정보가 상기 지정된 상황에 상응 하지 않는 것에 기초하여, 상기 제1 원시 영상 데이터를 기계 학습을 통해서 생성된 모델에 입력한 결과에 기초 하여 상기 제1 해상도에 상응하는 제1 이미지를 획득하는 동작을 포함할 수 있다. 일 실시예에서, 상기 지정된 상황은 조도가 임계치 미만인 제1 상황, 촬영된 영상이 디포커스된 제2 상황, 또는 영상에 포함된 고주파 성분이 임계치 미만인 제3 상황 중 적어도 하나를 포함할 수 있다. 상기 제1 원시 영상 데이터에 대한 영상 신호 처리는 상기 제1 원시 영상 데이터의 픽셀들에 대한 비닝(binning) 처리 과정 또는 상 기 제1 원시 영상 데이터의 패턴을 베이어 패턴으로 변환하는 리모자이크 과정 및 이미지를 확대하는 업스케일 링 과정을 포함할 수 있다. 일 실시예에 따른 이미지 센서(예: 도 2의 이미지 센서, 도 3의 이미지 센서)는, 복수개의 수광 소자 들(예: 도 4의 수광부); 복수개의 마이크로 렌즈들; 및 복수개의 색상 채널들을 포함하는 색상 필터를 포 함할 수 있다. 상기 복수개의 수광 소자들(예: 도 4의 수광부)은 M x N 배열로 하나의 제1 마이크로 렌즈 (예: 도 5의 제1 마이크로 렌즈)에 대응되도록 배치된 복수개의 포토 다이오드들(예: 도 5의 제1 포토 다 이오드, 제2 포토 다이오드, 제3 포토 다이오드, 제4 포토 다이오드)을 포함할 수 있다. M 또는 N 중 적어도 하나는 2 이상의 자연수일 수 있다. 상기 이미지 센서(예: 도 2의 이미지 센서, 도 3 의 이미지 센서)는, 제1 해상도에 상응하는 제1 촬영 모드에 기초하여 동작하는 동안, 상기 복수개의 포토 다이오드들(예: 도 5의 제1 포토 다이오드, 제2 포토 다이오드, 제3 포토 다이오드, 제4 포토 다이오드) 중 하나의 포토 다이오드에 상응하는 제1 수광 소자의 출력이 하나의 픽셀에 대응되도록 독출된 제1 데이터에 상응하는 제1 원시 영상 데이터를 출력하도록 구성될 수 있다. 상기 이미지 센서(예: 도 2의 이 미지 센서, 도 3의 이미지 센서)는, 상기 제1 해상도보다 낮은 제2 해상도에 상응하는 제2 촬영 모드 에 기초하여 동작하는 동안, 상기 복수개의 포토 다이오드들(예: 도 5의 제1 포토 다이오드, 제2 포토 다 이오드, 제3 포토 다이오드, 제4 포토 다이오드) 중 적어도 둘 이상의 포토 다이오드들에 상응 하는 제2 수광 소자들의 출력이 하나의 픽셀에 대응되도록 독출된 제2 데이터에 대해 적어도 하나의 영상 처리 를 수행하여 획득된 제2 원시 영상 데이터를 출력하도록 구성될 수 있다. 일 실시예에서, 상기 제1 원시 영상 데이터는 상기 독출된 데이터의 색상 순서가 유지된 데이터를 포함할 수 있 다. 일 실시예에 따른 컴퓨터로 판독 가능한 비일시적 기록매체는, 전자 장치(예: 도 1 및 3의 전자 장치)가 실행 시에 상술한 방법을 수행하도록 하는 컴퓨터 프로그램을 기록한 것일 수 있다. 다양한 실시예들에 따르면, 이미지 센서가 높은 화소 수를 가지는 이미지를 획득하기 위한 동작 모드에 기초하 여 동작하면서도 아티팩트가 제거된 영상을 획득할 수 있는 전자 장치 및/또는 그 동작 방법이 제공될 수 있다. 다양한 실시예들에 다르면, 이미지 센서가 높은 화소 수를 가지는 이미지를 획득하기 위한 동작 모드에 기초하 여 동작하면서도 높은 MTF 값을 얻을 수 있는 전자 장치 및/또는 그 동작 방법이 제공될 수 있다. 본 개시에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효과들은 아래의 기재로부터 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다. 본 개시의 청구항 또는 명세서에 기재된 실시예들에 따른 방법들은 하드웨어, 소프트웨어, 또는 하드웨어와 소 프트웨어의 조합의 형태로 구현될(implemented) 수 있다. 소프트웨어로 구현하는 경우, 하나 이상의 프로그램(소프트웨어 모듈)을 저장하는 컴퓨터 판독 가능 저장 매체 가 제공될 수 있다. 컴퓨터 판독 가능 저장 매체에 저장되는 하나 이상의 프로그램은, 전자 장치(device) 내의 하나 이상의 프로세서에 의해 실행 가능하도록 구성된다(configured for execution). 하나 이상의 프로그램은, 전자 장치로 하여금 본 개시의 청구항 또는 명세서에 기재된 실시예들에 따른 방법들을 실행하게 하는 명령어 (instructions)를 포함한다. 이러한 프로그램(소프트웨어 모듈, 소프트웨어)은 랜덤 액세스 메모리 (random access memory), 플래시(flash) 메모리를 포함하는 불휘발성(non-volatile) 메모리, 롬(ROM: read only memory), 전기적 삭제가능 프로그램가 능 롬(EEPROM: electrically erasable programmable read only memory), 자기 디스크 저장 장치(magnetic disc storage device), 컴팩트 디스크 롬(CD-ROM: compact disc-ROM), 디지털 다목적 디스크(DVDs: digital versatile discs) 또는 다른 형태의 광학 저장 장치, 마그네틱 카세트(magnetic cassette)에 저장될 수 있다. 또는, 이들의 일부 또는 전부의 조합으로 구성된 메모리에 저장될 수 있다. 또한, 각각의 구성 메모리는 다수 개 포함될 수도 있다. 또한, 상기 프로그램은 인터넷(Internet), 인트라넷(Intranet), LAN(local area network), WLAN(wide LAN), 또 는 SAN(storage area network)과 같은 통신 네트워크, 또는 이들의 조합으로 구성된 통신 네트워크를 통하여 접 근(access)할 수 있는 부착 가능한(attachable) 저장 장치(storage device)에 저장될 수 있다. 이러한 저장 장 치는 외부 포트를 통하여 본 개시의 실시 예를 수행하는 장치에 접속할 수 있다. 또한, 통신 네트워크상의 별도 의 저장장치가 본 개시의 실시 예를 수행하는 장치에 접속할 수도 있다. 상술한 본 개시의 구체적인 실시예들에서, 개시에 포함되는 구성 요소는 제시된 구체적인 실시 예에 따라 단수 또는 복수로 표현되었다. 그러나, 단수 또는 복수의 표현은 설명의 편의를 위해 제시한 상황에 적합하게 선택된 것으로서, 본 개시가 단수 또는 복수의 구성 요소에 제한되는 것은 아니며, 복수로 표현된 구성 요소라 하더라 도 단수로 구성되거나, 단수로 표현된 구성 요소라 하더라도 복수로 구성될 수 있다. 또한, 본 개시에서, “부”, “모듈” 등의 용어는 프로세서 또는 회로와 같은 하드웨어 구성(hardware component), 및/또는 프로세서와 같은 하드웨어 구성에 의해 실행되는 소프트웨어 구성(software component)일 수 있다. \"부\", \"모듈\"은 어드레싱될 수 있는 저장 매체에 저장되며 프로세서에 의해 실행될 수 있는 프로그램에 의해 구 현될 수도 있다. 예를 들어, “부”, \"모듈\" 은 소프트웨어 구성 요소들, 객체 지향 소프트웨어 구성 요소들, 클래스 구성 요소들 및 태스크 구성 요소들과 같은 구성 요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로 코드, 회로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레이들 및 변수들에 의해 구현될 수 있다. 본 개시에서 설명된 특정 실행들은 일 실시예일 뿐이며, 어떠한 방법으로도 본 개시의 범위를 한정하는 것은 아 니다. 명세서의 간결함을 위하여, 종래 전자적인 구성들, 제어 시스템들, 소프트웨어, 및 상기 시스템들의 다른 기능적인 측면들의 기재는 생략될 수 있다. 또한, 본 개시에서, “a, b 또는 c 중 적어도 하나를 포함한다”는 “a만 포함하거나, b만 포함하거나, c만 포 함하거나, a 및 b를 포함하거나, b 및 c를 포함하거나, a 및 c를 포함하거나, a, b 및 c를 모두 포함하는 것을 의미할 수 있다. 한편 본 개시의 상세한 설명에서는 구체적인 실시 예에 관해 설명하였으나, 본 개시의 범위에서 벗어나지 않는 한도 내에서 여러 가지 변형이 가능함은 물론이다. 그러므로 본 개시의 범위는 설명된 실시 예에 국한되어 정해 져서는 아니 되며 후술하는 특허청구의 범위뿐만 아니라 이 특허청구의 범위와 균등한 것들에 의해 정해져야 한 다. 부호의 설명도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13 도면14"}
{"patent_id": "10-2023-0034783", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치를 도시한 블록도이다. 도 2는 다양한 실시예들에 따른, 카메라 모듈을 예시하는 블록도이다. 도 3은 일 실시예에 따른 전자 장치의 구성을 도시한 블록도이다. 도 4는 일 실시예에 따른 이미지 센서의 구성을 개념적으로 도시한 도면이다. 도 5는 일 실시예에 따른 이미지 센서에 배치된 수광 소자, 마이크로 렌즈 및 색상 필터의 패턴에 대한 예시를 도시한 도면이다. 도 6은 일 실시예에 따른 이미지 센서에 포함된 픽셀들의 값을 출력하기 위한 회로의 예시를 도시한 회로도이다. 도 7은 일 실시예에 따른 이미지 센서에 포함된 픽셀들의 값을 출력하기 위한 회로의 다른 예시를 도시한 회로 도이다. 도 8은 일 실시예에 따른 전자 장치가 이미지를 획득하는 프로세스를 도시한 흐름도이다. 도 9는 일 실시예에 따른 전자 장치의 이미지 센서에 포함된 수광 소자들에 할당되는 렌즈 동공에 대한 개념도 이다.도 10은 일 실시예에 따른 전자 장치가 촬영 모드를 선택하는 프로세스를 도시한 흐름도이다. 도 11은 일 실시예에 따른 전자 장치가 표시하는 해상도 선택 사용자 인터페이스를 포함하는 화면의 예시를 도 시한 도면이다. 도 12는 일 실시예에 따른 전자 장치가 상황 정보에 기초하여 이미지를 획득하는 프로세스를 도시한 흐름도이다. 도 13은 일 실시예에 따른 전자 장치가 이미지를 획득하기 위해 수행하는 영상 신호 처리 과정을 개념적으로 도 시한 도면이다. 도 14는 일 실시예에 따른 전자 장치가 이미지 센서의 동작에 관련된 세 가지 모드에 기초하여 이미지를 획득하 는 프로세스를 도시한 흐름도이다."}
