{"patent_id": "10-2023-0138693", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0055649", "출원번호": "10-2023-0138693", "발명의 명칭": "커스터마이징 된 콘텐츠를 제공하는 방법 및 이를 지원하는 전자 장치", "출원인": "주식회사 카카오", "발명자": "한송민"}}
{"patent_id": "10-2023-0138693", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "서버가 커스터마이징 콘텐츠를 제공하는 방법에 있어서, 적어도 일 콘텐츠에 대한 사용자 단말의 인터랙션 여부를 판단하는 단계;상기 사용자 단말의 인터랙션 여부에 기초하여, 상기 사용자 단말의 선호 텍스트 정보 및 선호 이미지 정보 중적어도 하나의 정보를 추출하는 단계; 상기 선호 텍스트 정보 및 상기 선호 이미지 정보 중 적어도 하나의 정보에 기초하여, 미리 저장된 콘텐츠를 커스터마이징 하는 단계; 및상기 커스터마이징 콘텐츠를 상기 사용자 단말에게 제공하는 단계를 포함하는,커스터마이징 콘텐츠를 제공하는 방법."}
{"patent_id": "10-2023-0138693", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 커스터마이징 콘텐츠를 상기 사용자 단말에게 제공하는 단계는,상기 사용자 단말이 연결한 온라인 플랫폼의 콘텐츠 게재 영역을 확인하는 단계; 및상기 확인된 콘텐츠 게재 영역에 상기 커스터마이징 콘텐츠를 게재하는 단계를 포함하는,커스터마이징 콘텐츠를 제공하는 방법."}
{"patent_id": "10-2023-0138693", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 사용자 단말의 선호 텍스트 정보 및 선호 이미지 정보 중 적어도 하나의 정보를 추출하는 단계는,상기 적어도 일 콘텐츠에 대한 상기 사용자 단말의 인터랙션이 확인되는 경우, 상기 적어도 일 콘텐츠에 포함된 텍스트 데이터 및 이미지 데이터 각각을, 상기 사용자 단말이 선호하는 텍스트정보 및 이미지 정보로서 판단하는 단계를 포함하는,커스터마이징 콘텐츠를 제공하는 방법."}
{"patent_id": "10-2023-0138693", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 사용자 단말이 선호하는 텍스트 정보 및 이미지 정보에 대한 도출 확률을 향상시키는 양성 피드백을 생성하는 단계; 및상기 양성 피드백에 기초하여, 적어도 하나의 학습 모델을 업데이트 하는 단계를 더 포함하는,커스터마이징 콘텐츠를 제공하는 방법.공개특허 10-2025-0055649-3-청구항 5 제1항에 있어서,상기 사용자 단말의 선호 텍스트 정보 및 선호 이미지 정보 중 적어도 하나의 정보를 추출하는 단계는,상기 적어도 일 콘텐츠에 대한 상기 사용자 단말의 인터랙션이 확인되지 않는 경우, 상기 적어도 일 콘텐츠에 포함된 텍스트 데이터 및 이미지 데이터 각각을 상기 사용자 단말이 선호하지 않는 텍스트 정보 및 이미지 정보로서 판단하는 단계를 포함하는,커스터마이징 콘텐츠를 제공하는 방법."}
{"patent_id": "10-2023-0138693", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 사용자 단말이 선호하는 텍스트 정보 및 이미지 정보에 대한 도출 확률을 저하시키는 음성 피드백을 생성하는 단계; 및상기 음성 피드백에 기초하여, 적어도 하나의 학습 모델을 업데이트 하는 단계를 더 포함하는,커스터마이징 콘텐츠를 제공하는 방법."}
{"patent_id": "10-2023-0138693", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 선호 텍스트 정보는,상기 적어도 일 콘텐츠에 포함된 텍스트의 단어 정보, 폰트 정보, 문체 정보, 및 텍스트의 길이 정보 중 적어도하나의 정보와 연관된 정보를 포함하는,커스터마이징 콘텐츠를 제공하는 방법."}
{"patent_id": "10-2023-0138693", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 선호 이미지 정보는,상기 적어도 일 콘텐츠에 포함된 이미지의 배경 정보, 디자인 정보, 및 레이아웃 정보 중 적어도 하나의 정보와연관된 정보를 포함하는,커스터마이징 콘텐츠를 제공하는 방법."}
{"patent_id": "10-2023-0138693", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 미리 저장된 콘텐츠를 상기 선호 텍스트 정보 및 상기 선호 이미지 정보 중 적어도 하나의 정보에 기초하여 커스터마이징 하는 단계는,상기 선호 텍스트 정보 및 상기 선호 이미지 정보에 기초하여 구성된 적어도 하나의 참조 콘텐츠 정보를 확인하는 단계; 및상기 확인된 적어도 하나의 참조 콘텐츠 정보에 기초하여, 상기 미리 저장된 콘텐츠를 커스터마이징 하는 단계를 포함하는,공개특허 10-2025-0055649-4-커스터마이징 콘텐츠를 제공하는 방법."}
{"patent_id": "10-2023-0138693", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 커스터마이징 콘텐츠를 상기 사용자 단말에게 제공한 이후, 상기 적어도 일 콘텐츠에 대한 상기 사용자 단말의 인터랙션 여부를 확인하는 단계; 상기 사용자 단말의 인터랙션에 대응하여, 상기 선호 텍스트 정보 및 상기 선호 이미지 정보를 업데이트 하는단계; 상기 업데이트된 선호 텍스트 정보 및 상기 업데이트 된 선호 이미지 정보에 기초하여, 상기 미리 저장된 콘텐츠를 커스터마이징 하는 단계; 및상기 커스터마이징 콘텐츠를 상기 사용자 단말에게 제공하는 단계를 더 포함하는,커스터마이징 콘텐츠를 제공하는 방법."}
{"patent_id": "10-2023-0138693", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "커스터마이징 콘텐츠를 제공하는 서버에 있어서,메모리; 및상기 메모리와 연결되고, 상기 메모리에 포함된 명령들을 실행하도록 구성된 프로세서를 포함하되,상기 프로세서는, 적어도 일 콘텐츠에 대한 사용자 단말의 인터랙션 여부를 판단하는 단계;상기 사용자 단말의 인터랙션 여부에 기초하여, 상기 사용자 단말의 선호 텍스트 정보 및 선호 이미지 정보 중적어도 하나의 정보를 추출하는 단계; 상기 선호 텍스트 정보 및 상기 선호 이미지 정보에 기초하여, 미리 저장된 콘텐츠를 커스터마이징 하는 단계;및상기 커스터마이징 콘텐츠를 상기 사용자 단말에게 제공하는 단계를 수행하도록 구성되는,커스터마이징 콘텐츠를 제공하는 방법."}
{"patent_id": "10-2023-0138693", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "서버가 커스터마이징 콘텐츠를 제공하는 방법에 있어서, 적어도 일 콘텐츠에 대한 사용자 단말의 인터랙션 여부를 판단하는 단계;미리 저장된 콘텐츠 및 상기 사용자 단말의 인터랙션에 관한 정보를 인공지능(AI: Artificial Intelligence) 서버로 전송하는 단계; 상기 인공지능 서버로부터, 상기 사용자 단말의 선호 텍스트 정보 및 선호 이미지 정보 중 적어도 하나의 정보에 기초하여 생성된 커스터마이징 콘텐츠를 수신하는 단계; 및상기 수신한 커스터마이징 콘텐츠를 상기 사용자 단말에게 제공하는 단계를 포함하는,커스터마이징 콘텐츠를 제공하는 방법."}
{"patent_id": "10-2023-0138693", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "공개특허 10-2025-0055649-5-제12항에 있어서,상기 미리 저장된 콘텐츠에 대한 상기 사용자 단말의 인터랙션에 관한 정보를 인공지능 서버로 전송하는단계는,상기 선호 텍스트 정보 및 상기 선호 이미지 정보에 기초하여 상기 커스터마이징 콘텐츠의 생성을 요청하는 프롬프팅 정보를 생성하는 단계; 및상기 생성된 프롬프팅 정보를 상기 인공지능 서버로 전송하는 단계를 포함하는,커스터마이징 콘텐츠를 제공하는 방법."}
{"patent_id": "10-2023-0138693", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12항에 있어서,상기 수신한 커스터마이징 콘텐츠를 상기 사용자 단말에게 제공하는 단계는,상기 사용자 단말이 연결한 일 플랫폼의 영역 중 콘텐츠 게재 영역을 확인하는 단계; 및상기 확인된 콘텐츠 게재 영역에 상기 수신한 커스터마이징 콘텐츠를 게재하는 단계를 포함하는,커스터마이징 콘텐츠를 제공하는 방법."}
{"patent_id": "10-2023-0138693", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제12항에 있어서,상기 선호 텍스트 정보는,상기 적어도 일 콘텐츠에 포함된 텍스트의 단어 정보, 폰트 정보, 문체 정보, 및 텍스트의 길이 정보 중 적어도하나의 정보와 연관된 정보를 포함하는,커스터마이징 콘텐츠를 제공하는 방법."}
{"patent_id": "10-2023-0138693", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제12항에 있어서,상기 선호 이미지 정보는,상기 적어도 일 콘텐츠에 포함된 이미지의 배경 정보, 디자인 정보, 및 레이아웃 정보 중 적어도 하나의 정보와연관된 정보를 포함하는,커스터마이징 콘텐츠를 제공하는 방법."}
{"patent_id": "10-2023-0138693", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "커스터마이징 콘텐츠를 제공하는 서버에 있어서,메모리; 및상기 메모리와 연결되고, 상기 메모리에 포함된 명령들을 실행하도록 구성된 프로세서를 포함하되,상기 프로세서는, 적어도 일 콘텐츠에 대한 사용자 단말의 인터랙션 여부를 판단하는 단계;미리 저장된 콘텐츠에 대한 상기 사용자 단말의 인터랙션에 관한 정보를 인공지능(AI: Artificial공개특허 10-2025-0055649-6-Intelligence) 서버로 전송하는 단계; 상기 인공지능 서버로부터, 상기 사용자 단말의 선호 텍스트 정보 및 선호 이미지 정보 중 적어도 하나의 정보에 기초하여 생성된 커스터마이징 콘텐츠를 수신하는 단계; 및상기 수신한 커스터마이징 콘텐츠를 상기 사용자 단말에게 제공하는 단계를 수행하도록 구성되는,커스터마이징 콘텐츠를 제공하는 서버."}
{"patent_id": "10-2023-0138693", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "사용자 단말에서 커스터마이징 콘텐츠를 표시하는 방법에 있어서,상기 사용자 단말의 인터랙션에 대응하여, 온라인 플랫폼을 활성화하는 단계; 및적어도 일 콘텐츠를 포함하는 상기 온라인 플랫폼을 상기 사용자 단말의 화면에 표시하는 단계를 포함하고,상기 적어도 일 콘텐츠는,콘텐츠에 대한 상기 사용자 단말의 인터랙션에 기초하여 결정되는 선호 텍스트 정보 및 선호 이미지 정보 중 적어도 하나에 따라 커스터마이징 되는,커스터마이징 콘텐츠를 표시하는 방법."}
{"patent_id": "10-2023-0138693", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "하드웨어와 결합되어 제1항 내지 제10항, 및 제12항 내지 제16항 중 어느 하나의 항의 방법을 실행시키기 위하여 매체에 저장된 컴퓨터 프로그램."}
{"patent_id": "10-2023-0138693", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 서버가 커스터마이징 콘텐츠를 제공하는 방법은 적어도 일 콘텐츠에 대한 사용자 단말의 인터랙션 여 부를 판단하는 단계, 상기 사용자 단말의 인터랙션 여부에 기초하여, 상기 사용자 단말의 선호 텍스트 정보 및 선호 이미지 정보 중 적어도 하나의 정보를 추출하는 단계, 상기 선호 텍스트 정보 및 상기 선호 이미지 정보 중 적어도 하나의 정보에 기초하여, 미리 저장된 콘텐츠를 커스터마이징 하는 단계 및 상기 커스터마이징 콘텐츠를 상기 사용자 단말에게 제공하는 단계를 포함한다."}
{"patent_id": "10-2023-0138693", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 온라인 플랫폼에 게재된 콘텐츠에 대한 사용자의 인터랙션에 따라 커스터마이징 된 콘텐츠를 제공하 는 방법 및 이를 지원하는 전자 장치에 관한 것이다."}
{"patent_id": "10-2023-0138693", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "기존의 광고는 신문, 잡지 등 오프라인 매체를 통하여 이루어지는 것이 일반적이었으나, 최근에는 웹사이트, SNS 등 다양한 온라인 채널을 이용한 광고가 급속하게 증가하고 있는 실정이다. 나아가, 광고가 더 나은 마케팅 성과를 달성할 수 있도록, 다양한 데이터 기술을 활용하는 광고 관련 서버는 콘텐츠에 대한 사용자 별 검색 기 록, 물품에 대한 온라인 쇼핑 패턴 등을 분석하여, 사용자 별 맞춤형 광고를 제공하고 있다. 예를 들면, 사용자 가 온라인 쇼핑몰에서 특정 물품을 검색한 경우, 광고 관련 서버는 해당 특정 물품을 사용자가 해당 쇼핑몰이 아닌 다른 웹사이트에 접속하는 경우에도, 해당 물품 정보를 포함하는 광고 콘텐츠가 표시되도록 관련 기능이나 사용자 인터페이스를 제공하고 있다. 선행기술문헌 특허문헌"}
{"patent_id": "10-2023-0138693", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "(특허문헌 0001) 대한민국 공개특허공보 특2000-0054558 (2000년 09월 5일 공개) 발명의 내용"}
{"patent_id": "10-2023-0138693", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 다양한 콘텐츠를 제공하는 온라인 플랫폼에서, 콘텐츠에 대한 사용자의 언어적 또는 시각적 선호도를 파악하고, 파악된 선호도에 따라 사용자 별 맞춤형 콘텐츠를 제공하는 방법 및 이를 지원하는 전자 장치에 관한 것이다."}
{"patent_id": "10-2023-0138693", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 서버가 커스터마이징 콘텐츠를 제공하는 방법은 적어도 일 콘텐츠에 대한 사용자 단말의 인터랙션 여 부를 판단하는 단계, 상기 사용자 단말의 인터랙션 여부에 기초하여, 상기 사용자 단말의 선호 텍스트 정보 및 선호 이미지 정보 중 적어도 하나의 정보를 추출하는 단계, 상기 선호 텍스트 정보 및 상기 선호 이미지 정보 중 적어도 하나의 정보에 기초하여, 미리 저장된 콘텐츠를 커스터마이징 하는 단계 및 상기 커스터마이징 콘텐 츠를 상기 사용자 단말에게 제공하는 단계를 포함한다. 본 발명의 일 실시예에 있어서, 상기 커스터마이징 콘텐츠를 상기 사용자 단말에게 제공하는 단계는, 상기 사용 자 단말이 연결한 온라인 플랫폼의 콘텐츠 게재 영역을 확인하는 단계 및 상기 확인된 콘텐츠 게재 영역에 상기 커스터마이징 콘텐츠를 게재하는 단계를 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 사용자 단말의 선호 텍스트 정보 및 선호 이미지 정보 중 적어도 하나의 정보를 추출하는 단계는, 상기 적어도 일 콘텐츠에 대한 상기 사용자 단말의 인터랙션이 확인되는 경우, 상기 적어도 일 콘텐츠에 포함된 텍스트 데이터 및 이미지 데이터 각각을, 상기 사용자 단말이 선호하는 텍스트 정보 및 이미지 정보로서 판단하는 단계를 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 사용자 단말이 선호하는 텍스트 정보 및 이미지 정보에 대한 도출 확률을 향상시키는 양성 피드백을 생성하는 단계 및 상기 양성 피드백에 기초하여, 적어도 하나의 학습 모델을 업데이 트 하는 단계를 더 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 사용자 단말의 선호 텍스트 정보 및 선호 이미지 정보 중 적어도 하나의 정보를 추출하는 단계는, 상기 적어도 일 콘텐츠에 대한 상기 사용자 단말의 인터랙션이 확인되지 않는 경우, 상기 적어도 일 콘텐츠에 포함된 텍스트 데이터 및 이미지 데이터 각각을 상기 사용자 단말이 선호하지 않는 텍 스트 정보 및 이미지 정보로서 판단하는 단계를 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 사용자 단말이 선호하는 텍스트 정보 및 이미지 정보에 대한 도출 확률을 저하시키는 음성 피드백을 생성하는 단계 및 상기 음성 피드백에 기초하여, 적어도 하나의 학습 모델을 업데이 트 하는 단계를 더 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 선호 텍스트 정보는, 상기 적어도 일 콘텐츠에 포함된 텍스트의 단어 정보, 폰트 정보, 문체 정보, 및 텍스트의 길이 정보 중 적어도 하나의 정보와 연관된 정보를 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 선호 이미지 정보는, 상기 적어도 일 콘텐츠에 포함된 이미지의 배경 정보, 디자인 정보, 및 레이아웃 정보 중 적어도 하나의 정보와 연관된 정보를 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 미리 저장된 콘텐츠를 상기 선호 텍스트 정보 및 상기 선호 이미지 정보 중 적어도 하나의 정보에 기초하여 커스터마이징 하는 단계는, 상기 선호 텍스트 정보 및 상기 선호 이미지 정 보에 기초하여 구성된 적어도 하나의 참조 콘텐츠 정보를 확인하는 단계 및 상기 확인된 적어도 하나의 참조 콘 텐츠 정보에 기초하여, 상기 미리 저장된 콘텐츠를 커스터마이징 하는 단계를 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 커스터마이징 콘텐츠를 상기 사용자 단말에게 제공한 이후, 상기 적어도 일 콘텐츠에 대한 상기 사용자 단말의 인터랙션 여부를 확인하는 단계, 상기 사용자 단말의 인터랙션에 대응하 여, 상기 선호 텍스트 정보 및 상기 선호 이미지 정보를 업데이트 하는 단계, 상기 업데이트된 선호 텍스트 정 보 및 상기 업데이트 된 선호 이미지 정보에 기초하여, 상기 미리 저장된 콘텐츠를 커스터마이징 하는 단계 및 상기 커스터마이징 콘텐츠를 상기 사용자 단말에게 제공하는 단계를 더 포함할 수 있다. 본 발명의 커스터마이징 콘텐츠를 제공하는 서버는 메모리 및 상기 메모리와 연결되고, 상기 메모리에 포함된 명령들을 실행하도록 구성된 프로세서를 포함하되, 상기 프로세서는, 적어도 일 콘텐츠에 대한 사용자 단말의 인터랙션 여부를 판단하는 단계, 상기 사용자 단말의 인터랙션 여부에 기초하여, 상기 사용자 단말의 선호 텍스 트 정보 및 선호 이미지 정보 중 적어도 하나의 정보를 추출하는 단계, 상기 선호 텍스트 정보 및 상기 선호 이 미지 정보에 기초하여, 미리 저장된 콘텐츠를 커스터마이징 하는 단계 및 상기 커스터마이징 콘텐츠를 상기 사 용자 단말에게 제공하는 단계를 수행하도록 구성된다. 본 발명의 서버가 커스터마이징 콘텐츠를 제공하는 방법은 적어도 일 콘텐츠에 대한 사용자 단말의 인터랙션 여 부를 판단하는 단계, 미리 저장된 콘텐츠 및 상기 사용자 단말의 인터랙션에 관한 정보를 인공지능(AI: Artificial Intelligence) 서버로 전송하는 단계, 상기 인공지능 서버로부터, 상기 사용자 단말의 선호 텍스트 정보 및 선호 이미지 정보 중 적어도 하나의 정보에 기초하여 생성된 커스터마이징 콘텐츠를 수신하는 단계 및 상기 수신한 커스터마이징 콘텐츠를 상기 사용자 단말에게 제공하는 단계를 포함한다. 본 발명의 일 실시예에 있어서, 상기 미리 저장된 콘텐츠에 대한 상기 사용자 단말의 인터랙션에 관한 정보를 인공지능 서버로 전송하는 단계는, 상기 선호 텍스트 정보 및 상기 선호 이미지 정보에 기초하여 상기 커스터마 이징 콘텐츠의 생성을 요청하는 프롬프팅 정보를 생성하는 단계 및 상기 생성된 프롬프팅 정보를 상기 인공지능 서버로 전송하는 단계를 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 수신한 커스터마이징 콘텐츠를 상기 사용자 단말에게 제공하는 단계는, 상 기 사용자 단말이 연결한 일 플랫폼의 영역 중 콘텐츠 게재 영역을 확인하는 단계 및 상기 확인된 콘텐츠 게재 영역에 상기 수신한 커스터마이징 콘텐츠를 게재하는 단계를 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 선호 텍스트 정보는, 상기 적어도 일 콘텐츠에 포함된 텍스트의 단어 정보, 폰트 정보, 문체 정보, 및 텍스트의 길이 정보 중 적어도 하나의 정보와 연관된 정보를 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 선호 이미지 정보는, 상기 적어도 일 콘텐츠에 포함된 이미지의 배경 정보, 디자인 정보, 및 레이아웃 정보 중 적어도 하나의 정보와 연관된 정보를 포함할 수 있다. 본 발명의 커스터마이징 콘텐츠를 제공하는 서버는 메모리 및 상기 메모리와 연결되고, 상기 메모리에 포함된 명령들을 실행하도록 구성된 프로세서를 포함하되, 상기 프로세서는, 적어도 일 콘텐츠에 대한 사용자 단말의 인터랙션 여부를 판단하는 단계, 미리 저장된 콘텐츠에 대한 상기 사용자 단말의 인터랙션에 관한 정보를 인공 지능(AI: Artificial Intelligence) 서버로 전송하는 단계, 상기 인공지능 서버로부터, 상기 사용자 단말의 선 호 텍스트 정보 및 선호 이미지 정보 중 적어도 하나의 정보에 기초하여 생성된 커스터마이징 콘텐츠를 수신하 는 단계 및 기 수신한 커스터마이징 콘텐츠를 상기 사용자 단말에게 제공하는 단계를 수행하도록 구성된다. 본 발명의 사용자 단말에서 커스터마이징 콘텐츠를 표시하는 방법은 기 사용자 단말의 인터랙션에 대응하여, 온 라인 플랫폼을 활성화하는 단계 및 적어도 일 콘텐츠를 포함하는 상기 온라인 플랫폼을 상기 사용자 단말의 화 면에 표시하는 단계를 포함하고, 상기 적어도 일 콘텐츠는, 콘텐츠에 대한 상기 사용자 단말의 인터랙션에 기초 하여 결정되는 선호 텍스트 정보 및 선호 이미지 정보 중 적어도 하나에 따라 커스터마이징 된다."}
{"patent_id": "10-2023-0138693", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따라, 사용자 단말의 선호 텍스트 정보 및 선호 이미지 정보에 따라 커스터마이징 콘텐 츠를 생성함으로써, 사용자가 원하는 맞춤형 콘텐츠를 효율적으로 제공할 수 있다. 본 발명의 일 실시예에 따라, 콘텐츠에 대한 사용자 단말의 인터랙션에 따라 변경되는 커스터마이징 콘텐츠를 제공함으로써, 사용자가 원하는 맞춤형 콘텐츠를 실시간으로 반영하여 제공할 수 있다. 본 발명의 일 실시예에 따라, 사용자 단말 별 선호 텍스트 정보 및 선호 텍스트 정보에 따라 생성되는 커스터마 이징 된 광고 콘텐츠를 제공함으로써, 광고 콘텐츠에 대한 클릭 및 전환율 상승 등 광고 효과를 극대화할 수 있 다."}
{"patent_id": "10-2023-0138693", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 명세서에 개시된 실시 예를 상세히 설명하되, 도면 부호에 관계없이 동일하거 나 유사한 구성요소는 동일한 참조 번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 또한, 본 명 세서에 개시된 실시 예를 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 명세서에 개시된 실시 예의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소 들은 상기 용어들에 의해 한정되지는 않는다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, 설명되는 각 단계들은 특별한 인과관계에 의해 나열된 순서에 따라 수행되어야 하는 경우를 제외 하고, 나열된 순서와 상관없이 수행될 수 있다. 본 출원에서, \"포함한다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되 어야 한다. 본 발명의 다양한 실시예에 따라, 인공지능(AI: Artificial Intelligence) 기술은 인공적인 지능 또는 이를 생 성할 수 있도록 방법론을 연구하는 기술을 의미할 수 있다. 인공지능 기술의 일 예인 머신 러닝(Machine Learning)은 컴퓨터 시스템이 데이터로부터 자동으로 학습하고 패턴을 인식하여 결정을 내리거나 예측하는 알고 리즘 기술일 수 있다. 머신 러닝은 데이터를 기반으로 모델을 구축하고, 이 모델을 사용하여 새로운 데이터에 대한 예측이나 결정을 수행할 수 있다. 도 1은 본 발명의 일 실시예에 따른 네트워크 환경의 예를 도시한 도면이다. 이하, 첨부된 도면들을 참조하여 본 발명에 대해 설명한다. 다양한 실시예에 따라, 서버는 네트워크를 통해 사용자 단말과 서로 연결될 수 있다. 네트워크는 통 신 방식이 제한되지 않으며, 네트워크가 포함할 수 있는 통신망(일례로, 이동통신망, 유선 인터넷, 무선 인터넷, 방송망)을 활용하는 통신 방식뿐만 아니라 근거리 무선 통신 역시 포함될 수 있다. 본 발명의 다양한 실시예에 따른 서버는 명령, 코드, 파일, 콘텐츠, 서비스 등을 제공하는 컴퓨터 장치 또 는 복수의 컴퓨터 장치들로 구현될 수 있다. 일 실시예에 따른 서버는 사용자 단말과 네트워크를 통 해 통신하여 정보를 송수신할 수 있는 일 전자 장치일 수 있다. 서버를 설명의 편의상 하나의 서버로서 설 명하였으나, 복수의 서버로 구성되어 각 서버가 서로 다른 기능 또는 서비스를 제공할 수 있다. 다양한 실시예에 따라 서버는 사용자 단말이 어떤 기능이나 서비스를 자동으로 또는 요청에 의하여 수행해야 할 경우에, 사용자 단말은 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 그와 연관된 적어도 일부 기능을 서버에게 요청할 수 있다. 서버는 요청된 기능 또는 추가 기능을 실행하고, 그 결과를 사용자 단말로 전달할 수 있다. 사용자 단말은수신한 결과를 그대로 또는 추가 적으로 처리하여 요청된 기능이나 서비스를 제공할 수 있다. 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 또는클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 서버는 프로세서, 통신부, 및 메모리를 포함할 수 있다. 프로세서는 통신부 및 메모리의 전반적인 동작을 제어할 수 있다. 다양한 실시예에 따라, 프로세서는 온라인 플랫폼의 콘텐츠에 대한 사용자 단말의 인터랙션을 추적하 고 확인할 수 있다. 여기서 온라인 플랫폼은 다양한 디지털 콘텐츠, 서비스, 기능 등을 제공하는 플랫폼을 의미 할 수 있다. 온라인 플랫폼은 웹사이트, 어플리케이션 등을 포괄하는 개념으로, 사용자들에게 정보, 상품, 서비 스 등을 제공하는 온라인 환경을 제공할 수 있다. 여기서 웹사이트는 웹 브라우저를 통해 접근되고, 사용자들에 게 텍스트, 이미지, 비디오 등의 콘텐츠 등을 제공하는 웹 기반의 인터페이스일 수 있다. 여기서 어플리케이션 이란 모바일 기기를 통해 접근되고, 사용자들이 특정한 작업이나 기능을 수행하는 데 이용되는 소프트웨어 또는 인터페이스일 수 있다. 일 실시예에 따라, 프로세서는 쿠키(cookies), 웹 애널리틱스(web analytics), 서버 로그 기술 등을 통해 사용자 단말의 인터랙션을 추적할 수 있다. 예를 들면, 프로세서는 사용자 단말이 접속할 때마 다 쿠키, 세션, 서버 로그 기록 등을 확인하고, 사용자 단말의 IP 주소, 방문 시간, 요청한 페이지 등을 분석할 수 있다. 또 다른 예를 들면, 프로세서는 웹 애널리틱스 기술을 통해 온라인 플랫폼에 포함된 콘텐 츠에 대한 사용자 단말의 클릭 패턴 등을 확인할 수 있다. 추가적인 예를 들면, 프로세서는 온라인 플랫폼에 자바 스크립트 코드를 삽입하고, 온라인 플랫폼에 포함된 콘텐츠에 대한 인터랙션(예: 클릭 등)을 추 적 및 저장할 수 있다. 다양한 실시예에 따라, 프로세서는 온라인 플랫폼에 포함된 일 콘텐츠에 대한 사용자 단말의 인터랙 션 여부를 판단할 수 있다. 여기서 인터랙션이란, 일 콘텐츠에 대한 사용자 단말의 클릭, 좋아요, 공유, 댓글, 평가, 투표, 재생, 광고 물품의 구매 등일 수 있다. 예를 들어, 온라인 플랫폼에 포함된 일 콘텐츠가 광 고 콘텐츠인 경우, 일 콘텐츠에 대한 사용자 단말의 인터랙션은 광고주 웹사이트 방문, 광고주 제품 구매, 광고주 웹사이트 홈페이지의 가입 등을 포함할 수 있다. 다양한 실시예에 따라, 프로세서는 온라인 플랫폼에 포함된 일 콘텐츠에 대하여 사용자 단말이 클릭, 해당 콘텐츠에 대한 웹사이트 방문 등 인터랙션 여부를 확인할 수 있다. 일 실시예에 따라, 프로세서는 사 용자 단말의 인터랙션 여부에 기초하여, 사용자 단말의 선호 텍스트 정보 및 선호 이미지 정보를 확 인할 수 있다. 예를 들면, 프로세서는 모델 저장부에 저장된 다양한 모델들(예: 유저 스타일 임베딩 모델)을 통해, 사용자 단말의 선호 텍스트 정보 및 선호 이미지 정보를 추출할 수 있다. 여기서, 유저 스타일 임베딩 모델은 사용자 단말 별 특성, 취향, 스타일 등을 임베딩을 통해 수치적으로 표현하는 모델일 수 있다. 유저 스타일 임베딩 모델은 사용자의 속성 데이터를 분석하고, 이를 기반으로 사용자 개인의 특성을 공간 상의 벡터로 매핑할 수 있다. 일 실시예에 따라, 유저 스타일 임베딩 모델은 일 사용자의 검색 기록, 클릭 패턴 등을 분석하여, 해당 사용자가 특정 물품에 대한 관심이나 취향을 확인할 수 있다. 예를 들면, 유저 스타일 임베딩 모델은 사용자가 작성한 텍스트 또는 게재된 콘텐츠에 대한 인터랙 션(예: 클릭 등)을 분석하여 해당 사용자가 선호하는 텍스트, 이미지 등을 확인하고, 이를 벡터 형태로 출력할 수 있다. 이렇게 임베딩된 벡터는 사용자 간의 선호도 차이나 유사성을 나타내는데 사용될 수 있다. 예를 들면, 프로세서는 사용자 단말이 다른 복수의 사용자 단말들 대비, 의문문 형태의 텍스트가 포 함된 콘텐츠에 대한 클릭 횟수가 많은 경우, 의문문 형태의 텍스트를 사용자 단말의 선호 텍스트 정보로서 판단할 수 있다. 또 다른 예를 들면, 프로세서는 사용자 단말이 다른 복수의 사용자 단말들 대비, 특 정 언어 표현(예: 'Best,' 'Cheap,' 'Wonderful,' 등)을 포함하는 광고 콘텐츠에 대한 클릭, 해당 광고 콘텐츠 가 광고하는 물품의 구매율 등이 높은 경우, 해당 특정 언어 표현을 사용자 단말의 선호 텍스트 정보로서 판단할 수 있다. 또 다른 예를 들면, 프로세서는 사용자 단말이 다른 복수의 사용자 단말들 대비, 특정 애니메이션 캐 릭터를 포함하는 콘텐츠에 대한 접속 횟수가 많은 경우, 특정 애니메이션 캐릭터를 사용자 단말의 선호 이 미지 정보로서 판단할 수 있다. 추가적인 예를 들면, 프로세서는 사용자 단말이 다른 복수의 사용자 단말들 대비, 특정 색상(예: 빨간색, 주황색, 노란색, 하얀색, 초록색 등)을 배경화면 또는 주요 이미지 스타일 을 포함하는 콘텐츠에 대한 클릭 횟수가 많은 경우, 해당 특정 색상을 사용자 단말의 선호 이미지 정보로 서 판단할 수 있다. 다양한 실시예에 따라, 프로세서는 선호 텍스트 정보 및 선호 이미지 정보 중 적어도 하나의 정보에 기초 하여 미리 저장된 콘텐츠를 커스터마이징 할 수 있다. 일 실시예에 따라, 프로세서는 외부 서버(예: 광고 서버, 콘텐츠 서버 등)로부터 텍스트 및 이미지로 구성된 콘텐츠를 수신하여 메모리에 저장할 수 있다. 프 로세서는 미리 저장된 콘텐츠를 다양한 기술(예: VAE(Variational Autoencoder), 확산 모델(Diffusion Model), GAN(Generative Adversarial Network), Text-to-Text 모델, Text-to-Image 모델 등)을 통해 텍스트와 이미지의 스타일을 변경할 수 있다. 일 실시예에 따라, VAE(Variational Autoencoder)는 텍스트 및 이미지를 변경하는 기술의 일 예로서, 인코더와 디코더로 구성되고, 데이터를 잠재변수로 인코딩 한 이후 디코더를 통해 복원하는 기술일 수 있다. 확산 모델 (Diffusion Model)은 이미지 생성이나 복원 시, 확률적인 과정을 통해 데이터를 생성하는 모델일 수 있다. GAN 은 생성자(generator)와 판별자(discriminator)로 구성된 네트워크로서, 생성자는 실제 데이터와 비슷한 가짜 데이터를 생성하고, 판별자는 실제 데이터와 생성자가 생성한 가짜 데이터를 구분하는 기술을 제공할 수 있다. Text-to-Text 모델, Text-to-Image 모델 각각은 텍스트를 다른 텍스트로, 또는 텍스트를 이미지로 생성하는 생 성 모델일 수 있다. 일 실시예에 따라, 프로세서는 외부 서버(예: 광고 서버)로부터 수신한 광고 콘텐츠를, 사용자 단말 이 선호하는 텍스트 및 이미지로 커스터마이징 할 수 있다. 또 다른 실시예에 따라, 외부 서버(예: 광고 서버) 는 광고 콘텐츠를 사용자 단말이 선호하는 텍스트 및 이미지로 커스터마이징 할 수 있다. 위와 같은 실시 예에서, 프로세서는 외부 서버(예: 광고 서버)로부터 커스터마이징 광고 콘텐츠를 수신하여 메모리에 저장할 수 있다. 일 실시예에 따라, 프로세서는 모델 저장부에 저장된 다양한 모델들(예: 멀티 모달 합성 모델) 을 통해, 사용자 단말에게 커스터마이징 된 콘텐츠를 생성할 수 있다. 여기서, 멀티모달 합성 모델은 서로 다른 유형의 데이터를 결합하여 새로운 결과값을 생성하는 모델일 수 있다. 예를 들면, 멀티모달 합성 모 델은 이미지 및 텍스트가 입력된 경우, 해당 이미지와 텍스트의 연관성을 고려하여 새로운 텍스트나 이미 지를 생성할 수 있다. 또 다른 예를 들면, 멀티모달 합성 모델는 음성 및 텍스트가 입력된 경우, 해당 음 성과 텍스트의 연관성을 고려하여 새로운 영상을 생성할 수 있다. 예를 들면, 프로세서는 외부 서버로부터 수신한 광고 콘텐츠에 포함된 텍스트에, 사용자 단말의 선호 텍스트 정보로서 확인된 의문문 형태로 커스터마이징 할 수 있다. 또 다른 예를 들면, 프로세서는 외부 서버로부터 수신한 광고 콘텐츠에 포함된 이미지에, 사용자 단말의 선호 이미지 정보로서 확인된 파란색 배경화면을 커스터마이징 할 수 있다. 다양한 실시예에 따라, 프로세서는 커스터마이징 콘텐츠를 사용자 단말에게 제공할 수 있다. 일 실시 예에 따라, 프로세서는 일 온라인 플랫폼에 사용자 단말에 접속하는 경우, 커스터마이징 콘텐츠가 사 용자 단말의 화면의 일 영역에 표시되도록 관련 기능이나 사용자 인터페이스를 제공할 수 있다. 예를 들면, 프로세서는 웹사이트의 콘텐츠 게재 영역에, 커스터마이징 콘텐츠가 표시되도록 관련 기능이나 사용 자 인터페이스를 제공할 수 있다. 다양한 실시예에 따라, 통신부는 네트워크를 통해 사용자 단말과 유선 또는 무선 방식으로 통신할 수 있다. 메모리는 저장매체로서 기능을 수행하며, 서버에서 구동되는 다수의 응용 프로그램, 서버(10 0)의 동작을 위한 데이터들 및 명령어들을 저장할 수 있다. 일 실시예로, 메모리는 하드웨어적으로, ROM, RAM, 플래시 드라이브, 하드 드라이브 등과 같은 다양한 저장기기 형태로 구비되거나, 웹 스토리지(webstorage) 형태로 구비될 수 있다. 다양한 실시예에 따라, 메모리는 모델 저장부를 포함할 수 있다. 모델 저장부는 프로세서 를 통하여 학습 중인 또는 학습된 모델을 저장할 수 있다. 모델 저장부는 유저 스타일 임베딩 모델과 멀티모달 합성 모델를 포함할 수 있다. 유저 스타일 임베딩 모델은 사용자의 속성 데이터를 분석하고, 이를 기반으로 사용자 개인의 특성을 공간 상의 벡터로 매핑할 수 있다. 멀티모달 합성 모델은 서로 다른 유형의 데이터를 결합하여 새로운 결과값을 생성하는 모델일 수 있다. 일 실시예에 따라, 모델 저장부에 포함되는 학습 모델은 하드웨어, 소프트웨어 또는 하드웨어와 소프트웨 어의 조합으로 구현될 수 있다. 학습 모델의 일부 또는 일부 또는 전부가 소프트웨어로 구현되는 경우, 학습 모 델을 구성하는 하나 이상의 명령어가 메모리에 저장될 수 있다. 본 발명의 다양한 실시예에 따라, 모델 저장부는 인공 신경망(ANN: Artificial Neural Network)을 포함할 수 있다. 일 실시예에 따라, 인공 신경망 머신 러닝에서 사용되는 모델로써, 시냅스의 결합으로 네트워크를 형성한 인공 뉴런들로 구성되는 모델을 의미할 수 있다. 여기서, 인공 신경망은 다른 레이어의 뉴런들 사이의 연 결 패턴, 모델 파라미터를 갱신하는 학습 과정, 출력값을 생성하는 활성화 함수(Activation Function)에 의해 정의될 수 있다. 다양한 실시예에 따라, 인공 신경망은 입력층(input layer), 출력층(output layer), 그리고 선택적으로 적어도 하나의 은닉층(hidden layer)를 포함할 수 있다. 일 실시예에 따라, 각 층은 하나 이상의 노드를 포함하고, 인 공 신경망은 노드와 노드를 연결하는 시냅스를 포함할 수 있다. 인공 신경망에서 각 노드는 시냅스를 통해 입력 되는 입력 신호들, 가중치, 편향에 대한 활성 함수의 함수값을 출력할 수 있다. 다양한 실시예에 따라, 모델 파라미터는 학습을 통해 결정되는 파라미터를 의미하며, 시냅스 연결의 가중치와 뉴런의 편향 등이 포함될 수 있다. 일 실시예에 따라, 하이퍼파라미터는 머신 러닝 알고리즘에서 학습 전에 설 정되어야 하는 파라미터를 의미하며, 학습률(learning rate), 반복 횟수, 미니 배치 크기, 초기화 함수 등이 포 함될 수 있다. 다양한 실시예에 따라, 인공 학습망의 학습의 목적은 손실 함수를 최소화하는 모델 파라미터를 결정하는 것으로 볼 수 있다. 여기서 손실 함수란, 인공 신경망의 학습 과정에서 최적의 모델 파라미터를 결정하기 위한 지표로 이용될 수 있다. 머신 러닝은 학습 방식에 따라, 지도 학습(supervised learning), 비지도 학습(unsupervised learning), 강화 학습(reinforcement learning)으로 분류할 수 있다. 다양한 실시예에 따라, 지도 학습은 학습 데이터에 대한 레이블(label)이 주어진 상태에서 인공 신경망을 학습 시키는 방법을 의미할 수 있다. 여기서 레이블이란 학습 데이터가 인공 신경망에 입력되는 경우 인공 신경망이 추론해 내야 하는 결과 값을 의미할 수 있다. 일 실시예에 따라, 비지도 학습은 학습 데이터에 대한 레이블이 주어지지 않은 상태에서 인공 신경망을 학습시키는 것을 의미할 수 있다. 일 실시예에 따라, 강화 학습은 어떤 환경 안에서 정의된 에이전트가 각 상태에서 누적 보상을 최대화하는 행동 또는 행동 순서를 선택하도록 학습시 키는 학습 방법을 의미할 수 있다. 다양한 실시예에 따라, 사용자 단말은 예를 들면, 스마트폰(smartphone), 태블릿 PC(tablet personal computer), 이동 전화기(mobile phone), 영상 전화기, 전자책 리더기(e-book reader), 데스크탑 PC(desktop personal computer), 랩탑 PC(laptop personal computer), 넷북 컴퓨터(netbook computer), 워크스테이션 (workstation), 서버, PDA(personal digital assistant), PMP(portable multimedia player), 카메라(camera), 또는 웨어러블 장치(wearable device) 중 적어도 하나를 포함할 수 있다. 도 1을 참조하면, 다양한 실시예에 따라 사용자 단말은 프로세서, 통신부, 입력부, 출력부 , 및 메모리를 포함할 수 있다. 일 실시예에 따라, 사용자 단말의 구성요소들 중 적어도 하나를 생략하거나 다른 구성요소를 추가적으로 구비할 수 있다. 프로세서는 운영 체제 또는 응용 프로그램을 구동하여 프로세서와 연결된 다수의 하드웨어 또는 소프 트웨어 구성요소들을 제어할 수 있고, 각종 데이터 처리 및 연산을 수행할 수 있다. 프로세서는 통신부 , 입력부, 출력부, 및 메모리의 전반적인 동작을 제어하여 어플리케이션을 실행할 수 있다. 통신부는 사용자 단말과 외부 전자 장치 간의 통신을 설정할 수 있다. 예를 들면, 통신부는 무 선 통신 또는 유선 통신을 통해서 네트워크에 연결되어 외부 전자 장치(예: 외부 서버), 서버, AI 서버 와 통신할 수 있다. 입력부는 사용자 또는 다른 외부 기기로부터 입력된 명령 또는 데이터를 사용자 단말의 다른 구성요 소(들)에 전달할 수 있는 인터페이스의 역할을 할 수 있다. 또한, 입력부는 사용자 단말의 다른 구 성요소(들)로부터 수신한 명령 또는 데이터를 사용자 또는 다른 외부 기기로 출력할 수 있다. 예를 들어, 입력 부는 터치스크린 모듈, 키보드, 마우스, 버튼, 카메라, 스타일러스 및 마이크로폰 등이 될 수 있다. 사용자 단말은 입력부를 통해 사용자의 인터랙션을 입력받을 수 있다. 인터랙션이란 사용자가 입력부 를 조작하여 사용자의 선택 또는 의도 등이 반영된 정보를 사용자 단말에 입력하는 것을 의미한다. 예를 들어, 인터랙션은 터치스크린의 터치, 마우스의 클릭, 키보드의 타이핑, 마이크로폰의 소리입력, 카메라의 이미지 촬영, 동작센서의 동작 인식 등이 될 수 있다. 출력부는 다양한 정보를 출력할 수 있다. 출력부는 디스플레이, 터치 스크린, 스피커, 진동발생장치 및 촉각발생장치 등이 될 수 있다. 출력부 는, 예를 들면, 사용자에게 각종 콘텐츠(예: 텍스트, 이미지,비디오, 동영상, 아이콘, 또는 심볼 등)을 제공할 수 있다. 다양한 실시예에 따라, 출력부는 사용자 단말 과 유선 또는 무선통신(예를 들어, 블루투스 등의 근거리무선통신)으로 연결되어 신호를 전달받아 출력하 는 장치(예를 들어, 블루투스 이어폰)일 수 있다. 메모리는 저장매체로서 기능을 수행하며, 사용자 단말에서 구동되는 다수의 응용 프로그램, 사용자 단말의 동작을 위한 데이터들 및 명령어들을 저장할 수 있다. 이러한 메모리는 하드웨어적으로, ROM, RAM, 플래시 드라이브, 하드 드라이브 등과 같은 다양한 저장기기 형태로 구비되거나, 웹스토리지(webstorage) 형태 로 구비될 수 있다. 다양한 실시예에 따른 사용자 단말은 사용자 단말에 관련된 자원을 제어하는 운영체제 및/또는 운영 체제 상에서 구동되는 다양한 어플리케이션을 포함할 수 있다. 예를 들어, 사용자 단말은 홈, 다이얼러, SMS/MMS, 브라우저, 카메라, 달력 등의 기능을 수행할 수 있는 하나 이상의 어플리케이션을 포함할 수 있다. 도 2는 본 발명의 일 실시예에 따라, 서버가 커스터마이징 콘텐츠를 제공하는 일례를 도시한 순서도이다. 다양한 실시예에 따라, 도 2의 각 단계는 문맥상 명백하게 특정 순서를 기재하지 않은 이상 명기된 순서와 다르 게 수행될 수 있다. 즉, 각 단계들은 명기된 순서와 동일하게 일어날 수 있고, 실질적으로 동시에 수행될 수도 있으며 반대의 순서대로 수행될 수도 있다. 단계를 참조하면, 서버는 적어도 일 콘텐츠에 대한 사용자 단말의 인터랙션 여부를 판단할 수 있다. 다양한 실시예에 따라, 서버는 온라인 플랫폼(예: 웹사이트, 어플리케이션 등)에서, 온라인 플랫폼 에 게재된 콘텐츠에 대한 사용자 단말의 인터랙션(예: 콘텐츠에 대한 사용자 단말의 클릭, 광고 콘텐 츠에 포함된 제품의 구매 등)을 확인할 수 있다. 일 실시예에 따라, 서버는 다양한 기술(예: 웹 애널리틱 스(web analytics), 서버 로그 기술 등)을 통해 사용자 단말의 인터랙션을 추적할 수 있다. 예를 들면, 서버는 웹사이트에 게재된 광고 콘텐츠 또는 뉴스 콘텐츠에 대하여, 사용자 단말의 클릭 여부를 확인할 수 있다. 또 다른 예를 들면, 서버는 웹사이트에 게재된 광고 콘텐츠에 대하여, 광고 콘텐 츠에 포함된 광고 제품의 구매 여부를 확인할 수 있다. 단계를 참조하면, 서버는 사용자 단말의 인터랙션 여부에 기초하여, 사용자 단말의 선호 텍스트 정보 및 선호 이미지 정보를 추출할 수 있다. 다양한 실시예에 따라, 서버는 온라인 플랫폼에 게재된 적어도 일 콘텐츠에 대한 사용자 단말의 인터 랙션이 확인되는 경우, 적어도 일 콘텐츠에 포함된 텍스트 데이터 및 이미지 데이터를 사용자 단말이 선호 하는 텍스트 정보 및 이미지 정보를 판단하는 일 요소(factor)로서 판단할 수 있다. 일 실시예에 따라, 서버 는 적어도 일 콘텐츠에 대한 사용자 단말의 인터랙션 여부가, 적어도 일 콘텐츠의 내용(예: 광고 내 용, 뉴스 내용 등)에 기초한 것인지 또는 적어도 일 콘텐츠에 포함된 텍스트 데이터 및 이미지 데이터에 기초한 것인지 여부를 판단할 수 있다. 일 실시예에 따라, 서버는 콘텐츠에 대한 사용자 단말의 평균 인터랙션 비율, 사용자 단말의 인 터랙션이 확인된 콘텐츠에 포함된 텍스트 데이터 및 이미지 데이터 등에 기반하여, 사용자 단말이 선호하 는 텍스트 정보 및 이미지 정보의 요소인지 여부를 결정할 수 있다. 예를 들면, 사용자 단말의 광고 콘텐 츠에 대한 평균 클릭률이 15%라고 가정해보면, 특정 이미지 데이터 및/또는 특정 텍스트 데이터가 포함된 광고 콘텐츠에 대한 클릭률이 25%라고 할 때, 해당 이미지 데이터 및/또는 텍스트 데이터를 사용자 단말이 선호 하는 텍스트 정보 및 이미지 정보로서 판단할 수 있다. 또 다른 예를 들면, 서버는 일 콘텐츠의 내용(예: 광고 콘텐츠, 뉴스 콘텐츠 등)은 동일하되, 해당 콘텐츠 를 구성하는 텍스트 데이터 및 이미지 데이터를 달리 하는 경우, 각각의 경우에 대한 사용자 단말의 인터 랙션을 확인할 수 있다. 위와 같은 예에서, 서버는 각각의 콘텐츠가 동일한 콘텐츠 내용으로 구성되었으나, 특정 텍스트 데이터 및 이미지 데이터로 구성된 특정 콘텐츠에 대한 사용자 단말의 인터랙 션이 확인이 되는 경우, 해당 콘텐츠에 포함된 이미지 데이터 및/또는 텍스트 데이터를 사용자 단말이 선 호하는 텍스트 정보 및 이미지 정보로서 판단할 수 있다. 추가적인 예를 들면, 서버는 사용자 단말의 특정 콘텐츠(예: 특정 광고 콘텐츠, 특정 정보, 카테고리 를 포함하는 뉴스 정보 등)에 대한 클릭률이 평균 클릭률 대비 일정 이상 높은 경우(예: 5% 이상, 10% 이상 등)에는, 해당 특정 콘텐츠에 포함된 해당 이미지 데이터 및/또는 텍스트 데이터는 사용자 단말의 선호 텍 스트 정보 및/또는 선호 이미지 정보 여부에 대한 판단 시 제외할 수 있다. 일 실시예에 따라, 서버는 콘텐츠에 대한 사용자 단말의 인터랙션에 따라, 모델 저장부에 저장 된 다양한 학습 모델(예: 유저 스타일 임베딩 모델 등)을 학습시킬 수 있다. 광고 콘텐츠에 대한 사용자 단말의 클릭 인터랙션이 확인되는 경우, 서버는 해당 광고 콘텐츠에 포함 된 텍스트 데이터 및 이미지 데이터에 대하여, 사용자 단말의 선호 텍스트 벡터와 선호 이미지 벡터에 대 한 양성 피드백(positive feedback)을 부여할 수 있다. 여기서 양성 피드백은 모델 저장부에 저장된 다양 한 학습 모델(예: 유저 스타일 임베딩 모델 등)이, 사용자 단말의 선호 텍스트 벡터와 선호 이미지 벡터를 도출할 확률이 높아지도록 학습하는 과정을 통해 반영될 수 있다. 여기서 사용자 단말의 선호 텍스트 정보는 적어도 일 콘텐츠에 포함된 텍스트의 단어 정보, 폰트 정보, 문 체 정보, 및 텍스트의 길이 정보 중 적어도 하나의 정보와 연관된 정보를 포함할 수 있다. 예를 들면, 서버 는 강조 구문이나 특정 구문(예: \"First,\" \"Best\" 등)이 포함된 광고 콘텐츠에 대한 사용자 단말의 클릭 인터랙션이 확인되는 경우, 강조 구문이나 특정 구문을 사용자 단말의 선호 텍스트 벡터로서 양성 피 드백을 부여할 수 있다. 이후, 서버는 일 온라인 플랫폼에 사용자 단말에 접속하는 경우, 해당 강조 구문이나 특정 구문이 포함된 광고 콘텐츠의 게재될 확률을 높아지도록 모델 저장부에 저장된 다양한 학습 모델(예: 유저 스타일 임베딩 모델 등)을 학습시킬 수 있다. 여기서, 사용자 단말의 선호 이미지 정보는, 적어도 일 콘텐츠에 포함된 이미지의 배경 정보, 디자인 정보, 및 레이아웃 정보 중 적어도 하나의 정보와 연관된 정보를 포함할 수 있다. 예를 들면, 서버는 특정 애니메이션 캐릭터나 특정 색상(예: 파란색, 빨간색 등)이 포함된 뉴스 콘텐츠에 대한 사용자 단말의 클릭 인터랙션이 확인되는 경우, 특정 애니메이션 캐릭터나 특정 색상을 사용자 단말의 선호 이미지 벡터로서 양성 피드백을 부여할 수 있다. 이후, 서버는 일 온라인 플랫폼에 사용자 단말에 접속하는 경우, 해 당 특정 애니메이션 캐릭터나 특정 색상이 포함된 광고 콘텐츠의 게재될 확률을 높아지도록 모델 저장부에 저장된 다양한 학습 모델(예: 유저 스타일 임베딩 모델 등)을 학습시킬 수 있다. 다양한 실시예에 따라, 서버는 온라인 플랫폼에 게재된 적어도 일 콘텐츠에 대한 사용자 단말의 인터 랙션이 확인되지 않는 경우, 적어도 일 콘텐츠에 포함된 텍스트 데이터 및 이미지 데이터를 사용자 단말이 선호하지 않는 텍스트 정보 및 이미지 정보로서 판단할 수 있다. 일 실시예에 따라, 서버는 복수의 콘텐츠에 대한 사용자 단말의 평균 인터랙션 비율, 사용자 단말 의 인터랙션이 확인된 복수의 콘텐츠에 포함된 텍스트 데이터 및 이미지 데이터 등에 기반하여, 사용자 단 말이 선호하지 않는 텍스트 정보 및 이미지 정보를 판단할 수 있다. 예를 들면, 사용자 단말의 광고 콘텐츠에 대한 평균 클릭률이 5%라고 가정해보면, 특정 이미지 데이터 및/또는 특정 텍스트 데이터가 포함된 광 고 콘텐츠에 대한 클릭률이 3%라고 할 때, 해당 이미지 데이터 및/또는 텍스트 데이터를 사용자 단말이 선 호하지 않는 텍스트 정보 및 이미지 정보로서 판단할 수 있다. 또 다른 예를 들면, 서버는 일 콘텐츠의 내용(예: 광고 콘텐츠, 뉴스 콘텐츠 등)은 동일하되, 해당 콘텐츠 를 구성하는 텍스트 데이터 및 이미지 데이터를 달리 하는 경우, 각각의 경우에 대한 사용자 단말의 인터 랙션을 확인할 수 있다. 위와 같은 예에서, 서버는 각각의 콘텐츠가 동일한 콘텐츠 내용으로 구성되었으나, 특정 텍스트 데이터 및 이미지 데이터로 구성된 특정 콘텐츠에 대한 사용자 단말의 인터랙 션이 확인이 되는 경우, 해당 콘텐츠가 아닌 다른 콘텐츠에 포함된 이미지 데이터 및/또는 텍스트 데이터를 사용자 단말이 선호하지 않는 텍스트 정보 및 이미지 정보로서 판 단할 수 있다. 추가적인 예를 들면, 서버는 사용자 단말의 특정 콘텐츠(예: 특정 광고 콘텐츠, 특정 정보, 카테고리 를 포함하는 뉴스 정보 등)에 대한 클릭률이 평균 클릭률 대비 일정 이상 낮은 경우(예: 5% 이상, 10% 이상 등)에는, 해당 특정 콘텐츠에 포함된 해당 이미지 데이터 및/또는 텍스트 데이터는 사용자 단말의 선호 텍 스트 정보 및/또는 선호 이미지 정보 여부에 대한 판단 시 제외할 수 있다. 일 실시예에 따라, 서버는 콘텐츠에 대한 사용자 단말의 인터랙션에 따라, 모델 저장부에 저장 된 다양한 학습 모델(예: 유저 스타일 임베딩 모델 등)을 학습시킬 수 있다. 광고 콘텐츠에 대한 사용자 단말의 클릭 인터랙션이 확인되지 않는 경우, 서버는 해당 광고 콘텐츠에 포함된 텍스트 데이터 및 이미지 데이터에 대하여, 사용자 단말의 선호 텍스트 벡터와 선호 이미지 벡터에 대한 음성 피드백 (negative feedback)을 부여할 수 있다. 여기서 음성 피드백은 모델 저장부에 저장된 다양한 학습 모델(예: 유저 스타일 임베딩 모델 등)이, 사용자 단말의 선호 텍스트 벡터와 선호 이미지 벡터를 도출할 확률이 낮아지도록 학습하는 과정을 통해 반영될 수 있다. 추가적인 예를 들면, 서버는 특정 폰트(예: Times New Roman 등)나 텍스트 구문의 글자 수가 10개를 초과 하는 광고 콘텐츠에 대한 사용자 단말의 클릭 인터랙션이 확인되지 않는 경우, 특정 폰트나 텍스트의 구문 정보를 사용자 단말의 선호 텍스트 벡터로서 음성 피드백을 부여할 수 있다. 이후, 서버는 일 온라인 플랫폼에 사용자 단말에 접속하는 경우, 해당 특정 폰트나 텍스트의 구문 정보이 포함된 광고 콘텐츠의 게 재될 확률이 낮아지도록 모델 저장부에 저장된 다양한 학습 모델(예: 유저 스타일 임베딩 모델 등)을 학습시킬 수 있다. 또 다른 예를 들면, 서버는 밝은 톤 또는 화사한 톤으로 구성된 뉴스 콘텐츠에 대한 사용자 단말의 클릭 인터랙션이 확인되지 않는 경우, 밝은 톤 또는 화사한 톤으로 구성된 콘텐츠를 사용자 단말의 선호 이미지 벡터로서 음성 피드백을 부여할 수 있다. 이후, 서버는 일 온라인 플랫폼에 사용자 단말에 접 속하는 경우, 밝은 톤 또는 화사한 톤으로 구성된 광고 콘텐츠의 게재될 확률이 낮아지도록 모델 저장부에 저장된 다양한 학습 모델(예: 유저 스타일 임베딩 모델 등)을 학습시킬 수 있다. 다양한 실시예에 따라, 서버는 선호 텍스트 벡터와 선호 이미지 벡터에 대한 양성 피드백(positive feedback)과 음성 피드백(negative feedback)의 비율을 달리하여 다양한 학습 모델(예: 유저 스타일 임베딩 모 델 등)을 학습시킬 수 있다. 일 실시예에 따라, 서버는 콘텐츠에 대한 평균 클릭률(예: CTR: Click Through Rate)이 미리 설정된 비율(예: 1%, 5% 등) 이하인 경우, 다양한 학습 모델을 통한 학습 결과의 정확한 결론을 도출하기 위하여, 양성 피드백 및 음성 피드백의 학습율을 달리 설정할 수 있다. 예를 들면, 서버 는 양성 피드백의 학습율을 1.0 및 음성 피드백의 학습율을 0.01로 설정할 수 있다. 또 다른 예를 들면, 서버 는 양성 피드백의 학습은 유지하되, 음성 피드백에 대한 학습은 중단할 수 있다. 단계를 참조하면, 서버는 선호 텍스트 정보 및 선호 이미지 정보 중 적어도 하나의 정보에 기초하여 미리 저장된 콘텐츠를 커스터마이징 할 수 있다. 여기서 미리 저장된 콘텐츠는 텍스트 및 이미지 중 적어도 어 느 하나로 구성될 수 있다. 다양한 실시예에 따라, 서버는 외부 서버(예: 광고 서버, 콘텐츠 서버 등)로부터 텍스트 및 이미지로 구성 된 콘텐츠를 수신하여 메모리에 저장할 수 있다. 서버는 미리 저장된 콘텐츠를 다양한 기술(예: VAE(Variational Autoencoder), 확산 모델(Diffusion Model), GAN(Generative Adversarial Network), Text- to-Text 모델, Text-to-Image 모델 등)을 통해 텍스트와 이미지의 스타일을 변경할 수 있다. 예를 들면, 서버는 외부 서버(예: 광고 서버)로부터 수신한 광고 콘텐츠를, 사용자 단말이 선호하는 텍스트 및 이미지로 커스터마이징 할 수 있다. 서버는 모델 저장부에 저장된 다양한 모델들(예: 멀티 모달 합성 모델)을 통해, 사용자 단말에게 커스터마이징 된 콘텐츠를 생성할 수 있다. 예를 들면, 서 버는 수신한 광고 콘텐츠에 포함된 텍스트를, 사용자 단말에게 커스터마이징 된 선호 텍스트 정보(예: 텍스트의 단어 정보, 폰트 정보, 문체 정보, 및 텍스트의 길이 정보 등)에 기초하여 변경할 수 있다. 추가적인 예를 들면, 서버는 수신한 광고 콘텐츠에 포함된 이미지를, 사용자 단말에게 커스터마이징 된 선호 이미지 정보(예: 이미지의 배경 정보, 디자인 정보, 및 레이아웃 정보 등)에 기초하여 변경할 수 있다. 또 다른 실시예에 따라, 서버는 선호 텍스트 정보 및 선호 이미지 정보에 기초하여 구성된 적어도 하나의 참조 콘텐츠 정보(예: 샘플 광고 콘텐츠, 미리 생성된 뉴스 콘텐츠 등)를 확인할 수 있다. 서버는 사용자 단말의 선호 텍스트 정보 및 선호 이미지 정보에 기초하여 커스터마이징 콘텐츠를 새롭게 생성하지 않고, 선호 텍스트 정보 및 선호 이미지 정보를 이미 반영한 커스터마이징 콘텐츠를 검색 및 확인할 수 있다. 예를 들 면, 서버는 텍스트의 폰트 정보 및 선호되는 단어 정보를 포함하는 미리 저장된 참조 콘텐츠를 확인할 수 있다. 또 다른 예를 들면, 서버는 선호 이미지 정보에 기초하여 미리 저장된 참조 콘텐츠를 확인할 수 있 다. 일 실시예에 따라, 서버는 확인된 참조 콘텐츠를 이용하여 미리 저장된 콘텐츠를 변경할 수 있다. 예를 들 면, 서버는 외부 서버(예: 광고 서버, 콘텐츠 서버 등)으로부터 수신한 콘텐츠를, 검색 및 확인된 참조 콘 텐츠로 변경할 수 있다. 단계를 참조하면, 서버는 커스터마이징 콘텐츠를 사용자 단말에게 제공할 수 있다. 다양한 실시예에 따라, 서버는 사용자 단말이 연결한 온라인 플랫폼의 콘텐츠 게재 영역을 확인할 수 있다. 일 실시예에 따라, 서버는 해당 온라인 플랫폼의 확인된 콘텐츠 게재 영역에 커스터마이징 콘텐츠를 게재할 수 있다. 예를 들면, 서버는 일 웹사이트에 사용자 단말이 접속하는 경우, 해당 웹사이트에표시될 광고 콘텐츠를 사용자 단말의 인터랙션에 기초하여 생성할 수 있다. 서버는 사용자 단말(20 0)에 커스터마이징 된 콘텐츠(예: 뉴스 콘텐츠, 광고 콘텐츠 등)가 사용자 단말의 화면의 일 영역에 표시 되도록 관련 기능이나 사용자 인터페이스를 제공할 수 있다. 다양한 실시예에 따라, 서버는 콘텐츠에 대한 각각의 사용자 단말(예: 제1 사용자 단말, 제2 사용자 단말, 제3 사용자 단말 등)의 인터랙션에 따라, 서로 다른 커스터마이징 콘텐츠를 생성할 수 있다. 예를 들면, 서버 는 일 온라인 플랫폼에 접속한 제1 사용자 단말의 화면에 표시되는 커스터마이징 콘텐츠와, 제2 사용자 단 말의 화면에 표시되는 커스터마이징 콘텐츠는, 콘텐츠에 대한 각 사용자 단말의 인터랙션에 따라 상이할 수 있 다. 다양한 실시예에 따라, 서버는 커스터마이징 콘텐츠를 사용자 단말에게 제공한 이후, 적어도 일 콘텐 츠에 대한 사용자 단말의 인터랙션 여부를 확인할 수 있다. 일 실시예에 따라, 서버는 사용자 단말 에 커스터마이징 된 콘텐츠(예: 뉴스 콘텐츠, 광고 콘텐츠)가 사용자 단말의 화면의 일 영역에 표시 되도록 관련 기능이나 사용자 인터페이스를 제공한 이후, 일 콘텐츠에 대한 사용자 단말의 인터랙션 여부 를 확인할 수 있다. 다양한 실시예에 따라, 서버는 사용자 단말의 인터랙션에 대응하여, 기존의 선호 텍스트 정보 및 선 호 이미지 정보를 업데이트 할 수 있다. 일 실시예에 따라, 서버는 온라인 플랫폼에 게재된 적어도 일 콘 텐츠에 대한 사용자 단말의 인터랙션이 확인되는 경우, 적어도 일 콘텐츠에 포함된 텍스트 데이터 및 이미 지 데이터를 사용자 단말이 선호하는 텍스트 정보 및 이미지 정보로서 판단할 수 있다. 예를 들면, 광고 콘텐츠에 대한 사용자 단말의 클릭 인터랙션이 확인되는 경우, 서버는 해당 광고 콘 텐츠에 포함된 텍스트 데이터 및 이미지 데이터에 대하여, 사용자 단말의 선호 텍스트 벡터와 선호 이미지 벡터에 대한 양성 피드백(positive feedback)을 부여할 수 있다. 추가적인 예를 들면, 광고 콘텐츠에 대한 사용 자 단말의 클릭 인터랙션이 확인되지 않는 경우, 서버는 해당 광고 콘텐츠에 포함된 텍스트 데이터 및 이미지 데이터에 대하여, 사용자 단말의 선호 텍스트 벡터와 선호 이미지 벡터에 대한 음성 피드백 (negative feedback)을 부여할 수 있다. 다양한 실시예에 따라, 서버는 업데이트 된 선호 텍스트 정보 및 업데이트 된 선호 이미지 정보에 기초하 여, 미리 저장된 콘텐츠를 커스터마이징 할 수 있다. 일 실시예에 따라, 서버는 업데이트 된 선호 텍스트 정보 및 업데이트 된 선호 이미지 정보에 기초하여, 외부 서버(예: 광고 서버, 콘텐츠 서버)로부터 수신한 미리 저장된 콘텐츠를 커스터마이징 할 수 있다. 예를 들면, 서버는 미리 저장된 콘텐츠를 다양한 기술(예: VAE(Variational Autoencoder), 확산 모델(Diffusion Model), GAN(Generative Adversarial Network), Text- to-Text 모델, Text-to-Image 모델 등)을 통해 사용자 단말에 대한 커스터마이징 콘텐츠를 새롭게 생성할 수 있다. 다양한 실시예에 따라, 서버는 커스터마이징 콘텐츠를 사용자 단말에게 제공할 수 있다. 일 실시예에 따라, 서버는 일 웹사이트의 콘텐츠 게재 영역에 커스터마이징 콘텐츠를 게재할 수 있다. 예를 들면, 서버 는 사용자 단말에 업데이트 된 커스터마이징 콘텐츠(예: 뉴스 콘텐츠, 광고 콘텐츠)가 사용자 단말 의 화면의 일 영역에 표시되도록 관련 기능이나 사용자 인터페이스를 제공할 수 있다. 도 3a 및 도 3b는 본 발명의 일 실시예에 따라, 온라인 플랫폼에서 광고 콘텐츠가 표시되는 일 예를 도시한 도 면이다. 도 3a를 참조하면, 서버는 광고 콘텐츠(303, 305)가 포함된 웹사이트가 사용자 단말의 화면에 표시될 수 있도록 관련 기능이나 사용자 인터페이스를 제공할 수 있다. 일 실시예에 따라, 사용자 단말이 웹사이트에 접속하는 경우, 웹사이트에 포함된 정보(예: 뉴스 정보, 게시글 정보 등)와 광고 콘텐츠 (303, 305)가 사용자 단말의 화면에 표시될 수 있도록 관련 기능을 제공할 수 있다. 일 실시예에 따라, 서버는 웹사이트에 접속하는 서로 다른 복수의 사용자 단말들 중에, 쿠키 (cookies), 웹 애널리틱스(web analytics), 서버 로그 기술 등을 통해 웹사이트에 접속하는 사용자 단말 을 특정할 수 있다. 서버는 특정된 사용자 단말의 선호 텍스트 정보 및 선호 이미지 정보에 기 초한 커스터마이징 콘텐츠(예: 광고 콘텐츠(303, 305))를 확인할 수 있다. 여기서 커스터마이징 콘텐츠(예: 광 고 콘텐츠(303, 305))는 광고 서버로부터 수신한 원 콘텐츠를 사용자 단말의 선호 텍스트 정보 및 선호 이 미지 정보에 기초하여 변경된 콘텐츠를 의미할 수 있다. 예를 들면, 서버는 광고 서버로부터 수신한 원 콘텐츠의 텍스트가 '신속하고 정확한 KAKAO 이사 청소'였으 나, 사용자 단말이 밑줄을 선호하는 선호 텍스트 정보에 기초하여, 광고 콘텐츠와 같이 밑줄이 포함 된 '신속하고 정확한 KAKAO 이사 청소'로 변경할 수 있다. 또 다른 예를 들면, 서버는 광고 서버로부터 수 신한 원 콘텐츠의 이미지는 '성형외과 의사 얼굴'이 포함되었으나 사용자 단말이 특정 캐릭터 이미지를 선 호하는 선호 이미지 정보에 기초하여, 원 콘텐츠의 이미지를 제거하고 광고 콘텐츠와 같이 특정 캐릭터 이 미지를 포함하는 커스터마이징 콘텐츠를 생성할 수 있다. 서버는 확인된 커스터마이징 콘텐츠(예: 광고 콘텐츠(303, 305))를 웹사이트의 콘텐츠 게재 영역에 위치하도록 관련 기능이나 사용자 인터페이스를 제공할 수 있다. 도 3b를 참조하면, 서버는 광고 콘텐츠가 포함된 어플리케이션이 사용자 단말의 화면에 표 시될 수 있도록 관련 기능이나 사용자 인터페이스를 제공할 수 있다. 일 실시예에 따라, 사용자 단말이 어 플리케이션에 접속하는 경우, 어플리케이션에 포함된 정보(예: 뉴스 정보, 게시글 정보, 카페 글 등)와 광고 콘텐츠가 사용자 단말의 화면에 표시될 수 있도록 관련 기능을 제공할 수 있다. 일 실시예에 따라, 서버는 어플리케이션에 접속하는 서로 다른 복수의 사용자 단말들 중에, 쿠키 (cookies), 웹 애널리틱스(web analytics), 서버 로그 기술 등을 통해 어플리케이션에 접속하는 사용자 단 말을 특정할 수 있다. 서버는 특정된 사용자 단말의 선호 텍스트 정보 및 선호 이미지 정보에 기초한 커스터마이징 콘텐츠(예: 광고 콘텐츠)를 확인할 수 있다. 여기서 커스터마이징 콘텐츠(예: 광고 콘텐츠)는 광고 서버로부터 수신한 원 콘텐츠를 사용자 단말의 선호 텍스트 정보 및 선호 이미지 정 보에 기초하여 변경한 콘텐츠를 의미할 수 있다. 도 4a 내지 도 4d는 본 발명의 일 실시예에 따라, 텍스트 및 이미지로 구성된 콘텐츠를 사용자가 선호하는 텍스 트 및 이미지로 변경하는 일 예를 도시한 도면이다. 도 4a를 참조하면, 서버는 미리 저장된 콘텐츠(예: 외부 서버로부터 수신한 광고 콘텐츠, 뉴스 콘텐츠 등) 중 원 텍스트를 사용자 단말의 선호 텍스트 정보에 기초하여 변경할 수 있다. 단계를 참조하면, 서버는 외부 서버(예: 광고 서버, 콘텐츠 서버 등)로부터 텍스트 및 이미지로 구성 된 콘텐츠를 수신하여 메모리에 저장할 수 있다. 예를 들면, 서버는 외부 서버로부터 '믿을 수 있는 KAKAO 이사 청소'를 포함하는 광고 콘텐츠를 수신할 수 있다. 단계를 참조하면, 서버는 미리 저장된 콘텐츠를 다양한 기술(예: VAE(Variational Autoencoder), 확 산 모델(Diffusion Model), GAN(Generative Adversarial Network), Text-to-Text 모델, Text-to-Image 모델 등)을 통해 텍스트와 이미지의 스타일을 변경할 수 있다. 여기서, VAE(Variational Autoencoder)는 텍스트 및 이미지를 변경하는 기술의 일 예로서, 인코더와 디코더로 구성되고, 데이터를 잠재변수로 인코딩 한 이후 디코 더를 통해 복원하는 기술일 수 있다. 다양한 실시예에 따라, 서버는 일 온라인 플랫폼에 접속한 사용자 단말의 선호 텍스트 정보를 확인할 수 있다. 예를 들어, 서버는 '신속' 및 '정확'과 관련된 단어가 포함된 콘텐츠에 대한 사용자 단말의 인터랙션(예: 클릭, 광고 콘텐츠에 포함된 웹사이트의 접속, 광고 콘텐츠가 광고하는 제품의 구매 등)이 다른 사용자 단말 대비 높다고 판단되는 경우, '신속' 및 '정확'을 사용자 단말의 선호 텍스트 정보로서 판단할 수 있다. 또 다른 예를 들면, '신속' 및 '정확'과 관련된 단어가 포함된 콘텐츠에 대한 사용자 단말의 인 터랙션(예: 클릭, 광고 콘텐츠에 포함된 웹사이트의 접속, 광고 콘텐츠가 광고하는 제품의 구매 등)이, 다른 단 어가 포함된 콘텐츠에 대한 사용자 단말의 인터랙션 대비 높다고 판단되는 경우, '신속' 및 '정확'을 사용 자 단말의 선호 텍스트 정보로서 판단할 수 있다. 서버는 외부 서버로부터 수신한 원 텍스트 '믿을 수 있는 KAKAO 이사 청소'를 사용자 단말의 선호 텍 스트 정보인 '신속' 및 '정확' 단어가 포함되도록 변경할 수 있다. 예를 들면, 서버는 원 광고 콘텐츠에 포함된 텍스트를 '신속하고 정확한 KAKAO 이사 청소'로 변경할 수 있다. 단계를 참조하면, 서버는 사용자 단말이 접속하는 일 온라인 플랫폼의 콘텐츠 게재 영역에, 사 용자 단말에게 커스터마이징 된 광고 콘텐츠(예: 신속하고 정확한 KAKAO 이사 청소)가 표시되도록 관련 기 능이나 사용자 인터페이스를 제공할 수 있다. 도 4b를 참조하면, 서버는 미리 저장된 콘텐츠(예: 외부 서버로부터 수신한 광고 콘텐츠, 뉴스 콘텐츠 등) 중 원 텍스트를 사용자 단말의 선호 텍스트 정보에 기초하여 변경할 수 있다. 단계를 참조하면, 서버는 외부 서버(예: 광고 서버, 콘텐츠 서버 등)로부터 텍스트 및 이미지로 구성 된 콘텐츠를 수신하여 메모리에 저장할 수 있다. 예를 들면, 서버는 외부 서버로부터 '모두의 시선을 사로잡으세요 KAKAO 캐릭터 컬렉션'를 포함하는 광고 콘텐츠를 수신할 수 있다. 단계를 참조하면, 서버는 미리 저장된 콘텐츠를 다양한 기술(예: VAE(Variational Autoencoder), 확 산 모델(Diffusion Model), GAN(Generative Adversarial Network), Text-to-Text 모델, Text-to-Image 모델 등)을 통해 텍스트와 이미지의 스타일을 변경할 수 있다. 여기서, VAE(Variational Autoencoder)는 텍스트 및 이미지를 변경하는 기술의 일 예로서, 인코더와 디코더로 구성되고, 데이터를 잠재변수로 인코딩 한 이후 디코 더를 통해 복원하는 기술일 수 있다. 다양한 실시예에 따라, 서버는 일 온라인 플랫폼에 접속한 사용자 단말의 선호 텍스트 정보를 확인할 수 있다. 예를 들어, 서버는 문자의 형태가 평서문 보다는 의문문 형태의 문장 구조가 포함된 콘텐츠에 대 한 사용자 단말의 인터랙션(예: 클릭, 광고 콘텐츠에 포함된 웹사이트의 접속, 광고 콘텐츠가 광고하는 제 품의 구매 등)이 다른 사용자 단말 대비 높다고 판단되는 경우, 의문문 형태의 문장 구조를 사용자 단말의 선호 텍스트 정보로서 판단할 수 있다. 또 다른 예를 들면, 서버는 문자의 형태가 평서문 보다는 의문문 형태의 문장 구조가 포함된 콘텐츠에 대 한 사용자 단말의 인터랙션(예: 클릭, 광고 콘텐츠에 포함된 웹사이트의 접속, 광고 콘텐츠가 광고하는 제 품의 구매 등)이, 평서문, 강조문 등의 문장 구조가 포함된 콘텐츠에 대한 사용자 단말의 인터랙션 대비 높다고 판단되는 경우, 의문문 형태의 문장 구조를 사용자 단말의 선호 텍스트 정보로서 판단할 수 있다. 단계를 참조하면, 서버는 사용자 단말이 접속하는 일 온라인 플랫폼의 콘텐츠 게재 영역에, 사 용자 단말에게 커스터마이징 된 광고 콘텐츠(예: 모두의 시선을 원하시나요? KAKAO 캐릭터 컬렉션)가 표시 되도록 관련 기능이나 사용자 인터페이스를 제공할 수 있다. 예를 들면, 서버는 기존의 문장 구조인 평서 문으로 구성된 광고 콘텐츠를 의문문 형태의 문장 구조로 구성된 광고 콘텐츠로 변경할 수 있다. 도 4c를 참조하면, 서버는 미리 저장된 콘텐츠(예: 외부 서버로부터 수신한 광고 콘텐츠, 뉴스 콘텐츠 등) 중 원 이미지가 사용자 단말의 선호 이미지 정보에 기초하여 커스터마이징 할 수 있다. 단계를 참조 하면, 서버는 외부 서버(예: 광고 서버, 콘텐츠 서버 등)로부터 텍스트 및 이미지로 구성된 콘텐츠를 수신 하여 메모리에 저장할 수 있다. 예를 들면, 서버는 외부 서버로부터 사자 이미지 정보가 포함된 광고 콘텐츠를 수신할 수 있다. 단계를 참조하면, 서버는 미리 저장된 콘텐츠를 다양한 기술(예: VAE(Variational Autoencoder) 등)을 통해 텍스트와 이미지의 스타일을 변경할 수 있다. 다양한 실시예에 따라, 서버는 일 온라인 플랫 폼에 접속한 사용자 단말의 선호 이미지 정보를 확인할 수 있다. 예를 들어, 서버는 특정 캐릭터 이 미지가 포함된 콘텐츠에 대한 사용자 단말의 인터랙션(예: 클릭, 광고 콘텐츠에 포함된 웹사이트의 접속, 광고 콘텐츠가 광고하는 제품의 구매 등)이 다른 사용자 단말 대비 높다고 판단되는 경우, 특정 캐릭터 이미지 를 사용자 단말의 선호 이미지 정보로서 판단할 수 있다. 또 다른 예를 들면, 특정 캐릭터 이미지가 포함 된 콘텐츠에 대한 사용자 단말의 인터랙션(예: 클릭, 광고 콘텐츠에 포함된 웹사이트의 접속, 광고 콘텐츠 가 광고하는 제품의 구매 등)이, 다른 이미지가 포함된 콘텐츠에 대한 사용자 단말의 인터랙션 대비 높다 고 판단되는 경우, 해당 캐릭터 이미지를 사용자 단말의 선호 이미지 정보로서 판단할 수 있다. 서버는 외부 서버로부터 수신한 원 이미지(예: 사자 이미지)를 사용자 단말의 선호 이미지 정보인 특 정 캐릭터 이미지가 포함되도록 변경할 수 있다. 단계를 참조하면, 서버는 사용자 단말이 접속 하는 일 온라인 플랫폼의 콘텐츠 게재 영역에, 사용자 단말에게 커스터마이징 된 광고 콘텐츠(예: 특정 캐 릭터 이미지가 포함된 콘텐츠)가 표시되도록 관련 기능이나 사용자 인터페이스를 제공할 수 있다. 도 4d를 참조하면, 서버는 미리 저장된 콘텐츠(예: 외부 서버로부터 수신한 광고 콘텐츠, 뉴스 콘텐츠 등) 중 원 이미지를 사용자 단말의 선호 이미지 정보에 기초하여 커스터마이징 할 수 있다. 단계를 참조 하면, 서버는 외부 서버(예: 광고 서버, 콘텐츠 서버 등)로부터 텍스트 및 이미지로 구성된 콘텐츠를 수신 하여 메모리에 저장할 수 있다. 예를 들면, 서버는 외부 서버로부터 특정 캐릭터 이미지가 포함된 광 고 콘텐츠를 수신할 수 있다. 단계를 참조하면, 서버는 미리 저장된 콘텐츠를 다양한 기술(예: VAE(Variational Autoencoder) 등)을 통해 텍스트와 이미지의 스타일을 변경할 수 있다. 다양한 실시예에 따라, 서버는 일 온라인 플랫 폼에 접속한 사용자 단말의 선호 이미지 정보를 확인할 수 있다. 예를 들어, 서버는 특정 색상 정보로 구성된 콘텐츠에 대한 사용자 단말의 인터랙션(예: 클릭, 광고 콘텐츠에 포함된 웹사이트의 접속, 광고 콘텐츠가 광고하는 제품의 구매 등)이 다른 사용자 단말 대비 높다고 판단되는 경우, 특정 색상 정보를 사용자 단말의 선호 이미지 정보로서 판단할 수 있다. 또 다른 예를 들 면, 특정 색상 정보로 구성된 콘텐츠에 대한 사용자 단말의 인터랙션(예: 클릭, 광고 콘텐츠에 포함된 웹 사이트의 접속, 광고 콘텐츠가 광고하는 제품의 구매 등)이, 다른 이미지가 포함된 콘텐츠에 대한 사용자 단말 의 인터랙션 대비 높다고 판단되는 경우, 특정 색상 정보를 사용자 단말의 선호 이미지 정보로서 판 단할 수 있다. 서버는 외부 서버로부터 수신한 원 이미지를 사용자 단말의 선호 이미지 정보인 특정 색상 정보로 구 성되도록 커스터마이징 할 수 있다. 단계를 참조하면, 서버는 사용자 단말이 접속하는 일 온라 인 플랫폼의 콘텐츠 게재 영역에, 사용자 단말에게 커스터마이징 된 광고 콘텐츠(예: 특정 색상 정보로 구 성된 이미지가 포함된 콘텐츠)가 표시되도록 관련 기능이나 사용자 인터페이스를 제공할 수 있다. 도 5는 본 발명의 일 실시예에 따라, 서버가 AI 서버를 통해 커스터마이징 콘텐츠를 제공하는 네트워 크 환경의 일 예를 도시한 도면이다. 다양한 실시예에 따라, 사용자 단말은 네트워크를 통해 서버 및 AI서버와 서로 연결될 수 있다. 네트워크는 통신 방식이 제한되지 않으며, 네트워크가 포함할 수 있는 통신망(일례로, 이동통신망, 유선 인터넷, 무선 인터넷, 방송망)을 활용하는 통신 방식뿐만 아니라 근거리 무선 통신 역시 포함될 수 있다 다양한 실시예에 따라 AI 서버는 프로세서, 러닝 프로세서, 통신부, 및 메모리를 포함할 수 있다. 일 실시예에 따라, AI 서버는 머신 러닝 알고리즘을 이용하여 인공 신경망을 학습시키거나 학습된 인경 신경망을 이용하는 장치를 의미할 수 있다. 여기서, AI 서버는 복수의 서버들로 구성되어 분산 처리 를 수행할 수 있고, AI 서버가 수행하는 기능들이 사용자 단말 또는 서버의 일부의 구성으로 포 함될 수 있다. 다양한 실시예에 따라, 프로세서는 학습 모델을 이용하여 새로운 입력 데이터에 대한 결과 값을 추론하고, 추론한 결과 값에 기초한 응답이나 제어 명령을 생성할 수 있다. 다양한 실시예에 따라, 러닝 프로세서는 학습 데이터를 이용하여 인공 신경망을 학습시킬 수 있다. 여기서 학습 모델은 인공 신경망의 AI 서버에 탑재된 상태에서 이용되거나, 서버, 사용자 단말 등의 외 부 장치에 탑재되어 이용될 수 있다. 일 실시예에 따라, 학습 모델은 인공지능 기반으로 학습된 판단 모델로서, 신경망(Neural Network)을 기반으로 하는 모델일 수 있다. 일 실시예에 따라, 객체 판단 모델은 인간 의 뇌 구조를 컴퓨터상에서 모의하도록 설계될 수 있고, 인간의 신경망의 뉴런(neuron)을 모의하는, 가중치를 가지는 복수의 네트워크 노드들을 포함할 수 있다. 다양한 실시예에 따라, 복수의 네트워크 노드들은 뉴런이 시냅스를 통하여 신호를 주고받는 뉴런의 시냅틱 (synaptic) 활동을 모의하도록 각각 연결 관계를 형성할 수 있다. 일 실시예에 따라, 객체 판단 모델은 신경망 모델, 또는 신경망 모델에서 발전한 딥러닝 모델을 포함할 수 있다. 딥러닝 모델에서 복수의 네트워크 노드들은 서로 다른 레이어에 위치하면서 컨볼루션(convolution) 연결 관계에 따라 데이터를 주고받을 수 있다. 예를 들 면, 객체 판단 모델은 CNN(Convolutional Neural Network), DNN(Deep Neural Network), RNN(Recurrent Neural Network), BRDNN(Bidirectional Recurrent Deep Neural Network) 등이 있을 수 있다. 통신부는 사용자 단말과 외부 전자 장치 간의 통신을 설정할 수 있다. 예를 들면, 통신부는 무 선 통신 또는 유선 통신을 통해서 네트워크에 연결되어 외부 전자 장치(예: 외부 서버), 서버, 사용자 단 말과 통신할 수 있다. 다양한 실시예에 따라, 메모리는 모델 저장부를 포함할 수 있다. 모델 저장부는 러닝 프로세서 를 통하여 학습 중인 또는 학습된 모델을 저장할 수 있다. 여기서 학습 모델은 하드웨어, 소프트웨어 또 는 하드웨어와 소프트웨어의 조합으로 구현될 수 있다. 학습 모델의 일부 또는 전부가 소프트웨어로 구현되는 경우, 학습 모델을 구성하는 하나 이상의 명령어가 메모리에 저장될 수 있다. 다양한 실시예에 따라, 모델 저장부는 도 1의 모델 저장부의 적어도 일부와 실질적으로 대응되므로, 자세한 설명은 생략한다. 예를 들면, 모델 저장부는 유저 스타일 임베딩 모델 및 멀티모달 합성 모델 을 포함할 수 있고, 유저 스타일 임베딩 모델은 도 1의 유저 스타일 임베딩 모델과, 멀티모달 합성 모델는 도 1의 멀티모달 합성 모델과 실질적으로 대응된다. 도 6은 본 발명의 일 실시예에 따라, 서버가 AI 서버를 통해 생성된 커스터마이징 콘텐츠를 제공하는 일례를 도시한 순서도이다. 다양한 실시예에 따라, 도 6의 각 단계는 문맥상 명백하게 특정 순서를 기재하지 않은 이상 명기된 순서와 다르게 수행될 수 있다. 즉, 각 단계들은 명기된 순서와 동일하게 일어날 수 있고, 실질 적으로 동시에 수행될 수도 있으며 반대의 순서대로 수행될 수도 있다. 단계 및 단계 각각은 단계 및 단계 단계 각각과 실질적으로 대응되므로 자세한 설명은 생 략한다. 단계를 참조하면, 서버는 텍스트 및 이미지로 구성된 미리 저장된 콘텐츠와 사용자 단말의 인 터랙션 여부에 대한 정보를 AI 서버로 전송할 수 있다. 다양한 실시예에 따라, 서버는 콘텐츠에 대한 사용자 단말의 인터랙션 여부에 대한 정보와, 외부 서 버(예: 광고 서버, 콘텐츠 서버)로부터 수신한 콘텐츠에 기초하여 커스터마이징 콘텐츠의 생성을 요청하는 프롬 프팅 정보를 생성할 수 있다. 여기서 프롬프팅 정보란, 서버가 AI 서버에 전송하기 위해 입력되는 텍 스트, 질문, 또는 정보 등일 수 있다. 예를 들어, 서버는 프롬프팅 정보를 통해, AI 서버에게 원하는 작업 또는 질문의 시작점을 제공하고, AI 서버로부터 응답을 수신할 수 있다. 서버는 생성된 프롬프 팅 정보를 AI 서버로 전송할 수 있다. 서버가 사용자 단말의 인터랙션 여부에 대한 정보를 확인하거나, 외부 서버(예: 광고 서버)로부터 수 신한 콘텐츠(예: 광고 콘텐츠, 뉴스 콘텐츠 등)에 관한 설명은 단계의 적어도 일부와 대응되므로, 자세한 설명은 생략한다. 단계를 참조하면, 서버는 AI 서버로부터 사용자 단말의 선호 텍스트 정보 및 선호 이미지 정보에 기초하여 생성된 커스터마이징 콘텐츠를 수신할 수 있다. 여기서 AI 서버가 커스터마이징 콘텐츠 를 생성하는 방법은, 단계의 적어도 일부와 대응되므로, 자세한 설명은 생략한다. 예를 들면, 선호 테스트 정보는 적어도 일 콘텐츠에 포함된 텍스트의 단어 정보, 폰트 정보, 문체 정보, 및 텍스트의 길이 정보 중 적어 도 하나의 정보와 연관된 정보일 수 있다. 추가적인 예를 들면, 선호 이미지 정보는 적어도 일 콘텐츠에 포함된 이미지의 배경 정보, 디자인 정보, 및 레이아웃 정보 중 적어도 하나의 정보와 연관된 정보일 수 있다. 다양한 실시예에 따라, 서버는 사용자 단말이 연결한 온라인 플랫폼의 콘텐츠 게재 영역을 확인할 수 있다. 서버는 확인된 콘텐츠 게재 영역에 AI 서버로부터 수신한 커스터마이징 콘텐츠를 게재할 수 있 다. 예를 들면, 사용자 단말이 온라인 플랫폼에 접속하는 경우, 서버는 AI 서버로부터 수신한 커스터마이징 콘텐츠가 게재되도록 관련 기능이나 사용자 인터페이스를 제공할 수 있다. 다양한 실시예에 따른 장치(예: 모듈들 또는 그 기능들) 또는 방법의 적어도 일부는, 예컨대, 프로그램 모듈의 형태로 컴퓨터로 읽을 수 있는 저장매체(computer-readable storage media)에 저장된 명령어(예: 컴퓨터 프로그 램)로 구현될 수 있다. 일 실시예에 따라, 명령어는 프로세서(예: 프로세서, 프로세서, 프로세서 등)에 의해 실행될 경우, 하나 이상의 프로세서가 해당 명령어에 해당하는 기능을 수행할 수 있다. 컴퓨 터로 읽을 수 있는 저장매체는, 예를 들면, 메모리(예: 메모리, 메모리, 메모리)가 될 수 있다. 컴퓨터로 판독 가능한 기록 매체는, 하드디스크, 플로피디스크, 마그네틱 매체(magnetic media)(예: 자기테이프), 광기록 매체(optical media)(예: CD-ROM(compact disc read only memory), DVD(digital versatile disc), 자기-광 매체(magneto-optical media)(예: 플롭티컬 디스크(floptical disk)), 하드웨어 장 치(예: ROM(read only memory), RAM(random access memory), 또는 플래시 메모리 등) 등을 포함할 수 있다. 또 한, 프로그램 명령에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해 서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함할 수 있다. 상술한 하드웨어 장치는 다양한 실시예 의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지다. 본 발명의 각 실시예에 개시된 기술적 특징들은 해당 실시예에만 한정되는 것은 아니고, 서로 양립 불가능하지 않은 이상, 각 실시예에 개시된 기술적 특징들은 서로 다른 실시예에 병합되어 적용될 수 있다. 따라서, 각 실시예에서는 각각의 기술적 특징을 위주로 설명하지만, 각 기술적 특징이 서로 양립 불가능하지 않 은 이상, 서로 병합되어 적용될 수 있다. 본 발명은 상술한 실시예 및 첨부한 도면에 한정되는 것은 아니며, 본 발명이 속하는 분야에서 통상의 지식을 가진 자의 관점에서 다양한 수정 및 변형이 가능할 것이다. 따라서 본 발명의 범위는 본 명세서의 청구범위 뿐 만 아니라 이 청구범위와 균등한 것들에 의해 정해져야 한다. 부호의 설명 100: 서버 200: 사용자 단말 300: AI 서버"}
{"patent_id": "10-2023-0138693", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 네트워크 환경의 예를 도시한 도면이다. 도 2는 본 발명의 일 실시예에 따라, 서버가 커스터마이징 콘텐츠를 제공하는 일례를 도시한 순서도이다. 도 3a 및 도 3b는 본 발명의 일 실시예에 따라, 온라인 플랫폼에서 광고 콘텐츠가 표시되는 일 예를 도시한 도 면이다. 도 4a 내지 도 4c는 본 발명의 일 실시예에 따라, 텍스트 및 이미지로 구성된 콘텐츠를 사용자가 선호하는 텍스 트 및 이미지로 변경하는 일 예를 도시한 도면이다. 도 5는 본 발명의 일 실시예에 따라, 서버가 AI 서버를 통해 커스터마이징 콘텐츠를 제공하는 네트워크 환경의 일 예를 도시한 도면이다. 도 6은 본 발명의 일 실시예에 따라, 서버가 AI 서버를 통해 생성된 커스터마이징 콘텐츠를 제공하는 일례를 도 시한 순서도이다."}
