{"patent_id": "10-2022-0148406", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0067435", "출원번호": "10-2022-0148406", "발명의 명칭": "플로팅게이트 전계 효과 트랜지스터를 이용한 논리 회로", "출원인": "국립한국교통대학교산학협력단", "발명자": "강명곤"}}
{"patent_id": "10-2022-0148406", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "플로팅 게이트 전계 효과 트랜지스터를 이용한 논리 회로에 있어서,게이트에 제1 입력 신호가 인가되고, 드레인에 제2 입력 신호가 인가되는 제1 수직 전계 효과 트랜지스터;상기 제1 수직 전계 효과 트랜지스터의 소스에 게이트가 연결되고, 그라운드에 소스가 연결되는 제1 타입의 제1센서 트랜지스터;게이트에 상기 제1 입력 신호가 인가되고, 드레인에 상기 제2 입력 신호가 인가되는 제2 수직 전계 효과 트랜지스터; 및상기 제2 수직 전계 효과 트랜지스터의 소스에 게이트가 연결되고, 상기 제1 센서 트랜지스터의 드레인 및 출력신호에 소스가 연결되며, 드레인에 기준 전압이 인가되는 제2 타입의 제2 센서 트랜지스터를 포함하고,상기 제1 및 제2 수직 전계 효과 트랜지스터 각각은기판;상기 기판의 상단에서 수직 방향으로 적층되는 소스 영역, 절연막, 및 드레인 영역; 및상기 수직 방향으로 적층된 소스 영역, 절연막, 및 드레인 영역의 측면에 적층되는 게이트 배리어 및 게이트 영역을 포함하고,상기 제1 및 제2 센서 트랜지스터 각각은상기 기판의 하단에 수평 방향으로 형성되는 소스 영역, 액티브 영역, 및 드레인 영역을 포함하는 것을 특징으로 하는 논리 회로."}
{"patent_id": "10-2022-0148406", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 제1 및 제2 수직 전계 효과 트랜지스터의 소스 영역은 각각 상기 제1 및 제2 센서 트랜지스터의 게이트 영역으로 동작하는 것을 특징으로 하는 논리 회로."}
{"patent_id": "10-2022-0148406", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 제1 수직 전계 효과 트랜지스터, 상기 제2 수직 전계 효과 트랜지스터 및 상기 제1 센서 트랜지스터가 N타입이고, 상기 제2 센서 트랜지스터가 P 타입이고, 상기 제1 입력 신호는 변경되며, 상기 제2 입력 신호가 변경되지 않는 경우 상기 논리 회로는 상기 제1 입력 신호를 반전하여 출력하는 인버터로 동작하는 것을 특징으로하는 논리 회로."}
{"patent_id": "10-2022-0148406", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 인버터와 대응하는 구조를 가지며, 상기 인버터와 직렬 연결되는 다른 인버터를 더 포함하는 경우 상기 논리 회로는 지연 플립-플롭(Delay Flip-Flop)으로 동작하는 것을 특징으로 하는 논리 회로.공개특허 10-2024-0067435-3-청구항 5 제 1 항에 있어서,상기 제1 수직 전계 효과 트랜지스터, 상기 제2 수직 전계 효과 트랜지스터 및 상기 제1 센서 트랜지스터가 N타입이고, 상기 제2 센서 트랜지스터가 P 타입이고, 상기 제1 입력 신호 및 상기 제2 입력 신호가 변경되는 경우 상기 논리 회로는 상기 제1 입력 신호 및 상기 제2 입력 신호의 부정 논리곱을 출력하는 NAND 게이트로 동작하는 것을 특징으로 하는 논리 회로."}
{"patent_id": "10-2022-0148406", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서,상기 제1 수직 전계 효과 트랜지스터, 상기 제2 수직 전계 효과 트랜지스터 및 상기 제2 센서 트랜지스터가 P타입이고, 상기 제1 센서 트랜지스터가 N 타입이고, 상기 제1 입력 신호 및 상기 제2 입력 신호가 변경되는 경우 상기 논리 회로는 상기 제1 입력 신호 및 상기 제2 입력 신호의 부정 논리합을 출력하는 NOR 게이트로 동작하는 것을 특징으로 하는 논리 회로."}
{"patent_id": "10-2022-0148406", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서,상기 제1 수직 전계 효과 트랜지스터 및 상기 제2 수직 전계 효과 트랜지스터는 이중 게이트 구조를 가지는 것을 특징으로 하는 논리 회로."}
{"patent_id": "10-2022-0148406", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1 항에 있어서,상기 제1 수직 전계 효과 트랜지스터의 게이트와 소스 사이에 위치하는 제1 캐패시터; 및 상기 제2 수직 전계 효과 트랜지스터의 게이트와 소스 사이에 위치하는 제2 캐패시터를 더 포함하는 것을 특징으로 하는 논리 회로."}
{"patent_id": "10-2022-0148406", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 플로팅 게이트 전계 효과 트랜지스터를 이용한 논리 회로에 관한 것이다. 상기 논리 회로는 게이트에 제1 입력 신호가 인가되고, 드레인에 제2 입력 신호가 인가되는 제1 수직 전계 효과 트랜지스터; 상기 제1 수직 전계 효과 트랜지스터의 소스에 게이트가 연결되고, 그라운드에 소스가 연결되는 제1 타입의 제1 센서 트랜지스 (뒷면에 계속)"}
{"patent_id": "10-2022-0148406", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 플로팅 게이트 전계 효과 트랜지스터를 이용한 논리 회로에 관한 것이다."}
{"patent_id": "10-2022-0148406", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "현재 사용되는 대부분의 메모리 장치는 폰 노이먼(von Neumann) 구조(또는 아키텍처(architecture))를 가지고 있다. 상기 폰 노이먼 구조는 처리 장치와 메모리 장치가 분리되어 서로 다른 영역에 위치한다. 한편, 자율주행 기술 및/또는 인공지능 기술의 발달로 데이터 처리량이 기하급수적으로 증가하고 있다. 상기 데이터 처리량이 기하급수적으로 증가함에 따라 폰 노이만 구조를 이용하는 데이터 처리 방식은 다양한 문 제에 직면해 있다. 예를 들어, 분리된 처리 장치와 메모리 장치 사이의 동작 속도 차이로 인한 메모리 배리어 (memory barrier) 현상이 발생할 수 있다. 이러한 문제(또는 한계)를 극복하기 위해 처리 장치와 메모리 장치를 하나의 장치에 집적된 인메모리 컴퓨팅 장치가 개발되고 있다. 또한, 상기 컴퓨터 장치에 사용될 수 있는 차세 대 메모리(예: 강유전성 랜덤 액세스 메모리(Ferroelectric Random Access Memory, FRAM) 또는 저항성 랜덤 액 세스 메모리(Resistive Random Access Memory, RRAM)와 같은 비휘발성 메모리)에 대한 관심이 증가하고 있다. 하지만, 상기 차세대 메모리는 생산 공정의 변경, 과도한 투자 비용, 및 메모리 소자의 신뢰성 확보 등과 같은 문제으로 인해 현재까지는 상용화에 어려움을 가지고 있다."}
{"patent_id": "10-2022-0148406", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은, 상기 문제점을 해결하기 위한 것으로, 기존의 CMOS 공정과 호환되고, 크기(면적), 비용, 소비 전력, 및/또는 동작 지연을 감소할 수 있고, 폰 노이먼 병목 현상을 방지할 수 있으며, 신뢰성을 향상시킬 수 있는 플 로팅 게이트 전계 효과 트랜지스터를 이용한 논리 회로를 제공할 수 있다. 본 발명이 해결하고자 하는 과제들은 이상에서 언급한 과제들로 제한되지 않으며, 언급되지 않은 또 다른 과제 들은 아래의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0148406", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 플로팅 게이트 전계 효과 트랜지스터를 이용한 논리 회로는, 게이트에 제1 입력 신 호가 인가되고, 드레인에 제2 입력 신호가 인가되는 제1 수직 전계 효과 트랜지스터; 상기 제1 수직 전계 효과 트랜지스터의 소스에 게이트가 연결되고, 그라운드에 소스가 연결되는 제1 타입의 제1 센서 트랜지스터; 게이트 에 상기 제1 입력 신호가 인가되고, 드레인에 상기 제2 입력 신호가 인가되는 제2 수직 전계 효과 트랜지스터; 및 상기 제2 수직 전계 효과 트랜지스터의 소스에 게이트가 연결되고, 상기 제1 센서 트랜지스터의 드레인 및 출력 신호에 소스가 연결되며, 드레인에 기준 전압이 인가되는 제2 타입의 제2 센서 트랜지스터를 포함할 수 있 다. 상기 제1 및 제2 수직 전계 효과 트랜지스터 각각은 기판; 상기 기판의 상단에서 수직 방향으로 적층되는 소스 영역, 절연막, 및 드레인 영역; 및 상기 수직 방향으로 적층된 소스 영역, 절연막, 및 드레인 영역의 측면 에 적층되는 게이트 배리어 및 게이트 영역을 포함할 수 있다. 상기 제1 및 제2 센서 트랜지스터 각각은 상기 기판의 하단에 수평 방향으로 형성되는 소스 영역, 액티브 영역, 및 드레인 영역을 포함할 수 있다. 상기 제1 및 제2 수직 전계 효과 트랜지스터의 소스 영역은 각각 상기 제1 및 제2 센서 트랜지스터의 게이트 영 역으로 동작할 수 있다. 상기 논리 회로는 상기 제1 수직 전계 효과 트랜지스터, 상기 제2 수직 전계 효과 트랜지스터 및 상기 제1 센서 트랜지스터가 N 타입이고, 상기 제2 센서 트랜지스터가 P 타입이고, 상기 제1 입력 신호는 변경되며, 상기 제2 입력 신호가 변경되지 않는 경우 상기 제1 입력 신호를 반전하여 출력하는 인버터로 동작할 수 있다. 상기 논리 회로는 상기 인버터와 대응하는 구조를 가지며, 상기 인버터와 직렬 연결되는 다른 인버터를 더 포함 하는 경우 지연 플립-플롭(Delay Flip-Flop)으로 동작할 수 있다. 상기 논리 회로는 상기 제1 수직 전계 효과 트랜지스터, 상기 제2 수직 전계 효과 트랜지스터 및 상기 제1 센서 트랜지스터가 N 타입이고, 상기 제2 센서 트랜지스터가 P 타입이고, 상기 제1 입력 신호 및 상기 제2 입력 신호 가 변경되는 경우 상기 제1 입력 신호 및 상기 제2 입력 신호의 부정 논리곱을 출력하는 NAND 게이트로 동작할 수 있다. 상기 논리 회로는 상기 제1 수직 전계 효과 트랜지스터, 상기 제2 수직 전계 효과 트랜지스터 및 상기 제2 센서 트랜지스터가 P 타입이고, 상기 제1 센서 트랜지스터가 N 타입이고, 상기 제1 입력 신호 및 상기 제2 입력 신호 가 변경되는 경우 상기 제1 입력 신호 및 상기 제2 입력 신호의 부정 논리합을 출력하는 NOR 게이트로 동작할 수 있다. 상기 제1 수직 전계 효과 트랜지스터 및 상기 제2 수직 전계 효과 트랜지스터는 이중 게이트 구조를 가질 수 있 다. 상기 논리 회로는 상기 제1 수직 전계 효과 트랜지스터의 게이트와 소스 사이에 위치하는 제1 캐패시터; 및 상 기 제2 수직 전계 효과 트랜지스터의 게이트와 소스 사이에 위치하는 제2 캐패시터를 더 포함할 수 있다."}
{"patent_id": "10-2022-0148406", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 논리 회로는 기존의 CMOS 공정과 호환이 가능한 플로팅 게이트 전계 효과 트랜지스터를 이용함 에 따라, 크기(면적), 소비 전력, 및/또는 동작 지연이 현저히 감소되고, 폰 노이만 병목 현상을 방지(해소)할수 있다. 또한, 본 발명에 따른 논리 회로는 기존의 CMOS 공정을 이용함에 따라 새로운 제조 공정으로 인한 예상치 못한 문제가 발생하는 것을 방지할 수 있어 신뢰성을 향상시킬 수 있다."}
{"patent_id": "10-2022-0148406", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명의 바람직한 실시예를 상세히 설명한다. 본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현"}
{"patent_id": "10-2022-0148406", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "될 것이며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하며, 본 발명이 속하는 기술분야에서 통상의 지 식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정 의될 뿐이다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성 요소를 지칭한다. 비록 제1, 제2 등이 다양한 소자, 구성요소 및/또는 섹션들을 서술하기 위해서 사용되나, 이들 소자, 구성요소 및/또는 섹션들은 이들 용어에 의해 제한되지 않음은 물론이다. 이들 용어들은 단지 하나의 소자, 구성요소 또 는 섹션들을 다른 소자, 구성요소 또는 섹션들과 구별하기 위하여 사용하는 것이다. 따라서, 이하에서 언급되는 제1 소자, 제1 구성요소 또는 제1 섹션은 본 발명의 기술적 사상 내에서 제2 소자, 제2 구성요소 또는 제2 섹션 일 수도 있음은 물론이다. 본 명세서에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명 세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함한다 (comprises)\" 및/또는 \"이루어지다(made of)\"는 언급된 구성요소, 단계, 동작 및/또는 소자는 하나 이상의 다른 구성요소, 단계, 동작 및/또는 소자의 존재 또는 추가를 배제하지 않는다. 다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것이다. 또 일반적으로 사용되는 사전에 정의되어 있는 용어들은 명백하게 특별히 정의되어 있지 않는 한 이상적으로 또는 과도하게 해 석되지 않는다. 이하, 본 발명에 대하여 첨부된 도면에 따라 보다 상세히 설명한다. 도 1a는 본 발명의 제1 실시예에 따른 플로팅 게이트 전계 효과 트랜지스터를 이용한 논리 회로를 도시한 도면 이고, 도 1b는 본 발명의 제1 실시예에 따른 플로팅 게이트 전계 효과 트랜지스터를 이용한 논리 회로의 입력 신호 및 출력 신호 에 대한 다이어그램을 도시한 도면이며, 도 2는 본 발명의 일 실시예에 따른 플로팅 게이트전계 효과 트랜지스터의 구조를 도시한 도면이다. 도 1a 내지 도 2를 참조하면, 본 발명의 제1 실시예에 따른 플로팅 게이트 전계 효과 트랜지스터를 이용한 논리 회로는 제1 플로팅 게이트 전계 효과 트랜지스터(Floating Gate Field Effect Transistor, FGFET) 및 제2 플로팅 게이트 전계 효과 트랜지스터를 포함할 수 있다. 제1 플로팅 게이트 전계 효과 트랜지스터 및 제2 플로팅 게이트 전계 효과 트랜지스터는 수직 전계 효과 트랜지스터(Vertical Field Effect Transistor, VFET)와 센서 트랜지스터(Sensor FET, SFET)가 결합되어 형성될 수 있다. 예를 들어, 제1 플로팅 게이트 전계 효과 트랜지스터는 제1 수직 전계 효과 트랜지스터 , 제1 센서 트랜지스터, 및 제1 캐패시터(Capacitor)를 포함할 수 있다. 유사하게, 제2 플로팅 게이트 전계 효과 트랜지스터는 제2 수직 전계 효과 트랜지스터, 제2 센서 트랜지스터, 및 제2 캐패시터를 포함할 수 있다. 제1 수직 전계 효과 트랜지스터는 게이트(G)에 제1 입력 신호(VIN1)(또는 클럭 신호(CK))가 인가되고, 드레 인(D)에 제2 입력 신호(VIN2)가 인가되며, 소스(S)는 제1 센서 트랜지스터의 게이트(G)와 연결될 수 있다. 제1 센서 트랜지스터는 게이트(G)가 제1 수직 전계 효과 트랜지스터의 소스(S)와 연결되고, 드레인 (D)이 제2 센서 트랜지스터의 소스(S) 및 출력(VOUT)과 연결되며, 소스(S)가 그라운드(GND)와 연결될 수 있 다. 제1 캐패시터는 제1 수직 전계 효과 트랜지스터의 게이트(G)와 소스(S) 사이에 위치할 수 있다. 제2 수직 전계 효과 트랜지스터는 게이트(G)에 제1 입력 신호(VIN1)가 인가되고, 드레인(D)에 제2 입력 신 호(VIN2)가 인가되며, 소스(S)는 제2 센서 트랜지스터의 게이트(G)와 연결될 수 있다. 제2 센서 트랜지스터 는 게이트(G)가 제2 수직 전계 효과 트랜지스터의 소스(S)와 연결되고, 드레인(D)이 기준 전압(VDD) 과 연결되며, 소스(S)가 제1 센서 트랜지스터의 드레인(D) 및 출력(VOUT)과 연결될 수 있다. 제2 캐패시터 는 제2 수직 전계 효과 트랜지스터의 게이트(G)와 소스(S) 사이에 위치할 수 있다. 상기 논리 회로는, 도 1b에 도시된 바와 같이, 제1 입력(VIN1)을 반전하여 출력하는 인버터(inverter)로 동 작할 수 있다. 상기 논리 회로가 인버터로 동작하는 경우 상기 제1 수직 전계 효과 트랜지스터, 상기 제2 수직 전계 효과 트랜지스터 및 상기 제1 센서 트랜지스터는 N 타입이고, 상기 제2 센서 트랜지스 터는 P 타입일 수 있다. 이때, 제2 입력(VIN2)는 일정한 값(예: 1.8V)을 가질 수 있다. 즉, 제2 입력(VIN2) 은 시간에 따라 변경되지 않는다. 한편, 도 2를 참조하면, 제1 수직 전계 효과 트랜지스터 및 제2 수직 전계 효과 트랜지스터는 기판 , 소스 영역, 절연막, 드레인 영역, 게이트 배리어, 및 게이트 영역을 포함할 수 있다. 소스 영역, 절연막, 및 드레인 영역은 기판의 상단에 수직으로 적층될 수 있다. 게이트 배 리어 및 게이트 영역은 수직으로 적층된 소스 영역, 절연막, 및 드레인 영역의 좌측 및 우측에 적층될 수 있다. 즉, 제1 수직 전계 효과 트랜지스터 및 제2 수직 전계 효과 트랜지스터는, 이에 한정되지는 않지만, 2개의 게이트 영역을 가지는 이중 게이트(double-gate) 구조를 가 질 수 있다. 제1 및 제2 센서 트랜지스터(112, 122)는 기판의 하단에 수평 방향으로 형성되는 소스 영역, 액티브 영역, 드레인 영역을 포함할 수 있다. 예를 들어, 액티브 영역은 소스 영역의 하단에 형성 되고, 소스 영역은 액티브 영역의 좌측에 형성되며, 드레인 영역은 액티브 영역의 우측에 형성될 수 있다. 이와 같이, 본 발명의 제1 및 제2 플로팅 게이트 전계 효과 트랜지스터(110, 120)는 제1 및 제 2 센서 트랜지스터(112, 122)의 게이트 영역을 별도로 형성하지 않고, 제1 및 제2 수직 전계 효과 트랜지스터 (111, 121)의 소스 영역(S)을 제1 및 제2 센서 트랜지스터(112, 122)의 게이트 영역으로 각각 활용할 수 있다. 이와 같이, 제1 및 제2 플로팅 게이트 전계 효과 트랜지스터(110, 120)는 제1 및 제2 수직 전계 효과 트랜지스 터(111, 121)의 하단에 제1 및 제2 센서 트랜지스터(112, 122)를 각각 추가하는 비교적 간편한 방법으로 제조될 수 있고, 간단한 구조를 가진다. 즉, 종래의 논리 회로에 비하여 필요한 트랜지스터의 수가 크게 감소된다. 이 로 인하여, 제1 및 제2 플로팅 게이트 전계 효과 트랜지스터(110, 120)를 이용하여 논리 회로(또는 집적회로)를 제조하는 경우 면적 효율, 소비 전력, 및 동작 지연을 개선할 수 있다. 특히, 제1 및 제2 수직 전계 효과 트랜 지스터(111, 121)는 채널의 폭이 좁다. 이에, 반도체 소자의 크기를 더 줄일 수 있다. 또한, 제1 및 제2 플로팅게이트 전계 효과 트랜지스터(110, 120)는 기존 CMOS 공정을 사용하여 개발된다. 따라서, 본 발명은 제조 설비 및/또는 공정에 대한 비용을 추가로 지출할 필요가 없다. 또한, 검증되지 않은 새로운 공정을 이용하지 않고, 이미 검증된 CMOS 공정을 이용함에 따라 제1 및 제2 플로팅 게이트 전계 효과 트랜지스터(110, 120)를 이용하는 논리 회로(집적회로)에 대한 신뢰성이 보장된다. 도 3은 본 발명의 제2 실시예에 따른 플로팅 게이트 전계 효과 트랜지스터를 이용한 논리 회로를 도시한 도면이 다. 도 3을 참조하면, 본 발명의 제2 실시예에 따른 플로팅 게이트 전계 효과 트랜지스터를 이용한 논리 회로 는 직렬 연결된 제1 인버터 및 제2 인버터로 구성될 수 있다. 제1 인버터 및 제2 인버터는 도 1a 내지 도 2의 인버터로 동작하는 논리 회로와 동일한 구성을 가질 수 있다. 이러한 구조를 가지는 논리 회로은 지연 플립-플롭(Delay Flip-Flop)로 동작할 수 있다. 본 발명의 지연 플립-플롭은, 플로팅 게 이트 전계 효과 트랜지스터를 이용함에 따라, 기존의 지연 플립-플롭에 비하여 대략적으로 30 ~ 40 % 까지 면적 을 줄일 수 있다. 도 4a는 본 발명의 제3 실시예에 따른 플로팅 게이트 전계 효과 트랜지스터를 이용한 논리 회로를 도시한 도면 이고, 도 4b는 본 발명의 제3 실시예에 따른 플로팅 게이트 전계 효과 트랜지스터를 이용한 논리 회로의 입력 신호 및 출력 신호에 대한 다이어그램을 도시한 도면이다. 도 4a 및 도 4b를 참조하면, 본 발명의 제3 실시예에 따른 플로팅 게이트 전계 효과 트랜지스터를 이용한 논리 회로는 NAND 게이트로 동작할 수 있다. 상기 논리 회로가 NAND 게이트로 동작하는 경우 상기 제1 수 직 전계 효과 트랜지스터, 상기 제2 수직 전계 효과 트랜지스터 및 상기 제1 센서 트랜지스터는 N 타입이고, 상기 제2 센서 트랜지스터는 P 타입일 수 있다. 논리 회로는, 도 1a의 논리 회로와 달리, 제1 입력 신호(VIN1) 및 제2 입력 신호(VIN2)가 모두 변경될 수 있다. 즉, 본 발명의 논리 회로는, 도 4b에 도시된 바와 같이, 제1 입력 신호(VIN1) 및 제2 입력 신호(VIN2)의 부정 논리곱을 출력할 수 있다. 도 5a는 본 발명의 제4 실시예에 따른 플로팅 게이트 전계 효과 트랜지스터를 이용한 논리 회로를 도시한 도면 이고, 도 5b는 본 발명의 제4 실시예에 따른 플로팅 게이트 전계 효과 트랜지스터를 이용한 논리 회로의 입력 신호 및 출력 신호에 대한 다이어그램을 도시한 도면이다. 도 5a 및 도 5b를 참조하면, 본 발명의 제4 실시예에 따른 플로팅 게이트 전계 효과 트랜지스터를 이용한 논리 회로는 NOR 게이트로 동작할 수 있다. 상기 논리 회로가 NOR 게이트로 동작하는 경우 제1 수직 전계 효과 트랜지스터, 제2 수직 전계 효과 트랜지스터 및 제2 센서 트랜지스터는 P 타입이고, 제1 센서 트랜지스터는 N 타입일 수 있다. 또한, 제1 입력 신호(VIN1) 및 제2 입력 신호(VIN2)는 모두 변경될 수 있다. 즉, 본 발명의 논리 회로는, 도 5b에 도시된 바와 같이, 제1 입력 신호(VIN1) 및 제2 입력 신호(VIN 2)의 부정 논리합을 출력할 수 있다."}
{"patent_id": "10-2022-0148406", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이상 첨부된 도면을 참조하여 본 발명의 실시예를 설명하였지만, 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자는 본 발명이 그 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 실시될 수 있 다는 것을 이해할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적 이 아닌 것으로 이해해야만 한다."}
{"patent_id": "10-2022-0148406", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1a는 본 발명의 제1 실시예에 따른 플로팅 게이트 전계 효과 트랜지스터를 이용한 논리 회로를 도시한 도면 이다. 도 1b는 본 발명의 제1 실시예에 따른 플로팅 게이트 전계 효과 트랜지스터를 이용한 논리 회로의 입력 신호 및 출력 신호에 대한 다이어그램을 도시한 도면이다. 도 2는 본 발명의 일 실시예에 따른 플로팅 게이트 전계 효과 트랜지스터의 구조를 도시한 도면이다. 도 3은 본 발명의 제2 실시예에 따른 플로팅 게이트 전계 효과 트랜지스터를 이용한 논리 회로를 도시한 도면이 다. 도 4a는 본 발명의 제3 실시예에 따른 플로팅 게이트 전계 효과 트랜지스터를 이용한 논리 회로를 도시한 도면 이다. 도 4b는 본 발명의 제3 실시예에 따른 플로팅 게이트 전계 효과 트랜지스터를 이용한 논리 회로의 입력 신호 및 출력 신호에 대한 다이어그램을 도시한 도면이다. 도 5a는 본 발명의 제4 실시예에 따른 플로팅 게이트 전계 효과 트랜지스터를 이용한 논리 회로를 도시한 도면 이다. 도 5b는 본 발명의 제4 실시예에 따른 플로팅 게이트 전계 효과 트랜지스터를 이용한 논리 회로의 입력 신호 및 출력 신호에 대한 다이어그램을 도시한 도면이다."}
