{"patent_id": "10-2019-0176272", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0083706", "출원번호": "10-2019-0176272", "발명의 명칭": "데이터의 범주를 분류하는 컴퓨팅 장치 및 방법", "출원인": "삼성전자주식회사", "발명자": "최승혁"}}
{"patent_id": "10-2019-0176272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "컴퓨팅 장치에 있어서,하나 이상의 인스트럭션을 저장하는 메모리; 및상기 메모리에 저장된 상기 하나 이상의 인스트럭션을 실행하는 적어도 하나의 프로세서를 포함하고,상기 적어도 하나의 프로세서는,데이터 범주(category)의 분류 기준 및 복수의 키워드(keyword)를 포함하는 데이터 범주의 분류 체계를 식별하고,적어도 하나의 문장을 포함하는 데이터를 획득하고,비지도 학습에 의한 분류(classification)를 수행하는 뉴럴 네트워크를 이용하여, 상기 데이터 범주의 분류 체계에 기초하여 상기 데이터의 상기 적어도 하나의 문장에 대한 적어도 하나의 범주를 결정하는, 컴퓨팅 장치."}
{"patent_id": "10-2019-0176272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 적어도 하나의 프로세서는,상기 뉴럴 네트워크를 이용하여, 상기 데이터 범주의 분류 체계에 따라 상기 적어도 하나의 문장의 범주를 결정할 수 없다고 판단하고,상기 판단 결과에 기초하여, 상기 데이터 범주의 분류 체계를 업데이트하고,상기 업데이트 된 데이터 범주의 분류 체계에 기초하여, 상기 데이터의 적어도 하나의 문장에 대한 적어도 하나의 범주를 결정하는, 컴퓨팅 장치."}
{"patent_id": "10-2019-0176272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 적어도 하나의 프로세서는,제1 뉴럴 네트워크를 이용하여 상기 데이터의 복수 개의 범주 후보를 결정하고,제2 뉴럴 네트워크를 이용하여, 상기 데이터의 복수 개의 범주 후보 중 적어도 하나의 범주를 상기 데이터의 상기 적어도 하나의 문장에 대한 적어도 하나의 범주로 결정하는, 컴퓨팅 장치."}
{"patent_id": "10-2019-0176272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 데이터는 복수의 사용자에 의해 생성된 소셜 미디어 데이터를 포함하고,상기 데이터 범주의 분류 체계는 제품 기능에 따른 분류 체계를 포함하고,상기 적어도 하나의 프로세서는,상기 결정된 상기 데이터의 상기 적어도 하나의 범주에 기초하여, 상기 복수의 사용자의 요구사항을 획득하는,컴퓨팅 장치."}
{"patent_id": "10-2019-0176272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 적어도 하나의 프로세서는,상기 획득한 데이터의 전처리 및 문장 분리를 수행한 제1 학습 데이터를 생성하고,상기 제1 학습 데이터에 기초하여, 문장 별로 단어의 형태적 유사어 및 의미적 유사어 중 적어도 하나를 포함하는 제2 학습 데이터를 생성하고,공개특허 10-2021-0083706-3-상기 제2 학습 데이터에 기초하여, 문장 임베딩(sentence embedding)을 수행한 제3 학습 데이터를 생성하고,상기 제3 학습 데이터에 기초하여, 상기 데이터 범주의 분류 체계에 따라 상기 데이터의 상기 적어도 하나의 문장에 대한 적어도 하나의 범주를 결정하는, 컴퓨팅 장치."}
{"patent_id": "10-2019-0176272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 적어도 하나의 프로세서는,상기 획득한 데이터에 기초하여, 문장 경계 인식에 따라 문장의 분리를 수행하고,상기 문장의 분리의 수행 결과에 기초하여, 상기 데이터의 불필요한 용어를 제거하여 상기 제1 학습 데이터를생성하는, 컴퓨팅 장치."}
{"patent_id": "10-2019-0176272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5항에 있어서, 상기 적어도 하나의 프로세서는,상기 데이터 범주의 분류 체계에 기초하여, 상기 제1 학습 데이터에서 상기 복수의 키워드에 매칭되는 단어를제외한 단어를 제거한 제1 변형 데이터를 생성하고,편집 거리(edit distance) 알고리즘을 이용하여, 상기 제1 변형 데이터의 상기 단어의 형태적 유사어를 확장한제2 변형 데이터를 생성하고,단어 임베딩(word embedding)에 기초하여, 상기 제2 변형 데이터의 상기 단어의 의미적 유사어를 확장한 단어벡터를 포함하는 상기 제2 학습 데이터를 생성하는, 컴퓨팅 장치."}
{"patent_id": "10-2019-0176272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 복수의 키워드에 매칭되는 단어는,상기 복수의 키워드에 포함되는 단어 및 근사 문자열 매칭(approximate string matching) 방법에 기초하여 상기복수의 키워드와 매칭되는 단어 중 적어도 하나를 포함하는, 컴퓨팅 장치."}
{"patent_id": "10-2019-0176272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제5항에 있어서, 상기 적어도 하나의 프로세서는,상기 제2 학습 데이터로부터 적어도 하나의 단어 벡터에 대한 평균 가중치를 획득하고,특이값 분해(Singular Value Decomposition)를 이용하여 상기 획득된 평균 가중치를 평탄화(smoothing)하고,상기 평탄화된 평균 가중치를 이용하여 문장 임베딩을 수행한 결과 상기 제3 학습 데이터를 생성하는, 컴퓨팅장치."}
{"patent_id": "10-2019-0176272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 적어도 하나의 단어 벡터에 대한 평균 가중치는,최대 가능도 모수 추정(maximum likelihood estimate)에 기초하여, 상기 적어도 하나의 단어 벡터의 가중치를이용하여 획득되고,상기 적어도 하나의 단어 벡터의 가중치는,TF*IDF(Time Frequency-Inverse Document Frequency)를 이용하여 상기 적어도 하나의 단어에 대하여 계산된 가중치인, 컴퓨팅 장치."}
{"patent_id": "10-2019-0176272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제5항에 있어서, 상기 적어도 하나의 프로세서는,상기 데이터 범주의 분류 체계 중 상기 제3 학습 데이터와 가장 유사한 중심점(centroid)을 결정하고,상기 결정된 중심점에 기초하여, 상기 데이터의 상기 적어도 하나의 문장에 대한 적어도 하나의 범주를 결정하공개특허 10-2021-0083706-4-는, 컴퓨팅 장치."}
{"patent_id": "10-2019-0176272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "컴퓨팅 장치의 동작 방법에 있어서,데이터 범주(category)의 분류 기준 및 복수의 키워드(keyword)를 포함하는 데이터 범주의 분류 체계를 식별하는 동작;적어도 하나의 문장을 포함하는 데이터를 획득하는 동작;학습에 의한 분류(Classification)를 수행하는 뉴럴 네트워크를 이용하여, 상기 데이터 범주의 분류 체계에 기초하여 상기 데이터의 상기 적어도 하나의 문장에 대한 적어도 하나의 범주를 결정하는 동작을 포함하는, 방법."}
{"patent_id": "10-2019-0176272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 뉴럴 네트워크를 이용하여, 상기 데이터 범주의 분류 체계에 따라 상기 적어도 하나의 문장의 범주를 결정할 수 없다고 판단하는 동작;상기 판단 결과에 기초하여, 상기 데이터 범주의 분류 체계를 업데이트하는 동작; 및상기 업데이트 된 데이터 범주의 분류 체계에 기초하여, 상기 데이터의 적어도 하나의 문장에 대한 적어도 하나의 범주를 결정하는 동작을 더 포함하는, 방법."}
{"patent_id": "10-2019-0176272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12항에 있어서, 상기 비정형 데이터는 복수의 사용자에 의해 생성된 소셜 미디어 데이터를 포함하고,상기 데이터 범주의 분류 체계는 제품 기능에 따른 분류 체계를 포함하고,상기 컴퓨팅 장치의 동작 방법은,상기 결정된 상기 데이터의 상기 적어도 하나의 범주에 기초하여, 상기 복수의 사용자의 요구사항을 획득하는동작을 더 포함하는, 방법."}
{"patent_id": "10-2019-0176272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제12항에 있어서, 상기 데이터의 상기 적어도 하나의 문장에 대한 적어도 하나의 범주를 결정하는 동작은,상기 획득한 데이터의 전처리 및 문장 분리를 수행한 제1 학습 데이터를 생성하는 동작;상기 제1 학습 데이터에 기초하여, 문장 별로 단어의 형태적 유사어 및 의미적 유사어 중 적어도 하나를 포함하는 제2 학습 데이터를 생성하는 동작;상기 제2 학습 데이터에 기초하여, 문장 임베딩(sentence embedding)을 수행한 제3 학습 데이터를 생성하는 동작; 및상기 제3 학습 데이터에 기초하여, 상기 데이터 범주의 분류 체계에 따라 상기 데이터의 상기 적어도 하나의 문장에 대한 적어도 하나의 범주를 결정하는 동작을 포함하는, 방법."}
{"patent_id": "10-2019-0176272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서, 상기 제2 학습 데이터를 생성하는 동작은,상기 데이터 범주의 분류 체계에 기초하여, 상기 제1 학습 데이터에서 상기 복수의 키워드에 매칭되는 단어를제외한 단어를 제거한 제1 변형 데이터를 생성하는 동작;편집 거리(edit distance) 알고리즘을 이용하여, 상기 제1 변형 데이터의 상기 단어의 형태적 유사어를 확장한제2 변형 데이터를 생성하는 동작; 및단어 임베딩(word embedding)에 기초하여, 상기 제2 변형 데이터의 상기 단어의 의미적 유사어를 확장한 단어벡터를 포함하는 상기 제2 학습 데이터를 생성하는 동작을 포함하는, 방법.공개특허 10-2021-0083706-5-청구항 17 제15항에 있어서, 상기 복수의 키워드에 매칭되는 단어는,상기 복수의 키워드에 포함되는 단어 및 근사 문자열 매칭(approximate string matching) 방법에 기초하여 상기복수의 키워드와 매칭되는 단어 중 적어도 하나를 포함하는, 방법."}
{"patent_id": "10-2019-0176272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제15항에 있어서, 상기 제3 학습 데이터를 생성하는 동작은,상기 제2 학습 데이터로부터 적어도 하나의 단어 벡터에 대한 평균 가중치를 획득하는 동작;특이값 분해(Singular Value Decomposition)를 이용하여 상기 획득된 평균 가중치를 평탄화(smoothing)하는 동작; 및상기 평탄화된 평균 가중치를 이용하여 문장 임베딩을 수행한 결과 상기 제3 학습 데이터를 생성하는 동작을 포함하는, 방법."}
{"patent_id": "10-2019-0176272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제15항에 있어서, 상기 데이터의 상기 적어도 하나의 문장에 대한 적어도 하나의 범주를 결정하는 동작은,상기 데이터 범주의 분류 체계 중 상기 제3 학습 데이터와 가장 유사한 중심점(centroid)을 결정하는 동작; 및상기 결정된 중심점에 기초하여, 상기 데이터의 상기 적어도 하나의 문장에 대한 적어도 하나의 범주를 결정하는 동작을 포함하는, 방법."}
{"patent_id": "10-2019-0176272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "하나 이상의 프로그램들을 저장하는 컴퓨터로 읽을 수 있는 기록매체로서,상기 하나 이상의 프로그램들은, 컴퓨팅 장치의 하나 이상의 프로세서에 의해 실행될 때, 상기 컴퓨팅 장치로하여금:데이터 범주(category)의 분류 기준 및 복수의 키워드(keyword)를 포함하는 데이터 범주의 분류 체계를 식별하고,적어도 하나의 문장을 포함하는 데이터를 획득하고,비지도 학습에 의한 분류(classification)를 수행하는 뉴럴 네트워크를 이용하여, 상기 데이터 범주의 분류 체계에 기초하여 상기 데이터의 상기 적어도 하나의 문장에 대한 적어도 하나의 범주를 결정하는, 컴퓨터로 읽을수 있는 기록매체."}
{"patent_id": "10-2019-0176272", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 데이터의 범주를 분류하는 장치 및 방법에 관한 것으로, 하나 이상의 인스트럭션들을 저장하는 메모리, 및 상기 메모리에 저장된 상기 하나 이상의 인스트럭션들을 실행하는 적어도 하나의 프로세서를 포함하 며, 상기 적어도 하나의 프로세서는, 데이터 범주(category)의 분류 기준 및 복수의 키워드(keyword)를 포함하는 데이터 범주의 분류 체계를 식별하고, 적어도 하나의 문장을 포함하는 데이터를 획득하고, 비지도 학습에 의한 분류를 수행하는 뉴럴 네트워크를 이용하여, 상기 데이터 범주의 분류 체계에 기초하여 상기 데이터의 상기 적어 도 하나의 문장에 대한 적어도 하나의 범주를 결정할 수 있다."}
{"patent_id": "10-2019-0176272", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시의 실시예들은 데이터의 범주를 분류하는 컴퓨팅 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2019-0176272", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 인터넷, 소셜 미디어(social media) 등의 발달에 따라, 1인 미디어를 통한 다양한 사용자들의 의견을 얻는 기술이 대두되고 있다. 예를 들어, 사업자는 1인 미디어를 통한 다양한 사용자들의 의견들을 획득하고 획득한 의견들을 고려함으로써 혁신적인 제품을 개발할 수 있다. 다만, 인터넷, 소셜 미디어 등의 발달에 따라 데이터 들이 기하급수적으로 증가된 반면, 데이터들의 상당 부분이 정해진 형식이 없는 비정형적 데이터(unstructured data)로 이루어져 있기 때문에 수많은 데이터들의 의미를 정확히 이해하는데 한계가 존재한다. 이에 따라, 데이 터의 범주를 결정하는 기술로 Clustering 기술과 Classification 기술이 개발되었다. Clustering 기술은 데이 터를 유사도가 높은 임의의 주제로 구분하고 각 주제별로 어떠한 키워드를 포함하는지 파악하는 알고리즘이다. Clustering 기술은 비지도 학습(unsupervised learning) 방식으로서 기계가 자동적으로 그룹을 형성하기 때문에 사용자가 원하는 주제와 일치하지 않거나 주제에 대한 의미 파악에 어려움을 겪을 수 있다. 또한,Classification 기술은 지도 학습(supervised learning) 방식으로서 범주 간의 관계성에 기초하여, 범주 간에 존재하는 계층적 구조와 같은 잠재적 구조를 기반으로 분류하는 알고리즘이다. Classification 기술은 지도 학 습으로, 정의된 분류 구축 체계가 필요하기 때문에 기하급수적으로 증가된 비정형 데이터의 분류 측면에서 한계 가 존재한다. 이에 따라, 다양한 데이터를 종합적으로 분석하고 정확히 이해하기 위하여 비지도 학습을 사용하되 데이터들을 사용자가 원하는 분류 체계에 따라 분류할 수 있는 기술이 요구되는 실정이다."}
{"patent_id": "10-2019-0176272", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시의 일 실시예는, 데이터의 범주를 분류하기 위한 컴퓨팅 장치 및 방법을 제공하여 사용자의 의도에 따라 효과적으로 데이터의 범주의 분류를 수행할 수 있도록 한다."}
{"patent_id": "10-2019-0176272", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시예는, 하나 이상의 인스트럭션들을 저장하는 메모리, 및 상기 메모리에 저장된 상기 하나 이 상의 인스트럭션들을 실행하는 적어도 하나의 프로세서를 포함하며, 상기 적어도 하나의 프로세서는, 데이터 범 주(category)의 분류 기준 및 복수의 키워드(keyword)를 포함하는 데이터 범주의 분류 체계를 식별하고, 적어도 하나의 문장을 포함하는 데이터를 획득하고, 뉴럴 네트워크를 이용하여, 상기 데이터 범주의 분류 체계에 기초 하여 상기 데이터의 상기 적어도 하나의 문장에 대한 적어도 하나의 범주를 결정하며, 상기 뉴럴 네트워크는 비 지도 학습에 의한 분류(classification)를 수행하는 컴퓨팅 장치를 제공할 수 있다. 일 실시예에 따른 컴퓨팅 장치에 있어서 상기 적어도 하나의 프로세서는, 상기 데이터 범주의 분류 레벨을 식별 하고, 상기 데이터 범주의 분류 레벨에 기초하여 상기 비정형 데이터의 상기 적어도 하나의 문장에 대한 적어도 하나의 범주를 결정할 수 있다. 일 실시예에 따른 컴퓨팅 장치에 있어서 상기 적어도 하나의 프로세서는, 상기 비정형 데이터의 복수의 문장을 포함하는 적어도 하나의 배치(batch)를 결정하고, 상기 적어도 하나의 배치에 포함된 상기 복수의 문장에 대하 여 반복적으로 예상 범주를 결정하고, 상기 결정된 적어도 하나의 예상 범주에 기초하여, 상기 데이터의 상기 적어도 하나의 문장에 대한 상기 적어도 하나의 범주를 결정할 수 있다. 일 실시예에 따른 컴퓨팅 장치에 있어서 상기 적어도 하나의 프로세서는, 상기 뉴럴 네트워크를 이용하여, 상기 데이터 범주의 분류 체계에 따라 상기 적어도 하나의 문장의 범주를 결정할 수 없다고 판단하고, 상기 판단 결 과에 기초하여, 상기 데이터 범주의 분류 체계를 업데이트하고, 상기 업데이트 된 데이터 범주의 분류 체계에 기초하여, 상기 데이터의 적어도 하나의 문장에 대한 적어도 하나의 범주를 결정할 수 있다. 일 실시예에 따른 컴퓨팅 장치에 있어서 상기 적어도 하나의 프로세서는, 제1 뉴럴 네트워크를 이용하여 상기 데이터의 복수 개의 범주 후보를 결정하고, 제2 뉴럴 네트워크를 이용하여, 상기 데이터의 복수 개의 범주 후보 중 적어도 하나의 범주를 상기 데이터의 상기 적어도 하나의 문장에 대한 적어도 하나의 범주로 결정할 수 있다. 일 실시예에 따른 상기 데이터는 복수의 사용자에 의해 생성된 소셜 미디어 데이터를 포함하고, 상기 데이터 범 주의 분류 체계는 제품 기능에 따른 분류 체계를 포함하고, 컴퓨팅 장치의 적어도 하나의 프로세서는 상기 결정 된 상기 데이터의 상기 적어도 하나의 범주에 기초하여, 상기 복수의 사용자의 요구사항을 획득할 수 있다. 일 실시예에 따른 컴퓨팅 장치에 있어서 상기 적어도 하나의 프로세서는, 상기 획득한 데이터의 전처리 및 문장 분리를 수행한 제1 학습 데이터를 생성하고, 상기 제1 학습 데이터에 기초하여, 문장 별로 단어의 형태적 유사 어 및 의미적 유사어 중 적어도 하나를 포함하는 제2 학습 데이터를 생성하고, 상기 제2 학습 데이터에 기초하 여, 문장 임베딩(sentence embedding)을 수행한 제3 학습 데이터를 생성하고, 상기 제3 학습 데이터에 기초하여, 상기 데이터 범주의 분류 체계에 따라 상기 데이터의 상기 적어도 하나의 문장에 대한 적어도 하나의 범주를 결정할 수 있다. 일 실시예에 따른 컴퓨팅 장치에 있어서 상기 적어도 하나의 프로세서는, 상기 획득한 데이터에 기초하여, 문장 경계 인식에 따라 문장의 분리를 수행하고, 상기 문장의 분리의 수행 결과에 기초하여, 상기 데이터의 불필요한 용어를 제거하여 상기 제1 학습 데이터를 생성할 수 있다.일 실시예에 따른 컴퓨팅 장치에 있어서 상기 적어도 하나의 프로세서는, 상기 데이터 범주의 분류 체계에 기초 하여, 상기 제1 학습 데이터에서 상기 복수의 키워드에 매칭되는 단어를 제외한 단어를 제거한 제1 변형 데이터 를 생성하고, 편집 거리(edit distance) 알고리즘을 이용하여, 상기 제1 변형 데이터의 상기 단어의 형태적 유 사어를 확장한 제2 변형 데이터를 생성하고, 단어 임베딩(word embedding)에 기초하여, 상기 제2 변형 데이터의 상기 단어의 의미적 유사어를 확장한 단어 벡터를 포함하는 상기 제2 학습 데이터를 생성할 수 있다. 일 실시예에 따른 상기 복수의 키워드에 매칭되는 단어는, 상기 복수의 키워드에 포함되는 단어 및 근사 문자열 매칭(approximate string matching) 방법에 기초하여 상기 복수의 키워드와 매칭되는 단어 중 적어도 하나를 포 함할 수 있다. 일 실시예에 따른 컴퓨팅 장치에 있어서 상기 적어도 하나의 프로세서는, 상기 제2 학습 데이터로부터 적어도 하나의 단어 벡터에 대한 평균 가중치를 획득하고, 특이값 분해(Singular Value Decomposition)를 이용하여 상 기 획득된 평균 가중치를 평탄화(smoothing)하고, 상기 평탄화된 평균 가중치를 이용하여 문장 임베딩을 수행한 결과 상기 제3 학습 데이터를 생성할 수 있다. 일 실시예에 따른 상기 적어도 하나의 단어 벡터에 대한 평균 가중치는, 최대 가능도 모수 추정(maximum likelihood estimate)에 기초하여, 상기 적어도 하나의 단어 벡터의 가중치를 이용하여 획득되고, 상기 적어도 하나의 단어 벡터의 가중치는, TF*IDF(Time Frequency-Inverse Document Frequency)를 이용하여 상기 적어도 하나의 단어에 대하여 계산된 가중치일 수 있다. 일 실시예에 따른 컴퓨팅 장치에 있어서 상기 적어도 하나의 프로세서는, 상기 데이터 범주의 분류 체계 중 상 기 제3 학습 데이터와 가장 유사한 중심점(centroid)을 결정하고, 상기 결정된 중심점에 기초하여, 상기 데이터 의 상기 적어도 하나의 문장에 대한 적어도 하나의 범주를 결정할 수 있다. 본 개시의 일 실시예는, 데이터 범주(category)의 분류 기준 및 복수의 키워드(keyword)를 포함하는 데이터 범 주의 분류 체계를 식별하는 동작, 적어도 하나의 문장을 포함하는 데이터를 획득하는 동작, 뉴럴 네트워크를 이 용하여, 상기 데이터 범주의 분류 체계에 기초하여 상기 데이터의 상기 적어도 하나의 문장에 대한 적어도 하나 의 범주를 결정하는 동작을 포함하고, 상기 뉴럴 네트워크는 비지도 학습에 의한 분류(Classification)를 수행 하는, 컴퓨팅 장치의 동작 방법을 제공할 수 있다. 일 실시예에 따른 컴퓨팅 장치의 동작 방법은 상기 뉴럴 네트워크를 이용하여, 상기 데이터 범주의 분류 체계에 따라 상기 적어도 하나의 문장의 범주를 결정할 수 없다고 판단하는 동작, 상기 판단 결과에 기초하여, 상기 데 이터 범주의 분류 체계를 업데이트하는 동작 및 상기 업데이트 된 데이터 범주의 분류 체계에 따라 상기 데이터 의 상기 적어도 하나의 문장에 대한 적어도 하나의 범주를 결정하는 동작을 더 포함할 수 있다. 일 실시예에 따른 컴퓨팅 장치의 동작 방법에서 상기 비정형 데이터는 복수의 사용자에 의해 생성된 소셜 미디 어 데이터를 포함하고, 상기 데이터 범주의 분류 체계는 제품 기능에 따른 분류 체계를 포함하고, 상기 컴퓨팅 장치의 동작 방법은, 상기 결정된 상기 데이터의 상기 적어도 하나의 범주에 기초하여, 상기 복수의 사용자의 요구사항을 획득하는 동작을 더 포함할 수 있다. 일 실시예에 따른 컴퓨팅 장치의 동작 방법에서 상기 적어도 하나의 문장에 대한 적어도 하나의 범주를 결정하 는 동작은, 상기 획득한 데이터의 전처리 및 문장 분리를 수행한 제1 학습 데이터를 생성하는 동작, 상기 제1 학습 데이터에 기초하여, 문장 별로 단어의 형태적 유사어 및 의미적 유사어 중 적어도 하나를 포함하는 제2 학 습 데이터를 생성하는 동작, 상기 제2 학습 데이터에 기초하여, 문장 임베딩(sentence embedding)을 수행한 제3 학습 데이터를 생성하는 동작, 및 상기 제3 학습 데이터에 기초하여, 상기 데이터 범주의 분류 체계에 따라 상 기 데이터의 상기 적어도 하나의 문장에 대한 적어도 하나의 범주를 결정하는 동작을 포함 할 수 있다. 일 실시예에 따른 컴퓨팅 장치의 동작 방법에서 상기 제2 학습 데이터를 생성하는 동작은, 상기 데이터 범주의 분류 체계에 기초하여, 상기 제1 학습 데이터에서 상기 복수의 키워드에 매칭되는 단어를 제외한 단어를 제거한 제1 변형 데이터를 생성하는 동작, 편집 거리(edit distance) 알고리즘을 이용하여, 상기 제1 변형 데이터의 상 기 단어의 형태적 유사어를 확장한 제2 변형 데이터를 생성하는 동작, 및 단어 임베딩(word embedding)에 기초 하여, 상기 제2 변형 데이터의 상기 단어의 의미적 유사어를 확장한 단어 벡터를 포함하는 상기 제2 학습 데이 터를 생성하는 동작을 포함할 수 있다. 일 실시예에 따른 컴퓨팅 장치의 동작 방법에서 상기 복수의 키워드에 매칭되는 단어는, 상기 복수의 키워드에 포함되는 단어 및 근사 문자열 매칭(approximate string matching) 방법에 기초하여 상기 복수의 키워드와 매칭되는 단어 중 적어도 하나를 포함할 수 있다. 일 실시예에 따른 컴퓨팅 장치의 동작 방법에서 상기 제3 학습 데이터를 생성하는 동작은, 상기 제2 학습 데이 터로부터 적어도 하나의 단어 벡터에 대한 평균 가중치를 획득하는 동작, 특이값 분해(Singular Value Decomposition)를 이용하여 상기 획득된 평균 가중치를 평탄화(smoothing)하는 동작 및 상기 평탄화된 평균 가 중치를 이용하여 문장 임베딩을 수행하여 상기 제3 학습 데이터를 생성하는 동작을 포함할 수 있다. 일 실시예에 따른 컴퓨팅 장치의 동작 방법에서 상기 비정형 데이터의 상기 적어도 하나의 문장에 대한 적어도 하나의 범주를 결정하는 동작은, 상기 데이터 범주의 분류 체계 중 상기 제3 학습 데이터와 가장 유사한 중심점 (centroid)을 결정하는 동작 및 상기 결정된 중심점에 기초하여, 상기 데이터의 상기 적어도 하나의 문장에 대 한 적어도 하나의 범주를 결정하는 동작을 포함할 수 있다. 본 개시의 일 실시예는, 본 개시의 일 실시예에 의한 방법을 컴퓨터에서 실행시키도록 컴퓨터로 읽을 수 있는 기록매체에 저장된 프로그램 제품을 포함한다. 본 개시의 일 실시예는, 하나 이상의 프로그램들을 저장하는 컴퓨터로 읽을 수 있는 기록매체로서, 상기 하나 이상의 프로그램들은, 컴퓨팅 장치의 하나 이상의 프로세서에 의해 실행될 때, 상기 컴퓨팅 장치로 하여금: 데 이터 범주(category)의 분류 기준 및 복수의 키워드(keyword)를 포함하는 데이터 범주의 분류 체계를 식별하고, 적어도 하나의 문장을 포함하는 데이터를 획득하고, 뉴럴 네트워크를 이용하여, 상기 데이터 범주의 분류 체계 에 기초하여 상기 데이터의 상기 적어도 하나의 문장에 대한 적어도 하나의 범주를 결정하며, 상기 뉴럴 네트워 크는 비지도 학습에 의한 분류(classification)를 수행하는, 컴퓨터로 읽을 수 있는 기록매체를 포함할 수 있다. 본 개시의 일 실시예는, 본 개시의 일 실시예에서 사용되는 메시지의 데이터 포맷이 기록된 컴퓨터로 읽을 수 있는 기록매체를 포함한다."}
{"patent_id": "10-2019-0176272", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 첨부한 도면을 참조하여 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본 개시의 실시예를 상세히 설명한다. 그러나 본 개시는 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 본 개시에서 설명되는 특정 실행들은 일 실시예일 뿐이며, 어떠 한 방법으로도 본 개시의 범위를 한정하는 것은 아니다. 명세서의 간결함을 위하여, 종래 전자적인 구성들, 제 어 시스템들, 소프트웨어, 및 상기 시스템들의 다른 기능적인 측면들의 기재는 생략될 수 있다. 그리고 도면에서 본 개시를 명확하게 설명하기 위해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통 하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 도면에 도시된 구성 요소들 간의 연결 선 또는 연결 부재들은 기능적인 연결 및/또는 물리적 또는 회로적 연결들을 예시적으로 나타낸 것일 뿐이다. 실제 장치에서 는 대체 가능하거나 추가된 다양한 기능적인 연결, 물리적인 연결, 또는 회로 연결들에 의해 구성 요소들 간의 연결이 구현될 수 있다. 본 개시에서 사용되는 용어는 본 개시에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수 있 다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 개시의 설명 부분에서 상세 히 그 의미를 기재할 것이다. 따라서 본 개시에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가지 는 의미와 본 개시의 전반에 걸친 내용을 토대로 정의되어야 한다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수개의 표현을 포함한다. \"포함하다\" 또는 \"가지다\" 등의 용어는 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 특히, 숫자들은 이해를 돕기 위한 예로서, 기재된 숫자들에 의해 실시예들이 한정되는 것으로 이해되지 말아야 한다. 또한, 제1, 제2 등의 용어는 다양한 구성요소들을 설명하는 데 사용될 수 있지만, 구성요소들은 이 용어들에 의 해 한정되어서는 안 된다. 이 용어들은 하나의 구성요소를 다른 구성 요소로부터 구별하는 목적으로 사용된다. 본 개시에서 다양한 곳에 등장하는 \"일 실시예에서\" 등의 어구는 반드시 모두 동일한 실시예를 가리키는 것은 아니다. 또한, 본 개시에서, \"a, b 또는 c 중 적어도 하나를 포함한다\"는 \"a만 포함하거나, b만 포함하거나, c 만 포함하거나, a 및 b를 포함하거나, b 및 c를 포함하거나, a 및 c를 포함하거나, a, b 및 c를 모두 포함하는 것을 의미할 수 있다. 본 개시의 일 실시예는 기능적인 블록 구성들 및 다양한 처리 단계들로 나타내어질 수 있다. 이러한 기능 블록 들의 일부 또는 전부는, 특정 기능들을 실행하는 다양한 개수의 하드웨어 및/또는 소프트웨어 구성들로 구현될 수 있다. 예를 들어, 본 개시의 기능 블록들은 하나 이상의 마이크로프로세서들에 의해 구현되거나, 소정의 기 능을 위한 회로 구성들에 의해 구현될 수 있다. 또한, 예를 들어, 본 개시의 기능 블록들은 다양한 프로그래밍 또는 스크립팅 언어로 구현될 수 있다. 기능 블록들은 하나 이상의 프로세서들에서 실행되는 알고리즘으로 구 현될 수 있다. 또한, 본 개시는 전자적인 환경 설정, 신호 처리, 및/또는 데이터 처리 등을 위하여 종래 기술 을 채용할 수 있다. 본 개시를 설명함에 있어서, 관련된 공지 기능 또는 구성요소에 대한 구체적인 설명이 본 개시의 요지를 불필요 하게 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략할 것이다. 설명의 편의를 위하여 필요한 경우에는 장치와 방법을 함께 서술하도록 한다. 본 개시에 따른 인공지능과 관련된 기능은 프로세서와 메모리를 통해 동작된다. 프로세서는 하나 또는 복수의 프로세서로 구성될 수 있다. 이때, 하나 또는 복수의 프로세서는 CPU, AP, DSP(Digital Signal Processor) 등 과 같은 범용 프로세서, GPU, VPU(Vision Processing Unit)와 같은 그래픽 전용 프로세서 또는 NPU와 같은 인 공지능 전용 프로세서일 수 있다. 하나 또는 복수의 프로세서는, 메모리에 저장된 기 정의된 동작 규칙 또는 인 공지능 모델에 따라, 입력 데이터를 처리하도록 제어한다. 또는, 하나 또는 복수의 프로세서가 인공지능 전용 프로세서인 경우, 인공지능 전용 프로세서는, 특정 인공지능 모델의 처리에 특화된 하드웨어 구조로 설계될 수 있다. 기 정의된 동작 규칙 또는 인공지능 모델은 학습을 통해 만들어진 것을 특징으로 한다. 여기서, 학습을 통해 만 들어진다는 것은, 기본 인공지능 모델이 학습 알고리즘에 의하여 다수의 학습 데이터들을 이용하여 학습됨으로 써, 원하는 특성(또는, 목적)을 수행하도록 설정된 기 정의된 동작 규칙 또는 인공지능 모델이 만들어짐을 의미 한다. 이러한 학습은 본 개시에 따른 인공지능이 수행되는 기기 자체에서 이루어질 수도 있고, 별도의 서버 및/ 또는 시스템을 통해 이루어 질 수도 있다. 학습 알고리즘의 예로는, 지도형 학습(supervised learning), 비지도 형 학습(unsupervised learning), 준지도형 학습(semi-supervised learning) 또는 강화 학습(reinforcement learning)이 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은, 복수의 신경망 레이어들로 구성될 수 있다. 복수의 신경망 레이어들 각각은 복수의 가중치들 (weight values)을 갖고 있으며, 이전(previous) 레이어의 연산 결과와 복수의 가중치들 간의 연산을 통해 신경 망 연산을 수행한다. 복수의 신경망 레이어들이 갖고 있는 복수의 가중치들은 인공지능 모델의 학습 결과에 의해 최적화될 수 있다. 예를 들어, 학습 과정 동안 인공지능 모델에서 획득한 로스(loss) 값 또는 코스트(cost) 값이 감소 또는 최소화되도록 복수의 가중치들이 갱신될 수 있다. 인공 신경망은 심층 신경망(DNN:Deep Neural Network)를 포함할 수 있으며, 예를 들어, CNN (Convolutional Neural Network), DNN (Deep Neural Network), RNN (Recurrent Neural Network), RBM (Restricted Boltzmann Machine), DBN (Deep Belief Network), BRDNN(Bidirectional Recurrent Deep Neural Network) 또는 심층 Q-네트워크 (Deep Q-Networks) 등이 있으나, 전술한 예에 한정되지 않는다. 이하 첨부된 도면을 참고하여 본 개시를 상세히 설명하기로 한다. 도 1은 본 개시의 일 실시예에 의한 데이터의 범주의 분류 체계에 기초하여 데이터를 분류하는 방법을 개략적으 로 도시한 도면이다. 도 1을 참조하면, 컴퓨팅 장치는 데이터 및 데이터 범주(category)의 분류 체계에 기초하여, 데이터 의 적어도 하나의 범주를 결정할 수 있다. 일 실시예에서, 데이터 범주의 분류 체계는 데이터 범주의 분류 기준 및 복수의 키워드(keyword)를 포함할 수 있다. 복수의 키워드는 사용자가 데이터의 범주를 결정 할 때 컴퓨팅 장치에게 분류 기준에 대한 가이드를 제시하기 위한 소량의 키워드만을 포함할 수 있다. 데이터는 정형 데이터뿐만 아니라 비정형 데이터를 포함할 수 있다. 일 실시예에 따르면, 컴퓨팅 장치는 데이터 범류의 분류 체계에 기초하여, 비지도 학습을 수행하는 뉴럴 네트워크를 이용하여 비정형 데이터를 분류함에 있어 서 사용자가 원하는 기준으로 비정형 데이터를 분류할 수 있다. 데이터의 범주의 분류 체계에 기초하여 데이터를 분류하는 방법의 동작 110에서, 컴퓨팅 장치는 데이터에 포함된 적어도 하나의 문장에 대하여 텍스트 전처리(text preprocessing) 과정을 수행하고 데이터에 포함 된 적어도 하나의 문장을 분리할 수 있다. 일 실시예에서, 텍스트 전처리 과정은 용도 또는 사용자의 의도에 적 합하게 텍스트를 사전에 처리하는 작업으로서 토큰화(tokenization), 정제(cleaning), 정규화(normalization), 어간 추출(stemming), 표제어 추출(lemmatization), 불용어(stopword) 제거, 정규 표현식(regular expression) 텍스트 전처리, 정수 인코딩(integer encoding), 원-핫 인코딩(one-hot encoding), 단어 분리(subword segmentation) 등을 수행할 수 있으나, 이에 한정되는 것은 아니다. 데이터의 범주의 분류 체계에 기초하여 데이터를 분류하는 방법의 동작 130에서, 컴퓨팅 장치는 데이터에 포함된 적어도 하나의 문장에 대하여 문장별로 단어의 의미적 연관어들을 이용하여 문장을 변형할 수 있다. 일 실시예에서, 컴퓨팅 장치는 데이터 범주의 분류 체계에 기초하여 문장 내 존재하는 의미 없는 단어들을 제 거하는 필터링 과정을 수행할 수 있다. 또한, 컴퓨팅 장치는 편집 거리(edit distance)에 기초하여 필터링 후 남은 단어를 어휘적 측면에서 확장하고, 워드 임베딩(word embedding) 모델에 기초하여 단어를 의미적 측면에서 확장함으로써 문장의 변형을 수행할 수 있다. 일 실시예에서, 컴퓨팅 장치는 필터링 후 남은 단어를 어휘적 측 면 및 의미적 측면에서 확장한 후 단어 벡터를 생성할 수 있다. 예를 들어, 사용자가 제품의 기능 단위로 데이 터 범주의 분류 체계를 결정하는 경우 컴퓨팅 장치는 데이터로서 \"갤럭시 폴드는 이전에 문제가 있었던 전 면의 필름 그리고 힌지 부분을 수정해 보완 했으며 실제 사용해보면 상당히 완성도가 좋은데 가격이 꽤 부담스 럽다는 단점이 있습니다. 그래서 현재 대중적인 스마트폰이 되기는 어렵지만 얼리어댑터들에게 꽤 인기가 있을 것 같습니다.\"의 문장들을 획득할 수 있다. 컴퓨팅 장치는 문장 내 존재하는 의미 없는 단어들을 제거하는 필터 링 과정을 수행하고 \"갤럭시 폴드\", \"필름\", \"힌지\", \"스마트폰\", \"얼리어댑터\" 등의 단어만 남길 수 있다. 또 한, 컴퓨팅 장치는 필터링 후 남겨진 단어들을 형태적 및/또는 의미적 단어들로 확장하여 갤럭시 폴드, 갤럭시, 폴더블, 폴더블폰, 필름, film, 시트, 힌지, 히인지, 경첩, 스마트폰, 폰, 휴대폰, 핸드폰, 단말, 얼리어댑터, 유행 등의 단어를 생성할 수 있다. 컴퓨팅 장치는 생성한 단어들을 각각 벡터화시켜 각 단어들에 대응되는 단어 벡터들을 생성할 수 있다. 일 실시예에 따르면, 데이터 범주의 분류 체계 내의 키워드(keyword)에 기초하여 데이터의 분류에 필요한 단어를 추출함으로써 사용자에 의도에 적합하게 데이터를 분류할 수 있고, 짧은 길이의 문장이더라도 편집 거리, 워드 임베딩 등의 기법을 사용하여 단어를 확장함으로써, 미세한 분류, 대규모 범주에 따른 분류 등을 가 능하게 할 수 있다. 일 실시예에서, 컴퓨팅 장치는 데이터의 범주를 결정할 수 없는 경우 또는 데이터 범주의 분류 체계 에 기초하여 사용자가 원하는 범주로 결정할 수 없는 경우, 데이터 범주의 분류 체계를 업데이트할 수 있 다. 예를 들어, 컴퓨팅 장치는 비정형 데이터의 범주를 결정할 수 없다는 메시지를 출력하고, 사용자로부 터 새로운 분류 기준, 키워드 등을 입력 받음으로써 데이터 범주의 분류 체계를 업데이트할 수 있다. 일 실시예에 따르면, 사용자가 언제든지 사용 목적에 맞게 데이터 범주의 분류 체계를 추가 또는 수정할 수있기 때문에 원치 않는 체계로 분류되는 기존의 비지도 학습 기반의 군집화(clustering)의 문제점을 해결할 수 있고, 대규모 범주일 수록 분류 정확도가 떨어지는 지도 학습 기반의 분류(classification)의 문제점을 해결할 수 있다. 데이터의 범주의 분류 체계에 기초하여 비정형 데이터를 분류하는 방법의 동작 150에서, 컴퓨팅 장치는 범주 별 문장 임베딩(sentence embedding)을 수행할 수 있다. 일 실시예에서, 컴퓨팅 장치는 동작 130의 수행 결과 얻어 진 단어 벡터들의 평균 가중치를 활용해서 각 문장의 문장 벡터를 결정할 수 있다. 또한, 컴퓨팅 장치는 특이값 분해(Singular Value Decomposition, SVD)를 이용하여 문장 벡터를 평탄화(smoothing)하고, 평탄화된 문장 벡 터를 이용하여 문장 임베딩을 수행할 수 있다. 데이터의 범주의 분류 체계에 기초하여 비정형 데이터를 분류하는 방법의 동작 170에서, 컴퓨팅 장치는 입력 받 은 새로운 문장 또는 데이터의 범주를 예측할 수 있다. 일 실시예에서, 컴퓨팅 장치는 새로운 문장 또는 데이터 에 대해 문장 임베딩을 수행하고, 각 범주 별 중심점(centroid)과의 유사도에 기초하여, 새로운 문장 또는 데이 터의 범주를 예측할 수 있다. 일 실시예에 따르면, 컴퓨팅 장치는 새로운 데이터의 범주를 결정할 때, 새로운 데이터의 각 문장에 대해 문장 임베딩을 수행하여 적어도 하나의 범주를 결정하면 되기 때문에 새로운 범주와 새로운 비정형 데이터가 추가될 때마다 대량의 학습 데이터가 필요하던 기존의 지도 학습 기반의 분류 방법의 문제점을 해결할 수 있다. 또한, 일 실시예에 따르면, 컴퓨팅 장치는 각 범주 별 중심점을 기준으로 비정형 데 이터의 범주를 예측하기 때문에 비선형 방식의 복잡성 및 over-fitting의 문제점을 극복할 수 있다. 도 2는 본 개시의 일 실시예에 의한 데이터의 범주를 분류하는 방법을 나타낸 흐름도이다. 도 2를 참조하면, 동작 210에서, 컴퓨팅 장치는 데이터 범주의 분류 체계를 식별할 수 있다. 일 실시예에서, 데 이터 범주의 분류 체계는 데이터 범주의 분류 기준, 복수의 키워드, 데이터 범주의 분류 레벨 등을 포함할 수 있으나, 이에 한정되는 것은 아니다. 예를 들어, 컴퓨팅 장치의 사용자는 분류 기준을 제품의 기능으로 설정하 고, 복수의 키워드에 TV, 라디오, 램프, 침대, 휴대폰 등을 입력할 수 있다. 이에 따라, 컴퓨팅 장치는 분류 기 준 및 복수의 키워드를 포함하는 데이터 범주의 분류 체계를 식별할 수 있다. 또한, 컴퓨팅 장치의 사용자는 데 이터 범주의 분류 레벨을 상, 중 또는 하로 설정할 수 있다. 이에 따라, 컴퓨팅 장치는 데이터 범주의 분류 레 벨을 식별하고, 데이터의 범주를 대범주, 중범주, 또는 소범주 중 적어도 하나로 결정할 수 있다. 동작 230에서, 컴퓨팅 장치는 적어도 하나의 문장을 포함하는 데이터를 획득할 수 있다. 일 실시예에서, 데이터 는 비정형 데이터를 포함할 수 있다. 비정형 데이터는 미리 정의된 데이터 모델이 없거나 미리 정의된 방식으로 정리되지 않은 정보를 의미할 수 있다. 예를 들어, 비정형 데이터는 복수의 사용자에 의해 생성된 소셜 미디어 데이터, 책, 잡지, 문서의료기록, 음성 정보, 논문 등을 포함할 수 있으나, 이에 한정되는 것은 아니다. 동작 250에서, 컴퓨팅 장치는 뉴럴 네트워크를 이용하여, 데이터 범주의 분류 체계에 따라 데이터의 적어도 하 나의 문장에 대한 적어도 하나의 범주를 결정할 수 있다. 일 실시예에서, 컴퓨팅 장치는 뉴럴 네트워크를 이용 하여, 동작 210에서 식별한 데이터 범주의 분류 체계에 따라 사용자가 원하는 분류에 기반하여 동작 230에서 획 득한 데이터의 적어도 하나의 문장에 대한 적어도 하나의 범주를 결정할 수 있다. 다른 일 실시예에서, 컴퓨팅 장치는 제1 뉴럴 네트워크를 이용하여 데이터의 복수 개의 범주 후보를 결정하고, 제2 뉴럴 네트워크를 이용하 여 복수 개의 범주 후보 중 적어도 하나의 범주를 데이터의 적어도 하나의 문장에 대한 적어도 하나의 범주로 결정할 수 있다. 예를 들어, 데이터가 복수의 사용자에 의해 생성된 소셜 미디어(social media) 데이터를 포함 하고, 데이터 범주의 분류 체계가 제품 기능에 따른 분류 체계를 포함하는 경우, 컴퓨팅 장치는 뉴럴 네트워크 를 이용하여 소셜 미디어 데이터로부터 복수의 사용자의 요구사항을 획득할 수 있다. 일 실시예에서, 컴퓨팅 장치는 뉴럴 네트워크를 이용하여 식별된 데이터 범주의 분류 체계에 따라 데이터의 적 어도 하나의 문장의 범주를 결정할 수 없다고 판단할 수 있다. 컴퓨팅 장치는 적어도 하나의 문장의 범주를 결 정할 수 없다고 판단한 결과에 기초하여, 데이터 범주의 분류 체계를 업데이트할 수 있다. 또한, 컴퓨팅 장치는 업데이트 된 데이터 범주의 분류 체계에 따라 데이터의 적어도 하나의 문장에 대한 적어도 하나의 범주를 결정 할 수 있다. 일 실시예에서, 컴퓨팅 장치는 제1 뉴럴 네트워크를 이용하여 데이터의 복수 개의 범주 후보를 결정하고, 제2 뉴럴 네트워크를 이용하여, 데이터의 복수 개의 범주 후보 중 적어도 하나의 범주를 데이터의 적어도 하나의 문 장에 대한 적어도 하나의 범주로 결정할 수 있다. 일 실시예에서, 데이터는 복수의 사용자에 의해 생성된 소셜 미디어 데이터를 포함하고, 데이터 범주의 분류 체 계는 제품 기능에 따른 분류 체계를 포함하고, 컴퓨팅 장치는 결정된 적어도 하나의 범주에 기초하여, 복수의사용자의 요구사항을 획득할 수 있다. 일 실시예에서, 컴퓨팅 장치는 획득한 데이터의 전처리 및 문장 분리를 수행한 제1 학습 데이터를 생성하고, 제 1 학습 데이터에 기초하여, 문장 별로 단어의 형태적 유사어 및 의미적 유사어 중 적어도 하나를 포함하는 제2 학습 데이터를 생성하고, 제2 학습 데이터에 기초하여, 문장 임베딩(sentence embedding)을 수행한 제3 학습 데 이터를 생성하고, 제3 학습 데이터에 기초하여, 데이터 범주의 분류 체계에 따라 데이터의 적어도 하나의 문장 에 대한 적어도 하나의 범주를 결정할 수 있다. 일 실시예에서, 컴퓨팅 장치는 획득한 데이터에 기초하여, 문장 경계 인식에 따라 문장의 분리를 수행하고, 문 장의 분리의 수행 결과에 기초하여 데이터의 불필요한 용어를 제거하여 제1 학습 데이터를 생성할 수 있다. 일 실시예에서, 컴퓨팅 장치는 데이터 범주의 분류 체계에 기초하여, 제1 학습 데이터에서 복수의 키워드에 매 칭되는 단어를 제외한 단어를 제거한 제1 변형 데이터를 생성하고, 편집 거리(edit distance) 알고리즘을 이용 하여, 제1 변형 데이터의 단어의 형태적 유사어를 확장한 제2 변형 데이터를 생성하고, 단어 임베딩(word embedding)에 기초하여, 제2 변형 데이터의 단어 의미적 유사어를 확장한 단어 벡터를 포함하는 제2 학습 데이 터를 생성할 수 있다. 일 실시예에서, 복수의 키워드에 매칭되는 단어는, 복수의 키워드에 포함되는 단어, 근사 문자열 매칭 (approximate string matching) 방법을 이용하여 복수의 키워드와 매칭되는 단어 등을 포함할 수 있다. 일 실시예에서, 컴퓨팅 장치는 제2 학습 데이터로부터 적어도 하나의 단어 벡터에 대한 평균 가중치를 획득하고, 특이값 분해(Singular Value Decomposition)를 이용하여 획득된 평균 가중치를 평탄화(smoothing)하 고, 평탄화된 평균 가중치를 이용하여 문장 임베딩을 수행한 결과 제3 학습 데이터를 생성할 수 있다. 일 실시예에서, 적어도 하나의 단어 벡터에 대한 평균 가중치는, 최대 가능도 모수 추정(maximum likelihood estimate)에 기초하여, 적어도 하나의 단어 벡터의 가중치를 이용하여 획득되고, 적어도 하나의 단어 벡터의 가 중치는 TF*IDF(Time Frequency-Inverse Document Frequency)를 이용하여 적어도 하나의 단어에 대하여 계산된 가중치일 수 있다. 일 실시예에서, 컴퓨팅 장치는 데이터 범주의 분류 체계 중 제3 학습 데이터와 가장 유사한 중심점(centroid)을 결정하고, 결정된 중심점에 기초하여, 데이터의 적어도 하나의 문장에 대한 적어도 하나의 범주를 결정할 수 있 다. 도 3은 본 개시의 일 실시예에 의한 비지도 학습에 따라 데이터를 분류하는 방법을 도시한 도면이다. 도 3을 참조하면, 컴퓨팅 장치는 기 구축된 사전을 이용하여 데이터의 적어도 하나의 범주를 결정할 수 있다. 일 실시예에서, 기 구축된 사전은 데이터 범주의 분류 기준, 복수의 키워드 등을 포함할 수 있으 나, 이에 한정되는 것은 아니다. 일 실시예에 따르면, 컴퓨팅 장치는 소량의 복수의 키워드를 이용하여 비지도 학습에 의한 분류를 수행함으로써 대량의 정답 라벨(label)을 필요로 하는 지도 학습의 확장성에 관한 한계를 극복할 수 있다. 일 실시예에서, 기 구축된 사전은 도 1을 참조하여 전술한 데이터 범주의 분류 체계(10 3)와 대응될 수 있다. 동작 310에서, 컴퓨팅 장치는 텍스트 전처리 과정 및 문장 분리 과정을 수행할 수 있다. 일 실시예에서, 텍스트 전처리 과정은 용도에 맞게 텍스트를 사전에 처리하는 작업으로서, 토큰화(tokenization), 정제(cleaning), 정 규화(normalization), 어간 추출(stemming), 표제어 추출(lemmatization), 불용어(stopword) 제거, 정규 표현 식(regular expression) 텍스트 전처리, 정수 인코딩(integer encoding), 원-핫 인코딩(one-hot encoding), 단 어 분리(Subword Segmentation) 등을 수행할 수 있으나, 이에 한정되는 것은 아니다. 또한, 문장 분리 과정은 컴퓨팅 장치가 머신 러닝을 이용하여 문장의 경계를 인식함으로써 데이터에 포함된 적어도 하나의 문장을 분리하는 과정일 수 있다. 동작 330에서, 컴퓨팅 장치는 동작 310에서 분리된 문장 별로 문장을 구성하는 의미적 단어의 연관어의 확장을 통한 문장의 변형을 수행할 수 있다. 일 실시예에서, 컴퓨팅 장치는 동작 310에서 분리된 문장 별로 기 구축된 사전에 기초하여 각 문장을 구성하는 단어들을 유니 그램(uni-gram)이나 바이 그램(bi-gram)으로 토큰화한 후 토큰화된 단어들을 필터링할 수 있다. 일 실시예에 따르면, 컴퓨팅 장치는 각 문장을 구성하는 단어들을 uni-gram이나 bi-gram으로 토큰화함으로써, 각 문장의 문맥을 용이하게 파악할 수 있다. 예를 들어, 컴퓨팅 장치는 기 구축된 사전에 포함된 단어를 제외한 단어를 문장에서 제거할 수 있다. 다른 예를 들어, 컴퓨팅 장치는 기 구축된 사전에 포함된 단어, 기 구축된 사전에 포함된 단어와 유사한단어 등에 포함되지 않는 단어를 문장에서 제거할 수 있다. 기 구축된 사전에 포함된 단어와 유사한 단어 는 기 구축된 사전에 포함된 단어와 어휘적으로 유사한 단어, 의미적으로 유사한 단어 등을 포함할 수 있 으나, 이에 한정되는 것은 아니다. 일 실시예에서, 기 구축된 사전에 포함된 단어와 유사한 단어는 편집 거리(edit distance) 기법, 단어 임베딩(word embedding) 모델, approximate string matching 기법 등을 이용 하여 결정될 수 있다. 일 실시예에 따르면, 기 구축된 사전에 포함된 단어뿐만 아니라 기 구축된 사전 에 포함된 단어와 유사한 단어까지 제거하지 않고 남김으로써 컴퓨팅 장치는 비정형 데이터의 범주에 관한 분류에 있어서의 정확도를 향상시킬 수 있다. 일 실시예에서, 컴퓨팅 장치는 필터링 후 남은 단어들을 대상으로 워드 임베딩 모델에 매칭함으로써 남은 단어 들 및 유사한 단어들로 구성된 변형된 문장을 생성할 수 있다. 동작 330은 다음과 같은 [표 1]에 따라 수행될 수 있다. [표 1]"}
{"patent_id": "10-2019-0176272", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "일 실시예에서, 컴퓨팅 장치는 데이터를 구성하는 모든 문장을 입력으로 하여 변환된 문장들을 생성할 수 있다. 예를 들어, 데이터는 비정형 데이터로서, 주제 및 형태가 다양한 소셜 미디어 데이터일 수 있으나, 이에 한정되 는 것은 아니다. 컴퓨팅 장치는 데이터에 포함된 적어도 하나의 문장의 각 문장마다 uni-gram 또는 bi-gram을 이용하여 토큰화시킬 수 있다. 토큰화된 각 토큰이 기 구축된 사전에 매칭되지 않는 경우, 매칭되지 않는 토큰을 필터링할 수 있다. 일 실시예에서, 근사 문자열 매칭(approximate string matching) 기법이 적용되는 경 우, 컴퓨팅 기 구축된 사전에 포함된 키워드뿐만 아니라 기 구축된 사전에 포함된 키워드와 근사하게 매칭되는 유사 토큰을 필터링하지 않고 남길 수 있다. 또한, 컴퓨팅 장치는 남은 토큰들을 대상으로 워드 임베 딩 모델에 매칭하여, 남은 토큰들과 함께 가장 유사한 N개의 단어들로 변형된 문장(cs)들을 생성할 수 있다. 예 를 들어, 워드 임베딩 모델은 word2vec(word to vector) 모델, GloVe(Global vectors for word representation) 모델, Customized word embedding 모델 등을 포함할 수 있으나, 이에 한정되는 것은 아니다. 일 실시예에 따르면, 변형된 문장은 편집 거리 기법, 워드 임베딩 모델 등을 이용하여 기 구축된 사전보다 확장된 분류를 획득할 수 있다. 예를 들어, 워드 임베딩 모델로 GloVe를 이용한 경우, 다음과 같이 [표 2]의 결 과가 획득될 수 있다.[표 2]"}
{"patent_id": "10-2019-0176272", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "예를 들어, \"be good deal?\"의 문장을 입력받은 경우, 컴퓨팅 장치는 변형된 문장으로 \"Is this a good dea l?\"의 문장을 획득하고, 출력 라벨(label)로 deal을 획득할 수 있다. 다른 예를 들어, 컴퓨팅 장치가 word2vec 에 의한 확장을 이용하는 경우에, \"there be / dev/video device, which theory could be tv tuner , but they be usually just front and rear face camera video mode.\"의 문장을 입력받은 경우, 변형된 문장으로 \"There ARE /dev/video devices, which in theory could be TV tuners, but they are usually just for the front and rear facing cameras in video mode.\"의 문장을 획득하고, 출력 라벨로 Tuner 및 Camera를 획득할 수 있다. 또 다른 예를 들어, 컴퓨팅 장치가 Word2vec Edit distance에 의한 확장을 이용하는 경우에, \"but I also want good array input and output - ideal input : 3 hdmi , 1 component , 1 composite , 1 VGA pc connection , 1 rca audio input , ideal output : Digital audio out , rca audio out , and HDMI ARC.\"의 문장을 입력받은 경우, \"But I also want a good array of inputs and outputs - IDEAL INPUTS: 3 HDMI, 1 component, 1 composite, 1 VGA for a PC connection, 1 RCA audio input, IDEAL OUTPUTS: Digital audio out, RCA audio out, and HDMI ARC.\"의 문장을 획득하고, 출력 라벨로 HDMI, Parts 및 Audio을 획득할 수 있다. 동작 350에서, 컴퓨팅 장치는 범주 별 문장 임베딩을 수행할 수 있다. 일 실시예에서, 컴퓨팅 장치는 동작 330 에서 획득된 변형된 문장을 구성하는 각 단어들의 평균 가중치를 계산하여 변형된 문장 별로 평균 가중치 값을 획득할 수 있다. 또한, 컴퓨팅 장치는 특이값 분해(Singular Value Decomposition, SVD)를 이용하여 평균 가중 치의 평탄화를 수행하고, 평탄화된 평균 가중치를 이용하여 변형된 문장들의 문장 벡터를 생성할 수 있다. 컴퓨 팅 장치는 생성한 문장 벡터를 이용하여 범주 별 중심점(centroid)을 계산할 수 있다. 일 실시예에서, 중심점은 [표 3]에 따라 획득될 수 있다.[표 3]"}
{"patent_id": "10-2019-0176272", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "일 실시예에서, 컴퓨팅 장치는 동작 330의 수행 결과 획득된 변환된 문장들, 전체 문헌 집단의 어휘에 존재하는 단어(w)의 단어 벡터, 파라미터 , 전체 문헌 집단에서의 바이그램(bigram) 단어의 확률 등을 입력 으로 하여 문장 임베딩 결과 각 범주에 대한 중심점(centroid)을 획득할 수 있다. 컴퓨팅 장치는 변환된 문장들 각각에 대하여 최대 가능도 모수 추정(maximum likelihood estimate)을 이용하여 문장 벡터 를 결정할 수 있다. 즉, 컴퓨팅 장치는 문장의 핵심 주제를 표현하는 벡터에 대하여 가장 가능성이 높은 모수를 찾음으로써, 문장 벡터 를 획득할 수 있다. 이 경우, 문장 벡터 를 계산하기 위해 필요한 단어 벡터 는 TF*IDF 공식으로 산출된 가중치 값일 수 있다. 일 실시예에서, TF*IDF는 단어 빈도수(term frequency)에 역문헌 빈도수(inverse document frequency)를 곱한 단어의 가중치 값으로 다음과 같은 [수학식 1]에 의해 계산될 수 있다. [수학식 1]"}
{"patent_id": "10-2019-0176272", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "여기서, f(t,d)는 문서 d 내에서 단어 t의 총 빈도를 나타낸다. 문장의 핵심 주제를 표현하는 벡터와 단어 벡터 간의 내적값은 문장의 핵심 주제를 표현하는 벡터와 단어 벡터 간의 상관성을 나타낼 수 있다. 이에 따라, 최대 가능도 모수 추정은 각 문장을 구성하고 있는 단어 벡터들의 가중치의 평균값을 의미할 수 있다. 일 실시예에 따르면, 컴퓨팅 장치는 최대 가능도 모수 추정을 이용함으로써 자주 등장하는 단어일 수록 가중치를 낮게 설정할 수 있고, 이에 따라 일반적인 단어의 중요도를 감소시켜 복수 의 키워드에 매칭되는 단어들의 가중치를 증가시킬 수 있다. 즉, 컴퓨팅 장치는 일반적인 단어가 아닌 데이터의 범주를 결정하기 위해 필요한 단어들의 가중치를 높게 결정함으로써 데이터의 범주를 결정하기 위한 정확도를 향상시킬 수 있다. 컴퓨팅 장치는 문장의 핵심 주제를 표현하는 벡터를 추정하기 위하여 각 문장에 대하여 문장 의 핵심 주제를 표현하는 벡터의 최초 주성분(first principal component)을 계산함으로써 문장의 핵심 주제를 표현하는 벡터의 방향을 추정할 수 있다. 즉, 컴퓨팅 장치는 문장의 핵심 주제를 표현하는 벡터의 프로젝션 (projection)으로부터 해당 벡터의 최초 주성분을 뺌으로써 문장 벡터 를 결정하여 문장 임베딩을 수행할수 있다. 이에 따라, 컴퓨팅 장치는 문장 임베딩 결과에 기초하여, i 번째 범주( )에 속하는 모든 문장으로 부터 해당 범주의 중심점(centroid)을 결정할 수 있다. 동작 370에서, 컴퓨팅 장치는 입력받은 문장 또는 입력 데이터 등의 범주를 예측할 수 있다. 일 실시예에서, 컴 퓨팅 장치는 동작 310, 330, 및 350을 수행하여 문장 임베딩 결과를 생성한 후, 입력받은 문장 또는 입력 데이 터와 가장 유사한 중심점이 무엇인지 결정할 수 있다. 또한, 컴퓨팅 장치는 가장 유사한 중심점에 기초하여 가 장 유사한 중심점에 대응하는 범주를 예측 범주로 결정할 수 있다. 일 실시예에서, 컴퓨팅 장치는 보다 정확한 범주의 예측을 위해 반복 예측을 수행하는 batch prediction을 수행할 수 있다. 또한, 컴퓨팅 장치는 입력 데이 터의 각 문장 당 예측되는 범주와 범주의 후보들을 결정할 수 있다. 예를 들어, 입력 문장에 따른 예측되는 범 주 및 범주의 후보는 [표 4]와 같을 수 있다. [표 4]"}
{"patent_id": "10-2019-0176272", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "일 실시예에서, 동작 310, 330 및 350은 뉴럴 네트워크의 학습을 위한 동작이고, 동작 370은 학습된 뉴럴 네트 워크를 이용하여 입력받은 데이터의 범주를 예측하는 인공지능 모델을 이용하여 범주를 결정하는 활용 동작일 수 있다. 도 4는 본 개시의 일 실시예에 의한 데이터의 적어도 하나의 범주를 결정하는 방법을 나타낸 흐름도이다. 도 4를 참조하면, 동작 410에서, 컴퓨팅 장치는 문장 경계 인식 방법을 이용하여 데이터를 구성하는 각 문장을 분리할 수 있다. 일 실시예에서, 컴퓨팅 장치는 데이터를 입력으로서 수신하고, 데이터에 포함된 텍스트를 문장 단위로 구분함으로써 각 문장을 분리할 수 있다. 동작 420에서, 컴퓨팅 장치는 문장이 분리된 데이터의 불필요한 용어를 제거하여 제1 학습 데이터를 생성할 수 있다. 예를 들어, 불필요한 용어는 유의미한 의미가 없는 불용어(stopword)를 포함할 수 있다. 이에 따라, 컴퓨 팅 장치는 데이터의 불용어를 제거한 제1 학습 데이터를 생성할 수 있다. 동작 430에서, 컴퓨팅 장치는 제1 학습 데이터로부터 복수의 키워드에 매칭되지 않는 단어를 제거한 제1 변형 데이터를 생성할 수 있다. 일 실시예에서, 복수의 키워드는 컴퓨팅 사용자에 의해 사전에 정의될 수 있다. 컴퓨 팅 장치는 복수의 키워드에 해당하거나 복수의 키워드와 유사한 단어를 제외한 단어들을 제거하는 필터링 과정 을 수행할 수 있다. 예를 들어, 복수의 키워드와 유사한 단어는 복수의 키워드와 형태적으로 유사한 단어나 의 미적으로 유사한 단어를 포함할 수 있다. 동작 440에서, 컴퓨팅 장치는 편집 거리 알고리즘을 이용하여, 제1 변형 데이터의 단어 형태에 관한 단어군을 확장한 제2 변형 데이터를 생성할 수 있다. 일 실시예에서, 편집 거리 알고리즘은 두 문자열의 유사도를 판단하 는 알고리즘으로서, 컴퓨팅 장치는 편집 거리 알고리즘을 이용하여 제1 변형 데이터의 형태적으로 유사한 단어군을 확장한 제2 변형 데이터를 획득할 수 있다. 동작 450에서, 컴퓨팅 장치는 워드 임베딩에 기초하여, 제2 변형 데이터의 단어의 의미에 관한 단어군을 확장한 단어 벡터를 포함하는 제2 학습 데이터를 생성할 수 있다. 일 실시예에서, 워드 임베딩은 단어들을 다차원 벡터 공간 상에 각각의 차원이 실수 값을 갖는 다차원 벡터 형태로 나타내는 것으로서, 컴퓨팅 장치는 워드 임베딩에 기초하여, 제2 변형 데이터의 의미적으로 유사한 단어군을 확장한 제2 학습 데이터를 획득할 수 있다. 동작 460에서, 컴퓨팅 장치는 제2 학습 데이터로부터 적어도 하나의 단어 벡터에 대한 평균 가중치를 획득할 수 있다. 일 실시예에서, 컴퓨팅 장치는 제2 학습 데이터를 구성하는 적어도 하나의 단어 벡터에 대하여 TF*IDF 공 식으로 산출된 가중치 값을 계산하고, 산출된 가중치 값에 기초하여, 적어도 하나의 단어 벡터에 대한 평균 가 중치를 획득할 수 있다. 동작 470에서, 컴퓨팅 장치는 특이값 분해를 이용하여 획득된 평균 가중치의 평탄화를 수행할 수 있다. 일 실시 예에 따르면, 컴퓨팅 장치는 특이값 분해를 이용하여 행렬의 차원을 감소시켜 획득된 평균 가중치를 평탄화시킬 수 있다. 예를 들어, 컴퓨팅 장치는 최대 가능도 모수 추정 방법을 이용하여 데이터의 특성을 나타내지 않고 일 반적인 단어에 해당하는 단어들의 중요도를 낮춤으로써 데이터의 범주 결정을 위한 컴퓨팅 장치의 성능을 향상 시킬 수 있다. 동작 480에서, 컴퓨팅 장치는 평탄화된 평균 가중치에 기초하여 문장 임베딩을 수행함으로써 제3 학습 데이터를 생성할 수 있다. 일 실시예에서, 컴퓨팅 장치가 문장 임베딩을 수행한 결과, 제3 학습 데이터로서 복수의 키워 드에 대응되는 중심점을 획득할 수 있다. 예를 들어, TV에 관한 문장, 드라마에 관한 문장, 화질에 관한 문장 등을 포함하는 복수의 문장에 대하여 문장 임베딩을 수행한 결과, 컴퓨팅 장치는 TV에 대응되는 중심점을 획득 할 수 있다. 다른 예를 들어, 핸드폰에 관한 문장, 테블릿 PC의 성능에 관한 문장, 음성 비서에 관한 문장 등을 포함하는 복수의 문장에 대하여 문장 임베딩을 수행한 결과, 컴퓨팅 장치는 단말에 대응되는 중심점을 획득할 수 있다. 동작 490에서, 컴퓨팅 장치는 데이터 범주의 분류 체계 중 제3 학습 데이터와 가장 유사한 중심점에 기초하여, 데이터의 적어도 하나의 범주를 결정할 수 있다. 예를 들어, 데이터가 \"무선 이어폰은 통화 품질이 개선되면 좋 을 텐데\"라는 문장을 포함하는 경우, 컴퓨팅 장치는 제3 학습 데이터에 기초하여, 문장 임베딩을 수행한 후 가 장 유사한 중심점으로서 '블루투스 이어폰'으로서 데이터의 범주를 결정할 수 있다. 또는, 컴퓨팅 장치는 '블루 투스 이어폰'과 함께 '통화 품질'을 데이터의 범주로 결정할 수 있다. 일 실시예에 따르면, 컴퓨팅 장치의 사용 자는 제품의 기능 단위로 소비자들의 용어를 이해함으로써, 소비자들의 요구사항을 파악할 수 있다. 도 5는 본 개시의 일 실시예에 의한 소셜 미디어 데이터를 제품의 기능 단위로 분류하는 방법을 도시한 도면이 다. 도 5를 참조하면, 컴퓨팅 장치는 복수의 소셜 미디어 데이터(512, 514, 516)를 포함하는 데이터들을 제품 의 기능 단위에 따라 분류(classification)할 수 있다. 일 실시예에서, 컴퓨팅 장치는 데이터 범주(category)의 분류 기준 및 복수의 키워드를 포함하는 데이터 범주의 분류 체계를 식별할 수 있다. 데이터 범주의 분류 체계 는 제품의 기능에 따른 분류 체계를 포함할 수 있다. 이에 따라, 데이터 범주의 분류 기준은 제품의 기능이고, 복수의 키워드는 TV, 라디오, 조명, 휴대폰, 스피커 등을 포함할 수 있다. 일 실시예에서, 컴퓨팅 장치는 적어도 하나의 문장을 포함하는 데이터를 획득할 수 있다. 예를 들어, 컴퓨 팅 장치는 제1 소셜 미디어 데이터, 제2 소셜 미디어 데이터, 제3 소셜 미디어 데이터 등을 포 함하는 데이터를 획득할 수 있다. 일 실시예에서, 컴퓨팅 장치는 비지도 학습에 의한 분류를 수행하는 뉴럴 네트워크를 이용하여, 식별한 데이터 범주의 분류 체계에 기초하여 데이터의 적어도 하나의 문장에 대한 적어도 하나의 범주를 결정할 수 있다. 예를 들어, 컴퓨팅 장치는 제1 소셜 미디어 데이터에 포함된 적어도 하나의 문장을 분석하고, 제1 소셜 미 디어 데이터의 범주를 TV로 결정할 수 있다. 다른 예를 들어, 컴퓨팅 장치는 제2 소셜 미디어 데이터(51 4)에 포함된 \"크리스마스에는 조명 필수지!\"라는 문장을 획득하고, 해당 문장으로부터 '크리스마스' 및 '조명' 의 단어를 식별하고, 제품의 기능에 따른 분류 체계에 기초하여 제2 소셜 미디어 데이터의 범주를 기념일 이 아닌 Lamp로 결정할 수 있다. 비지도 학습을 이용하는 군집화(clustering)의 경우 '기념일'로 제2 소셜 미디 어 데이터의 범주를 결정할 수 있으나, 일 실시예에 따른 컴퓨팅 장치의 동작 방법은 식별된 데이터 범주 의 분류 체계에 기초하여 제2 소셜 미디어 데이터의 범주를 결정함으로써, 제2 소셜 미디어 데이터의 범주를 컴퓨팅 사용자가 원하는 분류 체계에 포함되는 Lamp로 결정할 수 있다. 다른 예를 들어, 컴퓨팅 장치는제3 소셜 미디어 데이터의 범주를 Phone으로 결정할 수 있다. 도 6은 일 실시예에 의한 컴퓨팅 장치의 구성을 개략적으로 도시한 블록도이다. 도 6을 참조하면, 컴퓨팅 장치는 송수신부, 메모리 및 프로세서을 포함할 수 있다. 또한, 프로세서는 데이터 획득부, 전처리부, 단어 확장부, 가중치 계산부, 문장 임베딩 수 행부, 및 범주 결정부를 포함할 수 있다. 다만, 도 6에 도시된 구성 요소 모두가 컴퓨팅 장치의 필수 구성 요소인 것은 아니다. 도 6에 도시된 구성 요소보다 많은 구성 요소에 의해 컴퓨팅 장치가 구현 될 수도 있고, 도 6에 도시된 구성 요소보다 적은 구성 요소에 의해 컴퓨팅 장치가 구현될 수도 있다. 뿐 만 아니라 송수신부, 메모리, 프로세서가 하나의 칩(chip) 형태로 구현될 수도 있다. 프로세서는 하나 또는 복수의 프로세서로 구성될 수 있다. 이때, 하나 또는 복수의 프로세서는 CPU, AP, DSP(Digital Signal Processor) 등과 같은 범용 프로세서, GPU, VPU(Vision Processing Unit)와 같은 그래픽 전용 프로세서 또는 NPU와 같은 인공지능 전용 프로세서일 수 있다. 또는, 하나 또는 복수의 프로세서가 인공지 능 전용 프로세서인 경우, 인공지능 전용 프로세서는, 특정 인공지능 모델의 처리에 특화된 하드웨어 구조로 설 계될 수 있다. 프로세서는 메모리에 저장된 기 정의된 동작 규칙 또는 인공지능 모델에 따라, 입력 데이터를 처리하 도록 제어할 수 있다. 기 정의된 동작 규칙 또는 인공지능 모델은 학습을 통해 만들어질 수 있다. 여기서, 학습 을 통해 만들어진다는 것은, 기본 인공지능 모델이 학습 알고리즘에 의하여 다수의 학습 데이터들을 이용하여 학습됨으로써, 원하는 특성(또는, 목적)을 수행하도록 설정된 기 정의된 동작 규칙 또는 인공지능 모델이 만들 어짐을 의미한다. 이러한 학습은 본 개시에 따른 인공지능이 수행되는 컴퓨팅 장치 자체에서 이루어질 수 도 있고, 별도의 서버 및/또는 시스템을 통해 이루어 질 수도 있다. 인공지능 모델은, 복수의 신경망 레이어들 로 구성될 수 있다. 복수의 신경망 레이어들 각각은 복수의 가중치들(weight values)을 갖고 있으며, 이전 (previous) 레이어의 연산 결과와 복수의 가중치들 간의 연산을 통해 신경망 연산을 수행한다. 복수의 신경망 레이어들이 갖고 있는 복수의 가중치들은 인공지능 모델의 학습 결과에 의해 최적화될 수 있다. 예를 들어, 학 습 과정 동안 인공지능 모델에서 획득한 로스(loss) 값 또는 코스트(cost) 값이 감소 또는 최소화되도록 복수의 가중치들이 갱신될 수 있다. 인공 신경망은 심층 신경망(DNN:Deep Neural Network)를 포함할 수 있으며, 예를 들어, CNN (Convolutional Neural Network), DNN (Deep Neural Network), RNN (Recurrent Neural Network), RBM (Restricted Boltzmann Machine), DBN (Deep Belief Network), BRDNN(Bidirectional Recurrent Deep Neural Network) 또는 심층 Q-네트워크 (Deep Q-Networks) 등이 있으나, 전술한 예에 한정되지 않는다. 일 실시예에서, 데이터 획득부는 데이터 범주(category)의 분류 기준, 데이터 범주의 분류 레벨, 복수의 키워드, 적어도 하나의 문장을 포함하는 데이터 등을 획득할 수 있으나, 데이터 획득부가 획득할 수 있는 데이터가 이에 한정되는 것은 아니다. 일 실시예에서, 전처리부는 데이터 획득부로부터 적어도 하나의 문장을 포함하는 데이터를 수신하고, 수신한 데이터를 이용하여 전처리 과정을 수행할 수 있다. 예를 들어, 전처리 과정은 토큰화(tokenization) 과 정, 정제(cleaning) 과정, 정규화(normalization) 과정, 어간 추출(stemming) 과정, 표제어 추출 (lemmatization) 과정, 불용어(stopword) 제거 과정, 정규 표현식(regular expression) 텍스트 전처리 과정, 정수 인코딩(integer encoding) 과정, 원-핫 인코딩(one-hot encoding) 과정, 단어 분리(subword segmentation) 과정 등을 포함할 수 있다. 일 실시예에서, 단어 확장부는 전처리부로부터 전처리 과정이 수행된 데이터를 수신하고, 수신한 데 이터 포함된 단어들에 기초하여 단어를 확장시킬 수 있다. 예를 들어, 단어 확장부는 편집 거리 알고리즘 을 이용하여 데이터 포함된 단어들과 형태가 유사한 단어들로 단어를 확장시키고, 워드 임베딩을 이용하여 데이 터 포함된 단어들과 의미가 유사한 단어들로 단어를 확장시킬 수 있다. 또는, 단어 확장부는 형태 및 의미 가 유사한 단어들로 단어를 확장시킬 수 있다. 일 실시예에서, 가중치 계산부는 단어 확장부로부터 확장된 단어들을 수신하여 각 단어들의 가중치를 계산할 수 있다. 예를 들어, 가중치 계산부는 확장된 각 단어들의 가중치를 TF*IDF 공식을 이용하여 계산 할 수 있다. 일 실시예에서, 문장 임베딩 수행부는 가중치 계산부로부터 각 단어들의 가중치를 수신하여 평균 가 중치를 계산하고, 평균 가중치에 기초하여 문장 벡터를 획득할 수 있다. 또한, 문장 임베딩 수행부는 문장 벡터에 기초하여, 문장 임베딩을 수행할 수 있다.일 실시예에서, 범주 결정부는 문장 임베딩 수행부로부터 문장 임베딩 결과를 수신하여, 컴퓨팅 장치 가 범주를 결정하고자 하는 입력 데이터의 범주를 결정할 수 있다. 예를 들어, 범주 결정부는 입력 데이터를 문장 임베딩한 결과, 가장 근사한 중심점(centroid)을 가지는 범주로 해당 입력 데이터의 범주를 결정 할 수 있다. 도 7은 본 개시의 일 실시예에 의한 데이터 범주의 분류 체계를 업데이트 하는 방법을 나타낸 흐름도이다. 도 7을 참조하면, 동작 710에서, 컴퓨팅 장치는 적어도 하나의 문장을 포함하는 데이터를 획득할 수 있다. 일 실시예에서, 적어도 하나의 문장을 포함하는 데이터는 정형화 되지 않은 데이터로서, 미리 정의된 데이터 모델 을 가지고 있지 않은 비정형 데이터(unstructured data)를 포함할 수 있다. 예를 들어, 비정형 데이터는 약어, 속어, 신조어 등이 포함된 소셜 미디어 데이터를 포함할 수 있다. 동작 720에서, 컴퓨팅 장치는 데이터 범주의 분류 체계를 식별할 수 있다. 일 실시예에서, 데이터 범주의 분류 체계는 컴퓨팅 장치의 사용자가 데이터를 분류하기를 원하는 분류 체계로서, 데이터 범주의 분류 기준, 복수의 키워드 등을 포함할 수 있으며, 이에 한정되는 것은 아니고, 사용자가 원하는 분류의 세밀한 정도로서 데이터 범주의 분류 레벨 등을 더 포함할 수 있다. 일 실시예에 따르면, 컴퓨팅 장치는 데이터 범주의 분류 체계를 미 리 식별함으로써, 컴퓨팅 장치의 사용자가 원하는 분류 체계로 분류되지 않는 지도 학습의 단점을 해소할 수 있 다. 동작 730에서, 컴퓨팅 장치는 식별된 데이터 범주의 분류 체계와 획득한 적어도 하나의 문장을 포함하는 데이터 를 비지도 학습(unsupervised learning) 모델에 입력할 수 있다. 일 실시예에 따르면, 컴퓨팅 장치는 비지도 학 습 모델을 사용함으로써 입력 데이터에 라벨(label), 즉 정답에 해당하는 범주를 함께 학습시키는 지도 학습 모 델에 비하여 컴퓨팅 장치의 정확도 또는 확장성을 향상시킬 수 있다. 동작 740에서, 컴퓨팅 장치는 비지도 학습 모델의 출력으로 데이터의 범주가 검출되는지 여부를 판단할 수 있다. 일 실시예에서, 데이터의 범주가 데이터 범주의 분류 체계에 기초하여 검출되는 경우 동작 750을 수행하 고, 데이터의 범주가 검출되지 않거나 데이터의 범주가 데이터의 범주의 분류 체계와 달리 검출되는 경우 동작 760을 수행할 수 있다. 동작 750에서, 컴퓨팅 장치가 범주가 검출된다고 판단한 결과, 데이터의 범주를 출력할 수 있다. 일 실시예에서, 컴퓨팅 장치는 데이터 범주의 분류 체계에 기초하여 데이터의 적어도 하나의 범주를 결정할 수 있 다. 동작 760에서, 컴퓨팅 장치가 범주가 검출되지 않는다고 판단한 결과, 데이터 범주의 분류 체계를 업데이트 할 수 있다. 일 실시예에서, 컴퓨팅 장치는 범주가 검출되지 않거나, 데이터 범주의 분류 체계와 다른 범주를 검출 하는 경우, 데이터 범주의 분류 체계를 업데이트하기 위해 사용자로부터 데이터 범주의 분류 기준, 키워드 등을 입력받을 수 있다. 일 실시예에 따르면, 검출된 데이터 범주가 사용자가 의도한 범주가 아닌 경우 컴퓨터 장치 는 데이터 범주의 분류 체계를 업데이트함으로써, 컴퓨팅 장치가 자동적으로 군집화(clustering)를 수행할 때보 다 주제 해석을 용이하게 수행할 수 있고, 지도 학습에 의한 분류(classification)의 문제점인 대규모 범주일 수록 분류의 정확도가 떨어지는 문제점을 해결할 수 있다. 컴퓨팅 장치는 데이터 범주의 분류 체계를 업데이트 한 후 동작 720 내지 750을 다시 수행할 수 있다. 도 8은 본 개시의 일 실시예에 의한 분류 레벨에 따라 데이터의 범주를 결정하는 방법을 나타낸 흐름도이다. 도 8을 참조하면, 동작 810에서, 컴퓨팅 장치는 적어도 하나의 문장을 포함하는 데이터를 획득할 수 있다. 일 실시예에서, 동작 810은 도 7을 참조하여 전술한 동작 710과 대응될 수 있다. 동작 820에서, 컴퓨팅 장치는 데이터 범주의 분류 체계를 식별할 수 있다. 일 실시예에서, 데이터 범주의 분류 체계는 컴퓨팅 장치의 사용자가 데이터를 분류하기를 원하는 분류 체계로서, 데이터 범주의 분류 기준, 복수의 키워드 등을 포함할 수 있다. 동작 830에서, 컴퓨팅 장치는 데이터 범주의 분류 레벨을 식별할 수 있다. 일 실시예에서, 컴퓨팅 장치는 사용 자가 원하는 분류의 세밀한 정도에 따라, 데이터 범주의 분류 레벨을 식별할 수 있다. 예를 들어, 사용자가 세 밀한 분류를 원하는 경우 컴퓨팅 장치는 데이터 범주의 분류 레벨을 레벨 5로 식별하고, 사용자가 대강의 분류 를 원하는 경우 컴퓨팅 장치는 데이터 범주의 분류 레벨을 레벨 1로 식별할 수 있다. 동작 840에서, 컴퓨팅 장치는 동작 810에서 획득한 데이터, 동작 820에서 식별한 데이터 범주의 분류 체계 및 동작 840에서 식별한 데이터 범주의 분류 레벨을 비지도 학습 모델에 입력할 수 있다. 동작 850에서, 컴퓨팅 장치는 적어도 하나의 문장을 포함하는 데이터의 범주가 결정되는지 여부를 판단할 수 있 다. 일 실시예에서, 동작 850은 도 7을 참조하여 전술한 동작 740과 대응될 수 있다. 동작 860에서, 컴퓨팅 장치는 데이터의 범주가 결정된다고 판단한 결과, 데이터 범주의 분류 레벨을 식별할 수 있다. 일 실시예에서, 컴퓨팅 장치는 식별된 분류 레벨에 따라 데이터의 범주를 결정할 수 있다. 동작 882, 884, 및 886에서, 컴퓨팅 장치는 데이터 범주의 분류 레벨에 따라 대범주, 중범주, 소범주 등을 출력 할 수 있다. 예를 들어, 컴퓨팅 장치가 데이터 범주의 분류 레벨을 레벨 1로 식별한 결과 대범주를 출력할 수 있다. 다른 예를 들어, 컴퓨팅 장치가 데이터 범주의 분류 레벨을 레벨 2로 식별한 결과 중범주를 출력하고, 데 이터 범주의 분류 레벨을 레벨 3으로 식별한 결과 소범주로 출력할 수 있다. 다만, 이는 일 예시일 뿐, 컴퓨팅 장치는 대범주, 중범주, 소범주 등을 모두 출력할 수도 있으며 또는 일부만 출력할 수도 있다. 동작 870에서, 컴퓨팅 장치는 데이터의 범주가 결정되지 않는다고 판단한 결과, 데이터 범주의 분류 체계를 업 데이트할 수 있다. 일 실시예에서, 동작 870은 도 7을 참조하여 전술한 동작 760에 대응될 수 있다. 도 9는 본 개시의 일 실시예에 의한 서버가 데이터의 복수 개의 범주를 결정하는 방법을 도시한 도면이다. 도 9를 참조하면, 컴퓨팅 장치는 적어도 하나의 문장을 포함하는 데이터를 획득할 수 있다. 또한, 컴퓨팅 장치는 데이터 범주의 분류 기준, 복수의 키워드 등을 포함하는 데이터 범주의 분류 체계를 획득할 수 있다. 컴 퓨팅 장치는 데이터 및 데이터 범주의 분류 체계를 뉴럴 네트워크를 포함하는 서버에게 전송할 수 있다. 서버는 컴퓨팅 장치로부터 수신한 데이터 및 데이터 범주의 분류 체계에 기초하여 데이터 의 적어도 하나의 문장에 대한 적어도 하나의 범주를 결정할 수 있다. 일 실시예에서, 서버는 데이터에 포함된 적어도 하나의 문장에 대하여 전처리 과정 및 문장 분리 과 정을 수행하여 제1 학습 데이터를 생성할 수 있다. 또한, 서버는 제1 학습 데이터에 기초하여, 문장 별로 단어의 의미적 연관군을 확장한 제2 학습 데이터를 생성할 수 있다. 서버는 제2 학습 데이터에 기초하여 문장 임베딩을 수행한 제3 학습 데이터를 생성하고, 제3 학습 데이터에 기초하여 데이터 범주의 분류 체계에 따 라 적어도 하나의 범주를 결정할 수 있다. 예를 들어, 서버는 \"but I also want good array input and output - ideal input : 3 hdmi , 1 component , 1 composite , 1 VGA pc connection , 1 rca audio input , ideal output : Digital audio out , rca audio out, and HDMI ARC.”라고 기재된 소셜 미디어 데이터를 획득 하여 HDMI에 해당하는 제1 범주, Parts에 해당하는 제2 범주, Audio에 해당하는 제3 범주 등을 결정할 수 있다. 또한, 서버는 제1 범주, 제2 범주, 제3 범주 등을 포함하는 복수 개의 범 주 중에서 적어도 하나의 범주를 포함하는 최종 범주를 결정할 수 있다. 도 10은 본 개시의 일 실시예에 의한 제1 뉴럴 네트워크를 이용하여 비정형 데이터의 복수 개의 범주 후보를 결 정하고, 제2 뉴럴 네트워크를 사용하여 최종 범주를 결정하는 방법을 나타낸 도면이다. 도 10을 참조하면, 컴퓨팅 장치는 적어도 하나의 문장을 포함하는 데이터를 획득할 수 있다. 일 실 시예에서, 컴퓨팅 장치는 제1 뉴럴 네트워크를 포함할 수 있다. 제1 뉴럴 네트워크는 비지도 학습에 의한 분류를 수행하는 뉴럴 네트워크일 수 있다. 이에 따라, 컴퓨팅 장치는 제1 뉴럴 네트워크 를 이용하여 데이터의 적어도 하나의 범주를 결정할 수 있다. 예를 들어, 컴퓨팅 장치는 제1 뉴럴 네트워크를 이용하여 Label 후보 중 Blur, Glare, Slim Panel, Burn In 등을 데이터의 범주 후보로 결정하고, Label 후보에 포함되지 않은 PDP(Plasma Display Panel)를 데이터의 범주 후보로 결정할 수 있다. 일 실시예에 따르면, 컴퓨팅 장치는 Label 후보에 포함되지 않은 PDP가 데 이터의 범주 후보로 결정되는 것에 기초하여, 즉, 컴퓨팅 장치의 사용자가 데이터의 범주로 서 PDP를 획득하기를 원하는 경우에 데이터 범주의 분류 기준 및 복수의 키워드를 포함하는 데이터 범주의 분류 체계를 업데이트할 수 있다. 일 실시예에서, 컴퓨팅 장치는 제1 뉴럴 네트워크를 이용하여 획득된 복수 개의 범주 후보 중 최종 범주를 제2 뉴럴 네트워크를 이용하여 결정할 수 있다. 예를 들어, 컴퓨팅 장치는 Blur, Glare, Slim Panel, Burn In, PDP 등을 포함하는 복수 개의 범주 후보로부터 제2 뉴럴 네트워크를 이용 하여 최종 범주로서 Glare 및 PDP를 획득할 수 있다. 일 실시예에 따르면, 컴퓨팅 장치는 데이터 범주의 분류 체계를 추가 또는 수정함으로써 사용자가 얻고 싶은 범주에 기초하여 데이터를 분류할 수 있 다.일 실시예에서, 컴퓨팅 장치는 일괄 예측(batch prediction)을 이용하여 데이터의 적어도 하나의 문장에 대한 적어도 하나의 범주를 결정할 수 있다. 일 실시예에 따르면, 컴퓨팅 장치는 반복 예측을 수 행하는 일괄 예측을 이용함으로써 보다 정확한 적어도 하나의 범주를 예측할 수 있다. 도 11은 일 실시예에 의한 컴퓨팅 장치의 구성을 개략적으로 도시한 블록도이다. 도 11을 참조하면, 컴퓨팅 장치는 송수신부, 메모리 및 프로세서를 포함할 수 있다. 그러나, 도 11에 도시된 구성 요소 모두가 컴퓨팅 장치의 필수 구성 요소인 것은 아니다. 도 11에 도시된 구성 요소보다 많은 구성 요소에 의해 컴퓨팅 장치가 구현될 수도 있고, 도 11에 도시된 구성 요소보다 적은 구성 요소에 의해 컴퓨팅 장치가 구현될 수도 있다. 뿐만 아니라 송수신부, 프로세서, 메모리가 하나의 칩(chip) 형태로 구현될 수도 있다. 일 실시예에서, 송수신부는 컴퓨팅 장치와 유선 또는 무선으로 연결된 전자 디바이스와 통신할 수 있다. 예를 들면, 송수신부는 서버로부터 데이터를 입력으로서 수신할 수 있고, 서버로부터 데이터의 복 수의 범주에 대한 리스트를 수신할 수도 있다. 메모리에는 애플리케이션과 같은 프로그램 및 파일 등과 같은 다양한 종류의 데이터가 설치 및 저장될 수 있다. 프로세서는 메모리에 저장된 데이터에 접근하여 이를 이용하거나, 또는 새로운 데이터를 메 모리에 저장할 수도 있다. 일 실시예에서, 메모리는 데이터 베이스를 포함할 수 있다. 또한, 메모 리는 컴퓨팅 장치에서 사용되는 기 정의된 동작 규칙 또는 인공지능 모델을 저장할 수 있다. 일 실 시예에서, 메모리는 데이터 범주의 분류 체계, 기 구축된 사전 등을 저장할 수 있다. 메모리는 롬 (ROM), 램(RAM), 하드디스크, CD-ROM 및 DVD 등과 같은 저장 매체 또는 저장 매체들의 조합으로 구성될 수 있다. 또한, 메모리는 별도로 존재하지 않고 프로세서에 포함되어 구성될 수도 있다. 프로세서는 하나 또는 복수의 프로세서로 구성될 수 있다. 이때, 하나 또는 복수의 프로세서는 CPU, AP, DSP(Digital Signal Processor) 등과 같은 범용 프로세서, GPU, VPU(Vision Processing Unit)와 같은 그래픽 전용 프로세서 또는 NPU와 같은 인공지능 전용 프로세서일 수 있다. 또는, 하나 또는 복수의 프로세서가 인공지 능 전용 프로세서인 경우, 인공지능 전용 프로세서는, 특정 인공지능 모델의 처리에 특화된 하드웨어 구조로 설 계될 수 있다. 또한, 프로세서는 상술한 본 개시의 실시예에 따라 컴퓨팅 장치가 동작할 수 있도록 일련의 과정을 제어할 수 있다. 또한, 프로세서는 메모리에 저장된 기 정의된 동작 규칙 또는 인공지능 모델에 따 라, 입력 데이터를 처리하도록 제어할 수 있다. 기 정의된 동작 규칙 또는 인공지능 모델은 학습을 통해 만들어 질 수 있다. 여기서, 학습을 통해 만들어진다는 것은, 기본 인공지능 모델이 학습 알고리즘에 의하여 다수의 학 습 데이터들을 이용하여 학습됨으로써, 원하는 특성(또는, 목적)을 수행하도록 설정된 기 정의된 동작 규칙 또 는 인공지능 모델이 만들어짐을 의미한다. 이러한 학습은 본 개시에 따른 인공지능이 수행되는 컴퓨팅 장치 자체에서 이루어질 수도 있고, 별도의 서버 및/또는 시스템을 통해 이루어 질 수도 있다. 학습 알고리즘 의 예로는, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi- supervised learning) 또는 강화 학습(reinforcement learning)이 있으나, 전술한 예에 한정되지 않는다. 인공 지능 모델은, 복수의 신경망 레이어들로 구성될 수 있다. 복수의 신경망 레이어들 각각은 복수의 가중치들 (weight values)을 갖고 있으며, 이전(previous) 레이어의 연산 결과와 복수의 가중치들 간의 연산을 통해 신경 망 연산을 수행한다. 복수의 신경망 레이어들이 갖고 있는 복수의 가중치들은 인공지능 모델의 학습 결과에 의 해 최적화될 수 있다. 예를 들어, 학습 과정 동안 인공지능 모델에서 획득한 로스(loss) 값 또는 코스트(cost) 값이 감소 또는 최소화되도록 복수의 가중치들이 갱신될 수 있다. 인공 신경망은 심층 신경망(DNN:Deep Neural Network)를 포함할 수 있으며, 예를 들어, CNN (Convolutional Neural Network), DNN (Deep Neural Network), RNN (Recurrent Neural Network), RBM (Restricted Boltzmann Machine), DBN (Deep Belief Network), BRDNN(Bidirectional Recurrent Deep Neural Network) 또는 심층 Q-네트워크 (Deep Q-Networks) 등이 있으나, 전술한 예에 한정되지 않는다. 일 실시예에서, 프로세서는 메모리에 저장된 프로그램을 실행함으로써, 컴퓨팅 장치를 작동 하기 위한 동작을 수행할 수 있다. 예를 들면, 프로세서는 데이터 범주의 분류 기준 및 복수의 키워드 (keyword)를 포함하는 데이터 범주의 분류 체계를 식별하고, 적어도 하나의 문장을 포함하는 비정형 (unstructured) 데이터를 획득하고, 뉴럴 네트워크를 이용하여, 데이터 범주의 분류 체계에 따라 비정형 데이터 의 적어도 하나의 문장에 대한 적어도 하나의 범주를 결정할 수 있다.일부 실시예는 컴퓨터에 의해 실행되는 프로그램 모듈과 같은 컴퓨터에 의해 실행가능한 명령어를 포함하는 기 록 매체의 형태로도 구현될 수 있다. 컴퓨터 판독 가능 매체는 컴퓨터에 의해 액세스될 수 있는 임의의 가용 매 체일 수 있고, 휘발성 및 비휘발성 매체, 분리형 및 비분리형 매체를 모두 포함한다. 또한, 컴퓨터 판독가능 매 체는 컴퓨터 저장 매체를 포함할 수 있다. 컴퓨터 저장 매체는 컴퓨터 판독가능 명령어, 데이터 구조, 프로그램 모듈 또는 기타 데이터와 같은 정보의 저장을 위한 임의의 방법 또는 기술로 구현된 휘발성 및 비휘발성, 분리 형 및 비분리형 매체를 모두 포함한다. 개시된 실시예들은 컴퓨터로 읽을 수 있는 저장 매체(computer-readable storage media)에 저장된 명령어를 포 함하는 S/W 프로그램으로 구현될 수 있다. 컴퓨터는, 저장 매체로부터 저장된 명령어를 호출하고, 호출된 명령어에 따라 개시된 실시예에 따른 동작이 가 능한 장치로서, 개시된 실시예들에 따른 전자 장치를 포함할 수 있다. 컴퓨터로 읽을 수 있는 저장매체는, 비일시적(non-transitory) 저장매체의 형태로 제공될 수 있다. 여기서,‘비 일시적’은 저장매체가 신호(signal)를 포함하지 않으며 실재(tangible)한다는 것을 의미할 뿐 데이터가 저장매 체에 반영구적 또는 임시적으로 저장됨을 구분하지 않는다. 또한, 개시된 실시예들에 따른 제어 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공 될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있다. 컴퓨터 프로그램 제품은 S/W 프로그램, S/W 프로그램이 저장된 컴퓨터로 읽을 수 있는 저장 매체를 포함할 수 있다. 예를 들어, 컴퓨터 프로그램 제품은 디바이스의 제조사 또는 전자 마켓(예, 구글 플레이 스토어, 앱 스토 어)을 통해 전자적으로 배포되는 S/W 프로그램 형태의 상품(예, 다운로더블 앱)을 포함할 수 있다. 전자적 배포 를 위하여, S/W 프로그램의 적어도 일부는 저장 매체에 저장되거나, 임시적으로 생성될 수 있다. 이 경우, 저장 매체는 제조사의 서버, 전자 마켓의 서버, 또는 SW 프로그램을 임시적으로 저장하는 중계 서버의 저장매체가 될 수 있다. 컴퓨터 프로그램 제품은, 서버 및 디바이스로 구성되는 시스템에서, 서버의 저장매체 또는 디바이스의 저장매체 를 포함할 수 있다. 또는, 서버 또는 디바이스와 통신 연결되는 제 3 장치(예, 스마트폰)가 존재하는 경우, 컴 퓨터 프로그램 제품은 제 3 장치의 저장매체를 포함할 수 있다. 또는, 컴퓨터 프로그램 제품은 서버로부터 디바 이스 또는 제 3 장치로 전송되거나, 제 3 장치로부터 디바이스로 전송되는 S/W 프로그램 자체를 포함할 수 있다. 이 경우, 서버, 디바이스 및 제 3 장치 중 하나가 컴퓨터 프로그램 제품을 실행하여 개시된 실시예들에 따른 방 법을 수행할 수 있다. 또는, 서버, 디바이스 및 제 3 장치 중 둘 이상이 컴퓨터 프로그램 제품을 실행하여 개시 된 실시예들에 따른 방법을 분산하여 실시할 수 있다. 예를 들면, 서버(예로, 클라우드 서버 또는 인공 지능 서버 등)가 서버에 저장된 컴퓨터 프로그램 제품을 실행 하여, 서버와 통신 연결된 디바이스가 개시된 실시예들에 따른 방법을 수행하도록 제어할 수 있다. 또 다른 예로, 제 3 장치가 컴퓨터 프로그램 제품을 실행하여, 제 3 장치와 통신 연결된 디바이스가 개시된 실 시예에 따른 방법을 수행하도록 제어할 수 있다. 제 3 장치가 컴퓨터 프로그램 제품을 실행하는 경우, 제 3 장 치는 서버로부터 컴퓨터 프로그램 제품을 다운로드하고, 다운로드 된 컴퓨터 프로그램 제품을 실행할 수 있다. 또는, 제 3 장치는 프리로드 된 상태로 제공된 컴퓨터 프로그램 제품을 실행하여 개시된 실시예들에 따른 방법 을 수행할 수도 있다. 또한, 본 명세서에서, \"부\"는 프로세서 또는 회로와 같은 하드웨어 구성(hardware component), 및/또는 프로세 서와 같은 하드웨어 구성에 의해 실행되는 소프트웨어 구성(software component)일 수 있다."}
{"patent_id": "10-2019-0176272", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "전술한 본 개시의 설명은 예시를 위한 것이며, 본 개시가 속하는 기술분야의 통상의 지식을 가진 자는 본 개시 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가 지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본 개시의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 개시의 범위에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2019-0176272", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시예에 의한 데이터의 범주의 분류 체계에 기초하여 데이터를 분류하는 방법을 개략적으 로 도시한 도면이다. 도 2는 본 개시의 일 실시예에 의한 데이터의 범주를 분류하는 방법을 나타낸 흐름도이다. 도 3은 본 개시의 일 실시예에 의한 비지도 학습에 따라 데이터를 분류하는 방법을 도시한 도면이다. 도 4는 본 개시의 일 실시예에 의한 데이터의 적어도 하나의 범주를 결정하는 방법을 나타낸 흐름도이다. 도 5는 본 개시의 일 실시예에 의한 소셜 미디어 데이터를 제품의 기능 단위로 분류하는 방법을 도시한 도면이 다. 도 6은 일 실시예에 의한 컴퓨팅 장치의 구성을 개략적으로 도시한 블록도이다. 도 7은 본 개시의 일 실시예에 의한 데이터 범주의 분류 체계를 업데이트 하는 방법을 나타낸 흐름도이다. 도 8은 본 개시의 일 실시예에 의한 분류 레벨에 따라 데이터의 범주를 결정하는 방법을 나타낸 흐름도이다. 도 9는 본 개시의 일 실시예에 의한 서버가 데이터의 복수 개의 범주를 결정하는 방법을 도시한 도면이다. 도 10은 본 개시의 일 실시예에 의한 제1 뉴럴 네트워크를 이용하여 비정형 데이터의 복수 개의 범주 후보를 결 정하고, 제2 뉴럴 네트워크를 사용하여 최종 범주를 결정하는 방법을 나타낸 도면이다. 도 11은 일 실시예에 의한 컴퓨팅 장치의 구성을 개략적으로 도시한 블록도이다."}
