{"patent_id": "10-2023-0042996", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0147284", "출원번호": "10-2023-0042996", "발명의 명칭": "스테이터 및 이를 포함하는 모터", "출원인": "삼성전자주식회사", "발명자": "김종건"}}
{"patent_id": "10-2023-0042996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "모터에 있어서,로터;인슐레이터(130)와, 상기 인슐레이터(130)에 권선되는 복수의 코일(120)을 포함하는 스테이터(100); 및상기 스테이터(100)에 결합되는 스테이터 커버(200)를 포함하고,상기 인슐레이터(130)는, 상기 복수의 코일(120) 각각의 일단부를 수용하는 제1 단자 홈(131)과, 상기 복수의코일(120) 각각의 타단부를 수용하는 제2 단자 홈(132)을 포함하고,상기 스테이터 커버(200)는, 내부에 제1 전선 연결단자(213)가 배치되고, 상기 제1 단자 홈(131)에 삽입 결합되는 제1 단자 수용부(2113);내부에 제2 전선 연결단자(214)가 배치되고 상기 제2 단자 홈(132)에 삽입 결합되는 제2 단자 수용부(2122); 및일단이 상기 제2 단자 수용부(2122)의 상기 제2 전선 연결단자(214)와 연결되며, 타단이 외부 전원에 연결되어상기 복수의 코일(120)에 전원을 인가하도록 구성되는 전원 커넥터(230)를 포함하는, 모터."}
{"patent_id": "10-2023-0042996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 전원 커넥터(230)는, 일단이 상기 제2 전선 연결단자(214)에 연결된 리드 와이어(231);상기 리드 와이어(231)의 타단과 연결되며, 상기 외부 전원과 전기적으로 연결되도록 구성된 터미널 블록(232)을 포함하는, 모터."}
{"patent_id": "10-2023-0042996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 스테이터 커버(200)는, 상기 제1 단자 수용부(2113)와 상기 제2 단자 수용부(2122)가 마련된 제1 커버 바디(210); 및상기 제1 커버 바디(210)에 결합되며, 상기 터미널 블록(232)을 수용하도록 구성된 커넥터 고정부(222)가 마련된 제2 커버 바디(220)를 포함하는, 모터."}
{"patent_id": "10-2023-0042996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 커넥터 고정부(222)는,상기 터미널 블록(232) 수용 시, 상기 터미널 블록(232)의 양 측부 각각의적어도 일부를 둘러싸도록 구성되며,서로 이격 배치된 한 쌍의 고정 리브(2221)를 포함하는, 모터. 공개특허 10-2024-0147284-3-청구항 5 제4항에 있어서,상기 한 쌍의 고정 리브(2221) 각각은, 외측단이 모따기 가공된, 모터."}
{"patent_id": "10-2023-0042996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제3항에 있어서,상기 커넥터 고정부(222)는, 상기 커넥터 고정부(222)의 상면으로부터 돌출 형성된 스토퍼(2222)를 포함하는,모터."}
{"patent_id": "10-2023-0042996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제3항에 있어서,상기 스테이터 커버(200)의 상기 제2 커버 바디(220)는, 상기 제1 커버 바디(210)에 마련된 상기 제1 단자 수용부(2113) 및 상기 제2 단자 수용부(2122)의 상측을 덮도록 원호 형상을 가지는, 모터."}
{"patent_id": "10-2023-0042996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제3항에 있어서,상기 제1 단자 수용부(2113) 및 상기 제2 단자 수용부(2122) 각각은, 상기 인슐레이터(130)와 마주하는 상기 제2 커버 바디(220)의 배면으로부터 돌출 형성되며, 상기 복수의 코일(120) 각각의 단부를 개재시키도록 절개 형성된 복수의 슬릿(2113a, 2122a)을 포함하는, 모터."}
{"patent_id": "10-2023-0042996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 스테이터 커버(200)는, 절연 물질로 구성되는, 모터"}
{"patent_id": "10-2023-0042996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 스테이터 커버(200)는, 환(ring) 형태를 가지는, 모터."}
{"patent_id": "10-2023-0042996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서,상기 제1 전선 연결단자(213)는, 상기 스테이터(100)와 상기 스테이터 커버(200)의 결합 시, 하나의 지점에서상기 복수의 코일(120) 각각의 일단부를 전기적으로 연결하도록 구성되며,상기 제2 전선 연결단자(214)는, 상기 스테이터(100)와 상기 스테이터 커버(200)의 결합 시, 상기 외부 전원으로부터 상기 복수의 코일(120)에 전원이 인가되도록, 상기 복수의 코일(120) 각각의 타단부와 상기 전원 커넥터(230)를 전기적으로 연결하도록 구성되는, 모터.공개특허 10-2024-0147284-4-청구항 12 모터에 있어서,로터;인슐레이터(130)와, 상기 인슐레이터(130)에 권선되는 복수의 코일(120)을 포함하는 스테이터(100); 및상기 스테이터(100)에 결합되는 스테이터 커버(200)를 포함하고,상기 스테이터 커버(200)는, 상기 복수의 코일(120)에 전기적으로 연결되는 리드 와이어(231);상기 리드 와이어(231)의 끝단부와 결합되며, 외부 전원과 연결되어 전력을 공급받도록 구성되는 터미널 블록(232); 및상기 터미널 블록(232)을 내측에 수용하도록 구성되며, 상기 터미널 블록(232)의 수용 시 상기 터미널 블록(232)의 적어도 일부를 둘러싸도록 마련된 커넥터 고정부(222)를 포함하는, 모터."}
{"patent_id": "10-2023-0042996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 터미널 블록(232)은, 블록 하우징(2321)과, 상기 블록 하우징(2321)의 양 측부 각각에서 돌출 형성된 한쌍의 고정 돌기(2322)를 포함하며,상기 커넥터 고정부(222)는, 상기 터미널 블록(232)의 수용 시, 상기 한 쌍의 고정 돌기(2322)를 둘러싸도록 구성되며, 서로 이격 배치되는 한 쌍의 고정 리브(2221)를 포함하는, 모터."}
{"patent_id": "10-2023-0042996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 한 쌍의 고정 리브(2221) 각각은, 외측단이 모따기 가공된, 모터."}
{"patent_id": "10-2023-0042996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제12항에 있어서,상기 커넥터 고정부(222)는, 상기 커넥터 고정부(222)의 상면으로부터 돌출 형성된 스토퍼(2222)를 포함하는,모터."}
{"patent_id": "10-2023-0042996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제12항에 있어서,상기 커넥터 고정부(222)의 수용 시, 상기 전원 커넥터(230) 상면의 적어도 일부가 외부로부터 노출되는, 모터."}
{"patent_id": "10-2023-0042996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "냉장고(1)에 있어서,내부에 저장실(20)이 마련된 본체(10);상기 저장실(20)을 개폐하도록 상기 본체(10)에 회전 가능하게 연결된 도어(30); 및공개특허 10-2024-0147284-5-모터를 구비한 압축기(40)를 포함하며, 상기 저장실(20)에 냉기를 공급하도록 구성되는 냉기 공급 장치를 포함하고,상기 압축기(40)의 모터는, 로터; 인슐레이터(130)와, 상기 인슐레이터(130)에 권선되는 복수의 코일(120)을 포함하는 스테이터(100); 및상기 스테이터(100)에 결합되는 스테이터 커버(200)를 포함하고,상기 스테이터(100)의 상기 인슐레이터(130)는, 상기 복수의 코일(120) 각각의 일단부를 수용하는 제1 단자 홈(131)과, 상기 복수의 코일(120) 각각의 타단부를수용하는 제2 단자 홈(132)을 포함하고,상기 스테이터 커버(200)는, 내부에 제1 전선 연결단자(213)가 배치되고, 상기 제1 단자 홈(131)에 삽입 결합되는 제1 단자 수용부(2113); 내부에 제2 전선 연결단자(214)가 배치되고 상기 제2 단자 홈(132)에 삽입 결합되는 제2 단자 수용부(2122); 일단부가 상기 제2 단자 수용부(2122)의 상기 제2 전선 연결단자(214)와 연결되며, 타단부가 외부 전원에 연결되어 상기 복수의 코일(120)에 전원을 인가하도록 구성되는 전원 커넥터(230); 및상기 전원 커넥터(230)의 상기 타단부를 내측에 수용하도록 구성되며, 상기 전원 커넥터(230)의 타단부 수용 시상기 타단부의 적어도 일부를 둘러싸도록 구성된 커넥터 고정부(222)를 포함하는, 냉장고(1)."}
{"patent_id": "10-2023-0042996", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 일 실시예에 따른 모터는 로터를 포함할 수 있다. 상기 모터는 인슐레이터와, 상기 인슐레이터에 권 선되는 복수의 코일을 포함하는 스테이터를 포함할 수 있다. 상기 모터는 상기 스테이터에 결합되는 스테이터 커버를 포함할 수 있다. 상기 인슐레이터는 상기 복수의 코일 각각의 일단부를 수용하는 제1 단자 홈과, 상기 복수의 코일 각각의 타단부를 수용하는 제2 단자 홈을 포함할 수 있다. 상기 스테이터 커버는 내부에 제1 전선 연결단자가 배치되고, 상기 제1 단자 홈에 삽입 결합되는 제1 단자 수용부를 포함할 수 있다. 상기 스테이터 커 버는 내부에 제2 전선 연결단자가 배치되고 상기 제2 단자 홈에 삽입 결합되는 제2 단자 수용부를 포함할 수 있 다. 상기 스테이터 커버는 일단이 상기 제2 단자 수용부의 상기 제2 전선 연결단자와 연결되며, 타단이 외부 전 원에 연결되어 상기 복수의 코일에 전원을 인가하도록 구성되는 전원 커넥터를 포함할 수 있다."}
{"patent_id": "10-2023-0042996", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시의 실시예들은, 복수의 전선 연결단자와 전원 커넥터가 일체로 구비된 스테이터 커버를 포함하는 스테이 터 및 이를 포함하는 모터에 관한 것이다."}
{"patent_id": "10-2023-0042996", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 압축기는 냉동 사이클 장치를 이루는 구성요소들 중의 하나로서 냉매를 고온 고압으로 압축하여 응 축기로 전달하는 장치이다. 예를 들면, 상기 압축기는 가정용 냉장고와 같은 가전 제품에 구비될 수 있다. 압축기는 압축 방식과 밀폐 구조에 따라 다양한 종류로 구분될 수 있다. 예를 들면, 밀폐형 압축기는 왕복동 압축기, 스크롤 압축기, 로터리 압축기 등으로 구분될 수 있다. 밀폐형 압축기는 냉매를 압축하는 압축 기구부 와 압축 기구부를 구동하는 전동 기구부(예: 이하, 모터)를 포함할 수 있다. 모터는 구동방식에 따라 여러 종류로 구분된다. 일반적으로, 압축기에 주로 쓰이는 능력 가변형 압축기는 브러 시리스 모터를 사용하며, 컨트롤러에 의해 제어되는 인버터를 포함한다. 상기 능력 가변형 압축기는 인버터에 구비된 스위칭 소자의 스위칭 동작에 따라 발생되는 전압을 모터 권선(예: 코일)에 인가하여 모터를 구동하는 방식이 보편적으로 사용되고 있다. 모터는 스테이터(또는 고정자)와 로터(또는 회전자)를 포함할 수 있다. 상기 로터는 로터 코어와 마그네트를 구비할 수 있고, 코일을 구비한 스테이터와 전자기적으로 상호 작용하도록 구성될 수 있다. 로터의 마그네트에 의한 자기장과 스테이터의 코일에 흐르는 전류 사이에서 작용하는 힘에 의해 로터가 회전할 수 있다. 스테이터에 전류를 인가하기 위해서는 외부 전원과 스테이터에 권선되는 코일 간의 연결이 필요하다. 모터는 코일에 전류을 인가하기 위해 외부 전원과 접속되며, 코일과 전선 연결단자를 통해 전기적으로 연결되는 전원 커넥터를 포함할 수 있다. 전원 커넥터가 스테이터에 일체로 마련된 경우, 모터의 제조 공정 시 전원 커넥터와 다른 부품 간의 간섭이 발생할 우려가 있다. 본 개시의 다양한 실시예들은, 모터의 제조 공정 시, 전원 커넥터를 임시로 고정할 수 있는 구조를 갖는 스테이 터 및 이를 포함하는 모터를 제공할 수 있다. 본 개시의 다양한 실시예들은, 복수의 전선 연결단자와 전원 커넥터가 일체로 구비된 스테이터 커버를 구비한 스테이터 및 이를 포함하는 모터를 제공할 수 있다. 본 개시의 일 실시예에 따른 모터는 로터를 포함할 수 있다. 상기 모터는 인슐레이터와, 상기 인슐레이터에 권 선되는 복수의 코일을 포함하는 스테이터를 포함할 수 있다. 상기 모터는 상기 스테이터에 결합되는 스테이터 커버를 포함할 수 있다. 상기 인슐레이터는 상기 복수의 코일 각각의 일단부를 수용하는 제1 단자 홈과, 상기 복수의 코일 각각의 타단부를 수용하는 제2 단자 홈을 포함할 수 있다. 상기 스테이터 커버는 내부에 제1 전선 연결단자가 배치되고, 상기 제1 단자 홈에 삽입 결합되는 제1 단자 수용부를 포함할 수 있다. 상기 스테이터 커버는 내부에 제2 전선 연결단자가 배치되고 상기 제2 단자 홈에 삽입 결합되는 제2 단자 수용부를 포함할 수 있다. 상기 스테이터 커버는 일단이 상기 제2 단자 수용부의 상기 제2 전선 연결단자와 연결되며, 타단이 외부 전원에 연결되어 상기 복수의 코일에 전원을 인가하도록 구성되는 전원 커넥터를 포함할 수 있다. 일 실시예에 따른, 상기 전원 커넥터는 일단이 상기 제2 전선 연결단자에 연결된 리드 와이어를 포함할 수 있다. 상기 전원 커넥터는 상기 리드 와이어의 타단과 연결되며, 상기 외부 전원과 전기적으로 연결되도록 구성 된 터미널 블록을 포함할 수 있다. 일 실시예에 따른, 상기 스테이터 커버는 상기 제1 단자 수용부와 상기 제2 단자 수용부가 마련된 제1 커버 바 디를 포함할 수 있다. 상기 스테이터 커버는 상기 제1 커버 바디에 결합되며, 상기 터미널 블록을 수용하도록 구성된 커넥터 고정부가 마련된 제2 커버 바디를 포함할 수 있다. 일 실시예에 따른, 상기 커넥터 고정부는 상기 터미널 블록 수용 시, 상기 터미널 블록의 양 측부 각각의 적어 도 일부를 둘러싸도록 구성되며, 서로 이격 배치된 한 쌍의 고정 리브를 포함할 수 있다. 일 실시예에 따른, 상기 한 쌍의 고정 리브 각각은 외측단이 모따기 가공될 수 있다. 일 실시예에 따른, 상기 커넥터 고정부는 상기 커넥터 고정부의 상면으로부터 돌출 형성된 스토퍼를 포함할 수 있다. 일 실시예에 따른, 상기 스테이터 커버의 상기 제2 커버 바디는 상기 제1 커버 바디에 마련된 상기 제1 단자 수 용부 및 상기 제2 단자 수용부의 상측을 덮도록 원호 형상을 가질 수 있다. 일 실시예에 따른, 상기 제1 단자 수용부 및 상기 제2 단자 수용부 각각은, 상기 인슐레이터와 마주하는 상기 제2 커버 바디의 배면으로부터 돌출 형성되며, 상기 복수의 코일 각각의 단부를 개재시키도록 절개 형성된 복수 의 슬릿을 포함할 수 있다. 일 실시예에 따른, 상기 스테이터 커버는 절연 물질로 구성될 수 있다. 일 실시예에 따른, 상기 스테이터 커버는 환(ring) 형태를 가질 수 있다. 일 실시예에 따른, 상기 제1 전선 연결단자는 상기 스테이터와 상기 스테이터 커버의 결합 시, 하나의 지점에서 상기 복수의 코일 각각의 일단부를 전기적으로 연결하도록 구성될 수 있다. 상기 제2 전선 연결단자는 상기 스 테이터와 상기 스테이터 커버의 결합 시, 상기 외부 전원으로부터 상기 복수의 코일에 전원이 인가되도록, 상기 복수의 코일 각각의 타단부와 상기 전원 커넥터를 전기적으로 연결하도록 구성될 수 있다. 본 개시의 일 실시예에 따른 모터는 로터를 포함할 수 있다. 상기 모터는 인슐레이터와, 상기 인슐레이터에 권 선되는 복수의 코일을 포함하는 스테이터를 포함할 수 있다. 상기 모터는 상기 스테이터에 결합되는 스테이터 커버를 포함할 수 있다. 상기 스테이터 커버는 상기 복수의 코일에 전기적으로 연결되는 리드 와이어를 포함할 수 있다. 상기 스테이터 커버는 상기 리드 와이어의 끝단부와 결합되며, 외부 전원과 연결되어 전력을 공급받 도록 구성되는 터미널 블록을 포함할 수 있다. 상기 스테이터 커버는 상기 터미널 블록을 내측에 수용하도록 구성되며, 상기 터미널 블록의 수용 시 상기 터미널 블록의 적어도 일부를 둘러싸도록 마련된 커넥터 고정부를 포함할 수 있다. 일 실시예에 따른, 상기 터미널 블록은 블록 하우징과, 상기 블록 하우징의 양 측부 각각에서 돌출 형성된 한 쌍의 고정 돌기를 포함할 수 있다. 상기 커넥터 고정부는 상기 터미널 블록의 수용 시, 상기 한 쌍의 고정 돌 기를 둘러싸도록 구성되며, 서로 이격 배치되는 한 쌍의 고정 리브를 포함할 수 있다. 일 실시예에 따른, 상기 한 쌍의 고정 리브 각각은 외측단이 모따기 가공될 수 있다. 일 실시예에 따른, 상기 커넥터 고정부는 상기 커넥터 고정부의 상면으로부터 돌출 형성된 스토퍼를 포함할 수 있다.일 실시예에 따른, 상기 모터는 상기 커넥터 고정부의 수용 시, 상기 전원 커넥터 상면의 적어도 일부가 외부로 부터 노출될 수 있다. 본 개시의 일 실시예에 따른 냉장고는 내부에 저장실이 마련된 본체를 포함할 수 있다. 상기 냉장고는 상기 저 장실을 개폐하도록 상기 본체에 회전 가능하게 연결된 도어를 포함할 수 있다. 상기 냉장고는 모터를 구비한 압축기를 포함하며, 상기 저장실에 냉기를 공급하도록 구성되는 냉기 공급 장치를 포함할 수 있다. 상기 압축 기의 모터는 로터; 인슐레이터와, 상기 인슐레이터에 권선되는 복수의 코일을 포함하는 스테이터; 및 상기 스테 이터에 결합되는 스테이터 커버를 포함할 수 있다. 상기 스테이터의 상기 인슐레이터는 상기 복수의 코일 각각 의 일단부를 수용하는 제1 단자 홈과, 상기 복수의 코일 각각의 타단부를 수용하는 제2 단자 홈을 포함할 수 있 다. 상기 스테이터 커버는 내부에 제1 전선 연결단자가 배치되고, 상기 제1 단자 홈에 삽입 결합되는 제1 단자 수용부; 내부에 제2 전선 연결단자가 배치되고 상기 제2 단자 홈에 삽입 결합되는 제2 단자 수용부; 일단부가 상기 제2 단자 수용부의 상기 제2 전선 연결단자와 연결되며, 타단부가 외부 전원에 연결되어 상기 복수의 코일 에 전원을 인가하도록 구성되는 전원 커넥터; 및 상기 전원 커넥터의 상기 타단부를 내측에 수용하도록 구성되 며, 상기 전원 커넥터의 타단부 수용 시 상기 타단부의 적어도 일부를 둘러싸도록 구성된 커넥터 고정부를 포함 할 수 있다. 본 개시의 다양한 실시예들은, 모터의 제조 공정 시, 커넥터 고정부에 전원 커넥터의 터미널 블록을 인입 고정 함에 따라 제조 공정 중 상기 전원 커넥터와 다른 부품 간의 간섭을 방지할 수 있다. 본 개시의 다양한 실시예들은, 코일의 중성점 결선을 위한 제1 전선 연결단자와, 코일의 구동점 결선을 위한 제 2 전선 연결단자가 스테이터 커버에 일체로 마련됨에 따라, 스테이터와 스테이터 커버의 하나의 압착 공정에 의 해 코일이 전기적으로 결선되어 제조 공정이 단순화해질 수 있다. 본 개시의 예시적 실시예들에서 얻을 수 있는 효과는 이하의 기재로부터 본 개시의 예시적 실시예들이 속하는"}
{"patent_id": "10-2023-0042996", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "기술분야에서 통상의 지식을 가진 자에게 명확하게 도출되고 이해될 수 있다. 즉, 본 개시의 예시적 실시예들을"}
{"patent_id": "10-2023-0042996", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 3, "content": "실시함에 따른 의도하지 아니한 효과들 역시 본 개시의 예시적 실시예들로부터 당해 기술분야의 통상의 지식을 가진 자에 의해 도출될 수 있다."}
{"patent_id": "10-2023-0042996", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 아이템 한 개 또는 복 수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제1\", \"제2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하 기 위해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제1) 구성요소가 다른(예: 제2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 어떤 구성요소가 다른 구성요소에 직접적 으로(예: 유선으로), 무선으로, 또는 제3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. “포함하다” 또는 “가지다”등의 용어는 본 문서에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이 들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성 요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는다. 어떤 구성요소가 다른 구성요소와 “연결”, “결합”, “지지” 또는 “접촉”되어 있다고 할 때, 이는 구성요 소들이 직접적으로 연결, 결합, 지지 또는 접촉되는 경우뿐 아니라, 제3 구성요소를 통하여 간접적으로 연결, 결합, 지지 또는 접촉되는 경우를 포함한다. 어떤 구성요소가 다른 구성요소 “상에” 위치하고 있다고 할 때, 이는 어떤 구성요소가 다른 구성요소에 접해 있는 경우뿐 아니라 두 구성요소 사이에 또 다른 구성요소가 존재하는 경우도 포함한다. “및/또는”이라는 용어는 복수의 관련된 기재된 구성요소들의 조합 또는 복수의 관련된 기재된 구성요소들 중 의 어느 구성요소를 포함한다. 이하 첨부된 도면들을 참고하여 본 발명의 작용 원리 및 실시예에 대해 설명한다. 본 개시의 일 실시예에 따른 모터는 냉동 사이클이 요구되는 냉장고와 같은 다양한 장치에 적용될 수 있다. 그 러나, 본 개시가 이에 제한되는 것은 아니며 상기 모터는 공기조화장치와 같은 다양한 가전 제품에 적용될 수 있다. 도 1a는, 일 실시예에 따른 모터에 구비된 스테이터 어셈블리의 사시도이다. 도 1b는, 도 1a에 도시된 스테이터 어셈블리의 일부 구성요소를 분해한 분해 사시도이다. 일 실시예에 따른 모터는 스테이터(또는, 고정자), 스테이터와 상호 작용하여 회전하도록 마련된 로 터(또는, 회전자)(미도시) 및 스테이터의 상측을 커버하도록 마련된 스테이터 커버를 포함할 수 있다. 도 1a 및 도 1b를 참고하면, 스테이터와 스테이터 커버를 포함하는 예시적 스테이터 어셈블리가 도시 되어 있다. 일 실시예에서, 모터는 로터(미도시)가 스테이터의 외측에 배치되는 아우터 로터 타입의 모터일 수 있다. 아우터 로터 타입 모터는, 로터가 스테이터의 내측에 배치되는 이너 로터 타입 모터와 비교하여, 모터의 크기 대비 출력이 크다는 장점이 있다. 따라서, 아우터 로터 타입 모터는 상대적으로 작은 크기로 높은 출력을 낼 수 있어 소형화에 유리하다. 일 실시예서, 로터(미도시)는 스테이터의 외측에 배치될 수 있다. 로터는, 후술하는 스테이터에 구 비된 복수의 코일에 전류가 인가되면, 스테이터와 상호 작용하여 회전할 수 있다. 일 실시예에서, 로터는 회전축(axis)을 중심으로 회전할 수 있다. 도면에 구체적으로 도시되지는 않았지만, 모터는 로터에 장 착되어 상기 로터와 함께 회전하는 회전 샤프트를 포함할 수 있다. 이 경우, 모터는 회전 샤프트를 통해 압축기(미도시)의 압축 유닛(미도시)에 동력을 전달할 수 있다. 일 실시예에서, 스테이터는, 스테이터 코어, 복수의 코일, 및 스테이터 코어와 복수의 코 일 간 절연을 위한 인슐레이터를 포함할 수 있다. 일 실시예서, 스테이터 코어는 환형의 코어와, 상기 코어로부터 방사형으로 연장되는 복수의 티스(미도 시)를 포함할 수 있다. 일 실시예에서, 복수의 코일은 스테이터 코어 및/또는 인슐레이터에 권선될 수 있다. 일 실시 예에서, 복수의 코일은 복수의 와이어(또는, 전선)로 구성될 수 있다. 일 실시예에서, 코일은 3상 형태의 교류 전원을 인가 받도록 구성될 수 있다. 예를 들어, 복수의 코일은 복수의 티스 각각에 권선된 U상 코일, V상 코일 및 W상 코일을 포함할 수 있다. 일 실시예에서, 인슐레이터는 절연 재질로 형성될 수 있다. 예를 들어, 인슐레이터는 수지와 같은 절연성 재질로 구성될 수 있다. 일 실시예에 따르면, 인슐레이터는 스테이터 코어의 상부 및 하부 각각에 결합될 수 있다. 일 실시 예에서, 인슐레이터는 인슐레이터의 상부 외관을 형성하는 제1 인슐레이터(130a)와, 인슐레이터(13 0)의 하부 외관을 형성하는 제2 인슐레이터(130b)를 포함할 수 있다. 예를 들어, 제1 인슐레이터(130a)는 스테 이터 코어의 상부에서 압입 결합될 수 있다. 예를 들어, 제2 인슐레이터(130b)는 스테이터 코어의 하부에서 압입 결합될 수 있다. 이 경우, 인슐레이터는 스테이터 코어의 복수의 티스를 커버함으로 써 코일이 스테이터 코어와 직접 접촉하는 것을 방지할 수 있다. 일 실시예에서, 제1 인슐레이터(130a)의 상부의 일 위치에는 스테이터 코어 및/또는 인슐레이터에 권 선된 복수의 코일 각각으로부터 인출되는 각 와이어의 일단부를 지지하는 제1 단자 홈이 형성될 수 있다. 일 실시예에서, 제1 인슐레이터(130a)의 상부의 다른 일 위치에는 상기 복수의 코일로부터 인출되 는 각 와이어의 타단부를 지지하는 제2 단자 홈이 형성될 수 있다. 일 실시예서, 제1 단자 홈의 내측에는 후술하는 스테이터 커버의 제1 단자 수용부가 삽입되는 공간이 마련될 수 있다. 일 실시예에서, 제1 단자 홈은 스테이터 코어 및/또는 제1 인슐레이터(130a)에 권선된 코일과 인접하는 내측면과, 상기 내측면에 대향하는 외측면을 포함할 수 있다. 일 실시예에서, 제1 단자 홈의 내 측면과 외측면 각각에는 복수의 코일 각각에서 인출된 각 와이어가 개재되도록 절개 형성된 복수의 슬릿 (1312, 1313)이 각각 마련될 수 있다. 예를 들어, 제1 단자 홈의 내측면에는 3개의 와이어 각각을 위한 3 개의 슬릿이 형성될 수 있다. 예를 들어, 제1 단자 홈의 외측면에는 3개의 와이어 각각을 위한 3개 의 슬릿이 형성될 수 있다. 제1 단자 홈의 내측면과 외측면에 각각 형성된 복수의 슬릿(1312, 1313)은 각각 서로 대응하도록 형성될 수 있다. 슬릿 중 하나와 그에 대응하는 슬릿에, 하나의 상 에 대응하는 코일로부터 인출된 와이어가 개재될 수 있다. 이 경우, 복수의 코일 각각, 예를 들어 U 상 코일, V상 코일 및 W상 코일에서 인출된 와이어 각각의 일단은 슬릿(1312, 1313)에 삽입 개 재됨으로써 제1 단자 홈에 고정될 수 있다. 일 실시예서, 제2 단자 홈의 내측에는 후술하는 스테이터 커버의 제2 단자 수용부가 삽입되는 공간이 마련될 수 있다. 일 실시예에서, 제2 단자 홈은 스테이터 코어 및/또는 제1 인슐레이터(130a)에 권선된 코일과 인접하는 내측면과, 상기 내측면에 대향하는 외측면을 포함할 수 있다. 일 실시예에서, 제2 단자 홈의 내 측면과 외측면 각각에는 복수의 코일 각각에서 인출된 각 와이어가 개재되도록 절개 형성된 슬릿(1322, 1323)이 각각 마련될 수 있다. 예를 들어, 제2 단자 홈의 내측면에는 3개의 와이어 각각을 위한 3개의 슬 릿이 형성될 수 있다. 예를 들어, 제2 단자 홈의 외측면에는 3개의 와이어 각각을 위한 3개의 슬릿 이 형성될 수 있다. 제2 단자 홈의 내측면과 외측면에 각각 형성된 복수의 슬릿(1322, 1323)은 각 각 서로 대응하도록 형성될 수 있다. 슬릿 중 하나와 그에 대응하는 슬릿에는, 하나의 상에 대응 하는 코일로부터 인출된 와이어가 개재될 수 있다. 이 경우, 복수의 코일 각각, 예를 들어 U상 코일 , V상 코일 및 W상 코일에서 인출된 와이어 각각의 타단은 슬릿(1322, 1323)에 삽입 개재됨으로 써 제2 단자 홈에 고정될 수 있다. 일 실시예에서, 제1 인슐레이터(130a)의 상부에는 스테이터 커버와의 결합을 위한 복수의 결합 홈이 마련될 수 있다. 일 실시예에서, 복수의 결합 홈 각각은 제1 인슐레이터(130a)의 둘레를 따라 소정 간격 으로 이격 배치될 수 있다. 일 실시예에서, 복수의 결합 홈 각각의 내측에는, 후술하는 각각의 결합 홈 에 대응하는 스테이터 커버의 결합 돌기가 삽입되는 공간이 마련될 수 있다. 일 실시예에서, 스테이터 커버는 스테이터의 상측에서 결합될 수 있다. 이 경우, 스테이터 커버 가 상기 스테이터의 코일을 외부로부터 차단함으로써, 코일 내부로 이물질이 유입되는 것 을 방지할 수 있다. 또한, 스테이터 커버는, 스테이터와의 결합 시, 한 번의 압착 동작으로 복수의 코일의 중성점(neutral point)과 구동점을 모두 결선 시킬 수 있다. 이하, 스테이터와 스테이터 커 버에서의 코일 결선 구조에 대해서는 후술하도록 한다. 일 실시예에서, 스테이터 커버는 절연 재질로 형성될 수 있다. 예를 들어, 스테이터 커버는 수지와 같은 절연성 재질로 구성될 수 있다. 일 실시예에서, 스테이터 커버는 제1 커버 바디 및 제2 커버 바디를 포함할 수 있다. 일 실시 예에서, 스테이터 커버는 전원 커넥터를 더 포함할 수 있다. 일 실시예에서, 제1 커버 바디는 스테이터 커버의 전체적인 외관을 형성할 수 있다. 일 실시예에서, 제1 커버 바디는 실질적으로 환 형상(또는, 링(ring))을 갖도록 마련될 수 있다. 일 실시예에서, 제1 커 버 바디는 중앙부에 모터의 회전 샤프트가 관통하는 샤프트 홀이 마련될 수 있다. 일 실시예에서, 제2 커버 바디는 스테이터 커버의 상부 외관 적어도 일부를 형성할 수 있다. 일 실 시예에서, 제2 커버 바디는 실질적으로 원호(arc) 형상을 갖도록 마련될 수 있다. 일 실시예에서, 제2 커 버 바디는 제1 커버 바디의 상측에서 결합될 수 있다. 일 실시예에서, 제2 커버 바디는, 모터 의 조립 공정 시, 전원 커넥터와 다른 부품 간의 간섭을 방지하기 위해 전원 커넥터를 스테이터(10 0)에 임시 고정하는 구조를 가질 수 있다. 이하, 상기 전원 커넥터의 고정 구조에 대해서는 후술하도록 한다. 일 실시예에서, 전원 커넥터는, 일단부가 후술하는 제1 바디에 마련된 전선 연결단자(예: 도 3의 제2 전선 연결단자)와 연결되며, 타단부가 외부 전원(예: 도 10의 압축기의 전원 터미널(40b))에 연결될 수 있다. 이 경우, 전원 커넥터를 통해 스테이터의 코일에 외부 전원이 인가될 수 있다. 여기 서, 전선 연결단자는 매그메이트(mag-mate) 단자라 지칭될 수도 있다. 도 2는, 일 실시예에 따른 스테이터 커버를 상측에서 바라본 사시도이다. 도 3은, 일 실시예에 따른 스테이터 커버의 분해 사시도이다. 도 4는, 일 실시예에 따른 스테이터 커버를 하측에서 바라본 사시도이다. 도 2 내지 도 4를 참고하면, 일 실시예에 따른 스테이터 커버의 제1 커버 바디는 제1 바디부와, 커넥터 연결부를 포함할 수 있다. 일 실시예에서, 제1 바디부는 제1 커버 바디의 전체적인 외관을 형성할 수 있다. 일 실시예에서, 제 1 커버 바디는 중앙부에 모터의 회전 샤프트가 관통하는 샤프트 홀이 마련될 수 있다. 일 실시예에서, 제1 바디부는 평탄부(211a)와, 상기 평탄부와 단차를 갖도록 함몰 형성된 오목부(211b)를 포함할 수 있다. 일 실시예에서, 평탄부(211a)의 상면에는 복수의 끼움 홀이 마련될 수 있다. 일 실시예에서, 복수의 끼 움 홀은 평탄부(211a)의 둘레를 따라 소정 간격 이격되어 배치될 수 있다. 이 경우, 후술하는 제2 커버 바디의 제2 바디부의 복수의 끼움 돌기(미도시)가 대응하는 복수의 끼움 홀 각각에 삽입됨에 따라, 제1 커버 바디와 제2 커버 바디가 결합될 수 있다. 또한, 제1 커버 바디와 제2 커버 바 디 결합 시, 제2 커버 바디는 제1 커버 바디의 평탄부(211a)에 안착될 수 있다. 일 실시예에서, 제1 바디부에는 스테이터 커버와 스테이터(예: 도 1b의 스테이터의 인슐레 이터)의 결합을 위한 복수의 결합 돌기가 마련될 수 있다. 일 실시예에서, 복수의 결합 돌기(211 4)는 제1 바디부의 배면(예: 스테이터를 향하는 면)으로부터 돌출 형성될 수 있다. 일 실시예에서, 복수의 결합 돌기는 제1 바디부의 배면에서 둘레를 따라 소정 간격 이격 배치될 수 있다. 일 실시예에서, 제1 바디부는, 스테이터의 인슐레이터와 스테이터 커버의 결합 시, 각 상 의 코일(예: 도 1b의 코일(121, 122, 123)) 각각과 전기적으로 연결되는 제1 전선 연결단자가 내부에 수용 되는 제1 단자 수용부를 포함할 수 있다. 일 실시예에서, 제1 단자 수용부는 제1 바디부의 배면에 배치될 수 있다. 일 실시예에서, 제1 단자 수용부는 제1 바디부의 배면으로부터 하측으로 연장 형성될 수 있다. 일 실시예에서, 제1 단자 수 용부는 상측이 개방되며, 개방된 상측을 통해 제1 전선 연결단자가 제1 단자 수용부의 내부에 수용될 수 있다. 일 실시예에서, 제1 단자 수용부는 방사상 내측을 향한 내측부와 방사상 외측을 향한 외측부를 가질 수 있다. 일 실시예에서, 내측부와 외측부 각각에는 절개 형성된 복수의 슬릿(2113a)이 마련될 수 있다. 일 실시예에서, 복수의 슬릿(2113a)에는, 스테이터 커버와 스테이터의 인슐레이터의 결합 시, 각 상의 코일(121, 122, 123)으로부터 인출된 와이어 각각의 일 단이 각각 개재될 수 있다. 일 실시예에서, 제1 전선 연결단자는, 전도성 물질(예: 메탈(metal))로 구성될 수 있다. 일 실시예에서, 제1 전선 연결단자의 양측부에는 절개 형성된 복수의 슬릿(213a)이 마련될 수 있다. 일 실시예에서, 복수의 슬릿(213a)에는, 스테이터 커버와 인슐레이터의 결합 시, 각 상의 코일(121, 122, 123)로부터 인출된 와이어 각각의 일 단이 각각 개재될 수 있다. 이 경우, 상기 복수의 슬릿(213a)을 통 해 각 상의 코일(121, 122, 123)로부터 인출된 와이어 각각의 일 단의 절연막이 제거될 수 있다. 일 실시예에서, 커넥터 연결부는 스테이터 커버의 일측에 마련될 수 있다. 일 실시예에서, 커넥터 연결부는 제1 바디부로부터 방사 방향으로 연장 형성될 수 있다. 일 실시예에서, 커넥터 연결부는 상기 커넥터 연결부의 상면으로부터 함몰 형성된 리드 와이어 수용 부를 포함할 수 있다. 일 실시예에서, 리드 와이어 수용부에는 후술하는 전원 커넥터의 리드 와이어 각각의 일단부(231a)가 수용될 수 있다. 일 실시예에서, 리드 와이어 수용부는 리드 와이어 를 구성하는 각각의 리드 와이어가 수용되도록, 상기 각각의 리드 와이어에 대응하는 공간으로 구획될 수 있다. 일 실시예에서, 커넥터 연결부에는 전원 커넥터의 각 리드 와이어의 일단부(231a)를 고정하는 복수의 제2 전선 연결단자가 배치될 수 있다. 일 실시예에서, 복수의 제2 전선 연결단자는 리드 와 이어 수용부의 일 측에서 리드 와이어 수용부에 수용된 각 리드 와이어의 일단부(231a)를 고정시킬 수 있다. 일 실시예에서, 제2 단자 수용부는 제1 바디부의 배면에 배치될 수 있다. 일 실시예에서, 제2 단자 수용부는 제1 바디부의 배면으로부터 하측으로 연장 형성될 수 있다. 일 실시예에서, 제2 단자 수 용부는 상측이 개방되며, 제2 단자 수용부는 개방된 상측을 통해 커넥터 연결부의 리드 와이 어 수용부와 연통될 수 있다. 또한, 제2 단자 수용부의 개방된 상측을 통해 제2 전선 연결단자 가 제2 단자 수용부 내부에 수용될 수 있다. 일 실시예에서, 제2 단자 수용부는 방사상 내측 을 향한 내측부와 방사상 외측을 향한 외측부를 가질 수 있다. 일 실시예에서, 내측부와 외측부 각각에는 절개 형성된 복수의 슬릿(2122a)이 마련될 수 있다. 일 실시예에서, 복수의 슬릿(2122a)에는, 스테이터 커버와 스테이터의 인슐레이터 결합 시, 각 상의 코일(121, 122, 123)으로부터 인출된 와이어 각각의 일 단 이 각각 개재될 수 있다. 이 경우, 전원 커넥터의 각 리드 와이어와 스테이터의 각 코일 이 전기적으로 연결될 수 있다. 일 실시예에서, 복수의 제2 전선 연결단자 각각은 리드 와이어 수용부의 각 리드 와이어의 일 단부(231a)가 결합되는 제1 파트와, 상기 제1 파트로부터 수직 방향으로 벤딩된 뒤 하측으로 연장 된 제2 파트를 포함할 수 있다. 일 실시예에서, 제2 전선 연결단자의 제2 파트는 제2 단자 수용부에 수용될 수 있다. 일 실시예에서, 제2 전선 연결단자는, 전도성 물질(예: 메탈(metal))로 구성될 수 있다. 일 실시예에서, 제2 전선 연결단자의 제2 파트 양측부에는 절개 형성된 복수의 슬릿(2142a)이 마련 될 수 있다. 일 실시예에서, 복수의 슬릿(2142a)에는, 스테이터 커버와 인슐레이터의 결합 시, 각 상의 코일(121, 122, 123)로부터 인출된 와이어 각각의 일 단이 각각 개재될 수 있다. 이 경우, 상기 복수의 슬릿(2142a)을 통해 각 상의 코일(121, 122, 123)로부터 인출된 와이어 각각의 일 단의 절연막이 제거될 수 있 다. 일 실시예에서, 제2 전선 연결단자를 통하여, 제2 전선 연결단자의 제2 파트에 의해 고정된, 코일로부터 연장된 각 와이어가 제2 전선 연결단자의 제1 파트에 의해 고정된 전원 커넥터 의 각 리드 와이어와 연결될 수 있다. 일 실시예에서, 스테이터 커버의 제2 커버 바디는 제2 바디부와, 커넥터 고정부를 포함할 수 있다. 일 실시예에서, 제2 바디부는, 실질적으로 원호(arc) 형상을 가질 수 있다. 일 실시예에서, 제2 바디부에는, 본 도면에서 구체적으로 도시되지 않았지만, 전술한 제1 바디부의 평탄부(211a) 상면에 형성된 복수의 끼움 홀 각각에 대응하는 지점에서, 상기 제2 바디부의 배면으 로부터 돌출 형성되는 복수의 끼움 돌기(미도시)가 마련될 수 있다. 일 실시예에서, 커넥터 고정부는 제2 바디부의 일단에 마련될 수 있다. 일 실시예에서, 커넥터 고정 부는 제2 바디부의 일단으로부터 방사 방향으로 연장 형성될 수 있다. 상기 커넥터 고정부의 구체적인 구조 및 기능에 대해서는 도 7을 참고하여 추후 더 자세히 설명하도록 한다. 일 실시예에서, 스테이터 커버의 전원 커넥터는 리드 와이어 및 터미널 블록을 포함할 수 있다. 일 실시예에서, 리드 와이어는 일단부(231a)가 제1 커버 바디의 커넥터 연결부에 연결되며, 타 단부가 터미널 블록에 연결될 수 있다. 일 실시예에서, 리드 와이어는 복수의 와이어로 구성될 수 있다. 예를 들어, 리드 와이어는, 3상의 교류 전원을 인가 받도록, 세 개의 와이어로 구성될 수 있다. 이 경우, 리드 와이어의 각각의 와이어의 일단부는 복수의 제2 전선 연결단자 각각에 결합 고정될 수 있다. 일 실시예에서, 터미널 블록은 외부 전원과 연결되도록 구성될 수 있다. 구체적으로 도시되지는 않았으나, 예를 들어, 터미널 블록의 내부에는 각 리드 와이어의 타단부(231b)가 고정 배치될 수 있 다. 도 5는, 일 실시예에 따른 스테이터 커버와 스테이터가 결합되는 과정을 나타내는 도면이다. 도 6은, 도 4의 A 부분과 B 부분 각각에서 코일의 결선 상태를 나타내는 확대도이다. 구체적으로, 도 6의 (a)는 스테이터 커버의 제2 단자 수용부 내부에 수용된 제2 전선 연결단자(21 4)에 각 상의 코일(121, 122, 123)의 일단부가 개재된 모습을 나타내는 도면이며, 도 6의 (b)는 스테이터 커버 의 제1 단자 수용부 내부에 수용된 제1 전선 연결단자에 각 상의 코일(121, 122, 123)의 타단 부가 개재된 모습을 나타내는 도면이다. 도 5를 참고하면, 스테이터의 상측에서 하측으로 스테이터 커버가 압착됨에 따라 스테이터와 스 테이터 커버가 결합될 수 있다. 구체적으로, 스테이터의 인슐레이터의 상부(예: 제1 인슐레이 터)에 마련된 제1 단자 홈, 제2 단자 홈 및 복수의 결합 홈 각각에 스테이터 커버의 배면에 마련된 제1 단자 수용부, 제2 단자 수용부 및 복수의 결합 돌기가 삽입됨에 따라, 스 테이터와 스테이터 커버가 일체로 결합될 수 있다. 스테이터와 스테이터 커버 결합 시, 인슐레이터의 제1 단자 홈에 고정된 각 상의 코일 (121, 122, 123)들은, 도 6의 (a)에 도시된 바와 같이, 각 상의 코일들에 대응하는 제1 단자 수용부 내부 에 수용된 제1 전선 연결단자의 각 슬롯(213a) 각각에 개재될 수 있다. 이 경우, 각 상의 코일들(121, 122, 123)의 일단부들은 상기 제1 전선 연결단자를 통해 하나의 점(예로 들어, 중성점)에서 전기적으로 연 결될 수 있다. 또한, 스테이터와 스테이터 커버 결합 시, 인슐레이터의 제2 단자 홈에 고정된 각 상의 코 일(121, 122, 123)들은, 도 6의 (b)에 도시된 바와 같이, 각 상의 코일들에 대응하는 제2 단자 수용부 내 부에 수용된 각각의 제2 전선 연결단자의 각 슬롯(2142a)에 개재될 수 있다. 이 경우, 각 상의 코일들 (121, 122, 123)의 타단부들은 상기 복수의 제2 전선 연결단자를 통해 전원 커넥터와 전기적으로 연 결됨에 따라, 코일은 외부 전원으로부터 전원을 인가 받을 수 있다. 이와 같이, 스테이터 커버에 제1 전선 연결단자, 복수의 제2 전선 연결단자 및 전원 커넥터 가 일체로 구비됨에 따라, 제1 스테이터와 스테이터 커버 결합 시, 하나의 압착 동작을 통해 코 일이 결선(예: Y 결선)되어 모터의 조립 공정이 단순해질 수 있다. 도 7은, 도 2에 도시된 C 부분에 포함된 커넥터 고정부의 예시적 형상과 커넥터 고정부에 인입되기 전의 전원 커넥터의 터미널 블록의 구성을 나타내는 도면이다.도 7을 참고하면, 일 실시예에 따른 전원 커넥터의 터미널 블록은 상기 터미널 블록의 실질적인 외관을 형성하는 블록 하우징과, 상기 블록 하우징의 양 측면으로부터 양 옆으로 돌출 형성된 한 쌍의 고정 돌기를 포함할 수 있다. 일 실시예에서, 블록 하우징의 배면에는 상기 배면으로부터 함몰 형성된 스토퍼 홈(도 4의 2323)이 마련 될 수 있다. 일 실시예에서, 스토퍼 홈은 상기 블록 하우징의 끝단으로부터 상기 블록 하우징 의 길이 방향을 따라 연장 형성될 수 있다. 일 실시예에 따른 스테이터 커버의 제2 커버 바디에는 모터의 조립 공정 시 전원 커넥터를 고정 시키기 위한 커넥터 고정부가 마련될 수 있다. 일 실시예에서, 커넥터 고정부는 상기 커넥터 고정부의 양 측단 각각에 마련되는 한 쌍의 고정 리브 를 포함할 수 있다. 일 실시예에서, 한 쌍의 고정 리브는, 커넥터 고정부에 터미널 블록이 인입된 경우, 인입된 터 미널 블록의 양측 적어도 일부를 둘러싸도록 구성될 수 있다. 예를 들어, 한 쌍의 고정 리브 각각 은 터미널 블록이 커넥터 고정부에 인입되는 경우, 터미널 블록의 양 측에 배치된 한 쌍의 고정 돌기 각각을 둘러쌀 수 있다. 일 실시예에서, 한 쌍의 고정 리브의 각각은, 커넥터 고정부의 가장자리로부터 상측으로 연장된 제1 파트와, 상기 제1 파트로부터 벤딩되어 내측으로 연장된 제 2 파트를 포함할 수 있다. 일 실시예에서, 한 쌍의 고정 리브 각각은 커넥터 고정부에 터미널 블록 인입 시, 터미널 블록 의 인입을 가이드하기 위한 가이드면을 포함할 수 있다. 예를 들어, 가이드면은 한 쌍의 고정 리브 각각의 내측면 입구단에서 모따기 가공되어 형성될 수 있다. 일 실시예에서, 커넥터 고정부의 상면에는 터미널 블록의 인입 깊이를 제한하는 스토퍼가 마련 될 수 있다. 일 실시예에서, 스토퍼는 커넥터 고정부의 외측단에 인접하게 배치될 수 있다. 일 실 시예에서, 스토퍼는 한 쌍의 고정 리브 사이에 배치될 수 있다. 일 실시예에서, 스토퍼는 커넥터 고정부의 상면으로부터 소정 높이 돌출 형성될 수 있다. 일 실시예에서, 스토퍼는, 커넥터 고정부에 터미널 블록이 인입된 경우, 터미널 블록의 배면에 마련된 스토퍼 홈에 삽입될 수 있다. 이 경우, 터미널 블록의 인입 과정에서, 스토퍼가 터미널 블록의 스토퍼 홈의 내측면(2323a)에 접촉됨에 따라 터미널 블록의 인입 깊이가 제한될 수 있다. 터미널 블록의 표면에는, 터미널 블록 내부에 배치된 각 리드 와이어와 연통되는 복수의 핀 홀 (232h)이 마련될 수 있다. 이 경우, 각 리드 와이어는 상기 복수의 핀 홀(232h)을 통해 외부 전원에 전기 적으로 연결될 수 있고, 이로써 외부 전원이 스테이터의 코일에 인가될 수 있다. 일 실시예에서, 커넥터 고정부에 인입된 경우, 상기 한 쌍의 고정 리브 구조 사이에서 터미널 블록 의 상면은 노출될 수 있다. 이 경우, 터미널 블록의 상면에 마련된 핀 홀(232h) 또한 외부로 노출될 수 있다. 따라서, 제조 공정 중에 스테이터의 전기적 특성을 평가하고자 할 경우 터미널 블록을 별 도로 분리하지 않아도 되어 작업자의 작업 편의성이 향상될 수 있다. 도 8은, 일 실시예에 따른 전원 커넥터의 터미널 블록이 스테이터 커버의 커넥터 고정부에 인입/인출되는 동작 을 설명하기 위한 도면이다. 구체적으로, 도 8의 (a)는 전원 커넥터의 터미널 블록이 스테이터 커버의 커넥터 고정부에 인입되는 동작을 설 명하는 도면이며, 도 8의 (b)는 전원 커넥터의 터미널 블록이 스테이터 커버의 커넥터 고정부로부터 인출되는 동작을 설명하는 도면이다. 도 8의 (a)를 참고하면, 전원 커넥터의 터미널 블록은 커넥터 고정부에 마련된 한 쌍의 고정 리 브의 내측면을 따라 커넥터 고정부에 인입될 수 있다. 전원 커넥터의 터미널 블록이 커넥 터 고정부에 인입되는 도중, 터미널 블록의 스토퍼 홈의 내측면에 커넥터 고정부에 마련 된 스토퍼가 접촉되면 더 이상 터미널 블록의 인입이 제한되며 터미널 블록의 인입이 완료된다. 이에 따라, 전원 커넥터는 커넥터 고정부를 통해 스테이터 커버에 고정될 수 있다. 도 8의 (b)를 참고하면, 상술한 도 8의 (a)에서의 전원 커넥터의 인입 과정의 반대 과정으로, 커넥터 고정 부에 인입된 터미널 블록을 인입 방향과 반대 방향으로 소정의 힘으로 당김에 따라 커넥터 고정부로부터 터미널 블록이 인출될 수 있다. 도 9는, 일 실시예에 따른 모터의 조립 공정을 개략적으로 설명하는 흐름도이다. 도 10은, 일 실시예에 따른 모터의 조립 공정 순서도이다. 도 9 및 도 10을 참고하면, 도 10의 (a)에 도시된 바와 같이, 스테이터의 상측에서 하측으로 스테이터 커 버를 압착함에 따라 스테이터 와 스테이터 커버가 일체로 결합될 수 있다(도 9의 910). 일 실 시예에서는, 이러한 간단한 공정에 의해, 스테이터의 인슐레이터에 마련된 제1 단자 홈과 제2 단자 홈에서 각 상의 코일이 결선될 수 있다. 이후, 도 10의 (b)에 도시된 바와 같이, 모터의 조립 공정 중 전원 커넥터와 다른 부품 간의 간섭을 방지 하기 위해, 전원 커넥터의 터미널 블록을 스테이터 커버에 마련된 커넥터 고정부에 인입하 여 스테이터 커버에 전원 커넥터를 고정시킬 수 있다(도 9의 920). 이후, 도 10의 (c)에 도시된 바와 같이, 스테이터 어셈블리에 압축기의 구동 유닛(40a)을 조립할 수 있다(도 9 의 930). 이후, 도 10의 (d)에 도시된 바와 같이, 커넥터 고정부로부터 터미널 블록을 인출한 뒤, 전원 커넥터 를 압축기의 전원 터미널(40b)에 접속시켜, 스테이터의 코일에 외부로부터 전원을 인가 시 킬 수 있다(도 9의 940). 도 11은, 일 실시예에 따른 냉장고의 전방 사시도이다. 도 12는, 일 실시예에 따른 냉장고의 후방 사시도이다. 구체적으로, 도 12는 후방 커버가 분리된 상태를 나타내는 냉장고의 후방 사시도이다. 본 개시의 일 실시 예에 따른 냉장고는 본체를 포함할 수 있다. “본체”는 내상과, 내상의 외측에 배치되는 외상과, 내상과 외상의 사이에 마련되는 단열재를 포함할 수 있다. “내상”은 저장실을 형성하는 케이스(case), 플레이트(plate), 패널(panel) 또는 라이너(liner) 중 적어도 하나를 포함할 수 있다. 내상은 하나의 몸체로 형성될 수도 있으며 또는 복수의 플레이트들이 조립 되어 형성될 수 있다. “외상”은 본체의 외관을 형성할 수 있으며, 내상과 외상의 사이에 단열재가 배치되도록 내상 의 외측에 결합될 수 있다. “단열재”는 저장실 내부의 온도가 저장실 외부 환경에 의해 영향을 받지 않고 설정된 적정 온도로 유 지될 수 있도록 저장실 내부와 저장실 외부를 단열할 수 있다. 일 실시예에 따르면 단열재는 발포 단열 재를 포함할 수 있다. 내상과 외상의 사이에 폴리우레탄과 발포제가 혼합된 우레탄폼을 주입 및 발포시 킴으로써 발포 단열재를 성형할 수 있다. 일 실시예에 따르면 단열재는 발포 단열재 이외에 추가로 진공 단열재를 포함하거나, 단열재는 발포 단열재 대 신 진공 단열재만으로 구성될 수도 있다. 진공 단열재는 심재와, 심재를 수용하고 내부를 진공 또는 진공에 가 까운 압력으로 밀봉하는 외피재를 포함할 수 있다. 다만, 단열재는 상기한 발포 단열재 또는 진공 단열재에 한 정되는 것은 아니고 단열을 위해 사용될 수 있는 다양한 소재를 포함할 수 있다. “저장실”은 내상에 의해 한정되는 공간을 포함할 수 있다. 저장실은 저장실에 대응되는 공 간을 한정하는 내상을 더 포함할 수 있다. 저장실에는 식품, 약품, 화장품 등 다양한 물품이 저장될 수 있으며, 저장실은 물품을 출납하기 위해 적어도 일측이 개방되도록 형성될 수 있다. 냉장고는 한 개 또는 그 이상의 저장실을 포함할 수 있다. 냉장고에 2 개 이상의 저장실이 형성 될 때 각각의 저장실은 서로 다른 용도를 가질 수 있으며 서로 다른 온도로 유지될 수 있다. 이를 위해 각 각의 저장실은 단열재를 포함하는 격벽에 의해 서로 구획될 수 있다. 저장실은 용도에 따라 적정한 온도 범위에서 유지되도록 마련될 수 있으며, 그 용도 및/또는 온도 범위에 따라 구분되는“냉장실”, “냉동실”또는 “변온실”을 포함할 수 있다. 냉장실은 물품을 냉장 보관하기에 적 정한 온도로 유지될 수 있고, 냉동실은 물품을 냉동 보관하기에 적정한 온도로 유지될 수 있다. “냉장”은 물 품을 얼지 않는 한도에서 차갑게 냉각하는 것을 의미할 수 있으며, 일례로 냉장실은 섭씨 0도에서 섭씨 영상 7 도 범위에서 유지될 수 있다. “냉동”은 물품을 얼리거나 언 상태로 유지되도록 냉각하는 것을 의미할 수 있으며, 일례로 냉동실은 섭씨 영하 20도 내지 섭씨 영하 1도 범위에서 유지될 수 있다. 변온실은 사용자의 선택 또 는 이와 무관하게 냉장실 또는 냉동실 중 어느 하나로 사용될 수 있다. 저장실은 “냉장실”, “냉동실” 및 “변온실” 등의 명칭 이외에도 “야채실”, “신선실”, “쿨링실” 및 “제빙실” 등 다양한 명칭으로 불릴 수 있으며, 이하에서 사용되는 “냉장실”, “냉동실” 및 “변온실” 등의 용어는 각각 대응되는 용도 및 온도 범위를 갖는 저장실을 포괄하는 의미로 이해되어야 할 것이다. 일 실시예에 따르면 냉장고는 저장실의 개방된 일측을 개폐하도록 구성되는 적어도 하나의 도어를 포함할 수 있다. 도어는 한 개 또는 그 이상의 저장실 각각을 개폐하도록 구비되거나, 도어 하나가 복수의 저장실을 개폐하도록 구비될 수 있다. 도어는 본체의 전면에 회전 또는 슬라이딩 가능하게 설치될 수 있다. “도어”는 도어가 닫힐 시에 저장실을 밀폐하도록 구성될 수 있다. 도어는 도어가 닫힐 시에 저장실을 단열하도록 본체와 마찬가지로 단열재를 포함할 수 있다. 일 실시예에 따르면 도어는 도어의 전면을 형성하는 도어 외판과, 도어의 후면을 형성하고 저장실 을 마주보는 도어 내판과, 상부 캡과, 하부 캡 및 이들의 내부에 마련되는 도어 단열재를 포함할 수 있다. 도어 내판의 테두리에는 도어가 닫혔을 때 본체의 전면에 밀착됨으로써 저장실을 밀폐하는 가스켓 이 마련될 수 있다. 도어 내판은 물품을 보관할 수 있는 도어 바스켓이 장착되도록 후방으로 돌출되는 다이 크(dyke)를 포함할 수 있다. 일 실시예에 따르면 도어는 도어 바디와, 도어 바디의 전측에 분리 가능하게 결합되고 도어의 전면을 형성하는 전방 패널을 포함할 수 있다. 도어 바디는 도어 바디의 전면을 형성하는 도어 외판, 도어 바디의 후면 을 형성하고 저장실을 마주보는 도어 내판, 상부 캡, 하부 캡 및 이들의 내부에 마련되는 도어 단열재를 포 함할 수 있다. 냉장고는 도어 및 저장실의 배치에 따라 프렌치 도어 타입(French Door Type), 사이드 바이 사이드 타입(Side-by-side Type), BMF(Bottom Mounted Freezer), TMF(Top Mounted Freezer) 또는 1도어 냉장고 등 으로 구별될 수 있다. 일 실시예에 따르면 냉장고는 저장실에 냉기를 공급하도록 마련되는 냉기 공급 장치를 포함할 수 있다. “냉기 공급 장치”는 냉기를 생성하고 냉기를 안내하여 저장실을 냉각할 수 있는 기계, 기구, 전자 장치 및/또는 이들을 조합한 시스템을 포함할 수 있다. 일 실시예에 따르면 냉기 공급 장치는 냉매의 압축, 응축, 팽창 및 증발 과정을 포함하는 냉동 사이클을 통해 냉기를 생성할 수 있다. 이를 위해 냉기 공급 장치는 냉동 사이클을 구동시킬 수 있는 압축기, 응축기, 팽 창 장치 및 증발기를 갖는 냉동 사이클 장치를 포함할 수 있다. 일 실시예에 따르면 압축기는 냉매를 고온 고압 상태로 압축할 수 있다. 예를 들어, 압축기는 외부로 부터 전기 에너지를 공급받아 회전하는 모터의 회전력을 이용하여 기상의 냉매를 고온 고압으로 압축할 수 있다. 압축기는 능력 가변형 압축기이며, 구동 제어 명령에 따라 주파수를 변경함으로써 용량을 가변할 수 있다. 일 실시예에서, 압축기는, 도 1 내지 도 8을 참조하여 전술한 구성의 스테이터 어셈블리를 이용한 모터 를 구비한 밀폐형 왕복동 압축기일 수 있으나, 본 개시가 이에 제한되는 것은 아니다. 일 실시예에 따르면 압축기는 본체 후방에 마련된 기계실 내부에 배치될 수 있다. 압축기는, 도 10에 도시된 바와 같이, 전원 커넥터가 커넥터 고정부에 수용된 상태의 스테이터 어셈블리에 압축 기의 구동 유닛(40a)을 조립한 뒤, 스테이터 어셈블리의 전원 커넥터를 커넥터 고정부로부터 인출하 여 압축기의 전원 터미널(40b)에 접속시킴으로써 냉장고 외부로 공급된 외부 전원을 스테이터 어셈블리 에 공급할 수 있다. 이와 같은 일련의 모터(또는, 압축기)의 조립 공정을 통해, 조립 공정 시 스테이터 어셈블 리의 전원 커넥터와 타 조립 부품 간의 간섭이 감소하게 됨에 따라, 상기 스테이터 어셈블리의 전원 커넥터의 손상이 방지됨과 동시에 작업자의 작업 편의성이 향상될 수 있다. 일 실시예에 따르면 냉기 공급 장치는 열전 소자와 같은 반도체를 포함할 수 있다. 열전 소자는 펠티어 효과를 통한 발열 및 냉각 작용으로 저장실을 냉각할 수 있다. 일 실시예에 따르면 냉장고는 냉기 공급 장치에 속한 적어도 일부 부품들이 배치되도록 마련되는 기계실(2 2)을 포함할 수 있다.“기계실”은 기계실에 배치되는 부품에서 발생되는 열이 저장실에 전달되는 것을 방지하기 위해 저장실과 구획 및 단열되도록 마련될 수 있다. 기계실 내부에 배치된 부품을 방열하도록 기계실 내 부는 본체의 외부와 연통되도록 구성될 수 있다. 일 실시예에서, 기계실은 본체의 후방 하측에 마 련될 수 있다. 일 실시예에서, 기계실은 일측(예: 후방)이 개방되어 냉장고 외부와 연통될 수 있다. 일 실시예에서, 기계실의 개방된 일측은 후방 패널에 의해 커버될 수 있다. 일 실시예에서, 후방 패널 에는 기계실 내의 공기와 냉장고 외부의 공기가 연통되도록 하는 적어도 하나의 연통 홀이 마련될 수 있다. 본 도면에서 후방 패널은 별개의 구성으로 도시되어 있으나, 본 개시가 이에 제한되는 것은 아니며, 상기 후방 패널은 냉장고의 외상과 일체로 형성되거나, 상기 외상에 포함되는 구성으로 마련될 수도 있다. 일 실시예에 따르면 냉장고는 물 및/또는 얼음을 제공하도록 도어에 마련되는 디스펜서를 포함할 수 있 다. 디스펜서는 사용자가 도어를 개방하지 않고 접근 가능하도록 도어에 마련될 수 있다. 일 실시예에 따르면 냉장고는 얼음을 생성하도록 마련되는 제빙 장치를 포함할 수 있다. 제빙 장치는 물을 저수하는 제빙 트레이와, 제빙 트레이로부터 얼음을 분리시키는 이빙 장치와, 제빙 트레이에서 생성된 얼음을 저장하는 아이스 버킷을 포함할 수 있다. 일 실시예에 따르면 냉장고는 냉장고를 제어하기 위한 제어부를 포함할 수 있다. “제어부”는 냉장고를 제어하기 위한 프로그램 및/또는 데이터를 저장 또는 기억하는 메모리와, 메모리에 기억된 프로그램 및/또는 데이터에 따라 냉기 공급 장치 등을 제어하기 위한 제어 신호를 출력하는 프로세서를 포함할 수 있다. 메모리는 냉장고의 동작에 필요한 다양한 정보, 데이터, 명령어, 프로그램 등을 저장 또는 기록한다. 메모리 는 냉장고에 포함된 구성들을 제어하기 위한 제어 신호를 생성하는 중에 발생하는 임시 데이터를 기억할 수 있다. 메모리는 휘발성 메모리 또는 비휘발성 메모리 중 적어도 하나 또는 이들의 조합을 포함할 수 있다. 프로세서는 냉장고 전반의 동작을 제어한다. 프로세서는 메모리에 저장된 프로그램을 실행하여, 냉장고의 구성 요소들을 제어할 수 있다. 프로세서는 인공지능 모델의 동작을 수행하는 별도의 NPU를 포함할 수 있다. 또 한 프로세서는 중앙 처리부, 그래픽 전용 프로세서(GPU) 등을 포함할 수 있다. 프로세서는 냉기 공급 방치의 동 작을 제어하기 위한 제어 신호를 생성할 수 있다. 예를 들어, 프로세서는 온도 센서로부터 저장실의 온도 정보를 수신하고, 저장실의 온도 정보에 기초하여 냉기 공급 장치의 동작을 제어하기 위한 냉각 제어 신호 를 생성할 수 있다. 또한, 프로세서는 메모리에 기억/저장된 프로그램 및/또는 데이터에 따라 사용자 인터페이스의 사용자 입력을 처리하고, 사용자 인터페이스의 동작을 제어할 수 있다. 사용자 인터페이스는 입력 인터페이스와 출력 인터페이 스를 이용하여 제공될 수 있다. 프로세서는 사용자 인터페이스로부터 사용자 입력을 수신할 수 있다. 또한, 프 로세서는 사용자 입력에 응답하여 사용자 인터페이스에 영상을 표시하기 위한 표시 제어 신호 및 영상 데이터를 사용자 인터페이스에 전달할 수 있다. 프로세서와 메모리는 일체로 마련되거나 또는 별도로 마련될 수 있다. 프로세서는 하나 이상의 프로세서를 포함 할 수 있다. 예를 들어, 프로세서는 메인 프로세서와 적어도 하나의 서브 프로세서를 포함할 수 있다. 메모리는 하나 이상의 메모리를 포함할 수 있다. 일 실시예에 따르면 냉장고는 냉장고에 포함된 구성들을 모두 제어하는 프로세서 및 메모리를 포함하고 냉장고의 구성들을 개별 제어하는 복수의 프로세서들과 복수의 메모리들을 포함할 수 있다. 예를 들어, 냉장 고는 온도센서의 출력에 따라 냉기 공급 장치의 동작을 제어하는 프로세서 및 메모리를 포함할 수 있다. 또 한, 냉장고는 사용자 입력에 따라 사용자 인터페이스의 동작을 제어하는 프로세서와 메모리를 별도로 구비할 수 있다. 통신모듈은 주변의 접속 중계기(AP: Access Point)를 통해 서버, 모바일 장치, 다른 가전 기기 등의 외부 장치 와 통신할 수 있다. 접속 중계기(AP)는 냉장고 또는 사용자 기기가 연결된 지역 네트워크(LAN)를 서버가 연 결된 광역 네트워크(WAN)에 연결시킬 수 있다. 냉장고 또는 사용자 기기는 광역 네트워크(WAN)를 통해 서버 에 연결될 수 있다. 입력 인터페이스는 키, 터치스크린, 마이크로폰 등을 포함할 수 있다. 입력 인터페이스는 사용자 입력을 수신하 여 프로세서로 전달할 수 있다.출력 인터페이스는 디스플레이, 스피커 등을 포함할 수 있다. 출력 인터페이스는 프로세서에서 생성된 다양한 알림, 메시지, 정보 등을 출력할 수 있다."}
{"patent_id": "10-2023-0042996", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도면의 설명과 관련하여, 동일 또는 유사한 구성요소에 대해서는 동일 또는 유사한 참조 부호가 사용될 수 있다. 도 1a는, 일 실시예에 따른 모터에 구비된 스테이터 어셈블리의 사시도이다. 도 1b는, 도 1a에 도시된 스테이터 어셈블리의 일부 구성요소를 분해한 분해 사시도이다. 도 2는, 일 실시예에 따른 스테이터 커버를 상측에서 바라본 사시도이다. 도 3은, 일 실시예에 따른 스테이터 커버의 분해 사시도이다. 도 4는, 일 실시예에 따른 스테이터 커버를 하측에서 바라본 사시도이다. 도 5는, 일 실시예에 따른 스테이터 커버와 스테이터가 결합되는 과정을 나타내는 도면이다. 도 6은, 도 4의 A 부분과 B 부분 각각에서 코일의 결선 상태를 나타내는 확대도이다. 도 7은, 도 2에 도시된 C 부분에 포함된 커넥터 고정부의 예시적 형상과 커넥터 고정부에 인입되기 전의 전원 커넥터의 터미널 블록의 구성을 나타내는 도면이다. 도 8은, 일 실시예에 따른 전원 커넥터의 터미널 블록이 스테이터 커버의 커넥터 고정부에 인입/인출되는 동작 을 설명하기 위한 도면이다. 도 9는, 일 실시예에 따른 모터의 조립 공정을 개략적으로 설명하는 흐름도이다. 도 10은, 일 실시예에 따른 모터의 조립 공정 순서도이다. 도 11은, 일 실시예에 따른 냉장고의 전방 사시도이다. 도 12는, 일 실시예에 따른 냉장고의 후방 사시도이다."}
