{"patent_id": "10-2019-0103878", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0023239", "출원번호": "10-2019-0103878", "발명의 명칭": "복수의 프로세서를 이용하여 신경망 모델을 처리하는 전자 장치 및 그 동작 방법", "출원인": "삼성전자주식회사", "발명자": "사니 마나스"}}
{"patent_id": "10-2019-0103878", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에서 복수의 프로세서를 이용하여 신경망 모델을 처리하는 방법에 있어서,상기 신경망 모델에 포함된 복수 개의 레이어를 적어도 하나의 슬라이스에 할당하는 단계;상기 적어도 하나의 슬라이스 각각에 대한 상기 복수의 프로세서 각각의 처리 시간에 기초하여, 상기 복수의 프로세서에 상기 적어도 하나의 슬라이스를 할당하는 단계; 및상기 할당된 결과에 기초하여, 상기 복수의 프로세서를 이용하여 상기 신경망 모델을 처리하는 단계를포함하고,상기 처리 시간은, 이전 슬라이스를 처리하는 이전 프로세서로부터, 현재 프로세서가 현재 슬라이스를 처리하는데 필요한 데이터를 수신하는데 걸리는 스위칭 시간을 포함하는, 방법."}
{"patent_id": "10-2019-0103878", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 복수 개의 레이어 중 적어도 하나의 레이어를 슬라이스 포인트로 결정함으로써, 상기 복수 개의 레이어가상기 적어도 하나의 슬라이스에 할당되고,상기 슬라이스 포인트는, 상기 복수 개의 레이어 각각이, 복수 개의 레이어들이 분기되는 지점인지 여부, 복수개의 레이어들이 결합되는 지점인지 여부, 동일한 프로세서에서 처리 가능한 작업을 포함하는 지 여부, 및 높은정확도가 요구되는 작업을 포함하는 지 여부 중 적어도 하나에 기초하여, 결정되는, 방법."}
{"patent_id": "10-2019-0103878", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 적어도 하나의 슬라이스는, 서로 다른 슬라이스 및 프로세서의 조합을 나타내는 복수 개의 노드가 상기 적어도 하나의 슬라이스의 배열 순서에 따라 연결됨으로써 생성된 복수 개의 경로 중 처리 시간의 총합이 가장 작은 경로에 기초하여, 상기 복수의 프로세서에 할당되는, 방법."}
{"patent_id": "10-2019-0103878", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 복수 개의 레이어 중 어느 하나의 레이어에 입력되는 복수 개의 입력 데이터는, 상기 레이어에서 상기 복수 개의 입력 데이터 개수만큼의 채널 별로 순차적으로 처리되고,상기 레이어의 복수 개의 채널에 대해, 상기 복수 개의 채널 중 제1 채널에서 작업을 처리하기 위해 필요한 크기만큼의 메모리가 할당되는, 방법."}
{"patent_id": "10-2019-0103878", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 복수의 프로세서 중 제1 프로세서에 할당된 적어도 하나의 슬라이스에 포함된 적어도 하나의 레이어를 식별하는 단계;상기 식별된 레이어에 입력되는 데이터, 출력되는 데이터 및 상기 식별된 레이어의 내부에서 임시 저장되는 데이터 중 적어도 하나의 데이터를 각각 나타내는 적어도 하나의 블롭을 식별하는 단계; 및상기 식별된 블롭의 데이터를 저장하기 위한 메모리를 할당하는 단계를 더 포함하는, 방법.공개특허 10-2020-0023239-3-청구항 6 제5항에 있어서, 상기 메모리를 할당하는 단계는상기 식별된 레이어의 처리 순서를 결정하는 단계; 및상기 결정된 처리 순서에 기초하여, 이전 블롭의 사용 구간이 현재 블롭의 데이터가 생성되기 전에 종료되는지여부를 판단함으로써, 상기 현재 블롭에 대한 메모리를 할당하는 단계를 포함하는, 방법."}
{"patent_id": "10-2019-0103878", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5항에 있어서, 상기 메모리를 할당하는 단계는동일한 메모리가 할당된 적어도 하나의 블롭의 데이터 크기 중 가장 큰 데이터 크기에 기초하여, 상기 메모리의크기를 결정하는 단계를 포함하는, 방법."}
{"patent_id": "10-2019-0103878", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "신경망 모델을 처리하는 전자 장치에 있어서,상기 신경망 모델을 저장하는 메모리;상기 신경망 모델에 포함된 복수 개의 레이어를 적어도 하나의 슬라이스에 할당하고, 상기 적어도 하나의 슬라이스 각각에 대한 복수의 프로세서 각각의 처리 시간에 기초하여, 상기 복수의 프로세서에 상기 적어도 하나의슬라이스를 할당하고, 상기 할당된 결과에 기초하여, 상기 신경망 모델을 처리하는 적어도 하나의 프로세서; 및상기 신경망 모델이 처리된 결과를 출력하는 출력부를 포함하고,상기 처리 시간은, 이전 슬라이스를 처리하는 이전 프로세서로부터, 현재 프로세서가 현재 슬라이스를 처리하는데 필요한 데이터를 수신하는데 걸리는 스위칭 시간을 포함하는, 전자 장치."}
{"patent_id": "10-2019-0103878", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서, 상기 복수 개의 레이어 중 적어도 하나의 레이어를 슬라이스 포인트로 결정함으로써, 상기 복수 개의 레이어가 상기 적어도 하나의 슬라이스에 할당되고,상기 슬라이스 포인트는, 상기 복수 개의 레이어 각각이, 복수 개의 레이어들이 분기되는 지점인지 여부, 복수개의 레이어들이 결합되는 지점인지 여부, 동일한 프로세서에서 처리 가능한 작업을 포함하는 지 여부, 및 높은정확도가 요구되는 작업을 포함하는 지 여부 중 적어도 하나에 기초하여, 결정되는, 전자 장치."}
{"patent_id": "10-2019-0103878", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에 있어서, 상기 적어도 하나의 슬라이스는, 서로 다른 슬라이스 및 프로세서의 조합을 나타내는 복수 개의 노드가 상기 적어도 하나의 슬라이스의 배열 순서에 따라 연결됨으로써 생성된 복수 개의 경로 중 처리 시간의 총합이 가장 작은 경로에 기초하여, 상기 복수의 프로세서에 할당되는, 전자 장치."}
{"patent_id": "10-2019-0103878", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제8항에 있어서,상기 복수 개의 레이어 중 어느 하나의 레이어에 입력되는 상기 복수 개의 입력 데이터는 상기 레이어에서 상기복수 개의 입력 데이터 개수만큼의 채널 별로 순차적으로 처리되고,상기 레이어의 복수 개의 채널에 대해, 상기 복수 개의 채널 중 제1 채널에서 작업을 처리하기 위해 필요한 크기만큼의 메모리가 할당되는, 전자 장치."}
{"patent_id": "10-2019-0103878", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제8항에 있어서, 상기 적어도 하나의 프로세서는상기 복수의 프로세서 중 제1 프로세서에 할당된 적어도 하나의 슬라이스에 포함된 적어도 하나의 레이어를 식공개특허 10-2020-0023239-4-별하고,상기 식별된 레이어에 입력되는 데이터, 출력되는 데이터 및 상기 식별된 레이어의 내부에서 임시 저장되는 데이터 중 적어도 하나의 데이터를 각각 나타내는 적어도 하나의 블롭을 식별하고,상기 식별된 블롭의 데이터를 저장하기 위한 메모리를 할당하는, 전자 장치."}
{"patent_id": "10-2019-0103878", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서, 상기 적어도 하나의 프로세서는상기 식별된 레이어의 처리 순서를 결정하고, 상기 결정된 처리 순서에 기초하여, 이전 블롭의 사용 구간이 현재 블롭의 데이터가 생성되기 전에 종료되는지 여부를 판단함으로써, 상기 현재 블롭에 대한 메모리를할당하는, 전자 장치."}
{"patent_id": "10-2019-0103878", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12항에 있어서, 상기 적어도 하나의 프로세서는동일한 메모리가 할당된 적어도 하나의 블롭의 데이터 크기 중 가장 큰 데이터 크기에 기초하여, 상기 메모리의크기를 결정하는, 전자 장치."}
{"patent_id": "10-2019-0103878", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제1항 내지 제7항 중 어느 한 항의 방법을 구현하기 위한 프로그램이 기록된 컴퓨터로 읽을 수 있는 기록 매체."}
{"patent_id": "10-2019-0103878", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "신경망 모델에 포함된 복수 개의 레이어를 적어도 하나의 슬라이스에 할당하고, 적어도 하나의 슬라이스 각각에 대한 복수의 프로세서 각각의 처리 시간에 기초하여, 복수의 프로세서에 적어도 하나의 슬라이스를 할당하고, 할 당된 결과에 기초하여, 복수의 프로세서를 이용하여 신경망 모델을 처리하고, 처리 시간은, 이전 슬라이스를 처 리하는 이전 프로세서로부터, 현재 프로세서가 현재 슬라이스를 처리하는데 필요한 데이터를 수신하는데 걸리는 스위칭 시간을 포함하는, 전자 장치에서 복수의 프로세서를 이용하여 신경망 모델을 처리하는 방법이 제공된다."}
{"patent_id": "10-2019-0103878", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는, 복수의 프로세서를 이용하여 신경망 모델을 처리하는 전자 장치 및 그 동작 방법에 관한 것이다."}
{"patent_id": "10-2019-0103878", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전자 장치는 신경망 모델 기반의 딥러닝 기술을 이용하여, 얼굴 인식, 음성 인식, 영상 처리 등을 수행하고, 그 결과를 사용자에게 제공할 수 있다. 전자 장치는 복수의 프로세서, 예를 들면, CPU(Central Processing Unit), GPU(Graphics Processing Unit), NPU(Neural Processing Unit), DSP(Digital Signal Processor) 등을 이용하여 신경망 모델을 처리할 수 있다. 전자 장치는, 신경망 모델을 구성하는 복수 개의 레이어들을 복수의 프로세서에 할당함으로써, 복수의 프로세서 를 이용하여 신경망 모델을 처리할 수 있다. 다만, 각각의 프로세서의 성능과 각각의 레이어의 특징에 따라 처리 속도 및 정확도가 서로 다를 수 있다. 따라 서, 복수의 프로세서의 처리 능력과 레이어의 특징에 기초하여, 각 프로세서가 처리할 신경망 모델의 레이어를 할당하는 방법이 요구되고 있다."}
{"patent_id": "10-2019-0103878", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시가 해결하고자 하는 과제는 전술한 문제를 해결하기 위한 것으로서, 복수의 프로세서를 이용하여 신경망 모델을 처리하는 전자 장치 및 그 동작 방법을 제공하기 위한 것이다. 또한, 상기 방법을 컴퓨터에서 실행시키기 위한 프로그램을 기록한 컴퓨터로 읽을 수 있는 기록매체를 제공하는 데 있다. 해결하려는 기술적 과제는 상기된 바와 같은 기술적 과제들로 한정되지 않으며, 또 다른 기술적 과제 들이 존재할 수 있다."}
{"patent_id": "10-2019-0103878", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본 개시의 제1 측면은, 신경망 모델에 포함된 복수 개 의 레이어를 적어도 하나의 슬라이스에 할당하는 단계; 상기 적어도 하나의 슬라이스 각각에 대한 상기 복수의프로세서 각각의 처리 시간에 기초하여, 상기 복수의 프로세서에 상기 적어도 하나의 슬라이스를 할당하는 단계; 및 상기 할당된 결과에 기초하여, 상기 복수의 프로세서를 이용하여 상기 신경망 모델을 처리하는 단계를 포함하는 전자 장치에서 복수의 프로세서를 이용하여 신경망 모델을 처리하는 방법을 제공할 수 있고, 상기 처 리 시간은, 이전 슬라이스를 처리하는 이전 프로세서로부터, 현재 프로세서가 현재 슬라이스를 처리하는데 필요 한 데이터를 수신하는데 걸리는 스위칭 시간을 포함한다. 또한, 본 개시의 제2 측면은, 신경망 모델을 저장하는 메모리; 상기 신경망 모델에 포함된 복수 개의 레이어를 적어도 하나의 슬라이스에 할당하고, 상기 적어도 하나의 슬라이스 각각에 대한 복수의 프로세서 각각의 처리 시간에 기초하여, 상기 복수의 프로세서에 상기 적어도 하나의 슬라이스를 할당하고, 상기 할당된 결과에 기초 하여, 상기 복수의 프로세서를 이용하여 상기 신경망 모델을 처리하는 적어도 하나의 프로세서; 및 상기 신경망 모델이 처리된 결과를 출력하는 출력부를 포함하고, 상기 처리 시간은, 이전 슬라이스를 처리하는 이전 프로세 서로부터, 현재 프로세서가 현재 슬라이스를 처리하는데 필요한 데이터를 수신하는데 걸리는 스위칭 시간을 포 함하는, 전자 장치를 제공할 수 있다. 또한, 본 개시의 제3 측면은, 제1 측면 또는 제2 측면의 방법을 수행하도록 하는 프로그램이 저장된 기록매체를 제공할 수 있다."}
{"patent_id": "10-2019-0103878", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "일 실시 예에 의하면, 복수의 프로세서를 이용하여 더 빠르고 정확도 높게 신경망 모델을 처리할 수 있다."}
{"patent_id": "10-2019-0103878", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본 발명의 실시예를 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관 계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\"되어 있는 경우도 포함한다. 또한 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아 니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 본 개시에 따른 인공지능과 관련된 기능은 프로세서와 메모리를 통해 동작된다. 프로세서는 하나 또는 복수의 프로세서로 구성될 수 있다. 이때, 하나 또는 복수의 프로세서는 CPU, AP, DSP(Digital Signal Processor) 등 과 같은 범용 프로세서, GPU, VPU(Vision Processing Unit)와 같은 그래픽 전용 프로세서 또는 NPU와 같은 인 공지능 전용 프로세서일 수 있다. 하나 또는 복수의 프로세서는, 메모리에 저장된 기 정의된 동작 규칙 또는 인 공지능 모델에 따라, 입력 데이터를 처리하도록 제어한다. 또는, 하나 또는 복수의 프로세서가 인공지능 전용 프로세서인 경우, 인공지능 전용 프로세서는, 특정 인공지능 모델의 처리에 특화된 하드웨어 구조로 설계될 수 있다. 기 정의된 동작 규칙 또는 인공지능 모델은 학습을 통해 만들어진 것을 특징으로 한다. 여기서, 학습을 통해 만 들어진다는 것은, 기본 인공지능 모델이 학습 알고리즘에 의하여 다수의 학습 데이터들을 이용하여 학습됨으로 써, 원하는 특성(또는, 목적)을 수행하도록 설정된 기 정의된 동작 규칙 또는 인공지능 모델이 만들어짐을 의미 한다. 이러한 학습은 본 개시에 따른 인공지능이 수행되는 기기 자체에서 이루어질 수도 있고, 별도의 서버 및/ 또는 시스템을 통해 이루어 질 수도 있다. 학습 알고리즘의 예로는, 지도형 학습(supervised learning), 비지도 형 학습(unsupervised learning), 준지도형 학습(semi-supervised learning) 또는 강화 학습(reinforcement learning)이 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은, 복수의 신경망 레이어들로 구성될 수 있다. 복수의 신경망 레이어들 각각은 복수의 가중치들 (weight values)을 갖고 있으며, 이전(previous) 레이어의 연산 결과와 복수의 가중치들 간의 연산을 통해 신경 망 연산을 수행한다. 복수의 신경망 레이어들이 갖고 있는 복수의 가중치들은 인공지능 모델의 학습 결과에 의 해 최적화될 수 있다. 예를 들어, 학습 과정 동안 인공지능 모델에서 획득한 로스(loss) 값 또는 코스트(cost) 값이 감소 또는 최소화되도록 복수의 가중치들이 갱신될 수 있다. 인공 신경망은 심층 신경망(DNN:Deep Neural Network)를 포함할 수 있으며, 예를 들어, CNN (Convolutional Neural Network), DNN (Deep Neural Network), RNN (Recurrent Neural Network), RBM (Restricted Boltzmann Machine), DBN (Deep Belief Network), BRDNN(Bidirectional Recurrent Deep Neural Network) 또는 심층 Q-네트워크 (Deep Q-Networks) 등이 있으나, 전술한 예에 한정되지 않는다. 이하 첨부된 도면을 참고하여 본 발명을 상세히 설명하기로 한다. 도 1은 일 실시 예에 의한 전자 장치에서 신경망 모델을 처리하는 일 예를 나타낸 도면이다. 도 1을 참조하면, 전자 장치는, 복수의 프로세서들(1310, 1320, 1330)을 포함하는 프로세서를 이용 하여 신경망 모델을 처리할 수 있다. 일 실시 예에 의하면, 전자 장치는 컴파일 단계 및 작업 수행 단계를 통해 복수의 프로세서를 이용하여, 신경망 모델을 처리할 수 있다. 예를 들면, 전자 장치는 복수의 프로세서들이 수행할 작업을 할당하 는 컴파일(compile) 단계와, 컴파일 단계에서의 할당 결과에 따라, 복수의 프로세서들을 이용하여 작업을 수행 하는 작업 처리 단계를 수행할 수 있다. 일 실시 예에 의한 컴파일 단계는, 상기 복수의 프로세서 중 적어도 하나의 프로세서에 의해 수행될 수 있다. 일 실시 예에 의한 컴파일 단계는, 복수의 프로세서들이 수행할 작업을 할당하는 동작뿐만 아니라, 작업을 수행 하는데 이용되는 데이터를 저장하기 위한 메모리를 할당하는 동작도 포함할 수 있다. 일 실시예에 따른 전자 장치는 다양한 형태로 구현될 수 있다. 예를 들어, 본 명세서에서 기술되는 전자 장치는, 디지털 카메라, 스마트 폰(smart phone), 노트북 컴퓨터(laptop computer), 태블릿 PC, 전자북 단말기, 디지털방송용 단말기, PDA(Personal Digital Assistants), PMP(Portable Multimedia Player), 네비게 이션, MP3 플레이어 등이 있을 수 있으나, 이에 한정되는 것은 아니다. 본 명세서에서 기술되는 전자 장치 는 사용자에 의해 착용될 수 있는 장치(wearable device)일 수 있다. 웨어러블 디바이스는 액세서리 형 장치(예컨대, 시계, 반지, 팔목 밴드, 발목 밴드, 목걸이, 안경, 콘택트 렌즈), 머리 착용형 장치(head- mounted-device(HMD)), 직물 또는 의류 일체형 장치(예: 전자 의복), 신체 부착형 장치(예컨대, 스킨 패드(skin pad)), 또는 생체 이식형 장치(예: implantable circuit) 중 적어도 하나를 포함할 수 있으나, 이에 한정되는 것은 아니다. 이하에서는, 설명의 편의상, 전자 장치가 스마트 폰인 경우를 예로 들어 설명하기로 한다. 일 실시 예에 의한 전자 장치는 신경망 모델을 이용하여, 다양한 동작을 수행할 수 있다. 예를 들면, 신경망 모델은, DNN(Deep Neural Network), RNN(Recurrent Neural Network), CNN(convolutional neural network) 등의 인공지능 모델을 포함할 수 있다. 상술한 예에 한하지 않고, 일 실시 예에 의한 신경망 모델은 다양한 종류의 인공지능 모델을 포함할 수 있다.일 실시 예에 의한 전자 장치는, 적어도 하나의 신경망 모델을 이용하여, 데이터를 인식하거나, 새 로운 데이터를 생성하는 등의 다양한 동작을 수행하고, 그 결과를 사용자에게 제공할 수 있다. 일 실시 예에 의한 신경망 모델은 복수 개의 레이어를 포함할 수 있다. 신경망 모델에 포함된 각각의 레이어는, 데이터를 처리하는 적어도 하나의 함수를 포함할 수 있다. 예를 들어, CNN 모델을 포함한 신경망 모 델은, 컨볼루션(convolution) 레이어, 맥스 풀링(Max Pooling) 레이어, 플래튼(Flatten) 레이어 등 다양 한 종류의 레이어들의 조합으로 구성될 수 있다. 예를 들어, 컨볼루션 레이어에서는, 입력 데이터에 대한 특징 정보를 추출하는 동작이 수행될 수 있다. 맥스 풀 링 레이어에서는, 입력 데이터에서 주요 데이터를 추출하는 동작이 수행될 수 있다. 플래튼 레이어에서는, 입력 데이터의 값을 일차원적 값으로 변환하는 동작이 수행될 수 있다. 상술한 예에 한하지 않고, 신경망 모델 은 다양한 종류의 레이어들을 포함할 수 있다. 일 실시 예에 의한 전자 장치는 복수의 프로세서(1310, 1320, 1330)를 포함할 수 있다. 예를 들면, 전자 장치는, CPU, GPU, NPU, DSP 등 다양한 종류의 프로세서를 포함할 수 있다. 각각의 프로세서는 서로 다른 성능 및 특징을 가질 수 있다. 예를 들어, CPU는 다른 프로세서보다 속도는 느리지만 정확도가 높고, 에너지 효 율이 좋은 특징을 가지고 있다. 이하 표 1은 CPU, GPU, NPU, DSP 각각의 프로세서에 대한 상대적인 특징을 나타낸 것이다. 표 1 CPU GPU DSP NPU 속도 느림 빠름 아주 빠름 아주 빠름 정확도 강인함 강인함 민감함 민감함 에너지 효율 좋음 나쁨 매우 좋음 매우 좋음 새로운 작업 수행의 용이성쉬움 다소 어려움 매우 어려움 불가능 코드 검사 쉬움 다소 어려움 매우 어려움 불가능 상기 표 1에 기재된 각 프로세서에 대한 특징은, 예시에 불과하고, 각 프로세서에서 처리되는 작업의 특징이나, 프로세서의 현재 상태 등 다양한 요인에 따라, 달라질 수 있다. 일 실시 예에 의하면, 컴파일 단계에서, 신경망 모델에 포함된 각각의 레이어에 대하여 전자 장치의 프로세서(1310, 1320, 1330)들 중 하나의 프로세서가 할당될 수 있다. 전자 장치는, 표 1과 같은 각각의 프로세서(1310, 1320, 1330)의 성능과, 신경망 모델에 포함된 각각의 레이어에 관한 특징에 기초하여, 각 각의 레이어에 프로세서가 할당될 수 있다. 일 실시 예에 의하면, 처리되는 레이어의 특징에 따라, 레이어를 처리하는 프로세서의 속도 및 정확도가 서로 다를 수 있다. 일 실시 예에 의한 전자 장치는, 어떤 프로세서가 신경망 모델의 각각의 레이어를 처 리하기에 적합한지 여부를 판단함으로써, 복수의 프로세서 중 각각의 레이어가 처리될 프로세서를 할당할 수 있 다. 일 실시 예에 따라 레이어가 처리될 프로세서가 할당되면, 전자 장치는 할당 결과에 따라서, 복수의 프로 세서를 이용하여 신경망 모델을 처리할 수 있다. 도 2는 일 실시 예에 따라 신경망 모델의 레이어가 적어도 하나의 슬라이스로 할당되는 일 예를 나타낸 도 면이다. 도 2에 도시된 노드들은 신경망 모델을 구성하는 일부의 레이어들을 나타낸다. 일 실시 예에 의하면, 화살 표 방향에 따라 각 레이어에서 작업이 수행된 결과가 다음 레이어로 전달됨으로써, 전자 장치에서 신경망 모델이 처리될 수 있다. 일 실시 예에 의하면, 신경망 모델의 복수 개의 레이어가 적어도 하나의 슬라이스에 할당되고, 슬라이스 단위로 각각의 레이어가 프로세서에 할당될 수 있다. 일 실시 예에 의한 전자 장치는 레이어 단위 대신, 적어도 하나의 레이어를 포함하는 슬라이스 단위로 프로세서에 레이어를 할당함으로써, 할당 동작에 의해 발생 되는 연산량이 감소될 수 있다.일 실시 예에 의하면, 전자 장치는 신경망 모델을 구성하는 복수 개의 레이어 중 적어도 하나의 레 이어를 슬라이스 포인트로 결정함으로써, 상기 복수 개의 레이어를 슬라이스에 할당할 수 있다. 일 실시 예에 의하면, 슬라이스 포인트를 기준으로, 각각의 레이어가 서로 다른 슬라이스에 할당될 수 있다. 예를 들면, 전자 장치는 레이어 \"conv2d_9\" 부터 \"activation_11\"까지의 각 레이어를, 슬라이스 포인트로 결정할지 여부를 차례대로 판단할 수 있다. 또한, \"activation_11\" 이후 \"conv2d_7\"부터 \"activation_8\"까지 차례대로 슬라이스 포인트인지 여부가 판단될 수 있다. \"average_pooling2d_1\" 내지 \"activation_6\"도 동일하 게 차례대로 슬라이스 포인트인지 여부가 판단될 수 있다. 일 실시 예에 의한 전자 장치는, 각각의 레이어가, 복수의 레이어들이 분기되는 지점인지 여부, 복수의 레이어들이 결합되는 지점인지 여부, 동일한 프로세서에서 처리 가능한 작업을 포함하는지 여부, 높은 정확도가 요구되는 작업을 포함하는지 여부 중 적어도 하나에 기초하여, 슬라이스 포인트를 결정할 수 있다. 일 실시 예 에 의하면, 상술한 다양한 기준과 같이, 현재 레이어에서, 이전 레이어의 프로세서와 다른 프로세서로 스위칭될 가능성이 있는지에 따라서, 현재 레이어가 슬라이스 포인트로 결정될 수 있다. 상술한 예에 한하지 않고, 슬라 이스 포인트는 다양한 기준에 따라 결정될 수 있다. 예를 들어, \"conv2d_9\"는 \"max_pooling2d_2\"로부터 분기된 복수 개의 레이어 중 하나이므로, 복수의 레이어들이 분기되는 지점에 해당됨에 따라 슬라이스 포인트로 결정될 수 있다. 따라서, \"conv2d_9\"은 앞서 결정된 슬라이 스와는 다른 새로운 슬라이스 1에 속할 수 있다. \"activation_9\" 내지 \"actionvation_11\"의 레이어들은, 상술한 슬라이스 포인트를 결정하는 기준에 따라서, 슬 라이스 포인트로 결정되지 않음에 의해, 앞서 결정된 슬라이스에 할당될 수 있다. \"conv2d_7\"은, \"conv2d_9\"와 동일하게, \"max_pooling2d_2\"로부터 분기된 복수 개의 레이어 중 하나이므로, 슬 라이스 포인트로 결정되고, 새로운 슬라이스에 속할 수 있다. \"conv2d_7\" 내지 \"actionvation_8\"의 레이어 들은, 슬라이스 포인트로 결정되지 않음에 따라, 앞서 결정된 슬라이스 2에 할당될 수 있다. \"average_pooling2d_1\"은, \"conv2d_9\"와 동일하게, \"max_pooling2d_2\"로부터 분기된 복수 개의 레이어 중 하나 이므로 슬라이스 포인트로 결정되고, 새로운 슬라이스 3에 속할 수 있다. \"conv2d_12\"의 레이어는, 슬라이 스 포인트로 결정되지 않음에 따라, 앞서 결정된 슬라이스 3에 할당될 수 있다. \"activation_12\"는, 슬라이스 3의 레이어들과 동일한 프로세서에서 처리 가능한 작업을 포함하지 않거나, 높은 정확도가 요구되는 작업을 포함함에 따라서, 슬라이스 포인트로 결정될 수 있고, 새로운 슬라이스 4 에 속할 수 있다. 예를 들어, \"activation_12\"를 처리할 수 있는 프로세서 중에 슬라이스 3에 포함된 레이어인 \"activation_12\" 및 \"conv2d_12\"를 처리할 수 있는 프로세서가 존재하지 않는 경우, 슬라이스 3에 할당된 프로세서로 \"activation_12\"를 처리할 수 없으므로, \"activation_12\"는 슬라이스 3에 속할 수 없다. 일 실시 예에 의하면, 슬라이스 단위로 프로세서가 할당됨에 따라 동일한 슬라이스에 속한 레이어들은 동일한 프로 세서로 처리될 수 있기 때문이다. 또 다른 예로, \"activation_12\"가 높은 정확도가 요구되는 작업을 포함하는 경우에도, 다른 레이어로 인한 영향 없이 \"activation_12\"에 적합한 프로세서가 할당될 수 있도록, \"activation_12\"가 슬라이스 포인트로 결정될 수 있다. \"conv2d_6\"은, \"conv2d_9\"와 동일하게, \"max_pooling2d_2\"로부터 분기된 복수 개의 레이어 중 하나이므로 슬라 이스 포인트로 결정되고, 새로운 슬라이스 5에 할당될 수 있다. \"activation_6\"의 레이어는, 슬라이스 포 인트로 결정되지 않음에 따라, 앞서 결정된 슬라이스 5에 할당될 수 있다. 일 실시 예에 의하면, 적어도 하나의 레이어가 할당된 각각의 슬라이스마다 하나의 프로세서가 할당될 수 있다. 일 실시 예에 의하면, 전자 장치는 각각의 슬라이스에 대한 각각의 프로세서의 처리 시간에 기초하여, 각 각의 슬라이스를 처리할 프로세서를 결정할 수 있다. 일 실시 예에 의한 처리 시간은, 현재 프로세서가 현재 슬라이스에 포함된 적어도 하나의 레이어의 작업을 처리 하는데 소요되는 시간과, 현재 프로세서가 다른 프로세서로부터 현재 슬라이스를 처리하는데 필요한 데이터를 수신하는데 소요되는 스위칭 시간을 포함할 수 있다. 예를 들면, 다른 프로세서로부터 수신되는 현재 슬라이스 를 처리하는데 필요한 데이터는, 현재 슬라이스에 포함된 레이어에 입력되는 데이터를 포함할 수 있다. 또한, 다른 프로세서는, 이전 슬라이스를 처리하여 현재 슬라이스에 입력되는 데이터를 출력하는 이전 프로세서일 수있다. 일 실시 예에 의한 스위칭 시간은, 이전 슬라이스를 처리하는 이전 프로세서와 현재 슬라이스를 처리하는 현재 프로세서가 상이한 경우, 이전 슬라이스의 처리 결과에 대한 데이터가 현재 프로세서로 전달되는데 걸리는 시간 을 나타낼 수 있다. 예를 들어, 슬라이스 3에 제1 프로세서가 할당된 경우, 슬라이스 4에 대한 제2 프로세서(132 0)의 스위칭 시간은, \"conv2d_12\"의 출력 데이터가 제1 프로세서에서 제2 프로세서로 전달되는 시 간을 나타낼 수 있다. 또한, 슬라이스 4에 대한 제3 프로세서의 스위칭 시간은, \"conv2d_12\"의 출력 데이터가 제1 프로세서에서 제3 프로세서로 전달되는 시간을 나타낼 수 있다. 일 실시 예에 의한 스위칭 시간은, 제1 프로세서에서 제2 프로세서로 데이터가 전달되는 시간뿐만 아니라, 제2 프로세서의 데이터 포맷에 맞게 전달되는 데이터가 변환되는 시간을 더 포함할 수 있다. 또한, 일 실시 예에 의한 스위칭 시간은, 전달되는 데이터의 크기가 커짐에 따라 증가될 수 있다. 또한, 일 실시 예에 의한 스위칭 시간은, 이전 슬라이스를 처리하는 이전 프로세서와 현재 슬라이스를 처리하는 현재 프로세서가 동일한 경우, 프로세서 간 데이터가 전달되지 않으므로, 0으로 결정될 수 있다. 예를 들어, 슬 라이스 4에 대한 제1 프로세서의 스위칭 시간은, 슬라이스 3에 제1 프로세서가 할당됨에 의해, 0으로 결정될 수 있다. 따라서, 일 실시 예에 의하면, 각 프로세서에 의해 슬라이스의 레이어 작업이 처리되는데 소요되는 시간뿐만 아 니라, 복수의 프로세서를 통해 복수 개의 슬라이스가 처리될 수 있도록, 프로세서 간 데이터가 전달되는 스위칭 시간에 기초하여, 각 슬라이스를 처리할 프로세서가 결정될 수 있다. 도 3 는 일 실시 예에 의한 전자 장치의 내부 구성을 설명하기 위한 블록도이다. 도 4은 일 실시 예에 의한 전자 장치의 내부 구성을 설명하기 위한 블록도이다. 도 3를 참조하면, 전자 장치는, 프로세서, 메모리 및 출력부을 포함할 수 있다. 그러 나, 도 3에 도시된 구성 요소 모두가 전자 장치의 필수 구성 요소인 것은 아니다. 도 3에 도시된 구성 요 소보다 많은 구성 요소에 의해 전자 장치가 구현될 수도 있고, 도 3에 도시된 구성 요소보다 적은 구성 요소에 의해 전자 장치가 구현될 수도 있다. 예를 들면, 전자 장치는 도 4에 도시된 바와 같이, 일부 실시예에 따른 전자 장치는, 프로세서 , 메모리 및 출력부 이외에 사용자 입력부, 센싱부, 통신부, 및 A/V 입 력부를 더 포함할 수도 있다. 사용자 입력부는, 사용자가 전자 장치를 제어하기 위한 데이터를 입력하는 수단을 의미한다. 예를 들어, 사용자 입력부에는 키 패드(key pad), 돔 스위치 (dome switch), 터치 패드(접촉식 정전 용량 방식, 압력식 저항막 방식, 적외선 감지 방식, 표면 초음파 전도 방식, 적분식 장력 측정 방식, 피에조 효과 방 식 등), 조그 휠, 조그 스위치 등이 있을 수 있으나 이에 한정되는 것은 아니다. 일 실시 예에 의하면, 사용자 입력부는, 신경망 모델에 의한 동작을 수행하는데 필요한 사용자의 입 력을 수신할 수 있다. 일 실시 예에 의하면, 사용자 입력부에서 수신된 사용자의 입력에 따라서, 전자 장 치는 복수의 프로세서를 이용하여 신경망 모델을 처리하고, 처리 결과를 출력할 수 있다. 출력부는, 오디오 신호 또는 비디오 신호 또는 진동 신호를 출력할 수 있으며, 출력부는 디스플레 이부, 음향 출력부, 및 진동 모터를 포함할 수 있다. 디스플레이부는 전자 장치에서 처리되는 정보를 표시 출력한다. 한편, 디스플레이부와 터치패드가 레이어 구조를 이루어 터치 스크린으로 구성되는 경우, 디스플레이부 는 출력 장치 이외에 입력 장치로도 사용될 수 있다. 디스플레이부는 액정 디스플레이(liquid crystal display), 박막 트랜지스터 액정 디스플레이(thin film transistor-liquid crystal display), 유기 발 광 다이오드(organic light-emitting diode), 플렉시블 디스플레이(flexible display), 3차원 디스플레이(3D display), 전기영동 디스플레이(electrophoretic display) 중에서 적어도 하나를 포함할 수 있다. 그리고 전자 장치의 구현 형태에 따라 전자 장치는 디스플레이부를 2개 이상 포함할 수도 있다. 음향 출력부는 통신부로부터 수신되거나 메모리에 저장된 오디오 데이터를 출력한다. 진동 모터는 진동 신호를 출력할 수 있다. 또한, 진동 모터는 터치스크린에 터치가 입력되는 경우 진동 신호를 출력할 수도 있다. 일 실시 예에 따라 프로세서에 의해 신경망 모델이 처리된 결과는, 디스플레이부, 음향 출력 부, 및 진동 모터 통하여, 다양한 형태로 출력할 수 있다. 프로세서는, 통상적으로 전자 장치의 전반적인 동작을 제어한다. 예를 들어, 프로세서는, 메 모리에 저장된 프로그램들을 실행함으로써, 사용자 입력부, 출력부, 센싱부, 통신부 , A/V 입력부 등을 전반적으로 제어할 수 있다. 전자 장치는 복수의 프로세서를 포함 할 수 있다. 프로세서는 기본적인 산술, 로직 및 입출력 연산을 수행함으로써, 컴퓨터 프로그램의 명령을 처리하도록 구성될 수 있다. 명령은 메모리로부터 프로세서에 제공되거나, 통신부를 통해 수신되어 프로 세서로 제공될 수 있다. 예를 들면 프로세서는 메모리와 같은 기록 장치에 저장된 프로그램 코드 에 따라 명령을 실행하도록 구성될 수 있다. 일 실시 예에 의한 프로세서는 신경망 모델에 포함된 복수 개의 레이어들을 적어도 하나의 슬라이스 에 할당하고, 프로세서에 포함된 복수의 프로세서들 중 각 슬라이스를 처리할 프로세서를 할당할 수 있다. 또한, 할당된 결과에 기초하여, 프로세서는 신경망 모델을 처리할 수 있다. 일 실시 예에 의하면, 슬라이스에 대한 프로세서의 처리 시간에 기초하여, 각각의 슬라이스에 대한 프로세서가 할당될 수 있다. 일 실시 예에 의한 처리 시간은, 프로세서 간 데이터가 전달되는데 소요되는 스위칭 시간을 포 함할 수 있다. 일 실시 예에 의하면, 프로세서는 복수의 프로세서들 중 제1 프로세서에 할당된 적어도 하나의 슬라이스 에 포함된 적어도 하나의 레이어를 식별할 수 있다. 또한, 프로세서는 식별된 레이어에 입력되는 데이터, 출력되는 데이터 및 식별된 레이어의 내부에서 임시 저장되는 데이터 중 적어도 하나의 데이터를 각각 나타내는 적어도 하나의 블롭을 식별하고, 식별된 블롭의 데이터를 저장하기 위한 메모리를 할당할 수 있다. 일 실시 예에 의하면, 현재 블롭에 대한 메모리는, 각각의 레이어의 처리 순서에 따라, 이전 블롭의 사용 구간 이 현재 블롭의 데이터가 생성되기 전에 종료되는지 여부를 판단함으로써, 할당될 수 있다. 또한, 동일한 메모 리가 할당된 적어도 하나의 블롭의 데이터 크기 중 가장 큰 데이터 크기에 기초하여, 상기 할당된 메모리의 크 기가 결정될 수 있다. 센싱부는, 전자 장치의 상태 또는 전자 장치 주변의 상태를 감지하고, 감지된 정보를 프로세 서로 전달할 수 있다. 센싱부는, 지자기 센서(Geomagnetic sensor), 가속도 센서(Acceleration sensor), 온/습도 센서, 적외선 센서, 자이로스코프 센서, 위치 센서(예컨대, GPS), 기압 센서, 근접 센서, 및 RGB 센서(illuminance sensor) 중 적어도 하나를 포함할 수 있으나, 이에 한정되는 것은 아니다. 일 실시 예에 따라 센싱부에 의해 감지된 정보는, 신경망 모델의 입력 정보로서 이용되거나, 신경망 모델이 갱신되는데 이용될 수 있다. 상술한 예에 한하지 않고, 센싱부에 의해 감지된 정보는, 신경 망 모델을 처리하기 위한 다양한 방법에 따라 이용될 수 있다. 통신부는, 전자 장치가 서버 또는 외부 장치(미도시)와 통신을 하게 하는 하나 이상의 구성 요소를 포함할 수 있다. 예를 들어, 통신부는, 근거리 통신부, 이동 통신부, 방송 수신부 를 포함할 수 있다. 근거리 통신부(short-range wireless communication unit)는, 블루투스 통신부, BLE(Bluetooth Low Energy) 통신부, 근거리 무선 통신부(Near Field Communication unit), WLAN(와이파이) 통신부, 지그비 (Zigbee) 통신부, 적외선(IrDA, infrared Data Association) 통신부, WFD(Wi-Fi Direct) 통신부, UWB(ultra wideband) 통신부, Ant+ 통신부 등을 포함할 수 있으나, 이에 한정되는 것은 아니다. 이동 통신부는, 이동 통신망 상에서 기지국, 외부의 단말, 서버 중 적어도 하나와 무선 신호를 송수신한 다. 여기에서, 무선 신호는, 음성 호 신호, 화상 통화 호 신호 또는 문자/멀티미디어 메시지 송수신에 따른 다 양한 형태의 데이터를 포함할 수 있다.방송 수신부는, 방송 채널을 통하여 외부로부터 방송 신호 및/또는 방송 관련된 정보를 수신한다. 방송 채널은 위성 채널, 지상파 채널을 포함할 수 있다. 구현 예에 따라서 전자 장치가 방송 수신부를 포함하지 않을 수도 있다. 일 실시 예에 의한, 통신부는 신경망 모델이 처리된 결과를 외부 장치로 전송할 수 있다. 또는, 통 신부는 신경망 모델을 처리하는데 필요한 정보를 외부 장치로부터 수신할 수 있다. A/V(Audio/Video) 입력부는 오디오 신호 또는 비디오 신호 입력을 위한 것으로, 이에는 카메라와 마이크로폰 등이 포함될 수 있다. 카메라는 화상 통화모드 또는 촬영 모드에서 이미지 센서를 통해 정지영상 또는 동영상 등의 화상 프레임을 얻을 수 있다. 이미지 센서를 통해 캡쳐된 이미지는 프로세서 또는 별도의 이미지 처리부(미도시)를 통해 처리될 수 있다. 마이크로폰은, 외부의 음향 신호를 입력 받 아 전기적인 음성 데이터로 처리한다. 일 실시 예에 따라 A/V 입력부에 의해 획득된 영상 데이터 또는 음성 데이터는, 신경망 모델의 입력 정보로서 이용되거나, 신경망 모델이 갱신되는데 이용될 수 있다. 상술한 예에 한하지 않고, 영상 데이터 또는 음성 데이터는, 신경망 모델을 처리하기 위한 다양한 방법에 따라 이용될 수 있다. 메모리는, 프로세서의 처리 및 제어를 위한 프로그램을 저장할 수 있고, 전자 장치로 입력되 거나 전자 장치로부터 출력되는 데이터를 저장할 수도 있다. 일 실시 예에 의한 메모리는 신경망 모델에 관한 정보 및 복수의 프로세서의 성능에 관한 정보를 저 장할 수 있다. 예를 들어, 복수의 프로세서의 성능에 관한 정보는, 레이어에 대한 프로세서의 처리 속도, 각 프 로세서에서 처리 가능한 레이어에 관한 정보, 다른 프로세서 간 데이터를 스위칭하는데 소요되는 시간에 관한 정보 등을 포함할 수 있다. 상술한 예에 한하지 않고, 복수의 프로세서의 성능에 관한 정보는, 프로세서에 슬라 이스를 할당하는데 필요한 다양한 종류의 정보를 포함할 수 있다. 메모리는 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), 멀티미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 램(RAM, Random Access Memory) SRAM(Static Random Access Memory), 롬(ROM, Read-Only Memory), EEPROM(Electrically Erasable Programmable Read-Only Memory), PROM(Programmable Read-Only Memory), 자기 메모리, 자기 디스크, 광디스크 중 적어도 하나의 타입의 저장매체를 포함할 수 있다. 메모리에 저장된 프로그램들은 그 기능에 따라 복수 개의 모듈들로 분류할 수 있는데, 예를 들어, UI 모 듈, 터치 스크린 모듈, 알림 모듈 등으로 분류될 수 있다. UI 모듈은, 애플리케이션 별로 전자 장치와 연동되는 특화된 UI, GUI 등을 제공할 수 있다. 터치 스크린 모듈은 사용자의 터치 스크린 상의 터치 제스처를 감지하고, 터치 제스처에 관한 정보를 프로세서 로 전달할 수 있다. 일부 실시예에 따른 터치 스크린 모듈은 터치 코드를 인식하고 분석할 수 있다. 터치 스크린 모듈은 컨트롤러를 포함하는 별도의 하드웨어로 구성될 수도 있다. 터치스크린의 터치 또는 근접 터치를 감지하기 위해 터치스크린의 내부 또는 근처에 다양한 센서가 구비될 수 있다. 터치스크린의 터치를 감지하기 위한 센서의 일례로 촉각 센서가 있다. 촉각 센서는 사람이 느끼는 정도로 또는 그 이상으로 특정 물체의 접촉을 감지하는 센서를 말한다. 촉각 센서는 접촉면의 거칠기, 접촉 물체의 단 단함, 접촉 지점의 온도 등의 다양한 정보를 감지할 수 있다. 사용자의 터치 제스처에는 탭, 터치&홀드, 더블 탭, 드래그, 패닝, 플릭, 드래그 앤드 드롭, 스와이프 등이 있 을 수 있다. 알림 모듈은 전자 장치의 이벤트 발생을 알리기 위한 신호를 발생할 수 있다. 도 5는 일 실시 예에 의한 복수의 프로세서를 이용하여 신경망 모델을 처리하는 방법을 나타낸 순서도이다. 도 5를 참조하면, 단계 510에서, 전자 장치는 신경망 모델을 구성하는 복수 개의 레이어를 적어도 하나의 슬라이스에 할당할 수 있다. 일 실시 예에 의한 전자 장치는 각각의 레이어가 슬라이스 포인트인 지 여부를 결정함으로써, 복수 개의 레이어를 적어도 하나의 슬라이스에 할당할 수 있다. 예를 들어, 제1 레이어가 슬라이스 포인트로 결정되면, 새로운 제1 슬라이스가 생성되고, 제1 레이어는 이전 슬 라이스 대신 상기 제1 슬라이스에 할당될 수 있다. 상기 이전 슬라이스는, 제1 레이어가 슬라이스 포인트인지 여부를 결정하기 전 적어도 하나의 레이어가 이미 할당되어 있는 슬라이스를 나타낼 수 있다. 반면, 제1 레이어가 슬라이스 포인트로 결정되지 않은 경우, 제1 레이어는 이전 슬라이스에 할당될 수 있다. 일 실시 예에 따라 제1 레이어가 제1 슬라이스에 할당된 후, 제2 레이어가 슬라이스 포인트로 결정되면, 제2 슬 라이스가 새로 생성되고, 제2 레이어는 새로 생성된 제2 슬라이스에 할당될 수 있다. 반면, 제2 레이어가 슬라 이스 포인트 결정되지 않은 경우, 제2 레이어는 제1 슬라이스에 할당될 수 있다. 단계 520에서, 전자 장치는, 신경망 모델을 구성하는 복수 개의 레이어를 적어도 하나의 슬라이스에 할당한 후, 각 슬라이스를 복수의 프로세서에 할당할 수 있다. 일 실시 예에 의한 복수의 프로세서는, 각 프로 세서에 할당된 슬라이스에 포함된 적어도 하나의 레이어를 처리함으로써, 신경망 모델을 처리할 수 있다. 일 실시 예에 의하면, 전자 장치는, 각 프로세서가 슬라이스를 처리하는데 소요되는 처리 시간에 기초하 여, 각 슬라이스를 복수의 프로세서에 할당할 수 있다. 일 실시 예에 의한 처리 시간은, 각 프로세서가 슬라이 스를 처리하는데 소요되는 시간뿐만 아니라, 슬라이스를 처리하기 위하여, 다른 프로세서로부터 데이터를 전달 받는데 걸리는 스위칭 시간을 더 포함할 수 있다. 단계 530에서, 전자 장치는 단계 520의 할당 결과에 기초하여, 복수의 프로세서를 이용하여 신경망 모델 을 처리할 수 있다. 일 실시 예에 의하면, 각 슬라이스를 처리할 프로세서가 각각 할당됨에 따라, 신경망 모델에서 병렬적으로 배열된 복수의 슬라이스들은 복수의 프로세서에 의해 동시에 처리될 수 있다. 따라서, 일 실시 예에 의하면, 신 경망 모델의 각 레이어를 위상 정렬(topological sort) 방법에 따라 일렬로 정렬시켜, 차례대로 처리하는 경우보다, 더 빠르게 신경망 모델의 각 레이어가 처리될 수 있다. 도 6은 일 실시 예에 따른 슬라이스를 복수의 프로세서에 할당하는 방법을 나타낸 순서도이다. 도 6을 참조하면, 단계 610에서, 전자 장치는 슬라이스 s 및 프로세서 p에 관한 정보를 획득할 수 있다. 일 실시 예에 있어서, 슬라이스 s 및 프로세서 p는, 적어도 하나의 슬라이스 및 복수의 프로세서 중 하나의 슬 라이스 s 및 하나의 프로세서 p를 나타낼 수 있다. 일 실시 예에 의하면, 단계 610에서, 전자 장치에 포함 된 복수의 프로세서 중 슬라이스 s에 포함된 레이어들을 처리할 수 있는 프로세서가 프로세서 p로 결정될 수 있 다. 예를 들면, 슬라이스 s에 관한 정보는, 슬라이스 s에 포함된 적어도 하나의 레이어의 작업에 관한 정보를 포함 할 수 있다. 또한, 프로세서 p에 관한 정보는 프로세서 p에 의해 수행될 수 있는 작업에 관한 정보, 프로세서 p 에 의해 작업이 처리되는 시간에 관한 정보, 다른 프로세서 간 데이터가 전달되는데 걸리는 스위칭 시간에 관한 정보 등, 프로세서 p의 성능에 관한 정보를 포함할 수 있다. 상술한 예에 한하지 않고, 슬라이스 s 및 프로세서 p에 관한 정보는, 프로세서 p가 슬라이스 s를 처리하는데 소요되는 처리 시간과 처리 결과에 대한 정확도를 예 측하는데 이용될 수 있는 다양한 정보를 포함할 수 있다. 단계 620에서, 전자 장치는 단계 610에서 획득된 정보에 기초하여, 프로세서 p에 의해 슬라이스 s가 처리 되는 경우, 슬라이스 s의 처리 결과에 대한 정확도를 예측하고, 예측된 정확도가 기준값 이하인지 여부를 판단 할 수 있다. 일 실시 예에 의하면, 예측된 정확도가 기준값 이하인 경우, 단계 650에서, 프로세서 p외의 다른 프로세서가 존 재하는지 여부가 판단될 수 있다. 상술한 다른 프로세서는, 슬라이스 s에 대한 할당 여부가 아직 결정되지 않은 전자 장치의 복수의 프로세서 중 슬라이스 s를 처리할 수 있는 프로세서일 수 있다. 일 실시 예에 의하면, 단계 660에서, 전자 장치는 슬라이스 s를 처리할 수 있는 다른 프로세서를 식별할 수 있다. 전자 장치는, 식별된 다른 프로세서에 대해, 단계 610 내지 단계 640의 동작을 반복하여 수행할 수 있다. 단계 630에서, 전자 장치는, 단계 610에서 획득된 정보에 기초하여, 프로세서 p에 의한 슬라이스 s의 작 업을 처리하는데 소요되는 시간을 예측할 수 있다. 예를 들면, 전자 장치는, 프로세서 p의 처리 시간을 작업 타입 별로 판단하고, 판단된 처리 시간에 기초하여, 슬라이스 s에 포함된 적어도 하나의 레이어의 작업에 대한 프로세서 p의 처리 시간을 획득할 수 있다. 상술한 예에 한하지 않고, 프로세서 p에 의한 슬라이스 s의 처 리 시간은 다양한 방법으로 예측될 수 있다. 또한, 단계 640에서, 단계 610에서 획득된 정보에 기초하여, 전자 장치는, 슬라이스 s의 입력 데이터가 다른 프로세서에서 프로세서 p로 전달되는데 걸리는 스위칭 시간을 예측할 수 있다. 예를 들면, 슬라이스 s의 입력 데이터는, 상기 입력 데이터가 출력되는 이전 슬라이스를 처리하는 프로세서에 의해 프로세서 p로 전달될 수 있다. 일 실시 예에 의한 이전 슬라이스는, 슬라이스 s에 입력될 데이터를 출력하 는 슬라이스를 나타낼 수 있다. 또한, 스위칭 시간은, 이전 슬라이스를 처리하는 프로세서에서, 상기 슬라이스 s의 입력 데이터가 프로세서 p로 전달되는데 걸리는 시간을 나타낼 수 있다. 한편, 이전 슬라이스를 처리하는 프로세서가 프로세서 p와 동일한 경우, 스위칭 시간은 0으로 결정될 수 있다. 일 실시 예에 의한 스위칭 시간은, 전자 장치의 서로 다른 프로세서들 간 데이터가 전달되는데 걸리는 시 간에 기초하여 예측될 수 있다. 단계 650에서, 전자 장치는, 전자 장치의 프로세서들 중, 슬라이스 s에 대하여, 단계 620 내지 640 에 따라, 정확도, 처리시간 및 스위치 시간 중 적어도 하나가 판단되지 않은, 다른 프로세서가 존재하는지 여부 를 판단할 수 있다. 다른 프로세서가 존재하는 경우, 전자 장치는 단계 660에서 식별된 다른 프로세서에 대해 단계 610 내지 단계 640의 동작을 반복하여 수행할 수 있다. 또한, 슬라이스 s에 대하여, 단계 620 내지 640에 따라, 정확도, 처리시간 및 스위치 시간 중 적어도 하나가 판 단되지 않은, 다른 프로세서가 존재하지 않는 경우, 전자 장치는 단계 670에서, 슬라이스 s를 복수의 프 로세서 중 하나의 프로세서에 할당할 수 있다. 일 실시 예에 의하면, 슬라이스 s에 대한 각 프로세서의 처리 시간 및 스위치 시간에 기초하여, 슬라이스 s를 처리할 프로세서가 결정될 수 있다. 예를 들면, 처리 시간 및 스위치 시간을 합한 값이 가장 작은 프로세서가 슬라이스 s를 처리할 프로세서로 결정될 수 있다. 일 실시 예에 따라 정확도가 기준값 이하인 프로세서는, 단계 670의 슬라이스 s를 처리할 프로세서로 결정되지 않고, 제외될 수 있다. 따라서, 처리 시간이나 스위치 시간이 짧아도, 처리 결과에 대한 정확도가 낮은 프로세 서는, 슬라이스 s를 처리할 프로세서로 할당되지 않을 수 있다. 일 실시 예에 따라, 슬라이스 s에 대한 프로세서가 할당된 후, 슬라이스 s외에 프로세서가 할당되지 않은 다른 슬라이스에 대하여, 단계 610 내지 670에 대한 동작이 반복하여 수행될 수 있다. 도 7은 일 실시 예에 의한 슬라이스에 프로세서를 할당하는 일 예를 나타낸 도면이다. 도 7을 참조하면, 710은, 처리 시간 및 스위칭 시간에 따라 슬라이스에 프로세서를 할당하는 그래프의 일 예를 나타낸 것이다. 710의 그래프에서, 노드는, 슬라이스의 작업을 처리하는데 소요되는 시간을 나타내며, 화살표는 이전 노드에서 현재 노드로 데이터가 스위칭되는데 소요되는 시간을 나타낸다. 일 실시 예에 의하면, 도 6에 도시된 방법과 같이, 슬라이스 별로 차례대로 프로세서가 할당되는 방법과는 달리, 각각의 노드에서의 처리 시간의 총합이 가장 작은 경로에 따라 슬라이스를 처리할 프로세서가 결정될 수 있다. 일 실시 예에 의한 처리 시간은, 각 노드에서 프로세서가 슬라이스의 작업을 처리하는데 소요되는 시간뿐 만 아니라 스위칭 시간도 포함할 수 있다. 예를 들면, 적어도 하나의 슬라이스 중 신경망 모델에서 직렬적으로 배열된 슬라이스들은, 서로 다른 슬라 이스 및 프로세서의 조합을 나타내는 복수 개의 노드(711, 721, 722, 723, 731, 732, 733, 741, 742)가 상기 슬라이스들의 배열 순서에 따라 연결됨으로써 생성된 복수 개의 경로 중 처리 시간의 총합이 가장 작은 경로에 기초하여, 상기 복수의 프로세서에 할당될 수 있다. 슬라이스 1로 입력되는 입력 데이터는 기본 프로세서인 CPU에서 처리될 수 있다. 화살표 방향에 따라, 입 력 데이터는 CPU, GPU 및 NPU 등의 프로세서들 중 하나의 프로세서로 스위칭될 수 있다. 입력 데이터(71 1)가 어느 하나의 프로세서로 스위칭됨에 따라, 입력 데이터는 슬라이스 1에 포함된 레이어에 입력되어 노 드들(721, 722, 723) 중 하나의 노드에서 처리될 수 있다. 일 실시 예에 의하면, NPU에 의해 슬라이스 2가 처리된 결과의 정확도가 기준값 이하이거나, 슬라이스 2가 NPU 에 의해 처리될 수 없는 레이어를 포함함에 따라, 슬라이스 2에 대한 프로세서 할당 동작에서 NPU가 제외될 수 있다. 일 실시 예에 의하면, 그래프와 같이, 슬라이스 1 내지 3에 대한 CPU, GPU 및 NPU의 할당방법은, 총 36개 의 경로 중 하나로 결정될 수 있다. 36개의 경로들 중 각 노드의 처리 시간 및 스위칭 시간의 합이 최소인 경로 에 따라 슬라이스 1 내지 3에 대한 프로세서가 각각 할당될 수 있다. 750은, 일 실시 예에 따라 슬라이스에 프로세서가 할당된 일 예를 나타낸 그래프이다. 적어도 하나의 레이어를 포함하는 각 슬라이스(751, 752, 753, 754, 755, 756)에 대해 프로세서가 할당될 수 있다. 750에 기재된, GPU 16 및 GPU 32는, 각각 16비트, 32비트 GPU를 나타내며, 일 실시 예에서 서로 다른 프로세서 로 처리될 수 있다. 일 실시 예에 의하면, 752, 및 754, 755의 슬라이스들은, 각각 다른 프로세서에 의해 할당됨에 따라서, 병렬적 으로 동시에 처리될 수 있다. 따라서, 일 실시 예에 따라, 신경망 모델에서 병렬로 배열된 일부 레이어들 은, 복수의 프로세서에 의해 병렬적으로 동시에 처리될 수 있으므로, 처리 속도가 보다 향상될 수 있다. 일 실시 예에 의하면, 동일한 프로세서가 할당된 755 및 756의 슬라이스들은 NPU에 의해 동시에 처리될 수 있도 록 각 레이어들이 직렬적으로 정렬된 후, NPU에 의해 처리될 수 있다. 예를 들면, 각 레이어들은, 위상 정렬 (topological sort) 방법에 따라 정렬된 후, NPU에 의해 동시에 처리될 수 있다. 일 실시 예에 의하면, 도 7의 710에 따른 방법과 도 6에 도시된 방법을 조합한 방법에 따라 복수의 프로세서에 적어도 하나의 슬라이스가 할당될 수 있다. 신경망 모델에서 직렬적으로 배열된 슬라이스들, 예를 들면, 751, 752, 753의 슬라이스들은, 도 7에 도시 된 방법과 같은, 서로 다른 슬라이스 및 프로세서의 조합을 나타내는 복수 개의 노드가 상기 슬라이스들의 배열 순서에 따라 연결됨으로써 생성된 복수 개의 경로 중 처리 시간의 총합이 가장 작은 경로에 기초하여, 프로세서 가 할당될 수 있다. 또한, 신경망 모델에서 병렬적으로 배열된 슬라이스들, 예를 들면, 754, 755, 756의 슬라이스들은, 도 6에 도시된 방법에 따라, 슬라이스에 대한 프로세서의 처리 시간, 스위칭 시간 및 정확도에 기초하여, 프로세서가 할당될 수 있다. 도 8은 일 실시 예에 의한 레이어에서 메모리가 할당되는 일 예를 나타낸 도면이다. 일 실시 예에 의한, 레이어 중 컨볼루션 레이어는 도 8에 도시된 예와 같이, 1x1 컨볼루션, DC(Depthwise Convolution, 813 내지 815), 및 1x1 컨볼루션을 채널 1부터 채널 N까지 반복하여 수행되는 작업을 포함할 수 있다. 채널 1에 대한 작업은 단계 810에서 수행될 수 있고, 채널 2에 대한 작업은 단계 810이 수행된 후, 단 계 820에서 수행될 수 있다. 채널 N도 마찬가지로, 채널 N에 앞선 단계들이 수행된 후, 단계 830에서 수행될 수 있다. 일 실시 예에 있어서, 채널은, 레이어에 입력되는 입력 데이터에서, 동일한 크기의 복수 개의 데이터 각각과 대 응될 수 있다. 예를 들어, 제1 채널에서는, 복수 개의 데이터 중 제1 데이터가 처리될 수 있고, 제2 채널에서는 제2 데이터가 처리될 수 있다. 따라서, 레이어에 동일한 크기의 복수 개의 영상 데이터가 입력되는 경우, 복수 개의 입력 데이터는 복수 개의 입력 데이터 개수만큼의 채널 별로 순차적으로 처리될 수 있다. 일 실시 예에 의하면, 컨볼루션 레이어에서, 각 작업들은 순차적으로 처리될 수 있다. 예를 들면, 모든 채널의 입력 데이터에 대해 1x1 컨볼루션이 수행된 후, 1x1 컨볼루션이 수행된 결과에 기초하여, DC(813 내 지 815)가 수행될 수 있다. 또한, DC(813 내지 815) 수행 결과에 기초하여, 1x1 컨볼루션이 수행될 수 있 다. 일 실시 예에 의하면, 상술한 작업 별로 순차적으로 처리되는 대신, 채널 1부터 채널 N까지 차례대로 작업이 수 행될 수도 있다. 예를 들면, 56x56 크기의 입력 데이터가 24개 존재하는 경우, 24개의 채널이 존재하고, 채널 1 부터 채널 24까지의 작업이 채널별로 순차적으로 수행될 수 있다. 일 실시 예에 의하면, 작업이 채널별로 순차적으로 수행되는 경우, 컨볼루션 레이어에 입력되는, 56x56 크기의 24개의 데이터(811, 821, 831)를 저장하기 위한 294KB 크기의 메모리가 할당될 수 있다. 예를 들어, 입력 데이 터가 영상 데이터인 경우, 동일 크기의 복수 개의 영상 데이터를 저장하기 위한 메모리가 할당될 수 있다. 일 실시 예에 의하면, 채널 별로 작업이 순차적으로 처리되는 경우, 모든 채널에 대한 데이터를 저장하기 위한 메모리가 할당하는 대신, 1개 채널의 데이터를 저장하기 위한 메모리만 할당될 수 있다. 따라서, 채널 별로 작 업이 순차적으로 처리되는 경우, 작업별로 순차적으로 처리되는 경우보다, 데이터 저장을 위한 할당되는 메모리 공간이 감소될 수 있다. 810 단계에서는, 채널 1의 작업인, 1x1 컨볼루션, DC(813, 814, 815) 및 1x1 컨볼루션이 순차적으로 수행될 수 있다. 810 단계에서 수행되는 1x1 컨볼루션은, 811의 56x56 크기의 24개의 데이터 중 첫번째 데 이터 및 812의 1x24 크기의 24개의 데이터 중 첫번째 데이터에 대해 수행될 수 있다. 일 실시 예에 의하면, 1x1 컨볼루션 처리를 위해, 812의 1x24 크기의 24개의 데이터 모두가 메모리에 할당 되는 대신, 810 단계에서만 이용되는, 812의 1x24 크기의 24개의 데이터 중 첫번째 데이터만이 메모리에 할당될 수 있다. 1x1 컨볼루션 처리를 위해 이용되는 1x24 크기의 24개의 데이터는 전자 장치에 미리 저장 된 값일 수 있다. 820 단계에서는, 추가적인 메모리 할당 없이, 앞선 810단계에서 할당된 812의 데이터의 메모리와 동일한 공간에 822의 1x24 크기의 두번째 데이터가 저장될 수 있다. 따라서, 일 실시 예에 의하면, 24개의 각각의 채널에서 1x1 컨볼루션(812, 822, 832)이 수행되는데 있어, 1x24 크기의 24개의 데이터 모두가 저장될 수 있는 14KB 크기의 메모리가 할당되는 대신, 1x24 크기의 1개 데이터가 저장될 수 있는 0.09KB 크기의 메모리만 할당될 수 있다. 일 실시 예에 의하면, 이전 채널에서 1x1 컨볼루션 처 리를 위해, 할당된 메모리 공간을 현재 채널에서 1x1 컨볼루션 처리를 위해, 재사용할 수 있다. 따라서, 각 채 널에서 레이어를 처리하는데 필요한 메모리 공간이 감소될 수 있다. DC(813, 814, 815)에서 처리되는 데이터에 대한 메모리 할당도, 모든 데이터가 아닌, 813 내지 815에서 처리되 는 데이터에 대해 메모리가 할당될 수 있다. 813은, 812의 1x1 컨볼루션이 수행됨에 의해 획득된 데이터로, 56x56 크기의 데이터를 포함할 수 있다. 또한, 814는 DC에 이용되는 3x3 크기의 커널 데이터이다. 3x3 크기의 커널 데이터는 DC 처리를 위하여 전자 장치에 미리 저장된 값일 수 있다. 815는, DC가 처리된 결과로 획득되는 데이터로, 56x56 크기의 데이터를 포함할 수 있다. 일 실시 예에 의하면, 채널 1에서 DC(813, 814, 815) 처리를 위하여, 813의 56x56 크기의 데이터(12.25KB), 814의 3x3 크기의 커널 데이터(0.03KB), 815의 56x56 크기의 데이터(12.25KB)를 저장하기 위한 24.53KB 크기의 메모리가 할당될 수 있다. 채널 2의 820 단계에서는, 추가적인 메모리 할당 없이, 앞선 810단계에서 할당된 813, 814, 815의 데이터의 메모리와 동일한 공간에 823, 824, 825의 데이터가 저장될 수 있다. 1x1 컨볼루션에서 처리되는 데이터에 대한 할당도 마찬가지로, 모든 데이터가 아닌, 816에서 처리되는 데 이터에 대해 메모리가 할당될 수 있다. 816에서는, 1x1 크기의 144개의 데이터가 1x1 컨볼루션에서 이용될 수 있다. 따라서, 1x1 크기의 144개의 데이터가 저장될 수 있는 0.09KB 크기의 메모리가 할당될 수 있다. 820 단계에서는, 추가적인 메모리 할당 없이, 앞선 810단계에서 할당된 816의 데이터의 메모리와 동일한 공간에 826 의 데이터가 저장될 수 있다. 1x1 컨볼루션이 수행된 결과, 817에서, 56x56 크기의 24개의 데이터가 획득될 수 있다. 일 실시 예에 의하 면, 817에서 획득된 56x56 크기의 24개의 데이터가 저장될 수 있는 294KB 크기의 메모리가 할당될 수 있다. 단 계 820에서도, 817과 동일하게 827에서, 1x1 컨볼루션이 수행됨에 따른, 56x56 크기의 24개의 데이터가 획 득될 수 있다. 이후 채널 3 내지 채널 N에서도, 1x1 컨볼루션, DC, 및 1x1 컨볼루션이 수행된 결과에 따라, 각 채널에 대한 56x56 크기의 24개의 데이터가 획득될 수 있다. 일 실시 예에 의하면, 각 채널에서 출력된 56x56 크기의 24개의 데이터가 결합됨으로써, 컨볼루션 레이어에 대 한 최종 결과가 획득될 수 있다. 따라서, 채널 1에서의 작업이 처리되기 위하여 이용되는 적어도 하나의 데이터의 총합인 총 612KB의 메모 리 공간이 할당될 수 있다. 일 실시 예에 의하면, 채널 2 내지 채널 N(820, 830)에서는, 각 채널의 작업이 순차 적으로 수행됨에 의해, 추가적인 메모리 할당없이, 채널 1에서 할당된 612KB의 메모리 공간이 재사용될 수 있다. 따라서, 컨볼루션 레이어의 채널 1 내지 채널 N(810, 820, 830)의 작업이 모두 처리되는데, 단 612KB의 메모리 공간만이 할당되고, 이용될 수 있다. 일 실시 예에 따라 레이어가 처리되는데 이용되는 메모리 공간의 크기는 상술한 예에 한하지 않고, 처리되는 데 이터의 크기에 따라서, 다양한 크기의 메모리 공간이 할당되고 이용될 수 있다. 또한, 도 8은, 컨볼루션 레이어에 의해 입력 데이터가 처리되는 일 예를 나타낸 것이나, 일 실시 예에 의하면, 컨볼루션 레이어에 한하지 않고, 다양한 종류의 레이어에도 복수 개의 입력 데이터가 입력될 수 있다. 일 실시 예에 의하면, 상술한 컨볼루션 레이어에 대해 메모리 공간이 할당되는 경우와 동일하게, 다른 종류의 레이어에 대한 메모리 공간도, 복수 개의 채널 중 제1 채널에서 작업을 처리하기 위해 필요한 크기만큼의 메모리가 상기 레이어의 상기 복수 개의 채널에 대한 작업 처리를 위하여 할당될 수 있다. 제1 채널을 제외한 나머지 채널에서 는, 추가적인 메모리 할당 없이, 제1 채널의 작업을 위해 할당된 메모리를 재사용할 수 있다. 도 9는 일 실시 예에 의한 레이어의 입출력 데이터에 대한 메모리를 할당하는 방법을 나타낸 순서도이다. 일 실시 예에 의한 메모리는, 레이어의 입출력 데이터와 각각 대응되는 블롭(blob)에 대하여 할당될 수 있다. 일 실시 예에 의한 신경망 모델은, 작업이 수행되는 레이어와, 레이어에 입출력되는 각각의 데이터와 대응 되는 블롭으로 구성될 수 있다. 일 실시 예에 의하면, 레이어의 입출력 데이터뿐만 아니라, 레이어의 내부 함수로 인해 발생된 중간 데이터에 대한 블롭도 식별될 수 있다. 따라서, 전자 장치는 상기 중간 데이터에 대한 블롭을 더 고려하여 메모리 를 할당할 수 있다. 일 실시 예에 있어서, 메모리 할당은, 데이터가 저장될 메모리의 공간을 컴파일 단계에서 미리 할당하는 동작을 나타낸다. 일 실시 예에 의한 메모리 할당은, 동일한 메모리 공간에 할당될 블롭이 결정된 후, 블롭들의 데이터 크기에 기초하여, 각각의 메모리 공간의 크기가 결정될 수 있다. 도 9를 참조하면, 단계 910에서, 전자 장치는 각각의 프로세서에 대하여 할당된 레이어를 식별할 수 있다. 일 실시 예에 의한 전자 장치는 일 실시 예에 의한 복수의 프로세서에 슬라이스를 할당하는 방법에 따라 복수의 프로세서 중 제1 프로세서에 할당된 적어도 하나의 슬라이스에 포함된 적어도 하나의 레이어를 식 별할 수 있다. 일 실시 예에 의한 전자 장치는 프로세서 별로 일 실시 예에 의한 메모리 할당을 수행할 수 있다. 단계 920에서, 전자 장치는, 하나의 프로세서에 할당된 적어도 하나의 레이어에 대한 실행 순서를 결정할 수 있다. 일 실시 예에 의하면, 전자 장치는 위상 정렬 방법에 따라서, 적어도 하나의 레이어에 대한 처 리 순서를 결정할 수 있다. 상술한 예에 한하지 않고, 다양한 방법에 따라 하나의 레이어에 대한 처리 순서를 결정할 수 있다. 단계 930에서, 전자 장치는 각 레이어에 포함된 내부 함수를 식별하고, 단계 940에서, 식별된 내부 함수 에 의하여, 상기 내부 함수를 포함하는 레이어 내부에서 임시 저장되는 데이터를 포함하는 블롭을 식별할 수 있 다. 일 실시 예에 의하면, 각각의 레이어에 입출력되는 블롭은 신경망 모델의 구조에 관한 정보에 따라 이 미 식별되어 있는 블롭일 수 있다. 예를 들어, 레이어에 두 개 이상의 내부 함수가 포함되어 있는 경우, 두 개의 내부 함수 사이에 임시 저장되는 중간 데이터에 대한 블롭이 존재할 수 있다. 상술한 예에 한하지 않고, 일 실시 예에 따라 레이어의 내부 함수 로 입력되거나 출력되는 데이터에 대한 블롭 중 레이어에 대한 입출력되는 데이터에 대한 블롭을 제외한, 블롭 이 단계 940에서 식별될 수 있다. 일 실시 예에 의하면, 레이어의 내부 함수로 인해 임시 저장되는 블롭에 대하여도, 레이어의 입출력 데이터와 같이 작업 수행 중 데이터가 저장될 메모리가 할당되어야 한다. 따라서, 전자 장치는 레이어의 입출력 데 이터에 대한 블롭뿐만 아니라 레이어 내부의 임시 저장되는 블롭도 고려하여, 메모리 할당을 수행할 수 있다. 단계 950에서, 전자 장치는, 각 레이어에 대한 입출력 데이터에 대한 블롭과, 단계 940에서 식별된 각 레 이어의 내부 함수에 대해 식별된 블롭 중 적어도 하나의 블롭이 저장될 메모리를 할당할 수 있다. 일 실시 예에 의하면, 각 레이어의 처리 순서에 따라 이전 블롭의 사용 구간이 현재 블롭의 데이터가 생성되기 전에 종료되는지 여부에 기초하여, 현재 블롭에 대한 메모리가 할당될 수 있다. 예를 들면, 이전 블롭의 사용 구간이 현재 블롭의 데이터가 생성되기 전에 종료되는 경우, 블롭에 할당된 메모리와 동일한 메모리가 현재 블 롭에 할당될 수 있다. 일 실시 예에 의한 사용 구간은, 블롭의 데이터가 적어도 하나의 레이어에 의해 이용되는 구간에 기초하여 결정 될 수 있다. 예를 들어, 사용 구간은 블롭의 데이터가 상기 데이터가 저장된 메모리 공간(ex. 버퍼)으로부터, 각 레이어의 작업이 수행됨에 의하여, 읽히거나 기록되는 구간을 나타낼 수 있다. 또한, 사용 구간을 결정하기 위한, 블롭의 데이터가 적어도 하나의 레이어에 의해 이용되는 구간은, 블롭의 수 명(lifetime)에 따라 결정될 수 있다. 예를 들어, 블롭의 수명은, 미리 설정된 값이거나, 블롭이 처리되는 레이 어의 함수의 실행 구간에 기초하여 결정될 수 있다. 상술한 예에 한하지 않고, 블롭의 사용 구간은 다양한 방법 에 따라 결정될 수 있다. 예를 들어, 전자 장치는, 제1 레이어에 의한 작업이 종료되면, 상기 제1 레이어의 입력 데이터 및 상기 제1 레이어의 내부 함수에 의해 임시 저장된 데이터는 더 이상 이용되지 않을 수 있다. 따라서, 제1 레이어 이 후 동작되는 제2 레이어의 임시 저장 데이터와 출력 데이터는, 상기 제1 레이어의 입력 데이터 및 상기 제1 레이어의 내부 함수에 의해 임시 저장된 데이터가 저장된 메모리 공간을 이용할 수 있다. 일 실시 예에 의한 전자 장치는, 동일한 메모리가 할당된 적어도 하나의 블롭의 데이터 크기 중 가장 큰 데이터 크기로 상기 메모리의 크기를 결정할 수 있다. 예를 들어, 제1 레이어의 입력 데이터를 나타내는 블롭 1과, 제1 레이어의 임시 저장된 데이터를 나타내는 블롭 2에 대하여, 각각 제2 레이어의 임시 저장 데이터를 나타내는 블롭 3 및 제2 레이어의 출력 데이터를 나타내는 블롭 4와 동일한 메모리가 할당된 것으로 결정될 수 있다. 일 예로, 블롭 1 및 블롭 3에 제1 메모리가 할당될 수 있고, 또한 블롭 2 및 블롭 4에 대해 제2 메모리가 할당될 수 있다. 블롭 1의 데이터 크기가 1kb이고, 블롭 3의 데이터 크기가 2kb인 경우, 제1 메모리는, 제1 메모리에 할당된 블 롭들 중 가장 큰 데이터 크기인 2kb의 크기로 할당될 수 있다. 또한, 블롭 2의 데이터 크기가 4kb이고, 블롭 4 의 데이터 크기가 5kb인 경우, 제2 메모리는, 제2 메모리에 할당된 블롭들 중 가장 큰 데이터 크기인 5kb의 크 기로 할당될 수 있다. 도 10은 일 실시 예에 따라 레이어 내부의 블롭을 식별하는 일 예를 나타낸 도면이다. 도 10을 참조하면, 신경망 모델에 포함된 복수 개의 레이어 중 \"conv2d_65\" 레이어에 대해 내부 함 수 \"im2col\" 및 \"sgemm\"가 식별될 수 있다. 또한, 내부 함수들(1011, 1013) 사이에 임시 저장되는 블롭 b2이 식별될 수 있다. 일 실시 예에 의한 블롭 b1 및 블롭 b3는 각각 \"conv2d_65\" 레이어에 대한 입력 데이터 및 출력 데이터를 나타내는 블롭이다. 따라서, 일 실시 예에 의하면, \"conv2d_65\" 레이어에 대해, 블롭 b1, 블롭 b2, 및 블롭 b3이 식별되고, 식별된 블롭들에 대해 메모리 할당이 수행될 수 있다. 일 실시 예에 의하면, 각 블롭에 대해 할당되는 메모리는, 이전 블롭의 사용 구간이 현재 블롭의 데이터가 생성 되기 전에 종료되는지 여부에 기초하여, 할당될 수 있다. 예를 들면, 블롭 b1는, \"im2col\"의 처리가 종료된 후, \"sgemm\"이 처리되는 시점부터는 더 이 상 이용되지 않을 수 있다. 블롭 b1의 사용 구간은, 블롭 b3의 데이터가 생성되기 전에 종료될 수 있다. 따라서, 일 실시 예에 의하면, 블롭 b1와 블롭 b3에는 동일한 메모리가 할당될 수 있다. 예를 들어, \"sgemm\"이 처리될 때, 블롭 b1이 할당된 동일한 메모리 공간에 기 저장된 블롭 b1가 삭제된 후, 블롭 b3의 데이터가 저장될 수 있다. 또한, 블롭 b2에는, 블롭 b1 이전에 존재하는 블롭들 중 사용 구간이 블롭 b2의 생성 전에 종 료되는 블롭에 대해 할당된 메모리가 재할당될 수 있다. 도 11은 일 실시 예에 따라 레이어 내부의 블롭을 포함한 신경망 모델의 블롭에 대해 메모리를 할당하는 일 예를 나타낸 것이다. 일 실시 예에 의하면, 복수 개의 레이어들의 입출력 데이터를 나타내는 블롭들(1101, 1103, 1104, 1105, 1106, 1108, 1109, 1115, 1111)이 식별될 수 있다. 또한, 각 레이어들의 내부 함수로 인해 임시 저장될 수 있는 데이 터를 나타내는 블롭들(1102, 1107)이 식별될 수 있다. 도 11에서, 빗금 표시된 블록은 작업이 수행될 수 있는 레이어를 나타내고, 빗금 표시되지 않은 블록은 데이터 를 나타내는 블롭을 나타낸다. 일 실시 예에 의하면, data 블롭, col_buffer1 블롭 및 conv1 블롭은 각 블롭의 사용 구간 이 서로 겹침에 따라 서로 다른 메모리에 할당될 수 있다. 예를 들면, data 블롭, col_buffer1 블롭 및 conv1 블롭은 각각 b1, b2, 및 b3 메모리에 할당될 수 있다. 또한, data 블롭 및 col_buffer1 블롭은 conv1 레이어에서 이용된 후 conv1 레이어 다음에 처리되 는 relu1 레이어 이하에서는 더 이상 이용되지 않을 수 있다. 따라서, data 블롭 및 col_buffer1 블롭 의 사용 구간이 relu1 블롭이 생성되기 전에 종료될 수 있다. relu1 블롭은 data 블롭 또는 col_buffer1 블롭과 동일한 메모리인, b1 또는 b2 메모리에 할당될 수 있다. 일 실시 예에서relu1 블롭은 b1 메모리에 할당된 것으로 가정한다. 또한, norm1 블롭은, norm1 블롭이 생성되기 전에, 사용 구간이 종료된 블롭이 저장된 메모리에 할 당될 수 있다. 예를 들면, norm1 블롭은 b2 또는 b3 메모리에 할당될 수 있다. 일 실시 예에서 norm1 블 롭은 b2 메모리에 할당된 것으로 가정한다. 또한, pool1 블롭은, pool1 블롭이 생성되기 전에, 사용 구간이 종료된 블롭이 저장된 메모리인 b1 또는 b2 메모리에 할당될 수 있다. 일 실시 예에서 pool1 블롭은 b1 메모리에 할당된 것으로 가정한다. 또한, col_buffer2 블롭은, col_buffer2 블롭이 생성되기 전에, 사용 구간이 종료된 블롭이 저장 된 메모리인 b2 또는 b3 메모리에 할당될 수 있다. 일 실시 예에서 col_buffer2 블롭은 b2 메모리에 할당 된 것으로 가정한다. 또한, conv2 블롭은, conv2 블롭이 생성되기 전에, 사용 구간이 종료된 블롭이 저장된 메모리인 b3 메모리에 할당될 수 있다. 또한, relu2 블롭은, relu2 블롭이 생성되기 전에, 사용 구간이 종료된 블롭이 저장된 메모리인 b1 또는 b2 메모리에 할당될 수 있다. 일 실시 예에서 relu2 블롭은 b1 메모리에 할당된 것으로 가정한다. 또한, norm2 블롭은, norm2 블롭이 생성되기 전에, 사용 구간이 종료된 블롭이 저장된 메모리인 b2 또는 b3 메모리에 할당될 수 있다. 일 실시 예에서 norm2 블롭은 b2 메모리에 할당된 것으로 가정한다. 또한, pool2 블롭은, pool2 블롭이 생성되기 전에, 사용 구간이 종료된 블롭이 저장된 메모리인 b1 또는 b2 메모리에 할당될 수 있다. 일 실시 예에서 pool2 블롭은 b1 메모리에 할당된 것으로 가정한다. 일 실시 예에 의하면, 상술한 방법에 따라 각각의 블롭들을 b1, b2 또는 b3 메모리에 각각 할당한 후, 각 메모 리에 할당된 블롭들의 데이터 크기 중 가장 큰 값을 기준으로, b1, b2 및 b3 메모리의 크기를 결정할 수 있다. 일 실시 예에 의한 각 블롭들의 데이터 크기는 아래 표 2와 같은 값을 가질 수 있다. 표 2 블롭 이름 타입 데이터 크기(MB) 할당된 메모리 data 입출력 데이터 0.59 b1 col_buffer1 내부 데이터 4.19 b2 conv1 입출력 데이터 1.11 b3 relu1 입출력 데이터 1.11 b1 norm1 입출력 데이터 1.11 b2 pool1 입출력 데이터 0.27 b1 col_buffer2 내부 데이터 6.67 b2 conv2 입출력 데이터 0.71 b3 relu2 입출력 데이터 0.71 b1 norm2 입출력 데이터 0.71 b2 pool2 입출력 데이터 0.17 b1 일 실시 예에 의하면, b1 메모리에 할당된 data 블롭, relu1 블롭, pool1 블롭, relu2 블롭 및 pool2 블롭의 데이터 크기 중 가장 큰 값인 1.11 MB을 기준으로 b1 메모리의 크기가 결정될 수 있다. 또한, b2 메모리에 할당된 col_buffer1 블롭, norm1 블롭, col_buffer2 블롭, norm2 블롭 의 데이터 크기 중 가장 큰 값인 6.67 MB을 기준으로 b2 메모리의 크기가 결정될 수 있다. 또한, b3 메모리에 할당된 colv1 블롭, conv2 블롭의 데이터 크기 중 가장 큰 값인 1.11MB을 기준 으로 b3 메모리의 크기가 결정될 수 있다. 따라서, 일 실시 예에 의하면, 도 11에 도시된 블롭들을 저장하는데 b1, b2, b3 메모리 크기를 합친 8.89MB 크 기의 메모리 공간이 이용될 수 있다. 내부 데이터에 대한 블롭 없이 입출력 데이터에 대한 블롭에 대하여만 메모리가 할당되는 경우, 내부 데이터에 대한 블롭을 저장하기 위한 메모리를 다시 할당하여야 하므로, 메모리 할당 공간이 증가할 수 있다. 그러나, 일 실시 예에 의하면, 입출력 데이터에 대한 블롭뿐만 아니라 레이어의 내부 함수로 인해 생성되는 내 부 데이터에 대한 블롭도 고려하여 메모리가 할당됨에 따라 더 적은 크기의 메모리 공간이 할당될 수 있다. 도 12는 일 실시 예에 의한 복수의 프로세서에 의해 신경망 모델이 처리되는 일 예를 나타낸 도면이다. 일 실시 예에 의한 복수의 프로세서에 레이어를 할당하는 방법에 따르면, 레이어 1 내지 4(1201, 1202, 1203, 1204)는 각각 CPU, GPU, GPU, CPU에 의해 처리될 수 있다. CPU에서 처리되는 레이어 1 및 레이어 4의 입출력 데이터에 대한 블롭 및 내부 데이터에 대한 블롭 은 일 실시 예에 의한 메모리 할당 방법에 따라 메모리가 할당될 수 있다. 예를 들면, 레이어 1의 블롭 (예를 들면, 레이어 1의 입출력 데이터 또는 내부 데이터를 포함하는 블롭)에 할당된 메모리 중 적어도 하나의 메모리는 레이어 4의 블롭에도 재할당될 수 있다. 일 실시 예에 의하면, 동일한 레이어 내에 복수 개의 내부 데이터에 대한 블롭들이 존재하는 경우, 각각의 블롭 들 간 동일한 메모리가 할당될 수 있다. 일 실시 예에 의하면, 레이어 1에서 서로 다른 내부 함수에 의해 생성되는 서로 다른 내부 데이터에 대하 여, 블롭 1 내지 4(1205, 1206, 1207, 1208)가 레이어 1에 존재할 수 있다. 예를 들어, 직렬적으로 배열 된 내부 함수 1 내지 4에 의한 출력 데이터는 각각 블롭 1 내지 4(1205, 1206, 1207, 1208)로 나타낼 수 있다. 또한, 블롭 4의 데이터는 내부 함수 5의 입력 데이터로 이용될 수 있다. 일 실시 예에 의하면, 블롭 1의 내부 함수 1의 작업이 종료된 후, 블롭 3의 내부 함수 3의 작업이 수행될 수 있으므로, 블롭 1의 사용 구간은 블롭 3이 생성되기 전에 종료될 수 있다. 따라서, 블롭 1에 할당된 메모리가 블롭 3에 재할당될 수 있다. 또한, 블롭 2의 내부 함수 2의 작업이 종료된 후, 블롭 4의 내부 함수 4의 작업이 수행될 수 있으 므로, 블롭 2의 사용 구간은 블롭 4이 생성되기 전에 종료될 수 있다. 따라서, 블롭 2에 할 당된 메모리가 블롭 4에 재할당될 수 있다. 일 실시 예에 의하면, 복수의 프로세서를 이용하여 더 빠르고 정확도 높게 신경망 모델을 처리할 수 있다. 일 실시예는 컴퓨터에 의해 실행되는 프로그램 모듈과 같은 컴퓨터에 의해 실행가능한 명령어를 포함하는 기록 매체의 형태로도 구현될 수 있다. 컴퓨터 판독 가능 매체는 컴퓨터에 의해 액세스될 수 있는 임의의 가용 매체 일 수 있고, 휘발성 및 비휘발성 매체, 분리형 및 비분리형 매체를 모두 포함한다. 또한, 컴퓨터 판독가능 매체 는 컴퓨터 저장 매체 및 통신 매체를 모두 포함할 수 있다. 컴퓨터 저장 매체는 컴퓨터 판독가능 명령어, 데이 터 구조, 프로그램 모듈 또는 기타 데이터와 같은 정보의 저장을 위한 임의의 방법 또는 기술로 구현된 휘발성 및 비휘발성, 분리형 및 비분리형 매체를 모두 포함한다. 통신 매체는 전형적으로 컴퓨터 판독가능 명령어, 데 이터 구조, 또는 프로그램 모듈을 포함하며, 임의의 정보 전달 매체를 포함한다. 또한, 본 명세서에서, “부”는 프로세서 또는 회로와 같은 하드웨어 구성(hardware component), 및/또는 프로 세서와 같은 하드웨어 구성에 의해 실행되는 소프트웨어 구성(software component)일 수 있다."}
{"patent_id": "10-2019-0103878", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "전술한 본 발명의 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가 지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본 발명의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으 로 해석되어야 한다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12"}
{"patent_id": "10-2019-0103878", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시 예에 의한 전자 장치에서 신경망 모델을 처리하는 일 예를 나타낸 도면이다. 도 2는 일 실시 예에 따라 신경망 모델의 레이어가 적어도 하나의 슬라이스로 할당되는 일 예를 나타낸 도면이 다. 도 3 는 일 실시 예에 의한 전자 장치의 내부 구성을 설명하기 위한 블록도이다. 도 4은 일 실시 예에 의한 전자 장치의 내부 구성을 설명하기 위한 블록도이다. 도 5는 일 실시 예에 의한 복수의 프로세서를 이용하여 신경망 모델을 처리하는 방법을 나타낸 순서도이다. 도 6은 일 실시 예에 따른 슬라이스를 복수의 프로세서에 할당하는 방법을 나타낸 순서도이다. 도 7은 일 실시 예에 의한 슬라이스에 프로세서를 할당하는 일 예를 나타낸 도면이다. 도 8은 일 실시 예에 의한 레이어에서 메모리가 할당되는 일 예를 나타낸 도면이다. 도 9는 일 실시 예에 의한 레이어의 입출력 데이터에 대한 메모리를 할당하는 방법을 나타낸 순서도이다. 도 10은 일 실시 예에 따라 레이어 내부의 블롭을 식별하는 일 예를 나타낸 도면이다. 도 11은 일 실시 예에 따라 레이어 내부의 블롭을 포함한 신경망 모델의 블롭에 대해 메모리를 할당하는 일 예 를 나타낸 것이다. 도 12는 일 실시 예에 의한 복수의 프로세서에 의해 신경망 모델이 처리되는 일 예를 나타낸 도면이다."}
