{"patent_id": "10-2023-0070230", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0171826", "출원번호": "10-2023-0070230", "발명의 명칭": "카메라를 이용한 제세동기 관리 시스템", "출원인": "주식회사메디아나", "발명자": "이성호"}}
{"patent_id": "10-2023-0070230", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "AED(Automated External Defibrillator, 자동제세동기), 또는 AED를 내장, 보관하는 AED 함체에 구비되며, AED고장여부를 표시하는 AED 고장여부 표시부를 포함하는 AED 상태 표시부;AED 상태 표시부를 포함하는 영상을 촬영하는, 카메라;카메라로 촬영된 영상을 주기적으로 취합하는 영상 데이터 취합부;영상 데이터 취합부로부터 수신된 카메라 영상으로부터 AED 상태 표시부의 영상을 추출하고, AED 상태 표시부의영상에 포함된 AED 고장여부 표시부의 영상을 이용하여 AED 고장 여부를 판단하는 연산처리부를 포함하는 AED관리부;를 포함하는 것을 특징으로 하는, 카메라를 이용한 제세동기 관리 시스템."}
{"patent_id": "10-2023-0070230", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,AED 상태 표시부는, 배터리 잔량 표시부를 포함하며, 연산처리부는 AED 상태 표시부의 영상에 포함된 배터리 잔량 표시부의 영상을 이용하여 AED 배터리의 잔량 정도를 판단하는 것을 특징으로 하는, 카메라를 이용한 제세동기 관리 시스템."}
{"patent_id": "10-2023-0070230", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,AED 상태 표시부는 패드 불량여부 표시부를 더 포함하며, 연산처리부는 AED 상태 표시부의 영상에 포함된 패드 불량여부 표시부의 영상을 이용하여 전극 패드의 불량 여부를 판단하는 것을 특징으로 하는, 카메라를 이용한 제세동기 관리 시스템."}
{"patent_id": "10-2023-0070230", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,AED 함체는, 상부 커버에 투명창을 구비하여, AED 함체 내에 AED가 내장되어 있는지를 알 수 있도록 이루어진것을 특징으로 하는, 카메라를 이용한 제세동기 관리 시스템."}
{"patent_id": "10-2023-0070230", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 연산처리부는 영상 데이터 취합부로부터 수신된 카메라 영상으로부터 AED 함체의 투명창의 영상을 추출하고, 추출된 투명창의 영상을 이용하여 AED가 AED 함체 내에의 내장 여부를 판단하는 것을 특징으로 하는, 카메라를 이용한 제세동기 관리 시스템."}
{"patent_id": "10-2023-0070230", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,AED 관리부는 AED가 고장으로 판단되거나, AED 배터리의 잔량이 없다고 판단되거나, 전극 패드가 불량으로 판단되거나, AED가 AED 함체 내에 내장되어 있지 않다고 판단되면, 알람신호를 관리자 개인단말로 송부하는 것을 특징으로 하는, 카메라를 이용한 제세동기 관리 시스템."}
{"patent_id": "10-2023-0070230", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2024-0171826-3-제6항에 있어서, 연산처리부는 AED 상태 표시부의 영상을, 기학습된 고장 판별 인공지능 모델에 적용하고, 고장 판별 인공지능모델의 출력을 고장여부 판단 결과로 하는 것을 특징으로 하는, 카메라를 이용한 제세동기 관리 시스템."}
{"patent_id": "10-2023-0070230", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서, 연산처리부는 AED 고장여부 표시부의 영상을, 기 저장된 AED의 정상 표시 영상과 패턴 인식을 행하여, AED 고장여부 표시부의 영상이, 기 저장된 AED의 정상 표시 영상과 다르다면, AED를 고장으로 판단하는 것을 특징으로하는, 카메라를 이용한 제세동기 관리 시스템."}
{"patent_id": "10-2023-0070230", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서, 카메라는 CCTV인 것을 특징으로 하는, 카메라를 이용한 제세동기 관리 시스템."}
{"patent_id": "10-2023-0070230", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제4항에 있어서, 카메라 영상 속의 AED 상태 표시부의 영상은, AED 또는 AED 함체에 구비된 AED 상태 표시부가 촬영된 영상이거나,AED 함체의 투명창을 촬영하여, 투명창 속의 AED의 AED 상태 표시부가 촬영된 영상인 것을 특징으로 하는, 카메라를 이용한 제세동기 관리 시스템."}
{"patent_id": "10-2023-0070230", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "AED(Automated External Defibrillator, 자동제세동기) 또는 AED 함체에 구비된 AED 상태 표시부를 포함하여촬영된 카메라 영상을 이용하여, AED의 고장여부를 판단하는 연산처리부를 포함하는, 카메라를 이용한 제세동기관리 시스템의 구동방법에 있어서, 연산처리부는 카메라로 촬영된 카메라 영상에서 AED 상태 표시부의 영상을 추출하는, AED 상태 표시부 영상 추출단계;연산처리부는 AED 상태 표시 영상 추출단계에서 추출된 AED 상태 표시 영상으로부터, AED 고장표시부의 영상을추출하고, 추출된 AED 고장표시부의 영상으로부터, AED가 정상인지, 아니면 AED의 고장인지를 판단하는, AED 상태 표시부 영상 판단단계; 연산처리부는 AED 상태 표시부 영상 판단단계에서, AED가 고장으로 판단되었으면, AED의 고장임을 알리는 알람을 관리자 개인단말(200)로 전송하는, AED 고장 알림단계;를 포함하는 것을 특징으로 하는, 카메라를 이용한 제세동기 관리 시스템의 구동방법."}
{"patent_id": "10-2023-0070230", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, AED 상태 표시부 영상 판단단계는, 연산처리부가 AED 상태 표시부 영상으로부터, 배터리 잔량 표시부의 영상을추출하고, 추출된 배터리 잔량 표시부의 영상으로부터 배터리의 잔량 정도를 결정하고, 배터리 잔량 정도가 기설정된 문턱치보다 작은지를 판단하여 작다면 배터리 교체시점으로 판단하는 것을 포함하며, AED 고장 알림단계는, 연산처리부가 AED 상태 표시부 영상 판단단계에서, 배터리 교체시점으로 판단되면, 배터리 교체시점임을 알리는 알람을 관리자 개인단말(200)로 전송하는 것을 포함하는 것을 특징으로 하는, 카메라를이용한 제세동기 관리 시스템의 구동방법."}
{"patent_id": "10-2023-0070230", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서, 공개특허 10-2024-0171826-4-AED 상태 표시부 영상 판단단계는, 연산처리부가 AED 상태 표시부 영상으로부터, 패드 불량여부 표시부의 영상을 추출하고, 추출된 패드 불량여부 표시부의 영상으로부터 패드 불량을 나타내는 표시를 검출하면 패드 불량으로 판단하는 것을 포함하며, AED 고장 알림단계는, 연산처리부가 AED 상태 표시부 영상 판단단계에서, 패드 불량으로 판단되면, 패드 불량을알리는 알람을 관리자 개인단말(200)로 전송하는 것을 포함하는 것을 특징으로 하는, 카메라를 이용한 제세동기관리 시스템의 구동방법."}
{"patent_id": "10-2023-0070230", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서, AED 상태 표시부 영상 판단단계는, 연산처리부가 AED 상태 표시부의 영상을, 기학습된 고장 판별 인공지능 모델에 적용하고, 고장 판별 인공지능 모델의 출력을 고장여부 판단 결과로 하는 것을 특징으로 하는, 카메라를 이용한 제세동기 관리 시스템의 구동방법."}
{"patent_id": "10-2023-0070230", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11항에 있어서, AED 상태 표시부 영상 판단단계는, 연산처리부가 AED 고장여부 표시부의 영상을, 기 저장된 AED의 정상 표시 영상과 패턴 인식을 행하여, AED 고장여부 표시부의 영상이, 기 저장된 AED의 정상 표시 영상과 다르다면, AED를고장으로 판단하는 것을 특징으로 하는, 카메라를 이용한 제세동기 관리 시스템의 구동방법."}
{"patent_id": "10-2023-0070230", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제12항에 있어서, AED 함체는, 상부 커버에 투명창을 구비하여, AED 함체 내에 AED가 내장되어 있는지를 알 수 있게 하는 것을 특징으로 하는, 카메라를 이용한 제세동기 관리 시스템의 구동방법,"}
{"patent_id": "10-2023-0070230", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서, AED 상태 표시부 영상 판단단계는, 연산처리부가 영상 데이터 취합부로부터 수신된 카메라 영상으로부터 AED 함체의 투명창의 영상을 추출하고, 추출된 투명창의 영상을 이용하여, AED가 AED 함체 내에 내장되어 있는지 여부를 판단하는 것을 포함하며, AED 고장 알림단계는, 연산처리부가 AED 상태 표시부 영상 판단단계에서, AED가 AED 함체 내에 내장되어 있지않는 것으로 판단되면, AED가 AED 함체 내에 내장되어 있지 않음을 알리는 알람을 관리자 개인단말(200)로 전송하는 것을 포함하는 것을 특징으로 하는, 카메라를 이용한 제세동기 관리 시스템의 구동방법."}
{"patent_id": "10-2023-0070230", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제4항에 있어서, AED 상태 표시부 영상 추출단계에서 추출된 AED 상태 표시부의 영상은, AED 또는 AED 함체에 구비된 AED 상태 표시부가 촬영된 영상이거나,AED 함체의 투명창을 촬영하여, 투명창 속의 AED의 AED 상태 표시부가 촬영된 영상인 것을 특징으로 하는, 카메라를 이용한 제세동기 관리 시스템의 구동방법."}
{"patent_id": "10-2023-0070230", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은, 카메라와 제세동기가 설치된 엘리베이터 등의 공간에서, 카메라가 제세동기의 상태표시부를 주기적으 로 촬영하여, 영상 데이터 취합부로 전송하고, 영상 데이터 취합부로부터 제세동기 관리 서버로 전송하여 제세동 기의 상태점검 및 관리를 행하는, 카메라를 이용한 제세동기 관리 시스템에 관한 것이다. (뒷면에 계속)"}
{"patent_id": "10-2023-0070230", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은, 카메라와 제세동기가 설치된 엘리베이터 등의 공간에서, 카메라가 제세동기의 상태표시부를 주기적 으로 촬영하여, 영상 데이터 취합부로 전송하고, 영상 데이터 취합부로부터 제세동기 관리 서버로 전송하여 제 세동기의 상태점검 및 관리를 행하는, 카메라를 이용한 제세동기 관리 시스템에 관한 것이다."}
{"patent_id": "10-2023-0070230", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "심장마비가 발생하면 온몸으로의 혈액 순환이 중단되기 때문에, 바로 조치를 취하지 않으면 사망하거나 심각한 뇌손상이 일어날 수 있다. 특히, 뇌는 혈액 공급이 4-5분만 중단돼도 영구적으로 손상될 수 있다. 자동제세동기(Automated External Defibrillator, AED)는 일반적으로 음성 안내를 받으면서 심폐소생술을 할 수 있는 장치로, 환자의 심장상태를 체크하여 자동적으로 전기충격을 줄 수 있도록 이루어져 있다. 일반적으로 심정지 발생 이후, 1분에 약 10%가량 소생률이 떨어지므로, 5분을 넘기지 않고 AED를 사용하여 CPR 과 제세동을 제공해야 한다. 그러므로, AED에의 접근성이 소생률 증가에 매우 중요하며, 최근에는 엘리베이터, 식당, 사무실 등의 다양한 실내 공간에 AED를 설치하고 있으며, 또한 카메라도 설치되어 있다. 특히, 사망 장소 1위는 가정 집으로, 약 60%의 심장마비가 집에서 발생하고 있다. 그래서 공공 주택 등에서는 엘리베이터 내에 비치되는 경우가 많다. 그런데, 심장마비환자가 자주 발생하는 것이 아니기 때문에, 실제 심장마비환자가 발생했을 때, AED가 고장나거 나, 배터리 잔량이 없는 등의 이유로 AED가 동작하지 않을 수 있다. 이를 위해 주기적으로 AED의 상태 체크 및 관리가 필요하다. 대부분의 AED들은, AED 또는 AED 보관함의 일측에, AED 고장 유무, 배터리 잔량 상태 등의 AED 상태를 나타내는 AED 상태 창을 구비한다. AED를 관리하는 관리자가 AED를 구비한 장소로 가서, AED 또는 AED 보관함에 구비된 AED 상태 창을 보고 AED를 관리하고 있다. 그러나 관리자가 AED 또는 AED 보관함의 위치까지 이동하여서 관리 하는 것이라 수시점검이 어렵다. 이를 위해 최근, 인터넷, 무선통신 등을 이용하여 AED를 관리하는 방법들이 연 구되고 있다. 그러나, 엘리베이터에 추가 네트워크 기기 설치시 법규제한과 안전관리 문제로 어려움이 있어, AED의 관리가 어 렵다. 따라서 이미 설치된 카메라(CCTV 기기)를 사용하여 AED를 관리하는 방법이 요망된다. 본 발명은 카메라와 제세동기가 설치된 엘리베이터 등의 공간에서, 카메라가 제세동기의 상태표시부를 주기적으 로 촬영하여, 영상 데이터 취합부로 전송하고, 영상 데이터 취합부로부터 제세동기 관리 서버로 전송하여 제세 동기의 상태점검 및 관리를 행하는, 카메라를 이용한 제세동기 관리 시스템을 제안한다. 국내 등록특허 제10-1155022호는 심장제세동기의 운영시스템에 관한 것으로, 이는 제세동기 보관함과 통신 연결 되고 관리한다. 따라서 국내 등록특허 제10-1155022호는 인터넷, 무선통신 등이 어려운 장소에서는 적용하기 어 렵다."}
{"patent_id": "10-2023-0070230", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 과제는, 카메라와 제세동기가 설치된 공간에서, 카메라가 제세동기의 상태표시부를 주기적으로 촬영하여, 영상 데이터 취합부로 전송하고, 영상 데이터 취합부로부터 제세동기 관리 서버로 전송하 여 제세동기의 상태점검 및 관리를 행하는, 카메라를 이용한 제세동기 관리 시스템을 제공하는 것이다."}
{"patent_id": "10-2023-0070230", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 과제를 해결하기 위해, 본 발명의 카메라를 이용한 제세동기 관리 시스템은, AED((Automated External Defibrillator, 자동제세동기)를 내장하는 함체로, AED 고장여부를 표시하는 AED 고장여부 표시부를 포함하는 AED 상태 표시부을 구비하는, AED 함체; AED 상태 표시부을 포함하는 AED 함체의 영상을 촬영하는, 카메라; 카 메라로 촬영된 영상을 주기적으로 취합하는 영상 데이터 취합부; 영상 데이터 취합부로부터 수신된 카메라 영상 으로부터 AED 상태 표시부의 영상을 추출하고, AED 상태 표시부의 영상에 포함된 AED 고장여부 표시부의 영상을 이용하여 AED 고장 여부를 판단하는 연산처리부를 포함하는 AED 관리부;를 포함하는 것을 특징으로 한다. AED 상태 표시부은 배터리 잔량 표시부를 더 포함하며, 연산처리부는 AED 상태 표시부의 영상에 포함된 배터리 잔량 표시부의 영상을 이용하여 AED 배터리의 잔량 정도를 판단한다. AED 상태 표시부은 패드 불량여부 표시부를 더 포함하며, 연산처리부는 AED 상태 표시부의 영상에 포함된 패드 불량여부 표시부의 영상을 이용하여 전극 패드의 불량 여부를 판단한다. AED 함체는, 상부 커버에 유리창으로 이루어져, AED 함체 내에 AED가 내장되어 있는지를 알 수 있게 하는, AED 내장여부 표시부를 더 구비하며, 연산처리부는 영상 데이터 취합부로부터 수신된 카메라 영상으로부터 AED 내장 여부 표시부의 영상을 추출하여, 추출된 AED 내장여부 표시부의 영상을 이용하여 AED가 AED 함체 내에 내장 여 부를 판단한다. AED 관리부는 AED가 고장으로 판단되거나, AED 배터리의 잔량이 없다고 판단되거나, 전극 패드가 불량으로 판단 되거나, AED가 AED 함체 내에 내장되어 있지 않다고 판단되면, 알람신호를 관리자 개인단말로 송부한다. 연산처리부는 AED 상태 표시부의 영상을, 기학습된 고장 판별 인공지능 모델에 적용하고, 고장 판별 인공지능 모델의 출력을 고장여부 판단 결과로 할 수 있다. 또는 연산처리부는 AED 고장여부 표시부의 영상을, 기 저장된 AED의 정상 표시 영상과 패턴 인식을 행하여, AED 고장여부 표시부의 영상이, 기 저장된 AED의 정상 표시 영상 과다르다면, AED를 고장으로 판단할 수 있다. 카메라는 CCTV 이다. 본 발명은, AED((Automated External Defibrillator, 자동제세동기)를 내장하며 AED 상태 표시부을 구비한 AED 함체를, 촬영한 카메라 영상을 이용하여, AED의 고장여부를 판단하는 연산처리부를 포함하는, AED를 관리하는 제세동기 관리 시스템에 있어서, 연산처리부는 카메라로 촬영된 카메라 영상에서 AED 상태 표시부의 영상을 추 출하는, AED 상태 표시부 영상 추출단계; 연산처리부는 AED 상태 표시 영상 추출단계에서 추출된 AED 상태 표시 영상으로부터, AED 고장표시부의 영상을 추출하고, 추출된 AED 고장표시부의 영상으로부터, AED가 정상인지, 아 니면 AED의 고장인지를 판단하는, AED 상태 표시부 영상 판단단계; 연산처리부는 AED 상태 표시부 영상 판단단 계에서, AED가 고장으로 판단되었으면, AED의 고장임을 알리는 알람을 관리자 개인단말로 전송하는, AED 고장 알림단계;를 포함하는 것을 특징으로 한다. AED 상태 표시부 영상 판단단계는, 연산처리부가 AED 상태 표시부 영상으로부터, 배터리 잔량 표시부의 영상을 추출하고, 추출된 배터리 잔량 표시부의 영상으로부터 배터리의 잔량 정도를 결정하고, 배터리 잔량 정도가 기 설정된 문턱치보다 작은지를 판단하여 작다면 배터리 교체시점으로 판단하는 것을 포함하며, AED 고장 알림단계 는, 연산처리부가 AED 상태 표시부 영상 판단단계에서, 배터리 교체시점으로 판단되면, 배터리 교체시점임을 알 리는 알람을 관리자 개인단말로 전송하는 것을 포함한다. AED 상태 표시부 영상 판단단계는, 연산처리부가 AED 상태 표시부 영상으로부터, 패드 불량여부 표시부의 영상 을 추출하고, 추출된 패드 불량여부 표시부의 영상으로부터 패드 불량을 나타내는 표시를 검출하면 패드 불량으 로 판단하는 것을 포함하며, AED 고장 알림단계는, 연산처리부가 AED 상태 표시부 영상 판단단계에서, 패드 불 량으로 판단되면, 패드 불량을 알리는 알람을 관리자 개인단말로 전송하는 것을 포함한다. AED 상태 표시부 영상 판단단계는, 연산처리부가 AED 상태 표시부의 영상을, 기학습된 고장 판별 인공지능 모델 에 적용하고, 고장 판별 인공지능 모델의 출력을 고장여부 판단 결과로 할 수 있다. 또는 AED 상태 표시부 영상 판단단계는, 연산처리부가 AED 고장여부 표시부의 영상을, 기 저장된 AED의 정상 표시 영상과 패턴 인식을 행하 여, AED 고장여부 표시부의 영상이, 기 저장된 AED의 정상 표시 영상과 다르다면, AED를 고장으로 판단할 수 있 다. AED 함체는, 상부 커버에 유리창으로 이루어져, AED 함체 내에 AED가 내장되어 있는지를 알 수 있게 하는, AED 내장여부 표시부를 더 구비하며, AED 상태 표시부 영상 판단단계는, 연산처리부가 영상 데이터 취합부로부터 수 신된 카메라 영상으로부터 AED 내장여부 표시부의 영상을 추출하여, 추출된 AED 내장여부 표시부의 영상을 이용 하여 AED가 AED 함체 내에 내장 여부를 판단하는 것을 포함하며, AED 고장 알림단계는, 연산처리부가 AED 상태 표시부 영상 판단단계에서, AED가 AED 함체 내에 내장되어 있지 않는 것으로 판단되면, AED가 AED 함체 내에 내 장되어 있지 않음을 알리는 알람을 관리자 개인단말로 전송하는 것을 포함한다."}
{"patent_id": "10-2023-0070230", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 카메라를 이용한 제세동기 관리 시스템은, 카메라가 제세동기의 상태표시부를 주기적으로 촬영하여, 영상 데이터 취합부로 전송하고, 영상 데이터 취합부로부터 제세동기 관리 서버로 전송하여 제세동기의 상태점 검 및 관리를 행한다. 따라서, 본 발명은 법규제한과 안전관리 문제 등의 이유로, 엘리베이터 등에 추가 네트워크 기기 설치가 제한된 경우에도, AED의 관리가 가능하다. 또한, 본 발명은 AED의 관리를 위해 새로운 AED를 필요로 하지 않고, 기존의 AED를 그대로 사용하여 주기적인 관리가 가능하다는 장점이 있다."}
{"patent_id": "10-2023-0070230", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 카메라를 이용한 제세동기 관리 시스템을 첨부된 도면을 참조하여 상세히 설명한다. 도 1a는 AED 함체의 일실시예로, AED 함체의 투명창을 통해 보이는 AED의 AED 상태 표시부를 설명하는 설명도이 고, 도 1b는 AED 함체의 다른 실시예로, AED 함체에 구비된 AED 상태 표시부를 설명하는 설명도이고, 도 2은 본 발명의 카메라를 이용한 제세동기 관리 시스템을 개략적으로 설명하는 설명도이다. 도 1a의 (a)는 AED를 나타내고, 도 1a의 (b)는 AED 함체의 일예를 나타내고, 도 1a의 (c)는 AED를 도 1a의 (b)의 AED 함체에 삽입한 상태의 일예를 나타낸다. AED는 심폐소생술을 할 수 있는 장치로, 환자의 심장상태를 체크하여 자동적으로 전기충격을 줄 수 있도록 이루어진 장치로, 일반적으로, 배터리의 잔량, AED의 고장여부를 디스플레이하는 AED 상태 표시부를 구비한 다. AED는 AED의 배터리의 잔량, AED의 고장여부를 판단하여 AED 상태 표시부에 디스플레이한다. AED 함체는 AED를 보관하기 위해 내측에 AED를 삽입, 보관하도록 이루어진 함체로, 일반적으로 전면에 투명 창을 구비한다. AED 함체는 도 1a에서와 같이, 투명창을 통해, AED 함체 내에 들어 있는 AED를 확인할 수 있는 데. 특히 투명창을 통해, AED의 AED 상태 표시부를 볼 수 있다. 경우에 따라서, AED 함체는 도 1b에서와 같이, AED 함체에 AED 상태 표시부를 구비할 수 있으며, 이 경우에는, AED와 AED 함체가 구비되어, AED 함체에서 AED의 상태를 체크하여 AED 함체(2 0)의 외측 일측에 구비된 AED 상태 표시부로 출력한다. 일반적으로, 실내 등에 AED를 비치할 경우, 그냥 AED만을 비치하거나, AED 함체에 AED 함체를 수납하여 비치할 수 있다. 카메라는 AED 함체의 투명창을 통해 보이는 AED 상태 표시부, 또는 AED의 AED 상태 표시 부, 또는 AED 함체의 AED 상태 표시부를 촬영가능한 위치에 놓여진 카메라로, 촬영된 카메라의 영 상을 주기적으로 영상 데이터 취합부로 전송한다. 카메라의 영상은 AED 상태 표시부를 포함한다. 카메 라는 CCTV(Closed-circuit Television, 폐쇄회로 텔레비전)로, 웹카메라, 일반카메라등을 사용할 수 있다. 카메라, 즉, CCTV로 AED 상태 표시부를 포함하는 동영상을 촬영하여 AED가 정상인지 여부를 판단하기까 지의 동작이, 깜박이는 동작(LED나 다른 방법)으로 표현할 경우, 상기 동영상을 10초 영상 단위로 나누어, AED 의 정상 여부를 판단한다고 할 수 있다. 영상 데이터 취합부는 카메라로부터 영상 데이터를 수신하는 수단으로, 카메라로부터 AED 상태 표 시부의 영상을 수신하여 AED 관리부로 전송한다. 경우에 따라서, 영상 데이터 취합부는 엘리베이터 관리 시스템 또는 빌딩 관리 시스템 등의 영상 데이터 취 합부일 수 있다. AED 관리부는 영상 데이터 취합부로부터 수신된 카메라 영상으로부터 AED 상태 표시부의 영상을 추출하고, 이로부터 AED 고장표시부의 영상과 배터리 잔량 표시부의 영상을 추출하여, AED 고장 고장여 부, AED 배터리 잔량을 판단하고, 배터리 교체 시점인지를 판단하고, 그 결과를 AED별로 메모리에 저장하 고, 디스플레이부로 전송하거나, 또는 관리자 개인단말로 전송할 수 있다. 관리자 개인단말은 관리자의 스마트폰 또는 개인 컴퓨터일 수 있다. 도 3는 본 발명의 카메라를 이용한 제세동기 관리 시스템의 일예의 사용상태도이다. 도 3의 경우, 엘리베이터에 구비된 카메라는 AED 함체의 투명창을 통해 AED 상태 표시부를 촬 영하여 영상 데이터 취합부로 전송한다. 도 4은 도 2의 AED 관리부의 구성을 개략적으로 나타내는 블럭도이다. 연산처리부는 영상 데이터 취합부로부터 송수신부를 통해 카메라 영상을 수신하고, 카메라 영상 을 전처리하여 관심영역만 추출하고, 관심영역의 영상에서, AED 상태 표시부의 영상을 포함하고 있는지 확 인하고, AED 상태 표시부의 영상을 추출한다. 연산처리부는 AED 상태 표시부의 영상에서, AED 고장표시부의 영상과 배터리 잔량 표시부의 영상을 추출한다. 연산처리부는 AED 고장표시부의 영상이, 고장임을 나타내는 고장 표시 영상인지, 정 상임(고장이 아님)을 나타내는 정상 표시 영상인지를 판별한다. 연산처리부는 만약 고장 표시 영상이라고 판단되면 AED는 고장상태라고 판단하고, 만약 정상 표시 영상이라고 판단되면 AED는 정상상태, 즉, 고장상태가 아니라고 판단하고, 판단 결과를 메모리부에 AED별로 저장하고, 송수신부를 통해 관리자 개인단말 등으로 전송한다. 경우에 따라서, 연산처리부는 AED 고장표시부의 영상을 통해 고장 또는 정상 을 판별하기 위해 인공지능(즉, 고장 판별 인공지능모델)을 적용할 수 있다. 연산처리부는 배터리 잔량 표시부의 영상에서, 배터리 잔량 정도를 판단한다. 예를들어 배터리 잔량 표시부에는 전지형태의 외곽선(테두리) 내에, 선을 그어 배터리 잔량 정도를 나타낸다. 연산처리부는 판단된 배터리 잔량이 기설정된 문턱치 이하인 경우 배터리 교체 시점으로 판단하고, 배터리 잔량, 배터리 교 체 시점여부를 메모리부에 AED별로 저장하고, 송수신부를 통해 관리자 개인단말등 으로 전송한 다. 경우에 따라서, 연산처리부는 배터리 잔량 표시부의 배터리 잔량 정도를 판별하기 위해 인공지능 (즉, 배터리 잔량 판별 인공지능모델)을 적용할 수 있다. 도 5는 AED 상태 표시부의 영상의 예들을 나타낸다. 도 5의 (a)는 정상 표시 영상(즉, AED가 정상임을 나타내는 영상)과, 배터리가 가득, 즉, \"FULL\"로 채워져 있는 배터리 잔량 영상을 가진 AED 상태 표시부를 나타내고, 도 5의 (b)는 고장 표시 영상(즉, AED가 고장임을 나타내는 영상)과, 배터리가 텅 비어있는 배터리 잔량 영상을 가진 AED 상태 표시부를 나타낸다. 일반적으로 AED의 정상표시는 파랑색(또는 초록색)의 \"○\" 또는 \"√\"형상을 나타내며, AED의 고장표시는 붉은색 (또는 검은색)의 \"×\" 또는 \"ⓧ\"로 표시한다. 경우에 따라서 AED 상태 표시부에 전극패드가 정상인지 불량인지를 나타내는 패드 불량여부 표시부(미도 시)를 더 구비할 수 있다. 연산처리부는 패드 불량여부 표시부(미도시)의 영상을 확인하여 패드 불량을 나타내는 표시를 검출하면 관 리자 개인단말 등으로 이를 알리는 알람을 전송한다. 또한, AED 함체는 AED 함체내에 AED가 삽입되어 있지 않음을 알 수 있는 투명창을 구비한다. 투명 창은 AED 함체의 상부 커버에 구비되어, AED가 AED 함체내 삽입되어 있는지 여부를 확인할 수 있게 이루어진다.연산처리부는 만약 투명창 내에 AED가 있지 않다면, 즉, 사람이 AED를 탈거하여 AED 함체에서 이 동 시켰음이 확인되면, 실시간으로 관리자 개인단말 등으로 이를 알리는 알람을 전송한다. 도 6a는 AED 상태 표시부에 표시되는 표시자들의 예를 나타낸다. 도 6a의 (a)는 AED가 정상임을 나타내는 표시의 예이고, 도 6a의 (b)는 AED가 고장임을 나타내는 표시의 예이다. 도 6a의 (c)는 AED의 배터리 잔량이 \"FULL\"인 상태를 나타내며, 도 6의(d)는 배터리 잔량이 일부 소실된 상태를 나타내며, 도 6a의(e)는 배터리 잔량이 없는 상태를 나타내는 예이다. 도 6a의 (f)는 전극패드 불량을 나타내는 예이다. 도 6b는 다양한 회사들에 의해 시판되는 AED들의 AED 고장표시부의 영상의 예들을 나타낸다. 도 6b에서와 같이, AED 고장표시부에서 AED의 정상표시하는 방법은 링(ring) 형태, 원형태, 링과 원이 홉합 된 형태, 체크 표시(√, tick) 형태 등 다양하다. 또한,AED 고장표시부에서 AED의 검검 필요, 즉, 고장을 표시하는 방법은, \"×\"자 형태, 원안에 \"×\"를 표시 하는(즉, ⓧ) 형태, 링(ring)안에 \"×\"를 표시하는 형태 등이 있다. 일반적으로, AED에서 자가진단을 행하여, AED 상태 표시부의 표시자들은 변경될 수 있다. 연산처리부는 AED 상태 표시부의 영상에서, AED 고장표시부의 영상을 추출하고, AED 고장표시부 의 영상이 기 설정된 정상표시 영상 또는 정상표시 색을 나타내는지를 판단한다. 예를들어, AED 고장표시부 의 영상을 기 학습된 고장 판별 인공지능모델에 입력하고, 고장 판별 인공지능모델로부터 출력을 고장 판별 값(고장인지 정상인지는 나타내는 값)으로서 출력한다. 고장 판별 인공지능모델은, 다양한 시판 AED들관련 AED 고장표시부의 영상과 고장 판별 값의 쌍으로 이루어 진 데이터에 의해 학습되어진다. 또한, 연산처리부는 AED 상태 표시부의 영상에서, 배터리 잔량 표시부의 영상을 추출하고, 배터리 잔량 표시부의 영상으로부터 잔량정도를 판단한다. 예를들어, 배터리 잔량 표시부의 영상을 기 학습된 배터리 잔량 판별 인공지능모델에 입력하고, 배터리 잔량 판별 인공지능모델로부터 출력을 배터리 잔량 값으로 서 출력한다. 배터리 잔량 판별 인공지능모델은, 다양한 시판 AED들관련 배터리 잔량 표시부의 영상과 배터리 잔량 값의 쌍으로 이루어진 데이터에 의해 학습되어진다. 도 7는 도 4의 연산처리부가 AED의 고장여부를 판단하는 흐름도의 일예이다. AED 상태 표시 영상 포함여부 판단단계로, 연산처리부는 영상 데이터 취합부로부터 카메라 영상을 수 신하여 전처리하여 관심영역만 추출하고(S100), 관심영역의 영상에, AED 상태 표시부의 영상을 포함하고 있 는지 확인하고(S110), AED 상태 표시부의 영상을 추출한다(S120). AED 상태 표시부 영상 판단단계로, 연산처리부는 AED 상태 표시부의 영상 포함여부 판단단계에서 추출된 AED 상태 표시 영상으로부터, AED 고장표시부의 영상을 추출하고, 추출된 AED 고장표시부의 영상으로부 터, AED가 정상인지, 아니면 AED의 고장인지를 판단하고, AED 상태 표시 영상으로부터, 배터리 잔량 표시부(7 5)의 영상을 추출하고, 추출된 배터리 잔량 표시부의 영상으로부터 배터리의 잔량 정도를 결정하고, 배터리 잔량 정도가 기설정된 문턱치보다 작은지를 판단하여 작다면 배터리 교체시점으로 판단한다(S130). 또한, AED 상태 표시부 영상 판단단계에서, 연산처리부는 패드 불량여부 표시부(미도시)의 영상을 확인하여 패드 불 량을 나타내는 표시를 검출하면 패드 불량으로 판단한다. 경우에 따라서, 추출된 AED 고장표시부의 영상으로부터, AED가 정상인지, 아니면 AED의 고장인지를 판단할 때에, 기 저장된 AED의 정상 표시 영상과 패턴 인식을 행하여, 같다면 AED가 정상으로 판단하고, 다르다면 고장 으로 판단하거나, 기 저장된 AED의 고장 표시 영상과 패턴 인식을 행하여, 같다면 AED가 고장으로 판단하고, 다르다면 정상으로 판단할 수 있다. 패드 불량의 경우도 패턴 인식을 이용하여 판단할 수 있다. AED 정상 상태 여부 판단단계로, 연산처리부는 AED 상태 표시부 영상 판단단계에서, AED가 고장으로 판단 되었는지를 판단하고, 또한, 배터리 교체시점인지를 판단하여, AED가 고장으로 판단되었거나, 배터리 교체시점이라고 판단되거나, 전극패드 블량으로 판단되면, AED 고장 알림단계로 간다(S150). AED 상태정보 저장단계로, 연산처리부는 AED 정상 상태 여부 판단단계에서 AED가 고장이 아니고, 배터리 교체시점이 아니고, 전극패드가 블량이 아니라고 판단되었다면, AED의 정상임을 표시하는 값과, AED 상태 표시 부 영상 판단단계에서 검출된 배터리의 잔량 정도를 AED 상태정보로서 메모리부에 저장하고(S170), 종료한 다. AED 고장 알림단계로, 연산처리부는 AED의 고장 상태를 나타내는 AED 상태정보 또는 배터리 교체시점임을 나타내는 정보를, 또는 AED 상태점검이 필요하다는 이벤트 문자를, 관리자 개인단말, 또는 제세동기 관리 시스템과 연결된 공공기관 단말(미도시), 또는 제세동기 관리 시스템과 연결된 기타 관제 시스템(미도시)로 전 송하고(S160), 종료한다. 기타 관제 시스템은 빌딩 관리 시스템, 아파트 관리 시스템, 엘리베이터 관리 시스템 등등일 수 있다. 도 8은 도 4의 연산처리부가 AED의 고장여부를 판단하는 흐름도의 다른 일예이다. AED 상태 표시 영상 포함여부 판단단계로, 연산처리부는 영상 데이터 취합부로부터 카메라 영상을 수 신하여 전처리하여 관심영역만 추출하고(S200), 관심영역의 영상에, AED 상태 표시부의 영상을 포함하고 있 는지 확인하고(S210), 관심영역의 영상에서 AED 상태 표시부의 영상을 추출한다(S220). 경우에 따라서는 관심영역의 영상에, AED 상태 표시부의 영상을 포함하고 있는지 확인하는(S210) 과정을 인 공지능(예를 들어 AED 상태 표시부 여부판별 인공지능 모델)을 적용하여 판별할 수 있다. AED 고장 표시부 영상 판단단계로, 연산처리부는 AED 상태 표시 영상 포함여부 판단단계에서 추출된 AED 상태 표시 영상을, 고장 판별 인공지능 모델에 적용하고(S230), 고장 판별 인공지능 모델의 출력을 고장판별 결 과로 하여 AED 고장 여부를 판단한다(S250). AED 고장 표시부 영상 판단단계로, 연산처리부는 AED 상태 표시 영상 포함여부 판단단계에서 추출된 AED 상태 표시 영상을, 기학습된 고장 판별 인공지능 모델에 적용하고(S230), 고장 판별 인공지능 모델의 출력을 고 장여부 판단 결과로 하며, 이를 메모리부에 저장한다(S250). AED 배터리 잔량 표시부 영상 판단단계로, 연산처리부는 AED 상태 표시 영상 포함여부 판단단계에서 추출 된 AED 상태 표시 영상을, 기학습된 배터리 잔량 판별 인공지능 모델에 적용하여, 고장 판별 인공지능 모델의 출력을 배터리 잔량으로 하고, 배터리 잔량이 기설정된 문턱치보다 작은지를 판단하여 작다면 배터리 교체시점 으로 판단하고 배터리 잔량, 교체시점 여부를 메모리부에 저장한다(S260). AED 정상 상태 여부 판단단계로, 연산처리부는 AED 고장 표시부 영상 판단단계에서, AED가 고장으로 판단 되었는지를 판단하고, 또한, AED 배터리 잔량 표시부 영상 판단단계에서 배터리 교체시점으로 판단되었는지를 판단하여, AED가 고장이 아니라고 판단되고, 배터리 교체시점이 아니라고 판단되었다면, 종료한다(S270). AED 고장 알림단계로, 연산처리부는 AED의 고장 상태를 나타내는 AED 상태정보 또는 배터리 교체시점임을 나타내는 정보를, 또는 AED 상태점검이 필요하다는 이벤트 문자를, 관리자 개인단말, 또는 제세동기 관리 시스템과 연결된 공공기관 단말(미도시), 또는 제세동기 관리 시스템과 연결된 기타 관제 시스템(미도시)으로 전송하고(S280), 종료한다. 이상에서는, 본 발명을 특정의 바람직한 실시예에 대해서 도시하고 설명하였다. 그러나 본 발명은 상술한 실시 예에만 한정되는 것은 아니며, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자라면 이하의 청구범위에 기재된 본 발명의 기술적 사상의 요지를 벗어남이 없이 얼마든지 다양하게 변경 실시할 수 있을 것이다."}
{"patent_id": "10-2023-0070230", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1a는 AED 함체의 일실시예로, AED 함체의 투명창을 통해 보이는 AED의 AED 상태 표시부를 설명하는 설명도이 다. 도 1b는 AED 함체의 다른 실시예로, AED 함체에 구비된 AED 상태 표시부를 설명하는 설명도이다. 도 2은 본 발명의 카메라를 이용한 제세동기 관리 시스템을 개략적으로 설명하는 설명도이다. 도 3는 본 발명의 카메라를 이용한 제세동기 관리 시스템의 일예의 사용상태도이다. 도 4은 도 2의 AED 관리부의 구성을 개략적으로 나타내는 블럭도이다. 도 5는 AED 상태 표시부의 영상의 예들을 나타낸다. 도 6a는 AED 상태 표시부에 표시되는 표시자들의 예를 나타낸다. 도 6b는 시판되는 AED의 AED 고장표시부의 영상의 예들을 나타낸다. 도 7는 도 4의 연산처리부가 AED의 고장여부를 판단하는 흐름도의 일예이다. 도 8은 도 4의 연산처리부가 AED의 고장여부를 판단하는 흐름도의 다른 일예이다."}
