{"patent_id": "10-2023-0101417", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0021177", "출원번호": "10-2023-0101417", "발명의 명칭": "객체 탐지 특징 맵 기반 객체 영역 분할 시스템 및 그 방법", "출원인": "한국생산기술연구원", "발명자": "김병학"}}
{"patent_id": "10-2023-0101417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "상공에서 촬영된 2차원 영상에서 객체 및 주변 지형지물의 실측 자료(ground truth)를 추출하는 실측 자료 추출부;상기 실측 자료 추출부에서 추출된 실측 자료를 기초로 상기 2차원 영상 내 객체들을 검출 및 분류하여 객체를탐지(detection)하는 객체 탐지부; 및상기 실측 자료 추출부에서 추출된 실측 자료와 상기 객체 탐지부에서 탐지한 객체 정보를 이용하여 상기 2차원영상 내 객체의 영역을 분할(segmentation)하는 객체 영역 분할부;를 포함하는 객체 탐지 특징 맵 기반 객체 영역 분할 시스템."}
{"patent_id": "10-2023-0101417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 객체 탐지부는,상기 실측 자료 추출부에서 추출된 실측 자료를 기초로 상기 2차원 영상 내 객체들을 검출하는 객체 검출부;상기 객체 검출부에서 검출된 객체를 분류하는 객체 분류부; 및상기 객체 검출부에서 검출된 객체의 위치를 인식하는 객체 위치 인식부;를 포함하는 객체 탐지 특징 맵 기반 객체 영역 분할 시스템."}
{"patent_id": "10-2023-0101417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 객체 검출부는 상기 실측 자료 추출부에서 추출된 실측 자료를 입력값으로 특징 맵(feature map)을 생성하는 특징 맵 생성부;를 포함하는 객체 탐지 특징 맵 기반 객체 영역 분할 시스템."}
{"patent_id": "10-2023-0101417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 특징 맵 생성부는,합성곱 신경망(CNN: Convolution Neural Network)을 이용하여 특징 맵을 추출하고,추출된 상기 특징 맵을 경로 집계 기능 추출 네트워크(PAFPN: Path Aggregation Feature Pyramid Network)를통해 가공하여 상기 객체 분류부와 상기 객체 위치 인식부에 제공하며,상기 객체 분류부는 상기 특징 맵 생성부에서 생성된 특징 맵을 이용하여 상기 객체 검출부에서 검출된 객체의의미를 분류하고,상기 객체 위치 인식부는,상기 특징 맵 생성부에서 생성된 특징 맵을 기초로 경계 상자 영역을 도출하고,상기 도출한 경계 상자 영역을 기준으로 경계 상자의 회귀(bounding box regression)를 수행하여 상기 객체 검출부에서 검출된 객체의 위치를 인식하는 객체 탐지 특징 맵 기반 객체 영역 분할 시스템."}
{"patent_id": "10-2023-0101417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서,공개특허 10-2025-0021177-3-상기 객체 영역 분할부는,상기 특징 맵 생성부에서 생성된 특징 맵을 기초로 주의 맵(attention map)을 생성하는 주의 맵 생성부; 및상기 주의 맵 생성부에서 생성된 주의 맵을 기초로 분할 마스크(segmentation mask)를 생성하는 분할 마스크 생성부;를 포함하는 객체 탐지 특징 맵 기반 객체 영역 분할 시스템."}
{"patent_id": "10-2023-0101417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 주의 맵 생성부는 상기 특징 맵을 변환함으로써 주의 맵을 생성하여 상기 분할 마스크 생성부에 제공하는객체 탐지 특징 맵 기반 객체 영역 분할 시스템."}
{"patent_id": "10-2023-0101417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5항에 있어서,상기 분할 마스크 생성부는,상기 2차원 영상 내 객체를 픽셀 단위로 나누어 객체를 레이블링(labeling)하고,상기 레이블링을 상기 실측 자료 추출부에서 추출된 실측 자료와 비교하여 보정하며,하위 계층의 분할 마스크가 상위 계층의 분할 마스크를 모방하도록 학습하는 객체 탐지 특징 맵 기반 객체 영역분할 시스템."}
{"patent_id": "10-2023-0101417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "상공에서 촬영된 2차원 영상에서 객체 및 주변 지형지물의 실측 자료를 추출하는 단계;상기 추출된 실측 자료를 기초로 상기 2차원 영상 내 객체들을 검출 및 분류하여 객체를 탐지하는 단계; 및상기 추출된 실측 자료와 상기 탐지한 객체 정보를 이용하여 상기 2차원 영상 내 객체의 영역을 분할하는 단계;를 포함하는 객체 탐지 특징 맵 기반 객체 영역 분할 방법."}
{"patent_id": "10-2023-0101417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 객체를 탐지하는 단계는,상기 추출된 실측 자료를 기초로 상기 2차원 영상 내 객체들을 검출하는 단계;상기 검출된 객체를 분류하는 단계; 및상기 검출된 객체의 위치를 인식하는 단계;를 포함하는 객체 탐지 특징 맵 기반 객체 영역 분할 방법."}
{"patent_id": "10-2023-0101417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 객체를 검출하는 단계는 상기 추출된 실측 자료를 입력값으로 특징 맵을 생성하는 단계;를 포함하는 객체탐지 특징 맵 기반 객체 영역 분할 방법."}
{"patent_id": "10-2023-0101417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 특징 맵을 생성하는 단계는,합성곱 신경망(CNN)을 이용하여 특징 맵을 추출하는 단계; 및공개특허 10-2025-0021177-4-추출된 상기 특징 맵을 경로 집계 기능 추출 네트워크(PAFPN)를 통해 가공하는 단계;를 포함하고,상기 가공된 특징 맵을 객체를 분류하는 단계와 상기 객체 위치를 인식하는 단계에 제공하며,상기 객체를 분류하는 단계는 상기 생성된 특징 맵을 이용하여 상기 검출된 객체의 의미를 분류하고,상기 객체 위치를 인식하는 단계는,상기 생성된 특징 맵을 이용하여 경계 상자 영역을 도출하고,상기 도출한 경계 상자 영역을 기준으로 경계 상자의 회귀를 수행하여 상기 검출된 객체의 위치를 인식하는 객체 탐지 특징 맵 기반 객체 영역 분할 방법."}
{"patent_id": "10-2023-0101417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항에 있어서,상기 객체 영역을 분할하는 단계는,상기 생성된 특징 맵을 기초로 주의 맵을 생성하는 단계;상기 생성된 주의 맵을 이용하여 분할 마스크를 생성하는 단계; 및상기 생성된 분할 마스크를 서로 모방하는 단계;를 포함하는 객체 탐지 특징 맵 기반 객체 영역 분할 방법."}
{"patent_id": "10-2023-0101417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 주의 맵을 생성하는 단계는 상기 특징 맵을 변환함으로써 주의 맵을 생성하는 객체 탐지 특징 맵 기반 객체 영역 분할 방법."}
{"patent_id": "10-2023-0101417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12항에 있어서,상기 분할 마스크를 생성하는 단계는,영상 내 객체를 픽셀 단위로 나누어 객체를 레이블링하고,상기 레이블링을 상기 추출된 실측 자료와 비교하여 보정하며,상기 분할 마스크를 모방하는 단계는 상위 하위 계층의 분할 마스크가 상위 계층의 분할 마스크를 모방하도록학습하는 과정을 포함하는 객체 탐지 특징 맵 기반 객체 영역 분할 방법."}
{"patent_id": "10-2023-0101417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제8항 내지 제14항 중 어느 한 항의 방법을 수행하기 위한 프로그램이 기록된 컴퓨터 판독가능한 기록매체."}
{"patent_id": "10-2023-0101417", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "객체 탐지 특징 맵 기반 객체 영역 분할 시스템 및 그 방법이 제공된다. 본 발명의 실시예에 따른 객체 탐지 특 징 맵 기반 객체 영역 분할 시스템 및 그 방법은 상공에서 촬영된 2차원 영상에서 객체 및 주변 지형지물의 실측 자료(ground truth)를 추출하는 실측 자료 추출부; 상기 실측 자료 추출부에서 추출된 실측 자료를 기초로 영상 내 객체들을 검출 및 분류하여 객체를 탐지(detection)하는 객체 탐지부; 및 상기 실측 자료 추출부에서 추출된 실측 자료와 상기 객체 탐지부에서 탐지한 객체 정보를 이용하여 영상 내 객체의 영역을 분할(segmentation)하는 객체 영역 분할부;를 포함한다."}
{"patent_id": "10-2023-0101417", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 객체 탐지 특징 맵 기반 객체 영역 분할 시스템 및 그 방법에 관한 것으로, 특히, 상공 뷰의 비전 데 이터를 이용하여 객체와 주변의 지형지물을 탐지 및 분할하는 객체 탐지 특징 맵 기반 객체 영역 분할 시스템 및 그 방법에 관한 것이다."}
{"patent_id": "10-2023-0101417", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "기존의 1단계(one-stage) 탐지 모델은 후보 영역을 제안하는 과정을 거치지 않고 객체를 검출, 분류 (classification) 및 경계 상자의 회귀(bounding box regression)를 수행하여, 객체 탐지 속도가 빠르나 정확 도가 낮은 단점이 존재한다. 반면, 2단계(two-stage) 탐지 모델은 후보 영역을 제안한 후 제안된 후보 영역에서 객체를 검출, 분류, 및 경계 상자의 회귀를 수행하여 정확도를 향상시켰으나, 속도가 느리다는 한계가 존재하였 다. 한편, 자기 주의 증류(self-attention distillation) 방법은 기존의 지식 증류(knowledge distillation) 방법 에서 착안하여 각 계층의 표현을 향상할 수 있도록 고안된 분할 모델이다. 자기 주의 증류 방법을 기존의 1단계 탐지 모델에 적용하면 2단계 탐지 모델 대비 단점으로 지적되는 정확도를 향상시킬 수 있다. 그러나, 객체 분할 모델에 적합하게 고안된 방법은 객체 탐지 모델에 변형 없이 적용하기에 무리가 있다. 따라 서, 1단계 탐지 모델과 비교하여 속도의 저하 없이 정확도를 보완한 새로운 객체 탐지 모델이 필요한 실정이다. 선행기술문헌 특허문헌 (특허문헌 0001) KR 10-2511315 B1"}
{"patent_id": "10-2023-0101417", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상기와 같은 종래 기술의 문제점을 해결하기 위해, 본 발명의 일 실시예는 상공에서 촬영된 2차원 영상 정보를 입력으로 사용하여 객체 및 주변 지형지물들의 형상 정보를 검출 및 분류하는 객체 탐지 모델과, 객체 탐지 모 델을 통해 생성된 특징 맵과 촬영된 영상 정보를 입력으로 사용하여 객체 영역을 분할하는 객체 분할 모델을 결 합함으로써, 인공지능 탐지 및 분할 모델의 내부에서 객체 영역을 분할할 수 있는 객체 탐지 특징 맵 기반 객체 영역 분할 시스템 및 그 방법을 제공하고자 한다."}
{"patent_id": "10-2023-0101417", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "위와 같은 과제를 해결하기 위한 본 발명의 일 측면에 따르면, 상공에서 촬영된 2차원 영상에서 객체 및 주변 지형지물의 실측 자료(ground truth)를 추출하는 실측 자료 추출부; 상기 실측 자료 추출부에서 추출된 실측 자 료를 기초로 영상 내 객체들을 검출 및 분류하여 객체를 탐지(detection)하는 객체 탐지부; 및 상기 실측 자료 추출부에서 추출된 실측 자료와 상기 객체 탐지부에서 탐지한 객체 정보를 이용하여 영상 내 객체의 영역을 분 할(segmentation)하는 객체 영역 분할부;를 포함하는 객체 탐지 특징 맵 기반 객체 영역 분할 시스템 및 그 방 법이 제공된다. 일 실시예에서, 상기 객체 탐지부는, 상기 실측 자료 추출부에서 추출된 실측 자료를 기초로 상기 2차원 영상 내 객체들을 검출하는 객체 검출부; 상기 객체 검출부에서 검출된 객체를 분류하는 객체 분류부; 및 상기 객체 검출부에서 검출된 객체의 위치를 인식하는 객체 위치 인식부;를 포함할 수 있다. 일 실시예에서, 상기 객체 검출부는 상기 실측 자료 추출부에서 추출된 실측 자료를 입력값으로 특징 맵 (feature map)을 생성하는 특징 맵 생성부;를 포함할 수 있다. 일 실시예에서, 상기 특징 맵 생성부는, 합성곱 신경망(CNN: Convolution Neural Network)을 이용하여 특징 맵 을 추출하고, 추출된 상기 특징 맵을 경로 집계 기능 추출 네트워크(PAFPN: Path Aggregation Feature Pyramid Network)를 통해 가공하여 상기 객체 분류부와 상기 객체 위치 인식부에 제공하며, 상기 객체 분류부는 상기 특 징 맵 생성부에서 생성된 특징 맵을 이용하여 상기 객체 검출부에서 검출된 객체의 의미를 분류하고, 상기 객체 위치 인식부는, 상기 특징 맵 생성부에서 생성된 특징 맵을 이용하여 경계 상자 영역을 도출하고, 상기 도출한 경계 상자 영역을 기준으로 경계 상자의 회귀(bounding box regression)를 수행하여 상기 객체 검출부에서 검출 된 객체의 위치를 인식할 수 있다. 일 실시예에서, 상기 객체 영역 분할부는, 상기 특징 맵 생성부에서 생성된 특징 맵을 기초로 주의 맵 (attention map)을 생성하는 주의 맵 생성부; 및 상기 주의 맵 생성부에서 생성된 주의 맵을 기초로 분할 마스 크(segmentation mask)를 생성하는 분할 마스크 생성부;를 포함할 수 있다.일 실시예에서, 상기 주의 맵 생성부는 상기 특징 맵을 변환함으로써 주의 맵을 생성하여 상기 분할 마스크 생 성부에 제공할 수 있다. 일 실시예에서, 상기 분할 마스크 생성부는, 영상 내 객체를 픽셀 단위로 나누어 객체를 레이블링(labeling)하 고, 상기 레이블링을 상기 실측 자료 추출부에서 추출된 실측 자료와 비교하여 보정하며, 하위 계층의 분할 마 스크가 상위 계층의 분할 마스크를 모방하도록 학습할 수 있다. 본 발명의 다른 측면에 따르면, 상공에서 촬영된 2차원 영상에서 객체 및 주변 지형지물의 실측 자료를 추출하 는 단계; 상기 추출된 실측 자료를 기초로 영상 내 객체들을 검출 및 분류하여 객체를 탐지하는 단계; 및 상기 추출된 실측 자료와 상기 탐지한 객체 정보를 이용하여 영상 내 객체의 영역을 분할하는 단계;를 포함하는 객체 탐지 특징 맵 기반 객체 영역 분할 방법이 제공된다. 일 실시예에서, 상기 객체를 탐지하는 단계는, 상기 추출된 실측 자료를 기초로 영상 내 객체들을 검출하는 단 계; 상기 검출된 객체를 분류하는 단계; 및 상기 검출된 객체의 위치를 인식하는 단계;를 포함할 수 있다. 일 실시예에서, 상기 객체를 검출하는 단계는 상기 추출된 실측 자료를 입력값으로 특징 맵을 생성하는 단계;를 포함할 수 있다. 일 실시예에서, 상기 특징 맵을 생성하는 단계는, 합성곱 신경망(CNN)을 이용하여 특징 맵을 추출하는 단계; 및 추출된 상기 특징 맵을 경로 집계 기능 추출 네트워크(PAFPN)를 통해 가공하는 단계;를 포함하고, 상기 가공된 특징 맵을 객체를 분류하는 단계와 상기 객체 위치를 인식하는 단계에 제공하며, 상기 객체를 분류하는 단계는 상기 생성된 특징 맵을 이용하여 상기 검출된 객체의 의미를 분류하고, 상기 객체 위치를 인식하는 단계는, 상 기 생성된 특징 맵을 기초로 경계 상자 영역을 도출하고, 상기 도출한 경계 상자 영역을 기준으로 경계 상자의 회귀를 수행하여 상기 검출된 객체의 위치를 인식할 수 있다. 일 실시예에서, 상기 객체 영역을 분할하는 단계는, 상기 생성된 특징 맵을 기초로 주의 맵을 생성하는 단계; 상기 생성된 주의 맵을 이용하여 분할 마스크를 생성하는 단계; 및 상기 생성된 분할 마스크를 서로 모방하는 단계;를 포함할 수 있다. 일 실시예에서, 상기 주의 맵을 생성하는 단계는 상기 특징 맵을 변환함으로써 주의 맵을 생성할 수 있다. 일 실시예에서, 상기 분할 마스크를 생성하는 단계는, 영상 내 객체를 픽셀 단위로 나누어 객체를 레이블링하고, 상기 레이블링을 상기 추출된 실측 자료와 비교하여 보정하며, 상기 분할 마스크를 모방하는 단 계는 상위 하위 계층의 분할 마스크가 상위 계층의 분할 마스크를 모방하도록 학습하는 과정을 포함할 수 있다."}
{"patent_id": "10-2023-0101417", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 객체 탐지 특징 맵 기반 객체 영역 분할 시스템 및 그 방법은 인공지능 기반의 객 체 탐지 모델과 객체 분할 모델을 효율적으로 결합시킴으로써, 탐지 및 영역 분할 속도가 빠르고 정확도가 향상 된 객체 탐지 기반의 객체 영역 분할 시스템을 제공할 수 있다. 또한, 본 발명의 일 실시예에 따른 객체 탐지 특징 맵 기반 객체 영역 분할 시스템 및 그 방법은 상공에서 촬영 된 2차원 영상으로부터 빠르고 정확하게 객체를 탐지 및 분할함으로써, 건설 현장에 기 구축된 CCTV 등 영상 데 이터를 활용하여 효과적인 안전 관리를 실현할 수 있다."}
{"patent_id": "10-2023-0101417", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부한 도면을 참고로 하여 본 발명의 실시예에 대하여 본 발명이 속하는 기술분야에서 통상의 지식을 가 진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여 기에서 설명하는 실시예에 한정되지 않는다. 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관계없는 부 분은 생략하였으며, 명세서 전체를 통하여 동일 또는 유사한 구성요소에 대해서는 동일한 참조부호를 붙였다. 이하에서는 도면을 참조하여 본 발명의 일 실시예에 객체 탐지 특징 맵 기반 객체 영역 분할 시스템 및 그 방법 을 보다 상세히 설명하도록 한다. 도 1은 본 발명의 일 실시예에 따른 객체 탐지 특징 맵 기반 객체 영역 분할 시스템의 구성도이다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 객체 탐지 특징 맵 기반 객체 영역 분할 시스템은 실측 자 료 추출부, 객체 탐지부 및 객체 영역 분할부를 포함할 수 있다. 실측 자료 추출부는 상공에서 촬영된 2차원 영상 데이터를 추출 및 저장할 수 있다. 여기서, 2차원 영상 데이터는 크레인과 같은 건설 장비의 끝단에 부착된 카메라에서 수집될 수 있다. 다른 일례로, 2차원 영상 데이 터는 건설 현장에 설치된 폐쇄 회로 카메라(CCTV)에서 수집될 수 있다. 이때, 수집된 2차원 영상 데이터는 객체 탐지부에 제공될 수 있다. 객체 탐지부는 실측 자료 추출부에서 제공된 2차원 영상 데이터를 분석하여 영상 내 객체를 검출 및 분류할 수 있다. 여기서, 객체 탐지부는 영상 내 객체를 검출 및 분류하기 위해 특징 맵을 생성할 수 있다. 생성된 특징 맵은 객체의 의미를 분류하고 객체의 위치를 인식하기 위해 사용될 수 있다. 객체 영역 분할부는 객체 탐지부에서 검출 및 분류된 객체를 픽셀 단위로 세밀하게 분석하여 객체 영 역을 분할할 수 있다. 여기서, 객체 영역 분할부는 객체 탐지부에서 생성된 특징 맵을 활용하여 객체 영역을 분할하기 위한 패턴을 생성할 수 있다. 또한, 객체 영역 분할부는 실측 자료 추출부에서 추출 된 실측 자료를 사용할 수 있다. 이때, 실측 자료 추출부에서 추출된 실측 자료는 객체 영역을 분할하기 위한 패턴을 보강하기 위해 이용될 수 있다. 도 2는 본 발명의 일 실시예에 따른 객체 탐지 특징 맵 기반 객체 영역 분할 시스템의 객체 탐지부에 대한 블록도이다. 도 2를 참조하면, 객체 탐지부는 객체 검출부, 객체 분류부 및 객체 위치 인식부를 포함할 수 있다. 여기서, 객체 탐지부는 인공지능 객체 탐지 모델을 학습시킴으로써 영상 내 객체를 탐지할 수 있 다. 이때, 인공지능 객체 탐지 모델로 1단계 탐지 모델이 활용될 수 있다. 일례로, 인공지능 객체 탐지 모델은 1단계 탐지 모델의 일종인 YOLO가 활용될 수 있다. 1단계 탐지 모델은 비교적 단순한 데이터 처리 연결 구조 (pipeline)를 가짐으로써 객체 탐지 속도를 향상시킬 수 있고, 실시간으로 객체의 의미 및 위치를 예측할 수 있 다. 객체 검출부는 실측 자료 추출부에서 추출된 실측 자료를 기초로 영상 내 객체를 검출할 수 있다. 여 기서, 객체 검출부는 특징 맵 생성부를 포함할 수 있다. 특징 맵 생성부는 특징 맵을 추출하고 가공하여 객체 분류부 및 객체 위치 인식부에 제공할 수 있다. 보다 구체적으로, 특징 맵은 영상 데이터에서 객체를 탐지할 때 각 객체의 형상이 가지는 특징을 패턴으로 추출 한 것을 의미한다. 특징 맵 생성부는 합성곱 신경망(CNN: Convolution Neural Network)을 이용하여 입력 된 실측 자료로부터 특징 맵을 추출할 수 있다. 이때, 특징 맵 생성부는 특징 맵을 추출하기 위해 영상 데이터로부터 추출된 실측 자료와 동일한 차원을 가지는 커널(kernel)을 이용할 수 있다. 커널은 각 객체의 형상 이 가지는 특징을 영상 데이터로부터 추출된 실측 자료와 동일한 차원으로 표현한 것이다. 특징 맵 생성부(12 3)는 커널을 연산(convolution)하여 특징 맵을 추출할 수 있다. 또한 특징 맵 생성부는 추출된 특징 맵을 경로 집계 기능 추출 네트워크(PAFPN: Path Aggregation Feature Pyramid Network)를 통해 가공할 수 있다. 경로 집계 기능 추출 네트워크(PAFPN)는 각 객체의 형상이 가지는 특징이 추출된 여러 계층별 특징 맵을 정제, 재구성 및 혼합하여 특징 맵의 피라미드를 생성할 수 있다. 경로 집계 기능 추출 네트워크(PAFPN)에서 생성된 특징 맵의 피라미드는 객체 분류부 및 객체 위치 인식부 에 제공되어 여러 크기의 객체를 검출하기 위해 이용될 수 있다. 경로 집계 기능 추출 네트워크(PAFPN)는 유사한 가공 기능을 가지는 다른 네트워크 모델로 대체될 수 있다. 일례로, 특징 맵 생성부는 특징 맵을 가공하기 위해 Bi-FPN이나 PANet을 사용할 수 있다. 객체 분류부는 특징 맵 생성부에서 생성된 특징 맵을 이용하여, 객체 검출부에서 검출된 객체의 의미(class)를 분류할 수 있다. 객체의 의미는 객체의 보통명사를 찾는 것이다. 일례로, 객체 분류부는 도 로 위에 자동차와 보행자가 공존하는 사진에서 '자동차'와 '사람'을 구분하도록 연산할 수 있다. 객체 분류부 는 영상 내 여러 크기의 객체들에 특징 맵을 적용하여 객체의 의미를 확률로써 판별할 수 있다. 일례로, 객체 분류부는 도로 위에 자동차와 보행자가 공존하는 사진에서 어떤 객체가 자동차일 확률과 사람일 확률 을 연산하고, 자동차일 확률이 0.9, 사람일 확률이 0.1이라면 해당 객체를 자동차로 분류할 수 있다. 객체 위치 인식부는 특징 맵 생성부에서 생성된 특징 맵을 이용하여, 객체 검출부에서 검출된 객체의 위치를 인식할 수 있다. 객체 위치 인식부는 객체의 위치를 인식하기 위해 우선 특징 맵을 기초로 경계 상자 영역을 설정할 수 있다. 경계 상자 영역이란 객체 검출부가 검출한 객체가 차지하는 공간을 사 각형의 좌표 면적으로 추출하는 것이다. 객체 위치 인식부는 특징 맵을 이용하여 설정된 경계 상자 영역을 기준으로 경계 상자의 회귀(bounding box regression)를 수행할 수 있다. 여기서, 경계 상자의 회귀란 특징 맵 을 이용하여 설정된 경계 상자 영역을 영상 데이터의 실측 자료와 비교하여 객체가 경계 상자 영역 내 존재하는 확률의 오차를 계산하고, 오차를 줄이도록 회귀 연산하는 것이다. 이를 통해, 객체 위치 인식부는 객체의 위치 인식 정확도를 높일 수 있다. 도 3은 본 발명의 일 실시예에 따른 객체 탐지 특징 맵 기반 객체 영역 분할 시스템의 객체 영역 분할부에 대한 블록도이다. 도 3을 참조하면, 객체 영역 분할부는 주의 맵 생성부와 분할 마스크 생성부를 포함할 수 있다. 여기서, 객체 영역 분할은 객체 탐지부를 보완하여 영상 내 객체를 픽셀 단위로 분할하여 탐지할 수 있다. 이때, 객체 영역 분할부는 객체 영역 분할을 학습하고 수행하기 위한 인공지능 객체 영역 분할 모델로서 자기 주의 증류 모델을 사용할 수 있다. 또한, 주의 맵 생성부는 특징 맵 생성부에서 생성된 특징 맵 을 활용하고, 분할 마스크 생성부는 실측 자료 추출부에서 추출된 실측 자료를 활용할 수 있다. 보다 구체적으로, 주의 맵 생성부는 객체 검출부에서 생성된 특징 맵을 주의 맵으로 변환할 수 있다. 주의 맵은 특징 맵의 어떤 영역이 객체 영역을 인식하기 위해 많은 영향을 미쳤는지 연산하여 시각화할 수 있다. 일례로, 주의 맵은 실측 자료로부터 추출되어 영상 데이터를 포함하고 있는 특징 맵에서 객체 인식을 위 해 주요한 특징을 담고 있는 영역을 시각화할 수 있다. 이때, 특징 맵으로부터 주의 맵을 생성하기 위해 주의 생성기(attention generator)를 사용할 수 있다. 분할 마스크 생성부는 주의 맵 생성부에서 생성된 주의 맵을 기초로 분할 마스크를 생성할 수 있다. 분할 마스크는 영상 내 객체를 픽셀 단위로 분할하여 객체의 의미(class)를 표시하는 레이블(label)이다. 여기 서, 분할 마스크는 실측 자료 추출부에서 추출된 실측 자료와 객체의 의미를 표시한 레이블을 비교하여 보 정할 수 있다. 또한, 분할 마스크 생성부는 하위 계층의 분할 마스크가 상위 계층의 분할 마스크를 모방하 여 오차를 줄임으로써 객체 영역의 정확도를 높일 수 있다. 도 4는 본 발명의 일 실시예에 따른 인공지능 객체 탐지 및 영역 분할 모델을 도시한 구성도이다. 여기서, (a) 는 자기 주의 증류 모델, (b), (c), (d)는 1단계 탐지 모델의 각 구성요소, (e)는 위 인공지능 객체 탐지 및 영 역 분할 모델에 실측 자료로써 입력되고, 탐지 및 분할 모델이 적용되는 2차원 영상 데이터를 나타낸다. 도 4를 참조하면, 1단계 탐지 모델은 (b) 백본 구조에서 시작할 수 있다. (b) 백본 구조는 실측 자료 추출부 에서 추출된 실측 자료를 입력값으로 사용하여, S2부터 S5까지 연산 단계(convolution layer)를 거쳐 특징 맵을 추출할 수 있다. (b) 백본 구조에서 각 연산 단계마다 추출된 특징 맵은 단계별로 여러 크기의 해상도를가질 수 있다. 여러 크기의 해상도로 추출된 특징 맵은 크기별 객체에 각각 적용될 수 있다. (c) 넥 구조는 여러 크기의 해상도로 추출된 특징 맵을 가공할 수 있다. (c) 넥 구조는 낮은 해상도로 추출된 특징 맵을 업스케일링(up-scaling)하여 해상도를 높이고, 각 특징 맵을 서로 연관(concatenation)시킴으로써 특 징 맵을 정제, 혼합 및 재구성할 수 있다. 이때, (c) 넥 구조에서 정제, 혼합 및 재구성된 특징 맵은 (d) 헤드 구조에서 객체의 의미를 분류하고 위치를 인식하기 위해 이용될 수 있다. (d) 헤드 구조는 특징 맵을 이용하여 2차원 영상에서 객체의 의미를 분류하고 위치를 인식할 수 있다. 여기서, (d) 헤드 구조에 이용되는 특징 맵은 (b) 백본 구조에서 각 크기별로 추출되고 (c) 넥 구조에서 가공 과정을 거 치면서 여러 해상도 및 여러 크기의 객체에 적용될 수 있다. 이로 인해, (d) 헤드 구조는 2차원 영상에 포함된 여러 크기의 객체를 효과적으로 탐지할 수 있다. 또한, 도 4를 참조하면, (a)는 자기 주의 증류 모델의 구조로써, 객체 영역 분할에 이용된다. 여기서, (a) 자기 주의 증류 모델은 (b) 백본 구조에서 각 해상도별로 추출된 특징 맵을 이용할 수 있다. 또한, (a) 자기 주의 증 류 모델은 내부에 주의 생성기(attention generator)를 포함할 수 있다. 주의 생성기는 2차원 영상 내 객체 영 역 간 관계를 모델링함으로써 (b) 백본 구조에서 각 해상도별로 추출된 특징 맵을 주의 맵으로 변환시킬 수 있 다. 분할 마스크는 주의 맵과 실측 자료를 참조하여 각 해상도별로 생성될 수 있다. 각 해상도별로 생성된 분할 마스크는 1단계 탐지 모델에서 분류 및 위치 인식한 객체 탐지 결과를 기초로 2차원 영상 내에서 픽셀 단위로 객체 영역을 분할할 수 있다. 또한, 생성된 분할 마스크는 하위 단계의 분할 마스크가 상위 단계의 분할 마스크 를 모방함으로써 객체 영역 분할의 오차를 줄여 정확도를 높일 수 있다. 객체 탐지 특징 맵 기반 객체 영역 분할 시스템에서 사용하는 인공지능 탐지 및 분할 모델은 추가적인 지 도(supervision)를 필요로 하지 않을 수 있다. 인공지능 탐지 및 분할 모델은 내부 출력값을 다시 입력값으로 사용함으로써 정확도를 높이기 위한 과정을 내부적으로 학습할 수 있다. 도 5는 본 발명의 일 실시예에 따른 객체 탐지 특징 맵 기반 객체 영역 분할 시스템의 실증 실험 결과에 대한 도면이다. 여기서, (a)는 실측 자료, (b)는 1단계 탐지 모델만을 활용하여 객체 영역을 분할한 모습, (c)는 1단 계 탐지 모델과 자기 주의 증류 모델을 병합 활용하여 객체 영역을 분할한 모습을 나타낸다. 보다 구체적으로, 도 5를 참조하면, (b)는 객체 탐지부에서 추출된 각 해상도별 특징 맵만을 2차원 영상에 적용시켜 객체 영역을 분할한 것이다. (b)-(ⅰ)과 (b)-(ⅱ)는 특징 맵을 저배율로 전경을 비추는 2차원 영상에 적용한 것이다. 저배율의 특징 맵은 밝은 색으로 객체 영역을 구분하며, 육안으로 보기에 실측 자료인 2차원 영 상과 대응 가능한 수준의 분해능을 가질 수 있다. 그러나, 특징 맵만을 적용한 객체 영역 분할은 2차원 영상이 확대되며 실측 자료의 배율이 높아질수록((b)-(ⅲ), (b)-(ⅳ)) 객체 영역으로 구분했던 부분을 알아볼 수 없게 된다. 반면, (c)는 객체 탐지부에서 객체 탐지 모델을 거쳐 출력된 객체 탐지 결과를 이용하여 객체 영역 분할부 에서 객체 영역 분할 모델을 거쳐 출력된 객체 영역 분할의 결과이다. 주의 맵을 저배율로 전경을 비추는 2차원 영상에 적용했을 때((c)-(ⅰ), (c)-(ⅱ)), 객체 영역 분할 형태는 동일한 배율의 2차원 영상에 특징 맵만 을 적용했을 때((b)-(ⅰ), (b)-(ⅱ))와 크게 다르지 않으나, 2차원 영상의 배율이 높아질수록((c)-(ⅲ), (c)- (ⅳ)) 객체 영역으로 구분한 부분이 (b)와 대비했을 때 선명하게 부각되고, 객체 영역 분할의 정확도가 높아진 다. 이와 같이, 1단계 탐지 모델로 대표되는 객체 탐지 모델만으로 객체 영역을 분할하기 위해서 한계점이 명확하다. 따라서, 자기 주의 증류 모델로 대표되는 객체 영역 분할 모델을 객체 탐지 모델과 함께 병합한 객체 탐지 특징 맵 기반 객체 영역 분할 시스템에 의해 해상도에 무관하게 객체 영역 분할의 정확도를 높일 수 있다. 또한, 객체 탐지 특징 맵 기반 객체 영역 분할 시스템은 객체 영역 분할에 앞서 객체 탐지를 위하여, 탐지 속도가 빠른 1단계 탐지 모델을 이용함으로써 빠른 속도를 유지하면서 정확도가 높은 객체 탐지 및 영역 분할 시스템을 제공할 수 있다. 도 6은 본 발명의 일 실시예에 따른 객체 탐지 특징 맵 기반 객체 영역 분할 시스템을 통해 생성된 시각화 결과 에 대한 도면이다. 도 6을 참조하면, (a)는 실측 자료에 분할 마스크를 투영한 결과를 나타낸다. 여기서, (a)의 2차원 영상 내 객 체들이 각각 객체의 의미 및 인식된 위치에 따라 색상 및 선으로 구분될 수 있다. (b)는 분할한 객체 영역을 실측 자료에 투영한 결과를 나타낸다. (b) 절차에서는 (a) 절차에서 분할한 객체 영 역 중 관심 영역을 지정하고 실측 자료에 투영함으로써, 2차원 영상 내에서 객체의 위치 및 크기 변화에 무관하 게 해당 관심 객체를 추적하고 관찰할 수 있다. 도 7은 본 발명의 일 실시예에 따른 객체 탐지 특징 맵 기반 객체 영역 분할 방법의 순서도이다. 도 7을 참조하면, 본 발명의 일 실시예에 따른 객체 탐지 특징 맵 기반 객체 영역 분할 방법은 실측 자료 추출 단계(S210), 객체 탐지 단계(S220) 및 객체 영역 분할 단계(S230)를 포함한다. 보다 상세히 설명하면, 도 7에 도시된 바와 같이, 객체 탐지 특징 맵 기반 객체 영역 분할 방법은 상공에 서 촬영된 2차원 영상 데이터로부터 실측 자료를 추출 및 저장한다(단계 S210). 여기서, 2차원 영상 데이터는 크레인과 같은 건설 장비의 끝단에 부착된 카메라에서 수집될 수 있다. 다른 일례로, 2차원 영상 데이터는 건설 현장에 설치된 폐쇄 회로 카메라(CCTV)에서 수집될 수 있다. 이때, 수집된 2차원 영상 데이터는 객체 탐지 단계 (S220)에 제공될 수 있다. 다음으로, 객체 탐지 특징 맵 기반 객체 영역 분할 방법은 추출된 실측 자료로부터 2차원 영상 데이터를 분석하여 영상 내 객체를 탐지한다(단계 S220). 여기서, 객체 탐지 특징 맵 기반 객체 영역 분할 방법은 영상 내 객체를 검출 및 분류하기 위해 특징 맵을 생성할 수 있다. 생성된 특징 맵은 객체의 의미를 분류하고 객체의 위치를 인식하기 위해 사용될 수 있다. 다음으로, 객체 탐지 특징 맵 기반 객체 영역 분할 방법은 검출 및 분류하여 탐지된 객체를 픽셀 단위로 세밀하게 분석하여 객체 영역을 분할한다(단계 S230). 여기서, 객체 탐지 특징 맵 기반 객체 영역 분할 방법 은 생성된 특징 맵을 활용하여 객체 영역을 분할하기 위한 패턴을 생성할 수 있다. 또한, 객체 탐지 특징 맵 기반 객체 영역 분할 방법은 실측 자료를 사용할 수 있다. 이때, 실측 자료는 객체 영역을 분할하기 위 한 패턴을 보강하기 위해 이용될 수 있다. 도 8은 본 발명의 일 실시예에 따른 객체 탐지 특징 맵 기반 객체 영역 분할 방법의 객체 탐지 단계(S220)의 순 서도이다. 도 8을 참조하면, 객체 탐지 단계(S220)는 특징 맵 추출 단계(S222), 특징 맵 가공 단계(S224), 객체 분류 단계 (S226) 및 객체 위치 인식 단계(S228)를 포함한다. 여기서, 객체 탐지 단계(S220)는 인공지능 객체 탐지 모델을 학습시킴으로써 영상 내 객체를 탐지할 수 있다. 이때, 인공지능 객체 탐지 모델로 1단계 탐지 모델이 활용될 수 있다. 일례로, 인공지능 객체 탐지 모델은 1단계 탐지 모델의 일종인 YOLO가 활용될 수 있다. 보다 상세히 설명하면, 도 9에 도시된 바와 같이, 객체 탐지 특징 맵 기반 객체 영역 분할 방법은 실측 자 료를 기초로 특징 맵을 추출한다(단계 S222). 여기서, 특징 맵은 영상 데이터에서 객체를 탐지할 때 각 객체의 형상이 가지는 특징을 패턴으로 추출한 것을 의미한다. 객체 탐지 특징 맵 기반 객체 영역 분할 방법은 합 성곱 신경망(CNN)을 이용하여 입력된 실측 자료로부터 특징 맵을 추출할 수 있다. 이때, 객체 탐지 특징 맵 기 반 객체 영역 분할 방법은 특징 맵을 추출하기 위해 영상 데이터로부터 추출된 실측 자료와 동일한 차원을 가지는 커널을 이용할 수 있다. 커널은 각 객체의 형상이 가지는 특징을 영상 데이터로부터 추출된 실측 자료와 동일한 차원으로 표현한 것이다. 객체 탐지 특징 맵 기반 객체 영역 분할 방법은 커널을 연산하여 특징 맵 을 추출할 수 있다. 다음으로, 객체 탐지 특징 맵 기반 객체 영역 분할 방법은 추출된 특징 맵을 경로 집계 기능 추출 네트워 크(PAFPN)를 통해 가공한다(단계 S224). 경로 집계 기능 추출 네트워크(PAFPN)는 각 객체의 형상이 가지는 특징 이 추출된 여러 계층별 특징 맵을 정제, 재구성 및 혼합하여 특징 맵의 피라미드를 생성할 수 있다. 경로 집계 기능 추출 네트워크(PAFPN)에서 생성된 특징 맵의 피라미드는 객체 분류 단계(S226) 및 객체 위치 인식 단계 (S228)에 제공되어 여러 크기의 객체를 검출하기 위해 이용될 수 있다. 경로 집계 기능 추출 네트워크(PAFPN)는 유사한 가공 기능을 가지는 다른 네트워크 모델로 대체될 수 있다. 일례로, 특징 맵 가공 단계(S224)에는 특징 맵을 가공하기 위해 Bi-FPN이나 PANet이 사용될 수 있다. 다음으로, 객체 탐지 특징 맵 기반 객체 영역 분할 방법은 생성된 특징 맵을 이용하여 객체의 의미(clas s)를 분류한다(단계 S226). 객체의 의미는 객체의 보통명사를 찾는 것이다. 일례로, 객체 탐지 특징 맵 기반 객 체 영역 분할 방법은 도로 위에 자동차와 보행자가 공존하는 사진에서 '자동차'와 '사람'을 구분하도록 연 산할 수 있다. 객체 탐지 특징 맵 기반 객체 영역 분할 방법은 영상 내 여러 크기의 객체들에 특징 맵을 적용하여 객체의 의미를 확률로써 판별할 수 있다. 일례로, 객체 탐지 특징 맵 기반 객체 영역 분할 방법 은 도로 위에 자동차와 보행자가 공존하는 사진에서 어떤 객체가 자동차일 확률과 사람일 확률을 연산하고, 자동차일 확률이 0.9, 사람일 확률이 0.1이라면 해당 객체를 자동차로 분류할 수 있다. 다음으로, 객체 탐지 특징 맵 기반 객체 영역 분할 방법은 특징 맵을 이용하여 검출된 객체의 위치를 인식 한다(단계 S228). 객체 탐지 특징 맵 기반 객체 영역 분할 방법은 객체의 위치를 인식하기 위해 우선 특징 맵을 기초로 경계 상자 영역을 설정할 수 있다. 경계 상자 영역이란 검출한 객체가 차지하는 공간을 사각형의 좌표 면적으로 추출하는 것이다. 객체 탐지 특징 맵 기반 객체 영역 분할 방법은 특징 맵을 이용하여 설정 된 경계 상자 영역을 기준으로 경계 상자의 회귀를 수행할 수 있다. 여기서, 경계 상자의 회귀란 특징 맵을 이 용하여 설정된 경계 상자 영역을 영상 데이터의 실측 자료와 비교하여 객체가 경계 상자 영역 내 존재하는 확률 의 오차를 계산하고, 오차를 줄이도록 회귀 연산하는 것이다. 이를 통해, 객체 탐지 특징 맵 기반 객체 영역 분 할 방법은 객체의 위치 인식 정확도를 높일 수 있다. 도 9는 본 발명의 일 실시예에 따른 객체 탐지 특징 맵 기반 객체 영역 분할 방법의 객체 영역 분할 단계의 순 서도이다. 도 9를 참조하면, 객체 영역 분할 단계(S230)는 주의 맵 생성 단계(S232), 분할 마스크 생성 단계(S234) 및 분 할 마스크 모방 단계(S236)를 포함한다. 여기서, 객체 영역 분할은 객체 탐지 단계(S220)를 보완하여 영상 내 객체를 픽셀 단위로 분할하여 탐지할 수 있다. 이때, 객체 영역 분할 단계(S230)는 객체 영역 분할을 학습하고 수행하기 위한 인공지능 객체 영역 분할 모델로서 자기 주의 증류 모델을 사용할 수 있다. 또한, 주의 맵 생성 단계(S232)는 특징 맵 추출 단계(S222)에서 생성된 특징 맵을 활용하고, 분할 마스크 생성 단계(S234)는 실측 자료 추출 단계(S210)에서 추출된 실측 자료를 활용할 수 있다. 보다 상세히 설명하면, 객체 탐지 특징 맵 기반 객체 영역 분할 방법은 특징 맵을 주의 맵으로 변환하여 주의 맵을 생성한다(단계 S232). 주의 맵은 특징 맵의 어떤 영역이 객체 영역을 인식하기 위해 많은 영향을 미 쳤는지 연산하여 시각화할 수 있다. 일례로, 주의 맵은 실측 자료로부터 추출되어 영상 데이터를 포함하고 있는 특징 맵에서 객체 인식을 위해 주요한 특징을 담고 있는 영역을 시각화할 수 있다. 이때, 특징 맵으로부터 주의 맵을 생성하기 위해 주의 생성기를 사용할 수 있다. 다음으로, 객체 탐지 특징 맵 기반 객체 영역 분할 방법은 주의 맵을 기초로 분할 마스크를 생성한다(단계 S234). 분할 마스크는 영상 내 객체를 픽셀 단위로 분할하여 객체의 의미를 표시하는 레이블이다. 여기서, 분할 마스크는 실측 자료와 객체의 의미를 표시한 레이블을 비교하여 보정할 수 있다. 또한, 객체 탐지 특징 맵 기반 객체 영역 분할 방법은 하위 계층의 분할 마스크가 상위 계층의 분할 마스크를 모방하여 오차를 줄임으로 써 객체 영역의 정확도를 높일 수 있다. 이와 같이, 본 발명의 일 실시예에 따른 객체 탐지 특징 맵 기반 객체 영역 분할 시스템 및 그 방법은 제조 산 업 및 건설 현장 환경에서 영상 센서를 탑재한 촬영 시스템을 활용하여, 상공에서 영상을 촬영 및 수집한 후 정 제하여 인양물 및 주변 장애물 탐지용 학습데이터를 구축하고, 추가적인 지도(supervision) 없이 탐지 모델의 실측 자료와 객체 탐지 모델에서 추출된 특징 맵들을 입력으로 사용하여 객체 탐지 및 분할 모델 내부에서 객체 영역을 분할하는 인공지능 기반 객체 탐지 및 분할 모델을 제공할 수 있다. 상기와 같은 방법들은 도 1에 도시된 바와 같은 객체 탐지 특징 맵 기반 객체 영역 분할 시스템에 의해 구 현될 수 있고, 특히, 이러한 단계들을 수행하는 소프트웨어 프로그램으로 구현될 수 있으며, 이 경우, 이러한 프로그램들은 컴퓨터 판독가능한 기록 매체에 저장되거나 전송 매체 또는 통신망에서 반송파와 결합된 컴퓨터 데이터 신호에 의하여 전송될 수 있다. 이때, 컴퓨터 판독가능한 기록 매체는 컴퓨터 시스템에 의해 판독가능한 데이터가 저장되는 모든 종류의 기록 장치를 포함하며, 예를 들면, ROM, RAM, CD-ROM, DVD-ROM, DVD-RAM, 자기 테이프, 플로피 디스크, 하드 디스크, 광 데이터 저장장치 등일 수 있다. 이상에서 본 발명의 일 실시예에 대하여 설명하였으나, 본 발명의 사상은 본 명세서에 제시되는 실시예에 제한 되지 아니하며, 본 발명의 사상을 이해하는 당업자는 동일한 사장의 범위내에서, 구성요소의 부가, 변경, 삭제, 추가 등에 의해서 다른 실시예를 용이하게 제안할 수 있을 것이나, 이 또한 본 발명의 사상 범위 내에 든다고 할 것이다. 부호의 설명100 : 객체 탐지 특징 맵 기반 객체 영역 분할 시스템 110 : 실측 자료 추출부 120 : 객체 탐지부 122 : 객체 검출부 123 : 특징 맵 생성부 124 : 객체 분류부 126 : 객체 위치 인식부 130 : 객체 영역 분할부 132 : 주의 맵 생성부 134 : 분할 마스크 생성부"}
{"patent_id": "10-2023-0101417", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 객체 탐지 특징 맵 기반 객체 영역 분할 시스템의 구성도이다. 도 2는 본 발명의 일 실시예에 따른 객체 탐지 특징 맵 기반 객체 영역 분할 시스템의 객체 탐지부에 대한 블록 도이다. 도 3은 본 발명의 일 실시예에 따른 객체 탐지 특징 맵 기반 객체 영역 분할 시스템의 객체 영역 분할부에 대한 블록도이다. 도 4는 본 발명의 일 실시예에 따른 객체 탐지 특징 맵 기반 객체 영역 분할 시스템의 인공지능 객체 탐지 및 영역 분할 모델을 도시한 구성도이다. 도 5는 본 발명의 일 실시예에 따른 객체 탐지 특징 맵 기반 객체 영역 분할 시스템의 실증 실험 결과에 대한도면이다. 도 6은 본 발명의 일 실시예에 따른 객체 탐지 특징 맵 기반 객체 영역 분할 시스템을 통해 생성된 시각과 결과 에 대한 도면이다. 도 7은 본 발명의 일 실시예에 따른 객체 탐지 특징 맵 기반 객체 영역 분할 방법의 순서도이다. 도 8은 본 발명의 일 실시예에 따른 객체 탐지 특징 맵 기반 객체 영역 분할 방법의 객체 탐지 단계의 순서도이 다. 도 9는 본 발명의 일 실시예에 따른 객체 탐지 특징 맵 기반 객체 영역 분할 방법의 객체 영역 분할 단계의 순 서도이다."}
