{"patent_id": "10-2010-0130290", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2012-0068598", "출원번호": "10-2010-0130290", "발명의 명칭": "멤리스터 장치 및 그 제조 방법", "출원인": "한국전자통신연구원", "발명자": "윤성민"}}
{"patent_id": "10-2010-0130290", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "기판;상기 기판 상부에 형성되어, 상기 기판의 구부러짐 동작에서 발생하는 상기 기판의 기계적인 스트레스를 경감시키는 기판 베리어 절연막층;상기 기판 베리어 절연막층의 일측에 형성된 소오스 전극층;상기 기판 베리어 절연막층의 타측에 형성된 드레인 전극층;상기 소오스 전극층과 상기 드레인 전극층 사이의 상기 기판 베리어 절연막층 상부에 형성되어 채널 영역을형성하는 산화물반도체 박막층;상기 산화물반도체 박막층 상부에 형성되어, 상기 산화물반도체 박막층을 보호하는 보호 절연막층;상기 소오스 전극층, 상기 드레인 전극층 및 상기 보호 절연막층 상부에 형성되어, 게이트 절연막으로 사용되는 유기 강유전체 박막층; 및상기 채널 영역의 상부측 유기 강유전체 박막층의 상부에 형성되는 상부 게이트전극층;을 포함하는 멤리스터 장치.명 세 서기 술 분 야본 발명은 반도체 장치 및 그 제조 방법에 관한 것으로, 더욱 상세하게는 산화물반도체 박막층과 유기 강유전 [0001]체 박막층을 각각 박막 트랜지스터의 채널층과 게이트 절연막층으로 사용하는 멤리스터 장치 및 그 제조 방법에 관한 것이다.배 경 기 술기존의 전자산업은 실리콘 소재를 기반으로 한 소재 및 소자 기술, 즉 실리콘 일렉트로닉스의 기술진보를 통 [0002]해 발전해왔다. 그러나 실리콘 일렉트로닉스는 물질의 특성상, 단단하고 깨지기 쉬우며, 가시광 영역에서 불투명하여 특정 어플리케이션 분야에서는 적합하지 않다는 단점이 있다. 이러한 실리콘 일렉트로닉스의 한계점을 극복하기 위한 방안으로서, 유연성을 갖는 기판 위에 전자 소자 및 전자 시스템을 제조하는 유연 일렉트로닉스(Flexible Electronics) 개념이 새롭게 제안되고 있다. 또한 현대의 일렉트로닉스 기기는 고성능을 중심으로 한 첨단 기기 및 부품 분야와, 성능을 다소 희생하더라도 저렴, 경량, 융합기능 등의 분야를 대상으로하는 차세대 부품 분야로 대별되고 있으며, 이러한 차세대 일렉트로닉스의 패러다임 전환을 적극적으로 지원하고 있는 기술이 바로 유연 일렉트로닉스 기술이다. 현재 이 분야에서는 센서, 디스플레이, 전자회로 및 전지 등의 다양한 어플리케이션의 실현을 목표로 연구 개발이 진행 중이다.한편, 현재 사용되고 있는 모든 전자부품을 구성하는 전자회로는 커패시터, 레지스터 및 인덕터 등 세 가지 [0003]유형의 수동부품으로 표현된다. 이 수동부품들은 에너지를 분산시키거나 저장하는 등의 역할을 하며, 능동적으로 에너지를 생성할 수는 없다. 또한 상기 세 가지 수동요소는 회로 동작을 설명하는 네 가지 기본 변수,전류, 전압, 전하 및 자속 중 두 개 사이의 간단한 선형적 연결관계로 설명될 수 있다. 이에 대해 1970년대초반 Leon Chua는 회로의 완벽한 구성을 위해서는 상기 세 가지 수동요소와 함께 네 번째 수동요소가 존재해야함을 예언하였으며, 이 요소를 멤리스터(Memristor)라고 명명하였다. 멤리스터는 자속과 전하를 연결하는수동요소이며, 멤리스터를 포함하여 네 개의 수동요소를 이용하면 총 6개의 회로 관련 공식을 완성할 수 있다고 주장하였다. 이후 약 40년이 지난 2008년 미국 HP의 연구자들은 이미 예언된 멤리스터의 기능이 구현되는새로운 종류의 전자소자를 제작하고, 드디어 회로의 네 번째 구성요소가 발견되었다고 주장한 바 있다.멤리스터에 전압을 인가하면, 멤리스터에 흐르는 전류가 시간에 따라 사인곡선의 형태로 나타난다. 이러한 특 [0004]성으로부터 멤리스터는 전도성이 강한 온 상태와 전도성이 약한 오프 상태를 가역적으로 이동한다. 따라서 멤리스터는 비선형적인 레지스터의 역할을 하게 되고, 전압의 시간 축약에 따라 저항이 비선형적으로 변하기 때공개특허 10-2012-0068598-3-문에 정보를 저장하는 레지스터의 역할을 할 수 있다. 다시 말하면, 멤리스터 소자는 얼마나 많은 양의 전류가 멤리스터를 통과했는가를 기억할 수 있는 것이다. 지금까지 보고된 다양한 저항변화형 메모리 소자를 기능적으로 광의의 멤리스터 소자로 분류할 수 있으며, 좁은 의미로는 자속과 전하의 관계를 만족하는 기능을 가진 소자를 멤리스터라고 할 수 있다.기존에 제안된 멤리스터 장치의 예는 다음과 같다. [0005]첫 번째, 금속 산화물로 대표되는 바이너리 산화물 양단에 소정의 전극을 형성하여 이단자 구조의 소자를 구 [0006]성하는 예이다. 이때 바이너리 산화물 소재의 종류로서, 대표적인 것으로 티타늄 산화물, 니켈 산화물, 구리산화물 등을 들 수 있다. 상기 소자에서는 소자 양단에 인가하는 전압의 극성과 크기를 변경함으로써 소자 양단의 저항 상태를 고저항 상태와 저저항 상태로 바꿀 수 있다. 두 번째, 확산이 용이한 원소와 원소 확산에 필요한 전해질의 두 가지 요소로 구성된 액티브 영역과 이 영역 [0007]양단에 소정의 전극을 형성하여 이단자 구조의 소자를 구성하는 예이다. 상기 소자에서는 소자 양단에 인가하는 전압의 극성과 크기를 변경함으로써 도전성을 갖는 확산종 원소가 전해질 내부에서 도전성 필라멘트를 형성하여 만드는 저저항 상태와 도전성 필라멘트가 해체되어 만드는 고저항 상태를 구현할 수 있다.세 번째, 소자를 구성하는 핵심 소재의 산화 환원 반응이나, 외기에 포함된 특수 가스종의 도입에 의해 소재 [0008]의 저항 상태가 크게 바뀌는 형태로 제작된 다양한 구조의 소자군이다. 가령, 특정 유기물 박막은 산화환원반응에 의한 유기물 소재의 구조 변경에 따라 저항 상태가 크게 바뀔 수 있다. 또한 특정 산화물 박막은 수소의 공급에 따라 전도성이 크게 다른 두 가지 물질로 가역적인 변화를 경험할 수 있다. 앞서 설명한 다양한 구조 및 동작 원리를 가지는 멤리스터 장치의 양호한 성능이 구현된다면 기존의 소자를 [0009]대체하여 향상된 성능을 제공하거나, 현재로서는 구현하지 못한 새로운 기능을 갖는 소자 응용 분야를 창출할수 있을 것으로 기대된다. 첫 번째 응용 분야는 초고밀도 비휘발성 메모리 소자 분야이다. 현재 이 분야에서는 실리콘 기반의 플래시메 [0010]모리가 대부분의 시장을 점유하고 있으나, 플래시메모리 자체가 안고 있는 물리적인 한계 때문에 가까운 미래에 이를 대체할 소자의 등장이 절실하게 요망되고 있는 형편이다. 일부에서는 저항변화형 메모리(Resistive-change Random Access Memory; ReRAM)라는 이름으로 활발하게 연구가 진행 중이다. 상기 분야는 기존의 실리콘 일렉트로닉스의 연장선 상에서 기존 비휘발성 메모리 기술의 수준을 비약적으로 향상시키는 것이 기술의목적이라고 할 수 있다.두 번째 응용 분야는 기존의 논리회로 내부에 메모리 기능을 갖는 소자를 함께 집적하여 논리회로 자체에 비 [0011]휘발성을 부여하는 기술 분야이다. 이러한 시도는 기존의 실리콘 기반 집적회로의 소비전력을 줄이기 위한 방법의 하나로 최근 활발하게 이루어지고 있는데, 빈번하게 사용하지 않는 회로 부위의 정보를 메모리 소자에임시 저장하고, 이 부위의 전력을 차단함으로써 전체 회로 시스템의 소비전력을 줄이는 것이 기술의핵심이다. 이 분야에 멤리스터 소자를 활용하기 위해서는 기존 실리콘 기반 소자와의 공정 정합성에 문제가없어야 한다.상기 첫 번째 및 두 번째 응용 분야의 특징은 기존 실리콘 기반 일렉트로닉스 회로 및 부품과 밀접한 관련이 [0012]있으며, 멤리스터 소자가 제공하는 데이터 저장의 형태가 디지털 정보라는 점이다. 이에 비해 멤리스터가 갖는 플럭스 누적 기반의 상태 변화 특성을 활용하면 멤리스터 소자가 제공하는 데이터 저장의 형태를 아날로그적으로 변경하고, 이에 따라 다양한 추가 기능을 기대할 수 있다. 세 번째 응용 분야는 적응학습 기능을 갖는 전자 소자의 응용 분야이다. 이 분야에서는 간단한 소자 구조를 [0013]이용하여 빠른 시간의 학습을 통해 소정의 특성을 발현하는 소자를 제공하기 위한 연구가 진행 중이며, 통상적으로는 실리콘계 CMOS 소자를 이용하여 상기 기능을 구현하기 위한 연구 예가 다수 보고되고 있다. 하지만,기존의 트랜지스터 소자를 이용하여 적응학습 기능을 구현하기 위해서는 소자의 수가 증가하여 회로의 크기가너무 커질 뿐만 아니라, 학습 기능을 부여하기 위해 막대한 학습 시간이 필요한 것으로 알려져 있어 그 실효성에 의문이 제기되고 있다. 반면, 멤리스터의 특성을 이용하면 매우 간단한 방법으로 온과 오프 상태 이외의다양한 중간 상태를 소자에 부여할 수 있으며, 아울러, 소자의 특성을 연속적으로 변화시키는 것이 가능하다.이러한 소자가 구현된다면, 기존의 실리콘 일렉트로닉스 컴퓨팅 기술의 비약적인 발전은 물론이고, 사용자 밀착형 유연 일렉트로닉스용 신규 소자 기술 발전에도 크게 기여할 것으로 기대된다.네 번째 응용 분야에는 상기 세 번째 응용 분야에서 언급한 멤리스터의 적응학습 기능을 더욱 고도화 시킨 것 [0014]으로, 멤리스터 소자를 신경망의 시냅스로 사용하고, 소정의 문턱값을 넘어섰을 때 차단의 뉴런에 전기신호를공개특허 10-2012-0068598-4-전달하는 신경망 뉴런 회로와 결합하여, 인간의 뇌에서 일어나는 지능형 정보처리 기능을 구현하는 신경회로망 응용 분야이다. 이 분야의 응용에서 멤리스터 소자는 뉴런과 뉴런을 연결하는 연결고리인 시냅스의 역할을담당하며, 앞서 설명한 적응학습 기능을 통해 서로 다른 중요도(Weight)을 갖는 시냅스를 실현할 수 있다. 상기 분야 역시 기존의 실리콘 일렉트로닉스 컴퓨팅 기술의 비약적인 발전은 물론, 유연 일렉트로닉스용 인공지능 소자 기술 발전을 앞당길 수 있는 핵심 원천 기술이다. 지금까지 멤리스터에서 구현 가능한 적응학습 기능의 실현을 위해 몇 가지 소자 구조와 동작 원리가 제안된 [0015]바 있으나, 이를 유연 기판 위에 제작하여 적응학습 기능을 갖는 멤리스터 소자를 실현하기 위해서는 다음과같은 문제점을 가지고 있다. 첫 번째, 바이너리 산화물을 이용하는 이단자 멤리스터 소자의 경우, 아직까지 동작원리가 명확하지 않고, 산 [0016]화물 박막층의 제작 조건이나 사용 전극의 종류에 따라서도 소자의 동작 특성이 불규칙적으로 변동하는 문제를 가지고 있다. 또한 소정의 조성의 유기물 박막층을 이용하는 멤리스터 소자의 경우, 유기물의 산화환원 반응이나 외기와의 반응을 통해 변화하는 화학적 반응기구를 동작원리로 이용하기 때문에 소자 특성의 변화량을정확하게 설계하기 어렵다. 하지만, 온 상태와 오프 상태 이외의 다양한 중간 상태를 각각의 중요도를 가진적응학습의 단계로 인식하고, 이를 설계하기 위해서는 인가 전압의 변화에 따른 소자 특성의 변동 지표를 정확하게 정의하고, 그 관계를 설계할 수 있는 동작원리를 채용하는 것이 바람직하다. 두 번째, 유연 기판 위에 제작하여 메모리 기능을 보고하고 있는 일부 유기물 기반 멤리스터 소자의 경우, 온 [0017]상태와 오프 상태의 마진이 너무 작다는 문제를 가지고 있다. 멤리스터 소자의 적응학습 기능을 안정적으로실현하기 위해서는 온 상태와 오프 상태 사이에 안정적으로 구현되는 다양한 중간 상태를 정의할 수 있어야하기 때문에, 가능한 한 넓은 범위의 온오프 마진을 확보하는 것이 바람직하다. 세 번째, 일부 실리콘 기판을 이용하는 원자스위치나 전계효과 트랜지스터 소자에서 멤리스터의 적응학습 기 [0018]능과 유사한 성능에 대해 보고하고 있으나, 이들 소자들은 기본적으로 실리콘 기판 상에서 제작하여 실리콘계소자들과 집적 사용하는 것을 전제로 하고 있어, 제조 공정이 복잡하거나, 특히 높은 공정온도를 요구한다는문제를 가지고 있다. 특히, 유연 일렉트로닉스에서 이용하는 통상의 유연 플라스틱 기판은 가장 높은 온도로서 300℃ 정도의 내열 특성을 가지고 있어, 소자 제조를 위해 적용하는 공정의 온도를 저온에서 수행하는 것이 바람직하다. 이와 같이 기존의 기술만으로는 멤리스터 장치의 적응학습 기능을 이용하면서, 상기 멤리스터 소자를 유연 기 [0019]판 위에 제작하여 차세대 유연 일렉트로닉스의 핵심 소자로서 적용할 수 있는 방법이 마련되어 있지 않다.발명의 내용해결하려는 과제본 발명은 상기한 바와 같은 문제점을 해결하기 위하여 안출된 것으로서, 산화물반도체 박막층과 유기 강유전 [0020]체 박막층을 각각 박막 트랜지스터의 채널층과 게이트절 연막층으로 사용하는 멤리스터 장치를 제공하는 데그 목적이 있다.본 발명의 다른 목적은 저온 공정을 이용하여 유연 기판 상에 제조하는 멤리스터 장치의 제조 방법을 제공한 [0021]다.과제의 해결 수단이와 같은 목적을 달성하기 위한, 본 발명의 제1 실시예에 따르면, 본 발명에 따른 멤리스터 장치는, 기판; [0022]상기 기판 상부에 형성되어, 상기 기판의 구부러짐 동작에서 발생하는 상기 기판의 기계적인 스트레스를 경감시키는 기판 베리어 절연막층; 상기 기판 베리어 절연막층의 일측에 형성된 소오스 전극층; 상기 기판 베리어절연막층의 타측에 형성된 드레인 전극층; 상기 소오스 전극층과 상기 드레인 전극층 사이의 상기 기판 베리어 절연막층 상부에 형성되어 채널 영역을 형성하는 산화물반도체 박막층; 상기 산화물반도체 박막층 상부에형성되어, 상기 산화물반도체 박막층을 보호하는 보호 절연막층; 상기 소오스 전극층, 상기 드레인 전극층 및상기 보호 절연막층 상부에 형성되어, 게이트 절연막으로 사용되는 유기 강유전체 박막층; 및 상기 채널 영역의 상부측 유기 강유전체 박막층의 상부에 형성되는 상부 게이트 전극층을 포함한다.발명의 효과공개특허 10-2012-0068598-5-이상에서 설명한 바와 같이 본 발명에 의하면, 유연한 플라스틱 기판 상에 적응학습 기능을 갖는 멤리스터 트 [0023]랜지스터를 제공함으로써, 전압 신호의 인가 방식을 변경하여 다양한 상태의 채널 저항값을 임의로 설정하거나, 소자의 특성을 동적으로 제어할 수 있는 적응학습 기능을 갖는 멤리스터 트랜지스터를 제공할 수 있다.또한, 적응학습형 유연한 멤리스터 장치를 제공함으로써, 향후 본격적으로 전개될 유연 일렉트로닉스 분야에 [0024]서 향상된 기능성과 신규 응용성을 갖는 일렉트로닉스 기기의 실현에 크게 기여할 수 있다.도면의 간단한 설명도 1은 본 발명의 제1 실시예에 따른 멤리스터 트랜지스터의 단면도, [0025]도 2는 본 발명의 제2 실시예에 따른 멤리스터 트랜지스터의 단면도,도 3은 본 발명의 제3 실시예에 따른 멤리스터 트랜지스터의 단면도,도 4는 본 발명의 제4 실시예에 따른 멤리스터 트랜지스터의 단면도,도 5a 내지 도 5c는 본 발명에 따른 멤리스터 트랜지스터가 메모리 기능과 적응학습 기능을 발현하는 동작 원리를 설명하는 모식도,도 6a 내지 도 6d는 본 발명에 따른 멤리스터 트랜지스터의 적응학습 기능을 구현하기 위한 전압의 인가 조건및 전압 인가에 따른 강유전 자발분극과 트랜지스터 드레인 전류의 상관관계를 모식적으로 나타낸 도면,도 7은 산화물반도체 박막층과 유기 강유전체 박막층을 각각 반도체 채널층과 게이트 절연막층으로 이용하여제작한 박막 트랜지스터 소자의 드레인 전류값과 메모리 온오프비가 프로그램 동작을 위해 인가한 전압 펄스폭의 변화에 따라 변화하는 경향을 나타낸 그래프,도 8은 본 발명의 제1 실시예에 따른 멤리스터 트랜지스터의 게이트 전압 및 드레인 전류 특성을 나타내는 그래프이다.발명을 실시하기 위한 구체적인 내용이하, 본 발명의 일실시예를 첨부된 도면들을 참조하여 상세히 설명한다. 또한, 본 발명을 설명함에 있어, 관 [0026]련된 공지 구성 또는 기능에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되는 경우에는 그상세한 설명은 생략한다.도 1은 본 발명의 제1 실시예에 따른 멤리스터 트랜지스터의 단면도이다. [0027]도 1에서 도시된 바와 같이, 본 발명에 따른 멤리스터 트랜지스터는 기판(100) 상에 형성된 기판 베리어 절연 [0028]막층(102), 소오스 및 드레인 전극층(104a, 104b), 산화물반도체 박막층(106), 보호 절연막층(108), 유기 강유전체 박막층(110) 및 상부 게이트전극층(114)을 포함한다. 또한, 베리어 절연막층(102) 상부에 소정의 간격으로 형성된 소오스 및 드레인 전극층(104a, 104b)과 상부 게이트전극층(114)에 각각 연결된 복수의 컨택 비아홀(112) 및 복수의 컨택 비아홀(112)을 통해 소오스 및 드레인 전극층(104a, 104b)과 상부 게이트전극층(114)에 각각 연결된 소오스 및 드레인 전극패드(116a, 116b)와 게이트 전극패드(미도시)를 더 포함한다.이하 각 구성요소에 대해 구체적으로 살펴보도록 한다. [0029]상기 기판(100)은 본 발명에 따른 멤리스터 트랜지스터의 유연성을 확보하기 위하여 플라스틱 소재로 구성되 [0030]는 것이 바람직하다. 구체적으로는 폴리이미드(PI), 폴리카보네이트(PC), 폴리에테르설폰(PES), 폴리에틸렌나프탈레이트(PEN), 폴리에테르에테르케톤(PEEK), 폴리부틸렌테레프탈레이트(PBT), 폴리에틸렌테레프탈레이트(PET), 폴리염화비닐(PVC), 폴리에틸렌(PE), 에틸렌 공중합체, 폴리프로필렌(PP), 프로필렌 공중합체, 폴리(4-메틸-1-펜텐)(TPX), 폴리아릴레이트(PAR), 폴리아세탈(POM), 폴리페닐렌옥사이드(PPO), 폴리설폰(PSF), 폴리페닐렌설파이드(PPS), 폴리염화비닐리덴(PVDC), 폴리초산비닐(PVAC), 폴리비닐알콜(PVAL), 폴리비닐아세탈,폴리스티렌(PS), AS수지, ABS수지, 폴리메틸메타크릴레이트(PMMA), 불소수지, 페놀수지(PF), 멜라민수지(MF),우레아수지(UF), 불포화폴리에스테르(UP), 에폭시수지(EP), 디알릴프탈레이트수지(DAP), 폴리우레탄(PUR), 폴리아미드(PA), 실리콘수지(SI) 또는 이것들의 혼합물 및 화합물 중 하나로 구성될 수 있다.상기 기판 베리어 절연막층(102)은 전기적인 절연특성을 가지는 무기 또는 유기 절연막층으로 형성할 수 있으 [0031]며, 상기 기판(100)의 구부러짐 동작에서 발생하는 기계적인 스트레스를 경감시키기 위해 소정의 구조를 갖는유무기 적층막의 형태로 형성할 수 있다. 예를 들어, 기판 베리어 절연막층(102)은 무기 절연막으로는 실리콘공개특허 10-2012-0068598-6-산화막(SiO2), 실리콘질화막(SiNx), 실리콘산질화막(SiON) 등의 실리콘 계열 절연막으로 형성되거나, 유기 절연막으로는 알루미늄 산화막(Al2O3), 하프늄 산화막(HfO2), 지르코늄 산화막(ZrO2), 티타늄 산화막(TiO2) 등으로 형성될 수 있으며, 두 가지 이상의 금속 원소가 혼합된 산화막으로 형성될 수 있다.이때 본 발명에서 제안하는 멤리스터 트랜지스터에서 상기 기판 베리어 절연막층(102)의 역할은 다음과 같다. [0032]첫 번째 역할은 상기 플라스틱 소재 기판(100) 표면의 평탄성을 향상시키는 것이다. [0033]두 번째 역할은 상기 플라스틱 소재에 함유되어 있는 가스 성분이 기판(100) 상부로 배출되어 소자 특성에 악 [0034]영향을 미치는 것을 방지하는 것이다.세 번째 역할은 상기 플라스틱 소재를 통해 외기에 포함된 수분이 침투하여 소자 특성에 악영향을 미치는 것 [0035]을 방지하는 것이다.네 번째 역할은 상기 플라스틱 기판을 사용하여 제조하는 본 발명에 따른 멤리스터 트랜지스터의 제조 과정에 [0036]서 수행하는 소정의 열처리 과정을 통해 기판(100)에 발생하는 기계적인 스트레스를 경감시키는 것이다.다만, 이러한 목적을 달성하기 위해서는 기판(100)에 발생하는 스트레스를 최소화할 수 있도록 상기 기판 베리어 절연막층(102)을 구성하는 소재 및 적층 구조를 적절하게 설계해야 한다.한편, 상기 기판 베리어 절연막층(102)은 상기 기판(100)의 내열성을 고려하여 공정온도를 엄밀하게 제어해야 [0037]할 필요가 있다. 무기막 베리어 절연막층의 경우, 원자층증착법(atomic layer deposition), 스퍼터링법(sputtering), 스핀코팅법(spin-coating) 등 일반적인 무기물 박막 형성 공정에서 도입 가능한 증착 방법을사용할 수 있다. 또한 유기막 베리어 절연막층의 경우, 스핀코팅법, 진공 열증착법(thermal evaporation), 랑미어 블로젯(LB)법 등 일반적인 유기물 박막 형성 공정에서 도입 가능한 증착 방법을 사용할 수 있다. 상기기판 베리어 절연막층(102)의 형성 조건은 저온에서도 우수한 평탄성과 전기적 절연성을 확보할 수 있도록 증착 조건을 최적화하는 것이 바람직하다.소오스 및 드레인 전극층(104a, 104b)은 금속 전극층 또는 전도성 산화물 박막층으로 형성하는 것이 바람직하 [0038]며, 경우에 따라서는 소정의 구조를 가지는 금속 적층 전극층 또는 전도성 산화물 박막층과 금속 박막층을 모두 포함하는 적층막 전극층의 형태로 형성될 수 있다. 상기 소오스 및 드레인 전극층(104a, 104b)을 구성하는소재를 선택하는 데 있어서 고려해야 할 가장 중요한 요소 중의 하나는, 본 발명에 따른 멤리스터 트랜지스터의 반도체 채널 역할을 담당할 산화물반도체 박막층(106)과 양호한 전기적 접촉 특성을 실현해야 할 필요가있다는 점이다. 예를 들면, 금속 전극층 소재로는 티타늄(Ti), 전도성 산화물 박막층 소재로는 인듐-주석 산화물(In-Sn-O, ITO), 인듐-아연 산화물(In-Zn-O), 알루미늄-아연 산화물(Al-Zn-O)등을 채용하는 것이 바람직하며, 그 외 몰리브덴(Mo), 크롬(Cr), 알루미늄(Al), 금(Au), 은(Ag), 구리(Cu) 등의 다양한 금속 전극층을사용할 수 있다. 또한 응용 시스템의 요구 사양을 만족시키기 위해 상기 소재들을 이층 또는 삼층 구조로 적층하여 사용할 수도 있다.여기서, 소오스 및 드레인 전극층(104a, 104b)은 상기 기판 베리어 절연막층(102) 상에 전기적으로 분리된 두 [0039]개의 영역에 소정의 간격을 가지고 형성된 소오스 전극층(104a) 및 드레인 전극층(104b)으로 구성된다. 여기서 소오스 전극층(104a)과 드레인 전극층(104b) 사이의 영역이 멤리스터 트랜지스터의 채널 영역으로 정의된다. 따라서 소오스 및 드레인 전극층(104a, 104b)의 패턴 폭 및 패턴 사이의 거리에 의해 멤리스터 트랜지스터의 채널 폭 및 길이가 결정된다. 이때, 멤리스터 트랜지스터의 동작 특성을 고려하여 채널 폭 및 길이를 적절하게 설계하는 것이 바람직하다.산화물반도체 박막층(106)은 소오스 전극층(104a) 및 드레인 전극층(104b) 사이의 기판(100) 상부, 자세하게 [0040]는 기판 베리어 절연막층(102) 상부에 형성된다. 즉, 본 발명에 따른 멤리스터 트랜지스터의 채널 영역에 형성되는데, 소오스 및 드레인 전극층(104a, 104b)의 측벽 및 상부 일부를 덮도록 형성될 수 있다. 여기서 산화물반도체 박막층(106)은 멤리스터 트랜지스터의 반도체 역할을 수행하며, 특히 산화물반도체로 형성하는 것을특징으로 한다. 여기서 산화물반도체 박막층(108)은 에너지 밴드갭이 넓어 가시광 영역에서 투명한 성질을 갖는 산화물이면서 전기적으로 반도체의 성질을 갖는 투명한 산화물반도체 박막으로 형성되는 것이 바람직하다.예를 들어, 아연 산화물(ZnO), 인듐-갈륨-아연 산화물(In-Ga-Zn-O), 아연-주석 산화물(Zn-Sn-O)로형성되거나, 아연, 인듐, 갈륨, 주석, 알루미늄 중 적어도 두 개 이상의 원소를 포함하는 산화물로 형성될 수있다. 또는, 앞서 언급한 산화물에 다양한 원소를 도핑하여 형성할 수 있다.상기 산화물반도체 박막층(106)은 스퍼터링 방법, 화학적기상증착법(Chemical Vapor Deposition), 원자층 증 [0041]공개특허 10-2012-0068598-7-착법, 펄스레이저 증착법(Pulsed-laser Deposition), 솔젤용액을 이용하는 스핀코팅 방법, 전구체 잉크를 이용하는 인쇄방법 등 산화물 박막을 형성하기 위해 통상적으로 사용되는 모든 증착 방법을 사용할 수 있다. 물론 이들 방법을 병용 또는 변용하여 사용하는 것도 가능하다. 또한 산화물반도체 박막층(106)의 증착 공정의온도는 상기 기판(100)의 내열성을 고려하여 공정온도를 엄밀하게 제어해야 할 필요가 있다. 바람직하게는,보다 낮은 온도에서도 양호한 멤리스터 트랜지스터의 동작 성능이 발현될 수 있도록 상기 산화물반도체 박막층(106)의 재료 조성 및 공정 조건을 최적화해야 할 필요가 있다. 여기서 산화물반도체 박막층(106)의 두께는 멤리스터 트랜지스터의 동작조건을 결정하는 중요한 소자 변수의 [0042]하나이므로, 다음의 사항을 고려하여 그 두께를 결정하는 것이 바람직하다.첫 번째, 산화물반도체 박막층(106)을 채널층으로 사용하는 트랜지스터 소자의 동작 특성을 확보할 수 범위 [0043]내에서 상기 산화물반도체 박막층(106)의 두께를 결정한다. 일반적으로 박막 트랜지스터의 채널 영역의 반도체 박막으로 기능하기 위해서는 5 내지 50nm의 두께로 산화물반도체 박막층(106)을 형성하는 것이바람직하다. 만약, 5nm보다 막 두께가 얇은 경우에는 반도체 박막 표면을 이동하는 캐리어의 평균 이동거리보다 막 두께가 얇아지는 경우가 발생하여 캐리어의 이동도를 크게 떨어뜨리는 원인이 될 수 있다. 한편, 50nm보다 막 두께가 두꺼운 경우에는 반도체 박막 내부의 캐리어 농도가 과도하여 박막 트랜지스터의 전기적인 동작 특성에 있어서 오프 전류의 증가와 트랜지스터의 온오프 동작 마진의 감소를 초래할 수 있으며, 극단적으로 캐리어 농도가 높은 경우에는 구동 트랜지스터의 동작 자체를 확보할 수 없다. 따라서 첫 번째 사항을 고려할 때 산화물반도체 박막층(106)의 두께는 5 내지 50nm인 것이 바람직하다. 두 번째, 멤리스터 트랜지스터의 메모리 동작을 보다 낮은 전압에서 수행할 수 있도록 반도체 박막층(106)의 [0044]두께를 결정하는 것이 바람직하다. 본 명세서에서는 멤리스터 트랜지스터의 동작 전압을 결정하기 위한 정량적인 계산에 대해서는 설명을 생략하나, 본 발명에 따른 멤리스터 트랜지스터의 동작 전압은 시냅스의 자극주기 동작을 수행하는 경우보다 반자극주기 동작을 프로그래밍하는 경우에 더 높은 동작 전압을 요구한다. 그이유는 산화물반도체 박막의 경우, 그 소재의 특성상, 인가 전압의 변화에 따라 반전층과 축적층에서 동작하는 통상적인 실리콘 반도체와 달리, 인가 전압의 변화에 따라 공핍층과 축적층에서 동작하며, 특정 전압 조건에서 산화물반도체 박막은 완전 공핍화되어 절연체와 같이 거동하는 특징을 갖기 때문이다. 이와 같은 조건하에서는 트랜지스터를 구성하는 게이트 스택 구조 상에서 산화물반도체 박막의 완전 공핍층의 존재로 인해형성된 직렬 커패시터에 의해 프로그래밍 전압의 손실이 발생하게 되며 결과적으로 반자극주기 동작의 프로그래밍 동작 전압의 상승을 초래하는 원인이 된다. 따라서, 이러한 효과를 가능한 수준에서 억제하고 반자극주기 동작의 프로그래밍 전압을 줄이기 위해서는 산화물반도체 박막의 완전 공핍층의 두께를 가능한 한 줄일 필요가 있으며, 이는 상기 산화물반도체 박막층(106)의 두께를 가능한 한 줄일 필요가 있음을 의미한다. 따라서두 번째 사항을 고려할 때 산화물반도체 박막층(106)의 증착 두께는 20nm 이하인 것이 바람직하다. 결과적으로 상기 첫 번째 사항과 두 번째 사항을 동시에 고려하면, 산화물반도체 박막층(108)의 두께는 5 내 [0045]지 20nm의 범위에서 결정되는 것이 더욱 바람직하다.보호 절연막층(108)은, 산화물 절연체 박막으로 형성되는 것이 바람직하며, 예를 들어, 실리콘 산화막(SiO2), [0046]실리콘질화막(SiNx), 실리콘산질화막(SiON) 등의 실리콘 계열 절연막으로 형성되거나, 알루미늄 산화막(Al2O3), 하프늄 산화막(HfO2), 지르코늄 산화막(ZrO2), 티타늄 산화막(TiO2) 등으로 형성될 수 있으며, 두 가지 이상의 금속 원소가 혼합된 산화막으로 형성될 수 있다. 또한 앞서 언급된 산화물을 구성하는 금속 원소와실리콘이 혼합된 실리케이트 절연막으로 형성될 수 있다. 이외에도 통상적인 산화물 박막 트랜지스터의 제작에 있어서 게이트 절연막 재료로 사용 가능한 산화물 절연막 물질들로 형성될 수 있다.보호 절연막층(108)은 후속 공정시 산화물반도체 박막층(106)의 손상을 방지하고, 본 발명의 멤리스터 트랜지 [0047]스터의 특성을 향상시키기 위한 목적으로 형성되는 것을 특징으로 한다. 여기서 보호 절연막층(108)은 상기산화물반도체 박막층(106) 상부에 형성되는데, 산화물반도체 박막층(106)과 함께 소오스 전극층(104a)과 드레인 전극층(104b) 사이의 채널 영역에 형성되며, 소오스 및 드레인 전극층(104a, 104b)의 측벽 및 상부의 일부를 덮도록 형성될 수 있다.이때 본 발명에서 제안하는 멤리스터 트랜지스터에서 상기 보호 절연막층(108)의 역할을 자세하게 살펴보면 [0048]다음과 같다.첫 번째, 산화물반도체 박막층(106)의 식각 공정 및 식각 마스크 제거 공정시 산화물반도체 박막층(106)의 공 [0049]정 열화 현상을 억제한다. 상기 공정에서 보호 절연막층(108)을 제공하지 않는 경우, 포토레지스트, 포토레지공개특허 10-2012-0068598-8-스트 현상액, 포토레지스트 박리액 등의 화학 약품이 산화물반도체 박막층(106)에 직접 작용하여 산화물반도체 박막층(106)의 재료적인 특성이 열화될 수 있다. 따라서 산화물반도체 박막층(106) 상에 보호 절연막층(108)을 형성함으로써 산화물반도체 박막층(108)이 화학적으로 열화되는 것을 방지할 수 있다.두 번째, 후속 공정 수행시 산화물반도체 박막층(106)이 손상되어 열화되는 것을 방지함으로써, 산화물반도체 [0050]박막층(106)이 반도체로서의 역할을 충실히 수행하여 멤리스터 트랜지스터가 양호한 동작 특성을 갖게 한다.구체적으로, 보호 절연막층(108)은 후속 공정에서 형성할 유기 강유전체 박막층(110) 형성시 산화물반도체 박막층(106)의 화학적 열화 현상을 억제한다. 유기 강유전체 박막층(110)은 유기 용액을 이용하는 도포 공정에의해 형성되는데, 이때 사용되는 유기 용액의 종류에 따라 산화물반도체 박막층(106)의 재료적인 특성이 열화될 수 있다. 따라서, 산화물반도체 박막층(106) 상에 보호 절연막층(108)을 형성함으로써 산화물반도체 박막층(106)이 화학적으로 열화되는 것을 방지할 수 있다.세 번째, 보호 절연막층(108)의 물질 종류 및 공정 조건을 변화시켜 산화물반도체 박막층(106)의 전기적인 특 [0051]성을 변화시킬 수 있다. 특히 보호 절연막층(108) 형성시 공정 조건을 변경하여 산화물반도체 박막층(106)의캐리어 농도, 표면의 화학적 상태 등을 변화시킴으로써 멤리스터 트랜지스터의 동작 특성을 개선할 수 있다.네 번째, 보호 절연막층(108)은 후속 공정에서 형성할 유기 강유전체 박막층(106)의 누설전류를 억제하는 전 [0052]기적인 보호막의 역할을 한다. 본 발명의 멤리스터 트랜지스터를 구성하는 유기 강유전체 박막층(110)은 그소재의 특성상 박막화를 진행할수록 누설전류가 크게 증가하게 되는데, 이는 멤리스터 트랜지스터의 동작특성을 결정적으로 저하시키는 원인으로 작용할 수 있다. 따라서 유기 강유전체 박막층(110)과 산화물반도체 박막층(106) 사이에 보호 절연막층(108)을 제공하여 누설전류에 따른 멤리스터 트랜지스터의 특성 저하를 방지할수 있다.전술한 바와 같은 상기 보호 절연막층(108)의 역할을 고려할 때 보호 절연막층(108)은 첫째, 산화물반도체 박 [0053]막층(106)의 공정 열화 현상을 충분히 억제할 수 있고, 둘째, 보호 절연막층(108)의 도입에 의해 멤리스터 트랜지스터의 적응학습 기능을 개선할 수 있으며, 셋째, 유기 강유전체 박막층(110)의 누설전류를 충분히 억제할 수 있는 전기적 특성을 보유하도록 형성되는 것이 바람직하다.여기서 보조 절연막층(108)의 두께는 멤리스터 트랜지스터의 동작 특성을 결정하는 매우 중요한 소자 변수의 [0054]하나로서, 다음의 사항을 고려하여 보조 절연막층(108)의 두께를 결정하는 것이 바람직하다.첫 번째, 멤리스터 트랜지스터의 동작 전압이 너무 증가하지 않는 범위에서 결정되어야 한다. 즉, 보조 절연 [0055]막층(108)의 두께가 너무 두꺼운 경우, 멤리스터 트랜지스터의 구동 전압의 일부가 트랜지스터의 게이트 스택의 일부를 구성하는 보조 절연막층(108)에 의해 생기는 직렬 커패시터에서 소모되어 전체적으로 동작 전압을상승시키는 원인이 될 수 있기 때문이다. 따라서, 첫 번째 사항을 고려할 때 보조 절연막층(108)의 두께는10nm 이하의 범위에서 결정되는 것이 바람직하다.두 번째, 산화물반도체 박막층(106)의 식각 공정에 있어서, 각종 화학약품으로부터 초래되는 공정 열화를 충 [0056]분히 억제할 수 있는 범위에서 결정되어야 한다.세 번째, 후속 공정에서 형성될 유기 강유전체 박막층(108)의 누설 전류를 충분히 억제할 수 있는 범위에서 [0057]결정되어야 한다.따라서, 두 번째 및 세 번째 사항을 고려할 때 보조 절연막층(108)의 두께는 4nm 이상인 것이 바람직하다. 결 [0058]과적으로 첫 번째 내지 세 번째 사항을 동시에 고려할 때, 보조 절연막층(108)의 두께는 4 내지 10nm의 범위에서 결정되는 것이 바람직하다.유기 강유전체 박막층(110)은 본 발명의 멤리스터 트랜지스터의 메모리 동작 및 적응학습 기능을 구현하기 위 [0059]한 트랜지스터의 게이트 절연막으로 사용되며, 유기 소재 즉, 저분자 또는 고분자의 유기물 재료로 전압의 인가에 따라 잔류분극 현상을 보이는 강유전성을 갖는 유기 물질로 형성된다.예를 들어, 유기 강유전체 박막층(110)은 P(VDF)(Poly(Vinylidene Fluoride) 및 P(VDF)에 적절한 비율의 [0060]TrFE(Trifluorotethylene)가 혼합된 공중합체인 P(VDF-TrFE)로 형성될 수 있다. P(VDF)와 TrFE의 혼합 조성범위는 P(VDF-TrFE)가 강유전 특성을 나타내는 범위 내에서 조절될 수 있으며, 예를 들어, P(VDF)가 55% 이상포함되는 것이 바람직하다. 물론, 혼합 조성 범위는 유기 강유전체 박막층(110)의 누설 전류 특성 및 강유전성을 최적화하기 위해 적절한 비율로 조절되는 것이 더욱 바람직하다.여기서 유기 강유전체 박막층(110)은 스핀코팅 방법에 의해 형성되는 것이 바람직하다. 예를 들어, P(VDF- [0061]공개특허 10-2012-0068598-9-TrFE)를 선택하여 유기 강유전체 박막층 (110)을 형성하는 경우, 통상적으로 고체 알갱이 형태의 P(VDF-TrFE)원료를 적절한 유기 용매에 용해시키는 방법으로 원료 용액을 제조할 수 있다. 스핀코팅 방법에 의해 유기 강유전체 박막층(110)을 형성하는 통상적인 순서는 다음과 같다. 먼저, 원료 용액을 소정의 기판 위에 적하하여적절한 스핀 코팅 조건으로 코팅한 후, 원료 용액에 포함된 유기 용매를 휘발시키기 위해 소정의 온도에서 열처리를 수행한다. 이어서, 유기 강유전체막의 결정화 과정을 위해 소정의 온도에서 열처리를 수행한다. 통상적으로 유기 용매 휘발을 위한 열처리 공정의 온도는 사용하는 유기 용매에 따라 다를 수는 있으나, 50 내지120℃에서 수행되는 것이 바람직하다. 또한, 결정화를 위한 열처리 공정의 온도는 사용하는 유기 강유전체의물질 종류에 따라 다를 수 있으나, 유기 강유전체 소재로서 P(VDF-TrFE)를 사용하는 경우, 120 내지 160℃ 사이의 온도에서 수행되는 것이 바람직하다. 이때, 유기 강유전체 박막층(110)이 양호한 강유전 특성을 갖도록하기 위해서는 박막의 결정화 과정이 필수적이기 때문에 결정화 온도를 선택하는 것은 매우 중요하다. 만일결정화 공정의 온도가 너무 낮으면 박막의 결정화도가 부족하여 소망하는 전기적 특성을 얻기 어려우며, 반대로 결정화 공정의 온도가 너무 높으면 형성된 박막이 완전히 용융되어 강유전 특성을 소실할 우려가 있다. 예시한 바와 같이, 유기 강유전체 소재인 P(VDF-TrFE)의 결정화 온도는 통상으로 사용되는 상기 플라스틱 기판소재의 내열성 범위 안에 있기 때문에, 본 발명의 멤리스터 트랜지스터를 제작하기에 용이하다. 한편, 스핀코팅 방식에 의해 유기 강유전체 박막층(110)을 형성하는 경우, 스핀코팅 공정의 회전수 및 유기 [0062]강유전체 원료 용액의 농도 조절을 통해 유기 강유전체 박막층(110)의 두께를 조절할 수 있다. 여기서, 유기강유전체 박막층(110)의 적절한 두께를 선택하기 위해서는 다음의 두 가지 사항을 고려해야 한다. 첫 번째, 멤리스터 트랜지스터의 동작 전압을 가능한 한 낮출 수 있는 방향으로 선택하는 것이 바람직하다. [0063]이를 위해서는 상대적으로 낮은 인가 전압에서도 용이하게 분극의 반전이 가능하도록 유기 강유전체 박막층(110)의 두께를 줄이는 것이 바람직하다. 그러나, 기존의 연구 결과에 의하면, 유기 강유전체 박막의 두께가일정 두께 이하로 얇아질 경우 박막 자체의 강유전성이 크게 열화하여, 분극 반전이 일어나는 전계값이 크게증가하고, 동일 전계에서도 분극 반전에 필요한 시간이 매우 길어지는 현상이 나타난다는 사실이 알려져있다. 이러한 열화 현상이 일어나는 임계막 두께의 값은 유기 강유전체의 상하부에 어떤 전극을 사용하는가에따라서도 달라질 수는 있으나 일반적으로 50nm 이하의 막 두께에서 현저하게 관찰되는 것으로 알려져 있다.두 번째, 메모리 트랜지스터 즉, 메모리 트랜지스터의 데이터 리텐션 특성을 향상시킬 수 있는 방향으로 선택 [0064]하는 것이 바람직하다. 메모리 트랜지스터의 데이터 리텐션 시간은 유기 강유전체 박막층(110)의 누설 전류특성과 매우 밀접한 관련이 있는 만큼 소자의 동작 중에 있어서 과도한 누설 전류가 발생하지 않도록 유기 강유전체 박막층(110)의 증착 두께를 최적화할 필요가 있다. 연구 결과에 따르면, 유기 강유전체막의 막 두께가200nm 정도에서는 인가 전압에 따른 현저한 누설 전류가 발생하지 않는 것이 알려져 있다.따라서, 유기 강유전체 박막층(110)의 증착 두께는 상기 첫 번째 사항과 상기 두 번째 사항을 모두 고려하여 [0065]50 내지 200nm의 범위에서 선택하는 것이 바람직하다. 다만, 향후 기술 개발에 따라 유기 강유전체막이 더욱박막화되더라도 우수한 강유전 특성을 얻을 수 있는 방법이 개발된다면, 유기 강유전체 박막층(110)의 증착두께 하한은 더욱 감소할 수 있다.상부 게이트전극층(114)은 유기 강유전체 박막층(110)의 상부 일부에 위치하는데, 특히 멤리스터 트랜지스터 [0066]의 채널 영역 상부에 위치한다. 여기서 상부 게이트전극층(114)은 금속 전극층 또는 전도성 산화물 박막층으로 형성할 수 있다. 예를 들면, 금속 전극층 소재로는 티타늄(Ti), 몰리브덴(Mo), 크롬(Cr), 알루미늄(Al),금(Au), 은(Ag), 구리(Cu) 등의 다양한 금속 전극층을 사용할 수 있으며, 전도성 산화물 박막층 소재로는 인듐-주석 산화물(In-Sn-O, ITO), 인듐-아연 산화물(In-Zn-O) 박막층을 사용할 수 있다. 또한 응용 시스템의 요구 사양을 만족시키기 위해 상기 소재들을 이층 또는 삼층 구조로 적층하여 사용할 수도 있다.여기서, 주의해야 할 점은 상기 상부 게이트전극층(114)의 형성 공정 및 패터닝 공정은 하부의 유기 강유전체 [0067]박막층(110)에 손상을 주지 않도록 설계되어야 한다는 점이다. 그 이유는 다음과 같다.첫 번째, 플라즈마를 사용하는 통상적인 도전성 박막의 증착 공정은 본 발명의 멤리스터 트랜지스터의 구성에 [0068]있어서 소자의 메모리 동작 및 적응학습 기능을 실현하기 위해 매우 중요한 구성요소인 유기 강유전체 박막층(110)의 전기적, 기계적인 박막 특성을 크게 열화시킬 가능성이 있기 때문이다.두 번째, 예를 들어 ITO 등의 전도성 산화물 박막층을 상부 게이트전극층(114)의 물질로 사용하는 경우, 전극 [0069]의 전도도 향상을 위해 증착 공정 이후 소정의 온도에서 후속 열처리 공정을 수행하는 경우가 많으나, 앞서설명한 바와 같이, 상기 유기 강유전체 박막층(110)의 물질로서 P(VDF-TrFE)를 사용하는 경우, 후속 공정을위한 공정온도를 P(VDF-TrFE)의 녹는점 이상의 온도로 설정할 수 없기 때문이다.공개특허 10-2012-0068598-10-세 번째, 유기 강유전체 박막층(110)의 물질로서 P(VDF-TrFE)를 사용하는 경우, P(VDF-TrFE) 표면의 거칠기 [0070]정도가 매우 심하여, 통상적으로 사용하는 전도성 산화물 박막층과의 밀착성이 좋지 않아, 식각 공정 과정에서 건전한 형상의 패터닝이 매우 어려워지기 때문이다.따라서, 상기 상부 게이트전극층(114)은 유기 강유전체 박막층(110)에 손상을 주지 않도록 전극 물질의 종류, [0071]증착 공정 방법, 후속 열처리 공정온도, 식각 공정 조건 등을 최적화하는 것이 바람직하다. 증착 공정 방법의예로는 공정 중에 플라즈마를 사용하지 않는 진공 열증착법, 전자빔증착법(e-beam deposition) 등을 사용하는것이 바람직하며, 플라즈마를 사용하는 스퍼터링 방법으로 상부 게이트전극층(114)을 형성하는 경우에는 장비의 구조 및 증착 조건을 최적화해야 할 필요가 있다.소오스 및 드레인 전극패드(116a, 116b)는 유기 강유전체 박막층(110)의 일부를 관통하여 형성된 컨택 비아홀 [0072](112)를 통해 소오스 및 드레인 전극층(104a, 104b)과 전기적으로 연결된다. 일 예로 본 도면에서는 멤리스터트랜지스터의 컨택 비아홀(112)은 유기 강유전체 박막층(110)을 관통하도록 형성되는 경우에 대해 도시하고있다. 이 공정 과정에서 소오스 및 드레인 전극패드(116a, 116b)가 형성될 영역의 유기 강유전체 박막층(110)을 선택적으로 제거한다. 예를 들어, 유기 강유전체 박막층(110)의 상부에 프토레지스트 패턴을 형성한 후,포토레지스트 패턴을 식각 마스크로 유기 강유전체 박막층(110)을 식각한다. 이어서, 식각 마스크인 포토레지스트 패턴을 제거한다. 여기서, 유기 강유전체 박막층(110)의 식각 공정은 다음의 두 가지 사항을 고려해야한다.첫 번째, 산소 플라즈마를 이용하여 유기 강유전체 박막층(110)을 식각하는 경우, 산화물반도체 박막층(106) [0073]의 특성이 열화되지 않도록 산소 플라즈마의 조건을 최적화하여야 한다. 일반적으로 산화물반도체 박막층(106)은 플라즈마 처리에 의해 표면 및 박막 내부의 특성이 상당히 변경될 가능성을 가지고 있다. 물론, 유기강유전체 박막층(110)의 식각 공정시 보조 절연막층(108)이 산화물반도체 박막층(106)의 보호막으로서 역할을수행하기는 하지만, 산화물반도체 박막층(106)의 특성이 열화되지 않도록 산소 플라즈마 조건을 최적화할 필요가 있다.두 번째, 식각 마스크로 이용한 포토 레지스트 패턴의 박리 공정시 유기 강유전체 박막층(110)의 특성에 영향 [0074]을 미치지 않는 박리액을 선택해야 한다. 일반적으로 사용되는 포토 레지스트 패턴의 박리를 위한 화학 약품들은 자칫 유기 강유전체 박막층(110)의 특성에 치명적인 영향을 미칠 수 있기 때문에, 박리액의 선택에 충분한 주의를 기울여야 한다. 더구나, 포토레지스트 패턴의 제거 공정에서는 일반 습식 식각과 달리 진공 중에서플라즈마를 사용하는 일종의 건식 식각 공정을 채용하고 있기 때문에, 포토 레지스트 패턴의 경화 정도가 더욱 심하여 적절하지 않은 조건의 박리 과정에서는 포토 레지스트 패턴이 유기 강유전체 박막층(110) 상부에일부 잔류할 수도 있다.이 공정에서 적용 가능한 박리액이 가져야 할 특성은 다음과 같다. 첫 번째 특성은, 박리액의 구성 성분이 유 [0075]기 강유전체 박막층(110)에 화학적인 영향을 주지 않아야 한다. 예를 들어, P(VDF-TrFE)로 형성된 유기 강유전체 박막의 경우, 박리액의 구성 성분이 P(VDF-TrFE)를 화학적으로 해체하여 박막의 제거를 야기해서는 안되며, P(VDF-TrFE)이 제거되지는 않는다고 하더라도, P(VDF-TrFE)의 결정 상태 또는 화학적인 결합 상태를 크게변화시켜, P(VDF-TrFE)의 전기적 특성에 심각한 변화를 초래해서는 안된다. 예를 들어, 포토 레지스트 패턴의박리를 위해 일반적으로 적용되는 유기 약품의 하나인 아세톤(Acetone)의 경우, P(VDF-TrFE)를 완전히 용해시켜 제거하는 작용을 가지기 때문에, 본 발명에서 제공하는 제조 방법에서 아세톤을 박리액으로 사용하는 것은불가능하다. 두 번째 특성은, 해당 박리액이 포토 레지스트 패턴의 잔류 성분을 완전하게 제거할 수 있어야한다. 만약, 해당 박리액이 포토 레지스트 패턴의 잔류 성분을 충분히 효과적으로 제거할 수 없는 경우, 포토레지스트 패턴의 잔류 성분은 본 발명의 소자가 형성되어 있는 기판의 일부에 계속 잔류하여, 본 발명의 소자가 정상적으로 동작하는 것을 방해하는 요인으로 작용할 가능성이 있다. 예를 들어, 포토 레지스트 패턴의 박리를 위해 메탄올을 주성분으로 하는 유기 약품을 사용할 수는 있으나, 사용한 포토 레지스트 패턴의 종류 및선행 공정의 효과에 따라서는 메탄올(methanol)을 이용하여 포토 레지스트의 잔류물을 완전히 제거할 수없다.여기서 소오스 및 드레인 전극패드(116a, 116b)는 금속 전극층 또는 전도성 산화물 박막층으로 형성할 수 있 [0076]다. 소오스 및 드레인 전극패드(116a, 116b)는 유기 강유전체 박막층(110) 상부에서 상부 게이트전극층(114)과 같은 평면 상에서 동일한 일괄 공정에 의해 형성되는 것이 바람직하다. 따라서 소오스 및 드레인 전극패드(116a, 116b)는 상부 게이트전극층(114)과 동일한 소재로 형성될 수 있다.도 2는 본 발명의 제2 실시예에 따른 멤리스터 트랜지스터의 단면도이다. [0077]공개특허 10-2012-0068598-11-도 2에서 도시된 바와 같이, 본 발명에 따른 멤리스터 트랜지스터는 기판(200) 상에 형성된 기판 베리어 절연 [0078]막층(202), 산화물반도체 박막층(204), 보호 절연막층(206), 소오스 및 드레인 전극층(208a, 208b), 유기 강유전체 박막층(210), 상부 게이트전극층(214)을 포함한다. 또한 기판 베리어 절연막층(202) 상부에 소정의 간격으로 형성된 소오스 및 드레인 전극층(208a, 208b)과 상부 게이트전극층(214)에 각각 연결된 복수의 컨택비아홀(212) 및 복수의 컨택 비아홀(212)를 통해 소오스 및 드레인 전극층(208a, 208b)과 상부 게이트전극층(214)에 각각 연결된 소오스 및 드레인 전극패드(216a, 216b)와 게이트 전극패드(미도시)를 더 포함한다.도 2에서 도시한 제2 실시예에 따른 멤리스터 트랜지스터의 구조가 도 1에서 도시한 제1 실시예에 따른 멤리 [0079]스터 트랜지스터의 구조와 상이한 점은 다음과 같다.산화물반도체 박막층(204)은 기판 베리어 절연막층(202) 상부에 형성되며, 소오스 및 드레인 전극층(208a, [0080]208b)은 산화물반도체 박막층(204)의 측벽 및 상부의 일부를 덮도록 형성된다. 또한 산화물반도체 박막층(204) 상에 형성되는 보호 절연막층(206)을 더 포함한다. 결과적으로 산화물반도체 박막층(204)과 보호 절연막층(206)이 메모리 박막 트랜지스터의 채널 영역에 형성되는 되는 점은 제1 실시예를 통해 제공되는 소자의구조와 동일하나, 산화물반도체 박막층(204)과 소오스 및 드레인 전극층(208a, 208b)의 위치관계가 상이하다.게이트전극층이 게이트 절연막 상부에 형성되는 구조를 통상적으로 탑게이트 구조라고 하는데, 상기 탑게이트구조의 박막 트랜지스터에서 상기 제1 실시예에 따른 구조를 탑게이트-버텀컨택이라고 하고, 상기 제2 실시예에 따른 구조를 탑게이트-탑컨택 구조라고 한다.도 2에 도시한 바와 같이, 제2 실시예에 따른 멤리스터 트랜지스터의 구조에 있어서, 보호 절연막층(206)은 [0081]도 1의 제1 실시예를 참조하여 설명한 상기 보호 절연막층(108)의 역할과 함께 다음과 같은 역할을 더 기대할수 있다.소오스 및 드레인 전극층(208a, 208b)은 산화물반도체 박막층(204) 이후에 형성되기 때문에, 습식 또는 건식 [0082]식각 공정을 이용하여 소오스 및 드레인 전극층(208a, 208b)의 패터닝 공정 수행시, 산화물반도체 박막층(204)에 작용할 수 있는 공정 열화 현상을 효과적으로 방지하여, 산화물반도체 박막층(204)의 소재 특성이 열화되는 것을 막을 수 있다. 따라서, 보호 절연막층(206)은 제2 실시예에 따른 소자 구조에 있어서, 소오스 및드레인 전극층(208a, 208b) 식각을 위한 식각 제어층의 역할을 동시에 수행할 수 있다. 이와 같은 상기 보호절연막층(206)의 역할을 고려할 때, 보호 절연막층(206)은 첫째, 소오스 및 드레인 전극층(208a, 208b)의 식각 공정에 있어서 산화물반도체 박막층(204)의 공정 열화 현상을 충분히 억제할 수 있고, 둘째, 상하 구성층간의 식각 선택성을 충분히 확보할 수 있는 물질로 형성되는 것이 바람직하다.도 2에서 도시한 본 발명의 제2 실시예에 따른 멤리스터 트랜지스터의 구성 요소 및 제조 방법은, 도 1에서 [0083]도시한 본 발명의 제1 실시예에 따른 멤리스터 트랜지스터의 구성 요소 및 제조 방법과 동일하므로 중복 설명은 생략한다.도 3은 본 발명의 제3 실시예에 따른 멤리스터 트랜지스터의 단면도이다. [0084]도 3에서 도시된 바와 같이, 본 발명에 따른 멤리스터 트랜지스터는 기판(300) 상에 형성된 기판 베리어 절연 [0085]막층(302), 하부 게이트전극층(304), 유기 강유전체 박막층(306), 산화물반도체 박막층(310), 보호 절연막층(312)을 포함한다. 그리고 상기 유기 강유전체 박막층(306) 상부에 소정의 간격으로 형성된 소오스 및 드레인전극층(308a, 308b)을 포함한다. 그리고 소오스 및 드레인 전극 패드(미도시)와 하부 게이트전극층(304)과 게이트 전극 패드(미도시)를 연결하는 복수의 컨택 비아홀(미도시)을 더 포함한다. 비록, 도면에는 도시되지 않았지만, 상기 보호 절연막층(312) 상부에 소자 전면을 보호하는 제2 보호 절연막층(미도시)을 더 포함할 수있다.도 3에 도시한 제3 실시예에 따른 멤리스터 트랜지스터의 구조가 도 1에 도시한 제1 실시예에 따른 멤리스터 [0086]트랜지스터의 구조와 상이한 점은 게이트 전극을 기판(300) 상부에 먼저 형성하는 버텀게이트의 구조를 가진다는 점이다. 반면 산화물반도체 박막층(310)은 소오스 및 드레인 전극층(308a, 308b)이 형성된 이후, 버텀컨택의 형태로 채널층을 형성한다는 점에서는 도 1에서 도시한 제1 실시예에 따른 트랜지스터의 구조와 동일하다. 도 3에서 도시한 버텀게이트-버텀컨택 구조를 가지는 본 발명의 멤리스터 트랜지스터의 구조에서는 유기 강유 [0087]전체 박막층(306)이 산화물반도체 박막층(310)에 비해 먼저 형성되는 것을 특징으로 한다. 따라서 상기 소자의 제조 과정에서는 다음과 같은 점을 고려해야 한다. 첫 번째, 산화물반도체 박막층(310) 및 보호 절연막층(312)의 증착 방법과 공정온도를 하부의 유기 강유전체 [0088]공개특허 10-2012-0068598-12-박막층(306)에 손상을 주지 않도록 결정해야 한다. 보다 구체적으로는 산화물반도체 박막층(310) 및 보호 절연막층(312)의 증착 과정에서는 플라즈마를 사용하지 않는 증착 방법을 채용하는 것이 바람직하며, 그 이유는앞서 설명한 바와 같다. 또한 산화물반도체 박막층(310) 및 보호 절연막층(312)의 공정온도는 150℃ 이하로억제해야 한다. 왜냐하면, 통상적으로 사용하는 대표적인 유기 강유전체 소재인 P(VDF-TrFE)의 경우, 소재의녹는점이 약 155℃ 부근으로 그 이상의 온도를 경험하는 경우에는 소정의 전기적인 특성을 확보하지 못할 가능성이 있기 때문이다. 이러한 공정온도의 제한조건은 사용하는 플라스틱 기판의 내열성에 의해서도 제한되지만, 만약 내열성이 보다 뛰어난 플라스틱 기판을 기판 소재로 사용한다고 하더라도, 도 3에서 도시하는 버텀게이트 구조의 멤리스터 트랜지스터의 경우에는 공정온도가 150℃로 제한된다는 점에 주목해야 한다. 두 번째, 산화물반도체 박막층(310)이 형성된 이후, 본 발명의 멤리스터 트랜지스터 소자의 동작을 향상시키 [0089]기 위해 실시할 수 있는 후속 열처리 공정의 공정온도 역시 150℃ 이하로 억제해야 한다. 이때, 후속 열처리공정에서 필요한 온도 조건은 사용하는 산화물반도체 박막층(310)의 소재 조성에 크게 의존하기 때문에, 저온의 후속 열처리 공정을 통해서도 양호한 반도체 채널 특성을 확보할 수 있도록 산화물반도체 박막층(310)의소재 조성을 결정하는 것이 바람직하다. 세 번째, 보호 절연막층(312)을 제외하면 산화물반도체 박막층(310)이 가장 최종적으로 형성되고, 외기와 가 [0090]까운 상태로 노출되기 때문에, 상기 보호 절연막층(312)은 앞서 설명한 효과 이외에도 외기로부터 산화물반도체 박막층을 보호하는 역할을 추가적으로 담당한다는 점을 고려해야 한다.이상과 같이 설명한 사항을 제외하면, 도 3에서 도시한 본 발명의 제3 실시예에 따른 멤리스터 트랜지스터의 [0091]구성 요소 및 제조 방법은, 도 1에서 도시한 본 발명의 제1 실시예에 따른 멤리스터 트랜지스터의 구성 요소및 제조 방법과 동일하므로 중복 설명은 생략한다.도 4는 본 발명의 제4 실시예에 따른 멤리스터 트랜지스터의 단면도이다. [0092]도 4에서 도시된 바와 같이, 본 발명에 따른 멤리스터 트랜지스터는 기판(400) 상에 형성된 기판 베리어 절연 [0093]막층(402), 하부 게이트전극층(404), 유기 강유전체 박막층(406), 산화물반도체 박막층(410), 보호 절연막층(412)을 포함한다. 그리고 상기 유기 강유전체 박막층(406) 상부에 소정의 간격으로 형성된 소오스 및 드레인전극층(408a, 408b)을 포함한다. 그리고 소오스 및 드레인 전극 패드(미도시)와 하부 게이트전극층(404)과 게이트 전극 패드(미도시)를 연결하는 복수의 컨택 비아홀(미도시)을 더 포함한다. 비록, 도면에는 도시되지 않았지만, 상기 보호 절연막층(412) 상부에 소자 전면을 보호하는 제2 보호 절연막층(미도시)을 더 포함할 수있다.도 4에 도시한 제4 실시예에 따른 멤리스터 트랜지스터의 구조가 도 3에 도시한 제3 실시예에 따른 멤리스터 [0094]트랜지스터의 구조와 상이한 점은 소오스 및 드레인 전극층(408a, 408b)을 산화물반도체 박막층(410) 및 보호절연막층(412)이 형성된 이후에 형성한다는 점이다. 즉, 버텀게이트-탑컨택의 구조를 가진다.상기 버텀게이트-탑컨택 구조의 본 발명의 멤리스터 트랜지스터는 앞서 설명한 제3 실시예의 버텀게이트-버텀 [0095]컨택의 소자 구조와 제2 실시예의 탑게이트-탑컨택의 소자 구조의 특징을 일부 겸하여 가지고 있는 구조이므로, 각 구조의 제공을 통해 고려해야 할 기술적인 사항에 대한 중복 설명을 생략한다. 또한 구조의 상이함으로 인해 고려해야 할 사항을 제외하면, 도 1에서 도시하여 설명한 본 발명의 제1 실시예에 따른 멤리스터 트랜지스터의 구성 요소 및 제조 방법과 동일하므로 중복 설명은 생략한다.본 명세서에 기술된 제1 내지 제4 실시예에 따른 멤리스터 트랜지스터의 제조 방법은 그 일례로 제시된 것이 [0096]며, 본 발명이 이에 한정된 것은 아니다. 이 밖에도 응용하고자 하는 전체 시스템의 구조 및 그 요구 공정에따라 구체적인 소자 구조 및 공정 조건은 가장 적절한 형태로 선택될 수 있다.도 5a 내지 도 5c는 본 발명에 따른 멤리스터 트랜지스터가 메모리 기능과 적응학습 기능을 발현하는 동작 원 [0097]리를 설명하는 모식도이다. 편의상, 도 5의 설명에서는 모식적으로 나타낸 탑게이트 트랜지스터 소자 구조를이용하여 본 발명의 멤리스터 트랜지스터의 동작 원리를 설명하고 있으나, 이 동작 원리는 도 1 내지 도 4를참조하여 설명한 본 발명의 제1 내지 제4 실시예에 따른 멤리스터 트랜지스터에 공통적으로 적용된다.도 5a를 참조하면, 본 발명에 따른 멤리스터 트랜지스터에서 게이트 절연막의 역할을 하는 유기 강유전체 박 [0098]막층(506)의 강유전 자발분극(Ferroelectric Spontaneous Polarization)이 멤리스터 트랜지스터의 채널 방향을 향해 완전히 정렬된 상태(Full Polarization)를 나타낸다. 이 상태를 만들기 위해서는 탑게이트 트랜지스터의 경우, 상부 게이트전극층(510)에 플러스 전압을 인가할 필요가 있다.상부 게이트전극층(510)에 플러스 전압을 인가한 후에는 전압의 인가를 차단하더라도 유기 강유전체 박막층 [0099]공개특허 10-2012-0068598-13-(506) 내부에 채널 방향을 향해 완전히 정렬된 강유전 자발분극은 비휘발(Nonvolatile)의 상태로 보존된다.한편, 통상적으로 박막 트랜지스터의 제조에 사용하는 산화물반도체 박막층이 n형이라고 가정하면, 상기 상태에서 산화물반도체 박막층(504) 채널 표면에 캐리어 전자(Electron)가 다량 발생하여, 멤리스터 트랜지스터의소오스 전극층(502a)와 드레인 전극층(502b) 사이로 많은 양의 전류가 흐르게 되고, 멤리스터 트랜지스터는온(ON) 상태가 된다. 도 5b를 참조하면, 상기 유기 강유전체 박막층(506)의 강유전 자발분극이 멤리스터 트랜지스터의 채널 반대 [0100]방향을 향해 완전히 정렬된 상태를 나타낸다. 이 상태를 만들기 위해서는 탑게이트 트랜지스터의 경우 상부게이트전극층(510)에 마이너스 전압을 인가할 필요가 있다. 상부 게이트전극층(510)에 플러스 전압을 인가한후에는 전압의 인가를 차단하더라도 유기 강유전체 박막층(506) 내부에 채널 반대 방향을 향해 완전히 정렬된강유전 자발분극은 비휘발의 상태로 보존된다. 상기 상태에서는 산화물반도체 박막층(504) 채널 표면에 캐리어 전자가 거의 발생하지 않아, 멤리스터 트랜지스터의 소오스 전극층(502a)과 드레인 전극층(502b) 사이에는거의 전류가 흐르지 않게 되고, 멤리스터 트랜지스터는 오프(OFF) 상태가 된다.상기 도 5a 내지 5b를 참조하여 설명한 두 가지 상태를 이용하면, 저저항의 온 상태와 고저항의 오프 상태를 [0101]구현할 수 있으며, 이를 데이터 0과 데이터 1에 대응시키면 디지털 정보를 저장하는 유연 멤리스터 소자를 플라스틱 기판 위에 제공할 수 있다.도 5c를 참조하면, 상기 유기 강유전체 박막층(506)의 강유전 자발분극이 박막 내부에서 부분적으로 정렬된 [0102]상태(Partial Polarization)를 모식적으로 나타낸다. 실제로는 박막 내부에서 분극들이 무질서한 방향으로 정렬되어 있으며, 이를 실효적으로 계산하여 아래 방향을 향하는 분극의 개수와 위 방향을 향하고 있는 분극의개수로 환산하여 표시하면 도 5c에 도시한 바와 같이 표시할 수 있다. 이 상태를 만들기 위해서는 몇 가지 계획된 전압 인가 조건을 설계할 필요가 있으며, 구체적인 방법에 대해서는 도 6을 참조하여 구체적으로 설명하기로 한다. 한편, 상기 상태에서는 산화물반도체 박막층(504) 채널 표면에 발생하는 캐리어 전자의 양이, 유기 강유전체 박막층(506) 내부에서 실효적으로 채널 방향을 향하고 있는 분극의 개수와 소정의 함수 관계를가지며, 그 결과 분극의 상태에 따라 서로 다른 양의 캐리어 전자가 발생할 것을 기대할 수 있다. 따라서 멤리스터 트랜지스터의 소오스 전극층(502a)과 드레인 전극층(502b) 사이에는 도 5a에서 참조한 멤리스터 트랜지스터의 온 상태와 도 5b에서 참조한 멤리스터 트랜지스터의 오프 상태의 중간값의 전류가 흐르게 된다. 따라서, 멤리스터 트랜지스터에 중간 상태의 전류값을 설정할 수 있고, 아울러 이를 누적하여 증폭하거나 감소시킬 수 있다면, 본 발명의 멤리스터 트랜지스터를 이용하여 적응학습 기능을 구현할 수 있다.도 6a 내지 도 6d는 본 발명에 따른 멤리스터 트랜지스터의 적응학습 기능을 구현하기 위한 전압의 인가 조건 [0103]및 전압 인가에 따른 강유전 자발분극과 트랜지스터 드레인 전류의 상관관계를 모식적으로 나타낸 도면이다. 도 6a를 참조하면, 본 발명에 따른 멤리스터 트랜지스터의 유기 강유전체 박막층에 전압을 인가하여 도 5c에 [0104]도시된 바와 같이 유기 강유전체 박막층의 강유전 자발분극의 상태를 부분적으로 정렬된 상태로 만들기 위한전압 펄스의 일례를 나타낸다. 이 예에서는 동일한 크기와 폭을 갖는 전압 펄스의 주파수를 조절하면, 일정시간 동안 인가되는 전압 펄스의 회수를 조절할 수 있다. 이러한 인가 방법을 주파수 변조 방식(PulseFrequency Modulation; PFM)이라고 한다. 이 방법에서는, 인가 전압의 크기가 유기 강유전체 박막층의 분극이반전하여 일정 방향으로 정렬하기에 충분히 큰 값이고, 인가 전압의 폭이 유기 강유전체 박막층의 분극이 반전하는 데 걸리는 시간보다 충분히 짧은 값으로 설정하는 것이 중요하다.도 6b를 참조하면, 유기 강유전체 박막층의 강유전 분극량 또는 멤리스터 트랜지스터의 드레인 전류는 인가 [0105]전압 펄스의 회수가 증가함에 따라 소정의 함수 관계에 따라 증가하다가 강유전 자발분극이 완전히 정렬되는상태에 근접해 갈수록 포화하는 경향을 가진다. 따라서, 본 발명에 따른 멤리스터 트랜지스터에서 부분적으로정렬된 강유전 자발분극을 통해 임의의 채널 저항을 가지는 트랜지스터 소자를 구현하기 위해서는 일정 주파수를 가지는 인가 전압 펄스를 시간을 달리하여 정해진 시간 동안 인가하거나, 일정 시간 동안 서로 다른 주파수를 가지는 전압 펄스를 인가하면, 서로 다른 채널 저항값을 가지는 멤리스터 트랜지스터를 얻을 수 있다.가령, 도 6a에서 PFM1이라고 표시된 비교적 저주파의 전압 펄스를 유기 강유전체 박막층에 일정 시간 인가한경우에는 멤리스터 트랜지스터가 도 6b에서 PFM1이라고 표시된 드레인 전류값을 나타내며, PFM2라고 표시된비교적 고주파의 전압 펄스를 유기 강유전체 박막층에 일정 시간 인가한 경우에는 PFM2라고 표시된 드레인 전류값을 나타내게 된다. 또한 동일 멤리스터 트랜지스터에 일정한 주파수의 전압 펄스를 연속적으로 인가하면,인가된 전압 펄스의 회수에 따라 트랜지스터의 채널 저항값을 실시간으로 연속 변경하는 것이 가능하다. 아울러 도 6a에는 도시되지 않았으나, 반대 극성을 가지는 전압 펄스를 같은 방식으로 인가함으로써 전압 펄스 인가 회수에 따른 강유전 자발분극량이나 멤리스터 트랜지스터의 드레인 전류의 증감 방향을 반대로 변경할 수공개특허 10-2012-0068598-14-있다.이러한 기능을 이용하여 빈번히 접근된 소자의 저항값을 낮출 수 있고, 드물게 접근한 소자의 저항값을 높일 [0106]수 있다. 또한 자극 신호의 반복에 의해 소자의 저항값을 낮출 수 있고, 억제 신호의 반복에 의해 소자의 저항값을 높일 수 있다. 이러한 기능이 본 발명에 따른 멤리스터 트랜지스터가 갖는 적응학습 기능이다.도 6c를 참조하면, 본 발명에 따른 멤리스터 트랜지스터의 유기 강유전체 박막층에 전압을 인가하여, 도 5c에 [0107]도시된 바와 같이 유기 강유전체 박막층의 강유전 자발분극의 상태를 부분적으로 정렬된 상태로 만들기 위한전압 펄스의 다른 일례를 나타낸다. 이 예에서는 동일한 크기와 주파수를 갖는 전압 펄스의 펄스 폭을 조절하면, 정해진 회수만큼 인가되는 전압 펄스의 인가 시간을 조절할 수 있다. 이러한 인가 방법을 폭 변조 방식(Pulse Width Modulation; PWM)이라고 한다. 이 방법에서도 역시 인가 전압의 크기가 유기 강유전체 박막층의분극이 반전하여 일정 방향으로 정렬하기에 충분히 큰 값이고, 인가 전압의 폭이 유기 강유전체 박막층의 분극이 반전하는 데 걸리는 시간보다 충분히 짧은 값으로 설정하는 것이 중요하다.도 6d를 참조하면, 유기 강유전체 박막층의 강유전 분극량 또는 멤리스터 트랜지스터의 드레인 전류는 소정의 [0108]함수 관계에 의해 인가 전압의 폭 증가에 따른 총 인가 시간이 증가함에 따라 증가하다가 강유전 자발분극이완전히 정렬되는 상태에 근접해 갈수록 포화하는 경향을 가진다. 따라서, 본 발명에 따른 멤리스터 트랜지스터에 일정 주파수를 가지는 인가 전압 펄스를 펄스 폭을 달리하여 정해진 시간 동안 인가하면, 서로 다른 채널 저항값을 가지는 멤리스터 트랜지스터를 얻을 수 있다. 가령, 도 6c에서 PWM1이라고 표시된 비교적 짧은폭의 전압 펄스를 일정 시간 인가한 경우에는 멤리스터 트랜지스터가 도 6d에서 PWM1이라고 표시된 드레인 전류값을 나타내며, PWM2라고 표시된 비교적 긴 폭의 전압 펄스를 일정 시간 인가한 경우에는 PWM2라고 표시된드레인 전류값을 나타내게 된다. 아울러 도 6c에는 도시되지 않았으나, 반대 극성을 가지는 전압 펄스를 같은방식으로 인가함으로써 전압 펄스 폭에 따른 강유전 자발분극량이나 멤리스터 트랜지스터의 드레인 전류의 증감 방향을 반대로 변경할 수 있다.도 6a 내지 6b를 통해 설명한 PFM 방식과 도 6c 내지 6d를 통해 설명한 PWM 방식을 비교하면 다음과 같다. [0109]첫 번째, 통상적으로 집적회로를 구성하는 경우, 일정한 폭을 가지는 전압 신호를 입력 신호로 사용한다는 점 [0110]을 가정하면, 전체 시스템의 회로 구성을 간략히 하기 위해서는 PFM방식을 적용하는 것이 유리하다. 두 번째, 전압 펄스의 연속적인 인가를 통해 멤리스터 트랜지스터의 채널 저항 특성을 일정한 신호 인가 시간 [0111]동안 연속적으로 변경하기 위해서는 주파수만을 변경하여 인가 신호의 회수를 변경할 수 있는 PFM 방식을 적용하는 것이 유리하다. 세 번째, 본 발명의 동작 원리로부터 구현되는 멤리스터 트랜지스터의 경우, 전압 펄스의 폭이 유기 강유전체 [0112]박막층의 강유전 자발분극의 분극 시간보다 충분히 짧아야 한다는 점을 고려하면, 보다 세밀한 범위에서 채널저항값을 조절하기 위해서는 전압 펄스의 펄스 폭을 변경해야 하는 PWM 방식보다 가능한 범위에서 짧은 폭의전압 펄스를 인가할 수 있는 PFM 방식을 적용하는 것이 보다 유리하다. 도 6a 및 도 6c에는 도시되지 않았으나, 인가 전압의 펄스 회수나 펄스 폭을 변경하지 않고 인가 전압의 진폭 [0113]을 변경하여 부분 분극반전을 실현할 수 있다. 하지만, 이미 구성된 회로 시스템 내부에서 전압 펄스의 진폭을 변경하기 위해서는 회로 구성이 매우 복잡해질 뿐만 아니라, 실제 신경회로 시스템을 구성하는 데 있어서매우 복잡한 설계문제를 해결해야 할 것으로 예상된다. 따라서 본 발명에서는 인가 전압의 진폭을 변경하여본 발명에 따른 멤리스터 트랜지스터에서 적응학습 기능을 구현하는 예에 대해서는 자세히 설명하지 않기로한다.본 발명에 따른 산화물반도체 박막층과 유기 강유전체 박막층을 각각 반도체 채널층과 게이트 절연막층으로 [0114]이용하는 멤리스터 트랜지스터의 장점을 지금까지 제안된 다른 동작 원리를 이용하여 적응학습 기능을 구현하는 멤리스터 트랜지스터와 비교하여 설명하면 다음과 같다. 첫 번째, 본 발명의 멤리스터 트랜지스터는 산화물반도체 박막층을 채널로 사용하는 트랜지스터 구조를 가지 [0115]고 있기 때문에 매우 우수한 온오프 특성을 확보할 수 있다. 통상적으로 양호하게 제작된 산화물반도체 기반의 박막 트랜지스터의 온오프 비는 107~108에 달하며, 유기 강유전체 박막층과의 조합을 통해 메모리 트랜지스터로 이용하는 경우에도 상기 온오프비를 적용할 수 있다. 더구나, 본 발명에 따른 멤리스터 트랜지스터는 온과 오프 사이의 중간 상태를 아날로그적으로 사용하는 것을 특징으로 하기 때문에 가능한 큰 범위의 온오프마진을 확보하는 것이 절대적으로 바람직하다. 반면, 유연 기판 위에 제작되는 유기물 기반의 일반 메모리 소공개특허 10-2012-0068598-15-자의 경우에는 온오프 마진이 수백 정도에 그치고 있어, 안정된 중간 상태를 확보하는 것은 매우 어렵다.두 번째, 본 발명의 멤리스터 트랜지스터는 강유전체 박막층의 강유전 자발분극량에서 기인하는 정확한 동작 [0116]을 이용하기 때문에, 소자의 동작을 예측하여 전체 회로나 시스템을 설계하는 데 유리한 조건을 제공한다. 이에 비해 산화환원, 원소의 확산과 같은 화학적인 반응을 이용하는 기존의 멤리스터 트랜지스터의 경우에는 인가 신호의 누적에 따른 소자 특성의 변화를 정확히 예측하기 어렵다. 또한 가장 통상적인 멤리스터 트랜지스터에 사용되고 있는 이원계 산화물 기반 소재의 경우, 그 동작원리조차 아직 완전히 규명되지 않아 소자의 동작 안정성을 담보하는 데 결정적인 문제를 안고 있다.세 번째, 본 발명에 따른 멤리스터 트랜지스터의 제조를 위해 제공되는 제조 방법은 모두 150℃ 이하의 저온 [0117]에서 실시하는 것이 가능하기 때문에, 통상적으로 내열 특성이 떨어지는 유연 플라스틱 기판 상에 소자를 적용하는 데 공정상의 장점을 제공한다. 강유전체 박막층의 전계효과를 이용하는 멤리스터 트랜지스터는 이전에도 제안된 바가 있으나, 통상적으로 산화물 형태의 소재를 사용하기 때문에 증착 공정 및 박막의 결정화 공정에 있어서 고온의 열처리를 수반하는 문제를 가지고 있다.도 7은 산화물반도체 박막층과 유기 강유전체 박막층을 각각 반도체 채널층과 게이트 절연막층으로 이용하여 [0118]제작한 박막 트랜지스터 소자의 드레인 전류값과 메모리 온오프비가 프로그램 동작을 위해 인가한 전압 펄스폭의 변화에 따라 변화하는 경향을 나타낸 그래프이다.도 7에서 도시한 결과는, 본 발명에 따른 멤리스터 트랜지스터의 적응학습기능의 구현 가능성을 보여주기 위 [0119]하여 제공되는 것으로, 실제 플라스틱 기판 위에 제작한 소자에서 얻어진 결과는 아니다. 상기 소자는 유리기판 위에 제작되었으며, 산화물반도체 박막층은 10nm의 In-Ga-Zn-O, 유기 강유전체 박막층은 150nm의 P(VDF-TrFE) 박막을 사용하였다. 보호 절연막층으로는 4nm의 Al2O3를 사용하였으며, 소자의 구조는 도 1에서 도시한탑게이트-버텀컨택 구조의 소자이다. 유리 기판 위에 제작되었다는 점을 제외하면 소자의 구성 소재나 제조방법이 본 발명에서 제안된 바와 대부분 동일하여, 이 소자를 사용하여 본 발명의 멤리스터 트랜지스터의 적응학습 기능 가능성을 검증하는 것은 충분히 유효하다고 판단할 수 있다. 도 7을 참조하면, 상기 박막 트랜지스터의 프로그램 드레인 전류는 온 상태를 구현하기 위해 인가되는 프로그 [0120]램 전압 펄스 폭이 증가할수록 증가하는 경향을 나타내며, 오프 상태를 구현하기 위해 인가되는 프로그램 전압 펄스 폭이 증가할수록 감소하는 경향을 나타내고 있다. 즉, 도 6a 내지 도 6d에서 도시한 바와 같이 PFM또는 PWM 방식의 전압 펄스 인가 방법을 변경함에 따라 온 상태와 오프 상태의 채널 저항값을 임의로 결정하거나, 연속적으로 변화시키는 것이 가능하다는 것을 확인할 수 있는 결과이다. 결과적으로 인가되는 프로그램전압 펄스 폭을 100밀리초에서 1초까지 변화시켰을 때 메모리 온오프 마진의 비가 약 3부터 400까지 변화하는것을 알 수 있다. 여기서 주목해야 할 점은 현재 최대의 메모리 온오프 마진을 얻기 위해 필요한 프로그램 전압 펄스 폭이 1초로 매우 긴 편이기 때문에, 약 10밀리초 정도의 짧은 전압 펄스를 연속적으로 인가한다면,본 발명에 따른 멤리스터 트랜지스터의 동작에서 다양한 중간 상태의 채널 저항값을 실현할 수 있을 것으로기대된다.도 8은 본 발명의 제1 실시예에 따른 멤리스터 트랜지스터의 게이트 전압 및 드레인 전류 특성을 나타내는 그 [0121]래프이다.도 8에 도시된 측정 결과를 나타내는 멤리스터 트랜지스터 소자는 도 1을 참조하여 설명한 제1 실시예에 따라 [0122]제조되었으며, 탑게이트-버텀컨택의 구조를 가지고 있다. 상기 소자의 실시예에서 제공된 구체적인 제조 방법을 도 1을 참조하여 설명하면 다음과 같다.기판(100)은 폴리에틸렌나프탈레이트(PEN) 기판을 사용하였고, 기판 베리어절연막층(102)는 원자층증착법으로 [0123]형성된 약 20nm 두께의 알루미늄 산화막(Al2O3)을 사용하였다. 소오스 및 드레인 전극층(104a, 104b)은 적층구조의 Ti/Au/Ti 박막을 사용하였다. 산화물반도체 박막층(106)은 아연 산화물(ZnO) 박막을 스퍼터링 방법으로 150℃의 온도에서 형성하였으며, 막 두께는 10nm이다. 보호 절연막층(108)은 원자층증착법으로 150℃의 온도에서 형성된 6nm 두께의 알루미늄 산화막 (Al2O3)를 사용하였다. 유기 강유전체 박막층(110)은 100nm 두께의P(VDF-TrFE) 박막을 사용하였다. 상기 박막은 스핀코팅 방법을 적용하여 형성되었으며, 결정화 열처리 온도는140℃이다. 상기 유기 강유전체 박막층(110)을 식각하여 복수의 컨택 비아홀(112)을 형성하는 식각 공정은 포토레지스트를 식각 마스크로 이용하는 산소 플라즈마 식각 방법으로 수행되었다. 소오스 및 드레인 전극 패드(116a, 116b), 게이트 전극패드(미도시), 상부 게이트 전극층(114)은 Au 박막을 사용하였다.공개특허 10-2012-0068598-16-도 8을 참조하면, 유연한 PEN 플라스틱 기판 위에 제작한 멤리스터 트랜지스터는 드레인 전류(ID)의 전달특성 [0124]에서, 게이트 전압(VG)이 인가됨에 따라 강유전체 게이트 절연막의 전계효과에서 기인하는 반 시계방향의 히스테리시스가 관측되는 것을 확인할 수 있다. 이 결과로부터 본 발명에 따른 멤리스터 트랜지스터가 유연한플라스틱 기판 상에 제조되어, 비휘발성 메모리의 기능을 나타내는 멤리스터 소자로서 기능할 수 있음을 확인할 수 있다.본 발명의 명세서에 개시된 실시예들은 본 발명을 한정하는 것이 아니다. 본 발명의 범위는 아래의 특허청구 [0125]범위에 의해 해석되어야 하며, 그와 균등한 범위 내에 있는 모든 기술도 본 발명의 범위에 포함되는 것으로해석해야 할 것이다.부호의 설명100: 기판 102: 기판 베리어 절연막층 [0126]104a: 소오스 전극층 104b: 드레인 전극층106: 산화물반도체 박막층 108: 보호 절연막층110: 유기 강유전체 박막층 112: 복수의 컨택 비아홀114: 상부 게이트전극층 116a: 소오스 전극패드116b: 드레인 전극패드도면도면1도면2공개특허 10-2012-0068598-17-도면3도면4도면5a도면5b공개특허 10-2012-0068598-18-도면5c도면6a도면6b도면6c공개특허 10-2012-0068598-19-도면6d도면7도면8공개특허 10-2012-0068598-20-"}
{"patent_id": "10-2010-0130290", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 멤리스터 장치 및 그 제조 방법에 관한 것으로서, 기판; 상기 기판 상부에 형성되어, 상기 기판의 구부러짐 동작에서 발생하는 상기 기판의 기계적인 스트레스를 경감시키는 기판 베리어 절연막층; 상기 기판 베리어 절연막층의 일측에 형성된 소오스 전극층; 상기 기판 베리어 절연막층의 타측에 형성된 드레인 전극층; 상기 소오스 전극층과 상기 드레인 전극층 사이의 상기 기판 베리어 절연막층 상부에 형성되어 채널 영역을 형 성하는 산화물반도체 박막층; 상기 산화물반도체 박막층 상부에 형성되어, 상기 산화물반도체 박막층을 보호하 는 보호 절연막층; 상기 소오스 전극층, 상기 드레인 전극층 및 상기 보호 절연막층 상부에 형성되어, 게이트 절연막으로 사용되는 유기 강유전체 박막층; 및 상기 채널 영역의 상부측 유기 강유전체 박막층의 상부에 형성 되는 상부 게이트 전극층을 포함한다."}
{"patent_id": "10-2010-0130290", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 반도체 장치 및 그 제조 방법에 관한 것으로, 더욱 상세하게는 산화물반도체 박막층과 유기 강유전 체 박막층을 각각 박막 트랜지스터의 채널층과 게이트 절연막층으로 사용하는 멤리스터 장치 및 그 제조 방법 에 관한 것이다."}
{"patent_id": "10-2010-0130290", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "기존의 전자산업은 실리콘 소재를 기반으로 한 소재 및 소자 기술, 즉 실리콘 일렉트로닉스의 기술진보를 통 해 발전해왔다. 그러나 실리콘 일렉트로닉스는 물질의 특성상, 단단하고 깨지기 쉬우며, 가시광 영역에서 불 투명하여 특정 어플리케이션 분야에서는 적합하지 않다는 단점이 있다. 이러한 실리콘 일렉트로닉스의 한계점 을 극복하기 위한 방안으로서, 유연성을 갖는 기판 위에 전자 소자 및 전자 시스템을 제조하는 유연 일렉트로 닉스(Flexible Electronics) 개념이 새롭게 제안되고 있다. 또한 현대의 일렉트로닉스 기기는 고성능을 중심 으로 한 첨단 기기 및 부품 분야와, 성능을 다소 희생하더라도 저렴, 경량, 융합기능 등의 분야를 대상으로 하는 차세대 부품 분야로 대별되고 있으며, 이러한 차세대 일렉트로닉스의 패러다임 전환을 적극적으로 지원 하고 있는 기술이 바로 유연 일렉트로닉스 기술이다. 현재 이 분야에서는 센서, 디스플레이, 전자회로 및 전 지 등의 다양한 어플리케이션의 실현을 목표로 연구 개발이 진행 중이다. 한편, 현재 사용되고 있는 모든 전자부품을 구성하는 전자회로는 커패시터, 레지스터 및 인덕터 등 세 가지 유형의 수동부품으로 표현된다. 이 수동부품들은 에너지를 분산시키거나 저장하는 등의 역할을 하며, 능동적 으로 에너지를 생성할 수는 없다. 또한 상기 세 가지 수동요소는 회로 동작을 설명하는 네 가지 기본 변수, 전류, 전압, 전하 및 자속 중 두 개 사이의 간단한 선형적 연결관계로 설명될 수 있다. 이에 대해 1970년대 초반 Leon Chua는 회로의 완벽한 구성을 위해서는 상기 세 가지 수동요소와 함께 네 번째 수동요소가 존재해 야함을 예언하였으며, 이 요소를 멤리스터(Memristor)라고 명명하였다. 멤리스터는 자속과 전하를 연결하는 수동요소이며, 멤리스터를 포함하여 네 개의 수동요소를 이용하면 총 6개의 회로 관련 공식을 완성할 수 있다 고 주장하였다. 이후 약 40년이 지난 2008년 미국 HP의 연구자들은 이미 예언된 멤리스터의 기능이 구현되는 새로운 종류의 전자소자를 제작하고, 드디어 회로의 네 번째 구성요소가 발견되었다고 주장한 바 있다. 멤리스터에 전압을 인가하면, 멤리스터에 흐르는 전류가 시간에 따라 사인곡선의 형태로 나타난다. 이러한 특 성으로부터 멤리스터는 전도성이 강한 온 상태와 전도성이 약한 오프 상태를 가역적으로 이동한다. 따라서 멤 리스터는 비선형적인 레지스터의 역할을 하게 되고, 전압의 시간 축약에 따라 저항이 비선형적으로 변하기 때문에 정보를 저장하는 레지스터의 역할을 할 수 있다. 다시 말하면, 멤리스터 소자는 얼마나 많은 양의 전류 가 멤리스터를 통과했는가를 기억할 수 있는 것이다. 지금까지 보고된 다양한 저항변화형 메모리 소자를 기능 적으로 광의의 멤리스터 소자로 분류할 수 있으며, 좁은 의미로는 자속과 전하의 관계를 만족하는 기능을 가 진 소자를 멤리스터라고 할 수 있다. 기존에 제안된 멤리스터 장치의 예는 다음과 같다. 첫 번째, 금속 산화물로 대표되는 바이너리 산화물 양단에 소정의 전극을 형성하여 이단자 구조의 소자를 구 성하는 예이다. 이때 바이너리 산화물 소재의 종류로서, 대표적인 것으로 티타늄 산화물, 니켈 산화물, 구리 산화물 등을 들 수 있다. 상기 소자에서는 소자 양단에 인가하는 전압의 극성과 크기를 변경함으로써 소자 양 단의 저항 상태를 고저항 상태와 저저항 상태로 바꿀 수 있다. 두 번째, 확산이 용이한 원소와 원소 확산에 필요한 전해질의 두 가지 요소로 구성된 액티브 영역과 이 영역 양단에 소정의 전극을 형성하여 이단자 구조의 소자를 구성하는 예이다. 상기 소자에서는 소자 양단에 인가하 는 전압의 극성과 크기를 변경함으로써 도전성을 갖는 확산종 원소가 전해질 내부에서 도전성 필라멘트를 형 성하여 만드는 저저항 상태와 도전성 필라멘트가 해체되어 만드는 고저항 상태를 구현할 수 있다. 세 번째, 소자를 구성하는 핵심 소재의 산화 환원 반응이나, 외기에 포함된 특수 가스종의 도입에 의해 소재 의 저항 상태가 크게 바뀌는 형태로 제작된 다양한 구조의 소자군이다. 가령, 특정 유기물 박막은 산화환원 반응에 의한 유기물 소재의 구조 변경에 따라 저항 상태가 크게 바뀔 수 있다. 또한 특정 산화물 박막은 수소 의 공급에 따라 전도성이 크게 다른 두 가지 물질로 가역적인 변화를 경험할 수 있다. 앞서 설명한 다양한 구조 및 동작 원리를 가지는 멤리스터 장치의 양호한 성능이 구현된다면 기존의 소자를 대체하여 향상된 성능을 제공하거나, 현재로서는 구현하지 못한 새로운 기능을 갖는 소자 응용 분야를 창출할 수 있을 것으로 기대된다. 첫 번째 응용 분야는 초고밀도 비휘발성 메모리 소자 분야이다. 현재 이 분야에서는 실리콘 기반의 플래시메 모리가 대부분의 시장을 점유하고 있으나, 플래시메모리 자체가 안고 있는 물리적인 한계 때문에 가까운 미래 에 이를 대체할 소자의 등장이 절실하게 요망되고 있는 형편이다. 일부에서는 저항변화형 메모리(Resistive- change Random Access Memory; ReRAM)라는 이름으로 활발하게 연구가 진행 중이다. 상기 분야는 기존의 실리 콘 일렉트로닉스의 연장선 상에서 기존 비휘발성 메모리 기술의 수준을 비약적으로 향상시키는 것이 기술의 목적이라고 할 수 있다. 두 번째 응용 분야는 기존의 논리회로 내부에 메모리 기능을 갖는 소자를 함께 집적하여 논리회로 자체에 비 휘발성을 부여하는 기술 분야이다. 이러한 시도는 기존의 실리콘 기반 집적회로의 소비전력을 줄이기 위한 방 법의 하나로 최근 활발하게 이루어지고 있는데, 빈번하게 사용하지 않는 회로 부위의 정보를 메모리 소자에 임시 저장하고, 이 부위의 전력을 차단함으로써 전체 회로 시스템의 소비전력을 줄이는 것이 기술의 핵심이다. 이 분야에 멤리스터 소자를 활용하기 위해서는 기존 실리콘 기반 소자와의 공정 정합성에 문제가 없어야 한다. 상기 첫 번째 및 두 번째 응용 분야의 특징은 기존 실리콘 기반 일렉트로닉스 회로 및 부품과 밀접한 관련이 있으며, 멤리스터 소자가 제공하는 데이터 저장의 형태가 디지털 정보라는 점이다. 이에 비해 멤리스터가 갖 는 플럭스 누적 기반의 상태 변화 특성을 활용하면 멤리스터 소자가 제공하는 데이터 저장의 형태를 아날로그 적으로 변경하고, 이에 따라 다양한 추가 기능을 기대할 수 있다. 세 번째 응용 분야는 적응학습 기능을 갖는 전자 소자의 응용 분야이다. 이 분야에서는 간단한 소자 구조를 이용하여 빠른 시간의 학습을 통해 소정의 특성을 발현하는 소자를 제공하기 위한 연구가 진행 중이며, 통상 적으로는 실리콘계 CMOS 소자를 이용하여 상기 기능을 구현하기 위한 연구 예가 다수 보고되고 있다. 하지만, 기존의 트랜지스터 소자를 이용하여 적응학습 기능을 구현하기 위해서는 소자의 수가 증가하여 회로의 크기가 너무 커질 뿐만 아니라, 학습 기능을 부여하기 위해 막대한 학습 시간이 필요한 것으로 알려져 있어 그 실효 성에 의문이 제기되고 있다. 반면, 멤리스터의 특성을 이용하면 매우 간단한 방법으로 온과 오프 상태 이외의 다양한 중간 상태를 소자에 부여할 수 있으며, 아울러, 소자의 특성을 연속적으로 변화시키는 것이 가능하다. 이러한 소자가 구현된다면, 기존의 실리콘 일렉트로닉스 컴퓨팅 기술의 비약적인 발전은 물론이고, 사용자 밀 착형 유연 일렉트로닉스용 신규 소자 기술 발전에도 크게 기여할 것으로 기대된다. 네 번째 응용 분야에는 상기 세 번째 응용 분야에서 언급한 멤리스터의 적응학습 기능을 더욱 고도화 시킨 것으로, 멤리스터 소자를 신경망의 시냅스로 사용하고, 소정의 문턱값을 넘어섰을 때 차단의 뉴런에 전기신호를전달하는 신경망 뉴런 회로와 결합하여, 인간의 뇌에서 일어나는 지능형 정보처리 기능을 구현하는 신경회로 망 응용 분야이다. 이 분야의 응용에서 멤리스터 소자는 뉴런과 뉴런을 연결하는 연결고리인 시냅스의 역할을 담당하며, 앞서 설명한 적응학습 기능을 통해 서로 다른 중요도(Weight)을 갖는 시냅스를 실현할 수 있다. 상 기 분야 역시 기존의 실리콘 일렉트로닉스 컴퓨팅 기술의 비약적인 발전은 물론, 유연 일렉트로닉스용 인공지 능 소자 기술 발전을 앞당길 수 있는 핵심 원천 기술이다. 지금까지 멤리스터에서 구현 가능한 적응학습 기능의 실현을 위해 몇 가지 소자 구조와 동작 원리가 제안된 바 있으나, 이를 유연 기판 위에 제작하여 적응학습 기능을 갖는 멤리스터 소자를 실현하기 위해서는 다음과 같은 문제점을 가지고 있다. 첫 번째, 바이너리 산화물을 이용하는 이단자 멤리스터 소자의 경우, 아직까지 동작원리가 명확하지 않고, 산 화물 박막층의 제작 조건이나 사용 전극의 종류에 따라서도 소자의 동작 특성이 불규칙적으로 변동하는 문제 를 가지고 있다. 또한 소정의 조성의 유기물 박막층을 이용하는 멤리스터 소자의 경우, 유기물의 산화환원 반 응이나 외기와의 반응을 통해 변화하는 화학적 반응기구를 동작원리로 이용하기 때문에 소자 특성의 변화량을 정확하게 설계하기 어렵다. 하지만, 온 상태와 오프 상태 이외의 다양한 중간 상태를 각각의 중요도를 가진 적응학습의 단계로 인식하고, 이를 설계하기 위해서는 인가 전압의 변화에 따른 소자 특성의 변동 지표를 정 확하게 정의하고, 그 관계를 설계할 수 있는 동작원리를 채용하는 것이 바람직하다. 두 번째, 유연 기판 위에 제작하여 메모리 기능을 보고하고 있는 일부 유기물 기반 멤리스터 소자의 경우, 온 상태와 오프 상태의 마진이 너무 작다는 문제를 가지고 있다. 멤리스터 소자의 적응학습 기능을 안정적으로 실현하기 위해서는 온 상태와 오프 상태 사이에 안정적으로 구현되는 다양한 중간 상태를 정의할 수 있어야 하기 때문에, 가능한 한 넓은 범위의 온오프 마진을 확보하는 것이 바람직하다. 세 번째, 일부 실리콘 기판을 이용하는 원자스위치나 전계효과 트랜지스터 소자에서 멤리스터의 적응학습 기 능과 유사한 성능에 대해 보고하고 있으나, 이들 소자들은 기본적으로 실리콘 기판 상에서 제작하여 실리콘계 소자들과 집적 사용하는 것을 전제로 하고 있어, 제조 공정이 복잡하거나, 특히 높은 공정온도를 요구한다는 문제를 가지고 있다. 특히, 유연 일렉트로닉스에서 이용하는 통상의 유연 플라스틱 기판은 가장 높은 온도로 서 300℃ 정도의 내열 특성을 가지고 있어, 소자 제조를 위해 적용하는 공정의 온도를 저온에서 수행하는 것 이 바람직하다. 이와 같이 기존의 기술만으로는 멤리스터 장치의 적응학습 기능을 이용하면서, 상기 멤리스터 소자를 유연 기 판 위에 제작하여 차세대 유연 일렉트로닉스의 핵심 소자로서 적용할 수 있는 방법이 마련되어 있지 않다."}
{"patent_id": "10-2010-0130290", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기한 바와 같은 문제점을 해결하기 위하여 안출된 것으로서, 산화물반도체 박막층과 유기 강유전 체 박막층을 각각 박막 트랜지스터의 채널층과 게이트절 연막층으로 사용하는 멤리스터 장치를 제공하는 데 그 목적이 있다. 본 발명의 다른 목적은 저온 공정을 이용하여 유연 기판 상에 제조하는 멤리스터 장치의 제조 방법을 제공한 다."}
{"patent_id": "10-2010-0130290", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이와 같은 목적을 달성하기 위한, 본 발명의 제1 실시예에 따르면, 본 발명에 따른 멤리스터 장치는, 기판; 상기 기판 상부에 형성되어, 상기 기판의 구부러짐 동작에서 발생하는 상기 기판의 기계적인 스트레스를 경감 시키는 기판 베리어 절연막층; 상기 기판 베리어 절연막층의 일측에 형성된 소오스 전극층; 상기 기판 베리어 절연막층의 타측에 형성된 드레인 전극층; 상기 소오스 전극층과 상기 드레인 전극층 사이의 상기 기판 베리 어 절연막층 상부에 형성되어 채널 영역을 형성하는 산화물반도체 박막층; 상기 산화물반도체 박막층 상부에 형성되어, 상기 산화물반도체 박막층을 보호하는 보호 절연막층; 상기 소오스 전극층, 상기 드레인 전극층 및 상기 보호 절연막층 상부에 형성되어, 게이트 절연막으로 사용되는 유기 강유전체 박막층; 및 상기 채널 영역 의 상부측 유기 강유전체 박막층의 상부에 형성되는 상부 게이트 전극층을 포함한다."}
{"patent_id": "10-2010-0130290", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상에서 설명한 바와 같이 본 발명에 의하면, 유연한 플라스틱 기판 상에 적응학습 기능을 갖는 멤리스터 트 랜지스터를 제공함으로써, 전압 신호의 인가 방식을 변경하여 다양한 상태의 채널 저항값을 임의로 설정하거 나, 소자의 특성을 동적으로 제어할 수 있는 적응학습 기능을 갖는 멤리스터 트랜지스터를 제공할 수 있다. 또한, 적응학습형 유연한 멤리스터 장치를 제공함으로써, 향후 본격적으로 전개될 유연 일렉트로닉스 분야에 서 향상된 기능성과 신규 응용성을 갖는 일렉트로닉스 기기의 실현에 크게 기여할 수 있다."}
{"patent_id": "10-2010-0130290", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 일실시예를 첨부된 도면들을 참조하여 상세히 설명한다. 또한, 본 발명을 설명함에 있어, 관 련된 공지 구성 또는 기능에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명은 생략한다. 도 1은 본 발명의 제1 실시예에 따른 멤리스터 트랜지스터의 단면도이다. 도 1에서 도시된 바와 같이, 본 발명에 따른 멤리스터 트랜지스터는 기판 상에 형성된 기판 베리어 절연 막층, 소오스 및 드레인 전극층(104a, 104b), 산화물반도체 박막층, 보호 절연막층, 유기 강 유전체 박막층 및 상부 게이트전극층을 포함한다. 또한, 베리어 절연막층 상부에 소정의 간격 으로 형성된 소오스 및 드레인 전극층(104a, 104b)과 상부 게이트전극층에 각각 연결된 복수의 컨택 비 아홀 및 복수의 컨택 비아홀을 통해 소오스 및 드레인 전극층(104a, 104b)과 상부 게이트전극층 에 각각 연결된 소오스 및 드레인 전극패드(116a, 116b)와 게이트 전극패드(미도시)를 더 포함한다. 이하 각 구성요소에 대해 구체적으로 살펴보도록 한다. 상기 기판은 본 발명에 따른 멤리스터 트랜지스터의 유연성을 확보하기 위하여 플라스틱 소재로 구성되 는 것이 바람직하다. 구체적으로는 폴리이미드(PI), 폴리카보네이트(PC), 폴리에테르설폰(PES), 폴리에틸렌나 프탈레이트(PEN), 폴리에테르에테르케톤(PEEK), 폴리부틸렌테레프탈레이트(PBT), 폴리에틸렌테레프탈레이트 (PET), 폴리염화비닐(PVC), 폴리에틸렌(PE), 에틸렌 공중합체, 폴리프로필렌(PP), 프로필렌 공중합체, 폴리 (4-메틸-1-펜텐)(TPX), 폴리아릴레이트(PAR), 폴리아세탈(POM), 폴리페닐렌옥사이드(PPO), 폴리설폰(PSF), 폴 리페닐렌설파이드(PPS), 폴리염화비닐리덴(PVDC), 폴리초산비닐(PVAC), 폴리비닐알콜(PVAL), 폴리비닐아세탈, 폴리스티렌(PS), AS수지, ABS수지, 폴리메틸메타크릴레이트(PMMA), 불소수지, 페놀수지(PF), 멜라민수지(MF), 우레아수지(UF), 불포화폴리에스테르(UP), 에폭시수지(EP), 디알릴프탈레이트수지(DAP), 폴리우레탄(PUR), 폴 리아미드(PA), 실리콘수지(SI) 또는 이것들의 혼합물 및 화합물 중 하나로 구성될 수 있다. 상기 기판 베리어 절연막층은 전기적인 절연특성을 가지는 무기 또는 유기 절연막층으로 형성할 수 있으 며, 상기 기판의 구부러짐 동작에서 발생하는 기계적인 스트레스를 경감시키기 위해 소정의 구조를 갖는 유무기 적층막의 형태로 형성할 수 있다. 예를 들어, 기판 베리어 절연막층은 무기 절연막으로는 실리콘산화막(SiO2), 실리콘질화막(SiNx), 실리콘산질화막(SiON) 등의 실리콘 계열 절연막으로 형성되거나, 유기 절 연막으로는 알루미늄 산화막(Al2O3), 하프늄 산화막(HfO2), 지르코늄 산화막(ZrO2), 티타늄 산화막(TiO2) 등으 로 형성될 수 있으며, 두 가지 이상의 금속 원소가 혼합된 산화막으로 형성될 수 있다. 이때 본 발명에서 제안하는 멤리스터 트랜지스터에서 상기 기판 베리어 절연막층의 역할은 다음과 같다. 첫 번째 역할은 상기 플라스틱 소재 기판 표면의 평탄성을 향상시키는 것이다. 두 번째 역할은 상기 플라스틱 소재에 함유되어 있는 가스 성분이 기판 상부로 배출되어 소자 특성에 악 영향을 미치는 것을 방지하는 것이다. 세 번째 역할은 상기 플라스틱 소재를 통해 외기에 포함된 수분이 침투하여 소자 특성에 악영향을 미치는 것 을 방지하는 것이다. 네 번째 역할은 상기 플라스틱 기판을 사용하여 제조하는 본 발명에 따른 멤리스터 트랜지스터의 제조 과정에 서 수행하는 소정의 열처리 과정을 통해 기판에 발생하는 기계적인 스트레스를 경감시키는 것이다. 다만, 이러한 목적을 달성하기 위해서는 기판에 발생하는 스트레스를 최소화할 수 있도록 상기 기판 베 리어 절연막층을 구성하는 소재 및 적층 구조를 적절하게 설계해야 한다. 한편, 상기 기판 베리어 절연막층은 상기 기판의 내열성을 고려하여 공정온도를 엄밀하게 제어해야 할 필요가 있다. 무기막 베리어 절연막층의 경우, 원자층증착법(atomic layer deposition), 스퍼터링법 (sputtering), 스핀코팅법(spin-coating) 등 일반적인 무기물 박막 형성 공정에서 도입 가능한 증착 방법을 사용할 수 있다. 또한 유기막 베리어 절연막층의 경우, 스핀코팅법, 진공 열증착법(thermal evaporation), 랑 미어 블로젯(LB)법 등 일반적인 유기물 박막 형성 공정에서 도입 가능한 증착 방법을 사용할 수 있다. 상기 기판 베리어 절연막층의 형성 조건은 저온에서도 우수한 평탄성과 전기적 절연성을 확보할 수 있도록 증 착 조건을 최적화하는 것이 바람직하다. 소오스 및 드레인 전극층(104a, 104b)은 금속 전극층 또는 전도성 산화물 박막층으로 형성하는 것이 바람직하 며, 경우에 따라서는 소정의 구조를 가지는 금속 적층 전극층 또는 전도성 산화물 박막층과 금속 박막층을 모 두 포함하는 적층막 전극층의 형태로 형성될 수 있다. 상기 소오스 및 드레인 전극층(104a, 104b)을 구성하는 소재를 선택하는 데 있어서 고려해야 할 가장 중요한 요소 중의 하나는, 본 발명에 따른 멤리스터 트랜지스터 의 반도체 채널 역할을 담당할 산화물반도체 박막층과 양호한 전기적 접촉 특성을 실현해야 할 필요가 있다는 점이다. 예를 들면, 금속 전극층 소재로는 티타늄(Ti), 전도성 산화물 박막층 소재로는 인듐-주석 산 화물(In-Sn-O, ITO), 인듐-아연 산화물(In-Zn-O), 알루미늄-아연 산화물(Al-Zn-O)등을 채용하는 것이 바람직 하며, 그 외 몰리브덴(Mo), 크롬(Cr), 알루미늄(Al), 금(Au), 은(Ag), 구리(Cu) 등의 다양한 금속 전극층을 사용할 수 있다. 또한 응용 시스템의 요구 사양을 만족시키기 위해 상기 소재들을 이층 또는 삼층 구조로 적 층하여 사용할 수도 있다. 여기서, 소오스 및 드레인 전극층(104a, 104b)은 상기 기판 베리어 절연막층 상에 전기적으로 분리된 두 개의 영역에 소정의 간격을 가지고 형성된 소오스 전극층(104a) 및 드레인 전극층(104b)으로 구성된다. 여기 서 소오스 전극층(104a)과 드레인 전극층(104b) 사이의 영역이 멤리스터 트랜지스터의 채널 영역으로 정의된 다. 따라서 소오스 및 드레인 전극층(104a, 104b)의 패턴 폭 및 패턴 사이의 거리에 의해 멤리스터 트랜지스 터의 채널 폭 및 길이가 결정된다. 이때, 멤리스터 트랜지스터의 동작 특성을 고려하여 채널 폭 및 길이를 적 절하게 설계하는 것이 바람직하다. 산화물반도체 박막층은 소오스 전극층(104a) 및 드레인 전극층(104b) 사이의 기판 상부, 자세하게 는 기판 베리어 절연막층 상부에 형성된다. 즉, 본 발명에 따른 멤리스터 트랜지스터의 채널 영역에 형 성되는데, 소오스 및 드레인 전극층(104a, 104b)의 측벽 및 상부 일부를 덮도록 형성될 수 있다. 여기서 산화 물반도체 박막층은 멤리스터 트랜지스터의 반도체 역할을 수행하며, 특히 산화물반도체로 형성하는 것을 특징으로 한다. 여기서 산화물반도체 박막층은 에너지 밴드갭이 넓어 가시광 영역에서 투명한 성질을 갖 는 산화물이면서 전기적으로 반도체의 성질을 갖는 투명한 산화물반도체 박막으로 형성되는 것이 바람직하다. 예를 들어, 아연 산화물(ZnO), 인듐-갈륨-아연 산화물(In-Ga-Zn-O), 아연-주석 산화물(Zn-Sn-O)로 형성되거나, 아연, 인듐, 갈륨, 주석, 알루미늄 중 적어도 두 개 이상의 원소를 포함하는 산화물로 형성될 수 있다. 또는, 앞서 언급한 산화물에 다양한 원소를 도핑하여 형성할 수 있다. 상기 산화물반도체 박막층은 스퍼터링 방법, 화학적기상증착법(Chemical Vapor Deposition), 원자층 증 착법, 펄스레이저 증착법(Pulsed-laser Deposition), 솔젤용액을 이용하는 스핀코팅 방법, 전구체 잉크를 이 용하는 인쇄방법 등 산화물 박막을 형성하기 위해 통상적으로 사용되는 모든 증착 방법을 사용할 수 있다. 물 론 이들 방법을 병용 또는 변용하여 사용하는 것도 가능하다. 또한 산화물반도체 박막층의 증착 공정의 온도는 상기 기판의 내열성을 고려하여 공정온도를 엄밀하게 제어해야 할 필요가 있다. 바람직하게는, 보다 낮은 온도에서도 양호한 멤리스터 트랜지스터의 동작 성능이 발현될 수 있도록 상기 산화물반도체 박막 층의 재료 조성 및 공정 조건을 최적화해야 할 필요가 있다. 여기서 산화물반도체 박막층의 두께는 멤리스터 트랜지스터의 동작조건을 결정하는 중요한 소자 변수의 하나이므로, 다음의 사항을 고려하여 그 두께를 결정하는 것이 바람직하다. 첫 번째, 산화물반도체 박막층을 채널층으로 사용하는 트랜지스터 소자의 동작 특성을 확보할 수 범위 내에서 상기 산화물반도체 박막층의 두께를 결정한다. 일반적으로 박막 트랜지스터의 채널 영역의 반도 체 박막으로 기능하기 위해서는 5 내지 50nm의 두께로 산화물반도체 박막층을 형성하는 것이 바람직하다. 만약, 5nm보다 막 두께가 얇은 경우에는 반도체 박막 표면을 이동하는 캐리어의 평균 이동거리보 다 막 두께가 얇아지는 경우가 발생하여 캐리어의 이동도를 크게 떨어뜨리는 원인이 될 수 있다. 한편, 50nm 보다 막 두께가 두꺼운 경우에는 반도체 박막 내부의 캐리어 농도가 과도하여 박막 트랜지스터의 전기적인 동 작 특성에 있어서 오프 전류의 증가와 트랜지스터의 온오프 동작 마진의 감소를 초래할 수 있으며, 극단적으 로 캐리어 농도가 높은 경우에는 구동 트랜지스터의 동작 자체를 확보할 수 없다. 따라서 첫 번째 사항을 고 려할 때 산화물반도체 박막층의 두께는 5 내지 50nm인 것이 바람직하다. 두 번째, 멤리스터 트랜지스터의 메모리 동작을 보다 낮은 전압에서 수행할 수 있도록 반도체 박막층의 두께를 결정하는 것이 바람직하다. 본 명세서에서는 멤리스터 트랜지스터의 동작 전압을 결정하기 위한 정량 적인 계산에 대해서는 설명을 생략하나, 본 발명에 따른 멤리스터 트랜지스터의 동작 전압은 시냅스의 자극주 기 동작을 수행하는 경우보다 반자극주기 동작을 프로그래밍하는 경우에 더 높은 동작 전압을 요구한다. 그 이유는 산화물반도체 박막의 경우, 그 소재의 특성상, 인가 전압의 변화에 따라 반전층과 축적층에서 동작하 는 통상적인 실리콘 반도체와 달리, 인가 전압의 변화에 따라 공핍층과 축적층에서 동작하며, 특정 전압 조건 에서 산화물반도체 박막은 완전 공핍화되어 절연체와 같이 거동하는 특징을 갖기 때문이다. 이와 같은 조건 하에서는 트랜지스터를 구성하는 게이트 스택 구조 상에서 산화물반도체 박막의 완전 공핍층의 존재로 인해 형성된 직렬 커패시터에 의해 프로그래밍 전압의 손실이 발생하게 되며 결과적으로 반자극주기 동작의 프로그 래밍 동작 전압의 상승을 초래하는 원인이 된다. 따라서, 이러한 효과를 가능한 수준에서 억제하고 반자극주 기 동작의 프로그래밍 전압을 줄이기 위해서는 산화물반도체 박막의 완전 공핍층의 두께를 가능한 한 줄일 필 요가 있으며, 이는 상기 산화물반도체 박막층의 두께를 가능한 한 줄일 필요가 있음을 의미한다. 따라서 두 번째 사항을 고려할 때 산화물반도체 박막층의 증착 두께는 20nm 이하인 것이 바람직하다. 결과적으로 상기 첫 번째 사항과 두 번째 사항을 동시에 고려하면, 산화물반도체 박막층의 두께는 5 내 지 20nm의 범위에서 결정되는 것이 더욱 바람직하다. 보호 절연막층은, 산화물 절연체 박막으로 형성되는 것이 바람직하며, 예를 들어, 실리콘 산화막(SiO2), 실리콘질화막(SiNx), 실리콘산질화막(SiON) 등의 실리콘 계열 절연막으로 형성되거나, 알루미늄 산화막 (Al2O3), 하프늄 산화막(HfO2), 지르코늄 산화막(ZrO2), 티타늄 산화막(TiO2) 등으로 형성될 수 있으며, 두 가 지 이상의 금속 원소가 혼합된 산화막으로 형성될 수 있다. 또한 앞서 언급된 산화물을 구성하는 금속 원소와 실리콘이 혼합된 실리케이트 절연막으로 형성될 수 있다. 이외에도 통상적인 산화물 박막 트랜지스터의 제작 에 있어서 게이트 절연막 재료로 사용 가능한 산화물 절연막 물질들로 형성될 수 있다. 보호 절연막층은 후속 공정시 산화물반도체 박막층의 손상을 방지하고, 본 발명의 멤리스터 트랜지 스터의 특성을 향상시키기 위한 목적으로 형성되는 것을 특징으로 한다. 여기서 보호 절연막층은 상기 산화물반도체 박막층 상부에 형성되는데, 산화물반도체 박막층과 함께 소오스 전극층(104a)과 드레 인 전극층(104b) 사이의 채널 영역에 형성되며, 소오스 및 드레인 전극층(104a, 104b)의 측벽 및 상부의 일부 를 덮도록 형성될 수 있다. 이때 본 발명에서 제안하는 멤리스터 트랜지스터에서 상기 보호 절연막층의 역할을 자세하게 살펴보면 다음과 같다. 첫 번째, 산화물반도체 박막층의 식각 공정 및 식각 마스크 제거 공정시 산화물반도체 박막층의 공 정 열화 현상을 억제한다. 상기 공정에서 보호 절연막층을 제공하지 않는 경우, 포토레지스트, 포토레지스트 현상액, 포토레지스트 박리액 등의 화학 약품이 산화물반도체 박막층에 직접 작용하여 산화물반도 체 박막층의 재료적인 특성이 열화될 수 있다. 따라서 산화물반도체 박막층 상에 보호 절연막층 을 형성함으로써 산화물반도체 박막층이 화학적으로 열화되는 것을 방지할 수 있다. 두 번째, 후속 공정 수행시 산화물반도체 박막층이 손상되어 열화되는 것을 방지함으로써, 산화물반도체 박막층이 반도체로서의 역할을 충실히 수행하여 멤리스터 트랜지스터가 양호한 동작 특성을 갖게 한다. 구체적으로, 보호 절연막층은 후속 공정에서 형성할 유기 강유전체 박막층 형성시 산화물반도체 박 막층의 화학적 열화 현상을 억제한다. 유기 강유전체 박막층은 유기 용액을 이용하는 도포 공정에 의해 형성되는데, 이때 사용되는 유기 용액의 종류에 따라 산화물반도체 박막층의 재료적인 특성이 열화 될 수 있다. 따라서, 산화물반도체 박막층 상에 보호 절연막층을 형성함으로써 산화물반도체 박막 층이 화학적으로 열화되는 것을 방지할 수 있다. 세 번째, 보호 절연막층의 물질 종류 및 공정 조건을 변화시켜 산화물반도체 박막층의 전기적인 특 성을 변화시킬 수 있다. 특히 보호 절연막층 형성시 공정 조건을 변경하여 산화물반도체 박막층의 캐리어 농도, 표면의 화학적 상태 등을 변화시킴으로써 멤리스터 트랜지스터의 동작 특성을 개선할 수 있다. 네 번째, 보호 절연막층은 후속 공정에서 형성할 유기 강유전체 박막층의 누설전류를 억제하는 전 기적인 보호막의 역할을 한다. 본 발명의 멤리스터 트랜지스터를 구성하는 유기 강유전체 박막층은 그 소재의 특성상 박막화를 진행할수록 누설전류가 크게 증가하게 되는데, 이는 멤리스터 트랜지스터의 동작특성 을 결정적으로 저하시키는 원인으로 작용할 수 있다. 따라서 유기 강유전체 박막층과 산화물반도체 박막 층 사이에 보호 절연막층을 제공하여 누설전류에 따른 멤리스터 트랜지스터의 특성 저하를 방지할 수 있다. 전술한 바와 같은 상기 보호 절연막층의 역할을 고려할 때 보호 절연막층은 첫째, 산화물반도체 박 막층의 공정 열화 현상을 충분히 억제할 수 있고, 둘째, 보호 절연막층의 도입에 의해 멤리스터 트 랜지스터의 적응학습 기능을 개선할 수 있으며, 셋째, 유기 강유전체 박막층의 누설전류를 충분히 억제 할 수 있는 전기적 특성을 보유하도록 형성되는 것이 바람직하다. 여기서 보조 절연막층의 두께는 멤리스터 트랜지스터의 동작 특성을 결정하는 매우 중요한 소자 변수의 하나로서, 다음의 사항을 고려하여 보조 절연막층의 두께를 결정하는 것이 바람직하다. 첫 번째, 멤리스터 트랜지스터의 동작 전압이 너무 증가하지 않는 범위에서 결정되어야 한다. 즉, 보조 절연 막층의 두께가 너무 두꺼운 경우, 멤리스터 트랜지스터의 구동 전압의 일부가 트랜지스터의 게이트 스택 의 일부를 구성하는 보조 절연막층에 의해 생기는 직렬 커패시터에서 소모되어 전체적으로 동작 전압을 상승시키는 원인이 될 수 있기 때문이다. 따라서, 첫 번째 사항을 고려할 때 보조 절연막층의 두께는 10nm 이하의 범위에서 결정되는 것이 바람직하다. 두 번째, 산화물반도체 박막층의 식각 공정에 있어서, 각종 화학약품으로부터 초래되는 공정 열화를 충 분히 억제할 수 있는 범위에서 결정되어야 한다. 세 번째, 후속 공정에서 형성될 유기 강유전체 박막층의 누설 전류를 충분히 억제할 수 있는 범위에서 결정되어야 한다. 따라서, 두 번째 및 세 번째 사항을 고려할 때 보조 절연막층의 두께는 4nm 이상인 것이 바람직하다. 결 과적으로 첫 번째 내지 세 번째 사항을 동시에 고려할 때, 보조 절연막층의 두께는 4 내지 10nm의 범위 에서 결정되는 것이 바람직하다. 유기 강유전체 박막층은 본 발명의 멤리스터 트랜지스터의 메모리 동작 및 적응학습 기능을 구현하기 위 한 트랜지스터의 게이트 절연막으로 사용되며, 유기 소재 즉, 저분자 또는 고분자의 유기물 재료로 전압의 인 가에 따라 잔류분극 현상을 보이는 강유전성을 갖는 유기 물질로 형성된다. 예를 들어, 유기 강유전체 박막층은 P(VDF)(Poly(Vinylidene Fluoride) 및 P(VDF)에 적절한 비율의 TrFE(Trifluorotethylene)가 혼합된 공중합체인 P(VDF-TrFE)로 형성될 수 있다. P(VDF)와 TrFE의 혼합 조성 범위는 P(VDF-TrFE)가 강유전 특성을 나타내는 범위 내에서 조절될 수 있으며, 예를 들어, P(VDF)가 55% 이상 포함되는 것이 바람직하다. 물론, 혼합 조성 범위는 유기 강유전체 박막층의 누설 전류 특성 및 강유전 성을 최적화하기 위해 적절한 비율로 조절되는 것이 더욱 바람직하다. 여기서 유기 강유전체 박막층은 스핀코팅 방법에 의해 형성되는 것이 바람직하다. 예를 들어, P(VDF- TrFE)를 선택하여 유기 강유전체 박막층 을 형성하는 경우, 통상적으로 고체 알갱이 형태의 P(VDF-TrFE) 원료를 적절한 유기 용매에 용해시키는 방법으로 원료 용액을 제조할 수 있다. 스핀코팅 방법에 의해 유기 강 유전체 박막층을 형성하는 통상적인 순서는 다음과 같다. 먼저, 원료 용액을 소정의 기판 위에 적하하여 적절한 스핀 코팅 조건으로 코팅한 후, 원료 용액에 포함된 유기 용매를 휘발시키기 위해 소정의 온도에서 열 처리를 수행한다. 이어서, 유기 강유전체막의 결정화 과정을 위해 소정의 온도에서 열처리를 수행한다. 통상 적으로 유기 용매 휘발을 위한 열처리 공정의 온도는 사용하는 유기 용매에 따라 다를 수는 있으나, 50 내지 120℃에서 수행되는 것이 바람직하다. 또한, 결정화를 위한 열처리 공정의 온도는 사용하는 유기 강유전체의 물질 종류에 따라 다를 수 있으나, 유기 강유전체 소재로서 P(VDF-TrFE)를 사용하는 경우, 120 내지 160℃ 사 이의 온도에서 수행되는 것이 바람직하다. 이때, 유기 강유전체 박막층이 양호한 강유전 특성을 갖도록 하기 위해서는 박막의 결정화 과정이 필수적이기 때문에 결정화 온도를 선택하는 것은 매우 중요하다. 만일 결정화 공정의 온도가 너무 낮으면 박막의 결정화도가 부족하여 소망하는 전기적 특성을 얻기 어려우며, 반대 로 결정화 공정의 온도가 너무 높으면 형성된 박막이 완전히 용융되어 강유전 특성을 소실할 우려가 있다. 예 시한 바와 같이, 유기 강유전체 소재인 P(VDF-TrFE)의 결정화 온도는 통상으로 사용되는 상기 플라스틱 기판 소재의 내열성 범위 안에 있기 때문에, 본 발명의 멤리스터 트랜지스터를 제작하기에 용이하다. 한편, 스핀코팅 방식에 의해 유기 강유전체 박막층을 형성하는 경우, 스핀코팅 공정의 회전수 및 유기 강유전체 원료 용액의 농도 조절을 통해 유기 강유전체 박막층의 두께를 조절할 수 있다. 여기서, 유기 강유전체 박막층의 적절한 두께를 선택하기 위해서는 다음의 두 가지 사항을 고려해야 한다. 첫 번째, 멤리스터 트랜지스터의 동작 전압을 가능한 한 낮출 수 있는 방향으로 선택하는 것이 바람직하다. 이를 위해서는 상대적으로 낮은 인가 전압에서도 용이하게 분극의 반전이 가능하도록 유기 강유전체 박막층 의 두께를 줄이는 것이 바람직하다. 그러나, 기존의 연구 결과에 의하면, 유기 강유전체 박막의 두께가 일정 두께 이하로 얇아질 경우 박막 자체의 강유전성이 크게 열화하여, 분극 반전이 일어나는 전계값이 크게 증가하고, 동일 전계에서도 분극 반전에 필요한 시간이 매우 길어지는 현상이 나타난다는 사실이 알려져 있다. 이러한 열화 현상이 일어나는 임계막 두께의 값은 유기 강유전체의 상하부에 어떤 전극을 사용하는가에 따라서도 달라질 수는 있으나 일반적으로 50nm 이하의 막 두께에서 현저하게 관찰되는 것으로 알려져 있다. 두 번째, 메모리 트랜지스터 즉, 메모리 트랜지스터의 데이터 리텐션 특성을 향상시킬 수 있는 방향으로 선택 하는 것이 바람직하다. 메모리 트랜지스터의 데이터 리텐션 시간은 유기 강유전체 박막층의 누설 전류 특성과 매우 밀접한 관련이 있는 만큼 소자의 동작 중에 있어서 과도한 누설 전류가 발생하지 않도록 유기 강 유전체 박막층의 증착 두께를 최적화할 필요가 있다. 연구 결과에 따르면, 유기 강유전체막의 막 두께가 200nm 정도에서는 인가 전압에 따른 현저한 누설 전류가 발생하지 않는 것이 알려져 있다. 따라서, 유기 강유전체 박막층의 증착 두께는 상기 첫 번째 사항과 상기 두 번째 사항을 모두 고려하여 50 내지 200nm의 범위에서 선택하는 것이 바람직하다. 다만, 향후 기술 개발에 따라 유기 강유전체막이 더욱 박막화되더라도 우수한 강유전 특성을 얻을 수 있는 방법이 개발된다면, 유기 강유전체 박막층의 증착 두께 하한은 더욱 감소할 수 있다. 상부 게이트전극층은 유기 강유전체 박막층의 상부 일부에 위치하는데, 특히 멤리스터 트랜지스터 의 채널 영역 상부에 위치한다. 여기서 상부 게이트전극층은 금속 전극층 또는 전도성 산화물 박막층으 로 형성할 수 있다. 예를 들면, 금속 전극층 소재로는 티타늄(Ti), 몰리브덴(Mo), 크롬(Cr), 알루미늄(Al), 금(Au), 은(Ag), 구리(Cu) 등의 다양한 금속 전극층을 사용할 수 있으며, 전도성 산화물 박막층 소재로는 인 듐-주석 산화물(In-Sn-O, ITO), 인듐-아연 산화물(In-Zn-O) 박막층을 사용할 수 있다. 또한 응용 시스템의 요 구 사양을 만족시키기 위해 상기 소재들을 이층 또는 삼층 구조로 적층하여 사용할 수도 있다. 여기서, 주의해야 할 점은 상기 상부 게이트전극층의 형성 공정 및 패터닝 공정은 하부의 유기 강유전체 박막층에 손상을 주지 않도록 설계되어야 한다는 점이다. 그 이유는 다음과 같다. 첫 번째, 플라즈마를 사용하는 통상적인 도전성 박막의 증착 공정은 본 발명의 멤리스터 트랜지스터의 구성에 있어서 소자의 메모리 동작 및 적응학습 기능을 실현하기 위해 매우 중요한 구성요소인 유기 강유전체 박막층 의 전기적, 기계적인 박막 특성을 크게 열화시킬 가능성이 있기 때문이다. 두 번째, 예를 들어 ITO 등의 전도성 산화물 박막층을 상부 게이트전극층의 물질로 사용하는 경우, 전극 의 전도도 향상을 위해 증착 공정 이후 소정의 온도에서 후속 열처리 공정을 수행하는 경우가 많으나, 앞서 설명한 바와 같이, 상기 유기 강유전체 박막층의 물질로서 P(VDF-TrFE)를 사용하는 경우, 후속 공정을 위한 공정온도를 P(VDF-TrFE)의 녹는점 이상의 온도로 설정할 수 없기 때문이다.세 번째, 유기 강유전체 박막층의 물질로서 P(VDF-TrFE)를 사용하는 경우, P(VDF-TrFE) 표면의 거칠기 정도가 매우 심하여, 통상적으로 사용하는 전도성 산화물 박막층과의 밀착성이 좋지 않아, 식각 공정 과정에 서 건전한 형상의 패터닝이 매우 어려워지기 때문이다. 따라서, 상기 상부 게이트전극층은 유기 강유전체 박막층에 손상을 주지 않도록 전극 물질의 종류, 증착 공정 방법, 후속 열처리 공정온도, 식각 공정 조건 등을 최적화하는 것이 바람직하다. 증착 공정 방법의 예로는 공정 중에 플라즈마를 사용하지 않는 진공 열증착법, 전자빔증착법(e-beam deposition) 등을 사용하는 것이 바람직하며, 플라즈마를 사용하는 스퍼터링 방법으로 상부 게이트전극층을 형성하는 경우에는 장비 의 구조 및 증착 조건을 최적화해야 할 필요가 있다. 소오스 및 드레인 전극패드(116a, 116b)는 유기 강유전체 박막층의 일부를 관통하여 형성된 컨택 비아홀 를 통해 소오스 및 드레인 전극층(104a, 104b)과 전기적으로 연결된다. 일 예로 본 도면에서는 멤리스터 트랜지스터의 컨택 비아홀은 유기 강유전체 박막층을 관통하도록 형성되는 경우에 대해 도시하고 있다. 이 공정 과정에서 소오스 및 드레인 전극패드(116a, 116b)가 형성될 영역의 유기 강유전체 박막층(11 0)을 선택적으로 제거한다. 예를 들어, 유기 강유전체 박막층의 상부에 프토레지스트 패턴을 형성한 후, 포토레지스트 패턴을 식각 마스크로 유기 강유전체 박막층을 식각한다. 이어서, 식각 마스크인 포토레지 스트 패턴을 제거한다. 여기서, 유기 강유전체 박막층의 식각 공정은 다음의 두 가지 사항을 고려해야 한다. 첫 번째, 산소 플라즈마를 이용하여 유기 강유전체 박막층을 식각하는 경우, 산화물반도체 박막층 의 특성이 열화되지 않도록 산소 플라즈마의 조건을 최적화하여야 한다. 일반적으로 산화물반도체 박막층 은 플라즈마 처리에 의해 표면 및 박막 내부의 특성이 상당히 변경될 가능성을 가지고 있다. 물론, 유기 강유전체 박막층의 식각 공정시 보조 절연막층이 산화물반도체 박막층의 보호막으로서 역할을 수행하기는 하지만, 산화물반도체 박막층의 특성이 열화되지 않도록 산소 플라즈마 조건을 최적화할 필 요가 있다. 두 번째, 식각 마스크로 이용한 포토 레지스트 패턴의 박리 공정시 유기 강유전체 박막층의 특성에 영향 을 미치지 않는 박리액을 선택해야 한다. 일반적으로 사용되는 포토 레지스트 패턴의 박리를 위한 화학 약품 들은 자칫 유기 강유전체 박막층의 특성에 치명적인 영향을 미칠 수 있기 때문에, 박리액의 선택에 충분 한 주의를 기울여야 한다. 더구나, 포토레지스트 패턴의 제거 공정에서는 일반 습식 식각과 달리 진공 중에서 플라즈마를 사용하는 일종의 건식 식각 공정을 채용하고 있기 때문에, 포토 레지스트 패턴의 경화 정도가 더 욱 심하여 적절하지 않은 조건의 박리 과정에서는 포토 레지스트 패턴이 유기 강유전체 박막층 상부에 일부 잔류할 수도 있다. 이 공정에서 적용 가능한 박리액이 가져야 할 특성은 다음과 같다. 첫 번째 특성은, 박리액의 구성 성분이 유 기 강유전체 박막층에 화학적인 영향을 주지 않아야 한다. 예를 들어, P(VDF-TrFE)로 형성된 유기 강유 전체 박막의 경우, 박리액의 구성 성분이 P(VDF-TrFE)를 화학적으로 해체하여 박막의 제거를 야기해서는 안되 며, P(VDF-TrFE)이 제거되지는 않는다고 하더라도, P(VDF-TrFE)의 결정 상태 또는 화학적인 결합 상태를 크게 변화시켜, P(VDF-TrFE)의 전기적 특성에 심각한 변화를 초래해서는 안된다. 예를 들어, 포토 레지스트 패턴의 박리를 위해 일반적으로 적용되는 유기 약품의 하나인 아세톤(Acetone)의 경우, P(VDF-TrFE)를 완전히 용해시 켜 제거하는 작용을 가지기 때문에, 본 발명에서 제공하는 제조 방법에서 아세톤을 박리액으로 사용하는 것은 불가능하다. 두 번째 특성은, 해당 박리액이 포토 레지스트 패턴의 잔류 성분을 완전하게 제거할 수 있어야 한다. 만약, 해당 박리액이 포토 레지스트 패턴의 잔류 성분을 충분히 효과적으로 제거할 수 없는 경우, 포토 레지스트 패턴의 잔류 성분은 본 발명의 소자가 형성되어 있는 기판의 일부에 계속 잔류하여, 본 발명의 소자 가 정상적으로 동작하는 것을 방해하는 요인으로 작용할 가능성이 있다. 예를 들어, 포토 레지스트 패턴의 박 리를 위해 메탄올을 주성분으로 하는 유기 약품을 사용할 수는 있으나, 사용한 포토 레지스트 패턴의 종류 및 선행 공정의 효과에 따라서는 메탄올(methanol)을 이용하여 포토 레지스트의 잔류물을 완전히 제거할 수 없다. 여기서 소오스 및 드레인 전극패드(116a, 116b)는 금속 전극층 또는 전도성 산화물 박막층으로 형성할 수 있 다. 소오스 및 드레인 전극패드(116a, 116b)는 유기 강유전체 박막층 상부에서 상부 게이트전극층 과 같은 평면 상에서 동일한 일괄 공정에 의해 형성되는 것이 바람직하다. 따라서 소오스 및 드레인 전극패드 (116a, 116b)는 상부 게이트전극층과 동일한 소재로 형성될 수 있다. 도 2는 본 발명의 제2 실시예에 따른 멤리스터 트랜지스터의 단면도이다. 도 2에서 도시된 바와 같이, 본 발명에 따른 멤리스터 트랜지스터는 기판 상에 형성된 기판 베리어 절연 막층, 산화물반도체 박막층, 보호 절연막층, 소오스 및 드레인 전극층(208a, 208b), 유기 강 유전체 박막층, 상부 게이트전극층을 포함한다. 또한 기판 베리어 절연막층 상부에 소정의 간 격으로 형성된 소오스 및 드레인 전극층(208a, 208b)과 상부 게이트전극층에 각각 연결된 복수의 컨택 비아홀 및 복수의 컨택 비아홀를 통해 소오스 및 드레인 전극층(208a, 208b)과 상부 게이트전극층 에 각각 연결된 소오스 및 드레인 전극패드(216a, 216b)와 게이트 전극패드(미도시)를 더 포함한다. 도 2에서 도시한 제2 실시예에 따른 멤리스터 트랜지스터의 구조가 도 1에서 도시한 제1 실시예에 따른 멤리 스터 트랜지스터의 구조와 상이한 점은 다음과 같다. 산화물반도체 박막층은 기판 베리어 절연막층 상부에 형성되며, 소오스 및 드레인 전극층(208a, 208b)은 산화물반도체 박막층의 측벽 및 상부의 일부를 덮도록 형성된다. 또한 산화물반도체 박막층 상에 형성되는 보호 절연막층을 더 포함한다. 결과적으로 산화물반도체 박막층과 보호 절연 막층이 메모리 박막 트랜지스터의 채널 영역에 형성되는 되는 점은 제1 실시예를 통해 제공되는 소자의 구조와 동일하나, 산화물반도체 박막층과 소오스 및 드레인 전극층(208a, 208b)의 위치관계가 상이하다. 게이트전극층이 게이트 절연막 상부에 형성되는 구조를 통상적으로 탑게이트 구조라고 하는데, 상기 탑게이트 구조의 박막 트랜지스터에서 상기 제1 실시예에 따른 구조를 탑게이트-버텀컨택이라고 하고, 상기 제2 실시예 에 따른 구조를 탑게이트-탑컨택 구조라고 한다. 도 2에 도시한 바와 같이, 제2 실시예에 따른 멤리스터 트랜지스터의 구조에 있어서, 보호 절연막층은 도 1의 제1 실시예를 참조하여 설명한 상기 보호 절연막층의 역할과 함께 다음과 같은 역할을 더 기대할 수 있다. 소오스 및 드레인 전극층(208a, 208b)은 산화물반도체 박막층 이후에 형성되기 때문에, 습식 또는 건식 식각 공정을 이용하여 소오스 및 드레인 전극층(208a, 208b)의 패터닝 공정 수행시, 산화물반도체 박막층 에 작용할 수 있는 공정 열화 현상을 효과적으로 방지하여, 산화물반도체 박막층의 소재 특성이 열 화되는 것을 막을 수 있다. 따라서, 보호 절연막층은 제2 실시예에 따른 소자 구조에 있어서, 소오스 및 드레인 전극층(208a, 208b) 식각을 위한 식각 제어층의 역할을 동시에 수행할 수 있다. 이와 같은 상기 보호 절연막층의 역할을 고려할 때, 보호 절연막층은 첫째, 소오스 및 드레인 전극층(208a, 208b)의 식 각 공정에 있어서 산화물반도체 박막층의 공정 열화 현상을 충분히 억제할 수 있고, 둘째, 상하 구성층 간의 식각 선택성을 충분히 확보할 수 있는 물질로 형성되는 것이 바람직하다. 도 2에서 도시한 본 발명의 제2 실시예에 따른 멤리스터 트랜지스터의 구성 요소 및 제조 방법은, 도 1에서 도시한 본 발명의 제1 실시예에 따른 멤리스터 트랜지스터의 구성 요소 및 제조 방법과 동일하므로 중복 설명 은 생략한다. 도 3은 본 발명의 제3 실시예에 따른 멤리스터 트랜지스터의 단면도이다. 도 3에서 도시된 바와 같이, 본 발명에 따른 멤리스터 트랜지스터는 기판 상에 형성된 기판 베리어 절연 막층, 하부 게이트전극층, 유기 강유전체 박막층, 산화물반도체 박막층, 보호 절연막층 을 포함한다. 그리고 상기 유기 강유전체 박막층 상부에 소정의 간격으로 형성된 소오스 및 드레인 전극층(308a, 308b)을 포함한다. 그리고 소오스 및 드레인 전극 패드(미도시)와 하부 게이트전극층과 게 이트 전극 패드(미도시)를 연결하는 복수의 컨택 비아홀(미도시)을 더 포함한다. 비록, 도면에는 도시되지 않 았지만, 상기 보호 절연막층 상부에 소자 전면을 보호하는 제2 보호 절연막층(미도시)을 더 포함할 수 있다. 도 3에 도시한 제3 실시예에 따른 멤리스터 트랜지스터의 구조가 도 1에 도시한 제1 실시예에 따른 멤리스터 트랜지스터의 구조와 상이한 점은 게이트 전극을 기판 상부에 먼저 형성하는 버텀게이트의 구조를 가진 다는 점이다. 반면 산화물반도체 박막층은 소오스 및 드레인 전극층(308a, 308b)이 형성된 이후, 버텀컨 택의 형태로 채널층을 형성한다는 점에서는 도 1에서 도시한 제1 실시예에 따른 트랜지스터의 구조와 동일하 다. 도 3에서 도시한 버텀게이트-버텀컨택 구조를 가지는 본 발명의 멤리스터 트랜지스터의 구조에서는 유기 강유 전체 박막층이 산화물반도체 박막층에 비해 먼저 형성되는 것을 특징으로 한다. 따라서 상기 소자 의 제조 과정에서는 다음과 같은 점을 고려해야 한다. 첫 번째, 산화물반도체 박막층 및 보호 절연막층의 증착 방법과 공정온도를 하부의 유기 강유전체 박막층에 손상을 주지 않도록 결정해야 한다. 보다 구체적으로는 산화물반도체 박막층 및 보호 절 연막층의 증착 과정에서는 플라즈마를 사용하지 않는 증착 방법을 채용하는 것이 바람직하며, 그 이유는 앞서 설명한 바와 같다. 또한 산화물반도체 박막층 및 보호 절연막층의 공정온도는 150℃ 이하로 억제해야 한다. 왜냐하면, 통상적으로 사용하는 대표적인 유기 강유전체 소재인 P(VDF-TrFE)의 경우, 소재의 녹는점이 약 155℃ 부근으로 그 이상의 온도를 경험하는 경우에는 소정의 전기적인 특성을 확보하지 못할 가 능성이 있기 때문이다. 이러한 공정온도의 제한조건은 사용하는 플라스틱 기판의 내열성에 의해서도 제한되지 만, 만약 내열성이 보다 뛰어난 플라스틱 기판을 기판 소재로 사용한다고 하더라도, 도 3에서 도시하는 버텀 게이트 구조의 멤리스터 트랜지스터의 경우에는 공정온도가 150℃로 제한된다는 점에 주목해야 한다. 두 번째, 산화물반도체 박막층이 형성된 이후, 본 발명의 멤리스터 트랜지스터 소자의 동작을 향상시키 기 위해 실시할 수 있는 후속 열처리 공정의 공정온도 역시 150℃ 이하로 억제해야 한다. 이때, 후속 열처리 공정에서 필요한 온도 조건은 사용하는 산화물반도체 박막층의 소재 조성에 크게 의존하기 때문에, 저온 의 후속 열처리 공정을 통해서도 양호한 반도체 채널 특성을 확보할 수 있도록 산화물반도체 박막층의 소재 조성을 결정하는 것이 바람직하다. 세 번째, 보호 절연막층을 제외하면 산화물반도체 박막층이 가장 최종적으로 형성되고, 외기와 가 까운 상태로 노출되기 때문에, 상기 보호 절연막층은 앞서 설명한 효과 이외에도 외기로부터 산화물반도 체 박막층을 보호하는 역할을 추가적으로 담당한다는 점을 고려해야 한다. 이상과 같이 설명한 사항을 제외하면, 도 3에서 도시한 본 발명의 제3 실시예에 따른 멤리스터 트랜지스터의 구성 요소 및 제조 방법은, 도 1에서 도시한 본 발명의 제1 실시예에 따른 멤리스터 트랜지스터의 구성 요소 및 제조 방법과 동일하므로 중복 설명은 생략한다. 도 4는 본 발명의 제4 실시예에 따른 멤리스터 트랜지스터의 단면도이다. 도 4에서 도시된 바와 같이, 본 발명에 따른 멤리스터 트랜지스터는 기판 상에 형성된 기판 베리어 절연 막층, 하부 게이트전극층, 유기 강유전체 박막층, 산화물반도체 박막층, 보호 절연막층 을 포함한다. 그리고 상기 유기 강유전체 박막층 상부에 소정의 간격으로 형성된 소오스 및 드레인 전극층(408a, 408b)을 포함한다. 그리고 소오스 및 드레인 전극 패드(미도시)와 하부 게이트전극층과 게 이트 전극 패드(미도시)를 연결하는 복수의 컨택 비아홀(미도시)을 더 포함한다. 비록, 도면에는 도시되지 않 았지만, 상기 보호 절연막층 상부에 소자 전면을 보호하는 제2 보호 절연막층(미도시)을 더 포함할 수 있다. 도 4에 도시한 제4 실시예에 따른 멤리스터 트랜지스터의 구조가 도 3에 도시한 제3 실시예에 따른 멤리스터 트랜지스터의 구조와 상이한 점은 소오스 및 드레인 전극층(408a, 408b)을 산화물반도체 박막층 및 보호 절연막층이 형성된 이후에 형성한다는 점이다. 즉, 버텀게이트-탑컨택의 구조를 가진다. 상기 버텀게이트-탑컨택 구조의 본 발명의 멤리스터 트랜지스터는 앞서 설명한 제3 실시예의 버텀게이트-버텀 컨택의 소자 구조와 제2 실시예의 탑게이트-탑컨택의 소자 구조의 특징을 일부 겸하여 가지고 있는 구조이므 로, 각 구조의 제공을 통해 고려해야 할 기술적인 사항에 대한 중복 설명을 생략한다. 또한 구조의 상이함으 로 인해 고려해야 할 사항을 제외하면, 도 1에서 도시하여 설명한 본 발명의 제1 실시예에 따른 멤리스터 트 랜지스터의 구성 요소 및 제조 방법과 동일하므로 중복 설명은 생략한다. 본 명세서에 기술된 제1 내지 제4 실시예에 따른 멤리스터 트랜지스터의 제조 방법은 그 일례로 제시된 것이 며, 본 발명이 이에 한정된 것은 아니다. 이 밖에도 응용하고자 하는 전체 시스템의 구조 및 그 요구 공정에 따라 구체적인 소자 구조 및 공정 조건은 가장 적절한 형태로 선택될 수 있다. 도 5a 내지 도 5c는 본 발명에 따른 멤리스터 트랜지스터가 메모리 기능과 적응학습 기능을 발현하는 동작 원 리를 설명하는 모식도이다. 편의상, 도 5의 설명에서는 모식적으로 나타낸 탑게이트 트랜지스터 소자 구조를 이용하여 본 발명의 멤리스터 트랜지스터의 동작 원리를 설명하고 있으나, 이 동작 원리는 도 1 내지 도 4를 참조하여 설명한 본 발명의 제1 내지 제4 실시예에 따른 멤리스터 트랜지스터에 공통적으로 적용된다. 도 5a를 참조하면, 본 발명에 따른 멤리스터 트랜지스터에서 게이트 절연막의 역할을 하는 유기 강유전체 박 막층의 강유전 자발분극(Ferroelectric Spontaneous Polarization)이 멤리스터 트랜지스터의 채널 방향 을 향해 완전히 정렬된 상태(Full Polarization)를 나타낸다. 이 상태를 만들기 위해서는 탑게이트 트랜지스 터의 경우, 상부 게이트전극층에 플러스 전압을 인가할 필요가 있다. 상부 게이트전극층에 플러스 전압을 인가한 후에는 전압의 인가를 차단하더라도 유기 강유전체 박막층 내부에 채널 방향을 향해 완전히 정렬된 강유전 자발분극은 비휘발(Nonvolatile)의 상태로 보존된다. 한편, 통상적으로 박막 트랜지스터의 제조에 사용하는 산화물반도체 박막층이 n형이라고 가정하면, 상기 상태 에서 산화물반도체 박막층 채널 표면에 캐리어 전자(Electron)가 다량 발생하여, 멤리스터 트랜지스터의 소오스 전극층(502a)와 드레인 전극층(502b) 사이로 많은 양의 전류가 흐르게 되고, 멤리스터 트랜지스터는 온(ON) 상태가 된다. 도 5b를 참조하면, 상기 유기 강유전체 박막층의 강유전 자발분극이 멤리스터 트랜지스터의 채널 반대 방향을 향해 완전히 정렬된 상태를 나타낸다. 이 상태를 만들기 위해서는 탑게이트 트랜지스터의 경우 상부 게이트전극층에 마이너스 전압을 인가할 필요가 있다. 상부 게이트전극층에 플러스 전압을 인가한 후에는 전압의 인가를 차단하더라도 유기 강유전체 박막층 내부에 채널 반대 방향을 향해 완전히 정렬된 강유전 자발분극은 비휘발의 상태로 보존된다. 상기 상태에서는 산화물반도체 박막층 채널 표면에 캐리 어 전자가 거의 발생하지 않아, 멤리스터 트랜지스터의 소오스 전극층(502a)과 드레인 전극층(502b) 사이에는 거의 전류가 흐르지 않게 되고, 멤리스터 트랜지스터는 오프(OFF) 상태가 된다. 상기 도 5a 내지 5b를 참조하여 설명한 두 가지 상태를 이용하면, 저저항의 온 상태와 고저항의 오프 상태를 구현할 수 있으며, 이를 데이터 0과 데이터 1에 대응시키면 디지털 정보를 저장하는 유연 멤리스터 소자를 플 라스틱 기판 위에 제공할 수 있다. 도 5c를 참조하면, 상기 유기 강유전체 박막층의 강유전 자발분극이 박막 내부에서 부분적으로 정렬된 상태(Partial Polarization)를 모식적으로 나타낸다. 실제로는 박막 내부에서 분극들이 무질서한 방향으로 정 렬되어 있으며, 이를 실효적으로 계산하여 아래 방향을 향하는 분극의 개수와 위 방향을 향하고 있는 분극의 개수로 환산하여 표시하면 도 5c에 도시한 바와 같이 표시할 수 있다. 이 상태를 만들기 위해서는 몇 가지 계 획된 전압 인가 조건을 설계할 필요가 있으며, 구체적인 방법에 대해서는 도 6을 참조하여 구체적으로 설명하 기로 한다. 한편, 상기 상태에서는 산화물반도체 박막층 채널 표면에 발생하는 캐리어 전자의 양이, 유 기 강유전체 박막층 내부에서 실효적으로 채널 방향을 향하고 있는 분극의 개수와 소정의 함수 관계를 가지며, 그 결과 분극의 상태에 따라 서로 다른 양의 캐리어 전자가 발생할 것을 기대할 수 있다. 따라서 멤 리스터 트랜지스터의 소오스 전극층(502a)과 드레인 전극층(502b) 사이에는 도 5a에서 참조한 멤리스터 트랜 지스터의 온 상태와 도 5b에서 참조한 멤리스터 트랜지스터의 오프 상태의 중간값의 전류가 흐르게 된다. 따 라서, 멤리스터 트랜지스터에 중간 상태의 전류값을 설정할 수 있고, 아울러 이를 누적하여 증폭하거나 감소 시킬 수 있다면, 본 발명의 멤리스터 트랜지스터를 이용하여 적응학습 기능을 구현할 수 있다. 도 6a 내지 도 6d는 본 발명에 따른 멤리스터 트랜지스터의 적응학습 기능을 구현하기 위한 전압의 인가 조건 및 전압 인가에 따른 강유전 자발분극과 트랜지스터 드레인 전류의 상관관계를 모식적으로 나타낸 도면이다. 도 6a를 참조하면, 본 발명에 따른 멤리스터 트랜지스터의 유기 강유전체 박막층에 전압을 인가하여 도 5c에 도시된 바와 같이 유기 강유전체 박막층의 강유전 자발분극의 상태를 부분적으로 정렬된 상태로 만들기 위한 전압 펄스의 일례를 나타낸다. 이 예에서는 동일한 크기와 폭을 갖는 전압 펄스의 주파수를 조절하면, 일정 시간 동안 인가되는 전압 펄스의 회수를 조절할 수 있다. 이러한 인가 방법을 주파수 변조 방식(Pulse Frequency Modulation; PFM)이라고 한다. 이 방법에서는, 인가 전압의 크기가 유기 강유전체 박막층의 분극이 반전하여 일정 방향으로 정렬하기에 충분히 큰 값이고, 인가 전압의 폭이 유기 강유전체 박막층의 분극이 반 전하는 데 걸리는 시간보다 충분히 짧은 값으로 설정하는 것이 중요하다. 도 6b를 참조하면, 유기 강유전체 박막층의 강유전 분극량 또는 멤리스터 트랜지스터의 드레인 전류는 인가 전압 펄스의 회수가 증가함에 따라 소정의 함수 관계에 따라 증가하다가 강유전 자발분극이 완전히 정렬되는 상태에 근접해 갈수록 포화하는 경향을 가진다. 따라서, 본 발명에 따른 멤리스터 트랜지스터에서 부분적으로 정렬된 강유전 자발분극을 통해 임의의 채널 저항을 가지는 트랜지스터 소자를 구현하기 위해서는 일정 주파 수를 가지는 인가 전압 펄스를 시간을 달리하여 정해진 시간 동안 인가하거나, 일정 시간 동안 서로 다른 주 파수를 가지는 전압 펄스를 인가하면, 서로 다른 채널 저항값을 가지는 멤리스터 트랜지스터를 얻을 수 있다. 가령, 도 6a에서 PFM1이라고 표시된 비교적 저주파의 전압 펄스를 유기 강유전체 박막층에 일정 시간 인가한 경우에는 멤리스터 트랜지스터가 도 6b에서 PFM1이라고 표시된 드레인 전류값을 나타내며, PFM2라고 표시된 비교적 고주파의 전압 펄스를 유기 강유전체 박막층에 일정 시간 인가한 경우에는 PFM2라고 표시된 드레인 전 류값을 나타내게 된다. 또한 동일 멤리스터 트랜지스터에 일정한 주파수의 전압 펄스를 연속적으로 인가하면, 인가된 전압 펄스의 회수에 따라 트랜지스터의 채널 저항값을 실시간으로 연속 변경하는 것이 가능하다. 아울 러 도 6a에는 도시되지 않았으나, 반대 극성을 가지는 전압 펄스를 같은 방식으로 인가함으로써 전압 펄스 인 가 회수에 따른 강유전 자발분극량이나 멤리스터 트랜지스터의 드레인 전류의 증감 방향을 반대로 변경할 수있다. 이러한 기능을 이용하여 빈번히 접근된 소자의 저항값을 낮출 수 있고, 드물게 접근한 소자의 저항값을 높일 수 있다. 또한 자극 신호의 반복에 의해 소자의 저항값을 낮출 수 있고, 억제 신호의 반복에 의해 소자의 저 항값을 높일 수 있다. 이러한 기능이 본 발명에 따른 멤리스터 트랜지스터가 갖는 적응학습 기능이다. 도 6c를 참조하면, 본 발명에 따른 멤리스터 트랜지스터의 유기 강유전체 박막층에 전압을 인가하여, 도 5c에 도시된 바와 같이 유기 강유전체 박막층의 강유전 자발분극의 상태를 부분적으로 정렬된 상태로 만들기 위한 전압 펄스의 다른 일례를 나타낸다. 이 예에서는 동일한 크기와 주파수를 갖는 전압 펄스의 펄스 폭을 조절하 면, 정해진 회수만큼 인가되는 전압 펄스의 인가 시간을 조절할 수 있다. 이러한 인가 방법을 폭 변조 방식 (Pulse Width Modulation; PWM)이라고 한다. 이 방법에서도 역시 인가 전압의 크기가 유기 강유전체 박막층의 분극이 반전하여 일정 방향으로 정렬하기에 충분히 큰 값이고, 인가 전압의 폭이 유기 강유전체 박막층의 분 극이 반전하는 데 걸리는 시간보다 충분히 짧은 값으로 설정하는 것이 중요하다. 도 6d를 참조하면, 유기 강유전체 박막층의 강유전 분극량 또는 멤리스터 트랜지스터의 드레인 전류는 소정의 함수 관계에 의해 인가 전압의 폭 증가에 따른 총 인가 시간이 증가함에 따라 증가하다가 강유전 자발분극이 완전히 정렬되는 상태에 근접해 갈수록 포화하는 경향을 가진다. 따라서, 본 발명에 따른 멤리스터 트랜지스 터에 일정 주파수를 가지는 인가 전압 펄스를 펄스 폭을 달리하여 정해진 시간 동안 인가하면, 서로 다른 채 널 저항값을 가지는 멤리스터 트랜지스터를 얻을 수 있다. 가령, 도 6c에서 PWM1이라고 표시된 비교적 짧은 폭의 전압 펄스를 일정 시간 인가한 경우에는 멤리스터 트랜지스터가 도 6d에서 PWM1이라고 표시된 드레인 전 류값을 나타내며, PWM2라고 표시된 비교적 긴 폭의 전압 펄스를 일정 시간 인가한 경우에는 PWM2라고 표시된 드레인 전류값을 나타내게 된다. 아울러 도 6c에는 도시되지 않았으나, 반대 극성을 가지는 전압 펄스를 같은 방식으로 인가함으로써 전압 펄스 폭에 따른 강유전 자발분극량이나 멤리스터 트랜지스터의 드레인 전류의 증 감 방향을 반대로 변경할 수 있다. 도 6a 내지 6b를 통해 설명한 PFM 방식과 도 6c 내지 6d를 통해 설명한 PWM 방식을 비교하면 다음과 같다. 첫 번째, 통상적으로 집적회로를 구성하는 경우, 일정한 폭을 가지는 전압 신호를 입력 신호로 사용한다는 점 을 가정하면, 전체 시스템의 회로 구성을 간략히 하기 위해서는 PFM방식을 적용하는 것이 유리하다. 두 번째, 전압 펄스의 연속적인 인가를 통해 멤리스터 트랜지스터의 채널 저항 특성을 일정한 신호 인가 시간 동안 연속적으로 변경하기 위해서는 주파수만을 변경하여 인가 신호의 회수를 변경할 수 있는 PFM 방식을 적 용하는 것이 유리하다. 세 번째, 본 발명의 동작 원리로부터 구현되는 멤리스터 트랜지스터의 경우, 전압 펄스의 폭이 유기 강유전체 박막층의 강유전 자발분극의 분극 시간보다 충분히 짧아야 한다는 점을 고려하면, 보다 세밀한 범위에서 채널 저항값을 조절하기 위해서는 전압 펄스의 펄스 폭을 변경해야 하는 PWM 방식보다 가능한 범위에서 짧은 폭의 전압 펄스를 인가할 수 있는 PFM 방식을 적용하는 것이 보다 유리하다. 도 6a 및 도 6c에는 도시되지 않았으나, 인가 전압의 펄스 회수나 펄스 폭을 변경하지 않고 인가 전압의 진폭 을 변경하여 부분 분극반전을 실현할 수 있다. 하지만, 이미 구성된 회로 시스템 내부에서 전압 펄스의 진폭 을 변경하기 위해서는 회로 구성이 매우 복잡해질 뿐만 아니라, 실제 신경회로 시스템을 구성하는 데 있어서 매우 복잡한 설계문제를 해결해야 할 것으로 예상된다. 따라서 본 발명에서는 인가 전압의 진폭을 변경하여 본 발명에 따른 멤리스터 트랜지스터에서 적응학습 기능을 구현하는 예에 대해서는 자세히 설명하지 않기로 한다. 본 발명에 따른 산화물반도체 박막층과 유기 강유전체 박막층을 각각 반도체 채널층과 게이트 절연막층으로 이용하는 멤리스터 트랜지스터의 장점을 지금까지 제안된 다른 동작 원리를 이용하여 적응학습 기능을 구현하 는 멤리스터 트랜지스터와 비교하여 설명하면 다음과 같다. 첫 번째, 본 발명의 멤리스터 트랜지스터는 산화물반도체 박막층을 채널로 사용하는 트랜지스터 구조를 가지 고 있기 때문에 매우 우수한 온오프 특성을 확보할 수 있다. 통상적으로 양호하게 제작된 산화물반도체 기반 의 박막 트랜지스터의 온오프 비는 107~108에 달하며, 유기 강유전체 박막층과의 조합을 통해 메모리 트랜지스 터로 이용하는 경우에도 상기 온오프비를 적용할 수 있다. 더구나, 본 발명에 따른 멤리스터 트랜지스터는 온 과 오프 사이의 중간 상태를 아날로그적으로 사용하는 것을 특징으로 하기 때문에 가능한 큰 범위의 온오프 마진을 확보하는 것이 절대적으로 바람직하다. 반면, 유연 기판 위에 제작되는 유기물 기반의 일반 메모리 소자의 경우에는 온오프 마진이 수백 정도에 그치고 있어, 안정된 중간 상태를 확보하는 것은 매우 어렵다. 두 번째, 본 발명의 멤리스터 트랜지스터는 강유전체 박막층의 강유전 자발분극량에서 기인하는 정확한 동작 을 이용하기 때문에, 소자의 동작을 예측하여 전체 회로나 시스템을 설계하는 데 유리한 조건을 제공한다. 이 에 비해 산화환원, 원소의 확산과 같은 화학적인 반응을 이용하는 기존의 멤리스터 트랜지스터의 경우에는 인 가 신호의 누적에 따른 소자 특성의 변화를 정확히 예측하기 어렵다. 또한 가장 통상적인 멤리스터 트랜지스 터에 사용되고 있는 이원계 산화물 기반 소재의 경우, 그 동작원리조차 아직 완전히 규명되지 않아 소자의 동 작 안정성을 담보하는 데 결정적인 문제를 안고 있다. 세 번째, 본 발명에 따른 멤리스터 트랜지스터의 제조를 위해 제공되는 제조 방법은 모두 150℃ 이하의 저온 에서 실시하는 것이 가능하기 때문에, 통상적으로 내열 특성이 떨어지는 유연 플라스틱 기판 상에 소자를 적 용하는 데 공정상의 장점을 제공한다. 강유전체 박막층의 전계효과를 이용하는 멤리스터 트랜지스터는 이전에 도 제안된 바가 있으나, 통상적으로 산화물 형태의 소재를 사용하기 때문에 증착 공정 및 박막의 결정화 공정 에 있어서 고온의 열처리를 수반하는 문제를 가지고 있다. 도 7은 산화물반도체 박막층과 유기 강유전체 박막층을 각각 반도체 채널층과 게이트 절연막층으로 이용하여 제작한 박막 트랜지스터 소자의 드레인 전류값과 메모리 온오프비가 프로그램 동작을 위해 인가한 전압 펄스 폭의 변화에 따라 변화하는 경향을 나타낸 그래프이다. 도 7에서 도시한 결과는, 본 발명에 따른 멤리스터 트랜지스터의 적응학습기능의 구현 가능성을 보여주기 위 하여 제공되는 것으로, 실제 플라스틱 기판 위에 제작한 소자에서 얻어진 결과는 아니다. 상기 소자는 유리 기판 위에 제작되었으며, 산화물반도체 박막층은 10nm의 In-Ga-Zn-O, 유기 강유전체 박막층은 150nm의 P(VDF- TrFE) 박막을 사용하였다. 보호 절연막층으로는 4nm의 Al2O3를 사용하였으며, 소자의 구조는 도 1에서 도시한 탑게이트-버텀컨택 구조의 소자이다. 유리 기판 위에 제작되었다는 점을 제외하면 소자의 구성 소재나 제조 방법이 본 발명에서 제안된 바와 대부분 동일하여, 이 소자를 사용하여 본 발명의 멤리스터 트랜지스터의 적 응학습 기능 가능성을 검증하는 것은 충분히 유효하다고 판단할 수 있다. 도 7을 참조하면, 상기 박막 트랜지스터의 프로그램 드레인 전류는 온 상태를 구현하기 위해 인가되는 프로그 램 전압 펄스 폭이 증가할수록 증가하는 경향을 나타내며, 오프 상태를 구현하기 위해 인가되는 프로그램 전 압 펄스 폭이 증가할수록 감소하는 경향을 나타내고 있다. 즉, 도 6a 내지 도 6d에서 도시한 바와 같이 PFM 또는 PWM 방식의 전압 펄스 인가 방법을 변경함에 따라 온 상태와 오프 상태의 채널 저항값을 임의로 결정하 거나, 연속적으로 변화시키는 것이 가능하다는 것을 확인할 수 있는 결과이다. 결과적으로 인가되는 프로그램 전압 펄스 폭을 100밀리초에서 1초까지 변화시켰을 때 메모리 온오프 마진의 비가 약 3부터 400까지 변화하는 것을 알 수 있다. 여기서 주목해야 할 점은 현재 최대의 메모리 온오프 마진을 얻기 위해 필요한 프로그램 전 압 펄스 폭이 1초로 매우 긴 편이기 때문에, 약 10밀리초 정도의 짧은 전압 펄스를 연속적으로 인가한다면, 본 발명에 따른 멤리스터 트랜지스터의 동작에서 다양한 중간 상태의 채널 저항값을 실현할 수 있을 것으로 기대된다. 도 8은 본 발명의 제1 실시예에 따른 멤리스터 트랜지스터의 게이트 전압 및 드레인 전류 특성을 나타내는 그 래프이다. 도 8에 도시된 측정 결과를 나타내는 멤리스터 트랜지스터 소자는 도 1을 참조하여 설명한 제1 실시예에 따라 제조되었으며, 탑게이트-버텀컨택의 구조를 가지고 있다. 상기 소자의 실시예에서 제공된 구체적인 제조 방법 을 도 1을 참조하여 설명하면 다음과 같다. 기판은 폴리에틸렌나프탈레이트(PEN) 기판을 사용하였고, 기판 베리어절연막층는 원자층증착법으로 형성된 약 20nm 두께의 알루미늄 산화막(Al2O3)을 사용하였다. 소오스 및 드레인 전극층(104a, 104b)은 적층 구조의 Ti/Au/Ti 박막을 사용하였다. 산화물반도체 박막층은 아연 산화물(ZnO) 박막을 스퍼터링 방법으 로 150℃의 온도에서 형성하였으며, 막 두께는 10nm이다. 보호 절연막층은 원자층증착법으로 150℃의 온 도에서 형성된 6nm 두께의 알루미늄 산화막 (Al2O3)를 사용하였다. 유기 강유전체 박막층은 100nm 두께의 P(VDF-TrFE) 박막을 사용하였다. 상기 박막은 스핀코팅 방법을 적용하여 형성되었으며, 결정화 열처리 온도는 140℃이다. 상기 유기 강유전체 박막층을 식각하여 복수의 컨택 비아홀을 형성하는 식각 공정은 포 토레지스트를 식각 마스크로 이용하는 산소 플라즈마 식각 방법으로 수행되었다. 소오스 및 드레인 전극 패드 (116a, 116b), 게이트 전극패드(미도시), 상부 게이트 전극층은 Au 박막을 사용하였다.도 8을 참조하면, 유연한 PEN 플라스틱 기판 위에 제작한 멤리스터 트랜지스터는 드레인 전류(ID)의 전달특성 에서, 게이트 전압(VG)이 인가됨에 따라 강유전체 게이트 절연막의 전계효과에서 기인하는 반 시계방향의 히 스테리시스가 관측되는 것을 확인할 수 있다. 이 결과로부터 본 발명에 따른 멤리스터 트랜지스터가 유연한 플라스틱 기판 상에 제조되어, 비휘발성 메모리의 기능을 나타내는 멤리스터 소자로서 기능할 수 있음을 확인 할 수 있다. 본 발명의 명세서에 개시된 실시예들은 본 발명을 한정하는 것이 아니다. 본 발명의 범위는 아래의 특허청구 범위에 의해 해석되어야 하며, 그와 균등한 범위 내에 있는 모든 기술도 본 발명의 범위에 포함되는 것으로 해석해야 할 것이다."}
{"patent_id": "10-2010-0130290", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 제1 실시예에 따른 멤리스터 트랜지스터의 단면도, 도 2는 본 발명의 제2 실시예에 따른 멤리스터 트랜지스터의 단면도, 도 3은 본 발명의 제3 실시예에 따른 멤리스터 트랜지스터의 단면도, 도 4는 본 발명의 제4 실시예에 따른 멤리스터 트랜지스터의 단면도, 도 5a 내지 도 5c는 본 발명에 따른 멤리스터 트랜지스터가 메모리 기능과 적응학습 기능을 발현하는 동작 원 리를 설명하는 모식도, 도 6a 내지 도 6d는 본 발명에 따른 멤리스터 트랜지스터의 적응학습 기능을 구현하기 위한 전압의 인가 조건 및 전압 인가에 따른 강유전 자발분극과 트랜지스터 드레인 전류의 상관관계를 모식적으로 나타낸 도면, 도 7은 산화물반도체 박막층과 유기 강유전체 박막층을 각각 반도체 채널층과 게이트 절연막층으로 이용하여 제작한 박막 트랜지스터 소자의 드레인 전류값과 메모리 온오프비가 프로그램 동작을 위해 인가한 전압 펄스 폭의 변화에 따라 변화하는 경향을 나타낸 그래프, 도 8은 본 발명의 제1 실시예에 따른 멤리스터 트랜지스터의 게이트 전압 및 드레인 전류 특성을 나타내는 그 래프이다."}
