{"patent_id": "10-2022-0118566", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0039785", "출원번호": "10-2022-0118566", "발명의 명칭": "CCTV 객체 검출 모델 최적화 장치 및 방법", "출원인": "한국전자통신연구원", "발명자": "최윤원"}}
{"patent_id": "10-2022-0118566", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "외부 영상을 수집하는 이미지 센싱부;객체 검출 모델을 이용하여 상기 외부 영상에서 객체를 검출하는 객체 검출부;배경 정보 및 메타 정보를 생성하여 서버로 전달하는 메타정보 송신부; 및상기 서버에서 재학습된 객체 검출 모델 정보를 수신하여 상기 객체 검출 모델을 갱신하는 검출 모델 갱신부를포함하고,상기 서버는 전달받은 배경 정보와 메타정보에 기초하여 데이터베이스를 생성하는 데이터베이스 생성부; 및생성된 상기 데이터베이스에 기초하여 재학습된 객체 검출 모델을 생성하고생성된 상기 재학습된 객체 검출 모델을 상기 객체검출부로 송신하는 재학습부를 포함하고,상기 배경정보는 싱가 이미지 센싱부가 부착된 CCTV가 설치된 위치, 시간, 및 날씨에 기초하여 생성되는 배경모델이고,상기 메타 정보는 상기 검출된 객체에 대한 아이디, 객체 클래스, 위치 정보, 정밀지도상의 좌표정보, 검출 시간, 날씨 정보 중 적어도 하나를 포함하는 것인 CCTV 객체 검출 모델 최적화 장치."}
{"patent_id": "10-2022-0118566", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명에 따른 CCTV 객체 검출 모델 최적화 장치는 외부 영상을 수집하는 이미지 센싱부, 객체 검출 모델을 이 용하여 상기 외부 영상에서 객체를 검출하는 객체 검출부, 배경 정보 및 메타 정보를 생성하여 서버로 전달하는 메타정보 송신부 및 상기 서버에서 재학습된 객체 검출 모델 정보를 수신하여 상기 객체 검출 모델을 갱신하는 검출 모델 갱신부를 포함하고, 상기 서버는 전달받은 배경 정보와 메타정보에 기초하여 데이터베이스를 생성하는 데이터베이스 생성부 및 생성된 상기 데이터베이스에 기초하여 재학습된 객체 검출 모델을 생성하고생성된 상기 재학습된 객체 검출 모델을 상기 객체검출부로 송신하는 재학습부를 포함한다."}
{"patent_id": "10-2022-0118566", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 CCTV용 객체검출 장치 및 방법에 관한 것으로, 상세하게는 인공지능을 이용한 CCTV용 객체검출 모델 의 최적화 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2022-0118566", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "CCTV 촬영 영상 분석 시 인공지능 기반 영상분석 기술을 적용하는 연구가 활발하다. 특히 인공지능 객체 검출 기술이 적용된 CCTV를 이용하여 도 1에서 나타내어진 바와 같이 산불 감시, 유해조수감시, 역주행방지, 터널 안 전감시 등에 활용하는 수요가 증대하고 있다. 종래 인공지능 객체 검출 기술이 적용된 CCTV에 사용하는 객체 검출 모델은 목적으로 하는 기능을 수행하기 위 해 선택된 일반적인 데이터셋을 활용하여 학습된 결과를 이용하여 생성된다. 그러나 도 2에 나타내어진 바와 같 이 일반적인 데이터셋은 현장의 뷰(view)와 전혀 다르게 정면의 근접한 곳에서 촬영된 뷰를 가지는 이미지 및/ 또는 특정 부위만의 뷰를 가진 이미지로 구성되어 있기 때문에 객체 검출시 오검출이나 미검출이 많은 문제점을 가지게 된다. 이와 같은 이유로 일반적인 인공지능 CCTV에 사용된 검출 모델은 설치 이후에 현장에 맞는 데이터셋을 추가로 활용하여 최적화하는 과정을 통하여 객체 검출시의 오검출 및/또는 미검출 문제를 해소해주는 것이 필수적인데, 종래의 인공지능 객체 검출 기술이 적용된 CCTV(이하 인공지능 객체 검출 CCTV라 칭함)에서는 일반적인 데이터 를 기반으로 생성된 인공지능 객체 검출 모델을 최적화하고 업데이트할 때 어려움이 많다. 즉, 원활한 업데이트 를 위해 필요한 통신 환경 구축에 있어 인공지능 객체 검출 CCTV가 도서 산간, 외지, 터널, 숲 등에 설치되기 때문에 유무선 네트워크 설치에 어려움이 많고 LTE, 5G 같은 이동통신 시스템을 이용하는 경우 비용문제 등으로 경제적인 문제가 있으므로 인공지능 객체 검출 모델을 최적화하고 업데이트하기가 용이하지 않은 문제가 있다."}
{"patent_id": "10-2022-0118566", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상기와 같은 문제점을 해결하기 위한 본 발명의 목적은, 고속 네트워크와 온라인 지원을 받기 힘든 도서산간 등 의 외지에 설치된 인공지능 객체 검출 CCTV가 설치된 지역의 배경 정보와 검출된 객체 메타 정보를 원격 서버로 전달하고, 원격 서버에서 그에 기초하여 CCTV 설치 위치에 최적화된 가상 데이터 베이스를 생성하고 객체 검출 모델을 재학습한 후 재학습된 객체 검출 모델을 인공지능 객체 검출CCTV로 전달하여 인공지능 객체 검출 CCTV의 객체 검출 모델의 성능을 최적화하는 장치 및 방법을 제공하는 데 있다. 본 발명의 목적은 이상에서 언급한 목적으로 제한되지 않으며, 언급되지 않은 또 다른 목적들은 아래의 기재로 부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0118566", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위한 본 발명의 일 실시예에 따른 CCTV 객체 검출 모델 최적화 장치는 외부 영상을 수집 하는 이미지 센싱부, 객체 검출 모델을 이용하여 상기 외부 영상에서 객체를 검출하는 객체 검출부, 배경 정보 및 메타 정보를 생성하여 서버로 전달하는 메타정보 송신부 및 상기 서버에서 재학습된 객체 검출 모델 정보를 수신하여 상기 객체 검출 모델을 갱신하는 검출 모델 갱신부를 포함하고, 상기 서버는 전달받은 배경 정보와 메 타정보에 기초하여 데이터베이스를 생성하는 데이터베이스 생성부 및 생성된 상기 데이터베이스에 기초하여 재 학습된 객체 검출 모델을 생성하고생성된 상기 재학습된 객체 검출 모델을 상기 객체검출부로 송신하는 재학습 부를 포함하고, 상기 배경정보는 싱가 이미지 센싱부가 부착된 CCTV가 설치된 위치, 시간, 및 날씨에 기초하여 생성되는 배경모델이고, 상기 메타 정보는 상기 검출된 객체에 대한 아이디, 객체 클래스, 위치 정보, 정밀지도 상의 좌표정보, 검출 시간, 날씨 정보 중 적어도 하나를 포함한다."}
{"patent_id": "10-2022-0118566", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하면, 도서산간 등의 외지에 설치되어 고속 네트워크와 온라인 지원을 받기 힘든 인공지능 객체 검 출 CCTV에서 배경정보와 검출된 객체의 메타정보를 포함하는 최소한의 데이터를 이용하여 가상의 데이터베이스 를 원격 서버에 생성하고, 이에 기초하여 재학습된 객체 검출 모델을 인공지능 객체 검출 CCTV에서 이용하게 하 는 방식으로 인공지능 객체 검출 CCTV의 객체 검출 모델을 최적화할 수 있다."}
{"patent_id": "10-2022-0118566", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변경을 가할 수 있고 여러 가지 실시예를 가질 수 있는 바, 몇몇 실시예들을 도면에 예시하고 상세하게 설명하고자 한다. 그러나, 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명 의 권리범위는 실시예들로부터 관련되는 본 발명의 기술적 사상에 속하는 모든 변경, 변형, 균등물 내지 대체물 을 포함하는 것으로 이해되어야 한다. 제1, 제2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소들은 상기 용어들에 의 해 한정되어서는 안 된다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된 다. 및/또는 이라는 용어는 복수의 관련된 기재된 항목들의 조합 또는 복수의 관련된 기재된 항목들 중의 어느항목을 포함한다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급 된 때에만, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 본 출원에서 사용한 용어는 단지 제시되는 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도 가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포 함하다\" 또는 \"가지다\" 등의 용어는 명세서 상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조 합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 출원에서 사용된 \"상기\" 및 이와 유사한 지시어는 단수 및 복수 모두를 지시하는 것일 수 있다. 또한 본 개 시에 따른 방법을 설명하는 단계의 순서를 명백하게 지정하는 기재가 없다면, 기재된 단계들은 목적하는 바를 수행하기 위한 순서로 행해질 수 있다. 기재된 단계들의 기재 순서에 따라 본 개시가 한정되는 것은 아니다. 기술적이거나 과학적인 용어를 포함해서 본 명세서에서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에 서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있으며, 이상적이거나 과도 하게 축소된 형식적인 의미로 해석되지 않아야 할 것이며, 본 명세서에서 어떤 용어의 의미를 정의할 경우 해 용어는 그 정의된 대로 해석되어야 한다. 이하, 첨부한 도면들을 참조하여, 본 발명의 바람직한 실시예를 보다 상세하게 설명하고자 한다. 본 발명을 설 명함에 있어 전체적인 이해를 용이하게 하기 위하여 도면상의 동일한 구성요소에 대해서는 동일한 참조부호를 사용하고 동일한 구성요소에 대해서 중복된 설명은 생략한다. 본 발명은 도서산간 등의 외지에 설치되어 고속 네트워크와 온라인 지원을 받기 힘든 인공지능 객체 검출 CCTV 의 객체 검출 모델을 최적화하기 위해 인공지능 객체 검출 CCTV의 객체 검출부에서 검출된 메타 정보와 인공지 능 객체 검출 CCTV의 설치 정보와 누적된 배경 이미지에서 추출한 배경 정보를 서버로 전송하고, 서버에서 이에 기초하여 객체 검출 모델을 재학습하고, 이 재학습된 인공지능 객체 검출CCTV에서 업데이트 되도록 하는 인공지 능 객체 검출 CCTV의 객체 검출 모델을 최적화하는 구성을 요지로 한다. 도 3은 본 발명의 일 실시예에 따른 인공지능 객체 검출 CCTV의 객체 검출 모델 최적화 장치를 나타내는 구성도 이다. 도 3을 참조하면, 본 발명의 일 실시예에 따른 인공지능 객체 검출 CCTV의 객체 검출 모델 최적화 장치는 외부 영상을 수집하는 이미지 센싱부, 수집된 외부 영상에서 객체 검출 모델을 이용하여 객체를 검출하는 객체 검출부, CCTV 설치 정보에 기초하여 생성된 배경 정보 및 객체 검출 정보를 서버로 전달하는 메 타정보 송신부, 서버에서 재학습된 객체 검출 모델 정보(후술할 갱신된 가중치 정보)를 수신하여 객체 검 출 모델을 갱신하는 검출 모델 갱신부를 포함한다. 본 발명의 일 실시예에 따른 인공지능 객체 검출 CCTV의 객체 검출 모델 최적화 장치의 이미지 센싱부 는 CCTV 카메라 렌즈를 통해 들어온 빛(촬영한 영상 정보)을 전기적 신호(디지털 정보)로 변환해주는 장치 로 필름 카메라의 필름과 같은 역할을 한다. 본 발명의 이미지 센싱부는 전하결합소자(Charge-Coupled Device;CCD)와 상보성금속산화물 반도체(complementary metal-oxide-semiconductor; CMOS) 방식의 이미지 센서 로 구현될 수 있다(그러나 이에 한정되지 않고 어떠한 방식의 이미지 센서로도 구현될 수 있다). 본 발명의 일 실시예에 따른 인공지능 객체 검출 CCTV의 객체 검출 모델 최적화 장치의 객체 검출부 는 이미지 센싱부가 센싱한 외부 영상(정지영상 또는 동영상 방식 모두 가능)에 대해 인공지능 기반의 객 체 검출 모델(인공지능 객체 검출 모델이라 칭함)을 적용하여 객체를 검출한다. 객체 검출이란 정지영상 또는 동영상에서 사람, 동물, 차량과 같은 객체를 검출하는 것을 의미한다. 본 발명의 객체 검출부에 사용되는 객체 검출 알고리즘에서는 대상으로 하는 객체를 탐지하고, 해당 객체를 중심으로경계 박스를 표시해서 구분하는 방식으로 구현될 수 있고, CNN (Convolutional Neural Network), YOLO (You only Look Once), SSD(Single Shot MultiBox Detector) 등과 같은 딥러닝 인공지능 기반 객체 검출 기술을 이 용하여 객체를 검출할 수 있다. 본 발명의 일 실시예에 따른 인공지능 객체 검출 CCTV의 객체 검출 모델 최적화 장치의 메타정보 송신부 는 CCTV 설치 정보에 기초하여 생성된 배경 정보 및 객체 검출 정보인 메타 정보를 서버로 전달한다. CCTV 설치 정보는 본 발명의 인공지능 객체 검출 CCTV가 설치된 위치(GPS 좌표), 설치 방향, 설치 높이, 이미지 센서 종류 등에 대한 정보를 포함한다. 보다 구체적으로는, 본 발명의 메타정보 송신부는 배경 모델을 생성하고, 생성된 배경 모델을 기반으로 생 성한 배경 이미지에 대한 정보인 배경 정보와 객체 검출부에서 검출한 객체에 대한 객체 검출 정보와 기타 정보를 합친 메타 정보를 서버로 전송하는 역할을 한다(배경 모델 생성은 객체 검출부에 의해서도 수 행되거나, 객체 검출부 및 메타정보 송신부 모두에 의해서 수행되도록 구현될 수 있다). 여기서, 배경모델은 인공지능 객체 검출 CCTV가 설치된 장소의 다양한 상황에 대한 배경을 의미하며, 본 발명의 메타정보 송신부는 인공지능 객체 검출 CCTV가 설치된 장소의 계절(봄,여름 등), 시간(주간, 야간, 일몰 시간 등), 및 날씨(눈,비, 맑음)를 고려하여 현재 인공지능 객체 검출 CCTV의 상황에 맞는 배경 모델을 생성한 다. 본 발명의 메타정보 송신부는 이미지 센싱부에 의해 센싱된 배경 이미지를 일정 시간 동안 누적하고, 배경 이미지들간 영상 프레임의 차이 나는 부분을 없애는 방식으로 배경 이미지를 검출한다. 보다 구체적으로는 본 발명의 메타정보 송신부는 도 4에 나타내어진 바와 같은 절차를 통해 배경 정보를 생성하고 서버로 송신한다. 메타정보 송신부는 이미지 센싱부에 의해 센싱된 이미지에 배경 모 델을 기반으로 생성된 배경 이미지가 입력되면(S410), 메타정보 송신부는 이를 누적한다(S420). 이후 메타 정보 송신부는 누적 기준에 도달했는지 판단하고(S430), 누적 기준에 도달하면(S430의 예) 배경모델을 갱 신한다(S440). 이후 메타정보 송신부는 배경 모델을 검증하고(S450) 배경 이미지를 추출한다(S450). 구체적으로는 배경 모델 검증은 배경 이미지의 시간과 날씨 등의 환경 정보를 기반으로 서로 교차 검증하는 방식으로 검증하고, 검 증된 배경모델에 기초하여 배경 이미지와 차이가 가장 작은 대표 이미지를 배경 이미지로 결정하고 이를 추출한 다. 이후 추출된 배경 이미지를 배경 정보로서 서버로 송신한다(S470). 한편, CCTV가 설치된 장소의 날씨, 시간과 계절에 따라서 배경의 기본 형태가 많이 달라지기 때문에 본 발명의 메타정보 송신부는 시간과 날씨 정보가 입력되면(S480) 이에 기초하여 배경 필터를 생성하고(S490) 배경 모델을 초기화한다(S495). 초기화된 배경모델을 이용하여 메타정보 송신부은 배경 정보 추출 및 송신 과정 을 수행한다. 본 발명의 메타정보 송신부는 전술한 바와 같이 추출한 배경 정보와 객체 검출부에서 검출한 객체에 대한 객체 검출 정보와 기타 정보를 합친 메타 정보를 생성하고 이를 서버로 송신한다. 메타 정보는 도 5에 나타내어진 바와 같이 객체 검출부에서 전달받은 객체에 대한 정보를 기반으로 각 객 체에 대한 ID, 객체 클래스 정보(차량 클래스, 보행자 클래스, 개 클래스 등등), 이미지 내 객체의 위치 정보 (이미지 내 객체의 좌표(x좌표, y좌표), 폭, 높이 등), 정밀 지도상 객체 좌표 정보(일례로 GIS(Geographic Information System) 위치 정보), 객체 검출 시간 정보, 날씨 정보를 포함한다. 메타 정보는 텍스트 형태로 구 현될 수 있다. 편의상 클래스 정보와 위치 정보를 객체 검출 정보로 칭하고 나머지 정보를 기타 정보로 칭한다. 한편, 본 발명의 서버의 데이터베이스 생성부는 도 6에 나타내어진 바와 같이 본 발명의 메타정보 송 신부에서 전송한 배경 정보와 메타 정보의 클래스에 해당하는 샘플 데이터(보행자, 차량 등 각각의 객체의 클래스 맞는 임의의 객체를 의미함)를 배경 이미지 내 위치 정보에 붙이는 방식으로 가상의 데이터베이스를 생 성한다. 본 발명의 서버의 재학습부는 데이터베이스 생성부로부터 전달받은 배경 정보와 샘플 데이터를 이용하여 객체 검출 모델 재학습을 수행한다. 본 발명의 재학습부는 전달받은 배경 정보가 날씨별 및 시간 별로 구성이 되어 있고, 부가되는 샘플 데이터는 배경에 큰 영향을 주지 않는 형태로 구성되므로 객체 검출 모 델 재학습을 수행하여 객체 검출 감지 성능이 최적화된 객체 검출 모델을 얻을 수 있다. 본 발명의 재학습부는 객체 검출 모델 재학습을 통하여 생성된 감지 성능이 최적화된 객체 검출 모델의 가 중치 정보를 본 발명의 객체모델 갱신부로 전송한다. 본 발명의 객체모델 갱신부는 수신한 가중치 정 보를 이용하여 현재 메모리에 탑재되어 있는 인공지능 객체 검출 모델을 해제하고 수신한 갱신된 새로운 가중치 파일 기반의 인공지능 객체 모델을 메모리에 탑재하는 방식으로 인공지능 객체 검출 모델을 갱신한다. 이후 객 체 검출부가 갱신된 인공지능 객체 모델을 이용하여 객체를 검출한다. 이를 통해 인공지능 CCTV의 객체 검 출 성능을 개선할 수 한다. 도 7은 도 3의 객체 검출 모델 최적화 장치를 이용한 본 발명의 일 실시예에 따른 인공지능 객체 검출 CCTV의 객체 검출 모델 최적화 방법을 나타내는 흐름도이다. 이미지 센싱부에 의해 CCTV가 설치된 곳의 외부 이미지를 센싱하는 방식으로 외부 영상을 수집한다(S610). 객체 검출부에 의해 객체 검출 모델을 이용하여 외부 영상에서 객체를 검출한다(S720). 메타정보 송신부에 의해 메타 정보 및 배경 정보를 생성하고(S730), 생성된 메타 정보와 배경 정보를 서버 의 데이터베이스 생성부로 전송한다(S740). 서버의 데이터베이스 생성부는 메타정보 송신부에서 전송한 배경 정보와 메타 정보의 클래스에 해당하는 샘플 데이터(보행자, 차량 등등의 객체)를 배경 이미지 내 위치 정보에 붙이는 방식으로 데이터베이스 를 생성하고, 서버의 재학습부는 데이터베이스 생성부로부터 전달받은 배경 이미지와 샘플 데이 터를 이용하여 객체 검출 모델 재학습을 수행하여 감지 성능이 최적화된 객체 검출 모델을 생성하고, 갱신된 객 체 검출 모델의 가중치 파일을 객체모델 갱신부로 전송한다. 객체모델 갱신부가 가중치 정보를 수신하면(S750) 이를 이용하여 현재 메모리에 탑재되어 있는 인공지능 객체 검출 모델을 해제하고 갱신된 새로운 가중치 파일 기반의 인공지능 객체 모델을 메모리에 탑재해서 인공지 능 객체 검출 모델을 갱신한다(S760). 객체 검출부는 이 갱신된 인공지능 객체 검출 모델을 이용하여 객체 를 검출한다. 이상의 실시예들은 하나 이상의 프로세서, 메모리, 및 저장수단을 포함하는 다양한 형태의 컴퓨팅 수단을 이용 하여 구현될 수 있다. 또한 유무선 네트워크에 연결된 네트워크 인터페이스를 포함할 수 있다. 상기 프로세서는 메모리 및/또는 저장 유닛에 저장된 처리 명령어를 실행하는 중앙 처리 유닛 또는 반도체 장치일 수 있다. 상기 메모리 및 상기 저장 유닛은 휘발성 저장 매체 또는 비 휘발성 저장 매체를 포함할 수 있다. 예컨대, 상기 메모 리는 ROM 및 RAM을 포함할 수 있다. 따라서, 본 발명의 실시예들은 컴퓨터로 구현하는 방법 또는 상기 컴퓨터상 에 저장된 컴퓨터 실행 가능 명령어를 가진 비(non)-일시적 컴퓨터 판독 가능 매체로서 구현될 수 있다. 본 발 명의 일 실시예에서, 프로세서에 의해 실행될 때, 컴퓨터 판독 가능 명령은 본 발명의 적어도 한 양태에 따른 방법을 수행할 수 있다. 이상, 본 발명의 바람직한 실시예를 통해 본 발명의 구성에 대하여 상세히 설명하였다. 그러나 전술한 실시예는"}
{"patent_id": "10-2022-0118566", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "예시에 불과한 것으로서, 본 발명의 권리범위를 제한하지 아니한다. 본 발명의 기술분야에 통상의 지식을 가진 자라면 본 명세서의 교시와 시사로부터 본 발명의 기술적 사상의 범주내의 다양한 변형과 변경이 가능할 것이다. 예컨대, 객체 검출부 및 검출모델 갱신부는 하나의 모듈로 통합되어 구현되거나 또는 둘이나 그 이상의 장치로 분할하여 구현될 수 있다. 따라서, 본 발명의 보호범위는 이하의 특허청구범위의 기재에 의하 여 정하여짐이 마땅하다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7"}
{"patent_id": "10-2022-0118566", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 종래 기술의 따른 인공지능 객체 검출 CCTV의 설치예를 나타내는 도면이다. 도 2는 종래 기술의 따른 인공지능 객체 검출 CCTV에서 사용하는 일반적인 데이터셋과 실제 현장 뷰의 일례를 나타내는 도면이다. 도 3은 본 발명의 일 실시예에 따른 인공지능 객체 검출 CCTV의 객체 검출 모델 최적화 장치를 나타내는 구성도 이다. 도 4는 본 발명의 일 실시예에 따른 인공지능 객체 검출 CCTV의 객체 검출 모델 최적화 장치에서의 배경 이미지 추출 방법을 나타내는 흐름도이다. 도 5는 본 발명의 일 실시예에 따른 인공지능 객체 검출 CCTV의 객체 검출 모델 최적화 장치에서의 메타 정보를 나타내는 개념도이다. 도 6은 본 발명의 일 실시예에 따른 서버의 데이터베이스 생성부의 동작을 나타내는 개념도이다. 도 7은 본 발명의 일 실시예에 따른 인공지능 객체 검출 CCTV의 객체 검출 모델 최적화 방법을 나타내는 흐름도 이다."}
