{"patent_id": "10-2021-0164122", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0077162", "출원번호": "10-2021-0164122", "발명의 명칭": "생활 주변 대기 환경 관측 장치 및 방법", "출원인": "한국건설기술연구원", "발명자": "장봉주"}}
{"patent_id": "10-2021-0164122", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "주변 대기환경데이터와 기상데이터를 측정하는 다수의 환경 센서들을 포함하는 하나 이상의 센서 모듈; 및도로에서 이동 중인 이동 객체의 통행량과 상기 하나 이상의 센서 모듈로부터 입력되는 주변 대기환경데이터 간의 상관도를 산출하고, 상기 산출된 상관도와 기상데이터와 이동 객체의 통행량을 바탕으로 주변 대기질의 오염원인을 분석하는 제어 모듈;을 포함하는 거점형 생활 주변 대기 환경 관측 장치."}
{"patent_id": "10-2021-0164122", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제어 모듈은,상기 하나 이상의 센서 모듈과 유무선 통신하는 통신 인터페이스부;상기 제어 모듈의 위치 정보를 제공하는 GPS(Global Positioning System)부;상기 도로의 주변을 촬영하여 촬영 영상을 출력하는 비젼 센서;상기 비젼 센서로부터 제공되는 촬영 영상을 인공지능 모델에 입력하여 프레임단위로 이동 객체와 상기 이동 객체의 종류를 인식하는 AI(Artificial Intelligence) 가속부; 및상기 AI 가속부에서 인식되는 이동 객체의 종류별 통행량과 상기 주변 대기환경데이터 간의 상관도를 산출하고,상기 산출된 상관도와 상기 기상데이터와 상기 이동 객체의 종류 별 통행량을 바탕으로 주변 대기질의 오염 원인을 분석하는 프로세서;를 포함하는 것을 특징으로 하는 거점형 생활 주변 대기 환경 관측 장치."}
{"patent_id": "10-2021-0164122", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 AI 가속부는,상기 비젼 센서로부터 제공되는 촬영 영상을 인공지능 모델에 입력하여 프레임단위로 상기 이동 객체와 이동 객체의 종류를 인식하고, 상기 인식된 이동 객체에게 객체 번호를 부여하며, 상기 객체 번호는 상기 인식된 이동 객체의 종류에 해당하는 분류번호와 연속된 프레임들에서 인식되는 이동 객체가 동일한 이동 객체인지를 구별하기 위한 식별번호로 이루어진 것을 특징으로 하는 거점형 생활 주변 대기환경 관측 장치."}
{"patent_id": "10-2021-0164122", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 프로세서는,상기 AI 가속부에서 인식되는 이동 객체들을 종류별로 단위집계시간동안 누적카운팅하여 이동 객체의 종류별 통행량을 산출하는 통행량 산출부;공개특허 10-2023-0077162-3-상기 단위집계시간동안 측정되는 주변 대기환경데이터에 대한 평균(이하, '주변 대기질 평균'이라 한다)을 산출하는 평균 대기질 산출부; 및상기 산출된 이동 객체의 종류별 통행량과 주변 대기질 평균 간의 상관도를 산출하는 상관도 산출부;를 포함하는 것을 특징으로 하는 거점형 생활 주변 대기 환경 관측 장치."}
{"patent_id": "10-2021-0164122", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 센서 모듈이 다수 구비되는 경우, 다수의 센서 모듈들 각각은 정해진 거리만큼 이격되어 구비되고, 상기 제어 모듈과 각각 유무선 통신 가능하도록 연결되며,상기 제어 모듈은, 상기 다수의 센서 모듈들 각각으로부터 획득되는 주변 대기환경데이터와 기상데이터를 기초로 상기 다수의 센서모듈들 각각의 주변 대기질의 오염 원인을 분석하는 것을 특징으로 하는 거점형 생활 주변 대기 환경 관측장치."}
{"patent_id": "10-2021-0164122", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "다종 이동수단에 탑재되고, 주변 대기환경데이터와 기상데이터를 측정하는 다수의 환경 센서들을 포함하는 하나이상의 센서 모듈; 및다종 이동수단에 탑재되고, 상기 측정된 주변 대기환경데이터가 위험 수준에 도달하면 주변을 촬영한 촬영 영상을 분석하여 대기오염 발생 원인을 예측하는 제어 모듈;을 포함하는 모빌리티형 생활 주변 대기 환경 관측 장치."}
{"patent_id": "10-2021-0164122", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 제어 모듈은,상기 도로의 주변을 촬영하여 촬영 영상을 출력하는 비젼 센서;상기 하나 이상의 센서 모듈과 유무선 통신하는 통신 인터페이스부;상기 제어 모듈의 위치 정보를 제공하는 GPS(Global Positioning System)부;상기 비젼 센서로부터 제공되는 촬영 영상을 인공지능 모델에 입력하여 프레임단위로 이동 객체와 상기 이동 객체의 종류를 인식하고, 상기 측정된 주변 대기환경데이터가 기설정된 위험 수준에 해당하여 대기오염 발생 이벤트가 발생하는 경우, 상기 대기오염 발생 이벤트가 발생한 지점의 전후에 촬영된 촬영 영상을 분석하여 대기오염 발생 원인으로 사전에 학습된 대기오염 원인 객체가 존재하는지 판단하고, 존재하는 것으로 판단되면 대기오염 원인 이벤트를 발생하는 AI(Artificial Intelligence) 가속부; 및상기 하나 이상의 센서 모듈에서 측정된 주변 대기환경데이터가 기설정된 위험 수준에 해당하면 대기오염 발생이벤트를 발생하여 상기 AI 가속부로 전달하고, 상기 AI 가속부에서 판단되는 대기오염 원인 이벤트의 식별코드와 상기 대기오염 원인 이벤트가 검출된 촬영 영상을 저장부에 저장하거나 대기질 관제 서버로 전송하도록 처리하는 프로세서;를 포함하는 것을 특징으로 하는 모빌리티형 생활 주변 대기 환경 관측 장치.공개특허 10-2023-0077162-4-청구항 8 제7항에 있어서,상기 AI 가속부는,상기 비젼 센서로부터 제공되는 촬영 영상을 인공지능 모델에 입력하여 프레임단위로 상기 이동 객체와 이동 객체의 종류를 인식하고, 상기 인식된 이동 객체에게 객체 번호를 부여하며, 상기 객체 번호는 상기 인식된 이동객체의 종류에 해당하는 분류번호와 연속된 프레임들에서 동일한 이동 객체인지를 구별하기 위한 식별번호로 이루어진 것을 특징으로 하는 모빌리티형 생활 주변 대기 환경 관측 장치."}
{"patent_id": "10-2021-0164122", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "(A) 다수의 환경 센서들을 포함하는 하나 이상의 센서 모듈이, 주변 대기환경데이터와 기상데이터를 측정하여하기 제어 모듈로 전송하는 단계;(B) 제어 모듈이, 도로에서 이동 중인 이동 객체의 통행량과 상기 (A) 단계에서 측정되는 주변 대기환경데이터간의 상관도를 산출하는 단계; 및(C) 상기 제어 모듈이, 상기 (B) 단계에서 산출된 통행량과 상관도, 그리고, 상기 (A) 단계에서 측정된 기상데이터를 바탕으로 주변 대기질의 오염 원인을 분석하는 단계;를 포함하는 거점형 생활 주변 대기 환경 관측 방법."}
{"patent_id": "10-2021-0164122", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 (B) 단계는,(B1) 상기 도로의 주변을 촬영하여 촬영 영상을 출력하는 단계;(B2) 상기 촬영 영상을 인공지능 모델에 입력하여 프레임단위로 이동 객체와 상기 이동 객체의 종류를 인식하는단계; 및(B3) 상기 (B2) 단계에서 인식되는 이동 객체의 종류별 통행량과 상기 주변 대기환경데이터 간의 상관도를 산출하는 단계;를 포함하는 것을 특징으로 하는 거점형 생활 주변 대기 환경 관측 방법."}
{"patent_id": "10-2021-0164122", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 (B2) 단계는,상기 비젼 센서로부터 제공되는 촬영 영상을 인공지능 모델에 입력하여 프레임단위로 상기 이동 객체와 이동 객체의 종류를 인식하고, 상기 인식된 이동 객체에게 객체 번호를 부여하며, 상기 객체 번호는 상기 인식된 이동 객체의 종류에 해당하는 분류번호와 연속된 프레임들에서 동일한 이동 객체인지를 구별하기 위한 식별번호로 이루어진 것을 특징으로 하는 거점형 생활 주변 대기 환경 관측 방법."}
{"patent_id": "10-2021-0164122", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항에 있어서,상기 (B3) 단계는,공개특허 10-2023-0077162-5-(B31) 상기 (B2) 단계에서 인식되는 이동 객체들을 종류별로 단위집계시간동안 누적카운팅하여 이동 객체의 종류별 통행량을 산출하는 단계;(B32) 상기 단위집계시간동안 측정되는 주변 대기환경데이터에 대한 평균(이하, '주변 대기질 평균'이라 한다)을 산출하는 단계; 및(B33) 상기 산출된 이동 객체의 종류별 통행량과 주변 대기질 평균 간의 상관도를 산출하는 단계;를 포함하는 것을 특징으로 하는 거점형 생활 주변 대기 환경 관측 방법."}
{"patent_id": "10-2021-0164122", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제9항에 있어서,상기 센서 모듈이 다수 구비되는 경우, 다수의 센서 모듈들 각각은 정해진 거리만큼 이격되어 구비되고, 상기 제어 모듈과 각각 유무선 통신 가능하도록 연결되며,상기 제어 모듈은, 상기 다수의 센서 모듈들 각각으로부터 획득되는 주변 대기환경데이터와 기상데이터를 기초로 상기 다수의 센서모듈들 각각의 주변 대기질의 오염 원인을 분석하는 것을 특징으로 하는 거점형 생활 주변 대기 환경 관측방법."}
{"patent_id": "10-2021-0164122", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "(A) 다수의 환경 센서들을 포함하는 하나 이상의 센서 모듈이, 주변 대기환경데이터와 기상데이터를 측정하여하기 제어 모듈로 전송하는 단계;(B) 제어 모듈이, 상기 (A) 단계에서 측정된 주변 대기환경데이터가 위험 수준에 도달하면 주변을 촬영한 촬영영상을 분석하여 대기오염 발생 원인을 예측하는 단계;를 포함하고,상기 하나 이상의 센서 모듈과 제어 모듈은 다종 이동수단에 물리적으로 분리되어 탑재되는 모빌리티형 생활 주변 대기 환경 관측 방법."}
{"patent_id": "10-2021-0164122", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 (B) 단계는,(B1) 상기 도로의 주변을 촬영하여 촬영 영상을 출력하는 단계;(B2) 상기 촬영 영상을 인공지능 모델에 입력하여 프레임단위로 이동 객체와 상기 이동 객체의 종류를 인식하는단계;(B3) 상기 (A) 단계에서 측정된 주변 대기환경데이터가 기설정된 위험 수준에 해당하여 대기오염 발생 이벤트가발생하면, 상기 대기오염 발생 이벤트가 발생한 지점의 전후에 촬영된 촬영 영상을 분석하여 대기오염 발생 원인으로 사전에 학습된 대기오염 원인 객체가 존재하는지 판단하고, 존재하는 것으로 판단되면 대기오염 원인 이벤트를 발생하는 단계; 및(B4) 상기 (B3) 단계에서 판단되는 대기오염 원인 이벤트의 식별코드와 상기 대기오염 원인 이벤트가 검출된 촬영 영상을 저장하거나 대기질 관제 서버로 전송하도록 단계;를 포함하는 것을 특징으로 하는 모빌리티형 생활 주변 대기 환경 관측 방법.공개특허 10-2023-0077162-6-"}
{"patent_id": "10-2021-0164122", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "생활주변 대기환경 감시 장치 및 방법이 제공된다. 하나 이상의 센서 모듈은 주변 대기환경데이터와 기상데이터 를 측정하는 다수의 환경 센서들을 포함하고, 제어 모듈은 도로에서 이동 중인 이동 객체의 통행량과 상기 하나 이상의 센서모듈로부터 입력되는 주변 대기환경데이터 간의 상관도를 산출하고, 상기 산출된 상관도와 기상데이 터와 이동 객체의 통행량을 바탕으로 주변 대기질의 오염 원인을 분석할 수 있다."}
{"patent_id": "10-2021-0164122", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 생활주변 대기환경 감시 장치 및 방법에 관한 것으로서, 보다 상세하게는, 거점형 단말 또는 모빌리 티형 단말을 이용하여 생활 주변의 대기환경을 관측하고 교통량과 대기질의 관계를 분석할 수 있는 생활주변 대 기환경 감시 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2021-0164122", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 제공되고 있는 대기오염 정보는 전국적으로 설치된 고정식 대기 측정망에서 관측된 데이터를 가공하 여 각 지역 단위로 제공되는 정보를 말한다. 그러나, 사람들이 매일 다니는 주변의 길, 도로, 장소 등에 대한 실질적인 대기오염 정보는 개별적으로 측정하 지 않는 이상 전혀 제공되지 않고 있는 실정이다. 즉, 대기환경은 동일한 지역 내라고 하더라도 공장 인근, 차 량 혼잡, 비포장도로, 공사장, 소각장, 환기구 등과 같이 도시의 다양한 대기오염 유발원들로 인해 시간, 공간 에 따라 국부적으로 크게 달라질 수가 있다. 따라서, 대기오염 정보를 제공하는 대기질 관측 서비스는 지역단위의 거시적으로 간헐적인 정보를 제공하므로 생활 주변의 실제 대기질 정보가 반영되지 않으며, 주변환경에 따라 국부적으로 대기질의 오차가 크다. 이러한 문제를 해결하기 위해 기존에는 미세먼지 및 주요 오염물질 측정용 드론을 이용하고 있으나, 드론 비행 을 위해서는 별도의 자격증과 숙련된 조작 기술이 요구되는 동시에, 전원공급 문제, 날씨, 비행금지구역 등 주 변 환경의 변화에 민감하여 활용성이 떨어지는 문제가 있다. 또한, 대기환경 관측 전용 로봇은 공장, 공단 또 는 특정 구역에서만 적용 가능하며 전용로봇 플랫폼을 구비해야 하므로 비용 대비 효율성이 떨어진다. 선행기술문헌 특허문헌 (특허문헌 0001) 국내 등록특허 제10-0850448호(2008.07.30. 등록)"}
{"patent_id": "10-2021-0164122", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "전술한 문제점을 해결하기 위하여 본 발명이 이루고자 하는 기술적 과제는, 스마트 모빌리티 기술을 이용하여 국부적인 주변 대기환경을 상시적으로 감시, 분석 및 추적하여 대기오염 정보를 관측하고, 교통량 등의 도시환 경을 관측하여 대기오염 원인을 도출할 수 있는 생활주변 대기환경 감시 장치 및 방법을 제시하는 데 있다. 본 발명의 해결과제는 이상에서 언급된 것들에 한정되지 않으며, 언급되지 아니한 다른 해결과제들은 아래의 기 재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0164122", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "전술한 기술적 과제를 해결하기 위한 수단으로서, 본 발명의 실시 예에 따르면, 거점형 생활 주변 대기 환경 관 측 장치는 생활주변 대기환경 감시 장치는, 주변 대기환경데이터와 기상데이터를 측정하는 다수의 환경 센서들 을 포함하는 하나 이상의 센서 모듈; 및 도로에서 이동 중인 이동 객체의 통행량과 상기 하나 이상의 센서 모듈 로부터 입력되는 주변 대기환경데이터 간의 상관도를 산출하고, 상기 산출된 상관도와 기상데이터와 이동 객체 의 통행량을 바탕으로 주변 대기질의 오염 원인을 분석하는 제어 모듈;을 포함한다. 상기 제어 모듈은, 상기 하나 이상의 센서 모듈과 유무선 통신하는 통신 인터페이스부; 상기 제어 모듈의 위치 정보를 제공하는 GPS(Global Positioning System)부; 상기 도로의 주변을 촬영하여 촬영 영상을 출력하는 비젼 센서; 상기 비젼 센서로부터 제공되는 촬영 영상을 인공지능 모델에 입력하여 프레임단위로 이동 객체와 상기 이동 객체의 종류를 인식하는 AI(Artificial Intelligence) 가속부; 및 상기 AI 가속부에서 인식되는 이동 객체 의 종류별 통행량과 상기 주변 대기환경데이터 간의 상관도를 산출하고, 상기 산출된 상관도와 상기 기상데이터 와 상기 이동 객체의 종류 별 통행량을 바탕으로 주변 대기질의 오염 원인을 분석하는 프로세서;를 포함한다. 상기 AI 가속부는, 상기 비젼 센서로부터 제공되는 촬영 영상을 인공지능 모델에 입력하여 프레임단위로 상기 이동 객체와 이동 객체의 종류를 인식하고, 상기 인식된 이동 객체에게 객체 번호를 부여하며, 상기 객체 번호 는 상기 인식된 이동 객체의 종류에 해당하는 분류번호와 연속된 프레임들에서 인식되는 이동 객체가 동일한 이 동 객체인지를 구별하기 위한 식별번호로 이루어진다. 상기 프로세서는, 상기 AI 가속부에서 인식되는 이동 객체들을 종류별로 단위집계시간동안 누적카운팅하여 이동 객체의 종류별 통행량을 산출하는 통행량 산출부; 상기 단위집계시간동안 측정되는 주변 대기환경데이터에 대한 평균(이하, '주변 대기질 평균'이라 한다)을 산출하는 평균 대기질 산출부; 및 상기 산출된 이동 객체의 종류별 통행량과 주변 대기질 평균 간의 상관도를 산출하는 상관도 산출부;를 포함한다. 상기 센서 모듈이 다수 구비되는 경우, 다수의 센서 모듈들 각각은 정해진 거리만큼 이격되어 구비되고, 상기 제어 모듈과 각각 유무선 통신 가능하도록 연결되며, 상기 제어 모듈은, 상기 다수의 센서 모듈들 각각으로부터 획득되는 주변 대기환경데이터와 기상데이터를 기초로 상기 다수의 센서 모듈들 각각의 주변 대기질의 오염 원 인을 분석한다. 본 발명의 실시 예에 따르면, 모빌리티형 생활 주변 대기 환경 관측 장치는 다종 이동수단에 탑재되고, 주변 대 기환경데이터와 기상데이터를 측정하는 다수의 환경 센서들을 포함하는 하나 이상의 센서 모듈; 및 다종 이동수 단에 탑재되고, 상기 측정된 주변 대기환경데이터가 위험 수준에 도달하면 주변을 촬영한 촬영 영상을 분석하여 대기오염 발생 원인을 예측하는 제어 모듈;을 포함한다. 상기 제어 모듈은, 상기 도로의 주변을 촬영하여 촬영 영상을 출력하는 비젼 센서; 상기 하나 이상의 센서 모듈 과 유무선 통신하는 통신 인터페이스부; 상기 제어 모듈의 위치 정보를 제공하는 GPS(Global Positioning System)부; 상기 비젼 센서로부터 제공되는 촬영 영상을 인공지능 모델에 입력하여 프레임단위로 이동 객체와 상기 이동 객체의 종류를 인식하고, 상기 측정된 주변 대기환경데이터가 기설정된 위험 수준에 해당하여 대기오 염 발생 이벤트가 발생하는 경우, 상기 대기오염 발생 이벤트가 발생한 지점의 전후에 촬영된 촬영 영상을 분석 하여 대기오염 발생 원인으로 사전에 학습된 대기오염 원인 객체가 존재하는지 판단하고, 존재하는 것으로 판단 되면 대기오염 원인 이벤트를 발생하는 AI(Artificial Intelligence) 가속부; 및 상기 하나 이상의 센서 모듈에 서 측정된 주변 대기환경데이터가 기설정된 위험 수준에 해당하면 대기오염 발생 이벤트를 발생하여 상기 AI 가 속부로 전달하고, 상기 AI 가속부에서 판단되는 대기오염 원인 이벤트의 식별코드와 상기 대기오염 원인 이벤트 가 검출된 촬영 영상을 저장부에 저장하거나 대기질 관제 서버로 전송하도록 처리하는 프로세서;를 포함한다. 상기 AI 가속부는, 상기 비젼 센서로부터 제공되는 촬영 영상을 인공지능 모델에 입력하여 프레임단위로 상기 이동 객체와 이동 객체의 종류를 인식하고, 상기 인식된 이동 객체에게 객체 번호를 부여하며, 상기 객체 번호 는 상기 인식된 이동 객체의 종류에 해당하는 분류번호와 연속된 프레임들에서 동일한 이동 객체인지를 구별하 기 위한 식별번호로 이루어진다. 한편, 본 발명의 다른 실시 예에 따르면, 생활주변 대기환경 감시 방법은, (A) 다수의 환경 센서들을 포함하는 하나 이상의 센서 모듈이, 주변 대기환경데이터와 기상데이터를 측정하여 하기 제어 모듈로 전송하는 단계; (B) 제어 모듈이, 도로에서 이동 중인 이동 객체의 통행량과 상기 (A) 단계에서 측정되는 주변 대기환경데이터 간의 상관도를 산출하는 단계; 및 (C) 상기 제어 모듈이, 상기 (B) 단계에서 산출된 통행량과 상관도, 그리고, 상기 (A) 단계에서 측정된 기상데이터를 바탕으로 주변 대기질의 오염 원인을 분석하는 단계;를 포함한다. 상기 (B) 단계는, (B1) 상기 도로의 주변을 촬영하여 촬영 영상을 출력하는 단계; (B2) 상기 촬영 영상을 인공 지능 모델에 입력하여 프레임단위로 이동 객체와 상기 이동 객체의 종류를 인식하는 단계; 및 (B3) 상기 (B2) 단계에서 인식되는 이동 객체의 종류별 통행량과 상기 주변 대기환경데이터 간의 상관도를 산출하는 단계;를 포 함한다. 상기 (B2) 단계는, 상기 비젼 센서로부터 제공되는 촬영 영상을 인공지능 모델에 입력하여 프레임단위로 상기 이동 객체와 이동 객체의 종류를 인식하고, 상기 인식된 이동 객체에게 객체 번호를 부여하며, 상기 객체 번호 는 상기 인식된 이동 객체의 종류에 해당하는 분류번호와 연속된 프레임들에서 동일한 이동 객체인지를 구별하기 위한 식별번호로 이루어진다. 상기 (B3) 단계는, (B31) 상기 (B2) 단계에서 인식되는 이동 객체들을 종류별로 단위집계시간동안 누적카운팅하 여 이동 객체의 종류별 통행량을 산출하는 단계; (B32) 상기 단위집계시간동안 측정되는 주변 대기환경데이터에 대한 평균(이하, '주변 대기질 평균'이라 한다)을 산출하는 단계; 및 (B33) 상기 산출된 이동 객체의 종류별 통 행량과 주변 대기질 평균 간의 상관도를 산출하는 단계;를 포함한다. 상기 센서 모듈이 다수 구비되는 경우, 다수의 센서 모듈들 각각은 정해진 거리만큼 이격되어 구비되고, 상기 제어 모듈과 각각 유무선 통신 가능하도록 연결되며, 상기 제어 모듈은, 상기 다수의 센서 모듈들 각각으로부터 획득되는 주변 대기환경데이터와 기상데이터를 기초로 상기 다수의 센서 모듈들 각각의 주변 대기질의 오염 원 인을 분석한다. 한편, 본 발명의 다른 실시 예에 따르면, 생활주변 대기환경 감시 방법은, (A) 다수의 환경 센서들을 포함하는 하나 이상의 센서 모듈이, 주변 대기환경데이터와 기상데이터를 측정하여 하기 제어 모듈로 전송하는 단계; (B) 제어 모듈이, 상기 (A) 단계에서 측정된 주변 대기환경데이터가 위험 수준에 도달하면 주변을 촬영한 촬영 영상 을 분석하여 대기오염 발생 원인을 예측하는 단계;를 포함하고, 상기 하나 이상의 센서 모듈과 제어 모듈은 다 종 이동수단에 물리적으로 분리되어 탑재된다. 상기 (B) 단계는, (B1) 상기 도로의 주변을 촬영하여 촬영 영상을 출력하는 단계; (B2) 상기 촬영 영상을 인공 지능 모델에 입력하여 프레임단위로 이동 객체와 상기 이동 객체의 종류를 인식하는 단계; (B3) 상기 (A) 단계 에서 측정된 주변 대기환경데이터가 기설정된 위험 수준에 해당하여 대기오염 발생 이벤트가 발생하면, 상기 대 기오염 발생 이벤트가 발생한 지점의 전후에 촬영된 촬영 영상을 분석하여 대기오염 발생 원인으로 사전에 학습 된 대기오염 원인 객체가 존재하는지 판단하고, 존재하는 것으로 판단되면 대기오염 원인 이벤트를 발생하는 단 계; 및 (B4) 상기 (B3) 단계에서 판단되는 대기오염 원인 이벤트의 식별코드와 상기 대기오염 원인 이벤트가 검 출된 촬영 영상을 저장하거나 대기질 관제 서버로 전송하도록 단계;를 포함한다."}
{"patent_id": "10-2021-0164122", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 거점형 방식을 이용하여 도시 인프라(예를 들어, 도로, 보행로, 공원, 역사, 정류장, 터미널 등) 및 일반 가정, 관공서, 빌딩 사무실 등 실내외에 거점형 단말을 설치하여 국부적 대기환경을 관측하고, 대 기오염 발생 원인을 파악할 수 있다. 또한, 본 발명에 따르면, 모빌리티형 방식을 이용하여 전동휠체어, 공유 모빌리티 서비스, 배달 자율주행 로봇 등에 모빌리티형 단말을 장착할 수 있으며, 이로써 국부적 대기환경의 관측 및 대기오염 발생 원인을 국부적으 로 파악하는 것이 가능하다. 또한, 본 발명에 따르면, 기존의 방범, 도로 등의 CCTV를 활용하거나 연동하도록 함으로써 장기 관측 및 통계적 분석을 통한 대기질 사전 예측, 오염원 추적이 가능하고, 장기 관측 자료를 이용한 국부적/전역적 대기질 변화 추적 모델링 효과를 제공할 수 있다. 또한, 본 발명에 따르면, 국부 대기질과 교통량 상관도는 차량에 의한 도로 대기질 오염 발생량을 추정하기 위 해 사용되며, 이 상관도가 높을수록 '교통에 의한 대기오염이 높은 지역인 것으로 추정되어 이를 해결하기 위한 대책 방안을 신속히 수립할 수 있다. 예를 들어, 거점형 감시 장치를 설치한 지점, 또는 모빌리티형 감시장치 를 운영한 구간들에 대해서, 상관도가 높은 지점 및 구간들에 대해 우선적으로 도로 확장, 대기순환시설 또는 식생을 추가하는 등의 조치를 취함으로써 대기질 환경을 개선할 수 있다."}
{"patent_id": "10-2021-0164122", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과는 이상에서 언급된 것들에 한정되지 않으며, 언급되지 아니한 다른 효과들은 아래의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0164122", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이상의 본 발명의 목적들, 다른 목적들, 특징들 및 이점들은 첨부된 도면과 관련된 이하의 바람직한 실시 예들 을 통해서 쉽게 이해될 것이다. 그러나 본 발명은 여기서 설명되는 실시 예들에 한정되지 않고 다른 형태로 구 체화될 수도 있다. 오히려, 여기서 소개되는 실시 예들은 개시된 내용이 철저하고 완전해질 수 있도록 그리고 당업자에게 본 발명의 사상이 충분히 전달될 수 있도록 하기 위해 제공되는 것이다. 어떤 경우에는, 발명을 기술하는 데 있어서 흔히 알려졌으면서 발명과 크게 관련 없는 부분들은 본 발명을 설명 하는 데 있어 별 이유 없이 혼돈이 오는 것을 막기 위해 기술하지 않음을 미리 언급해 둔다. 본 명세서에서 제1, 제2 등의 용어가 구성요소들을 기술하기 위해서 사용된 경우, 이들 구성요소들이 이 같은 용어들에 의해서 한정되어서는 안 된다. 이들 용어들은 단지 어느 구성요소를 다른 구성요소와 구별시키기 위해 서 사용되었을 뿐이다. 여기에 설명되고 예시되는 실시 예들은 그것의 상보적인 실시 예들도 포함한다. 또한, 제1 엘리먼트 (또는 구성요소)가 제2 엘리먼트(또는 구성요소) 상(ON)에서 동작 또는 실행된다고 언급될 때, 제1 엘리먼트(또는 구성요소)는 제2 엘리먼트(또는 구성요소)가 동작 또는 실행되는 환경에서 동작 또는 실 행되거나 또는 제2 엘리먼트(또는 구성요소)와 직접 또는 간접적으로 상호 작용을 통해서 동작 또는 실행되는 것으로 이해되어야 할 것이다. 어떤 엘리먼트, 구성요소, 장치, 또는 시스템이 프로그램 또는 소프트웨어로 이루어진 구성요소를 포함한다고 언급되는 경우, 명시적인 언급이 없더라도, 그 엘리먼트, 구성요소, 장치, 또는 시스템은 그 프로그램 또는 소 프트웨어가 실행 또는 동작하는데 필요한 하드웨어(예를 들면, 메모리, CPU 등)나 다른 프로그램 또는 소프트웨 어(예를 들면 운영체제나 하드웨어를 구동하는데 필요한 드라이버 등)를 포함하는 것으로 이해되어야 할 것이다. 또한, 어떤 엘리먼트(또는 구성요소)가 구현됨에 있어서 특별한 언급이 없다면, 그 엘리먼트(또는 구성요소)는 소프트웨어, 하드웨어, 또는 소프트웨어 및 하드웨어 어떤 형태로도 구현될 수 있는 것으로 이해되어야 할 것이다. 또한, 본 명세서에서 사용된 용어는 실시 예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되 는 '포함한다(comprises)' 및/또는 '포함하는(comprising)'은 언급된 구성요소는 하나 이상의 다른 구성요소의 존재 또는 추가를 배제하지 않는다. 또한, 본 명세서에서 '부', '모듈', '서버', '시스템', '플랫폼', '장치' 또는 '단말' 등의 용어는 하드웨어 및 해당 하드웨어에 의해 구동되거나 하드웨어를 구동하기 위한 소프트웨어의 기능적, 구조적 결합을 지칭하는 것으로 의도될 수 있다. 예를 들어, 여기서 하드웨어는 CPU 또는 다른 프로세서(processor)를 포함하는 데이터 처리 기기일 수 있다. 또한, 하드웨어에 의해 구동되는 소프트웨어는 실행중인 프로세스, 객체(object), 실행 파일(executable), 실행 스레드(thread of execution), 프로그램(program) 등을 지칭할 수 있다. 또한, 상기 용어들은 소정의 코드와 상기 소정의 코드가 수행되기 위한 하드웨어 리소스의 논리적인 단위를 의 미할 수 있으며, 반드시 물리적으로 연결된 코드를 의미하거나, 한 종류의 하드웨어를 의미하는 것이 아님은 본"}
{"patent_id": "10-2021-0164122", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "발명의 기술분야의 평균적 전문가에게는 용이하게 추론될 수 있다. 이하, 본 발명에서 실시하고자 하는 구체적인 기술내용에 대해 첨부도면을 참조하여 상세하게 설명하기로 한다. 도 1은 본 발명의 실시 예에 따른 거점형 생활 주변 대기 환경 관측 장치가 적용된 예시도이고, 도 2는 본 발명의 실시 예에 따른 거점형 생활 주변 대기 환경 관측 장치를 도시한 블록도이다. 도 1 및 도 2에 도시된 거점형 생활 주변 대기 환경 관측 장치는 도시 인프라 시설(예를 들어, 도로 주변, 보행로, 공원, 역사, 버스 정류장, 터미널 등 다수)에 설치가능한 IOT(Internet of Things) 및 MEC(Mobile Edge Computing) 기반의 초연결 분산형 대기환경 관측 단말기술(Hyper-CASS: Hyper-Connected Atmosphere Surveillance System)에 관한 것이다. 거점형 생활 주변 대기 환경 관측 장치는 이를 기반으로 주변의 실질적인 미세먼지 및 대기환경기준물질 농 도를 중기적/장기적/상시적으로 감시하여, 대기오염 발생 원인규명 및 분석을 통한 친환경 스마트 모빌리티 도 입 및 활성화를 위한 제반 근거를 마련하고, 지구 온난화, 대기오염 등의 도시 문제를 해결하는데 기여할 수 있 다. 거점형 생활 주변 대기 환경 관측 장치는 대기환경 측정 센서, 비젼 센서 및 인공지능(AI: Artificial Intelligence)기술을 활용하여 대기 오염과 대기 오염원을 감시할 수 있으며, 대기환경 오염원 감시 및 관측 정 확도 향상 등을 위해 하나의 제어 모듈에 두 개 이상의 센서 모듈이 연결될 수도 있다. 또한, 시공간적인 관측밀도를 향상시키기 위해, 그리고, 오염원 감시 대상에 따라, 거점형 및 모빌리티형 구성 으로 제공될 수 있다. 도 1 및 도 2를 참조하면, 본 발명의 실시 예에 따른 거점형 생활 주변 대기 환경 관측 장치는 기둥과 같은 곳에 구비되는 하나 이상의 센서 모듈(100, 100a) 및 제어 모듈을 포함할 수 있다. 센서 모듈(100, 100a)은 하나 이상 구비가능하며, 센서 모듈(100, 100a)이 다수 구비되는 경우, 다수의 센서 모듈들(100, 100a) 각각은 정해진 거리만큼 상하 방향 또는 좌우 방향으로 이격되어 구비되고, 제어 모듈과 각각 유무선 통신 및 시리얼 통신 가능하도록 물리적으로 연결될 수 있다. 이러한 경우, 제어 모듈은 다수의 센서 모듈들 (100, 100a) 각각으로부터 획득되는 주변 대기환경데이터와 기상데이터를 기초로 다수의 센서 모듈들(100, 100a) 각각의 주변 대기질의 오염 원인을 분석할 수 있다. 도 1 및 도 2에서는 제1 및 제2센서 모듈들(100, 100a)이 상하 방향으로 이격되어 구비된 경우가 일 예로 도시 되어 있다. 제1센서 모듈은 주변의 생활 환경을 감시하도록 상대적으로 높은 위치(예를 들어, 사람의 평 균 얼굴 높이)에 구비되고, 제2센서 모듈(100a)은 지면의 재비산 오염도를 감시하도록 상대적으로 지면에 가까 운 위치(예를 들어, 자동차 타이어 또는 머플러 높이)에 구비될 수 있다. 제1 및 제2센서 모듈들(100, 100a)의 구성과 동작은 동일할 수 있으며, 제1센서 모듈을 예로 들어 설명한 다. 제1센서 모듈은 거점형 생활 주변 대기 환경 관측 장치가 설치된 주변의 대기환경데이터와 기상데이터 를 측정하는 다수의 환경 센서들(110~130)을 포함할 수 있다. 이를 위하여, 제1센서 모듈은 가스 센서부 , 미세먼지 센서부, 기상 센서부 및 센서 제어부를 포함할 수 있다. 가스 센서부는 아황산가스(SO2), 일산화탄소(CO), 이산화질소(NO2), 오존(O3) 등의 대기 오염 기준 물질의 농도를 측정할 수 있다. 미세먼지 센서부는 입자 크기별(PM 1.0, PM 2.5, PM 10 등) 미세먼지 농도를 측정할 수 있다. 기상 센서부는 대기질 관측 시점의 주변 기상 상황(예를 들어, 온도, 습도, 대기압 등)을 측정할 수 있다. 센서 제어부는 제어 모듈로 전원을 공급받아 센서들(110~130)에게 전달하고, 센서들(110~130)이 측정 한 대기환경데이터와 기상데이터를 동기화하여 실시간으로 또는 주기적으로 제어 모듈에게 전달할 수 있다. 또한, 센서 제어부는 가스 센서부의 센서 안정화를 위한 워밍업을 수행할 수 있다. 제어 모듈은 도로에서 이동 중인 이동 객체의 종류 별 통행량(또는 교통량)과 제1 및 제2센서 모듈들(100, 100a) 각각으로부터 입력되는 주변 대기환경데이터 간의 상관도를 산출하고, 산출된 상관도와 기상데이터와 이 동 객체의 통행량을 바탕으로 주변 대기질의 오염 원인을 분석할 수 있다. 이하에서는 제어 모듈과 제1센서 모듈 간의 통신을 일 예로 들어 설명하며, 제어 모듈은 제2센 서 모듈(100a)로부터 센싱되는 데이터에 대해서도 제1센서 모듈로부터 센싱되는 데이터와 동일한 처리 및 분석을 수행할 수 있다. 제어 모듈은 전원 및 통신 제어부, GPS(Global Positioning System)부, 비젼 센서, AI 가 속부, 메모리 및 프로세서를 포함할 수 있다.전원 및 통신 제어부는 제1센서 모듈와 프로세서에 공급되는 전원을 관리하는 전원 관리 모듈과, 제1센서 모듈 및 대기질 관제 서버(미도시)와의 유무선통신을 지원하는 통신 인터페이스 모듈(미 도시)을 포함할 수 있다. GPS부는 제어 모듈의 위치 정보를 제공한다. 비젼 센서는 거점형 생활 주변 대기 환경 관측 장치가 설치된 위치를 기준으로 도로의 주변을 촬영하 여 촬영 영상을 출력할 수 있다. 촬영 영상은 프레임 단위로 촬영되는 동영상일 수 있다. 예를 들어, 비젼 센 서는 차도를 주행 중인 차량을 촬영하도록 구비되거나, 인도를 보행 중인 자전거, 사람을 촬영하도록 구비 될 수 있다. 비젼 센서가 생략되는 경우 도로 주변에 설치된 CCTV(미도시)와 연동하여 CCTV(미도시)로부터 촬영 영상 을 제공받을 수도 있다. AI 가속부 비젼 센서로부터 제공되는 촬영 영상을 인공지능 모델에 입력하여 프레임단위로 이동 객체 의 종류를 인식하여 인식된 이동 객체 별로 객체 번호를 부여할 수 있다. AI 가속부는 촬영 영상으로부터 승용차, 버스, 트럭, 자전거, 오토바이, 사람 등을 이동 객체로 인식하도록 사전에 학습된 인공지능 모델을 이 용하여 이동 객체의 종류를 인식할 수 있다. 객체 번호는 인식된 이동 객체의 종류(즉, 승용차, 버스, 트럭, 자전거, 오토바이, 사람)에 해당하는 분류번호 와 연속된 프레임들에서 인식되는 이동 객체가 동일한 이동 객체인지를 구별하기 위한 식별번호로 이루어질 수 있다. 분류번호는 승용차, 버스, 트럭, 자전거, 오토바이, 사람을 구분하기 위해 분류된 번호이다. 식별번호는 연속 된 프레임들에서 동일한 사물로 인식된 이동 객체를 구별하기 위한 번호이다. 예를 들어, 10번 프레임에서 인 식된 트럭의 분류번호가 3이고, 이 트럭에게 부여된 식별번호가 54라면, 이 트럭은 비젼 센서에 의해 촬영 된 촬영 영상에서 사라질 동안 (3, 54)라는 객체 번호를 부여받게 된다. 이는 프레임마다 트럭이 인식될 때 동 일한 트럭이 중복 카운팅되는 것을 방지하기 위함이다. 메모리는 휘발성 메모리 및/또는 비휘발성 메모리를 포함할 수 있다. 메모리에는 예를 들어, 거점형 생활 주변 대기 환경 관측 장치가 제공하는 동작, 기능 등을 구현 및/또는 제공하기 위하여, 구성요소들 (210~260)에 관계된 명령 또는 데이터, 하나 이상의 프로그램 및/또는 소프트웨어, 운영체제 등이 저장될 수 있 다. 메모리에 저장되는 프로그램은 이동 객체의 통행량과 주변 대기질의 상관도를 산출하며, 상관도와 기상데 이터와 이동 객체의 통행량을 바탕으로 주변 대기질의 오염 원인을 분석하는 주변 대기질 분석 프로그램을 포함 할 수 있다. 프로세서는 메모리에 저장된 하나 이상의 프로그램을 실행하여 거점형 생활 주변 대기 환경 관측 장 치의 전반적인 동작을 제어한다. 예를 들어, 프로세서는 메모리에 저장된 주변 대기질 분석 프로그램을 실행하여 AI 가속부에서 인식되는 이동 객체의 종류별 통행량과 주변 대기환경데이터 간의 상관도를 산출하고, 산출된 상관도와 기상데 이터와 이동 객체의 종류 별 통행량을 바탕으로 주변 대기질의 오염 원인을 분석할 수 있다. 도 3은 프로세서를 기능적으로 도시한 블록도이다. 도 3을 참조하면, 프로세서는 통행량 산출부, 평균 대기질 산출부, 상관도 산출부 및 오염 원인 분석부를 포함할 수 있다. 통행량 산출부는 AI 가속부에서 인식되는 이동 객체들을 종류별로 단위집계시간(T)동안 t시간 간격으 로 누적카운팅하여 이동 객체의 종류별 통행량을 산출할 수 있다. 통행량 산출부는 [수학식 1]을 이용하여 이동 객체의 종류별 통행량, 즉, 단위집계시간(T) 동안 t 간격으 로 누적된 차종별 통과차량대수를 산출할 수 있다.수학식 1"}
{"patent_id": "10-2021-0164122", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "[수학식 1]에서, X는 단위집계시간(T) 동안 t간격으로 누적된 차종(i)별 통과차량대수의 집합을 의미한다. T는 단위집계시간으로서 예를 들어, 30초, 1분, 5분, 10분, 15분, 30분 등으로 설정되며, t는 카운팅 단위로서, 예 를 들어 1초, 2초로 설정될 수 있다. xi(T)는 단위집계시간(T) 동안 t 간격으로 누적된 차종(i)별 통과차량대 수(대)이고, vi,t는 t 간격으로 관측된 차종(i)별 통과차량대수(대)이다. i=0이면 자동차이고, 1이면 버스, 2이 면 트럭을 의미한다. [수학식 1]에서 통행량 산출부는 동일한 객체 번호가 부여된 이동 객체는 동일 차량이므로 1대로 카운팅한 다. [수학식 1]에 의하면, 통행량 산출부는 AI 가속부에서 인식되는 이동 객체들 중 동일한 고유 번호가 부여된(즉, 동일한 차종인) 이동 객체를 단위집계시간(T) 내에서 t초 단위로 카운팅하고, t초 단위로 단위집계 시간(T)동안 누적카운팅된 결과에 기초하여 이동 객체의 종류별 통행량을 산출할 수 있다. 평균 대기질 산출부는 단위집계시간(T)동안 측정되는 주변 대기환경데이터에 대한 평균(이하, '주변 대기 질 평균'이라 한다)을 산출할 수 있다. 평균 대기질 산출부는 [수학식 2]를 이용하여 주변 대기질 평균을 산출할 수 있다. 수학식 2"}
{"patent_id": "10-2021-0164122", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "[수학식 2]에서 P는 단위집계시간(T) 동안의 대기오염물질(j)들에 대한 평균측정치 집합이고, T는 단위집계시간, t는 카운팅 간격(또는 단위)이다. pj(T)는 단위집계시간(T) 동안의 대기오염물질(j)별 평균측정 값이고, mj,t는 t 시점의 관측된 대기오염물질(j )별 관측치( 또는 )이다. 상관도 산출부는 통행량 산출부에서 산출되는 이동 객체의 종류별 통행량과 평균 대기질 산출부(26 4)에서 산출되는 주변 대기질 평균 간의 상관도(이하, '이동 객체 종류별 상관도'라 한다)를 산출할 수 있다. 상관도 산출부는 최종적으로 분석하고자 하는 시간대(0~Tmax)의 이동 객체의 종류별 통행량(X(i))들과 국부 대기질(P(j))의 상관계수(cci,j)를 [수학식 3]을 이용하여 산출할 수 있다. 이동 객체의 종류별 통행량(X(i))은 예를 들어, 차종별 교통량일 수 있다. 수학식 3"}
{"patent_id": "10-2021-0164122", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "여기서, 임. [수학식 3]에서 corr은 상관계수(coefficient of correlation)를 구하는 함수이고, Cov는 공분산(covariance) 을 구하는 함수이고, Var는 분산(variance)을 구하는 함수이다. 또한, 상관도 산출부는 최종적으로 분석하고자 하는 시간대(0~Tmax)의 모든 전체 통행량(Xall)과 국부 대기 질(P(j))의 상관계수(ccj)를 [수학식 4]를 이용하여 산출할 수 있다. 수학식 4"}
{"patent_id": "10-2021-0164122", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "여기서, 이고, 이다. [수학식 4]에서 는 모든 이동 객체의 통행량으로서, AI 가속부에서 인식된 이동 객체의 종류 가 자동차, 버스, 트럭이면 상관도 산출부는 [수학식 1]에서 산출된 자동차, 버스, 트럭의 교통량을 합계 하여 Xall을 산출할 수 있다. 또한, 상관도 산출부는 [수학식 1] 내지 [수학식 4]에 의해 산출되는 이동 객체의 종류별 통행량과 주변 대기질 변화 간의 상관도를 산출하고, 산출된 상관도와 주변 대기질의 시계열적 변화를 추적하여 통계적 분석을 수행할 수 있다. 통계적 분석은, 교통량이 없거나 상대적으로 적을 경우와 교통량이 많을 경우에 대해, 다양한 환경(날씨, 기온, 풍향, 거시적 대기질 관측치 변화)에서의 상관성의 경향성을 분석하는 것이다. 예를 들어, 상관도 산출부(26 6)는 거시적 대기질(환경부에서 제공하는 대기질 정보)이 나쁜 상황에서도 교통량이 적거나 많음에 따라 상관도 의 변화가 발생하는지, 또한, 상관도의 변화량이 통계적으로 얼마나 되는지, 거시적 대기질에 비해 위험도가 얼 마나 높은지 등을 분석할 수 있다. 오염 원인 분석부는 [수학식 1] 내지 [수학식 4]에 의해 산출되는 이동 객체의 종류별 통행량, 모든 이동 객체의 전체 통행량, 주변 대기질 평균, 기상데이터, 이동 객체의 종류별 통행량과 주변 대기질 평균 간의 상관 도, 모든 이동 객체의 통행량과 주변 대기질 평균 간의 상관도에 기반하여 주변 대기질의 오염 원인을 분석할 수 있다. 즉, 오염 원인 분석부는 거점형 생활 주변 대기 환경 관측 장치가이 설치된 주변의 기상, 차종별 교통량, 통행량을 바탕으로 국부적 대기질 오염원인을 분석할 수 있다. 자세히 설명하면, 거점형의 경우, Hyper-CASS 1세트(즉, 하나의 제어 모듈과 하나 이상의 센서 모듈(100, 100a) 또는 다수의 세트를 다양한 관측지에 설치할 수 있다. Hyper-CASS 1세트만 설치하는 것과 다수의 세트를 설치하는 것이 본 발명에서의 '국부'가 될 수 있다. 예를 들어 1세트 설치하는 경우, 1m~10m 내에서의 대기질 변화 및 차이를 감시하고, 다수의 세트를 설치하는 경우, 반경 500m~1km내의 대기질 변화 및 차이를 감시할 수 있다. 본 발명의 실시 예에서는 단위 시간당 차종별 통과차량(승용차, 버스, 트럭)에 따른 대기질 관측치를 비교할 수 있다. 단위 시간당 교통량에 따른 대기질 변화를 상관도로 계산한 결과, 상관도가 기준보다 높게 나타나면 해당 지점에서 차량 통행에 의한 국부 대기오염이 큰 것으로 예측할 수 있다. 즉, 상시적인 Hyper-CASS 관측 및 상 관도 계산을 통해 관측지점에서 발생하는 오염물질의 종류 및 농도와, 승용차, 버스, 트럭 등의 차종별의 관계 를 알 수 있으므로 그 결과를 바탕으로 오염원인 분석이 가능하다. 도 1 내지 도 3을 참조하여 설명한 본 발명의 실시 예에 따르면, 거점형 생활 주변 대기 환경 관측 장치는 제어 모듈 하나에 다수의 센서 모듈들(100, 100a)이 연결되어 수직 또는 수평적 국부 공간에 대한 동시 대 기질 관측과 통행량 관측을 수행할 수 있다. 대기질의 수평 또는 수직적 국부적 감시 및 분석을 위해 다수의 센서 모듈들(100, 100a)을 수평 방향(전후, 좌우), 수직 방향(상하) 또는 설치환경에 적합하게 적정수량을 설치 하여 동시에 대기질 데이터를 수집할 수 있다. 제어 모듈은 하나 이상의 센서 모듈(100, 100a)로부터 시간 동기화된 대기질 정보와 기상 정보를 수집하는 동시에 주변 환경의 영상인식을 통해 시각적 변화 또는 이벤 트를 감지하고 수집된 대기질 변화와의 관계성을 분석하는 기초자료를 저장 또는 제공할 수 있다. 다수의 센서 모듈들(100, 100a)은 동일한 거점 내에서 국부적인 위치의 차이(예를 들어, 1m 내외)를 두고 설치 되며, 이로써 실제 환경에서 바람, 대기압, 기온 등의 대기환경 변화와 오염원의 종류, 특성 등에 따라 대기오 염물질의 농도, 확산, 위험도 등을 분석할 수 있다. 도 4는 본 발명의 다른 실시 예에 따른 모빌리티형 생활 주변 대기 환경 관측 장치가 적용된 예시도이고, 도 5는 본 발명의 다른 실시 예에 따른 모빌리티형 생활 주변 대기 환경 관측 장치를 도시한 블록도이다. 도 4 및 도 5에 도시된 모빌리티형 생활 주변 대기 환경 관측 장치는 전동휠체어, 전기자전거, 배달로봇, 전동킥보드 등 이동 및 휴대가 용이한 다종 이동 수단에 설치되어 주변 환경을 관측할 수 있는, IOT 및 MEC 기 반의 초연결 분산형 대기환경 관측 단말기술(Hyper-CASS)에 관한 것이다. 도 5를 참조하면, 본 발명의 다른 실시 예에 따른 모빌리티형 생활 주변 대기 환경 관측 장치는 센서 모듈 및 제어 모듈을 포함할 수 있다. 모빌리티형 생활 주변 대기 환경 관측 장치의 구성 및 동작은 도 1 내지 도 3을 참조하여 설명한 거점형 생 활 주변 대기 환경 관측 장치와 거의 동일하나, 전원 공급을 위해 하나의 센서 모듈을 포함하는 것을 예로 들고 있다. 따라서, 모빌리티형 생활 주변 대기 환경 관측 장치에도 다수의 센서 모듈들의 구비가 가 능함은 물론이다. 센서 모듈은 모빌리티형 생활 주변 대기 환경 관측 장치가 설치된 이동 수단이 이동 중인 주변의 대기 환경데이터와 기상데이터를 측정하는 다수의 환경 센서들(310~330)을 포함할 수 있다. 이를 위하여, 센서 모듈 은 가스 센서부, 미세먼지 센서부, 기상 센서부 및 센서 제어부를 포함할 수 있다. 가스 센서부, 미세먼지 센서부, 기상 센서부 및 센서 제어부의 동작은 도 2에 도시된 가스 센서부, 미세먼지 센서부, 기상 센서부 및 센서 제어부와 동일하므로 자세한 설명은 생략 한다. 제어 모듈은 센서 모듈로부터 입력되는 주변 대기환경데이터의 위험도가 사전에 정해진 위험 수준에 도달하면 이동 수단의 주변을 촬영한 촬영 영상을 분석하여 대기오염 발생 원인을 예측할 수 있다. 이를 위하여, 제어 모듈은 전원 및 통신 제어부, GPS부, 비젼 센서, AI 가속부, 메 모리 및 프로세서를 포함할 수 있다. 전원 및 통신 제어부는 센서 모듈과 프로세서에 공급되는 전원을 관리하고, 센서 모듈 및 대기질 관제 서버(미도시)와의 유무선통신을 지원한다. GPS부는 제어 모듈의 위치 정보를 제공한다. 비젼 센서는 모빌리티형 생활 주변 대기 환경 관측 장치가 이동하는 동안 도로의 주변을 촬영하여 촬 영 영상을 출력할 수 있다. 촬영 영상은 프레임 단위로 촬영되는 동영상일 수 있다. AI 가속부는 비젼 센서로부터 제공되는 촬영 영상을 인공지능 모델에 입력하여 프레임단위로 이동 객 체의 종류를 인식하여 인식된 이동 객체 별로 객체 번호를 부여할 수 있다. AI 가속부가 객체를 인식하고 객체 번호를 부여하는 동작은 도 2를 참조하여 설명한 AI 가속부와 동일하므로 상세한 설명은 생략한다. 또한, AI 가속부는 프로세서로부터 대기오염 발생 이벤트가 발생하면, 대기오염 발생 이벤트가 발생 한 지점을 기준으로 전후에 촬영된 촬영 영상을 인공지능 모델에 입력 및 분석하여 대기오염 원인 객체가 존재 하는지 판단하고, 존재하는 것으로 판단되면 대기오염 원인 이벤트를 발생할 수 있다. 대기오염 원인 객체는 대기오염 발생 원인으로 사전에 학습된 객체 또는 상황으로서, 예를 들어, 사전 인공지능 학습을 통해 연기, 화재, 폭발, 시설물 파손 등의 객체 또는 상황을 대기오염 발생 원인으로 사전 학습시킴으로 써, '대기오염 발생 이벤트' 지점에서 관측된 영상을 통해 해당 지점에서의 대기질 오염원인을 자동으로 인식 및 탐지할 수 있다. 대기오염 원인 이벤트는 사전에 학습된 이벤트이다. 학습된 이벤트는 '대기오염 발생 이벤트'가 발생한 지점에 서 저장된 영상(동영상 포함)을 분석하여 그 속에서의 상황 이벤트를 의미한다. 사전 AI 학습을 통해 학습시킨 이벤트를 관측 시에 탐지하도록 하는 것이다. 예를 들어, 사전 AI 학습을 통해 연기, 화재, 폭발, 시설물 파손등의 상황을 사전 학습시킴으로써, '대기오염 발생 이벤트' 지점에서 관측된 영상을 통해 해당 지점에서의 대기 질 오염원인을 자동으로 인식 및 탐지할 수 있다. 즉, 학습된 이벤트는 영상을 사전에 AI 학습시킴으로써 다양한 상황을 인지하고 분류한 이벤트들을 의미한다. 전신주 등 도로시설물 등의 파손, 차량, 주택, 초목 등의 화재 또는 연기, 맨홀 뚜껑 인식 등의 영상으로 인식 할 수 있는 다양한 주변 환경의 특정 상황(이벤트)를 사전에 학습해 둔 것을 의미한다. 메모리에는 촬영 영상과, 촬영 영상으로부터 이동 객체를 인식하기 위한 인공지능 모델과, 주변 대기질의 오염 정도에 따라 대기오염 원인 이벤트를 발생하기 위한 대기오염 원인 프로그램이 저장될 수 있다. 프로세서는 메모리에 저장된 대기오염 원인 프로그램을 실행하여 센서 모듈에서 측정된 주변 대 기환경데이터가 기설정된 위험 수준에 해당하면 대기오염 발생 이벤트를 발생하고, 대기오염 발생 이벤트가 발 생한 지점을 기준으로 전후에 촬영된 촬영 영상을 AI 가속부로 전달할 수 있다. 또한, 프로세서는 AI 가속부에서 대기오염 원인 이벤트가 판단되면 판단된 대기오염 원인 이벤트에 해당하는 식별코드와 대기오염 원인 이벤트가 검출된 촬영 영상을 메모리에 저장하거나 대기질 관제 서버 (미도시)로 전송하도록 처리할 수 있다. 도 6은 본 발명의 실시 예에 따른 거점형 생활 주변 대기 환경 관측 방법을 도시한 흐름도이다. 도 6에 도시된 거점형 생활 주변 대기 환경 관측 방법은 도 1 내지 도 3을 참조하여 설명한 거점형 생활 주변 대기 환경 관측 장치에 의해 동작하며 상세한 설명은 상술하였으므로 생략한다. 도 6을 참조하면, 거점형 생활 주변 대기 환경 관측 장치의 하나 이상의 센서 모듈(100, 100a)은 주변 대기 환경데이터와 기상데이터를 측정하여 제어 모듈로 전송한다(S610). 제어 모듈의 비젼 센서는 도로의 주변을 촬영하여 촬영 영상을 출력한다(S620) 제어 모듈의 AI 가속부는 촬영 영상을 인공지능 모델에 입력하여 프레임단위로 이동 객체의 종류를 인식하고 객체 번호를 부여한다(S630). 제어 모듈의 프로세서는 S630단계에서 인식된 이동 객체의 통행량과 S610단계에서 측정되는 주변 대 기환경데이터 간의 상관도를 산출할 수 있다(S640). 도 7은 도 6의 S640단계를 자세히 도시한 흐름도이다. 도 7을 참조하면, 프로세서는 S630단계에서 인식되는 이동 객체들을 종류별로 단위집계시간(T)동안 누적카 운팅하여 이동 객체의 종류별 통행량을 [수학식 1]을 이용하여 산출할 수 있다(S642). 프로세서는 S610단계에서 동일한 단위집계시간동안 측정되는 주변 대기환경데이터에 대한 평균(이하, '주 변 대기질 평균'이라 한다)을 [수학식 2]를 이용하여 산출할 수 있다(S644). 프로세서는 S642단계에서 산출된 이동 객체의 종류별 통행량과 S644단계에서 산출된 주변 대기질 평균 간 의 상관도를 [수학식 3] 또는 [수학식 4]를 이용하여 산출할 수 있다(S646). 다시 도 6을 참조하면, 제어 모듈의 프로세서는 S610단계 내지 S640단계에서 산출된 통행량과 상관도, 기상데이터를 바탕으로 주변 대기질의 오염 원인을 분석할 수 있다(S650). 도 8은 본 발명의 실시 예에 따른 모빌리티형 생활 주변 대기 환경 관측 방법을 도시한 흐름도이다. 도 8에 도시된 모빌리티형 생활 주변 대기 환경 관측 방법은 도 4 및 도 5를 참조하여 설명한 모빌리티형 생활 주변 대기 환경 관측 장치에 의해 동작하며 상세한 설명은 상술하였으므로 생략한다. 도 8을 참조하면, 센서 모듈은 모빌리티형 생활 주변 대기 환경 관측 장치가 구비된 이동 수단의 주변 대기환경데이터와 기상데이터를 측정하여 제어 모듈로 전송할 수 있다(S810). 제어 모듈의 비젼 센서는 도로의 주변을 촬영하여 촬영 영상을 출력한다(S820) 제어 모듈의 AI 가속부는 촬영 영상을 인공지능 모델에 입력하여 프레임단위로 이동 객체의 종류를 인식하고 객체 번호를 부여한다(S830). 제어 모듈의 프로세서는 S810단계로부터 입력되는 주변 대기환경데이터가 기설정된 대기질 위험 수준 에 도달하면 대기오염이 발생하였음을 의미하는 대기오염 발생 이벤트를 발생하여 AI 가속부로 전달할 수있다(S840). 이 때 대기오염 발생 이벤트가 발생한 지점의 전후 촬영 영상을 함께 AI 가속부로 전달한다. AI 가속부는 대기오염 발생 이벤트가 발생한 지점의 전후에 촬영된 촬영 영상을 분석하여 대기오염 원인 객체가 존재하는지 판단하고, 존재하는 것으로 판단되면 대기오염 원인 이벤트를 발생한다(S850). 프로세서는 S850 단계에서 판단되는 대기오염 원인 이벤트의 식별코드와 대기오염 원인 이벤트가 검출된 촬영 영상을 저장하거나 대기질 관제 서버로 전송하도록 처리할 수 있다(S860). 한편, 이상으로 본 발명의 기술적 사상을 예시하기 위한 바람직한 실시 예와 관련하여 설명하고 도시하였지만, 본 발명은 이와 같이 도시되고 설명된 그대로의 구성 및 작용에만 국한되는 것이 아니며, 기술적 사상의 범주를 일탈함이 없이 본 발명에 대해 다수의 변경 및 수정 가능함을 당업자들은 잘 이해할 수 있을 것이다. 따라서, 그러한 모든 적절한 변경 및 수정과 균등물들도 본 발명의 범위에 속하는 것으로 간주하여야 할 것이다. 따라 서, 본 발명의 진정한 기술적 보호 범위는 첨부된 등록청구범위의 기술적 사상에 의해 정해져야 할 것이다."}
{"patent_id": "10-2021-0164122", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시 예에 따른 거점형 생활 주변 대기 환경 관측 장치가 적용된 예시도, 도 2는 본 발명의 실시 예에 따른 거점형 생활 주변 대기 환경 관측 장치를 도시한 블록도,도 3은 프로세서를 기능적으로 도시한 블록도, 도 4는 본 발명의 다른 실시 예에 따른 모빌리티형 생활 주변 대기 환경 관측 장치가 적용된 예시도, 도 5는 본 발명의 다른 실시 예에 따른 모빌리티형 생활 주변 대기 환경 관측 장치를 도시한 블록도, 도 6은 본 발명의 실시 예에 따른 거점형 생활 주변 대기 환경 관측 방법을 도시한 흐름도, 도 7은 도 6의 S640단계를 자세히 도시한 흐름도, 그리고, 도 8은 본 발명의 실시 예에 따른 모빌리티형 생활 주변 대기 환경 관측 방법을 도시한 흐름도이다."}
