{"patent_id": "10-2022-0069342", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0169504", "출원번호": "10-2022-0069342", "발명의 명칭": "기계학습 기반의 정수처리장 유입탁도 예측 시스템 및 그 방법", "출원인": "한국건설기술연구원", "발명자": "오현제"}}
{"patent_id": "10-2022-0069342", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "정수처리장으로 유입되는 유입원수의 탁도인 유입탁도를 예측하는 시스템에 있어서,취수원(300)의 남조류 개체수 데이터, 기상 데이터와 수질 데이터, 및 정수처리장 유입수질 데이터 및 운영 데이터를 수집하는 데이터 수집부(110);기계학습 기반의 제1 기계학습 알고리즘에 따라 학습된 제1 학습모델(121)을 통해 남조류 개체수를 예측하고,제2 기계학습 알고리즘에 따라 학습된 제2 학습모델(122)을 통해 정수처리장 유입탁도를 예측하는 모델링부(120);상기 기상 데이터 및 수질 데이터를 이용하여 제1 및 제2 기계학습 알고리즘으로 각각 상기 제1 학습모델(121)및 제2 학습모델(122)을 학습시키는 학습부(130); 및각각 예측된 남조류 개체수와 예측된 정수처리장 유입탁도를 조합하여 정수처리장 유입탁도 프로파일을 설정하는 유입탁도 프로파일 설정부(140)를 포함하되,상기 제1 기계학습 알고리즘은 녹조예측 알고리즘이고, 상기 제2 기계학습 알고리즘은 탁도예측알고리즘으로서, 적정한 응집제를 주입하도록 소정 시간 이후의 상기 정수처리장의 유입탁도를 사전에 예측하는것을 특징으로 하는 기계학습 기반의 정수처리장 유입탁도 예측 시스템."}
{"patent_id": "10-2022-0069342", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 모델링부(120)는,상기 제1 기계학습 알고리즘으로 학습시키는 제1 학습모델(121);상기 제2 기계학습 알고리즘으로 학습시키는 제2 학습모델(122);상기 제1 학습모델(121)을 통해 남조류 개체수를 예측하는 남조류 개체수 예측부(123); 및상기 제2 학습모델(122)을 통해 정수처리장 유입탁도를 예측하는 유입탁도 예측부(124)를 포함하는 기계학습 기반의 정수처리장 유입탁도 예측 시스템."}
{"patent_id": "10-2022-0069342", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 제1 기계학습 알고리즘 및 제2 기계학습 알고리즘 각각은 상기 제1 학습모델(121) 및 제2 학습모델(122)의사용 목적에 따라 DT(Decision Tree) 알고리즘, SVM(Support Vector Machine) 알고리즘, MLP(Multi LayerPerception) 알고리즘 및 RNN(Recurrent Neural Network) 알고리즘 중에서 선택되는 것을 특징으로 하는 기계학습 기반의 정수처리장 유입탁도 예측 시스템."}
{"patent_id": "10-2022-0069342", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 학습부(130)는 상기 모델링부(120)의 제1 학습모델(121) 및 제2 학습모델(122) 각각에 대해 일주일의 제1설정기간에 따라 남조류 개체수의 예측 및 녹조 패턴 예측을 학습시키는 것을 특징으로 하는 기계학습 기반의정수처리장 유입탁도 예측 시스템."}
{"patent_id": "10-2022-0069342", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 유입탁도 프로파일 설정부(140)는 상기 제1 설정기간보다 긴 일주일 이후의 제2 설정기간의 남조류 개체수공개특허 10-2023-0169504-3-프로파일을 예측하는 것을 특징으로 하는 기계학습 기반의 정수처리장 유입탁도 예측 시스템."}
{"patent_id": "10-2022-0069342", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4항에 있어서, 상기 학습부(130)는 일주일 간격으로 측정된 남조류 개체수 데이터, 1일 간격으로 측정된 기상 데이터 및 수질데이터, 1시간 간격으로 측정된 정수처리장 유입탁도 데이터의 학습을 수행하는 것을 특징으로 하는 기계학습기반의 정수처리장 유입탁도 예측 시스템."}
{"patent_id": "10-2022-0069342", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 1일 간격으로 측정된 기상 데이터는 취수원(300)에서의 기온, 일조시간 및 일 강수량을 포함하고, 상기 1일 간격으로 측정된 수질 데이터는 취수원(300)에서의 수소이온농도지수(pH), 용존산소량(Dissolved Oxygen:DO), 생화학적 산소요구량(Biochemical Oxygen Demand: BOD), 화학적 산소요구량(Chemical Oxygen Demand:COD), 부유물질(Suspended Solids: SS), 총질소(Total Nitorgen: TN), 총인(Total Phosphorus: TP), 총유기탄소(Total Organic Carbon: TOC), 수온, 클로로필-a 및 유량을 포함하는 기계학습 기반의 정수처리장 유입탁도예측 시스템."}
{"patent_id": "10-2022-0069342", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서, 상기 1시간 간격으로 측정된 정수처리장 유입탁도 데이터는 정수처리장(200)에서의 온도, 탁도, pH, 전기전도도및 알칼리도를 포함하는 기계학습 기반의 정수처리장 유입탁도 예측 시스템."}
{"patent_id": "10-2022-0069342", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서, 상기 유입탁도 프로파일 설정부(140)에서 설정된 정수처리장 유입탁도 프로파일에 따라 응집제 주입량을 결정하는 응집제 주입량 결정부(160)를 추가로 포함하는 기계학습 기반의 정수처리장 유입탁도 예측 시스템."}
{"patent_id": "10-2022-0069342", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서, 정수처리장 유입탁도 예측과 관련된 알림정보 발생시 상기 알림정보를 정수처리장 관리자 단말(400)에게 전송하는 알림정보 전송부(170)를 추가로 포함하는 기계학습 기반의 정수처리장 유입탁도 예측 시스템."}
{"patent_id": "10-2022-0069342", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "정수처리장으로 유입되는 유입원수의 탁도인 유입탁도를 예측하는 방법에 있어서,a) 취수원(300)의 남조류 개체수 데이터, 기상 데이터와 수질 데이터, 및 정수처리장 유입수질 데이터 및 운영데이터를 수집하는 단계;b) 제1 및 제2 기계학습 알고리즘에 따른 제1 및 제2 학습모델(121, 122)을 각각 선택하는 단계;c) 상기 기상 데이터 및 수질 데이터를 이용하여 제1 및 제2 기계학습 알고리즘으로 각각 상기 제1 및 제2 학습모델(121, 122)을 학습하는 단계;d) 상기 제1 학습모델(121)을 통해 남조류 개체수를 예측하고, 상기 제2 학습모델(122)을 통해 정수처리장 유입탁도를 예측하는 단계; 및e) 각각 예측된 남조류 개체수와 예측된 정수처리장 유입탁도를 조합하여 정수처리장 유입탁도 프로파일을 설정하는 단계를 포함하되,상기 제1 기계학습 알고리즘은 녹조예측 알고리즘이고, 상기 제2 기계학습 알고리즘은 탁도예측알고리즘으로서, 적정한 응집제를 주입하도록 소정 시간 이후의 상기 정수처리장의 유입탁도를 사전에 예측하는공개특허 10-2023-0169504-4-것을 특징으로 하는 기계학습 기반의 정수처리장 유입탁도 예측 방법."}
{"patent_id": "10-2022-0069342", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,f) 상기 정수처리장 유입탁도 프로파일에 따라 응집제 주입량을 결정하는 단계; 및g) 정수처리장 유입탁도 예측과 관련된 알림정보 발생시 상기 알림정보를 정수처리장 관리자 단말(400)에게 전송하는 단계를 추가로 포함하는 기계학습 기반의 정수처리장 유입탁도 예측 방법."}
{"patent_id": "10-2022-0069342", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서, 상기 제1 기계학습 알고리즘 및 제2 기계학습 알고리즘 각각은 상기 제1 학습모델(121) 및 제2 학습모델(122)의사용 목적에 따라 DT(Decision Tree) 알고리즘, SVM(Support Vector Machine) 알고리즘, MLP(Multi LayerPerception) 알고리즘 및 RNN(Recurrent Neural Network) 알고리즘 중에서 선택되는 것을 특징으로 하는 기계학습 기반의 정수처리장 유입탁도 예측 방법."}
{"patent_id": "10-2022-0069342", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서, 상기 c) 단계에서 상기 제1 학습모델(121) 및 제2 학습모델(122) 각각에 대해 일주일의 제1 설정기간에 따라 남조류 개체수의 예측 및 녹조 패턴 예측을 학습시키는 것을 특징으로 하는 기계학습 기반의 정수처리장 유입탁도예측 방법."}
{"patent_id": "10-2022-0069342", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서, 상기 e) 단계는 상기 제1 설정기간보다 긴 일주일 이후의 제2 설정기간의 남조류 개체수 프로파일을 예측하는것을 특징으로 하는 기계학습 기반의 정수처리장 유입탁도 예측 방법."}
{"patent_id": "10-2022-0069342", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제11항에 있어서, 상기 c) 단계에서 일주일 간격으로 측정된 남조류 개체수 데이터, 1일 간격으로 측정된 기상 데이터 및 수질 데이터, 1시간 간격으로 측정된 정수처리장 유입탁도 데이터의 학습을 수행하는 것을 특징으로 하는 기계학습 기반의 정수처리장 유입탁도 예측 방법."}
{"patent_id": "10-2022-0069342", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서, 상기 1일 간격으로 측정된 기상 데이터는 취수원(300)에서의 기온, 일조시간 및 일 강수량을 포함하고, 상기 1일 간격으로 측정된 수질 데이터는 취수원(300)에서의 수소이온농도지수(pH), 용존산소량(Dissolved Oxygen:DO), 생화학적 산소요구량(Biochemical Oxygen Demand: BOD), 화학적 산소요구량(Chemical Oxygen Demand:COD), 부유물질(Suspended Solids: SS), 총질소(Total Nitorgen: TN), 총인(Total Phosphorus: TP), 총유기탄소(Total Organic Carbon: TOC), 수온, 클로로필-a 및 유량을 적어도 하나 이상 포함하는 기계학습 기반의 정수처리장 유입탁도 예측 방법."}
{"patent_id": "10-2022-0069342", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제16항에 있어서, 상기 1시간 간격으로 측정된 정수처리장 유입탁도 데이터는 정수처리장(200)에서의 온도, 탁도, pH, 전기전도도및 알칼리도를 포함하는 기계학습 기반의 정수처리장 유입탁도 예측 방법.공개특허 10-2023-0169504-5-"}
{"patent_id": "10-2022-0069342", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "정수처리장으로 유입되는 유입원수에 포함된 탁도성분의 농도(유입탁도)를 기계학습 기반으로 사전에 예측하여 정수처리장 관리자가 대책을 검토하고, 이에 따라, 최종적으로 정수처리 공정의 효율을 향상시키며, 정수처리를 위한 유지관리 비용을 감소시킬 수 있으며, 또한, 기계학습 기반으로 녹조예측 알고리즘 및 탁도예측 알고리즘을 각각 활용하여 정수처리장의 유입탁도를 사전에 정확하게 예측함으로써 적정한 응집제를 주입할 수 있는, 기계학 습 기반의 정수처리장 유입탁도 예측 시스템 및 그 방법이 제공된다."}
{"patent_id": "10-2022-0069342", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 정수처리장 유입탁도 예측 시스템에 관한 것으로, 보다 구체적으로, 정수처리장으로 유입되는 유입원 수에 포함된 탁도성분의 농도(이하, 유입탁도라 함)를 기계학습 기반으로 사전에 예측하는, 기계학습 기반의 정 수처리장 유입탁도 예측 시스템 및 그 방법에 관한 것이다."}
{"patent_id": "10-2022-0069342", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 상수원의 오염이 심각해짐에 따라 정수수질에 대한 관심이 높아지고 고도정수처리에 대한 요구가 증가하여 기존의 정수처리시설에 대한 보완이나 새로운 공정의 도입이 시도되고 있다. 하지만 기존의 정수시설의 보완이나 새로운 고도정수처리시설을 도입하기 위해서는 부지확보를 포함하여 많은 어려움이 뒤따르고 있다. 이러한 정수처리시설의 효율성 향상을 위한 개선이 지속적으로 이루어지고 있으며, 이에 수반하여 수질이나 환 경에 부응하도록 실시간 모니터링 및 가변제어할 수 있는 운용시스템도 최근에는 개발되고 있는 추세이다. 종래의 기술에 따른 정수처리장치는 혼화/응집/침전 및 모래여과 공정로 이루어진 표준정수처리공정 (Conventional Water Treatment Process)을 사용하고 있다. 도 1은 종래의 기술에 따른 정수처리장치를 예시하는 구성도이다. 도 1에 도시된 바와 같이, 종래의 기술에 따른 정수처리장치는, 강이나 호수로부터 취수된 원수는 협잡물을 제거하기 위한 스크린을 거친 후에 혼화조에서 투입된 응집제(Coagulant)와 혼합된다. 이후, 완속 교반되는 응집조에서 침전되기 힘든 미세 콜로이드 입자들이 응집되어 침전 가능한 플록을 형성 하고 침전조에서 원수로부터 침전 제거된다. 이후, 모래여과조에서 모래를 이용한 여과(Filtration) 를 거치면서 원수 속의 입자상 물질들은 대부분 제거된다. 마지막으로, 염소와 같은 소독제를 이용하여 살균 후에 정수로 공급된다. 이러한 표준정수처리공정은 공정이 단순하고 운영비가 저렴하기 때문에 상수원수의 수질이 양호한 경우에 매우 유용하게 사용되고 있다. 또한, 근래에는 수질의 개선을 위하여 고도처리시설의 개선 및 복잡화가 이루어지고 있어 운영에 있어서 난이도 가 높아지고 있다. 따라서, 이를 위한 여러 가지 운영방식들이 제안되고 있으며, 일반적인 시설의 운영 최적화를 위한 시스템은 원 격감지제어시스템(Supervisory Control And Data Acquisition: SCADA) 시스템을 구축하고 소독, 여과 등의 각 단위공정을 제어관리한다. 특히, 응집제 등의 약품을 정수장 유량에 따라 자동주입하고, 약품이 투입되는 지점 바로 직후에 수질분석기를 설치하여 수질을 연속적으로 모니터링할 수 있으며, 탁도계 및 입자 계수기에서 측정된 데이터는 PLC(Programmable Logic Controller)를 통해 SCADA 시스템으로 피드백된다. 최근 기후변화 및 하천/호소의 개발에 의하여 수생태계의 유속, 체류시간 등의 물리적 환경과 용존 질소농도, 용존 인농도, 용존 산소농도 등의 화학적 환경이 급변함으로써 호소에서 취수되어 정수처리장으로 유입되는 원 수의 품질에 많은 문제점이 발생하고 있다. 특히, 정수처리장에서 제거하는 여러 물질 중에서 탁도(Turbidity)성분의 제거 여부에 따라 정수처리설비의 성 능이 평가될 수 있다. 또한, 정수처리장 관리자는 유입원수에 포함된 탁도성분의 농도와 응집제 주입량 조견표를 검토하여 응집제 주 입량을 결정한다. 이때, 응집제 주입량이 부족하면 정수처리장 후단에 위치한 모래여과, 막여과, 오존/AOP 등을 위한 설비의 효율 이 급감하게 되며, 또한, 응집제 주입량이 과도하면 정수처리장 유지관리를 위한 비용 상승을 야기할 수 있다. 하지만 응집제 주입량은 시시각각 변화하는 유입원수에 포함된 탁도성분의 농도에 상시 대응할 수 없기 때문에, 통상적으로 정수처리장 관리자는 안정적으로 과량의 응집제를 주입하고 있는 실정이다. 또한, 취수지역의 날씨, 녹조(Algae) 발생 여부 등에 따라 정수처리장에 유입되는 유입원수에 포함된 탁도성분 의 농도는 취수시간에 대응하여 변화되지만, 이러한 탁도성분의 농도 변화는 정수처리장으로 유입되었을 때 비 로소 확인되기 때문에 실제 현장에서서는 즉각적으로 대응하기 어렵고, 이에 따라, 수질사고가 발생할 가능성이 농후하다. 한편, 탁도 예측과 관련된 선행기술로서, 일본 등록특허번호 제4,146,610호에는 \"탁도 예측 시스템, 탁도 제어 시스템 및 탁도 관리 시스템\"이라는 명칭의 발명이 개시되어 있는데, 종래의 기술에 따른 탁도 예측 시스템은, 정수장의 정화 처리과정의 각종 계측되는 데이터를 추론 모델을 활용 하요 연산 처리하고, 정수장에서 소정 시간 후에 생성되는 처리수의 탁도를 추정하되, 원수탁도, 원수유량, 응 집제 투입률, 기온, 처리수 탁도 등의 데이터를 입력하고, 입력된 데이터와 입력데이터를 조건으로 정수장에서 처리된 실제 처리수 탁도의 이력 데이터를 산출하여, 처리수 탁도를 예측 및 제어할 수 있다. 한편, 다른 선행기술로서, 대한민국 등록특허번호 제10-2261819호에는 \"인공지능 시뮬레이션을 이용한 정수처리 장의 운영 시스템\"이라는 명칭의 발명이 개시되어 있는데, 도 2a 내지 도 2c를 참조하여 설명한다. 도 2a는 종래의 기술에 따른 인공지능 시뮬레이션을 이용한 정수처리장의 운영 시스템에 대한 구성도이고, 도 2b는 도 2a에 도시된 운영제어부의 구체적인 구성도이고, 도 2c는 종래의 기술에 따른 인공지능 시뮬레이션을 이용한 정수처리장의 운영 방법을 나타내는 동작흐름도이다. 도 2a를 참조하면, 기본적인 정수처리장의 경우 공지의 기설치된 시설물이나 개념들이 적용될 수 있고, 종래의 기술에 따른 인공지능 시뮬레이션을 이용한 정수처리장의 운영 시스템의 경우, 물리적 시설로서 착수정, 혼화지, 응집지, 침전지, 여과지 및 정수지를 포함하여 구성 된다. 즉, 각종 시설 및 지역으로부터 유입받은 원수를 착수정, 혼화지, 응집지, 침전지, 여과지 및 정수지로 처리하여 얻은 정수를 외부에 공급하도록 구성되는데, 침전지에서 배출되는 배슬러지와 여과지의 역세척 공정에서 발생되는 역세척 배출수를 수처리한 후에 방출하기 위해서 배출수지, 배슬러지지, 막여과장치 및 탈수기 등을 포함할 수 있다. 통상적인 정수 과정은, 외부로부터 유입받는 원수를 착수정에 저장하여 정수할 원수의 유량을 조절하고, 혼 화지에서 원수에 응집제를 투입하고 이를 혼화지에서 혼화하여 마이크로플록(micro floc)을 생성시킨다. 또한, 생성시킨 마이크로플록의 체적을 응집지230)에서 증가시키는 응집 과정을 수행하여 플록을 형성한다. 이에, 응집지에서 형성된 플록을 침전지를 이용하여 침전시키고 상징수를 추출하여 여과지의 여재 를 통과시킨 후, 정수지에서 정수시켜 배출한다. 구체적으로, 도 2b에 도시된 바와 같이, 운영제어부는 데이터베이스화부, 통신부, 시뮬레이션 및 예측부 및 시각화부를 포함하고, 데이터베이스화부는 시설물 정보 수집부(31a), 계측값 수신부 (31b) 및 외부인자 수집부(31c)를 포함한다. 통신부는 로컬에 구비되는 정수처리장 또는 개별 디바이스들의 정보를 수집하고, 제어신호를 송출하는 기능 을 수행한다. 데이터베이스화부는, 기본적으로 정수처리장의 각 장비와 디바이스들에서 수집되는 계측정보를 수집하는 계 측값 수신부(31b); 시설물의 위치나 지형, 장비현황 등에 대한 정보를 수집하는 시설물정보 수집부(31a); 및 강 우 등의 기상요소와 같은 외부 서버로부터 빅데이터 형태로 수집할 수 있는 외부인자 수집부(31c)를 포함하여 구성될 수 있다. 계측값 수신부(31b)에서 수집되는 정보는 알칼리도, pH, 탁도, 유입유량, 약품량, 슬러지 계면, 입자수, 수위, 잔류염소량, 유출유량 등의 정보일 수 있으며, 각각 공지의 센서 및 계측 디바이스가 적용될 수 있다. 시설물정보 수집부(31a)는 기시공된 시설물의 도면, 지형, 배치위치, 시기 등에 대한 정보를 수집할 수 있다. 이는 데이터베이스화된 외부 서버로부터 수집하거나 모델의 구축시 기설정된 자료로 활용할 수 있다. 외부인자 수집부(31c)는 날씨, 강우량, 강설량, 기온, 인구, 상하수도시설 등에 대한 정보를 수집할 수 있다. 이러한 계측값 수신부(31b), 시설물정보 수집부(31a) 및 외부인자 수집부(31c)에서 수집된 정보는 데이터베이스 화되고, 시뮬레이션 및 예측부에서 공정운영 최적화 소프트웨어에 따라 최적방안이 도출되고, 고장 예지 및 건전성관리 소프트웨어에 따라 유지관리방안이 수립되며, 다차원 가시화 소프트웨어를 통하여 예를 들어 3D 가 시화 출력이 가능하다. 또한, 운영제어부는 설비제어부를 추가적으로 구비하고, 수립된 계획에 따라 정수처리장에 대한 최적제 어를 수행할 수 있다. 종래의 기술에 따른 인공지능 시뮬레이션을 이용한 정수처리장의 운영 시스템의 경우, 정수처리장의 계측장치로 부터 계측값을 산출하고, 기상서버로부터 기상정보를 수집하여 수집된 계측값 및 정보를 데이터화하고, 원수의 유입유량, 탁도, 알칼리도, 전기전도도, 수온 등의 계측값을 인자로 하여 정수 약품 주입량 계획을 시뮬레이션 및 예측하되, 그 결과를 인공지능 모듈에 도입시켜, 정수장 유지관리의 의사결정을 지원할 수 있다. 또한, 도 2c를 참조하면, 종래의 기술에 따른 인공지능 시뮬레이션을 이용한 정수처리장의 운영 방법은, 먼저, 데이터베이스화부에서 수집 및 수신된 정보들에 의하여 데이터를 수집하고(S11), 이후, 정수처리장의 3D 데이터 획득 및 동기화를 통하여 데이터를 시각화한다(S12). 다음으로, 정수처리장 3D 기반의 시뮬레이션이 수행되며(S13), 이후, 정수처리장의 운영 예측이 이루어진다 (S14). 다음으로, 이러한 결과에 의하여 CPS기반 정수처리 자율제어 및 운영 유지 관리가 이루어지며(S15), 이에 따라, 공정 운영 시뮬레이션 및 예측이 가능하고, 에너지 시뮬레이션 예측, 유지관리 시뮬레이션 및 고장예지, 또한 신뢰성 제고 및 자기보정기능을 통하여 인공지능에 의한 처리 효율을 극대화할 수 있다. 종래의 기술에 따른 인공지능 시뮬레이션을 이용한 정수처리장의 운영 시스템에 따르면, 정수장 유입수질에 따 른 최적설비 운영이 가능하고, 정수장 시설 감시 및 유지관리 대응을 통한 의사결정지원 및 사고예방의 효과가 있고, 또한, 시설 고장 진단 및 건전성 관리를 통한 시설유지관리예측 및 유지관리비용 절감이 가능하다. 하지만, 종래의 기술에 따른 인공지능 시뮬레이션을 이용한 정수처리장의 운영 시스템의 경우, 취수원으로부터 유입되는 유입원수의 탁도성분의 농도를 예측할 수 없고, 시시각각 변화하는 유입원수에 포함된 탁도성분의 농 도에 상시 대응할 수 없다는 한계가 있다. 한편, 조류농도 예측과 관련된 선행기술로서, 대한민국 등록특허번호 제10-2346272호에는 \"조류 농도를 예측하 는 방법 및 이를 수행하는 전자장치\"라는 명칭의 발명이 개시되어 있는데, 도 3a 및 도 3b를 참조하여 설명한다. 도 3a는 종래의 기술에 따른 조류농도를 예측하는 전자장치가 대상 수중지역 내 조류의 농도를 예측하고, 예측 된 조류의 농도를 기초로 알람 정보, 대비 정보를 출력하는 과정을 설명하기 위한 도면이고, 도 3b는 전자장치 가 대상 수중지역 내 조류의 농도를 예측하는 방법을 나타내는 동작흐름도이다. 도 3a를 참조하면, 종래의 기술에 따른 조류농도를 예측하는 전자장치는 대상 수중지역 내 설치된 관측소 로부터 대상 수중지역의 조류정보를 획득하고, 획득된 조류정보를 모니터링할 수 있다. 전자장치는 획득된 조류정보를 인공지능모델에 입력함으로써 대상 수중지역 내 조류의 농도를 예측하며, 예 측된 조류의 농도에 기초하여 조류 발생확률 또는 녹조 발생확률을 결정하고, 조류 발생확률 또는 녹조 발생확 률이 소정의 임계치 이상인 경우, 알람정보, 대비정보 및 대책정보 중 적어도 하나를 출력할 수 있다. 여기서, 알람정보는 조류 발생 또는 녹조 발생에 따라 사용자들에게 위험을 알리기 위한 시각적 및 청각적 컨텐 츠를 포함할 수 있다. 또한, 대비정보 또는 대책정보는 조류 발생 또는 녹조 발생 시 조류 또는 녹조를 제거하기 위한 행동요령, 정부 기관의 대책요령 등에 대한 정보를 더 포함할 수도 있다. 또한, 전자장치는 예측된 조류농도에 기초하여 조류 발생확률을 결정할 수 있다. 예를 들면, 조류 발생확 률은 조류농도에 기초한 녹조 발생확률을 의미할 수도 있다. 이때, 전자장치는 조류 발생확률이 소정의 임계치 이상인 경우, 녹조 발생 위험이 있는 것으로 결정하고, 녹조 발생과 관련된 알람정보, 녹조 발생 시 녹조로 인한 피해를 최소화하기 위한 대책정보, 대비정보 등을 출 력할 수 있다. 여기서, 전자장치는 프로세서, 메모리 및 네트워크 인터페이스를 포함할 수 있다. 프로세서는 메모리 내에 하나 이상의 인스트럭션을 실행함으로써 전자장치내 구성들의 전반적인 동작을 제 어한다. 또한, 프로세서는 전자장치 내 구성들을 제어함으로써, 관측소로부터 조류 정보를 획득하고, 획득된 조류 정보에 기초하여, 관측된 시점 이후의 조류농도를 예측하며, 조류 발생확률을 결정하고, 이러한 조류 발생확률 에 따른 소정의 알람정보 및 대비정보를 출력한다. 또한, 전자장치가 이용하는 인공지능모델은 딥러닝 기반의 인공지능모델 또는 인공신경망모델을 포함할 수 있다. 이러한 인공지능모델은 인공지능 학습 알고리즘에 따라 학습될 수 있는 인공지능모델일 수 있다. 이러한 인공지능모델은, 예를 들면, CNN(Convolutional Neural Network), DNN(Deep Neural Network), RNN(Recurrent Neural Network), RBM(Restricted Boltzmann Machine), DBN(Deep Belief Network), BRDNN(Bidirectional Recurrent Deep Neural Network) 또는 심층 Q-네트워크(Deep Q-Networks) 등이 있다. 또한, 이러한 인공지능모델은 적어도 하나의 레이어들 및 상기 레이어들의 연결강도에 관한 가중치를 포함하며, 가중치를 수정 및 갱신함으로써 학습될 수 있다. 이때, 전자장치는 복수의 관측소로부터 소정의 조류정보들을 기설정된 주기로 획득하고, 획득된 조류정 보에 기초하여 인공지능모델을 학습시킬 수 있다. 또한, 전자장치가 학습시키는 인공지능모델은 조류정보가 입력되면, 조류 발생확률을 출력할 수 있다. 이때, 인공지능모델은 관측소 정보가 획득된 현재 시점으로부터 소정의 시간이 경과한 미래 시점에서의 조류농 도를 출력할 수도 있다. 또한, 전자장치는 조류 발생확률에 기초하여, 알람정보 또는 대비정보 중 적어도 하나를 결정하고, 결정된 알람정보 또는 대비정보중 적어도 하나를 출력할 수 있다. 또한, 전자장치는 인공지능모델을 이용하여 조류농도를 시간의 흐름에 따라 시계열적 데이터로 출력할 수 있다. 또한, 전자장치는 인공지능모델로부터 출력된 조류 발생확률를 피드백 데이터로 활용할 수 있다. 또한, 전자장치는 알람정보 또는 대비정보중 적어도 하나를 피드백 데이터로 활용하여 인공지능모 델을 재학습시킬 수도 있다. 또한, 전자장치는 인공지능모델로부터 출력된 조류농도를 피드백 데이터로 활용하여 인공지능모델을 재학습 시킬 수도 있다. 또한, 전자장치는 서버와 연동함으로써, 대상 수중지역으로부터 조류정보를 획득하고, 획득된 조류정보 를 분석할 수도 있다. 예를 들면, 전자장치는 서버와 연동함으로써 조류정보를 분석하고, 분석된 조류정보에 기초하여 조류 농도를 예측할 수도 있다. 이때, 서버는 전자장치와 네트워크를 통하여 통신 연결되고, 데이터를 송수신할 수 있는 기타 컴퓨팅 장치를 포함할 수 있다. 도 3b를 참조하면, 종래의 기술에 따른 전자장치가 대상 수중지역 내 조류의 농도를 예측하는 방법은, 먼저, 전자장치는 전자장치와 연결된 대상 수중지역의 측정소로부터 조류 발생과 관련된 인자들을 포함하는 조류 정보를 획득할 수 있다(S21). 이때, 조류정보는 대상 수중지역의 측정소로부터 엽록소 농도, 수온, 전기 전도도, Ph 농도, 용존산소량, 탁도, 공기 온도, 강수량, 풍속, 풍향, 습도, 증기압, 이슬점, 대기압, 해수면기압, 조도, 일조량, 지면 온도, 해수면으로부터 소정의 깊이에 해당하는 수중 온도중 적어도 하나를 포함할 수 있다. 이때, 전자장치는 미리 설정된 주기에 따라 대상 수중지역의 측정소로부터 조류 발생과 관련된 인자들을 포 함하는 조류정보를 획득할 수 있다. 여기서, 전자장치는 15분 주기로 대상 수중지역의 측정소로부터 조류 발생과 관련된 인자들을 포함하는 조 류정보를 획득할 수 있다. 또한, 전자장치가 획득하는 조류정보, 또는 조류정보 내 인자들은 시간의 흐름 에 따라 변하는 시계열 데이터일 수 있다. 다음으로, 전자장치는 획득된 조류정보에 기초하여, 조류정보가 입력되면, 대상 수중지역 내 조류를 발생시 키는 엽록소의 농도를 출력하는 인공지능모델로부터 엽록소의 농도를 획득할 수 있다(S22). 이때, 전자장치가 이용하는 인공지능모델은 조류정보에 포함된 인자들 중 적어도 일부의 인자들만을 이용하 여 미리 학습되는 인공지능모델일 수도 있다. 이때, 엽록소의 농도는 엽록소a(chlorophyll a) 농도를 의미할 수 있다. 이때, 인공지능모델은 현재 시점으로부터 소정의 시간이 경과한 미래 시점까지, 시간의 흐름에 따른 엽록소의 농도 변화를 출력할 수도 있다. 다음으로, 전자장치는 인공지능모델로부터 획득된 엽록소의 농도에 기초하여 대상 수중지역 내 조류 발생확 률을 예측할 수 있다. 이때, 전자장치가 결정하는 조류 발생확률은 녹조 발생확률을 포함할 수 있다. 다음으로, 전자장치는 예측된 조류발생 확률값을 출력할 수 있다. 또한, 전자장치는 예측된 조류발생 확률값이 소정의 임계치 이상인 경우, 알람 정보 또는 대비 정보 중 적 어도 하나를 포함하는 조류 발생 관련 컨텐츠들을 생성하고, 생성된 컨텐츠들을 함께 출력할 수도 있다. 종래의 기술에 따른 조류농도 예측 방법에 따르면, 대상 수중지역의 관측소로부터 조류 발생과 관련된 인자를 포함하는 조류정보를 획득하고, 획득된 조류정보를 입력하면 대상 수중지역 내 조류를 발생시키는 엽록소의 농 도를 인공지능모델로부터 산출가능하며, 산출된 엽록소 농도에 기초하여 수중지역 내의 조류 발생확률을 예측할 수 있다. 종래의 기술에 따른 조류농도 예측 방법의 경우, 조류의 농도를 효과적으로 예측할 수 있고, 인공지능모델을 이 용하여 조류농도의 변화를 효과적으로 예측할 수 있지만, 시시각각 변화하는 유입원수에 포함된 탁도성분의 농 도에 상시 대응할 수 없다는 한계가 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 등록특허번호 제10-2346272호(등록일: 2021년 12월 29일), 발명의 명칭: \"조류 농도 를 예측하는 방법 및 이를 수행하는 전자장치\" (특허문헌 0002) 대한민국 등록특허번호 제10-2261819호(등록일: 2021년 6월 1일), 발명의 명칭: \"인공지능 시 뮬레이션을 이용한 정수처리장의 운영 시스템\" (특허문헌 0003) 일본 등록특허번호 제4,146,610호(등록일: 2008년 6월 27일), 발명의 명칭: \"탁도 예측 시스템, 탁도 제어 시스템 및 탁도 관리 시스템\" (특허문헌 0004) 일본 공개특허번호 제2000-338030호(공개일: 2000년 12월 8일), 발명의 명칭: \"남조류, 해초류 및 미립자의 계수 방법과 계수 장치\""}
{"patent_id": "10-2022-0069342", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "전술한 문제점을 해결하기 위한 본 발명이 이루고자 하는 기술적 과제는, 정수처리장으로 유입되는 유입원수에 포함된 탁도성분의 농도(유입탁도)를 기계학습 기반으로 사전에 예측하여 정수처리장 관리자가 대책을 검토할수 있는, 기계학습 기반의 정수처리장 유입탁도 예측 시스템 및 그 방법을 제공하기 위한 것이다. 본 발명이 이루고자 하는 다른 기술적 과제는, 기계학습 기반으로 녹조예측 알고리즘 및 탁도예측 알고리즘을 각각 활용하여 정수처리장의 유입탁도를 사전에 정확하게 예측함으로써 적정한 응집제를 주입할 수 있는, 기계 학습 기반의 정수처리장 유입탁도 예측 시스템 및 그 방법을 제공하기 위한 것이다."}
{"patent_id": "10-2022-0069342", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "전술한 기술적 과제를 달성하기 위한 수단으로서, 본 발명에 따른 기계학습 기반의 정수처리장 유입탁도 예측 시스템은, 정수처리장으로 유입되는 유입원수의 탁도인 유입탁도를 예측하는 시스템에 있어서, 취수원의 남조류 개체수 데이터, 기상 데이터와 수질 데이터, 및 정수처리장 유입수질 데이터 및 운영 데이터를 수집하는 데이터 수집부; 기계학습 기반의 제1 기계학습 알고리즘에 따라 학습된 제1 학습모델을 통해 남조류 개체수를 예측하고, 제2 기계학습 알고리즘에 따라 학습된 제2 학습모델을 통해 정수처리장 유입탁도를 예측하는 모델링 부; 상기 기상 데이터 및 수질 데이터를 이용하여 제1 및 제2 기계학습 알고리즘으로 각각 상기 제1 학습모델 및 제2 학습모델을 학습시키는 학습부; 및 각각 예측된 남조류 개체수와 예측된 정수처리장 유입탁도를 조합하 여 정수처리장 유입탁도 프로파일을 설정하는 유입탁도 프로파일 설정부를 포함하되, 상기 제1 기계학습 알고리 즘은 녹조예측 알고리즘이고, 상기 제2 기계학습 알고리즘은 탁도예측 알고리즘으로서, 적정한 응집제를 주입하 도록 소정 시간 이후의 상기 정수처리장의 유입탁도를 사전에 예측하는 것을 특징으로 한다. 여기서, 상기 모델링부는, 상기 제1 기계학습 알고리즘으로 학습시키는 제1 학습모델; 상기 제2 기계학습 알고 리즘으로 학습시키는 제2 학습모델; 상기 제1 학습모델을 통해 남조류 개체수를 예측하는 남조류 개체수 예측부; 및 상기 제2 학습모델을 통해 정수처리장 유입탁도를 예측하는 유입탁도 예측부를 포함할 수 있다. 여기서, 상기 제1 기계학습 알고리즘 및 제2 기계학습 알고리즘 각각은 상기 제1 학습모델 및 제2 학습모델의 사용 목적에 따라 DT(Decision Tree) 알고리즘, SVM(Support Vector Machine) 알고리즘, MLP(Multi Layer Perception) 알고리즘 및 RNN(Recurrent Neural Network) 알고리즘 중에서 선택될 수 있다. 여기서, 상기 학습부는 상기 모델링부의 제1 학습모델 및 제2 학습모델 각각에 대해 일주일의 제1 설정기간에 따라 남조류 개체수의 예측 및 녹조 패턴 예측을 학습시킬 수 있다. 여기서, 상기 유입탁도 프로파일 예측부는 상기 제1 설정기간보다 긴 일주일 이후의 제2 설정기간의 남조류 개 체수 프로파일을 예측할 수 있다. 여기서, 상기 학습부는 일주일 간격으로 측정된 남조류 개체수 데이터, 1일 간격으로 측정된 기상 데이터 및 수 질 데이터, 1시간 간격으로 측정된 정수처리장 유입탁도 데이터의 학습을 수행할 수 있다. 여기서, 상기 1일 간격으로 측정된 기상 데이터는 취수원에서의 기온, 일조시간 및 일 강수량을 포함하고, 상기 1일 간격으로 측정된 수질 데이터는 취수원에서의 수소이온농도지수(pH), 용존산소량(Dissolved Oxygen: DO), 생화학적 산소요구량(Biochemical Oxygen Demand: BOD), 화학적 산소요구량(Chemical Oxygen Demand: COD), 부 유물질(Suspended Solids: SS), 총질소(Total Nitorgen: TN), 총인(Total Phosphorus: TP), 총유기탄소(Total Organic Carbon: TOC), 수온, 클로로필-a 및 유량을 포함할 수 있다. 여기서, 상기 1시간 간격으로 측정된 정수처리장 유입탁도 데이터는 정수처리장에서의 온도, 탁도, pH, 전기전 도도 및 알칼리도를 포함할 수 있다. 본 발명에 따른 기계학습 기반의 정수처리장 유입탁도 예측 시스템은, 상기 유입탁도 프로파일 설정부에서 설정 된 정수처리장 유입탁도 프로파일에 따라 응집제 주입량을 결정하는 응집제 주입량 결정부를 추가로 포함할 수 있다. 본 발명에 따른 기계학습 기반의 정수처리장 유입탁도 예측 시스템은, 정수처리장 유입탁도 예측과 관련된 알림 정보 발생시 상기 알림정보를 정수처리장 관리자 단말에게 전송하는 알림정보 전송부를 추가로 포함할 수 있다. 한편, 전술한 기술적 과제를 달성하기 위한 다른 수단으로서, 본 발명에 따른 기계학습 기반의 정수처리장 유입 탁도 예측 방법은, 정수처리장으로 유입되는 유입원수의 탁도인 유입탁도를 예측하는 방법에 있어서, a) 취수원 의 남조류 개체수 데이터, 기상 데이터와 수질 데이터, 및 정수처리장 유입수질 데이터 및 운영 데이터를 수집 하는 단계; b) 제1 및 제2 기계학습 알고리즘에 따른 제1 및 제2 학습모델을 각각 선택하는 단계; c) 상기 기상 데이터 및 수질 데이터를 이용하여 제1 및 제2 기계학습 알고리즘으로 각각 상기 제1 및 제2 학습모델을 학습하 는 단계; d) 상기 제1 학습모델을 통해 남조류 개체수를 예측하고, 상기 제2 학습모델을 통해 정수처리장 유입탁도를 예측하는 단계; 및 e) 각각 예측된 남조류 개체수와 예측된 정수처리장 유입탁도를 조합하여 정수처리장 유입탁도 프로파일을 설정하는 단계를 포함하되, 상기 제1 기계학습 알고리즘은 녹조예측 알고리즘이고, 상기 제2 기계학습 알고리즘은 탁도예측 알고리즘으로서, 적정한 응집제를 주입하도록 소정 시간 이후의 상기 정수처 리장의 유입탁도를 사전에 예측하는 것을 특징으로 한다. 본 발명에 따른 기계학습 기반의 정수처리장 유입탁도 예측 방법은, f) 상기 정수처리장 유입탁도 프로파일에 따라 응집제 주입량을 결정하는 단계; 및 g) 정수처리장 유입탁도 예측과 관련된 알림정보 발생시 상기 알림정 보를 정수처리장 관리자 단말에게 전송하는 단계를 추가로 포함할 수 있다."}
{"patent_id": "10-2022-0069342", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 정수처리장으로 유입되는 유입원수에 포함된 탁도성분의 농도(유입탁도)를 기계학습 기반으 로 사전에 예측하여 정수처리장 관리자가 대책을 검토하고, 이에 따라, 최종적으로 정수처리 공정의 효율을 향 상시키며, 정수처리를 위한 유지관리 비용을 감소시킬 수 있다. 본 발명에 따르면, 기계학습 기반으로 녹조예측 알고리즘 및 탁도예측 알고리즘을 각각 활용하여 정수처리장의 유입탁도를 사전에 정확하게 예측함으로써 적정한 응집제를 주입할 수 있다."}
{"patent_id": "10-2022-0069342", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본 발명의 실시예를 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다 른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 또한, 명세서에 기재 된 \"…부\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어나 소프트웨어 또는 하드웨어 및 소프트웨어의 결합으로 구현될 수 있다. [기계학습 기반의 정수처리장 유입탁도 예측 시스템] 도 4는 본 발명의 실시예에 따른 기계학습 기반의 정수처리장 유입탁도 예측 시스템의 개략적인 구성도이고, 도 5는 본 발명의 실시예에 따른 기계학습 기반의 정수처리장 유입탁도 예측 시스템의 구체적인 구성도이다.도 4 및 도 5를 참조하면, 본 발명의 실시예에 따른 기계학습 기반의 정수처리장 유입탁도 예측 시스템은, 착수정, 혼화지, 응집지, 침전지, 여과지 및 정수지로 이루어지는 정수처리장 으로 유입되는 유입원수의 탁도인 유입탁도를 예측하는 시스템으로서, 데이터 수집부, 모델링부, 학습부, 유입탁도 프로파일 설정부, 응집제 주입량 결정부 및 알림정보 전송부를 포함하여 구성된다. 데이터 수집부는 취수원의 남조류 개체수 데이터, 기상 데이터와 수질 데이터, 및 정수처리장 유입수 질 데이터 및 운영 데이터를 수집한다. 모델링부는 기계학습 기반의 제1 기계학습 알고리즘에 따라 학습된 제1 학습모델을 통해 남조류 개체 수를 예측하고, 제2 기계학습 알고리즘에 따라 학습된 제2 학습모델을 통해 정수처리장 유입탁도를 예측한 다. 학습부는 상기 기상 데이터 및 수질 데이터를 이용하여 제1 및 제2 기계학습 알고리즘으로 각각 상기 제1 학습모델 및 제2 학습모델을 학습시킨다. 유입탁도 프로파일 설정부는 각각 예측된 남조류 개체수와 예측된 정수처리장 유입탁도를 조합하여 정수처 리장 유입탁도 프로파일을 설정한다. 여기서, 상기 제1 기계학습 알고리즘은 녹조예측 알고리즘이고, 상기 제2 기계학습 알고리즘은 탁도예측 알고리 즘으로서, 적정한 응집제를 주입하도록 소정 시간 이후의 상기 정수처리장의 유입탁도를 사전에 예측할 수 있다. 여기서, 상기 모델링부는, 도 5에 도시된 바와 같이, 상기 제1 기계학습 알고리즘으로 학습시키는 제1 학습모델; 상기 제2 기계학습 알고리즘으로 학습시키는 제2 학습모델; 상기 제1 학습모델을 통해 남조류 개체수를 예측하는 남조류 개체수 예측부; 및 상기 제2 학습모델을 통해 정수처리장 유입탁도를 예측하는 유입탁도 예측부를 포함할 수 있다. 또한, 응집제 주입량 결정부는 상기 유입탁도 프로파일 설정부에서 설정된 정수처리장 유입탁도 프로 파일에 따라 적정한 응집제 주입량을 결정한다. 이에 따라, 기계학습 기반으로 녹조예측 알고리즘 및 탁도예측 알고리즘을 각각 활용하여 정수처리장의 유입탁 도를 사전에 정확하게 예측함으로써 적정한 응집제를 주입할 수 있다. 또한, 알림정보 전송부는 정수처리장 유입탁도 예측과 관련된 알림정보 발생시 상기 알림정보를 정수처리 장 관리자 단말에게 전송할 수 있다. 이에 따라, 정수처리장으로 유입되는 유입원수에 포함된 탁도성분의 농도(유입탁도)를 기계학습 기반으로 사전 에 예측하여 정수처리장 관리자가 대책을 검토하고, 이에 따라, 최종적으로 정수처리 공정의 효율을 향상시키며, 정수처리를 위한 유지관리 비용을 감소시킬 수 있다. 한편, 도 6은 본 발명의 실시예에 따른 기계학습 기반의 정수처리장 유입탁도 예측 시스템에서 수집되는 데이터 를 구체적으로 설명하기 위한 도면이다. 본 발명의 실시예에 따른 기계학습 기반의 정수처리장 유입탁도 예측 시스템의 경우, 도 6에 도시된 바와 같이, 데이터 수집부는 취수원의 남조류 개체수 데이터, 기상 데이터 및 수질 데 이터를 수집한다. 구체적으로, 상기 남조류 개체수 데이터는 초분광 센서 등을 이용하여 취수원을 촬영하여 획득할 수 있지 만, 이에 국한되는 것은 아니다. 또한, 상기 기상 데이터는 기상 데이터 제공자, 예를 들면, 기상청으로부터 획득할 수 있다. 또한, 상기 수질 데이터는 취수원에 설치된 센서에 의해 획득할 수 있다. 또한, 상기 데이터 수집부는 정수처리장의 유입탁도 데이터 및 정수처리장 운영 데이터를 수집한다. 한편, 도 7은 본 발명의 실시예에 따른 기계학습 기반의 정수처리장 유입탁도 예측 시스템에서 학습부 및 모델 링부를 구체적으로 설명하기 위한 도면이다. 본 발명의 실시예에 따른 기계학습 기반의 정수처리장 유입탁도 예측 시스템의 경우, 도 7에 도시된 바와 같이, 제1 기계학습 알고리즘으로 학습된 제1 학습모델을 통해 취수원의 남조류 개체수를 예측하고, 제2 기계학습 알고리즘으로 학습된 제2 학습모델을 통해 정수처리장의 유입탁도 변화를 예측하는 모 델링부를 통해서, 상기 제1 학습모델에 따라 예측된 남조류 개체수 및 상기 제2 학습모델에 따라 예측된 정수처리장 유 입탁도를 조합하여 소정 시간 이후 정수처리장 유입탁도를 예측할 수 있다. 여기서, 상기 학습부는 학습 결과에 따라 복수의 기계학습 알고리즘 중에서 최적의 알고리즘을 선택하여 제1 학습모델 및 제2 학습모델에 따라 각각 학습을 수행할 수 있으며, 상기 제1 기계학습 알고리즘 및 제2 기계학습 알고리즘 각각은 상기 제1 학습모델 및 제2 학습모델의 사용 목적에 따라 DT(Decision Tree) 알고리즘, SVM(Support Vector Machine) 알고리즘, MLP(Multi Layer Perception) 알고리즘 및 RNN(Recurrent Neural Network) 알고리즘 중에서 선택될 수 있다. 이때, 상기 제1 기계학습 알고리즘 및 제2 기계학습 알고리즘 각각은 데이터베이스에 저장되어 학습부 에 의해 선택적으로 적용될 수 있다. 또한, 상기 학습부에서 학습된 데이터는 상기 데이터베이스에 저장되어 축적될 수 있고, 또한, 상기 데이터베이스에 저장된 데이터가 상기 학습부의 학습에 활용될 수 있다. 또한, 상기 학습부는 상기 모델링부의 제1 학습모델 및 제2 학습모델 각각에 대해 일주일 의 제1 설정기간에 따라 남조류 개체수의 예측 및 녹조 패턴 예측을 학습시킬 수 있다. 또한, 상기 유입탁도 프로파일 설정부는 상기 제1 설정기간보다 긴 일주일 이후의 제2 설정기간의 남조류 개체수 프로파일을 예측할 수 있다. 예를 들면, 상기 학습부는 일주일 간격으로 측정된 남조류 개체수 데이터, 1일 간격으로 측정된 기상 데이 터 및 수질 데이터, 1시간 간격으로 측정된 정수처리장 유입탁도 데이터의 학습을 수행할 수 있다. 여기서, 상기 1일 간격으로 측정된 기상 데이터는 취수원에서의 기온, 일조시간 및 일 강수량을 포함하고, 상기 1일 간격으로 측정된 수질 데이터는 취수원에서의 수소이온농도지수(pH), 용존산소량(Dissolved Oxygen: DO), 생화학적 산소요구량(Biochemical Oxygen Demand: BOD), 화학적 산소요구량(Chemical Oxygen Demand: COD), 부유물질(Suspended Solids: SS), 총질소(Total Nitorgen: TN), 총인(Total Phosphorus: TP), 총유기탄소(Total Organic Carbon: TOC), 수온, 클로로필-a 및 유량을 포함할 수 있지만, 이에 국한되는 것은 아니다. 여기서, 상기 1시간 간격으로 측정된 정수처리장 유입탁도 데이터는 정수처리장에서의 온도, 탁도, pH, 전 기전도도 및 알칼리도를 포함할 수 있지만, 이에 국한되는 것은 아니다. 결국, 본 발명의 실시예에 따르면, 기존의 물리적 모델에 비하여 개발 소요시간 및 비용을 줄이고, 빠른 시간내 에 다양한 시나리오에 대한 분석을 가능하게 한다. 특히, 기상 예측과 같은 미래 조건에 대한 가정 없이 실제 발생한 데이터만을 사용하여 예측함으로써 정수처리장 운영의 안정성을 향상시킬 수 있다. [기계학습 기반의 정수처리장 유입탁도 예측 방법] 도 8은 본 발명의 실시예에 따른 기계학습 기반의 정수처리장 유입탁도 예측 방법을 설명하기 위한 동작흐름도 이다. 도 8을 참조하면, 본 발명의 실시예에 따른 기계학습 기반의 정수처리장 유입탁도 예측 방법은, 정수처리장으로 유입되는 유입원수의 탁도인 유입탁도를 예측하는 방법으로서, 먼저, 취수원의 남조류 개 체수 데이터, 기상 데이터와 수질 데이터, 및 정수처리장 유입수질 데이터 및 운영 데이터를 수집한다(S110). 다음으로, 제1 및 제2 기계학습 알고리즘에 따른 제1 및 제2 학습모델(121, 122)을 각각 선택한다(S120). 여기서, 상기 제1 기계학습 알고리즘 및 제2 기계학습 알고리즘 각각은 상기 제1 학습모델 및 제2 학습모 델의 사용 목적에 따라 DT(Decision Tree) 알고리즘, SVM(Support Vector Machine) 알고리즘, MLP(Multi Layer Perception) 알고리즘 및 RNN(Recurrent Neural Network) 알고리즘 중에서 선택될 수 있다. 다음으로, 상기 기상 데이터 및 수질 데이터를 이용하여 제1 및 제2 기계학습 알고리즘으로 각각 상기 제1 및 제2 학습모델(121, 122)을 학습한다(S130). 예를 들면, 상기 제1 학습모델 및 제2 학습모델 각각에 대해 일주일의 제1 설정기간에 따라 남조류 개체수의 예측 및 녹조 패턴 예측을 학습시킬 수 있다. 이때, 일주일 간격으로 측정된 남조류 개체수 데이터, 1일 간격으로 측정된 기상 데이터 및 수질 데이터, 1시간 간격으로 측정된 정수처리장 유입탁도 데이터의 학습을 수행할 수 있다. 예를 들면, 상기 1일 간격으로 측정된 기상 데이터는 취수원에서의 기온, 일조시간 및 일 강수량을 포함하 고, 상기 1일 간격으로 측정된 수질 데이터는 취수원에서의 수소이온농도지수(pH), 용존산소량(Dissolved Oxygen: DO), 생화학적 산소요구량(Biochemical Oxygen Demand: BOD), 화학적 산소요구량(Chemical Oxygen Demand: COD), 부유물질(Suspended Solids: SS), 총질소(Total Nitorgen: TN), 총인(Total Phosphorus: TP), 총유기탄소(Total Organic Carbon: TOC), 수온, 클로로필-a 및 유량을 적어도 하나 이상 포함할 수 있다. 또한, 상기 1시간 간격으로 측정된 정수처리장 유입탁도 데이터는 정수처리장에서의 온도, 탁도, pH, 전기 전도도 및 알칼리도를 포함할 수 있다. 다음으로, 상기 제1 학습모델을 통해 남조류 개체수를 예측하고, 상기 제2 학습모델을 통해 정수처리 장 유입탁도를 예측한다(S140). 이때, 상기 제1 설정기간보다 긴 일주일 이후의 제2 설정기간의 남조류 개체수 프로파일을 예측할 수 있다. 다음으로, 각각 예측된 남조류 개체수와 예측된 정수처리장 유입탁도를 조합하여 정수처리장 유입탁도 프로파일 을 설정한다(S150). 다음으로, 정수처리장 유입탁도 프로파일에 따라 응집제 주입량을 결정한다(S160). 다음으로, 정수처리장 유입탁도 예측과 관련된 알림정보 발생시, 알림정보를 정수처리장 관리자 단말에게 전송한다(S170). 여기서, 상기 제1 기계학습 알고리즘은 녹조예측 알고리즘이고, 상기 제2 기계학습 알고리즘은 탁도예측 알고리 즘으로서, 적정한 응집제를 주입하도록 소정 시간 이후의 상기 정수처리장의 유입탁도를 사전에 예측할 수 있다. 결국, 본 발명의 실시예에 따르면, 정수처리장으로 유입되는 유입원수에 포함된 탁도성분의 농도(유입탁도)를 기계학습 기반으로 사전에 예측하여 정수처리장 관리자가 대책을 검토하고, 이에 따라, 최종적으로 정수처리 공정의 효율을 향상시키며, 정수처리를 위한 유지관리 비용을 감소시킬 수 있 다. 또한, 기계학습 기반으로 녹조예측 알고리즘 및 탁도예측 알고리즘을 각각 활용하여 정수처리장의 유입탁도를 사전에 정확하게 예측함으로써 적정한 응집제를 주입할 수 있다."}
{"patent_id": "10-2022-0069342", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "전술한 본 발명의 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가 지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본 발명의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으 로 해석되어야 한다.부호의 설명 100: 정수처리장 유입탁도 예측 시스템 110: 데이터 수집부 120: 모델링부 121: 제1 학습모델 122: 제2 학습모델 123: 남조류 개체수 예측부 124: 유입탁도 예측부 130: 학습부 140: 유입탁도 프로파일 설정부 150: 데이터베이스(DB) 160: 응집제 주입량 결정부 170: 알림정보 전송부 200: 정수처리장 300: 취수원 400: 정수처리장 관리자 단말 도면 도면1 도면2a 도면2b 도면2c 도면3a 도면3b 도면4 도면5 도면6 도면7 도면8"}
{"patent_id": "10-2022-0069342", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 종래의 기술에 따른 정수처리장치를 예시하는 구성도이다. 도 2a는 종래의 기술에 따른 인공지능 시뮬레이션을 이용한 정수처리장의 운영 시스템에 대한 구성도이고, 도 2b는 도 2a에 도시된 운영제어부의 구체적인 구성도이고, 도 2c는 종래의 기술에 따른 인공지능 시뮬레이션을 이용한 정수처리장의 운영 방법을 나타내는 동작흐름도이다. 도 3a는 종래의 기술에 따른 조류 농도를 예측하는 전자장치가 대상 수중지역 내 조류의 농도를 예측하고, 예측 된 조류의 농도를 기초로 알람 정보, 대비 정보를 출력하는 과정을 설명하기 위한 도면이고, 도 3b는 전자장치 가 대상 수중지역 내 조류의 농도를 예측하는 방법을 나타내는 동작흐름도이다. 도 4는 본 발명의 실시예에 따른 기계학습 기반의 정수처리장 유입탁도 예측 시스템의 개략적인 구성도이다. 도 5는 본 발명의 실시예에 따른 기계학습 기반의 정수처리장 유입탁도 예측 시스템의 구체적인 구성도이다. 도 6은 본 발명의 실시예에 따른 기계학습 기반의 정수처리장 유입탁도 예측 시스템에서 수집되는 데이터를 구 체적으로 설명하기 위한 도면이다. 도 7은 본 발명의 실시예에 따른 기계학습 기반의 정수처리장 유입탁도 예측 시스템에서 학습부 및 모델링부를 구체적으로 설명하기 위한 도면이다. 도 8은 본 발명의 실시예에 따른 기계학습 기반의 정수처리장 유입탁도 예측 방법을 설명하기 위한 동작흐름도 이다."}
