{"patent_id": "10-2023-0092998", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0012881", "출원번호": "10-2023-0092998", "발명의 명칭": "영상 제작을 위한 캐스팅 시스템 및 방법", "출원인": "주식회사 팀91", "발명자": "황제웅"}}
{"patent_id": "10-2023-0092998", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "영상 제작을 목적으로 일할 수 있는 그룹 공간을 나타내는 워크 스페이스에 캐스팅 관련 채용 공고를 등록하는채용 공고 등록부;상기 채용 공고에 대응하여 상기 워크 스페이스에 구직자 프로필 정보가 등록되는 경우, 상기 구직자 프로필 정보를 이용하여 이미지 및 키워드가 요약된 포토 카드 형태의 프로필 카드를 생성하는 프로필 카드 생성부; 및상기 프로필 카드가 구인자 단말기의 화면에 표시될 때, 구인자의 화면 터치 조작에 따른 제스처를 인식하고 그인식 정보에 기반하여 채용 여부를 결정하는 채용 결정부를 포함하는 것을 특징으로 하는 영상 제작을 위한 캐스팅 시스템."}
{"patent_id": "10-2023-0092998", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 채용 결정부는상기 제스처의 인식 정보에 기반하여 합격 여부를 판별하고, 합격으로 판별된 구직자를 채용 결정하며,상기 캐스팅 시스템은상기 구직자 프로필 정보를 상기 합격 여부와 매칭하여 아카이브에 저장하는 아카이브 저장부를 더 포함하는 것을 특징으로 하는 영상 제작을 위한 캐스팅 시스템."}
{"patent_id": "10-2023-0092998", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 채용 결정부는상기 제스처를 화면 중심을 기준으로 제1 방향으로 인식한 경우 합격으로 판별하고, 상기 제스처를 화면 중심을기준으로 제2 방향으로 인식한 경우 불합격 또는 보류로 판별하는 것을 특징으로 하는 영상 제작을 위한 캐스팅시스템."}
{"patent_id": "10-2023-0092998", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 프로필 카드는상기 구인자 단말기의 화면에 표시될 때 2개 또는 그 이상이 제공되며,상기 채용 결정부는상기 구인자의 화면 터치 조작에 따른 제스처를 통해 상기 2개 또는 그 이상의 프로필 카드 중에서 하나를 선별하는 토너먼트를 진행하여 최종 합격자를 채용하는 것을 특징으로 하는 영상 제작을 위한 캐스팅 시스템."}
{"patent_id": "10-2023-0092998", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2025-0012881-3-제1항에 있어서,상기 워크 스페이스에 예산, 시나리오, 데드라인(스케줄) 중 적어도 하나를 포함하는 필수 정보 값을 업로드하면, 인공지능(AI)을 기반으로 상기 필수 정보 값을 해석해서 업무 워크플로우 스케줄 표를 작성하는 AI 스케줄관리부를 더 포함하는 것을 특징으로 하는 영상 제작을 위한 캐스팅 시스템."}
{"patent_id": "10-2023-0092998", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 AI 스케줄 관리부는상기 업무 워크플로우 스케줄 표와 관련한 업무 진행 사항들을 AI를 통해 계산하여 그 결과를 퍼센트로 실시간보고하는 것을 특징으로 하는 영상 제작을 위한 캐스팅 시스템."}
{"patent_id": "10-2023-0092998", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,시나리오가 있는 프로젝트의 경우, 등장 캐릭터 정보를 입력하면 상기 입력된 등장 캐릭터 정보를 이용한 AI 알고리즘에 기반하여, 제스처나 토너먼트를 통해 선별된 합격자(배우)들을 다양하게 배치해서 보여주는 믹스 앤매치 기능을 제공하는 AI 캐릭터 관리부를 더 포함하는 것을 특징으로 하는 영상 제작을 위한 캐스팅 시스템."}
{"patent_id": "10-2023-0092998", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,새로운 워크스페이스에 시나리오가 있는 경우, 등장 캐릭터 정보를 입력하면 상기 입력된 등장 캐릭터 정보를이용한 AI 알고리즘에 기반하여, 아카이브에 저장되어 있는 상기 구직자 프로필 정보를 분석하고 그 분석 결과를 토대로 적합 인물들을 먼저 매치해주는 프리(pre) 캐스팅 기능을 사용하여 미리 선 후보들을 확인하는 AI 캐릭터 관리부를 더 포함하는 것을 특징으로 하는 영상 제작을 위한 캐스팅 시스템."}
{"patent_id": "10-2023-0092998", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "영상 제작을 위한 캐스팅 서버를 이용한 캐스팅 방법에 있어서,상기 캐스팅 서버가 영상 제작을 목적으로 일할 수 있는 그룹 공간을 나타내는 워크 스페이스에 캐스팅 관련 채용 공고를 등록하는 단계;상기 채용 공고에 대응하여 상기 워크 스페이스에 구직자 프로필 정보가 등록되는 경우, 상기 캐스팅 서버가 상기 구직자 프로필 정보를 이용하여 이미지 및 키워드가 요약된 포토 카드 형태의 프로필 카드를 생성하는 단계;및상기 프로필 카드가 구인자 단말기의 화면에 표시될 때, 상기 캐스팅 서버가 구인자의 화면 터치 조작에 따른제스처를 인식하고 그 인식 정보에 기반하여 채용 여부를 결정하는 단계를 포함하는 것을 특징으로 하는 영상 제작을 위한 캐스팅 방법.공개특허 10-2025-0012881-4-청구항 10 제9항에 있어서,상기 프로필 카드는상기 구인자 단말기의 화면에 표시될 때 2개 또는 그 이상이 제공되며,상기 채용 여부를 결정하는 단계는상기 구인자의 화면 터치 조작에 따른 제스처를 통해 상기 2개 또는 그 이상의 프로필 카드 중에서 하나를 선별하는 토너먼트를 진행하여 최종 합격자를 채용하는 단계를 포함하는 것을 특징으로 하는 영상 제작을 위한 캐스팅 방법."}
{"patent_id": "10-2023-0092998", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항에 있어서,시나리오가 있는 프로젝트의 경우, 등장 캐릭터 정보를 입력하면 상기 캐스팅 서버가 상기 입력된 등장 캐릭터정보를 이용한 AI 알고리즘에 기반하여, 제스처나 토너먼트를 통해 선별된 합격자(배우)들을 다양하게 배치해서보여주는 믹스 앤 매치 기능을 제공하는 단계를 더 포함하는 것을 특징으로 하는 영상 제작을 위한 캐스팅 방법."}
{"patent_id": "10-2023-0092998", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제9항에 있어서,새로운 워크스페이스에 시나리오가 있는 경우, 등장 캐릭터 정보를 입력하면 상기 캐스팅 서버가 상기 입력된등장 캐릭터 정보를 이용한 AI 알고리즘에 기반하여, 아카이브에 저장되어 있는 상기 구직자 프로필 정보를 분석하고 그 분석 결과를 토대로 적합 인물들을 먼저 매치해주는 프리(pre) 캐스팅 기능을 사용하여 미리 선 후보들을 확인하는 단계를 더 포함하는 것을 특징으로 하는 영상 제작을 위한 캐스팅 방법."}
{"patent_id": "10-2023-0092998", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 영상 제작을 위한 캐스팅 시스템은 영상 제작을 목적으로 일할 수 있는 그룹 공간을 나타내는 워크 스페이스에 캐스팅 관련 채용 공고를 등록하는 채용 공고 등록부; 상기 채용 공고에 대응하여 상 기 워크 스페이스에 구직자 프로필 정보가 등록되는 경우, 상기 구직자 프로필 정보를 이용하여 이미지 및 키워"}
{"patent_id": "10-2023-0092998", "section": "발명의_설명", "subsection": "요약", "paragraph": 2, "content": "드가 요약된 포토 카드 형태의 프로필 카드를 생성하는 프로필 카드 생성부; 및 상기 프로필 카드가 구인자 단말 기의 화면에 표시될 때, 구인자의 화면 터치 조작에 따른 제스처를 인식하고 그 인식 정보에 기반하여 채용 여부 를 결정하는 채용 결정부를 포함한다."}
{"patent_id": "10-2023-0092998", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 실시예들은 영상 제작을 위한 캐스팅 시스템 및 방법에 관한 것으로, 더욱 상세하게는 구직자의 간편 한 프로필 제작을 통해 채용 공고에 맞는 다양한 이력서를 간편하게 제작할 수 있으며, 이를 화면에 표시하여 구인자의 간단한 동작만으로 제스처 인식을 통해 채용 결정을 할 수 있는 영상 제작을 위한 캐스팅 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2023-0092998", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "캐스팅(Casting)은 영화, 텔레비전 드라마, 연극 등에서 배우, 댄서, 가수, 모델 등을 선발하기 위해 사전 제작 단계에서 행해지는 일을 의미한다. 일반적으로, 드라마, 영화, 광고 등과 같은 아트 및 미디어 산업에서 이루어지는 캐스팅(Casting)은 영화, 드라 마 또는 연극 등에 출연할 대상인 배우, 댄서, 가수, 모델 등을 선발하거나, 감독, 프로듀서 등의 연출자를 섭 외하기 위한 사전 제작 단계로서 추천 또는 공개 오디션을 통해 이루어지고 있다. 추천에 의한 캐스팅은 연출자 또는 출연자의 추천을 받아 특정 배역의 후보자 섭외가 이루어지는 것으로서 대개 주연급 배우에 국한되어 있고 인맥에 의존하는 문제점이 있다.공개 오디션의 경우에는 특정 배역 또는 노래의 가수 선정 등을 목적으로 일반인, 연예인 및 성우 등을 대상으 로 소정의 테스트를 수행하게 하는 것으로서 정해진 장소 및 일정에만 한시적으로 진행됨에 따라 지역적 한계 및 시간적 한계가 있어 후보자의 선발이 제한적인 문제점이 있다. 캐스팅을 전문으로 수행하는 캐스팅 디렉터(Casting Director)가 각각의 배역에 적합한 후보자를 찾아내 섭외하 기도 하는데, 이 경우 적합한 후보자를 찾아내기 위해 소모되는 시간과 비용이 크게 소모되는 문제점이 있다. 관련 선행기술로는 대한민국 등록특허공보 제10-2477576호(발명의 명칭: 인공지능을 이용한 연예인 자동 캐스팅 서비스 제공방법, 서버 및 컴퓨터프로그램, 공고일자: 2022.12.14.)가 있다."}
{"patent_id": "10-2023-0092998", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 일 실시예는 구직자의 간편한 프로필 제작을 통해 채용 공고에 맞는 다양한 이력서를 간편하게 제작 할 수 있으며, 이를 화면에 표시하여 구인자의 간단한 동작만으로 제스처 인식을 통해 채용 결정을 할 수 있는 영상 제작을 위한 캐스팅 시스템 및 방법을 제공한다. 본 발명이 해결하고자 하는 과제는 이상에서 언급한 과제(들)로 제한되지 않으며, 언급되지 않은 또 다른 과제 (들)은 아래의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0092998", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 영상 제작을 위한 캐스팅 시스템은 영상 제작을 목적으로 일할 수 있는 그룹 공간 을 나타내는 워크 스페이스에 캐스팅 관련 채용 공고를 등록하는 채용 공고 등록부; 상기 채용 공고에 대응하여 상기 워크 스페이스에 구직자 프로필 정보가 등록되는 경우, 상기 구직자 프로필 정보를 이용하여 이미지 및 키"}
{"patent_id": "10-2023-0092998", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "워드가 요약된 포토 카드 형태의 프로필 카드를 생성하는 프로필 카드 생성부; 및 상기 프로필 카드가 구인자 단말기의 화면에 표시될 때, 구인자의 화면 터치 조작에 따른 제스처를 인식하고 그 인식 정보에 기반하여 채용 여부를 결정하는 채용 결정부를 포함한다. 상기 채용 결정부는 상기 제스처의 인식 정보에 기반하여 합격 여부를 판별하고, 합격으로 판별된 구직자를 채 용 결정하며, 상기 캐스팅 시스템은 상기 구직자 프로필 정보를 상기 합격 여부와 매칭하여 아카이브에 저장하 는 아카이브 저장부를 더 포함할 수 있다. 상기 채용 결정부는 상기 제스처를 화면 중심을 기준으로 제1 방향으로 인식한 경우 합격으로 판별하고, 상기 제스처를 화면 중심을 기준으로 제2 방향으로 인식한 경우 불합격 또는 보류로 판별할 수 있다. 상기 프로필 카드는 상기 구인자 단말기의 화면에 표시될 때 2개 또는 그 이상이 제공되며, 상기 채용 결정부는 상기 구인자의 화면 터치 조작에 따른 제스처를 통해 상기 2개 또는 그 이상의 프로필 카드 중에서 하나를 선별 하는 토너먼트를 진행하여 최종 합격자를 채용할 수 있다. 본 발명의 일 실시예에 따른 영상 제작을 위한 캐스팅 시스템은 상기 워크 스페이스에 예산, 시나리오, 데드라 인(스케줄) 중 적어도 하나를 포함하는 필수 정보 값을 업로드하면, 인공지능(AI)을 기반으로 상기 필수 정보 값을 해석해서 업무 워크플로우 스케줄 표를 작성하는 AI 스케줄 관리부를 더 포함할 수 있다. 상기 AI 스케줄 관리부는 상기 업무 워크플로우 스케줄 표와 관련한 업무 진행 사항들을 AI를 통해 계산하여 그 결과를 퍼센트로 실시간 보고할 수 있다. 본 발명의 일 실시예에 따른 영상 제작을 위한 캐스팅 시스템은 시나리오가 있는 프로젝트의 경우, 등장 캐릭터 정보를 입력하면 상기 입력된 등장 캐릭터 정보를 이용한 AI 알고리즘에 기반하여, 제스처나 토너먼트를 통해 선별된 합격자(배우)들을 다양하게 배치해서 보여주는 믹스 앤 매치 기능을 제공하는 AI 캐릭터 관리부를 더 포 함할 수 있다. 본 발명의 일 실시예에 따른 영상 제작을 위한 캐스팅 시스템은 새로운 워크스페이스에 시나리오가 있는 경우, 등장 캐릭터 정보를 입력하면 상기 입력된 등장 캐릭터 정보를 이용한 AI 알고리즘에 기반하여, 아카이브에 저 장되어 있는 상기 구직자 프로필 정보를 분석하고 그 분석 결과를 토대로 적합 인물들을 먼저 매치해주는 프리 (pre) 캐스팅 기능을 사용하여 미리 선 후보들을 확인하는 AI 캐릭터 관리부를 더 포함할 수 있다. 본 발명의 일 실시예에 따른 영상 제작을 위한 캐스팅 방법은 상기 캐스팅 서버가 영상 제작을 목적으로 일할 수 있는 그룹 공간을 나타내는 워크 스페이스에 캐스팅 관련 채용 공고를 등록하는 단계; 상기 채용 공고에 대 응하여 상기 워크 스페이스에 구직자 프로필 정보가 등록되는 경우, 상기 캐스팅 서버가 상기 구직자 프로필 정"}
{"patent_id": "10-2023-0092998", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 3, "content": "보를 이용하여 이미지 및 키워드가 요약된 포토 카드 형태의 프로필 카드를 생성하는 단계; 및 상기 프로필 카 드가 구인자 단말기의 화면에 표시될 때, 상기 캐스팅 서버가 구인자의 화면 터치 조작에 따른 제스처를 인식하 고 그 인식 정보에 기반하여 채용 여부를 결정하는 단계를 포함한다. 상기 프로필 카드는 상기 구인자 단말기의 화면에 표시될 때 2개 또는 그 이상이 제공되며, 상기 채용 여부를 결정하는 단계는 상기 구인자의 화면 터치 조작에 따른 제스처를 통해 상기 2개 또는 그 이상의 프로필 카드 중 에서 하나를 선별하는 토너먼트를 진행하여 최종 합격자를 채용하는 단계를 포함할 수 있다. 본 발명의 일 실시예에 따른 영상 제작을 위한 캐스팅 방법은 시나리오가 있는 프로젝트의 경우, 등장 캐릭터 정보를 입력하면 상기 캐스팅 서버가 상기 입력된 등장 캐릭터 정보를 이용한 AI 알고리즘에 기반하여, 제스처 나 토너먼트를 통해 선별된 합격자(배우)들을 다양하게 배치해서 보여주는 믹스 앤 매치 기능을 제공하는 단계 를 더 포함할 수 있다. 본 발명의 일 실시예에 따른 영상 제작을 위한 캐스팅 방법은 새로운 워크스페이스에 시나리오가 있는 경우, 등 장 캐릭터 정보를 입력하면 상기 캐스팅 서버가 상기 입력된 등장 캐릭터 정보를 이용한 AI 알고리즘에 기반하 여, 아카이브에 저장되어 있는 상기 구직자 프로필 정보를 분석하고 그 분석 결과를 토대로 적합 인물들을 먼저 매치해주는 프리(pre) 캐스팅 기능을 사용하여 미리 선 후보들을 확인하는 단계를 더 포함할 수 있다. 기타 실시예들의 구체적인 사항들은 상세한 설명 및 첨부 도면들에 포함되어 있다."}
{"patent_id": "10-2023-0092998", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따르면, 구직자의 간편한 프로필 제작을 통해 채용 공고에 맞는 다양한 이력서를 간편하 게 제작할 수 있으며, 이를 화면에 표시하여 구인자의 간단한 동작만으로 제스처 인식을 통해 채용 결정을 할 수 있다."}
{"patent_id": "10-2023-0092998", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및/또는 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시예들을 참조하면 명확해질 것이다. 그러나, 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니 라 서로 다른 다양한 형태로 구현될 것이며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하며, 본 발명이"}
{"patent_id": "10-2023-0092998", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "속하는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성요소를 지칭한다."}
{"patent_id": "10-2023-0092998", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "또한, 이하 실시되는 본 발명의 바람직한 실시예는 본 발명을 이루는 기술적 구성요소를 효율적으로 설명하기 위해 각각의 시스템 기능구성에 기 구비되어 있거나, 또는 본 발명이 속하는 기술분야에서 통상적으로 구비되는 시스템 기능 구성은 가능한 생략하고, 본 발명을 위해 추가적으로 구비되어야 하는 기능 구성을 위주로 설명한"}
{"patent_id": "10-2023-0092998", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "다. 만약 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자라면, 하기에 도시하지 않고 생략된 기능 구성 중에서 종래에 기 사용되고 있는 구성요소의 기능을 용이하게 이해할 수 있을 것이며, 또한 상기와 같이 생략된 구성 요소와 본 발명을 위해 추가된 구성 요소 사이의 관계도 명백하게 이해할 수 있을 것이다. 또한, 이하의 설명에 있어서, 신호 또는 정보의 \"전송\", \"통신\", \"송신\", \"수신\" 기타 이와 유사한 의미의 용어 는 일 구성요소에서 다른 구성요소로 신호 또는 정보가 직접 전달되는 것뿐만이 아니라 다른 구성요소를 거쳐 전달되는 것도 포함한다. 특히 신호 또는 정보를 일 구성요소로 \"전송\" 또는 \"송신\"한다는 것은 그 신호 또는 정보의 최종 목적지를 지시하는 것이고 직접적인 목적지를 의미하는 것이 아니다. 이는 신호 또는 정보의 \"수 신\"에 있어서도 동일하다. 이하에서는 첨부된 도면을 참조하여 본 발명의 실시예들을 상세히 설명하기로 한다. 도 1은 본 발명의 일 실시예에 따른 영상 제작을 위한 캐스팅 시스템의 네트워크 구성을 도시한 도면이고, 도 2 는 도 1의 캐스팅 서버의 상세 구성을 설명하기 위해 도시한 블록도이다. 도 1 및 도 2를 참조하면, 본 발명의 일 실시예에 따른 영상 제작을 위한 캐스팅 시스템은 상기 캐스팅 서버 로 구현될 수 있다. 상기 캐스팅 서버는 구직자 단말기 및 구인자 단말기와 통신망 을 통해 연결되어 통신을 수행할 수 있다. 상기 구직자 단말기는 구직자가 소유한 통신 단말기로서, 스마트폰, 스마트패드, 컴퓨터, 노트북 등을 포 함할 수 있으며, 상기 구직자는 영상 프리랜서로서 배우, 스탭(제작팀원, 연출팀원, 조명팀원 등) 등을 포함하 는 개념으로 이해될 수 있다. 상기 구인자 단말기는 구인자가 소유한 통신 단말기로서, 스마트폰, 스마트패드, 컴퓨터, 노트북 등을 포 함할 수 있으며, 상기 구인자는 제작사, 감독 등을 포함하는 개념으로 이해될 수 있다. 상기 캐스팅 서버는 상기 채용 공고 등록부, 프로필 카드 생성부, 채용 결정부, 아카이브 저장부, 및 제어부를 포함하여 구성될 수 있다. 상기 채용 공고 등록부는 워크 스페이스에 캐스팅 관련 채용 공고를 등록할 수 있다. 상기 채용 공고가 등록되면, 구직자는 상기 등록된 채용 공고와 관련하여 구직자 프로필 정보를 구직자 단말기를 통해 상기 워크 스페이스에 등록할 수 있다. 여기서, 상기 워크 스페이스는 영상 제작을 목적으로 일할 수 있는 그룹 공간을 가리킬 수 있다. 상기 워크 스 페이스의 그룹원은 관리자와 일반원으로 나뉘며 관리자가 다수의 그룹원을 초대할 수 있다. 예컨대, 상기 관리 자는 상기 구인자이고 상기 일반원은 상기 구직자일 수 있다. 상기 워크 스페이스에 저장된 정보는 그룹원이 확인할 수 있으며, 가입자는 여러 워크 스페이스의 그룹원이 될 수 있다. 채용 공고 시 상기 워크 스페이스에는 구직자가 볼 수 있는 정보, 예를 들면 필모그래피, 기업 정보, 채용 정보, 국가 등이 등록될 수 있다. 국제 프로젝트의 경우, 상기 워크 스페이스에서 소통하는 업무는 다른 언어일 경우 실시간으로 번역될 수 있다. 상기 프로필 카드 생성부는 상기 채용 공고에 대응하여 상기 워크 스페이스에 구직자 프로필 정보가 등록"}
{"patent_id": "10-2023-0092998", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "되는 경우, 상기 구직자 프로필 정보를 이용하여 이미지 및 키워드가 요약된 포토 카드 형태의 프로필 카드를 생성할 수 있다. 이미지가 중요한 배우의 경우 첫인상으로 채용되는 경우가 많다. 그리고 프리랜서 특성상 특정 업무를 위해 고 용된다. 따라서, 본 발명의 일 실시예에서는 수많은 지원자(구직자)들을 빠르게 선별하는 기능이 필요하며, 이 를 위해 상기 프로필 카드가 활용될 수 있다. 여기서, 상기 프로필 카드는 사진으로 한정되지 않는다. 후술하는 채용 결정 시 사진으로만 채용 결정이 어려 운 경우가 발생할 수 있기 때문이다. 이러한 경우, 본 발명의 일 실시예에서는 동영상을 보는 기능으로 변환하 는 UI/UX를 제공하여 채용 결정의 어려움을 해결할 수 있다."}
{"patent_id": "10-2023-0092998", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "상기 채용 결정부는 도 3에 도시된 바와 같이, 이미지 및 키워드가 요약된 포토 카드 형태의 프 로필 카드가 구인자 단말기의 화면에 표시될 때, 구인자의 화면 터치 조작에 따른 제스처를 인식하고 그 인식 정보에 기반하여 채용 여부를 결정할 수 있다. 즉, 상기 채용 결정부는 상기 제스처의 인식 정보에 기반하여 합격 여부를 판별하고, 합격으로 판별된 구 직자를 채용 결정할 수 있다. 이때, 상기 채용 결정부는 상기 제스처를 화면 중심을 기준으로 제1 방향으 로 인식한 경우 합격으로 판별하고, 상기 제스처를 화면 중심을 기준으로 제2 방향으로 인식한 경우 불합격 또 는 보류로 판별할 수 있다. 여기서, 상기 제1 방향은 상기 구인자 단말기의 화면 우측 방향을 가리킬 수 있으며, 상기 제2 방향은 상 기 구인자 단말기의 화면 좌측 방향을 가리킬 수 있다. 다시 말해, 상기 구인자 단말기의 화면에는 구직자들 각각의 프로필 카드가 표시되는데, 이때 구인자 는 화면에 표시된 프로필 카드를 보고서 채용 의사가 있으면 제1 방향으로 스와이핑(swiping)하고 채용 의 사가 없으면 제2 방향으로 스와이핑(swiping)하여 빠른 속도로 합격 또는 불합격(보류)을 판별할 수 있다. 여 기서, 보류 판별은 현재 채용 중인 작품에는 캐스팅하지 않지만(불합격) 다른 작품 캐스팅 후보로 분류하기 위 한 것이다. 한편, 상기 프로필 카드는 도 3과는 달리 상기 구인자 단말기의 화면에 표시될 때 2개 또는 그 이상 이 제공될 수 있다. 이러한 경우, 상기 채용 결정부는 상기 구인자의 화면 터치 조작에 따른 제스처를 통 해 상기 2개 또는 그 이상의 프로필 카드 중에서 하나를 선별하는 토너먼트를 진행하여 최종 합격자를 채 용할 수 있다. 또한, 상기 채용 결정부는 상기 구인자의 화면 터치 조작에 따른 제스처 기능을 상기 워크 스페이스에 라 이브로 화면 공유하여 팀원들과 소통하며 채용 여부를 결정할 수도 있다. 이를 위해, 상기 채용 결정부는 공유 화면상에 투표 기능을 마련하여 팀원들의 투표 결과에 따라 해당 구직자의 합격 여부를 판별하고, 합격으 로 판별된 구직자를 채용 결정할 수 있다. 상기 아카이브 저장부는 상기 구직자 프로필 정보를 상기 합격 여부와 매칭하여 아카이브에 저장할 수 있 다. 상기 아카이브는 사이트 내에 제공되는 정보(인력, 장소, 장비 등)를 상기 워크 스페이스에 저장하는 기능 을 한다. 영화 제작 시에는 감독 중심으로 여러 업무팀이 움직이며, 수집된 정보를 공유하여 의사 결정을 한다. 그래서 업무별로 정보를 서로 간 공유하는 것이 중요하다. 그리고 프로젝트 산업 특성상 해당 업무에 적합하지 않은 정보(인력, 장소, 장비 등)라도 추후 다른 프로젝트에 활용될 수 있다. 따라서, 상기 아카이브가 필요하다. 상기 아카이브는 정보(인력, 장소, 장비 등)별로 다른 형태로 저장하며, 다른 기능을 제공할 수 있다. 상기 아 카이브는 직접 커스터마이징 한 워크 스페이스를 셀렉하여 저장할 수 있다. 상기 아카이브에서 정보를 보관할 수 있는 폴더를 생성할 수 있으며, 폴더명을 설정할 수도 있다. 저장한 정보는 폴더별로 정리할 수 있다. 인력 정보의 경우, '채용공고 지원자' 또는 '개인정보 제공 동의한 자'만 제공하며, 이렇게 제공된 인력 정보는 상기 아카이브에 저장될 수 있다. 상기 저장된 인력 정보는 소유자 본인이 확인할 수 있으며, 삭제할 수 있다. 아카이브 특정 폴더에 저장되어 있는 인물들을 해석한 AI가 아직 구인자가 열람해보지 못한 추가 구직자들을 추 천해줄 수 있다. 상기 아카이브에 저장된 장소는 실시간 업데이트 될 수 있다. 예를 들면, 상기 아카이브에 저장되어 있는 공사 전 광화문 광장이 추후 공사 후 업로드 된 사진들로 자동 업데이트 될 수 있다. 상기 제어부는 상기 캐스팅 서버, 즉 상기 채용 공고 등록부, 상기 프로필 카드 생성부, 상기 채용 결정부, 상기 아카이브 저장부 등의 동작을 전반적으로 제어할 수 있다. 상기 제어부 는 상기 채용 공고 등록부, 상기 프로필 카드 생성부, 상기 채용 결정부, 상기 아카이브 저장부 등의 구성요소들을 기능적으로 일부 또는 전체 포함하여 구현될 수 있다. 즉, 상기 제어부는 상기 구성요소들의 일부 기능을 수행할 수 있으며, 또 달리 상기 구성요소들의 전체 기능을 수행할 수도 있다. 상기 제어부는 상기 캐스팅 서버의 전체적인 동작을 제어하며, CPU 등과 같은 프로세서를 포함할 수 있다. 상기 제어부는 입출력부를 통해 수신한 사용자 입력에 대응되는 동작을 수행하도록, 상기 캐스팅 서버에 포함된 다른 구성들을 제어할 수 있다. 여기서 상기 프로세서는 컴퓨팅 장치 내에서 명령어를 처리할 수 있는데, 이런 명령어로는, 예컨대 고속 인터페 이스에 접속된 디스플레이처럼 외부 입력, 출력 장치상에 GUI(Graphic User Interface)를 제공하기 위한 그래픽 정보를 표시하기 위해 메모리나 저장 장치에 저장된 명령어를 들 수 있다. 다른 실시예로서, 다수의 프로세서 및(또는) 다수의 버스가 적절히 다수의 메모리 및 메모리 형태와 함께 이용 될 수 있다. 또한 상기 프로세서는 독립적인 다수의 아날로그 및(또는) 디지털 프로세서를 포함하는 칩들이 이 루는 칩셋으로 구현될 수 있다. 도 4는 도 1의 캐스팅 서버의 다른 실시예에 따른 상세 구성을 설명하기 위해 도시한 블록도이다. 도 1 및 도 4를 참조하면, 다른 실시예에 따른 캐스팅 서버는 채용 공고 등록부, 프로필 카드 생성부 , 채용 결정부, 아카이브 저장부, AI 스케줄 관리부, AI 캐릭터 관리부, 및 제어부 를 포함하여 구성될 수 있다. 여기서, 상기 채용 공고 등록부, 상기 프로필 카드 생성부, 상기 채용 결정부, 상기 아카이브 저장부, 및 제어부는 각각 도 2의 채용 공고 등록부, 상기 프로필 카드 생성부, 상기 채용 결정부, 상기 아카이브 저장부, 및 제어부와 동일 또는 유사한 기능을 하는 구성요소들이다. 따라서, 본 실시예에서는 상기의 구성요소들(410, 420, 430, 440)을 제외한 나머지 구성요소들, 즉 상기 AI 스 케줄 관리부 및 상기 AI 캐릭터 관리부에 대해서만 자세히 설명하기로 한다. 상기 AI 스케줄 관리부는 상기 워크 스페이스에 예산, 시나리오, 데드라인(스케줄) 중 적어도 하나를 포함 하는 필수 정보 값을 업로드하면, 인공지능(AI)을 기반으로 상기 필수 정보 값을 해석해서 업무 워크플로우 스 케줄 표(예: 몇 월 며칠까지 캐스팅 확정, 몇 월 며칠에 프리 프로덕션 미팅 등)를 작성할 수 있다. 이때, 상 기 필수 정보 값은 상기 구인자 단말기를 통해 상기 캐스팅 서버에 업로드될 수 있다. 상기 AI 스케줄 관리부는 상기 업무 워크플로우 스케줄 표와 관련한 업무 진행 사항들을 AI를 통해 계산할 수 있다. 상기 AI 스케줄 관리부는 상기 계산 결과를 퍼센트로 변환하여 상기 구인자 단말기에 실시 간으로 보고할 수 있다(예: 프렙 75% 완료). 이때, 상기 AI 스케줄 관리부는 상기 계산 결과를 퍼센트로 변환하지 않고 상기 구인자 단말기에 보고할 수도 있다. 또한, 상기 AI 스케줄 관리부는 상기 업무 워크플로우 스케줄 표에 따라 스케줄에 맞게 움직이는지를 확인할 수 있다. 상기 AI 캐릭터 관리부는 시나리오가 있는 프로젝트의 경우, 등장 캐릭터 정보를 입력하면 상기 입력된 등 장 캐릭터 정보를 이용한 AI 알고리즘에 기반하여, 제스처나 토너먼트를 통해 선별된 합격자(배우)들을 다양하 게 배치해서 보여주는 믹스 앤 매치 기능을 제공할 수 있다(예: 로맨스 영화 남주와 여주의 캐스팅 후보들을 다 양하게 배치해 둘의 케미(어울림) 확인). 이때, 상기 등장 캐릭터 정보는 상기 구인자 단말기를 통해 상 기 캐스팅 서버에 입력될 수 있다. 한편, 상기 AI 캐릭터 관리부는 새로운 워크스페이스에 시나리오가 있는 경우, 등장 캐릭터 정보를 입력하 면 상기 입력된 등장 캐릭터 정보를 이용한 AI 알고리즘에 기반하여, 아카이브에 저장되어 있는 상기 구직자 프 로필 정보를 분석하고 그 분석 결과를 토대로 적합 인물들을 먼저 매치해주는 프리(pre) 캐스팅 기능을 사용하 여 미리 선 후보들을 확인할 수 있다(예: 30대 남성). 이상에서 설명된 장치는 하드웨어 구성 요소, 소프트웨어 구성 요소, 및/또는 하드웨어 구성 요소 및 소프트웨 어 구성 요소의 조합으로 구현될 수 있다. 예를 들어, 실시예들에서 설명된 장치 및 구성 요소는, 예를 들어, 프로세서, 컨트롤러, ALU(arithmetic logic unit), 디지털 신호 프로세서(digital signal processor), 마이크 로컴퓨터, FPA(field programmable array), PLU(programmable logic unit), 마이크로프로세서, 또는 명령 (instruction)을 실행하고 응답할 수 있는 다른 어떠한 장치와 같이, 하나 이상의 범용 컴퓨터 또는 특수 목적 컴퓨터를 이용하여 구현될 수 있다. 처리 장치는 운영 체제(OS) 및 상기 운영 체제 상에서 수행되는 하나 이상 의 소프트웨어 애플리케이션을 수행할 수 있다. 또한, 처리 장치는 소프트웨어의 실행에 응답하여, 데이터를 접 근, 저장, 조작, 처리 및 생성할 수도 있다. 이해의 편의를 위하여, 처리 장치는 하나가 사용되는 것으로 설명"}
{"patent_id": "10-2023-0092998", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "된 경우도 있지만, 해당 기술분야에서 통상의 지식을 가진 자는, 처리 장치가 복수 개의 처리 요소(processing element) 및/또는 복수 유형의 처리 요소를 포함할 수 있음을 알 수 있다. 예를 들어, 처리 장치는 복수 개의 프로세서 또는 하나의 프로세서 및 하나의 컨트롤러를 포함할 수 있다. 또한, 병렬 프로세서(parallelprocessor)와 같은, 다른 처리 구성(processing configuration)도 가능하다. 소프트웨어는 컴퓨터 프로그램(computer program), 코드(code), 명령(instruction), 또는 이들 중 하나 이상의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결합적으로 (collectively) 처리 장치를 명령할 수 있다. 소프트웨어 및/또는 데이터는, 처리 장치에 의하여 해석되거나 처리 장치에 명령 또는 데이터를 제공하기 위하여, 어떤 유형의 기계, 구성요소(component), 물리적 장치, 가상 장치(virtual equipment), 컴퓨터 저장 매체 또는 장치, 또는 전송되는 신호 파(signal wave)에 영구적으로, 또는 일시적으로 구체화(embody)될 수 있다. 소프트웨어는 네트워크로 연결된 컴퓨터 시스템 상에 분산되어서, 분산된 방법으로 저장되거나 실행될 수도 있다. 소프트웨어 및 데이터는 하나 이상의 컴퓨터 판독 가능 기록 매체에 저장될 수 있다. 도 5는 본 발명의 일 실시예에 따른 영상 제작을 위한 캐스팅 방법을 설명하기 위해 도시한 흐름도이다. 여기서 설명하는 영상 제작을 위한 캐스팅 방법은 캐스팅 서버(도 1의 100 참조)에 의해 수행될 수 있다. 본 발명의 일 실시예에 따른 영상 제작을 위한 캐스팅 시스템은 상기 캐스팅 서버의 구성요소 및 기능 등을 포함하 는 개념으로 이해될 수 있다. 한편, 상기 영상 제작을 위한 캐스팅 방법은 본 발명의 하나의 실시예에 불과하며, 그 이외에 필요에 따라 다양 한 단계들이 아래와 같이 부가될 수 있고, 하기의 단계들도 순서를 변경하여 실시될 수 있으므로, 본 발명이 하 기에 설명하는 각 단계 및 그 순서에 한정되는 것은 아니다. 도 1 및 도 5를 참조하면, 단계에서 상기 캐스팅 서버는 상기 구인자 단말기를 통해 입력된 캐 스팅 관련 채용 공고를 상기 워크 스페이스에 등록할 수 있다. 다음으로, 단계에서 상기 캐스팅 서버는 상기 구직자 단말기를 통해 입력된 구직자 프로필 정보 를 상기 워크 스페이스에 등록할 수 있다. 다음으로, 단계에서 상기 캐스팅 서버는 상기 등록된 구직자 프로필 정보를 이용하여 이미지 및 키워"}
{"patent_id": "10-2023-0092998", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "드가 요약된 포토 카드 형태의 프로필 카드(도 3 참조)를 생성할 수 있다. 다음으로, 단계에서 상기 캐스팅 서버는 상기 생성된 프로필 카드를 상기 구인자 단말기의 화면 에 표시할 수 있다. 다음으로, 단계에서 상기 캐스팅 서버는 구인자의 화면 터치 조작에 따른 제스처를 인식할 수 있다. 다음으로, 단계에서 상기 캐스팅 서버는 제스처 인식 정보에 기반하여 해당 구직자에 대한 채용 여부 를 결정할 수 있다. 실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등 을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 실시예를 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판 독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CDROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체 (magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도 록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 상기된 하드웨어 장치는 실시예의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도 록 구성될 수 있으며, 그 역도 마찬가지이다."}
{"patent_id": "10-2023-0092998", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "이상과 같이 실시예들이 비록 한정된 실시예와 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가 진 자라면 상기의 기재로부터 다양한 수정 및 변형이 가능하다. 예를 들어, 설명된 기술들이 설명된 방법과 다 른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태 로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다.그러므로, 다른 구현들, 다른 실시예들 및 청구범위와 균등한 것들도 후술하는 청구범위의 범위에 속한다."}
{"patent_id": "10-2023-0092998", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 영상 제작을 위한 캐스팅 시스템의 네트워크 구성을 도시한 도면이다. 도 2는 도 1의 캐스팅 서버의 상세 구성을 설명하기 위해 도시한 블록도이다. 도 3은 본 발명의 일 실시예에 따라 생성된 프로필 카드를 설명하기 위해 도시한 도면이다. 도 4는 도 1의 캐스팅 서버의 다른 실시예에 따른 상세 구성을 설명하기 위해 도시한 블록도이다. 도 5는 본 발명의 일 실시예에 따른 영상 제작을 위한 캐스팅 방법을 설명하기 위해 도시한 흐름도이다."}
