{"patent_id": "10-2019-0027048", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0107626", "출원번호": "10-2019-0027048", "발명의 명칭": "위해도 평가를 이용한 실시간 사고 예측 시스템 및 그 방법", "출원인": "한국원자력연구원", "발명자": "서석준"}}
{"patent_id": "10-2019-0027048", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "시설 내부 또는 외부에 위치하는 하나 이상의 IoT 센서로부터 측정된 신호 값을 수집하는 통신부, 상기 측정된 신호 값이 이상 범위에 있으면, 상기 IoT 센서와 연계된 사건 수목(Event Tree)에 기초하여 미리저장된 사고 목록에서 상기 이상 범위의 신호와 관련된 개별 사고에 대하여, 사고의 발생 가능성에 따라 설정된개별 빈도 값 및 사고 발생에 따른 결말의 심각성에 따라 설정된 결말 값 중 하나 이상을 변경하고 변경된 상기개별 빈도 값을 이용하여 위해 지수를 산출하는 분석부, 그리고상기 위해 지수에 기초하여 사고 목록에 대한 우선순위를 산정하고, 상기 우선순위가 높은 순서대로 재배열한예상사고 목록을 실시간으로 제공하는 제어부, 를 포함하는 실시간 사고 예측 시스템."}
{"patent_id": "10-2019-0027048", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에서,상기 시설에 대한 종합안전성분석(Integrated Safety Analysis, ISA)을 통해 상기 사건 수목을 개발하고, 발생가능한 상기 사고 목록과, 상기 사고 목록의 개별 사고에 대한 발생 빈도 및 결말 범주를 산출하는 ISA 분석부를 더 포함하는 실시간 사고 예측 시스템."}
{"patent_id": "10-2019-0027048", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에서, 상기 ISA 분석부는, 상기 시설에 대한 위해 요소를 파악하여, 발생 가능한 예상 사건과, 개별 사건에 대한 발생 빈도 및 결말 범주를 산출하는 위해도 분석부, 상기 위해도 분석부의 결과에 기초하여 상기 예상 사건 중에서 하나 이상의 위해도 기준 사건을 선정하여 상기사고 목록을 구성하는 기준 사건 선정부, 상기 위해도 기준 사건을 분석하여 상기 사건 수목을 생성하는 사건 수목 개발부, 그리고상기 사건 수목의 발생 여부를 판단하는 IoT 센서를 선정하고, 설치 지점을 지정하여 제공하며, 상기 IoT 센서에 상기 사건 수목을 연계하는 핵심 지점 정의부,를 포함하는 실시간 사고 예측 시스템."}
{"patent_id": "10-2019-0027048", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에서,상기 분석부는 연계된 상기 사건 수목에 기재된 상기 IoT 센서의 순차에 따라 상기 개별 빈도 값을 미리 설정하고, 해당 IoT센서 신호를 감지하면 상기 미리 설정된 개별 빈도 값으로 상기 사고 목록의 개별 빈도 값을 변경하는 실시간사고 예측 시스템.공개특허 10-2020-0107626-3-청구항 5 제1항에서,상기 분석부는 기후, 상기 시설의 특성 및 이전 시점에서의 기록을 포함하는 빅데이터를 이용하는 인공지능(ArtificialIntelligence, AI)을 통해 상기 IoT 센서로부터 측정된 신호 값으로부터 실제 개별 빈도를 지속적으로계산하고, 계산된 실제 개별 빈도에 해당하는 빈도 값으로 상기 사고 목록의 개별 빈도 값을 변경하는 실시간사고 예측 시스템."}
{"patent_id": "10-2019-0027048", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에서, 상기 분석부는, 상기 개별 빈도 값과 상기 결말 값이 일정한 행렬 구조로 구성된 범주를 통해 상기 개별 빈도 값과 상기 결말값을 곱한 값인 상기 위해 지수를 산출하고, 각 사건별로 산출된 위해 지수와 근거가 되는 개별 빈도 값과 결말 값은 시간별로 저장되는 실시간 사고 예측시스템."}
{"patent_id": "10-2019-0027048", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에서, 상기 분석부는, 상기 IoT 센서 신호 값에 따라 상기 개별 빈도값이 변경되고, 연계된 사건 수목에 기초하여 진행되는 사고 경위에 따라 사고의 심각도가 심화되는 경우, 상기 결말 값을 변경하고, 변경된 상기 결말 값을 이용하여 위해 지수를 산출하는 실시간 사고 예측 시스템."}
{"patent_id": "10-2019-0027048", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에서, 상기 분석부는, 상기 예상사고 위치에서 임계값 이하의 거리를 가지는 근거리 내 중첩 사고 발생 가능성을 추정하고, 상기 중첩사고 발생 가능성이 확인되면 상기 예상사고에 대한 상기 결말 값을 변경하는 실시간 사고 예측 시스템."}
{"patent_id": "10-2019-0027048", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에서, 상기 위해 지수와 상기 우선순위에 기초하여 상기 예상 사고에 대한 대응 단계를 설정하고, 상기 대응 단계에대응하는 알림을 전송하는 알림부를 더 포함하는 실시간 사고 예측 시스템."}
{"patent_id": "10-2019-0027048", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에서, 상기 알림은 알림 메시지를 포함하고, 공개특허 10-2020-0107626-4-상기 알림 메시지는 IoT 센서 측정 값, 발생 가능한 사고 내용, 사고 예방책, 점검 리스트, 예상 사고 위치, 예상 사고 경위에 따른 시간 또는 내용, 처리 시급성, 우선순위, 상기 예상 사고 위치 주변의 CCTV 영상, 관계자연락처, 대응 조직 중에서 상기 대응 단계에 대응하여 하나 이상의 데이터를 포함하는 실시간 사고 예측시스템."}
{"patent_id": "10-2019-0027048", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "시설 내부 또는 외부의 미리 지정된 위치에 있는 하나 이상의 IoT 센서로부터 측정 값을 수집하는 단계, 상기 측정 값이 이상 범위에 포함되면, 상기 IoT 센서와 연계된 사건 수목에 기초하여 미리 저장된 사고 목록에서 상기 이상 범위의 신호와 관련된 개별 사고에 대하여, 사고의 발생 가능성에 따라 설정된 개별 빈도 값 및사고 발생에 따른 결말의 심각성에 따라 설정된 결말 값 중 하나 이상을 변경하는 단계, 상기 사건 수목에 따라 변경된 데이터를 업데이트하고 상기 개별 빈도값과 상기 결말 값을 이용하여 위해 지수를 산출하는 단계, 상기 위해 지수에 기초하여 실시간으로 상기 사고 목록에 대한 우선 순위를 산정하는 단계, 그리고 상기 우선 순위가 높은 순서대로 재배열한 예상사고 목록을 실시간으로 제공하는 단계를 포함하는 실시간 사고예측 시스템의 사고 예측 방법."}
{"patent_id": "10-2019-0027048", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에서, 시설에 대한 위해요소를 파악하여 분석하고, 발생 가능한 예상 사건과, 개별 사건에 대한 발생 빈도 및 결말 범주를 산출하는 단계, 상기 산출 결과에 기초하여 상기 예상 사건 중에서 하나 이상의 위해도 기준 사건을 선정하여 상기 사고 목록을구성하고, 상기 위해도 기준 사건을 분석하여 상기 사건 수목을 생성하는 단계, 상기 사건 수목의 발생 여부를 판단하는 IoT 센서를 선정하고, 설치 지점을 지정하여 제공하며, 상기 IoT 센서에 상기 사건 수목을 연계하는 단계, 그리고 상기 사건 수목, 발생 가능한 상기 사고 목록, 상기 발생 빈도 및 상기 결말 범주를 저장하는 단계를 더 포함하는 실시간 사고 예측 시스템의 사고 예측 방법."}
{"patent_id": "10-2019-0027048", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에서, 2개 이상의 사고가 동일한 사건 수목을 공유하는 경우, 상기 동일한 사건 수목으로부터 연계되어 변경된 개별빈도 값을 공유하는 실시간 사고 예측 시스템의 사고 예측 방법."}
{"patent_id": "10-2019-0027048", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에서,상기 사고 목록의 개별 빈도 값을 변경하는 경우는, 연계된 상기 사건 수목에 기재된 상기 IoT 센서의 순차에 따라 미리 설정된 개별 빈도 값을 이용하거나 기후,상기 시설의 특성, 이전 시점에서의 기록을 포함하는 빅데이터를 이용하여 상기 IoT 센서로부터 측정된 신호 값으로부터 실제 개별 빈도를 지속적으로 계산하여 상기 사고 목록의 개별 빈도 값을 변경하는 실시간 사고 예측시스템의 사고 예측 방법.공개특허 10-2020-0107626-5-청구항 15 제11항에서,상기 위해 지수를 산출하는 단계는, 상기 개별 빈도 값과 상기 결말 값이 일정한 행렬 구조로 구성된 범주를 통해 상기 개별 빈도 값과 상기 결말값을 곱한 값인 상기 위해 지수를 산출하는 실시간 사고 예측 시스템의 사고 예측 방법."}
{"patent_id": "10-2019-0027048", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제11항에서, 상기 사고 목록의 상기 결말 값을을 변경하는 경우는, 상기 사건 수목에 따라 상기 개별 빈도값이 변경되어 사고 경위가 진행되면, 상기 결말 값을 변경하거나, 상기 IoT 센서 신호 값에 따라 상기 개별 빈도값이 변경되고, 연계된 사건 수목에 기초하여 진행되는 사고 경위에 따라 사고의 심각도가 심화되는 경우, 상기 결말 범주를 변경하는 실시간 사고 예측 시스템의 사고 예측 방법."}
{"patent_id": "10-2019-0027048", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제11항에서, 상기 위해 지수와 상기 우선 순위에 기초하여 상기 예상 사고에 대한 대응 단계를 설정하고, 상기 대응 단계에대응하는 알림을 전송하는 단계를 더 포함하는 실시간 사고 예측 시스템의 사고 예측 방법."}
{"patent_id": "10-2019-0027048", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "위해도 평가를 이용한 실시간 사고 예측 시스템 및 그 방법에 관한 것으로, 실시간 사고 예측 시스템은 시설 내 부 또는 외부에 위치하는 하나 이상의 IoT 센서로부터 측정된 신호 값을 수집하는 통신부, 측정된 신호 값이 이 상 범위에 있으면, IoT 센서와 연계된 사건 수목(Event Tree)에 기초하여 미리 저장된 사고 목록에서 상기 이상 범위의 신호와 관련된 개별 사고에 대하여, 사고의 발생 가능성에 따라 설정된 개별 빈도 값 및 사고 발생에 따 른 결말의 심각성에 따라 설정된 결말 값 중 하나 이상을을 변경하고 변경된 개별 빈도 값 및 결말 값을 이용하 여 위해 지수를 산출하는 분석부, 그리고 위해 지수에 기초하여 실시간으로 사고 목록에 대한 우선 순위를 산정 하고, 우선순위가 높은 순서대로 재배열한 예상사고 목록을 실시간으로 제공하는 제어부를 포함한다."}
{"patent_id": "10-2019-0027048", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "위해도 평가를 이용한 실시간 사고 예측 시스템 및 그 방법이 제공된다."}
{"patent_id": "10-2019-0027048", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "원자력 발전소 및 핵주기 시설은 사고 발생시 피해 규모가 크고 위해성이 높기 때문에 무결점 안전관리가 요구 된다. 이에, 원자력 시설에 관한 신뢰도가 높은 안전 관리 방법이 연구되고 있다. 특히, 사고 발생시 비상대응에 대한 모의 관리를 통해 신속한 안전 관리를 도모하거나 화재, 가스, 전기 등 특 정 분야에 한정하고 특화된 시스템들이 개발되고 있다. 하지만, 이러한 방법들은 고정된 시나리오에 대응하여 안전 대응 방안을 제공하기 때문에 다양한 변수가 많은 실제 환경에 적용하기엔 부족함이 있으며, 다양한 시설에 적용하는 데는 한계가 있다. 예를 들어, 원자력발전소는 원자로, 증기발생기, 터빈, 그리고 발전기 등을 통해 열에너지를 전기에너지로 변환 하는 연속되고 복잡한 공정으로 되어 있으며, 모든 공정이 항상 운전을 하는 반면에, 핵주기 시설(Nuclear fuel cycle facility)은 원자력발전소에 비해 독립된 여러 공정으로 구성되어 핵주기 시설의 주요공정은 각각 독립적 으로 운전을 수행하게 된다. 따라서 핵주기 시설에 대한 위해도 및 안전 관리는 공정 및 시설에 따라 위험물질과 위해요소가 다르고, 이상사 고(abnormal accident)에 의한 영향이 해당 공정으로 제한되므로, 위해도 확인 및 안전 관리는 구역 및 시설 단 위로 구분하여 수행되어야 한다.따라서, 개별 시설 특징을 고려하여 시설마다 위해도를 분석하고 그에 따라 발생가능한 사고 목록을 분석하며, 실시간 IoT 통신을 통해 시설 내 발생가능한 예상사고를 예측하여 선제 대응할 수 있는 시스템이 요구된다. 관련 선행문헌으로 한국등록특허 1,675,733호는 \"원전사고 통합 대응 시스템\"를 개시한다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허 1,675,733"}
{"patent_id": "10-2019-0027048", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 한 실시예는 동적 종합 안전성 분석과 사물 인터넷을 이용한 실시간 사고 예측을 통해 사고를 예방하 고 사고에 따른 악영향을 최소화하기 위한 실시간 사고 예측 시스템을 제공하기 위한 것이다. 본 발명의 한 실시예는 예측되는 사고의 발생 가능성과 사고에 따른 위해 정도에 따른 위해 지수 및 대응 우선 순위를 선정하여 선제적으로 제공함으로써, 상시적 집중 감시 체계를 구현하기 위한 것이다. 본 발명의 한 실시예는 예상 사고 등급에 기초하여 대응책과 예상 사고에 관한 정보, 특이 요소, 이상 정보 등 을 시각화한 정보를 제공하여 신속하고 정확한 선제적 대응 방안 및 사고 완화 대응 방안을 제공하기 위한 것이다. 상기 과제 이외에도 구체적으로 언급되지 않은 다른 과제를 달성하는 데 본 발명에 따른 실시예가 사용될 수 있 다."}
{"patent_id": "10-2019-0027048", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 한 실시예에 따른 실시간 사고 예측 시스템은 시설 내부 또는 외부에 위치하는 하나 이상의 IoT 센서 로부터 측정된 신호 값을 수집하는 통신부, 측정된 신호 값이 이상 범위에 있으면, IoT 센서와 연계된 사건 수 목(Event Tree)에 기초하여 미리 저장된 사고 목록에서 상기 이상 범위의 신호와 관련된 개별 사고에 대하여, 사고의 발생 가능성에 따라 설정된 개별 빈도 값 및 사고 발생에 따른 결말의 심각성에 따라 설정된 결말 값중 하나 이상을 변경하고 변경된 개별 빈도 값 및 결말 값을 이용하여 위해 지수를 산출하는 분석부, 그리고 위해 지수에 기초하여 실시간으로 사고 목록에 대한 우선 순위를 산정하고, 우선순위가 높은 순서대로 재배열한 예상 사고 목록을 실시간으로 제공하는 제어부를 포함한다. 본 발명의 한 실시예에 따른 실시간 사고 예측 시스템의 사고 예측 방법은 시설 내부 또는 외부의 미리 지정된 위치에 있는 하나 이상의 IoT 센서로부터 측정 값을 수집하는 단계, 측정값이 이상 범위에 포함되면, IoT 센서 와 연계된 사건 수목에 기초하여 미리 저장된 사고 목록에서 상기 이상 범위의 신호와 관련한 개별 사고에 대하 여, 사고의 발생 가능성에 따라 설정된 개별 빈도 값 및 사고 발생에 따른 결말의 심각성에 따라 설정된 결말 값 중 하나 이상을 변경하는 단계, 사건 수목에 변경된 데이터를 업데이트하고 개별 빈도 값과 결말 값을 이용 하여 위해 지수를 산출하는 단계, 위해 지수에 기초하여 실시간으로 사고 목록에 대한 우선 순위를 산정하는 단 계, 그리고 우선순위가 높은 순서대로 재배열한 예상사고 목록을 실시간으로 제공하는 단계를 포함한다."}
{"patent_id": "10-2019-0027048", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 한 실시예에 따르면, IoT 센서들로부터 수집한 정보를 최대한 활용하여 동적 종합안전성 분석과 결합 함으로써, 다양한 변수가 내재된 현장에 가장 적합한 사고 예측을 수행할 수 있다. 본 발명의 한 실시예에 따르면, 감지된 이상 징후에 대응하여 사고를 예방할 수 있는 선제적 대응 조치가 이뤄 지도록 정보를 제공할 수 있으며, 필연적으로 사고가 발생하는 경우에 피해 확산을 최소화할 수 있는 빠르고 정 확한 초동 대처 방안을 제공할 수 있다. 본 발명의 한 실시예에 따르면, 상세 사고 분석을 기반으로 전체적인 안전성 점검 및 안전성분석을 수행하고 실 시간으로 우선 순위를 설정하여 제공함으로써 시설 관리자는 발생 가능성이 높고 위해적인 결말의 영향이 큰 사 고에 선택적으로 집중하여 경제적이고 효율적으로 안전 관리를 수행할 수 있다. 본 발명의 한 실시예에 따르면, 원자력 시설과 원자력 유관 시설과 같은 취약 건물에서 상시적인 집중 감시를 수행하고 즉각적인 대응 체계를 구현하여 적극적인 사고 예방 조치를 통해 위해적 결말에 따른 영향을 최소화함 으로써, 대외 원자력 시설 또는 위해 시설에 대한 대외 안전성을 높이고 일반인의 수용성을 증진시킬 수 있다."}
{"patent_id": "10-2019-0027048", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "첨부한 도면을 참고로 하여 본 발명의 실시예에 대해 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 동일 또는 유사한 구성요소에 대해서는 동일한 도면부호가 사용되었다. 또한 널리 알려져 있는 공지기술의 경우 그 구체적인 설명은 생략한다. 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다 른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 본 명세서에서, '위해도(위해요소, hazard)'는 인적, 물적 또는 환경에 피해를 발생시킬 잠재성이 있는 물리적 또는 화학적 상태를 나타내며, '위해도 기준사건'은 위해도 식별을 통해 분석 대상 시설과 그 주변 영역에 존재 하는 위험물질과 잠재적인 위해요소를 파악하여 정리한 위해 사건들 중 발생 개연성이 있을 것으로 추정되는 것 을 재차 선별한 사건을 의미한다. 본 명세서에서, '사건 수목(event tree)'은 일종의 사건 판단도를 나타내며, 상세하게는 대규모 시스템에 대하 여 주요한 고장이나 사건이 발생할 가능성을 찾기 위하여 사용되는 논리적인 계도를 나타낸다. 따라서, 사건 수목은 발생 가능한 잠재적인 사고의 시나리오를 포함한다. 도 1은 본 발명의 한 실시예에 따른 실시간 사고 예측 시스템을 포함하는 통신 네트워크를 나타낸 예시도이다. 도 1에 도시한 바와 같이, 실시간 사고 예측 시스템은 하나 이상의 IoT 센서, 관계자 단말 그리 고 데이터베이스와 네트워크로 연결되어 데이터를 송수신한다. 여기서 네트워크는 유선 통신 네트워크, 근거리 또는 원거리 무선 통신 네트워크, 이들이 혼합된 네트워크 등 데이터를 전달하는 모든 형태의 통신 네트워크를 포함할 수 있다. 먼저, IoT 센서는 네트워크를 통해 실시간으로 데이터를 주고 받는 기능(Internet Of Things, IoT) 을 가 지는 센서 또는 장치를 나타내며, 전기, 가스, 온도, 화재감지 등을 포함할 수 있다. 이외에도 IoT 센서 는 방사선, 움직임, 진동, 침수, 유량, 압력, 강수량, 미세먼지 측정, 풍속, 풍량 등을 감지할 수 있는 센서를 포함할 수 있으나, 이에 한정하는 것은 아니다. 그리고 IoT 센서는 측정된 값을 실시간으로 실시간 사고 예측 시스템에 전송하거나 측정된 값에 따라 기준범위에 도달 시 on/ off 로 출력되어 실시간 사고 예측 시스템으로 전송할 수 있다. 이러한 구성은 IoT 센서의 종류 및 특성에 따라 상이하게 설정되며, 추후에 관리자에 의해 용이하게 변경 및 설계 가능하다. 또한 각각의 IoT 센서는 지정된 설치 지점에 실제 위치 여부를 확인하기 위해 현재 위치하는 위치 정보를 실시간으로 측정하여, 측정된 값과 위치 정보를 함께 실시간 사고 예측 시스템으로 전송할 수 있다. 다음으로 실시간 사고 예측 시스템은 종합안전성분석(ISA)를 통해 분석된 사고 목록, 개별 사고의 빈도 그 리고 결말을 산출하여 데이터를 구축하고, 실시간으로 IoT 센서를 통해 현장의 상황을 반영한 측정값을 이용하 여 빅데이터를 구축함으로써 동적 종합안정성 분석(Dynamic-ISA)를 수행한다. 이에 따라 실시간 사고 예측 시스템은 동적 종합안전성 분석과 사물 인터넷을 이용하여 실시간 예상 사고 순위를 선정하여 전체 예상 사고 목록 중에서 우선 대응해야 하는 순위를 제안할 수 있다. 또한, 실시간 사고 예측 시스템은 예상 사고에 대해 복합적인 대응이 가능하도록 선제적 대응 방안 및 후 속 방안이 포함된 알림메시지를 관계자 단말로 전송할 수 있다. 한편, 실시간 사고 예측 시스템은 원자력 시설, 핵주기 시설, 사용후 핵연료 관리 시설에 적용하여 설명하 고 있지만, 이에 한정되는 것은 아니며, 사고 예측 관리가 요구되는 다양한 시설에 적용가능하다. 또한, 실시간 사고 예측 시스템은 컴퓨터 시스템의 기본이 되는 특정 프로세서 모델과 하나의 컴퓨터 시스 템을 바탕으로 하는 운영체제인 플랫폼의 형식으로 구현될 수 있다. 관계자 단말은 미리 등록된 시설 책임자, 안전관리 담당자 또는 작업자의 단말을 나타낸다. 관계자 단말 은 예를 들어, 퍼스널 컴퓨터(personal computer), 핸드헬드 컴퓨터(handheld computer), PDA(personal digital assistant), 휴대폰, 스마트 기기, 태블릿(tablet) 등이 있다. 또한, 관계자 단말은 관련 시설 담당자뿐 아니라 소방서, 군부대 또는 병원 등과 같은 타 기관 서버를 포 함할 수 있다. 다음으로 데이터베이스는 실시간 사고 예측 시스템에서 실시간 수집하고 분석하여 산출된 모든 데이 터를 저장한다. 또한, 데이터베이스는 동적 종합안전성 분석을 위한 기준 자료, 대응방안 데이터, 관계자 연락망 데이터, 시설 내 공간 정보 데이터를 포함할 수 있으며, 실시간으로 업데이트 가능하다. 도 1에는 실시간 사고 예측 시스템과 데이터베이스를 별도로 도시하였지만, 추후에 관리자에 의해서 데이터베이스는 실시간 사고 예측 시스템에 포함되어 구현될 수 있다. 이하에서는 도 2 내지 도 4를 이용하여 동적 종합안전성분석을 이용하는 실시간 사고 예측 시스템에 대해 서 상세하게 설명한다. 도 2는 본 발명의 한 실시예에 따른 실시간 사고 예측 시스템을 나타내는 구성도이고, 도 3은 본 발명의 한 실 시예에 따른 반정량적 안전성분석 방법을 설명하기 위한 예시도이다. 그리고 도 4는 본 발명의 한 실시예에 따른 ISA 분석부를 나타낸 구성도이다. 도 2에 도시한 바와 같이, 실시간 사고 예측 시스템은 통신부, 분석부, 제어부, 알림부 그리고 ISA 분석부를 포함한다. 먼저, 통신부는 시설 내부 또는 외부에 위치하는 하나 이상의 IoT 센서로부터 측정된 신호 값을 수집 한다. 이때, 통신부는 IoT 센서로부터 출력되는 실시간으로 측정된 값 또는 on/off 값으로 신호값을 수집할 수 있다. 또한, 통신부는 별도의 외부 기관 서버, 사이트, 블로그등에 접속하여 대응되는 데이터를 수집할 수 있다. 예를들어, 통신부는 기상청의 날씨 정보, 기후 변화등에 대한 데이터를 수집할 수 있다. 분석부는 측정된 신호 값이 이상 범위에 있으면, IoT 센서와 연계된 사건 수목(Event Tree)에 기초하 여 미리 저장된 사고 목록에서 상기 이상과 관련한 개별 사고의 빈도(사고의 발생 가능성)를 변경하거나, 혹은, 상기 이상과 관련한 개별 사고의 결말 값(사고 심각도)을 변경한다. 다시 말해, IoT 센서는 하나 이상의 사건 수목과 연계되어 있으며, 사건 수목에 포함된 사고 목록들의 개 별 빈도 값 및 결말 값과 연동된다. 그리고 분석부는 변경된 데이터에 기초하여 개별 빈도값과 결말 범주를 이용하여 위해 지수를 산출한다. 도 3을 보면, 빈도 산출값(Likelihood, 개별 빈도 값)와 결말(Consequence) 값이 예컨대 각각 1~4의 값을 갖는 범주로 구분되어 4*4 행렬 구조로 저장되어 있다. 즉, 빈도 산출값(Likelihood, 개별 빈도 값)과 결말(Consequence)의 곱셈을 통해 1부터 16의 값을 가지는 위해 지수가 산정된다. 도 3의 A 영역은 Not Acceptable로 산정되어 조속한 조치 및 확인을 요청하며, 빗금 영역은 Acceptable로 산정 되었지만, 해당 예상 사고를 주의해야 하는 것으로 설정될 수 있다. 이처럼, 각각의 위해 지수를 그룹핑하여 그룹별로 대응 단계를 설정할 수 있다. 그리고 도 3에는 기본적인 4*4 행렬 구조로 도시하였지만, 개별 빈도 및 결말의 범주에 따라 3*3 또는 4*5등 사 용환경에 따라 추후에 관리자에 의해 용이하게 변경 가능하다. 이러한 구성은 반정량적 안전성 분석 방법으로서 확률론적 안전성 분석(PSA)을 사용할 수 없는 소규모 시설과 잠재적 위해 정도가 크지 않은 시설에 경제적이고 실용적으로 적용할 수 있다. 다음으로 제어부는 위해 지수에 기초하여 실시간으로 사고 목록 에 대해 우선 순위를 산정하고, 우선순위 가 높은 순서대로 재배열한 예상사고 목록을 실시간으로 제공한다. 제어부는 위해 지수가 일정 이상인 경우의 사고 목록에 대해 수집하여 우선순위를 산정할 수 있으며, 위해 지수가 변경되면 자동으로 예상사고 목록을 업데이트한다. 다음으로 알림부는 위해 지수와 우선순위에 기초하여 예상 사고에 대한 신규 진입, 대기, 감시, 사고, 즉 시 대응 또는 추가 대응 중에서 하나의 대응 단계를 설정한다. 이러한 대응 단계의 구성은 추후에 관리자에 의 해 시설에 적합한 구성으로 변경 및 설계 적용 가능하다. 그리고 알림부는 대응 단계에 대응하는 알림 메시지를 관계자 단말로 전송한다. 다음으로 ISA 분석부는 시설에 대한 종합안전성분석(Integrated Safety Analysis, ISA)을 통해 위해도를 분석 및 평가하고, 발생 가능한 사고 목록, 사고 목록의 개별 사고의 빈도(발생 가능성), 결말 범주를 산출하여 저장한다. 도 4에 도시한 바와 같이, ISA 분석부는 위해도 분석부, 기준 사건 선정부, 사건 수목 개발부 그리고 핵심 지점 정의부를 포함한다. 위해도 분석부는 분석 대상 시설에 존재하는 위험 물질과 잠재적인 위해요소를 파악하며, 예를 들어, 공정 설계 정보, 공정 및 시설의 구역 정의, 공정 및 시설의 위험 물질 확인, 공정 및 시설의 위험 요소 확인 등을 통해 위해요소를 파악할 수 있다. 다시 말해, 위해도 분석부는 시설에서 취급하는 위해 물질과 방사선학적, 화학적, 물리적, 자연재해, 외부 위협을 포함하는 잠재적인 위해요소를 파악하여, 위해요소로 인해 발생 가능한 예상 사건, 개별 사건의 발생 빈 도(개별 빈도 값) 및 결말 범주를 산출할 수 있다. 여기서, 발생 빈도(개별 빈도 값)는 유사시설 및 해당시설에서의 이전 시점에서 누적된 사고 데이터 및 경험 등 을 통해 사고 경위마다 영향도와 발생빈도를 평가하고 분석하여 산출된다. 상세하게는 발생 빈도 범주(개별 빈도 값)는 시설에서의 사고 발생기록, 시설에서의 IROFS(Items Relied on for Safety, 안전관련품목)의 기능실패기록, 유사계통에 대한 적용할 수 있는 사고자료, 계통의 손상율과 가용성을 통제하는 객관적인 정성적 기준, 또는 객관적으로 검증되는 기타 방법에 근거하여 결정할 수 있다. 또한 상황에 따라 사고의 지속시간, 공통원인고장 등을 고려하여 발생 빈도를 산출할 수 있다. 또한, 결말 범주(결말 값)는 위해요소로 인해 위험물질이 종사자, 일반인, 환경 등에 미치는 결말의 심각도 (Severity)를 분석한 구성으로, 추정된 방사선학적, 화학적, 또는 환경적 영향에 근거하여 분류될 수 있다. 다음으로 기준 사건 선정부는 위해도 분석부의 결과에 기초하여 선정된 설계 기준 사고와 시설과 관 련하여 발생 개연성을 가지는 위해 사건을 포함하여 하나 이상의 위해도 기준 사건(사고 목록)을 선정한다. 이때, 기준 사건 선정부는 고려가 필요하다고 추정되는 기준 사건들을 전체 고려 대상으로 포함시킬 수 있 다. 사건 수목 개발부는 위해도 기준 사건을 분석하여 위해도 기준 사건이 발생할 가능성과 잠재적 사고 경위 를 알 수 있는 사건 수목을 생성한다. 다음으로 핵심 지점 정의부는 사건 수목의 발생 여부를 판단하는 IoT 센서를 선정하고, 설치 지점을 지정 하여 제공한다. 그리고 핵심 지점 정의부는 선정된 IoT 센서가 설치 지점에서 신호를 송신하면, IoT 센서에 사건 수목을 연계할 수 있다. 또는 IoT 센서를 설치한 관리자의 확인에 의해서 IoT 센서의 설치 지점을 확인하고 IoT 센서에 사건 수목을 연계할 수 있다. 이때, 도 2에는 ISA 분석부를 포함하는 것으로 도시하였지만, ISA 분석부는 별도의 장치 또는 서버로 존재하고, 연계된 데이터베이스를 공유하는 형태로 구현될 수 있다. 한편, 실시간 사고 예측 시스템은 각각 서버, 단말, 또는 이들이 결합된 형태일 수 있다. 단말은 각각 메모리(memory), 프로세서(processor)를 구비함으로써 연산 처리 능력을 갖춘 장치를 통칭하는 것 이다. 예를 들어, 퍼스널 컴퓨터(personal computer), 핸드헬드 컴퓨터(handheld computer), PDA(personal digital assistant), 휴대폰, 스마트 기기, 태블릿(tablet) 등이 있다. 서버는 복수개의 모듈(module)이 저장되어 있는 메모리, 그리고 메모리에 연결되어 있고 복수개의 모듈에 반응 하며, 단말에 제공하는 서비스 정보 또는 서비스 정보를 제어하는 액션(action) 정보를 처리하는 프로세서, 통 신 수단, 그리고 UI(user interface) 표시 수단을 포함할 수 있다. 메모리는 정보를 저장하는 장치로, 고속 랜덤 액세스 메모리(high-speed random access memory, 자기 디스크 저 장 장치, 플래시 메모리 장치, 기타 비휘발성 고체 상태 메모리 장치(non-volatile solid-state memory device) 등의 비휘발성 메모리 등 다양한 종류의 메모리를 포함할 수 있다. 통신 수단은 단말과 서비스 정보 또는 액션 정보를 실시간으로 송수신한다. UI 표시 수단은 시스템의 서비스 정보 또는 액션 정보를 실시간으로 출력한다. UI 표시 수단은 UI를 직접적 또 는 간접적으로 출력하거나 표시하는 독립된 장치일 수도 있으며, 또는 장치의 일부분일 수도 있다. 이하에서는 도 5 내지 도 13을 이용하여 위해도 평가를 이용하여 실시간 사고 예측하여 정보를 제공하고, 예측 사고의 단계별 대응되는 알림 메시지를 전송하는 과정에 대해서 상세하게 설명한다. 이하에서는 도 5를 이용하여 위해도 평가를 이용한 실시간 사고 예측 방법에 대해서 상세하게 설명한다. 도 5는 본 발명의 한 실시예에 따른 실시간 사고 예측 시스템의 사고 예측 방법을 나타낸 순서도이다. 도 5에 도시한 바와 같이, 실시간 사고 예측 시스템은 시설에 관한 위해요소를 파악하여 분석하고, 위해요 소에 의해 발생 가능한 예상 사건, 개별 사건에 대한 발생빈도 및 결말 범주를 산출한다(S510). 실시간 사고 예측 시스템은 시설에서 취급하는 위해 물질과 방사선학적, 화학적, 물리적, 자연재해, 외부 위협을 포함하는 잠재적인 위해요소를 파악하여 분석할 수 있다. 이외에도 시설에 관한 위해요소는 시설 자체와 시설 내,외에 존재하는 각종 구조물, 계통, 기기(structure, systems, and components)의 위해요소들을 모두 포함하며 이에 한정하는 것은 아니다. 그리고 실시간 사고 예측 시스템은 분석한 위해요소를 이용하여 발생 가능한 예상 사건, 개별 사건에 대한 발생 빈도 및 결말 범주를 산출한다. 다음으로 실시간 사고 예측 시스템은 발생 가능한 예상 사건 중에서 기준 사건(사고 목록)을 선정하고, 분 석하여 사건 수목을 생성한다(S520). 이와 같이, 실시간 사고 예측 시스템은 위해요소를 분석하여 하나 이 상의 위해도 기준 사건을 선정하고, 위해도 기준 사건을 분석한다. 그리고 위해도 기준 사건이 발생할 가능성과 잠재적 사고 경위를 알 수 있는 사건 수목을 생성할 수 있다. 다음으로 실시간 사고 예측 시스템은 사건 수목의 발생 여부를 판단하는 IoT 센서를 연계한다(S530). 실시간 사고 예측 시스템은 사건 수목의 발생 여부를 판단하는 IoT 센서를 선정하고, 설치 지점을 지정하 여 관계자 단말로 제공한다. 이에 실시간 사고 예측 시스템은 선정된 IoT 센서가 설치 지점에서 신호를 송신하면, IoT 센서에 사건 수 목을 연계할 수 있다. 이와 같은 실시간 사고 예측 시스템의 위해도 분석을 통한 위해도 기준 사건 선정 및 사건 수목의 생성 그 리고 IoT 센서와 사건 수목의 연계에 대해서 다음 도 6 및 7을 이용하여 상세하게 설명한다. 도 6은 본 발명의 한 실시예에 따른 No.01-1 위해도 기준 사건을 포함하는 사건 수목을 나타낸 예시도이고, 도 7은 본 발명의 한 실시예에 따른 No.01-2 위해도 기준 사건을 포함하는 사건 수목을 나타낸 예시도이다. 먼저, 도 6은 외부 기온 하강시에 동파 방지용 열선과열로 인한 화재에 관한 위해도 기준 사건을 포함한다. 동파 방지를 위해서는 겨울철 외부 기온이 영하로 떨어지는 경우 외부에 노출된 배관의 동파를 방지하기 위하여 일부 배관에 열선을 감아놓고 단열재로 감아 놓는 조치가 취해진다. 이때, 외부 기온이 설정된 온도 이하로 떨 어지는 상황을 감지하면 배관 내부의 물이 어는 것을 방지하기 위해 자동으로 히터에 전기가 공급되면서 이에 연결된 열선에 일정한 출력으로 열을 발생시킨다. 실시간 사고 예측 시스템은 이러한 위해도 기준 사건을 분석하여 발생할 가능성과 사고 경위를 하나씩 확 인해 볼 수 있다. 도 6에 도시한 바와 같이, 동파 방지용 열선 과열로 인한 화재에 대한 사고 경위를 분석해보면, 외부 온도 측정 센서 이상, 전기 분전반 이상, 히터 출력 이상, 열선 온도 이상, 열선의 과열, 화재 발생으로 구분될 수 있다. 이러한 사고 경위에 대응하여 실시간 사고 예측 시스템은 IoT 센서의 설치 지점인 핵심 지점을 외부 온도 측정 지점, 전기 분전반 이상 측정 지점, 히터 출력(전류) 측정 지점, 외부 배관 단열재 속 열선 온도 측정 지 점, 건물 외부 열화상 카메라 측정 지점, 그리고 화재 감지기로 선정할 수 있다. 이에 핵심 지점에 각각 IoT 센서가 설치되고, 실시간 사고 예측 시스템은 해당 사건 수목과 연계하여 저장 하고 관리할 수 있다. 한편, 도 7은 외부기온 정상인 환경에서 동파 방지용 히터 누전으로 인한 화재를 나타내는 위해도 기준 사건을 포함한다. 도 7에 도시한 바와 같이, 동파 방지용 히터 누전으로 인한 화재에 대한 사고 경위를 분석해보면, 외부 온도 측 정 센서 이상, 전기 분전반 이상, 히터 출력 이상, 열선 온도 이상, 열선의 과열, 화재 발생으로 구분될 수 있 다. 이러한 사고 경위에 대응하여 실시간 사고 예측 시스템은 IoT 센서의 설치 지점으로 외부 온도 측정 지점, 전기 분전반 이상 측정 지점, 히터 출력(전류) 측정 지점, 외부 배관 단열재 속 열선 온도 측정 지점, 건물 외 부 열화상 카메라 측정 지점, 그리고 화재 감지기 외에 건물 내부 열화상 카메라 측정 지점을 더 포함할 수 있 다. 한편, 도 7은 도 6과 상이한 원인으로 인해 발생한 동일한 위치에서의 동일한 사건을 나타내고 있으므로, 각 사 건 수목을 살펴보면, 분전반 전류 이상, 히터 출력 이상, 열선 온도 이상, 열화상 카메라 열상승 관측에 대한 사건 수목의 발생 가능성 변경 값이 서로 동일함을 알 수 있다. 다시 말해, 분전반 전류 이상이 측정되면 화재 발생 가능성을 2로 동일하게 변경하고, 히터 출력에서 이상이 측 정되면 발생가능성을 3으로 동일하게 변경하며, 열선 온도에 이상이 있으면서 열화상 카메라로 인한 열상승이 관측되면 화재 발생 가능성이 4로 동일하게 변경된다. 이처럼 사고 목록은 사건 수목을 기반으로 생성되므로 둘 이상의 사고 목록이 서로 일부 동일한 사건 수목으로 부터 연계되어 변경된 개별 빈도 값을 공유할 수 있다. 그리고 실시간 사고 예측 시스템은 일부 동일한 사건 수목을 가지는 도 6과 도 7의 상황에서 다른 측정지 점에서의 신호 차이를 이용해서 각각 다른 원인으로 인해 발생된 화재임을 파악할 수 있다. 다음으로 실시간 사고 예측 시스템은 시설에 대한 종합안전성분석을 수행한 결과로 산출된 사건 수목, 발 생 가능한 사고 목록, 사고 목록의 개별 빈도, 결말 범주를 저장한다(S540). 이와 같이, 시설에 대한 위해도 및 사건 수목을 분석하는 일련의 과정은 실시간으로 분석하여 업데이트될 수도 있고, 미리 설정된 스케줄링에 따라 업데이트할 수 있다. 한편, 실시간 사고 예측 시스템은 시설에 대한 종합안전성분석 결과를 수집하여 빅데이터를 구축하고, 인 공지능(AI)를 이용하여 구축된 빅데이터를 학습시킬 수 있다. 이에, 실시간 사고 예측 시스템은 인공지능(AI)를 통해 위해요소 분석 및 위해도 기준 사건을 도출하고, 사건 발생 경위를 보다 구체적이고 정확하게 분석할 수 있다. 다음으로 실시간 사고 예측 시스템은 미리 지정된 위치에 있는 하나 이상의 IoT 센서로부터 측정 값을 수 집한다(S550). 그리고 실시간 사고 예측 시스템은 측정값이 이상 범위에 포함되면, 사건 수목에 기초하여 사고 목록들의 개별 빈도값 또는 결말 값을 변경한다(S560). 실시간 사고 예측 시스템은 IoT 센서와 연계된 사건 수목에 기초하여 미리 저장된 사고 목록에서, 사고의 개별 빈도 이외에 사고 발생에 따라 예측되는 결말의 심각도에 관한 값인 결말 값도 변경할 수 있다. 이때, 실시간 사고 예측 시스템은 연계된 사건 수목에 기재된 IoT 센서의 순차에 따라 개별 빈도 값을 미 리 설정하고, 해당 IoT 센서 신호를 감지하면 미리 설정된 개별 빈도 값으로 사고 목록의 개별 빈도 값을 변경 할 수 있다. 또는 실시간 사고 예측 시스템은 기후, 시설의 특성, 이전 시점에서의 기록을 포함하는 빅데이터를 이용하 는 인공지능(Artificial Intelligence, AI)을 통해 IoT 센서로부터 측정된 신호 값으로부터 실제 개별 빈도를 지속적으로 계산한다. 또는 실시간 사고 예측 시스템은 확률론적 안전성 분성(PSA, probabilistic safety analysis)에서 실시간 으로 계산된 확률값을 신호값으로 사용하여 개별 빈도 값을 변경할 수 있다. 그리고 실시간 사고 예측 시스템은 계산된 실제 개별 빈도에 해당하는 빈도 값으로 사고 목록의 개별 빈 도 값을 변경할 수 있다. 이러한 개별 빈도 값의 변경 방안은 추후에 관리자에 의해 용이하게 설계 및 변경 가능하다. 한편, 실시간 사고 예측 시스템은 사건 수목에 따라 개별 빈도값이 변경되어 사고 경위가 진행되면서 예측 되는 피해가 심해질 경우, 결말 범주(결말 값)가 변경될 수도 있다. 이러한 결말 범주의 변경도 앞서 설명한 개별 빈도 값의 변경 방법과 동일하게, 미리 설정된 값을 이용하거나 빅데이터를 이용한 인공지능을 통해 피해 규모 및 피해 정도를 산출하여 변경할 수 있다. 또한, 실시간 사고 예측 시스템은 예상사고 위치에서 임계값 이하의 거리를 가지는 근거리 내 중첩 사고 발생 가능성을 추정할 수 있다. 이때, 중첩 사고 발생 가능성이 확인되면 예상사고에 대한 결말 범주를 변경할 수 있다. 실시간 사고 예측 시스템은 중첩 사고 발생 가능성이 높을수록 대응하여 결말 범주의 결말 값을 상승시킬 수 있다. 다음으로 실시간 사고 예측 시스템은 개별 빈도값과 결말 범주를 이용하여 위해 지수를 산출한다(S570). 실시간 사고 예측 시스템은 사건 수목에 변경된 데이터를 업데이트하고 개별 빈도값과 결말 값을 곱하여 위해 지수를 산출한다. 이때, 실시간 사고 예측 시스템은 개별 빈도 값과 결말 값을 곱한 값인 위해 지수 를 개별 빈도 값과 결말 값이 일정한 행렬 구조로 구성된 범주를 통해 산출할 수 있다. 그리고 실시간 사고 예측 시스템은 시설 내 감지된 위해 지수를 갖는 사고 목록에 대한 대한 우선 순위를 산정한다(S580). 실시간 사고 예측 시스템은 종합적인 판단을 위해 가장 먼저 확인을 요하는 예상 사고를 선순위로 선정할 수 있다. 이때, 실시간 사고 예측 시스템은 우선순위를 선정할 때, 위해 지수가 큰 값을 가지는 경우를 우선적으로 우선순위로 선정할 수 있다. 이때, 위해지수가 동일한 경우, 발생가능성 범주와 결말 범주를 비교하여 결말 범 주의 값이 낮은 것을 후순위로 선정할 수 있다. 예를 들어, 동일한 위해지수를 가지고 있는 두 개의 예상사고 중에서 발생했을 때 위해성의 크기가 더 큰 예상 사고에 대해서 선순위로 선정할 수 있다. 이러한 위해지수가 동일할 때, 우선순위를 적용하는 구성은 사고가 발생된 경우에도 동일하게 적용될 수 있다. 다음으로 실시간 사고 예측 시스템은 우선순위가 높은 순서대로 재배열한 예상사고 목록을 제공하고 단계 별 경보를 수행한다(S590). 실시간 사고 예측 시스템은 위해 지수에 기초하여 실시간으로 사고 목록에 대한 우선 순위를 산정하여 우 선순위가 높은 순서대로 재배열한 예상사고 목록을 실시간으로 제공한다.. 이때, 예상사고 목록을 제공함에 있어서, 관계자 단말이 각 예상사고 목록을 선택하면, 해당 예상 사고명, 위치, 시간 및 내용을 포함하는 사고 경위, 사고 대응팀 연락처, 해당 예상 사고에 대응되는 대응책, 처리 시급 성, 주변 CCTV 영상을 제공할 수 있다. 한편, 실시간 사고 예측 시스템은 위해 지수와 우선순위에 기초하여 예상 사고에 대한 대응 단계를 설정하 고 단계별 경보를 수행할 수 있다. 여기서, 대응 단계는 신규 진입, 대기, 감시, 사고 가능성, 사고, 즉시 대응 또는 추가 대응 등을 포함하며 각 예상 사고에 따라 하나의 하나의 대응 단계를 설정할 수 있다. 그리고 실시간 사고 예측 시스템은 대응 단 계에 대응하는 알림 메시지 구성을 추출하여 관계자 단말로 전송할 수 있다. 이때, 실시간 사고 예측 시스템은 해당 대응 단계에 따라 사고 가능성, 사고, 즉시 대응과 같은 높은 수위 의 대응 단계인 경우, 알림 메시지에 알림 신호, 특정 색상의 조명, 깜빡임 등의 알림 설정을 포함시킬 수 있다. 또한, 실시간 사고 예측 시스템은 내부 사고 대응팀, 관계자, 관리자뿐 아니라 소방서, 군부대, 경찰관, 관공서, 병원등과 같은 외부 기관 서버와 다이렉트로 통신 라인을 설정하여 긴급 대응이 가능하도록 알림 메시 지를 전송할 수 있다. 한편, 알림 메시지에는 IoT 센서 측정 값, 상기 시설 내 CCTV 영상, 상기 대응 단계별 경보 중에서 하나 이상을 시설의 공간 정보에 기초하여 생성된 3D 모델 상에 실시간으로 시각화하여 제공할 수 있다. 이하에서는 도 8 내지 도 10을 이용하여 구체적인 사고 경위에 따른 실시간 사고 예측 시스템의 발생 가능 성(개별 빈도)을 변경하는 과정에 대해서 설명한다. 도 8은 본 발명의 한 실시예에 따른 화재 발생 원인에 대한 사고 경위를 나타내는 예시도이고, 도 9는 본 발명 의 한 실시예에 따른 누전 및 전기화재 발생 원인에 대한 사고 경위를 나타낸 예시도이다. 도 10은 본 발명의 한 실시예에 따른 방사능 누출과 관련된 사고 경위를 나타낸 예시도이다. 도 8은 도 6과 도 7과 동일한 기준 사건에 대응하는 시나리오를 나타낸다. 도 8은 동파 방지용 시설에서 화재가 발생한 사고 경위를 나타낸다. 먼저, 도 8의 No.01-1은 동파 방지용 열선 과열로 인한 화재의 경우 사고 경위에 관한 것으로, 영하의 온도에서 히터가 작동하였으나, 히터 고장으로 인한 출력 이상 또는 열선 노후화 등으로 열선에서 과열이 발생하고, 그로 인해 열선을 둘러싼 보온재가 발화점 이상으로 상승하여 화재가 발생하였다. 도 8의 No.01-1은 도 6에 도시한 바와 같이, 사건 수목별로 IoT 센서로부터 측정된 값을 개별 빈도 값에 적용하 여 발생 가능성(개별 빈도값)을 변경한다. 한편, 도 8의 N0.01-2는 동파 방지용 열선 과열로 인한 발생한 화재에 관한 것이지만, No.01-1과는 상이한 원인 으로 발생된 화재에 대한 사고 경위를 나타낸다. 도 8의 No.01-2는 영상의 온도에서 히터가 작동하지 않아야 하지만, 히터 고장 도는 누전으로 인해 불필요한 출 력이 발생하고 히터 자체에 누전 또는 과전류로 인한 과열 발생 후 화재가 발생하였다. 이때, 도 8의 No.01-1의 사건 수목 2, 3과 No.01-2의 사건 수목 2, 3은 서로 동일한 사건 수목을 공유함으로써, 결과를 공유할 수 있다. 또한, IoT 센서로부터 외부 기온이 영상임을 확인하면 사고 발생원인이 히터 누전인지 에 대한 추정이 가능하다. 다시 말해, 실시간 사고 예측 시스템은 No.01-1에 대한 발생 가능성을 산출하면, No.01-2에 대해 별도로 발생 가능성을 산출하지 않더라도 앞서 산출한 발생 가능성의 변경 내용을 공유하여 적용할 수 있다. 한편, 도 9의 No.02-1는 강한 비바람으로 인한 창문 파손과 침수로 인한 누전 및 전기 화재의 사고 경위를 나타내고, No.02-2는 배관 파단에 의한 침수로 인한 누전 및 전기 화재를 나타낸다. 도 9 의 No.02-1은 외부 환경에서 강한 비바람의 영향으로 실내에 침수 영역이 발생하고, 침수 영역에서 누전이 발생하여 분전반 전류가 비정상적으로 출력되고, 그로 인해 누전으로 인한 화재가 발생하였다. 한편, 도 9의 No.02-2는 침수가 발생한 상황에서 배관 내 흐르는 유량의 이상 여부를 감지하고, 유량의 변화가 없다면, 침수사고가 발생했더라도 이것이 배관파단에 의한 것이 아니라는 예상 결과를 도출할 수 있음을 보여준 다. 또한, 어디선가 화재가 발생했을 경우에도 배관 파단에 의한 침수, 침수로 인한 누전, 배관 주변의 화재는 발생 하지 않았음을 확인할 수 있다. 도 9와 같이, 실시간 사고 예측 시스템은 시설 내 외부에 IoT 센서의 측정값에 한정하지 않고 네트워크를 통해 타 기관 서버, 블로그, 사이트 등에 접속하여 환경 정보를 더 수집할 수 있다. 이때, 도 9의 No.02-1의 사건 수목 2, 3, 4와 No.02-2의 사건 수목 2, 3, 4는 서로 동일한 사건 수목을 공유 하기 때문에, 결과를 공유할 수 있다. 다음으로 도 10 의 No.03-1는 방사능 계측기 미설치 구역에서 방사성 물질 누출로 인한 작업자 피폭 발생 및 완 화 대응책 제공에 관한 사고 경위를 나타내고 No.03-2는 액체 방사성 폐기물 누출로 인한 영향 완화 대응책 제 공에 관한 사고 경위를 나타낸다. 도 10의 No.03-1와 No.03-2는 각각 측정하고자 하는 영역에서 물리적, 화학적, 자연재해로 인한 방사성 물질 누 출 가능성을 진단하고, 주변 방사능 수치의 증감을 확인하여 증가 속도를 추정하고, 방사능 수치가 기준치 대비 절반 이상의 상승률을 가지는 방사성 물질이 누출되었다. 도 10의 No.03-1와 No.03-2는 발생된 영역이 상이하지만, 방사성 물질이라는 동일한 결과를 가지는 사고 경위를 나타낸다. 이에 앞서 설명한 것과 동일하게 도 10에서 사건 목록 2와 3은 동일한 사고 경위와 발생가능성의 변경 값이 적 용되기 때문에 공유할 수 있다. 그리고 도 10의 No.03-1와 No.03-2의 최종 발생 가능성 값이 동일하며, 동일한 결과를 가지기 때문에 제공되는 대응 방안이 동일할 수 있다. 예를 들어, 실시간 사고 예측 시스템은 고정형 또는 이동형으로 형성된 방사능 계측기를 투입하여 실시간 측정값을 수집하여 예상 오염 지역을 추정한다. 그리고 실시간 사고 예측 시스템은 오염 현황 또는 작업자 위치를 통제실로 전송하고, 작업자의 단말로 예상 대피로가 포함된 자료를 전송할 수 있다. 또한, 실시간 사고 예측 시스템은 예상 대피로의 LED램프를 흰색으로 점멸하거나 진입 불가 지역의 LED 램 프를 붉은색으로 점멸할 수 있다. 이에 작업 구역 오염 정도를 작업자들이 빠르고 쉽게 인식할 수 있도록 시각적으로 점등시킬 수 있다. 예를 들어, 확인 완료 지역은 점등하고 예상 오염 지역은 점멸하거나 파란색, 초록색, 노란색, 주황색, 붉은색 순으로 예상 오염 정도에 따라 영역내 설치된 LED 점등의 색상을 제어할 수 있다. 이하에서 도 11과 도 12을 이용하여 실시간 사고 예측 시스템의 위해지수 산정하여 우선순위를 설정하는 구성에 대해서 설명한다. 도 11은 본 발명의 한 실시예에 따른 실시간 예상사고 목록에서 개별 빈도 값에 따라 변동되는 우선순위를 설명 하기 위한 예시도이고, 도 12는 본 발명의 한 실시예에 따른 실시간 예상사고 목록에서 결말 범주의 값의 상승 에 의해 변동되는 우선순위를 설명하기 위한 예시도이다. 먼저, 도 11을 보면, A 건물의 예상사고 목록과 함께, 우선순위(Rank), 발생가능성 범주(L), 결말 범주(C), 위 해 지수(RI=L*C) 그리고 비고로 이뤄진 우선순위 목록을 확인할 수 있다. 실시간 사고 예측 시스템은 발생 가능성 범주와 결말범주를 곱하여 위해지수를 산출하고, 종합적인 판단을 통해 먼저 확인을 요하는 예상사건에 대해 우선순위를 설정한다. 도 11의 A는 제1 시점, B는 제2 시점, C는 제3시점으로 시간 순서에 따라 배관 동파방지용 열선 과열로 인한 화 재에 대한 발생 가능성 범주의 값이 점점 커짐에 따라(사고 발생 가능성 증가) 산출된 위해지수가 높아지는 것 을 알 수 있다. 예를 들어, 제2 시점(B)에는 기온 센서와 분전반 신호의 이상으로 전류값의 이상만 감지되었다면, 제3 시점(C) 에서는 열선의 특정 지점에서 온도 센서의 과열이 감지되는 것으로 진행되어 위해 지수가 높아짐을 확인할 수 있다. 이때, 실시간 사고 예측 시스템은 제3 시점(C)에서와 같이, 사고 가능성이 있는 것으로 보여지면, 예상 사 고명, 위치, 시간과 내용이 포함된 사고 경위, 그리고 해당 예상 사고에 대응하는 기본 대응책, 추가 대응책, 처리 시급성 및 우선순위, 그리고 주변 CCTV 등을 포함하여 사고 대응팀의 관계자 단말로 알림 메시지를 자동으로 전송할 수 있다. 한편, 도 12는 제1 시점(A)와 제2 시점(B)에서 발생 가능성 범주의 값이 점점 커짐에 따라 산출된 위해지수가 높아졌다가 제3 시점(C)에서 근거리 중첩사고 가능성을 발견하여 결말 범주의 값이 상승된 상황(사고 심각성 증 가)을 나타낸다. 예를 들어, 제2 시점(B)에는 기온 센서와 분전반 신호의 이상으로 전류값의 이상만 감지되어 위해 지수가 상승 하였는데, 제3 시점(C)에서 인접한 열선 가,나,다 지점에서 온도센서의 과열이 감지되어 결말 범주의 값이 증가 되었음을 알 수 있다. 다시 말해, 예상 사고 목록에 직접적인 위치에서의 온도센서의 과열을 감지되지 않아 발생가능성 범주의 값이 증가되지 않았으나 근거리에 위치하는 지점에서 온도 센서의 과열이 감지되어 사고 발생시 위해성이 급격하게 상승될 것으로 추정된다. 이처럼, 실시간 사고 예측 시스템은 사고 경위에 따라 동일한 사건 수목을 공유하는 사건들로 인해 더 큰 사고로 확대될 가능성을 추정하고, 추정된 가능성에 따라 사고의 심각도가 심화되는 경우, 결말 범주(결말 값) 를 변경할 수 있다. 그리고 실시간 사고 예측 시스템은 변경된 결말 범주에 기초하여 위해 지수를 재산출 하여 제공할 수 있다. 한편, 근거리 중첩사고에 대응하여 해당 예상사고는 즉시 대응을 요구하는 알림 메시지가 사고 대응팀의 관계자 단말로 전송될 수 있다. 도 13은 본 발명의 한 실시예에 따른 사고 예측 정보에 따라 환경 또는 상태 정보를 시각화하여 제공하는 구성 을 설명하기 위한 예시도이다. 도 13의 (a)는 시설의 환경을 시각화한 예시도이고, (b)은 상태 정보를 시각화 한 예시도이다. 도 13에 도시한 바와 같이, 실시간 사고 예측 시스템은 실제 시설의 공간 정보에 기초하여 생성된 3D 모델 상에서 다양한 IoT 정보를 연동시켜 3D 가상 공간에서 보안 및 환경 관제가 가능하도록 관계자 단말 제공 할 수 있다. 또한, 실시간 사고 예측 시스템은 3D 가상 공간에서 정보를 제공함에 있어서, 실사 3D 모델이 자유롭게 줌 인, 줌아웃, 회전이 가능한 3D 모델 인터페이스를 제공하며, IoT 센서 측정 값뿐 아니라 시설 내 CCTV 영상과 연동하여 제공할 수 있다. 이처럼, 실시간 사고 예측 시스템은 사건 수목에 따른 순차에 대한 내용에 대해서 3D 가상 공간을 통해 정 보를 제공할 수 있다. 한편, 이러한 실시간 사고 예측 시스템은 사고 이전 또는 사고 발생 시 자료들을 지 속적으로 수집하여 빅데이터를 구축하고 인공지능(AI)를 활용하여 반복 학습 및 적용함에 따라 사고 예측의 정 확도 및 대응 방안의 신뢰도를 향상시킬 수 있다. 이와 같이, 동적 종합 안전성 분석과 사물인터넷을 이용한 실시간 사고 예측 시스템은 실시간 시설 상황을 정확 하게 분석하여 예측함으로써, 이상 감지에 대해 복합적인 대응이 가능한 선제적 정교한 대응책을 제공할 수 있 다. 본 발명의 하나의 실시예에 따른 방법을 실행시키기 위한 프로그램은 컴퓨터 판독 가능한 기록 매체에 기록될 수 있다. 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있 다. 상기 매체는 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것 일 수도 있다. 컴퓨터 판독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체, CD-ROM, DVD와 같은 광기록 매체, 플롭티컬 디스크와 같은 자기-광 매체, 및 롬, 램, 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함된다. 여기서 매체는 프로그램 명령, 데이터 구조 등을 지정하는 신호를 전송하는 반송파를 포함하는 광 또는 금속선, 도파관 등의 전송 매체 일 수도 있다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프 리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드가 포함된다. 이상에서 본 발명의 바람직한 실시예에 대하여 상세하게 설명하였지만 본 발명의 권리범위는 이에 한정되는 것 은 아니고 다음의 청구범위에서 정의하고 있는 본 발명의 기본 개념을 이용한 당업자의 여러 변형 및 개량 형태 또한 본 발명의 권리범위에 속하는 것이다."}
{"patent_id": "10-2019-0027048", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 한 실시예에 따른 실시간 사고 예측 시스템을 포함하는 통신 네트워크를 나타낸 예시도이다. 도 2는 본 발명의 한 실시예에 따른 실시간 사고 예측 시스템을 나타내는 구성도이다. 도 3은 본 발명의 한 실시예에 따른 ISA 분석부를 나타낸 구성도이다. 도 4는 본 발명의 한 실시예에 따른 범주를 통한 위해도 지수를 산정하는 방법을 설명하기 위한 예시도이다. 도 5는 본 발명의 한 실시예에 따른 실시간 사고 예측 시스템의 사고 예측 방법을 나타낸 순서도이다. 도 6은 본 발명의 한 실시예에 따른 No.01-1 위해도 기준 사건을 포함하는 사건 수목을 나타낸 예시도이다. 도 7은 본 발명의 한 실시예에 따른 No.01-2 위해도 기준 사건을 포함하는 사건 수목을 나타낸 예시도이다. 도 8은 본 발명의 한 실시예에 따른 화재 발생 원인에 대한 사고 경위를 나타내는 예시도이다. 도 9는 본 발명의 한 실시예에 따른 누전 및 전기화재 발생 원인에 대한 사고 경위를 나타낸 예시도이다. 도 10은 본 발명의 한 실시예에 따른 방사능 누출과 관련된 사고 경위를 나타낸 예시도이다. 도 11은 본 발명의 한 실시예에 따른 실시간 예상사고 목록에서 개별 빈도 값에 따라 변동되는 우선순위를 설명 하기 위한 예시도이다. 도 12는 본 발명의 한 실시예에 따른 실시간 예상사고 목록에서 결말 범주의 결말 값의 상승에 의해 변동되는 우선순위를 설명하기 위한 예시도이다. 도 13은 본 발명의 한 실시예에 따른 사고 예측 정보에 따라 환경 또는 상태 정보를 시각화하여 제공하는 구성 을 설명하기 위한 예시도이다."}
