{"patent_id": "10-2022-0033031", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0049530", "출원번호": "10-2022-0033031", "발명의 명칭": "전자 장치 및 타겟 도메인 생성 방법", "출원인": "삼성전자주식회사", "발명자": "김상연"}}
{"patent_id": "10-2022-0033031", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "GAN(Generative Adversarial Network) 기반 타겟 도메인 생성 방법에 있어서,소스 도메인에 포함된 소스 데이터를 재구성하는 단계;상기 소스 데이터를 기초로 상기 재구성된 소스 데이터를 훈련시켜 타겟 데이터를 생성하는 단계; 및상기 생성된 타겟 데이터를 포함하는 타겟 도메인을 생성하는 단계;를 포함하고,상기 타겟 데이터를 생성하는 단계는,클래스 손실에 의한 클래스 손실 값 및 거리 매트릭스 손실에 의한 거리 손실 값 중 적어도 하나의 손실 값을식별하고, 상기 식별된 클래스 손실 값 및 거리 손실 값 중 적어도 하나의 손실 값을 상기 재구성된 소스 데이터에 적용하는, 타겟 도메인 생성 방법."}
{"patent_id": "10-2022-0033031", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 타겟 데이터를 생성하는 단계는,복수의 클래스 중 상기 소스 데이터가 포함된 클래스를 기초로 상기 소스 데이터에 대응되는 재구성된 소스 데이트에 대한 클래스의 분류가 일치하는 경우 기 설정된 방식에 따라 제1 클래스 손실 값을 식별하고, 상기 재구성된 소스 데이터에 대한 클래스의 분류가 불일치하는 경우 상기 기 설정된 방식에 따라 제2 클래스 손실 값을식별하여 클래스 손실 값을 획득하며, 상기 제2 클래스 손실 값은 상기 제1 클래스 손실 값보다 큰, 타겟 도메인 생성 방법."}
{"patent_id": "10-2022-0033031", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 타겟 데이터를 생성하는 단계는,복수의 클래스 중 서로 다른 클래스에 포함된 소스 데이터의 특징 벡터 간의 거리에 기초하여 거리 맵을 식별하고, 상기 식별된 거리 맵에 기초하여 상기 소스 데이터에 대응되는 재구성된 소스 데이터의 특징 벡터 간의 거리가 유지되도록 상기 거리 손실 값을 획득하는, 타겟 도메인 생성 방법."}
{"patent_id": "10-2022-0033031", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 타겟 데이터를 생성하는 단계는,클러스터 손실에 의한 클러스터 손실 값, CAM(Class Activating Mapping) 손실에 의한 CAM 손실 값 및 특징 손실에 의한 특징 손실 값 중 적어도 하나의 손실 값을 식별하고, 상기 식별된 클러스터 손실 값, CAM 손실 값 및특징 손실 값 중 적어도 하나의 손실 값을 상기 재구성된 소스 데이터에 추가적으로 적용하는, 타겟 도메인 생성 방법."}
{"patent_id": "10-2022-0033031", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 타겟 데이터를 생성하는 단계는,복수의 클래스 중 서로 다른 클래스에 포함되는 재구성된 소스 데이터의 특징 벡터의 거리가 이격되도록 기 설정된 방식에 기초하여 클러스터 손실 값을 획득하는, 타겟 도메인 생성 방법.공개특허 10-2023-0049530-3-청구항 6 제4항에 있어서,상기 타겟 데이터를 생성하는 단계는,상기 소스 도메인을 포함하는 인공지능 신경망 학습 모델이 상기 소스 데이터의 클래스를 분류할 때 적용하는상기 소스 데이터의 가중치 영역을 식별하고, 상기 식별된 상기 소스 데이터에 대응되는 재구성된 소스 데이터의 가중치 영역을 설정하기 위한 CAM 손실 값을 획득하는, 타겟 도메인 생성 방법."}
{"patent_id": "10-2022-0033031", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 가중치 영역은,이미지 데이터의 특정 영역 및 신호 데이터의 특정 주파수 영역 중 적어도 하나의 영역을 포함하는, 타겟 도메인 생성 방법."}
{"patent_id": "10-2022-0033031", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제4항에 있어서,상기 타겟 데이터를 생성하는 단계는,상기 소스 데이터의 특징 벡터와 상기 소스 데이터에 대응되는 재구성된 소스 데이터의 특징 벡터가 동일하도록상기 특징 손실 값을 획득하는, 타겟 도메인 생성 방법."}
{"patent_id": "10-2022-0033031", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 소스 도메인은 제1 전자 장치의 인공 지능 학습 모델에서 생성된 도메인이고, 상기 타겟 도메인은 제2 전자 장치의 인공 지능 학습 모델을 위한 도메인이며, 상기 제1 전자 장치 및 상기 제2 전자 장치는 하드웨어 사양, 소프트웨어 플랫폼, 소프트웨어 버전 중 적어도 하나가 서로 다른, 타겟 도메인 생성 방법."}
{"patent_id": "10-2022-0033031", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "GAN(Generative Adversarial Network) 기반 타겟 도메인을 생성하는 전자 장치에 있어서,입력 인터페이스; 및프로세서;를 포함하고,상기 프로세서는,상기 입력 인터페이스를 통해 소스 도메인에 포함된 소스 데이터를 입력받고,소스 도메인에 포함된 소스 데이터를 재구성하며,상기 소스 데이터를 기초로 상기 재구성된 소스 데이터를 훈련시켜 타겟 데이터를 생성하고,상기 생성된 타겟 데이터를 포함하는 타겟 도메인을 생성하며,상기 프로세서는,클래스 손실에 의한 클래스 손실 값 및 거리 매트릭스 손실에 의한 거리 손실 값 중 적어도 하나의 손실 값을식별하고, 상기 식별된 클래스 손실 값 및 거리 손실 값 중 적어도 하나의 손실 값을 상기 재구성된 소스 데이터에 적용하는, 전자 장치."}
{"patent_id": "10-2022-0033031", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 프로세서는,공개특허 10-2023-0049530-4-복수의 클래스 중 상기 소스 데이터가 포함된 클래스를 기초로 상기 소스 데이터에 대응되는 재구성된 소스 데이트에 대한 클래스의 분류가 일치하는 경우 기 설정된 방식에 따라 제1 클래스 손실 값을 식별하고, 상기 재구성된 소스 데이터에 대한 클래스의 분류가 불일치하는 경우 상기 기 설정된 방식에 따라 제2 클래스 손실 값을식별하여 클래스 손실 값을 획득하며, 상기 제2 클래스 손실 값은 상기 제1 클래스 손실 값보다 큰, 전자 장치."}
{"patent_id": "10-2022-0033031", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항에 있어서,상기 프로세서는,복수의 클래스 중 서로 다른 클래스에 포함된 소스 데이터의 특징 벡터 간의 거리에 기초하여 거리 맵을 식별하고, 상기 식별된 거리 맵에 기초하여 상기 소스 데이터에 대응되는 재구성된 소스 데이터의 특징 벡터 간의 거리가 유지되도록 상기 거리 손실 값을 획득하는, 전자 장치."}
{"patent_id": "10-2022-0033031", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제10항에 있어서,상기 프로세서는,복수의 클래스 중 서로 다른 클래스에 포함되는 재구성된 소스 데이터의 특징 벡터의 거리가 이격되도록 기 설정된 방식에 기초하여 클러스터 손실 값을 획득하는, 전자 장치."}
{"patent_id": "10-2022-0033031", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제10항에 있어서,상기 프로세서는,클러스터 손실에 의한 클러스터 손실 값, CAM(Class Activating Mapping) 손실에 의한 CAM 손실 값 및 특징 손실에 의한 특징 손실 값 중 적어도 하나의 손실 값을 식별하고, 상기 식별된 클러스터 손실 값, CAM 손실 값 및특징 손실 값 중 적어도 하나의 손실 값을 상기 재구성된 소스 데이터에 추가적으로 적용하는, 전자 장치."}
{"patent_id": "10-2022-0033031", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 프로세서는,상기 소스 도메인을 포함하는 인공지능 신경망 학습 모델이 상기 소스 데이터의 클래스를 분류할 때 적용하는상기 소스 데이터의 가중치 영역을 식별하고, 상기 식별된 상기 소스 데이터에 대응되는 재구성된 소스 데이터의 가중치 영역을 설정하기 위한 CAM 손실 값을 획득하는, 전자 장치."}
{"patent_id": "10-2022-0033031", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 가중치 영역은,이미지 데이터의 특정 영역 및 신호 데이터의 특정 주파수 영역 중 적어도 하나의 영역을 포함하는, 전자 장치."}
{"patent_id": "10-2022-0033031", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제14항에 있어서,상기 프로세서는,상기 소스 데이터의 특징 벡터와 상기 소스 데이터에 대응되는 재구성된 소스 데이터의 특징 벡터가 동일하도록상기 특징 손실 값을 획득하는, 전자 장치."}
{"patent_id": "10-2022-0033031", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "공개특허 10-2023-0049530-5-제10항에 있어서,상기 소스 도메인은 외부 전자 장치의 인공 지능 학습 모델에서 생성된 도메인이고, 상기 타겟 도메인은 상기전자 장치의 인공 지능 학습 모델을 위한 도메인이며, 상기 외부 전자 장치 및 상기 전자 장치는 하드웨어사양, 소프트웨어 플랫폼, 소프트웨어 버전 중 적어도 하나가 서로 다른, 전자 장치."}
{"patent_id": "10-2022-0033031", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "GAN(Generative Adversarial Network) 기반 타겟 도메인 생성 방법을 수행하는 프로그램이 기록된 비일시적 컴퓨터 판독 가능 저장 매체에 있어서,소스 도메인에 포함된 소스 데이터를 재구성하는 단계;상기 소스 데이터를 기초로 상기 재구성된 소스 데이터를 훈련시켜 타겟 데이터를 생성하는 단계; 및상기 생성된 타겟 데이터를 포함하는 타겟 도메인을 생성하는 단계;를 포함하고,상기 타겟 데이터를 생성하는 단계는,클래스 손실에 의한 클래스 손실 값 및 거리 매트릭스 손실에 의한 거리 손실 값 중 적어도 하나의 손실 값을식별하고, 상기 식별된 클래스 손실 값 및 거리 손실 값 중 적어도 하나의 손실 값을 상기 재구성된 소스 데이터에 적용하는, 타겟 도메인 생성 방법을 수행하는 프로그램이 기록된 비일시적 컴퓨터 판독 가능 저장 매체."}
{"patent_id": "10-2022-0033031", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서,상기 타겟 데이터를 생성하는 단계는,클러스터 손실에 의한 클러스터 손실 값, CAM(Class Activating Mapping) 손실에 의한 CAM 손실 값 및 특징 손실에 의한 특징 손실 값 중 적어도 하나의 손실 값을 식별하고, 상기 식별된 클러스터 손실 값, CAM 손실 값 및특징 손실 값 중 적어도 하나의 손실 값을 상기 재구성된 소스 데이터에 추가적으로 적용하는, 타겟 도메인 생성 방법을 수행하는 프로그램이 기록된 비일시적 컴퓨터 판독 가능 저장 매체."}
{"patent_id": "10-2022-0033031", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "GAN 기반 타겟 도메인 생성하는 전자 장치 및 그 방법이 개시된다. 타겟 도메인 생성 방법은 소스 도메인에 포함 된 소스 데이터를 재구성하는 단계, 소스 데이터를 기초로 재구성된 소스 데이터를 훈련시켜 타겟 데이터를 생성 하는 단계 및 생성된 타겟 데이터를 포함하는 타겟 도메인을 생성하는 단계를 포함하고, 훈련시키는 단계는 클래 스 손실에 의한 클래스 손실 값 및 거리 매트릭스 손실에 의한 거리 손실 값 중 적어도 하나의 손실 값을 식별하 고, 식별된 클래스 손실 값 및 거리 손실 값 중 적어도 하나의 손실 값을 재구성된 소스 데이터에 적용한다."}
{"patent_id": "10-2022-0033031", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 전자 장치 및 타겟 도메인 생성 방법에 관한 것으로, 상세하게는, 도메인을 이동시키는 전자 장치 및 타겟 도메인 생성 방법에 관한 것이다."}
{"patent_id": "10-2022-0033031", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "산업에서 빅데이터의 중요성이 높아짐에 따라 다양한 효율적인 데이터 활용 방법이 등장하고 있다. 다양한 사양 의 전자 장치의 개발과 함께 다른 사양의 새로운 전자 장치에는 대상 모델(타겟 모델)에 따른 새로운 데이터가 적용되어야 한다. 그러나, 새로운 전자 장치의 대상 모델에 적용되는 초기의 데이터는 부족할 수 있다. 따라서, 부족한 데이터를 보완하는 방법에 대한 연구도 진행되고 있으며, 하나의 방법으로 도메인 이전 또는 도메인 적 응 기술이 연구되고 있다. 특히, GAN(Generative Adversarial Networks)의 발전과 함께 타겟 도메인의 적은 양 의 데이터와 소스 도메인의 많은 양의 데이터 간의 관계를 분석하여 타겟 도메인에서 다양한 데이터를 생성하는 연구가 진행되고 있다. 예를 들어, 최근 연구되는 방법은 GAN을 이용하여 실제 데이터(real data)와 매우 유사한 가짜 데이터(fake data)를 생성한다. 그러나, GAN에서 생성된 데이터로 대상 모델을 처음부터 학습하면 타겟 도메인의 정확도가 떨어진다. 타겟 도메인의 정확도가 떨어지는 가장 큰 이유는 기존 소스 모델에서 학습한 소스 데이터의 특성이 변환된 타겟 데이터에서 변경되거나 특성의 분포가 다르기 때문이다. 특히, 이미지를 보다 사실적으로 변환하는 GAN의 손실(loss)은 소스 모델에 반영된 특성에 관계없이 실제 데이터처럼 변환하도록 학습되기 때문에 타겟 데 이터의 특성 분포가 소스의 특성 분포와 매우 다를 수 있다. 즉, 실제 데이터로 보이는 특성과 소스 모델에 반 영된 특성이 다를 수 있다. 따라서, 소스 모델의 소스 데이터를 대상 모델의 타겟 데이터로 변환할 때 다양한 손실 함수를 이용하여 소스 모델의 기존 정보를 대상 모델에 반영하여 학습할 수 있는 방법에 대한 필요성이 존재한다."}
{"patent_id": "10-2022-0033031", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 상술한 문제점을 해결하기 위한 것으로, 본 개시의 목적은 소스 모델의 소스 데이터의 정보를 대상 모델에 반영하여 학습하는 전자 장치 및 타겟 도메인 생성 방법을 제공하는 것이다."}
{"patent_id": "10-2022-0033031", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시 예에 따른 GAN(Generative Adversarial Network) 기반 타겟 도메인 생성 방법은 소스 도메 인에 포함된 소스 데이터를 재구성하는 단계, 상기 소스 데이터를 기초로 상기 재구성된 소스 데이터를 훈련시 켜 타겟 데이터를 생성하는 단계 및 상기 생성된 타겟 데이터를 포함하는 타겟 도메인을 생성하는 단계를 포함 하고, 상기 훈련시키는 단계는 클래스 손실에 의한 클래스 손실 값 및 거리 매트릭스 손실에 의한 거리 손실 값 중 적어도 하나의 손실 값을 식별하고, 상기 식별된 클래스 손실 값 및 거리 손실 값 중 적어도 하나의 손실 값 을 상기 재구성된 소스 데이터에 적용한다. 본 개시의 일 실시 예에 따른 GAN(Generative Adversarial Network) 기반 타겟 도메인을 생성하는 전자 장치는 입력 인터페이스 및 프로세서를 포함하고, 상기 프로세서는 상기 입력 인터페이스를 통해 소스 도메인에 포함된 소스 데이터를 입력받고, 소스 도메인에 포함된 소스 데이터를 재구성하며, 상기 소스 데이터를 기초로 상기 재 구성된 소스 데이터를 훈련시켜 타겟 데이터를 생성하고, 상기 생성된 타겟 데이터를 포함하는 타겟 도메인을 생성하며, 상기 프로세서는 클래스 손실에 의한 클래스 손실 값 및 거리 매트릭스 손실에 의한 거리 손실 값 중 적어도 하나의 손실 값을 식별하고, 상기 식별된 클래스 손실 값 및 거리 손실 값 중 적어도 하나의 손실 값을 상기 재구성된 소스 데이터에 적용한다. 본 개시의 일 실시 예에 따른 GAN(Generative Adversarial Network) 기반 타겟 도메인 생성 방법을 수행하는 프로그램이 기록된 비일시적 컴퓨터 판독 가능 저장 매체는 소스 도메인에 포함된 소스 데이터를 재구성하는 단 계, 상기 소스 데이터를 기초로 상기 재구성된 소스 데이터를 훈련시켜 타겟 데이터를 생성하는 단계 및 상기 생성된 타겟 데이터를 포함하는 타겟 도메인을 생성하는 단계를 포함하고, 상기 훈련시키는 단계는 클래스 손실 에 의한 클래스 손실 값 및 거리 매트릭스 손실에 의한 거리 손실 값 중 적어도 하나의 손실 값을 식별하고, 상 기 식별된 클래스 손실 값 및 거리 손실 값 중 적어도 하나의 손실 값을 상기 재구성된 소스 데이터에 적용한다."}
{"patent_id": "10-2022-0033031", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 첨부된 도면을 참조하여 다양한 실시 예를 보다 상세하게 설명한다. 본 명세서에 기재된 실시 예는 다양하게 변형될 수 있다. 특정한 실시 예가 도면에서 묘사되고 상세한 설명에서 자세하게 설명될 수 있다. 그 러나, 첨부된 도면에 개시된 특정한 실시 예는 다양한 실시 예를 쉽게 이해하도록 하기 위한 것일 뿐이다. 따라 서, 첨부된 도면에 개시된 특정 실시 예에 의해 기술적 사상이 제한되는 것은 아니며, 개시의 사상 및 기술 범 위에 포함되는 모든 균등물 또는 대체물을 포함하는 것으로 이해되어야 한다. 제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 이러한 구성 요소들은 상술한 용어에 의해 한정되지는 않는다. 상술한 용어는 하나의 구성요소를 다른 구성요소로부터 구별 하는 목적으로만 사용된다. 본 명세서에서, \"포함한다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되 어야 한다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속 되어\" 있다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 한편, 본 명세서에서 사용되는 구성요소에 대한 \"모듈\" 또는 \"부\"는 적어도 하나의 기능 또는 동작을 수행한다. 그리고, \"모듈\" 또는 \"부\"는 하드웨어, 소프트웨어 또는 하드웨어와 소프트웨어의 조합에 의해 기능 또는 동작 을 수행할 수 있다. 또한, 특정 하드웨어에서 수행되어야 하거나 적어도 하나의 프로세서에서 수행되는 \"모듈\" 또는 \"부\"를 제외한 복수의 \"모듈들\" 또는 복수의 \"부들\"은 적어도 하나의 모듈로 통합될 수도 있다. 단수의 표 현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 개시의 설명에 있어서 각 단계의 순서는 선행 단계가 논리적 및 시간적으로 반드시 후행 단계에 앞서서 수행 되어야 하는 경우가 아니라면 각 단계의 순서는 비제한적으로 이해되어야 한다. 즉, 위와 같은 예외적인 경우를 제외하고는 후행 단계로 설명된 과정이 선행단계로 설명된 과정보다 앞서서 수행되더라도 개시의 본질에는 영향 이 없으며 권리범위 역시 단계의 순서에 관계없이 정의되어야 한다. 그리고 본 명세서에서 \"A 또는 B\"라고 기재 한 것은 A와 B 중 어느 하나를 선택적으로 가리키는 것뿐만 아니라 A와 B 모두를 포함하는 것도 의미하는 것으 로 정의된다. 또한, 본 명세서에서 \"포함\"이라는 용어는 포함하는 것으로 나열된 요소 이외에 추가로 다른 구성 요소를 더 포함하는 것도 포괄하는 의미를 가진다. 본 명세서에서는 본 개시의 설명에 필요한 필수적인 구성요소만을 설명하며, 본 개시의 본질과 관계가 없는 구 성요소는 언급하지 아니한다. 그리고 언급되는 구성요소만을 포함하는 배타적인 의미로 해석되어서는 아니되며 다른 구성요소도 포함할 수 있는 비배타적인 의미로 해석되어야 한다. 그 밖에도, 본 개시를 설명함에 있어서, 관련된 공지 기능 혹은 구성에 대한 구체적인 설명이 본 개시의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우, 그에 대한 상세한 설명은 축약하거나 생략한다. 한편, 각 실시 예는 독립적으로 구현되거나 동작될 수도 있지만, 각 실시 예는 조합되어 구현되거나 동작될 수도 있다. 도 1은 본 개시의 일 실시 예에 따른 전자 장치의 구성을 설명하는 블록도이다. 도 1을 참조하면, 전자 장치는 입력 인터페이스 및 프로세서를 포함할 수 있다. 입력 인터페이스는 외부로부터 신호를 입력받을 수 있다. 예를 들어, 입력 인터페이스는 키 패드, 키 패드, 터치 패드, 터치 스크린 등의 형태로 구현되고, 사용자로부터 제어 신호를 입력받을 수 있다. 전자 장치 는 입력된 제어 신호에 따라 제어 동작을 수행할 수 있다. 또는, 넓은 의미에서 입력 인터페이스는 통신 인터페이스를 포함할 수 있다. 입력 인터페이스가 통신 인터페이스를 포함하는 경우, 입력 인터페이 스는 유무선 통신 방식(또는 통신 규격)으로 외부 장치와 통신을 수행할 수 있다. 예를 들어, 입력 인터페 이스는 Wi-Fi, Wi-Fi 다이렉트, 블루투스, 지그비, 3G(3rd Generation), 3GPP(3rd Generation Partnership Project) 및 LTE(Long Term Evoloution)의 무선 통신 방식 중 적어도 하나 이상의 통신 방식 또는 SCSI(Small Computer System Interface), USB(Universal Serial Bus), IEEE1394, e-SATA(Serial AT Attachment), 썬더볼트, 유선 랜의 유선 통신 방식 중 적어도 하나 이상의 통신 방식으로 외부 장치와 통신을 수행할 수 있다. 입력 인터페이스는 외부 장치로부터 소스 도메인에 포함된 소스 데이터를 수신할 수 있다. 예를 들어, 입력 인터페이스는 입력 장치, 입력부, 입력 모듈 등으로 불릴 수도 있다. 프로세서는 전자 장치의 각 구성을 제어할 수 있다. 예를 들어, 프로세서는 소스 도메인에 포함 된 소스 데이터를 입력받도록 입력 인터페이스를 제어할 수 있다. 프로세서는 GAN으로 구현된 인공 지능 신경망 모델을 포함하고, 포함된 인공 지능 신경망 모델에 사용되는 타겟 데이터를 포함하는 타겟 도메인을 생성할 수 있다. 즉, 프로세서는 소스 도메인에 포함된 소스 데이 터를 재구성할 수 있다. 프로세서는 소스 데이터를 기초로 재구성된 소스 데이터를 훈련시켜 타겟 데이터 를 생성하고, 생성된 타겟 데이터를 포함하는 타겟 도메인을 생성할 수 있다. 한편, GAN 모델은 소스 데이터에 반영된 특성에 관계없이 실제 데이터처럼 변환하도록 학습할 수 있다. 따라서, 실제 데이터로 보이는 특성과 소스 데이터에 반영된 특성이 다를 수 있기 때문에 소스 데이터를 기초로 생성된 타겟 데이터로 학습한 전자 장치 는 정확도가 떨어질 수 있다. 예를 들어, 소스 도메인은 외부 전자 장치의 인공 지능 학습 모델에서 생성 된 도메인이고, 타겟 도메인은 전자 장치의 인공 지능 학습 모델을 위한 도메인일 수 있다. 외부 전자 장치와 전자 장치는 하드웨어 사양, 소프트웨어 플랫폼, 소프트웨어 버전 등이 서로 다를 수 있다. 따라서, 외부 전자 장치에서 학습되어 정확도가 높은 학습 모델(또는 학습 데이터)은 전자 장치에서 그대로 사용(또는 학습)하면 전자 장치에서 학습 모델의 성능이 떨어질 수 있다. 따라서, 소스 데이터를 기초로 생성된 타겟 데이터로 학습한 전자 장치의 정확도를 높이기 위해 프로세서 는 다양한 손실 값을 재구성된 소스 데이터에 적용할 수 있다. 예를 들어, 프로세서는 클래스 손실에 의한 클래스 손실 값, 거리 매트릭스 손실에 의한 거리 손실 값을 식별할 수 있다. 프로세서는 식별된 손실 값을 재구성된 소스 데이터에 적용하여 타겟 데이터를 생성할 수 있다. 또한, 프로세서는 클러스터 손실에 의한 클러스터 손실 값, CAM(Class Activating Mapping) 손실에 의한 CAM 손실 값, 특징 손실에 의한 특징 손실 값 등을 추가적으로 식별할 수 있다. 프로세서는 식별된 클러스터 손실 값, CAM 손실 값, 특징 손실 값 등을 재구성된 소스 데이터에 추가적으로 적용하여 타겟 데이터 를 생성할 수 있다. 각 손실에 대한 구체적인 설명은 후술한다. 도 2는 본 개시의 일 실시 예에 따른 전자 장치의 구체적인 구성을 설명하는 블록도이다. 도 2를 참조하면, 전자 장치는 입력 인터페이스, 프로세서, 통신 인터페이스, 카메라 , 마이크, 스피커, 디스플레이, 메모리, 센서를 포함할 수 있다. 입력 인터페 이스는 도 1에서 설명한 바와 동일하고, 통신 인터페이스도 넓은 의미에서 입력 인터페이스에 포함될 수 있다고 설명하였으므로 구체적인 설명은 생략한다. 카메라는 사용자를 포함한 주변 환경을 촬영할 수 있다. 프로세서는 카메라에서 촬영된 이미지 에 기초하여 주변 환경에 대한 정보, 사용자의 이미지에 대한 정보 등을 획득할 수 있다. 그리고, 프로세서 는 획득된 정보에 기초하여 대응되는 동작을 수행할 수 있다. 또는, 프로세서는 획득된 정보와 인공 지능 신경망 모델(예, GAN 모델)에 기초하여 획득된 정보를 식별할 수 있다. 예를 들어, 카메라는 CCD 센 서, CMOS 센서를 포함할 수 있다. 또한, 카메라는 RGB 카메라, 뎁스 카메라, 광각 카메라, 망원 카메라 등 을 포함할 수 있다. 마이크는 사용자의 사운드 또는 주변 환경의 사운드를 입력받을 수 있다. 프로세서는 입력된 사용자 의 사운드 또는 주변 환경의 사운드에 기초하여 대응되는 동작을 수행할 수 있다. 또는, 프로세서는 획득 된 사운드 및 인공 지능 신경망 모델(예, GAN 모델)에 기초하여 획득된 사운드를 식별할 수 있다. 예를 들어, 마이크는 일반 마이크, 서라운드 마이크, 지향성 마이크 등을 포함할 수 있다. 스피커는 사운드 신호를 출력할 수 있다. 예를 들어, 스피커는 사용자의 입력 명령에 대한 정보, 경 고 관련 정보, 전자 장치의 상태 관련 정보 또는 동작 관련 정보 등을 음성이나 알림음으로 출력할 수 있 다. 디스플레이는 프로세서에서 처리된 데이터를 영상으로 출력할 수 있다. 디스플레이는 정보를 표 시할 수 있고, 인식된 사용자의 명령에 대응되는 화면을 출력할 수 있다. 예를 들어, 디스플레이는 LCD(Liquid Crystal Display), OLED(Organic Light Emitting Diode), 플렉서블 디스플레이, 터치 스크린 등으 로 구현될 수 있다. 디스플레이가 터치 스크린으로 구현되는 경우, 전자 장치는 터치 스크린을 통해 제어 명령을 입력받을 수 있다. 메모리는 전자 장치의 기능을 수행하는 데이터 및 알고리즘 등을 저장하고, 전자 장치에서 구동 되는 프로그램, 명령어 등을 저장할 수 있다. 또한, 메모리는 인공 지능 신경망 모델(또는, 알고리즘) 등 을 저장할 수 있다. 예를 들어, 메모리는 롬, 램, HDD, SSD, 메모리 카드 등의 타입으로 구현될 수 있다. 센서는 전자 장치의 상태, 주변의 환경, 물체 또는 사용자를 감지할 수 있다. 예를 들어, 센서 는 이미지 센서, 모션 인식 센서, 근접 센서, 열 감지 센서, 터치 센서, 적외선 센서, 초음파 센서, 지자기 센 서, 중력 센서, 가속도 센서 등을 포함할 수 있다. 지금까지, 전자 장치의 구성을 설명하였다. 아래에서는 전자 장치가 타겟 데이터를 포함하는 타겟 도 메인을 생성하는 과정을 설명한다.도 3은 GAN의 일 실시 예를 설명하는 도면이다. 본 개시의 인공 지능 신경망은 GAN으로 구현될 수 있다. GAN은 생성자(generator)와 판별자 (discriminator)를 포함한다. 예를 들어, 생성자는 가우시안 분포와 같은 랜덤한 분포를 입력받고 가짜 데이터를 생성할 수 있다. 판별자는 훈련된 실제 데이터 및 생성된 가짜 데이터를 입력받고, 입력된 데이터 가 실제 데이터인지 가짜 데이터인지 판별할 수 있다. 일 실시 예로서, GAN은 판별자의 학습을 위해 생성자를 통해 가짜 이미지의 배치(batch)를 생성하고, 훈련 데이터에서 동일한 크기의 배치(batch)를 샘플링한 후 두 배치를 합칠 수 있다. 가짜 이미지에는 0이 부여 되고, 실제 데이터에는 1이 부여될 수 있다. 판별자 학습 과정에서 판별자의 가중치는 업데이트될 수 있다. 그러나, 업데이트된 판별자의 가중치는 역전파를 하지 않기 때문에 생성자의 가중치는 업데이트 되지 않는다. GAN은 생성자의 학습을 위해 생성자를 통해 가짜 이미지의 배치를 생성할 수 있다. GAN은 실제 이미지를 추가하지 않고 가짜 이미지의 배치의 라벨을 1로 설정하고 판별자에게 판별시킬 수 있다. 생 성자로 역전파가 진행되어 생성자의 가중치는 업데이트되지만, 판별자의 가중치는 기존 값을 유지한다. 상술한 과정을 통해 생성자는 실제 데이터에 가까운 가짜 데이터를 생성하도록 훈련되고, 판별자는 실 제 데이터와 가짜 데이터를 판별하도록 훈련됨으로써 GAN의 판별 성능이 향상될 수 있다. 생성자와 판별자 는 서로 다른 방향으로 학습되기 때문에 GAN은 적대적 네트워크라고 칭할 수 있다. 즉, GAN은 기존 소스 데 이터와 거의 동일한 가짜 데이터를 생성하고 판별자를 학습시킴으로써 적은 수의 데이터를 이용하여 인공 지능 신경망 모델을 학습시킬 수 있는 장점이 있다. 한편, GAN은 가짜 데이터를 실제 데이터로 생성하기 위한 것이므로 GAN에는 타겟 모델이 반영되지 않거나 타겟 모델이 없을 수 있다. 따라서, 본 개시는 적은 수의 데이터를 이용하여 인공 지능 신경망 모델을 학습시키는 GAN의 장점을 유지하면서 소스 데이터와 타겟 모델을 고려한 다양한 손실 함수를 적용하여 타겟 도메인을 생성하는 성능(또는, 타겟 도메 인에 기초한 인공 지능 신경망의 판별 성능)을 향상시킬 수 있다. 도 4는 본 개시의 일 실시 예에 따른 손실 모듈을 설명하는 도면이고, 도 5는 본 개시의 일 실시 예에 따른 기 존 모델과 본 개시의 손실을 적용한 모델 간의 차이를 나타내는 도면이다. 도 4 및 도 5를 참조하여 설명한다. 도 4를 참조하면, 프로세서는 클래스 손실 모듈, 거리 매트릭스 손실 모듈, 클러스터 손실 모듈 , CAM 손실 모듈, 특징 손실 모듈을 포함할 수 있다. 예를 들어, 프로세서는 클래스 손실 모듈 및/또는 거리 매트릭스 손실 모듈을 포함할 수 있다. 또는, 프로세서는 클래스 손실 모듈 및/또는 거리 매트릭스 손실 모듈 외에 하나 이상의 다른 손실 모듈(123, 124, 125)을 포함할 수 있 다. 각 손실 모듈은 소프트웨어로 구현될 수 있다. 또한, 도 4에는 각 손실 모듈이 별개의 모듈로 도시되었으나, 각 손실 모듈은 하나의 손실 모듈로 구현되고 서로 연계되어 동작할 수도 있다. 그리고, 각 손실 모듈(또는, 하나의 손실 모듈)은 메모리에 저장되고, 프로세서가 인공 지능 신경망 모델을 학습시킬 때 메 모리에서 프로세서로 로딩하여 동작시킬 수 있다. 클래스 손실 모듈은 클래스 손실 값을 획득할 수 있다. 클래스 손실 모듈은 복수의 클래스 중 소스 데이터가 포함된 클래스를 기초로 소스 데이터에 대응되는 재구성된 소스 데이터에 대한 클래스의 분류가 일치 하는 경우 기 설정된 방식에 따라 제1 클래스 손실 값을 식별하고, 재구성된 소스 데이터에 대한 클래스의 분류 가 불일치하는 경우 기 설정된 방식에 따라 제2 클래스 손실 값을 식별하여 클래스 손실 값을 획득할 수 있다. 제2 클래스 손실 값은 제1 클래스 손실 값보다 큰 값일 수 있다. 일 실시 예로서, 소스 데이터가 A 클래스로 분 류되고 재구성된 소스 데이터도 A 클래스로 분류되면, 클래스 손실 모듈은 클래스의 분류가 일치하는 것으 로 판단할 수 있다. 소스 데이터가 A 클래스로 분류되고 재구성된 소스 데이터는 B 클래스로 분류되면, 클래스 손실 모듈은 클래스의 분류가 불일치하는 것으로 판단할 수 있다. 소스 모델에서 특징 벡터의 분포가 다를 수 있다. 따라서, 클래스 손실은 특징 벡터의 분포에 대한 학습이 어려 울 때 단순히 클래스를 유지함으로써 적대적 손실과 유사한 효과를 가질 수 있다. GAN 모델에서 적대적 손실은 진짜와 가짜를 구별하기 위한 것이지만, 클래스 손실의 경우 GAN 모델을 통해 생성된 데이터에 중요한 클래스의 더 자세한 부분을 생성하는 데 도움이 될 수 있다. 일 실시 예로서, 클래스 손실은 (식 1)을 이용하여 산출될 수 있다. ---- (식 1) 여기서, C는 소스 모델의 비용 함수(cost function)이고, 범주형 교차 엔트로피(categorical cross entropy)가 사용될 수 있다. 는 가짜 소스 데이터, 는 재구성된 소스 데이터를 의미한다. Msource는 많은 양의 소스 도메인의 데이터를 이용하여 학습된 소스 모델을 의미한다. Msource(x)는 데이터 x를 소스 모델에 입력했을 때, 각 클래스에 대한 확률분포 값을 출력할 수 있다. label(x)는 x의 true 라벨 값을 의미한다. 일 실시 예로 서, 소스 모델이 ‘개’와 ‘고양이’를 분류하는 모델이고, 이 ‘개’라면, = [1,0] 이고, = [0.7, 0.3]일 수 있다. 이 두 벡터 간의 차이는 (식 1)의 비용 함수를 이용하여 계산 될 수 있다. GAN 모델은 가 [1, 0]에 가까워지도록 학습될 수 있다. 즉, 클래스 손실은 타겟 모 델에서 변환된 데이터의 클래스가 잘 분류될 수 있도록 할 수 있다. 클래스 손실은 다른 손실에 비해 단순하기 때문에 GAN의 학습이 용이해질 수 있다. 그러나, 클래스 손실이 단순한만큼 클래스 손실만으로 학습되는 경우, 소스 도메인에서의 데이터들과 타겟 도메인에서의 데이터들의 분포가 다를 수 있다. 거리 매트릭스 손실 모듈은 거리 손실 값을 획득할 수 있다. 상술한 바와 같이, GAN이 클래스 손실만으로 학습되는 경우, 소스 도메인에서의 데이터들과 타겟 도메인에서의 데이터들의 분포가 달라질 수 있으므로 전자 장치는 거리 손실을 이용하여 소스 도메인의 데이터들과 타겟 도메인의 데이터들의 분포를 유사하게 만들어 줄 수 있다. 거리 매트릭스 손실 모듈은 복수의 클래스 중 서로 다른 클래스에 포함된 소스 데이터의 특징 벡 터 간의 거리에 기초하여 거리 맵을 식별할 수 있다. 그리고, 거리 매트릭스 손실 모듈은 식별된 거리 맵 에 기초하여 소스 데이터에 대응되는 재구성된 소스 데이터의 특징 벡터 간의 거리가 유지되도록 거리 손실 값 을 획득할 수 있다. 거리 손실의 경우 원본 데이터의 특징 벡터 분포는 특징 벡터로의 아핀 변환(affine transformation)을 가능하 게 할 수 있다. 거리 손실은 소스 데이터와 타겟 데이터의 특성에 차이가 있어 특징 손실을 학습하기 어려운 경 우 특징 손실을 대체할 수 있고, 상대적으로 보장된 변환 학습을 할 수 있다. 일 실시 예로서, 거리 손실은 (식 2)를 이용하여 산출될 수 있다. --- (식 2) 여기서, dist()는 소스 모델을 통과한 특징 벡터의 거리 맵을 의미한다. GAN 모델은 타겟 도메인의 가짜 타겟 데이터( )를 생성할 수 있다. 이 때, A -> B 방향으로 생성되는 가 짜 타겟 데이터( )가 잘 생성되도록 GAN 모델은 ≒ ≒ 이 되도록 학습될 수 있다. 은 타겟 도메인의 재구성 데이터로서 로부터 획득될 수 있다. 따라서, GAN 모델은 가짜 소 스 데이터( ), 타겟 도메인의 재구성 데이터( )의 학습을 위해 A -> B 방향으로 학습 뿐만 아니라 B -> A 방향으로 학습도 수행될 수 있다( ≒ ≒ ). 클러스터 손실 모듈은 클러스터 손실 값을 획득할 수 있다. 클러스터 손실 모듈은 복수의 클래스 중 서로 다른 클래스에 포함되는 재구성된 소스 데이터의 특징 벡터의 거리가 이격되도록 기 설정된 방식에 기초하여 클러스터 손실 값을 획득할 수 있다. 예를 들어, 제1 데이터가 A 클래스로 분류되고, 제2 데이터가 B 클래스로 분류되는 경우, 클러스터 손실 모듈 은 제1 데이터와 제2 데이터 간의 거리를 충분히 이격하여 클래스가 명확히 구분되도록 클러스터 손실 값 을 획득할 수 있다. 즉, 클러스터 손실 모듈은 생성된 데이터를 이용하여 분류 모델의 성능을 향상시키기 위해서는 서로 다른 클래스에 속하는 데이터가 소스 도메인에서와 같이 타겟 도메인에서 멀리 이격시킬 수 있다. 일 실시 예로서, 클러스터 손실은 (식 3) 및 (식 4)를 이용하여 산출될 수 있다. --- (식 3) 여기서, i, j는 분류 모델의 다른 클래스를 의미한다."}
{"patent_id": "10-2022-0033031", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "--- (식 4) 여기서, Gfeat는 U-net 하단의 평면 벡터를 의미한다. 그리고, 는 A -> B 방향으로 A 데이터를 인코딩하여 획득한 특징(A 데이터의 주요 특징), 는 B -> A 방향으로 B 데이터를 인코딩하여 획득한 특징(B 데이터의 주요 특징)을 의미한다. 즉, (식 3)은 클래스 i, j 각각에 포함된 데이터들에 대해 A의 주요 특징, B의 주요 특징의 평균 값을 산출했을 때 다른 클래스와 멀 리 떨어져 있을 때 손실(loss)가 작아지도록 학습되는 것을 의미한다. CAM 손실 모듈은 CAM 손실 값을 획득할 수 있다. CAM 손실 모듈은 소스 도메인을 포함하는 인공지능 신경망 학습 모델이 소스 데이터의 클래스를 분류할 때 적용하는 소스 데이터의 가중치 영역을 식별할 수 있다. 그리고, CAM 손실 모듈은 식별된 소스 데이터에 대응되는 재구성된 소스 데이터의 가중치 영역을 설정하기 위한 CAM 손실 값을 획득할 수 있다. 타겟 모델이 소스 모델과 매우 유사하게 학습하여 성능을 높이려면 소스 모델에서 중요하게 판단된 소스 데이터의 기능을 학습해야 한다. 일 실시 예로서, 소스 모델이 사람의 낙상을 판단할 때 사람의 머리 영역의 이동을 중요하게 판단하였다면, 타겟 모델도 사람의 머리 영역의 이동에 가중치 를 부여하여 학습해야 한다. 예를 들어, 소스 모델의 중요 데이터 정보를 획득하기 위해 GradCAM이 사용될 수 있다. CAM 손실 모듈은 GradCAM을 통해 활성화된 부분을 이미지 학습 시 각 이미지에 대한 가중치로 사용될 수 있다. 즉, CAM 손실 모 듈는 소스 모델이 중요하게 생각하는 특성 부분을 보다 세부적으로 생성할 수 있다. 예를 들어, 가중치 영 역은 이미지 데이터의 특정 영역 또는 신호 데이터의 특정 주파수 영역일 수 있다. 일 실시 예로서, CAM 손실은 (식 5)를 이용하여 산출될 수 있다. --- (식 5) 여기서, cam(x)은 GradCAM이 소스 모델을 통해 얻은 데이터 x의 활성화 맵이다. 윗 첨자 i는 A일 수 있고, B일 수도 있다. 특징 손실 모듈은 특징 손실 값을 획득할 수 있다. 특징 손실 모듈은 소스 데이터의 특징 벡터와 소 스 데이터에 대응되는 재구성된 소스 데이터의 특징 벡터가 동일하도록 특징 손실 값을 획득할 수 있다. 일 실 시 예로서, 특징 손실은 (식 6)을 이용하여 산출될 수 있다. --- (식 6) 여기서, fc는 분류 계층 이전의 소스 모델의 완전 연결 계층을 의미한다. 일반적인 인공 지능 모델은 마지막 단 계에 주요 특징을 모으는 fully connected(fc) layer를 포함하고 있다. (식 6)은 fc(x) 레이어 과정을 의미하 며, 본 개시의 인공 지능 모델은 (식 6)을 통해 주요 특징 벡터를 출력할 수 있다. 도 5를 참조하면, 기존 변환 데이터와 본 개시의 각 손실을 적용하여 변환하여 생성된 데이터를 비교하는 도면 이 도시되어 있다. 기존 변환 데이터와 본 개시에 따른 변환 데이터의 차이는 미묘할 수 있으나, 미묘한 차이는 주요한 특징 부분에서 나타날 수 있다. 예를 들어, CAM 손실의 경우 소스 모델이 강조하는 부분의 손실이 더 강 하게 반영되므로 본 개시에 따른 모델은 타겟 데이터의 주요 특징 부분을 더 자세하게 생성할 수 있다. 또한, 본 개시에 따른 모델은 소스 모델의 특징들 사이의 거리를 유지하도록 특징 손실을 적용한다. 따라서, 도 5에 도시된 바와 같이, 본 개시의 변환 데이터의 많은 부분이 기존 변환 데이터와 다르게 변형되었음을 확인할 수 있다. 또한, 클래스 손실, 거리 손실의 경우에도 본 개시에 따른 변환 데이터가 기존 변환 데이터에 비해 구체 적으로 표현된 것을 확인할 수 있다. 지금까지 소스 데이터와 유사한 타겟 데이터를 생성하기 위한 다양한 손실 방법을 설명하였다. 아래에서는 타겟 도메인 생성 방법을 설명한다. 도 6은 본 개시의 일 실시 예에 따른 타겟 도메인 생성 방법을 설명하는 흐름도이다. 도 6을 참조하면, GAN 기반 타겟 도메인을 생성하는 전자 장치는 소스 도메인에 포함된 소스 데이터를 재구성할 수 있다(S610). 예를 들어, 소스 도메인은 제1 전자 장치의 인공 지능 학습 모델에서 생성된 도메인이고, 타겟 도메인은 제2 전자 장치의 인공 지능 학습 모델을 위한 도메인일 수 있다. 그리고, 제1 전자 장치 및 제2 전자 장치는 하드웨어 사양, 소프트웨어 플랫폼, 소프트웨어 버전 등이 서로 다른 장치일 수 있다. 전자 장치는 소스 데이터를 기초로 재구성된 소스 데이터를 훈련시켜 타겟 데이터를 생성할 수 있다(S620). 예 를 들어, 전자 장치는 클래스 손실에 의한 클래스 손실 값, 거리 매트릭스 손실에 의한 거리 손실 값을 식별할 수 있다. 그리고, 전자 장치는 식별된 손실 값을 재구성된 소스 데이터에 적용할 수 있다. 또한, 전자 장치는 클러스터 손실에 의한 클러스터 손실 값, CAM 손실에 의한 CAM 손실 값, 특징 손실에 의한 특징 손실 값 등을 추가적으로 식별하고, 식별된 적어도 한 종류의 손실 값을 재구성된 소스 데이터에 추가적으로 적용할 수 있다. 일 실시 예로서, 전자 장치는 복수의 클래스 중 소스 데이터가 포함된 클래스를 기초로 소스 데이터에 대응되는 재구성된 소스 데이트에 대한 클래스 분류의 일치 여부를 판단할 수 있다. 전자 장치는 재구성된 소스 데이터에 대한 클래스의 분류가 일치하는 경우 기 설정된 방식에 따라 제1 클래스 손실 값을 식별하고, 재구성된 소스 데 이터에 대한 클래스의 분류가 불일치하는 경우 기 설정된 방식에 따라 제2 클래스 손실 값을 식별하여 클래스 손실 값을 획득할 수 있다. 제2 클래스 손실 값은 제1 클래스 손실 값보다 큰 값일 수 있다. 그리고, 전자 장치는 복수의 클래스 중 서로 다른 클래스에 포함된 소스 데이터의 특징 벡터 간의 거리에 기초 하여 거리 맵을 식별할 수 있다. 그리고, 전자 장치는 식별된 거리 맵에 기초하여 소스 데이터에 대응되는 재구 성된 소스 데이터의 특징 벡터 간의 거리가 유지되도록 거리 손실 값을 획득할 수 있다. 또한, 전자 장치는 복수의 클래스 중 서로 다른 클래스에 포함되는 재구성된 소스 데이터의 특징 벡터의 거리가 이격되도록 기 설정된 방식에 기초하여 클러스터 손실 값을 획득할 수 있다. 또한, 전자 장치는 소스 도메인을 포함하는 인공지능 신경망 학습 모델이 소스 데이터의 클래스를 분류할 때 적 용하는 소스 데이터의 가중치 영역을 식별할 수 있다. 그리고, 전자 장치는 식별된 소스 데이터에 대응되는 재 구성된 소스 데이터의 가중치 영역을 설정하기 위한 CAM 손실 값을 획득할 수 있다. 예를 들어, 가중치 영역은 이미지 데이터의 특정 영역, 신호 데이터의 특정 주파수 영역 등을 포함할 수 있다. 또는, 전자 장치는 소스 데이터의 특징 벡터와 소스 데이터에 대응되는 재구성된 소스 데이터의 특징 벡터가 동 일하도록 특징 손실 값을 획득할 수 있다. 전자 장치는 생성된 타겟 데이터를 포함하는 타겟 도메인을 생성할 수 있다(S630). 상술한 과정을 통해 전자 장 치는 소스 도메인의 소스 데이터를 이용하여 학습 성능이 유지되는 타겟 도메인을 생성할 수 있다. 상술한 다양한 실시 예에 따른 타겟 도메인 생성 방법은 컴퓨터 프로그램 제품으로 제공될 수도 있다. 컴퓨터 프로그램 제품은 S/W 프로그램 자체 또는 S/W 프로그램이 저장된 비일시적 판독 가능 매체(non-transitory computer readable medium)를 포함할 수 있다. 비일시적 판독 가능 매체란 레지스터, 캐쉬, 메모리 등과 같이 짧은 순간 동안 데이터를 저장하는 매체가 아니 라 반영구적으로 데이터를 저장하며, 기기에 의해 판독(reading)이 가능한 매체를 의미한다. 구체적으로는, 상 술한 다양한 어플리케이션 또는 프로그램들은 CD, DVD, 하드 디스크, 블루레이 디스크, USB, 메모리카드, ROM 등과 같은 비일시적 판독 가능 매체에 저장되어 제공될 수 있다. 또한, 이상에서는 본 개시의 바람직한 실시 예에 대하여 도시하고 설명하였지만, 본 개시는 상술한 특정의 실시"}
{"patent_id": "10-2022-0033031", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "예에 한정되지 아니하며, 청구범위에서 청구하는 본 개시의 요지를 벗어남이 없이 당해 개시가 속하는 기술분야 에서 통상의 지식을 가진 자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 개시의 기술적 사상이나 전망으로부터 개별적으로 이해되어서는 안될 것이다."}
{"patent_id": "10-2022-0033031", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시 예에 따른 전자 장치의 구성을 설명하는 블록도이다. 도 2는 본 개시의 일 실시 예에 따른 전자 장치의 구체적인 구성을 설명하는 블록도이다. 도 3은 GAN의 일 실시 예를 설명하는 도면이다. 도 4는 본 개시의 일 실시 예에 따른 손실 모듈을 설명하는 도면이다. 도 5는 본 개시의 일 실시 예에 따른 기존 모델과 본 개시의 손실을 적용한 모델 간의 차이를 나타내는 도면이 다. 도 6은 본 개시의 일 실시 예에 따른 타겟 도메인 생성 방법을 설명하는 흐름도이다."}
