{"patent_id": "10-2019-0028636", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0109508", "출원번호": "10-2019-0028636", "발명의 명칭": "센서 모듈 및 이의 자동 보정 방법", "출원인": "주식회사 이너센서", "발명자": "강문식"}}
{"patent_id": "10-2019-0028636", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "기판;상기 기판 상에 구비되고, 상기 기판의 주위 환경에 관한 파라미터를 측정하여 측정값을 생성하는 측정 센서;상기 기판의 상에 상기 측정 센서와 인접하게 구비되고, 상기 측정 센서보다 낮은 드리프트 오차를 갖고, 특정시점에 상기 파라미터를 측정하여 기준값을 생성하는 기준 센서; 및상기 기준 센서에 대한 신뢰성 특성에 관하여 기설정된 신뢰성 함수를 이용하여 상기 기준 센서의 기준값을 주기적으로 보정하고, 상기 보정된 기준값을 상기 측정 센서의 측정값과 비교하여 상기 파라미터들을 보정할 수있도록 구비된 보정 제어부를 포함하는 센서 모듈."}
{"patent_id": "10-2019-0028636", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 기준 센서는 상기 측정 센서 대비 3% 이하의 낮은 드리프트 오차를 갖는 것을 특징으로하는 센서 모듈."}
{"patent_id": "10-2019-0028636", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 기준 센서는 상기 측정 센서보다 낮은 민감도를 갖는 것 특징으로 하는 센서 모듈."}
{"patent_id": "10-2019-0028636", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 보정 제어부는 상기 신뢰성 함수를 이용하여 주기적으로 보정하기 위하여 상기 기준 센서를 영점 보정하도록 구비된 것을 특징으로 하는 센서 모듈."}
{"patent_id": "10-2019-0028636", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 영점 보정은 인공지능(A.I.) 소프트웨어 또는 일반 함수가 적용된 소프트웨어를 이용하는것을 특징으로 하는 센서 모듈."}
{"patent_id": "10-2019-0028636", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 기준 센서에 포함된 전극들을 상호 절연시키는 절연 물질은 실리콘 물질을 포함하고, 상기 측정 센서에 포함된 전극들을 상호 절연시키는 절연 물질은 고분자 물질을 포함하는 것을 특징으로 하는 센서 모듈."}
{"patent_id": "10-2019-0028636", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 상기 기준 센서에 포함된 전극들 사이의 거리는, 상기 측정 센서에 포함된 전극들 사이보다 큰것을 특징으로 하는 센서 모듈."}
{"patent_id": "10-2019-0028636", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 기준 센서에 포함된 전극들을 상호 절연시키는 절연 물질은 실리콘 물질을 포함하고, 상기 측정 센서에 포함된 전극들을 상호 절연시키는 절연 물질은 고분자 물질을 포함하고,상기 기준 센서에 포함된 전극들 사이의 거리는, 상기 측정 센서에 포함된 전극들 사이보다 큰 것을 특징으로하는 센서 모듈."}
{"patent_id": "10-2019-0028636", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "주위 환경에 관한 파라미터를 측정 센서를 이용하여 측정값을 생성하는 단계;상기 측정 센서보다 낮은 드리프트 오차를 갖는 기준 센서를 이용하여, 특정 시점에 상기 파라미터를 측정하여공개특허 10-2020-0109508-3-기준값을 제공하는 단계;상기 기준 센서에 대한 신뢰성 특성에 관한 함수를 이용하여 상기 기준 센서의 기준값을 주기적으로 보정하는단계; 및상기 보정된 기준값을 상기 측정값과 비교하여 상기 측정 센서의 파라미터들을 보정하는 단계를 포함하는 센서모듈의 자동 보정 방법."}
{"patent_id": "10-2019-0028636", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 함수를 이용하여 상기 기준 센서를 보정하는 단계는 주기적인 영점 보정을 수행하는 단계를 포함하는 것을 특징으로 하는 센서 모듈의 자동 보정 방법."}
{"patent_id": "10-2019-0028636", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서, 상기 영점 보정은 인공지능(A.I.) 소프트웨어 또는 일반 함수가 적용된 소프트웨어를 이용하는 것을 특징으로 하는 센서 모듈의 자동 보정 방법."}
{"patent_id": "10-2019-0028636", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "센서 모듈은, 기판, 상기 기판 상에 구비되고, 상기 기판의 주위 환경에 관한 파라미터를 측정하여 측정값을 생 성하는 측정 센서, 상기 기판의 상에 상기 측정 센서와 인접하게 구비되고, 상기 측정 센서보다 낮은 드리프트 오차를 갖고, 특정 시점에 상기 파라미터를 측정하여 기준값을 생성하는 기준 센서 및 상기 기준 센서에 대한 신 뢰성 특성에 관하여 기설정된 신뢰성 함수를 이용하여 상기 기준 센서의 기준값을 주기적으로 보정하고, 상기 보 정된 기준값을 상기 측정 센서의 측정값과 비교하여 상기 파라미터들을 보정할 수 있도록 구비된 보정 제어부를 포함한다. 이로써, 우수한 민감도 및 신뢰도가 동시에 확보될 수 있다."}
{"patent_id": "10-2019-0028636", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 실시예들은 센서 모듈 및 이의 보정 방법에 관한 것이다. 보다 상세하게는, 장시간 사용에 따라 발생 하는 오차를 자동 보정할 수 있는 센서 모듈 및 이의 자진 보정 방법에 관한 것이다."}
{"patent_id": "10-2019-0028636", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "반도체 센서 모듈은 생산효율을 높이기 위하여 공장 자동화, 식물 농장 등 자동화 시스템에 응용되고 있다. 상 기 반도체 센서 모듈의 예로서 습도 센서 모듈은 일반 산업용 공정 제어, 식물 농장, 공장 자동화, 가전제품 등 많은 활용성을 갖고 있는 센서에 해당한다. 상기 습도 센서 모듈은 온도 및 습도를 읽을 수 있는 복합 센서 형태로 제작되고 있다. 하지만 이러한 습도 센 서 모듈은 장시간 사용되거나 가혹한 조건에서 사용될 경우, 상기 습도 센서 모듈에 정밀도 오차가 발생하게 된 다. 상기 오차의 발생 원인에 있어서, 센서 모듈의 제작에 사용된 물질이 장시간 사용되거나 가혹한 사용 환경(ga s)에 따른 노출됨에 따라 상기 물질에 변성이 발생한다. 이에 따라 상기 센서 모듈에 정밀도 드리프트(drift)가 발생할 수 있다. 이러한 정밀도 드리프트에 의한 센서 모듈의 오차는 생산자동화 시스템에서 양질의 제품생산에 저해되는 요소로 작용한다. 상기 정밀도 드리프트에 의한 발생한 센서 모듈의 오차는 기존에 센서를 적용한 자동화 시스템의 경우 생산성 저하나, 생산 수율 저하와 같은 문제를 초래한다. 이러한 문제가 발생했을 경우, 자동화 시스템을 점검하고 센 서 모듈을 교체하는 사후 처리 방법 또는 주기적인 시스템 교체를 위한 점검을 실시하는 주기적인 점검 방법이 일반적으로 수행되고 있다. 상기 사후 처리 방법 또는 주기적인 점검 방법 모두에 있어서, 상기 자동화 시스템 이 정지된 후 작업자가 센서 모듈을 교체하여야 함으로써, 생산성 효율의 저하를 야기한다. 따라서, 상기 센서 모듈이 자동적으로 센싱값을 보정할 수 있는 기능이 요구된다."}
{"patent_id": "10-2019-0028636", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 실시예들은 자동적으로 센싱값을 보정할 수 있는 센서 모듈을 제공하는 것이다. 본 발명의 실시예들은 자동적으로 센싱값을 보정할 수 있는 센서 모듈의 자동 보정 방법을 제공하는 것이다."}
{"patent_id": "10-2019-0028636", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위한 본 발명의 일 실시예들에 따른 센서 모듈은, 기판, 상기 기판 상에 구비되고, 상기 기판의 주위 환경에 관한 파라미터를 측정하여 측정값을 생성하는 측정 센서, 상기 기판의 상에 상기 측정 센서와 인접하게 구비되고, 상기 측정 센서보다 낮은 드리프트 오차를 갖고, 특정 시점에 상기 파라미터를 측정하여 기준값을 생성하는 기준 센서 및 상기 기준 센서에 대한 신뢰성 특성에 관하여 기설정된 신뢰성 함수를 이용하 여 상기 기준 센서의 기준값을 주기적으로 보정하고, 상기 보정된 기준값을 상기 측정 센서의 측정값과 비교하 여 상기 파라미터들을 보정할 수 있도록 구비된 보정 제어부를 포함한다. 본 발명의 일 실시예에 있어서, 상기 기준 센서는 상기 측정 센서 대비 3% 이하의 낮은 드리프트 오차를 가질 수 있다. 본 발명의 일 실시예에 있어서, 상기 기준 센서는 상기 측정 센서보다 낮은 민감도를 가질 수 있다. 본 발명의 일 실시예에 있어서, 상기 보정 제어부는 상기 신뢰성 함수를 이용하여 주기적으로 보정하기 위하여 상기 기준 센서를 영점 보정하도록 구비될 수 있다. 여기서, 상기 영점 보정은 인공지능(A.I.) 소프트웨어 또는 일반 함수가 적용된 소프트웨어를 이용할 수 있다. 본 발명으 일 실시예에 있어서, 상기 기준 센서에 포함된 전극들을 상호 절연시키는 절연 물질은 실리콘 물질을 포함하고, 상기 측정 센서에 포함된 전극들을 상호 절연시키는 절연 물질은 고분자 물질을 포함할 수 있다. 본 발명으 일 실시예에 있어서, 상기 기준 센서에 포함된 전극들 사이의 거리는, 상기 측정 센서에 포함된 전극 들 사이보다 클 수 있다. 본 발명으 일 실시예에 있어서, 상기 기준 센서에 포함된 전극들을 상호 절연시키는 절연 물질은 실리콘 물질을 포함하고, 상기 측정 센서에 포함된 전극들을 상호 절연시키는 절연 물질은 고분자 물질을 포함하고, 상기 기준 센서에 포함된 전극들 사이의 거리는, 상기 측정 센서에 포함된 전극들 사이보다 클 수 있다. 상기 목적을 달성하기 위한 본 발명의 일 실시예들에 따른 센서 모듈의 자동 보정 방법에 따르면, 주위 환경에 관한 파라미터를 측정 센서를 이용하여 측정값을 생성하고, 상기 측정 센서보다 낮은 드리프트 오차를 갖는 기 준 센서를 이용하여, 특정 시점에 상기 파라미터를 측정하여 기준값을 제공한다. 이후, 상기 기준 센서에 대한 신뢰성 특성에 관한 함수를 이용하여 상기 기준 센서의 기준값을 주기적으로 보정하는 한 후, 상기 보정된 기준 값을 상기 측정값과 비교하여 상기 측정 센서의 파라미터들을 보정한다. 본 발명의 일 실시예에 있어서, 상기 함수를 이용하여 상기 기준 센서를 보정하기 위하여, 주기적인 영점 보정 을 수행할 수 있다. 여기서, 상기 영점 보정은 인공지능(A.I.) 소프트웨어 또는 일반 함수가 적용된 소프트웨어를 이용하는 수행될 수 있다."}
{"patent_id": "10-2019-0028636", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 센서 모듈 및 자동 보정 방법에 따르면, 보정 제어부가 기준 센서로부터 도출된 보 정된 기준값 및 측정 센서의 실제 측정값을 비교함으로써, 상기 측정값을 자동으로 보정할 수 있다. 이로써, 기 준 센서 및 측정 센서를 포함하는 센서 모듈이 자동적으로 보정됨에 따라 우수한 민감도 및 신뢰도를 동시에 확 보할 수 있다."}
{"patent_id": "10-2019-0028636", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 실시예들은 첨부 도면들을 참조하여 상세하게 설명된다. 그러나, 본 발명은 하기에서 설명되는 실시예들에 한정된 바와 같이 구성되어야만 하는 것은 아니며 이와 다른 여러 가지 형태로 구체화될 수 있을 것 이다. 하기의 실시예들은 본 발명이 온전히 완성될 수 있도록 하기 위하여 제공된다기보다는 본 발명의 기술 분야에서 숙련된 당업자들에게 본 발명의 범위를 충분히 전달하기 위하여 제공된다. 본 발명의 실시예들에서 하나의 요소가 다른 하나의 요소 상에 배치되는 또는 연결되는 것으로 설명되는 경우 상기 요소는 상기 다른 하나의 요소 상에 직접 배치되거나 연결될 수도 있으며, 다른 요소들이 이들 사이에 개 재될 수도 있다. 이와 다르게, 하나의 요소가 다른 하나의 요소 상에 직접 배치되거나 연결되는 것으로 설명되 는 경우 그들 사이에는 또 다른 요소가 있을 수 없다. 다양한 요소들, 조성들, 영역들, 층들 및/또는 부분들과 같은 다양한 항목들을 설명하기 위하여 제1, 제2, 제3 등의 용어들이 사용될 수 있으나, 상기 항목들은 이들 용 어들에 의하여 한정되지는 않을 것이다. 본 발명의 실시예들에서 사용된 전문 용어는 단지 특정 실시예들을 설명하기 위한 목적으로 사용되는 것이며, 본 발명을 한정하기 위한 것은 아니다. 또한, 달리 한정되지 않는 이상, 기술 및 과학 용어들을 포함하는 모든 용어들은 본 발명의 기술 분야에서 통상적인 지식을 갖는 당업자에게 이해될 수 있는 동일한 의미를 갖는다. 통 상적인 사전들에서 한정되는 것들과 같은 상기 용어들은 관련 기술과 본 발명의 설명의 문맥에서 그들의 의미와 일치하는 의미를 갖는 것으로 해석될 것이며, 명확히 한정되지 않는 한 이상적으로 또는 과도하게 외형적인 직 감으로 해석되지는 않을 것이다. 본 발명의 실시예들은 본 발명의 이상적인 실시예들의 개략적인 도해들을 참조하여 설명된다. 이에 따라, 상기 도해들의 형상들로부터의 변화들, 예를 들면, 제조 방법들 및/또는 허용 오차들의 변화는 충분히 예상될 수 있 는 것들이다. 따라서, 본 발명의 실시예들은 도해로서 설명된 영역들의 특정 형상들에 한정된 바대로 설명되어 지는 것은 아니라 형상들에서의 편차를 포함하는 것이며, 도면들에 설명된 요소들은 전적으로 개략적인 것이며 이들의 형상은 요소들의 정확한 형상을 설명하기 위한 것이 아니며 또한 본 발명의 범위를 한정하고자 하는 것 도 아니다. 도 1은 본 발명의 일 실시예에 따른 센서 모듈을 설명하기 위한 단면도이다. 도 2는 본 발명의 일 실시예에 따 른 센서 모듈을 설명하기 위한 블록도이다. 도 3은 도 1의 기준 센서를 설명하기 위한 단면도이다. 도 4는 도 1 의 측정 센서를 설명하기 위한 단면도이다. 도 1 내지 도 4를 참조하면, 본 발명의 일 실시예에 따른 센서 모듈은 기판, 측정 센서, 기준 센서 및 보정 제어부를 포함한다. 상기 센서 모듈을 기판의 주위 환경, 예를 들면, 온도 또는 습도 를 측정할 수 있다. 또한 상기 센서 모듈은 자동 보정 기능을 가짐에 따라 장시간 사용 또는 가혹한 환경에서 사용에 따른 오차를 자동적으로 보정할 수 있다. 상기 기판은 복수의 센서들이 장착될 수 있는 공간을 제공한다. 상기 기판은 예를 들면, 실리콘 기판 을 포함할 수 있다. 상기 기판에는 여러 회로 소자들이 구비됨에 따라 상기 센서들을 제어할 수 있다. 상기 측정 센서는 기판의 일측 상에 구비된다. 상기 측정 센서는 기판 주위의 환경에 관한 파라미터를 측정하여 측정값을 생성할 수 있다. 즉, 상기 측정 센서는 온도 센서 또는 습도 센서를 포함할 수 있다. 상기 측정 센서가 온도 센서일 경우, 온도에 따라 제1 전극들(133, 135) 사이에 흐르는 전류값 또는 전압값의 변화를 이용하여 온도를 측정할 수 있다. 이와 다르게, 상기 측정 센서가 습도 센서일 경우, 상기 습도에 따라 상기 제1 전극들(133, 135) 사이에 흐르는 전류값 또는 전압값의 변화를 이용하여 습 도를 측정할 수 있다. 도 3을 참조하면, 상기 측정 센서는 상호 이격된 한 쌍의 제2 전극들(153, 155)을 포함한다. 또한 상기 제 2 전극들(153, 155) 사이에는 절연 물질이 제공됨에 따라 상기 제2 전극들(153. 155)을 전기적으로 절연시 킬 수 있다. 상기 절연 물질의 예로는 고분자 물질을 들 수 있다. 이 경우, 상기 고분자 물질이 상기 절연 물질로 이용될 경우, 상기 고분자 물질이 습도와 같은 외부 물질과 민감하게 반응함으로써 우수한 감도를 확보할 수 있다. 하지만, 상기 절연 물질의 예에 해당한 상기 고분자 물질의 경우, 상기 측정 센서가 장시간 사용되거나 가 혹한 환경에서 사용될 때 상기 측정 센서에 포함된 절연 물질 내에 존재할 수 있는 이온성 물질이 상 기 제1 전극들(133. 135) 간의 절연성을 파괴할 수 있다. 또한, 상기 절연 물질의 예에 해당한 상기 고분 자 물질은 무기물과 비교할 때, 전압에 대한 상대적으로 빠른 노화 속도, 높은 표면 누설 전류를 가진다. 나아 가, 상기 고분자 물질의 경우, 분자들 간에 결합의 결함에 의한 발생할 수 있는 결함 누설 전류가 상대적으로 높다. 따라서, 상기 측정 센서는 상대적으로 낮은 신뢰성을 가지는 문제가 있다. 상술한 신뢰성을 개선하 기 위하여 기준 센서가 이용된다. 다시 도 1 및 도 4를 참조하면, 상기 기준 센서는 상기 기판 상에 상기 측정 센서와 인접하게 배치된다. 상기 기준 센서는 상기 측정 센서보다 낮은 드리프트 오차를 가진다. 따라서, 상기 기준 센서는 우수한 신뢰도를 확보할 수 있다. 상기 기준 센서가 우수한 신뢰도를 확보하기 위한 기술적인 내용에 관하여는 후술하기로 한다. 상기 기준 센서가 상대적으로 낮은 드리프트 오차를 가짐에 따라, 특정 시점에 상기 파라미터를 측정하여 기준값을 제공한다. 상기 기준값을 도출하기 위하여 보정 제어부가 이용될 수 있다. 다시 도 1 및 도 2를 참조하면, 상기 보정 제어부는 기판 상에 구비된다. 상기 보정 제어부는 상기 측정 센서 및 기준 센서에 인접하게 배치될 수 있다. 상기 보정 제어부는 상기 기준 센서에 대한 신뢰성 특성에 관련된 함수를 보유하고 있다. 즉, 상기 기준 센서는 상대적으로 우수한 신뢰도를 가짐에 따라, 상기 기준 센서에 대한 신뢰도 함수는 사용 시간이나 사용 환경에 따라 큰 차이없이 적용될 수 있다. 예를 들면, 기준 센서에 대한 함수는 기준 센서 의 사용 시간에 따라 일정하게 적용될 수 있다. 따라서, 기준 센서의 드리프트 오차는 상기 신뢰도 함수에 기초하여 사용 시간에 따라 충분히 예측될 수 있다. 상기 보정 제어부는 상기 신뢰성 함수를 이용하여 상기 기준 센서를 주기적으로 보정할 수 있다. 따 라서, 상기 보정 제어부는 상기 기준 센서의 기준값을 주기적으로 보정할 수 있다. 따라서, 상기 기 준 센서의 보정된 기준값이 보다 정확하게 생성될 수 있다. 반면에, 상기 측정 센서는 우수한 민감도를 가지나 상대적으로 낮은 신뢰도를 가짐에 따라 측정 센서(13 0)에 대한 사용 시간에 따른 드리프트 오차에 영향을 미추는 변수가 다양하게 존재할 수 있다. 예를 들면, 상 기 측정 센서는 높은 습도 환경에서 장시간 사용될 경우 사용시간에 따른 드리프트 오차를 예측하는 데 어 려움이 있다. 한편, 상기 보정 제어부는 상기 보정된 기준값을 상기 측정값과 비교하여 상기 측정 센서의 파라미터 들을 보정할 수 있다. 보다 상세하게 설명하면, 상기 측정 센서는 상기 기준 센서에 비교할 때 우수 한 민감도를 가지는 반면에 상대적으로 낮은 신뢰도를 가진다. 따라서, 상기 측정 센서가 장시간 사용되거 나 가혹한 환경에서 사용될 경우, 상기 측정 센서는 상대적으로 큰 드리프트 오차를 가진다. 따라서, 상기 측정 센서에 대한 신뢰성 특성에 관한 함수가 상기 측정 센서에 직접 이용되는 데에는 어려움이 있다. 따라서, 상기 보정 제어부가 상기 보정된 기준값 및 상기 측정 센서의 실제 측정값을 비교함으로써, 상기 측정값을 자동으로 보정할 수 있다. 이로써, 기준 센서 및 측정 센서를 포함하는 센서 모듈이 우수한 민감도 및 신뢰도를 동시에 확보할 수 있다. 본 발명의 일 실시예에 있어서, 상기 기준 센서는 상기 측정 센서 대비 3% 이하의 낮은 드리프트 오 차를 가질 수 있다. 예를 들면, 상기 측정 센서가 고분자 물질의 절연 물질로 전극들을 상호 절연시키는 반면에, 상기 기준 센서가 무기물의 절연 물질로 전극들을 상호 절연시킬 경우, 상기 기준 센서는 상 기 측정 센서 대비 3% 이하의 낮은 드리프트 오차를 가질 수 있다. 이 경우, 상기 기준 센서는 상기 측정 센서보다 낮은 민감도를 가진다. 본 발명의 일 실시예에 있어서, 상기 보정 제어부는 상기 신뢰성 함수를 이용하여 주기적으로 상기 기준 센서를 영점 보정할 수 있다. 이로서, 상기 기준 센서는 보정된 기준값을 가질 수 있다. 상기 기준 센서를 영점 보정하는 방법은 특정 온도 또는 습도에서 상기 측정값을 상기 특정 온도 또는 습도에 대응되 도록 보정할 수 있다. 상기 영점 보정을 위하여, 인공 지능 소프트웨어 또는 일반 함수가 적용된 소프트웨어가 이용될 수 있다. 도 3 및 도 4를 참조하면, 상기 기준 센서에 포함된 제2 전극들(153, 155) 사이의 거리(d5)는, 상기 측정 센서에 포함된 제1 전극들(133. 135) 사이의 거리(d3)보다 클 수 있다. 이로써, 상기 기준 센서는 그 민감도가 저하될 수 있나, 상기 제2 전극들(153, 155) 사이의 절연성이 확보됨에 따라 우수한 신뢰성을 확보할 수 있다. 상기 제2 전극들(153, 155) 사이에 전압이 인가될 경우, 상기 전극들(153, 155) 사이의 거리가 증가함 에 따라 단위 길이당 전압의 크기가 감소한다. 이로서, 상기 제2 전극들(153, 155) 사이에 존재하는 절연 물질 의 분극 현상이 감소할 수 있다. 결과적으로 상기 절연 물질의 노화가 억제됨으로써 상기 기준 센서 는 우수한 신뢰도를 확보할 수 있다. 도 5는 본 발명의 일 실시예에 따른 센서 모듈의 자동 보정 방법을 설명하기 위한 순서도이다. 도 5를 참조하면, 본 발명의 일 실시예에 따른 센서 모듈의 자동 보정 방법에 따르면, 주위 환경에 관한 파라미 터를 측정 센서를 이용하여 측정값을 생성한다(S110). 이후, 상기 측정 센서보다 낮은 드리프트 오차를 갖는 기 준 센서를 이용하여, 특정 시점에 상기 파라미터를 측정하여 기준값을 제공한다(S130). 이어서, 상기 기준 센서에 대한 신뢰성 특성에 관한 함수를 이용하여 상기 기준 센서의 기준값을 주기적으로 보 정한다(S150). 이때, 상기 기준 센서는 사용 조건과 무관한게 사용 시간에 따른 신뢰성 함수를 이용하여 보다 정확하게 보정된 기준값을 생성할 수 있다. 상기 보정된 기준값을 상기 측정값과 비교하여 상기 측정 센서의 파라미터들을 보정한다(S170). 이로써, 상기 센서 모듈의 자동 보정 방법을 통하여 민감도 및 신뢰도를 동시에 확보할 수 있다. 상기에서는 본 발명의 바람직한 실시예를 참조하여 설명하였지만, 해당 기술 분야의 숙련된 당업자는 하기의 청 구범위에 기재된 본 발명의 사상 및 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수정 및 변경 시킬 수 있음을 이해할 수 있을 것이다."}
{"patent_id": "10-2019-0028636", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 센서 모듈을 설명하기 위한 단면도이다. 도 2는 본 발명의 일 실시예에 따른 센서 모듈을 설명하기 위한 블록도이다. 도 3은 도 1의 기준 센서를 설명하기 위한 단면도이다. 도 4는 도 1의 측정 센서를 설명하기 위한 단면도이다. 도 5는 본 발명의 일 실시예에 따른 센서 모듈의 자동 보정 방법을 설명하기 위한 순서도이다."}
