{"patent_id": "10-2023-7011499", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0142440", "출원번호": "10-2023-7011499", "발명의 명칭": "네트워크들에서 지능형 반사 표면들", "출원인": "지오 플랫폼즈 리미티드", "발명자": "자마다그니, 사티시 난준다 스와미"}}
{"patent_id": "10-2023-7011499", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "통신 네트워크에서 IRS(Intelligent Reflecting Surface)의 IRS 자원들을 공유하기 위한 네트워크 디바이스로서,한 세트의 명령들을 저장하는 메모리에 결합된 하나 이상의 프로세서들을 포함하며,상기 한 세트의 명령들은 상기 하나 이상의 프로세서들에 의해 실행될 때, 상기 네트워크 디바이스로 하여금:IRS 관리자로부터 스케줄링 데이터 요청(scheduling data request)을 수신하게 하고 ― 상기 IRS 관리자는 복수의 UE(User Equipment)들 각각에 대응하는 상기 네트워크 디바이스로부터 수신된 측정 보고에 적어도 부분적으로 기초하여 상기 복수의 UE들에 의한 불량한 신호 수신의 결정 시에 상기 스케줄링 데이터 요청을 송신함 ―;수신된 스케줄링 데이터 요청에 대한 응답으로, 상기 IRS 관리자에 스케줄링 데이터 응답을 송신하게 하고;상기 IRS 관리자로부터 IRS 자원 커맨드(command)를 수신하게 하고 ― 상기 IRS 관리자는 상기 스케줄링 데이터응답에 대한 응답으로 상기 IRS 자원 커맨드를 송신함 ―; 그리고수신된 IRS 자원 커맨드를 상기 IRS와 연관된 IRS 제어기에 송신하게 하며,상기 IRS 제어기는 상기 IRS 자원 커맨드에 기초하여 상기 복수의 UE들 각각에 상기 IRS 자원들을 할당하도록구성되는, IRS의 IRS 자원들을 공유하기 위한 네트워크 디바이스."}
{"patent_id": "10-2023-7011499", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 IRS 관리자는 상기 IRS의 커버리지 내의 복수의 UE들의 존재의 결정 시에 상기 스케줄링 데이터 요청을 송신하는, IRS의 IRS 자원들을 공유하기 위한 네트워크 디바이스."}
{"patent_id": "10-2023-7011499", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항에 있어서,상기 측정 보고는 서빙 셀(serving cell)의 CQI(Channel Quality Indicator) 및 CSI(Channel StateInformation) 파라미터(parameter), 및 상기 복수의 UE들 각각에 의해 상기 IRS로부터 수신된 파일럿(pilot)신호의 RSRP(Reference Signal Received Power) 정보 및 RSRQ(Reference Signal Received Quality) 파라미터를포함하는, IRS의 IRS 자원들을 공유하기 위한 네트워크 디바이스."}
{"patent_id": "10-2023-7011499", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1 항에 있어서,상기 프로세서는 CCIM(Common Communications Interface Module) 인터페이스를 통해 상기 IRS 관리자와 통신하도록 구성되는, IRS의 IRS 자원들을 공유하기 위한 네트워크 디바이스."}
{"patent_id": "10-2023-7011499", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1 항에 있어서,상기 프로세서는 DUI 인터페이스를 통해 상기 IRS 제어기와 통신하도록 구성되는, IRS의 IRS 자원들을 공유하기위한 네트워크 디바이스."}
{"patent_id": "10-2023-7011499", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1 항에 있어서,상기 스케줄링 데이터 요청은 서빙 셀들의 셀 ID들의 리스트, 복수의 UE들의 리스트, 및 TTI(transmission time공개특허 10-2023-0142440-3-interval)들의 수를 포함하는, IRS의 IRS 자원들을 공유하기 위한 네트워크 디바이스."}
{"patent_id": "10-2023-7011499", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1 항에 있어서,상기 스케줄링 데이터 응답은 스케줄링될 데이터의 양, 스케줄링될 데이터에 대한 밸런스(balance) PDB(PacketDelay Budget), 할당된 MCS(Modulation and Coding Scheme) 및 수신 CSI(Channel State Information)를 포함하는, IRS의 IRS 자원들을 공유하기 위한 네트워크 디바이스."}
{"patent_id": "10-2023-7011499", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1 항에 있어서,상기 IRS 자원 커맨드는 셀 ID들의 리스트, 상기 복수의 UE들로부터의 UE들의 리스트, 각각의 셀에 할당된 IRS자원들의 리스트 및 IRS 자원들의 할당에 대한 대응하는 유효 시간을 포함하는, IRS의 IRS 자원들을 공유하기위한 네트워크 디바이스."}
{"patent_id": "10-2023-7011499", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1 항에 있어서,상기 IRS 관리자는 수신된 스케줄링 데이터 응답에 기초하여, 서빙되는 각각의 셀에 대한 IRS 자원들의 결정된몫을 도출하도록 구성되는, IRS의 IRS 자원들을 공유하기 위한 네트워크 디바이스."}
{"patent_id": "10-2023-7011499", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1 항에 있어서,상기 프로세서는 상기 IRS의 커버리지 하에 있는 상기 복수의 UE들에 대해 할당된 IRS 자원들을 사용하기 시작하도록 MAC 스케줄러를 구성하는, IRS의 IRS 자원들을 공유하기 위한 네트워크 디바이스."}
{"patent_id": "10-2023-7011499", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "통신 네트워크에서 IRS(Intelligent Reflecting Surface)의 IRS 자원들을 공유하기 위한 방법으로서,네트워크 디바이스에 의해 IRS 관리자로부터 스케줄링 데이터 요청을 수신하는 단계 ― 상기 IRS 관리자는 복수의 UE(User Equipment)들 각각에 대응하는 상기 네트워크 디바이스로부터 수신된 측정 보고에 적어도 부분적으로 기초하여 상기 복수의 UE들에 의한 불량한 신호 수신의 결정 시에 상기 스케줄링 데이터 요청을 송신함 ―;상기 네트워크 디바이스에 의해, 수신된 스케줄링 데이터 요청에 대한 응답으로, 상기 IRS 관리자에 스케줄링데이터 응답을 송신하는 단계;상기 네트워크 디바이스에 의해, 상기 IRS 관리자로부터 IRS 자원 커맨드를 수신하는 단계 ― 상기 IRS 관리자는 상기 스케줄링 데이터 응답에 대한 응답으로 상기 IRS 자원 커맨드를 송신함 ―; 및상기 네트워크 디바이스에 의해, 수신된 IRS 자원 커맨드를 상기 IRS와 연관된 IRS 제어기에 송신하는 단계를포함하며,상기 IRS 제어기는 상기 IRS 자원 커맨드에 기초하여 상기 복수의 UE들 각각에 상기 IRS 자원들을 할당하도록구성되는, IRS의 IRS 자원들을 공유하기 위한 방법."}
{"patent_id": "10-2023-7011499", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11 항에 있어서,상기 측정 보고는 서빙 셀의 CQI(Channel Quality Indicator) 및 CSI(Channel State Information) 파라미터,및 상기 복수의 UE들 각각에 의해 상기 IRS로부터 수신된 파일럿 신호의 RSRP(Reference Signal ReceivedPower) 정보 및 RSRQ(Reference Signal Received Quality) 파라미터를 포함하는, IRS의 IRS 자원들을 공유하기위한 방법."}
{"patent_id": "10-2023-7011499", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "공개특허 10-2023-0142440-4-제11 항에 있어서,상기 네트워크 디바이스는 CCIM(Common Communications Interface Module) 인터페이스를 통해 상기 IRS 관리자와 통신하도록 구성되는, IRS의 IRS 자원들을 공유하기 위한 방법."}
{"patent_id": "10-2023-7011499", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11 항에 있어서,상기 네트워크 디바이스는 DUI 인터페이스를 통해 상기 IRS 제어기와 통신하도록 구성되는, IRS의 IRS 자원들을공유하기 위한 방법."}
{"patent_id": "10-2023-7011499", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11 항에 있어서,상기 스케줄링 데이터 요청은 서빙 셀들의 셀 ID들의 리스트, 복수의 UE들의 리스트, 및 TTI(transmission timeinterval)들의 수를 포함하는, IRS의 IRS 자원들을 공유하기 위한 방법."}
{"patent_id": "10-2023-7011499", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제11 항에 있어서,상기 스케줄링 데이터 응답은 스케줄링될 데이터의 양, 스케줄링될 데이터에 대한 밸런스 PDB(Packet DelayBudget), 할당된 MCS(Modulation and Coding Scheme) 및 수신 CSI(Channel State Information)를 포함하는,IRS의 IRS 자원들을 공유하기 위한 방법."}
{"patent_id": "10-2023-7011499", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제11 항에 있어서,상기 IRS 자원 커맨드는 셀 ID들의 리스트, 상기 복수의 UE들로부터의 UE들의 리스트, 각각의 셀에 할당된 IRS자원들의 리스트 및 IRS 자원들의 할당에 대한 대응하는 유효 시간을 포함하는, IRS의 IRS 자원들을 공유하기위한 방법."}
{"patent_id": "10-2023-7011499", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제11 항에 있어서,상기 네트워크 디바이스에 의해, 상기 IRS의 커버리지 하에 있는 상기 복수의 UE들에 대해 할당된 IRS 자원들을사용하기 시작하도록 MAC 스케줄러를 구성하는 단계를 더 포함하는, IRS의 IRS 자원들을 공유하기 위한 방법."}
{"patent_id": "10-2023-7011499", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제11 항에 있어서,상기 IRS 관리자는 수신된 스케줄링 데이터 응답에 기초하여, 서빙되는 각각의 셀에 대한 IRS 자원들의 결정된몫을 도출하도록 구성되는, IRS의 IRS 자원들을 공유하기 위한 방법."}
{"patent_id": "10-2023-7011499", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "한 세트의 명령들을 포함하는 비-일시적 컴퓨터 판독가능 매체(CRM: computer readable medium)로서,상기 한 세트의 명령들은 네트워크 디바이스에 포함된 프로세서에 의해 실행될 때, 상기 프로세서로 하여금:IRS 관리자로부터 스케줄링 데이터 요청을 수신하게 하고 ― 상기 IRS 관리자는 복수의 UE(User Equipment)들각각에 대응하는 상기 네트워크 디바이스로부터 수신된 측정 보고에 적어도 부분적으로 기초하여 상기 복수의UE들에 의한 불량한 신호 수신의 결정 시에 상기 스케줄링 데이터 요청을 송신함 ―;수신된 스케줄링 데이터 요청에 대한 응답으로, 상기 IRS 관리자에 스케줄링 데이터 응답을 송신하게 하고;상기 IRS 관리자로부터 IRS 자원 커맨드를 수신하게 하고 ― 상기 IRS 관리자는 상기 스케줄링 데이터 응답에대한 응답으로 상기 IRS 자원 커맨드를 송신함 ―; 그리고공개특허 10-2023-0142440-5-수신된 IRS 자원 커맨드를 상기 IRS와 연관된 IRS 제어기에 송신하게 하며,상기 IRS 제어기는 상기 IRS 자원 커맨드에 기초하여 상기 복수의 UE들 각각에 상기 IRS 자원들을 할당하도록구성되는, 비-일시적 컴퓨터 판독가능 매체."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "네트워크 디바이스의 개시된 실시예는 한 세트의 명령들을 저장하는 메모리에 결합된 하나 이상의 프로세서들을 포함하고, 한 세트의 명령들은 하나 이상의 프로세서들에 의해 실행될 때 네트워크 디바이스로 하여금 IRS 관리 자로부터 스케줄링 데이터 요청을 수신하게 한다. 하나 이상의 프로세서들은 추가로, 네트워크 디바이스로 하여 금, 수신된 스케줄링 데이터 요청에 대한 응답으로, IRS 관리자에 스케줄링 데이터 응답을 송신하게 하고, 그리 고 IRS 관리자로부터 IRS 자원 커맨드를 수신하게 하며, IRS 관리자는 스케줄링 데이터 응답에 대한 응답으로 IRS 자원 커맨드를 송신한다. 추가로, 하나 이상의 프로세서들은 네트워크 디바이스로 하여금 수신된 IRS 자원 커맨드를 IRS와 연관된 IRS 제어기에 송신하게 하며, IRS 제어기는 IRS 자원 커맨드에 기초하여 복수의 UE들 각 각에 IRS 자원들을 할당하도록 구성된다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 특허 문서의 개시내용의 일부는 Jio Platforms Limited(JPL) 또는 (이하 소유자로 지칭되는) 그 계 열사들에 속하는 저작권, 디자인, 상표, IC 레이아웃(layout) 설계 및/또는 트레이드 드레스 보호(trade dress protection)와 같은(그러나 이에 제한되지 않음) 지적 재산 권리들의 대상이 되는 자료를 포함한다. 소유자는 특허 및 상표청 특허 파일들 또는 기록들에 나타난 대로 특허 문서 또는 특허 개시내용을 누구나 복사하는 것에 는 이의가 없지만, 그 외에는 어떤 경우에도 모든 권리를 보유한다. 이러한 지적 재산에 대한 모든 권리는 소 유자에 의해 완전히 보유된다. 본 발명은 일반적으로 IRS 네트워크 아키텍처(network architecture)들에 관한 것으로, 보다 구체적으로 는, 통신 네트워크들에서 IRS 자원들의 공유에 관한 것이다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "관련 기술의 다음의 설명은 본 개시내용의 분야에 관한 배경 정보를 제공하는 것으로 의도된다. 이 섹"}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "션은 본 개시내용의 다양한 특징들에 관련될 수 있는 기술분야의 특정 양상들을 포함할 수 있다. 그러나 이 섹 션은 종래 기술의 인정(admission)들로서가 아닌, 단지 본 개시내용에 대한 독자의 이해를 향상시키기 위해서만 사용된다고 인식되어야 한다. 기존의 통신 기술들(예컨대, 5G) 및 미래의 기술들(예컨대, 6G)은 두 가지 주요 현실적인 한계들에 직면 한다. 첫째, 무선 채널에 대한 제어의 결여가 존재하고, 둘째, 네트워크들에 대한 무선 인터페이스의 고전력 소비가 존재한다. 그린(green) 및 지속 가능한 미래의 셀룰러 네트워크들에 대한 필요성을 해결하기 위해, 지 난 몇 년 동안 IRS(Intelligent Reflecting Surfaces) 또는 RIS(Reconfigurable Intelligent Surfaces)를 사 용하여 무선 전파 환경들을 재구성하는 개념이 등장했다. 통상적인 IRS 아키텍처는 성능 향상을 위해 충돌 전 자파들을 현명하게 반사할 수 있는 많은 저비용 수동 안테나들을 포함한다. 3GPP에서 개발되고 있는 5G 무선 기술은 더 높은 멀티-Gbps 피크 데이터(multi-Gbps peak data) 속도들, 초저 레이턴시(ultra-low latency), 더 높은 신뢰성, 대규모 네트워크 용량, 증가된 가용성, 및 보다 균일한 사용자 경험을 더 많은 사용자들에게 전달하는 것으로 여겨진다. 더 높은 성능 및 개선된 효율은 새로 운 사용자 경험들을 가능하게 하고 더 새로운 산업들을 연결한다. 위에서 언급된 목적들 중 일부가 충족되었지 만, 기존의 5G 네트워크들에서 해결될 필요가 있는 몇몇 문제들이 여전히 꽤 존재한다. 예컨대, 기존의 5G 네 트워크들은 다수의 산업 수직 구조(industry vertical)들을 최적으로 수용하지 않을 수 있고, 사설 네트워크들 을 지원하고 유연한 네트워크 전개들을 지원할 아키텍처들을 제공하지 않을 수 있다. RIS(Reconfigurable Intelligent Surfaces)는 5G 네트워크들에 대한 그리고 또한 5G 네트워크들을 넘어 서는 핵심 무선 기술 경향으로서 빠르게 부상하고 있다. RIS는 많은 소형 안테나들 또는 재구성 가능한 메타물 질 엘리먼트(reconfigurable metamaterial element)들(\"유닛 셀(unit cell)들\")의 스마트 라디오 표면들에 대 응하며, 이는 전자파들의 튜닝 가능한(tunable) 산란들을 통해 전파 환경의 제어를 가능하게 한다. 이러한 지 능형 표면들은 라디오 채널 환경에 대해 재구성 가능하고 적응 가능한 반사, 굴절 및 흡수 특성들을 갖는다. 추가로, 기존의 5G 네트워크들은 여전히, 위에서 언급된 많은 문제들을 해결하기 위해 최적의 방식으로 다수의 이용 가능한 또는 신흥 기술들을 사용하지 않는다. 이러한 이용 가능한 기술들의 예들은 인공 지능, 테 라헤르츠(terahertz) 통신들, 광학 무선 기술, 자유 공간 광 네트워크, 블록체인(blockchain), 3차원 네트워킹 (networking), 양자 통신들, 무인 항공기, 셀 프리(cell-free) 통신들, 무선 정보 및 에너지 전달의 통합, 감지 및 통신의 통합, 액세스-백홀(access-backhaul) 네트워크들의 통합, 동적 네트워크 슬라이싱(slicing), 홀로그 래픽 빔 형성(holographic beamforming) 및 빅 데이터(big data) 분석을 포함한다. 추가로, 6G 네트워크들을 참조하면, 기존 시스템들 및 방법들은 임의의 6G 네트워크 인터페이스 아키텍 처, 및 현재 5G 네트워크들을 참조하여 위에서 강조된 바와 같은 우려들을 만족스럽게 해결하는 IRS와 6G 네트 워크 간의 임의의 프로토콜을 제공하지 않는다. 추가로, 현재 방법들 및 시스템들은 6G/5G 네트워크들에서 다수의 기지국들 간에 IRS의 IRS 자원들을 공유하는 특징을 제공하지 않는다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 3, "content": "따라서 당해 기술분야에서 위에서 언급된 문제점들을 극복할 수 있고 위에서 언급된 이용 가능한 기술들 중 적어도 하나 이상의 컨버전스(convergence)를 이용할 수 있는, 5G 네트워크들 및 그 이상의 네트워크들(6G"}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 4, "content": "네트워크들)에 대한 IRS 아키텍처를 제공하기 위한 시스템 및 방법에 대한 당해 기술분야의 요건이 존재한다. 본 명세서의 적어도 하나의 실시예가 충족하는 본 개시내용의 목적들 중 일부는 본 명세서에서 아래에 나열되는 바와 같다. 본 개시내용의 목적은 5G/6G 네트워크들 내의 BS(base station)와 하나 이상의 UE들 간의 효과적이고, 동시 발생하며, 개선된 통신을 가능하게 하는 것이다. 본 개시내용의 목적은 6G 및 추가 네트워크들에서 더 양호한 네트워크 커버리지를 위해 BS의 추가적인 그리고 비용이 많이 드는 전개에 대한 필요성을 제거하는 것이다. 본 개시내용의 목적은 6G 및 추가 네트워크들에서 BS와 IRS 간의 통신 인터페이스 또는 네트워크 인터페 이스를 가능하게 할 수 있는 경제적인 차세대 기반 시스템 및 방법을 가능하게 하는 것이다. 본 개시내용의 목적은 6G 및 추가 네트워크들에서 통신 또는 네트워크 인터페이스를 사용하여 BS에 의한 IRS의 제어를 가능하게 할 수 있는 시스템 및 방법을 가능하게 하는 것이다. 본 개시내용의 목적은 효율적인 방식으로 IRS 아키텍처의 구현을 위한 UE 지원을 제공하는 것이다. 본 발명의 목적은 사용자 경험을 향상시키는 것이다. 본 발명의 목적은 복수의 기지국들 사이에서 IRS의 IRS 자원들을 공유하는 것이다. 본 명세서의 적어도 하나의 실시예가 충족하는 본 개시내용의 목적들 중 일부는 본 명세서에서 아래에 나열되는 바와 같다. 통신 네트워크에서 IRS(Intelligent Reflecting Surface)의 IRS 자원들을 공유하기 위한 네트워크 디바 이스(device)의 실시예들이 개시된다. 실시예에서, 네트워크 디바이스는 한 세트의 명령들을 저장하는 메모리 에 결합된 하나 이상의 프로세서들을 포함하며, 한 세트의 명령들은 하나 이상의 프로세서들에 의해 실행될 때 네트워크 디바이스로 하여금: IRS 관리자로부터 스케줄링 데이터 요청을 수신하게 하고, IRS 관리자는 복수의 UE(User Equipment)들 각각에 대응하는 네트워크 디바이스로부터 수신된 측정 보고에 적어도 부분적으로 기초하 여 복수의 UE들에 의한 불량한 신호 수신의 결정 시에 스케줄링 데이터 요청을 송신한다. 하나 이상의 프로세 서들은 추가로, 네트워크 디바이스로 하여금, 수신된 스케줄링 데이터 요청에 대한 응답으로, IRS 관리자에 스 케줄링 데이터 응답을 송신하게 하고 IRS 관리자로부터 IRS 자원 커맨드(command)를 수신하게 하며, IRS 관리자 는 스케줄링 데이터 응답에 대한 응답으로 IRS 자원 커맨드를 송신한다. 추가로, 하나 이상의 프로세서들은 네 트워크 디바이스로 하여금 수신된 IRS 자원 커맨드를 IRS와 연관된 IRS 제어기에 송신하게 하며, IRS 제어기는 IRS 자원 커맨드에 기초하여 복수의 UE들 각각에 IRS 자원들을 할당하도록 구성된다. 실시예에서, IRS 관리자는 IRS의 커버리지 내의 복수의 UE들의 존재의 결정 시에 스케줄링 데이터 요청 을 송신한다. 실시예에서, 측정 보고는 서빙 셀의 CQI(Channel Quality Indicator) 및 CSI(Channel State Information) 파라미터, 및 복수의 UE들 각각에 의해 IRS로부터 수신된 파일럿 신호의 RSRP(Reference Signal Received Power) 정보, 및 RSRQ(Reference Signal Received Quality) 파라미터를 포함한다. 실시예에서, 프로 세서는 CCIM(Common Communications Interface Module) 인터페이스를 통해 IRS 관리자와 통신하도록 추가로 구 성된다. 실시예에서, 프로세서는 DUI 인터페이스를 통해 IRS 제어기와 통신하도록 구성된다. 실시예에서, 스 케줄링 데이터 요청은 서빙 셀들의 셀 ID들의 리스트, 복수의 UE들의 리스트, 및 TTI(transmission time interval)들의 수를 포함한다. 실시예에서, 스케줄링 데이터 응답은 스케줄링될 데이터의 양, 스케줄링될 데이 터에 대한 밸런스(balance) PDB(Packet Delay Budget), 할당된 MCS(Modulation and Coding Scheme) 및 수신 CSI(Channel State Information)를 포함한다. 실시예에서, IRS 자원 커맨드는 셀 ID들의 리스트, 복수의 UE들 로부터의 UE들의 리스트, 각각의 셀에 할당된 IRS 자원들의 리스트 및 IRS 자원들의 할당에 대한 대응하는 유효 시간을 포함한다. 실시예에서, IRS 관리자는 수신된 스케줄링 데이터 응답에 기초하여, 서빙되는 각각의 셀에 대한 IRS 자원들의 결정된 몫을 도출하도록 구성된다. 실시예에서, 프로세서는 IRS의 커버리지 하에 있는 복수 의 UE들에 대해 할당된 IRS 자원들을 사용하기 시작하도록 MAC 스케줄러(scheduler)를 구성한다. 통신 네트워크에서 IRS(Intelligent Reflecting Surface)의 IRS(Intelligent Reflecting Surface) 자원 들을 공유하기 위한 방법의 실시예들이 개시된다. 실시예에서, 방법은 네트워크 디바이스에 의해 IRS 관리자로 부터 스케줄링 데이터 요청을 수신하는 단계를 포함하며, IRS 관리자는 복수의 UE(User Equipment)들 각각에 대 응하는 네트워크 디바이스로부터 수신된 측정 보고에 적어도 부분적으로 기초하여 복수의 UE들에 의한 불량한 신호 수신의 결정 시에 스케줄링 데이터 요청을 송신한다. 방법은 네트워크 디바이스에 의해, 수신된 스케줄링 데이터 요청에 대한 응답으로, IRS 관리자에 스케줄링 데이터 응답을 송신하는 단계, 및 네트워크 디바이스에 의해, IRS 관리자로부터 IRS 자원 커맨드를 수신하는 단계를 더 포함하며, IRS 관리자는 스케줄링 데이터 응답 에 대한 응답으로 IRS 자원 커맨드를 송신한다. 방법은 네트워크 디바이스에 의해, 수신된 IRS 자원 커맨드를 IRS와 연관된 IRS 제어기에 송신하는 단계를 더 포함하며, IRS 제어기는 IRS 자원 커맨드에 기초하여 복수의 UE 들 각각에 IRS 자원들을 할당하도록 구성된다. 실시예에서, 측정 보고는 서빙 셀의 CQI(Channel Quality Indicator) 및 CSI(Channel State Information) 파라미터, 및 복수의 UE들 각각에 의해 IRS로부터 수신된 파일럿 신호의 RSRP(Reference Signal Received Power) 정보, 및 RSRQ(Reference Signal Received Quality) 파라미터를 포함한다. 실시예에서, 네트 워크 디바이스는 CCIM(Common Communications Interface Module) 인터페이스를 통해 IRS 관리자와 통신하도록 추가로 구성된다. 실시예에서, 네트워크 디바이스는 DUI 인터페이스를 통해 IRS 제어기와 통신하도록 구성된다. 실시예에서, 스케줄링 데이터 요청은 서빙 셀들의 셀 ID들의 리스트, 복수의 UE들의 리스트, 및 TTI(transmission time interval)들의 수를 포함한다. 실시예에서, 스케줄링 데이터 응답은 스케줄링될 데이터 의 양, 스케줄링될 데이터에 대한 밸런스 PDB(Packet Delay Budget), 할당된 MCS(Modulation and Coding Scheme) 및 수신 CSI(Channel State Information)를 포함한다. 실시예에서, IRS 자원 커맨드는 셀 ID들의 리 스트, 복수의 UE들로부터의 UE들의 리스트, 각각의 셀에 할당된 IRS 자원들의 리스트 및 IRS 자원들의 할당에 대한 대응하는 유효 시간을 포함한다. 실시예에서, 방법은 네트워크 디바이스에 의해, IRS의 커버리지 하에 있 는 복수의 UE들에 대해 할당된 IRS 자원들을 사용하기 시작하도록 MAC 스케줄러를 구성하는 단계를 더 포함한다. 실시예에서, IRS 관리자는 수신된 스케줄링 데이터 응답에 기초하여, 서빙되는 각각의 셀에 대한 IRS 자원들의 결정된 몫을 도출하도록 구성된다. IRS의 IRS 자원들을 공유하기 위한 비-일시적 CRM(computer readable medium)의 실시예들이 개시된다. 비-일시적 CRM은 한 세트의 명령들을 포함하며, 한 세트의 명령들은 네트워크 디바이스에 포함된 프로세서에 의 해 실행될 때 프로세서로 하여금, IRS 관리자로부터 스케줄링 데이터 요청을 수신하게 하고, IRS 관리자는 복수 의 UE(User Equipment)들 각각에 대응하는 네트워크 디바이스로부터 수신된 측정 보고에 적어도 부분적으로 기 초하여 복수의 UE들에 의한 불량한 신호 수신의 결정 시에 스케줄링 데이터 요청을 송신한다. 한 세트의 명령 들은 실행될 때 추가로 프로세서로 하여금, 수신된 스케줄링 데이터 요청에 대한 응답으로, IRS 관리자에 스케 줄링 데이터 응답을 송신하게 하고 IRS 관리자로부터 IRS 자원 커맨드를 수신하게 하며, IRS 관리자는 스케줄링 데이터 응답에 대한 응답으로 IRS 자원 커맨드를 송신한다. 한 세트의 명령들은 실행될 때 추가로 프로세서로 하여금 수신된 IRS 자원 커맨드를 IRS와 연관된 IRS 제어기에 송신하게 하며, IRS 제어기는 IRS 자원 커맨드에 기초하여 복수의 UE들 각각에 IRS 자원들을 할당하도록 구성된다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "다음의 설명에서는, 설명의 목적으로, 본 개시내용의 실시예들의 전반적인 이해를 제공하기 위해 다양한 특정 세부사항들이 제시된다. 그러나 본 개시내용의 실시예들은 이러한 특정 세부사항들 없이 실시될 수 있음 이 명백할 것이다. 이하 설명되는 여러 특징들은 각각 서로 독립적으로 또는 다른 특징들의 임의의 조합으로 사용될 수 있다. 개개의 특징은 위에 논의된 문제들 모두를 해결하는 것은 아닐 수 있거나 또는 위에 논의된 문제들 중 일부만을 해결할 수도 있다. 위에 논의된 문제들 중 일부는 본 명세서에서 설명되는 특징들 중 임의 의 것에 의해 완전히 해결되지 않을 수도 있다. 이어지는 설명은 예시적인 실시예들만을 제공하며, 본 개시내용의 범위, 적용 가능성 또는 구성을 제한 하는 것으로 의도되지 않는다. 오히려, 예시적인 실시예들의 이어지는 설명은 예시적인 실시예를 구현하기 위"}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "한 가능한 설명을 당해 기술분야에서 통상의 지식을 가진 자들에게 제공할 것이다. 제시된 바와 같이 본 발명 의 사상 및 범위를 벗어나지 않으면서 엘리먼트들의 기능 및 어레인지먼트(arrangement)에 다양한 변경들이 이 루어질 수 있다는 것이 이해되어야 한다. 실시예들의 철저한 이해를 제공하기 위해 다음의 설명에서 특정 세부사항들이 주어진다. 그러나 실시예"}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "들은 이러한 특정 세부사항들 없이 실시될 수 있다고 당해 기술분야에서 통상의 지식을 가진 자에 의해 이해될 것이다. 예컨대, 불필요한 세부사항으로 실시예들을 모호하게 하지 않도록 회로들, 시스템들, 네트워크들, 프로세스들 및 다른 컴포넌트들은 블록도 형태로 컴포넌트들로서 도시될 수 있다. 다른 경우들에는, 실시예들을 모호하게 하는 것을 피하기 위해, 잘 알려진 회로들, 프로세스들, 알고리즘들, 구조들 및 기법들은 불필요한 세 부사항 없이 도시될 수 있다. 또한, 개별 실시예들은 흐름도, 순서도, 데이터 순서도, 구조도 또는 블록도로서 도시되는 프로세스로서 설명될 수 있다는 점이 주목된다. 흐름도는 순차적인 프로세스로서 동작들을 설명할 수 있지만, 동작들 중 다 수는 병렬로 또는 동시에 수행될 수 있다. 또한, 동작들의 순서는 재배열될 수 있다. 프로세스는 프로세서의 동작들이 완료될 때 종료되지만 도면에 포함되지 않은 추가 단계들을 가질 수 있다. 프로세스는 방법, 함수, 프로시저, 서브루틴, 서브프로그램 등에 대응할 수 있다. 프로세스가 함수에 대응할 때, 그 종료는 호출 함수 또는 메인 함수로의 함수의 복귀에 대응할 수 있다. \"예시적인\" 및/또는 \"예증적인\"이라는 단어는 본 명세서에서 예, 경우 또는 예시로서의 역할을 의미하는 데 사용된다. 혼선을 피하기 위해, 본 명세서에서 개시되는 요지는 이러한 예들로 제한되지 않는다. 추가로, 본 명세서에서 \"예시적인\" 및/또는 \"예증적인\"으로 설명되는 어떠한 양상이나 설계도 반드시 다른 양상들 또는"}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "설계들에 비해 선호되거나 유리한 것으로 해석되는 것도 아니고, 당해 기술분야에서 통상의 지식을 가진 자들에 게 공지된 대등한 예시적인 구조들 및 기법들을 불가능하게 하는 것으로 여겨지는 것도 아니다. 더욱이, \"포함 한다,\" \"갖는다,\" \"함유한다\"라는 용어들 및 다른 비슷한 단어들이 상세한 설명 또는 청구항들에서 사용되는 한, 이러한 용어들은 어떠한 추가 또는 다른 엘리먼트들도 불가능하게 하지 않고 ― 개방적인 전환어로서 \"포함 하는\"이라는 용어와 비슷한 식으로 ― 포괄적인 것으로 의도된다. 본 명세서 전반에 걸쳐 \"일 실시예\" 또는 \"실시예\" 또는 \"경우\" 또는 \"일 경우\"에 대한 언급은 실시예와 관련하여 설명된 특정한 특징, 구조 또는 특성이 본 발명의 적어도 하나의 실시예에 포함되는 것을 의미한다. 따라서 본 명세서 전반에 걸쳐 다양한 위치들에서 \"일 실시예에서\" 또는 \"실시예에서\"라는 문구들의 출현들이 모두 반드시 동일한 실시예를 의미하는 것은 아니다. 더욱이, 특정한 특징들, 구조들 또는 특성들은 하나 이상 의 실시예들에서 임의의 적절한 방식으로 조합될 수 있다. 본 명세서에서 사용되는 용어는 특정 실시예들만을 설명하기 위한 것이며, 본 발명의 제한으로 의도되는 것은 아니다. 본 명세서에서 사용되는 바와 같이, 단수 형태들은 맥락이 명확하게 달리 지시하지 않는 한, 복 수 형태들도 포함하는 것으로 의도된다. 본 명세서에서 사용될 때 \"포함한다\" 및/또는 \"포함하는\"이라는 용어 들은 언급된 특징들, 정수들, 단계들, 동작들, 엘리먼트들 및/또는 컴포넌트들의 존재를 특정하지만, 하나 또는 그보다 많은 다른 특징들, 정수들, 단계들, 동작들, 엘리먼트들, 컴포넌트들, 및/또는 이들의 그룹들의 존재 또 는 추가를 배제하는 것은 아니라고 추가로 이해될 것이다. 본 명세서에서 사용되는 바와 같이, \"및/또는\"이라 는 용어는 연관된 열거된 항목들 중 하나 이상의 항목들의 임의의 그리고 모든 조합들을 포함한다. 무선 통신의 새로운 패러다임(paradigm)인, 인공 지능의 완전한 지원과 함께 6G(sixth-generation) 시 스템이 다음 몇 년 내에 전개될 것으로 예상된다. 6G 네트워크들에서, 해결될 필요가 있을 수 있는 일부 근본 적인 문제들은 5G 네트워크들과 비교하여 더 높은 시스템 용량, 더 높은 데이터 레이트(rate), 더 낮은 레이턴 시, 및 개선된 QoS(quality of service)를 포함한다. 현재의 5G(fifth generation) 기술들에서도, 더 높은 시스템 용량, 더 높은 데이터 레이트, 더 낮은 레 이턴시, 및 개선된 QoS(quality of service)가 바람직하다. 5G 네트워크들은 여전히, 이용 가능한 또는 신흥 기술들을 사용하지 않는다. 추가로, 6G 네트워크와 같은(그러나 이에 제한되지는 않음) 미래의 네트워크들은 물리적, 생물학적 및 디지털 세계들에 걸친 인간 경험의 확장을 달성하도록 설계되는 것이 바람직할 수 있다. 동시에, 6G 네트워크 들은 성능의 다양한 차원들에서 Industry 4.0(4차 산업 혁명)을 넘는 차세대 산업 운영 환경을 가능하게 하는 것이 바람직할 수 있다. 이러한 차원들은 이를테면, 포지셔닝(positioning), 감지, 초신뢰도(ultra- reliability), 에너지 효율 및 극한 실시간(그러나 이에 제한되지는 않음)을 포함할 수 있다. 6G 네트워크들은 통신들 및 감지 목적들 모두를 위한 신규한 라디오 및 액세스 아키텍처들, AI 최적화된 WAN(wide area network) 및 데이터 센터 공동 설계뿐만 아니라, 틈새 소비자 이익들의 롱 테일(long tail)에 일대 변혁을 일으키기 위한 개인화된 서비스들의 동적 오케스트레이션(dynamic orchestration)을 제공할 수 있다. 모바일 브로드밴드에 대한 요구가 소비자들 및 기업들 모두에게 계속해서 증가할 것이지만, 매우 신뢰할 수 있고 낮은 레이턴시의 활용은, 비공개 네트워크들과, 그리고 종종 증강 지능과 함께, 전문화된 그리고 로컬 사용 사례들에 의해 대체로 주도될 것이다. 이는 현재 5G 네트워크들에서 예상되고 시도되고 있는 자동화되고안전한 네트워크 변환의 필수적인 부분으로서 발생할 것이다. 자동차들, 산업 기계들 및 가전제품들에서부터 시계들 및 의류에 이르는 객체들은 인간의 행동, 환경 및 비즈니스 프로세스들에 자동으로 적응함으로써 인간의 요구들을 충족시키도록 스스로 학습하고 조직화할 것이다. 에너지 효율은 6G 네트워크 아키텍처들의 설계를 위 한 또 다른 핵심적인 설계 기준인데, 이는 네트워크의 성능이 각각의 아키텍처 도메인들에서 이용 가능한 에너 지에 의존할 것이기 때문이다. 가장 도전적인 요건들 중 하나는 증강 현실 및 몰입형 미디어 경험과 함께 원격 제어에서 비롯된다. 이 는, URLLC(extreme ultra-reliable low latency) 성능 요건에 부가하여, 고품질 360도 비디오의 비압축 송신을 가능하게 하는 100Gbit/s 이상의 초고 레이트들을 요구할 것이다. 그러한 요구는 5G 네트워크 능력들을 넘어서 는 어느 정도의 유연성 및 전문화를 필요로 할 것이다. 따라서 6G 네트워크들은 의도적이고 개방된 서비스 중 심이어야 하며, 요컨대 비즈니스 요구들이 6G 제품 및 서비스 생성을 주도할 것이다. 제품 및 서비스 생성은 정책 및 의도에 의해 조종 및 안내되는 자동화된 e2e 서비스 작업 흐름의 필수적인 부분이 될 것이다. 다시 말 해서, 사용 사례 중심은 인간이든, 물리적 기계든, 또는 디지털 트윈(digital twin)이든, 각각의 사용자 또는 전문화된 6G 서브-네트워크(sub-network)의 다양한 요구들 및 선호도들을 충족시키는 것을 의미한다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "요약하면, 6G 아키텍처에 대한 핵심 요건들은: (a) 네트워크 프로그래밍 가능성; (b) 전개 유연성; (c) 단순성 및 효율성; (d) 보안, 견고성 및 신뢰도; 및 (e) 자동화를 포함할 수 있다. 개시된 네트워크 아키텍처는 본 명세서에서 이후 제안되는 바와 같이 네트워크 유연성의 문제를 해결한 다. 본 개시내용은 또한 내장된 기능으로서 네트워크 감지를 수용하는 5G 및 6G 네트워크 아키텍처들을 제안한 다. 본 개시내용은 또한, 위에서 언급된 기존 기술들 중 적어도 하나를 이용 및 수렴시키는 문제를 적어도 부 분적으로 해결하는, 5G 및 5G 이상의 네트워크들(예컨대, 6G)에 대한 IRS 아키텍처를 제안한다. 본 개시내용은 네트워크와 IRS 간의 성공적인 네트워크 인터페이스 아키텍처를 가능하게 하도록 기존 UE들에 의한 지원을 제공 하기 위한 메커니즘들을 제공한다. 도 1은 본 개시내용의 실시예에 따른, 예시적인 5G 또는 6G 네트워크 아키텍처에서의 통상적인 IRS 전개 시나리오를 예시한다. 실시예에서, IRS의 주요 특성들은: 전력 증폭 없음; 디지털 신호 프로세싱이 없거 나 제한된 RF 레벨(level)에서의 동작; 및 다기능 재구성 가능성을 포함한다. IRS 아키텍처의 개시된 실시예들 은 이러한 특성들을 고려하고, 적어도 위에서 강조된 문제점들에 대한 솔루션들을 제공한다. 도시된 바와 같이, 전개 시나리오는 기지국들(104a, 104b)로부터 액세스 포인트들(106a, 106b)로 신호들을 반사시키도 록 구성되는 IRS를 포함한다. 도 2a - 도 2f는 본 개시내용의 실시예에 따른, IRS 전개의 예시적인 사용 사례들을 예시한다. 일반적 으로, (본 설명에서는 RIS로 상호 교환 가능하게 지칭되는) IRS에 대해 현재 탐구되고 있는 사용 사례들은 ― 커버리지 확장을 위한 스마트한 거의 수동적인 중계기들로서의 사용, 용량 개선들을 위한 단일 RF 멀티스트림 (multi-stream) 송신기로서의 사용, 및 주변 후방 산란 및 공생 라디오와 관련하여 정보 보조 송신에 대한 사용 을 포함한다. 예컨대, 도 2a에 도시된 바와 같이, IRS 전개가 RIS 보조 UAV(Unmanned Arial Vehicle)에 사용된다. 또 다른 예에서, 도 2b에 도시된 바와 같이, IRS 전개가 RIS 보조 밀리미터 (mm) 파 통신에 사용된다. 또 다른 예에서, 도 2c에 도시된 바와 같이, IRS 전개가 RIS 보조 SWIPT(simultaneous wireless information and power transfer)에 사용된다. 또 다른 예에서, 도 2d에 도시된 바와 같이, IRS 전개가 RIS 보조 물리 계층 보안에 사용된다. 또 다른 예에서, 도 2e에 도시된 바와 같이, IRS 전개가 RIS 보조 모바일 에지 컴퓨팅(mobile edge computing)에 사용된다. 또 다른 예에서, 도 2f에 도시된 바와 같이, IRS 전개가 RIS 보조 D2D(device to device) 시스템들에 사용된다. 일반적으로, RIS들은 동적 및 목표 지향 방식으로 송신기와 수신기 간의 라디오 신호들의 제어를 가능하 게 하여, 그에 따라 무선 환경을 서비스로 전환시킨다. 무선 채널을 재구성한다는 관점에서 이러한 능력은 용 량, 커버리지, 에너지 효율, 포지셔닝 및 보안과 같은 다양한 네트워크 KPI(Key Performance Indicator)들의 호 스트의 잠재적인 향상들을 유발했다. 이는 감지 및 무선 전력 전달과 같은 새로운 능력들의 지원에 추가된다. RIS들은 무선 환경을 수동적 액터(actor)에서 지능적 액터로 전환시키는 새로운 시스템 노드를 도입하여, 채널이 프로그래밍 가능하게 된다. 이러한 경향은 기본적인 무선 시스템 설계 패러다임들에 도전하 여, 혁신 기회를 생성할 것이며, 이는 무선 시스템 아키텍처, 액세스 기술들 및 네트워킹 프로토콜들의 진화에 점진적으로 영향을 미칠 것이다. 더욱이, RIS(reconfigurable intelligent surface)는 제어 가능한 방식으로 지능형 및 프로그래밍 가능 라디오 환경을 구성할 수 있다. RIS는 수동 반사, 수동 흡수, 수동 산란을 수행하고 물리적 환경을 지능적이고상호적인 쪽으로 변화시키는 것을 가능하게 한다. RIS는 어떠한 RF 신호 프로세싱도 사용하지 않고 입사 신호 들에 대해 독립적으로 엘리먼트들의 전자기 특징들을 변화시키고 위상 시프트를 생성할 수 있다. 또한, RIS 기 술은 현재의 메인스트림(mainstream) 기술을 넘어서는 많은 기술적 특징들을 갖는다. 매시브(massive) MIMO와 비교하여, RIS 보조 무선 네트워크는 스마트 신호 전파의 최적화를 통해 시스템 성능을 크게 향상시킨다. 추가로, RIS 엘리먼트는 완전히 수동적이고 낮은 전력 소비를 가져, 이를 환경 친화적이고 지속 가능한 녹색으로 만든다. RIS 설계는 ADC/DAC 및 전력 증폭기와 같은 고비용 컴포넌트들을 필요로 하지 않으며, 그러 므로 대면적 전개의 실현 가능성이 크게 개선될 수 있다. 추가로, 전자파들은 그 연속적인 표면 상의 임의의 지점에서 재구성될 수 있고, 따라서 상이한 적용 시나리오들에 적응하고 더 높은 공간 분해능을 지원하도록 임 의의 형상을 형성할 수 있다. RIS는 전파 환경을 지능적으로 제어하고, 송신 신뢰도를 향상시키며, 더 높은 스 펙트럼 효율을 달성하는 것을 가능하게 한다. RIS는 예컨대, NLOS(Non-line of sight) 제한을 극복하고 커버리지 홀(hole) 문제를 환경 친화적인 방 식으로 처리하기 위해 하나 이상의 시나리오들에 적용 가능할 수 있다. 다른 시나리오는 셀 에지 사용자들을 서빙하고, 다중-셀 동일 채널 간섭을 완화하고, 커버리지를 확장시키고, 동적 모바일 사용자 추적을 구현하는 것이다. 추가 시나리오들은 전자기 오염을 감소시키고 다중 경로 문제를 해결하는 것일 수 있다. 또 다른 시 나리오는 포지셔닝, 지각, 홀로그래픽 통신을 위해 RIS를 사용하고 현실을 향상시키는 것이다. 또 추가 시나리 오는 감지 통신 통합을 실현하는 것이다. 미래에, 5G 및 6G 네트워크들에서 진화하는 통신 시스템들은 더 복잡한 무선 환경 및 더 높은 서비스 품 질 요건들에 직면할 것이며, 이는 RIS 아키텍처 및 설계에 대해 더 큰 난제들을 제기할 것이다. 첫째로, 합리 적인 전자기 모델 및 채널 모델이 확립될 필요가 있을 수 있다. RIS 보조 통신 시스템들의 근본적인 한계 및 잠재적 이득들이 탐구될 필요가 있을 수 있다. 어떠한 RF 체인도 RIS에서 구성되지 않기 때문에, 채널 추정을 위해 새로운 시스템 및 방법이 요구된다. 둘째로, IRS 아키텍처의 설계에서는 수동적 빔 형성 설계 및 수동적 정보 전달 최적화가 요구된다. 추 가로, 6G에서의 RIS 전개는 새로운 네트워크 패러다임을 가져올 것이다. 더욱이, 새로운 재료의 연구 및 개발 은 RIS 기술의 개발에서 병목 현상들 중 하나이다. 메타-표면(meta-surface)의 전자기 모델링, 제어 방법들 및 기저대역 특성화를 통해 새로운 제어 메커니즘이 탐구될 수 있다. 마지막으로, 전자기 전파 및 채널 모델들에 대한 이론적 연구가 계속 성장함에 따라, 물리 계층 특징들을 최대한 이용하고 알고리즘 효율을 개선하기 위해 데이터 중심 및 모델 중심 AI 최적화 설계를 고려할 필요가 있다. 하나의 새로운 기본 기술로서, RIS는 저비용, 저전력 소비 및 용이한 전개의 특징들을 갖고, 미래의 녹 색 통신을 지원하며, 미래의 감지-통신 통합을 가능하게 한다. IRS는 반사된 간섭을 무효화하면서 원하는 신호 전력을 향상시키는 것을 돕는다. 대안으로, 반사된 간섭은 (구현하기가 더 어렵긴 하지만) 직접적인 간섭을 제 거하도록 튜닝(tune)될 수 있다. 이는 IRS 부근에 \"신호 핫스팟(hotspot)\"뿐만 아니라 \"간섭 없는 구역\"을 생 성함으로써 셀 에지 사용자의 SINR을 개선한다. 본 발명은 위의 모든 사용 사례들/시나리오들에서 구현될 수 있는 IRS 네트워크 아키텍처들을 제안한다. 도 3은 본 개시내용의 실시예에 따른, 예시적인 IRS 커버리지 시나리오를 예시한다. 도면에 도시 된 바와 같이, 일부 고층 건물들 뒤에, 작은 언덕 구조 뒤에, 또는 셀 에지들에서와 같은 특정 영역들이 있을 것이며, 여기서 주어진 기지국(5G 또는 6G)으로부터의 신호 열화에 대한 확실한 기회가 있을 것이다. 이러한 영역들에서, BS(base station) 신호들은 적절한 치수들로 적절한 위치에 IRS를 전개함으로써 개선될 수 있다. IRS의 치수에 기초하여, 빔 폭은 그러한 신호 열화에 의해 영향을 받는 하나 이상의 UE들을 지원하도록 수직으 로 또는 수평으로 조정될 수 있다. 실시예에서, 빔들은 또한 수직으로 또는 수평으로 조향될 수 있다. IRS 안 테나 엘리먼트들의 치수에 기초하여, 수직 및 수평 모두의 빔의 최대 조향은 IRS 커버리지 영역으로 지칭될 수 있는 가상 구면(spherical) 영역을 생성한다. 따라서 이러한 종류의 구면 커버리지 영역 내에서 신호 열화를 겪는 사용자들은 연관된 IRS로부터의 반사된/재생성된 빔들을 사용함으로써 기지국으로부터 개선된 신호들을 얻 을 수 있다. 도 3을 참조하면, IRS-1(302-1)은, 기지국으로부터 직접 신호를 수신할 수 있고 다른 빔을 반사/재 생성하여 개선된 기지국 신호를 큰 건물 뒤에 있는 영역에 제공할 수 있는 방식으로 전개된다. IRS-1(302-1)에 의해 지원되는 안테나 어레이 엘리먼트들의 수에 기초하여, IRS-1 커버리지가 가상으로 생성된다. 이러한 커버 리지 내의 임의의 UE들은 IRS-1(302-1)로부터 이익을 얻을 수 있다. 유사하게, IRS-2(302-2)는 작은 언덕 뒤에 서 열악한 커버리지를 겪는 UE들을 돕기 위해 그 언덕에 더 가깝게 전개된다. IRS-N(302-N) 시나리오의 경우, 일부 셀 에지 UE들은 서빙 기지국으로부터 열화된 신호를 수신하고 있었 고, 종종 급격하게 연결 해제되고 있었다. 이러한 시나리오에서, IRS-N 종류의 전개는 기지국으로부터 안정적 이고 개선된 신호들을 일관되게 제공하도록 셀 에지 UE들을 돕는다. 이는, 영향을 받는 UE들이 불필요한 호 드 롭(call drop)들을 피하는 것을 가능하게 하며, IRS-N 전개는 전개된 IRS-N의 치수들에 기초하여 커버리지를 확 장함으로써 서빙 셀의 용량을 개선한다. 실시예에서, 기지국은 제안된 DUI 인터페이스(\"DUI I/F\")를 통해 IRS-1, IRS-2 및 IRS-N과 통신한다. 실시예에서, 셀 커버리지 내에서, 하나 이상의 IRS들은 셀 커버리지의 지리적 영역의 성질에 기초하여 전개될 수 있다. 이러한 IRS들의 치수는 기지국 신호를 방해하는 객체의 치수에 기초하여 동일하거나 상이할 수 있다. 실시예에서, 방해 객체들은 높은 건물, 작은 언덕에 대응할 수 있고, 따라서 감쇠는 모두 셀 에지까 지 신호 경로를 따른다. 실시예에서, IRS의 전개는 셀 커버리지 내의 가능한 커버리지 홀들이 사전에 알려진 경우 정적이고, 건물, 터널들, 교량들, 언덕들, 나무들 등과 같은 구조들로 인해 다소 영구적일 수 있다. 또 다른 실시예에서, IRS의 전개는 동적일 수 있고, 여기서 셀 커버리지 내의 가능한 커버리지 홀은 자연재해들, 공공 안전 시나리오들, 공공 집회들 등으로 인해 일시적이며, 이 경우들에서, IRS는 UAV, 열기구들, 위성들 등 을 통해 전개될 수 있다. 개시된 실시예들은 IRS 및 5G/6G 네트워크 인터페이스 아키텍처, 및 또한 5G/6G 네트워크와 IRS 간의 통 신 프로토콜을 제안한다. 개시된 실시예들은 또한, 기지국에서의 (계산된) 그리고 제안된 네트워크 인터페이스 를 통해 IRS로 전달되는 IRS 기울기 정보의 컴퓨팅을 제안한다. 일 실시예에서, IRS 기울기 정보는 기지국에서의 SINR 또는 RSRP(Reference Signal Received Power) 또 는 RSRQ(Reference Signal Received quality) 정보에 기초하여 계산된다. 다른 실시예에서, IRS에 대한 빔 형 성은 IRS 위치 및 사용자 위치의 지식 및 UE로부터 제공된 CQI(Channel quality indicator) 정보에 기초하여 계산될 것이다. 일 실시예에서, IRS 기울기 정보는, 하나 또는 다수의 공간적으로 지향성인 신호들을 동시에 송신하기 위해 안테나 어레이를 사용하는 데 적용되는 바와 같이, 디지털 IRS 조향 또는 빔 형성으로 또한 지칭되는 IRS 기울기 행렬 또는 빔 형성 또는 프리코딩 행렬로서 계산된다. IRS 송신 어레이의 모든 각각의 안테나는 UE에 의해 경험되는 신호 품질의 정보를 사용함으로써 도달된 최적화 기준들에 따라 디지털 도메인에서 설계된 상이 한 신호를 방출한다. 실시예에서, IRS는 지향성(빔 형성)을 제공하기 위해, 기지국 스케줄러 엔티티에 의해 제 공된 프리코딩 행렬 또는 빔 형성 행렬을 적용하는데, 즉 의도된 UE를 향해 IRS 안테나 엘리먼트들의 반사각을 정렬하고, 송신 전력(전력 할당)을 택한다. 특히, 전력 및 위상들을 별개로 사용 또는 할당하는 것이 또한 본 개시내용의 실시예이다. 본질적으로, 프리코딩은 하나 또는 다수의 수신기들에 정보를 전달하기 위해 송신기에 서 선택된 특정 전략이다. 더욱이, IRS는 요건들에 기초하여 동적으로 그리고 자동으로 구성될 수 있다. 개시된 메커니즘은, 전개된 IRS 패널(panel) 부근의 주어진 사용자(또는 UE) 분포를 고려하여 IRS 기울 기가 제어될 수 있도록 BS(base station)가 IRS를 인지하는 방법을 제공한다. 실시예에서, 이는 사용자(또는 UE) 및 신호 강도(SINR) 분포를 고려함으로써 하나 이상의 기지국들에 의해 달성된다. 일 실시예에서, 개시된 BS(base station)는 데이터베이스에서 인코딩된 사전 지식을 통해 또는 (설명에 서 나중에 설명되는) IRS와 BS 간의 시그널링 메커니즘을 통해 IRS를 인지한다. IRS가 네트워크에서 발생하거 나 활성이 될 때, IRS는 이용 가능한 물리적 연결을 통해 모든 연결된 BS들에 핸드셰이크(handshake) 신호를 전 송하도록 구성될 수 있다. 다음의 정보, 이를테면: IRS ID, 위도/경도의 위치 등(그러나 이에 제한되지 않음) 중 하나 이상이 교환될 수 있다. 실시예에서, IRS와 BS 사이의 연결은 RF 연결(IAB, 마이크로파 링크 (Microwave link) 등)을 통할 수 있다. 핸드셰이크 신호 스키마(schema)를 포함하는 네트워크 인터페이스 프로토콜이 개시된다. 일 실시예에서, BS(base station)와 IRS 패널 간에 인터페이싱하는 메커니즘이 도 4에 도시된다. 도 4를 참조하면, (이하, IRS 제어기로도 또한 지칭되는) 마이크로컨트롤러를 통해 BS와 IRS 사이에 직접 연결이 확립 되어, 주어진 시간 기간 동안 기울기 제어 정보를 컴퓨팅하고 그러한 정보를 연결을 통해 IRS에 전달하는 메커 니즘을 구현한다. BS에 의한 IRS 패널 기울기를 제어하는 것에 대한 2개의 양상들이 존재할 수 있다. 실시예에서, BS는 BS에서 SINR(signal-to-noise-plus-interference ratio) 프로파일을 수집하고, 그 다음, IRS 부근의 구역에 대 한 RF 서명 프로파일을 생성하도록 구성된다. 예시적인 실시예에서, SINR 프로파일은 BS에 의해 서빙되는 구역에서 UE에 의해 생성되고 BS에 전송되는 하나 이상의 향상된 사용자 측정 보고들을 통해 수집된다. 다른 실시예에서, BS(또는 BS의 스케줄러 모듈)는 SINR 목적을 달성하는 데 필요한 기울기들을 컴퓨팅하 고, 이를테면 주어진 구역에 대한 사용자 분포, 사용자 또는 SINR 또는 BLER(Block Error Rate) 프로파일들과 같은(그러나 이에 제한되지 않음) 하나 이상의 정보 엘리먼트들로 이를 수행하도록 구성된다. 실시예에서, 기 울기는 UE에 구현된 감지 메커니즘에 의해 획득될 수 있는 사용자 위치 정보에 기초할 수 있고, 이러한 정보는 BS(스케줄러)에 공급된다. 개시된 IRS 아키텍처는 또한, UE로부터 상기 정보의 수집을 위한 메커니즘 및 그러한 수집 메커니즘의 관리를 설명한다. 실시예에서, 하나 이상의 제어 메시지들이 BS로부터 IRS로 송신된다. 실시예에서, 이러한 제어 메시지들의 주기성은 요건 또는 다른 팩터들에 기초하여 미리 구성될 수 있다. 실시예에서, IRS는 하나 이상의 제어 메시지들을 사용하여 BS에 의해 제어될 수 있다. 특히, 라디오 제 어기(라디오 자원 관리 엔티티 또는 기저대역 엔티티), 코어 네트워크 또는 임의의 지능형 엔티티들 또는 네트 워크 디바이스, 이를테면 O-RAN RIC(Radio intelligent controller)(그러나 이에 제한되지 않음)가 제어 메시 지들을 통신할 수 있고, IRS를 제어할 수 있다. 실시예들 중 하나에서, 6G NR DU 및 IRS 인터페이스가 제안되며, 이는 본 설명에서 \"DUI I/F\"로 지칭되 었다. 이는 본 설명에서 나중에 상세히 설명되는 바와 같이, DU와 IRS 간에 시그널링 메시지들을 교환하기 위 해, BS와 IRS 제어기 사이의 로직 인터페이스로서 구현된다. 도 4는 본 개시내용의 실시예에 따른, 예시적인 IRS 전개 시나리오를 예시한다. 일 실시예에서, BS(base station)와 IRS 패널 간의 인터페이스의 메커니즘이 제공된다. 도시된 바와 같이, IRS는 구리 백 플레인(copper backplane) 및 제어 회로 기판을 포함한다. IRS 및 기지국은 IRS의 일부일 수 있거나 일부가 아닐 수 있는 마이크로컨트롤러를 통해 통신하여 메시지들(예컨대, 제어 메시지들)을 교환 한다. 도 5a는 IRS를 지원하는 차세대 또는 미래 세대 RAN(예컨대, 6G RAN)의 기능 아키텍처를 예시한다. 예시 목적들을 위해, 개시된 기지국 또는 네트워크 디바이스의 다양한 블록들 또는 모듈들 또는 서브시스템들이 아키텍처에 도시된다. 실시예에서, 6g-NB-DU들(6G 기지국 노드 DU들)(506-1, 506-M)은 다수의 셀들을 지 원하고, 각각의 셀은 제안된 DUI I/F를 통해 하나 이상의 IRS 제어기들(예컨대, IRS-1 제어기, IRS-2 제어 기, IRS-3 제어기)에 연결될 수 있다. IRS 제어기들 각각은 IRS-1(502-1), IRS-2(502-2) 및 IRS-3(502-3)에 각각 대응한다. 실시예에서, 6g-NB-CU들(6G 기지국 노드 CU들)(510-1, 510-P)은 도면에 도시된 바와 같이 각각 의 지원되는 셀 콘텍스트(context)에 대해 IRS-셀 매핑 표(mapping table)(예컨대, 514-1, 514-P)를 유지한다. 6g-NB-CU들(6G 기지국 노드 CU들)은 6G-XN 인터페이스를 통해 서로 통신한다. 6g-NB-CU들(6G 기지국 노 드 CU들)은 6G-NG 인터페이스를 통해 6GC(sixth generation code)와 통신한다. 예시적인 실시예에서, 셀에 IRS가 전개될 때마다, 6g-NB-CU(6G 기지국 노드 CU)에서 유지되는 IRS-셀 매 핑 표에 엔트리(entry)가 생성된다. 실시예에서, 엔트리는 IRS-ID, IRS에 의해 지원되는 안테나 엘리먼트들의 수와 같은 IRS 능력들, 기계적/전기적 기울기 지원, 능동/수동 지원, IRS의 고도, 방위각, 고도, 커버리지 능력 들과 같은 지리적 위치, 공유 가능/공유 불가능 상태, 셀 에지/셀 중간/셀 중심 영역들에서의 전개 세부사항들 등을 포함한다. 실시예에서, 위에서 언급된 정보는 (도 7a - 도 7g를 참조하여 추후에 설명되는) (DU-IRS) DUI-AP(Application protocol) 셋업(setup) 프로시저 동안 IRS 제어기로부터 직접 또는 EMS(Element Management System)로부터 획득될 수 있다. 실시예에서, IRS-셀 매핑 표는 실시간으로 관리 또는 업데이트될 수 있거나, 또는 주기적으로 구성될 수 있다. 또 다른 실시예에서, IRS-셀 매핑 표는 특정 지오로케이션 (geolocation)에서 예상되는 네트워크 사용 사례들/시나리오들에 기초하여 미리 결정된 계획에 따라 관리될 수 있다. 실시예에서, UE는 RRC(Radio Resource Control) 측정 보고 메시지 또는 UE 위치 정보 업데이트와 같은 새로운 RRC 메시지를 사용하여 자신의 물리적 위치 정보를 빈번하게 업데이트하거나 6G-NB-CU-CP에 송신하도록 구성될 수 있다. 보고된 UE 위치가 임의의 사전 전개된 IRS 커버리지들에 떨어지거나 가까워지고 있을 때마다, 6g-NB-CU-CP(예컨대, 510-1)는 UE 세부사항들, UE의 위치 정보, 연관된 IRS 정보를 6g-NB-DU(예컨대, 506-1)에 암시한다. 그 후, 6g-NB-DU(예컨대, 506-1)는 자신의 IRS-UE 매핑 표에서 엔트리를 생성하고, 주기적인 CSI(channel state information) 보고들 또는 주기적인 CSI 보고를 보고하면서, 현재 위치 정보, 이동성 속도, 이동 방향 등을 보고하기 시작하도록 주어진 UE에 요청한다. 주어진 UE가 이러한 추가 정보를 전송할 때, 6g-NB-DU(예컨대, 506-1)는 UE가 IRS 커버리지 영역에 진입했는지 여부 및 UE가 특정 IRS 하에 있는지를 검증한다. 그 후, 6g-NB-DU(예컨대, 506-1)는 연관된 IRS 제어기(예컨대, IRS-1 제어기)와 조정하기 시작하고, UE를 향해 특정 빔을 반사시키기 위해 다수의 안테나 어레이 엘리먼트들을 예비한다. IRS 커버리지 영역에 다수의 UE들이 존재한다면, 6g-NB-DU는 그러한 UE들을 서빙하기 위해 (이미 생성된 빔 이외의) 상이한 빔들이 생성될 필요가 있는지 여부를 결정한다. 실시예에서, 주어진 UE에 대해 반사된 빔만 을 가질지 또는 직접 빔 및 반사된 빔 모두를 가질지를 결정하는 것은 6g-NB-DU에 달려 있을 수 있다. UE가 직 접 및 반사된 빔들 모두에 의해 서빙되는 경우, UE가 IRS 커버리지 영역으로부터 6g-NB-DU(또는 BS)에 의해 서 빙되는 정상 셀 커버리지 영역으로 교차할 때 어떠한 문제들도 존재하지 않을 수 있다. 그러나 UE가 반사된 빔 에 의해서만 서빙되면, 6g-NB-DU는 IRS 커버리지 영역으로부터 정상 셀 커버리지 영역으로 교차하는 UE 움직임 들을 밀접하게 추적하고, 적절한 순간에 셀 내 빔 간 핸드오버를 트리거할 필요가 있다. 실시예에서, 6g-NB-CU-CP는 6g-F1 인터페이스를 통해 IRS 활성화 또는 IRS 비활성화 메시지를 6g- NB-DU에 전송함으로써, 6g-NB-DU에 의한 IRS의 사용을 활성화 또는 비활성화할 수 있다. 6g-NB-CU-CP(예컨대, 510-1)는 필요하다면 추가 과금 목적들로 사용될 수 있는, SNMP/TR069/O1 인터페이스를 통해 EMS에 IRS 세부사항들 및 사용들을 자주 업데이트/송신한다. 도 2a - 도 2f에 대해 설명된 예시적인 사용 사례들이 IRS 지원/전개를 갖는 기능 아키텍처를 사용"}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "하여 구현될 수 있다는 것이 당해 기술분야에서 통상의 지식을 가진 자들에 의해 인식될 수 있다. 일반적으로, 개시된 IRS 아키텍처는 커버리지 확장을 위해 스마트한 거의 수동적인 중계기들로서 사용하고, 용량 개선들을 위해 단일 RF 멀티스트림 송신기로서 사용하고, 그리고 주변 후방 산란 및 공생 라디오와 관련하여 정보 보조 송신에 사용하도록 구현될 수 있다. 예컨대, 도 2a에 도시된 바와 같이, IRS 전개는 RIS 보조 UAV(Unmanned Arial Vehicle)에서 사용되고, 개시된 IRS 네트워크 아키텍처를 구현할 수 있다. 또 다른 예에서, 도 2b에 도시된 바와 같이, IRS 전개가 RIS 보조 밀리미터 파 통신에 사용되며, 개시된 IRS 네트 워크 아키텍처를 구현할 수 있다. 또 다른 예에서, 도 2c에 도시된 바와 같이, IRS 전개가 RIS 보조 SWIPT(simultaneous wireless information and power transfer)에 사용되며, 개시된 IRS 네트워크 아키텍처를 구현할 수 있다. 또 다른 예에서, 도 2d에 도시된 바와 같이, IRS 전개가 RIS 보조 물리 계층 보안에 사 용되며, 개시된 IRS 네트워크 아키텍처를 구현할 수 있다. 또 다른 예에서, 도 2e에 도시된 바와 같이, IRS 전 개가 RIS 보조 모바일 에지 컴퓨팅에 사용되며, 개시된 IRS 네트워크 아키텍처를 구현할 수 있다. 또 다 른 예에서, 도 2f에 도시된 바와 같이, IRS 전개가 RIS 보조 D2D(device to device) 시스템들에 사용되며, 개시된 IRS 네트워크 아키텍처를 구현할 수 있다. 도 5b는 실시예에 따른 네트워크 디바이스를 예시한다. 도 5a를 참조하여 설명된 6G 네트워크 또 는 5G 네트워크의 하나 이상의 컴포넌트들은 제안된 네트워크 디바이스로서 통합 및 구현될 수 있다. 실시예에서, 네트워크 디바이스는 메모리와 결합된 하나 이상의 프로세서들을 포함할 수 있으며, 메모리는 하나 이상의 프로세서들에 의해 실행될 때 네트워크 디바이스로 하여금, 개시된 IRS 아 키텍처를 구현하게 할 수 있는 명령들을 저장할 수 있다. 하나 이상의 프로세서(들)는 하나 이상의 마이 크로프로세서들, 마이크로컴퓨터들, 마이크로컨트롤러들, 에지 또는 포그(fog) 마이크로컨트롤러들, 디지털 신 호 프로세서들, 중앙 프로세싱 유닛들, 논리 회로부들, 및/또는 동작 명령들에 기초하여 데이터를 프로세싱하는 임의의 디바이스들로서 구현될 수 있다. 다른 능력들 중에서, 하나 이상의 프로세서(들)는 네트워크 디바 이스의 메모리에 저장된 컴퓨터 판독 가능 명령들을 페치(fetch) 및 실행하도록 구성될 수 있다. 메 모리는 네트워크 서비스를 통해 데이터 패킷들을 생성 또는 공유하도록 페치 및 실행될 수 있는 하나 이상 의 컴퓨터 판독 가능 명령들 또는 루틴들을 비-일시적 컴퓨터 판독 가능 저장 매체에 저장하도록 구성될 수 있 다. 메모리는 예컨대, RAM과 같은 휘발성 메모리, 또는 EPROM, 플래시 메모리 등과 같은 비-휘발성 메모 리를 포함하는 임의의 비-일시적 저장 디바이스를 포함할 수 있다. 메모리는 IRS 셋업 모듈, IRS 구성 모듈, 자원 커맨드 모듈, IRS 활성화 모듈 , DU 구성 모듈, 근접 암시 모듈 및 RRC 구성 모듈과 같은 하나 이상의 모듈들을 포함한다. IRS 셋업 모듈은 IRS의 초기 셋업을 위한 하나 이상의 단계들 또는 프로시저들(예컨대, 700)을 실행하도록 구성된다. IRS 구성 모듈은 본 설명에서 나중에 상세히 설명되는 바와 같이, IRS의 구성을 위 한 하나 이상의 단계들 또는 프로시저들(예컨대, 706)을 실행하도록 구성된다. 자원 커맨드 모듈은 UE와 의 통신을 위해 IRS의 안테나 어레이 엘리먼트들(또는 다른 자원들)의 예비를 커맨드하기 위한 하나 이상의 단 계들 또는 프로시저들(예컨대, 708)을 실행하도록 구성된다. IRS 활성화 모듈은 IRS를 활성화 또는 비활성화하기 위한 하나 이상의 단계들 또는 프로시저들(예컨대, 710, 720)을 실행하도록 구성된다. DU 구성 모듈 은 전개된 IRS들의 최신 세트 및 이들의 세부사항들을 표시하는 하나 이상의 단계들 또는 프로시저들(예컨 대, 712)을 실행하도록 구성된다. 근접 암시 모듈은 특정 IRS 커버리지들의 주변에서 하나 이상의 UE들 (예컨대, 718)이 검출될 때마다 하나 이상의 단계들 또는 프로시저들(예컨대, 716)을 실행하도록 구성된다. RRC 구성 모듈은 RRC(Radio Resource Control) 연결 재구성을 위한 하나 이상의 단계들 또는 프로시저들 을 실행하도록 구성된다. RRC 연결 재구성 프로시저는, UE로부터 수신된 하나 이상의 측정 보고들에 UE의 위치 정보를 부가하기 위해 측정 제어를 구성하는 데 사용된다. 실시예에서, 위에서 설명된 하나 이상의 모듈들은 6G 네트워크와 관련하여 본 명세서에서 설명되는 하나 이상의 기능들, 단계들, 프로시저들을 수행하도록 구성될 수 있다. 예컨대, 6G 네트워크와 하나 이상의 IRS들 사이에서 통신 프로토콜(및 그의 프로토콜 스택)을 구현하기 위한 모든 단계들이 네트워크 디바이스에 의 해 수행될 수 있다. 더욱이, 하나 이상의 IRS들의 구성 및/또는 셋업에 수반되는 단계들, 프로시저들이 또한 네트워크 디바이스에 의해 수행될 수 있다. 더욱이, 측정 보고들을 주기적으로 전송하도록 UE를 셋업하는 단계들 또는 프로시저들은 네트워크 디바이스에 의해, 예컨대 RRC 구성 모듈에 의해 수행될 수 있다. 추가로, IRS에 대한 기울기들(즉, 기울기 정보)을 결정하기 위해 UE로부터의 측정 보고들을 프로세싱 및 분석하기 위한 단계들 또는 프로시저들이 네트워크 디바이스에 의해 수행될 수 있다. 상이한 노드들 또는 모듈들이 개시된 IRS 아키텍처들을 제공하기 위한 다양한 기능들 및 단계들을 수행하는 것으로 설명되었을 수 있지만, 기능들 중 전부 또는 일부가 하나 이상의 네트워크 디바이스들에 의해 수행될 수 있다고 인식될 수 있다. 예컨대, 네트워크 디바이스는, 하나 이상의 프로세서들에 의해 실행될 때 네트워크 디바이스로 하여금, 하나 이상의 UE들로부터 수신된 제1 세트의 정보에 적어도 부분적으로 기초하여 하나 이상의 IRS들과 연관된 IRS 기울기 정보를 컴퓨팅하게 하는 한 세트의 명령들을 저장하는 메모리와 결합된 하나 이상의 프 로세서들을 포함하는 6G 가능 네트워크 디바이스일 수 있다. 제1 세트의 정보는 하나 이상의 UE들로부터 수신된 SINR(signal-to-noise-plus-interference ratio) 정보, RSRP(Reference Signal Received Power) 정보 및 RSRQ(Reference Signal Received quality) 정보 중 하나 이상을 포함한다. 하나 이상의 프로세서들은 추가로 네트워크 디바이스로 하여금, 컴퓨팅된 IRS 기울기 정보를 네트워크 인터페이스를 통해 하나 이상의 IRS들에 통신하게 하며, IRS 기울기 정보는 하나 이상의 IRS들의 하나 이상의 동작 양상들을 제어하는 데 사용된다. 하나 이상의 IRS들의 하나 이상의 동작 양상들은 기계적 양상들, 이를테면 기계적 기울기(그러나 이에 제한되지 않음)를 포함한다. 실시예에서, 하나 이상의 IRS들의 하나 이상 의 동작 양상들은 디지털 양상들, 이를테면 디지털 기울기를 포함한다. 실시예에서, 하나 이상의 IRS들의 하나 이상의 동작 양상들은 송신 전력과 같은(그러나 이에 제한되지 않음) 전기적 양상들을 포함한다. 하나 이상의 IRS들 각각은 복수의 타일(tile)들 또는 패널들을 포함한다고 인식될 수 있다. 예시적인 실시예에서, 하나 이 상의 IRS들의 개시된 동작 양상들은 다양한 입도 레벨들로, 예컨대 타일 레벨, 패널 레벨 등에서 제어될 수 있 다. 실시예에서, 하나 이상의 프로세서들은 추가로 네트워크 디바이스로 하여금, 하나 이상의 IRS 들의 위치, 하나 이상의 UE들의 위치, 및 하나 이상의 UE들로부터의 CQI(channel quality indicator) 정보 중 하나 이상에 기초하여 IRS 기울기 정보를 컴퓨팅하게 하며, IRS 기울기 정보는 하나 이상의 IRS들에 대한 빔 형 성을 표시한다. 실시예에서, 하나 이상의 프로세서들은 추가로 네트워크 디바이스로 하여금, IRS 기울기 정보 를 프리코딩 행렬 또는 빔 형성 또는 IRS 기울기 행렬로서 컴퓨팅하게 하는데, IRS 기울기 정보는 하나 이상의 IRS들 각각으로부터 하나 또는 다수의 공간적으로 지향적인 신호들을 동시에 송신하는 데 사용되며, 하나 이상 의 IRS들 각각은 복수의 안테나들을 포함한다. 실시예에서, 하나 이상의 IRS 송신 어레이의 모든 각각의 안테 나는 개개의 IRS 기울기 정보에 기초하여 디지털 도메인에서 설계된 상이한 신호를 방출하도록 구성된다. 실시 예에서, 하나 이상의 IRS들은, 하나 이상의 UE들 중 의도된 UE를 향한 지향성을 제공하고 대응하는 송신 전력을 선택하기 위해 네트워크 디바이스에 의해 제공된 프리코딩 행렬 또는 빔 형성 행렬을 적용한다. 실시예에서, 하나 이상의 IRS들은 IRS 기울기 정보를 사용하여, 안테나들 각각에 대한 디지털 기울기 및 기계적 기울기를 컴퓨팅하고 안테나들 각각에 전력 및 위상들을 할당한다. 실시예에서, 하나 이상의 프로세서 들은 추가로 네트워크 디바이스로 하여금, 데이터베이스에서 인코딩된 사전 지식을 통해 또는 네트워 크 인터페이스를 통해 하나 이상의 IRS들과 네트워크 디바이스 사이에 확립된 시그널링 메커니즘을 통해 하나이상의 IRS들을 인식하게 한다. 실시예에서, 하나 이상의 프로세서들은 추가로 네트워크 디바이스로 하여금, 셋업 프로세스 동안 새로운 IRS와 네트워크 디바이스 간의 물리적 연결을 통해 활성화될 때 새로운 IRS 로부터 핸드셰이크 신호를 수신하게 한다. 실시예에서, 하나 이상의 프로세서들은 추가로 네트워크 디바이스로 하여금 IRS-셀 매핑 표에 서 엔트리를 생성하게 하며, 엔트리는 IRS-ID, 새로운 IRS에 의해 지원되는 안테나 엘리먼트들의 수에 관한 IRS 능력들, 기계적/전기적 기울기 지원, 능동/수동 지원, IRS의 고도, 방위각, 고도, 커버리지 능력들과 같은 지리 적 위치, 공유 가능/공유 불가능 상태, 셀 에지/셀 중간/셀 중심 영역들에서의 전개 세부사항들을 포함하는 하 나 이상의 필드들을 포함한다. 실시예에서, 네트워크 인터페이스는 네트워크 디바이스와 하나 이상의 IRS들 사 이에 확립되는 네트워크 인터페이스 프로토콜을 구현하며, 여기서 네트워크 인터페이스 프로토콜은 핸드셰이크 신호 스키마를 포함한다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "[00100] 실시예에서, 네트워크 인터페이스는 마이크로컨트롤러를 통해 네트워크 디바이스와 하나 이상의 IRS들 사이의 직접 연결을 통해 확립된다. 실시예에서, 하나 이상의 프로세서들은 추가로 네트워크 디바 이스로 하여금, 네트워크 디바이스에 의해 서비스되는 주어진 구역에 대한 사용자 분포, 사용자 프로파일 들, SINR 프로파일들 및 BLER(Block Error Rate) 프로파일들 중 하나 이상에 기초하여 SINR 목적을 달성하는 데 필요한 IRS 기울기 정보를 컴퓨팅하게 한다. 실시예에서, 하나 이상의 프로세서들은 추가로 네트워크 디 바이스로 하여금, 미리 구성된 주기로 하나 이상의 IRS들에 하나 이상의 제어 메시지들을 전송하게 하며, 하나 이상의 IRS들은 하나 이상의 제어 메시지들을 사용하여 네트워크 디바이스에 의해 제어된다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "[00101] 실시예에서, 진행 중인 설명의 범위를 벗어나지 않으면서 동일한 또는 유사한 기능을 달성하도록 다양 한 모듈들이 함께 통합될 수 있거나 다수의 네트워크 디바이스들에서 구현될 수 있다. 예컨대, 네트워크 디바이스는 IRS를 지원하는 차세대 RAN(예컨대, 6G RAN)의 하나 이상의 노드들에 대응한다. 실시예에서, 네트워크 디바이스는 6g-NB-DU들(6G 기지국 노드 DU들) 및/또는 6g-NB-CU들(6G 기지국 노드 CU들) 또는 이들의 통합에 대응할 수 있다. 또 다른 실시예에서, 네트워크 디바이스는 진행 중인 설명의 맥락에서 IRS 및/또는 UE와 통신하도록 구성될 수 있는 BS(base station) 또는 임의의 그러한 네트워크 엔티티에 대응할 수 있다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "[00102] 실시예에서, 네트워크 디바이스는 도 7a - 도 7g를 참조하여 설명된 바와 같이 IRS와의 네트워크 인터페이스 프로토콜 확립을 가능하게 한다. 실시예에서, DU-I 인터페이스(또는 DU I/F)는 본 명세서에 기술된 다양한 셋업 프로시저들을 사용하여 네트워크 디바이스와 IRS 사이에 확립된다. 제안된 네트워크 인터페이스를 사용하여, 네트워크 디바이스는 네트워크 디바이스에 의해 서비스되는 특정 구역 또는 영역 내의 하 나 이상의 UE들에 신호들을 반사시키기 위해 이용 가능한 IRS의 셋업을 가능하게 할 수 있다. 최적의 성능을 위한 기계적 또는 디지털 기울기에 대한 IRS의 하나 이상의 파라미터들의 매핑이 미리 결정되어 네트워크 디바 이스에 저장된다. 네트워크 디바이스는 미리 결정된 매핑에 적어도 부분적으로 기초하여 런타임 (run-time)에서 최적의 기계적 또는 디지털 기울기를 결정하기 위해 하나 이상의 UE들로부터 하나 이상의 측정 보고들을 수신한다. 네트워크 디바이스는 제안된 네트워크 인터페이스를 사용하여 최적의 기계적 또는 디 지털 기울기 정보를 IRS에 전송하고, IRS 제어기는 최적의 기울기 정보를 사용하여 IRS 패널들 또는 IRS 타일들 을 재정렬한다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "[00103] 또 다른 실시예에서, 네트워크 디바이스는 IRS 아니면 다른 것과 연관된 하나 이상의 파라미터들 의 측정을 수행하도록 UE에 명령하기 위한 모든 기능들, 단계들, 프로시저들을 수행한다. 예컨대, 네트워크 디 바이스는 임의의 이러한 측정들을 트리거하도록 UE에서 트리거 이벤트들을 제공/구성할 수 있다. 이러한 측정은 UE에 의해 수행되고 하나 이상의 측정 보고들의 형태로 네트워크 디바이스에 전송될 수 있다. 네 트워크 디바이스는 하나 이상의 측정 보고들에 기초하여 IRS 제어기에 통신될 기울기 정보 또는 데이터를 결정할 수 있다. 또 다른 실시예에서, 네트워크 디바이스는, IRS 제어기가 네트워크 디바이스에 대 한 IRS 자원들의 일부를 예비하는 방식으로 IRS의 구성을 가능하게 한다. 마찬가지로, 다른 네트워크 디바이스 는 본 명세서에 설명된 바와 같이 IRS 제어기와 통신함으로써 IRS 자원들의 또 다른 부분을 구성함으로써 IRS의 자원들을 공유할 수 있다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 11, "content": "[00104] 실시예에서, 도 5c에 도시된 바와 같이, 하나 이상의 IRS(Intelligent Reflecting Surface)들 및 하나 이상의 네트워크 디바이스들과 통신하는 UE(User Equipment)가 개시된다. 도 5c는 본 개시내용의 실시예에 따 른 예시적인 UE를 예시한다. 실시예에서, UE 또는 (다양한 도면들에 도시된) 컴퓨팅 디바이스는 임의의 운영 시스템 상에 상주하는 한 세트의 실행 가능 명령들을 통해 네트워크 디바이스 및/또는 주어진 IRS와통신할 수 있다. 실시예에서, 전자 디바이스들은 휴대 전화, 스마트폰, VR(virtual reality) 디바이스들, AR(augmented reality) 디바이스들, 랩톱, 범용 컴퓨터, 데스크톱, 개인용 디지털 보조기기, 태블릿 컴퓨터, 메 인프레임 컴퓨터, 또는 임의의 다른 컴퓨팅 디바이스와 같은, 임의의 전기, 전자, 전기-기계 또는 장비 또는 위 의 디바이스들 중 하나 이상의 디바이스들의 조합을 포함할 수 있으며(그러나 이에 제한되지 않음), 컴퓨팅 디 바이스는 시각적 보조 디바이스, 이를테면 카메라, 오디오 보조기(audio aid), 마이크로폰, 키보드, 사용자로부 터 입력을 수신하기 위한 입력 디바이스들, 이를테면 터치 패드, 터치 가능 스크린(touch-enabled screen), 전 자 펜(pen) 등을 포함하는(그러나 이에 제한되지 않음) 하나 이상의 내장형 또는 외부에 결합된 액세서리 (accessory)들을 포함할 수 있다. 전자 디바이스들은 언급된 디바이스들에 제한되지 않을 수 있으며 다양한 다 른 디바이스들이 사용될 수 있다고 인식될 수 있다. 스마트 컴퓨팅 디바이스는 데이터 및 다른 개인/민감 정보 를 저장하기 위한 적절한 시스템들 중 하나일 수 있다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 12, "content": "[00105] 실시예에서, UE는 메모리에 결합된 프로세서를 포함한다. 메모리는 측정 모듈 , 트리거 포인트 모듈, 식별 모듈, 보고 모듈 및 GPS/위치 모듈과 같은 하나 이상의 모듈들을 포함한다. 메모리 내의 하나 이상의 모듈들은 예컨대, 도 8a - 도 8c를 참조하여 본 명세서에 개시된 프로시저들/단계들의 UE 측에 속하는 하나 이상의 기능들을 수행하도록 구성될 수 있다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 13, "content": "[00106] 예로서, 측정 모듈은 BS(또는 네트워크 디바이스)로부터 수신된 신호 강도 및 IRS로부터 수신된 신호 강도와 연관된 하나 이상의 파라미터들을 측정하도록 구성될 수 있다. 또 다른 예에서, 트리거 포인트 모 듈은 측정 모듈에 의한 하나 이상의 파라미터들의 측정을 트리거하기 위한 하나 이상의 트리거 포인 트들의 설정 또는 구성을 가능하게 하도록 구성될 수 있다. 식별 모듈은 IRS ID 등과 같은 식별 파라미터 들에 기초하여 IRS의 식별을 가능하게 하도록 구성될 수 있다. 보고 모듈은 하나 이상의 미리 결정된 필 드들을 갖는 규정된 포맷으로 하나 이상의 측정 보고들을 생성 및 공유하도록 구성될 수 있다. GPS/위치 모듈 은 측정 보고들에 포함시키기 위해 위치 특정 정보를 결정하거나 다른 모듈들에 제공하도록 구성될 수 있 다. 모듈들 중 하나 이상은 진행 중인 설명의 범위를 벗어나지 않으면서 단일 모듈을 형성하도록 통합될 수 있 다. 표준 UE의 다른 컴포넌트들 및 모듈들은 간결성을 위해 도면에 도시되거나 본 명세서에서 설명되지 않는다. 예컨대, 통신 컴포넌트들, 이를테면 안테나들, 보고들 및 연관된 데이터를 위한 메모리 저장소 등은 본 명세서에서 설명되는 UE의 일부인 것으로 가정된다. UE의 특정 모듈들은 본 명세서에 개시된 IRS 아키 텍처를 구현하기 위해 또는 그의 개시된 IRS 메커니즘들의 다양한 실시예들을 지원하기 위해 네트워크 디바이스 또는 BS로부터의 하나 이상의 메시지들에 응답하도록 구성될 수 있다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 14, "content": "[00107] 위에서 설명된 바와 같이, UE는 하나 이상의 프로세서들에 의해 실행될 때 네트워크 디바이스로 하여금 제1 세트의 정보를 송신하게 하는 한 세트의 명령들을 저장하는 메모리에 결합된 하나 이상의 프로세서 들을 포함한다. 실시예에서, 제1 세트의 정보는 하나 이상의 네트워크 디바이스들에 대해 UE와 연관된 SINR(signal-to-noise-plus-interference ratio) 정보, RSRP(Reference Signal Received Power) 정보, RSRQ(Reference Signal Received quality) 정보, 위치 및 CQI(Channel Quality Indicator) 정보 중 하나 이상 을 포함한다. 하나 이상의 네트워크 디바이스들은 하나 이상의 UE들로부터 수신된 제1 세트의 정보에 적어도 부분적으로 기초하여 하나 이상의 IRS들과 연관된 IRS 기울기 정보를 컴퓨팅하도록 구성된다. 하나 이상의 네 트워크 디바이스들은 컴퓨팅된 IRS 기울기 정보를 네트워크 인터페이스를 통해 하나 이상의 IRS들에 통신하도록 구성되며, IRS 기울기 정보는 하나 이상의 IRS들의 하나 이상의 동작 양상들을 제어하는 데 사용된다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 15, "content": "[00108] 도 6은 본 개시내용의 실시예에 따른, DUI(DU-IRS) 인터페이스 프로토콜 스택을 예시한다. 도시 된 바와 같이, 프로토콜 스택은 라디오 제어 계층들 및 전송 제어 계층들을 포함한다. 라디오 제어 계층들은 (DU-IRS) DUI-AP(Application protocol) 계층을 포함한다. 전송 제어 계층들은 물리 계층 , 데이터 링크 계층, IP 계층 및 스트림 제어 송신 프로토콜을 포함한다. 실시예에서, 네 트워크 디바이스 또는 BS는 본 명세서에 설명되는 바와 같이 구성, 셋업 및 제어 목적들로 BS와 IRS 간의 통신을 가능하게 하도록 DUI(DU-IRS) 프로토콜 스택을 확립한다. 6G 네트워크들과 관련하여 통신 프로토콜을 지원하기 위해 특정 포맷을 갖는 다양한 구성 메시지들이 사용될 수 있다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 16, "content": "[00109] 실시예에서, DUI는 DU와 IRS 제어기 간의 논리적 또는 물리적 인터페이스로서 구현될 수 있다. 개시된 DUI 프로토콜 스택은 DUI 인터페이스의 양단에서 구현된다. 예컨대, 하나의 구현은 DU 측에 있고, 다른 구현은 IRS 제어기 측에 있다. 물리 계층, 데이터 링크 계층, IP 계층 및 SCTP 계층을 포함하는 전송 네트워크 계층은"}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 17, "content": "당해 기술분야에 알려진 표준 정의들에 따라 구현될 수 있다. 실시예에서, DU-IRS 인터페이스 애플리케이션 컴 포넌트인 DUI-AP를 포함하는 라디오 네트워크 계층은 계층 3 제어 프로토콜을 구현한다. DUI-AP와 연관된 프로 시저들 및 메시지들은 도 7a - 도 7d에 도시된 시퀀스도들을 참조하여 상세히 설명될 것이다. 예컨대, 프로토콜 통신 메시지들은 도 7a에 도시된 바와 같은 \"DUI 링크 셋업 요청(DUI LINK SETUP REQUEST)\" 및 \"DUI 링크 셋업 응답(DUI LINK SETUP RESPONSE)\", 도 7b에 도시된 바와 같은 \"DUI 링크 구성 업데이트(DUI LINK CONFIGURATION UPDATE)\" 및 \"DUI 링크 구성 업데이트 확인(DUI LINK CONFIGURATION UPDATE CONFIRM)\", 도 7c에 도시된 바와 같은 \"IRS 자원 커맨드(IRS RESOURCE COMMAND)\" 및 \"IRS 자원 커맨드 수락(IRS RESOURCE COMMAND ACCEPT)\", 도 7d에 도시된 바와 같은 \"IRS 활성화 커맨드(IRS ACTIVATION COMMAND)\" 및 \"IRS 활성화 커맨드 수 락(IRS ACTIVATION COMMAND ACCEPT)\"을 포함한다. 제안된 프로토콜 통신 메시지들은 제안된 DUI-AP 프로토콜 의 일부이다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 18, "content": "[00110] 실시예에서, DUI-AP는 도 7a - 도 7g에 예시된 바와 같이 DUI I/F에서 사용되는 프로시저들의 초기 세 트에 의해 실현될 수 있다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 19, "content": "[00111] 도 7a는 DUI 링크를 확립하기 위해 DU I/F 셋업 프로시저가 IRS 제어기에 의해 6g-NB- DU 쪽으로 개시되는 것을 예시한다. 실시예에서, 새로운 IRS가 나타나거나 활성 또는 이용 가능하게 될 때, 대응하는 IRS 제어기(예컨대, 704)는 자신의 능력들을 셋업 요청 메시지를 통해 6g-NB-DU에 공유/전송 한다. 6g-NB-DU는 새로운 IRS를 인증하고 고유 IRS ID를 할당하며, 셋업 응답 메시지를 전송함으로써 IRS 제어기에 \"활성화\" 명령을 내린다. IRS 제어기는 자신의 표들을 ID들로 업데이트하고, 상태는 \"활성\"으로 설정된다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 20, "content": "[00112] 도 7b는 DU I/F 구성 업데이트 프로시저를 예시한다. 이 프로시저는 자신의 능력들의 변화들을 업데이트하기 위해 IRS 제어기에 의해 6g-NB-DU 쪽으로 개시된다. 실시예에서, IRS 제어기는 자신의 업데이트된 능력들을 \"구성 업데이트\" 메시지를 통해 6g-NB-DU에 공유한다. 6g-NB-DU는 자신 의 IRS-UE 표를 업데이트하고, 업데이트들을 연관된 6g-NB-CU-CP에 전송하며, \"구성 업데이트 확인\" 메시지를 전송함으로써 IRS 제어기에 대한 업데이트들에 기초하여 \"활성화/비활성화\" 명령을 내린다. 그 후, IRS 제어기는 수신된 커맨드에 따라 계속해서 \"활성화/비활성화\" 상태에 있다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 21, "content": "[00113] 도 7c는 IRS 자원 커맨드 프로시저를 예시한다. 이 프로시저는 6g-NB-DU와의 통신을 위해 안테나 어레이 엘리먼트들의 예비를 명령하고 그리고 또한 UE와 직접 통신하도록 6g-NB-DU에 의해 IRS 제 어기 쪽으로 개시된다. 따라서 (주어진 IRS의) 안테나 어레이의 하나의 세트는 특정 UE에 대한 6g-NB- DU와의 통신들을 위해 예비될 수 있고, 안테나 어레이의 다른 세트는 UE와의 직접 통신들을 위해 예비된다. 여기서, 6g-NB-DU는 수평 및 수직 빔 폭, 수평 및 수직 빔 조향 포지션, 주어진 UE가 빔을 향 해 가리킬 고도 등과 같은 세부사항들을 공유할 수 있다. 따라서 6g-NB-DU는 IRS 자원 커맨드 메시지를 IRS 제어기에 전송한다. IRS 제어기는 수신된 커맨드에 따라 IRS의 안테나 어레이를 구성하고, 요구된 안 테나 어레이 엘리먼트들을 예비하고, IRS 자원 커맨드 수락 메시지를 전송함으로써 6g-NB-DU에 응답한다. IRS 자원 커맨드는 또한, 기지국으로부터의 신호들의 반사에서 필요한 방향성을 달성하기 위해 IRS가 이용해야 하는 각각의 엘리먼트에 대한 전력 및 위상을 제공하는 프리코딩된 행렬을 포함할 수 있다. IRS 자원 커맨드 수락 메시지의 수신 시에, 6g-NB-DU는 IRS를 향해 빔을 송신하기 시작하고, UE를 향해 직접적인 빔을 송신 하는 것을 계속할 수도 또는 계속하지 않을 수도 있다. IRS 제어기는 6g-NB-DU로부터 빔을 수신하기 시작하고, 직접적인 빔을 변환하여 UE를 향해 송신하기 시작하도록 IRS를 구성한다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 22, "content": "[00114] 도 7d는 IRS 활성화 커맨드 프로시저를 예시한다. 이 프로시저는 IRS를 활성화 또는 비활성화하 기 위해 6g-NB-DU에 의해 IRS 제어기 쪽으로 개시된다. 6g-NB-DU는 IRS 활성화 커맨드(활성화 /비활성화, 유효 시간 등) 메시지를 IRS 제어기에 전송한다. IRS 제어기는 IRS 활성화 커맨드 수락 메시지를 6g-NB-DU에 전송한다. IRS 제어기는 수신된 커맨드에 따라 IRS의 상태를 설정하도록 구성 된다. 실시예에서, 이 프로시저는 에너지 절약 시나리오들 동안 그리고 유지보수 시나리오들 동안 주로 사용된 다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 23, "content": "[00115] 도 7e - 도 7g는 IRS를 지원하기 위한 프로시저들의 초기 세트를 예시한다. 도 7e는 DU 구성 업데이트 프로시저를 예시한다. 이 프로시저는 6g-NB-DU에 의해 6g-NB-CU-CP 쪽으로 개시되어, 전개된 IRS의 최신 세트 및 이들의 세부사항들을 표시한다. 실시예에서, 6g-NB-CU-CP는 새로운 그러한 IRS들에 대한 엔트리들을 생성하고, 각각에 대해 고유 IRS ID를 할당하며, IRS-셀 매핑 표에 이미 존재하는 다른 IRS들 의 세부사항들을 업데이트한다. 6g-NB-CU-CP는 새롭게 확립된 IRS와 연관된 새롭게 할당된 IRS-ID들의 리 스트로 DU 구성 업데이트 확인으로 응답한다. 6g-NB-DU는 자신의 표를 ID들로 업데이트하고, 개개의 IRS 들의 상태는 활성으로 설정될 것이다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 24, "content": "[00116] 도 7f는 IRS 근접 표시 프로시저를 예시한다. 이 프로시저는 6g-NB-CU-CP에 의해 6g- NB-DU 쪽으로 개시되어, 하나 이상의 UE들(예컨대, 718)이 특정 IRS 커버리지들의 부근에서 검출될 때마다, 그러한 UE들에 대해 특정 IRS와의 조정을 개시하도록 표시한다. 6g-NB-DU는 IRS들의 리스트와 연 관된 UE들의 리스트, 예비된 IRS 자원들 등과 함께 IRS 근접도 표시를 수신한다. 6g-NB-DU는 IRS 근접도 표시 메시지를 수신한 후, 자신의 표를 개개의 IRS들과의 매핑에 따른 UE들의 리스트로 업데이트한다. 6g-NB- DU는 CSI(Channel State Information)와 함께 자신의 위치 정보를 전송하도록 그러한 UE들(예컨대, 718) 에 요청하는 것을 추가로 개시한다. 6g-NB-DU 내의 스케줄러 모듈은 UE들(예컨대, 718)의 특정 세트를 향 한 자신의 사용을 위해 예비된 IRS 자원들을 사용하기 시작한다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 25, "content": "[00117] 도 7g는 IRS 활성화 커맨드 프로시저를 예시한다. 이 프로시저는 IRS를 활성화 또는 비활성화하 기 위해 6g-NB-CU-CP에 의해 6g-NB-DU 쪽으로 개시된다. 도시된 바와 같이, 6g-NB-CU-CP는 IRS 활성화 커맨드[활성화/비활성화, 유효 시간 등]를 6G-nb-du에 전송한다. 6g-NB-DU는 앞서 설명 된 바와 같이 IRS 제어기 쪽으로 IRS 활성화/비활성화 프로시저를 개시한다. 6g-NB-DU는 IRS 활성화 커맨 드 수락 메시지를 6G-nb-cu-cp에 전송한다. 이 프로시저는 주로 에너지 절약 시나리오들 동안 그리고 또 한 유지보수 시나리오들 동안 사용될 수 있다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 26, "content": "[00118] 실시예에서, IRS를 지원하기 위한 프로시저들의 초기 세트가 RRC(Radio Resource Control) 연결 재구 성을 사용하여 6g-NB-CU-CP에 의해 수행된다. RRC 연결 재구성 프로시저는 하나 이상의 측정 보고들에 UE의 위 치 정보를 부가하도록 측정 제어를 구성하기 위해 6g-NB-CU-CP에 의해 사용된다. 이러한 요청을 수신한 후, UE 는 모든 후속 측정 보고들에서 자신의 위치 정보를 부가하기 시작한다. 대안적인 실시예에서, 더 앞선 근접도 표시 프로시저들에 따라, UE가 IRS 커버리지 영역에 근접하거나 또는 IRS 커버리지 영역에 진입하는 것을 검출 할 때, UE는 측정 보고들을 통해 또는 근접도 표시 메시지를 사용하여 위치 정보를 부가하기 시작할 수 있다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 27, "content": "[00119] 본 개시내용은 5G 이상의 네트워크들에서 IRS(Intelligent Reflecting Surfaces)를 구현하기 위한 시 스템 및 방법에 관한 것이다. 시스템은 시스템으로 하여금 IRS와 네트워크 인터페이스 프로토콜을 확립하게 할 수 있는 하나 이상의 프로세서들을 포함하는 네트워크 디바이스를 포함할 수 있다. 실시예에서, 네트워크 디바 이스와 IRS 사이에 DU-I 인터페이스가 확립되며, 이를 사용하여 다양한 셋업 프로시저들이 실행될 수 있다. 제 안된 네트워크 인터페이스를 사용하여, 네트워크 디바이스는 특정 구역 또는 영역 내의 하나 이상의 UE들에 신 호들을 반사시키기 위해 이용 가능한 IRS의 셋업을 가능하게 할 수 있다. 최적의 성능을 위한 기계적 또는 디 지털 기울기에 대한 IRS의 하나 이상의 파라미터들의 매핑이 미리 결정되어 네트워크 디바이스에 저장된다. 네 트워크 디바이스는 미리 결정된 매핑에 적어도 부분적으로 기초하여 런타임에서 최적의 기계적 또는 디지털 기 울기를 결정하기 위해 하나 이상의 UE들로부터 하나 이상의 측정 보고들을 수신한다. 네트워크 디바이스는 제 안된 네트워크 인터페이스를 사용하여 최적의 기계적 또는 디지털 기울기 정보를 IRS에 전송하고, IRS 제어기는 최적의 기울기 정보를 사용하여 자신의 패널들 또는 타일들을 재정렬한다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 28, "content": "[00120] 비-일시적 CRM(computer readable medium)의 실시예들이 개시된다. CRM은 그 위에 저장된 하나 이상 의 명령들을 포함하며, 하나 이상의 명령들은 프로세서에 의해 실행될 때 프로세스로 하여금 한 세트의 단계들 을 수행하게 한다. 예컨대, 한 세트의 명령들의 실행은 프로세서로 하여금, 하나 이상의 UE들로부터 수신된 제 1 세트의 정보에 적어도 부분적으로 기초하여 하나 이상의 IRS들과 연관된 IRS 기울기 정보를 컴퓨팅하게 하고, 그리고 컴퓨팅된 IRS 기울기 정보를 네트워크 인터페이스를 통해 하나 이상의 IRS들에 통신하게 하며, IRS 기울 기 정보는 하나 이상의 IRS들의 하나 이상의 동작 양상들을 제어하는 데 사용된다. 실시예에서, 제1 세트의 정 보는 SINR(signal-to-noise-plus-interference ratio) 정보, RSRP(Reference Signal Received Power) 정보, RSRQ(Reference Signal Received quality) 정보, 위치 및 CQI(Channel Quality Indicator) 정보 중 하나 이상 을 포함한다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 29, "content": "[00121] 도 8a - 도 8c는 본 명세서에 개시된 바와 같이 IRS 아키텍처를 지원하기 위한 한 세트의 UE 프로시저 들을 예시한다. 실시예에서, B5G 네트워크(5G를 넘어선, 즉 5G/6G 네트워크들)에 대한 핸드오버 메커니즘이 개 시되며, IRS 제어기는 또한 위에서 설명된 바와 같은 네트워크 아키텍처의 일부이다. 그러한 네트워크는 서빙 셀의 채널 품질을 표시하기 위해 RSRP(Reference Signal Received Power), RSRQ(Reference Signal Received quality), SINR 및 CQI(Channel Quality Indicator) 또는 CSI(Channel State Information) 보고의 형태로 UE 에 의해 지각되는 바와 같은 원시 전력을 표시하는 RF 보고를 포함하는 하나 이상의 측정 보고들을 수집할 필요 가 있다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 30, "content": "[00122] BS(또는 네트워크 디바이스)에 의해 수집된 하나 이상의 측정 보고들은, 주어진 UE(예컨대, UE)를 동일한 셀 커버리지 내의 다른 셀 또는 다른 IRS 제어기로 핸드오버하기 위한 적절한 호들을 네트워크가 취하는것을 보조한다(즉, 셀 에지 시나리오). 본 개시내용은 도 8a - 도 8c에 도시된 바와 같은 접근법을 예시하기 위해 다양한 시나리오들을 고려한다. 예컨대, UE1은 이동 중이고 6G-NB-DU-1(즉, 셀 1)에 연결되며 연결/활성 상태에 있다. UE1은 6G-NB-DU-1(셀 1)의 커버리지로부터 멀리 이동하기 시작하고, 이제 IRS-1 커버리지 부근에 있다. 그러한 경우, UE1은 추가 데이터 송신/수신을 위해 IRS-1 제어기로 핸드오버될 필요가 있다. 실시예에 서, 다음의 데이터 포인트들 및 액션의 흐름은 아래에서 언급되는 순서로 고려될 필요가 있다: 1. UE가 (예컨대, IRS-1에 대응하는) IRS 제어기로부터의 파일럿 신호들을 찾고 그런 다음 측정을 시작하기 위 한 트리거 포인트들로 UE가 구성됨. 2. IRS ID를 사용하여 IRS 제어기에 의해 반사된 신호/데이터의 식별. 3. IRS ID가 파일럿 신호의 SIB1 부분을 통해 전송될 필요가 있음. 4. UE가 IRS에 의해 수신된 신호의 RSRP/RSRQ 및 서빙 셀의 CQI/CSI를 측정함. 5. UE가 구성된 트리거 이벤트들 및/또는 주기적인 타이머(timer)에 기초하여 측정 보고를 전송함. 6. 네트워크 측에 설정된 기준들에 기초하여 핸드오버 프로시저가 완료됨."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 31, "content": "[00123] 실시예에서, UE는, UE가 IRS 제어기(예컨대, 704)로부터 파일럿 신호들을 찾고, 이어서 대응하는 측정들을 시작하기 위한 하나 이상의 트리거 포인트들로 구성된다. 이에 따라, UE는 (IRS가 동일한 셀 에지 경 우에 이용 가능하고 핸드오버를 위해 이용 가능한 경우에) 측정을 위한 이벤트 기반 트리거 또는 심지어 주기적 인 타이머 기반 트리거로 구성될 수 있다. 예시적인 실시예에서, 하나 이상의 예시적인 이벤트들은 IRS 측정을 트리거하도록 구성될 수 있다. 이러한 예시적인 이벤트들은 이벤트 I1 - 서빙 셀 RSRP/RSRQ가 미리 구성된 특 정 임계치 아래로 떨어지는 경우를 포함한다. 다른 예시적인 이벤트는 이벤트 I2 - CSI 보고 내의 서빙 셀 CQI 인덱스(index)가 임계치 아래로 떨어지거나 QPSK의 사용으로 이어지는 경우일 수 있다. 또 다른 예시적인 이벤 트는 이벤트 I3 - 이웃 셀이 서빙 셀보다 더 양호한 신호 강도를 제공하는 경우일 수 있다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 32, "content": "[00124] 실시예에서, 이러한 예시적인 이벤트들(즉, I1 내지 I3)은 주어진 대략적인 커버리지를 갖는 주어진 셀 에서의 IRS 이용 가능성에 기초하여 트리거될 수 있다. 다른 실시예에서, 정규 이벤트 A1이 트리거될 필요가 있는지 또는 미리 구성된 이벤트 I1이 트리거될 필요가 있는지를 식별하기 위한 새로운 메커니즘이 제안된다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 33, "content": "[00125] 도 8a는 실시예에 따른, IRS를 지원하기 위한 UE 프로시저를 예시한다. 일 경우에서, UE(802-1)는 주 어진 IRS의 이용 가능성을 공유하고 검증한다. 이벤트 A1 또는 다른 이벤트들(Ax)이 트리거되면, UE(802-1)는 RRC 메시지 컨테이너(container) IEI의 일부로서 정확도 레벨과 함께 위치 정보를 네트워크(CU-CP)와 공유 한다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 34, "content": "[00126] CU-CP는 IRS 이용 가능성의 존재를 확인하고, 이벤트 I1을 구성하거나, 또는 RRC 컨테이너로서 새 로운 RRC 메시지(즉, StartIRSMeas_IE)를 전송하고, 이어서 SIB1에 대해 구성된 DLCCH와 함께 파일럿 신호를 반 사시키기 시작하도록 IRS 제어기를 구성하여, UE가 IRS ID를 검출하고 또한 MR(measurement report)을 준비할 수 있다. 다음으로, UE는 RF를 측정하고, 이벤트(예컨대, I1)가 여전히 유효하고 따라서 이벤트 Ix가 트 리거될 것인지를 확인한다. UE(802-1)가 GPS를 지원하지 않는 경우, UE는 CellID, eCellID, OTDOA 등에 기반 한 C - 평면 또는 U - 평면(SUPL) 방법들 및 측정들을 사용하여 위치 정보를 공유한다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 35, "content": "[00127] 도 8b는 실시예에 따른 RRC 측정 보고를 위한 UE 프로시저를 예시한다. 예컨대, 이벤트 A1이 트리거되 면, UE(802-1)는 위치 정보와 함께 측정 보고를 전송한다. 네트워크 디바이스는, UE(802-1)가 IRS 커버리지 영 역에 있음을 식별하고, 이벤트 I1을 구성하거나, 또는 RRC 컨테이너로서 새로운 RRC 메시지(StartIRSMeas_IE)를 전송하고, 이어서 SIB1에 대해 구성된 DLCCH와 함께 파일럿 신호를 반사시키기 시작하도록 IRS 제어기를 구성하 여, UE(802-1)가 IRS ID를 검출하고 또한 MR을 준비할 수 있다. RRC_MessageContainer IE는 {{StartIRMeas_IE:BOOLEAN{}}에 대응할 수 있다. 유사하게, MR(Measurement Report)은 주어진 UE에 대해 구성 된 주기적인 타이머에 기초하여 또한 수행될 수 있는 구성에 기초하여 UE(802-1)에 의해 전송될 수 있다. 프로 시저는 IRS ID를 사용하여 IRS 제어기에 의해 반사된 신호/데이터의 식별을 포함한다. 셀 ID와 마찬가지로, IRS는 파일럿 신호/SIB1의 일부로 브로드캐스트될 IRS ID를 사용하여 식별될 수 있다. PLMN-IdentityInfo를 포 함하는 SIB1의 일부인 CellAccessRelatedInfo가 획득된다. 이 IE는 주어진 셀의 CellIdentity를 포함한다. 따라서 IRS 제어기의 IRS ID를 전달하기 위해 동일한 IEI가 사용될 것이다. 이는 UE 레벨에서 추가 프로세싱을 위한 IRS 식별자가 된다. 이러한 IRS ID는 셀 ID 대신 전송될 수 있거나, 또는 IRS ID 및 셀 ID와 관련된 DU/CU에 존재하는 매핑 표에 따라 셀 ID와 함께 전송될 수 있다.[00128] 실시예에서, 도 8c를 참조하면, IRS ID가 파일럿 신호의 SIB1 부분을 통해 전송될 필요가 있다. IRS 제어기가 충분한 계산 능력을 가질 것이라고 가정하면, 파일럿 신호를 통해 전송되는 SIB1로 IRS ID를 인코딩하 는 2개의 가능한 방식들이 있을 수 있다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 36, "content": "[00129] 첫 번째 대안으로, IRS ID는 IRS 반사기를 통해 UE에 이를 전송하도록 미리 결정될 때 CU-CP 측 (RRC)에서 SIB1 신호로 프리코딩된다. 이러한 방식으로, IRS는 단지 이전에 수신된 구성에 기초하여 신호를 반 사시킬 수 있다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 37, "content": "[00130] 두 번째 대안으로, IRS ID는, CU-DU(gNodeB)로부터 수신될 때, 이를 디코딩한 후에 SIB1 메시지에 인 코딩되어 삽입되고, 그 다음, 수신된 구성에 따라 자신의 IRS 반사기에 의해 지시된 UE에 이를 전송한다. 일 실시예에서, UE는 IRS에 의해 수신된 신호의 RSRP/RSRQ 및 서빙 셀의 CQI/CSI를 측정한다. UE가 이벤트가 트리거되거나 타이머가 만료된 것을 검출하면, UE는 IRS 반사기로부터의 파일럿 신호에 대해 스니프(sniff)를 시작할 것이고, SIB1을 판독한 후에 IRS ID가 검출된다. IRS ID가 알려지고 원시 전력의 측정이 완료되면, UE는 이를 측정 보고의 일부로 만들고, 이 측정 보고는 CU - CP 내의 RRC 및/또는 CSI 보고의 일부인 DU 내의 다른 MAC 스케줄러에 전송된다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 38, "content": "[00131] MAC 스케줄러로의 CSI - DU 내의 MAC 스케줄러가 CSI 보고를 수신하고, 변조 방식을 QPSK로 감소시키는 것을 식별하면, IRS 커버리지의 이용 가능성에 매핑되는 CSI 보고의 일부가 이용 가능하게 된 위치 정보에 기초 하여, IRS로의 UE의 핸드오버를 위한 RRC를 표시한다. 위치 정보가 UE와 함께 이용 가능하지 않다면, DU 내의 MAC 스케줄러는 DU-CU 인터페이스를 통해 RRC에 연결하여, UE 위치 정보를 얻고, UE 위치 정보가 IRS 커버 리지 하에 있는지를 확인하고, 응답이 예라면, RRC가 핸드오버를 트리거할 수 있다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 39, "content": "[00132] 실시예에서, UE는 네트워크 측에 설정된 기준들에 기초하여 구성되는 트리거 이벤트들 및/또는 완료될 주기적인 타이머 & 핸드오버 프로시저에 기초하여 측정 보고를 전송하도록 구성된다. 실시예에서, 측정 보고는 2개의 타입들 - 수신된 구성에 기초하여 CU-CP의 RRC에 대한 NR 측정 보고 및 서빙 셀 상에서의 MAC 스케줄러로 의 CSI 보고일 수 있다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 40, "content": "[00133] CQI 인덱스가 구성된 임계치 미만으로, 즉 QPSK의 사용을 반영하는 그리고 TP를 유지하기 위한 인덱스 로 떨어지는 CSI 보고에 기초하여, gNodeB는 더 많은 PRB들을 할당할 필요가 있다. 그러한 경우에, UE가 IRS 부근에 있다는 것을 gNodeB가 인지하면, gNodeB는 프리코딩된 SIB1로 파일럿 신호를 반사시키기 시작한다. 이 제, UE는 UE에 의해 지각되는 IRS 원시 전력을 측정하고, 이를 NR 측정 보고에 기록한다. 측정 보고에 기초하 여, IRS로의 핸드오버가 CU-CP → DU에 의해 트리거된다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 41, "content": "[00134] 유사하게, MR은 주어진 UE에 대해 구성된 주기적인 타이머에 기초하여 또한 이루어질 수 있는 구성에 기초하여 UE에 의해 전송될 수 있다. IE들은 새로운 이벤트 트리거들에 대해 위에서 언급된 구성들을 반영하도 록 수정될 수 있다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 42, "content": "[00135] 도 9는, 단일 IRS가 5G/6G 네트워크에서 하나 이상의 셀들에 의해 공유될 수 있는 예시적인 IRS 공유 시나리오를 예시한다. 실시예에서, IRS의 상이한 부분들은 중첩하는 네트워크 커버리지를 갖는 상이 한 기지국들(예컨대, 902-1, 902-2)에 의해 예비될 수 있다. IRS는 복수의 기지국들에 대해 공통 중첩 구 역에 놓일 것이다. IRS로 구현되는 지능형 시스템들 및 방법들로 인해, BS들에 의해 서비스되고 있는 개 개의 UE들을 향해 BS들로부터의 개개의 신호들을 바운스(bounce) 또는 재생성하기 위해 IRS의 상이한 부분 들이 예비되거나 이용될 수 있다. 이러한 메커니즘은 서비스 품질을 손상시키지 않으면서 동일한 IRS의 IRS 자 원들의 최적의 이용 및 전개의 이점을 갖는다. 앞서 설명된 바와 같이, 제안된 DU I/F는 BS들(902-1, 902-2)이 5G 네트워크들 및 그 이상의 네트워크들(6G 네트워크들)에서 IRS를 셋업 및 구성할 수 있게 한다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 43, "content": "[00136] 예시적인 실시예에서, IRS의 IRS 제어기는, 상이한 BS들이 다른 부분들에 대한 간섭 없이 배타성 을 유지하면서 IRS의 일부를 구성할 수 있게 한다. 실시예에서, 하나 이상의 부분들을 고유하게 식별하기 위한 다양한 식별 메커니즘들이 하나 이상의 부분들을 고유하게 식별하고 해결하도록 IRS 제어기에 의해 구현될 수 있다. 또한, 다양한 부분들과 대응하는 BS들 간의 매핑은 IRS에 로컬적으로 저장될 수 있거나, 또는 참여 BS들에 액세스 가능한 중앙 위치에 저장될 수 있다. 실시예에서, IRS의 치수들, 상이한 부분들의 서 로로부터의 격리, 각각의 부분의 개별적인 제어를 위한 하드웨어/소프트웨어 요건들 등과 같은(그러나 이에 제 한되지는 않음) 파라미터들에 따라 주어진 IRS를 공유할 수 있는 BS들의 최대 수의 제한이 존재할 수 있다. 실 시예에서, 제1 BS(예컨대, 902-1)에 의해 이용되는 IRS의 부분들은 미리 결정된 시간 기간 이후 또는 예비 된 부분의 사용 패턴에 기초하여 제2 BS(예컨대, 902-2)에 의한 사용을 위해 추가적인 재구성을 위해 해제될 수있다. 이러한 재구성은 IRS의 다른 부분이 제3 BS에 의해 여전히 이용되고 있는 동안 발생할 수 있다. BS에 의한 IRS의 부분들의 재구성은 본 명세서에서 설명된 구성 프로시저와 동일한 프로시저를 따를 것이다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 44, "content": "[00137] 예시적인 실시예에서, IRS 마이크로컨트롤러는 상이한 BS들에 대한 상이한 부분들의 매핑을 지능적으로 유지한다. 이러한 매핑은 IRS에 로컬로 저장될 수 있거나, 요청 시 또는 IRS의 초기 발견/셋업 프로시저의 일 부로서 참여 BS들과 공유될 수 있다. 이를 위해, BS는 BS에 의해 서빙될 필요가 있는 특정 UE와 관련하여 신호 강도 및 방향성 요건에 따라 자원들(즉, IRS 부분들)의 이용 가능성에 대해 IRS에 요청 또는 문의할 수 있다. 실시예에서, IRS의 부분들의 공유는 전개 시에 1회 구성 셋업 프로시저에 기반하며, 부분들은 나중에 해제 또는 재구성되지 않는다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 45, "content": "[00138] 도 9를 참조하면, UE1은 gNB1(902-1)의 셀에 연결되고, UE2는 gNB2(902-2)의 셀에 연결되며, 여기서 이들은 개개의 셀들로부터의 직접 신호들의 열화를 경험하고 있다. 이러한 2개의 UE들이 (IRS에 대응하는) 동일한 IRS 제어기의 커버리지 하에 있기 때문에, IRS의 자원들은 셀들 모두와 정적으로 또는 동적으로 공유될 수 있다. UE1 및 UE2가 자신들의 위치 정보를 개개의 gNB-CU-CP들에 보고할 때, gNB-CU-CP들 은 자신의 개개의 IRS-셀 매핑 표를 체크할 것이고, 여기서 그것은 동일한 IRS 커버리지가 셀들 모두에 대해 적 용 가능함을 발견한다. 따라서 gNB-CU-CP는 이들 2개의 셀들 사이에서 공통 IRS 자원들을 공유하기로 결정할 수 있다. 실시예에서, gNB-CU-CP는 내부 AI/ML 전략을 사용할 수 있고, 'X%'의 IRS 안테나 자원 엘리먼트들을 cell1에 예비하고 'Y%'의 IRS 안테나 자원 엘리먼트들을 cell2에 예비하기로 결정한다. IRS 안테나 엘리먼트 자원들의 이러한 예비는 6G-F1 인터페이스 프로시저들을 통해 개개의 gNB-DU들에 통신될 것이다. 실시예에서, gNB-DU는 추가로, CSI 정보와 함께 위치 정보를 보고하도록 UE들에 요청할 것이고, UE 경험을 향상시키기 위해 IRS를 사용할지 여부를 동적으로 결정할 것이다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 46, "content": "[00139] UE가 IRS 커버리지 영역 밖으로 이동하면, gNB-CU-CP는 예비된 IRS 자원들을 해제하고, 이를 개개의 gNB-DU들에 알려, 그에 따라 자신의 미래의 스케줄링을 계획할 것이다. 도면에 도시된 바와 같이, gNB1(902- 1)은 IRS에서 자신의 공유 IRS 자원을 향해 직접 빔(906-1)을 전송하고, gNB2(902-2)는 IRS에서 자 신의 공유 IRS 자원을 향해 직접 빔(906-2)을 전송한다. 추가로, gNB1(902-1)은 UE1을 향해 직접 빔(908-1)을 전송하고, gNB2(902-2)는 UE2를 향해 직접 빔(908-2)을 전송하며, 여기서 UE1과 UE2 둘 다 감쇠된(직접) 신호들 을 경험하고 있다. 추가로, 대응하는 반사/재생성 빔(910-1)은 UE1을 향해 지향되고, 대응하는 반사/재생성 빔 (910-2)은 UE2를 향해 지향된다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 47, "content": "[00140] 도 10은 본 개시내용의 실시예들에 따른 예시적인 컴퓨터 시스템을 예시하며, 이러한 컴퓨터 시스템에 서 또는 이러한 컴퓨터 시스템에 본 발명의 실시예들이 이용될 수 있다. 도 10에 도시된 바와 같이, 컴퓨터 시 스템은 외부 저장 디바이스, 버스, 메인 메모리 판독 전용 메모리, 대용량 저장"}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 48, "content": "디바이스, 통신 포트(들) 및 프로세서를 포함할 수 있다. 당해 기술분야에서 통상의 지식을 가진 자는 컴퓨터 시스템이 하나 초과의 프로세서 및 통신 포트들을 포함할 수 있다고 인식할 것이다. 프로세 서는 본 발명의 실시예들과 연관된 다양한 모듈들을 포함할 수 있다. 통신 포트는 모뎀 기반 다이 얼업(modem based dialup) 연결에 사용하기 위한 RS-232 포트, 10/100 이더넷 포트, 구리 또는 섬유를 사용하 는 기가비트(Gigabit) 또는 10 기가비트 포트, 직렬 포트, 병렬 포트, 또는 다른 기존의 또는 향후의 포트들 중 임의의 포트일 수 있다. 통신 포트는 네트워크, 이를테면, LAN(Local Area Network), WAN(Wide Area Network), 또는 컴퓨터 시스템이 연결되는 임의의 네트워크에 따라 선택될 수 있다. 메모리는"}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 49, "content": "RAM(Random Access Memory), 또는 당해 기술분야에 일반적으로 알려진 임의의 다른 동적 저장 디바이스일 수 있 다. 판독 전용 메모리는 임의의 정적 저장 디바이스(들), 예컨대 정적 정보, 예컨대 프로세서에 대한 시동 또는 BIOS 명령들을 저장하기 위한 PROM(Programmable Read Only Memory) 칩들(그러나 이에 제한되 지 않음)일 수 있다. 대용량 저장소는 정보 및/또는 명령들을 저장하기 위해 사용될 수 있는 임의의 현 재 또는 향후의 대용량 저장 솔루션일 수 있다. 예시적인 대용량 저장 솔루션들은 PATA(Parallel Advanced Technology Attachment) 또는 SATA(Serial Advanced Technology Attachment) 하드 디스크 드라이브들 또는 고 체 상태 드라이브들(내부 또는 외부, 예컨대 USB(Universal Serial Bus) 및/또는 파이어와이어(Firewire) 인터 페이스들을 가짐), 하나 이상의 광학 디스크(disc)들, RAID(Redundant Array of Independent Disks) 저장소, 예컨대 디스크(disk)들의 어레이(예컨대, SATA 어레이들)를 포함한다(그러나 이에 제한되지 않음)."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 50, "content": "[00141] 버스는 프로세서(들)를 다른 메모리, 저장소 및 통신 블록들과 통신 가능하게 결합한다. 버스는 예컨대, 확장 카드들, 드라이브들 및 다른 서브시스템들을 연결하기 위한 PCI(Peripheral Component Interconnect)/PCI-X(PCI Extended) 버스, SCSI(Small Computer System Interface), USB 등뿐만 아니라, 프로세서를 소프트웨어 시스템에 연결하는 FSB(front side bus)와 같은 다른 버스들일 수 있다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 51, "content": "[00142] 선택적으로, 운용자 및 관리 인터페이스들, 예컨대 디스플레이, 키보드 및 커서 제어 디바이스는 또한 버스에 결합되어 컴퓨터 시스템과의 직접적인 운용자 상호 작용을 지원할 수 있다. 다른 운용자 및 관리 인터페이스들은 통신 포트를 통해 연결된 네트워크 연결들을 통해 제공될 수 있다. 위에서 설명된 컴포 넌트들은 단지 다양한 가능성들을 예시하는 것으로 여겨진다. 앞서 언급된 예시적인 컴퓨터 시스템은 본 개시 내용의 범위를 결코 제한하지 않아야 한다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 52, "content": "[00143] 도 11은 실시예에 따른, IRS 관리자가 CCIM 인터페이스[CCIM: CU-CP-IRS 관리자]를 통해 gNB- CU-CP와 통신하는 중앙 집중식 독립형 엔티티로서 배치되는 예시적인 RAN 아키텍처를 예시한다. 여기서, IRS 관리자는 CCIM 인터페이스를 사용하여 gNB-CU-CP(예컨대, 1104-1, 1104-p)로부터 UE 측정 보고들, 위치 정보, 스케줄링 데이터 등을 수집한다. 추가로, IRS 관리자는 CCIM 인터페이스를 사용하여, 공유된 IRS 자원들에 대한 결정들을 gNB-CU-CP들과 공유하며, gNB-CU-CP들은 결국 6G F1 인터페이스들을 통해 이를 gNB-DU(예컨대, 1108-1, 1108-2…, 1108-N)에 전달한다. 실시예에서, IRS 관리자는 다수의 gNB-CU-CP들 을 핸들링할 수 있다. 도 11에 도시된 바와 같이, gNB-DU들 각각은 IRS-UE 매핑 표(예컨대, 1110-1, 1110-2, …, 1110-N)를 포함한다. IRS-UE 매핑 표들 각각은, IRS에 의해 UE들을 서빙하기 위해 이용되고 있는 IRS 자원 들로 서빙되고 있는 다양한 UE들 간의 매핑을 포함한다. 도시된 바와 같이, 매핑 정보는 DUI 인터페이스를 통 해 주어진 IRS(즉, 1114)의 IRS 제어기와 공유될 수 있다. 그에 따라, IRS 제어기는 셀-1, 셀- 2,., 셀-N(예컨대, 1116-1, 1116-2, …, 1116-N)에 대한 IRS 공유 자원들을 적절하게 할당/배정하도록 공유 IRS를 구성한다. IRS 관리자는, 하나 이상의 프로세서들에 의해 실행될 때 IRS 관리자로 하 여금, IRS 관리자의 설명된 기능들을 수행하게 하는 한 세트의 명령들을 저장하는 메모리에 결합된 하나 이상의 프로세서들을 갖는 네트워크 디바이스로서 구현될 수 있다는 것이 주목될 수 있다. IRS 제어기는 위에서 설명된 바와 같이 IRS 제어기와 유사할 수 있다는 것이 주목될 수 있다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 53, "content": "[00144] 도 12는 실시예에 따라, IRS 관리자가 gNB-CU-CP와 공동위치된 분산형 엔티티로서 구현되는 예시적인 RAN 아키텍처를 예시한다. 여기서, IRS 관리자(예컨대, 1102-A, 1102-B)는 내부 CCIM 인터페이스를 통 해 자신의 gNB-CU-CP(예컨대, 1104-1, 1104-P)와 통신할 수 있으며, 이는 주어진 구현에 특정적일 수 있다. 실 시예에서, IRS 관리자(예컨대, 1102-A)는 자신과 공동위치되는 하나의 gNB-CU-CP(1104-1)만을 핸들링할 수 있다. 다수의 gNB-CU-CP에 걸쳐 IRS 공유가 지원될 필요가 있다면, 위에서 정의된 메시지들은 6G Xn 인터페이 스들에 대해 정의될 필요가 있으며, 이는 주어진 IRS 관리자(예컨대, 110-2A)가 Xn 인터페이스를 통해 피어 IRS 관리자들(예컨대, 1102-B)과 통신하는 데 사용될 것이다. 후속 통신 및 동작은 위에서 도 11을 참조하여 설명 된 것과 유사한 방식으로 이어진다. 도 12에서 설명 및 도시된 실시예가 gNB-CU-CP(예컨대, 1104-1, 1104-P)로 의 IRS 관리자의 통합을 예상함으로써 이를 예컨대, 도 5b에 도시된 바와 같이 기지국 또는 네트워크 디바이스"}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 54, "content": "의 일부로 만든다는 것이 당해 기술분야에서 통상의 지식을 가진 자들에 의해 주목될 수 있다. 진행 중인 설명의 범위를 벗어나지 않으면서 다양한 다른 구현들이 가능할 수 있다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 55, "content": "[00145] 도 13은 실시예에 따라 IRS 관리자가 중앙 집중형 엔티티로서 구현되는 예시적인 RAN 아키텍처를 예시한다. 실시예에서, IRS 관리자는 정적 IRS 관리자 및/또는 동적 IRS 관리자로서 구현될 수 있 다. 추가로, 동적 IRS 관리자는 근접 RT RIC의 일부이며, IRS 자원들의 동적 공유를 핸들링하도록 구성된다. 실시예에서, 동적 IRS 관리자는 개개의 E2 인터페이스들을 통해 gNB-CU-CP(예컨대, 1104-1, 1104-P)와 통신한다. 실시예에서, 동적 IRS 관리자에 대해 통신이 필요로 하는 모든 것이 E2 인터페이스 들 내에 포함될 것이다. 또한, 실시예에서, 정적 IRS 관리자는 IRS 자원들의 정적 공유를 핸들링할 수 있는 SMO의 일부로서 구현될 수 있다. SMO의 정적 IRS 관리자와 gNB-CU-CP(예컨대, 1104- 1, 1104-P) 간의 통신은 도면에 도시된 바와 같이 O1 인터페이스를 통해 발생할 수 있다. 후속 통신 및 동작은 위에서 도 11을 참조하여 설명된 것과 유사한 방식으로 이어진다. 진행 중인 설명의 범위를 벗어나지 않으면서 다양한 다른 구현들이 가능할 수 있다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 56, "content": "[00146] 도 14는 실시예에 따른 예시적인 CCIM(Common Communications Interface Module) 인터페이스 프로토콜 스택을 예시한다. 실시예에서, IRS 자원들을 공유하기 위한 개시된 IRS 아키텍처는 라디오 네트워크 계층 과 전송 네트워크 계층 간의 통신을 위한 프로토콜 스택을 필요로 할 수 있다. 도시된 바와 같이, 라디오 네트워크 계층 프로토콜은 CCIM(Common Communications Interface Module) API(Application Program Interface) 계층을 포함한다. 도시된 바와 같이, 전송 네트워크 계층 프로토콜들은 SCTP(Stream Control Transmission Protocol) 계층, 인터넷 프로토콜 계층, 데이터 링크 계층 및 물리적 링크 계층을 포함한다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 57, "content": "[00147] 도 15a - 도 15d는 실시예에 따라 CCIM 인터페이스에서 사용될 수 있는 프로시저들의 예시적인 초기 세 트를 예시한다. 도 15a를 참조하면, 측정 보고 업데이트 프로시저가 예시된다. 도시된 바와 같이, 이러 한 프로시저는 UE 측정 보고들을 업데이트하고 IRS 관리자(예컨대, 1102)와 공유하기 위해 gNB-CU- CP에 의해 사용된다. 실시예에서, 측정 보고는 또한 UE 위치 정보를 운반할 수 있다. 측정 보고 업데이 트 메시지는 gNB-CU-CP로부터 IRS 관리자로 전송된다. 실시예에서, 메시지는 서비스되는 셀들의 리스트, SINR 이 불량하거나 또는 미리 결정된 임계치 미만인 UE들의 리스트, 그러한 UE들의 위치 정보, 및 이러한 UE들이 속 하는 IRS ID들의 리스트를 포함할 수 있다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 58, "content": "[00148] 도 15b를 참조하면, 스케줄링 데이터 요청 프로시저가 예시된다. 이 프로시저는 (불량한 신호 수신을 겪는) UE들의 리스트에 대한 MAC 스케줄러 데이터를 공유하도록 gNB-CU-CP에 요청하는 데 IRS 관리자에 의해 사용된다. 실시예에서, 스케줄링 데이터 요청 메시지는 IRS 관리자로부터 gNB- CU-CP로 송신된다. 실시예에서, 스케줄링 데이터 요청 메시지는 셀들의 리스트, SINR이 불량하거나 또는 미리 결정된 임계치 미만인 UE들의 리스트, 및 스케줄링 데이터가 요청되는 TTI들의 수를 포함할 수 있다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 59, "content": "[00149] 도 15c를 참조하면, 스케줄링 데이터 응답 프로시저가 예시된다. 이 프로시저는 IRS 관리 자를 MAC 스케줄러 데이터로 업데이트하기 위해 gNB-CU-CP에 의해 사용된다. 실시예에서, 이 스케 줄링 데이터 응답 메시지는 gNB-CU-CP로부터 IRS 관리자로 송신된다. 실시예에서, 메시지는 셀들 의 리스트, UE들의 리스트, 이러한 UE들에 대해 아직 스케줄링되지 않은 데이터의 양, 스케줄링될 데이터에 대 한 밸런스 PDB(Packet Delay Budget), 할당된 MCS(Modulation and Coding Scheme) 및 수신 CSI(Channel State Information) 정보를 포함할 수 있다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 60, "content": "[00150] 도 15d를 참조하면, IRS 자원 커맨드 프로시저가 예시된다. 이 프로시저는 할당된 IRS 자 원들을 gNB-CU-CP에 명령하기 위해 IRS 관리자에 의해 사용된다. 실시예에서, 이 메시지는 IRS 관 리자에 의해 gNB-CU-CP에 전송된다. 실시예에서, 메시지는 셀들의 리스트, UE들의 리스트, 각각의 셀에 대해 할당된 IRS 자원들의 몫, 및 IRS 자원 할당의 유효 시간을 포함할 수 있다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 61, "content": "[00151] 도 16a - 도 16b는 IRS 공유 기능에 대해 지원되도록 요구될 수 있는 6G F1 인터페이스 프로시저들을 예시한다. 도 16a를 참조하면, 스케줄링 데이터 요청 프로시저가 예시된다. 이 프로시저는 어려 움을 겪는 UE들의 리스트에 대한 MAC 스케줄러 데이터를 공유하도록 gNB-DU에 요청하기 위해 gNB-CU- CP에 의해 사용된다. 실시예에서, 이 스케줄링 데이터 요청 메시지는 gNB-CU-CP로부터 gNB- DU로 송신되고, 셀들의 리스트, SINR이 불량한 UE들의 리스트, 및 스케줄링 데이터가 요청된 TTI들의 수 를 포함할 수 있다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 62, "content": "[00152] 도 16b를 참조하면, 스케줄링 데이터 응답 프로시저가 예시된다. 이 프로시저는 MAC 스케줄러 데이터로 gNB-CU-CP를 업데이트하기 위해 gNB-DU에 의해 사용된다. 이 스케줄링 데이터 응답 메시 지는 gNB-DU로부터 gNB-CU-CP로 송신된다. 실시예에서, 메시지는 셀들의 리스트, UE들의 리스트, 이러한 UE들에 대해 아직 스케줄링되지 않은 데이터의 양, 스케줄링될 데이터에 대한 밸런스 PDB, 할당된 MCS, 및 수신 CSI 정보를 포함할 수 있다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 63, "content": "[00153] 이들 IRS 공유 관련 프로시저들은, 도 13을 참조하여 위의 아키텍처들에서 예시되고 설명된 바와 같이, 이러한 프로시저들이 근접 RT RIC 및 SMO 각각에서 지원될 때, IRS 관리자 기능을 지원하기 위해 E2 인터페이스 및 O1 인터페이스 내에 포함될 수 있다는 점이 주목될 수 있다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 64, "content": "[00154] 도 17은 5G/6G 통신 네트워크에서 IRS의 IRS 자원들을 공유하기 위한 방법에 대한 단계들의 예시 적인 시퀀스를 예시한다. 실시예에서, 방법은 단계에서, IRS 관리자에 의해 CU-CP로 부터 CCIM 측정 보고 업데이트 메시지를 수신하는 단계를 포함한다. 단계에서, IRS 관리자는, 상 이한 셀들로부터의 UE들이 지속적으로 불량한 SINR을 경험하고, 또한 이들 UE들이 동일한 IRS(예컨대, 904)의 커버리지 내에 있음을 검출한다. CCIM-API 계층을 통해 송신된 CCIM 스케줄링 데이터 요청은 셀의 리스트, ID 들, UE들의 리스트 및 TTI들의 수를 포함한다. 단계에서, 스케줄링 데이터 요청 메시지는 6G F1 인터페 이스를 통해 IRS 관리자에 의해 CCIM-API 인터페이스를 통해 CU-CP에 송신된다. 단계 및 단계에서, CU-CP는 6G F1 인터페이스를 통해, 스케줄링 데이터 요청 메시지를 DU-1(1108-1) 및 DU-2(1108-2)에 각각 송신한다. 단계들(1712, 1714)에서, DU-1(1108-1) 및 DU-2(1108-2)는 6G F1 인터페이스 를 통해, 스케줄링될 데이터의 양, 밸런스 PDB, 할당된 MCS 및 수신 CSI를 각각 포함하는 스케줄링 데이터 응답메시지를 CU-CP에 송신한다. 단계에서, CU-CP는 CCIM-API 인터페이스를 통해 스케줄링 데 이터 응답 CCIM 메시지를 IRS 관리자에 송신한다. 단계에서, IRS 관리자는 수신된 스케줄링 데이터에 기초하여, 서빙되는 각각의 셀에 대한 IRS 자원들의 결정된 몫을 도출한다. 단계에서, IRS 관 리자는 CCIM API 인터페이스를 통해, 셀 ID들의 리스트, UE들의 리스트, 각각의 셀에 대해 할당된 IRS 자 원들의 리스트 및 유효 시간을 포함하는 IRS 자원 커맨드를 전송한다. 단계들(1722, 1724)에서, CU-CP는 6G F1 인터페이스를 통해, 셀 ID들의 리스트, UE들의 리스트, 각각의 셀에 대해 할당된 IRS 자원들의 리스트 및 유효 시간을 포함하는 IRS 자원 커맨드를 DU-1(1108-1) 및 DU-2(1108-2)에 각각 전송한다. 단계들(1726, 1728)에서, DU-1(1108-1) 및 DU-2(1108-2)의 MAC 스케줄러들은 IRS 커버리지 하의 모든 UE들에 대해 할당된 IRS 자원들을 각각 사용하기 시작한다. 단계들(1730, 1734)에서, DU-1(1108-1) 및 DU-2(1108-2)는 개개의 IRS 자원 커맨드들을 IRS 제어기에 전송한다. 단계들(1732, 1734)에서, IRS 제어기는 단계들(1730, 1734)에서 각각 수신된 IRS 자원 커맨드들에 따라 각각의 UE에 대한 적절한 빔들을 생성한다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 65, "content": "[00155] 본 명세서에서 바람직한 실시예들에 대해 상당한 강조가 이루어졌지만, 많은 실시예들이 이루어질 수 있고 본 발명의 원리들을 벗어나지 않으면서 바람직한 실시예들에서 많은 변경이 이루어질 수 있다고 인식될 것"}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 66, "content": "이다. 본 발명의 바람직한 실시예들에서 이들 및 다른 변경들은 본 명세서의 개시내용으로부터 당해 기술분야 에서 통상의 지식을 가진 자들에게 명백할 것이며, 이로써 앞서 말한 설명 사항은 제한으로서가 아닌 단지 본 발명의 예시로서 구현된다고 분명히 이해되어야 한다. 본 개시내용의 이점들"}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 67, "content": "[00156] 본 개시내용은 IRS 아키텍처들을 이용함으로써 차세대 네트워크들(예컨대, 6G) 내에서 효과적이고, 동 시 발생하며, 개선된 통신을 제공한다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 68, "content": "[00157] 본 개시내용은 하나 이상의 장애물들을 갖는 영역들에서의 개선된 커버리지를 위해 기지국들의 고비용 전개에 대한 필요성을 제거하기 위한 시스템 및 방법을 제공한다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 69, "content": "[00158] 본 개시내용은 불량한 신호, 신호 열화 및 커버리지의 부족으로 인해 UE들이 직면하는 문제들을 피할 수 있는 경제적인 차세대 기반 시스템 및 방법을 제공한다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 70, "content": "[00159] 본 개시내용은 사용자의 위치에 관계없이 끊김 없는 서비스 품질을 가능하게 할 수 있는 효과적인 시스 템 및 방법을 제공한다."}
{"patent_id": "10-2023-7011499", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 71, "content": "[00160] 본 개시내용은 하나 이상의 셀들을 서비스하기 위해 복수의 기지국들 사이에서 IRS의 IRS 자원들을 공 유하기 위한 시스템 및 방법을 제공한다.도면 도면1 도면2a 도면2b 도면2c 도면2d 도면2e 도면2f 도면3 도면4 도면5a 도면5b 도면5c 도면6 도면7a 도면7b 도면7c 도면7d 도면7e 도면7f 도면7g 도면8a 도면8b 도면8c 도면9 도면10 도면11 도면12 도면13 도면14 도면15a 도면15b 도면15c 도면15d 도면16a 도면16b 도면17"}
{"patent_id": "10-2023-7011499", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 명세서에 통합되며 본 발명의 일부를 구성하는 첨부 도면들은 개시된 방법들 및 시스템들의 예시적인 실시예들을 예시하며, 여기서 유사한 참조 번호들은 상이한 도면들 전반에 걸쳐 동일한 부분들을 나타낸다. 도 면들의 컴포넌트들은 반드시 실척대로 도시된 것은 아니며, 대신에 본 발명의 원리들을 명확히 예시할 때 강조 가 이루어진다. 일부 도면들은 블록도들을 사용하여 컴포넌트들을 나타낼 수 있으며 각각의 컴포넌트의 내부 회로부를 나타내지 않을 수 있다. 이러한 도면들의 발명은 이러한 컴포넌트들을 구현하기 위해 일반적으로 사"}
{"patent_id": "10-2023-7011499", "section": "도면", "subsection": "도면설명", "item": 2, "content": "용되는 전기 컴포넌트들, 전자 컴포넌트들 또는 회로부의 발명을 포함한다고 당해 기술분야에서 통상의 지식을 가진 자들에 의해 인식될 것이다. 도 1은 본 개시내용의 실시예에 따른, 예시적인 5G 또는 6G 네트워크 아키텍처에서의 통상적인 IRS 전개 시나리오를 예시한다. 도 2a - 도 2f는 본 개시내용의 실시예에 따른, IRS 전개의 예시적인 사용 사례들을 예시한다. 도 3은 본 개시내용의 실시예에 따른, 예시적인 IRS 커버리지 시나리오를 예시한다. 도 4는 본 개시내용의 실시예에 따른, 예시적인 IRS 전개 시나리오를 예시한다. 도 5a는 본 개시내용의 실시예에 따른, IRS와 인터페이싱하는 RAN의 예시적인 기능 아키텍처를 예시한다. 도 5b는 본 개시내용의 실시예에 따른, IRS 네트워크 아키텍처로 구현된 예시적인 네트워크 디바이스를 예시한다. 도 5c는 본 개시내용의 실시예에 따른, 예시적인 UE를 예시한다. 도 6은 본 개시내용의 실시예에 따른, 예시적인 DUI 프로토콜 인터페이스 스택(stack)을 예시한다. 도 7a - 도 7g는 본 개시내용의 실시예에 따른, RAN과 IRS 간의 인터페이싱 프로토콜에 수반되는 예시적 인 단계들을 예시한다. 도 8a - 도 8c는 본 개시내용의 실시예에 따른, 각각 IRS의 식별, 신호 파라미터들의 측정, 및 5G 또는 6G 네트워크로의 측정 보고들의 통신을 위한 UE 프로시저들에 수반되는 예시적인 단계들을 예시한다. 도 9는 본 개시내용의 실시예에 따른, 다수의 네트워크 디바이스들 간의 IRS의 공유를 제공하는 IRS 네 트워크 아키텍처의 예시적인 시나리오를 예시한다. 도 10은 본 개시내용의 실시예들에 따른 예시적인 컴퓨터 시스템을 예시하며, 이러한 컴퓨터 시스템에서 또는 이러한 컴퓨터 시스템에 본 발명의 실시예들이 이용될 수 있다. 도 11은 본 개시내용의 실시예에 따른, IRS 관리자가 CCIM 인터페이스[CCIM: CU-CP-IRS 관리자]를 통해 gNB-CU-CP와 통신하는 중앙 집중식 독립형 엔티티로서 배치되는 예시적인 RAN 아키텍처를 예시한다. 도 12는 본 개시내용의 실시예에 따른, IRS 관리자가 gNB-CU-CP와 공동위치(collocate)된 분산형 엔티티 로서 배치되는 예시적인 RAN 아키텍처를 예시한다. 도 13은 예시적인 RAN 아키텍처를 예시하며, 여기서 IRS 관리자는 본 개시내용의 일 실시예에 따 라 중앙 집중형 엔티티로서 배치된다. 도 14는 본 개시내용의 실시예에 따른 예시적인 CCIM 인터페이스 프로토콜 스택을 예시한다. 도 15a - 도 15d는 본 개시내용의 실시예에 따른, CCIM 인터페이스에서 사용될 수 있는 프로시저들의 예 시적인 초기 세트를 예시한다. 도 16a - 도 16b는 본 개시내용의 실시예에 따른, IRS 공유 기능에 대해 지원될 필요가 있는 6G F1 인터 페이스의 프로시저들을 예시한다. 도 17은 본 개시내용의 실시예에 따른, IRS 공유를 위한 단계들의 예시적인 시퀀스를 예시한다. 전술한 내용은 본 발명의 다음의 보다 상세한 설명으로부터 보다 명백해질 것이다."}
