{"patent_id": "10-2022-0112244", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0033512", "출원번호": "10-2022-0112244", "발명의 명칭": "음식물류 폐기물 수거 및 분해 장치", "출원인": "다알시스 주식회사", "발명자": "최윤호"}}
{"patent_id": "10-2022-0112244", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자에 의해 투입되는 음식물류 폐기물을 수거하기 위한 음식물 수거장치;상기 음식물 수거장치와 인접한 위치에 설치되고 상기 음식물 수거장치에 의해 수거된 음식물류 폐기물을 공급받아서 이를 분해시키기 위한 음식물 분해장치; 및 상기 음식물 수거장치에 의해 수거된 음식물류 폐기물을 상기 음식물 분해장치로 이송시키기 위한 음식물 이송장치;를 포함하는 것을 특징으로 하는 음식물류 폐기물 수거 및 분해 장치."}
{"patent_id": "10-2022-0112244", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 음식물 분해장치는음식물류 폐기물을 먹이로 살아가는 곤충 애벌레를 사육하기 위한 공간을 제공하는 적어도 하나의 사육 케이스;를 포함하는 것을 특징으로 하는 음식물류 폐기물 수거 및 분해 장치."}
{"patent_id": "10-2022-0112244", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 음식물 이송장치는상기 음식물 수거장치에 의해 수거된 음식물류 폐기물을 상기 음식물 분해장치 측으로 안내하는 음식물 안내부;및상기 음식물 안내부로부터 전달 받은 음식물류 폐기물을 상기 적어도 하나의 사육 케이스에 공급하는 음식물 공급부;를 포함하는 것을 특징으로 하는 음식물류 폐기물 수거 및 분해 장치."}
{"patent_id": "10-2022-0112244", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 적어도 하나의 사육 케이스는 다층 구조로 배치되는 복수개의 사육 케이스로 제공되고,상기 음식물 공급부는 상기 복수개의 사육 케이스와 인접한 일측 공간에서 상하 방향으로 이동 가능하게 승강식구조로 설치되어 상기 다층 구조로 배치되는 복수개의 사육 케이스 각각에 음식물류 폐기물을 공급하는 것을 특징으로 하는 음식물류 폐기물 수거 및 분해 장치."}
{"patent_id": "10-2022-0112244", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 음식물 공급부는공개특허 10-2024-0033512-3-음식물류 폐기물의 이동 방향을 기준으로 후방측이 개방된 함체 구조로 마련되되, 제1 측판, 제2 측판, 바닥판및 전방 도어판을 포함하고,상기 바닥판은 상기 복수개의 사육 케이스 측으로 하향 경사진 구조로 마련되며,상기 전방 도어판은 회동 가능하게 마련되어 상기 음식물 공급부의 전방측을 개방하거나 폐쇄하는 것을 특징으로 하는 음식물류 폐기물 수거 및 분해 장치."}
{"patent_id": "10-2022-0112244", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제2항에 있어서,상기 음식물 수거장치는사용자에 의해 투입되는 음식물류 폐기물이 수거되는 공간을 제공하는 음식물 수거함;을 포함하고,상기 음식물 이송장치는상기 음식물 수거함과 상기 적어도 하나의 사육 케이스를 연결하는 음식물 공급 라인; 및 상기 음식물 수거함의 음식물류 폐기물을 상기 음식물 공급 라인을 통해 상기 적어도 하나의 사육 케이스로 이송하기 위한 동력을 제공하는 구동 수단;을 포함하는 것을 특징으로 하는 음식물류 폐기물 수거 및 분해 장치."}
{"patent_id": "10-2022-0112244", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항 또는 제2항에 있어서,상기 음식물 수거장치는사용자에 의해 투입되는 음식물류 폐기물을 일시적으로 보관하기 위한 공간이 마련되는 음식물 투입부; 및상기 음식물 투입부에 있는 음식물류 폐기물을 분석하는 음식물 분석부;를 포함하고,상기 음식물 이송장치는상기 음식물 분석부의 분석 결과에 따라 재활용이 가능한 것으로 판단된 음식물류 폐기물만을 상기 음식물 분해장치로 이송시키는 것을 특징으로 하는 음식물류 폐기물 수거 및 분해 장치."}
{"patent_id": "10-2022-0112244", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 음식물 수거장치는음식물류 폐기물을 분쇄하기 위한 음식물 분쇄부;를 더 포함하고,상기 음식물 분쇄부는 상기 음식물 분석부의 분석 결과에 따라 재활용이 가능한 것으로 판단된 음식물류 폐기물만을 분쇄하는 것을 특징으로 하는 음식물류 폐기물 수거 및 분해 장치."}
{"patent_id": "10-2022-0112244", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "공개특허 10-2024-0033512-4-제7항에 있어서,상기 음식물 수거장치는상기 음식물 분석부에 의해 상기 음식물 투입부에 있는 음식물류 폐기물에 이물질이 포함되어 재활용이 불가능한 것으로 판단되면,상기 음식물 투입부에 있는 음식물류 폐기물을 촬영한 영상을 디스플레이 모듈에 표시하여 사용자에게 제공하는것을 특징으로 하는 음식물류 폐기물 수거 및 분해 장치."}
{"patent_id": "10-2022-0112244", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제2항에 있어서,상기 사육 케이스 내에는 상기 곤충 애벌레들과 함께 음식물류 폐기물의 함수량을 조절하기 위한 함수량 조절재가 마련되고, 상기 함수량 조절재는 건조된 커피찌꺼기를 포함하는 것을 특징으로 하는 음식물류 폐기물 수거 및 분해 장치."}
{"patent_id": "10-2022-0112244", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "음식물류 폐기물 수거 및 분해 장치가 개시된다. 본 발명에 따른 음식물류 폐기물 수거 및 분해 장치는, 사용자 에 의해 투입되는 음식물류 폐기물을 수거하기 위한 음식물 수거장치, 상기 음식물 수거장치와 인접한 위치에 설 치되고 상기 음식물 수거장치에 의해 수거된 음식물류 폐기물을 공급 받아서 이를 분해시키기 위한 음식물 분해 장치, 및 상기 음식물 수거장치에 의해 수거된 음식물류 폐기물을 상기 음식물 분해장치로 이송시키기 위한 음식 물 이송장치를 포함한다."}
{"patent_id": "10-2022-0112244", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은, 음식물류 폐기물을 수거하기 위한 장치에 관한 것으로, 더욱 상세하게는 음식물류 폐기물을 수거한 현장에서 바로 분해 처리 및 재활용이 가능한 음식물류 폐기물 수거 및 분해 장치에 관한 것이다."}
{"patent_id": "10-2022-0112244", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "환경 오염으로 인한 문제가 대두되면서, 환경 오염을 방지하기 위하여 폐기되는 쓰레기의 양을 줄이기 위한 각 국 정부 및 기업들의 노력이 계속되고 있다. 이러한 노력의 일환으로 일반 폐기물(쓰레기)의 재활용 분리 수거 에 대하여 많은 신경을 쓰고 있으나, 음식물류 폐기물(쓰레기)의 경우는 분리 수거가 제대로 이루어지고 있지 않을 뿐만 아니라, 분리 수거된 음식물류 폐기물의 상태나 품질이 좋지 않아 음식물류 폐기물을 사료나 에너지 원 등으로 재활용하는데 있어서 많은 비용과 시간이 소요되는 문제점이 있다. 이에, 음식물류 폐기물을 수거함에 있어서 재활용이 가능한 음식물류 폐기물과 그렇지 않은 음식물류 폐기물을 구분하여 수거하고, 음식물류 폐기물의 재활용에 대한 사람들의 관심과 참여를 높이면서도, 음식물류 폐기물을 배출함에 있어서 사용자의 편의성을 향상시킬 수 있는 음식물류 폐기물 수거 장치에 대한 개발이 요구되고 있다. 한편, 음식물류 폐기물 수거 장치에 의해 수거된 음식물류 폐기물은 최근 동애등에 애벌레 등의 곤충 애벌레의 사료로 재활용되고 있는데, 이를 음식물류 폐기물 수거 장치에 적용한다면, 수거된 음식물류 폐기물을 수거 현 장에서 즉시 친환경적으로 분해 처리하면서도 음식물류 폐기물을 곤충 애벌레의 사료로 재활용할 수 있을 것으 로 기대되고 있다. .관련 선행기술문헌으로는 등록특허공보 제10-0841663호(발명의 명칭: 음식물쓰레기 수거장치, 공고일자: 2008 년 06월 26일) 및 등록특허공보 제10-1513570호(발명의 명칭: 음식물쓰레기 수거장치 및 그 제어방법, 공고일자: 2015년 04월 20일), 록특허공보 제10-1123249호(발명의 명칭: 동애등에 사육 장치, 공고일자: 2012년 03월 20일) 등이 있다."}
{"patent_id": "10-2022-0112244", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은, 수거된 음식물류 폐기물을 분해시키거나 재활용하기 위한 시설이나 장소로 이동할 필요없이 음식물류 폐기물이 수거된 현장에서 바로 음식물류 폐기물을 친환경적으로 분해 처리하고 재활용할 수 있는 음식물류 폐기물 수거 및 분해 장치를 제공하는 것이다. 본 발명의 다른 목적은, 재활용이 가능한 음식물류 폐기물와 재활용이 불가능한 음식물류 폐기물을 구분하여 수 거하고, 음식물류 폐기물의 재활용에 대한 사람들의 관심과 참여를 높이면서도, 음식물류 폐기물을 배출함에 있 어서 사용자의 편의성을 향상시킬 수 있는 음식물류 폐기물 수거 및 분해 장치를 제공하는 것이다."}
{"patent_id": "10-2022-0112244", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적은, 본 발명의 일 실시예에 따라, 사용자에 의해 투입되는 음식물류 폐기물을 수거하기 위한 음식물 수거장치, 상기 음식물 수거장치와 인접한 위치에 설치되고 상기 음식물 수거장치에 의해 수거된 음식물류 폐기 물을 공급 받아서 이를 분해시키기 위한 음식물 분해장치, 및 상기 음식물 수거장치에 의해 수거된 음식물류 폐 기물을 상기 음식물 분해장치로 이송시키기 위한 음식물 이송장치를 포함하는 것을 특징으로 하는 음식물류 폐 기물 수거 및 분해 장치에 의해 달성된다. 바람직하게, 상기 음식물 분해장치는 음식물류 폐기물을 먹이로 살아가는 곤충 애벌레를 사육하기 위한 공간을 제공하는 적어도 하나의 사육 케이스를 포함할 수 있다. 바람직하게, 상기 음식물 이송장치는 상기 음식물 수거장치에 의해 수거된 음식물류 폐기물을 상기 음식물 분해 장치 측으로 안내하는 음식물 안내부, 및 상기 음식물 안내부로부터 전달 받은 음식물류 폐기물을 상기 적어도 하나의 사육 케이스에 공급하는 음식물 공급부를 포함할 수 있다. 바람직하게, 상기 적어도 하나의 사육 케이스는 다층 구조로 배치되는 복수개의 사육 케이스로 제공되고, 상기 음식물 공급부는 상기 복수개의 사육 케이스와 인접한 일측 공간에서 상하 방향으로 이동 가능하게 승강식 구조 로 설치되어 상기 다층 구조로 배치되는 복수개의 사육 케이스 각각에 음식물류 폐기물을 공급할 수 있다. 바람직하게, 상기 음식물 공급부는 음식물류 폐기물의 이동 방향을 기준으로 후방측이 개방된 함체 구조로 마련 되되, 제1 측판, 제2 측판, 바닥판 및 전방 도어판을 포함하고, 상기 바닥판은 상기 복수개의 사육 케이스 측으 로 하향 경사진 구조로 마련되며, 상기 전방 도어판은 회동 가능하게 마련되어 상기 음식물 공급부의 전방측을 개방하거나 폐쇄할 수 있다. 바람직하게, 상기 음식물 수거장치는 사용자에 의해 투입되는 음식물류 폐기물이 수거되는 공간을 제공하는 음 식물 수거함을 포함하고, 상기 음식물 이송장치는 상기 음식물 수거함과 상기 적어도 하나의 사육 케이스를 연 결하는 음식물 공급 라인, 및 상기 음식물 수거함의 음식물류 폐기물을 상기 음식물 공급 라인을 통해 상기 적 어도 하나의 사육 케이스로 이송하기 위한 동력을 제공하는 구동 수단을 포함할 수 있다. 바람직하게, 상기 음식물 수거장치는 사용자에 의해 투입되는 음식물류 폐기물을 일시적으로 보관하기 위한 공 간이 마련되는 음식물 투입부, 및 상기 음식물 투입부에 있는 음식물류 폐기물을 분석하는 음식물 분석부를 포 함하고, 상기 음식물 이송장치는 상기 음식물 분석부의 분석 결과에 따라 재활용이 가능한 것으로 판단된 음식 물류 폐기물만을 상기 음식물 분해장치로 이송시킬 수 있다. 상기 음식물 수거장치는 음식물류 폐기물을 분쇄하기 위한 음식물 분쇄부를 더 포함하고, 상기 음식물 분쇄부는 상기 음식물 분석부의 분석 결과에 따라 재활용이 가능한 것으로 판단된 음식물류 폐기물만을 분쇄할 수 있다. 바람직하게, 상기 음식물 수거장치는 상기 음식물 분석부에 의해 상기 음식물 투입부에 있는 음식물류 폐기물에 이물질이 포함되어 재활용이 불가능한 것으로 판단되면, 상기 음식물 투입부에 있는 음식물류 폐기물을 촬영한 영상을 디스플레이 모듈에 표시하여 사용자에게 제공할 수 있다. 바람직하게, 상기 사육 케이스 내에는 상기 곤충 애벌레들과 함께 음식물류 폐기물의 함수량을 조절하기 위한 함수량 조절재가 마련되고, 상기 함수량 조절재는 건조된 커피찌꺼기를 포함할 수 있다."}
{"patent_id": "10-2022-0112244", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 음식물류 폐기물을 수거하기 위한 음식물 수거장치와 수거된 음식물류 폐기물을 분해 처리하기 위한 음식물 분해장치를 하나의 장치 구조로 제공함으로써, 수거된 음식물류 폐기물을 분해시키거나 재활용하기 위한 시설이나 장소로 이동할 필요없이 음식물류 폐기물이 수거된 현장에서 바로 음식물류 폐기물을 분해 처리할 수있으며, 특히, 음식물류 폐기물을 분해 처리함에 있어서 동애등에 애벌레 등의 곤충 애벌레를 사용함으로써, 수 거된 음식물류 폐기물을 친환경적으로 처리하면서 동애등에 애벌레를 사육하기 위한 사료로 재활용할 수 있다. 또한, 본 발명은 사용자에 의해 투입되는 음식물류 폐기물을 분석하여 재활용 가능한 음식물류 폐기물와 재활용 이 불가능한 음식물류 폐기물을 구분하여 수거함으로써, 수거된 음식물류 폐기물을 사료나 에너지원 등으로 재 활용하는데 있어서 비용과 시간을 절감할 수 있고, 음식물류 폐기물의 재활용에 대한 사람들의 친환경적 관심과 인식을 고양시켜 좋은 품질의 음식물류 폐기물을 제공할 수 있다."}
{"patent_id": "10-2022-0112244", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명과 본 발명의 동작상의 이점 및 본 발명의 실시에 의하여 달성되는 목적을 충분히 이해하기 위해서는 본 발명의 바람직한 실시예를 예시하는 첨부 도면 및 첨부 도면에 기재된 내용을 참조하여야만 한다. 이하, 첨부된 도면을 참조하여 본 발명의 바람직한 실시예를 설명함으로써, 본 발명을 상세히 설명한다. 다만, 본 발명을 설명함에 있어서 이미 공지된 기능 혹은 구성에 대한 설명은, 본 발명의 요지를 명료하게 하기 위하 여 생략하기로 한다. 도 1은 본 발명의 일 실시예에 따른 음식물류 폐기물 수거 및 분해 장치의 사시도이고, 도 2는 도 1의 음식물류 폐기물 수거 및 분해 장치의 내부 구성을 설명하기 위한 개략도이며, 도 3은 본 발명의 일 실시예에 따른 음식 물류 폐기물 수거 및 분해 장치의 제어 구성을 설명하기 위한 블록도이다. 도 1 내지 도 3을 참조하면, 본 발명의 일 실시예에 따른 음식물류 폐기물 수거 및 분해 장치는, 음식물류 폐기 물을 수거하기 위한 음식물 수거장치로서, 수거 장치 함체, 디스플레이 모듈, 음식물 투입부 , 음식물 분석부, 음식물 분쇄부, 음식물 수거함(10,20) 등을 포함하고, 수거된 음식물류 폐기 물을 분해시키기 위한 음식물 분해장치로서, 분해 장치 함체, 사육 케이스 및 선반 프레임(23 0)을 포함한다. 그리고, 본 발명의 일 실시예에 따른 음식물류 폐기물 수거 및 분해 장치는, 음식물 수거장치 에 의해 수거된 음식물류 폐기물을 음식물 분해장치에 공급하기 위한 음식물 이송장치를 더 포 함하고, 음식물 수거장치, 음식물 분해장치 및 음식물 이송장치의 동작을 전반적으로 제어하기 위한 제어부를 더 포함한다. 여기서, 음식물 분해장치는 음식물 수거장치에 의해 수거된 음식물류 폐기물을 공급 받아서 이를 분 해시키기 위한 장치로서, 음식물 수거장치와 인접한 위치에 설치되고, 실질적으로 음식물 수거장치와 함께 하나의 장치 구조로 제공된다. 이에, 본 발명에 따른 음식물류 폐기물 수거 및 분해 장치는 수거된 음식물류 폐기물을 분해시키거나 재활용하기 위한 시설이나 장소로 이동할 필요없이 음식물류 폐기물이 수거된 현장에 서 바로 음식물류 폐기물을 분해시킬 수 있다. 특히, 본 실시예에서 음식물 분해장치는 음식물류 폐기물을 먹이로 살아가는 곤충 애벌레, 예컨대 동애등 에 애벌레를 이용하여 음식물류 폐기물을 분해시킨다. 구체적으로, 음식물 분해장치는 동애등에 애벌레를 사육하기 위한 공간을 제공하고, 수거된 음식물류 폐기물을 동애등에 애벌레의 사료로 공급 받아서 동애등에 애 벌레를 사육하는 동시에, 수거된 음식물류 폐기물을 분해시킨다. 즉, 본 실시예에서 음식물 분해장치는 동 애등에 애벌레를 이용하여 수거된 음식물류 폐기물을 친환경적으로 처리하면서 동애등에 애벌레의 사료로 재활 용하기 위한 장치라 할 수 있다. 참고로, '동애등에'는 파리목 동애등에과에 속하는 곤충으로, 질병이나 전염병을 일으키지 않고 사람에게 유익 한 곤충(익충)이다. 이러한 동애등에의 유충, 즉 동애등에 애벌레는 음식물 폐기물 등을 먹이로 살아가는데, 음 식물 폐기물 등을 분해하여 분변토를 만들어내고, 필수 아미노산이 풍부하고 충분한 단백질과 지방으로 이루어 져 가축이나 물고기의 사료로서 판매되는 등 산업적 활용성이 큰 곤충 애벌레이다. 최근에는 동애등에 애벌레로 만든 사료가 불포화지방산, 무기질 등 가축에게 필요한 영양소를 다량 함유하고 있어 면역력을 높여 살모넬라균 및 대장균의 발생을 줄여준다는 사실이 알려짐에 따라 가축 뿐만 아니라 반려동물의 사료로서 각광을 받고 있다. 이에, 동애등에 애벌레를 사육하는 방법 및 그에 따른 시설 혹은 장치에 대한 수요가 늘어나고 있다. 도 1 내지 도 3을 참조하면, 음식물 수거장치는 수거 장치 함체, 디스플레이 모듈, 음식물 투입 부, 음식물 분석부, 음식물 분쇄부, 재활용 음식물 수거함, 비재활용 음식물 수거함, 음식물 쓰레기통 수거함, 내부 환기 수단, 쓰레기통 이송부, 쓰레기통 대여부, 쓰레기통 적 재부 및 통신 모듈를 포함한다. 수거 장치 함체는 도 1에 도시된 바와 같이 음식물 수거장치의 전체적인 외관을 형성하는 것으로, 상 부 함체 및 하부 함체로 구성되어 있다. 여기서, 상부 함체는 디스플레이 모듈, 음식물 투 입부, 내부 환기 수단, 쓰레기통 대여부 등이 설치되는 공간을 제공하고, 하부 함체는 재 활용 음식물 수거함, 비재활용 음식물 수거함 및 음식물 쓰레기통 수거함이 수용되는 내부 공간을 제공한다. 그리고, 하부 함체에는 도 1에 도시된 바와 같이 그 내부 공간을 개폐할 수 있는 함체 도어 가 결합된다. 다만, 본 발명에 있어서 수거 장치 함체는 도 1에 도시된 박스 형상과 구조에 한정되지 아니 하고, 필요에 따라 다양한 형상과 구조로 적절히 변경될 수 있다. 참고로, 도 1에는 좌측 함체 도어만 도 시되어 있고 우측 함체 도어는 도시가 생략되어 있다. 디스플레이 모듈은 도 1에 도시된 바와 같이 수거 장치 함체의 전면 측에 배치되고 사용자에게 음식 물류 폐기물 수거와 관련된 안내 사항 등을 제공할 수 있다. 바람직하게, 디스플레이 모듈은 터치 스크린 혹은 터치 패널로 구현되는데, 이러한 경우 디스플레이 모듈은 표시 수단 뿐만 아니라 사용자로부터 필요 한 정보를 입력받을 수 있는 입력 수단으로도 기능할 수 있다. 사용자 인식부는 도 3에 도시된 바와 같이 음식물 수거장치에 음식물류 폐기물을 투입하기 전에 해당 사용자가 누구인지 인식 혹은 식별하기 위한 수단이다. 구체적으로, 사용자 인식부는 디스플레이 모듈 에 QR 코드를 표시하고 이를 사용자의 스마트폰으로 스캔하여 인식하는 방식으로 사용자를 인식하거나, 스 마트폰의 NFC 태그 등의 기능을 활용하여 태깅하는 방식으로 사용자를 인식할 수 있다. 이를 위해, 사용자는 자 신의 스마트폰에 음식물류 폐기물 수거 관리 서버(미도시)와 접속 가능한 전용 애플리케이션을 설치한 후, 회원 가입 내지 사용자 인증 등의 사전 절차를 진행하는 것이 필요하다. 이와 다르게, 사용자 인식부는 종래에 흔히 사용되는 방식으로 사용자마다 미리 지급된 음식물류 폐기물 카드를 인식하는 방식으로 사용자를 인식할 수 있다. 음식물 투입부는 도 1 내지 도 3에 도시된 바와 같이 사용자에 의해 음식물류 폐기물이 투입되는 공간으로 수거 장치 함체의 전면 측에 설치된다. 특히, 본 실시예에서 음식물 투입부는 사용자에 의해 투입되 는 음식물류 폐기물을 바로 음식물 수거함(10,20)으로 이동시키는 것이 아니라, 사용자에 의해 투입되는 음식물 류 폐기물을 음식물 수거함(10,20)으로 이동시키기 전에 일시적으로 보관하기 위한 공간이 마련된다. 구체적으 로, 음식물 투입부는 음식물류 폐기물이 담긴 음식물 쓰레기통이 올려지는 음식물 투입 지지대 및 개방된 음식물 투입구를 개폐하는 음식물 투입 도어를 포함한다. 여기서, 음식물 투입 지지대는 사용 자가 음식물 쓰레기통를 올려놓기 쉽도록 전방으로 인출 가능한 구조로 마련되고, 음식물 투입 도어는 평소에는 악취 방지나 미관을 위해 닫혀 있다가, 사용자 인식부에 의해 사용자 인식이 완료되면 위로 열려 서 음식물 투입구를 개방한다. 한편, 음식물 투입 지지대에는 투입된 음식물류 폐기물의 무게(배출량)를측정하기 위한 무게 측정 센서가 마련될 수 있는데, 예컨대 음식물 투입 지지대의 하부에 로드셀 방식의 무게 측정 센서가 설치될 수 있다. 참고로, 본 실시예에서 음식물 투입부에 투입되는 음식물류 폐기물은 음식물 쓰레기통에 담은 상태로 투입되고, 이하에서 이를 전제로 본 발명을 상세히 설명한다. 다만, 본 발명은 이에 한정되지 아니하고 음식물 쓰레기통에 담은 상태가 아닌 음식물류 폐기물만 음식물 투입부에 투입할 수도 있다. 음식물 분석부는 도 3에 도시된 바와 같이 음식물 투입부에 일시적으로 보관되어 있는 음식물류 폐기 물을 분석한다. 구체적으로, 음식물 분석부는 음식물 투입부에 있는 음식물류 폐기물에 이물질(뼈, 금속, 플라스틱 등)이 포함되어 있는지 여부를 분석하는데, 이를 위해 음식물 분석부는 음식물 투입부 와 인접한 위치에 설치되는 촬영 모듈(미도시)을 포함하고, 이를 이용하여 음식물 투입부에 있는 음 식물류 폐기물에 대한 영상을 촬영하고 이를 인공지능(AI) 기반의 머신 러닝이 적용되는 영상 분석 알고리즘을 통해 음식물류 폐기물에 이물질이 포함되어 있는지 여부를 분석하고 판정할 수 있다. 여기서, 이물질 포함 여부 를 분석하기 위한 영상 분석 알고리즘은 이미 널리 알려진 주지관용의 기술이기 때문에 본 실시예에서는 이에 대한 자세한 설명은 생략하기로 한다. 참고로, 본 발명에 있어서 이물질이 포함되어 있는 음식물류 폐기물은 재 활용이 불가능한 음식물류 폐기물로 취급한다. 즉, 음식물 분석부는 음식물 투입부에 있는 음식물류 폐기물을 분석하여 재활용 가능 여부를 판단할 수 있다. 한편, 음식물 수거장치는 음식물 분석부에 의해 음식물 투입부에 있는 음식물류 폐기물에 이물 질이 포함되어 있는 것으로 판단되면, 즉 재활용이 불가능한 것으로 판단되면, 재활용이 불가능한 음식물류 폐 기물에 대한 수거 비용을 사용자에게 청구할 수 있는데, 이때 사용자와의 불필요한 분쟁이나 다툼을 미리 방지 하기 위해, 음식물 투입부에 있는 음식물류 폐기물을 촬영한 영상을 디스플레이 모듈에 표시하여 사 용자에게 제공할 수 있고, 더 나아가 재활용이 불가능한 음식물류 폐기물에 대한 수거 비용을 부담하는 것과 음식물 투입부에 투입한 음식물류 폐기물을 반환받는 것 중 어느 하나를 선택할 수 있는 기회를 사용자에 게 제공할 수 있다. 참고로, 본 발명에 있어서 재활용이 가능한 음식물류 폐기물에 대해서는 수거 비용을 청구 하지 않고 그 품질 등급에 따라 적절한 리워드(보상)를 사용자에게 제공할 수 있다. 예컨대, 디스플레이 모듈이 터치 스크린으로 구현된 경우, 재활용이 불가능한 음식물류 폐기물에 대한 수 거 비용을 부담하는 것에 동의함을 나타내는 확인 버튼과, 수거 비용을 부담하는 것 대신에 음식물 투입부(13 0)에 투입한 음식물류 폐기물을 반환받겠다는 것을 나타내는 반환 버튼을 디스플레이 모듈에 표시하고, 사 용자로부터 확인 버튼과 반환 버튼 중 어느 하나를 선택 입력받도록 할 수 있다. 이때, 확인 버튼이 선택되면 사용자에게 재활용이 불가능한 음식물류 폐기물에 대한 수거 비용을 청구할 수 있고, 반환 버튼이 선택되면 음 식물 투입부에 있는 음식물류 폐기물을 반환(예컨대, 음식물 투입 도어를 열고 음식물 투입 지지대 를 전방으로 이동)하여 사용자에게 되돌려줄 수 있다. 음식물 분쇄부는 도 2 및 도 3에 도시된 바와 같이 수거 장치 함체의 내부에서 재활용 음식물 수거함 의 상측에 설치된다. 즉, 음식물 분쇄부는 음식물 투입부에 있는 음식물류 폐기물이 재활용 음식 물 수거함으로 이동하는 경로 상에 설치된다. 이러한 음식물 분쇄부는 음식물 투입부를 통해 투 입된 음식물류 폐기물을 재활용 음식물 수거함으로 이동시키기 전에 재활용에 더 적합하도록 음식물류 폐기 물을 잘게 분쇄한다. 이때, 음식물 분쇄부에 의해 잘게 분쇄된 음식물류 폐기물은 음식물 분쇄부의 하측에 배치된 재활용 음식물 수거함에 떨어져 수거된다. 다만, 본 발명에 있어서 음식물 분쇄부는 본 실시 예와 같이 음식물 투입부에 있는 음식물류 폐기물이 재활용 음식물 수거함으로 이동하는 경로 상에 설 치되는 것과 다르게, 재활용 음식물 수거함의 내부에 설치되거나, 전술한 음식물 이송장치의 음식물 공급 라인(183,184) 상에 설치될 수 있다. 내부 환기 수단은 도 1 및 도 2에 도시된 바와 같이 수거 장치 함체의 상부에 설치되는데, 음식물류 폐기물로 인해 오염된 음식물 수거장치 내부의 공기를 음식물 수거장치의 외부로 배출하기 위한 수단 으로, 일반적으로 환풍 팬 구조로 제공될 수 있다. 쓰레기통 이송부는 도 2에 도시된 바와 같이 음식물 투입부와 인접한 위치에 설치되는 이송 로봇 암 으로 구현된다. 이러한 쓰레기통 이송부는 음식물 분석부에 의해 음식물 투입부에 있는 음식물 류 폐기물에 이물질이 포함되어 있지 않는 것으로 판단되면, 즉 재활용 가능한 것으로 판단되면 음식물 투입부 에 있는 음식물류 폐기물을 음식물 분쇄부를 거쳐 재활용 음식물 수거함으로 이동시킨다. 이때, 음식물 투입부에 투입되는 음식물류 폐기물은 앞서 설명한 바와 같이 음식물 쓰레기통에 담은 상태로 투입되므로, 이송 로봇 암 구조의 쓰레기통 이송부는 음식물 투입부에 있는 음식물 쓰레기통을 파지한 후 음식물 분쇄부의 상측으로 이동시킨 후 일정 각도 이상으로 기울여서 음식물 쓰레기통에 담긴 음 식물류 폐기물을 음식물 분쇄부에 쏟아 부으면, 음식물 분쇄부에 의해 분쇄된 음식물류 폐기물은 그 하측에 배치된 재활용 음식물 수거함에 자유 낙하로 떨어져 수거된다. 그리고, 쓰레기통 이송부는 비 워진 음식물 쓰레기통을 음식물 쓰레기통 수거함의 상측으로 이동시킨 후 떨어드려 음식물 쓰레기통 수 거함에 음식물 쓰레기통을 수거한다. 이와 반대로, 쓰레기통 이송부는 음식물 분석부에 의해 음식물 투입부에 있는 음식물류 폐기물 에 이물질이 포함되어 있는 것으로 판단되면, 즉 재활용 불가능한 것으로 판단되면 음식물 투입부에 있는 음식물류 폐기물을 비재활용 음식물 수거함으로 이동시킨다. 구체적으로, 이송 로봇 암 구조의 쓰레기통 이 송부는 음식물 투입부에 있는 음식물 쓰레기통을 파지한 후 비재활용 음식물 수거함의 상측으 로 이동시킨 후 일정 각도 이상으로 기울여서 음식물 쓰레기통에 담긴 음식물류 폐기물을 비재활용 음식물 수거 함에 수거한다. 그리고, 쓰레기통 이송부는 비워진 음식물 쓰레기통을 음식물 쓰레기통 수거함(3 0)의 상측으로 이동시킨 후 떨어드려 음식물 쓰레기통 수거함에 음식물 쓰레기통을 수거한다. 한편, 본 실시예에서 쓰레기통 이송부는 이송 로봇 암 구조로 구현되지만, 본 발명은 이에 한정되지 아니 하고 본 발명에 있어서 쓰레기통 이송부는 이송 컨베이어 구조 등의 다른 다양한 구조로 구현될 수 있다. 쓰레기통 대여부는 도 1 및 도 2에 도시된 바와 같이 음식물류 폐기물을 담을 수 있는 음식물 쓰레기통 을 사용자에게 대여하기 위한 수단으로 수거 장치 함체의 전면 측에 설치된다. 구체적으로, 쓰레기통 대여부는 빈 음식물 쓰레기통이 올려지는 쓰레기통 지지대 및 개방된 쓰레기통 대여구를 개폐하는 쓰레기통 대여 도어를 포함한다. 여기서, 쓰레기통 지지대는 사용자가 음식물 쓰레기통를 꺼내기 쉽도록 전방으로 인출 가능한 구조로 마련되고, 쓰레기통 대여 도어는 평소에는 악취 방지나 미관을 위해 닫혀 있다가, 사용자가 음식물 투입부를 통해 이전에 대여받은 음식물 쓰레기통을 반납하면, 즉 이전에 대여받은 음식물 쓰레기통에 음식물류 폐기물을 담아서 음식물 투입부에 투입하여 음식물류 폐기물을 배출 완료하면, 위로 열려서 쓰레기통 대여구를 개방한다. 한편, 음식물 쓰레기통의 반납은 사용자가 음식물 쓰레기통에 음식물류 폐기물을 담은 상태로 음식물 투입부 를 통해 이루어지고, 음식물 투입부에 투입되어 반납된 음식물 쓰레기통은 쓰레기통 이송부 에 의해 그 내부에 담겨진 음식물류 폐기물이 재활용 음식물 수거함 또는 비재활용 음식물 수거함에 비 워진 후, 음식물 쓰레기통 수거함에 수거된다. 쓰레기통 적재부는 도 2에 도시된 바와 같이 수거 장치 함체의 내부에서 쓰레기통 대여부의 상 측에 배치되어 쓰레기통 대여부를 통해 사용자에게 지급하거나 대여할 음식물 쓰레기통이 복수개가 적 재 보관되어 있다. 이러한 쓰레기통 적재부는 적재 보관되어 있는 복수개의 음식물 쓰레기통을 이송 로 봇 암이나 이송 컨베이어 방식으로 쓰레기통 대여부에 연속적이고 순차적으로 공급할 수 있다. 또한, 쓰레 기통 적재부는 쓰레기통 대여부의 바로 위에서 최근 많이 사용되는 일회용 종이컵 디스펜서와 비슷한 구조로 구현될 수 있다. 통신 모듈은 도 3에 도시된 바와 같이 본 발명의 음식물류 폐기물 수거 및 분해 장치를 유선 또는 무선 네 트워크를 통해 음식물류 폐기물 수거 관리 서버와 통신 연결하기 위한 수단이다. 본 발명의 음식물류 폐기물 수 거 및 분해 장치는 이러한 통신 모듈을 통해 음식물류 폐기물 수거 관리 서버와 필요한 정보 혹은 데이터 를 주고 받을 수 있다. 도 1 내지 도 3을 참조하면, 음식물 분해장치는 외관을 형성하는 분해 장치 함체, 음식물류 폐기물을 먹이로 살아가는 곤충 애벌레를 사육하기 위한 공간을 제공하는 복수개의 사육 케이스, 및 복수개의 사육 케이스를 다층 구조로 지지하기 위한 선반 프레임을 포함한다. 본 실시예에서 곤충 애벌레로는 앞서 설명한 바와 같이 동애등에 애벌레가 사용된다. 다만, 본 실시예와 다르게 사육 케이스는 복수개가 아니라 1개의 큰 사이즈로 제공될 수도 있다. 분해 장치 함체는 도 1에 도시된 바와 같이 음식물 분해장치의 전체적인 외관을 형성하는 것으로, 그 내부 공간에는 복수개의 사육 케이스와 이를 지지하기 위한 선반 프레임이 배치된다. 이러한 분해 장 치 함체는 도 1에 도시된 바와 같이 음식물 수거장치의 수거 장치 함체의 우측에 결합된 박스 형상과 구조로 제공되되, 그 내부 공간을 개폐할 수 있는 함체 도어가 마련된다. 다만, 본 발명에 있어서 분해 장치 함체는 도 1에 도시된 형상과 구조에 한정되지 아니하고, 필요에 따라 다양한 형상과 구조로 적 절히 변경될 수 있다.사육 케이스는 도 2에 도시된 바와 같이 상측이 개방된 케이스 구조로, 그 내부 공간에는 동애등에 애벌레 들이 함수량 조절재와 함께 마련되고, 음식물 이송장치에 의해 음식물류 폐기물을 공급 받는다. 여기서, 함수량 조절재는 음식물류 폐기물의 함수량(혹은 수분)을 조절하기 위한 재료이다. 참고로, 동애등에 애벌레를 사육함에 있어서, 먹이로서의 음식물류 폐기물에 대한 제한은 크게 없으나 음식물 류 폐기물에 포함된 수분이 너무 많으면 폐사할 수 있기 때문에, 통상적으로 음식물류 폐기물의 함수량 조절을 위하여 음식물류 폐기물와 톱밥을 적정량 혼합하여 동애등에 애벌레에게 사료로서 제공하고 있다. 다만, 음식물류 폐기물의 함수량 조절을 위해 사용되는 톱밥은 단가가 비싸서 경제성을 떨어뜨리는 요인이 되고, 나무를 베어 만들기 때문에 친환경적이지 못하며, 사료 제조 시 작업 환경 내에 톱밥 가루가 날려 작업자 의 호흡기에 좋지 않은 영향을 준다는 문제점이 있다. 이에, 본 실시예에서는 함수량 조절재로 톱밥 대신에 또는 톱밥과 함께 건조된 커피찌꺼기를 사용하고 있다. 일 반적으로, 커피 음료를 제공하는 카페 혹은 커피숍에서 커피 음료를 제조하고 남은 커피찌꺼기가 많이 발생하게 된다. 이러한 커피찌꺼기는 커피박'이라고도 하며, 퇴비, 사료, 연료 등 다양한 분야에 있어서 재활용되고 있다. 즉, 본 실시예는 동애등에 애벌레를 사육함에 있어서 음식물류 폐기물의 함수량을 조절하기 위한 함수량 조절재로서 커피찌꺼기를 사용함으로써, 종래의 대표적인 함수량 조절재인 톱밥의 사용에 따른 위와 같은 문제 점을 해결할 수 있으면서도 커피찌꺼기의 재활용이라는 측면에서도 의미가 있다. 선반 프레임은 도 2에 도시된 바와 같이 분해 장치 함체의 내부에 설치되고 복수개의 사육 케이스 가 다층 구조로 수납되는 복수개의 공간을 제공한다. 이때, 선반 프레임은 작업자가 사육 케이스 의 교체를 위해 사육 케이스를 전방으로 인출 가능한 구조로 마련되는 것이 바람직하다. 도 2 및 도 3을 참조하면, 음식물 이송장치는 음식물 수거장치에 의해 수거된 음식물류 폐기물을 음 식물 분해장치에 공급하기 위한 구성으로, 바람직하게 사용자가 음식물 수거장치에 투입한 음식물류 폐기물 중 재활용이 가능한 음식물류 폐기물만을 음식물 분해장치에 공급한다. 더 바람직하게는 음식물 이 송장치는 동애등에 애벌레의 사료로 적합하도록 잘게 분쇄된 재활용이 가능한 음식물류 폐기물을 음식물 분해장치에 공급한다. 이를 위해, 음식물 수거장치의 음식물 수거함(10,20)은 도 1 및 도 2에 도시된 바와 같이 음식물 투입부 를 통해 투입된 음식물류 폐기물 중 재활용이 가능한 음식물류 폐기물을 수거되는 재활용 음식물 수거함 과, 음식물 투입부를 통해 투입된 음식물류 폐기물 중 재활용이 불가능한 음식물류 폐기물이 수거되는 비재 활용 음식물 수거함을 포함한다. 즉, 본 실시예에서 음식물류 폐기물은 재활용 가능한 음식물류 폐기물와 재활용이 불가능한 음식물류 폐기물을 구분하여 수거되는데, 여기서 재활용이 불가능한 음식물류 폐기물란 뼈, 금속, 플라스틱 등의 이물질이 포함되어 있는 음식물류 폐기물을 말한다. 구체적으로, 음식물 이송장치는 도 2에 도시된 바와 같이 재활용 음식물 수거함과 복수개의 사육 케이 스를 연결하는 음식물 공급 라인(183,184), 및 재활용 음식물 수거함의 음식물류 폐기물을 음식물 공 급 라인(183,184)을 통해 복수개의 사육 케이스로 이송하기 위한 동력을 제공하는 구동 수단을 포함 한다. 본 실시예에서 구동 수단은 고압의 펌프로 제공되고, 펌프의 전방 측에는 재활용 음식물 수거함과 연 통되어 재활용 음식물 수거함에 수거된 음식물류 폐기물을 흡입하기 위한 흡입구(181a)가 마련된다. 다만, 본 발명에 있어서 음식물 이송장치의 구동 수단은 펌프에 한정되지 아니하고, 필요에 따라 다른 다양한 수 단으로 적절히 변경될 수 있다. 이러한 구동 수단은 항상 작동하여 사육 케이스에 음식물류 폐기물을 공급하는 것이 아니라, 재활용 음식물 수거함에 수거된 음식물류 폐기물의 무게 측정값이 미리 설정된 값 이상이면 작동하거나, 사육 케이 스에 마련된 동애등에 애벌레들의 시간에 따른 분해 능력 등을 고려하여 미리 설정된 시간 패턴으로 작동 하도록 제어되는 것이 바람직히다. 음식물 공급 라인(183,184)은 도 2에 도시된 바와 같이 재활용 음식물 수거함 측에 일단부가 연결되는 메인 라인, 및 메인 라인에서 분기되어 복수개의 사육 케이스 각각에 연결되는 분기 라인들을 포함한다. 다만, 도 2에 도시된 음식물 공급 라인(183,184)은 예시적인 것으로, 예컨대 사육 케이스의 설 치 상태에 따라 적절히 변경될 수 있다. 여기서, 음식물 공급 라인(183,184)의 분기 라인은 사육 케이스와 인접한 단부가 사육 케이스의 내부 하단부까지 연장되어 공급되는 음식물류 폐기물이 사육 케이스의 밑에서 부터 쌓이도록 하는 것이 바 람직한데, 이는 공급되는 음식물류 폐기물이 동애등에 애벌레들의 위에서 떨어져 동애등에 애벌레들이 덮어버리 는 것을 방지하기 위함이다. 한편, 첨부된 도면들에는 도시되지 않았지만, 음식물 분해장치는 분해 장치 함체 내부의 온도를 일정 하기 유지하기 위한 히터 모듈(미도시)을 더 포함할 수 있다. 이러한 히터 모듈은 분해 장치 함체의 내부 에 설치되는데, 동애등에 애벌레가 추위에 취약한 습성을 고려하여 추운 날씨에 작동하도록 제어된다. 제어부는 도 3에 도시된 바와 같이 본 발명의 음식물류 폐기물 수거 및 분해 장치의 구성, 앞서 설명한 디 스플레이 모듈, 사용자 인식부, 음식물 투입부, 음식물 분석부, 음식물 분쇄부, 내부 환기 수단, 쓰레기통 이송부, 쓰레기통 대여부, 쓰레기통 적재부, 통신 모듈, 음식물 이송장치 등의 동작을 전반적으로 제어한다. 이하, 도 4 내지 도 8을 참조하여 본 발명의 다른 실시예에 따른 음식물류 폐기물 수거 및 분해 장치를 전술한 실시예와 상이한 점을 중심으로 설명한다. 도 4는 본 발명의 다른 실시예에 따른 음식물류 폐기물 수거 및 분해 장치의 사시도이고, 도 5는 도 4의 음식물 류 폐기물 수거 및 분해 장치의 내부 구성을 설명하기 위해 함체 도어를 개방한 상태를 도시한 사시도이다. 도 6은 도 4의 음식물류 폐기물 수거 및 분해 장치의 음식물 이송장치을 설명하기 위해, 음식물 분해장치에서 사육 케이스 몇개를 제거한 상태에서 도 5를 다른 방향에서 바라본 사시도이고, 도 7은 도 4의 음식물류 폐기물 수거 및 분해 장치에서 음식물 이송장치의 세부 구성을 설명하기 위한 개략도이다. 그리고, 도 8은 본 발명의 다른 실시예에 따른 음식물류 폐기물 수거 및 분해 장치의 제어 구성을 설명하기 위한 블록도이다. 도 4 내지 도 8을 참조하면, 본 실시예에 따른 음식물류 폐기물 수거 및 분해 장치는, 음식물류 폐기물을 수거 하기 위한 음식물 수거장치로서, 수거 장치 함체, 음식물 투입부, 음식물 분석부, 음식물 분쇄부, 음식물 수거함을 포함하고, 수거된 음식물류 폐기물을 분해시키기 위한 음식물 분해장치(40 0)로서, 분해 장치 함체, 사육 케이스 및 선반 프레임을 포함한다. 그리고, 본 실시예에 따른 음식물류 폐기물 수거 및 분해 장치는, 음식물 수거장치에 의해 수거된 음식물류 폐기물을 음식물 분해장 치로 이송시키기 위한 음식물 이송장치를 더 포함하고, 음식물 수거장치, 음식물 분해장치 및 음식물 이송장치의 동작을 전반적으로 제어하기 위한 제어부를 더 포함한다. 한편, 본 실시예에 따른 음식물류 폐기물 수거 및 분해 장치는, 첨부된 도면들에는 도시되지 않았지만, 필요에 따라 전술한 실시예에 따른 음식물류 폐기물 수거 및 분해 장치의 디스플레이 모듈, 사용자 인식부, 통신 모듈 등이 적용될 수 있고, 이에 대한 설명은 전술한 실시예를 준용하기로 한다. 음식물 수거장치의 수거 장치 함체는 도 4 내지 도 7에 도시된 바와 같이 음식물 수거장치의 전체적 인 외관을 형성하는 것으로, 음식물 투입부, 음식물 분석부, 음식물 분쇄부, 음식물 수거함 등이 설치되는 공간을 제공한다. 그리고, 수거 장치 함체의 하부에는 도 4 및 도 5에 도시된 바와 같이 그 내부 공간을 개폐할 수 있는 함체 도어가 마련된다. 음식물 투입부는 도 4 및 도 5에 도시된 바와 같이 사용자에 의해 음식물류 폐기물이 투입되는 공간으로 수거 장치 함체의 상부 측에 설치되고 개폐 가능하는 음식물 투입 도어를 포함한다. 특히, 본 실시예 에서 음식물 투입부는 사용자에 의해 투입되는 음식물류 폐기물을 바로 음식물 수거함 또는 음식물 분 쇄기로 이동시키는 것이 아니라, 사용자에 의해 투입되는 음식물류 폐기물을 음식물 수거함 또는 음식 물 분쇄기로 이동시키기 전에 일시적으로 보관하기 위한 공간이 형성된다. 한편, 본 실시예에서 음식물 투입부는 음식물류 폐기물이 음식물 쓰레기통에 담은 상태로 투입되는 방식의 전술한 실시예와 다르게, 음식물류 폐기물만 직접 투입되는 방식으로 적용된다. 음식물 분석부는 전술한 실시예와 마찬가지로 음식물 투입부에 일시적으로 보관되어 있는 음식물류 폐기물을 분석한다. 구체적으로, 음식물 분석부는 음식물 투입부에 있는 음식물류 폐기물에 이물질 (뼈, 금속, 플라스틱 등)이 포함되어 있는지 여부를 분석하는데, 이를 위해 음식물 분석부는 음식물 투입 부와 인접한 위치에 설치되는 촬영 모듈(미도시)을 포함하고, 이를 이용하여 음식물 투입부에 있는 음식물류 폐기물에 대한 영상을 촬영하고 이를 영상 분석 알고리즘을 통해 음식물류 폐기물에 이물질이 포함되 어 있는지 여부를 분석하고 판정할 수 있다.여기서, 음식물 분석부에 의해 이물질이 포함되어 있는 것으로 판단된 음식물류 폐기물은 재활용이 불가능 한 음식물류 폐기물로 취급되고, 음식물 분석부에 의해 이물질이 포함되어 있지 않은 것으로 판단된 음식 물류 폐기물은 재활용이 가능한 음식물류 폐기물로 취급된다. 즉, 음식물 분석부는 음식물 투입부에 있는 음식물류 폐기물에 이물질 포함 여부를 분석하여 재활용이 가능한 음식물류 폐기물인지 아니면 재활용이 불가능한 음식물류 폐기물인지를 판단할 수 있다. 그리고, 본 실시예에 있어서 이물질이 포함되어 재활용이 불가능한 음식물류 폐기물은 음식물 수거함으로 이동하고, 이물질이 포함되지 않은 재활용이 가능한 음식물류 폐기물은 음식물 분쇄부로 이동하게 된다. 이를 위해, 음식물 투입부의 하부에는 첨부된 도면들에는 도시하지 않았지만 음식물 수거함 및 음식물 분쇄부와 대응하는 위치에 각각 개폐 도어(미도시)가 설치되고, 음식물 분석부의 분석 및 판단 결과 에 따라 음식물 수거함 측의 개폐 도어와 음식물 분쇄부 측의 개폐 도어 중 어느 하나만을 선택적으로 개방하여 음식물 투입부에 있는 음식물류 폐기물을 음식물 수거함와 음식물 분쇄부 중 어느 하나 로 이동시킬 수 있다. 참고로, 본 실시예에서 음식물 수거함은 전술한 실시예와 다르게 재활용이 불가능한 음식물류 폐기물만이 수거되는 비재활용 음식물 수거함으로만 제공되고, 재활용이 가능한 음식물류 폐기물은 바 로 음식물 분쇄부 측으로 이동한다. 음식물 분쇄부는 도 5에 도시된 바와 같이 수거 장치 함체의 내부에서 음식물 투입부의 상측에 설치된다. 앞서 설명한 바와 같이 본 실시예에서 음식물 분석부에 의해 이물질이 포함되지 않아 재활용이 가능한 것으로 판단된 음식물류 폐기물은 바로 음식물 분쇄부로 이동하고, 이러한 음식물 분쇄부는 음식물 투입부를 통해 투입된 재활용이 가능한 음식물류 폐기물을 음식물 분해장치로 이송시키기 전 에 재활용에 더 적합하도록 음식물류 폐기물을 잘게 분쇄한다. 그리고, 음식물 분쇄부에 의해 잘게 분쇄된 재활용 가능한 음식물류 폐기물은 도 5에 도시된 바와 같이 음식물 분쇄부의 하측에 설치된 음식물 이송장 치의 음식물 안내부에 떨어져 담겨지고, 음식물 이송장치에 의해 음식물 분해장치로 이송 되어 음식물 분해장치의 사육 케이스들 각각에 공급된다. 도 4 내지 도 8을 참조하면, 음식물 분해장치는 외관을 형성하는 분해 장치 함체, 음식물류 폐기물을 먹이로 살아가는 곤충 애벌레를 사육하기 위한 공간을 제공하는 복수개의 사육 케이스, 및 복수개의 사육 케이스를 다층 구조로 지지하기 위한 선반 프레임을 포함한다. 본 실시예에서 곤충 애벌레로는 전술 한 실시예와 마찬가지로 동애등에 애벌레가 사용된다. 여기서, 음식물 분해장치는 전술한 실시예와 마찬가지로 음식물 수거장치에 의해 수거된 음식물류 폐 기물을 공급 받아서 이를 분해시키기 위한 장치로서, 음식물 수거장치와 인접한 위치에 설치되고 실질적으 로 음식물 수거장치와 함께 하나의 장치 구조로 제공된다. 분해 장치 함체는 도 4 및 도 5에 도시된 바와 같이 음식물 분해장치의 전체적인 외관을 형성하는 것으로, 그 내부 공간에는 복수개의 사육 케이스와 이를 지지하기 위한 선반 프레임이 설치된다. 이러 한 분해 장치 함체는 도 4 및 도 5에 도시된 바와 같이 음식물 수거장치의 수거 장치 함체의 우 측에 결합된 박스 형상과 구조로 제공되되, 그 내부 공간을 개폐할 수 있는 함체 도어가 마련된다. 한편, 분해 장치 함체의 상부에는 도 4 및 도 5에 도시된 바와 같이 음식물 분해장치 내부의 오염된 공기를 음식물 분해장치의 외부로 배출하기 위한 내부 환기 수단이 설치되는데, 이러한 내부 환기 수 단은 일반적으로 환풍 팬 구조로 제공될 수 있다. 사육 케이스는 도 5에 도시된 바와 같이 상측이 개방된 케이스 구조로, 그 내부 공간에는 전술한 실시예와 마찬가지로 동애등에 애벌레들이 함수량 조절재(톱밥이나 건조된 커피찌꺼기)와 함께 수용되고, 음식물 이송장 치에 의해 이송되는 음식물류 폐기물을 공급 받는다. 선반 프레임은 도 5에 도시된 바와 같이 분해 장치 함체의 내부에 설치되고 복수개의 사육 케이스 가 다층 구조로 수납되는 복수개의 공간을 제공한다. 이때, 선반 프레임은 작업자가 사육 케이스 의 교체를 위해 사육 케이스를 전방으로 인출 가능한 구조로 마련되는 것이 바람직하다. 도 5 내지 도 7을 참조하면, 음식물 이송장치는 전술한 실시예와 마찬가지로 음식물 수거장치에 의해 수거된 음식물류 폐기물을 음식물 분해장치로 이송하여 복수개의 사육 케이스 각각에 공급하기 위한 구성으로, 바람직하게 사용자가 음식물 수거장치에 투입한 음식물류 폐기물 중 재활용이 가능한 음식물류 폐기물만을 이송시켜 음식물 분해장치에 공급한다. 더 바람직하게는 음식물 이송장치는 동애등에 애 벌레의 사료로 적합하도록 잘게 분쇄된 재활용이 가능한 음식물류 폐기물을 이송시켜 음식물 분해장치에공급한다. 다만, 본 실시예에서 음식물 이송장치은 파이프와 같은 음식물 공급 라인(183,184)을 통해 음식물류 폐기 물을 음식물 분해장치로 이송시키는 전술한 실시예의 음식물 이송장치과 전혀 다른 구성 및 작동 메 커니즘으로 제공된다. 구체적으로, 음식물 이송장치은 도 5 내지 7에 도시된 바와 같이 음식물 수거장치에 의해 수거된 음 식물류 폐기물을 받아서 음식물 분해장치 측으로 안내 이동시키는 음식물 안내부 및 음식물 안내부 로부터 전달 받은 음식물류 폐기물을 담은 상태로 상하 방향으로 이동 가능하게 마련되어 다층 구조로 상 하로 배치되는 복수개의 사육 케이스 각각에 공급하는 음식물 공급부를 포함한다. 음식물 안내부는 도 5에 도시된 바와 같이 음식물 수거장치의 내부에서 음식물 투입부 및 음식 물 분쇄부의 하측에 설치되고, 음식물 투입부 및 음식물 분쇄부를 거쳐 떨어지는 음식물류 폐기 물을 받아서 이를 음식물 분해장치 측으로 안내하여 이동시킨다. 구체적으로, 음식물 안내부는 도 5 및 도 7에 도시된 바와 같이 음식물류 폐기물의 이동 방향을 기준으로 전방측과 후방측이 개방되는 절곡된 트레 이 구조로 마련되고, 위에서 떨어지는 음식물류 폐기물이 밖으로 튀거나 넘쳐 흐르지 않도록 제1 측판과 제2 측판이 일정 높이로 형성된다. 특히, 음식물 안내부는 별도의 구동 수단 없이 중력에 의해 음식 물류 폐기물을 음식물 분해장치 측으로 안내 이동시키기 위해 도 5 및 도 7에 도시된 바와 같이 그 바닥판 이 음식물 분해장치 측으로 하향 경사진 구조로 마련되는 것이 바람직하다. 한편, 음식물 수거장치 는 음식물 안내부에 의해 안내되는 음식물류 폐기물이 수거 장치 함체 일측을 통과하여 음식물 분해장치 측으로 이동하도록, 도 5에 도시된 바와 같이 음식물 안내부와 대응하는 위치에 있는 수거 장치 함체의 일측에 개구가 관통 형성되고, 이러한 개구를 개폐하기 위해 상하 방향으로 슬라이딩 작동하 는 도어부가 설치된다. 음식물 공급부는 도 6 및 도 7에 도시된 바와 같이 음식물 분해장치의 분해 장치 함체의 내부에 서 복수개의 사육 케이스와 인접한 일측에 마련된 공간에 설치된다. 이때, 음식물 공급부는 다층 구 조로 배치되는 복수개의 사육 케이스 각각에 순차적으로 음식물류 폐기물을 공급하도록, 상하 방향으로 이 동 가능하게 승강식 구조로 설치된다. 구체적으로, 음식물 공급부는 도 6 및 도 7에 도시된 바와 같이 음식물류 폐기물의 이동 방향을 기준으로 후방측과 상측이 개방된 함체 구조로 마련되되, 제1 측판, 제2 측판, 바닥판 및 전방 도어판 을 포함한다. 여기서, 바닥판은 별도의 구동 수단 없이 중력에 의해 음식물류 폐기물을 사육 케이스 측으로 이동시키기 위해 도 6 및 도 7에 도시된 바와 같이 사육 케이스 측으로 하향 경사진 구조로 마련되고, 전방 도어판은 바닥판에 대해 일정 각도 범위 내에서 회동 가능하게 마련되어 필요에 따라 전방측을 개방하거나 폐쇄할 수 있다. 이러한 음식물 공급부는 개방된 후방측을 통해 음식물 안내부로부터 음식물류 폐기물을 전달 받은 후 음식물류 폐기물을 담은 상태에서 상하 방향으로 이동할 수 있는데, 이때 전방 도어판는 닫힌 상태를 유지 한다. 그리고, 음식물 공급부는 복수개의 사육 케이스 중 음식물류 폐기물의 공급이 요구되는 사육 케이스와 대응하는 위치에 정지한 상태에서 전방 도어판을 시계 방향으로 회동시켜 열림 상태로 변경 하여 해당 사육 케이스의 내부로 음식물류 폐기물을 공급할 수 있다. 이때, 제어부는 음식물 공급부 의 상하 방향으로의 이동을 제어하고, 특히 다층 구조로 배치된 복수개의 사육 케이스의 각층 마다 해당 사육 케이스와 대응하는 위치에 음식물 공급부를 정지시키기 위한 위치 제어를 수행할 수 있다. 한편, 음식물 공급부를 상하 방향으로 이동시키기 위한 구성으로, 음식물 분해장치의 분해 장치 함체 의 내부에서 음식물 공급부의 설치 공간에는 도 6 및 도 7에 도시된 바와 같이 상하 방향으로 길게 연장되는 가이드 프레임(551,552) 및 승강 와이어(561,562)가 설치된다. 구체적으로, 가이드 프레임(551,552)은 음식물 공급부의 제1 측판과 제2 측판에 각각 배치되어 제1 측판과 제2 측판의 모서 리 부분을 이동 가능하게 지지하고, 승강 와이어(561,562)는 음식물 공급부의 제1 측판과 제2 측판 에 각각 배치되어 승강 블록(561a)을 통해 음식물 공급부와 연결된다. 이에, 음식물 공급부는 가이드 프레임(551,552)에 의해 상하 방향으로 이동 가능하게 지지되고, 승강 와이어(561,562)의 작동에 의해 상하 방향으로 이동하게 된다. 참고로, 첨부된 도면들에는 승강 와이어(561,562)의 작동을 위한 구동 수단은 도 시가 생략되었다. 이러한 가이드 프레임(551,552)와 승강 와이어(561,562)로 구현되는 승강 메커니즘은 예컨대 고층 전물에 설치 되는 엘리베이터에 일반적으로 적용되는 기술이므로, 이에 대한 상세한 설명은 생략하기로 한다. 참고로, 본 발 명에서 가이드 프레임 및 승강 와이어의 개수나 배치 구조는 본 실시예에 개시된 것에 한정되지 아니하고 필요 에 따라 적절히 변경될 수 있음은 물론이다. 제어부는 도 8에 도시된 바와 같이 본 발명의 음식물류 폐기물 수거 및 분해 장치의 구성, 앞서 설명한 음 식물 수거장치, 음식물 분해장치 및 음식물 이송장치의 동작을 전반적으로 제어한다. 본 발명은 전술한 실시예들에 한정되는 것이 아니고, 본 발명의 사상 및 범위를 벗어나지 않고 다양하게 수정 및 변형할 수 있음은 이 기술의 분야에서 통상의 지식을 가진 자에게 자명하다. 따라서 그러한 수정예 또는 변 형예들은 본 발명의 청구범위에 속한다 하여야 할 것이다."}
{"patent_id": "10-2022-0112244", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 음식물류 폐기물 수거 및 분해 장치의 사시도이다. 도 2는 도 1의 음식물류 폐기물 수거 및 분해 장치의 내부 구성을 설명하기 위한 개략도이다. 도 3은 본 발명의 일 실시예에 따른 음식물류 폐기물 수거 및 분해 장치의 제어 구성을 설명하기 위한 블록도이 다. 도 4는 본 발명의 다른 실시예에 따른 음식물류 폐기물 수거 및 분해 장치의 사시도이다. 도 5는 도 4의 음식물류 폐기물 수거 및 분해 장치의 내부 구성을 설명하기 위해 함체 도어를 개방한 상태를 도 시한 사시도이다. 도 6은 도 4의 음식물류 폐기물 수거 및 분해 장치의 음식물 이송장치을 설명하기 위해 도 5를 다른 방향에서 바라본 사시도이다. 도 7은 도 4의 음식물류 폐기물 수거 및 분해 장치에서 음식물 이송장치의 세부 구성을 설명하기 위한 개략도 이다. 도 8은 본 발명의 다른 실시예에 따른 음식물류 폐기물 수거 및 분해 장치의 제어 구성을 설명하기 위한 블록도 이다."}
