{"patent_id": "10-2024-0005673", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0113409", "출원번호": "10-2024-0005673", "발명의 명칭": "강유전체층을 포함하는 반도체 소자 및 이를 포함하는 전자 장치", "출원인": "삼성전자주식회사", "발명자": "이현재"}}
{"patent_id": "10-2024-0005673", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "n형 산화물 반도체층과 p형 산화물 반도체층을 포함하는 채널층; 상기 채널층상에 배치되는 강유전체층;상기 강유전체층상에 배치되는 게이트 전극; 및 상기 채널층상에 배치되며, 상기 채널층에 포함된 금속보다 환원력이 큰 원소를 포함하는 환원층;을 포함하는반도체 소자."}
{"patent_id": "10-2024-0005673", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 환원층은, 상기 채널층에 포함된 금속보다 환원력이 큰 금속을 포함하는 반도체 소자."}
{"patent_id": "10-2024-0005673", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 n형 산화물 반도체층과 상기 p형 산화물 반도체층은, 서로 다른 산소 함량을 포함하는 반도체 소자."}
{"patent_id": "10-2024-0005673", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 환원층은, 상기 n형 산화물 반도체층과 상기 p형 산화물 반도체층 중 산소 함량이 작은 층에 접하는 반도체 소자."}
{"patent_id": "10-2024-0005673", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 환원층은, 상기 n형 산화물 반도체층과 상기 p형 산화물 반도체층 중 어느 하나와 이격 배치되고, 상기 n형 산화물 반도체층과 상기 p형 산화물 반도체층 중 다른 하나와 접하는 반도체 소자."}
{"patent_id": "10-2024-0005673", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서,상기 n형 산화물 반도체층과 상기 p형 산화물 반도체층 중 상기 환원층과 접하는 층의 두께는, 상기 n형 산화물 반도체층과 상기 p형 산화물 반도체층 중 상기 환원층과 이격 배치되는 층의 두께 이하인 반도체 소자."}
{"patent_id": "10-2024-0005673", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서,상기 환원층의 두께는, 상기 n형 산화물 반도체층과 상기 p형 산화물 반도체층 중 상기 환원층과 접하는 층의 두께 이하인 반도체공개특허 10-2024-0113409-3-소자."}
{"patent_id": "10-2024-0005673", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1 항에 있어서,상기 n형 산화물 반도체층과 상기 p형 산화물 반도체층은,동일 금속을 포함하는 반도체 소자."}
{"patent_id": "10-2024-0005673", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1 항에 있어서,상기 환원층은,상기 강유전체층과 상기 채널층 사이에 배치되는 반도체 소자."}
{"patent_id": "10-2024-0005673", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 1 항에 있어서,상기 n형 산화물 반도체층 및 상기 p형 산화물 반도체층은,상기 채널층의 두께 방향으로 나란하게 배열되는 반도체 소자."}
{"patent_id": "10-2024-0005673", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 1 항에 있어서,상기 환원층의 두께는, 1nm이하인 반도체 소자."}
{"patent_id": "10-2024-0005673", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 1 항에 있어서,상기 n형 산화물 반도체층 및 상기 p형 산화물 반도체층 중 적어도 하나는,인듐 산화물(Indium oxide), 아연 산화물(Zinc oxide), 주석 산화물(Tin oxide), 니켈 산화물(Nickel oxide)및 갈륨 산화물(Gallium oxide) 중 적어도 하나를 포함하는 반도체 소자."}
{"patent_id": "10-2024-0005673", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 1 항에 있어서,상기 환원층은,알루미늄 산화물, 하프늄 산화물, 실리콘 산화물 중 적어도 하나를 포함하는 반도체 소자."}
{"patent_id": "10-2024-0005673", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 1 항에 있어서,상기 채널층상에 배치되며, 상기 게이트 전극과 이격 배치되는 소스 전극; 및 상기 채널층상에 배치되며, 상기 게이트 전극 및 상기 소스 전극과 이격 배치되는 드레인 전극;을 더 포함하는반도체 소자."}
{"patent_id": "10-2024-0005673", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 1 항에 있어서,제1 방향으로 연장된 필러(pillar);를 더 포함하고,상기 채널층은 상기 필러를 감싸고,공개특허 10-2024-0113409-4-상기 강유전체층은 상기 채널층을 감싸며,상기 게이트 전극은 상기 강유전체층을 감싸고,상기 환원층은 상기 필러와 상기 채널층 사이에 배치되는 반도체 소자."}
{"patent_id": "10-2024-0005673", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 15항에 있어서,상기 n형 산화물 반도체층과 상기 p형 산화물 반도체층은, 상기 제1 방향과 수직한 방향으로 나란하게 배열된 반도체 소자."}
{"patent_id": "10-2024-0005673", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 16 항에 있어서,상기 게이트 전극은, 상기 제1 방향으로 이격 배열된 복수 개의 서브 게이트 전극을 포함하는 반도체 소자."}
{"patent_id": "10-2024-0005673", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 1항에 있어서,상기 n형 산화물 반도체층 및 상기 p형 산화물 반도체층은,상기 채널층의 두께 방향과 수직한 방향으로 나란하게 배열되고, 상기 강유전체층은, 상기 n형 산화물 반도체층상에 배치되는 제1 강유전체층; 및 상기 n형 강유전체층과 이격 배치되면서 상기 p형산화물 반도체층상에 배치되는 제 강유전체층;을 포함하고,상기 게이트 전극은, 상기 제1 강유전체층상에 배치되는 제1 게이트 전극; 및 상기 제1 게이트 전극과 이격 배치되면서 상기 제2 강유전체층상에 배치되는 제2 게이트 전극을 포함하고, 상기 환원층은, 상기 n형 산화물 반도체층 및 상기 p형 산화물 반도체층 중 어느 하나와 접하고, 다른 하나와 접하지 않는 반도체 소자."}
{"patent_id": "10-2024-0005673", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 18항에 있어서,상기 n형 산화물 반도체층의 두께는,상기 p형 산화물 반도체층의 두께와 실질적으로 동일한 반도체 소자."}
{"patent_id": "10-2024-0005673", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 18 항에 있어서,상기 n형 산화물 반도체층과 상기 p형 산화물 반도체층 모두에 접하는 공통 드레인 전극;상기 n형 산화물 반도체층과 접하는 제1 소스 전극; 및상기 p형 산화물 반도체층에 접하는 제2 소스 전극;을 포함하는 반도체 소자."}
{"patent_id": "10-2024-0005673", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "강유전체층을 포함하는 반도체 소자 및 이를 포함하는 전자 장치가 개시된다. 개시된 강유전체층을 포함하는 반 도체 소자는 n형 산화물 반도체층과 p형 산화물 반도체층을 포함하는 채널층, 채널층상에 배치되는 강유전체층, 강유전체층상에 배치되는 게이트 전극 및 채널층상에 배치되며, 채널층에 포함된 금속보다 환원력이 큰 원소를 포함하는 환원층을 포함한다."}
{"patent_id": "10-2024-0005673", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 강유전체층을 포함하는 반도체 소자 및 이를 포함하는 전자 장치에 관한 것이다."}
{"patent_id": "10-2024-0005673", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "강유전체(ferroelectrics)는 외부에서 전기장이 가해지지 않아도 내부의 전기 쌍극자 모멘트가 정렬하여 자발적 인 분극(polarization)을 유지하는 강유전성(ferroelectricity)을 갖는 물질이다. 이러한 강유전 특성을 로직 소자 또는 메모리 소자에 적용하는 연구가 지속되고 있다."}
{"patent_id": "10-2024-0005673", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "예시적인 실시예는 강유전체층을 포함하는 반도체 소자 및 이를 포함하는 전자 장치를 제공한다."}
{"patent_id": "10-2024-0005673", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시예에 따른 반도체 소자는, n형 산화물 반도체층과 p형 산화물 반도체층을 포함하는 채널층; 상기 채널층 상에 배치되는 강유전체층; 상기 강유전체층상에 배치되는 게이트 전극; 및 상기 채널층상에 배치되며, 상기 채 널층에 포함된 금속보다 환원력이 큰 원소를 포함하는 환원층;을 포함한다. 그리고, 상기 환원층은, 상기 채널층에 포함된 금속보다 환원력이 큰 금속을 포함할 수 있다. 또한, 상기 n형 산화물 반도체층과 상기 p형 산화물 반도체층은, 서로 다른 산소 함량을 포함할 수 있다. 그리고, 상기 환원층은, 상기 n형 산화물 반도체층과 상기 p형 산화물 반도체층 중 산소 함량이 작은 층에 접할 수 있다. 또한, 상기 환원층은, 상기 n형 산화물 반도체층과 상기 p형 산화물 반도체층 중 어느 하나와 이격 배치되고, 상기 n형 산화물 반도체층과 상기 p형 산화물 반도체층 중 다른 하나와 접할 수 있다. 그리고, 상기 n형 산화물 반도체층과 상기 p형 산화물 반도체층 중 상기 환원층과 접하는 층의 두께는, 상기 n 형 산화물 반도체층과 상기 p형 산화물 반도체층 중 상기 환원층과 이격 배치되는 층의 두께 이하일 수 있다. 또한, 상기 환원층의 두께는, 상기 n형 산화물 반도체층과 상기 p형 산화물 반도체층 중 상기 환원층과 접하는 층의 두께 이하일 수 있다. 그리고, 상기 n형 산화물 반도체층과 상기 p형 산화물 반도체층은, 동일 금속을 포함할 수 있다. 또한, 상기 환원층은, 상기 강유전체층과 상기 채널층 사이에 배치될 수 있다. 그리고, 상기 n형 산화물 반도체층 및 상기 p형 산화물 반도체층은, 상기 채널층의 두께 방향으로 나란하게 배 열될 수 있다. 또한, 상기 환원층의 두께는, 1nm이하일 수 있다. 그리고, 상기 n형 산화물 반도체층 및 상기 p형 산화물 반도체층 중 적어도 하나는, 인듐 산화물(Indium oxide), 아연 산화물(Zinc oxide), 주석 산화물(Tin oxide), 니켈 산화물(Nickel oxide) 및 갈륨 산화물 (Gallium oxide) 중 적어도 하나를 포함할 수 있다. 또한, 상기 환원층은, 알루미늄 산화물, 하프늄 산화물, 실리콘 산화물 중 적어도 하나를 포함할 수 있다. 그리고, 상기 채널층상에 배치되며, 상기 게이트 전극과 이격 배치되는 소스 전극; 및 상기 채널층상에 배치되 며, 상기 게이트 전극 및 상기 소스 전극과 이격 배치되는 드레인 전극;을 더 포함할 수 있다. 그리고, 제1 방향으로 연장된 필러(pillar);를 더 포함하고, 상기 채널층은 상기 필러를 감싸고, 상기 강유전체 층은 상기 채널층을 감싸며, 상기 게이트 전극은 상기 강유전체층을 감싸고, 상기 환원층은 상기 필러와 상기 채널층 사이에 배치될 수 있다. 또한, 상기 n형 산화물 반도체층과 상기 p형 산화물 반도체층은, 상기 제1 방향과 수직한 방향으로 나란하게 배 열될 수 있다. 그리고, 상기 게이트 전극은, 상기 제1 방향으로 이격 배열된 복수 개의 서브 게이트 전극을 포함할 수 있다. 또한, 상기 n형 산화물 반도체층 및 상기 p형 산화물 반도체층은, 상기 채널층의 두께 방향과 수직한 방향으로 나란하게 배열되고, 상기 강유전체층은, 상기 n형 산화물 반도체층상에 배치되는 제1 강유전체층; 및 상기 n형 강유전체층과 이격 배치되면서 상기 p형 산화물 반도체층상에 배치되는 제 강유전체층;을 포함하고, 상기 게이 트 전극은, 상기 제1 강유전체층상에 배치되는 제1 게이트 전극; 및 상기 제1 게이트 전극과 이격 배치되면서 상기 제2 강유전체층상에 배치되는 제2 게이트 전극을 포함하고, 상기 환원층은, 상기 n형 산화물 반도체층 및 상기 p형 산화물 반도체층 중 어느 하나와 접하고, 다른 하나와 접하지 않을 수 있다. 그리고, 상기 n형 산화물 반도체층의 두께는, 상기 p형 산화물 반도체층의 두께와 실질적으로 동일할 수 있다. 또한, 상기 n형 산화물 반도체층과 상기 p형 산화물 반도체층 모두에 접하는 공통 드레인 전극; 상기 n형 산화 물 반도체층과 접하는 제1 소스 전극; 및 상기 p형 산화물 반도체층에 접하는 제2 소스 전극;을 포함할 수 있다."}
{"patent_id": "10-2024-0005673", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "예시적인 실시예에 의하면, 강유전체층을 포함하는 반도체 소자는 서로 다른 극성을 가지는 복수의 층을 포함하 기 때문에 서브 층이 메인 층에 소수 캐리어를 제공할 수 있다. 예시적인 실시예에 의하면, 강유전체층을 포함하는 반도체 소자는 소스 캐리어의 제공으로 반도체 소자의 큰 동작 전압폭(MW; Memory Window) 및 우수한 리텐션(retention) 특성을 확보할 수 있다. 예시적인 실시예에 의하면, 강유전체층을 포함하는 반도체 소자는 산소 함량이 다른 금속 산화물층을 이용하여 인버터 구현이 가능하다."}
{"patent_id": "10-2024-0005673", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 예시적인 실시예들에 대해 상세히 설명하기로 한다. 이하의 도면들에서 동일한 참조부호는 동일한 구성요소를 지칭하며, 도면상에서 각 구성요소의 크기는 설명의 명료성과 편의상 과장되어 있을 수 있다. 한편, 이하에 설명되는 실시예는 단지 예시적인 것에 불과하며, 이러한 실시예들로부터 다양한변형이 가능하다. 이하에서, \"상부\" 나 \"상\"이라고 기재된 것은 접촉하여 바로 위, 아래, 좌, 우에 있는 것뿐만 아니라 비접촉으 로 위, 아래, 좌, 우에 있는 것도 포함할 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복 수의 표현을 포함한다. 또한 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. “상기”의 용어 및 이와 유사한 지시 용어의 사용은 단수 및 복수 모두에 해당하는 것일 수 있다. 방법을 구성 하는 단계들에 대하여 명백하게 순서를 기재하거나 반하는 기재가 없다면, 이러한 단계들은 적당한 순서로 행해 질 수 있으며, 반드시 기재된 순서에 한정되는 것은 아니다. 또한, 명세서에 기재된 “...부”, “모듈” 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미 하며, 이는 하드웨어 또는 소프트웨어로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 제1, 제2 등의 용어는 다양한 구성 요소들을 설명하는데 사용될 수 있지만, 구성 요소들은 용어들에 의하여 한 정되어서는 안된다. 용어들은 하나의 구성 요소를 다른 구성 요소로부터 구별하는 목적으로만 사용된다. 도면에 도시된 구성 요소들 간의 선들의 연결 또는 연결 부재들은 기능적인 연결 및/또는 물리적 또는 회로적 연결들을 예시적으로 나타낸 것으로서, 실제 장치에서는 대체 가능하거나 추가의 다양한 기능적인 연결, 물리적 인 연결, 또는 회로 연결들로서 나타내어질 수 있다. 모든 예들 또는 예시적인 용어의 사용은 단순히 기술적 사상을 상세히 설명하기 위한 것으로서 청구범위에 의해 한정되지 않는 이상 이러한 예들 또는 예시적인 용어로 인해 범위가 한정되는 것은 아니다. 도 1은 예시적인 실시예에 따른 반도체 소자를 도시한 단면도이다. 도 1을 참조하면, 반도체 소자는 기판, 기판 상에 배치되는 채널층, 채널층 상에 배 치되는 환원층, 환원층상에 배치되는 강유전체층 및 강유전체층상에 배치되는 게이트 전극 을 포함할 수 있다. 반도체 소자는 기판과 채널층 사이에 배치되는 절연층을 더 포함 할 수 있다. 기판은 소정 극성의 도펀트로 도핑된 ₃족 반도체 물질을 포함할 수 있다. 여기서, ₃족 반도체 물질은 예 를 들어, Si, Ge 또는 SiGe를 포함할 수 있다. 하지만 이에 한정되는 것은 아니다. 기판의 도핑 농도는 후술하는 채널층의 다수 캐리어 농도에 비해 작을 수 있다. 예를 들면, 기판 에 도핑되는 도펀트의 도핑 농도는 약 1016 ~ 1016 cm-3 정도가 될 수 있다. 하지만, 반드시 이에 한정되는 것은 아니다. 기판에는 채널층이 마련되어 있다. 채널층은 극성이 서로 다른 제1 산화물 반도체층과 제2 산화물 반도체층를 포함할 수 있다. 제1 산화물 반도체층과 제2 산화물 반도체층 중 어느 하나 의 층은 채널층의 다수 캐리어를 포함하고, 나머지 하나는 소수 캐리어를 포함할 수 있다. 제1 산화물 반 도체층과 제2 산화물 반도체층 중 강유전체층과 인접한 층이 다수 캐리어를 포함하고, 강유전체 층과 인접하지 않는 층이 소수 캐리어를 포함할 수 있다. 예를 들어, 제1 산화물 반도체층은 소수 캐 리어를 포함할 수 있고, 제2 산화물 \"K도체층는 다수 캐리어를 포함할 수 있다. 제1 산화물 반도체층(12 1)의 두께는 제2 산화물 반도체층의 두께 이상일 수 있다. 예를 들어, 제2 산화물 반도체층은 전자를 다수 캐리어로 포함하는 n형 산화물 반도체를 포함할 수 있다. n형 산화물 반도체는 예를 들면, In, Ga, Zn 및 Sn 중 적어도 하나의 산화물을 포함할 수 있다. 구체적인 예로 서, n형 산화물 반도체는 IGZO(Indium Gallium Zinc Oxide)를 포함할 수 있다. 하지만, 이는 단지 예시적인 것 이다. 또는 제2 산화물 반도체층은 홀을 다수 캐리어로 포함하는 p형 산화물 반도체를 포함할 수 있다. p형 산 화물 반도체는 예를 들면, Sn 및 Ni 중 적어도 하나를 포함하는 산화물을 포함할 수 있다. 구체적인 예로서, p 형 산화물 반도체는 SnO를 포함할 수 있다. 하지만, 이는 단지 예시적인 것이다. 다른 관점에서, 제1 산화물 반도체층과 제2 산화물 반도체층은 산화물 반도체를 포함하면서 산소 함 량이 서로 다를 수 있다. 제1 산화물 반도체층의 산소 함량은 제2 산화물 반도체층의 산소 함량보다 클 수 있다. 예를 들어, 제1 산화물 반도체층은 SnO2을 포함하는 경우, 제2 산화물 반도체층은 SnO를포함할 수 있다. 제1 산화물 반도체층은 NiO을 포함하는 경우, 제2 산화물 반도체층은 NiO1-x(0<x<1)를 포함할 수 있다. 그러나, 이에 한정되지 않는다. 제1 산화물 반도체층과 제2 산화물 반도체층은 서로 다른 종류의 산화물 반도체를 포함하면서 산소 함량이 서로 다를 수 있다. 산소 함량이 다름으로써 제1 산화물 반도체층 및 제2 산화물 반도체층은 서로 다른 극성의 반도체 특성을 가질 수 있다. 채널층상에는 채널층에 포함된 금속보다 환원력이 큰 원소를 포함하는 환원층이 배치될 수 있다. 환원층은 채널층이 되는 산화물 반도체층의 적어도 일부를 환원시킴으로써 형성된 층일 수 있 다. 환원층은 금속 전구체에 기초하여 산화물 반도체층로부터 산소를 획득함으로써 금속 산화물이 될 수 있다. 예를 들어, 환원층은 알루미늄 산화물, 하프늄 산화물, 실리콘 산화물을 포함할 수 있다. 하지만, 반드시 이에 한정되지 않는다. 예를 들어, 환원층은 산화물 반도체층상에 금속 전구체를 이용하여 ALD(atomic layer deposition) 공정으로 형성될 수 있다. 금속 전구체는 채널층에 포함된 금속보다 환원력 이 큰 물질일 수 있다. 금속 전구체는 Al, Hf 및 Si 중 적어도 하나를 포함할 수 있다. 환원력이 큰 금속 전구체에 의해 산화물 반도체층의 일 영역은 환원될 수 있다. 산화물 반도체층 중 환원되지 않는 영역은 제1 산화물 반도체층이 되고, 산화물 반도체층 중 환원된 영역은 제2 산화물 반도체층가 될 수 있다. 그리고, 금속 전구체가 산화되어 형성된 층이 환원층이 될 수 있다. 즉 환원층은 산화물 반도체층 중 환원된 영역인 제2 산화물 반도체층와 접하고, 환원되지 않는 영역인 제1 산화물 반도체층 과 이격 배치될 수 있다. 환원된 영역인 제2 산화물 반도체층의 두께는 환원되지 않는 영역인 제1 산 화물 반도체층의 두께 이하일 수 있다. 예를 들어, n 형 반도체 특성을 갖는 SnO2 를 포함하는 산화물 반도 체층의 일면에 Sn보다 환원력이 큰 금속 전구체(예를 들어, Al)로 ALD 공정을 수행하면 산화물 반도체층의 일 영역은 환원되어 SnO이 될 수 있다. SnO은 p형 반도체 특성을 갖는다. 제1 산화물 반도체층 및 제2 산화물 반도체층은 동일한 원소를 포함할 수 있고, 동일한 원소로는 예 를 들어 주석(Sn) 산화물을 포함할 수 있으나, 반드시 이에 한정되지는 않는다. 제1 산화물 반도체층 및 제2 산화물 반도체층은 동일한 금속 산화물을 포함하면서 산소 함량이 서로 다를 수 있다. 제1 산화물 반도체층 및 제2 산화물 반도체층은 서로 다른 원소를 포함할 수 있고, 예를 들어 제1 산 화물 반도체층은 In, Ga, Zn 와 산소가 결합한 형태로 존재할 수 있고, 제2 산화물 반도체층은 주석 (Sn) 산화물을 포함할 수 있으나, 반드시 이에 한정되지 않고 다양한 원소를 포함할 수 있다. 환원층은 제1 산화물 반도체층 및 제2 산화물 반도체층 중 산소 함량이 작은 층에 접할 수 있다. 환원층의 두께는 접하는 산화물 반도체층의 두께이하일 수 있다. 예를 들어, 환원층의 두께는 제2 산화물 반도체층의 두께이하일 수 있다. 환원층 은 약 0.3nm 이상 약 1nm 이하의 두께를 가질 수 있으나 반드시 한정되지는 않는다. 환원층은 강유전체층 및 채널층 사이에 배치될 수 있다. 제1 산화물 반도체층, 제2 산화물 반도체층, 환원층 및 강유전체층은 채널층의 두께 방향으로 순차적으로 배열될 수 있다. 일 실시예에 따르면, n형 물질을 포함하는 제1 산화물 반도체층 및 p형 물질을 포함하는 제2 산화물 반도 체층은 n-p 접합(n-p junction) 형태를 가질 수 있다. 제2 산화물 반도체층의 소수 캐리어(minority carrier)인 전자는 제1 산화물 반도체층으로부터 제공받을 수 있다. 제2 산화물 반도체층에 소수 캐 리어가 공급되면, 전하 반전(inversion)이 가능하고, 분극 스위칭이 가능해져 반도체 소자의 성능이 향상될 수 있다. 다른 실시예에 따르면, p형 물질을 포함하는 제1 산화물 반도체층 및 n 물질을 포함하는 제2 산화물 반도 체층이 형성되면, 반도체 소자의 채널층은 p-n 접합(p-n junction) 형태를 가질 수 있다. 제2 산화물 반도체층의 소수 캐리어(minority carrier)인 홀을 제1 산화물 반도체층으로부터 제공받을 수 있다. 제2 산화물 반도체층에 소수 캐리어가 공급되면, 전하 반전(inversion)이 가능하고, 분극 스위칭이 가능해 져 반도체 소자의 성능이 향상될 수 있다. 채널층상에는 강유전체층이 마련되어 있다. 강유전체(ferroelectric material)는 내부의 전기 쌍극자 모멘트가 정렬하여 자발적인 분극(polarizatiion)을 유지하는 강유전성(ferroelectricity)을 갖는 물질이다. 강 유전체는 외부에서 전기장이 가해지지 않는 상태에서도 dipole에 의한 잔류 분극(remnant polarization)을 갖는 다. 강유전체층의 분극 방향은 강유전체층에 항전기장(coercive field) 이상의 전기장을 인가함으로써 바꿀 수 있으며, 이러한 강유전체층의 분극 방향에 따라 반도체 소자의 문턱 전압(threshold voltage)이 변화할 수 있다. 이런 점에서, 반도체 소자는 예를 들어, 비휘발성 메모리 장치에 응용될 수 있다. 강유전체층은 예를 들면, 플로라이트(fluorite)계 물질 또는 페로브스카이트(perovskite) 등을 포함할 수 있다. 페로브스카이트는 예를 들면, PZT, BaTiO3, PbTiO3 등을 포함할 수 있다. 플로라이트계 물질은 예를 들면, Hf. Si, Al, Zr, Y, La, Gd 및 Sr 중에서 선택된 적어도 하나의 산화물을 포함할 수 있다. 구체적인 예로서, 강유전체층은 하프늄 산화물(HfO), 지르코늄 산화물(ZrO) 및 하프늄-지르코늄 산화물 (HfZrO) 중 적어도 하나를 포함할 수 있다. 강유전체층을 구성하는 하프늄 산화물(HfO), 지르코늄 산화물 (ZrO) 및 하프늄-지르코늄 산화물(HfZrO)은 사방정계(orthorhombic crystal system)의 결정 구조를 가질 수 있 다. 강유전체층의 잔류 분극 및 항전기장의 조절을 위해, 강유전체층은 소정의 도펀트를 더 포함할 수 있 다. 예를 들어, 도펀트는 Si, Al, Y, La, Gd, Mg, Ca, Sr Ba, Ti, Zr, Hf 및 N 중에서 선택된 적어도 하나를 포함할 수 있다. 하지만 이는 단지 예시적인 것이다. 강유전체층의 잔류 분극은 강유전 물질의 종류, 도펀 트의 종류, 도펀트의 비율, 배향 등에 의해 결정될 수 있다. 강유전체층에는 게이트 전극이 마련되어 있다. 게이트 전극는 예를 들어 대략 1 Mohm/square 이 하의 전도성을 가질 수 있다. 하지만 이에 한정되지는 않는다. 게이트 전극은 금속 또는 금속 질화물을 포 함할 수 있다. 예를 들어, 금속은 알루미늄(Al), 텅스텐(W), 몰리브덴(Mo), 티타늄(Ti), 또는 탄탈륨(Ta)을 포 함할 수 있으며, 금속 질화물은 티타늄 질화물(TiN) 또는 탄탈 질화물(TaN)을 포함할 수 있다. 게이트 전극은 금속 카바이드, 폴리실리콘, 또는 이차원 도전성 물질을 포함할 수 있다. 금속 카바이드는 알루미늄 또는 실리콘이 도핑된(또는 함유된) 금속 카바이드일 수 있다. 구체적인 예로서 금속 카바이드는 TiAlC, TaAlC, TiSiC 또는 TaSiC를 포함할 수 있다. 게이트 전극은 복수개의 물질이 적층된 구조를 가질 수도 있다. 예를 들어, TiN/Al 등과 같이 금속 질화물층/금속층의 적층 구조 또는 TiN/TiAlC/W과 같이 금속 질 화물층/금속 카바이드층/금속층의 적층 구조를 가질 수 있다. 일 실시예에 따른 반도체 소자에서는 산화물 반도체층의 일면을 환원력이 큰 금속 전구체를 이용하여 환원 시킴으로써 제1 산화물 반도체층, 제1 산화물 반도체층과 극성이 다른 제2 산화물 반도체층 및 환원 층을 형성할 수 있다, 제1 산화물 반도체층 및 제2 산화물 반도체층은 서로 인접하게 위치하여 p-n 접합(junction) 또는 n-p 접합(junction)을 갖는 채널층이 될 수 있다. 제1 산화물 반도체층은 제2 산화물 반도체층의 소수 캐리어를 제공할 수 있다. 제2 산화물 반도체층의 공핍(deplection) 동작 및 반전 동작(inversion) 동작을 도와줄 수 있는 소수 캐리 어(minority carrier, 홀 또는 전자)를 제1 산화물 반도체층으로부터 공급받음으로써 비교적 낮은 전압으 로 강유전체층의 분극 방향을 바꿀 수 있다. 따라서, 반도체 소자의 큰 동작 전압폭(MW; Memory Window) 및 우수한 리텐션(retention) 특성을 확보할 수 있다. 일 실시예에 따르면, 기판 및 제1 산화물 반도체층 사이에 절연층이 배치될 수 있다. 절연층 은 예를 들어, 실리콘 산화물 및 게르마늄 산화물(Gemanium oxide) 중 적어도 하나를 포함할 수 있으나, 이에 한정되지 않고 인접한 물질층 사이를 절연할 수 있는 물질을 더 포함할 수 있다. 또한 절연층은 Ⅳ족 반도체 물질의 산화물(oxide) 또는 산화질화물(oxynitride)을 포함할 수 있다. 예를 들면, 절연층은 SiO2, GeO2, SiGeO4, SiON, GeON, SiGeON 등을 포함할 수 있다. 하지만, 이는 단지 예시적인 것이다. 도 2는 다른 예시적인 실시예에 따른 반도체 소자를 개략적으로 도시한 단면도이다. 도 2에 도시된 반도체 소자 는 전계 효과 트랜지스터일 수 있다. 도 2를 참조하면, 예시적인 실시예에 따른 반도체 소자는 기판, 기판상에 배치되는 절연층 , 절연층상에 배치되는 채널층, 채널층상에 배치되는 환원층, 환원층상에 배치 되는 강유전체층 및 강유전층상에 배치되는 게이트 전극을 포함할 수 있다. 기판, 절연층 , 채널층, 환원층, 강유전체층 및 게이트 전극은 도 1에서 설명한 기판, 절연 층, 채널층, 환원층, 강유전체층 및 게이트 전극에 대응하는 바 구체적인 설명은 생 략한다. 반도체 소자는 기판 및 절연층 중 적어도 하나를 포함하지 않을 수도 있다. 반도체 소자은 서로 이격 배치되면서 채널층과 전기적으로 연결된 소스 전극 및 드레인 전극 을 더 포함할 수 있다. 소스 전극 및 드레인 전극는 채널층의 다수 캐리어를 포함하는 층, 예를 들어, 제2 산화물 반도체층과 직접 접할 수 있다. 제1 산화물 반도체층과 소스 전극 및 드레인 전극(231, 232)사이에는 절연층이 더 배치될 수 있다. 제1 산화물 반도체층이 소수 캐리어를 포함하 기 때문에 전기적 단락을 방지하기 위함이다. 소스 전극 및 드레인 전극은 예를 들면, Ag, Au, Pt 또는 Cu 등과 같은 전기 전도성이 우수한 금속 물질 등을 포함할 수 있지만, 이에 한정되는 것은 아니다. 도 3a 및 도 3b는 종래 강유전체 전계효과 트랜지스터의 동작을 설명하기 위한 도면들이다. 도 3a 및 도 3b를 참조하면, 종래 강유전체 전계효과 트랜지스터는 소정 극성의 다수 캐리어를 가지는 산화 물 반도체를 포함하는 채널층과, 채널층에 마련된 강유전체층과, 강유전체층에 마련된 게이트 를 포함한다. 도면에는 채널층이 전자를 다수 캐리어로 가지는 n형 산화물 반도체(예를 들면, IGZO)을 포함하는 경우가 예시적으로 도시되어 있다. 도 3a는 게이트에 (+) 전압이 인가된 경우 강유전체층 내의 분극 상태를 도시한 것이며, 도 3b는 게이 트에 (-) 전압이 인가된 경우 강유전체층 내의 분극 상태를 도시한 것이다. 강유전체층의 분극 방향을 바꾸어 주기 위해서는 항전기장(coercive field) 이상의 전기장을 강유전체층 에 인가하여야 한다. 그러나, 종래 강유전체 전계효과 트랜지스터에서는 채널층에 소수 캐리어인 홀(hole)이 부족하기 때문에 도 3b에 도시된 바와 같이 게이트에 (-) 전압을 인가하는 경우에는 전하 스크 리닝(charge screening)이 일어나지 않아 강유전체층의 분극 방향을 바꿀 수 없게 된다. 따라서, 종래 강유 전체 전계효과 트랜지스터에서는 동작 전압폭(MW)이 작고, 리텐션 특성이 나빠질 수 있다. 도 4는 예시적인 실시예에 따른 반도체 소자에서 게이트 전극에 (-) 전압이 인가된 경우 강유전체층 내의 분극 상태를 도시한 것이다. 산화물 반도체층, 강유전체층 및 게이트 전극을 순차적으로 형성한 후 산화물 반도체층의 하면을 환 원시킴으로써 채널층을 형성할 수 있다. 환원층은 도면에 도시되어 있지 않으나, 제1 산화물 반도체층 의 하면상에 배치될 수 있다. 채널층은 전자를 다수 캐리어로 가지는 n형 산화물 반도체를 포함할 수 있다. 다른 관점에서, 채널층은 산소 농도가 서로 다른 제1 산화물 반도체층과 제2 산화물 반도체층 을 포함할 수 있다. 예를 들어, 제1 산화물 반도체층은 SnO2를 포함하고, 제2 산화물 반도체층 은 SnO을 포함할 수 있다. 제2 산화물 반도체층은 SnO2를 포함하는 물질로부터 환원되어 형성된 층일 수 있다 도 4의 제1 산화물 반도체층과 제2 산화물 반도체층의 상대적 위치 관계는 도 1의 제1 산화물 반도체층과 제2 산화물 반도체층의 상대적 위치 관계와 반대일 수 있다. 즉, 도 4의 제1 산화물 반도 체층은 강유전체층와 접하는 반면, 도 1의 제1 산화물 반도체층은 강유전체층과 이격 배치 될 수 있다. 제1 산화물 반도체층과 제2 산화물 반도체층의 상대적 위치는 산화물 반도체층이 환원되 는 영역에 따라 달라질 수 있다. 도 4를 참조하면, 게이트 전극에 (-) 전압이 인가된 경우에 p형 반도체 특성을 갖는 제2 산화물 반도체층 은 터널링 효과에 의해 n형 반도체 특성을 갖는 제1 산화물 반도체층에 소수 캐리어인 홀을 공급함으 로써 강유전체층의 분극 방향을 바꿀 수 있다. 환원층은 강유전체층의 분극 현상에 영향을 미치 지 않는 바, 환원층을 도시하지 않았다. 따라서, 비교적 낮은 전압으로도 강유전체층의 분극 방향을 바꿀 수 있으므로, 큰 동작 전압폭(MW) 및 우수한 리텐션 특성을 가지는 반도체 소자를 구현할 수 있다. 지금까지 채널층 중 강유전체층과 더 가까운 산화물 반도체층이 다수 캐리어를 포함하고, 채널층 중 강유전체층과 더 멀리 배치된 산화물 반도체층이 소수 캐리어를 포함한다고 하였으나, 이에 한정 되지 않는다. 산화물 반도체층 중 환원되지 않는 산화물 반도체층(예를 들어, 제1 산화물 반도체층이 다수 캐리어를 포함할 수도 있다. 그리고, 환원층은 제1 산화물 반도체층과 제2 산화물 반도체층 중 산소 함량이 작은 층에 접할 수 있다. 도 5는 도 2에 도시된 예시적인 실시예에 따른 반도체 소자를 포함하는 메모리 장치의 등가 회로도를 도시한 것 이다. 도 5를 참조하면, 반도체 소자는 2차원 배열된 복수의 반도체 소자를 포함할 수 있다. 이 때, 포함되는 복 수의 반도체 소자는 도 2에 도시된 반도체 소자를 포함할 수 있다. 또한, 반도체 소자는 복수의 비트 라인(BL), 복수의 선택 라인(SL), 및 복수의 워드 라인(WL)을 포함할 수 있다. 선택 라인(SL)은 반도체 소자의 소스 전극에 전기적으로 연결되고, 비트 라인(BL)은 반도체 소자의 드레인 전극에 전기적으로 연결되고, 복수의 워드 라인(WL)은 반도체 소자의 게이트 전극에 전기적으로 연결될 수 있다. 또한, 반도체 소자는 비트 라 인(BL)으로부터 출력되는 신호를 증폭하기 위한 증폭기(미도시됨)를 더 포함할 수 있다. 도 5에는 편의상 2차원 평면으로 도시되었지만, 반도체 소자는 2단 이상의 적층된 구조를 가질 수 있다. 예를 들어, 수직(vertical) 방향으로 연장된 복수의 비트 라인(BL)과 복수의 선택 라인(SL)이 2차원 배열되고, 수평 방향으로 연장된 복수의 워드 라인(WL)이 복수의 층에 각각 배열될 수 있다. 그러나, 반드시 이에 한정되는 것 은 아니며, 다양한 방식으로 메모리 셀을 3차원 배열할 수 있다. 도 6은 실시예에 따른 반도체 소자 어레이를 보이는 사시도이고, 도 7은 도 6의 'A' 부분의 확대 단면도이다. 도 6에 도시된 반도체 소자는 3차원(또는 수직) NAND(즉, VNAND) 또는 3차원 FeFET 메모리의 메모리 셀 스 트링일 수 있다. 도 6 및 도7을 참조하면, 기판상에는 복수 개의 게이트 전극 및 복수 개의 절연 소자가 교번적 으로 배열될 수 있다. 복수 개의 게이트 전극 및 복수 개의 절연 소자는 기판의 두께 방향으로 교차하면서 순차적으로 적층될 수 있다. 게이트 전극은 도 1에서 설명한 게이트 전극에 대응한다. 각 게이트 전극은 워드 라인(미도시), 스트링 선택 라인(미도시) 중 하나와 연결된다. 교번적으로 배열된 복수 개의 게이트 전극 및 복수 개의 절연 소자를 수직방향으로 관통하는 채널홀 (CH)가 제공된다. 채널홀(CH)는 복수 개의 층을 포함할 수 있다. 채널홀(CH)에는 기판의 두께 방향으로 연장된 필러 (pillar), 필러의 측면을 감싸는 환원층, 환원층의 측면을 감싸는 채널층, 채널층 의 측면을 감싸는 강유전체층을 포함할 수 있다. 그리고, 채널층은 제2 산화물 반도체층 및 제1 산화물 반도체층을 포함할 수 있다. 도 7에서 제1 산화물 반도체층이 채널층의 다수 캐리어를 포함하고, 제2 삼화물 반도체층가 채널층의 소수 캐리어를 포함할 수 있다. 환원층, 채널층, 및 강유전체층은 도 1에서 설명하는 환원층, 채널층, 및 강유전체층 에 대응하는 바, 구체적인 설명은 생략한다. 필라는 실리콘 산화물(Silicon Oxide)을 포함할 수 있다. 다른 표현으로, 필라은 기판의 표면과 수직한 방향으로 연장될 수 있다. 기판상에 공통 소스 영역(미도시)이 제공된다. 예를 들면, 공통 소스 영역은 기판과 상이한 제2 타입 을 가질 수 있다. 예를 들면, 공통 소스 영역은 n-타입을 가질 수 있다. 이하에서, 공통 소스 영역은 n-타입인 것으로 가정한다. 그러나 공통 소스 영역은 n-타입인 것으로 한정되지 않는다. 채널층의 일단은 공통 소스 영역과 접하고, 채널층의 타단은 드레인(미도시)과 접할 수 있다. 예를 들면, 드레인은 n 타입으로 도핑된 실리콘 물질을 포함할 수 있다. 도 8은 또 다른 예시적인 실시예에 따른 반도체 소자를 도시한 것이다. 도 8에 도시된 반도체 소자는 예를 들어 NOR 플래시 또는 NAND 플래시 등의 로직 회로를 구성하는데 사용 되는 인버터(invertor)가 될 수 있다. 도 8을 참조하면, 반도체 소자는 기판에 마련되는 제1 및 제2 전계효과 트랜지스터(400a, 400b)를 포 함한다. 여기서, 제1 및 제2 전계효과 트랜지스트터(400a, 400b) 각각은 강유전 전계효과 트랜지스터가 될 수 있다. 기판으로는 Si 기판이 사용될 수 있지만, 이는 단지 예시적인 것이다. 제1 전계효과 트랜지스터(400a)는 제1 채널층(420a), 제1 채널층(420a)에 마련되는 제1 강유전체층(440a) 및 제 1 강유전체층(440a)에 마련되는 제1 게이트 전극(450a)를 포함한다. 제1 채널층(420a)과 제1 강유전체층(440a) 사이에는 환원층(430a)가 더 배치될 수 있다. 제2 전계효과 트랜지스터(400b)는 제2 채널층(420b), 제2 채널층(420b)에 마련되는 제2 강유전체층(440b) 및 제 2 강유전체층(440b)에 마련되는 제2 게이트 전극(450b)를 포함할 수 있다. 제1 전계효과 트랜지스터(400a)는 제1 전극을 포함하고, 제2 전계효과 트랜지스터(400b)는 제2 전극 을 포함하며, 제1 및 제2 전계효과 트랜지스터(400a, 400b)는 제3 전극을 공유할 수 있다. 제1 전극 는 제1 전계효과 트랜지스터(400a)의 소스 전극이 될 수 있고, 제2 전극는 제2 전계효과 트랜지스터(400b)의 소스 전극이 될 수 있으며, 제3 전극 제1 및 전계효과 트랜지스터(400a, 400b)의 드레인 전극이 될 수 있다. 도면에는 제1 및 제2 전계효과 트랜지스터(400a, 400b)는 제3 전극을 공유한다고 하였으나, 이에 한정되지 않는다. 제3 전극은 제1 및 제2 전계효과 트랜지스터(400a, 400b)별로 구분될 수도 있다. 제1 채널층(420a)은 도 1에서 설명한 제2 산화물 반도체층의 물질에 대응하고, 제2 채널층(420b)은 도 1에 서 설명한 제1 산화물 반도체층의 물질에 대응할 수 있다. 산화물 반도체층을 형성한 후, 산화물 반도체층 중 제1 채널층(420a)에 대응하는 일부 영역을 금속 전구체를 이용하여 환원시킴으로써 제1 채널층(420a), 환원 층 및 제2 채널층(420b)을 형성할 수 있다. 이때, 제1 채널층(420a)의 두께와 제2 채널층(420b)의 두께는 실질적으로 동일할 수 있다. 여기서 산화물 반도체층은 Si, Sn, Ni 중 적어도 하나를 포함하는 산화물일 수 있 다. 일 실시예에 따른 반도체 소자는 환원층을 포함하지 않을 수도 있다. 예를 들어, 제1 산화물 반도체층, 제2 산 화물 반도체층 및 환원층을 형성한 후, 환원층이 제거될 수 있다. 또는, 환원층 없이, 다른 극성을 갖는 제1 산 화물 반도체 및 제2 산화물 반도체층이 형성될 수 있다. 도 9는 다른 실시예에 따른 반도체 소자를 도시한 도면이다. 도 1과 도 9을 참조하면, 도 9의 반도체 소자 는 환원층 없이 제1 산화물 반도체층 및 제2 산화물 반도체층만을 포함할 수 있다. 환원력이 큰 가스 분위기를 이용하여 제2 산화물 반도체층을 형성하는 경우 환원층이 형성되지 않을 수 있다. 또는, 기 형성된 환원층을 제거하고, 제2 산화물 반도체층상에 강유전체층을 형성하여 반도체 소자을 제 조할 수도 있다. 도 10은 예시적인 실시예에 따른 디스플레이 구동 집적회로(display driver IC; DDI) 및 DDI를 구비 하는 디스플레이 장치의 개략적인 블록 다이어그램이다. 도 10을 참조하면, DDI는 제어기, 전력 공급 회로, 드라이버 블록(driver block), 및 메 모리 블록(memory block)을 포함할 수 있다. 제어기는 중앙 처리 장치(main processing unit, MPU)로부터 인가되는 명령을 수신하여 디코딩하고, 상기 명령에 따른 동작을 구현하기 위해 DDI의 각 블록들을 제어한다. 전력 공급 회로는 제어기의 제어에 응답하여 구동 전압을 생성한다. 드라이버 블 록은 제어기의 제어에 응답하여 전력 공급 회로에서 생성된 구동 전압을 이용하여 디스플레이 패널을 구동한다. 디스플레이 패널은, 예를 들어, 액정 디스플레이 패널(liquid crystal display panel), 유기 발광 소자(organic light emitting device; OLED) 디스플레이 패널, 또는 플라즈마 디스플레이 패널(plasma display panel)일 수 있다. 메모리 블록은 제어기로 입력되는 명령 또는 제어기로 부터 출력되는 제어 신호들을 일시적으로 저장하거나, 필요한 데이터들을 저장하는 블록으로서, RAM, ROM 등의 메모리를 포함할 수 있다. 예를 들어, 메모리 블록은 상술한 실시예들에 따른 반도체 소자들을 포함할 수 있다. 도 11은 예시적인 실시예에 따른 전자 장치의 블록 다이어그램이다. 도 11을 참조하면, 전자 장치는 메모리 및 메모리 제어기를 포함한다. 메모리 제어기는 호 스트의 요청에 응답하여 메모리로부터의 데이터 독출 및/또는 상기 메모리로의 데이터 기입을 위하여 메모리를 제어할 수 있다. 메모리는 상술한 실시예들에 따른 반소체 소자를 포함할 수 있다. 도 12는 예시적인 실시예에 따른 전자 장치의 블록 다이어그램이다. 도 12를 참조하면, 전자 장치는 무선 통신 장치, 또는 무선 환경 하에서 정보를 전송 및/또는 수신할 수 있는 장치를 구성할 수 있다. 전자 장치는 제어기, 입출력 장치(I/O), 메모리, 및 무선 인 터페이스를 포함하며, 이들은 각각 버스를 통해 상호 연결되어 있다. 제어기는 마이크로프로세서(microprocessor), 디지털 신호 프로세서, 또는 이들과 유사한 처리 장치 중 적 어도 하나를 포함할 수 있다. 입출력 장치는 키패드(keypad), 키보드(keyboard), 또는 디스플레이 중 적어 도 하나를 포함할 수 있다. 메모리는 제어기에 의해 실행된 명령을 저장하는 데 사용될 수 있다. 예 를 들면, 메모리는 사용자 데이터를 저장하는 데 사용될 수 있다. 전자 장치는 무선 커뮤니케이션 네 트워크를 통해 데이터를 전송/수신하기 위하여 상기 무선 인터페이스를 이용할 수 있다. 무선 인터페이스 는 안테나 및/또는 무선 트랜시버(wireless transceiver)를 포함할 수 있다. 일부 실시예에서, 전자 장치 는 제3 세대 통신 시스템, 예컨대 CDMA(code division multiple access), GSM (global system for mobile communications), NADC (north American digital cellular), E-TDMA (extended-time division multiple access), 및/또는 WCDMA (wide band code division multiple access)와 같은 제3 세대 통신 시스템의 통신 인터페이스 프로토콜에 사용될 수 있다. 전자 장치의 메모리는 상술한 실시예들에 따른 반소체 소자를 포함할 수 있다. 도 13 및 도 14는 실시예에 따른 전자 장치에 적용될 수 있는 소자 아키텍쳐(architecture)를 개략적으로 보여 주는 개념도이다. 도 13을 참고하면, 전자 소자 아키텍쳐(architecture)는 메모리 유닛(memory unit) 및 제어 유닛 (control unit)을 포함할 수 있고, 산술 논리 유닛(arithmetic logic unit, ALU)을 더 포함할 수 있 다. 메모리 유닛, ALU 및 제어 유닛은 전기적으로 연결될 수 있다. 예를 들어, 전자 소자 아키 텍쳐(architecture)는 메모리 유닛, ALU 및 제어 유닛를 포함하는 하나의 칩으로 구현될 수 있다. 구체적으로, 메모리 유닛, ALU 및 제어 유닛은 온-칩(on-chip)에서 메탈 라인(metal line)으로 상호 연결되어 직접 통신할 수 있다. 메모리 유닛, ALU 및 제어 유닛은 하나의 기판 상에 모놀리식(monolithic)하게 집적되어 하나의 칩을 구성할 수도 있다. 전자 소자 아키텍쳐(칩)에는 입 출력 소자가 연결될 수 있다. 또한, 메모리 유닛은 메인 메모리 및 캐시 메모리를 모두 포함할 수 있다. 이러한 전자 소자 아키텍쳐(칩)는 on-chip memory processing unit일 수 있다. 메모리 유닛, ALU 및/또는 제어 유닛은 각각 독립적으로 상술한 실시예들에 따른 반도체 소자를 포함할 수 있다. 도 14를 참고하면, 캐시 메모리(cache memory), ALU 및 제어 유닛이 중앙 처리 장치(Central Processing Unit, CPU)을 구성할 수 있고, 캐시 메모리는 SRAM(static random access memory)으로 이루어질 수 있다. CPU와 별개로, 메인 메모리 및 보조 스토리지가 구비될 수도 있고, 또한, 입출력 소자가 구비될 수 있다. 메인 메모리는, 예를 들어, DRAM(dynamic random access memory) 일 수 있으며 상술한 실시예들에 따른 반도체 소자를 포함할 수 있다. 상술한 반도체 소자 (강유전 전계효과 트랜지스터)는 도 15에 도시된 인공지능 소자에 응용될 수도 있다. 인공지능 소자를 구성하는 각 메모리 셀은 1개의 전계효과 트랜지스터(FET)와 1개의 강유전 전계효과 트 랜지스터(FEFET)를 포함한다. 여기서, 강유전 전계효과 트랜지스터(FEFET)는 전술한 실시예들에 따른 반도체 소 자들 중 하나가 될 수 있다. Synaptic weight를 트랜지스터에 인가함에 따라 포텐셜이 강유전체에 전달됨으로써 메모리 상태를 변화시킬 수 있다. 이때 문턱 전압보다 큰 포텐셜이 강유전체에 가해지게 되면, pre-synaptic neuron의 포텐셜이 post-synaptic neuron으로 전달되는 뉴런-시냅스 동작이 일어날 수 있다. 경우에 따라, 전자 소자 아키텍쳐(architecture)는 서브-유닛들(sub-units)의 구분없이, 하나의 칩에서 컴퓨팅 (computing) 단위 소자들과 메모리 단위 소자들이 상호 인접하는 형태로 구현될 수 있다. 이상에서 실시예들이 설명되었으나, 이는 단지 예시적인 것에 불과하며, 당해 분야에서 통상적 지식을 가진 자라면 이로부터 다양한 변형이 가능하다. 상술한 반도체 소자 및 이를 포함하는 전자 장치는 도면에 도시된 실시예를 참고로 설명되었으나, 이는 예시적 인 것에 불과하며, 당해 분야에서 통상적 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 타 실시예가 가 능하다는 점을 이해할 것이다. 그러므로 개시된 실시예들은 한정적인 관점이 아니라 설명적인 관점에서 고려되 어야 한다. 권리범위는 전술한 설명이 아니라 특허청구범위에 나타나 있으며, 그와 동등한 범위 내에 있는 모든 차이점은 권리범위에 포함된 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2024-0005673", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 예시적인 실시예에 따른 반도체 소자를 개략적으로 도시한 단면도이다. 도 2는 다른 예시적인 실시예에 따른 반도체 소자를 개략적으로 도시한 단면도이다. 도 3a 및 도 3b는 종래 강유전체 전계효과 트랜지스터의 동작을 설명하기 위한 도면들이다. 도 4는 예시적인 실시예에 따른 반도체 소자에서 게이트 전극에 (-) 전압이 인가된 경우 강유전체층 내의 분극 상태를 도시한 것이다. 도 5는 도 1에 도시된 예시적인 실시예에 따른 반도체 소자를 포함하는 메모리 장치의 등가 회로도를 도시한 것 이다. 도 6은 또 다른 실시예에 따른 반도체 소자를 보이는 사시도이다. 도 7은 도 6의 'A' 부분의 확대 단면도이다. 도 8은 또 다른 예시적인 실시예에 따른 반도체 소자를 도시한 것이다. 도 9는 일 실시예에 따른 환원층을 포함하지 않는 반도체 소자를 도시한 도면이다. 도 10은 예시적인 실시예에 따른 디스플레이 구동 집적회로(display driver IC: DDI) 및 DDI를 구비하는 디스플 레이 장치의 개략적인 블록 다이어그램이다. 도 11는 예시적인 실시예에 따른 전자 장치의 블록 다이어그램이다. 도 12는 다른 예시적인 실시예에 따른 전자 장치의 블록 다이어그램이다. 도 13 및 도 14는 예시적인 실시예에 따른 전자 장치에 적용될 수 있는 소자 아키텍쳐(architecture)를 개략적 으로 보여주는 개념도이다. 도 15는 예시적인 실시예에 따른 인공지능 소자에 적용되는 회로를 도시한 도면이다."}
