{"patent_id": "10-2017-0105709", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0020578", "출원번호": "10-2017-0105709", "발명의 명칭": "외부 광에 기반하여 이미지를 처리하는 방법 및 이를 지원하는 전자 장치", "출원인": "삼성전자주식회사", "발명자": "박경태"}}
{"patent_id": "10-2017-0105709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,제1 파장 대역에 대한 응답 특성을 갖도록 설정된 제1 광 센서;상기 제1 파장 대역과는 상이한 제2 파장 대역에 대한 응답 특성을 갖도록 설정된 제2 광 센서;적어도 하나의 카메라 모듈; 및상기 제1 광 센서, 상기 제2 광 센서 및 상기 카메라 모듈과 전기적으로 연결된 프로세서;를 포함하고,상기 프로세서는,상기 카메라 모듈을 이용하여 외부 객체에 대응하는 이미지를 획득하고,상기 제1 광 센서를 이용하여 상기 제1 파장 대역에 대응하는 제1 신호를 획득하고,상기 제2 광 센서를 이용하여 상기 제2 파장 대역에 대응하는 제2 신호를 획득하고,상기 제1 신호 및 상기 제2 신호에 기초하여 지정된 광 정보 중 적어도 하나의 광 정보를 선택하고,상기 선택된 적어도 하나의 광 정보에 기초하여 상기 이미지의 화이트 밸런스를 조정하도록 설정된, 전자 장치."}
{"patent_id": "10-2017-0105709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제1 광 센서는 상기 제1 파장 대역의 적어도 일부로서 자외선 파장 대역에 응답하도록 설정되고,상기 제 2 광 센서는 상기 제2 파장 대역의 적어도 일부로서 적외선 파장 대역에 응답하도록 설정된, 전자장치."}
{"patent_id": "10-2017-0105709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 지정된 광 정보의 적어도 일부로서, 제1 환경과 관계된 적어도 하나의 조건 각각에 대응하는 상기 제1 파장 대역 및 상기 제2 파장 대역의 태양광 정보를 저장하는 메모리;를 더 포함하는, 전자 장치."}
{"patent_id": "10-2017-0105709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 프로세서는,상기 제1 신호 및 상기 제2 신호가 상기 메모리에 저장된 제1 조건에 대응하는 상기 제1 파장 대역 및 상기 제2파장 대역의 제1 태양광 정보와 지정된 비율 이상으로 대응하는 경우, 상기 제1 태양광 정보를 선택하도록 설정된, 전자 장치."}
{"patent_id": "10-2017-0105709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 프로세서는,상기 선택된 제1 태양광 정보에 기초하여 상기 전자 장치의 운용 환경을 상기 제1 환경으로 판단하고, 상기 전자 장치의 주변 광원을 상기 태양광으로 판단하도록 설정된, 전자 장치.공개특허 10-2019-0020578-3-청구항 6 제3항에 있어서,상기 프로세서는,상기 제1 신호에 따른 제1 값 및 상기 제2 신호에 따른 제2 값 간의 비율에 기초하여 상기 선택된 적어도 하나의 광 정보에 대응하는 색온도 값을 산출하도록 설정된, 전자 장치."}
{"patent_id": "10-2017-0105709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 프로세서는,상기 산출된 색온도 값을 상기 이미지의 화이트 밸런스 조정에 이용하도록 설정된, 전자 장치."}
{"patent_id": "10-2017-0105709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서,상기 프로세서는,상기 산출된 색온도 값과 상기 선택된 적어도 하나의 광 정보를 매핑하여 상기 메모리에 저장하도록 설정된, 전자 장치."}
{"patent_id": "10-2017-0105709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 프로세서의 제어에 대응하여 상기 이미지를 출력하고, 상기 이미지 출력으로부터 지정된 시간의 경과 후,상기 이미지를 상기 화이트 밸런스가 조정된 이미지로 전환하여 출력하는 디스플레이;를 더 포함하는, 전자 장치."}
{"patent_id": "10-2017-0105709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "전자 장치에 있어서,이미지 센서를 포함하는 적어도 하나의 카메라 모듈; 및상기 카메라 모듈과 전기적으로 연결된 프로세서;를 포함하고,상기 프로세서는,상기 카메라 모듈을 이용하여 외부 객체에 대응하는 이미지를 획득하고,상기 이미지 센서를 이용하여 제1 파장 대역에 대응하는 제1 신호 및 상기 제1 파장 대역과는 상이한 제2 파장대역에 대응하는 제2 신호를 획득하고,상기 제1 신호 및 상기 제2 신호에 기초하여 지정된 광 정보 중 적어도 하나의 광 정보를 선택하고,상기 선택된 적어도 하나의 광 정보에 기초하여 상기 이미지의 화이트 밸런스를 조정하도록 설정된, 전자 장치."}
{"patent_id": "10-2017-0105709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 이미지 센서는,상기 제1 파장 대역의 적어도 일부로서 자외선 파장 대역에 대한 응답 특성을 갖는 제1 필터 및 상기 제2 파장대역의 적어도 일부로서 적외선 파장 대역에 대한 응답 특성을 갖는 제2 필터를 포함하는, 전자 장치."}
{"patent_id": "10-2017-0105709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "전자 장치의 외부 광에 기반하여 이미지를 처리하는 방법에 있어서,공개특허 10-2019-0020578-4-외부 객체에 대응하는 이미지를 획득하는 동작;제1 파장 대역에 대응하는 제1 신호를 획득하는 동작;상기 제1 파장 대역과는 상이한 제2 파장 대역에 대응하는 제2 신호를 획득하는 동작;상기 제1 신호 및 상기 제2 신호에 기초하여 지정된 광 정보 중 적어도 하나의 광 정보를 선택하는 동작; 및상기 선택된 적어도 하나의 광 정보에 기초하여 상기 이미지의 화이트 밸런스를 조정하는 동작;을 포함하는, 외부 광에 기반하여 이미지를 처리하는 방법."}
{"patent_id": "10-2017-0105709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 제1 신호를 획득하는 동작은,상기 제1 파장 대역의 적어도 일부로서 자외선 파장 대역에 응답하는 동작;을 포함하고,상기 제2 신호를 획득하는 동작은,상기 제2 파장 대역의 적어도 일부로서 적외선 파장 대역에 응답하는 동작;을 포함하는, 외부 광에 기반하여 이미지를 처리하는 방법."}
{"patent_id": "10-2017-0105709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12항에 있어서,상기 적어도 하나의 광 정보를 선택하는 동작은,제1 환경과 관계된 적어도 하나의 조건 각각에 대응하는 상기 제1 파장 대역 및 상기 제2 파장 대역의 태양광정보를 저장하는 동작;을 포함하는, 외부 광에 기반하여 이미지를 처리하는 방법."}
{"patent_id": "10-2017-0105709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 적어도 하나의 광 정보를 선택하는 동작은,상기 적어도 하나의 조건 각각에 대응하는 상기 제1 파장 대역 및 상기 제2 파장 대역의 태양광 정보 중 상기제1 신호 및 상기 제2 신호가 지정된 비율 이상으로 대응하는 제1 태양광 정보를 선택하는 동작;을 더포함하는, 외부 광에 기반하여 이미지를 처리하는 방법."}
{"patent_id": "10-2017-0105709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 제1 태양광 정보를 선택하는 동작은,상기 제1 태양광 정보에 기초하여 상기 전자 장치의 운용 환경을 상기 제1 환경으로 판단하는 동작; 및상기 제1 태양광 정보 또는 상기 제1 환경 판단에 기초하여 상기 전자 장치의 주변 광원을 상기 태양광으로 판단하는 동작;을 포함하는, 외부 광에 기반하여 이미지를 처리하는 방법."}
{"patent_id": "10-2017-0105709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제12항에 있어서,상기 제1 신호에 따른 제1 값 및 상기 제2 신호에 따른 제2 값 간의 비율에 기초하여 상기 선택된 적어도 하나의 광 정보에 대응하는 색온도 값을 산출하는 동작;을 더 포함하는, 외부 광에 기반하여 이미지를 처리하는 방법."}
{"patent_id": "10-2017-0105709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서,공개특허 10-2019-0020578-5-상기 이미지의 화이트 밸런스를 조정하는 동작은,상기 산출된 색온도 값을 상기 화이트 밸런스에 이용하는 동작;을 포함하는, 외부 광에 기반하여 이미지를 처리하는 방법."}
{"patent_id": "10-2017-0105709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제17항에 있어서,상기 색온도 값을 산출하는 동작은,상기 산출된 색온도 값과 상기 선택된 적어도 하나의 광 정보를 매핑하여 저장하는 동작;을 포함하는, 외부 광에 기반하여 이미지를 처리하는 방법."}
{"patent_id": "10-2017-0105709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제12항에 있어서,상기 이미지를 출력하는 동작;을 더 포함하고,상기 이미지를 출력하는 동작은,상기 이미지 출력으로부터 지정된 시간의 경과 후, 상기 이미지를 상기 화이트 밸런스가 조정된 이미지로 전환하여 출력하는 동작;을 포함하는, 외부 광에 기반하여 이미지를 처리하는 방법."}
{"patent_id": "10-2017-0105709", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시 예는, 제1 파장 대역에 대한 응답 특성을 갖도록 설정된 제1 광 센서, 상기 제1 파장 대역과 는 상이한 제2 파장 대역에 대한 응답 특성을 갖도록 설정된 제2 광 센서, 적어도 하나의 카메라 모듈 및 상기 제1 광 센서, 상기 제2 광 센서, 상기 카메라 모듈과 전기적으로 연결된 프로세서를 포함하고, 상기 프로세서는 상기 카메라 모듈을 이용하여 외부 객체에 대응하는 이미지를 획득하고, 상기 제1 광 센서를 이용하여 상기 제1 파장 대역에 대응하는 제1 신호를 획득하고, 상기 제2 광 센서를 이용하여 상기 제2 파장 대역에 대응하는 제2 신호를 획득하고, 상기 제1 신호 및 상기 제2 신호에 기초하여 지정된 광 정보 중 적어도 하나의 광 정보를 선택 하고, 상기 선택된 적어도 하나의 광 정보에 기초하여 상기 이미지의 화이트 밸런스를 조정하도록 설정된 전자 장치를 개시한다. 이 외에도 명세서를 통하여 파악되는 다양한 실시 예가 가능하다."}
{"patent_id": "10-2017-0105709", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 문서에서 개시되는 다양한 실시 예들은, 외부 광에 기반하여 이미지를 처리하는 전자 장치와 관련된다."}
{"patent_id": "10-2017-0105709", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "이미지 촬영 장치는 운용 환경에 따른 광원의 색온도(Color temperature) 특성을 반영하여 색상의 차이를 구현 할 수 있다. 이와 관련하여, 임의의 피사체는 주변 광원의 색온도에 대응하는 반사광을 발생시킬 수 있으며, 예 컨대 화이트(white) 색상의 피사체는 낮은 색온도를 갖는 광원에 대하여 레드(red) 계열의 반사광을, 높은 색온 도의 광원에 대해서는 블루(blue) 계열의 반사광을 발생시킬 수 있다. 이미지 촬영 장치는 상술과 같은 피사체 의 반사광을 수광하여 재현함으로서, 피사체에 대한 색조를 표현할 수 있다."}
{"patent_id": "10-2017-0105709", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "다양한 광원의 상이한 색온도로 인하여 야기되는 피사체의 색상 차이를 보상하기 위한 일환으로, 근래의 이미지 촬영 장치는 화이트 밸런스(white balance) 기능을 탑재하고 있다. 그러나, 종래의 화이트 밸런스 기능은 주변 광원의 속성(예: 종류) 판단에 대한 신뢰도가 미진하거나 또는, 이미지 촬영 장치 운용 시 사용자로 하여금 주 변 광원의 속성을 직접 설정하도록 하는 번거로움을 수반할 수 있다. 본 문서에서 개시되는 다양한 실시 예들은, 주변 광원의 속성을 판단하여 대응하는 색온도를 식별함으로서, 신 뢰도 높게 화이트 밸런스를 조정할 수 있는 외부 광에 기반하여 이미지를 처리하는 방법 및 이를 지원하는 전자 장치를 개시한다."}
{"patent_id": "10-2017-0105709", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시 예에 따른 전자 장치는, 제1 파장 대역에 대한 응답 특성을 갖도록 설정된 제1 광 센서, 상기 제1 파장 대역과는 상이한 제2 파장 대역에 대한 응답 특성을 갖도록 설정된 제2 광 센서, 적어도 하나의 카메라 모듈 및 상기 제1 광 센서, 상기 제2 광 센서, 상기 카메라 모듈과 전기적으로 연결된 프로세서를 포함할 수 있다. 일 실시 예에 따르면, 상기 프로세서는, 상기 카메라 모듈을 이용하여 외부 객체에 대응하는 이미지를 획득하고, 상기 제1 광 센서를 이용하여 상기 제1 파장 대역에 대응하는 제1 신호를 획득하고, 상기 제2 광 센 서를 이용하여 상기 제2 파장 대역에 대응하는 제2 신호를 획득하고, 상기 제1 신호 및 상기 제2 신호에 기초하여 지정된 광 정보 중 적어도 하나의 광 정보를 선택하고, 상기 선택된 적어도 하나의 광 정보에 기초하여 상기 이미지의 화이트 밸런스를 조정할 수 있다."}
{"patent_id": "10-2017-0105709", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "다양한 실시 예에 따르면, 주변 광원의 속성 판단에 기초하여 전자 장치가 운용되는 환경을 식별할 수 있다. 다양한 실시 예에 따르면, 이미지 프로세싱을 수행함에 있어, 식별된 전자 장치의 운용 환경에 따라 화이트 밸 런스를 가변적으로 조정하여 출력 이미지에 대한 색조 개선을 구현할 수 있다. 이 외에, 본 문서를 통해 직접적 또는 간접적으로 파악되는 다양한 효과들이 제공될 수 있다."}
{"patent_id": "10-2017-0105709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 다양한 실시 예가 첨부된 도면을 참조하여 기재된다. 그러나, 이는 본 발명을 특정한 실시 형 태에 대해 한정하려는 것이 아니며, 본 발명의 실시 예의 다양한 변경(modification), 균등물(equivalent), 및/ 또는 대체물(alternative)을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대 해서는 유사한 참조 부호가 사용될 수 있다. 본 문서에서, \"가진다\", \"가질 수 있다\", \"포함한다\", 또는 \"포함할 수 있다\" 등의 표현은 해당 특징(예: 수치, 기능, 동작, 또는 부품 등의 구성요소)의 존재를 가리키며, 추가적인 특징의 존재를 배제하지 않는다. 본 문서에서, \"A 또는 B\", \"A 또는/및 B 중 적어도 하나\", 또는 \"A 또는/및 B 중 하나 또는 그 이상\" 등의 표현 은 함께 나열된 항목들의 모든 가능한 조합을 포함할 수 있다. 예를 들면, \"A 또는 B\", \"A 및 B 중 적어도 하나\", 또는 \"A 또는 B 중 적어도 하나\"는, 적어도 하나의 A를 포함, 적어도 하나의 B를 포함, 또는 적어도 하나의 A 및 적어도 하나의 B 모두를 포함하는 경우를 모두 지칭할 수 있다. 본 문서에서 사용된 \"제1\", \"제2\", \"첫째\", 또는 \"둘째\" 등의 표현들은 다양한 구성요소들을, 순서 및/또는 중 요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구성요소들을 한정하지 않는다. 예를 들면, 제1 사용자 기기와 제2 사용자 기기는, 순서 또는 중요도와 무관하게, 서로 다른 사용자 기기를 나타낼 수 있다. 예를 들면, 본 문서에 기재된 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 바꾸어 명명될 수 있다. 어떤 구성요소(예: 제1 구성요소)가 다른 구성요소(예: 제2 구성요소)에 \"(기능적으로 또는 통신적으로) 연결되 어((operatively or communicatively) coupled with/to)\" 있다거나 \"접속되어(connected to)\" 있다고 언급된 때에는, 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로 연결되거나, 다른 구성요소(예: 제3 구성요 소)를 통하여 연결될 수 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소(예: 제1 구성요소)가 다른 구성 요소(예: 제2 구성요소)에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 상기 어떤 구성요 소와 상기 다른 구성요소 사이에 다른 구성요소(예: 제3 구성요소)가 존재하지 않는 것으로 이해될 수 있다.본 문서에서 사용된 표현 \"~하도록 구성된(또는 설정된)(configured to)\"은 상황에 따라, 예를 들면, \"~에 적합 한(suitable for)\", \"~하는 능력을 가지는(having the capacity to)\", \"~하도록 설계된(designed to)\", \"~하도 록 변경된(adapted to)\", \"~하도록 만들어진(made to)\", 또는 \"~를 할 수 있는(capable of)\"과 바꾸어 사용될 수 있다. 용어 \"~하도록 구성(또는 설정)된\"은 하드웨어적으로 \"특별히 설계된(specifically designed to)\"것만 을 반드시 의미하지 않을 수 있다. 대신, 어떤 상황에서는, \"~하도록 구성된 장치\"라는 표현은, 그 장치가 다른 장치 또는 부품들과 함께 \"~할 수 있는\" 것을 의미할 수 있다. 예를 들면, 문구 \"A, B, 및 C를 수행하도록 구성 (또는 설정)된 프로세서\"는 해당 동작을 수행하기 위한 전용 프로세서(예: 임베디드 프로세서), 또는 메모리 장 치에 저장된 하나 이상의 소프트웨어 프로그램들을 실행함으로서, 해당 동작들을 수행할 수 있는 범용 프로세서 (generic-purpose processor)(예: CPU 또는 application processor)를 의미할 수 있다. 본 문서에서 사용된 용어들은 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 다른 실시 예의 범위를 한 정하려는 의도가 아닐 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 용어들은 본 문서에 기재된 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가질 수 있다. 본 문서에 사용된 용어 들 중 일반적인 사전에 정의된 용어들은 관련 기술의 문맥 상 가지는 의미와 동일 또는 유사한 의미로 해석될 수 있으며, 본 문서에서 명백하게 정의되지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 경우에 따라서, 본 문서에서 정의된 용어일지라도 본 문서의 실시 예들을 배제하도록 해석될 수 없다. 본 문서의 다양한 실시 예들에 따른 전자 장치는, 예를 들면, 스마트폰(smartphone), 태블릿 PC(tablet personal computer), 이동 전화기(mobile phone), 영상 전화기, 전자책 리더기(e-book reader), 데스크톱 PC (desktop PC), 랩탑 PC(laptop PC), 넷북 컴퓨터(netbook computer), 워크스테이션(workstation), 서버, PDA(personal digital assistant), PMP(portable multimedia player), MP3 플레이어, 모바일 의료기기, 카메라, 또는 웨어러블 장치(wearable device) 중 적어도 하나를 포함할 수 있다. 다양한 실시 예에 따르면 웨 어러블 장치는 엑세서리 형(예: 시계, 반지, 팔찌, 발찌, 목걸이, 안경, 콘택트 렌즈, 또는 머리 착용형 장치 (head-mounted-device(HMD)), 직물 또는 의류 일체 형(예: 전자 의복), 신체 부착 형(예: 스킨 패드(skin pad) 또는 문신), 또는 생체 이식 형(예: implantable circuit) 중 적어도 하나를 포함할 수 있다. 어떤 실시 예들에서, 전자 장치는 가전 제품(home appliance)일 수 있다. 가전 제품은, 예를 들면, 텔레비전, DVD 플레이어(Digital Video Disk player), 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스(set-top box), 홈 오토매이션 컨트롤 패널(home automation control panel), 보안 컨트롤 패널(security control panel), TV 박스(예: 삼성 HomeSync™, 애플TV™, 또는 구글 TV™), 게임 콘솔(예: Xbox™, PlayStation™), 전자 사전, 전자 키, 캠코더, 또는 전자 액자 중 적어도 하나를 포함할 수 있다. 다른 실시 예에서, 전자 장치는, 각종 의료기기(예: 각종 휴대용 의료측정기기(혈당 측정기, 심박 측정기, 혈압 측정기, 또는 체온 측정기 등), MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 또는 초음파기 등), 내비게이션(navigation) 장치, 위성 항법 시스템 (GNSS(Global Navigation Satellite System)), EDR(event data recorder), FDR(flight data recorder), 자동 차 인포테인먼트(infotainment) 장치, 선박용 전자 장비(예: 선박용 항법 장치, 자이로 콤파스 등), 항공 전자 기기(avionics), 보안 기기, 차량용 헤드 유닛(head unit), 산업용 또는 가정용 로봇, 금융 기관의 ATM(automatic teller's machine), 상점의 POS(point of sales), 또는 사물 인터넷 장치(internet of things) (예: 전구, 각종 센서, 전기 또는 가스 미터기, 스프링클러 장치, 화재경보기, 온도조절기(thermostat), 가로등, 토스터(toaster), 운동기구, 온수탱크, 히터, 보일러 등) 중 적어도 하나를 포함할 수 있다. 어떤 실시 예에 따르면, 전자 장치는 가구(furniture) 또는 건물/구조물의 일부, 전자 보드(electronic board), 전자 사인 수신 장치(electronic signature receiving device), 프로젝터(projector), 또는 각종 계측 기기(예: 수도, 전기, 가스, 또는 전파 계측 기기 등) 중 적어도 하나를 포함할 수 있다. 다양한 실시 예에서, 전자 장치는 전술한 다양한 장치들 중 하나 또는 그 이상의 조합일 수 있다. 어떤 실시 예에 따른 전자 장치는 플렉서블 전자 장치일 수 있다. 또한, 본 문서의 실시 예에 따른 전자 장치는 전술한 기기들에 한정되지 않으며, 기술 발전에 따른 새로운 전자 장치를 포함할 수 있다. 이하, 첨부 도면을 참조하여, 다양한 실시 예에 따른 전자 장치가 설명된다. 본 문서에서, 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공지능 전자 장치)를 지칭할 수 있다.본 발명을 서술하기에 앞서, 도 1a, 도 1b 및 도 1c를 통하여 본 발명의 다양한 실시 예에 참조될 수 있는 SPD 특성을 살펴보기로 한다. 도 1a, 도 1b 및 도 1c는 일 실시 예에 따른 전자 장치의 다양한 운용 환경에서 검출되는 광의 다양한 SPD를 도 시한 도면이다. 일 실시 예에서, 전자 장치는 적어도 하나의 광 센서를 탑재하여 운용 환경 상의 광원으로부터 발광되는 광의 적어도 일부를 검출할 수 있다. 이와 관련하여 도 1a를 참조하면, 전자 장치는 실외 환경에 해당하는 제1 운용 환경에서 상기 제1 운용 환경에 수반되는 제1 광원(예: 태양)의 광을 검출하고, 검출된 광에 대한 SPD(spectral power distribution)를 출력할 수 있다. 도 1a에 도시된 적어도 하나의 SPD는 제1 운용 환경의 다양한 조건(예: 일간 시간 또는 대기 상태 등)에서 검출되는 상기 제1 광원의 광에 대한 다양한 SPD를 중첩하여 나타낸 양상으로 이해될 수 있다. 일 실시 예에서, 상기 제1 광원(예: 태양)은 제1 운용 환경의 다양한 조건(예: 일간 시간 또는 대기 상태 등)에 따라 상이한 색온도를 갖는 광을 발광할 수 있으며, 각각의 조건에 대응하는 적어도 하나의 광은 전 (whole) 파장 대역에 걸쳐 상호 유사한 형태의 SPD로 출력될 수 있다. 예를 들어, 상기 적어도 하나의 광은 상기 제1 광원(예: 태양)의 방사 원리에 근거하여 흑체복사(black body radiation)의 분포 형태를 나타내는 SPD로 출력될 수 있다. 다만, 제1 운용 환경의 다양한 조건에 따른 적어도 하나의 광에 대한 SPD는, 각각의 광에 대응하는 색온도에 따라 상기 흑제복사의 분포 형태가 상호 적어도 일부 상이할 수 있 다. 예를 들어, 상기 적어도 하나의 광 중 높은 색온도를 갖는 광일수록 단파장 대역(예: 자외선 파장 대역 또 는 400 nm 인접 대역)에서 광 분포 비율이 증가하고, 장파장 대역(예: 적외선 파장 대역 또는 700 nm 인접 대역)에서는 광 분포 비율이 감소할 수 있다. 대응적으로, 낮은 색온도를 갖는 광일수록 상기 단파장 대역에서 는 분포 비율이 감소하고, 상기 장파장 대역에서는 분포 비율이 증가할 수 있다. 상술된 바에 기초하면, 제1 운 용 환경에 따른 제1 광원(예: 태양)의 광은 해당 색온도에 기초하여 정형화된 형태(예: 흑체복사의 분포 형 태를 기초로 하여 단파장 및 장파장 대역에서 상반되는 광 분포 비율을 갖는 형태)의 SPD로 출력될 수 있다. 상술과 관련하여 도 1b 및 도 1c를 참조하면, 상기 전자 장치가 실내에 해당하는 제2 운용 환경 또는 제3 운용 환경에서, 다양한 속성(예: 제조사 또는 제품 모델 등)을 갖는 제2 광원(예: 형광등)에 따른 광을 검 출하여 출력하는 SPD 또는, 다양한 속성을 갖는 제3 광원(예: LED)에 대응하여 출력하는 SPD는 상술한 제1 광원(예: 태양)의 SPD 특성을 포함하지 않을 수 있다. 예를 들어, 상기 제2 광원(예: 형광등)은 광원의 크 기 또는 배치되는 장소에 따라 색온도가 가변적으로 조정될 수 있으며, 상기 제3 광원(예: LED)의 경우 여기 파 장(excitation wavelength)에 대응하여 색온도가 조정될 수 있는 바, 제1 광원(예: 태양)의 SPD 특성(예: 흑체 복사의 분포 특성 또는, 색온도에 따라 단파장 및 장파장 대역에서 상반되는 광 분포 특성 등)은 제2 광원(예: 형광등) 또는 제3 광원(LED)에 따른 SPD에서 발현되지 않을 수 있다. 상술에 기초하면, 일 실시 예에 따른 전자 장치는 임의의 운용 환경에서 검출되는 광에 대한 SPD를 분석함으로 서, 상기 광을 발광하는 광원의 속성(예: 광원의 종류)을 식별하고, 식별된 광원의 속성에 기초하여 상기 운용 환경(예: 실외 또는 실내)을 판단할 수 있다. 예를 들어, 전자 장치는 임의의 운용 환경에서 출력되는 SPD가 상 기 제1 광원(예: 태양)의 SPD 특성과 동일 또는 유사한 특성을 포함하는 경우, 상기 SPD와 관계되는 광원을 제1 광원(예: 태양)으로 식별할 수 있다. 나아가, 전자 장치는 상기 제1 광원(예: 태양)의 식별에 기초하여 실외 환 경에서 운용되고 있는 것으로 판단할 수 있다. 일 실시 예에서, 전자 장치는 광원의 속성(예: 광원의 종류) 또는 운용 환경에 대응하는 색온도를 결정하고, 특 정 구성요소의 기능 수행에 상기 결정된 색온도를 참조할 수 있다. 예를 들어, 전자 장치는 임의의 피사체에 대 한 촬영 영상(예: 스틸 이미지 또는 동영상)의 이미지 프로세싱과 관련하여, 상기 결정된 색온도를 기반으로 화 이트 밸런스(white balance)를 조정할 수 있다. 이하 첨부된 도면을 참조하여, 광원의 속성(예: 광원의 종류) 식별 또는 전자 장치의 운용 환경 판단을 기반으로 촬영 영상에 대한 화이트 밸런스를 조정하는 다양한 실시 예 및 이를 구현하는 전자 장치의 기능 동작들에 대하여 살펴보기로 한다. 도 2는 일 실시 예에 따른 전자 장치의 구성을 도시한 도면이다. 도 2를 참조하면, 전자 장치는 카메라 모듈, 센서 모듈, 메모리, 프로세서 또는 디스 플레이를 포함할 수 있다. 다양한 실시 예에서, 전자 장치는 상술된 구성요소들 중 적어도 하나를 생 략하거나, 다른 구성요소를 추가적으로 포함할 수 있다. 예를 들어, 전자 장치는 하우징(미도시) 또는 통신 회로(또는 통신 인터페이스, 또는 통신 모듈)(미도시)를 더 포함할 수 있다. 상기 하우징은 전자 장치 외관의 적어도 일부를 구현할 수 있으며, 전자 장치의 구성요소들은 상기 하우징 내부로 배치되거나, 상기 하우징 상에(on the housing) 배치될 수 있다. 상기 통신 회로는 전자 장치와 적어도 하나의 외부 장치 간 의 통신을 지원할 수 있다. 예를 들어, 상기 통신 회로는 외부 장치와 규정된 프로토콜에 따른 유선 통신 또는 무선 통신을 수립하고, 상기 유선 통신 또는 무선 통신을 기반으로 외부 장치와 상호작용함으로서 다양한 데이 터(예: 카메라 모듈에 의하여 촬영된 영상 데이터), 신호 또는 정보 자원을 송수신할 수 있다. 상기 카메라 모듈은 적어도 하나로 구비되어 전자 장치의 주변 영역에 대한 영상(예: still image 또 는 video)을 촬영할 수 있다. 이와 관련하여, 적어도 하나의 카메라 모듈 각각은 상호 상이한(또는, 적어 도 일부 중첩되는) 화각(angle of view)을 갖도록 전자 장치에 배치될 수 있다. 또는, 적어도 하나의 카메 라 모듈은 전자 장치의 전방 및 후방 영역을 촬영하도록 전자 장치 상에서 상호 상반되는 위치 에 배치될 수 있다. 다양한 실시 예에서, 카메라 모듈은 배치된 위치에 고정되거나, 또는 배치된 위치에서 사용자 제어에 대응하여 적어도 일부분이 유동될 수 있다. 다양한 실시 예에서, 카메라 모듈이 복수로 구 비되는 경우 전자 장치는 영상 편집 프로그램을 포함할 수 있으며, 프로세서는 복수의 카메라 모듈 에 의하여 촬영된 복수의 영상들을 상기 영상 편집 프로그램을 기반으로 편집(예: 스티칭(stitching)할 수 있다. 상기 센서 모듈은 전자 장치의 운용 환경(또는, 주변 영역)에서 발광되는 광의 적어도 일부를 검출할 수 있다. 이와 관련하여, 센서 모듈은 특정 파장 대역에 대한 응답 특성을 갖는 제1 광 센서 및 제2 광 센서를 포함할 수 있다. 상기 응답 특성의 적어도 일부로서 예컨대, 제1 광 센서는 제1 파장 대역 (예: 자외선 파장 대역)의 광을 검출하여 전기적 신호로 출력하고, 제2 광 센서는 상기 제1 파장 대역과 상이한 제2 파장 대역(예: 적외선 파장 대역)의 광을 검출하여 전기적 신호로 출력할 수 있다. 일 실시 예에서, 상기 제1 광 센서 및 제2 광 센서 중 적어도 하나는 포토다이오드(photodiode)를 포함할 수 있으며, pn 접합의 광기전력 효과를 기반으로 광을 검출할 수 있다. 또는, 상기 제1 광 센서 및 제2 광 센서 중 적어도 하나는 대역 필터(band-pass filter)를 기반으로 대응하는 파장 대역의 광을 검출할 수 있다. 다양한 실시 예에서, 상기 센서 모듈은 조도 센서(미도시)를 더 포함할 수 있으며, 상기 조도 센서는 전자 장치 의 주변 영역에 대한 밝기를 실시간 또는 스케줄링된 주기로 감지하여 이에 대한 정보(예: 조도 값)를 프 로세서로 전달할 수 있다. 다양한 실시 예에서, 전자 장치는 상기 제1 광 센서 및 제2 광 센서의 구성을 배제하고, 상술된 카메라 모듈에 포함되는 이미지 센서의 기능 동작을 기반으로 상기 제1 파장 대역 및 제2 파장 대역 의 광을 검출할 수 있다. 이와 관련하여, 상기 이미지 센서에 포함되는 적어도 하나의 픽셀 중 일부는 적 어도 하나의 컬러 필터(예: Red 필터, Green 필터 또는 Blue 필터)와 제1 파장 대역 필터(예: UV 필터)가 조합 되어 구현되는 제1 패턴(예: R, UV, G, B 패턴)을 포함하고, 다른 일부는 상기 적어도 하나의 컬러 필터와 제2 파장 대역 필터(예: IR 필터)가 조합된 제2 패턴(예: R, IR, G, B 패턴)을 포함할 수 있다. 이미지 센서는 상기 제1 패턴 및 제2 패턴을 기반으로 제1 파장 대역 및 제2 파장 대역의 광을 검출하고, 이를 전기적 신호로 출력하여 프로세서에 전달할 수 있다. 이하에서 설명되는 다양한 실시 예들은, 상기 센서 모듈의 기 능 동작에 따른 제1 파장 대역 및 제2 파장 대역에 대한 전기적 신호 출력을 예로 하나, 이미지 센서를 기 반으로 하는 전기적 신호 출력 역시 동일 또는 유사하게 적용될 수 있다. 상기 메모리는 전자 장치의 구성요소들에 관계되는 적어도 하나의 데이터 또는 정보 자원을 저장하거 나, 전자 장치의 기능 동작과 관계되는 명령을 저장할 수 있다. 예를 들어, 메모리는 상기 카메라 모 듈에 의하여 촬영된 영상을 저장할 수 있다. 또는, 메모리는 상기 센서 모듈에서 출력하는 적어 도 하나의 전기적 신호에 관계된 데이터를 저장할 수 있다. 예를 들어, 메모리는 도 1a를 통하여 전술한 제1 운용 환경(예: 실외 환경)의 다양한 조건(예: 일간 시간 또는 대기 상태)에서 출력되는 제1 광원(예: 태 양)의 광에 대한 다양한 SPD 데이터를 저장할 수 있다. 이와 관련하여, 메모리는 프로세서에 의하여 상기 제1 운용 환경의 특정 조건과 상기 특정 조건에서 출력되는 제1 광원의 광에 대한 SPD 데이터의 적어도 일 부(예: 자외선 파장 대역 및 적외선 파장 대역의 SPD 데이터)가 매핑되어 구축되는 데이터베이스(또는, 인덱 스)를 저장할 수 있다. 상기 프로세서는 상술된 전자 장치의 적어도 하나의 구성요소와 전기적 또는 기능적으로 연결되어, 구성요소에 대한 제어, 통신 연산 또는 데이터 처리 등을 수행할 수 있다. 예를 들어, 프로세서는 카메라 모듈에 의하여 촬영된 영상에 대한 이미지 프로세싱(예: 화이트 밸런스 등)을 수행할 수 있다. 이 동작에 서, 프로세서는 상기 영상 촬영과 동일한 시점(time) 또는 촬영 시점으로부터 지정된 시간 범위 내에 제1광 센서 및 제2 광 센서 각각에서 출력하는 전기적 신호를 분석함으로서, 상기 영상 촬영과 관계되는 광원의 속성(예: 광원의 종류)를 식별할 수 있다. 예를 들어, 프로세서는 제1 광 센서 및 제2 광 센 서에서 출력하는 각각의 전기적 신호가 상기 데이터베이스에 포함된 특정 조건에 따른 SPD 데이터(예: 자 외선 파장 대역 및 적외선 파장 대역의 SPD 데이터)와 지정된 비율 이상으로 대응하는 경우, 상기 영상 촬영과 관계되는 광원을 제1 광원(예: 태양)으로 식별하고, 전자 장치의 운용 환경을 상기 특정 조건에 따른 실외 환경으로 판단할 수 있다. 또는, 프로세서는 상기 영상 촬영과 동일한 시점 또는 촬영 시점으로부터 지정된 시간 범위 내에 해당하는 전자 장치의 운용 환경 조건(예: 운용 시간 또는 주변 대기 상태 등)에 기반하여 광원의 속성을 식별할 수 있다. 이와 관련하여, 프로세서는 상기 데이터베이스에서 상기 전자 장치의 운용 환경 조건과 동일 또는 유사한 조건으로 매핑된 SPD 데이터를 식별하고, 상기 전자 장치의 운용 환경 조건에서 출력된 제1 광 센서 및 제2 광 센서의 전기적 신호들을 상기 식별된 SPD 데이터와 비교할 수 있다. 프로세서 는 상기 전기적 신호들이 상기 식별된 SPD 데이터를 기준하여 설정되는 임계범위 내에 포함되는 경우, 상 기 영상 촬영과 관계되는 광원을 제1 광원(예: 태양)으로 식별할 수 있다. 다양한 실시 예에서, 상기 임계범위 는 상기 식별된 SPD 데이터를 기준으로 소정의 데이터가 가감되어 설정될 수 있다. 일 실시 예에서, 프로세서는 제1 광 센서 및 제2 광 센서에서 출력되는 각각의 전기적 신호(또 는 전기적 신호에 대응하는 신호 값, 또는 전기적 신호에 대응하는 광량 값)를 지정된 연산식에 대입함으로서, 상기 식별된 광원 또는 판단된 전자 장치의 운용 환경에 대응하는 색온도 값을 산출할 수 있다. 프로세서 는 산출된 색온도 값을 상기 제1 광 센서 및 제2 광 센서의 전기적 신호 출력과 동일 또는 유사 한 시점에 촬영된 영상의 이미지 프로세싱에 적용하여 보정된 영상 데이터를 생성할 수 있다. 다양한 실시 예에서, 프로세서는 상기 메모리에 저장된 제1 광원(예: 태양)의 광에 대한 다양한 SPD 데이터 중 상기 전자 장치의 운용 환경 판단 또는 주변 광원의 속성 식별에 참조된 SPD 데이터(예: 제1 광 센서 및 제2 광 센서에서 출력하는 전기적 신호들과 대응하는 SPD 데이터)를 선택할 수 있다. 프로세 서는 선택된 SPD 데이터와 상기 선택된 SPD 데이터에 대응하는 전기적 신호들을 기반으로 산출된 색온도 값을 매핑하고, 매핑된 정보를 메모리에 저장할 수 있다. 프로세서는 추후 전자 장치의 운용 환 경에 대응하는 색온도 값 도출과 관련하여 상기 메모리에 저장된 매핑 정보를 참조할 수 있다. 상기 디스플레이는 각종 콘텐츠를 출력할 수 있다. 예를 들어, 디스플레이는 상기 카메라 모듈 에 의한 촬영 영상을 프리뷰 형태로 출력하고, 지정된 스케줄링 정보(예: 지정된 시간 경과 등)에 따른 프로세 서의 제어에 대응하여 상기 프리뷰 형태의 촬영 영상을 이미지 프로세싱된(또는, 주변 광원 또는 전자 장 치의 운용 환경에 대응하는 색온도 값을 기반으로 화이트 밸런스가 수행된) 영상으로 전환할 수 있다. 또 는, 디스플레이는 상기 촬영 영상의 이미지 프로세싱(또는, 화이트 밸런스)을 제어하는 인터페이스를 출력 하고, 상기 인터페이스에 인가되는 사용자 입력에 대응하여 보정된 영상을 출력할 수 있다. 또는, 디스플레이 는 복수로 분할된 화면 영역 각각으로 카메라 모듈에 의한 촬영 영상과 상기 촬영 영상에 대하여 이 미지 프로세싱된(또는, 화이트 밸런스가 조정된) 영상을 동시 출력할 수 있다. 도 3은 일 실시 예에 따른 전자 장치에 구축되는 데이터베이스의 형태를 도시한 도면이다. 일 실시 예에서, 전술된 제1 광 센서(도 2의 121) 및 제2 광 센서(도 2의 123) 각각은 관계되는 파장 대역의 광 을 검출하여 전기적 신호로 출력할 수 있다. 이와 관련하여, 전자 장치(도 2의 100)의 프로세서(도 2의 140)는 상기 제1 광 센서 및 제2 광 센서 각각에서 출력하는 전기적 신호가 메모리(도 2의 130)에 데이터베 이스로 구축된 제1 파장 대역(예: 자외선 파장 대역) 및 제2 파장 대역(예: 적외선 파장 대역) 에 대한 적어도 하나의 SPD 데이터 중 어느 하나에 대응하는 경우, 전자 장치의 주변 광원을 제1 광원(예: 태양)으로 식별할 수 있다. 예를 들어, 프로세서는 제1 광 센서 및 제2 광 센서에서 출력하는 각각의 전기적 신호가 데이터베이스 상의 다양한 조건(예: 대기 상태)에 따른 적어도 하나의 SPD 데이터 중 특정 조건의 SPD 데이터와 지정된 비율 이상으로 유사한 경우, 전자 장치의 주변 광원을 제1 광원(예: 태양)으로 식별할 수 있다. 상기 주변 광원 식별의 또 다른 예로, 프로세서는 데이터베이스 상에서 전자 장치의 운용 환경 조건(예: 대기 상태)과 동일 또는 유사한 조건으로 매핑된 SPD 데이터를 식별하고, 상기 전자 장치의 운용 환경 조건에서 출력된 제1 광 센서 및 제2 광 센서의 전기적 신호들을 상기 식별된 SPD 데이터와 비교할 수 있다. 일 실시 예에서, 상기 전기적 신호들이 상기 식별된 SPD 데이터를 기준하여 설정된 임계범위 내 에 포함되는 경우, 전자 장치의 주변 광원을 제1 광원(예: 태양)으로 식별할 수 있다. 도 4는 일 실시 예에 따른 제1 파장 대역의 광 성분 및 제2 파장 대역의 광 성분 간의 비율과 색온도 값의 상관 관계를 나타내는 도면이다. 일 실시 예에서, 전자 장치(도 2의 100)의 프로세서(도 2의 140)는 제1 광 센서(도 2의 121) 및 제2 광 센서(도 2의 123) 각각으로부터 검출되는 제1 파장 대역(예: 자외선 파장 대역)의 제1 광량 및 제2 파장 대역(예: 적외 선 파장 대역)의 제2 광량(또는, 제1 파장 대역에 대응하는 제1 전기적 신호 값 및 제2 파장 대역에 대응하는 제2 전기적 신호 값) 간의 비율에 기초하여, 상기 광 센서(121 및 123)들의 운용 환경에 대응하는 색온도 값을 산출할 수 있다. 수학식 1"}
{"patent_id": "10-2017-0105709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "상기의 수학식 1은 상기 제1 광량 및 제2 광량에 대응하는 색온도 값 산출의 예시적 형태를 나타낼 수 있다. 프 로세서는 수학식 1과 같이, 제1 파장 대역에 따른 제1 광량의 합산 및 제2 파장 대역에 따른 제2 광량의 합산에 대한 비율에 기초하여 상기 광량들이 검출되는 환경(또는, 전자 장치 또는 광 센서들(121 및 123) 의 운용 환경)에 대응하는 상관 색온도(correlated color temperature) 값을 산출할 수 있다. 상술과 관련하여 도 4를 참조하면, 제1 파장 대역(예: 자외선 파장 대역)의 광량 및 제2 파장 대역(예: 적외선 파장 대역)의 광량 간의 비율은 산출되는 색온도 값과 선형적 상관관계를 가질 수 있다. 다시 말해, 제1 파장 대역의 광량이 제2 파장 대역의 광량에 상대적으로 클수록 상기 수학식 1로부터 산출되는 색온도 값은 비례하여 증가할 수 있으며, 이는 도 1a를 통하여 전술한 바와 같이 단파장 대역(예: 자외선 파장 대역 또는 상기 제1 파 장 대역)에서의 광 분포 비율(또는, 광량)이 증가할수록 높은 색온도 값을 갖는 제1 광원(예: 태양)의 특성에 대응할 수 있다. 프로세서는 상기 수학식 1을 기반으로 산출되는 색온도 값을 카메라 모듈(도 2의 110)에 의하여 촬영된 영상에 대한 이미지 프로세싱(예: 화이트 밸런스)에 적용할 수 있다. 도 5는 일 실시 예에 따른 전자 장치의 이미지 처리 방법을 도시한 도면이다. 동작 501에서, 전자 장치(도 2의 100)의 센서 모듈(도 2의 120)은 카메라 모듈(도 2의 110)의 기능 동작(예: 임 의의 피사체 촬영)과 동일한 시점(time) 또는 상기 기능 동작으로부터 지정된 시간 범위 내의 시점에서, 전자 장치의 운용 환경과 관계되는 광원의 광을 검출할 수 있다. 예를 들어, 센서 모듈은 상기 센서 모듈 의 구성요소로서 포함되는 제1 광 센서(도 2의 121) 및 제2 광 센서(도 2의 123)를 기반으로, 상기 광 센 서들(121 및 123) 각각에 대응하는 파장 대역의 광을 검출하여 전기적 신호로 출력할 수 있다. 일 실시 예에 따 르면, 상기 제1 광 센서는 제1 파장 대역(예: 자외선 파장 대역)의 광을 검출할 수 있으며, 제2 광 센서 는 상기 제1 파장 대역과는 상이한 제2 파장 대역(예: 적외선 파장 대역)의 광을 검출할 수 있다. 동작 503에서, 전자 장치의 프로세서(도 2의 140)는 제1 광 센서 및 제2 광 센서의 광 검출에 따라 출력되는 전기적 신호를 기반으로 전자 장치의 운용 환경과 관계되는 광원을 식별할 수 있다. 예를 들어, 프로세서는 메모리(도 2의 130)에 구축된 데이터베이스(도 3의 131)를 참조하여 출력된 전기적 신호 를 분석함으로서, 상기 광원의 속성(예: 광원의 종류)을 식별할 수 있다. 이와 관련하여, 일 실시 예에 따른 데 이터베이스는 제1 운용 환경(예: 실외 환경)에 대한 다양한 조건(예: 일간 시간 또는 대기 상태 등)과 상 기 다양한 조건 각각에 대응하는 제1 광원(예: 태양)에 대한 SPD 데이터의 적어도 일부(예: 자외선 파장 대역 및 적외선 파장 대역의 SPD 데이터)가 매핑되어 구축될 수 있다. 일 실시 예에서, 프로세서는 제1 광 센서 및 제2 광 센서에서 출력하는 각각의 전기적 신호가 데이터베이스에 포함된 특정 조건에 따른 SPD 데이터와 지정된 비율 이상으로 대응하는 경우, 전자 장치 의 운용 환경을 상기 제1 운용 환경(예: 실외 환경)으로 판단하고, 판단된 운용 환경에 기초하여 전자 장치의 주변 광원을 제1 광원(예: 태양)으로 식별할 수 있다. 다른 실시 예에서, 프로세서는 상기 카메라 모듈의 기능 동작과 동일한 시점 또는 기능 동작으로부터 지정된 시간 범위 내에 해당하는 전자 장치의 운용 환경 조건(예: 운용 시간 또는 주변 대기 상태 등)을 기반으로 전자 장치의 주변 광원을 식별할 수 있다. 예를 들어, 프로세서는 데이터베이스에서 상기 전자 장치의 운용 환경 조건과 동일 또는 유사한 조건으로 매핑된 SPD 데이터를 식별하고, 상기 전자 장치의 운용 환경 조건에서 출력된 전기적 신호들이 상기 식별된 SPD 데이터를 기준하여 설정되는 임계범 위 내에 포함되는 경우, 전자 장치의 주변 광원을 제1 광원(예: 태양)으로 식별할 수 있다. 다양한 실시 예에서, 프로세서는 상기 제1 광 센서 및 제2 광 센서 각각으로부터 출력되는 전기 적 신호들이 상기 데이터베이스 상의 다양한 조건에 따른 SPD 데이터(또는, 전자 장치의 운용 환경 조건과 동일 또는 유사한 조건으로 매핑된 SPD 데이터)에 대응하지 않는 경우, 전자 장치의 운용 환경을 제2 운용 환경(예: 실내 환경)으로 판단하고, 주변 광원을 제2 광원(예: 인공 광원(형광등 또는 LED 등)으로 식별할 수 있다. 동작 505에서, 프로세서는 상기 제1 광 센서에 의하여 검출되는 제1 파장 대역(예: 자외선 파장 대역)의 광량과 상기 제2 광 센서에 의하여 검출되는 제2 파장 대역(예: 적외선 파장 대역)의 광량 간의 비율에 기초하여 상기 광량들이 검출되는 환경(또는, 전자 장치 또는 광 센서들(121 및 123)의 운용 환 경)에 대응하는 상관 색온도 값을 도출할 수 있다. 동작 507에서, 프로세서는 상기 카메라 모듈에 의하여 촬영된 영상에 대한 이미지 프로세싱(예: 화이 트 밸런스)을 수행할 수 있다. 이 동작에서, 프로세서는 상기 도출된 색온도 값을 이미지 프로세싱에 적용 하여 카메라 모듈에 의한 촬영 영상의 적어도 일부를 보정할 수 있다. 상술된 다양한 실시 예에 따른 전자 장치는, 제1 파장 대역에 대한 응답 특성을 갖도록 설정된 제1 광 센서, 상 기 제1 파장 대역과는 상이한 제2 파장 대역에 대한 응답 특성을 갖도록 설정된 제2 광 센서, 적어도 하나의 카 메라 모듈 및 상기 제1 광 센서, 상기 제2 광 센서, 상기 카메라 모듈과 전기적으로 연결된 프로세서를 포함할 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 상기 제1 광 센서를 이용하여 상기 제1 파장 대역에 대응하는 제1 신호를 획득하고, 상기 제2 광 센서를 이용하여 상기 제2 파장 대역에 대응하는 제2 신호를 획득하고, 상기 제1 신호 및 상기 제2 신호에 기초하여 상기 전자 장치의 주변 광원을 판단하고, 상기 제1 신호 및 상기 제2 신호에 기초하여 상기 판단된 주변 광원에 대응하는 색온도 값을 산출하고, 상기 산출된 색온도 값에 기초하여 상기 이 미지의 화이트 밸런스를 조정할 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 상기 카메라 모듈을 이용하여 외부 객체에 대응하는 이미지를 획득 하고, 상기 제1 광 센서를 이용하여 상기 제1 파장 대역에 대응하는 제1 신호를 획득하고, 상기 제2 광 센서를 이용하여 상기 제2 파장 대역에 대응하는 제2 신호를 획득하고, 상기 제1 신호 및 상기 제2 신호에 기초하여 지 정된 광 정보 중 적어도 하나의 광 정보를 선택하고, 상기 선택된 적어도 하나의 광 정보에 기초하여 상기 이미 지의 화이트 밸런스를 조정할 수 있다. 다양한 실시 예에 따르면, 상기 제1 광 센서는 상기 제1 파장 대역의 적어도 일부로서 자외선 파장 대역에 응답 할 수 있다. 다양한 실시 예에 따르면, 상기 제 2 광 센서는 상기 제2 파장 대역의 적어도 일부로서 적외선 파장 대역에 응 답할 수 있다. 다양한 실시 예에 따르면, 상기 전자 장치는 상기 지정된 광 정보의 적어도 일부로서, 제1 환경과 관계된 적어 도 하나의 조건 각각에 대응하는 상기 제1 파장 대역 및 상기 제2 파장 대역의 태양광 정보를 저장하는 메모리 를 더 포함할 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 상기 제1 신호 및 상기 제2 신호가 상기 메모리에 저장된 제1 조건 에 대응하는 상기 제1 파장 대역 및 상기 제2 파장 대역의 제1 태양광 정보와 지정된 비율 이상으로 대응하는 경우 상기 제1 태양광 정보를 선택할 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 상기 선택된 제1 태양광 정보에 기초하여 상기 전자 장치의 운용 환 경을 상기 제1 환경으로 판단하고, 상기 전자 장치의 주변 광원을 상기 태양광으로 판단할 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 상기 제1 신호에 따른 제1 값 및 상기 제2 신호에 따른 제2 값 간의 비율에 기초하여 상기 선택된 적어도 하나의 광 정보에 대응하는 색온도 값을 산출할 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 상기 산출된 색온도 값을 상기 이미지의 화이트 밸런스 조정에 이용 할 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 상기 산출된 색온도 값과 상기 선택된 적어도 하나의 광 정보를 매 핑하여 상기 메모리에 저장할 수 있다. 다양한 실시 예에 따르면, 상기 전자 장치는 상기 프로세서의 제어에 대응하여 상기 이미지를 출력하고, 상기 이미지 출력으로부터 지정된 시간의 경과 후 상기 이미지를 상기 화이트 밸런스가 조정된 이미지로 전환하여 출 력하는 디스플레이를 더 포함할 수 있다. 상술된 다양한 실시 예에 따른 전자 장치는, 이미지 센서를 포함하는 적어도 하나의 카메라 모듈 및 상기 카메 라 모듈과 전기적으로 연결된 프로세서를 포함할 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 상기 카메라 모듈을 이용하여 외부 객체에 대응하는 이미지를 획득 하고, 상기 이미지 센서를 이용하여 제1 파장 대역에 대응하는 제1 신호 및 상기 제1 파장 대역과는 상이한 제2 파장 대역에 대응하는 제2 신호를 획득하고, 상기 제1 신호 및 상기 제2 신호에 기초하여 지정된 광 정보 중 적 어도 하나의 광 정보를 선택하고, 상기 선택된 적어도 하나의 광 정보에 기초하여 상기 이미지의 화이트 밸런스 를 조정할 수 있다. 다양한 실시 예에 따르면, 상기 이미지 센서는 상기 제1 파장 대역의 적어도 일부로서 자외선 파장 대역에 대한 응답 특성을 갖는 제1 필터 및 상기 제2 파장 대역의 적어도 일부로서 적외선 파장 대역에 대한 응답 특성을 갖 는 제2 필터를 포함할 수 있다. 상술된 다양한 실시 예에 따른 전자 장치의 외부 광에 기반하여 이미지를 처리하는 방법은, 외부 객체에 대응하 는 이미지를 획득하는 동작, 제1 파장 대역에 대응하는 제1 신호를 획득하는 동작, 상기 제1 파장 대역과는 상 이한 제2 파장 대역에 대응하는 제2 신호를 획득하는 동작, 상기 제1 신호 및 상기 제2 신호에 기초하여 지정된 광 정보 중 적어도 하나의 광 정보를 선택하는 동작, 및 상기 선택된 적어도 하나의 광 정보에 기초하여 상기 이미지의 화이트 밸런스를 조정하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 제1 신호를 획득하는 동작은 상기 제1 파장 대역의 적어도 일부로서 자외선 파 장 대역에 응답하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 제2 신호를 획득하는 동작은 상기 제2 파장 대역의 적어도 일부로서 적외선 파 장 대역에 응답하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 적어도 하나의 광 정보를 선택하는 동작은 제1 환경과 관계된 적어도 하나의 조 건 각각에 대응하는 상기 제1 파장 대역 및 상기 제2 파장 대역의 태양광 정보를 저장하는 동작을 포함할 수 있 다. 다양한 실시 예에 따르면, 상기 적어도 하나의 광 정보를 선택하는 동작은 상기 적어도 하나의 조건 각각에 대 응하는 상기 제1 파장 대역 및 상기 제2 파장 대역의 태양광 정보 중 상기 제1 신호 및 상기 제2 신호가 지정된 비율 이상으로 대응하는 제1 태양광 정보를 선택하는 동작을 더 포함할 수 있다. 다양한 실시 예에 따르면, 상기 제1 태양광 정보를 선택하는 동작은 상기 제1 태양광 정보에 기초하여 상기 전 자 장치의 운용 환경을 상기 제1 환경으로 판단하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 제1 태양광 정보를 선택하는 동작은 상기 제1 태양광 정보 또는 상기 제1 환경 판단에 기초하여 상기 전자 장치의 주변 광원을 상기 태양광으로 판단하는 동작을 더 포함할 수 있다. 다양한 실시 예에 따르면, 상기 외부 광에 기반하여 이미지를 처리하는 방법은 상기 제1 신호에 따른 제1 값 및 상기 제2 신호에 따른 제2 값 간의 비율에 기초하여 상기 선택된 적어도 하나의 광 정보에 대응하는 색온도 값 을 산출하는 동작을 더 포함할 수 있다. 다양한 실시 예에 따르면, 상기 이미지의 화이트 밸런스를 조정하는 동작은 상기 산출된 색온도 값을 상기 화이 트 밸런스에 이용하는 동작을 포함할 수 있다.다양한 실시 예에 따르면, 상기 색온도 값을 산출하는 동작은 상기 산출된 색온도 값과 상기 선택된 적어도 하 나의 광 정보를 매핑하여 저장하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 외부 광에 기반하여 이미지를 처리하는 동작은 상기 이미지를 출력하는 동작을 더 포함할 수 있다. 다양한 실시 예에 따르면, 상기 이미지를 출력하는 동작은 상기 이미지 출력으로부터 지정된 시간의 경과 후, 상기 이미지를 상기 화이트 밸런스가 조정된 이미지로 전환하여 출력하는 동작을 포함할 수 있다. 도 6은 일 실시 예에 따른 네트워크 환경 내의 전자 장치를 도시한 도면이다. 도 6을 참조하면, 네트워크 환경 내의 전자 장치(예: 전자 장치(도 2의 100))는 근거리 무선 통신 을 통하여 전자 장치 와 통신하거나 또는, 네트워크를 통하여 전자 장치 또는 서버 와 통신할 수 있다. 일 실시 예에 따르면, 전자 장치는 서버을 통하여 전자 장치와 통신할 수 있다. 일 실시 예에 따르면, 전자 장치는 버스, 프로세서(예: 프로세서(도 2의 140)), 메모리, 입력 장치(예: 마이크 또는 마우스), 표시 장치, 오디오 모듈, 센서 모듈, 인터페이스 , 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈, 및 가입자 식 별 모듈을 포함할 수 있다. 어떤 실시 예에서, 전자 장치는 구성요소들 중 적어도 하나(예: 표시 장 치 또는 카메라 모듈)를 생략하거나 다른 구성요소를 추가적으로 구비할 수 있다. 버스는 구성요소들(620-690)을 서로 연결하고, 구성요소들 간의 신호(예: 제어 메시지 또는 데이터)를 전 달하는 회로를 포함할 수 있다. 프로세서는, 중앙처리장치, 어플리케이션 프로세서, GPU(graphic processing unit), 카메라의 이미지 시그널 프로세서(image signal processor(ISP)), 또는 커뮤니케이션 프로 세서(communication processor(CP)) 중 하나 또는 그 이상을 포함할 수 있다. 일 실시 예에 따르면, 프로세서 는 SoC(system on chip) 또는 SiP(system in package)으로 구현될 수 있다. 프로세서는, 예를 들면, 운영 체제 또는 응용 프로그램을 구동하여 프로세서에 연결된 전자 장치의 적어도 하나의 다른 구성 요소(예: 하드웨어 또는 소프트웨어 구성요소)을 제어할 수 있고, 각종 데이터 처리 및 연산을 수행할 수 있다. 프로세서는 다른 구성요소들(예: 통신 모듈) 중 적어도 하나로부터 수신된 명령 또는 데이터를 휘발 성 메모리에 로드하여 처리하고, 결과 데이터를 비휘발성 메모리에 저장할 수 있다. 메모리는, 휘발성 메모리 또는 또는 비휘발성 메모리를 포함할 수 있다. 휘발성 메모리는, 예를 들면, RAM(random access memory)(예: DRAM, SRAM, 또는 SDRAM)로 구성될 수 있다. 비휘발성 메모리(63 4)는, 예를 들면, OTPROM(one time programmable read-only memory(ROM)), PROM(programmable read-only memory), EPROM(erasable programmable read-only memory), EEPROM(electrically erasable programmable read-only memory), mask ROM, flash ROM, 플래시 메모리, 하드 드라이브, 또는 솔리드 스테이트 드라이브 (SSD))로 구성될 수 있다. 또한, 비휘발성 메모리는, 전자 장치와의 연결 형태에 따라, 그 안에 배치된 내 장 메모리, 또는 필요 시에만 연결하여 사용 가능한 스탠드-얼론 형태의 외장 메모리로 구성될 수 있 다. 외장 메모리는 플래시 드라이브(flash drive), 예를 들면, CF(compact flash), SD(secure digital), Micro-SD, Mini-SD, xD(extreme digital), MMC(multi-media card), 또는 메모리 스틱을 포함할 수 있다. 외장 메모리는 유선(예: 케이블 또는 USB(universal serial bus)) 또는 무선(예: 블루투스)을 통하여 전자 장 치와 기능적으로 또는 물리적으로 연결될 수 있다. 메모리는, 예를 들면, 전자 장치의 적어도 하나의 다른 소트프웨어 구성요소, 예를 들어, 프로그램 에 관계된 명령 또는 데이터를 저장할 수 있다. 프로그램은, 예를 들면, 커널, 라이브러리 , 어플리케이션 프레임워크, 또는 어플리케이션 프로그램(interchangeably \"어플리케이션\")을 포함할 수 있다. 입력 장치는, 마이크, 마우스, 또는 키보드를 포함할 수 있다. 일 실시 예에 따르면, 키보드는 물리적인 키보드로 연결되거나, 표시 장치를 통해 가상 키보드로 표시될 수 있다. 표시 장치는, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로를 포함 할 수 있다. 디스플레이는, 예를 들면, 액정 디스플레이(LCD), 발광 다이오드(LED) 디스플레이, 유기 발광 다이 오드(OLED) 디스플레이, 마이크로 전자기계 시스템 (MEMS) 디스플레이, 또는 전자 종이(electronic paper) 디스플레이를 포함할 수 있다. 디스플레이는, 일 실시 예에 따르면, 유연하게, 투명하게, 또는 착용할 수 있게 구현 될 수 있다. 디스플레이는 사용자의 터치, 제스처, 근접, 또는 호버링 입력을 감지할 수 터치 회로(touch circuitry) 또는 터치에 대한 압력의 세기를 측정할 수 있는 압력 센서(interchangebly 포스 센서)를 포함할 수 있다. 상기 터치 회로 또는 압력 센서는 디스플레이와 일체형으로 구현되거나, 또는 디스플레이와는 별도의 하 나 이상의 센서들로 구현될 수 있다. 홀로그램 장치는 빛의 간섭을 이용하여 입체 영상을 허공에 보여줄 수 있 다. 프로젝터는 스크린에 빛을 투사하여 영상을 표시할 수 있다. 스크린은, 예를 들면, 전자 장치의 내부 또는 외부에 위치할 수 있다. 오디오 모듈은, 예를 들면, 소리와 전기 신호를 쌍방향으로 변환시킬 수 있다. 일 실시 예에 따르면, 오디 오 모듈은, 입력 장치(예: 마이크)를 통해 소리를 획득하거나, 또는 전자 장치에 포함된 출력 장치(미도시)(예: 스피커 또는 리시버), 또는 전자 장치와 연결된 외부 전자 장치(예: 전자 장치(예: 무선 스피커 또는 무선 헤드폰) 또는 전자 장치(예: 유선 스피커 또는 유선 헤드폰))를 통해 소리를 출력 할 수 있다. 센서 모듈은, 예를 들면, 전자 장치의 내부의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상 태(예: 고도, 습도, 또는 밝기)를 계측 또는 감지하여, 그 계측 또는 감지된 상태 정보에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그 네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러(color) 센서(예: RGB(red, green, blue) 센서), IR(infrared) 센서, 생체 센서(예: 홍채센서, 지문 센서, 또는 HRM(heartbeat rate monitoring)센서, 후각(e- nose) 센서, 일렉트로마이오그라피(EMG) 센서, 일렉트로엔씨팔로그램(EEG) 센서, 일렉트로카디오그램(ECG) 센서), 온도 센서, 습도 센서, 조도 센서, 또는 UV(ultra violet) 센서를 포함할 수 있다. 센서 모듈은 그 안에 속한 적어도 하나 이상의 센서들을 제어하기 위한 제어 회로를 더 포함할 수 있다. 어떤 실시 예에서는, 프로세서와는 별도의 프로세서(예: 센서 허브)를 이용하여, 센서 모듈을 제어할 수 있다. 별도의 프 로세서(예: 센서 허브)를 이용하는 경우에는, 프로세서가 슬립(sleep) 상태에 있는 동안, 프로세서를 깨우지 않고 별도의 프로세서의 작동에 의하여 센서 모듈의 동작 또는 상태의 적어도 일부를 제어할 수 있 다. 인터페이스는, 일 실시 예에 따르면, HDMI(high definition multimedia interface), USB(universal serial bus), 광 인터페이스(optical interface), RS-232(recommended standard232), D-sub(D-subminiature), MHL(mobile high-definition link) 인터페이스, SD카드/MMC(multi-media card) 인터페이스, 또는 오디오 인터 페이스를 포함할 수 있다. 연결 단자는 전자 장치와 전자 장치를 물리적으로 연결시킬 수 있다. 일 실시 예에 따르면, 연결 단자는, 예를 들면, USB 커넥터, SD 카드/MMC 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 기계적인 자극(예: 진동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 예를 들면, 햅틱 모듈은 사용자에게 촉각 또는 운동 감각과 관련된 자극을 제공할 수 있다. 햅틱 모 듈은 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은, 예를 들면, 정지 영상 및 동영상을 촬영할 수 있다. 카메라 모듈는, 일 실시 예에 따 르면, 하나 이상의 렌즈(예: 광각 렌즈 및 망원 렌즈, 또는 전면 렌즈 및 후면 렌즈), 이미지 센서, 이미지 시 그널 프로세서, 또는 플래시(예: 발광 다이오드 또는 xenon lamp 등)를 포함할 수 있다. 전력 관리 모듈은 전자 장치의 전력을 관리하기 위한 모듈로서, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구성될 수 있다. 배터리는, 예를 들면, 1차 전지, 2차 전지, 또는 연료 전지를 포함하여 외부 전원에 의해 재충전되어, 상 기 전자 장치의 적어도 하나의 구성 요소에 전력을 공급할 수 있다. 통신 모듈은, 예를 들면, 전자 장치와 외부 장치(예: 제1 외부 전자 장치, 제2 외부 전자 장치 , 또는 서버) 간의 통신 채널 수립 및 수립된 통신 채널을 통한 유선 또는 무선 통신 수행을 지원할 수 있다. 일 실시 예에 따르면, 통신 모듈은 무선 통신 모듈 또는 유선 통신 모듈을포함하고, 그 중 해당하는 통신 모듈을 이용하여 제1 네트워크(예: 블루투스 또는 IrDA(infrared data association) 같은 근거리 통신 네트워크) 또는 제2 네트워크(예: 셀룰러 네트워크와 같은 원거리 통신 네트워크)를 통 하여 외부 장치(예: 제1 외부 전자 장치, 제2 외부 전자 장치 또는 서버)와 통신할 수 있다. 무선 통신 모듈은, 예를 들면, 셀룰러 통신, 근거리 무선 통신, 또는 GNSS(global navigation satellite system) 통신을 지원할 수 있다. 셀룰러 통신은, 예를 들면, LTE(Long-Term Evolution), LTE-A(LTE Advance), CDMA(code division multiple access), WCDMA(wideband CDMA), UMTS(universal mobile telecommunications system), WiBro(Wireless Broadband), 또는 GSM(Global System for Mobile Communications)을 포함할 수 있다. 근거리 무선 통신은, 예를 들면, WiFi(wireless fidelity), WiFi Direct, LiFi(light fidelity), 블루투 스, 블루투스 저전력(BLE), 지그비(Zigbee), NFC(near field communication), 자력 시큐어 트랜스미션 (Magnetic Secure Transmission), 라디오 프리퀀시(RF), 또는 보디 에어리어 네트워크(BAN)을 포함할 수 있다. GNSS는, 예를 들면, GPS(Global Positioning System), Glonass(Global Navigation Satellite System), Beidou Navigation Satellite System(이하 \"Beidou\") 또는 Galileo, the European global satellite-based navigation system)을 포함할 수 있다. 이하, 본 문서에서는, \"GPS\"는 \"GNSS\"와 상호 호환적으로 사용될 수 있 다. 일 실시 예에 따르면, 상기 무선 통신 모듈은, 셀룰러 통신을 지원하는 경우, 예를 들면, 가입자 식별 모 듈(예: SIM 카드)을 이용하여 통신 네트워크 내에서 전자 장치의 구별 및 인증을 수행할 수 있다. 일 실시 예에 따르면, 무선 통신 모듈은 프로세서(예: 어플리케이션 프로세서 (AP))와 별개의 커뮤니케 이션 프로세서(CP)를 포함할 수 있다. 이런 경우, 커뮤니케이션 프로세서는, 예를 들면, 프로세서가 인액 티브(예: 슬립) 상태에 있는 동안 프로세서를 대신하여, 또는 프로세서가 액티브 상태에 있는 동안 프로세서과 함께, 전자 장치의 구성요소들(610-696) 중 적어도 하나의 구성 요소와 관련된 기능들의 적어도 일부 기능을 수행할 수 있다. 일 실시 예에 따르면, 무선 통신 모듈은 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS 통신 모듈 중 해당하는 통신 방식만을 지원하는 복수의 통신 모듈들로 구성될 수 있 다. 유선 통신 모듈은, 예를 들면, LAN(local area network), 전력선 통신 또는 POTS(plain old telephone service)를 포함할 수 있다. 제1 네트워크는, 예를 들어, 전자 장치와 제1 외부 전자 장치 간의 무선으로 직접 연결을 통해 명령 또는 데이터를 송신 또는 수신 할 수 있는 WiFi direct 또는 블루투스를 포함할 수 있다. 제2 네트워크 는, 예를 들어, 전자 장치와 제2 외부 전자 장치 간의 명령 또는 데이터를 송신 또는 수신할 수 있는 텔레커뮤니케이션 네트워크(예: 컴퓨터 네트워크(예: LAN 또는 WAN), 인터넷, 또는 텔레폰 네트워크)를 포 함할 수 있다. 다양한 실시 예들에 따르면, 상기 명령 또는 상기 데이터는 상기 제2 네트워크에 연결된 서버를 통해서 상기 전자 장치와 제2 외부 전자 장치간에 송신 또는 수신될 수 있다. 제1 및 제2 외부 전자 장치 (602, 604) 각각은 전자 장치와 동일한 또는 다른 종류의 장치일 수 있다. 다양한 실시 예들에 따르면, 전 자 장치에서 실행되는 동작들의 전부 또는 일부는 다른 하나 또는 복수의 전자 장치(예: 전자 장치(602, 604), 또는 서버에서 실행될 수 있다. 일 실시 예에 따르면, 전자 장치가 어떤 기능이나 서비스를 자 동으로 또는 요청에 의하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 그와 연관된 적어도 일부 기능을 다른 장치(예: 전자 장치(602, 604), 또는 서버 )에게 요청할 수 있다. 다른 전자 장치(예: 전자 장치(602, 604), 또는 서버)는 요청된 기능 또는 추 가 기능을 실행하고, 그 결과를 전자 장치로 전달할 수 있다. 전자 장치는 수신된 결과를 그대로 또 는 추가적으로 처리하여 요청된 기능이나 서비스를 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 본 문서의 다양한 실시 예들 및 이에 사용된 용어들은 본 문서에 기재된 기술을 특정한 실시 형태에 대해 한정 하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 및/또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 단수의 표현은 문맥 상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및/또는 B 중 적어도 하나\", \"A, B 또는 C\" 또는 \"A, B 및/또는 C 중 적어도 하나\" 등의 표현은 함께 나열된 항목들의 모 든 가능한 조합을 포함할 수 있다. \"제1,\" \"제2,\" \"첫째,\" 또는 \"둘째,\"등의 표현들은 해당 구성요소들을, 순서 또는 중요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구성요 소들을 한정하지 않는다. 어떤(예: 제1) 구성요소가 다른(예: 제2) 구성요소에 \"(기능적으로 또는 통신적으로) 연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로 연결되거나, 다른 구성요소(예: 제3 구성요소)를 통하여 연결될 수 있다. 본 문서에서, \"~하도록 설정된(adapted to or configured to)\"은 상황에 따라, 예를 들면, 하드웨어적 또는 소 프트웨어적으로 \"~에 적합한,\" \"~하는 능력을 가지는,\" \"~하도록 변경된,\" \"~하도록 만들어진,\" \"~를 할 수 있 는,\" 또는 \"~하도록 설계된\"과 상호 호환적으로(interchangeably) 사용될 수 있다. 어떤 상황에서는, \"~하도록 구성된 장치\"라는 표현은, 그 장치가 다른 장치 또는 부품들과 함께 \"~할 수 있는\" 것을 의미할 수 있다. 예를 들면, 문구 \"A, B, 및 C를 수행하도록 설정된 (또는 구성된) 프로세서\"는 해당 동작들을 수행하기 위한 전용 프 로세서(예: 임베디드 프로세서), 또는 메모리 장치(예: 메모리 630)에 저장된 하나 이상의 프로그램들을 실행함 으로서, 해당 동작들을 수행할 수 있는 범용 프로세서(예: CPU 또는 application processor)를 의미할 수 있다. 본 문서에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구성된 유닛을 포함하며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로 등의 용어와 상호 호환적으로 사용될 수 있다. \"모듈\"은, 일체로 구성된 부 품 또는 하나 또는 그 이상의 기능을 수행하는 최소 단위 또는 그 일부가 될 수 있다. \"모듈\"은 기계적으로 또 는 전자적으로 구현될 수 있으며, 예를 들면, 어떤 동작들을 수행하는, 알려졌거나 앞으로 개발될, ASIC(application-specific integrated circuit) 칩, FPGAs(field-programmable gate arrays), 또는 프로그램 가능 논리 장치를 포함할 수 있다. 다양한 실시 예들에 따른 장치(예: 모듈들 또는 그 기능들) 또는 방법(예: 동작들)의 적어도 일부는 프로그램 모듈의 형태로 컴퓨터로 판독 가능한 저장 매체(예: 메모리)에 저장된 명령어로 구현될 수 있다. 상기 명 령어가 프로세서(예: 프로세서)에 의해 실행될 경우, 프로세서가 상기 명령어에 해당하는 기능을 수행할 수 있다. 컴퓨터로 판독 가능한 기록 매체는, 하드디스크, 플로피디스크, 마그네틱 매체(예: 자기테이프), 광기 록 매체(예: CD-ROM, DVD, 자기-광 매체 (예: 플롭티컬 디스크), 내장 메모리 등을 포함할 수 있다. 명령어는 컴파일러에 의해 만들어지는 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 다양한 실시 예들에 따른 구성 요소(예: 모듈 또는 프로그램 모듈) 각각은 단수 또는 복수의 개체로 구성될 수 있으며, 전술한 해당 서브 구성 요소들 중 일부 서브 구성 요소가 생략되거나, 또는 다른 서브 구성 요소를 더 포함할 수 있다. 대체적으로 또는 추가적으로, 일부 구성 요소들(예: 모듈 또는 프로그램 모듈)은 하나의 개체 로 통합되어, 통합되기 이전의 각각의 해당 구성 요소에 의해 수행되는 기능을 동일 또는 유사하게 수행할 수 있다. 다양한 실시 예들에 따른, 모듈, 프로그램 모듈 또는 다른 구성 요소에 의해 수행되는 동작들은 순차적, 병렬적, 반복적 또는 휴리스틱하게 실행되거나, 적어도 일부 동작이 다른 순서로 실행되거나, 생략되거나, 또는 다른 동작이 추가될 수 있다. 본 문서에 개시된 실시 예는, 기술 내용의 설명 및 이해를 위해 제시된 것이며, 본 발명의 범위를 한정하는 것 은 아니다. 따라서, 본 문서의 범위는, 본 발명의 기술적 사상에 근거한 모든 변경 또는 다양한 다른 실시 예를 포함하는 것으로 해석되어야 한다.도면 도면1a 도면1b 도면1c 도면2 도면3 도면4 도면5 도면6"}
{"patent_id": "10-2017-0105709", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1a는 일 실시 예에 따른 전자 장치의 제1 운용 환경에서 검출되는 광의 다양한 SPD를 도시한 도면이다. 도 1b는 일 실시 예에 따른 전자 장치의 제2 운용 환경에서 검출되는 광의 다양한 SPD를 도시한 도면이다. 도 1c는 일 실시 예에 따른 전자 장치의 제3 운용 환경에서 검출되는 또 다른 광의 다양한 SPD를 도시한 도면이 다. 도 2는 일 실시 예에 따른 전자 장치의 구성을 도시한 도면이다. 도 3은 일 실시 예에 따른 전자 장치에 구축되는 데이터베이스의 형태를 도시한 도면이다. 도 4는 일 실시 예에 따른 제1 파장 대역의 광 성분 및 제2 파장 대역의 광 성분 간의 비율과 색온도 값의 상관 관계를 나타내는 도면이다. 도 5는 일 실시 예에 다른 전자 장치의 외부 광에 기반하여 이미지를 처리하는 방법을 도시한 도면이다. 도 6은 일 실시 예에 따른 네트워크 환경 내의 외부 광에 기반한 이미지 처리를 지원하는 전자 장치를 도시한 도면이다."}
