{"patent_id": "10-2022-0134926", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0054675", "출원번호": "10-2022-0134926", "발명의 명칭": "화합물의 의약용도 예측 방법, 장치, 및 컴퓨터 프로그램", "출원인": "주식회사 온코크로스", "발명자": "최진우"}}
{"patent_id": "10-2022-0134926", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "제 1 화합물에 대한 제 1 화합물 정보를 획득하는 동작;상기 제 1 화합물과 결합 가능한 것으로 알려진 제 1 단백질에 대한 제 1 단백질 정보를 획득하는 동작; 및신경망 (neural network) 모델을 이용하여, 상기 제 1 화합물 정보, 상기 제 1 단백질 정보, 및 제 2 화합물에대한 제 2 화합물 정보에 기초하여, 상기 제 2 화합물과 결합 가능한 적어도 하나의 제 2 단백질에 대한 제 2단백질 정보를 획득하는 동작;를 포함하는 방법."}
{"patent_id": "10-2022-0134926", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 신경망 모델은 상기 제 1 화합물 정보 및 상기 제 2 단백질 정보에 기초하여 미리 트레이닝되는 방법."}
{"patent_id": "10-2022-0134926", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 신경망 모델은 지도학습을 통해 트레이닝되는 방법."}
{"patent_id": "10-2022-0134926", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 제 1 화합물 정보는 상기 화합물의 몰질량, 구성원자, 결합구조, 전자수, 산도 중 적어도 하나에 대한 정보를 포함하는 방법."}
{"patent_id": "10-2022-0134926", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 적어도 하나의 제 2 단백질의 순위를 결정하는 단계를 더 포함하는 방법."}
{"patent_id": "10-2022-0134926", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서,상기 적어도 하나의 제 2 단백질의 상기 순위는, 상기 제 2 화합물과의 결합 가능성에 기초하여 결정되는 방법."}
{"patent_id": "10-2022-0134926", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서,상기 제 1 단백질 정보는 상기 제 1 단백질의 발현정보를 포함하는 방법."}
{"patent_id": "10-2022-0134926", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1 항에 있어서,상기 제 2 단백질 정보, 및 상기 적어도 하나의 제 2 단백질의 발현 정보에 기초하여 상기 제 2 화합물의 용도를 결정하는 동작을 더 포함하는 방법."}
{"patent_id": "10-2022-0134926", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "공개특허 10-2024-0054675-3-제 1 항에 있어서,상기 획득된 제 2 단백질 정보는 차등적으로 발현되는 유전자 (differentially expressed genes;DEG) 로서 이용되는 방법."}
{"patent_id": "10-2022-0134926", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 1 항에 있어서,상기 획득된 제 2 단백질 정보를, 차등적으로 발현되는 유전자 (differentially expressed genes;DEG) 로서 이용하여, 온톨로지(ontology) 및 신호전달경로(signal pathway) 분석을 수행하는 동작을 더 포함하는 방법."}
{"patent_id": "10-2022-0134926", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 1 항 내지 제 10 항 중 어느 한 항에 있어서,적어도 하나의 프로세서에 의해 실행될 경우, 상기 적어도 하나의 프로세서로 하여금 상기 방법을 실행하게 하는 인스트럭션들을 포함하는 컴퓨터 판독가능 매체."}
{"patent_id": "10-2022-0134926", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "적어도 하나의 프로세서; 및인스트럭션들을 저장하는 메모리를 포함하고, 상기 인스트럭션이 실행될 경우, 상기 적어도 하나의 프로세서를 제어하여:제 1 화합물에 대한 제 1 화합물 정보를 획득하고;상기 제 1 화합물과 결합 가능한 것으로 알려진 제 1 단백질에 대한 제 1 단백질 정보를 획득하고;신경망 (neural network) 모델을 이용하여, 상기 제 1 화합물 정보, 상기 제 1 단백질 정보, 및 제 2 화합물에대한 제 2 화합물 정보에 기초하여, 상기 제 2 화합물과 결합 가능한 적어도 하나의 제 2 단백질에 대한 제 2단백질 정보를 획득하는 전자 디바이스."}
{"patent_id": "10-2022-0134926", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시에 의해, 제 1 화합물에 대한 제 1 화합물 정보를 획득하는 동작; 제 1 화합물과 결합 가능한 것으로 알 려진 제 1 단백질에 대한 제 1 단백질 정보를 획득하는 동작; 및 신경망 (neural network) 모델을 이용하여, 제 1 화합물 정보, 제 1 단백질 정보, 및 제 2 화합물에 대한 제 2 화합물 정보에 기초하여, 제 2 화합물과 결합 가 능한 적어도 하나의 제 2 단백질에 대한 제 2 단백질 정보를 획득하는 동작; 를 포함하는 방법이 제공될 수 있다."}
{"patent_id": "10-2022-0134926", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "개시된 실시예는 화합물의 의약용도를 예측하기 위한 방법, 장치, 컴퓨터에서 실행시키기 위한 프로그램, 및 그 프로그램을 기록한 기록매체에 관하며, 구체적으로, 인공신경망을 이용하여 화합물의 의약용도를 예측하는 것에 관한다."}
{"patent_id": "10-2022-0134926", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "컴퓨팅 방법(computational method)과 생명 정보학을 이용함으로써, 연구원은 기존 약제의 새로운 사용법을 찾 기 위해 많은 양의 표현 데이터를 기초로 화합물 등의 새로운 의약용도를 예측할 수 있다. 이러한 방식은 신규 약제 발견에 많이 사용되고 있다. 신약 발견과 개발은 항상 많은 시간 및 비용을 필요로 하며, 복잡한 공정을 거치게 된다. 이에 따라, 최근에는 다른 분야의 학문, 예를 들면 생명정보학(bio-informatics), 케미-인포메틱(chemi-informatics), 컴퓨터 공학 및 CADD(computer-aided drug discovery/design) 등을 융합하여, 신약 발견과 개발에 드는 시간을 줄이고 그 효과를 높이려는 연구가 이루어지고 있다. 특히, 시뮬레이션을 통한 신약 개발을 위한 많은 데이터베이스들이 통합되고 있다. 예를 들어, 복잡한 신약 타 겟의 데이터베이스인 drugbank가 있으며, 웹으로 접근가능한 신약 타겟 확인을 위한 단백질 데이터베이스 인 PDTD가 있다. 이외에도 의약품 및 유전자 정보를 포함한 다양한 퍼블릭 데이터베이스가 제공되었다. 예를 들 면 Connectivity Map (CMAP)은 의약품, 유전자와 질병의 관계를 밝힐 수 있는 데이터베이스이다. 특히, CMAP은 유전자표현 프로파일등을 이용하여 의약품사용에 따른 생물학적 상태간의 연결성을 보여줄 수 있다. CMAP의 참조 데이터베이스는 많은 수의 perturbagen을 처리한 배양된 인간 세포들에서 얻어진 유전자 발현 프로파일을 포 함하고 있다. 하지만, 이러한 종래 기술은 규칙에 기반 (rule-based) 하므로, 인간이 인지하지 못하여 규칙을 정의할 수 없는 경우까지 예측하지는 못한다."}
{"patent_id": "10-2022-0134926", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 화합물 등의 새로운 의약용도를 예측하기 위하여, 인공신경망을 이용하는 장치, 방법, 컴퓨터 프로그 램, 및 그 프로그램을 기록한 기록 매체를 제공하고자 한다."}
{"patent_id": "10-2022-0134926", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시에 의해, 제 1 화합물에 대한 제 1 화합물 정보를 획득하는 동작; 제 1 화합물과 결합 가능한 것으로 알 려진 제 1 단백질에 대한 제 1 단백질 정보를 획득하는 동작; 및 신경망 (neural network) 모델을 이용하여, 제 1 화합물 정보, 제 1 단백질 정보, 및 제 2 화합물에 대한 제 2 화합물 정보에 기초하여, 제 2 화합물과 결합 가능한 적어도 하나의 제 2 단백질에 대한 제 2 단백질 정보를 획득하는 동작; 를 포함하는 방법이 제공될 수 있다. 신경망 모델은 미리 트레이닝되는 방법이 제공될 수 있다. 신경망 모델은 지도학습을 통해 트레이닝되는 방법이 제공될 수 있다. 제 1 화합물 정보는 화합물의 몰질량, 구성원자, 결합구조, 전자수, 산도 중 적어도 하나에 대한 정보를 포함하 는 방법이 제공될 수 있다. 적어도 하나의 제 2 단백질의 순위를 결정하는 단계를 더 포함하는 방법이 제공될 수 있다. 적어도 하나의 제 2 단백질의 순위는, 제 2 화합물과의 결합 가능성에 기초하여 결정되는 방법이 제공될 수 있 다. 제 1 단백질 정보는 제 1 단백질의 발현정보를 포함하는 방법이 제공될 수 있다. 제 2 단백질 정보, 및 적어도 하나의 제 2 단백질의 발현 정보에 기초하여 제 2 화합물의 용도를 결정하는 동작 을 더 포함하는 방법이 제공될 수 있다. 적어도 하나의 프로세서에 의해 실행될 경우, 적어도 하나의 프로세서로 하여금 방법을 실행하게 하는 인스트럭 션들을 포함하는 컴퓨터 판독가능 매체가 제공될 수 있다. 나아가, 본 개시에 의해, 적어도 하나의 프로세서; 및 인스트럭션들을 저장하는 메모리를 포함하고, 인스트럭션 이 실행될 경우, 적어도 하나의 프로세서를 제어하여: 제 1 화합물에 대한 제 1 화합물 정보를 획득하고; 제 1 화합물과 결합 가능한 것으로 알려진 제 1 단백질에 대한 제 1 단백질 정보를 획득하고; 신경망 (neural network) 모델을 이용하여, 제 1 화합물 정보, 제 1 단백질 정보, 및 제 2 화합물에 대한 제 2 화합물 정보에 기초하여, 제 2 화합물과 결합 가능한 적어도 하나의 제 2 단백질에 대한 제 2 단백질 정보를 획득하는 전자 디 바이스가 제공될 수 있다."}
{"patent_id": "10-2022-0134926", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 방법, 장치, 및 프로그램을 이용하여, 후보물질, 예를 들어, 화합물의 용도를 빠르고 정확하게 예측 할 수 있다."}
{"patent_id": "10-2022-0134926", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시에서 사용되는 용어에 대해 간략히 설명하고, 본 개시에 대해 구체적으로 설명하기로 한다. 본 개시에서 사용되는 용어는 실시예에서 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선 택하였으나, 이는 해당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수 있 다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 실시예의 설명 부분에서 상 세히 그 의미를 기재할 것이다. 따라서 본 개시에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가 지는 의미와 본 개시의 전반에 걸친 내용을 토대로 정의되어야 한다. 명세서 전체에서 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있음을 의미한다. 또한, 명세서에 기재된 \"...부\", \"모듈\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어 또는 소프트웨어로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 이하 첨부된 도면을 참고하여 본 발명을 상세히 설명하기로 한다. Connectivity Map (CMAP) 은, 유전자 발현 프로파일 또는 의약용도등이 알려진 화합물의 데이터를 기반으로, 데 이터베이스에 기록된 화합물에 대해서만 다른 의약용도, 타겟 및 메카니즘등을 추정하는데 이용될 수 있으나, 데이터베이스에 기록되지 않은 화합물의 특성을 밝히기는 쉽지 않은 문제점이 있다. 특정 화합물과 결합 가능한 단백질의 종류가 이미 알려져 있더라도, 해당 화합물과 결합 가능한 모든 단백질의 종류가 밝혀진 것은 아니므로, 해당 화합물을 의약적 용도로 이용하기 위해서는 다양한 임상 실험을 거쳐야 한 다. 인공지능(artificial intelligence, AI) 시스템은 인간과 유사한 수준의 지능을 컴퓨터에서 구현하기 위한 시스 템이다. 종래에는 사람이 직접, 컴퓨터가 동작하기 위한 규칙을 미리 정의함으로써, 해당 컴퓨터가 정의된 규칙 에 따라 동작할 수 있었다. 반면, 인공지능 시스템에서는, 기계가 스스로 학습하여 (learning) 동작한다. 인공지능 시스템의 동작을 설명하기 위해 도 1을 참조한다. 도 1은 일 실시예에 따른 인공지능 신경망의 예시를 도시한다. 인공지능 신경망은, 편의상 인공지능 신경망 모 델, 신경망 모델, 인공지능 모델, 모델, 등 다양하게 지칭될 수 있다. 도 1을 참조하면, 인공지능 신경망은 복수의 층들로 구성될 수 있다. 예를 들어, 인공지능 신경망은 입력층, 은 닉층, 및 출력층을 포함할 수 있다. 도 1에서 2개의 은닉층이 도시되어 있으나, 은닉층의 개수는 이에 제한되지 않고 다양할 수 있다. 인공지능 신경망을 구성하는 복수의 층들은 모두 신경망 층으로서, 각각은 복수의 가중치(weight values; W)를 가진다. 이전 층의 연산 결과와 현재 층의 복수의 가중치들 간의 연산을 통해 신경망 연산이 수행될 수 있다. 복수의 신경망 층이 가진 복수의 가중치들은 트레이닝을 통해 최적화될 수 있다. 효율적인 트레이닝을 위해, 인 공지능 신경망은 지도학습(supervised training)을 통해 트레이닝될 수 있다. 복수의 신경망 층이 가지는 복수 의 가중치들은, 트레이닝 동안 인공지능 모델에서 획득한 손실값이 최소화되는 방향으로 최적화되거나 갱신될 수 있다. 여기에서, 인공지능 신경망은 심층신경망 (deep neural network; DNN)일 수 있으나, 이에 제한되지 않는다. 예 를 들어, 인공지능 신경망은, 합성곱 신경망(convolutional neural network; CNN), 순환 신경망 (recurrent neural network; RNN), 생성적 적대 신경망 (generative adversarial network; GAN), 심층 합성곱 생성적 적대 신경망 (deep convolutional generative adversarial network; DCGAN), 관계형 네트워크 (relation network; RN), 제한된 볼츠만 머신 (restricted Boltmann machine; RBM), 심층 신뢰 신경망 (deep belief network; DBN), 등일 수 있다. 인공지능 신경망은 복수 타입의 신경망들로 구성될 수도 있다. 전술된 인공지능 신경망을 이용하여, 화합물에 결합 가능한 단백질을 식별하는 방법을 설명하기 위해, 도 2를 참조한다. 도 2는 일 실시예에 따른, 화합물에 결합 가능한 단백질을 식별하는 방법의 흐름도이다. 방법은 전자 디바이스 에서 수행될 수 있으나, 이에 제한되지 않는다. 예를 들어, 방법은 복수의 전자 디바이스들에 의해 수행될 수 있다. 설명의 편의상 도 3을 더 참조하여 설명한다. 도 3은 일 실시예에 따른, 화합물에 결합 가능한 단백질을 식별하기 위해, 인공지능 신경망에 입력되는 데이터 와, 인공지능 신경망으로부터 출력되는 데이터를 설명하기 위한 도면이다. 동작 210에서, 제 1 화합물에 대한 제 1 화합물 정보가 획득될 수 있다. 동작 220에서, 제 1 화합물과 결합 가능한 것으로 알려진 제 1 단백질에 대한 제 1 단백질 정보가 획득될 수 있 다. 일 실시예에서, 동작 210 및 동작 220은 실질적으로 동시에 수행될 수 있다. 일 실시예에 따르면, 인공지능 신경망 모델의 트레이닝은 동작 210 및 동작 220을 포함할 수 있다. 인공지능 신 경망 모델은 제 1 화합물에 대한 제 1 화합물 정보와, 제 1 화합물과 결합 가능한 것으로 알려진 제 1 단백질에 대한 제 1 단백질 정보를 이용하여 미리 트레이닝될 수 있다. 제 1 화합물 정보와 제 1 단백질 정보를 이용하여 인공지능 신경망 모델을 트레이닝하는 방법은, 도 4를 참조하 여 후술할 것이다. 동작 230에서, 신경망 모델을 이용하여, 제 2 화합물과 결합 가능한 제 2 단백질에 대한 제 2 단백질 정보가 획 득될 수 있다. 일 실시예에 따르면, 제 1 화합물에 대한 제 1 화합물 정보, 제 1 화합물과 결합 가능한 것으로 알려진 제 1 단 백질에 대한 제 1 단백질 정보, 및 제 2 화합물에 대한 제 2 화합물 정보가 입력 데이터로서 신경망 모델에 입 력될 수 있다. 신경망 모델은 입력 데이터에 기초하여 출력 데이터를 출력할 수 있다. 출력 데이터는 제 2 화합물과 결합 가능 한 적어도 하나의 제 2 단백질에 대한 정보를 포함할 수 있다. 신경망 모델은, 화합물 정보 및 화합물과 결합 가능한 단백질 정보가 서로 페어링된 정보를 이용하여 미리 트레이닝되어 있을 수 있고, 따라서, 트레이닝에서 입력되지 않았던 특정 화합물에 대한 정보가 입력되더라도, 해당 화합물과 결합 가능한 단백질을 추론할 수 있 다. 도 3에서 인공지능 신경망 모델의 은닉층은 블랙박스(black box)로 도시되어 있으나, 은닉층은 다양한 신경망 층들로 구성될 수 있다. 신경망 층들은 한 종류의 신경망으로 구성될 수 있으나, 다양한 종류의 신경망들로 구 성될 수도 있다. 다양한 종류의 신경망들에 대해서는 전술된 바, 중복 설명은 생략한다. 제 1 화합물 정보와 제 1 단백질 정보를 이용하여 인공지능 신경망 모델을 트레이닝하는 방법은, 도 4를 참조하 여 설명한다. 도 4는 일 실시예에 따른, 화합물에 결합 가능한 단백질을 식별하기 위해, 인공지능 신경망에 입력되는 단백질 정보 및 화합물 정보를 설명하기 위한 도면이다. 인공지능 신경망 모델을 트레이닝하기 위해, 인공지능 신경망 모델에 단백질 정보와 화합물 정보가 입력될 수 있다. 단백질 정보와 화합물 정보는 서로 페어링되어, 인공지능 신경망 모델에 입력될 수 있다. 인공지능 신경 망 모델은 미리 트레이닝될 수 있으며, 인공지능 신경망 모델은 단백질 정보와 화합물 정보를 크롤링 (crawling) 을 통해 획득할 수도 있다. 단백질 정보는 다양한 종류의 단백질에 대한 정보를 포함할 수 있다. 단백질에 대한 정보는, 해당 단백질의 아 미노산 서열, 결합가능 화합물, 상기 단백질의 조직 특이적 또는 질병 환자 특이적 발현양상, 단백질의 특정 세포 신호 전달체계에서의 역할등에 대한 정보를 포함할 수 있으나, 이에 제한되지 않고 다양한 정보를 더 포함할 수 있고, 전술된 정보라도 포함되지 않을 수 있다. 화합물 정보는 다양한 종류의 화합물에 대한 정보를 포함할 수 있다. 화합물에 대한 정보는, 해당 화합물의 몰 질량, 구성원자, 결합구조, 전자수, 산도, 등에 대한 정보를 포함할 수 있으나, 이에 제한되지 않고 다양한 정 보를 더 포함하거나, 전술된 정보라도 포함되지 않을 수 있다. 다만, 본 개시는 화합물의 구조에 기반하여 화합 물의 용도를 예측하기 위한 것이 아니므로, 화합물의 입체적 (3차원) 구조에 대한 정보가 화합물 정보로부터 제 외될 수 있고, 화합물의 입체적 구조에 대한 정보가 제외된 화합물 정보에 기초하여 신경망 모델이 트레이닝될 수 있다. 단백질 및 그와 결합가능한 화합물에 대한 정보는 서로 페어링되어 인공지능 신경망 모델에 입력될 수 있다. 인 공지능 신경망 모델에 입력되는 데이터가 편향될 경우, 출력 데이터 또한 편향될 수 있으므로, 인공지능 신경망 모델은 지도학습을 통해 트레이닝될 수 있다. 인공지능 신경망 모델을 효율적으로 트레이닝시키기 위해, 다양한 종류의 화합물, 및 다양한 용도의 화합물들에 대한 정보가 입력될 수 있다. 인공지능 신경망 모델의 학습 알고리즘은 랜덤 포레스트 (random forest), 로지스틱 회귀 (logistic regression), k-최근접 이웃 (K-nearest neighbor; KNN), 경사 하강 (gradient descent), 등일 수 있으나, 이 에 제한되지 않는다. 단백질 및 그와 결합가능한 화합물에 대한 정보로 트레이닝된 인공지능 신경망 모델은, 특정 단백질 또는 특정 화합물에 대한 질의에 응답하여, 그에 연관되는 화합물 또는 단백질에 대한 정보를 출력할 수 있다. 출력 데이터는 리스트의 형태로 출력될 수 있다. 예를 들어, 화합물X가 질의로서 입력될 경우, 화합물X와 연관 되는 단백질들이 출력될 수 있다. 화합물X가 질의로서 입력되기 위해서는, 화합물X에 대한 몰 질량, 구성원자, 전자수, 산도, 등에 대한 정보가 입력될 수 있다. 출력되는 리스트는 순서대로 정렬될 수 있다. 예를 들어, 단백질 리스트에서 단백질 순위는, 화합물X와의 결합 가능성, 즉, 화합물X와 결합 가능성이 높을수록 더 높은 순위를 가지도록, 구현될 수 있다. 인공지능 신경망 모델은, 기존에 그 대응 정보가 존재하지 않는 단백질, 또는 화합물에 대한 질의가 입력되더라 도, 이미 트레이닝된 데이터에 기초하여, 질의된 단백질 또는 화합물에 연관되는 화합물 또는 단백질을 결정할 수 있다. 즉, 인공지능 신경망 모델은 기존 데이터와 대응하는 데이터가 있는지와 무관하게, 트레이닝된 데이터의 데이터 확률 분포와 유사한 데이터 확률 분포를 가지는 출력 데이터를 출력할 수 있다. 출력되는 단백질 리스트는 차등적으로 발현되는 유전자 (differentially expressed genes;DEG) 로서 이용될 수 있다. 즉, 화합물X는, 단백질 리스트에 포함된 단백질에 결합하는 것으로 추론된 바, 이러한 단백질 리스트에 포함된 단백질들이 공통적으로 가지는 용도로 이용될 것으로 추론될 수 있다. 이를 통해, 화합물X의 효능이나 부작용이 예측될 수 있으므로, 예측되는 효능과 부작용을 중심으로 연구를 진행함으로써 의약 연구의 효율이 증 대될 수 있다. 예를들어, 특정 화합물 X가 단백질 A, B, C에 결합가능성이 높은 것으로 추론되고, A, B, C가 특 정 질환의 환자 샘플에서 정상인의 샘플과 다른 양상의 발현패턴을 가지고 있다면, 화합물 X는 상기 특정 질환 에 효능을 가지는 것으로 추론할 수 있는 것이다. 또한, 단백질 A, B, C가 특정 부작용에 관련이 있는 단백질이 라면, 화합물 X가 특정 부작용이 있을 가능성이 높은 것으로 예측할 수 있는 것이다. 도 5는 일 실시예에 따른, 화합물에 결합 가능한 단백질을 식별함으로써 화합물의 효능을 예측하기 위한 방법의 흐름도이다. 방법은 전자 디바이스에서 수행될 수 있으나, 이에 제한되지 않는다. 예를 들어, 방법은 복수의 전자 디바이스 들에 의해 수행될 수 있다. 설명의 편의상 도 6을 더 참조하여 설명한다. 도 6은 일 실시예에 따른, 화합물의 효능을 예측하기 위해, 인공지능 신경망에 입력되는 데이터와, 인공지능 신 경망으로부터 출력되는 데이터를 설명하기 위한 도면이다. 동작 510에서, 제 2 화합물과 결합 가능한 제 2 단백질에 대한 제 2 단백질 정보가 획득될 수 있다. 여기에서, 제 2 화합물은 전술된 동작 230에서 신경망 모델에 질의로서 입력되는 제 2 화합물과 동일할 수 있다. 또한, 제 2 단백질은, 동작 230 을 통해 획득되는 제 2 단백질 정보에 포함된 제 2 단백질과 동일할 수 있다.동작 520에서, 제 2 단백질의 발현 정보가 획득될 수 있다. 일 실시예에서, 동작 510 및 동작 520은 실질적으로 동시에 수행될 수 있다. 동작 510 및 동작 520은 동작 230 이후에 수행되는 것으로 설명되나, 이에 제한되지 않는다. 예를 들어, 520 에서 이용되는 단백질의 발현 정보는, 제 1 단백질 정보로서 인공지능 신경망 모델에 입력되고, 해당 정보를 이용하여 신경망 모델이 미리 트 레이닝되어 있을 수 있다. 단백질의 발현정보를 더 이용하여 인공지능 신경망 모델을 트레이닝하는 방법은, 도 7을 참조하여 후술할 것이다. 동작 530에서, 신경망 모델을 이용하여, 제 2 화합물의 효능 정보가 획득될 수 있다. 신경망 모델은 입력 데이터에 기초하여 출력 데이터를 출력할 수 있다. 출력 데이터는 제 2 화합물의 효능 정보 를 포함할 수 있다. 제 2 화합물의 효능 정보는, 해당 제 2 화합물과 결합 가능한 제 2 단백질들에 작용하는 다 른 화합물들의 효능 정보로부터 추론될 수 있다. *신경망 모델은, 화합물 정보 및 화합물과 결합 가능한 단백질 정보가 서로 페어링된 정보를 이용하여 미리 트 레이닝되어 있을 수 있고, 따라서, 트레이닝에서 입력되지 않았던 특정 화합물에 대한 정보가 입력되더라도, 해 당 화합물과 결합 가능한 단백질을 추론하고, 나아가, 해당 화합물의 효능이 추론될 수 있다. 도 6에서 인공지능 신경망 모델의 은닉층은 블랙박스(black box)로 도시되어 있으나, 은닉층은 다양한 신경망 층들로 구성될 수 있다. 신경망 층들은 한 종류의 신경망으로 구성될 수 있으나, 다양한 종류의 신경망들로 구 성될 수도 있다. 다양한 종류의 신경망들에 대해서는 전술된 바, 중복 설명은 생략한다. 도 6의 인공지능 신경 망 모델의 은닉층은 도 3의 은닉층 및 출력층을 포함할 수 있다. 제 1 화합물 정보와 제 1 단백질 정보를 이용하여 인공지능 신경망 모델을 트레이닝하는 방법은, 도 7을 참조하 여 설명한다. 도 7은 일 실시예에 따른, 화합물의 효능을 예측하기 위해, 인공지능 신경망에 입력되는 단백질 정보 및 화합물 정보를 설명하기 위한 도면이다. 인공지능 신경망 모델은, 화합물의 효능을 예측하기 위해 단백질의 발현 정보를 이용하여 더 트레이닝될 수 있 다. *단백질의 발현 정보는, 해당 단백질이 특정 화합물과 결합할 경우 보이는 발현 상태를 나타낼 수 있다. 예를 들어, 단백질A의 발현정보는, 단백질A가 화합물A와 결합 가능하고, 결합될 경우, 소정 기준 (a) 만큼 유전자가 상향 조정되고 (upregulated), 소정 기준 (b) 만큼 유전자가 하향 조정 (downregulated) 됨을 나타낼 수 있다. 일 실시예에 따르면, 단백질, 그와 결합가능한 화합물에 대한 정보, 결합할 경우 보이는 유전자 발현 상태에 대 한 정보로 트레이닝된 인공지능 신경망 모델은, 특정 화합물에 대한 질의에 응답하여, 해당 화합물의 용도, 예 를 들어, 효능 또는 부작용에 대한 정보를 출력할 수 있다. 출력되는 리스트는 순서대로 정렬될 수 있다. 예를 들어, 화합몰 용도 리스트의 순위는, 화합물X가 가질 가능성 이 높은 용도의 순위로 정렬될 수 있다. 인공지능 신경망 모델은, 기존에 그 대응 관계가 존재하지 않는 화합물에 대한 질의가 입력되더라도, 이미 트레 이닝된 데이터에 기초하여, 질의된 화합물과 단백질 간의 대응 관계를 추론할 수 있다. 즉, 인공지능 신경망 모델은 기존 데이터와 대응하는 데이터가 있는지와 무관하게, 트레이닝된 데이터의 데이터 확률 분포와 유사한 데이터 확률 분포를 가지는 출력 데이터를 출력할 수 있다. 일 실시예에 따르면, 전자 디바이스는 후보물질의 유전자 표현 프로필을 수집할 수 있고, 수집된 유전자 표현 프로필을 통계적으로 분석할 수 있다. 일 실시예에 따르면, 전자 디바이스는 통계적으로 분석된 유전자 표현 프 로필을 이용하여 후보물질의 유전자 발현 패턴을 결정할 수 있다. 도 8은 일 실시예에 따른 전자 디바이스의 블록도이다. 도 8을 참조하면, 전자 디바이스는 메모리 및 프로세서를 포함할 수 있다. 상기 실시 예들에서 제안한 방법에 따라, 메모리 및 프로세서가 동작할 수 있다. 다만, 일 실시예에 따른 전자 디바이스의 구성 요소가 전술된 예 에 한정되는 것은 아니다. 다른 실시예에 따라, 전자 디바이스는 전술한 구성 요소들 보다 더 많은 구성 요소를 포함하거나 더 적은 구성 요소를 포함할 수도 있다. 전자 디바이스의 프로세서는 전자 디바이스의의 전반적인 동작을 제어할 수 있다. 프로세서는 사용자의 입력에 기초하여 전자 디바이스를 제어하거나, 프로세서에 의해 실행되는 프로그램에 기초하여 전자 디바이스를 제어할 수 있다. 프로그램은 메모리에 저장될 수 있다. 프로세서는 신경망 모델을 생성하기 위한 AI 프로세서를 포함할 수 있다. AI 프로세서는 별도의 칩으로서 구현될 수도 있다. 메모리는 인스트럭션들을 저장할 수 있고, 프로세서는 인스트럭션들을 실행하여, 본 개시에서 설명된 다양한 동 작들을 수행하도록 구성될 수 있다. 메모리는 본 개시에서 설명된 다양한 동작들을 수행하는 데 필요한 데이터 를 저장할 수 있으나, 이에 제한되지 않는다. 예를 들어, 이러한 데이터는 전자 디바이스와 다른 디바이스, 예 를 들어, 서버에 저장될 수 있다. 본 개시에 따른 전자 디바이스는 프로세서, 프로그램 데이터를 저장하고 실행하는 메모리, 디스크 드라이브와 같은 영구 저장부(permanent storage), 외부 장치와 통신하는 통신 포트, 터치 패널, 키(key), 버튼 등과 같은 사용자 인터페이스 장치 등을 포함할 수 있다. 소프트웨어 모듈 또는 알고리즘으로 구현되는 방법들은 상기 프 로세서상에서 실행 가능한 컴퓨터가 읽을 수 있는 코드들 또는 프로그램 명령들로서 컴퓨터가 읽을 수 있는 기 록 매체 상에 저장될 수 있다. 여기서 컴퓨터가 읽을 수 있는 기록 매체로 마그네틱 저장 매체(예컨대, ROM(read-only memory), RAM(random-access memory), 플로피 디스크, 하드 디스크 등) 및 광학적 판독 매체(예 컨대, 시디롬(CD-ROM), 디브이디(DVD: Digital Versatile Disc)) 등이 있다. 컴퓨터가 읽을 수 있는 기록 매 체는 네트워크로 연결된 컴퓨터 시스템들에 분산되어, 분산 방식으로 컴퓨터가 판독 가능한 코드가 저장되고 실 행될 수 있다. 매체는 컴퓨터에 의해 판독가능하며, 메모리에 저장되고, 프로세서에서 실행될 수 있다. 본 개시에서 인용하는 공개 문헌, 특허 출원, 특허 등을 포함하는 모든 문헌들은 각 인용 문헌이 개별적으로 및 구체적으로 병합하여 나타내는 것 또는 본 개시에서 전체적으로 병합하여 나타낸 것과 동일하게 본 개시에 병합 될 수 있다. 본 개시의 이해를 위하여, 도면에 도시된 바람직한 실시 예들에서 참조 부호를 기재하였으며, 본 개시의 실시 예들을 설명하기 위하여 특정 용어들을 사용하였으나, 특정 용어에 의해 본 개시가 한정되는 것은 아니며, 본 개시는 당업자에 있어서 통상적으로 생각할 수 있는 모든 구성 요소들을 포함할 수 있다. 본 개시의 실시예들은 기능적인 블록 구성들 및 다양한 처리 단계들로 나타내어질 수 있다. 이러한 기능 블록 들은 특정 기능들을 실행하는 다양한 개수의 하드웨어 또는/및 소프트웨어 구성들로 구현될 수 있다. 예를 들 어, 본 개시의 실시예들은 하나 이상의 마이크로프로세서들의 제어 또는 다른 제어 장치들에 의해서 다양한 기 능들을 실행할 수 있는, 메모리, 프로세싱, 로직(logic), 룩업 테이블(look-up table) 등과 같은 직접 회로 구 성들을 채용할 수 있다. 본 개시의 실시예들의 구성 요소들이 소프트웨어 프로그래밍 또는 소프트웨어 요소들 로 실행될 수 있는 것과 유사하게, 본 개시는 데이터 구조, 프로세스들, 루틴들 또는 다른 프로그래밍 구성들의 조합으로 구현되는 다양한 알고리즘을 포함하여, C, C++, 자바(Java), 어셈블러(assembler) 등과 같은 프로그래 밍 또는 스크립팅 언어로 구현될 수 있다. 기능적인 측면들은 하나 이상의 프로세서들에서 실행되는 알고리즘 으로 구현될 수 있다. 또한, 본 개시는 전자적인 환경 설정, 신호 처리, 및/또는 데이터 처리 등을 위하여 종 래 기술을 채용할 수 있다. \"매커니즘\", \"요소\", \"수단\", \"구성\"과 같은 용어는 넓게 사용될 수 있으며, 기계 적이고 물리적인 구성들로서 한정되는 것은 아니다. 상기 용어는 프로세서 등과 연계하여 소프트웨어의 일련의 처리들(routines)의 의미를 포함할 수 있다. 본 개시에서 설명하는 특정 실행들은 일 실시 예들로서, 어떠한 방법으로도 본 개시의 범위를 한정하는 것은 아 니다. 명세서의 간결함을 위하여, 종래 전자적인 구성들, 제어 시스템들, 소프트웨어, 상기 시스템들의 다른 기능적인 측면들의 기재는 생략될 수 있다. 또한, 도면에 도시된 구성 요소들 간의 선들의 연결 또는 연결 부 재들은 기능적인 연결 및/또는 물리적 또는 회로적 연결들을 예시적으로 나타낸 것으로서, 실제 장치에서는 대 체 가능하거나 추가의 다양한 기능적인 연결, 물리적인 연결, 또는 회로 연결들로서 나타내어질 수 있다. 또한, \"필수적인\", \"중요하게\" 등과 같이 구체적인 언급이 없다면 본 개시의 적용을 위하여 반드시 필요한 구성 요소가 아닐 수 있다. 본 개시에서 \"상기\"의 용어 및 이와 유사한 지시 용어의 사용은 단수 및 복수 모두에 해당하는 것일 수 있다. 또한, 본 개시의 실시예에서 범위(range)를 기재한 경우 상기 범위에 속하는 개별적인 값을 적용한 실시예를 포함하는 것으로서(이에 반하는 기재가 없다면) 이해되어야 하고, 상기 범위를 구성하는 각 개별적인 값을 기재한 것과 동일한 것으로 이해되어야 한다. 본 개시의 실시예에 따른 방법을 구성하는 단계들에 대하여 명백하게 순 서를 기재하거나 반하는 기재가 없다면, 상기 단계들은 적당한 순서로 행해질 수 있다. 반드시 상기 단계들의 기재 순서에 따라 본 개시가 한정되는 것은 아니다. 본 개시에서 모든 예들 또는 예시적인 용어(예들 들어, 등 등)의 사용은 단순히 본 개시를 상세히 설명하기 위한 것으로서 특허청구범위에 의해 한정되지 않는 이상 상기 예들 또는 예시적인 용어로 인해 본 개시의 범위가 한정되는 것은 아니다. 또한, 당업자는 다양한 수정, 조합 및 변경이 부가된 특허청구범위 또는 그 균등물의 범주 내에서 설계 조건 및 팩터에 따라 구성될 수 있음을 알 수 있다."}
{"patent_id": "10-2022-0134926", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 따른 인공지능 신경망의 예시를 도시한다. 도 2는 일 실시예에 따른, 화합물에 결합 가능한 단백질을 식별하는 방법의 흐름도이다. 도 3은 일 실시예에 따른, 화합물에 결합 가능한 단백질을 식별하기 위해, 인공지능 신경망에 입력되는 데이터 와, 인공지능 신경망으로부터 출력되는 데이터를 설명하기 위한 도면이다.도 4는 일 실시예에 따른, 화합물에 결합 가능한 단백질을 식별하기 위해, 인공지능 신경망에 입력되는 단백질 정보 및 화합물 정보를 설명하기 위한 도면이다. 도 5는 일 실시예에 따른, 화합물에 결합 가능한 단백질을 식별함으로써 화합물의 효능을 예측하기 위한 방법의 흐름도이다. 도 6은 일 실시예에 따른, 화합물의 효능을 예측하기 위해, 인공지능 신경망에 입력되는 데이터와, 인공지능 신 경망으로부터 출력되는 데이터를 설명하기 위한 도면이다. 도 7은 일 실시예에 따른, 화합물의 효능을 예측하기 위해, 인공지능 신경망에 입력되는 단백질 정보 및 화합물 정보를 설명하기 위한 도면이다. 도 8은 일 실시예에 따른 전자 디바이스의 블록도이다."}
