{"patent_id": "10-2022-0157683", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0076597", "출원번호": "10-2022-0157683", "발명의 명칭": "드론을 이용한 도로 조명의 휘도 분석 시스템 및 방법", "출원인": "한국광기술원", "발명자": "허준"}}
{"patent_id": "10-2022-0157683", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "관리서버(200)에서 전송된 이동 경로 및 비행 정보를 기반으로 도로를 따라 이동하며 조명장치의 위치데이터와, 상기 조명장치의 점등에 따른 휘도값을 포함한 휘도 이미지를 생성하는 드론(100);상기 드론(100)과 접속하여 드론(100)의 이동 경로 및 비행 정보와 분석 대상 조명장치의 위치 데이터를 전송하고, 상기 드론(100)에서 생성된 휘도 이미지를 수신하여 인공지능 분석 모델을 통해 분석함으로써 조명장치의휘도 변화를 모니터링하되, 상기 분석된 휘도 이미지 중에서 이상이 감지된 휘도 이미지와, 상기 이상이 감지된휘도 이미지에 대응하는 조명장치의 위치 데이터를 추출하여 상기 추출된 조명장치의 위치 데이터에 기반한 휘도 보정 데이터 및 해당 조명장치의 유지보수 데이터를 생성하는 관리서버(200);를 포함하는 드론을 이용한 도로 조명의 휘도 분석 시스템."}
{"patent_id": "10-2022-0157683", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 관리서버(200)로부터 생성된 휘도 보정 데이터와 조명장치의 유지보수 데이터를 수신하여 디스플레이하는관리자 단말(300);을 더 포함하는 것을 특징으로 하는 드론을 이용한 도로 조명의 휘도 분석 시스템."}
{"patent_id": "10-2022-0157683", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 드론(100)은 관리서버(200)와 접속하여 드론(100)의 이동 경로 및 비행 정보와 분석 대상 조명장치의 위치데이터를 수신하고, 상기 조명장치의 휘도값을 포함한 휘도 이미지와 그에 대응한 조명장치의 위치 데이터를 송신하는 데이터 통신부(110);상기 이동 경로 및 비행 정보에 따라 드론(100)이 비행하도록 제어하는 비행 제어부(120); 및휘도계와 카메라를 구비하고, 상기 휘도계에서 측정된 조명장치의 휘도값을 상기 드론(100)이 비행하는 동안 촬영한 이미지에 반영하여 휘도 이미지를 생성하며, 상기 생성된 휘도 이미지에 대응한 조명장치의 위치 데이터를매칭시켜 출력하는 휘도 촬영부(130);를 포함하는 것을 특징으로 하는 드론을 이용한 도로 조명의 휘도 분석 시스템."}
{"patent_id": "10-2022-0157683", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 비행 제어부(120)는 가로등(420) 또는 터널등(430)의 휘도를 측정하기 위해 도로면으로부터 일정 높이(d1)이격된 상태를 유지하며 비행하도록 제어하는 것을 특징으로 하는 드론을 이용한 도로 조명의 휘도 분석시스템."}
{"patent_id": "10-2022-0157683", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 3 항에 있어서,비행 제어부(120)는 휘도 촬영부(120)에서 촬영된 카메라의 정보 중에서 차선인식 프로그램을 이용하여 분석되는 차선 정보를 기반으로 드론(100)이 차선 사이에서 일정 간격(d2)을 유지하며 비행하도록 제어하는 것을 특징으로 하는 드론을 이용한 도로 조명의 휘도 분석 시스템."}
{"patent_id": "10-2022-0157683", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 2 항에 있어서,상기 관리서버(200)는 드론(100)의 이동 경로 및 비행 정보와 분석 대상 조명장치의 위치 데이터를 전송하고,공개특허 10-2024-0076597-3-상기 드론(100)으로부터 생성된 조명장치의 휘도값을 포함한 휘도 이미지와 그에 대응한 조명장치의 위치 데이터를 수신하는 데이터 통신부(210);상기 드론(100)의 이동 경로 및 비행 정보와 분석 대상 조명장치의 위치 데이터를 생성하고, 상기 드론(100)의비행을 제어하는 드론 제어부(220);학습 데이터를 기반으로 정상 휘도 이미지와 휘도값의 변화에 따른 휘도 이미지의 변화를 기계 학습을 통해 학습한 인공지능 분석 모델을 이용하여 상기 수신된 휘도 이미지를 분석하는 인공지능 모델부(230);상기 분석된 조명의 휘도 변화를 모니터링하고, 상기 분석된 휘도 이미지 중에서 이상이 감지된 휘도 이미지와,상기 이상이 감지된 휘도 이미지에 대응하는 조명장치의 위치 데이터를 추출하여 상기 추출된 조명장치의 위치데이터에 기반한 휘도 보정 데이터 및 조명장치의 유지보수 데이터를 생성하는 모니터링부(240); 및상기 모니터링 결과와 추출된 조명장치의 위치 데이터에 기반한 휘도 보정 데이터 및 조명장치의 유지보수 데이터를 저장하는 데이터 저장부(250);를 포함하는 것을 특징으로 하는 드론을 이용한 도로 조명의 휘도 분석 시스템."}
{"patent_id": "10-2022-0157683", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서,상기 드론 제어부(220)는 드론(100)이 도로면으로부터 일정 거리(d1) 이격된 높이를 유지하며 비행하도록 비행정보를 생성하는 것을 특징으로 하는 드론을 이용한 도로 조명의 휘도 분석 시스템."}
{"patent_id": "10-2022-0157683", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 6 항에 있어서,상기 모니터링부(240)는 휘도 이미지 중에서 이상이 감지된 휘도 이미지를 추출하는 분석부(241);상기 이상이 감지된 휘도 이미지에 대응하는 조명장치의 위치 데이터를 추출하고, 상기 추출된 조명장치의 위치데이터에 기반한 휘도 보정 데이터 및 조명장치의 유지보수 데이터를 생성하는 유지보수 관리부(242); 및상기 생성된 휘도 보정 데이터 및 조명장치의 유지보수 데이터를 관리자 단말(300)로 전송하는 알림부(243);를포함하는 것을 특징으로 하는 드론을 이용한 도로 조명의 휘도 분석 시스템."}
{"patent_id": "10-2022-0157683", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "a) 드론(100)이 관리서버(200)에서 설정된 이동 경로 및 비행 정보와 분석 대상 조명장치의 위치 데이터를 수신하고, 수신된 이동 경로 및 비행 정보를 기반으로 비행하는 단계;b) 상기 드론(100)이 휘도계에서 측정된 조명장치의 휘도값을 비행중에 카메라가 촬영한 이미지에 반영하여 휘도 이미지를 생성하되, 상기 생성된 휘도 이미지에 대응하여 상기 조명장치의 위치 데이터를 매칭시켜 상기 관리서버(200)로 전송하는 단계;c) 상기 관리서버(200)가 드론(100)으로부터 수신된 휘도 이미지를 인공지능 분석 모델을 통해 휘도 이미지의변화에 따라 분류하고, 분류된 휘도 이미지를 분석하여 조명장치의 휘도 변화를 모니터링하는 단계; 및d) 상기 관리서버(200)가 분석된 휘도 이미지 중에서 이상이 감지된 휘도 이미지와, 상기 이상이 감지된 휘도이미지에 대응하는 조명장치의 위치 데이터를 추출하고, 추출된 조명장치의 위치 데이터에 기반한 휘도 보정 데이터 및 해당 조명장치의 유지보수 데이터를 생성하는 단계;를 포함하는 드론을 이용한 도로 조명의 휘도 분석방법."}
{"patent_id": "10-2022-0157683", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9 항에 있어서,e) 상기 관리서버(200)가 생성된 유지보수 데이터를 관리자 단말(300)로 전송하는 단계;를 더 포함하는 것을 특징으로 하는 드론을 이용한 도로 조명의 휘도 분석 방법."}
{"patent_id": "10-2022-0157683", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "공개특허 10-2024-0076597-4-제 10 항에 있어서,상기 a) 단계의 드론(100)은 가로등(420) 또는 터널등(430)의 휘도를 측정하기 위해 도로면으로부터 일정 높이(d1) 이격된 상태를 유지하고, 휘도 촬영을 위해 촬영된 카메라의 이미지 정보 중에서 차선인식 프로그램을 이용하여 분석되는 차선 정보를 기반으로 드론(100)이 차선 사이에서 일정 간격(d2)을 유지하며 비행하는 것을 특징으로 하는 드론을 이용한 도로 조명의 휘도 분석 방법."}
{"patent_id": "10-2022-0157683", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 10 항에 있어서,상기 c) 단계의 인공지능 분석 모델은 CNN(Convolutional Neural Network) 기반의 딥러닝 모델을 이용하여 정상 휘도 이미지와 휘도값의 변화에 따른 휘도 이미지를 포함한 학습 데이터를 기반으로 휘도 이미지의 변화를학습하고, 상기 학습 결과를 기반으로 수신된 휘도 이미지의 휘도 변화에 따라 휘도 이미지를 분류하는 것을 특징으로 하는 드론을 이용한 도로 조명의 휘도 분석 방법."}
{"patent_id": "10-2022-0157683", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "드론을 이용한 도로 조명의 휘도 분석 시스템 및 방법을 개시한다. 본 발명은 드론을 이용하여 도로 조명의 휘도 를 측정하고, 측정된 데이터를 기반으로 휘도의 분석과 결과를 모니터링하여 도로 조명의 유지보수와 관리를 쉽 게 수행할 수 있다."}
{"patent_id": "10-2022-0157683", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 드론을 이용한 도로 조명의 휘도 분석 시스템 및 방법에 관한 발명으로서, 더욱 상세하게는 드론을 이용하여 도로 조명의 휘도를 측정하고, 측정된 데이터를 기반으로 휘도의 분석과 결과를 모니터링하여 도로 조 명의 유지보수와 관리를 쉽게 수행할 수 있는 드론을 이용한 도로 조명의 휘도 분석 시스템 및 방법에 관한 것 이다."}
{"patent_id": "10-2022-0157683", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 도로 조명은 도로에 설치된 가로등과 터널에 설치된 터널등을 포함할 수 있고, 차량의 안전한 운행 을 위해 정기적으로 조도 및 휘도를 측정하여 관리되고 있다. 이러한 도로 조명은 KS A 3701, KS C 3703 등의 한국도로공사 또는 지자체 표준에 따른 분석을 통해 관리될 수 있다. 도로 조명을 측정하기 위해서는 일정한 측정점에 대한 정지 측정을 수행하는 경우, 검출기를 이용한 수동식 조 명 측정으로 이루어질 수 있다. 이 때문에 수동식 조명 측정은 조도 및 휘도를 포함한 조명의 측정시간이 많이 소요되며 차량 이동이 통제되어 야 하고, 차량 통제가 이루어져도 측정자의 안전상 측정 시간이 자유롭지 못한 문제점이 있다. 또한, 수동식 조명 측정방식은 조도 및 휘도의 검출을 측정자가 도로 및 터널내 차량의 흐름을 통제하면서 일정 한 측정영역마다 도로와 터널의 조도, 휘도 등의 상태를 기록하는 경우 검출되는 측정 결과를 잘못 입력할 수 있는 문제점이 있다. 또한, 터널등 및 배선 노후화 등 조명 미점등으로 부분적인 음영 구역이 발생되고, 조명장치가 점등 부분과 미 점등 부분 사이의 음영 차이가 증가하여 운전자의 눈 피로를 증가시키는 문제점이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국 등록특허공보 등록번호 제10-1638502호(발명의 명칭: 터널 내외의 휘도분석을 통한 터널 출입구 부분의 밝기 조절장치)"}
{"patent_id": "10-2022-0157683", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "이러한 문제점을 해결하기 위하여, 본 발명은 드론을 이용하여 도로 조명의 휘도를 측정하고, 측정된 데이터를 기반으로 휘도의 분석과 결과를 모니터링하여 도로 조명의 유지보수와 관리를 쉽게 수행할 수 있는 드론을 이용 한 도로 조명의 휘도 분석 시스템 및 방법을 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2022-0157683", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 목적을 달성하기 위하여 본 발명의 일 실시 예는 드론을 이용한 도로 조명의 휘도 분석 시스템으로서, 관리서버에서 전송된 이동 경로 및 비행 정보를 기반으로 도로를 따라 이동하며 조명장치의 위치 데이터와, 상 기 조명장치의 점등에 따른 휘도값을 포함한 휘도 이미지를 생성하는 드론; 상기 드론과 접속하여 드론의 이동 경로 및 비행 정보와 분석 대상 조명장치의 위치 데이터를 전송하고, 상기 드론에서 생성된 휘도 이미지를 수신 하여 인공지능 분석 모델을 통해 분석함으로써 조명장치의 휘도 변화를 모니터링하되, 상기 분석된 휘도 이미지 중에서 이상이 감지된 휘도 이미지와, 상기 이상이 감지된 휘도 이미지에 대응하는 조명장치의 위치 데이터를 추출하여 상기 추출된 조명장치의 위치 데이터에 기반한 휘도 보정 데이터 및 해당 조명장치의 유지보수 데이터 를 생성하는 관리서버;를 포함한다. 또한, 상기 실시 예는 관리서버로부터 생성된 휘도 보정 데이터와 조명장치의 유지보수 데이터를 수신하여 디스 플레이하는 관리자 단말;을 더 포함하는 것을 특징으로 한다. 또한, 상기 실시 예에 따른 드론은 관리서버와 접속하여 드론의 이동 경로 및 비행 정보와 분석 대상 조명장치 의 위치 데이터를 수신하고, 상기 조명장치의 휘도값을 포함한 휘도 이미지와 그에 대응한 조명장치의 위치 데 이터를 송신하는 데이터 통신부; 상기 이동 경로 및 비행 정보에 따라 드론이 비행하도록 제어하는 비행 제어부; 및 휘도계와 카메라를 구비하고, 상기 휘도계에서 측정된 조명장치의 휘도값을 상기 드론이 비행하는 동안 촬영한 이미지에 반영하여 휘도 이미지를 생성하며, 상기 생성된 휘도 이미지에 대응한 조명장치의 위치 데이터를 매칭시켜 출력하는 휘도 촬영부;를 포함하는 것을 특징으로 한다. 또한, 상기 실시 예에 따른 비행 제어부는 가로등 또는 터널등의 휘도를 측정하기 위해 도로면으로부터 일정 높 이(d1) 이격된 상태를 유지하며 비행하도록 제어하는 것을 특징으로 한다. 또한, 상기 실시 예에 따른 비행 제어부는 휘도 촬영부에서 촬영된 카메라의 정보 중에서 차선인식 프로그램을 이용하여 분석되는 차선 정보를 기반으로 드론이 차선 사이에서 일정 간격(d2)을 유지하며 비행하도록 제어하는 것을 특징으로 한다. 또한, 상기 실시 예에 따른 관리서버는 드론의 이동 경로 및 비행 정보와 분석 대상 조명장치의 위치 데이터를 전송하고, 상기 드론으로부터 생성된 조명장치의 휘도값을 포함한 휘도 이미지와 그에 대응한 조명장치의 위치 데이터를 수신하는 데이터 통신부; 상기 드론의 이동 경로 및 비행 정보와 분석 대상 조명장치의 위치 데이터를 생성하고, 상기 드론의 비행을 제어하는 드론 제어부; 학습 데이터를 기반으로 정상 휘도 이미지와 휘도값의 변 화에 따른 휘도 이미지의 변화를 기계 학습을 통해 학습한 인공지능 분석 모델을 이용하여 상기 수신된 휘도 이 미지를 분석하는 인공지능 모델부; 상기 분석된 조명의 휘도 변화를 모니터링하고, 상기 분석된 휘도 이미지 중 에서 이상이 감지된 휘도 이미지와, 상기 이상이 감지된 휘도 이미지에 대응하는 조명장치의 위치 데이터를 추 출하여 상기 추출된 조명장치의 위치 데이터에 기반한 휘도 보정 데이터 및 조명장치의 유지보수 데이터를 생성 하는 모니터링부; 및 상기 모니터링 결과와 추출된 조명장치의 위치 데이터에 기반한 휘도 보정 데이터 및 조명 장치의 유지보수 데이터를 저장하는 데이터 저장부;를 포함하는 것을 특징으로 한다. 또한, 상기 실시 예에 따른 드론 제어부는 드론이 도로면으로부터 일정 거리(d1) 이격된 높이를 유지하며 비행 하도록 비행 정보를 생성하는 것을 특징으로 한다. 또한, 상기 실시 예에 따른 모니터링부는 휘도 이미지 중에서 이상이 감지된 휘도 이미지를 추출하는 분석부; 상기 이상이 감지된 휘도 이미지에 대응하는 조명장치의 위치 데이터를 추출하고, 상기 추출된 조명장치의 위치 데이터에 기반한 휘도 보정 데이터 및 조명장치의 유지보수 데이터를 생성하는 유지보수 관리부; 및 상기 생성 된 휘도 보정 데이터 및 조명장치의 유지보수 데이터를 관리자 단말로 전송하는 알림부;를 포함하는 것을 특징 으로 한다. 또한, 본 발명의 일 실시 예는 드론을 이용한 도로 조명의 휘도 분석 방법으로서, a) 드론이 관리서버에서 설정 된 이동 경로 및 비행 정보와 분석 대상 조명장치의 위치 데이터를 수신하고, 수신된 이동 경로 및 비행 정보를 기반으로 비행하는 단계; b) 상기 드론이 휘도계에서 측정된 조명장치의 휘도값을 비행중에 카메라가 촬영한 이 미지에 반영하여 휘도 이미지를 생성하되, 상기 생성된 휘도 이미지에 대응하여 상기 조명장치의 위치 데이터를 매칭시켜 상기 관리서버로 전송하는 단계; c) 상기 관리서버가 드론으로부터 수신된 휘도 이미지를 인공지능 분석 모델을 통해 휘도 이미지의 변화에 따라 분류하고, 분류된 휘도 이미지를 분석하여 조명장치의 휘도 변화를 모니터링하는 단계; 및 d) 상기 관리서버가 분석된 휘도 이미지 중에서 이상이 감지된 휘도 이미지와, 상기 이 상이 감지된 휘도 이미지에 대응하는 조명장치의 위치 데이터를 추출하고, 추출된 조명장치의 위치 데이터에 기 반한 휘도 보정 데이터 및 해당 조명장치의 유지보수 데이터를 생성하는 단계;를 포함한다. 또한, 상기 실시 예는 e) 상기 관리서버가 생성된 유지보수 데이터를 관리자 단말로 전송하는 단계;를 더 포함 하는 것을 특징으로 한다. 또한, 상기 실시 예에 따른 a) 단계의 드론은 가로등 또는 터널등의 휘도를 측정하기 위해 도로면으로부터 일정 높이(d1) 이격된 상태를 유지하고, 휘도 촬영을 위해 촬영된 카메라의 이미지 정보 중에서 차선인식 프로그램을 이용하여 분석되는 차선 정보를 기반으로 드론이 차선 사이에서 일정 간격(d2)을 유지하며 비행하는 것을 특징 으로 한다. 또한, 상기 실시 예에 따른 c) 단계의 인공지능 분석 모델은 CNN(Convolutional Neural Network) 기반의 딥러 닝 모델을 이용하여 정상 휘도 이미지와 휘도값의 변화에 따른 휘도 이미지를 포함한 학습 데이터를 기반으로 휘도 이미지의 변화를 학습하고, 상기 학습 결과를 기반으로 수신된 휘도 이미지의 휘도 변화에 따라 휘도 이미 지를 분류하는 것을 특징으로 한다."}
{"patent_id": "10-2022-0157683", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 드론을 이용하여 도로 조명의 휘도를 측정하고, 측정된 데이터를 기반으로 휘도의 분석과 결과를 모 니터링하여 도로 조명의 유지보수와 관리를 쉽게 수행할 수 있는 장점이 있다."}
{"patent_id": "10-2022-0157683", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 본 발명의 바람직한 실시 예 및 첨부하는 도면을 참조하여 본 발명을 상세히 설명하되, 도면의 동일 한 참조부호는 동일한 구성요소를 지칭함을 전제하여 설명하기로 한다. 본 발명의 실시를 위한 구체적인 내용을 설명하기에 앞서, 본 발명의 기술적 요지와 직접적 관련이 없는 구성에 대해서는 본 발명의 기술적 요지를 흩뜨리지 않는 범위 내에서 생략하였음에 유의하여야 할 것이다. 또한, 본 명세서 및 청구범위에 사용된 용어 또는 단어는 발명자가 자신의 발명을 최선의 방법으로 설명하기 위 해 적절한 용어의 개념을 정의할 수 있다는 원칙에 입각하여 발명의 기술적 사상에 부합하는 의미와 개념으로 해석되어야 할 것이다. 본 명세서에서 어떤 부분이 어떤 구성요소를 \"포함\"한다는 표현은 다른 구성요소를 배제하는 것이 아니라 다른 구성요소를 더 포함할 수 있다는 것을 의미한다. 또한, \"‥부\", \"‥기\", \"‥모듈\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어나 소프트웨어, 또는 그 둘의 결합으로 구분될 수 있다. 또한, \"적어도 하나의\" 라는 용어는 단수 및 복수를 포함하는 용어로 정의되고, 적어도 하나의 라는 용어가 존 재하지 않더라도 각 구성요소가 단수 또는 복수로 존재할 수 있고, 단수 또는 복수를 의미할 수 있음은 자명하 다 할 것이다. 이하, 첨부된 도면을 참조하여 본 발명의 일 실시 예에 따른 드론을 이용한 도로 조명의 휘도 분석 시스템 및 방법의 바람직한 실시예를 상세하게 설명한다. 도 1은 본 발명의 일 실시 예에 따른 드론을 이용한 도로 조명의 휘도 분석 시스템을 설명하기 위해 나타낸 예 시도이고, 도 2는 본 발명의 일 실시 예에 따른 드론을 이용한 도로 조명의 휘도 분석 시스템의 구성을 나타낸 블록도이며, 도 3은 도 2의 실시 예에 따른 드론을 이용한 도로 조명의 휘도 분석 시스템의 드론 구성을 나타내 는 블록도이고, 도 4는 도 2의 실시 예에 따른 드론을 이용한 도로 조명의 휘도 분석 시스템의 관리서버 구성을 나타낸 블록도이며, 도 5는 도 4의 실시 예에 따른 드론의 동작을 설명하기 위해 나타낸 예시도이고, 도 6은 도 4의 실시 예에 따른 관리서버의 모니터링부 구성을 나타낸 블록도이다. 도1 내지 도6을 참조하면, 본 발명의 일 실시 예에 따른 드론을 이용한 도로 조명의 휘도 분석 시스템은 드론을 이용하여 도로 조명의 휘도를 측정하고, 측정된 데이터를 기반으로 휘도의 분석과 결과를 모니터링하여 도로 조 명의 유지보수와 관리를 쉽게 수행할 수 있도록 드론과, 관리서버와 관리자 단말을 포함하여 구 성될 수 있다. 드론은 관리서버에서 전송된 이동 경로 및 비행 정보를 기반으로 도로를 따라 이동하며 분석 대 상인 가로등과 터널등을 포함한 조명장치의 위치 데이터와, 조명장치의 점등에 따른 휘도값을 포함한 휘도 이미지를 생성하는 구성으로서, 데이터 통신부와, 비행 제어부와, 휘도 촬영부를 포함하여 구성될 수 있다. 데이터 통신부는 무선 네트워크를 통해 관리서버와 연결되고, 관리서버에서 전송되는 드론(10 0)의 이동 경로 및 비행 정보와 분석 대상 조명장치의 위치 데이터를 수신할 수 있다. 또한, 데이터 통신부는 드론이 촬영을 통해 생성한 조명장치의 휘도값을 포함한 휘도 이미지와 그에 대응한 조명장치의 위치 데이터를 관리서버로 송신할 수 있다. 비행 제어부는 수신된 드론의 이동 경로 및 비행 정보에 따라 드론이 비행하도록 제어한다. 즉, 비행 제어부는 지도 정보, 지도 정보상에 표시되는 도로, 교량 및 터널 등의 구조물 정보, GPS(global positioning system) 또는 GNSS(Global Navigation Satellite System)에 기반한 내비게이션 정보 등을 포함한 이동 정보를 기반으로 드론이 이동할 수 있도록 제어한다. 또한, 비행 제어부는 드론이 비행하기 위한 비행 정보로서, 비행 고도, 비행 속도, 비행 방향 등의 정보와, 드론이 비행하는 위치 정보를 기반으로 비행할 수 있도록 제어한다. 또한, 비행 제어부는 가로등 또는 터널등의 휘도를 측정하기 위해 일정 높이, 예를 들어 운전자 의 눈 높이에 대응할 수 있도록 도로면으로부터 1.5m 떨어진 높이를 유지하며 비행하도록 제어할 수 있다. 또한, 비행 제어부는 도로 상에 그려진 차선을 따라 비행할 수 있도록 제어할 수 있다. 즉, 비행 제어부는 휘도 촬영부에서 촬영된 카메라 정보 중에서 차선인식 프로그램을 이용하여 분석 되는 차선 정보를 기반으로 드론이 차선을 따라 비행할 수 있도록 제어할 수 있다. 휘도 촬영부는 휘도를 측정하는 휘도계와 카메라를 구비할 수 있다. 또한, 휘도 촬영부는 휘도계에서 측정된 조명장치의 휘도값을 드론이 비행중에 카메라를 통해 촬영한 이미지에 반영하여 휘도값을 갖는 휘도 이미지를 생성한다. 또한, 휘도 촬영부는 생성된 휘도 이미지에 대응하여 조명장치의 위치 데이터를 매칭시켜 출력할 수도 있 다. 관리서버는 드론과 무선 네트워클르 통해 접속하고, 접속된 드론으로 이동 경로 및 비행 정보와 분석 대상 조명장치의 위치 데이터를 전송할 수 있다. 드론의 이동 경로는 지도 정보와 지도 정보상에 표시되는 도로, 교량 및 터널 등의 구조물 정보 를 포함할 수 있고, GPS(global positioning system) 또는 GNSS(Global Navigation Satellite System)에 기반 한 내비게이션 정보일 수 있다. 또한, 비행 정보는 드론이 비행하기 위한 설정 정보로서, 드론의 비행 고도, 비행 속도, 비행 방향 등의 정보와, 드론이 비행하는 위치 정보를 포함할 수 있다. 또한, 조명장치의 위치 데이터는 도로, 교량 및 터널에 설치된 가로등 및 터널등을 포함한 조명장치 가 설치된 위치 정보로서, GPS 또는 GNSS에 기반한 위치 좌표 정보, 드론이 비행한 거리에 따른 위치, 예 를 들어 등간격으로 설치된 가로등 간의 거리 정보(d3)를 기반으로 산출되는 드론의 위치 일 수도 있 다. 또한, 관리서버는 드론에서 생성된 휘도 이미지와 조명장치의 위치데이터를 수신하여 인공지능 분석 모델을 통해 분석할 수 있고, 이를 통해 조명장치의 휘도 변화를 모니터링할 수 있다. 또한, 관리서버는 분석된 휘도 이미지 중에서 이상이 감지된 휘도 이미지와, 이상이 감지된 휘도 이미지에 대응하는 조명장치의 위치 데이터를 추출하고, 추출된 조명장치의 위치 데이터에 기반한 휘도 보정 데이터 및 해당 조명장치의 유지보수 데이터를 생성할 수 있다. 이를 위해, 관리서버는 데이터 통신부와, 드론 제어부와, 인공지능 모델부와, 모니터링부 와, 데이터 저장부를 포함하여 구성될 수 있다. 데이터 통신부는 무선 네트워클 통해 연결된 드론으로 이동 경로 및 비행 정보와 분석 대상 조명장치 의 위치 데이터를 전송할 수 있다. 또한, 데이터 통신부는 드론으로부터 생성된 조명장치의 휘도값을 포함한 휘도 이미지와 그에 대응한 조명장치의 위치 데이터를 수신한다. 드론 제어부는 드론의 이동 경로 및 비행 정보와 분석 대상 조명장치의 위치 데이터를 생성하여 제공 함으로써, 드론이 자율 비행을 수행할 수 있도록 제어한다. 즉, 드론 제어부는 드론이 지도 정보, 지도 정보상에 표시되는 도로, 교량 및 터널 등의 구조물 정보, GPS(global positioning system) 또는 GNSS(Global Navigation Satellite System)에 기반한 내비 게이션 정보 등을 포함한 이동 정보를 이용하여 이동할 수 있도록 이동 경로 정보를 생성하여 출력할 수 있다. 또한, 드론 제어부는 드론이 촬영을 위한 비행 고도, 비행 속도, 비행 방향 등의 정보와, 드론 이 비행하는 위치 정보를 기반으로 비행할 수 있도록 비행 정보를 생성하여 드론으로 출력할 수 있다. 또한, 드론 제어부는 가로등 또는 터널등의 휘도를 측정하기 위해 드론이 일정 높이(d1), 예를 들어 운전자의 눈 높이에 대응할 수 있도록 도로면으로부터 1.5m 떨어진 높이를 유지하며 비행하도록 비행 정보를 출력할 수 있다. 또한, 드론 제어부는 사용자가 입력하는 수동 비행 신호에 따라 드론이 비행할 수 있도록 제어신호를 출력할 수도 있다. 인공지능 모델부는 정상 휘도 이미지와 휘도값의 변화에 따른 휘도 이미지를 포함한 학습 데이터를 기반으 로 정상 휘도 이미지와 휘도값의 변화에 따른 휘도 이미지의 변화를 기계 학습을 통해 학습하는 인공지능 분석 모델을 생성하는 구성으로서, 관리서버에 일체형으로 구성될 수도 있고, PC 또는 별도의 서버 시스템으로 구성될 수도 있다. 인공지능 분석 모델은 CNN(Convolutional Neural Network) 기반의 딥러닝 모델을 이용하여 정상 휘도 이미지와 휘도값의 변화에 따른 휘도 이미지를 포함한 학습 데이터를 기반으로 휘도 이미지의 변화에 대한 분류를 학습한 다. 여기서, 인공지능 분석 모델은 머신 러닝중에서 딥러닝(Deep learning)이라는 방법을 통해 만들어진 분석 모델 들의 종류라고 볼 수 있다. 따라서, 인공지능 분석 모델은 딥러닝 모델 또는 딥러닝 분석 모델의 표현으로 사용될 수도 있다. 또한, 머신 러닝은 복잡한 시스템이 명시적으로 프로그래밍되지 않고서, 경험으로부터 자동으로 학습하고 개선 할 수 있게 하는 인공 지능의 응용이다. 또한, 머신 러닝 모델들의 정확도 및 유효성은 그들 모델들을 훈련시키는 데 사용되는 데이터에 부분적으로 의 존할 수 있다. 또한, 인공지능 분석 모델은 드론으로부터 수신된 휘도 이미지를 기반으로 인공지능 분석 모델의 추가 학 습을 수행할 수도 있다. 또한, 인공지능 분석 모델은 다양한 환경, 예를 들어, 촬영각도, 촬영시 흔들림, 촬영구도, 사진 해상도 등 다 양한 여건에서 촬영될 수 있는 이미지를 감안하여 원본 이미지에 대하여 다양한 변화를 준 추가 이미지들을 사 전에 학습함으로써, 실제 환경에서 촬영되는 이미지들에 대한 인식율을 향상시킬 수도 있다. 또한, 학습된 인공지능 분석 모델은 수신된 휘도 이미지를 예를 들어 휘도 저하, 균제도 저하, 조명장치 미점등 과 같은 휘도 변화에 따라 분류한다. 모니터링부는 인공지능 모델부가 학습된 인공지능 분석 모델을 이용하여 분류한 조명장치의 휘도 이 미지를 실시간 분석할 수 있다. 또한, 모니터링부는 분석된 조명장치의 휘도 변화를 모니터링할 수 있고, 분석된 휘도 이미지 중에서 휘도 저하, 균제도 저하, 조명장치 미점등 등의 이상으로 분류된 조명장치의 휘도 이미지가 감지되면, 이상이 감지된 휘도 이미지에 대응하는 조명장치의 위치 데이터와 함께 추출한다. 또한, 모니터링부는 추출된 조명장치의 위치 데이터에 기반하여 해당 조명장치의 위치 정보와, 조명장치의 휘도 보정을 위한 휘도 보정 데이터와, 조명장치의 수리 또는 교환 등의 유지보수 데이터를 생성할 수 있다. 이를 위해, 모니터링부는 분석부와, 유지보수 관리부와, 알림부를 포함하여 구성될 수 있 다. 분석부는 인공지능 분석 모델이 분류한 휘도 이미지 중에서 휘도 저하, 균제도 저하, 조명장치 미점등 등 의 이상이 감지된 휘도 이미지를 추출한다. 유지보수 관리부는 이상이 감지된 휘도 이미지에 대응하는 조명장치의 위치 데이터를 추출하고, 추출된 조 명장치의 위치 데이터에 기반하여 해당 조명장치에 대한 휘도 저하, 균제도 저하 등을 보정하기 위한 휘도 보정 데이터와, 조명장치 미점등에 따른 수리 또는 교환 등의 유지보수 데이터를 생성한다. 알림부는 유지보수 관리부에서 생성된 조명장치의 휘도 보정 데이터와 유지보수 데이터를 관리자 단 말로 전송한다. 데이터 저장부는 모니터링부의 모니터링 결과와 추출된 조명장치의 위치 데이터에 기반한 조명 장치 의 휘도 보정 데이터와 조명장치의 유지보수 데이터를 저장한다. 관리자 단말은 관리서버로부터 생성된 휘도 보정 데이터와 조명장치의 유지보수 데이터를 수신하면, 수신된 휘도 보정 데이터와 조명장치의 유지보수 데이터를 관리자가 확인할 수 있도록 디스플레이 한다. 다음은 본 발명의 일 실시 예에 따른 드론을 이용한 도로 조명의 휘도 분석 방법을 설명한다. 도 7은 본 발명의 일 실시 예에 따른 드론을 이용한 도로 조명의 휘도 분석 방법을 설명하기 위해 나타낸 흐름 도이다. 도 1 내지 도 7을 참조하면, 본 발명의 일 실시 예에 따른 드론을 이용한 도로 조명의 휘도 분석 방법은 드론 이 관리서버에서 설정된 이동 경로 및 비행 정보와 분석 대상 조명장치의 위치 데이터를 수신하면, 수신된 이동 경로 및 비행 정보를 기반으로 비행(S100)한다. S100 단계에서, 드론은 가로등 또는 터널등의 휘도를 측정하기 위해 도로면으로부터 일정 높이 (d1) 이격된 상태를 유지하며 비행할 수 있다. 또한, S100 단계에서 드론은 휘도 촬영을 위해 촬영된 촬영된 카메라의 이미지 정보 중에서 차선인식 프로 그램을 이용하여 분석되는 차선 정보를 기반으로 드론이 차선 사이에서 일정 간격(d2)을 유지하며 비행할 수 있도록 제어할 수 있다. 계속해서, 드론은 S100 단계에서 수신된 이동 경로 및 비행 정보를 기반으로 비행하면서, 휘도계에서 측정 된 조명장치의 휘도값을 비행중에 카메라가 촬영한 이미지에 반영하여 휘도 이미지를 생성하고, 생성된 휘도 이 미지에 대응하여 조명장치의 위치 데이터를 매칭시켜 관리서버로 전송(S200)한다. 관리서버는 드론으로부터 수신된 휘도 이미지를 인공지능 분석 모델을 통해 휘도 이미지의 변화에 따 라 분류하고, 분류된 휘도 이미지를 분석하여 조명장치의 휘도 변화를 모니터링(S300)한다. S300 단계에서, 인공지능 분석 모델은 정상 휘도 이미지와 휘도값의 변화에 따른 휘도 이미지를 포함한 학습 데 이터를 기반으로 휘도 이미지의 변화를 학습할 수 있고, 학습 결과를 기반으로 수신된 휘도 이미지의 휘도 변화 에 따라 휘도 이미지를 분류한다. 즉, 도 8 및 도 9와 같은 정상 휘도의 이미지와, 도 10과 같은 균제도 저하 이미지, 도 11의 휘도 저하 이미지, 도 12의 조명 미점등과 같은 이상이 감지된 이미지로 분류할 수 있다. S300 단계의 분석된 휘도 이미지 중에서 휘도 저하, 균제도 저하, 조명장치 미점등 등의 이상으로 분류된 조명 장치의 휘도 이미지가 감지되면, 관리서버는 분석된 휘도 이미지 중에서 이상이 감지된 휘도 이미지와, 이 상이 감지된 휘도 이미지에 대응하는 조명장치의 위치 데이터를 추출하고, 추출된 조명장치의 위치 데이터에 기 반한 휘도 보정 데이터 및 해당 조명장치의 유지보수 데이터를 생성(S400)한다. 관리서버는 S400 단계에서 생성된 유지보수 데이터를 관리자 단말로 전송하고, 결과를 저장(S500)한 다. 따라서, 드론을 이용하여 도로 조명의 휘도를 측정하고, 측정된 데이터를 기반으로 휘도의 분석과 결과를 모니 터링하여 도로 조명의 유지보수와 관리를 쉽게 수행할 수 있다. 상기와 같이, 본 발명의 바람직한 실시 예를 참조하여 설명하였지만 해당 기술 분야의 숙련된 당업자라면 하기 의 특허청구범위에 기재된 본 발명의 사상 및 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수 정 및 변경시킬 수 있음을 이해할 수 있을 것이다. 또한, 본 발명의 특허청구범위에 기재된 도면번호는 설명의 명료성과 편의를 위해 기재한 것일 뿐 이에 한정되 는 것은 아니며, 실시예를 설명하는 과정에서 도면에 도시된 선들의 두께나 구성요소의 크기 등은 설명의 명료 성과 편의상 과장되게 도시되어 있을 수 있다. 또한, 상술된 용어들은 본 발명에서의 기능을 고려하여 정의된 용어들로서 이는 사용자, 운용자의 의도 또는 관 례에 따라 달라질 수 있으므로, 이러한 용어들에 대한 해석은 본 명세서 전반에 걸친 내용을 토대로 내려져야 할 것이다."}
{"patent_id": "10-2022-0157683", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "또한, 명시적으로 도시되거나 설명되지 아니하였다 하여도 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자가 본 발명의 기재사항으로부터 본 발명에 의한 기술적 사상을 포함하는 다양한 형태의 변형을 할 수 있음은 자명하며, 이는 여전히 본 발명의 권리범위에 속한다. 또한, 첨부하는 도면을 참조하여 설명된 상기의 실시예들은 본 발명을 설명하기 위한 목적으로 기술된 것이며 본 발명의 권리범위는 이러한 실시예에 국한되지 아니한다."}
{"patent_id": "10-2022-0157683", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시 예에 따른 드론을 이용한 도로 조명의 휘도 분석 시스템을 설명하기 위해 나타낸 예 시도. 도 2는 본 발명의 일 실시 예에 따른 드론을 이용한 도로 조명의 휘도 분석 시스템의 구성을 나타낸 블록도. 도 3은 도 2의 실시 예에 따른 드론을 이용한 도로 조명의 휘도 분석 시스템의 드론 구성을 나타내는 블록도. 도 4는 도 2의 실시 예에 따른 드론을 이용한 도로 조명의 휘도 분석 시스템의 관리서버 구성을 나타낸 블록도. 도 5는 도 4의 실시 예에 따른 관리서버의 드론 제어를 설명하기 위해 나타낸 예시도. 도 6은 도 4의 실시 예에 따른 관리서버의 모니터링부 구성을 나타낸 블록도. 도 7은 본 발명의 일 실시 예에 따른 드론을 이용한 도로 조명의 휘도 분석 방법을 설명하기 위해 나타낸 흐름 도. 도 8 및 도 9는 본 발명의 일 실시 예에 따른 드론을 이용하여 찰영한 정상 상태의 휘도 이미지. 도 10은 본 발명의 일 실시 예에 따른 드론을 이용하여 찰영한 균제도가 저하된 상태의 휘도 이미지. 도 11은 본 발명의 일 실시 예에 따른 드론을 이용하여 찰영한 휘도가 저하된 상태의 휘도 이미지. 도 12는 본 발명의 일 실시 예에 따른 드론을 이용하여 찰영한 터널등이 미점등된 상태를 나타낸 이미지."}
