{"patent_id": "10-2023-0151669", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0018349", "출원번호": "10-2023-0151669", "발명의 명칭": "누운 자세에서 심리적 안정을 유도하는 컨텐트를 제공하는 영상제공장치 및 그 동작 방법", "출원인": "주식회사 세븐포인트원", "발명자": "이현준"}}
{"patent_id": "10-2023-0151669", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "누운 자세에서 착용 가능한 영상제공장치에 있어서,메모리; 사용자의 상기 영상제공장치 착용을 감지하는 센서부; 및상기 센서부를 통해 상기 사용자의 영상제공장치 착용이 감지되면 컨텐트를 제공하는 프로세서를 포함하되,상기 프로세서는,상기 사용자를 확인하고, 상기 확인된 사용자에 대해 미리 저장된 컨텐트 정보를 호출하고, 상기 사용자의 생체정보를 획득하여, 상기 사용자의 생체 정보와 상기 호출한 컨텐트 정보에 기초하여 상기 컨텐트를 제공하도록제어하는,영상제공장치."}
{"patent_id": "10-2023-0151669", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 상기 프로세서는,상기 사용자 및 상기 사용자의 수술 정보를 획득하고,상기 획득한 사용자 및 사용자의 수술 정보에 기초하여 제공할 컨텐트 후보를 선별하고,상기 선별된 컨텐트를 상기 영상제공장치를 통해 사용자에게 제공하도록 제어한 후,상기 사용자의 생체 정보와 피드백 정보 중 적어도 하나를 획득하는,영상제공장치."}
{"patent_id": "10-2023-0151669", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서, 상기 프로세서는,상기 획득한 사용자의 생체 정보와 피드백 정보 중 적어도 하나를 분석하고,상기 분석 결과에 기초하여 수술실에서 상기 사용자에게 제공할 컨텐트 후보를 선별하고,상기 선별된 컨텐트 후보에 대한 컨텐트 정보가 상기 메모리에 저장되도록 제어하는,영상제공장치."}
{"patent_id": "10-2023-0151669", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "에 있어서, 상기 프로세서는,상기 분석 결과 상기 사용자의 상태가 제1 상태인지 판단하여 제1 상태이면, 제1 제어 신호를 생성 및전송하고, 미리 정의된 시간 경과 후 상기 사용자의 생체 정보를 재획득 및 재분석하여, 상기 재분석 결과 사용자의 상태가 제2 상태가 아니면, 이벤트 발생 여부를 판단하고,상기 이벤트 발생 여부 판단 결과 이벤트 발생으로 판단된 경우에는 프로세스를 리셋하고 사용자 생체 정보를다시 획득하도록 제어하는,영상제공장치."}
{"patent_id": "10-2023-0151669", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "누운 자세에서 착용 가능한 영상제공장치의 동작 방법에 있어서, 사용자의 상기 영상제공장치 착용을 감지하는 단계;상기 사용자를 확인하는 단계;상기 확인된 사용자에 대해 미리 저장된 컨텐트 정보를 호출하는 단계;사용자의 생체 정보를 획득하는 단계; 및상기 사용자의 생체 정보와 상기 호출한 컨텐트 정보에 기초하여 컨텐트를 제공하는 단계를 포함하는,동작 방법."}
{"patent_id": "10-2023-0151669", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 6에 있어서, 상기 사용자 및 상기 사용자의 수술 정보를 획득하는 단계;상기 획득한 사용자 및 사용자의 수술 정보에 기초하여 제공할 컨텐트 후보를 선별하는 단계;상기 선별된 컨텐트를 상기 영상제공장치를 통해 사용자에게 제공하는 단계; 및상기 사용자의 생체 정보와 피드백 정보 중 적어도 하나를 획득하는 단계를 더 포함하는,동작 방법."}
{"patent_id": "10-2023-0151669", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 7에 있어서, 상기 획득한 사용자의 생체 정보와 피드백 정보 중 적어도 하나를 분석하는 단계;상기 분석 결과에 기초하여 수술실에서 상기 사용자에게 제공할 컨텐트 후보를 선별하는 단계; 및상기 선별된 컨텐트 후보에 대한 컨텐트 정보를 저장하는 단계를 더 포함하는,동작 방법."}
{"patent_id": "10-2023-0151669", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 8에 있어서, 상기 사용자의 생체 정보와 상기 호출한 컨텐트 정보에 기초하여 컨텐트를 제공하는 단계는,상기 제공된 컨텐트에 따른 사용자의 생체 정보를 획득하는 단계; 및공개특허 10-2025-0018349-4-상기 획득한 생체 정보를 분석하는 단계를 더 포함하는,동작 방법."}
{"patent_id": "10-2023-0151669", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 9에 있어서, 상기 분석 결과 상기 사용자의 상태가 제1 상태인지 판단하여 제1 상태이면, 제1 제어 신호를 생성 및 전송하는단계; 미리 정의된 시간 경과 후 상기 사용자의 생체 정보를 재획득 및 재분석하는 단계;상기 재분석 결과 사용자의 상태가 제2 상태가 아니면, 이벤트 발생 여부를 판단하는 단계; 및상기 이벤트 발생 여부 판단 결과 이벤트 발생으로 판단된 경우에는 프로세스를 리셋하고 사용자 생체 정보를다시 획득하는 단계를 더 포함하는,동작 방법."}
{"patent_id": "10-2023-0151669", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "누운 자세에서 심리적 안정을 유도하는 컨텐트를 제공하는 영상제공장치 및 그 동작 방법이 개시된다. 본 영상제 공장치는, 메모리; 사용자의 상기 영상제공장치 착용을 감지하는 센서부; 및 상기 센서부를 통해 상기 사용자의 영상제공장치 착용이 감지되면 컨텐트를 제공하는 프로세서를 포함하되, 상기 프로세서는, 상기 사용자를 확인하 고, 상기 확인된 사용자에 대해 미리 저장된 컨텐트 정보를 호출하고, 상기 사용자의 생체 정보를 획득하여, 상 기 사용자의 생체 정보와 상기 호출한 컨텐트 정보에 기초하여 상기 컨텐트를 제공하도록 제어할 수 있다."}
{"patent_id": "10-2023-0151669", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 누운 자세에서 심리적 안정을 유도하는 컨텐트를 제공하는 영상제공장치 및 그 동작 방법에 관한 것 이다."}
{"patent_id": "10-2023-0151669", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "수술 등의 경우에 이를 처음 경험해 보는 환자의 경우에는 극심한 두려움에 휩싸일 수 있다. 이는 환자를 경직 하게 만들어 수술이 제 시간에 시작되지 못하거나 수술과정에서 근육 경직 등으로 인해 수술 난이도가 높아지거 나 문제 발생 가능성을 높일 수 있다. 이에 따라, 수술과 같은 극한 환경에서, 사용자의 긴장도를 낮추고, 정해진 스케줄대로 진행될 수 있도록 하기 위한 다양한 보조 장치가 연구 중에 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국 등록특허공보 10-1659660호 (2016.09.19.)"}
{"patent_id": "10-2023-0151669", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 수술 전 또는 수술 중과 같은 사용자의 심리적 안정이 요구되는 상황에 적합한 최적의 컨텐트를 제공 하여, 상기 상황에서도 심리적인 안정을 유도하는 영상제공장치 및 그 동작 방법을 제공하는 것이다."}
{"patent_id": "10-2023-0151669", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 과제를 해결하기 위한 본 발명의 다양한 실시예들 중 적어도 하나에 따른 누운 자세에서 착용 가능한 영 상제공장치는, 메모리; 사용자의 상기 영상제공장치 착용을 감지하는 센서부; 및 상기 센서부를 통해 상기 사용 자의 영상제공장치 착용이 감지되면 컨텐트를 제공하는 프로세서를 포함하되, 상기 프로세서는, 상기 사용자를 확인하고, 상기 확인된 사용자에 대해 미리 저장된 컨텐트 정보를 호출하고, 상기 사용자의 생체 정보를 획득하 여, 상기 사용자의 생체 정보와 상기 호출한 컨텐트 정보에 기초하여 상기 컨텐트를 제공하도록 제어할 수 있다. 본 개시의 다양한 실시예들 중 적어도 하나에 따르면, 상기 프로세서는, 상기 사용자 및 상기 사용자의 수술 정 보를 획득하고, 상기 획득한 사용자 및 사용자의 수술 정보에 기초하여 제공할 컨텐트 후보를 선별하고, 상기 선별된 컨텐트를 상기 영상제공장치를 통해 사용자에게 제공하도록 제어한 후, 상기 사용자의 생체 정보와 피드 백 정보 중 적어도 하나를 획득할 수 있다. 본 개시의 다양한 실시예들 중 적어도 하나에 따르면, 상기 프로세서는, 상기 획득한 사용자의 생체 정보와 피 드백 정보 중 적어도 하나를 분석하고, 상기 분석 결과에 기초하여 수술실에서 상기 사용자에게 제공할 컨텐트 후보를 선별하고, 상기 선별된 컨텐트 후보에 대한 컨텐트 정보가 상기 메모리에 저장되도록 제어할 수 있다. 본 개시의 다양한 실시예들 중 적어도 하나에 따르면, 상기 프로세서는, 상기 사용자의 생체 정보와 상기 호출 한 컨텐트 정보에 기초하여 컨텐트를 제공하되, 상기 제공된 컨텐트에 따른 사용자의 생체 정보를 획득하고, 상 기 획득한 생체 정보를 분석할 수 있다. 본 개시의 다양한 실시예들 중 적어도 하나에 따르면, 상기 프로세서는, 상기 분석 결과 상기 사용자의 상태가 제1 상태인지 판단하여 제1 상태이면, 제1 제어 신호를 생성 및 전송하고, 미리 정의된 시간 경과 후 상기 사용 자의 생체 정보를 재획득 및 재분석하여, 상기 재분석 결과 사용자의 상태가 제2 상태가 아니면, 이벤트 발생 여부를 판단하고, 상기 이벤트 발생 여부 판단 결과 이벤트 발생으로 판단된 경우에는 프로세스를 리셋하고 사 용자 생체 정보를 다시 획득하도록 제어할 수 있다. 본 개시의 다양한 실시예들 중 적어도 하나에 따른 누운 자세에서 착용 가능한 영상제공장치의 동작 방법은, 사 용자의 상기 영상제공장치 착용을 감지하는 단계; 상기 사용자를 확인하는 단계; 상기 확인된 사용자에 대해 미 리 저장된 컨텐트 정보를 호출하는 단계; 사용자의 생체 정보를 획득하는 단계; 및 상기 사용자의 생체 정보와 상기 호출한 컨텐트 정보에 기초하여 컨텐트를 제공하는 단계를 포함할 수 있다. 본 개시의 다양한 실시예들 중 적어도 하나에 따르면, 상기 사용자 및 상기 사용자의 수술 정보를 획득하는 단 계; 상기 획득한 사용자 및 사용자의 수술 정보에 기초하여 제공할 컨텐트 후보를 선별하는 단계; 상기 선별된 컨텐트를 상기 영상제공장치를 통해 사용자에게 제공하는 단계; 및 상기 사용자의 생체 정보와 피드백 정보 중 적어도 하나를 획득하는 단계를 더 포함할 수 있다. 본 개시의 다양한 실시예들 중 적어도 하나에 따르면, 상기 획득한 사용자의 생체 정보와 피드백 정보 중 적어 도 하나를 분석하는 단계; 상기 분석 결과에 기초하여 수술실에서 상기 사용자에게 제공할 컨텐트 후보를 선별 하는 단계; 및 상기 선별된 컨텐트 후보에 대한 컨텐트 정보를 저장하는 단계를 더 포함할 수 있다. 본 개시의 다양한 실시예들 중 적어도 하나에 따르면, 상기 사용자의 생체 정보와 상기 호출한 컨텐트 정보에 기초하여 컨텐트를 제공하는 단계는, 상기 제공된 컨텐트에 따른 사용자의 생체 정보를 획득하는 단계; 및 상기 획득한 생체 정보를 분석하는 단계를 더 포함할 수 있다. 본 개시의 다양한 실시예들 중 적어도 하나에 따르면, 상기 분석 결과 상기 사용자의 상태가 제1 상태인지 판단 하여 제1 상태이면, 제1 제어 신호를 생성 및 전송하는 단계; 미리 정의된 시간 경과 후 상기 사용자의 생체 정 보를 재획득 및 재분석하는 단계; 상기 재분석 결과 사용자의 상태가 제2 상태가 아니면, 이벤트 발생 여부를 판단하는 단계; 및 상기 이벤트 발생 여부 판단 결과 이벤트 발생으로 판단된 경우에는 프로세스를 리셋하고 사 용자 생체 정보를 다시 획득하는 단계를 더 포함할 수 있다. 본 발명의 기타 구체적인 사항들은 상세한 설명 및 도면들에 포함되어 있다."}
{"patent_id": "10-2023-0151669", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 다양한 실시예들 중 적어도 하나에 따르면, 수술 전 또는 수술 중과 같은 사용자의 심리적 안정이 요 구되는 상황에 적합한 최적의 컨텐트를 제공하여, 상기 상황에서도 심리적인 안정을 유도할 수 있는 이점이 있 다."}
{"patent_id": "10-2023-0151669", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과들은 이상에서 언급된 효과로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재로 부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0151669", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시 전체에 걸쳐 동일 참조 부호는 동일 구성요소를 지칭한다. 본 개시가 실시예들의 모든 요소들을 설명하"}
{"patent_id": "10-2023-0151669", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "는 것은 아니며, 본 개시가 속하는 기술분야에서 일반적인 내용 또는 실시예들 간에 중복되는 내용은 생략한다. 명세서에서 사용되는 ‘부, 모듈, 부재, 블록’이라는 용어는 소프트웨어 또는 하드웨어로 구현될 수 있으며, 실시예들에 따라 복수의 '부, 모듈, 부재, 블록'이 하나의 구성요소로 구현되거나, 하나의 '부, 모듈, 부재, 블 록'이 복수의 구성요소들을 포함하는 것도 가능하다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 직접적으로 연결되어 있는 경우뿐 아니라, 간접적으로 연결되어 있는 경우를 포함하고, 간접적인 연결은 무선 통신망을 통해 연결되는 것을 포함 한다. 또한 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 명세서 전체에서, 어떤 부재가 다른 부재 \"상에\" 위치하고 있다고 할 때, 이는 어떤 부재가 다른 부재에 접해 있는 경우뿐 아니라 두 부재 사이에 또 다른 부재가 존재하는 경우도 포함한다. 제1, 제2 등의 용어는 하나의 구성요소를 다른 구성요소로부터 구별하기 위해 사용되는 것으로, 구성요소가 전 술된 용어들에 의해 제한되는 것은 아니다. 단수의 표현은 문맥상 명백하게 예외가 있지 않는 한, 복수의 표현을 포함한다. 각 단계들에 있어 식별부호는 설명의 편의를 위하여 사용되는 것으로 식별부호는 각 단계들의 순서를 설명하는 것이 아니며, 각 단계들은 문맥상 명백하게 특정 순서를 기재하지 않는 이상 명기된 순서와 다르게 실시될 수 있다. 이하 첨부된 도면들을 참고하여 본 개시의 작용 원리 및 실시예들에 대해 설명한다. 본 명세서에서 '본 개시에 따른 장치'는 연산 처리를 수행하여 사용자에게 결과를 제공할 수 있는 다양한 장치 들이 모두 포함된다. 예를 들어, 본 개시에 따른 장치는, 컴퓨터, 서버 장치 및 휴대용 단말기를 모두 포함하거 나, 또는 어느 하나의 형태가 될 수 있다. 여기에서, 상기 컴퓨터는 예를 들어, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스크톱(desktop), 랩톱 (laptop), 태블릿 PC, 슬레이트 PC 등을 포함할 수 있다. 상기 서버 장치는 외부 장치와 통신을 수행하여 정보를 처리하는 서버로써, 애플리케이션 서버, 컴퓨팅 서버, 데이터베이스 서버, 파일 서버, 게임 서버, 메일 서버, 프록시 서버, 웹 서버 등을 포함할 수 있다. 상기 휴대용 단말기는 예를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), WiBro(Wireless Broadband Internet) 단말, 스마트 폰(Smart Phone) 등과 같은 모든 종류의 핸드헬드 (Handheld) 기반의 무선 통신 장치와 시계, 반지, 팔찌, 발찌, 목걸이, 안경, 콘택트 렌즈, 또는 머리 착용형 장치(HMD: head-mounted device) 등과 같은 웨어러블 장치를 포함할 수 있다. 본 개시에 따른 인공지능과 관련된 기능은 프로세서와 메모리를 통해 동작된다. 프로세서는 하나 또는 복수의 프로세서로 구성될 수 있다. 이때, 하나 또는 복수의 프로세서는 CPU, AP, DSP(Digital Signal Processor) 등 과 같은 범용 프로세서, GPU, VPU(Vision Processing Unit)와 같은 그래픽 전용 프로세서 또는 NPU와 같은 인 공지능 전용 프로세서일 수 있다. 하나 또는 복수의 프로세서는, 메모리에 저장된 기 정의된 동작 규칙 또는 인 공지능 모델에 따라, 입력 데이터를 처리하도록 제어한다. 또는, 하나 또는 복수의 프로세서가 인공지능 전용 프로세서인 경우, 인공지능 전용 프로세서는, 특정 인공지능 모델의 처리에 특화된 하드웨어 구조로 설계될 수 있다. 기 정의된 동작 규칙 또는 인공지능 모델은 학습을 통해 만들어진 것을 특징으로 한다. 여기서, 학습을 통해 만 들어진다는 것은, 기본 인공지능 모델이 학습 알고리즘에 의하여 다수의 학습 데이터들을 이용하여 학습됨으로 써, 원하는 특성(또는, 목적)을 수행하도록 설정된 기 정의된 동작 규칙 또는 인공지능 모델이 만들어짐을 의미 한다. 이러한 학습은 본 개시에 따른 인공지능이 수행되는 기기 자체에서 이루어질 수도 있고, 별도의 서버 및/ 또는 시스템을 통해 이루어질 수도 있다. 학습 알고리즘의 예로는, 지도형 학습(supervised learning), 비지도 형 학습(unsupervised learning), 준지도형 학습(semi-supervised learning) 또는 강화 학습(reinforcement learning)이 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은, 복수의 신경망 레이어들로 구성될 수 있다. 복수의 신경망 레이어들 각각은 복수의 가중치들 (weight values)을 갖고 있으며, 이전(previous) 레이어의 연산 결과와 복수의 가중치들 간의 연산을 통해 신경 망 연산을 수행한다. 복수의 신경망 레이어들이 갖고 있는 복수의 가중치들은 인공지능 모델의 학습 결과에 의 해 최적화될 수 있다. 예를 들어, 학습 과정 동안 인공지능 모델에서 획득한 로스(loss) 값 또는 코스트(cost) 값이 감소 또는 최소화되도록 복수의 가중치들이 갱신될 수 있다. 인공 신경망은 심층 신경망(DNN: Deep Neural Network)를 포함할 수 있으며, 예를 들어, CNN(Convolutional Neural Network), DNN(Deep Neural Network), RNN(Recurrent Neural Network), RBM(Restricted Boltzmann Machine), DBN(Deep Belief Network), BRDNN(Bidirectional Recurrent Deep Neural Network) 또는 심층 Q-네트워크(Deep Q-Networks) 등이 있으나, 전술한 예에 한정되지 않는다. 본 개시의 예시적인 실시예에 따르면, 프로세서는 인공지능을 구현할 수 있다. 인공지능이란 사람의 신경세포 (biological neuron)를 모사하여 기계가 학습하도록 하는 인공신경망(Artificial Neural Network) 기반의 기계 학습법을 의미한다. 인공지능의 방법론에는 학습 방식에 따라 훈련 데이터로서 입력 데이터와 출력 데이터가 같 이 제공됨으로써 문제(입력 데이터)의 해답(출력데이터)이 정해져 있는 지도학습(supervised learning), 및 출 력 데이터 없이 입력데이터만 제공되어 문제(입력 데이터)의 해답(출력 데이터)이 정해지지 않는 비지도학습 (unsupervised learning), 및 현재의 상태(State)에서 어떤 행동(Action)을 취할 때마다 외부 환경에서 보상 (Reward)이 주어지는데, 이러한 보상을 최대화하는 방향으로 학습을 진행하는 강화학습(reinforcement learning)으로 구분될 수 있다. 또한, 인공지능의 방법론은 학습 모델의 구조인 아키텍처에 따라 구분될 수도 있는데, 널리 이용되는 딥러닝 기술의 아키텍처는, 합성곱신경망(CNN; Convolutional Neural Network), 순환신 경망(RNN; Recurrent Neural Network), 트랜스포머(Transformer), 생성적 대립 신경망(GAN; generative adversarial networks) 등으로 구분될 수 있다. 본 장치와 시스템은 인공지능 모델을 포함할 수 있다. 인공지능 모델은 하나의 인공지능 모델일 수 있고, 복수 의 인공지능 모델로 구현될 수도 있다. 인공지능 모델은 뉴럴 네트워크(또는 인공 신경망)로 구성될 수 있으며, 기계학습과 인지과학에서 생물학의 신경을 모방한 통계학적 학습 알고리즘을 포함할 수 있다. 뉴럴 네트워크는 시냅스의 결합으로 네트워크를 형성한 인공 뉴런(노드)이 학습을 통해 시냅스의 결합 세기를 변화시켜, 문제 해 결 능력을 가지는 모델 전반을 의미할 수 있다. 뉴럴 네트워크의 뉴런은 가중치 또는 바이어스의 조합을 포함할 수 있다. 뉴럴 네트워크는 하나 이상의 뉴런 또는 노드로 구성된 하나 이상의 레이어(layer)를 포함할 수 있다. 예시적으로, 장치는 input layer, hidden layer, output layer를 포함할 수 있다. 장치를 구성하는 뉴럴 네트 워크는 뉴런의 가중치를 학습을 통해 변화시킴으로써 임의의 입력(input)으로부터 예측하고자 하는 결과 (output)를 추론할 수 있다. 프로세서는 뉴럴 네트워크를 생성하거나, 뉴럴 네트워크를 훈련(train, 또는 학습(learn)하거나, 수신되는 입력 데이터를 기초로 연산을 수행하고, 수행 결과를 기초로 정보 신호(information signal)를 생성하거나, 뉴럴 네 트워크를 재훈련(retrain)할 수 있다. 뉴럴 네트워크의 모델들은 GoogleNet, AlexNet, VGG Network 등과 같은 CNN(Convolution Neural Network), R-CNN(Region with Convolution Neural Network), RPN(Region Proposal Network), RNN(Recurrent Neural Network), S-DNN(Stacking-based deep Neural Network), S-SDNN(State-Space Dynamic Neural Network), Deconvolution Network, DBN(Deep Belief Network), RBM(Restrcted Boltzman Machine), Fully Convolutional Network, LSTM(Long Short-Term Memory) Network, Classification Network 등다양한 종류의 모델들을 포함할 수 있으나 이에 제한되지는 않는다. 프로세서는 뉴럴 네트워크의 모델들에 따른 연산을 수행하기 위한 하나 이상의 프로세서를 포함할 수 있다. 예를 들어 뉴럴 네트워크는 심층 뉴럴 네트워크 (Deep Neural Network)를 포함할 수 있다. 뉴럴 네트워크는 CNN(Convolutional Neural Network), RNN(Recurrent Neural Network), 퍼셉트론(perceptron), 다층 퍼셉트론(multilayer perceptron), FF(Feed Forward), RBF(Radial Basis Network), DFF(Deep Feed Forward), LSTM(Long Short Term Memory), GRU(Gated Recurrent Unit), AE(Auto Encoder), VAE(Variational Auto Encoder), DAE(Denoising Auto Encoder), SAE(Sparse Auto Encoder), MC(Markov Chain), HN(Hopfield Network), BM(Boltzmann Machine), RBM(Restricted Boltzmann Machine), DBN(Depp Belief Network), DCN(Deep Convolutional Network), DN(Deconvolutional Network), DCIGN(Deep Convolutional Inverse Graphics Network), GAN(Generative Adversarial Network), LSM(Liquid State Machine), ELM(Extreme Learning Machine), ESN(Echo State Network), DRN(Deep Residual Network), DNC(Differentiable Neural Computer), NTM(Neural Turning Machine), CN(Capsule Network), KN(Kohonen Network) 및 AN(Attention Network)를 포함 할 수 있으나 이에 한정되는 것이 아닌 임의의 뉴럴 네트워크를 포함할 수 있음은 통상의 기술자가 이해할 것이다. 본 개시의 예시적인 실시예에 따르면, 프로세서는 GoogleNet, AlexNet, VGG Network 등과 같은 CNN(Convolution Neural Network), R-CNN(Region with Convolution Neural Network), RPN(Region Proposal Network), RNN(Recurrent Neural Network), S-DNN(Stacking-based deep Neural Network), S-SDNN(State-Space Dynamic Neural Network), Deconvolution Network, DBN(Deep Belief Network), RBM(Restrcted Boltzman Machine), Fully Convolutional Network, LSTM(Long Short-Term Memory) Network, Classification Network, Generative Modeling, eXplainable AI, Continual AI, Representation Learning, AI for Material Design, 자 연어 처리를 위한 BERT, SP-BERT, MRC/QA, Text Analysis, Dialog System, GPT-3, GPT-4, 비전 처리를 위한 Visual Analytics, Visual Understanding, Video Synthesis, ResNet 데이터 지능을 위한 Anomaly Detection, Prediction, Time-Series Forecasting, Optimization, Recommendation, Data Creation 등 다양한 인공지능 구 조 및 알고리즘을 이용할 수 있으며, 이에 제한되지 않는다. 이하, 첨부된 도면을 참조하여 본 개시의 실시예를 상세하게 설명한다. 본 개시에서는 영상제공장치(Image providing device)에 대해 기술한다. 이 때, 영상제공장치는 정지영상이나 동영상을 제공하거나 출력할 수 있는 모든 형태의 장치를 포함할 수 있다. 다만, 본 개시에서는 설명의 편의상, 확장현실(XR: eXtended Reality) 장치를 영상제공장치의 일 예시로 기술하나, 이에 한정되는 것은 아니다. 또한, 본 개시에서는 확장현실 장치 중에서도 가상현실(VR: Virtual Reality) 장치를 예로 하여 설명한다. 한편, 본 개시의 영상제공장치는 다양한 산업분야에서 다양한 상황, 목적 등으로 이용될 수 있는데, 본 개시에 서 특히, 의료기관에서 예를 들어, 수술 시에 환자(또는 의료기관)이 착용하는 영상제공장치를 예로 한다. 따라 서, 환자는 주로 수술방에서 수술베드에 누워서 수술(또는 시술)을 받는 것이 일반적인바, 이와 같이 누운 상태 에서도 착용 가능한 영상제공장치를 이하 개시한다. 이러한 본 개시의 다양한 실시예들 중 적어도 하나에 따른 영상제공장치는, 누운 상태에서 영상제공장치를 착용 함에 따라 환자(즉, 사용자)에게 중력 방향으로 가해지는 하중의 부담을 줄이고, 수술 전, 수술 중 또는 수술 완료 후 다른 장소로 이동 과정에서 움직임에 따라 착용한 영상제공장치가 벗겨지지 않도록 할 수 있다. 또한, 상기 과정에서 영상제공장치는 사용자에게 적응적인 컨텐트를 제공하여 수술 과정에서 사용자에 의한 예기치 못 한 이벤트 발생 등에 따른 문제를 미연에 방지할 수 있다. 이하 본 개시의 다양한 실시예에 대해 첨부된 도면을 참조하여 상세하게 설명한다. 도 1은 본 개시의 일실시예에 따른 영상제공시스템의 개략도이다. 도 2는 도 1에서 영상제공장치의 구성 블록도이다. 도 3 내지 4는 도 1의 영상제공장치의 사시도를 도시한 도면이다. 도 5는 도 1의 영상제공장치에서 본체를 설명하기 위해 도시한 도면이다. 도 7은 도 1의 영상제공시스템의 환경을 설명하기 위해 도시한 도면이다. 먼저, 도 1을 참조하면, 본 발명의 다양한 실시예들 중 적어도 하나에 따른 영상제공시스템은, 영상제공장치 , 서버, 및 적어도 하나의 단말기를 포함하여 구성될 수 있다. 영상제공장치는 사용자에 의해 착용 가능한 형태를 가질 수 있다. 예를 들어, 영상제공장치는 도 3 내 지 4와 같은 형태일 수 있다. 영상제공장치는 사용자가 전술한 바와 같이, 수술베드에 누운 상태에서 착용을 하기 때문에, 착용한 사용자 는 중력 방향으로 영상제공장치의 하중을 그대로 받을 수 있다. 따라서, 후술하는 바와 같이, 본 개시의 일 실시예에 따른 영상제공장치는 사용자가 특정 자세, 예를 들어 누운 상태에서 착용하더라도 중력 방향의 하 중이 최소가 되도록 하는 구조를 가질 수 있다. 이에 대해서는, 도 3 내지 4의 설명 부분에서 상세하게 설명한 다. 영상제공장치는 사용자가 착용한 경우에는, 도 14에 도시된 바와 같이 가상의 화면을 제공하여, 그를 통해 사용자에게 정지영상이나 동영상 등 컨텐트를 제공할 수 있다. 영상제공장치는 사용자가 착용한 시점에부터 착용 해제 시점까지 사용자의 상태 등을 체크하고 관련 정보를 수집할 수 있다. 이렇게 수집된 사용자의 상태 정보는 예를 들어, 영상제공장치에서 제공할 컨텐트에 참고 될 수 있다. 전술한 영상제공장치는 전술한 사용자의 상태 정보 등 수집과 함께 단지 영상을 도 14와 같은 가상의 공간 을 통해 출력만 하는 기능을 수행할 수 있다. 따라서, 이 경우에는, 영상제공장치는 수집되는 각종 정보 등 을 서버로 전달하고, 서버에서 수신되는 각종 정보 등을 참고하여 영상제공장치의 동작을 제어하거 나 컨텐트를 제공할 수 있다. 이 경우, 영상제공장치는 미리 저장하고 있는 컨텐트를 제공할 수도 있고, 서 버로부터 실시간으로 다운로드하거나 스트리밍되는 컨텐트를 도 14와 같은 가상의 공간을 통해 사용자에게 제공할 수 있다. 영상제공장치는 제공되는 컨텐트에 대한 평가 내지 피드백을 사용자로부터 획득하거나 센 싱하여, 서버로 전달하거나 직접 참고할 수도 있다. 단말기는 영상제공장치 또는/및 서버로부터 영상제공장치의 상태에 대한 다양한 정보를 제공받 을 수 있다. 여기서, 영상제공장치의 상태라 함은, 영상제공장치가 사용자에 의해 착용되었는지, 영상 제공장치를 착용한 사용자가 현재 어떤 상태인지, 영상제공장치를 착용한 사용자가 현태 시청 중인 컨 텐트는 어떤 컨텐트인지 등을 포함할 수 있다. 단말기는 영상제공장치 또는/및 서버로부터 제공받은 정보에 기초하여, 예를 들어 수술 시작 여부, 수술 진행 여부, 수술 종료 여부 등 다양한 동작을 결정할 수 있다. 한편, 단말기는 영상제공장치 또는/및 서버로부터 제공받은 정보에 기초하여, 예를 들어 사용자의 상태를 보다 빠르게 정확하게 판단할 수 있다. 또한, 단말기는 상기 판단에 따라 영상제공장치로 제어 커맨드를 전송할 수도 있다. 이 경우, 단말기는 서버를 통해 제어 커맨드를 영상제공장치로 제공할 수도 있다. 상기에서, 제어 커맨드에는 예를 들어, 컨텐트 정지, 컨텐트 변경, 영상제공장치의 사용자 착용 해제, 영상 제공장치에서 제공하는 기능들 중 적어도 하나의 실행(예를 들어, 볼륨 조정 등) 등과 관련된 커맨드가 포 함될 수 있다. 도 1에서, 예를 들어 서버는 의료기관에 의해 제공되는 인트라넷 서버이거나 원격에 위치한 클라우드 서버 등일 수 있다. 도 1에서, 예를 들어 단말기는 의료기관이 보유한 단말기, 수술실과 같은 특정 공간에 구비된 디스플레이나 사이니지 등과 같은 단말기일 수도 있다. 이하, 도 2를 참조하여, 영상제공장치에 대해 더욱 상세하게 설명하면, 다음과 같다. 영상제공장치는 통신인터페이스부, 센서부, 데이터처리부, 제어부 및 메모리를 포함하여 구성될 수 있다. 여기서, 메모리를 제외한 나머지 구성들은 프로세서로 명명되어, 단일 칩으로 구현될 수도 있다. 도 2에서 메모리와 프로세서는 각각 별개의 칩으로 구현될 수 있다. 또는, 메모리와 프 로세서가는 단일 칩(single chip)으로 구현될 수도 있다. 통신인터페이스부는 무선 통신 인터페이스 환경을 제공하여, 영상제공장치가 서버 또는/및 단말기 와 네트워크를 통해 데이터를 주고받을 수 있도록 지원할 수 있다. 통신인터페이스부는, BluetoothTM, BLE(Bluetooth Low Enegry), 지그비(Zigbee), LTE, LTE-A, 5G, 와이파이 통신 모듈일 수 있다.센서부는 적어도 하나 이상의 센서를 포함하여, 영상제공장치를 착용한 사용자의 다양한 상태를 감지 할 수 있다. 상기 적어도 하나 이상의 센서에는, 온도 센서, 마이크로폰과 같은 음성 인식 센서나 오디오 센서 (또는 수음 센서), 중력 센서, 가속도 센서, 진동 센서 등 매우 다양한 센서가 포함될 수 있다. 다만, 본 개시 가 상기 나열한 센서에만 한정되는 것은 아니며, 영상제공장치를 착용한 사용자의 상태를 파악하기 위한 센 서는 그 종류와 타입에 한정되지 않고 포함될 수 있다. 이러한 센서로 예를 들어, 홍채인식센서 등이 포함될 수 있다. 데이터처리부는 통신인터페이스부를 통해 주고받은 데이터나, 센서부를 통해 센싱되어 수집되는 데이터를 직접 가공 처리하거나 직접 가공하지 않고 로 데이터(raw data)를 그대로 서버 또는/및 단말기 로 전달할 수도 있다. 제어부는 영상제공장치를 구성하는 각종 구성요소의 동작을 포함하여, 영상제공장치(10의 전반적인 제 어를 담당할 수 있다. 메모리는 다양한 정보를 미리 내장하거나 내장된 정보를 업데이트할 수 있다. 메모리는 영상제공장치 에서 수집/획득하는 데이터나 서버나 단말기와 통신하여 수집되거나 획득되는 데이터를 일시 저장 할 수 있다. 메모리는 필요에 따라 센서부를 통해 센싱되는 데이터를 일시 저장할 수 있으며, 그러한 데이터의 가 공 처리나 유효성 판단 등에 관해 필요한 어플리케이션, 프로그램 등 소프트웨어나 관련 데이터 처리 엔진 등에 관한 데이터를 저장할 수 있다. 상기에서, 데이터 처리 엔진에는 예를 들어, 인공지능 엔진이 포함될 수 있다. 이러한 엔진은 실시예에 따라 제어부 내에 구현될 수 있다. 도시되진 않았으나, 본 개시와 관련하여 서버에서 영상제공장치의 기능을 대신하는 경우에는, 해당 기 능과 관련된 구성을 포함할 수도 있다. 도 2에서, 메모리는 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), SSD 타 입(Solid State Disk type), SDD 타입(Silicon Disk Drive type), 멀티미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 램(random access memory; RAM), SRAM(static random access memory), 롬(read-only memory; ROM), EEPROM(electrically erasable programmable read-only memory), PROM(programmable read-only memory), 자기 메모리, 자기 디스크 및 광디스 크 중 적어도 하나의 타입의 저장매체를 포함할 수 있다. 도 2에서, 메모리는 편의상 1개만 도시하였으나, 이에 한정되는 것은 아니며, 복수 개일 수 있다. 도 2에서, 메모리는 편의상 영상제공장치에 내장된 형태로 도시하고 설명하였으나, 이에 한정되는 것 은 아니다. 예컨대, 메모리는 외부 또는 원격(remote)에 위치한 DB 서버 형태로 구현될 수도 있다. 도 2에 도시된 구성요소들의 성능에 대응하여 적어도 하나의 구성요소가 추가되거나 삭제될 수 있다. 또한, 구 성요소들의 상호 위치는 시스템의 성능 또는 구조에 대응하여 변경될 수 있다는 것은 당해 기술 분야에서 통상 의 지식을 가진 자에게 용이하게 이해될 것이다. 한편, 도 2에서 도시된 각각의 구성요소는 소프트웨어 및/또는 FPGA(Field Programmable Gate Array) 및 주문 형 반도체(ASIC: Application Specific Integrated Circuit)와 같은 하드웨어 구성요소를 의미한다. 이하에서는 도 3과 4를 참조하여, 영상제공장치의 구조에 대해 기술한다. 도 3 내지 4를 참조하면, 본 개시의 일실시예에 따른 영상제공장치는, 영상을 제공하는 본체와, 사용 자(환자)가 누운 자세에서 착용 가능하도록 상기 본체의 제1 방향(예를 들어, 중력 방향)으로의 하중이 분산되 면서 기준면으로부터 소정 높이에서 고정되도록 지지하는 지지부를 포함하여 구성될 수 있다. 여기서, 기준면은 예를 들어, 수술실 바닥, 수술베드 상부면 등일 수 있다. 도 3 내지 5를 참조하여, 영상제공장치의 본체를 설명하면, 다음과 같다. 본체의 형상은 도 3 내지 5에 도시된 바와 같이 예를 들어, 일반적인 VR 기기나 XR 기기의 형태일 수 있다. 도 3 내지 5를 참조하면, 사용자가 수술실베드에 누워있는 경우, 본체는 중력방향으로 자동으로 움직이거 나 사용자(환자나 수술참여인원 등)가 중력방향으로 힘을 가하여 얼굴에 착용할 수 있다.이 때, 전술한 바와 같이, 사용자가 서 있는 경우와 달리, 본 개시와 같이 사용자가 누워 있는 경우에는, 사용 자가 영상제공장치를 도 5의 (a) 내지 (b)에 도시된 바와 같이, 얼굴에 착용하는 경우, 상기 착용한 영상제 공장치의 하중을 그대로 받을 수 있다. 본 개시에서는 따라서, 이러한 상태에서도 영상제공장치를 착용 한 사용자가 그 하중에 따른 영향이 최소가 되도록, 하중이 발생하는 중력 방향의 반대 방향으로 힘이 작용되도 록 할 수 있다. 이를 위해, 본 개시에서는 영상제공장치의 본체를 공간에서 지지하여 중력방향으로 발생하 는 하주이 최소가 되도록 할 수 있다. 도 3 내지 5를 참조하면, 본체는 외부로 노출되는 전면부, 상기 전면부로부터 연장되어 형성되 는 제1 고정부 등을 포함하여 구성될 수 있다. 도 5의 (a)에서는 영상제공장치를 착용한 사용자가 도시되었다. 한편, 도 5의 (a)에서는 본체의 전면부 가 도시되었다. 본체의 전면부는 사용자가 착용하는 일반적인 안경과는 다르게 불투명한 재질로 구현 될 수 있다. 도 5의 (b)에서는 본체의 내부 도면이 도시되었다. 도 5의 (b)를 참조하면, 본체의 양단에는 제1 고정부가 형성되었다. 본체는 중앙에 도 14와 같은 가상의 공간상에서 컨텐트를 시청할 수 있도록 영상제공/뇌파측정부(예를 들어, 렌즈(lens) 포함)가 양단에 형성되었다. 본체에는 영상 등의 시청이 가능하도록 착용자의 눈에 대등되도록 설계된 2개의 영상제공/뇌파측정부 가 도시되었다. 도 5의 (a)를 참조하면, 본체의 일 영역, 예를 들어 착용자의 코에 상응하는 영역에는 후각처리부가 구비 될 수 있다. 이러한 후각처리부에는 카트리지(Cartridge)가 배치되어, 수술 과정에서 발생하는 다양한 냄 새를 차단할 수 있다. 그 밖에, 후각처리부 는 영상제공장치를 통해 제공되는 컨텐트와 관련된 냄새나 수술 과정에서 수술환자의 심신이 안정되도록 하는 카트리지가 포함될 수 있다. 상기 카트리지는 수술과 관련된 마취 가스가 들어가는 수술 관련 장비와 연결되거나 또는 마취 가스를 주입하는 수술 관련 장비와 연결될 수 있 다. 본체의 내측에는 영상제공/뇌파측정부의 상단에 탄력성이 있는 재질로 구현된 제2 고정부가 포함 되었다. 제2 고정부는 영상제공장치가 착용된 경우에 중력방향으로 발생하는 하중에 따른 충격을 완화시킬 수 있다. 제2 고정부 상에는 센서 등이 배치되어, 접촉된 사용자의 부위로부터 정보를 센싱할 수 있다. 도 3 내지 5를 참조하면, 제1 고정부는 본체의 영상제공/뇌파측정부의 양단으로부터 연장되어 상기 본체를 착용하는 사용자의 머리 움직임 방향에 따라 상응하는 방향으로 상기 본체의 움직임을 유도할 수 있다. 한편, 제1 고정부는 사용자의 머리 움직임에 따라 본체가 사용자의 머리로부터 분리 또는 이탈되지 않도록 고정할 수 있다. 제1 고정부는, 영상제공/뇌파측정부의 양단으로부터 미리 설정된 길이만큼 연장될 수 있다. 이 때, 미리 설정된 길이는, 본체를 착용한 사용자의 머리 뒷부분이 기준면(예를 들어, 수술베드 등)에 맞 닿는 경우에, 제1 고정부의 최하단이 제2 지지부의 최상단의 일면과 맞닿지 않거나 둘 사이에 소정 간격을 가지고 공간이 형성될 수 있는 길이를 나타낼 수 있다. 도 3 내지 4를 참조하면, 본체는, 사운드를 출력하는 음성출력부를 수용하는 수용부를 더 포함할 수 있다. 이 경우, 음성출력부는 유선 방식의 이어폰 형태로 구현되는 경우, 임의로 길이를 조절할 수 있다. 따라 서, 이러한 음성출력부는 예를 들어, 원하는 길이로 조절할 경우 나머지는 노출되지 않고 수용할 수 있거나 사 용하지 않는 경우에는 내부에 전부 수용될 수 있는 공간, 즉 수용부가 필요하다. 이러한 수용부는 예컨대, 제1 고정부 내에 형성될 수 있다. 실시예에 따라서, 음성출력부를 수용하는 수용부는 제1 지지부(120-1, 120-2) 또는 제2 지지부 상에 구비될 수도 있다.먼저, 제1 지지부(120-1)는 적어도 하나의 지지프레임으로 구현될 수 있다. 도 3에서는 2개의 지지프레임이 적 용되었으며, 제1 지지프레임의 일단과 제2 지지프레임의 타단이 힌지 등과 같은 구성을 이용하여 결합될 수 있다. 제1 지지프레임의 타단은 본체의 일단과 결합할 수 있다. 한편, 제2 지지프레임의 일단은 제2 지지부(13 0)의 일단과 결합할 수 있다. 이와 같이, 제1 지지부(120-1)를 통해 본체와 제2 지지부는 서로 연동될 수 있다. 달리 말하면, 본체 는 제2 지지부를 기준으로 하여 제1 지지부(120-1)를 통해 다양한 방향으로 움직일 수 있다. 제1 지지부(120-1)는 힌지부를 통해 적어도 중력 방향과 중력 반대 방향(또는 수직 방향)으로 움직임에는 제한이 없을 수 있다. 제2 지지부는 기준면(예를 들어, 수술실베드)상에 위치하거나 일 영역에 접촉되어, 제1 지지부(120-1)를 지지하여, 본체의 움직임을 지원할 수 있다. 상기와 같이, 제2 지지부가 기준면상에 위치하거나 일 영역에 접촉되는 경우, 적어도 본체의 중력 방 향으로의 움직임에 따른 하중을 분산시킬 수 있다. 이를 위해, 되도록 제2 지지부는 기준면과 접촉 면이 큰 것이 바람직하다. 관련하여, 제2 지지부는 소정 높이와 소정 길이를 가지도록 구현될 수 있다. 만약 제2 지지부가 충분 한 길이로 형성되지 않는 경우에는 본체의 중량에 따라서 중력 방향으로 작용하는 본체의 하중을 충 분히 분산시킬 수 없기 때문에, 본체의 중량 대비 최적의 길이를 결정하여, 적용할 수 있다. 한편, 제2 지지부는 소정 높이를 가지도록 구현될 수 있다. 제2 지지부의 높이는 예를 들어, 제1 지 지부(120-1)와의 결합을 위하여 본체의 중량에 따라 힌지를 통해 절곡되는 제1 지지부(120-1)가 충분히 지 지될 수 있도록 결합 수단을 수용할 수 있는 높이가 이용될 수 있다. 도시되진 않았지만, 제2 지지부의 하부는 평평한 면을 가지거나 탄력있는 재질로 구성되어, 수술실베드나 평평하지 못한 것에 위치하는 경우에도 충분히 중력 방향에 수직으로 일정 각도(예를 들어, 중력 방향과 90도) 를 형성할 수 있도록 할 수 있다. 도 3에서, 제1 지지부(120-1)를 구성하는 제1 지지프레임 또는/및 제2 지지프레임은 각각 본체와 제2 지지 부로부터 결합 해제 가능할 수 있다. 즉, 제1 지지부(120-1)는 본체 또는/및 제2 지지부와 탈부 착 가능할 수 있다. 달리 말하면, 본체는 지지부로부터 분리 가능하여, 임의의 본체를 새로이 결합 또는 결합 해제할 수 있다. 또는, 사용자의 본체를 결합하여 이용할 수도 있다. 제1 지지부(120-1_의 힌지부는 스텝 모터를 채용하여, 자동으로 제1 지지프레임과 제2 지지프레임이 임의 의 각도를 형성할 수도 있다. 이와 같이, 각도가 임의로 자동 조절되는 경우, 본체는 중력 방향 또는 중력 반대 방향으로 움직일 수 있어, 영상제공장치는 자동으로 사용자에게 착용 또는 착용 해제 가능할 수 있다. 영상제공장치는 본체에 전원을 공급하는 전원공급부를 더 포함할 수 있다. 이 때, 전원공급부는, 소정 높이로 형성된 제2 지지부 내부의 공간에 수납될 수 있다. 한편, 전원공급부는, 제1 지지부(120-1) 상에 탈/부착되는 형태로 구현될 수 있다. 전원공급부는 전원 공급을 위한 라인을 포함하고, 상기 라인은 본체와 연결될 수 있다. 따라서, 제1 지지 부(120-1)의 내측에는 전원공급부를 통해 전원을 공급하기 위한 전원라인을 수용할 수 있는 형상으로 구현될 수 있다. 다시 말해, 제1 지지부(120-1)의 내측에는 소정 높이의 홈이 구비되어, 해당 홈을 통해 전원 라인이 배치 될 수 있다. 따라서, 전원 라인이 외부로 노출되지 않게 되어, 전원 라인이 끊어져 전원이 공급되지 않아 발생 할 수 있는 가능성을 낮출 수 있다. 도 4는, 전술한 도 3과 달리, 제1 지지부(120-2)의 구성이 상이할 수 있다. 따라서, 본체와 제2 지지부 에 대한 설명은 전술한 내용을 참조하고, 중복 설명은 생략한다. 도 3에서 영상제공장치는 힌지 방식으로 제1 지지부(120-1)를 구성하였으나, 이 경우 힌지를 통해 구현 가 능한 각도의 한계와 본체의 자연스러운 움직임에 제한이 있을 수도 있다.따라서, 도 4에서는 본체의 보다 자연스러운 움직임과 더 넓은 범위의 움직임 허용 각도를 구현하고자, 볼-수용 체 방식을 이용할 수 있다. 도 4에서, 제1 지지부(120-2)의 일 영역에 볼-수용체 결합구성이 배치될 수 있다. 한편, 도 4에서, 본체와 결합되는 제1 지지부(120-2)의 일단과 제2 지지부와 결합되는 제1 지지부 (120-2)의 타단 중 적어도 하나에도 볼-수용체 결합구성(예를 들어, 133)이 이용될 수 있다. 이를 통해 더욱 넓 은 범위의 각도에 따른 움직임이 보장될 수 있다. 또한, 볼-수용체 결합 구성의 특성상, 본체의 보다 부드 러운 움직임도 보장될 수 있다. 다만, 도 3의 힌지 방식과 달리, 도 4의 볼-수용체 방식의 경우에는 본체의 중력방향으로의 부드러운 움직 임이 보장되되, 역으로 본체의 하중을 분산하거나 제대로 지지하지 못할 수도 있다. 따라서, 도 4의 볼-수용체 결합 구성 역시, 움직임을 고정할 수 있는 고정수단이 더 포함될 수 있다. 도 6에서는 환자가 누운 상태에서 본 개시에 따른 영상제공장치를 착용하고 있는 수술실의 전경이 도시되었 다. 이 경우, 의료기관은 단말기(300-1, 300-2)를 이용하여 각종 정보를 확인할 수 있다. 이하에서는 전술한 본 개시에 따른 영상제공장치의 동작 방법에 대해 상세하게 설명한다. 이 때, 영상제공 장치의 동작 방법은, 수술실에서 수술 전동작과 수술 중 동작 방법으로 구분하여 설명한다. 먼저, 본 개시에 따른 영상제공장치의 수술 전 동작에 대해 설명하면, 다음과 같다. 도 7은 본 개시의 일실시예에 따른 영상제공장치에서 수술 전 미리 컨텐트를 선별하는 방법을 설명하기 위 해 도시한 도면이고, 도 8은 도 7에 관한 순서도이다. 본 개시의 일실시예에 따른 누운 자세에서 착용 가능한 영상제공장치는 예를 들어, 센서부를 통해 사 용자의 영상제공장치 착용이 감지되면 컨텐트를 제공하는 프로세서, 예를 들어 제어부를 포함할 수 있 다. 한편, 이 경우 제어부는 사용자를 확인하고, 확인된 사용자에 대해 미리 저장된 컨텐트 정보를 메모리 로부터 호출할 수 있다. 이후, 제어부는, 사용자의 생체 정보를 획득하여, 획득한 사용자의 생체 정보와 기호출한 컨텐트 정보를 참고하여, 영상제공장치를 통해 사용자에게 컨텐트를 제공할 수 있다. 이와 같은 동작을 하기에 앞서, 제어부는 예를 들어, 미리 사용자의 상태 등을 파악하여 수술술에서 적절 한 컨텐트가 영상제공장치를 통해 제공하도록 할 수 있다. 이를 위해, 제어부는 수술실 진입 전 또는 수술 시행 전에 미리 사용자에 대한 컨텐트 적합도 테스트 등을 수행할 수 있다. 도 7 및 8을 참조하면, 제어부는 미리 사용자 및 상기 사용자의 수술 정보를 획득할 수 있다(S110). 제어부는 획득한 사용자 및 사용자의 수술 정보에 기초하여 제공할 컨텐트 후보를 선별할 수 있다(S120). 제어부는 선별된 컨텐트를 영상제공장치를 통해 사용자에게 제공할 수 있다(S130). 본 개시에서 제공되는 컨텐트는, 예를 들어 수술실로 진입할 사용자, 즉 환자에게 적합한 컨텐트인 것이 바람직 하다. 또한, 본 개시에서 제공되는 컨텐트는 수술에 참여하는 의료기관, 의료기관의 수, 수술 시간, 수술 종류 등에 따라 적합한 컨텐트일 수도 있다. 도 7을 참고하면, 영상제공장치는 가상의 화면을 통해 사용자에게 다양한 컨텐트를 제공할 수 있다. 이 때, 영상제공장치는 제공된 컨텐트에 대한 사용자의 반응 내지 피드백 등을 참고하여, 해당 컨텐트를 수술실에 서 제공할 후보 컨텐트로 분류하고, 사용자 정보에 맵핑할 수 있다. 이렇게 맵핑된 컨텐트에 대한 정보는 해당 사용자가 수술실에 진입하는 경우, 호출되어 이용될 수 있다. 도 7에서, 각 컨텐트는 예를 들어, 특정 카테고리의 컨텐트를 대표하는 컨텐트일 수도 있다. 예를 들어, 도 7에 서, 컨텐트A는 드라마, 컨텐트B는 스포츠, 컨텐트C는 음악, 컨텐트D는 자연에 대한 영상 등을 나타낼 수 있다. 따라서, 이 경우, 특정 컨텐트가 선택되면, 선택된 컨텐트에 미리 서브 컨텐트로 등록된 컨텐트에 대한 리스트 가 제공될 수 있다. 이와 같이, 제어부는 컨텐트를 계층 구조로 구성한 후, 사용자의 선택에 따라 디테일 하게 분류하고 제공하여, 사용자의 선호도나 수술의 성격에 맞게 사용자의 심리 안정 등에 기여할 수 있도록 제어할 수 있다. 한편, 도 7에서, 각 컨텐트는 예를 들어, 컨텐트 소스(source)를 대표하는 컨텐트일 수 있다. 예를 들어, 도 7 에서, 컨텐트A는 특정 OTT 업체에 의해 제공되는 OTT 컨텐트, 컨텐트B는 의료기관의 서버(예를 들어, 20)에서 제공하는 컨텐트, 컨텐트C는 방송국에서 제공하는 컨텐트 등일 수 있다. 또는, 도 7에서 각 컨텐트는 컨텐트의 재생 시간에 관련하여 그를 대표하는 컨텐트일 수 있다. 예를 들어, 도 7 에서 컨텐트A는 총 재생시간이 30분 미만인 컨텐트, 컨텐트B는 총 재생시간이 1시간 미만인 컨텐트 등일 수 있 다. 또한, 도 7에서 각 컨텐트는 컨텐트에 출연하는 배우와 같은 캐릭터에 대한 대표 컨텐트일 수 있다. 예를 들어, 컨텐트A는 사용자가 선호하는 배우 중 배우A가 출연한 컨텐트, 컨텐트B는 사용자가 선호하는 배우 중 배우B가 출연하는 컨텐트 등일 수 있다. 또한, 도 7에서 각 컨텐트는 컨텐트의 해상도, 유행 내지 인기도 등을 대표하는 컨텐트일 수도 있다. 실시예에 따라서, 사용자가 복수의 컨텐트를 동시 선택하거나 조합 선택할 수 있도록 제공하고, 그에 따라 동시 선택된 컨텐트를 동시 제공하거나 조합 선택된 컨텐트를 조합하여 제공할 수도 있다. 여기서, 조합이라 함은, 예를 들어 특정 씬, 특정 배우, 특정 오디오 레벨 이상 등과 같이 임의의 기준에 부합하는 씬들만 조합하여 새 로운 컨텐트를 제작하는 것을 나타낼 수 있다. 실시예에 따라서, 도 8의 과정에서 컨텐트는 미리 서버나 의료기관에 의해 검증된 컨텐트가 이용될 수도 있 다. 즉, 도 7의 컨텐트A, 컨텐트B, 컨텐트C, 컨텐트D 등은 미리 설정된 컨텐트일 수도 있다. 도 7에서, 컨텐트는 예컨대, 수술에 참여하는 의료기관의 선호도나 선택, 수술할 환자의 상태나 선호도, 수술의 종류 내지 타입, 수술 시간 등에 따라 달라질 수 있다. 제어부는 사용자의 생체 정보와 피드백 정보 중 적어도 하나를 획득할 수 있다(S140). 본 개시에서 사용자의 생체 정보에는, 사용자의 뇌파 정보, 안구 움직임 정보(예를 들어, 홍채 열림 정도 정보 등), 심박수 정보, 혈압 정보, 혈류 속도 정보, 눈깜빡임이나 그 횟수나 빈도 등 중 적어도 하나가 포함될 수 있다. 제어부는 획득한 사용자의 생체 정보와 피드백 정보 중 적어도 하나를 분석하고, 분석 결과에 기초하여 수 술실에서 상기 사용자에게 제공할 컨텐트 후보를 선별할 수 있다(S150). 제어부는 선별된 컨텐트 후보에 대한 컨텐트 정보를 메모리에 저장하도록 제어할 수 있다. 다음으로, 도 9와 10에서는 전술한 도 7과 8을 통해 수술 전 수술실에 진입하여 영상제공장치를 통해 사용 자에게 제공할 사전 작업이 완료된 이후에, 수술실에 진입하여 실제 수술에 들어가기 전까지의 영상제공장치 의 동작을 설명한다. 먼저, 도 9를 참조하면, 제어부는 사용자의 영상제공장치 착용을 감지할 수 있다(S210). 제어부는 영상제공장치를 착용한 사용자를 확인하고, 확인된 사용자에 대해 미리 저장된 컨텐트 정보 를 메모리로부터 호출할 수 있다(S220). 제어부는 사용자의 생체 정보를 수신 및 획득할 수 있다(S230). 제어부는 사용자의 생체 정보와 기호출한 컨텐트 정보를 참고하여, 컨텐트를 제공할 수 있다(S240). 도 8에서와 달리, 도 9에서 생체 정보는 전술한 생체 정보와 동일할 수는 있으나, 생체 정보를 분석 내지 판단 하는 기준은 다를 수 있다. 도 10을 참조하여, 보다 구체적으로 도 9의 동작을 설명하면, 다음과 같다. 다만, 도 10은 도 9와는 별도의 과 정일 수도 있다. 제어부는 사용자의 생체 정보를 획득할 수 있다(S310). 제어부는 획득한 사용자의 생체 정보를 분석할 수 있다(S320). 즉, 제어부는 수술실 베드에 누워 영 상제공장치를 착용한 사용자의 현재 상태에 대한 분석을 수행하는 것이다. 이 역시, 미리 저장된 컨텐트 중 에서 현재 사용자의 흥분도와 같은 감정 상태나 피지컬 상태에 맞는 컨텐트를 적절히 제공하기 위함이다. 이 경우, 미리 저장된 컨텐트에 제공 순서가 미리 설정되어 있었다고 하더라도, 생체 정보 기반으로 사용자의 상태와 해당 컨텐트의 제공 순서가 적합하지 않은 것으로 판단된 경우에는, 임의 변경 가능할 수 있다. 제어부는 S320 동작을 통해 분석한 사용자의 생체 정보에 기초하여, 현재 사용자의 상태가 제1 상태에 해 당하는지 판단할 수 있다(S330). 여기서, 제1 상태라 함은 심리가 안정된 상태, 수술을 위한 부분 또는 전신 마 취가 가능한지 판단하기 위한 상태를 나타낼 수 있다. 제어부는 S330 동작에서 판단 결과 만약 사용자의 상태가 제1 상태가 아닌 경우에는 다시 사용자의 생체 정보를 획득할 수 있으나, 반대로 제1 상태인 경우에는 전술한 바와 같이 심리 안정 상태를 나타내거나 마취 시 행을 위한 제1 제어 신호를 생성하고, 이렇게 생성된 제1 제어 신호를 직접 단말기 또는 서버를 거쳐 단말기로 전송할 수 있다(S340). 상기 제1 제어 신호에는 다음 레벨의 컨텐트 제공에 관한 제어 커맨드도 포함될 수 있다. 이와 같이, 마취 과정까지 셋팅이 완료되면, 제어부는 소정 시간이 경과 후, 다음 단계로 사용자의 상태가 제2 상태인지 판단할 수 있다(S350). 여기서, 비록 명시적으로 표시되진 않았지만, 제어부는 S340 동작 이 후에 사용자의 생체 정보를 다시 획득할 수 있다. 또는, 제어부는 이미 S310 동작에서 획득한 사용자의 생 체 정보에 기반하여 제2 상태 여부를 판단할 수도 있다. 제어부는 S350 동작 판단 결과, 만약 사용자의 상태가 제2 상태에 도달한 것으로 판단되면, 제2 제어 신호 를 생성하여 단말기로 전송함으로써, 다음 수술 동작을 수행하도록 가이드할 수 있다(S370). 다음 수술 동 작이란 마취 후 과정 예를 들어, 수술 시작을 나타낼 수 있다. 본 개시에서 수술은 시술도 포함하는 의미일 수 있다. 한편, 제어부는 S350 동작 판단 결과, 만약 사용자의 상태가 제2 상태에 도달하지 못한 것으로 판단된 경 우에는, 이벤트 발생 여부를 판단할 수 있다(S360). 여기서, 이벤트는 예를 들어, 사용자의 수술 가부 결정과 관련된 생체 이벤트 등을 나타낼 수 있다. 예를 들어, 상기 이벤트에는 예를 들어, 심박수가 급격히 떨어지거나 심정지 위험이 있다거나 부정맥이 있다거나 등이 포함될 수 있다. 제어부는 S360 동작 판단 결과 만약, 사용자에게 이벤트가 발생한 것으로 판단되는 경우에는 전술한 도 10 의 전 과정을 리셋하고, 다시 처음부터 동작을 반복 수행할 수 있다. 이러한 반복 수행은 미리 설정된 횟수만큼 시행되고, 사용자의 상태가 위험하다거나 미리 설정된 반복 수행 횟수를 초과하였거나 등과 같은 상황이 발생하 면, 모든 과정이 리셋되고 단말기로 관련 내용을 전송 또는 공유하여, 의료기관의 조치를 요청하거나 관련 알람이 울리도록 제어할 수 있다. 한편, 본 개시에서 기술되는 컨텐트에는, 수술 또는 시술 수행에 적합한 사용자의 상태, 예를 들어 심리 상태를 만들거나 주의가 분산되어 심리 회복을 만들기 위한 컨텐트를 나타낼 수 있다. 이를 위해, 제어부는 예를 들어, 수술/시술을 앞둔 사용자의 심리 안정을 유도하기 위한 컨텐트를 제공하 거나 연계하여 자극이 제공되도록 제어할 수 있다. 본 개시에 따른 컨텐트에는, 영유아기인 사용자가 예를 들어, 치과 시술 수행 등을 하는 경우이면, 그 주의가 분산되도록 사용자가 선호하거나 선호할만한 컨텐트를 제공하여, 집중을 유도하여 심리 안전을 꾀할 수도 있다. 본 개시에 따르면, 제어부는 전술한 동작들을 통해 수술/시술 수행의 최적 시점을 의료기관에게 제공할 수 도 있고, 뇌파 측정 등을 기반으로 마취약 주입의 최적 시점을 판단하여 관련 정보를 제공할 수도 있다. 또한, 컨텐트의 종류나 타입은 매우 다양하여, 사용자가 컨텐트 내의 집중도가 가장 높아지는 시점에 수술/시술 을 수행할 수 있도록 가이드할 수도 있다. 그 밖에, 컨텐트는 사용하는 주제(예를 들어, 외과, 내과, 산부인과 등)에 따라 상이한 컨텐트를 제공할 수도 있고, 사용자의 나이, 성별, 국적 등에 따라 상이한 컨텐트를 제공할 수도 있다. 일 예로, 산부인과에서 산통이 오거나 산기가 있는 환자에게 호흡 유도 컨텐트를 제공할 수도 있다. 한편, 개시된 실시예들은 컴퓨터에 의해 실행 가능한 명령어를 저장하는 기록매체의 형태로 구현될 수 있다. 명 령어는 프로그램 코드의 형태로 저장될 수 있으며, 프로세서에 의해 실행되었을 때, 프로그램 모듈을 생성하여 개시된 실시예들의 동작을 수행할 수 있다. 기록매체는 컴퓨터로 읽을 수 있는 기록매체로 구현될 수 있다. 컴퓨터가 읽을 수 있는 기록매체로는 컴퓨터에 의하여 해독될 수 있는 명령어가 저장된 모든 종류의 기록 매체 를 포함한다. 예를 들어, ROM(Read Only Memory), RAM(Random Access Memory), 자기 테이프, 자기 디스크, 플 래쉬 메모리, 광 데이터 저장장치 등이 있을 수 있다."}
{"patent_id": "10-2023-0151669", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이상에서와 같이 첨부된 도면을 참조하여 개시된 실시예들을 설명하였다. 본 개시가 속하는 기술분야에서 통상 의 지식을 가진 자는 본 개시의 기술적 사상이나 필수적인 특징을 변경하지 않고도, 개시된 실시예들과 다른 형 태로 본 개시가 실시될 수 있음을 이해할 것이다. 개시된 실시예들은 예시적인 것이며, 한정적으로 해석되어서 는 안 된다."}
{"patent_id": "10-2023-0151669", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일실시예에 따른 영상제공시스템의 개략도이다. 도 2는 도 1에서 영상제공장치의 구성 블록도이다.도 3 내지 4는 도 1의 영상제공장치의 사시도를 도시한 도면이다. 도 5는 도 1의 영상제공장치에서 본체를 설명하기 위해 도시한 도면이다. 도 6은 도 1의 영상제공시스템의 환경을 설명하기 위해 도시한 도면이다. 도 7은 본 개시의 일실시예에 따른 제1 상황에서 영상제공장치의 동작을 설명하기 위해 도시한 도면이다. 도 8은 도 7에 관한 순서도이다. 도 9와 10은 본 개시의 일실시예에 따른 제2 상황에서의 영상제공장치의 동작을 설명하기 위한 순서도이다. 도 11은 도 1의 영상제공장치에 의해 사용자에게 제공되는 화면을 설명하기 위해 도시한 도면이다."}
