{"patent_id": "10-2022-0121453", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0042769", "출원번호": "10-2022-0121453", "발명의 명칭": "자율 주행 장치의 자동화된 학습을 위한 방법 및 장치", "출원인": "포티투닷 주식회사", "발명자": "조훈경"}}
{"patent_id": "10-2022-0121453", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "자율 주행 장치를 자동으로 학습시키는 방법으로서,수집된 데이터에 기초하여 환경 정보를 결정하는 단계;모션 계획(motion planning) 알고리즘을 이용하여, 상기 결정된 환경 정보에 기초하여 제1 모션 계획을 결정하는 단계;상기 제1 모션 계획에 기초하여 레이블링된 데이터를 생성하는 단계; 및상기 레이블링된 데이터에 기초하여 모션 계획 모델을 학습시키는 단계;를 포함하는,방법."}
{"patent_id": "10-2022-0121453", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 모션 계획 모델을 학습시키는 단계는,상기 결정된 환경 정보를 상기 모션 계획 모델의 입력 데이터로 입력하는 단계; 상기 모션 계획 모델이 출력하는 제2 모션 계획을 획득하는 단계; 및상기 제2 모션 계획 및 상기 레이블링된 데이터에 기초하여 모션 계획 모델의 파라미터를 조정하는 단계;를 포함하는,방법."}
{"patent_id": "10-2022-0121453", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서,상기 파라미터를 조정하는 단계는,상기 제2 모션 계획 및 상기 레이블링된 데이터 사이의 손실을 계산하는 단계; 및상기 손실이 최소화되도록 상기 모션 계획 모델의 파라미터를 조정하는 단계;를 포함하는,방법."}
{"patent_id": "10-2022-0121453", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1 항에 있어서,상기 모션 계획 알고리즘을 상기 모션 계획 모델로 대체하는 단계;를 더 포함하는,공개특허 10-2024-0042769-3-방법."}
{"patent_id": "10-2022-0121453", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1 항에 있어서,상기 결정된 제1 모션 계획에 기초하여 상기 차량의 주행을 제어하는 단계;를 더 포함하는,방법."}
{"patent_id": "10-2022-0121453", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1 항에 있어서,상기 수집된 데이터는,라이더(Lidar) 센서에 의해 수집되는 데이터, 레이더(Radar) 센서에 의해 수집되는 데이터, 카메라에 의해 수집되는 데이터 및 상기 차량에 장착된 차체 센서에 의해 수집되는 데이터를 포함하는,방법."}
{"patent_id": "10-2022-0121453", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1 항에 있어서,상기 환경 정보는,객체의 클래스, 객체의 속성, 객체의 위치, 객체의 속도, 객체의 가속도, 객체의 크기 및 객체의 추적 정보를포함하는,방법."}
{"patent_id": "10-2022-0121453", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1 항에 있어서,상기 제1 모션 계획은 주행 모드(driving mode), 타겟 상태(target state) 및 안전 범위(safety envelope)를포함하는,방법."}
{"patent_id": "10-2022-0121453", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "자율 주행 장치의 자동화된 학습을 위한 장치에 있어서,적어도 하나의 프로그램이 저장된 메모리; 및상기 적어도 하나의 프로그램을 실행함으로써 동작하는 프로세서;를 포함하되,상기 프로세서는,수집된 데이터에 기초하여 환경 정보를 결정하고,모션 계획 알고리즘을 이용하여, 상기 결정된 환경 정보에 기초하여 제1 모션 계획을 결정하며,공개특허 10-2024-0042769-4-상기 제1 모션 계획에 기초하여 레이블링된 데이터를 생성하고,상기 레이블링된 데이터에 기초하여 모션 계획 모델을 학습시키는,장치."}
{"patent_id": "10-2022-0121453", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1 항에 따른 방법을 컴퓨터에서 실행시키기 위한 프로그램을 기록한 컴퓨터로 읽을 수 있는 기록 매체."}
{"patent_id": "10-2022-0121453", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 자율 주행 장치를 자동으로 학습시키는 방법 및 장치에 관한 것이다. 본 개시의 일 실시예에 따른 자 율 주행 장치를 자동으로 학습시키는 방법은, 수집된 데이터에 기초하여 환경 정보를 결정하고, 모션 계획 (motion planning) 알고리즘을 이용하여, 상기 결정된 환경 정보에 기초하여 제1 모션 계획을 결정하며, 상기 제 1 모션 계획에 기초하여 레이블링된 데이터를 생성하고, 상기 레이블링된 데이터에 기초하여 모션 계획 모델을 학습시킬 수 있다."}
{"patent_id": "10-2022-0121453", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 자율 주행 장치의 자동화된 학습을 위한 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2022-0121453", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공지능(AI)은 인간의 학습능력, 추론능력 등을 컴퓨터 프로그램을 이용하여 인공적으로 구현하는 기술을 의 미한다. 인공지능과 관련하여, 기계 학습은 다수의 파라미터로 구성된 모델을 이용하여 주어진 데이터로 파라미 터를 최적화하는 학습을 의미한다. 자율 주행 기술에서 인공지능 모델은 핵심적인 기술로서, 특히 다양한 센서에 의해 취득된 데이터에 기초하여 주변의 객체를 검출하고 이를 바탕으로 차량의 제어를 수행하는 데 인공지능 모델이 사용될 수 있다. 한편, 학습을 통해 인공지능 모델의 다양한 능력을 향상시키기 위해서는 충분한 데이터를 필요로 하는데, 학습 용 데이터를 구비하기 위해 사람이 개입해야 하는 수동 어노테이션 도구를 사용하여 레이블링된 데이터를 생성 하고 있어, 상당한 인적 자원과 시간적 자원이 소모되는 실정이다."}
{"patent_id": "10-2022-0121453", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시의 목적은 자율 주행 장치의 자동화된 학습을 위한 방법 및 장치를 제공하는 데 있다. 본 개시가 해결하 고자 하는 과제는 이상에서 언급한 과제에 한정되지 않으며, 언급되지 않은 본 개시의 다른 과제 및 장점들은 하기의 설명에 의해서 이해될 수 있고, 본 개시의 실시예에 의해 보다 분명하게 이해될 것이다. 또한, 본 개시 가 해결하고자 하는 과제 및 장점들은 특허 청구범위에 나타난 수단 및 그 조합에 의해 실현될 수 있음을 알 수 있을 것이다."}
{"patent_id": "10-2022-0121453", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 제1 측면은, 수집된 데이터에 기초하여 환경 정보를 결정하는 단계; 모션 계획(motion planning) 알 고리즘을 이용하여, 상기 결정된 환경 정보에 기초하여 제1 모션 계획을 결정하는 단계; 상기 제1 모션 계획에 기초하여 레이블링된 데이터를 생성하는 단계; 및 상기 레이블링된 데이터에 기초하여 모션 계획 모델을 학습시 키는 단계;를 포함하는 자율 주행 장치를 자동으로 학습시키는 방법을 제공할 수 있다. 본 개시의 제2 측면은, 적어도 하나의 프로그램이 저장된 메모리; 및 상기 적어도 하나의 프로그램을 실행함으 로써 동작하는 프로세서;를 포함하되, 상기 프로세서는, 수집된 데이터에 기초하여 환경 정보를 결정하고, 모션 계획 알고리즘을 이용하여, 상기 결정된 환경 정보에 기초하여 제1 모션 계획을 결정하며, 상기 제1 모션 계획 에 기초하여 레이블링된 데이터를 생성하고, 상기 레이블링된 데이터에 기초하여 모션 계획 모델을 학습시키는 장치를 제공할 수 있다. 본 개시의 제3 측면은, 제1 측면에 따른 방법을 컴퓨터에서 실행시키기 위한 프로그램을 기록한 컴퓨터로 읽을 수 있는 기록 매체를 제공할 수 있다."}
{"patent_id": "10-2022-0121453", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따르면, 자율 주행 장치가 자동화된 과정을 통해 지속적으로 성능이 개선될 수 있다. 또한, 사람이 직접 설계하여야 하는 모션 계획 알고리즘을 자동화된 과정을 통해 지속적으로 성능이 개선되는 인공지능 모델로 대체할 수 있다. 또한, 정답이 없다고 볼 수 있는 모션 계획 결정을 스스로 발전하는 인공지능 모델이 수행하도록 하여, 알고리 즘 개발 비용을 감소시킬 수 있다."}
{"patent_id": "10-2022-0121453", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 설명되는 실시예들 을 참조하면 명확해질 것이다. 그러나 본 발명은 아래에서 제시되는 실시예들로 한정되는 것이 아니라, 서로 다 른 다양한 형태로 구현될 수 있고, 본 발명의 사상 및 기술 범위에 포함되는 모든 변환, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 아래에 제시되는 실시예들은 본 발명의 개시가 완전하도록 하며, 본 발명이"}
{"patent_id": "10-2022-0121453", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "속하는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이다. 본 발명을 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 본 출원에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함 하다\" 또는 \"가지다\" 등의 용어는 명세서 상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조 합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 개시의 일부 실시예는 기능적인 블록 구성들 및 다양한 처리 단계들로 나타내어질 수 있다. 이러한 기능 블 록들의 일부 또는 전부는, 특정 기능들을 실행하는 다양한 개수의 하드웨어 및/또는 소프트웨어 구성들로 구현 될 수 있다. 예를 들어, 본 개시의 기능 블록들은 하나 이상의 마이크로프로세서들에 의해 구현되거나, 소정의 기능을 위한 회로 구성들에 의해 구현될 수 있다. 또한, 예를 들어, 본 개시의 기능 블록들은 다양한 프로그래 밍 또는 스크립팅 언어로 구현될 수 있다. 기능 블록들은 하나 이상의 프로세서들에서 실행되는 알고리즘으로 구현될 수 있다. 또한, 본 개시는 전자적인 환경 설정, 신호 처리, 및/또는 데이터 처리 등을 위하여 종래 기 술을 채용할 수 있다.\"매커니즘\", \"요소\", \"수단\" 및 \"구성\"등과 같은 용어는 넓게 사용될 수 있으며, 기계적이 고 물리적인 구성들로서 한정되는 것은 아니다. 또한, 도면에 도시된 구성 요소들 간의 연결 선 또는 연결 부재들은 기능적인 연결 및/또는 물리적 또는 회로적 연결들을 예시적으로 나타낸 것일 뿐이다. 실제 장치에서는 대체 가능하거나 추가된 다양한 기능적인 연결, 물 리적인 연결, 또는 회로 연결들에 의해 구성 요소들 간의 연결이 나타내어질 수 있다. 이하에서, '차량'은 자동차, 버스, 오토바이, 킥보드 또는 트럭과 같이 기관을 가지고 사람이나 물건을 이동시 키기 위해 이용되는 모든 종류의 운송 수단을 의미할 수 있다. 이하 첨부된 도면을 참고하여 본 개시를 상세히 설명하기로 한다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 자율 주행 장치는, 차량에 장착되어 자율 주행 차량을 구현 할 수 있다. 자율 주행 차량에 장착되는 자율 주행 장치는, 주변의 상황 정보를 수집하기 위한 다양한 센서 (카메라를 포함함)들을 포함할 수 있다. 일례로, 자율 주행 장치는 자율 주행 차량의 전면에 장착된 이미지센서 및/또는 이벤트 센서를 통해, 전방에서 운행 중인 선행 차량의 움직임을 감지할 수 있다. 자율 주행 장치는 자율 주행 차량의 전방은 물론, 옆 차로 또는 후방에서 운행중인 다른 주행 차량과, 자율 주행 차량 주변의 보행자 등을 감지하기 위한 센서들을 더 포함할 수 있다. 자율 주행 차량 주변의 상황 정보를 수집하기 위한 센서들 중 적어도 하나는, 도 1에 도시한 바와 같이 소정의 화각(FoV)을 가질 수 있다. 일례로, 자율 주행 차량의 전면에 장착된 센서가 도 1에 도시한 바와 같은 화각 (FoV)을 갖는 경우에, 센서의 중앙에서 검출되는 정보가 상대적으로 높은 중요도를 가질 수 있다. 이는, 센서의 중앙에서 검출되는 정보에, 선행 차량의 움직임에 대응하는 정보가 대부분 포함되어 있기 때문일 수 있다. 자율 주행 장치는, 자율 주행 차량의 센서들이 수집한 정보를 실시간으로 처리하여 자율 주행 차량의 움직임을 제어하는 한편, 센서들이 수집한 정보 중에 적어도 일부는 메모리 장치에 저장할 수 있다. 도 2를 참조하면, 자율 주행 장치는 센서부, 프로세서, 메모리 시스템, 및 차체 제어 모듈 등을 포함할 수 있다. 센서부는 복수의 센서(카메라를 포함함)(42-45)를 포함하며, 복수의 센서들(42-45)은 이미지 센서, 이벤트 센서, 조도 센서, GPS 장치, 가속도 센서, 레이더, 라이다, 초음파 센서 등을 포함할 수 있다. 센서들(42-45)이 수집한 데이터는 프로세서로 전달될 수 있다. 프로세서는 센서들(42-45)이 수집한 데 이터를 메모리 시스템에 저장하고, 센서들(42-45)이 수집한 데이터에 기초하여 차체 제어 모듈을 제어 하여 차량의 움직임을 결정할 수 있다. 메모리 시스템은 둘 이상의 메모리 장치들과, 메모리 장치들을 제어 하기 위한 시스템 컨트롤러를 포함할 수 있다. 메모리 장치들 각각은 하나의 반도체 칩으로 제공될 수 있다. 메모리 시스템의 시스템 컨트롤러 외에, 메모리 시스템에 포함되는 메모리 장치들 각각은 메모리 컨트 롤러를 포함할 수 있으며, 메모리 컨트롤러는 신경망과 같은 인공지능(AI) 연산 회로를 포함할 수 있다. 메모리 컨트롤러는 센서들(42-45) 또는 프로세서로부터 수신한 데이터에 소정의 가중치를 부여하여 연산 데이터를 생성하고, 연산 데이터를 메모리 칩에 저장할 수 있다. 도 3은 자율 주행 장치가 탑재된 자율 주행 차량의 센서(카메라를 포함함)가 획득한 영상 데이터의 예시를 나타 낸 도면이다. 도 3을 참조하면, 영상 데이터는 자율 주행 차량의 전면에 장착된 센서가 획득한 데이터일 수 있다. 따라서 영상 데이터에는 자율 주행 차량의 전면부, 자율 주행 차량과 같은 차로의 선행 차량 , 자율 주행 차량 주변의 주행 차량 및 배경 등이 포함될 수 있다. 도 3에 도시한 실시예에 따른 영상 데이터에서, 자율 주행 차량의 전면부와 배경이 나타나는 영역 의 데이터는 자율 주행 차량의 운행에 영향을 미칠 가능성이 거의 없는 데이터일 수 있다. 다시 말해, 자율 주 행 차량의 전면부와 배경은 상대적으로 낮은 중요도를 갖는 데이터로 간주될 수 있다. 반면, 선행 차량과의 거리, 및 주행 차량의 차로 변경 움직임 등은 자율 주행 차량의 안전한 운행에 있 어서 매우 중요한 요소일 수 있다. 따라서, 영상 데이터에서 선행 차량 및 주행 차량 등이 포함되 는 영역의 데이터는 자율 주행 차량의 운행에 있어서 상대적으로 높은 중요도를 가질 수 있다. 자율 주행 장치의 메모리 장치는, 센서로부터 수신한 영상 데이터의 영역별로 가중치를 다르게 부여하여 저 장할 수 있다. 일례로, 선행 차량과 주행 차량 등이 포함되는 영역의 데이터에는 높은 가중치를 부여하 고, 자율 주행 차량의 전면부와 배경이 나타나는 영역의 데이터에는 낮은 가중치를 부여할 수 있다. 이하에서, 다양한 실시예에 따른 동작들은 자율 주행 장치 또는 자율 주행 장치에 포함된 프로세서에 의해 수행 되는 것으로 이해될 수 있다. 도 4는 자율 주행 장치에 포함된 인공지능 모델을 통한 어노테이션 작업 과정을 설명하기 위한 간략한 도면이다. 도 4를 참조하면, 미가공 데이터(raw data)는 인공지능 모델에 입력될 수 있다. 미가공 데이터는 차 량에 탑재된 다양한 센서에 의해 수집된 데이터를 포함할 수 있다. 도 4에서, 미가공 데이터는 레이블링 데이터로 변환되기 전의 데이터를 의미하는 것으로서, 수집된 데이터가 인공지능 모델에 입력되기 위해 전처리 과정을 거친 데이터를 포함할 수 있다. 인공지능 모델은 입력 받은 미가공 데이터에 기초하여 레이블링 데이터를 생성할 수 있다. 도 4를 참조하면, 인공지능 모델은 입력 받은 미가공 데이터에 기초하여 초벌 레이블링된 데이터 (preliminary labeled data)를 출력할 수 있다. 초벌 레이블링된 데이터는 인공지능 모델이 미가공데이터에 포함된 객체를 검출하고, 객체의 종류, 객체의 위치, 객체의 속도, 객체의 가속도, 객체의 추적 정보(과거 이동 궤적) 등을 레이블링하여 출력한 데이터를 의미할 수 있다. 인공지능 모델은, 도 4에 도시된 과 정에서, 자동 레이블링(auto labeling) 작업을 수행하는 역할을 한다. 초벌 레이블링된 데이터는 인공지능 모델에 결정에 따른 데이터인 바, 잘못 레이블링 될 수 있다. 도 4를 참조하면, 사람은 초벌 레이블링된 데이터를 직접 눈으로 확인하고, 초벌 레이블링된 데이터에 보정 (correction)이 필요한 경우, 초벌 레이블링된 데이터에 보정 작업을 수행할 수 있다. 보정 작업이 수행된 초벌 레이블링된 데이터는 보정된 레이블링된 데이터로 지칭될 수 있다. 도 4를 참조하면, 보정된 레이블링 데이터는 인공지능 모델의 학습에 사용될 수 있다. 인공지능 모델은 다 수의 파라미터를 포함할 수 있고, 올바른 레이블링 작업을 수행할 수 있도록 파라미터를 최적화하는 것을 인공 지능 모델의 학습이라고 지칭할 수 있다. 한편, 초벌 레이블링된 데이터가 잘못 레이블링된 것이 아닌 경우, 초벌 레이블링된 데이터는 레이블 링된 데이터로 간주될 수 있다. 이와 같이, 일반적으로 인공지능 모델은 입력된 센서 데이터 등에 대하여 레이블링 작업을 수행하여 환경 정보 (environment representation)를 획득하는 데 사용될 수 있으며, 종래의 기술은 정확하고 효율적으로 환경 정보 를 획득하는 것에 초점을 두고 있다. 전술한 검출된 객체, 객체의 종류, 객체의 위치, 객체의 속도, 객체의 가 속도, 객체의 크기, 추적 정보(과거 이동 궤적) 등이 환경 정보에 포함될 수 있다. 본 개시에서는, 입력된 센서 데이터에 대해 레이블링 작업을 수행하여 환경 정보를 출력하는 것이 아닌, 환경 정보에 대해 레이블링 작업을 수행하여 모션 계획(motion planning)을 출력하도록 자율 주행 장치를 학습시키는 방법이 개시된다. 본 개시의 다양한 실시예에 따른 자율 주행 장치의 자동화된 학습을 위한 장치는 자율 주행 장치와 실질적으로 동일하거나, 자율 주행 장치에 포함되거나 또는 자율 주행 장치가 수행하는 기능의 일부로 구현되는 구성요소일 수 있다. 본 개시의 자율 주행 장치를 자동으로 학습시키는 장치는 수집된 데이터에 기초하여 환경 정보를 결정할 수 있 다. 본 개시의 자율 주행 장치를 자동으로 학습시키는 장치는 모션 계획 알고리즘을 이용하여, 결정된 환경 정 보에 기초하여 모션 계획을 결정할 수 있다. 본 개시의 자율 주행 장치를 자동으로 학습시키는 장치는 모션 계 획에 기초하여 레이블링된 데이터를 생성할 수 있다. 본 개시의 자율 주행 장치를 자동으로 학습시키는 장치는 레이블링된 데이터에 기초하여 모션 계획 모델을 학습시킬 수 있다. 이하에서, 자율 주행 장치를 자동으로 학습 시키는 장치가 수행하는 자율 주행 장치를 자동으로 학습시키는 방법에 관하여 상세히 설명한다. 본 개시에서, 자율 주행 장치의 자동화된 학습을 위한 장치는 미가공 데이터를 수집할 수 있다. 전술한 바와 같이, 미가공 데이터는 레이블링된 데이터로 변환되기 전의 데이터를 의미하는 것으로서, 차량에 탑재된 다양한 센서에 의해 수집된 데이터를 포함할 수 있다. 일 실시예에서, 센서에 의해 수집된 데이터는, 라이다(Lidar) 센서에 의해 수집된 3차원 포인트 클라우드 데이 터, 레이더(Radar) 센서에 의해 수집된 주변 차량, 장애물, 카메라에 의해 수집된 차선, 신호등, 장애물, 보행 자, 움직이는 사물 등에 관한 데이터, 차체 센서에 의해 수집된 차량의 속도, 가속도, 브레이크 압력, 운전대 각도 등 임의의 적합한 데이터를 포함할 수 있다. 본 개시에서, 자율 주행 장치의 자동화된 학습을 위한 장치는 수집된 데이터에 기초하여 환경 정보를 결정할 수 있다. 일 실시예에서, 수집된 데이터에 기초하여 환경 정보를 결정하는 것은, 환경 정보 모델을 통하여 수행될 수 있 다. 환경 정보 모델은 인공지능 모델을 포함할 수 있다. 일 실시예에서, 환경 정보를 결정하는 것은 객체를 검출하는 것을 포함할 수 있다. 일 실시예에서, 환경 정보는 객체의 클래스를 포함할 수 있다. 다시 말해, 자율 주행 장치의 자동화된 학습을 위한 장치는 검출된 객체를 복수의 클래스 중 어느 하나에 해당하는 것으로 분류할 수 있다. 복수의 클래스의 예시는 아래의 표 1을 통해 설명될 수 있다. 표 1"}
{"patent_id": "10-2022-0121453", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "표 1의 복수의 클래스 중 승용차는 소수의 사람들을 운송하도록 설계된 자동차에 대응될 수 있다. 예를 들어, 세단, SUV, 택시 등이 승용차로 분류될 수 있다. 표 1의 복수의 클래스 중 승합차는 다수의 사람들을 운송하도록 설계된 자동차에 대응될 수 있다. 예를 들어, 16인승 이상의 승합차, 버스 등이 승합차로 분류될 수 있다. 표 1의 복수의 클래스 중 트럭은 화물을 운반하도록 설계된 자동차에 대응될 수 있다. 화물을 운반하도록 설계 된 자동차에 중장비 차량을 포함한 다른 차량이 적재된 경우, 화물을 운반하도록 설계된 자동차와 그 다른 차량 을 하나의 자동차로 보고 트럭으로 분류될 수 있다. 표 1의 복수의 클래스 중 이륜차는 두 바퀴로 달리는 기구 및 이를 탑승하고 있는 사람에 대응될 수 있다. 예를 들어, 오토바이(motorcycle), 킥보드(scooter), moped, 자전거(bicycle), 세그웨이(segway) 등이 인류차로 분 류될 수 있다. 유모차(stroller), 손수레(hand truck) 또한 이륜차로 분류될 수 있다. 표 1의 복수의 클래스 중 보행자는 도보로 통행하는 사람에 대응될 수 있다. 표 1의 복수의 클래스 중 긴급차는 특수 목적으로 설계된 차량으로서 긴급한 상황에서 사용되는 차량에 대응될 수 있다. 예를 들어, 경찰차, 소방차, 견인차 등과 같이 사이렌이 탑재된 차량이 긴급차로 분류될 수 있다. 예 를 들어, 암행 순찰차와 같이, 다른 클래스로 분류될 수 있는 차량이 사이렌을 탑재하는 경우, 사이렌이 작동하 는 경우에만 긴급차로 분류될 수 있다. 표 1의 복수의 클래스 중 기타는 나머지 클래스로 분류되지 않는 차량에 대응될 수 있다. 예를 들어, 삼륜차, 지게차, 굴착기, 인력거, 제설차, 불도저, 도로포장용 롤러 등이 기타로 분류될 수 있다. 다만, 위 표 1은 예시로서 제공되며, 임의의 적합한 분류 방식이 적용될 수 있다. 일 실시예에서, 환경 정보는 객체의 속성을 포함할 수 있다. 다시 말해, 자율 주행 장치의 자동화된 학습을 위 한 장치는 검출된 객체를 복수의 클래스 중 어느 하나에 해당하는 것으로 분류할 수 있다. 객체의 속성의 예시 는 아래의 표 2를 통해 설명될 수 있다. 표 2"}
{"patent_id": "10-2022-0121453", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "일 실시예에서, 객체의 속성은 객체의 보이는 정도를 포함할 수 있다. 본 개시에서, 보이는 정도는 객체 전체를 기준으로 영상 데이터에서 객체가 보이는 부분의 비율과 관련된 속성을 지칭할 수 있다. 일 실시예에서, 객체의 속성은 객체의 이동 상태를 포함할 수 있다. 본 개시에서, 이동 상태는 객체의 이동과 관련된 속성을 지칭할 수 있다. 일 실시예에서, 객체의 속성은 차선 위치를 포함할 수 있다. 본 개시에서, 차선 위치는 자차량과의 위치 관계에 관한 정보 또는 속성을 지칭할 수 있다. 일 실시예에서, 객체의 속성은 객체의 주요 상태를 포함할 수 있다. 본 개시에서, 주요 상태는 자차량의 주행에 영향을 주는지에 관한 속성을 지칭할 수 있다. 일 실시예에서, 객체의 속성은 객체의 크기를 포함할 수 있다. 일 실시예에서, 객체의 속성은 객체의 서브 클래스를 포함할 수 있다. 본 개시에서, 객체의 서브 클래스는 객체 의 클래스에 포함되는 하위 클래스로서, 특정 클래스를 세분화하여 구분하기 위한 속성을 지칭할 수 있다. 다만, 위 표 2는 예시로서 제공되며, 임의의 적합한 객체의 속성이 부여될 수 있다. 일 실시예에서, 환경 정보는 객체의 위치를 포함할 수 있다. 예를 들어, 카메라 등의 다양한 센서에 의해 수집 된 데이터에 기초하여 객체의 위치 정보를 획득할 수 있는 임의의 적합한 기술이 적용될 수 있다. 일 실시예에서, 환경 정보는 객체의 속도를 포함할 수 있다. 예를 들어, 카메라 등의 다양한 센서에 의해서 수 집된 데이터에 기초하여 객체의 속도 정보를 획득할 수 있는 임의의 적합한 기술이 적용될 수 있다. 일 실시예에서, 환경 정보는 객체의 예상 이동 방향, 특정 시간에서의 예상되는 위치 등을 포함할 수 있다. 예 를 들어, 객체의 속도, 객체의 위치 등 객체에 관한 정보를 조합하여 객체의 예상 이동 방향, 특정 시간에서의 예상되는 위치 등이 획득될 수 있다. 일 실시예에서, 환경 정보는 자차량의 목적지를 향한 경로에 대응한 자차량의 위치일 수 있다. 예를 들어, 환경 정보는 우회전을 해야 하는 교차로까지 남은 자차량으로부터의 거리일 수 있다. 본 개시에서, 자율 주행 장치의 자동화된 학습을 위한 장치는 모션 계획(motion planning) 알고리즘을 이용하여, 결정된 환경 정보에 기초하여 차량의 모션 계획을 결정할 수 있다. 도 5는 본 개시의 일 실시예에 따른 자율 주행 제어 과정을 설명하기 위한 간략한 도면이다. 본 개시에서, 자율 주행 장치(또는 자율 주행 장치의 자동화된 학습을 위한 장치)는 환경 정보 추출 모델, 모션 계획 알고리즘 및 차량 제어 알고리즘을 포함할 수 있다. 본 개시에서, 모션 계획 알고리즘은 주어진 환경 정보에 기초하여 차량을 어떻게 제어할 것인지 결정할 수 있는 알고리즘을 지칭한다. 모션 계획 알고리즘은 반드시 인공지능 모델을 포함할 필요는 없으나, 인공지 능 모델을 포함할 수도 있다. 모션 계획 알고리즘은 주어진 환경 정보에 적합하게 대응하여 차량의 주행을 제어하기 위한 정보를 출력할 수 있도록 설계될 수 있다. 따라서, 도 5에 도시된 바와 같이, 모션 계획 알고리즘은 환경 정보 추출 모델 에 의해 결정된 환경 정보를 입력 데이터로 하여 모션 계획을 출력할 수 있다. 모션 계획 알고리즘이 출력하는 데이터인 모션 계획은 차량의 동작과 연관된 다양한 정보를 포함할 수 있 다. 모션 계획은 크게 경로 계획(path planning) 및 속도 계획(speed planning)을 포함할 수 있다. 즉 차량의 주행을 제어함에 있어, 모션 계획에 포함된 경로 계획 및 속도 계획이 반영될 수 있다. 예를 들어, 모션 계획 알고리즘은 환경 정보에 포함된 도로 표지판, 교통 법규, 규정 속도 등에 기초하여 모션 계획을 출력할 수 있다. 예를 들어, 모션 계획 알고리즘은 환경 정보에 포함된 차량에 관한 정보에 기초하여 모션 계획을 출력할 수 있다. 예를 들어, 모션 계획 알고리즘은 승차감, 도로의 커브 등에 기초 하여 모션 계획을 출력할 수 있다. 일 실시예에서, 모션 계획은 목표 속도, 가속도 및 주행 차선을 포함할 수 있다. 예를 들어, 교통 법규 또는 도 로 규정에 따라 목표 속도를 변경하는 모션 계획이 출력될 수 있다. 예를 들어, 전방 차량의 속도 또는 주변 차 량의 존재 여부에 따라 추월 주행하기 위한 가속도 및 주행 차선을 변경하는 모션 계획이 출력될 수 있다. 일 실시예에서, 모션 계획은 주행 모드(driving mode), 타겟 상태(target state) 및 안전 범위(safety envelope)를 포함할 수 있다. 예를 들어, 주행 모드는 주행 방식과 관계된 것으로서, 차선을 따라 주행할 것인 지, 차선을 변경할 것인지, 전방의 차량을 추월하여 주행할 것인지, 인터체인지의 출구로 주행할 것인지 등과 연관될 수 있다. 예를 들어, 타겟 상태는 자차량의 주변 차량의 상태와 관계된 것으로서, 주변의 차량이 어떤차량인지, 주변의 차량이 자차량에 어떤 영향을 줄 수 있는지 등과 연관될 수 있다. 예를 들어, 구급차가 후방 에 있는 경우, 속도를 줄이고 주행 차선을 조정하는 모션 계획이 출력될 수 있다. 구체적인 예시는 다음과 같을 수 있다. 예를 들어, 환경 정보가 '시속 60km/h 제한 표지판이 검출되는 것'인 것 에 대응하여, 모션 계획은 '5초 안에 차체의 속도를 10km/h 만큼 감소시키는 것'일 수 있다. 예를 들어, 환경 정보가 '우회전을 해야 하는 교차로까지 300m 남았다는 것'인 것에 대응하여, 모션 계획은 '10초안에 우측 첫번 째 차선으로 차선 변경을 해야 하는 것'일 수 있다. 예를 들어, 환경 정보가 '전방 우측에 있는 차량이 자차량 의 전방으로 진입 예정인 것'에 대응하여, 모션 계획은 '자차량의 속도를 일시적으로 5km/h 만큼 감소시켜야 하 는 것'일 수 있다. 이밖에, 모션 계획 알고리즘이 출력하는 데이터인 모션 계획은, 모션 계획 알고리즘의 설계 방식, 차 량 제어 알고리즘의 설계 방식 또는 차량 시스템 등에 따라 적합한 항목을 포함할 수 있다. 본 개시에서, 모션 계획 알고리즘이 출력하는 데이터인 모션 계획은 차량 제어 알고리즘에 입력될 수 있다. 차량 제어 알고리즘은 모션 계획에 기초하여 차체를 제어하기 위한 신호를 생성할 수 있다. 차량 제어 알 고리즘이 출력하는 차체를 제어하기 위한 신호에 의해 차량의 주행이 제어될 수 있다. 도 6은 본 개시의 일 실시예에 따른 모션 계획 모델의 학습 과정을 설명하기 위한 간략한 도면이다. 도 6에서, 모션 계획 알고리즘은 도 5를 참조하여 전술한 모션 계획 알고리즘에 대응할 수 있다. 한편, 본 개시에서, 자율 주행 장치의 자동화된 학습을 위한 장치는 모션 계획 알고리즘이 출력하는 모션 계획에 기초하여 레이블링된 데이터를 생성할 수 있다. 일 실시예에서, 자율 주행 장치의 자동화된 학습을 위한 장치는 모션 계획에 포함된 정보에 대응되도록 레이블 을 구성함으로써 레이블링된 데이터를 생성할 수 있다. 일 실시예에서, 레이블링된 데이터는 추후 모션 계획 모델의 학습을 위해 사용될 수 있다. 이에 따라 자율 주행 장치의 자동화된 학습을 위한 장치가 레이블링된 데이터를 생성하는 것은 모션 계획 모델의 학습을 위한 데이터 입력을 위해 적합한 전처리를 수행하는 것을 포함할 수 있다. 일 실시예에서, 레이블링된 데이터가 사람 또는 레이블 보정(label correction) 장치(또는 알고리즘)를 통 해 보정되는 과정이 더 수행될 수 있다. 본 개시에서, 자율 주행 장치의 자동화된 학습을 위한 장치는 레이블링된 데이터에 기초하여 모션 계획 모 델을 학습시킬 수 있다. 본 개시에서, 모션 계획 모델은, 모션 계획 알고리즘과 마찬가지로, 주어진 환경 정보에 기초하여 차 량을 어떻게 제어할 것인지 결정할 수 있는 모델을 지칭하며, 인공지능 모델을 포함할 수 있다. 따라서, 모션 계획 모델은, 모션 계획 알고리즘과 마찬가지로, 환경 정보를 입력 데이터로 하여 모션 계획을 출력 할 수 있다. 모션 계획 모델이 출력하는 모션 계획은 도 5를 참조하여 전술한 모션 계획에 대응하는 바, 모션 계획에 관한 설명은 생략한다. 일 실시예에서, 자율 주행 장치의 자동화된 학습을 위한 장치는 환경 정보를 모션 계획 모델의 입력 데이 터로 입력할 수 있다. 일 실시예에서, 자율 주행 장치의 자동화된 학습을 위한 장치는 모션 계획 모델이 출력하는 모션 계획을 획득할 수 있다. 일 실시예에서, 자율 주행 장치의 자동화된 학습을 위한 장치는 모션 계획 모델이 출력한 모션 계획 및 모 션 계획 알고리즘이 출력한 모션 계획에 기초하여 생성된 레이블링된 데이터에 기초하여 모션 계획 모델을 학습시킬 수 있다. 모션 계획 모델을 학습시키는 데 손실 함수가 사용될 수 있다. 즉, 손실 함수를 통해 모션 계획 모델(62 0)의 파라미터가 조정될 수 있다. 자율 주행 장치의 자동화된 학습을 위한 장치는 모션 계획 모델이 출력한 모션 계획과 모션 계획 알고리즘 이 출력한 모션 계획에 기초하여 생성된 레이블링된 데이터 사이의 손실을 계산할 수 있다. 자율 주 행 장치의 자동화된 학습을 위한 장치는 손실이 최소화되도록 모션 계획 모델의 파라미터를 조정함으로써, 모션 계획 모델을 학습시킬 수 있다. 일 실시예에서, 자율 주행 장치의 자동화된 학습을 위한 장치는 모션 계획 알고리즘을 모션 계획 모델로 대체할 수 있다. 즉, 도 5를 참조하여 전술한 차량 제어 알고리즘의 입력 데이터로 사용되기 위한 모션 계획을 모션 계 획 알고리즘이 아닌 모션 계획 모델이 출력하도록 할 수 있다. 일 실시예에서, 자율 주행 장치의 자동화된 학습 을 위한 장치는 모션 계획 모델에 의해 출력되는 모션 계획을 차량 제어 알고리즘의 입력으로 사용할 수 있다. 이에 따라, 모션 계획 모델에 의해 출력되는 모션 계획에 기초하여 차량의 주행이 제어될 수 있다. 일 실시예에서, 자율 주행 장치의 자동화된 학습을 위한 장치는, 소정의 기준을 만족하는 경우 모션 계획 모델 의 학습이 완료되었다고 결정하고, 모션 계획 알고리즘을 모션 계획 모델로 대체할 수 있다. 예를 들어, 소정의 기준은 모션 계획 모델이 데이터를 학습하는 양에 관한 것일 수 있다. 예를 들어, 소정의 기준은 모션 계획 모 델이 출력하는 모션 계획의 정확도에 관한 것일 수 있다. 일 실시예에서, 전술한 모션 계획 알고리즘 또한 인공지능 모델을 기반으로 할 수 있다. 본 실시예에서, 자율 주행 장치의 자동화된 학습을 위한 장치는 모션 계획 알고리즘을 모션 계획 모델로 대체하는 대신, 모션 계획 알고리즘을 업데이트할 수 있다. 일 실시예에서, 자율 주행 장치의 자동화된 학습을 위한 장치는, 환경 정보 추출 모델과 모션 계획 모델을 함께 학습시킬 수 있다. 다른 실시예에서, 자율 주행 장치의 자동화된 학습을 위한 장치는, 환경 정보 추출 모델과 모션 계획 모델이 상호 보완적으로 학습되도록 할 수 있다. 도 7은 일 실시예에 따른 자율 주행 장치의 자동화된 학습을 위한 방법의 흐름도이다. 도 7에 도시된 동작들은 전술한 자율 주행 장치의 자동화된 학습을 위한 장치에 의하여 실행될 수 있다. 구체적 으로, 도 7에 도시된 동작들은 전술한 자율 주행 장치의 자동화된 학습을 위한 장치에 포함된 프로세서에 의해 실행될 수 있다. 단계 710에서, 자율 주행 장치의 자동화된 학습을 위한 장치는 수집된 데이터에 기초하여 환경 정보를 결정할 수 있다. 일 실시예에서, 수집된 데이터는 라이더 센서에 의해 수집되는 데이터, 레이더 센서에 의해 수집되는 데이터, 카메라에 의해 수집되는 데이터 및 차량에 장착된 차체 센서에 의해 수집되는 데이터를 포함할 수 있다. 일 실시예에서, 환경 정보는 객체의 클래스, 객체의 속성 및 객체의 위치를 포함할 수 있다. 단계 720에서, 자율 주행 장치의 자동화된 학습을 위한 장치는 모션 계획 알고리즘을 이용하여, 결정된 환경 정 보에 기초하여 제1 모션 계획을 결정할 수 있다. 일 실시예에서, 제1 모션 계획은 주행 모드, 타겟 상태 및 안전 범위를 포함할 수 있다. 단계 730에서, 자율 주행 장치의 자동화된 학습을 위한 장치는 제1 모션 계획에 기초하여 레이블링된 데이터를 생성할 수 있다. 단계 740에서, 자율 주행 장치의 자동화된 학습을 위한 장치는 레이블링된 데이터에 기초하여 모션 계획 모델을 학습시킬 수 있다. 일 실시예에서, 단계 740은 결정된 환경 정보를 모션 계획 모델의 입력 데이터로 입력하는 단계를 포함할 수 있 다. 일 실시예에서, 단계 740은 모션 계획 모델이 출력하는 모션 계획을 획득하는 단계를 포함할 수 있다. 일 실시예에서, 단계 740은 모션 계획 모델이 출력한 모션 계획 및 레이블링된 데이터에 기초하여 모션 계획 모 델의 파라미터를 조정하는 단계를 포함할 수 있다. 일 실시예에서, 자율 주행 장치의 자동화된 학습을 위한 장치가 결정된 제1 모션 계획에 기초하여 차량의 주행 을 제어하는 단계가 더 포함될 수 있다. 일 실시예에서, 자율 주행 장치의 자동화된 학습을 위한 장치가 모션 계획 알고리즘을 모션 계획 모델로 대체하 는 단계가 더 포함될 수 있다. 도 8은 일 실시예에 따른 자율 주행 장치의 자동화된 학습을 위한 장치의 블록도이다. 도 8을 참조하면, 자율 주행 장치의 자동화된 학습을 위한 장치는 통신부, 프로세서 및 DB(83 0)를 포함할 수 있다. 도 8의 자율 주행 장치의 자동화된 학습을 위한 장치에는 실시예와 관련된 구성요소들만이 도시되어 있다. 따라서, 도 8에 도시된 구성요소들 외에 다른 범용적인 구성요소들이 더 포함될 수 있음"}
{"patent_id": "10-2022-0121453", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "을 당해 기술분야의 통상의 기술자라면 이해할 수 있다. 통신부는 외부 서버 또는 외부 장치와 유선/무선 통신을 하게 하는 하나 이상의 구성 요소를 포함할 수 있 다. 예를 들어, 통신부는, 근거리 통신부(미도시), 이동 통신부(미도시) 및 방송 수신부(미도시) 중 적어 도 하나를 포함할 수 있다. DB는 자율 주행 장치의 자동화된 학습을 위한 장치 내에서 처리되는 각종 데이터들을 저장하는 하드 웨어로서, 프로세서의 처리 및 제어를 위한 프로그램을 저장할 수 있다. DB는 결제 정보, 사용자 정 보 등을 저장할 수 있다. DB는 DRAM(dynamic random access memory), SRAM(static random access memory) 등과 같은 RAM(random access memory), ROM(read-only memory), EEPROM(electrically erasable programmable read-only memory), CD-ROM, 블루레이 또는 다른 광학 디스크 스토리지, HDD(hard disk drive), SSD(solid state drive), 또는 플 래시 메모리를 포함할 수 있다. 프로세서는 자율 주행 장치의 자동화된 학습을 위한 장치의 전반적인 동작을 제어한다. 예를 들어, 프로세서는 DB에 저장된 프로그램들을 실행함으로써, 입력부(미도시), 디스플레이(미도시), 통신부 , DB 등을 전반적으로 제어할 수 있다. 프로세서는, DB에 저장된 프로그램들을 실행함으로 써, 자율 주행 장치의 자동화된 학습을 위한 장치의 동작을 제어할 수 있다. 프로세서는 도 1 내지 도 7에서 상술한 자율 주행 장치의 자동화된 학습을 위한 장치의 동작 중 적어 도 일부를 제어할 수 있다. 프로세서는 ASICs (application specific integrated circuits), DSPs(digital signal processors), DSPDs(digital signal processing devices), PLDs(programmable logic devices), FPGAs(field programmable gate arrays), 제어기(controllers), 마이크로 컨트롤러(micro-controllers), 마이크로 프로세서 (microprocessors), 기타 기능 수행을 위한 전기적 유닛 중 적어도 하나를 이용하여 구현될 수 있다. 일 실시예로, 자율 주행 장치의 자동화된 학습을 위한 장치는 이동성을 가지는 전자 장치일 수 있다. 예를 들어, 자율 주행 장치의 자동화된 학습을 위한 장치는 스마트폰, 태블릿 PC, PC, 스마트 TV, PDA(personal digital assistant), 랩톱, 미디어 플레이어, 네비게이션, 카메라가 탑재된 디바이스 및 기타 모바일 전자 장치 로 구현될 수 있다. 또한, 자율 주행 장치의 자동화된 학습을 위한 장치는 통신 기능 및 데이터 프로세싱 기능을 구비한 시계, 안경, 헤어 밴드 및 반지 등의 웨어러블 장치로 구현될 수 있다. 다른 실시예로, 자율 주행 장치의 자동화된 학습을 위한 장치는 차량 내에 임베디드되는 전자 장치일 수 있다. 예를 들어, 자율 주행 장치의 자동화된 학습을 위한 장치는 생산 과정 이후 튜닝(tuning)을 통해 차 량 내에 삽입되는 전자 장치일 수 있다. 또 다른 실시예로, 자율 주행 장치의 자동화된 학습을 위한 장치는 차량 외부에 위치하는 서버일 수 있다. 서버는 네트워크를 통해 통신하여 명령, 코드, 파일, 컨텐츠, 서비스 등을 제공하는 컴퓨터 장치 또는 복수의 컴퓨터 장치들로 구현될 수 있다. 서버는 차량에 탑재된 장치들로부터 차량의 이동 경로를 결정하기 위해 필요 한 데이터를 수신하고, 수신한 데이터에 기초하여 차량의 이동 경로를 결정할 수 있다. 또 다른 실시예로, 자율 주행 장치의 자동화된 학습을 위한 장치에서 수행되는 프로세스는 이동성을 가지 는 전자 장치, 차량 내에 임베디드 되는 전자 장치 및 차량 외부에 위치하는 서버 중 적어도 일부에 의해 수행 될 수 있다. 본 발명에 따른 실시예는 컴퓨터 상에서 다양한 구성요소를 통하여 실행될 수 있는 컴퓨터 프로그램의 형태로 구현될 수 있으며, 이와 같은 컴퓨터 프로그램은 컴퓨터로 판독 가능한 매체에 기록될 수 있다. 이때, 매체는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체, CD-ROM 및 DVD와 같은 광기록 매체, 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical medium), 및 ROM, RAM, 플래시 메모리 등과 같 은, 프로그램 명령어를 저장하고 실행하도록 특별히 구성된 하드웨어 장치를 포함할 수 있다. 한편, 상기 컴퓨터 프로그램은 본 발명을 위하여 특별히 설계되고 구성된 것이거나 컴퓨터 소프트웨어 분야의 당업자에게 공지되어 사용 가능한 것일 수 있다. 컴퓨터 프로그램의 예에는, 컴파일러에 의하여 만들어지는 것 과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용하여 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드도포함될 수 있다. 일 실시예에 따르면, 본 개시의 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치들 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 본 발명에 따른 방법을 구성하는 단계들에 대하여 명백하게 순서를 기재하거나 반하는 기재가 없다면, 상기 단 계들은 적당한 순서로 행해질 수 있다. 반드시 상기 단계들의 기재 순서에 따라 본 발명이 한정되는 것은 아니 다. 본 발명에서 모든 예들 또는 예시적인 용어(예들 들어, 등등)의 사용은 단순히 본 발명을 상세히 설명하기 위한 것으로서 특허청구범위에 의해 한정되지 않는 이상 상기 예들 또는 예시적인 용어로 인해 본 발명의 범위 가 한정되는 것은 아니다. 또한, 당업자는 다양한 수정, 조합 및 변경이 부가된 특허청구범위 또는 그 균등물의 범주 내에서 설계 조건 및 팩터에 따라 구성될 수 있음을 알 수 있다. 따라서, 본 발명의 사상은 상기 설명된 실시 예에 국한되어 정해져서는 아니 되며, 후술하는 특허청구범위뿐만 아니라 이 특허청구범위와 균등한 또는 이로부터 등가적으로 변경된 모든 범위는 본 발명의 사상의 범주에 속한 다고 할 것이다."}
{"patent_id": "10-2022-0121453", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1 내지 도 3은 일 실시예에 따른 자율 주행 방식을 설명하기 위한 도면들이다. 도 4는 자율 주행 장치에 포함된 인공지능 모델을 통한 어노테이션 작업 과정을 설명하기 위한 간략한 도면이다. 도 5는 본 개시의 일 실시예에 따른 자율 주행 제어 과정을 설명하기 위한 간략한 도면이다. 도 6은 본 개시의 일 실시예에 따른 모션 계획 모델의 학습 과정을 설명하기 위한 간략한 도면이다. 도 7은 일 실시예에 따른 자율 주행 장치의 자동화된 학습을 위한 방법의 흐름도이다. 도 8은 일 실시예에 따른 자율 주행 장치의 자동화된 학습을 위한 장치의 블록도이다."}
