{"patent_id": "10-2014-0029377", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2015-0107053", "출원번호": "10-2014-0029377", "발명의 명칭": "케이스, 전자 장치 및 전자 장치의 제어 방법", "출원인": "삼성전자주식회사", "발명자": "차정윤"}}
{"patent_id": "10-2014-0029377", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "독립적으로 개폐 가능한 복수의 서브 커버를 포함하는 케이스의 복수의 서브 커버 각각의 개폐 상태를 센싱하는센싱부; 및상기 복수의 서브 커버의 개폐 상태에 따라 대응되는 동작을 수행하도록 제어하는 제어부;를 포함하는 전자 장치."}
{"patent_id": "10-2014-0029377", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 센싱부는,상기 서브 커버 각각의 개폐를 센싱하는 복수개의 센서를 포함하는 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2014-0029377", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 제어부는,상기 복수의 서브 커버 각각의 열림에 따라 상이한 동작을 수행하도록 제어하는 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2014-0029377", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 복수의 서브 커버 중 적어도 일부가 열리면 닫혀있는 서브 커버의 투명창에 대응되는 영역에 UI를 표시하는 디스플레이;를 더 포함하는 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2014-0029377", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 복수의 서브 커버 중 적어도 일부가 열리면 닫혀있는 서브 커버에 프린팅된 UI에 대응되는 UI를 표시하는디스플레이;를 더 포함하는 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2014-0029377", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "독립적으로 개폐 가능한 복수의 서브 커버를 포함하는 케이스의 복수의 서브 커버 각각의 개폐 상태를 센싱하는과정; 및상기 복수의 서브 커버의 개폐 상태에 따라 대응되는 동작을 수행하는 과정;을 포함하는 전자 장치의 제어방법."}
{"patent_id": "10-2014-0029377", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 센싱하는 과정은,상기 서브 커버 각각에 대응되는 복수개의 센서를 이용하여 상기 복수의 서브 커버의 개폐 상태를 센싱하는 것을 특징으로 하는 전자 장치의 제어 방법."}
{"patent_id": "10-2014-0029377", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서,공개특허 10-2015-0107053-2-상기 대응되는 동작을 수행하는 과정은,상기 복수의 서브 커버 각각의 열림에 따라 상이한 동작을 수행하도록 제어하는 것을 특징으로 하는 전자 장치의 제어 방법."}
{"patent_id": "10-2014-0029377", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제6항에 있어서,상기 대응되는 동작을 수행하는 과정은,상기 복수의 서브 커버 중 적어도 일부가 열리면 닫혀있는 서브 커버의 투명창에 대응되는 영역에 UI를 표시하는 과정;을 포함하는 것을 특징으로 하는 전자 장치의 제어 방법."}
{"patent_id": "10-2014-0029377", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제6항에 있어서,상기 대응되는 동작을 수행하는 과정은,상기 복수의 서브 커버 중 적어도 일부가 열리면 닫혀있는 서브 커버에 프린팅된 UI에 대응되는 UI를 표시하는과정;을 포함하는 것을 특징으로 하는 전자 장치의 제어 방법."}
{"patent_id": "10-2014-0029377", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "전자 장치에 결합될 수 있는 케이스에 있어서,상기 전자 장치의 적어도 일부에 탈착 가능한 체결부;상기 체결부로부터 회동가능하게 연장되어 상기 전자 장치의 디스플레이면을 덮을 수 있는 커버부;를 포함하며,상기 커버부는, 적어도 일부 영역에 형성된 투명창을 가지며 독립적으로 개폐 가능한 복수의 서브 커버를 포함하는 것을 특징으로 하는 케이스."}
{"patent_id": "10-2014-0029377", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 복수의 서브 커버에 형성된 투명창은 서로 상이한 크기를 가지는 것을 특징으로 하는 케이스."}
{"patent_id": "10-2014-0029377", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 복수의 서브 커버는, 상단 서브 커버에서 하단 서브 커버로 갈수록 넓은 투명창을 가지는 것을 특징으로하는 케이스."}
{"patent_id": "10-2014-0029377", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서,상기 복수의 서브 커버 중 적어도 일부는 전자 장치에서 표시되는 UI 그래픽이 프린팅 된 것을 특징으로 하는케이스."}
{"patent_id": "10-2014-0029377", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11항에 있어서,상기 복수의 서브 커버는, 각각 일측 가장자리로부터 외측을 향하여 연장된 탭을 포함하는 것을 특징으로 하는케이스."}
{"patent_id": "10-2014-0029377", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "공개특허 10-2015-0107053-3-제15항에 있어서,상기 탭은, 각각 동일한 방향의 가장자리로부터 연장되며 연장 방향의 수직축을 기준으로 서로 상이한 지점에위치하는 것을 특징으로 하는 케이스."}
{"patent_id": "10-2014-0029377", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시 예에 따른 전자 장치는, 독립적으로 개폐 가능한 복수의 서브 커버를 포함하는 케이스의 복수 의 서브 커버 각각의 개폐 상태를 센싱하는 센싱부 및 복수의 서브 커버의 개폐 상태에 따라 대응되는 동작을 수 행하도록 제어하는 제어부를 포함할 수 있다. 또한, 다른 실시예도 가능하다."}
{"patent_id": "10-2014-0029377", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 전자 장치에 결합 가능한 케이스, 전자 장치 및 전자 장치의 제어 방법에 관한 것이다."}
{"patent_id": "10-2014-0029377", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전자 기술을 발달로 다양한 종류의 전자 장치가 개발되고 있다. 특히, 최근에는 휴대가 간편한 스마트폰, 태블 릿 PC 등과 같은 휴대용 전자 장치가 널리 보급되고 있다. 상술한 휴대용 전자 장치는 휴대 가능한 특성상 낙하, 부딪힘 등에 의한 기기 파손이 문제되고 있다. 이에 따라, 휴대용 전자 장치 외부에 케이스를 씌워 전자 장치의 파손을 방지하는 사용자가 늘고 있다. 휴대용 전자 장치에 적용되는 케이스는 크게 전자 장치의 측면 또는 후면을 보호하는 타입과 디스플레이 화면이 제공되는 전면까지 보호하는 플립 타입이 있다."}
{"patent_id": "10-2014-0029377", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "휴대용 전자 장치에 적용되는 케이스 중 전자 장치의 측면 또는 후면만을 보호하는 타입은 전(前)면이 개방되어 파손에 취약할 수 있다. 반면, 플립 타입의 경우 전면 커버가 닫힌 상태에서는 전자 장치에서 표시되는 정보를 확인할 수 없다. 또한, 전면 커버가 닫힌 상태에서는 터치 조작을 입력할 수 없게 된다. 본 발명의 다양한 실시예는 휴대용 전자 장치의 전면을 보호하면서 디스플레이에서 표시되는 정보를 확인할 수 있으며, 터치 조작의 입력이 가능한 케이스를 제공하는 것을 목적으로 한다. 본 발명의 다양한 실시예는 케이스의 개폐 상태에 따라 다양한 기능을 제공할 수 있는 전자 장치 및 전자 장치 의 제어 방법을 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2014-0029377", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 다양한 실시 예에 따른 전자 장치는, 독립적으로 개폐 가능한 복수의 서브 커버를 포함하는 케이스의 복수의 서브 커버 각각의 개폐 상태를 센싱하는 센싱부 및 상기 복수의 서브 커버의 개폐 상태에 따라 대응되는 동작을 수행하도록 제어하는 제어부를 포함할 수 있다. 본 발명의 다양한 실시 예에 따른 전자 장치의 제어 방법은, 독립적으로 개폐 가능한 복수의 서브 커버를 포함 하는 케이스의 복수의 서브 커버 각각의 개폐 상태를 센싱하는 과정 및 상기 복수의 서브 커버의 개폐 상태에 따라 대응되는 동작을 수행하는 과정을 포함할 수 있다. 본 발명의 다양한 실시 예에 따른 케이스는 전자 장치의 적어도 일부에 탈착 가능한 체결부, 상기 체결부로부터 회동가능하게 연장되어 상기 전자 장치의 디스플레이면을 덮을 수 있는 커버부를 포함하며, 상기 커버부는, 적 어도 일부 영역에 형성된 투명창을 가지며 독립적으로 개폐 가능한 복수의 서브 커버를 포함할 수 있다."}
{"patent_id": "10-2014-0029377", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 다양한 실시 예에 따르면 사용자는 케이스의 서브 커버를 여는 동작만으로 편리하게 전자 장치를 제 어할 수 있다. 또한, 사용자는 서브 커버에 의해 가려진 디스플레이 영역에 표시되는 정보를 알 수 있으며 서브 커버를 닫은 상태에서도 정확한 터치 조작을 입력할 수 있다."}
{"patent_id": "10-2014-0029377", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 다양한 실시예가 첨부된 도면과 연관되어 기재된다. 본 발명의 다양한 실시예는 다양한 변경을 가할 수 있고 여러 가지 실시예를 가질 수 있는 바, 특정 실시예들이 도면에 예시되고 관련된 상세한 설명이 기 재되어 있다. 그러나, 이는 본 발명의 다양한 실시예를 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 다양한 실시예의 사상 및 기술 범위에 포함되는 모든 변경 및/또는 균등물 내지 대체물을 포함하는 것으 로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유사한 참조 부호가 사용되었다. 본 발명의 다양한 실시예에서 사용될 수 있는“포함한다” 또는 “포함할 수 있다” 등의 표현은 개시 (disclosure)된 해당 기능, 동작 또는 구성요소 등의 존재를 가리키며, 추가적인 하나 이상의 기능, 동작 또는 구성요소 등을 제한하지 않는다. 또한, 본 발명의 다양한 실시예에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것 이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존 재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 발명의 다양한 실시예에서 “또는” 등의 표현은 함께 나열된 단어들의 어떠한, 그리고 모든 조합을 포함한 다. 예를 들어, “A 또는 B”는, A를 포함할 수도, B를 포함할 수도, 또는 A 와 B 모두를 포함할 수도 있다. 본 발명의 다양한 실시예에서 사용된 “제1,” “제2,” “첫째,” 또는 “둘째,” 등의 표현들은 다양한 실시 예들의 다양한 구성요소들을 수식할 수 있지만, 해당 구성요소들을 한정하지 않는다. 예를 들어, 상기 표현들은 해당 구성요소들의 순서 및/또는 중요도 등을 한정하지 않는다. 상기 표현들은 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 수 있다. 예를 들어, 제1 사용자 기기와 제2 사용자 기기는 모두 사용자 기기이며, 서로 다른 사용자 기기를 나타낸다. 예를 들어, 본 발명의 다양한 실시예의 권리 범위를 벗어나지 않으면서 제1 구성 요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 상기 어떤 구성요소 가 상기 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 상기 어떤 구성요소와 상기 다른 구성요소 사이에 새로운 다른 구성요소가 존재할 수도 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 상기 어떤 구성 요소와 상기 다른 구성요소 사이에 새로운 다른 구성요소가 존재하지 않는 것으로 이해될 수 있어야 할 것이다. 본 발명의 다양한 실시예에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명의 다 양한 실시예를 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현 을 포함한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명의 다양한 실시예가 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥 상 가지는 의미와 일치하는 의미를 가지는 것으로 해석되어야 하며, 본 발명의 다양한 실시예에서 명백하게 정의되지 않는 한, 이상적이거 나 과도하게 형식적인 의미로 해석되지 않는다. 본 발명의 다양한 실시예에 따른 전자 장치는, 통신 기능이 포함된 장치일 수 있다. 예를 들면, 전자 장치는 스 마트 폰(smartphone), 태블릿 PC(tablet personal computer), 이동 전화기(mobile phone), 화상전화기, 전자북 리더기(e-book reader), 데스크탑 PC(desktop personal computer), 랩탑 PC(laptop personal computer), 넷북 컴퓨터(netbook computer), PDA(personal digital assistant), PMP(portable multimedia player), MP3 플레이 어, 모바일 의료기기, 카메라(camera), 또는 웨어러블 장치(wearable device)(예: 전자 안경과 같은 head-mounted-device(HMD), 전자 의복, 전자 팔찌, 전자 목걸이, 전자 앱세서리(appcessory), 전자 문신, 또는 스마 트 와치(smart watch)중 적어도 하나를 포함할 수 있다. 어떤 실시예들에 따르면, 전자 장치는 통신 기능을 갖춘 스마트 가전 제품(smart home appliance)일 수 있다. 스마트 가전 제품은, 예를 들자면, 전자 장치는 텔레비전, DVD(digital video disk) 플레이어, 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스(set-top box), TV 박스(예를 들면, 삼성 HomeSync™, 애플TV™, 또는 구글 TV™), 게임 콘솔(game consoles), 전자 사전, 전자 키, 캠코더(camcorder), 또는 전자 액자 중 적어도 하나를 포함할 수 있다. 어떤 실시예들에 따르면, 전자 장치는 각종 의료기기(예: MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 초음파기 등), 네비게이션(navigation) 장치, GPS 수 신기(global positioning system receiver), EDR(event data recorder), FDR(flight data recorder), 자동차 인포테인먼트(infotainment) 장치, 선박용 전자 장비(예: 선박용 항법 장치 및 자이로 콤파스 등), 항공 전자기 기(avionics), 보안 기기, 차량용 헤드 유닛, 산업용 또는 가정용 로봇, 금융 기관의 ATM(automatic teller’s machine) 또는 상점의 POS(point of sales) 중 적어도 하나를 포함할 수 있다. 어떤 실시예들에 따르면, 전자 장치는 통신 기능을 포함한 가구(furniture) 또는 건물/구조물의 일부, 전자 보 드(electronic board), 전자 사인 입력장치(electronic signature receiving device), 프로젝터(projector), 또는 각종 계측기기(예: 수도, 전기, 가스, 또는 전파 계측 기기 등) 중 적어도 하나를 포함할 수 있다. 본 발 명의 다양한 실시예에 따른 전자 장치는 전술한 다양한 장치들 중 하나 또는 그 이상의 조합일 수 있다. 또한, 본 발명의 다양한 실시예에 따른 전자 장치는 플렉서블 장치일 수 있다. 또한, 본 발명의 다양한 실시예에 따른 전자 장치는 전술한 기기들에 한정되지 않음은 당업자에게 자명하다. 이하, 첨부된 도면을 참조하여 다양한 실시예에 따른 전자 장치에 대해서 살펴본다. 다양한 실시예에서 이용되 는 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공지능 전자 장치)를 지칭할 수 있다. 도 1은 본 발명의 다양한 실시 예에 따른 케이스의 구조를 나타내는 도면이다. 본 발명의 일 실시 예에 따른 케이스는 체결부 및 커버부를 포함할 수 있다. 도 1의 (a)는 케이스의 커 버부가 열린 상태의 정면도를 나타내며, 도 1의 (b)는 케이스의 커버부가 닫힌 상태의 정면도를 나타내 며, 도 1의 (c)는 커버부에 포함된 복수의 서브 커버(20-1, 20-2, ..., 20-4) 각각이 열린 상태의 사시도를 나타낸다. 일 실시 예에 따르면 케이스는 전자 장치에 결합될 수 있다. 일 실시 예에 따르면 케이스는 체결부에 의해 전자 장치에 결합될 수 있다. 체결부는 전자 장치의 적어도 일부에 탈착 가능할 수 있다. 일 실시 예에 따 르면 체결부는 전자 장치의 후면(또는, 디스플레이면의 반대면) 및 측면 중 적어도 일부에 부착될 수 있다. 커버부는 전자 장치의 디스플레이면(또는, 전(前)면)을 덮을 수 있다. 일 실시 예에 따르면 커버부는 체결부로부터 연장되어 전자 장치의 디스플레이면을 덮을 수 있다. 일 실시 예에 따르면 커버부는 회동 가능하게 구현될 수 있다. 이에 따라, 커버부는 개폐가 가능할 수 있으며, 닫힌 상태에서 전자 장치의 디스 플레이면을 덮을 수 있다. 일 실시 예에 따르면 커버부는 복수의 서브 커버(20-1, 20-2, ..., 20-4)를 포함할 수 있다. 도 1의 (c)를 참조하면 커버부가 네 개의 서브 커버(20-1, 20-2, ..., 20-4)를 포함하는 것으로 도시되어 있으나 커버부 에 포함된 서브 커버의 개수는 이에 한정되지 않는다. 일 실시 예에 따르면 서브 커버(20-1, 20-2, ..., 20-4) 각각은 서브 커버의 적어도 일부 영역에 형성된 투명창 (30-1, 30-2, ..., 30-4)을 가질 수 있다. 이에 따라, 사용자는 케이스가 전자 장치와 결합된 상태에서 투명창 을 통해 디스플레이에 표시되는 정보를 확인할 수 있다. 일 실시 예에 따르면 복수의 서브 커버(20-1, 20-2, ..., 20-4)에 형성된 투명창(30-1, 30-2, ..., 30-4)은 서 로 상이한 크기를 가질 수 있다. 일 실시 예에 따르면, 복수의 서브 커버(20-1, 20-2, ..., 20-4)는 상단 서브 커버(20-1)에서 하단 서브 커버(20-4)로 갈수록 넓은 투명창을 가질 수 있다. 예를 들어, 도 3의 (c)에 도시된 바와 같이 제2 서브 커버(20-2)의 투명창(30-2)은 제1 서브 커버(20-1)의 투명창(30-1)보다 넓으며, 제3 서브커버(20-3)의 투명창(30-3)보다 좁을 수 있다. 일 실시 예에 따르면 복수의 서브 커버(20-1, 20-2, ..., 20-4)에 형성된 투명창(30-1, 30-2, ..., 30-4)은 서 로 동일한 크기를 가질 수 있다. 일 실시 예에 따르면 복수의 서브 커버(20-1, 20-2, ..., 20-4)는 각각 일측 가장자리로부터 외측을 향하여 연 장된 탭(40-1, 40-2, ..., 40-4)을 포함할 수 있다. 일 실시 예에 따르면 상기 서브 커버(20-1, 20-2, ..., 20-4) 각각에 포함된 탭(40-1, 40-2, ..., 40-4)은 동일한 방향의 가장자리로부터 연장되며 연장 방향의 수직축 을 기준으로 서로 상이한 지점에 위치할 수 있다. 예를 들어, 도 1의 (b)에 도시된 바와 같이 복수의 탭은 서브 커버의 오른쪽(또는, 체결부와 커버부의 연결부위의 반대측) 가장자리로부터 연장될 수 있다. 그 리고, 도 1의 (b)에 도시된 바와 같이 복수의 탭은 세로축(또는, 연장 방향의 수직축)을 기준으로 서로 상 이한 지점에 위치할 수 있다. 다른 예를 들어, 복수의 탭은 서브 커버의 위쪽 또는 아래쪽 가장자리로부터 연장될 수 있다. 복수의 탭이 서브 커버의 위쪽 또는 아래쪽 가장자리로부터 연장되는 경우 복수의 탭 은 가로축(또는, 연장 방향의 수직축)을 기준으로 서로 상이한 지점에 위치할 수 있다. 일 실시 예에 따르면 복수의 서브 커버(20-1, 20-2, ..., 20-4)는 탭을 포함하지 않는 형태로 구현될 수도 있다. 도 2는 본 발명의 다양한 실시 예에 따른 케이스의 구조를 나타내는 도면이다. 도 2의 (a)는 복수의 서브 커버가 모두 닫힌 상태의 정면도를 나타내며, 도 2의 (b)는 복수의 서브 커버 중 일 부가 열린 상태의 정면도를 나타낸다. 일 실시 예에 따르면 복수의 서브 커버 중 적어도 일부는 전자 장치에서 표시되는 UI 그래픽이 프린팅될 수 있다. 예를 들어, 도 2의 (a)에 도시된 바와 같이 서브 커버에는 '통화', '종료', '한뼘통화'와 같은 UI 그래픽 이 프린팅될 수 있다. 다른 예를 들어, 도 2의 (b)에 도시된 바와 같이 '새 일정', 'Today'와 같은 UI 그래 픽이 프린팅 될 수 있다. 일 실시 예에 따르면 서브 커버에 프린팅된 UI 그래픽은 서브 커버의 개폐에 따라 전자 장치에서 수행되는 동작에 의해 디스플레이에 표시되는 UI에 대응될 수 있다. 예를 들어, 도 2의 (a)에 도시된 바와 같이 복수의 서브 커버가 모두 닫힌 상태에서 전자 장치에 통화가 수신되면 전자 장치의 디스플레이는 서브 커버에 프린팅된 UI 그래픽에 대응되는 위치에 UI 그래픽과 동일한 UI를 표시할 수 있다. 다른 예를 들어, 도 2의 (b)에 도시된 바와 같이 제1 서브 커버가 열리면 전자 장치의 디스플레이는 서브 커버에 프린팅된 UI 그래픽에 대 응되는 위치에 UI 그래픽과 동일한 UI를 표시할 수 있다. 본 발명의 다양한 실시 예에 따른 케이스는 전자 장치의 적어도 일부에 탈착 가능한 체결부, 체결부로부터 회동 가능하게 연장되어 전자 장치의 디스플레이면을 덮을 수 있는 커버부를 포함하며, 커버부는, 적어도 일부 영역 에 형성된 투명창을 가지며 독립적으로 개폐 가능한 복수의 서브 커버를 포함할 수 있다. 도 3은 본 발명의 일 실시 예에 따른 전자 장치의 구성을 나타내는 블럭도이다. 도 3을 참조하면 전자 장치는 센싱부, 디스플레이, 입력부 및 제어부를 포함할 수 있 다. 센싱부는 케이스의 커버부에 포함된 복수의 서브 커버 각각의 개폐 상태를 센싱할 수 있다. 센싱부 에 대해 도 4를 참조하여 구체적으로 설명한다. 도 4는 본 발명의 일 실시 예에 따른 센싱부의 구현 예를 나타내는 도면이다. 일 실시 예에 따르면 센싱부는 홀센서(또는, 홀 IC)로 구현될 수 있다. 일 실시 예에 따르면 센싱부는 서브 커버 각각의 개폐를 센싱하는 복수의 센서(110-1, 110-2, ..., 110- 4)를 포함할 수 있다. 예를 들어, 도 4에 도시된 바와 같이 센싱부는 서브 커버와 동일한 수의 센서를 포 함할 수 있다. 일 실시 예에 따르면 센싱부가 복수의 센서로 구현되는 경우 복수의 센서 각각은 서브 커버 각각에 포함된 탭에 대응되는 지점에 위치할 수 있다. 예를 들어, 도 4에 도시된 바와 같이 복수의 센서(110-1, 110-2, ..., 110-4)는 서브 커버가 닫혔을 때 복수의 탭(40-1, 40-2, ..., 40-4)이 위치하는 지점에 구현될 수 있다. 디스플레이는 전자 장치에서 수행되는 동작에 대응되는 정보를 표시할 수 있다. 일 실시 예에 따르면, 디스플레이는 디스플레이 화면 중 서브 커버에 형성된 투명창에 대응되는 영역에 정보를 표시할 수 있다. 디스플레이는 예를 들어, 전자 장치에 통화가 수신되면 도 2의 (a)에 도시된 바와 같이 디 스플레이는 투명창에 대응되는 영역에 통화가 수신되었음을 알리는 아이콘을 표시될 수 있다. 일 실시 예에 따르면 서브 커버 각각에 형성된 투명창의 크기가 상이한 경우 디스플레이는 닫혀있는 서브 커버 중 가장 상부에 위치하는 서브 커버의 투명창에 대응되는 영역에 정보를 표시할 수 있다. 예를 들어, 도 2 의 (b)에 도시된 바와 같이 디스플레이는 닫혀있는 서브 커버 중 가장 상부에 위치하는 서브 커버(20-2)의 투명창에 대응되는 영역에 달력을 표시할 수 있다. 일 실시 예에 따르면 디스플레이는 서브 커버에 프린팅된 UI 그래픽에 대응되는 UI를 표시할 수 있다. 일 실시 예에 따르면, 디스플레이는 닫혀있는 서브 커버 중 가장 상부에 위치하는 서브 커버에 프린팅된 UI 그래픽에 대응되는 UI를 표시할 수 있다. 예를 들어, 도 2의 (a)를 참조하면 모든 서브 커버가 닫혀있는 상태에 서 전자 장치에 통화가 수신되면 디스플레이는 제1 서브 커버(20-1)에 프린팅된 UI 그래픽과 동일한 UI를 동일한 위치에 표시할 수 있다. 다른 예를 들어, 도 2의 (b)를 참조하면 제1 서브 커버(20-1)가 열림에 따 라 일정 관리 어플리케이션이 실행되면 디스플레이는 제2 서브 커버(20-2)에 프린팅된 UI 그래픽과 동일한 UI를 동일한 위치에 표시할 수 있다. 이에 따라, 사용자는 서브 커버에 의해 가려진 디스플레이 영역에 표시되는 정보를 알 수 있으며 서브 커버를 닫은 상태에서도 정확한 터치 조작을 입력할 수 있다. 입력부는 전자 장치를 제어하기 위한 사용자 조작을 입력받을 수 있다. 일 실시 예에 따르면, 입력부 는 사용자의 터치 조작에 의해 동작하는 터치 스크린(Touch Screen)으로 구현될 수 있다. 입력부는 전자 장치의 종류에 따라 다양하게 구현될 수 있다. 예를 들어, 전자 장치가 스마트폰 으로 구현되는 경우 입력부는 터치 스크린 및 음성 인식 센서로 구현될 수 있다. 일 실시 예에 따르면 입력부는 서브 커버가 닫혀진 상태에서도 터치 조작을 입력받을 수 있다. 이에 따라, 사용자가 서브 커버에 프린팅된 UI 그래픽에 터치 조작을 입력하면 전자 장치는 사용자의 터치 조작에 따라 대응되는 동작을 수행할 수 있다. 제어부는 전자 장치의 전반적인 동작을 제어할 수 있다. 일 실시 예에 따르면 제어부는 복수의 서브 커버의 개폐 상태에 따라 대응되는 동작을 수행하도록 제어할 수 있다. 예를 들어, 제어부는 복수의 서브 커버 중 일부가 열리면 기 설정된 어플리케이션을 실행시킬 수 있다. 다른 예로, 제어부는 복수의 서 브 커버 중 일부가 열리면 디스플레이에 표시되는 정보의 종류 또는 위치를 변경시킬 수 있다. 또 다른 예로, 제어부는 복수의 서브 커버 중 일부가 열리면 기 설정된 번호로 통화를 요청할 수 있다. 도 5는 본 발명의 일 실시 예에 따라 서브 커버의 열림에 의해 수행되는 동작을 나타내는 도면이다. 도 5의 (a)는 전자 장치에 케이스가 부착되어 서브 커버가 모두 닫혀 있는 상태를 나타낸다. 도 5의 (a)를 참조 하면 사용자는 커버부에 형성된 투명창을 통해 디스플레이에서 표시되는 정보를 확인할 수 있다. 일 실시 예에 따르면, 사용자가 사용자가 복수의 서브 커버 중 일부를 열면 제어부는 기 설정된 어플리케이션 을 실행시킬 수 있다. 예를 들어, 도 5의 (b)에 도시된 바와 같이 사용자가 제1 서브 커버(30-1)를 열면 제어부 는 메시징 어플리케이션을 실행시킬 수 있다. 다른 예를 들어, 도 5의 (c)에 도시된 바와 같이 제2 서브 커버(20-2)를 열면 제어부는 SNS(social network service) 어플리케이션을 실행시킬 수 있다. 일 실시 예에 따르면 제어부는 복수의 서브 커버 각각의 열림에 따라 상이한 동작을 수행하도록 제어할 수 있다. 예를 들어, 도 5를 참조하여 설명한 바와 같이 제1 서브 커버를 열었을 때와 제2 서브 커버를 열었을 때 상이한 어플리케이션이 실행될 수 있다. 본 발명의 다양한 실시 예에 따른 전자 장치는, 독립적으로 개폐 가능한 복수의 서브 커버를 포함하는 케이스의 복수의 서브 커버 각각의 개폐 상태를 센싱하는 센싱부 및 복수의 서브 커버의 개폐 상태에 따라 대응되는 동작 을 수행하도록 제어하는 제어부를 포함할 수 있다. 도 6은 본 발명의 일 실시 예에 다른 전자 장치의 제어 방법을 나타내는 흐름도이다. 도 6에 도시된 흐름도는 도 3에 도시된 전자 장치에서 처리되는 시계열적인 과정들로 구성될 수 있다. 따라서, 이하에서 생략된 내용이라 하더라도 도 3에 도시된 전자 장치에 관하여 기술된 내용은 도 6에 도시된 흐름도에 도 적용될 수 있다. 전자 장치는 부착된 케이스의 복수의 서브 커버 각각의 개폐 상태를 센싱할 수 있다(S610). 일 실시 예에 따르면 전자 장치는 서브 커버 각각의 개폐를 센싱하는 복수의 센서(110-1, 110-2, ..., 110-4)를 포함할 수 있다. 예를 들어, 도 4에 도시된 바와 같이 전자 장치는 서브 커버와 동일한 수의 센서를 포함할 수 있 다. 전자 장치는 복수의 서브 커버의 개폐 상태에 따라 대응되는 동작을 수행할 수 있다(S620). 예를 들어, 전 자 장치는 복수의 서브 커버 중 일부가 열리면 기 설정된 어플리케이션을 실행시킬 수 있다. 다른 예로, 전자 장치는 복수의 서브 커버 중 일부가 열리면 디스플레이에 표시되는 정보의 종류 또는 위치를 변경시 킬 수 있다. 또 다른 예로, 전자 장치는 복수의 서브 커버 중 일부가 열리면 기 설정된 번호로 통화를 요 청할 수 있다. 일 실시 예에 따르면 전자 장치는 복수의 서브 커버 각각의 열림에 따라 상이한 동작을 수행하도록 제어할 수 있다. 예를 들어, 도 5를 참조하여 설명한 바와 같이 제1 서브 커버를 열었을 때와 제2 서브 커버를 열었을 때 상이한 어플리케이션이 실행될 수 있다. 일 실시 예에 따르면, 전자 장치는 디스플레이 화면 중 서브 커버에 형성된 투명창에 대응되는 영역에 정 보를 표시할 수 있다. 전자 장치는 서브 커버에 프린팅된 UI 그래픽에 대응되는 UI를 표시할 수 있다. 일 실시 예에 따르면, 전 자 장치는 닫혀있는 서브 커버 중 가장 상부에 위치하는 서브 커버에 프린팅된 UI 그래픽에 대응되는 UI를 표시할 수 있다. 본 발명의 일 실시 예에 따른 전자 장치의 제어 방법은, 독립적으로 개폐 가능한 복수의 서브 커버를 포함하는 케이스의 복수의 서브 커버 각각의 개폐 상태를 센싱하는 과정 및 복수의 서브 커버의 개폐 상태에 따라 대응되 는 동작을 수행하는 과정을 포함할 수 있다. 상술한 본 발명의 다양한 실시 예들에 따른 제1 전자 장치 또는 제2 전자 장치의 절전 방법은 전자 장치에서 실 행 가능한 프로그램으로 구현될 수 있다. 그리고, 이러한 프로그램은 다양한 유형의 기록 매체에 저장되어 사용 될 수 있다. 구체적으로는, 상술한 방법들을 수행하기 위한 프로그램 코드는, 플래시메모리(Flash Memory), ROM(Read Only Memory), EPROM(Erasable Programmable ROM), EEPROM(Electronically Erasable and Programmable ROM), 하드 디스크, 리무버블 디스크, 메모리 카드, USB 메모리, CD-ROM 등과 같이, 다양한 유형의 비휘발성 기록 매체에 저장되어 있을 수 있다. 이상에서는 본 발명의 다양한 실시 예에 대하여 도시하고 설명하였지만, 본 발명은 상술한 특정의 실시예에 한"}
{"patent_id": "10-2014-0029377", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "정되지 아니하며, 청구범위에서 청구하는 본 발명의 요지를 벗어남이 없이 당해 발명이 속하는 기술분야에서 통 상의 지식을 가진자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 발명의 기술적 사상이나 전망으로부터 개별적으로 이해되어져서는 안 될 것이다."}
{"patent_id": "10-2014-0029377", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 다양한 실시 예에 따른 케이스의 구조를 나타내는 도면이다. 도 2는 본 발명의 다양한 실시 예에 따른 케이스의 구조를 나타내는 도면이다. 도 3은 본 발명의 일 실시 예에 따른 전자 장치의 구성을 나타내는 블럭도이다. 도 4는 본 발명의 일 실시 예에 따른 센싱부의 구현 예를 나타내는 도면이다. 도 5는 본 발명의 일 실시 예에 따라 서브 커버의 열림에 의해 수행되는 동작을 나타내는 도면이다. 도 6은 본 발명의 일 실시 예에 다른 전자 장치의 제어 방법을 나타내는 흐름도이다."}
