{"patent_id": "10-2021-0099283", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0017596", "출원번호": "10-2021-0099283", "발명의 명칭": "AI 기반 이미지 학습에서의 베이지안 알고리즘 적용을 통한 로드킬 방지 방법 및 이를 수행하", "출원인": "(주)골든플래닛", "발명자": "김동성"}}
{"patent_id": "10-2021-0099283", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치의 BNN(Bayesian neural network) 기반 이미지 학습을 통하여 로드킬을 방지하는 방법에 있어서, 차량이 주행 중인 도로가 촬영된 적어도 하나의 이미지를 획득하는 단계;기 설정된 복수의 전처리 기법 중 적어도 하나의 전처리 기법을 이용하여, 상기 획득된 적어도 하나의 이미지에전처리를 수행하는 단계;상기 전처리가 수행된 적어도 하나의 이미지를 기초로, BNN 기반의 학습 모델을 이용하여, 상기 도로 상에 동물이 존재할 확률 정보를 획득하는 단계; 및 상기 획득된 확률 정보와 기 설정된 임계값의 비교 결과에 따라, 상기 도로 상에 동물이 존재함을 알리는 알람의 제공 여부를 결정하는 단계를 포함하는, 방법."}
{"patent_id": "10-2021-0099283", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 전처리를 수행하는 단계는, 상기 획득된 적어도 하나의 이미지에 블러링(blurring) 필터 및 샤프닝(sharpeneing) 필터를 적용하는 단계를포함하는, 방법."}
{"patent_id": "10-2021-0099283", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 BNN 기반의 학습 모델은,도로 상에 동물이 존재하는지 여부의 판단에 기준이 되는 기 설정된 피쳐(feature)들의 값을 입력 노드들의 값으로 적용하며, 상기 입력 노드들과 상기 동물이 존재할 확률 정보가 출력되는 출력 노드는 학습 결과 획득된 가중치의 분포들에 기반하여 값이 획득되는 적어도 하나의 히든 노드들로 연결되는 것인, 방법."}
{"patent_id": "10-2021-0099283", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 가중치의 분포들은,도로 이미지와 동물의 이미지를 랜덤하게 합성하여 생성된 복수의 제 1 학습 데이터 및 상기 복수의 제 1 학습데이터를 변환하여 획득한 복수의 제 2 학습 데이터를 기반으로 상기 BNN 기반의 학습 모델을 트레이닝 시킨 결과에 기초하여 결정되는 것인, 방법."}
{"patent_id": "10-2021-0099283", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 BNN 기반의 학습 모델을 트레이닝 시킨 결과 획득된 가중치의 분포들을 기초로, 동물이 도로에 존재할 확률에 관한 지표를 결정하는 단계; 상기 결정된 지표에 기초하여, 상기 BNN 기반의 학습 모델에 입력되는 피쳐들을 업데이트하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2021-0099283", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 획득된 확률 정보와 기 설정된 임계값의 비교 결과에 따라 상기 도로 상에 동물이 존재하는 것으로 결정된경우, 상기 동물의 가청 주파수의 신호를 출력하는 단계를 더 포함하는, 방법. 공개특허 10-2023-0017596-3-청구항 7 BNN(Bayesian neural network) 기반 이미지 학습을 통하여 로드킬을 방지하는 전자 장치에 있어서, 입력부; 출력부;하나 이상의 명령어들을 저장하는 메모리; 및상기 메모리에 저장된 상기 하나 이상의 명령어들을 실행하는 적어도 하나의 프로세서를 포함하고, 상기 적어도하나의 프로세서는, 상기 입력부를 통해 차량이 주행 중인 도로가 촬영된 적어도 하나의 이미지를 획득하고, 기 설정된 복수의 전처리 기법 중 적어도 하나의 전처리 기법을 이용하여, 상기 획득된 적어도 하나의 이미지에전처리를 수행하며, 상기 전처리가 수행된 적어도 하나의 이미지를 기초로, BNN 기반의 학습 모델을 이용하여, 상기 도로 상에 동물이 존재할 확률 정보를 획득하고, 상기 획득된 확률 정보와 기 설정된 임계값의 비교 결과에 따라, 상기 도로 상에 동물이 존재함을 알리는 알람을 상기 출력부를 통해 제공할지 여부를 결정하는, 전자 장치."}
{"patent_id": "10-2021-0099283", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 적어도 하나의 프로세서는, 상기 획득된 적어도 하나의 이미지에 블러링(blurring) 필터 및 샤프닝(sharpeneing) 필터를 적용하는, 전자 장치."}
{"patent_id": "10-2021-0099283", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서, 상기 BNN 기반의 학습 모델은,도로 상에 동물이 존재하는지 여부의 판단에 기준이 되는 기 설정된 피쳐(feature)들의 값을 입력 노드들의 값으로 적용하며, 상기 입력 노드들과 상기 동물이 존재할 확률 정보가 출력되는 출력 노드는 학습 결과 획득된 가중치의 분포들에 기반하여 값이 획득되는 적어도 하나의 히든 노드들로 연결되는 것인, 전자 장치."}
{"patent_id": "10-2021-0099283", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 가중치의 분포들은,도로 이미지와 동물의 이미지를 랜덤하게 합성하여 생성된 복수의 제 1 학습 데이터 및 상기 복수의 제 1 학습데이터를 변환하여 획득한 복수의 제 2 학습 데이터를 기반으로 상기 BNN 기반의 학습 모델을 트레이닝 시킨 결과에 기초하여 결정되는 것인, 전자 장치."}
{"patent_id": "10-2021-0099283", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서, 상기 적어도 하나의 프로세서는,상기 BNN 기반의 학습 모델을 트레이닝 시킨 결과 획득된 가중치의 분포들을 기초로, 동물이 도로에 존재할 확률에 관한 지표를 결정하고, 상기 결정된 지표에 기초하여, 상기 BNN 기반의 학습 모델에 입력되는 피쳐들을 업데이트하는, 전자 장치."}
{"patent_id": "10-2021-0099283", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제7항에 있어서, 상기 획득된 확률 정보와 기 설정된 임계값의 비교 결과에 따라 상기 도로 상에 동물이 존재하는 것으로 결정된경우, 상기 동물의 가청 주파수의 신호를 출력하는 출력부를 더 포함하는, 전자 장치. 공개특허 10-2023-0017596-4-청구항 13 전자 장치의 BNN(Bayesian neural network) 기반 이미지 학습을 통하여 로드킬을 방지하는 방법을 수행하도록하는 프로그램이 저장된 기록매체를 포함하는 컴퓨터 프로그램 제품에 있어서,차량이 주행 중인 도로가 촬영된 적어도 하나의 이미지를 획득하는 동작,기 설정된 복수의 전처리 기법 중 적어도 하나의 전처리 기법을 이용하여, 상기 획득된 적어도 하나의 이미지에전처리를 수행하는 동작,상기 전처리가 수행된 적어도 하나의 이미지를 기초로, BNN 기반의 학습 모델을 이용하여, 상기 도로 상에 동물이 존재할 확률 정보를 획득하는 동작, 및 상기 획득된 확률 정보와 기 설정된 임계값의 비교 결과에 따라, 상기 도로 상에 동물이 존재함을 알리는 알람의 제공 여부를 결정하는 동작을 수행하도록 하는 프로그램이 저장된 기록매체를 포함하는 컴퓨터 프로그램 제품."}
{"patent_id": "10-2021-0099283", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 문서에 개시되는 일 실시예에 따라 AI 기반 이미지 학습에서의 베이지안 알고리즘 적용을 통하여 로드킬을 방 지하는 전자 장치는, 차량이 주행 중인 도로가 촬영된 적어도 하나의 이미지를 획득하고, 기 설정된 복수의 전처 리 기법 중 적어도 하나의 전처리 기법을 이용하여, 획득된 적어도 하나의 이미지에 전처리를 수행하며, 전처리 가 수행된 적어도 하나의 이미지를 기초로, BNN 기반의 학습 모델을 이용하여, 도로 상에 동물이 존재할 확률 정 보를 획득하고, 획득된 확률 정보와 기 설정된 임계값의 비교 결과에 따라, 도로 상에 동물이 존재함을 알리는 알람의 제공 여부를 결정할 수 있다."}
{"patent_id": "10-2021-0099283", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 문서에서 개시되는 실시예들은 AI 기반 이미지 학습에서의 베이지안 알고리즘 적용을 통하여 로드킬을 방지 하는 기술에 관한 것이다."}
{"patent_id": "10-2021-0099283", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공지능 기술은 기계학습(ex. 딥러닝) 및 기계학습을 활용한 요소 기술들로 구성된다. 기계 학습은 입력 데이 터들의 특징을 스스로 분류하여 학습하는 알고리즘 기술이다. 요소 기술은 딥러닝 등의 기계학습 알고리즘을 활 용하는 기술로서, 언어적 이해, 시각적 이해, 추론/예측, 지식 표현, 동작 제어 등의 기술 분야로 구성될 수 있 다. 인공지능 기술은 사고 시의 사고 원인을 분석하고 분류하여 학습함으로써, 사고 발생 전 이를 방지하기 위한 정 보를 제공하는 데에도 활용될 수 있다. 특히, 로드킬 같이, 제어가 어려운 동물에 의해 발생하는 사고의 경우 인공지능 기술을 이용하여 로드킬을 방지하기 위한 정보를 제공하는 것을 고려해볼 수 있다. 다만, 동물의 움직 임을 정확히 예측하기 어렵고 차량 주행 중에 발생할 수 있는 상황이 다양함에 따라, 인공지능 기술을 이용하여 효과적으로 로드킬을 방지할 수 있는 기술에 대한 연구가 필요한 실정이다."}
{"patent_id": "10-2021-0099283", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시에서는 차량 전방의 이미지를 기초로 도로에 위치한 객체가 동물인지 여부를 판단하여 알람을 보냄으로 써 로드킬을 방지하는 기술을 제공하고자 한다. 보다 구체적으로, 본 개시의 일 실시예에 따른 전자 장치는 AI 기반 이미지 학습에서의 베이지안 알고리즘 적용을 통하여 도로에 위치한 객체가 동물인지 여부를 판단할 수 있 다."}
{"patent_id": "10-2021-0099283", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 실시예들은 AI 기반 이미지 학습에서의 베이지안 알고리즘 적용을 통하여 로드킬을 방지하는 기술에 관한 것으로, 이하에서는 설명의 편의상, AI 기반 이미지 학습에서의 베이지안 알고리즘 적용을 통하여 로드킬 을 방지하는 것을 BNN 기반 이미지 학습을 통하여 로드킬을 방지하는 것으로 지칭하도록 한다. 일 실시예에 따른 전자 장치의 BNN 기반 이미지 학습을 통하여 로드킬을 방지하는 방법은, 차량이 주행 중인 도 로가 촬영된 적어도 하나의 이미지를 획득하는 단계; 기 설정된 복수의 전처리 기법 중 적어도 하나의 전처리 기법을 이용하여, 획득된 적어도 하나의 이미지에 전처리를 수행하는 단계; 전처리가 수행된 적어도 하나의 이 미지를 기초로, BNN 기반의 학습 모델을 이용하여, 도로 상에 동물이 존재할 확률 정보를 획득하는 단계; 및 획 득된 확률 정보와 기 설정된 임계값의 비교 결과에 따라, 도로 상에 동물이 존재함을 알리는 알람의 제공 여부 를 결정하는 단계를 포함할 수 있다.일 실시예에 따른 전자 장치의 BNN 기반 이미지 학습을 통하여 로드킬을 방지하는 방법에 있어서, 전처리를 수 행하는 단계는, 상기 획득된 적어도 하나의 이미지에 블러링(blurring) 필터 및 샤프닝(sharpeneing) 필터를 적 용하는 단계를 포함할 수 있다. 일 실시예에 따른 전자 장치의 BNN 기반 이미지 학습을 통하여 로드킬을 방지하는 방법에 있어서, BNN 기반의 학습 모델은, 도로 상에 동물이 존재하는지 여부의 판단에 기준이 되는 기 설정된 피쳐(feature)들의 값을 입력 노드들의 값으로 적용하며, 입력 노드들과 동물이 존재할 확률 정보가 출력되는 출력 노드는 학습 결과 획득된 가중치의 분포들에 기반하여 값이 획득되는 적어도 하나의 히든 노드들로 연결될 수 있다. 일 실시예에 따른 전자 장치의 BNN 기반 이미지 학습을 통하여 로드킬을 방지하는 방법에 있어서, 가중치의 분 포들은, 도로 이미지와 동물의 이미지를 랜덤하게 합성하여 생성된 복수의 제 1 학습 데이터 및 복수의 제 1 학 습 데이터를 변환하여 획득한 복수의 제 2 학습 데이터를 기반으로 BNN 기반의 학습 모델을 트레이닝 시킨 결과 에 기초하여 결정될 수 있다. 일 실시예에 따른 전자 장치의 BNN 기반 이미지 학습을 통하여 로드킬을 방지하는 방법에 있어서, BNN 기반의 학습 모델을 트레이닝 시킨 결과 획득된 가중치의 분포들을 기초로, 동물이 도로에 존재할 확률에 관한 지표를 결정하는 단계; 결정된 지표에 기초하여, BNN 기반의 학습 모델에 입력되는 피쳐들을 업데이트하는 단계를 더 포함할 수 있다. 일 실시예에 따른 전자 장치의 BNN 기반 이미지 학습을 통하여 로드킬을 방지하는 방법은, 획득된 확률 정보와 기 설정된 임계값의 비교 결과에 따라 상기 도로 상에 동물이 존재하는 것으로 결정된 경우, 동물의 가청 주파 수의 신호를 출력하는 단계를 더 포함할 수 있다. 일 실시예에 따른 BNN 기반 이미지 학습을 통하여 로드킬을 방지하는 전자 장치는, 입력부; 출력부; 하나 이상 의 명령어들을 저장하는 메모리; 및 메모리에 저장된 하나 이상의 명령어들을 실행하는 적어도 하나의 프로세서 를 포함하고, 적어도 하나의 프로세서는, 입력부를 통해 차량이 주행 중인 도로가 촬영된 적어도 하나의 이미지 를 획득하고, 기 설정된 복수의 전처리 기법 중 적어도 하나의 전처리 기법을 이용하여, 획득된 적어도 하나의 이미지에 전처리를 수행하며, 전처리가 수행된 적어도 하나의 이미지를 기초로, BNN 기반의 학습 모델을 이용하 여, 도로 상에 동물이 존재할 확률 정보를 획득하고, 획득된 확률 정보와 기 설정된 임계값의 비교 결과에 따라, 도로 상에 동물이 존재함을 알리는 알람을 출력부를 통해 제공할지 여부를 결정할 수 있다. 일 실시예에 따른 전자 장치의 BNN 기반 이미지 학습을 통하여 로드킬을 방지하는 방법을 수행하도록 하는 프로 그램이 저장된 기록매체를 포함하는 컴퓨터 프로그램 제품은, 차량이 주행 중인 도로가 촬영된 적어도 하나의 이미지를 획득하는 동작, 기 설정된 복수의 전처리 기법 중 적어도 하나의 전처리 기법을 이용하여, 획득된 적 어도 하나의 이미지에 전처리를 수행하는 동작, 전처리가 수행된 적어도 하나의 이미지를 기초로, BNN 기반의 학습 모델을 이용하여, 도로 상에 동물이 존재할 확률 정보를 획득하는 동작, 및 획득된 확률 정보와 기 설정된 임계값의 비교 결과에 따라, 도로 상에 동물이 존재함을 알리는 알람의 제공 여부를 결정하는 동작을 수행하도 록 하는 프로그램이 저장된 기록매체를 포함할 수 있다."}
{"patent_id": "10-2021-0099283", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 문서에서 개시되는 실시 예들에 따르면, 차량에서 촬영된 이미지를 기초로 BNN 기반 학습 모델을 이용하여 촬영된 객체가 동물인지 여부를 예측함으로써, 로드킬이 발생하는 것을 보다 효과적으로 예방할 수 있다."}
{"patent_id": "10-2021-0099283", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에서 사용되는 용어에 대해 간략히 설명하고, 본 발명에 대해 구체적으로 설명하기로 한다. 본 발명에서 사용되는 용어는 본 발명에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 해당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 발명의 설명 부분에서 상 세히 그 의미를 기재할 것이다. 따라서 본 발명에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가 지는 의미와 본 발명의 전반에 걸친 내용을 토대로 정의되어야 한다. 명세서 전체에서 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있음을 의미한다. 또한, 명세서에 기재된 \"...부\", \"모듈\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어 또는 소프트웨어로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 이하에서는, 실시예를 통하여 본 발명을 더욱 상세히 설명하기로 한다. 그러나, 아래의 실시예는 발명의 이해를 돕기 위한 예시일 뿐, 이에 의해 본 발명의 범위가 제한되는 것은 아니다. 도 1은 본 개시의 일 실시예에 따라 차량에서 획득한 도로 이미지를 기초로 로드킬을 방지하기 위한 알람을 제 공하는 기술을 설명하기 위한 개념도이다. 도 1을 참조하면, 도로에 위치하는 객체는 차량의 교통사고를 유발하는 위험요소일 수 있다. 특히, 객 체가 동물 등의 생명체인 경우, 차량에 탑승한 탑승자 뿐만 아니라, 동물의 생명을 위협할 수 있다. 본 개 시에서는 도로에 위치하는 객체가 동물인지 여부를 예측하고, 예측 결과에 기반하여 로드킬을 방지하기 위 한 알람을 제공할 수 있다. 일 실시예에 따른 전자 장치는 카메라를 통해 도로를 촬영하여 복수의 이미지를 획득할 수 있다. 전자 장치는 복수의 이미지 중 적어도 하나를 이용한 객체 예측을 수행할 수 있다. 전자 장치는 객체 예측 을 위해, 기 생성된 BNN(Bayesian neural network) 기반의 학습 모델을 이용할 수 있다. BNN은 모델의 가 중치에 대해 사전분포(prior distribution)를 가정하고, 베이지안 추론과정을 거쳐 가중치에 대한 사후분포 (posterior distribution)를 계산함으로써 신경망 모델의 확률적 해석을 가능하게 한 딥러닝 알고리즘이다. 전자 장치는 BNN 기반의 학습 모델을 이용하여 베이지안 추론 과정을 거쳐 가중치에 대한 사후분포를 계산함으 로써, 도로에 존재하는 객체가 동물인 경우에 대한 확률을 제공할 수 있다. 이 때, 전자 장치는 복수의 이 미지 중 적어도 하나의 피쳐(feature)들을 BNN 기반의 학습 모델의 입력값으로 설정할 수 있다. 적어도 하 나의 피쳐들에는 이미지에서 식별된 객체의 윤곽선, 객체의 중심점의 위치, 객체의 움직임 여부, 객체의 이동 궤적 등을 나타내는 값이 포함될 수 있으나, 이는 일 예일 뿐, BNN 기반의 학습 모델의 입력값으로 설정되는 피 쳐가 전술한 예에 한정되는 것은 아니다. 다른 실시예에 따른 전자 장치는 도로를 촬영한 결과 획득한 복수의 이미지 중 적어도 하나에 전처리를 수 행할 수 있다. 전처리 기법은 복수의 이미지 각각에 포함된 객체를 보다 용이하게 식별할 수 있도록, 이미 지가 촬영된 촬영 환경 또는 획득된 이미지의 특성을 고려하여 선택될 수 있다. 예를 들어, 객체가 도로의 외곽 에 위치한 경우, 객체와 도로 주변에 위치한 수풀 등을 구별해야 할 필요가 있으므로, 샤프닝(sharpening) 기법 이 전처리 기법으로 적용될 수 있다. 다만, 이는 일 예일 뿐, 전처리 기법으로는 샤프닝 기법 이외에 블러링 기 법과 같이 기존의 다양한 전처리 기법이 적용될 수 있다. 전자 장치는 전처리된 이미지의 피쳐(feature)들을 BNN 기반의 학습 모델의 입력값으로 설정할 수 있다. 전자 장치는 도로에 위치한 객체가 동물인지 여부를 판단하기 위한 이상치 기준을 확인할 수 있다. 본 개시에서는, 편의상 이상치 기준과 임계값을 동일한 의미를 갖는 것으로 설명하도록 한다. 이상치 기준은 BNN 기반의 학습 모델의 트레이닝 과정을 통해 미리 설정될 수도 있으며, 사용자의 입력 등에 따라 설정될 수도 있 다. 전자 장치는 BNN 기반의 학습 모델의 출력으로 획득된 확률 정보와 임계값을 비교하여, 확률 정보가 나타내 는 값이 임계값 보다 큰 경우, 도로에 위치한 객체가 동물인 것으로 결정할 수 있다. 전자 장치는 객체(1 0)가 동물인 것으로 결정됨에 따라 알람을 제공할 수 있다. 알람은 차량의 운전자에게 전방에 동물에 존재 함을 알리기 위한 알람 또는 동물에게 차량이 다가오고 있음을 경고하기 위한 알람 중 적어도 하나를 포함할 수 있다. 동물에게 차량이 다가오고 있음을 경고하기 위한 알람은 동물의 가청주파수의 신호를 출력하는 형태로 제 공될 수 있다. 도 2는 일 실시예에 따른 BNN 기반 이미지 학습을 통하여 로드킬을 방지하기 위한 방법을 설명하기 위한 흐름도 이다. 단계 S210에서, 전자 장치는 차량이 주행 중인 도로가 촬영된 적어도 하나의 이미지를 획득할 수 있다. 일 실시예에 따른 전자 장치는 차량에 구비된 카메라를 이용하여 차량 전방의 도로 이미지를 획득할 수 있다. 전자 장치는 기 설정된 주기에 따라 차량 전방의 도로 이미지를 획득할 수도 있고, 다른 예에 따라, 차량이 주 행 중인 지역이 동물이 자주 출몰하는 지역인 경우에만 기 설정된 주기에 따라 차량 전방의 도로 이미지를 획득 할 수도 있다. 단계 S220에서, 전자 장치는 기 설정된 복수의 전처리 기법 중 적어도 하나의 전처리 기법을 이용하여 획득된 적어도 하나의 이미지에 전처리를 수행할 수 있다. 전자 장치는 획득된 복수의 이미지 중 적어도 하나에 전처리를 수행할 수 있다. 예를 들어, 전자 장치는 복수의 이미지 중 적어도 하나의 블러링 또는 샤프닝 등의 전처리를 수행할 수 있다. 단계 S230에서, 전자 장치는 전처리가 수행된 적어도 하나의 이미지를 기초로 BNN 기반의 학습 모델을 이용하여 도로 상에 동물이 존재할 확률 정보를 획득할 수 있다. 전자 장치는 전처리된 이미지의 피쳐들을 BNN 기반의 학습 모델에 입력할 수 있다. BNN 기반의 학습 모델의 가 중치( )에 대한 사후분포 ) 는 입력데이터 , 출력데이터 } 가 주어졌을 때, 하기의 수학식 1과 같이 사전분포 와 우도(likelihood) )에 의해 계산될 수 있다. [수학식 1]"}
{"patent_id": "10-2021-0099283", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "BNN의 경우 신경망의 가중치가 확률분포로 표현되므로, 신경망을 통해 출력된 결과 또한 확률분포로 표현될 수 있다. BNN 기반의 학습 모델의 가중치( )에 대한 사후분포 )는 트레이닝을 통해 미리 설정될 수 있 다. 이 때, 트레이닝을 위한 학습 데이터를 획득하는 방법의 일 실시예에 대해서는 도 3을 참조하여 후술하도록 한다. BNN 기반의 학습 모델에 새로운 데이터 가 입력으로 주어졌을 때, 출력 는 하기의 수학식 2과 같이 사후 예측분포로 표현될 수 있다. 즉, 전술한 단계 S220에서 전처리가 수행된 적어도 하나의 이미지의 피쳐가 일 실 시예에 따른 BNN 기반의 학습 모델의 입력으로 주어졌을 때, 동물 존재 확률인 출력 는 하기의 수학식 2과 같이 사후예측분포로 표현될 수 있다. [수학식 2]"}
{"patent_id": "10-2021-0099283", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "단계 S240에서, 전자 장치는 획득된 확률 정보와 기 설정된 임계값의 비교 결과에 따라 도로 상에 동물이 존재 함을 알리는 알람의 제공 여부를 결정할 수 있다. 알람은 차량의 운전자에게 전방에 동물에 존재함을 알리기 위 한 알람 또는 동물에게 차량이 다가오고 있음을 경고하기 위한 알람 중 적어도 하나를 포함할 수 있다. 일 실시예에 따른 전자 장치는 확률 정보와 기 설정된 임계값을 비교한 결과, 동물이 존재할 확률이 임계값 보 다 큰 경우 알람을 제공할 수 있다. 임계값은 BNN 기반의 학습 모델의 트레이닝 과정을 통해 미리 설정될 수도 있으며, 사용자의 입력 등에 따라 설정될 수도 있다. 도 3은 일 실시예에 따른 전자 장치가 BNN 기반의 학습 모델의 트레이닝을 위한 학습 데이터를 생성하는 방법을 설명하기 위한 도면이다. 도 3을 참조하면, 전자 장치는 도로 이미지와 동물 이미지를 결합하여 복수의 이미지(332, 334, 336, 338)를 획득할 수 있다. 일 실시예에 따른 전자 장치는 도로 이미지 내의 객체를 분석하여, 도로의 윤곽선 및 도로 주변의 지형에 대해 식별할 수 있다. 전자 장치는 식별된 도로의 윤곽선 및 도로 주변의 지형과, 이전에 도로에서 발견된 동물 들의 히스토리 정보를 기반으로, 도로 이미지 내에서 동물이 위치할 수 있는 복수의 스팟(spot)을 결정할 수 있다. 전자 장치는 복수의 스팟 중 하나에 동물 이미지를 오버랩하여 이미지(예를 들어, 332)를 획득할 수 있다. 다른 실시예에 따른 전자 장치는 도로 이미지내의 랜덤한 위치에 동물 이미지를 오버랩하여 이미지 (예를 들어, 338)를 획득할 수도 있다. 전자 장치는 획득한 복수의 이미지(332, 334, 336, 338)의 피쳐를 이용하여 BNN 기반의 학습 모델을 트레이닝함 으로써, 도 2에서 전술한 바와 같이 가중치에 대한 분포를 결정할 수 있다. 도 4는 일 실시예에 따른 전자 장치가 이미지 변환을 통해 BNN 기반의 학습 모델의 트레이닝을 위한 학습 데이 터를 획득하는 방법을 설명하기 위한 도면이다. 도 4를 참조하면, 전자 장치는 이미지를 인위적으로 변환하여 BNN 기반의 학습 모델을 트레이닝하기 위한 다양 한 종류의 데이터를 확보할 수 있다. 이 때, 이미지는 실제 동물이 위치하는 도로를 촬영한 이미지 또는 도 3을 참조하여 전술한 바와 같이 동물 이미지와 도로 이미지를 결합하여 획득한 이미지 중 적어도 하나를 포함할 수 있다. 도 4를 참조하면, 전자 장치는 실제 도로를 촬영한 이미지인 제 1 이미지에 좌우 이동, 상하 이동, 평행 반전, 수직 반전, 회전, 밝기 변환 또는 확대/축소 중 적어도 하나를 적용하여, 변환된 이미지들(422, 424)을 획득할 수 있다. 또한, 전자 장치는 동물 이미지와 도로 이미지를 결합하여 획득한 이미지인 제 2 이미지에 좌우 이동, 상 하 이동, 평행 반전, 수직 반전, 회전, 밝기 변환 또는 확대/축소 중 적어도 하나를 적용하여, 변환된 이미지들 (442, 444)을 획득할 수 있다. 전자 장치는 변환 결과 획득된 이미지들(422, 424, 442, 444)의 피쳐를 이용하여 BNN 기반의 학습 모델을 트레 이닝함으로써, 도 2에서 전술한 바와 같이 가중치에 대한 분포를 결정할 수 있다. 도 5는 일 실시예에 따른 전자 장치에서 수행되는 복수의 전처리 기법들 중 하나인 샤프닝 기법을 설명하기 위 한 도면이다. 도 5를 참조하면, 전자 장치는 제 1a 이미지에 샤프닝을 수행할 수 있다.전자 장치는 제 1a 이미지에 포함된 복수의 픽셀들 각각의 RGB값을 획득할 수 있다. 전자 장치는 RGB 값 각각에 픽셀들 간의 차이를 크게 만 들도록 설정된 샤프닝 필터를 적용하여 영상에 포함된 객체의 경계가 선명해지도록 전처리를 수행할 수 있다. 이미지에 샤프닝 필터를 적용하는 것은 행렬곱 연산 과정을 통해 수행될 수 있다. 예를 들어, 전자 장치가 제 1a 이미지에 샤프닝 필터를 적용한 결과 제 1b 이미지를 획득할 수 있다. 또한, 전자 장치가 샤프닝을 수행하기 위해 적용하는 샤프닝 필터의 값은 이미지가 획득된 촬영 환경에 따라 상 이할 수 있다. 예를 들어, 제 1a 이미지의 경우, 밤에 촬영된 영상으로 조도가 매우 낮은 환경에서 RGB 값 이 획득될 수 있다. 또한, 제 2a 이미지의 경우, 낮에 촬영된 영상으로 상대적으로 조도가 높은 환경에서 RGB 값이 획득될 수 있다. 제 2a 이미지에 비해 제 1a 이미지에서 객체의 식별이 더 어려울 수 있으 므로, 전자 장치는 제 1a 이미지에 적용되는 샤프닝 필터의 가중치 값 간의 차이를 제 2 a 이미지에 적용되는 샤프닝 필터의 가중치 값 간의 차이보다 크게 설정할 수 있다. 즉, 전자 장치는 이미지가 촬영된 환경을 고려하여, 제 1a 이미지에는 제1 샤프닝 필터를 적용하여 제 1b 이미지를 획득할 수 있고, 제 2a 이미지에는 제 2 샤프닝 필터를 적용하여 제 2b 이미지를 획득 할 수 있다. 한편, 샤프닝 이외에도 다른 전처리 기법이 이미지에 적용될 수 있다. 예를 들어, 전자 장치는 픽셀들 간의 값 의 차이를 줄임으로써, 이미지 내의 경계를 부드럽게 만드는 블러링 필터를 이미지에 적용할 수도 있다. 이미지 에 블러링 필터를 적용하는 것은 행렬곱 연산 과정을 통해 수행될 수 있다. 도 6은 일 실시예에 따른 로드킬 방지를 위한 BNN 기반 학습 모델을 설명하기 위한 도면이다. 도 6을 참조하면, 일 실시예에 따른 BNN 기반의 학습 모델은 복수의 레이어 및 복수의 히든 노드들(예를 들어, , )로 구성될 수 있다. BNN 기반의 학습 모델의 경우, 히든 노드들 간에 적용되는 가중치가 특정되는 기존 뉴럴 네트워크 모델과 달리, 가중치의 분포가 결정될 수 있다. BNN 기반의 학습 모델은 이를 통해, 불확실성에 대한 정보를 제공할 수 있다. 학습 모델의 불확실성은 인식론적 불확실성과 내재적 불확실성으로 구분될 수 있다. 인식론적 불확실성은 모델의 학습 파라미터에 의해 발생하는 불확실성이고 추가적인 훈련데이터의 수집을 통해 불확실성을 줄일 수 있다. 내재적 불확실성은 훈련 데이터 자 체에 내재된 이상치나 노이지에 의해 발생하는 불확실성으로 데이터의 전처리를 통해 줄일 수 있다. 일 실시예에 따른 전자 장치는 BNN 기반의 학습 모델의 입력 데이터로 적용되는 이미지의 피쳐들을 변경하거나, 이미지의 피쳐를 추출하기 전 이미지에 적용되는 전처리 기법을 변경해감으로써, 동물 존재 확률 분포를 최적화 할 수 있는 가중치의 분포 및 입력데이터에 적용되는 피체의 종류 등을 결정할 수 있다. 입력데이터에 적용되는 피체의 종류는 동물이 도로에 존재할 확률을 결정하기 위한 지표일 수 있다. 일 실시예에 따른 전자 장치는 결정된 지표에 기초하여, BNN 기반의 학습 모델에 입력되는 피쳐를 업데이트할 수 있다. 도 7은 일 실시예에 따른 전자 장치가 BNN 기반 이미지 학습을 통하여 로드킬을 방지하는 방법을 보다 구체적으 로 설명하기 위한 도면이다. 도 7을 참조하면, 전자 장치는 차량 전방을 촬영한 이미지를 획득할 수 있다. 전자 장치는 획득한 이미지 또는 획득한 이미지를 전처리한 결과 획득된 전처리된 이미지의 피쳐를 BNN 기반 이미지 학습 모델에 입력할 수 있다. 도 7의 일 실시예에서는 피쳐 정보로서, 윤곽선의 형태, 중심점의 위치, 움직임, 이동 궤적에 관한 정보 가 이용될 수 있으나, 이는 일 예일 뿐, 본 개시에 따른 로드킬 방지를 위한 이미지의 피쳐 정보가 전술한 예에 한정되는 것은 아니다. BNN 기반 이미지 학습 모델의 경우, 각 피쳐에 대한 가중치 분포가 획득될 수 있다. 예를 들어, 윤곽선의 형태 를 기초로 판단한 결과, 객체가 동물일 확률은 96%로 Yes이고, 중심점의 위치를 기초로 판단한 결과, 객체가 동 물일 확률은 95%로 Yes일 수 있다. 또한, 움직임을 기초로 판단한 결과, 객체가 동물일 확률은 97%로 NO일 수 있으며, 이동 궤적을 기초로 판단한 결과, 객체가 동물일 확률은 13%로 본 실시예에서는 이동 궤적에 대한 피쳐 는 객체가 동물인지 여부를 판단하는데에 불확실한 피쳐임을 확인할 수 있다. 본 실시예에서 전술된 피쳐들은 이미지 분석에 있어 BoW(Bag of visual Words) 내의 구성 요소로, 학습 과정에 서도 피쳐들을 개별적으로 적용하거나 일괄적으로 적용하는 것이 가능하다. 전자 장치는 BNN 기반 이미지 학습 모델의 최종 출력으로 도로에 80% 확률로 동물이 존재한다는 정보를 획득할 수 있다. 전자 장치는 확률 정보와 기 설정된 임계값을 비교한 결과, 동물이 존재할 확률이 임계값 보다 큰 경 우 알람을 제공할 수 있다. 임계값은 BNN 기반의 학습 모델의 트레이닝 과정을 통해 미리 설정될 수도 있으며, 사용자의 입력 등에 따라 설정될 수도 있다. 도 8은 일 실시예에 따른 전자 장치의 블록도이다. ` 도 8을 참조하면, 전자 장치는 입력부, 프로세서, 출력부 및 메모리를 포함할 수 있 다. 그러나 도시된 구성요소 모두가 필수구성요소인 것은 아니다. 도시된 구성요소보다 많은 구성요소에 의해 전자 장치가 구현될 수도 있고, 그보다 적은 구성요소에 의해서도 전자 장치는 구현될 수 있다. 입력부는, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치의 외부(예: 사용자)로부터 수신할 수 있다. 예를 들어, 입력부는 차량 전방을 촬영한 복수의 이미지를 차량에 구비된 카메라로부터 수신할 수 있다. 프로세서는 통상적으로 전자 장치의 전반적인 동작을 제어할 수 있다. 예를 들어, 프로세서는 메모리에 저장된 프로그램들을 실행함으로써, 도로에 위치하는 객체가 동물인 확률을 결정할 수 있다. 일 실시예에 따른 프로세서는 입력부를 통해 차량이 주행 중인 도로가 촬영된 적어도 하나의 이미지 를 획득할 수 있다. 프로세서는 기 설정된 복수의 전처리 기법 중 적어도 하나의 전처리 기법을 이용하여, 획득된 적어도 하나의 이미지에 전처리를 수행할 수 있다. 예를 들어, 프로세서는 메모리에 저장된 블러링 연산 명령어를 실행하여, 이미지를 구성하는 픽셀들(또는 일정 픽셀들을 그룹핑한 블록들)과 블러링 필 터의 행렬곱 연산을 수행할 수 있다. 다른 예에 따라, 프로세서는 메모리에 저장된 샤프닝 연산 명령 어를 이용하여, 이미지를 구성하는 픽셀들(또는 일정 픽셀들을 그룹핑한 블록들)과 샤프닝 필터의 행렬곱 연산 을 수행할 수도 있다. 프로세서는 전처리가 수행된 적어도 하나의 이미지를 기초로, BNN 기반의 학습 모델을 이용하여, 도로 상 에 동물이 존재할 확률 정보를 획득할 수 있다. 프로세서는 획득된 확률 정보와 기 설정된 임계값의 비교 결과에 따라, 도로 상에 동물이 존재함을 알리는 알람을 출력부를 통해 제공할 수 있다. 일 실시예에 따른 프로세서는 획득된 적어도 하나의 이미지에 블러링 필터 및 샤프닝 필터를 적용할 수 있 다. BNN 기반의 학습 모델은, 도로 상에 동물이 존재하는지 여부의 판단에 기준이 되는 기 설정된 피쳐들의 값 을 입력 노드들의 값으로 적용하며, 입력 노드들과 상기 동물이 존재할 확률 정보가 출력되는 출력 노드는 학습 결과 획득된 가중치의 분포들에 기반하여 값이 획득되는 적어도 하나의 히든 노드들로 연결될 수 있다. 출력부는 프로세서의 결정에 따라, 신호를 출력하는 장치로서 신호는 사운드 형태 또는 이미지 형태 로 출력될 수 있다. 예를 들어, 출력부는 도로에 위치하는 객체가 동물인 것으로 결정된 경우, 동물이 들 을 수 있는 가청 주파수의 신호를 출력할 수 있다. 메모리는 전자 장치가 본 개시에 따른 BNN 기반 이미지 학습을 통하여 로드킬을 방지하는 방법을 수 행하도록 하는 프로그램을 저장할 수 있다. 또한, 메모리는 차량 전방을 촬영한 결과 획득된 복수의 이미 지들을 저장할 수 있다. 메모리는 BNN 기반 학습 모델을 저장할 수 있다. 본 문서에 개시된 다양한 실시예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되 지 않는다. 본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위 해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적 으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 다양한 실시예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함 할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부 가 될 수 있다. 예를 들면, 일실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형 태로 구현될 수 있다. 일실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 본 개시에 따른 인공지능과 관련된 기능은 프로세서와 메모리를 통해 동작된다. 프로세서는 하나 또는 복수의 프로세서로 구성될 수 있다. 또는, 하나 또는 복수의 프로세서가 인공지능 전용 프로세서인 경우, 인공지능 전 용 프로세서는, 특정 인공지능 모델의 처리에 특화된 하드웨어 구조로 설계될 수 있다. 기 정의된 동작 규칙 또는 인공지능 모델은 학습을 통해 만들어진 것을 특징으로 한다. 여기서, 학습을 통해 만 들어진다는 것은, 기본 인공지능 모델이 학습 알고리즘에 의하여 다수의 학습 데이터들을 이용하여 학습됨으로 써, 원하는 특성(또는, 목적)을 수행하도록 설정된 기 정의된 동작 규칙 또는 인공지능 모델이 만들어짐을 의미 한다. 이러한 학습은 본 개시에 따른 인공지능이 수행되는 기기 자체에서 이루어질 수도 있고, 별도의 서버 및/ 또는 시스템을 통해 이루어 질 수도 있다. 학습 알고리즘의 예로는, 지도형 학습(supervised learning), 비지도 형 학습(unsupervised learning), 준지도형 학습(semi-supervised learning) 또는 강화 학습(reinforcement learning)이 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은, 복수의 신경망 레이어들로 구성될 수 있다. 복수의 신경망 레이어들 각각은 복수의 가중치들 (weight values)을 갖고 있으며, 이전(previous) 레이어의 연산 결과와 복수의 가중치들 간의 연산을 통해 신경 망 연산을 수행한다. 복수의 신경망 레이어들이 갖고 있는 복수의 가중치들의 분포는 인공지능 모델의 학습 결 과에 의해 최적화될 수 있다. 예를 들어, 학습 과정 동안 인공지능 모델에서 획득한 로스(loss) 값 또는 코스트 (cost) 값이 감소 또는 최소화되도록 복수의 가중치들의 분포가 갱신될 수 있다. 본 발명에서는 사후 분포(posterior distribution)의 변분 추론(variation interference) 과정 상에 발생한 쿨 백-라이블리 발산(KL-Divergence) 값을 L2 로스(L2 Loss)와 함께 학습 과정 상의 최소화 대상값으로 삼을 수 있 다. 본 발명에 따른 장치는 프로세서, 프로그램 데이터를 저장하고 실행하는 메모리, 디스크 드라이브와 같은 영구 저장부(permanent storage), 외부 장치와 통신하는 통신 포트, 터치 패널, 키(key), 버튼 등과 같은 사용자 인 터페이스 장치 등을 포함할 수 있다. 본 발명에서 인용하는 공개 문헌, 특허 출원, 특허 등을 포함하는 모든 문헌들은 각 인용 문헌이 개별적으로 및 구체적으로 병합하여 나타내는 것 또는 본 발명에서 전체적으로 병합하여 나타낸 것과 동일하게 본 발명에 병합 될 수 있다. 본 발명의 이해를 위하여, 도면에 도시된 바람직한 실시 예들에서 참조 부호를 기재하였으며, 본 발명의 실시 예들을 설명하기 위하여 특정 용어들을 사용하였으나, 특정 용어에 의해 본 발명이 한정되는 것은 아니며, 본 발명은 당업자에 있어서 통상적으로 생각할 수 있는 모든 구성 요소들을 포함할 수 있다. 본 발명은 기능적인 블록 구성들 및 다양한 처리 단계들로 나타내어질 수 있다. 이러한 기능 블록들은 특정 기 능들을 실행하는 다양한 개수의 하드웨어 또는/및 소프트웨어 구성들로 구현될 수 있다. 예를 들어, 본 발명은 하나 이상의 마이크로프로세서들의 제어 또는 다른 제어 장치들에 의해서 다양한 기능들을 실행할 수 있는, 메 모리, 프로세싱, 로직(logic), 룩업 테이블(look-up table) 등과 같은 직접 회로 구성들을 채용할 수 있다. 본 발명에의 구성 요소들이 소프트웨어 프로그래밍 또는 소프트웨어 요소들로 실행될 수 있는 것과 유사하게, 본 발명은 데이터 구조, 프로세스들, 루틴들 또는 다른 프로그래밍 구성들의 조합으로 구현되는 다양한 알고리즘을 포함하여, C, C++, 자바(Java), 어셈블러(assembler) 등과 같은 프로그래밍 또는 스크립팅 언어로 구현될 수 있 다. 기능적인 측면들은 하나 이상의 프로세서들에서 실행되는 알고리즘으로 구현될 수 있다. 또한, 본 발명은 전자적인 환경 설정, 신호 처리, 및/또는 데이터 처리 등을 위하여 종래 기술을 채용할 수 있다. \"매커니즘\", \"요소\", \"수단\", \"구성\"과 같은 용어는 넓게 사용될 수 있으며, 기계적이고 물리적인 구성들로서 한정되는 것은 아니다. 상기 용어는 프로세서 등과 연계하여 소프트웨어의 일련의 처리들(routines)의 의미를 포함할 수 있다. 본 발명에서 설명하는 특정 실행들은 일 실시 예들로서, 어떠한 방법으로도 본 발명의 범위를 한정하는 것은 아 니다. 명세서의 간결함을 위하여, 종래 전자적인 구성들, 제어 시스템들, 소프트웨어, 상기 시스템들의 다른 기능적인 측면들의 기재는 생략될 수 있다. 또한, 도면에 도시된 구성 요소들 간의 선들의 연결 또는 연결 부 재들은 기능적인 연결 및/또는 물리적 또는 회로적 연결들을 예시적으로 나타낸 것으로서, 실제 장치에서는 대 체 가능하거나 추가의 다양한 기능적인 연결, 물리적인 연결, 또는 회로 연결들로서 나타내어질 수 있다. 또한, \"필수적인\", \"중요하게\" 등과 같이 구체적인 언급이 없다면 본 발명의 적용을 위하여 반드시 필요한 구성 요소가 아닐 수 있다. 본 발명의 명세서(특히 특허청구범위에서)에서 \"상기\"의 용어 및 이와 유사한 지시 용어의 사용은 단수 및 복수 모두에 해당하는 것일 수 있다. 또한, 본 발명에서 범위(range)를 기재한 경우 상기 범위에 속하는 개별적인 값을 적용한 발명을 포함하는 것으로서(이에 반하는 기재가 없다면), 발명의 상세한 설명에 상기 범위를 구성하 는 각 개별적인 값을 기재한 것과 같다. 마지막으로, 본 발명에 따른 방법을 구성하는 단계들에 대하여 명백하 게 순서를 기재하거나 반하는 기재가 없다면, 상기 단계들은 적당한 순서로 행해질 수 있다. 반드시 상기 단계 들의 기재 순서에 따라 본 발명이 한정되는 것은 아니다. 본 발명에서 모든 예들 또는 예시적인 용어(예들 들 어, 등등)의 사용은 단순히 본 발명을 상세히 설명하기 위한 것으로서 특허청구범위에 의해 한정되지 않는 이상 상기 예들 또는 예시적인 용어로 인해 본 발명의 범위가 한정되는 것은 아니다. 또한, 당업자는 다양한 수정, 조합 및 변경이 부가된 특허청구범위 또는 그 균등물의 범주 내에서 설계 조건 및 팩터에 따라 구성될 수 있음 을 알 수 있다."}
{"patent_id": "10-2021-0099283", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시예에 따라 차량에서 획득한 도로 이미지를 기초로 로드킬을 방지하기 위한 알람을 제 공하는 기술을 설명하기 위한 개념도이다. 도 2는 일 실시예에 따른 BNN 기반 이미지 학습을 통하여 로드킬을 방지하기 위한 방법을 설명하기 위한 흐름도 이다. 도 3은 일 실시예에 따른 전자 장치가 BNN 기반의 학습 모델의 트레이닝을 위한 학습 데이터를 생성하는 방법을 설명하기 위한 도면이다. 도 4는 일 실시예에 따른 전자 장치가 이미지 변환을 통해 BNN 기반의 학습 모델의 트레이닝을 위한 학습 데이 터를 획득하는 방법을 설명하기 위한 도면이다.도 5는 일 실시예에 따른 전자 장치에서 수행되는 복수의 전처리 기법들 중 하나인 샤프닝 기법을 설명하기 위 한 도면이다. 도 6은 일 실시예에 따른 로드킬 방지를 위한 BNN 기반 학습 모델을 설명하기 위한 도면이다. 도 7은 일 실시예에 따른 전자 장치가 BNN 기반 이미지 학습을 통하여 로드킬을 방지하는 방법을 보다 구체적으 로 설명하기 위한 도면이다. 도 8은 일 실시예에 따른 전자 장치의 블록도이다. `"}
