{"patent_id": "10-2021-0106324", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0029384", "출원번호": "10-2021-0106324", "발명의 명칭": "엔티티 링킹 방법, 장치, 전자 기기 및 기록 매체", "출원인": "베이징 바이두 넷컴 사이언스 앤 테크놀로지 코.,", "발명자": "장, 씨아오빈"}}
{"patent_id": "10-2021-0106324", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "엔티티 링킹 방법에 있어서,검색 텍스트에 대해 엔티티 검출을 실행하여 목표 엔티티를 취득하는 단계;사전에 트레이닝된 문맥 표현 모델을 이용하여 상기 검색 텍스트의 특징 표현을 생성하는 단계; 및상기 검색 텍스트의 특징 표현 및 사전에 취득한 상기 목표 엔티티에 대응하는 각 엔티티 유형의 특징 표현에기반하여, 상기 목표 엔티티를 매칭 정도가 제일 높은 엔티티 유형에 링킹하는 단계;를 포함하는엔티티 링킹 방법."}
{"patent_id": "10-2021-0106324", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 사전에 트레이닝된 문맥 표현 모델을 이용하여 상기 검색 텍스트의 특징 표현을 생성하는 단계의 후에, 또한 상기 검색 텍스트의 특징 표현 및 사전에 취득한 상기 목표 엔티티에 대응하는 각 엔티티 유형의 특징 표현에 기반하여, 상기 목표 엔티티를 매칭 정도가 제일 높은 엔티티 유형에 링킹하는 단계의 전에,사전에 생성한 엔티티 특징 라이브러리에서 상기 목표 엔티티에 대응하는 각 엔티티 유형의 특징 표현을 취득하는 단계;를 더 포함하는엔티티 링킹 방법."}
{"patent_id": "10-2021-0106324", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 사전에 생성한 엔티티 특징 라이브러리에서 상기 목표 엔티티에 대응하는 각 엔티티 유형의 특징 표현을취득하는 단계의 전에,엔티티 표현 모델 및 상기 목표 엔티티의 각 엔티티 유형에 기반하여 상기 목표 엔티티에 대응하는 각 엔티티유형의 특징 표현을 생성하는 단계; 및상기 목표 엔티티에 대응하는 각 엔티티 유형의 특징 표현을 상기 엔티티 특징 라이브러리에 기억하는 단계;를 더 포함하는엔티티 링킹 방법."}
{"patent_id": "10-2021-0106324", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 엔티티 표현 모델 및 상기 목표 엔티티의 각 엔티티 유형에 기반하여 상기 목표 엔티티에 대응하는 각 엔티티 유형의 특징 표현을 생성하는 단계는,상기 목표 엔티티의 각 엔티티 유형 대응하는 복수 개의 트레이닝 샘플 쌍을 수집하는 단계 - 각 상기 트레이닝샘플 쌍은 양성 샘플 및 음성 샘플을 포함하고, 상기 양성 샘플은 엔티티 및 상기 엔티티와 동일한 엔티티 유형에 속하는 양성 샘플 엔티티를 포함하며, 상기 음성 샘플은 상기 엔티티 및 상기 양성 샘플 중의 상기 엔티티와동일한 엔티티 유형에 속하지 않는 음성 샘플 엔티티를 포함함 -; 및공개특허 10-2022-0029384-3-상기 복수 개의 트레이닝 샘플 쌍을 이용하여 상기 엔티티 표현 모델을 트레이닝함으로써, 상기 엔티티 표현 모델에 의해 생성된 상기 양성 샘플에 라벨링된 엔티티 유형의 특징 표현으로 하여금, 상기 양성 샘플 엔티티의특징 표현과 매칭되나, 상기 음성 샘플 엔티티의 특징 표현과는 매칭되지 않도록 하여, 상기 목표 엔티티의 대응하는 엔티티 유형의 특징 표현을 얻는 단계;를 포함하는엔티티 링킹 방법."}
{"patent_id": "10-2021-0106324", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 사전에 트레이닝된 문맥 표현 모델을 이용하여 상기 검색 텍스트의 특징 표현을 생성하는 단계는,상기 검색 텍스트에 대해 단어 분할을 실행하여 복수의 분할 단어를 얻는 단계;상기 복수의 분할 단어에 대해 각각 임베딩 표현을 실행하는 단계; 및임베딩 표현을 실행한 후의 상기 복수의 분할 단어를 상기 문맥 표현 모델에 입력하고, 상기 문맥 표현 모델이출력한 상기 검색 텍스트의 특징 표현을 취득하는 단계;를 포함하는엔티티 링킹 방법."}
{"patent_id": "10-2021-0106324", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 검색 텍스트에 대해 엔티티 검출을 실행하여 목표 엔티티를 취득하는 단계의 후에, 또한 상기 검색 텍스트의 특징 표현 및 사전에 생성한 상기 목표 엔티티에 대응하는 각 엔티티 유형의 특징 표현에 기반하여 상기 목표 엔티티를 매칭 정도가 제일 높은 엔티티 유형에 링킹하는 단계의 전에,상기 목표 엔티티에 대응하는 적어도 2개의 엔티티 유형을 검출하여 결정하는 단계;를 더 포함하는엔티티 링킹 방법."}
{"patent_id": "10-2021-0106324", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항 내지 제6항 중 어느 한 항에 있어서,상기 검색 텍스트에 대해 엔티티 검출을 실행하여 목표 엔티티를 취득하는 단계는,엔티티 인식 모델을 이용하여 상기 검색 텍스트에 대해 엔티티 검출을 실행하여 상기 목표 엔티티를 취득하는단계; 및/또는사전에 생성한 엔티티 사전을 이용하여 상기 검색 텍스트에 대해 엔티티 검출을 실행하여 상기 목표 엔티티를취득하는 단계;를 포함하는엔티티 링킹 방법."}
{"patent_id": "10-2021-0106324", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "엔티티 링킹 장치에 있어서,검색 텍스트에 대해 엔티티 검출을 실행하여 목표 엔티티를 취득하기 위한 검출 모듈;사전에 트레이닝된 문맥 표현 모델을 이용하여 상기 검색 텍스트의 특징 표현을 생성하기 위한 제1 생성 모듈;및상기 검색 텍스트의 특징 표현 및 사전에 취득한 상기 목표 엔티티에 대응하는 각 엔티티 유형의 특징 표현에공개특허 10-2022-0029384-4-기반하여, 상기 목표 엔티티를 매칭 정도가 제일 높은 엔티티 유형에 링킹하기 위한 링킹 모듈;을 구비하는엔티티 링킹 장치."}
{"patent_id": "10-2021-0106324", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,사전에 생성한 엔티티 특징 라이브러리에서 상기 목표 엔티티에 대응하는 각 엔티티 유형의 특징 표현을 취득하기 위한 취득 모듈;을 더 구비하는엔티티 링킹 장치."}
{"patent_id": "10-2021-0106324", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,엔티티 표현 모델 및 상기 목표 엔티티의 각 엔티티 유형에 기반하여 상기 목표 엔티티에 대응하는 각 엔티티유형의 특징 표현을 생성하기 위한 제2 생성 모듈; 및상기 목표 엔티티에 대응하는 각 엔티티 유형의 특징 표현을 상기 엔티티 특징 라이브러리에 기억하기 위한 기억 모듈;을 더 구비하는엔티티 링킹 장치."}
{"patent_id": "10-2021-0106324", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 제2 생성 모듈은,상기 목표 엔티티의 각 엔티티 유형 대응하는 복수 개의 트레이닝 샘플 쌍을 수집하기 위한 수집 유닛 - 각 상기 트레이닝 샘플 쌍은 양성 샘플 및 음성 샘플을 포함하고, 상기 양성 샘플은 엔티티 및 상기 엔티티와 동일한엔티티 유형에 속하는 양성 샘플 엔티티를 포함하며, 상기 음성 샘플은 상기 엔티티 및 상기 양성 샘플 중의 상기 엔티티와 동일한 엔티티 유형에 속하지 않는 음성 샘플 엔티티를 포함함 -; 및상기 복수 개의 트레이닝 샘플 쌍을 이용하여 상기 엔티티 표현 모델을 트레이닝함으로써, 상기 엔티티 표현 모델에 의해 생성된 상기 양성 샘플에 라벨링된 엔티티 유형의 특징 표현으로 하여금, 상기 양성 샘플 엔티티의특징 표현과 매칭되나, 상기 음성 샘플 엔티티의 특징 표현과는 매칭되지 않도록 하여, 상기 목표 엔티티의 대응하는 엔티티 유형의 특징 표현을 얻는 것이 이용되는 트레이닝 유닛;을 구비하는엔티티 링킹 장치."}
{"patent_id": "10-2021-0106324", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제8항에 있어서,상기 제1 생성 모듈은,상기 검색 텍스트에 대해 단어 분할을 실행하여 복수의 분할 단어를 얻기 위한 단어 분할 유닛;상기 복수의 분할 단어에 대해 각각 임베딩 표현을 실행하기 위한 표현 유닛; 및임베딩 표현을 실행한 후의 상기 복수의 분할 단어를 상기 문맥 표현 모델에 입력하고, 상기 문맥 표현 모델이출력한 상기 검색 텍스트의 특징 표현을 취득하기 위한 취득 유닛;을 구비하는공개특허 10-2022-0029384-5-엔티티 링킹 장치."}
{"patent_id": "10-2021-0106324", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제8항에 있어서,상기 검출 모듈은 또한 상기 목표 엔티티에 대응하는 적어도 2개의 엔티티 유형을 검출하여 결정하는엔티티 링킹 장치."}
{"patent_id": "10-2021-0106324", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제8항 내지 제13항 중 어느 한 항에 있어서,상기 검출 모듈은,엔티티 인식 모델을 이용하여 상기 검색 텍스트에 대해 엔티티 검출을 실행하여 상기 목표 엔티티를 취득하고;및/또는사전에 생성한 엔티티 사전을 이용하여 상기 검색 텍스트에 대해 엔티티 검출을 실행하여 상기 목표 엔티티를취득하는엔티티 링킹 장치."}
{"patent_id": "10-2021-0106324", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "전자 기기에 있어서,적어도 하나의 프로세서; 및상기 적어도 하나의 프로세서와 통신 연결된 메모리를 구비하며,상기 메모리에는 상기 적어도 하나의 프로세서에 의해 수행 가능한 명령이 기록되어 있으며, 상기 명령이 상기적어도 하나의 프로세서에 의해 수행되어 상기 적어도 하나의 프로세서로 하여금 제1항 내지 제7항 중 어느 한항에 기재된 방법을 수행하도록 하는전자 기기."}
{"patent_id": "10-2021-0106324", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "컴퓨터 명령이 기록되어 있는 비 일시적 컴퓨터 판독 가능 기록 매체에 있어서,상기 컴퓨터 명령은 상기 컴퓨터로 하여금 제1항 내지 제7항 중 어느 한 항에 기재된 방법을 수행하도록 하는기록 매체."}
{"patent_id": "10-2021-0106324", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "비 일시적 컴퓨터 판독 가능 기록 매체에 기록되어 있는 프로그램에 있어서,상기 프로그램은 상기 컴퓨터로 하여금 제1항 내지 제7항 중 어느 한 항에 기재된 방법을 수행하도록 하는비 일시적 컴퓨터 판독 가능 기록 매체에 기록되어 있는 프로그램."}
{"patent_id": "10-2021-0106324", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 엔티티 링킹 방법, 장치, 전자 기기 및 기록 매체를 개시하는 바, 인공 지능"}
{"patent_id": "10-2021-0106324", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "및 자연 언어 처리 기술 분야에 관한 것이다. 구체적으로 실현 방안은, 검색 텍스트에 대해 엔티티 검출을 실행하여 목표 엔티 티를 취득하는 단계; 사전에 트레이닝된 문맥 표현 모델을 이용하여 상기 검색 텍스트의 특징 표현을 생성하는 단계; 및 상기 검색 텍스트의 특징 표현 및 사전에 취득한 상기 목표 엔티티에 대응하는 각 엔티티 유형의 특징 표현에 기반하여, 상기 목표 엔티티를 매칭 정도가 제일 높은 엔티티 유형에 링킹하는 것을 포함한다. 본 발명은 문맥 표현 모델이 취득한 검색 텍스트의 특징 표현 및 사전에 취득한 각 엔티티 유형의 특징 표현에 기반하여, 관련 정보에 대해 모두 효과적으로 일반화를 실행할 수 있으며, 검색 텍스트의 특징 표현 및 각 엔티티 유형의 특징 표현의 정확성을 보장할 수 있고, 또한 엔티티 링킹의 정확성을 효과적으로 향상시킬 수 있다. 대 표 도 - 도1"}
{"patent_id": "10-2021-0106324", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 2, "content": "공개특허10-2022-0029384 CPC특허분류 G06K 9/6256 (2022.01) G06N 3/0454 (2013.01) G06N 3/08 (2013.01) 발명자 황, 딩방 중국, 베이징 100085, 하이뎬 디스트릭트, 샹디 1 0번가, 넘버 10, 바이두 캠퍼스 2층 루오, 씨이 중국, 베이징 100085, 하이뎬 디스트릭트, 샹디 1 0번가, 넘버 10, 바이두 캠퍼스 2층허, 징저우 중국, 베이징 100085, 하이뎬 디스트릭트, 샹디 1 0번가, 넘버 10, 바이두 캠퍼스 2층명 세 서 청구범위 청구항 1 엔티티 링킹 방법에 있어서, 검색 텍스트에 대해 엔티티 검출을 실행하여 목표 엔티티를 취득하는 단계; 사전에 트레이닝된 문맥 표현 모델을 이용하여 상기 검색 텍스트의 특징 표현을 생성하는 단계; 및 상기 검색 텍스트의 특징 표현 및 사전에 취득한 상기 목표 엔티티에 대응하는 각 엔티티 유형의 특징 표현에 기반하여, 상기 목표 엔티티를 매칭 정도가 제일 높은 엔티티 유형에 링킹하는 단계; 를 포함하는 엔티티 링킹 방법. 청구항 2 제1항에 있어서, 상기 사전에 트레이닝된 문맥 표현 모델을 이용하여 상기 검색 텍스트의 특징 표현을 생성하는 단계의 후에, 또 한 상기 검색 텍스트의 특징 표현 및 사전에 취득한 상기 목표 엔티티에 대응하는 각 엔티티 유형의 특징 표현 에 기반하여, 상기 목표 엔티티를 매칭 정도가 제일 높은 엔티티 유형에 링킹하는 단계의 전에, 사전에 생성한 엔티티 특징 라이브러리에서 상기 목표 엔티티에 대응하는 각 엔티티 유형의 특징 표현을 취득하 는 단계; 를 더 포함하는 엔티티 링킹 방법. 청구항 3 제2항에 있어서, 상기 사전에 생성한 엔티티 특징 라이브러리에서 상기 목표 엔티티에 대응하는 각 엔티티 유형의 특징 표현을 취득하는 단계의 전에, 엔티티 표현 모델 및 상기 목표 엔티티의 각 엔티티 유형에 기반하여 상기 목표 엔티티에 대응하는 각 엔티티 유형의 특징 표현을 생성하는 단계; 및 상기 목표 엔티티에 대응하는 각 엔티티 유형의 특징 표현을 상기 엔티티 특징 라이브러리에 기억하는 단계; 를 더 포함하는 엔티티 링킹 방법. 청구항 4 제3항에 있어서, 상기 엔티티 표현 모델 및 상기 목표 엔티티의 각 엔티티 유형에 기반하여 상기 목표 엔티티에 대응하는 각 엔 티티 유형의 특징 표현을 생성하는 단계는, 상기 목표 엔티티의 각 엔티티 유형 대응하는 복수 개의 트레이닝 샘플 쌍을 수집하는 단계 - 각 상기 트레이닝 샘플 쌍은 양성 샘플 및 음성 샘플을 포함하고, 상기 양성 샘플은 엔티티 및 상기 엔티티와 동일한 엔티티 유형 에 속하는 양성 샘플 엔티티를 포함하며, 상기 음성 샘플은 상기 엔티티 및 상기 양성 샘플 중의 상기 엔티티와 동일한 엔티티 유형에 속하지 않는 음성 샘플 엔티티를 포함함 -; 및상기 복수 개의 트레이닝 샘플 쌍을 이용하여 상기 엔티티 표현 모델을 트레이닝함으로써, 상기 엔티티 표현 모 델에 의해 생성된 상기 양성 샘플에 라벨링된 엔티티 유형의 특징 표현으로 하여금, 상기 양성 샘플 엔티티의 특징 표현과 매칭되나, 상기 음성 샘플 엔티티의 특징 표현과는 매칭되지 않도록 하여, 상기 목표 엔티티의 대 응하는 엔티티 유형의 특징 표현을 얻는 단계; 를 포함하는 엔티티 링킹 방법. 청구항 5 제1항에 있어서, 상기 사전에 트레이닝된 문맥 표현 모델을 이용하여 상기 검색 텍스트의 특징 표현을 생성하는 단계는, 상기 검색 텍스트에 대해 단어 분할을 실행하여 복수의 분할 단어를 얻는 단계; 상기 복수의 분할 단어에 대해 각각 임베딩 표현을 실행하는 단계; 및 임베딩 표현을 실행한 후의 상기 복수의 분할 단어를 상기 문맥 표현 모델에 입력하고, 상기 문맥 표현 모델이 출력한 상기 검색 텍스트의 특징 표현을 취득하는 단계; 를 포함하는 엔티티 링킹 방법. 청구항 6 제1항에 있어서, 상기 검색 텍스트에 대해 엔티티 검출을 실행하여 목표 엔티티를 취득하는 단계의 후에, 또한 상기 검색 텍스트 의 특징 표현 및 사전에 생성한 상기 목표 엔티티에 대응하는 각 엔티티 유형의 특징 표현에 기반하여 상기 목 표 엔티티를 매칭 정도가 제일 높은 엔티티 유형에 링킹하는 단계의 전에, 상기 목표 엔티티에 대응하는 적어도 2개의 엔티티 유형을 검출하여 결정하는 단계; 를 더 포함하는 엔티티 링킹 방법. 청구항 7 제1항 내지 제6항 중 어느 한 항에 있어서, 상기 검색 텍스트에 대해 엔티티 검출을 실행하여 목표 엔티티를 취득하는 단계는, 엔티티 인식 모델을 이용하여 상기 검색 텍스트에 대해 엔티티 검출을 실행하여 상기 목표 엔티티를 취득하는 단계; 및/또는 사전에 생성한 엔티티 사전을 이용하여 상기 검색 텍스트에 대해 엔티티 검출을 실행하여 상기 목표 엔티티를 취득하는 단계; 를 포함하는 엔티티 링킹 방법. 청구항 8 엔티티 링킹 장치에 있어서, 검색 텍스트에 대해 엔티티 검출을 실행하여 목표 엔티티를 취득하기 위한 검출 모듈; 사전에 트레이닝된 문맥 표현 모델을 이용하여 상기 검색 텍스트의 특징 표현을 생성하기 위한 제1 생성 모듈; 및 상기 검색 텍스트의 특징 표현 및 사전에 취득한 상기 목표 엔티티에 대응하는 각 엔티티 유형의 특징 표현에기반하여, 상기 목표 엔티티를 매칭 정도가 제일 높은 엔티티 유형에 링킹하기 위한 링킹 모듈; 을 구비하는 엔티티 링킹 장치. 청구항 9 제8항에 있어서, 사전에 생성한 엔티티 특징 라이브러리에서 상기 목표 엔티티에 대응하는 각 엔티티 유형의 특징 표현을 취득하 기 위한 취득 모듈; 을 더 구비하는 엔티티 링킹 장치. 청구항 10 제9항에 있어서, 엔티티 표현 모델 및 상기 목표 엔티티의 각 엔티티 유형에 기반하여 상기 목표 엔티티에 대응하는 각 엔티티 유형의 특징 표현을 생성하기 위한 제2 생성 모듈; 및 상기 목표 엔티티에 대응하는 각 엔티티 유형의 특징 표현을 상기 엔티티 특징 라이브러리에 기억하기 위한 기 억 모듈; 을 더 구비하는 엔티티 링킹 장치. 청구항 11 제10항에 있어서, 상기 제2 생성 모듈은, 상기 목표 엔티티의 각 엔티티 유형 대응하는 복수 개의 트레이닝 샘플 쌍을 수집하기 위한 수집 유닛 - 각 상 기 트레이닝 샘플 쌍은 양성 샘플 및 음성 샘플을 포함하고, 상기 양성 샘플은 엔티티 및 상기 엔티티와 동일한 엔티티 유형에 속하는 양성 샘플 엔티티를 포함하며, 상기 음성 샘플은 상기 엔티티 및 상기 양성 샘플 중의 상 기 엔티티와 동일한 엔티티 유형에 속하지 않는 음성 샘플 엔티티를 포함함 -; 및 상기 복수 개의 트레이닝 샘플 쌍을 이용하여 상기 엔티티 표현 모델을 트레이닝함으로써, 상기 엔티티 표현 모 델에 의해 생성된 상기 양성 샘플에 라벨링된 엔티티 유형의 특징 표현으로 하여금, 상기 양성 샘플 엔티티의 특징 표현과 매칭되나, 상기 음성 샘플 엔티티의 특징 표현과는 매칭되지 않도록 하여, 상기 목표 엔티티의 대 응하는 엔티티 유형의 특징 표현을 얻는 것이 이용되는 트레이닝 유닛; 을 구비하는 엔티티 링킹 장치. 청구항 12 제8항에 있어서, 상기 제1 생성 모듈은, 상기 검색 텍스트에 대해 단어 분할을 실행하여 복수의 분할 단어를 얻기 위한 단어 분할 유닛; 상기 복수의 분할 단어에 대해 각각 임베딩 표현을 실행하기 위한 표현 유닛; 및 임베딩 표현을 실행한 후의 상기 복수의 분할 단어를 상기 문맥 표현 모델에 입력하고, 상기 문맥 표현 모델이 출력한 상기 검색 텍스트의 특징 표현을 취득하기 위한 취득 유닛; 을 구비하는엔티티 링킹 장치. 청구항 13 제8항에 있어서, 상기 검출 모듈은 또한 상기 목표 엔티티에 대응하는 적어도 2개의 엔티티 유형을 검출하여 결정하는 엔티티 링킹 장치. 청구항 14 제8항 내지 제13항 중 어느 한 항에 있어서, 상기 검출 모듈은, 엔티티 인식 모델을 이용하여 상기 검색 텍스트에 대해 엔티티 검출을 실행하여 상기 목표 엔티티를 취득하고; 및/또는 사전에 생성한 엔티티 사전을 이용하여 상기 검색 텍스트에 대해 엔티티 검출을 실행하여 상기 목표 엔티티를 취득하는 엔티티 링킹 장치. 청구항 15 전자 기기에 있어서, 적어도 하나의 프로세서; 및 상기 적어도 하나의 프로세서와 통신 연결된 메모리를 구비하며, 상기 메모리에는 상기 적어도 하나의 프로세서에 의해 수행 가능한 명령이 기록되어 있으며, 상기 명령이 상기 적어도 하나의 프로세서에 의해 수행되어 상기 적어도 하나의 프로세서로 하여금 제1항 내지 제7항 중 어느 한 항에 기재된 방법을 수행하도록 하는 전자 기기. 청구항 16 컴퓨터 명령이 기록되어 있는 비 일시적 컴퓨터 판독 가능 기록 매체에 있어서, 상기 컴퓨터 명령은 상기 컴퓨터로 하여금 제1항 내지 제7항 중 어느 한 항에 기재된 방법을 수행하도록 하는 기록 매체. 청구항 17 비 일시적 컴퓨터 판독 가능 기록 매체에 기록되어 있는 프로그램에 있어서, 상기 프로그램은 상기 컴퓨터로 하여금 제1항 내지 제7항 중 어느 한 항에 기재된 방법을 수행하도록 하는 비 일시적 컴퓨터 판독 가능 기록 매체에 기록되어 있는 프로그램. 발명의 설명 기 술 분 야 본 발명은 컴퓨터 기술 분야에 관한 것인 바, 특히 인공 지능 기술 분야 및 자연 언어 처리 기술 분야에 관한 것이며, 구체적으로는 엔티티 링킹 방법, 장치, 전자 기기 및 기록 매체에 관한 것이다."}
{"patent_id": "10-2021-0106324", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "자연 언어 처리(Natural Language Processing; NLP)에 있어서, 엔티티 명 인식(Named Entity Recognition; NER)은 정보 추출의 하나의 서브 태스크에 속한다. 한 단락의 구조화되지 않은 텍스트가 주어진 경우, NER의 목 적은 당해 텍스트 중의 엔티티의 위치 및 속하는 유형을 결정하는 것이다. 엔티티 링킹(Entity Linking; EL)은 NER 중의 중요한 부분인 바, EL는 텍스트 중의 목표 엔티티 단어를 유일하 고 구체적인 엔티티에 링킹하는 하나의 태스크이다. 어느 정도에 있어서, EL가 실현하는 것은 모호성 제거 태스 크인 바, 모호성 제거의 주요 기반은 문맥 언어 환경 및 서로 다른 엔티티 사이의 매칭 정도이다. 예를 들면 단 지 “사과”란 단어가 주어질 경우에는 엔티티의 모호성 제거를 실행할 수 없으나, “사과를 먹다(eat an apple)” 또는 “사과 핸드폰(apple phone)”이 주어질 경우에는 전자가 과일에 대응하는 엔티티를 의미하고, 후자가 브랜드에 대응하는 엔티티를 의미함을 판단할 수 있다. 종래의 엔티티 링킹 기술은 주요하게 사전에 각 엔티티 유형의 엔티티에 관련된 일부 공통 표현 특징을 수동으로 추출한 후, 텍스트 중의 엔티티의 문맥에 기반 하여, 각 엔티티 유형의 엔티티의 공통 표현 특징과 매칭하여 점수를 매긴다. 마지막으로 점수가 제일 높은 유 형의 엔티티를 엔티티 링킹 결과로 선택한다. 그러나, 종래의 엔티티 링킹 방법은, 각 유형의 엔티티에 관련된 일부 공통 표현 특징에 대해 문자의 표면상의 뜻의 특징 정보만을 추출하였기에, 효과적인 일반화를 실행하지 못하여, 엔티티 링킹의 정확성이 저하된다."}
{"patent_id": "10-2021-0106324", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상기 기술 문제를 해결하기 위하여, 본 발명은 엔티티 링킹 방법, 장치, 전자 기기 및 기록 매체를 제공한다."}
{"patent_id": "10-2021-0106324", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 측면에 있어서, 엔티티 링킹 방법을 제공하는 바, 여기서, 상기 방법은, 검색 텍스트에 대해 엔티티 검출을 실행하여 목표 엔티티를 취득하는 단계; 사전에 트레이닝된 문맥 표현 모델을 이용하여 상기 검색 텍스트의 특징 표현을 생성하는 단계; 및 상기 검색 텍스트의 특징 표현 및 사전에 취득한 상기 목표 엔티티에 대응하는 각 엔티티 유형의 특징 표현에 기반하여, 상기 목표 엔티티를 매칭 정도가 제일 높은 엔티티 유형에 링킹하는 단계를 포함한다. 본 발명의 다른 일 측면에 있어서, 엔티티 링킹 장치를 제공하는 바, 여기서, 상기 장치는, 검색 텍스트에 대해 엔티티 검출을 실행하여 목표 엔티티를 취득하기 위한 검출 모듈; 사전에 트레이닝된 문맥 표현 모델을 이용하여 상기 검색 텍스트의 특징 표현을 생성하기 위한 제1 생성 모듈; 및 상기 검색 텍스트의 특징 표현 및 사전에 취득한 상기 목표 엔티티에 대응하는 각 엔티티 유형의 특징 표현에 기반하여, 상기 목표 엔티티를 매칭 정도가 제일 높은 엔티티 유형에 링킹하기 위한 링킹 모듈을 구비한다. 본 발명의 또 다른 일 측면에 있어서, 전자 기기를 제공하는 바, 당해 전자 기기는, 적어도 하나의 프로세서; 및 상기 적어도 하나의 프로세서와 통신 연결된 메모리를 구비하며, 상기 메모리에는 상기 적어도 하나의 프로세서에 의해 수행 가능한 명령이 기록되어 있으며, 상기 명령이 상기 적어도 하나의 프로세서에 의해 수행되어 상기 적어도 하나의 프로세서로 하여금 상기의 방법을 실행하도록 한 다. 본 발명의 기타 측면에 있어서, 컴퓨터 명령이 기록되어 있는 비 일시적 컴퓨터 판독 가능 기록 매체를 제공하 는 바, 상기 컴퓨터 명령은 상기 컴퓨터로 하여금 상기의 방법을 실행하도록 한다."}
{"patent_id": "10-2021-0106324", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 기술에 따르면, 문맥 표현 모델이 취득한 검색 텍스트의 특징 표현 및 사전에 취득한 각 엔티티 유형 의 특징 표현에 기반하여, 관련 정보에 대해 모두 효과적으로 일반화를 실행할 수 있으며, 검색 텍스트의 특징 표현 및 각 엔티티 유형의 특징 표현의 정확성을 보장할 수 있고, 또한 엔티티 링킹의 정확성을 효과적으로 향 상시킬 수 있다. 여기에 설명된 내용은 본 발명의 실시예의 키 포인트 또는 중요한 특징을 나타냄을 의도하지 않으며, 본 발명의 범위를 한정하려는 것도 아님을 이해해야 한다. 본 발명의 기타 특징은 아래의 명세서를 통해 이해가 용이해질 것이다."}
{"patent_id": "10-2021-0106324", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 도면을 참조하여 본 발명의 시범적인 실시예를 설명하는 바, 본 발명에 대한 이해를 돕기 위해 여기에는 본 발명 실시예의 다양한 세부 사항이 포함되며, 이러한 세부 사항을 단지 시범적인 것으로 간주해야 할 것이다. 따라서, 당업자는 본 발명의 범위 및 정신을 벗어나지 않는 전제 하에서, 여기서 설명되는 실시예에 대 해 다양한 변경 및 수정을 수행할 수 있음을 인식해야 한다. 마찬가지로, 명확성 및 간결성을 위하여 이하의 설 명에서는 잘 알려진 기능 및 구조의 설명을 생략하였다. 도 1은 본 발명에 따른 제1 실시예의 모식도이다. 도 1에 나타낸 바와 같이, 본 실시예는 엔티티 링킹 방법을 제공하는 바, 상기 방법은 이하의 단계를 포함한다. S101에 있어서, 검색 텍스트에 대해 엔티티 검출을 실행하여 목표 엔티티를 취득한다. S102에 있어서, 사전에 트레이닝된 문맥 표현 모델을 이용하여 검색 텍스트의 특징 표현을 생성한다. S103에 있어서, 검색 텍스트의 특징 표현 및 사전에 취득한 목표 엔티티에 대응하는 각 엔티티 유형의 특징 표 현에 기반하여, 목표 엔티티를 매칭 정도가 제일 높은 엔티티 유형에 링킹한다. 본 실시예의 엔티티 링킹 방법의 수행 주체는 엔티티 링킹 장치이며, 당해 장치는 전자 엔티티이다. 또는 소프 트웨어 통합을 이용한 응용 프로그램일 수 있는 바, 사용 시 컴퓨터 디바이스에서 운행되어, 검색 텍스트 중의 엔티티에 대한 링킹을 구현한다. 본 실시예의 검색 텍스트는 사용자에 의해 입력된 검색(query)일 수 있으며, 당해 검색(query)은 하나 또는 복 수의 목표 엔티티를 포함할 수 있다. 본 실시예의 방식을 채용하여, 당해 검색 텍스트 중의 각각의 목표 엔티티 를 정확한 엔티티 유형에 링킹할 수 있다. 구체적으로, 본 실시예에 있어서, 우선 검색 텍스트에 대해 엔티티 검출을 실행하여 검색 텍스트 중의 모든 가 능한 목표 엔티티를 검출한다. 또한 본 실시예에 있어서, 사전에 트레이닝된 문맥 표현 모델에 기반하여 당해 검색 텍스트의 특징 표현을 생성할 수도 있는 바, 예를 들면 당해 검색 텍스트의 특징 표현은 벡터의 형식을 이 용하여 표현할 수 있다. 선택적으로, 사전에 엔티티 사전이 수집되어 있을 수 있으며, 당해 엔티티 사전에는 각 엔티티에 대응하는 각 엔티티 유형이 라벨링되어 있다. 예를 들면, 엔티티 라이브러리에 사과의 대응하는 엔티티 유형은 과일 및 전자 제품이 있는 것으로 기록되어 있을 수 있다. 또한 예를 들면, 어느 인물 A에 대응하는 엔티티 유형은 스타, 기 업가 등 서로 다른 엔티티 유형이 있는 것으로 기록되어 있을 수 있다. 본 실시예에 있어서, 동일한 엔티티의 각 엔티티 유형의 특징 표현을 사전에 취득할 수 있다. 이어서, 검색 텍스트의 특징 표현 및 목표 엔티티에 대 응하는 각 엔티티 유형의 특징 표현에 기반하여, 당해 목표 엔티티에 대응하는 각 엔티티 유형 중에서 매칭 정도가 제일 높은 엔티티 유형을 결정하며, 따라서 당해 목표 엔티티를 당해 매칭도가 제일 높은 엔티티 유형에 링킹함으로써, 모호성 제거를 실현한다. 본 실시예의 엔티티 링킹 방법은, 검색 텍스트에 대해 엔티티 검출을 실행하여 목표 엔티티를 취득하고, 사전에 트레이닝된 문맥 표현 모델을 이용하여 검색 텍스트의 특징 표현을 생성하며, 검색 텍스트의 특징 표현 및 사전 에 취득한 목표 엔티티에 대응하는 각 엔티티 유형의 특징 표현에 기반하여 목표 엔티티를 매칭 정도가 제일 높 은 엔티티 유형에 링킹한다. 따라서, 종래 기술과 비교하면, 본 실시예에 있어서, 문맥 표현 모델이 취득한 검 색 텍스트의 특징 표현 및 사전에 취득한 각 엔티티 유형의 특징 표현에 기반하여, 관련 정보에 대해 모두 효과 적으로 일반화를 실행할 수 있으며, 검색 텍스트의 특징 표현 및 각 엔티티 유형의 특징 표현의 정확성을 보장 할 수 있고, 또한 엔티티 링킹의 정확성을 효과적으로 향상시킬 수 있다. 도 2는 본 발명에 따른 제2 실시예의 모식도이다. 도 2에 나타낸 바와 같이, 본 실시예의 엔티티 링킹 방법은 상기 도 1에 나타낸 실시예의 기술안의 기초 상에서, 본 발명의 기술안을 더 상세하게 설명한다. 도 2에 나타낸 바와 같이, 본 실시예의 엔티티 링킹 방법은 구체적으로 아래의 단계를 포함할 수 있다. S201에 있어서, 사전에 트레이닝된 엔티티 인식 모델 및 사전에 생성한 엔티티 사전을 이용하여 검색 텍스트에 대해 엔티티 검출을 실행하여 적어도 하나의 목표 엔티티를 취득한다. 본 실시예에 있어서, 엔티티 인식 모델 및 사전에 생성한 엔티티 사전과 같은 두 가지 방식을 동시에 채용하여 검색 텍스트 중의 엔티티를 검출한다. 실제 응용에 있어서, 그 중의 하나를 선택하여 검색 텍스트 중의 엔티티 를 검출할 수도 있다. 본 실시예의 엔티티 인식 모델은 검색 텍스트 중의 모든 목표 엔티티를 검출할 수 있다. 당해 엔티티 인식 모델 을 트레이닝할 때, 사전에 복수 개의 트레이닝 텍스트를 수집하여, 각각의 트레이닝 텍스트 중의 목표 엔티티를 라벨링할 수 있다. 각 트레이닝 텍스트를 엔티티 인식 모델에 입력하며, 당해 엔티티 인식 모델에 의해 당해 트 레이닝 텍스트 중의 목표 엔티티를 예측할 수 있다. 예측 결과가 라벨링된 것과 일치하지 않을 경우, 엔티티 인 식 모델의 매개 변수를 조정한 후, 연속적인 복수 회의 트레이닝에서 예측 결과와 라벨링 결과가 언제나 일치하 게 될 때까지, 다음의 하나의 트레이닝 텍스트를 이용하여 계속하여 상기 방식에 따라 트레이닝을 실행하며, 이 때 엔티티 인식 모델의 매개 변수를 결정할 수 있으며, 또한 엔티티 인식 모델을 결정하여, 트레이닝을 종료할 수 있다. 본 실시예에 있어서, 트레이닝할 때 수집하는 복수 개의 트레이닝 텍스트의 수량은 수백만에 이를 수 있으며, 트레이닝 텍스트의 수량이 많을수록, 트레이닝된 엔티티 인식 모델이 더 정확하다. 엔티티 인식 모델을 이용하여 검색 텍스트에 대해 엔티티 검출을 실행할 경우, 당해 검색 텍스트를 당해 엔티티 인식 모델에 입력할 수 있으며, 당해 엔티티 인식 모델은 당해 검색 텍스트 중의 모든 가능한 목표 엔티티를 예 측하여 출력할 수 있다. 본 실시예의 엔티티 인식 모델은 Bi-LSTM-CRF 와 같은 시퀀스 라벨링 모델을 이용하여 구현할 수 있음을 설명할 필요가 있다. 또한, 본 실시예에 있어서, 또한 사전에 엔티티 사전을 생성할 필요가 있다. 구체적으로, 다양한 방식을 통해 각 엔티티 및 각각의 엔티티에 대응하는 모든 엔티티 유형을 수집하여, 엔티티 사전에 기록할 수 있다. 구체적 으로 검출할 경우, 우선 검색 텍스트에 대해 단어 분할을 실행한 후, 엔티티 사전을 이용하여 각 분할 단어가 엔티티 사전에 존재하는지 여부를 검출할 수 있다. 존재할 경우, 당해 분할 단어를 하나의 목표 엔티티로 결정 할 수 있다. 당해 방식을 통해 검색 텍스트 중의 각각의 가능한 목표 엔티티를 검출할 수도 있다. 실제 응용에 있어서, 엔티티 인식 모델을 이용하여 검색 텍스트에 대해 엔티티 검출을 실행하는 방식 및 엔티티 사전을 이용하여 검색 텍스트에 대해 엔티티 검출을 실행하는 검출 방식이 서로 다르기 때문에, 검출 결과도 서 로 다를 수 있다. 본 실시예에 있어서, 검색 텍스트 중의 가능한 한 전면적인 목표 엔티티를 취득하기 위하여, 두 가지 방식을 통해 검출한 목표 엔티티를 얻는 예를 든다. 실제 응용에 있어서, 그 중에서 하나를 선택하여, 하나의 방식만을 통해 엔티티 검출을 수행하여, 해당하는 목표 엔티티를 얻을 수 있다. S202에 있어서, 각 목표 엔티티가 적어도 2개의 엔티티 유형에 대응하는지 여부를 검출하며, 적어도 2개의 엔티 티 유형에 대응하지 않을 경우, 목표 엔티티를 대응하는 엔티티 유형에 링킹하고, 적어도 2개의 엔티티 유형에 대응할 경우, S203을 수행한다. 본 실시예의 엔티티 사전에 기록된 엔티티는 사람 이름, 지명 또는 물체 이름 등일 수 있다. 또한 엔티티 사전 중의 일부 엔티티는 하나의 엔티티 유형만이 존재할 수 있으나, 다른 일부 엔티티는 두 가지 심지어 두 가지 이상의 엔티티 유형이 존재할 수 있다. 하나의 엔티티 유형만이 존재하는 엔티티의 경우, 해당하는 모호성 제거 태스크가 존재하지 않으므로, 이 경우에는 대응하는 목표 엔티티를 대응하는 엔티티 유형에 링킹하기만 하면 된 다. 한편, 적어도 2개의 엔티티 유형이 존재하는 목표 엔티티의 경우에는, 엔티티 링킹 처리를 실행하여, 당해 목표 엔티티를 정확한 엔티티 유형에 링킹할 필요가 있다. S203에 있어서, 검색 텍스트에 대해 단어 분할을 실행하여 복수의 분할 단어를 얻는다. 선택적으로, 본 실시예의 단어 분할 입도는 글자의 입도일 수도 있고, 단어의 입도일 수도 있다. S204에 있어서, 복수의 분할 단어에 대해 각각 임베딩 표현을 실행한다. S205에 있어서, 임베딩 표현을 실행한 후의 복수의 분할 단어를 사전에 트레이닝된 문맥 표현 모델에 입력하고, 문맥 표현 모델이 출력한 검색 텍스트의 특징 표현을 취득한다. 본 실시예의 특징 표현은 벡터의 형식을 채용하여 표현할 수 있다. 본 실시예의 문맥 표현 모델도 사전에 트레이닝된 것이다. 본 실시예의 문맥 표현 모델을 트레이닝할 때, 당해 검색 텍스트 중의 목표 엔티티 및 대응하는 엔티티 유형을 참고하여 함께 트레이닝할 필요가 있음을 설명할 필 요가 있다. 예를 들면, 사전에 복수 개의 트레이닝 텍스트를 수집하고, 트레이닝 텍스트 중의 목표 엔티티 및 목표 엔티티 의 트레이닝 텍스트에서 라벨링된 엔티티 유형을 라벨링하며, 또한 당해 목표 엔티티의 당해 엔티티 유형의 특 징 표현을 취득한다. 트레이닝할 때, 각 트레이닝 텍스트를 상기 방식에 따라 단어 분할 및 임베딩 표현을 실행 한 후 문맥 표현 모델에 입력한다. 문맥 표현 모델이 당해 트레이닝 텍스트의 특징 표현을 예측하여 출력한다. 이어서 트레이닝 텍스트의 특징 표현 및 트레이닝 텍스트 중의 당해 목표 엔티티의 대응하는 엔티티 유형의 특 징 표현에 기반하여, 문맥 표현 모델의 매개 변수를 조정한다. 예를 들면, 트레이닝 텍스트 중의 당해 목표 엔 티티가 당해 트레이닝 텍스트의 일부에 속하기에, 당해 트레이닝 텍스트 중의 당해 목표 엔티티의 대응하는 엔 티티 유형의 특징 표현은 이론 상에서 당해 트레이닝 텍스트의 특징 표현과 일정한 유사도를 가지게 되며, 예를 들면 2개의 벡터의 유사도가 일정한 유사도 임계 값보다 클 수 있다. 트레이닝할 때, 당해 유사도 임계 값보다 작으면, 당해 문맥 표현 모델의 매개 변수를 조정함으로써, 당해 트레이닝 텍스트의 특징 표현과 트레이닝 텍스 트 중의 당해 목표 엔티티의 대응하는 엔티티 유형의 특징 표현 사이의 유사도가 충분히 크도록 하는 바, 당해 유사도 임계 값보다 크도록 한다. 연속적인 소정의 횟수의 트레이닝에서 트레이닝 텍스트의 특징 표현과 트레이 닝 텍스트 중의 당해 목표 엔티티의 대응하는 엔티티 유형의 특징 표현 사이의 유사도가 언제나 당해 유사도 임 계 값보다 충분히 클 때까지, 복수 개의 트레이닝 텍스트 및 취득한 트레이닝 텍스트 중의 목표 엔티티의 대응 하는 엔티티 유형의 특징 표현에 기반하여, 상기 방식에 따라 계속하여 문맥 표현 모델에 대해 트레이닝을 실행 한다. 이때 트레이닝 종료하여, 문맥 표현 모델의 매개 변수를 결정하고, 또한 문맥 표현 모델을 결정할 수 있 다. 마찬가지로, 트레이닝할 때 수집하는 복수 개의 트레이닝 텍스트의 수량은 수백만에 이를 수 있으며, 트레이닝 텍스트의 수량이 많을수록, 트레이닝된 엔티티 인식 모델이 더 정확하다. 상기 단계 S203-S205는 상기 도 1에 나타낸 실시예의 단계 S102의 일종 실현 방식이다. S206에 있어서, 사전에 생성한 엔티티 특징 라이브러리에서 당해 목표 엔티티에 대응하는 각 엔티티 유형의 특 징 표현을 취득한다. 본 실시예에 있어서, 당해 단계 S206 전에 아래의 단계를 더 포함할 수 있음을 설명할 필요가 있다. (a1)엔티티 표현 모델 및 목표 엔티티의 각 엔티티 유형에 기반하여 목표 엔티티에 대응하는 각 엔티티 유형의 특징 표현을 생성한다. (b1)목표 엔티티에 대응하는 각 엔티티 유형의 특징 표현을 엔티티 특징 라이브러리에 기억한다. 여기서 단계 (a1)를 구체적으로 실현할 때 아래의 단계를 더 포함할 수 있다. (a2)목표 엔티티의 각 엔티티 유형 대응하는 복수 개의 트레이닝 샘플 쌍을 수집하되, 각 트레이닝 샘플 쌍은 양성 샘플 및 음성 샘플을 포함하고, 양성 샘플은 엔티티 및 엔티티와 동일한 엔티티 유형에 속하는 양성 샘플 엔티티를 포함하며, 음성 샘플은 엔티티 및 양성 샘플 중의 엔티티와 동일한 엔티티 유형에 속하지 않는 음성 샘플 엔티티를 포함한다.(b2)복수 개의 트레이닝 샘플 쌍을 이용하여 엔티티 표현 모델을 트레이닝함으로써, 엔티티 표현 모델에 의해 생성된 상기 양성 샘플에 라벨링된 엔티티 유형의 특징 표현으로 하여금, 양성 샘플 엔티티의 특징 표현과 매칭 되나, 상기 음성 샘플 엔티티의 특징 표현과는 매칭되지 않도록 하여, 상기 목표 엔티티의 대응하는 엔티티 유 형의 특징 표현을 얻는다. 예를 들면, 도 3은 본 실시예에 의해 제공되는 노드 이성질체의 다이어그램이다. 도 3에 나타낸 바와 같이, 이 성질체의 다이어그램은 동일한 엔티티의 두 가지 엔티티 유형의 노드를 포함하는 바, 예를 들면 엔티티_사과_과 일 및 엔티티_사과_브랜드를 포함한다. 엔티티_사과_과일을 지향할 경우, 당해 엔티티 유형에 관련된 문맥 단어 에 대응하는 노드는 홍부사, 배 및 과일을 포함할 수 있다. 엔티티_사과_브랜드를 지향할 경우, 당해 엔티티 유 형에 관련된 문맥 단어에 대응하는 노드는 iphone, 핸드폰 및 잡스를 포함할 수 있다. 즉 엔티티에 관련된 문맥 단어에 대응하는 노드 및 당해 엔티티에 대응하는 노드는 대응하는 에지 연결을 갖게 된다. 엔티티 표현 모델의 목적은 하나의 엔티티의 특징 표현 즉 시맨틱 벡터 표현을 학습하여, 엔티티에 관련된 문맥 시맨틱을 엔티티의 벡터 표현 중에 임베딩하려는데 있다. 하나의 자연스러운 아이디어는 직접 word2vec의 BOW 모델을 적용하는 것 이다. 즉 각각의 문맥의 일반 단어로 엔티티 벡터를 예측하는 것이다. 하지만, 이러한 모델 구조는 너무 간단하 다. 그러나, 그래프 컨볼 루션 신경망 (Graph Convolutional Network; GCN)은 이러한 태스크에 매우 적합하며, 또한 컨볼 루션 커널의 매개 변수 공유를 통해, 시맨틱이 더 풍부한 엔티티 벡터 표현을 학습할 수 있다. 따라 서, 본 실시예에 있어서, 구체적으로 GCN을 채용하여 당해 엔티티 표현 모델을 실현할 수 있다. 구체적으로 트레이닝할 때, 각 목표 엔티티에 대해, 당해 목표 엔티티의 각 엔티티 유형 대응하는 복수 개의 트 레이닝 샘플 쌍을 수집할 수 있다. 여기서 각 트레이닝 샘플 쌍은 양성 샘플 및 음성 샘플을 포함하고, 양성 샘 플은 엔티티 및 엔티티와 동일한 엔티티 유형에 속하는 양성 샘플 엔티티를 포함하며, 음성 샘플은 엔티티 및 양성 샘플 중의 엔티티와 동일한 엔티티 유형에 속하지 않는 음성 샘플 엔티티를 포함한다. 예를 들면 엔티티_ 사과_과일의 특징 표현을 생성할 때, 수집한 양성 샘플이 사과 및 과일 또는 사과 및 바나나를 포함할 수 있으 며, 또는 사과 및 배 등의 과일과 같은 양성 샘플 엔티티를 포함할 수도 있다. 반면에, 대응하는 음성 샘플은 사과 및 핸드폰 또는 사과 및 의류를 포함할 수 있으며, 또는 사과 및 과일에 관련된 것 이외의 기타 임의의 음 성 샘플 엔티티를 포함할 수도 있다. 이어서 양성 샘플 중의 엔티티, 양성 샘플 엔티티 및 음성 샘플 엔티티를 엔티티 표현 모델에 각각 입력한다. 당해 엔티티 표현 모델은 엔티티, 양성 샘플 엔티티 및 음성 샘플 엔티티의 각각의 특징 표현을 각각 예측하여 출력할 수 있다. 엔티티와 양성 샘플 엔티티는 동일한 엔티티 유형에 속하나, 엔티티와 음성 샘플 엔티티는 서로 다른 엔티티 유형에 속하므로, 본 실시예의 트레이닝 목적은, 엔티 티 표현 모델이 생성한 양성 샘플에 라벨링된 엔티티 유형의 특징 표현이, 양성 샘플 엔티티의 특징과 매칭되나, 음성 샘플 엔티티의 특징 표현과는 매칭되지 않도록 하는데 있다. 본 실시예의 매칭됨은, 유사도가 제1 소정의 유사도 임계 값보다 큰 경우를 의미할 수 있는 바, 예를 들면 제1 소정의 유사도 임계 값은 80%, 85% 또는 50%보다 큰 기타 백분비일 수 있다. 반면에 매칭되지 않음은, 유사도가 제2 유사도 임계 값보다 작은 경우를 의미할 수 있는 바, 예를 들면 제2 소정의 유사도 임계 값은 50%, 45% 또는 50%보다 작은 기타 백분비일 수 있다. 엔티티 표현 모델이 출력한 엔티티, 양성 샘플 엔티티 및 음성 샘플 엔티티의 각각의 특징 표현이 상 기 조건을 충족시키지 않으면, 엔티티 표현 모델의 매개 변수를 조정함으로써, 상기 조건을 충족시키도록 할 수 있다. 연속적인 소정의 횟수의 트레이닝에서 언제나 상기 조건을 충족시킬 때까지, 당해 엔티티 유형의 대응하 는 복수 개의 트레이닝 샘플 쌍을 이용하여, 상기 방식에 따라 계속하여 당해 엔티티 표현 모델에 대해 트레이 닝을 실행한다. 이때 당해 엔티티 표현 모델이 생성한 당해 엔티티 유형의 특징 표현을 얻을 수 있다. 당해 방 식에 따르면, 각 목표 엔티티의 각 엔티티 유형 특징 표현을 얻을 수 있다. 이어서 각 목표 엔티티의 각 엔티티 유형 특징 표현을 엔티티 특징 라이브러리에 기억한다. 당해 방식을 채용하여 생성한 각 목표 엔티티의 각 엔티 티 유형 특징 표현은, 일반화 능력이 뛰어나며, 각 엔티티 유형의 정보를 정확하게 표현할 수 있다. 사용 시, 당해 엔티티 및 엔티티 유형에 기반하여 대응하는 엔티티 유형의 특징 표현을 취득하기만 하면 되기에, 사용이 매우 편리하다. S207에 있어서, 검색 텍스트의 특징 표현 및 사전에 취득한 목표 엔티티에 대응하는 각 엔티티 유형의 특징 표 현에 기반하여, 검색 텍스트의 특징 표현과 목표 엔티티에 대응하는 각 엔티티 유형의 특징 표현 사이의 매칭도 점수를 계산한다. S208에 있어서, 목표 엔티티를 매칭도 점수가 제일 높은 엔티티 유형에 링킹한다. 구체적으로, 검색 텍스트의 특징 표현에 대해 각각 당해 목표 엔티티의 각 엔티티 유형의 특징 표현과의 유사도 를 계산하며, 얻은 유사도 값을 검색 텍스트의 특징 표현과 목표 엔티티에 대응하는 엔티티 유형의 특징 표현사이의 매칭도 점수로 설정한다. 유사도 값이 높을수록, 매칭도 점수가 더 높으며, 당해 검색 텍스트와 목표 엔 티티의 당해 엔티티 유형 사이의 매칭도가 더 높은 것을 나타낸다. 반대의 경우도 마찬가지이다. 이에 기반하여, 당해 목표 엔티티의 적어도 2개의 엔티티 유형 중에서 매칭도 점수가 제일 높은 엔티티 유형을 취득 하여, 최후의 모호성 제거 및 링킹의 결과로 설정할 수 있다. 또한 최종적으로 당해 목표 엔티티를 취득한 매칭 도 점수가 제일 높은 엔티티 유형에 링킹할 수 있다. 단계 S207-S208은 상기 도 1에 나타낸 실시예의 단계 S103의 일종 실현 방식이다. 본 실시예의 엔티티 링킹 방법에 따르면, 특징 표현의 방식을 채용하여 관련 정보를 표현하기에, 더 나은 일반 화 효과를 얻을 수 있다. 엔티티 링킹의 과정에서, 목표 엔티티의 특징 표현이 문맥과 매칭되는 바, 종래 기술 의 공통 표현 특징을 이용하는 방법을 포기함으로써, 더 정확한 매칭 효과를 얻을 수 있으며, 엔티티 링킹의 정 확성을 효과적으로 향상시킬 수 있다. 또한 따라서 종래 기술과 비교하면, 본 실시예에 있어서, 신경망 모델로 대량의 특징 추출 공정을 대체하였기에, 전반적인 공정이 성능상 이점을 가지며, 또한 리소스 소비도 상당히 최 적화될 것이다. 또한, 전체 과정이 수동으로 개입하는 특징 공정 및 규칙에 의존하지 않기에, 대량의 규칙 및 수동으로 설계하는 특징 공정의 유지를 피면하였으며, 엔티티 링킹 기술의 사용의 지능성 및 실용성을 효과적으 로 향상시킬 수 있다. 도 4는 본 발명에 따른 제3 실시예의 모식도이다. 도 4에 나타낸 바와 같이, 본 실시예는 엔티티 링킹 장치 을 제공하는 바, 당해 장치는, 검색 텍스트에 대해 엔티티 검출을 실행하여 목표 엔티티를 취득하기 위한 검출 모듈; 사전에 트레이닝된 문맥 표현 모델을 이용하여 검색 텍스트의 특징 표현을 생성하기 위한 제1 생성 모듈; 및 검색 텍스트의 특징 표현 및 사전에 취득한 목표 엔티티에 대응하는 각 엔티티 유형의 특징 표현에 기반하여, 목표 엔티티를 매칭 정도가 제일 높은 엔티티 유형에 링킹하기 위한 링킹 모듈을 구비한다. 본 실시예의 엔티티 링킹 장치는, 상기 모듈을 이용하여 엔티티 링킹의 실현 원리 및 기술 효과를 실현하 는 바, 상기 관련 방법의 실시예의 실현과 동일하므로, 상세한 내용은 상기 관련 방법의 실시예의 기재를 참고 할 수 있으므로, 여기서 반복적으로 설명하지 않는다. 도 5는 본 발명에 따른 제4 실시예의 모식도이다. 도 5에 나타낸 바와 같이, 본 실시예의 엔티티 링킹 장치 에 대해, 상기 도 4에 나타낸 실시예의 기술안의 기초 상에서 본 발명의 기술안을 더 상세히 설명한다. 도 5에 나타낸 바와 같이, 본 실시예의 엔티티 링킹 장치는, 사전에 생성한 엔티티 특징 라이브러리에서 목표 엔티티에 대응하는 각 엔티티 유형의 특징 표현을 취득하기 위 한 취득 모듈을 더 구비한다. 또한 선택적으로, 도 5에 나타낸 바와 같이, 본 실시예의 엔티티 링킹 장치는, 엔티티 표현 모델 및 목표 엔티티의 각 엔티티 유형에 기반하여 목표 엔티티에 대응하는 각 엔티티 유형의 특징 표현을 생성하기 위한 제2 생성 모듈; 목표 엔티티에 대응하는 각 엔티티 유형의 특징 표현을 엔티티 특징 라이브러리에 기억하기 위한 기억 모듈 을 더 구비한다. 또한 선택적으로, 도 5에 나타낸 바와 같이, 제2 생성 모듈은, 목표 엔티티의 각 엔티티 유형 대응하는 복수 개의 트레이닝 샘플 쌍을 수집하기 위한 수집 유닛 - 각 트 레이닝 샘플 쌍은 양성 샘플 및 음성 샘플을 포함하고, 양성 샘플은 엔티티 및 엔티티와 동일한 엔티티 유형에 속하는 양성 샘플 엔티티를 포함하며, 음성 샘플은 엔티티 및 양성 샘플 중의 엔티티와 동일한 엔티티 유형에 속하지 않는 음성 샘플 엔티티를 포함함 -; 및 복수 개의 트레이닝 샘플 쌍을 이용하여 엔티티 표현 모델을 트레이닝함으로써, 엔티티 표현 모델에 의해 생성 된 양성 샘플에 라벨링된 엔티티 유형의 특징 표현으로 하여금, 양성 샘플 엔티티의 특징 표현과 매칭되나, 음 성 샘플 엔티티의 특징 표현과는 매칭되지 않도록 하여, 상기 목표 엔티티의 대응하는 엔티티 유형의 특징 표현 을 얻는 것이 이용되는 트레이닝 유닛을 구비한다.또한 선택적으로, 도 5에 나타낸 바와 같이, 제1 생성 모듈은, 검색 텍스트에 대해 단어 분할을 실행하여 복수의 분할 단어를 얻기 위한 단어 분할 유닛; 복수의 분할 단어에 대해 각각 임베딩 표현을 실행하기 위한 표현 유닛; 및 임베딩 표현을 실행한 후의 복수의 분할 단어를 문맥 표현 모델에 입력하고, 문맥 표현 모델이 출력한 검색 텍 스트의 특징 표현을 취득하기 위한 취득 유닛을 구비한다. 또한 선택적으로, 검출 모듈은 또한 목표 엔티티에 대응하는 적어도 2개의 엔티티 유형을 검출하여 결정한 다. 또한 선택적으로, 검출 모듈은, 엔티티 인식 모델을 이용하여 검색 텍스트에 대해 엔티티 검출을 실행하여 목표 엔티티를 취득하고; 및/또는 사전에 생성한 엔티티 사전을 이용하여 검색 텍스트에 대해 엔티티 검출을 실행하여 목표 엔티티를 취득한다. 본 실시예의 엔티티 링킹 장치는 상기 모듈을 이용하여 엔티티 링킹의 실현 원리 및 기술 효과를 실현하는 바, 상기 관련 방법의 실시예의 실현과 동일하므로, 상세한 내용은 상기 관련 방법의 실시예의 기재를 참고할 수 있으므로, 여기서 반복적으로 설명하지 않는다. 본 발명의 실시예에 따르면, 본 발명은 전자 기기 및 판독 가능 기록 매체를 더 제공한다. 도 6은 본 발명에 따른 실시예의 엔티티 링킹 방법을 실현하는 전자 기기의 블럭도이다. 전자 기기는 예를 들면 랩톱 컴퓨터, 데스크톱 컴퓨터, 워크 스테이션, 개인 디지털 보조기, 서버, 블레이드 서버, 대형 컴퓨터 및 기 타 적합한 컴퓨터와 같은 다양한 형태의 디지털 컴퓨터를 나타낸다. 전자 기기는 또한 예를 들면 개인 디지털 처리기, 셀폰, 스마트 전화, 웨어러블 기기 및 기타 유사한 계산 장치와 같은 다양한 형태의 모바일 장치를 나 타낼 수 있다. 본 명세서에 나타낸 구성 요소, 이들의 연결과 관계 및 이들의 기능은 단지 예일 뿐이며, 본 명 세서에서 설명하거나 및/또는 요구하는 본 발명의 실현을 한정하려는 것이 아니다. 도 6에 나타낸 바와 같이, 당해 전자 기기는 하나 또는 복수의 프로세서, 메모리 및 각 구성 요소를 연결하기 위한 인터페이스를 구비하며, 당해 인터페이스는 고속 인터페이스 및 저속 인터페이스를 포함한다. 각 구성 요소는 서로 다른 버스를 통해 상호 연결되며, 공통 마더 보드에 설치되거나 또는 수요에 따라 기타 방식 으로 설치된다. 프로세서 전자 기기 내에서 수행되는 명령에 대해 처리를 실행할 수 있으며, 메모리 내에 기억 되어 외부 입력/출력 장치 (예를 들면 인터페이스에 연결된 디스플레이 기기) 상에 GUI의 그래픽 정보를 표시하 기 위한 명령을 포함한다. 기타 실시 방식에 있어서, 필요할 경우, 복수의 프로세서 및/또는 복수의 버스와 복 수의 메모리를 함께 사용할 수 있다. 마찬가지로, 복수의 전자 기기를 연결할 수 있으며, 각 기기는 부분적인 필요한 조작 (예를 들면, 서버 어레이, 일 그룹의 블레이드 서버, 또는 다중 프로세서 시스템)을 제공한다. 도 6에서는 하나의 프로세서의 예를 들었다. 메모리는 본 발명에 의해 제공되는 비 일시적 컴퓨터 판독 가능 기억 매체이다. 여기서, 상기 메모리에는 적어도 하나의 프로세서에 의해 수행 가능한 명령이 기억되어 있으며, 상기 적어도 하나의 프로세서로 하여금 본 발명에 의해 제공되는 엔티티 링킹 방법을 수행하도록 한다. 본 발명의 비 일시적 컴퓨터 판독 가능 기억 매 체는 컴퓨터 명령을 기억하며, 당해 컴퓨터 명령은 컴퓨터로 하여금 본 발명에 의해 제공되는 엔티티 링킹 방법 을 수행하도록 한다. 메모리는 일종의 비 일시적 컴퓨터 판독 가능 기억 매체로서, 비 일시적 소프트웨어 프로그램을 기억하는 데 사용될 수 있는 바, 예를 들면 비 일시적 컴퓨터 수행 가능 프로그램 및 모듈, 본 발명 실시예 중의 엔티티 링킹 방법 대응하는 프로그램 명령/모듈 (예를 들면, 도 4 및 도 5에 나타낸 관련 모듈)을 기억하는데 사용될 수 있다. 프로세서는 메모리 내에 기억된 비 일시적 소프트웨어 프로그램, 명령 및 모듈을 운행함으 로써, 서버의 다양한 기능 응용 및 데이터 처리를 수행하는 바, 즉 상술한 방법 실시예 중의 엔티티 링킹 방법 을 실현한다. 메모리는 프로그램 기억 영역 및 데이터 기억 영역을 포함할 수 있으며, 여기서, 프로그램 기억 영역은 운 영 체제 및 적어도 하나의 기능에 필요한 응용 프로그램을 기억할 수 있고, 데이터 기억 영역은 엔티티 링킹 방 법을 실현하는 전자 기기의 사용을 통해 생성된 데이터 등을 기억할 수 있다. 또한, 메모리는 고속 랜덤 액세스 메모리를 포함할 수 있고, 비 일시적 메모리를 더 포함할 수 있는 바, 예를 들면 적어도 하나의 자기 디 스크 저장 장치, 플래시 장치, 또는 기타 비 일시적 고체 저장 장치를 포함할 수 있다. 일부 실시예에 있어서,메모리는 선택적으로 프로세서에 대해 원격 설치한 메모리를 포함할 수 있으며, 이러한 원격 메모리 는 네트워크를 통해 엔티티 링킹 방법을 실현하는 전자 기기에 연결될 수 있다. 상술한 네트워크의 실예는 인터 넷, 기업 인트라 넷, 근거리 통신망, 이동 통신 네트워크 및 이들의 조합을 포함하나 이에 한정되지 않는다. 엔티티 링킹 방법을 실현하는 전자 기기는 입력 장치 및 출력 장치를 더 포함할 수 있다. 프로세서 , 메모리, 입력 장치 및 출력 장치는 버스 또는 기타 방식을 통해 연결될 수 있으며, 도 6 에서는 버스를 통해 연결하는 예를 들었다. 입력 장치는 입력된 디지털 또는 문자 정보를 수신하고, 또한 엔티티 링킹 방법을 실현하는 전자 기기의 사용자 설정 및 기능 제어에 관한 키 신호 입력을 생성할 수 있다. 예를 들면 터치 스크린, 키패드, 마우스, 트 랙 패드, 터치 패드, 포인팅 스틱, 하나 또는 복수의 마우스 버튼, 트랙볼, 조이스틱 등 입력 장치를 포함할 수 있다. 출력 장치는 디스플레이 기기, 보조 조명 장치 (예를 들면 LED) 및 촉각 피드백 장치 (예를 들면 진 동 모터) 등을 포함할 수 있다. 당해 디스플레이 기기는 액정 디스플레이 (LCD), 발광 다이오드 (LED) 디스플레 이 및 등 플라즈마 디스플레이를 포함할 수 있으나 이에 한정되지 않는다. 일부 실시 방식에 있어서, 디스플레 이 기기는 터치 스크린일 수 있다. 여기서 설명하는 시스템 및 기술의 다양한 실시 방식은 디지털 전자 회로 시스템, 집적 회로 시스템, 전용 ASIC(전용 집적 회로), 컴퓨터 하드웨어, 펌웨어, 소프트웨어 및/또는 이들의 조합에서 실현될 수 있다. 이러한 다양한 실시예는 하나 또는 복수의 컴퓨터 프로그램에서 실시되고, 당해 하나 또는 복수의 컴퓨터 프로그램은 적어도 하나의 프로그램 가능 프로세서를 포함하는 프로그램 가능 시스템 상에서 수행 및/또는 해석될 수 있으 며, 당해 프로그램 가능 프로세서는 전용 또는 일반 프로그램 가능 프로세서일 수 있고, 기억 시스템, 적어도 하나의 입력 장치 및 적어도 하나의 출력 장치로부터 데이터 및 명령을 수신할 수 있으며, 또한 데이터 및 명령 을 당해 기억 시스템, 당해 적어도 하나의 입력 장치 및 당해 적어도 하나의 출력 장치에 전송할 수 있다. 이러한 계산 프로그램 (프로그램, 소프트웨어, 소프트웨어 응용 또는 코드로도 불림)은 프로그램 가능 프로세서 의 기계 명령을 포함하며, 또한 고급 과정 및/또는 객체 지향 프로그래밍 언어 및/또는 어셈블리/기계 언어를 이용하여 이러한 계산 프로그램을 실시할 수 있다. 본 명세서에서 사용되는 “기계 판독 가능 매체” 및 “컴퓨 터 판독 가능 매체”와 같은 용어는, 기계 명령 및/또는 데이터를 프로그램 가능 프로세서의 임의의 컴퓨터 프 로그램 제품, 기기 및/또는 장치 (예를 들면, 자기 디스크, 광 디스크, 메모리, 프로그램 가능 논리 장치 (PLD))에 제공하기 위한 것을 의미하며, 기계 판독 가능 신호로서의 기계 명령을 수신하는 기계 판독 가능 매체 를 포함한다. “기계 판독 가능 신호”와 같은 용어는 기계 명령 및/또는 데이터를 프로그램 가능 프로세서에 제공하기 위한 임의의 신호를 의미한다. 유저와의 대화를 제공하기 위하여, 컴퓨터 상에서 여기서 설명하는 시스템 및 기술을 실시할 수 있으며, 당해 컴퓨터는 유저에게 정보를 표시하기 위한 디스플레이 장치 (예를 들면 CRT (음극선관) 또는 LCD (액정 디스플레 이) 모니터) 및 키보드와 포인팅 장치(예를 들면, 마우스 또는 트랙볼)를 구비할 수 있으며, 유저는 당해 키보 드 및 당해 포인팅 장치를 통해 입력을 컴퓨터에 제공할 수 있다. 기타 유형의 장치는 또한 유저와의 대화를 제 공하는데 사용될 수 있다. 예를 들면, 유저에 제공하는 피드백은 임의의 형태의 감각 피드백 (예를 들면, 시각 적 피드백, 청각적 피드백, 또는 촉각 피드백)일 수 있으며, 또한 임의의 형태(음향 입력, 음성 입력 또는 촉각 입력을 포함함)를 통해 유저로부터의 입력을 수신할 수 있다. 여기서 설명하는 시스템 및 기술을 백엔드 구성 요소를 포함하는 계산 시스템 (예를 들면 데이터 서버), 또는 미들웨어 구성 요소를 포함하는 계산 시스템 (예를 들면 응용 서버), 또는 프런트 엔드 구성 요소를 포함하는 계산 시스템 (예를 들면 그래픽 유저 인터페이스 또는 웹 브라우저를 구비하는 유저 컴퓨터인 바, 유저는 당해 그래픽 유저 인터페이스 또는 당해 웹 브라우저를 통해 여기서 설명하는 시스템 및 기술의 실시 방식과 대화 함), 또는 이러한 백엔드 구성 요소, 미들웨어 구성 요소, 또는 프런트 엔드 구성 요소의 임의의 조합을 포함하 는 계산 시스템에서 실시할 수 있다. 임의의 형태 또는 매체의 디지털 데이터 통신 (예를 들면, 통신 네트워 크)을 통해 시스템의 구성 요소를 상호 연결할 수 있다. 통신 네트워크의 예는 근거리 통신망 (LAN), 광역 통신 망 (WAN) 및 인터넷을 포함한다. 컴퓨터 시스템은 클라이언트 및 서버를 포함할 수 있다. 클라이언트와 서버는 일반적으로 서로 멀리 떨어져 있 고, 또한 일반적으로 통신 네트워크를 통해 대화를 실행한다. 해당되는 컴퓨터 상에서 운행되고, 또한 클라이언 트 - 서버 관계를 갖는 컴퓨터 프로그램을 통해 클라이언트와 서버의 관계를 발생시킬 수 있다. 본 발명의 실시예의 기술안에 따르면, 검색 텍스트에 대해 엔티티 검출을 실행하여 목표 엔티티를 취득하고, 사 전에 트레이닝된 문맥 표현 모델을 이용하여 검색 텍스트의 특징 표현을 생성하며, 검색 텍스트의 특징 표현 및 사전에 취득한 목표 엔티티에 대응하는 각 엔티티 유형의 특징 표현에 기반하여 목표 엔티티를 매칭 정도가 제 일 높은 엔티티 유형에 링킹한다. 따라서, 종래 기술과 비교하면, 본 실시예에 있어서, 문맥 표현 모델이 취득 한 검색 텍스트의 특징 표현 및 사전에 취득한 각 엔티티 유형의 특징 표현에 기반하여, 관련 정보에 대해 모두 효과적으로 일반화를 실행할 수 있으며, 검색 텍스트의 특징 표현 및 각 엔티티 유형의 특징 표현의 정확성을 보장할 수 있고, 또한 엔티티 링킹의 정확성을 효과적으로 향상시킬 수 있다. 본 발명의 실시예의 기술안에 따르면, 특징 표현의 방식을 채용하여 관련 정보를 표현하기에, 더 나은 일반화 효과를 얻을 수 있다. 엔티티 링킹의 과정에서, 목표 엔티티의 특징 표현이 문맥과 매칭되는 바, 종래 기술의 공통 표현 특징을 이용하는 방법을 포기함으로써, 더 정확한 매칭 효과를 얻을 수 있으며, 엔티티 링킹의 정확 성을 효과적으로 향상시킬 수 있다. 또한 따라서 종래 기술과 비교하면, 본 실시예에 있어서, 신경망 모델로 대 량의 특징 추출 흐름을 대체하였기에, 전반적인 흐름이 성능상 이점을 가지며, 또한 리소스 소비도 상당히 최적 화될 것이다. 또한, 전체 과정이 수동으로 개입하는 특징 공정 및 규칙에 의존하지 않기에, 대량의 규칙 및 수 동으로 설계하는 특징 공정의 유지를 피면하였으며, 엔티티 링킹 기술의 사용의 지능성 및 실용성을 효과적으로 향상시킬 수 있다. 상기에 나타낸 다양한 형태의 흐름을 이용하여 것을 재정열, 증가 또는 삭제할 수 있음을 이해해야 한다. 예를 들면, 본 발명에 기재된 각 것은 병열로 수행되거나 또는 차례로 수행되거나 또는 다른 순서로 수행될 수 있으 며, 본 발명이 개시하는 기술안이 원하는 결과를 실현할 수 있는 한, 본 명세서는 이에 대해 한정하지 않는다. 상술한 구체적인 실시 방식은 본 발명의 보호 범위를 한정하지 않는다. 당업자는 설계 요건 및 기타 요인에 따 라 다양한 수정, 조합, 서브 조합 및 대체를 실행할 수 있음을 이해해야 한다. 본 발명의 정신 및 원칙 내에서 이루어진 임의의 수정 동등한 대체 및 개선 등은 모두 본 발명의 보호 범위 내에 포함되어야 한다."}
{"patent_id": "10-2021-0106324", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도면은 본 방안을 더 잘 이해하도록 하기 위한 것이며, 본 발명에 대한 한정을 이루지 않는다. 도 1은 본 발명에 따른 제1 실시예의 모식도이다. 도 2는 본 발명에 따른 제2 실시예의 모식도이다. 도 3은 본 실시예에 의해 제공되는 노드 이성질체의 다이어그램이다. 도 4는 본 발명에 따른 제3 실시예의 모식도이다. 도 5는 본 발명에 따른 제4 실시예의 모식도이다. 도 6은 본 발명은 실시예를 실현하기 위한 엔티티 링킹 방법의 전자 기기의 블럭도이다."}
