{"patent_id": "10-2019-0036841", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0114683", "출원번호": "10-2019-0036841", "발명의 명칭": "블록체인 기반의 전자 시스템을 이용한 신뢰성 있는 광고 및 사용자 보상 방법", "출원인": "신경태", "발명자": "신경태"}}
{"patent_id": "10-2019-0036841", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "블록체인 기반의 전자 시스템을 이용한 신뢰성 있는 광고 및 사용자 보상 방법에 있어서,상기 전자 시스템의 제1 전자 장치를 통해 게시자로부터 수신되는 토큰들을 상기 전자 시스템에 예치하는 단계;상기 게시자의 상기 토큰들을 수신함에 기초하여, 상기 게시자에 의해 작성되는 게시물을 상기 전자 시스템의제2 전자 장치를 통해 사용자에게 제공하는 단계; 및상기 사용자가 상기 제공된 게시물을 열람하고 배분 조건이 충족되는 경우, 상기 예치된 토큰들의 일부분을 상기 사용자에게 배분하는 단계를 포함하는 방법."}
{"patent_id": "10-2019-0036841", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 게시자에 의해 작성되는 상기 게시물은 광고를 포함하는 방법."}
{"patent_id": "10-2019-0036841", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 게시자에 의해 작성되는 상기 게시물이 게시 조건을 충족시키지 못하는 경우, 상기 제2 전자 장치를 통해수신되는 상기 사용자의 요청에 응답하여, 상기 전자 시스템 상에 상기 게시물이 게시되지 않도록 상기 게시물을 차단하는 단계를 더 포함하는 방법."}
{"patent_id": "10-2019-0036841", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 제2 전자 장치를 통해 수신되는 상기 사용자의 응답에 기초하여, 상기 게시자에 의해 작성되는 상기 게시물이 상기 전자 시스템 상에 게시되도록 허용할 것인지 결정하는 단계를 더 포함하는 방법."}
{"patent_id": "10-2019-0036841", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 게시물이 상기 전자 시스템 상에 게시되도록 허용되는 경우:상기 배분 조건은 상기 사용자의 상기 응답이 상기 게시물의 게시에 찬성함을 지시하는 경우에 충족되고; 그리고상기 사용자에게 배분되는 토큰들은 상기 예치된 토큰들의 상기 일부분 및 상기 게시물의 게시에 반대한 다른사용자에 의해 예치된 토큰들 중 적어도 하나로부터 기인하는 방법."}
{"patent_id": "10-2019-0036841", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4항에 있어서,상기 게시물이 상기 전자 시스템 상에 게시되도록 허용되지 않는 경우:상기 배분 조건은 상기 사용자의 상기 응답이 상기 게시물의 게시에 반대함을 지시하는 경우에 충족되고;상기 사용자에게 배분되는 토큰들은 상기 게시물이 게시되도록 허용할 것인지 결정하기 위한 챌린지를 요청한다른 사용자에 의해 예치된 토큰들 및 상기 게시물의 게시에 찬성한 또 다른 사용자에 의해 예치된 토큰들 중적어도 하나로부터 기인하고; 그리고상기 예치된 토큰들의 적어도 일부에 대응하는 양의 토큰들은 상기 게시자에게 반환되는 방법.공개특허 10-2020-0114683-3-청구항 7 블록체인 기반의 전자 시스템을 이용한 신뢰성 있는 광고 및 사용자 보상 방법에 있어서,상기 전자 시스템 상에서 관리자에 의해 제공되는 오픈채팅방과 관련하여, 상기 전자 시스템의 제1 전자 장치를통해 게시자로부터 수신되는 토큰들을 상기 오픈채팅방을 위해 또는 상기 관리자에 대해 예치하는 단계;상기 게시자의 상기 토큰들을 예치함에 기초하여, 상기 오픈채팅방과 관련하여, 상기 게시자에 의해 작성되는게시물을 상기 전자 시스템의 제2 전자 장치를 통해 상기 오픈채팅방의 사용자에게 제공하는 단계; 및상기 사용자가 상기 제공된 게시물을 열람하고 상기 사용자와 관련되는 배분 조건이 충족되는 경우, 상기 예치된 토큰들의 일부분을 상기 사용자에게 배분하는 단계를 포함하는 방법."}
{"patent_id": "10-2019-0036841", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 오픈채팅방을 위해 예치되는 토큰들의 양이 증가할수록, 상기 오픈채팅방이 더 높은 우선순위로 사용자들에게 보여지는 방법."}
{"patent_id": "10-2019-0036841", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서,상기 배분 조건은 상기 사용자가 개인 정보 및 관심 분야를 상기 게시자에게 공개하였는지 및 상기 오픈채팅방에 대한 상기 사용자의 기여도가 기준치보다 큰지 중 적어도 하나에 기초하여 충족되거나 충족되지 않는 방법."}
{"patent_id": "10-2019-0036841", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제7항에 있어서,상기 사용자와 관련하여 상기 게시자에게 공개되는 정보의 양이 증가할수록, 상기 사용자에게 배분되는 토큰들의 양이 증가하는 방법."}
{"patent_id": "10-2019-0036841", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "블록체인 기반의 전자 시스템을 이용한 신뢰성 있는 광고 및 사용자 보상 방법은, 전자 시스템의 제1 전자 장치 를 통해 게시자로부터 수신되는 토큰들을 전자 시스템에 예치하는 단계, 게시자의 토큰들을 수신함에 기초하여, 게시자에 의해 작성되는 게시물을 전자 시스템의 제2 전자 장치를 통해 사용자에게 제공하는 단계, 및 사용자가 게시물을 열람하고 배분 조건이 충족되는 경우, 전자 시스템에 예치된 토큰들의 일부분을 사용자에게 배분하는 단계를 포함한다."}
{"patent_id": "10-2019-0036841", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 블록체인을 기반으로 하여 구성되는 전자 시스템을 이용한 신뢰성 있는 광고 방법 및 사용자 보상 방 법에 관한 것이다."}
{"patent_id": "10-2019-0036841", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "다양한 상품이 생산되고 유통됨에 따라, 효율적인 광고는 상품의 판매를 유도하는 데에 중요한 수단이 되었다. 근래, 온라인 공간 및 모바일 기기를 통한 활동들이 보편화되었고, 이에 따라 온라인/모바일 광고 역시 주요 마 케팅 수단으로서 다루어지고 있다. 그러나, 부정 클릭, 부정 다운로드 등과 같은 부정 광고는 온라인 마케팅 비 용의 증가를 야기하여 광고자 및 수요자에게 피해를 줄 수 있고 광고의 신뢰도를 저하시킬 수 있다. 한편, 온라인 공간 상에서, 개인 정보가 쉽게 공개될 수 있다. 개인 정보는 개인별 맞춤형 광고를 가능하게 하 기 위해 이용될 수 있지만, 수요자는 사생활 침해 등에 기인하여 위협을 받을 수 있다. 이처럼, 다양한 광고가 발행되고 있는 환경에서, 신뢰성 있는 광고, 사생활 보호, 효율적인 마케팅 등과 같은 요인들을 주의 깊게 다루 어야 할 필요가 있다. 블록체인은 체인 구조로 연결되는 블록들의 형태로 복수의 컴퓨팅 장치에 분산 및 복제된 데이터를 저장하기 위 한 기법이다. 블록체인 기법은 중앙집중형 서버에만 데이터를 저장하는 대신 체인 구조에 액세스하는 모든 사용 자들에게 데이터를 공개하기 위해 이용된다. 블록체인 기법은 정보 공유에 기초하여 데이터 위조 또는 변조를 방지할 수 있다. 따라서, 블록체인 기법은 다양한 위협이 존재하는 온라인/모바일 환경에서 유익하게 채용될 수 있다."}
{"patent_id": "10-2019-0036841", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "본원의 배경이 되는 기술은 대한민국 공개특허 제10-2018-0069356호에 개시되어 있다. 발명의 내용"}
{"patent_id": "10-2019-0036841", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 신뢰성 있는 광고 및 사용자 보상을 제공하기 위해 온라인/모바일 환경에서 블록체인 기반의 전자 시 스템을 이용하는 실시 예들을 제공할 수 있다."}
{"patent_id": "10-2019-0036841", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "몇몇 실시 예에서, 블록체인 기반의 전자 시스템을 이용한 신뢰성 있는 광고 및 사용자 보상 방법은, 전자 시스 템의 제1 전자 장치를 통해 게시자로부터 수신되는 토큰들을 전자 시스템에 예치하는 단계, 게시자의 토큰들을 수신함에 기초하여, 게시자에 의해 작성되는 게시물을 전자 시스템의 제2 전자 장치를 통해 사용자에게 제공하 는 단계, 및 사용자가 게시물을 열람하고 배분 조건이 충족되는 경우, 전자 시스템에 예치된 토큰들의 일부분을 사용자에게 배분하는 단계를 포함할 수 있다."}
{"patent_id": "10-2019-0036841", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "실시 예들에 따르면, 광고자는 공개된 정보 및 허용된 게시물에 기초하여 신뢰성 있는 광고를 제공할 수 있고, 브랜드 이미지를 제고시킬 수 있다. 또한, 광고자는 광고 노출의 낭비 없이 타겟 마케팅을 수행하여 효율적인 광고를 가능하게 할 수 있다. 나아가, 수요자는 개인 정보를 공유하기 위한 방식을 스스로 제어할 수 있고, 개 인 정보 공개에 기초하여 보상을 받을 수 있다. 나아가, 수요자는 수요자가 원하는 양질의 정보만 획득할 수 있 다."}
{"patent_id": "10-2019-0036841", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "위에서 언급된 특성들 및 아래의 상세한 설명들은 본 개시의 설명 및 더 나은 이해를 가능하게 하기 위해 예시 적인 실시 예들을 보여준다. 본 개시는 이러한 실시 예들에 한정되지 않고, 다른 관점으로 구현될 수 있다. 아 래의 실시 예들은 단지 본 개시를 완전하게 만들기 위한 예시들일 뿐이고, 본 개시가 속하는 기술 분야에서 통 상의 지식을 가진 자들에게 명확한 설명들을 전달하기 위해 제공된다. 따라서, 본 개시가 여러 실시 예로 구현 될 수 있는 경우, 이 실시 예들 중 특정한 것 또는 이것들과 동등한 것 중 어떠한 것이든 본 개시를 구현하기 위해 채용될 수 있다. 아래의 설명들에서 어떤 구성 요소가 특정 요소를 포함한다고 언급되는 경우 또는 어떤 과정이 특정 동작을 포 함한다고 언급되는 경우, 다른 요소 또는 다른 동작이 더 포함될 수 있다. 아래의 설명들에서 이용되는 용어들 은 특정 실시 예를 보여주기 위해 제공될 뿐이고, 본 개시를 한정하도록 의도되지 않는다. 더 나은 이해를 가능 하게 하기 위해 설명되는 예시들은 그것의 상보적인 실시 예도 포함할 수 있다.아래의 설명들에서 이용되는 용어들은 통상의 기술자에 의해 널리 이해되는 의미를 가질 수 있다. 통상적으로 이용되는 용어들은 설명들의 맥락에 따라 일관되게 해석되어야 한다. 나아가, 아래의 설명들에서 이용되는 용어 들은, 그것들의 의미들이 명확히 정의되지 않은 한, 지나치게 이상적이거나 형식적인 의미들을 갖는 것으로 해 석되지 않아야 한다. 이하, 첨부된 도면들을 참조하여 몇몇 실시 예가 설명될 것이다. 이하 도면들을 참조하여 본 발명의 실시예들에 따른 블록체인 기반의 전자시스템을 이용한 신뢰성 있는 광고 및 사용자 보상 방법에 대해 설명한다. 도 1은 실시 예들에 따른 블록체인(Blockchain) 기반의 전자 시스템의 예시적인 구성을 설명하기 위한 개 념도이다. 블록체인은 체인 구조로 연결되는 블록들의 형태로 복수의 전자 장치에 분산 및 복제된 데이터를 저장하기 위한 기법이다. 블록체인 기반의 전자 시스템은 복수의 노드(도 1에 원으로 표현됨) 및 체인들(도 1에 점선으로 표현됨)을 포함하여 구현될 수 있다. 노드들 각각은 데이터 통신, 데이터 처리, 데이터 저장, 및 데이터 출력을 지원할 수 있는 전자 장치(예컨대, 컴퓨팅 장치)로 구현될 수 있다. 각 노드의 예시적인 구성은 도 2를 참조하여 설명될 것이다. 체인들 각각은 둘 이상의 노드가 서로 통신하며 데이터/정보를 교환할 수 있도록 둘 이상의 노드를 물리적/전기 적으로 연결하기 위한 유선/무선 통신 채널로 구현될 수 있다. 통신 채널들을 통해 체인 구조로 연결되는 전자 장치들이 블록체인 기반의 전자 시스템을 구성하는 것으로 이해될 수 있다. 각 노드는 블록체인 기반의 전자 시스템 상에서 주어진 역할을 수행하는 사용자에 의해 이용될 수 있다. 사용자는 노드에 대응하는 전자 장치를 통해 체인 구조의 블록체인 기반의 전자 시스템에 액세스할 수 있 다. 블록체인 기법은 중앙집중형 서버에만 데이터를 저장하는 대신 체인 구조에 액세스하는 모든 사용자들에게 데이 터를 공개하기 위해 이용된다. 예로서, 블록체인 기반의 전자 시스템에서 생성되고 다루어지는 데이터는 모든 노드들에 대응하는 전자 장치들에 분산하여 복제될 수 있고, 따라서 모든 사용자들이 데이터를 공유할 수 있다. 이러한 데이터 공유는 데이터 위조 또는 변조를 방지할 수 있고, 데이터 신뢰성을 보장할 수 있다. 예로서, 블 록체인 기반의 전자 시스템에 저장된 데이터는 해킹과 같은 외부 위협으로부터 보호될 수 있다. 따라서, 블록체인 기법은 다양한 위협이 존재하는 온라인/모바일 환경에서 유익하게 채용될 수 있다. 도 1은 다섯 개의 노드들을 보여주지만, 본 개시는 여기에 한정되지 않는다. 블록체인 기반의 전자 시스템(10 0)을 구성하는 노드들의 개수는 다양하게 변경될 수 있다. 예로서, 노드들의 개수는 수백, 수천, 또는 그 이상 으로 증가할 수 있다. 노드들의 개수가 증가할수록, 블록체인 기반의 전자 시스템의 데이터는 더 많이 복 제될 수 있고, 따라서 데이터가 외부 위협으로부터 더 안전할 수 있다. 도 2는 도 1의 각 노드를 구현하기 위한 전자 장치의 예시적인 구성을 보여주는 블록도이다. 도 1의 노드들 각각은 데이터 통신, 데이터 처리, 데이터 저장, 및 데이터 출력을 지원할 수 있는 전자 장치 로 구현될 수 있다. 이를 위해, 전자 장치는 프로세서, 메모리, 유저 인터페이스 장치들 , 통신 장치, 및 버스를 포함할 수 있다. 예로서, 전자 장치는 데스크톱 컴퓨터, 랩톱 컴 퓨터, 태블릿 컴퓨터, 스마트 폰, 서버 등과 같은 컴퓨팅 장치들 중 하나일 수 있다. 프로세서는 CPU(Central Processing Unit)와 같은 범용 프로세서, GPU(Graphic Processing Unit)와 같은 특수 목적 프로세서, 또는 모바일 장치의 AP(Application Processor)일 수 있다. 프로세서는 다양한 산술/ 논리 연산을 수행하기 위해 하나 이상의 프로세서 코어를 포함할 수 있다. 프로세서는 소프트웨어의 프로 그램 코드에 의해 지시되는 명령어 집합들을 실행하여, 전자 장치가 사용자에 의해 의도되는 동작들을 수 행하도록 전자 장치의 전반적인 동작들을 제어할 수 있다. 메모리는 프로세서에 의해 처리되는 데이터를 저장할 수 있다. 실시 예들에서, 메모리는 디앱 (dApp; Decentralized Application)의 프로그램 코드를 저장할 수 있다. 도 1의 노드들 각각에서 디앱 의 프로그램 코드에 의해 지시되는 명령어 집합들이 프로세서에 의해 실행됨에 따라, 블록체인 기반 의 전자 시스템의 동작들이 수행될 수 있다. 블록체인 기반의 전자 시스템의 동작들은 도 3 내지 도 12를 참조하여 설명될 것이다.유저 인터페이스 장치들은 전자 장치와 사용자 사이의 통신을 중재할 수 있다. 예로서, 유저 인터페 이스 장치들은 사용자로부터 입력을 수신하기 위해 키보드, 마우스, 터치 스크린, 마이크, 센서 등과 같은 입력 인터페이스 장치들을 포함할 수 있다. 예로서, 유저 인터페이스 장치들은 사용자에게 정보를 제공하 기 위해 디스플레이, 스피커, 모터, 램프 등과 같은 출력 인터페이스 장치들을 포함할 수 있다. 통신 장치는 전자 장치 외부와의 통신을 지원할 수 있다. 이를 위해, 통신 장치는 다양한 유선/ 무선 통신 규약 중 적어도 하나에 기초하여 신호 및 데이터를 처리할 수 있다. 예로서, 통신 장치는 블록 체인 기반의 전자 시스템에 연결되는 다른 노드들과 교환되는 신호/데이터/정보를 처리할 수 있다. 버스는 전자 장치의 구성 요소들 사이에서 통신 경로를 제공할 수 있다. 버스는 다양한 버스 규 약 중 적어도 하나에 따라 전자 장치 내부에서 신호/데이터를 전달할 수 있다. 아래에서 설명되는 블록체인 기반의 전자 시스템의 동작들은 전자 장치의 구성 요소들이 동작함에 따 라 수행될 수 있다. 아래에서 설명되는 동작들은 디앱의 실행에 기초하여 전자 장치의 구성 요소들을 유기적으로 동작시키고 노드들 사이의 통신을 가능하게 함으로써 수행될 수 있다. 도 3은 도 1의 블록체인 기반의 전자 시스템을 이용한 신뢰성 있는 광고 및 사용자 보상 방법을 설명하기 위한 예시적인 개념도이다. 도 1의 블록체인 기반의 전자 시스템은 도 3의 블록체인 기반의 전자 시스템과 같이 동작할 수 있다. 예로서, 도 1의 노드들에서 디앱들이 실행됨에 따라, 블록체인 기반의 전자 시스템이 동작할 수 있다. 블록체인 기반의 전자 시스템은 게시자가 소유하는 전자 장치에 대응하는 노드 및 사용자가 소 유하는 전자 장치에 대응하는 노드를 포함할 수 있다. 게시자 및 사용자는 그들이 소유하는 전자 장 치들을 통해 블록체인 기반의 전자 시스템으로 액세스할 수 있다. 게시자는 전자 장치의 입력 인터페이스 장치를 이용하여 게시물을 작성할 수 있다. 작성된 게시물의 데이 터는 전자 장치의 통신 장치를 통해 블록체인 기반의 전자 시스템으로 전송될 수 있고, 블록체인 기반의 전자 시스템의 노드들에 저장될 수 있다. 게시물에 대한 게시 조건이 충족되는 경우, 게시물은 블록체인 기반의 전자 시스템 상에 게시될 수 있다. 이 경우, 사용자는 전자 장치의 출력 인터페이스 장치를 통해 게시물을 열람할 수 있다. 도 3은 하나의 게 시자 및 하나의 사용자를 보여주지만, 블록체인 기반의 전자 시스템에 액세스하는 게시자들 및 사용자들의 수는 다양하게 변경될 수 있음이 잘 이해될 것이다. 예로서, 게시물은 광고를 포함할 수 있다. 이 예에서, 게시자는 게시물을 통해 제품을 광고하고자 의도하 는 광고자일 수 있고, 사용자는 광고를 열람하는 소비자일 수 있다. 게시자는, 블록체인 기반의 전자 시스템 상에 게시물을 게시할 것을 요청하기 위해, 전자 장치의 통 신 장치를 통해 블록체인 기반의 전자 시스템으로 토큰(Token)들을 전달할 수 있다. 따라서, 게시자 의 전자 장치를 통해 수신되는 토큰들이 블록체인 기반의 전자 시스템에 예치될 수 있다(예컨대, 스테이킹 (Staking)될 수 있다). 토큰은 블록체인 기반의 전자 시스템의 생태계 내에서 거래될 수 있는 디지털 화폐 또는 포인트를 의미할 수 있다. 게시자는 토큰들을 예치함으로써 광고 비용을 지불할 수 있다. 몇몇 실시 예에서, 예치된 토큰들의 양, 사 용자들의 평가들, 사용자들의 행위들 등 다양한 요인에 기초하여 여러 게시자의 게시물들에 대한 순위가 산출될 수 있고, 높은 순위의 게시물에 대해서는 혜택이 주어질 수 있다. 몇몇 실시 예에서, 게시자의 진입 장벽 을 낮추기 위해, 게시자의 요청에 기초하여 블록체인 기반의 전자 시스템의 생태계 내의 토큰들이 전 자 장치의 통신 장치를 통해 게시자에게 판매될 수 있다. 이러한 정책들은 게시자가 신뢰성 있는 광고를 발행하도록 유도할 수 있고, 타켓 마케팅의 부정적인 이미 지를 해소하는 데에 도움이 될 수 있다. 따라서, 광고 노출의 낭비 없이 타켓 마케팅을 수행함으로써 효율적인 광고를 발행하는 것이 가능해질 수 있다. 나아가, 높은 순위의 게시물은 브랜드 이미지를 제고시킬 수 있다. 몇몇 실시 예에서, 배분 조건이 충족되는 경우, 게시자에 의해 예치된 토큰들의 일부분은 사용자의 전자 장치의 통신 장치를 통해 사용자에게 배분될 수 있다. 예로서, 사용자에게 배분되는 토큰들은 사용자의 개인 정보를 게시자에게 공개하고 게시물을 열람하는 것에 대한 보상일 수 있다. 예로서, 사용자에게 토큰들을 배분하는 것은 스마트 컨트랙트(Smart Contract)를 이용하여 제공될 수 있다.이러한 정책들은 사용자의 만족도를 향상시킬 수 있고, 사용자의 적극적인 참여를 유도할 수 있다. 나아가, 사용자는 타겟 마케팅을 통해 사용자가 원하는 양질의 게시물만 열람할 수 있고, 사생활 침 해로부터 보호받을 수 있다. 도 4는 도 3의 블록체인 기반의 전자 시스템과 관련되는 예시적인 구현을 설명하기 위한 개념도이다. 예로서, 사용자는 전자 장치의 입력 인터페이스 장치를 통해 사용자의 개인 정보를 블록체인 기반의 전자 시스템으로 제공할 수 있다. 게시자는 전자 장치의 통신 장치를 통해 블록체인 기반의 전자 시 스템으로부터 사용자의 개인 정보를 획득할 수 있다. 예로서, 사용자의 개인 정보는 사용자를 식별하기 위해 참조되는 식별 정보(예컨대, 이름, 생년월일, 전화번호 등), 사용자의 식별과 관련되지 않는 비식별 정보(예컨대, 성별, 나이, 주소 등), 사용자의 관심 분야(예컨대, 취미, 구매 희망 제품 등) 등을 포함할 수 있다. 실시 예들에서, 사용자는 개인 정보를 게시자와 공유하기 위한 방식을 스스로 제어할 수 있다. 예로 서, 사용자는 사용자의 어떤 개인 정보가 게시자에게 공개될 것인지 스스로 선택하고 설정할 수 있고(예컨대, 이름 및 나이를 공개하고 전화번호 및 주소를 공개하지 않음), 설정된 공개 상태를 전자 장치의 입력 인터페이스 장치를 통해 블록체인 기반의 전자 시스템으로 입력할 수 있다. 이러한 방식으로, 사용자 는 개인 정보 노출 및 사생활 침해의 위협으로부터 능동적으로 대응할 수 있다. 다만, 게시자에 공개되는 사용자의 개인 정보의 양이 감소하는 경우, 적절한 광고 게시 및 효율적인 마케팅이 어려워질 수 있다. 이와 관련하여, 몇몇 실시 예에서, 사용자와 관련하여 게시자에게 공개 되는 개인 정보의 양이 증가할수록, 사용자에게 배분되는 토큰들의 양이 증가할 수 있다(즉, 더 많은 보상 이 사용자에게 주어질 수 있다). 사용자는 사생활 보호와 많은 보상 사이의 합리적인 선택에 기초하여 개인 정보 공개 상태를 제어할 수 있 다. 한편, 몇몇 실시 예에서, 사용자의 개인 정보를 잘 보호하기 위해, 트랜잭션 믹싱(Transaction Mixing) 기법이 블록체인 기반의 전자 시스템에서 채용될 수 있다. 몇몇 예에서, 블록체인 기반의 전자 시스템은 사용자의 관심 분야에 부합하는 게시물과 관련하여 전 자 장치의 통신 장치를 통해 사용자에게 푸쉬 알림을 제공할 수 있다. 사용자는 푸쉬 알림을 수신할 것인지 선택할 수 있다. 몇몇 예에서, 사용자는 수신될 게시물과 관련하여 예치되는 토큰들의 개수를 선택할 수 있다. 예로서, 사 용자는 100개 이상의 토큰들의 예치와 함께 게시되는 게시물만 수신하도록 토큰들의 개수를 설정할 수 있 고, 설정된 개수를 전자 장치의 입력 인터페이스 장치를 통해 블록체인 기반의 전자 시스템으로 입력할 수 있다. 도 5는 도 3의 블록체인 기반의 전자 시스템의 예시적인 동작들을 설명하기 위한 개념도이다. 도 6 및 도 7은 도 5의 블록체인 기반의 전자 시스템과 관련되는 예시적인 구현을 설명하기 위한 개념도들이다. 도 8 은 도 5의 블록체인 기반의 전자 시스템과 관련되는 예시적인 구현을 설명하는 흐름도이다. 몇몇 실시 예에서, 도 3의 블록체인 기반의 전자 시스템은 도 5의 블록체인 기반의 전자 시스템과 같 이 동작할 수 있다. 도 5를 참조하면, 블록체인 기반의 전자 시스템은 게시자, 검수자, 투표자 , 및 사용자가 소유하는 전자 장치들에 대응하는 노드들을 포함할 수 있다. 게시자, 검수자 , 투표자, 및 사용자는 그들이 소유하는 전자 장치들을 통해 블록체인 기반의 전자 시스템(40 0)으로 액세스할 수 있다. 게시자 및 사용자는 도 3 및 도 4를 참조하여 설명된 게시자 및 사용자에 각각 대응할 수 있다. 예로서, 게시자는 토큰들을 블록체인 기반의 전자 시스템에 예치함에 기초하여 게시물을 작성 할 수 있다. 게시자의 토큰들을 수신하고 예치함에 기초하여, 블록체인 기반의 전자 시스템은 게시자 에 의해 작성되는 게시물을 전자 장치를 통해 사용자에게 제공할 수 있다. 사용자는 개인 정보를 게 시자에게 공개하고 게시물을 열람하여 토큰들을 배분 받을 수 있다. 도 6을 참조하면, 예로서, 도 2의 전자 장치의 유저 인터페이스 장치들은 디스플레이 장치를 포 함할 수 있다. 디스플레이 장치는 전자 장치로부터 제공되는 영상 정보를 출력할 수 있다. 예로서, 사용자가 게시물을 열람하는 동안, 여러 게시자의 게시물들이 나열된 전자 게시판(252a)이 디스플레이 장 치 상에 출력될 수 있다. 예로서, 전자 게시판(252a) 상에서, 게시물은 게시자 및 제목에 기초하여 식별될수 있다. 몇몇 경우, 블록체인 기반의 전자 시스템 상에서 게시물들을 (예컨대, 유사도 또는 관련성에 기초하여) 분 류하기 위해, 카테고리들(252b)이 관리될 수 있다. 하나의 카테고리와 관련하여, 높은 유사도 또는 높은 관련성 을 갖는 게시물들이 작성 및 열람될 수 있다. 도 7을 참조하면, 게시자 및 제목에 기초하여 식별되는 하나의 게시물(252c)은 그 게시물(252c)에 대응하는 내 용을 포함할 수 있다. 예로서, 게시물(252c)이 광고를 포함하는 경우, 게시물(252c)의 내용은 제품 설명, 서비 스 홍보 등과 같은 마케팅 목적의 내용을 포함할 수 있다. 몇몇 경우, 사용자는 추천 및 비추천 기능(252d)을 이용하여 게시물(252c)을 평가할 수 있다. 이를 위해, 사용자는 전자 장치의 입력 인터페이스 장치를 통해 추천 또는 비추천의 요청을 블록체인 기반의 전자 시 스템으로 전송할 수 있다. 예로서, 게시물(252c)에 많은 개수의 추천들이 주어지는 경우, 게시물(252c)은 양질의 내용을 제공하는 것으로 여겨질 수 있다. 많은 개수의 추천들은 브랜드 이미지를 제고하는 데에 도움이 될 수 있다. 몇몇 경우, 양질의 게시물(252c)을 제공하는 게시자에게 추가의 토큰 또는 포인트가 주어질 수 있다. 반면, 게시물(252c)에 많은 개수의 비추천들이 주어지는 경우, 게시물(252c)은 부적절한 내용을 제공하는 것으 로 여겨질 수 있다. 예로서, 많은 개수의 비추천이 기준 시간 내에 게시물(252c)에 주어지는 경우, 게시물 (252c)이 블록체인 기반의 전자 시스템 상에 게시되지 않도록 게시물(252c)이 삭제될 수 있다. 도 5로 돌아오면, 검수자는 게시자에 의해 작성되는 게시물이 게시 조건을 충족시키는지 검수할 수 있다(도 8의 S110). 예로서, 게시자에 의해 작성되는 게시물이 카테고리에 적합하지 않은 경우, 게시 조건 이 충족되지 않을 수 있다. 또는, 게시물이 토큰 획득과 같은 부적절한 목적으로 작성된 경우, 게시 조건이 충 족되지 않을 수 있다. 검수자가 게시물이 게시 조건을 충족시키지 못하는 것으로 판단한 경우(도 8의 S110의 아니오), 검수자 는 블록체인 기반의 전자 시스템 상에 게시물이 게시되지 않도록 전자 장치의 통신 장치를 통해 블록 체인 기반의 전자 시스템으로 삭제 요청을 전송할 수 있다. 검수자의 전자 장치를 통해 수신되는 삭제 요청에 응답하여, 블록체인 기반의 전자 시스템 상에서 게 시물이 삭제될 수 있다(도 8의 S120). 게시물이 삭제되는 경우, 게시자에 의해 예치되었던 토큰들은 전자 장치의 통신 장치를 통해 게시자에게 반환될 수 있다. 검수자가 게시물이 게시 조건을 충족시킬 수 있다고 판단한 경우(도 8의 S110의 예), 검수자는 전자 장치의 통신 장치를 통해 블록체인 기반의 전자 시스템 상의 챌린지를 요청할 수 있다(도 8의 S130). 챌린 지는 게시물이 게시되도록 허용할 것인지 결정하는 행위를 의미할 수 있다. 몇몇 실시 예에서, 검수자가 챌린지를 요청하는 경우, 검수자는 전자 장치의 통신 장치를 통해 블록 체인 기반의 전자 시스템으로 토큰들을 전달할 수 있고, 검수자의 전자 장치를 통해 수신되는 토큰들 이 블록체인 기반의 전자 시스템에 예치될 수 있다. 검수자에 의해 예치되는 토큰들은 검수자의 좀 더 책임감 있는 행위를 유도할 수 있다. 나아가, 아래에서 설명될 것처럼, 검수자의 토큰들은 챌린지의 결과에 의존하여 게시자, 검수자, 투표자, 및 사용자에게 배분될 수 있다. 검수자의 전자 장치로부터 수신되는 챌린지 요청에 응답하여, 블록체인 기반의 전자 시스템 상에 게 시물이 게시되도록 허용할 것인지 결정하기 위해 투표가 진행될 수 있다. 투표자는 투표에 참여하여 찬성 또는 반대의 의견을 제안할 수 있다(도 8의 S140). 이를 위해, 투표자는 전자 장치의 통신 장치를 통해 찬성 의견 또는 반대 의견의 응답을 블록체인 기반의 전자 시스템으로 전송할 수 있다. 찬성 의견 또는 반대 의견의 응답은 게시물의 게시에 찬성함 또는 반대 함을 지시할 수 있다. 전자 장치를 통해 수신되는 투표자의 응답에 기초하여(즉, 투표 결과에 기초하여), 게시물이 게시되도록 허용할 것인지가 결정될 수 있다. 몇몇 실시 예에서, 투표자가 찬성 의견 또는 반대 의견에 기초하여 투표에 참여하는 경우, 투표자는 전자 장치의 통신 장치를 통해 블록체인 기반의 전자 시스템으로 토큰들을 전달할 수 있고, 투표자의 전자 장치를 통해 수신되는 토큰들이 블록체인 기반의 전자 시스템에 예치될 수 있다. 투표자에 의해 예치되는 토큰들은 투표자의 좀 더 책임감 있는 행위를 유도할 수 있다. 나아가, 아래에서 설명될 것처럼,투표자의 토큰들은 챌린지의 결과에 의존하여 게시자, 검수자, 투표자, 및 사용자에 게 배분될 수 있다. 도 5는 하나의 게시자, 하나의 검수자, 하나의 투표자, 및 하나의 사용자를 보여주지만, 블록체인 기반의 전자 시스템에 액세스하는 게시자들, 검수자들, 투표자들, 및 사용자들의 수는 다양하게 변경될 수 있음이 잘 이해될 것이다. 여러 투표자로부터 얻어지는 찬성 및 반대 의견들과 관련하여, 찬성 의견들의 수가 반대 의견들의 수보다 많은 경우(도 8의 S140의 예), 블록체인 기반의 전자 시스템 상에 게시물이 게시되도록 허용될 수 있다(도 8의 S150). 이는 게시물이 챌린지를 통과한 것을 의미할 수 있다. 이 경우, 게시물이 블록체인 기반의 전자 시스템 으로부터 사용자들에 의해 열람될 수 있다. 몇몇 경우, 사용자가 원하는 게시자의 게시물만 사용자 가 열람할 수 있도록 게시자 선별 기능이 구현될 수 있다. 반면, 찬성 의견들의 수가 반대 의견들의 수보다 적은 경우(도 8의 S140의 아니오), 블록체인 기반의 전자 시스 템 상에 게시물이 게시되도록 허용되지 않을 수 있다(도 8의 S160). 이는 게시물이 챌린지에 실패한 것을 의미할 수 있다. 이 경우, 게시물이 블록체인 기반의 전자 시스템으로부터 삭제될 수 있고, 사용자들에 의 해 열람되지 않을 수 있다. 챌린지를 통과한 게시물은 양질의 내용을 포함하는 것으로 여겨질 수 있다. 실시 예들에서, 게시 조건을 충족시 키고 챌린지를 통과한 게시물만 블록체인 기반의 전자 시스템에 유지됨에 따라, 신뢰성 있는 광고가 가능 해질 수 있다. 나아가, 블록체인 기법이 채용됨에 따라, 게시물의 신뢰성이 더욱 제고될 수 있다. 한편, 챌린지들을 통과한 여러 게시물과 관련하여, 더 많은 수의 찬성 의견들 또는 더 많은 수의 추천들이 주어 진 게시물은 더 높은 신뢰성을 가질 수 있다. 몇몇 실시 예에서, 이러한 게시물은 더 높은 우선순위로(예컨대, 전자 게시판(252a)의 상단에서) 사용자들에게 보여질 수 있다. 따라서, 이러한 게시물은 더 많은 사용자들에 의 해 열람될 기회를 가질 수 있다. 몇몇 실시 예에서, 더 많은 양의 토큰들의 예치와 함께 작성된 게시물이 더 높은 우선순위로(예컨대, 전자 게시 판(252a)의 상단에) 사용자들에게 보여질 수 있다. 많은 양의 토큰들을 예치한 게시자는 책임감 있는 행위를 할 가능성이 높을 수 있고, 따라서 더 많은 기회들을 부여 받을 수 있다. 도 5 내지 도 8을 참조하여 검수자, 투표자, 및 사용자가 별개의 주체들로서 설명되었으나, 이 는 더 나은 이해를 가능하게 하기 위한 예일 뿐이다. 몇몇 실시 예에서, 검수자 및 투표자는 사용자 들 중에서 선출될 수 있고, 또는 사용자가 검수자 또는 투표자의 역할을 수행할 수 있다. 다시 말해, 검수자, 투표자, 및 사용자는 상호 대체 가능한 주체들인 것으로 이해될 수 있다. 검수자의 역할은 블록체인 기반의 전자 시스템을 운영하는 데에 중요할 수 있다. 따라서, 예로서, 검 수자는 블록체인 기반의 전자 시스템과 관련되는 활동들에 오랜 기간 동안 참여하였거나 높은 신뢰도 또는 많은 양의 토큰들을 가진 사용자일 수 있다. 예로서, 투표자는 챌린지가 요청되기 전에 게시물을 이미 열람했던 사용자 또는 챌린지가 요청된 후에 게 시물을 열람하는 사용자일 수 있다. 몇몇 실시 예에서, 블록체인 기반의 전자 시스템은 챌린지가 요청된 게시물을 이미 열람했던 또는 열람할 사용자에게 전자 장치들의 통신 장치들을 통해 푸쉬 알림들을 전송할 수 있다. 사용자는 푸쉬 알림을 참조하여 투표에 참여할 수 있다. 몇몇 경우, 사용자는 푸쉬 알림의 수신을 허용 또는 거부할 수 있다. 한편, 위에서 설명된 것처럼, 토큰들이 게시자, 검수자, 및 투표자에 의해 예치될 수 있다. 예 치된 토큰들은 배분 조건에 기초하여 게시자, 검수자, 투표자, 및 사용자에게 배분될 수 있다. 예로서, 사용자가 게시물을 열람하고 게시물과 관련되는 배분 조건이 충족되는 경우, 예치된 토큰들의 일 부분이 전자 장치의 통신 장치를 통해 사용자에게 배분될 수 있다. 한편, 검수자 및 투표자에게 토큰들을 배분하는 것은 사용자에게 토큰들을 배분하는 것과 동등한 맥락인 것으로 여겨질 수 있다. 예로서, 게시물이 게시되도록 허용되는 경우, 게시자는 게시자에 의해 예치된 토큰들 전부를 광고 비 용으로서 지불할 수 있다. 반면, 게시물이 게시되도록 허용되지 않는 경우, 예치된 토큰들의 적어도 일부에 대 응하는 양의 토큰들이 게시자에게 반환될 수 있다. 게시자의 관점에서, 배분 조건은 게시물이 게시되도록 허용되지 않는 경우에 충족될 수 있다. 예로서, 게시물이 게시되도록 허용되는 경우, 예치된 토큰들의 적어도 일부에 대응하는 양의 토큰들이 검수자 에게 반환될 수 있다. 반면, 게시물이 게시되도록 허용되지 않는 경우, 검수자에 의해 예치된 토큰들 은 다른 주체들에게 배분될 수 있다. 검수자의 관점에서, 배분 조건은 게시물이 게시되도록 허용되는 경우 에 충족될 수 있다. 예로서, 게시물이 게시되도록 허용되는 경우, 예치된 토큰들의 적어도 일부에 대응하는 양의 토큰들이 게시물의 게시에 찬성한 투표자에게 반환될 수 있고, 게시물의 게시에 반대한 투표자에 의해 예치된 토큰들은 다른 주체 들에게 배분될 수 있다. 반면, 게시물이 게시되도록 허용되지 않는 경우, 게시물의 게시에 찬성한 투표자에 의 해 예치된 토큰들은 다른 주체들에게 배분될 수 있고, 예치된 토큰들의 적어도 일부에 대응하는 양의 토큰들이 게시물의 게시에 반대한 투표자에게 반환될 수 있다. 게시물의 게시에 찬성한 투표자의 관점에서, 배분 조건은 게시물이 게시되도록 허용되고 투표자의 요청이 게시 물의 게시에 찬성함을 지시하는 경우에 충족될 수 있다. 반면, 게시물의 게시에 반대한 투표자의 관점에서, 배 분 조건은 게시물이 게시되도록 허용되지 않고 투표자의 요청이 게시물의 게시에 반대함을 지시하는 경우에 충 족될 수 있다. 이처럼, 블록체인 기반의 전자 시스템에 예치된 토큰들은 사용자들(예컨대, 검수자 및 투표자) 에게 배분될 수 있다. 이는 사용자들의 만족도를 향상시킬 수 있고, 사용자들의 적극적인 참여를 유도하여 블록 체인 기반의 전자 시스템을 운영하는 데에 도움이 될 수 있다. 게시물이 챌린지를 통과한 경우, 게시자 및 게시물의 게시에 반대한 투표자에 의해 예치된 토큰들이 검수 자 및 게시물의 게시에 찬성한 투표자에게 배분될 수 있다. 이 경우, 검수자 및 게시물의 게시에 찬 성한 투표자에게 배분되는 토큰들은 게시자에 의해 예치된 토큰들의 일부분 및 게시물의 게시에 반대한 투 표자에 의해 예치된 토큰들 중 적어도 하나로부터 기인할 수 있다. 게시물이 챌린지에 실패한 경우, 검수자 및 게시물의 게시에 찬성한 투표자에 의해 예치된 토큰들이 게시 자 및 게시물의 게시에 반대한 투표자에게 배분될 수 있다. 이 경우, 게시자 및 게시물의 게시에 반 대한 투표자에게 배분되는 토큰들은 검수자에 의해 예치된 토큰들 및 게시물의 게시에 찬성한 투표자에 의 해 예치된 토큰들 중 적어도 하나로부터 기인할 수 있다. 도 9는 도 3의 블록체인 기반의 전자 시스템을 이용한 신뢰성 있는 광고 및 사용자 보상 방법을 설명하기 위한 다른 예시적인 개념도이다. 도 10은 도 9의 블록체인 기반의 전자 시스템과 관련되는 예시적인 구현 을 설명하기 위한 개념도이다. 몇몇 실시 예에서, 도 3의 블록체인 기반의 전자 시스템은 도 9의 블록체인 기반의 전자 시스템과 같 이 동작할 수 있다. 도 9를 참조하면, 블록체인 기반의 전자 시스템은 개설자, 게시자, 및 사용 자가 소유하는 전자 장치들에 대응하는 노드들을 포함할 수 있다. 개설자, 게시자, 및 사용자 는 그들이 소유하는 전자 장치들을 통해 블록체인 기반의 전자 시스템으로 액세스할 수 있다. 게시자 및 사용자는 도 3 및 도 4를 참조하여 설명된 게시자 및 사용자에 각각 대응할 수 있다. 예로서, 게시자는 토큰들을 블록체인 기반의 전자 시스템에 예치함에 기초하여 게시물을 작성 할 수 있다. 게시자의 토큰들을 수신하고 예치함에 기초하여, 블록체인 기반의 전자 시스템은 게시자 에 의해 작성되는 게시물을 전자 장치를 통해 사용자에게 제공할 수 있다. 사용자는 개인 정보를 게 시자에게 공개하고 게시물을 열람하여 토큰들을 배분 받을 수 있다. 개설자는 블록체인 기반의 전자 시스템 상의 오픈채팅방을 제공할 수 있다. 오픈채팅방은 불특정 다 수의 사용자들이 데이터, 정보, 게시물 등을 교환할 수 있도록 온라인 공간 상에 제공되는 전자적인 영역을 의 미할 수 있다. 개설자는 불특정 다수의 사용자들을 위해 오픈채팅방을 제공하기 위해, 전자 장치의 통신 장치를 통해 블 록체인 기반의 전자 시스템으로 개설 요청을 전송할 수 있다. 개설자의 전자 장치를 통해 수신되는 개설 요청에 응답하여, 블록체인 기반의 전자 시스템 상에 오픈채팅방이 제공될 수 있다. 개설자는 개설된 오픈채팅방의 운영을 관리할 수 있고(예컨대, 구성원, 게시물, 폐쇄 등을 관리할 수 있고), 이와 관련하 여 오픈채팅방의 관리자로서 이해될 수 있다. 도 10을 참조하면, 예로서, 도 2의 전자 장치의 유저 인터페이스 장치들은 디스플레이 장치를 포함할 수 있다. 디스플레이 장치는 전자 장치로부터 제공되는 영상 정보를 출력할 수 있다. 예로서, 사용자가 전자 장치의 통신 장치를 통해 오픈채팅방(254a)에 참여하는 동안, 게시자들에 의해 작 성되는 게시물들이 디스플레이 장치 상에 출력될 수 있다. 게시물은 오픈채팅방(254a)의 주제(254b)에 적 합하도록 작성될 수 있다. 주제(254b)는 오픈채팅방(254a)에서 다루어지는 게시물의 맥락 또는 관점을 지시할 수 있다. 예로서, 게시자 \"A\"는, 토큰들을 예치함과 함께, 주제(254b)에 적합한 게시물(254c)을 전자 장치의 통신 장치를 통해 블록체인 기반의 전자 시스템으로 전송할 수 있다. 게시자 \"A\"의 토큰들을 예치함에 기초하여, 블록 체인 기반의 전자 시스템은 전자 장치의 통신 장치를 통해 게시물을 오픈채팅방의 사용자에게 제공할 수 있다. 따라서, 사용자는 전자 장치를 통해 게시물을 열람할 수 있다. 도 11 및 도 12는 도 9의 블록체인 기반의 전자 시스템과 관련되는 예시적인 구현을 설명하기 위한 개념도 들이다. 도 11을 참조하면, 오픈채팅방(254a)의 정책 및/또는 블록체인 기반의 전자 시스템의 정책에 의존하여 또 는 게시자의 선택에 따라, 게시자의 토큰들은 개설자에 대해 예치되거나(S210) 또는 오픈채팅방 (254a)을 위해 예치될 수 있다(S220). 예로서, 개설자에 대해 예치되는 토큰들(S210)은 오픈채팅방(254a)의 관리 비용으로서 이해될 수 있다. 개 설자에 대해 예치되는 토큰들(S210)의 소유권은 개설자에게 주어질 수 있다. 예로서, 개설자는 개설자 자신을 위해 토큰들의 일부 또는 전부를 획득할 수 있다(S230). 예로서, 개 설자는 오픈채팅방(254a)을 위해 토큰들의 일부 또는 전부를 예치할 수 있다(S240). 게시자 및/또는 개설자에 의해 오픈채팅방(254a)을 위해 예치되는 토큰들(S220, S240)은 오픈채팅방(254a)의 운영과 관련 하여 이용될 수 있다. 예로서, 도 12를 참조하면, 블록체인 기반의 전자 시스템 상에 여러 오픈채팅방이 제공될 수 있다. 오픈채 팅방(254a)을 위해 예치되는 토큰들의 양이 증가할수록, 오픈채팅방(254a)이 더 높은 우선순위로(예컨대, 디스 플레이 장치의 상단에서) 사용자들에게 보여질 수 있다. 따라서, 이러한 오픈채팅방(254a)은 더 많은 사용 자들에 의해 열람될 기회를 가질 수 있다. 도 11로 돌아오면, 게시자 및 개설자는 오픈채팅방(254a)의 게시물들이 많은 사용자에 의해 열람될 수 있도록 오픈채팅방(254a)을 위해 많은 양의 토큰들을 예치할 수 있다. 많은 사용자가 오픈채팅방(254a)에 참 여하는 경우, 광고 및 마케팅을 더 효율적으로 하는 것이 가능해질 수 있다. 개설자는 더 많은 사용자의 참여를 유도하기 위해 게시물들의 질을 관리할 수 있다. 이에 따라, 양질의 게 시물들이 블록체인 기반의 전자 시스템에 유지될 수 있고, 신뢰성 있는 광고가 가능해질 수 있다. 나아가, 블록체인 기법이 채용됨에 따라, 게시물들의 신뢰성이 더욱 제고될 수 있다. 한편, 오픈채팅방(254a)을 위해 예치된 토큰들의 일부분은 사용자를 포함하여 오픈채팅방(254a)의 사용자 들에게 배분될 수 있다(S250). 예로서, 사용자가 게시물을 열람하고 사용자와 관련되는 배분 조건이 충족 되는 경우, 예치된 토큰들(S250)의 일부분이 전자 장치의 통신 장치를 통해 사용자에게 배분될 수 있다. 몇몇 실시 예에서, 배분 조건은 사용자가 사용자의 개인 정보(예컨대, 식별/비식별 정보, 관심 분야 등)를 게시자에게 공개하였는지에 기초하여 충족되거나 충족되지 않을 수 있다. 예로서, 사용자가 개 인 정보를 공유하지 않은 경우, 배분 조건이 충족되지 않을 수 있고 토큰들이 사용자에게 배분되지 않을 수 있다. 예로서, 사용자가 개인 정보를 공유한 경우, 사용자는 게시물 열람, 마케팅 참여 등 오픈채팅방 (254a)의 활동에 참여할 의사를 가진 것으로 여겨질 수 있다. 따라서, 배분 조건이 충족될 수 있고 토큰들이 사 용자에게 배분될 수 있다. 몇몇 실시 예에서, 사용자와 관련하여 게시자에게 공개되는 개인 정 보의 양이 증가할수록, 사용자에게 배분되는 토큰들의 양이 증가할 수 있다(즉, 더 많은 보상이 사용자 에게 주어질 수 있다). 몇몇 실시 예에서, 블록체인 기반의 전자 시스템은 사용자들의 기여도를 모니터링하고 산출할 수 있다. 기 여도는, 단순 클릭 또는 단순 열람보다는, 전반적인 활동 및 행동에 기초하여 산출될 수 있다. 예로서, 사용자가 게시물 열람 후 제품 구매, 후기 작성 등과 같은 후속 활동을 수행하거나 제품 개발, 제 품 개선 등과 같은 능동적인 행위에 참여하는 경우, 사용자의 기여도가 높은 것으로 여겨질 수 있다. 블록 체인 기반의 전자 시스템은 트래픽(Traffic) 감지 기법을 채용하여, 사용자의 전반적인 활동 및 행동 에 수반되는 트래픽을 모니터링 및 추적할 수 있다. 몇몇 실시 예에서, 배분 조건은 오픈채팅방(254a)에 대한 사용자의 기여도가 기준치보다 큰지에 기초하여 충족되거나 충족되지 않을 수 있다. 예로서, 사용자의 기여도가 기준치보다 작은 경우, 배분 조건이 충족 되지 않을 수 있고 토큰들이 사용자에게 배분되지 않을 수 있다. 예로서, 사용자의 기여도가 기준치보다 큰 경우, 사용자는 오픈채팅방(254a)의 활동에 적극적으로 참 여할 의사를 가진 것으로 여겨질 수 있다. 따라서, 배분 조건이 충족될 수 있고 토큰들이 사용자에게 배분 될 수 있다. 몇몇 실시 예에서, 사용자들의 기여도들에 기초하여, 토큰들이 사용자들에게 차등하여 배분될 수 있다(즉, 기여 도가 높을수록, 더 많은 보상이 주어질 수 있다). 이러한 정책은 오픈채팅방(254a)의 정보에서 공개될 수 있고, 사용자들의 참여를 위해 참조될 수 있다. 이처럼, 블록체인 기반의 전자 시스템에 예치된 토큰들은 사용자들(예컨대, 오픈채팅방(254a)의 사용자 )에게 배분될 수 있다. 이는 사용자들의 만족도를 향상시킬 수 있고, 사용자들의 적극적인 참여를 유도하 여 블록체인 기반의 전자 시스템을 운영하는 데에 도움이 될 수 있다. 그 밖에, 위에서 설명된 블록체인 기반의 전자 시스템(100, 300, 400, 500)은 더 나은 기능들을 제공하기 위해 다양한 진보된 기법을 채용할 수 있다. 예로서, 블록체인 기반의 전자 시스템(100, 300, 400, 500)은 빅 데이터 분석을 위한 인공지능 알고리즘을 채용하여, 사용자의 관심 분야 또는 관심 게시자의 게시물이나 오픈채팅방을 추천/매칭하거나, 특정 단어를 포함하는 또는 특정 사용자에 의해 게시되는 게시물에 대한 알림을 제공할 수 있 다. 예로서, 블록체인 기반의 전자 시스템(100, 300, 400, 500)은 주어진 기간과 관련하여 주요 이슈로서 다루 어졌던 카테고리/주제에 대한 알림을 제공할 수 있다. 다만, 이 예들은 몇 개의 가능한 구현들을 설명할 뿐이고, 본 개시를 한정하도록 의도되지는 않는다. 실시 예들에 따르면, 블록체인 기법이 채용됨에 따라, 블록체인 기반의 전자 시스템(100, 300, 400, 500)의 참 여자들(예컨대, 게시자, 사용자 등)에 의해 모든 정보가 공유될 수 있다. 따라서, 투명한 운영이 가능할 수 있 다. 나아가, 사용자가 개인 정보를 능동적으로 관리하고 전자 시스템에 능동적으로 참여함에 따라, 데이터 소유권이 사용자에게 부여될 수 있다. 따라서, 데이터에 대한 사용자 권리가 보장될 수 있다. 이상에서, 본 개시가 몇몇 실시 예에 기초하여 설명되었다. 다만, 본 개시가 속하는 기술 분야의 특성에 기인하 여, 본 개시에 의해 의도되는 목적 및 효과는 본 개시의 요지를 포함하면서도 위 실시 예들과 상이한 구현에 의 해 달성될 수 있다. 따라서, 위 실시 예들은 한정적인 것이 아니라, 가능한 구현들 중 일부를 보여주기 위한 설 명적인 것으로 이해되어야 한다. 즉, 본 개시의 요지를 포함하면서 위 실시 예들과 동일한 목적 및 효과를 달성 할 수 있는 구현은 본 개시에 의해 청구되는 보호 범위에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2019-0036841", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 실시 예들에 따른 블록체인 기반의 전자 시스템의 예시적인 구성을 설명하기 위한 개념도이다. 도 2는 도 1의 각 노드를 구현하기 위한 전자 장치의 예시적인 구성을 보여주는 블록도이다. 도 3은 도 1의 블록체인 기반의 전자 시스템을 이용한 신뢰성 있는 광고 및 사용자 보상 방법을 설명하기 위한 예시적인 개념도이다. 도 4는 도 3의 블록체인 기반의 전자 시스템과 관련되는 예시적인 구현을 설명하기 위한 개념도이다. 도 5는 도 3의 블록체인 기반의 전자 시스템의 예시적인 동작들을 설명하기 위한 개념도이다. 도 6 및 도 7은 도 5의 블록체인 기반의 전자 시스템과 관련되는 예시적인 구현을 설명하기 위한 개념도들이다. 도 8은 도 5의 블록체인 기반의 전자 시스템과 관련되는 예시적인 구현을 설명하는 흐름도이다. 도 9는 도 3의 블록체인 기반의 전자 시스템을 이용한 신뢰성 있는 광고 및 사용자 보상 방법을 설명하기 위한 다른 예시적인 개념도이다. 도 10 내지 도 12는 도 9의 블록체인 기반의 전자 시스템과 관련되는 예시적인 구현을 설명하기 위한 개념도들 이다."}
