{"patent_id": "10-2023-0080492", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0178528", "출원번호": "10-2023-0080492", "발명의 명칭": "전자 장치 및 그 제어 방법", "출원인": "삼성전자주식회사", "발명자": "한대철"}}
{"patent_id": "10-2023-0080492", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "공기조화기를 제어하는 전자 장치에 있어서,실내 제어기와 양방향 통신을 수행하는 제1 인터페이스;상기 공기조화기 중 실내기에 제어 신호를 단방향 통신으로 제공하기 위한 제2 인터페이스;적어도 하나의 명령어를 저장하는 메모리; 및상기 메모리와 연결되어 상기 전자 장치를 제어하는 프로세서;를 포함하고,상기 프로세서는,상기 제1 인터페이스를 통하여 상기 실내 제어기로부터 실내 온도 정보 및 설정 온도 정보를 수신하면, 상기 수신된 실내 온도 정보 및 설정 온도 정보에 기초하여 상기 공기조화기에 적용될 제어 정보를 생성하고, 상기 생성된 제어 정보에 대응되는 제어 신호를 상기 단방향 통신으로 상기 실내기에 제공하도록 상기 제1 인터페이스를 제어하는 전자 장치."}
{"patent_id": "10-2023-0080492", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 프로세서는,상기 수신된 실내 온도 정보 및 상기 설정 온도 정보에 기초하여 상기 공기조화기의 동작을 결정하고, 공기조화기의 동작이 결정되면 상기 제어 정보를 생성하는 전자 장치."}
{"patent_id": "10-2023-0080492", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 수신된 실내 온도 정보 및 상기 설정 온도 정보에 기초하여 상기 공기조화기의 운전 모드 및 상기 운전 모드에서의 압축기 속도를 결정하고, 상기 결정된 운전 모드 및 결정된 압축기 속도에 대응되는 제어 정보를 생성하는 전자 장치."}
{"patent_id": "10-2023-0080492", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 공기조화기 중 실외기와 양방향 통신을 수행하는 제3 인터페이스;를 더 포함하고,상기 프로세서는,상기 생성된 제어 정보에 대응되는 상기 실외기에 대한 제어 명령이 상기 양방향 통신으로 상기 실외기에 제공하도록 상기 제3 인터페이스를 제어하는 전자 장치."}
{"patent_id": "10-2023-0080492", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 프로세서는,상기 제3 인터페이스를 통하여 상기 실외기의 동작 정보를 수신하면, 상기 동작 정보가 상기 실내 제어기에 제공하도록 상기 제1 인터페이스를 제어하는 전자 장치."}
{"patent_id": "10-2023-0080492", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2024-0178528-3-제1항에 있어서,상기 제1 인터페이스는,RS-485 통신 방식으로 양방향 통신을 수행하는 전자 장치."}
{"patent_id": "10-2023-0080492", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 실내 제어기와 다른 제2 실내 제어기로부터 접점 신호를 이용한 제어 신호를 입력받는 제4 인터페이스;를더 포함하고,상기 프로세서는,상기 제2 실내 제어기로부터 수신한 제어 신호가 상기 생성된 제어 정보와 상충되면, 상기 실내 제어기로부터수신한 정보에 의하여 생성된 제어 정보에 기초하여 상기 공기조화기에 적용될 제어 정보를 생성하는, 전자 장치."}
{"patent_id": "10-2023-0080492", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 프로세서는,상기 제1 인터페이스를 통하여 풍량 정보를 수신하면, 상기 수신된 풍량 정보에 반영하여 상기 공기조화기에 적용될 제어 정보를 생성하는, 전자 장치."}
{"patent_id": "10-2023-0080492", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 프로세서는,상기 제1 인터페이스를 통하여 실내 습도 정보 및 설정 습도 정보를 수신하면, 상기 수신된 실내 온도 정보, 상기 설정 온도 정보, 상기 실내 습도 정보 및 상기 설정 습도 정보에 기초하여 히터 운전 및 냉방 운전을 동시에하는 동시 운전 모드인지를 판단하고, 동시 운전 모드로 판단되면 히터 운전 및 냉방 운전에 대응되는 제어 정보를 생성하는, 전자 장치."}
{"patent_id": "10-2023-0080492", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 제1 인터페이스는,RS-485 통신 방식으로 양방향 통신을 수행하는 전자 장치."}
{"patent_id": "10-2023-0080492", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "공기조화기를 제어하는 전자 장치의 제어 방법에 있어서,양방향 통신 방식을 이용하여 실내 제어기로부터 실내 온도 정보 및 설정 온도 정보를 수신하는 단계;상기 수신된 실내 온도 정보 및 설정 온도 정보에 기초하여 상기 공기조화기에 적용될 제어 정보를 생성하는 단계;상기 생성된 제어 정보에 대응되는 제어 신호를 상기 단방향 통신으로 상기 공기조화기의 실내기에 전송하는 단계;를 포함하는 제어 방법."}
{"patent_id": "10-2023-0080492", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 제어 정보를 생성하는 단계는,공개특허 10-2024-0178528-4-상기 수신된 실내 온도 정보 및 상기 설정 온도 정보에 기초하여 상기 공기조화기의 동작을 결정하고, 공기조화기의 동작이 결정되면 상기 제어 정보를 생성하는 제어 방법."}
{"patent_id": "10-2023-0080492", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서,상기 제어 정보를 생성하는 단계는,상기 수신된 실내 온도 정보 및 상기 설정 온도 정보에 기초하여 상기 공기조화기의 운전 모드 및 상기 운전 모드에서의 압축기 속도를 결정하고, 상기 결정된 운전 모드 및 결정된 압축기 속도에 대응되는 제어 정보를 생성하는 제어 방법."}
{"patent_id": "10-2023-0080492", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서,상기 제어 방법은,상기 생성된 제어 정보에 대응되는 상기 실외기에 대한 제어 명령이 상기 양방향 통신으로 상기 실외기에 제공하도록 상기 공기조화기 중 실외기와 양방향 통신을 수행하는 제3 인터페이스를 제어하는 단계;를 더 포함하는제어 방법."}
{"patent_id": "10-2023-0080492", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 제어 방법은,상기 제3 인터페이스를 통하여 상기 실외기의 동작 정보를 수신하면, 상기 동작 정보가 상기 실내 제어기에 제공하도록 상기 제1 인터페이스를 제어하는 단계;를 더 포함하는 제어 방법."}
{"patent_id": "10-2023-0080492", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제11항에 있어서,상기 제1 인터페이스는,RS-485 통신 방식으로 양방향 통신을 수행하는 제어 방법."}
{"patent_id": "10-2023-0080492", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제11항에 있어서,상기 실내 제어기와 다른 제2 실내 제어기로부터 접점 신호를 이용한 제어 신호를 입력받는 제4 인터페이스;를더 포함하고,상기 제어 방법은,제4 인터페이스를 통해, 상기 실내 제어기와 다른 제2 실내 제어기로부터 접점 신호를 이용한 제어 신호를 입력받는 단계; 및상기 제2 실내 제어기로부터 수신한 제어 신호가 상기 생성된 제어 정보와 상충되면, 상기 실내 제어기로부터수신한 정보에 의하여 생성된 제어 정보에 기초하여 상기 공기조화기에 적용될 제어 정보를 생성하는 단계;를더 포함하는, 제어 방법."}
{"patent_id": "10-2023-0080492", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제11항에 있어서,상기 제어 정보를 생성하는 단계는,상기 제1 인터페이스를 통하여 풍량 정보를 수신하면, 상기 수신된 풍량 정보에 반영하여 상기 공기조화기에 적용될 제어 정보를 생성하는, 제어 방법.공개특허 10-2024-0178528-5-청구항 19 제11항에 있어서,상기 제어 정보를 생성하는 단계는,상기 제1 인터페이스를 통하여 실내 습도 정보 및 설정 습도 정보를 수신하면, 상기 수신된 실내 온도 정보, 상기 설정 온도 정보, 상기 실내 습도 정보 및 상기 설정 습도 정보에 기초하여 히터 운전 및 냉방 운전을 동시에하는 동시 운전 모드인지를 판단하고, 동시 운전 모드로 판단되면 히터 운전 및 냉방 운전에 대응되는 제어 정보를 생성하는, 제어 방법."}
{"patent_id": "10-2023-0080492", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "전자 장치의 제어 방법을 실행하는 프로그램을 포함하는 비일시적 컴퓨터 판독 가능 기록매체에 있어서,상기 제어 방법은,양방향 통신 방식을 이용하여 실내 제어기로부터 실내 온도 정보 및 설정 온도 정보를 수신하는 단계;상기 수신된 실내 온도 정보 및 설정 온도 정보에 기초하여 상기 공기조화기에 적용될 제어 정보를 생성하는 단계;상기 생성된 제어 정보에 대응되는 제어 신호를 상기 단방향 통신으로 상기 공기조화기의 실내기에 전송하는 단계;를 포함하는, 제어 방법."}
{"patent_id": "10-2023-0080492", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "전자 장치가 개시된다. 본 전자 장치는, 실내 제어기와 양방향 통신을 수행하는 제1 인터페이스 공기조화기 중 실내기에 제어 신호를 단방향 통신으로 제공하기 위한 제2 인터페이스 적어도 하나의 명령어를 저장하는 메모리 및 메모리와 연결되어 전자 장치를 제어하는 프로세서를 포함하고, 프로세서는, 제1 인터페이스를 통하여 실내 제어기로부터 실내 온도 정보 및 설정 온도 정보를 수신하면, 수신된 실내 온도 정보 및 설정 온도 정보에 기초 하여 공기조화기에 적용될 제어 정보를 생성하고, 생성된 제어 정보에 대응되는 제어 신호를 단방향 통신으로 실 내기에 제공하도록 제1 인터페이스를 제어한다."}
{"patent_id": "10-2023-0080492", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 전자 장치 및 그 제어 방법에 관한 것으로, 더욱 상세하게는 공기조화기를 제어하는 전자 장치 및 그 제어 방법에 관한 것이다."}
{"patent_id": "10-2023-0080492", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "공기조화기는 냉매의 증발 및 응축에서 생기는 열의 이동을 이용하여 공기를 냉각 또는 가열하고, 냉각 또는 가 열된 공기를 토출시켜 실내 공간의 공기를 조화시키는 기기이다. 공기조화기는 냉방 운전 또는 난방 운전 시, 압축기와 실내 열교환기와 실외 열교환기를 통해 냉매를 순환시키고, 실내 열교환기에서 열교환된 공기를 실내 공간으로 토출함으로써 실내 공간을 냉각 또는 가열할 수 있다. 공기조화기는 접점 신호를 발생시키는 실내 제어기를 포함할 수 있고, 실내 제어기를 통해 입력되는 접점 신호 에 따라 메인 제어기는 냉방과 난방을 제어할 수 있다. 그러나, 종래의 메인 제어기는 공기조화기의 접점 신호 만을 이용하여 공기조화기를 제어함에 따라, 에너지 효율이 개선된 제어 방법을 적용할 수 없는 문제가 있다."}
{"patent_id": "10-2023-0080492", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 하나 이상의 실시예에 따른 전자 장치는 실내 제어기와 양방향 통신을 수행하는 제1 인터페이스 공기 조화기 중 실내기에 제어 신호를 단방향 통신으로 제공하기 위한 제2 인터페이스 적어도 하나의 명령어를 저장 하는 메모리 및 메모리와 연결되어 전자 장치를 제어하는 프로세서를 포함하고, 프로세서는, 제1 인터페이스를 통하여 실내 제어기로부터 실내 온도 정보 및 설정 온도 정보를 수신하면, 수신된 실내 온도 정보 및 설정 온도 정보에 기초하여 공기조화기에 적용될 제어 정보를 생성하고, 생성된 제어 정보에 대응되는 제어 신호를 단방향 통신으로 실내기에 제공하도록 제1 인터페이스를 제어한다. 본 개시의 하나 이상의 실시예에 따른 전자 장치의 제어 방법은 양방향 통신 방식을 이용하여 실내 제어기로부 터 실내 온도 정보 및 설정 온도 정보를 수신하는 단계; 상기 수신된 실내 온도 정보 및 설정 온도 정보에 기초 하여 상기 공기조화기에 적용될 제어 정보를 생성하는 단계; 및 상기 생성된 제어 정보에 대응되는 제어 신호를 상기 단방향 통신으로 상기 공기조화기의 실내기에 전송하는 단계;를 포함한다.본 개시의 하나 이상의 실시예에 따른 전자 장치의 제어 방법을 실행하는 프로그램을 포함하는 비일시적 컴퓨터 판독 가능 기록매체에 있어서, 상기 제어 방법은, 양방향 통신 방식을 이용하여 실내 제어기로부터 실내 온도 정보 및 설정 온도 정보를 수신하는 단계; 상기 수신된 실내 온도 정보 및 설정 온도 정보에 기초하여 상기 공 기조화기에 적용될 제어 정보를 생성하는 단계; 및 상기 생성된 제어 정보에 대응되는 제어 신호를 상기 단방향 통신으로 상기 공기조화기의 실내기에 전송하는 단계;를 포함한다."}
{"patent_id": "10-2023-0080492", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또 는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"및/또는\"이라는 용어는 복수의 관련된 기재된 구성요소들의 조합 또는 복수의 관련된 기재된 구성요소들 중의 어느 구성요소를 포함한다. \"제1\", \"제2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하 기 위해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제1) 구성요소가 다른(예: 제2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소 에 직접적으로(예: 유선으로), 무선으로, 또는 제3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. \"포함하다\" 또는 \"가지다\"등의 용어는 본 문서에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는다. 어떤 구성요소가 다른 구성요소와 \"연결\", \"결합\", \"지지\" 또는 \"접촉\"되어 있다고 할 때, 이는 구성요소들이 직접적으로 연결, 결합, 지지 또는 접촉되는 경우뿐 아니라, 제3 구성요소를 통하여 간접적으로 연결, 결합, 지 지 또는 접촉되는 경우를 포함한다. 어떤 구성요소가 다른 구성요소 \"상에\" 위치하고 있다고 할 때, 이는 어떤 구성요소가 다른 구성요소에 접해 있 는 경우뿐 아니라 두 구성요소 사이에 또 다른 구성요소가 존재하는 경우도 포함한다. 도 1은 본 개시의 하나 이상의 실시예에 따른 공기 조화 시스템을 설명하기 위한 시스템도이다. 도 1을 참조하면, 본 개시의 하나 이상의 실시예에 따른 공기 조화 시스템은 공기조화기, 실내 제어기 및 전자 장치를 포함할 수 있다. 그리고, 공기조화기는 실외기 및 실내기를 포함할 수 있다. 다양한 실시예들에 따른 공기조화기는, 공기 조화 공간(이하에서는 \"실내\"라 한다)에서 공기정화, 환기, 습 도 조절, 냉방 또는 난방 등의 기능을 수행하는 장치로서, 이러한 기능들 중 적어도 하나를 구비한 장치를 의미 한다. 일 실시예에 따르면, 공기조화기는 냉방 기능 또는 난방 기능을 수행하기 위해 히트펌프 장치를 포함할 수 있다. 히트펌프 장치는 압축기, 제1열교환기, 팽창 장치 및 제2열교환기를 따라 냉매가 순환되는 냉동사이클을 포함할 수 있다. 공기조화기의 외관을 형성하는 하나의 하우징에 히트펌프 장치의 모든 구성품이 내장될 수 있는데, 창문형 에어컨 또는 이동형 에어컨이 이러한 공기조화기에 해당한다. 다른 한편으로는 하나의 공기 조화기를 형성하는 복수의 하우징에 히트펌프 장치의 일부 구성품이 나뉘어 내장될 수도 있는데, 벽걸이형 에어컨, 스텐드형 에어컨, 시스템 에어컨 등이 여기에 포함된다. 복수의 하우징을 포함하는 공기조화기는 실외에 설치되는 적어도 하나의 실외기와 실내에 설치되는 적 어도 하나의 실내기를 포함할 수 있다. 일 예로 공기조화기는 1개의 실외기와 1개의 실내기가 냉매관을 통해 연결되도록 마련될 수 있다. 일 예로 공기조화기는 1개의 실외기가 냉매관을 통해 2개 이상의 실내기와 연결되도록 마련될 수 있다. 일 예로 공기조화기는 2개 이상의 실외기와 2개 이상 의 실내기가 복수의 냉매관으로 연결되도록 마련될 수 있다. 실외기는 실내기와 전기적으로 연결될 수 있다. 예를 들어, 실외기 또는 실내기에 마련된 입력 인터페이스를 통해 공기조화기를 제어하기 위한 정보(또는 명령)를 입력할 수 있으며, 사용자 입력에 응답 하여 실외기 및 실내기가 동시에 또는 순차적으로 동작할 수 있다. 공기조화기는 실외기에 마련되는 실외 열교환기, 실내기에 마련되는 실내 열교환기, 실외 열교환기 와 실내 열교환기를 연결하는 냉매관을 포함할 수 있다. 실외 열교환기는 냉매의 상 변화(예를 들어, 증발 또는 응축)를 이용하여 냉매와 실외 공기 사이의 열 교환을 수행할 수 있다. 예를 들어, 실외 열교환기에서 냉매가 응축되는 동안 냉매는 실외 공기로 열을 방출하고, 실 외 열교환기에 흐르는 냉매가 증발하는 동안 냉매는 실외 공기에서 열을 흡수할 수 있다. 실내기는 실내에 마련된다. 일 예로 실내기는 배치되는 방법에 따라 천정형 실내기, 스탠드형 실내 기, 벽걸이형 실내기 등으로 구분될 수 있다. 일 예로 천정형 실내기는 공기가 토출되는 방식에 따 라 4-way형 실내기, 1-way 형 실내기, 덕트형 실내기 등으로 구분될 수 있다. 마찬가지로 실내 열교환기는 냉매의 상 변화(예를 들어, 증발 또는 응축)를 이용하여 냉매와 실내 공기 사이의 열 교환을 수행할 수 있다. 예를 들어, 실내기에서 냉매가 증발하는 동안 냉매는 실내 공기에서 열을 흡수 할 수 있으며, 냉각된 실내 열교환기를 거치면서 냉각된 실내 공기를 송풍함으로써 실내가 냉방될 수 있다. 또 한, 실내 열교환기에서 냉매가 응축되는 동안 냉매는 실내 공기로 열을 방출할 수 있으며, 고온의 실내 열교환 기를 거치면서 가열된 실내 공기를 송풍함으로써 실내가 난방될 수 있다. 즉, 공기조화기는 실외 열교환기와 실내 열교환기를 순환하는 냉매의 상 변화 과정을 통해 냉방 또는 난방 기능을 수행하게 되는데, 이러한 냉매의 순환을 위해 공기조화기는 냉매를 압축하는 압축기를 포함할 수 있 다. 압축기는 흡입부를 통해 냉매 가스를 흡입하고, 냉매 가스를 압축할 수 있다. 압축기는 배출부를 통해 고온 고압의 냉매 가스를 배출할 수 있다. 압축기는 실외기 내부에 배치될 수 있다. 냉매는 냉매관을 통해 압축기, 실외 열교환기, 팽창 장치 및 실내 열교환기의 순서로 순환하거나, 또는 압축기, 실내 열교환기, 팽창 장치 및 실외 열교환기의 순서로 순환할 수 있다. 일 예로 공기조화기는 1개의 실외기와 1개의 실내기가 냉매관을 통해 직접 연결될 경우, 냉매는 냉 매관을 통해 1개의 실외기와 1개의 실내기 사이에서 순환되도록 마련될 수 있다. 일 예로 공기조화기는 1개의 실외기가 냉매관을 통해 2개 이상의 실내기와 연결될 경우, 냉매는 실 외기에서부터 분기되는 냉매관을 통해 복수의 실내기로 흐를 수 있다. 복수의 실내기에서 토출된 냉매는 합류되어 실외기로 순환되도록 마련될 수 있다. 일 예로 복수의 실내기는 각각 별도의 냉매관을 통해 직접 1개의 실외기와 병렬적으로 연결될 수 있다. 복수의 실내기는 각각 사용자가 설정한 작동 모드에 따라 독립적으로 작동될 수 있다. 즉, 복수의 실내기 중 일부는 냉방 모드로 작동되고 동시에 다른 일부는 난방 모드로 작동될 수. 이 때, 냉매는 후술할 유로 전환 밸브를 통해 지정된 순환 경로를 따라 선택적으로 고압 또는 저압의 상태로 각각의 실내기로 유입되고, 토출되어 실외기로 순환되도록 마련될 수 있다. 일 예로 공기조화기는 2개 이상의 실외기와 2개 이상의 실내기가 복수의 냉매관을 통해 연결될 시, 복수의 실외기에서 토출된 냉매가 합류되어 하나의 냉매관을 통해 흐르다가 어느 지점에서 다시 분기되어 복수의 실내기로 유입될 수 있다. 복수의 실외기는 복수의 실내기의 운전량에 따른 운전 부하에 따라 모두 구동되거나 적어도 일부는 구 동되지 않을 수 있다. 이 때 냉매는 유로 전환 밸브를 통해 선택적으로 구동되는 실외기로 유입되어 순환되 도록 마련될 수 있다. 공기조화기는 열교환기로 유입되는 냉매의 압력을 낮추기 위해 팽창 장치를 포함할 수 있다. 일 예로 팽창 장치는 실내기 내부 또는 실외기 내부에 배치될 수 있으며, 양쪽 모두에 배치될 수도 있다. 팽창 장치는 일 예로 교축 효과를 이용하여 냉매의 온도 및 압력을 낮출 수 있다. 팽창 장치는 유로의 단면적 을 감소시킬 수 있는 오리피스(orifice)를 포함할 수 있다. 오리피스를 통과한 냉매는 온도 및 압력이 낮아질 수 있다. 팽창 장치는 일 예로 개방 비율(완전 개방된 상태에서 밸브의 유로의 단면적에 대한 부분 개방된 상태에서 밸브 의 유로의 단면적의 비율)를 조절할 수 있는 전자 팽창 밸브로 구현될 수 있다. 전자 팽창 밸브의 개방 비율에 의존하여 팽창 장치를 통과하는 냉매의 양이 제어될 수 있다. 공기조화기는 냉매 순환 유로상에 배치되는 유로 전환 밸브를 더 포함할 수 있다. 유로 전환 밸브는 예를 들어 4방 밸브(4-way valve)를 포함할 수 있다. 유로 전환 밸브는 실내기의 운전 모드(예를 들어, 냉방 운 전 또는 난방 운전)에 의존하여 냉매의 순환 경로를 결정할 수 있다. 유로 전환 밸브는 압축기의 배출부에 연결 될 수 있다. 공기조화기는 어큐뮬레이터를 포함할 수 있다. 어큐뮬레이터는 압축기의 흡입부에 연결될 수 있다. 어큐뮬 레이터에는, 실내 열교환기 또는 실외 열교환기에서 증발된 저온 저압의 냉매가 유입될 수 있다. 어큐뮬레이터는 냉매 액과 냉매 가스가 혼합된 냉매가 유입될 시 냉매 가스에서 냉매 액을 분리하고, 냉매 액이 분리된 냉매 가스를 압축기에 제공할 수 있다. 실외 열교환기의 인근에는 실외 팬이 마련될 수 있다. 실외 팬은 냉매와 실외 공기 사이의 열 교환이 촉진되도 록 실외 열교환기에 실외 공기를 송풍할 수 있다. 공기조화기의 실외기는 적어도 하나의 센서를 포함할 수 있다. 일 예로 실외기의 센서는 환경 센서 로 마련될 수 있다. 실외기 센서는, 실외기의 내부 또는 외부의 임의의 위치에 배치될 수 있다. 일 예 로 실외기 센서는 예를 들어 실외기 주변의 공기 온도를 감지하기 위한 온도 센서, 실외기 주변의 공기 습도를 감지하기 위한 습도 센서, 또는 실외기를 통과하는 냉매관의 냉매 온도를 감지하기 위한 냉매 온도 센서, 또는 실외기를 통과하는 냉매관의 냉매 압력을 감지하기 위한 냉매 압력 센서를 포함할 수 있다. 공기조화기의 실외기는 실외기 통신부를 포함할 수 있다. 실외기 통신부는 후술할 공기조화기 의 실내기의 제어부로부터 제어 신호를 수신하도록 마련될 수 있다. 실외기는 실외기 통신부를 통해 수신된 제어 신호에 기초하여 압축기, 실외 열교환기, 팽창 장치, 유로 전환 밸브, 어큐뮬레이터, 또는 실 외 팬의 동작을 제어할 수 있다. 실외기는 실외기 센서로부터 검출된 센싱값을 실외기 통신부를 통 해 실내기의 제어부로 송신할 수 있다. 공기조화기의 실내기는 하우징과, 하우징의 내부 또는 외부로 공기를 순환시키는 송풍기와, 하우징의 내부로 유입되는 공기와 열 교환하는 실내 열교환기를 포함할 수 있다. 하우징은 흡입구를 포함할 수 있다. 흡입구를 통해 실내의 공기는 하우징의 내부로 유입될 수 있다. 공기조화기의 실내기는 흡입구를 통해 하우징 내부로 유입되는 공기 중의 이물질을 여과하도록 마련되 는 필터를 포함할 수 있다. 하우징은 배출구를 포함할 수 있다. 하우징 내부에서 유동되는 공기는 배출구를 통해 하우징의 외부로 배출될 수 있다.실내기의 하우징에는 배출구를 통해 배출되는 공기의 방향을 가이드하는 기류 가이드가 마련될 수 있다. 일 예로 기류 가이드는 배출구 상에 위치하는 블레이드를 포함할 수 있다. 일 예로 기류 가이드는 배출 기류를 조 절하기 위한 보조 팬을 포함할 수 있다. 이에 한정되지 않고 기류 가이드는 생략될 수 있다. 실내기의 하우징 내부에는 흡입구와 배출구를 연결하는 유로 상에 배치되는 실내 열교환기와 송풍기가 마련 될 수 있다. 송풍기는 실내 팬과 팬모터를 포함할 수 있다. 일례로 실내 팬은 축류팬, 사류팬, 크로스플로우팬, 원심팬을 포 함할 수 있다. 실내 열교환기는 송풍기와 배출구 사이에 배치되거나, 흡입구와 송풍기 사이에 배치될 수 있다. 실내 열교환기 는 흡입구를 통해 유입된 공기로부터 열을 흡수하거나, 흡입구를 통해 유입된 공기로 열을 전달할 수 있다. 실 내 열교환기는 내부에 냉매가 흐르는 열교환관과, 전열 면적을 증가시키도록 열교환관과 접하고 있는 열교환핀 을 포함할 수 있다. 공기조화기의 실내기는 실내 열교환기의 아래에 배치되어 실내 열교환기에서 발생되는 응축수를 집수하 는 드레인 트레이를 포함할 수 있다. 드레인 트레이에 수용된 응축수는 배수 호스를 통해 외부로 배수될 수 있 다. 드레인 트레이는 실내 열교환기를 지지하도록 마련될 수 있다. 공기조화기의 실내기는 입력 인터페이스를 포함할 수 있다. 입력 인터페이스는 버튼, 스위치, 터치 스 크린 및/또는 터치 패드를 포함한 임의의 유형의 사용자 입력 수단을 포함할 수 있다. 사용자는 입력 인터페이 스를 통해 설정 데이터(예컨대, 희망 실내 온도, 냉방/난방/제습/공기청정의 운전 모드 설정, 토출구 선택 설정, 및/또는 풍량 설정)를 직접 입력할 수 있다. 입력 인터페이스는 외부 입력 장치와 연결될 수도 있다. 예를 들면, 입력 인터페이스는 유선 리모트 컨트롤러와 전기적으로 연결될 수 있다. 유선 리모트 컨트롤러는 실내 공간의 특정 위치(예: 벽면의 일 부분)에 설치될 수 있다. 사용자는 유선 리모트 컨트롤러를 조작하여 공기조화기의 동작에 관한 설정 데이터를 입력할 수 있다. 유선 리모트 컨트롤러를 통해 획득된 설정 데이터에 대응하는 전기적 신호가 입력 인터페이스로 전송될 수 있다. 또한, 입력 인터페이스는 적외선 센서를 포함할 수 있다. 사용자는 무선 리모트 컨트롤러를 이용하여 원격으로 공기조화기의 동작에 관한 설정 데이터를 입력할 수 있다. 무선 리모트 컨트롤러를 통해 입력된 설정 데이터는 적외선 신호로 입력 인터페이스에 전송될 수 있다. 또한, 입력 인터페이스는 마이크로폰을 포함할 수 있다. 사용자의 음성 명령이 마이크로폰을 통해 획득될 수 있 다. 마이크로폰은 사용자의 음성 명령을 전기적 신호로 변환하고, 변환된 전기적 신호를 실내기 제어부에 전달할 수 있다. 실내기 제어부는 사용자의 음성 명령에 대응하는 기능을 실행하기 위해 공기조화기의 구성들을 제어할 수 있다. 입력 인터페이스를 통해 획득된 설정 데이터(예컨대, 희망 실내 온도, 냉방/난방/제 습/공기청정의 운전 모드 설정, 토출구 선택 설정, 및/또는 풍량 설정)는 후술하는 실내기 제어부로 전달될 수 있다. 일 예에서, 입력 인터페이스를 통해 획득된 설정 데이터가 후술할 실내기 통신부를 통해 외부, 즉 실외기나 서버로 전송될 수 있다. 공기조화기의 실내기는 전력 모듈을 포함할 수 있다. 전력 모듈은 외부 전원에 연결되어 실내기의 구성 요소들에 전력을 공급할 수 있다. 공기조화기의 실내기는 실내기 센서를 포함할 수 있다. 실내기 센서는 하우징의 내부 또는 외 부의 공간에 배치되는 환경 센서일 수 있다. 일 예로 실내기 센서는, 실내기의 하우징 내부 또는 외부 의 미리 정해 공간에 배치된 하나 이상의 온도 센서 및/또는 습도 센서를 포함할 수 있다. 일 예로 실내기 센서는 실내기를 통과하는 냉매관의 냉매 온도를 감지하기 위한 냉매 온도 센서를 포함할 수 있다. 일 예로 실내기 센서는, 실내 열교환기를 통과하는 냉매관의 입구, 중간, 및/또는 출구 온도를 감지하는 각각의 냉 매 온도 센서를 포함할 수 있다. 일 예로 실내기 센서에 의해 감지된 각각의 환경 데이터는, 후술하는 실내기 제어부로 전달되거나, 후 술할 실내기 통신부를 통해 외부로 전송될 수 있다. 공기조화기의 실내기는 실내기 통신부를 포함할 수 있다. 실내기 통신부는 근거리 통신 모듈 또는 원거리 통신 모듈 중 적어도 하나를 포함할 수 있다. 실내기 통신부는 다른 장치와 무선으로 통신하기 위한 적어도 하나의 안테나를 포함할 수 있다. 실외기는 실외기 통신부를 포함할 수 있다. 실외기 통신부도 근거리 통신 모듈 또는 원거리 통신 모듈 중 적어도 하나를 포함할 수 있다.근거리 통신 모듈(short-range wireless communication module)은, 블루투스 통신 모듈, BLE(Bluetooth Low Energy) 통신 모듈, 근거리 무선 통신 모듈(Near Field Communication module), WLAN(와이파이) 통신 모듈, 지 그비(Zigbee) 통신 모듈, 적외선(IrDA, infrared Data Association) 통신 모듈, WFD(Wi-Fi Direct) 통신 모듈, UWB(ultrawideband) 통신 모듈, Ant+ 통신 모듈, 마이크로 웨이브(uWave) 통신 모듈 등을 포함할 수 있으나, 이에 한정되는 것은 아니다. 원거리 통신 모듈은, 다양한 종류의 원거리 통신을 수행하는 통신 모듈을 포함할 수 있으며, 이동 통신부를 포 함할 수 있다. 이동 통신부는 이동 통신망 상에서 기지국, 외부의 단말, 서버 중 적어도 하나와 무선 신호를 송 수신한다. 실내기 통신부는 주변의 접속 중계기(AP: Access point)를 통해 서버, 모바일 장치, 다른 가전 기기 등의 외부 장치와 통신할 수 있다. 접속 중계기(AP)는 공기조화기 또는 사용자 기기가 연결된 지역 네트워크 (LAN)를 서버가 연결된 광역 네트워크(WAN)에 연결시킬 수 있다. 공기조화기 또는 사용자 기기는 광역 네트 워크(WAN)를 통해 서버에 연결될 수 있다. 공기조화기의 실내기는 송풍기 등을 포함하는 실내기의 구성들을 제어하는 실내기 제어부를 포함할 수 있다. 공기조화기의 실외기는 압축기 등을 포함하는 실외기의 구성들을 제어하는 실외기 제어부를 포함할 수 있다. 실내기 제어부는 실내기 통신부 및 실외기 통신부를 통해 실외기 제어부와 통신할 수 있다. 실외기 통신부는 실외기 제어부에 의해 생성되는 제어 신호를 실내기 통신부로 전송하거나, 실내기 통신부로부터 전송되는 제어 신호를 실외기 제어부로 전달할 수 있다. 즉, 실외기와 실내기는 양방향 통신을 할 수 있다. 실외기와 실내기는 공기조화기의 동작 중 생성되는 다양한 신호들을 송신 및 수신할 수 있다. 실외기 제어부는 실외기의 구성 요소들과 전기적으로 연결될 수 있고, 각 구성 요소들의 동작을 제어할 수 있다. 예를 들면, 실외기 제어부는 압축기의 주파수를 조절할 수 있고, 냉매의 순환 방향이 전환되도록 유로 전환 밸브를 제어할 수 있다. 실외기 제어부는 실외팬의 회전 속도를 조절할 수 있다. 또한, 실외기 제어부는 팽창 밸브의 개도를 조절하기 위한 제어 신호를 생성할 수 있다. 실외기 제어부의 제어 하에, 압축기, 유로 전환 밸브, 실외 열교환기, 팽창 밸브 및 실내 열교환기를 포함하는 냉매 순환 회로를 따라 냉매가 순환할 수 있다. 실외기와 실내기에 포함된 다양한 온도 센서들은 각각 검출한 온도에 대응하는 전기적 신호를 실외기 제어부 및/또는 실내기 제어부로 전송할 수 있다. 예를 들면, 실외기와 실내기에 포함된 습도 센서들은 각각 검출한 습도에 대응하는 전기적 신호를 실외기 제어부 및/또는 실내기 제어부로 전송할 수 있다. 실내기 제어부는 실내기 통신부를 통해 모바일 디바이스 등을 포함하는 사용자 장치로부터 사용자 입력 을 획득할 수 있으며, 입력 인터페이스를 통해 직접 또는 리모트 컨트롤러를 통하여 사용자 입력을 획득할 수 있다. 실내기 제어부는 수신된 사용자 입력에 응답하여 송풍기 등을 포함하는 실내기의 구성들을 제어 할 수 있다. 실내기 제어부는 수신된 사용자 입력에 관한 정보를 실외기의 실외기 제어부에 전송할 수 있다. 실외기 제어부는 실내기로부터 수신된 사용자 입력에 관한 정보에 기초하여 압축기 등을 포함하는 실외 기의 구성들을 제어할 수 있다. 예를 들면, 실외기 제어부는 냉방 운전, 난방 운전, 송풍 운전, 제상 운전 또는 제습 운전과 같은 운전 모드를 선택하는 사용자 입력에 대응하는 제어 신호가 실내기로부터 수신 되면, 선택된 운전 모드에 대응하는 공기조화기의 동작이 수행되도록 실외기의 구성들을 제어할 수 있 다. 실외기 제어부 및 실내기 제어부는 각각 프로세서와 메모리를 포함할 수 있다. 실내기 제어부는 적 어도 하나의 제1 프로세서와 적어도 하나의 제1 메모리를 포함하고, 실외기 제어부는 적어도 하나의 제2 프 로세서와 적어도 하나의 제2 메모리를 포함할 수 있다. 메모리는 공기조화기의 동작에 필요한 각종 정보를 기억/저장할 수 있다. 메모리는 공기조화기의 동작 에 필요한 인스트럭션, 어플리케이션, 데이터 및/또는 프로그램을 저장할 수 있다. 예를 들면, 메모리는 공기조 화기의 냉방 운전, 난방 운전, 제습 운전 및/또는 제상 운전을 위한 다양한 프로그램들을 저장할 수 있다. 메모리는 데이터를 일시적으로 기억하기 위한 S-램(Static Random Access Memory, S-RAM), D-램(Dynamic Random Access Memory)과 같은 휘발성 메모리를 포함할 수 있다. 또한, 메모리는 데이터를 장기간 저장하기 위 한 롬(Read Only Memory), 이피롬(Erasable Programmable Read Only Memory: EPROM), 이이피롬(ElectricallyErasable Programmable Read Only Memory: EEPROM)과 같은 비휘발성 메모리를 포함할 수 있다. 프로세서는 메모리에 저장된 인스트럭션, 어플리케이션, 데이터 및/또는 프로그램에 기초하여 공기조화기의 동작을 제어하기 위한 제어 신호를 생성할 수 있다. 프로세서는 하드웨어로서, 논리 회로와 연산 회로를 포함할 수 있다. 프로세서는 메모리로부터 제공된 프로그램 및/또는 인스트럭션에 따라 데이터를 처리하고, 처리 결과 에 따라 제어 신호를 생성할 수 있다. 메모리와 프로세서는 하나의 제어 회로로 구현되거나 복수의 회로로 구현 될 수 있다. 공기조화기의 실내기는 출력 인터페이스를 포함할 수 있다. 출력 인터페이스는 실내기 제어부와 전 기적으로 연결되고, 실내기 제어부의 제어 하에 공기조화기의 동작과 관련된 정보를 출력할 수 있다. 예를 들면, 사용자 입력에 의해 선택된 운전 모드, 풍향, 풍량, 온도와 같은 정보가 출력될 수 있다. 또한, 출 력 인터페이스는 실내기 센서 또는 실외기 센서로부터 획득된 센싱 정보, 경고/오류 메시지를 출력할 수 있다. 출력 인터페이스는 디스플레이 및 스피커를 포함할 수 있다. 스피커는 음향 장치로서 다양한 사운드를 출력할 수 있다. 디스플레이는 사용자가 입력한 정보 또는 사용자에게 제공되는 정보를 다양한 그래픽 엘리먼트로 표시 할 수 있다. 예를 들면, 공기조화기의 동작 정보가 이미지 또는 텍스트 중 적어도 하나로 표시될 수 있다. 또한, 디스플레이는 특정 정보를 제공하는 인디케이터를 포함할 수 있다. 디스플레이는 LCD 패널(Liquid Crystal Display Panel), LED 패널(Light Emitting Diode Panel), OLED 패널(Organic Light Emitting Diode Panel), 마이크로 LED 패널 및/또는 복수의 LED들을 포함할 수 있다. 또한 공기 조화 시스템은 실내 제어기 및 전자 장치를 포함할 수 있다. 전자 장치는 실외기 , 실내기 및 실내 제어기와 전기적으로 연결될 수 있다. 전자 장치는 실외기, 실내기 및 실내 제어기와 무선 또는 유선으로 연결될 수 있다. 실내 제어기는 공기 조화 시스템을 제어하는 사용자 입력을 획득하고, 사용자 입력에 대한 정보를 전송하기 위한 장치일 수 있다. 여기서, 실내 제어기는 입력 인터페이스를 포함할 수 있다. 입력 인터페이스는 버튼, 스위치, 터치 스크린 및/또는 터치 패드를 포함한 임의의 유형의 사용자 입력 수단을 포함할 수 있다. 실내 제어기는 입력 인터페이스를 통해 사용자로부터 공기조화기의 동작에 관한 설정 데이터(예컨대, 희망 실내 온도, 냉방/난방/제습/공기청정의 운전 모드 설정, 토출구 선택 설정, 및/또는 풍량 설정)를 입력받 을 수 있다. 실내 제어기의 입력 인터페이스는 외부 입력 장치와 연결될 수도 있다. 예를 들면, 입력 인터페이스는 유선 리모트 컨트롤러와 전기적으로 연결될 수 있다. 유선 리모트 컨트롤러는 실내 공간의 특정 위치(예: 벽면의 일 부분)에 설치될 수 있다. 사용자는 유선 리모트 컨트롤러를 조작하여 공기조화기의 동작에 관한 설정 데이 터를 입력할 수 있다. 유선 리모트 컨트롤러를 통해 획득된 설정 데이터에 대응하는 전기적 신호가 입력 인터페 이스로 전송될 수 있다. 또한, 입력 인터페이스는 적외선 센서를 포함할 수 있다. 사용자는 무선 리모트 컨트롤 러를 이용하여 원격으로 공기조화기의 동작에 관한 설정 데이터를 입력할 수 있다. 무선 리모트 컨트롤러를 통해 입력된 설정 데이터는 적외선 신호로 입력 인터페이스에 전송될 수 있다. 또한, 실내 제어기의 입력 인터페이스는 마이크로폰을 포함할 수 있다. 사용자의 음성 명령이 마이크로폰을 통해 획득될 수 있다. 마이크로폰은 사용자의 음성 명령을 전기적 신호로 변환하고, 변환된 전기적 신호를 실내 제어기의 제어부에 전달할 수 있다. 또는, 실내 제어기는 실내 제어기의 통신 인터페이스를 통해 모바일 디바이스 등을 포함하는 사용자 장 치로부터 사용자 입력을 획득할 수 있다. 실내 제어기는 적어도 하나의 센서를 포함할 수 있다. 이 때, 실내 제어기의 센서는 환경 센서로 마련 될 수 있다. 실내 제어기의 센서는, 실내 제어기의 내부 또는 외부의 임의의 위치에 배치될 수 있다. 일 예로 실내 제어기의 센서는 예를 들어 실내 제어기 주변의 공기 온도를 감지하기 위한 온도 센서, 실내 제어기 주변의 공기 습도를 감지하기 위한 습도 센서를 포함할 수 있다. 즉, 실내 제어기는 실내 제어기의 센서를 이용하여 실내 환경 데이터를 획득할 수 있다. 한편, 실내 제어기는 실내 제어기에 포함된 센서를 통해 실내 환경 데이터를 획득할 수 있으나, 이는 일 실시예에 불과할 뿐, 실내 제어기는 외부 센서와 통신을 수행하며, 외부 센서로부터 획득된 실내 환경데이터를 획득할 수 있다. 그리고, 실내 제어기는 공기조화기의 동작에 관한 설정 데이터와 실내 환경 데이터를 전자 장치로 전송할 수 있다. 이 때, 실내 제어기는 단방향으로 전기적 신호만을 전달할 수 있는 접점 통신 방식이 아닌 양방향 통신이 가능한 통신 방식을 통해 설정 데이터와 환경 데이터를 전자 장치로 전송할 수 있다. 설정 데이터와 환경 데이터에 기초하여, 전자 장치는 공기조화기의 구성들을 제어할 수 있다. 전자 장치는 실내 제어기, 실외기 및 실내기와 전기적으로 또는 유무선으로 연결될 수 있다. 이 때, 전기 장치는 실내 제어기로부터 데이터를 수신하고, 공기조화기를 제어하기 위한 제어 데 이터 또는 제어 신호를 공기조화기의 각 구성으로 전송할 수 있다. 즉, 전자 장치는 실외기와 실 내기의 동작을 제어하는 제어 장치일 수 있다. 여기서, 전자 장치는 '메인 제어기'로 호칭될 수 있으 나, 이에 한정되는 것은 아니다. 전자 장치는 실외기를 실내기에 연결하는 어댑터 역할을 수행할 수 있다. 전자 장치는 실외 기의 제조사와 동일한 제조사에 의해 생산된 실내기를 제어할 수 있을 뿐만 아니라, 다른 제조사에 의 해 생산된 실내기 및/또는 다른 통신 프로토콜을 갖는 실내기까지 제어할 수 있도록 마련된다. 도 2는 본 개시의 하나 이상의 실시예에 따른 전자 장치의 구성을 설명하기 위한 블록도이다. 전자 장치는 메모리, 통신 인터페이스 및 프로세서를 포함할 수 있다. 상기 구성요소 중 일부는 생략될 수 있으며, 전자 장치는 다른 구성요소를 더 포함할 수 있다. 메모리는 전자 장치에 관한 적어도 하나의 명령어(instruction)를 저장할 수 있다. 메모리는 전 자 장치를 구동시키기 위한 O/S(Operating System)를 저장할 수 있다. 또한, 메모리는 본 개시의 다 양한 실시 예들에 따라 전자 장치가 동작하기 위한 각종 소프트웨어 프로그램이나 애플리케이션을 저장할 수 있다. 그리고, 메모리는 플래시 메모리(Flash Memory) 등과 같은 반도체 메모리나 하드디스크(Hard Disk) 등과 같은 자기 저장 매체 등을 포함할 수 있다. 구체적으로, 메모리는 본 개시의 다양한 실시 예에 따라 전자 장치가 동작하기 위한 각종 소프트웨어 모듈을 저장할 수 있으며, 프로세서는 메모리에 저장된 각종 소프트웨어 모듈을 실행하여 전자 장치 의 동작을 제어할 수 있다. 즉, 메모리는 프로세서에 의해 액세스되며, 프로세서에 의한 데이터의 독취/기록/수정/삭제/갱신 등이 수행될 수 있다. 한편, 본 개시에서 메모리라는 용어는 메모리, 프로세서 내 롬(미도시), 램(미도시) 또는 전자 장치에 장착되는 메모리 카드(미도시)(예를 들어, micro SD 카드, 메모리 스틱)를 포함하는 의미로 사용될 수 있다. 그리고, 통신 인터페이스는 회로(circuitry)를 포함하며, 실내 제어기, 실외기 및 실내기와 통신할 수 있는 구성이다. 통신 인터페이스는 유선 또는 무선 통신 방식에 기초하여 실내 제어기, 실 외기 및 실내기와 통신을 수행할 수 있다. 통신 인터페이스는 양방향 통신을 수행할 수 있는 적어도 하나의 인터페이스 및 단방향 통신을 수행할 수 있는 적어도 하나의 인터페이스를 포함할 수 있다. 즉, 통신 인터페이스는 양방향 통신을 수행할 수 있는 인터페이스를 통해 실내 제어기, 실외기 및 실내기 중 적어도 하나와 통신을 수행할 수 있다. 예를 들어, 통신 인터페이스는 RS 485 통신 규격에 대응되는 RS 485 신호를 송수신할 수 있는 인터페이스를 포함할 수 있다. 이 때, 통신 인터페이스는 RS 485 신호를 송수신할 수 있는 인터페이스를 통해 양방향 통신을 수행할 수 있다. 또는, 통신 인터페이스는 단방향 통신을 수행할 수 있는 인터페이스를 통해 실내 제어기, 실외기 및 실내기 중 적어도 하나와 통신을 수행할 수 있다. 예를 들어, 단방향 통신을 수행할 수 있는 인터페이스 는 적어도 하나의 접점 단자를 포함할 수 있다. 그리고, 단방향 통신을 수행할 수 있는 인터페이스는 스위치 또 는 스위칭 소자를 제어하여 접점 단자를 통해 접점 신호를 전송할 수 있다. 이 때, 접점 신호는 접점이 열려 있 는지 닫혀 있는지의 상태를 표시하는 신호를 의미할 수 있다. 본 개시의 하나 이상의 실시예에 따르면, 도 2에 도시된 바와 같이, 통신 인터페이스는 양방향 통신을 수 행할 수 있는 제1 인터페이스를 통해 실내 제어기와 양방향 통신을 수행할 수 있다. 즉, 통신 인터페이스 는 실내 제어기로부터 데이터를 수신하고, 실내 제어기로 데이터를 송신할 수 있다. 그리고, 통신 인터페이스는 양방향 통신을 수행할 수 있는 제2 인터페이스를 통해 실외기와 양방향 통 신을 수행할 수 있다. 즉, 통신 인터페이스는 실외기로부터 데이터를 수신하고, 실외기로 데이터 를 송신할 수 있다. 그리고, 통신 인터페이스는 단방향 통신을 수행할 수 있는 제3 인터페이스를 통해 실내기와 단방향 통 신을 수행할 수 있다. 이 때, 통신 인터페이스는 실내기를 제어하기 위한 제어 신호를 접점 신호의 형 태로 실내기로 전송할 수 있다. 또한, 통신 인터페이스는 블루투스 모듈(미도시), 와이파이 모듈(미도시), IR(infrared) 모듈, 지그비 (zigbee) 모듈, LAN(Local Area Network) 모듈, 이더넷(Ethernet) 모듈 등을 포함할 수 있다. 여기서, 각 통신 모듈은 적어도 하나의 하드웨어 칩 형태로 구현될 수 있다. 무선 통신 모듈은 상술한 통신 방식 이외에 USB(Universal Serial Bus), MIPI CSI(Mobile Industry Processor Interface Camera Serial Interface), 3G(3rd Generation), 3GPP(3rd Generation Partnership Project), LTE(Long Term Evolution), LTE-A(LTE Advanced), 4G(4th Generation), 5G(5th Generation)등과 같은 다양한 무선 통신 규격에 따라 통신을 수행하는 적어도 하나의 통신 칩을 포함할 수 있다. 다만 이는 일 실시 예에 불과하며 통신 인터페이스는 다양한 통 신 모듈 중 적어도 하나의 통신 모듈을 이용할 수 있다. 통신 인터페이스는 상술한 통신 모듈을 통해 모바 일 디바이스 등을 포함하는 사용자 장치, 가전 기기, 외부 센서, 서버 등과 통신을 수행할 수 있다. 또한, 통신 인터페이스는 상술한 모듈을 통해서도 실내 제어기, 실외기, 실내기 등과 통신을 수행하며, 데이터 및 신호를 송신 또는 수신할 수 있다. 프로세서는 전자 장치의 전반적인 동작 및 기능을 제어할 수 있다. 구체적으로, 프로세서는 메 모리를 포함하는 전자 장치의 구성과 연결되며, 상술한 바와 같은 메모리에 저장된 적어도 하나 의 명령어를 실행함으로써, 전자 장치의 동작을 전반적으로 제어할 수 있다. 프로세서는 다양한 방식으로 구현될 수 있다. 예를 들어, 프로세서는 주문형 집적 회로(Application Specific Integrated Circuit, ASIC), 논리 집적 회로(Logic Integrated Circuit), 임베디드 프로세서, 마이크 로 프로세서, 하드웨어 컨트롤 로직, 하드웨어 유한 상태 기계(hardware Finite State Machine, FSM), 디지털 신호 프로세서(Digital Signal Processor, DSP) 중 적어도 하나로 구현될 수 있다. 특히, 프로세서는 하나 이상의 프로세서를 포함할 수 있다. 구체적으로, 하나 이상의 프로세서는 CPU(Central Processing Unit), GPU (Graphics Processing Unit), APU (Accelerated Processing Unit), MIC (Many Integrated Core), DSP (Digital Signal Processor), NPU (Neural Processing Unit), MPU(Main Processing Unit), 하드웨어 가속기 또는 머신 러닝 가속기 중 하나 이상을 포함할 수 있다. 하나 이상의 프로 세서는 전자 장치의 다른 구성요소 중 하나 또는 임의의 조합을 제어할 수 있으며, 통신에 관한 동작 또는 데이 터 처리를 수행할 수 있다. 하나 이상의 프로세서는 메모리에 저장된 하나 이상의 프로그램 또는 명령어 (instruction)를 실행할 수 있다. 예를 들어, 하나 이상의 프로세서는 메모리에 저장된 하나 이상의 명령어를 실행함으로써, 본 개시의 일 실시 예에 따른 방법을 수행할 수 있다. 본 개시의 하나 이상의 실시예에 따른 방법이 복수의 동작을 포함하는 경우, 복수의 동작은 하나의 프로세서에 의해 수행될 수도 있고, 복수의 프로세서에 의해 수행될 수도 있다. 즉, 하나 이상의 실시예에 따른 방법에 의 해 제1 동작, 제2 동작, 제3 동작이 수행될 때, 제1 동작, 제2 동작, 및 제3 동작 모두 제1 프로세서에 의해 수 행될 수도 있고, 제1 동작 및 제2 동작은 제1 프로세서(예를 들어, 범용 프로세서)에 의해 수행되고 제3 동작은 제2 프로세서(예를 들어, 인공지능 전용 프로세서)에 의해 수행될 수도 있다. 하나 이상의 프로세서는 하나의 코어를 포함하는 단일 코어 프로세서(single core processor)로 구현될 수도 있 고, 복수의 코어(예를 들어, 동종 멀티 코어 또는 이종 멀티 코어)를 포함하는 하나 이상의 멀티 코어 프로세서 (multicore processor)로 구현될 수도 있다. 하나 이상의 프로세서가 멀티 코어 프로세서로 구현되는 경우, 멀 티 코어 프로세서에 포함된 복수의 코어 각각은 캐시 메모리, 온 칩(On-chip) 메모리와 같은 프로세서 내부 메 모리를 포함할 수 있으며, 복수의 코어에 의해 공유되는 공통 캐시가 멀티 코어 프로세서에 포함될 수 있다. 또 한, 멀티 코어 프로세서에 포함된 복수의 코어 각각(또는 복수의 코어 중 일부)은 독립적으로 본 개시의 하나 이상의 실시예에 따른 방법을 구현하기 위한 프로그램 명령을 판독하여 수행할 수도 있고, 복수의 코어 전체(또 는 일부)가 연계되어 본 개시의 하나 이상의 실시예에 따른 방법을 구현하기 위한 프로그램 명령을 판독하여 수행할 수도 있다. 본 개시의 하나 이상의 실시예에 따른 방법이 복수의 동작을 포함하는 경우, 복수의 동작은 멀티 코어 프로세서 에 포함된 복수의 코어 중 하나의 코어에 의해 수행될 수도 있고, 복수의 코어에 의해 수행될 수도 있다. 예를 들어, 하나 이상의 실시예에 따른 방법에 의해 제1 동작, 제2 동작, 및 제3 동작이 수행될 때, 제1 동작, 제2 동작, 및 제3 동작 모두 멀티 코어 프로세서에 포함된 제1 코어에 의해 수행될 수도 있고, 제1 동작 및 제2 동 작은 멀티 코어 프로세서에 포함된 제1 코어에 의해 수행되고 제3 동작은 멀티 코어 프로세서에 포함된 제2 코 어에 의해 수행될 수도 있다. 본 개시의 실시예들에서, 프로세서는 하나 이상의 프로세서 및 기타 전자 부품들이 집적된 시스템 온 칩 (SoC), 단일 코어 프로세서, 멀티 코어 프로세서, 또는 단일 코어 프로세서 또는 멀티 코어 프로세서에 포함된 코어를 의미할 수 있으며, 여기서 코어는 CPU, GPU, APU, MIC, DSP, NPU, 하드웨어 가속기 또는 기계 학습 가속 기 등으로 구현될 수 있으나, 본 개시의 실시예들이 이에 한정되는 것은 아니다. 본 개시의 다양한 실시 예를 구현하기 위한 프로세서의 동작은 복수의 모듈을 통해 구현될 수 있다. 구체적으로, 본 개시에 따른 복수의 모듈에 대한 데이터는 메모리에 저장될 수 있고, 프로세서는 메 모리에 엑세스하여 복수의 모듈에 대한 데이터를 프로세서 내부의 메모리 또는 버퍼에 로딩한 후, 복 수의 모듈을 이용하여 본 개시에 따른 다양한 실시예를 구현할 수 있다. 다만, 본 개시에 따른 복수의 모듈 중 적어도 하나는 하드웨어로 구현되어 시스템 온 칩(system on chip)의 형 태로 프로세서내에 포함될 수도 있다. 또는, 본 개시에 따른 복수의 모듈 중 적어도 하나는 별도의 외부 장치로 구현될 수 있으며, 전자 장치 및 각 모듈은 통신을 수행하며 본 개시에 따른 동작을 수행할 수 있다. 도 3은 본 개시의 하나 이상의 실시예에 따른 전자 장치의 내부를 설명하기 위한 도면이다. 도 3을 참조하면, 전자 장치는 메인 회로 기판과 복수의 접점 단자들을 포함할 수 있다. 메인 회로 기판에는 메모리와 프로세서가 실장될 수 있다. 프로세서는 '마이콤(Micom)'으로 호 칭될 수도 있다. 통신 인터페이스는 접점 단자들 외에도 다른 장치들과 연결을 위한 단자 블록들을 통해 외부 기기와 통신할 수 있다. 복수의 접점 단자들에는 실외기, 실내기 및 실내 제어기가 연결될 수 있다. 접점 단자들(10 2)과 실외기, 실내기 및 실내 제어기 각각은 전선 및/또는 케이블로 연결될 수 있다. 도 4는 본 개시의 하나 이상의 실시예에 따른 전자 장치와 실내 제어기, 실외기 및 실내기 사 이의 통신을 설명하기 위한 도면이다. 도 4를 참조하면, 실외기는 접점 단자들 중 F1 단자와 F2 단자에 연결될 수 있다. 프로세서는 F1 단자를 통해 실외기로 데이터를 전송하고, F2 단자를 통해 실외기로부터 데이터를 수신할 수 있다. 그리고, 실내 제어기는 접점 단자들 중 F3 단자와 F4 단자에 연결될 수 있다. 프로세서는 F3 단 자를 통해 실내 제어기로 데이터를 전송하고, F4 단자를 통해 실내 제어기로부터 데이터를 수신할 수 있다. 즉, 종래 기술에 따른 실내 제어기는 단방향 통신이 가능한 인터페이스를 통해 전자 장치와 연결되었 으나, 본 개시에 따른 실내 제어기는 양방향 통신이 가능한 인터페이스를 통해 전자 장치와 연결될 수 있다. 이에 따라, 전자 장치는 실내 제어기로부터 공기조화기의 동작과 관련된 설정 데이터 및 실 내 환경 데이터를 수신할 수 있으며, 수신된 데이터를 이용하여 실외기 및 실내기를 정밀하게 제어할 수 있다. 이에 따라, 특정 실내 환경 조건을 만족하기 위해 공기조화기에서 소요되는 전력 소비량이 감소하 고, 에너지가 효율적으로 사용될 수 있는 효과가 있다. 한편, 실내기는 접점 단자들 중 제1 쿨링 단자(Y1 단자), 제2 쿨링 단자(Y2단자), 실내 팬을 제어하기 위한 팬 단자(G단자), 사방밸브를 제어하기 위한 사방밸브 단자(O/B단자), 제1 히팅 단자(W1 단자), 제2 히팅 단자(W2단자), 보조 히터를 제어하기 위한 보조 히팅 단자(D 단자)에 연결될 수 있다. 이 때, 프로세서는 실내기에 연결된 접점 단자들 중 적어도 하나를 ON 하고 나머지 단자를 OFF 하여 실내기의 동작을 제어 할 수 있다.도 5는 본 개시의 하나 이상의 실시예에 따른, 전자 장치의 제어 방법을 설명하기 위한 흐름도이다. 도 5를 참조하면, 프로세서는 양방향 통신을 수행하는 제1 인터페이스를 통하여 실내 제어기로부터 공 기조화기의 동작에 관한 설정 데이터 및 실내 환경 데이터를 수신할 수 있다(S510). 이 때, 프로세서는 F2 단자를 통해 실내 제어기로부터 설정 데이터 및 환경 데이터를 수신할 수 있다. 본 개시에서, 공기조화기의 동작에 관한 설정 데이터는 실내 환경을 제어하기 위해 사용자가 입력한 설정에 대한 데이터일 수 있다. 예를 들어, 공기조화기의 동작에 관한 설정 데이터는 설정 온도, 설정 습도, 설정 풍량, 설정 풍향, 공기조화기의 동작 여부 및 공기조화기의 운전 모드 중 적어도 하나를 포함할 수 있다. 본 개시에서, 실내 환경 데이터는, 실내 환경을 감지하기 위한 센서에 의해 감지된 센싱 데이터일 수 있다. 예 를 들어, 실내 환경 데이터는 온도 센서에 의해 감지된 실내 온도, 습도 센서에 의해 감지된 실내 습도, 풍량 센서에 의해 감지된 실내 풍량, 문열림 감지 센서에 의해 감지된 문열림 여부 중 적어도 하나를 포함할 수 있다. 한편, 프로세서는 실내 제어기로부터 실내 환경 데이터를 수신할 수 있으나, 이에 제한되는 것은 아니 며, 외부 센서 또는 외부 장치로부터 실내 환경 데이터를 수신할 수 있다. 예를 들어, 프로세서는 스마트 폰과 같은 사용자 단말 장치로부터 실내 환경 데이터를 수신할 수 있다. 공기조화기의 동작에 관한 설정 데이터 및 실내 환경 데이터가 수신되면, 프로세서는, 공기조화기(1 0)의 동작에 관한 설정 데이터 및 실내 환경 데이터에 기초하여, 공기조화기를 제어할 수 있다. 즉, 공기조화기 의 동작에 관한 설정 데이터 및 실내 환경 데이터에 기초하여, 프로세서는 공기조화기에 적용될 제어 정보를 생성할 수 있다. 구체적으로, 공기조화기의 동작에 관한 설정 데이터 및 실내 환경 데이터에 기초하여, 프로세서는 공 기조화기의 동작을 결정할 수 있다(S520). 여기서, 공기조화기의 동작은 공기조화기의 구동 여부, 공기조화 기의 운전 모드, 공기조화기의 구동 세기 중 적어도 하나를 포함할 수 있다. 여기서, 공기조화기의 구동 여부는 공기조화기의 온 오프 여부를 의미할 수 있다. 그리고, 공기조화기의 운전 모드는 냉방 운전 모드, 난방 운전 모드, 송풍 운전 모드, 제상 운전 모드, 제 습 모드, 균형 모드, 에너지 절감 모드 또는 공기 청정 모드를 포함할 수 있다. 여기서, 공기조화기의 구동 세기는 공기조화기에 포함된 압축기의 압축 속도, 공기조화기에 인가되는 전력의 크기, 공기조화기에서 토출되는 바람의 세기 중 적어도 하나를 포함할 수 있으며, 이에 한정되는 것 은 아니다. 공기조화기의 동작이 결정되면, 프로세서는 공기조화기에 적용될 제어 정보를 생성할 수 있다 (S530). 여기서, 생성된 제어 정보는 공기조화기가 결정된 동작에 따라 구동하도록 공기조화기를 제어 하는 제어 정보일 수 있다. 예를 들어, 실내 온도 정보 및 설정 온도 정보에 기초하여, 프로세서는 공기조화기의 동작을 결정할 수 있다. 구체적으로, 실내 온도 정보 및 설정 온도 정보에 기초하여, 프로세서는 공기조화기의 운전 모드를 결정하고, 결정된 운전 모드에서의 압축기의 압축 속도를 결정할 수 있다. 그리고, 프로세서는 결 정된 운전 모드 및 결정된 압축기 속도에 대응되는 제어 정보를 생성할 수 있다. 예를 들어, 제1 인터페이스를 통해 실내 제어기로부터 풍량 정보를 수신하면, 프로세서는 수신된 풍량 정보에 반영하여 공기조화기에 적용될 제어 정보를 생성할 수 있다. 한편, 프로세서는 복수의 실내 제어기로부터 신호 또는 데이터를 입력받을 수 있다. 예를 들어, 전자 장치 는 양방향 통신이 가능한 제1 인터페이스를 통해 제1 실내 제이기와 연결될 수 있다. 그리고, 전자 장치 는 단방향 통신이 가능한 제4 인터페이스를 통해 제2 실내 제어기와 연결될 수 있다. 이 때, 제2 실내 제 어기로부터 수신한 신호가 제1 실내 제어기로부터 수신한 신호와 상충되면, 프로세서는 제1 실내 제어기로 부터 수신한 데이터를 이용하여 제어 정보를 생성할 수 있다. 제어 정보가 생성되면, 생성된 제어 정보에 기초하여, 프로세서는 공기조화기를 제어할 수 있다 (S540). 구체적으로, 제어 정보가 생성되면, 프로세서는 제어 정보를 공기조화기로 전송할 수 있다. 이 때, 프 로세서는 각 기기에 대응되는 제어 정보를 각 기기로 전송할 수 있다. 구체적으로, 제어 정보는 실내기 를 제어하기 위한 제어 정보 및 실외기를 제어하기 위한 제어 정보를 포함할 수 있다. 이 때, 프로세서 는 실내기를 제어하기 위한 제어 정보를 실내기로 전송하고, 실외기를 제어하기 위한 제어 정 보를 실외기로 전송할 수 있다. 이 때, 프로세서는 공기조화기에 포함된 각 기기마다 상이한 인터페이스를 통해 제어 정보를 전송할 수 있다. 구체적으로, 프로세서는 제2 인터페이스를 통해 실내기와 통신을 수행하고, 제3 인터페이스를 통해 실 외기와 통신을 수행할 수 있다. 이 때, 제2 인터페이스는 단방향 통신을 수행하는 인터페이스일 수 있다. 그리고, 제3 인터페이스는 양방향 통 신을 수행하는 인터페이스일 수 있다. 즉, 프로세서는 단방향 통신을 수행하는 제2 인터페이스를 통해 실내기로 생성된 제어 정보를 전송할 수 있다. 그리고, 프로세서는 양방향 통신을 수행하는 제3 인터페이스를 통해 실외기로 생성된 제어 정보를 전 송할 수 있다. 그리고, 수신된 제어 정보에 기초하여, 실내기 및 실외기는 동작을 수행할 수 있다. 한편, 공기조화기는 전자 장치에 의해 생성된 제어 정보를 수신하고, 수신된 제어 정보에 기초하여 동작을 수행할 수 있으나, 이는 일 실시예에 불과할 뿐, 이에 한정되는 것은 아니다. 구체적으로, 공기조화기는 전 자 장치로부터 실내 환경 데이터 및 공기조화기의 동작에 관한 설정 데이터를 수신할 수 있다. 그리고 수신된 데이터에 기초하여, 공기조화기는 제어 정보를 생성할 수 있다. 그리고, 공기조화기는 생성된 제어 정보에 기초하여 동작할 수 있다. 예를 들어, 프로세서는 수신된 환경 데이터 및 수신된 설정 데이터를 실외기로 전송할 수 있다. 이 때, 프로세서는 양방향 통신이 가능한 인터페이스를 통해 환경 데이터 및 설정 데이터를 실외기로 전 송할 수 있다. 수신된 환경 데이터 및 수신된 설정 데이터에 기초하여, 실외기는 제어 정보를 생성하고, 생 성된 제어 정보에 따라 동작할 수 있다. 이 때, 실외기가 제어 정보를 생성하는 방법은, 프로세서가 제어 정보를 생성하는 방법과 같을 수 있으나, 이에 한정되는 것은 아니다. 도 6은 본 개시의 하나 이상의 실시예에 따른 전자 장치가 공기조화기의 동작을 결정하는 방법을 설명하기 위한 흐름도이다. 도 6을 참조하면, 프로세서는 실내 제어기로부터 설정 데이터 및 환경 데이터를 수신할 수 있다 (S610). 그리고, 프로세서는 설정 데이터와 환경 데이터 사이의 차이를 기설정된 값과 비교할 수 있다(S620). 구체적으로, 프로세서는 설정 데이터와 환경 데이터 사이의 차이가 기설정된 값 이상인지 여부를 식별할 수 있다. 이 때, 기설정된 값에 대한 정보는 메모리에 저장되어 있을 수 있다. 그리고, 비교 결과에 기초하여, 프로세서는 공기조화기의 동작을 결정할 수 있다(S630). 예를 들어, 공기조화기의 동작에 관한 설정 데이터와 실내 환경 데이터가 기설정된 값 이상 차이나면, 프로 세서는 공기조화기의 구동 여부를 ON으로 결정할 수 있다. 그리고, 공기조화기의 동작에 관한 설정 데이터가 실내 환경 데이터가 기설정된 값 이상 차이나면, 프로세 서는 실내 환경 데이터가 공기조화기의 동작에 관한 설정 데이터가 되도록 운전 모드를 결정할 수 있 다. 예를 들어, 실내 온도가 26도이고, 설정 온도는 24도일 수 있다. 이 때, 기설정된 값은 1도일 수 있다. 이 경우, 실내 온도와 설정 온도 사이의 차이가 기설정된 값 이상이므로, 프로세서는 실내 온도가 설정 온도 가 되도록 공기조화기의 운전 모드를 냉방 모드로 결정할 수 있다. 또는, 실내 온도는 22도이고, 설정 온도는 24도일 수 있다. 이 때, 기설정된 값은 1도일 수 있다. 이 경우, 실 내 온도와 설정 온도 사이의 차이가 기설정된 값 이상이므로, 프로세서는 실내 온도가 설정 온도가 되도록공기조화기의 운전 모드를 난방 모드로 결정할 수 있다. 그리고, 공기조화기의 동작에 관한 설정 데이터와 실내 환경 데이터 사이의 차이의 크기에 따라, 프로세서 는 공기조화기의 구동 세기를 결정할 수 있다. 구체적으로, 도 7을 참조하면, 메모리는 공기조화기의 동작에 관한 설정 데이터와 실내 환경 데이터 사이의 차이가 속하는 구간에 대응되는 구동 세기에 대한 정보를 룩업 테이블 형태로 저장할 수 있다. 이 때, 공기조화기의 동작에 관한 설정 데이터와 실내 환경 데이터 사이의 차이가 제1 구간에 속하면, 프로 세서는 제1 구동 세기로 공기조화기를 구동시킬 수 있다. 그리고, 공기조화기의 동작에 관한 설정 데이터와 실내 환경 데이터 사이의 차이가 제2 구간에 속하면, 프로세서는 제2 구동 세기로 공기조화기 를 구동시킬 수 있다. 예를 들어, 제1 구간이 2도 미만이고, 제2구간은 2도 이상 4도 미만일 수 있다. 그리고, 제1 구간에 대응되는 구동 세기는 \"약\"'일 수 있고, 제2 구간에 대응되는 구동 세기는 \"중\"일 수 있다. 이 때, 실내 온도와 설정 온 도 사이의 차이는 1도인 경우, 프로세서는 공기조화기의 구동 세기를 \"약\"으로 결정할 수 있다. 또는, 실 내 온도와 설정 온도 사이의 차이가 3도인 경우, 프로세서는 공기조화기의 구동 세기를 \"중\"으로 결정할 수 있다. 한편, 공기조화기의 동작에 관한 설정 데이터와 실내 환경 데이터는 복수의 요소를 포함할 수 있다. 이에 따라, 프로세서는 복수의 요소 각각에 대해 설정 데이터와 환경 데이터를 비교할 수 있다. 그리고, 비교 결과에 기초하여, 프로세서는 공기조화기의 동작을 결정할 수 있다. 이 때, 복수의 요소 각각의 비교 결과에 기초하여, 프로세서는 공기조화기의 동작을 복합적으로 결정할 수 있다. 구체적으로, 설정 데이터와 환경 데이터는 제1 요소(예로, 온도)에 대한 데이터 및 제2 요소(예로, 습도)에 대 한 데이터를 포함할 수 있다. 예를 들어, 제1 요소에 대한 데이터는 설정 온도와 실내 온도를 포함할 수 있다. 그리고, 제2 요소에 대한 데이터는 설정 습도와 실내 습도를 포함할 수 있다. 그리고, 프로세서는 제1 요소에 대한 설정 데이터와 제1 요소에 대한 환경 데이터를 비교하여, 공기조화기 의 제1 동작을 결정할 수 있다. 그리고, 프로세서는 제2 요소에 대한 설정 데이터와 제2 요소에 대한 환경 데이터를 비교하여, 공기조화기의 제2 동작을 결정할 수 있다. 그리고, 프로세서는 공기조화기 가 제1 동작 및 제2 동작을 동시에 수행하도록 제어 정보를 생성할 수 있다. 예를 들어, 실내기는 열교환기 토출단에 히터가 장착되어 있을 수 있다. 이 때, 실내 온도와 설정 온도의 차이가 기설정된 제1값 이하이고, 실내 습도와 설정 습도가 기설정된 제2값 이상이면, 프로세서는 히터 운 전과 냉방 운전을 동시에 수행하도록 공기조화기를 제어할 수 있다. 즉, 복수의 요소 각각에 대한 비교 결과에 따라, 프로세서는 공기조화기가 복합 운전을 수행하도록 제 어 정보를 생성할 수 있다. 여기서, 복합 운전은 공기조화기의 운전 모드 중 두 개 이상의 운전 모드에 따른 동 작을 동시에 수행하는 운전 모드일 수 있다. 한편, 전자 장치는 양방향 통신을 수행하는 인터페이스를 통해 공기조화기로부터 공기조화기의 동 작 정보를 수신할 수 있다. 여기서, 공기조화기의 동작 정보는 공기조화기의 동작 중 오작동 발생 여부, 공기조화기의 동작 중 에러 발생 여부, 공기조화기가 동작 중인 운전 모드, 실외 온도 중 적어도 하나에 대한 정보를 포함할 수 있다. 예를 들어, 전자 장치가 양방향 통신을 수행하는 인터페이스를 통해 실외기와 통신을 수행하는 경우, 프로세서는 실외기로부터 실외기의 동작 정보를 수신할 수 있다. 이 때, 실외기의 동작 정보 는 실외기의 동작 중 실외기의 오작동 여부, 실외기의 동작 중 에러 발생 여부, 실외기가 동작 중인 운전 모드, 실외 온도 중 적어도 하나에 대한 정보를 포함할 수 있다. 공기조화기의 동작 정보가 수신되면, 프로세서는 공기조화기의 동작 정보를 양방향 통신이 가능한 제1 인터페이스를 통해 실내 제어기로 전송할 수 있다. 이에 따라, 실내 제어기는 공기조화기의 동작 정보를 출력할 수 있다. 예를 들어, 실내 제어기는 디스플레이, 스피커 또는 통신 인터페이스를 포함할 수 있다. 이 때, 실내 제어기는 공기조화기의 동작 정보에 대한 화면을 표시하도록 디스플레이를 제어할 수 있다. 또는, 실내 제어기는 공기조화기의 동작 정보에 대한 음성을 출력하도록 스피커를 제어할 수 있다. 또는, 실내 제어기는 공기조화기의 동작 정보에 대한 화면 또는 음성을 출력하기 위한 정보를 사용자 단말 장치에 전송하도록 통신 인터페이스를 제어할 수 있다. 예를 들어, 실내 제어기는 \"현재 실내 온도는 섭씨 25도이고, 설정 온도는 23도입니다. 실내 온도가 25도가 될 때까지 냉방 운전 모드를 실시합니다.\"와 같은 음성을 출력하도록 스피커를 제어할 수 있다. 한편, 전자 장치는 실내 제어기를 통해 수신된 설정 데이터가 없는 경우에도, 기설정되 이벤트가 감지 되면, 공기조화기가 동작하도록 제어할 수 있다. 도 8은 본 개시의 하나 이상의 실시예에 따른 전자 장치의 제어 방법을 설명하기 위한 도면이다. 도 8을 참조하면, 전자 장치는 기설정된 이벤트가 발생하는지 여부를 감지할 수 있다(S810). 예를 들어서, 기설정된 이벤트는 사용자의 실내 진입일 수 있다. 프로세서는 동작 센서 또는 문열림 감지 센서를 통해 사용자의 실내 진입을 감지할 수 있다. 이 때, 프로세서는 실내 제어기 또는 외부 센서로 부터 사용자의 실내 진입이 감지된 데이터를 수신할 수 있다. 기설정된 이벤트가 감지되면(S810-Y), 프로세서는 실내 환경 데이터를 획득할 수 있다(S820). 이 때, 프로 세서는 실내 제어기 또는 외부 센서로부터 실내 환경 데이터를 획득할 수 있다. 실내 환경 데이터가 획득되면, 프로세서는 실내 환경 데이터와 기설정된 환경 데이터 간의 차이가 기설정 된 차이 이상인지 여부를 식별할 수 있다(S830). 실내 환경 데이터와 기설정된 환경 데이터 간의 차이가 기설정된 차이 이상이면(S830-Y), 실내 환경 데이터와 기설정된 환경 데이터에 기초하여, 프로세서는 공기조화기를 제어할 수 있다(S840). 구체적으로, 프로세서는 실내 환경이 기설정된 환경 데이터에 대응되는 환경이 되도록 공기조화기를 제어할 수 있다. 예를 들어서, 사용자의 실내 진입이 감지되었을 때, 실내 온도가 28도이고, 기설정된 실내 온 도가 25도이면, 프로세서는 실내 온도가 25도가 되도록 공기조화기를 구동시킬 수 있다. 그리고, 기설정된 이벤트가 감지되지 않거나(S810-N), 실내 환경 데이터와 기설정된 환경 데이터 간의 차이가 기설정된 차이 미만이면(S830-N), 프로세서는 기설정된 이벤트가 감지되는지 여부를 식별할 수 있다 (S810). 즉, 프로세서는 기설정된 이벤트가 감지되는지 여부를 지속적으로 모니터링 할 수 있다. 한편, 본 개시에서 사용된 용어 \"부\" 또는 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구성된 유닛을 포함하 며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로 등의 용어와 상호 호환적으로 사용될 수 있다. \"부\" 또는 \" 모듈\"은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는 최소 단위 또는 그 일부가 될 수 있다. 예를 들면, 모듈은 ASIC(application-specific integrated circuit)으로 구성될 수 있다. 본 개시의 다양한 실시예들은 기기(machine)(예: 컴퓨터)로 읽을 수 있는 저장 매체(machine-readable storage media)에 저장된 명령어를 포함하는 소프트웨어로 구현될 수 있다. 기기는, 저장 매체로부터 저장된 명령어를 호출하고, 호출된 명령어에 따라 동작이 가능한 장치로서, 개시된 실시예들에 따른 전자 장치를 포함할 수 있다. 상기 명령이 프로세서에 의해 실행될 경우, 프로세서가 직접, 또는 상기 프로세서의 제어 하에 다른 구성 요소들을 이용하여 상기 명령에 해당하는 기능을 수행할 수 있다. 명령은 컴파일러 또는 인터프리터에 의해 생 성 또는 실행되는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장매체는, 비일시적(non-transitory) 저장매 체의 형태로 제공될 수 있다. 여기서, '비일시적'은 저장매체가 신호(signal)를 포함하지 않으며 실재 (tangible)한다는 것을 의미할 뿐 데이터가 저장매체에 반영구적 또는 임시적으로 저장됨을 구분하지 않는다. 하나 이상의 실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품 (computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD-ROM))의 형태로, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 온라인으로 배포될 수 있 다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시예들에 따른 구성 요소(예: 모듈 또는 프로그램) 각각은 단수 또는 복수의 개체로 구성될 수 있으며, 전술한 해당 서브 구성 요소들 중 일부 서브 구성 요소가 생략되거나, 또는 다른 서브 구성 요소가 다 양한 실시예에 더 포함될 수 있다. 대체적으로 또는 추가적으로, 일부 구성 요소들(예: 모듈 또는 프로그램)은 하나의 개체로 통합되어, 통합되기 이전의 각각의 해당 구성 요소에 의해 수행되는 기능을 동일 또는 유사하게수행할 수 있다. 다양한 실시예들에 따른, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작들은 순차 적, 병렬적, 반복적 또는 휴리스틱하게 실행되거나, 적어도 일부 동작이 다른 순서로 실행되거나, 생략되거나, 또는 다른 동작이 추가될 수 있다."}
{"patent_id": "10-2023-0080492", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 하나 이상의 실시예에 따른 공기 조화 시스템을 설명하기 위한 시스템도이다. 도 2는 본 개시의 하나 이상의 실시예에 따른 전자 장치의 구성을 설명하기 위한 블록도이다. 도 3은 본 개시의 하나 이상의 실시예에 따른 전자 장치의 내부를 설명하기 위한 도면이다. 도 4는 본 개시의 하나 이상의 실시예에 따른 전자 장치와 실내 제어기, 실외기 및 실내기 사 이의 통신을 설명하기 위한 도면이다. 도 5는 본 개시의 하나 이상의 실시예에 따른, 전자 장치의 제어 방법을 설명하기 위한 흐름도이다. 도 6 및 도 7은 본 개시의 하나 이상의 실시예에 따른 전자 장치가 공기조화기의 동작을 결정하는 방법을 설명하기 위한 도면이다. 도 8는 본 개시의 하나 이상의 실시예에 따른, 전자 장치의 제어 방법을 설명하기 위한 흐름도이다."}
