{"patent_id": "10-2023-0108763", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0027884", "출원번호": "10-2023-0108763", "발명의 명칭": "연속공정중 나노소재의 품질평가 방법 및 이를 이용한 나노소재 제조 공정 제어방법", "출원인": "주식회사 그린그래핀", "발명자": "김규천"}}
{"patent_id": "10-2023-0108763", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "나노소재를 생산하기 위한 분산장치에 나노소재의 분말과 분산매인 물을 투입하는 단계;나노소재 분산장치를 가동하여 그래핀을 생성하는 단계;그래핀 생성 공정중에 품질 평가를 위해 공정에 설치된 센서들로부터 감지값을 추출하여 공정 데이터베이스에저장하는 단계;상기 공정 데이터베이스에 저장된 감지값을 분석하여 그래핀의 품질을 평가하는 단계;상기 평가 결과 양호하면, 생산공정을 계속 진행하면서 공정중 평가를 반복하는 단계; 및생산이 완료되면, 나노소재 분산장치의 동작을 중지하고, 그래핀을 배출하는 단계를 포함하여공정 중에 용액상태에서 그래핀의 품질을 평가할 수 있는 것을 특징으로 하는 연속공정중 나노소재의 성능평가방법."}
{"patent_id": "10-2023-0108763", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 감지값을 추출하여 공정 데이터베이스에 저장하는 단계는,전도도센서, 점도센서, 광학센서, 이미지센서, 함수율/밀도 센서 중 적어도 하나 이상의 센서들로부터 감지한검토센서 감지값과,온도센서, 압력계, 유량계로부터 측정된 보조센서 값을 해당 센서들로부터 감지하여 상기 공정 데이터베이스에저장하는 것을 특징으로 하는 연속공정중 나노소재의 성능평가 방법."}
{"patent_id": "10-2023-0108763", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "나노소재를 생산하기 위한 분산장치에 나노소재의 분말과 분산매인 물을 투입하는 단계;나노소재 분산장치를 가동하여 그래핀을 생성하는 단계;그래핀 생성 공정중에 평가를 위해 공정에 설치된 센서들로부터 감지값을 추출하여 공정 데이터베이스에 저장하는 단계;공정 데이터베이스에 저장된 감지값을 분석하여 그래핀의 성능을 평가하는 단계;상기 평가 결과 품질이 불량하면, 추출 시료별 공정조건과 용액 평가값, 및 그래핀 품질 평가 결과 데이터를 인공지능 모델에 적용하여 공정 운전 조건을 최적화하도록 제어 절차를 수립하는 단계;상기 제어 절차에 따라 공정 요소를 제어하는 단계;상기 제어된 공정에서 센서들로부터 감지값을 추출하여 공정 데이터베이스에 저장하는 단계;공정 데이터베이스에 저장된 감지값을 분석하여 그래핀의 성능을 평가하는 단계;상기 평가 결과 품질이 양호하면, 생산공정을 계속 진행하면서 공정중 평가를 반복하는 단계; 및생산이 완료되면, 나노소재 분산장치의 동작을 중지하고, 그래핀을 배출하는 단계;를포함하는 연속공정중 나노소재의 성능평가를 이용한 나노소재 제조 공정 제어방법."}
{"patent_id": "10-2023-0108763", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 인공지능 모델은RNN(Recurrent Neural Network) 계열의 LSTM(Long Short-Term Memory)이나 GRU(Gated Recurrent Unit) 중 하공개특허 10-2025-0027884-3-나인 것을 특징으로 하는 연속공정중 나노소재의 성능평가를 이용한 나노소재 제조 공정 제어방법."}
{"patent_id": "10-2023-0108763", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서, 상기 공정 요소를 제어하는 단계는,모터의 rpm이나 펌프의 용액 유동량, 용액의 농도, 공정의 온도, 공정의 압력 중 하나 이상을 제어하는 것을 특징으로 하는 연속공정중 나노소재의 성능평가를 이용한 나노소재 제조 공정 제어방법."}
{"patent_id": "10-2023-0108763", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 실시예는 분산매(물)와 나노소재용 분말이 혼합된 용액에서 물리력(전단력)으로 나노소재를 생산할 수 있는 친환경 인라인 연속 제조공정중에 나노소재의 품질을 평가하기 위한 방법 및 이를 이용한 나노소재 제조 공 정 제어 방법을 개시한다. 개시된 품질 평가 방법은, 나노소재를 생산하기 위한 분산장치에 나노소재의 분말과 분산매인 물을 투입하는 단계와, 나노소재 분산장치를 가동하여 그래핀을 생성하는 단계와, 그래핀 생성 공정중 에 품질 평가를 위해 공정에 설치된 센서들로부터 감지값을 추출하여 공정 데이터베이스에 저장하는 단계와, 상 기 공정 데이터베이스에 저장된 감지값을 분석하여 그래핀의 품질을 평가하는 단계와, 상기 평가 결과 양호하면, 생산공정을 계속 진행하면서 공정중 평가를 반복하는 단계와, 생산이 완료되면, 나노소재 분산장치의 동작을 중 지하고, 그래핀을 배출하는 단계를 포함하여 공정 중에 용액상태에서 그래핀의 품질을 평가할 수 있다."}
{"patent_id": "10-2023-0108763", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 그래핀(graphene)과 같은 나노소재 제조 기술에 관한 것으로, 더욱 상세하게는 분산매(물)와 나노소 재용 분말이 혼합된 용액에서 물리력(전단력)으로 나노소재를 생산할 수 있는 친환경 인라인 연속 제조공정중에 나노소재의 품질을 평가하기 위한 방법 및 이를 이용한 나노소재 제조 공정 제어 방법에 관한 것이다."}
{"patent_id": "10-2023-0108763", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로, 나노소재란 단일 단위의 크기가 100nm 미만의 소재를 이야기하며, 나노미터 크기에서 기존에 비해 물성이 현저히 향상되거나 새로운 물성 및 기능이 발현되는 소재를 말한다. 대표적인 나노소재로는 2차원 형상 의 판상형 나노소재인 그래핀, 맥신(MXene), 육방정계 질화붕소, 1차원 형상의 탄소나노튜브(CNT) 및 셀룰로즈 나노파이버(CNF) 등이 있다. 대표적인 판상형 나노소재로서, 그래핀은 2차원 평면구조를 가지는 육각형 결정구조의 탄소단일층으로서, 그래 핀은 기존의 탄소 소재와 비교하여 전기전도성, 열전도성 및 빛 투과도가 우수한 장점이 있어 반도체, 디스플레 이, 이차전지, 촉매, 엔지니어링 플라스틱 등 다양한 분야에 응용될 수 있으나, 현재 너무 높은 제조 비용으로 인해 그 이용 분야가 한정되고 있다. 이러한 그래핀의 제조 방법으로 화학기상증착법 등의 바텀업 제조 방식 및 흑연을 박리하여 그래핀을 제조하는 탑다운 제조 방식이 있으며, 구체적으로 테이프를 사용하는 등의 물리적인 방법, 흑연을 황산, 질산 등의 강산 으로 전처리하거나, 흑연의 탄소 층간에 산, 염기, 금속 등을 삽입하여 인터칼레이션 화합물(intercalation compound)로 전처리한 후 박리시켜서 그래핀을 얻는 방법이 알려져 있다. 그러나 상기 방법들은 원재료에서 그래핀을 만드는 것이 매우 어렵기 때문에 상기의 전처리 공정과 NMP 등의 유 기용매 및 첨가제를 사용하여 그래핀으로 박리하는 추가의 공정을 갖는다. 한편, 강산 등으로 전처리하는 경우 에는 산화그래핀(GO)이 만들어지므로, 전기전동성을 부여하기 위한 열화학적 환원 공정으로 환원그래핀(rGO)을 만드는 복잡한 공정을 거치게 된다. 또한, 공정 중에 독성물질, 유기용매, 첨가제 및 열화학적 공정을 거치게되어 그래핀의 물성을 감소시키며, 대 량의 세척수 사용 및 많은 에너지가 소모되는 건조 및 회수 공정으로 환경오염을 유발하는 문제점이 있다. 더욱이, 그래핀을 제조하기 위해서는 고가의 화학공정 시설이 필요하며, 많은 에너지 및 많은 시간을 사용할 뿐 만 아니라 이렇게 얻어지는 그래핀은 제조원가가 매우 높아 산업적 응용을 제한하는 문제점이 있다. 등록특허 제10-1780329호 \"로터-로터 방식 분산유화장치 임펠러 구조 시스템\"(등록일자 : 2017년 09월 14일)에 는 로터 사이에서 발생되는 전단력을 이용하여 나노소재를 분산하는 기술이 개시되어 있다. 그러나, 상기 로터-로터 방식 분산유화장치 임펠러 구조 시스템에는 로터 사이에 약 0.1~0.2mm의 갭이 존재함으 로써 그래핀을 박리하기 위한 충분한 전단력을 만들기 어려워 화학적인 방법으로 전처리를 한 이후에야 그래핀 을 만들 수 있다. 한편, 등록특허 제10-1866644호 \"회전판을 사용한 그라파이트 플레이트 박리에 의한 그래핀 제조방법\"(등록일자 : 2018년 06월 04일)에는 표면에 미세 돌기가 형성된 유리기판으로 형성된 회전판 및 고정판을 사용하여 회전판 및 고정판 사이에서 발생되는 전단력을 이용하여 그래핀을 박리하는 기술이 개시되어 있다. 그러나, 상기 회전판을 사용한 그라파이트 플레이트 박리에 의한 그래핀 제조방법에서 유리기판에 형성된 미세 돌기가 쉽게 마모되는 문제 및 여전히 수율이 낮은 문제가 있다.또한 종래의 그래핀과 같은 나노소재 제조 기술은 연속 공정중에 나노소재의 성능과 품질을 평가하는 방법이 없 었기 때문에 제조 완료 후에만 성능과 품질을 평가하여 제조 공정을 제어하기 어려운 문제점이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 등록특허 제10-1780329호 \"로터-로터 방식 분산유화장치 임펠러 구조 시스템\"(등록일자 : 2017 년 09월 14일) (특허문헌 0002) 등록특허 제10-1866644호 \"회전판을 사용한 그라파이트 플레이트 박리에 의한 그래핀 제조방법\"(등록일자 : 2018년 06월 04일)"}
{"patent_id": "10-2023-0108763", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 과제는 분산매와 분말의 혼합용액이 통과되는 통로 사이에 전단 부재를 배치함으로 써 통로의 갭을 최소화하여 높은 전단력을 발생시켜 분산매와 물리력만을 사용하여 나노소재를 박리할 수 있는 친환경 인라인 연속 제조공정중에 나노소재의 품질을 평가하기 위한 방법 및 이를 이용한 나노소재 제조 공정 제어 방법을 제공하는 것이다."}
{"patent_id": "10-2023-0108763", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예는 친환경 인라인 연속 제조공정중에 나노소재의 성능과 품질을 평가하기 위한 방법을 개시 한다. 개시된 평가 방법은, 나노소재를 생산하기 위한 분산장치에 나노소재의 분말과 분산매인 물을 투입하는 단계와, 나노소재 분산장치를 가동하여 그래핀을 생성하는 단계와, 그래핀 생성 공정중에 품질 평가를 위해 공정에 설치 된 센서들로부터 감지값을 추출하여 공정 데이터베이스에 저장하는 단계와, 상기 공정 데이터베이스에 저장된 감지값을 분석하여 그래핀의 품질을 평가하는 단계와, 상기 평가 결과 양호하면, 생산공정을 계속 진행하면서 공정중 평가를 반복하는 단계와, 생산이 완료되면, 나노소재 분산장치의 동작을 중지하고, 그래핀을 배출하는 단계를 포함하여 공정 중에 용액상태에서 그래핀의 품질을 평가할 수 있다. 상기 감지값을 추출하여 공정 데이터베이스에 저장하는 단계는, 전도도센서, 점도센서, 광학센서, 이미지센서, 함수율/밀도 센서 중 적어도 하나 이상의 센서들로부터 감지한 검토센서 감지값과, 온도센서, 압력계, 유량계로 부터 측정된 보조센서 값을 해당 센서들로부터 감지하여 상기 공정 데이터베이스에 저장하는 것이다. 또한, 본 발명의 다른 실시예는 연속 공정중 나노소재 평가 방법을 이용하여 나노소재 제조 공정을 제어하는 방 법을 개시한다. 개시된 공정 제어 방법은, 나노소재를 생산하기 위한 분산장치에 나노소재의 분말과 분산매인 물을 투입하는 단 계와, 나노소재 분산장치를 가동하여 그래핀을 생성하는 단계와, 그래핀 생성 공정중에 평가를 위해 공정에 설 치된 센서들로부터 감지값을 추출하여 공정 데이터베이스에 저장하는 단계와, 공정 데이터베이스에 저장된 감지 값을 분석하여 그래핀의 성능을 평가하는 단계와, 상기 평가 결과 품질이 불량하면, 추출 시료별 공정조건과 용 액 평가값, 및 그래핀 품질 평가 결과 데이터를 인공지능 모델에 적용하여 공정 운전 조건을 최적화하도록 제어 절차를 수립하는 단계와, 상기 제어 절차에 따라 공정 요소를 제어하는 단계와, 상기 제어된 공정에서 센서들로 부터 감지값을 추출하여 공정 데이터베이스에 저장하는 단계와, 공정 데이터베이스에 저장된 감지값을 분석하여 그래핀의 성능을 평가하는 단계와, 상기 평가 결과 품질이 양호하면, 생산공정을 계속 진행하면서 공정중 평가 를 반복하는 단계와, 생산이 완료되면, 나노소재 분산장치의 동작을 중지하고, 그래핀을 배출하는 단계를 포함 한다. 상기 인공지능 모델은, RNN(Recurrent Neural Network) 계열의 LSTM(Long Short-Term Memory)이나 GRU(Gated Recurrent Unit) 중 하나일 수 있다.상기 공정 요소를 제어하는 단계는, 모터의 rpm이나 펌프의 용액 유동량, 용액의 농도, 공정의 온도, 공정의 압 력 중 하나 이상을 제어하는 것이다."}
{"patent_id": "10-2023-0108763", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따른 나노소재 품질 평가방법은 분산매(물)와 나노소재용 분말이 혼합된 용액에서 물리력 (전단력)으로 나노소재를 생산할 수 있는 친환경 인라인 연속 제조공정중에 공정을 중단함이 없이 센서들에 의 해 감지된 데이터를 분석하여 나노소재의 성능과 품질을 평가할 수 있어 평가결과에 따라 공정을 제어하여 제조 수율을 높일 수 있는 효과가 있다. 또한, 본 발명에 따른 나노소재 제조 기술은 화학적 용매 및 첨가제를 사용하지 않아 친환경적이면서도 산화 및 환원 등의 화학공정 및 세척공정 등 별도의 공정이 필요하지 않아 나노소재의 제조 시간 및 원가를 절감할 수 있는 효과를 갖는다."}
{"patent_id": "10-2023-0108763", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명과 본 발명의 실시에 의해 달성되는 기술적 과제는 다음에서 설명하는 본 발명의 바람직한 실시예들에 의하여 보다 명확해질 것이다. 다음의 실시예들은 단지 본 발명을 설명하기 위하여 예시된 것에 불과하며, 본 발명의 범위를 제한하기 위한 것은 아니다. 도 1은 본 발명의 실시예에 따른 나노소재 제조 절차를 도시한 공정도이다. 도 1을 참조하면, 원료 투입단계에서는 나노소재를 생산하기 위한 분산장치(도 4의 10)에 나노소재의 분말(흑연)과 분산매(물)를 소정 농도로 투입한다(S101). 이어 가동이 요청되면, 나노소재 분산장치를 작동시켜 그래핀을 생산한다(S102~S104). 이때 나노소재 분산 장치는 일련의 시리즈로 연속 연결될 수도 있고, 패러럴하게 병렬로 연결될 수도 있다. 공정진행 중에 품질 평가가 요청되면, 그래핀 생산 공정중에 품질 평가를 위해 공정에 설치된 각종 센서들로부 터 감지값을 추출하여 공정 데이터베이스에 저장한다(S105~S107). 본 발명의 실시예에서는 전도도센서 , 점도센서, 광학센서, 이미지센서, 함수율/밀도 센서(미도시) 중 적어도 하나 이상의 센 서들로부터 감지한 검토센서 감지값과, 온도계, 압력계, 유량계로부터 측정된 보조센서 값을 해 당 센서들로부터 감지하여 공정 데이터베이스에 저장한다. 이어, 공정 데이터베이스에 저장된 감지값을 분석하여 그래핀의 품질(성능)을 평가한다(S108). 상기 평가 결과 품질이 불량하면, 추출 시료별 공정조건과 용액 평가값, 및 그래핀 품질 평가 결과 데이터를 인 공지능 모델에 적용하여 공정 운전 조건을 최적화하도록 제어 절차를 수립하고, 상기 제어 절차에 따라 공정 요 소를 제어한다(S109~S112). 본 발명의 실시예에서 인공지능 모델은 RNN(Recurrent Neural Network) 계열의 LSTM(Long Short-Term Memory) 이나 GRU(Gated Recurrent Unit) 중 하나일 수 있고, 공정 요소는 모터의 rpm이나 펌프의 용액 유동량, 용액의 농도, 공정의 온도, 공정의 압력 중 하나 이상일 수 있다. 이후 제어된 공정에서 센서들로부터 감지값을 추출하여 공정 데이터베이스에 저장하고, 공정 데이터베이스 에 저장된 감지값을 분석하여 그래핀의 품질을 반복하여 평가한다(S112).한편, 평가 결과 품질이 양호하면, 생산 공정을 계속 진행하면서 공정중 평가를 반복한다(S113,S114). 그리고 생산이 완료되면, 나노소재 분산장치의 동작을 중지하고, 그래핀을 배출한다(S115,S116). 도 2는 본 발명의 실시예에 따른 나노소재 품질평가 및 공정 제어장치를 도시한 개략도이며, 도 3은 본 발명의 실시예에 사용되는 LSTM 인공지능 모델을 설명하기 위한 도면이다. 본 발명의 실시예에 따른 나노소재 품질평가 및 공정 제어장치는 도 2에 도시된 바와 같이, 공정요소(61 0)에 해당하는 모터, 펌프, 칠러와, 측정센서와 보조센서를 인터페이스하기 위한 센서 인터페이 스와, 측정 센서인 전도도센서, 점도센서, 광학센서, 이미지센서, 보조센서인 온도계 , 압력계, 유량계와, 성능(품질) 측정부, 공정 제어부, 데이터 관리부, 공정 데이터베이스, 운영자 GUI, 인공지능 모듈로 구성된다. 인공지능 모듈은 데이터 추출부 , 전처리부, 모델 학습부, 모델 예측부, 제어절차 수립부로 구성된다. 도 2를 참조하면, 나노소재를 생산하는 공정에는 모터, 펌프, 칠러와 같은 공정요소들에 의해 공정의 조건을 변화시킬 수 있고, 나노소재 샌산공정에는 측정을 위한 전도도센서, 점도센서, 광학센서, 이미지센서, 공정 환경을 파악하기 위한 온도계, 압력계, 유량계 등이 구 비되어 있다. 센서 인터페이스는 측정센서들(621~624)과 보조센서들(625~627)을 품질 측정부로 연결하여 품질 측 정부가 공정중에 생산된 나노소재의 품질과 성능을 측정할 수 있게 한다. 품질 측정부는 센서 인터페이스를 통해 측정센서들로부터 측정값을 입력받고, 보조센서들로부터 환경 값을 입력받아 용액 상태의 공정중에 생산된 나노소재의 품질을 측정한다. 예컨대, 품질 측정부는 전도도 센서로 측정된 전도도와 점도센서로부터 측정된 점도, 광학센서로부터 측정된 측정값, 이미지센 서로부터 측정된 이미지, 온도계로부터 입력된 공정 온도, 압력계로부터 입력된 공정 압력, 유 량계를 통해 산출한 유량 등을 이용하여 나노소재의 품질과 성능을 평가한다. 데이터 관리부는 공정 제어부를 통해 공정요소들로부터 신출된 공정 데이터를 입력받아 공정 데이터 베이스에 저장하고, 품질 측정부로부터 산출된 품질(성능) 데이터를 입력받아 공정 데이터베이스 에 저장한다. 데이터 추출부는 공정 데이터베이스에 누적 축적된 공정 데이터를 가져오고, 전처리부는 공정 데이터를 학습 데이터와 예측 데이터로 구분한 후 인공지능 모델에 적용할 수 있도록 전처리한다. 이러한 전처 리에는 데이터의 정규화와 노멀화 등이 포함될 수 있다. 모델 학습부는 LSTM과 GRU와 같은 인공지능 모델을 학습 데이터로 최적화 학습시켜 학습된 인공지능 모델 을 제공하고, 모델 예측부는 전처리부로부터 예측 데이터를 입력받아 학습된 LSTM 인공지능 모델에 적용하여 예측을 수행하고, 제어절차 수립부는 예측에 따라 공정을 제어하기 위한 제어절차를 수립한다. 그리고 공정 제어부는 수립된 제어절차에 따라 나노소재 생산공정의 공정 요소를 제어하여 양질의 나 노소재를 생산할 수 있게 한다. 한편, 본 발명의 실시예에 적용되는 인공지능 모델은 RNN(Recurrent Neural Network) 계열의 LSTM(Long Short- Term Memory)이나 GRU(Gated Recurrent Unit) 중 하나일 수 있고, 공정 요소는 모터의 rpm이나 펌프의 용액 유 동량, 용액의 농도, 공정의 온도, 공정의 압력 중 하나 이상일 수 있다. 본 발명의 실시예에 적용되는 LSTM(Long Shot-Term Memory) 모델은 도 3에 도시된 바와 같이, RNN(Recurrent Neural Network)에서 히든 레이어값을 뒤쪽으로 전달할 때 뒤쪽으로 가면서 정보 손실이 일어나는 것을 방지하 기 위해 필요없는 정보는 잊고, 중요한 정보만 뒤로 전달할 수 있도록 개선한 것이다. 도 3을 참조하면, LSTM은 RNN과 달리 ht, ct 같이2개의 상태를 유지하고, it, ft, ot와 같은 게이트를 생성해 어 떤 입력값을 통과시키고, 어떤 것을 잊어버리고, 어떤 출력값을 남길것인지를 제어한다. 여기서, ht 는 히든 스 테이트(hidden state), ct 는 셀 스테이트(cell state), it 는 입력 게이트(input gate), ft 는 포겟 게이트 (forget gate), ot 는 출력 게이트(output gate)를 나타낸다. 또한 입력 게이트(it)와 포겟 게이트(ft) 및 출력 게이트(ot)는 다음 수학식 1과 같이 산출되고, 셀 스테이트 (ct)는 다음 수학식 2와 같이 구해지면 t시점의 히든 스테이트(ht) 및 최종 출력(yt)은 다음 수학식 3과 같이 표 현될 수 있다. 수학식 1"}
{"patent_id": "10-2023-0108763", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "수학식 2"}
{"patent_id": "10-2023-0108763", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "수학식 3"}
{"patent_id": "10-2023-0108763", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "수학식 2와 수학식 3에서 은 element-wise product를 나타낸다. 도 4는 본 발명의 일실시예에 적용될 수 있는 나노소재 분산장치의 외관사시도이다. 도 4를 참조하면, 본 발명의 실시예를 적용할 수 있는 나노소재 분산장치는 작업 테이블, 회전판, 스페 이서, 회전 유닛, 고정판 및 전단 부재를 포함한다. 나노소재 분산장치는 작업 테이블에 의하여 지정된 위치에 설치 및 고정된다. 회전판은 회전 몸체 및 제1 그루브를 포함하고, 회전 몸체는, 예를 들어, 원판 형상으로 형성되며, 회전 몸체는 상면, 하면 및 상면 및 하면을 연결하는 측면을 갖는다. 제1 그루브는 회전 몸체에 오목한 환형 형상으로 형성 되며, 제1 그루브는 회전 몸체의 상면, 하면 및 측면 중 적어도 어느 한면에 형성되며, 예를 들어, 제1 그루브 는 상기 회전판의 회전 중심에 대하여 서로 다른 거리로 회전 몸체의 상면 및 하면에 복수개가 형성될 수 있다. 스페이서는, 예를 들어, 원판 형상으로 형성되며, 스페이서는 회전판의 회전 중심에 나사 결합 및 끼움 결합 등 다양한 방식으로 결합된다. 스페이서는 회전판의 회전 중심에 결합되어 후술될 회전 유닛과 회전판을 연결 한다. 회전 유닛은 스페이서에 결합되어 회전판을 회전시키며, 이를 위해 회전 유닛은 회전축 및 모터를 포 함한다. 회전축의 일단은 스페이서에 결합되며, 일단과 대향하는 타단은 모터에 결합되며, 모터가 가동됨에 따 라 회전축과 결합된 스페이서 및 회전판이 회전된다. 또한 본 발명의 일실시예에서, 회전 유닛은 작업 테이블의 하부에 배치될 수 있으며, 회전 유닛에는 분산매와 분말의 혼합 용액을 투입하는 펌프(미도시)가 작업 테이블의 하부에 함께 배치될 수 있다. 고정판은 고정 몸체 및 제2 그루브를 포함한다. 고정 몸체는 회전 몸체의 상면, 하면 및 측면과 마주하게 배치되어 분산매와 분말의 혼합 용액이 통과되는 제1 갭을 갖는 통로를 형성한다. 고정 몸체는 제1 고정 몸체 및 제2 고정 몸체를 포함한다.제1 고정 몸체는, 예를 들어, 원판 형상으로 형성되며, 제1 고정 몸체는 회전 몸체의 상면 및 하면에 마주하게 배치된다. 본 발명의 일실시예에서, 제1 고정 몸체는 회전 몸체와 대응되는 사이즈 및 형상으로 형성된다. 제2 고정 몸체는, 예를 들어, 원통 형상으로 형성되며, 제2 고정 몸체는 회전 몸체의 측면에 마주하게 배치된다. 본 발명의 일실시예에서 제2 고정 몸체는 하나에 원통 형상으로 형성되는 것이 도시 및 설명되고 있 지만, 이와 다르게 제2 고정 몸체는 링 형상으로 형성되어 복수개가 적층되어도 무방하다. 본 발명의 일실시예에서 바닥판(미도시)은 작업 테이블과 일체로 형성될 수 있다. 상판에는 분산매와 분말의 혼합 용액이 펌프(미도시)에 의하여 투입되는 투입구 및 바닥판(미도시)에는 투입된 분산매와 분말의 혼합 용액 이 배출되는 배출구가 각각 형성된다. 한편, 투입구 및 배출구의 위치는 작업자가 작업환경에 따라서 적절히 조절 가능하며, 예를 들어, 배출구를 상 판 및 투입구를 바닥판(미도시)에 형성되거나 투입구 및 배출구를 제2 고정 몸체에 형성될 수도 있다. 나노소재 분산장치에 투입되는 혼합 용액의 분산매는 물, 이온용액, 분산제를 첨가한 유체, 유기용매 등일 수 있으며, 분말은 나노소재를 제조할 수 있는 다양한 금속 분말 및 흑연 분말, 세라믹 분말일 수 있다. 본 발명의 일실시예에서 나노소재 분산장치에 투입되는 혼합 용액의 분산매는 물일 수 있으며, 분말은 흑연 분말일 수 있다. 전단 부재는, 예를 들어, 구형상을 갖는 볼이며, 전단 부재는 제1 및 제2 그루브들 사이에 복수개가 배치된다. 전단 부재는 회전판의 회전에 따라 제1 및 제2 그루브 사이에서 구름 운동 및 미끄럼 운동을 함으로써 이동 및 회전된다. 전단 부재가 회전함에 따라 전단 부재 및 제1 및 제2 그루브들 사이에는 전단력이 발생되어 분산매와 분말의 혼합 용액으로부터 물리적으로 나노소재가 박리된다. 한편, 전단 부재는 제1 및 제2 그루브 내부에 고정되지 않고 제1 및 제2 그루브를 따라 지속적으로 이동됨으로 써 전단 부재의 마모를 최소화할 수 있다. 또한, 전단 부재, 회전판 및 고정판의 표면에는 열경화, 도금, 이온 코팅 및 용사 코팅 등의 방법으로 표면처리하여 전단 부재, 회전판 및 고정판의 표면이 마모되는 것을 방지할 수도 있다."}
{"patent_id": "10-2023-0108763", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "이상에서 본 발명은 도면에 도시된 일 실시예를 참고로 설명되었으나, 본 기술분야의 통상의 지식을 가진 자라 면 이로부터 다양한 변형 및 균등한 타 실시예가 가능하다는 점을 이해할 것이다."}
{"patent_id": "10-2023-0108763", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 나노소재 제조 절차를 도시한 공정도이다. 도 2는 본 발명의 실시예에 사용되는 나노소재 품질평가 및 공정 제어장치를 도시한 개략도이다. 도 3은 본 발명의 실시예에 사용되는 LSTM 인공지능 모델을 설명하기 위한 도면이다. 도 4는 본 발명의 실시예에 따라 나노소재 제조에 사용할 수 있는 나노소재 분산장치의 외관사시도이다."}
