{"patent_id": "10-2018-0083064", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0008869", "출원번호": "10-2018-0083064", "발명의 명칭": "객실 관리 서비스 제공방법 및 전자장치", "출원인": "주식회사 케이티", "발명자": "홍미정"}}
{"patent_id": "10-2018-0083064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자장치가 객실에 구비된 객실단말로부터 서비스를 위한 요청메시지를 수신하여 분석하는 단계; 상기 전자장치가 상기 요청메시지의 분석결과에 따라 상기 서비스의 종류를 확인하는 단계;상기 전자장치가 상기 확인된 서비스의 종류를 기반으로 복수의 서버 중에서 상기 서비스의 처리가 가능한 서버를 확인하는 단계;상기 전자장치가 확인된 서버로 상기 요청메시지를 전송하는 단계; 및상기 전자장치가 상기 서비스의 처리 결과에 따라 상기 서비스의 처리완료 메시지를 생성하여 상기 객실단말로전송하는 단계;를 포함하는 것을 특징으로 하는 객실 관리 서비스 제공방법."}
{"patent_id": "10-2018-0083064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 전자장치는 상기 확인된 서비스의 종류를 기반으로 상기 전자장치에서 상기 서비스의 자체 처리가 가능하면 상기 서비스를 처리하는 단계;를 더 포함하는 것을 특징으로 하는 객실 관리 서비스 제공방법."}
{"patent_id": "10-2018-0083064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 요청메시지를 수신하여 분석하는 단계는, 상기 전자장치는 상기 요청메시지가 선행동작의 완료가 필요한 상태에 수신된 메시지이면, 상기 선행동작을 우선적으로 처리하는 단계;를 더 포함하는 것을 특징으로 하는 객실 관리 서비스 제공방법."}
{"patent_id": "10-2018-0083064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 서비스의 종류는, 상기 전자장치에서 자체 처리가 가능한 인공지능 서비스, 외부서버와의 연결이 필요한 URL접속서비스, 내부서버와 연동하여 객실 관리자의 관리가 필요한 관리요청 서비스 및 상기 내부서버와 연동하여 상기 객실 내 배치된기기들을 제어하기 위한 제어 서비스를 포함하는 것을 특징으로 하는 객실 관리 서비스 제공방법."}
{"patent_id": "10-2018-0083064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 선행동작은, 상기 요청메시지 수신 이전에 상기 요청메시지와 동일한 최초 요청메시지가 수신되어 상기 최초 요청메시지에대응하는 서비스를 처리 중인 동작 및 상기 내부서버로부터 수신된 공지 메시지를 상기 객실단말에 표시하여 상기 객실단말로부터 상기 공지 메시지에 대한 확인을 대기하는 동작을 포함하는 것을 특징으로 하는 객실 관리서비스 제공방법."}
{"patent_id": "10-2018-0083064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2020-0008869-3-제3항에 있어서, 상기 요청메시지는, 상기 객실단말에서 입력된 터치신호 및 음성데이터 중 적어도 하나를 포함하는 것을 특징으로 하는 객실 관리서비스 제공방법."}
{"patent_id": "10-2018-0083064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "객실에 구비된 객실단말 및 복수의 서버와 통신을 수행하는 통신부; 및상기 객실단말로부터 수신된 서비스를 위한 요청메시지를 분석하여 상기 서비스의 종류를 확인하고, 상기 복수의 서버 중에서 상기 서비스의 처리가 가능한 서버를 확인하여 상기 확인된 서버로 상기 요청메시지를전송하고, 상기 서비스의 처리 결과에 따라 상기 서비스의 처리완료 메시지를 생성하여 상기 객실단말로 전송하는 제어부;를 포함하는 것을 특징으로 하는 객실 관리 서비스 제공 전자장치."}
{"patent_id": "10-2018-0083064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 제어부는, 상기 확인된 서비스의 종류를 기반으로 상기 서비스의 자체 처리가 가능하면 상기 서비스를 처리하는 것을 특징으로 하는 객실 관리 서비스 제공 전자장치."}
{"patent_id": "10-2018-0083064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서, 상기 제어부는, 상기 요청메시지가 선행동작이 완료가 필요한 상태에서 수신된 메시지이면, 상기 선행동작을 우선적으로 처리하는 것을 특징으로 하는 객실 관리 서비스 제공 전자장치."}
{"patent_id": "10-2018-0083064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 서비스의 종류는, 상기 전자장치에서 자체 처리가 가능한 인공지능 서비스, 외부서버와의 연결이 필요한 URL접속서비스, 내부서버와 연동하여 객실 관리자의 관리가 필요한 관리요청 서비스 및 상기 내부서버와 연동하여 상기 객실 내 배치된기기들을 제어하기 위한 제어 서비스를 포함하는 것을 특징으로 하는 객실 관리 서비스 제공 전자장치."}
{"patent_id": "10-2018-0083064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서, 상기 선행동작은, 상기 요청메시지 수신 이전에 상기 요청메시지와 동일한 최초 요청메시지가 수신되어 상기 최초 요청메시지에대응하는 서비스를 처리 중인 동작 및 상기 내부서버로부터 수신된 공지 메시지를 상기 객실단말에 표시하여 상기 객실단말로부터 상기 공지 메시지에 대한 확인을 대기하는 동작을 포함하는 것을 특징으로 하는 객실 관리서비스 제공 전자장치."}
{"patent_id": "10-2018-0083064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제9항에 있어서, 상기 요청메시지는, 상기 객실단말에서 입력된 터치신호 및 음성데이터 중 적어도 하나를 포함하는 것을 특징으로 하는 객실관리 서공개특허 10-2020-0008869-4-비스 제공 전자장치."}
{"patent_id": "10-2018-0083064", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 객실 관리 서비스 제공방법 및 전자장치에 관한 것으로, 전자장치가 객실에 구비된 객실단말로부터 서 비스를 위한 요청메시지를 수신하여 분석하는 단계, 전자장치가 요청메시지의 분석결과에 따라 서비스의 종류를 확인하는 단계, 전자장치가 확인된 서비스의 종류를 기반으로 복수의 서버 중에서 서비스의 처리가 가능한 서버 를 확인하는 단계, 전자장치가 확인된 서버로 요청메시지를 전송하는 단계 및 전자장치가 서비스의 처리 결과에 따라 서비스의 처리완료 메시지를 생성하여 객실단말로 전송하는 단계를 포함하며, 다른 실시 예로도 적용이 가 능하다."}
{"patent_id": "10-2018-0083064", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 객실 관리 서비스 제공방법 및 전자장치에 관한 것으로, 전자장치가 객실에 설치된 객실단말로부터 수신된 서비스 요청메시지를 분석하고, 서비스의 종류에 따라 서비스를 직접 처리하거나 서로 다른 서버에서 서 비스를 처리하도록 서비스 요청메시지를 서버로 전송하는 객실 관리 서비스 제공방법 및 전자장치에 관한 것이다."}
{"patent_id": "10-2018-0083064", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "국내 및 해외로의 여행이 증가하면서 호텔, 게스트하우스 등의 숙박업체를 이용하는 사람들의 수도 증가하고 있 는 추세이다. 이러한 숙박업체를 이용하는 고객들은 객실에 설치된 터치 패드 등의 제어기를 이용하여 조명기기, 에어컨, 보일러 등의 전자기기를 직접 제어한다. 또한, 고객들은 체크인/아웃, 객실 내부에 수건, 칫 솔 등의 어메니티(amenity)의 요청 및 객실 청소 요청 등이 필요한 경우, 숙박업체의 관리자에게 전화를 하거나 관리자를 직접 방문하여 요청한다. 아울러, 관리자는 고객의 체크아웃 시간 등을 공지하기 위해 객실로 전화를 하거나 직접 방문하여 공지한다. 이와 같이, 현재 숙박업체에서는 고객이 관리자 대면 또는 전화를 통해 서비스를 요청하거나, 관리자가 고객 대 면 또는 전화를 통해 공지를 수행해야 하는 불편함이 존재한다. 또한, 관리자 입장에서는 다수의 사용자에게 동 일한 질문에 대한 답변을 여러 번 해야 하는 번거로움이 발생하고, 다수의 사용자에게 동시에 요청이 있을 경우 관리자가 일일이 응대하지 못하여 사용자의 불만이 발생하는 문제점이 발생한다."}
{"patent_id": "10-2018-0083064", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "이러한 종래의 문제점을 해결하기 위한 본 발명의 실시 예들은 전자장치는 고객이 객실단말을 터치 및 음성 중 적어도 하나로 조작하여 객실단말로부터 발생된 서비스에 대한 요청메시지를 수신하고, 관리자가 아닌 전자장치 가 서비스를 자동적으로 처리하도록 하는 객실 관리 서비스 제공방법 및 전자장치를 제공하는 것이다. 또한, 본 발명의 실시 예들은 전자장치가 요청메시지에 대응되는 서비스 종류를 확인하고, 서비스 종류에 따라 서로 다른 서버에서 서비스를 처리할 수 있도록 하여 전자장치에 발생되는 과부하를 방지하고, 기존에 숙박업체 에서 이용하는 서버를 지속적으로 사용할 수 있는 객실 관리 서비스 제공방법 및 전자장치를 제공하는 것이다."}
{"patent_id": "10-2018-0083064", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시 예에 따른 객실 관리 서비스 제공방법은, 전자장치가 객실에 구비된 객실단말로부터 서비스를 위한 요청메시지를 수신하여 분석하는 단계, 상기 전자장치가 상기 요청메시지의 분석결과에 따라 상기 서비스 의 종류를 확인하는 단계, 상기 전자장치가 상기 확인된 서비스의 종류를 기반으로 복수의 서버 중에서 상기 서 비스의 처리가 가능한 서버를 확인하는 단계, 상기 전자장치가 확인된 서버로 상기 요청메시지를 전송하는 단계 및 상기 전자장치가 상기 서비스의 처리 결과에 따라 상기 서비스의 처리완료 메시지를 생성하여 상기 객실단말 로 전송하는 단계를 포함하는 것을 특징으로 한다. 또한, 전자장치는 상기 확인된 서비스의 종류를 기반으로 상기 전자장치에서 상기 서비스의 자체 처리가 가능하 면 상기 서비스를 처리하는 단계를 더 포함하는 것을 특징으로 한다. 또한, 요청메시지를 수신하여 분석하는 단계는, 상기 전자장치는 상기 요청메시지가 선행동작의 완료가 필요한 상태에 수신된 메시지이면, 상기 선행동작을 우선적으로 처리하는 단계를 더 포함하는 것을 특징으로 한다. 또한, 서비스의 종류는, 상기 전자장치에서 자체 처리가 가능한 인공지능 서비스, 외부서버와의 연결이 필요한 URL접속서비스, 내부서버와 연동하여 객실 관리자의 관리가 필요한 관리요청 서비스 및 상기 내부서버와 연동하 여 상기 객실 내 배치된 기기들을 제어하기 위한 제어 서비스를 포함하는 것을 특징으로 한다. 또한, 선행동작은, 상기 요청메시지 수신 이전에 상기 요청메시지와 동일한 최초 요청메시지가 수신되어 상기 최초 요청메시지에 대응하는 서비스를 처리 중인 동작 및 상기 내부서버로부터 수신된 공지 메시지를 상기 객실단말에 표시하여 상기 객실단말로부터 상기 공지 메시지에 대한 확인을 대기하는 동작을 포함하는 것을 특징으 로 한다. 또한, 요청메시지는, 상기 객실단말에서 입력된 터치신호 및 음성데이터 중 적어도 하나를 포함하는 것을 특징 으로 한다. 아울러, 본 발명의 실시 예에 따른 객실 관리 서비스 제공 전자장치는, 객실에 구비된 객실단말 및 복수의 서버 와 통신을 수행하는 통신부 및 상기 객실단말로부터 수신된 서비스를 위한 요청메시지를 분석하여 상기 서비스 의 종류를 확인하고, 상기 복수의 서버 중에서 상기 서비스의 처리가 가능한 서버를 확인하여 상기 확인된 서버 로 상기 요청메시지를 전송하고, 상기 서비스의 처리 결과에 따라 상기 서비스의 처리완료 메시지를 생성하여 상기 객실단말로 전송하는 제어부를 포함하는 것을 특징으로 한다. 또한, 제어부는, 상기 확인된 서비스의 종류를 기반으로 상기 서비스의 자체 처리가 가능하면 상기 서비스를 처 리하는 것을 특징으로 한다. 또한, 제어부는, 상기 요청메시지가 선행동작이 완료가 필요한 상태에서 수신된 메시지이면, 상기 선행동작을 우선적으로 처리하는 것을 특징으로 한다. 또한, 서비스의 종류는, 상기 전자장치에서 자체 처리가 가능한 인공지능 서비스, 외부서버와의 연결이 필요한 URL접속서비스, 내부서버와 연동하여 객실 관리자의 관리가 필요한 관리요청 서비스 및 상기 내부서버와 연동하 여 상기 객실 내 배치된 기기들을 제어하기 위한 제어 서비스를 포함하는 것을 특징으로 한다. 또한, 선행동작은, 상기 요청메시지 수신 이전에 상기 요청메시지와 동일한 최초 요청메시지가 수신되어 상기 최초 요청메시지에 대응하는 서비스를 처리 중인 동작 및 상기 내부서버로부터 수신된 공지 메시지를 상기 객실 단말에 표시하여 상기 객실단말로부터 상기 공지 메시지에 대한 확인을 대기하는 동작을 포함하는 것을 특징으 로 한다. 또한, 요청메시지는, 상기 객실단말에서 입력된 터치신호 및 음성데이터 중 적어도 하나를 포함하는 것을 특징 으로 한다."}
{"patent_id": "10-2018-0083064", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상술한 바와 같이 본 발명의 객실 관리 서비스 제공방법 및 전자장치는, 고객이 객실단말을 터치 및 음성 중 적 어도 하나로 조작하여 객실단말로부터 발생된 서비스에 대한 요청메시지를 수신하고 관리자가 아닌 전자장치가 서비스를 자동적으로 처리하도록 함으로써, 고객의 편의성의 향상시킬 수 있고, 관리자의 업무부하를 감소하여 업무향상도를 증진시킬 수 있는 효과가 있다. 또한, 본 발명의 객실 관리 서비스 제공방법 및 전자장치는, 전자장치가 요청메시지에 대응되는 서비스 종류를 확인하고, 서비스 종류에 따라 서로 다른 서버에서 서비스를 처리할 수 있도록 함으로써 전자장치에 발생되는 과부하를 방지할 수 있고, 기존에 숙박업체에서 이용하는 서버를 지속적으로 사용할 수 있는 효과가 있다."}
{"patent_id": "10-2018-0083064", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명에 따른 바람직한 실시 형태를 첨부된 도면을 참조하여 상세하게 설명한다. 첨부된 도면과 함께 이하에 개시될 상세한 설명은 본 발명의 예시적인 실시형태를 설명하고자 하는 것이며, 본 발명이 실시될 수 있 는 유일한 실시형태를 나타내고자 하는 것이 아니다. 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관 계없는 부분은 생략할 수 있고, 명세서 전체를 통하여 동일 또는 유사한 구성 요소에 대해서는 동일한 참조 부호를 사용할 수 있다. 본 발명의 일 실시 예에서, “또는”, “적어도 하나” 등의 표현은 함께 나열된 단어들 중 하나를 나타내거나, 또는 둘 이상의 조합을 나타낼 수 있다. 예를 들어, “A 또는 B”, “A 및 B 중 적어도 하나”는 A 또는 B 중 하나만을 포함할 수 있고, A와 B를 모두 포함할 수도 있다. 도 1은 본 발명의 실시 예에 따른 객실 관리 서비스를 제공하는 시스템을 나타낸 도면이다. 도 1을 참조하면, 본 발명에 따른 시스템은 객실단말, 전자장치 및 서버를 포함하고, 서버 는 제1 서버(300a), 제2 서버(300b) 내지 제n 서버(300n)를 포함할 수 있다. 객실단말은 숙박업체의 각 객실마다 설치된 단말로, 터치스크린으로 형성되어 사용자 입력에 따른 터치신 호를 입력받고, 다양한 정보를 표시할 수 있는 디스플레이부(미도시), 음성데이터 획득을 위한 마이크(미도시), 서비스 처리결과 메시지 및 다양한 음향데이터를 출력하기 위한 스피커(미도시), 터치신호 및 음성데이터 중 어 느 하나에 의해 생성된 요청메시지를 전자장치로 전송하기 위한 통신부(미도시) 및 제어부(미도시)를 포함 할 수 있다. 객실단말은 객실에 배치된 TV, PC, 월패드(wall pad) 등일 수 있다. 객실단말은 객실에 재실 중인 고객으로부터 서비스 요청을 입력받는다. 객실단말는 터치스크린을 통 해 터치신호가 입력되면 이를 서비스 요청으로 확인한다. 또한, 객실단말은 마이크를 통해 음성데이터가 입력되면 이를 서비스 요청으로 확인한다. 객실단말은 확인된 서비스 요청에 대한 요청메시지를 생성한다. 이때, 객실단말은 요청메시지에 객실단말이 배치된 객실 정보를 포함할 수 있다. 객실단말은 생성된 요청메시지를 전자장치로 전송한다. 이를 위해, 객실단말은 전자장치와 5G(5th generation), LTE-A(long term evolution-advanced), LTE(long term evolution), WiFi(wireless fidelity) 등의 무선 통신을 수행할 수 있다. 객실단말은 요청메시지를 전자장치로 전송한 이후에, 전자장치로부터 서비스 처리완료 메시지를 수신하여 이를 표시부에 표시할 수 있다. 전자장치는 객실단말로부터 수신된 서비스를 위한 요청메시지를 분석하여 서비스의 종류를 확인하고, 서비스를 처리할 수 있는 서버로 요청메시지를 전송한다. 전자장치는 서버로부터 서비스에 대한 처리결과 메시지가 수신되면 서비스 처리완료 메시지를 생성하여 객실단말로 전송한다. 아울러, 전자장치 는 확인된 서비스의 종류가 전자장치에서 자체적으로 처리할 수 있는 서비스이면 자체 처리하고 서비 스 처리완료 메시지를 생성하여 객실단말로 전송한다. 전자장치의 주요 구성은 하기의 도 2를 이용하 여 설명하기로 한다. 도 2는 본 발명의 실시 예에 따른 객실 관리 서비스를 제공하는 전자장치를 나타낸 도면이 다. 도 2를 참조하면, 본 발명에 따른 전자장치는 통신부, 입력부, 표시부, 메모리 및 제어부를 포함한다. 통신부는 객실단말 및 서버와의 통신을 수행한다. 이를 위해, 통신부는 5G(5th generation), LTE-A(long term evolution-advanced), LTE(long term evolution), WiFi(wireless fidelity) 등 의 무선 통신을 수행할 수 있다. 입력부는 전자장치를 운영하는 운영자 입력에 대응하여 입력 데이터를 발생시킨다. 입력부는 적 어도 하나의 입력수단을 포함한다. 입력부는 키패드(key pad), 돔 스위치(dome switch), 터치 패널(touch panel), 터치 키(touch key) 및 버튼(button)을 포함한다. 표시부는 전자장치의 동작에 따른 출력 데이터를 출력한다. 이를 위해, 표시부는 액정 디스플레 이(LCD; liquid crystal display), 발광 다이오드(LED; light emitting diode) 디스플레이, 유기 발광 다이오 드(OLED; organic LED) 디스플레이, 마이크로 전자기계 시스템(MEMS; micro electro mechanical systems) 디스 플레이 및 전자 종이(electronic paper) 디스플레이를 포함할 수 있다. 표시부는 입력부와 결합되어 터치 스크린(touch screen)으로 구현될 수 있다. 메모리는 전자장치의 동작 프로그램들을 저장한다. 메모리는 객실단말이 배치된 객실정보 및 객실단말에 설치된 사용자 UI(user interface)의 탬플릿을 저장한다. 메모리는 객실단말로부 터 수신된 요청메시지를 분석하기 위한 프로그램을 저장한다. 또한, 메모리는 서버를 구성하는 제1 서버(300a) 내지 제n 서버(300n)로의 접속 주소를 저장하고, 제1 서버(300a)에 접속하기 위해 객실에 할당된 가 상 ID 등을 저장한다. 아울러, 메모리는 객실단말로부터 인공지능 서비스를 이용하기 위한 요청메시지에 대응하는 서비스를 처리하기 위한 빅데이터를 저장할 수 있다. 제어부는 입력분석부, 서비스확인부 및 정보처리부를 포함하여 객실단말로부터 수신 된 요청메시지에 대응되는 서비스를 처리한다. 보다 구체적으로, 입력분석부는 객실단말로부터 요청 메시지가 수신되면, 수신된 요청메시지의 분석을 수행한다. 입력분석부는 요청메시지의 분석을 통해 요청 메시지를 전송한 객실단말이 구비된 객실정보를 확인할 수 있다. 입력분석부는 요청메시지가 터치신 호에 의해 발생된 데이터일 경우, 확인된 객실 정보에 따라 객실단말에 설치된 UI(user interface)를 확인 할 수 있다. 입력분석부는 확인된 UI에서 터치신호가 발생된 위치에 할당된 서비스를 확인할 수 있다. 또 한, 입력분석부는 요청메시지가 음성데이터일 경우, 음성데이터를 분석하여 고객이 요청한 서비스를 확인 할 수 있다. 이를 위해, 입력분석부는 음성데이터를 텍스트데이터로 변환하여 텍스트데이터의 자연어 처리 등을 통해 음성데이터에서 키워드를 추출할 수 있다. 서비스확인부는 입력분석부에서 요청메시지의 분석결과를 기반으로 요청메시지에 대응되는 서비스를 처리한다. 보다 구체적으로, 서비스확인부는 요청메시지 수신 시에 선행동작의 완료가 필요한 상태이면, 선행동작을 우선적으로 처리한다. 예를 들어, 임계시간 동안 동일한 요청메시지가 반복적으로 수신되면, 서비스 확인부는 최초에 수신된 요청메시지에 대응되는 서비스를 선행적으로 처리하고 이후에 수신된 요청메시지 는 무시한다. 또한, 요청메시지 수신 시점에 객실단말에 공지 메시지가 표시된 상태이면, 이를 선행동작으 로 확인한다. 서비스확인부는 객실단말로부터 공지 메시지에 대한 확인신호가 수신되기 이전까지 요 청메시지에 대응되는 서비스를 처리하지 않는다. 이때, 공지 메시지는 제2 서버(300b)에서 객실로 제공하는 퇴 실시각, 공지사항 등일 수 있다. 서비스확인부는 요청메시지 수신 시에 완료되어야 하는 선행동작이 없으면, 수신된 요청메시지에 대응되는 서비스를 처리할 수 있다. 서비스확인부는 요청메시지의 분석결과를 기반으로 서비스의 종류를 확인한다. 서비스의 종류는, 서비스확인부에서 자체 처리가 가능한 인공지능 서비스, 제1 서버(300a)와의 연결이 필 요한 URL접속서비스, 제2 서버(300b)와 연동하여 객실 관리자의 관리가 필요한 관리요청 서비스 및 제2 서버 (300b)와 연동하여 객실 내 배치된 기기들을 제어하기 위한 제어 서비스를 포함할 수 있다. 본 발명의 실시 예 에서는 설명의 편의를 위해 제1 서버(300a)와 제2 서버(300b)에 대해서만 기재하고 있으나, 서비스의 종류에 따 라 별도의 서버를 추가로 사용할 수 있다. 서비스확인부는 서비스의 종류가 인공지능 서비스이면, 요청메시지에 대응되는 서비스를 처리한다. 서비스 확인부는 서비스의 종류가 URL접속서비스이면 제1 서버(300a)로 요청메시지를 전송하고, 서비스의 종류가 관리요청 서비스 또는 제어 서비스 중 어느 하나에 해당하면 제2 서버(300b)로 요청메시지를 전송한다. 아울러, 정보처리부는 서비스의 종류가 인공지능 서비스이면, 서비스확인부에서 서비스의 처리결과를 확인한다. 정보처리부는 서비스 처리결과를 기반으로 서비스 처리완료 메시지를 생성하여 객실단말로 전송한다. 정보처리부는 서비스의 종류가 URL접속서비스, 관리요청 서비스 또는 제어 서비스 중 어느 하나 이면, 제1 서버(300a) 또는 제2 서버(300b)로 요청메시지를 전송하고, 해당 서버로부터 서비스 처리결과 메시지 를 수신한다. 정보처리부는 수신된 서비스 처리결과 메시지를 기반으로 서비스 처리완료 메시지를 생성하 여 객실단말로 전송한다. 서버는 전자장치에서 전송되는 요청메시지에 대응되는 서비스를 처리한다. 서버는 서비스의 종 류에 따라 제1 서버(300a), 제2 서버(300b) 내지 제n 서버(300n)를 포함한다. 제1 서버(300a)는 음악 스트리밍 서비스를 제공하기 위한 서버, 동영상 재생 서비스를 제공하기 위한 서버, 날 씨 정보를 실시간으로 제공하기 위한 서버 등 특정 URL을 갖는 웹 사이트를 제공하는 서로 다른 서버를 통칭한 다. 제1 서버(300a)는 전자장치의 부하 경감, 서비스 응대 속도 향상 등을 위해 숙박업체의 외부에 위치할 수 있다. 서버는 전자장치로부터 URL접속서비스를 이용하기 위한 요청메시지가 수신되면, 요청메시지 에 대응되는 서비스를 전자장치로 제공할 수 있다. 예를 들어, 제1 서버(300a)는 전자장치로부터 “ 펜타곤 빛나리 틀어줘”라는 요청메시지가 수신되면, “펜타곤”의 “빛나리”를 객실단말에서 재생할 수 있도록 서비스 처리결과로써 해당 음원데이터를 전자장치로 제공한다. 이때, 제1 서버(300a)는 전자장치 로부터 수신된 요청메시지를 분석할 수 있고, 요청메시지가 분석된 분석결과만을 수신할 수 있다. 아울러, 제1 서버(300a)는 음원데이터를 제공하기 위해 객실단말에 할당된 가상 ID를 요청메시지와 함께 수신하고, 가상ID의 적합성 여부를 판단하여 음원데이터를 제공할 수 있다. 즉, 제1 서버(300a)는 요청메시지와 함께 수신 된 가상ID, 숙박업체의 고유정보 및 객실의 고유정보를 비교한다. 제1 서버(300a)는 가상ID가 제1 서버(300a)에 기등록된 것으로 확인되면 전자장치로 음원데이터를 제공할 수 있다. 제2 서버(300b)는 객실 어메니티 교체 요청, 객실에 배치된 조명을 포함하는 기기의 제어 요청에 대한 서비스를 제공하기 위한 서버를 의미한다. 제2 서버(300b)는 전자장치로부터 관리요청 서비스를 이용하기 위한 요청 메시지가 수신되면, 요청메시지에 대응되는 서비스를 전자장치로 제공할 수 있다. 예를 들어, 제2 서버 (300b)는 전자장치로부터 “수건이 필요해”라는 요청메시지가 수신되면, 객실 관리자에게 수건이 필요한 객실정보를 알려준다. 제2 서버(300b)는 객실관리자로부터 처리요청 확인신호가 수신되면, 객실 관리자에게 수 건을 요청하였음을 알려주는 서비스 처리결과 메시지를 전자장치로 전송한다. 이를 위해, 객실 관리자는 제2 서버(300b)와 통신이 가능한 휴대용 단말을 휴대할 수 있다. 또한, 제2 서버(300b)는 전자장치로부터 “조명 꺼줘”라는 요청메시지가 수신되면, 요청메시지를 입력한 객실정보를 확인한다. 제2 서버(300b)는 객실정보에 해당하는 객실에서 켜져 있는 조명을 확인하고, 켜져 있는 조명을 끄도록 객실 내에 배치된 기기에 대한 제어신호를 서비스 처리결과 메시지로써 전자장치로 전송할 수 있다. 아울러, 제2 서버(300b)는 기존에 숙박업체에서 이용하는 서버를 지속적으로 사용할 수 있기 때문에, 숙박업체의 내부에 위치하는 것이 바람직하다. 그러나, 제2 서버(300b)는 숙박업체에서 자체적으로 운영 및 관 리하는 서버로 숙박업체의 외부에 위치할 수도 있다. 도 3은 본 발명의 실시 예에 따른 객실 관리 서비스를 제공하는 방법을 나타낸 흐름도이다. 도 3을 참조하면, 301단계에서 객실단말은 객실에 머무는 고객으로부터 서비스 요청을 입력받는다. 객실단 말은 객실단말의 터치스크린을 통해 터치신호가 입력되면 이를 서비스 요청으로 확인한다. 또한, 객 실단말은 객실단말의 마이크를 통해 고객의 음성데이터가 입력되면 이를 서비스 요청으로 확인한다. 객실단말은 서비스 요청을 요청메시지로 생성한다. 이때, 요청메시지에는 객실단말이 구비된 객실 정 보가 포함된다. 303단계에서 객실단말은 요청메시지를 전자장치로 전송한다. 305단계에서 전자장치는 요청메시지를 분석하고 307단계를 수행한다. 307단계에서 전자장치는 서비스 의 종류를 확인한다. 전자장치는 요청메시지의 분석을 통해 요청메시지가 생성된 객실단말이 설치된 객실 정보를 확인할 수 있다. 전자장치는 요청메시지가 터치신호에 의해 발생된 데이터일 경우, 확인된 객 실정보를 기반으로 객실단말에 표시된 서비스 요청 UI(user interface)를 확인한다. 전자장치는 확인 된 UI에서 터치신호가 발생된 위치에 할당된 서비스를 확인하여 서비스의 종류를 확인할 수 있다. 또한, 전자장 치는 요청메시지가 음성데이터일 경우, 음성데이터 분석을 통해 서비스의 종류를 확인할 수 있다. 아울러, 서비스의 종류는 전자장치에서 자체 처리가 가능한 인공지능 서비스, 제1 서버(300a)와의 연결이 필요한 URL접속서비스, 제2 서버(300b)와 연동하여 객실 관리자의 관리가 필요한 관리요청 서비스 및 제2 서버 (300b)와 연동하여 객실 내 배치된 기기들을 제어하기 위한 제어 서비스를 포함할 수 있다. 309단계에서 전자장치는 서비스 종류가 전자장치에서 자체적으로 처리할 수 있는 서비스인 것으로 확 인되면 315단계를 수행한다. 315단계에서 전자장치는 요청메시지에 대응되는 서비스를 자체적으로 처리하 고 321단계를 수행한다. 이때, 자체적으로 처리할 수 있는 서비스는 인공지능 서비스로 예컨대, 숙박업체 내에 입점된 매장들의 오픈/마감 시각, 객실 와이파이 정보, 숙박업체와 근접한 관광지 정보 제공, 상기 관광지로의 이동 수단 등에 대한 정보 제공 및 숙박업체를 기준으로 임계 반경 내에 위치한 식당으로의 예약 서비스를 포함 할 수 있다. 예컨대, 전자장치가 객실단말로부터 “AA식당 예약해줘”라는 요청메시지를 수신하면 AA식당의 전화 번호를 확인하고, 확인된 전화번호로 바로 연결하여 고객이 직접 AA식당에 예약을 수행할 수 있도록 인공지능 서비스를 제공할 수 있다. 또한, 전자장치가 객실단말로부터 “와이파이 비밀번호 알려줘”라는 요청 메시지를 수신하면 객실에서 접속 가능한 와이파이의 비밀번호를 확인하여 객실단말로 제공할 수 있다. 309단계에서 전자장치는 서비스 종류가 전자장치에서 자체적으로 처리할 수 없는 서비스인 것으로 확 인되면 311단계를 수행한다. 311단계에서 전자장치는 서비스를 처리할 수 있는 서버를 확인한다. 313 단계에서 전자장치는 확인된 서버로 요청메시지를 전송하고, 317단계에서 서버는 요청메시지에 대응하는 서비스를 처리한다. 319단계에서 서버는 서비스의 처리결과를 전자장치로 전송하고, 전자장 치는 321단계를 수행한다. 보다 구체적으로, 서버에서 처리할 수 있는 서비스의 종류는 URL접속서비스, 관리요청 서비스 및 제어 서 비스 등을 포함할 수 있다. 전자장치는 서비스의 종류가 URL접속서비스인 것으로 확인되면, 요청메시지를제1 서버(300a)로 전송한다. 전자장치는 서비스의 종류가 관리요청 서비스 및 제어 서비스이면 요청메시지 를 제2 서버(300b)로 전송한다. 제1 서버(300a)는 음악 사이트, 동영상 감상 사이트, 날씨 제공 사이트 등과 같이 특정 URL을 통해 접속하는 웹 사이트를 제공하는 서버일 수 있다. 예컨대, 전자장치가 객실단말로부터 “펜타곤 빛나리 틀어줘”라 는 요청메시지를 수신하면, 전자장치는 요청메시지의 분석을 통해 서비스 종류가 URL접속서비스인 것으로 확인할 수 있다. 전자장치는 음악 사이트를 제공하는 제1 서버(300a)로 요청메시지 또는 요청메시지의 분 석결과를 전송하고, 제1 서버(300a)는 “펜타곤”의 “빛나리”를 객실단말에서 재생할 수 있도록 서비스 처리결과를 전자장치로 제공한다. 제2 서버(300b)는 객실 어메니티의 교체 등을 위해 관리자에게 객실관리를 요청할 수 있는 서버일 수 있다. 예 컨대, 전자장치가 객실단말로부터 “수건이 필요해”라는 요청메시지를 수신하면, 요청메시지의 분석 을 통해 서비스 종류가 관리요청 서비스인 것으로 확인할 수 있다. 전자장치는 제2 서버(300b)로 요청메시 지 또는 요청메시지의 분석결과를 전송한다. 제2 서버(300b)는 객실 관리자에게 수건이 필요한 객실정보를 알려 주고, 관리자로부터 처리요청 확인신호가 수신되면 객실 관리자에게 수건을 요청하였음을 알려주는 서비스 처리 완료 메시지를 전자장치로 제공한다. 아울러, 제2 서버(300b)는 객실에 배치된 조명, 보일러, 에어컨 등의 기기를 제어할 수 있는 서버일 수 있다. 예컨대, 전자장치가 객실단말로부터 “조명 꺼줘”라는 요청메시지를 수신하면, 요청메시지의 분석을 통해 서비스 종류가 제어 서비스인 것으로 확인할 수 있다. 전자장치는 제2 서버(300b)로 요청메시지를 전 송한다. 제2 서버(300b)는 요청메시지가 수신된 객실에서 켜진 조명이 무엇인지 확인하고, 켜져있는 조명의 전 원을 끄도록 객실 내에 배치된 기기에 대한 제어신호를 생성한다. 제2 서버(300b)는 생성된 제어신호를 서비스 처리결과로써 전자장치로 제공한다. 321단계에서 전자장치는 전자장치에서 자체적으로 서비스 처리가 완료되거나, 서버로부터 서비 스 처리결과가 수신되면 처리결과를 알리는 서비스 처리완료 메시지를 생성하고 323단계를 수행한다. 323단계에 서 전자장치는 서비스 처리완료 메시지를 객실단말로 전송하고, 325단계에서 객실단말은 서비스 처리완료 메시지를 표시할 수 있다. 이때, 전자장치는 제2 서버(300b)로부터 제어신호가 서비스 처리결과 로써 수신되면, 제어신호를 이용하여 객실 내에 배치된 조명을 끄고 서비스 처리완료 메시지를 생성할 수 있다. 도 4는 본 발명의 실시 예에 따른 전자장치에서 객실 관리 서비스를 제공하는 방법을 설명하기 위한 순서도이다. 도 4를 참조하면, 401단계에서 제어부는 객실단말로부터 서비스를 위한 요청메시지의 수신여부를 확 인한다. 401단계의 확인결과, 객실단말로부터 요청메시지가 수신되면 제어부의 입력분석부는 요 청메시지를 분석한다. 이때, 요청메시지는 객실단말의 터치스크린으로부터 입력된 터치신호 또는 객실단말 의 마이크로부터 입력된 음성데이터를 포함할 수 있다. 입력분석부는 요청메시지를 분석하여 요청메 시지가 입력된 객실 정보를 확인할 수 있다. 입력분석부는 요청메시지가 터치신호에 의해 발생된 데이터일 경우, 확인된 객실 정보에 따라 객실에 구비된 객실단말에 표시된 서비스 요청 UI(user interface)를 확인 할 수 있다. 입력분석부는 확인된 UI에서 터치신호가 발생된 위치에 할당된 서비스를 확인할 수 있다. 또 한, 입력분석부는 요청메시지가 음성데이터일 경우, 음성데이터를 분석하여 고객이 요청한 서비스를 확인 할 수 있다. 이를 위해, 입력분석부는 음성데이터를 텍스트데이터로 변환하여 텍스트데이터의 자연어 처리 등을 통해 음성데이터에서 키워드를 추출할 수 있다. 405단계에서 제어부의 서비스확인부는 입력분석부에서 요청메시지가 분석되면, 선행동작의 완료 가 필요한 상태인지 확인한다. 405단계의 확인결과, 선행동작의 완료가 필요한 상태가 아니면 서비스확인부 는 407단계를 수행한다. 407단계에서 서비스확인부는 입력분석부에서 분석된 결과를 기반으로 요청서비스에 대응되는 서비스 의 종류를 확인한다. 이때, 서비스의 종류는 전자장치에서 자체 처리가 가능한 인공지능 서비스, 제1 서버 (300a)와의 연결이 필요한 URL접속서비스, 제2 서버(300b)와 연동하여 객실 관리자의 관리가 필요한 관리요청 서비스 및 제2 서버(300b)와 연동하여 객실 내 배치된 기기들을 제어하기 위한 제어 서비스를 포함할 수 있다. 409단계에서 서비스확인부는 확인된 서비스의 종류가 인공지능 서비스로 서비스확인부에서 자체 처리 가 가능한 서비스이면 417단계를 수행한다. 417단계에서 서비스확인부는 요청메시지에 대응되는 서비스를처리한다. 이때, 인공지능 서비스는 숙박업체 내에 입점된 매장들의 오픈/마감 시각, 객실 와이파이 정보, 숙박 업체와 근접한 관광지 정보 및 상기 관광지로의 이동 수단 등에 대한 정보 및 숙박업체를 기준으로 임계 반경 내에 위치한 식당으로의 예약 서비스를 등일 수 있다. 예컨대, 요청메시지가 “와이파이 비밀번호 알려줘”라는 요청메시지이면, 서비스확인부는 메모리에 저장된 와이파이 비밀번호를 확인할 수 있다. 419단계에서 정보처리부는 요청메시지에 대응되는 서비스의 처리완료 메시지를 생성하고 421단계를 수행한다. 421단계에서 정보처리부는 서비스 처리완료 메시지를 객 실단말로 전송한다. 이때, 서비스 처리완료 메시지는 417단계에서 확인된 와이파이 비밀번호를 포함한 메 시지일 수 있다. 또한, 요청메시지가 “AA식당 예약해줘”라는 요청메시지이면, 서비스확인부는 메모리에 저장된 AA식 당의 전화번호를 확인하고, 확인된 전화번호로 바로 연결하여 고객이 직접 AA식당에 예약을 수행할 수 있도록 서비스를 제공할 수 있다. 이 경우, 서비스 처리완료 메시지는 AA식당의 전화번호로 전화연결을 하는 다이얼링 화면일 수 있다. 반대로, 409단계에서 서비스확인부는 확인된 서비스의 종류가 인공지능 서비스가 아니고, 서버에서 처리해야 하는 서비스이면 411단계를 수행한다. 이때, 서버에서 처리해야 하는 서비스는 URL접속서비스, 관리요청 서비스 및 제어 서비스일 수 있다. 411단계에서 정보처리부는 407단계에서 확인된 서비스 종류에 대응하는 서비스를 처리할 수 있는 서버를 확인한다. 413단계에서 정보처리부는 확인된 서버로 요청메시지를 전송한다. 415단계에서 정보처리부는 서버로부터 서비스에 대한 처리결과 메시지를 수 신하고 419단계를 수행한다. 419단계에서 정보처리부는 처리결과 메시지를 기반으로 처리완료 메시지를 생 성하여 421단계를 수행한다. 421단계에서 정보처리부는 서비스 처리완료 메시지를 객실단말로 전송한 다. 보다 구체적으로, 서비스확인부는 요청메시지에 대응되는 서비스가 URL접속서비스이면, 해당 서비스를 처 리할 수 있는 제1 서버(300a)로 요청메시지를 전송할 수 있다. URL접속 서비스는 음악 스트리밍 서비스, 동영상 재생 서비스, 날씨 확인 서비스 등일 수 있다. 예를 들어, 요청메시지가 “펜타곤 빛나리 틀어줘”라는 요청메 시지이면, 서비스확인부는 서비스 종류가 URL접속서비스임을 확인할 수 있다. 서비스확인부에서 URL 접속서비스임이 확인되면 정보처리부는 음악 스트리밍 서비스를 제공하는 음악 사이트를 제공하는 제1 서 버(300a)로 요청메시지를 전송한다. 이때, 정보처리부는 제1 서버(300a)에서 요청메시지의 분석 없이 “펜 타곤”의 “빛나리”를 추출할 수 있도록 요청메시지의 분석결과를 제1 서버(300a)로 전송할 수 있다. 정보처리 부는 서비스 처리결과 메시지로써, 음원데이터를 수신하여 처리완료 메시지로써 수신된 음원데이터를 객실 단말로 전송할 수 있다. 이를 위해, 서비스확인부는 제1 서버(300a)에 요청메시지를 전송할 때, 해당 서비스를 이용하기 위해 객실에 할당된 가상 ID를 제1 서버(300a)로 함께 전송할 수 있다. 또한, 서비스확인부는 요청메시지에 대응되는 서비스가 객실 어메니티의 교체 등을 위해 관리자에게 객실 관리를 요청하기 위한 관리요청 서비스이면, 관리요청 서비스를 처리할 수 있는 제2 서버(300b)로 요청메시지를 전송할 수 있다. 관리요청 서비스는 객실 내부의 수건, 칫솔, 치약, 슬리퍼 등의 어메니티 교체 및 객실 청소 등의 서비스일 수 있다. 예를 들어, 요청메시지가 “수건필요해”라는 요청메시지이면, 서비스확인부는 서 비스 종류가 관리요청 서비스임을 확인할 수 있다. 서비스확인부에서 관리요청 서비스임이 확인되면 정보 처리부는 관리요청 서비스를 제공하는 제2 서버(300b)로 요청메시지를 전송한다. 이때, 정보처리부는 제2 서버(300b)에서 요청메시지의 분석 없이 수건을 제공할 수 있도록 요청메시지의 분석결과를 제2 서버(300 b)로 전송할 수 있다. 정보처리부는 관리자로부터 처리요청 확인신호를 서비스 처리결과 메시지로써 수신 되면, 관리자에게 수건을 요청하였음을 알려주는 서비스 처리완료 메시지를 객실단말로 전송할 수 있다. 아울러, 서비스확인부는 요청메시지에 대응되는 서비스가 객실에 배치된 복수의 조명을 포함하는 기기를 제어하기 위한 제어 서비스이면, 제어 서비스를 처리할 수 있는 제2 서버(300b)로 요청메시지를 전송할 수 있다. 제어 서비스는 객실 내부에 설치된 조명, 에어컨, 보일러, 냉장고, 텔레비전 등의 기기를 제어하기 위한 서비스일 수 있다. 예를 들어, 요청메시지가 “조명 꺼줘”라는 요청메시지이면, 서비스확인부는 서비스 종류가 제어 서비스임을 확인할 수 있다. 서비스확인부에서 제어 서비스임이 확인되면 정보처리부는 제어 서비스를 제공하는 제2 서버(300b)로 요청메시지를 전송한다. 이때, 정보처리부는 제2 서버(300b)에 서 요청메시지의 분석 없이 기기를 제어할 수 있도록 요청메시지의 분석결과를 제2 서버(300b)로 전송할 수 있 다. 정보처리부는 객실에서 켜진 조명의 전원을 끄도록 객실 내에 배치된 기기를 제어하기 위한 제어신호 를 서비스 처리결과 메시지로써 제2 서버(300b)로부터 수신할 수 있다. 정보처리부는 서비스 처리결과 메시지에 따라 켜져있던 조명의 전원을 끄고, 서비스의 처리를 완료하였음을 알리는 서비스 처리완료 메시지를 생 성하여 객실단말로 전송할 수 있다. 405단계의 확인결과, 선행동작의 완료가 필요한 상태이면 서비스확인부는 423동작을 수행한다. 423단계에 서 서비스확인부는 요청메시지에 대응하는 서비스를 처리하기 이전에 선행동작을 처리한다. 이는 하기의 도 5를 이용하여 설명하기로 한다. 도 5는 본 발명의 실시 예에 따른 전자장치에서 선행동작을 처리하는 방법을 설명하기 위한 상세순서도이다. 도 5를 참조하면, 501단계에서 서비스확인부는 도 4의 401단계에서 요청메시지를 수신하기 이전에 요청메 시지와 동일한 최초 요청메시지가 수신된 상태이면, 503단계를 수행한다. 503단계에서 서비스확인부는 최 초 요청메시지에 대한 서비스를 우선적으로 처리하고 505단계를 수행한다. 505단계에서 정보처리부는 서비 스확인부는 서비스의 처리가 완료되면, 서비스 처리완료 메시지를 생성한다. 507단계에서 정보처리부(25 3)는 서비스 처리완료 메시지를 객실단말로 전송한다. 예컨대, 서비스확인부는 401단계에서 수신된 요청메시지가 “펜타곤 빛나리 틀어줘”이고, 401단계에서 요청메시지를 수신하기 임계시간(예컨대, 15초) 이전 에 동일한 최초 요청메시지가 수신된 상태이면, 서비스확인부는 최초 요청메시지에 대응하는 서비스를 선 행적으로 처리하고, 401단계에서 수신된 요청메시지를 무시할 수 있다. 반대로, 501단계에서 서비스확인부는 도 4의 401단계에서 수신된 요청메시지를 수신하기 이전에 요청메시 지와 동일한 최초 요청메시지가 수신된 상태가 아니면 509단계를 수행한다. 509단계에서 서비스확인부는 확인신호를 대기한다. 이때, 요청메시지 수신 시에 확인신호를 대기하는 선행동작은 제2 서버(300b)로부터 수신 된 공지 메시지를 객실단말로 제공하였으나, 객실단말로부터 공지 메시지에 대한 확인이 입력되지 않 은 상태일 수 있다. 511단계에서 서비스확인부는 객실단말로부터 확인신호가 수신되지 않으면, 509단 계로 회귀하여 확인신호의 수신을 대기한다. 반대로, 511단계에서 서비스확인부는 객실단말로부터 확 인신호가 수신되면 도 4의 403단계로 회귀하여 403단계 내지 421단계를 순차적으로 수행할 수 있다. 이때, 공지 메시지는 체크아웃 시각 등 숙박업체의 리셉션에서 전체 객실 또는 일부 객실로 공지하고자 하는 메시지일 수 있다. 본 명세서와 도면에 개시된 본 발명의 실시 예들은 본 발명의 기술 내용을 쉽게 설명하고 본 발명의 이해를 돕 기 위해 특정 예를 제시한 것일 뿐이며, 본 발명의 범위를 한정하고자 하는 것은 아니다. 따라서 본 발명의 범 위는 여기에 개시된 실시 예들 이외에도 본 발명의 기술적 사상을 바탕으로 도출되는 모든 변경 또는 변형된 형 태가 본 발명의 범위에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2018-0083064", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시 예에 따른 객실 관리 서비스를 제공하는 시스템을 나타낸 도면이다. 도 2는 본 발명의 실시 예에 따른 객실 관리 서비스를 제공하는 전자장치를 나타낸 도면이다. 도 3은 본 발명의 실시 예에 따른 객실 관리 서비스를 제공하는 방법을 나타낸 흐름도이다. 도 4는 본 발명의 실시 예에 따른 전자장치에서 객실 관리 서비스를 제공하는 방법을 설명하기 위한 순서도이다. 도 5는 본 발명의 실시 예에 따른 전자장치에서 선행동작을 처리하는 방법을 설명하기 위한 상세순서도이다."}
