{"patent_id": "10-2022-0038181", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0139622", "출원번호": "10-2022-0038181", "발명의 명칭": "영상 데이터에 기반하여 사용자를 인증하는 장치 및 방법", "출원인": "엔에이치엔클라우드 주식회사", "발명자": "김종헌"}}
{"patent_id": "10-2022-0038181", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "카메라에 의해 촬영된 영상에 기반하여 사용자를 인증하는 방법에 있어서:상기 영상에서 상기 사용자의 신체 중 적어도 일부에 대응하는 타겟 오브젝트를 감지하는 단계;소정의 커맨드들 중 하나를 출력 인터페이스 장치를 통해 출력하는 단계;상기 타겟 오브젝트의 움직임을 감지하는 단계; 및상기 타겟 오브젝트의 상기 감지된 움직임이 상기 커맨드들 중 상기 하나에 부합하는지 여부에 따라 상기 사용자를 인증하기 위한 인증 신호를 생성하는 단계를 포함하는 방법."}
{"patent_id": "10-2022-0038181", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 인증 신호에 응답하여 데이터 서버로의 액세스를 허용 또는 차단하는 단계를 더 포함하는 방법."}
{"patent_id": "10-2022-0038181", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 타겟 오브젝트를 감지하는 단계는,상기 영상에서 상기 타겟 오브젝트가 정해진 영역에 위치할 것을 요청하는 메시지를 상기 출력 인터페이스 장치를 통해 출력하는 단계; 및상기 영상 내 상기 정해진 영역에서 상기 타겟 오브젝트를 감지하는 단계를 포함하는 방법."}
{"patent_id": "10-2022-0038181", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 영상에 기반하여 라이브니스 검사를 수행하는 단계; 및상기 라이브니스 검사의 결과에 따라 상기 사용자에 대한 인증을 차단하기 위한 인증 차단 신호를 생성하는 단계를 더 포함하는 방법."}
{"patent_id": "10-2022-0038181", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4 항에 있어서,상기 인증 차단 신호에 응답하여 데이터 서버로의 액세스를 차단하는 단계를 더 포함하는 방법."}
{"patent_id": "10-2022-0038181", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서,상기 인증 신호를 생성하는 단계는 다수의 움직임들을 학습한 인공지능 모델을 이용하여 상기 타겟 오브젝트의상기 감지된 움직임을 분석하는 단계를 포함하는 방법."}
{"patent_id": "10-2022-0038181", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "카메라;출력 인터페이스 장치; 및상기 카메라 및 상기 출력 인터페이스 장치에 연결되는 프로세서를 포함하고,공개특허 10-2023-0139622-3-상기 프로세서는,상기 카메라에 의해 촬영된 영상에서 사용자의 신체 중 적어도 일부에 대응하는 타겟 오브젝트를 감지하고;소정의 커맨드들 중 하나를 상기 출력 인터페이스 장치를 통해 출력하고;상기 타겟 오브젝트의 움직임을 감지하고;상기 타겟 오브젝트의 상기 감지된 움직임이 상기 커맨드들 중 상기 하나에 부합하는지 여부에 따라 상기 사용자를 인증하기 위한 인증 신호를 생성하도록 구성되는 컴퓨터 장치."}
{"patent_id": "10-2022-0038181", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "컴퓨터 프로그램을 저장하는, 컴퓨터 장치에 의해 판독 가능한 저장 매체에 있어서:상기 컴퓨터 장치는 카메라, 출력 인터페이스 장치, 및 상기 카메라와 상기 출력 인터페이스 장치에 연결되는프로세서를 포함하고,상기 컴퓨터 프로그램은 상기 프로세서에 의해 실행될 때,상기 카메라에 의해 촬영된 영상에서 사용자의 신체 중 적어도 일부에 대응하는 타겟 오브젝트를 감지하고;소정의 커맨드들 중 하나를 상기 출력 인터페이스 장치를 통해 출력하고;상기 타겟 오브젝트의 움직임을 감지하고;상기 타겟 오브젝트의 상기 감지된 움직임이 상기 커맨드들 중 상기 하나에 부합하는지 여부에 따라 상기 사용자를 인증하기 위한 인증 신호를 생성하는 명령어들을 포함하는 저장 매체."}
{"patent_id": "10-2022-0038181", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서,상기 컴퓨터 프로그램은 상기 프로세서에 의해 실행될 때,상기 인증 신호에 응답하여 데이터 서버로의 액세스를 허용 또는 차단하는 명령어들을 더 포함하는 저장 매체."}
{"patent_id": "10-2022-0038181", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 8 항에 있어서,상기 컴퓨터 프로그램은 상기 프로세서에 의해 실행될 때,상기 영상에 기반하여 라이브니스 검사를 수행하고;상기 라이브니스 검사의 결과에 따라 상기 사용자에 대한 인증을 차단하기 위한 인증 차단 신호를 생성하는 명령어들을 더 포함하는 저장 매체."}
{"patent_id": "10-2022-0038181", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "카메라에 의해 촬영된 영상에 기반하여 사용자를 인증하는 방법은, 영상에서 사용자의 신체 중 적어도 일부에 대 응하는 타겟 오브젝트를 감지하는 단계; 소정의 커맨드들 중 하나를 출력 인터페이스 장치를 통해 출력하는 단계; 타겟 오브젝트의 움직임을 감지하는 단계; 및 타겟 오브젝트의 감지된 움직임이 커맨드들 중 하나에 부합 하는지 여부에 따라 사용자를 인증하기 위한 인증 신호를 생성하는 단계를 포함한다."}
{"patent_id": "10-2022-0038181", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 영상 데이터를 처리하기 위한 장치 및 방법에 관한 것으로, 좀 더 구체적으로는 영상 데이터에 기반 하여 사용자를 인증하는 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2022-0038181", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "사용자 인증 시스템에서 컴퓨터 장치는 사용자로부터 제공되는 인증 데이터에 기반하여 컴퓨터 장치에 대한 액 세스, 컴퓨터 장치의 동작들의 수행 등을 허용할지 결정할 수 있다. 인증 데이터는 다양한 방식들로 제공될 수 있으며, 예를 들면 사용자에 의해 입력되는 패스워드, 생체 정보(biometric information) 등을 포함할 수 있다. 생체 정보는 지문(fingerprint), 홍채(iris), 및 얼굴에 대한 정보를 포함할 수 있다. 컴퓨터 장치가 대체로 이미지 혹은 영상을 촬영할 수 있는 카메라를 포함함에 따라, 사용자의 얼굴을 촬영하여 수행되는 얼굴 인증 방식이 다른 인증 방식들 대비 경제적 이점을 가질 수 있다. 위 기재된 내용은 오직 본 발명의 기술적 사상들에 대한 배경 기술의 이해를 돕기 위한 것이며, 따라서 그것은 본 발명의 기술 분야의 당업자에게 알려진 선행 기술에 해당하는 내용으로 이해될 수 없다."}
{"patent_id": "10-2022-0038181", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "사용자의 얼굴을 촬영하여 수행되는 얼굴 인증 방식에서는 악의적으로 오 인증을 유발하는 스푸핑 공격이 존재 할 수 있으며, 이에 따라 얼굴 인증 방식에서는 이를 방지할 수 있는 수단이 요구된다. 본 발명의 실시 예들에 따른 영상 데이터에 기반하여 사용자를 인증하는 장치 및 방법은 향상된 보안 수준으로 사용자를 인증할 수 있다. 예를 들면, 사용자 인증 장치 및 방법은 의도치 않은 물체가 촬영되게 하여 사용자 인증을 패스하려는 스푸핑 공격을 효과적 및 효율적으로 검출할 수 있다."}
{"patent_id": "10-2022-0038181", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시 예에 따른 카메라에 의해 촬영된 영상에 기반하여 사용자를 인증하는 방법은, 상기 영상에서 상 기 사용자의 신체 중 적어도 일부에 대응하는 타겟 오브젝트를 감지하는 단계; 소정의 커맨드들 중 하나를 출력 인터페이스 장치를 통해 출력하는 단계; 상기 타겟 오브젝트의 움직임을 감지하는 단계; 및 상기 타겟 오브젝트 의 상기 감지된 움직임이 상기 커맨드들 중 상기 하나에 부합하는지 여부에 따라 상기 사용자를 인증하기 위한 인증 신호를 생성하는 단계를 포함한다. 상기 방법은 상기 인증 신호에 응답하여 데이터 서버로의 액세스를 허용 또는 차단하는 단계를 더 포함할 수 있 다. 상기 타겟 오브젝트를 감지하는 단계는, 상기 영상에서 상기 타겟 오브젝트가 정해진 영역에 위치할 것을 요청 하는 메시지를 상기 출력 인터페이스 장치를 통해 출력하는 단계; 및 상기 영상 내 상기 정해진 영역에서 상기 타겟 오브젝트를 감지하는 단계를 포함할 수 있다. 상기 방법은 상기 영상에 기반하여 라이브니스 검사를 수행하는 단계; 및 상기 라이브니스 검사의 결과에 따라 상기 사용자에 대한 인증을 차단하기 위한 인증 차단 신호를 생성하는 단계를 더 포함할 수 있다. 상기 방법은 상기 인증 차단 신호에 응답하여 데이터 서버로의 액세스를 차단하는 단계를 더 포함할 수 있다. 상기 인증 신호를 생성하는 단계는 다수의 움직임들을 학습한 인공지능 모델을 이용하여 상기 타겟 오브젝트의 상기 감지된 움직임을 분석하는 단계를 포함할 수 있다. 본 발명의 다른 일면은 컴퓨터 장치에 관한 것이다. 상기 컴퓨터 장치는 카메라; 출력 인터페이스 장치; 및 상 기 카메라 및 상기 출력 인터페이스 장치에 연결되는 프로세서를 포함하고, 상기 프로세서는, 상기 카메라에 의 해 촬영된 영상에서 사용자의 신체 중 적어도 일부에 대응하는 타겟 오브젝트를 감지하고; 소정의 커맨드들 중 하나를 상기 출력 인터페이스 장치를 통해 출력하고; 상기 타겟 오브젝트의 움직임을 감지하고; 상기 타겟 오브 젝트의 상기 감지된 움직임이 상기 커맨드들 중 상기 하나에 부합하는지 여부에 따라 상기 사용자를 인증하기 위한 인증 신호를 생성하도록 구성된다. 본 발명의 또 다른 일면은 컴퓨터 프로그램을 저장하는, 컴퓨터 장치에 의해 판독 가능한 저장 매체에 관한 것 이다. 상기 컴퓨터 장치는 카메라, 출력 인터페이스 장치, 및 상기 카메라와 상기 출력 인터페이스 장치에 연결 되는 프로세서를 포함하고, 상기 저장 매체는 상기 컴퓨터 프로그램은 상기 프로세서에 의해 실행될 때, 상기 카메라에 의해 촬영된 영상에서 사용자의 신체 중 적어도 일부에 대응하는 타겟 오브젝트를 감지하고; 소정의 커맨드들 중 하나를 상기 출력 인터페이스 장치를 통해 출력하고; 상기 타겟 오브젝트의 움직임을 감지하고; 상 기 타겟 오브젝트의 상기 감지된 움직임이 상기 커맨드들 중 상기 하나에 부합하는지 여부에 따라 상기 사용자 를 인증하기 위한 인증 신호를 생성하는 명령어들을 포함한다. 상기 컴퓨터 프로그램은 상기 프로세서에 의해 실행될 때, 상기 인증 신호에 응답하여 데이터 서버로의 액세스 를 허용 또는 차단하는 명령어들을 더 포함할 수 있다. 상기 컴퓨터 프로그램은 상기 프로세서에 의해 실행될 때, 상기 영상에 기반하여 라이브니스 검사를 수행하고; 상기 라이브니스 검사의 결과에 따라 상기 사용자에 대한 인증을 차단하기 위한 인증 차단 신호를 생성하는 명령어들을 더 포함할 수 있다."}
{"patent_id": "10-2022-0038181", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시 예들에 따르면, 향상된 보안 수준으로 영상 데이터에 기반하여 사용자를 인증할 수 있는 장치 및 방법이 제공된다."}
{"patent_id": "10-2022-0038181", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명에 따른 바람직한 실시 예를 첨부한 도면을 참조하여 상세히 설명한다. 하기의 설명에서는 본 발 명에 따른 동작을 이해하는데 필요한 부분만이 설명되며 그 이외 부분의 설명은 본 발명의 요지를 모호하지 않 도록 하기 위해 생략될 것이라는 것을 유의하여야 한다. 또한 본 발명은 여기에서 설명되는 실시 예에 한정되지"}
{"patent_id": "10-2022-0038181", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "않고 다른 형태로 구체화될 수도 있다. 단지, 여기에서 설명되는 실시 예는 본 발명이 속하는 기술분야에서 통 상의 지식을 가진 자에게 본 발명의 기술적 사상을 용이하게 실시할 수 있을 정도로 상세히 설명하기 위하여 제 공되는 것이다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"간접적으로 연결\"되어 있는 경우도 포함한다. 여기에서 사용된 용 어는 특정한 실시예들을 설명하기 위한 것이며 본 발명을 한정하기 위한 것이 아니다. 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. \"X, Y, 및 Z 중 적어도 어느 하나\", 그리고 \"X, Y, 및 Z로 구성된 그룹으로부터 선택된 적어도 어느 하나\"는 X 하나, Y 하나, Z 하나, 또는 X, Y, 및 Z 중 둘 또는 그 이상의 어떤 조합 (예를 들면, XYZ, XYY, YZ, ZZ) 으로 해석될 수 있다. 여기에서, \"및/또는\"은 해 당 구성들 중 하나 또는 그 이상의 모든 조합을 포함한다. 도 1은 클라이언트 단말기와 그 앞에 위치한 사용자를 보여주는 도면이다. 도 1을 참조하면, 클라이언트 단말기는 사용자 인증을 통해 클라이언트 단말기 혹은 그것과 연결된 데 이터 서버를 이용하고자 하는 사용자를 인증할 수 있다. 예를 들면, 클라이언트 단말기는 카메라(CMR) 를 이용하여 사용자의 얼굴 영상을 획득하고, 획득된 얼굴 영상을 분석하여 클라이언트 단말기의 임의 의 동작을 허용할지 여부를 결정할 수 있다. 실시 예들에서, 영상에서 얼굴에 대응하는 오브젝트가 검출되고,검출된 오브젝트로부터 특징값들이 추출되고, 출된 특징값들은 유효(valid) 사용자에 대한 등록 특징들과 비교 되고, 비교 결과에 따라 사용자 인증의 성공 여부가 결정될 수 있다. 인증의 패스는 실시 예들에 따라 클라이언 트 단말기의 다양한 동작들, 예를 들면 사용자로부터의 요청에 응답하여 수행되는 특정 동작들을 허용 하거나 트리거할 수 있다. 유효 사용자는 자신의 얼굴을 예를 들면 카메라(CMR)로 촬영하는 방법 등을 통해 클라이언트 단말기에 미리 등록할 수 있고, 클라이언트 단말기는 저장 장치 또는 클라우드 저장 매체와 같은 네트워크 데이터베이스에 얼굴과 연관된 정보를 저장할 수 있다. 예를 들면, 유효 사용자의 얼굴 영상으로부터 추출된 특징값들이 유효 사용자의 등록 정보로서 저장될 수 있다. 악의적으로 사용자 인증을 무력화하는 공격이 시도될 수 있다. 예를 들면, 유효 사용자가 아닌 사용자가 전자 기기에 디스플레이된 유효 사용자의 얼굴, 사진 혹은 종이 등에 인쇄된 유효 사용자의 얼굴 등이 카메라(CMR)에 촬영되게 하여 사용자 인증을 시도할 수 있다. 이러한 경우 사용자 인증이 패스된다면 클라이언트 단말기 및/또는 클라이언트 단말기와 연관된 데이터에 대한 보안은 취약해진다. 본 발명의 실시 예에 따른 네트워 크 시스템 및/또는 클라이언트 단말기는 이러한 오 인증을 방지하도록 구성된다. 도 2는 본 발명의 실시 예에 따른 네트워크 시스템을 보여주는 블록도이다. 도 2를 참조하면, 네트워크 시스템은 네트워크, 클라이언트 단말기, 및 데이터 서버를 포 함할 수 있다. 네트워크 시스템은 여기에 설명된 본 발명의 실시 예들에 따른 다양한 방법들을 수행하도록 동작하는 복수 의 장치들, 서버들, 및/또는 소프트웨어 구성들을 포함할 수 있다. 도 2에 도시된 장치들 및/또는 서버들은 다 른 방식들로 구성될 수 있으며, 장치들 및/또는 서버들에 의해 제공되는 동작들 및 서비스들은 여기에 설명된 실시 예들을 위해 결합되거나 분리될 수 있으며, 더 많은 수 혹은 더 적은 수의 장치들 및/또는 서버들에 의해 수행될 수 있다. 하나 또는 그 이상의 장치들 및/또는 서버들은 동일 혹은 상이한 기업체들에 의해 구동 및/또 는 유지될 수 있다. 네트워크는 클라이언트 단말기 및 데이터 서버와 같은 네트워크 시스템 내 구성 요소들을 연결한다. 네트워크는 공용 네트워크(public network), 적어도 하나의 사설 네트워크(private network), 유선 네트워크, 무선 네트워크, 다른 적절한 타입의 네트워크, 및 그것들의 조합들 중 적어도 하나를 포함할 수 있다. 네트워크 시스템 내 구성 요소들 각각은 유선 통신 기능 및 무선 통신 기능 중 적어도 하나를 포함 할 수 있으며, 그에 따라 네트워크를 통해 상호 간 통신할 수 있다. 클라이언트 단말기는 사용자의 제어에 응답하여 네트워크를 통해 데이터 서버에 액세스할 수 있 다. 클라이언트 단말기는 출력 인터페이스 장치, 사용자 입력 장치, 통신기, 카메라(CMR), 및 클라이언트 제어 장치를 포함할 수 있다. 출력 인터페이스 장치는 클라이언트 제어 장치의 제어에 응답하여 사용자가 인지할 수 있는 형태의 정보를 출력하도록 구성된다. 실시 예들에서, 출력 인터페이스 장치는 시각적 정보를 출력하도록 구성되는 디스플레이 장치를 포함할 수 있다. 사용자 입력 장치는 사용자로부터, 예를 들면 클라이언트 제어 장치의 동작들을 제어하기 위한 사용 자 입력들을 수신하고, 수신된 사용자 입력들을 클라이언트 제어 장치에 제공하도록 구성된다. 실시 예들 에서, 사용자 입력 장치는 키 패드, 터치 패드, 마우스 등을 포함할 수 있다. 특히, 터치 패드가 출력 인 터페이스 장치의 디스플레이 장치와 일체로 형성되는 경우, 이를 터치 스크린(touch screen)이라 부를 수 있다. 이러한 경우, 사용자 입력 장치는 디스플레이 장치에 의해 시각화될 수 있다. 통신기는 네트워크에 접속하여 외부의 장치 및/또는 서버, 예를 들면 데이터 서버와 통신을 수 행하도록 구성된다. 통신기는 유선 통신 기능 및/또는 무선 통신 기능을 지원하며, 이들을 통해 네트워크 상 데이터 서버와 통신할 수 있다. 카메라(CMR)는 임의의 적절한 영역을 지향하도록 설치되며, 클라이언트 제어 장치의 제어에 응답하여 지향 영역을 촬영하여 영상(VD)을 제공하도록 구성된다. 사용자는 카메라(CMR)의 지향 영역에 위치하여 카메라(CMR) 에 의해 촬영될 수 있다. 클라이언트 제어 장치는 출력 인터페이스 장치, 사용자 입력 장치, 통신기, 및 카메라 (CMR)를 제어하도록 구성된다. 클라이언트 제어 장치는 메인 컨트롤러 및 사용자 인증기를 포함할 수 있다. 메인 컨트롤러는 다양한 목적들(예를 들면, 재택 근무)을 위한 다양한 동작들을 수행 및/또는 지원할 수 있다. 실시 예들에서, 클라이언트 제어 장치는 데이터 서버에 액세스하기 위한 응용 애플 리케이션으로서 구현될 수 있다. 메인 컨트롤러는 데이터 서버로부터 데이터를 수신하고 수신된 데이 터를 디스플레이 장치 및/또는 음향 장치와 같은 출력 인터페이스 장치를 통해 시각적 및/또는 청각적으로 출력할 수 있다. 메인 컨트롤러는 사용자 입력을 수신하고, 수신된 사용자 입력에 따른 데이터를 통신기 를 통해 데이터 서버로 전송할 수 있다. 이와 같이, 메인 컨트롤러는 데이터 서버와 인터 랙션하여 다양한 동작들을 수행할 수 있다. 메인 컨트롤러의 다양한 동작들 중 적어도 일부의 동작들은 인증 신호(AS)에 따라 허용 및/또는 금지된다. 메인 컨트롤러는 인증 신호(AS)가 생성되는(혹은 인에이블되는) 동안에는 그 동작들을 수행할 수 있다. 메 인 컨트롤러는 인증 신호(AS)가 생성되지 않는(혹은 디스에이블되는) 동안에는 그 동작들의 수행을 금지할 수 있다. 예를 들면, 메인 컨트롤러는 인증 신호(AS)가 생성되는 동안 데이터 서버로부터 데이터를 수신하여 디스플레이하는 동작을 수행할 수 있으며, 인증 신호(AS)가 생성되지 않는 동안에는 데이터 서버(12 0)로부터 데이터를 수신하는 동작을, 사용자의 요청이 수신됨에도 불구하고 수행하지 않을 수 있다. 이와 같이 메인 컨트롤러의 동작들이 인증 신호(AS)에 따라 허용 및/또는 금지되는 것을 고려할 때, 사용자 인증기 가 높은 신뢰성으로 인증을 수행하여 인증 신호(AS)를 제공한다면 클라이언트 단말기 및/또는 데이터 서버와 연관된 데이터 보안은 향상될 수 있다. 사용자 인증기는 카메라(CMR)에 의해 촬영된 영상(VD)에 기반하여 클라이언트 단말기를 사용하고 있 는 사용자를 인증하고, 그에 따라 인증 신호(AS)를 생성하도록 구성된다. 사용자 인증기는 영상(VD)에서 사용자의 신체 중 적어도 일부에 대응하는 타겟 오브젝트를 감지하고, 임의의 커맨드를 출력 인터페이스 장치 를 통해 출력한 후 타겟 오브젝트의 움직임을 감지하고, 감지된 타겟 오브젝트의 움직임이 출력된 커맨드 에 부합하는지 여부를 판별하여 인증 신호(AS)를 생성할 수 있다. 도 3은 도 2의 사용자 인증기의 실시 예를 보여주는 블록도이다. 도 4는 도 3의 사용자 오브젝트 감지부에 의해 디스플레이 장치에 표시되는 그래픽 인터페이스의 일 예를 보여주는 도면이다. 도 5는 도 3의 커맨드 출력부에 의해 디스플레이 장치에 표시되는 그래픽 인터페이스의 일 예를 보여주는 도면이다. 도 6는 도 3의 커맨드 기반 인증부의 실시 예를 보여주는 블록도이다. 도 3을 참조하면, 사용자 인증기는 사용자 오브젝트 감지부, 커맨드 출력부, 오브젝트 기반 인 증부, 커맨드 기반 인증부, 및 인증 신호 생성부를 포함할 수 있다. 사용자 오브젝트 감지부는 카메라(CMR, 도 2 참조)로부터 영상(VD)을 수신하고, 영상(VD)에서 사용자의 신 체 중 적어도 일부에 대응하는 타겟 오브젝트(TOBJ)를 감지하도록 구성된다. 예를 들면, 사용자의 얼굴 부분이 타겟 오브젝트(TOBJ)로서 감지될 수 있다. 도 4를 참조하면, 사용자 오브젝트 감지부는 신체의 일부를 적 절히 움직여 타겟 오브젝트(TOBJ)가 영상(VD)의 정해진 영역(AR)에 위치할 것을 요청하는 메시지를 포함하는 그 래픽 인터페이스(GUI1)를 출력 인터페이스 장치에 디스플레이할 수 있으며, 그에 따라 사용자가 신체의 일 부를 적절히 움직이면 사용자 오브젝트 감지부는 영상(VD)의 정해진 영역(AR)에서 타겟 오브젝트(TOBJ)를 감지할 수 있다. 다시 도 3을 참조하면, 사용자 오브젝트 감지부는 감지된 타겟 오브젝트(TOBJ)를 오브젝 트 기반 인증부 및 커맨드 기반 인증부에 알린다. 사용자 오브젝트 감지부는 타겟 오브젝트(TOBJ)의 감지에 응답하여 인에이블 신호(EN)를 커맨드 출력부 에 제공할 수 있다. 커맨드 출력부는 인에이블 신호(EN)에 응답하여 특정 커맨드를 나타내는 메시지 를 포함하는 그래픽 인터페이스(GUI2)를 출력 인터페이스 장치에 디스플레이할 수 있다. 예를 들면, 도 5 에 도시된 바와 같이 “얼굴을 좌우로 2회 회전하세요”와 같은 메시지가 출력 인터페이스 장치에 디스플 레이될 수 있다. 커맨드는 사용자에게 특정 움직임 혹은 행동을 요청하는 다양한 형태들의 메시지들 및/또는 신 호들 중 어느 하나일 수 있다. 다수의 커맨드들이 클라이언트 단말기의 저장 매체에 저장될 수 있으며, 커 맨드 출력부는 그들 중 어느 하나를 선택하여 해당 메시지를 출력할 수 있다. 오브젝트 기반 인증부는 타겟 오브젝트(TOBJ)가 기준 데이터와 매치되는지 여부에 따라 사용자를 인증할지 여부를 결정하고, 인증 결과를 인증 신호 생성부에 알린다. 실시 예들에서, 오브젝트 기반 인증부는 타겟 오브젝트(TOBJ)로부터 특징값들을 추출하고, 추출된 특징값들을 유효 사용자에 대응하는 등록된 특징값들, 즉 기준 데이터와 비교하고, 비교 결과에 따라 사용자 인증의 패스 혹은 페일을 결정할 수 있다. 유효 사용자는 자신의 얼굴을 촬영하여 클라이언트 단말기에 미리 등록할 수 있고, 오브젝트 기반 인증부는 촬영된 유효 사용자의 얼굴로부터 특징값들을 추출하고 추출된 특징값들을 기준 데이터로서 클라이언트 단말기의저장 매체에 저장해 둘 수 있다. 커맨드 기반 인증부는 타겟 오브젝트(TOBJ)의 움직임을 감지하고, 감지된 움직임이 커맨드 출력부가 제공한 커맨드에 부합하는지 여부에 따라 사용자를 인증할지 여부를 결정하고, 인증 결과를 인증 신호 생성부 에 알린다. 실시 예들에서, 커맨드 기반 인증부는 다양한 종류들의 제스처 인식 알고리즘들 중 적어 도 하나를 이용하여 타겟 오브젝트(TOBJ)의 움직임을 감지하고, 감지된 움직임이 커맨드에 부합하는지 여부를 판별할 수 있다. 실시 예들에서, 커맨드 기반 인증부는 딥러닝에 기반한 인공지능 모델을 이용하여, 타겟 오브젝트(TOBJ)의 움직임을 감지하고 감지된 움직임이 해당 커맨드에 부합하는지 여부를 판별할 수 있다. 도 6 을 참조하면, 커맨드 기반 인증부는 인공지능 모델 및 인공지능 프로세서를 포함할 수 있다. 인 공지능 모델은 움직이는 타겟 오브젝트(TOBJ)를 입력하면 그 움직임(혹은 제스처)의 타입을 나타내는 데이 터(MST)를 출력하도록 사전에 학습될 수 있다. 실시 예들에서, 인공지능 모델은 하나 또는 그 이상의 뉴럴 네트워크들(L1, L2, ... , L_k-1, L_k)을 포함할 수 있으며, 그것들은 움직이는 오브젝트들과 그 움직임 타입들 을 사전에 학습할 수 있다. 예를 들면, 뉴럴 네트워크들(L1, L2, ... , L_k-1, L_k)은 움직이는 타겟 오브젝트 (TOBJ)로부터 특징 정보를 나타내는 벡터를 출력하기 위한 인코더에 해당하는 뉴럴 네트워크들, 그리고 특징 정 보를 나타내는 벡터를 움직임 타입 데이터(MST)로 변환하기 위한 디코더에 해당하는 뉴럴 네트워크들을 포함할 수 있다. 인공지능 프로세서는 인공지능 모델을 제어하도록 구성된다. 인공지능 프로세서는 데이터 학습 부 및 데이터 처리부를 포함할 수 있다. 데이터 학습부는 움직이는 오브젝트들 및 그것들에 대 응하는 움직임 타입들을 포함하는 학습 데이터를 이용하여, 움직이는 오브젝트가 인공지능 모델에 입력되 면 해당 움직임 타입 데이터가 출력되도록 인공지능 모델을 학습시킬 수 있다. 데이터 처리부는 학습 된 인공지능 모델에 움직이는 타겟 오브젝트(TOBJ)를 입력함으로써 움직임 타입 데이터(MST)를 획득할 수 있다. 움직임 타입 데이터(MST)는 판별된 움직임 타입 및 그 가능도(혹은, 확률값)를 포함할 수 있다. 데이터 처리부는 움직임 타입 데이터(MST)가 커맨드 출력부가 제공한 커맨드와 매치되는지 여부에 따라 사용 자 인증의 패스 혹은 페일을 결정할 수 있다. 움직임 타입 데이터(MST)가 커맨드와 매치되는지 여부는 확률적으 로 결정될 수 있으며, 그러한 확률값은 예를 들면 임계치와 비교되어 사용자 인증의 패스 혹은 페일을 결정할 수 있다. 실시 예들에서, 인공지능 모델 및 인공지능 프로세서는 프로세서 및 메모리로 구현될 수 있다. 프로 세서는 싱글 코어, 듀얼 코어, 쿼드 코어 등과 같이 하나 또는 그 이상의 코어들을 포함할 수 있다. 프로세서는 프로그램 및/또는 명령어들을 메모리에 로드하고, 로드된 프로그램 및/또는 명령어들을 실행함으로써 인공지능 모델 및 인공지능 프로세서 각각을 제공할 수 있다. 이와 같이 사용자가 커맨드에 부합하는 움직임을 수행하는지 여부에 기반하여 사용자 인증을 수행함으로써, 전 자 기기에 디스플레이된 사용자의 얼굴, 사진 혹은 종이에 인쇄된 사용자의 얼굴 등 의도치 않은 물체를 카메라 가 촬영하게 하여 오 인증을 시도하는 악의적 공격을 효과적 및 효율적으로 검출할 수 있다. 다시 도 3을 참조하면, 인증 신호 생성부는 오브젝트 기반 인증부 및 커맨드 기반 인증부 의 사 용자 인증 결과들에 기반하여 인증 신호(AS)를 생성하도록 구성된다. 실시 예들에서, 인증 신호 생성부는 오브젝트 기반 인증부 및 커맨드 기반 인증부의 사용자 인증 결과들 모두가 패스될 때 인증 신호(A S)를 생성(혹은 인에이블)할 수 있다. 다른 실시 예들에서, 인증 신호 생성부는 오브젝트 기반 인증부 및 커맨드 기반 인증부의 사용자 인증 결과들 중 하나 또는 그 이상이 패스될 때 인증 신호(AS)를 생성할 수 있다. 실시 예들에서, 사용자 오브젝트 감지부, 커맨드 출력부, 오브젝트 기반 인증부, 커맨드 기반 인증부, 및 인증 신호 생성부 각각은 하드웨어, 소프트웨어, 펌웨어, 및 그들의 조합으로서 구현될 수 있다. 실시 예들에서, 사용자 오브젝트 감지부, 커맨드 출력부, 오브젝트 기반 인증부, 커맨 드 기반 인증부, 및 인증 신호 생성부 중 하나 또는 그 이상은 더 많은 구성 요소들로 분리되거나 통 합될 수 있다. 도 7은 도 2의 사용자 인증기의 다른 실시 예를 보여주는 블록도이다. 도 7을 참조하면, 사용자 인증기는 사용자 오브젝트 감지부, 커맨드 출력부, 오브젝트 기반 인 증부, 커맨드 기반 인증부, 인증 신호 생성부, 및 라이브니스 검사부를 포함할 수 있다. 사용자 오브젝트 감지부, 커맨드 출력부, 오브젝트 기반 인증부, 커맨드 기반 인증부, 및 인증 신호 생성부는 각각 도 3의 사용자 오브젝트 감지부, 커맨드 출력부, 오브젝트 기반 인증 부, 커맨드 기반 인증부, 및 인증 신호 생성부와 마찬가지로 구성될 수 있다. 이하, 중복되는 설명은 생략된다. 인증 신호 생성부는 라이브니스 검사부의 사용자 인증 결과에 응답하여 인증 차단 신호(ABS)를 생성 하도록 구성된다. 라이브니스 검사부는 타겟 오브젝트(TOBJ)에 대해 라이브니스 검사(liveness test)를 수행하고 검사 결과 를 인증 신호 생성부에 알리도록 구성된다. 라이브니스 검사는 타겟 오브젝트(TOBJ)가 살아있는 객체인지 여부를 검사하는 것으로, 카메라(CMR)에 의해 촬영되는 객체의 진위를 판단하기 위한 것이다. 예를 들면, 라이 브니스 검사는 타겟 오브젝트(TOBJ)가 사람의 진짜 얼굴(genuine face)인지 아니면 가짜 얼굴(fake face)인지 여부를 검사한다. 이와 같이, 라이브니스 검사는 살아있지 않은 객체(예를 들면, 위조 수단으로서 사용된 사진, 종이, 동영상 및 모형 등)와 살아있는 객체(예를 들면, 사람의 진짜 얼굴 등)를 구별하는데 이용된다. 실시 예 들에서, 라이브니스 검사부는 다양한 종류들의 라이브니스 검사 알고리즘들을 중 적어도 하나를 이용하여 타겟 오브젝트(TOBJ)에 대해 라이브니스 검사를 수행할 수 있다. 실시 예들에서, 라이브니스 검사부는 오 브젝트를 입력하면 그것이 라이브니스에 해당하는지 여부를 나타내는 출력 데이터를 제공하도록 학습된 인공지 능 모델을 포함하여, 그러한 인공지능 모델을 이용하여 타겟 오브젝트(TOBJ)에 대한 라이브니스 검사를 수행할 수 있다. 실시 예들에서, 라이브니스 검사부는 타겟 오브젝트(TOBJ)에서 일정 시간 동안 눈 깜박임이 탐지 되지 않을 때 사용자 인증이 페일되었음을 인증 신호 생성부에 알릴 수 있다. 이와 같이 타겟 오브젝트(TOBJ)에 대한 라이브니스 검사에 더 기반하여 사용자 인증을 수행함으로써, 의도치 않 은 물체를 카메라로 하여금 촬영하게 하여 오 인증을 시도하는 악의적인 공격을 효과적 및 효율적으로 검출할 수 있다. 도 8은 본 발명의 실시 예에 따른 카메라에 의해 촬영된 영상으로부터 사용자를 인증하는 방법을 보여주는 순서 도이다. 도 1 및 도 8을 참조하면, S110단계에서, 카메라(CMR)에 의해 촬영되는 영상에서 사용자의 신체 중 적어도 일부 에 대응하는 타겟 오브젝트가 감지된다. 예를 들면, 타겟 오브젝트는 사용자의 얼굴에 해당할 수 있다. S120단계에서, 타겟 오브젝트가 소정의 기준 데이터와 매치되는지 여부가 판별된다. 유효 사용자는 사전에 자신 의 얼굴을 카메라(CMR)로 촬영할 수 있으며, 촬영된 얼굴로부터 특징값들이 추출되고 그것들이 기준 데이터로서 저장될 수 있다. 감지된 타겟 오브젝트로부터 특징값들이 추출되며, 추출된 특징값들이 기준 데이터와 비교되어 타겟 오브젝트가 소정의 기준 데이터와 매치되는지 여부를 판별할 수 있다. 예를 들면, S120단계는 도 3을 참조 하여 설명된 오브젝트 기반 인증부의 동작들과 마찬가지로 수행된다. 만약 타겟 오브젝트가 소정의 기준 데이터와 매치된다면 S130단계가 수행된다. S130단계에서, 소정의 커맨드들 중 하나가 클라이언트 단말기의 출력 인터페이스 장치, 예를 들면 디스플레 이 장치를 통해 출력된다. 예를 들면, 도 5에 도시된 바와 같이 “얼굴을 좌우로 2회 회전하세요”와 같은 커맨 드가 출력 인터페이스 장치를 통해 디스플레이될 수 있다. S140단계에서, 커맨드가 출력된 후 타겟 오브젝트의 움직임이 감지된다. S150단계에서, 타겟 오브젝트의 움직임 이 출력된 커맨드에 부합하는지 여부가 판별된다. 예를 들면, S150단계는 도 3을 참조하여 설명된 커맨드 기반 인증부의 동작들과 마찬가지로 수행된다. 만약 타겟 오브젝트의 움직임이 출력된 커맨드에 부합한다면 S160단계가 수행된다. S160단계에서, 사용자를 인증하기 위한 인증 신호가 생성된다. 클라이언트 단말기의 하나 또는 그 이상의 동작들은 인증 신호에 따라 허용 및/또는 금지될 수 있다. 실시 예들에서, S170단계에서, 인증 신호에 응답하여 클라이언트 단말기의 데이터 서버(도 2의 120 참조)로의 액세스가 허용될 수 있다. 예를 들면, 클라이언트 단말기는 사용자로부터 사용자 입력을 수신하고, 사용자 입력에 응답하여 데이터 서버로부터 데이터를 수신하고, 수신된 데이터를 디스플레이할 수 있다. 도 9는 도 6의 S110단계의 실시 예를 보여주는 순서도이다. 도 9를 참조하면, S210단계에서, 영상 내에 정해진 영역(도 4의 AR 참조)을 표시한 후, 타겟 오브젝트가 영상 내 해당 영역에 위치할 것을 요청하는 메시지가 디스플레이 장치를 통해 출력될 수 있다. S220단계에서, 사용자 가 신체의 일부를 적절히 움직인 후, 영상 내 정해진 영역에서 타겟 오브젝트가 감지될 수 있다.도 10은 카메라에 의해 촬영된 영상으로부터 사용자를 인증하는 방법의 또 다른 실시 예를 보여주는 순서도이다. 도 1 및 도 10을 참조하면, S310단계에서, 카메라(CMR)에 의해 촬영된 영상에서 감지되는 타겟 오브젝트에 대해 라이브니스 검사가 수행된다. 라이브니스 검사는 타겟 오브젝트가 살아있는 객체인지 여부를 검사하는 것으로, 다양한 종류들의 라이브니스 검사 알고리즘들을 중 적어도 하나를 이용하여 타겟 오브젝트에 대해 라이브니스 검사가 수행될 수 있다. 실시 예들에서, 타겟 오브젝트는 사용자의 두 눈일 수 있으며, 타겟 오브젝트에서 눈 깜박임이 탐지되는지 여부가 모니터링될 수 있다. S320단계에서, 라이브니스 검사 결과 타겟 오브젝트가 위조에 해당하는지 여부에 따라 S330단계 및 S350단계 중 어느 하나가 수행될 수 있다. S330단계에서, 라이브니스 검사 결과 타겟 오브젝트가 위조에 해당할 때 인증 차단 신호가 생성된다. 클라이언 트 단말기의 동작들은 인증 차단 신호에 응답하여 금지될 수 있다. 실시 예들에서, S340단계에서, 인증 차 단 신호에 응답하여 클라이언트 단말기의 데이터 서버(도 2의 120 참조)로의 액세스는 금지될 수 있다. S350단계에서, 인증 신호가 생성된다(혹은 계속 유지된다). 클라이언트 단말기의 동작들은 인증 신호에 따 라 허용될 수 있다. 실시 예들에서, S360단계에서, 인증 신호에 응답하여 클라이언트 단말기의 데이터 서버 로의 액세스가 허용될 수 있다. 도 10의 S310단계 내지 S360단계는 도 8을 참조하여 설명된 인증 신호가 생성된 후, 예를 들면 정기적 및 반복적으로 수행될 수 있다. 도 11은 도 2의 클라이언트 단말기를 구현하기에 적합한 컴퓨터 장치의 실시 예를 보여주는 블록도이다. 도 11을 참조하면, 컴퓨터 장치는 카메라(CMR), 디스플레이 장치, 사용자 입력 장치, 통신기 , 불휘발성 저장 매체, 프로세서, 및 시스템 메모리를 포함할 수 있다. 카메라(CMR)는 프로세서의 제어에 응답하여 지향하는 영역을 촬영하여 영상을 생성하며, 생성된 영상을 프로세서에 제공할 수 있다. 카메라(CMR)는 도 2의 카메라(CMR)로서 제공될 수 있다. 디스플레이 장치는 프로세서에 의해 처리되는 정보를 디스플레이한다. 실시 예들에서, 디스플레이 장치는 액정 디스플레이(liquid crystal display), 유기 발광 다이오드(organic light-emitting diode) 디스플레이, 플렉서블 디스플레이(flexible display), 등 중 적어도 하나를 포함할 수 있다. 사용자 입력 장치 는 컴퓨터 장치의 동작을 제어하기 위한 사용자 입력을 수신한다. 사용자 입력 장치는 키 패 드, 돔 스위치, 터치 패드(정압/정전), 조그 휠, 조그 스위치, 핑거 마우스 등을 포함할 수 있다. 특히, 터치 패드가 디스플레이 장치와 일체로 형성되는 경우, 이를 터치 스크린이라 부를 수 있다. 이러한 경우, 사 용자 입력 장치는 디스플레이 장치에 의해 시각화될 수 있다. 통신기는 프로세서의 제 어에 응답하여 유선 및/또는 무선 통신을 통해 네트워크(105, 도 2 참조)에 접속하도록 구성된다. 디스플레이 장치, 사용자 입력 장치, 및 통신기는 각각 도 2의 출력 인터페이스 장치, 사용자 입력 장치, 및 통신기로서 제공될 수 있다. 불휘발성 저장 매체는 플래시 메모리(flash memory type), 하드 디스크 (hard disk type), 멀티미디어 카드(multimedia card) 등 전원이 차단되더라도 저장된 데이터를 유지하는 저장 매체들 중 적어도 하나를 포함 할 수 있다. 불휘발성 저장 매체는 프로세서의 제어에 응답하여 데이터를 기입하고 독출하도록 구 성된다. 프로세서는 카메라(CMR), 디스플레이 장치, 사용자 입력 장치, 통신기, 불휘발성 저장 매체, 및 시스템 메모리의 동작들을 제어한다. 프로세서는 복수의 처리 유닛들(혹은 복수의 코어들)을 포함하여 연산, 비교 등의 다양한 처리들을 수행할 수 있다. 예를 들면, 프로세서는 중앙 처리 장치(central processing unit)를 포함할 수 있다. 예를 들면, 프로세서는 그래픽 처리 장치(graphic processing unit)를 더 포함할 수 있다. 프로세서는 프로그램 코드들 및/또는 명령어들을 시스템 메모리에 로딩하고, 로딩된 프로그램 코드 들 및/또는 명령어들을 실행함으로써 도 2의 클라이언트 제어 장치의 동작들을 수행할 수 있다. 프로세서 는 클라이언트 제어 모듈을 시스템 메모리에 로딩하고, 로딩된 클라이언트 제어 모듈 을 실행함으로써 도 2의 클라이언트 제어 장치의 동작들을 수행할 수 있다. 예를 들면, 프로세서는 임의의 클라이언트 서버로부터 설치 파일을 다운로드하고, 다운로드된 설치 파일을 설치하여 클라이언트 제어 모듈을 획득할 수 있다.또한, 프로세서는 운영 체제를 시스템 메모리에 로딩하고, 로딩된 운영 체제를 실행하 여 컴퓨터 장치의 제반 동작들을 제어할 수 있다. 운영 체제는 카메라(CMR), 디스플레이 장치 , 사용자 입력 장치, 통신기, 불휘발성 저장 매체, 및 시스템 메모리에 대한 인터페이스를 운영 체제 하에서 동작하는 응용 프로그램들, 예를 들면 클라이언트 제어 모듈에 제 공할 수 있다. 이와 같이, 운영 체제는 클라이언트 제어 모듈이 컴퓨터 장치의 하드웨어 장 치들을 사용할 수 있도록 하는 환경을 제공한다. 시스템 메모리는 램(Random Access Memory, RAM), 롬(Read Only Memory, ROM), 및 다른 타입들의 컴퓨터 에 의해 판독 가능한 저장 매체들 중 적어도 하나를 포함할 수 있다. 도 11에서, 시스템 메모리는 프로세 서와 분리된 구성 요소로서 도시되어 있으나, 이는 예시적인 것으로 시스템 메모리의 적어도 일부 는 프로세서 내에 포함될 수 있다. 시스템 메모리는 필요에 따라 복수의 구성 요소들로 분리될 수 있다. 도 12는 도 11의 클라이언트 제어 모듈 혹은 그것의 설치 파일을 제공하는 클라이언트 서버의 실시 예를 보여주 는 블록도이다. 도 12를 참조하면, 클라이언트 서버는 도 11의 컴퓨터 장치와 네트워크(105, 도 11 참조)를 통해 연결될 수 있다. 컴퓨터 장치에 의해 실행되는 컴퓨터 프로그램은 클라이언트 서버로부터 제공될 수 있다. 도 12를 참조하면, 클라이언트 서버는 통신기, 프로세서, 및 데이터베이스를 포함할 수 있다. 통신기는 네트워크를 통해 컴퓨터 장치와 통신할 수 있다. 데이터베이스 는 컴퓨터 장치에 의해 실행될 수 있는 컴퓨터 프로그램, 예를 들면 도 11의 클라이언트 제어 모듈 혹은 해당 프로그램 코드들 및/또는 명령어들을 포함하는 설치 파일을 저장하도록 구성되는 저장 매체를 포함할 수 있다. 데이터베이스는 플래시 메모리, 하드 디스크, 멀티미디어 카드 등과 같은 불휘발성 저장 매체들 중 적어도 하나로 구현될 수 있다. 프로세서는 컴퓨터 장치로부터의 요청에 응답하여, 데이터베이스에 저장된 컴퓨터 프로그램 을 통신기를 통해 컴퓨터 장치에 제공할 수 있다. 컴퓨터 프로그램은 컴퓨터 장치에 설치되 어 실행될 수 있다. 비록 특정 실시 예들 및 적용 례들이 여기에 설명되었으나, 이는 본 발명의 보다 전반적인 이해를 돕기 위해서 제공된 것일 뿐, 본 발명은 상기의 실시예에 한정되는 것은 아니며 본 발명이 속하는 분야에서 통상적인 지식을 가진 자라면 이러한 기재로부터 다양한 수정들 및 변형들이 가능하다. 따라서, 본 발명의 사상은 설명된 실시예에 국한되어 정해져서는 아니되며, 후술하는 특허청구범위뿐 아니라 이 특허청구범위와 균등하거나 등가적 변형이 있는 모든 것들은 본 발명 사상의 범주에 속한다고 할 것이다."}
{"patent_id": "10-2022-0038181", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 클라이언트 단말기와 그 앞에 위치한 사용자를 보여주는 도면이다. 도 2는 본 발명의 실시 예에 따른 네트워크 시스템을 보여주는 블록도이다. 도 3은 도 2의 사용자 인증기의 실시 예를 보여주는 블록도이다. 도 4는 도 3의 사용자 오브젝트 감지부에 의해 디스플레이 장치에 표시되는 그래픽 인터페이스의 일 예를 보여 주는 도면이다. 도 5는 도 3의 커맨드 출력부에 의해 디스플레이 장치에 표시되는 그래픽 인터페이스의 일 예를 보여주는 도면 이다. 도 6는 도 3의 커맨드 기반 인증부의 실시 예를 보여주는 블록도이다. 도 7은 도 2의 사용자 인증기의 다른 실시 예를 보여주는 블록도이다. 도 8은 본 발명의 실시 예에 따른 카메라에 의해 촬영된 영상으로부터 사용자를 인증하는 방법을 보여주는 순서 도이다. 도 9는 도 6의 S110단계의 실시 예를 보여주는 순서도이다. 도 10은 카메라에 의해 촬영된 영상으로부터 사용자를 인증하는 방법의 다른 실시 예를 보여주는 순서도이다. 도 11은 도 2의 클라이언트 단말기를 구현하기에 적합한 컴퓨터 장치의 실시 예를 보여주는 블록도이다. 도 12는 도 11의 클라이언트 제어 모듈 혹은 그것의 설치 파일을 제공하는 클라이언트 서버의 실시 예를 보여주 는 블록도이다."}
