{"patent_id": "10-2021-0077788", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0168594", "출원번호": "10-2021-0077788", "발명의 명칭": "초음파를 이용하는 식품 건조 방법 및 장치", "출원인": "주식회사 버니로지스틱스", "발명자": "김규한"}}
{"patent_id": "10-2021-0077788", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "액상의 향신료를 에어로졸 상태로 변환하여 분무하는 초음파 모듈;상기 에어로졸을 건조 대상에 분사하는 분사 샤프트(shaft);상기 건조 대상의 건조를 위해 식품 건조기의 내부 공기를 순환시키는 송풍 팬;상기 송풍 팬과 함께 또는 독립적으로 상기 건조 대상의 건조를 위해 작동하는 히터; 및미리 프로그램된 복수의 작동 모드에 따라 상기 초음파 모듈, 분사 샤프트, 송풍 팬 및 히터 중에서 적어도 하나의 동작을 제어하는 제어기를 포함하도록 구성되는,식품 건조 장치."}
{"patent_id": "10-2021-0077788", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,공기 흡입구 및 이에 설치된 입구 에어 필터(inlet air filter)를 더 포함하도록 구성되는,식품 건조 장치."}
{"patent_id": "10-2021-0077788", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,공기 배출구 및 상기 향신료의 향을 제거하기 위해 상기 공기 배출구에 설치된 탈취 필터(deodorizationfilter)를 더 포함하도록 구성되는,식품 건조 장치."}
{"patent_id": "10-2021-0077788", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서,내기(內氣)에 포함된 습도를 측정하는 습도계를 더 포함하고,상기 제어기는,개폐 제어 가능한 공기 배출구가 닫혀진 상태에서, 상기 히터, 송풍 팬 및 습도계의 작동 제어를 통해 건조 대상 식품이 함유하는 수분 함량을 측정하도록 구성되는,식품 건조 장치."}
{"patent_id": "10-2021-0077788", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 4에 있어서,상기 제어기는,건조 대상 식품의 종류 및 상기 수분 함량에 따라 식품 착향 모드에 앞서 식품 건조 모드가 동작되게 상기히터, 송풍 팬 및 초음파 모듈의 작동을 제어하도록 구성되는,식품 건조 장치."}
{"patent_id": "10-2021-0077788", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 1에 있어서,공개특허 10-2022-0168594-3-상기 제어기는,개폐 제어 가능한 공기 배출구가 닫혀진 상태에서 식품 착향을 위해 향신료를 분사하는 모드 및 열을 이용하여식품에 향을 고착화하는 모드에서 상기 초음파 모듈 및 히터의 작동을 제어하도록 구성되는,식품 건조 장치."}
{"patent_id": "10-2021-0077788", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 1에 있어서,내기 온도를 측정하는 온도계 및 내기 습도를 측정하는 습도계를 더 포함하고,상기 제어기는,건조 대상 식품의 종류에 따라 상기 초음파 모듈에 의한 향신료의 분무량을 제어하고 내기 습도 값에 따라 상기히터의 동작에 따른 건조 온도를 제어하도록 구성되는,식품 건조 장치."}
{"patent_id": "10-2021-0077788", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 1에 있어서,건조 대상 식품을 수납하는 복수 층의 선반; 및상기 선반에 슬라이딩 가능한 곡물 수납 용도의 트레이를 더 포함하도록 구성되는,식품 건조 장치."}
{"patent_id": "10-2021-0077788", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 8에 있어서,상기 곡물 수납 용도의 트레이는,수납된 곡물에 에어로졸 형태로 분사되는 향신료의 침투가 용이하게 메쉬 면을 포함하도록 구성되는,식품 건조 장치."}
{"patent_id": "10-2021-0077788", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 1에 있어서,상기 분사 샤프트는,건조 대상 식품이 보관되는 선반의 중심에 배치된 홀을 통해 상기 선반과 체결되고, 분리가 가능하도록 구성되는,식품 건조 장치."}
{"patent_id": "10-2021-0077788", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 1에 있어서,상기 건조 대상 식품의 살균에 필요한 UVC를 방출하는 UV LED 및 식품에 비타민D 성분 생성에 필요한 UVB를 방출하는 UV LED로 구성된 LED 모듈을 더 포함하고,상기 제어기는,건조 대상 식품의 종류에 따라 살균과 비타민D 생성에 필요한 광을 생성하게 상기 LED 모듈을 제어하도록 구성되는,식품 건조 장치."}
{"patent_id": "10-2021-0077788", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "공개특허 10-2022-0168594-4-내기 순환 모드에서 히터, 송풍 팬 및 습도계를 이용하여 건조 대상 식품의 수분 함량을 측정하는 단계;상기 수분 함량에 따라 초기 건조 모드의 작동 타이밍을 제어하는 단계;내기 순환의 착향 모드에서 향신료를 에어로졸 형태로 분사하는 초음파 모듈 및 히터의 작동을 제어하는 단계;및외기 순환의 건조 모드에서 상기 히터 및 송풍 팬의 작동을 제어하는 단계를 포함하되,상기 외기 순환의 건조 모드에서 배출구에 설치된 탈취 필터를 통해 공기가 외부로 배출되는 단계를 더 포함하도록 구성되는,식품 건조 방법."}
{"patent_id": "10-2021-0077788", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 12에 있어서,LED 모듈에 의해 생성된 자외선을 이용하여 건조 대상 식품을 살균하는 단계를 더 포함하도록 구성되는,식품 건조 방법."}
{"patent_id": "10-2021-0077788", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 12에 있어서,자연건조 모드에서 LED 모듈에 의해 생성된 가시광선을 이용하여 건조 대상 식품에 비티임 D를 생성시키는 단계를 더 포함하도록 구성되는,식품 건조 방법."}
{"patent_id": "10-2021-0077788", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은, 액상의 향신료를 에어로졸 상태로 변환하여 분무하는 초음파 모듈, 에어로졸을 건조 대상에 분사하는 분사 샤프트, 건조 대상의 건조를 위해 식품 건조기의 내부 공기를 순환시키는 송풍 팬, 송풍 팬과 함께 또는 독 립적으로 상기 건조 대상의 건조를 위해 작동하는 히터 및 미리 프로그램된 복수의 작동 모드에 따라 상기 초음 파 모듈, 분사 샤프트, 송풍 팬 및 히터 중에서 적어도 하나의 동작을 제어하는 제어기를 포함하는 식품 건조 장 치를 개시한다. 본 발명에 따르면, 종래 기술의 식품 건조 장치에 초음파를 이용한 향신료 분사 기술이 융합될 수 있다."}
{"patent_id": "10-2021-0077788", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 초음파를 이용하는 식품 건조 방법 및 장치에 관한 것으로, 더욱 상세하게는 초음파를 이용하여 건조 대상 식품에 향신료의 향과 맛을 가미할 수 있는 식품 건조 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2021-0077788", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "건조(乾燥)란 열, 공기유동, 감압, 및 진동 등을 이용하여 물체 중에 함유된 수분이나 솔벤트 등과 같은 유기용 제를 제거하는 것을 의미한다. 이에 건조 장치란, 인공적으로 에너지를 다량 사용하여 물체(재료)가 함유하고 있는 수분을 제거하는 장치를 총칭하는 것이며, 건조대상으로 되는 재료를 일반적으로 피건조물이라 칭한다. 건조 장치는 최종 소비재의 재료가 되는 피건조물을 건조시킴으로써 피건조물의 건조 결과가 완제품 제조에 적 합하도록 당초 목적으로 하는 상태로의 품질 유지가 관건이다. 피건조물 역시 그 종류가 섬유, 화공, 식품, 폐 기물 등 다종다양하다. 따라서 건조 장치는 피건조물이 요구하는 특성에 적합하도록 설계 및 제작이 이루어져 하므로 건조 장치의 종류 역시 매우 다양하다. 이러한 다종다양한 건조 장치를 설계, 제작하는데 있어서, 피건 조물의 특성이 충분히 감안되어야 하며, 건조기의 특성상 에너지를 다량 사용하는 기기이므로 에너지 절약화, 자동화, 환경친화성, 장치 및 용량의 크기 등이 충분히 고려되어야 한다. 한편 최근의 산업용 식품 건조기를 포함하여 가정용 식품 건조기는, 식품을 오래 보관하기 위한 목적 외에도, 술안주 및 간식, 특히 웰빙 트렌드에 맞는 저칼로리 고단백의 건강식을 제조하는 목적으로 사용되는 경우가 많 다. 식재료를 이용하여 요리를 하는 경우, 소금을 이용하여 간을 맞추거나, 조미료 및 향신료를 이용하여 향미를 내 야하는 경우가 있는데, 종래 기술에 따른 식품 건조기는 건조 식품의 수분만 제거하기 때문에 건조 대상 식품에 대해 간을 맞추거나 향미를 내게 하는 기능을 포함하고 있지 않아서, 많은 사용자로부터 건조 식품의 2차 가공 에 관한 니즈가 요청되어 왔다. 본 발명과 관련된 기술로서, 대한민국 등록 특허 공보에는 건조기본체, 건조트레이, 및 커버를 포함하는 식품 건조기가 개시된다. 이 관련 기술은, 건조트레이의 내측을 구획 분리하는 분리판을 갖는 망체를 이용하여 건조트레이의 공간을 분할하는 것을 특징으로 하고 있으며, 초음파 모듈을 포함는 점에서, 건조 대상 식품의 종류 및 수분 함량에 따라 서로 다른 모드를 이용하여 건조 대상 식품에 향미를 가미하는 본 발명의 구성 및 이로 인 한 효과와 구별된다. 선행기술문헌 특허문헌 (특허문헌 0001) KR 등록 특허 제10-1608707호 (2016.04.04 공고)"}
{"patent_id": "10-2021-0077788", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 일 과제는, 기존 식품 건조 장치에 초음파를 이용한 향신료 분사 기술을 융합하는 것이다. 본 발명이 해결하고자는 일 과제는, 향신료의 맛과 향을 원물 건조 단계에서 원물에 적용할 수 있게 하는 식품 건조 방법 및 장치를 제공하는 것이다. 본 발명이 해결하고자 하는 일 과제는, 에어 필터 및 탈취 필터를 이용하여 외기 및 내기 순환 모드를 통해 건 조 대상 식품에 향미를 추가할 수 있는 원물 가공 방법 및 장치를 제공하는 것이다."}
{"patent_id": "10-2021-0077788", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시 예에 따른 초음파를 이용하는 식품 건조 장치는, 액상의 향신료를 에어로졸 상태로 변환하여 분무하는 초음파 모듈; 에어로졸을 건조 대상에 분사하는 분사 샤프트(shaft); 건조 대상의 건조를 위해 식품 건조기의 내부 공기를 순환시키는 송풍 팬; 송풍 팬과 함께 또는 독립적으로 상기 건조 대상의 건조를 위해 작 동하는 히터; 및 미리 프로그램된 복수의 작동 모드에 따라 상기 초음파 모듈, 분사 샤프트, 송풍 팬 및 히터 중에서 적어도 하나의 동작을 제어하는 제어기를 포함하도록 구성될 수 있다. 또한, 초음파를 이용하는 식품 건조 장치는, 공기 흡입구 및 이에 설치된 입구 에어 필터(inlet air filter)를 더 포함하도록 구성될 수 있다. 또한, 초음파를 이용하는 식품 건조 장치는, 공기 배출구 및 향신료의 향을 제거하기 위해 공기 배출구에 설치 된 탈취 필터(deodorization filter)를 더 포함하도록 구성될 수 있다. 또한, 초음파를 이용하는 식품 건조 장치는, 내기(內氣)에 포함된 습도를 측정하는 습도계를 더 포함하도록 구 성될 수 있다. 그리고 제어기는, 개폐 제어 가능한 공기 배출구가 닫혀진 상태에서, 상기 히터, 송풍 팬 및 습 도계의 작동 제어를 통해 건조 대상 식품이 함유하는 수분 함량을 측정하도록 구성될 수 있다. 또한, 제어기는, 건조 대상 식품의 종류 및 상기 수분 함량에 따라 식품 착향 모드에 앞서 식품 건조 모드가 동 작되게 상기 히터, 송풍 팬 및 초음파 모듈의 작동을 제어하도록 구성될 수 있다. 또한, 제어기는, 개폐 제어 가능한 공기 배출구가 닫혀진 상태에서 식품 착향을 위해 향신료를 분사하는 모드 및 열을 이용하여 식품에 향을 고착화하는 모드에서 상기 초음파 모듈 및 히터의 작동을 제어하도록 구성될 수 있다. 또한, 초음파를 이용하는 식품 건조 장치는, 내기 온도를 측정하는 온도계 및 내기 습도를 측정하는 습도계를 더 포함할 수 있다. 그리고 제어기는, 건조 대상 식품의 종류에 따라 상기 초음파 모듈에 의한 향신료의 분무량 을 제어하고 내기 습도 값에 따라 상기 히터의 동작에 따른 건조 온도를 제어하도록 구성될 수 있다. 또한, 초음파를 이용하는 식품 건조 장치는, 건조 대상 식품을 수납하는 복수 층의 선반; 및 선반에 슬라이딩 가능한 곡물 수납 용도의 트레이를 더 포함하도록 구성될 수 있다. 또한, 곡물 수납 용도의 트레이는, 수납된 곡물에 에어로졸 형태로 분사되는 향신료의 침투가 용이하게 메쉬 면 을 포함하도록 구성될 수 있다. 또한, 분사 샤프트는, 건조 대상 식품이 보관되는 선반의 중심에 배치된 홀을 통해 상기 선반과 체결되고, 분리 가 가능하도록 구성될 수 있다. 또한, 초음파 기반의 식품 건조 장치는, 건조 대상 식품의 살균에 필요한 적외선을 방출하는 UV LED 및 식품에 비타민D 성분 생성에 필요한 가시광선을 방출하는 White LED로 구성된 LED 모듈을 더 포함하고, 제어기는, 건조 대상 식품의 종류에 따라 살균과 비타민D 생성에 필요한 광을 생성하게 상기 LED 모듈을 제어하도록 구성될 수 있다. 본 발명의 일 실시 예에 따른 초음파를 이용하는 식품 건조 방법은, 내기 순환 모드에서 히터, 송풍 팬 및 습도 계를 이용하여 건조 대상 식품의 수분 함량을 측정하는 단계; 수분 함량에 따라 초기 건조 모드의 작동 타이밍 을 제어하는 단계; 내기 순환의 착향 모드에서 향신료를 에어로졸 형태로 분사하는 초음파 모듈 및 히터의 작동 을 제어하는 단계; 및 외기 순환의 건조 모드에서 상기 히터 및 송풍 팬의 작동을 제어하는 단계를 포함하되, 외기 순환의 건조 모드에서 배출구에 설치된 탈취 필터를 통해 공기가 외부로 배출되는 단계를 더 포함하도록 구성될 수 있다. 또한, 초음파를 이용하는 식품 건조 방법은, LED 모듈에 의해 생성된 자외선을 이용하여 건조 대상 식품을 살균 하는 단계를 더 포함하도록 구성될 수 있다. 또한, 초음파를 이용하는 식품 건조 방법은, 자연건조 모드에서 LED 모듈에 의해 생성된 가시광선을 이용하여 건조 대상 식품에 비타민 D를 생성시키는 단계를 더 포함하도록 구성될 수 있다. 기타 실시 예의 구체적인 사항은 \""}
{"patent_id": "10-2021-0077788", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하면, 종래 기술의 식품 건조 장치에 초음파를 이용한 향신료 분사 기술이 융합될 수 있다. 또한, 향신료의 향과 맛이 원물 건조 단계에서 원물에 적용할 수 있다. 또한, 에어 필터 및 탈취 필터를 이용하여 외기 및 내기 순환 모드를 통해 건조 대상 식품에 향과 맛이 추가될 수 있다."}
{"patent_id": "10-2021-0077788", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "\" 및 첨부 \"도면\"에 포함되어 있다. 본 발명의 이점 및/또는 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 각종 실시 예를 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 각 실시 예의 구성만으로 한정되는 것이 아니라 서로 다른 다양한 형태로 도 구현될 수도 있으며, 단지 본 명세서에서 개시한 각각의 실시 예는 본 발명의 개시가 완전하도록 하며, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 본 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구범위의 각 청구항의 범주에 의해 정의될 뿐임을 알아야 한다."}
{"patent_id": "10-2021-0077788", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "발명의 효과 본 발명에 의하면, 종래 기술의 식품 건조 장치에 초음파를 이용한 향신료 분사 기술이 융합될 수 있다. 또한, 향신료의 향과 맛이 원물 건조 단계에서 원물에 적용할 수 있다. 또한, 에어 필터 및 탈취 필터를 이용하여 외기 및 내기 순환 모드를 통해 건조 대상 식품에 향과 맛이 추가될 수 있다."}
{"patent_id": "10-2021-0077788", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "도면의 간단한 설명 도 1은 종래 기술과 구별되는 본 발명의 일 실시 예에 따른 초음파를 이용하는 식품 건조 장치의 특징을 나타내 는 예시도이다. 도 2는 본 발명의 일 실시 예에 따른 초음파를 이용하는 식품 건조 장치의 예시도이다. 도 3은 도 2에 묘사된 식품 건조 장치의 내부 예시도이다. 도 4는 도 2에 묘사된 식품 건조 장치의 단면을 나타내는 예시도이다. 도 5는 도 3에 묘사된 식품 건조 장치의 분리되어 묘사된 구성요소의 예시도이다. 도 6은 본 발명의 일 실시 예에 따른 초음파를 이용하는 식품 건조 장치의 제어부의 블록도이다. 도 7은 도 4에 묘사된 식품 건조 장치에서 공기 순환을 나타내는 예시도이다. 도 8은 도 4에 묘사된 식품 건조 장치에서 향신료 에어로졸 분사의 예시도이다. 도 9는 본 발명의 일 실시 예에 따른 초음파를 이용하는 식품 건조 방법의 흐름도이다.도 10은 본 발명의 일 실시 예에 따른 초음파 기반의 식품 건조 장치의 효과에 관한 예시도이다."}
{"patent_id": "10-2021-0077788", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "발명을 실시하기 위한 구체적인 내용 본 발명을 상세하게 설명하기 전에, 본 명세서에서 사용된 용어나 단어는 통상적이거나 사전적인 의미로 무조건 한정하여 해석되어서는 아니 되며, 본 발명의 발명자가 자신의 발명을 가장 최선의 방법으로 설명하기 위해서 각종 용어의 개념을 적절하게 정의하여 사용할 수 있고, 더 나아가 이들 용어나 단어는 본 발명의 기술적 사상 에 부합하는 의미와 개념으로 해석되어야 함을 알아야 한다. 즉, 본 명세서에서 사용된 용어는 본 발명의 바람직한 실시 예를 설명하기 위해서 사용되는 것일 뿐이고, 본 발 명의 내용을 구체적으로 한정하려는 의도로 사용된 것이 아니며, 이들 용어는 본 발명의 여러 가지 가능성을 고 려하여 정의된 용어임을 알아야 한다. 또한, 본 명세서에서, 단수의 표현은 문맥상 명확하게 다른 의미로 지시하지 않는 이상, 복수의 표현을 포함할 수 있으며, 유사하게 복수로 표현되어 있다고 하더라도 단수의 의미를 포함할 수 있음을 알아야 한다. 본 명세서의 전체에 걸쳐서 어떤 구성 요소가 다른 구성 요소를 \"포함\"한다고 기재하는 경우에는, 특별히 반대 되는 의미의 기재가 없는 한 임의의 다른 구성 요소를 제외하는 것이 아니라 임의의 다른 구성 요소를 더 포함 할 수도 있다는 것을 의미할 수 있다. 더 나아가서, 어떤 구성 요소가 다른 구성 요소의 \"내부에 존재하거나, 연결되어 설치된다\"라고 기재한 경우에 는, 이 구성 요소가 다른 구성 요소와 직접적으로 연결되어 있거나 접촉하여 설치되어 있을 수 있고, 일정한 거 리를 두고 이격되어 설치되어 있을 수도 있으며, 일정한 거리를 두고 이격되어 설치되어 있는 경우에 대해서는 해당 구성 요소를 다른 구성 요소에 고정 내지 연결하기 위한 제 3의 구성 요소 또는 수단이 존재할 수 있으며, 이 제 3의 구성 요소 또는 수단에 대한 설명은 생략될 수도 있음을 알아야 한다. 반면에, 어떤 구성 요소가 다른 구성 요소에 \"직접 연결\"되어 있다거나, 또는 \"직접 접속\"되어 있다고 기재되는 경우에는, 제 3의 구성 요소 또는 수단이 존재하지 않는 것으로 이해하여야 한다. 마찬가지로, 각 구성 요소 간의 관계를 설명하는 다른 표현들, 즉 \" ~ 사이에\"와 \"바로 ~ 사이에\", 또는 \" ~ 에 이웃하는\"과 \" ~ 에 직접 이웃하는\" 등도 마찬가지의 취지를 가지고 있는 것으로 해석되어야 한다. 또한, 본 명세서에서 \"일면\", \"타면\", \"일측\", \"타측\", \"제 1\", \"제 2\" 등의 용어는, 사용된다면, 하나의 구성 요소에 대해서 이 하나의 구성 요소가 다른 구성 요소로부터 명확하게 구별될 수 있도록 하기 위해서 사용되며, 이와 같은 용어에 의해서 해당 구성 요소의 의미가 제한적으로 사용되는 것은 아님을 알아야 한다. 또한, 본 명세서에서 \"상\", \"하\", \"좌\", \"우\" 등의 위치와 관련된 용어는, 사용된다면, 해당 구성 요소에 대해 서 해당 도면에서의 상대적인 위치를 나타내고 있는 것으로 이해하여야 하며, 이들의 위치에 대해서 절대적인 위치를 특정하지 않는 이상은, 이들 위치 관련 용어가 절대적인 위치를 언급하고 있는 것으로 이해하여서는 아 니된다. 또한, 본 명세서에서는 각 도면의 각 구성 요소에 대해서 그 도면 부호를 명기함에 있어서, 동일한 구성 요소에 대해서는 이 구성 요소가 비록 다른 도면에 표시되더라도 동일한 도면 부호를 가지고 있도록, 즉 명세서 전체에 걸쳐 동일한 참조 부호는 동일한 구성 요소를 지시하고 있다. 본 명세서에 첨부된 도면에서 본 발명을 구성하는 각 구성 요소의 크기, 위치, 결합 관계 등은 본 발명의 사상 을 충분히 명확하게 전달할 수 있도록 하기 위해서 또는 설명의 편의를 위해서 일부 과장 또는 축소되거나 생략 되어 기술되어 있을 수 있고, 따라서 그 비례나 축척은 엄밀하지 않을 수 있다. 또한, 이하에서, 본 발명을 설명함에 있어서, 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 구성, 예 를 들어, 종래 기술을 포함하는 공지 기술에 대해 상세한 설명은 생략될 수도 있다. 이하, 본 발명의 실시 예에 대해 관련 도면들을 참조하여 상세히 설명하기로 한다. 도 1은 종래 기술과 구별되는 본 발명의 일 실시 예에 따른 초음파 기반의 식품 건조 장치의 특징을 나타내는 예시도이다. 도 1을 참조하면, 기존의 식품 건조기와 비교하여, 본 발명의 일 실시 예에 따른 식품 건조 장치는, 미세 먼지 및 황사로 인한 식재료의 오염을 방지하고, 매연, 오염 공기로부터 식재료를 보호하고, 공팡이 및 유해한 세균으로부터 식재료를 보호할 수 있게 하는 기능을 포함하는 것을 특징으로 한다. 구체적으로, 식품 건조 장치 는 초음파 분무에 의한 맛과 향을 추가 기능, LED 램프를 이용한 비타민 D 생성 및 살균 기능, 및 필터를 통한 내외부공기 오염 방지 기능을 포함하는 것을 특징으로 한다. 도 2는 본 발명의 일 실시 예에 따른 초음파를 이용하는 식품 건조 장치의 예시도이다. 도 2를 참조하면, 식품 건조 장치는 내부 구성요소를 수납하는 하우징, 공기 배출구, 이에 설치 된 출구 에어 필터, 공기 흡입구 및 이에 설치된 입구 에어 필터를 포함하도록 구성될 수 있다. 도 3은 도 2에 묘사된 식품 건조 장치의 내부 예시도이다. 도 2 및 도 3을 참조하면, 하우징은 식품 건조 장치의 구성요소를 수납하는 기능을 갖는다. 하우징 은 바디 케이스, 프론트 커버 및 공기 배출구가 마련된 탑 커버를 포함하도록 구성될 수 있다. 프론트 커버 및 탑 커버는 바디 케이스와 연결 또는 분리된 상태에서 개방 가능하도록 구성될 수 있다. 프론트 커버는 건조 대상 식품의 투입 및 수거를 위해 개방될 수 있으며, 탑 커버는 도 2에 묘사된 분사 샤프트의 결합 및 분리를 위해 개방될 수 있다. 하우징은, 열처리 및 코팅 처리된 금속 합금, 특히 스테인레스 강을 이용하여 제조될 수 있다. 도 2 및 도 3을 참조하면, 식품 건조 장치는 공기 배출구 및 출구 에어 필터를 포함하도록 구성 될 수 있다. 식품 건조 장치는, 향신료를 이용하여 건조 대상 식품을 건조하는 기능을 가지므로, 향미가 포함된 공기가 공기 배출구를 통해 배출될 수 있으므로, 출구 에어 필터, 특히 탈취 필터를 포함하도 록 구성될 수 있다. 도 1에 묘사된 공기 배출구는 실시 예에 불과하므로, 공기 배출구는 크기, 위치 및 모양은 다양한 범위에서 채택될 수 있다. 도 2 및 도 3을 참조하면, 식품 건조 장치는 공기 흡입구 및 이에 설치된 입구 에어 필터를 포 함하도록 구성될 수 있다. 식품 건조 장치는 외기를 이용하여 건조 대상 식품을 건조 시키므로, 입구 에어 필터는 외기에 포함된 먼지 등의 불순물을 걸러 주는 기능을 갖는다. 도 3에 프론트 커버가 개방된 식품 건조 장치의 내부가 묘사되어 있다. 도 3을 참조하면, 식품 건조 장치는 건조 대상 식품이 건조되는 상부 영역과 각종 동력 장치를 포함하는 하부 영역으로 분리될 수 있다. 식품 건조 장치는 상부 영역에서, 분사 샤프트 및 선반을 포함하도록 구성될 수 있다. 분사 샤프트를 통해 향신료가 분사될 수 있다. 즉 하부 영역에 배치된 향신료 통에 담긴 향신료가 초 음파 모듈()에 의해 에어로졸로 변환되고, 에어로졸 형태의 향신료는 분사 샤프트를 통해 서로 다른 높이 의 선반에 보관된 건조 대상 식품에 분무될 수 있다. 분사 샤프트는 파이프 형태로 구성될 수 있으며, 그 표면에는 에어로졸이 분무되는 다수의 홀이 형성될 수 있다. 선반은, 복수의 층으로 마련될 수 있으며, 건조 대상 식품을 수납 및 보관하는 기능을 갖는다. 선반 의 바닥에는 홀이 형성되어 있어서 이를 통해 내부 공기 순환이 원활하게 일어 날 수 있다. 도 3을 다시 참조하면, 분사 샤프트와 선반이 배치되는 위치에서 이 둘은 서로 간섭이 일어날 수 있 다. 이를 방지하기 위해 선반의 바닥 면의 중앙에는 분사 샤프트가 통과할 수 있는 홀이 마련되어 있 고, 분사 샤프트는 탑 커버가 오픈된 상태에서 복수 층의 선반의 바닥에 형성된 홀을 관통하여 설치 되고, 분리될 수 있도록 구성될 수 있다. 선반에는 곡식, 예를 들어 쌀을 담을 수 있는 트레이가, 예를 들어 레일을 이용하여 슬라이딩 가능하게 결 합될 수 있다. 또한, 곡물 수납 용도의 트레이는, 수납된 곡물에 에어로졸 형태로 분사되는 향신료의 침투가 용 이하게 메쉬면을 포함하도록 구성될 수 있다. 메쉬면을 갖는 트레이가 포함된 식품 건조 장치는, 향신료 에어로졸의 분무를 이용하여 향미쌀을 제조하는 장치 및 제조된 향미쌀을 보관하는 쌀통의 기능을 갖는다.도 4는 도 2에 묘사된 식품 건조 장치의 단면을 나타내는 예시도이다. 도 4를 참조하면, 상술한 바와 같이 식품 건조 장치의 상부 영역에는 복수 층의 선반 및 이의 중심을 관통하여 설치된 분사 샤프트가 배치되어 있다. 복수 층의 선반들은, 건조 대상 식품의 모양과 크기에 따라 그 사이 간격이 조정될 수 있도록 구성될 수 있다. 식품 건조 장치의 하부 영역에는 동력 계통의 여러 구성요소가 배치되어 있다. 하부 영역에 배치된 구성요 소에 대해 자세히 설명하기로 한다. 도 5는 도 3에 묘사된 식품 건조 장치의 분리되어 묘사된 구성요소의 예시도이다. 도 5를 참조하면, 식품 건조 장치는, 초음파 모듈, 송풍 팬 및 히터를 포함하도록 구성될 수 있다. 히터는, 식품 건조 장치의 하부 영역에서 송풍 팬의 상부에 배치될 수 있다. 히터는 건조 대상 식품에 착향 및 건조를 돕는 기능을 갖는다. 히터는 송풍 팬과 함께 또는 독립하여 동작할 수 있다. 착향 모드에서 히터는 송풍 팬의 구동 없이 독립하여 동작하는 것이 바람직하다. 반면에 건조 모드에서 히터는 송풍 팬과 함께 구동될 수 있다. 히터는 열선과 열을 방출하는 열방출부를 포함할 수 있다. 열선은 모선에 저항 값이 높은 금속 합금, 예를 들어 구니-니켈, 니켈-크롬, 철-니켈 또는 고분자 발열체, 예를 들어 카본블랙, 금속분말, 카본파이어 등이 전 기적으로 결합되어 구성될 수 있다. 열방출부는 세라믹을 이용하여 구현될 수 있다. 세라믹은 열선이 공기에 노 출되는 것을 방지하는 역할을 한다. 세라믹 열방출부는 2.5μm~25μm 파장의 원적외선을 방출할 수 있다. 초음파 모듈은, 식품 건조 장치의 하부 영역에서 송풍 팬의 상부에 배치될 수 있다. 초음파 모 듈은 초음파 액츄에이터(actuator)에 해당하는 진동자를 포함하도록 구성될 수 있다. 자왜진동자, 전자유 도형진동자 및 압전진동자 등의 종류 중에서 가장 많이 사용되는 압전진동자가 초음파 모듈에 포함될 수 있다. 초음파 모듈은 초음파 진동을 이용하여 액상의 향신료를 에어로졸 형태로 변환하는 기능을 갖는다. 에어로 졸 형태로 변환된 향신료는 분사 샤프트를 통해 복수 층의 선반에 보관된 건조 대상 식품에 분무될 수 있다. 초음파 모듈은 착향 모드에서 히터의 초음파 모듈은 히터와 함께 또는 독립하여 동작할 수 있다. 즉 착향 모드에서 초음파 모듈은, 건조 대상 식품의 종류에 따른 히터의 조력 여부에 따라 열풍 착향 및 송풍 팬에 의한 자연풍 착향을 위해 동작할 수 있다. 초음파 모듈은 여러 종류 향신료의 혼용에 따라 식품 건조 장치로부터 분리되어 청소가능하게 구성될 수 있다. 또한, 초음파 모듈은 향신료 대신 클랜징 액 또는 물과 진동자를 이용하여 자체 청소하는 기능을 포함하도록 구성될 수 있다. 또한, 초음파 모듈의 자체 청소 기능은 분사 샤프트의 청소에도 도움될 수 있다. 또한, 초음파 모듈은 향신료의 수에 맞게 복수 개가 마련되어 있어서, 향신료의 선택에 따라 이 에 대응하는 초음파 모듈이 동작 가능하게 구성될 수 있다. 이 경우, 복수의 향신료는 동일한 개수로 구획 된 향신료 통에 보관될 수 있다. 송풍 팬은, 식품 건조 장치의 하부 영역에서 히터 및 초음파 모듈보다 낮은 위치에 배치될 수 있다. 송풍 팬이 배치되는 하우징의 측면에는 공기 흡입구가 배치될 수 있다. 공기 흡입구로 유입된 공 기는 송풍 팬의 작동에 따라 식품 건조 장치의 선반에 보관된 건조 대상 식품에 이르고, 경우에 따라 공기 배출구 및 출구 에어 필터를 통과하여 외부로 배출될 수 있다. 공기 배출구는 제어기 에 의해 전자적 개폐가 가능하게 동작되므로, 공기 배출구의 개폐에 따라 내부 공기는 외기 순환 모 드 또는 내기 순환 모드 상태에서 공기의 흐름이 결정될 수 있다. 보통 자동차의 내기/외기 순환 모드는 외부 공기의 유입 여부에 초점이 맞춰져 있지만, 본 발명의 일 실시 예에 따른 초음파를 이용하는 식품 건조 장치는 외기의 특징 보다는 향미를 품은 내기의 배출 여부에 초점을 맞 춰서 내기/외기 순환 모드가 결정될 수 있다. 향미를 품은 내기의 배출은 외부 공기를 오염시키는 원인이 될 수 있어서, 향신료가 건조 대상 식품에 착향되지 않은 체로, 에어로졸이 다량 포함된 내기의 배출은 제어기의 동작을 통해 통제될 수 있다.식품 건조 장치는 향신료 통을 더 포함하도록 구성될 수 있다. 향신료 통은 액상 형태의 향신료 를 보관하는 기능을 갖는다. 향신료는 향과 맛을 내게 하는 물질은 예를 들어 당분, 염분, 및 천연 재료를 포함 할 수 있어서, 건조 대상 식품에 단맛 및 짠맛을 가미할 수 있고, 천연 재료, 예를 들어 마늘, 대나무, 허브의 풍미를 건조 대상 식품에 가미할 수 있다. 건조 대상 식품은, 야채, 과일, 생선 및 육류에 한정되지 않으며, 건 조 대상 식품이 소금인 경우, 대나무 추출액 또는 허브 추출액을 이용하여 허브 소금 또는 죽염과 같이 대나무 풍미가 가미된 소금이 제조될 수 있다. 도 2를 다시 참조하면, 식품 건조 장치의 동작을 제어할 수 있게 하는 사용자 인터페이스가 묘사되어 있다. 하우징, 프론트 커버에 마련된 사용자 인터페이스는 식품 건조 장치의 동작 제어에 필요한 입력 장치 및 출력 장치를 포함하도록 구성될 수 있다. 입력 장치의 일 실시 예로서 터치 패널, 푸쉬 버 튼이 포함될 수 있고, 출력 장치의 일 실시 예로서 LED 램프, LCD 패널, 스피커 등이 포함될 수 있다. 식품 건조 장치는 사용자 인터페이스와 연동되어 기능하는 식품 건조 장치의 동작 제어를 위한 제어기를 포함하도록 구성될 수 있다. 제어기는 사용자 인터페이스의 입력 장치를 통한 입력에 따라 식품 건조 장치의 내부 동력 계통 의 구성요소를 동작시키고, 그 동작 상황을 사용자 인터페이스의 출력 장치를 통해 표시하는 출력 데이터 를 생성하는 기능을 갖는다. 제어기는 사용자의 모드 선택이 없는 경우에도 학습을 통해 훈련된 인공지능 모듈을 이용하여, 건조 대상 식품의 종류 및 양에 따라 건조 및 착향 모드의 타이밍을 제어하도록 구성될 수 있 다. 도 6은 본 발명의 일 실시 예에 따른 초음파를 이용하는 식품 건조 장치의 제어기의 블록도이다. 도 6을 참조하면, 제어기는 사용자 인터페이스, 프로세서, 및 메모리를 포함하도록 구성될 수 있다. 사용자 인터페이스는 사용자로부터 입력을 받는 입력 장치 및 식품 건조 장치의 동작과 관련된 정보 를 표시하는 출력 장치를 포함하도록 구성될 수 있다. 입력 장치는 터치 패널, 푸쉬 버튼 등의 형태로 구현될 수 있고, 출력 장치는 LCD 디스플레이, LED 램프, 스피커 등의 형태로 구현될 수 있다. 프로세서는 미리 프로그램된 수분 함량 측정 모듈, 건조 모드 모듈, 착향 모드 모듈 및 순 환 모드 모듈에 기반하여 인공지능 모드 모듈을 이용하여, 공기 배출구의 개폐, 센서의 데 이터 수집, 히터, 초음파 모듈 및 송풍 팬의 작동을 통해 식품 건조 방법을 실행하는 기능을 갖 는다. 메모리는, 기능성 프로그램 모듈들, 즉 수분 함량 측정 모듈, 건조 모드 모듈, 착향 모드 모듈 , 순환 모드 모듈 및 인공지능 모드 모듈을 포함하도록 구성될 수 있다. 기능성 프로그램 모듈 들은, 하드웨어인 메모리와 일체로, 또는 전원의 공급에 따라 메모리 상에 로드 되는 소프트웨어 형 태로 구현될 수 있다. 프로세서는, 데이터 입출력 및 연산 기능에 기반하여 메모리에 저장된 수분 함량 측정 모듈과의 상호 작용을 통해 공기 배출구, 센서 중에서, 습도 센서, 및 히터의 동작을 제어함으로써 건조 대상 식품의 수분 함량을 측정할 수 있다. 프로세서는, 데이터 입출력 및 연산 기능에 기반하여 메모리에 저장된 건조 모드 모듈과의 상호 작용을 통해 공기 배출구, 센서 중에서, 습도 센서, 히터 및 송풍 팬의 동작을 제어함으로 써 건조 대상 식품을 건조시킬 수 있다. 프로세서는, 데이터 입출력 및 연산 기능에 기반하여 메모리에 저장된 착향 모드 모듈과의 상호 작용을 통해 공기 배출구, 히터, 초음파 모듈 및 송풍 팬의 동작을 제어함으로써 건조 대 상 식품에 맛과 향을 입힐 수 있다. 프로세서는, 데이터 입출력 및 연산 기능에 기반하여 메모리에 저장된 순환 모드 모듈과의 상호 작용을 통해 공기 배출구, 및 센서 중에서, 습도 센서의 동작을 제어함으로써 건조 대상 식품의 수분함량을 측정할 수 있다. 프로세서는, 데이터 입출력 및 연산 기능에 기반하여 메모리에 저장된 인공지능 모드 모듈과의 상호 작용을 통해, 기능성 프로그램 모듈(145~148)에 기반하여 공기 배출구, 센서 중에서, 습도 센서, 온도센서, 히터 및 초음파 모듈 및 송풍 팬의 동작을 제어함으로써 맛과 향이 가미된 건 조된 식품을 제조할 수 있다. 인공지능 모드 모듈은 학습을 통해 훈련된 인공지능 모델을 포함하도록 구성될 수 있다. 그리고 인공지능 모델에 대해, 건조 대상 식품의 종류에 따른 레시피 정보 및 식품 건조 장치의 구동 정보가 포함된 훈련 데이터 셋을 이용하여, 건조 대상 식품의 종류에 맞는 최적의 맛과 향이 가미될 수 있게 하는 레시피의 학습에 대한 훈련이 선행될 수 있다. 레시피 정보는, 예를 들어, 일정의 수분이 함유된 야채 및 과일과, 이미 건조된 상태의 견과류를 구분하여 초기 건조 모드를 수행할 것인지에 대한 식품에 관한 정보, 향신료의 종류, 예를 들 면, 향신료가 단맛 및 짠맛과 같은 맛에 관한 것인지, 마늘 및 허브 추출액과 같이 풍미를 위한 것인지에 관한 향신료 정보 및 식품에 관한 정보와 향신료 정보에 기반한 식품 건조 장치의 구성요소의 구동을 위한 작동 타이 밍 정보를 포함할 수 있다. 이하 식품 건조의 기본이 되는 공기 배출구, 센서, 히터, 초음파 모듈 및 송풍 팬의 기본 동작에 대해 설명하기로 한다. 도 7은 도 4에 묘사된 식품 건조 장치에서 공기 순환을 나타내는 예시도이다. 도 7을 참조하면, 공기 흡입구를 통해 식품 건조 장치 내로 들어온 공기는, 하우징 내 순환을 거쳐 공기 배출구를 통해 배출될 수 있다. 공기의 흐름은 송풍 팬을 통해 가속화 될 수 있고, 히터 를 통해 열풍이 생성될 수 있다. 공기 흡입구에 설치된 입구 에어 필터는 외부 공기에 포함된 먼지를 제거할 수 있고, 공기 배출구에 설치된 출구 에어 필터는 식품 건조 중에 발생하는 먼지를 제 거하는 공기 필터 및 향신료의 냄새를 탈취하는 탈취 필터를 포함하도록 구성될 수 있다. 공기 배출구는 내기 순환 모드 및 외기 순환 모드에 따라 개폐가 제어될 수 있다. 예를 들어, 공기 배출구 는 닫혀지고, 내기 순환 모드에서 건조 대상 식품에 대한 착향이 이루어질 수 있다. 또한, 공기 배출구 가 오픈되고, 외기 순환 모드에서 착향이 마쳐진 건조 대상 식품에 대한 건조가 이루어질 수 있다. 히터, 초음파 모듈 및 송풍 팬의 작동 여부에 따라 건조 모드 및 착향 모드가 수행될 수 있다. 예를 들어 초음파 모듈이 동작하면서 착향이 시작되고, 건조 대상 식품의 종류에 따라 히터를 이용해 착향의 속도가 조절될 수 있다. 초음파 모듈 및 히터 동작에 의한 착향이 습도계를 통해 어느 정도 진행된 것으로 판단되면, 초음파 모듈 및 히터의 동작이 중단되고, 송풍 팬의 동작을 통해 건조 모드가 진행될 수 있다. 공기 배출구 및 습도계의 동작을 통해 외기 순환 모드에서는 내기 공기에 포함된 분사된 향신료가 최소 포함되도록 제어될 수 있다. 도 8은 도 4에 묘사된 식품 건조 장치에서 향신료 에어로졸 분사의 예시도이다. 도 8을 참조하면, 식품 건조 장치의 하부 영역에 배치된 향신료 통에 보관된 액상의 향신료는 초음파 모듈의 동작 및 분사 샤프트의 분사를 통해 건조 대상 식품에 분사될 수 있다. 분사 샤프트는 선반의 중앙에 배치되어 있어서 건조 대상 식품에 에어로졸 형태의 향신료를 고르게 분사할 수 있는 효과 가 발휘할 수 있다. 선반은 건조 대상 식품을 거치하기 편리하게 복수 층으로 마련될 수 있고, 식품 건조 장치로부터 분 리가 가능하다. 또한, 식품 건조 장치는 선반에 슬라이딩 가능한 곡물 수납 용도의 트레이를 더 포함하도 록 구성될 수 있다. 곡물 수납 용도의 트레이는, 수납된 곡물에 에어로졸 형태로 분사되는 향신료의 침투가 용 이하게 메쉬 면을 포함하도록 구성될 수 있다. 곡물 수납 용도의 트레이와 건조 대상 식품의 거치 및 수거 시에 편리하도록 선반과 분사 샤프트는 서로 분리가 가능하도록 구성될 수 있다. 예를 들어 선반 바닥 중앙에 홀이 형성되어 있어서, 분사 샤프트 가 홀을 통해 결합될 수 있다. 식품 건조 장치는 LED 모듈을 포함하도록 구성될 수 있다. LED 모듈은 건조 대상 식품의 살균 및 비타민 D 생성에 필요한 UV LED를 포함할 수 있다. 그리고 제어기는 건조 대상 식품의 종류에 따라 살 균 및 비타민 D 생성에 필요한 광을 생성하게 LED 모듈을 제어하도록 구성될 수 있다. 자외선의 살균 효과는 UV LED의 자외선 파장대 중에서 200nm~280nm 사이의 UVC 영역에서 발생한다. 그리고 비타 민 D 생성의 효과는 UV LED의 자외선 파장대 중에서 UVB(280nm~320nm) 영역에서 발생한다. 즉, LED 모듈 에서 방출되는 UVB가 식품에 포함된 프로비타민 D를 비타민 D로 전환시키는 과정에 관여할 수 있다. 본 발명의 일 실시 예에 따른 초음파를 이용하는 식품 건조 장치가 갖는 기술적 특징은 방법을 통해 설명 될 수 있다. 도 9는 본 발명의 일 실시 예에 따른 초음파를 이용하는 식품 건조 방법의 흐름도이다. 도 9를 참조하면, 초음파를 이용하는 식품 건조 방법(S100)은, 건조 대상 식품의 수분 함량 측정(S110), 초기 건조 모드 제어(S120), 착향 모드 제어(S130) 및 건조 모드 제어(S140)를 포함하도록 구성될 수 있다. S110 내지 S140의 과정은 본 발명의 일 실시 예에 따른 식품 건조 장치에 포함된 인공지능 모드 모듈(14 9)에 의하는 방법에 포함되며, 사용자의 수동에 의한 수동 모드에서는 다르게 구성될 수 있다. S110 단계에서, 식품 건조 장치는, 건조 대상 식품의 건조 레시피에 관한 학습의 훈련을 받은 인공지능 모 델을 이용하여(인공지능 모드) 내기 순환 모드에서 히터, 송풍 팬 및 습도계를 이용하여 건조 대상 식품의 수분 함량을 측정할 수 있다. S120 단계에서, 식품 건조 장치는, 건조 대상 식품의 건조 레시피에 관한 학습의 훈련을 받은 인공지능 모 델을 이용하여(인공지능 모드) 수분 함량에 따라 초기 건조 모드의 작동 타이밍을 제어할 수 있다. S130 단계에서, 식품 건조 장치는, 건조 대상 식품의 건조 레시피에 관한 학습의 훈련을 받은 인공지능 모 델을 이용하여(인공지능 모드) 내기 순환의 착향 모드에서 향신료를 에어로졸 형태로 분사하는 초음파 모듈 및 히터의 작동을 제어할 수 있다. S140 단계에서, 식품 건조 장치는, 건조 대상 식품의 건조 레시피에 관한 학습의 훈련을 받은 인공지능 모 델을 이용하여(인공지능 모드) 외기 순환의 건조 모드에서 상기 히터 및 송풍 팬의 작동을 제어할 수 있다. 식품 건조 장치는, 외기 순환의 건조 모드에서 배출구에 설치된 탈취 필터를 통해 공기가 외부로 배출되도 록 구성될 수 있다. S150 단계에서, 식품 건조 장치는, LED 모듈의 자외선을 이용하여 건조 대상 식품을 살균할 수 있다. 제어기는 LED 모듈의 제어를 통해 200nm~280nm 사이의 UVC를 방출하여 건조 대상 식품을 살균할 수 있다. S160 단계에서, 식품 건조 장치는, LED 모듈의 자외선을 이용하여 식품에 비타민 D를 생성시킬 수 있 다. 제어기는 LED 모듈의 제어를 통해 280nm~320nm 사이의 UVB를 방출하여 건조 대상 식품에 포함된 프로비타민 D를 비타민 D로 변환할 수 있다. 도 10은는 본 발명의 일 실시 예에 따른 초음파 기반의 식품 건조 장치의 효과에 관한 예시도이다. 도 10을 참조하면, 본 발명일 실시 예에 따른 식품 건조 장치는, 세라믹 성분을 이용하여 적외선을 방출하 는 히터, 식품에 맛과 향을 추가할 수 있는 초음파 모듈, 장치에 흡입된 공기와 배출되는 공기의 필 터링(122, 132) 및 LED 모듈에 의해 자외선을 이용한 식품 살균 및 비타민D 생성 기능을 포함하는 것을 특 징으로 한다. 이와 같이 본 발명의 일 실시 예에 따르면, 종래 기술의 식품 건조 장치에 초음파를 이용한 향신료 분사 기술이 융합될 수 있다. 또한, 향신료의 향과 맛이 원물 건조 단계에서 원물에 적용할 수 있다. 또한, 에어 필터 및 탈취 필터를 이용하여 외기 및 내기 순환 모드를 통해 건조 대상 식품에 향과 맛이 추가될 수 있다.이상, 일부 예를 들어서 본 발명의 바람직한 여러 가지 실시 예에 대해서 설명하였지만, 본 \"발명을 실시하기 위한 구체적인 내용\" 항목에 기재된 여러 가지 다양한 실시 예에 관한 설명은 예시적인 것에 불과한 것이며, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자라면 이상의 설명으로부터 본 발명을 다양하게 변형하여 실 시하거나 본 발명과 균등한 실시를 행할 수 있다는 점을 잘 이해하고 있을 것이다. 또한, 본 발명은 다른 다양한 형태로 구현될 수 있기 때문에 본 발명은 상술한 설명에 의해서 한정되는 것이 아 니며, 이상의 설명은 본 발명의 개시 내용이 완전해지도록 하기 위한 것으로 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 본 발명의 범주를 완전하게 알려주기 위해 제공되는 것일 뿐이며, 본 발명은 청구범 위의 각 청구항에 의해서 정의될 뿐임을 알아야 한다."}
{"patent_id": "10-2021-0077788", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 종래 기술과 구별되는 본 발명의 일 실시 예에 따른 초음파를 이용하는 식품 건조 장치의 특징을 나타내 는 예시도이다. 도 2는 본 발명의 일 실시 예에 따른 초음파를 이용하는 식품 건조 장치의 예시도이다. 도 3은 도 2에 묘사된 식품 건조 장치의 내부 예시도이다. 도 4는 도 2에 묘사된 식품 건조 장치의 단면을 나타내는 예시도이다. 도 5는 도 3에 묘사된 식품 건조 장치의 분리되어 묘사된 구성요소의 예시도이다. 도 6은 본 발명의 일 실시 예에 따른 초음파를 이용하는 식품 건조 장치의 제어부의 블록도이다. 도 7은 도 4에 묘사된 식품 건조 장치에서 공기 순환을 나타내는 예시도이다. 도 8은 도 4에 묘사된 식품 건조 장치에서 향신료 에어로졸 분사의 예시도이다. 도 9는 본 발명의 일 실시 예에 따른 초음파를 이용하는 식품 건조 방법의 흐름도이다.도 10은 본 발명의 일 실시 예에 따른 초음파 기반의 식품 건조 장치의 효과에 관한 예시도이다."}
