{"patent_id": "10-2023-7023438", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0132782", "출원번호": "10-2023-7023438", "발명의 명칭": "랜덤 액세스 채널 절차에서 라디오 리소스 제어 접속요청 메시지와 연관된 물리 업링크 공유", "출원인": "퀄컴 인코포레이티드", "발명자": "타헤르자데 보루제니 마흐무드"}}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "무선 통신을 위한 사용자 장비(UE)로서,메모리; 및상기 메모리에 동작가능하게 커플링된 하나 이상의 프로세서들을 포함하고,상기 메모리 및 상기 하나 이상의 프로세서들은:랜덤 액세스 채널 (RACH) 절차의 라디오 리소스 제어 (RRC) 접속 요청 메시지와 연관된 물리 업링크 공유 채널(PUSCH) 반복에 대한 요청을 기지국에 송신하고; 그리고상기 PUSCH 반복에 대한 요청에 적어도 부분적으로 기초하여 상기 RRC 접속 요청 메시지와 연관된 적어도 하나의 PUSCH 반복을 송신하도록구성되는, UE."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 PUSCH 반복에 대한 요청은 상기 PUSCH 반복에 대응하는 하나 이상의 제안된 파라미터들을 표시하는, UE."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 메모리 및 상기 하나 이상의 프로세서들은, 상기 PUSCH 반복에 대한 요청을 송신할 때, 상기 PUSCH 반복에대한 요청을 표시하는 물리 RACH (PRACH) 메시지를 송신하도록 구성되는, UE."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 메모리 및 상기 하나 이상의 프로세서들은, 상기 PUSCH 반복에 대한 요청을 송신할 때, 복수의 RACH 어케이전들에 걸쳐 상기 PRACH 메시지를 반복하도록 구성되는, UE."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 3 항에 있어서,상기 PUSCH 반복에 대한 요청을 송신하는 것은, PRACH 프리앰블들의 세트의 PRACH 프리앰블들의 서브세트로부터선택되는 PRACH 프리앰블을 송신하는 것을 포함하고, 상기 서브세트는 상기 PUSCH 반복에 대한 요청을표시하는, UE."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 3 항에 있어서,상기 메모리 및 상기 하나 이상의 프로세서들은, 상기 PUSCH 반복에 대한 요청을 송신할 때, RACH 어케이전(RO)들의 세트의 RO들의 서브세트를 사용하여 상기 PRACH 메시지를 송신하도록 구성되고, 상기 RO들의 서브세트는상기 PUSCH 반복에 대한 요청을 표시하는, UE."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 3 항에 있어서,공개특허 10-2023-0132782-3-상기 메모리 및 상기 하나 이상의 프로세서들은, 상기 PRACH 메시지를 송신할 때, 하나 이상의 PRACH 파라미터들에 적어도 부분적으로 기초하여 상기 PRACH 메시지를 송신하도록 구성되는, UE."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서,상기 메모리 및 상기 하나 이상의 프로세서들은 또한, 상기 하나 이상의 PRACH 파라미터들과 상기 PUSCH 반복에대한 요청에 대응하는 하나 이상의 요청 파라미터들 사이의 관계에 적어도 부분적으로 기초하여 상기 하나 이상의 PRACH 파라미터들을 선택하도록 구성되는, UE."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서,상기 메모리 및 상기 하나 이상의 프로세서들은 또한, 상기 기지국으로부터, 상기 관계를 표시하는 파라미터 구성을 수신하도록 구성되는, UE."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9 항에 있어서,상기 파라미터 구성은 시스템 정보에서 반송되는, UE."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 10 항에 있어서,상기 시스템 정보는 잔여 최소 시스템 정보를 포함하는, UE."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 8 항에 있어서,상기 관계는 무선 통신 표준에 의해 표시되는, UE."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 1 항에 있어서,상기 메모리 및 상기 하나 이상의 프로세서들은 하나 이상의 트리거 기준들이 충족되는 것을 결정하도록 추가로구성되고, 상기 메모리 및 상기 하나 이상의 프로세서들은, 상기 PUSCH 반복에 대한 요청을 송신할 때, 상기 하나 이상의 트리거 기준들이 충족된다고 결정하는 것에 적어도 부분적으로 기초하여 상기 PUSCH 반복에 대한 요청을 송신하도록 구성되는, UE."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13 항에 있어서,상기 메모리 및 상기 하나 이상의 프로세서들은 또한, 상기 기지국으로부터, 상기 하나 이상의 트리거 기준들을표시하는 트리거 구성을 수신하도록 구성되는, UE."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 14 항에 있어서,상기 트리거 구성은 시스템 정보에서 반송되는, UE."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 15 항에 있어서,상기 시스템 정보는 잔여 최소 시스템 정보를 포함하는, UE.공개특허 10-2023-0132782-4-청구항 17 제 13 항에 있어서,상기 하나 이상의 트리거 기준들은 제 1 레퍼런스 신호 수신 전력 (RSRP) 임계치를 포함하는, UE."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 17 항에 있어서,상기 메모리 및 상기 하나 이상의 프로세서들은 제 1 동기화 신호 블록 (SSB) 기반 RSRP를 결정하도록 추가로구성되고, 상기 메모리 및 상기 하나 이상의 프로세서들은, 상기 하나 이상의 트리거 기준들이 충족되는 것을결정할 때, 상기 제 1 SSB 기반 RSRP 가 상기 제 1 RSRP 임계치를 충족하는 것을 결정하도록 구성되는, UE."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 18 항에 있어서,상기 하나 이상의 트리거 기준들은 제 2 RSRP 임계치를 포함하는, UE."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 19 항에 있어서,상기 메모리 및 상기 하나 이상의 프로세서들은 제 2 SSB 기반 RSRP 를 결정하도록 추가로 구성되고, 상기 메모리 및 상기 하나 이상의 프로세서들은, 상기 하나 이상의 트리거 기준들이 충족되는 것을 결정할 때, 상기 제 2SSB 기반 RSRP 가 상기 제 2 RSRP 임계치를 충족하는 것을 결정하도록 구성되는, UE."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제 20 항에 있어서,상기 PUSCH 반복에 대한 요청은 상기 제 1 SSB 기반 RSRP 가 상기 제 1 RSRP 임계치를 충족한다고 결정하는 것에 적어도 부분적으로 기초하여 제 1 수의 요청된 PUSCH 반복들을 표시하고, 그리고상기 PUSCH 반복에 대한 요청은 상기 제 2 SSB 기반 RSRP 가 상기 제 2 RSRP 임계치를 충족한다고 결정하는 것에 적어도 부분적으로 기초하여 제 2 수의 요청된 PUSCH 반복들을 표시하는, UE."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제 13 항에 있어서,상기 하나 이상의 트리거 기준들은 무선 통신 표준에서 표시되는, UE."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제 1 항에 있어서,상기 메모리 및 상기 하나 이상의 프로세서들은, 상기 적어도 하나의 PUSCH 반복을 송신할 때, 상기 PUSCH 반복에 대한 요청을 송신하는 것에 적어도 부분적으로 기초하여 상기 적어도 하나의 PUSCH 반복을 송신하도록 구성되는, UE."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제 1 항에 있어서,상기 메모리 및 상기 하나 이상의 프로세서들은 추가로,상기 기지국으로부터 랜덤 액세스 응답 (RAR) 메시지를 수신하는 것으로서, 상기 RAR 메시지는:상기 RRC 접속 요청 메시지를 위한 PUSCH 리소스, 또는상기 RRC 접속 요청 메시지와 연관된 PUSCH 파라미터공개특허 10-2023-0132782-5-중 적어도 하나를 표시하는, 상기 RAR 메시지를 수신하는 것을 행하고; 그리고상기 RAR 메시지에 적어도 부분적으로 기초하여, PUSCH 반복 파라미터 또는 PUSCH 반복 리소스 중 적어도 하나를 결정하도록 구성되는, UE."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제 24 항에 있어서,상기 메모리 및 상기 하나 이상의 프로세서들은, 상기 PUSCH 반복 파라미터 또는 상기 PUSCH 반복 리소스 중 적어도 하나를 결정할 때, 무선 통신 표준에 의해 표시된 하나 이상의 규칙들에 적어도 부분적으로 기초하여 상기PUSCH 반복 파라미터 또는 상기 PUSCH 반복 리소스 중 적어도 하나를 결정하도록 구성되는, UE."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "제 1 항에 있어서,상기 메모리 및 상기 하나 이상의 프로세서들은, 상기 기지국으로부터, PUSCH 반복 요청 승인의 표시를 수신하도록 추가로 구성되고, 상기 PUSCH 반복 요청 승인은 상기 PUSCH 반복 요청의 적어도 부분에 대응하는, UE."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "제 26 항에 있어서,상기 PUSCH 반복 요청 승인의 표시는 랜덤 액세스 응답 (RAR) 메시지에서 반송되는, UE."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_28", "content": "제 27 항에 있어서,상기 PUSCH 반복 요청 승인의 표시는 상기 RAR 메시지의 물리 다운링크 제어 채널 부분에서 반송되는, UE."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "무선 통신을 위한 사용자 장비(UE)로서,메모리; 및상기 메모리에 동작가능하게 커플링된 하나 이상의 프로세서들을 포함하고,상기 메모리 및 상기 하나 이상의 프로세서들은:랜덤 액세스 채널 (RACH) 절차의 라디오 리소스 제어 (RRC) 접속 요청 메시지와 연관된 물리 업링크 공유 채널(PUSCH) 반복에 대한 요청을 포함하는 물리 랜덤 액세스 채널 절차 (PRACH) 메시지를 기지국에 송신하고; 그리고상기 PUSCH 반복에 대한 요청에 적어도 부분적으로 기초하여 상기 RRC 접속 요청 메시지와 연관된 적어도 하나의 PUSCH 반복을 송신하도록구성되는, UE."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_30", "content": "제 29 항에 있어서,상기 메모리 및 상기 하나 이상의 프로세서들은, 상기 PUSCH 반복에 대한 요청을 송신할 때, 복수의 RACH 어케이전들에 걸쳐 상기 PRACH 메시지를 반복하도록 구성되는, UE."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_31", "content": "제 29 항에 있어서,상기 PUSCH 반복에 대한 요청을 송신하는 것은, PRACH 프리앰블들의 세트의 PRACH 프리앰블들의 서브세트로부터선택되는 PRACH 프리앰블을 송신하는 것을 포함하고, 상기 서브세트는 상기 PUSCH 반복에 대한 요청을공개특허 10-2023-0132782-6-표시하는, UE."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_32", "content": "제 29 항에 있어서,상기 메모리 및 상기 하나 이상의 프로세서들은, 상기 PUSCH 반복에 대한 요청을 송신할 때, RACH 어케이전(RO)들의 세트의 RO들의 서브세트를 사용하여 상기 PRACH 메시지를 송신하도록 구성되고, 상기 RO들의 서브세트는상기 PUSCH 반복에 대한 요청을 표시하는, UE."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_33", "content": "제 29 항에 있어서,상기 메모리 및 상기 하나 이상의 프로세서들은, 상기 PRACH 메시지를 송신할 때, 하나 이상의 PRACH 파라미터들에 적어도 부분적으로 기초하여 상기 PRACH 메시지를 송신하도록 구성되는, UE."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_34", "content": "무선 통신을 위한 사용자 장비 (UE) 로서, 메모리; 및상기 메모리에 동작가능하게 커플링된 하나 이상의 프로세서들을 포함하고,상기 메모리 및 상기 하나 이상의 프로세서들은:하나 이상의 트리거 기준들이 충족된다는 결정에 적어도 부분적으로 기초하여, 랜덤 액세스 채널 (RACH) 절차의라디오 리소스 제어 (RRC) 접속 요청 메시지와 연관된 물리 업링크 공유 채널 (PUSCH) 반복에 대한 요청을 포함하는 물리 랜덤 액세스 채널 절차 (PRACH) 메시지를 기지국에 송신하는 것으로서, 상기 하나 이상의 트리거 기준들은 레퍼런스 신호 수신 전력 임계치를 포함하는, 상기 PRACH 메시지를 기지국에 송신하는 것을 행하고; 그리고상기 PUSCH 반복에 대한 요청에 적어도 부분적으로 기초하여 상기 RRC 접속 요청 메시지와 연관된 적어도 하나의 PUSCH 반복을 송신하도록구성되는, UE."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_35", "content": "제 34 항에 있어서,상기 메모리 및 상기 하나 이상의 프로세서들은, 상기 PUSCH 반복에 대한 요청을 송신할 때, 상기 PUSCH 반복에대한 요청을 표시하는 물리 RACH (PRACH) 메시지를 송신하도록 구성되는, UE."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_36", "content": "제 34 항에 있어서,상기 메모리 및 상기 하나 이상의 프로세서들은 제 1 동기화 신호 블록 (SSB) 기반 RSRP를 결정하도록 추가로구성되고, 상기 메모리 및 상기 하나 이상의 프로세서들은, 상기 하나 이상의 트리거 기준들이 충족되는 것을결정할 때, 상기 제 1 SSB 기반 RSRP 가 상기 RSRP 임계치를 충족하는 것을 결정하도록 구성되는, UE."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_37", "content": "무선 통신을 위한 사용자 장비 (UE) 로서, 메모리; 및상기 메모리에 동작가능하게 커플링된 하나 이상의 프로세서들을 포함하고,상기 메모리 및 상기 하나 이상의 프로세서들은:하나 이상의 트리거 기준들이 충족된다는 결정에 적어도 부분적으로 기초하여, 랜덤 액세스 채널 (RACH) 절차의공개특허 10-2023-0132782-7-라디오 리소스 제어 (RRC) 접속 요청 메시지와 연관된 물리 업링크 공유 채널 (PUSCH) 반복에 대한 요청을 포함하는 물리 랜덤 액세스 채널 절차 (PRACH) 메시지를 기지국에 송신하는 것으로서, 상기 하나 이상의 트리거 기준들은 레퍼런스 신호 수신 전력 임계치를 포함하는, 상기 PRACH 메시지를 기지국에 송신하는 것을 행하고; 상기 기지국으로부터, PUSCH 반복 요청 승인의 표시를 수신하는 것으로서, 상기 PUSCH 반복 요청 승인은 상기PUSCH 반복 요청의 적어도 부분에 대응하는, 상기 PUSCH 반복 요청 승인의 표시를 수신하는 것을 행하고; 그리고상기 PUSCH 반복에 대한 요청에 적어도 부분적으로 기초하여 상기 RRC 접속 요청 메시지와 연관된 적어도 하나의 PUSCH 반복을 송신하도록구성되는, UE."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_38", "content": "제 37 항에 있어서,상기 PUSCH 반복 요청 승인의 표시는 랜덤 액세스 응답 (RAR) 메시지에서 반송되는, UE."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_39", "content": "무선 통신을 위한 기지국으로서,메모리; 및상기 메모리에 동작가능하게 커플링된 하나 이상의 프로세서들을 포함하고,상기 메모리 및 상기 하나 이상의 프로세서들은:사용자 장비 (UE) 로부터, 랜덤 액세스 채널 (RACH) 절차의 라디오 리소스 제어 (RRC) 접속 요청 메시지와 연관된 물리 업링크 공유 채널 (PUSCH) 반복에 대한 요청을 수신하고; 그리고상기 PUSCH 반복에 대한 요청에 적어도 부분적으로 기초하여 상기 RRC 접속 요청 메시지와 연관된 적어도 하나의 PUSCH 반복을 수신하도록구성되는, 기지국."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_40", "content": "제 39 항에 있어서,상기 메모리 및 상기 하나 이상의 프로세서들은, 상기 PUSCH 반복에 대한 요청을 수신할 때, 상기 PUSCH 반복에대한 요청을 표시하는 물리 RACH (PRACH) 메시지를 수신하도록 구성되는, 기지국."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_41", "content": "제 40 항에 있어서,상기 메모리 및 상기 하나 이상의 프로세서들은, 상기 PRACH 메시지를 수신할 때, 하나 이상의 PRACH 파라미터들에 적어도 부분적으로 기초하여 상기 PRACH 메시지를 수신하도록 구성되고, 그리고 상기 하나 이상의 PRACH파라미터들의 선택은 상기 하나 이상의 PRACH 파라미터들과 상기 PUSCH 반복에 대한 요청에 대응하는 하나 이상의 요청 파라미터들 사이의 관계에 적어도 부분적으로 기초하는, 기지국."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_42", "content": "제 41 항에 있어서,상기 메모리 및 상기 하나 이상의 프로세서들은 또한, 상기 관계를 표시하는 파라미터 구성을 상기 UE 에 송신하도록 구성되는, 기지국."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_43", "content": "제 39 항에 있어서,공개특허 10-2023-0132782-8-상기 메모리 및 상기 하나 이상의 프로세서들은, 상기 PUSCH 반복에 대한 요청을 수신할 때, 하나 이상의 트리거 기준들이 충족된다는 결정에 적어도 부분적으로 기초하여 상기 PUSCH 반복에 대한 요청을 수신하도록 구성되고, 그리고 상기 메모리 및 상기 하나 이상의 프로세서들은 또한, 상기 하나 이상의 트리거 기준들을 표시하는트리거 구성을 상기 UE 에 송신하도록 구성되는, 기지국."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_44", "content": "제 39 항에 있어서,상기 메모리 및 상기 하나 이상의 프로세서들은 또한,랜덤 액세스 응답 (RAR) 메시지를 UE 에 송신하도록 구성되고,상기 RAR 메시지는:상기 RRC 접속 요청 메시지를 위한 PUSCH 리소스, 또는상기 RRC 접속 요청 메시지와 연관된 PUSCH 파라미터중 적어도 하나를 표시하는, 기지국."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_45", "content": "제 39 항에 있어서,상기 메모리 및 상기 하나 이상의 프로세서들은 또한, 상기 UE 에, PUSCH 반복 요청 승인의 표시를 송신하도록구성되고, 상기 PUSCH 반복 요청 승인은 상기 PUSCH 반복 요청의 적어도 부분에 대응하는, 기지국."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_46", "content": "제 45 항에 있어서,상기 PUSCH 반복 요청 승인의 표시는 랜덤 액세스 응답 (RAR) 메시지에서 반송되는, 기지국."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_47", "content": "사용자 장비 (UE) 에 의해 수행되는 무선 통신의 방법으로서,랜덤 액세스 채널 (RACH) 절차의 라디오 리소스 제어 (RRC) 접속 요청 메시지와 연관된 물리 업링크 공유 채널(PUSCH) 반복에 대한 요청을 기지국에 송신하는 단계; 및상기 PUSCH 반복에 대한 요청에 적어도 부분적으로 기초하여 상기 RRC 접속 요청 메시지와 연관된 적어도 하나의 PUSCH 반복을 송신하는 단계를 포함하는, 무선 통신의 방법."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_48", "content": "제 47 항에 있어서,상기 PUSCH 반복에 대한 요청을 송신하는 단계는, 상기 PUSCH 반복에 대한 요청을 표시하는 물리 RACH (PRACH)메시지를 송신하는 단계를 포함하는, 무선 통신의 방법."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_49", "content": "제 48 항에 있어서,상기 PUSCH 반복에 대한 요청을 송신하는 단계는 PRACH 프리앰블들의 세트의 PRACH 프리앰블들의 서브세트로부터 선택되는 PRACH 프리앰블을 송신하는 단계를 포함하고, 상기 서브세트는 상기 PUSCH 반복에 대한 요청을 표시하는, 무선 통신의 방법."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_50", "content": "제 48 항에 있어서,상기 PUSCH 반복에 대한 요청을 송신하는 단계는 RACH 어케이전(RO)들의 세트의 RO들의 서브세트를 사용하여 상공개특허 10-2023-0132782-9-기 PRACH 메시지를 송신하는 단계를 포함하고, 상기 RO들의 서브세트는 상기 PUSCH 반복에 대한 요청을 표시하는, 무선 통신의 방법."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_51", "content": "제 47 항에 있어서,하나 이상의 트리거 기준들이 충족되는 것을 결정하는 단계를 더 포함하고, 상기 PUSCH 반복에 대한 요청을 송신하는 단계는 상기 하나 이상의 트리거 기준들이 충족된다고 결정하는 것에 적어도 부분적으로 기초하여 상기PUSCH 반복에 대한 요청을 송신하는 단계를 포함하는, 무선 통신의 방법."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_52", "content": "제 51 항에 있어서,상기 하나 이상의 트리거 기준들은 제 1 레퍼런스 신호 수신 전력 (RSRP) 임계치를 포함하는, 무선 통신의방법."}
{"patent_id": "10-2023-7023438", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_53", "content": "제 47 항에 있어서,상기 기지국으로부터, PUSCH 반복 요청 승인의 표시를 수신하는 단계를 더 포함하고, 상기 PUSCH 반복 요청 승인은 상기 PUSCH 반복 요청의 적어도 부분에 대응하는, 무선 통신의 방법."}
{"patent_id": "10-2023-7023438", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 다양한 양태들은 일반적으로 무선 통신에 관한 것이다. 일부 양태들에서, 사용자 장비 (UE) 는 랜 덤 액세스 채널 (RACH) 절차의 라디오 리소스 제어 (RRC) 접속 요청 메시지와 연관된 물리 업링크 공유 채널 (PUSCH) 반복에 대한 요청을 기지국에 송신할 수도 있다. UE는 그 요청에 적어도 부분적으로 기초하여 RRC 접속 요청 메시지와 연관된 적어도 하나의 PUSCH 반복을 송신할 수도 있다. 많은 다른 양태들이 설명된다."}
{"patent_id": "10-2023-7023438", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "관련 출원들에 대한 상호 참조 이 특허 출원은 “REQUESTS FOR PHYSICAL UPLINK SHARED CHANNEL REPETITION ASSOCIATED WITH A RADIO RESOURCE CONTROL CONNECTION REQUEST MESSAGE IN A RANDOM ACCESS CHANNEL PROCEDURE” 라는 제목으로 2021 년 1월 15일자로 출원된 미국 가 특허 출원 제 63/138,210호, “COMMUNICATION OF PHYSICAL UPLINK SHARED CHANNEL REPETITION INFORMATION USING SPECIFIC FREQUENCY RESOURCES FOR A PHYSICAL RANDOM ACCESS CHANNEL MESSAGE” 라는 제목으로 2021년 1월 25일자로 출원된 미국 가 특허 출원 제 63/141,299 호, 및 “REQUESTS FOR PHYSICAL UPLINK SHARED CHANNEL REPETITION ASSOCIATED WITH A RADIO RESOURCE CONTROL CONNECTION REQUEST MESSAGE IN A RANDOM ACCESS CHANNEL PROCEDURE” 라는 제목으로 2021년 12월 29일자로 출원된 미국 비가 특허 출원 제 17/646,393 호에 대해 우선권을 주장하고, 이들은 이에 의해 본원에 원용에 의해 명시적으로 통합된다. 개시의 분야 본 개시의 양태들은 일반적으로 무선 통신에 관한 것이며, 랜덤 액세스 채널 절차에서 라디오 리소스 제어 접속 요청 메시지와 연관된 물리 업링크 공유 채널 반복을 위한 요청들을 위한 기술들 및 장치들에 관한 것이다."}
{"patent_id": "10-2023-7023438", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "배경 무선 통신 시스템들은 전화, 비디오, 데이터, 메시징, 및 브로드캐스트들과 같은 다양한 원격통신 서비스들을 제공하기 위해 널리 전개된다. 통상적인 무선 통신 시스템들은 이용가능한 시스템 리소스들 (예를 들어, 대 역폭, 송신 전력 등) 을 공유함으로써 다수의 사용자들과의 통신을 지원할 수 있는 다중-액세스 기술들을 채용 할 수도 있다. 그러한 다중 액세스 기술의 예들은 코드 분할 다중 액세스 (CDMA) 시스템들, 시간 분할 다중 액세스 (TDMA) 시스템들, 주파수 분할 다중 액세스 (FDMA) 시스템들, 직교 주파수 분할 다중 액세스 (OFDMA) 시 스템들, 단일-캐리어 주파수 분할 다중 액세스 (SC-FDMA) 시스템들, 시간 분할 동기식 코드 분할 다중 액세스 (TD-SCDMA) 시스템들, 및 롱 텀 에볼루션 (LTE) 을 포함한다. LTE/LTE-어드밴스드는 제 3 세대 파트너쉽 프 로젝트 (3GPP) 에 의해 공표된 유니버셜 모바일 원격통신 시스템 (UMTS) 모바일 표준에 대한 향상물들의 세트이 다.무선 네트워크는 다수의 사용자 장비 (UE들)에 대한 통신을 지원할 수 있는 다수의 기지국들 (BS들) 을 포함할 수도 있다. UE 는 다운링크 및 업링크를 통해 BS 와 통신할 수도 있다. \"다운링크\" (또는, \"순방향 링 크\")는 BS 로부터 UE로의 통신 링크를 지칭하며, \"업링크\" (또는, \"역방향 링크\")는 UE로부터 BS 로의 통신 링 크를 지칭한다. 본 명세서에서 더 상세히 설명될 바와 같이, BS는 노드 B, gNB, 액세스 포인트(AP), 라디오 헤드, 송수신 포인트(TRP), 뉴 라디오(NR) BS, 5G 노드 B 등으로 지칭될 수도 있다. 상기 다중 액세스 기술들은 상이한 사용자 장비가 도시, 국가, 지역 및 심지어 글로벌 레벨 상에서 통신할 수 있게 하는 공통 프로토콜을 제공하기 위해 다양한 통신 표준들에서 채택되었다. 5G 로서 또한 지칭될 수도 있는 NR 은 3GPP 에 의해 공포된 LTE 모바일 표준에 대한 향상물들의 세트이다. NR 은, 빔포밍, 다중입력 다중출력 (MIMO) 안테나 기술, 및 캐리어 집성을 지원할 뿐 아니라 다운링크 (DL) 상에서 사이클릭 프리픽스 (CP) 를 갖는 직교 주파수 분할 멀티플렉싱 (OFDM) (CP-OFDM) 을 이용하여, 업링크 (UL) 상에서 CP-OFDM 및/또 는 SC-FDM (예컨대, 이산 푸리에 변환 확산 OFDM (DFT-s-OFDM) 으로서도 또한 공지됨) 을 이용하여 스펙트럼 효 율을 개선하는 것, 비용을 저감시키는 것, 서비스들을 개선하는 것, 새로운 스펙트럼을 이용하는 것, 및 다른 공개 표준들과 더 우수하게 통합하는 것에 의해 모바일 브로드밴드 인터넷 액세스를 더 우수하게 지원하도록 설 계된다. 모바일 브로드밴드 액세스에 대한 수요가 계속 증가함에 따라, LTE, NR, 및 다른 라디오 액세스 기 술들에서의 추가적인 개선들이 유용한 채로 남겨진다. 개요 일부 양태들에서, 무선 통신을 위한 사용자 장비 (user equipment; UE) 는 메모리; 및 상기 메모리에 커플링된 하나 이상의 프로세서들을 포함하고, 상기 하나 이상의 프로세서들은, 랜덤 액세스 채널 (random access channel; RACH) 절차의 라디오 리소스 제어 (radio resource control; RRC) 접속 요청 메시지와 연관된 물리 업링크 공유 채널 (physical uplink shared channel; PUSCH) 반복에 대한 요청을 기지국에 송신하고; 그리고 상기 요청에 적어도 부분적으로 기초하여 상기 RRC 접속 요청 메시지와 연관된 적어도 하나의 PUSCH 반복을 송 신하도록 구성된다. 일부 양태들에서, 무선 통신을 위한 기지국은 메모리; 및 상기 메모리에 커플링된 하나 이상의 프로세서들을 포 함하고, 상기 하나 이상의 프로세서들은, UE 로부터, RACH 절차의 RRC 접속 요청 메시지와 연관된 PUSCH 반복에 대한 요청을 수신하고; 그리고 상기 요청에 적어도 부분적으로 기초하여 상기 RRC 접속 요청 메시지와 연관된 적어도 하나의 PUSCH 반복을 수신하도록 구성된다. 일부 양태들에서, UE에 의해 수행되는 무선 통신의 방법은 RACH 절차의 RRC 접속 요청 메시지와 연관된 PUSCH 반복에 대한 요청을 기지국에 송신하는 단계; 및 그 요청에 적어도 부분적으로 기초하여 RRC 접속 요청 메시지 와 연관된 적어도 하나의 PUSCH 반복을 송신하는 단계를 포함한다. 일부 양태들에서, 기지국에 의해 수행되는 무선 통신의 방법은 UE 로부터, RACH 절차의 RRC 접속 요청 메시지와 연관된 PUSCH 반복에 대한 요청을 수신하는 단계; 및 그 요청에 적어도 부분적으로 기초하여 RRC 접속 요청 메 시지와 연관된 적어도 하나의 PUSCH 반복을 수신하는 단계를 포함한다. 일부 양태들에서, 무선 통신을 위한 명령들의 세트를 저장하는 비일시적 컴퓨터 판독가능 매체는 UE 의 하나 이 상의 프로세서들에 의해 실행될 때, UE 로 하여금, RACH 절차의 RRC 접속 요청 메시지와 연관된 PUSCH 반복에 대한 요청을 기지국에 송신하게 하고; 그리고 그 요청에 적어도 부분적으로 기초하여 RRC 접속 요청 메시지와 연관된 적어도 하나의 PUSCH 반복을 송신하게 하는 하나 이상의 명령들을 포함한다. 일부 양태들에서, 무선 통신을 위한 명령들의 세트를 저장하는 비일시적 컴퓨터 판독가능 매체는 기지국의 하나 이상의 프로세서들에 의해 실행될 때, 기지국으로 하여금, UE 로부터, RACH 절차의 RRC 접속 요청 메시지와 연 관된 PUSCH 반복에 대한 요청을 수신하게 하고; 그리고 요청에 적어도 부분적으로 기초하여 RRC 접속 요청 메시 지와 연관된 적어도 하나의 PUSCH 반복을 수신하게 하는 하나 이상의 명령들을 포함한다. 일부 양태들에서, 무선 통신을 위한 장치는 RACH 절차의 RRC 접속 요청 메시지와 연관된 PUSCH 반복에 대한 요 청을 기지국에 송신하기 위한 수단; 및 상기 요청에 적어도 부분적으로 기초하여 상기 RRC 접속 요청 메시지와 연관된 적어도 하나의 PUSCH 반복을 송신하기 위한 수단을 포함한다. 일부 양태들에서, 무선 통신을 위한 장치는 UE 로부터, RACH 절차의 RRC 접속 요청 메시지와 연관된 PUSCH 반복 에 대한 요청을 수신하기 위한 수단; 및 상기 요청에 적어도 부분적으로 기초하여 상기 RRC 접속 요청 메시지와연관된 적어도 하나의 PUSCH 반복을 수신하기 위한 수단을 포함한다. 본 명세서에 설명된 일부 양태들은 무선 통신을 위한 UE에 관한 것이다. 사용자 장비는 메모리 및 메모리에 커플링된 하나 이상의 프로세서들을 포함할 수도 있다. 하나 이상의 프로세서들은 기지국에, 그리고 하나 이상의 트리거 기준들이 충족된다는 결정에 적어도 부분적으로 기초하여, RACH 절차의 RRC 접속 요청 메시지와 연관된 PUSCH 반복에 대한 요청을 포함하는 PRACH 메시지를 송신하도록 구성될 수도 있고, 하나 이상의 트리거 기준들은 레퍼런스 신호 수신 전력 임계치를 포함한다. 하나 이상의 프로세서들은 요청에 적어도 부분적으 로 기초하여 RRC 접속 요청 메시지와 연관된 적어도 하나의 PUSCH 반복을 송신하도록 구성될 수도 있다. 본 명세서에 설명된 일부 양태들은 무선 통신을 위한 UE에 관한 것이다. 사용자 장비는 메모리 및 메모리에 커플링된 하나 이상의 프로세서들을 포함할 수도 있다. 하나 이상의 프로세서들은 기지국에, 그리고 하나 이상의 트리거 기준들이 충족된다는 결정에 적어도 부분적으로 기초하여, RACH 절차의 RRC 접속 요청 메시지와 연관된 PUSCH 반복에 대한 요청을 포함하는 PRACH 메시지를 송신하도록 구성될 수도 있고, 하나 이상의 트리거 기준들은 레퍼런스 신호 수신 전력 임계치를 포함한다. 하나 이상의 프로세서들은 기지국으로부터, PUSCH 반복 요청 승인의 표시를 수신하도록 구성될 수도 있고, PUSCH 반복 요청 승인은 PUSCH 반복 요청의 적어도 부 분에 대응한다. 하나 이상의 프로세서들은 요청에 적어도 부분적으로 기초하여 RRC 접속 요청 메시지와 연 관된 적어도 하나의 PUSCH 반복을 송신하도록 구성될 수도 있다. 본 명세서에 설명된 일부 양태들은 무선 통신을 위한 기지국에 관한 것이다. 기지국은 메모리 및 메모리에 커플링된 하나 이상의 프로세서들을 포함할 수도 있다. 하나 이상의 프로세서들은 UE 로부터, RACH 절차의 RRC 접속 요청 메시지와 연관된 PUSCH 반복에 대한 요청을 수신하도록 구성될 수도 있다. 하나 이상의 프로 세서들은 요청에 적어도 부분적으로 기초하여 RRC 접속 요청 메시지와 연관된 적어도 하나의 PUSCH 반복을 수신 하도록 구성될 수도 있다. 본 명세서에 기술된 일부 양태들은 UE에 의한 무선 통신 방법에 관한 것이다. 방법은 PRACH 송신을 위한 하 나 이상의 대체 주파수 리소스들을 결정하는 단계를 포함할 수도 있고, 여기서, 하나 이상의 대체 주파수 리소 스들(alternate frequency resources)의 사용은 PUSCH 반복 정보를 통신한다. 방법은 PUSCH 반복 정보를 통신하기 위해 하나 이상의 대체 주파수 리소스들을 사용하여 PRACH 메시지를 기지국에 송신하는 단계를 포함할 수도 있다. 본 명세서에 설명된 일부 양태들은 기지국에 의한 무선 통신의 방법에 관한 것이다. 그 방법은 UE 로부터, PRACH 송신을 위한 하나 이상의 대체 주파수 리소스들을 사용하여 PRACH 메시지를 수신하는 단계를 포함할 수도 있다. 방법은 PRACH 메시지를 수신하기 위해 사용된 하나 이상의 대체 주파수 리소스들에 기초하여 PUSCH 반복 정보를 결정하는 단계를 포함할 수도 있고, 여기서 하나 이상의 대체 주파수 리소스들의 사용은 PUSCH 반 복 정보를 통신한다. 본 명세서에 설명된 일부 양태들은 무선 통신을 위한 UE에 관한 것이다. 사용자 장비는 메모리 및 메모리에 커플링된 하나 이상의 프로세서들을 포함할 수도 있다. 하나 이상의 프로세서들은 PRACH 송신을 위한 하나 이상의 대체 주파수 리소스들을 결정하도록 구성될 수도 있고, 여기서 하나 이상의 대체 주파수 리소스들의 사 용은 PUSCH 반복 정보를 통신한다. 하나 이상의 프로세서들은 PUSCH 반복 정보를 통신하기 위해 하나 이상 의 대체 주파수 리소스들을 사용하여 PRACH 메시지를 기지국에 송신하도록 구성될 수도 있다. 본 명세서에 설명된 일부 양태들은 무선 통신을 위한 기지국에 관한 것이다. 기지국은 메모리 및 메모리에 커플링된 하나 이상의 프로세서들을 포함할 수도 있다. 하나 이상의 프로세서들은 UE 로부터, PRACH 송신을 위한 하나 이상의 대체 주파수 리소스들을 사용하여 PRACH 메시지를 수신하도록 구성될 수도 있다. 하나 이 상의 프로세서들은 PRACH 메시지를 수신하는데 사용되는 하나 이상의 대체 주파수 리소스들에 기초하여 PUSCH 반복 정보를 결정하도록 구성될 수도 있고, 여기서 하나 이상의 대체 주파수 리소스들의 사용은 PUSCH 반복 정 보를 통신한다. 본 명세서에 설명된 일부 양태들은 UE에 의한 무선 통신을 위한 명령들의 세트를 저장하는 비일시적 컴퓨터 판 독가능 매체에 관한 것이다. 명령들의 세트는, UE의 하나 이상의 프로세서들에 의해 실행될 때, UE로 하여 금 PRACH 송신을 위한 하나 이상의 대체 주파수 리소스들을 결정하게 할 수도 있고, 여기서 하나 이상의 대체 주파수 리소스들의 사용은 PUSCH 반복 정보를 통신한다. 명령들의 세트는, UE의 하나 이상의 프로세서들에 의해 실행될 때, UE로 하여금, PUSCH 반복 정보를 통신하기 위해 하나 이상의 대체 주파수 리소스들을 사용하여 PRACH 메시지를 기지국에 송신하게 할 수도 있다.본 명세서에 설명된 일부 양태들은 기지국에 의한 무선 통신을 위한 명령들의 세트를 저장하는 비일시적 컴퓨터 판독가능 매체에 관한 것이다. 명령들의 세트는, 기지국의 하나 이상의 프로세서들에 의해 실행될 경우, 기 지국으로 하여금, UE로부터, PRACH 송신을 위한 하나 이상의 대체 주파수 리소스들을 사용하여 PRACH 메시지를 수신하게 할 수도 있다. 명령들의 세트는, 기지국의 하나 이상의 프로세서들에 의해 실행될 경우, 기지국으 로 하여금 PRACH 메시지를 수신하기 위해 사용된 하나 이상의 대체 주파수 리소스들에 기초하여 PUSCH 반복 정 보를 결정하게 할 수도 있고, 여기서 하나 이상의 대체 주파수 리소스들의 사용은 PUSCH 반복 정보를 통신한다. 본 명세서에 기술된 일부 양태들은 무선 통신을 위한 장치에 관한 것이다. 장치는 PRACH 송신을 위한 하나 이상의 대체 주파수 리소스들을 결정하기 위한 수단을 포함할 수도 있고, 여기서, 하나 이상의 대체 주파수 리 소스들의 사용은 PUSCH 반복 정보를 통신한다. 장치는 PUSCH 반복 정보를 통신하기 위해 하나 이상의 대체 주파수 리소스들을 사용하여 PRACH 메시지를 기지국에 송신하기 위한 수단을 포함할 수도 있다. 본 명세서에 기술된 일부 양태들은 무선 통신을 위한 장치에 관한 것이다. 장치는 UE 로부터, PRACH 송신을 위한 하나 이상의 대체 주파수 리소스들을 사용하여 PRACH 메시지를 수신하기 위한 수단을 포함할 수도 있다. 장치는 PRACH 메시지를 수신하기 위해 사용된 하나 이상의 대체 주파수 리소스들에 기초하여 PUSCH 반복 정 보를 결정하기 위한 수단을 포함할 수도 있고, 여기서 하나 이상의 대체 주파수 리소스들의 사용은 PUSCH 반복 정보를 통신한다. 양태들은 일반적으로, 도면들 및 명세서를 참조하여 본 명세서에서 실질적으로 설명되고 도면들 및 명세서에 의 해 예시된 바와 같은 방법, 장치, 시스템, 컴퓨터 프로그램 제품, 비일시적 컴퓨터 판독가능 매체, 사용자 장비, 기지국, 무선 통신 디바이스, 및/또는 프로세싱 시스템을 포함한다. 전술한 내용은 다음의 상세한 설명이 더 잘 이해될 수도 있도록 본 개시에 따른 예들의 특징들 및 기술적 이점 들을 다소 광범위하게 개괄하였다. 추가적인 특징들 및 이점들이 이하에 설명될 것이다. 개시된 개념 및 특정 예들은 본 개시의 동일한 목적들을 수행하기 위해 다른 구조들을 수정 또는 설계하기 위한 기초로서 용 이하게 활용될 수도 있다. 이러한 등가의 구성들은 첨부된 청구항들의 범위로부터 벗어나지 않는다. 연 관된 이점들과 함께, 본 명세서에서 개시된 개념들의 특성들, 그 구성 및 동작 방법 양자 모두는 첨부 도면들과 관련하여 고려될 때 다음의 설명으로부터 더 잘 이해될 것이다. 도면들 각각은, 청구항들의 제한들에 대한 정의로서가 아니라, 예시 및 설명의 목적으로 제공된다. 양태들이 일부 예들에 대한 예시로 본 개시에서 설명되지만, 당업자는 이러한 양태들이 많은 상이한 배열들 및 시나리오들로 구현될 수도 있다는 것을 이해할 것이다. 본 명세서에 설명된 기법들은 상이한 플랫폼 타입들, 디바이스들, 시스템들, 형상들, 사이즈들, 패키징 배열들을 사용하여 구현될 수도 있다. 예를 들어, 일부 양태들은 집적 칩 실시형태들 및 다른 비-모듈-컴포넌트 기반 디바이스들 (예를 들어, 최종-사용자 디바이스들, 차량들, 통신 디바이스들, 컴퓨팅 디바이스들, 산업 장비, 소매/구매 디바이스들, 의료 디바이스들, 또는 인공 지능 가능 디바이스들) 을 통해 구현될 수도 있다. 양태들은 칩-레벨 컴포넌트들, 모듈형 컴포넌트들, 비-모 듈형 컴포넌트들, 비-칩-레벨 컴포넌트들, 디바이스-레벨 컴포넌트들, 또는 시스템-레벨 컴포넌트들에서 구현될 수도 있다. 설명된 양태들 및 특징들을 통합한 디바이스들은 청구되고 설명된 양태들의 구현 및 실시를 위 해 부가적인 컴포넌트들 및 특징들을 포함할 수도 있다. 예를 들어, 무선 신호들의 송신 및 수신은 아날로그 및 디지털 목적들을 위한 다수의 컴포넌트들(예를 들어, 안테나들, 라디오 주파수 (RF) 체인들, 전력 증폭기들, 변조기들, 버퍼들, 프로세서(들), 인터리버들, 가산기들, 또는 합산기들을 포함하는 하드웨어 컴포넌트들)을 포 함할 수도 있다. 본 명세서에서 설명된 양태들은 가변하는 사이즈, 형상 및 구성의 광범위한 디바이스들, 컴 포넌트들, 시스템들, 분포된 배열들, 최종 사용자 디바이스들에서 실시될 수도 있음이 의도된다."}
{"patent_id": "10-2023-7023438", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "상세한 설명 본 개시의 다양한 양태들이 첨부 도면들을 참조하여 아래에서 더 완전히 설명된다. 하지만, 본 개시는 많은 상이한 형태들로 구현될 수도 있고, 본 개시에 걸쳐 제시된 임의의 특정 구조 또는 기능으로 제한된다고 해석되 어서는 안 된다. 오히려, 이들 양태들은 본 개시가 철저하고 완전하게 되고, 그리고 본 개시의 범위를 당업 자에게 충분히 전달하도록 제공된다. 본 명세서에서의 교시들에 기초하여, 당업자는, 본 개시의 임의의 다 른 양태와는 독립적으로 구현되든 임의의 다른 양태와 결합되든, 본 개시의 범위가 본 명세서에서 개시된 본 개 시의 임의의 양태를 커버하도록 의도됨을 인식할 것이다. 예를 들어, 본 명세서에 제시된 임의의 수의 양태 들을 사용하여 장치가 구현될 수도 있거나 또는 방법이 실시될 수도 있다. 추가로, 본 개시의 범위는 본 명 세서에 기재된 본 개시의 다양한 양태들에 더하여 또는 그 외에 다른 구조, 기능, 또는 구조 및 기능을 사용하 여 실시되는 그러한 장치 또는 방법을 커버하도록 의도된다. 본 명세서에서 개시된 본 개시의 임의의 양태 는 청구항의 하나 이상의 엘리먼트들에 의해 구현될 수도 있음이 이해되어야 한다. 전기통신 시스템들의 몇몇 양태들은 이제 다양한 장치들 및 기법들을 참조하여 제시될 것이다. 이들 장치들 및 기법들은 다음의 상세한 설명에서 설명되고, 다양한 블록들, 모듈들, 컴포넌트들, 회로들, 단계들, 프로세스 들, 알고리즘들 등 (총괄적으로, \"엘리먼트들\" 로서 지칭됨) 에 의해 첨부 도면들에 예시될 것이다. 이들 엘리먼트들은 하드웨어, 소프트웨어, 또는 그 조합들을 사용하여 구현될 수도 있다. 그러한 엘리먼트들이 하드웨어로 구현될지 또는 소프트웨어로 구현될지 여부는, 전체 시스템에 부과된 특정 애플리케이션 및 설계 제 약에 의존한다. 양태들이 5G 또는 NR 라디오 액세스 기술(RAT)과 공통으로 연관된 용어를 사용하여 본 명세서에서 설명될 수도 있지만, 본 개시의 양태들은 3G RAT, 4G RAT, 및/또는 5G에 후속하는 RAT(예컨대, 6G)와 같은 다른 RAT들에 적 용될 수 있다는 점에 유의해야 한다. 도 1은 본 개시에 따른, 무선 네트워크의 예를 예시하는 다이어그램이다. 무선 네트워크 는, 다 른 예들 중에서, 5G (NR) 네트워크 및/또는 LTE 네트워크의 엘리먼트들일 수도 있거나 또는 이들을 포함할 수도 있다. 무선 네트워크 는 (BS (110a), BS (110b), BS (110c), 및 BS (110d) 로서 도시된) 다수의 기 지국들 및 다른 네트워크 엔티티들을 포함할 수도 있다. 기지국 (BS) 은 사용자 장비 (UE들) 와 통신 하는 엔티티이고, 또한, NR BS, 노드 B, gNB, 5G 노드 B (NB), 액세스 포인트, 송신 수신 포인트 (TRP) 등으로 서 지칭될 수도 있다. 각각의 BS 는 특정 지리적 영역에 대한 통신 커버리지를 제공할 수도 있다. 3GPP 에서, 용어 \"셀\" 은, 그 용어가 사용되는 맥락에 의존하여, BS 의 커버리지 영역 및/또는 이 커버리지 영역을 서빙 (serving) 하는 BS 서브시스템을 지칭할 수 있다. BS는 매크로 셀, 피코 셀, 펨토 셀, 및/또는 다른 타입의 셀에 대한 통신 커버리지를 제공할 수도 있다. 매 크로 셀은 상대적으로 큰 지리적 영역 (예를 들어, 반경이 수 킬로미터임) 을 커버할 수도 있고, 서비스 가입을 갖는 UE들에 의한 제한없는 액세스를 허용할 수도 있다. 피코 셀은 상대적으로 작은 지리적 영역을 커버할 수도 있고, 서비스 가입을 갖는 UE들에 의한 제한없는 액세스를 허용할 수도 있다. 펨토 셀은, 상대적으로 작은 지리적 영역 (예를 들어, 홈) 을 커버할 수도 있고, 펨토 셀과 연관을 갖는 UE들 (예를 들어, 폐쇄 가입자 그룹 (CSG) 에 있는 UE들) 에 의한 제한적 액세스를 허용할 수도 있다. 매크로 셀에 대한 BS 는 매크로 BS 로 지칭될 수도 있다. 피코 셀에 대한 BS 는 피코 BS 로 지칭될 수도 있다. 펨토 셀에 대한 BS 는 펨토 BS 또는 홈 BS 로 지칭될 수도 있다. 도 1 에 도시된 예에서, BS (110a) 는 매크로 셀 (102a) 을 위한 매 크로 BS 일 수도 있고, BS (110b) 는 피코 셀 (102b) 을 위한 피코 BS 일 수도 있고, BS (110c) 는 펨토 셀(102c) 을 위한 펨토 BS 일 수도 있다. BS 는 하나 또는 다중 (예를 들어, 3 개) 셀들을 지원할 수도 있다. \"eNB\", \"기지국\", \"NR BS\", \"gNB\", \"TRP\", \"AP\", \"노드 B\", \"5G NB” 및 \"셀\"이라는 용어는 본 명세서에서 상호교환가능하게 사용될 수도 있다. 일부 양태들에서, 셀은 반드시 정지형일 필요는 없으며, 셀의 지리적 영역은 모바일 BS의 위치에 따라 이동할 수도 있다. 일부 양태들에서, BS들은 임의의 적합한 전송 네트워크를 이용하여, 직접 물리 커넥션 또는 가 상 네트워크와 같은 다양한 타입들의 백홀 인터페이스들을 통해 무선 네트워크 에서의 하나 이상의 다른 BS들 또는 네트워크 노드들 (도시 안됨) 에 및/또는 서로에 상호연결될 수도 있다. 무선 네트워크는 또한 중계국들을 포함할 수도 있다. 중계국은 업스트림 스테이션 (예를 들어, BS 또 는 UE) 로부터 데이터의 송신을 수신하고 다운스트림 스테이션 (예를 들어, UE 또는 BS) 으로 그 데이터의 송신 을 전송할 수 있는 엔티티이다. 중계국은 또한, 다른 UE들에 대한 송신들을 릴레이할 수 있는 UE 일 수도 있다. 도 1 에 나타낸 예에서, 릴레이 BS (110d) 는 매크로 BS (110a) 및 UE (120d) 와, BS (110a) 와 UE (120d) 사이의 통신을 용이하게 하기 위해 통신할 수도 있다 릴레이 BS 는 또한, 중계국, 릴레이 기지국, 릴레 이 등등으로서 지칭될 수도 있다. 무선 네트워크는 매크로 BS들, 피코 BS들, 펨토 BS들, 릴레이 BS들 등과 같은 상이한 타입들의 BS들을 포 함하는 이종 네트워크일 수도 있다. 이들 상이한 타입들의 BS 는 상이한 송신 전력 레벨들, 상이한 커버리 지 영역들, 및 무선 네트워크 에서의 간섭에 대한 상이한 영향들을 가질 수도 있다. 예를 들어, 매크 로 BS들은 높은 송신 전력 레벨 (예컨대, 5 내지 40 와트) 을 가질 수도 있는 반면, 피코 BS들, 펨토 BS들, 및 릴레이 BS들은 더 낮은 송신 전력 레벨들 (예컨대, 0.1 내지 2 와트) 을 가질 수도 있다. 네트워크 제어기 는 BS들의 세트에 커플링될 수도 있고, 이들 BS들에 대한 조정 및 제어를 제공할 수도 있다. 네트워크 제어기 는 백홀 (backhaul) 을 통해 BS들과 통신할 수도 있다. BS들은 또한 무선 또는 유선 백홀을 통해, 간접적으로 또는 직접적으로, 서로 통신할 수도 있다. UE들(예를 들어, 120a, 120b, 120c)은 무선 네트워크 전체에 걸쳐 분산될 수도 있고, 각각의 UE는 고정식 또는 이동식일 수도 있다. UE 는 또한, 액세스 단말기, 단말기, 이동국, 가입자 유닛, 스테이션 등 등으로서 지칭될 수도 있다. UE 는 셀룰러 폰 (예컨대, 스마트 폰), 개인용 디지털 보조기 (PDA), 무선 모 뎀, 무선 통신 디바이스, 핸드헬드 디바이스, 랩탑 컴퓨터, 코드리스 폰, 무선 로컬 루프 (WLL) 스테이션, 태블 릿, 카메라, 게이밍 디바이스, 넷북, 스마트북, 울트라북, 의료용 디바이스 또는 장비, 생체인식 센서들/디바이 스들, 웨어러블 디바이스들 (스마트 시계들, 스마트 의류, 스마트 안경, 스마트 손목 밴드들, 스마트 보석 (예 컨대, 스마트 반지, 스마트 팔찌)), 엔터테인먼트 디바이스 (예컨대, 뮤직 또는 비디오 디바이스, 또는 위성 라 디오), 차량용 컴포넌트 또는 센서, 스마트 미터들/센서들, 산업용 제조 장비, 글로벌 포지셔닝 시스템 디바이 스, 또는 무선 또는 유선 매체를 통해 통신하도록 구성된 임의의 다른 적합한 디바이스일 수도 있다. 일부 UE들은 머신 타입 통신(MTC) 또는 진화된 또는 향상된 머신 타입 통신(eMTC) UE들로 간주될 수도 있다. MTC 및 eMTC UE들은, 예를 들어, 기지국, 다른 디바이스 (예컨대, 원격 디바이스), 또는 일부 다른 엔티티와 통신할 수도 있는 로봇들, 드론들, 원격 디바이스들, 센서들, 미터들, 모니터들, 및/또는 위치 태그들을 포함한 다. 무선 노드는, 예를 들어, 유선 또는 무선 통신 링크를 통해 네트워크 (예컨대, 인터넷과 같은 광역 네 트워크 또는 셀룰러 네트워크) 에 대한 또는 네트워크로의 접속을 제공할 수도 있다. 일부 UE들은 사물 인 터넷 (IoT) 디바이스들로 고려될 수도 있고, 및/또는 NB-IoT (협대역 사물 인터넷) 디바이스들로서 구현될 수도 있다. 일부 UE들은 CPE (Customer Premises Equipment) 로 고려될 수도 있다. UE 는, 프로세서 컴포넌트들 및/또는 메모리 컴포넌트들과 같은 UE 의 컴포넌트들을 하우징하는 하우징 내부에 포함될 수 도 있다. 일부 양태들에 있어서, 프로세서 컴포넌트들 및 메모리 컴포넌트들은 함께 커플링될 수도 있다. 예를 들어, 프로세서 컴포넌트들 (예를 들어, 하나 이상의 프로세서) 및 메모리 컴포넌트들 (예를 들어, 메모리) 은 동작가능하게 커플링되고, 통신가능하게 커플링되고, 전자적으로 커플링되고, 및/또는 전기적으로 커플링될 수도 있다. 일반적으로, 임의의 수의 무선 네트워크들이 주어진 지리적 영역에 배치될 수도 있다. 각각의 무선 네트워 크는 특정 RAT 를 지원할 수도 있고, 하나 이상의 주파수들 상에서 동작할 수도 있다. RAT는 또한 무선 기 술, 에어 인터페이스 등으로 지칭될 수도 있다. 주파수는 또한 캐리어, 주파수 채널 등으로 지칭될 수도 있 다. 각각의 주파수는 상이한 RAT들의 무선 네트워크들 간의 간섭을 회피하기 위해 주어진 지리적 영역에서 단일 RAT를 지원할 수도 있다. 일부 경우에서, NR 또는 5G RAT 네트워크가 배치될 수도 있다.일부 양태들에서, (예를 들어, UE (120a) 및 UE (120e) 로서 도시된) 2 개 이상의 UE들 은 (예를 들어, 서로 통신하기 위해 중개자로서 기지국 을 사용하지 않고) 하나 이상의 사이드링크 채널들을 사용하여 직 접 통신할 수도 있다. 예를 들어, UE들 은 피어-투-피어 (P2P) 통신, 디바이스-대-디바이스 (D2D) 통 신, 차량 대 만물 (V2X) 프로토콜 (예컨대, 차량 대 차량 (V2V) 프로토콜 또는 차량 대 인프라구조 (V2I) 프로 토콜을 포함할 수도 있음), 및/또는 메쉬 네트워크를 사용하여 통신할 수도 있다. 이 경우, UE 는, 기지국 에 의해 수행되는 것으로서 본 명세서의 다른 곳에서 기술된 스케줄링 동작들, 리소스 선택 동작 들, 및/또는 다른 동작들을 수행할 수도 있다. 무선 네트워크의 디바이스들은 주파수 또는 파장에 기초하여 다양한 클래스들, 대역들, 채널들 등으로 세 분될 수도 있는 전자기 스펙트럼을 사용하여 통신할 수도 있다. 예를 들어, 무선 네트워크 의 디바이 스들은 410 MHz 내지 7.125 GHz 에 걸쳐 있을 수도 있는 제 1 주파수 범위 (FR1) 를 갖는 동작 대역을 사용하여 통신할 수도 있고/있거나, 24.25 GHz 내지 52.6 GHz 에 걸쳐 있을 수도 있는 제 2 주파수 범위 (FR2) 를 갖는 동작 대역을 사용하여 통신할 수도 있다. FR1 과 FR2 사이의 주파수들은 때때로, 중간-대역 (mid-band) 주 파수들로서 지칭된다. FR1 의 일부분은 6 GHz 보다 크지만, FR1 은 종종 \"서브 (sub)-6 GHz\" 대역으로서 지 칭된다. 유사하게, FR2 는 \"밀리미터파\" 대역으로서 국제 원격통신 연합 (ITU) 에 의해 식별되는 EHF (extremely high frequency) 대역 (30 GHz - 300 GHz) 과는 상이함에도 불구하고 \"밀리미터파\" 대역으로서 종 종 지칭된다. 따라서, 달리 구체적으로 서술되지 않으면, 용어 \"서브-6 GHz\" 등은, 본 명세서에서 사용되는 경우, 6 GHz 미만의 주파수들, FR1 내의 주파수들, 및/또는 중간-대역 주파수들 (예컨대, 7.125 GHz 초과) 을 광범위하게 나타낼 수도 있음이 이해되어야 한다. 유사하게, 달리 구체적으로 서술되지 않으면, 용어 \"밀리 미터파\" 등은, 본 명세서에서 사용되는 경우, EHF 대역 내의 주파수들, FR2 내의 주파수들, 및/또는 중간-대역 주파수들 (예컨대, 24.25 GHz 미만) 을 광범위하게 나타낼 수도 있음이 이해되어야 한다. FR1 및 FR2 에 포 함된 주파수들은 수정될 수도 있고, 본 명세서에서 설명된 기법들은 이들 수정된 주파수 범위들에 적용가능함이 고려된다. 전술한 바와 같이, 도 1은 예로서 제공된다. 다른 예들은 도 1 과 관련하여 설명되었던 것과는 상이할 수도 있다. 도 2 는 본 개시에 따른, 무선 네트워크 에서 UE 와 통신하는 기지국 의 일 예 를 예시 하는 다이어그램이다. 기지국 에는 T개의 안테나들 (234a 내지 234t) 이 장착될 수도 있고, UE 에는 R개의 안테나들 (252a 내지 252r) 이 장착될 수도 있으며, 여기서, 일반적으로, T≥1 이고 R≥1 이다. 기지국 에서, 송신 프로세서 는 하나 이상의 UE들에 대한 데이터를 데이터 소스 로부터 수신 하고, UE 로부터 수신된 채널 품질 표시자들 (CQI들)에 적어도 부분적으로 기초하여 각각의 UE에 대한 하나 이 상의 변조 및 코딩 방식들 (MCS) 을 선택하고, UE에 대해 선택된 MCS(들)에 적어도 부분적으로 기초하여 각각의 UE에 대한 데이터를 프로세싱 (예를 들어, 인코딩 및 변조) 하고, 모든 UE들에 대한 데이터 심볼들을 제공할 수 도 있다. 송신 프로세서 는 또한, (예컨대, 준정적 리소스 파티셔닝 정보 (SRPI) 에 대한) 시스템 정 보 및 제어 정보 (예컨대, CQI 요청들, 승인(grant)들, 및/또는 상위 계층 시그널링) 를 프로세싱하고 오버헤드 심볼들 및 제어 심볼들을 제공할 수도 있다. 송신 프로세서 는 또한, 레퍼런스 신호들 (예컨대, 셀 특정 레퍼런스 신호 (CRS) 또는 복조 레퍼런스 신호 (DMRS)) 및 동기화 신호들 (예컨대, 프라이머리 동기화 신 호 (PSS) 또는 세컨더리 동기화 신호 (SSS)) 에 대한 레퍼런스 심볼들을 생성할 수도 있다. 송신 (TX) 다중 입력 다중출력 (MIMO) 프로세서 는, 적용가능하다면, 데이터 심볼들, 제어 심볼들, 오버헤드 심볼들, 및/ 또는 레퍼런스 심볼들에 대한 공간 프로세싱 (예컨대, 프리코딩) 을 수행할 수도 있고, T개의 출력 심볼 스트림 들을 T개의 변조기들 (MOD들) (232a 내지 232t) 에 제공할 수도 있다. 각각의 변조기 는 (예컨대, OFDM 에 대해) 개별 출력 심볼 스트림을 프로세싱하여 출력 샘플 스트림을 획득할 수도 있다. 각각의 변조 기 는 출력 샘플 스트림을 추가로 프로세싱 (예를 들어, 아날로그로 컨버팅, 증폭, 필터링, 및 상향변환) 하여 다운링크 신호를 획득할 수도 있다. 변조기들 (232a 내지 232t) 로부터의 T개의 다운링크 신호는 T개 의 안테나 (234a 내지 234t) 를 통해 각각 송신될 수도 있다. UE 에서, 안테나들 (252a 내지 252r) 은 기지국 및/또는 다른 기지국들로부터 다운링크 신호들을 수 신할 수도 있고, 수신된 신호들을 복조기들 (DEMOD들) (254a 내지 254r)에 각각 제공할 수도 있다. 각각의 복조기 는 수신된 신호를 컨디셔닝 (예를 들어, 필터링, 증폭, 다운컨버팅, 및 디지털화) 하여 입력 샘플 들을 획득할 수도 있다. 각각의 복조기 는 추가로 (예를 들어, OFDM 에 대해) 입력 샘플들을 프로세 싱하여 수신된 심볼들을 획득할 수도 있다. MIMO 검출기 는 모두 R개의 복조기들 (254a 내지 254r) 로부터의 수신된 심볼들을 획득하고, 적용 가능하다면, 수신된 심볼들에 대한 MIMO 검출을 수행하며, 검출된 심볼들을 제공할 수도 있다. 수신 프로세서 는 검출된 심볼들을 프로세싱 (예컨대, 복조 및 디코딩) 하 고, UE 에 대한 디코딩된 데이터를 데이터 싱크 에 제공하고, 디코딩된 제어 정보 및 시스템 정보 를 제어기/프로세서 에 제공할 수도 있다. 용어 \"제어기/프로세서” 는 하나 이상의 제어기들, 하나 이상의 프로세서들, 또는 이들의 조합을 지칭할 수도 있다. 채널 프로세서는 다른 예들 중에서도, 레퍼런스 신호 수신 전력 (RSRP) 파라미터, 수신 신호 강도 표시자 (RSSI) 파라미터, 레퍼런스 신호 수신 품질 (RSRQ) 파 라미터, 및/또는 CQI 파라미터를 결정할 수도 있다. 일부 양태들에 있어서, UE 의 하나 이상의 컴포 넌트들이 하우징 에 포함될 수도 있다. 네트워크 제어기는 통신 유닛, 제어기/프로세서 및 메모리를 포함할 수도 있다. 네트 워크 제어기 는 예를 들어, 코어 네트워크에서의 하나 이상의 디바이스들을 포함할 수도 있다. 네트 워크 제어기 는 통신 유닛 을 통해 기지국 과 통신할 수도 있다. 안테나들(예를 들어, 안테나들(234a 내지 234t) 및/또는 안테나들(252a 내지 252r))은, 다른 예들 중에서도, 하 나 이상의 안테나 패널들, 안테나 그룹들, 안테나 엘리먼트들의 세트들, 및/또는 안테나 어레이들을 포함할 수 도 있거나 이들 내에 포함될 수도 있다. 안테나 패널, 안테나 그룹, 안테나 엘리먼트들의 세트, 및/또는 안 테나 어레이는 하나 이상의 안테나 엘리먼트를 포함할 수도 있다. 안테나 패널, 안테나 그룹, 안테나 엘리 먼트들의 세트, 및/또는 안테나 어레이는 동일평면 상의 안테나 엘리먼트들의 세트 및/또는 비-동일평면 상의 안테나 엘리먼트들의 세트를 포함할 수도 있다. 안테나 패널, 안테나 그룹, 안테나 엘리먼트들의 세트, 및/ 또는 안테나 어레이는 단일 하우징 내의 안테나 엘리먼트들 및/또는 다수의 하우징들 내의 안테나 엘리먼트들을 포함할 수도 있다. 안테나 패널, 안테나 그룹, 안테나 엘리먼트들의 세트, 및/또는 안테나 어레이는 도 2 의 하나 이상의 컴포넌트들과 같은 하나 이상의 송신 및/또는 수신 컴포넌트들에 커플링된 하나 이상의 안테나 엘리먼트들을 포함할 수도 있다. 업링크 상에서, UE에서, 송신 프로세서는 데이터 소스로부터의 데이터 및 제어기/프로세서(28 0)로부터의 (예를 들어, RSRP, RSSI, RSRQ 및/또는 CQI를 포함하는 리포트들에 대한) 제어 정보를 수신 및 프로 세싱할 수도 있다. 송신 프로세서 는 또한 하나 이상의 레퍼런스 신호들에 대한 레퍼런스 심볼들을 생성할 수도 있다. 송신 프로세서 로부터의 심볼들은, 적용가능하다면, TX MIMO 프로세서 에 의해 프리코딩되고, (예컨대, DFT-s-OFDM 또는 CP-OFDM 에 대해) 변조기들 (254a 내지 254r) 에 의해 더 프로 세싱되고, 기지국 으로 송신될 수도 있다. 일부 양태들에서, UE 의 변조기 및 복조기 (예컨대, MOD/DEMOD ) 는 UE 의 모뎀에 포함될 수도 있다. 일부 양태들에서, UE 는 트랜시버를 포 함한다. 트랜시버는 안테나(들) , 변조기들 및/또는 복조기들 , MIMO 검출기 , 수신 프로세 서 , 송신 프로세서 , 및/또는 TX MIMO 프로세서 의 임의의 조합을 포함할 수도 있다. 트 랜시버는, (예를 들어, 도 4 내지 도 12 를 참조하여 설명된 바와 같이) 본 명세서에서 설명된 방법들 중 임의 의 방법의 양태들을 수행하기 위해 프로세서 (예컨대, 제어기/프로세서 ) 및 메모리 에 의해 사용될 수도 있다. 기지국에서, UE 및 다른 UE들로부터의 업링크 신호들은 안테나들에 의해 수신되고, 복조기들 에 의해 프로세싱되고, 적용가능하다면 MIMO 검출기에 의해 검출되고, 수신 프로세서에 의해 추 가로 프로세싱되어 UE에 의해 전송된 디코딩된 데이터 및 제어 정보를 획득할 수도 있다. 수신 프로세 서 는 디코딩된 데이터를 데이터 싱크 로 그리고 디코딩된 제어 정보를 제어기/프로세서 로 제공할 수도 있다. 기지국 은 통신 유닛 을 포함하고, 통신 유닛 을 통해 네트워크 제어 기 로 통신할 수도 있다. 기지국 은 다운링크 및/또는 업링크 통신들을 위해 UE들 을 스 케줄링하기 위한 스케줄러 를 포함할 수도 있다. 일부 양태들에서, 기지국 의 변조기 및 복조 기 (예컨대, MOD/DEMOD ) 는 기지국 의 모뎀에 포함될 수도 있다. 일부 양태들에서, 기지국 은 트랜시버를 포함한다. 트랜시버는 안테나(들), 변조기들 및/또는 복조기들, MIMO 검출 기, 수신 프로세서, 송신 프로세서, 및/또는 TX MIMO 프로세서의 임의의 조합을 포함할 수 도 있다. 트랜시버는, (예를 들어, 도 4 내지 도 12 를 참조하여 설명된 바와 같이) 본 명세서에서 설명된 방법들 중 임의의 방법의 양태들을 수행하기 위해 프로세서 (예컨대, 제어기/프로세서 ) 및 메모리 에 의해 사용될 수도 있다. 기지국 의 제어기/프로세서 , UE 의 제어기/프로세서 , 및/또는 도 2 의 임의의 다른 컴 포넌트(들)는 본 명세서의 다른 곳에서 더 상세히 설명되는 바와 같이, RACH 절차에서 라디오 리소스 제어 (RRC) 접속 요청 메시지와 연관된 물리 업링크 공유 채널 (PUSCH) 반복에 대한 요청들과 연관된 하나 이상의 기 법들을 수행할 수도 있다. 예를 들어, 기지국 의 제어기/프로세서 , UE 의 제어기/프로세서 , 및/또는 도 2 의 임의의 다른 컴포넌트(들)은 예를 들어, 도 5 의 프로세스 , 도 6 의 프로세스 , 도 7 의 프로세스 , 도 8 의 프로세스 , 및/또는 본 명세서에서 설명된 바와 같은 다른 프로 세스들의 동작들을 수행하거나 지시할 수도 있다. 메모리들 (242 및 282) 은 각각, 기지국 및 UE 에 대한 데이터 및 프로그램 코드들을 저장할 수도 있다. 일부 양태들에서, 메모리 및/또는 메 모리 는 무선 통신을 위한 하나 이상의 명령들 (예컨대, 코드 및/또는 프로그램 코드) 을 저장하는 비일 시적 컴퓨터 판독가능 매체를 포함할 수도 있다. 예를 들어, 하나 이상의 명령은, 기지국 및/또는 UE 의 하나 이상의 프로세서에 의해 (예를 들어, 직접적으로, 또는 컴파일링, 컨버팅 및/또는 해석 후에) 실 행될 때, 하나 이상의 프로세서, UE , 및/또는 기지국 으로 하여금, 예를 들어, 도 5 의 프로세스 , 도 6 의 프로세스 , 도 7 의 프로세스 , 도 8 의 프로세스 , 및/또는 본 명세서에서 설 명된 바와 같은 다른 프로세스들의 동작들을 수행 또는 지시하게 할 수도 있다. 일부 양태들에서, 명령들을 실행하는 것은 다른 예들 중에서도, 명령들을 실행하는 것, 명령들을 변환하는 것, 명령들을 컴파일하는 것, 및 /또는 명령들을 해석하는 것을 포함할 수도 있다. 일부 양태들에서, UE 는 랜덤 액세스 채널 (RACH) 절차의 RRC 접속 요청 메시지와 연관된 PUSCH 반복에 대한 요청을 기지국에 송신하기 위한 수단; 또는 요청에 적어도 부분적으로 기초하여 RRC 접속 요청 메시지와 연관된 적어도 하나의 PUSCH 반복을 송신하기 위한 수단을 포함한다. 일부 양태들에서, UE 는 PUSCH 반복에 대한 요청에 대응하는 하나 이상의 물리 랜덤 액세스 채널 (PRACH) 파라미터들과 하나 이상의 PRACH 파라미터들 사이 의 관계에 적어도 부분적으로 기초하여 하나 이상의 PRACH 파라미터들을 선택하기 위한 수단을 포함한다. 일부 양태들에서, UE 는 기지국으로부터, 관계를 표시하는 파라미터 구성을 수신하기 위한 수단을 포함한다. 일부 양태들에서, UE는 하나 이상의 트리거 기준들이 충족되는 것을 결정하기 위한 수단을 포함하고, PUSCH 반복에 대한 요청을 송신하는 것은 하나 이상의 트리거 기준들이 충족된다고 결정하는 것에 적어도 부분적으로 기반하여 PUSCH 반복에 대한 요청을 송신하는 것을 포함한다. 일부 양태들에서, UE는, 기지국으로부터, 하 나 이상의 트리거 기준들을 표시하는 트리거 구성을 수신하기 위한 수단을 포함한다. 일부 양태들에서, UE는 제 1 SSB(synchronization signal block) 기반 RSRP를 결정하기 위한 수단을 포함하고, 하나 이상의 트리거 기준들이 만족되는 것을 결정하는 것은 제 1 SSB 기반 RSRP가 제 1 RSRP 임계치를 만족하는 것을 결정하는 것을 포함한다. 일부 양태들에서, UE는 제 2 SSB 기반 RSRP를 결정하기 위한 수단을 포함하 고, 하나 이상의 트리거 기준들이 충족되는 것을 결정하는 것은 제 2 SSB 기반 RSRP가 제 2 RSRP 임계치를 충족 하는 것을 결정하는 것을 포함한다. 일부 양태들에서, UE는 기지국으로부터, 랜덤 액세스 응답(RAR) 메시지 를 수신하기 위한 수단을 포함하고, RAR 메시지는, RAR 메시지에 적어도 부분적으로 기반하여, PUSCH 반복 파라 미터 또는 PUSCH 반복 리소스 중 적어도 하나를 결정하기 위한 수단 중 적어도 하나를 표시한다. 일부 양태 들에서, UE는 기지국으로부터, PUSCH 반복 요청 승인의 표시를 수신하기 위한 수단을 포함하며, PUSCH 반복 요 청 승인은 PUSCH 반복 요청의 적어도 부분에 대응한다. 일부 양태들에서, UE 는 PRACH 송신을 위한 하나 이상의 대체 주파수 리소스들을 결정하기 위한 수단 - 하나 이 상의 대체 주파수 리소스들의 사용은 PUSCH 반복 정보를 통신함 -; 및/또는 PUSCH 반복 정보를 통신하기 위해 하나 이상의 대체 주파수 리소스들을 사용하여 PRACH 메시지를 기지국에 송신하기 위한 수단을 포함한다. UE가 본 명세서에 설명된 동작들을 수행하기 위한 수단은, 예를 들어, 안테나, 복조기, MIMO 검출기 , 수신 프로세서, 송신 프로세서, TX MIMO 프로세서, 변조기, 제어기/프로세서 또는 메모리 중 하나 이상을 포함할 수도 있다. 일부 양태들에서, 기지국은 UE 로부터, RACH 절차의 RRC 접속 요청 메시지와 연관된 PUSCH 반복에 대한 요청을 수신하기 위한 수단; 또는 요청에 적어도 부분적으로 기초하여 RRC 접속 요청 메시지와 연관된 적어도 하나의 PUSCH 반복을 수신하기 위한 수단을 포함한다. 일부 양태들에서, 기지국은 관계를 표시하는 파라미터 구성 을 UE에 송신하기 위한 수단을 포함한다. 일부 양태들에서, 기지국은 하나 이상의 트리거 기준들을 표시하 는 트리거 구성(trigger configuration)을 UE에 송신하기 위한 수단을 포함한다. 일부 양태들에서, 기지국 은 RAR 메시지를 UE에 송신하기 위한 수단을 포함한다. 일부 양태들에서, 기지국은 PUSCH 반복 요청 승인의 표시를 UE에 송신하기 위한 수단을 포함하고, PUSCH 반복 요청 승인은 PUSCH 반복 요청의 적어도 부분에 대응한 다. 일부 양태들에서, 기지국은 UE 로부터, PRACH 송신을 위한 하나 이상의 대체 주파수 리소스들을 사용하여 PRACH 메시지를 수신하기 위한 수단; 및/또는 PRACH 메시지를 수신하는데 사용된 하나 이상의 대체 주파수 리소스들에 기초하여 PUSCH 반복 정보를 결정하기 위한 수단을 포함하고, 하나 이상의 대체 주파수 리소스들의 사용은PUSCH 반복 정보를 통신한다. 본 명세서에서 설명된 동작들을 수행하기 위한 수단은 예를 들어, 송신 프로세서 , TX MIMO 프로세서 , 변조기 , 안테나 , 복조기 , MIMO 검출기 , 수신 프로세서 , 제어기/프로세 서 , 메모리 , 또는 스케줄러 중 하나 이상을 포함할 수도 있다. 도 2의 블록들이 별개의 컴포넌트들로서 예시되지만, 블록들에 관하여 위에서 설명된 기능들은 단일 하드웨어, 소프트웨어, 또는 조합 컴포넌트 또는 컴포넌트들의 다양한 조합들로 구현될 수도 있다. 예를 들어, 송신 프로세서 , 수신 프로세서 , 및/또는 TX MIMO 프로세서 에 관하여 설명된 기능들은 제어기/프 로세서 의 제어에 의해 또는 그 제어 하에 수행될 수도 있다. 전술한 바와 같이, 도 2는 예로서 제공된다. 다른 예들은 도 2 와 관련하여 설명되었던 것과는 상이할 수도 있다. 도 3 은 본 개시에 따른 4-스텝 RACH 동작의 일 예를 예시하는 다이어그램이다. 도 3 에 도시된 바와 같이, 기지국 및 UE 는 4-스텝 랜덤 액세스 절차를 수행하기 위해 서로 통신할 수도 있다. 참조 번호 305에 의해 도시된 바와 같이, 기지국 은 하나 이상의 SSB들 및 랜덤 액세스 구성 정보를 송신 할 수도 있고, UE 는 수신할 수도 있다. 일부 양태들에서, 랜덤 액세스 구성 정보는, 경합-기반 랜덤 액세스를 위한 것과 같이, 시스템 정보 (예를 들어, 다른 예들 중에서, 하나 이상의 시스템 정보 블록들 (SIB들)에서) 및/또는 SSB에서 송신되고/되거나 그에 의해 표시될 수도 있다. 추가적으로 또는 대안적으로, 랜덤 액세스 구성 정보는, 경합-없는 랜덤 액세스를 위한 것과 같은, RACH 절차를 트리거링하는 RRC 메시지 및/ 또는 물리 다운링크 제어 채널(PDCCH) 오더 메시지에서 송신될 수도 있다. 랜덤 액세스 구성 정보는 다른 예들 중에서도, 랜덤 액세스 메시지 (RAM) 를 송신하기 위한 하나 이상의 파라미터들 및/또는 RAR 을 수신하기 위한 하나 이상의 파라미터들과 같은, 랜덤 액세스 절차에서 사용될 하나 이상의 파라미터들을 포함할 수도 있 다. 도면 부호 310에 의해 도시된 바와 같이, UE 는 PRACH 를 통해 RACH 요청과 함께 RAM 을 송신할 수도 있 다. RAM 은 프리앰블 (다른 예들 중에서도, 랜덤 액세스 프리앰블, PRACH 프리앰블, 및/또는 RAM 프리앰블 로 때때로 지칭됨) 을 포함할 수도 있다. 프리앰블을 포함하는 메시지는 4-스텝 랜덤 액세스 절차에서의 다 른 예들 중에서도, 메시지 1, msg1, MSG1, 제 1 메시지, 및/또는 초기 메시지로 지칭될 수도 있다. 랜덤 액 세스 메시지는 랜덤 액세스 프리앰블 식별자를 포함할 수도 있다. 참조번호 315와 같이 기지국 110은 상기 프리앰블에 대한 응답으로 RAR을 송신할 수도 있다. RAR 을 포함하 는 메시지는 4-스텝 랜덤 액세스 절차의 메시지 2, msg2, MSG2, 또는 제 2 메시지로서 지칭될 수도 있다. 일부 양태들에서, RAR 은 (예를 들어, msg1 에서 UE 로부터 수신된) 검출된 랜덤 액세스 프리앰블 식별자 를 표시할 수도 있다. 추가적으로 또는 대안적으로, RAR은 메시지 3(msg3)을 송신하기 위해 UE에 의해 사용될 리소스 할당을 표시할 수도 있다(아래 참조). 일부 양태들에서, 4-스텝 랜덤 액세스 절차의 제 2 스텝의 일부로서, 기지국 은 RAR에 대한 PDCCH 통신물 을 송신할 수도 있다. PDCCH 통신은 RAR 을 포함하는 물리 다운링크 공유 채널 (PDSCH) 통신을 스케줄링할 수도 있다. 예를 들어, PDCCH 통신은 PDSCH 통신에 대한 리소스 할당을 표시할 수도 있다. 또한, 4-스 텝 랜덤 액세스 절차의 제 2 스텝의 일부로서, 기지국 은 PDCCH 통신에 의해 스케줄링된 바와 같이, RAR 을 위한 PDSCH 통신을 송신할 수도 있다. RAR은 PDSCH 통신의 MAC PDU(protocol data unit)에 포함될 수도 있다. 도면 부호 320에 의해 도시된 바와 같이, UE는 RRC 접속 요청 메시지를 송신할 수도 있다. RRC 접속 요청 메시지는 메시지 3, msg3, MSG3, UE 식별 메시지, 또는 4-스텝 랜덤 액세스 절차의 제 3 메시지로 지칭될 수도 있다. 일부 양태들에서, RRC 접속 요청은 다른 예들 중에서도, UE 식별자, 업링크 제어 정보 (UCI), 및/또는 PUSCH 통신 (예를 들어, RRC 접속 요청) 을 포함할 수도 있다. 참조번호 325에서 도시되는 바와 같이, 기지국은 RRC 접속 셋업 메시지를 송신할 수도 있다. RRC 접속 세트업 메시지는 4-스텝 랜덤 액세스 절차의 메시지 4, msg4, MSG4 또는 제 4 메시지로 지칭될 수도 있다. 일부 양태들에서, RRC 접속 셋업 메시지는 다른 예들 중에서도, 검출된 UE 식별자, 타이밍 어드밴스 값, 및/또 는 경합 해결 정보를 포함할 수도 있다. 참조 번호 330에 의해 나타낸 바와 같이, UE 가 RRC 접속 셋 업 메시지를 성공적으로 수신하면, UE 는 하이브리드 자동 반복 요청 (hybrid automatic repeatrequest; HARQ) 확인응답 (ACK) 을 송신할 수도 있다. RACH 절차들은 커버리지 제한들을 가질 수도 있으며, 이는 네트워크 성능에 부정적인 영향을 미칠 수도 있다. 일부 경우들에서, 약 24 기가헤르츠 이상의 주파수 범위들에서의 RACH 메시지들은 UE들에 의해 누락되거나 UE들에 의해 부정확하게 디코딩될 수도 있다. 그 결과, RRC 접속 셋업 메시지들은 네트워크 접속을 손상시 키면서 유효하게 송신되지 않을 수도 있다. RRC 접속 셋업 메시지들과 연관된 PUSCH의 반복은 더 효과적인 커버리지를 용이하게 할 수도 있다. PUSCH 반복을 수행하기 위해, UE는 PUSCH 반복을 스케줄링하기 위해 PUSCH 반복 정보를 기지국에 통신할 수도 있다. PUSCH 반복 정보는 PUSCH 반복에 대한 요청 및/또는 PUSCH 반복에 대한 UE 능력의 표시를 포함할 수도 있다. 그러나, 커버리지가 문제가 아닌 UE들에 대한 PUSCH 반복 을 스케줄링하는 것은 리소스들이 낭비되게 하는 비효율성들을 초래할 수도 있다. 또한, PUSCH 반복 정보를 기지국으로 송신되는 데이터의 일부로 전송하는 것은 리소스들의 효율적인 사용이 아닐 수도 있다. 본 명세서에 설명된 기술들의 양태들은 RACH 절차들 동안 RRC 접속 셋업 요청 메시지들과 연관된 효율적인 PUSCH 반복을 용이하게 할 수도 있다. 예를 들어, 양태들은 UE가 PUSCH 반복 및/또는 PUSCH 반복의 파라미 터들을 요청하는 것을 가능하게 할 수도 있다. 따라서, 양태들은 UE에 이익이 될 수도 있는 경우에만 그리 고 그 정도까지 PUSCH 반복을 가능하게 할 수도 있으며, 이는 네트워크 성능에 긍정적으로 영향을 줄 수도 있는 RRC 접속에 대한 효율적인 커버리지 향상을 초래할 수도 있고, 이에 의해 커버리지가 문제가 되지 않는 UE들에 대한 PUSCH 반복을 스케줄링하는 것과 관련하여 낭비될 리소스들(예를 들어, 컴퓨팅, 메모리, 통신 및 네트워크 리소스들)을 절약할 수도 있다. 본 개시의 일부 양태들에 따르면, UE는 기지국에 PUSCH 반복 정보를 통신하기 위해 특정 주파수 리소스들을 이 용할 수도 있으며, 여기서 특정 주파수 리소스들의 사용은 PUSCH 반복 정보를 통신한다. 예를 들어, UE는 임의의 PUSCH 반복 없이 단일 PUSCH 송신과 연관된 PRACH 송신을 위한 정규 주파수 리소스들을 이용할 수도 있 다. 한편, UE는 PUSCH 반복 정보를 통신하기 위해 PRACH 송신을 위한 대체 주파수 리소스들을 이용할 수도 있고, 여기서 대체 주파수 리소스들의 사용은 PUSCH 반복 정보를 통신할 수도 있다. 따라서, 예를 들어, 특 정 대체 주파수 리소스들의 사용은 기지국에 PUSCH 반복을 통신할 수도 있어서, 기지국은 특정 데이터 시그널링 을 통해 PUSCH 반복 정보를 전달하는 대신에, PRACH 송신을 위한 대체 주파수 리소스들의 사용에 기초하여 PUSCH 반복 정보를 결정할 수도 있다. 일부 양태들에서, 대체 주파수 리소스들은 단일 PUSCH 송신과 연관된 PRACH 송신을 위한 정규 주파수 리소스들(regular frequency resources)과 적어도 부분적으로 상이할 수도 있다. 일부 양태들에서, UE는 PRACH 송신을 위한 대체 주파수 리소스들을 결정할 수도 있고, PUSCH 반복 정보를 통신 하기 위해 대체 주파수 리소스들을 사용하여 PRACH 메시지를 송신할 수도 있다. PUSCH 반복 정보에 기초하 여, UE는 PUSCH 메시지 및 PUSCH 메시지의 적어도 하나의 반복을 송신함으로써, PUSCH 반복을 수행할 수도 있다. 상기 논의된 바와 같이, 기지국은 PRACH 송신을 위한 대체 주파수 리소스들의 사용에 기초하여 PUSCH 반복 정보 를 결정할 수도 있다. 일부 양태들에서, 기지국이 PUSCH 반복 정보를 결정할 때, 기지국은 PUSCH 반복 정보 에 기초하여 PUSCH 리소스들의 표시 및/또는 PUSCH 파라미터를 송신할 수도 있어서, UE 는 PUSCH 메시지 및 PUSCH 메시지의 적어도 하나의 반복을 송신하기 위해 PUSCH 리소스들 및/또는 PUSCH 파라미터를 사용할 수도 있 다. 일부 양태들에서, PUSCH 리소스들의 표시 및/또는 PUSCH 파라미터는 RAR 메시지를 통해 송신될 수도 있 다. 일부 양태들에서, 기지국은 대체 주파수 리소스들을 UE에 표시할 수도 있다. 기지국은, 예를 들어, 정규 주 파수 리소스들과 상이한 이용가능한 주파수 리소스들을 선택함으로써 대체 주파수 리소스들을 할당할 수도 있다. 예를 들어, 대체 주파수 리소스들은 리소스 블록들에서 할당될 수도 있다. 일 예에서, 대체 주파 수 리소스들은 PUSCH 반복 없이 단일 PUSCH 송신과 연관된 PRACH 송신에 대한 정규 주파수 리소스들과 상이한 컴포넌트 캐리어에 있을 수도 있다. 일부 양태들에서, 기지국은 UE 가 수신된 리소스 파라미터에 기초하여 대체 주파수 리소스들을 결정할 수도 있도록 대체 주파수 리소스들을 표시하는 리소스 파라미터를 UE에 송신할 수도 있다. 일부 양태들에서, UE 는 기지국으로부터 시스템 정보를 통해 리소스 파라미터를 수신할 수도 있 다. 일부 양태들에서, UE 는 기지국으로부터 송신된 시스템 정보 (예를 들어, 잔여 최소 시스템 정보 (RMSI)) 를 통해 리소스 파라미터를 수신할 수도 있다. 일부 양태들에서, 리소스 파라미터는 대체 주파수 리소스들을 구체적으로 표시할 수도 있다. 일부 양태들에 서, 리소스 파라미터는 주파수 오프셋을 포함할 수도 있고, 여기서 UE는 PUSCH 반복 없이 단일 PUSCH 송신과 연관된 PRACH 송신에 대한 정규 주파수 리소스들에 주파수 오프셋을 적용함으로써 대체 주파수 리소스들을 결정할 수도 있다. 일부 양태들에서, 주파수 오프셋은 다수의 리소스 블록들에서 제공될 수도 있다. 일부 양태들에서, PUSCH 반복 정보는 PUSCH 반복에 대한 요청 및/또는 PUSCH 반복에 대한 UE 능력의 표시에 대 응하는 하나 이상의 파라미터들을 표시할 수도 있다. 일부 양태들에서, 하나 이상의 파라미터들은, PUSCH 반복에 대한 요청, UE 능력의 표시, 및 PUSCH 반복들의 수 중 하나 이상을 포함할 수도 있다. 일부 양태들 에서, 하나 이상의 파라미터들은, PUSCH 반복에 대한 요청 또는 UE 능력의 표시 중 적어도 하나가 크로스-슬롯 채널 추정을 위한 DMRS 집성을 갖는 PUSCH 반복과 연관된다는 표시를 포함할 수도 있다. 예를 들어, DMRS 집성/번들링이 사용되는 경우, 크로스-슬롯 채널 추정으로서, 상이한 슬롯들에서 상이한 반복들 상의 DMRS들이 채널 추정을 위해 함께 사용될 수도 있다. 일부 양태들에서, 하나 이상의 파라미터들은, PUSCH 반복이 하나 이상의 송신 구성 표시자들(TCI들)과 연관된다는 표시를 포함할 수도 있다. 예를 들어, 다수의 TCI들은 UE 의 다수의 빔들과 연관될 수도 있다. 일부 양태들에서, 하나 이상의 파라미터들은 PUSCH 반복에 대한 요청 또는 UE 능력의 표시 중 적어도 하나가 주파수 호핑을 갖는 PUSCH 반복과 연관된다는 표시를 포함할 수도 있다. 예를 들어, 주파수 호핑은, PUSCH 반복들 사이에 주파수에서의 시프트가 존재하고 따라서 상이한 주파수들이 상이한 반복들에 대해 사용될 때 발생할 수도 있다. 대체 주파수 리소스들의 상이한 세트들을 활용함으로써, PUSCH 반복 정보의 상이한 파라미터들이 기지국에 통신 될 수도 있다. 예를 들어, 대체 주파수 리소스들의 하나의 세트의 사용은 하나의 파라미터를 통신할 수도 있는 반면, 대체 주파수 리소스들의 다른 세트의 사용은 다른 파라미터를 통신할 수도 있다. 일부 양태들에 서, 하나 이상의 대체 주파수 리소스들은 하나 이상의 파라미터들의 각각에 대해 상이하다. 일부 양태들에 서, 대체 주파수 리소스들의 세트는 다수의 파라미터들을 통신하기 위해 사용될 수도 있는 반면, 대체 주파수 리소스들의 상이한 세트는 단일 파라미터를 통신하기 위해 사용될 수도 있다. 예를 들어, 대체 주파수 리소 스들의 세트는 PUSCH 반복에 대한 요청 및 PUSCH 반복의 수를 통신하는데 사용될 수도 있는 한편, 대체 주파수 리소스들의 다른 세트는 PUSCH 반복이 하나 이상의 TCI들과 연관된다는 표시를 통신하는데 사용될 수도 있다. 일 예에서, 대체 주파수 리소스들의 세트는 PUSCH 반복에 대한 요청 및 2 인 PUSCH 반복이 수를 통신하는데 사용될 수도 있는 한편, 대체 주파수 리소스들의 다른 세트는 PUSCH 반복에 대한 요청 및 4 인 PUSCH 반복의 수 를 통신하는데 사용될 수도 있다. PUSCH 반복을 위한 송신 전력은 어떠한 PUSCH 반복도 없는 단일 PUSCH 전송을 위한 송신 전력과 상이할 수도 있 다. 일부 양태들에서, UE 는 PUSCH 반복에 대한 송신 전력과 연관된 송신 전력 파라미터를 결정할 수도 있 고, UE 는 송신 파라미터에 기초하여 PUSCH 반복에 대한 송신 전력을 구성할 수도 있다. 대체 주파수 리소 스들은 하나의 송신 전력 파라미터와 연관될 수도 있고, PUSCH 반복 없이 단일 PUSCH 송신과 연관된 PRACH 송신 을 위한 정규 주파수 리소스들은 상이한 송신 파라미터와 연관될 수도 있다. 따라서, 일부 양태들에서, UE 가 PRACH 송신을 위한 대체 주파수 리소스들을 사용하도록 결정할 때, UE 는 PUSCH 송신을 위한 송신 전력 파라 미터를 PUSCH 반복을 위한 송신 전력과 연관된 송신 전력 파라미터인 것으로 결정할 수도 있다. 한편, UE가 PRACH 송신을 위한 정규 주파수 리소스들을 사용하도록 결정할 때, UE는 PUSCH 송신을 위한 송신 전력 파라미터 를 어떠한 PUSCH 반복도 없는 단일 PUSCH 송신을 위한 송신 전력과 연관된 송신 전력 파라미터인 것으로 결정할 수도 있다. 따라서, PRACH 송신을 위한 대체 주파수 리소스들을 사용하도록 결정하는 것은, 어느 송신 전력 파라미터가 PUSCH 송신 및/또는 PUSCH 반복에 사용되는지를 표시할 수도 있다. 일부 양태들에서, 기지국은 기지국으로부터의 PUSCH 반복을 위한 송신 전력과 연관된 송신 전력 파라미터를 결 정할 수도 있고, 임의의 PUSCH 반복 없이 단일 PUSCH 송신을 위한 송신 전력과 연관된 송신 전력 파라미터를 추 가로 결정할 수도 있다. UE는 기지국으로부터, PUSCH 반복을 위한 송신 전력과 연관된 송신 전력 파라미터 를 수신할 수도 있다. UE는 또한 기지국으로부터, 임의의 PUSCH 반복 없이 단일 PUSCH 송신을 위한 송신 전 력과 연관된 송신 전력과 연관된 상이한 송신 전력 파라미터를 수신할 수도 있다. 송신 전력 파라미터(들) 는 기지국으로부터 시스템 정보(예를 들어, RMSI)를 통해 기지국으로부터 수신될 수도 있다. 일부 양태들에 서, PUSCH 반복을 위한 송신 전력과 연관된 송신 전력 파라미터는 PUSCH 반복을 위한 송신 전력과 PRACH 송신을 위한 제 2 송신 전력 사이의 전력 오프셋 값을 포함할 수도 있다. 또한, 단일 PUSCH 송신을 위한 송신 전력 과 연관된 송신 전력은 단일 PUSCH 송신을 위한 송신 전력과 PRACH 송신을 위한 제 2 송신 전력 사이의 상이한 전력 오프셋 값을 포함할 수도 있다. 예를 들어, PRACH 송신을 위한 제 2 송신 전력은 동일하게 유지될 수 도 있다. 일 예에서, PUSCH 반복에 대한 송신 전력을 결정하기 위해, PUSCH 반복에 대한 송신 전력과 PRACH 송신에 대한 제 2 송신 전력 사이의 전력 오프셋 값이 제 2 송신 전력에 적용될 수도 있다. 일 예에서, 전 력 오프셋 값은 기지국으로부터 통신되는 PUSCH-ConfigCommon 필드에 포함된 전력 파라미터 \"msg3-DeltaPreamble\"에 기초할 수도 있다. 다른 예로, 상기 전력 파라미터들은 기지국으로부터 송신되는 PUSCH- PowerControl 필드 내에 파라미터들 “msg3-Alpha” 및 “p0-NominalWithoutGrant” 및 “p0-PUSCH-Alpha” 중 하나 이상의 파라미터를 포함할 수도 있다. 일부 양태들에서, 기지국으로부터의 PUSCH 반복을 위한 송신 전력과 연관된 송신 전력 파라미터 및/또는 어떠한 PUSCH 반복도 없는 단일 PUSCH 송신을 위한 송신 전력과 연관된 송신 전력 파라미터는 UE에 사전 로딩될 수도 있다. 일부 양태들에서, 송신 전력 파라미터는 PUSCH 반복에 대한 송신 전력과 PRACH 송신에 대한 제 2 송신 전력 사 이의 전력 오프셋 값을 포함한다. 전술한 바와 같이, 도 3은 예로서 제공된다. 다른 예들은 도 3 과 관련하여 설명되었던 것과는 상이할 수도 있다. 도 4 는 본 개시에 따른, RACH 절차에서 RRC 접속 요청 메시지와 연관된 PUSCH 반복에 대한 요청들과 연관된 예 를 예시하는 다이어그램이다. 도 4에 도시된 바와 같이, UE 및 기지국 은 서로 통신할 수도 있다. 참조 번호 415에 의해 도시된 바와 같이, 하나 이상의 PRACH 파라미터들과 RRC 접속 요청 메시지와 연관된 PUSCH 반복들에 대한 요청 사이의 관계를 표시하는 파라미터 구성을 포함할 수도 있는 시스템 정보 (SI) 를 기 지국 은 송신할 수도 있고, UE 는 수신할 수도 있다. 일부 양태들에서, 파라미터 구성은 요청 된 PUSCH 반복에 대응하는 하나 이상의 요청된 파라미터들과 하나 이상의 PRACH 파라미터들 사이의 관계를 표시 할 수도 있다. SI는 예를 들어, RMSI를 포함할 수도 있다. 일부 양태들에서, 위에서 설명된 관계들, 또 는 이들의 양태들은 무선 통신 표준에 의해 표시될 수도 있다. 본 명세서에서 사용되는 바와 같이, \"반복(repetition)\"은 한번보다 많이 송신되는 통신을 지칭하고, 그 통신의 초기 송신 또는 그 통신의 임의의 후속 재송신을 지칭한다. (예를 들어, 슬롯-반복, 슬롯-집성 및/또는 다 중-슬롯 PUSCH로 지칭될 수도 있는) PUSCH 반복은 송신 신뢰성을 향상시키기 위해 신호-대-잡음비(SNR)를 증가 시키기 위해 사용될 수도 있다. 참조 번호 420에 의해 도시된 바와 같이, UE는 PRACH 송신을 위한 대체 주파수 리소스들을 이용하기로 결 정할 수도 있으며, 여기서 대체 주파수 리소스들의 사용은 PUSCH 반복 정보를 통신한다. 따라서, PRACH 송 신을 위한 대체 주파수 리소스들을 이용함으로써, UE 는 PUSCH 반복 정보를 기지국 에 표시할 수도 있다. 대체 주파수 리소스들은 PUSCH 반복 없이 단일 PUSCH 송신과 연관된 PRACH 송신을 위한 정규 주파수 리소스들과 상이할 수도 있다. 대체 주파수 리소스들은 대체 주파수 리소스들을 표시하는 리소스 파라미터 에 기초하여 결정될 수도 있으며, 여기서 리소스 파라미터는 UE에서 미리 구성/사전 로딩될 수도 있거나 기지국에 의해 (예를 들어, SI를 통해) 제공될 수도 있다. 참조 번호 425에 의해 도시된 바와 같이, RACH 절차의 RRC 접속 요청 메시지와 연관된 PUSCH 반복에 대한 요청 을 포함하는 PRACH 메시지를 UE 가 송신할 수도 있고 기지국 이 수신할 수도 있다. 일부 양태 들에서, PUSCH 반복 정보를 통신하기 위해 대체 주파수 리소스들을 사용하여 PRACH 메시지를 UE 가 송신 할 수도 있고, 기지국 이 수신할 수도 있다. PUSCH 반복에 대한 요청은 PUSCH 반복에 대응하는 하나 이상의 제안된 파라미터들을 표시할 수도 있다. 예를 들어, 하나 이상의 제안된 파라미터들은 PUSCH 반복들 의 수를 표시할 수도 있다. 일부 양태들에서, PUSCH 반복에 대한 요청은 크로스-슬롯 채널 추정을 위한 집 성된 복조 레퍼런스 신호에 대한 요청을 표시할 수도 있다. PUSCH 반복에 대한 요청은 다른 예들 중에서도, 하나 이상의 송신 구성 표시자들과 연관된 PUSCH 반복에 대한 요청 및/또는 주파수 호핑을 갖는 PUSCH 반복에 대한 요청을 포함할 수도 있다. 앞서 논의된 바와 같이, PUSCH 반복 정보는 PUSCH 반복에 대한 요청 및/또 는 PUSCH 반복에 대한 UE 능력의 표시에 대응하는 하나 이상의 파라미터들을 표시할 수도 있다. 따라서, UE는 PRACH 메시지를 송신하기 위해 대체 주파수 리소스들을 사용함으로써 PUSCH 반복 정보를 암시적으로 (implicitly) 통신할 수도 있다. 일부 양태들에서, UE는 복수의 RACH 어케이전(occasion)(RO)들에 걸쳐 PRACH 메시지를 반복할 수도 있다. 일부 양태들에서, PUSCH 반복에 대한 요청은 암시적일 수도 있다. 예를 들어, UE는 PRACH 프리앰블 들의 세트의 PRACH 프리앰블들의 서브세트로부터 선택되는 PRACH 프리앰블을 송신할 수도 있다. 서브세트는 PUSCH 반복에 대한 요청을 표시할 수도 있다. 일부 양태들에서, UE는 RO들의 세트의 RO들의 서브세트 를 사용하여 PRACH 메시지를 송신할 수도 있고, 여기서 RO들의 서브세트는 PUSCH 반복에 대한 요청을 표시한다. 일부 양태들에서, UE 는 PUSCH 반복에 대한 요청을 표시하는 PRACH 포맷을 사용하여 PRACH 메시지를 송신할 수도 있다. 일부 양태들에서, UE 는 하나 이상의 PRACH 파라미터들에 적어도 부분적으로 기초하여 PRACH 메시지를 송 신할 수도 있다. 일부 양태들에서, PRACH 메시지는 기지국 으로부터 수신된 파라미터 구성에 적어도 부분적으로 기초하여 송신될 수도 있다. UE 는 PUSCH 반복에 대한 요청에 대응하는 하나 이상의 요청 파라미터들과 하나 이상의 PRACH 파라미터들 사이의 관계에 적어도 부분적으로 기초하여 하나 이상의 PRACH 파 라미터들을 선택할 수도 있다. 전술한 바와 같이, 관계는 기지국에 의해 표시될 수도 있고 및/또는 무선 통 신 표준에 명시될 수도 있다. UE는 하나 이상의 트리거 기준이 충족되는 것을 결정하고, 하나 이상의 트리거 기준이 충족된다고 결정하 는 것에 적어도 부분적으로 기초하여 PUSCH 반복에 대한 요청을 송신하도록 구성될 수도 있다. 일부 양태들 에서, 기지국 은 하나 이상의 트리거 기준들을 표시하는 트리거 구성을 송신할 수도 있고, UE 가 수신할 수도 있다. 트리거 구성은 SI(예를 들어, RMSI)에서 반송될 수도 있다. 일부 양태들에서, 예를 들어, 하나 이상의 트리거 기준들은 하나 이상의 임계치들을 포함할 수도 있다. 예 를 들어, 하나 이상의 트리거 기준들은 제 1 RSRP 임계치를 포함할 수도 있다. UE는 제 1 SSB 기반 RSRP를 결정할 수도 있고, 제 1 SSB 기반 RSRP가 제 1 RSRP 임계치를 만족하는 것을 결정할 수도 있다. UE는 제 1 SSB 기반 RSRP가 제 1 RSRP 임계치를 만족한다고 결정하는 것에 적어도 부분적으로 기초하여 PUSCH 반복을 요청할 수도 있다. 일부 양태들에서, 하나 이상의 트리거 기준들은 제 2 RSRP 임계치를 포함할 수도 있다. UE는 제 2 SSB 기반 RSRP를 결정할 수도 있고, 제 2 SSB 기반 RSRP가 제 2 RSRP 임계치를 만족하는 것을 결정할 수도 있다. 일부 양태들에서, 예를 들어, PUSCH 반복에 대한 요청은 제 1 SSB 기반 RSRP가 제 1 RSRP 임계치를 만족한다 고 결정하는 것에 적어도 부분적으로 기초하여 요청된 PUSCH 반복들의 제 1 수를 표시할 수도 있고, 제 2 SSB 기반 RSRP가 제 2 RSRP 임계치를 만족한다고 결정하는 것에 적어도 부분적으로 기초하여 요청된 PUSCH 반복들의 제 2 수를 표시할 수도 있다. 일부 양태들에서, 하나 이상의 트리거 기준들은 무선 통신 표준에서 표시될 수도 있다. 참조 번호 430에 의해 도시된 바와 같이, 기지국 이 대체 주파수 리소스들이 PRACH 메시지를 수신하기 위 해 사용된다고 결정하는 경우, 기지국 은 대체 주파수 리소스들에 기초하여 PUSCH 반복 정보를 결정할 수 도 있다. 참조 번호 435에 의해 도시된 바와 같이, 기지국 은 RAR 메시지를 송신할 수도 있고, UE 는 RAR 메 시지를 수신할 수도 있다. RAR 메시지는 PUSCH 반복 정보에 기초하여 기지국 에 의해 송신되고, UE 에 의해 수신될 수도 있다. RAR 메시지는 RRC 접속 요청 메시지에 대한 PUSCH 리소스, 또는 RRC 접속 요청 메시지와 연관된 PUSCH 파라미터 중 적어도 하나를 표시할 수도 있다. UE 는 예를 들어, RAR 메 시지에 적어도 부분적으로 기초하여, PUSCH 반복 파라미터 또는 PUSCH 반복 리소스 중 적어도 하나를 결정할 수 도 있다. 일부 양태들에서, PUSCH 반복 요청 승인의 표시를 기지국 은 송신할 수도 있고, UE 는 수신할 수도 있다. PUSCH 반복 요청 승인은 PUSCH 반복 요청의 적어도 부분에 대응할 수도 있다. 일부 양태들에서, PUSCH 반복 요청 승인의 표시는 RAR 메시지에서 반송될 수도 있다. 예를 들어, PUSCH 반복 요청 승인의 표 시는 RAR 메시지의 PDCCH 부분에서 반송될 수도 있다. 참조 번호 440에 의해 도시된 바와 같이, UE는 PUSCH 반복을 위한 송신 전력과 연관된 송신 전력 파라미터 를 결정하고, 송신 파라미터에 기초하여 PUSCH 반복을 위한 송신 전력을 구성할 수도 있다. 송신 전력 파라 미터는 대체 주파수 리소스들에 기초하여 결정될 수도 있다. 송신 전력 파라미터는 UE에서 미리 구성/ 사전 로딩될 수도 있거나 기지국에 의해 (예를 들어, SI를 통해) 제공될 수도 있다. 참조 부호 445에 의해 도시된 바와 같이, RRC 접속 요청 PUSCH 반복을 UE 가 송신할 수도 있고, 기지국 이 수신할 수도 있다. RRC 접속 요청 PUSCH 반복은 PUSCH 반복에 대한 요청에 적어도 부분적으로 기 초할 수도 있는 RAR에서 표시된 리소스들 및/또는 파라미터들에 적어도 부분적으로 기초하여 송신될 수도 있다. 일부 양태들에서, RAR에서 표시된 리소스들 및/또는 파라미터들은 PUSCH 반복 정보에 적어도 부분적으로 기 초할 수도 있다. 일부 양태들에서, 임의의 수의 추가적인 RRC 접속 요청 PUSCH 반복들이 송신될 수도 있다. 참조 부호 450에 의해 도시된 바와 같이, 기지국 은 RRC 접속 셋업 메시지를 송신할 수도 있고, UE 는 이를 수신할 수도 있다. 기지국 은 PUSCH 반복들 중 하나 이상을 수신하는 것에 응답하여 RRC 접속 셋업 메시지를 송신할 수도 있다. 전술한 바와 같이, 도 4는 예로서 제공된다. 다른 예들은 도 4 와 관련하여 설명되는 것과 상이할 수도 있 다. 도 5 는 본 개시에 따른, 예를 들어, UE에 의해 수행되는 예시적인 프로세스 를 예시하는 다이어그램이다. 예시적인 프로세스 는 UE (예를 들어, UE ) 가 RACH 절차에서 RRC 접속 요청 메시지와 연관된 PUSCH 반복을 위한 요청들과 연관된 동작들을 수행하는 예이다. 도 5에 도시된 바와 같이, 일부 양태들에서, 프로세스 는 기지국으로부터, PUSCH 반복에 대한 요청에 대 응하는 하나 이상의 요청 파라미터들과 하나 이상의 PRACH 파라미터들 사이의 관계를 표시하는 파라미터 구성을 수신하는 단계를 포함할 수도 있다 (블록 510). 예를 들어, UE 는 (예를 들어, 도 9에 도시된 수신 컴포넌 트 를 사용하여) 기지국으로부터, PUSCH 반복에 대한 요청에 대응하는 하나 이상의 요청 파라미터들과 하 나 이상의 PRACH 파라미터들 사이의 관계를 표시하는 파라미터 구성을 수신할 수도 있다. 일부 양태들에서, 파라미터 구성은 SI에서 반송된다. 일부 양태에서, SI는 RMSI를 포함한다. 일부 양태들에서, 관계는 무 선 통신 표준에 의해 표시된다. 도 5에 도시된 바와 같이, 일부 양태들에서, 프로세스는 RSRP를 결정하는 단계(블록 520)를 포함할 수도 있다. 예를 들어, UE 는 (예를 들어, 도 9에 도시된 결정 컴포넌트 를 사용하여) RSRP 를 결정할 수 도 있다. 일부 양태들에서, RSRP는 SSB 기반 RSRP일 수도 있다. 도 5에 도시된 바와 같이, 일부 양태들 에서, 프로세스는 하나 이상의 트리거 기준이 충족됨을 결정하는 단계를 포함할 수도 있다(블록 530). 예를 들어, (예를 들어, 도 9에 도시된 결정 컴포넌트를 사용하여) UE는 하나 이상의 트리거 기준이 충족 됨을 결정할 수도 있다. 일부 양태들에서, 프로세스 는 기지국으로부터, 하나 이상의 트리거 기준들 을 표시하는 트리거 구성을 수신하는 것을 포함한다. 일부 양태들에서, 하나 이상의 트리거 기준들은 무선 통신 표준에 표시된다. 일부 양태들에서, 트리거 구성은 SI에서 반송된다. 일부 양태에서, SI는 RMSI를 포함한다. 일부 양태들 에서, 하나 이상의 트리거 기준들은 제 1 RSRP 임계치를 포함한다. 일부 양태들에서, 프로세스는 제 1 SSB 기반 RSRP를 결정하는 단계를 포함하고, 하나 이상의 트리거 기준들이 충족되는 것을 결정하는 단계는 제 1 SSB 기반 RSRP가 제 1 RSRP 임계치를 충족하는 것을 결정하는 단계를 포함한다. 일부 양태들에서, 하나 이 상의 트리거 기준들은 제 2 RSRP 임계치를 포함한다. 일부 양태들에서, 프로세스는 제 2 SSB 기반 RSRP를 결정하는 단계를 포함하고, 하나 이상의 트리거 기준들이 충족되는 것을 결정하는 단계는 제 2 SSB 기반 RSRP가 제 2 RSRP 임계치를 충족하는 것을 결정하는 단계를 포함한다. 도 5에 도시된 바와 같이, 일부 양태들에서, 프로세스 는 PUSCH 반복에 대한 요청에 대응하는 하나 이상 의 요청 파라미터들과 하나 이상의 PRACH 파라미터들 사이의 관계에 적어도 부분적으로 기초하여 하나 이상의 PRACH 파라미터들을 선택하는 것을 포함할 수도 있다 (블록 540). 예를 들어, UE 는 (예를 들어, 도 9에 도 시된 결정 컴포넌트 를 사용하여) PUSCH 반복에 대한 요청에 대응하는 하나 이상의 요청 파라미터들과 하 나 이상의 PRACH 파라미터들 사이의 관계에 적어도 부분적으로 기초하여 하나 이상의 PRACH 파라미터들을 선택 할 수도 있다. 도 5에 도시된 바와 같이, 일부 양태들에서, 프로세스 는 RACH 절차의 RRC 접속 요청 메시지와 연관된 PUSCH 반복에 대한 요청을 기지국에 송신하는 것을 포함할 수도 있다 (블록 550). 예를 들어, UE 는 (예를 들어, 도 9에 도시된 송신 컴포넌트 를 사용하여) 상기 설명된 바와 같이, RACH 절차의 RRC 접속 요청 메 시지와 연관된 PUSCH 반복에 대한 요청을 기지국에 송신할 수도 있다. 일부 양태들에서, PUSCH 반복에 대한 요청을 송신하는 것은 하나 이상의 트리거 기준들이 충족된다는 결정에 적어도 부분적으로 기반하여 PUSCH 반복 에 대한 요청을 송신하는 것을 포함한다. 예를 들어, 일부 양태들에서, PUSCH 반복에 대한 요청은 제 1 SSB 기반 RSRP가 제 1 RSRP 임계치를 만족한다고 결정하는 것에 적어도 부분적으로 기초하여 요청된 PUSCH 반복들의 제 1 수를 표시하고, PUSCH 반복에 대한 요청은 제 2 SSB 기반 RSRP가 제 2 RSRP 임계치를 만족한다고 결정하는 것에 적어도 부분적으로 기초하여 요청된 PUSCH 반복들의 제 2 수를 표시한다. 일부 양태들에서, PUSCH 반복에 대한 요청은 PUSCH 반복에 대응하는 하나 이상의 제안된 파라미터들을 표시한다. 일부 양태들에서, 하나 이상의 제안된 파라미터들은 PUSCH 반복들의 수를 표시한다. 일부 양 태들에서, PUSCH 반복에 대한 요청은 크로스-슬롯 채널 추정을 위한 집성된 복조 레퍼런스 신호에 대한 요청을표시한다. 일부 양태들에서, PUSCH 반복에 대한 요청은 하나 이상의 송신 구성 표시자들과 연관된 PUSCH 반 복에 대한 요청을 포함한다. 일부 양태들에서, PUSCH 반복에 대한 요청은 주파수 호핑을 갖는 PUSCH 반복에 대한 요청을 포함한다. 일부 양태들에서, PUSCH 반복에 대한 요청을 송신하는 것은 PUSCH 반복에 대한 요청을 표시하는 PRACH 메시지를 송신하는 것을 포함한다. 일부 양태들에서, PUSCH 반복에 대한 요청을 송신하는 것은 복수의 RACH 어케이전 들에 걸쳐 PRACH 메시지를 반복하는 것을 포함한다. 일부 양태들에서, PUSCH 반복에 대한 요청을 송신하는 것은 PRACH 프리앰블들의 세트의 PRACH 프리앰블들의 서브세트로부터 선택되는 PRACH 프리앰블을 송신하는 것을 포함하고, 여기서 서브세트는 PUSCH 반복에 대한 요청을 표시한다. 일부 양태들에서, PUSCH 반복에 대한 요 청을 송신하는 것은 RO들의 세트의 RO들의 서브세트를 사용하여 PRACH 메시지를 송신하는 것을 포함하고, RO들 의 서브세트는 PUSCH 반복에 대한 요청을 표시한다. 일부 양태들에서, PUSCH 반복에 대한 요청을 송신하는 것은 PUSCH 반복에 대한 요청을 표시하는 PRACH 포맷을 사용하여 PRACH 메시지를 송신하는 것을 포함한다. 일부 양태들에서, PRACH 메시지를 송신하는 것은 하나 이상의 PRACH 파라미터들에 적어도 부분적으로 기초하여 PRACH 메시지를 송신하는 것을 포함한다. 도 5에 도시된 바와 같이, 일부 양태들에서, 프로세스 는 기지국으로부터, PUSCH 반복 요청 승인의 표시 를 수신하는 단계를 포함할 수도 있고, 여기서 PUSCH 반복 요청 승인은 PUSCH 반복 요청의 적어도 부분에 대응 한다 (블록 560). 예를 들어, UE 는 (예를 들어, 도 9에 도시된 수신 컴포넌트 를 사용하여) 기지국 으로부터, PUSCH 반복 요청 승인의 표시를 수신할 수도 있고, 여기서 PUSCH 반복 요청 승인은 PUSCH 반복 요청 의 적어도 부분에 대응한다. 일부 양태들에서, PUSCH 반복 요청 승인의 표시는 RAR 메시지에서 반송된다. 일부 양태들에서, PUSCH 반복 요청 승인의 표시는 RAR 메시지의 물리 다운링크 제어 채널 부분에서 반송된다. 일부 양태들에서, 프로세스 는 기지국으로부터, RAR 메시지를 수신하는 단계 - RAR 메시지는 RRC 접속 요 청 메시지에 대한 PUSCH 리소스, 또는 RRC 접속 요청 메시지와 연관된 PUSCH 파라미터 중 적어도 하나를 표시함 -; 및 RAR 메시지에 적어도 부분적으로 기초하여, PUSCH 반복 파라미터 또는 PUSCH 반복 리소스 중 적어도 하나 를 결정하는 단계를 포함한다. 일부 양태들에서, PUSCH 반복 파라미터 또는 PUSCH 반복 리소스 중 적어도 하나를 결정하는 것은, 무선 통신 표준에 의해 표시된 하나 이상의 규칙들에 적어도 부분적으로 기반하여 PUSCH 반복 파라미터 또는 PUSCH 반복 리소스 중 적어도 하나를 결정하는 것을 포함한다. 도 5에 추가로 도시된 바와 같이, 일부 양태들에서, 프로세스는 요청에 적어도 부분적으로 기반하여 RRC 접속 요청 메시지와 연관된 적어도 하나의 PUSCH 반복을 송신하는 단계(블록 570)를 포함할 수도 있다. 예 를 들어, UE 는 (예를 들어, 도 9에 도시된 송신 컴포넌트 를 사용하여) 상기 설명된 바와 같이, 요청에 적어도 부분적으로 기초하여 RRC 접속 요청 메시지와 연관된 적어도 하나의 PUSCH 반복을 송신할 수도 있다. 일부 양태들에서, 적어도 하나의 PUSCH 반복을 송신하는 것은 PUSCH 반복에 대한 요청을 송신하는 것에 적어 도 부분적으로 기반하여 적어도 하나의 PUSCH 반복을 송신하는 것을 포함한다. 프로세스는 위에서 및/또는 본 명세서의 다른 곳에서 설명된 하나 이상의 다른 프로세스들과 관련하여 설 명된 임의의 단일 양태 또는 양태들의 임의의 조합과 같은 추가적인 양태들을 포함할 수도 있다. 도 5 는 프로세스 의 예시적인 블록들을 나타내지만, 일부 양태들에서, 프로세스 는 도 5 에 도시된 것들보 다 추가적인 블록들, 더 적은 블록들, 상이한 블록들, 또는 상이하게 배열된 블록들을 포함할 수도 있다. 추가적으로, 또는 대안적으로, 프로세스의 블록들 중 둘 이상은 병렬로 수행될 수도 있다. 도 6 은 본 개시에 따른, 예를 들어, UE에 의해 수행되는 예시적인 프로세스 를 예시하는 다이어그램이다. 예시적인 프로세스 는 UE (예를 들어, UE ) 가 RACH 절차에서 RRC 접속 요청 메시지와 연관된 PUSCH 반복을 위한 요청들과 연관된 동작들을 수행하는 예이다. 도 6에 도시된 바와 같이, 일부 양태들에서, 프로세스 는 기지국으로부터, 하나 이상의 대체 주파수 리소 스들을 표시하는 리소스 파라미터를 수신하는 것을 포함할 수도 있다 (블록 610). 예를 들어, UE 는 (예를 들어, 도 9에 도시된 수신 컴포넌트 를 사용하여) 상기 설명된 바와 같이, 기지국으로부터, 하나 이상의 대체 주파수 리소스들을 표시하는 리소스 파라미터를 수신할 수도 있다. 일부 양태들에서, 리소스 파라미터 는 SI 를 통해 수신된다. 일부 양태들에서, SI는 RMSI를 포함한다. 일부 양태들에서, 리소스 파라미터 는 주파수 오프셋을 포함한다. 도 6에 도시된 바와 같이, 일부 양태들에서, 프로세스 는 PRACH 송신을 위한 하나 이상의 대체 주파수 리 소스들을 결정하는 것을 포함할 수도 있고, 여기서, 하나 이상의 대체 주파수 리소스들의 사용은 PUSCH 반복 정 보를 통신한다 (블록 620). 예를 들어, UE 는 (예를 들어, 도 9에 도시된 결정 컴포넌트 를 사용하여) 상기 설명된 바와 같이, PRACH 송신을 위한 하나 이상의 대체 주파수 리소스들을 결정할 수도 있고, 여기서, 하나 이상의 대체 주파수 리소스들의 사용은 PUSCH 반복 정보를 통신한다. 일부 양태들에서, 하나 이상의 대체 주파수 리소스들은 PUSCH 반복 없이 단일 PUSCH 송신과 연관된 PRACH 송신 에 대한 하나 이상의 주파수 리소스들과 상이하다. 일부 양태들에서, 하나 이상의 대체 주파수 리소스들은 리소스 파라미터에 기초하여 결정된다. 일부 양태들에서, 하나 이상의 대체 주파수 리소스들을 결정하는 것 은 PUSCH 반복 없이 단일 PUSCH 송신과 연관된 PRACH 송신을 위한 하나 이상의 주파수 리소스들에 주파수 오프 셋을 적용함으로써 하나 이상의 대체 주파수 리소스들을 결정하는 것을 포함한다. 도 6에 추가로 도시된 바와 같이, 일부 양태들에서, 프로세스 는 PUSCH 반복 정보를 통신하기 위해 하 나 이상의 대체 주파수 리소스들을 사용하여 PRACH 메시지를 기지국에 송신하는 단계 (블록 630) 를 포함할 수 도 있다. 예를 들어, UE 는 (예를 들어, 도 9에 도시된 송신 컴포넌트 를 사용하여) 상기 설명된 바 와 같이, PUSCH 반복 정보를 통신하기 위해 하나 이상의 대체 주파수 리소스들을 사용하여 PRACH 메시지를 기지 국에 송신할 수도 있다. 일부 양태들에서, PUSCH 반복 정보는 PUSCH 반복에 대한 요청 또는 PUSCH 반복에 대한 UE 능력의 표시 중 적어 도 하나에 대응하는 하나 이상의 파라미터들을 표시한다. 일부 양태들에서, 하나 이상의 파라미터들은, PUSCH 반복에 대한 요청, UE 능력의 표시, PUSCH 반복들의 수, PUSCH 반복에 대한 요청 또는 UE 능력의 표시 중 적어도 하나가 크로스-슬롯 채널 추정을 위한 DMRS 집성을 갖는 PUSCH 반복과 연관된다는 표시, PUSCH 반복이 하나 이상의 TCI들과 연관된다는 표시, 또는 PUSCH 반복에 대한 요청 또는 UE 능력의 표시 중 적어도 하나가 주 파수 호핑을 갖는 PUSCH 반복과 연관된다는 표시 중 적어도 하나를 포함한다. 일부 양태들에서, 하나 이상 의 대체 주파수 리소스들은 하나 이상의 파라미터들의 각각에 대해 상이하다. 도 6에 추가로 도시된 바와 같이, 일부 양태들에서, 프로세스 는 PUSCH 반복 정보에 기초하여 하나 이상 의 PUSCH 리소스들의 표시 또는 PUSCH 파라미터 중 적어도 하나를 수신하는 단계를 포함할 수도 있다 (블록 640). 예를 들어, UE 는 (예를 들어, 도 9에 도시된 수신 컴포넌트 를 사용하여) 상기 설명된 바와 같이, PUSCH 반복 정보에 기초하여 하나 이상의 PUSCH 리소스들의 표시 또는 PUSCH 파라미터 중 적어도 하나를 수신할 수도 있다. 도 6에 추가로 도시된 바와 같이, 일부 양태들에서, 프로세스 는 PUSCH 반복을 위한 송신 전력과 연관된 적어도 하나의 송신 전력 파라미터를 결정하는 것을 포함할 수도 있다 (블록 650). 예를 들어, UE 는 (예를 들어, 도 9에 도시된 결정 컴포넌트 를 사용하여) 상기 설명된 바와 같이, PUSCH 반복을 위한 송신 전력 과 연관된 적어도 하나의 송신 전력 파라미터를 결정할 수도 있다. 도 6에 추가로 도시된 바와 같이, 일부 양태들에서, 프로세스 는 적어도 하나의 송신 전력 파라미터에 기초하여 PUSCH 반복을 위한 송신 전력을 구성하는 단계를 포함할 수도 있다 (블록 660). 예를 들어, UE 는 (예를 들어, 도 9에 도시된 송신 컴포넌 트 를 사용하여) 상기 설명된 바와 같이, 적어도 하나의 송신 전력 파라미터에 기초하여 PUSCH 반복을 위 한 송신 전력을 구성할 수도 있다. 일부 양태들에서, 적어도 하나의 송신 전력 파라미터는 PRACH 송신을 위해 결정된 하나 이상의 대체 주파수 리 소스들에 기초하여 결정된다. 일부 양태들에서, 적어도 하나의 송신 전력 파라미터를 결정하는 단계는 기지 국으로부터 적어도 하나의 송신 전력 파라미터를 수신하는 단계를 포함한다. 일부 양태들에서, 적어도 하나 의 송신 전력 파라미터는 PUSCH 반복에 대한 송신 전력과 PRACH 송신에 대한 제 2 송신 전력 사이의 전력 오프 셋 값을 포함한다. 도 6에 추가로 도시된 바와 같이, 일부 양태들에서, 프로세스 는 PUSCH 반복 정보에 기초하여 PUSCH 메시 지 및 PUSCH 메시지의 적어도 하나의 반복을 송신하는 것을 포함할 수도 있다 (블록 670). 예를 들어, UE 는 (예를 들어, 도 9에 도시된 송신 컴포넌트 를 사용하여) 상기 설명된 바와 같이, PUSCH 반복 정보에 기초하여 PUSCH 메시지 및 PUSCH 메시지의 적어도 하나의 반복을 송신할 수도 있다. 일부 양태들에서, PUSCH 메시지 및 PUSCH 메시지의 적어도 하나의 반복은 하나 이상의 PUSCH 리소스들 또는 PUSCH 파라미터 중 적 어도 하나를 사용하여 송신된다. 프로세스는 아래에서 및/또는 본 명세서의 다른 곳에서 설명된 하나 이상의 다른 프로세스들과 관련하여 설명된 임의의 단일 양태 또는 양태들의 임의의 조합과 같은 추가적인 양태들을 포함할 수도 있다. 도 6 은프로세스 의 예시적인 블록들을 나타내지만, 일부 양태들에서, 프로세스 는 도 6 에 도시된 것들보 다 추가적인 블록들, 더 적은 블록들, 상이한 블록들, 또는 상이하게 배열된 블록들을 포함할 수도 있다. 추가적으로 또는 대안으로, 프로세스 의 블록들 중 2 개 이상이 병렬로 수행될 수도 있다. 도 7 은 본 개시에 따른, 예를 들어, 기지국에 의해 수행되는 예시적인 프로세스 를 예시하는 다이어그램 이다. 예시적인 프로세스는 기지국(예를 들어, 기지국)이 RACH 절차에서 RRC 접속 요청 메시지와 연관된 PUSCH 반복에 대한 요청들과 연관된 동작들을 수행하는 예이다. 도 7에 도시된 바와 같이, 일부 양태들에서, 프로세스 는 PUSCH 반복에 대한 요청에 대응하는 하나 이상 의 요청 파라미터들과 하나 이상의 PRACH 파라미터들 사이의 관계를 표시하는 파라미터 구성을 UE에 송신하는 단계 (블록 710) 를 포함할 수도 있다. 예를 들어, 기지국은 (예를 들어, 도 11에 도시된 송신 컴포넌트 를 사용하여) 상기 설명된 바와 같이, PUSCH 반복에 대한 요청에 대응하는 하나 이상의 요청 파라미터들 과 하나 이상의 PRACH 파라미터들 사이의 관계를 표시하는 파라미터 구성을 UE에 송신할 수도 있다. 일부 양태들에서, 파라미터 구성은 SI에서 반송된다. 일부 양태에서, SI는 RMSI를 포함한다. 일부 양태들에 서, 관계는 무선 통신 표준에 의해 표시된다. 도 7에 도시된 바와 같이, 일부 양태들에서, 프로세스는 하나 이상의 트리거 기준들을 표시하는 트리거 구 성을 UE에 송신하는 단계(블록 720)를 포함할 수도 있다. 예를 들어, 기지국은 (예를 들어, 도 11에 도시된 송신 컴포넌트 를 사용하여) 상술된 바와 같이, 하나 이상의 트리거 기준들을 표시하는 트리거 구성을 UE에 송신할 수도 있다. 일부 양태들에서, 트리거 구성은 SI에서 반송된다. 일부 양태에서, SI는 RMSI 를 포함한다. 일부 양태들에서, 하나 이상의 트리거 기준들은 제 1 RSRP 임계치를 포함한다. 일부 양태 들에서, 하나 이상의 트리거 기준들은 무선 통신 표준에 표시된다. 도 7에 도시된 바와 같이, 일부 양태들에서, 프로세스 는 UE 로부터, RACH 절차의 RRC 접속 요청 메시지 와 연관된 PUSCH 반복에 대한 요청을 수신하는 것을 포함할 수도 있다 (블록 730). 예를 들어, 기지국은 (예를 들어, 도 11에 도시된 수신 컴포넌트 를 사용하여) 상기 설명된 바와 같이, UE 로부터, RACH 절차 의 RRC 접속 요청 메시지와 연관된 PUSCH 반복에 대한 요청을 수신할 수도 있다. 일부 양태들에서, PUSCH 반복에 대한 요청은 PUSCH 반복에 대응하는 하나 이상의 제안된 파라미터들을 표시한다. 일부 양태들에서, 하나 이상의 제안된 파라미터들은 PUSCH 반복들의 수를 표시한다. 일부 양 태들에서, PUSCH 반복에 대한 요청은 크로스-슬롯 채널 추정을 위한 집성된 복조 레퍼런스 신호에 대한 요청을 표시한다. 일부 양태들에서, PUSCH 반복에 대한 요청은 하나 이상의 송신 구성 표시자들과 연관된 PUSCH 반 복에 대한 요청을 포함한다. 일부 양태들에서, PUSCH 반복에 대한 요청은 주파수 호핑을 갖는 PUSCH 반복에 대한 요청을 포함한다. 일부 양태들에서, PUSCH 반복에 대한 요청을 수신하는 단계는 PUSCH 반복에 대한 요청을 표시하는 PRACH 메시지 를 수신하는 단계를 포함한다. 일부 양태들에서, PUSCH 반복에 대한 요청을 수신하는 것은 복수의 RACH 어 케이전들을 통해 반복된 PRACH 메시지를 수신하는 것을 포함한다. 일부 양태들에서, PUSCH 반복에 대한 요 청을 수신하는 단계는 PRACH 프리앰블들의 세트의 PRACH 프리앰블들의 서브세트로부터 선택되는 PRACH 프리앰블 을 수신하는 단계를 포함하고, 여기서 서브세트는 PUSCH 반복에 대한 요청을 표시한다. 일부 양태들에서, PUSCH 반복에 대한 요청을 수신하는 단계는 RO들의 세트의 RO들의 서브세트를 사용하여 PRACH 메시지를 수신하 는 단계를 포함하고, RO들의 서브세트는 PUSCH 반복에 대한 요청을 표시한다. 일부 양태들에서, PUSCH 반복에 대한 요청을 수신하는 단계는 PUSCH 반복에 대한 요청을 표시하는 PRACH 포맷을 사용하여 PRACH 메시지를 수신하는 단계를 포함한다. 일부 양태들에서, PRACH 메시지를 수신하는 것은 하나 이상의 PRACH 파라미터들에 적어도 부분적으로 기초하여 PRACH 메시지를 수신하는 것을 포함한다. 일부 양 태들에서, 하나 이상의 PRACH 파라미터들의 선택은 PUSCH 반복에 대한 요청에 대응하는 하나 이상의 요청 파라 미터들과 하나 이상의 PRACH 파라미터들 사이의 관계에 적어도 부분적으로 기초한다. 도 7에 도시된 바와 같이, 일부 양태들에서, 프로세스는 PUSCH 반복 요청 승인의 표시를 UE에 송신하는 단 계를 포함할 수도 있으며, 여기서 PUSCH 반복 요청 승인은 PUSCH 반복 요청의 적어도 부분에 대응한다(블록 740). 예를 들어, 기지국은 (예를 들어, 도 11에 도시된 송신 컴포넌트 를 사용하여) 상술된 바와 같이, UE에, PUSCH 반복 요청 승인의 표시를 송신할 수도 있고, 여기서 PUSCH 반복 요청 승인은, PUSCH 반복 요 청의 적어도 부분에 대응한다. 일부 양태들에서, PUSCH 반복 요청 승인의 표시는 RAR 메시지에서 반송된다. 일부 양태들에서, PUSCH 반복 요청 승인의 표시는 RAR 메시지의 PDCCH 부분에서 반송된다.일부 양태들에서, 프로세스는 RAR 메시지를 UE에 송신하는 단계를 포함하고, RAR 메시지는 RRC 접속 요청 메시지에 대한 PUSCH 리소스 또는 RRC 접속 요청 메시지와 연관된 PUSCH 파라미터 중 적어도 하나를 표시한다. 일부 양태들에서, PUSCH 반복 파라미터 또는 PUSCH 반복 리소스 중 적어도 하나의 결정은 무선 통신 표준에 의해 표시된 하나 이상의 규칙들에 적어도 부분적으로 기반하여 PUSCH 반복 파라미터 또는 PUSCH 반복 리소스 중 적어도 하나의 결정을 포함한다. 도 7에 추가로 도시된 바와 같이, 일부 양태들에서, 프로세스는 요청에 적어도 부분적으로 기반하여 RRC 접속 요청 메시지와 연관된 적어도 하나의 PUSCH 반복을 수신하는 단계를 포함할 수도 있다(블록 750). 예 를 들어, 기지국은 (예를 들어, 도 11에 도시된 수신 컴포넌트 를 사용하여) 상술된 바와 같이, 요청에 적어도 부분적으로 기초하여 RRC 접속 요청 메시지와 연관된 적어도 하나의 PUSCH 반복을 수신할 수도 있다. 일부 양태들에서, 적어도 하나의 PUSCH 반복을 수신하는 단계는 PUSCH 반복에 대한 요청에 적어도 부분적으로 기반하여 적어도 하나의 PUSCH 반복을 수신하는 단계를 포함한다. 일부 양태들에서, PUSCH 반복에 대한 요청을 수신하는 단계는 하나 이상의 트리거 기준들이 충족된다는 결정에 적어도 부분적으로 기반하여 PUSCH 반복에 대한 요청을 수신하는 단계를 포함한다. 일부 양태들에서, 하나 이상의 트리거 기준들이 충족된다는 결정은, 제 1 SSB 기반 RSRP가 제 1 RSRP 임계치를 충족한다는 결정을 포함 한다. 일부 양태들에서, 하나 이상의 트리거 기준들은 제 2 RSRP 임계치를 포함한다. 일부 양태들에서, 하나 이상의 트리거 기준들이 충족된다는 결정은, 제 2 SSB 기반 RSRP가 제 2 RSRP 임계치를 충족한다는 결정을 포함한다. 일부 양태들에서, PUSCH 반복에 대한 요청은 제 1 SSB 기반 RSRP가 제 1 RSRP 임계치를 만족한다 는 결정에 적어도 부분적으로 기초하여 요청된 PUSCH 반복들의 제 1 수를 표시하고, PUSCH 반복에 대한 요청은 제 2 SSB 기반 RSRP가 제 2 RSRP 임계치를 만족한다는 결정에 적어도 부분적으로 기초하여 요청된 PUSCH 반복들 의 제 2 수를 표시한다. 프로세스는 아래에서 및/또는 본 명세서의 다른 곳에서 설명된 하나 이상의 다른 프로세스들과 관련하여 설명된 임의의 단일 양태 또는 양태들의 임의의 조합과 같은 추가적인 양태들을 포함할 수도 있다. 도 7 은 프로세스 의 예시적인 블록들을 나타내지만, 일부 양태들에서, 프로세스 는 도 7 에 도시된 것들보 다 추가적인 블록들, 더 적은 블록들, 상이한 블록들, 또는 상이하게 배열된 블록들을 포함할 수도 있다. 추가적으로 또는 대안으로, 프로세스 의 블록들 중 2 개 이상이 병렬로 수행될 수도 있다. 도 8 은 본 개시에 따른, 예를 들어, 기지국에 의해 수행되는 예시적인 프로세스 를 예시하는 다이어그램 이다. 예시적인 프로세스는 기지국(예를 들어, 기지국)이 RACH 절차에서 RRC 접속 요청 메시지와 연관된 PUSCH 반복에 대한 요청들과 연관된 동작들을 수행하는 예이다. 도 8에 도시된 바와 같이, 일부 양태들에서, 프로세스 는 기지국으로부터, 하나 이상의 대체 주파수 리소 스들을 표시하는 리소스 파라미터를 송신하는 단계 (블록 810) 를 포함할 수도 있다. 예를 들어, 기지국은 (예를 들어, 도 11에 도시된 송신 컴포넌트 를 사용하여) 상기 설명된 바와 같이, 기지국으로부터, 하나 이상의 대체 주파수 리소스들을 표시하는 리소스 파라미터를 송신할 수도 있다. 일부 양태들에서, 리소스 파라미터는 SI 를 통해 송신된다. 일부 양태들에서, SI는 RMSI를 포함한다. 일부 양태들에서, 리소스 파라미터는 주파수 오프셋을 포함한다. 도 8에 도시된 바와 같이, 일부 양태들에서, 프로세스 는 UE 로부터, PRACH 송신을 위한 하나 이상의 대 체 주파수 리소스들을 사용하여 PRACH 메시지를 수신하는 것을 포함할 수도 있다 (블록 820). 예를 들어, 기지국은 (예를 들어, 도 11에 도시된 수신 컴포넌트 를 사용하여) 상술된 바와 같이, PRACH 송신을 위 한 하나 이상의 대체 주파수 리소스들을 사용하여 PRACH 메시지를 UE 로부터 수신할 수도 있다. 일부 양태 들에서, 하나 이상의 대체 주파수 리소스들은 리소스 파라미터에 기초하여 결정된다. 일부 양태들에서, 하 나 이상의 대체 주파수 리소스들은 PUSCH 반복 없이 단일 PUSCH 송신물과 연관된 PRACH 송신을 위한 하나 이상 의 주파수 리소스들과 상이하다. 일부 양태들에서, 하나 이상의 대체 주파수 리소스들은 PUSCH 반복 없이 단일 PUSCH 송신과 연관된 PRACH 송신에 대한 하나 이상의 주파수 리소스들에 주파수 오프셋을 적용함으로써 결 정된다. 도 8에 추가로 도시된 바와 같이, 일부 양태들에서, 프로세스 는 PRACH 메시지를 수신하는데 사용되는 하 나 이상의 대체 주파수 리소스들에 기초하여 PUSCH 반복 정보를 결정하는 것을 포함할 수도 있고, 여기서 하나 이상의 대체 주파수 리소스들의 사용은 PUSCH 반복 정보를 통신한다 (블록 830). 예를 들어, 기지국은 (예 를 들어, 도 11에 도시된 결정 컴포넌트 를 사용하여) 위에서 설명된 바와 같이, PRACH 메시지를 수신하 는데 사용되는 하나 이상의 대체 주파수 리소스들에 기초하여 PUSCH 반복 정보를 결정할 수도 있고, 여기서 하나 이상의 대체 주파수 리소스들의 사용은 PUSCH 반복 정보를 통신한다. 일부 양태들에서, PUSCH 반복 정보는 PUSCH 반복에 대한 요청 또는 PUSCH 반복에 대한 UE 능력의 표시 중 적어 도 하나에 대응하는 하나 이상의 파라미터들을 표시한다. 일부 양태들에서, 하나 이상의 파라미터들은, PUSCH 반복에 대한 요청, UE 능력의 표시, PUSCH 반복들의 수, PUSCH 반복에 대한 요청 또는 UE 능력의 표시 중 적어도 하나가 크로스-슬롯 채널 추정을 위한 DMRS 집성을 갖는 PUSCH 반복과 연관된다는 표시, PUSCH 반복이 하나 이상의 TCI들과 연관된다는 표시, 또는 PUSCH 반복에 대한 요청 또는 UE 능력의 표시 중 적어도 하나가 주 파수 호핑을 갖는 PUSCH 반복과 연관된다는 표시 중 적어도 하나를 포함한다. 일부 양태들에서, 하나 이상 의 대체 주파수 리소스들은 하나 이상의 파라미터들의 각각에 대해 상이하다. 도 8에 추가로 도시된 바와 같이, 일부 양태들에서, 프로세스 는 PUSCH 반복 정보에 기초하여 하나 이상 의 PUSCH 리소스들의 표시 또는 PUSCH 파라미터 중 적어도 하나를 송신하는 단계를 포함할 수도 있다 (블록 840). 예를 들어, 기지국은 (예를 들어, 도 11에 도시된 송신 컴포넌트 를 사용하여) 상기 설명된 바와 같이, PUSCH 반복 정보에 기초하여 하나 이상의 PUSCH 리소스들의 표시 또는 PUSCH 파라미터 중 적어도 하 나를 송신할 수도 있다. 도 8에 추가로 도시된 바와 같이, 일부 양태들에서, 프로세스 는 PUSCH 반복을 위한 송신 전력과 연관된 적어도 하나의 송신 전력 파라미터를 UE에 송신하는 것을 포함할 수도 있다 (블록 850). 예를 들어, 기지국 은 (예를 들어, 도 11에 도시된 송신 컴포넌트 를 사용하여) 상술된 바와 같이, PUSCH 반복을 위한 송신 전력과 연관된 적어도 하나의 송신 전력 파라미터를 UE에 송신할 수도 있다. 일부 양태들에서, 적어도 하나의 송신 전력 파라미터는 PUSCH 반복에 대한 송신 전력과 PRACH 송신에 대한 제 2 송신 전력 사이의 전력 오프셋 값을 포함한다. 일부 양태들에서, PUSCH 반복을 위한 송신 전력은 송신 전력 과 연관된 적어도 하나의 송신 전력 파라미터에 기초하여 구성된다. 일부 양태들에서, 적어도 하나의 송신 전력 파라미터는 PRACH 송신을 위해 결정된 하나 이상의 대체 주파수 리소스들에 기초하여 결정된다. 도 8에 추가로 도시된 바와 같이, 일부 양태들에서, 프로세스 는 PUSCH 반복 정보에 기초하여 PUSCH 메시 지 및 PUSCH 메시지의 적어도 하나의 반복을 UE 로부터 수신하는 단계를 포함할 수도 있다 (블록 860). 예 를 들어, 기지국은 (예를 들어, 도 11에 도시된 수신 컴포넌트 를 사용하여) 상기 설명된 바와 같이, PUSCH 반복 정보에 기초하여 PUSCH 메시지 및 PUSCH 메시지의 적어도 하나의 반복을 UE 로부터 수신할 수도 있 다. 일부 양태들에서, PUSCH 메시지 및 PUSCH 메시지의 적어도 하나의 반복은 하나 이상의 PUSCH 리소스들 또는 PUSCH 파라미터 중 적어도 하나를 사용하여 수신된다. 프로세스는 아래에서 및/또는 본 명세서의 다른 곳에서 설명된 하나 이상의 다른 프로세스들과 관련하여 설명된 임의의 단일 양태 또는 양태들의 임의의 조합과 같은 추가적인 양태들을 포함할 수도 있다. 도 8 은 프로세스 의 예시적인 블록들을 나타내지만, 일부 양태들에서, 프로세스 는 도 8 에 도시된 것들보 다 추가적인 블록들, 더 적은 블록들, 상이한 블록들, 또는 상이하게 배열된 블록들을 포함할 수도 있다. 추가적으로 또는 대안적으로, 프로세스 의 블록들 중 2 개 이상이 병렬로 수행될 수도 있다. 도 9는 무선 통신을 위한 예시적인 장치의 블록도이다. 장치는 UE일 수도 있거나, 또는 UE가 장 치를 포함할 수도 있다. 일부 양태들에서, 장치 는, (예컨대, 하나 이상의 버스들 및/또는 하나 이상의 다른 컴포넌트들을 통해) 서로 통신할 수도 있는 수신 컴포넌트 및 송신 컴포넌트 를 포함 한다. 도시된 바와 같이, 장치 는 수신 컴포넌트 및 송신 컴포넌트 를 사용하여 다른 장 치 (예컨대, UE, 기지국, 또는 다른 무선 통신 디바이스) 와 통신할 수도 있다. 더 도시된 바와 같이, 장치 는 결정 컴포넌트 를 포함할 수도 있다. 일부 양태들에서, 장치는 도 4와 관련하여 본원에 설명된 하나 이상의 동작들을 수행하도록 구성될 수도 있다. 부가적으로 또는 대안적으로, 장치 는 도 5 의 프로세스 , 도 6 의 프로세스 또는 이들의 조합과 같은, 본 명세서에 설명된 하나 이상의 프로세스들을 수행하도록 구성될 수도 있다. 일부 양 태들에서, 도 9에 도시된 장치 및/또는 하나 이상의 컴포넌트들은 도 2 와 관련하여 위에서 설명된 UE 의 하나 이상의 컴포넌트들을 포함할 수도 있다. 추가적으로 또는 대안적으로, 도 9에 도시된 하나 이상의 컴 포넌트들은 도 2와 관련하여 위에서 설명된 하나 이상의 컴포넌트들 내에 구현될 수도 있다. 추가적으로 또 는 대안적으로, 컴포넌트들의 세트의 하나 이상의 컴포넌트들은 메모리에 저장된 소프트웨어로서 적어도 부분적 으로 구현될 수도 있다. 예를 들어, 컴포넌트 (또는 컴포넌트의 일부분) 는 비일시적 컴퓨터 판독가능 매체 에 저장되고 컴포넌트의 기능들 또는 동작들을 수행하기 위해 제어기 또는 프로세서에 의해 실행가능한 명령들또는 코드로서 구현될 수도 있다. 수신 컴포넌트 는 장치 로부터, 레퍼런스 신호들, 제어 정보, 데이터 통신들, 또는 이들의 조합과 같은 통신물들을 수신할 수도 있다. 수신 컴포넌트 는 수신된 통신물들을 장치 의 하나 이상의 다른 컴포넌트에 제공할 수도 있다. 일부 양태들에서, 수신 컴포넌트 는 (다른 예들 중에서, 필터링, 증폭, 복조, 아날로그-디지털 변환, 디멀티플렉싱, 디인터리빙, 디맵핑, 등화, 간섭 소거, 또는 디코딩과 같이) 수신된 통신들에 대한 신호 프로세싱을 수행할 수도 있고, 프로세싱된 신호들을 장치 의 하나 이상의 다 른 컴포넌트들에 제공할 수도 있다. 일부 양태들에서, 수신 컴포넌트 는 도 2 와 관련하여 상기 설명 된 UE 의 하나 이상의 안테나들, 복조기, MIMO 검출기, 수신 프로세서, 제어기/프로세서, 메모리, 또는 이들의 조합을 포함할 수도 있다. 송신 컴포넌트 는 레퍼런스 신호들, 제어 정보, 데이터 통신들, 또는 이들의 조합과 같은 통신물들을 장 치 로 송신할 수도 있다. 일부 양태들에서, 장치 의 하나 이상의 다른 컴포넌트들은 통신물들 을 생성할 수도 있고, 생성된 통신물들을, 장치 로의 송신을 위해 송신 컴포넌트 에 제공할 수도 있다. 일부 양태들에서, 송신 컴포넌트 는 (다른 예들 중에서, 필터링, 증폭, 변조, 디지털-아날로그 변환, 멀티플렉싱, 인터리빙, 맵핑, 또는 인코딩과 같이) 생성된 통신들에 대한 신호 프로세싱을 수행할 수도 있고, 프로세싱된 신호들을 장치 로 송신할 수도 있다. 일부 양태들에서, 송신 컴포넌트 는 도 2 와 관련하여 상기 설명된 UE 의 하나 이상의 안테나들, 변조기, 송신 MIMO 프로세서, 송신 프로세서, 제어기/ 프로세서, 메모리, 또는 이들의 조합을 포함할 수도 있다. 일부 양태들에서, 송신 컴포넌트는 트랜시 버에서 수신 컴포넌트와 병치될 수도 있다. 결정 컴포넌트는 PRACH 송신을 위한 하나 이상의 대체 주파수 리소스들을 결정할 수도 있고, 여기서 하나 이상의 대체 주파수 리소스들의 사용은 PUSCH 반복 정보를 통신한다. 일부 양태들에서, 결정 컴포넌트 는 도 2 와 관련하여 위에서 설명된 UE 의 하나 이상의 안테나들, 변조기, 송신 MIMO 프로세서, 송신 프 로세서, 복조기, MIMO 검출기, 수신 프로세서, 제어기/프로세서, 메모리, 또는 이들의 조합을 포함할 수도 있다. 일부 양태들에서, 결정 컴포넌트 는 수신 컴포넌트 및/또는 송신 컴포넌트 를 포 함할 수도 있다. 송신 컴포넌트 는 PUSCH 반복 정보를 통신하기 위해 하나 이상의 대체 주파수 리소스들을 사용하여 PRACH 메시지를 기지국에 송신할 수도 있다. 수신 컴포넌트 는 기지국으로부터, 하나 이상의 대체 주파수 리소스들을 표시하는 리소스 파라미터를 수신할 수도 있고, 여기서 하나 이상의 대체 주파수 리소스들은 리소스 파라미터에 기초하여 결정된다. 결정 컴포넌트는 PUSCH 반복 요청을 트리거하는 하나 이상의 트리거 기준들이 만족되는 것을 결정하도록 구성될 수도 있다. 결정 컴포넌트는 PUSCH 반복에 대한 송신 전력과 연관된 적어도 하나의 송신 전력 파라미터를 결정할 수도 있다. 송신 컴포넌트 는 적어도 하나의 송신 전력 파라미터에 기초하여 PUSCH 반복을 위한 송신 전력을 구성할 수도 있다. 수신 컴포넌트 는 PUSCH 반복 정보에 기초하여 하 나 이상의 PUSCH 리소스들의 표시 또는 PUSCH 파라미터 중 적어도 하나를 수신할 수도 있고, 여기서 PUSCH 메시 지 및 PUSCH 메시지의 적어도 하나의 반복은 하나 이상의 PUSCH 리소스들 또는 PUSCH 파라미터 중 적어도 하나 를 사용하여 송신된다. 송신 컴포넌트 는 RACH 절차의 RRC 접속 요청 메시지와 연관된 PUSCH 반복에 대한 요청을 기지국에 송신 할 수도 있다. 송신 컴포넌트 는 요청에 적어도 부분적으로 기초하여 RRC 접속 요청 메시지와 연관된 적어도 하나의 PUSCH 반복을 송신할 수도 있다. 송신 컴포넌트 는 PUSCH 반복 정보에 기초하여 PUSCH 메시지 및 PUSCH 메시지의 적어도 하나의 반복을 송신할 수도 있다 도 9에 도시된 컴포넌트들의 수 및 배열은 예로서 제공된다. 실제로, 추가적인 컴포넌트들, 더 적은 컴포넌 트들, 상이한 컴포넌트들, 또는 도 9 에 도시된 것들과 상이하게 배치된 컴포넌트들이 있을 수도 있다. 또 한, 도 9 에 도시된 2 개 이상의 컴포넌트들은, 단일 컴포넌트 내에 구현될 수도 있거나, 또는 도 9 에 도시된 단일 컴포넌트는 다수의 분산된 컴포넌트들로서 구현될 수도 있다. 추가적으로 또는 대안적으로, 도 9에 도 시된 (하나 이상의) 컴포넌트들의 세트는 도 9에 도시된 컴포넌트들의 다른 세트에 의해 수행되는 것으로 설명 된 하나 이상의 기능들을 수행할 수도 있다. 도 10은 프로세싱 시스템을 이용하는 UE에 대한 하드웨어 구현의 예를 예시하는 블록도이다. 예를 들어, UE는 도 1 내지 도 4 중 임의의 하나 이상에 예시된 바와 같은 UE일 수도 있다. 일부 양태들에서, UE는 도 9에 도시된 장치일 수도 있다. UE는 하나 이상의 프로세서들을 포함하는 프로세싱 시스템으로 구현될 수도 있다. 프로 세서들 의 예들은 마이크로프로세서들, 마이크로제어기들, 디지털 신호 프로세서들 (DSP들), 필드 프로 그래밍가능 게이트 어레이들 (FPGA들), 프로그래밍가능 로직 디바이스들 (PLD들), 상태 머신들, 게이트형 로직, 이산 하드웨어 회로들, 및 이 개시물 전체에 걸쳐 설명된 다양한 기능을 수행하도록 구성된 다른 적합한 하드웨 어를 포함한다. 다양한 예들에서, UE는 본원에 설명된 기능들 중 임의의 하나 이상을 수행하도록 구 성될 수도 있다. 즉, 프로세서는, UE에서 이용되는 바와 같이, 아래에서 설명되고 도 5 내지 도 6에 예시된 프로세스들 및 절차들 중 임의의 하나 이상을 구현하는 데 사용될 수도 있다. 이 예에서, 프로세싱 시스템은 일반적으로 버스로 표현되는 버스 아키텍처로 구현될 수도 있다. 버스 는 프로세싱 시스템 의 특정 애플리케이션 및 전체 설계 제약들에 의존하는 임의의 수의 상호접속 버스들 및 브릿지들을 포함할 수도 있다. 버스 는 (프로세서 에 의해 일반적으로 표현된) 하나 이상의 프로세서들, 메모리 , 및 (컴퓨터 판독가능 저장 매체 에 의해 일반적으로 표현된) 컴퓨터 판독가능 매체들을 포함한 다양한 회로들을 통신가능하게 커플링한다. 버스 는 또한 여러 다른 회로들, 이를 테면, 타이밍 소스들, 주변기기들, 전압 레귤레이터들, 및 전력 관리 회로들을 링크할"}
{"patent_id": "10-2023-7023438", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "수도 있으며, 이는 당해 기술분야에서 공지되어 있으므로, 더 이상 설명되지 않을 것이다. 버스 인터페이스 는 버스 와 트랜시버 간의 인터페이스를 제공한다. 트랜시버 는 송신 매체 상 으로 다양한 다른 장치와 통신하기 위한 수단 또는 통신 인터페이스를 제공한다. 장치들의 특성에 의존하여, 사용자 인터페이스 (예컨대, 키패드, 디스플레이, 스피커, 마이크로폰, 조이스틱) 가 또한 제 공될 수도 있다. 본 개시의 일부 양태들에서, 프로세서 는, 예를 들어, 사용될 통신 리소스들을 결정하는 것을 포함하는 다양한 기능들을 위해 구성된 리소스 관리 회로부 를 포함할 수도 있다. 예를 들어, 일부 양태들에 서, 리소스 관리 회로부는 도 9에 도시된 결정 컴포넌트를 포함하거나 그에 포함될 수도 있다. 본 개시의 일부 양태들에서, 프로세서 는 예를 들어, 통신물들을 송신 및 수신하는 것을 포함하는 다양 한 기능들을 위해 구성된 통신 관리 회로부 를 포함할 수도 있다. 예를 들어, 일부 양태들에서, 통 신 관리 회로부 는 도 9에 도시된 수신 컴포넌트 및/또는 송신 컴포넌트 를 포함하거나 그 안에 포함될 수도 있다. 본 개시의 일부 양태들에서, 프로세서 는 예를 들어, 송신들을 위한 송신 전력을 결정하고 구성하는 것을 포함하는 다양한 기능들을 위해 구성된 송신 전력 관리 회로부 를 포함 할 수도 있다. 예를 들어, 일부 양태들에서, 송신 전력 관리 회로부 는 도 9에 도시된 결정 컴포넌 트 및/또는 송신 컴포넌트 를 포함하거나 그 안에 포함될 수도 있다. 프로세서는 버스를 관리하는 것 및 컴퓨터 판독 가능 저장 매체에 저장된 소프트웨어의 실행 을 포함하는 일반적인 프로세싱을 담당한다. 소프트웨어는, 프로세서 에 의해 실행될 경우, 프로세 싱 시스템 으로 하여금 임의의 특정 장치에 대해 하기에서 설명되는 다양한 기능들을 수행하게 한다. 컴퓨터 판독가능 저장 매체 및 메모리 는 또한, 소프트웨어를 실행할 경우 프로세서 에 의해 조작되는 데이터를 저장하기 위해 사용될 수도 있다. 프로세싱 시스템의 하나 이상의 프로세서들은 소프트웨어를 실행할 수도 있다. 소프트웨어는, 소프트 웨어, 펌웨어, 미들웨어, 마이크로코드, 하드웨어 디스크립션 언어, 또는 기타 등등으로서 지칭되든 아니든, 명 령들, 명령 셋트들, 코드, 코드 세그먼트들, 프로그램 코드, 프로그램들, 서브프로그램들, 소프트웨어 모듈들, 애플리케이션들, 소프트웨어 애플리케이션들, 소프트웨어 패키지들, 루틴들, 서브루틴들, 오브젝트들, 실행가능 물들, 실행 스레드들, 절차들, 함수들 등을 의미하도록 넓게 해석될 것이다. 소프트웨어는 컴퓨터 판독가능 저장 매체 상에 상주할 수도 있다. 컴퓨터 판독가능 저장 매체 는 비일시적 컴퓨터 판독가능 저장 매체일 수도 있다. 비일시적인 컴퓨터 판독가능 저장 매체는, 예로서, 자기 저장 디바이스 (예를 들어, 하드 디스크, 플로피 디스크, 자기 스트립), 광학 디스크 (예를 들어, 콤팩트 디스크 (CD) 또는 디지털 다기능 디스크 (DVD)), 스마트 카드, 플래시 메모리 디바이스 (예를 들어, 카드, 스틱, 또는 키 드라이브), 랜 덤 액세스 메모리 (RAM), 판독 전용 메모리 (ROM), 프로그램가능 ROM (PROM), 소거가능 PROM (EPROM), 전기적 으로 소거가능 PROM (EEPROM), 레지스터, 착탈가능 디스크, 및 컴퓨터에 의해 액세스 및 판독될 수도 있는 소프 트웨어 및/또는 명령들을 저장하기 위한 임의의 다른 적절한 매체를 포함한다. 컴퓨터 판독가능 저장 매체 는 프로세싱 시스템 내에 상주할 수도 있거나, 프로세싱 시스템 외부에 있을 수도 있거나, 또는 프로세싱 시스템 을 포함한 다중의 엔티티들에 걸쳐 분산될 수도 있다. 컴퓨터 판독 가능 저장 매체는 컴퓨터 프로그램 제품에서 구현될 수도 있다. 예로서, 컴퓨터 프로그램 제품은 패키징 재료들에 컴퓨터 판독가능 저장 매체를 포함할 수도 있다. 당업자는 전체 시스템에 부과되는 전반적인 설계 제약 및 특정 애플리케이션들에 따라, 본 개시 전체에 걸쳐 제시된 설명된 기능성을 구현하기 위한 최선의 방법을 인식할 것이다. 하나 이상의 예들에서, 컴퓨터 판독가능 저장 매체 는 예를 들어, 사용될 통신 리소스들을 결정하는 것 을 포함한, 다양한 기능들을 위해 구성된 리소스 관리 소프트웨어/명령들 을 포함할 수도 있다. 예 를 들어, 리소스 관리 소프트웨어/명령들 은 도 9에 도시된 결정 컴포넌트 를 포함하거나 그 안에 포함될 수도 있다. 하나 이상의 예들에서, 컴퓨터 판독가능 저장 매체 는, 예를 들어, 통신물들을 송신 및 수신하는 것을 포함하는 다양한 기능들을 위해 구성된 통신 관리 소프트웨어/명령들 을 포함할 수도 있다. 예를 들어, 통신 관리 소프트웨어/명령들 은 도 9에 도시된 수신 컴포넌트 및/또 는 송신 컴포넌트 를 포함하거나 또는 그 안에 포함될 수도 있다. 하나 이상의 예들에서, 컴퓨터 판 독가능 저장 매체 는, 예를 들어, 송신들을 위한 송신 전력을 결정 및 구성하는 것을 포함하는 다양한 기능들을 위해 구성된 송신 전력 관리 소프트웨어/명령들 을 포함할 수도 있다. 예를 들어, 송신 전 력 관리 소프트웨어/명령들 은 도 9에 도시된 결정 컴포넌트 및/또는 송신 컴포넌트 를 포 함하거나 그 안에 포함될 수도 있다. 도 10에 도시된 컴포넌트들의 수 및 배열은 예로서 제공된다. 실제로, 추가적인 컴포넌트들, 더 적은 컴포 넌트들, 상이한 컴포넌트들, 또는 도 10 에 도시된 것들과 상이하게 배치된 컴포넌트들이 있을 수도 있다. 또한, 도 10 에 도시된 2 개 이상의 컴포넌트들은, 단일 컴포넌트 내에 구현될 수도 있거나, 또는 도 10 에 도 시된 단일 컴포넌트는 다수의 분산된 컴포넌트들로서 구현될 수도 있다. 추가적으로 또는 대안적으로, 도 10에 도시된 (하나 이상의) 컴포넌트들의 세트는 도 10에 도시된 컴포넌트들의 다른 세트에 의해 수행되는 것으 로 설명된 하나 이상의 기능들을 수행할 수도 있다. 도 11은 무선 통신을 위한 예시적인 장치의 블록도이다. 장치는 기지국일 수도 있거나, 기지국 이 장치를 포함할 수도 있다. 일부 양태들에 있어서, 장치 는, (예를 들어, 하나 이상의 버스 들 및/또는 하나 이상의 다른 컴포넌트들을 통해) 서로 통신할 수도 있는 수신 컴포넌트 및 송신 컴포넌 트 를 포함한다. 도시된 바와 같이, 장치 는 수신 컴포넌트 및 송신 컴포넌트 를 사용하여 다른 장치 (예컨대, UE, 기지국, 또는 다른 무선 통신 디바이스) 와 통신할 수도 있 다. 더 도시된 바와 같이, 장치 는 결정 컴포넌트 를 포함할 수도 있다. 일부 양태들에서, 장치는 도 4와 관련하여 본원에 설명된 하나 이상의 동작들을 수행하도록 구성될 수도 있다. 부가적으로 또는 대안적으로, 장치 는 도 7 의 프로세스 , 도 8 의 프로세스 또는 이들의 조합과 같은, 본 명세서에 설명된 하나 이상의 프로세스들을 수행하도록 구성될 수도 있다. 일부 양 태들에서, 도 11에 도시된 장치 및/또는 하나 이상의 컴포넌트들은 도 2 와 관련하여 위에서 설명된 기 지국의 하나 이상의 컴포넌트들을 포함할 수도 있다. 추가적으로 또는 대안적으로, 도 11에 도시된 하나 이 상의 컴포넌트들은 도 2와 관련하여 위에서 설명된 하나 이상의 컴포넌트들 내에 구현될 수도 있다. 추가적 으로 또는 대안적으로, 컴포넌트들의 세트의 하나 이상의 컴포넌트들은 메모리에 저장된 소프트웨어로서 적어도 부분적으로 구현될 수도 있다. 예를 들어, 컴포넌트 (또는 컴포넌트의 일부분) 는 비일시적 컴퓨터 판독가 능 매체에 저장되고 컴포넌트의 기능들 또는 동작들을 수행하기 위해 제어기 또는 프로세서에 의해 실행가능한 명령들 또는 코드로서 구현될 수도 있다. 수신 컴포넌트 는 장치 로부터, 레퍼런스 신호들, 제어 정보, 데이터 통신들, 또는 이들의 조합 과 같은 통신물들을 수신할 수도 있다. 수신 컴포넌트 는 수신된 통신물들을 장치 의 하나 이상의 다른 컴포넌트에 제공할 수도 있다. 일부 양태들에서, 수신 컴포넌트 는 (다른 예들 중에서, 필터링, 증폭, 복조, 아날로그-디지털 변환, 디멀티플렉싱, 디인터리빙, 디맵핑, 등화, 간섭 소거, 또는 디코딩 과 같이) 수신된 통신들에 대한 신호 프로세싱을 수행할 수도 있고, 프로세싱된 신호들을 장치 의 하나 이상의 다른 컴포넌트들에 제공할 수도 있다. 일부 양태들에서, 수신 컴포넌트 는 도 2 와 관련하여 상기 설명된 기지국의 하나 이상의 안테나들, 복조기, MIMO 검출기, 수신 프로세서, 제어기/프로세서, 메모리, 또는 이들의 조합을 포함할 수도 있다. 송신 컴포넌트 는 레퍼런스 신호들, 제어 정보, 데이터 통신들, 또는 이들의 조합과 같은 통신물들을 장 치 로 송신할 수도 있다. 일부 양태들에서, 장치 의 하나 이상의 다른 컴포넌트들은 통신물 들을 생성할 수도 있고, 생성된 통신물들을, 장치 로의 송신을 위해 송신 컴포넌트 에 제공할 수 도 있다. 일부 양태들에 있어서, 송신 컴포넌트 는 (다른 예들 중에서, 필터링, 증폭, 변조, 디지털-아날로그 변환, 멀티플렉싱, 인터리빙, 맵핑, 또는 인코딩과 같이) 생성된 통신물들에 대한 신호 프로세싱을 수행할 수도 있고, 프로세싱된 신호들을 장치 로 송신할 수도 있다. 일부 양태들에서, 송신 컴포넌 트 는 도 2 와 관련하여 상기 설명된 기지국의 하나 이상의 안테나들, 변조기, 송신 MIMO 프로세서, 송 신 프로세서, 제어기/프로세서, 메모리, 또는 이들의 조합을 포함할 수도 있다. 일부 양태들에서, 송신 컴 포넌트는 트랜시버에서 수신 컴포넌트와 병치될 수도 있다. 수신 컴포넌트 는 UE 로부터, RACH 절차의 RRC 접속 요청 메시지와 연관된 PUSCH 반복에 대한 요청을 수 신할 수도 있다. 수신 컴포넌트 는, UE 로부터, PRACH 송신을 위한 하나 이상의 대체 주파수 리소스 들을 이용하여 PRACH 메시지를 수신할 수도 있다. 결정 컴포넌트는 PRACH 메시지를 수신하기 위해 사용되는 하나 이상의 대체 주파수 리소스들에 기초하여 PUSCH 반복 정보를 결정할 수도 있고, 하나 이상의 대체 주파수 리소스들의 사용은 PUSCH 반복 정보를 통신한다. 일부 양태들에서, 결정 컴포넌트 는 도 2 와 관련하여 위에서 설명된 기지국의 하나 이상 의 안테나들, 변조기, 송신 MIMO 프로세서, 송신 프로세서, 복조기, MIMO 검출기, 수신 프로세서, 제어기/프로 세서, 메모리, 또는 이들의 조합을 포함할 수도 있다. 일부 양태들에서, 결정 컴포넌트 는 수신 컴 포넌트 및/또는 송신 컴포넌트 를 포함할 수도 있다. 수신 컴포넌트는 PUSCH 반복 정보에 기초하여 PUSCH 메시지 및 PUSCH 메시지의 적어도 하나의 반복을 UE 로부터 수신할 수도 있다. 수신 컴포넌트는 요청에 적어도 부분적으로 기초하여 RRC 접속 요청 메시 지와 연관된 적어도 하나의 PUSCH 반복을 수신할 수도 있다. 결정 컴포넌트 는 PRACH 메시지가 PUSCH 반복 요청을 표시한다고 결정할 수도 있다. 송신 컴포넌트는 PUSCH 반복 정보에 기초하여 하나 이상의 PUSCH 리소스들의 표시 또는 PUSCH 파라미터 중 적어도 하나를 송신할 수도 있고, 여기서 PUSCH 메시지 및 PUSCH 메시지의 적어도 하나의 반복은 하나 이상 의 PUSCH 리소스들 또는 PUSCH 파라미터 중 적어도 하나를 사용하여 수신된다. 송신 컴포넌트 는 기 지국으로부터, 하나 이상의 대체 주파수 리소스들을 표시하는 리소스 파라미터를 송신할 수도 있고, 여기서 하 나 이상의 대체 주파수 리소스들은 리소스 파라미터에 기초하여 결정된다. 송신 컴포넌트 는 적어도 하나의 송신 전력 파라미터를 UE에 송신할 수도 있다. 도 11에 도시된 컴포넌트들의 수 및 배열은 예로서 제공된다. 실제로, 추가적인 컴포넌트들, 더 적은 컴포 넌트들, 상이한 컴포넌트들, 또는 도 11 에 도시된 것들과 상이하게 배치된 컴포넌트들이 있을 수도 있다. 또한, 도 11 에 도시된 2 개 이상의 컴포넌트들은, 단일 컴포넌트 내에 구현될 수도 있거나, 또는 도 11 에 도 시된 단일 컴포넌트는 다수의 분산된 컴포넌트들로서 구현될 수도 있다. 추가적으로 또는 대안적으로, 도 11에 도시된 (하나 이상의) 컴포넌트들의 세트는 도 11에 도시된 컴포넌트들의 다른 세트에 의해 수행되는 것으 로 설명된 하나 이상의 기능들을 수행할 수도 있다. 도 12 는 프로세싱 시스템 을 채용하는 예시적인 기지국 에 대한 하드웨어 구현의 일 예를 예시하 는 개념도이다. 본 개시의 다양한 양태들에 따르면, 엘리먼트, 또는 엘리먼트의 임의의 부분, 또는 엘리먼 트들의 임의의 조합은, 하나 이상의 프로세서들 을 포함하는 프로세싱 시스템 으로 구현될 수도 있다. 예를 들어, 기지국 은 도 1 내지 도 4 중 임의의 하나 이상에 예시된 바와 같은 기지국일 수 도 있다. 일부 양태들에서, 기지국은 도 11에 도시된 장치일 수도 있다. 프로세싱 시스템은 버스 인터페이스, 버스, 메모리, 프로세서 및 컴퓨터 판독 가능 저장 매체를 포함하여, 도 10에 도시된 프로세싱 시스템과 실질적으로 동일할 수도 있다. 또한, 기지국 은 도 10에서 상술된 것들과 실질적으로 유사한 사용자 인터페이스 및 트랜시버 를 포함할 수도 있다. 즉, 프로세서는, 기지국에서 이용되는 바와 같이, 아래에서 설명 되고 도 7 내지 도 8에 예시된 프로세스들 중 임의의 하나 이상을 구현하는 데 사용될 수도 있다. 본 개시의 일부 양태들에서, 프로세서 는 예를 들어, 통신물들을 송신 및 수신하는 것을 포함하는 다양 한 기능들을 위해 구성된 통신 관리 회로부 를 포함할 수도 있다. 예를 들어, 통신 관리 회로부 는 도 11에 도시된 수신 컴포넌트 및/또는 송신 컴포넌트 를 포함하거나 그 안에 포함될 수도 있다. 본 개시의 일부 양태들에서, 프로세서 는, 예를 들어, 사용될 통신 리소스들을 결정하는 것을 포함한, 다양한 기능들을 위해 구성된 리소스 관리 회로부 를 포함할 수도 있다. 예를 들어, 리소스 관리 회로부 는 도 11에 도시된 결정 컴포넌트 를 포함하거나 그 안에 포함될 수도 있다. 본 개시의 일부 양태들에서, 프로세서 는 예를 들어, 송신들을 위한 송신 전력을 결정하고 구성하는것을 포함하는 다양한 기능들을 위해 구성된 송신 전력 관리 회로부 를 포함할 수도 있다. 예를 들 어, 송신 전력 관리 회로부는, 도 11에 도시된 결정 컴포넌트 및/또는 송신 컴포넌트를 포함 하거나 그에 포함될 수도 있다. 하나 이상의 예들에서, 컴퓨터 판독가능 저장 매체 는, 예를 들어, 통신물들을 송신 및 수신하는 것을 포함하는 다양한 기능들을 위해 구성된 통신 관리 소프트웨어/명령들 을 포함할 수도 있다. 예를 들 어, 통신 관리 소프트웨어/명령들 은 도 11에 도시된 수신 컴포넌트 및/또는 송신 컴포넌트 를 포함하거나 또는 그 안에 포함될 수도 있다. 하나 이상의 예들에서, 컴퓨터 판독가능 저장 매체 는 예를 들어, 사용될 통신 리소스들을 결정하는 것을 포함한, 다양한 기능들을 위해 구성된 리소스 관 리 소프트웨어/명령들 을 포함할 수도 있다. 예를 들어, 리소스 관리 소프트웨어/명령들 은 도 11에 도시된 결정 컴포넌트 를 포함하거나 그 안에 포함될 수도 있다. 하나 이상의 예들에서, 컴 퓨터 판독가능 저장 매체 는, 예를 들어, 송신들을 위한 송신 전력을 결정 및 구성하는 것을 포함하는 다양한 기능들을 위해 구성된 송신 전력 관리 소프트웨어/명령들 을 포함할 수도 있다. 예를 들어, 송신 전력 관리 소프트웨어/명령들 은 도 11에 도시된 결정 컴포넌트 및/또는 송신 컴포넌트 를 포함하거나 그 안에 포함될 수도 있다. 다음은 본 개시의 일부 양태들의 개요를 제공한다. 양태 1: 사용자 장비(UE)에 의해 수행되는 무선 통신의 방법으로서, 랜덤 액세스 채널 (RACH) 절차의 라디오 리 소스 제어 (RRC) 접속 요청 메시지와 연관된 물리 업링크 공유 채널 (PUSCH) 반복에 대한 요청을 기지국에 송신 하는 단계; 및 상기 요청에 적어도 부분적으로 기초하여 상기 RRC 접속 요청 메시지와 연관된 적어도 하나의 PUSCH 반복을 송신하는 단계를 포함하는, 사용자 장비(UE)에 의해 수행되는 무선 통신의 방법. 양태 2: 양태 1 의 방법에 있어서, PUSCH 반복에 대한 요청은 PUSCH 반복에 대응하는 하나 이상의 제안된 파라 미터들을 표시하는, 방법. 양태 3: 양태 2 의 방법에 있어서, 하나 이상의 제안된 파라미터들은 PUSCH 반복들의 수를 표시하는, 방법. 양태 4: 양태 1 내지 양태 3 중 어느 것의 방법에 있어서, PUSCH 반복에 대한 요청은 크로스-슬롯 채널 추정을 위한 집성된 복조 레퍼런스 신호에 대한 요청을 표시하는, 방법. 양태 5: 양태 1 내지 양태 4 중 어느 것의 방법에 있어서, PUSCH 반복에 대한 요청은 하나 이상의 송신 구성 표 시자들과 연관된 PUSCH 반복에 대한 요청을 포함하는, 방법. 양태 6: 양태 1 내지 양태 5 중 어느 것의 방법에 있어서, PUSCH 반복에 대한 요청은 주파수 호핑을 갖는 PUSCH 반복에 대한 요청을 포함하는, 방법. 양태 7: 양태 1 내지 양태 6 중 어느 것의 방법에 있어서, PUSCH 반복에 대한 요청을 송신하는 단계는 PUSCH 반 복에 대한 요청을 표시하는 물리 RACH(PRACH) 메시지를 송신하는 단계를 포함하는, 방법. 양태 8: 양태 7 의 방법에 있어서, PUSCH 반복에 대한 요청을 송신하는 단계는 복수의 RACH 경우에 걸쳐 PRACH 메시지를 반복하는 단계를 포함하는, 방법. 양태 9: 양태 7 또는 양태 8 중 어느 하나의 방법에 있어서, PUSCH 반복에 대한 요청을 송신하는 단계는 PRACH 프리앰블들의 세트의 PRACH 프리앰블들의 서브세트로부터 선택되는 PRACH 프리앰블을 송신하는 단계를 포함하고, 서브세트는 PUSCH 반복에 대한 요청을 표시하는, 방법. 양태 10: 양태 7 내지 양태 9 중 어느 것의 방법에 있어서, PUSCH 반복에 대한 요청을 송신하는 단계는 RO들의 세트의 RACH 어케이전들(RO들)의 서브세트를 사용하여 PRACH 메시지를 송신하는 단계를 포함하고, RO들의 서브 세트는 PUSCH 반복에 대한 요청을 표시하는, 방법. 양태 11: 양태 7 내지 양태 10 중 어느 것의 방법에 있어서, PUSCH 반복에 대한 요청을 송신하는 단계는 PUSCH 반복에 대한 요청을 표시하는 PRACH 포맷을 사용하여 PRACH 메시지를 송신하는 단계를 포함하는, 방법. 양태 12: 양태 7 내지 양태 11 중 어느 것의 방법에 있어서, PRACH 메시지를 송신하는 단계는 하나 이상의 PRACH 파라미터들에 적어도 부분적으로 기초하여 PRACH 메시지를 송신하는 단계를 포함하는, 방법. 양태 13: 양태 12 의 방법에 있어서, PUSCH 반복에 대한 요청에 대응하는 하나 이상의 요청 파라미터들과 하나 이상의 PRACH 파라미터들 사이의 관계에 적어도 부분적으로 기초하여 하나 이상의 PRACH 파라미터들을 선택하는단계를 더 포함하는, 방법. 양태 14: 양태 13 의 방법에 있어서, 기지국으로부터, 관계를 나타내는 파라미터 구성(parameter configuration)을 수신하는 단계를 더 포함하는, 방법. 양태 15: 양태 14 의 방법에 있어서, 파라미터 구성은 시스템 정보에서 반송되는, 방법. 양태 16: 양태 15 의 방법에 있어서, 시스템 정보는 잔여 최소 시스템 정보(remaining minimum system information)를 포함하는, 방법. 양태 17: 양태 13 내지 양태 16 중 어느 것의 방법에 있어서, 관계는 무선 통신 표준에 의해 표시되는, 방법. 양태 18: 양태 1 내지 양태 17 중 어느 것의 방법에 있어서, 하나 이상의 트리거 기준들이 충족되는 것을 결정 하는 단계를 더 포함하며, PUSCH 반복에 대한 요청을 송신하는 단계는 하나 이상의 트리거 기준들이 충족된다고 결정하는 것에 적어도 부분적으로 기초하여 PUSCH 반복에 대한 요청을 송신하는 단계를 포함하는, 방법. 양태 19: 양태 18 의 방법에 있어서, 기지국으로부터, 하나 이상의 트리거 기준들을 표시하는 트리거 구성을 수 신하는 단계를 더 포함하는, 방법. 양태 20: 양태 19 의 방법에 있어서, 트리거 구성은 시스템 정보에서 반송되는, 방법. 양태 21: 양태 20 의 방법에 있어서, 시스템 정보는 잔여 최소 시스템 정보를 포함하는, 방법. 양태 22: 양태 18 내지 양태 21 중 어느 것의 방법에 있어서, 하나 이상의 트리거 기준은 제 1 레퍼런스 신호 수신 전력(reference signal received power; RSRP) 임계치를 포함하는, 방법. 양태 23: 양태 22 의 방법에 있어서, 제 1 동기화 신호 블록 (synchronization signal block; SSB) 기반 RSRP 를 결정하는 단계를 더 포함하고, 하나 이상의 트리거 기준들이 충족된다고 결정하는 단계는 제 1 SSB 기반 RSRP가 제 1 RSRP 임계치를 충족하는 것을 결정하는 단계를 포함하는, 방법. 양태 24: 양태 23 의 방법에 있어서, 상기 하나 이상의 트리거 기준들은 제 2 RSRP 임계치를 포함하는, 방법. 양태 25: 양태 24 의 방법에 있어서, 제 2 SSB 기반 RSRP를 결정하는 단계를 더 포함하며, 하나 이상의 트리거 기준들이 충족되는 것을 결정하는 단계는 제 2 SSB 기반 RSRP가 제 2 RSRP 임계치를 충족하는 것을 결정하는 단 계를 포함하는, 방법. 양태 26: 양태 25 의 방법에 있어서, PUSCH 반복에 대한 요청은 제 1 SSB 기반 RSRP가 제 1 RSRP 임계치를 충족 한다고 결정하는 것에 적어도 부분적으로 기초하여 요청된 PUSCH 반복들의 제 1 수를 표시하고, PUSCH 반복에 대한 요청은 제 2 SSB 기반 RSRP가 제 2 RSRP 임계치를 충족한다고 결정하는 것에 적어도 부분적으로 기초하여 요청된 PUSCH 반복들의 제 2 수를 표시하는, 방법. 양태 27: 양태 18 내지 양태 27 중 어느 것의 방법에 있어서, 하나 이상의 트리거 기준은 무선 통신 표준으로 표시되는, 방법. 양태 28: 양태 1 내지 양태 27 중 어느 것의 방법에 있어서, 적어도 하나의 PUSCH 반복을 송신하는 단계는 PUSCH 반복에 대한 요청을 송신하는 것에 적어도 부분적으로 기초하여 적어도 하나의 PUSCH 반복을 송신하는 단 계를 포함하는, 방법. 양태 29: 양태 1 내지 양태 28 중 어느 것의 방법에 있어서, 기지국으로부터, 랜덤 액세스 응답 (random access response; RAR) 메시지를 수신하는 단계 - RAR 메시지는 RRC 접속 요청 메시지에 대한 PUSCH 리소스, 또는 RRC 접속 요청 메시지와 연관된 PUSCH 파라미터 중 적어도 하나를 표시함 -; 및 RAR 메시지에 적어도 부분적으로 기 초하여, PUSCH 반복 파라미터 또는 PUSCH 반복 리소스 중 적어도 하나를 결정하는 단계를 더 포함하는, 방법. 양태 30: 양태 29 의 방법에 있어서, PUSCH 반복 파라미터 또는 PUSCH 반복 리소스 중 적어도 하나를 결정하는 단계는 무선 통신 표준에 의해 표시된 하나 이상의 규칙들에 적어도 부분적으로 기초하여 PUSCH 반복 파라미터 또는 PUSCH 반복 리소스 중 적어도 하나를 결정하는 단계를 포함하는, 방법. 양태 31: 양태 1 내지 양태 30 중 어느 것의 방법에 있어서, 기지국으로부터, PUSCH 반복 요청 승인의 표시를 수신하는 단계를 더 포함하며, 상기 PUSCH 반복 요청 승인은 상기 PUSCH 반복 요청의 적어도 부분에 대응하는, 방법. 양태 32: 양태 31 의 방법에 있어서, PUSCH 반복 요청 승인의 표시는 랜덤 액세스 응답(RAR) 메시지에서 반송되 는, 방법. 양태 33: 양태 32 의 방법에 있어서, PUSCH 반복 요청 승인의 표시는 RAR 메시지의 물리 다운링크 제어 채널 부 분에서 반송되는, 방법. 양태 34: 기지국에 의해 수행되는 무선 통신의 방법으로서, 사용자 장비 (UE) 로부터, 랜덤 액세스 채널 (RACH) 절차의 라디오 리소스 제어 (RRC) 접속 요청 메시지와 연관된 물리 업링크 공유 채널 (PUSCH) 반복에 대한 요청 을 수신하는 단계; 및 상기 요청에 적어도 부분적으로 기초하여 상기 RRC 접속 요청 메시지와 연관된 적어도 하 나의 PUSCH 반복을 수신하는 단계를 포함하는, 기지국에 의해 수행되는 무선 통신의 방법. 양태 35: 양태 34 의 방법에 있어서, PUSCH 반복에 대한 요청은 PUSCH 반복에 대응하는 하나 이상의 제안된 파 라미터들을 표시하는, 방법. 양태 36: 양태 35 의 방법에 있어서, 하나 이상의 제안된 파라미터들은 PUSCH 반복들의 수를 표시하는, 방법. 양태 37: 양태 34 내지 양태 36 중 어느 것의 방법에 있어서, PUSCH 반복에 대한 요청은 크로스-슬롯 채널 추정 을 위한 집성된 복조 레퍼런스 신호에 대한 요청을 나타내는, 방법. 양태 38: 양태 34 내지 양태 37 중 어느 것의 방법에 있어서, PUSCH 반복에 대한 요청은 하나 이상의 송신 구성 표시자들과 연관된 PUSCH 반복에 대한 요청을 포함하는, 방법. 양태 39: 양태 34 내지 양태 38 중 어느 것의 방법에 있어서, PUSCH 반복에 대한 요청은 주파수 호핑을 갖는 PUSCH 반복에 대한 요청을 포함하는, 방법. 양태 40: 양태 34 내지 양태 39 중 어느 것의 방법에 있어서, PUSCH 반복에 대한 요청을 수신하는 단계는 PUSCH 반복에 대한 요청을 표시하는 물리 RACH (PRACH) 메시지를 수신하는 단계를 포함하는, 방법. 양태 41: 양태 40 의 방법에 있어서, PUSCH 반복에 대한 요청을 수신하는 단계는 복수의 RACH 경우에 걸쳐 반복 된 PRACH 메시지를 수신하는 단계를 포함하는, 방법. 양태 42: 양태 40 또는 양태 41 중 어느 하나의 방법에 있어서, PUSCH 반복에 대한 요청을 수신하는 단계는 PRACH 프리앰블들의 세트의 PRACH 프리앰블들의 서브세트로부터 선택되는 PRACH 프리앰블을 수신하는 단계를 포 함하고, 서브세트는 PUSCH 반복에 대한 요청을 표시하는, 방법. 양태 43: 양태 40 내지 양태 42 중 어느 것의 방법에 있어서, PUSCH 반복에 대한 요청을 수신하는 단계는 RO들 의 세트의 RACH 어케이전들(RO들)의 서브세트를 사용하여 PRACH 메시지를 수신하는 단계를 포함하고, RO들의 서 브세트는 PUSCH 반복에 대한 요청을 표시하는, 방법. 양태 44: 양태 40 내지 양태 43 중 어느 것의 방법에 있어서, PUSCH 반복에 대한 요청을 수신하는 단계는 PUSCH 반복에 대한 요청을 표시하는 PRACH 포맷을 사용하여 PRACH 메시지를 수신하는 단계를 포함하는, 방법. 양태 45: 양태 40 내지 양태 44 중 어느 것의 방법에 있어서, PRACH 메시지를 수신하는 단계는 하나 이상의 PRACH 파라미터들에 적어도 부분적으로 기초하여 PRACH 메시지를 수신하는 단계를 포함하는, 방법. 양태 46: 양태 45 의 방법에 있어서, 하나 이상의 PRACH 파라미터들의 선택은 PUSCH 반복에 대한 요청에 대응하 는 하나 이상의 요청 파라미터들과 하나 이상의 PRACH 파라미터들 사이의 관계에 적어도 부분적으로 기초하는, 방법. 양태 47: 양태 46 의 방법에 있어서, 관계를 나타내는 파라미터 구성을 UE에 송신하는 단계를 더 포함하는, 방 법. 양태 48: 양태 46 또는 양태 47 중 어느 하나의 방법에 있어서, 파라미터 구성은 시스템 정보에서 반송되는, 방 법. 양태 49: 양태 48 의 방법에 있어서, 시스템 정보는 잔여 최소 시스템 정보를 포함하는, 방법. 양태 50: 양태 46 내지 양태 49 중 어느 것의 방법에 있어서, 관계는 무선 통신 표준에 의해 표시되는, 방법. 양태 51: 양태 34 내지 양태 50 중 어느 것의 방법에 있어서, PUSCH 반복에 대한 요청을 수신하는 단계는 하나 이상의 트리거 기준이 충족된다는 결정에 적어도 부분적으로 기초하여 PUSCH 반복에 대한 요청을 수신하는 단계 를 포함하는, 방법.양태 52: 양태 51 의 방법에 있어서, 하나 이상의 트리거 기준을 나타내는 트리거 구성을 UE에 송신하는 단계를 더 포함하는, 방법. 양태 53: 양태 52 의 방법에 있어서, 트리거 구성은 시스템 정보에서 반송되는, 방법. 양태 54: 양태 53 의 방법에 있어서, 시스템 정보는 잔여 최소 시스템 정보를 포함하는, 방법. 양태 55: 양태 51 내지 양태 54 중 어느 것의 방법에 있어서, 하나 이상의 트리거 기준은 제 1 레퍼런스 신호 수신 전력(RSRP) 임계치를 포함하는, 방법. 양태 56: 양태 55 의 방법에 있어서, 하나 이상의 트리거 기준들이 충족된다는 결정은 제 1 동기화 신호 블록 (SSB) 기반 RSRP가 제 1 RSRP 임계치를 충족시킨다는 결정을 포함하는, 방법. 양태 57: 양태 56 의 방법에 있어서, 상기 하나 이상의 트리거 기준들은 제 2 RSRP 임계치를 포함하는, 방법. 양태 58: 양태 57 의 방법에 있어서, 하나 이상의 트리거 기준들이 만족된다는 결정은, 제 2 SSB 기반 RSRP가 제 2 RSRP 임계치를 만족한다는 결정을 포함하는, 방법. 양태 59: 양태 58 의 방법에 있어서, PUSCH 반복에 대한 요청은 제 1 SSB 기반 RSRP가 제 1 RSRP 임계치를 만족 한다는 결정에 적어도 부분적으로 기초하여 요청된 PUSCH 반복들의 제 1 수를 표시하고, PUSCH 반복에 대한 요 청은 제 2 SSB 기반 RSRP가 제 2 RSRP 임계치를 만족한다는 결정에 적어도 부분적으로 기초하여 요청된 PUSCH 반복들의 제 2 수를 표시하는, 방법. 양태 60: 양태 51 내지 양태 60 중 어느 것의 방법에 있어서, 하나 이상의 트리거 기준은 무선 통신 표준으로 표시되는, 방법. 양태 61: 양태 34 내지 양태 60 중 어느 것의 방법에 있어서, 적어도 하나의 PUSCH 반복을 수신하는 단계는 PUSCH 반복에 대한 요청에 적어도 부분적으로 기초하여 적어도 하나의 PUSCH 반복을 수신하는 단계를 포함하는, 방법. 양태 62: 양태 34 내지 양태 61 중 어느 것의 방법에 있어서, 랜덤 액세스 응답(RAR) 메시지를 UE에 송신하는 단계를 더 포함하고, RAR 메시지는 RRC 접속 요청 메시지에 대한 PUSCH 리소스, 또는 RRC 접속 요청 메시지와 연관된 PUSCH 파라미터 중 적어도 하나를 표시하는, 방법. 양태 63: 양태 62 의 방법에 있어서, PUSCH 반복 파라미터 또는 PUSCH 반복 리소스 중 적어도 하나의 결정은 무 선 통신 표준에 의해 표시된 하나 이상의 규칙들에 적어도 부분적으로 기초하여 PUSCH 반복 파라미터 또는 PUSCH 반복 리소스 중 적어도 하나의 결정을 포함하는, 방법. 양태 64: 양태 34 내지 양태 63 중 어느 것의 방법에 있어서, PUSCH 반복 요청 승인의 표시를 UE에 송신하는 단 계를 더 포함하고, PUSCH 반복 요청 승인은 PUSCH 반복 요청의 적어도 부분에 대응하는, 방법. 양태 65: 양태 64 의 방법에 있어서, PUSCH 반복 요청 승인의 표시는 랜덤 액세스 응답(RAR) 메시지에서 반송되 는, 방법. 양태 66: 양태 64 또는 양태 65 중 어느 하나의 방법에 있어서, PUSCH 반복 요청 승인의 표시는 RAR 메시지의 물리 다운링크 제어 채널 부분에서 반송되는, 방법. 양태 67: 사용자 장비(UE)에 의한 무선 통신의 방법으로서, 물리 랜덤 액세스 채널 (PRACH) 송신을 위한 하나 이상의 대체 주파수 리소스들을 결정하는 단계 - 상기 하나 이상의 대체 주파수 리소스들의 사용은 물리 업링크 공유 채널 (PUSCH) 반복 정보를 통신함 -; 및 상기 PUSCH 반복 정보를 통신하기 위해 상기 하나 이상의 대체 주 파수 리소스들을 사용하여 PRACH 메시지를 기지국에 송신하는 단계를 포함하는, 사용자 장비(UE)에 의한 무선 통신의 방법. 양태 68: 양태 67 의 방법에 있어서, 하나 이상의 대체 주파수 리소스들은 PUSCH 반복 없이 단일 PUSCH 송신과 연관된 PRACH 송신을 위한 하나 이상의 주파수 리소스들과 상이한, 방법. 양태 69: 양태 67 또는 양태 68 중 어느 하나의 방법에 있어서, PUSCH 반복 정보에 기초하여 PUSCH 메시지 및 PUSCH 메시지의 적어도 하나의 반복을 송신하는 단계를 더 포함하는, 방법. 양태 70: 양태 67 내지 양태 69 중 어느 것의 방법에 있어서, PUSCH 반복 정보에 기초하여 하나 이상의 PUSCH 리소스들의 표시 또는 PUSCH 파라미터 중 적어도 하나를 수신하는 단계를 더 포함하고, PUSCH 메시지 및 PUSCH메시지의 적어도 하나의 반복은 하나 이상의 PUSCH 리소스들 또는 PUSCH 파라미터 중 적어도 하나를 사용하여 송신되는, 방법. 양태 71: 양태 67 내지 양태 70 중 어느 것의 방법에 있어서, 기지국으로부터, 하나 이상의 대체 주파수 리소스 를 나타내는 리소스 파라미터를 수신하는 단계를 더 포함하고, 하나 이상의 대체 주파수 리소스는 리소스 파라 미터에 기초하여 결정되는, 방법. 양태 72: 양태 71 의 방법에 있어서, 리소스 파라미터는 시스템 정보를 통해 수신되는, 방법. 양태 73: 양태 72 의 방법에 있어서, 시스템 정보는 잔여 최소 시스템 정보(RMSI)를 포함하는, 방법. 양태 74: 양태 71 내지 양태 73 중 어느 것의 방법에 있어서, 상기 리소스 파라미터는 주파수 오프셋을 포함하 고, 상기 하나 이상의 대체 주파수 리소스들을 결정하는 단계는, PUSCH 반복 없이 단일 PUSCH 송신과 연관된 PRACH 송신에 대한 하나 이상의 주파수 리소스들에 상기 주파수 오프셋을 적용함으로써 상기 하나 이상의 대체 주파수 리소스들을 결정하는 단계를 포함하는, 방법. 양태 75: 양태 67 내지 양태 74 중 어느 것의 방법에 있어서, PUSCH 반복을 위한 송신 전력과 연관된 적어도 하 나의 송신 전력 파라미터를 결정하는 단계; 및 적어도 하나의 송신 전력 파라미터에 기초하여 PUSCH 반복을 위 한 송신 전력을 구성하는 단계를 더 포함하는, 방법. 양태 76: 양태 75 의 방법에 있어서, 상기 적어도 하나의 송신 전력 파라미터는 상기 PRACH 송신을 위해 결정된 상기 하나 이상의 대체 주파수 리소스들에 기초하여 결정되는, 방법. 양태 77: 양태 75 또는 양태 76 중 어느 하나의 방법에 있어서, 적어도 하나의 송신 전력 파라미터를 결정하는 단계는 기지국으로부터 적어도 하나의 송신 전력 파라미터를 수신하는 단계를 포함하는, 방법. 양태 78: 양태 75 내지 양태 77 중 어느 것의 방법에 있어서, 적어도 하나의 송신 전력 파라미터는 PUSCH 반복 에 대한 송신 전력과 PRACH 송신에 대한 제 2 송신 전력 사이의 전력 오프셋 값을 포함하는, 방법. 양태 79: 양태들 67 내지 양태 78 중 어느 것의 방법에 있어서, PUSCH 반복 정보는 PUSCH 반복에 대한 요청 또 는 PUSCH 반복에 대한 UE 능력의 표시 중 적어도 하나에 대응하는 하나 이상의 파라미터들을 표시하는, 방법. 양태 80: 양태 79 의 방법에 있어서, 하나 이상의 파라미터들은, PUSCH 반복에 대한 요청, UE 능력의 표시, PUSCH 반복들의 수, PUSCH 반복에 대한 요청 또는 UE 능력의 표시 중 적어도 하나가 크로스-슬롯 채널 추정을 위한 복조 레퍼런스 신호(DMRS) 집성을 갖는 PUSCH 반복과 연관된다는 표시, PUSCH 반복이 하나 이상의 송신 구 성 표시자들(TCIs)과 연관된다는 표시, 또는 PUSCH 반복에 대한 요청 또는 UE 능력의 표시 중 적어도 하나가 주 파수 호핑을 갖는 PUSCH 반복과 연관된다는 표시 중 적어도 하나를 포함하는, 방법. 양태 81: 양태 79 또는 양태 80 중 어느 하나의 방법에 있어서, 상기 하나 이상의 대체 주파수 리소스들은 상기 하나 이상의 파라미터들 각각에 대해 상이한, 방법. 양태 82: 기지국에 의한 무선 통신의 방법으로서, 사용자 장비 (UE) 로부터, 물리 랜덤 액세스 채널 (PRACH) 송 신을 위한 하나 이상의 대체 주파수 리소스들을 이용하여 PRACH 메시지를 수신하는 단계; 및 상기 PRACH 메시지 를 수신하는데 이용된 상기 하나 이상의 대체 주파수 리소스들에 기초하여 물리 업링크 공유 채널 (PUSCH) 반복 정보를 결정하는 단계를 포함하고, 상기 하나 이상의 대체 주파수 리소스들의 사용은 상기 PUSCH 반복 정보를 통신하는, 기지국에 의한 무선 통신의 방법. 양태 83: 양태 82 의 방법에 있어서, 하나 이상의 대체 주파수 리소스들은 PUSCH 반복 없이 단일 PUSCH 송신과 연관된 PRACH 송신을 위한 하나 이상의 주파수 리소스들과 상이한, 방법. 양태 84: 양태 82 또는 양태 83 중 어느 하나의 방법에 있어서, PUSCH 반복 정보에 기초하여 PUSCH 메시지 및 PUSCH 메시지의 적어도 하나의 반복을 UE로부터 수신하는 단계를 더 포함하는, 방법. 양태 85: 양태 82 내지 양태 84 중 어느 것의 방법에 있어서, PUSCH 반복 정보에 기초하여 하나 이상의 PUSCH 리소스들의 표시 또는 PUSCH 파라미터 중 적어도 하나를 송신하는 단계를 더 포함하고, PUSCH 메시지 및 PUSCH 메시지의 적어도 하나의 반복은 하나 이상의 PUSCH 리소스들 또는 PUSCH 파라미터 중 적어도 하나를 사용하여 수신되는, 방법. 양태 86: 양태 82 내지 양태 85 중 어느 것의 방법에 있어서, 하나 이상의 대체 주파수 리소스들을 표시하는 리 소스 파라미터를 송신하는 단계를 더 포함하고, 상기 하나 이상의 대체 주파수 리소스들은 상기 리소스 파라미터에 기초하여 결정되는, 방법. 양태 87: 양태 86 의 방법에 있어서, 리소스 파라미터는 시스템 정보를 통해 전송하는, 방법. 양태 88: 양태 87 의 방법에 있어서, 시스템 정보는 잔여 최소 시스템 정보(RMSI)를 포함하는, 방법. 양태 89: 양태 86 내지 양태 88 중 어느 것의 방법에 있어서, 리소스 파라미터는 주파수 오프셋을 포함하고, 하 나 이상의 대체 주파수 리소스들은 PUSCH 반복 없이 단일 PUSCH 송신과 연관된 PRACH 송신을 위한 하나 이상의 주파수 리소스들에 주파수 오프셋을 적용함으로써 결정되는, 방법. 양태 90: 양태 82 내지 양태 87 중 어느 것의 방법에 있어서, PUSCH 반복을 위한 송신 전력은 송신 전력과 연관 된 적어도 하나의 송신 전력 파라미터에 기초하여 구성되는, 방법. 양태 91: 양태 90 의 방법에 있어서, 상기 적어도 하나의 송신 전력 파라미터는 상기 PRACH 송신을 위해 결정된 상기 하나 이상의 대체 주파수 리소스들에 기초하여 결정되는, 방법. 양태 92: 양태 90 또는 양태 91 중 어느 하나의 방법에 있어서, 적어도 하나의 송신 전력 파라미터를 UE에 송신 하는 단계를 더 포함하는, 방법. 양태 93: 양태 90 내지 양태 92 중 어느 것의 방법에 있어서, 적어도 하나의 송신 전력 파라미터는 PUSCH 반복 에 대한 송신 전력과 PRACH 송신에 대한 제 2 송신 전력 사이의 전력 오프셋 값을 포함하는, 방법. 양태 94: 양태 82 내지 양태 93 중 어느 것의 방법에 있어서, PUSCH 반복 정보는 PUSCH 반복에 대한 요청 또는 PUSCH 반복에 대한 UE 능력의 표시 중 적어도 하나에 대응하는 하나 이상의 파라미터들을 표시하는, 방법. 양태 95: 양태 94 의 방법에 있어서, 하나 이상의 파라미터들은, PUSCH 반복에 대한 요청, UE 능력의 표시, PUSCH 반복들의 수, PUSCH 반복에 대한 요청 또는 UE 능력의 표시 중 적어도 하나가 크로스-슬롯 채널 추정을 위한 복조 레퍼런스 신호(DMRS) 집성을 갖는 PUSCH 반복과 연관된다는 표시, PUSCH 반복이 하나 이상의 송신 구 성 표시자들(TCIs)과 연관된다는 표시, 또는 PUSCH 반복에 대한 요청 또는 UE 능력의 표시 중 적어도 하나가 주 파수 호핑을 갖는 PUSCH 반복과 연관된다는 표시 중 적어도 하나를 포함하는, 방법. 양태 96: 양태 94 또는 양태 95 중 어느 하나의 방법에 있어서, 상기 하나 이상의 대체 주파수 리소스들은 상기 하나 이상의 파라미터들 각각에 대해 상이한, 방법. 양태 97: 사용자 장비(UE)에 의한 무선 통신을 위한 방법으로서, 랜덤 액세스 채널 (RACH) 절차의 라디오 리소 스 제어 (RRC) 접속 요청 메시지와 연관된 물리 업링크 공유 채널 (PUSCH) 반복에 대한 요청을 포함하는 물리 랜덤 액세스 채널 절차 (PRACH) 메시지를 기지국에 송신하는 단계; 및 상기 요청에 적어도 부분적으로 기초하여 상기 RRC 접속 요청 메시지와 연관된 적어도 하나의 PUSCH 반복을 송신하는 단계를 포함하는, 사용자 장비(UE) 에 의한 무선 통신을 위한 방법. 양태 98: 양태 97 의 방법에 있어서, PUSCH 반복에 대한 요청을 송신하는 단계는 복수의 RACH 경우에 걸쳐 PRACH 메시지를 반복하는 단계를 포함하는, 방법. 양태 99: 양태 97 또는 양태 98 중 어느 하나의 방법에 있어서, PUSCH 반복에 대한 요청을 송신하는 단계는 PRACH 프리앰블들의 세트의 PRACH 프리앰블들의 서브세트로부터 선택되는 PRACH 프리앰블을 송신하는 단계를 포 함하고, 서브세트는 PUSCH 반복에 대한 요청을 표시하는, 방법. 양태들 100: 양태들 97 내지 양태 99 중 어느 것의 방법에 있어서, PUSCH 반복에 대한 요청을 송신하는 단계는 RO들의 세트의 RACH 어케이전들(RO들)의 서브세트를 사용하여 PRACH 메시지를 송신하는 단계를 포함하고, RO들 의 서브세트는 PUSCH 반복에 대한 요청을 표시하는, 방법. 양태 101: 양태 97 내지 양태 100 중 어느 것의 방법에 있어서, PRACH 메시지를 송신하는 단계는 하나 이상의 PRACH 파라미터들에 적어도 부분적으로 기초하여 PRACH 메시지를 송신하는 단계를 포함하는, 방법. 양태 102: 사용자 장비(UE)에 의한 무선 통신을 위한 방법으로서, 랜덤 액세스 채널 (RACH) 절차의 라디오 리소 스 제어 (RRC) 접속 요청 메시지와 연관된 물리 업링크 공유 채널 (PUSCH) 반복에 대한 요청을 포함하는 물리 랜덤 액세스 채널 절차 (PRACH) 메시지를 기지국으로 그리고 하나 이상의 트리거 기준들이 충족된다는 결정에 적어도 부분적으로 기초하여 송신하는 단계로서, 하나 이상의 트리거 기준들은 레퍼런스 신호 수신 전력 임계치 를 포함하는, 상기 PRACH 메시지를 송신하는 단계; 및 상기 요청에 적어도 부분적으로 기초하여 상기 RRC 접속 요청 메시지와 연관된 적어도 하나의 PUSCH 반복을 송신하는 단계를 포함하는, 사용자 장비(UE)에 의한 무선 통신을 위한 방법. 양태 103: 양태 102 의 방법에 있어서, PUSCH 반복에 대한 요청을 송신하는 단계는 PUSCH 반복에 대한 요청을 표시하는 물리 RACH(PRACH) 메시지를 송신하는 단계를 포함하는, 방법. 양태 104: 양태 102 또는 양태 103 중 어느 하나의 방법에 있어서, 제 1 동기화 신호 블록(SSB) 기반 RSRP를 결 정하는 단계를 더 포함하고, 하나 이상의 트리거 기준들이 충족되는 것을 결정하는 단계는 제 1 SSB 기반 RSRP 가 제 1 RSRP 임계치를 충족하는 것을 결정하는 단계를 포함하는, 방법. 양태 105: 사용자 장비(UE)에 의한 무선 통신을 위한 방법으로서, 랜덤 액세스 채널 (RACH) 절차의 라디오 리소 스 제어 (RRC) 접속 요청 메시지와 연관된 물리 업링크 공유 채널 (PUSCH) 반복에 대한 요청을 포함하는 물리 랜덤 액세스 채널 절차 (PRACH) 메시지를 기지국에 송신하는 단계로서, 상기 하나 이상의 트리거 기준은 레퍼런 스 신호 수신 전력 임계치를 포함하는, 상기 PRACH 메시지를 송신하는 단계; 기지국으로부터, PUSCH 반복 요청 승인의 표시를 수신하는 단계로서, 상기 PUSCH 반복 요청 승인은 상기 PUSCH 반복 요청의 적어도 부분에 대응하 는, 상기 PUSCH 반복 요청 승인의 표시를 수신하는 단계; 및 상기 요청에 적어도 부분적으로 기초하여 상기 RRC 접속 요청 메시지와 연관된 적어도 하나의 PUSCH 반복을 송신하는 단계를 포함하는, 사용자 장비(UE)에 의한 무 선 통신을 위한 방법. 양태 106: 양태 105 의 방법에 있어서, PUSCH 반복 요청 승인의 표시는 랜덤 액세스 응답(RAR) 메시지에서 반송 되는, 방법. 양태 107: 디바이스에서의 무선 통신을 위한 장치로서, 프로세서; 프로세서와 커플링된 메모리; 및 메모리에 저 장되고, 장치로 하여금 양태 1 내지 양태 33 의 하나 이상의 양태들의 방법을 수행하게 하도록 프로세서에 의해 실행가능한 명령들을 포함하는, 디바이스에서의 무선 통신을 위한 장치. 양태 108: 무선 통신을 위한 디바이스로서, 메모리 및 상기 메모리에 커플링된 하나 이상의 프로세서들을 포함 하고, 상기 메모리 및 상기 하나 이상의 프로세서들은 양태 1 내지 양태 33의 하나 이상의 양태들의 방법을 수 행하도록 구성되는, 무선 통신을 위한 디바이스. 양태 109: 양태 1 내지 양태 33의 하나 이상의 양태들의 방법을 수행하기 위한 적어도 하나의 수단을 포함하는, 무선 통신을 위한 장치. 양태 110: 무선 통신을 위한 코드를 저장하는 비일시적 컴퓨터 판독가능 매체로서, 상기 코드는 양태 1 내지 양 태 33의 하나 이상의 양태들의 방법을 수행하도록 프로세서에 의해 실행가능한 명령들을 포함하는, 비일시적 컴 퓨터 판독가능 매체. 양태 111: 무선 통신을 위한 명령들의 세트를 저장하는 비일시적 컴퓨터 판독가능 매체로서, 상기 명령들의 세 트는, 디바이스의 하나 이상의 프로세서에 의해 실행될 때, 상기 디바이스로 하여금 양태 1 내지 양태 33의 하 나 이상의 양태들의 방법을 수행하게 하는 하나 이상의 명령들을 포함하는, 비일시적 컴퓨터 판독가능 매체. 양태 112: 디바이스에서의 무선 통신을 위한 장치로서, 프로세서; 프로세서와 커플링된 메모리; 및 메모리에 저장되고, 장치로 하여금 양태 34 내지 양태 66의 하나 이상의 양태들의 방법을 수행하게 하도록 프로세서에 의 해 실행가능한 명령들을 포함하는, 디바이스에서의 무선 통신을 위한 장치. 양태 113: 메모리 및 상기 메모리에 결합된 하나 이상의 프로세서들을 포함하는 무선 통신을 위한 디바이스로서, 상기 메모리 및 상기 하나 이상의 프로세서들은 양태 34 내지 양태 66의 하나 이상의 양태들의 방법을 수행하도록 구성되는, 무선 통신을 위한 디바이스. 양태 114: 양태 34 내지 양태 66의 하나 이상의 양태들의 방법을 수행하기 위한 적어도 하나의 수단을 포함하는, 무선 통신을 위한 장치. 양태 115: 무선 통신을 위한 코드를 저장하는 비일시적 컴퓨터 판독가능 매체로서, 상기 코드는 양태 34 내지 양태 66의 하나 이상의 양태들의 방법을 수행하도록 프로세서에 의해 실행가능한 명령들을 포함하는, 비일시적 컴퓨터 판독가능 매체. 양태 116: 무선 통신을 위한 명령들의 세트를 저장하는 비일시적 컴퓨터 판독가능 매체로서, 상기 명령들의 세 트는, 디바이스의 하나 이상의 프로세서에 의해 실행될 때, 상기 디바이스로 하여금 양태 34 내지 양태 66의 하 나 이상의 양태들의 방법을 수행하게 하는 하나 이상의 명령들을 포함하는, 비일시적 컴퓨터 판독가능 매체.양태 117: 디바이스에서의 무선 통신을 위한 장치로서, 프로세서; 프로세서와 커플링된 메모리; 및 메모리에 저 장되고, 장치로 하여금 양태 67 내지 양태 81의 하나 이상의 양태들의 방법을 수행하게 하도록 프로세서에 의해 실행가능한 명령들을 포함하는, 디바이스에서의 무선 통신을 위한 장치. 양태 118: 메모리 및 상기 메모리에 커플링된 하나 이상의 프로세서들을 포함하는, 무선 통신을 위한 디바이스 로서, 상기 메모리 및 상기 하나 이상의 프로세서들은 양태 67 내지 양태 81의 하나 이상의 양태들의 방법을 수 행하도록 구성되는, 무선 통신을 위한 디바이스. 양태 119: 양태 67 내지 양태 81의 하나 이상의 양태들의 방법을 수행하기 위한 적어도 하나의 수단을 포함하는, 무선 통신을 위한 장치. 양태 120: 무선 통신을 위한 코드를 저장하는 비일시적 컴퓨터 판독가능 매체로서, 상기 코드는 양태 67 내지 양태 81의 하나 이상의 양태들의 방법을 수행하도록 프로세서에 의해 실행가능한 명령들을 포함하는, 비일시적 컴퓨터 판독가능 매체. 양태 121: 무선 통신을 위한 명령들의 세트를 저장하는 비일시적 컴퓨터 판독가능 매체로서, 상기 명령들의 세 트는, 디바이스의 하나 이상의 프로세서에 의해 실행될 때, 상기 디바이스로 하여금 양태 67 내지 양태 81의 하 나 이상의 양태들의 방법을 수행하게 하는 하나 이상의 명령들을 포함하는, 비일시적 컴퓨터 판독가능 매체. 양태 122: 디바이스에서의 무선 통신을 위한 장치로서, 프로세서; 프로세서와 커플링된 메모리; 및 메모리에 저 장되고, 장치로 하여금 양태 82 내지 양태 96의 하나 이상의 양태들의 방법을 수행하게 하도록 프로세서에 의해 실행가능한 명령들을 포함하는, 디바이스에서의 무선 통신을 위한 장치. 양태 123: 메모리 및 상기 메모리에 커플링된 하나 이상의 프로세서들을 포함하는 무선 통신을 위한 디바이스로 서, 상기 메모리 및 상기 하나 이상의 프로세서들은 양태 82 내지 양태 96 의 하나 이상의 양태들의 방법을 수 행하도록 구성되는, 무선 통신을 위한 디바이스. 양태 124: 양태 82 내지 양태 96의 하나 이상의 양태들의 방법을 수행하기 위한 적어도 하나의 수단을 포함하는, 무선 통신을 위한 장치. 양태 125: 무선 통신을 위한 코드를 저장하는 비일시적 컴퓨터 판독가능 매체로서, 상기 코드는 양태 82 내지 양태 96의 하나 이상의 양태들의 방법을 수행하도록 프로세서에 의해 실행가능한 명령들을 포함하는, 비일시적 컴퓨터 판독가능 매체. 양태 126: 무선 통신을 위한 명령들의 세트를 저장하는 비일시적 컴퓨터 판독가능 매체로서, 상기 명령들의 세 트는, 디바이스의 하나 이상의 프로세서에 의해 실행될 때, 상기 디바이스로 하여금 양태 82 내지 양태 96 의 하나 이상의 양태들의 방법을 수행하게 하는 하나 이상의 명령들을 포함하는, 비일시적 컴퓨터 판독가능 매체. 양태 127: 디바이스에서의 무선 통신을 위한 장치로서, 프로세서; 프로세서와 커플링된 메모리; 및 메모리에 저 장되고, 장치로 하여금 양태 97 내지 양태 101 의 하나 이상의 양태들의 방법을 수행하게 하도록 프로세서에 의 해 실행가능한 명령들을 포함하는, 디바이스에서의 무선 통신을 위한 장치. 양태 128: 무선 통신을 위한 디바이스로서, 메모리 및 상기 메모리에 커플링된 하나 이상의 프로세서들을 포함 하고, 상기 메모리 및 상기 하나 이상의 프로세서들은 양태 97 내지 양태 101 의 하나 이상의 양태들의 방법을 수행하도록 구성되는, 무선 통신을 위한 디바이스. 양태 129: 양태 97 내지 양태 101 의 하나 이상의 양태들의 방법을 수행하기 위한 적어도 하나의 수단을 포함하 는, 무선 통신을 위한 장치. 양태 130: 무선 통신을 위한 코드를 저장하는 비일시적 컴퓨터 판독가능 매체로서, 상기 코드는 양태 97 내지 양태 101 의 하나 이상의 양태들의 방법을 수행하도록 프로세서에 의해 실행가능한 명령들을 포함하는, 비일시 적 컴퓨터 판독가능 매체. 양태 131: 무선 통신을 위한 명령들의 세트를 저장하는 비일시적 컴퓨터 판독가능 매체로서, 상기 명령들의 세 트는, 디바이스의 하나 이상의 프로세서에 의해 실행될 때, 상기 디바이스로 하여금 양태 97 내지 양태 101 의 하나 이상의 양태들의 방법을 수행하게 하는 하나 이상의 명령들을 포함하는, 비일시적 컴퓨터 판독가능 매체. 양태 132: 디바이스에서의 무선 통신을 위한 장치로서, 프로세서; 프로세서와 커플링된 메모리; 및 메모리에 저 장되고, 장치로 하여금 양태 102 내지 양태 104 의 하나 이상의 양태들의 방법을 수행하게 하도록 프로세서에의해 실행가능한 명령들을 포함하는, 디바이스에서의 무선 통신을 위한 장치. 양태 133: 무선 통신을 위한 디바이스로서, 메모리 및 상기 메모리에 커플링된 하나 이상의 프로세서들을 포함 하고, 상기 메모리 및 상기 하나 이상의 프로세서들은 양태 102 내지 양태 104 의 하나 이상의 양태들의 방법을 수행하도록 구성되는, 무선 통신을 위한 디바이스. 양태 134: 무선 통신을 위한 장치로서, 양태 102 내지 양태 104 의 하나 이상의 양태들의 방법을 수행하기 위한 적어도 하나의 수단을 포함하는, 무선 통신을 위한 장치. 양태 135: 무선 통신을 위한 코드를 저장하는 비일시적 컴퓨터 판독가능 매체로서, 상기 코드는 양태 102 내지 양태 104 의 하나 이상의 양태들의 방법을 수행하도록 프로세서에 의해 실행가능한 명령들을 포함하는, 비일시 적 컴퓨터 판독가능 매체. 양태 136: 무선 통신을 위한 명령들의 세트를 저장하는 비일시적 컴퓨터 판독가능 매체로서, 상기 명령들의 세 트는, 디바이스의 하나 이상의 프로세서에 의해 실행될 때, 상기 디바이스로 하여금 양태 102 내지 양태 104 의 하나 이상의 양태들의 방법을 수행하게 하는 하나 이상의 명령들을 포함하는, 비일시적 컴퓨터 판독가능 매체. 양태 137: 디바이스에서의 무선 통신을 위한 장치로서, 프로세서; 프로세서와 커플링된 메모리; 및 메모리에 저 장되고, 장치로 하여금 양태 105 내지 양태 106 의 하나 이상의 양태들의 방법을 수행하게 하도록 프로세서에 의해 실행가능한 명령들을 포함하는, 디바이스에서의 무선 통신을 위한 장치. 양태 138: 무선 통신을 위한 디바이스로서, 메모리 및 상기 메모리에 커플링된 하나 이상의 프로세서들을 포함 하고, 상기 메모리 및 상기 하나 이상의 프로세서들은 양태 105 내지 양태 106 의 하나 이상의 양태들의 방법을 수행하도록 구성되는, 무선 통신을 위한 디바이스. 양태 139: 무선 통신을 위한 장치로서, 양태 105 내지 양태 106 의 하나 이상의 양태들의 방법을 수행하기 위한 적어도 하나의 수단을 포함하는, 무선 통신을 위한 장치. 양태 140: 무선 통신을 위한 코드를 저장하는 비일시적 컴퓨터 판독가능 매체로서, 상기 코드는 양태 105 내지 양태 106 의 하나 이상의 양태들의 방법을 수행하도록 프로세서에 의해 실행가능한 명령들을 포함하는, 비일시 적 컴퓨터 판독가능 매체. 양태 141: 무선 통신을 위한 명령들의 세트를 저장하는 비일시적 컴퓨터 판독가능 매체로서, 상기 명령들의 세 트는, 디바이스의 하나 이상의 프로세서에 의해 실행될 때, 상기 디바이스로 하여금 양태 105 내지 양태 106 의 하나 이상의 양태들의 방법을 수행하게 하는 하나 이상의 명령들을 포함하는, 비일시적 컴퓨터 판독가능 매체. 전술한 개시는 예시 및 설명을 제공하지만, 포괄적인 것으로 또는 개시된 정확한 형태로 양태를 제한하도록 의 도되지 않는다. 수정들 및 변형들이 상기 개시의 관점에서 행해질 수도 있거나 또는 양태들의 실시로부터 획득될 수도 있다. 본 명세서에서 사용되는 바와 같이, 용어 \"컴포넌트(component)\"는 하드웨어 및/또는 하드웨어와 소프트웨어의 조합으로 넓게 해석되도록 의도된다. 소프트웨어는, 특히 소프트웨어, 펌웨어, 미들웨어, 마이크로코드, 하 드웨어 디스크립션 언어, 또는 기타 등등으로서 지칭되든간에, 명령들, 명령 세트들, 코드, 코드 세그먼트들, 프로그램 코드, 프로그램들, 서브프로그램들, 소프트웨어 모듈들, 애플리케이션들, 소프트웨어 애플리케이션들, 소프트웨어 패키지들, 루틴들, 서브루틴들, 오브젝트들, 실행가능물들, 실행 스레드들, 절차들, 및/또는 함수들 을 의미하도록 넓게 해석될 것이다. 본 명세서에서 사용된 바와 같이, 프로세서는 하드웨어 및/또는 하드웨 어와 소프트웨어의 조합에서 구현된다. 본 명세서에 설명된 시스템들 및/또는 방법들은 상이한 형태들의 하 드웨어 및/또는 하드웨어 및 소프트웨어의 조합으로 구현될 수도 있음이 명백할 것이다. 이러한 시스템들 및/또는 방법들을 구현하는데 사용된 실제 특수 제어 하드웨어 또는 소프트웨어 코드는 이러한 양태들을 제한하 지 않는다. 따라서, 시스템들 및/또는 방법들의 동작 및 거동은 특정 소프트웨어 코드에 대한 참조없이 본 명세서에 설명되었다 - 소프트웨어 및 하드웨어는 본 명세서의 설명에 적어도 부분적으로 기초하여, 시스템들 및/또는 방법들을 구현하도록 설계될 수 있는 것으로 이해된다. 본 명세서에서 사용되는 바와 같이, 임계치를 만족시키는 것은 문맥에 따라, 임계치 초과, 임계치 이상, 임계치 미만, 임계치 이하, 임계치와 같은, 임계치와 같지 않은 등인 값을 지칭할 수도 있다. 특징들의 특정 조합들이 청구항들에 열거되고 그리고/또는 명세서에 개시되더라도, 이들 조합들은 다양한 양태 들의 개시를 제한하도록 의도되지 않는다. 실제로, 이들 특징들 중 다수는 청구항들에서 구체적으로 인용되지 않고 및/또는 명세서에 개시되지 않은 방식으로 조합될 수도 있다. 아래에 열거된 각각의 종속 청구항은 오직 하나의 청구항에만 직접적으로 의존할 수도 있지만, 여러 양태들의 개시는 청구항 세트의 모든 다른 청구 항과 결합하여 각각의 종속 청구항을 포함한다. 본 명세서에 사용된 바와 같이, 아이템들의 리스트 \"중 적 어도 하나\" 를 지칭하는 구절은, 단일 멤버들을 포함한 그러한 아이템들의 임의의 조합을 지칭한다. 예로서, “a, b, 또는 c 중 적어도 하나” 는 a, b, c, a-b, a-c, b-c, 및 a-b-c 뿐 아니라 동일한 엘리먼트의 배수들과의 임의의 조합 (예를 들어, a-a, a-a-a, a-a-b, a-a-c, a-b-b, a-c-c, b-b, b-b-b, b-b-c, c-c, 및 c-c-c 또는 a, b, 및 c 의 임의의 다른 순서화) 을 커버하도록 의도된다. 본 명세서에서 사용된 어떠한 요소, 행위 또는 지시도, 그러한 것으로 명백하게 설명되지 않는 한, 중요하거나 필수적인 것으로 해석되어서는 안된다. 또한, 본 명세서에서 사용된 바와 같이, 부정 관사들 (\"a\"및 \"an\") 은 하나 이상의 항목들을 포함하도록 의도되고, \"하나 이상” 과 상호교환가능하게 사용될 수도 있다. 또한, 본 명세서에서 사용되는 바와 같이, 정관사 \"the\" 는 정관사 \"the\" 와 관련하여 참조되는 하나 이상의 아 이템을 포함하도록 의도되고, \"하나 이상\" 과 상호 교환가능하게 사용될 수도 있다. 더욱이, 본 명세서에서 사용된 바와 같이, 용어들 \"세트” 및 \"그룹” 은 하나 이상의 아이템들 (예컨대, 관련된 아이템들, 관련되지 않은 아이템들, 또는 관련된 아이템과 관련되지 않은 아이템의 조합) 을 포함하도록 의도되고, \"하나 이상” 과 상호교환가능하게 사용될 수도 있다. 오직 하나의 아이템만이 의도된 경우, 어구 \"오직 하나” 또는 유사한 언어가 사용된다. 또한, 본 명세서에서 사용된 바와 같이, 용어들 \"갖는다 (has)\", \"갖는다 (have)\", \"갖는 (having)\" 등은 개방형 용어들인 것으로 의도된다. 추가로, 어구 \"기초하여” 는, 달리 명시적으로 서술되 지 않으면, \"적어도 부분적으로, 기초하여” 를 의미하도록 의도된다. 또한, 본 명세서에서 사용되는 바와 같이, 용어 \"또는\" 은 시리즈로 사용될 때 포함적이도록 의도되고, 달리 명시적으로 언급되지 않는 한 (예를 들 어, \"어느 하나\" 또는 \"오직 하나\"와 조합하여 사용되는 경우) \"및/또는\" 과 상호교환적으로 사용될 수도 있다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12"}
{"patent_id": "10-2023-7023438", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도면들의 간단한 설명"}
{"patent_id": "10-2023-7023438", "section": "도면", "subsection": "도면설명", "item": 2, "content": "본 개시의 전술한 특징들이 상세히 이해될 수 있도록, 위에서 간략히 요약된 보다 특정한 설명은 첨부된 도면들 에 예시된 양태들을 참조하여 이루어질 수도 있다. 그러나, 첨부된 도면들은 본 개시의 소정의 통상적인 양 태들만을 예시할 뿐이고, 따라서, 본 설명은 다른 동일하게 효과적인 양태들을 인정할 수도 있으므로, 그 범위 의 한정으로 간주되어서는 안된다는 것에 유의해야 한다. 상이한 도면들에서의 동일한 참조 부호들은 동일 한 또는 유사한 엘리먼트들을 식별할 수도 있다. 도 1은 본 개시에 따른, 무선 네트워크의 예를 예시하는 다이어그램이다.도 2 는 본 개시에 따른, 무선 네트워크에서 사용자 장비 (UE) 와 통신하는 기지국의 일 예를 예시하는 다이어 그램이다. 도 3 은 본 개시에 따른, 4 단계 랜덤 액세스 채널 (RACH) 동작의 일 예를 예시하는 다이어그램이다. 도 4 는 본 개시에 따른, RACH 절차에서 라디오 리소스 제어 (RRC) 접속 요청 메시지와 연관된 물리 업링크 공 유 채널 (PUSCH) 반복에 대한 요청들과 연관된 예를 예시하는 다이어그램이다. 도 5 내지 도 8 은 본 개시에 따른, RACH 절차에서 RRC 접속 요청 메시지와 연관된 PUSCH 반복을 위한 요청들과 연관된 예시적인 프로세스들을 예시하는 다이어그램들이다. 도 9 내지 도 12는 본 개시에 따른, 무선 통신을 위한 예시적인 장치들의 블록도이다."}
