{"patent_id": "10-2022-0069314", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0168702", "출원번호": "10-2022-0069314", "발명의 명칭": "차량의 번호판 인식 방법 및 장치", "출원인": "롯데정보통신 주식회사", "발명자": "김정환"}}
{"patent_id": "10-2022-0069314", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "도로를 주행하는 차량의 번호판을 포함하는 차량 이미지 및 상기 차량이 주행중인 도로의 현재 차선 이미지를획득하는 단계;기준 차선 이미지와 상기 현재 차선 이미지의 색상 차를 나타내는 시프트 값을 산출하는 단계;상기 시프트 값을 이용하여 상기 번호판의 색상 값을 변환하는 단계; 및상기 변환된 색상 값을 이용하여 상기 차량의 종류에 대한 정보를 획득하는 단계;를 포함하는차량의 번호판 인식 방법."}
{"patent_id": "10-2022-0069314", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,상기 기준 차선 이미지가 획득되기 위한 이미지 획득 조건은, 상기 차량 이미지를 획득하는 장소에서의 상기 번호판에 대한 최적의 인식 조건과 동일한차량의 번호판 인식 방법."}
{"patent_id": "10-2022-0069314", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항에 있어서,상기 기준 차선 이미지의 색상은 흰색인차량의 번호판 인식 방법."}
{"patent_id": "10-2022-0069314", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1항에 있어서,상기 기준 차선 이미지와 상기 현재 차선 이미지는 동일한 차선을 촬영함으로써 획득되는차량의 번호판 인식 방법."}
{"patent_id": "10-2022-0069314", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1항에 있어서,상기 차량이 주행중인 도로의 현재 차선 이미지를 획득하는 단계는,상기 차량 이미지로부터 차선 영역을 추출함으로써 상기 현재 차선 이미지를 획득하는 단계;를 포함하는차량의 번호판 인식 방법."}
{"patent_id": "10-2022-0069314", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1항에 있어서,상기 시프트 값을 산출하는 단계는,상기 현재 차선 이미지를 이용하여, 차선 내 훼손 영역이 복원된 복원 차선 이미지를 생성하는 단계; 및상기 기준 차선 이미지와 상기 복원 차선 이미지의 색상 차를 나타내는 상기 시프트 값을 산출하는 단계;를 포함하는차량의 번호판 인식 방법.공개특허 10-2023-0168702-3-청구항 7 제 6항에 있어서,상기 복원 차선 이미지를 생성하는 단계는,훼손된 차선 이미지로부터 상기 기준 차선 이미지를 복원하도록 트레이닝된 생성적 적대 신경망에 상기 현재 차선 이미지를 제공하여, 상기 복원 차선 이미지를 생성하는 단계;를 포함하는차량의 번호판 인식 방법."}
{"patent_id": "10-2022-0069314", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 6항에 있어서,상기 복원 차선 이미지를 생성하는 단계는,상기 현재 차선 이미지의 형상을 상기 기준 차선 이미지의 형상으로 복원하는 단계; 및상기 형상이 복원된 현재 차선 이미지에 상기 현재 차선 이미지의 색상을 적용하여 상기 복원 차선 이미지를 생성하는 단계;를 포함하는차량의 번호판 인식 방법."}
{"patent_id": "10-2022-0069314", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1항에 있어서, 상기 시프트 값을 산출하는 단계는,상기 차선 이미지에 포함되는 그림자 영역의 영역 정보에 기초하여 상기 번호판에 그림자가 생기는지 여부를 결정하고, 상기 번호판에 그림자가 생기는 경우 그림자 보정을 수행하는 것으로 결정하는차량의 번호판 인식 방법."}
{"patent_id": "10-2022-0069314", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9항에 있어서,상기 시프트 값을 산출하는 단계는,상기 그림자 보정을 수행하는 것으로 결정되면, 상기 그림자 영역 내 차선 이미지의 색상 값 및 상기 기준 차선이미지의 색상 값을 이용하여 상기 시프트 값을 산출하는 단계;를 포함하는차량의 번호판 인식 방법."}
{"patent_id": "10-2022-0069314", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 9항에 있어서,상기 시프트 값을 산출하는 단계는,상기 그림자 보정을 수행하지 않는 것으로 결정되면, 비 그림자 영역 내 차선 이미지의 색상 값 및 상기 기준차선 이미지의 색상 값을 이용하여 상기 시프트 값을 산출하는 단계;를 포함하는차량의 번호판 인식 방법."}
{"patent_id": "10-2022-0069314", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 9항에 있어서,상기 시프트 값을 이용하여 상기 번호판의 색상 값을 변환하는 단계는,상기 그림자 보정을 수행하는 것으로 결정되면 상기 차량 이미지로부터 그림자를 제거하는 단계; 및상기 시프트 값을 이용하여, 상기 그림자가 제거된 상태에서의 상기 번호판의 색상 값을 변환하는 단계;를 포함공개특허 10-2023-0168702-4-하는차량의 번호판 인식 방법."}
{"patent_id": "10-2022-0069314", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 9항에 있어서,상기 차선 이미지에 포함되는 그림자 영역은,차선으로부터 돌출되어 설치되는 그림자 생성 장치에 의해 생성되는차량의 번호판 인식 방법."}
{"patent_id": "10-2022-0069314", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 1항에 있어서,상기 차량의 종류에 대한 정보를 획득하는 단계는,상기 차량 이미지에 포함된 번호판의 변환된 색상 값 및 상기 차량 이미지에 포함된 번호판 내 패턴을 이용하여상기 차량의 종류에 대한 정보를 획득하는 단계;를 포함하는차량의 번호판 인식 방법."}
{"patent_id": "10-2022-0069314", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 1항에 있어서,상기 차량의 종류에 대한 정보를 획득하는 단계는,상기 차량을 친환경 차량 또는 일반 차량으로 분류하는차량의 번호판 인식 방법."}
{"patent_id": "10-2022-0069314", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "도로를 주행하는 차량의 번호판을 포함하는 차량 이미지를 획득하는 이미지 획득부; 및상기 차량이 주행중인 도로의 현재 차선 이미지를 획득하고, 기준 차선 이미지와 상기 현재 차선 이미지의 색상차를 나타내는 시프트 값을 산출하고, 상기 시프트 값을 이용하여 상기 번호판의 색상 값을 변환하고, 상기 변환된 색상 값을 이용하여 상기 차량의 종류에 대한 정보를 획득하는 제어부;를 포함하는차량의 번호판 인식 장치."}
{"patent_id": "10-2022-0069314", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 16항에 있어서,상기 기준 차선 이미지가 획득되기 위한 이미지 획득 조건은, 상기 차량 이미지를 획득하는 장소에서의 상기 번호판에 대한 최적의 인식 조건과 동일한차량의 번호판 인식 장치."}
{"patent_id": "10-2022-0069314", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 16항에 있어서,상기 기준 차선 이미지의 색상은 흰색인차량의 번호판 인식 장치."}
{"patent_id": "10-2022-0069314", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 16항에 있어서,공개특허 10-2023-0168702-5-상기 기준 차선 이미지와 상기 현재 차선 이미지는 동일한 차선을 촬영함으로써 획득되는차량의 번호판 인식 장치."}
{"patent_id": "10-2022-0069314", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 16항에 있어서,상기 제어부는,상기 차량 이미지로부터 차선 영역을 추출함으로써 상기 현재 차선 이미지를 획득하는차량의 번호판 인식 장치."}
{"patent_id": "10-2022-0069314", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "차량의 번호판 인식 방법이 개시된다. 본 발명에 따른 차량의 번호판 인식 방법은, 도로를 주행하는 차량의 번호 판을 포함하는 차량 이미지 및 상기 차량이 주행중인 도로의 현재 차선 이미지를 획득하는 단계, 기준 차선 이미 지와 상기 현재 차선 이미지의 색상 차를 나타내는 시프트 값을 산출하는 단계, 상기 시프트 값을 이용하여 상기 번호판의 색상 값을 변환하는 단계, 및, 상기 변환된 색상 값을 이용하여 상기 차량의 종류에 대한 정보를 획득 하는 단계를 포함한다."}
{"patent_id": "10-2022-0069314", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은, 외부 환경의 변화에도 불구하고 차량 번호판의 색상을 정확하게 검출하고, 검출된 색상을 이용하여 차량의 종류를 판별할 수 있는, 차량의 번호판 인식 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2022-0069314", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "현대 사회에서 복잡한 교통 환경의 효율적 관리가 요구됨에 따라 지능형 교통관리 시스템 구성의 필요성이 높아 졌다. 그리고 번호판 인식은 지능형 인프라 시스템의 가장 중심기술로서, 고속도로 통행료 지불 시스템, 주차장 출입관리 시스템, 교통량 감시 및 도시 출입관리 시스템 등 다양한 응용분야에서 인간의 단순작업을 대행하는 중요한 역할을 수행할 수 있다. 번호판에는 차량의 종류를 판별할 수 있는 정보가 포함되어 있으며, 기존에는 차량의 종류를 판별하는 방법으로 패턴 인식(pattern Recognition)을 많이 사용하였다. 그러나 패턴을 이용하는 방식은, 그림자나 악천후 등의 외 부 환경으로 인해 패턴이 잘 인식되지 않는 경우에 인식률이 저하된다는 문제가 있다."}
{"patent_id": "10-2022-0069314", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상술한 문제점을 해결하기 위한 것으로, 본 발명의 목적은, 외부 환경의 변화에도 불구하고 차량 번 호판의 색상을 정확하게 검출하고, 검출된 색상을 이용하여 차량의 종류를 판별할 수 있는, 차량의 번호판 인식 방법 및 장치를 제공하기 위함이다."}
{"patent_id": "10-2022-0069314", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시 예에 따른 차량의 번호판 인식 방법은, 도로를 주행하는 차량의 번호판을 포함하는 차량 이 미지 및 상기 차량이 주행중인 도로의 현재 차선 이미지를 획득하는 단계, 기준 차선 이미지와 상기 현재 차선 이미지의 색상 차를 나타내는 시프트 값을 산출하는 단계, 상기 시프트 값을 이용하여 상기 번호판의 색상 값을 변환하는 단계, 및, 상기 변환된 색상 값을 이용하여 상기 차량의 종류에 대한 정보를 획득하는 단계를 포함한 다. 이 경우 상기 기준 차선 이미지가 획득되기 위한 이미지 획득 조건은, 상기 차량 이미지를 획득하는 장소에서의 상기 번호판에 대한 최적의 인식 조건과 동일할 수 있다. 한편 상기 기준 차선 이미지의 색상은 흰색일 수 있다. 한편 상기 기준 차선 이미지와 상기 현재 차선 이미지는 동일한 차선을 촬영함으로써 획득될 수 있다. 한편 상기 차량이 주행중인 도로의 현재 차선 이미지를 획득하는 단계는, 상기 차량 이미지로부터 차선 영역을 추출함으로써 상기 현재 차선 이미지를 획득하는 단계를 포함할 수 있다. 한편 상기 시프트 값을 산출하는 단계는, 상기 현재 차선 이미지를 이용하여, 차선 내 훼손 영역이 복원된 복원 차선 이미지를 생성하는 단계, 및, 상기 기준 차선 이미지와 상기 복원 차선 이미지의 색상 차를 나타내는 상기 시프트 값을 산출하는 단계를 포함할 수 있다.이 경우 상기 복원 차선 이미지를 생성하는 단계는, 훼손된 차선 이미지로부터 상기 기준 차선 이미지를 복원하 도록 트레이닝된 생성적 적대 신경망에 상기 현재 차선 이미지를 제공하여, 상기 복원 차선 이미지를 생성하는 단계를 포함할 수 있다. 한편 상기 복원 차선 이미지를 생성하는 단계는, 상기 현재 차선 이미지의 형상을 상기 기준 차선 이미지의 형 상으로 복원하는 단계, 및, 상기 형상이 복원된 현재 차선 이미지에 상기 현재 차선 이미지의 색상을 적용하여 상기 복원 차선 이미지를 생성하는 단계를 포함할 수 있다. 한편 상기 시프트 값을 산출하는 단계는, 상기 차선 이미지에 포함되는 그림자 영역의 영역 정보에 기초하여 상 기 번호판에 그림자가 생기는지 여부를 결정하고, 상기 번호판에 그림자가 생기는 경우 그림자 보정을 수행하는 것으로 결정할 수 있다. 이 경우 상기 시프트 값을 산출하는 단계는, 상기 그림자 보정을 수행하는 것으로 결정되면, 상기 그림자 영역 내 차선 이미지의 색상 값 및 상기 기준 차선 이미지의 색상 값을 이용하여 상기 시프트 값을 산출하는 단계를 포함할 수 있다. 한편 상기 시프트 값을 산출하는 단계는, 상기 그림자 보정을 수행하지 않는 것으로 결정되면, 비 그림자 영역 내 차선 이미지의 색상 값 및 상기 기준 차선 이미지의 색상 값을 이용하여 상기 시프트 값을 산출하는 단계를 포함할 수 있다. 한편 상기 시프트 값을 이용하여 상기 번호판의 색상 값을 변환하는 단계는, 상기 그림자 보정을 수행하는 것으 로 결정되면 상기 차량 이미지로부터 그림자를 제거하는 단계, 및, 상기 시프트 값을 이용하여, 상기 그림자가 제거된 상태에서의 상기 번호판의 색상 값을 변환하는 단계를 포함할 수 있다. 한편 상기 차선 이미지에 포함되는 그림자 영역은, 차선으로부터 돌출되어 설치되는 그림자 생성 장치에 의해 생성될 수 있다. 한편 상기 차량의 종류에 대한 정보를 획득하는 단계는, 상기 차량 이미지에 포함된 번호판의 변환된 색상 값 및 상기 차량 이미지에 포함된 번호판 내 패턴을 이용하여 상기 차량의 종류에 대한 정보를 획득하는 단계를 포 함할 수 있다. 한편 상기 차량의 종류에 대한 정보를 획득하는 단계는, 상기 차량을 친환경 차량 또는 일반 차량으로 분류할 수 있다. 한편 본 발명에 따른 차량의 번호판 인식 장치는, 도로를 주행하는 차량의 번호판을 포함하는 차량 이미지를 획 득하는 이미지 획득부, 및, 상기 차량이 주행중인 도로의 현재 차선 이미지를 획득하고, 기준 차선 이미지와 상 기 현재 차선 이미지의 색상 차를 나타내는 시프트 값을 산출하고, 상기 시프트 값을 이용하여 상기 번호판의 색상 값을 변환하고, 상기 변환된 색상 값을 이용하여 상기 차량의 종류에 대한 정보를 획득하는 제어부를 포함 한다. 이 경우 상기 기준 차선 이미지가 획득되기 위한 이미지 획득 조건은, 상기 차량 이미지를 획득하는 장소에서의 상기 번호판에 대한 최적의 인식 조건과 동일할 수 있다. 한편 상기 기준 차선 이미지의 색상은 흰색일 수 있다. 한편 상기 기준 차선 이미지와 상기 현재 차선 이미지는 동일한 차선을 촬영함으로써 획득될 수 있다. 한편 상기 제어부는, 상기 차량 이미지로부터 차선 영역을 추출함으로써 상기 현재 차선 이미지를 획득할 수 있 다."}
{"patent_id": "10-2022-0069314", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 번호판의 패턴 뿐만 아니라 번호판의 색상을 이용하여 차량을 분류함으로써, 차량 종류 판별 의 정확도, 특히 고유한 색상의 번호판을 가지는 친환경 차량 판별의 정확도를 향상시킬 수 있는 장점이 있다. 발명에 따르면, 기준 차선 이미지를 이용하여 화이트 밸런싱을 위한 기준점을 명확히 제공함으로써, 차량 종류 판별의 정확도를 향상시킬 수 있는 장점이 있다. 본 발명에 따르면, 화이트 밸런싱을 위한 기준점으로 차선을 사용한다. 즉, 차선은 도로 상에서 차량의 주행 경 로의 좌우에 배치되기 때문에 차량과 매우 근접하여 위치하는 점(즉 기준점의 환경과 차량의 환경이 동일한점), 차선은 색상 차를 판별하여 화이트 밸런싱을 적용하는데 매우 유리한 색상(흰색)을 가지는 점, 차선은 보 통 차량을 촬영할 때 함께 촬영되기 때문에 구현이 간단하다는 점에서, 이점을 제공할 수 있다."}
{"patent_id": "10-2022-0069314", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 명세서에 개시된 실시 예를 상세히 설명하되, 도면 부호에 관계없이 동일하거 나 유사한 구성요소는 동일한 참조 번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 이하의 설명 에서 사용되는 구성요소에 대한 접미사 \"모듈\" 및 \"부\"는 명세서 작성의 용이함만이 고려되어 부여되거나 혼용 되는 것으로서, 그 자체로 서로 구별되는 의미 또는 역할을 갖는 것은 아니다. 또한, 본 명세서에 개시된 실시 예를 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 명세서에 개시된 실시 예의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 또한, 첨부된 도면은 본 명세서에 개시된 실시 예를 쉽게 이 해할 수 있도록 하기 위한 것일 뿐, 첨부된 도면에 의해 본 명세서에 개시된 기술적 사상이 제한되지 않으며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소 들은 상기 용어들에 의해 한정되지는 않는다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있 다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 도 1은 본원 명세서에서 해결하려는 문제점을 설명하기 위한 도면이다. 도 1a에는 친환경 차량의 번호판 및 일반 차량의 번호판이 도시되어 있다. 친환경 차량의 번호판에는, 번호판이 장착된 차량이 친환경 차량임을 나타내는 오브젝트(1110, 1120, 1130)가 포함되어 있다. 따라서 이러한 오브젝트(1110, 1120, 1130)를 패턴으로써 인식하는 경우, 해당 차량이 친환경 차량임을 쉽게 인식할 수 있다. 그러나, 그림자나 악천후 등의 외부 환경으로 인해 친환경 차량임을 나타내는 오브젝트(1110, 1120, 1130)가 가 려지는 경우, 차량의 종류 판별의 정확도가 저하되는 문제가 발생한다. 따라서 친환경 차량의 번호판의 색상을 고려하여 차량의 종류를 판단하는 방법을 추가적으로 고려해볼 수 있다. 다만 카메라에 의해 촬영되는 번호판의 색상은 외부 환경에 의해 변화할 수 있다. 예를 들어 도 1b에서 도시한 바와 같이, 시간(오전, 오후, 밤, 일출, 일몰 등)에 따라 촬영되는 번호판의 색상이 달라질 수 있으며, 날씨(맑은 날씨, 흐린 날씨, 우천, 강설 등)에 따라 촬영되는 번호판의 색상이 상이해질 수 있다. 또한 촬영시 사용하는 카메라의 종류(예를 들어 적외선 카메라, RGB 카메라)나 스펙에 따라 촬영되는 번호판의 색상이 상이해질 수 있다. 이를 해결하기 위해 자동 화이트 밸런싱(Auto White Balancing) 기술을 번호판에 적용하는 방식을 생각해볼 수 있다. 다만 이러한 방식은 자동 화이트 밸런싱(Auto White Balancing)을 적용하기 위한 기준점을 어떻게 산정할 지에 대한 문제가 남는다. 예를 들어 단순 감상용 사진에는, 적당한 설정값을 이용하여 자동 화이트 밸런싱 (Auto White Balancing) 기술을 적용하여도 무방하다. 다만 번호판의 색상을 이용하여 차량의 종류를 판별하는 기술에 있어서는, 번호판의 색상이 차량의 종류 판별에 매우 중요한 역할을 하기 때문에, 촬영된 영상 내 번호 판의 색상으로부터 번호판의 진짜 색상을 정확히 유추해 내는 것이 매우 중요하다. 도 2는 본 발명에 따른, 번호판 인식 시스템의 적용 예를 도시한 도면이다. 본 발명에 따른 번호판 인식 시스템은, 도 2와 같은 하이패스 톨게이트에 설치될 수 있다. 구체적으로 번호판 인식 시스템을 구성하는 카메라는 하이패스 톨게이트를 통과하는 차량을 촬영하여, 차량의 번호판을 포함하는 차량 이미지를 획득할 수 있다. 그리고 번호판 인식 시스템을 구성하는 번호판 인식 장치는, 차량 이미지를 이 용하여 차량 정보(차량의 종류, 차량 번호 등)를 획득하고, 획득된 차량 정보를 이용하여 해당 차량에 대해 이 용 요금을 징수할 수 있다. 이하에서는 번호판 인식 시스템이 하이패스 톨게이트에 설치되는 것으로 가정하여 설명한다. 다만 이에 한정되 지 않으며, 본 발명에 따른 번호판 인식 시스템은, 하이패스 톨게이트 뿐만 아니라 다양한 분야에서 사용될 수 있다. 예를 들어 주차장 등, 차량의 출입을 관리하거나 요금을 징수하는 곳에서, 본 발명에 따른 번호판 인식 시스템이 사용될 수 있다. 따라서 본 명세서에서 “도로”란 공공 도로 뿐만 아니라 사유 도로를 포함할 수 있으며, 본 명세서에서 “도로 를 주행하는 차량을 촬영한다”는 것은, 도로에서 움직이는 차량 뿐만 아니라 도로에서 멈춰선 차량을 촬영하는 것을 포함할 수 있다. 도 3은 본 발명에 따른 번호판 인식 시스템을 설명하기 위한 도면이다. 본 발명에 따른 번호판 인식 시스템은, 차량 검지 장치, 번호판 인식 장치, 통합 차로 제어 장치 및 영상 서버를 포함할 수 있다. 차량 검지 장치는 레이저 센서를 이용하여 차량을 검지할 수 있다. 구체적으로 차량 검지 장치는 레 이저 신호를 송출하고, 차량에서 반사된 레이저 신호를 수신하는 방식으로 도로를 주행하는 차량을 검출할 수 있다. 차량이 검지되면, 차량 검지 장치는 번호판 인식 장치에 차량 검지 신호를 전송할 수 있다. 차량 검지 장치로부터 차량 검지 신호가 수신되면, 번호판 인식 장치는 도로를 주행하는 차량을 촬영 하여 차량 이미지를 획득할 수 있다. 이 경우 차량 이미지는 도로를 주행하는 차량의 번호판을 포함할 수 있다. 또한 번호판 인식 장치는 도로를 주행하는 차량을 복수회 촬영하여 복수의 차량 이미지를 획득할 수 있으 며, 이 경우 복수의 차량 이미지 중 차량이 이미지의 중앙에 위치하는 차량 이미지를 선택하여 번호판을 인식할 수 있다. 또한 번호판 인식 장치는 차량의 번호판을 포함하는 차량 이미지를 이용하여 차량 정보(차량의 종류, 차량 번호 등)를 획득하여 통합 차로 제어 장치에 전송할 수 있다. 통합 차로 제어 장치는 차량의 번호판을 인식한 결과(차량 정보)를 차량의 검지 정보(예를 들어 차량 이미 지)와 매칭한 매칭 정보를 생성하고, 생성된 매칭 정보를 번호판 인식 장치에 전송할 수 있다. 번호판 인식 장치는 매칭 정보를 이용하여 차량의 번호판을 인식한 결과(차량 정보) 및 차량의 검지 정보 (예를 들어 차량 이미지)를 포함하는 영상 파일을 생성하고, 생성된 영상 파일을 영상 서버에 전송할 수 있다. 이 경우 영상 서버는 생성된 영상 파일을 저장할 수 있다. 한편 번호판 인식 시스템은 통행료 정보 장치(미도시)를 더 포함할 수 있으며, 통행료 정보 장치는 영상 서버 에 저장된 영상 파일을 이용하여 해당 차량에 대하여 요금을 징수할 수 있다. 도 4는 본 발명에 따른, 차량의 번호판 인식 장치의 구성요소를 설명하기 위한 블록도이다. 본 발명에 따른 차량의 번호판 인식 장치는, 이미지 획득부, 제어부, 메모리 및 통신부 를 포함할 수 있다. 이미지 획득부는 도로를 주행하는 차량의 번호판을 포함하는 차량 이미지를 획득할 수 있다. 구체적으로 이미지 획득부는 외부 장치와 통신하는 통신 모듈을 포함할 수 있으며, 이 경우 영상 획득부는 외부 장치(예를 들어 카메라)로부터 도로를 주행하는 차량의 번호판을 포함하는 차량 이미지를 수신할 수 있다. 또한 영상 획득부는 카메라를 포함할 수 있으며, 이 경우 영상 획득부는 도로를 주행하는 차량을 촬 영하여, 도로를 주행하는 차량의 번호판을 포함하는 차량 이미지를 획득할 수 있다. 제어부는 하나 이상의 프로세서를 포함하고, 차량의 번호판 인식 장치의 전반적인 동작을 제어할 수 있다. 용어 “제어부”는 용어 “프로세서와 혼용되어 사용될 수 있다. 메모리는 차량의 번호판 인식 장치의 동작을 위한 프로그램 또는 명령어를 저장할 수 있다. 한편 차량의 번호판 인식 장치는 하나 이상의 인공지능 모델을 포함할 수 있다. 그리고 하나 이상의 인공 지능 모델은 하드웨어, 소프트웨어 또는 하드웨어와 소프트웨어의 조합으로 구현될 수 있으며, 하나 이상의 인 공지능 모델을 구성하는 하나 이상의 명령어(instruction)는 메모리에 저장될 수 있다. 또한 제어부는 메모리에 저장된 하나 이상의 명령어를 읽어 인공지능 모델을 구동할 수 있다. 따라서 본 명세서에서 인공지능 모델의 동작으로 설명하는 것은, 제어부에 의해 수행되는 동작으로 정의할 수도 있다. 인공지능 모델은 인공 신경망을 포함할 수 있다. 인공 신경망은 다른 레이어의 뉴런들 사이의 연결 패턴, 모델 파라미터를 갱신하는 학습 과정, 출력값을 생성하는 활성화 함수(Activation Function)에 의해 정의될 수 있다. 모델 파라미터는 학습을 통해 결정되는 파라미터를 의미하며, 시냅스 연결의 가중치와 뉴런의 편향 등이 포함된 다. 그리고 인공 신경망의 학습의 목적은 손실 함수를 최소화하는 모델 파라미터를 결정하는 것으로 볼 수 있다. 손실 함수는 인공 신경망의 학습 과정에서 최적의 모델 파라미터를 결정하기 위한 지표로 이용될 수 있다. 그리고 인공지능 모델이란, 손실 함수(손실 값)을 최소화 하는 방향으로 모델 파라미터가 업데이트된(또 는 최적화된)된 인공신경망을 의미할 수 있다. 또한 인공지능 모델은 번호판 이미지로부터 특징 벡터를 추출하기 위한 추출 모델을 더 포함할 수 있다. 추출 모델은, 차량 이미지 또는 현재 차선 이미지로부터 특징 벡터를 추출하기 위해 2차원 데이터의 학습에 적합한 CNN(Convolutional Neural Network)으로 구성될 수 있으나, 이에 한정되지는 않는다. 통신부는 외부 장치와 통신하기 위한 통신 회로를 포함하고, 최부 장치와 데이터를 송신 또는 수신할 수 있다. 도 5는 본 발명에 따른, 차량의 번호판 인식 방법을 설명하기 위한 순서도이다. 본 발명에 따른 차량의 번호판 인식 방법은, 도로를 주행하는 차량의 번호판을 포함하는 차량 이미지를 획득하 는 단계(S510), 차량이 주행중인 도로의 현재 차선 이미지를 획득하는 단계(S520), 기준 차선 이미지와 상기 현 재 차선 이미지의 색상 차를 나타내는 시프트 값을 산출하는 단계(S530), 상기 시프트 값을 이용하여 상기 번호 판의 색상 값을 변환하는 단계(S540), 및, 상기 변환된 색상 값을 이용하여 상기 차량의 종류에 대한 정보를 획 득하는 단계(S550)를 포함할 수 있다. S510, S520과 관련하여, 이미지 획득부는 차량의 번호판을 포함하는 차량 이미지를 획득할 수 있다. 또한 제어부는 차량이 주행중인 도로의 현재 차선 이미지를 획득할 수 있다. 여기서 ‘현재 차선 이미지’ 의 의미는, 차량 이미지가 획득되었을 때 획득된 차선 이미지를 의미할 수 있다. 구체적으로 S510에서 획득된 차량 이미지에는, 차량의 번호판 뿐만 아니라 차량, 차량 주변의 차선 등이 더 포 함될 수 있다. 이 경우 제어부는 S510에서 획득된 차량 이미지로부터 차선 영역을 추출하여, 현재 차선 이 미지를 획득할 수 있다. 다만 이에 한정되지 않으며, 이미지 획득부는 도로를 주행하는 차량을 촬영하는 것과 함께, 차량 주변의 차선을 별도로 촬영함으로써 현재 차선 이미지를 획득할 수도 있다. 이 경우 제어부는 이미지 획득부(11 0)로부터 촬영된 이미지를 수신함으로써, 현재 차선 이미지를 획득할 수 있다. S530과 관련하여, 제어부는 기준 차선 이미지와 현재 차선 이미지의 색상 차를 나타내는 시프트(Shift) 값 을 산출할 수 있다. 이와 관련해서는 도 6 내지 도 8을 참고하여 설명한다. 도 6은 기준 차선 이미지 및 현재 차선 이미지를 설명하기 위한 도면이다. 제어부는 기준 차선 이미지와 현재 차선 이미지의 색상 차를 산출하고, 산출된 색상 차를 이용하여 번호판 의 색상값을 변환(화이트 밸런싱)할 수 있다. 따라서 기준 차선 이미지는, 번호판을 포함하는 차량 이미지 의 화이트 밸런싱을 위하여, 기준이 되는 색상을 제공하는 이미지일 수 있다. 기준 차선 이미지는 기준이 되는 색상을 제공하기 때문에, 항상 고정된 색상을 가지고 있어야 한다. 따라 서 다양한 환경에서 수집된 복수의 현재 차선 이미지는, 하나의 기준 차선 이미지랑 비교될 수 있다. 한편 기준 차선 이미지를 획득되기 위한 이미지 획득 조건은, 차량 이미지를 획득하는 장소(차량의 번호판 인식 장치가 설치된 장소)에서의 번호판에 대한 최적의 인식 조건과 동일할 수 있다. 구체적으로 번호판을 인식 하기 위한 최적의 조건이 존재할 수 있다. 예를 들어 야간에 악천후에 촬영된 번호판 이미지보다는, 주간에 맑 은 날씨에 촬영된 번호판 이미지를 이용할 때, 번호판을 인식하기가 훨씬 용이해진다. 주간에 맑은 날씨에 촬영 된 번호판의 이미지가, 차량에 부착된 실제 번호판의 색상을 가장 잘 나타내기 때문이다. 따라서, 현재 촬영된 번호판을, 번호판의 최적의 인식 조건에서 촬영된 번호판(예를 들어 주간, 맑은 날씨)과 같이 보정하는 것이 번호판 인식에 가장 유리하다. 그리고 현재 촬영된 번호판을 번호판의 최적의 인식 조건에 서 촬영된 번호판(예를 들어 주간, 맑은 날씨)과 같이 보정하기 위해서는, 기준 차선 이미지를 획득하기 위한 이미지 획득 조건 역시 번호판의 최적의 인식 조건과 동일해야 한다. 예를 들어 번호판의 최적의 인식 조건이 주간 및 맑은 날씨인 경우, 기준 차선 이미지가 획득되었을 때의 이미지 획득 조건 역시 주간 및 맑은 날씨일 수 있다. 또한 번호판에 대한 최적의 인식 조건은 장소마다 상이할 수 있다. 따라서 기준 차선 이미지와 현재 차선 이미 지는 동일한 장소를 촬영한 것일 수 있다. 예를 들어 기준 차선 이미지와 현재 차선 이미지는 동일한 장소를 촬 영하는 동일한 카메라에 의해 획득될 수 있다. 또한 기준 차선 이미지와 현재 차선 이미지는 동일한 차선을 촬영함으로써 획득될 수 있다. 예를 들어 현재 차 선 이미지가 특정 하이패스 톨게이트의 특정 경로(예를 들어 1차선)의 좌우 차선을 촬영한 이미지인 경우, 기준 차선 이미지 역시 특정 하이패스 톨게이트의 특정 경로의 좌우 차선을 촬영한 이미지일 수 있다. 또한 기준 차선 이미지의 색상(즉 촬영된 이미지의 색상)은, 도로에 실제로 도포된 차선의 색상과 동일할 수 있다. 예를 들어 차량이 주행하는 도로에 실제로 도포된 색상이 흰색인 경우, 기준 차선 이미지의 색상 역시 흰색이어야 한다. 이 경우 제어부는 HSV, YCbCr 등의 색 공간 상에서 흰색에 속하는 범위값을 설정하고, 범위값 내에 속하는 차선 이미지를 기준 차선 이미지로 설정할 수 있다. 또한 기준 차선 이미지와 현재 차선 이미지의 정확한 비교를 위해서는, 도로 상에서 차선의 도장 상태가 완벽해야 한다. 따라서 기준 차선 이미지는 도로 상에 차선이 도포된 초창기(즉, 도로 상에 차선이 도포되 었고, 물리적 훼손, 다른 물질(예를 들어 타이어 자국)에 의한 오염 등이 발생하지 않은 상태)에 도로를 촬영함 으로써 획득될 수 있다. 기준 차선 이미지는 차량의 번호판 인식 장치의 메모리에 저장될 수 있다. 제어부는 기준 차선 이미지와 현재 차선 이미지의 색상 차를 나타내는 시프트 값을 산출하고, 산출된 시프트 값을 이용하여 번호판의 색상값을 변환할 수 있다. 이와 관련해서는 추후에 다시 설명하도록 한다. 한편 도로 상에 도포된 차선은 타이어 자국과 같이 다른 물질에 의해 오염되거나, 물리적 훼손 등으 로 인하여 형상이 변화할 수 있으며, 현재 차선 이미지는 이와 같은 형상 변화를 반영할 수 있다. 현재 차 선 이미지에서 다른 물질에 의해 오염되거나 물리적 훼손이 발생한 영역을 훼손 영역이라 명칭 하도록 한다. 그리고 제어부는 현재 차선 이미지를 이용하여 차선 내 훼손 영역이 복원된 복원 차선 이미지를 생성하고, 생성된 복원된 차선 이미지를 기준 차선 이미지와 비교하여 기준 차선 이미지와 복원 차선 이미지의 색상 차를 나타내는 시프트 값을 산출할 수 있다. 도 7은 본 발명에 따른, 복원 차선 이미지를 생성하는 방법을 설명하기 위한 도면이다. 도 7a를 참고하면, 제어부는 생성적 적대 신경망(Generative Adversarial Network, GAN)을 포함하는 인공 지능 모델을 이용하여 복원 차선 이미지를 생성할 수 있다. 구체적으로 생성적 적대 신경망(GAN)은 훼손된 차선 이미지로부터 기준 차선 이미지를 복원하도록 트레이닝 될 수 있다. 더욱 구체적으로 생성적 적대 신경망(Generative Adversarial Network, GAN)은 생성자(generator) 및 판별자 (discriminator)를 포함할 수 있다. 생성자(generator)는 훼손된 차선 이미지를 이용하여 복원 차선 이미지, 즉가짜 이미지를 생성하고, 생성된 복원 차선 이미지를 판별자(discriminator)에 제공할 수 있다. 또한 제어부 또는 트레이닝 장치는 진짜 이미지를 판별자(discriminator)에 제공할 수 있다. 생성자(generator)는 훼 손된 차선 이미지를 기준 차선 이미지와 똑같이 복원하는 것을 목표로 하므로, 진짜 이미지로는 앞서 설명한 기 준 차선 이미지가 사용될 수 있다. 이 경우 판별자(discriminator)는 생성자(generator)가 출력한 영상이 가짜인지, 그리고 제어부 또는 트레 이닝 장치가 제공한 영상이 진짜인지를 판별할 수 있다. 또한 제어부 또는 다른 트레이닝 장치는 판별자의 판별 결과를 이용하여 로스 값을 산출하고, 산출된 로스 값을 이용하여 생성자 및 판별자의 모델 파라미터를 업 데이트 할 수 있다. 그리고 이러한 프로세스를 반복함에 따라 생성자 및 판별자의 모델 파라미터가 최적화 될 수 있다. 한편 생성적 적대 신경망(GAN)의 트레이닝이 완료되면, 생성적 적대 신경망(GAN)의 생성자(generator)는 차량의 번호판 인식 장치의 메모리에 저장될 수 있다. 그리고 현재 차선 이미지가 획득되는 경우, 제어부는 현재 차선 이미지를 생성적 적대 신경망에 (더욱 구체적으로는, 생성적 적대 신경망의 생성자(generator)에) 제공하여 복원 차선 이미지를 생성할 수 있다. 구체적으로 현재 차선 이미지가 입력되면, 생성적 적대 신경망의 생성자(generator)는 자신의 파라 미터에 기반하여 복원 차선 이미지를 출력할 수 있다. 또한, 생성적 적대 신경망의 생성자(generator)는 훼손된 차선 이미지를 기준 차선 이미지와 똑같이 복원하는 것을 목표로 트레이닝 되었기 때문에, 복원 차선 이 미지는 기준 차선 이미지와 유사하게 복원될 수 있다. 한편 본 발명에서는 현재 차선 이미지와 기준 차선 이미지의 색상 차를 이용하여 시프트 값을 산출하기 때 문에, 현재 차선 이미지의 색상은 기준 차선 이미지와 동일하게 복원되어서는 안된다. 따라서 제어부(12 0)는 현재 차선 이미지의 형상만을 복원하고, 현재 차선 이미지의 색상은 복원하지 않을 수 있다. 구체적으로 제어부는 현재 차선 이미지의 형상을 기준 차선 이미지의 형상으로 복원할 수 있다. 형상 을 복원하는 방법으로 앞서 설명한 생성적 적대 신경망(GAN)이 사용될 수 있으나 이에 한정되지 않다. 예를 들 어 제어부는, 현재 차선 이미지와 기준 차선 이미지를 비교하여 현재 차선 이미지 내 훼손 영역을 추출하고, 훼손 영역을 기준 차선 이미지와 같이 복원하는 방식으로 현재 차선 이미지의 형 상을 기준 차선 이미지의 형상으로 복원할 수 있다. 다음으로 제어부는 형상이 복원된 현재 차선 이미지에 현재 차선 이미지의 색상을 적용하여 복원 차선 이 미지를 생성할 수 있다. 구체적으로 제어부는 본래의 현재 차선 이미지(복원 전 차선 이미지)의 색상 을 추출하고, 추출된 색상을 형상이 복원된 현재 차선 이미지에 적용하여 복원 차선 이미지를 생성할 수 있다. 이에 따라 복원 차선 이미지는, 기준 차선 이미지와 동일한 형상 및 다른 색상을 가질 수 있다. 다음으로 도 7b를 참고하면, 제어부는 기준 차선 이미지와 복원 차선 이미지의 색상 차를 나타 내는 시프트 값을 산출할 수 있다. 구체적으로 제어부는 기준 차선 이미지의 색상 값과 복원 차선 이 미지의 색상 값을 차분하여, 기준 차선 이미지와 복원 차선 이미지의 색상 차를 나타내는 시프 트 값을 산출할 수 있다. 여기서 색상 값은, 색 공간을 구성하는 복수의 차원에 각각 대응하는 복수의 속성 값을 포함할 수 있다. 예를 들어 HSV 색공간을 사용하는 경우, 기준 차선 이미지의 색상 값과 복원 차선 이미지의 색상 값은, 색 상 속성 값(Hue), 채도 속성 값(Saturation) 및 명도 속성 값(Value)을 포함할 수 있으며, 이 경우 시프트 값 역시 색상 속성 값(Hue), 채도 속성 값(Saturation) 및 명도 속성 값(Value)을 포함할 수 있다. 또한 제어부는 기준 차선 이미지와 복원 차선 이미지를 픽셀 별로 비교하고, 픽셀별 색상 차를 종합하여(예를 들어 평균하여) 시프트 값을 산출할 수도 있다. 도 8은 본 발명에 따른, 시프트 값을 이용하여 번호판의 색상을 변환하는 방법을 설명하기 위한 도면이다. 제어부는 기준 차선 이미지와 현재 차선 이미지의 색상 차를 나타내는 시프트 값을 이용하여 번호판 의 색상을 변환할 수 있다(S540). 구체적으로, 앞서 설명한 차량 이미지에는 차량의 번호판이 포함되어 있다. 그리고 제어부는 기준 차선 이 미지와 현재 차선 이미지의 색상 차를 나타내는 시프트 값을 차량 이미지 내 번호판의 색상값에 적용하여,번호판의 변환된 색상 값을 산출할 수 있다. 구체적으로 제어부는 시프트 값에 포함되는 복수의 속성 값을, 차량 이미지 내 번호판의 색상 값에 포함되 는 복수의 속성 값에 더하여, 번호판의 변환된 색상 값을 산출할 수 있다. 도 8의 테이블에는, 흐린 날 낮에 촬영된 현재 차선 이미지가 도시되어 있다. 이 경우 제어부는 맑은 날 낮에 촬영된 기준 차선 이미지와 현재 차선 이미지의 색상 차를 나타내는 시프트 값을 산출하고, 산출된 시프트 값을 현재 차선 이미지와 함께 촬영된 번호판의 색상 값에 적용하여 변환된 색상 값 을 산출할 수 있다. 이에 따라 번호판의 색상 값은, 기준 차선 이미지가 획득 되었을때의 이미지 획득 조 건(맑은 날 낮) 상에서 촬영된 것과 같이 변환될 수 있다. 도 8의 테이블에는, 밤에 적외선 카메라(IR 센서)에 의해 촬영된 현재 차선 이미지가 도시되어 있다. 이 경우 제어부는 맑은 날 낮에 일반 카메라로 촬영된 기준 차선 이미지와 현재 차선 이미지의 색 상 차를 나타내는 시프트 값을 산출하고, 산출된 시프트 값을 현재 차선 이미지와 함께 촬영된 번호판의 색상 값에 적용하여 변환된 색상 값을 산출할 수 있다. 이에 따라 번호판의 색상 값은, 기준 차선 이 미지가 획득 되었을때의 이미지 획득 조건(맑은 날 낮) 상에서 촬영된 것과 같이 변환될 수 있다. 다음으로, 제어부는 변환된 색상값을 이용하여 차량의 종류에 대한 정보를 획득할 수 있다(S550). 이하에서는 번호판의 변환된 색상 값 및 번호판의 패턴을 이용하여 번호판이 장착된 차량의 종류를 분류하는 것으로 설명하나 이에 한정되지 않으며, 번호판의 변환된 색상 값만으로 차량의 종류를 분류하는 방식으로 구현될 수도 있다. 제어부는 차량 이미지에 포함된 번호판의 변환된 색상 값 및 차량 이미지에 포함된 번호판 내 패턴을 이용 하여 차량의 종류에 대한 정보를 획득할 수 있다. 이하에서는 인공지능 모델을 이용하여 차량의 종류에 대한 정보를 획득하는 방법을 설명하나 이에 한정되지 않 으며, 이미지를 분류하는 다양한 알고리즘이 사용될 수 있다. 제어부는 추출 모델 및 분류 모델을 포함하는 인공지능 모델을 이용하여 차량의 종류에 대한 정보를 획득 할 수 있다. 여기서 추출 모델은 번호판의 이미지로부터 특징 벡터를 추출하기 위해 트레이닝된 인공 신경망, 예를 들어 CNN(Convolutional Neural Network)으로 구성될 수 있다. 또한 분류 모델은 번호판의 이미지로부터 추출된 특징 벡터를 이용하여 차량의 종류를 분류하도록 트레이닝된 인공 신경망일 수 있으며, 인공 신경망은 이미 공지된 지도 학습 알고리즘에 기반하여 트레이닝 될 수 있다. 이 하에서는, 분류 모델이 분류해야할 차량의 종류가 친환경 차량(전기차, 수소차 등) 및 일반 차량(친환경 차량이 아닌 차량)인 것으로 설명하나 이에 한정되지 않으며, 분류 모델은 다양한 차량의 종류를 판별할 수 있다. 도 1을 다시 참고하면, 친환경 차량의 번호판은 번호판이 장착된 차량이 친환경 차량임을 나타내는 오브 젝트(1110, 1120, 1130)가 포함되어 있다. 또한 친환경 차량의 번호판은 친환경 차량의 번호판에 할당되는 고유의 색상을 포함할 수 있다. 따라서 제어부가 변환된 색상 값이 적용된 번호판의 이미지를 인 공지능 모델에 제공하면, 인공지능 모델은 번호판의 변환된 색상 값 및 번호판 내 패턴(오브젝트(1110, 1120, 1130)의 형상, 크기, 위치, 배열 등 다양한 요소)를 이용하여, 두 클래스(친환경 차량 및 일반 차량)에 각각 상 응하는 두 개의 확률 값을 출력할 수 있다. 그리고 제어부는 두 개의 확률 값에 기초하여, 차량을 친환경 차량 또는 일반 차량으로 분류할 수 있다. 한편 차량 이미지에 포함된 번호판의 색상은 빛의 반사각에 따라 분균형하게 분포되는 문제가 발생할 수도 있다. 그리고 이러한 문제를 해결하기 위해, 제어부는 변환된 색상 값이 적용된 번호판의 대표 색상 값을 산출할 수 있다. 예를 들어 제어부는 변환된 색상 값이 적용된 번호판 내 픽셀들의 색상 값들을 평균하여 대표 색상 값을 산출할 수 있다. 그리고 제어부는 대표 색상 값을 번호판에 적용한 후 인공지능 모델에 제 공할 수 있다. 또한 도 1을 다시 참고하면, 제어부는 친환경 차량의 번호판의 일부 영역(1190, 1195)을 남기고, 일 부 영역(1190, 1195)을 제외한 나머지 영역을 블랭크 처리(예를 들어 검정색 영상으로 대체하거나 제거)한 후 인공지능 모델에 제공할 수도 있다. 여기서 일부 영역(1190, 1195)은 번호판의 좌우 양 끝단 영역일 수 있다. 즉 친환경 차량의 번호판에는, 좌우 양 끝단 영역에 오브젝트(1110, 1120, 1130)가 배치되며, 블 랭크 처리한 영역까지 인공지능 모델에 제공되는 경우 블랭크 처리한 영역 내 색상/문자/숫자 등으로 인하여 정 확도가 낮아질 수 있다. 따라서 제어부는 차량 이미지 내 번호판의 일부 영역(1190, 1195)을 인공지능 모델에 제공할 수 있으며, 이 경우 인공지능 모델은 일부 영역(1190, 1195) 내 패턴 및 색상을 이용하여 차 량을 분류할 수 있다. 다음으로, 번호판에 대한 그림자 보정을 수행한 후 차량의 종류를 결정하는 방법에 대하여 도 9를 참고하여 설 명한다. 도 9는 본 발명에 따른, 그림자 보정을 수행하는 방법을 설명하기 위한 도면이다. 도 9a를 참고하면, 하이패스 톨게이트에 설치되는 조형물 등에 의해, 번호판에는 그림자가 드리울 수 있다. 그리고 번호판의 색상을 이용하여 차량을 분류하는 본 발명의 특성상, 번호판에 그림자가 드리우는 경우 번호판 인식의 정확도가 낮아질 수 있다. 다만 태양의 위치에 따라, 번호판에 그림자가 생성되는 경우도, 번호판에 그림자가 생성되지 않는 경우도 발생할 수 있다. 따라서 제어부는 그림자 생성 장치를 이용 하여 그림자 보정의 수행 여부를 결정할 수 있다. 도 9c를 참고하면, 그림자 생성 장치는 차선으로부터 돌출되어 설치되며, 이에 따라 차선에 그림자를 드리 울 수 있다. 그리고 제어부는 차선 이미지에 포함되는 그림자 영역의 영역 정보에 기초하여 번호판에 그림자가 생기는지 여부를 결정할 수 있다. 도 9b에서 도시한 바와 같이, 차선 이미지에 포함되는 그림자 영역의 영역 정보는 그림자가 생기는 방향 정보를 포함할 수 있으나 이에 한정되지 않으며, 그림자 영역의 형상, 크기, 범위 등 다양한 요소를 더 포 함할 수 있다. 한편 차량의 번호판에 드리우는 그림자와, 그림자 생성 장치에 의해 차선에 드리우는 그림자는 모두 태양 에 의해 발생한다. 따라서 그림자 생성 장치에 의해 차선에 드리우는 그림자와 차량의 번호판에 드리우는 그림자는 같은 옵티컬 플로우(Optical Flow)를 나타낼 수 있다. 따라서 제어부는 차선 이미지에 포함되는 그림자 영역의 영역 정보를 이용하여, 번호판에 그림자가 생기는지 여부를 판단할 수 있다. 구체적으로 메모리에는 그림자가 차량의 번호판에 드리울 때의 그림자 영역의 영역 정보 및 그 림자가 차량의 번호판에 드리우지 않을 때의 그림자 영역의 영역 정보를 포함할 수 있다. 그리고 차 선 이미지에 포함되는 그림자 영역의 영역 정보가, 그림자가 차량의 번호판에 드리울 때의 그림자 영 역의 영역 정보에 상응하면, 제어부는 차량의 번호판에 그림자가 생기는 것으로 결정할 수 있다. 또한 번 호판에 그림자가 생기는 것으로 결정되는 경우, 제어부는 그림자 보정을 수행하는 것으로 결정할 수 있다. 그림자 보정이란 번호판에 그림자가 생기지 않은 것과 같이 보정하는 것을 의미하며, 그림자 보정은, 기준 차선 이미지와 현재 차선 이미지의 색상 차를 나타내는 시프트 값을 이용하는 간접적 방식과, 차량 이미지에서 그림 자를 제거하는 직접적 방식 중 어느 하나의 방식으로 수행될 수 있다. 먼저 시프트 값을 이용하는 간접적 방식을 설명한다. 그림자 보정을 수행하는 것으로 결정되면, 제어부는 그림자 영역 내 차선 이미지의 색상 값 및 기준 차선 이미지의 색상 값을 이용하여 시프트 값을 산출할 수 있다. 구체적으로, 그림자 영역 내 차선 이미지의 색상 값은, 단순히 시간이나 날씨 등에 의한 차선의 색상 뿐만 아니라, 그림자에 의해 어두워진 차선의 색상까지 반영한다. 따라서 그림자 영역 내 차선 이미지의 색상 값 및 기준 차선 이미지의 색상 값을 차분하는 경우, 그림자에 의한 색상의 변화까지 반영된 시프트 값이 산출 된다. 따라서 제어부는 그림자 영역 내 차선 이미지의 색상 값 및 기준 차선 이미지의 색상 값을 차분하여 시프트 값을 산출하고, 산출된 시프트 값을 이용하여 번호판의 색상 값을 변환할 수 있다. 즉 산출된 시프트 값 을 이용하여 번호판의 색상 값을 변환함으로써, 번호판에 드리운 그림자는 번호판에서 간접적으로 제거될 수 있다. 반대로, 차선 이미지에 포함되는 그림자 영역의 영역 정보가, 그림자가 차량의 번호판에 드리우지 않 을 때의 그림자 영역의 영역 정보에 상응하면, 제어부는 차량의 번호판에 그림자가 생기지 않는 것으 로 결정하고, 그림자 보정을 수행하지 않는 것으로 결정할 수 있다. 이 경우 제어부는 비 그림자 영역 내 차선 이미지의 색상 값 및 기준 차선 이미지의 색상 값을 이용하여 시프트 값을 산출할 수 있다. 여기서 비 그림자 영역이란, 차선 이미지 상에서 그림자 영역의 밖에 위치하 는 영역 또는 그림자 영역으로부터 그림자가 제거된 영역을 의미할 수 있다.다음으로, 차량 이미지에서 그림자를 제거하는 직접적 방식을 설명한다. 그림자 보정을 수행하는 것으로 결정되면, 제어부는 도로를 주행하는 차량의 번호판을 포함하는 차량 이미 지로부터 그림자를 제거할 수 있다. 차량 이미지로부터 그림자를 제거하는 하나의 방식으로, 제어부는 이미지에서 그림자를 추출하 도록 트레이닝된 인공지능 모델에 차량 이미지를 제공할 수 있다. 이 경우 인공지능 모델은 차량 이미지 내 픽셀들의 색상 값을 색 공간에서 클러스터링 하여 그림자를 추출할 수 있다. 그리고 인공지능 모델이 그림자를 추출하면, 제어부는 차량 이미지로부터 추출된 그림자를 제거할 수 있다. 일 예로, 제어부 또는 트레이닝 장치는 의미론적 레이블(semantic label)을 이용하여 인공신경망을 트레이 닝할 수 있다. 의미론적 레이블(semantic label)이란, 영상 내 오브젝트(예를 들어 그림자)를 클래스에 따라 다 른 색상으로 나타낼 수 있도록, 클래스 별로 고유한 색상으로 레이블링 되는 것을 의미할 수 있다. 차량 이미지로부터 그림자를 제거하는 또 하나의 방식으로, 제어부는 차량 이미지를 생성 적 적대 신경망(GAN)을 포함하는 인공지능 모델에 제공함으로써, 그림자가 제거된 차량 이미지를 획득할 수 있 다. 이 경우 생성적 적대 신경망(GAN)은 그림자가 존재하는 이미지를 이용하여 그림자가 제거된 이미지를 생성 하도록 미리 트레이닝될 수 있다. 다만 이에 한정되지 않으며, 이미지로부터 그림자를 검출 및 제거하는 공지된 다양한 알고리즘들이 사용될 수 있다. 한편 그림자가 제거된 차량 이미지가 획득되면, 제어부는 기준 차선 이미지와 현재 차선 이미지의 색상 차 를 나타내는 시프트 값을 이용하여, 그림자가 제거된 상태에서의 번호판의 색상 값을 변환할 수 있다. 그리고 제어부는 변환된 색상 값을 이용하여 차량의 종류에 대한 정보를 획득할 수 있다. 도 10은 본 발명에 따른 차량의 번호판 인식 방법의 세부적인 동작을 설명하기 위한 순서도이다. 이미지 획득부는 도로를 주행하는 차량의 번호판을 포함하는 차량 이미지를 획득할 수 있다(S1005). 이 경 우 이미지 획득부는 도로를 주행하는 차량을 복수회 촬영하여 복수의 차량 이미지를 획득할 수 있다. 제어부는 차량 이미지로부터 번호판을 검출할 수 있다(S1010). 구체적으로 제어부는 이미지에서 특정 오브젝트를 검출하는 공지된 탐지 모델을 이용하여, 차량 이미지로부터 번호판을 검출할 수 있다. 다음으로, 제어부는 차량 이미지가 번호판을 포함하고, 번호판이 기준에 만족하는지, 즉 번호판을 식별 가 능한지 판단할 수 있다(S1015). 차량 이미지가 번호판을 포함하지 않거나 번호판이 기준에 만족하지 않는 경우, 제어부는 다른 차량 이미지로부터 번호판을 다시 검출할 수 있다(S1010). 반면에 차량 이미지가 번호판을 포함하고 번호판이 기준에 만족하는 경우, 제어부는 현재 차선 이미지와 기준 차선 이미지를 비교할 수 있다(S1020). 이 경우 제어부는 차선 이미지에 포함되는 그림자 영역이 임 계치 이상인지 판단할 수 있다(S1025). 구체적으로 제어부는, 차선 이미지에 포함되는 그림자 영역의 영역 정보가, 그림자가 차량의 번호판에 드 리울 때의 그림자 영역의 영역 정보에 상응하지 않으면, 차선 이미지에 포함되는 그림자 영역이 임계치 미만인 것으로 판단하고, 그림자 보정을 수행하지 않을 수 있다. 반면에 제어부는, 차선 이미지에 포함되는 그림자 영역의 영역 정보가, 그림자가 차량의 번호판에 드리울 때의 그림자 영역의 영역 정보에 상응하면, 차선 이미지에 포함되는 그림자 영역이 임계치 이상인 것으로 판단 하고, 그림자 보정을 수행할 수 있다. 이 경우 제어부는 차량 이미지로부터 그림자 영역을 추출하고 (S1030), 생성적 적대 신경망(GAN) 등 공지된 알고리즘을 이용하여 차량 이미지로부터 그림자를 제거할 수 있다 (S1035). 다음으로, 제어부는 현재 차선 이미지와 기준 차선 이미지를 비교하고, 차선의 훼손 정도를 판단할 수 있 다(S1040). 이 경우 제어부는, 현재 차선 이미지의 형상과 기준 차선 이미지의 형상을 비교하고, 형상이 동일한 정도를 이용하여 차선의 훼손 정도를 판단할 수 있다. 즉 차선의 훼손 정도를 판단할 때에는, 현재 차선 이미지의 색상과 기준 차선 이미지의 색상은 고려하지 않는다. 제어부는 차선의 훼손 정도가 임계치 이상인지 판단하고(S1045), 차선의 훼손 정도가 임계치 미만이면 차 선 복원을 수행하지 않을 수 있다. 반면에 차선의 훼손 정도가 임계치 이상이면, 제어부는 현재 차선 이미 지를 이용하여 차선 내 훼손 영역이 복원된 복원 차선 이미지를 생성할 수 있다(S1050).다음으로, 제어부는 복원 차선 이미지(차선 복원을 수행하지 않은 경우에는, 현재 차선 이미지)와 기준 차 선 이미지를 비교하고, 기준 차선 이미지와 복원 차선 이미지의 색상 차를 나타내는 시프트 값을 산출할 수 있 다(S1055). 또한 제어부는 시프트 값을 이용하여 차량 이미지 내 번호판에 대한 화이트 밸런싱을 수행할 수 있다 (S1060). 구체적으로 제어부는 시프트 값을 이용하여 번호판의 색상 값을 변환할 수 있다. 다음으로 제어부는 차량 이미지 내 번호판으로부터 패턴을 추출하고(S1065). 추출된 패턴 및 번호판의 변 환된 색상 값을 융합할 수 있다. 예를 들어 제어부는 번호판의 패턴을 나타내는 특징 벡터 및 번호판의 변 환된 색상 값을 나타내는 특징 벡터를 분류 모델에 입력 데이터로써 제공할 수 있다. 또한 제어부는 번호 판의 변환된 색상 값이 적용된 번호판의 대표 색상 값을 산출하고, 산출된 대표 색상 값을 분류 모델에 제공할 수도 있다. 다음으로, 분류 모델은 번호판의 패턴을 나타내는 특징 벡터 및 번호판의 변환된 색상 값을 나타내는 특징 벡터 를 이용하여, 해당 번호판을 장착한 차량을 친환경 차량 또는 일반 차량으로 분류할 수 있다(S1075). 이와 같이 본 발명에 따르면, 번호판의 패턴 뿐만 아니라 번호판의 색상을 이용하여 차량을 분류함으로써, 차량 종류 판별의 정확도, 특히 고유한 색상의 번호판을 가지는 친환경 차량 판별의 정확도를 향상시킬 수 있는 장점 이 있다. 번호판의 색상을 이용하여 차량의 종류를 판별하는 기술에 있어서는, 번호판의 색상이 차량의 종류 판별에 매우 중요한 역할을 하기 때문에, 촬영된 영상 내 번호판의 색상으로부터 번호판의 진짜 색상을 정확히 유추해 내는 것이 매우 중요하다. 그리고 본 발명에 따르면, 기준 차선 이미지를 이용하여 화이트 밸런싱을 위한 기준점을 명확히 제공함으로써, 차량 종류 판별의 정확도를 향상시킬 수 있는 장점이 있다. 또한 본 발명에 따르면, 화이트 밸런싱을 위한 기준점으로 차선을 사용한다. 즉, 차선은 도로 상에서 차량의 주 행 경로의 좌우에 배치되기 때문에 차량과 매우 근접하여 위치하는 점(즉 기준점의 환경과 차량의 환경이 동일 한 점), 차선은 색상 차를 판별하여 화이트 밸런싱을 적용하는데 매우 유리한 색상(흰색)을 가지는 점, 차선은 보통 차량을 촬영할 때 함께 촬영되기 때문에 구현이 간단하다는 점에서, 이점을 제공할 수 있다. 또한 본 발명에 따르면, 현재 차선 이미지의 훼손 영역을 복원한 후 기준 차선 이미지와 비교하여 시프트 값을 산출하기 때문에, 시프트 값 산출의 정확도를 향상시킬 수 있는 장점이 있다. 또한 본 발명에 따르면, 차선에 그림자 생성 장치를 설치하고 그림자 생성 장치에 의해 생성된 그림자를 이용하 여 그림자 보정의 수행 여부를 결정함으로써, 번호판에 그림자가 생기는지를 정확히 판단한 후 그림자를 제거할 수 있는 장점이 있다. 전술한 본 발명은, 프로그램이 기록된 매체에 컴퓨터가 읽을 수 있는 코드로서 구현하는 것이 가능하다. 컴퓨터 가 읽을 수 있는 매체는, 컴퓨터 시스템에 의하여 읽혀질 수 있는 데이터가 저장되는 모든 종류의 기록장치를 포함한다. 컴퓨터가 읽을 수 있는 매체의 예로는, HDD(Hard Disk Drive), SSD(Solid State Disk), SDD(Silicon Disk Drive), ROM, RAM, CD-ROM, 자기 테이프, 플로피 디스크, 광 데이터 저장 장치 등이 있다. 또한, 상기 컴 퓨터는 단말기의 제어부를 포함할 수도 있다. 따라서, 상기의 상세한 설명은 모든 면에서 제한적으로 해석 되어서는 아니 되고 예시적인 것으로 고려되어야 한다. 본 발명의 범위는 첨부된 청구항의 합리적 해석에 의해 결정되어야 하고, 본 발명의 등가적 범위 내에서의 모든 변경은 본 발명의 범위에 포함된다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10"}
{"patent_id": "10-2022-0069314", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본원 명세서에서 해결하려는 문제점을 설명하기 위한 도면이다. 도 2는 본 발명에 따른, 번호판 인식 시스템의 적용 예를 도시한 도면이다. 도 3은 본 발명에 따른 번호판 인식 시스템을 설명하기 위한 도면이다. 도 4는 본 발명에 따른, 차량의 번호판 인식 장치의 구성요소를 설명하기 위한 블록도이다. 도 5는 본 발명에 따른, 차량의 번호판 인식 방법을 설명하기 위한 순서도이다. 도 6은 기준 차선 이미지 및 현재 차선 이미지를 설명하기 위한 도면이다. 도 7은 본 발명에 따른, 복원 차선 이미지를 생성하는 방법을 설명하기 위한 도면이다. 도 8은 본 발명에 따른, 시프트 값을 이용하여 번호판의 색상을 변환하는 방법을 설명하기 위한 도면이다. 도 9는 본 발명에 따른, 그림자 보정을 수행하는 방법을 설명하기 위한 도면이다. 도 10은 본 발명에 따른 차량의 번호판 인식 방법의 세부적인 동작을 설명하기 위한 순서도이다."}
