{"patent_id": "10-2021-0083968", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0027012", "출원번호": "10-2021-0083968", "발명의 명칭": "디스플레이 장치의 화질을 조정하는 전자 장치 및 이의 동작 방법", "출원인": "삼성전자주식회사", "발명자": "박재성"}}
{"patent_id": "10-2021-0083968", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,통신 회로;카메라; 및적어도 하나의 프로세서를 포함하고, 상기 프로세서는,상기 통신 회로를 통해 연결된 디스플레이 장치의 영상을 보상하기 위한 보상 어플리케이션의 실행을 기반으로,디스플레이 장치의 일부 영역을 촬영할 수 있는 촬영 조건을 만족하도록 전자 장치의 이동을 요청하는 가이드정보를 출력하고,상기 디스플레이 장치의 영상에 대한 보상이 완료되면, 보상 전의 상기 디스플레이 장치의 영상과 보상 후의 상기 디스플레이 장치의 영상을 출력하도록 설정된 전자 장치."}
{"patent_id": "10-2021-0083968", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서, 상기 프로세서는,상기 보상 어플리케이션의 실행을 결정하면, 상기 디스플레이 장치의 영상 보상을 위한 복수의 영상 보상 모드를 출력하고,상기 복수의 영상 보상 모드 중 영상 보상 모드의 선택을 확인하면, 디스플레이 장치의 일부 영역을 촬영할 수있는 촬영 조건을 만족하도록 전자 장치의 이동을 요청하는 상기 가이드 정보를 출력하도록 설정된 전자 장치."}
{"patent_id": "10-2021-0083968", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서, 상기 프로세서는,상기 복수의 영상 보상 모드 중 제1 영상 보상 모드에서 상기 촬영 조건을 만족하면, 제1 영상 시간 동안 제1영상 보상 방법으로 상기 디스플레이 장치에 대한 영상 보상 동작을 수행하는 과정을 상기 디스플레이를 통해표시하고,상기 복수의 영상 보상 모드 중 제2 영상 보상 모드에서 상기 촬영 조건을 만족하면, 제2 영상 시간 동안 제2영상 보상 방법으로 상기 디스플레이 장치에 대한 영상 보상 동작을 수행하는 과정을 상기 디스플레이를 통해표시하고,상기 복수의 영상 보상 모드 중 제3 영상 보상 모드에서 상기 촬영 조건을 만족하면, 제3 영상 시간 동안 제3영상 보상 방법으로 상기 디스플레이 장치에 대한 영상 보상 동작을 수행하는 과정을 상기 디스플레이를 통해표시하도록 설정된 전자 장치."}
{"patent_id": "10-2021-0083968", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3 항에 있어서, 상기 제1 영상 보상 시간, 상기 제2 영상 보상 시간, 및 상기 제3 영상 보상 시간은 서로 상이한 시간을 포함하는 전자 장치.공개특허 10-2022-0027012-3-청구항 5 제3 항에 있어서, 상기 제1 영상 보상 방법, 상기 제2 영상 보상 방법, 및 상기 제3 영상 보상 방법 각각은, 디스플레이 장치의영상 보상을 위한 적어도 하나의 화질 조정 항목을 포함하는 전자 장치,"}
{"patent_id": "10-2021-0083968", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5 항에 있어서, 상기 적어도 하나의 화질 조정 항목은, 종류 및 개수가 서로 상이하거나 또는 일부 동일하게 상기 제1 영상 보상 방법, 상기 제2 영상 보상 방법, 및 상기 제3 영상 보상 방법 각각에 포함된 전자 장치."}
{"patent_id": "10-2021-0083968", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제3 항에 있어서, 상기 프로세서는, 상기 제1 영상 보상 모드에서 상기 촬영 조건을 만족하면, 카메라를 이용하여 상기 디스플레이 장치의 일부 영역을 포함하는 영상을 획득하고,상기 획득한 영상을 기반으로 상기 디스플레이 장치에 대한 영상 보상 동작을 수행하는 과정을 상기 디스플레이를 통해 표시하고,상기 디스플레이 장치의 일부 영역은, 상기 제1 영상 보상 방법에 포함된 화질 조절 항목에 대응되는 화질 특정패턴을 출력하도록 설정된 전자 장치."}
{"patent_id": "10-2021-0083968", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제3 항에 있어서, 상기 프로세서는, 상기 제2 영상 보상 모드에서 상기 촬영 조건을 만족하면, 카메라를 이용하여 상기 디스플레이 장치의 일부 영역을 포함하는 영상을 획득하고,상기 획득한 영상을 기반으로 상기 디스플레이 장치에 대한 영상 보상 동작을 수행하는 과정을 상기 디스플레이를 통해 표시하고,상기 디스플레이 장치의 일부 영역은, 상기 제2 영상 보상 방법에 포함된 화질 조절 항목에 대응되는 화질 특정패턴을 출력하도록 설정된 전자 장치."}
{"patent_id": "10-2021-0083968", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제3 항에 있어서, 상기 프로세서는, 상기 제3 영상 보상 모드에서 상기 촬영 조건을 만족하면, 카메라를 이용하여 상기 디스플레이 장치의 일부 영역을 포함하는 영상을 획득하고,상기 획득한 영상을 기반으로 상기 디스플레이 장치에 대한 영상 보상 동작을 수행하는 과정을 상기 디스플레이를 통해 표시하고,상기 디스플레이 장치의 일부 영역은, 상기 제3 영상 보상 방법에 포함된 화질 조절 항목에 대응되는 화질 특정패턴을 출력하도록 설정된 전자 장치."}
{"patent_id": "10-2021-0083968", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "공개특허 10-2022-0027012-4-제1 항에 있어서, 상기 디스플레이 장치의 일부 영역은, 상기 디스플레이 장치의 영상 보상을 위한 특정 지점을 포함하는 전자 장치."}
{"patent_id": "10-2021-0083968", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "카메라를 포함하는 전자 장치의 동작 방법에 있어서,전자 장치의 통신 회로를 통해 연결된 디스플레이 장치의 영상을 보상하기 위한 보상 어플리케이션의 실행을 기반으로, 디스플레이 장치의 일부 영역을 촬영할 수 있는 촬영 조건을 만족하도록 전자 장치의 이동을 요청하는가이드 정보를 출력하는 동작; 및 상기 디스플레이 장치의 영상에 대한 보상이 완료되면, 보상 전의 상기 디스플레이 장치의 영상과 보상 후의 상기 디스플레이 장치의 영상을 출력하는 동작을 포함하는 방법."}
{"patent_id": "10-2021-0083968", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11 항에 있어서, 상기 가이드 정보를 출력하는 동작은,상기 보상 어플리케이션의 실행을 결정하면, 상기 디스플레이 장치의 영상 보상을 위한 복수의 영상 보상 모드를 출력하는 동작; 및 상기 복수의 영상 보상 모드 중 영상 보상 모드의 선택을 확인하면, 디스플레이 장치의 일부 영역을 촬영할 수있는 촬영 조건을 만족하도록 전자 장치의 이동을 요청하는 상기 가이드 정보를 출력하는 동작을 포함하는방법."}
{"patent_id": "10-2021-0083968", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12 항에 있어서, 상기 복수의 영상 보상 모드 중 제1 영상 보상 모드에서 상기 촬영 조건을 만족하면, 제1 영상 시간 동안 제1영상 보상 방법으로 상기 디스플레이 장치에 대한 영상 보상 동작을 수행하는 과정을 상기 디스플레이를 통해표시하는 동작;상기 복수의 영상 보상 모드 중 제2 영상 보상 모드에서 상기 촬영 조건을 만족하면, 제2 영상 시간 동안 제2영상 보상 방법으로 상기 디스플레이 장치에 대한 영상 보상 동작을 수행하는 과정을 상기 디스플레이를 통해표시하는 동작; 및 상기 복수의 영상 보상 모드 중 제3 영상 보상 모드에서 상기 촬영 조건을 만족하면, 제3 영상 시간 동안 제3영상 보상 방법으로 상기 디스플레이 장치에 대한 영상 보상 동작을 수행하는 과정을 상기 디스플레이를 통해표시하는 동작을 더 포함하는 방법."}
{"patent_id": "10-2021-0083968", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13 항에 있어서, 상기 제1 영상 보상 시간, 상기 제2 영상 보상 시간, 및 상기 제3 영상 보상 시간은 서로 상이한 시간을 포함하는 방법."}
{"patent_id": "10-2021-0083968", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제13 항에 있어서, 상기 제1 영상 보상 방법, 상기 제2 영상 보상 방법, 및 상기 제3 영상 보상 방법 각각은, 디스플레이 장치의공개특허 10-2022-0027012-5-영상 보상을 위한 적어도 하나의 화질 조정 항목을 포함하는 방법."}
{"patent_id": "10-2021-0083968", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15 항에 있어서, 상기 적어도 하나의 화질 조정 항목은, 종류 및 개수가 서로 상이하거나 또는 일부 동일하게 상기 제1 영상 보상 방법, 상기 제2 영상 보상 방법, 및 상기 제3 영상 보상 방법 각각에 포함된 방법."}
{"patent_id": "10-2021-0083968", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제13 항에 있어서, 상기 제1 영상 보상 모드에서 상기 촬영 조건을 만족하면, 카메라를 이용하여 상기 디스플레이 장치의 일부 영역을 포함하는 영상을 획득하는 동작; 및 상기 획득한 영상을 기반으로 상기 디스플레이 장치에 대한 영상 보상 동작을 수행하는 과정을 상기 디스플레이를 통해 표시하는 동작을 더 포함하고,상기 디스플레이 장치의 일부 영역은, 상기 제1 영상 보상 방법에 포함된 화질 조절 항목에 대응되는 화질 특정패턴을 출력하는 방법."}
{"patent_id": "10-2021-0083968", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제13 항에 있어서, 상기 제2 영상 보상 모드에서 상기 촬영 조건을 만족하면, 카메라를 이용하여 상기 디스플레이 장치의 일부 영역을 포함하는 영상을 획득하는 동작; 및 상기 획득한 영상을 기반으로 상기 디스플레이 장치에 대한 영상 보상 동작을 수행하는 과정을 상기 디스플레이를 통해 표시하는 동작을 더 포함하고,상기 디스플레이 장치의 일부 영역은, 상기 제2 영상 보상 방법에 포함된 화질 조절 항목에 대응되는 화질 특정패턴을 출력하는 방법."}
{"patent_id": "10-2021-0083968", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제13 항에 있어서,상기 제3 영상 보상 모드에서 상기 촬영 조건을 만족하면, 카메라를 이용하여 상기 디스플레이 장치의 일부 영역을 포함하는 영상을 획득하는 동작; 및 상기 획득한 영상을 기반으로 상기 디스플레이 장치에 대한 영상 보상 동작을 수행하는 과정을 상기 디스플레이를 통해 표시하는 동작을 포함하고,상기 디스플레이 장치의 일부 영역은, 상기 제3 영상 보상 방법에 포함된 화질 조절 항목에 대응되는 화질 특정패턴을 출력하는 방법."}
{"patent_id": "10-2021-0083968", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제11 항에 있어서, 상기 디스플레이 장치의 일부 영역은 상기 디스플레이 장치의 영상 보상을 위한 특정 지점을 포함하는 방법. 공개특허 10-2022-0027012-6-"}
{"patent_id": "10-2021-0083968", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "전자 장치는, 통신 회로, 카메라, 적어도 하나의 프로세서를 포함하고, 상기 프로세서는, 상기 통신 회로를 통해 연결된 디스플레이 장치의 영상을 보상하기 위한 보상 어플리케이션의 실행을 기반으로, 디스플레이 장치의 일부 영역을 촬영할 수 있는 촬영 조건을 만족하도록 전자 장치의 이동을 요청하는 가이드 정보를 출력하고, 상기 디 스플레이 장치의 영상에 대한 보상이 완료되면, 보상 전의 상기 디스플레이 장치의 영상과 보상 후의 상기 디스 플레이 장치의 영상을 출력하도록 설정될 수 있다."}
{"patent_id": "10-2021-0083968", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "디스플레이 장치의 화질을 조정하는 전자 장치 및 그 동작 방법에 관한 것이다."}
{"patent_id": "10-2021-0083968", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "디스플레이 장치의 화질을 조정하기 위하여, 영상 기반 전문 계측 장비를 포함하는 전문 장비들을 이용할 수 있 다. 그러나, 이러한 장비들은 고가이고, 사용자가 구비하여 사용하기가 어렵다는 문제점이 있다. 이러한 문제를 해결하기 위하여, 전자 장치를 이용하여 디스플레이 장치의 화질을 조정하는 방법이 제안되었다. 구체적으로, 전자 장치가 디스플레이 장치의 화면을 촬영한 영상을, 고가의 계측기가 디스플레이 장치의 화면을 촬영한 영상으로 변환하는 방법을 이용하여, 전자 장치를 이용하여 디스플레의 장치의 화질을 조정할 수 있다. 또한 디스플레이 장치에서는 디스플레이의 제조업체에서 제공하는 고정된 화질 설정 정보만을 제공하고 있음으 로, 사용자 별 선호도와 관련 없이 사용자는 디스플레이의 제조업체에서 제공하는 고정된 화질 설정 정보로만 디스플레이 장치의 화질을 조정할 수 있다."}
{"patent_id": "10-2021-0083968", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "그러나, 전자 장치에 포함된 카메라마다 광을 인식하는 정도에 차이가 있고, 디스플레이 장치마다 발광 특성이 상이하다. 따라서, 미리 생성된 전자 장치가 디스플레이 장치의 화면을 촬영한 영상을, 고가의 계측기가 디스플 레이 장치의 화면을 촬영한 영상으로 변환하는 식을 이용하더라도, 전자 장치와 디스플레이 장치가 변경되면 정 확한 계측이 어려울 수 있다."}
{"patent_id": "10-2021-0083968", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "다양한 실시 예에 따라서, 전자 장치는, 통신 회로, 카메라, 및 적어도 하나의 프로세서를 포함하고, 상기 프로 세서는, 상기 통신 회로를 통해 연결된 디스플레이 장치의 영상을 보상하기 위한 보상 어플리케이션의 실행을 기반으로, 디스플레이 장치의 일부 영역을 촬영할 수 있는 촬영 조건을 만족하도록 전자 장치의 이동을 요청하 는 가이드 정보를 출력하고, 상기 디스플레이 장치의 영상에 대한 보상이 완료되면, 보상 전의 상기 디스플레이 장치의 영상과 보상 후의 상기 디스플레이 장치의 영상을 출력하도록 설정될 수 있다. 다양한 실시 예에 따라서, 카메라를 포함하는 전자 장치의 동작 방법은, 전자 장치의 통신 회로를 통해 연결된 디스플레이 장치의 영상을 보상하기 위한 보상 어플리케이션의 실행을 기반으로, 디스플레이 장치의 일부 영역 을 촬영할 수 있는 촬영 조건을 만족하도록 전자 장치의 이동을 요청하는 가이드 정보를 출력하는 동작, 및 상 기 디스플레이 장치의 영상에 대한 보상이 완료되면, 보상 전의 상기 디스플레이 장치의 영상과 보상 후의 상기 디스플레이 장치의 영상을 출력하는 동작을 포함할 수 있다."}
{"patent_id": "10-2021-0083968", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "실시예에 따른 전자 장치는, 전자 장치에 포함된 카메라의 응답 특성을 고려하여 디스플레이 장치에서 출력되는 영상을 보상함으로써, 보다 정확하게 디스플레이 장치의 화질을 조정할 수 있다. 실시예에 따른 디스플레이 장치는, 사용자의 시청 환경에 대응하는 최적의 화면 설정 정보를 자동으로 추천할 수 있다."}
{"patent_id": "10-2021-0083968", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 1, "content": "도 1은 다양한 실시예에 따라, 전자 장치 및 디스플레이 장치를 포함하는 시스템을 도시하는 도 면이다. 전자 장치는 휴대용 통신 장치(예: 스마트폰)일 수 있다. 전자 장치는 카메라를 포함하거나, 카메라 와 통신 연결이 가능한 전자 장치이면 제한이 없다. 디스플레이 장치는 화면을 표시하는 패널을 포함하는 전자 장치(예: 스마트TV)일 수 있다. 예를 들어, 디 스플레이 장치에 포함된 패널은 LCD(Liquid Crystal Display) 패널이거나 또는 LED(Light Emitting Diode), OLED(Organic Light Emitting Diode), CCFL(cold cathode fluorescent lamp) 등 다양한 발광체를 포함하는 패널 중 하나일 수 있다. 패널들은 디지털 TV, 3D-TV, 스마트 TV, LED TV, OLED TV, 플라즈마 TV 등으 로 구현될 수 있고, 평면(flat) 디스플레이 장치뿐만 아니라, 곡률을 가지는 화면인 곡면(curved) 디스플레이 장치 또는 곡률을 조정 가능한 가변형(flexible) 디스플레이 장치일 수 있다. 패널의 출력 해상도는 예를 들어, HD(High Definition), Full HD, Ultra HD, 8K Ultra HD 또는 8K Ultra HD 보다 더 선명한 해상도를 포함할 수 있다. 전자 장치와 디스플레이 장치는 제 1 통신망을 통하여 신호를 송수신할 수 있다. 디스플레이 장 치는 전자 장치로부터 디스플레이 장치를 제어하기 위한 신호를 수신하고, 수신된 신호에 기반 하여 디스플레이 장치의 화질을 조절할 수 있다. 한편, 실시예에 따라, 전자 장치와 디스플레이 장치 는, 디스플레이 장치와 유선 또는 무선 통신 연결된 별도의 디스플레이 제어 장치를 통해 신호를 송 수신할 수도 있다. 제 1 통신망은 통신 네트워크(telecommunications network)일 수 있다. 통신 네트워크는 컴퓨터 네트워크 (computer network), 인터넷(internet), 사물 인터넷(internet of things) 또는 전화망(telephone network) 중 적어도 하나를 포함할 수 있다. 제1 통신망는 블루투스 또는 와이파이, 블루투스 로우 에너지(Bluetooth Low Energy), 적외선 통신, 레이저 빔 통신과 같은 통신망 중 적어도 하나를 포함할 수 있다. 디스플레이 장치는 제 1 통신망을 통해 수신된 신호에 반하여, 광 정보를 출력할 수 있다. 디스플레 이 장치의 광 정보 중 조정되어야 할 항목에 따라 디스플레이 장치가 출력해야 할 화면이 달라질 수 있다. 예를 들어, 디스플레이 장치가 출력하는 광 정보 중 휘도를 측정하는 것이 용이하도록, 디스플레이 장치 가 white pattern을 출력할 수 있다. 또한, 디스플레이 장치가 출력하는 광 정보 중 색을 측정하는 것이 용이하도록, 디스플레이 장치가 R/G/B/Y/M/C 화면을 출력할 수 있다. 또한, 디스플레이 장치가 출력하는 광 정보 중 gamma를 측정하는 것이 용이하도록, 디스플레이 장치가 저계조부터 고계조, 즉 어두 운 black 부터 밝은 white 레벨까지 일정 간격, 혹은 특정 레벨 간격으로 순차적으로 바뀌는 패턴을 출력할 수 있다. 또한, 디스플레이 장치는 위 패턴들을 조합하여 출력할 수도 있다. 한편, 이러한 패턴들은 실시예일 뿐이며, 디스플레이 장치가 출력하는 화면은 여기서 언급하지 않은 다양한 형태의 패턴임은 당업자에게 자 명하다. 이하, 디스플레이 장치가 출력하는 화면을 화질 측정 패턴이라고 부르기로 한다. 전자 장치는 외부 전자 장치(예: 서버)로부터 디스플레이 장치에 대응하는 좌표 정보를 획득할 수 있다. 예를 들어, 디스플레이 장치에 대응하는 좌표 정보는 하나의 white 지점이거나, 또는 R/G/B/W 지점들에 대한 정 보를 나타낼 수 있다. 전자 장치는 디스플레이 장치가 출력하는 화질 측정 패턴을 촬영하여 영상을 획득할 수 있다. 실시 예에 따라, 전자 장치는 영상을 획득하기 전에, 영상이 촬영 조건을 만족하는지를 결정하고, 촬영 조 건을 만족하는 것에 상응하여 영상을 획득할 수 있다. 촬영 조건은, 영상이 카메라의 화면에 포함되는 기준으로 판단될 수 있다. 전자 장치는 전자 장치와 디스플레이 장치 사이의 거리, 및 각도 등을 고려하 여 영상이 촬영 조건을 충족시키는지를 판단할 수 있다. 또는, 전자 장치는 디스플레이 장치에 대응 하는 특정 지점을 포함하는지 판단할 수 있다. 예를 들어, 특정 지점은, 디스플레이 장치가 생산될 때, 보 상을 수행하기 측정된 지점일 수 있고, 하나의 white 지점이거나, 또는 R/G/B/W 지점들일 수도 있으며, 좌표 정 보에 기반하여 판단될 수 있는 것으로, 상기 특정 지점은 신호 레벨(예: 0 black ~ 255 Full white) 중 특정 신 호레벨을 나타낼 수 있다. 실시 예에 따라, 전자 장치는 영상을 획득하기 전에, 영상이 촬영 조건을 만족하는지를 결정하고, 촬영 조 건을 만족하지 않는 것에 상응하여 상기 촬영 조건을 만족하기 위한 가이드 정보를 출력할 수 있으며, 상기 가 이드 정보는, 영상이 카메라의 화면에 포함되도록 전자 장치의 이동을 요청하거나, 또는 디스플레이 장치와의 거리, 및 각도가 촬영 조건을 만족하도록 전자 장치의 이동을 요청할 수 있다. 실시 예에 따라, 전자 장치는 영상을 획득하기 전에, 영상이 촬영 조건을 만족하는지를 결정하고, 촬영 조 건을 만족하지 않는 것에 상응하여 만족되지 않는 촬영 조건이S/W를 이용하여 자동으로 조절할 수 있는 조건인 경우 자동으로 촬영 조건을 만족하도록 제어할 수 있다, 전자 장치는 획득한 영상에 기반하여 디스플레이 장치의 광 정보를 측정할 수 있다. 전자 장치 에 의해 획득된 영상은 RGB 영상일 수 있다. 전자 장치는 획득한 영상을 전자 장치의 특성(예를 들어, 전자 장치에 포함된 카메라의 특성에 따라 보상할 수 있다. 전자 장치는 외부 전자 장치(예: 서버)로부터 전자 장치 및 디스플레이 장치 에 대응하는 카메라 보상 정보를 획득할 수 있다. 전자 장치는 사용자로부터 디스플레이 장치의 식별 정보(예를 들어, 모델명)를 입력 받거나, 디스플레이 장치로부터 식별 정보를 수신할 수도 있다. 전 자 장치 및 디스플레이 장치에 대응하는 카메라의 보상 정보는, 전자 장치와 동일한 모델의 다 른 전자 장치인 제 1 전자 장치 및 디스플레이 장치와 동일한 모델의 다른 디스플레이 장치인 제 1 디스플레이 장치를 이용하여 계산된 보상 정보일 수 있다. 예를 들어, 보상 정보는, 제 1 전자 장치가 제 1 디스플레이 장 치의 영상을 촬영한 RGB 영상을, 계측기가 촬영한 제 1 디스플레이 장치의 영상을 촬영한 XYZ 영상으로 변환하 기 위한 보상 함수일 수 있다. 한편, 전자 장치가 외부 전자 장치로부터 디스플레이 장치에 대응하는 카메 라 보상 정보를 획득하는 것으로 설명하였으나, 전자 장치는 메모리에 미리 저장된 보상 정보를 이용하여, 카메라의 응답 특성을 보상할 수도 있다. 전자 장치의 모델이 동일하면, 전자 장치에 포함된 카메라의 모델도 동일할 수 있다. 그러나, 동일한 모델의 카메라들도, 카메라들 각각에 포함된 센서 및/또는 렌즈에 따라 광 정보를 인식하는 응답 특성이 다를 수 있다. 따라서, 카메라마다 디스플레이 장치에서 출력되는 광 정보를 다르게 인식할 수 있으므로, 카메 라의 응답 특성을 보상하는 과정이 필요할 수 있다. 카메라의 응답 특성은 색 특성, 휘도 특성, 감마 특성 및 분포 특성 중 적어도 일부를 포함할 수 있다. 전자 장치는 카메라 보상 정보에 기반하여, 카메라에 의해 획득되는 영상의 색 정보, 휘도 특성, 감마 특성, 분포 정보 중 적어도 일부를 보상할 수 있다. 예를 들어, 전자 장치는 디스플레이 장치로부터 출력된 광량의 세기를 카메라의 센서가 인식하는 정 도의 차이를 보상하기 위하여 휘도 보상을 수행할 수 있다. 이를 통해, 전자 장치는 광량과 센서 간의 linearity를 보상할 수 있다. 예를 들어, 전자 장치는 디스플레이 장치로부터 출력된 광량에 대해 센서가 red, green, blue 색을 인식하는 응답 특성을 보상하기 위해 색 보상을 수행할 수 있다. 즉, 전자 장치는 센서가 광량의 RGB 값을 인식하는 정도를 보상할 수 있다. 예컨대, 디스플레이 장치에서 출력되는 광량이 증가하면 센서의 RGB 값 도 동일하게 증가해야 하는데, 카메라에 포함된 센서 별로 RGB 값을 인식하는 정도가 달라질 수 있다. 따라서, 전자 장치는 카메라의 응답 특성을 고려하여 색 정보 보상을 수행할 수 있다. 전자 장치는 카메라의 비네팅(Vinetting) 현상 및/또는 디스플레이 장치의 시야각 특성으로 인한 카 메라 영상 내 밝기 분포 불균일도를 보상해주기 위해 분포 정보 보상을 수행할 수 있다. 비네팅 현상은 카메라 의 센서가 민감해지면서, 미세한 제조 공차에도 사진의 외곽이나 모서리가 어둡게 나오는 현상을 말한다. 비네 팅 현상은 또한 렌즈 자체가 비네팅을 갖기 때문에 발생할 수 있다. 렌즈를 통과한 빛은 원형의 상을 맺게 되는 데, 이 상을 맺는 렌즈의 이미지 서클(Image Circle)의 지름이 촬영 화면의 대각선 길이보다 짧아서 모서리 부 분에 상이 맺히지 않게 될 경우 이러한 비네팅 현상이 발생하게 된다. 전자 장치는 색 정보 보상, 휘도 특 성 보상, 감마 특성 보상, 분포 정보 보상과 같은 다양한 보상 과정을 통해 전자 장치에 포함된 일반 카메 라의 계측 성능을 보완할 수 있다. 전자 장치는 카메라 보상 정보에 기반하여, 촬영하여 획득한 RBG 영상을 보상함으로써, 휘도와 색좌표 (XYZ)로 표현된 보상된 영상을 획득할 수 있다. 이때, 카메라 보상 정보는, 제 1 전자 장치와 제 1 디스플레이 장치에 기반하여 계산된 보상 함수일 수 있다. 이러한 보상 정보에 기반하여 촬영한 RGB 영상을 보상하여 획득 한 XYZ 영상은, 제 1 전자 장치에서 획득한 영상을 보상하여 획득한 XYZ 영상과 오차가 발생할 수 있다. 따라서, 전자 장치는 촬영한 RGB 영상을 보상하여 획득한 XYZ 영상 및 카메라 보상 정보에 기반하여, 카메 라 보상 정보에 포함된 보상 함수를 수정할 수 있다. 전자 장치는 수정된 보상 함수를 이용하여, 촬영하여 획득한 RBG 영상을 재보상할 수 있다. 따라서, 사용자는 전자 장치를 이용하여 영상 기반 전문 계측 장비 의 성능에 준하는 계측 영상을 생성할 수 있게 된다. 도 2는 다양한 실시예에 따라, 전자 장치의 구성을 간략히 나타낸 블록도를 도시하는 도면이다. 도 2에 도시된 바와 같이, 전자 장치는 프로세서, 메모리, 통신 회로 및 카메라를 포함할 수 있다. 전자 장치는 사용자가 휴대할 수 있는 전자 기기로 다양한 전자 장치로 구현될 수 있다. 전자 장치는 사진을 촬영할 수 있고, 통신 기능이 구비된 전자 기기로, 예컨대, 스마트 폰(smart phone), 태블릿 PC(tablet personal computer), 이동 전화기(mobile phone), 화상전화기, 전자북 리더기(e-book reader), 랩탑 PC(laptop personal computer), 넷북 컴퓨터(netbook computer), PDA(personal digital assistant), PMP(portable multimedia player), MP3 플레이어, 웨어러블 장치(wearable device), 스마트 와치(smart watch), 통신 기능을수행할 수 있는 카메라 중 적어도 하나를 포함할 수 있다. 프로세서는 전자 장치의 전반적인 동작을 제어할 수 있다. 프로세서는, 예를 들면, 소프트웨어 (예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치의 적어도 하나의 다른 구성요소(예: 하드웨 어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이터 처리 또는 연산을 수행할 수 있다. 일실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세서는 다른 구성요소(예: 센서 모듈 또는 통신 회로)로부터 수신된 명령 또는 데이터를 휘발성 메모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터 를 처리하고, 결과 데이터를 비휘발성 메모리에 저장할 수 있다. 일실시예에 따르면, 프로세서는 메인 프 로세서 (예: 중앙 처리 장치 또는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센 서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세 서 및 보조 프로세서를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능 에 특화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있다. 프로세서는 카메라를 제어하여 디스플레이 장치의 적어도 일부 영역을 포함하는 영상을 획득할 수 있 다. 디스플레이 장치의 적어도 일부 영역은, 하나의 white 지점이거나, 또는 R/G/B/W 지점들을 포함하는 영역일 수 있다. 프로세서는 디스플레이 장치의 적어도 일부 영역을 포함하는 영상을 획득하기 전에, 촬영 조건이 만족되는 지 여부를 판단할 수 있다. 촬영 조건은, 전자 장치와 디스플레이 장치 사이의 거리 또는 각도를 고려하거 나, 디스플레이 장치에 대응하는 특정 지점을 포함하여 촬영되는지 여부일 수 있다. 예를 들어, 특정 지점은, 디스플레이 장치가 생산될 때, 보상을 수행하기 위해 측정된 지점일 수 있고, 하나의 white 지점이거나, 또는 R/G/B/W 지점들일 수도 있으며, 좌표 정보에 기반하여 판단될 수 있다. 프로세서는 제 1 보상 정보에 기반하여, 획득된 영상을 보상할 수 있다. 제 1 보상 정보는, 서버로부터 수 신하거나 미리 저장된 정보일 수 있다. 예를 들어, 제 1 보상 정보는 제 1 전자 장치와 제 1 디스플레이 장치를 이용하여 계산된 보상 함수일 수 있다. 구체적으로, 제 1 보상 정보는, 제 1 디스플레이 장치가 출력하는 영상 을 계측기에서 획득한 XYZ 영상에 기반하여, 제 1 전자 장치가 제 1 디스플레이 장치를 촬영한 RGB 영상을 상기 XYZ 영상으로 변환하기 위하여 계산된 보상 함수일 수 있다. 프로세서는 보상된 영상과 카메라의 응답 특성에 기반하여, 제 1 보상 정보를 수정하여 제 2 보상 정 보를 생성할 수 있다. 예를 들어, 제 1 보상 정보는, 제 1 전자 장치가 제 1 디스플레이 장치를 촬영한 RGB 영 상을 계측기의 XYZ 영상으로 변환하기 위한 보상 함수일 수 있다. 제 1 전자 장치에 포함된 카메라의 센서와 카 메라의 센서가 상이하고, 제 1 디스플레이 장치와 디스플레이 장치의 발광 특성이 상이할 수 있다. 따라서, 카메라를 통해 획득한 RGB 영상을, 제 1 보상 정보에 포함된 보상 함수를 이용하여 XYZ 영상으로 보상하더라도, 계측기의 XYZ 영상과 오차가 발생할 수 있다. 전자 장치는 오차를 없애기 위하여, 제 1 보 상 정보에 포함된 보상 함수를 수정하여 제 2 보상 정보를 생성할 수 있다. 즉, 제 2 보상 정보는, 전자 장치 에 포함된 카메라의 응답 특성과 해당 디스플레이 장치의 발광 특성에 기반하여 계산된 보상 함수일 수 있으므로, 전자 장치마다 상이할 수 있다. 프로세서는 제 2 보상 정보를 이용하여, 디스플레이 장치의 적어도 일부 영역에 대한 영상을 보상할 수 있 다. 제 2 보상 정보는, 전자 장치에 포함된 카메라의 응답 특성과 해당 디스플레이 장치의 발광 특성 에 기반하여 계산된 보상 함수일 수 있다. 따라서, 전자 장치에 포함된 카메라를 이용하여 계측 성능을 보 완할 수 있다. 프로세서는 디스플레이 장치로부터 디스플레이 장치가 출력하는 광 정보를 제어하는 제어 신호를 수신할 수 있다. 제어 신호는, 디스플레이 장치에서 출력되는 광 정보의 휘도, 색, 휘도 또는 색의 균일도, 계조, 감마, 색 공간에 대한 정보를 포함하는 신호일 수 있다. 프로세서는 제 2 보상 정보, 디스플레이 장치의 적어도 일부 영역을 포함하는 영상 및 제어 신호에 기반하 여, 제어 신호를 조정하기 위한 조정 신호를 생성할 수 있다. 프로세서는 디스플레이 장치에게 조정 신호 를 전송할 수 있다. 프로세서는 사용자에 의해 설정된, 기준 화질 값에 기반하여 측정된 화질 값을 기준 값으로 조정하기 위한 정보에 기반하여 조정 신호를 생성할 수 있다. 예를 들어, 프로세서는 제 2 보상 정 보에 기반하여 보상된 XYZ 영상에서 측정한 화질 값을 기준 값으로 바꾸기 위해, 현재의 광 정보가 어떤 값으로 변경되어야 할지를 계산하고, 디스플레이 장치가 변경되어야 할 광 정보를 출력하기 위해, 디스플레이 장치가어떤 값으로 출력을 제어해야 하는지 계산할 수 있다. 프로세서는 광 제어 신호가 얼만큼 변경되어야 하는 지를 나타내는 조정 신호를 생성할 수 있다. 예를 들어, 프로세서는 측정된 화질 값과 기준 값의 차이가 지정된 임계치를 벗어나는 경우에만 조정 신호를 생성할 수 있다. 프로세서는 조정 신호를 디스플레이 장치에게 전송할 수 있다. 프로세서는 전자 장치의 카메라 센서 정보와 제1 보상 정보의 카메라 센서 정보가 다름을 확인하면, 제1 계조 영역(예: 저계조)을 포함하는 영상을 보상하기 위한 제3 보상 정보를 생성하고, 제3 보상 정보를 이용 하여 디스플레이 장치의 적어도 일부 영역에 대한 영상을 보상할 수 있다. 프로세서는, 전자 장치의 카메라 센서 정보(예: 센서 종류 및/또는 센서 값등)와, 외부 서버로부터 수신한 제1 보상 정보의 카메라 센서 정보(예: 센서 종류 및/또는 센서 값등)의 비교를 기반으로, 전자 장치의 카메라 센서 정보와 상기 제1 보 상 정보의 카메라 센서 정보가 다름을 확인할 수 있다. 제1 보상 정보의 카메라 센서 정보는, 제1 보상 정보의 계산을 위해 이용된 전자 장치와 동일한 모델의 다른 전자 장치인 제 1 전자 장치의 카메라 센서 정보(예: 센서의 종류 및/또는 센서 값)를 나타낼 수 있다. 프로세서는 전자 장치의 카메라 렌즈 정보와 제1 보상 정보의 카메라 렌즈 정보가 상이할 때, 전자 장치의 카메라를 통해 획득한 계조 영역 중 어두운 색 레벨에 대응되는 제1 계조 영역(예: 저계조 영역)을 포함하는 영상이 제1 보상 정보로 보상되는 경우, 상기 보 상된 영상이 linearity한 제1 보상 정보와는 비례하지 않게 즉 정확하지 않게 출력될 수 있다. 프로세서는 전자 장치의 카메라 렌즈 정보와 제1 보상 정보의 카메라 렌즈 정보가 상이할 때, 제1 계조 영역(예: 저계조 영 역)을 포함하는 영상이 linearity 하게 출력될 수 있도록 특정 값을 가지는 제3 보상 정보를 생성할 수 있 다. 예를 들어, 프로세서는, 전자 장치의 카메라 센서 정보와 외부 서버로부터 수신한 제1 보상 정보의 카 메라 센서 정보를 기반으로 전자 장치의 센서 값과 제1 보상 정보의 센서 값을 일치시킬 수 있는 제3 보상 정보 를 계산하여 생성할 수 있다. 다른 예를 들어, 프로세서는, 전자 장치의 카메라 센서 정보와 외부 서버로 부터 수신한 제1 보상 정보의 카메라 센서 정보를 기반으로 미리 저장된 제3 보상 정보를 메모리에서 검출할 수 있다. 프로세서는 디스플레이 장치에 대응하는 좌표 정보에 기반하여 디스플레이 장치의 적어도 일부 영역 을 포함하는 RGB 영상이 제1 계조 영역(예: 저계조)을 포함하는 경우, 제3 보상 정보에 포함된 보상 함수를 이 용하여 XYZ 영상으로 변환함으로써, 획득된 영상을 보상할 수 있다. 프로세서는 전자 장치의 카메라 설정 정보와 제1 보상 정보의 카메라 설정 정보가 다름으로 확인하면, 제1 계조 영역(예:저계조)을 포함하는 영상을 보상하기 위한 제4 보상 정보를 생성하고, 제3 계조 영역(예:고계조) 을 포함하는 영상을 보상하기 위한 제5 보상 정보를 생성하고, 제4 보상 정보 또는 제5 보상 정보를 이용하여 디스플레이 장치의 적어도 일부 영역에 대한 영상을 보상할 수 있다. 프로세서는 외부 서버로부터 디스플레이 장치에 대응하는 좌표 정보, 제 1 보상 정보 및 제1 조정 정 보를 수신할 수 있다. 상기 제 1 보상 정보는, 전자 장치의 모델과 동일한 모델의 제 1 전자 장치가, 디스 플레이 장치의 모델과 동일한 모델의 제 1 디스플레이 장치를 촬영한 RGB 영상을, 계측기가 제 1 디스플레 이 장치를 촬영한 XYZ 영상으로 변환하기 위한 보상 함수일 수 있다. 상기 제1 보상 정보는, 계조 영역 중 중간 색 레벨에 대응되는 제2 계조 영역(예: 중계조 영역)을 포함하는 영상을 보상하기 위해 측정된 값을 나타낼 수 있다. 상기 제1 보상 정보는, 계조 영역 중 밝은 색 레벨에 대응되는 제3 계조 영역을 포함하는 영상을 보상하 기 위한 제5 보상 정보를 생성하기 위해 사용될 수 있다. 상기 제1 조정 정보는, 계조 영역 중 어두운 색 레벨 에 대응되는 제1 계조 영역(예: 저계조 영역)을 포함하는 영상을 보상하기 위한 제4 보상 정보를 생성하기 위해 사용될 수 있는 측정된 값을 나타낼 수 있다. 프로세서는, 전자 장치의 카메라 설정 정보(예: 카메라 의 노출 값, 센서 감도 값 및/또는 조리개 값등)와 외부 서버로부터 수신한 제1 보상 정보의 카메라 설정 정보 (예: 카메라의 노출 값, 센서 감도 값 및/또는 조리개 값등)의 비교를 기반으로, 전자 장치의 카메라 설정 정보와 제1 보상 정보의 카메라 설정 정보가 다름을 확인할 수 있다. 제1 보상 정보의 카메라 설정 정보는, 제1 보상 정보의 계산을 위해 이용된 전자 장치와 동일한 모델의 다른 전자 장치인 제 1 전자 장치의 카메라 설정 정보(예: 카메라의 노출 값, 센서 감도 값 및/또는 조리개 값등)를 나타낼 수 있다. 프로세서는, 전 자 장치의 카메라 설정 정보가 제1 계조 영역을 위한 제1 카메라 설정 정보이면 제1 조정 정보에 전자 장치에 설정된 카메라 노출 값을 곱하여 제4 보상 정보를 생성하고, 디스플레이 장치에 대응하는 좌표 정보에 기반하여 카메라를 통해 획득한 디스플레이 장치의 적어도 일부 영역을 포함하는 RGB 영상이 제1 계조 영역을 포함 하는 경우, 제4 보상 정보에 포함된 보상 함수를 이용하여 XYZ 영상으로 변환함으로써, 획득된 영상을 보상할 수 있다. 프로세서는, 전자 장치의 카메라 설정 정보가 제3 계조 영역을 위한 제1 카메라 설정 정보이면 제1 보상 정보에 전자 장치에 설정된 카메라 노출 값을 나누어 제5 보상 정보를 생성하고, 디스플레이 장치에 대응하는 좌표 정보에 기반하여 카메라를 통해 획득한 디스플레이 장치의 적어도 일부 영역을 포함하는 RGB 영상이 제3 계조 영역을 포함하는 경우, 제5 보상 정보에 포함된 보상 함수를 이용하여 XYZ 영상으로 변 환함으로써, 획득된 영상을 보상할 수 있다. 프로세서는 디스플레이장치의 변화에 따른 디스플레이 장치에 대한 재보상 동작 수행을 권고하는 정보를 출력할 수 있다. 프로세서는, 외부 전자 장치(예: 외부 서버)로부터 디스플레이 장치의 물리적인 특성의 변화(예: 광학 패 널이 열에 의해 장기적 또는 단기적으로 물리 적인 특성이 변화)를 알리는 정보를 수신하면, 디스플레이 장치에 대한 재보상 동작 수행을 권고하는 정보를 출력할 수 있다. 외부 전자 장치는, 디스플레이 장치가 처음으로 보 상 정보로 보상이 된 이후 시간의 흐름에 따라 디스플레이 장치의 사용시간에 대응되는 물리적인 특성의 변화를 예측하여 저장할 수 있다. 외부 전자 장치는 디스플레이 장치의 물리적인 특성의 변화가 기준 변화 값 이상으로 결정하면, 전자 장치로 디스플레이 장치의 물리적인 특성의 변화를 알리는 정보를 전송할 수 있다. 프로세서는, 디스플레이 장치로부터 디스플레이 장치의 물리적인 특성의 변화(예: 광학 패널이 열에 의해 장기적 또는 단기적으로 물리 적인 특성이 변화)를 알리는 정보를 수신하면, 디스플레이 장치에 대한 재보상 동 작 수행을 권고하는 정보를 출력할 수 있다. 디스플레이 장치는, 디스플레이 장치가 처음으로 보상 정보로 보상 이 된 이후 시간의 흐름에 따라 디스플레이 장치의 사용시간에 대응되는 물리적인 특성의 변화를 예측하여 저장 할 수 있다. 디스플레이 장치는 디스플레이 장치의 물리적인 특성의 변화가 기준 변화 값 이상으로 결정하면, 전자 장치로 디스플레이 장치의 물리적인 특성의 변화를 알리는 정보를 전송할 수 있다. 프로세서는, 전자 장치에 설치된 디스플레이 장치의 보상을 위한 어플리케이션으로부터 디스플레이 장치의 물리적인 특성의 변화(예: 광학 패널이 열에 의해 장기적 또는 단기적으로 물리 적인 특성이 변화)를 알리는 정 보를 수신하면, 디스플레이 장치에 대한 재보상 동작 수행을 권고하는 정보를 출력할 수 있다. 디스플레이 장치 의 보상을 위한 어플리케이션은, 디스플레이 장치가 처음으로 보상 정보로 보상이 된 이후 시간의 흐름에 따라 디스플레이 장치의 사용시간에 대응되는 물리적인 특성의 변화를 예측하여 저장하고, 디스플레이 장치의 물리적 인 특성의 변화가 기준 변화 값 이상으로 결정하면, 프로세서로 디스플레이 장치의 물리적인 특성의 변화를 알 리는 정보를 출력할 수 있다. 프로세서는 메모리에 저장된 보상 정보(예: 제1 보상 정보, 제2 보상 정보, 제3 보상 정보, 제4 보상 정보 및/또는 제5 보상 정보)와 디스플레이 장치에 대응하는 좌표 정보를 검출하고, 디스플레이 장치에 대응하 는 좌표 정보에 기반하여 카메라를 통해 획득한 디스플레이 장치의 적어도 일부 영역을 포함하는 RGB 영상 을, 보상 정보에 포함된 보상 함수를 이용하여 XYZ 영상으로 변환함으로써, 획득된 영상을 보상할 수 있다. 프로세서는, 보상 어플리케이션을 실행하고, 복수의 영상 보상 모드를 표시할 수 있다. 상기 프로세서 는, 상기 보상 어플리케이션의 실행에 따라, 사용자에 의해 선택될 수 있는 디스플레이 장치의 영상 보상 을 위한 제1 영상 보상 모드, 제2 영상 보상 모드 및 제3 영상 보상 모드를 포함하는 복수의 영상 보상 모드를 제공할 수 있다. 프로세서는, 상기 복수의 영상 모드 중 제1 영상 모드(예: 도 15의 Quick mode)의 선택을 기반으로, 제1 영상 보상 동작을 수행하기 위한 제1 영상 보상 모드로 전환할 수 있다. 프로세서는, 제1 영상 보상 동작 수행을 위한 제1 영상 보상 모드에서 제1 영상 보상 시간 동안 제1 영상 보상 방법에 포함된 화질 조정 항 목으로 디스플레이 장치의 영상을 보상하는 제1 영상 보상을 동작을 수행할 수 있다. 프로세서는, 제1 영 상 보상 모드에서, 제1 영상 보상 시간이 예를 들어 30초로 설정되고, 상기 제1 영상 보상 방법이 예를 들어, 2 포인트(point)의 화이트 밸런스를 화질 조정 항목으로 포함하는 경우, 30초 동안, 신호 레벨 0 black ~ 255 Full white까지 계조를 2개의 레벨(level)로 나누고 상기 2개의 레벨을 나타내는 2개 포인트(point)의 화이트 밸런스를 보정하면서 디스플레이 장치의 영상을 보상할 수 있다. 프로세서는, 상기 복수의 영상 모드 중 제2 영상 모드(예: 도 15의 Basic mode)의 선택을 기반으로, 제2 영상 보상 동작을 수행하기 위한 제2 영상 보상 모드로 전환할 수 있다. 프로세서는, 제2 영상 보상 동작 수행을 위한 제2 영상 보상 모드에서 제2 영상 보상 시간 동안 제2 영상 보상 방법에 포함된 화질 조정 항 목으로 디스플레이 장치의 영상을 보상하는 제2 영상 보상을 동작을 수행할 수 있다. 프로 세서는, 제2 영 상 보상 모드에서, 제2 영상 보상 시간이 예를 들어 180초로 설정되고, 상기 제2 영상 보상 방법이 예를 들어, 2개 포인트(point)의 화이트 밸런스, 20개 포인트(point)의 화이트 밸런스, 그레이스케일 선형성(grayscale linearity) 및 감마(gamma)를 화질 조절 항목으로 포함하는 경우, 신호 레벨 0 black ~ 255 Full white까지 계 조를 2개의 레벨(level)로 나누고 상기 2개의 레벨을 나타내는 2개의 포인트(point) 각각에 대한 화이트 밸런스를 보정하고, 신호 레벨 0 black ~ 255 Full white까지 계조를 20개의 레벨(level)로 나누고 상기 20개의 레벨 을 나타내는 20개의 포인트(point) 각각에 대한 화이트 밸런스를 보정하고, 그레이스케일 선형성을 위해 20개 포인트(point)에 대해서 계조가 구별되도록 보정하고, 감마를 보정하면서 디스플레이 장치의 영상을 보상 수 있 다. 프로세서는, 상기 복수의 영상 모드 중 제3 영상 모드(예: 도 15의 Professional mode)의 선택을 기반으로, 제3 영상 보상 동작을 수행하기 위한 제3 영상 보상 모드로 전환할 수 있다. 프로세서는, 제3 영상 보상 동작 수행을 위한 제3 영상 보상 모드에서 제3 영상 보상 시간 동안 제3 영상 보상 방법에 포함된 화 질 조정 항목으로 디스플레이 장치의 영상을 보상하는 제3 영상 보상을 동작을 수행할 수 있다. 프로세서 는, 제3 영상 보상 모드에서, 제3 영상 보상 시간이 예를 들어 15분으로 설정되고, 상기 제3 영상 보상 방법이 예를 들어, 2개 포인트(point)의 화이트 밸런스, 20개 포인트(point)의 화이트 밸런스, 그레이스케일 선형성 (grayscale linearity), 감마(gamma), 색도(chromaticity), 및 HDR (high dynamic range) 신호의 EOTF (Electro-optic transfer function)를 화질 조절 항목으로 포함하는 경우, 신호 레벨 0 black ~ 255 Full white까지 계조를 2개의 레벨(level)로 나누고 상기 2개의 레벨을 나타내는 2개의 포인트(point) 각각에 대한 화이트 밸런스를 보정하고, 신호 레벨 0 black ~ 255 Full white까지 계조를 20개의 레벨(level)로 나누고 상기 20개의 레벨을 나타내는 20개의 포인트(point) 각각에 대한 화이트 밸런스를 보정하고, 그레이스케일 선형성을 위해 20개 포인트(point)에 대해서 계조가 구별되도록 보정하고, 감마를 보정하고, 색도(chromaticity)를 보정 하고, HDR (high dynamic range) 신호의 EOTF (Electro-optic transfer function)를 보정하면서 디스플레이 장 치의 영상을 보상 수 있다. 프로세서는, 제3 영상 모드(예: 도 15의 Professional mode)의 선택을 기반으로, 화질 조절 항목에 대한 추가적인 설정 메뉴 화면을 제공할 수 있다. 프로세서는, 상기 설정 메뉴화면에 포함된 밝기 (Luminance) 항목, 감마(Gamma)항목 및 패턴 크기(Pattern size)항목 중 상기 밝기(Luminance) 항목에서 사용 자에 의해 밝기가 선택되면, 디스플레이 장치의 영상을 보상하는 과정에서 디스플레이 장치가 상기 사용자에 의 해 선택된 밝기로 표시할 수 있도록 제어할 수 있다. 프로세서는, 제2 영상 모드(예: 도 15의 Basic mode)와 같이 방송표준 또는 기타 표준으로 고정된 감마 커브(Gamma curve)에 맞추는 보정 과정을 수행하 는 것과는 달리, 사용자가 감마 커브(Gamma curve)의 종류를 선택할 수 있도록 상기 감마(Gamma)항목을 제공할 수 있다. 프로세서는, 제2 영상 보상 모드(예: Basic mode)와 같이 디스플레이에 풀(full)로 표시되는 패 턴인 Full Raster 패턴을 사용하는 것과는 달리 사용자가 특정 크기 패턴을 선택할 수 있도록 패턴 크기 (Pattern size)항목을 제공할 수 있다. 프로세서는, 설정 메뉴 화면에 HDR 신호를 조정할 수 있는 항목 및 디스플레이 장치에서 출력되는 화질 측정 패턴을 촬영할 수 있는 전자 장치의 카메라의 설정 값을 제어할 수 있는 항목을 추가적으로 제공할 수 있다. 메모리는 전자 장치의 적어도 하나의 구성요소(예: 프로세서)에 의해 사용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어 및 이와 관련된 명령에 대한 입력 데이터 또는 출력 데이터 를 포함할 수 있다. 메모리는 휘발성 메모리 또는 비휘발성 메모리를 포함할 수 있다. 예를 들어, 메모리 는 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), 멀티미디어 카드 마이크 로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 램(RAM, Random Access Memory) SRAM(Static Random Access Memory), 롬(ROM, Read-Only Memory), EEPROM(Electrically Erasable Programmable Read-Only Memory), PROM(Programmable Read-Only Memory), 자기 메모리, 자기 디스크, 광디스크 중 적어도 하나의 타입의 저장매체를 포함할 수 있다. 메모리는 프로세서에 의해서 실행 가능한 하나 이상의 인스트럭션을 저장하고 있을 수 있다. 예를 들 어, 메모리에 저장된 하나 이상의 인스트럭션은, 획득한 영상을 보상하기 위한 인스트럭션일 수 있다. 메 모리에 저장된 하나 이상의 인스트럭션은 보상된 영상의 화질 값을 측정하기 위한 인스트럭션일 수 있다. 메모리에 저장된 하나 이상의 인스트럭션은 측정된 화질 값을 기준 값으로 변환하기 위하여 필요한, 조정 정보를 생성하기 위한 인스트럭션일 수 있다. 메모리는 카메라를 이용하여 획득한 영상이 저장될 수 있다. 메모리에는 영상을 보상하기 위한 보상 정보가 저장되어 있을 수 있다. 메모리에는 디스플레이 장치 의 모델 별 발광 특성 및 전자 장치의 모델 별 카메라의 응답 특성을 매칭한 정보가 저장되어 있을 수 있다. 메 모리에는, 디스플레이 장치들의 모델 별 발광 특성에 따라 매칭된 전자 장치들의 모델 별 카메라의 응답 특성을 보상하기 위한 보상 정보가 저장되어 있을 수 있다. 메모리에 저장된 보상 정보는 프로세서가획득한 영상을 이용하여, 휘도, 색, 분포 등을 보상하는데 사용할 수 있는 보상 함수일 수도 있고, 또는 각 디 스플레이 별로, 사용자 단말기 모델 별로 이미 구해져 있는 결과 값일 수도 있다. 통신 회로는 전자 장치와 디스플레이 장치 또는 서버 간의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 회로은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일실시예에 따르면, 통신 회로은 무선 통신 모듈 (예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통 신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크 (예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워크) 또는 제 2 네트워크 (예: 레거시 셀룰러 네트워크, 5G 네트워 크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또는 고신 뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈 은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출 력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 디스 플레이 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링크(DL) 및 업링크(UL) 각 각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 통신 회로는 유무선의 네트워크를 통하여 디스플레이 장치와 통신할 수 있다. 예를 들어, 통신 회로 는 디스플레이 장치와 통신을 수행하여 디스플레이의 광 정보 출력을 조정할 수 있다. 구체적으로, 통신 회로 는 프로세서의 제어에 따라서 유무선의 네트워크를 통하여 연결되는 디스플레이 장치와 데이터를 송 수신할 수 있다. 실시 예에 따라 통신 회로는 디스플레이 장치로부터 디스플레이 식별 정보 및 출력 제어 신호를 수신하고, 출력 제어 신호를 조정하기 위한 조정 신호를 디스플레이 장치에게 전송할 수 있다. 카메라는 하나 이상의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있 다. 카메라는 정지 영상 및 동영상을 촬영하여 영상을 생성하고, 이를 신호 처리할 수 있다. 카메라 는 디스플레이 장치의 전체를 촬영하여 하나의 영상을 획득할 수 있다. 카메라는 피사체에 대한 정보를 CCD나 CMOS 등의 이미지 센서(미도시)에 상이 맺히도록 할 수 있고, 이미지 센서는 카메라를 통해 들어온 빛을 전기적인 신호로 변환할 수 있다. 또한, 카메라는 촬영한 영상에 대해 AE(Auto Exposure), AWB(Auto White Balance), Color recovery, correction, Sharpening, Gamma, Lens shading correction 중 하나 이상의 신호 처리를 수행할 수 있다. 카메라에 포함된 센서 및/또는 렌즈에 따라 광 정보를 인식하는 응답 특성이 상이할 수 있다. 도 3은 다양한 실시예에 따라, 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시하는 도면이다. 도 3의 실 시예는, 도 4a, 도 4b, 도 4c, 도 5 및 도 6의 실시예를 참조하여 더욱 상세하게 설명하도록 한다. 도 4a는 다 양한 실시예에 따라, 디스플레이 장치에서 출력되는 광 정보를 설명하기 위한 도면이다. 도 4b는 다양한 실시예 에 따라, 전자 장치에서 획득된 영상의 RGB 반응 스펙트럼을 도시하는 도면이다. 도 4c는 다양한 실시예에 따라, 계측기에서 획득된 영상의 XYZ 반응 스펙트럼을 도시하는 도면이다. 도 5는 다양한 실시예에 따라, 디스 플레이 장치가 출력하는 화질 측정 패턴을 도시하는 도면이다. 도 6은 다양한 실시예에 따라, 전자 장치가 영상 보상을 수행하는 것을 도시하는 도면이다. 도 3에서의 동작들은 순서가 제한되지는 않으며, 인접하는 두 개의 동작 사이에 다른 동작이 더 수행될 수도 있 다. 아울러, 도 3의 동작들 중 적어도 일부가 생략될 수도 있다. 본 개시에서, 전자 장치가 특정 동작을 수행한다는 표현은, 전자 장치의 프로세서가 특정 동작을 수행하거나, 프로세서가 다른 하드웨 어로 하여금 특정 동작을 수행하도록 제어함을 의미할 수 있다. 또는, 전자 장치가 특정 동작을 수행한다 는 표현은, 메모리에 저장된 인스트럭션들이 실행됨에 따라, 프로세서 또는, 다른 하드웨어가 특정 동작을 수행함을 의미할 수 있으며, 메모리에 특정 동작 수행을 야기하도록 하는 인스트럭션들이 저장됨을 의미할 수도 있다. 다양한 실시예에 따라서, 전자 장치(예: 프로세서)는, 301 동작에서, 디스플레이 장치에 대응하 는 좌표 정보 및 제 1 보상 정보를 획득할 수 있다. 전자 장치는 외부 서버로부터 디스플레이 장치에 대응하는 좌표 정보 및 제 1 보상 정보를 수신할 수도 있고, 또는, 메모리에 미리 저장된 정보를 이용할 수도 있다. 디스플레이 장치에 대응하는 좌표 정보는, 디스플레이 장치가 생산될 때, 보상을 수행하기 위 해 측정된 지점을 나타내는 정보일 수 있다. 예를 들어, 보상을 수행하기 위해 측정된 하나의 white 지점이거나, R/G/B/W/ 지점들일 수도 있다. 따라서, 특정 지점만을 계측하여 디스플레이 장치의 보상을 수행할 수 있다. 디스플레이 장치에 대응하는 제1 보상 정보는, 전자 장치의 모델 및 디스플레이 장치 의 모델에 따라 상이할 수 있다. 예를 들어, 제 1 보상 정보는, 전자 장치의 모델과 동일한 모델의 제 1 전자 장치가, 디스플레이 장치의 모델과 동일한 모델의 제 1 디스플레이 장치를 촬영한 RGB 영상을, 계측 기가 제 1 디스플레이 장치를 촬영한 XYZ 영상으로 변환하기 위한 보상 함수일 수 있다. 예를 들어, 도 4a는 디 스플레이 장치와 동일한 모델의 제 1 디스플레이 장치가 출력하는 화면의 스펙트럼 출력일 수 있다. 도 4b 는 제 1 디스플레이 장치가 출력하는 화면을 제 1 전자 장치의 카메라로 촬영하여 획득한 RGB 영상의 스펙트럼 일 수 있다. 도 4c는 제 1 디스플레이 장치가 출력하는 화면을 계측기에서 획득한 XYZ 영상의 스펙트럼일 수 있 다. 여기서, 제 1 전자 장치의 카메라로 촬영하여 획득한 RGB 영상을 계측기에서 획득한 XYZ 영상으로 변환하기 위한 보상 함수가 계산될 수 있다. 제 1 보상 정보는 계산된 보상 함수를 포함할 수 있다. 다양한 실시예에 따라서, 전자 장치는, 303 동작에서, 디스플레이 장치에 대응하는 좌표 정보에 기반 하여 디스플레이 장치의 적어도 일부 영역을 포함하는 영상을 획득할 수 있다. 전자 장치가 디스플레 이 장치의 적어도 일부 영역을 포함하는 영상을 촬영하는 동안, 디스플레이 장치는 화질 측정 패턴을 표시할 수 있다. 예를 들어, 도 5를 참조하면, 디스플레이 장치는 다양한 화질 측정 패턴들(510, 520, 530)을 출력할 수 있다. 도 5에 도시된 화질 측정 패턴들(510, 520, 530)을 하나의 실시 예일 뿐이며 이 외에도 다양한 화질 측정 패턴이 있을 수 있다. 디스플레이 장치가 출력하는 화질 측정 패턴에 따라, 전자 장치가 조정할 항목은 달라질 수 있다. 예 를 들어, 전자 장치가 디스플레이 장치에서 출력되는 광 정보 중 휘도를 측정하는 경우, 디스플레이 장치는 밝은 White pattern을 출력할 수 있다. 다른 예에서, 전자 장치는 특정한 조정 항목의 화질을 측정하기 위해, 특정한 화질 측정 패턴이 디스플레이 장치에서 출력되도록 디스플레이에게 요청할 수 있다. 디스플레이 장치는 사용자가 요청한 조정 항목이 광 정보 중 색에 대한 것이면, R/G/B/Y/M/C 화면을 출력할 수 있다. 또는 사용자가 요청한 조정 항목이 감마(gamma)인 경우, 디스플레이 장치는 어두운 black 부터 밝은 white 레벨까지 다양한 계조를 갖는 화질 측정 패턴들을 일정한 간격, 혹은 특정 시간 간격으로 순차 적으로 바꾸면서 출력할 수도 있다. 다양한 실시예에 따라서, 전자 장치는, 305 동작에서, 제 1 보상 정보에 기반하여, 획득된 영상을 보상할 수 있다. 전자 장치는 디스플레이 장치의 적어도 일부 영역을 포함하는 RGB 영상을, 제 1 보상 정보 에 포함된 보상 함수를 이용하여 XYZ 영상으로 변환함으로써, 획득된 영상을 보상할 수 있다. 이때, 제 1 보상 정보에 포함된 보상 함수는, 전자 장치와 동일한 모델의 제 1 전자 장치에 포함된 카메라의 응답 특성과, 디스플레이 장치와 동일한 모델의 제 1 디스플레이 장치의 발광 특성에 기반하여 계산된 함수일 수 있다. 다양한 실시예에 따라서, 전자 장치는, 307 동작에서, 보상된 영상 및 카메라의 응답 특성에 기반하여, 제 1 보상 정보를 수정한 제 2 보상 정보를 생성할 수 있다. 전자 장치와 제 1 전자 장치가 동일한 모델이라 하더라도, 전자 장치에 포함된 카메라의 센서와 제 1 전자 장치에 포함된 카메라의 센서가 인식하는 광 정 보는 상이할 수 있다. 또한, 디스플레이 장치와 제 1 디스플레이 장치가 동일한 모델이라 하더라도, 디스 플레이 장치에 포함된 패널의 발광 특성과 제 1 디스플레이 장치에 포함된 패널의 발광 특성이 상이할 수 있다. 이에 따라, 전자 장치의 카메라 응답 특성과 디스플레이 장치의 발광 특성에 따라, 제 1 보상 정보에 포함된 보상 함수의 수정이 필요할 수 있다. 전자 장치는 제 1 보상 정보에 포함된 보상 함수를 이 용하여, 디스플레이 장치를 촬영한 RGB 영상을 XYZ 영상으로 변환할 수 있다. 이때, 변환된 XYZ 영상과 계측기가 제 1 디스플레이 장치를 계측한 XYZ 영상에 대응하도록 제 1 보상 정보에 포함된 보상 함수를 수정할 수 있다. 즉, 전자 장치가 디스플레이 장치를 촬영하여 획득한 RGB 영상을 계측기가 계측한 XYZ 영상으 로 변환하기 위한 수정 보상 함수를 생성할 수 있다. 전자 장치는 수정 보상 함수를 이용하여, 촬영하여 획득한 RGB 영상을 보상할 수 있다. 예를 들어, 도 6을 참조하면, 좌측 영상은 촬영 영상을 도시한 도면이 고, 우측 영상은 수정 보상 함수를 이용하여 전자 장치가 보상을 수행한 후의 영상을 도시한 도면이 다. 상기 전자 장치는, 촬영 영상을 도시한 좌측 영상과 상기 촬영 영상에 보상을 수행한 영상인 우 측 영상을 표시하는 동안, 사용자에 의해 선택된 영상(예: 좌측 영상 또는 우측 영상)을 디스플 레이 장치의 화질 영상으로 적용할 수 있다. 예를 들어, 전자 장치가 디스플레이 장치를 촬영하여 획득한 영상은 보상 알고리즘을 통해 휘도와 색 좌표로 표현된 계측 정보 영상으로 변환될 수 있다. 전자 장치가 수행하는 보상 알고리즘은 목적에 따라 휘도 정보 보상, 색 정보 보상, 감마 특성 보상, 분포 정보 보상 중 하나 이상의 함수로 구성될 수 있다. 휘도 정보 보상 함수는 전자 장치의 카메라 내부의 센서에 도달한 디스플레이 장치로부터 출력된 광 량과, 카메라의 센서가 이를 응답하는 특성을 보상해 주기 위한 함수이다. 색 정보 보상 함수는 전자 장치의 카메라의 센서 내 Red, Green, Blue 픽셀값이 디스플레이 장치가 출력하는 색에 반응하는 특성을 보상해주기 위한 함수이다. 분포 정보 보상 함수는 전자 장치의 카메라 렌즈의 비네팅 효과 및 디스플레이 장치의 시야각 특성 등으로 인한 영상 내 밝기 분포 불균일도를 보상해주기 위한 함수이다. 대면적의 광원인 디스플레이 장치 를 인식할 때, 전자 장치의 카메라는, 카메라와 디스플레이 장치 사이의 거리가 가장 가깝고 직교하 는 부분의 광을 가장 크게 인식하고, 거리가 멀거나 또는 경사진 부분의 광을 어둡게 또는 원래의 색과 다르게 받아들일 수 있다. 이 경우, 전자 장치가 촬영한 영상은 좌측 영상처럼 영상의 내부로 들어갈수록 밝 고 영상의 가장자리로 갈수록 어둡게 촬영되게 된다. 따라서, 전자 장치는 분포 정보 보상 함수를 이용하 여 이러한 밝기 불균일을 보상할 수 있다. 전자 장치가 분포 정보 보상을 수행한 경우, 좌측 영상은 우측 영상과 같이 영상 내부와 외부의 차이 없이 일정한 밝기를 갖는 영상으로 보상될 수 있다. 도 6에서 그래프는 좌측 영상과 우측 영상의 밝기의 균일도를 도시한 도면이다. 그래프에 서 좌측 영상의 밝기는 영상 중앙 부분과 영상의 가장자리 부분의 차이가 크게 남을 알 수 있다. 실시 예 에서, 전자 장치가 좌측 영상의 분포 정보를 보상한 결과, 그래프에서 우측 영상의 밝기는 영상의 영역에 관계 없이 균일한 밝기를 가짐을 알 수 있다. 도 7은 다양한 실시예에 따라, 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시하는 도면이다 도 8a 내지 도 8b의 실시예는, 도 7의 실시예를 참조하여 더욱 상세하게 설명하도록 한다. 도 8a 내지 도 8b는 다양한 실시 예에 따라, 전자 장치가 보상 정보를 추가 생성하는 동작을 설명하기 위한 도면이다. 도 7에서의 동작들은 순서가 제한되지는 않으며, 인접하는 두 개의 동작 사이에 다른 동작이 더 수행될 수도 있 다. 아울러, 도 7의 동작들 중 적어도 일부가 생략될 수도 있다. 본 개시에서, 전자 장치가 특정 동작을 수행한다는 표현은, 전자 장치의 프로세서가 특정 동작을 수행하거나, 프로세서가 다른 하드웨 어로 하여금 특정 동작을 수행하도록 제어함을 의미할 수 있다. 또는, 전자 장치가 특정 동작을 수행한다 는 표현은, 메모리에 저장된 인스트럭션들이 실행됨에 따라, 프로세서 또는, 다른 하드웨어가 특정 동작을 수행함을 의미할 수 있으며, 메모리에 특정 동작 수행을 야기하도록 하는 인스트럭션들이 저장됨을 의미할 수도 있다. 다양한 실시예에 따라서, 전자 장치(예: 프로세서)는, 701 동작에서, 디스플레이 장치에 대응하 는 좌표 정보 및 제 1 보상 정보를 획득할 수 있다. 전자 장치는 외부 서버로부터 디스플레이 장치에 대응하는 좌표 정보 및 제 1 보상 정보를 수신할 수도 있고, 또는, 메모리에 미리 저장된 정보를 이용할 수도 있다. 디스플레이 장치에 대응하는 좌표 정보는, 디스플레이 장치가 생산될 때, 보상을 수행하기 위 해 측정된 지점을 나타내는 정보일 수 있다. 예를 들어, 보상을 수행하기 위해 측정된 하나의 white 지점이거나, R/G/B/W/ 지점들일 수도 있다. 따라서, 특정 지점만을 계측하여 디스플레이 장치의 보상을 수행할 수 있다. 디스플레이 장치에 대응하는 제1 보상 정보는, 전자 장치의 모델 및 디스플레이 장치 의 모델에 따라 상이할 수 있다. 다양한 실시예에 따라서, 전자 장치는, 703 동작에서, 전자 장치의 카메라 센서 정보와 상기 제1 보 상 정보의 카메라 센서 정보가 다름을 확인할 수 있다. 전자 장치는, 전자 장치의 카메라 센서 정보(예: 센서 종류 및/또는 센서 값등)와, 외부 서버로부터 수신한 제1 보상 정보의 카메라 센서 정보(예: 센서 종 류 및/또는 센서 값등)의 비교를 기반으로 전자 장치의 카메라 센서 정보와 상기 제1 보상 정보의 카메라 센서 정보가 다름을 확인할 수 있다. 제1 보상 정보의 카메라 센서 정보는, 제1 보상 정보의 계산을 위해 이용 된 전자 장치와 동일한 모델의 다른 전자 장치인 제 1 전자 장치의 카메라 센서 정보(예: 센서의 종류 및/ 또는 센서 값)를 나타낼 수 있다. 다양한 실시예에 따라서, 전자 장치는, 705 동작에서, 제1 계조 영역을 포함하는 영상을 보상하기 위한 제 3 보상 정보를 생성할 수 있다. 전자 장치의 카메라 렌즈 정보와 제1 보상 정보의 카메라 렌즈 정보가 상이할 때, 전자 장치의 카메라를 통해 획득한 계조 영역(예: 도 8a의 a1 및 a2) 중 어두운 색 레벨에 대응되는 제1 계조 영역(저계조 영역)을 포함하는 영상이 제1 보상 정보(예: 도 8a의 801)로 보상되는 경우, 상기 보상된 영상이 linearity한 제1 보상 정보와 비례하지 않게 즉, 정확하지 않게 출력될 수 있다(813a). 전자 장치 는, 전자 장치의 카메라 렌즈 정보와 제1 보상 정보의 카메라 렌즈 정보가 상이할 때, 제1 계조 영역(저계조 영 역)을 포함하는 영상이 linearity 하게 출력될 수 있도록(813b) 특정 값을 가지는 제3 보상 정보(예: 도 8b의 803)를 생성할 수 있다. 전자 장치는, 전자 장치의 카메라 센서 정보와 외부 서버로부터 수신한 제1 보상 정보의 카메라 센서 정보를 기반으로 전자 장치의 센서 값과 제1 보상 정보의 센서 값을 일치시킬 수 있는 제3 보상 정보를 계산하여 생성할 수 있다. 전자 장치는, 전자 장치의 카메라 센서 정보와 외부 서버로부터 수 신한 제1 보상 정보의 카메라 센서 정보를 기반으로 미리 저장된 제3 보상 정보를 메모리에서 검출할 수 있다. 다양한 실시예에 따라서, 전자 장치는, 707 동작에서, 디스플레이 장치에 대응하는 좌표 정보에 기반 하여 디스플레이 장치의 적어도 일부 영역을 포함하는 영상을 획득할 수 있다. 전자 장치가 디스플레 이 장치의 적어도 일부 영역을 포함하는 영상을 촬영하는 동안, 디스플레이 장치는 화질 측정 패턴을 표시할 수 있다. 다양한 실시예에 따라서, 전자 장치는, 709 동작에서, 제 3 보상 정보 에 기반하여, 획득한 영상을 보상할 수 있다. 전자 장치는 디스플레이 장치의 적어도 일부 영역을 포함하는 RGB 영상이 제1 계조 영역(예: 도 10의 a1)을 포함하는 경우, 제3 보상 정보에 포함된 보상 함수를 이용하여 XYZ 영상으로 변환함으 로써, 획득된 영상을 보상할 수 있다. 도 9는 다양한 실시예에 따라, 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시하는 도면이다. 도 9의 실 시예는, 도 10의 실시예를 참조하여 더욱 상세하게 설명하도록 한다. 도 10은 다양한 실시예에 따라, 전자 장치 가 보상 정보를 추가 생성하는 동작을 설명하기 위한 도면이다. 도 9에서의 동작들은 순서가 제한되지는 않으며, 인접하는 두 개의 동작 사이에 다른 동작이 더 수행될 수도 있 다. 아울러, 도 9의 동작들 중 적어도 일부가 생략될 수도 있다. 본 개시에서, 전자 장치가 특정 동작을 수행한다는 표현은, 전자 장치의 프로세서가 특정 동작을 수행하거나, 프로세서가 다른 하드웨 어로 하여금 특정 동작을 수행하도록 제어함을 의미할 수 있다. 또는, 전자 장치가 특정 동작을 수행한다 는 표현은, 메모리에 저장된 인스트럭션들이 실행됨에 따라, 프로세서 또는, 다른 하드웨어가 특정 동작을 수행함을 의미할 수 있으며, 메모리에 특정 동작 수행을 야기하도록 하는 인스트럭션들이 저장됨을 의미할 수도 있다. 다양한 실시예에 따라서, 전자 장치(예: 프로세서)는, 901 동작에서, 디스플레이 장치에 대응하 는 좌표 정보, 제 1 보상 정보 및 제1 조정 정보를 획득할 수 있다. 전자 장치는 외부 서버로부터 디스플 레이 장치에 대응하는 좌표 정보, 제 1 보상 정보 및 제1 조정 정보를 수신할 수도 있고, 또는, 메모리에 미리 저장된 정보를 이용할 수도 있다. 디스플레이 장치에 대응하는 좌표 정보는, 디스플레이 장치가 생산될 때, 보상을 수행하기 위해 측정된 지점을 나타내는 정보일 수 있다. 예를 들어, 보상을 수행하기 위해 측정된 하나의 white 지점이거나, R/G/B/W/ 지점들일 수도 있다. 따라서, 특정 지점만을 계측하여 디스플레이 장치의 보상을 수행할 수 있다. 디스플레이 장치에 대응하는 제1 보상 정보는, 전자 장치의 모델 및 디스플레이 장치의 모델에 따라 상이할 수 있다. 예를 들어, 제 1 보상 정보는, 전자 장치의 모델과 동일한 모델의 제 1 전자 장치가, 디스플레이 장치의 모델과 동일한 모델의 제 1 디스플레이 장치를 촬영 한 RGB 영상을, 계측기가 제 1 디스플레이 장치를 촬영한 XYZ 영상으로 변환하기 위한 보상 함수일 수 있다. 상 기 제1 보상 정보는, 계조 영역(예: 도 10의 a1, a2, 및 a3) 중 중간 색 레벨에 대응되는 제2 계조 영역(중계조 영역, 예: 도 10의 a2)을 포함하는 영상을 보상하기 위해 측정된 값(예: 도 10의 111)을 나타낼 수 있다. 상기 제1 보상 정보는, 계조 영역(예: 도 10의 a1, a2, 및 a3) 중 밝은 색 레벨에 대응되는 제3 계조 영역(저계조 영 역, 예: 도 10의 a3)을 포함하는 영상을 보상하기 위한 제5 보상 정보를 생성하기 위해 사용될 수 있다. 상기제1 조정 정보는, 계조 영역(예: 도 10의 a1, a2, 및 a3) 중 어두운 색 레벨에 대응되는 제1 계조 영역(저계조 영역, 예: 도 10의 a1)을 포함하는 영상을 보상하기 위한 제4 보상 정보를 생성하기 위해 사용될 수 있는 측정 된 값(예: 도 10의 113)을 나타낼 수 있다. 다양한 실시예에 따라서, 전자 장치는, 903 동작에서, 전자 장치의 카메라 설정 정보와 상기 제1 보 상 정보의 카메라 설정 정보가 다름을 확인할 수 있다. 전자 장치는, 전자 장치의 카메라 설정 정보 (예: 카메라의 노출 값, 센서 감도 값 및/또는 조리개 값등)와, 외부 서버로부터 수신한 제1 보상 정보의 카메 라 설정 정보(예: 카메라의 노출 값, 센서 감도 값 및/또는 조리개 값등)의 비교를 기반으로 전자 장치의 카메라 설정 정보와 상기 제1 보상 정보의 카메라 설정 정보가 다름을 확인할 수 있다. 제1 보상 정보의 카메라 설정 정보는, 제1 보상 정보의 계산을 위해 이용된 전자 장치와 동일한 모델의 다른 전자 장치인 제 1 전 자 장치의 카메라 설정 정보(예: 카메라의 노출 값, 센서 감도 값 및/또는 조리개 값등)를 나타낼 수 있다. 다양한 실시예에 따라서, 전자 장치는, 905 동작에서, 전자 장치의 카메라 설정 정보가 제1 계조 영역을 위한 제1 카메라 설정 정보이면, 제1 조정 정보를 이용하여 제4 보상 정보를 생성할 수 있다. 전자 장치는, 제1 조정 정보(예: 도 10의 113)에 전자 장치에 설정된 카메라 노출 값을 곱하여 제1 계조 영역 (예: 도 10의 a1)을 포함하는 영상을 보상하기 위한 제4 보상 정보를 생성할 수 있다. 다양한 실시예에 따라서, 전자 장치는, 907 동작에서, 전자 장치의 카메라 설정 정보가 제3 계조 영역을 위한 제2 카메라 설정 정보이면, 제1 보상 정보를 이용하여 제5 보상 정보를 생성할 수 있다. 전자 장치는, 제1 보상 정보(예: 도 10의 111)에 전자 장치에 설정된 카메라 노출 값을 나누어서 제3 계조 영역 (예: 도 10의 a3)을 포함하는 영상을 하기 위한 제5 보상 정보(예: 도 10의 115)를 생성할 수 있다. 다양한 실시예에 따라서, 전자 장치는, 909 동작에서, 디스플레이 장치에 대응하는 좌표 정보에 기반 하여 디스플레이 장치의 적어도 일부 영역을 포함하는 영상을 획득할 수 있다. 전자 장치가 디스플레 이 장치의 적어도 일부 영역을 포함하는 영상을 촬영하는 동안, 디스플레이 장치는 화질 측정 패턴을 표시할 수 있다. 다양한 실시예에 따라서, 전자 장치는, 911 동작에서, 제4 보상 정보 또는 제5 보상 정보에 기반하여, 획 득한 영상을 보상할 수 있다. 전자 장치는 디스플레이 장치의 적어도 일부 영역을 포함하는 RGB 영상 이 제1 계조 영역(예: 도 10의 a1)을 포함하는 경우, 제4 보상 정보에 포함된 보상 함수를 이용하여 XYZ 영상으 로 변환함으로써, 획득된 영상을 보상할 수 있다. 전자 장치는 디스플레이 장치의 적어도 일부 영역 을 포함하는 RGB 영상이 제3 계조 영역(예: 도 10의 a3)을 포함하는 경우, 제5 보상 정보(예: 도 10의 115)에 포함된 보상 함수를 이용하여 XYZ 영상으로 변환함으로써, 획득된 영상을 보상할 수 있다. 도 11은 다양한 실시예에 따라, 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시하는 도면이다. 도 12의 실시예는, 도 12의 실시예를 참조하여 더욱 상세하게 설명하도록 한다. 도 12는 다양한 실시예에 따라, 디스플 레이 장치의 물리적 특정의 변화를 설명하기 위한 도면이다. 도 11에서의 동작들은 순서가 제한되지는 않으며, 인접하는 두 개의 동작 사이에 다른 동작이 더 수행될 수도 있다. 아울러, 도 11의 동작들 중 적어도 일부가 생략될 수도 있다. 본 개시에서, 전자 장치가 특정 동작 을 수행한다는 표현은, 전자 장치의 프로세서가 특정 동작을 수행하거나, 프로세서가 다른 하드 웨어로 하여금 특정 동작을 수행하도록 제어함을 의미할 수 있다. 또는, 전자 장치가 특정 동작을 수행한 다는 표현은, 메모리에 저장된 인스트럭션들이 실행됨에 따라, 프로세서 또는, 다른 하드웨어가 특정 동작을 수행함을 의미할 수 있으며, 메모리에 특정 동작 수행을 야기하도록 하는 인스트럭션들이 저장됨을 의미할 수도 있다. 다양한 실시예에 따라서, 전자 장치(예: 프로세서)는, 1101 동작에서, 디스플레이장치의 변화에 따른 디스플레이 장치에 대한 재보상 동작 수행을 권고하는 정보를 출력할 수 있다. 전자 장치는, 외부 서버로부터 디스플레이 장치의 물리적인 특성의 변화(예: 광학 패널이 열에 의해 장기적 또는 단기적으로 물리 적인 특성이 변화)를 알리는 정보를 수신하면, 디스플레이 장치에 대한 재보상 동작 수행을 권고하는 정보를 출력할 수 있다. 도 12와 같이 외부 서버는, 디스플레이 장치가 처음으로 보상 정보로 보상이 된 이후 시간의 흐름에 따라 디스플레이 장치의 사용시간에 대응되는 물리적인 특성의 변화를 예측하여 저장할 수 있다. 외부 서버는 디스플 레이 장치의 물리적인 특성의 변화가 기준 변화 값 이상으로 결정하면, 전자 장치로 디스플레이 장치의 물리적 인 특성의 변화를 알리는 정보를 전송할 수 있다. 다양한 실시예에 따라서, 전자 장치(예: 프로세서)는, 1103 동작에서, 전자 장치에서 보상 정보를 검 출할 수 있다. 전자 장치는 메모리에 저장된 보상 정보(예: 제1 보상 정보, 제2 보상 정보(예: 도 8b의 801, 및/또는 도 10의 111), 제3 보상 정보(예: 도 8b의 803), 제4 보상(예: 도 10의 113) 및/또는 제5 보상 정보(예: 도 10의 115)와 디스플레이 좌표 정보를 검출할 수 있다. 다양한 실시예에 따라서, 전자 장치는, 1105 동작에서, 디스플레이 장치에 대응하는 좌표 정보에 기 반하여 디스플레이 장치의 적어도 일부 영역을 포함하는 영상을 획득할 수 있다. 전자 장치가 디스플 레이 장치의 적어도 일부 영역을 포함하는 영상을 촬영하는 동안, 디스플레이 장치는 화질 측정 패턴 을 표시할 수 있다. 다양한 실시예에 따라서, 전자 장치는, 1107 동작에서, 보상 정보에 기반하여, 획득된 영상을 보상할 수 있다. 전자 장치는 디스플레이 장치의 적어도 일부 영역을 포함하는 RGB 영상을, 보상 정보에 포함된 보상 함수를 이용하여 XYZ 영상으로 변환함으로써, 획득된 영상을 보상할 수 있다. 도 13a 내지 도 13d는 다양한 실시예에 따라, 디스플레이 장치의 영상 보상을 수행하는 방법을 설명하기 위한 도면이다. 실시예에 따라, 전자 장치는 사용자 입력에 기반하여 보상 어플리케이션을 실행할 수 있다. 도 13a를 참조 하면, 전자 장치는 \"TV 모델명을 입력하세요\", \"촬영할 전자 장치의 모델명을 입력하세요\"와 같은 안내 문구를 표시하여, 보상 할 TV 모델명과 전자 장치의 모델명을 확인할 수 있다. 또는, 전자 장치(10 1)는 디스플레이 장치로부터 디스플레이 장치의 식별 정보를 수신함으로써 디스플레이 장치의 모델명을 확 인할 수도 있다. 전자 장치는 \"calibration 시작\"을 선택하는 사용자 입력에 기반하여, 사용자가 디스플레이 장치 를 촬영하도록 할 수 있다. 예를 들어, 도 13b에서와 같이, 전자 장치는, \"TV를 calibration 모드로 설정하고, 아래 부분에 TV가 나오도록 촬영해 주세요\"와 같은 가이드 정보를 표시하여, 사용자가 디스플 레이 장치를 촬영하도록 할 수 있다. 전자 장치는 카메라를 통해 촬영되는 디스플레이 장치의 영상을 일부 영역에 표시할 수 있다. 이때, 전자 장치는 디스플레이 장치가 특정 화질 측정 패턴을 표 시하도록 하는 신호를 전송할 수도 있다. 예를 들어, 도 13c와 같이, 전자 장치는, \"TV와의 거리 및 각도 가 촬영 조건을 만족하도록 전자 장치를 이동시켜 주세요\"와 같은 가이드 정보를 표시하여, 사용자가 디 스플레이 장치의 일부 영역의 촬영을 위해 전자 장치를 디스플레이 장치로 이동시킬 수 있다. 디스플레이 장치의 일부 영역은, 디스플레이 장치가 생산될 때, 보상을 수행하기 측정된 지점일 수 있고, 하나의 white 지점이거나, 또는 R/G/B/W 지점들일 수도 있다. 디스플레이 장치의 일부 영역은, 디 스플레이 장치가 출력하는 광 정보 중 휘도를 측정하는 것이 용이하도록 디스플레이 장치가 white pattern을 출력하거나, 또는 디스플레이 장치가 출력하는 광 정보 중 색을 측정하는 것이 용이하도록 R/G/B/Y/M/C 화면을 출력할 수 있다.전자 장치는 디스플레이 장치를 촬영하는 영상을 보상할 수 있다. 전자 장치는 디스플레이 장치에서 출력되는 광 정보를 조정하는 화면을 표시할 수 있다. 예를 들어, 도 13d에서와 같이, 광 정보를 조정하는 화면은, 디스플레이 장치에서 출력되는 광 정보 중 조정할 항목 및 기준 값을 포함하는 조정 설정 정보, 디스플레이 장치가 출력하는 화질 측정 패턴을 나타내 는 상황 표시 정보, 통신 정보 및 조정 설정 정보를 포함할 수 있다. 조정 설정 정보는 조정할 항목 및 기준 값을 포함할 수 있다. 조정할 항목은 디스플레이 장치가 출 력하는 광 정보 중 조정할 대상이 무엇인지를 나타내는 정보일 수 있다. 조정할 항목은 휘도, 색, 휘도나 색의 균일도, 계조, 감마, 색 공간 중 하나 또는 복수 개가 될 수 있다. 도 13d에서 조정할 항목은 색이라는 것을 알 수 있다. 사용자는 색 외에도 조정할 항목을 추가로 바꿀 수 있고, 전자 장치는 사용자가 설정한 조정할 항목에 따라 조정 신호를 생성함으로써, 디스플레이 장치의 화질이 여러 광 정보 특성에 따라 조절되도록 할 수 있다. 기준 값은 화질 값을 얼마로 변경해야 하는지를 나타내는 타겟 값으로, 사용자가 설정한 절대 값일 수 있다. 전 자 장치는 기준 값을 이용하여, 측정된 화질 값을 기준 값으로 변경하는데 필요한 정보를 기반으로 조정 신호를 생성할 수 있다. 실시 예에서, 조정 설정 정보는 설정 모드가 절대 모드인지 또는 상대 모드인지를 선택하는 정보를 포함 할 수도 있다. 절대 모드는 위에서 언급한 바와 같이 사용자가 원하는 기준 값을 타겟 값으로 설정할 수 있는 모드를 의미하고, 상대 모드는 기준 값을 절대 값이 아닌, 특정한 아이디에 상응하는 디스플레이 영상의 화질 값을 기준으로 하는 모드일 수 있다. 사용자가 설정 모드를 상대 모드로 선택하는 경우, 사용자는 기준 값으로이용할 화질 값을 갖는 아이디 번호를 입력하여야 한다. 또는 사용자는 특정 아이디에 해당하는 영역 내의 특정 영역의 화질 값을 기준 값으로 이용하고자 할 경우, 특정 아이디 번호와 특정 영역을 식별하기 위한 위치 정보 도 함께 입력하여야 한다. 상황 표시 정보는 촬영하는 대상인 디스플레이 장치가 어떤 패턴을 출력하고 있는지를 표시하는 정 보일 수 있다. 디스플레이 장치는 화질 측정 패턴을 출력함으로써 광 정보를 출력할 수 있다. 전자 장치 는 화질 측정 패턴을 자동으로 인식하고, 화질 측정 패턴에 따라 조정할 항목을 선택할 수 있다. 예를 들 어, 디스플레이 장치가 밝은 white pattern을 화질 측정 패턴으로 출력하는 경우, 전자 장치는 측정 해야 할 항목이 휘도임을 알 수 있고, 영상의 화질 값 중 휘도를 측정할 수 있다. 통신 정보는 통신을 수행하기 위한 정보로, 디스플레이 장치와 유무선 통신으로 연결하기 위한 접속 정보일 수 있다. 예컨대, 통신 정보는 통신 방식이 예컨데 WIFI인 경우, 디스플레이 장치의 IP 정보 일 수 있다. 조정 설정 정보는 사용자에 의해 선택된 모드를 표시하는 정보일 수 있다. 조정 설정 정보에 포함 된 #는 화질을 측정한 횟수를 표시하는 정보일 수 있다. 도 13a 내지 도 13d에서는, 보상 어플리케이션을 실행하여, 디스플레이 장치를 보상하는 것으로 설명하였 으나, 도 13a 내지 도 13d는 일 예일뿐이며 이에 한정되지 않는다. 도 14는 다양한 실시예에 따라, 전자 장치에서 디스플레이 장치의 영상 보상을 위한 동작 방법을 설명하기 위한 흐름도를 도시하는 도면이다. 도 14의 실시 예는, 도 15, 도 16a 내지 16f, 도 17a 내지 17f 및 도 18 의 실시 예를 참조하여 더욱 상세하게 설명하도록 한다. 도 15는 다양한 실시예에 따라, 전자 장치에서 디스플레이 장치 의 영상 보상을 위한 복수의 영상 보상 모드를 설명하기 위한 도면이고, 도 16a 내지 16f 는 다양한 실시예에 따라, 전자 장치에서 디스플레이 장치의 영상 보상을 위한 제1 영상 보상 모드를 설명하기 위한 도면들이고, 도 17a 내지 17f 는 다양한 실시예에 따라, 전자 장치에서 디스플레이 장치의 영상 보상을 위한 제2 영상 보상 모 드를 설명하기 위한 도면들이고, 도 18은 다양한 실시예에 따라, 전자 장치에서 디스플레이 장치의 영상 보상을 위한 제3 영상 보상 모드를 설명하기 위한 도면이다. 도 14에서의 동작들은 순서가 제한되지는 않으며, 인접하는 두 개의 동작 사이에 다른 동작이 더 수행될 수도 있다. 아울러, 도 14의 동작들 중 적어도 일부가 생략될 수도 있다. 본 발명에서, 전자 장치가 특정 동작 을 수행한다는 표현은, 전자 장치의 프로세서가 특정 동작을 수행하거나, 프로세서가 다른 하드 웨어로 하여금 특정 동작을 수행하도록 제어함을 의미할 수 있다. 또는, 전자 장치가 특정 동작을 수행한 다는 표현은, 메모리에 저장된 인스트럭션들이 실행됨에 따라, 프로세서 또는, 다른 하드웨어가 특정 동작을 수행함을 의미할 수 있으며, 메모리에 특정 동작 수행을 야기하도록 하는 인스트럭션들이 저장됨을 의미할 수도 있다. 다양한 실시예에 따라, 전자 장치(예: 프로세서)는, 1401 동작에서, 보상 어플리케이션을 실행할 수 있다. 예를 들어, 전자 장치는 대기 화면에 표시된 적어도 하나의 어플리케이션들 나타내는 적어도 하나의 아이콘 중 디스플레이 장치의 영상을 보상하기 위한 보상 어플리케이션을 나타내는 아이콘의 선택을 확인하면, 상기 보상 어플리케이션을 실행할 수 있다. 다양한 실시예에 따라, 전자 장치(예: 프로세서)는, 1403 동작에서, 복수의 영상 보상 모드를 표시할 수 있다. 전자 장치는, 보상 어플리케이션의 실행에 따라, 사용자에 의해 선택될 수 있는 디스플레이 장치 의 영상 보상을 위한 제1 영상 보상 모드, 제2 영상 보상 모드 및 제3 영상 보상 모드를 포함하는 복수의 영상 보상 모드를 제공할 수 있다. 상기 복수의 영상 보상 모드들 각각은 서로 다른 영상 보상 시간과, 일부 또는 전체가 다른 영상 보상 방법을 포함할 수 있다. 상기 복수의 영상 보상 모드 중 상기 제1 영상 보상 모드는 제1 영상 보상 시간 동안 제1 영상 보상 방법으로 디스플레이 장치의 영상을 보상할 수 있다. 상기 복수의 영상 보상 모드 중 상기 제2 영상 보상 모드는 상기 제1 영상 보상 시간과 상이한 제2 영상 보상 시간 동안 제2 영상 보상 방법으로 디스플레이 장치의 영상을 보상할 수 있으며, 상기 제2 영상 보상 방법은 상기 제1 영상 보상 방법의 일부 또는 전체를 포함하거나, 또는 상기 제1 영상 보상 방법과 완전히 상이할 수 있다. 상기 복수의 영상 보상 모드 중 상기 제3 영상 보상 모드는 상기 제1 영상 보상 시간 및 상기 제2 영상 보상 시간과 상이한 제3 영상 보상 시간 동안 제3 영상 보상 방법으로 디스플레이 장치의 영상을 보상할 수 있으며, 상기 제3 영상 보상 방법은 상기 제1 영상 보 상 방법 및/또는 상기 제2 영상 보상 방법의 일부 또는 전체를 포함하거나, 또는 상기 제1 영상 보상 방법 및/또는 상기 제2 영상 보상 방법과 완전히 상이할 수 있다. 상기 제1 영상 보상 모드의 제1 영상 보상 방법, 상기 제2 영상 보상 모드의 제2 영상 보상 방법, 및 상기 제3 영상 보상 모드의 제3 영상 보상 방법은, 디스플레이 장치의 영상 보상을 위한 화질 조정 항목의 종류 및/또는 개수가 서로 상이하거나 일부 동일 할 수 있다. 상기 디스플레이 장치의 영상 보상을 위한 화질 조정 항목은 예 를 들어, 화이트 밸런스(white balance), 그레이스케일 선형성(grayscale linearity), 감마(gamma), 색도 (chromaticity), 및/또는 HDR(high dynamic range) 신호의 EOTF (Electro-optic transfer function))를 포함 할 수 있다. 상기 디스플레이 장치의 영상 보상을 위한 화질 조정 항목은 디스플레이 장치에서 디스플레이 장치의 영상 보상을 위해 제공하는 화질 조정 항목과 동일할 수 있다. 상기 복수의 영상 보상 모드들 중 제2 영상 보상 모드가 디폴트 보상 모드로 설정되어 있는 경우, 상기 복수의 영상 보상 모드들 중 상기 제1 영상 보상 모드는, 상기 제2 영상 보상 모드의 제2 영상 보상 시간 보다 짧은 영 상 보상 시간을 가지는 제1 영상 보상 시간 동안 상기 제2 영상 보상 모드의 제2 영상 보상 방법에 포함된 조정 항목 보다 적은 개수의 조정 항목을 포함하는 제1 영상 보상 방법으로 빠르게 디스플레이 장치의 영상을 보상할 수 있는 빠른 보상 모드로 설정될 수 있다. 상기 복수의 영상 보상 모드들 중 상기 제3 영상 보상 모드는, 상기 제2 영상 보상 모드의 제2 영상 보상 시간 보다 긴 영상 보상 시간을 가지는 제3 영상 보상 시간 동안 상기 제2 영상 보상 모드의 제2 영상 보상 방법에 포함된 조정 항목 보다 많은 개수의 조정 항목을 포함하는 제3 영상 보 상 방법으로 전문적으로 디스플레이 장치의 영상을 보상할 수 전문적인 보상 모드로 설정될 수 있다. 상기 복수의 영상 모드들 중 상위 영상 모드는 적어도 하나의 하위 영상 모드의 보상 방법을 포함할 수 있다. 예를 들어, 상기 복수의 영상 모드들 중 상위 영상 모드인 상기 제3 영상 보상 모드의 상기 제3 영상 보상 방법 은, 하위 영상 모드인 기 제1 영상 모드의 상기 제1 영상 보상 방법 및 상기 제2 영상 모드의 상기 제2 영상 보 상 방법이 포함될 수 있다. 예를 들어, 상기 복수의 영상 모드들 중 상위 영상 모드인 상기 제2 영상 보상 모드 의 상기 제2 영상 보상 방법은 하위 영상 모드인 상기 제1 영상 모드의 상기 제1 영상 보상 방법이 포함될 수 있다. 예를 들어, 도 15를 참조하면, 전자 장치는 보상 어플리케이션의 실행을 기반으로, 전자 장치의 디스플레 이에 제1 영상 보상 모드(예: Quick mode), 제2 영상 보상 모드(예: Basic mode) 및 제3 영상 보 상 모드(예: Professional mode)를 포함하는 복수의 영상 보상 모드를 표시할 수 있다. 다양한 실시예에 따라, 전자 장치(예: 프로세서)는, 1405 동작에서, 복수의 영상 보상 모드 중 제1 영상 모드(예: 도 15의 Quick mode) 의 선택을 확인하면, 1407동작에서 디스플레이 장치에 대한 제1 영상 보상 동작을 수행할 수 있다. 전자 장치는, 제1 영상 모드(예: 도 15의 Quick mode)의 선택을 기반 으로, 제1 영상 보상 동작을 수행하기 위한 제1 영상 보상 모드로 전환할 수 있다. 전자 장치는, 상기 복수의 영상 보상 모드에서 상기 제1 영상 보상 모드의 선택을 확인하면, 디스플레이 장치의 영상 보상을 위해 전자 장치의 이동을 알리는 가이드 정보(예: 도 13c의 1321)를 전자 장치의 디스플레 이에 표시하고, 전자 장치의 이동에 따라 촬영 조건을 만족하는 경우, 제1 영상 보상 동작을 수행하기 위한 제1 영상 보상 모드로 전환할 수 있다. 전자 장치는, 제1 영상 보상 동작 수행을 위한 제1 영상 보상 모드에서 제1 영상 보상 시간 동안 제1 영상 보상 방법에 포함된 화질 조정 항목으로 디스플레이 장치의 영상을 보상하는 제1 영상 보상을 동작을 수행할 수 있다. 전자 장치는, 상기 제1 영상 보상 모드에서 상기 제1 영상 보상 동작을 수행하는 과정을 시작부터 완료될 때까지 직관적인 UI로 전자 장치의 디스플레이 및/또는 디스플레이 장치에 표시할 수 있다. 전자 장치는, 제1 영상 보상 모드의 선택을 기반으로 전자 장치에서 디스플레이 장치에 대한 제 1 영상 보상 동작을 수행하고, 상기 전자 장치에서 수행되고 있는 상기 디스플레이 장치에 대한 제1 영상 보상 동작을 수행하는 과정을 시작부터 완료될 때까지 직관적인 UI로 전자 장치의 디스플레이에 표시 할 수 있다. 전자 장치는, 제1 영상 보상 모드의 선택의 기반으로 통신이 연결된 디스플레이 장치로 제1 영상 보 상 동작의 수행을 요청하고, 상기 디스플레이 장치로부터 수신되는 디스플레이 장치에 대한 제1 영상 보상 동작 을 수행하는 과정을 시작부터 완료될 때까지 직관적인 UI로 전자 장치의 디스플레이에 표시할 수 있다. 전자 장치는, 제1 영상 보상 모드(예: 도 15의 Quick mode)에서, 제1 영상 보상 시간이 예를 들어 30초로 설정되고, 상기 제1 영상 보상 방법이 예를 들어, 2 포인트(point)의 화이트 밸런스를 화질 조정 항목으 로 포함하는 경우, 30초 동안, 신호 레벨 0 black ~ 255 Full white까지 계조를 2개의 레벨(level)로 나누고 상기 2개의 레벨을 나타내는 2개 포인트(point)의 화이트 밸런스를 보정하면서 디스플레이 장치의 영상을 보상 할 수 있다. 예를 들어, 도 16a 내지 도 16f을 순서적으로 참조하여, 제1 영상 보상 모드(예: Quick mode)에서 수행되는 제1 영상 보상 동작을 설명할 수 있다. 전자 장치는 제1 영상 보상 모드(예: Quick mode)의 선택을 기반으로, 도 16a와 같이 제1 영역에 전 자 장치의 카메라를 통해 촬영된 디스플레이 장치가 화질 조정 항목에 대응되게 출력하는 화질 측정 패턴(예: white 패턴)을 표시하고, 제2 영역에 디스플레이 장치의 제1 영상 보상 동작에 대한 처리 진행률을 표시하고, 제3 영역에 디스플레이 장치의 영상을 보상하기 위한 화질 조정 대상이 색 (color)임을 알 수 있는 색 분포도를 표시하면서, 제1 영상 보상 동작을 시작할 수 있다. 전자 장치는, 상기 제 3 영역의 색 분포도에 디스플레이 장치의 영상에 대한 제1 영상 보상 동작의 완료를 위한 타겟 지점 을 표시할 수 있다. 전자 장치는, 도 16a 내지 도 16c와 같이, 디스플레이 장치에 대한 영상을 보상 하기 전에, 디스플레이 장 치에서 출력하는 화질 측정 패턴(예: RGB패턴 또는 white 패턴)을 촬영하기 위한 전자 장치의 카메라(24 0)에 대한 준비 과정을 나타낼 수 있으며, 전자 장치는, 카메라의 iso, 조리개, 및/또는 셔터 스피드 (shutter speed) 등과 같이 최적의 촬영을 위한 카메라의 최적 dynamic range를 획득하는 과정을 수행할 수 있 다. 전자 장치는, 도 16c와 같이 제3 영역의 색 분포도에 타겟 지점과 함께, 디스플레이 장치 의 영상에 대한 보상 전에 디스플레이 장치에서 출력하는 화질 측정 패턴을 촬영하여 계측된 제1 좌표 지점 과, 디스플레이 장치의 영상에 대한 보상을 위해 제1 영상 보상 모드의 제1 영상 보상 방법에 포함된 화 질 조정 항목(예: 2개 포인트의 화이트 밸런스)에 대응되게 출력하는 화질 측정 패턴(예: white 패턴)을 촬영하 여 계측된 제2 좌표 지점를 표시할 수 있다. 전자 장치는, 도 16d 내지 도 16f와 같이, 디스플레이 장치의 영상에 대한 보상 과정을 통해 디스플레이 장치의 화질이 변화되는 모습을 전자 장치의 디스플레이를 통해 직관적으로 표시할 수 있다. 전자 장치는, 도 16d와 같이, 제2 영역에 화이트 밸러스에 대한 보정을 수행하는 최대 시도 횟수 예를 들어 15회를 표 시하고, 시도 횟수의 수행에 따라 \"0\"부터 \"1\"씩 숫자의 변화를 표시할 수 있으며, 상기 변화의 과정은 전체 \"%\"진행률로도 표시할 수 있다. 상기 최대 시도 횟수의 조정에 따라 제1 영상 보상 동작에 대한 전체 시간이 조 정될 수 있다. 전자 장치는, 도 16d 내지 도 16e와 같이, 제1 영상 보상 동작의 수행에 따라 디스플레이 장치의 화질이 변화되는 모습을 제2 좌표 지점이 타겟 지점이 위치한 방향으로 이동하는 모습으로 나타낼 수 있다. 전자 장치는, 도 6e와 같이, 제1 영상 보상 동작이 완료되면, 제2 영역에 화이트 밸러스에 대한 보 정을 수행하는 최대 시도 횟수(예: 15회)를 모두 수행하였음을 표시하고, 제3 영역의 색 분포도에서는 제 2 좌표 지점이 타겟 지점에 위치하고 있음을 표시하고, 도 16f와 같이, 제1 영상 보상 동작의 완료 를 메시지 알림으로 표시할 수 있다. 도 16a 내지 도 16f에서 타켓 지점은 사각형으로 표시되고 있으나, 형태는 다양하게 표시될 수 있으며, 제1 영상 보상 동작에 대한 전체 시간의 조정에 따라 타켓 지점을 나타내는 사각형의 크기도 달라 질 수 있다. 예를 들어 제1 영상 보상 동작에 대한 전체 시간이 짧아질수록 타켓 지점을 나타내는 사각형의 크 기는 전체 시간에 대응되게 크게 표시될 수 있다. 다양한 실시예에 따라, 전자 장치(예: 프로세서)는, 1409 동작에서, 복수의 영상 보상 모드 중 제2 영상 모드(예: 도 15의 Basic mode) 의 선택을 확인하면, 1411동작에서 디스플레이 장치에 대한 제2 영상 보상 동작을 수행할 수 있다. 전자 장치는, 제2 영상 모드(예: 도 15의 Basic mode)의 선택에 따라 제2 영상 보상 동작을 수행하기 위한 제2 영상 보상 모드로 전환할 수 있다. 전자 장치는, 상기 복수의 영상 보상 모드에서 상기 제2 영상 보상 모드의 선택을 확인하면, 디스플레이 장치의 영상 보상을 위해 전자 장치의 이동을 알리는 가이드 정보(예: 도 13c의 1321)를 전자 장치의 디스플레 이에 표시하고, 전자 장치의 이동에 따라 촬영 조건을 만족하는 경우, 제2 영상 보상 동작을 수행하기 위한 제2 영상 보상 모드로 전환할 수 있다.전자 장치는, 제2 영상 보상 동작 수행을 위한 제2 영상 보상 모드에서 제2 영상 보상 시간 동안 제2 영상 보상 방법에 포함된 화질 조정 항목으로 디스플레이 장치의 영상을 보상하는 제2 영상 보상을 동작을 수행할 수 있다. 전자 장치는, 상기 제2 영상 보상 모드에서 상기 제2 영상 보상 동작을 수행하는 과정을 시작부터 완료될 때까지 직관적인 UI로 전자 장치의 디스플레이 및/또는 디스플레이 장치에 표시할 수 있다. 전자 장치는, 제2 영상 보상 모드의 선택에 따라 전자 장치에서 디스플레이 장치에 대한 제2 영 상 보상 동작을 수행하고, 상기 전자 장치에서 수행되고 있는 상기 디스플레이 장치에 대한 제1 영상 보상 동작을 수행하는 과정을 시작부터 완료될 때까지 직관적인 UI로 전자 장치의 디스플레이에 표시할 수 있다. 전자 장치는, 제2 영상 보상 모드의 선택에 따라 통신이 연결된 디스플레이 장치로 제2 영상 보상 동 작의 수행을 요청하고, 상기 디스플레이 장치로부터 수신되는 디스플레이 장치에 대한 제2 영상 보상 동작을 수 행하는 과정을 시작부터 완료될 때까지 직관적인 UI로 전자 장치의 디스플레이에 표시할 수 있다. 전자 장치는, 제2 영상 보상 모드(예: 도 15의 Basic mode)에서, 제2 영상 보상 시간이 예를 들어 180초 로 설정되고, 상기 제2 영상 보상 방법이 예를 들어, 2개 포인트(point)의 화이트 밸런스, 20개 포인트(point) 의 화이트 밸런스, 그레이스케일 선형성(grayscale linearity) 및 감마(gamma)를 화질 조절 항목으로 포함하는 경우, 신호 레벨 0 black ~ 255 Full white까지 계조를 2개의 레벨(level)로 나누고 상기 2개의 레벨을 나타내 는 2개의 포인트(point) 각각에 대한 화이트 밸런스를 보정하고, 신호 레벨 0 black ~ 255 Full white까지 계조 를 20개의 레벨(level)로 나누고 상기 20개의 레벨을 나타내는 20개의 포인트(point) 각각에 대한 화이트 밸런 스를 보정하고, 그레이스케일 선형성을 위해 20개 포인트(point)에 대해서 계조가 구별되도록 보정하고, 감마를 보정하면서 디스플레이 장치의 영상을 보상 수 있다. 예를 들어, 도 17a 내지 도 17f를 순서적으로 참조하여, 제2 영상 보상 모드(예: Basic mode)에서 제2 영상 보 상 동작을 설명할 수 있다. 전자 장치는, 먼저 도16a 내지 도 16f와 같이 제1 영상 보상 모드(예: Quick mode)와 동일하게 2개 포인트 (point)의 화이트 밸러스를 보정할 수 있다. 전자 장치는, 2개 포인트(point)의 화이트 밸러스에 대한 보 정이 완료되면, 도 17a 내지 도 17e와 같이, 20개 포인트(point)의 화이트 밸러스에 보정과 감마에 대한 보정 동작을 수행할 수 있다. 전자 장치는, 제2 영상 보상 모드에서, 도16a 내지 도 16f와 같이 2개 포인트 (point)의 화이트 밸러스에 대한 보정 동작에 대한 표시를 생략하고, 도 17a 내지 도 17e와 같이, 20개 포인트 (point)의 화이트 밸러스에 보정과 감마에 대한 보정 동작을 전자 장치에 UI로 표시할 수 있다. 전자 장치는, 도 17a 내지 도 17e와 같이, 제1 영역에 전자 장치의 카메라를 통해 촬영된 디스 플레이 장치가 화질 조정 항목에 대응되게 출력하는 화질 측정 패턴(예: white 패턴)을 표시하고, 제2 영 역에 디스플레이 장치의 제2 영상 보상 동작에 대한 처리 진행률을 표시하고, 제3 영역에 감 마 곡선과 점을 이용하여 보정 진행 상태를 표시하는 것으로, 20개 포인트(point)의 화이트 밸런스의 보정 상태 를 감마 곡선 따라서 점으로 표시하면서 현재 보정 상태를 직관적인 UI로 표시할 수 있다. 전자 장치는 제 5 영역에 보정 진행 상태를 추가적인 UI로 표시하기 위한 RGB바를 표시할 수 있다. 전자 장치는, 상 기 제4 영역에서 감마 곡선에 점이 표시될 때 마다 RGB 각 신호를 얼마나 조정해서 현재 원하는 타겟(예: 감마 곡선)으로 보정 되었는지에 대한 시각적인 이해를 위해 RGB바를 상기 제5 영역에 표시할 수 있다. 전자 장치는, 상기 제5 영역에서 RGB바의 우측에 실제 색 온도(color temperature)와 색 좌표 x, y 를 실제 값으로 산출하여 표시할 수 있다. 전자 장치는, 도 17e와 같이, 20개 포인트(point)의 화이트 밸런스의 보정이 완료되면, 도 17f와 같이, 뷰 리포트(view report)를 표시할 수 있다. 전자 장치는, 뷰 리포트(view report)에서 제2 영상 보상 모드 (예: Basic mode)의 제2 영상 보상 방법에 포함된 화질 조정 항목들에 대한 보정 결과 항목들(예: Gamma, RGB balance 및 DeltaE2000)를 표시할 수 있다. 예를 들어 감마(Gamma)는 기준점(target)과 보정 결과(171 3)의 차이로 정확도를 표현하고, DeltaE2000은 수치가 작을수록 좋은 망소 특성을 가지는 수치를 나타낼 수 있 다. 다양한 실시예에 따라, 전자 장치(예: 프로세서)는, 1413 동작에서, 복수의 영상 보상 모드 중 제3 영상 모드(예: 도 15의 Professional mode)의 선택을 확인하면, 1415동작에서 디스플레이 장치에 대한 제 3 영상 보상 동작을 수행할 수 있다. 전자 장치는, 제3 영상 모드(예: 도 15의 Professional mode)의 선택에 따라 제3 영상 보상 동작을 수행하기 위한 제3 영상 보상 모드로 전환할 수 있다. 전자 장치는, 상기 복수의 영상 보상 모드에서 상기 제3 영상 보상 모드의 선택을 확인하면, 디스플레이 장치의 영상 보상을 위해 전자 장치의 이동을 알리는 가이드 정보(예: 도 13c의 1321)를 전자 장치의 디스플레 이에 표시하고, 전자 장치의 이동에 따라 촬영 조건을 만족하는 경우, 제3 영상 보상 동작을 수행하기 위한 제3 영상 보상 모드로 전환할 수 있다. 전자 장치는, 제3 영상 보상 동작 수행을 위한 제3 영상 보상 모드에서 제3 영상 보상 시간 동안 제3 영상 보상 방법에 포함된 화질 조정 항목으로 디스플레이 장치의 영상을 보상하는 제3 영상 보상을 동작을 수행할 수 있다. 전자 장치는, 상기 제3 영상 보상 모드에서 상기 제3 영상 보상 동작을 수행하는 과정을 시작부터 완료될 때까지 직관적인 UI로 전자 장치의 디스플레이 및/또는 디스플레이 장치에 표시할 수 있다. 전자 장치는, 제3 영상 보상 모드의 선택에 따라 전자 장치에서 디스플레이 장치에 대한 제3 영 상 보상 동작을 수행하고, 상기 전자 장치에서 수행되고 있는 상기 디스플레이 장치에 대한 제1 영상 보상 동작을 수행하는 과정을 시작부터 완료될 때까지 직관적인 UI로 전자 장치의 디스플레이에 표시할 수 있다. 전자 장치는, 제3 영상 보상 모드의 선택에 따라 통신이 연결된 디스플레이 장치로 제3 영상 보상 동 작의 수행을 요청하고, 상기 디스플레이 장치로부터 수신되는 디스플레이 장치에 대한 제3 영상 보상 동작을 수 행하는 과정을 시작부터 완료될 때까지 직관적인 UI로 전자 장치의 디스플레이에 표시할 수 있다. 전자 장치는, 제3 영상 보상 모드(예: 도 15의 Professional mode)에서, 제3 영상 보상 시간이 예 를 들어 15분으로 설정되고, 상기 제3 영상 보상 방법이 예를 들어, 2개 포인트(point)의 화이트 밸런스, 20개 포인트(point)의 화이트 밸런스, 그레이스케일 선형성(grayscale linearity), 감마(gamma), 색도 (chromaticity), 및 HDR (high dynamic range) 신호의 EOTF (Electro-optic transfer function)를 화질 조절 항목으로 포함하는 경우, 신호 레벨 0 black ~ 255 Full white까지 계조를 2개의 레벨(level)로 나누고 상기 2 개의 레벨을 나타내는 2개의 포인트(point) 각각에 대한 화이트 밸런스를 보정하고, 신호 레벨 0 black ~ 255 Full white까지 계조를 20개의 레벨(level)로 나누고 상기 20개의 레벨을 나타내는 20개의 포인트(point) 각각 에 대한 화이트 밸런스를 보정하고, 그레이스케일 선형성을 위해 20개 포인트(point)에 대해서 계조가 구별되도 록 보정하고, 감마를 보정하고, 색도(chromaticity)를 보정하고, HDR (high dynamic range) 신호의 EOTF (Electro-optic transfer function)를 보정하면서 디스플레이 장치의 영상을 보상 수 있다. 전자 장치는, 제3 영상 보상 모드(예: Professional mode)의 선택을 기반으로, 예를 들어 도 18과 같이, 화질 조절 항목에 대한 추가적인 설정 메뉴 화면을 제공할 수 있다. 도 18과 같은 설정 메뉴 화면은, 밝기(Luminance) 항목, 감마(Gamma)항목 및 패턴 크기(Pattern size)항목을 포함할 수 있으며, 전자 장치는, 상기 밝기(Luminance) 항목에서 사용자에 의해 밝기가 선택되면, 디스플 레이 장치의 영상을 보상하는 과정에서 디스플레이 장치가 상기 사용자에 의해 선택된 밝기로 표시할 수 있도록 제어할 수 있다. 전자 장치는, 제2 영상 보상 모드(예: Basic mode)와 같이 방송표준 또는 기타 표준으로 고정된 감마 커브(Gamma curve)에 맞추는 보정 과정을 수행하는 것과는 달리, 사용자가 감마 커브(Gamma curv e)의 종류를 선택할 수 있도록 상기 감마(Gamma)항목을 제공할 수 있다.전자 장치는, 제2 영상 보상 모드 (예: Basic mode)와 같이 디스플레이에 풀(full)로 표시되는 패턴인 Full Raster 패턴을 사용하는 것과는 달리 사용자가 특정 크기 패턴을 선택할 수 있도록 패턴 크기(Pattern size)항목을 제공할 수 있다. 전자 장치 는, 도 18과 같이 설정 메뉴 화면에 HDR 신호를 조정할 수 있는 항목 및 디스플레이 장치에서 출력되는 화질 측 정 패턴을 촬영할 수 있는 전자 장치의 카메라의 설정 값을 제어할 수 있는 항목을 추가적으로 제공할 수 있다. 전자 장치는, 도 18과 같은 설정 메뉴 화면에서 설정이 완료되면, 제2 영상 보상 모드(예: Basic mode)와 동일하게 제2 영상 보상 동작을 수행할 수 있다. 전자 장치는 상기 제2 영상 보상 동작을 수행하는 동안, 도 18과 같은 설정 메뉴 화면의 밝기(Luminance)항목에서 사용자에 의해 선택된 밝기를 추가로 조정하고, 감마 (Gamma)항목에서 사용자에 의해 선택된 감마 커브(Gamma Curve)의 형태로 변경하고, 패턴 크기 항목에서 사용자 에 의해 선택된 패턴 크기(size)를 변경하여 표시할 수 있다. 도 19a은 다양한 실시예에 따라, 디스플레이 장치의 구성을 간략히 나타낸 블록도를 도시하는 도면이다. 도 19b 는 다양한 실시예에 따라, 디스플레이 장치의 메모리에 저장된 인공지능 모델을 나타낸 블록도를 도시하는 도면이다. 도 20는 다양한 실시예에 따라, 디스플레이 장치에서 사용자의 피드백을 요청하는 메시지를 출력을 도시 하는 도면이다. 도 19a에 도시된 바와 같이, 디스플레이 장치는 프로세서, 통신 회로 및 디스플레이 장치 를 포함할 수 있다. 디스플레이 장치는 화면을 표시하는 패널을 포함하는 전자 장치(예: 스마트TV)일 수 있다. 예를 들어, 디 스플레이 장치에 포함된 패널은 LCD(Liquid Crystal Display) 패널이거나 또는 LED(Light Emitting Diode), OLED(Organic Light Emitting Diode), CCFL(cold cathode fluorescent lamp) 등 다양한 발광체를 포 함하는 패널 중 하나일 수 있다. 패널들은 디지털 TV, 3D-TV, 스마트 TV, LED TV, OLED TV, 플라즈마 TV 등으 로 구현될 수 있고, 평면(flat) 디스플레이 장치뿐만 아니라, 곡률을 가지는 화면인 곡면(curved) 디스플레이 장치 또는 곡률을 조정 가능한 가변형(flexible) 디스플레이 장치일 수 있다. 프로세서는 디스플레이 장치의 전반적인 동작을 제어할 수 있다. 프로세서는, 예를 들면, 소 프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치의 적어도 하나의 다른 구성요소 (예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이터 처리 또는 연산을 수행할 수 있다. 일실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세서는 다른 구성요소(예: 센서 모듈 또는 통신 회로)로부터 수신된 명령 또는 데이터를 휘발성 메모리에 저장하고, 휘발성 메모리에 저장된 명령 또 는 데이터를 처리하고, 결과 데이터를 비휘발성 메모리에 저장할 수 있다. 일실시예에 따르면, 프로세서 는 메인 프로세서 (예: 중앙 처리 장치 또는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 디스플레이 장치 가 메인 프로세서 및 보조 프로세서를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용 하거나, 지정된 기능에 특화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로 서 구현될 수 있다. 특히, 프로세서는 메모리에 저장된 적어도 하나의 명령어를 실행함으로써, 컨텍스트 정보를 판단하 고, 컨텍스트 정보에 대응하는 화질 설정 정보를 판단할 수 있다. 컨텍스트 정보는, 시간 정보, 위치 정보, 날 씨 정보, 환경 정보, 선호도 정보 및 컨텐츠 정보, 디스플레이 장치의 특징 정보 중 적어도 하나일 수 있다. 시 간 정보는 디스플레이 장치가 화면을 출력하는 날짜, 요일, 시간과 관련된 정보일 수 있다. 위치 정보는 디스플 레이 장치가 위치하는 국가, 위도, 적도와 관련된 정보일 수 있다. 환경 정보는 디스플레이 장치가 화면을 출력 하는 동안의 디스플레이 장치 주변의 밝기와 관련된 정보로써, 예를 들어 디스플레이 장치를 시청할 수 있는 댁 내 실내 조명 정보일 수 있다. 선호도 정보는 디스플레이 장치가 출력하는 화면을 표시하는 시간대, 사용자가 설정한 화질 설정 정보, 출력하는 화면의 소스(예를 들어, cable, mirroring, OTT, Apps))에 대한 정보, 사용자 의 지역에서 선호하는 화질 정보 및/또는 디스플레이 장치가 위치하는 지역의 사람들이 선호하는 화질 정보 일 수 있다. 컨텐츠 정보는 사용자가 선호하는 컨텐츠의 종류에 관한 정보일 수 있다. 디스플레이 장치의 특징 정 보는 디스플레이의 모델 정보 및 상기 모델 정보에 대응하는 화질 관련 정보 일 수 있다 프로세서는 메모리에 저장된 인공지능 모델을 이용하여 컨텍스트 정보에 대응하는 화질 설정 정보 를 판단할 수 있다. 이때, 인공지능 모델은 디스플레이 장치에 입력된 사용자 인터렉션, 사용자의 화질 설정 히스토리, 디스플레이 장치가 센싱한 환경 정보 및 외부 장치(예: 전자 장치 또는 서버)로부터 수신 된 정보 중 적어도 하나를 바탕으로 학습되는 것일 수 있다. 구체적으로, 프로세서는 컨텍스트 정보를 인 공지능 모델에 입력하여 컨텍스트 정보에 대응하는 화질 설정 정보를 획득할 수 있다. 구체적으로, 도 19b를 참조하면, 디스플레이 장치의 메모리에 저장된 인공지능 모델은 학습부 및 획득부를 포함할 수 있다. 프로세서는 메모리에 저장된 학습부를 실행하여, 컨텍스트 정보를 생성하는 기준을 갖도록 학습시킬 수 있다. 학습부는 사용자의 인터렉션, 사용자의 화질 설정 히스토리, 디스플레이 장치가 센싱한 센싱 정보, 외부 장치로부터 수신된 정보 중 적어도 하나를 바 탕으로 컨텍스트 정보 등을 획득할 수 있다. 예를 들어, 학습부는 디스플레이 장치에서 출력되는 화면의 모드 별 사용자의 화질 설정 정보, 출력되는 화면의 소스(예를 들어, cable, mirroring, OTT, Apps)에 대한 정보, 디스플레이 장치의 모델 및 화질 관련 정보, 디스플레이 장치의 주변 밝기, 색도 분포 등을 나타내는 환경 정보, 디스플레이 장치의 이용 시간대, 디스플레이 장치의 위치(국가, 도시, 위도, 적도 등), 디스플레이 장치와 연결된 전자 장치에서 센싱된 주변의 조도, 색도 정보, 출력되는 화 면의 컨텐츠 종류를 판단하고, 이에 따라 컨텍스트 정보를 생성할 수 있다.프로세서는 메모리에 저장된 획득부를 실행하여, 인공지능 에이전트가 입력 데이터인 키워드 에 기초하여 화질 정보를 획득할 수 있다. 획득부는 학습된 인공지능 모델을 이용하여 소정의 입력 데이 터로부터 사용자의 성향 정보 또는 선호 정보를 반영하여 화질 정보를 획득할 수 있다. 획득부는 미리 설 정된 기준에 따라 소정의 입력 데이터를 획득하고, 획득된 입력 데이터를 입력 값으로 하여 인공지능 모델에 적 용함으로써, 소정의 입력 데이터에 기초한 소정의 출력을 판단할 수 있다(또는, 추정(estimate)할 수 있다). 또 한, 획득된 입력 데이터를 입력 값으로 인공 지능 모델에 적용하여 출력된 결과 값은, 인공지능 모델을 갱신하 는데 이용될 수 있다. 한편, 학습부의 적어도 일부 및 획득부의 적어도 일부는, 소프트웨어 모듈로 구현되거나 적어도 하 나의 하드웨어 칩 형태로 제작되어 디스플레이 장치에 탑재될 수 있다. 예를 들어, 학습부 및 획득 부 중 적어도 하나는 인공지능(AI; artificial intelligence)을 위한 전용 하드웨어 칩 형태로 제작될 수도 있고, 또는 기존의 범용 프로세서(예: CPU 또는 application processor) 또는 그래픽 전용 프로세서(예: GPU)의 일부로 제작되어 전술한 서버에 탑재될 수도 있다. 이때, 인공 지능을 위한 전용 하드웨어 칩은 확률 연 산에 특화된 전용 프로세서로서, 기존의 범용 프로세서보다 병렬처리 성능이 높아 기계 학습과 같은 인공 지능 분야의 연산 작업을 빠르게 처리할 수 있다. 학습부 및 획득부가 소프트웨어 모듈(또는, 인스트럭 션(instruction) 포함하는 프로그램 모듈)로 구현되는 경우, 소프트웨어 모듈은 컴퓨터로 읽을 수 있는 판독 가 능한 비일시적 판독 가능 기록매체(non-transitory computer readable media)에 저장될 수 있다. 이 경우, 소 프트웨어 모듈은 OS(Operating System)에 의해 제공되거나, 소정의 어플리케이션에 의해 제공될 수 있다. 또는, 소프트웨어 모듈 중 일부는 OS(Operating System)에 의해 제공되고, 나머지 일부는 소정의 어플리케이션에 의해 제공될 수 있다. 또한, 학습부 및 획득부는 하나의 서버에 탑재될 수도 있으며, 또는 별개의 서버들에 각각 탑재될 수도 있다. 예를 들어, 학습부 및 획득부 중 하나는 제1 서버에 포함되고, 나머지 하나는 제2 서버 에 포함될 수 있다. 또한, 학습부 및 획득부는 유선 또는 무선으로 통하여, 학습부가 구축한 모델 정보를 획득부로 제공할 수도 있고, 획득부로 입력된 데이터가 추가 학습 데이터로서 학습부 로 제공될 수도 있다. 또한, 인공지능 모델은 모델의 적용 분야, 학습의 목적 또는 장치의 컴퓨터 성능 등을 고려하여 구축될 수 있다. 인공지능 모델은, 예를 들어, 신경망(Neural Network)을 기반으로 하는 모델일 수 있다. 인공지능 모델은 인간의 뇌 구조를 컴퓨터 상에서 모의하도록 설계될 수 있다. 인공지능 모델은 인간의 신경망의 뉴런(neuron)을 모의하는, 가중치를 가지는 복수의 네트워크 노드들을 포함할 수 있다. 복수의 네트워크 노드들은 뉴런이 시냅 스(synapse)를 통하여 신호를 주고 받는 시냅틱(synaptic) 활동을 모의하도록 각각 연결 관계를 형성할 수 있다. 인공지능 모델은, 일 예로, 신경망 모델, 또는 신경망 모델에서 발전한 딥 러닝 모델을 포함할 수 있다. 딥 러닝 모델에서 복수의 네트워크 노드들은 서로 다른 깊이(또는, 레이어)에 위치하면서 컨볼루션 (convolution) 연결 관계에 따라 데이터를 주고 받을 수 있다. 예컨대, DNN(Deep Neural Network), RNN(Recurrent Neural Network), BRDNN(Bidirectional Recurrent Deep Neural Network), LSTM(Long Short Term Memory network)과 같은 모델이 인공지능 모델로서 사용될 수 있으나, 이에 한정되지 않는다. 프로세서는 학습을 통해 컨텍스트 정보를 생성한 인공 지능 모델을 기반으로, 디스플레이 장치에서 화질 조정을 하지 않고 시청하는 사용자에게 사용자의 시청 환경 정보에 기반한 최적의 화질 설정 정보를 추천 할 수 있다. 프로세서는 사용자가 선택한 디스플레이 장치의 화질 설정 정보를 기반으로, 최적의 화질 설 정 정보를 다르게 추천할 수 있다. 예를 들어, 프로세서는, 사용자가 디스플레이 장치에서 제1 화질 설정 정보를 선택하였으나, 디스플레이 장치에 대한 화질 조정을 하지 않고 시청하는 경우, 사용자의 시청 환경 또는 사용자가 시청하고 있는 컨텐츠의 종류에 따라 제1 화질 설정 정보가 선택된 디스플레이 장치의 화질을 조정할 수 있는 글로벌 설정 값(global setting 값을 최적의 화질 설정 정보로 추천할 수 있다. 프로세서는 사용자 시청 환경에 대응하는 컨텍스트 정보를 입력 데이터로 인공지능 모델에 입력하 고, 상기 입력 데이터를 기반으로 인공 지능 모델로부터 출력되는 화질 설정 정보를 사용자의 시청 환경 정보에 기반한 최적의 화질 설정 정보로 자동 추천할 수 있다. 인공지능 모델은 사용자 시청 환경 정보에 대응하는 컨텍스트 정보로써, 시간 정보(예: 디스플레이 장치 의 화면 출력 시간), 위치 정보(예: 디스플레이 장치가 위치하는 지역 정보), 환경 정보(예: 디스플레이 장치가 위치하는 댁내 실내 조명 정보), 선호도 정보(예: 디스플레이 장치가 위치하는 지역의 사람들이 선호하는 화질 정보), 컨텐츠 정보(예: 사용자가 시청하고자 하는 컨텐츠 정보) 및 디스플레이 장치의 특징 정보(예: 디스플레이의 모델 정보) 중 적어도 하나의 정보가 입력 데이터로 입력되면, 상기 적어도 하나의 입력 데이터를 조합하 고, 복수의 화질 설정 정보 중 상기 조합된 적어도 하나의 입력 데이터에 대응하는 화질 설정 정보를 시청 환경 정보에 기반한 최적의 화질 설정 정보로 출력할 수 있다. 인공지능 모델은 사용자의 시청 환경에 따라 복수의 사용자 그룹들을 설정하고, 복수의 사용자 그룹들에 대응하는 복수의 화질 설정 정보를 설정할 수 있다. 인공 기능 모델은 사용자의 시청 환경에 대응하는 컨텍스트 정보가 입력 데이터를 입력되면, 복수의 사용 자 그룹들(예: 제1 사용자 그룹 내지 제5 사용자 그룹) 중 상기 입력 데이터가 포함되는 하나의 사용자 그룹(예: 제1 사용자 그룹)을 결정하고, 복수의 화질 설정 정보(예: 제1 화질 설정 정보 내지 제5 화질 설정 정 보) 중 상기 결정된 사용자 그룹(예: 제1 사용자 그룹)에 대응하는 화질 설정 정보(예: 제1 화질 설정 정보)를 사용자의 현재 시청 환경 정보에 기반한 최적의 화질 정보로 출력 할 수 있다. 프로세서는 인공지능 모델를 기반으로, 입력 데이터로 입력되는 컨텐스트 정보에 따라 사용자에게 case-by-case로 화질 설정 정보를 자동으로 추천하고, 상기 추천된 화질 설정 정보에 대한 사용자의 피드백(예: 만족도 점수)과 사용자의 선택 빈도를 기반으로 인공지능 모델이 학습하게 함에 따라, 이후 댁내 사용자 를 기반한 최적의 화질 설정 정보를 추천할 수 있다. 프로세서는 사용자의 피드백과 사용자의 선택 빈도를 기반으로 이후 화질 정보를 추천할 때, 기본 화질 설정 정보를 위한 제1 모드(예: picture mode) 또는 세부 화질 설정 정보를 위한 제2 모드(예: expert settings mode)로 추천 할 수 있다. 통신 회로는 외부 전자 장치와 통신을 수행할 수 있다. 통신 회로는 외부 장치와 통신을 수행하기 위한 구성이다. 한편, 통신 회로가 외부 장치와 통신 연결되는 것은 제3 기기(예로, 중계기, 허브, 엑세 스 포인트, 서버 또는 게이트웨이 등)를 거쳐서 통신하는 것을 포함할 수 있다. 무선 통신은, 예를 들면, LTE, LTE-A(LTE Advance), CDMA(code division multiple access), WCDMA(wideband CDMA), UMTS(universal mobile telecommunications system), WiBro(Wireless Broadband), 또는 GSM(Global System for Mobile Communications) 등 중 적어도 하나를 사용하는 셀룰러 통신을 포함할 수 있다. 일 실시예에 따르면, 무선 통신 은, 예를 들면, WiFi(wireless fidelity), 블루투스, 블루투스 저전력(BLE), 지그비(Zigbee), NFC(near field communication), 자력 시큐어 트랜스미션(Magnetic Secure Transmission), 라디오 프리퀀시(RF), 또는 보디 에 어리어 네트워크(BAN) 중 적어도 하나를 포함할 수 있다. 유선 통신은, 예를 들면, USB(universal serial bus), HDMI(high definition multimedia interface), RS-232(recommended standard232), 전력선 통신, 또는 POTS(plain old telephone service) 등 중 적어도 하나를 포함할 수 있다. 무선 통신 또는 유선 통신이 수행되 는 네트워크는 텔레커뮤니케이션 네트워크, 예를 들면, 컴퓨터 네트워크(예: LAN 또는 WAN), 인터넷, 또는 텔레 폰 네트워크 중 적어도 하나를 포함할 수 있다. 또한, 통신 회로는 외부의 서버와 통신을 수행하여 인공지능 에이전트 서비스를 제공할 수 있다. 특히, 통신 회로는 외부 서버로 컨텍스트 정보 중 적어도 일부를 전송하고, 컨텍스트 정보에 대응하는 화질 설 정 정보를 수신할 수 있다. 디스플레이는 판단된 화질 설정 정보에 기반하여, 화면이 출력될 수 있다. 도 20은 다양한 실시예에 따라, 디스플레이 장치의 동작 방법을 설명하기 위한 흐름도를 도시하는 도면이고, 도 21은 다양한 실시예에 따라, 디스플레이 장치에서 사용자의 피드백을 요청하는 메시지의 출력을 도시하는 도면 이다. 도 20에서의 동작들은 순서가 제한되지는 않으며, 인접하는 두 개의 동작 사이에 다른 동작이 더 수행될 수도 있다. 아울러, 도 20의 동작들 중 적어도 일부가 생략될 수도 있다. 본 개시에서, 디스플레이 장치가 특 정 동작을 수행한다는 표현은, 디스플레이 장치의 프로세서가 특정 동작을 수행하거나, 프로세서 가 다른 하드웨어로 하여금 특정 동작을 수행하도록 제어함을 의미할 수 있다. 또는, 디스플레이 장치 가 특정 동작을 수행한다는 표현은, 메모리에 저장된 인스트럭션들이 실행됨에 따라, 프로세서 또는, 다른 하드웨어가 특정 동작을 수행함을 의미할 수 있으며, 메모리에 특정 동작 수행을 야기 하도록 하는 인스트럭션들이 저장됨을 의미할 수도 있다. 다양한 실시예에 따라서, 디스플레이 장치(예: 프로세서)는, 2001 동작에서, 사용자의 시청 환경에 대응하는 컨텍스트 정보를 입력 데이터로 인공 지능 모델에 입력할 수 있다. 디스플레이 장치는, 디스플 레이 장치의 사용자가 화질을 조정하지 않는 경우, 사용자 시청 환경에 대응하는 컨테스트 정보를 검출할 수 있다. 디스플레이 장치는, 컨텍스트 정보로써, 시간 정보(예: 디스플레이 장치의 화면 출력 시간), 위치 정 보(예: 디스플레이 장치가 위치하는 지역 정보), 환경 정보(예: 디스플레이 장치가 위치하는 댁내 실내 조명 정 보), 선호도 정보(예: 디스플레이 장치가 위치하는 지역의 사람들이 선호하는 화질 정보), 컨텐츠 정보(예: 사 용자가 시청하고자 하는 컨텐츠 정보) 및 디스플레이 장치의 특징 정보(예: 디스플레이의 모델 정보) 중 적어도 하나의 정보를 입력 데이터로 메모리에 포함된 인공지능 모델에 입력할 수 있다. 다양한 실시예에 따라서, 디스플레이 장치(예: 프로세서)는, 2003동작에서, 인공 지능 모델에서 출 력한 화질 설정 정보를 사용자의 시청 환경 정보에 기반한 최적의 화질 설정 정보로 자동 추천할 수 있다. 디스 플레이 장치는, 인공 지능 모델에서 복수의 화질 설정 정보 중 상기 입력 데이터(컨텍스트 정보)에 대응하는 화질 설정 정보를 출력하면, 상기 출력된 화질 설정 정보를 사용자의 현재 시청 환경 정보에 기반한 최적의 화질 설정 정보로 자동 추천할 수 있다. 다양한 실시예에 따라서, 디스플레이 장치(예: 프로세서)는, 2005동작에서, 추천된 화면 화질 정보 가 사용자에 의해 선택되면, 사용자의 피드백을 요청할 수 있다. 디스플레이 장치는, 상기 추천된 화면 화질 정보에 대한 사용자의 피드백(예: 만족도 점수)과 사용자의 선택 빈도를 기반으로 인공지능 모델이 학습하게 함에 따라, 이후 댁내 사용자에게 더욱 최적화된 화질 설정 정보를 제공할 수 있다. 상기 도 21과 같 이, 디스플레이 장치는 디스플레이 장이에서 추천한 화질 설정 정보가 사용자의 의해 선택되는 경 우 사용자의 피드백(예: 사용자의 만족도)를 요청하는 메시지를 디스플레이에 표시할 수 있다. 디 스플레이 장치는 상기 메시지를 통해 사용자의 피드백이 입력되면, 사용자의 피드백(예: 만족도 점 수)를 기반으로 인공지능 모델이 학습하게 함에 따라, 이후 댁내 사용자에게 더욱 최적화된 화질 설정 정 보를 추천할 수 있다. 다양한 실시 예에 따라서, 전자 장치는, 통신 회로, 카메라, 및 적어도 하나의 프로세서를 포함하고, 상기 프로 세서는, 상기 통신 회로를 통해 연결된 디스플레이 장치의 영상을 보상하기 위한 보상 어플리케이션의 실행을 기반으로, 디스플레이 장치의 일부 영역을 촬영할 수 있는 촬영 조건을 만족하도록 전자 장치의 이동을 요청하 는 가이드 정보를 출력하고, 상기 디스플레이 장치의 영상에 대한 보상이 완료되면, 보상 전의 상기 디스플레이 장치의 영상과 보상 후의 상기 디스플레이 장치의 영상을 출력하도록 설정될 수 있다. 다양한 실시 예에 따라서, 상기 프로세서는, 상기 보상 어플리케이션의 실행을 결정하면, 상기 디스플레이 장치 의 영상 보상을 위한 복수의 영상 보상 모드를 출력하고, 상기 복수의 영상 보상 모드 중 영상 보상 모드의 선 택을 확인하면, 디스플레이 장치의 일부 영역을 촬영할 수 있는 촬영 조건을 만족하도록 전자 장치의 이동을 요 청하는 상기 가이드 정보를 출력하도록 설정될 수 있다. 다양한 실시 예에 따라서, 상기 프로세서는, 상기 복수의 영상 보상 모드 중 제1 영상 보상 모드에서 상기 촬영 조건을 만족하면, 제1 영상 시간 동안 제1 영상 보상 방법으로 상기 디스플레이 장치에 대한 영상 보상 동작을 수행하는 과정을 상기 디스플레이를 통해 표시하고, 상기 복수의 영상 보상 모드 중 제2 영상 보상 모드에서 상 기 촬영 조건을 만족하면, 제2 영상 시간 동안 제2 영상 보상 방법으로 상기 디스플레이 장치에 대한 영상 보상 동작을 수행하는 과정을 상기 디스플레이를 통해 표시하고, 상기 복수의 영상 보상 모드 중 제3 영상 보상 모드 에서 상기 촬영 조건을 만족하면, 제3 영상 시간 동안 제3 영상 보상 방법으로 상기 디스플레이 장치에 대한 영 상 보상 동작을 수행하는 과정을 상기 디스플레이를 통해 표시하도록 설정될 수 있다. 다양한 실시 예에 따라서, 상기 제1 영상 보상 시간, 상기 제2 영상 보상 시간, 및 상기 제3 영상 보상 시간은 서로 상이한 시간을 포함할 수 있다. 다양한 실시 예에 따라서, 상기 제1 영상 보상 방법, 상기 제2 영상 보상 방법, 및 상기 제3 영상 보상 방법 각 각은, 디스플레이 장치의 영상 보상을 위한 적어도 하나의 화질 조정 항목을 포함할 수 있다, 다양한 실시 예에 따라서, 상기 적어도 하나의 화질 조정 항목은, 종류 및 개수가 서로 상이하거나 또는 일부 동일하게 상기 제1 영상 보상 방법, 상기 제2 영상 보상 방법, 및 상기 제3 영상 보상 방법 각각에 포함할 수 있다. 다양한 실시 예에 따라서, 상기 프로세서는, 상기 제1 영상 보상 모드에서 상기 촬영 조건을 만족하면, 카메라 를 이용하여 상기 디스플레이 장치의 일부 영역을 포함하는 영상을 획득하고, 상기 획득한 영상을 기반으로 상 기 디스플레이 장치에 대한 영상 보상 동작을 수행하는 과정을 상기 디스플레이를 통해 표시하고, 상기 디스플 레이 장치의 일부 영역은, 상기 제1 영상 보상 방법에 포함된 화질 조절 항목에 대응되는 화질 특정 패턴을 출 력하도록 설정될 수 있다.다양한 실시 예에 따라서, 상기 프로세서는, 상기 제2 영상 보상 모드에서 상기 촬영 조건을 만족하면, 카메라 를 이용하여 상기 디스플레이 장치의 일부 영역을 포함하는 영상을 획득하고, 상기 획득한 영상을 기반으로 상 기 디스플레이 장치에 대한 영상 보상 동작을 수행하는 과정을 상기 디스플레이를 통해 표시하고, 상기 디스플 레이 장치의 일부 영역은, 상기 제2 영상 보상 방법에 포함된 화질 조절 항목에 대응되는 화질 특정 패턴을 출 력하도록 설정될 수 있다. 다양한 실시 예에 따라서, 상기 프로세서는, 상기 제3 영상 보상 모드에서 상기 촬영 조건을 만족하면, 카메라 를 이용하여 상기 디스플레이 장치의 일부 영역을 포함하는 영상을 획득하고, 상기 획득한 영상을 기반으로 상 기 디스플레이 장치에 대한 영상 보상 동작을 수행하는 과정을 상기 디스플레이를 통해 표시하고, 상기 디스플 레이 장치의 일부 영역은, 상기 제3 영상 보상 방법에 포함된 화질 조절 항목에 대응되는 화질 특정 패턴을 출 력하도록 설정될 수 있다. 다양한 실시 예에 따라서, 상기 디스플레이 장치의 일부 영역은, 상기 디스플레이 장치의 영상 보상을 위한 특 정 지점을 포함할 수 있다. 다양한 실시 예에 따라서, 카메라를 포함하는 전자 장치의 동작 방법은, 전자 장치의 통신 회로를 통해 연결된 디스플레이 장치의 영상을 보상하기 위한 보상 어플리케이션의 실행을 기반으로, 디스플레이 장치의 일부 영역 을 촬영할 수 있는 촬영 조건을 만족하도록 전자 장치의 이동을 요청하는 가이드 정보를 출력하는 동작, 및 상 기 디스플레이 장치의 영상에 대한 보상이 완료되면, 보상 전의 상기 디스플레이 장치의 영상과 보상 후의 상기 디스플레이 장치의 영상을 출력하는 동작을 포함할 수 있다. 다양한 실시 예에 따라서, 상기 가이드 정보를 출력하는 동작은, 상기 보상 어플리케이션의 실행을 결정하면, 상기 디스플레이 장치의 영상 보상을 위한 복수의 영상 보상 모드를 출력하는 동작, 및 상기 복수의 영상 보상 모드 중 영상 보상 모드의 선택을 확인하면, 디스플레이 장치의 일부 영역을 촬영할 수 있는 촬영 조건을 만족 하도록 전자 장치의 이동을 요청하는 상기 가이드 정보를 출력하는 동작을 포함할 수 있다. 다양한 실시 예에 따라서, 상기 복수의 영상 보상 모드 중 제1 영상 보상 모드에서 상기 촬영 조건을 만족하면, 제1 영상 시간 동안 제1 영상 보상 방법으로 상기 디스플레이 장치에 대한 영상 보상 동작을 수행하는 과정을 상기 디스플레이를 통해 표시하는 동작, 상기 복수의 영상 보상 모드 중 제2 영상 보상 모드에서 상기 촬영 조 건을 만족하면, 제2 영상 시간 동안 제2 영상 보상 방법으로 상기 디스플레이 장치에 대한 영상 보상 동작을 수 행하는 과정을 상기 디스플레이를 통해 표시하는 동작, 및 상기 복수의 영상 보상 모드 중 제3 영상 보상 모드 에서 상기 촬영 조건을 만족하면, 제3 영상 시간 동안 제3 영상 보상 방법으로 상기 디스플레이 장치에 대한 영 상 보상 동작을 수행하는 과정을 상기 디스플레이를 통해 표시하는 동작을 더 포함할 수 있다. 다양한 실시 예에 따라서, 상기 제1 영상 보상 시간, 상기 제2 영상 보상 시간, 및 상기 제3 영상 보상 시간은 서로 상이한 시간을 포함할 수 있다. 다양한 실시 예에 따라서, 상기 제1 영상 보상 방법, 상기 제2 영상 보상 방법, 및 상기 제3 영상 보상 방법 각 각은, 디스플레이 장치의 영상 보상을 위한 적어도 하나의 화질 조정 항목을 포함할 수 있다. 다양한 실시 예에 따라서, 상기 적어도 하나의 화질 조정 항목은, 종류 및 개수가 서로 상이하거나 또는 일부 동일하게 상기 제1 영상 보상 방법, 상기 제2 영상 보상 방법, 및 상기 제3 영상 보상 방법 각각에 포함할 수 있다. 다양한 실시 예에 따라서, 상기 제1 영상 보상 모드에서 상기 촬영 조건을 만족하면, 카메라를 이용하여 상기 디스플레이 장치의 일부 영역을 포함하는 영상을 획득하는 동작, 및 상기 획득한 영상을 기반으로 상기 디스플 레이 장치에 대한 영상 보상 동작을 수행하는 과정을 상기 디스플레이를 통해 표시하는 동작을 더 포함하고, 상 기 디스플레이 장치의 일부 영역은, 상기 제1 영상 보상 방법에 포함된 화질 조절 항목에 대응되는 화질 특정 패턴을 출력할 수 있다. 다양한 실시 예에 따라서, 상기 제2 영상 보상 모드에서 상기 촬영 조건을 만족하면, 카메라를 이용하여 상기 디스플레이 장치의 일부 영역을 포함하는 영상을 획득하는 동작, 및 상기 획득한 영상을 기반으로 상기 디스플 레이 장치에 대한 영상 보상 동작을 수행하는 과정을 상기 디스플레이를 통해 표시하는 동작을 더 포함하고, 상 기 디스플레이 장치의 일부 영역은, 상기 제2 영상 보상 방법에 포함된 화질 조절 항목에 대응되는 화질 특정 패턴을 출력할 수 있다. 다양한 실시 예에 따라서, 상기 제3 영상 보상 모드에서 상기 촬영 조건을 만족하면, 카메라를 이용하여 상기 디스플레이 장치의 일부 영역을 포함하는 영상을 획득하는 동작, 및 상기 획득한 영상을 기반으로 상기 디스플 레이 장치에 대한 영상 보상 동작을 수행하는 과정을 상기 디스플레이를 통해 표시하는 동작을 포함하고, 상기 디스플레이 장치의 일부 영역은, 상기 제3 영상 보상 방법에 포함된 화질 조절 항목에 대응되는 화질 특정 패턴 을 출력할 수 있다. 다양한 실시 예에 따라서, 상기 디스플레이 장치의 일부 영역은 상기 디스플레이 장치의 영상 보상을 위한 특정 지점을 포함할 수 있다. 본 문서에 개시된 다양한 실시예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되 지 않는다. 본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위 해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적 으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 다양한 실시예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함 할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부 가 될 수 있다. 예를 들면, 일실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형 태로 구현될 수 있다. 본 문서의 다양한 실시예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어 (예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것 을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형 태로 제공될 수 있다. 여기서, '비일시적'은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전자 기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경우 와 임시적으로 저장되는 경우를 구분하지 않는다. 일실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory(CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치들(예: 스마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨 터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같 은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상 의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따르면, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동 작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다."}
{"patent_id": "10-2021-0083968", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 다양한 실시예에 따라, 전자 장치 및 디스플레이 장치를 포함하는 시스템을 도시하는 도면이다. 도 2는 다양한 실시예에 따라, 전자 장치의 구성을 간략히 나타낸 블록도를 도시하는 도면이다. 도 3은 다양한 실시예에 따라, 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시하는 도면이다.도 4a는 다 양한 실시예에 따라, 디스플레이 장치에서 출력되는 광 정보를 설명하기 위한 도면이다.도 4b는 다양한 실시예에 따라, 전자 장치에서 획득된 영상의 RGB 반응 스펙트럼을 도시하는 도면이다. 도 4c는 다양한 실시예에 따라, 계측기에서 획득된 영상의 XYZ 반응 스펙트럼을 도시하는 도면이다. 도 5는 다양한 실시예에 따라, 디스플레이 장치가 출력하는 화질 측정 패턴을 도시하는 도면이다. 도 6은 다양한 실시예에 따라, 전자 장치가 영상 보상을 수행하는 것을 도시하는 도면이다. 도 7은 다양한 실시예에 따라, 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시하는 도면이다. 도 8a 내지 도 8b는 다양한 실시예에 따라, 전자 장치가 보상 정보를 추가 생성하는 동작을 설명하기 위한 도 면이다. 도 9는 다양한 실시예에 따라, 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시하는 도면이다. 도 10은 다양한 실시예에 따라, 전자 장치가 보상 정보를 추가 생성하는 동작을 설명하기 위한 도면이다. 도 11은 다양한 실시예에 따라, 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시하는 도면이다. 도 12는 다양한 실시예에 따라, 디스플레이 장치의 물리적 특정 변화 설명하기 위한 도면이다. 도 13a는 다양한 실시예에 따라, 디스플레이 장치의 영상 보상을 수행하는 방법을 설명하기 위한 도면이다. 도 13b는 다양한 실시예에 따라, 디스플레이 장치의 영상 보상을 수행하는 방법을 설명하기 위한 도면이다. 도 13c는 다양한 실시예에 따라, 디스플레이 장치의 영상 보상을 수행하는 방법을 설명하기 위한 도면이다. 도 13d는 다양한 실시예에 따라, 디스플레이 장치의 영상 보상을 수행하는 방법을 설명하기 위한 도면이다. 도 14는 다양한 실시예에 따라, 전자 장치에서 디스플레이 장치의 영상 보상을 위한 동작 방법을 설명하기 위한 흐름도를 도시하는 도면이다. 도 15는 다양한 실시예에 따라, 전자 장치에서 디스플레이 장치의 영상 보상을 위한 복수의 영상 보상 모드를 설명하기 위한 도면이다. 도 16a 내지 16f 는 다양한 실시예에 따라, 전자 장치에서 디스플레이 장치의 영상 보상을 위한 제1 영상 보상 모드를 설명하기 위한 도면들이다, 도 17a 내지 17f 는 다양한 실시예에 따라, 전자 장치에서 디스플레이 장치의 영상 보상을 위한 제2 영상 보상 모드를 설명하기 위한 도면들이다. 도 18은 다양한 실시예에 따라, 전자 장치에서 디스플레이 장치의 영상 보상을 위한 제3 영상 보상 모드를 설명 하기 위한 도면이다. 도 19a는 다양한 실시예에 따라, 디스플레이 장치의 구성을 간략히 나타낸 블록도를 도시하는 도면이다. 도 19b는 다양한 실시예에 따라, 디스플레이 장치의 메모리에 저장된 인공지능 모델을 나타낸 블록도를 도시하 는 도면이다. 도 20은 다양한 실시예에 따라, 디스플레이 장치의 동작 방법을 설명하기 위한 흐름도를 도시하는 도면이다. 도 21은 다양한 실시예에 따라, 디스플레이 장치에서 사용자의 피드백을 요청하는 메시지의 출력을 도시하는 도 면이다."}
