{"patent_id": "10-2021-0165659", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0078164", "출원번호": "10-2021-0165659", "발명의 명칭": "유효상품들의 경쟁강도 분석 시스템 및 방법", "출원인": "이명철", "발명자": "이명철"}}
{"patent_id": "10-2021-0165659", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "유효상품들의 경쟁강도 분석 시스템에 있어서,상품의 시장 규모를 파악하기 위해, 상품 키워드를 추출하는 키워드 추출 모듈;추출된 상품 키워드의 기간별 검색량을 파악하는 검색량 산출모듈;상기 추출된 상품 키워드의 상품 정보를 크롤링하는 크롤링 모듈;크롤링된 상품정보를 기반으로 상품의 최근 판매 여부를 파악하는 분석모듈; 및최근 판매여부 분석 결과를 통해, 상품 검색량 대비 유효 판매상품의 경쟁 강도를 산출하는 경쟁강도 산출모듈; 을 포함하는 유효상품들의 경쟁강도 분석 시스템."}
{"patent_id": "10-2021-0165659", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 키워드 추출모듈; 은상품 명칭, 브랜드, 핵심어, 연관어, 해시태그, 확장어를 상품 키워드로 설정하고, 상기 상품 키워드를 추출하는 것을 특징으로 하는 유효상품들의 경쟁강도 분석 시스템."}
{"patent_id": "10-2021-0165659", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 검색량 산출모듈; 은추출된 키워드 검색량을 분기, 월간, 주간, 일간 단위로 파악하여 추출된 상품 키워드의 기간별 검색량을 파악하는 것을 특징으로 하는 유효상품들의 경쟁강도 분석 시스템."}
{"patent_id": "10-2021-0165659", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 경쟁강도 산출 모듈; 은상품 검색량 대비 실제 구매율, 상품 조회수 대비 실제 구매율, 상품의 리뷰 수 대비 실제 구매율을 파악하여해당 상품의 경쟁강도를 산출하는 것을 특징으로 하는 경쟁강도 분석 시스템."}
{"patent_id": "10-2021-0165659", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 경쟁강도 산출모듈; 은 웹상에서 크롤링된 상품의 리뷰 수에 따른 상품의 실제 판매수를 파악하여 해당 상품의 경쟁강도를 산출하는 것을 특징으로 하는 경쟁강도 분석 시스템."}
{"patent_id": "10-2021-0165659", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "유효상품들의 경쟁강도 분석 방법에 있어서,(A) 키워드 추출 모듈에서 상품의 시장 규모를 파악하기 위해, 상품 키워드를 추출하는 단계;공개특허 10-2023-0078164-3-(B) 검색량 산출 모듈에서 추출된 상품 키워드의 기간별 검색량을 파악하는 단계;(C) 크롤링 모듈에서 상기 추출된 상품 키워드의 상품 정보를 크롤링하는 단계;(D) 분석 모듈에서 크롤링된 상품정보를 기반으로 상품의 최근 판매 여부를 파악하는 단계; 및(E) 경쟁강도 산출 모듈에서 최근 판매여부 분석 결과를 통해, 상품 검색량 대비 유효 판매상품의 경쟁 강도를산출하는 단계; 를 포함하는 유효상품들의 경쟁강도 분석 방법."}
{"patent_id": "10-2021-0165659", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기(E)의 단계; 는상품 검색량 대비 실제 구매율, 상품 조회수 대비 실제 구매율, 상품의 리뷰 수 대비 실제 구매율을 파악하여해당 상품의 경쟁강도를 산출하는 것을 특징으로 하는 경쟁강도 분석 방법."}
{"patent_id": "10-2021-0165659", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "실시예에 따른 유효상품들의 경쟁강도 분석 시스템 및 방법은 잘못된 시장규모와 경쟁강도 파악으로 시장점유율 을 놓치지 않기 위해 최근에 판매된 적이 있는 유효 판매 상품들을 파악하고 그 수를 헤아려 실제적인 시장 규모 대비 경쟁강도를 파악할 수 있게 한다. 또한, 실시예에서는 실제로 최근에 판매가 된 적이 있는 유효한 상품 수 를 상품 키워드 검색량으로 대비하여 분석하여, 실제로 상품 판매에 도움이 되는 상품의 경쟁강도를 파악할 수 있다."}
{"patent_id": "10-2021-0165659", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 유효상품들의 경쟁강도 분석 시스템 및 방법에 관한 것으로 구체적으로, 온라인 마켓의 유효 판매상 품 수에 기반한 실제 키워드 경쟁 강도 분석 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2021-0165659", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "본 명세서에서 달리 표시되지 않는 한, 이 섹션에 설명되는 내용들은 이 출원의 청구항들에 대한 종래 기술이 아니며, 이 섹션에 포함된다고 하여 종래 기술이라고 인정되는 것은 아니다. 기업은 지속가능한 생존에 필요한 경쟁우위를 확보하기 위해 전략을 활용한다. 경쟁우위를 확보하는 방법에 관 한 근본적인 논의는 기업 전략분야에서 활발하게 논의되고 있고, 경쟁우위를 확보하기 위해, 경쟁, 산업구조, 전략적 위치에 따른 기업의 선택, 기업의 자원 등 다양한 관점에서 이루어지고 있다. 그 중에서도 경쟁기반전략 은 SCP 패러다임(Structure-Conduct-Performance)을 바탕으로 산업 내 경쟁세력(Forces)보다 우월한 시장지위 를 유지하는 도구와 전략을 제시함으로써 상대적으로 널리 활용되었다. 경쟁기반전략에서는 기업이 사용하는 전 략을 크게 원가우위전략(Cost Leadership Strategy)과 제품 차별화 전략(Product Differentiation Strategy)로 구분하며 경쟁우위확보를 위한 접근법을 제시한다(Porter, 2008)그러나 대부분의 기업 전략들은 일반적으로 장 기적인 관점에서 실현되는 경제적 이익을 반영하지 못하고 기업 전략이 갖는 가치에 대한 불완전한 전략을 제공 한다. 또한, 기업이 얻게 되는 성과와 실제로 기업이 수행한 기업 전략과의 인과관계를 명확히 발견하지 못한다 는 측면에서 그 한계가 존재한다. 이에 따라 기업의 전략과 성과 간의 관계에 대한 실증적인 연구의 필요성이 대두되었으며 기업이 얻게 되는 가치(Value)를 중심으로 가치기반전략(Value based Strategy)이 주목받고 있다. 가치기반전략은 기업과 고객, 공급업자로 구성되어 있는 시장에서 기업이 충분한 수준의 기여가치(Positive Added Value)를 확보하기 위해 사용하는 전략을 의미한다. 즉, 고객 및 공급업체와 협력하여 가치를 창조하고(Value Creation) 그 이후 서로 간의 자유로운 협상을 통해 가치 전유량(Value Appropriation)을 결정하는 것이다. 가치기반전략은 시장내 가치 파이(Pie)를 극대화하고 기 업과 플레이어들 간 협상으로 이를 전유한다는 점에서 협력적 경쟁전략(Co-Competition) 볼 수 있다. 또한, 기업에서 생산하는 상품의 경쟁강도를 분석하여 경쟁력 있는 상품들은 유지하고, 경쟁력이 떨어지는 상품 들은 전략으로 생산을 감소시켜 기업 가치와 경쟁력 유지에 힘써왔다. 기존의 경쟁강도 분석 방법은 단순이 상 품의 키워드의 검색량 대비 상품수로 경쟁 강도 판단하는 경우가 대부분이다. 하지만, 수백만 가지의 상품들이 검색되더라도, 검색된 상품 중에 실제로 최근에 판매가 된 상품은 전체 상품 중 일부분이기 때문에, 종래 경쟁 강도 분석 방법으로는 정확한 분석이 불가한 문제가 있다.선행기술문헌 특허문헌 (특허문헌 0001) 1.한국등록특허공보 제10-0901082호 (2009.05.28) (특허문헌 0002) 2.한국등록특허공보 제10-1401288호 (2014.05.23)"}
{"patent_id": "10-2021-0165659", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "실시예에 따른 유효상품들의 경쟁강도 분석 시스템 및 방법은 잘못된 시장규모와 경쟁강도 파악으로 시장점유율 을 놓치지 않기 위해 최근에 판매된 적이 있는 유효 판매 상품들을 파악하고 그 수를 헤아려 실제적인 시장 규 모 대비 경쟁강도를 파악할 수 있게 한다. 또한, 실시예에서는 실제로 최근에 판매가 된 적이 있는 유효한 상품 수를 상품 키워드 검색량으로 대비하여 분석하여, 실제로 상품 판매에 도움이 되는 상품의 경쟁강도를 파악한다."}
{"patent_id": "10-2021-0165659", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "실시예에 따른 유효상품들의 경쟁강도 분석 시스템은 상품의 시장 규모를 파악하기 위해, 상품 키워드를 추출하 는 키워드 추출 모듈; 추출된 상품 키워드의 기간별 검색량을 파악하는 검색량 산출모듈; 추출된 상품 키워드의 상품 정보를 크롤링하는 크롤링 모듈; 크롤링된 상품정보를 기반으로 상품의 최근 판매 여부를 파악하는 분석모 듈; 및 최근 판매여부 분석 결과를 통해, 상품 검색량 대비 유효 판매상품의 경쟁 강도를 산출하는 경쟁강도 산 출 모듈; 을 포함한다. 다른 실시예에 따른 유효상품들의 경쟁강도 분석 방법은 (A) 키워드 추출 모듈에서 상품의 시장 규모를 파악하 기 위해, 상품 키워드를 추출하는 단계; (B) 검색량 산출 모듈에서 추출된 상품 키워드의 기간별 검색량을 파악 하는 단계; (C) 크롤링 모듈에서 추출된 상품 키워드의 상품 정보를 크롤링하는 단계; (D) 분석 모듈에서 크롤 링된 상품정보를 기반으로 상품의 최근 판매 여부를 파악하는 단계; 및 (E) 경쟁강도 산출 모듈에서 최근 판매 여부 분석 결과를 통해, 상품 검색량 대비 유효 판매상품의 경쟁 강도를 산출하는 단계; 를 포함한다."}
{"patent_id": "10-2021-0165659", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "실시예에 따른 유효상품들의 경쟁강도 분석 시스템 및 방법은 실제 유효 판매 상품 수와 분석결과 파악한 상품 랭킹으로 실제 판매 상품 수를 예측 가능하게 하여, 현실적인 경영전략과 계획을 수립하는데 도움을 준다. 또한, 마케팅 블로그, SNS, SEO 작업을 통한 상품 순위를 올려 판매량을 증가시킬 수 있도록 한다. 또한, 실시예를 통해 실제 시장 규모와 경쟁강도를 파악하여 기존의 과도한 경쟁강도로 포기한 시장을 진입할 수 있도록 한다."}
{"patent_id": "10-2021-0165659", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과는 상기한 효과로 한정되는 것은 아니며, 본 발명의 상세한 설명 또는 특허청구범위에 기재된 발 명의 구성으로부터 추론 가능한 모든 효과를 포함하는 것으로 이해되어야 한다."}
{"patent_id": "10-2021-0165659", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시 예들에 한정되는 것이 아니라 서 로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시 예들은 본 발명의 개시가 완전하도록 하고, 본 발명이"}
{"patent_id": "10-2021-0165659", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "속하는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 명세서 전체에 걸쳐 동일 도면부호는 동일 구성 요소를 지칭한다. 본 발명의 실시 예들을 설명함에 있어서 공지 기능 또는 구성에 대한 구체적인 설명이 본 발명의 요지를 불필요 하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명을 생략할 것이다. 그리고 후술되는 용어들은 본 발명의 실시 예에서의 기능을 고려하여 정의된 용어들로서 이는 사용자, 운용자의 의도 또는 관례 등에 따라 달라질 수 있다. 그러므로 그 정의는 본 명세서 전반에 걸친 내용을 토대로 내려져야 할 것이다. 도 1은 실시예에 따른 유효상품들의 경쟁강도 분석 시스템 구성을 나타낸 도면이다. 도 1을 참조하면, 실시예에 따른 유효상품들의 경쟁강도 분석 시스템은 키워드 추출모듈, 검색량 산출모듈 , 크롤링 모듈, 분석모듈 및 경쟁강도 분석모듈을 포함하여 구성될 수 있다. 본 명세서에 서 사용되는 '모듈' 이라는 용어는 용어가 사용된 문맥에 따라서, 소프트웨어, 하드웨어 또는 그 조합을 포함할 수 있는 것으로 해석되어야 한다. 예를 들어, 소프트웨어는 기계어, 펌웨어(firmware), 임베디드코드(embedded code), 및 애플리케이션 소프트웨어일 수 있다. 또 다른 예로, 하드웨어는 회로, 프로세서, 컴퓨터, 집적 회로, 집적 회로 코어, 센서, 멤스(MEMS; Micro-Electro-Mechanical System), 수동 디바이스, 또는 그 조합일 수 있 다. 키워드 추출모듈은 상품의 시장 규모를 파악하기 위해, 상품 키워드를 추출한다. 실시예에서 키워드 추출 모듈은 상품 명칭, 브랜드, 핵심어, 연관어, 해시태그, 확장어를 상품 키워드로 설정하고, 상품 키워드를 추출한다. 검색량 산출 모듈은 추출된 상품 키워드의 기간별 검색량을 파악한다. 검색량 산출 모듈은 추출된 키 워드 검색량을 분기, 월간, 주간, 일간 단위로 파악하여 추출된 상품 키워드의 기간별 검색량을 파악한다. 실시 예에서는 검색량을 상품 조회수, 키워드 입력 수 등을 카운팅 하여 파악할 수 있다. 크롤링 모듈은 추출된 상품 키워드의 상품 정보를 크롤링한다. 크롤링(crawling)이란 검색 엔진 로봇을 이 용한 데이터 수집 방법으로 SNS, 뉴스, 웹 정보와 같이 조직 외부에서 공개된 웹문서를 수집하는 방법이다. 실 시예에서는 크롤링을 통해 무수히 많은 컴퓨터에 분산 저장되어 있는 문서를 수집하여 검색 대상의 색인으로 포 함시킨다. 실시예에서는 주어진 인터넷 주소(URL)에 접근하여 관련된 URL을 찾아내고, 찾아진 URL들 속에서 또 다른 하이퍼링크(hyperlink)들을 찾아 분류하고 저장하는 작업을 반복함으로써 여러 웹페이지를 돌아다니며 어 떤 데이터가 어디에 있는지 색인(index)을 만들어 데이터베이스(DB)에 저장할 수 있다. 분석모듈은 크롤링된 상품정보를 기반으로 상품의 최근 판매 여부를 파악한다. 예컨대, 분석모듈은 수집된 상품판매 URL의 쿠키 정보를 통해, 해당상품의 실제 판매 여부를 파악할 수 있다. 또한, SNS에 개설된 공동 구매 URL에서 실제 상품 판매량을 파악한다. 경쟁강도 산출 모듈은 최근 판매여부 분석 결과를 통해, 상품 검색량 대비 유효 판매상품의 경쟁 강도를 산출한다. 실시예에 따른 경쟁강도 산출 모듈은 상품 검색량 대비 실제 구매율, 상품 조회수 대비 실제 구 매율, 상품의 리뷰 수 대비 실제 구매율을 파악하여 해당 상품의 경쟁강도를 산출한다. 또한, 경쟁강도 산출 모 듈은 SNS에 등록된 공동구매 포스팅에 작성된 구매 희망 댓글 중 실제 상품 구매를 수행한 실 거래 고객 수를 파악하여 경쟁강도를 산출에 이용한다. 또한, 실시예에서 경쟁강도 산출모듈은 웹상에서 크롤링된 상품의 리뷰 수에 따른 상품의 실제 판매수를 파악하여 해당 상품의 경쟁강도를 산출할 수 있다. 예컨대, 경쟁강도 산출모듈은 웹상에서 크롤링된 상품 의 상세 페이지 등에 리뷰 수와 판매수가 모두 공개되어 있는 경우, 공개된 판매수에 따라 실제 판매 수를 파악 하고, 리뷰 수만 공개되어 있는 경우에는, 리뷰 수에 따른 실제 판매 수를 예측할 수 있다. 실시예에서 경쟁강 도 산출 모듈은 리뷰 수의 일정 비율을 실제 판매 수로 파악할 수 있고, 리뷰 수의 범위에 따라 해당 비율 은 다르게 설정될 수 있다. 구체적으로, 상품에 달린 리뷰가 100건인 경우, 70 퍼센트를 실제 판매량 범위로 파 악하고, 리뷰수가 300 건인 경우, 80퍼센트를 실제 판매량 범위로 파악할 수 있다. 만약, 리뷰수가 500건을 초 과하는 경우, 90퍼센트를 실제 판매량 범위로 파악하고 1,000건을 초과하면 95퍼센트를 실제 판매량 범위로 파악할 수 있다. 또한, 실시예에서 경쟁강도 산출모듈은 인공지능 빅데이터 분석을 통해 상품에 달린 리뷰들 의 컨텐츠를 분석하여, 해당 상품 생산 업체의 홍보 리뷰 비율과 반품 및 교환을 위한 리뷰 비율을 포함하는 페 이크 리뷰 비율을 파악하고, 파악된 페이크 리뷰 비율을 제외한 나머지 비율로 상품에 달린 리뷰 수에서 실제 판매량을 산출할 수 있다. 도 2는 실시예에 따른 경쟁강도 분석 방법의 데이터 처리 과정을 나타낸 도면이다. 도 2를 참조하면, 실시예에서 S100 단계에서는 경쟁강도 분석 시스템에 상품 키워드를 입력하면 S200 단계에서 는 키워드 추출 모듈과 검색량 산출모듈에서 상품 키워드를 추출하고, 추출된 상품 키워드의 검색량을 파악한다. 실시예에 따른 상품 키워드는 상품 명칭, 브랜드, 핵심어, 연관어, 해시태그, 확장어 등을 포함할 수 있다. 추출된 키워드 검색량을 분기, 월간, 주간, 일간 단위로 파악하여 추출된 상품 키워드의 기간별 검색량을 파악한다. 이후 S300 단계에서는 해당 키워드 상품을 크롤링하여 S400 단계에서 상품 정보를 수집한다. S500 단계에서는 크롤링으로 수집된 상품정보를 통해 해당 상품의 최근 판매 여부를 파악하고, S600 단계에서는 판매 여부 파악 정보를 통해 상품의 경쟁강도를 분석한다. 실시예에서는 상품 검색량 대비 실제 구매율, 상품 조회수 대비 실제 구매율, 상품의 리뷰 수 대비 실제 구매율을 파악하여 해당 상품의 경쟁강도를 산출할 수 있다. 도 3은 실시예에 따른 경쟁강도 분석 시스템의 경쟁강도 분석을 위한 데이터 처리과정을 나타낸 도면이다. 도 3을 참조하면, S110 단계에서는 검색량 산출모듈에서 상품 키워드를 입력 받아, 입력된 키워드에 해당하는 총 상품 개수를 크롤링하여 파악한다. S120 단계에서는 서버 CPU 프로세스 수를 확인한다. S130 단계에서는 분 석 모듈에서 총 상품 수를 CPU 프로세스 수인 N 개로 분할한 후, 분할된 각각의 첫번째와 마지막 위치를 계산한 다. 실시예에서는 첫번째로 분류된 상품들의 첫번째와 마지막 위치를 파악하여, S140 단계에서는 분석 모듈에서 첫 번째로 분할된 상품들의 중간 위치의 상품을 크롤링 후 최근 판매 여부를 점검한다. 실시예에서는 최근 판매 여 부를 두번째로 분할된 상품부터 N-1번째로 분할된 상품들의 중간 위치 상품을 크롤링하여 파악한다. 이후, N번 째로 분류된 상품들의 첫번째와 마지막의 위치를 파악하여, N번째 분할된 상품들의 중간 위치의 상품을 크롤링 후 최근 판매여부를 점검한다. 이후 S160 단계에서는 분석 모듈에서 i번째 분할된 상품들의 중간 위치 판매가 yes이고 i+1번째가 no 인 i값을 확인한다. S170 단계에서는 i값이 CPU프로세스 개수보다 큰 경우, i 값을 총 상품수로 치환하고 S130 단계로 다 시 진입한다. S170 단계에서는 분석 모듈에서 i값이 CPU 프로세스 값 이하인 경우, S190 단계로 진입하여 i값을 이용하여 최종 최근 판매 상품 수를 산출할 수 있다. 실시예에 따른 유효상품들의 경쟁강도 분석 시스템 및 방법은 잘못된 시장규모와 경쟁강도 파악으로 시장점유율 을 놓치지 않기 위해 최근에 판매된 적이 있는 유효 판매 상품들을 파악하고 그 수를 헤아려 실제적인 시장 규 모 대비 경쟁강도를 파악할 수 있게 한다. 또한, 실시예에서는 실제로 최근에 판매가 된 적이 있는 유효한 상품 수를 상품 키워드 검색량으로 대비하여 분석하여, 실제로 상품 판매에 도움이 되는 상품의 경쟁강도를 파악한다. 실시예에 따른 유효상품들의 경쟁강도 분석 시스템 및 방법은 실제 유효 판매 상품 수와 분석결과 파악한 상품 랭킹으로 실제 판매 상품 수를 예측 가능하게 하여, 현실적인 경영전략과 계획을 수립하는데 도움 을 준다. 또한, 마케팅 블로그, SNS, SEO 작업을 통한 상품 순위를 올려 판매량을 증가시킬 수 있도록 한다."}
{"patent_id": "10-2021-0165659", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "개시된 내용은 예시에 불과하며, 특허청구범위에서 청구하는 청구의 요지를 벗어나지 않고 당해 기술분야에서 통상의 지식을 가진 자에 의하여 다양하게 변경 실시될 수 있으므로, 개시된 내용의 보호범위는 상술한 특정의 실시예에 한정되지 않는다.도면 도면1 도면2 도면3"}
{"patent_id": "10-2021-0165659", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 실시예에 따른 유효상품들의 경쟁강도 분석 시스템 구성을 나타낸 도면 도 2는 실시예에 따른 경쟁강도 분석 방법의 데이터 처리 과정을 나타낸 도면 도 3은 실시예에 따른 경쟁강도 분석 시스템의 경쟁강도 분석을 위한 데이터 처리과정을 나타낸 도면"}
