{"patent_id": "10-2022-0151645", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0070150", "출원번호": "10-2022-0151645", "발명의 명칭": "스마트 자동 렌즈 세척 방법", "출원인": "나노아이텍", "발명자": "추병욱"}}
{"patent_id": "10-2022-0151645", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "세척 대상이 되는 렌즈의 상태 및 공정 단계에 따른 세척 수준이 탐색되는 단계;침전조의 세척 환경이 설정되는 단계;세척 조건이 설정되는 단계; 및설정된 세척 조건에 따라 렌즈가 초음파에 의하여 세척되는 단계를 포함하는 스마트 자동 렌즈 세척 방법."}
{"patent_id": "10-2022-0151645", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 세척 환경 또는 세척 조건의 설정은 세척 설정 데이터에 의하여 설정되는 것을 특징으로 하는 스마트 자동 렌즈 세척 방법."}
{"patent_id": "10-2022-0151645", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서, 세척 설정 데이터는 다양하게 설정되는 세척 조건에 대한 초음파를 적용하여 세척 조건에따른 초음파 적용 조건을 학습하는 인공지능 학습 알고리즘에 기초하여 생성되는 것을 특징으로 하는 스마트 자동 렌즈 세척 방법."}
{"patent_id": "10-2022-0151645", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "광학 렌즈의 세척 방법에 있어서,렌즈 세척 조건이 탐색되는 단계;침전조의 환경이 설정되는 단계; 렌즈의 세척을 위한 세척 설정 데이터가 적용되는 단계;세척 설정 데이터에 기초하여 세척을 위한 초음파가 설정되는 단계;렌즈가 침전조에 투입되는 단계;세척이 개시되면서 세척 상태가 탐지되는 단계;세척 수준이 세척 조건에 적합한지 여부가 판단되는 단계; 및렌즈 세척이 완료되는 단계를 포함하고,세척 설정 데이터는 세척 과정에 대한 데이터에 기초하여 인공지능 학습 알고리즘에 따라 생성되는 것을 특징으로 하는 광학 렌즈의 세척 방법."}
{"patent_id": "10-2022-0151645", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 스마트 자동 렌즈 세척 방법에 관한 것이다. 스마트 자동 렌즈 세척 방법은 세척 대상이 되는 렌즈의 상태 및 공정 단계에 따른 세척 수준이 탐색되는 단계; 침전조의 세척 환경이 설정되는 단계; 세척 조건이 설정 되는 단계; 및 설정된 세척 조건에 따라 렌즈가 초음파에 의하여 세척되는 단계를 포함한다."}
{"patent_id": "10-2022-0151645", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 스마트 자동 렌즈 세척 방법에 관한 것이고, 구체적으로 서로 다른 세척 공정 과정에서 초음파에 의 한 렌즈의 세척이 효과적으로 진행되도록 하는 스마트 자동 렌즈 세척 방법에 관한 것이다."}
{"patent_id": "10-2022-0151645", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "광학 렌즈의 제조 공정은 렌즈 재료 준비 공정, 곡률 형성 공정, 연마 공정, 코팅 공정 및 세척 공정을 포함한 다. 이와 같은 공정 중 세척 공정은 다수 개의 침전조에서 이소프로필 알코올 또는 이와 유사한 세척액에 의하 여 초음파가 인가되면서 진행될 수 있다. 세척 공정은 렌즈 가공의 다양한 단계에서 진행될 수 있고, 예를 들어 연마 공정, 심취 공정, 코팅 공정 또는 경화 공정이 진행된 이후 렌즈 표면의 오염 물질의 제거를 위하여 세척공정이 진행될 수 있다. 여러 단계에 걸쳐 진행되는 세척 공정은 각각의 단계에 적합하도록 진행될 필요가 있지 만 공지의 세척 공정은 동일한 세척 조건에서 세척이 이루어지고 이로 인하여 최종 가공된 렌즈의 불량률을 증 가시키는 원인이 된다. 그러므로 이와 같은 서로 다른 세척 단계에 관계없이 일률적으로 진행되는 세척 공정이 개선될 수 있는 방법이 만들어질 필요가 있다. 렌즈 세척과 관련하여 특허공개번호 10-2019-0044356은 렌즈 세 척 및 검사 장치에 대하여 개시한다. 또한 특허공개번호 10-2020-0011886은 광학렌즈를 제조하기 위한 플라스틱 몰드 및 렌즈를 자동으로 연속 세척하기 위한 자동 세척 장치 및 세척방법에 대하여 개시한다. 이와 같은 선행 기술 또는 공지기술은 서로 다른 세척 단계를 효과적으로 제어하여 오염 물질의 잔존 또는 렌즈 표면의 손상으 로 인한 렌즈 불량의 발생을 방지할 수 있는 방법에 대하여 개시하지 않는다. 본 발명은 선행기술의 문제점을 해결하기 위한 것으로 아래와 같은 목적을 가진다. 선행기술문헌 특허문헌 (특허문헌 0001) 선행기술1: 특허공개번호 10-2019-0044356(월드시스템주식회사, 2019.04.30. 공개) 렌즈 세척 및 검사 장치 (특허문헌 0002) 선행기술2: 특허공개번호 10-2020-0011886(주식회사 케이오씨솔루션, 2020.02.04. 공개) 광학 렌즈용 몰드 또는 렌즈의 자동 세척장치 및 세척방법"}
{"patent_id": "10-2022-0151645", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 렌즈 제조 과정의 서로 다른 세척 공정에서 각각의 공정 조건에 적합하도록 세척 조건을 설정 하여 세척 공정이 진행되도록 하는 스마트 자동 렌즈 세척 방법을 제공하는 것이다."}
{"patent_id": "10-2022-0151645", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 적절한 실시 형태에 따르면, 스마트 자동 렌즈 세척 방법은 세척 대상이 되는 렌즈의 상태 및 공정 단계에 따른 세척 수준이 탐색되는 단계; 침전조의 세척 환경이 설정되는 단계; 세척 조건이 설정되는 단계; 및 설정된 세척 조건에 따라 렌즈가 초음파에 의하여 세척되는 단계를 포함한다. 본 발명의 다른 적절한 실시 형태에 따르면, 세척 환경 또는 세척 조건의 설정은 세척 설정 데이터에 의하여 설 정된다. 본 발명의 또 다른 적절한 실시 형태에 따르면, 세척 설정 데이터는 다양하게 설정되는 세척 조건에 대한 초음 파를 적용하여 세척 조건에 따른 초음파 적용 조건을 학습하는 인공지능 학습 알고리즘에 기초하여 생성된다. 본 발명의 또 다른 적절한 실시 형태에 따르면, 광학 렌즈의 세척 방법은 렌즈 세척 조건이 탐색되는 단계; 침 전조의 환경이 설정되는 단계; 렌즈의 세척을 위한 세척 설정 데이터가 적용되는 단계; 세척 설정 데이터에 기 초하여 세척을 위한 초음파가 설정되는 단계; 렌즈가 침전조에 투입되는 단계; 세척이 개시되면서 세척 상태가 탐지되는 단계; 세척 수준이 세척 조건에 적합한지 여부가 판단되는 단계; 및 렌즈 세척이 완료되는 단계를 포 함하고, 세척 설정 데이터는 세척 과정에 대한 데이터에 기초하여 인공지능 학습 알고리즘에 따라 생성된다."}
{"patent_id": "10-2022-0151645", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 스마트 자동 렌즈 세척 방법은 렌즈 세척 공정에서 적절한 방법으로 렌즈가 세척되지 못하여 발 생되는 렌즈 불량이 방지되도록 한다. 본 발명에 따른 세척 방법은 각각 세척 대상이 되는 렌즈의 정보를 미리 파악하여 각각의 침전조에서 수행하는 세척의 정도를 서로 다르게 설정할 수 있다. 예를 들어 각각의 침전조에 서 렌즈 상태에 따라 초음파의 세기 또는 침전조 내부에서 잔류하는 시간을 제어하여 세척하고 이에 의하여 세 척 불량 감소가 방지되도록 한다. 또한 본 발명에 따른 세척 방법은 인공지능 알고리즘이 적용되어 다양한 세척 과정에 대한 데이터가 확보되고, 이에 기초하여 예를 들어 딥러닝 알고리즘에 의한 학습 과정이 적용되어 다양 한 조건에서 적절한 세척 조건의 탐색이 가능하도록 한다. 본 발명에 따른 세척 방법은 다양한 종류의 렌즈 제 조 공정에 적용될 수 있고 이에 의하여 본 발명은 제한되지 않는다."}
{"patent_id": "10-2022-0151645", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서 본 발명은 첨부된 도면에 제시된 실시 예를 참조하여 상세하게 설명이 되지만 실시 예는 본 발명의 명 확한 이해를 위한 것으로 본 발명은 이에 제한되지 않는다. 아래의 설명에서 서로 다른 도면에서 동일한 도면 부호를 가지는 구성요소는 유사한 기능을 가지므로 발명의 이해를 위하여 필요하지 않는다면 반복하여 설명이 되지 않으며 공지의 구성요소는 간략하게 설명이 되거나 생략이 되지만 본 발명의 실시 예에서 제외되는 것으로 이해되지 않아야 한다. 도 1은 본 발명에 따른 스마트 자동 렌즈 세척 방법의 실시 예를 도시한 것이다. 도 1을 참조하면, 스마트 자동 렌즈 세척 방법은 세척 대상이 되는 렌즈의 상태 및 공정 단계에 따른 세척 수준 이 탐색되는 단계(P11); 침전조의 세척 환경이 설정되는 단계(P12); 세척 조건이 설정되는 단계(P13); 및 설정 된 세척 조건에 따라 렌즈가 초음파에 의하여 세척되는 단계(P14)를 포함한다. 렌즈가 가공되는 다양한 단계에서 렌즈가 세척될 수 있고, 예를 들어 연마 공정, 심취 공정, 코팅 공정 또는 흑 칠 공정이 진행된 이후 각각 세척 공정이 진행될 수 있다. 각각의 세척 공정을 위하여 렌즈의 오염 상태, 렌즈 의 표면 상태 또는 진행된 공정 단계가 탐색될 수 있다(P11). 이와 같은 렌즈의 오염도, 오염 물질 또는 표면 상태에 따라 세척 환경이 설정될 수 있다(P12). 세척 환경은 세척을 위한 침전조의 온도, 세척 용제의 종류, 세 척 용제의 농도 또는 이와 유사한 세척 환경을 포함할 수 있다. 침전조는 온도 조절이 가능한 구조를 가질 수 있고, 세척 용제는 증류수, 이소프로필알코올, 초산, 아세톤 또는 이와 유사한 세척 용제가 될 수 있지만 이에 제한되지 않는다. 이와 같은 세척 환경은 각각의 세척 단계에 따라 적절하게 선택될 수 있다. 이와 같은 세척 환경이 설정되면 세척 조건이 설정될 수 있다. 세척 조건은 초음파의 인가 조건을 포함할 수 있고, 초음파의 주 파수, 초음파의 인가 주기, 초음파의 인가 시간 또는 이와 유사한 초음파 인가 조건을 포함할 수 있다. 세척 환 경의 설정 또는 세척 조건은 세척 설정 데이터에 의하여 설정될 수 있다. 세척 설정 데이터는 렌즈 상태 또는 세척 단계에 따라 자동으로 세척 환경과 세척 조건을 설정하는 기능을 가질 수 있다. 세척 설정 데이터에 의하 여 세척기의 침전조의 온도, 세척 용액, 세척 용액의 농도, 초음파의 주파수 또는 초음파의 인가 시간이 자동으 로 설정될 수 있다. 그리고 세척 설정 데이터에 의하여 설정된 조건에 따라 세척이 진행되어 광학 렌즈가 세척 될 수 있다(P14). 세척된 광학 렌즈가 건조가 될 수 있고, 차후 공정에 투입될 수 있다. 세척 공정을 조건을 설 정하는 세척 설정 데이터는 인공지능 학습 알고리즘에 의하여 생성될 수 있다. 아래에서 이와 같은 세척 설정 데이터가 생성되는 과정에 대하여 설명된다. 도 2는 본 발명에 따른 세척 방법에서 세척 설정 데이터가 생성되는 과정의 실시 예를 도시한 것이다. 도 2를 참조하면, 세척 설정 데이터는 다양하게 설정되는 세척 조건에 대한 초음파를 적용하여 세척 조건에 따 른 초음파 적용 조건을 학습하는 인공지능 학습 알고리즘에 기초하여 생성된다. 세척을 위한 상태 또는 조건이 탐색될 수 있고, 탐색된 상태 또는 조건에 따라 세척 매개변수가 결정될 수 있다. 세척을 위한 상태 또는 조건 은 세척 조건 모듈에 의하여 결정될 수 있다. 세척 조건 탐지 모듈은 공정 단계 탐지 유닛(21a), 렌즈 오염도 탐지 유닛(21b), 세척 용액 설정 유닛(21c) 또는 침전조 구조 탐지 유닛(21d)을 포함할 수 있다. 공정 단계 탐지 유닛(21a)에 의하여 각각의 세척 단계에서 세척되어야 하는 렌즈에 대한 공정 상태가 탐지될 수 있다. 공정 단계 탐지 유닛(21a)에 의하여 제거되어야 하는 오염 물질의 종류, 렌즈의 표면 상태 또는 이와 유 사한 이전 공정 단계에 진행에 따른 렌즈 상태가 탐지될 수 있다. 렌즈 오염도 탐지 유닛(21b)에 의하여 렌즈의 오염 수준이 탐지될 수 있고, 세척 용액 설정 유닛(21c)에 세척 용액의 종류가 설정될 수 있고, 예를 들어 증류 수, 이소프로필알코올, 초산 또는 이와 유사한 세척 용액의 종류가 설정될 수 있다. 또한 침전조 구조 탐지 유 닛(21d)에 의하여 침전조의 기하학적 또는 구조적 특징이 탐지될 수 있다. 이와 같은 세척 조건 탐지 모듈 에 의하여 탐지 또는 설정된 정보가 세척 매개변수 설정 모듈로 전송될 수 있다. 세척 매개변수 설정 모듈 은 세척 조건 탐지 모듈에 탐지된 조건 정보에 기초하여 세척을 위한 매개변수를 설정하는 기능을 가질수 있다. 예를 들어 매개변수 설정 모듈은 시간의 변화에 따른 온도, 세척 용액 농도, 세척 시간, 초음파의 주파수, 초음파의 진폭, 초음파 인가 시간 또는 이와 유사한 세척 관련 매개변수를 설정할 수 있다. 그리고 설 정된 매개변수가 적정 조건 매칭 모듈로 전송될 수 있다. 적정 조건 매칭 모듈은 설정된 매개변수에 대 하여 세척 매개변수 설정 모듈로부터 전송된 정보를 참조하여 세척을 위한 최적의 매개변수 값을 탐색하는 기능을 가진다. 적정 조건 매칭 모듈은 다양한 조건에 대한 매개변수 값을 조절하면서 적정 조건을 탐색할 수 있다. 다양한 조건에 대한 매개변수 값의 설정 또는 세척을 위한 적정 조건과 관련된 세척 데이터가 렌즈 세 척 데이터베이스에 저장될 수 있고, 세척 매개변수 설정 모듈 및 적정 조건 매칭 모듈은 렌즈 세척 데이터베이스에 저장된 세척 데이터를 참조하여 매개변수를 설정하고, 서로 다른 조건에 대한 매개변수를 적절하게 조절할 수 있다. 이와 같은 방법으로 다양한 조건에 대한 매개변수 값이 결정되어 적정 조건이 매칭이 되면 가상 세척 모델 모듈에서 가상으로 세척이 진행되어 매칭이 된 매개변수 값의 적절성 여부가 시험될 수 있다. 가상 세척 모델 모듈에 의하여 가상 세척 모델이 만들어져 시험이 될 수 있고, 만약 적정 조건 매 칭 모듈에 의하여 결정된 적어도 하나의 매개변수 값이 적합하지 않은 것으로 판단되면 적정 조건 매칭 모 듈에 의하여 다시 적어도 하나의 매개변수에 대하여 세척을 위하여 적합한 값이 탐색될 수 있다. 이후 다시 가상 세척 모델 모듈에 의하여 가상 세척 모델이 만들어져 세척 공정이 진행되어 각각의 매개변수 값의 적 정성이 판단될 수 있다. 그리고 적절한 가상 세척 모델이 만들어지면, 세척 설정 데이터 모듈로 전송될 수 있다. 세척 설정 데이터 모듈은 적어도 하나의 가상 세척 모델에 따른 세척 설정 데이터를 생성할 수 있다. 세척 설정 데이터는 렌즈 세척 과정에서 제어 가능한 매개변수를 자동으로 조절하는 기능을 가질 수 있다. 예를 들어 세척 설정 데이터에 의하여 세척 과정에서 침전조의 온도가 조절될 수 있고, 세척 용액의 농도가 조절될 수 있다. 세척 설정 데이터에 의하여 세척 과정에서 초음파의 주파수, 초음파의 진폭 또는 초음파의 인가 시간 이 조절될 수 있다. 또한 세척 설정 데이터에 의하여 세척 시간이 결정될 수 있다. 이와 같이 세척 설정 데이터 는 전체 세척 공정을 제어하여 세척 과정이 자동으로 진행되도록 하는 기능을 가질 수 있다. 다양한 조건에 따 른 다양한 세척 설정 데이터가 만들어질 수 있고, 생성된 세척 설정 데이터가 렌즈 세척 데이터베이스에 저장되 어 차후 세척 공정 또는 다른 세척 공정에 적용될 수 있다. 하나의 세척 설정 데이터로부터 다양한 형태의 세척 설정 데이터가 생성될 수 있고, 인공지능 학습 알고리즘 모듈에 의하여 세척 설정 데이터가 생성되거나, 수 정될 수 있다. 세척 매개변수 설정 모듈에 의한 매개변수의 설정 과정, 적정 조건 매칭 모듈에 의한 적 정 조건의 매칭 과정 및 가상 세척 모델 모듈에 의한 가상 세척 모델의 생성 과정은 인공지능 학습 알고리 즘에 의하여 진행될 수 있다. 인공지능 알고리즘은 딥 러닝(deep running) 모델에 해당하는 RNN(Recurrent Neutral Networks) 또는 RNN의 하나에 해당하는 LSTM(Long Term Memory Model)과 같은 학습 알고리즘이 될 수 있지만 이에 제한되지 않는다. 구체적으로 인공지능 학습 모듈에 의하여 다양한 세척 조건에 대한 매개변수 데이터가 획득될 수 있고, 획득된 매개변수 데이터가 다양한 형태로 조합될 수 있다. 이와 같은 과정에서 렌즈 세척 데이터베이스에 저장된 세척 데이터가 참조될 수 있다. 다양한 매개변수 변화에 따른 세척 데이터의 변화가 학습될 수 있고, 그에 기초하여 다양한 종류의 세척 데이터가 생성될 수 있다. 그리고 이와 같이 생성된 다양한 세척 데이터의 적정성이 가상 세척 모델에 의하여 시험될 수 있다. 그리고 이와 같은 과정을 통하여 적 어도 하나의 세척 설정 데이터가 만들어질 수 있다. 생성된 세척 설정 데이터가 렌즈 세척 데이터베이스에 저장되면서 세척 과정에 적용될 수 있다. 그리고 세척 과정에서 다시 인공지능 학습 알고리즘에 의하여 수 정될 수 있고 이와 같은 과정을 통하여 각각의 세척 과정을 위한 최적의 세척 설정 데이터가 생성되어 적용될 수 있다. 아래에서 이와 같은 과정을 통하여 생성된 세척 설정 데이터에 의하여 렌즈가 세척되는 과정에 대하여 설명된다. 도 3은 본 발명에 따른 세척 방법이 적용된 실시 예를 도시한 것이다. 도 3을 참조하면, 컨베이어와 같은 이송 수단에 의하여 정해진 공정이 완료된 다수 개의 렌즈가 세척 공정을 위 하여 이송될 수 있다(P31). 렌즈의 이송 과정에서 공정 단계 탐지 모듈에 의하여 공정 단계가 탐지될 수 있 다. 공정 단계의 탐지는 예를 들어 이전 단계의 공정에 의하여 형성된 렌즈 전체 형상, 렌즈 표면 형상, 오염 물질의 종류 또는 이와 유사한 정보를 포함한다. 렌즈의 세척을 위하여 렌즈가 침전조에 투입되면서(P32), 렌즈 상태 탐지 모듈에 의하여 렌즈의 상태가 탐지될 수 있고, 예를 들어 렌즈의 오염 수준, 렌즈 표면의 거칠기 또는 이와 유사한 정보가 탐지될 수 있다. 렌즈가 침전조에 투입되면(P32), 세척을 위하여 침전조가 조절될 수 있다(P33). 예를 들어 온도 조절 수단이 작동되고, 세척 용액이 투입되고 그리고 초음파 발생기의 작동이 주입 될 수 있다. 이와 함께 침전조 환경 탐지 모듈에 의하여 침전조의 환경에 대한 탐지가 개시될 수 있고, 예 를 들어 침전조의 온도, 침전 용액의 농도, 초음파의 전송 방향 또는 초음파의 발생에 따른 침전조 내부의 상태 변화에 대한 탐지가 개시될 수 있다. 세척을 위하여 세척 과정이 제어될 수 있고(P34), 이와 같은 과정에서 세 척 설정 데이터가 적용될 수 있다(P36). 세척 설정 데이터의 적용(P36)에 의하여 세척 과정이 자동으로 진행될수 있다. 이와 같은 과정에서 초음파 탐지 유닛에 의하여 세척을 위하여 침전조로 전송된 초음파가 수신되 어 초음파의 전송 상태가 탐지될 수 있다. 이와 같은 과정을 통하여 세척이 완료되면 렌즈가 배출될 수 있고 (P35), 렌즈 표면 탐지 모듈에 의하여 렌즈 표면 상태가 탐지되어 세척의 적정성이 확인될 수 있다. 이와 같은 세척 과정에서 공정 단계 탐지 모듈, 렌즈 상태 탐지 모듈, 침전조 환경 탐지 모듈, 초음파 탐지 모듈 및 렌즈 표면 탐지 모듈에 의하여 획득된 탐지 정보가 인공지능 학습 알고리즘으로 전송될 수 있고, 인공지능 학습 과정에 적용될 수 있다. 렌즈 세척은 다양한 방법으로 이루어질 수 있고 제시된 실시 예에 제한되지 않는다. 도 4는 본 발명에 따른 세척 방법에 의하여 렌즈가 세척되는 과정의 실시 예를 도시한 것이다. 도 4를 참조하면, 광학 렌즈의 세척 방법은 렌즈 세척 조건이 탐색되는 단계(P41); 침전조의 환경이 설정되는 단계(P42); 렌즈의 세척을 위한 세척 설정 데이터가 적용되는 단계(P43); 세척 설정 데이터에 기초하여 세척을 위한 초음파가 설정되는 단계(P44); 렌즈가 침전조에 투입되는 단계(P45); 세척이 개시되면서 세척 상태가 탐지 되는 단계(P46); 세척 수준이 세척 조건에 적합한지 여부가 판단되는 단계(P47); 및 렌즈 세척이 완료되는 단계 (P49)를 포함하고, 세척 설정 데이터는 세척 과정에 대한 데이터에 기초하여 인공지능 학습 알고리즘에 따라 생 성된다. 렌즈 세척 조건은 렌즈 공정 과정에 따라 결정될 수 있고, 렌즈 세척 조건의 탐색을 위하여 렌즈의 상태가 탐지 될 수 있다(P41). 렌즈가 투입되는 침전조의 환경이 설정될 수 있고(P42), 예를 들어 침전조의 초기 온도, 주입 되는 세척 용액의 종류, 세척 용액의 초기 농도 또는 이와 유사한 침전조의 초기 조건이 설정될 수 있다. 이와 같은 침전조의 환경 설정은 세척 설정 데이터에 기초할 수 있다. 렌즈 세척을 위한 준비가 완료되면, 렌즈 세척 설정 데이터가 적용되어 세척 과정이 적용될 수 있다(P43). 렌즈 세척 설정 데이터가 적용되면서 세척 설정 데 이터에 기초하여 인가되어야 하는 초음파 조건이 설정될 수 있다(P44). 초음파 조건은 초음파 주파수, 초음파 진폭, 인가 방향, 초음파 주기, 초음파 인가 시간 또는 이와 유사한 세척을 위한 초음파의 인가 조건을 포함한 다. 렌즈가 침전조에 투입되면(P45), 렌즈 세척이 진행되면서 세척 상태가 탐지될 수 있다. 예를 들어 수신되는 초음파가 탐지될 수 있고 이에 의하여 세척 상태가 탐지될 수 있다(P46). 탐지 결과에 기초하여 세척 설정 데이 터에 의하여 설정된 조건에 부합하는지 여부가 판단될 수 있다(P47). 만약 설정 조건에 부합하는 것으로 판단되 면(YES), 렌즈 세척이 진행되어 렌즈 세척이 완료될 수 있다(P49). 이에 비하여 수신된 초음파에 기초하여 세척 이 미리 결정된 조건에 따라 진행되지 않는다고 판단되면(NO), 세척 설정 데이터가 수정될 수 있다(P48). 그리 고 수정된 세척 설정 데이터에 의하여 세척이 진행되어 렌즈 세척이 완료될 수 있다(P49). 렌즈 세척 과정이 탐 지될 수 있고, 탐지 정보에 기초하여 렌즈 세척 데이터가 생성될 수 있다(P50). 이와 같이 생성된 렌즈 세척 데 이터가 렌즈 세척 데이터베이스에 저장되어 인공지능 학습 알고리즘의 학습 과정에 적용될 수 있다(P51). 이에 따라 다양한 형태의 렌즈 세척 설정 데이터가 생성될 수 있고, 렌즈 세척 데이터베이스에 저장되어 이후 렌즈 세척에 적용될 수 있다(P52). 렌즈 세척은 이와 같이 생성된 렌즈 세척 설정 데이터에 의하여 진행될 수 있다. 렌즈 세척 설정 데이터는 다양한 방법으로 만들어질 수 있고 이에 의하여 본 발명은 제한되지 않는다. 위에서 본 발명은 제시된 실시 예를 참조하여 상세하게 설명이 되었지만 이 분야에서 통상의 지식을 가진 자는 제시된 실시 예를 참조하여 본 발명의 기술적 사상을 벗어나지 않는 범위에서 다양한 변형 및 수정 발명을 만들 수 있을 것이다. 본 발명은 이와 같은 변형 및 수정 발명에 의하여 제한되지 않으며 다만 아래에 첨부된 청구범 위에 의하여 제한된다."}
{"patent_id": "10-2022-0151645", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 스마트 자동 렌즈 세척 방법의 실시 예를 도시한 것이다. 도 2는 본 발명에 따른 세척 방법에서 세척 설정 데이터가 생성되는 과정의 실시 예를 도시한 것이다. 도 3은 본 발명에 따른 세척 방법이 적용된 실시 예를 도시한 것이다. 도 4는 본 발명에 따른 세척 방법에 의하여 렌즈가 세척되는 과정의 실시 예를 도시한 것이다."}
