{"patent_id": "10-2023-7022810", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0131836", "출원번호": "10-2023-7022810", "발명의 명칭": "상호성의 부재 시 재구성가능한 지능형 표면 보조 통신을위한 초기 액세스", "출원인": "퀄컴 인코포레이티드", "발명자": "사흐래이, 새이드"}}
{"patent_id": "10-2023-7022810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "UE(user equipment)에 의해 수행되는 무선 통신 방법으로서,기지국으로부터 RIS(reconfigurable intelligent surface)를 통해, RIS-보조 절차들을 위해 구성된 제1SSB(synchronization signal block) 타입에 대응하는 SSB를 수신하는 단계;상기 제1 SSB 타입에 대응하는 SSB를 수신하는 것에 적어도 부분적으로 기초하여 다수의 PRACH(physical randomaccess channel) 송신 슬롯들을 포함하는 RACH(random access channel) 기회를 선택하는 단계; 및상기 RACH 기회의 상기 다수의 PRACH 송신 슬롯들에서 PRACH 통신을 상기 기지국에 송신하는 단계를 포함하는,UE에 의해 수행되는 무선 통신 방법."}
{"patent_id": "10-2023-7022810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 제1 SSB 타입에 대응하는 SSB를 수신하는 단계는 상기 UE의 수신 빔 상에서 상기 RIS에 의해 반사된 SSB를수신하는 단계를 포함하고, 상기 PRACH 통신을 송신하는 단계는,상기 SSB를 수신한 상기 UE의 수신 빔에 대응하는 상기 UE의 송신 빔 상에서 상기 RACH 기회의 상기 다수의PRACH 송신 슬롯들에서 상기 PRACH 통신을 송신하는 단계를 포함하는, UE에 의해 수행되는 무선 통신 방법."}
{"patent_id": "10-2023-7022810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항에 있어서,상기 PRACH 통신을 송신하는 단계는,상기 RACH 기회의 상기 다수의 PRACH 송신 슬롯들에서, 상기 UE의 복수의 송신 빔들의 각각의 송신 빔 상에서상기 PRACH 통신을 다수회 송신하는 단계를 포함하는, UE에 의해 수행되는 무선 통신 방법."}
{"patent_id": "10-2023-7022810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3 항에 있어서,어느 송신 빔이 상기 기지국에 의해 수신되는 상기 PRACH 통신을 송신하는지에 대한 결정에 적어도 부분적으로기초하여, 상기 UE의 상기 복수의 송신 빔들로부터, 상기 기지국에 업링크 통신을 송신하기 위한 송신 빔을 선택하는 단계를 더 포함하는, UE에 의해 수행되는 무선 통신 방법."}
{"patent_id": "10-2023-7022810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1 항 내지 제4 항 중 어느 한 항에 있어서,상기 제1 SSB 타입에 대응하는 SSB를 수신하는 것에 적어도 부분적으로 기초하여, 상기 UE에 의해 수신된 SSB를송신하기 위해 사용된 상기 기지국의 송신 빔 및 상기 UE에 의해 수신된 SSB를 반사한 상기 RIS로부터의 빔을표시하는 PRACH 프리앰블을 선택하는 단계를 더 포함하고, 상기 PRACH 통신은 상기 PRACH 프리앰블을 포함하는,UE에 의해 수행되는 무선 통신 방법."}
{"patent_id": "10-2023-7022810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1 항 내지 제5 항 중 어느 한 항에 있어서,상기 RACH 기회를 선택하는 단계는,상기 UE에 의해 수신된 SSB를 송신하기 위해 사용된 상기 기지국의 송신 빔 및 상기 UE에 의해 수신된 SSB를 반사한 상기 RIS로부터의 빔에 대응하도록 상기 RACH 기회를 선택하는 단계를 포함하는, UE에 의해 수행되는 무선공개특허 10-2023-0131836-3-통신 방법."}
{"patent_id": "10-2023-7022810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1 항 내지 제6 항 중 어느 한 항에 있어서,상기 RACH 기회를 선택하는 단계는,RACH 기회들과 SSB 타입들 사이의 맵핑에 적어도 부분적으로 기초하여 상기 RACH 기회를 선택하는 단계를 포함하는, UE에 의해 수행되는 무선 통신 방법."}
{"patent_id": "10-2023-7022810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7 항에 있어서,상기 맵핑은 상기 제1 SSB 타입과 연관된 제1 세트의 RACH 기회들 및 비-RIS 보조 절차들에 대해 구성된 제2SSB 타입과 연관된 제2 세트의 RACH 기회들을 포함하고, 상기 RACH 기회를 선택하는 단계는,상기 제1 세트의 RACH 기회들로부터 상기 RACH 기회를 선택하는 단계를 포함하는, UE에 의해 수행되는 무선 통신 방법."}
{"patent_id": "10-2023-7022810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "기지국에 의해 수행되는 무선 통신 방법으로서,상기 기지국의 제1 송신 빔 상에서, RIS(reconfigurable intelligent surface)-보조 절차들을 위해 구성된 제1SSB(synchronization signal block) 타입에 대응하는 SSB의 다수의 송신들을 송신하는 단계;상기 SSB와 연관된 RACH(random access channel) 기회의 다수의 PRACH(physical random access channel) 송신슬롯들을 통해 상기 기지국의 다수의 수신 빔들을 사용하여 빔 스위핑을 수행하는 단계; 및상기 빔 스위핑 동안 제1 수신 빔 상에서 PRACH 통신을 UE(user equipment)로부터 RIS를 통해 수신하는 것에 기초하여, 상기 기지국의 상기 다수의 수신 빔들로부터, 상기 UE로부터의 업링크 통신들을 수신하기 위한 상기 제1 수신 빔을 선택하는 단계를 포함하는, 기지국에 의해 수행되는 무선 통신 방법."}
{"patent_id": "10-2023-7022810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9 항에 있어서,상기 제1 SSB 타입에 대응하는 SSB의 상기 다수의 송신들을 송신하는 단계는,상기 제1 송신 빔 상에서 상기 SSB의 다수의 송신들을 상기 RIS를 향해 송신하는 단계를 포함하고, 상기 제1 송신 빔 상에서 상기 SSB의 다수의 송신들 각각은 상이한 빔을 사용하여 상기 RIS에 의해 반사될 것인, 기지국에의해 수행되는 무선 통신 방법."}
{"patent_id": "10-2023-7022810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9 항 또는 제10 항에 있어서,상기 제1 SSB 타입에 대응하는 SSB의 상기 다수의 송신들을 송신하는 단계는,상기 기지국의 상기 제1 송신 빔 및 하나 이상의 다른 송신 빔들 각각 상에서, 상기 제1 SSB 타입에 대응하는SSB의 다수의 송신들을 송신하는 단계를 포함하는, 기지국에 의해 수행되는 무선 통신 방법."}
{"patent_id": "10-2023-7022810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제9 항 내지 제11 항 중 어느 한 항에 있어서,상기 PRACH 통신은 상기 SSB의 다수의 송신들 중 상기 UE에 의해 수신되는 상기 SSB의 송신과 연관된 상기 RIS로부터의 빔 및 상기 기지국의 상기 제1 송신 빔을 표시하는 PRACH 프리앰블을 포함하는, 기지국에 의해 수행되는 무선 통신 방법."}
{"patent_id": "10-2023-7022810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "공개특허 10-2023-0131836-4-제9 항 내지 제12 항 중 어느 한 항에 있어서,상기 PRACH 통신이 수신되는 상기 RACH 기회는, 상기 SSB의 다수의 송신들 중 상기 UE에 의해 수신되는 상기SSB의 송신과 연관된 상기 RIS로부터의 빔 및 상기 기지국의 상기 제1 송신 빔에 대응하는, 기지국에 의해 수행되는 무선 통신 방법."}
{"patent_id": "10-2023-7022810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제9 항 내지 제13 항 중 어느 한 항에 있어서,상기 RACH 기회의 상기 다수의 PRACH 송신 슬롯들은 상기 UE에 의한 상기 PRACH 통신의 다수의 송신들과 연관되고, 상기 기지국의 상기 다수의 수신 빔들을 사용하여 빔 스위핑을 수행하는 단계는,상기 PRACH 통신이 상기 기지국의 상기 다수의 수신 빔들의 개개의 수신 빔 상에서 수신되는지 여부를 결정하기위해, 상기 개개의 수신 빔을 사용하여 상기 다수의 PRACH 송신 슬롯들 각각을 모니터링하는 단계를 포함하는,기지국에 의해 수행되는 무선 통신 방법."}
{"patent_id": "10-2023-7022810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제9 항 내지 제13 항 중 어느 한 항에 있어서,상기 RACH 기회의 상기 다수의 PRACH 송신 슬롯들은 상기 UE에 의한 상기 PRACH 통신의 다수의 송신들과 연관되고, 상기 RIS로부터의 다수의 빔들을 사용하여 반사되는, 기지국에 의해 수행되는 무선 통신 방법."}
{"patent_id": "10-2023-7022810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제9 항 내지 제15 항 중 어느 한 항에 있어서,상기 제1 송신 빔은 상기 기지국의 제1 공간 필터에 대응하고, 상기 제1 수신 빔은 상기 기지국의 제2 공간 필터에 대응하는, 기지국에 의해 수행되는 무선 통신 방법."}
{"patent_id": "10-2023-7022810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "무선 통신을 위한 UE(user equipment)로서,메모리; 및상기 메모리에 동작가능하게 커플링된 하나 이상의 프로세서들을 포함하고,상기 메모리 및 상기 하나 이상의 프로세서들은,기지국으로부터 RIS(reconfigurable intelligent surface)를 통해, RIS-보조 절차들을 위해 구성된 제1SSB(synchronization signal block) 타입에 대응하는 SSB를 수신하고;상기 제1 SSB 타입에 대응하는 SSB를 수신하는 것에 적어도 부분적으로 기초하여 다수의 PRACH(physical randomaccess channel) 송신 슬롯들을 포함하는 RACH(random access channel) 기회를 선택하고; 그리고상기 RACH 기회의 상기 다수의 PRACH 송신 슬롯들에서 PRACH 통신을 상기 기지국에 송신하도록 구성되는, 무선통신을 위한 UE."}
{"patent_id": "10-2023-7022810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17 항에 있어서,상기 하나 이상의 프로세서들은, 상기 제1 SSB 타입에 대응하는 SSB를 수신할 때, 상기 UE의 수신 빔 상에서 상기 RIS에 의해 반사된 SSB를 수신하도록 구성되고, 상기 하나 이상의 프로세서들은, 상기 PRACH 통신을 송신할때,상기 SSB를 수신한 상기 UE의 수신 빔에 대응하는 상기 UE의 송신 빔 상에서 상기 RACH 기회의 상기 다수의PRACH 송신 슬롯들에서 상기 PRACH 통신을 송신하도록 구성되는, 무선 통신을 위한 UE."}
{"patent_id": "10-2023-7022810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "공개특허 10-2023-0131836-5-제17 항에 있어서,상기 하나 이상의 프로세서들은, 상기 PRACH 통신을 송신할 때,상기 RACH 기회의 상기 다수의 PRACH 송신 슬롯들에서, 상기 UE의 복수의 송신 빔들의 각각의 송신 빔 상에서상기 PRACH 통신을 다수회 송신하도록 구성되는, 무선 통신을 위한 UE."}
{"patent_id": "10-2023-7022810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제17 항 내지 제19 항 중 어느 한 항에 있어서,상기 하나 이상의 프로세서들은,상기 제1 SSB 타입에 대응하는 SSB를 수신하는 것에 적어도 부분적으로 기초하여, 상기 UE에 의해 수신된 SSB를송신하기 위해 사용된 상기 기지국의 송신 빔 및 상기 UE에 의해 수신된 SSB를 반사한 상기 RIS로부터의 빔을표시하는 PRACH 프리앰블을 선택하도록 추가로 구성되고, 상기 PRACH 통신은 상기 PRACH 프리앰블을 포함하는,무선 통신을 위한 UE."}
{"patent_id": "10-2023-7022810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제17 항 내지 제20 항 중 어느 한 항에 있어서,상기 하나 이상의 프로세서들은, 상기 RACH 기회를 선택할 때,상기 UE에 의해 수신된 SSB를 송신하기 위해 사용된 상기 기지국의 송신 빔 및 상기 UE에 의해 수신된 SSB를 반사한 상기 RIS로부터의 빔에 대응하도록 상기 RACH 기회를 선택하도록 구성되는, 무선 통신을 위한 UE."}
{"patent_id": "10-2023-7022810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제17 항 내지 제21 항 중 어느 한 항에 있어서,상기 하나 이상의 프로세서들은, 상기 RACH 기회를 선택할 때,RACH 기회들과 SSB 타입들 사이의 맵핑에 적어도 부분적으로 기초하여 상기 RACH 기회를 선택하도록 구성되는,무선 통신을 위한 UE."}
{"patent_id": "10-2023-7022810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제22 항에 있어서,상기 맵핑은 상기 제1 SSB 타입과 연관된 제1 세트의 RACH 기회들 및 비-RIS 보조 절차들에 대해 구성된 제2SSB 타입과 연관된 제2 세트의 RACH 기회들을 포함하고, 상기 하나 이상의 프로세서들은, 상기 RACH 기회를 선택할 때,상기 제1 세트의 RACH 기회들로부터 상기 RACH 기회를 선택하도록 구성되는, 무선 통신을 위한 UE."}
{"patent_id": "10-2023-7022810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "무선 통신을 위한 기지국으로서,메모리; 및상기 메모리에 동작가능하게 커플링된 하나 이상의 프로세서들을 포함하고,상기 메모리 및 상기 하나 이상의 프로세서들은,상기 기지국의 제1 송신 빔 상에서, RIS(reconfigurable intelligent surface)-보조 절차들을 위해 구성된 제1SSB(synchronization signal block) 타입에 대응하는 SSB의 다수의 송신들을 송신하고;상기 SSB와 연관된 RACH(random access channel) 기회의 다수의 PRACH(physical random access channel) 송신슬롯들을 통해 상기 기지국의 다수의 수신 빔들을 사용하여 빔 스위핑을 수행하고; 그리고상기 빔 스위핑 동안 제1 수신 빔 상에서 PRACH 통신을 UE(user equipment)로부터 RIS를 통해 수신하는 것에 기초하여, 상기 기지국의 상기 다수의 수신 빔들로부터, 상기 UE로부터의 업링크 통신들을 수신하기 위한 상기 제공개특허 10-2023-0131836-6-1 수신 빔을 선택하도록 구성되는, 무선 통신을 위한 기지국."}
{"patent_id": "10-2023-7022810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제24 항에 있어서,상기 하나 이상의 프로세서들은, 상기 제1 SSB 타입에 대응하는 SSB의 상기 다수의 송신들을 송신할 때,상기 제1 송신 빔 상에서 상기 SSB의 다수의 송신들을 상기 RIS를 향해 송신하도록 구성되고, 상기 제1 송신 빔상에서 상기 SSB의 다수의 송신들 각각은 상이한 빔을 사용하여 상기 RIS에 의해 반사될 것인, 무선 통신을 위한 기지국."}
{"patent_id": "10-2023-7022810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "제24 항 또는 제25 항에 있어서,상기 하나 이상의 프로세서들은, 상기 제1 SSB 타입에 대응하는 SSB의 상기 다수의 송신들을 송신할 때,상기 기지국의 상기 제1 송신 빔 및 하나 이상의 다른 송신 빔들 각각 상에서, 상기 제1 SSB 타입에 대응하는SSB의 다수의 송신들을 송신하도록 구성되는, 무선 통신을 위한 기지국."}
{"patent_id": "10-2023-7022810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "제24 항 내지 제26 항 중 어느 한 항에 있어서,상기 PRACH 통신은 상기 SSB의 다수의 송신들 중 상기 UE에 의해 수신되는 상기 SSB의 송신과 연관된 상기 RIS로부터의 빔 및 상기 기지국의 상기 제1 송신 빔을 표시하는 PRACH 프리앰블을 포함하는, 무선 통신을 위한 기지국."}
{"patent_id": "10-2023-7022810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_28", "content": "제24 항 내지 제27 항 중 어느 한 항에 있어서,상기 PRACH 통신이 수신되는 상기 RACH 기회는, 상기 SSB의 다수의 송신들 중 상기 UE에 의해 수신되는 상기SSB의 송신과 연관된 상기 RIS로부터의 빔 및 상기 기지국의 상기 제1 송신 빔에 대응하는, 무선 통신을 위한기지국."}
{"patent_id": "10-2023-7022810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "제24 항 내지 제28 항 중 어느 한 항에 있어서,상기 RACH 기회의 상기 다수의 PRACH 송신 슬롯들은 상기 UE에 의한 상기 PRACH 통신의 다수의 송신들과 연관되고, 상기 기지국의 상기 다수의 수신 빔들을 사용하여 빔 스위핑을 수행하는 것은,상기 PRACH 통신이 상기 기지국의 상기 다수의 수신 빔들의 개개의 수신 빔 상에서 수신되는지 여부를 결정하기위해, 상기 개개의 수신 빔을 사용하여 상기 다수의 PRACH 송신 슬롯들 각각을 모니터링하는 것을 포함하는, 무선 통신을 위한 기지국."}
{"patent_id": "10-2023-7022810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_30", "content": "제24 항 내지 제29 항 중 어느 한 항에 있어서,상기 제1 송신 빔은 상기 기지국의 제1 공간 필터에 대응하고, 상기 제1 수신 빔은 상기 기지국의 제2 공간 필터에 대응하는, 무선 통신을 위한 기지국."}
{"patent_id": "10-2023-7022810", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 다양한 양상들은 일반적으로 무선 통신에 관한 것이다. 일부 양상들에서, UE(user equipment)는 기지 국으로부터 RIS(reconfigurable intelligent surface)를 통해, RIS-보조 절차들을 위해 구성된 제1 SSB(synchronization signal block) 타입에 대응하는 SSB를 수신할 수 있다. UE는 제1 SSB 타입에 대응하는 SSB를 수신하는 것에 적어도 부분적으로 기초하여 다수의 PRACH(physical random access channel) 송신 슬롯들 을 포함하는 RACH(random access channel) 기회를 선택할 수 있다. UE는 RACH 기회의 다수의 PRACH 송신 슬롯 들에서 PRACH 통신을 기지국에 송신할 수 있다. 다수의 다른 양상들이 설명된다."}
{"patent_id": "10-2023-7022810", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시의 양상들은 일반적으로, 무선 통신, 및 재구성가능한 지능형 표면 보조 통신을 위한 초기 액세 스를 위한 기법들 및 장치들에 관한 것이다."}
{"patent_id": "10-2023-7022810", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "무선 통신 시스템들은 텔레포니(telephony), 비디오, 데이터, 메시징, 및 브로드캐스트들과 같은 다양한 전기통신 서비스들을 제공하도록 널리 배치되어 있다. 통상적인 무선 통신 시스템들은 이용가능한 시스템 자원 들(예를 들어, 대역폭, 송신 전력 등)을 공유함으로써 다수의 사용자들과의 통신을 지원할 수 있는 다중-액세스 기술들을 이용할 수 있다. 이러한 다중-액세스 기술들의 예들은 CDMA(code division multiple access) 시스템 들, TDMA(time division multiple access) 시스템들, FDMA(frequency division multiple access) 시스템들, OFDMA(orthogonal frequency division multiple access) 시스템들, SC-FDMA(single-carrier frequency division multiple access) 시스템들, TD-SCDMA(time division synchronous code division multiple access) 시스템들, 및 LTE(Long Term Evolution)를 포함한다. LTE/LTE-어드밴스드는 3GPP(Third Generation Partnership Project)에 의해 공표된 UMTS(Universal Mobile Telecommunications System) 모바일 표준에 대한 향상들의 세트이다. 무선 네트워크는, 다수의 UE(user equipment)들에 대한 통신을 지원할 수 있는 다수의 BS(base stations)들을 포함할 수 있다. UE는 다운링크 및 업링크를 통해 BS와 통신할 수 있다. 다운링크(또는 순방향 링크)는 BS로부터 UE로의 통신 링크를 지칭하고, 업링크(또는 역방향 링크)는 UE로부터 BS로의 통신 링크를 지 칭한다. 본원에 더 상세히 설명될 바와 같이, BS는 노드 B, gNB, AP(access point), 라디오 헤드, TRP(transmit receive point), NR(New Radio) BS, 5G 노드 B 등으로 지칭될 수 있다. 상기 다중 액세스 기술들은 상이한 사용자 장비가, 도시 레벨, 국가 레벨, 지역 레벨, 및 심지어 글로벌 레벨 상에서 통신할 수 있게 하는 공통 프로토콜을 제공하기 위해 다양한 전기통신 표준들에서 채택되어 왔다. 5G로 또한 지칭될 수 있는 NR(New Radio)은 3GPP에 의해 공표된 LTE 모바일 표준에 대한 향상들의 세트이다. NR은, 스펙트럼 효율을 개선하고, 비용들을 낮추고, 서비스들을 개선하고, 새로운 스펙트럼을 이용하고, DL(downlink) 상에서는 CP(cyclic prefix)를 갖는 OFDM(orthogonal frequency division multiplexing)(CP- OFDM)을 사용하고 UL(uplink) 상에서는 CP-OFDM 및/또는 SC-FDM(예를 들어, 또한 DFT-s-OFDM(discrete Fourier transform spread OFDM)으로 공지됨)을 사용할 뿐만 아니라 빔형성, MIMO(multiple-input multiple-output) 안 테나 기술 및 캐리어 어그리게이션을 지원하여 다른 개방형 표준들과 더 양호하게 통합함으로써 모바일 브로드 밴드 인터넷 액세스를 더 양호하게 지원하도록 설계된다. 모바일 브로드밴드 액세스에 대한 요구가 계속 증가 함에 따라, LTE, NR 및 다른 라디오 액세스 기술들에서의 추가적인 개선들은 여전히 유용하다. 일부 양상들에서, UE에 의해 수행되는 무선 통신 방법은, 기지국으로부터 RIS(reconfigurable intelligent surface)를 통해, RIS-보조 절차들을 위해 구성된 제1 SSB(synchronization signal block) 타입에 대응하는 SSB를 수신하는 단계; 제1 SSB 타입에 대응하는 SSB를 수신하는 것에 적어도 부분적으로 기초하여 다 수의 PRACH(physical random access channel) 송신 슬롯들을 포함하는 RACH(random access channel) 기회를 선 택하는 단계; 및 RACH 기회의 다수의 PRACH 송신 슬롯들에서 PRACH 통신을 기지국에 송신하는 단계를 포함한다. 일부 양상들에서, 기지국에 의해 수행되는 무선 통신 방법은, 기지국의 제1 송신 빔 상에서, RIS-보조 절차들을 위해 구성된 제1 SSB 타입에 대응하는 SSB의 다수의 송신들을 송신하는 단계; SSB와 연관된 RACH 기회 의 다수의 PRACH 송신 슬롯들을 통해 기지국의 다수의 수신 빔들을 사용하여 빔 스위핑을 수행하는 단계; 및 빔 스위핑 동안 제1 수신 빔 상에서 PRACH 통신을 UE로부터 RIS를 통해 수신하는 것에 기초하여, 기지국의 다수의 수신 빔들로부터, UE로부터의 업링크 통신들을 수신하기 위한 제1 수신 빔을 선택하는 단계를 포함한다. 일부 양상들에서, 무선 통신을 위한 UE는 메모리 및 메모리에 동작가능하게 커플링된 하나 이상의 프로 세서들을 포함하고, 메모리 및 하나 이상의 프로세서들은, 기지국으로부터 RIS를 통해, RIS-보조 절차들을 위해 구성된 제1 SSB 타입에 대응하는 SSB를 수신하고; 제1 SSB 타입에 대응하는 SSB를 수신하는 것에 적어도 부분적 으로 기초하여 다수의 PRACH 송신 슬롯들을 포함하는 RACH 기회를 선택하고; 그리고 RACH 기회의 다수의 PRACH 송신 슬롯들에서 PRACH 통신을 기지국에 송신하도록 구성된다. 일부 양상들에서, 무선 통신을 위한 기지국은 메모리 및 메모리에 동작가능하게 커플링된 하나 이상의 프로세서들을 포함하고, 메모리 및 하나 이상의 프로세서들은, 기지국의 제1 송신 빔 상에서, RIS-보조 절차들 을 위해 구성된 제1 SSB 타입에 대응하는 SSB의 다수의 송신들을 송신하고; SSB와 연관된 RACH 기회의 다수의 PRACH 송신 슬롯들을 통해 기지국의 다수의 수신 빔들을 사용하여 빔 스위핑을 수행하고; 그리고 빔 스위핑 동 안 제1 수신 빔 상에서 PRACH 통신을 UE로부터 RIS를 통해 수신하는 것에 기초하여, 기지국의 다수의 수신 빔들로부터, UE로부터의 업링크 통신들을 수신하기 위한 제1 수신 빔을 선택하도록 구성된다. 일부 양상들에서, 무선 통신을 위한 명령들의 세트를 저장하는 비일시적 컴퓨터 판독가능 매체는 하나 이상의 명령들을 포함하고, 하나 이상의 명령들은, UE의 하나 이상의 프로세서들에 의해 실행될 때, UE로 하여 금, 기지국으로부터 RIS를 통해, RIS-보조 절차들을 위해 구성된 제1 SSB 타입에 대응하는 SSB를 수신하게 하고; 제1 SSB 타입에 대응하는 SSB를 수신하는 것에 적어도 부분적으로 기초하여 다수의 PRACH 송신 슬롯들을 포함하는 RACH 기회를 선택하게 하고; 그리고 RACH 기회의 다수의 PRACH 송신 슬롯들에서 PRACH 통신을 기지국 에 송신하게 한다. 일부 양상들에서, 무선 통신을 위한 명령들의 세트를 저장하는 비일시적 컴퓨터 판독가능 매체는 하나 이상의 명령들을 포함하고, 하나 이상의 명령들은, 기지국의 하나 이상의 프로세서들에 의해 실행될 때, 기지국 으로 하여금, 기지국의 제1 송신 빔 상에서, RIS-보조 절차들을 위해 구성된 제1 SSB 타입에 대응하는 SSB의 다 수의 송신들을 송신하게 하고; SSB와 연관된 RACH 기회의 다수의 PRACH 송신 슬롯들을 통해 기지국의 다수의 수 신 빔들을 사용하여 빔 스위핑을 수행하게 하고; 그리고 빔 스위핑 동안 제1 수신 빔 상에서 PRACH 통신을 UE로 부터 RIS를 통해 수신하는 것에 기초하여, 기지국의 다수의 수신 빔들로부터, UE로부터의 업링크 통신들을 수신 하기 위한 제1 수신 빔을 선택하게 한다. 일부 양상들에서, 무선 통신을 위한 장치는, 기지국으로부터 RIS를 통해, RIS-보조 절차들을 위해 구성 된 제1 SSB 타입에 대응하는 SSB를 수신하기 위한 수단; 제1 SSB 타입에 대응하는 SSB를 수신하는 것에 적어도 부분적으로 기초하여 다수의 PRACH 송신 슬롯들을 포함하는 RACH 기회를 선택하기 위한 수단; 및 RACH 기회의 다수의 PRACH 송신 슬롯들에서 PRACH 통신을 기지국에 송신하기 위한 수단을 포함한다. 일부 양상들에서, 무선 통신을 위한 장치는, 기지국의 제1 송신 빔 상에서, RIS-보조 절차들을 위해 구 성된 제1 SSB 타입에 대응하는 SSB의 다수의 송신들을 송신하기 위한 수단; SSB와 연관된 RACH 기회의 다수의 PRACH 송신 슬롯들을 통해 기지국의 다수의 수신 빔들을 사용하여 빔 스위핑을 수행하기 위한 수단; 및 빔 스위 핑 동안 제1 수신 빔 상에서 PRACH 통신을 UE로부터 RIS를 통해 수신하는 것에 기초하여, 기지국의 다수의 수신 빔들로부터, UE로부터의 업링크 통신들을 수신하기 위한 제1 수신 빔을 선택하기 위한 수단을 포함한다. 양상들은 일반적으로, 도면들 및 명세서를 참조하여 실질적으로 본원에 설명되고 그에 의해 예시된 바와 같은 방법, 장치, 시스템, 컴퓨터 프로그램 제품, 비일시적 컴퓨터 판독가능 매체, 사용자 장비, 기지국, 무선 통신 디바이스 및/또는 프로세싱 시스템을 포함한다. 전술한 바는, 다음의 상세한 설명이 더 양호하게 이해될 수 있도록 본 개시에 따른 예들의 특징들 및 기"}
{"patent_id": "10-2023-7022810", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "술적 이점들을 상당히 광범위하게 요약하였다. 이하, 추가적인 특징들 및 이점들이 설명될 것이다. 개시된 개 념 및 특정한 예들은 본 개시의 동일한 목적들을 수행하기 위해 다른 구조들을 변형 또는 설계하기 위한 기초로 용이하게 활용될 수 있다. 이러한 균등한 구조들은 첨부된 청구항들의 범위로부터 벗어나지 않는다. 본원에 개시된 개념들의 특성들, 즉, 이들의 구성 및 동작 방법 둘 모두는, 연관된 이점들과 함께, 첨부한 도면들과 함 께 고려될 때 다음의 설명으로부터 더 잘 이해될 것이다. 각각의 도면들은 예시 및 설명의 목적으로 제공되며, 청구항의 제한들에 대한 정의로 의도되지 않는다."}
{"patent_id": "10-2023-7022810", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시의 다양한 양상들은 첨부된 도면들을 참조하여 아래에서 더 완전히 설명된다. 그러나, 본 개시 는 많은 상이한 형태들로 구현될 수 있고, 본 개시 전반에 걸쳐 제시되는 임의의 특정 구조 또는 기능에 제한되 는 것으로 해석되어서는 안된다. 오히려, 이러한 양상들은, 본 개시가 철저하고 완전해지도록, 그리고 당업자 들에게 본 개시의 범위를 완전히 전달하도록 제공된다. 본원의 교시들에 기초하여, 당업자는, 본 개시의 범위 가, 본 개시의 임의의 다른 양상과는 독립적으로 구현되든 또는 임의의 다른 양상과 결합되어 구현되든, 본원에 개시된 개시의 임의의 양상을 커버하도록 의도됨을 인식해야 한다. 예를 들어, 본원에서 기술된 임의의 수의 양상들을 사용하여 장치가 구현될 수 있거나 방법이 실시될 수 있다. 또한, 본 개시의 범위는, 본원에 기술된 본 개시의 다양한 양상들에 추가로 또는 그 이외의 다른 구조, 기능 또는 구조 및 기능을 사용하여 실시되는 이 러한 장치 또는 방법을 커버하도록 의도된다. 본원에서 개시되는 본 개시의 임의의 양상은 청구항의 하나 이상 의 엘리먼트들에 의해 구현될 수 있음을 이해해야 한다. 이제 전기통신 시스템들의 몇몇 양상들이 다양한 장치들 및 기술들을 참조하여 제시될 것이다. 이러한 장치들 및 기술들은, 다양한 블록들, 모듈들, 컴포넌트들, 회로들, 단계들, 프로세스들, 알고리즘들 등(집합적 으로, \"엘리먼트들\"로 지칭됨)에 의해 다음의 상세한 설명에서 설명되고 첨부한 도면들에서 예시될 것이다. 이 러한 엘리먼트들은 하드웨어, 소프트웨어, 또는 이들의 조합을 사용하여 구현될 수 있다. 이러한 엘리먼트들이 하드웨어로서 구현될지 또는 소프트웨어로서 구현될지는 특정한 애플리케이션 및 전체 시스템에 부과된 설계 제 약들에 의존한다. 양상들이 5G 또는 NR RAT(radio access technology)와 일반적으로 연관된 용어를 사용하여 본원에서 설 명될 수 있지만, 본 개시의 양상들은 3G RAT, 4G RAT 및 /또는 5G(예컨대, 6G)에 후속하는 RAT와 같은 다른 RAT 들에 적용될 수 있음을 주목해야 한다. 도 1은 본 개시의 다양한 양상들에 따른 무선 네트워크의 예를 예시하는 도면이다. 무선 네트워크 는 다른 예들 중에서도, 5G(NR) 네트워크 및/또는 LTE 네트워크의 엘리먼트들일 수 있거나 또는 이들을 포 함할 수 있다. 무선 네트워크는 다수의 기지국들(BS(110a), BS(110b), BS(110c), 및 BS(110d)로 도 시됨) 및 다른 네트워크 엔티티들을 포함할 수 있다. BS(base station)는 UE(user equipment)들과 통신하는 엔티티이고, 또한 NR BS, 노드 B, gNB, 5G NB(node B), 액세스 포인트, TRP(transmit receive point) 등으로 지칭될 수 있다. 각각의 BS는 특정 지리적 커버리지 영역에 대한 통신 커버리지를 제공할 수 있다. 3GPP에서, \"셀\"이라는 용어는, 그 용어가 사용되는 상황에 따라, BS의 커버리지 영역 및/또는 이러한 커버리지 영역을 서 빙하는 BS 서브시스템을 지칭할 수 있다. BS는 매크로 셀, 피코 셀, 펨토 셀 및/또는 다른 타입의 셀에 대한 통신 커버리지를 제공할 수 있다. 매크로 셀은, 비교적 넓은 지리적 영역(예를 들어, 반경 수 킬로미터)을 커버할 수 있고, 서비스 가입을 한 UE 들에 의한 제한없는 액세스를 허용할 수 있다. 피코 셀은 비교적 작은 지리적 영역을 커버할 수 있고, 서비스가입을 한 UE들에 의한 제한없는 액세스를 허용할 수 있다. 펨토 셀은 비교적 작은 지리적 영역(예를 들어, 집)을 커버할 수 있고, 펨토 셀과의 연관을 갖는 UE들(예를 들어, CSG(closed subscriber group) 내의 UE들)에 의한 제한적 액세스를 허용할 수 있다. 매크로 셀에 대한 BS는 매크로 BS로 지칭될 수 있다. 피코 셀에 대한 BS는 피코 BS로 지칭될 수 있다. 펨토 셀에 대한 BS는 펨토 BS 또는 홈 BS로 지칭될 수 있다. 도 1에 도시된 예에서, BS(110a)는 매크로 셀(102a)에 대한 매크로 BS일 수 있고, BS(110b)는 피코 셀(102b)에 대한 피코 BS 일 수 있고, BS(110c)는 펨토 셀(102c)에 대한 펨토 BS일 수 있다. BS는 하나의 또는 다수의(예를 들어, 3개의) 셀들을 지원할 수 있다. \"eNB\", \"기지국\", \"NR BS\", \"gNB\", \"TRP\", \"AP\", \"노드 B\", \"5G NB\", 및 \"셀\"이라는 용어들은 본 명세서에서 상호교환가능하게 사용될 수 있다. 일부 양상들에서, 셀은 필수적으로 고정식은 아닐 수 있고, 셀의 지리적 영역은 모바일 BS의 위치에 따 라 이동할 수 있다. 일부 양상들에서, BS들은 임의의 적합한 전송 네트워크를 사용하여 직접 물리적 접속, 또 는 가상 네트워크와 같은 다양한 타입들의 백홀 인터페이스들을 통해 서로 및/또는 무선 네트워크의 하나 이상의 다른 BS들 또는 네트워크 노드들(도시되지 않음)에 상호접속될 수 있다. 무선 네트워크는 또한 중계국들을 포함할 수 있다. 중계국은, 업스트림 스테이션(예를 들어, BS 또는 UE)으로부터 데이터의 송신을 수신하고 다운스트림 스테이션(예를 들어, UE 또는 BS)으로 데이터의 송신을 전송할 수 있는 엔티티이다. 또한, 중계국은 다른 UE들에 대한 송신들을 중계할 수 있는 UE일 수 있다. 도 1 에 도시된 예에서, 중계 BS(110d)는 BS(110a)와 UE(120d) 사이의 통신을 용이하게 하기 위해 매크로 BS(110a) 및 UE(120d)와 통신할 수 있다. 또한, 중계 BS는 중계 스테이션, 중계 기지국, 중계기 등으로 지칭될 수 있다. 무선 네트워크는 상이한 타입들의 BS들, 이를테면, 매크로 BS들, 피코 BS들, 펨토 BS들, 중계 BS들 등을 포함하는 이종 네트워크일 수 있다. 이러한 상이한 타입들의 BS들은 상이한 송신 전력 레벨들, 상이한 커 버리지 영역들 및 무선 네트워크에서의 간섭에 대한 상이한 영향들을 가질 수 있다. 예를 들어, 매크로 BS들은 높은 송신 전력 레벨(예를 들어, 5 내지 40 와트)을 가질 수 있는 반면, 피코 BS들, 펨토 BS들 및 중계 BS들은 더 낮은 송신 전력 레벨들(예를 들어, 0.1 내지 2 와트)을 가질 수 있다. 네트워크 제어기는 BS들의 세트에 커플링될 수 있고, 이러한 BS들에 대한 조정 및 제어를 제공할 수 있다. 네트워크 제어기는 백홀을 통해 BS들과 통신할 수 있다. BS들은 또한, 예를 들어, 무선 또는 유선 백홀을 통해 간접적으로 또는 직접적으로 서로 통신할 수 있다. UE들(예를 들어, 120a, 120b, 120c)은 무선 네트워크 전반에 걸쳐 산재되어 있을 수 있고, 각각의 UE는 고정형 또는 이동형일 수 있다. UE는 또한 액세스 단말, 단말, 모바일 스테이션, 가입자 유닛, 스 테이션 등으로 지칭될 수 있다. UE는 셀룰러 폰(예를 들어, 스마트 폰), PDA(personal digital assistant), 무선 모뎀, 무선 통신 디바이스, 핸드헬드 디바이스, 랩톱 컴퓨터, 코드리스 폰, WLL(wireless local loop) 스 테이션, 태블릿, 카메라, 게이밍 디바이스, 넷북, 스마트북, 울트라북, 의료 디바이스 또는 장비, 생체인식 센 서들/디바이스들, 웨어러블 디바이스들(예를 들어, 스마트 시계들, 스마트 의류, 스마트 안경, 스마트 손목 밴 드들, 스마트 보석류(예를 들어, 스마트 반지, 스마트 팔찌 등)), 엔터테인먼트 디바이스(예를 들어, 뮤직 또는 비디오 디바이스, 또는 위성 라디오), 차량 컴포넌트 또는 센서, 스마트 계측기들/센서들, 산업용 제조 장비, 글로벌 포지셔닝 시스템 디바이스 또는 무선 또는 유선 매체를 통해 통신하도록 구성되는 임의의 다른 적합한 디바이스일 수 있다. 일부 UE들은 MTC(machine-type communication) 또는 eMTC(evolved or enhanced machine-type communication) UE들로 고려될 수 있다. MTC 및 eMTC UE들은, 기지국, 다른 디바이스(예를 들어, 원격 디바이 스) 또는 일부 다른 엔티티와 통신할 수 있는, 예를 들어, 로봇들, 드론들, 원격 디바이스들, 센서들, 계측기들, 모니터들 및/또는 로케이션 태그들을 포함한다. 무선 노드는, 예를 들어, 유선 또는 무선 통신 링크 를 통해 네트워크(예를 들어, 인터넷 또는 셀룰러 네트워크와 같은 광역 네트워크)에 대한 또는 네트워크로의 접속을 제공할 수 있다. 일부 UE들은 고려되는 IoT(Internet-of-Things) 디바이스들일 수 있고, 그리고/또는 NB-IoT(narrowband internet of things) 디바이스들로 구현될 수 있다. 일부 UE들은 CPE(Customer Premises Equipment)로 고려될 수 있다. UE는 프로세서 컴포넌트들 및/또는 메모리 컴포넌트들과 같은 UE의 컴포넌트들을 수납하는 하우징 내에 포함될 수 있다. 일부 양상들에서, 프로세서 컴포넌트들 및 메모리 컴포넌 트들은 함께 커플링될 수 있다. 예를 들어, 프로세서 컴포넌트들(예를 들어, 하나 이상의 프로세서들) 및 메모 리 컴포넌트들(예를 들어, 메모리)은 동작가능하게 커플링되고, 통신가능하게 커플링되고, 전자적으로 커플링되 고, 그리고/또는 전기적으로 커플링될 수 있다. 일반적으로, 임의의 수의 무선 네트워크들이 주어진 지리적 영역에 배치될 수 있다. 각각의 무선 네트 워크는 특정 RAT를 지원할 수 있고 하나 이상의 주파수들 상에서 동작할 수 있다. RAT는 또한 라디오 기술, 에 어 인터페이스 등으로 지칭될 수 있다. 주파수는 또한, 캐리어, 주파수 채널 등으로 지칭될 수 있다. 각각의 주파수는 상이한 RAT들의 무선 네트워크들 사이에서 간섭을 회피하기 위해 주어진 지리적 영역에서 단일 RAT를 지원할 수 있다. 일부 경우들에서, NR 또는 5G RAT 네트워크들이 배치될 수 있다. 일부 양상들에서, 2개 이상의 UE들(예를 들어, UE(120a) 및 UE(120e)로 도시됨)은 (예를 들어, 서 로 통신하기 위한 매개체로서 기지국을 사용함이 없이) 하나 이상의 사이드링크 채널들을 사용하여 직접 통신할 수 있다. 예를 들어, UE들은 P2P(peer-to-peer) 통신들, D2D(device-to-device) 통신들, V2X(vehicle-to-everything) 프로토콜(예를 들어, V2V(vehicle-to-vehicle) 프로토콜, 또는 V2I(vehicle-to- infrastructure) 프로토콜을 포함할 수 있음), 및/또는 메시 네트워크를 사용하여 통신할 수 있다. 이러한 경 우, UE는 스케줄링 동작들, 자원 선택 동작들, 및/또는 기지국에 의해 수행되는 것으로 본원의 다른 곳에 설명된 다른 동작들을 수행할 수 있다. 무선 네트워크의 디바이스들은 주파수 또는 파장에 기초하여 다양한 클래스들, 대역들, 채널들 등 으로 세분화될 수 있는 전자기 스펙트럼을 사용하여 통신할 수 있다. 예를 들어, 무선 네트워크의 디바이 스들은 410 MHz 내지 7.125 GHz에 걸쳐 있을 수 있는 제1 주파수 범위(FR1)를 갖는 동작 대역을 사용하여 통신 할 수 있고, 그리고/또는 24.25 GHz 내지 52.6 GHz에 걸쳐 있을 수 있는 제2 주파수 범위(FR2)를 갖는 동작 대 역을 사용하여 통신할 수 있다. FR1과 FR2 사이의 주파수들은 때때로 중간대역 주파수들로 지칭된다. FR1의 일부가 6 GHz를 초과하지만, FR1은 종종 \"서브-6 GHz\" 대역으로서 지칭된다. 유사하게, FR2는 종종 \"밀리미터 파\" 대역으로서 ITU(International Telecommunications Union)에 의해 식별되는 EHF(extremely high frequency) 대역(30 GHz - 300 GHz)과는 상이함에도 불구하고, \"밀리미터파\" 대역으로서 종종 지칭된다. 따라 서, 달리 구체적으로 언급되지 않으면, \"서브-6 GHz\"이라는 용어 등은, 본원에서 사용되는 경우, 6 GHz 미만의 주파수들, FR1 내의 주파수들 및/또는 중간대역 주파수들(예컨대, 7.125 GHz 초과)을 광범위하게 표현할 수 있 음을 이해해야 한다. 유사하게, 달리 구체적으로 언급되지 않으면, \"밀리미터파\"이라는 용어 등은, 본원에서 사용되는 경우, EHF 대역 내의 주파수들, FR2 내의 주파수들 및/또는 중간대역 주파수들(예컨대, 24.25 GHz 미 만)을 광범위하게 표현할 수 있음을 이해해야 한다. FR1 및 FR2에 포함된 주파수들은 수정될 수 있고, 본원에 설명된 기술들은 그러한 수정된 주파수 범위들에 적용가능하다는 것이 고려된다. 앞서 표시된 바와 같이, 도 1은 일례로서 제공된다. 다른 예들은 도 1과 관련하여 설명된 것과는 상이 할 수 있다. 도 2는 본 개시의 다양한 양상들에 따른 무선 네트워크에서 UE와 통신하는 기지국의 예 를 예시하는 도면이다. 기지국은 T개의 안테나들(234a 내지 234t)을 구비할 수 있고, UE는 R개 의 안테나들(252a 내지 252r)을 구비할 수 있으며, 여기서 일반적으로 T ≥ 1 및 R ≥ 1이다. 기지국에서, 송신 프로세서는 하나 이상의 UE들에 대한 데이터 소스로부터 데이터를 수 신하고, UE로부터 수신된 CQI(channel quality indicator)들에 적어도 부분적으로 기초하여 각각의 UE에 대한 하나 이상의 MCS(modulation and coding schemes)를 선택하고, UE에 대해 선택된 MCS(들)에 적어도 부분적으로 기초하여 각각의 UE에 대한 데이터를 프로세싱(예를 들어, 인코딩 및 변조)하고, 모든 UE들에 대한 데이터 심볼 들을 제공할 수 있다. 송신 프로세서는 또한 (예를 들어, SRPI(semi-static resource partitioning information)에 대한) 시스템 정보 및 제어 정보(예를 들어, CQI 요청들, 그랜트들, 및/또는 상위 계층 시그널 링)를 프로세싱하고 오버헤드 심볼들 및 제어 심볼들을 제공할 수 있다. 송신 프로세서는 또한 기준 신호 들(예를 들어, CRS(cell-specific reference signal) 또는 DMRS(demodulation reference signal)) 및 동기화 신호들(예를 들어, PSS(primary synchronization signal) 또는 SSS(secondary synchronization signal))에 대 한 기준 심볼들을 생성할 수 있다. 송신(TX) MIMO(multiple-input multiple-output) 프로세서는, 적용가 능하다면, 데이터 심볼들, 제어 심볼들, 오버헤드 심볼들 및/또는 기준 심볼들에 대해 공간 프로세싱(예를 들어, 프리코딩)을 수행할 수 있고, T개의 출력 심볼 스트림들을 T개의 변조기들(MOD들)(232a 내지 232t)에 제 공할 수 있다. 각각의 변조기는 각각의 출력 심볼 스트림을 (예를 들어, OFDM(orthogonal frequency division multiplexing)을 위해) 프로세싱하여 출력 샘플 스트림을 획득할 수 있다. 각각의 변조기는 출 력 샘플 스트림을 추가 프로세싱(예를 들어, 아날로그로 변환, 증폭, 필터링 및 상향 변환)하여 다운링크 신호 를 획득할 수 있다. 변조기들(232a 내지 232t)로부터의 T개의 다운링크 신호들은 T개의 안테나들(234a 내지 234t)을 통해 각각 송신될 수 있다. UE에서, 안테나들(252a 내지 252r)은 기지국 및/또는 다른 기지국들로부터 다운링크 신호들을 수신할 수 있고, 수신된 신호들을 복조기들(DEMOD들)(254a 내지 254r)에 각각 제공할 수 있다. 각각의 복조기 는 수신된 신호를 컨디셔닝(예를 들어, 필터링, 증폭, 하향변환 및 디지털화)하여, 입력 샘플들을 획득할 수 있다. 각각의 복조기는 입력 샘플들을 (예를 들어, OFDM을 위해) 추가로 프로세싱하여, 수신된 심볼들 을 획득할 수 있다. MIMO 검출기는 모든 R개의 복조기들(254a 내지 254r)로부터의 수신된 심볼들을 획득 하고, 적용가능하다면 수신된 심볼들에 대해 MIMO 검출을 수행하고, 검출된 심볼들을 제공할 수 있다. 수신 프 로세서는 검출된 심볼들을 프로세싱(예를 들어, 복조 및 디코딩)하고, UE에 대한 디코딩된 데이터를 데이터 싱크에 제공하고, 디코딩된 제어 정보 및 시스템 정보를 제어기/프로세서에 제공할 수 있다. \"제어기/프로세서\"라는 용어는 하나 이상의 제어기들, 하나 이상의 프로세서들, 또는 이들의 조합을 지칭할 수 있다. 채널 프로세서는 다른 예들 중에서도, RSRP(reference signal received power) 파라미터, RSSI(received signal strength indicator) 파라미터, RSRQ(reference signal received quality) 파라미터, 및/또는 CQI 파라미터를 결정할 수 있다. 일부 양상들에서, UE의 하나 이상의 컴포넌트들은 하우징 에 포함될 수 있다. 네트워크 제어기는 통신 유닛, 제어기/프로세서, 및 메모리를 포함할 수 있다. 네 트워크 제어기는 예를 들어, 코어 네트워크 내의 하나 이상의 디바이스들을 포함할 수 있다. 네트워크 제 어기는 통신 유닛을 통해 기지국과 통신할 수 있다. 안테나들(예컨대, 안테나들(234a 내지 234t) 및/또는 안테나들(252a 내지 252r))은 다른 예들 중에서도, 하나 이상의 안테나 패널들, 안테나 그룹들, 안테나 엘리먼트들의 세트들 및/또는 안테나 어레이들을 포함할 수 있거나 또는 이들 내에 포함될 수 있다. 안테나 패널, 안테나 그룹, 안테나 엘리먼트들의 세트 및/또는 안테나 어레이는 하나 이상의 안테나 엘리먼트들을 포함할 수 있다. 안테나 패널, 안테나 그룹, 안테나 엘리먼트들의 세트 및/또는 안테나 어레이는 동일 평면 안테나 엘리먼트들의 세트 및/또는 비-동일 평면 안테나 엘리먼트들의 세트를 포함할 수 있다. 안테나 패널, 안테나 그룹, 안테나 엘리먼트들의 세트 및/또는 안테나 어레이는 단일 하우징 내의 안테나 엘리먼트들 및/또는 다수의 하우징들 내의 안테나 엘리먼트들을 포함할 수 있다. 안테나 패널, 안테나 그룹, 안테나 엘리먼트들의 세트 및/또는 안테나 어레이는 도 2의 하나 이상의 컴포넌트들과 같은 하나 이상의 송신 및/또는 수신 컴포넌트들에 커플링된 하나 이상의 안테나 엘리먼트들을 포함할 수 있다. 업링크에서, UE에서, 송신 프로세서는 데이터 소스로부터의 데이터 및 제어기/프로세서 로부터의 (예를 들어, RSRP, RSSI, RSRQ 및/또는 CQI를 포함하는 보고들에 대한) 제어 정보를 수신 및 프 로세싱할 수 있다. 송신 프로세서는 또한 하나 이상의 기준 신호들에 대한 기준 심볼들을 생성할 수 있다. 송신 프로세서로부터의 심볼들은 적용가능하다면 TX MIMO 프로세서에 의해 프리코딩되고, 변 조기들(254a 내지 254r)에 의해 (예를 들어, DFT-s-OFDM, 또는 CP-OFDM을 위해) 추가로 프로세싱되고, 기지국 에 송신될 수 있다. 일부 양상들에서, UE의 변조기 및 복조기(예를 들어, MOD/DEMOD)는 UE의 모뎀에 포함될 수 있다. 일부 양상들에서, UE는 트랜시버를 포함한다. 트랜시버는 안테나 (들), 변조기들 및/또는 복조기들, MIMO 검출기, 수신 프로세서, 송신 프로세서 및/ 또는 TX MIMO 프로세서의 임의의 조합을 포함할 수 있다. 트랜시버는, 예를 들어, 도 10 내지 도 12를 참 조하여 설명된 바와 같이, 본원에 설명된 방법들 중 임의의 방법의 양상들을 수행하기 위해 프로세서(예컨대, 제어기/프로세서) 및 메모리에 의해 사용될 수 있다. 기지국에서, UE에 의해 전송된 데이터 및 제어 정보에 대한 디코딩된 데이터 및 제어 정보를 획득하기 위해, UE 및 다른 UE들로부터의 업링크 신호들은 안테나들에 의해 수신되고, 복조기들(23 2)에 의해 프로세싱되고, 적용가능하다면 MIMO 검출기에 의해 검출되고, 수신 프로세서에 의해 추가 로 프로세싱될 수 있다. 수신 프로세서는 디코딩된 데이터를 데이터 싱크에 제공할 수 있고, 디코딩 된 제어 정보를 제어기/프로세서에 제공할 수 있다. 기지국은 통신 유닛을 포함하고 통신 유닛 을 통해 네트워크 제어기에 통신할 수 있다. 기지국은 다운링크 및/또는 업링크 통신들을 위해 UE들을 스케줄링하기 위한 스케줄러를 포함할 수 있다. 일부 양상들에서, 기지국의 변조기 및 복조기(예를 들어, MOD/DEMOD)는 기지국의 모뎀에 포함될 수 있다. 일부 양상들에서, 기지국은 트랜시버를 포함한다. 트랜시버는 안테나(들), 변조기들 및/또는 복조기들, MIMO 검출기, 수신 프로세서, 송신 프로세서 및/또는 TX MIMO 프로세서의 임의의 조합을 포함할 수 있다. 트랜시 버는, 예를 들어, 도 10 내지 도 12를 참조하여 설명된 바와 같이, 본원에 설명된 방법들 중 임의의 방법의 양 상들을 수행하기 위해 프로세서(예컨대, 제어기/프로세서) 및 메모리에 의해 사용될 수 있다. 도 2의 기지국의 제어기/프로세서, UE의 제어기/프로세서 및/또는 임의의 다른 컴 포넌트(들)는 본원의 다른 곳에 더 상세히 설명된 바와 같이, RIS(reconfigurable intelligent surface)-보조통신을 위한 초기 액세스와 연관된 하나 이상의 기법들을 수행할 수 있다. 예를 들어, 기지국의 제어기/ 프로세서, UE의 제어기/프로세서 및/또는 도 2의 임의의 다른 컴포넌트(들)는 예를 들어, 도 11 의 프로세스, 도 12의 프로세스 및/또는 본원에 설명된 바와 같은 다른 프로세스들의 동작들을 수행 또는 지시할 수 있다. 메모리들(242 및 282)은 기지국 및 UE에 대한 데이터 및 프로그램 코드들을 각각 저장할 수 있다. 일부 양상들에서, 메모리 및/또는 메모리는 무선 통신을 위한 하나 이상의 명 령들(예를 들어, 코드 및/또는 프로그램 코드)을 저장하는 비일시적 컴퓨터 판독가능 저장 매체를 포함할 수 있 다. 예를 들어, 하나 이상의 명령들은, 기지국 및/또는 UE의 하나 이상의 프로세서들에 의해 (예를 들어, 직접 또는 컴파일, 변환 및/또는 해석 이후에) 실행될 때, 하나 이상의 프로세서들, UE, 및/또는 기 지국으로 하여금, 예를 들어, 도 11의 프로세스, 도 12의 프로세스 및/또는 본원에 설명된 바 와 같은 다른 프로세스들의 동작들을 수행 또는 지시하게 할 수 있다. 일부 양상들에서, 명령들을 실행하는 것 은, 다른 예들 중에서도, 명령들을 실행하는 것, 명령들을 변환하는 것, 명령들을 컴파일하는 것, 및/또는 명령 들을 해석하는 것을 포함할 수 있다. 일부 양상들에서, UE는, 기지국으로부터 RIS(reconfigurable intelligent surface)를 통해, RIS- 보조 절차들을 위해 구성된 제1 SSB(synchronization signal block) 타입에 대응하는 SSB를 수신하기 위한 수 단; 제1 SSB 타입에 대응하는 SSB를 수신하는 것에 적어도 부분적으로 기초하여 다수의 PRACH(physical random access channel) 송신 슬롯들을 포함하는 RACH(random access channel) 기회를 선택하기 위한 수단; 또는 RACH 기회의 다수의 PRACH 송신 슬롯들에서 PRACH 통신을 기지국에 송신하기 위한 수단을 포함한다. UE가 본원 에 설명된 동작들을 수행하기 위한 수단은, 예컨대, 안테나, 복조기, MIMO 검출기, 수신 프로세 서, 송신 프로세서, TX MIMO 프로세서, 변조기, 제어기/프로세서 또는 메모리 중 하나 이상을 포함할 수 있다. 일부 양상들에서, UE는 SSB를 수신한 UE의 수신 빔에 대응하는 UE의 송신 빔 상에서 RACH 기회의 다수의 PRACH 송신 슬롯들에서 PRACH 통신을 송신하기 위한 수단을 포함한다. 일부 양상들에서, UE는 RACH 기회의 다수의 PRACH 송신 슬롯들에서, UE의 복수의 송신 빔들의 각각 의 송신 빔 상에서 PRACH 통신을 다수회 송신하기 위한 수단을 포함한다. 일부 양상들에서, UE는 어느 송신 빔이 기지국에 의해 수신되는 PRACH 통신을 송신하는지에 대한 결정에 적어도 부분적으로 기초하여, UE의 복수의 송신 빔들로부터, 기지국에 업링크 통신을 송신하기 위한 송 신 빔을 선택하기 위한 수단을 포함한다. 일부 양상들에서, UE는 제1 SSB 타입에 대응하는 SSB를 수신하는 것에 적어도 부분적으로 기초하여, UE에 의해 수신된 SSB를 송신하기 위해 사용된 기지국의 송신 빔 및 UE에 의해 수신된 SSB를 반사한 RIS로부터의 빔을 표시하는 PRACH 프리앰블을 선택하기 위한 수단을 포함하고, PRACH 통신은 PRACH 프리앰블을 포함한다. 일부 양상들에서, UE는 UE에 의해 수신된 SSB를 송신하기 위해 사용된 기지국의 송신 빔 및 UE에 의해 수신된 SSB를 반사한 RIS로부터의 빔에 대응하도록 RACH 기회를 선택하기 위한 수단을 포함한다. 일부 양상들에서, UE는 RACH 기회들과 SSB 타입들 사이의 맵핑에 적어도 부분적으로 기초하여 RACH 기회를 선택하기 위한 수단을 포함한다. 일부 양상들에서, UE는 제1 세트의 RACH 기회들로부터 RACH 기회를 선택하기 위한 수단을 포함한다. 일부 양상들에서, 기지국은, 기지국의 제1 송신 빔 상에서, RIS-보조 절차들을 위해 구성된 제1 SSB 타입에 대응하는 SSB의 다수의 송신들을 송신하기 위한 수단; SSB와 연관된 RACH 기회의 다수의 PRACH 송신 슬롯들을 통해 기지국의 다수의 수신 빔들을 사용하여 빔 스위핑을 수행하기 위한 수단; 또는 빔 스위핑 동안 제1 수신 빔 상에서 PRACH 통신을 UE로부터 RIS를 통해 수신하는 것에 기초하여, 기지국의 다수의 수신 빔들로 부터, UE로부터의 업링크 통신들을 수신하기 위한 제1 수신 빔을 선택하기 위한 수단을 포함한다. 기지국이 본 원에 설명된 동작들을 수행하기 위한 수단은, 예컨대, 송신 프로세서, TX MIMO 프로세서, 변조기 , 안테나, 복조기, MIMO 검출기, 수신 프로세서, 제어기/프로세서, 메모리 또는 스케줄러 중 하나 이상을 포함할 수 있다. 일부 양상들에서, 기지국은 제1 송신 빔 상에서 SSB의 다수의 송신들을 RIS를 향해 송신하기 위한 수단을 포함하고, 제1 송신 빔 상에서 SSB의 다수의 송신들 각각은 상이한 빔을 사용하여 상기 RIS에 의해 반사될 것이다. 일부 양상들에서, 기지국은 기지국의 제1 송신 빔 및 하나 이상의 다른 송신 빔들 각각 상에서, 제 1 SSB 타입에 대응하는 SSB의 다수의 송신들을 송신하기 위한 수단을 포함한다. 일부 양상들에서, 기지국은 PRACH 통신이 기지국의 다수의 수신 빔들의 개개의 수신 빔 상에서 수 신되는지 여부를 결정하기 위해, 개개의 수신 빔을 사용하여 다수의 PRACH 송신 슬롯들 각각을 모니터링하기 위 한 수단을 포함한다. 도 2의 블록들은 별개의 컴포넌트들로서 예시되지만, 블록들과 관련하여 위에서 설명된 기능들은 단일 하드웨어, 소프트웨어 또는 조합 컴포넌트로 또는 컴포넌트들의 다양한 조합들로 구현될 수 있다. 예를 들어, 송신 프로세서, 수신 프로세서 및/또는 TX MIMO 프로세서에 대해 설명된 기능들은 제어기/프로 세서에 의해 또는 제어기/프로세서의 제어 하에 수행될 수 있다. 앞서 표시된 바와 같이, 도 2는 일례로서 제공된다. 다른 예들은 도 2와 관련하여 설명된 것과는 상이 할 수 있다. 도 3은 본 개시의 다양한 양상들에 따른 빔 관리 절차들의 예들(300, 310, 및 320)을 예시하는 도면이다. 도 3에 도시된 바와 같이, 예들(300, 310 및 320)은 무선 네트워크(예를 들어, 무선 네트워크(10 0))에서 기지국과 통신하는 UE를 포함한다. 그러나, 도 3에 도시된 디바이스들은 예들로서 제공되며, 무선 네트워크는 다른 디바이스들 사이에서(예를 들어, UE와 기지국 또는 TRP 사이에서, 모바일 종단 노드와 제어 노드 사이에서, IAB(integrated access and backhaul) 자식 노드와 IAB 부모 노드 사 이에서, 스케줄링된 노드와 스케줄링 노드 사이 등에서) 통신 및 빔 관리를 지원할 수 있다. 일부 양상들에서, UE 및 기지국은 접속 상태(예를 들어, RRC(radio resource control) 접속 상태 등)에 있을 수 있다. 도 3에 도시된 바와 같이, 예는 CSI-RS(CSI(channel state information) reference signal)들을 사용하여 빔 관리를 수행하기 위해 통신하는 기지국 및 UE를 포함할 수 있다. 예는 제1 빔 관 리 절차(예를 들어, P1 CSI-RS 빔 관리)를 묘사한다. 제1 빔 관리 절차는 빔 선택 절차, 초기 빔 포착 절차, 빔 스위핑 절차, 셀 탐색 절차, 빔 탐색 절차 등으로 지칭될 수 있다. 도 3 및 예에 도시된 바와 같이, CSI-RS들은 기지국으로부터 UE에 송신되도록 구성될 수 있다. CSI-RS들은 주기적(예를 들어, RRC 시 그널링 등을 사용함), 반-영구적(예를 들어, MAC-CE(MAC(media access control) control element) 시그널링 등 을 사용함) 및/또는 비주기적(예를 들어, DCI(downlink control information) 등을 사용함)으로 구성될 수 있 다. 제1 빔 관리 절차는 기지국이 다수의 송신(Tx) 빔들에 걸쳐 빔 스위핑을 수행하는 것을 포함할 수 있다. 기지국은 빔 관리를 위해 각각의 송신 빔을 사용하여 CSI-RS를 송신할 수 있다. UE가 수신 (Rx) 빔 스위핑을 수행할 수 있게 하기 위해, 기지국은, UE가 다수의 송신 인스턴스들에서 수신 빔들을 통 해 스위핑할 수 있도록 동일한 RS 자원 세트 내에서 각각의 CSI-RS를 다수회 (예를 들어, 반복들로) 송신하기 위해 송신 빔을 사용할 수 있다. 예를 들어, 기지국이 N개의 송신 빔들의 세트를 갖고 UE가 M개의 수신 빔들의 세트를 갖는 경우, CSI-RS는 N개의 송신 빔들 각각 상에서 M번 송신될 수 있어서, UE는 송신 빔 당 CSI-RS의 M개의 인스턴스들을 수신할 수 있다. 즉, 기지국의 각각의 송신 빔에 대해, UE는 UE의 수신 빔들을 통해 빔 스위핑을 수행할 수 있다. 그 결과, 제1 빔 관리 절차는, 기지국 송신 빔 들/UE 수신 빔(들) 빔 쌍(들)의 선택을 지원하기 위해 UE가 상이한 수신 빔들을 사용하여 상이한 송 신 빔들 상에서 CSI-RS를 측정하는 것을 가능하게 할 수 있다. UE는, 기지국이 기지국과 UE 사이의 통신을 위한 하나 이상의 빔 쌍(들)을 선택할 수 있게 하기 위해, 측정들을 기지국에 보고 할 수 있다. 예가 CSI-RS들과 관련하여 설명되었지만, 제1 빔 관리 프로세스는 또한 전술된 바와 유사한 방식으로 빔 관리를 위해 SSB들을 사용할 수 있다. 도 3에 도시된 바와 같이, 예는 CSI-RS들을 사용하여 빔 관리를 수행하기 위해 통신하는 기지국 및 UE를 포함할 수 있다. 예는 제2 빔 관리 절차(예를 들어, P2 CSI-RS 빔 관리)를 묘사한다. 제2 빔 관리 절차는 빔 개량 절차, 기지국 빔 개량 절차, TRP 빔 개량 절차, 송신 빔 개량 절차 등 으로 지칭될 수 있다. 도 3 및 예에 도시된 바와 같이, CSI-RS들은 기지국으로부터 UE에 송신 되도록 구성될 수 있다. CSI-RS들은 (예를 들어, DCI 등을 사용하여) 비주기적이도록 구성될 수 있다. 제2 빔 관리 절차는 기지국이 하나 이상의 송신 빔들에 걸쳐 빔 스위핑을 수행하는 것을 포함할 수 있다. 하나 이상의 송신 빔들은 (예를 들어, 제1 빔 관리 절차와 관련하여 UE에 의해 보고된 측정들에 적어도 부분적으로 기초하여 결정되는) 기지국과 연관된 모든 송신 빔들의 서브세트일 수 있다. 기지국은 빔 관리 를 위해 하나 이상의 송신 빔들의 각각의 송신 빔을 사용하여 CSI-RS를 송신할 수 있다. UE는 (예컨대, 제1 빔 관리 절차와 관련하여 수행된 측정들에 적어도 부분적으로 기초하여 결정된) 단일(예컨대, 동일한) 수신 빔을 사용하여 각각의 CSI-RS를 측정할 수 있다. 제2 빔 관리 절차는, 기지국이 UE에 의해 보고된 CSI-RS들의 측정들(예컨대, 단일 수신 빔을 사용하여 UE에 의해 측정됨)에 적어도 부분적으로 기초하여 최 상의 송신 빔을 선택할 수 있게 할 수 있다. 도 3에 도시된 바와 같이, 예는 제3 빔 관리 절차(예를 들어, P3 CSI-RS 빔 관리)를 묘사한다. 제 3 빔 관리 절차는 빔 개량 절차, UE 빔 개량 절차, 수신 빔 개량 절차 등으로 지칭될 수 있다. 도 3 및 예 에 도시된 바와 같이, 하나 이상의 CSI-RS들은 기지국으로부터 UE에 송신되도록 구성될 수 있다. CSI-RS들은 (예를 들어, DCI 등을 사용하여) 비주기적이도록 구성될 수 있다. 제3 빔 관리 프로세스는 기지국이 단일 송신 빔을 사용하여 하나 이상의 CSI-RS들을 송신하는 것을 포함할 수 있다(예컨대, 제1 빔 관리 절차 및/또는 제2 빔 관리 절차와 관련하여 UE에 의해 보고된 측정들에 적어도 부분적으로 기초하여 결정됨). UE가 수신 빔 스위핑을 수행할 수 있게 하기 위해, 기지국은, UE가 다수의 송신 인스턴스 들에서 하나 이상의 수신 빔들을 통해 스위핑할 수 있도록 동일한 RS 자원 세트 내에서 CSI-RS를 다수회 (예를 들어, 반복들로) 송신하기 위해 송신 빔을 사용할 수 있다. 하나 이상의 수신 빔들은 UE와 연관된 모든 수신 빔들의 서브세트일 수 있다(예컨대, 제1 빔 관리 절차 및/또는 제2 빔 관리 절차와 관련하여 수행된 측정 들에 적어도 부분적으로 기초하여 결정됨). 제3 빔 관리 절차는, 기지국 및/또는 UE가, UE로부 터 수신된(예를 들어, 하나 이상의 수신 빔들을 사용한 송신 빔의 CSI-RS의) 보고된 측정들에 적어도 부분적으 로 기초하여 최상의 수신 빔을 선택할 수 있게 할 수 있다. 앞서 표시된 바와 같이, 도 3은 빔 관리 절차들의 예로서 제공된다. 빔 관리 절차들의 다른 예들은 도 3에 대해 설명된 것과 상이할 수 있다. 예를 들어, UE 및 기지국은 제2 빔 관리 절차를 수행하기 전 에 제3 빔 관리 절차를 수행할 수 있고, UE 및 기지국은 UE 송신 빔 등을 선택하기 위해 유사한 빔 관리 절차를 수행할 수 있다. 도 4는 본 개시의 다양한 양상들에 따른 SS(synchronization signal) 계층구조의 예를 예시하는 도면이다. 도 4에 도시된 바와 같이, SS 계층구조는 SS 버스트 0 내지 SS 버스트 N-1로 도시된 다수의 SS 버스 트들을 포함할 수 있는 SS 버스트 세트를 포함할 수 있으며, 여기서 N은 기지국에 의해 송신될 수 있 는 SS 버스트의 반복들의 최대 수이다. 추가로 도시된 바와 같이, 각각의 SS 버스트는 SSB 0 내지 SSB M-1로 도시된 하나 이상의 SSB들을 포함할 수 있으며, 여기서 M은 SS 버스트에 의해 반송될 수 있는 SSB들의 최대 수이다. 일부 양상들에서, 상이한 SSB들은 상이하게 빔형성될 수 있고(예컨대, 상이한 빔들을 사용하여 송신될 수 있음), 셀 탐색, 셀 포착, 빔 관리, 빔 선택 등을 위해 (예컨대, 초기 네트 워크 액세스 절차의 일부로서) 사용될 수 있다. SS 버스트 세트는 도 4에 도시된 바와 같이, 이를테면 매 X 밀리초마다 무선 노드(예를 들어, 기지국)에 의해 주기적으로 송신될 수 있다. 일부 양상들에서, SS 버 스트 세트는 도 4에 Y 밀리초로서 도시된 고정된 또는 동적 길이를 가질 수 있다. 일부 경우들에서, SS 버스트 세트 또는 SS 버스트는 DRS(discovery reference signal) 송신 윈도우, SMTC(SSB measurement time configuration) 윈도우 등으로 지칭될 수 있다. 일부 양상들에서, SSB는 PSS(primary synchronization signal), SSS(secondary synchronization signal), PBCH(physical broadcast channel) 등을 반송하는 자원들을 포함할 수 있 다. 일부 양상들에서, 다수의 SSB들은 (예컨대, 상이한 빔들 상에서의 송신을 갖는) SS 버스트에 포 함되고, PSS, SSS, 및/또는 PBCH는 SS 버스트의 각각의 SSB에 걸쳐 동일할 수 있다. 일부 양상들에서, 단일 SSB이 SS 버스트에 포함될 수 있다. 일부 양상들에서, SSB는 길이가 적 어도 4개의 심볼들(예컨대, OFDM 심볼들)일 수 있고, 여기서 각각의 심볼은 PSS(예를 들어, 하나의 심볼을 점유함), SSS(예를 들어, 하나의 심볼을 점유함) 및/또는 PBCH(예를 들어, 2개의 심볼들을 점유함) 중 하나 이상을 반송한다. 일부 양상들에서, SSB는 SS/PBCH 블록으로 지칭될 수 있다. 일부 양상들에서, SSB의 심볼들은 도 4에 도시된 바와 같이 연속적이다. 일부 양상들에서, SSB의 심볼들은 비연속적이다. 유사하게, 일부 양상들에서, SS 버스트의 하나 이상의 SSB들은 하나 이상의 슬롯들 동안 연속적인 라디오 자원들(예를 들어, 연속적인 심볼들)에서 송신될 수 있다. 추가적으 로 또는 대안적으로, SS 버스트의 하나 이상의 SSB들은 비연속적 라디오 자원들에서 송신될 수 있다. 일부 양상들에서, SS 버스트들은 버스트 기간을 가질 수 있고, SS 버스트의 SSB들은 버 스트 기간에 따라 무선 노드(예를 들어, 기지국)에 의해 송신될 수 있다. 이러한 경우, SSB들은 각 각의 SS 버스트 동안 반복될 수 있다. 일부 양상들에서, SS 버스트 세트는 버스트 세트 주기성을 가 질 수 있어서, SS 버스트 세트의 SS 버스트들은 고정된 버스트 세트 주기성에 따라 무선 노드에 의해 송신된다. 즉, SS 버스트들은 각각의 SS 버스트 세트 동안 반복될 수 있다. 일부 양상들에서, SSB는 SSB 인덱스를 포함할 수 있고, 이는 SSB를 반송하기 위해 사용되는 빔에 대응할 수 있다. UE는 다른 예들 중에서도, 초기 네트워크 액세스 절차 및/또는 셀 탐색 절차 동안 상이한 수신(Rx) 빔들을 사용하여 SSB들에 대해 모니터링 및/또는 측정할 수 있다. 모니터링 및/또는 측 정에 적어도 부분적으로 기초하여, UE는 최상의 신호 파라미터(예를 들어, RSRP 파라미터 등)를 갖는 하나 이상의 SSB들을 기지국에 표시할 수 있다. 기지국 및 UE는, 기지국과 UE 사이 의 통신을 위해(예컨대, RACH(random access channel) 절차 등을 위해) 사용될 하나 이상의 빔들을 선택하기 위 해 하나 이상의 표시된 SSB들을 사용할 수 있다. 추가적으로 또는 대안적으로, UE는, SSB가 수 신되는 셀(예를 들어, 서빙 셀)에 대한 셀 타이밍을 결정하기 위해 SSB 및/또는 SSB 인덱스를 사용할 수 있다. 앞서 표시된 바와 같이, 도 4는 일례로서 제공된다. 다른 예들은 도 4와 관련하여 설명된 것과는 상이 할 수 있다. 도 5는 본 개시의 다양한 양상들에 따른 SSB의 예를 예시하는 도면이다. 예에 도시된 SSB는 도 4와 관련하여 위에서 설명된 바와 같이, SS 버스트에서 하나 이상의 다른 SSB들과 함께 기지국에 의해 송신된 SSB일 수 있다. 기지국은 TDM(time division multiplexing) 방식에서 다수의 빔들을 사용하여 하나 이상의 SSB들 을 송신할 수 있다. 추가적으로 또는 대안적으로, 기지국은 FDM(frequency-division multiplexing) 방식 에서 다수의 빔들을 사용하여 하나 이상의 SSB들을 송신할 수 있다. 예를 들어, 하나 이상의 SSB들은 동기화 래스터에 따라 송신될 수 있다. 동기화 래스터는 기지국과 동기화하기 위해 UE에 의해 사용될 수 있 는 SSB들의 송신을 위해 예비된 시간 및 주파수 자원들을 표시할 수 있다. UE는 셀 탐색을 수행할 때 동 기화 래스터에 따라 주파수 대역을 스캐닝할 수 있다. 일부 양상들에서, UE는 기지국으로부터 하나 이상의 SSB들을 수신할 수 있다. 추가적으로 또는 대안적으로, UE는 다수의 기지국들로부터 하나 이 상의 SSB들을 수신할 수 있다. UE는 수신된 하나 이상의 SSB들에 기초하여 다운링크 동기화 정보 및/또는 시스템 정보를 포착할 수 있다. 일부 양상들에서, UE는 기지국의 특정 다운링크 빔 내에 로케이트될 수 있고, 결과적으로, 기지국으로부터 하나의 SSB를 수신할 수 있다. 즉, UE는 기지국과 연관 된 셀 내의 다른 SSB들의 송신을 인식하지 못할 수 있다. SSB는, 다른 예들 중에서도, 주파수 범위 및 SSB 심볼들 및 데이터 심볼들 둘 모두에 대한 SCS(subcarrier spacing)와 같은 파라미터들에 의존하여 상이한 패턴들 또는 구조들을 가질 수 있다. 예를 들 어, 도 5에 도시된 바와 같이, SSB는 시간 도메인에서 4개의 OFDM 심볼들을 점유하고, 주파수 도메인에서 240개 의 톤들/서브캐리어들(20개의 자원 블록들)을 점유할 수 있다. SSB 내에서, PSS는 SSB의 제1 OFDM 심볼의 127 개의 톤들/서브캐리어들(12개의 자원 블록들)을 점유할 수 있다. SSS는 SSB의 제3 OFDM 심볼의 127개의 톤들/ 서브캐리어들(12개의 자원 블록들)을 점유할 수 있다. PBCH는 제2 및 제4 OFDM 심볼들(의 20개의 자원 블록 들)을 완전히 점유하고, 제3 OFDM 심볼에서 SSS 위 및 아래에서 총 96개의 톤들/서브캐리어들(8개의 자원 블록 들)을 점유할 수 있다. UE는 PSS를 사용하여 기지국의 서브프레임/심볼 타이밍을 결정하고 물리 계 층 아이덴티티를 결정할 수 있다. UE는 물리 계층 셀 아이덴티티 그룹 번호 및 라디오 프레임 타이밍을 결정하기 위해 SSS를 사용할 수 있다. PBCH는 PBCH DMRS(PBCH demodulation reference signals) 및 PBCH 데이 터 신호들을 포함할 수 있다. 또한, PBCH는 MIB(master information block)를 반송할 수 있다. MIB는 시스템 대역폭에서 다수의 RB(resource block)들 및 SFN(system frame number)을 제공할 수 있다. 앞서 표시된 바와 같이, 도 5는 일례로서 제공된다. 다른 예들은 도 5와 관련하여 설명된 것과는 상이 할 수 있다. 도 6은 본 개시의 다양한 양상들에 따른 SSB 송신들을 위한 자원들의 예를 예시하는 도면이다. 도 6에 도시된 바와 같이, 프레임(예를 들어, 10 밀리초)은 2개의 동일한 크기의 하프 라디오 프레임 (half radio frame)들(예를 들어, 5 밀리초)로 분할될 수 있다. 각각의 하프 라디오 프레임은 하나 이상의 시 간 슬롯들을 포함할 수 있다. 기지국은 동기화 래스터에 따라 각각의 프레임의 2개의 하프 라디오 프레임들 중 하나 동안 동기화 버스트들을 송신할 수 있다. 예를 들어, 기지국은 하프 라디오 프레임의 슬롯 0 의 OFDM 심볼 2에서 시작하는 제1 SSB, 하프 라디오 프레임의 슬롯 0의 OFDM 심볼 8에서 시작하는 제2 SSB, 하 프 라디오 프레임의 슬롯 1의 OFDM 심볼 2에서 시작하는 제3 SSB, 및 하프 라디오 프레임의 슬롯 1의 OFDM 심볼 8에서 시작하는 제4 SSB를 송신할 수 있다. 추가적으로 또는 대안적으로, 기지국은 각각의 동기화 버스트를 이용하여 공간 영역을 커버하기 위 해 대응하는 Tx 빔을 사용하여 각각의 SSB를 송신할 수 있다. 예를 들어, 기지국은 결과적인 신호를 제1 방향으로 지향시키기 위해 Tx 빔 0을 사용하여 제1 SSB를, 결과적인 신호를 제2 방향으로 지향시키기 위해 Tx 빔 1을 사용하여 제2 SSB를, 결과적인 신호를 제3 방향으로 지향시키기 위해 Tx 빔 2를 사용하여 제3 SSB를, 그 리고 결과적인 신호를 제4 방향으로 지향시키기 위해 Tx 빔 3을 사용하여 제4 SSB를 송신할 수 있다. 기지국 은 대응하는 공간 필터를 사용하여 각각의 Tx 빔을 송신할 수 있다. 앞서 표시된 바와 같이, 도 6은 일례로서 제공된다. 다른 예들은 도 6과 관련하여 설명된 것과는 상이 할 수 있다. 도 7은 본 개시의 다양한 양상들에 따른 기지국과 UE 사이에 차단을 갖는 무선 통신 시스템들의 예들 (700 및 705)을 예시하는 도면이다. 예에 도시된 바와 같이, 무선 통신 시스템은 기지국들 및 UE들을 포함할 수 있다. 도 2 와 관련하여 위에서 설명된 바와 같이, 기지국들은 MIMO 안테나 기술 및 공간 프로세싱을 사용할 수 있다. 일부 경우들에서, 기지국들은 기지국들 내의 안테나 엘리먼트들의 빔형성 이득을 증가시키기 위해 AAU(active antenna unit)들을 이용함으로써 스루풋을 증가시키려고 시도할 수 있다. 예를 들어, 제1 기지국 (110a)은 송신된 에너지를 제1 UE(120a)를 향해 지향되는 공간적으로-필터링된 Tx 빔에 포커싱하기 위해 AAU를 사용할 수 있다. 그러나, AAU는 각각의 안테나 포트에 대해 개별 RF(radio frequency) 체인이 구현되도록 요구 할 수 있다. 이러한 구현에서, AAU의 사용은 각각의 RF가 신호들을 능동적으로 송신 및 수신할 때 전력 소비의 상당한 증가를 초래할 수 있다. 추가적으로, AAU 및 빔형성 기법들의 사용은 기지국의 커버리지 영역에서 UE들 모두에 서비스 를 제공하기에 충분하지 않을 수 있다. 예를 들어, 예에 도시된 바와 같이, 제1 기지국(110a)이 제2 UE(120b)와 통신하는 것을 방지할 수 있는 차단이 존재할 수 있다. 차단은 인공 구조(예를 들어, 고층 건물, 다리 등)일 수 있거나 또는 지형의 자연적인 특징부(예를 들어, 산, 고도의 변화 등)일 수 있다. 예에 도 시된 바와 같이, 차단의 경우들에서, 운영자는, 차단을 경험하는 영역(즉, 커버리지 홀)에 서비스 커버리지를 제공하기 위한 제2 기지국(110b)(예를 들어, 중계 기지국, 매크로 기지국, 펨토 기지국 또는 피코 기지국)을 설 치할 수 있다. 즉, 제2 기지국(110b)은 제2 UE(120b)와 통신하고 그에 서비스를 제공할 수 있다. 그러나, 이 러한 접근법은 활성 통신 장비의 복제로 인해 무선 통신 시스템에 복잡성을 추가하고 비용들을 증가시킬 수 있 다. 또한, 무선 통신 시스템에 기지국을 추가하는 것은 무선 통신 시스템의 전력 소비 요건들을 증가시킬 수 있다. 예에 도시된 바와 같이, 일부 양상들에서, 무선 통신 시스템은 제1 기지국들(110a), UE들 및 RIS를 포함할 수 있다. RIS는 채널 조건들을 변경하기 위해 입사 전자기파들을 조작하도록 동적으로 구성될 수 있는 수동 표면을 포함할 수 있다. 즉, RIS는 반사된 파들에 추가적인 전력을 주입하지 않으면 서 특정 방향으로 충돌하는 파들을 반사시키도록 구성될 수 있는 수동 디바이스일 수 있다. 기지국은 RIS에 송신되는 파들의 반사 방향을 제어하도록 RIS를 구성할 수 있다. 예에 도시된 바와 같이, 제1 기지국(110a)은 제1 기지국(110a)과 제2 UE(120b) 사이에 통신 채널을 확립하기 위해 차단을 회피하 는 전파 경로를 생성하기 위해 RIS를 사용할 수 있다. 제1 기지국(110a)은 제1 기지국(110a)의 Tx 빔 상 에서 송신된 신호를 제2 UE(120b)로 재지향시키기 위해 RIS의 산란, 반사 및 굴절 특성들 중 하나 이상을 동적으로 제어함으로써 전파 경로를 생성할 수 있다. 이러한 경우, 제1 기지국(110a)은 예에 도시된 제2 기지국(110b)에 대한 필요성 없이 제2 UE(120b)와 통신하기 위해 710을 사용할 수 있다. RIS는 RIS(71 0)에 의해 반사된 파들의 전력을 증폭시키지 않으며, 따라서 추가적인 기지국 또는 중계 디바이스보다 상당히 더 적은 전력을 소비한다. 따라서, 기지국과 UE 사이의 RIS-보조 통신은 무선 통신 시스템의 전력 소비 및/또 는 복잡도를 감소시킬 수 있다. 앞서 표시된 바와 같이, 도 7은 일례로서 제공된다. 다른 예들은 도 7과 관련하여 설명된 것과는 상이 할 수 있다. 도 8은 본 개시의 다양한 양상들에 따른 RIS를 갖는 무선 통신 시스템에서 SSB 송신의 예를 예시하 는 도면이다. 도 8에 도시된 바와 같이, 예에서, 무선 통신 시스템은 기지국, 제1 UE(120a), 제2 UE(102b) 및 RIS를 포함할 수 있다. 도 8에 도시된 바와 같이, 기지국은 타입 0 SSB를 송신할 수 있고, 제1 UE(120a)는 타입 0 SSB를 수신할 수 있다. 기지국은 기지국과 UE(예컨대, 제1 UE(120a)) 사이의 비-RIS-보조 통신을 위한 종래의 (또는 \"레거시\") 채널 트레이닝 절차들을 위한 타입 0 SSB들(\"레거시\" SSB들)을 포함하는 SS 버스트들을 주기적 으로 송신할 수 있다. 일부 양상들에서, 기지국은 대응하는 Tx 빔을 사용하여 SS 버스트의 각각의 타입 0 SSB를 송신할 수 있다. 예를 들어, 기지국은 기지국의 공간 커버리지 영역의 별개의 방향에서 대응 하는 타입 0 SSB를 송신하기 위해 대응하는 공간 필터를 사용하여 각각의 Tx 빔을 송신할 수 있다. 이러한 경 우, 타입 0 SSB들의 SS 버스트는 기지국의 공간 커버리지 영역의 적어도 일부에 대한 종래의 채널 트레이 닝 절차를 사용하여 초기 액세스를 제공하는 것을 초래할 수 있다. 제1 UE(120a)는 예를 들어, Rx 빔 스위핑을 사용하여 Rx 빔 상에서 타입 0 SSB를 수신하고, RACH 절차 를 개시하기 위해 PRACH 통신을 기지국에 송신할 수 있다. 이러한 경우, 기지국과 제1 UE(120a) 사 이에서 빔 대응이 유지될 수 있다. 즉, 제1 UE(120a)는 제1 UE(120a)가 SSB를 수신한 Rx 빔에 대응하는 Tx 빔 을 사용하여 PRACH 통신을 송신할 수 있고, 기지국은 제1 UE에 의해 수신된 SSB를 송신하기 위해 사 용된 Tx 빔에 대응하는 Rx 빔을 사용하여 PRACH 통신을 수신할 수 있다. 본원에서 사용된 바와 같이, 디바이스 (예컨대, 기지국 또는 UE)의 Tx 빔 및 Rx 빔은, 이들이 디바이스의 동일한 방향 또는 공간 필터에 대응할 때, 서로 대응한다. 일부 양상들에서, 기지국은 타입 1 SSB들을 포함하는 SS 버스트들을 주기적으로 송신할 수 있다. 타입 1 SSB들은 RIS-보조 채널 트레이닝 절차들(예를 들어, RIS-보조 초기 액세스 절차들)을 위해 구성된 SSB들 이다. 예를 들어, RIS-보조 절차들은, 기지국과 UE(예컨대, 제2 UE(120b)) 사이의 전파 경로를 생성하기 위해 RIS를 사용하여 기지국과 UE(예컨대, 제2 UE(120b)) 사이의 통신 채널을 확립하기 위한 채널 트 레이닝 절차들을 포함할 수 있다. 타입 1 SSB는 PSS, SSS 및 PBCH를 포함할 수 있다. 일부 양상들에서, 타입 1 SSB는, 타입 1 SSB와 연관된 별개의 동기화 주파수를 통해 타입 1 SSB를 송신함으로써 타입 0 SSB와 구별가능 할 수 있다. 일부 양상들에서, 타입 1 SSB는, 타입 1 SSB에 포함된 표시, 이를테면, 타입 1 SSB의 SSS에서의 표시 또는 타입 1 SSB의 PBCH에서의 표시에 의해 타입 0 SSB와 구별가능할 수 있다. 일부 양상들에서, 기지국은 상이한 Tx 빔들을 사용하여 SS 버스트의 다수의 타입 1 SSB들을 송신할 수 있다. 예를 들어, 기지국은 기지국의 공간 커버리지 영역의 별개의 방향에서 대응하는 타입 1 SSB를 송신하기 위해 대응하는 공간 필터를 사용하여 각각의 Tx 빔을 송신할 수 있다. 이러한 경우, 타입 1 SSB들의 동기화 버스트는 기지국의 공간 커버리지 영역의 적어도 일부에 서비스 커버리지를 제공하는 것을 초래할 수 있다. 추가적으로 또는 대안적으로, 기지국은 동일한 Tx 빔을 사용하여 SS 버스트의 다수의 타입 1 SSB들 을 송신할 수 있다. 예를 들어, 기지국은 RIS와 연관된 방향으로 송신되는 Tx 빔을 사용하여 다수의 타입 1 SSB들을 송신할 수 있다. 이 경우, 기지국은 타입 1 SSB들이 RIS의 공간 커버리지 영역의 별 개의 방향들에 대응하는 별개의 빔들 상에서 RIS로부터 반사되는 것을 보장하기 위해 RIS의 전파 특 성들을 제어할 수 있다. 예를 들어, 도 8에 도시된 바와 같이, 기지국은 RIS를 향해 지향된 Tx 빔 상에서 제1 타입 1 SSB를 송신할 수 있다. 기지국은 제1 타입 1 SSB가 RIS로부터 제1 빔(빔 0) 상 에서 제1 방향으로 반사되도록 RIS의 구성을 제어할 수 있다. 기지국은 RIS를 향해 지향된 Tx 빔 상에서 제2 타입 1 SSB를 추가로 송신할 수 있다. 기지국은 제2 타입 1 SSB가 RIS로부터 제2 빔 (빔 1) 상에서 제2 방향으로 반사되도록 RIS의 구성을 제어할 수 있다. 기지국은 RIS를 향해 지향된 Tx 빔 상에서 제3 타입 1 SSB를 추가로 송신할 수 있다. 기지국은 제3 타입 1 SSB가 RIS로부 터 제3 빔(빔 2) 상에서 제3 방향으로 반사되도록 RIS의 구성을 제어할 수 있다. 기지국은 RIS(71 0)를 향해 지향된 Tx 빔 상에서 제4 타입 1 SSB를 추가로 송신할 수 있다. 기지국은 제4 타입 1 SSB가 RIS로부터 제4 빔(빔 3) 상에서 제4 방향으로 반사되도록 RIS의 구성을 제어할 수 있다. RIS로 부터의 빔들과 연관된 반사 방향들은 RIS에 의해 도달가능한 기지국의 공간 커버리지 영역의 적어도 일부에 서비스 커버리지를 제공하도록 구성될 수 있다. 예를 들어, RIS의 반사 방향들은, 기지국의 공간 커버리지 영역의 일부에 대한 서비스 커버리지를 제공하도록 구성될 수 있으며, 그렇지 않으면 이는 차단 으로 인해 기지국에 의해 도달가능하지 않다. 도 8에 도시된 바와 같이, 제2 UE(120b)는 RIS로부터 반사된 하나 이상의 빔들을 통해, 기지국 에 의해 송신된 타입 1 SSB를 수신할 수 있다. 예를 들어, 제2 UE(120b)는 RIS로부터 제2 빔(빔 1) 상에서 반사된 타입 1 SSB를 수신할 수 있다. 타입 1 SSB를 수신하는 것에 적어도 부분적으로 기초하여 제2 UE(120b)는 RIS-보조 채널 트레이닝 절차(예를 들어, RIS-보조 초기 액세스 절차)를 개시할 수 있다. RIS-보조 채널 트레이닝 절차에서, 기지국은 RIS를 통해 기지국과 제2 UE(120b) 사이의 캐스케이드된 채 널을 결정할 수 있다. 캐스케이드된 채널은 기지국으로부터 RIS에 타입 1 SSB를 송신하는 데 사용되 는 Tx 빔, 제2 UE(120b)에 의해 수신된 타입 1 SSB가 반사된 RIS로부터의 빔, 및 타입 1 SSB를 수신하는 데 사용된 제2 UE(120b)의 수신 빔을 포함할 수 있다. 앞서 표시된 바와 같이, 도 8은 일례로서 제공된다. 다른 예들은 도 8과 관련하여 설명된 것과는 상이 할 수 있다. 도 9는 본 개시의 다양한 양상들에 따른 RIS를 갖는 무선 통신 시스템에서 상호성 없는 PRACH 송신의 예 를 예시하는 도면이다. 도 9에 도시된 바와 같이, 기지국은 RIS와 연관된 방향으로 Tx 빔 상에서 SSB(예컨대, 타입 1 SSB)를 송 신할 수 있다. RIS는 SSB를 반영할 수 있고, UE는 UE의 Rx 빔을 수신할 수 있다. UE는, UE가 SSB를 수신한 Rx 빔에 대응하는 Tx 빔 상에서 RIS를 향해 PRACH 통신을 송신할 수 있다. 그러나, RIS는 업링크 방향 및 다운 링크 방향에서 상이하게 동작할 수 있다. 예를 들어, RIS는 업링크 방향 및 다운링크 방향에서 충돌 각도와 반 사 각도 사이에 상이한 관계를 가질 수 있다. 따라서, RIS에 의해 반사된 업링크 및 다운링크 신호들의 방향들 사이에는 상호성이 존재하지 않을 수 있다. 따라서, 도 9에 도시된 바와 같이, UE에 의해 송신된 PRACH 통신은, 기지국이 SSB를 송신하기 위해 기지국에 의해 사용된 Tx 빔에 대응하는 Rx 빔 상에서 PRACH 통신을 수 신하지 못할 수 있도록 하는 방향으로 RIS로부터 반영될 수 있다. 앞서 설명된 바와 같이, 비-RIS-보조 초기 액세스 절차에서 기지국과 UE 사이에서 빔 대응이 유지된다. 즉, UE는 UE에 의해 SSB가 수신되는 Rx 빔에 대응하는 Tx 빔 상에서 PRACH 통신을 송신할 수 있고, 기지국은 UE 에 의해 수신된 SSB가 송신되는 Tx 빔에 대응하는 Rx 빔 상에서 PRACH 통신을 수신할 수 있다. 그러나, 도 9에 도시된 바와 같이, 이러한 빔 대응은 RIS-보조 초기 액세스 절차에서 유지되지 않을 수 있다. 따라서, 기지국 은 RIS에 의해 반영된 PRACH 통신들을 수신하지 않을 수 있으며, 이는 기지국과 UE 사이의 RIS-보조 통신에 대 한 초기 액세스가 실패하게 할 수 있다. 따라서, RIS를 사용하는 네트워크 커버리지가 감소될 수 있고, 이는 추가적인 기지국들 또는 중계 디바이스들과 연관된 증가된 전력 소비 및 네트워크 복잡성을 초래할 수 있다. 본원에 설명된 일부 기법들 또는 장치들은 상호성의 부재 시에 RIS-보조 통신에 대한 초기 액세스를 가 능하게 한다. 일부 양상들에서, UE는 기지국으로부터 RIS를 통해, RIS-보조 절차들을 위해 구성된 제1 SSB 타 입에 대응하는 SSB를 수신할 수 있다. UE는 제1 SSB 타입에 대응하는 SSB를 수신하는 것에 기초하여 다수의 PRACH 송신 슬롯들을 포함하는 RACH 기회를 선택할 수 있다. UE는 다수의 송신 슬롯들에서 PRACH 통신을 송신 하여, UE가 다수의 PRACH 통신들을 송신하게 할 수 있다. 기지국은 RACH 기회의 다수의 PRACH 송신 슬롯들을 통해 기지국의 다수의 Rx 빔들을 사용하여 빔 스위핑을 수행할 수 있다. 기지국은 빔 스위핑 동안 제1 수신 빔 상에서 PRACH 통신을 UE로부터 RIS를 통해 수신하는 것에 적어도 부분적으로 기초하여, 기지국의 다수의 수신 빔들로부터, UE로부터의 업링크 통신들을 수신하기 위한 제1 수신 빔을 선택할 수 있다. 그 결과, 빔 대응이 업링크 및 다운링크 방향들에서 유지되지 않는 경우에도, 기지국은 UE로부터 PRACH 통신을 수신하고 RIS-보조 초기 액세스를 허용할 수 있다. 이는 RIS-보조 통신들의 신뢰성을 증가시키고, 따라서 추가적인 기지국들 및/ 또는 중계 디바이스들 대신에 RIS-보조 통신들이 사용될 수 있게 할 수 있으며, 이는 무선 통신 시스템의 전력 소비 및 네트워크 복잡성을 감소시킬 수 있다. 앞서 표시된 바와 같이, 도 9는 일례로서 제공된다. 다른 예들은 도 9와 관련하여 설명된 것과는 상이 할 수 있다. 도 10은 본 개시의 다양한 양상들에 따른 RIS-보조 통신을 위한 초기 액세스와 연관된 예를 예시 하는 도면이다. 도 10에 도시된 바와 같이, 예는 기지국, UE 및 RIS 사이의 통신을 포 함한다. 일부 양상들에서, 기지국, UE는 무선 네트워크와 같은 무선 네트워크에 포함될 수 있 다. 기지국 및 UE는 업링크 및 다운링크를 포함할 수 있는 무선 액세스 링크를 통해 통신할 수 있다. 일부 양상들에서, 기지국 및 UE는 RIS에 의해 반사된 신호들을 통해 통신할 수 있다. 도 10에서 참조 번호로 도시된 바와 같이, 기지국은 기지국의 제1 Tx 빔 상에서 다수의 SSB들(예컨대, SSB 1, SSB 2, ..., SSB N)을 송신할 수 있다. 일부 양상들에서, 기지국은 SSB 버스트에 서, RIS-보조 절차들을 위해 구성된 제1 타입의 SSB에 대응하는 SSB의 다수의 송신들을 송신할 수 있다. 예를 들어, 기지국은 본원의 다른 곳에서 설명된 바와 같이, 제1 Tx 빔 상에서 다수의 타입 1 SSB들을 송신할 수 있다. 일부 양상들에서, 기지국은 제1 TX 빔 상에서 N개의 타입 1 SSB들을 송신할 수 있고, 여기서 N은 RIS에 의해 수행되는 빔 스위핑 절차에서 RIS에 의해 반사될 빔들의 수에 대응한다. 일부 양상들에 서, 제1 Tx 빔은 RIS와 연관된 방향으로 송신되는 Tx 빔일 수 있다. 예를 들어, 기지국은 제1 송신 빔이 RIS의 방향으로 송신된다는 것을 표시하는 정보를 저장할 수 있고, 기지국은 SS 버스트에서 제1 Tx 빔 상에서 RIS를 향해 다수의 타입 1 SSB들을 송신할 수 있다. 일부 양상들에서, 기지국은 제1 Tx 빔을 포함하는 다수의 Tx 빔들 각각 상에서 다수의 타입 1 SSB 들을 송신할 수 있다. 이러한 경우, 기지국은 다수의 Tx 빔들의 각각의 Tx 빔 상에서 N개의 타입 1 SSB들 을 송신할 수 있다. 예를 들어, 다수의 Tx 빔들은 기지국의 Tx 빔들 전부 또는 서브세트일 수 있다. 일 부 양상들에서, 다수의 Tx 빔들은 RIS와 연관된 방향들을 갖는 기지국의 다수의 Tx 빔들일 수 있다. 도 10에 참조 번호로 추가로 도시된 바와 같이, RIS는 기지국에 의해 제1 Tx 빔 상에 서 송신된 SSB들을 RIS로부터의 다수의 빔들 상에서 반사할 수 있다. 일부 양상들에서, RIS는 N개의 상이한 방향들에서 SSB들을 반사시킴으로써 N개의 빔들에 걸쳐 빔 스위핑을 수행할 수 있다. 예를 들어, RIS는 기지국에 의해 제1 Tx 빔 상에서 송신된 N개의 SSB들 중 각각의 SSB를 RIS로부터의 개개 의 반사 방향과 연관된 개개의 빔 상에서 반사할 수 있다. 일부 양상들에서, 기지국은 다수의 Tx 빔들 각각 상에서 다수의 SSB들(예를 들어, N개의 타입 1 SSB들)을 송신할 수 있다. 이러한 경우, RIS는 기지국의 각각의 Tx 빔 상에서 송신된 SSB들을 RIS로부터의 다수의 빔들 상에서 반사함으로써 기지국의 각각의 Tx 빔에 대한 빔 스위핑을 수행할 수 있다. 일부 양상들에서, 기지국은 RIS로부터의 다수의 빔들 상에서 SSB들을 반사하도록 RIS를 제어할 수 있다. 예를 들어, 기지국은 RIS로부터의 다수의 빔들 상에서 SSB들을 반사하도록 RIS를 제어하기 위해, RIS의 산란, 반사 및 굴절 특성들 중 하나 이상을 포함하는 RIS의 구성을 제어할 수 있다. 일부 양상들에서, RIS는, SSB들이 타입 1 SSB들과 연관된 시간 및/또는 주파수 자원들에 서 송신되는 것에 적어도 부분적으로 기초하여 RIS로부터의 다수의 빔들 상에서 SSB들을 반사하도록 구성 될 수 있다. 도 10에서 참조 번호로 추가로 도시된 바와 같이, UE는 기지국에 의해 송신되고 RIS에 의해 반사된 SSB들 중 하나를 수신할 수 있고, UE는 SSB에 적어도 부분적으로 기초하여 RACH 기회를 선택할 수 있다. 일부 양상들에서, UE는 기지국의 제1 Tx 빔 상에서 송신되는 N개의 SSB들 중 SSB(SSB m)를 수신할 수 있다. UE는 RIS로부터 반사된 대응하는 빔(beam m) 상에서 SSB(SSB m) 를 수신할 수 있다. UE에 의해 수신된 SSB는 RIS-보조 절차들을 위해 구성된 제1 타입의 SSB(예컨대, 타 입 1 SSB)에 대응할 수 있다. 일부 양상들에서, UE는 타입 1 SSB를 수신하는 것에 적어도 부분적으로 기초하여 다수의 PRACH 송 신 슬롯들을 포함하는 RACH 기회를 선택할 수 있다. RACH 기회는 UE가 기지국과 RACH 절차를 개시하 기 위한 PRACH 통신을 송신하기 위해 사용하기 위한 자원들(예를 들어, 시간 및/또는 주파수 자원들)을 포함할 수 있다. 본원에서 사용되는 바와 같이, \"PRACH 송신 슬롯\"은 UE가 PRACH 통신을 송신하기 위한 시간 및/ 또는 주파수 자원(또는 시간 및/또는 주파수 자원들의 세트)에 대응한다. 일부 양상들에서, UE는 RACH 기 회들과 SSB 타입들 사이의 맵핑에 기초하여 RACH 기회를 선택할 수 있다. 예를 들어, 맵핑은 RIS-보조 절차들 을 위해 구성된 제1 SSB 타입(예컨대, 타입 1 SSB)과 연관된 제1 세트의 RACH 기회들 및 비-RIS-보조 절차들을 위해 구성된 제2 SSB 타입(예컨대, 타입 0 SSB)과 연관된 제2 세트의 RACH 기회들을 포함할 수 있다. 이러한 경우, 제1 세트의 RACH 기회들 각각은 다수의 PRACH 송신 슬롯들을 포함할 수 있고, UE는 제1 세트의 RACH 기회들로부터 RACH 기회를 선택할 수 있다. 일부 양상들에서, UE는, UE에 의해 수신된 SSB를 송신하기 위해 사용된 기지국의 Tx 빔 (예컨대, 제1 Tx 빔) 및/또는 UE가 SSB를 수신한 RIS로부터 반사된 빔(예컨대, 빔 m)에 대응하는 RACH 기회를 (예컨대, 제1 세트의 RACH 기회들로부터) 선택할 수 있다. 이러한 경우, 선택된 RACH 기회는,UE가 SSB를 수신하게 한 RIS로부터의 반사된 빔 및/또는 기지국의 Tx 빔의 표시를 기지국 에 제공할 수 있다. 도 10에서 참조 번호로 추가로 도시된 바와 같이, UE는 RACH 기회에서 다수의 PRACH 통신들 을 송신할 수 있다. 예를 들어, UE는 RACH 기회에서 다수의 PRACH 송신 슬롯들 각각에서 PRACH 통신을 수 행할 수 있다. 일부 양상들에서, UE는, UE에 의해 수신된 SSB를 송신하기 위해 사용된 기지국 의 Tx 빔(예컨대, 제1 Tx 빔) 및/또는 UE에 의해 SSB가 수신된 RIS로부터 반사된 빔(예컨대, 빔 m) 의 표시를 PRACH에서 인코딩할 수 있다. 예를 들어, UE는, 타입 1 SSB를 수신하는 것에 적어도 부분적으 로 기초하여, UE에 의해 수신된 SSB를 송신하기 위해 사용된 기지국의 Tx 빔 및/또는 UE에 의해 SSB가 수신된 RIS로부터 반사된 빔을 표시하는 PRACH 프리앰블을 선택할 수 있다. 추가적으로 또는 대안 적으로, 위에서 설명된 바와 같이, UE에 의해 선택된 RACH 기회는 기지국의 Tx 빔 및/또는 UE가 SSB를 수신하게 한 RIS로부터의 반사된 빔의 표시를 제공할 수 있다. UE는 M개의 PRACH 통신들을 송신할 수 있다. 일부 양상들에서, UE는 UE의 동일한 Tx 빔을 사용하여 M개의 PRACH 통신들을 송신할 수 있다. 예를 들어, UE는 SSB를 수신한 UE의 Rx 빔에 대응하는 TX 빔을 사용하여 M개의 PRACH 통신들을 송신할 수 있다. 일부 양상들에서, M개의 PRACH 통신들은 기 지국에 의한 Rx 빔 스위핑 절차에서 사용될 기지국의 M개의 Rx 빔들에 대응할 수 있다. 일부 양상들 에서, UE에 의해 송신된 M개의 PRACH 통신들은 기지국에 의한 빔 스위핑 절차에서 사용될 Rx 빔들의 수에 RIS에 의해 반사될 빔들의 수를 곱한 것에 대응할 수 있다. 일부 양상들에서, UE는 UE의 복수의 Tx 빔들의 각각의 Tx 빔 상에서 PRACH 통신을 다수회 송 신할 수 있다. 예를 들어, UE는, SSB가 수신된 Rx 빔에 대응하는 Tx 빔만을 사용하는 대신에, PRACH 통신 들을 이용하여 Tx 빔 스위핑을 수행할 수 있다. 이러한 경우, UE의 각각의 Tx 빔 상에서 송신되는 PRACH 통신은 기지국에 의한 빔 스위핑 절차에서 사용될 Rx 빔들의 수에 대응하는 횟수만큼 반복될 수 있다. 일 부 양상들에서, UE의 각각의 TX 빔 상에서 송신되는 PRACH 통신은 또한 RIS에 의해 반사될 빔들의 수 에 대응하는 추가적인 횟수만큼 반복될 수 있다. 도 10에서 참조 번호로 추가로 도시된 바와 같이, RIS는 UE에 의해 송신된 PRACH 통신 들을 반사할 수 있다. 일부 양상들에서, 다운링크 통신들에 대한 것과 동일한 RIS의 구성이 업링크 통신 들에 대해 사용될 수 있다. 이 경우, RIS는 UE가 SSB를 수신하게 하는 구성으로 유지될 수 있고, RIS는 RIS의 구성에 기초하여 PRACH 통신들 각각을 반영할 수 있다. 예를 들어, RIS의 구성은 RACH 기회에 기초할 수 있고, 이는 UE에 의해 SSB가 수신된 RIS로부터 반사된 빔에 적어도 부분적으 로 기초하여 선택될 수 있다. 일부 양상들에서, RIS는, UE에 의해 송신된 PRACH 통신들을 RIS(71 0)와 상이한 방향들의 상이한 빔들 상에서 반사함으로써 업링크 방향으로 빔 스위핑을 수행할 수 있다. 도 10에서 참조 번호로 추가로 도시된 바와 같이, 기지국은 UE로부터의 통신들을 수신 하기 위한 Rx 빔을 결정하기 위해 기지국의 다수의 Rx 빔들을 사용하여 Rx 빔 스위핑을 수행할 수 있다. 일부 양상들에서, UE는 SSB와 연관된 RACH 기회의 다수의 PRACH 송신 슬롯들을 통해 다수의 Rx 빔들을 사 용하여 Rx 빔 스위핑을 수행할 수 있다. 예를 들어, RACH 기회는 기지국의 제1 Tx 빔 상에서 송신되는 타 입 1 SSB와 연관될 수 있다. RACH 기회는 또한 SS 버스트에서의 송신 자원과 연관될 수 있고, 송신 자원은 RIS에 의해 SSB가 반사된 빔(예를 들어, 빔 m)에 대응할 수 있다. 기지국은 Rx 빔들 중 하나 이상 상에서 PRACH 통신이 수신되는지 여부를 결정하기 위해 상이한 Rx 빔들을 사용하여 RACH 기회에서 PRACH 송신 슬롯들을 모니터링할 수 있다. 일부 양상들에서, 기지국은 기 지국의 개개의 Rx 빔으로 RACH 기회에서 각각의 PRACH 송신 슬롯을 모니터링할 수 있다. 기지국은, 빔 스위핑 동안 Rx 빔 상에서 PRACH 통신을 수신하는 것에 적어도 부분적으로 기초하여, 기지국의 다수의 Rx 빔들로부터, RIS를 통해 UE로부터 업링크 통신들을 수신하기 위한 Rx 빔을 선택할 수 있다. 일부 양상들에서, 기지국은 빔 스위핑 동안 하나 초과의 Rx 빔들 상에서 PRACH 통신들을 수신할 수 있다. 이 경우, 기지국은 예를 들어, Rx 빔들 상의 신호 강도들에 대한 비교에 적어도 부분적 으로 기초하여 PRACH 통신들을 수신한 다수의 Rx 빔들로부터 Rx 빔을 선택할 수 있다. 기지국은 PRACH 통신에서 인코딩된 표시에 적어도 부분적으로 기초하여 RIS를 통한 UE와 의 다운링크 통신들에 사용할 RIS의 구성 및 Tx 빔을 결정할 수 있다. 예를 들어, 기지국은 PRACH 통신이 수신되는 RACH 기회 및/또는 PRACH 프리앰블에 적어도 부분적으로 기초하여 UE와의 다운링크 통신들에 사용할 RIS의 구성 및 Tx 빔을 결정할 수 있다. 일부 양상들에서, UE와의 다운링크 통신들을 위해 기지국에 의해 선택된 Rx 빔(예컨대, PRACH 통신이 수신되는 Rx 빔)은 기지국에 의해 SSB가 송 신된 Tx 빔(예컨대, 제1 Tx 빔)에 대응하지 않을 수 있다. UE가 PRACH 통신들로 Tx 빔 스위핑을 수행하는 경우, 기지국은 기지국에 의해 PRACH 통 신이 수신되는 PRACH 송신 슬롯에 적어도 부분적으로 기초하여 UE가 기지국과의 업링크 통신들에 사 용할 Tx 빔을 결정할 수 있다. 기지국은 예를 들어, 업링크 TCI(transmission configuration indicator) 상태에서 UE가 업링크 통신들에 사용할 Tx 빔의 표시를 제공할 수 있다. 일부 양상들에서, UE가 업 링크 통신들에 사용할 Tx 빔은 SSB가 수신된 UE의 Rx 빔에 대응하지 않을 수 있다. 도 10과 관련하여 위에서 설명된 바와 같이, UE는, 기지국으로부터 RIS를 통해, RIS-보 조 절차들을 위해 구성된 제1 SSB 타입에 대응하는 SSB를 수신할 수 있다. UE는 제1 SSB 타입에 대응하는 SSB를 수신하는 것에 기초하여 다수의 PRACH 송신 슬롯들을 포함하는 RACH 기회를 선택할 수 있다. UE는 다수의 송신 슬롯들에서 PRACH 통신을 송신하여, UE가 다수의 PRACH 통신들을 송신하게 할 수 있다. 기지 국은 RACH 기회의 다수의 PRACH 송신 슬롯들을 통해 기지국의 다수의 Rx 빔들을 사용하여 빔 스위핑을 수 행할 수 있다. 기지국은 빔 스위핑 동안 제1 수신 빔 상에서 PRACH 통신을 UE로부터 RIS를 통 해 수신하는 것에 적어도 부분적으로 기초하여, 기지국의 다수의 수신 빔들로부터, UE로부터의 업링크 통 신들을 수신하기 위한 제1 수신 빔을 선택할 수 있다. 그 결과, 빔 대응이 업링크 및 다운링크 방향들에서 유 지되지 않는 경우에도, 기지국은 UE로부터 PRACH 통신을 수신하고 RIS-보조 초기 액세스를 허용할 수 있다. 이 는 RIS-보조 통신들의 신뢰성을 증가시키고, 따라서 추가적인 기지국들 및/또는 중계 디바이스들 대신에 RIS-보 조 통신들이 사용될 수 있게 할 수 있으며, 이는 무선 통신 시스템의 전력 소비 및 네트워크 복잡성을 감소시킬 수 있다. 앞서 표시된 바와 같이, 도 10은 일례로서 제공된다. 다른 예들은 도 10과 관련하여 설명된 것과는 상 이할 수 있다. 도 11은, 본 개시의 다양한 양상들에 따른, 예를 들어, UE에 의해 수행되는 예시적인 프로세스를 예시하는 도면이다. 예시적인 프로세스는, UE(예컨대, UE)가 RIS-보조 통신을 위한 초기 액세스와 연관된 동작들을 수행하는 예이다. 도 11에 도시된 바와 같이, 일부 양상들에서, 프로세스는 기지국으로부터 RIS를 통해, RIS-보조 절차들을 위해 구성된 제1 SSB 타입에 대응하는 SSB를 수신하는 것을 포함할 수 있다(블록). 예를 들어, (예컨대, 도 13에 도시된 수신 컴포넌트를 사용하여) UE는 위에서 설명된 바와 같이, 기지국으로부터 RIS(reconfigurable intelligent surface)를 통해, RIS-보조 절차들을 위해 구성된 제1 SSB(synchronization signal block) 타입에 대응하는 SSB를 수신할 수 있다. 도 11에 추가로 도시된 바와 같이, 일부 양상들에서, 프로세스는 제1 SSB 타입에 대응하는 SSB를 수신하는 것에 적어도 부분적으로 기초하여 다수의 PRACH 송신 슬롯들을 포함하는 RACH 기회를 선택하는 것을 포함할 수 있다(블록). 예를 들어, UE는 (예컨대, 도 13에 도시된 선택 컴포넌트를 사용하여) 위 에서 설명된 바와 같이, 제1 SSB 타입에 대응하는 SSB를 수신하는 것에 적어도 부분적으로 기초하여 다수의 PRACH 송신 슬롯들을 포함하는 RACH 기회를 선택할 수 있다. 도 11에 추가로 도시된 바와 같이, 일부 양상들에서, 프로세스는 RACH 기회의 다수의 PRACH 송신 슬롯들에서 PRACH 통신을 기지국에 송신하는 것을 포함할 수 있다(블록). 예를 들어, UE는 (예컨대, 도 13에 도시된 송신 컴포넌트를 사용하여) 위에서 설명된 바와 같이, RACH 기회의 다수의 PRACH 송신 슬롯 들에서 PRACH 통신을 기지국에 송신할 수 있다. 프로세스는, 아래에서 그리고/또는 본원의 다른 곳에서 설명된 하나 이상의 다른 프로세스들과 관 련하여 설명된 임의의 단일 양상 또는 양상들의 임의의 조합과 같은 추가적인 양상들을 포함할 수 있다. 제1 양상에서, 제1 SSB 타입에 대응하는 SSB를 수신하는 것은 UE의 수신 빔 상에서 RIS에 의해 반사된 SSB를 수신하는 것을 포함하고, PRACH 통신을 송신하는 것은, SSB를 수신한 UE의 수신 빔에 대응하는 UE의 송신 빔 상에서 RACH 기회의 다수의 PRACH 송신 슬롯들에서 PRACH 통신을 송신하는 것을 포함한다. 제2 양상에서, PRACH 통신을 송신하는 것은, RACH 기회의 다수의 PRACH 송신 슬롯들에서, UE의 복수의 송신 빔들의 각각의 송신 빔 상에서 PRACH 통신을 다수회 송신하는 것을 포함한다. 제3 양상에서, 단독으로 또는 제1 및 제2 양상들 중 하나 이상과 조합하여, 프로세스는, 어느 송 신 빔이 기지국에 의해 수신되는 PRACH 통신을 송신하는지에 대한 결정에 적어도 부분적으로 기초하여, UE의 복 수의 송신 빔들로부터, 기지국에 업링크 통신을 송신하기 위한 송신 빔을 선택하는 것을 포함한다. 제4 양상에서, 단독으로 또는 제1 내지 제3 양상들 중 하나 이상과 조합하여, 프로세스는 제1 SSB 타입에 대응하는 SSB를 수신하는 것에 적어도 부분적으로 기초하여, UE에 의해 수신된 SSB를 송신하기 위해 사 용된 기지국의 송신 빔 및 UE에 의해 수신된 SSB를 반사한 RIS로부터의 빔을 표시하는 PRACH 프리앰블을 선택하 는 것을 포함하고, PRACH 통신은 PRACH 프리앰블을 포함한다. 제5 양상에서, 단독으로 또는 제1 내지 제4 양상들 중 하나 이상과 조합하여, RACH 기회를 선택하는 것 은, UE에 의해 수신된 SSB를 송신하기 위해 사용된 기지국의 송신 빔 및 UE에 의해 수신된 SSB를 반사한 RIS로 부터의 빔에 대응하도록 RACH 기회를 선택하는 것을 포함한다. 제6 양상에서, 단독으로 또는 제1 내지 제5 양상들 중 하나 이상과 조합하여, RACH 기회를 선택하는 것 은 RACH 기회들과 SSB 타입들 사이의 맵핑에 적어도 부분적으로 기초하여 RACH 기회를 선택하는 것을 포함한다. 제7 양상에서, 단독으로 또는 제1 내지 제6 양상들 중 하나 이상과 조합하여, 맵핑은 제1 SSB 타입과 연 관된 제1 세트의 RACH 기회들 및 비-RIS 보조 절차들에 대해 구성된 제2 SSB 타입과 연관된 제2 세트의 RACH 기 회들을 포함하고, RACH 기회를 선택하는 것은 제1 세트의 RACH 기회들로부터 RACH 기회를 선택하는 것을 포함한 다. 도 11은 프로세스의 예시적인 블록들을 도시하지만, 일부 양상들에서, 프로세스는 도 11에 도시된 것보다 추가적인 블록들, 더 적은 블록들, 상이한 블록들 또는 상이하게 배열된 블록들을 포함할 수 있 다. 추가적으로 또는 대안적으로, 프로세스의 블록들 중 둘 이상은 병렬적으로 수행될 수 있다. 도 12는, 본 개시의 다양한 양상들에 따른, 예를 들어, 기지국에 의해 수행되는 예시적인 프로세스 를 예시하는 도면이다. 예시적인 프로세스는, 기지국(예컨대, 기지국)가 RIS-보조 통신을 위 한 초기 액세스와 연관된 동작들을 수행하는 예이다. 도 12에 도시된 바와 같이, 일부 양상들에서, 프로세스는 기지국의 제1 송신 빔 상에서, RIS-보조 절차들을 위해 구성된 제1 SSB 타입에 대응하는 SSB의 다수의 송신들을 송신하는 것을 포함할 수 있다(블록 ). 예를 들어, 기지국은 (예컨대, 도 14에 도시된 송신 컴포넌트를 사용하여) 위에서 설명된 바와 같이, 기지국의 제1 송신 빔 상에서, RIS(reconfigurable intelligent surface)-보조 절차들을 위해 구성된 제 1 SSB(synchronization signal block) 타입에 대응하는 SSB의 다수의 송신들을 송신할 수 있다. 도 12에 추가로 도시된 바와 같이, 일부 양상들에서, 프로세스는 SSB와 연관된 RACH 기회의 다수 의 PRACH 송신 슬롯들을 통해 기지국의 다수의 수신 빔들을 사용하여 빔 스위핑을 수행하는 것을 포함할 수 있 다(블록). 예를 들어, 기지국은 (예컨대, 도 14에 도시된 빔 스위핑 컴포넌트를 사용하여) 위에서 설명된 바와 같이, SSB와 연관된 RACH 기회의 다수의 PRACH 송신 슬롯들을 통해 기지국의 다수의 수신 빔들을 사용하여 빔 스위핑을 수행할 수 있다. 도 12에 추가로 도시된 바와 같이, 일부 양상들에서, 프로세스는 빔 스위핑 동안 제1 수신 빔 상 에서 PRACH 통신을 UE로부터 RIS를 통해 수신하는 것에 기초하여, 기지국의 다수의 수신 빔들로부터, UE로부터 의 업링크 통신들을 수신하기 위한 제1 수신 빔을 선택하는 것을 포함할 수 있다(블록). 예를 들어, 기 지국은 (예컨대, 도 14에 도시된 선택 컴포넌트를 사용하여) 위에서 설명된 바와 같이, 빔 스위핑 동안 제1 수신 빔 상에서 PRACH 통신을 UE로부터 RIS를 통해 수신하는 것에 기초하여, 기지국의 다수의 수신 빔들로 부터, UE로부터의 업링크 통신들을 수신하기 위한 제1 수신 빔을 선택할 수 있다. 프로세스는, 아래에서 그리고/또는 본원의 다른 곳에서 설명된 하나 이상의 다른 프로세스들과 관 련하여 설명된 임의의 단일 양상 또는 양상들의 임의의 조합과 같은 추가적인 양상들을 포함할 수 있다. 제1 양상에서, 제1 SSB 타입에 대응하는 SSB의 다수의 송신들을 송신하는 것은, 제1 송신 빔 상에서 SSB 의 다수의 송신들을 RIS를 향해 송신하는 것을 포함하고, 제1 송신 빔 상에서 SSB의 다수의 송신들 각각은 상이 한 빔을 사용하여 RIS에 의해 반사될 것이다. 제2 양상에서, 단독으로 또는 제1 양상과 조합하여, 제1 SSB 타입에 대응하는 SSB의 다수의 송신들을 송 신하는 것은, 기지국의 제1 송신 빔 및 하나 이상의 다른 송신 빔들 각각 상에서, 제1 SSB 타입에 대응하는 SSB의 다수의 송신들을 송신하는 것을 포함한다. 제3 양상에서, 단독으로 또는 제1 및 제2 양상들 중 하나 이상과 조합하여, PRACH 통신은 SSB의 다수의 송신들 중 UE에 의해 수신되는 SSB의 송신과 연관된 RIS로부터의 빔 및 기지국의 제1 송신 빔을 표시하는 PRACH 프리앰블을 포함한다. 제4 양상에서, 단독으로 또는 제1 내지 제3 양상들 중 하나 이상과 조합하여, PRACH 통신이 수신되는 RACH 기회는, SSB의 다수의 송신들 중 UE에 의해 수신되는 SSB의 송신과 연관된 RIS로부터의 빔 및 기지국의 제 1 송신 빔에 대응한다. 제5 양상에서, 단독으로 또는 제1 내지 제4 양상들 중 하나 이상과 조합하여, RACH 기회의 다수의 PRACH 송신 슬롯들은 UE에 의한 PRACH 통신의 다수의 송신들과 연관되고, 기지국의 다수의 수신 빔들을 사용하여 빔 스위핑을 수행하는 것은, PRACH 통신이 기지국의 다수의 수신 빔들의 개개의 수신 빔 상에서 수신되는지 여부를 결정하기 위해, 개개의 수신 빔을 사용하여 다수의 PRACH 송신 슬롯들 각각을 모니터링하는 것을 포함한다. 제6 양상에서, 독립적으로 또는 제1 내지 제4 양상들 중 하나 이상과 조합하여, RACH 기회의 다수의 PRACH 송신 슬롯들은 UE에 의한 PRACH 통신의 다수의 송신들과 연관되고, RIS로부터의 다수의 빔들을 사용하여 반사된다. 제7 양상에서, 단독으로 또는 제1 내지 제6 양상들 중 하나 이상과 조합하여, 제1 송신 빔은 기지국의 제1 공간 필터에 대응하고, 제1 수신 빔은 기지국의 제2 공간 필터에 대응한다. 도 12는 프로세스의 예시적인 블록들을 도시하지만, 일부 양상들에서, 프로세스는 도 12에 도시된 것보다 추가적인 블록들, 더 적은 블록들, 상이한 블록들 또는 상이하게 배열된 블록들을 포함할 수 있 다. 추가적으로 또는 대안적으로, 프로세스의 블록들 중 둘 이상은 병렬적으로 수행될 수 있다. 도 13은 무선 통신을 위한 예시적인 장치의 블록도이다. 장치는 UE일 수 있거나, UE는 장 치를 포함할 수 있다. 일부 양상들에서, 장치는 (예를 들어, 하나 이상의 버스들 및/또는 하나 이 상의 다른 컴포넌트들을 통해) 서로 통신할 수 있는 수신 컴포넌트 및 송신 컴포넌트를 포함한다. 도시된 바와 같이, 장치는 수신 컴포넌트 및 송신 컴포넌트를 사용하여 다른 장치(이 를테면, UE, 기지국 또는 다른 무선 통신 디바이스)와 통신할 수 있다. 추가로 도시된 바와 같이, 장치 는 특히 선택 컴포넌트를 포함할 수 있다. 일부 양상들에서, 장치는 도 10과 관련하여 본원에 설명된 하나 이상의 동작들을 수행하도록 구성 될 수 있다. 추가적으로 또는 대안적으로, 장치는 본원에서 설명되는 하나 이상의 프로세스들, 이를테면, 도 11의 프로세스 또는 이들의 조합을 수행하도록 구성될 수 있다. 일부 양상들에서, 도 13에 도시된 장치 및/또는 하나 이상의 컴포넌트들은 도 2와 관련하여 위에서 설명된 UE의 하나 이상의 컴포넌 트들을 포함할 수 있다. 추가적으로 또는 대안적으로, 도 13에 도시된 하나 이상의 컴포넌트들은 도 2와 관련 하여 위에서 설명된 하나 이상의 컴포넌트들 내에서 구현될 수 있다. 추가적으로 또는 대안적으로, 컴포넌트들 의 세트의 하나 이상의 컴포넌트들은 메모리에 저장된 소프트웨어로서 적어도 부분적으로 구현될 수 있다. 예 를 들어, 컴포넌트(또는 컴포넌트의 일부)는 비일시적 컴퓨터 판독가능 매체에 저장되고 컴포넌트의 기능들 또 는 동작들을 수행하도록 제어기 또는 프로세서에 의해 실행가능한 명령들 또는 코드로서 구현될 수 있다. 수신 컴포넌트는 장치로부터 기준 신호들, 제어 정보, 데이터 통신들 또는 이들의 조합과 같은 통신들을 수신할 수 있다. 수신 컴포넌트는 수신된 통신들을 장치의 하나 이상의 다른 컴포 넌트들에 제공할 수 있다. 일부 양상들에서, 수신 컴포넌트는 수신된 통신들에 대한 신호 프로세싱(이를 테면, 다른 것들 중에서도, 필터링, 증폭, 복조, 아날로그-디지털 변환, 디멀티플렉싱, 디인터리빙, 디맵핑, 등 화, 간섭 제거 또는 디코딩)을 수행할 수 있고, 프로세싱된 신호들을 장치의 하나 이상의 다른 컴포넌트 들에 제공할 수 있다. 일부 양상들에서, 수신 컴포넌트는 도 2와 관련하여 위에서 설명된 UE의 하나 이 상의 안테나들, 복조기, MIMO 검출기, 수신 프로세서, 제어기/프로세서, 메모리, 또는 이들의 조합을 포함할 수 있다. 송신 컴포넌트는 기준 신호들, 제어 정보, 데이터 통신들 또는 이들의 조합과 같은 통신들을 장치 에 송신할 수 있다. 일부 양상들에서, 장치의 하나 이상의 다른 컴포넌트들은 통신들을 생성할 수 있고, 생성된 통신들을 장치로의 송신을 위해 송신 컴포넌트에 제공할 수 있다. 일부 양상들에서, 송신 컴포넌트는 생성된 통신들에 대해 신호 프로세싱(이를테면, 다른 예들 중에서도, 필터링, 증폭, 변 조, 디지털-아날로그 변환, 멀티플렉싱, 인터리빙, 맵핑 또는 인코딩)을 수행할 수 있고, 프로세싱된 신호들을장치에 송신할 수 있다. 일부 양상들에서, 송신 컴포넌트는 도 2와 관련하여 위에서 설명된 UE의 하나 이상의 안테나들, 변조기, 송신 MIMO 프로세서, 송신 프로세서, 제어기/프로세서, 메모리, 또는 이들의 조 합을 포함할 수 있다. 일부 양상들에서, 송신 컴포넌트는 트랜시버의 수신 컴포넌트와 코로케이트 될 수 있다. 수신 컴포넌트는 기지국으로부터 RIS를 통해, RIS-보조 절차들을 위해 구성된 제1 SSB 타입에 대 응하는 SSB를 수신할 수 있다. 선택 컴포넌트는 제1 SSB 타입에 대응하는 SSB를 수신하는 것에 적어도 부분적으로 기초하여 다수의 PRACH 송신 슬롯들을 포함하는 RACH 기회를 선택할 수 있다. 송신 컴포넌트(130 4)는 RACH 기회의 다수의 PRACH 송신 슬롯들에서 PRACH 통신을 기지국에 송신할 수 있다. 선택 컴포넌트는 어느 송신 빔이 기지국에 의해 수신되는 PRACH 통신을 송신하는지에 대한 결정에 적어도 부분적으로 기초하여, UE의 복수의 송신 빔들로부터, 기지국에 업링크 통신을 송신하기 위한 송신 빔을 선택할 수 있다. 선택 컴포넌트는 제1 SSB 타입에 대응하는 SSB를 수신하는 것에 적어도 부분적으로 기초하여, UE 에 의해 수신된 SSB를 송신하기 위해 사용된 기지국의 송신 빔 및 UE에 의해 수신된 SSB를 반사한 RIS로부터의 빔을 표시하는 PRACH 프리앰블을 선택할 수 있고, PRACH 통신은 PRACH 프리앰블을 포함한다. 도 13에 도시된 컴포넌트들의 수 및 배열은 일례로 제공된다. 실제로, 도 13에 도시된 것보다 추가적인 컴포넌트들, 더 적은 컴포넌트들, 상이한 컴포넌트들 또는 상이하게 배열된 컴포넌트들이 있을 수 있다. 또한, 도 13에 도시된 2개 이상의 컴포넌트들은 단일 컴포넌트 내에서 구현될 수 있거나, 또는 도 13에 도시된 단일 컴포넌트는 다수의 분산형 컴포넌트들로서 구현될 수 있다. 추가적으로 또는 대안적으로, 도 13에 도시된 컴포 넌트들의 세트(하나 이상)는 도 13에 도시된 컴포넌트들의 다른 세트에 의해 수행되고 있는 것으로 설명되는 하 나 이상의 기능들을 수행할 수 있다. 도 14는 무선 통신을 위한 예시적인 장치의 블록도이다. 장치는 기지국일 수 있거나 또는 기지국은 장치를 포함할 수 있다. 일부 양상들에서, 장치는 (예를 들어, 하나 이상의 버스들 및/ 또는 하나 이상의 다른 컴포넌트들을 통해) 서로 통신할 수 있는 수신 컴포넌트 및 송신 컴포넌트 를 포함한다. 도시된 바와 같이, 장치는 수신 컴포넌트 및 송신 컴포넌트를 사용하여 다른 장치(이를테면, UE, 기지국 또는 다른 무선 통신 디바이스)와 통신할 수 있다. 추가로 도시된 바와 같이, 장치는 다른 예들 중에서도, 빔 스위핑 컴포넌트 또는 선택 컴포넌트 중 하나 이상을 포함할 수 있다. 일부 양상들에서, 장치는 도 10과 관련하여 본원에 설명된 하나 이상의 동작들을 수행하도록 구성 될 수 있다. 추가적으로 또는 대안적으로, 장치는 본원에서 설명되는 하나 이상의 프로세스들, 이를테면, 도 12의 프로세스 또는 이들의 조합을 수행하도록 구성될 수 있다. 일부 양상들에서, 도 14에 도시된 장치 및/또는 하나 이상의 컴포넌트들은 도 2와 관련하여 위에서 설명된 기지국의 하나 이상의 컴 포넌트들을 포함할 수 있다. 추가적으로 또는 대안적으로, 도 14에 도시된 하나 이상의 컴포넌트들은 도 2와 관련하여 위에서 설명된 하나 이상의 컴포넌트들 내에서 구현될 수 있다. 추가적으로 또는 대안적으로, 컴포넌 트들의 세트의 하나 이상의 컴포넌트들은 메모리에 저장된 소프트웨어로서 적어도 부분적으로 구현될 수 있다. 예를 들어, 컴포넌트(또는 컴포넌트의 일부)는 비일시적 컴퓨터 판독가능 매체에 저장되고 컴포넌트의 기능들 또는 동작들을 수행하도록 제어기 또는 프로세서에 의해 실행가능한 명령들 또는 코드로서 구현될 수 있다. 수신 컴포넌트는 장치로부터 기준 신호들, 제어 정보, 데이터 통신들 또는 이들의 조합과 같은 통신들을 수신할 수 있다. 수신 컴포넌트는 수신된 통신들을 장치의 하나 이상의 다른 컴포 넌트들에 제공할 수 있다. 일부 양상들에서, 수신 컴포넌트는 수신된 통신들에 대한 신호 프로세싱(이를 테면, 다른 것들 중에서도, 필터링, 증폭, 복조, 아날로그-디지털 변환, 디멀티플렉싱, 디인터리빙, 디맵핑, 등 화, 간섭 제거 또는 디코딩)을 수행할 수 있고, 프로세싱된 신호들을 장치의 하나 이상의 다른 컴포넌트 들에 제공할 수 있다. 일부 양상들에서, 수신 컴포넌트는 도 2와 관련하여 위에서 설명된 기지국의 하나 이상의 안테나들, 복조기, MIMO 검출기, 수신 프로세서, 제어기/프로세서, 메모리, 또는 이들의 조합을 포함할 수 있다. 송신 컴포넌트는 기준 신호들, 제어 정보, 데이터 통신들 또는 이들의 조합과 같은 통신들을 장치 에 송신할 수 있다. 일부 양상들에서, 장치의 하나 이상의 다른 컴포넌트들은 통신들을 생성할 수 있고, 생성된 통신들을 장치로의 송신을 위해 송신 컴포넌트에 제공할 수 있다. 일부 양상들에서,송신 컴포넌트는 생성된 통신들에 대해 신호 프로세싱(이를테면, 다른 예들 중에서도, 필터링, 증폭, 변 조, 디지털-아날로그 변환, 멀티플렉싱, 인터리빙, 맵핑 또는 인코딩)을 수행할 수 있고, 프로세싱된 신호들을 장치에 송신할 수 있다. 일부 양상들에서, 송신 컴포넌트는 도 2와 관련하여 위에서 설명된 기지 국의 하나 이상의 안테나들, 변조기, 송신 MIMO 프로세서, 송신 프로세서, 제어기/프로세서, 메모리, 또는 이들 의 조합을 포함할 수 있다. 일부 양상들에서, 송신 컴포넌트는 트랜시버의 수신 컴포넌트와 코로 케이트될 수 있다. 송신 컴포넌트는 기지국의 제1 송신 빔 상에서, RIS-보조 절차들을 위해 구성된 제1 SSB 타입에 대응하는 SSB의 다수의 송신들을 송신할 수 있다. 빔 스위핑 컴포넌트는 SSB와 연관된 RACH 기회의 다수 의 PRACH 송신 슬롯들을 통해 기지국의 다수의 수신 빔들을 사용하여 빔 스위핑을 수행할 수 있다. 선택 컴포 넌트는 빔 스위핑 동안 제1 수신 빔 상에서 PRACH 통신을 UE로부터 RIS를 통해 수신하는 것에 기초하여, 기지국의 다수의 수신 빔들로부터, UE로부터의 업링크 통신들을 수신하기 위한 제1 수신 빔을 선택할 수 있다. 도 14에 도시된 컴포넌트들의 수 및 배열은 일례로 제공된다. 실제로, 도 14에 도시된 것보다 추가적인 컴포넌트들, 더 적은 컴포넌트들, 상이한 컴포넌트들 또는 상이하게 배열된 컴포넌트들이 있을 수 있다. 또한, 도 14에 도시된 2개 이상의 컴포넌트들은 단일 컴포넌트 내에서 구현될 수 있거나, 또는 도 14에 도시된 단일 컴포넌트는 다수의 분산형 컴포넌트들로서 구현될 수 있다. 추가적으로 또는 대안적으로, 도 14에 도시된 컴포 넌트들의 세트(하나 이상)는 도 14에 도시된 컴포넌트들의 다른 세트에 의해 수행되고 있는 것으로 설명되는 하 나 이상의 기능들을 수행할 수 있다. 하기 내용은 본 개시의 일부 양상들의 개요를 제공한다: 양상 1: UE(user equipment)에 의해 수행되는 무선 통신 방법은, 기지국으로부터 RIS(reconfigurable intelligent surface)를 통해, RIS-보조 절차들을 위해 구성된 제1 SSB(synchronization signal block) 타입에 대응하는 SSB를 수신하는 단계; 제1 SSB 타입에 대응하는 SSB를 수신하는 것에 적어도 부분적으로 기초하여 다 수의 PRACH(physical random access channel) 송신 슬롯들을 포함하는 RACH(random access channel) 기회를 선 택하는 단계; 및 RACH 기회의 다수의 PRACH 송신 슬롯들에서 PRACH 통신을 기지국에 송신하는 단계를 포함한다. 양상 2: 양상 1의 방법에 있어서, 제1 SSB 타입에 대응하는 SSB를 수신하는 단계는 UE의 수신 빔 상에서 RIS에 의해 반사된 SSB를 수신하는 단계를 포함하고, PRACH 통신을 송신하는 단계는, SSB를 수신한 UE의 수신 빔에 대응하는 UE의 송신 빔 상에서 RACH 기회의 다수의 PRACH 송신 슬롯들에서 PRACH 통신을 송신하는 단계를 포함한다. 양상 3: 양상 1의 방법에 있어서, PRACH 통신을 송신하는 단계는, RACH 기회의 다수의 PRACH 송신 슬롯 들에서, UE의 복수의 송신 빔들의 각각의 송신 빔 상에서 PRACH 통신을 다수회 송신하는 단계를 포함한다. 양상 4: 양상 3의 방법은, 어느 송신 빔이 기지국에 의해 수신되는 PRACH 통신을 송신하는지에 대한 결 정에 적어도 부분적으로 기초하여, UE의 복수의 송신 빔들로부터, 기지국에 업링크 통신을 송신하기 위한 송신 빔을 선택하는 단계를 더 포함한다. 양상 5: 양상 1 내지 양상 4 중 어느 하나의 방법은, 제1 SSB 타입에 대응하는 SSB를 수신하는 것에 적 어도 부분적으로 기초하여, UE에 의해 수신된 SSB를 송신하기 위해 사용된 기지국의 송신 빔 및 UE에 의해 수신 된 SSB를 반사한 RIS로부터의 빔을 표시하는 PRACH 프리앰블을 선택하는 단계를 더 포함하고, PRACH 통신은 PRACH 프리앰블을 포함한다. 양상 6: 양상 1 내지 양상 5 중 어느 하나의 방법에 있어서, RACH 기회를 선택하는 단계는, UE에 의해 수신된 SSB를 송신하기 위해 사용된 기지국의 송신 빔 및 UE에 의해 수신된 SSB를 반사한 RIS로부터의 빔에 대 응하도록 RACH 기회를 선택하는 단계를 포함한다. 양상 7: 양상 1 내지 양상 6 중 어느 하나의 방법에 있어서, RACH 기회를 선택하는 단계는 RACH 기회들 과 SSB 타입들 사이의 맵핑에 적어도 부분적으로 기초하여 RACH 기회를 선택하는 단계를 포함한다. 양상 8: 양상 7의 방법에 있어서, 맵핑은 제1 SSB 타입과 연관된 제1 세트의 RACH 기회들 및 비-RIS 보 조 절차들에 대해 구성된 제2 SSB 타입과 연관된 제2 세트의 RACH 기회들을 포함하고, RACH 기회를 선택하는 단 계는 제1 세트의 RACH 기회들로부터 RACH 기회를 선택하는 단계를 포함한다. 양상 9: 기지국에 의해 수행되는 무선 통신 방법은, 기지국의 제1 송신 빔 상에서, RIS(reconfigurable intelligent surface)-보조 절차들을 위해 구성된 제1 SSB(synchronization signal block) 타입에 대응하는SSB의 다수의 송신들을 송신하는 단계; SSB와 연관된 RACH(random access channel) 기회의 다수의 PRACH(physical random access channel) 송신 슬롯들을 통해 기지국의 다수의 수신 빔들을 사용하여 빔 스위핑 을 수행하는 단계; 및 빔 스위핑 동안 제1 수신 빔 상에서 PRACH 통신을 UE(user equipment)로부터 RIS를 통해 수신하는 것에 기초하여, 기지국의 다수의 수신 빔들로부터, UE로부터의 업링크 통신들을 수신하기 위한 제1 수 신 빔을 선택하는 단계를 포함한다. 양상 10: 양상 9의 방법에 있어서, 제1 SSB 타입에 대응하는 SSB의 다수의 송신들을 송신하는 단계는, 제1 송신 빔 상에서 SSB의 다수의 송신들을 RIS를 향해 송신하는 단계를 포함하고, 제1 송신 빔 상에서 SSB의 다수의 송신들 각각은 상이한 빔을 사용하여 RIS에 의해 반사될 것이다. 양상 11: 양상 9 및 양상 10 중 어느 하나의 방법에 있어서, 제1 SSB 타입에 대응하는 SSB의 다수의 송 신들을 송신하는 단계는, 기지국의 제1 송신 빔 및 하나 이상의 다른 송신 빔들 각각 상에서, 제1 SSB 타입에 대응하는 SSB의 다수의 송신들을 송신하는 단계를 포함한다. 양상 12: 양상 9 내지 양상 11 중 어느 하나의 방법에 있어서, PRACH 통신은 SSB의 다수의 송신들 중 UE 에 의해 수신되는 SSB의 송신과 연관된 RIS로부터의 빔 및 기지국의 제1 송신 빔을 표시하는 PRACH 프리앰블을 포함한다. 양상 13: 양상 9 내지 양상 12 중 어느 하나의 방법에 있어서, PRACH 통신이 수신되는 RACH 기회는, SSB 의 다수의 송신들 중 UE에 의해 수신되는 SSB의 송신과 연관된 RIS로부터의 빔 및 기지국의 제1 송신 빔에 대응 한다. 양상 14: 양상 9 내지 양상 13 중 어느 하나의 방법에 있어서, RACH 기회의 다수의 PRACH 송신 슬롯들은 UE에 의한 PRACH 통신의 다수의 송신들과 연관되고, 기지국의 다수의 수신 빔들을 사용하여 빔 스위핑을 수행하 는 단계는, PRACH 통신이 기지국의 다수의 수신 빔들의 개개의 수신 빔 상에서 수신되는지 여부를 결정하기 위 해, 개개의 수신 빔을 사용하여 다수의 PRACH 송신 슬롯들 각각을 모니터링하는 단계를 포함한다. 양상 15: 양상 9 내지 양상 13 중 어느 하나의 방법에 있어서, RACH 기회의 다수의 PRACH 송신 슬롯들은 UE에 의한 PRACH 통신의 다수의 송신들과 연관되고, RIS로부터의 다수의 빔들을 사용하여 반사된다. 양상 16: 양상 9 내지 양상 15 중 어느 하나의 방법에 있어서, 제1 송신 빔은 기지국의 제1 공간 필터에 대응하고, 제1 수신 빔은 기지국의 제2 공간 필터에 대응한다. 양상 17: 디바이스에서의 무선 통신을 위한 장치는 프로세서; 프로세서와 커플링된 메모리; 및 메모리에 저장되고 장치로 하여금 양상 1 내지 양상 8 중 하나 이상의 양상들의 방법을 수행하게 하도록 프로세서에 의해 실행가능한 명령들을 포함한다. 양상 18: 디바이스에서의 무선 통신을 위한 장치는 프로세서; 프로세서와 커플링된 메모리; 및 메모리에 저장되고 장치로 하여금 양상 9 내지 양상 16 중 하나 이상의 양상들의 방법을 수행하게 하도록 프로세서에 의 해 실행가능한 명령들을 포함한다. 양상 19: 무선 통신을 위한 디바이스는 메모리 및 메모리에 커플링된 하나 이상의 프로세서들을 포함하 고, 메모리 및 하나 이상의 프로세서들은 양상 1 내지 양상 8 중 하나 이상의 양상들의 방법을 수행하도록 구성 된다. 양상 20: 무선 통신을 위한 디바이스는 메모리 및 메모리에 커플링된 하나 이상의 프로세서들을 포함하 고, 메모리 및 하나 이상의 프로세서들은 양상 9 내지 양상 16 중 하나 이상의 양상들의 방법을 수행하도록 구 성된다. 양상 21: 무선 통신을 위한 장치는 양상 1 내지 양상 8 중 하나 이상의 양상들의 방법을 수행하기 위한 적어도 하나의 수단을 포함한다. 양상 22: 무선 통신을 위한 장치는 양상 9 내지 양상 16 중 하나 이상의 양상들의 방법을 수행하기 위한 적어도 하나의 수단을 포함한다. 양상 23: 비일시적 컴퓨터 판독가능 저장 매체는 무선 통신을 위한 코드를 저장하고, 코드는 양상 1 내 지 양상 8 중 하나 이상의 양상들의 방법을 수행하도록 프로세서에 의해 실행가능한 명령들을 포함한다. 양상 24: 비일시적 컴퓨터 판독가능 저장 매체는 무선 통신을 위한 코드를 저장하고, 코드는 양상 9 내 지 양상 16 중 하나 이상의 양상들의 방법을 수행하도록 프로세서에 의해 실행가능한 명령들을 포함한다. 양상 25: 무선 통신을 위한 명령들의 세트를 저장하는 비일시적 컴퓨터 판독가능 매체로서, 명령들의 세 트는, 디바이스의 하나 이상의 프로세서들에 의해 실행될 때 디바이스로 하여금 양상 1 내지 양상 8 중 하나 이 상의 양상들의 방법을 수행하게 하는 하나 이상의 명령들을 포함한다. 양상 25: 무선 통신을 위한 명령들의 세트를 저장하는 비일시적 컴퓨터 판독가능 매체로서, 명령들의 세 트는, 디바이스의 하나 이상의 프로세서들에 의해 실행될 때 디바이스로 하여금 양상 9 내지 양상 16 중 하나 이상의 양상들의 방법을 수행하게 하는 하나 이상의 명령들을 포함한다. 상기 개시는 예시 및 설명을 제공하지만, 포괄적이거나 양상들을 개시된 정확한 형태들로 제한하도록 의 도되지 않는다. 수정들 및 변화들이 상기 개시의 관점에서 이루어질 수 있거나, 양상들의 실시로부터 포착될 수 있다. 본원에서 사용되는 바와 같이, 용어 컴포넌트는 하드웨어, 및/또는 하드웨어와 소프트웨어의 조합으로 널리 해석되도록 의도된다. 소프트웨어는, 소프트웨어, 펌웨어, 미들웨어, 마이크로코드, 하드웨어 디스크립션 언어, 또는 다른 용어로서 지칭되는지에 관계없이, 다른 예들 중에서도, 명령들, 명령 세트들, 코드, 코드 세그 먼트들, 프로그램 코드, 프로그램들, 서브프로그램들, 소프트웨어 모듈들, 애플리케이션들, 소프트웨어 애플리 케이션들, 소프트웨어 패키지들, 루틴들, 서브루틴들, 오브젝트들, 실행가능물들, 실행 스레드들, 절차들, 및/ 또는 함수들을 의미하도록 광범위하게 해석되어야 한다. 본원에서 사용되는 바와 같이, 프로세서는 하드웨어, 및/또는 하드웨어와 소프트웨어의 조합으로 구현된다. 본원에서 설명된 시스템들 및/또는 방법들은 상이한 형 태들의 하드웨어, 및/또는 하드웨어와 소프트웨어의 조합으로 구현될 수 있음은 명백할 것이다. 이러한 시스템 들 및/또는 방법들을 구현하기 위해 사용되는 실제의 특수한 제어 하드웨어 또는 소프트웨어 코드는 양상들의 제한이 아니다. 따라서, 시스템들 및/또는 방법들의 동작 및 거동은, 특정한 소프트웨어 코드에 대한 참조 없 이 본원에 설명되었고, 이는 본원의 설명에 적어도 부분적으로 기초하여 시스템들 및/또는 방법들을 구현하기 위해 소프트웨어 및 하드웨어가 설계될 수 있는 것으로 이해된다. 본원에서 사용되는 바와 같이, 임계치를 충족하는 것은, 문맥에 따라, 값이 임계치보다 큰 것, 임계치보 다 크거나 동일한 것, 임계치보다 작은 것, 임계치보다 작거나 동일한 것, 임계치와 동일한 것, 임계치와 동일 하지 않은 것 등을 지칭할 수 있다. 특징들의 특정 조합들이 청구항들에 인용되고 그리고/또는 명세서에 개시되지만, 이러한 조합들은 다양 한 양상들의 개시를 제한하는 것으로 의도되지 않는다. 실제로, 이러한 특징들 대부분은, 구체적으로 청구항들 에서 인용되지 않은 및/또는 명세서에 개시되지 않은 방식들로 조합될 수 있다. 아래에 나열되는 각각의 종속 항은 오직 하나의 청구항에만 직접 의존하지만, 다양한 양상들의 개시는 청구항 세트의 모든 다른 청구항과 조 합하여 각각의 종속항을 포함한다. 본 명세서에서 사용되는 바와 같이, 아이템들의 리스트 \"중 적어도 하나\"로 지칭되는 구문은 단일 멤버들을 포함하여 그 아이템들의 임의의 조합을 지칭한다. 예를 들어, \"a, b 또는 c 중 적어도 하나\"는 a, b, c, a-b, a-c, b-c, 및 a-b-c 뿐만 아니라 다수의 동일한 엘리먼트의 임의의 결합(예를 들 어, a-a, a-a-a, a-a-b, a-a-c, a-b-b, a-c-c, b-b, b-b-b, b-b-c, c-c, 및 c-c-c 또는 a, b, 및 c의 임의의 다른 순서화)을 커버하는 것으로 의도된다. 본원에서 사용된 어떠한 엘리먼트, 동작 또는 명령도, 이와 같이 명시적으로 설명되지 않는 한 결정적 또는 필수적인 것으로 해석되어서는 안 된다. 또한, 본원에서 사용되는 바와 같이, 단수형 표현은 하나 이상의 항목들을 포함하도록 의도되고, \"하나 이상\"과 상호교환가능하게 사용될 수 있다. 추가로, 본원에서 사용된 바 와 같이, 관사 \"the\"는 관사 \"the\"와 관련하여 참조되는 하나 이상의 항목들을 포함하는 것으로 의도되며, \"하 나 이상\"과 상호교환가능하게 사용될 수 있다. 또한, 본원에 사용되는 바와 같이, \"세트\" 및 \"그룹\"이라는 용 어들은 하나 이상의 항목들(예를 들어, 관련된 항목들, 관련없는 항목들, 또는 관련된 및 관련없는 항목들의 조 합)을 포함하도록 의도되며, \"하나 이상\"과 상호교환적으로 사용될 수 있다. 오직 하나의 항목만이 의도되는 경우, 용어 \"오직 하나\" 또는 유사한 어구가 사용된다. 또한, 본원에서 사용되는 바와 같이, 용어 \"갖는\" 등은 확장가능한(open-ended) 용어들로 의도된다. 추가로, 구문 \"기초하는\"은 달리 명시적으로 언급되지 않는 한 \" 적어도 부분적으로 기초하여\"를 의미하도록 의도된다. 또한, 본 명세서에서 사용되는 바와 같이, \"또는\"이라는 용어는 연속하여 사용될 때 포괄적인 것으로 의도되며, 명시적으로 달리 언급되지 않는 한(예를 들어, \"어느 하 나\" 또는 \"중 단 하나\"와 조합하여 사용될 때) \"및/또는\"과 상호교환가능하게 사용될 수 있다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13 도면14"}
{"patent_id": "10-2023-7022810", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 개시의 상기 인용된 특징들이 상세히 이해될 수 있도록, 상기 간략하게 요약된 더 구체적인 설명이 양상들을 참조하여 행해질 수 있으며, 그 양상들 중 일부는 첨부된 도면들에 예시되어 있다. 그러나, 상기 설 명이 다른 균등하게 유효한 양상들에 허용될 수 있기 때문에, 첨부된 도면들이 본 개시의 특정한 통상적인 양상 들만을 예시하며, 따라서, 본 개시의 범위를 제한하는 것으로 고려되지 않음을 주목해야 한다. 상이한 도면들 에서 동일한 참조 번호들은 동일하거나 유사한 엘리먼트들을 식별할 수 있다. 도 1은 본 개시의 다양한 양상들에 따른 무선 네트워크의 예를 예시하는 도면이다. 도 2는 본 개시의 다양한 양상들에 따른 무선 네트워크에서 UE와 통신하는 기지국의 예를 예시하는 도면 이다. 도 3은 본 개시의 다양한 양상들에 따른 빔 관리 절차들의 예들을 예시하는 도면이다. 도 4는 본 개시의 다양한 양상들에 따른 SS(synchronization signal) 계층구조의 예를 예시하는 도면이 다. 도 5는 본 개시의 다양한 양상들에 따른 SSB(synchronization signal block)의 예를 예시하는 도면이다. 도 6은 본 개시의 다양한 양상들에 따른 SSB 송신들을 위한 자원들의 예를 예시하는 도면이다. 도 7은 본 개시의 다양한 양상들에 따른 기지국과 UE 사이에 차단을 갖는 무선 통신 시스템들의 예들을 예시하는 도면이다. 도 8은 본 개시의 다양한 양상들에 따른 RIS(reconfigurable intelligent surface)를 갖는 무선 통신 시스템에서 SSB 송신의 예를 예시하는 도면이다. 도 9는 본 개시의 다양한 양상들에 따른, RIS를 갖는 무선 통신 시스템에서 상호성 없는 PRACH(physical random access channel) 송신의 예를 예시하는 도면이다. 도 10은 본 개시의 다양한 양상들에 따른 RIS-보조 통신을 위한 초기 액세스와 연관된 예를 예시하는 도 면이다. 도 11 및 도 12는 본 개시의 다양한 양상들에 따른 RIS-보조 통신을 위한 초기 액세스와 연관된 예시적 인 프로세스들을 예시하는 도면들이다. 도 13 및 도 14는 본 개시의 다양한 양상들에 따른 예시적인 무선 통신을 위한 장치들의 블록도들이다."}
