{"patent_id": "10-2023-0094934", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0177673", "출원번호": "10-2023-0094934", "발명의 명칭": "외부 객체를 통해 화면을 변경하기 위한 전자 장치 및 방법", "출원인": "삼성전자주식회사", "발명자": "홍준석"}}
{"patent_id": "10-2023-0094934", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치(200)에 있어서,제1 면(surface) 및 상기 제1 면에 반대인 제2 면을 포함하는 제1 하우징(310)(housing);제3 면, 및 상기 제3 면에 반대인 제4 면을 포함하는 제2 하우징(320);상기 제1 하우징(310), 및 상기 제2 하우징(320)을 회전가능하게(pivotably) 연결하는 폴딩하우징(365);상기 제2 면 상에 배치되는 커버 디스플레이(231); 상기 제1 면 및 상기 제3 면 상에 배치되는 플렉서블 디스플레이(232);하나 이상의 통신 회로들(240); 메모리(220);적어도 하나의 센서(250); 및 상기 커버 디스플레이(231), 상기 플렉서블 디스플레이(232), 상기 하나 이상의 통신 회로들(240), 상기 메모리(220), 및 상기 적어도 하나의 센서(250)와 작동적으로 연결된 적어도 하나의 프로세서(210)를 포함하고, 상기적어도 하나의 프로세서(210)는, 상기 전자 장치(200)로부터 지정된 거리 내에 위치하는 외부 객체(600)에 기반하여, 제1 데이터 및 제2 데이터를 획득하고,상기 제1 데이터에 기반하여, 상기 커버 디스플레이(231)를 통해, 제1 화면을 표시하고, 상기 제1 화면이 상기 커버 디스플레이(231)를 통해 표시되는 동안, 상기 제2 데이터에 기반하여, 제2 화면에대한 정보를 획득하고,상기 제2 화면에 대한 정보에 기반하여, 상기 커버 디스플레이(231)를 통해 표시되는 화면을 상기 제1 화면으로부터 상기 제2 화면으로 변경하고, 상기 외부 객체(600)와 상기 전자 장치(200) 사이의 거리가 상기 지정된 거리 내로 유지되는 것에 기반하여, 상기 제2 화면의 표시를 유지하도록 설정된전자 장치(200)."}
{"patent_id": "10-2023-0094934", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서, 상기 적어도 하나의 프로세서(210)는, 상기 하나 이상의 통신 회로들(240) 중, 근거리 무선 통신(near field communication)을 수행하기 위한 제1 통신 회로(241)를 이용하여, 상기 외부 객체(600)로부터 상기 제1 데이터 및 상기 제2 데이터를 획득하도록 더 설정된전자 장치(200)."}
{"patent_id": "10-2023-0094934", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서, 상기 적어도 하나의 프로세서(210)는, 상기 하나 이상의 통신 회로들(240) 중, 외부 전자 장치와 통신을 수행하기 위한 제2 통신 회로(242)를 이용하공개특허 10-2024-0177673-3-여, 상기 외부 전자 장치로부터 상기 제2 화면에 대한 상기 정보를 획득하도록 더 설정된전자 장치(200)."}
{"patent_id": "10-2023-0094934", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1 항에 있어서, 상기 적어도 하나의 프로세서(210)는,상기 제2 화면에 대한 상기 정보를 획득하는 것에 기반하여, 상기 제2 화면에 대한 상기 정보를 상기 메모리(220)에 저장하고,상기 외부 객체(600)와 상기 전자 장치(200) 사이의 거리가 상기 지정된 거리 밖으로 벗어남을 식별하는 것에응답하여, 상기 제2 화면을 표시하는 것을 중단하도록 설정된 전자 장치(200)."}
{"patent_id": "10-2023-0094934", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4 항에 있어서, 상기 적어도 하나의 프로세서(210)는, 상기 제1 데이터 및 상기 제2 데이터를 획득하는 것에 응답하여, 상기 제2 화면에 대한 상기 정보가 상기 메모리(220)에 저장되었는지 여부를 식별하고,상기 제2 화면에 대한 상기 정보가 상기 메모리(220)에 저장되었음을 식별하는 것에 기반하여, 상기 커버 디스플레이(231)를 통해 상기 제1 화면을 표시하는 것을 우회하고, 상기 제2 화면을 표시하고, 상기 제2 화면에 대한 상기 정보가 상기 메모리(220)에 저장되지 않았음을 식별하는 것에 기반하여, 상기 커버디스플레이(231)를 통해, 상기 제1 화면을 표시하도록 설정된전자 장치(200)."}
{"patent_id": "10-2023-0094934", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1 항에 있어서, 상기 적어도 하나의 프로세서(210)는,상기 제2 화면이 표시되는 동안, 상기 제2 화면에 대한 상기 정보가 변경되었는지 여부를 식별하고,상기 제2 화면에 대한 상기 정보가 변경되지 않았음을 식별하는 것에 기반하여, 상기 제2 화면을 표시하는 것을유지하고,상기 제2 화면에 대한 상기 정보가 변경되었음을 식별하는 것에 기반하여, 상기 제2 화면과 구별되는 제3 화면을 표시하도록 더 설정된전자 장치(200)."}
{"patent_id": "10-2023-0094934", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1 항에 있어서, 적어도 하나의 센서(250)는, 자이로 센서를 포함하고, 상기 적어도 하나의 프로세서(210)는,상기 외부 객체(600)의 타입을 제1 타입 및 제2 타입 중 하나로 식별하고,상기 외부 객체(600)의 타입을 상기 제1 타입으로 식별하는 것에 기반하여, 상기 자이로 센서를 통해 식별된 상기 전자 장치(200)의 자세가 변경됨에 따라, 상기 제2 화면을 변경하고, 공개특허 10-2024-0177673-4-상기 외부 객체(600)의 타입을 상기 제2 타입으로 식별하는 것에 기반하여, 성가 전자 장치(200)의 자세에 관계없이, 상기 제2 화면의 표시를 유지하도록 더 설정된전자 장치(200)."}
{"patent_id": "10-2023-0094934", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1 항에 있어서, 상기 적어도 하나의 센서(250)는,홀 센서를 포함하고, 상기 적어도 하나의 프로세서(210)는,상기 제1 하우징(310) 및 상기 제2 하우징(320) 사이의 각도에 기반하여, 상기 전자 장치(200)의 상태를, 상기홀 센서를 통해, 제1 상태 및 제2 상태 중 하나로 식별하도록 설정되고,상기 제1 상태는, 상기 제1 하우징(310) 및 상기 제2 하우징(320) 사이의 각도가 지정된 각도 범위 내인 상태를 포함하고,상기 제2 상태는,상기 제1 하우징(310) 및 상기 제2 하우징(320) 사이의 각도가 상기 지정된 각도 범위 밖인 상태를 포함하는 전자 장치(200)."}
{"patent_id": "10-2023-0094934", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8 항에 있어서, 상기 적어도 하나의 프로세서(210)는, 상기 외부 객체(600)에 기반하여, 상기 전자 장치(200)의 상태에 따라 상기 제2 화면의 변경 여부를 지시하기위한 제3 데이터를 획득하도록 더 설정된전자 장치(200)."}
{"patent_id": "10-2023-0094934", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9 항에 있어서, 상기 적어도 하나의 프로세서(210)는,상기 제2 화면이 표시되는 동안, 상기 전자 장치(200)의 상태가 상기 제1 상태로부터 상기 제2 상태로 변경됨을식별하고, 제1 값으로 설정된 상기 제3 데이터에 기반하여, 상기 제2 화면의 표시 방향을 변경하도록 더 설정된전자 장치(200)."}
{"patent_id": "10-2023-0094934", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10 항에 있어서, 상기 적어도 하나의 프로세서(210)는, 제2 값으로 설정된 상기 제3 데이터에 기반하여, 상기 제2 화면의 상기 표시 방향을 유지하도록 더 설정된 전자 장치(200)."}
{"patent_id": "10-2023-0094934", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "전자 장치(200)의 방법에 있어서, 공개특허 10-2024-0177673-5-상기 전자 장치(200)로부터 지정된 거리 내에 위치하는 외부 객체(600)에 기반하여, 제1 데이터 및 제2 데이터를 획득하는 동작; 상기 제1 데이터에 기반하여, 상기 전자 장치(200)의 제1 하우징(310)의 일 면 상 배치된 커버 디스플레이(231)를 통해, 제1 화면을 표시하는 동작; 상기 제1 화면이 상기 커버 디스플레이(231)를 통해 표시되는 동안, 상기 제2 데이터에 기반하여, 제2 화면에대한 정보를 획득하는 동작; 상기 제2 화면에 대한 정보에 기반하여, 상기 커버 디스플레이(231)를 통해 표시되는 화면을 상기 제1 화면으로부터 상기 제2 화면으로 변경하는 동작; 및 상기 외부 객체(600)와 상기 전자 장치(200) 사이의 거리가 상기 지정된 거리 내로 유지되는 것에 기반하여, 상기 제2 화면의 표시를 유지하는 동작을 포함하는방법."}
{"patent_id": "10-2023-0094934", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12 항에 있어서, 상기 전자 장치(200)의 하나 이상의 통신 회로들(240) 중, 무선 통신(near field communication)을 수행하기위한 제1 통신 회로(241)를 이용하여, 상기 외부 객체(600)로부터 상기 제1 데이터 및 상기 제2 데이터를 획득하는 동작을 더 포함하는방법."}
{"patent_id": "10-2023-0094934", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13 항에 있어서, 상기 하나 이상의 통신 회로들(240) 중, 외부 전자 장치와 통신을 수행하기 위한 제2 통신 회로(242)를 이용하여, 상기 외부 전자 장치로부터 상기 제2 화면에 대한 상기 정보를 획득하는 동작을 더 포함하는방법."}
{"patent_id": "10-2023-0094934", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제12 항에 있어서,상기 제2 화면에 대한 상기 정보를 획득하는 것에 기반하여, 상기 제2 화면에 대한 상기 정보를 상기 전자 장치(200)의 메모리(220)에 저장하는 동작; 상기 외부 객체(600)와 상기 전자 장치(200) 사이의 거리가 상기 지정된 거리 밖으로 벗어남을 식별하는 것에응답하여, 상기 제2 화면을 표시하는 것을 중단하는 동작; 및 상기 제2 화면의 표시가 중단된 뒤 지정된 시간이 경과하는 것에 기반하여, 상기 메모리(220)에 저장된 상기 제2 화면에 대한 상기 정보를 제거하는 동작을 더 포함하는방법."}
{"patent_id": "10-2023-0094934", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15 항에 있어서, 상기 제1 데이터 및 상기 제2 데이터를 획득하는 것에 응답하여, 상기 제2 화면에 대한 상기 정보가 상기 메모공개특허 10-2024-0177673-6-리(220)에 저장되었는지 여부를 식별하는 동작; 상기 제2 화면에 대한 상기 정보가 상기 메모리(220)에 저장되었음을 식별하는 것에 기반하여, 상기 커버 디스플레이(231)를 통해 상기 제1 화면을 표시하는 것을 우회하고, 상기 제2 화면을 표시하는 동작; 및 상기 제2 화면에 대한 상기 정보가 상기 메모리(220)에 저장되지 않았음을 식별하는 것에 기반하여, 상기 커버디스플레이(231)를 통해, 상기 제1 화면을 표시하는 동작을 더 포함하는방법."}
{"patent_id": "10-2023-0094934", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제12 항에 있어서, 상기 제2 화면이 표시되는 동안, 상기 제2 화면에 대한 상기 정보가 변경되었는지 여부를 식별하는 동작; 상기 제2 화면에 대한 상기 정보가 변경되지 않았음을 식별하는 것에 기반하여, 상기 제2 화면을 표시하는 것을유지하는 동작; 및 상기 제2 화면에 대한 상기 정보가 변경되었음을 식별하는 것에 기반하여, 상기 제2 화면과 구별되는 제3 화면을 표시하는 동작을 더 포함하는방법."}
{"patent_id": "10-2023-0094934", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제12 항에 있어서,상기 외부 객체(600)의 타입을 제1 타입 및 제2 타입 중 하나로 식별하는 동작; 상기 외부 객체(600)의 타입을 상기 제1 타입으로 식별하는 것에 기반하여, 상기 전자 장치(200)의 자이로 센서를 통해 식별된 상기 전자 장치(200)의 자세가 변경됨에 따라, 상기 제2 화면을 변경하는 동작; 및 상기 외부 객체(600)의 타입을 상기 제2 타입으로 식별하는 것에 기반하여, 성가 전자 장치(200)의 자세에 관계없이, 상기 제2 화면의 표시를 유지하는 동작을 더 포함하는방법."}
{"patent_id": "10-2023-0094934", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제12 항에 있어서,상기 외부 객체(600)에 기반하여, 상기 전자 장치(200)의 상기 제1 하우징(310) 및 제2 하우징(320) 사이의 각도에 따라 식별되는 상기 전자 장치(200)의 상태에 따라, 상기 제2 화면의 변경 여부를 지시하기 위한 제3 데이터를 획득하는 동작을 더 포함하는방법."}
{"patent_id": "10-2023-0094934", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19 항에 있어서,상기 제2 화면이 표시되는 동안, 상기 전자 장치(200)의 상태가 상기 제1 상태로부터 상기 제2 상태로 변경됨을식별하는 동작; 제1 값으로 설정된 상기 제3 데이터에 기반하여, 상기 제2 화면의 표시 방향을 변경하는 동작; 및 제2 값으로 설정된 상기 제3 데이터에 기반하여, 상기 제2 화면의 표시를 중단하는 동작을 포함하는공개특허 10-2024-0177673-7-방법."}
{"patent_id": "10-2023-0094934", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "전자 장치(2600)에 있어서,디스플레이(2602); 하나 이상의 통신 회로들(240); 메모리(220);적어도 하나의 센서(250); 및 상기 디스플레이(2602), 상기 하나 이상의 통신 회로들(240), 상기 메모리(220), 및 상기 적어도 하나의 센서(250)와 작동적으로 연결된 적어도 하나의 프로세서(210)를 포함하고, 상기 적어도 하나의 프로세서(210)는, 상기 전자 장치(2600)로부터 지정된 거리 내에 위치하는 외부 객체(600)에 기반하여, 제1 데이터 및 제2 데이터를 획득하고,상기 제1 데이터에 기반하여, 상기 디스플레이(2602)를 통해, 제1 화면을 표시하고, 상기 제1 화면이 상기 디스플레이(2602)를 통해 표시되는 동안, 상기 제2 데이터에 기반하여, 제2 화면에 대한정보를 획득하고,상기 제2 화면에 대한 정보에 기반하여, 상기 디스플레이(2602)를 통해 표시되는 화면을 상기 제1 화면으로부터상기 제2 화면으로 변경하고, 상기 외부 객체(600)와 상기 전자 장치(2600) 사이의 거리가 상기 지정된 거리 내로 유지되는 것에 기반하여,상기 제2 화면의 표시를 유지하도록 설정된전자 장치(2600)."}
{"patent_id": "10-2023-0094934", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "전자 장치(2600)의 방법에 있어서,상기 전자 장치(2600)로부터 지정된 거리 내에 위치하는 외부 객체(600)에 기반하여, 제1 데이터 및 제2 데이터를 획득하는 동작; 상기 제1 데이터에 기반하여, 상기 디스플레이(2602)를 통해, 제1 화면을 표시하는 동작; 상기 제1 화면이 상기 디스플레이(2602)를 통해 표시되는 동안, 상기 제2 데이터에 기반하여, 제2 화면에 대한정보를 획득하는 동작; 상기 제2 화면에 대한 정보에 기반하여, 상기 디스플레이(2602)를 통해 표시되는 화면을 상기 제1 화면으로부터상기 제2 화면으로 변경하는 동작; 및 상기 외부 객체(600)와 상기 전자 장치(2600) 사이의 거리가 상기 지정된 거리 내로 유지되는 것에 기반하여,상기 제2 화면의 표시를 유지하는 동작을 포함하는,방법."}
{"patent_id": "10-2023-0094934", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "일 실시 예에 따르면, 전자 장치는, 커버 디스플레이, 하나 이상의 통신 회로들, 메모리, 적어도 하나의 센서, 및 상기 커버 디스플레이, 상기 플렉서블 디스플레이, 상기 하나 이상의 통신 회로들, 상기 메모리, 및 상기 적 어도 하나의 센서와 작동적으로 연결된 적어도 하나의 프로세서를 포함한다. 상기 적어도 하나의 프로세서는, 외 부 객체에 기반하여, 제1 데이터 및 제2 데이터를 획득하도록 설정된다. 상기 적어도 하나의 프로세서는, 상기 제1 데이터에 기반하여, 제1 화면을 표시하도록 설정된다. 상기 적어도 하나의 프로세서는, 상기 제1 화면이 상 기 커버 디스플레이를 통해 표시되는 동안, 상기 제2 데이터에 기반하여, 제2 화면에 대한 정보를 획득하도록 설 정된다. 상기 적어도 하나의 프로세서는, 상기 제2 화면에 대한 정보에 기반하여, 상기 커버 디스플레이를 통해 표시되는 화면을 상기 제1 화면으로부터 상기 제2 화면으로 변경하도록 설정된다."}
{"patent_id": "10-2023-0094934", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "아래의 설명들은, 외부 객체를 통해 화면을 변경하기 위한 전자 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2023-0094934", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전자 장치는 배경 화면을 표시하는 기능을 제공할 수 있다. 예를 들어, 사용자는 선호하는 이미지를 선택하여 전기 장치의 배경에 표시되는 배경 화면으로서 이용할 수 있다. 배경 화면으로 이용되는 이미지는 사용자가 전 자 장치에 장착된 카메라를 통해 촬영한 이미지 또는 외부 전자 장치로부터 획득된 이미지를 포함할 수 있다. 상술한 정보는 본 개시에 대한 이해를 돕기 위한 목적으로 하는 배경 기술(related art)로 제공될 수 있다. 상 술한 내용 중 어느 것도 본 개시와 관련된 종래 기술(prior art)로서 적용될 수 있는지에 대하여 어떠한 주장이 나 결정이 제기되지 않는다."}
{"patent_id": "10-2023-0094934", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시 예에 따르면, 전자 장치는, 제1 면(surface) 및 상기 제1 면에 반대인 제2 면을 포함하는 제1 하우징 (housing), 제3 면, 및 상기 제3 면에 반대인 제4 면을 포함하는 제2 하우징, 상기 제1 하우징, 및 상기 제2 하 우징을 회전가능하게(pivotably) 연결하는 폴딩하우징, 상기 제2 면 상에 배치되는 커버 디스플레이, 상기 제1 면 및 상기 제3 면 상에 배치되는 플렉서블 디스플레이, 하나 이상의 통신 회로들, 메모리, 적어도 하나의 센서, 및 상기 커버 디스플레이, 상기 플렉서블 디스플레이, 상기 하나 이상의 통신 회로들, 상기 메모리, 및 상기 적어도 하나의 센서와 작동적으로 연결된 적어도 하나의 프로세서를 포함할 수 있다. 상기 적어도 하나의 프로세서는, 상기 전자 장치로부터 지정된 거리 내에 위치하는 외부 객체에 기반하여, 제1 데이터 및 제2 데이 터를 획득하도록 설정될 수 있다. 상기 적어도 하나의 프로세서는, 상기 제1 데이터에 기반하여, 상기 커버 디 스플레이를 통해, 제1 화면을 표시하도록 설정될 수 있다. 상기 적어도 하나의 프로세서는, 상기 제1 화면이 상 기 커버 디스플레이를 통해 표시되는 동안, 상기 제2 데이터에 기반하여, 제2 화면에 대한 정보를 획득하도록 설정될 수 있다. 상기 적어도 하나의 프로세서는, 상기 제2 화면에 대한 정보에 기반하여, 상기 커버 디스플레 이를 통해 표시되는 화면을 상기 제1 화면으로부터 상기 제2 화면으로 변경하도록 설정될 수 있다. 상기 적어도 하나의 프로세서는, 상기 외부 객체와 상기 전자 장치 사이의 거리가 상기 지정된 거리 내로 유지되는 것에 기 반하여, 상기 제2 화면의 표시를 유지하도록 설정될 수 있다. 일 실시 예에 따르면, 전자 장치의 방법은, 상기 전자 장치로부터 지정된 거리 내에 위치하는 외부 객체에 기반 하여, 제1 데이터 및 제2 데이터를 획득하는 동작을 포함할 수 있다. 상기 방법은, 상기 제1 데이터에 기반하여, 상기 전자 장치의 제1 하우징의 일 면 상 배치된 커버 디스플레이를 통해, 제1 화면을 표시하는 동작 을 포함할 수 있다. 상기 방법은, 상기 제1 화면이 상기 커버 디스플레이를 통해 표시되는 동안, 상기 제2 데이 터에 기반하여, 제2 화면에 대한 정보를 획득하는 동작을 포함할 수 있다. 상기 방법은, 상기 제2 화면에 대한 정보에 기반하여, 상기 커버 디스플레이를 통해 표시되는 화면을 상기 제1 화면으로부터 상기 제2 화면으로 변 경하는 동작을 포함할 수 있다. 상기 방법은, 상기 외부 객체와 상기 전자 장치 사이의 거리가 상기 지정된 거 리 내로 유지되는 것에 기반하여, 상기 제2 화면의 표시를 유지하는 동작을 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는, 디스플레이, 하나 이상의 통신 회로들, 메모리, 적어도 하나의 센서, 및 상기 디스플레이, 상기 하나 이상의 통신 회로들, 상기 메모리, 및 상기 적어도 하나의 센서와 작동적으로 연결 된 적어도 하나의 프로세서를 포함할 수 있다. 상기 적어도 하나의 프로세서는, 상기 전자 장치로부터 지정된 거리 내에 위치하는 외부 객체에 기반하여, 제1 데이터 및 제2 데이터를 획득하도록 설정될 수 있다. 상기 적어 도 하나의 프로세서는, 상기 제1 데이터에 기반하여, 상기 디스플레이를 통해, 제1 화면을 표시하도록 설정될 수 있다. 상기 적어도 하나의 프로세서는, 상기 제1 화면이 상기 디스플레이를 통해 표시되는 동안, 상기 제2 데이터에 기반하여, 제2 화면에 대한 정보를 획득하도록 설정될 수 있다. 상기 적어도 하나의 프로세서는, 상기 제2 화면에 대한 정보에 기반하여, 상기 디스플레이를 통해 표시되는 화면을 상기 제1 화면으로부터 상기 제2 화면으로 변경하도록 설정될 수 있다. 상기 적어도 하나의 프로세서는, 상기 외부 객체와 상기 전자 장치 사이 의 거리가 상기 지정된 거리 내로 유지되는 것에 기반하여, 상기 제2 화면의 표시를 유지하도록 설정될 수 있다. 일 실시 예에 따르면, 전자 장치의 방법은, 상기 전자 장치로부터 지정된 거리 내에 위치하는 외부 객체에 기반 하여, 제1 데이터 및 제2 데이터를 획득하는 동작을 포함할 수 있다. 상기 방법은, 상기 제1 데이터에 기반하여, 상기 디스플레이를 통해, 제1 화면을 표시하는 동작을 포함할 수 있다. 상기 방법은, 상기 제1 화면이 상기 디스플레이를 통해 표시되는 동안, 상기 제2 데이터에 기반하여, 제2 화면에 대한 정보를 획득하는 동 작을 포함할 수 있다. 상기 방법은, 상기 제2 화면에 대한 정보에 기반하여, 상기 디스플레이를 통해 표시되는 화면을 상기 제1 화면으로부터 상기 제2 화면으로 변경하는 동작을 포함할 수 있다. 상기 방법은, 상기 외부 객 체와 상기 전자 장치 사이의 거리가 상기 지정된 거리 내로 유지되는 것에 기반하여, 상기 제2 화면의 표시를 유지하는 동작을 포함할 수 있다."}
{"patent_id": "10-2023-0094934", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 도면을 참조하여 본 개시의 실시예에 대하여 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 개시는 여러 가지 상이한 형태로 구현될 수 있으 며 여기에서 설명하는 실시예에 한정되지 않는다. 도면의 설명과 관련하여, 동일하거나 유사한 구성요소에 대해 서는 동일하거나 유사한 참조 부호가 사용될 수 있다. 또한, 도면 및 관련된 설명에서는, 잘 알려진 기능 및 구성에 대한 설명이 명확성과 간결성을 위해 생략될 수 있다. 도 1은, 일 실시 예에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참고하면, 네트워크 환경에서 전자 장치는 제1 네트워크(예: 근거리 무선 통신 네트워크)를 통하여 전자 장치와 통신하거나, 또는 제2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장치 또는 서버 중 적어도 하나와 통신할 수 있다. 일 실시 예에 따르면, 전자 장치 는 서버를 통하여 전자 장치와 통신할 수 있다. 일 실시 예에 따르면, 전자 장치는 프로세 서, 메모리, 입력 모듈, 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스, 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터 리, 통신 모듈, 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시 예에서 는, 전자 장치에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어떤 실시 예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈 , 또는 안테나 모듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일 실시 예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세 서는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메모리에 저장할 수 있다. 일 실시 예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또 는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로 세서를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능 에 특화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)과 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일 실시 예에 따르 면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다 른 구성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일 실시 예에 따르면, 보 조 프로세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능 모델이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi- supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않 는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restrictedboltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있 다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일 실시 예에 따르면, 리시버는 스피커 와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일 실시 예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일 실시 예에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일 실시 예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일 실시 예에 따르면, 인터페이스는, 예를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인 터페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일 실시 예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일 실시 예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일 실시 예에 따르면, 카메라 모듈은 하나 이 상의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일 실시 예에 따르면, 전력 관리 모 듈은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일 실시 예에 따르면, 배터 리는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다.통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일 실시 예에 따르면, 통 신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제1 네트워크(예: 블 루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워크) 또는 제2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통 신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제1 네트워크 또는 제2 네트워크와 같은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO(full dimensional MIMO)), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안 테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전 자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제2 네트워크)에 규정되는 다양한 요구사항을 지 원할 수 있다. 일 실시 예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이 상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링 크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일 실시 예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일 실시 예에 따르면, 안테나 모듈은 복수의 안테 나들(예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제1 네트워크 또는 제2 네트워크와 같은 통 신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통 신 모듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시 예에 따르면, 방사체 이외에 다 른 부품(예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 일 실시 예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일 실시 예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제1 면(예: 아래 면)에 또는 그에 인접하여 배치되고 지 정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있는 복수의 안 테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일 실시 예에 따르면, 명령 또는 데이터는 제2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일 실시 예에 따르면, 전자 장치에서 실행되는 동작들 의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의요청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또 는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청 할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있 다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴 퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시 예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일 실시 예에 따르면, 외부의 전자 장치 또는 서버는 제2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 일 실시 예에 따르면, 전자 장치(예: 도 1의 전자 장치)는 외부 객체를 통해 전자 장치의 화면(또는 화면 의 테마)를 변경할 수 있다. 예를 들어, 전자 장치는 외부 객체를 통해 획득된 데이터에 기반하여, 전자 장치의 화면(또는 화면의 테마)를 변경할 수 있다. 전자 장치는 표시하기 위한 화면에 대한 정보를 획득하는 동안, 다 른 화면을 표시할 수 있다. 전자 장치는 표시하기 위한 화면에 대한 정보를 획득하는 동안, 다른 화면을 표시함 으로써, 연속적인 화면 변화를 제공할 수 있다. 이하에서는, 상술한 전자 장치의 구성 및 동작이 설명될 것이다. 도 2는 일 실시 예에 따른 전자 장치의 간소화된 블록도의 일 예를 도시한다. 도 2를 참고하면, 전자 장치는 도 1에 도시된 전자 장치의 구성 요소의 일부 또는 전부를 포함할 수 있다. 예를 들어, 전자 장치는 도 1의 전자 장치에 상응할 수 있다. 일 실시 예에 따르면, 전자 장치는 프로세서, 메모리, 디스플레이, 통신 회로, 및/또 는 센서를 포함할 수 있다. 실시 예에 따라, 전자 장치는 프로세서, 메모리, 디스플레이 , 통신 회로, 또는 센서 중 적어도 하나를 포함할 수 있다. 예를 들어, 프로세서, 메모리 , 디스플레이, 통신 회로, 또는 센서 중 적어도 일부는 실시 예에 따라 생략될 수 있다. 도시하지는 않았으나, 전자 장치는 프로세서, 메모리, 디스플레이, 통신 회로, 및 센 서 외에도 다양한 컴포넌트들을 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는 프로세서를 포함할 수 있다. 프로세서는 메모리, 디스 플레이, 통신 회로, 및 센서와 작동적으로(operatively 또는 operably) 결합하거나(coupled with), 연결될(connected with) 수 있다. 프로세서가 메모리, 디스플레이, 통신 회로, 및 센서와 작동적으로 결합하거나 연결된 다는 것은, 프로세서가 메모리, 디스플레이, 통신 회로, 및 센서를 제어할 수 있음을 의미할 수 있다. 예를 들어, 프로세서는 메모리, 디스플레이, 통신 회로, 및 센서를 제어할 수 있다. 메모리, 디스플레이, 통신 회로, 및 센서에 의해 제어될 수 있다. 예를 들어, 프로세서 는 적어도 하나의 프로세서로 구성될 수 있다. 예를 들어, 프로세서는 적어도 하나의 프로세서를 포 함할 수 있다. 예를 들어, 프로세서는 도 1의 프로세서에 상응할 수 있다. 일 실시 예에 따르면, 프로세서는 하나 이상의 인스트럭션에 기반하여 데이터를 처리하기 위한 하드웨어 컴포넌트를 포함할 수 있다. 데이터를 처리하기 위한 하드웨어 컴포넌트는, 예를 들어, ALU(arithmetic and logic unit), FPGA(field programmable gate array) 및/또는 CPU(central processing unit)를 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는 메모리를 포함할 수 있다. 예를 들어, 메모리는 도 1의 메모 리에 상응할 수 있다. 예를 들어, 메모리는 휘발성 메모리 유닛 또는 유닛들일 수 있다. 예를 들어, 메모리는 비휘발성 메모리 유닛 또는 유닛들일 수 있다. 예를 들어, 메모리는 자기 또는 광학 디스크와 같이, 다른 형태의 컴퓨터 판독가능 매체일 수 있다. 예를 들어, 메모리는 프로세서에서 수행되는 동작(예를 들어, 알고리즘 수행 동작)에 기반하여 획득된 데이터를 저장할 수 있다. 예를 들어, 메모리는 하나 이상의 프로그램들을 저장하기 위해 사용될 수 있다. 하나 이상의 프로그램들은 전자 장치의 프로세서에 의해 실행될 시, 정의된 동작을 수행하도록 전자 장치를 야기하는 인스 트럭션들을 포함할 수 있다. 일 예로, 메모리 내에서, 프로세서가 데이터에 수행할 연산, 및/또는 동작을 나타내는 하나 이상의 인스트럭션들이 저장될 수 있다. 하나 이상의 인스트럭션들의 집합은, 펌 웨어, 운영 체제, 프로세스, 루틴, 서 브-루틴 및/또는 어플리케이션으로 참조될 수 있다. 예를 들어, 전자 장치, 및/또는 프로세서는, 운 영체제, 펌웨어, 드라이버, 및/또는 어플리케이션 형태로 배포된 복수의 인스트럭션들의 집합(set of a plurality of instructions)이 실행될 시에, 이하에서 설명되는 전자 장치의 동작들 중 적어도 하나를 수 행할 수 있다. 이하에서, 어플리케이션이 전자 장치에 설치되었다는 것은, 어플리케이션의 형태로 제공된 하나 이상의 인스트럭션들이 전자 장치의 메모리 내에 저장된 것으로써, 상기 하나 이상의 어플리케 이션들이 전자 장치의 프로세서에 의해 실행 가능한(executable) 포맷(예, 전자 장치의 운영 체 제에 의해 지정된 확장자를 가지는 파일)으로 저장된 것을 의미할 수 있다. 일 실시 예에 따르면, 전자 장치는 디스플레이를 포함할 수 있다. 예를 들어, 디스플레이는 도 1의 디스플레이 모듈에 상응할 수 있다. 예를 들어, 전자 장치의 디스플레이는 사용자에게 시각화된 정보를 출력할 수 있다. 디스플레이(23 0)는 LCD(Liquid Crystal Display), PDP(Plasma Display Panel), 하나 이상의 LED들(Light Emitting Diode), 및/또는 하나 이상의 OLED들을 포함할 수 있다. 일 실시예에 따른, 디스플레이는, 디스플레이 상의 외부 객체(예, 사용자의 손가락)를 탐지하기 위한 센서(예, TSP(touch sensor panel))를 포함할 수 있다. 예를 들어, TSP에 기반하여, 전자 장치는 디스플레이 상에 접촉되거나, 또는 디스플레이 상을 부유하 는(floating) 외부 객체(예, 사용자의 손가락)를 탐지할 수 있다. 상기 외부 객체를 탐지하는 것에 응답하여, 전자 장치는 디스플레이 내에 표시되고 있는 시각적 객체들(예, 촬영을 위한 복수의 아이콘들) 중에 서, 상기 외부 객체가 접촉된 디스플레이 내 일부분에 대응하는 특정 시각적 객체와 관련된 기능을 실행할 수 있다. 예를 들어, 디스플레이는 커버 디스플레이 및 플렉서블 디스플레이를 포함할 수 있다. 플렉서블 디스플레이는 플렉서블 디스플레이에 작용되는 외력에 의하여 변형 가능할 수 있다. 전자 장치 에 배치된 커버 디스플레이 및 플렉서블 디스플레이의 구체적인 예가 도 3a 및 도 3b를 통해 설명될 것이다. 일 실시 예에 따르면, 전자 장치는 통신 회로를 포함할 수 있다. 예를 들어, 통신 회로는 도 1 의 통신 모듈의 적어도 일부에 상응할 수 있다. 예를 들어, 통신 회로는 직접(예: 유선) 통신을 위해 사용될 수 있다. 예를 들어, 통신 회로는 다양한 RAT(radio access technology)을 위해 사용될 수 있다. 예를 들어, 통신 회로는 셀룰러 통신을 수행하기 위해 사용될 수 있다. 예를 들어, 통신 회로는 블루 투스(Bluetooth) 통신, 무선 랜(wireless local area network, WLAN) 통신, 근거리 무선 통신(near field communication, NFC) 또는 UWB(ultra wideband) 통신을 수행하기 위해 사용될 수 있다. 예를 들어, 통신 회로는 제1 통신 회로 및 제2 통신 회로를 포함할 수 있다. 제1 통신 회로 는 근거리 무선 통신(near field communication, NFC)을 수행하기 위해 사용될 수 있다. 제2 통신 회로 는 외부 전자 장치로부터 정보를 송신 및/또는 수신하기 위해 사용될 수 있다. 일 예로, 제2 통신 회로 는 외부 전자 장치와 셀룰러 통신, 무선 랜 통신, 및/또는 유선 통신 중 적어도 하나를 수행하기 위해 사 용될 수 있다. 일 실시 예에 따르면, 전자 장치는 센서를 포함할 수 있다. 전자 장치의 센서는, 전자 장 치와 관련된 비-전기적 정보(non-electronic information)로부터, 프로세서, 및/또는 메모리에 의해 처리될 수 있는 전기적 정보를 생성할 수 있다. 센서에 의하여 생성된 상기 전기적 정보는, 메모리 에 저장되거나, 프로세서에 의해 처리되거나, 및/또는 전자 장치와 구별되는 다른 전자 장치로 송신될 수 있다. 센서는 하나 이상일 수 있다. 예를 들어, 센서는, 전자 장치에 포함된 하우징들 사이의 각도를 식별하기 위한 홀 센서를 포함 할 수 있다. 홀 센서는, 하나 이상의 자석들, 및/또는 하나 이상의 자기 센서들을 포함할 수 있다. 홀 센서에 포함된 상기 하나 이상의 자석들, 또는 상기 하나 이상의 자기 센서들 중 적어도 하나는, 전자 장치 내 상이한 위치들에 배치될 수 있다. 상기 하나 이상의 자석들, 및/또는 상기 하나 이상의 자기 센서들의 전자 장치 내에서의 위치 관계는, 전자 장치의 형태에 따라 변경될 수 있다. 전자 장치는 상기 위치 관계의 변경을, 상기 하나 이상의 자기 센서들을 통해, 측정할 수 있다. 상기 위치 관계의 변경은, 상기 하나 이상의 자석들에 의해 형성된, 자계의 변화를 야기할 수 있다. 전자 장치는 홀 센서를 이용하여, 상기 자계의 변화를 나타내는 전력 신호를 획득할 수 있다. 예를 들어, 전자 장치는 홀 센서 로부터 획득한 상기 전력 신호를 이용하여, 자세(posture) 또는 상태(예, 폴딩 상태 또는 언폴딩 상태)를 구별할 수 있다. 예를 들어, 전자 장치는 홀 센서로부터, 전자 장치의 상태를 나타내는 데이터 를 수신할 수 있다. 예를 들어, 홀 센서는, 플렉서블 디스플레이의 형태를 나타내는 데이터를 출력할 수 있다. 플렉서블 디스플레이의 형태는, 폴딩 축(예, 도 3a에서 후술될 폴딩 축)에 의해 접혀지거나, 또는 펼쳐짐에 따라 변경될 수 있다. 예를 들어, 홀 센서는 플렉서블 디스플레이의 형태 를 나타내는 상이한 데이터를 출력할 수 있다. 실시예가 이에 제한되는 것은 아니며, 일 실시예에 따른, 프로세 서는 IMU(inertia measurement unit) 센서를 이용하여 상기 각도를 식별할 수 있다. 예를 들어, 센서는 전자 장치의 물리적인 움직임을 측정하기 위한 자이로 센서를 포함할 수 있 다. 상기 자이로 센서는 서로 수직을 이루는 복수의 지정된 축들(예, x 축, y 축, z 축) 각각에서 측정된 각속도의 크기를 나타내는 전기적 정보를 출력할 수 있다. 일 실시예에 따른 전자 장치의 프로세서는, 자이로 센서로부터 출력되는 전기적 정보에 기반하여, 물리적인 공간 내에서의 전자 장 치의 자세(posture)를 측정할 수 있다. 전 자 장치가 측정하는 상기 자세는, 자이로 센서에 의해 측정되는 전자 장치의 방향(orientation) 및/또는 홀 센서에 의해 측정되는 전자 장치의 형태를 나타낼 수 있다. 전자 장치의 형태는, 전 자 장치는 측정된 자세에 기반하여, 전자 장치의 디스플레이(예: 커버 디스플레이)에서 표 시되는 화면을 변경할 수 있다. 도 3a 및 도 3b는, 일 실시예에 따른 전자 장치의 언폴딩 상태, 및 폴딩 상태 내에서, 제1 하우징 및 제2 하우 징 사이의 위치 관계의 일 예를 도시한다. 도 3a 및 도 3b를 참고하면, 전자 장치는 도 1의 전자 장치의 일 예일 수 있다. 제1 하우징, 제 2 하우징 및 폴딩하우징은 전자 장치에 포함될 수 있다. 전자 장치는 제1 면 및 상기 제1 면에 반대인 제2 면을 포함하는 제1 하우징을 포함할 수 있다. 전자 장치는, 제3 면 및 상 기 제3 면과 반대인 제4 면(미도시)을 포함하는 제2 하우징을 포함할 수 있다. 전자 장치는, 제1 하 우징 및 제2 하우징을 회전가능하게(pivotably) 연결하는 폴딩하우징을 포함할 수 있다. 제1 하 우징의 일 면(예, 제1 면) 및 제2 하우징의 일 면(예, 제3 면)에, 플렉서블 디스플레이 의 적어도 일부가 배치될 수 있다. 예를 들어, 폴딩하우징을 가로질러(across) 제1 면 및 제3 면 상에 플렉서블 디스플레이의 적어도 일부가 배치될 수 있다. 제1 표시 영역, 제2 표시 영역 , 및 제3 표시 영역은 플렉서블 디스플레이에 포함될 수 있다. 폴딩하우징은 힌지 구조를 포함할 수 있다. 커버 디스플레이는, 제2 면 상에 배치될 수 있다. 전자 장치는 제2 면이 향하는 방향을 지향하는 카메라를 포함할 수 있다. 상기 카메라는 제2 면의 일 부분 영역 내에 배치 될 수 있다. 일 실시예에 따른, 전자 장치는 제1 하우징 및 제2 하우징이 폴딩하우징에 의해, 완전히 (fully) 펼쳐진(folded out) 언폴딩(unfolding) 상태를 제공할 수 있다. 예를 들어, 도 3a를 참조하면, 전자 장치는, 상기 언폴딩 상태인 상태 내에서 있을 수 있다. 예를 들어, 상태는 제1 면이 향하 는 제1 방향이 제3 면이 향하는 제2 방향에 대응하는 상태를 의미할 수 있다. 예를 들어, 상태 내에서, 제1 방향은, 제2 방향에 평행일 수 있다. 예를 들어, 상태 내에서 제1 방향 은, 제2 방향과 동일할 수 있다. 일 실시예에 따른, 상태 내에서 제1 면은 제3 면과 실질적으로 하나의 평면을 형성할 수 있다. 예를 들어, 상태 내에서 제1 면과 제3 면 사이의 각도(305-1)는 180도(degrees)일 수 있다. 예 를 들어, 상태는 플렉서블 디스플레이의 전체 표시 영역(entire display area) 모두를 실질적으로 하 나의 평면 상에서 제공할 수 있는 상태를 의미할 수 있다. 예를 들어, 상태는, 제1 표시 영역, 제2 표시 영역, 및 제3 표시 영역 모두를 하나의 평면 상에서 제공할 수 있는 상태를 의미할 수 있다. 예를 들어, 상태 내에서, 제3 표시 영역은 굴곡진 영역(curved surface)을 포함하지 않을 수 있다. 예 를 들어, 상기 언폴딩 상태는, 펼침 상태(outspread state 또는 outspreading state)로 참조될 수 있다. 이하, 각도(305-2, 205-3, 205-4)에 기반한, 전자 장치의 상이한 상태를 후술한다. 도 3b를 참조하면, 일 실시예에 따른 전자 장치는 제1 하우징과 제2 하우징이 폴딩하우징 에 의해 접힌(folded in) 폴딩 상태를 제공할 수 있다. 예를 들어, 전자 장치는, 상태, 상태, 및 상태를 포함하는 상기 폴딩 상태 내에서 있을 수 있다. 예를 들어, 상태, 상태, 및 상태 를 포함하는 상기 폴딩 상태는, 제1 면이 향하는 제1 방향이 제3 면이 향하는 제2 방향 과 구별되는 상태를 의미할 수 있다. 예를 들어, 상태에서, 제1 방향과 제2 방향 사이의 각도는 45도로, 제1 방향과 제2 방향은 서로 구별될 수 있다. 예를 들어, 상태에서, 제1 방향 과 제2 방향 사이의 각도는 150도로, 제1 방향과 제2 방향은 서로 구별될 수 있다. 예를 들어, 상태에서, 제1 방향과 제2 방향 사이의 각도는 실질적으로 180도로, 제1 방향과 제2 방향은 서로 구별될 수 있다. 일 실시예에 따른, 상기 폴딩 상태 내에서 제1 면 및 제3 면 사이의 각도는 0도(degree) 이상 180도 (degrees) 미만일 수 있다. 예를 들어, 상태에서, 제1 면과 제3 면 사이의 각도(305-2)는 135 도일 수 있다. 상태에서, 제1 면과 제3 면 사이의 각도(305-3)는 30도 일 수 있다. 상태 에서, 제1 면과 제3 면 사이의 각도(305-4)는, 실질적으로 0도일 수 있다. 예를 들어, 상기 폴딩 상 태는, 접힘 상태(folded state)로 참조될 수 있다. 일 실시예에서, 상기 폴딩 상태는, 상기 언폴딩 상태와 달리, 복수의 서브 폴딩 상태들을 포함할 수 있다. 예를 들어, 도 3b를 참조하면, 상기 폴딩 상태는, 폴딩하우징을 통해 제공되는 회전에 의해 제1 면이 제3 면 상에 실질적으로 중첩되는 완전 폴딩 상태(fully folding)인 상태 및 상태와 상기 언폴딩 상 태(예: 도 3a의 상태) 사이의 중간 폴딩 상태인 상태 및 상태를 포함하는, 상기 복수의 서브 폴 딩 상태들로 포함할 수 있다. 예를 들어, 전자 장치는, 폴딩하우징에 의해 제1 면 및 제3 면 이 서로 마주함으로써 제2 표시 영역의 전체 영역 상에 제1 표시 영역의 전체 영역이 실질적으 로 완전히 중첩되는 상태를 제공할 수 있다. 예를 들어, 전자 장치는, 제1 방향이 제2 방향 에 실질적으로 반대인 상태를 제공할 수 있다. 예를 들어, 상태는 전자 장치를 바라보는 사용자의 시야 안에서 플렉서블 디스플레이가 가려지는 상태를 의미할 수도 있다. 하지만, 이에 제한되지 않는다. 일 실시예에 따른, 플렉서블 디스플레이는, 폴딩하우징을 통해 제공되는 회전에 의해 굽혀질 수 있다. 예를 들어, 플렉서블 디스플레이에서, 제1 표시 영역 및 제2 표시 영역과 달리, 제3 표시 영역은 폴딩 동작에 따라 굽어질 수 있다. 예를 들어, 제3 표시 영역은, 상기 완전 폴딩 상태 내에서 플렉서블 디스플레이의 파손을 방지하기 위해, 만곡하게 굽혀진 상태 내에 있을 수 있다. 상기 완전 폴딩 상태 내에서, 제3 표시 영역이 만곡하게 굽혀지는 것과 달리, 제1 표시 영역 전부는, 제2 표시 영역 전부 상에 완전히 중첩될 수 있다. 도 3a 내지 도 3b를 참조하면, 전자 장치의 플렉서블 디스플레이가 하나의 폴딩 표시 영역(예: 제3 표시 영역)을 포함하거나 전자 장치가 하나의 폴딩하우징(예: 폴딩하우징)을 포함하는 예를 도 시하고 있으나, 이는 설명의 편의를 위한 것이다. 실시예들에 따라, 전자 장치의 플렉서블 디스플레이 는, 복수의 폴딩 표시 영역들을 포함할 수 있다. 예를 들어, 전자 장치의 플렉서블 디스플레이 는, 두 개 이상의 폴딩 표시 영역들을 포함하고, 전자 장치는 상기 두 개 이상의 폴딩 영역들을 각각 제공 하기 위한 2개 이상의 폴딩하우징들을 포함할 수 있다. 일 실시예에 따른 전자 장치는, 상태에서, 커버 디스플레이를 통해 화면을 표시할 수 있다. 전 자 장치는, 전자 장치와 지정된 거리 내에 위치하는 외부 객체에 기반하여, 커버 디스플레이를 이용하여, 화면을 표시할 수 있다. 예를 들어, 외부 객체는 전자 장치와 결합되는 케이스(case)를 통해 고 정될 수 있다. 이하에서는, 외부 객체를 고정하기 위한, 케이스의 예가 설명될 것이다. 도 4는 일 실시 예에 따른 전자 장치와 결합되는 케이스의 예를 도시한다. 도 4를 참고하면, 전자 장치의 하우징(또는 외관)을 보호하기 위한 케이스가 형성될 수 있다. 예를 들어, 케이스는 제1 프레임 및 제2 프레임을 포함할 수 있다. 예를 들어, 제1 프레임은 전자 장치의 제1 하우징에 결합될 수 있다. 예를 들어, 제1 프레임 은 전자 장치의 제1 하우징이 삽입되어 결합되도록 형성될 수 있다. 예를 들어, 제1 프레임 은 케이스와 전자 장치가 결합될 때, 전자 장치의 외면(예: 제1 하우징의 외면)의 적 어도 일부를 감쌀 수 있다. 예를 들어, 제1 프레임은, 케이스와 전자 장치가 결합될 때, 전자 장치의 외면(예: 제1 하우징의 외면)에 접할 수 있다. 일 실시예에 따르면, 제1 프레임의 크기 는, 전자 장치의 제1 하우징의 크기에 대응할 수 있다. 예를 들어, 제1 프레임은, 비도전성 물 질로 제작될 수 있다. 예를 들어, 제1 프레임은, 비도전성 물질을 포함하는 수지를 활용하는 사출 공정을 통해 제작될 수 있다. 다만, 이에 제한되지 않는다. 실시예들에 따라, 제1 프레임의 적어도 일부는, 도전 성 물질로 제작될 수 있다. 예를 들어, 제1 프레임은 커버 디스플레이를 위한 제1 디스플레이 홀 및/또는 카메라를 위한 적 어도 하나의 카메라 홀을 포함할 수 있다. 일 예로, 제1 디스플레이 홀은 케이스와 전자 장치가 결합될 때, 전자 장치의 커버 디스플 레이에 중첩될 수 있다. 제1 디스플레이 홀은 제1 프레임을 관통할 수 있다. 커버 디스플레이 는 제1 디스플레이 홀을 통해 노출될 수 있다. 일 예로, 적어도 하나의 카메라 홀은 케이스와 전자 장치가 결합될 때, 전자 장치의 적어 도 하나의 카메라에 중첩될 수 있다. 적어도 하나의 카메라 홀은 제1 프레임을 관통할 수 있다. 적어 도 하나의 카메라는 적어도 하나의 카메라 홀을 통해 노출될 수 있다. 예를 들어, 제2 프레임은 전자 장치의 제2 하우징에 결합될 수 있다. 예를 들어, 제2 프레임 은 전자 장치의 제2 하우징이 삽입되어 결합되도록 형성될 수 있다. 예를 들어, 제2 프레임 은 케이스와 전자 장치가 결합될 때, 전자 장치의 외면(예: 제2 하우징의 외면)의 적 어도 일부를 감쌀 수 있다. 예를 들어, 제2 프레임은, 케이스와 전자 장치가 결합될 때, 전자 장치의 외면(예: 제2 하우징의 외면)에 접할 수 있다. 일 실시예에 따르면, 제2 프레임의 크기 는, 전자 장치의 제2 하우징의 크기에 대응할 수 있다. 예를 들어, 제2 프레임은, 비도전성 물 질로 제작될 수 있다. 예를 들어, 제2 프레임은, 비도전성 물질을 포함하는 수지를 활용하는 사출 공정을 통해 제작될 수 있다. 다만, 이에 제한되지 않는다. 실시예들에 따라, 제2 프레임의 적어도 일부는, 도전 성 물질로 제작될 수 있다. 예를 들어, 제2 프레임은 후면 부재를 포함할 수 있다. 후면 부재는 외부 객체(예: 카드 또는 팔레트(palette))의 삽입을 위한 슬롯을 형성할 수 있다. 슬롯 내에 외부 객체가 삽입되어 결합될 수 있다. 예를 들어, 외부 객체가 슬롯 내에 삽입된 상태에서, 전자 장치는 외부 객체 및 전자 장치 사이의 거리가 지정된 거리 내임을 식별할 수 있다. 도 5는 일 실시 예에 따른 전자 장치의 동작에 관한 흐름도를 도시한다. 전자 장치는 도 5에 도시된 동작 들을 수행할 수 있다. 이하에서는, 도 5에 도시된 동작들이 프로세서에 의해 수행되는 것으로 설명될 것이다. 도 5를 참고하면, 동작 510에서, 프로세서는 전자 장치로부터 지정된 거리 내에 위치하는 외부 객체 에 기반하여, 제1 데이터 및 제2 데이터를 획득할 수 있다. 예를 들어, 외부 객체는 카드, 케이스 및/또는 액세 서리(accessory)를 포함할 수 있다. 예를 들어, 프로세서는 전자 장치와 결합된 케이스에 외부 객체가 결합되는 것에 기반하여, 외부 객체가 전자 장치로부터 지정된 거리 내에 위치함을 식별할 수 있다. 일 실시 예에 따르면, 프로세서는 제1 통신 회로를 이용하여, 데이터를 획득할 수 있다. 예를 들어, 제1 통신 회로는 근거리 무선 통신(near field communication, 이하 NFC)을 수행하기 위해 사용될 수 있 다. 프로세서는 NFC를 이용하여, 외부 객체로부터 데이터를 획득할 수 있다. 일 예로, 외부 객체는 NFC를 수행하기 위한 칩(chip)을 포함할 수 있다. 프로세서는 상기 칩으로부터, 데이터를 획득할 수 있다. 예를 들어, 프로세서는 제1 통신 회로를 이용하여, 제1 데이터 및 제2 데이터를 획득할 수 있다. 일 예로, 프로세서는 NFC를 이용하여, 외부 객체로부터 제1 데이터 및 제2 데이터를 획득할 수 있다. 예를 들어, 제1 데이터는 제1 화면에 관련될 수 있다. 제2 데이터는 제2 화면에 관련될 수 있다. 제1 데이터는 제1 화면을 표시하기 위해 사용될 수 있다. 제2 데이터는 제2 화면을 표시하기 위해 사용될 수 있다. 일 실시 예에 따르면, 프로세서는 제1 데이터 및 제2 데이터를 획득하는 것에 기반하여, 커버 디스플레이 (또는 플렉서블 디스플레이)를 통해 사용자에게 제2 화면에 대한 정보를 획득(예: 다운로드)할 것인 지 여부에 대한 입력을 수신하기 위한 객체(예: 팝업 창, 알림 메시지)를 표시할 수 있다. 예를 들어, 프로세서 는 사용자로부터 제2 화면에 대한 정보를 획득하도록 요청하는 입력을 수신하는 것에 기반하여, 동작 520 을 수행할 수 있다. 동작 520에서, 프로세서는 제1 데이터에 기반하여, 커버 디스플레이를 통해, 제1 화면을 표시할 수 있다. 예를 들어, 제1 데이터는 ARGB(alpha red green blue) 값으로 구성될 수 있다. 프로세서는 제1 데 이터에 기반하여, ARGB 값에 따른 색상을 가지는 제1 화면을 표시할 수 있다. 예를 들어, 제1 데이터는 이미지 에 대한 정보를 포함할 수 있다. 프로세서는 제1 데이터에 기반하여, 이미지를 표시할 수 있다. 동작 530에서, 프로세서는 제1 화면이 커버 디스플레이를 통해 표시되는 동안, 제2 데이터에 기반하 여, 제2 화면에 대한 정보를 획득할 수 있다. 일 실시 예에 따르면, 프로세서는 제1 데이터 및 제2 데이터를 획득하는 것에 응답하여, 제2 데이터에 기 반하여, 제2 화면에 대한 정보를 획득할 수 있다. 프로세서는 제2 화면에 대한 정보가 획득되는 동안, 커 버 디스플레이를 통해 제1 화면을 표시할 수 있다. 실시 예에 따라, 프로세서는 플렉서블 디스플레이를 통해 제1 화면과 관련된 화면을 표시할 수 있다. 예를 들어, 프로세서는 플렉서블 디스플레이가 활성화된 상태에서, 제1 데이터 및 제2 데이터를 획득 하는 것에 기반하여, 플렉서블 디스플레이에 제1 화면과 관련된 화면을 표시할 수 있다. 일 예로, 제1 화 면과 관련된 화면은 제1 화면에 상응할 수 있다. 실시 예에 따라, 커버 디스플레이에 제1 화면이 표시되는 동안, 플렉서블 디스플레이에 제1 화면과 관련된 화면을 표시할 수 있다. 일 실시 예에 따르면, 프로세서는 제2 화면에 대한 정보를 전자 장치의 메모리로부터 획득할 수 있다. 프로세서는 메모리에 저장된 제2 화면에 대한 정보를 획득할 수 있다. 예를 들어, 프로세서 는 제2 화면이 커버 디스플레이를 통해 출력된 경우 제2 화면에 대한 정보를 저장할 수 있다. 프로세 서는, 제1 화면이 커버 디스플레이를 통해 표시되는 동안, 메모리로부터 제2 화면에 대한 정보 를 획득할 수 있다. 일 실시 예에 따르면, 프로세서는 제2 화면에 대한 정보를 외부 전자 장치(예: 서버)로부터 획득할 수 있 다. 예를 들어, 제2 통신 회로는 외부 전자 장치와 통신을 수행하기 위해 사용될 수 있다. 프로세서(21 0)는 제2 통신 회로를 이용하여 외부 전자 장치와 통신할 수 있다. 프로세서는 제2 통신 회로를 이용하여, 외부 전자 장치(예: 서버)로부터 제2 화면에 대한 정보를 획득할 수 있다. 예를 들어, 프로세서(21 0)는 제2 통신 회로를 이용하여, 외부 전자 장치에게 제2 화면에 대한 정보를 요청할 수 있다. 프로세서 는 제2 통신 회로를 이용하여, 외부 전자 장치로부터 제2 화면에 대한 정보를 수신할 수 있다. 예를 들어, 제2 데이터는 제2 화면에 대한 정보를 내려 받기(download)위한 주소에 대한 정보를 포함할 수 있다. 프 로세서는 제2 데이터에 기반하여, 제2 화면에 대한 정보를 내려 받을 수 있다. 예를 들어, 제2 화면에 대한 정보는 제2 화면에 대한 데이터 뿐만 아니라, 제2 화면과 관련된 멀티미디어 데이 터, 제2 화면과 관련된 진동 출력에 관한 데이터를 포함할 수 있다. 제2 화면과 관련된 멀티미디어 데이터는, 벨소리, 시스템 소리, 및 알림 소리를 포함할 수 있다. 제2 화면과 관련된 진동 출력에 관한 데이터는, 사용자 입력 및/또는 전자 장치의 자세에 따라 출력되는 진동 패턴에 대한 데이터를 포함할 수 있다. 동작 530에서, 프로세서는 제2 화면에 대한 정보에 기반하여, 커버 디스플레이를 통해 표시되는 화면 을 제1 화면으로부터 제2 화면으로 변경할 수 있다. 예를 들어, 프로세서는 제2 화면에 대한 정보가 획득 되는 동안, 제1 화면을 표시하고, 제2 화면에 대한 정보의 획득이 완료되는 것에 기반하여, 제2 화면을 표시할 수 있다. 일 예로, 제1 화면을 제2 화면의 표시를 위한 대기 화면일 수 있다. 예를 들어, 제2 화면은, 커버 디 스플레이를 통해 표시되는 화면의 테마(theme)가 변경된 화면일 수 있다. 일 실시 예에 따르면, 제1 화면은 제2 화면에 관련될 수 있다. 예를 들어, 제1 화면은 제2 화면에 관한 대표 색상을 가질 수 있다. 제1 화면에서 제2 화면에 관한 대표 색상이 표시될 수 있다. 프로세서는 제1 화면을 통해 제2 화면에 관한 대표 색상을 먼저 표시한 뒤, 제2 화면을 표시할 수 있다. 예를 들어, 제1 화면에서, 제1 화질의 이미지가 표시될 수 있다. 제2 화면에서, 제2 화질의 이미지가 표시될 수 있다. 제2 화질은 제1 화질보다 높을 수 있다. 프로세서는 낮은 화질에 대한 이미지를 먼저 표시한 뒤, 높 은 화질의 이미지의 획득이 완료되는 것에 기반하여, 높은 화질에 대한 이미지를 표시할 수 있다. 예를 들어, 제1 화면에서, 지정된 영상에 대한 이미지(예: 대표 이미지 또는 썸네일)가 표시될 수 있다. 제2 화 면에서, 지정된 영상이 표시될 수 있다. 프로세서는 지정된 영상을 획득하는 동안, 지정된 영상에 대한 이 미지를 먼저 표시하고, 지정된 영상의 획득이 완료되는 것에 기반하여, 지정된 영상을 표시할 수 있다. 예를 들어, 제2 화면에서 지정된 이미지(예: 스트라이프 및 캐릭터가 포함된 이미지)가 표시될 수 있다. 제1 화 면에서, 지정된 이미지에 관한 간소화된 이미지(예: 스트라이프 이미지)가 표시될 수 있다. 프로세서는 지 정된 이미지에 관한 간소화된 이미지를 먼저 표시하고, 지정된 이미지의 획득이 완료되는 것에 기반하여, 지정 된 이미지를 표시할 수 있다. 예를 들어, 제1 데이터는 제1 인스트럭션들을 포함할 수 있다. 프로세서는 제1 인스트럭션들에 기반하여 식별되는 제1 화면을 표시할 수 있다. 제2 데이터는 제2 인스트럭션들을 포함할 수 있다. 프로세서는 제2 인스트럭션들에 기반하여 식별되는 제2 화면을 표시할 수 있다. 제1 인스트럭션들은 제2 인스트럭션에 비해 알 고리즘의 복잡도가 낮을 수 있다. 동작 550에서, 프로세서는 외부 객체와 전자 장치 사이의 거리가 지정된 거리 내로 유지되는 것에 기 반하여, 제2 화면의 표시를 유지할 수 있다. 예를 들어, 프로세서는 외부 객체가 케이스에 결합(또는 슬롯 내에 삽입)된 상태가 유지되는 것에 기반하여, 제2 화면의 표시를 유지할 수 있다. 일 실시 예에 따르면, 프로세서는 제1 하우징 및 제2 하우징 사이의 각도에 기반하여, 전자 장 치의 상태를 제1 상태(예: 폴딩 상태) 및 제2 상태(예: 언폴딩 상태) 중 하나로 식별할 수 있다. 예를 들 어, 제1 상태는 제1 하우징 및 제2 하우징 사이의 각도가 지정된 각도 범위(예: 10 도) 내인 상태를 포함할 수 있다. 제2 상태는 제1 하우징 및 제2 하우징 사이의 각도가 지정된 각도 범위(예: 10 도) 밖인 상태를 포함할 수 있다. 예를 들어, 프로세서는 전자 장치의 상태가 제1 상태인 동안, 동작 510 내지 동작 550을 수행할 수 있다. 예를 들어, 프로세서는 외부 객체로부터 제1 데이터 및 제2 데이터와 함께 제3 데이터를 획득할 수 있다. 일 예로, 제3 데이터가 제1 값으로 설정된 경우, 프로세서는 전자 장치의 상태가 제1 상태로부터 제2 상태로 변경되는 것에 기반하여, 제2 화면의 표시 방향을 변경할 수 있다. 일 예로, 제3 데이터가 제2 값으로 설정된 경우, 프로세서는 전자 장치의 상태가 제1 상태로부터 제2 상태로 변경되는 경우에도, 제2 화 면의 표시 방향을 유지할 수 있다. 도 6은 일 실시 예에 따른 화면을 변경하기 위한 전자 장치의 동작의 예를 도시한다. 도 6을 참고하면, 상태에서, 전자 장치는 케이스와 결합된 상태일 수 있다. 프로세서는 슬 롯에 외부 객체가 삽입됨을 식별할 수 있다. 프로세서는 전자 장치 및 외부 객체의 사이의 거리가 지정된 거리 내임을 식별하는 것에 기반하여, 외부 객체가 슬롯에 삽입되었음을 식별 할 수 있다. 실시 예에 따라, 케이스는 외부 객체가 삽입(또는 결합)되었는지 여부를 식별하기 위한 컴포넌트를 포함할 수 있다. 프로세서는 케이스로부터 정보를 획득할 수 있다. 프로세서는 케이 스로부터 획득된 정보에 기반하여, 외부 객체가 슬롯에 삽입되었음을 식별할 수 있다. 상태에서, 전자 장치 및 외부 객체의 사이의 거리가 지정된 거리 밖인 경우, 프로세서는 커버 디스플레이를 통해 기본 화면을 표시할 수 있다. 예를 들어, 기본 화면은 전자 장치 에서 기본적으로 제공되는 화면을 의미할 수 있다. 예를 들어, 기본 화면은, 외부 객체를 통해 변경되지 않은 화면을 의미할 수 있다. 상태에서, 프로세서는 전자 장치 및 외부 객체 사이의 거리가 지정된 거리 내임을 식별할 수 있 다. 프로세서는 외부 객체로부터 제1 데이터 및 제2 데이터를 획득할 수 있다. 예를 들어, 프로세서 는 제1 통신 회로를 이용하여, NFC를 통해 제1 데이터 및 제2 데이터를 획득할 수 있다. 프로세서는 제1 데이터에 기반하여, 제1 화면을 커버 디스플레이를 통해 표시할 수 있다. 프로 세서는 제1 화면이 커버 디스플레이를 통해 표시되는 동안, 제2 화면에 대한 정보를 획득 할 수 있다. 프로세서는 제1 화면에 중첩으로 제2 화면에 대한 정보가 획득 중임을 나타내는 객체를 표시할 수 있다. 상태에서, 프로세서는 제2 화면에 대한 정보의 획득을 완료할 수 있다. 프로세서는 제2 화면에 대한 정보에 기반하여, 커버 디스플레이를 통해 표시되는 화면을 제1 화면으로부터 제2 화면으 로 변경할 수 있다. 프로세서는 외부 객체와 전자 장치 사이의 거리가 지정된 거리 내로 유지되 는 것에 기반하여, 제2 화면의 표시를 유지할 수 있다. 예를 들어, 제2 화면은 제1 화면과 관련될 수 있다. 일 예로, 제1 화면은 제2 화면에 대한 대표 색상을 가질 수 있다. 제1 데이터는 제2 화면에 대한 대표 색상에 대한 ARGB 값을 포함할 수 있다. 프로세서는 외부 객체로부터 제2 화면에 대한 대표 컬러에 대한 정보를 포함하는 제1 데이터를 획득할 수 있다. 프로세서는 제2 화면에 대한 정보가 획득되는 동안, 제1 데이터에 기반하여, 제1 화 면을 표시할 수 있다. 프로세서는 제2 화면을 표시하기 위한 시간 구간 내에서 제1 화면을 표시할 수 있다. 프로세서는 제2 화면을 표시하기 위한 시간 구간 내에서 제1 화면을 표시함으 로써, 향상된 사용자 경험을 제공할 수 있다. 일 실시 예에 따르면, 제2 화면은, 커버 디스플레이를 통해 표시되는 화면의 테마가 변경된 화면일 수 있다. 프로세서는 제2 화면을 통해 사용자 인터페이스를 표시할 수 있다. 예를 들어, 사용자 인터 페이스는, 아이콘, 위젯, 잠금 화면, 글자체, 글자 색, 홈 화면 및/또는 배경화면을 포함할 수 있다. 프로세서는 외부 객체를 통해 변경된 사용자 인터페이스를 포함하는 제2 화면을 표시할 수 있다. 프로세서는 외부 객체에 저장된 데이터(예: 제1 데이터 및 제2 데이터)에 기반하여 변경된 사 용자 인터페이스를 포함하는 제2 화면을 표시할 수 있다. 이하에서, 전자 장치의 화면의 테마를 변경 하기 위한 시스템의 구성이 도 7을 통해 설명될 것이다. 도 7은 일 실시 예에 따른 화면을 변경하기 위한 서비스를 제공하기 위한 환경의 예를 도시한다. 도 7을 참고하면, 테마 서버는 복수의 테마들을 저장하도록 설정될 수 있다. 예를 들어, 테마 서버는 도 5의 외부 전자 장치의 일 예일 수 있다. 일 실시 예에 따르면, 복수의 테마 제공자들은 테마 제공자 내지 테마 제공자를 포함할 수 있다. 복수의 테마 제공자들 각각은 테마 제작 툴(theme authorizing tool)을 이용하여, 테마를 생성(또는 제작)할 수 있다. 예를 들어, 테마 제작 툴은 테마 서버의 관리자로부터 배포될 수 있다. 복수의 테마 제 공자들 각각은 테마 서버에 생성된 테마를 업로드할 수 있다. 테마 서버는 복수의 테마 제공자 들 각각으로부터 업로드된 테마를 저장할 수 있다. 복수의 테마 제공자들 각각은 테마를 업데이트할 수 있다. 테마 제공자들 각각은 업데이트된 테마를 테마 서버에 업로드할 수 있다. 테마 서버는 복수의 테마 제공자들 각각으로부터 업데이트된 테마를 저장할 수 있다. 일 실시 예에 따르면, 프로세서는 사용자 인터페이스의 테마를 변경하기 위한 어플리케이션(예: 테마 어플 리케이션)을 이용하여, 사용자 인터페이스를 변경할 수 있다. 예를 들어, 전자 장치의 프로세서는 화 면(예: 커버 디스플레이를 통해 표시되는 화면) 내의 아이콘, 위젯, 잠금 화면, 글자체, 글자 색, 홈 화면 및/또는 배경화면 중 적어도 하나를 변경하여(by changing), 사용자 인터페이스의 테마를 변경할 수 있다. 예를 들어, 프로세서는 전자 장치의 프레임워크를 지정된 테마에 기반하여 설정된 프레임워크로 설정할 수 있다. 프로세서는 지정된 테마에 기반하여 설정된 프레임워크에 기반하여, 사용자 인터페이스를 표시할 수 있다. 예를 들어, 프로세서는 테마 플랫폼을 이용하여, 사용자 인터페이스의 테마와 관련된 동작을 수행할 수 있다. 프로세서는 테마 플랫폼 내에서 설정된 프로그램들을 이용하여, 사용자 인터페이스의 테마 를 관리하기 위한 동작을 수행할 수 있다. 일 예로, 테마 플랫폼은 테마 매니저 및 테마 저장부를 포함할 수 있다. 테마 매니저는 테 마 서버에 저장된 복수의 테마들을 검색하거나, 테마 저장부에 저장된 테마를 백업할 수 있다. 테마 매니저는 테마 서버로부터 적어도 하나의 테마를 획득(예: 다운로드)할 수 있고, 획득된 적어도 하나의 테마를 테마 저장부에 저장할 수 있다. 도 8은 일 실시 예에 따른 전자 장치의 화면을 구성하기 위한 레이어들의 예를 도시한다. 도 8을 참고하면, 프로세서는 복수의 레이어들에 기반하여, 전자 장치의 디스플레이(예: 커버 디스플레이)에 표시되는 화면을 구성할 수 있다. 일 실시 예에 따르면, 복수의 레이어들은 백그라운드 레이어(background layer), 사용자 이미지 레이어 (user image layer), 장식 레이어(decoration layer), 및/또는 정보 레이어(information layer) 중 적어도 하나를 포함할 수 있다. 예를 들어, 백그라운드 레이어, 사용자 이미지 레이어 , 장식 레이어, 및 정보 레이어는 순차적으로 표시될 수 있다. 프로세서는 백그라운드 레 이어, 사용자 이미지 레이어, 장식 레이어, 및 정보 레이어는 순차적으로 표시하는 것에 기반하여, 화면을 표시할 수 있다. 예를 들어, 백그라운드 레이어에 중첩으로 사용자 이미지 레이어가 표시될 수 있다. 사용자 이미지 레이어에 중첩으로 장식 레이어가 표시될 수 있다. 장식 레이어에 중첩으로 정보 레이어가 표시될 수 있다. 상술한 순서는 예시적인 것이며, 복수의 레이어들이 표시되는 순서는 변경될 수 있다. 실시 예 에 따라, 백그라운드 레이어 및 정보 레이어는 필수적으로 표시될 수 있다. 사용자 이미지 레이어 및 장식 레이어는 화면(또는 커버)의 타입에 따라 생략될 수 있다. 예를 들어, 백그라운드 레이어는 배경의 색상 및/또는 배경을 위한 그래픽을 표시하기 위해 사용될 수 있 다. 프로세서는 화면 전체의 색상 및/또는 그래픽을 백그라운드 레이어를 통해 설정할 수 있다. 예를 들어, 사용자 이미지 레이어는 사용자로부터 설정된 이미지를 표시하기 위해 사용될 수 있다. 프로세 서는 갤러리에 저장된 이미지를 사용자 이미지 레이어를 통해 화면에 표시할 수 있다. 예를 들어, 장식 레이어는 사용자 이미지 레이어를 통해 설정된 이미지를 위한 프레임, 초기 프레임 (initial frame), 및/또는 위젯을 표시하기 위해 사용될 수 있다. 프로세서는 장식 레이어를 이용하 여, 사용자 이미지 레이어를 통해 설정된 이미지에 추가적인 이미지를 중첩으로 표시할 수 있다. 실시 예 에 따라, 장식 레이어는 백그라운드 레이어의 하단에 배치될 수도 있다. 예를 들어, lasso effect가 적용되는 시계 화면은 백그라운드 레이어의 하단에 배치될 수도 있다. 일 예로, 시계 화면을 표시하기 위 한 장식 레이어는 백그라운드 레이어의 하단에 배치될 수 있다. 실시 예에 따라, 장식 레이어는 커버 디스플레이 내에서 편집될 수 있다. 프로세서는 커버 디스플레이를 통해 장식 레이어(83 0)의 타입 및/또는 색상을 변경하기 위한 인터페이스를 표시할 수 있다. 사용자는 커버 디스플레이를 통해 장식 레이어의 타입 및/또는 색상을 변경할 수 있다. 예를 들어, 정보 레이어는 시계, 날짜, 알림, 및/또는 배터리 정보 중 적어도 하나를 표시하기 위해 사용 될 수 있다. 프로세서는 정보 레이어를 통해 시간에 따라 변경되는 정보들을 나타내는 객체를 표시할 수 있다. 도 9는 일 실시 예에 따른 외부 객체의 접근 시, 전자 장치의 동작의 예를 도시한다. 도 9를 참고하면, 전자 장치의 메모리는 전자 장치의 디스플레이(예: 커버 디스플레이 )의 화면을 변경하기 위해 설계된 프로그램들(예: 액세서리 매니저 및 화면 변경 매니저)을 저 장할 수 있다. 프로세서는 디스플레이의 화면을 변경하기 위해 설계된 프로그램들(예: 액세서리 매니 저 및 화면 변경 매니저)을 이용하여, 외부 객체의 접근에 따른 화면을 변경하기 위한 동작을 수행할 수 있다. 실시 예에 따라, 액세서리 매니저 및/또는 화면 변경 매니저는 프로세서 내에 포함된 모듈로써 구성될 수도 있다. 동작 901에서, 프로세서는, 센서 또는 제1 통신 회로를 통해, 외부 객체 식별 정보를 액세서리 매니저에게 제공할 수 있다. 예를 들어, 외부 객체 식별 정보는, 외부 객체로부터 획득된 데이터(예: 제1 데이터, 제2 데이터, 제3 데이터)를 포함할 수 있다. 실시 예에 따라, 외부 객체 식별 정보는 외부 객체의 탈착 및/또는 부착에 대한 정보를 포함할 수 있다. 예를 들어, 프로세서는 센서를 이용하여, 외부 객체의 위치가 전자 장치와 지정된 거리 내임을 식별할 수 있다. 프로세서는 센서를 통해, 외부 객체 식별 정보를 액세서리 매니저에게 제공할 수 있다. 예를 들어, 프로세서는 센서를 이용하여, 외부 객체의 위치가 전자 장치로부터 지정된 거리 밖으로 벗어남을 식별할 수 있다. 프로세서는 센서를 통해, 외부 객체 식별 정보를 액세서리 매니저에게 제공할 수 있다. 예를 들어, 프로세서는 제1 통신 회로를 이용하여, NFC를 통해 외부 객체의 위치가 전자 장치와 지정된 거리 내임을 식별할 수 있다. 프로세서는 제1 통신 회로를 통해, 외부 객체 식별 정보를 액세 서리 매니저에게 제공할 수 있다. 예를 들어, 프로세서는 제1 통신 회로를 이용하여, NFC를 통 해 외부 객체의 위치가 전자 장치로부터 지정된 거리 밖으로 벗어남을 식별할 수 있다. 프로세서는 제1 통신 회로를 통해, 외부 객체 식별 정보를 액세서리 매니저에게 제공할 수 있다. 동작 902에서, 프로세서는 액세서리 매니저를 통해, 외부 객체로부터 획득된 데이터(예: 외부 객체 식별 정보) 대한 인증을 수행할 수 있다. 예를 들어, 프로세서는 외부 객체로부터 획득된 데이터가 디스플 레이를 통해 표시되는 화면을 변경하기 위해 구성된 데이터 인지 여부를 식별할 수 있다. 예를 들어, 프로 세서는 외부 객체로부터 획득된 데이터가 안전한 데이터(secured data)인지 여부를 식별할 수 있다. 동작 903에서, 프로세서는 외부 객체로부터 획득된 데이터의 인증에 기반하여, 액세서리 매니저를 통 해, 화면 변경 매니저에게 URI(uniform resource identifier)를 제공(예: 브로드캐스트(broadcast))할 수 있다. 프로세서는 URI에 기반하여, 화면 변경 매니저를 통해 디스플레이의 화면을 변경할 수 있 다. 예를 들어, 화면 변경 매니저는 배경 화면 API를 호출하는 것에 기반하여, 화면을 변경할 수 있다. 예 를 들어, 화면 변경 매니저는 도 7의 테마 플랫폼을 포함할 수 있다. 도 10는 일 실시 예에 따른 전자 장치의 동작에 관한 흐름도의 예를 도시한다. 도 10에서 도시된 동작 1010 내 지 동작 1050은 도 5의 동작 510 내지 동작 540과 관련될 수 있다. 도 10을 참고하면, 동작 1010에서, 프로세서는 외부 객체의 위치가 전자 장치로부터 지정된 거리 내 임을 식별할 수 있다. 예를 들어, 프로세서는 제1 통신 회로를 이용하여, NFC를 통해, 외부 객체의 위치가 전자 장치로부터 지정된 거리 내임을 식별할 수 있다. 일 예로, 프로세서는 외부 객체의 위치 가 전자 장치로부터 지정된 거리 내임을 식별하는 것에 기반하여, 외부 객체가 케이스의 슬롯 내에 삽입되었음을 식별할 수 있다. 일 실시 예에 따르면, 외부 객체는 마그넷(magnet) 및/또는 인증 칩을 포함할 수 있다. 프로세서는 NFC를 통해 외부 객체에 포함된 마그넷 및/또는 인증 칩으로부터 데이터를 수신할 수 있다. 예를 들어, 프로세서는 전자 장치로부터 지정된 거리 내에 위치하는 외부 객체로부터, 제1 데이터, 제2 데이터, 및 제3 데이터를 획득할 수 있다. 예를 들어, 프로세서는 외부 객체로부터, 23 바이트(bytes) 크기의 데이터를 획득할 수 있다. 23 바이트(bytes) 크기의 데이터는 제1 데이터, 제2 데이터, 및 제3 데이터를 포함할 수 있다. 예를 들어, 프로세서는 외부 객체로부터 23 바이트 크기의 URI 데이터를 획득(또는 수신)할 수 있다. URI 데이터의 포맷은 하기의 표와 같이 설정될 수 있다. 일 예로, 프로세서는 액세서리 매니저를 통해 URI 데이터를 화면 변경 매니저에게 제공할 수 있다. 표 1 LengthType Data (Max 126 bytes) Palette ID (21 bytes) Version Service TypeService IDSerial No. 할당 Byte 수1 byte1 byte1 byte 2 bytes4 bytes 14 bytes Value0x16(fixed value)데이터 처 리 모듈0x01 (fixed value)Contents 저장소 별카드 타입별 고유 ID카드별 커스텀 데이 터 작성 예 (Hex)16 01 01 00 00 00 00 00 0102 00 00 00 ... 00 01 표 1을 참고하면, 23 바이트 크기의 URI 데이터는 길이 필드, 타입 필드, 버전(version) 필드, 서비스 타입 (service type) 필드, 서비스 ID 필드, 및 시리얼 번호 필드를 포함할 수 있다.예를 들어, URI 데이터 길이 필드는 고정된 값(예: 0x16)으로 설정될 수 있다. 예를 들어, 타입 필드는 표 2와 같이 설정될 수 있다. 표 2 Data 0x01 0x02 0x04 0xFF 내용 Wallpaper Clock Theme All In One 표 2를 참고하면, 타입 필드는 외부 객체로부터 획득된 데이터를 어떤 어플리케이션(또는 모듈)에서 처리할 것 인지를 지시하도록 설정될 수 있다. 예를 들어, 버전 필드는 표 3과 같이 설정될 수 있다. 표 3 Data 0(0x01) 내용 Fixed value 표 3을 참고하면, 버전 필드는 고정된 값으로 설정될 수 있다. 예를 들어, 서비스 타입 필드는 표 4와 같이 설 정될 수 있다. 표 4 Data 0(0x0000) 1(0x0001) 2(0x0002) 내용 preloaded Download from hidden serverLink to Theme store (TBD) 표 4를 참고하면, 서비스 타입 필드는 제2 화면에 대한 정보(예: 콘텐트)가 저장된 영역(또는 장치)를 지시하기 위해 사용될 수 있다. 예를 들어, 외부 객체가 제조사에서 제공된 정품인 경우, 서비스 타입 필드의 값이 '0'으 로 설정될 수 있다. 외부 객체가 제조사에서 제공된 정품인 경우, 제2 화면에 대한 정보는 전자 장치 내에 저장된 상태일 수 있다. 실시 예에 따라, 외부 객체가 제조사에서 제공된 정품인 경우에도, 서비스 타입 필드의 값이 '2'로 설정될 수도 있다. 외부 객체가 제조사에서 제공된 정품인 경우에도, 제2 화면에 대한 정보가 외부 전자 장치에 저장된 상태일 수 있다. 예를 들어, 서비스 ID 필드는 표 5와 같이 설정될 수 있다. 표 5 Data 0x00000000~0x00FFFFFF 0x01000000 ~ 내용 정품 ID 비정품 ID 표 5를 참고하면, 서비스 ID 필드는 외부 객체의 타입에 따른 서비스 ID를 구분하기 위해 사용될 수 있다. 예를 들어, 외부 객체의 타입이 제1 타입(예: 정품)인 경우, 서비스 ID가 '0x00000000' 부터 '0x00FFFFFF' 중 하나 로 설정될 수 있다. 예를 들어, 외부 객체의 타입이 제2 타입(예: 비정품)인 경우, 서비스 ID가 '0x01000000'를 초과하는 값들 중 하나로 설정될 수 있다. 예를 들어, 서비스 ID 필드에 포함된 데이터는 상술한 제2 데이터의 일 예일 수 있다. 예를 들어, 외부 객체가 전자 장치의 제조사에서 제작된 경우, 외부 객체의 타입이 제1 타입(예: 정품)으 로 설정될 수 있다. 외부 객체가 제조사에서 제작되지는 않았으나, 제조사에서 제공된 지정된 기준에 따라 외부 객체의 품질이 인증된 경우, 외부 객체의 타입이 제2 타입(예: 비정품)으로 설정될 수 있다. 예를 들어, 시리얼 번호 필드는 표 6과 같이 설정될 수 있다. 표 6 Data 0x00 ~ 0xFF0X00 ~ 0xFF0x00000000 ~ 0xFFFFFFFF0x0000000000000000 내용 Wallpaper (1 byte)Clock Type (1 byte)Clock Color (4 bytes)Reserved (8 bytes) 0x01 : jpg 0x02 : png 0x10 : gif 0x11 : mp4 (TBD)0x00 : No Change 0x01 ~ 0xEF : clock Index 0xFF : Hide clockARGB Color 값Fixed value 표 6을 참고하면, 시리얼 번호 필드는 사용자 데이터를 전송하기 위해 사용될 수 있다. 예를 들어, wallpaper 필드의 값이 '0x01' 내지 '0x0F'인 경우, wallpaper 필드는 정지 이미지의 타입을 나타 낼 수 있다. wallpaper 필드의 값이 '0x10' 내지 '0x11'인 경우, wallpaper 필드는 동영상 타입(또는 movie 타 입)을 나타낼 수 있다. wallpaper 필드의 값이 '0x20' 이상인 경우, wallpaper 필드는 정지 이미지 및 동영상 이외의 타입을 나타낼 수 있다. 예를 들어, clock type 필드의 값이 '0x00' 인 경우, 전자 장치의 시계 스타일을 유지할 것을 나타낼 수 있다. clock 필드의 값이 '0x01' 내지 '0xEF'인 경우, clock type 필드는 필드 값에 따라 지정된 시계 스타일을 나타낼 수 있다. clock 필드의 값이 '0xF0' 내지 '0xFF'인 경우, clock type 필드는 시계의 제어를 위해 사용될 수 있다. 예를 들어, clock color 필드는 시계의 ARGB 값을 나타낼 수 있다. 일 실시 예에 따르면, 시리얼 번호 필드의 예비 필드(reserved field)의 8 bytes 중 4 bytes는 제1 화면을 표 시하기 위한 제1 데이터를 위해 설정될 수 있다. 프로세서는 예비 필드(reserved field)의 8 bytes 중 4 bytes를 통해 제1 데이터를 획득할 수 있다. 프로세서는 제1 데이터에 기반하여, 제1 화면을 표시할 수 있 다. 예를 들어, 제1 데이터는 ARGB 값을 포함할 수 있다. 프로세서는 제1 데이터에 기반하여, ARGB 값의 색상을 가지는 제1 화면을 표시할 수 있다. 일 실시 예에 따르면, 시리얼 번호 필드의 예비 필드(reserved field)의 8 bytes 중 1 byte는 전자 장치 의 상태에 따라 제2 화면의 변경 여부를 지시하기 위한 제3 데이터를 위해 설정될 수 있다. 프로세서는 예 비 필드(reserved field)의 8 bytes 중 1 byte를 통해 제3 데이터를 획득할 수 있다. 프로세서는 제3 데 이터에 기반하여, 전자 장치의 상태(예: 제1 상태 및 제2 상태)에 따라 제2 화면을 회전할지 여부를 식별 할 수 있다. 동작 1020에서, 프로세서는 외부 객체에 대응하는 제2 화면에 대한 정보가 메모리에 저장되었는지 여 부를 식별할 수 있다. 예를 들어, 프로세서는 외부 객체의 위치가 전자 장치로부터 지정된 거리 내임 을 식별하는 것에 기반하여, 외부 객체에 대응하는 제2 화면에 대한 정보가 메모리에 저장되었는지 여부를 식별할 수 있다. 예를 들어, 프로세서는 외부 객체로부터 제1 데이터, 제2 데이터 및/또는 제3 데이터 중 적어도 하나를 식별할 수 있다. 제2 데이터는 제2 화면에 대한 정보를 획득하기 위해 사용될 수 있다. 프로세서 는 제2 데이터에 기반하여, 제2 화면에 대한 정보가 메모리에 저장되었는지 여부를 식별할 수 있다. 일 예로, 프로세서는 제2 화면이 커버 디스플레이를 통해 표시된 이력이 있음을 식별하는 것에 기반 하여, 제2 화면에 대한 정보가 메모리에 저장되었음을 식별할 수 있다. 동작 1030에서, 외부 객체에 대응하는 제2 화면에 대한 정보가 메모리에 저장되지 않은 경우, 프로세서 는 제2 화면에 대한 정보를 획득하고, 제2 화면에 대한 정보에 기반하여, 제2 화면을 커버 디스플레이 를 통해 표시할 수 있다. 예를 들어, 프로세서는 외부 객체에 대응하는 제2 화면에 대한 정보가 메모 리에 저장되어 있지 않음을 식별하는 것에 기반하여, 제2 화면에 대한 정보를 획득할 수 있다. 프로세서 는 획득된 제2 화면에 대한 정보에 기반하여, 제2 화면을 커버 디스플레이를 통해 표시할 수 있다. 일 예로, 프로세서는 제1 통신 회로를 이용하여 외부 전자 장치로부터 제2 화면에 대한 정보를 획득 할 수 있다. 예를 들어, 프로세서는 제2 화면에 대한 정보를 획득하는 동안, 제1 데이터에 기반하여, 제1 화면을 표시 할 수 있다. 프로세서는 제2 화면에 대한 정보의 획득이 완료되는 것에 기반하여, 커버 디스플레이를 통해 표시되는 화면을 제1 화면으로부터 제2 화면으로 변경할 수 있다. 동작 1040에서, 외부 객체에 대응하는 제2 화면에 대한 정보가 메모리에 저장된 경우, 프로세서는 제 2 화면에 대한 정보가 획득된 시점으로부터 제1 시간(time period)(예: 24 시간)이 경과하였는지 여부를 식별할 수 있다. 예를 들어, 프로세서는 외부 객체에 대응하는 제2 화면에 대한 정보가 메모리에 저장됨을 식별하는 것에 기반하여, 제2 화면에 대한 정보가 획득된 시점으로부터 제1 시간이 경과하였는지 여부를 식별할 수 있다. 예를 들어, 프로세서는 제2 화면(또는 제2 화면에 관한 테마)의 버전(version)이 최신 버전인지 여부를 식 별하기 위해, 제2 화면에 대한 정보가 획득된 시점으로부터 제1 시간이 경과하였는지 여부를 식별할 수 있다. 예를 들어, 테마 제공자(예: 도 7의 복수의 테마 제공자들)는 제2 화면에 대한 정보를 업데이트할 수 있다. 프로세서는 제2 화면의 버전이 최신 버전인지 여부를 식별할 수 있다. 동작 1050에서, 프로세서는 제2 화면에 대한 정보가 획득된 시점으로부터 제1 시간(time period)이 경과하 지 않은 경우, 프로세서는 메모리에 저장된 제2 화면에 대한 정보에 기반하여, 제2 화면을 표시할 수 있다. 프로세서는 제2 화면에 대한 정보가 획득된 시점으로부터 제1 시간(time period)이 경과하지 않았음 을 식별할 수 있다. 프로세서는 메모리에 저장된 제2 화면에 대한 정보에 기반하여, 제2 화면을 표시 할 수 있다. 예를 들어, 프로세서는 제2 화면에 대한 정보가 메모리에 저장되고, 제2 화면에 대한 정보가 획득된 시점으로부터 제1 시간이 경과하지 않은 경우, 제1 화면을 표시하지 않고, 제2 화면을 표시할 수 있다. 프로세 서는 제1 화면을 표시하는 것을 우회하고, 메모리에 저장된 제2 화면에 대한 정보에 기반하여, 제2 화면을 커버 디스플레이를 통해 표시할 수 있다. 동작 1060에서, 제2 화면에 대한 정보가 획득된 시점으로부터 제1 시간이 경과한 경우, 프로세서는 ETAG(entity tag) 값이 변경되었는지 여부를 식별할 수 있다. 예를 들어, ETAG 값은 웹 캐시의 유효성을 검증하 기 위해 사용될 수 있다. 제2 화면에 대한 버전에 대한 고유 값이 ETAG 값으로 설정될 수 있다. 제2 화면에 대 한 버전이 변경되는 경우, ETAG 값이 변경될 수 있다. 예를 들어, 프로세서는 제2 화면에 대한 정보가 변경되었는지 여부를 식별하기 위해, ETAG 값이 변경되었 는지 여부를 식별할 수 있다. 예를 들어, 프로세서는 외부 전자 장치(예: 도 7의 테마 서버)로부터 제2 화면에 관한 ETAG 값을 획득할 수 있다. 프로세서는 메모리에 저장된 제2 화면에 대한 ETAG 값과 외부 전자 장치로부터 획득한 제2 화면에 관한 ETAG 값을 비교할 수 있다. 프로세서는 메모리에 저장 된 제2 화면에 대한 ETAG 값과 외부 전자 장치로부터 획득한 제2 화면에 관한 ETAG 값을 비교하는 것에 기반하 여, 제2 화면에 대한 ETAG 값이 변경되었는지 여부를 식별할 수 있다. 도시하지는 않았으나, 프로세서는 제2 화면이 표시된 후에도, 제1 시간에 기반하여, 제2 화면에 대한 ETAG 값이 변경되었는지 여부를 식별할 수 있다. 예를 들어, 프로세서는 제2 화면에 대한 ETAG 값이 변경되었음을 식별하는 것에 기반하여, 업데이트 된 제2 화면(또는 제3 화면)에 대한 정보를 외부 전자 장치로부터 획득할 수 있다. 프로세서는 업데이트된 제2 화면(또는 제3 화면)에 대한 정보에 기반하여, 업데이트된 제2 화면(또는 제3 화면)을 표시할 수 있다. 일 실시 예에 따르면, 프로세서는 ETAG 값이 변경된 경우, 동작 1030을 수행할 수 있다. 프로세서는 ETAG 값이 변경되었음을 식별하는 것에 기반하여, 제2 화면(또는 업데이트된 제2 화면)에 대한 정보를 획득할 수 있다. 예를 들어, 프로세서는 ETAG 값이 변경되었음을 식별하는 것에 기반하여, 제1 통신 회로를 통해, 외부 전자 장치로부터 제2 화면(또는 업데이트된 제2 화면)에 대한 정보를 획득할 수 있다. 프로세서 는 획득된 제2 화면(또는 업데이트된 제2 화면)에 대한 정보에 기반하여, 제2 화면(또는 업데이트된 제2 화면)을 커버 디스플레이를 통해 표시할 수 있다. 예를 들어, 프로세서는 ETAG 값이 변경됨을 식별하는 것에 기반하여, 제2 화면(또는 제2 화면에 대한 정보)가 변경되었음을 식별할 수 있다. 프로세서는 변경된 제2 화면을 표시하기 위해, 제2 화면에 대한 정 보를 외부 전자 장치로부터 획득할 수 있다. 일 실시 예에 따르면, 프로세서는 ETAG 값이 변경되지 않은 경우, 동작 1050을 수행할 수 있다. 프로세서 는 ETAG 값이 변경되지 않았음을 식별하는 것에 기반하여, 메모리에 저장된 제2 화면에 대한 정보를 획득(또는 식별)할 수 있다. 프로세서는 메모리에 저장된 제2 화면에 대한 정보에 기반하여, 제2 화 면을 커버 디스플레이를 통해 표시할 수 있다. 도 11은 일 실시 예에 따른 전자 장치의 동작에 관한 흐름도의 예를 도시한다. 도 11에서 도시된 동작 1110 내 지 동작 1170은 도 5의 동작 510 내지 동작 540과 관련될 수 있다. 도 11을 참고하면, 동작 1110에서, 프로세서는 외부 객체로부터 제2 데이터를 획득할 수 있다. 예를 들어, 제2 데이터는 제2 화면에 대한 정보를 획득하기 위한 정보를 포함할 수 있다. 예를 들어, 프로세서는 도 10에서 설명된 서비스 ID 필드를 통해 제2 데이터를 획득할 수 있다. 동작 1120에서, 프로세서는 외부 객체의 타입이 제1 타입인지 여부를 식별할 수 있다. 예를 들어, 프로세 서는 제2 데이터에 기반하여, 외부 객체의 타입이 제1 타입인지 여부를 식별할 수 있다. 예를 들어, 프로 세서는 서비스 ID 필드의 값이 지정된 범위(예: '0x00000000' 내지 '0x00FFFFFF') 내인지 여부를 식별하 는 것에 기반하여, 외부 객체의 타입이 제1 타입인지 여부를 식별할 수 있다. 예를 들어, 외부 객체가 전자 장치의 제조사에서 제작된 경우, 외부 객체의 타입이 제1 타입(예: 정품)으 로 설정될 수 있다. 외부 객체가 제조사에서 제작되지는 않았으나, 제조사에서 제공된 지정된 기준에 따라 외부 객체의 품질이 인증된 경우, 외부 객체의 타입이 제2 타입(예: 비정품)으로 설정될 수 있다. 동작 1130에서, 외부 객체의 타입이 제1 타입인 경우, 프로세서는 전자 장치의 자세가 변경됨에 따라 변경되는 제2 화면을 표시할 수 있다. 예를 들어, 프로세서는 외부 객체의 타입을 제1 타입으로 식별하는 것에 기반하여, 전자 장치의 자세가 변경됨에 따라 변경되는 제2 화면을 커버 디스플레이를 통해 표 시할 수 있다. 예를 들어, 프로세서는 자이로 센서를 통해 전자 장치의 자세(또는 오리엔테이션)을 식별할 수 있다. 프로세서는 전자 장치의 자세에 기반하여 변경되는 제2 화면을 표시할 수 있다. 실시 예에 따 라, 프로세서는 햅틱 센서를 더 포함할 수 있다. 프로세서는 제2 화면 상의 터치 입력에 기반하여 진 동을 출력할 수 있다. 예를 들어, 외부 객체의 타입이 제1 타입인 경우, 제2 화면에 대한 정보가 메모리에 저장된 상태일 수 있 다. 프로세서는 외부 전자 장치로부터 제2 화면에 대한 정보를 획득하지 않고, 메모리에 저장된 제2 화면에 대한 정보에 기반하여, 제2 화면을 표시할 수 있다. 프로세서는 제1 데이터에 기반하여, 제1 화면 을 표시하는 것을 우회하고, 메모리에 저장된 제2 화면에 대한 정보에 기반하여, 제2 화면을 표시할 수 있 다. 다만, 이에 한정되는 것은 아니다. 실시 예에 따라, 프로세서는 외부 객체의 타입이 제1 타입인 경우 에도, 제2 화면에 대한 정보를 외부 전자 장치로부터 획득할 수 있다. 프로세서는 제2 화면에 대한 정보가 획득되는 동안, 커버 디스플레이를 통해 제1 데이터에 기반하여, 제1 화면을 표시할 수 있다. 동작 1140에서, 외부 객체의 타입이 제1 타입이 아닌 경우, 프로세서는 외부 객체의 타입이 제2 타입인지 여부를 식별할 수 있다. 예를 들어, 프로세서는 외부 객체의 타입이 제1 타입이 아님을 식별하는 것에 기 반하여, 외부 객체의 타입이 제2 타입인지 여부를 식별할 수 있다. 예를 들어, 프로세서는 서비스 ID 필드 의 값이 지정된 범위(예: '0x00000000' 내지 '0x00FFFFFF') 밖인지 여부를 식별하는 것에 기반하여, 외부 객체 의 타입이 제2 타입인지 여부를 식별할 수 있다. 동작 1120 및 동작 1140에서, 외부 객체의 타입이 제1 타입인지 여부를 식별하고, 제2 타입인지 여부를 식별하 는 동작이 도시되었으나, 이에 한정되는 것은 아니다. 프로세서는 제2 데이터에 기반하여, 외부 객체의 타 입을 제1 타입 및 제2 타입 중 하나로 식별할 수 있다. 동작 1150에서, 외부 객체의 타입이 제2 타입인 경우, 프로세서는 외부 전자 장치로부터 제2 화면에 대한 정보를 획득할 수 있다. 프로세서는 외부 객체의 타입을 제2 타입으로 식별하는 것에 기반하여, 외부 전자 장치로부터 제2 화면에 대한 정보를 획득할 수 있다. 프로세서는 제2 통신 회로를 통해, 외부 전자 장치로부터 제2 화면에 대한 정보를 획득할 수 있다. 동작 1160에서, 프로세서는 제2 화면에 대한 정보에 기반하여, 전자 장치의 자세에 관계없이 유지되 는 제2 화면을 표시할 수 있다. 프로세서는 전자 장치의 자세가 변경되더라도 제2 화면을 유지할 수 있다. 전자 장치의 자세가 변경되더라도 제2 화면은 유지될 수 있다. 동작 1170에서, 외부 객체의 타입이 제2 타입이 아닌 경우, 프로세서는 기존 화면을 유지할 수 있다. 프로 세서는 외부 객체의 타입이 제2 타입이 아님을 식별하는 것에 기반하여, 기존 화면을 유지할 수 있다. 도 12a는 일 실시 예에 따른 전자 장치에서 제1 타입의 외부 객체를 통해 제2 화면에 대한 정보가 획득되는 예 를 도시한다. 도 12b는 일 실시 예에 따른 전자 장치에서 제2 타입의 외부 객체를 통해 제2 화면에 대한 정보가 획득되는 예 를 도시한다. 도 12a를 참고하면, 프로세서는 외부 객체로부터 NFC를 통해 데이터를 획득할 수 있다. 프로세서는 액세서리 매니저를 이용하여, 획득된 데이터의 인증 절차를 수행할 수 있다. 프로세서는 액세서리 매 니저를 이용하여, 데이터 식별부에 URI 데이터를 제공할 수 있다. 프로세서는 데이터 식별부 를 통해 URI 데이터에 포함된 서비스 ID 필드를 식별할 수 있다. 프로세서는 서비스 ID 필드의 값에 기반하여, 외부 객체의 타입이 제1 타입임을 식별할 수 있다. 프로세서는 서비스 ID 필드의 값에 기반하여, 메모리에 저장된 제2 화면에 대한 정보를 획득할 수 있다. 프로세서는 화면 변경 매니저 에게 제2 화면에 대한 정보를 제공할 수 있다. 프로세서는 화면 변경 매니저를 통해, 커버 디스 플레이의 화면을 제2 화면으로 설정할 수 있다. 예를 들어, 제2 화면은 전자 장치의 자세에 기반하여 변경되는 화면일 수 있다. 프로세서는 라이브 화면 제어부를 이용하여, 전자 장치의 자세에 기 반하여, 제2 화면을 변경할 수 있다. 도 12b를 참고하면, 프로세서는 외부 객체로부터 NFC를 통해 데이터를 획득할 수 있다. 프로세서는 액세서리 매니저를 이용하여, 획득된 데이터의 인증 절차를 수행할 수 있다. 프로세서는 액세서리 매 니저를 이용하여, 데이터 식별부에 URI 데이터를 제공할 수 있다. 프로세서는 데이터 식별부 를 통해 URI 데이터에 포함된 서비스 ID 필드를 식별할 수 있다. 프로세서는 서비스 ID 필드의 값에 기반하여, 외부 객체의 타입이 제2 타입임을 식별할 수 있다. 프로세서는 서비스 ID 필드의 값에 기반하여, 외부 전자 장치에서 제2 화면에 대한 정보를 내려 받기 위한 주소(address)를 식별할 수 있다. 일 예 로, 프로세서는 서비스 ID 필드의 값을 상기 주소의 일부로 식별할 수 있다. 프로세서는 wallpaper 필드의 값에 기반하여, 제2 화면에 대한 정보의 유형(예: jpg)를 식별할 수 있다. 프로세서는 제2 화면에 대한 정보의 유형을 상기 주소의 다른 일부로 식별할 수 있다. 프로세서는 외부 전자 장치로부터 제2 화면에 대한 정보를 획득할 수 있다. 프로세서는 화면 변경 매 니저에게 제2 화면에 대한 정보를 제공할 수 있다. 프로세서는 화면 변경 매니저를 통해, 커버 디스플레이의 화면을 제2 화면으로 설정할 수 있다. 예를 들어, 제2 화면은 전자 장치의 자세와 관계 없이 유지되는 화면일 수 있다. 일 실시 예에 따르면, 외부 객체에 따라, 제2 화면이 표시될 수 있는 횟수가 지정될 수 있다. 예를 들어, 외부 전자 장치(예: 서버)는 제2 화면에 대한 정보를 제공한 횟수에 대한 정보를 저장할 수 있다. 외부 전자 장치는 제2 화면에 대한 정보를 제공한 횟수를 전자 장치에게 제공할 수 있다. 예를 들어, 전자 장치의 프로 세서는 외부 전자 장치가 제2 화면에 대한 정보를 제공한 횟수를 사용자에게 제공할 수 있다. 프로세서 는 외부 전자 장치가 제2 화면에 대한 정보를 제공한 횟수를 나타내는 알림을 커버 디스플레이(또는 플렉서블 디스플레이)를 통해 표시할 수 있다. 예를 들어, 프로세서는 외부 객체를 통해 제2 화면을 표시할 수 있는 남은 횟수에 대한 정보를 사용자에게 제공할 수 있다. 실시 예에 따라, 제2 화면에 대한 정보를 제공한 횟수는 장치의 개수를 기준으로 식별될 수도 있다. 예를 들어, 제2 화면에 대한 정보는 지정된 개수의 장치들에게만 제공될 수도 있다. 예를 들어, 외부 객체를 통한 제2 화면에 대한 정보는 3번만 외부 전자 장치로부터 제공될 수 있도록 설정될 수 있다. 외부 전자 장치는 외부 객체를 통한 제2 화면에 대한 정보가 장치(예: 전자 장치 또는 다른 전자 장 치)에게 제공된 횟수를 식별할 수 있다. 외부 전자 장치는 3 번만 제2 화면에 대한 정보를 장치(예: 전자 장치 또는 다른 전자 장치)에게 제공할 수 있다. 도 13은 일 실시 예에 따른 커버 디스플레이를 통해 표시되는 알림의 예를 도시한다. 도 13을 참고하면, 프로세서는 커버 디스플레이를 통해 화면을 표시할 수 있다. 프로세서는 화 면 내에 중첩으로 알림을 위한 객체를 표시할 수 있다. 예를 들어, 프로세서는 영역 및/또는 영역 중 적어도 하나에 알림을 위한 객체를 표시할 수 있다. 일 실시 예에 따르면, 프로세서는 외부 전자 장치로부터 제2 화면에 대한 정보를 획득하기 위해 네트워크 연결을 확인할 수 있다. 프로세서는 네트워크에 연결된 상태이지만, 일시적인 오류가 발생한 경우, 백그라 운드에서, 제2 화면에 대한 정보를 반복적으로 요청할 수 있다. 프로세서는 지정된 횟수 이상의 요청에도 연결에도 오류가 발생하는 경우, 프로세서는 외부 객체(예: 카드)를 다시 장착할 것을 지시하는 객체 를 영역 및/또는 영역 중 적어도 하나에 표시할 수 있다. 일 실시 예에 따르면, 프로세서는 네트워크 연결이 수립되지 않음을 식별할 수 있다. 프로세서는 네 트워크 연결이 수립되지 않았음을 식별하는 것에 기반하여, 네트워크 연결을 확인하고, 외부 객체(예: 카드)를 다시 장착할 것을 지시하는 객체를 영역 및/또는 영역 중 적어도 하나에 표시할 수 있다. 일 실시 예에 따르면, 프로세서는 제2 화면에 대한 정보를 외부 전자 장치로부터 획득할 수 있다. 프로세 서는 제2 화면에 대한 정보를 외부 전자 장치로부터 획득 중임을 지시하는 객체를 영역 및/또 는 영역 중 적어도 하나에 표시할 수 있다. 예를 들어, 프로세서는 제2 화면에 대한 정보가 정상적 으로 획득된 경우, 제2 화면에 대한 정보의 획득이 완료되었음을 나타내는 객체를 표시하지 않고, 제2 화면을 표시할 수 있다. 실시 예에 따라, 프로세서는 제2 화면에 대한 정보가 정상적으로 획득된 경우, 제2 화면 에 대한 정보의 획득이 완료되었음을 나타내는 객체를 표시한 뒤, 제2 화면을 표시할 수도 있다. 일 실시 예에 따르면, 프로세서는 제2 화면에 관한 ETAG 값이 변경되었음을 식별할 수 있다. 프로세서 는 외부 전자 장치에 저장된 제2 화면이 변경되었음을 식별할 수 있다. 프로세서는 외부 전자 장치로 부터 변경된 제2 화면에 대한 정보를 획득할 수 있다. 프로세서는 외부 전자 장치로부터, 변경된 제2 화면 에 대한 정보가 획득 중임을 지시하는 객체를 영역 및/또는 영역 중 적어도 하나에 표시할 수 있다. 일 실시 예에 따르면, 프로세서는 외부 전자 장치로부터 제2 화면에 대한 정보의 획득을 실패할 수 있다. 프로세서는 외부 전자 장치로부터 제2 화면에 대한 정보의 획득이 실패하였음을 지시하는 객체를 영 역 및/또는 영역 중 적어도 하나에 표시할 수 있다. 도 14a는 일 실시 예에 따른 커버 디스플레이를 통해 표시되는 제1 화면의 예를 도시한다. 도 14b는 일 실시 예에 따른 알림을 나타내는 객체의 표시 여부를 설정하기 위한, 플렉서블 디스플레이에 표시 되는 화면의 예를 도시한다. 도 14a를 참고하면, 상태에서, 프로세서는 외부 객체와 전자 장치 사이의 거리가 지정된 거리 내임을 식별할 수 있다. 예를 들어, 프로세서는 전자 장치와 결합된 케이스의 슬롯에 외부 객체가 삽입됨을 식별할 수 있다. 예를 들어, 프로세서는 전자 장치의 상태가 제1 상태(예: 폴딩 상태)인 동안, 외부 객체와 전자 장치 사이의 거리가 지정된 거리 내임을 식별할 수 있다. 일 실시 예에 따르면, 프로세서는 외부 객체로부터 제1 데이터 및 제2 데이터를 획득할 수 있다. 프 로세서는 제1 데이터에 기반하여 제1 화면을 표시할 수 있다. 프로세서는 제2 데이터에 기반하 여, 제2 화면에 대한 정보를 획득할 수 있다. 예를 들어, 제1 화면은 제1 데이터에 기반하여 지시되는 색상을 가질 수 있다. 제1 화면은 지정된 패턴에 따라 변경될 수 있다. 예를 들어, 프로세서는 화면(1425-1) 내지 화면(1425-4)이 연속적으로 변경 되도록 설정된 제1 화면을 표시할 수 있다. 예를 들어, 프로세서는 제1 데이터에 기반하여 지시되는 색상을 식별할 수 있다. 프로세서는 상기 색상을 가지고, 화면(1425-1) 내지 화면(1425-4)과 같이, 시간에 따라 연속적인 변화 효과를 나타내는 제1 화면을 표시할 수 있다. 예를 들어, 프로세서는 제2 화면에 대한 정보가 획득되는 동안, 제1 화면을 커버 디스플레이를 통해 표시할 수 있다. 프로세서는 제1 화면에 중첩으로, 제2 화면에 대한 정보가 획득 중임을 지시 하는 객체를 표시할 수 있다. 도 14a 및 도 14b를 참고하면, 프로세서는 플렉서블 디스플레이에 객체의 표시 여부를 설정하 기 위한 화면을 표시할 수 있다. 프로세서는 전자 장치의 상태가 제2 상태(예: 언폴딩 상태)인 동안, 플렉서블 디스플레이를 통해 화면을 표시할 수 있다. 실시 예에 따라, 외부 객체와 전자장치 사이의 거리가 지정된 거리 내임을 식별하는 것에 기반하여, 화면이 제공될 수 있다. 예를 들어, 프로세서는 객체의 표시 여부를 설정하기 위한 객체를 표시할 수 있다. 프로세서 는 객체에 대한 입력(예: 스와이프 입력, 탭 입력)에 기반하여, 객체의 표시 여부를 설정할 수 있다. 일 예로, 프로세서는 객체의 상태가 제1 상태(예: on 상태)임에 기반하여, 객체를 제1 화면에 중첩으로 표시할 수 있다. 일 예로, 프로세서는 객체의 상태가 제2 상태(예: off 상태)임에 기반하여, 객체를 표시하지 않을 수 있다. 제2 화면에 대한 정보가 획득 중인 경우에도, 객체 가 제1 화면에 표시되지 않을 수 있다. 도 15는 일 실시 예에 따른 전자 장치의 동작에 관한 흐름도를 도시한다. 도 15를 참고하면, 동작 1510에서, 프로세서는 제2 화면에 대한 정보를 저장할 수 있다. 예를 들어, 프로 세서는 외부 객체와 전자 장치 사이의 거리가 지정된 거리 내임을 식별하는 것에 기반하여, 제2 화면 에 대한 정보를 메모리에 저장할 수 있다. 동작 1520에서, 프로세서는 외부 객체와 전자 장치 사이의 거리가 지정된 거리 밖으로 벗어남을 식별 할 수 있다. 예를 들어, 프로세서는 제2 화면에 대한 정보가 저장된 뒤, 외부 객체와 전자 장치 사이 의 거리가 지정된 거리 밖으로 벗어남을 식별할 수 있다. 예를 들어, 프로세서는 전자 장치와 결합된 케이스의 슬롯으로부터 외부 객체가 빠져나왔음을 식별할 수 있다. 프로세서는 외부 객체 와 전자 장치 사이의 거리가 지정된 거리 밖으로 벗어남을 식별하는 것에 기반하여, 제2 화면을 표시하는 것을 중단할 수 있다. 프로세서는 커버 디스플레이를 통해 표시되는 화면을 제2 화면으로부터 기본 화면으로 변경할 수 있다. 동작 1530에서, 프로세서는, 외부 객체와 전자 장치 사이의 거리가 지정된 거리 밖으로 벗어난 시점 으로부터 제2 시간(time period)(예: 1 주일)이 경과하였는지 여부를 식별할 수 있다. 예를 들어, 프로세서 는, 외부 객체와 전자 장치 사이의 거리가 지정된 거리 밖으로 벗어남을 식별한 뒤, 외부 객체와 전 자 장치 사이의 거리가 지정된 거리 밖으로 벗어난 시점으로부터 제2 시간이 경과하였는지 여부를 식별할 수 있다. 예를 들어, 프로세서는 외부 객체와 전자 장치 사이의 거리가 지정된 거리 내로 다시 진입하는 것에 응답하여 제2 화면을 표시하기 위해, 제2 화면에 대한 정보의 저장 여부를 결정할 수 있다. 프로세서는 외 부 객체와 전자 장치 사이의 거리가 지정된 거리 밖으로 벗어난 시점으로부터 제2 시간(time period)(예: 1 주일)이 경과하였는지 여부에 기반하여, 제2 화면에 대한 정보의 저장 여부를 결정할 수 있다. 동작 1540에서, 외부 객체와 전자 장치 사이의 거리가 지정된 거리 밖으로 벗어난 시점으로부터 제2 시간 이 경과한 경우, 프로세서는 제2 화면에 대한 정보를 제거할 수 있다. 예를 들어, 프로세서는 외부 객체와 전자 장치 사이의 거리가 지정된 거리 밖으로 벗어난 시점으로부터 제2 시간이 경과하였음을 식별 하는 것에 기반하여, 프로세서는 제2 화면에 대한 정보를 메모리에서 제거할 수 있다. 동작 1550에서, 외부 객체와 전자 장치 사이의 거리가 지정된 거리 밖으로 벗어난 시점으로부터 제2 시간 이 경과하지 않은 경우, 프로세서는 제2 화면에 대한 정보를 유지할 수 있다. 예를 들어, 프로세서는 외부 객체와 전자 장치 사이의 거리가 지정된 거리 밖으로 벗어난 시점으로부터 제2 시간이 경과하지 않았 음을 식별하는 것에 기반하여, 프로세서는 제2 화면에 대한 정보를 메모리 내에 유지할 수 있다. 일 실시 예에 따르면, 프로세서는 외부 객체와 전자 장치 사이의 거리가 지정된 거리 밖으로 벗어난 시점으로부터 제2 시간이 경과하지 않은 상태에서, 외부 객체의 위치가 전자 장치로부터 지정된 거리 내로 진입함을 식별할 수 있다. 프로세서는 메모리에 저장된 제2 화면에 대한 정보를 획득할 수 있다. 프 로세서는 제2 화면에 대한 정보에 기반하여, 제2 화면을 표시할 수 있다. 프로세서는 제1 화면을 표 시하는 것을 우회하고, 제2 화면을 표시할 수 있다. 도 16은 일 실시 예에 따른 제2 화면의 표시 여부를 설정하기 위한, 플렉서블 디스플레이에 표시되는 화면의 예 를 도시한다. 도 16을 참고하면, 상태에서, 프로세서는 플렉서블 디스플레이를 통해 전자 장치를 제어 하기 위한 설정 화면을 표시할 수 있다. 설정 화면은 커버 디스플레이의 화면을 제어하기 위 한 객체를 포함할 수 있다. 프로세서는 객체에 대한 입력에 기반하여, 상태의 화면 및 상태의 화면을 표시할 수 있다. 예를 들어, 프로세서는 외부 객체와 전자 장치 사이의 거리가 지정된 거리 내인지 여부에 기반하여, 화면 및 화면 중 하나를 표시할 수 있다. 상태에서, 외부 객체와 전자 장치 사이의 거리가 지정된 거리 내일 수 있다. 외부 객체와 전자 장치 사이의 거리가 지정된 거리 내인 경우, 프로세서는 객체에 대한 입력에 기반하여, 화면(165 2)을 표시할 수 있다. 프로세서는 화면에서, 제2 화면의 표시 여부를 설정하기 위한 객체를 표시할 수 있다. 프로세서는 객체에 대한 입력(예: 스와이프 입력, 탭 입력)에 기반하여, 제2 화면 의 표시 여부를 설정할 수 있다. 일 예로, 프로세서는 객체의 상태가 제1 상태(예: on 상태)임에 기반하여, 커버 디스플레이를 통해 제2 화면을 표시할 수 일 예로, 프로세서는 객체의 상태가 제2 상태(예: off 상태)임에 기반하 여, 커버 디스플레이에 제2 화면이 표시되지 않을 수 있다. 실시 예에 따라, 프로세서는 제2 화면을 표시하지 않고, 기본 화면만을 표시할 수 있다. 상태에서, 외부 객체와 전자 장치 사이의 거리가 지정된 거리 내가 아닐 수 있다. 외부 객체와 전자 장치 사이의 거리가 지정된 거리 밖인 경우, 프로세서는 객체에 대한 입력에 기반하여, 화면 을 표시할 수 있다. 프로세서는 화면에서, 제2 화면의 표시 여부를 설정하기 위한 객체(예: 객체)를 표시하지 않을 수 있다. 화면은 제2 화면의 표시 여부를 설정하기 위한 영역 또는 객체를 포함하지 않을 수 있다. 도 17은 일 실시 예에 따른 전자 장치의 동작에 관한 흐름도를 도시한다. 도 17을 참고하면, 동작 1710에서, 프로세서는 전자 장치의 상태가 제1 상태(예: 폴딩 상태)인 동안 커버 디스플레이를 통해 제2 화면을 표시할 수 있다. 예를 들어, 전자 장치의 상태는 제1 상태 및 제 2 상태 중 하나로 설정될 수 있다. 일 예로, 제1 상태는 제1 하우징 및 제2 하우징 사이의 각도가 지 정된 각도 범위(예: 10 도) 내인 상태를 포함할 수 있다. 제2 상태는 제1 하우징 및 제2 하우징 사이 의 각도가 지정된 각도 범위(예: 10 도) 밖인 상태를 포함할 수 있다. 예를 들어, 동작 1710은 도 5의 동작 550 과 관련될 수 있다. 동작 1720에서, 프로세서는 전자 장치의 상태가 제1 상태로부터 제2 상태로 변경되었는지 여부를 식 별할 수 있다. 예를 들어, 프로세서는 홀 센서를 이용하여, 제1 하우징 및 제2 하우징 사 이의 각도가 지정된 범위 밖으로 변경되는 것에 기반하여, 전자 장치의 상태가 제1 상태로부터 제2 상태로 변경되었는지 여부를 식별할 수 있다. 동작 1730에서, 전자 장치의 상태가 제1 상태로부터 제2 상태로 변경되지 않은 경우, 프로세서는 제2 화면의 표시를 유지할 수 있다. 예를 들어, 프로세서는 전자 장치의 상태가 제1 상태로부터 제2 상태 로 변경되지 않음을 식별하는 것에 기반하여, 제2 화면의 표시를 유지할 수 있다. 프로세서는 전자 장치 의 상태가 제1 상태로 유지되는 것에 기반하여, 커버 디스플레이를 통해 제2 화면을 표시할 수 있다. 동작 1740에서, 전자 장치의 상태가 제1 상태로부터 제2 상태로 변경된 경우, 프로세서는 제3 화면에 대한 정보가 메모리에 저장되었는지 여부를 식별할 수 있다. 예를 들어, 프로세서는 전자 장치 의 상태가 제1 상태로부터 제2 상태로 변경됨을 식별하는 것에 기반하여, 제3 화면에 대한 정보가 메모리 에 저장되었는지 여부를 식별할 수 있다. 예를 들어, 프로세서는 제2 화면에 대한 정보와 함께 제3 화면에 대한 정보를 외부 전자 장치로부터 획득 할 수 있다. 프로세서는 제2 화면에 대한 정보 및 제3 화면에 대한 정보를 메모리에 저장할 수 있다. 동작 1750에서, 프로세서는 제3 화면에 대한 정보가 저장된 경우, 제3 화면을 표시할 수 있다. 예를 들어, 프로세서는 제3 화면에 대한 정보가 메모리에 저장되었음을 식별하는 것에 기반하여, 제2 상태에서, 제3 화면을 커버 디스플레이를 통해 표시할 수 있다. 예를 들어, 제3 화면은 전자 장치가 제2 상태에서 표시될 수 있다. 실시 예에 따라, 프로세서는 제3 화면을 외부 객체와 연결되도록 표시할 수 있다. 예를 들어, 케이스는 투명한 상태일 수 있다. 프로세서 는 외부 객체의 일 면 및 제3 화면이 연속된 이미지를 형성하도록 제3 화면을 표시할 수 있다. 동작 1760에서, 프로세서는 제3 화면에 대한 정보가 저장되지 않은 경우, 제2 화면의 표시 방향을 변경할 수 있다. 예를 들어, 프로세서는 제3 화면에 대한 정보가 저장되어 있지 않음을 식별하는 것에 기반하여, 제2 화면의 표시 방향을 변경할 수 있다. 일 예로, 전자 장치의 상태가 제1 상태로부터 제2 상태로 변화됨 에 따라, 사용자에 의해 인식되는 커버 디스플레이의 화면이 반대로 변경될 수 있다. 따라서, 프로세서 는 전자 장치의 상태가 제1 상태로부터 제2 상태로 변화되는 것에 기반하여, 제2 화면의 표시 방향을 변경할 수 있다. 프로세서는 제2 화면의 표시 방향을 180도 회전하여 표시할 수 있다. 실시 예에 따라, 프 로세서는 제2 화면의 회전이 필요하지 않은 경우, 동작 1730을 수행할 수 있다. 일 실시 예에 따르면, 프로세서는 제2 화면의 유형에 기반하여 제2 화면의 회전 여부를 결정할 수 있다. 예를 들어, 프로세서는 외부 객체로부터 제3 데이터를 획득할 수 있다. 제3 데이터는 전자 장치의 상 태에 따라 제2 화면의 변경 여부를 지시하기 위해 사용될 수 있다. 프로세서는 제3 데이터에 기반하여, 제 2 화면의 회전 여부를 결정할 수 있다. 도 18은 일 실시 예에 따른 제2 화면의 표시 여부를 설정하기 위한, 플렉서블 디스플레이에 표시되는 화면의 예 를 도시한다. 도 18을 참고하면, 예에서, 전자 장치의 상태가 제1 상태(예: 폴딩 상태)일 수 있다. 프로세서(21 0)는 외부 객체의 위치가 전자 장치로부터 지정된 거리 내임을 식별하는 것에 기반하여, 커버 디스플레이 를 통해 제2 화면을 표시할 수 있다. 예에서, 프로세서는 전자 장치의 상태가 제1 상태(예: 폴딩 상태)로부터 제2 상태(예: 언폴딩 상태)로 변경됨을 식별할 수 있다. 예를 들어, 전자 장치의 구조에 따라, 전자 장치의 상태가 제1 상 태로부터 제2 상태로 변경되는 경우, 사용자는 뒤집혀서 표시된 제2 화면을 식별할 수 있다. 예에서, 프로세서는 전자 장치의 상태가 제1 상태로부터 제2 상태로 변경되는 것에 기반하여, 제2 화면의 표시 방향을 변경할 수 있다. 예를 들어, 프로세서는 제2 화면을 지정된 방향으로 회전하여 표시할 수 있다. 일 예로, 프로세서는 제2 화면을 180도 회전하여 표시할 수 있다. 예에서, 프로세서는 표시 방향이 변경된 제2 화면이 표시된 상태로 지정된 시간(예: 5초, 10 초, 15초)이 경과함을 식별할 수 있다. 프로세서는 커버 디스플레이를 비활성화 할 수 있다. 예를 들 어, 프로세서는 커버 디스플레이를 통해 블랙 화면을 표시할 수 있다. 일 실시 예에 따르면, 프로세서는 커버 디스플레이에 대한 입력(예: 탭 입력, 더블 탭 입력, 또는 스 와이프 입력)을 식별할 수 있다. 프로세서는 상기 입력에 기반하여, 커버 디스플레이를 활성화할 수 있다. 예를 들어, 프로세서는 커버 디스플레이를 통해 표시 방향이 변경된 제2 화면을 표시할 수 있다. 도 19a 및 도 19b는 일 실시 예에 따른 커버 디스플레이를 통해 표시되는 제2 화면의 예를 도시한다. 도 19a를 참고하면, 외부 객체가 케이스 내에 장착될 수 있다. 전자 장치의 상태가 제2 상태에 서, 프로세서는 커버 디스플레이를 통해 제2 화면을 표시할 수 있다. 케이스는 투명한 재 질로 구성될 수 있다. 따라서, 외부 객체의 일 면이 외부로 노출될 수 있다. 프로세서는 외부 객체 의 일 면과 연속된 이미지(또는 영상)을 제2 화면을 통해 표시할 수 있다. 예를 들어, 프로세서 는 외부 객체에 표시된 캐릭터에 관한, 배경 이미지 또는 배경 영상을 나타내는 제2 화면을 표 시할 수 있다. 도 19b를 참고하면, 외부 객체가 케이스 내에 장착될 수 있다. 전자 장치의 상태가 제2 상태에 서, 프로세서는 커버 디스플레이를 통해 제2 화면을 표시할 수 있다. 케이스는 투명한 재 질로 구성될 수 있다. 따라서, 외부 객체의 일 면이 외부로 노출될 수 있다. 프로세서는 외부 객체 의 일 면과 연속된 이미지(또는 영상)을 제2 화면을 통해 표시할 수 있다. 예를 들어, 외부 객체 의 일 면은 심해를 나타내는 이미지를 포함할 수 있다. 프로세서는 해수면에 관한 이미지 또는 영상을 나타내는 제2 화면을 표시할 수 있다. 도 19a 및 도 19b를 참고하면, 외부 객체를 통해 고정된 이미지가 표시되는 동안, 프로세서는, 상기 고정된 이미지와 연결되는 제2 화면(1910, 1920)을 커버 디스플레이를 통해 표시할 수 있다. 전자 장치 의 사용자는 고정된 이미지 및 제2 화면(1910, 1920)의 유기적인 일체감을 느낄 수 있다. 도시하지는 않았으나, 실시 예에 따라, 케이스의 형상은 외부 객체에 대한 이미지와 연계될 수 있다. 전자 장치의 사용자는 케이스, 고정된 이미지, 및 제2 화면(1910, 1920)의 디자인의 연속성을 느낄 수 있 다. 도 20a 내지 도 20e는 커버 디스플레이에 표시되는 화면에 대한 설정을 변경하기 위한 전자 장치의 동작의 예를 도시한다. 도 20a를 참고하면, 예에서, 프로세서는 커버 디스플레이를 통해 화면을 표시할 수 있다. 화면은 외부 객체와 관련된 화면일 수 있다. 일 실시 예에 따르면, 프로세서는 커버 디스플레이에 대한 입력(예: 롱 프레스 입력)을 식별할 수 있다. 프로세서는 입력에 기반하여, 커버 디스플레이를 통해 표시되는 화면을 예의 화면과 같이 표시할 수 있다. 예에서, 프로세서는 커버 디스플레이에서 표시가능한 화면들을 나타내는 복수의 객체들 을 표시할 수 있다. 예를 들어, 프로세서는 제1 사용자 입력(예: 스와이프 입력)에 기반하여, 복수의 객체 들 중 하나를 선택하기 위한 입력을 식별할 수 있다. 예에서, 프로세서는 복수의 객체들 중 화면을 나타내는 객체가 선택됨을 식별할 수 있다. 예를 들어, 프로세서는 제1 사용자 입력(예: 스와이프 입력)에 기반하여, 복수의 복수의 객체들 의 배치 순서를 변경할 수 있다. 프로세서는 객체가 복수의 객체들 중 가장 상단에서 표시된 화면(또는 상태)에서, 객체에 대한 제2 사용자 입력(예: 탭 입력)을 식별할 수 있다. 프로 세서는 제2 사용자 입력에 기반하여, 복수의 객체들 중 화면을 나타내는 객체가 선택됨 을 식별할 수 있다. 예에서, 프로세서는 커버 디스플레이를 통해 선택된 화면을 표시할 수 있다. 프로세서 는 커버 디스플레이를 통해 선택된 화면이 표시되는 동안, 외부 객체와 전자 장치 사이의 거리가 지정된 거리 밖으로 벗어남을 식별하는 것에 기반하여, 화면의 표시를 중단할 수 있다. 예에서, 프로세서는 외부 객체와 전자 장치 사이의 거리가 지정된 거리 밖으로 벗어남을 식별 하는 것에 기반하여, 프로세서는 전자 장치에서 기본적으로 제공되는 화면인 화면을 커버 디스 플레이를 통해 표시할 수 있다. 도 20a에서는, 설명의 편의를 위해 커버 디스플레이를 통해 표시되는 화면의 배경 이미지가 도시되었으나 이에 한정되는 것은 아니다. 커버 디스플레이를 통해 표시되는 화면은 사용자 인터페이스(예: 위젯, 시계, 배터리 잔량 정보)를 포함할 수 있다. 20b를 참고하면, 프로세서는 커버 디스플레이를 통해 표시되는 화면을 편집(edit)할 수 있다. 예를 들어, 프로세서는 플렉서블 디스플레이를 통해 커버 디스플레이를 통해 표시되는 화면을 편집하 기 위한 화면들을 제공할 수 있다. 예에서, 프로세서는 커버 디스플레이 내에서 시계, 날짜, 및 배터리 정보의 배치에 관한 복수 의 구성들을 제공하기 위한 화면을, 플렉서블 디스플레이를 통해, 표시할 수 있다. 프로세서 는 복수의 구성들 중 하나에 대한 선택에 기반하여, 시계, 날짜, 및 배터리 정보의 배치를 결정할 수 있다. 예에서, 프로세서는 커버 디스플레이 내에서 표시되는 텍스트의 색상을 변경하기 위한 화면 을, 플렉서블 디스플레이를 통해, 표시할 수 있다. 예를 들어, 프로세서는 대표 색상들을 선택 하기 위한 객체들을 표시할 수 있다. 예를 들어, 프로세서는 사용자 지정 색상을 선택하기 위한 객체 를 표시할 수 있다. 예에서, 객체에 대한 입력(예: 터치 입력)을 식별하는 것에 기반하여, 프로세서는 사용자 지 정 색상을 선택하기 위한 객체를 화면을 통해 표시할 수 있다. 실시 예에 따라 객체는 객체 가 표시된 화면에 중첩으로 표시될 수 있다. 예를 들어, 객체는 색상 테이블을 나타내는 객체, 색포화도를 조절하기 위한 객체, 및/또는 불투명도를 조절하기 위한 객체 중 적어도 하나를 포함할 수 있다. 20c를 참고하면, 프로세서는 커버 디스플레이를 통해 표시되는 화면을 변경할 수 있다. 예를 들어, 프로세서는 메모리 내에 저장되거나, 외부 전자 장치로부터 획득 가능한 화면의 목록을 제공할 수 있 다. 예를 들어, 프로세서는 화면에서, 메모리 내에 저장되거나, 외부 전자 장치로부터 획득 가능한 화면들의 제1 목록을 표시할 수 있다. 프로세서는 플렉서블 디스플레이에 대한 스와이프 입력에 기반 하여, 플렉서블 디스플레이를 통해 표시되는 화면을 화면에서 화면으로 전환할 수 있다. 프로 세서는 화면에서, 메모리 내에 저장되거나, 외부 전자 장치로부터 획득 가능한 화면들의 제2 목록을 표시할 수 있다. 20d를 참고하면, 프로세서는 커버 디스플레이에 표시되는 정보의 배치를 편집하기 위한 화면을 플렉서블 디스플레이를 통해, 제공할 수 있다. 프로세서는 화면 내에 표시된 커버 디스플레이 를 통해 표시될 화면을 나타내는 객체에 대한 입력을 식별할 수 있다. 프로세서는 입력에 기반하여, 플렉서블 디스플레이를 통해 표시되는 화면을 화면으로부 터 화면으로 변경할 수 있다. 프로세서는 시계를 나타내는 객체, 배터리 잔량 정보를 나타내 는 객체, 및 카메라 어플리케이션의 실행을 나타내는 객체에 대한 배치를 변경하기 위한 화면 을 제공할 수 있다. 예를 들어, 프로세서는 객체, 객체, 또는 객체 중 하나에 대한 드래그 입력에 기반하여, 객체, 객체, 또는 객체 중 하나가 표시되는 위치를 변경할 수 있다. 도 20d에서는, 객체, 객체, 또는 객체의 배치를 변경하는 예가 도시되었으나, 이에 한정되는 것은 아니다. 도 20d에서 도시되지 않은 정보를 나타내는 객체의 위치가 사용자 입력에 기반하여 변경될 수 있 다. 도 20e를 참고하면, 프로세서는 커버 디스플레이를 통해 표시되는 화면에 대한 설정을 변경하기 위한 화면을 표시할 수 있다. 프로세서는 전자 장치가 제2 상태인 동안, 커버 디스플레이를 통 해 화면을 표시할 것인지를 설정하기 위한 객체를 표시할 수 있다. 예를 들어, 프로세서는 객체에 대한 입력(예: 터치 입력)에 기반하여, 플렉서블 디스플레이를 통해 표시되는 화면을 화면로부터 화면으로 변경할 수 있다. 프로세서는 전자 장치가 제 2 상태인 동안, 커버 디스플레이가 켜지는 시간을 설정하기 위한 객체를 표시할 수 있다. 예를 들어, 프로세서는 전자 장치가 제2 상태인 동안, 커버 디스플레이의 화면이 유지되는 시간을 5 초, 10초, 및 15초 중 하나로 설정할 수 있다. 도 20a 내지 도 20e에서, 커버 디스플레이에 표시되는 화면에 대한 설정을 변경하기 위한 화면이 플렉서블 디스플레이를 통해 표시되는 것으로 설명되었으나, 이에 한정되는 것은 아니다. 프로세서는 커버 디 스플레이에 표시되는 화면에 대한 설정을 변경하기 위한 화면을, 커버 디스플레이를 통해 표시할 수 있다. 도 21은 일 실시 예에 따른, 외부 객체에 관한 제2 화면을 설정하기 위한 전자 장치의 동작의 예를 도시한다. 도 21을 참고하면, 프로세서는 전자 장치로부터 지정된 거리 내에 위치한 외부 객체를 식별할 수 있다. 프로세서는 외부 객체에 관한 제2 화면을 설정하기 위한 화면을 플렉서블 디스플레 이를 통해 표시할 수 있다. 예를 들어, 프로세서는 화면 내에, 외부 객체의 접근에 따라 커버 디스플레이를 통해 표시되는 화면을 나타내는 객체를 표시할 수 있다. 프로세서는 화면 내에, 커버 디스플레이를 통해 표시되는 화면을 생성(또는 편집)하기 위한 객체를 표시할 수 있다. 일 실시 예에 따르면, 프로세서는 커버 디스플레이를 통해 표시되는 화면을 생성(또는 편집)하기 위 한 적어도 하나의 입력을 식별할 수 있다. 프로세서는 적어도 하나의 입력에 기반하여, 생성(또는 편집)된 화면이 커버 디스플레이를 통해 표시되도록 설정할 수 있다. 프로세서는 NFC를 이용하여, 외부 객체 에 생성(또는 편집)된 화면에 대한 데이터를 쓸(write) 수 있다. 프로세서는 외부 전자 장치(예: 테 마 서버)에 편집된 화면을 업로드할 수 있다. 전자 장치의 사용자는 생성(또는 편집)된 화면에 대한 데이터가 포함된 외부 객체를 다른 사용자에 게 제공할 수 있다. 다른 사용자의 다른 전자 장치는, 외부 객체의 접근에 기반하여, 다른 전자 장치의 커버 디스플레이를 통해 생성(또는 편집)된 화면을 표시할 수 있다. 도 22는 일 실시 예에 따른, 외부 객체에 따라 변경되는 화면의 예를 도시한다. 도 22를 참고하면, 프로세서는 외부 객체에 따라 다른 화면을 표시할 수 있다. 프로세서는 외부 객체 가 변경되는 것에 기반하여, 변경된 외부 객체에 관한 화면을 표시할 수 있다. 예를 들어, 프로세서는 전자 장치로부터 지정된 거리 내에 위치하는 외부 객체에 기반하여, 커 버 디스플레이를 통해 화면을 표시할 수 있다. 프로세서는 외부 객체와 전자 장치 사이의 거리가 지정된 거리 밖으로 벗어남을 식별할 수 있다. 프로세서는 화면의 표시를 중단할 수 있다. 프로세서는 화면의 표시를 중단하고, 기본 화면을 표시할 수 있다. 프로세서는 외부 객체와 구별되는 외부 객체가 접근함을 식별할 수 있다. 프로세서는 외 부 객체와 전자 장치 사이의 거리가 지정된 거리 내임을 식별하는 것에 기반하여, 외부 객체 에 관한 화면을 표시할 수 있다. 상술한 실시 예와 같이, 전자 장치의 사용자는 전자 장치의 케이스에 삽입되는 외부 객체(2210, 2220)를 변경하는 것에 기반하여, 커버 디스플레이를 통해 표시되는 화면을 쉽게 변경할 수 있다. 전자 장 치의 사용자는 다양한 외부 객체들을 보유할 수 있다. 전자 장치의 사용자는 상황, 기분, 및 환경 중 적어도 하나에 기반하여, 다양한 외부 객체들 중 하나를 이용하여 커버 디스플레이에 표시되는 화면을 변 경할 수 있다. 도 23a 내지 동작 23c는 일 실시 예에 따른, 전자 장치 및 전자 장치와 연결된 다른 전자 장치의 동작의 예를 도시한다. 도 23a 내지 도 23c를 참고하면, 전자 장치는 다른 전자 장치(2301, 2302, 2303)와 연결된 상태일 수 있다. 프로세서는 전자 장치의 외부 객체에 기반하여, 커버 디스플레이에 표시되는 화면을 변경 할 수 있다. 프로세서는 커버 디스플레이에 표시되는 화면을 변경하는 것에 기반하여, 다른 전자 장 치(2301, 2302, 2303)의 디스플레이의 화면을 변경할 수 있다. 예를 들어, 전자 장치는 다른 전자 장치 (2301, 2302, 2303)와 동기화된 상태일 수 있다. 도 23a를 참고하면, 전자 장치는 다른 전자 장치와 연결될 수 있다. 예를 들어, 다른 전자 장치 는 웨어러블 장치일 수 있다. 예를 들어, 프로세서는 커버 디스플레이를 통해 기본 화면(231 1)을 표시할 수 있다. 예를 들어, 다른 전자 장치는 기본 화면에 대응하는 화면을 표시할 수 있다. 상태에서, 프로세서는 전자 장치 및 외부 객체 사이의 거리가 지정된 거리 내인지 여부를 식별 할 수 있다. 상태는 도 6의 상태에 상응할 수 있다. 상태에서, 프로세서는 외부 객체로부터 제1 데이터 및 제2 데이터를 획득할 수 있다. 프로세서(21 0)는 제1 데이터에 기반하여, 제1 화면을 표시할 수 있다. 프로세서는 제1 화면을 커버 디스 플레이를 통해 표시하는 것에 기반하여, 다른 전자 장치의 디스플레이를 통해, 제1 화면에 대 응하는 화면을 표시할 수 있다. 프로세서는 다른 전자 장치의 디스플레이를 통해 화면 을 표시하도록 다른 전자 장치를 제어하기 위한 신호를 다른 전자 장치에게 전송할 수 있다. 다른 전자 장치는 제1 화면에 대응하는 화면을 다른 전자 장치의 디스플레이를 통해 표시할 수 있다. 실시 예에 따라, 화면은 화면에 대한 정보가 획득 중임을 지시하는 객체를 포함할 수 있다. 상태에서, 프로세서는 제2 데이터에 기반하여, 제2 화면에 대한 정보를 획득할 수 있다. 프로 세서는 제2 화면에 대한 정보의 획득에 기반하여, 제2 화면을 커버 디스플레이를 통해 표시할 수 있다. 프로세서는 제2 화면을 커버 디스플레이를 통해 표시하는 것에 기반하여, 다 른 전자 장치의 디스플레이를 통해, 제2 화면에 대응하는 화면을 표시할 수 있다. 프로세서 는 다른 전자 장치의 디스플레이를 통해 화면을 표시하도록 다른 전자 장치를 제어하기 위한 신호를 다른 전자 장치에게 전송할 수 있다. 다른 전자 장치는 제2 화면에 대응하는 화 면을 다른 전자 장치의 디스플레이를 통해 표시할 수 있다. 도 23b를 참고하면, 전자 장치는 다른 전자 장치와 연결될 수 있다. 예를 들어, 다른 전자 장치 는 차량(또는 차량 내의 디스플레이를 포함하는 전자 장치)일 수 있다. 예를 들어, 프로세서는 커버 디스플레이를 통해 기본 화면을 표시할 수 있다. 예를 들어, 다른 전자 장치는 기본 화면 에 대응하는 화면을 표시할 수 있다. 상태에서, 프로세서는 전자 장치 및 외부 객체 사이의 거리가 지정된 거리 내인지 여부를 식별 할 수 있다. 상태는 도 6의 상태에 상응할 수 있다. 상태에서, 프로세서는 외부 객체로부터 제1 데이터 및 제2 데이터를 획득할 수 있다. 프로세서(21 0)는 제1 데이터에 기반하여, 제1 화면을 표시할 수 있다. 프로세서는 제1 화면을 커버 디스 플레이를 통해 표시하는 것에 기반하여, 다른 전자 장치의 디스플레이를 통해, 제1 화면에 대 응하는 화면을 표시할 수 있다. 실시 예에 따라, 화면은 화면에 대한 정보가 획득 중임을 지시하는 객체를 포함할 수 있다. 상태에서, 프로세서는 제2 데이터에 기반하여, 제2 화면에 대한 정보를 획득할 수 있다. 프로 세서는 제2 화면에 대한 정보의 획득에 기반하여, 제2 화면을 커버 디스플레이를 통해 표시할 수 있다. 프로세서는 제2 화면을 커버 디스플레이를 통해 표시하는 것에 기반하여, 다 른 전자 장치의 디스플레이를 통해, 제2 화면에 대응하는 화면을 표시할 수 있다. 실시 예에 따라, 다른 전자 장치는 전자 장치와 독립적으로 동작할 수도 있다. 다른 전자 장치 는 제1 통신 회로에 상응하는 컴포넌트(예: NFC reader)를 포함할 수 있다. 예를 들어, 다른 전자 장치는 상기 컴포넌트에 외부 객체가 지정된 거리 내로 접근함을 식별하는 것에 기반하여, 화면을 표시할 수 있다. 예를 들어, 다른 전자 장치는 외부 객체와 함께 전자 장치가 다른 전자 장치에 관한 공간(예: 차량 내부 공간)에 진입함을 식별할 수 있다. 다른 전자 장치는 외부 객체와 함께 전자 장치가 다른 전자 장치에 관한 공간(예: 차량 내부 공간)에 진입함을 식별하는 것에 기반하여, 다른 전자 장치 의 디스플레이를 통해 제2 화면에 대응하는 화면을 표시할 수 있다. 도 23c를 참고하면, 전자 장치는 다른 전자 장치와 연결될 수 있다. 예를 들어, 다른 전자 장치 는 디스플레이를 포함하는 전자 장치(예: TV, 냉장고, 에어컨)일 수 있다. 예를 들어, 프로세서는 커버 디스플레이를 통해 기본 화면을 표시할 수 있다. 예를 들어, 다른 전자 장치는 기본 화 면에 대응하는 화면을 표시할 수 있다. 상태에서, 프로세서는 전자 장치 및 외부 객체 사이의 거리가 지정된 거리 내인지 여부를 식별 할 수 있다. 상태는 도 6의 상태에 상응할 수 있다. 상태에서, 프로세서는 외부 객체로부터 제1 데이터 및 제2 데이터를 획득할 수 있다. 프로세서(21 0)는 제1 데이터에 기반하여, 제1 화면을 표시할 수 있다. 프로세서는 제1 화면을 커버 디스 플레이를 통해 표시하는 것에 기반하여, 다른 전자 장치의 디스플레이를 통해, 제1 화면에 대 응하는 화면을 표시할 수 있다. 실시 예에 따라, 화면은 화면에 대한 정보가 획득 중임을 지시하는 객체를 포함할 수 있다. 상태에서, 프로세서는 제2 데이터에 기반하여, 제2 화면에 대한 정보를 획득할 수 있다. 프로 세서는 제2 화면에 대한 정보의 획득에 기반하여, 제2 화면을 커버 디스플레이를 통해 표시할 수 있다. 프로세서는 제2 화면을 커버 디스플레이를 통해 표시하는 것에 기반하여, 다른 전자 장치의 디스플레이를 통해, 제2 화면에 대응하는 화면을 표시할 수 있다. 실시 예에 따라, 다른 전자 장치는 전자 장치와 독립적으로 동작할 수도 있다. 다른 전자 장치 는 제1 통신 회로에 상응하는 컴포넌트(예: NFC reader)를 포함할 수 있다. 예를 들어, 다른 전자 장치는 상기 컴포넌트에 외부 객체가 지정된 거리 내로 접근함을 식별하는 것에 기반하여, 화면을 표시할 수 있다. 예를 들어, 다른 전자 장치는 외부 객체와 함께 전자 장치가 다른 전자 장치에 관한 공간(예: 집 안)에 진입함을 식별할 수 있다. 다른 전자 장치는 외부 객체와 함께 전자 장치가 다른 전자 장 치에 관한 공간(예: 집 안)에 진입함을 식별하는 것에 기반하여, 다른 전자 장치의 디스플레이를 통해 제2 화면에 대응하는 화면을 표시할 수 있다. 도 23a 내지 도 23c는 제2 화면(2315, 2325, 2335)이 표시되기 전, 제1 화면(2313, 2323, 2333)을 표시하는 예 가 도시되었으나, 이에 한정되는 것은 아니다. 예를 들어, 프로세서는 제2 화면(2315, 2325, 2335)이 표시 되기 전, 음악 및/또는 영상 중 적어도 하나를 출력할 수 있다. 예를 들어, 프로세서는 다른 전자 장치 (2301, 2302, 2303)에 제2 화면(2315, 2325, 2335)에 대응되는 화면(2316, 2326, 2336)이 표시되기 전, 다른 전자 장치(2301, 2302, 2303)를 통해 음악 및/또는 영상 중 적어도 하나를 출력할 수 있다. 도 24는 일 실시 예에 따른 전자 장치 및 전자 장치와 연결된 복수의 다른 전자 장치들의 동작의 예를 도시한다. 도 24를 참고하면, 전자 장치는 허브 장치와 연결될 수 있다. 허브 장치는 전자 장치 뿐 만 아니라 복수의 다른 전자 장치들과 연결될 수 있다. 예를 들어, 허브 장치는 무선 랜 또는 지그 비(zigbee) 통신에 기반하여 전자 장치 및 복수의 다른 전자 장치들과 연결될 수 있다. 일 실시 예에 따르면, 전자 장치가 허브 장치에 접근할 수 있다. 전자 장치는 허브 장치 상에 놓여질 수 있다. 예를 들어, 프로세서는 전자 장치와 허브 장치 사이의 거리가 기준 거리 내임을 식별할 수 있다. 예를 들어, 전자 장치의 케이스에 외부 객체가 결합된 상태 일 수 있다. 프로세서는 전자 장치 및 허브 장치 사이의 거리가 기준 거리 내임에 기반하여, 제2 화면에 대 한 정보를 허브 장치에게 송신할 수 있다. 허브 장치는 제2 화면에 대한 정보를 수신할 수 있다. 일 실시 예에 따르면, 허브 장치는 제2 화면에 대한 정보에 기반하여, 복수의 다른 전자 장치들을 제어할 수 있다. 예를 들어, 제2 화면에 관한 대표 색상은 노란색일 수 있다. 제1 화면은 노란색을 가질 수 있다. 예를 들어, 허브 장치는 복수의 다른 전자 장치들 중 디스플레이를 포함하는 다른 전자 장치(예: 다른 전 자 장치(2410-2))를 식별할 수 있다. 허브 장치는 식별된 다른 전자 장치의 디스플레이를 통해 노란색을 가지는 제2 화면에 대응하는 노란색을 가지는 화면을 표시하도록, 다른 전자 장치(예: 다른 전자 장치(2410- 2))를 제어할 수 있다. 예를 들어, 허브 장치는 복수의 다른 전자 장치들 중 광원을 포함하는 다른 전자 장치(예: 다른 전자 장 치(2410-3))를 식별할 수 있다. 허브 장치는 식별된 다른 전자 장치의 광원을 통해 노란색을 가지는 빛을 방출하도록, 다른 전자 장치(예: 다른 전자 장치(2410-3))를 제어할 수 있다. 예를 들어, 허브 장치는 복수의 다른 전자 장치들 중 스피커를 포함하는 다른 전자 장치(예: 다른 전자 장치(2410-5))를 식별할 수 있다. 허브 장치는 식별된 다른 전자 장치의 스피커를 통해 노란색에 관한 음 악을 출력하도록, 다른 전자 장치(예: 다른 전자 장치(2410-5))를 제어할 수 있다. 도 25a 및 도 25b는 일 실시 예에 따른 전자 장치의 동작의 예를 도시한다. 도 25a를 참고하면, 전자 장치는 디스플레이를 포함할 수 있다. 예를 들어, 전자 장치에 케이스 가 결합될 수 있다. 케이스는 상술한 외부 객체를 포함할 수 있다. 전자 장치에 케이스 가 결합된 상태에서, 전자 장치의 디스플레이의 일부 부분만 외부로 노출될 수 있다. 상태에서, 전자 장치(또는 전자 장치의 프로세서)는 케이스가 결합됨을 식별할 수 있 다. 전자 장치는 케이스가 결합됨을 식별하는 것에 기반하여, 케이스로부터 제1 데이터 및제2 데이터를 획득할 수 있다. 상태에서, 전자 장치는 제2 데이터에 기반하여 제2 화면에 대한 정보가 획득되는 동안, 디스 플레이의 일부 부분에 제1 화면을 표시할 수 있다. 전자 장치는 제1 화면에 중첩으로 제2 화면에 대한 정보가 획득 중임을 나타내는 객체를 표시할 수 있다. 상태에서, 전자 장치는 제2 화면에 대한 정보가 획득된 뒤, 제2 화면에 대한 정보에 기반하여, 디스플레이의 일부 부분에 제2 화면을 표시할 수 있다. 도 25b를 참고하면, 전자 장치는 디스플레이를 포함할 수 있다. 예를 들어, 전자 장치에 케이스 가 결합될 수 있다. 케이스는 상술한 외부 객체를 포함할 수 있다. 전자 장치에 케이스 가 결합된 상태에서, 전자 장치의 디스플레이의 일부 부분만 외부로 노출될 수 있다. 도 25a와 달리, 디스플레이의 일부 부분은 전자 장치의 가장자리를 따라 설정될 수 있다. 상태에서, 전자 장치(또는 전자 장치의 프로세서)는 케이스가 결합됨을 식별할 수 있 다. 전자 장치는 케이스가 결합됨을 식별하는 것에 기반하여, 케이스로부터 제1 데이터 및 제2 데이터를 획득할 수 있다. 상태에서, 전자 장치는 제2 데이터에 기반하여 제2 화면에 대한 정보가 획득되는 동안, 디스플레이 의 일부 부분에 제1 화면을 표시할 수 있다. 전자 장치는 제1 화면에 중첩으로 제2 화 면에 대한 정보가 획득 중임을 나타내는 객체를 표시할 수 있다. 상태에서, 전자 장치는 제2 화면에 대한 정보가 획득된 뒤, 제2 화면에 대한 정보에 기반하여, 디스플레이의 일부 부분에 제2 화면을 표시할 수 있다. 도 26은 일 실시 예에 따른 화면을 변경하기 위한 전자 장치의 동작의 예를 도시한다. 도 26을 참고하면, 전자 장치는 디스플레이를 포함할 수 있다. 예를 들어, 전자 장치에 케이 스가 결합될 수 있다. 케이스는 슬롯을 포함할 수 있다. 전자 장치에 케이스가 결합된 상태에서, 전자 장치(또는 전자 장치의 프로세서)는 전자 장치의 디스플레이를 통해 화면을 표시할 수 있다. 예를 들어, 전자 장치은 상술한 도 2 내지 도 6에 도시된 전자 장치에 상응할 수 있다. 전자 장치 의 프로세서는, 상술한 도 2의 프로세서에 상응할 수 있다. 예를 들어, 도 26에 도시된 전자 장치의 폼 팩터(form factor)는 도 6에 도시된 전자 장치의 폼 팩 터와 상이할 수 있다. 예를 들어, 전자 장치는 바-타입(bar-type)으로 형성될 수 있다. 상태에서, 전자 장치(전자 장치의 프로세서)는, 슬롯에 외부 객체가 삽입됨을 식 별할 수 있다. 전자 장치(전자 장치의 프로세서)는 전자 장치 및 외부 객체의 사이의 거리가 지정된 거리 내임을 식별하는 것에 기반하여, 외부 객체가 슬롯에 삽입되었음을 식별할 수 있다. 실시 예에 따라, 케이스는 외부 객체가 삽입(또는 결합)되었는지 여부를 식별하기 위한 컴포 넌트를 포함할 수 있다. 전자 장치(예: 전자 장치의 프로세서)는 케이스로부터 정보를 획득 할 수 있다. 전자 장치(예: 전자 장치의 프로세서)는 케이스로부터 획득된 정보에 기반하여, 외부 객체가 슬롯에 삽입되었음을 식별할 수 있다. 상태에서, 전자 장치 및 외부 객체의 사이의 거리가 지정된 거리 밖인 경우, 전자 장치 (예: 전자 장치의 프로세서)는 디스플레이를 통해 기본 화면을 표시할 수 있다. 예를 들어, 기본 화면은 전자 장치에서 기본적으로 제공되는 화면을 의미할 수 있다. 예를 들어, 기본 화면은 대기 화면(또는 홈 화면)을 포함할 수 있다. 예를 들어, 기본 화면은, 외부 객체를 통 해 변경되지 않은 화면을 의미할 수 있다. 상태에서, 전자 장치(예: 전자 장치의 프로세서)는 전자 장치 및 외부 객체 사이 의 거리가 지정된 거리 내임을 식별할 수 있다. 전자 장치(예: 전자 장치의 프로세서)는 외부 객체 로부터 제1 데이터 및 제2 데이터를 획득할 수 있다. 예를 들어, 전자 장치(예: 전자 장치의 프로세서)는 제1 통신 회로를 이용하여, NFC를 통해 제1 데이터 및 제2 데이터를 획득할 수 있다. 전자 장치(예: 전자 장치의 프로세서)는 제1 데이터에 기반하여, 제1 화면을 디스플레이 를 통해 표시할 수 있다. 전자 장치(예: 전자 장치의 프로세서)는 제1 화면이 디스플 레이를 통해 표시되는 동안, 제2 화면에 대한 정보를 획득할 수 있다. 전자 장치(예: 전자 장치의 프로세서)는 제1 화면에 중첩으로 제2 화면에 대한 정보가 획득 중임을 나타내는 객 체를 표시할 수 있다. 상태에서, 전자 장치(예: 전자 장치의 프로세서)는 제2 화면에 대한 정보의 획득을 완료할 수 있다. 전자 장치(예: 전자 장치의 프로세서)는 제2 화면에 대한 정보에 기반하여, 디스플레이 를 통해 표시되는 화면을 제1 화면으로부터 제2 화면으로 변경할 수 있다. 전자 장치 (예: 전자 장치의 프로세서)는 외부 객체와 전자 장치 사이의 거리가 지정된 거리 내로 유지 되는 것에 기반하여, 제2 화면의 표시를 유지할 수 있다. 예를 들어, 제2 화면은 제1 화면과 관련될 수 있다. 일 예로, 제1 화면은 제2 화면에 대한 대표 색상을 가질 수 있다. 제1 데이터는 제2 화면에 대한 대표 색상에 대한 ARGB 값을 포함할 수 있다. 전자 장치(예: 전자 장치의 프로세서)는 외부 객체로부터 제2 화면에 대한 대표 컬러에 대한 정보를 포함하는 제1 데이터를 획득할 수 있다. 전자 장치(예: 전자 장치의 프로세서)는 제2 화면에 대한 정보가 획득되는 동안, 제1 데이터에 기반하여, 제1 화면을 표시할 수 있다. 전자 장 치(예: 전자 장치의 프로세서)는 제2 화면을 표시하기 위한 시간 구간 내에서 제1 화면 을 표시할 수 있다. 전자 장치(예: 전자 장치의 프로세서)는 제2 화면을 표시하기 위 한 시간 구간 내에서 제1 화면을 표시함으로써, 향상된 사용자 경험을 제공할 수 있다. 일 실시 예에 따르면, 제2 화면은, 디스플레이를 통해 표시되는 화면의 테마가 변경된 화면일 수 있다. 전자 장치(예: 전자 장치의 프로세서)는 제2 화면을 통해 사용자 인터페이스를 표시할 수 있다. 예를 들어, 사용자 인터페이스는, 아이콘, 위젯, 잠금 화면, 글자체, 글자 색, 홈 화면 및/또는 배경 화면을 포함할 수 있다. 전자 장치(예: 전자 장치의 프로세서)는 외부 객체를 통해 변경된 사용자 인터페이스를 포함 하는 제2 화면을 표시할 수 있다. 전자 장치(예: 전자 장치의 프로세서)는 외부 객체에 저장된 데이터(예: 제1 데이터 및 제2 데이터)에 기반하여 변경된 사용자 인터페이스를 포함하는 제2 화면 을 표시할 수 있다. 도시하지는 않았으나, 도 1 내지 도 24에 관한 상술한 실시 예들이 전자 장치(예: 전자 장치의 프 로세서)를 통해 수행될 수 있음은 물론이다. 일 실시 예에 따르면, 전자 장치(예: 전자 장치)는, 제1 면(surface) 및 상기 제1 면에 반대인 제2 면을 포함하는 제1 하우징(housing)(예: 제1 하우징), 제3 면, 및 상기 제3 면에 반대인 제4 면을 포함하는 제2 하우징(예: 제2 하우징), 상기 제1 하우징, 및 상기 제2 하우징을 회전가능하게(pivotably) 연결하는 폴딩 하우징(예: 폴딩하우징), 상기 제2 면 상에 배치되는 커버 디스플레이(예: 커버 디스플레이), 상기 제1 면 및 상기 제3 면 상에 배치되는 플렉서블 디스플레이(예: 플렉서블 디스플레이), 하나 이상의 통신 회로들(예: 통신 회로), 메모리(예: 메모리), 적어도 하나의 센서(예: 센서), 및 상기 커버 디 스플레이, 상기 플렉서블 디스플레이, 상기 하나 이상의 통신 회로들, 상기 메모리, 및 상기 적어도 하나의 센 서와 작동적으로 연결된 적어도 하나의 프로세서(예: 프로세서)를 포함할 수 있다. 상기 적어도 하나의 프 로세서는, 상기 전자 장치로부터 지정된 거리 내에 위치하는 외부 객체에 기반하여, 제1 데이터 및 제2 데이터 를 획득하도록 설정될 수 있다. 상기 적어도 하나의 프로세서는, 상기 제1 데이터에 기반하여, 상기 커버 디스 플레이를 통해, 제1 화면을 표시하도록 설정될 수 있다. 상기 적어도 하나의 프로세서는, 상기 제1 화면이 상기 커버 디스플레이를 통해 표시되는 동안, 상기 제2 데이터에 기반하여, 제2 화면에 대한 정보를 획득하도록 설정 될 수 있다. 상기 적어도 하나의 프로세서는, 상기 제2 화면에 대한 정보에 기반하여, 상기 커버 디스플레이를 통해 표시되는 화면을 상기 제1 화면으로부터 상기 제2 화면으로 변경하도록 설정될 수 있다. 상기 적어도 하나 의 프로세서는, 상기 외부 객체와 상기 전자 장치 사이의 거리가 상기 지정된 거리 내로 유지되는 것에 기반하 여, 상기 제2 화면의 표시를 유지하도록 설정될 수 있다. 일 실시 예에 따르면, 상기 적어도 하나의 프로세서는, 상기 하나 이상의 통신 회로들 중, 근거리 무선 통신 (near field communication)을 수행하기 위한 제1 통신 회로를 이용하여, 상기 외부 객체로부터 상기 제1 데이 터 및 상기 제2 데이터를 획득하도록 설정될 수 있다. 일 실시 예에 따르면, 상기 적어도 하나의 프로세서는, 상기 하나 이상의 통신 회로들 중, 외부 전자 장치와 통 신을 수행하기 위한 제2 통신 회로를 이용하여, 상기 외부 전자 장치로부터 상기 제2 화면에 대한 상기 정보를 획득하도록 설정될 수 있다. 일 실시 예에 따르면, 상기 적어도 하나의 프로세서는, 상기 제2 화면에 대한 상기 정보를 획득하는 것에 기반 하여, 상기 제2 화면에 대한 상기 정보를 상기 메모리에 저장하도록 설정될 수 있다. 상기 적어도 하나의 프로 세서는, 상기 외부 객체와 상기 전자 장치 사이의 거리가 상기 지정된 거리 밖으로 벗어남을 식별하는 것에 응 답하여, 상기 제2 화면을 표시하는 것을 중단하도록 설정될 수 있다. 상기 적어도 하나의 프로세서는, 상기 제2 화면의 표시가 중단된 뒤 지정된 시간이 경과하는 것에 기반하여, 상기 메모리에 저장된 상기 제2 화면에 대한 상기 정보를 제거하도록 설정될 수 있다. 일 실시 예에 따르면, 상기 적어도 하나의 프로세서는, 상기 제1 데이터 및 상기 제2 데이터를 획득하는 것에 응답하여, 상기 제2 화면에 대한 상기 정보가 상기 메모리에 저장되었는지 여부를 식별하도록 설정될 수 있다. 상기 적어도 하나의 프로세서는, 상기 제2 화면에 대한 상기 정보가 상기 메모리에 저장되었음을 식별하는 것에 기반하여, 상기 커버 디스플레이를 통해 상기 제1 화면을 표시하는 것을 우회하고, 상기 제2 화면을 표시하도록 설정될 수 있다. 상기 적어도 하나의 프로세서는, 상기 제2 화면에 대한 상기 정보가 상기 메모리에 저장되지 않았음을 식별하는 것에 기반하여, 상기 커버 디스플레이를 통해, 상기 제1 화면을 표시하도록 설정될 수 있다. 일 실시 예에 따르면, 상기 적어도 하나의 프로세서는, 상기 제2 화면이 표시되는 동안, 상기 제2 화면에 대한 상기 정보가 변경되었는지 여부를 식별하도록 설정될 수 있다. 상기 적어도 하나의 프로세서는, 상기 제2 화면 에 대한 상기 정보가 변경되지 않았음을 식별하는 것에 기반하여, 상기 제2 화면을 표시하는 것을 유지하도록 설정될 수 있다. 상기 적어도 하나의 프로세서는, 상기 제2 화면에 대한 상기 정보가 변경되었음을 식별하는 것 에 기반하여, 상기 제2 화면과 구별되는 제3 화면을 표시하도록 설정될 수 있다. 일 실시 예에 따르면, 적어도 하나의 센서는, 자이로 센서를 포함할 수 있다. 상기 적어도 하나의 프로세서는, 상기 외부 객체의 타입을 제1 타입 및 제2 타입 중 하나로 식별하도록 설정될 수 있다. 상기 적어도 하나의 프 로세서는, 상기 외부 객체의 타입을 상기 제1 타입으로 식별하는 것에 기반하여, 상기 자이로 센서를 통해 식별 된 상기 전자 장치의 자세가 변경됨에 따라, 상기 제2 화면을 변경하도록 설정될 수 있다. 상기 적어도 하나의 프로세서는, 상기 외부 객체의 타입을 상기 제2 타입으로 식별하는 것에 기반하여, 성가 전자 장치의 자세에 관 계없이, 상기 제2 화면의 표시를 유지하도록 설정될 수 있다. 일 실시 예에 따르면, 상기 적어도 하나의 센서는, 홀 센서를 포함할 수 있다. 상기 적어도 하나의 프로세서는, 상기 제1 하우징 및 상기 제2 하우징 사이의 각도에 기반하여, 상기 전자 장치의 상태를, 상기 홀 센서를 통해, 제1 상태 및 제2 상태 중 하나로 식별하도록 설정될 수 있다. 상기 제1 상태는, 상기 제1 하우징 및 상기 제2 하우징 사이의 각도가 지정된 각도 범위 내인 상태를 포함할 수 있다. 상기 제2 상태는, 상기 제1 하우징 및 상 기 제2 하우징 사이의 각도가 상기 지정된 각도 범위 밖인 상태를 포함할 수 있다. 일 실시 예에 따르면, 상기 적어도 하나의 프로세서는, 상기 외부 객체에 기반하여, 상기 전자 장치의 상태에 따라 상기 제2 화면의 변경 여부를 지시하기 위한 제3 데이터를 획득하도록 설정될 수 있다. 일 실시 예에 따르면, 상기 적어도 하나의 프로세서는, 상기 제2 화면이 표시되는 동안, 상기 전자 장치 의 상태가 상기 제1 상태로부터 상기 제2 상태로 변경됨을 식별하도록 설정될 수 있다. 상기 적어도 하나 의 프로세서는, 제1 값으로 설정된 상기 제3 데이터에 기반하여, 상기 제2 화면의 표시 방향을 변경하도록 설정 될 수 있다. 일 실시 예에 따르면, 상기 적어도 하나의 프로세서는, 제2 값으로 설정된 상기 제3 데이터에 기반하여, 상기 제2 화면의 상기 표시 방향을 유지하도록 설정될 수 있다. 일 실시 예에 따르면, 전자 장치(예: 전자 장치)의 방법은, 상기 전자 장치로부터 지정된 거리 내에 위치 하는 외부 객체에 기반하여, 제1 데이터 및 제2 데이터를 획득하는 동작을 포함할 수 있다. 상기 방법은, 상기 제1 데이터에 기반하여, 상기 전자 장치의 제1 하우징의 일 면 상 배치된 커버 디스플레이(예: 커버 디스플레이 )를 통해, 제1 화면을 표시하는 동작을 포함할 수 있다. 상기 방법은, 상기 제1 화면이 상기 커버 디스플레이를 통해 표시되는 동안, 상기 제2 데이터에 기반하여, 제2 화면에 대한 정보를 획득하는 동작을 포함할 수 있다. 상기 방법은, 상기 제2 화면에 대한 정보에 기반하여, 상기 커버 디스플레이를 통해 표시되는 화면을 상 기 제1 화면으로부터 상기 제2 화면으로 변경하는 동작을 포함할 수 있다. 상기 방법은, 상기 외부 객체와 상기 전자 장치 사이의 거리가 상기 지정된 거리 내로 유지되는 것에 기반하여, 상기 제2 화면의 표시를 유지하는 동 작을 포함할 수 있다. 일 실시 예에 따르면, 상기 방법은, 상기 전자 장치의 하나 이상의 통신 회로들 중, 무선 통신(near field communication)을 수행하기 위한 제1 통신 회로(예: 제1 통신 회로)를 이용하여, 상기 외부 객체로부터 상 기 제1 데이터 및 상기 제2 데이터를 획득하는 동작을 포함할 수 있다. 일 실시 예에 따르면, 상기 방법은, 상기 하나 이상의 통신 회로들 중, 외부 전자 장치와 통신을 수행하기 위한 제2 통신 회로(예: 제2 통신 회로)를 이용하여, 상기 외부 전자 장치로부터 상기 제2 화면에 대한 상기 정 보를 획득하는 동작을 포함할 수 있다. 일 실시 예에 따르면, 상기 방법은, 상기 제2 화면에 대한 상기 정보를 획득하는 것에 기반하여, 상기 제2 화면 에 대한 상기 정보를 상기 전자 장치의 메모리(예: 메모리)에 저장하는 동작을 포함할 수 있다. 상기 방법 은, 상기 외부 객체와 상기 전자 장치 사이의 거리가 상기 지정된 거리 밖으로 벗어남을 식별하는 것에 응답하 여, 상기 제2 화면을 표시하는 것을 중단하는 동작을 포함할 수 있다. 상기 방법은, 상기 제2 화면의 표시가 중 단된 뒤 지정된 시간이 경과하는 것에 기반하여, 상기 메모리에 저장된 상기 제2 화면에 대한 상기 정보를 제거 하는 동작을 포함할 수 있다. 일 실시 예에 따르면, 상기 방법은, 상기 제1 데이터 및 상기 제2 데이터를 획득하는 것에 응답하여, 상기 제2 화면에 대한 상기 정보가 상기 메모리에 저장되었는지 여부를 식별하는 동작을 포함할 수 있다. 상기 방법은, 상기 제2 화면에 대한 상기 정보가 상기 메모리에 저장되었음을 식별하는 것에 기반하여, 상기 커버 디스플레이 를 통해 상기 제1 화면을 표시하는 것을 우회하고, 상기 제2 화면을 표시하는 동작을 포함할 수 있다. 상기 방 법은, 상기 제2 화면에 대한 상기 정보가 상기 메모리에 저장되지 않았음을 식별하는 것에 기반하여, 상기 커버 디스플레이를 통해, 상기 제1 화면을 표시하는 동작을 포함할 수 있다. 일 실시 예에 따르면, 상기 방법은, 상기 제2 화면이 표시되는 동안, 상기 제2 화면에 대한 상기 정보가 변경되 었는지 여부를 식별하는 동작을 포함할 수 있다. 상기 방법은, 상기 제2 화면에 대한 상기 정보가 변경되지 않 았음을 식별하는 것에 기반하여, 상기 제2 화면을 표시하는 것을 유지하는 동작을 포함할 수 있다. 상기 방법은, 상기 제2 화면에 대한 상기 정보가 변경되었음을 식별하는 것에 기반하여, 상기 제2 화면과 구별되는 제3 화면을 표시하는 동작을 포함할 수 있다. 일 실시 예에 따르면, 상기 방법은, 상기 외부 객체의 타입을 제1 타입 및 제2 타입 중 하나로 식별하는 동작을 포함할 수 있다. 상기 방법은, 상기 외부 객체의 타입을 상기 제1 타입으로 식별하는 것에 기반하여, 상기 전자 장치의 자이로 센서를 통해 식별된 상기 전자 장치의 자세가 변경됨에 따라, 상기 제2 화면을 변경하는 동작을 포함할 수 있다. 상기 방법은, 상기 외부 객체의 타입을 상기 제2 타입으로 식별하는 것에 기반하여, 성가 전자 장치의 자세에 관계없이, 상기 제2 화면의 표시를 유지하는 동작을 포함할 수 있다. 일 실시 예에 따르면, 상기 방법은, 상기 외부 객체에 기반하여, 상기 전자 장치의 상기 제1 하우징 및 제2 하 우징 사이의 각도에 따라 식별되는 상기 전자 장치의 상태에 따라, 상기 제2 화면의 변경 여부를 지시하기 위한 제3 데이터를 획득하는 동작을 포함할 수 있다. 일 실시 예에 따르면, 상기 방법은, 상기 제2 화면이 표시되는 동안, 상기 전자 장치의 상태가 상기 제1 상태로 부터 상기 제2 상태로 변경됨을 식별하는 동작을 포함할 수 있다. 상기 방법은, 제1 값으로 설정된 상기 제3 데 이터에 기반하여, 상기 제2 화면의 표시 방향을 변경하는 동작을 포함할 수 있다. 상기 방법은, 제2 값으로 설 정된 상기 제3 데이터에 기반하여, 상기 제2 화면의 표시를 중단하는 동작을 포함할 수 있다. 일 실시 예에 따르면, 전자 장치(예: 전자 장치)는, 디스플레이(예 디스플레이), 하나 이상의 통신 회로들(예: 통신 회로), 메모리(예: 메모리), 적어도 하나의 센서(예: 센서), 및 상기 디스플 레이, 상기 하나 이상의 통신 회로들, 상기 메모리, 및 상기 적어도 하나의 센서와 작동적으로 연결된 적어도 하나의 프로세서(예: 프로세서)를 포함할 수 있다. 상기 적어도 하나의 프로세서는, 상기 전자 장치로부터 지정된 거리 내에 위치하는 외부 객체에 기반하여, 제1 데이터 및 제2 데이터를 획득하도록 설정될 수 있다. 상 기 적어도 하나의 프로세서는, 상기 제1 데이터에 기반하여, 상기 디스플레이를 통해, 제1 화면을 표시하도록설정될 수 있다. 상기 적어도 하나의 프로세서는, 상기 제1 화면이 상기 디스플레이를 통해 표시되는 동안, 상 기 제2 데이터에 기반하여, 제2 화면에 대한 정보를 획득하도록 설정될 수 있다. 상기 적어도 하나의 프로세서 는, 상기 제2 화면에 대한 정보에 기반하여, 상기 디스플레이를 통해 표시되는 화면을 상기 제1 화면으로부터 상기 제2 화면으로 변경하도록 설정될 수 있다. 상기 적어도 하나의 프로세서는, 상기 외부 객체와 상기 전자 장치 사이의 거리가 상기 지정된 거리 내로 유지되는 것에 기반하여, 상기 제2 화면의 표시를 유지하도록 설정 될 수 있다. 일 실시 예에 따르면, 전자 장치(예: 전자 장치)의 방법은, 상기 전자 장치로부터 지정된 거리 내에 위치 하는 외부 객체에 기반하여, 제1 데이터 및 제2 데이터를 획득하는 동작을 포함할 수 있다. 상기 방법은, 상기 제1 데이터에 기반하여, 상기 디스플레이(예: 디스플레이)를 통해, 제1 화면을 표시하는 동작을 포함할 수 있다. 상기 방법은, 상기 제1 화면이 상기 디스플레이를 통해 표시되는 동안, 상기 제2 데이터에 기반하여, 제2 화면에 대한 정보를 획득하는 동작을 포함할 수 있다. 상기 방법은, 상기 제2 화면에 대한 정보에 기반하여, 상기 디스플레이를 통해 표시되는 화면을 상기 제1 화면으로부터 상기 제2 화면으로 변경하는 동작을 포함할 수 있다. 상기 방법은, 상기 외부 객체와 상기 전자 장치 사이의 거리가 상기 지정된 거리 내로 유지되 는 것에 기반하여, 상기 제2 화면의 표시를 유지하는 동작을 포함할 수 있다. 상술한 실시 예들에 따르면, 외부 객체(예: 액세서리, 카드, 및 케이스)가 전자 장치(예: 전자 장치)에 장 착되는 경우, 외부 객체에 관한 제2 화면에 대한 정보가 획득될 수 있다. 제2 화면에 대한 정보를 획득하기 위 한 시간 동안 전자 장치의 사용자는 대기해야 한다. 전자 장치는 제2 화면에 대한 정보가 획득되는 동안, 외부 객체로부터 획득된 제1 데이터에 기반하여, 제1 화면을 표시할 수 있다. 전자 장치는 제1 화면을 표시하고, 제2 화면에 대한 정보가 획득된 뒤, 제1 화면을 제2 화면으로 전환함으로써, 사용자의 체감 대기시간을 감소시킬 수 있다. 상술한 실시 예들에 따르면, 제2 화면에 대한 정보가 메모리에 저장된 경우, 전자 장치는 메모리에 저장된 제2 화면에 대한 정보에 기반하여, 제2 화면을 표시할 수 있다. 전자 장치는 네트워크에 연결되어 있지 않은 경우에 도, 외부 객체에 기반하여, 제2 화면을 표시할 수 있다. 상술한 실시 예들에 따르면, 제1 데이터는 4 bytes로 구성될 수 있다. 외부 객체를 통해 획득되는 데이터는 23 bytes로 설정될 수 있다. 23 bytes 중 8 bytes(또는 7 bytes)가 예약된 필드로 설정될 수 있다. 예약된 필드의 4 bytes가 제1 화면을 출력하기 위한 데이터로 설정될 수 있다. 제1 데이터는 제2 화면의 대표 컬러에 대한 ARGB 값으로 설정될 수 있다. 본 문서에 개시된 일 실시 예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시 예에 따른 전자 장치는 전술한 기기들에 한정 되지 않는다. 본 문서의 일 실시 예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시 예들로 한정 하려는 것이 아니며, 해당 실시 예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제1\", \"제2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위 해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없 이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으 로(예: 유선으로), 무선으로, 또는 제3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 일 실시 예에서, 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부가 될 수 있다. 예를 들면, 일 실시 예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형태 로 구현될 수 있다. 본 문서의 일 실시 예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium) (예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어(예: 프 로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서)는, 저 장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것 은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드 를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형태로 제공될 수 있다. 여기서, '비일시적'은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전자기파)를 포함 하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경우와 임시적으로 저장되는 경우를 구분하지 않는다. 일 실시 예에 따르면, 본 문서에 개시된 일 실시 예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: CD-ROM(compact disc read only memory))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어)를 통해 또는 두 개의 사용자 장치들(예: 스 마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 일 실시 예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수 의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 일 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프 로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 일 실시 예들에 따르면, 모듈, 프로그램 또는 다른 구성요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다.도면 도면1 도면2 도면3a 도면3b 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12a 도면12b 도면13 도면14a 도면14b 도면15 도면16 도면17 도면18 도면19a 도면19b 도면20a 도면20b 도면20c 도면20d 도면20e 도면21 도면22 도면23a 도면23b 도면23c 도면24 도면25a 도면25b 도면26"}
{"patent_id": "10-2023-0094934", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은, 일 실시 예에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 2는 일 실시 예에 따른 전자 장치의 간소화된 블록도의 일 예를 도시한다. 도 3a 및 도 3b는, 일 실시예에 따른 전자 장치의 언폴딩 상태, 및 폴딩 상태 내에서, 제1 하우징 및 제2 하우 징 사이의 위치 관계의 일 예를 도시한다. 도 4는 일 실시 예에 따른 전자 장치와 결합되는 케이스의 예를 도시한다. 도 5는 일 실시 예에 따른 전자 장치의 동작에 관한 흐름도를 도시한다. 도 6은 일 실시 예에 따른 화면을 변경하기 위한 전자 장치의 동작의 예를 도시한다. 도 7은 일 실시 예에 따른 화면을 변경하기 위한 서비스를 제공하기 위한 환경의 예를 도시한다. 도 8은 일 실시 예에 따른 전자 장치의 화면을 구성하기 위한 레이어들의 예를 도시한다. 도 9는 일 실시 예에 따른 외부 객체의 접근 시, 전자 장치의 동작의 예를 도시한다. 도 10는 일 실시 예에 따른 전자 장치의 동작에 관한 흐름도의 예를 도시한다. 도 11은 일 실시 예에 따른 전자 장치의 동작에 관한 흐름도의 예를 도시한다. 도 12a는 일 실시 예에 따른 전자 장치에서 제1 타입의 외부 객체를 통해 제2 화면에 대한 정보가 획득되는 예 를 도시한다. 도 12b는 일 실시 예에 따른 전자 장치에서 제2 타입의 외부 객체를 통해 제2 화면에 대한 정보가 획득되는 예 를 도시한다. 도 13은 일 실시 예에 따른 커버 디스플레이를 통해 표시되는 알림의 예를 도시한다. 도 14a는 일 실시 예에 따른 커버 디스플레이를 통해 표시되는 제1 화면의 예를 도시한다. 도 14b는 일 실시 예에 따른 알림을 나타내는 객체의 표시 여부를 설정하기 위한, 플렉서블 디스플레이에 표시 되는 화면의 예를 도시한다. 도 15는 일 실시 예에 따른 전자 장치의 동작에 관한 흐름도를 도시한다. 도 16은 일 실시 예에 따른 제2 화면의 표시 여부를 설정하기 위한, 플렉서블 디스플레이에 표시되는 화면의 예 를 도시한다. 도 17은 일 실시 예에 따른 전자 장치의 동작에 관한 흐름도를 도시한다. 도 18은 일 실시 예에 따른 제2 화면의 표시 여부를 설정하기 위한, 플렉서블 디스플레이에 표시되는 화면의 예 를 도시한다. 도 19a 및 도 19b는 일 실시 예에 따른 커버 디스플레이를 통해 표시되는 제2 화면의 예를 도시한다. 도 20a 내지 도 20e는 커버 디스플레이에 표시되는 화면에 대한 설정을 변경하기 위한 전자 장치의 동작의 예를 도시한다. 도 21은 일 실시 예에 따른, 외부 객체에 관한 제2 화면을 설정하기 위한 전자 장치의 동작의 예를 도시한다. 도 22는 일 실시 예에 따른, 외부 객체에 따라 변경되는 화면의 예를 도시한다. 도 23a 내지 동작 23c는 일 실시 예에 따른, 전자 장치 및 전자 장치와 연결된 다른 전자 장치의 동작의 예를도시한다. 도 24는 일 실시 예에 따른 전자 장치 및 전자 장치와 연결된 복수의 다른 전자 장치들의 동작의 예를 도시한다. 도 25a 및 도 25b는 일 실시 예에 따른 전자 장치의 동작의 예를 도시한다. 도 26은 일 실시 예에 따른 화면을 변경하기 위한 전자 장치의 동작의 예를 도시한다."}
