{"patent_id": "10-2023-0050751", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0154319", "출원번호": "10-2023-0050751", "발명의 명칭": "디지털 트윈을 바탕으로 콘크리트의 재손상 원인을 규명하기 위한 전자 장치, 및 시스템", "출원인": "강원대학교산학협력단", "발명자": "연재흠"}}
{"patent_id": "10-2023-0050751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "콘크리트 구조물의 내부에 설치된 센서 장치; 및 상기 센서 장치로부터 수신된 센싱 데이터를 바탕으로 상기 콘크리트 구조물의 상태를 모니터링하는 전자 장치;를 포함하는 시스템에 있어서,상기 센서 장치는,온도 센서, 습도 센서, 및 압력 센서 중 적어도 하나를 포함하고,상기 전자 장치는,상기 센서 장치로부터 수신되는 센싱 데이터를 바탕으로, 상기 콘크리트 구조물의 상태가 반영된 상기 콘크리트구조물의 이미지를 제공하는, 시스템."}
{"patent_id": "10-2023-0050751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 센서 장치는,온도 센서, 습도 센서, 및 압력 센서를 포함하고,상기 전자 장치는,상기 센서 장치가 설치된 상태에서, 상기 콘크리트 구조물의 표면의 손상을 알리는 사용자 입력이 수신된 경우,상기 표면의 손상이 발생한 시점으로부터 일정 기간 내에 측정된, 상기 온도 센서, 상기 습도 센서, 및 상기 압력 센서의 센싱 데이터를 바탕으로 상기 손상의 원인을 식별하는, 전자 장치."}
{"patent_id": "10-2023-0050751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 전자 장치는,콘크리트 구조물의 손상을 예측하기 위한 적어도 하나의 인공지능 모델을 포함하고,상기 인공지능 모델은,상기 표면의 손상이 발생한 시점으로부터 일정 기간 내에 측정된, 상기 온도 센서, 상기 습도 센서, 및 상기 압력 센서의 센싱 데이터를 바탕으로, 상기 인공지능 모델을 훈련시키는, 시스템."}
{"patent_id": "10-2023-0050751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 센서 장치는,온도 센서, 습도 센서, 및 압력 센서를 포함하고,상기 전자 장치는,상기 압력 센서의 센싱 값을 실시간으로 모니터링하여 임계 압력 범위를 벗어나는 압력 변화가 식별되면, 손상이 발생한 것으로 판단하고,상기 손상이 발생한 시점으로부터 일정 기간 내에 측정된, 상기 온도 센서의 센싱 값 및 상기 습도 센서의 센싱값을 바탕으로 상기 손상의 원인을 식별하는, 시스템.공개특허 10-2024-0154319-3-청구항 5 제1항에 있어서,상기 시스템은,상기 콘크리트 구조물의 내부를 구성하는 복수의 지점에 각각 설치된 복수의 센서 장치;를 포함하고,상기 전자 장치는,상기 콘크리트 구조물의 상태가 지점 별로 반영된 상기 콘크리트 구조물의 이미지를 제공하는, 시스템."}
{"patent_id": "10-2023-0050751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 전자 장치는,상기 복수의 센서 장치 각각의 압력 센서의 센싱 값을 정상 압력 범위와 비교하여, 상기 복수의 지점 각각의 손상 가능성을 획득하고,상기 획득된 손상 가능성이 지점 별로 시각화 된 상기 콘크리트 구조물의 이미지를 제공하는, 시스템."}
{"patent_id": "10-2023-0050751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 복수의 센서 장치 각각은,상기 콘크리트 구조물의 표면의 손상을 원인으로 하는 상기 복수의 지점 각각의 보수 과정에서 설치된 것이고,상기 전자 장치는,상기 콘크리트 구조물의 손상을 예측하기 위한 적어도 하나의 인공지능 모델을 포함하고,상기 전자 장치는,상기 복수의 센서 장치 각각의 센싱 데이터를 상기 인공지능 모델에 입력하여, 상기 복수의 지점 각각의 손상가능성을 획득하고,상기 복수의 지점 중 상기 손상 가능성이 임계치 이상인 적어도 하나의 위험 지점을 식별하는, 시스템."}
{"patent_id": "10-2023-0050751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 전자 장치는,상기 복수의 센서 장치 각각이 설치된 이후 각 지점에 대해 주기적으로 획득된 상기 손상 가능성을 바탕으로,상기 복수의 지점 각각에 대하여 상기 손상 가능성의 변화 속도를 식별하고,상기 식별된 변화 속도를 바탕으로 상기 복수의 지점 각각의 손상 속도를 산출하는, 시스템."}
{"patent_id": "10-2023-0050751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서,상기 전자 장치는,상기 복수의 지점 간의 거리를 바탕으로 상기 복수의 지점 간의 연관도를 설정하고,상기 전자 장치는,상기 콘크리트 구조물 상에 표면의 손상이 발생한 경우, 상기 복수의 지점 중 상기 표면의 손상이 발생한 위치로부터 가장 가까운 지점을 선택하고,상기 선택된 지점에 설치된 센서 장치의 센싱 데이터를 바탕으로 손상 원인을 식별하는, 시스템.공개특허 10-2024-0154319-4-시스템."}
{"patent_id": "10-2023-0050751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 전자 장치는,상기 선택된 지점에 설치된 센서 장치의 센싱 데이터를 바탕으로 손상 원인이 식별되지 않는 경우, 상기 복수의지점 중 상기 선택된 지점에 대한 연관도가 가장 높은 적어도 하나의 이웃 지점을 식별하고,상기 이웃 지점에 설치된 센서 장치의 센싱 데이터를 바탕으로 손상 원인을 식별하고,상기 전자 장치는,상기 이웃 지점의 센싱 데이터를 바탕으로 손상 원인이 식별되지 않는 경우, 상기 선택된 지점과 상기 이웃 지점 간의 연관도가 감소되도록 변경 설정하는, 시스템."}
{"patent_id": "10-2023-0050751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "전자 장치에 있어서,콘크리트 구조물의 내부에 설치된 센서 장치로부터 센싱 데이터를 수신하는 통신부; 및상기 수신된 센싱 데이터를 바탕으로 상기 콘크리트 구조물의 상태를 모니터링하고, 상기 콘크리트 구조물의 상태를 바탕으로 상기 콘크리트 구조물의 이미지를 제공하는, 프로세서;를 포함하는, 전자 장치."}
{"patent_id": "10-2023-0050751", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "시스템이 개시된다. 본 시스템은, 콘크리트 구조물의 내부에 설치된 센서 장치, 센서 장치로부터 수신된 센싱 데 이터를 바탕으로 콘크리트 구조물의 상태를 모니터링하는 전자 장치를 포함한다. 센서 장치는, 온도 센서, 습도 센서, 및 압력 센서 중 적어도 하나를 포함한다. 전자 장치는, 센서 장치로부터 수신되는 센싱 데이터를 바탕으 로, 콘크리트 구조물의 상태가 반영된 콘크리트 구조물의 이미지를 제공한다."}
{"patent_id": "10-2023-0050751", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 센서 장치와 연결된 전자 장치와 그 시스템에 관한 것으로, 보다 상세하게는, 콘크리트의 내부에 설 치된 센서의 센싱 데이터를 바탕으로 콘크리트의 손상 원인을 식별하는 기술에 관한 것이다."}
{"patent_id": "10-2023-0050751", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "콘크리트 파쇄손상의 대표적인 유형으로는 균열, 스케일링, 스폴링, 패치 열화 등이 있다. 일반적으로 파쇄손상 이 발생하면 보수재를 선정하여 다양한 보수공법으로 부분 단면보수를 진행하지만, 부분 단면보수 부위는 기대 수명에 다다르기 전 조기 재손상이 빈번히 발생한다. 조기 재손상의 원인으로 모재와 보수재의 접착력 약화, 열 팽창계수 차이, 수분 침투, 충격하중 등이 추정되지만 막상 손상이 발생했을 시에 해당 원인 중 어떤 원인으로 인해 손상이 발생했는지 육안으로 판단할 수 없는 것은 물론, 재손상 원인 규명을 위한 시스템도 전혀 없다. 이 에 따라 현재 보수현장에서는 손상 원인 파악 후 적합한 보수재를 선택하여 보수가 진행되는 것이 아니라 주먹 구구식 보수가 진행되기 때문에 재손상이 계속해서 발생하는 악순환을 겪고 있다. 콘크리트 구조물을 실시간으로 모니터링하여 균열이나 파손 등을 판별하는 종래기술은 자가 센싱 콘크리트를 사 용하거나, 콘크리트 내부에 임피던스 신호를 측정하는 압전 소자를 매립하는 등 신호를 통해 손상을 감지하는 것에 초점이 맞춰져 있다(공개 특허 공보 제10-1684428호, 제10-1948850호). 이러한 종래기술을 사용할 시 콘크 리트 손상 발생 전 전조 현상을 감지하거나 실시간 데이터를 통해 손상이 발생했음을 알 수 있겠지만, 손상 발 생의 이유, 즉 결정적 요인에 대한 파악이 불가능하므로 손상 원인을 규명할 방법이 존재하지 않는다."}
{"patent_id": "10-2023-0050751", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 콘크리트의 손상에 따른 보수 과정에서 매설된 센서 장치와 통신을 수행하여 콘크리트 재손상의 원인 을 규명하기 위한 전자 장치를 제공한다. 본 개시는, 콘크리트의 상태를 실시간으로 나타내는 이미지를 제공함으로써 콘크리트의 상태를 모니터링하고 원 인 규명을 지원하는 전자 장치 및 시스템을 제공한다. 본 개시의 목적들은 이상에서 언급한 목적으로 제한되지 않으며, 언급되지 않은 본 개시의 다른 목적 및 장점들 은 하기의 설명에 의해서 이해될 수 있고, 본 개시의 실시 예에 의해 보다 분명하게 이해될 것이다. 또한, 본 개시의 목적 및 장점들은 특허 청구 범위에 나타낸 수단 및 그 조합에 의해 실현될 수 있음을 쉽게 알 수 있을 것이다."}
{"patent_id": "10-2023-0050751", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시 예에 따른 시스템은, 콘크리트 구조물의 내부에 설치된 센서 장치, 상기 센서 장치로부터 수 신된 센싱 데이터를 바탕으로 상기 콘크리트 구조물의 상태를 모니터링하는 전자 장치를 포함한다. 상기 센서 장치는, 온도 센서, 습도 센서, 및 압력 센서 중 적어도 하나를 포함하고, 상기 전자 장치는, 상기 센서 장치로 부터 수신되는 센싱 데이터를 바탕으로, 상기 콘크리트 구조물의 상태가 반영된 상기 콘크리트 구조물의 이미지 를 제공한다. 상기 센서 장치는, 온도 센서, 습도 센서, 및 압력 센서를 포함할 수 있다. 상기 전자 장치는, 상기 센서 장치 가 설치된 상태에서, 상기 콘크리트 구조물의 표면의 손상을 알리는 사용자 입력이 수신된 경우, 상기 표면의 손상이 발생한 시점으로부터 일정 기간 내에 측정된, 상기 온도 센서, 상기 습도 센서, 및 상기 압력 센서의 센 싱 데이터를 바탕으로 상기 손상의 원인을 식별할 수 있다. 이때, 상기 전자 장치는, 콘크리트 구조물의 손상을 예측하기 위한 적어도 하나의 인공지능 모델을 포함하고, 상기 인공지능 모델은, 상기 표면의 손상이 발생한 시점으로부터 일정 기간 내에 측정된, 상기 온도 센서, 상기 습도 센서, 및 상기 압력 센서의 센싱 데이터를 바탕으로, 상기 인공지능 모델을 훈련시킬 수 있다. 상기 센서 장치는, 온도 센서, 습도 센서, 및 압력 센서를 포함하고, 상기 전자 장치는, 상기 압력 센서의 센싱 값을 실시간으로 모니터링하여 임계 압력 범위를 벗어나는 압력 변화가 식별되면, 손상이 발생한 것으로 판단하 고, 상기 손상이 발생한 시점으로부터 일정 기간 내에 측정된, 상기 온도 센서의 센싱 값 및 상기 습도 센서의 센싱 값을 바탕으로 상기 손상의 원인을 식별할 수 있다. 한편, 상기 시스템은, 상기 콘크리트 구조물의 내부를 구성하는 복수의 지점에 각각 설치된 복수의 센서 장치를 포함할 수 있다. 이때, 상기 전자 장치는, 상기 콘크리트 구조물의 상태가 지점 별로 반영된 상기 콘크리트 구 조물의 이미지를 제공할 수 있다. 여기서, 상기 전자 장치는, 상기 복수의 센서 장치 각각의 압력 센서의 센싱 값을 정상 압력 범위와 비교하여, 상기 복수의 지점 각각의 손상 가능성을 획득하고, 상기 획득된 손상 가능성이 지점 별로 시각화 된 상기 콘크 리트 구조물의 이미지를 제공할 수 있다. 이 경우, 상기 복수의 센서 장치 각각은, 상기 콘크리트 구조물의 표면의 손상을 원인으로 하는 상기 복수의 지 점 각각의 보수 과정에서 설치된 것일 수 있다. 이때, 상기 전자 장치는, 상기 콘크리트 구조물의 손상을 예측 하기 위한 적어도 하나의 인공지능 모델을 포함하고, 상기 복수의 센서 장치 각각의 센싱 데이터를 상기 인공지 능 모델에 입력하여, 상기 복수의 지점 각각의 손상 가능성을 획득하고, 상기 복수의 지점 중 상기 손상 가능성 이 임계치 이상인 적어도 하나의 위험 지점을 식별할 수 있다. 여기서, 상기 전자 장치는, 상기 복수의 센서 장치 각각이 설치된 이후 각 지점에 대해 주기적으로 획득된 상기 손상 가능성을 바탕으로, 상기 복수의 지점 각각에 대하여 상기 손상 가능성의 변화 속도를 식별하고, 상기 식 별된 변화 속도를 바탕으로 상기 복수의 지점 각각의 손상 속도를 산출할 수 있다. 또한, 상기 전자 장치는, 상기 복수의 지점 간의 거리를 바탕으로 상기 복수의 지점 간의 연관도를 설정할 수 있다. 여기서, 상기 전자 장치는, 상기 콘크리트 구조물 상에 표면의 손상이 발생한 경우, 상기 복수의 지점 중 상기 표면의 손상이 발생한 위치로부터 가장 가까운 지점을 선택하고, 상기 선택된 지점에 설치된 센서 장치의 센싱 데이터를 바탕으로 손상 원인을 식별할 수 있다. 다만, 상기 선택된 지점에 설치된 센서 장치의 센싱 데이터를 바탕으로 손상 원인이 식별되지 않는 경우, 상기 전자 장치는, 상기 복수의 지점 중 상기 선택된 지점에 대한 연관도가 가장 높은 적어도 하나의 이웃 지점을 식 별하고, 상기 이웃 지점에 설치된 센서 장치의 센싱 데이터를 바탕으로 손상 원인을 식별할 수 있다. 여기서, 상기 이웃 지점의 센싱 데이터를 바탕으로 손상 원인이 식별되지 않는 경우, 상기 전자 장치는, 상기 선택된 지 점과 상기 이웃 지점 간의 연관도가 감소되도록 변경 설정할 수도 있다. 본 개시의 일 실시 예에 따른 전자 장치는, 콘크리트 구조물의 내부에 설치된 센서 장치로부터 센싱 데이터를 수신하는 통신부, 상기 수신된 센싱 데이터를 바탕으로 상기 콘크리트 구조물의 상태를 모니터링하고, 상기 콘크리트 구조물의 상태를 바탕으로 상기 콘크리트 구조물의 이미지를 제공하는, 프로세서를 포함한다."}
{"patent_id": "10-2023-0050751", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시에 따른 시스템은, 콘크리트 구조물의 설치 또는 보수 과정에서 내부에 설치된 센서 장치를 활용하여, 콘크리트 구조물의 상태를 실시간으로 모니터링할 수 있다. 본 개시에 따른 시스템은, 센서 장치와의 무선 통신을 바탕으로 획득된 센싱 데이터를 바탕으로, 콘크리트 구조 물의 손상 가능성, 손상 원인 등을 정밀하게 식별할 수 있다. 본 개시에 따른 시스템은, 실시간으로 모니터링된 센싱 데이터를 바탕으로 변경되는 콘크리트 구조물의 이미지 를 제공할 수 있다."}
{"patent_id": "10-2023-0050751", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시에 대하여 구체적으로 설명하기에 앞서, 본 명세서 및 도면의 기재 방법에 대하여 설명한다. 먼저, 본 명세서 및 청구범위에서 사용되는 용어는 본 개시의 다양한 실시 예들에서의 기능을 고려하여 일반적 인 용어들을 선택하였다. 하지만, 이러한 용어들은 당해 기술 분야에 종사하는 기술자의 의도나 법률적 또는 기 술적 해석 및 새로운 기술의 출현 등에 따라 달라질 수 있다. 또한, 일부 용어는 출원인이 임의로 선정한 용어 도 있다. 이러한 용어에 대해서는 본 명세서에서 정의된 의미로 해석될 수 있으며, 구체적인 용어 정의가 없으 면 본 명세서의 전반적인 내용 및 당해 기술 분야의 통상적인 기술 상식을 토대로 해석될 수도 있다. 또한, 본 명세서에 첨부된 각 도면에 기재된 동일한 참조번호 또는 부호는 실질적으로 동일한 기능을 수행하는 부품 또는 구성요소를 나타낸다. 설명 및 이해의 편의를 위해서 서로 다른 실시 예들에서도 동일한 참조번호 또 는 부호를 사용하여 설명한다. 즉, 복수의 도면에서 동일한 참조 번호를 가지는 구성요소를 모두 도시되어 있다 고 하더라도, 복수의 도면들이 하나의 실시 예를 의미하는 것은 아니다. 또한, 본 명세서 및 청구범위에서는 구성요소들 간의 구별을 위하여 \"제1\", \"제2\" 등과 같이 서수를 포함하는 용어가 사용될 수 있다. 이러한 서수는 동일 또는 유사한 구성요소들을 서로 구별하기 위하여 사용하는 것이며 이러한 서수 사용으로 인하여 용어의 의미가 한정 해석되어서는 안 된다. 일 예로, 이러한 서수와 결합된 구성 요소는 그 숫자에 의해 사용 순서나 배치 순서 등이 제한되어서는 안 된다. 필요에 따라서는, 각 서수들은 서로 교체되어 사용될 수도 있다. 본 명세서에서 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함하다\" 또는 \"구성되다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이 들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 개시의 실시 예에서 \"모듈\", \"유닛\", \"부(part)\" 등과 같은 용어는 적어도 하나의 기능이나 동작을 수행하는 구성요소를 지칭하기 위한 용어이며, 이러한 구성요소는 하드웨어 또는 소프트웨어로 구현되거나 하드웨어 및 소프트웨어의 결합으로 구현될 수 있다. 또한, 복수의 \"모듈\", \"유닛\", \"부(part)\" 등은 각각이 개별적인 특정 한 하드웨어로 구현될 필요가 있는 경우를 제외하고는, 적어도 하나의 모듈이나 칩으로 일체화되어 적어도 하나 의 프로세서로 구현될 수 있다. 또한, 본 개시의 실시 예에서, 어떤 부분이 다른 부분과 연결되어 있다고 할 때, 이는 직접적인 연결뿐 아니라, 다른 매체를 통한 간접적인 연결의 경우도 포함한다. 또한, 어떤 부분이 어떤 구성요소를 포함한다는 의미는, 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것 을 의미한다. 도 1은 본 개시의 일 실시 예에 따라 콘크리트 내부에 매설된 센서 장치와 통신을 수행하는 전자 장치의 동작을 설명하기 위한 도면이다. 도 1을 참조하면, 전자 장치는, 콘크리트 구조물에 매설된 적어도 하나의 센서를 포함하는 센서 장치(20 0)와 통신을 수행할 수 있다. 콘크리트 구조물은, 교량, 도로, 벽, 건물 등 다양한 구조물에 해당할 수 있다. 센서 장치는 콘크리트 구 조물의 내부에 설치될 수 있으며, 콘크리트 구조물의 설치 과정에서 매설된 것일 수도 있고, 콘크리트 구조물의 적어도 일부에 손상이 발생함에 따라 보수가 진행되는 과정에서 매설된 것일 수도 있다. 전자 장치는 적어도 하나의 컴퓨터를 포함하는 장치 내지는 시스템에 해당할 수 있다. 예를 들어, 전자 장 치는 서버 장치에 해당할 수 있고, 또는 데스크탑 PC, 노트북 PC, 태블릿 PC, 스마트폰 등 단말 기기에 해 당할 수도 있다. 전자 장치는 센서 장치와 무선으로 통신을 수행하여 센서 장치의 센싱 데이터를 수신할 수 있다. 센서 장치는 온도 센서, 습도 센서, 및 압력 센서 중 적어도 하나를 포함할 수 있다. 도 2는 본 개시의 일 실시 예에 따른 전자 장치의 동작을 설명하기 위한 흐름도이다. 도 2를 참조하면, 전자 장치는 센서 장치로부터 센싱 데이터를 수신할 수 있다(S210). 이때, 전자 장치는 센서 장치와 직접적으로 통신을 수행할 수도 있지만, 적어도 하나의 중계 장치 (ex. 게이트웨이)를 통해 간접적으로 연결될 수도 있다. 일 예로, LoRa(Long Range Internet of Things), BLE(Bluetooth Low Energy) 등의 방식과 같이 저전력의 무선 통신이 활용될 수 있다. 이 경우, 각각의 센서 장 치는 IoT node에 해당하며, 센서 장치의 센싱 데이터는 IoT 게이트웨이를 거쳐 서버인 전자 장치로 전송될 수 있다. 전자 장치는 수신된 센싱 데이터를 바탕으로 콘크리트 구조물의 상태를 모니터링할 수 있다(S220). 예를 들어, 전자 장치는 센서 장치의 온도 센서, 습도 센서, 압력 센서 등의 센싱 데이터를 바탕으로 콘크 리트 구조물 내부의 온도, 습도(수분), 압력(하중) 등을 실시간으로 모니터링할 수 있다. 그리고, 전자 장치는 모니터링된 콘크리트 구조물의 상태가 반영된 콘크리트 구조물의 이미지를 제공할 수 있다(S230). 예를 들어, 전자 장치는 센서 장치에 의해 측정되는 온도, 습도, 및 압력 각각의 범위에 따라 콘크리 트 구조물을 나타내는 이미지의 적어도 일부의 색상을 변경하여 제공할 수 있다. 구체적으로, 온도, 습도, 압력 각각에 대하여, 정상 범위로부터 멀어질수록 단계 별로 색상이 변경되도록 설정될 수 있다. 그 결과, 사용자는 콘크리트 구조물 내부의 실시간 상태를 확인하는 한편 위험 요소를 선제적으로 인식하거나, 또는 콘크리트 구조 물의 표면에 손상이 발생한 경우 그 원인을 파악할 수 있다. 전자 장치가 서버인 경우, 상술한 이미지는 전자 장치와 연결된 적어도 하나의 디스플레이 장치를 통 해 표시될 수 있다. 반면, 전자 장치가 디스플레이를 포함하는 단말 기기 내지는 컴퓨터 장치인 경우, 전 자 장치의 디스플레이를 통해 상술한 이미지가 표시될 수 있다. 도 3은 본 개시의 일 실시 예에 따른 전자 장치가 손상된 표면에 매칭되는 센서 장치의 센싱 데이터를 바탕으로 손상 원인을 식별하는 동작을 설명하기 위한 도면이다. 도 3은, 센서 장치가 콘크리트 구조물의 내부에 설치된 상태에서 콘크리트 구조물의 표면에 손상이 발생한 상황을 가정한 것이다. 도 3과 같이 콘크리트 구조물의 표면에 손상이 발생한 경우, 콘크리트 구조물의 표면의 손상을 알리는 사용자 입력이 전자 장치로 수신될 수 있다. 이때, 콘크리트 구조물의 표면 중 손상이 발생한 지점이 사용자 입력에 따라 선택될 수 있다. 예를 들어, 전자 장치가 제공하는 콘크리트 구조물의 이미지 중 적어도 일부 영역이 손상 영역으로 선택(ex. 클릭, 터치 등)될 수 있다. 이 경우, 전자 장치는 손상이 발생한 표면 영역으로부터 일정 거리 내에 위치한 적어도 하나의 센서 장치 (ex. 200)를 식별할 수 있다. 이를 위해, 전자 장치의 메모리에는, 콘크리트 구조물 내에 설치된 각 센서 장치의 위치 정보가 기저장되어 있을 수 있다. 여기서, 일정 거리는, 콘크리트 구조물 내에 설치된 센서 장치의 수, 센서 장치 간의 평균 거리에 따라 변경되 는 설정 값일 수 있다. 예를 들어, 콘크리트 구조물 내에 설치된 센서 장치의 수가 많을수록 일정 거리가 짧게 설정될 수 있다. 예를 들어, 센서 장치 간의 평균 거리가 짧을수록 일정 거리 역시 짧게 설정될 수 있다. 다만, 일정 거리는, 센 서 장치 간의 평균 거리보다는 길게 설정될 수 있다. 이렇듯 손상과 관련된 센서 장치가 식별되면, 전자 장치는 표면의 손상이 발생한 시점으로부터 일정 기간 내에 측정된, 센서 장치의 온도 센서, 습도 센서, 및 압력 센서의 센싱 데이터를 바탕으로, 손상의 원인을 식별할 수 있다. 이때, 측정된 온도, 습도, 압력 등이 각각 정상 범위를 벗어났는지 여부, 정상 범위를 벗어난 시간 구간의 길이 등이 식별될 수 있다. 예를 들어, 해당 기간 동안, 온도가 정상 온도 범위를 벗어난 것으로 식별되면, 전자 장치는 손상의 원인 을 비정상적인 온도로 식별할 수 있다. 예를 들어, 해당 기간 동안, 습도가 정상 습도 범위를 벗어난 것으로 식 별되면, 전자 장치는 손상의 원인을 비정상적인 수분 함량(습도)으로 식별할 수 있다. 예를 들어, 해당 기 간 동안, 압력이 정상 압력 범위를 벗어난 것으로 식별되면, 전자 장치는 손상의 원인을 비정상적인 하중 (압력) 또는 장력 등으로 식별할 수 있다. 한편, 도 3과 달리, 전자 장치는 센서 장치의 압력 센서의 센싱 데이터를 바탕으로 손상을 자체적으 로 식별할 수도 있다. 구체적으로, 전자 장치는, 압력 센서의 센싱 값을 실시간으로 모니터링하여 임계 압 력 범위(ex. 정상 압력 범위와 일정 값 이상 차이를 가짐)를 벗어나는 압력 변화가 식별되면, (사용자 입력과 무관하게) 손상이 발생한 것으로 판단할 수 있다. 이 경우, 전자 장치는, 손상이 발생한 시점으로부터 일 정 기간 내에 측정된, 온도 센서의 센싱 값 및 습도 센서의 센싱 값을 바탕으로 손상의 원인을 식별할 수 있다. 한편, 전자 장치는 센서 장치로부터 수신된 센싱 데이터에 따라 온도, 습도, 압력 각각을 정상 온도 범위, 정상 습도 범위, 정상 압력 범위와 비교할 수 있다. 이때, 상술한 정상 범위(ex. 정상 온도 범위, 정상 습도 범 위, 정상 압력 범위)로부터 멀어질수록, 손상 가능성이 더 높게 산출될 수 있다. 또한, 전자 장치는 콘크리트 구조물의 손상을 예측하기 위한 적어도 하나의 인공지능 모델을 포함할 수도 있다. 본 인공지능 모델은, RNN(Recurrent Neural Network) 기반의 신경망 모델일 수 있으나, 이 밖에도 다양한 구조/학습 방법에 따른 인공지능 모델일 수 있다. 본 인공지능 모델은, 온도, 습도, 및 압력 중 적어도 하나에 대한 센싱 데이터를 시간의 흐름에 따라 입력 받을 수 있으며, 이를 바탕으로 콘크리트 구조물의 적어도 일 지점의 손상 가능성 및/또는 (예측되는) 손상 시점을 출력할 수 있다. 본 인공지능 모델은 콘크리트 구조물의 적어도 일부의 손상이 발생한 시점으로부터 일정 기간 내에 측정된, 센서 장치의 센싱 데이터(ex. 온도 센서, 습도 센서, 및 압력 센서)를 바탕으로 훈련될 수 있다. 여기서, 손상이 발생한 시점은, 표면 손상을 확인한 사용자 입력에 따라 식별될 수도 있고, 압력의 센싱 값이 임계 압력 범위를 벗어남에 따라 식별될 수도 있다. 한편, 일 실시 예로, 콘크리트 구조물의 내부를 구성하는 복수의 지점 각각에 복수의 센서 장치가 설치되는 경 우도 가능하다. 일 예로, 복수의 센서 장치 각각은, 콘크리트 구조물의 표면의 손상을 원인으로 하는 상기 복수 의 지점 각각의 보수 과정에서 설치된 것일 수 있다. 즉, 각 센서 장치마다 설치된 위치 뿐 아니라 설치된 시점도 다를 수 있다. 관련하여, 도 4a는 본 개시의 일 실시 예에 따라 복수의 지점 각각에 설치된 복수의 센서 장치(200-1, 2, 3, 4)를 도시한 도면이다. 이 경우, 전자 장치는 각 센서 장치의 센싱 데이터를 수신하여 콘크리트 구조물의 상태를 각 지점 별로 모 니터링할 수 있다. 구체적으로, 전자 장치는 센서 장치가 설치된 각 지점에 따라 콘크리트 구조물의 내부 를 복수의 영역으로 구분하여 모니터링할 수 있다. 이때, 각 센서 장치가 설치된 지점을 중심으로 일정 범위의 영역이 각각 설정될 수 있다. 그리고, 전자 장치는 콘크리트 구조물의 상태가 지점 별(영역 별)로 반영된 콘크리트 구조물의 이미지를 제공할 수 있다. 관련하여, 도 4b는, 도 4a에 설치된 복수의 센서 장치를 바탕으로 복수의 구역으로 구분되어 시각화 된 콘크리 트 구조물의 이미지를 도시한 도면이다. 각 센서 장치(200-1, 2, 3, 4)가 설치된 지점을 바탕으로, 전자 장치는 콘크리트 구조물을 구성하는 복수 의 영역(410-1, 2, 3, 4)을 정의할 수 있으며, 이때 어느 하나의 센서 장치도 설치되지 않은 비감시 영역(410- 5. unmonitored area)도 함께 정의될 수 있다. 이때, 전자 장치는 각 센서 장치로부터 수신되는 센싱 데이터를 바탕으로 각 영역의 컬러 및/또는 밝기가 달라지도록 콘크리트 구조물의 이미지를 변경할 수 있다. 예를 들어, 영역(410-3)의 온도가 가장 높고, 영역들 (410-2, 4)의 온도가 영역(410-3)보다는 낮지만 영역(410-1)보다는 높은 경우를 가정한다. 이 경우, 도 4b와 같 이 영역(410-3)이 가장 진하게 표시될 수 있으며, 온도가 가장 낮고 정상 온도 범위 내에 속하는 영역(410-1)은 가장 연하게 표시될 수 있다. 이때, 영역(410-3)의 손상 가능성이 가장 높은 것으로 식별될 수 있으며, 또는, 이미 영역(410-3)의 표면 상에 손상이 발생한 상황일 수도 있다. 예를 들어, 영역(410-3)의 표면 상에 손상이 발생했음을 알리는 사용자 입력 이 수신될 수 있으며, 전자 장치가 제공하는 이미지를 통해, 해당 영역의 손상의 원인이 온도에 해당하는 것으로 해석될 수 있다. 한편, 센서 장치를 포함하지 않는 비감시 영역에 해당하는 영역(410-5)의 경우, 인접한 영역들(410-2, 3)의 온 도의 중간 값으로 예측될 수 있다. 그 결과, 도 4b에서 중간 정도의 진함으로 표시되었다. 또한, 일 실시 예로, 전자 장치는 복수의 센서 장치 각각의 압력 센서의 센싱 값을 정상 압력 범위와 비교 하여, 복수의 지점 각각의 손상 가능성을 획득할 수 있다. 이때, 전자 장치는 복수의 센서 장치 각각의 센 싱 데이터를 상술한 인공지능 모델에 입력하여, 복수의 지점 각각의 손상 가능성을 획득할 수도 있다. 여기서, 전자 장치는 손상 가능성이 지점 별로 시각화 된 콘크리트 구조물의 이미지를 제공할 수 있다(ex. 도 4b). 그리고, 전자 장치는 복수의 지점 중 손상 가능성이 임계치 이상인 적어도 하나의 위험 지점을 식별할 수 있다. 그리고, 전자 장치는 식별된 위험 지점에 대한 정보 및/또는 위험 지점을 포함하는 위험 영역에 대 한 정보를 제공할 수 있다. 또한, 전자 장치는 복수의 센서 장치 각각이 설치된 이후 각 지점에 대해 주기적으로 획득된 상기 손상 가 능성을 바탕으로, 복수의 지점 각각에 대하여 손상 가능성의 변화 속도를 식별할 수 있다. 이때, 전자 장치 는 식별된 변화 속도를 바탕으로 복수의 지점 각각의 손상 속도를 산출할 수 있으며, 전자 장치는 임 계 속도 이상의 손상 속도를 가지는 적어도 하나의 지점/영역에 대한 정보를 제공할 수 있다. 이 경우, 사용자 는 해당 지점/영역의 설계 구조, 재료, 내지는 보수 과정에 문제가 있는 것으로 파악할 수도 있을 것이다. 또한, 전자 장치의 메모리는, 복수의 센서 장치 각각이 설치된 지점을 포함하는 영역에 대한 보수가 수행 된 보수 횟수에 대한 정보를 포함할 수 있다. 예를 들어, 센서 장치(200-1)가 설치된 지점에 대해서는 1회, 센 서 장치(200-2)가 설치된 지점에 대해서는 2회, 센서 장치(200-3)가 설치된 지점에 대해서는 3회, 센서 장치 (200-4)가 설치된 지점에 대해서는 1회인 경우를 가정한다. 이 경우, 전자 장치는 상술한 손상 속도(damage rate. R)에 보수 횟수(N)에 따른 가중치를 적용하여 임계 속도(threshold rate. Th)와 비교할 수도 있다. 예를 들어, α를 기설정된 상수라고 할 때, Th < R+α(N-1)의 조건을 만족하는 지점이 존재하는 경우, 전자 장치는 해당 지점/영역에 대한 정보를 사용자에게 제공할 수 있다. 이 경우, 사용자는 해당 지점/영역의 설계 구조, 재료, 내지는 보수 과정에 문제가 있는 것으로 파악할수도 있을 것이다. 또한, 일 실시 예로, 전자 장치는 복수의 지점 간의 거리를 바탕으로 복수의 지점 간의 연관도를 설정할 수 있다. 연관도는, 일 지점의 속성(ex. 온도, 습도, 압력)이 다른 일 지점의 손상에 미치는 영향이 어느 정도 인지를 설명하기 위한 개념이다. 주로, 두 지점 간의 연관도가 정의되어 활용될 수 있다. 지점 간의 거리가 가 까울수록, 연관도는 더 커지도록 (초기에) 설정될 수 있다. 관련하여, 일 실시 예로, 콘크리트 구조물 상에 표면의 손상이 발생한 경우, 전자 장치는 복수의 지점 중 표면의 손상이 발생한 위치로부터 가장 가까운 지점을 선택할 수 있다. 이때, 전자 장치는 선택된 지점에 설치된 센서 장치의 센싱 데이터를 바탕으로 손상 원인을 식별할 수 있다. 다만, 선택된 지점에 설치된 센서 장치의 센싱 데이터를 바탕으로 손상 원인이 식별되지 않는 경우(ex. 온도, 압력, 습도 등이 모두 정상 범위 내), 전자 장치는 복수의 지점 중 선택된 지점에 대한 연관도가 가장 높 은 적어도 하나의 이웃 지점을 식별할 수 있다. 이때, 전자 장치는 이웃 지점에 설치된 센서 장치의 센싱 데이터를 바탕으로 손상 원인을 식별할 수 있다. 다만, 이웃 지점의 센싱 데이터를 바탕으로도 손상 원인이 식별되지 않는 경우, 전자 장치는 선택된 지점 과 상기 이웃 지점 간의 연관도가 감소되도록 변경 설정할 수 있다. 한편, 도 5는 본 개시의 일 실시 예에 따른 전자 장치의 구성을 설명하기 위한 블록도이다. 도 5를 참조하면, 전자 장치는 통신부, 프로세서, 메모리를 포함할 수 있다. 통신부는 전자 장치가 다양한 외부 전자 장치와 통신을 수행하기 위한 구성이다. 예를 들어, 전자 장 치는 통신부를 통해 하나 이상의 센서 장치, 게이트웨이 등과 통신을 수행할 수 있다. 전자 장치 가 서버인 경우, 전자 장치는 다양한 사용자의 사용자 단말과 통신을 수행할 수 있으며, 사용자 단말 을 통해 콘크리트 구조물의 상태를 나타내는 이미지를 제공할 수 있다. 통신부는 다양한 유무선 통신방식으로 적어도 하나의 외부 장치와 통신을 수행하기 위한 회로, 모듈, 칩 등을 포함할 수 있다. 통신부는 다양한 네트워크를 통해 외부 장치와 연결될 수 있다. 네트워크는 영역 또는 규모에 따라 개인 통신망(PAN; Personal Area Network), 근거리 통신망(LAN; Local Area Network), 광역 통신망(WAN; Wide Area Network) 등일 수 있으며, 네트워크의 개방성에 따라 인트라넷 (Intranet), 엑스트라넷(Extranet), 또는 인터넷(Internet) 등일 수 있다. 통신부는 LTE(long-term evolution), LTE-A(LTE Advance), 5G(5th Generation) 이동통신, CDMA(code division multiple access), WCDMA(wideband CDMA), UMTS(universal mobile telecommunications system), WiBro(Wireless Broadband), GSM(Global System for Mobile Communications), DMA(Time Division Multiple Access), WiFi(Wi-Fi), WiFi Direct, Bluetooth, BLE(Bluetooth Low Energy), NFC(near field communication), Zigbee, LoRa 등 다양한 무선 통신 방식을 통해 외부 장치들과 연결될 수 있다. 또한, 통신부는 이더넷(Ethernet), 광 네트워크(optical network), USB(Universal Serial Bus), 선더볼트 (ThunderBolt) 등의 유선 통신 방식을 통해 외부 장치들과 연결될 수도 있다. 이 밖에도, 통신부는 향후 새롭게 고안되는 다양한 통신 방식/기술을 활용한 구성일 수 있다. 프로세서는 전자 장치를 전반적으로 제어하기 위한 구성이다. 구체적으로, 프로세서는 메모리 와 연결되는 한편 메모리에 저장된 적어도 하나의 인스트럭션을 실행함으로써 본 개시의 다양한 실시 예들에 따른 동작을 수행할 수 있다. 프로세서는 CPU, AP, DSP(Digital Signal Processor) 등과 같은 범용 프로세서, GPU, VPU(Vision Processing Unit) 등과 같은 그래픽 전용 프로세서 또는 NPU와 같은 인공지능 전용 프로세서 등을 포함할 수 있 다. 인공지능 전용 프로세서는, 특정 인공지능 모델의 훈련 내지는 이용에 특화된 하드웨어 구조로 설계될 수 있다. 메모리는 전자 장치의 구성요소들의 전반적인 동작을 제어하기 위한 운영체제(OS: Operating System) 및 전자 장치의 구성요소와 관련된 적어도 하나의 인스트럭션 또는 데이터를 저장하기 위한 구성이다. 메모리는 ROM, 플래시 메모리 등의 비휘발성 메모리를 포함할 수 있으며, DRAM 등으로 구성된 휘발성 메모 리를 포함할 수 있다. 또한, 메모리는 하드 디스크, SSD(Solid state drive) 등을 포함할 수도 있다.일 실시 예로, 메모리 상에는 콘크리트 구조물의 적어도 일부의 손상을 예측하기 위한 인공지능 모델이 저 장될 수 있다. 또한, 전자 장치는 출력부, 사용자 입력부 등을 더 포함할 수도 있다. 출력부는 다양한 정보를 출력하기 위한 구성으로, 디스플레이, 스피커, 이어폰/헤드셋 단자 등을 포함할 수 있다. 일 실시 예로, 출력부의 디스플레이를 통해, 콘크리트 구조물의 상태를 나타내는 이미지가 표시 될 수 있다. 사용자 입력부는 다양한 명령 또는 정보를 사용자로부터 입력 받기 위한 구성이다. 사용자 입력부는 적어도 하나의 버튼, 터치 패드, 터치 스크린, 마이크, 카메라, 센서 등으로 구현될 수 있다. 또한, 전자 장치 는 적어도 하나의 키패드, 버튼, 모션 센서 등을 구비한 다양한 사용자 입력 장치(ex. 키보드, 마우스 등)와 연결될 수도 있다. 도 6a는 본 개시의 일 실시 예에 따른 센서 장치의 구성을 설명하기 위한 블록도이다. 도 6a를 참조하면, 센서 장치는 센서부 및 통신부를 포함할 수 있다. 센서부는 온도, 습도, 압력 등과 관련된 하나 이상의 센서를 포함할 수 있다. 통신부는 전자 장치, 게이트웨이 등과 통신을 수행하여 센서부의 센싱 데이터를 전자 장치(10 0)로 전송할 수 있다. 관련하여, 도 6b는 본 개시의 일 실시 예에 따른 센서 장치의 상세한 구성을 설명하기 위한 도면이다. 도 6b를 참조하면, 센서 장치는 전원 공급 장치, 전압 증폭 모듈, 무선 통신 모듈, 온/습도 센서, 압력 센서 등을 포함할 수 있다. 일 예로, 온/습도 센서의 측정 부위는 콘크리트 구조물의 내부에, 압력 센서의 측정 부위는 콘크리트 표면에 설 치될 수 있다. 한편, 도 7은 본 개시의 일 실시 예에 따른 전자 장치가 제공하는 콘크리트 구조물의 적어도 일부의 이미지를 상태 별로 도시한 도면이다. 도 7을 참조하면, 전자 장치는 압력, 온도, 습도 순으로 색상이 표현되는 이 미지 모델을 생성할 수 있으며, 사용자는 이를 통해 현장 환경에 따른 센서 데이터의 변화를 색상으로 확인할 수 있다. 한편, 이상에서 설명된 다양한 실시 예들은 서로 저촉되거나 모순되지 않는 한 두 개 이상의 실시 예가 서로 결 합되어 구현될 수 있다. 한편, 이상에서 설명된 다양한 실시 예들은 소프트웨어(software), 하드웨어(hardware) 또는 이들의 조합된 것 을 이용하여 컴퓨터(computer) 또는 이와 유사한 장치로 읽을 수 있는 기록 매체 내에서 구현될 수 있다. 하드웨어적인 구현에 의하면, 본 개시에서 설명되는 실시 예들은 ASICs(Application Specific Integrated Circuits), DSPs(digital signal processors), DSPDs(digital signal processing devices), PLDs(programmable logic devices), FPGAs(field programmable gate arrays), 프로세서(processors), 제어기 (controllers), 마이크로 컨트롤러(micro-controllers), 마이크로 프로세서(microprocessors), 기타 기능 수행 을 위한 전기적인 유닛(unit) 중 적어도 하나를 이용하여 구현될 수 있다. 일부의 경우에 본 명세서에서 설명되는 실시 예들이 프로세서 자체로 구현될 수 있다. 소프트웨어 적인 구현에 의하면, 본 명세서에서 설명되는 절차 및 기능과 같은 실시 예들은 별도의 소프트웨어 모듈들로 구현될 수 있다. 상술한 소프트웨어 모듈들 각각은 본 명세서에서 설명되는 하나 이상의 기능 및 작동을 수행할 수 있다. 한편, 상술한 본 개시의 다양한 실시 예들에 따른 로봇 등 전자 장치에서의 처리동작을 수행하기 위한 컴퓨터 명령어(computer instructions) 또는 컴퓨터 프로그램은 비일시적 컴퓨터 판독 가능 매체(non-transitory computer-readable medium)에 저장될 수 있다. 이러한 비일시적 컴퓨터 판독 가능 매체에 저장된 컴퓨터 명령어 또는 컴퓨터 프로그램은 특정 기기의 프로세서에 의해 실행되었을 때 상술한 다양한 실시 예에 따른 로봇에서의 처리 동작을 상술한 특정 기기가 수행하도록 한다. 비일시적 컴퓨터 판독 가능 매체 란 레지스터, 캐쉬, 메모리 등과 같이 짧은 순간 동안 데이터를 저장하는 매체 가 아니라 반영구적으로 데이터를 저장하며, 기기에 의해 판독(reading)이 가능한 매체를 의미한다. 비일시적 컴퓨터 판독 가능 매체의 구체적인 예로는, CD, DVD, 하드 디스크, 블루레이 디스크, USB, 메모리카드, ROM 등이 있을 수 있다. 이상에서는 본 개시의 바람직한 실시 예에 대하여 도시하고 설명하였지만, 본 개시는 상술한 특정의 실시 예에"}
{"patent_id": "10-2023-0050751", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "한정되지 아니하며, 청구범위에서 청구하는 본 개시의 요지를 벗어남이 없이 당해 개시에 속하는 기술분야에서 통상의 지식을 가진 자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 개시의 기술 적 사상이나 전망으로부터 개별적으로 이해되어서는 안될 것이다."}
{"patent_id": "10-2023-0050751", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시 예에 따라 콘크리트 내부에 매설된 센서 장치와 통신을 수행하는 전자 장치의 동작을 설명하기 위한 도면, 도 2는 본 개시의 일 실시 예에 따른 전자 장치의 동작을 설명하기 위한 흐름도, 도 3은 본 개시의 일 실시 예에 따른 전자 장치가 손상된 표면에 매칭되는 센서 장치의 센싱 데이터를 바탕으로 손상 원인을 식별하는 동작을 설명하기 위한 도면, 도 4a는 본 개시의 일 실시 예에 따라 복수의 지점 각각에 설치된 복수의 센서 장치를 도시한 도면, 도 4b는, 도 4a에 설치된 복수의 센서 장치를 바탕으로 복수의 구역으로 구분되어 시각화 된 콘크리트 구조물의 이미지를 도시한 도면, 도 5는 본 개시의 일 실시 예에 따른 전자 장치의 구성을 설명하기 위한 블록도, 도 6a는 본 개시의 일 실시 예에 따른 센서 장치의 구성을 설명하기 위한 블록도, 도 6b는 본 개시의 일 실시 예에 따른 센서 장치의 상세한 구성을 설명하기 위한 도면, 그리고 도 7은 본 개시의 일 실시 예에 따른 전자 장치가 제공하는 콘크리트 구조물의 적어도 일부의 이미지를 상태 별 로 도시한 도면이다."}
