{"patent_id": "10-2023-0089261", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0176733", "출원번호": "10-2023-0089261", "발명의 명칭": "플렉서블 디스플레이에 형성된 패턴을 이용하여 카메라 및 플렉서블 디스플레이의 위치를 정", "출원인": "삼성전자주식회사", "발명자": "김중형"}}
{"patent_id": "10-2023-0089261", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치(electronic device)(101; 1001)에 있어서,축소 위치(retracted position) 및 연장 위치(extended position) 사이에서 이동 가능하도록 제1 하우징 파트(121)와 맞물리도록(engage with) 구성된 제2 하우징 파트(122)를 포함하는 하우징(120);상기 제1 하우징 파트 및 상기 제2 하우징 파트에 결합된 플렉서블 디스플레이(110), 상기 하우징의 전 면에서보이는 상기 플렉서블 디스플레이의 영역의 사이즈는 상기 하우징이 상기 축소 위치 및 상기 연장 위치 사이에서 이동됨에 따라 변경됨;상기 제1 하우징 파트에 대하여 상기 제2 하우징 파트를 이동하도록 구성된 상기 하우징 내의 액추에이터(220);상기 플렉서블 디스플레이의 활성 영역(active area) 아래에 위치된 상기 하우징 내의 카메라(130); 및상기 하우징 내의 프로세서(210)를 포함하고,상기 활성 영역은,픽셀들의 밀도가 제1 밀도인 제1 영역(111) 및 상기 제1 영역을 감싸고, 상기 밀도가 상기 제1 밀도보다 높은제2 밀도인 제2 영역(112)을 포함하고,상기 카메라가 향하는 상기 플렉서블 디스플레이의 후 면은,상기 제1 영역과 상기 제2 영역 사이의 경계를 따라(along) 배치된 패턴(540, 542, 544)을 포함하고,상기 프로세서는,상기 카메라를 활성화하는 입력에 응답하여, 상기 카메라를 통해 이미지(610)를 획득하고;상기 패턴에 대응하는 시각적 객체(620)가 상기 이미지 내에 포함되는지 여부를 식별하고; 및상기 시각적 객체를 포함하는 상기 이미지에 기반하여, 상기 제1 영역에 대하여 상기 카메라를 정렬하기 위하여상기 액추에이터를 제어하도록, 구성된,전자 장치."}
{"patent_id": "10-2023-0089261", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 상기 프로세서는,상기 액추에이터에 포함된 하나 이상의 모터들의 회전 각도들 및 상기 카메라에 대한 상기 플렉서블 디스플레이의 이동 거리 사이의 관계에 기반하여, 상기 제1 영역에 대하여 상기 카메라를 정렬하기 위하여 상기 하나 이상의 모터들로 송신될, 제어 신호를 획득하도록, 구성된,전자 장치."}
{"patent_id": "10-2023-0089261", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1 내지 청구항 2에 있어서, 상기 하나 이상의 모터들의 상기 회전 각도들 및 상기 이동 거리 사이의 관계를 나타내는 정보를 저장하도록 구성된 메모리(215)를 더 포함하고,상기 프로세서는,상기 제1 영역에 대하여 상기 카메라를 정렬하는 것에 기반하여, 상기 저장된 정보를 변경하도록, 구성된,공개특허 10-2024-0176733-3-전자 장치."}
{"patent_id": "10-2023-0089261", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1 내지 청구항 3에 있어서, 상기 프로세서는,상기 제1 영역에 대하여 상기 카메라를 정렬하기 위하여, 상기 액추에이터로 펄스 수(pulse numbers)에 기반하여 상기 플렉서블 디스플레이의 이동 거리를 나타내는 펄스 신호를 포함하는 상기 제어 신호를, 상기 액추에이터로 송신하도록, 구성된,전자 장치."}
{"patent_id": "10-2023-0089261", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1 내지 청구항 4에 있어서, 상기 프로세서는,상기 액추에이터를 제어하는 것에 기반하여, 상기 카메라가 상기 제1 영역 아래로 이동된 이후, 상기 카메라를이용하여 상기 입력에 대한 응답으로 상기 플렉서블 디스플레이에 표시될 다른 이미지를 획득하도록, 구성된,전자 장치."}
{"patent_id": "10-2023-0089261", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 1 내지 청구항 5에 있어서, 상기 제1 영역은, 상기 전 면을 바라봤을 시, 상기 픽셀들 사이에 위치된 복수의 개구들(4220)을 포함하는 메탈 레이어(410)를 포함하고,상기 제2 영역은, 상기 전 면을 바라봤을 시, 상기 픽셀들 사이에서 발생되는 광의 반사를 줄이기 위한 차광 레이어(520)를 포함하도록, 구성된,전자 장치."}
{"patent_id": "10-2023-0089261", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 1 내지 청구항 6에 있어서, 상기 프로세서는,상기 제1 영역의 상기 복수의 개구들을 통과하여 상기 카메라로 도달된 광을 표현하는 상기 이미지를 획득하도록, 구성된,전자 장치."}
{"patent_id": "10-2023-0089261", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 1 내지 청구항 7에 있어서, 상기 프로세서는,상기 이미지 내 상기 시각적 객체에 기반하여, 상기 전 면을 바라봤을 시, 상기 카메라의 적어도 일부분이 상기제2 영역과 중첩되는 것으로 결정하고;상기 제2 영역과 중첩되는 상기 카메라의 적어도 일부분의 사이즈를 줄이기 위하여, 상기 액추에이터를 제어하도록, 구성된,전자 장치."}
{"patent_id": "10-2023-0089261", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "공개특허 10-2024-0176733-4-전자 장치의 방법에 있어서,상기 전자 장치의 플렉서블 디스플레이의 활성 영역 아래에 위치된 상기 전자 장치의 카메라를 활성화하는 입력에 응답하여, 상기 카메라를 통해 이미지를 획득하는 동작(310);상기 카메라가 향하는 상기 플렉서블 디스플레이의 후 면에 형성된 패턴에 대응하는 시각적 객체가 상기 이미지내에 포함되는지 여부를 식별하는 동작(320);상기 시각적 객체를 포함하는 상기 이미지에 기반하여, 상기 플렉서블 디스플레이에 대하여 상기 카메라를 정렬하기 위하여 상기 액추에이터를 제어하는 동작(340)을 포함하는,방법."}
{"patent_id": "10-2023-0089261", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 9에 있어서, 상기 제어하는 동작은,상기 액추에이터에 포함된 하나 이상의 모터들의 회전 각도들 및 상기 카메라에 대한 상기 플렉서블 디스플레이의 이동 거리 사이의 관계에 기반하여, 상기 플렉서블 디스플레이에 대하여 상기 카메라를 정렬하기 위하여 상기 하나 이상의 모터들로 송신될, 제어 신호를 획득하는 동작을 포함하는,방법."}
{"patent_id": "10-2023-0089261", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 9 내지 청구항 10에 있어서, 상기 제어하는 동작은,상기 플렉서블 디스플레이에 대하여 상기 카메라를 정렬하는 것에 기반하여, 상기 관계를 나타내는 정보를 변경하는 동작을 포함하는,방법."}
{"patent_id": "10-2023-0089261", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 9 내지 청구항 11에 있어서, 상기 제어하는 동작은,상기 카메라를 정렬하기 위하여, 상기 액추에이터로 펄스 수에 기반하여 상기 플렉서블 디스플레이의 이동 거리를 나타내는 펄스 신호를 포함하는 제어 신호를 송신하는 동작을 포함하는,방법."}
{"patent_id": "10-2023-0089261", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 9 내지 청구항 12에 있어서,상기 액추에이터를 제어하는 것에 기반하여, 상기 카메라가 상기 제1 영역 아래로 이동된 이후, 상기 카메라를이용하여 상기 입력에 대한 응답으로 상기 플렉서블 디스플레이에 표시될 다른 이미지를 획득하는 동작을 더 포함하는,방법."}
{"patent_id": "10-2023-0089261", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 9 내지 청구항 13에 있어서,공개특허 10-2024-0176733-5-상기 카메라가 향하는 상기 플렉서블 디스플레이의 상기 후 면에서, 상기 플렉서블 디스플레이의 픽셀들의 밀도에 의해 구분되는 상기 플렉서블 디스플레이의 제1 영역 및 제2 영역 사이의 경계를 따라 배치된 패턴을 포함하는,방법."}
{"patent_id": "10-2023-0089261", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "청구항 9 내지 청구항 14에 있어서, 상기 식별하는 동작은,상기 이미지 내 상기 시각적 객체에 기반하여, 상기 플렉서블 디스플레이의 전 면을 바라봤을 시, 상기 카메라의 적어도 일부분이 상기 제2 영역과 중첩되는 것으로 결정하는 동작을 포함하고,상기 제어하는 동작은,상기 제2 영역과 중첩되는 상기 카메라의 적어도 일부분의 사이즈를 줄이기 위하여, 상기 액추에이터를 제어하는 동작을 포함하는,방법."}
{"patent_id": "10-2023-0089261", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "전자 장치(electronic device)(101; 1001)에 있어서,하우징(120);상기 하우징의 일 면을 통해 적어도 부분적으로 외부로 노출된 플렉서블 디스플레이(110);상기 플렉서블 디스플레이의 일 면을 향하도록 위치된, 상기 하우징 내의 카메라(130);상기 카메라에 대한 상기 플렉서블 디스플레이의 위치를 조절하기 위한 액추에이터(220); 및프로세서(210)를 포함하고,상기 프로세서는,상기 카메라를 이용하여 이미지(610)를 획득하고;픽셀들의 밀도에 의해 구분되는 상기 플렉서블 디스플레이의 제1 영역(111) 및 제2 영역(112)의 경계와 관련된시각적 객체(620)가 상기 이미지 내에 포함되는지 여부를 식별하고; 및상기 시각적 객체를 포함하는 상기 이미지에 기반하여, 상기 위치를 조절하기 위하여 상기 액추에이터를 제어하도록, 구성된,전자 장치."}
{"patent_id": "10-2023-0089261", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "청구항 16에 있어서, 상기 플렉서블 디스플레이는,상기 카메라가 향하는 상기 플렉서블 디스플레이의 일 면에서, 상기 제1 영역 및 상기 제2 영역의 상기 경계를따라 형성된, 패턴을 포함하도록, 구성된,전자 장치."}
{"patent_id": "10-2023-0089261", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "청구항 16 내지 청구항 17에 있어서, 상기 프로세서는,공개특허 10-2024-0176733-6-상기 패턴의 적어도 일부분에 대응하는 상기 시각적 객체를 식별하는 것에 기반하여, 상기 이미지 내 상기 시각적 객체의 위치를 이용하여 상기 액추에이터를 제어하도록, 구성된,전자 장치."}
{"patent_id": "10-2023-0089261", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "청구항 16 내지 청구항 18에 있어서, 상기 플렉서블 디스플레이는,제1 밀도에 기반하여 위치된 픽셀들을 포함하는 상기 제1 영역 및 상기 제1 밀도를 초과하는 제2 밀도에 기반하여 위치된 픽셀들을 포함하는 상기 제2 영역을 포함하도록, 구성된,전자 장치."}
{"patent_id": "10-2023-0089261", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "청구항 16 내지 청구항 19에 있어서, 상기 프로세서는,상기 제1 영역 및 상기 제2 영역 중에서 상기 제1 영역 아래로 상기 카메라를 이동하기 위하여, 상기 액추에이터를 제어하도록, 구성된,전자 장치."}
{"patent_id": "10-2023-0089261", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "내지 청구항 23에 있어서, 상기 제어하는 동작은,제1 밀도에 기반하여 위치된 픽셀들을 포함하는 상기 제1 영역 및 상기 제1 밀도를 초과하는 제2 밀도에 기반하여 위치된 픽셀들을 포함하는 상기 제2 영역 중에서, 상기 제1 영역 아래로 상기 카메라를 이동하기 위하여, 상기 액추에이터를 제어하는 동작을 포함하는,방법."}
{"patent_id": "10-2023-0089261", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "청구항 21에 있어서, 상기 식별하는 동작은,상기 카메라가 향하는 상기 플렉서블 디스플레이의 상기 일 면에 형성되고, 상기 제1 영역 및 상기 제2 영역의경계를 따라 형성된, 패턴에 대응하는 시각적 객체를 식별하는 동작을 포함하는,방법."}
{"patent_id": "10-2023-0089261", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "청구항 21 내지 청구항 22에 있어서, 상기 제어하는 동작은,상기 패턴의 적어도 일부분에 대응하는 상기 시각적 객체를 식별하는 것에 기반하여, 상기 이미지 내 상기 시각적 객체의 위치를 이용하여 상기 액추에이터를 제어하는 동작을 포함하는,방법.공개특허 10-2024-0176733-7-청구항 24"}
{"patent_id": "10-2023-0089261", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "일 실시예에 따른, 전자 장치는, 카메라, 플렉서블 디스플레이 및 프로세서를 포함할 수 있다. 카메라가 향하는 플렉서블 디스플레이의 후 면은, 플렉서블 디스플레이의 활성 영역의 제1 영역 및 제2 영역 사이의 경계를 따라 배치된 패턴을 포함할 수 있다. 전자 장치의 프로세서는, 카메라를 활성화하는 입력에 응답하여, 카메라를 통해 이미지를 획득할 수 있다. 프로세서는, 상기 패턴에 대응하는 시각적 객체가 상기 이미지 내에 포함되는지 여부 를 식별할 수 있다. 프로세서는, 상기 시각적 객체를 포함하는 상기 이미지에 기반하여, 상기 제1 영역에 대하 여 상기 카메라를 정렬하기 위하여 상기 액추에이터를 제어할 수 있다."}
{"patent_id": "10-2023-0089261", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시(present disclosure)는 플렉서블 디스플레이에 형성된 패턴을 이용하여 카메라 및 플렉서블 디스플레이 의 위치를 정렬하기 위한 웨어러블 장치 및 그 방법에 관한 것이다."}
{"patent_id": "10-2023-0089261", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전자 장치의 형태 및/또는 사이즈가 다양화되고 있다. 이동성을 강화하기 위하여, 감소된 사이즈 및/또는 감소 된 부피를 가지는 전자 장치가 설계되고 있다. 전자 장치는 정보를 시각화하기 위한 디스플레이를 포함할 수 있다. 전자 장치에 의해 지원되는 기능들의 수가 증가될수록, 사용자에게 보다 많은 정보를 시각화하기 위하여, 및/또는 상기 기능들의 실행을 지원하기 위하여, 디스플레이의 사이즈가 증가될 수 있다. 예를 들어, 전자 장치의 사이즈 및/또는 부피는 줄이면서, 디스플레이의 사이즈는 유지되거나, 또는 증가되도록, 설계될 수 있다."}
{"patent_id": "10-2023-0089261", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시예(an embodiment)에 따른, 전자 장치(electronic device)는, 축소 위치 및 연장 위치 사이에서 이동 가능하도록 제1 하우징 파트와 맞물리도록 구성된 제2 하우징 파트를 포함하는 하우징 및 상기 제1 하우징 파트 및 상기 제2 하우징 파트에 결합된 플렉서블 디스플레이를 포함할 수 있다. 상기 하우징의 전 면에서 보이는 상기 플렉서블 디스플레이의 영역의 사이즈는 상기 하우징이 상기 축소 위치 및 상기 연장 위치 사이에서 이동 됨에 따라 변경될 수 있다. 상기 전자 장치는 상기 제1 하우징 파트에 대하여 상기 제2 하우징 파트를 이동하 도록 구성된 상기 하우징 내의 액추에이터, 및 상기 플렉서블 디스플레이의 활성 영역(active area) 아래에 위 치된 상기 하우징 내의 카메라 및 상기 하우징 내의 프로세서를 포함할 수 있다. 상기 활성 영역은, 서브 픽셀 들의 밀도가 제1 밀도인 제1 영역 및 상기 제1 영역을 감싸고, 상기 밀도가 상기 제1 밀도보다 높은 제2 밀도인 제2 영역을 포함할 수 있다. 상기 카메라가 향하는 상기 플렉서블 디스플레이의 후 면은, 상기 제1 영역과 상 기 제2 영역 사이의 경계를 따라 배치된 패턴을 포함할 수 있다. 상기 프로세서는, 상기 카메라를 활성화하는 입력에 응답하여, 상기 카메라를 통해 이미지를 획득하도록, 구성될 수 있다. 상기 프로세서는 상기 패턴에 대 응하는 시각적 객체가 상기 이미지 내에 포함되는지 여부를 식별하도록, 구성될 수 있다. 상기 프로세서는 상 기 시각적 객체를 포함하는 상기 이미지에 기반하여, 상기 제1 영역에 대하여 상기 카메라를 정렬하기 위하여 상기 액추에이터를 제어하도록, 구성될 수 있다. 일 실시예에 따른, 전자 장치의 방법은, 상기 전자 장치의 플렉서블 디스플레이의 활성 영역 아래에 위치된 상 기 전자 장치의 카메라를 활성화하는 입력에 응답하여, 상기 카메라를 통해 이미지를 획득하는 동작을 포함할 수 있다. 상기 방법은, 상기 카메라가 향하는 상기 플렉서블 디스플레이의 후 면에 형성된 패턴에 대응하는 시 각적 객체가 상기 이미지 내에 포함되는지 여부를 식별하는 동작을 포함할 수 있다. 상기 방법은, 상기 시각적 객체를 포함하는 상기 이미지에 기반하여, 상기 플렉서블 디스플레이에 대하여 상기 카메라를 정렬하기 위하여 상기 액추에이터를 제어하는 동작을 포함할 수 있다. 일 실시예에 따른, 전자 장치는, 하우징, 상기 하우징의 일 면을 통해 적어도 부분적으로 외부로 노출된 플렉서 블 디스플레이, 상기 플렉서블 디스플레이의 일 면을 향하도록 위치된, 상기 하우징 내의 카메라, 상기 카메라 에 대한 상기 플렉서블 디스플레이의 위치를 조절하기 위한 액추에이터 및 프로세서를 포함할 수 있다. 상기 프로세서는, 상기 카메라를 이용하여 이미지를 획득하도록, 구성될 수 있다. 상기 프로세서는, 픽셀들의 밀도 에 의해 구분되는 상기 플렉서블 디스플레이의 제1 영역 및 제2 영역의 경계와 관련된 시각적 객체가 상기 이미 지 내에 포함되는지 여부를 식별하도록, 구성될 수 있다. 상기 프로세서는 상기 시각적 객체를 포함하는 상기 이미지에 기반하여, 상기 위치를 조절하기 위하여 상기 액추에이터를 제어하도록, 구성될 수 있다. 일 실시예에 따른, 전자 장치의 방법은, 상기 전자 장치의 플렉서블 디스플레이의 일 면을 향하도록 위치된 카 메라를 이용하여 이미지를 획득하는 동작을 포함할 수 있다. 상기 방법은, 픽셀들의 밀도에 의해 구분되는 상 기 플렉서블 디스플레이의 제1 영역 및 제2 영역의 경계와 관련된 시각적 객체가 상기 이미지 내에 포함되는지 여부를 식별하는 동작을 포함할 수 있다. 상기 방법은, 상기 시각적 객체를 포함하는 상기 이미지에 기반하여, 상기 위치를 조절하기 위하여 상기 액추에이터를 제어하는 동작을 포함할 수 있다."}
{"patent_id": "10-2023-0089261", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 문서의 다양한 실시예들이 첨부된 도면을 참조하여 설명된다. 본 문서의 다양한 실시 예들 및 이에 사용된 용어들은 본 문서에 기재된 기술을 특정한 실시 형태에 대해 한정 하려는 것이 아니며, 해당 실시 예의 다양한 변경, 균등물, 및/또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 단수의 표현 은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및/ 또는 B 중 적어도 하나\", \"A, B 또는 C\" 또는 \"A, B 및/또는 C 중 적어도 하나\" 등의 표현은 함께 나열된 항목 들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", \"첫째\" 또는 \"둘째\" 등의 표현들은 해당 구성요소들 을, 순서 또는 중요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해 당 구성요소들을 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에 \"(기능적으로 또는 통신적으로) 연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 상기 어떤 구성요소가 상기 다른 구성요소 에 직접적으로 연결되거나, 다른 구성요소(예: 제 3 구성요소)를 통하여 연결될 수 있다. 본 문서에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구성된 유닛을 포함하며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로 등의 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는 최소 단위 또는 그 일부가 될 수 있다. 예를 들면, 모듈은 ASIC(application-specific integrated circuit)으로 구성될 수 있다. 도 1a 내지 도 1e는, 플렉서블 디스플레이 및 카메라를 포함하는 전자 장치의 일 실시예를 도시 한다. 일 실시예에서, 사용자에 의해 소유되는 관점에서(in terms of), 전자 장치는 단말(또는 사용자 단 말)로 지칭될(referred as) 수 있다. 단말은, 예를 들어, 랩톱 및 데스크톱과 같은 개인용 컴퓨터(personal computer, PC)를 포함할 수 있다. 단말은, 예를 들어, 스마트폰(smartphone), 스마트패드(smartpad), 및/또는 태블릿 PC를 포함할 수 있다. 단말은, 스마트워치(smartwatch) 및/또는 HMD(head-mounted device)와 같은 스 마트액세서리를 포함할 수 있다. 일 실시예에 따른, 전자 장치의 하우징은, 전자 장치에 포함 된 하나 이상의 하드웨어들(예, 도 2를 참고하여 상술된 하나 이상의 하드웨어들)이 배치되는 내부 공간을 포함 할 수 있다. 상기 하우징은, 전자 장치의 외형을 형성할 수 있다. 일 실시예에 따른, 전자 장치는 변형 가능한(deformable) 폼 팩터(form factor)를 가질 수 있다. 전자 장치가 변형되는 것은, 전자 장치의 너비, 높이 및/또는 두께와 같은 크기들(dimensions) 중 적어도 하나가 변경되는 것을 의미할 수 있다. 상기 크기들 중 적어도 하나는, 전자 장치에 적용되는(applied) 외력(external force)에 의해 수동적으로 변경되거나, 및/또는 전자 장치에 포함된 하나 이상의 액추에이 터들(예, 도 2의 액추에이터)에 의해 능동적으로 변경될 수 있다. 일 실시예에서, 전자 장치의 변형 가능성(deformability)을 지원하기 위하여, 전자 장치의 하우징 은, 상호 연결된(interconnected) 제1 하우징 파트, 및 제2 하우징 파트으로 구분될 수 있다. 일 실시예에 따른, 전자 장치는, 액추에이터를 이용하여 제1 하우징 파트, 및 제2 하우징 파트 의 위치 관계를 조절하여, 플렉서블 디스플레이, 및/또는 전자 장치의 형태를 변경할 수 있다. 도 1a 내지 도 1e를 참고하면, 전자 장치의 플렉서블 디스플레이는, 제1 하우징 파트의 일 면, 및 제2 하우징 파트의 일 면을 가로질러 배치될 수 있다. 플렉서블 디스플레이가 배치되고, 제1 하우징 파트, 및 제2 하우징 파트에 의해 형성된 일 면이, 전자 장치의 전 면(front surface)으로 지 칭될 수 있다. 도 1a 내지 도 1e를 참고하면, x-y 평면과 평행한 전자 장치의 전 면이 도시된다. 일 실 시예에 따른, 전자 장치가 플렉서블 디스플레이의 형태를 변경하는 것은, 플렉서블 디스플레이 내에서 외부로 노출되는(또는 하우징의 전 면에서 보이는) 적어도 일부분의 폭, 너비, 및/또는 면적 (extent) 중 적어도 하나를 변경하는 동작을 포함할 수 있다. 도 1a 내지 도 1e를 참고하면, 제2 하우징 파트가 제1 하우징 파트에 대해 슬라이딩 가능(slidable) 하게 결합되는 일 실시예가 도시된다. 예를 들어, 전자 장치의 하우징은, 제1 하우징 파트 및 축소 위치(retracted position) 및 연장 위치(extended position) 사이에서 이동 가능하도록 제1 하우징 파트 와 맞물리도록(engage with) 구성된 제2 하우징 파트를 포함할 수 있다. 플렉서블 디스플레이 는 상기 제1 하우징 파트 및 상기 제2 하우징 파트에 결합될 수 있다. 하우징의 전 면에서 보 이는 플렉서블 디스플레이의 영역의 사이즈는, 상기 하우징이 상기 축소 위치 및 상기 연장 위치 사 이에서 이동됨에 따라 변경될 수 있다. 일 실시예에서, 전자 장치의 플렉서블 디스플레이는, 전자 장치의 변형에 기반하여, 제1 하우징 파트 및/또는 제2 하우징 파트 안으로 인입 가능하거나(insertable), 제1 하우징 파트 및/또는 제2 하우징 파트로부터 인출 가능(extractable)할 수 있다. 플렉서블 디스플레이가 제1 하우징 파트 및/또는 제2 하우징 파트 안으로 인입되는 경우, 플렉서블 디스플레이가 외부로 노출되는 영역 의 크기가 줄어들 수 있다. 플렉서블 디스플레이가 제1 하우징 파트 및/또는 제2 하우징 파트 로부터 인출되는 경우, 플렉서블 디스플레이가 외부로 노출되는 영역의 크기가 증가될 수 있다. 이하에서, 플렉서블 디스플레이의 표시 영역(a displaying area)은, 플렉서블 디스플레이에 포함된 픽셀들 중에서, 플렉서블 디스플레이가 외부로 노출된 영역 상에 배치된 픽셀들에 의해 형성된 영역을 의 미할 수 있다. 예를 들어, 상기 표시 영역은 플렉서블 디스플레이의 활성 영역(an active area)으로 지칭 될 수 있다. 예를 들어, 하우징의 상기 전 면에서 보이는 플렉서블 디스플레이의 영역이, 활성 영역 (active area)으로 지칭될 수 있다. 예를 들어, 플렉서블 디스플레이의 활성 영역은, 플렉서블 디스플레 이에 포함된 픽셀들 중에서, 활성 상태의 픽셀들에 의해 구분되는 플렉서블 디스플레이의 적어도 일 부분에 대응할 수 있다. 도 1a 내지 도 1c를 참고하면, 전자 장치, 및/또는 플렉서블 디스플레이의 상이한 상태들(191, 192, 193)이 도시된다. 일 실시예에 따른, 전자 장치는, 액추에이터(예, 도 2의 액추에이터)를 이용하여 상태들(191, 192, 193) 사이를 스위칭할 수 있다. 일 실시예에서, 전자 장치의 상태들(191, 192,193)은, 전자 장치, 및/또는 플렉서블 디스플레이의 크기들(예, 너비, 높이, 두께, 및/또는 종횡 비 (an aspect ratio))에 따라 구분될 수 있다(may distinguished). 상태들(191, 192, 193)은, 전자 장치의 제1 하우징 파트, 및 제2 하우징 파트 사이의 거리에 따라 구분될 수 있다. 예를 들어, 제1 하우징 파트, 및 제2 하우징 파트 사이의 거리는, 제1 하우징 파트의 일 면(예, 제1 하우징 파트 의 좌측 면), 및 상기 제1 하우징 파트의 일 면과 평행하고, 상기 제1 하우징 파트의 상기 일 면으로 부터 이격된 제2 하우징 파트의 타 면(예, 제2 하우징 파트의 우측 면) 사이의 거리일 수 있다. 도 1a 및 도 1c의 상태들(191, 193)은, 전자 장치가 변형됨에 따라, 전자 장치의 표면적, 및/또는 플 렉서블 디스플레이의 활성 영역의 면적이 최소가 되는 상태일 수 있다. 이하에서, 상태들(191, 193)과 같 이, 전자 장치의 표면적, 및/또는 상기 활성 영역의 면적이 최소가 되는 상태가, 슬라이드-인 상태(slide- in state), 감김 상태(rolled state), 닫힌 상태(closed state), 롤-인 상태(roll-in state), 및/또는 수축 상 태로 참조될 수 있다. 도 1a를 참고하면, 롤-인 상태에 포함된 예시적인 상태 내에서, 플렉서블 디스플레이의 제1 영역 (110-1)이 외부로 노출되고, 제2 영역(110-2)이 하우징 내에 인입될 수 있다. 도 1c를 참고하면, 롤-인 상태에 포함된 예시적인 상태 내에서, 플렉서블 디스플레이의 제2 영역(110-2)이 외부로 노출되고, 제1 영역(110-1)이 하우징 내에 인입될 수 있다. 예를 들어, 전자 장치는 양 방향들(+x 축의 방향 및/또는 -x 축의 방향) 중 어느 한 방향을 따라 플렉서블 디스플레이를 이동할 수 있다. 전자 장치 는 상기 양 방향들 중 어느 한 방향을 따라 이동되는 플렉서블 디스플레이의 적어도 일부분(예, 제1 영역 (110-1) 및/또는 제2 영역(110-2))을 수용하기 위한 구조를 가질 수 있다. 제1 영역(110-1) 및 제2 영역(110- 2)은, 플렉서블 디스플레이 내에서 서로 이격된 상이한 영역들이거나, 또는 적어도 부분적으로 중첩될 수 있다. 도 1a 및/또는 도 1c의 상태들(191, 193) 내에서, 제1 하우징 파트 및 제2 하우징 파트는 축 소 위치에 기반하여 위치될 수 있다. 도 1b의 상태는, 전자 장치가 변형됨에 따라, 전자 장치의 표면적, 및/또는 플렉서블 디스플레 이의 활성 영역의 면적이 최대가 되는 상태일 수 있다. 이하에서, 상태와 같이, 전자 장치의 표면적, 및/또는 상기 활성 영역의 면적이 최대가 되는 상태가, 슬라이드-아웃 상태(slide-out state), 펼침 상 태(unrolled state), 개방 상태(opened state), 롤-아웃 상태(roll-out state) 및/또는 확장 상태로 참조될 수 있다. 일 실시예에서, 전자 장치의 상태는, 활성 영역의 면적이 최소인 상태(예, 도 1a 및/또는 도 1c의 상태들(191, 193)), 및 활성 영역의 면적이 최대인 상태(예, 도 1b의 상태) 사이의 다른 상태를 더 포함할 수 있다. 상기 다른 상태는, 중간 상태(intermediate state), 서브 감김 상태(sub-rolled state), 서브 개방 상태(sub-opened state)로 참조될 수 있다. 도 1b의 상태 내에서, 제1 하우징 파트 및 제2 하우징 파트는 연장 위치에 기반하여 위치될 수 있다. 도 1a 내지 도 1c를 참고하면, 일 실시예에 따른, 전자 장치의 플렉서블 디스플레이는 직사각형의 형 태를 가질 수 있다. 일 실시예에서, 디스플레이의 모서리들(corners)은, 곡선 모서리(rounded corner)의 형태를 가질 수 있다. 이하에서는, 직사각형인 플렉서블 디스플레이의 경계인 변들 중에서, 상대적으로 긴 변과 평행한 제1 방향이 높이 방향(height direction)으로, 상기 상대적으로 긴 변이 높이(height)로 참조될 수 있다. 이하에서는, 직사각형인 디스플레이의 경계인 변들 중에서, 상대적으로 짧은 변과 평행한 제2 방향이 너비 방향(width direction)으로, 상기 상대적으로 짧은 변이 너비(width)로 참조될 수 있다. 도 1a 내지 도 1c를 참고하면, 플렉서블 디스플레이의 너비 방향, 또는 높이 방향 중에서, 너비 방향을 따 라 연장되거나, 또는 축소되는 전자 장치의 일 실시예가 도시된다. 실시예가 이에 제한되는 것은 아니며, 전자 장치는 플렉서블 디스플레이의 높이 방향을 따라 연장되거나, 또는 축소될 수 있다. 도 1a의 상태로부터 도 1b의 상태로 스위칭되는 동안, 전자 장치는 제1 하우징 파트에 대하여 제2 하우징 파트를 이동하여(예, 제1 하우징 파트에 대하여 제2 하우징 파트를 인출하여), 플렉서블 디스플레이의 제2 영역(110-2)을 인출할 수 있다. 도 1a의 상태로부터 도 1b의 상태로 스위칭 되는 동안, 플렉서블 디스플레이의 제2 영역(110-2)이 인출되기 때문에, 플렉서블 디스플레이의 활성 영역이 너비 방향을 따라 연장(및/또는 확장)될 수 있다. 도 1b의 상태로부터 도 1c의 상태로 스위칭되는 동안, 전자 장치는 제1 하우징 파트에 대 하여 제2 하우징 파트를 이동하여(예, 제1 하우징 파트 안으로 제2 하우징 파트를 인입하여), 플렉서블 디스플레이의 제1 영역(110-1)을 인입할 수 있다. 도 1b의 상태로부터 도 1c의 상태 로 스위칭되는 동안, 플렉서블 디스플레이의 제1 영역(110-1)이 하우징 안으로 인입됨에 따라, 플렉서블 디스플레이의 활성 영역이 너비 방향을 따라 축소될 수 있다. 도 1a의 상태로부터 도 1c의 상태로 순차적으로 스위칭되는 전자 장치의 동작이 설명되었지만, 실시예가 이에 제한되는 것은 아니다. 예를 들어, 전자 장치는 도 1c의 상태로부터 도 1a의 상태 로 순차적으로 스위칭될 수 있다. 예를 들어, 전자 장치는 도 1c의 상태로부터 롤-아웃 상태에 대응하는 도 1b의 상태로 스위칭된 다음, 다시 도 1c의 상태로 다시 스위칭될 수 있다. 유사하게, 전자 장치는 롤-인 상태의 일 예인 도 1a의 상태로부터 롤-아웃 상태의 일 예인 도 1b의 상태로 스위칭된 다음, 다시 도 1a의 상태로 다시 스위칭될 수 있다. 일 실시예에 따른, 전자 장치는 플렉 서블 디스플레이에 포함된 픽셀들의 수명(lifespan 또는 lifecycle) 및/또는 열화(deterioration)에 기반 하여, 상이한 영역들(예, 제1 영역(110-1) 및/또는 제2 영역(110-2)) 중 어느 한 영역이 선택적으로 노출되는 롤-인 상태로 스위칭될 수 있다. 픽셀들의 열화는, OLED(organic light emitting diode)의 번-인을 방지하거 나, 및/또는 보상하기 위하여, 전자 장치에 의해 식별되거나, 또는 측정될 수 있다. 예를 들어, 제1 영역 (110-1)에 포함된 픽셀들이 플렉서블 디스플레이의 다른 픽셀들 보다 오랫동안 활성화되었거나, 또는 사용 된 경우, 전자 장치는, 제2 영역(110-2)이 외부로 노출되는 롤-인 상태인 도 1c의 상태로 스위칭될 수 있다. 일 실시예에 따른, 전자 장치는, 플렉서블 디스플레이의 활성 영역 아래에 위치된 하우징 내의 카메라를 포함할 수 있다. 예를 들어, z 축의 방향을 따라 전자 장치의 전 면을 보면, 카메라 는 플렉서블 디스플레이 아래에 위치될 수 있다. 예를 들어, z 축의 방향을 따라 전자 장치의 전 면 을 보면, 카메라는 플렉서블 디스플레이의 적어도 일부분과 중첩될 수 있다. 플렉서블 디스플레이 아래에 위치되는 관점에서(in terms of), 카메라는 UDC(under display camera) 및/또는 UPC(under panel display)로 지칭될 수 있다. 일 실시예에서, 복수의 픽셀들이 배치된 플렉서블 디스플레이의 활성 영역은, 플렉서블 디스플레이 아래에 위치된 카메라를 향하여 외부 광(ambient light)을 투과하도록 구성된 제1 영역 및 상기 제1 영역과 상이한 제2 영역을 포함할 수 있다. 제1 영역 및/또 는 제2 영역에서의 플렉서블 디스플레이의 구조가, 도 4를 참고하여 설명된다. 도 1a 내지 도 1c를 참고하면, z 축의 방향을 따라 전자 장치의 전 면을 보면, 카메라는 플렉서블 디 스플레이의 제1 영역 아래에 위치될 수 있다. 제1 영역 아래에 위치되는 동안, 전자 장치(10 1)는 상기 제1 영역을 통과하여 카메라로 도달된 광에 대한 정보(예, 이미지 및/또는 비디오)를, 카 메라로부터 획득할 수 있다. 카메라가 상기 제1 영역과 상이한 제2 영역 아래에 위치되는 경우, 카메라로 도달되는 광의 광량이 줄어듦에 따라, 카메라를 통해 이미지 및/또는 비디오를 획득 하는 것이 중단될 수 있다. 카메라를 이용하여 이미지 및/또는 비디오를 획득하는 것을 지원하기 위하여, 전자 장치는 플렉서블 디스플레이의 제1 영역에 대하여 카메라의 위치를 정렬할 수 있다. 도 1a 내지 도 1c를 참고하면, 일 방향(예, x 축과 평행한 일 방향)을 따라 연장된 형태를 가지는 제1 영역 을 포함하는 플렉서블 디스플레이가 도시되지만, 제1 영역의 형태가 이에 제한되는 것은 아니다. 도 1d 내지 도 1e를 참고하면, 카메라의 렌즈의 형태(예, 원의 형태)에 대응하는 형태를 가지는 제1 영역을 포함하는 플렉서블 디스플레이 및/또는 전자 장치의 상이한 상태들(194, 195)이 도 시된다. 도 1d의 전자 장치의 상태는, 도 1a 및/또는 도 1c를 참고하여 설명된, 롤-인 상태에 대응 할 수 있다. 도 1e의 전자 장치의 상태는, 도 1b를 참고하여 설명된, 롤-아웃 상태에 대응할 수 있 다. 도 1d를 참고하면, 롤-인 상태에 포함된 예시적인 상태 내에서, 전자 장치의 카메라는, 플렉서 블 디스플레이의 제1 영역 아래에 위치될 수 있다. 제1 영역은, z 축을 따라 롤-인 상태의 전 자 장치의 전 면을 바라봤을 시, 카메라와 중첩될 수 있다. 제1 영역이, z 축을 따라 전자 장 치의 전 면을 바라봤을 시의 카메라의 아웃라인과 평행한 형태를 가지기 때문에, 플렉서블 디스플레 이가 카메라에 대하여 이동되는 즉시, 카메라는 제1 영역과 상이한 제2 영역 아래로 이동될 수 있다. 플렉서블 디스플레이의 제1 영역 및 제2 영역 중에서, 제1 영역이 카메 라로 광을 투과하기 위한 구조를 가지기 때문에, 카메라를 이용하여 이미지를 획득하는 것은, 롤-인 상태에 포함된 상태 내에서 허용될 수 있다. 예를 들어, 제1 영역 아래에 위치된 카메라를 이 용하여 이미지를 획득하는 것은, 도 1d의 상태 내에서 허용될 수 있다. 일 실시예에 따른, 전자 장치 는, 카메라를 활성화하기 위한 입력에 기반하여, 롤-인 상태(예, 도 1d의 상태)로 스위칭한 다음, 카메라와 관련된 기능을 실행할 수 있다. 도 1e를 참고하면, 도 1d의 전자 장치가 변형됨에 따라 스위칭되고, 롤-아웃 상태에 대응하는 상태가 도시된다. 일 실시예에 따른, 전자 장치는 카메라를 향하여 광을 투과하기 위한 구조를 가지는 제1 영역 및 제3 영역을 포함할 수 있다. 실시예가 이에 제한되는 것은 아니며, 전자 장치는 제1 영역 또는 제3 영역 중 어느 한 영역 만을 포함할 수 있다. 도 1d를 참고하여 상술한 바와 같이, 상 기 제1 영역은, 롤-인 상태에서 카메라와 정렬될 수 있다. 도 1e를 참고하면, 제3 영역은, 롤- 아웃 상태에서 카메라와 정렬되도록, 플렉서블 디스플레이에 형성될 수 있다. 제3 영역은, z 축을 따라 롤-아웃 상태의 전자 장치의 전 면을 바라봤을 시, 카메라와 중첩될 수 있다. 제3 영역 은, z 축을 따라 전자 장치의 전 면을 바라봤을 시의 카메라의 아웃라인과 평행한 형태를 가질 수 있다. 도 1d 내지 도 1e를 참고하면, 제1 영역 및 제3 영역을 포함하는 전자 장치에서, 카메라를 이용하여 이미지를 획득하는 것은, 롤-인 상태에 대응하는 도 1d의 상태 및 롤-아웃 상태에 대응하는 도 1e의 상태에서 허용되고, 롤-인 상태 및 롤-아웃 상태와 상이한 다른 상태(예, 중간 상태 및/또는 프리 스 탑 상태)에서 허용되지 않을 수 있다. 일 실시예에 따른, 전자 장치는, 상기 다른 상태 내에서 카메라 를 활성화하기 위한 입력을 식별한 경우, 롤-인 상태 또는 롤-아웃 상태 중 어느 한 상태로 스위칭한 다음, 상기 카메라와 관련된 기능을 실행할 수 있다. 도 1a 내지 도 1c의 상태들(191, 192, 193) 및/또는 도 1d 내지 도 1e의 상태들(194, 195)과 같이, 전자 장치 가 변형되는 동안, 플렉서블 디스플레이 및 카메라 사이의 위치 관계가 변경될 수 있다. 전자 장치가 액추에이터를 제어하여 제1 하우징 파트에 대하여 제2 하우징 파트를 이동하기 때문에, 플렉서블 디스플레이 및 카메라 사이의 위치 관계는 상기 액추에이터에 의해 변경될 수 있다. 스텝 모터와 같이, 액추에이터에 포함된 구동 부가 물리적으로 움직이는 동안, 오차가 발생될 수 있다. 상기 오차는, 전자 장치에 저장된 파라미터들에 의해 나타내는 전자 장치의 형태 및 전자 장치의 실 제 형태 사이의 차이와 관련될 수 있다. 액추에이터가 활성화되는 기간이 길어질수록, 상기 오차가 누적됨에 따라, 전자 장치의 실제 형태 및 상기 파라미터들에 의해 나타내는 전자 장치의 형태 사이의 차이가 증가될 수 있다. 일 실시예에 따른, 전자 장치는 상기 차이를 식별하기 위하여, 카메라를 통해 식별된 이미지를 이용 할 수 있다. 예를 들어, 상기 이미지를 이용하여, 전자 장치는 플렉서블 디스플레이 및 카메라 사이의 오정렬(misalignment)을 식별할 수 있다. 상기 오정렬을 식별하기 위하여, 전자 장치는 플렉서블 디스플레이의 제1 영역 및 제2 영역의 경계를 따라 형성된 패턴을 포함할 수 있다. 상기 패턴 이 상기 카메라에 의해 캡쳐되는지 여부에 기반하여, 전자 장치는 플렉서블 디스플레이에 대한 카메라의 오정렬을 식별할 수 있다. 상기 오정렬을 식별하는 것에 기반하여, 전자 장치는 플렉서블 디스플레이의 제1 영역에 대하여 카메라를 정렬하도록, 액추에이터를 제어할 수 있다. 상기 오 정렬을 식별하는 것에 기반하여, 전자 장치는 상기 액추에이터를 제어하기 위한 하나 이상의 파라미터들 (예, 제어 정보)을 변경할 수 있다. 이하에서는, 도 2 내지 도 11을 참고하여, 플렉서블 디스플레이 및 카메라 사이의 오정렬을 식별 및/ 또는 보상하기 위한 전자 장치의 일 실시예가 설명된다. 일 실시예에 따른, 전자 장치는 플렉서블 디스플레이의 형태(또는 제1 하우징 파트 및 제2 하우징 파트 사이의 거리)를 식별하기 위한 센 서(예, 홀(hall) 센서)와 독립적으로, 카메라를 이용하여 상기 오정렬을 식별할 수 있다. 도 2는, 일 실시예에 따른, 전자 장치의 블록도의 일 예를 도시한다. 도 1a 내지 도 1e의 전자 장치(10 1)는 도 2의 전자 장치의 일 예일 수 있다. 도 2를 참고하면, 전자 장치는, 프로세서, 메모리 , 플렉서블 디스플레이, 액추에이터 또는 카메라 중 적어도 하나를 포함할 수 있다. 프로 세서, 메모리, 플렉서블 디스플레이, 액추에이터 및 카메라는 통신 버스(a communication bus)와 같은 전자 부품(electronical component)에 의해 서로 전기적으로 및/또는 작동적 으로 연결될 수 있다(electronically and/or operably coupled with each other). 이하에서, 하드웨어들이 작 동적으로 결합된 것은, 하드웨어들 중 제1 하드웨어에 의해 제2 하드웨어가 제어되도록, 하드웨어들 사이의 직 접적인 연결, 또는 간접적인 연결이 유선으로, 또는 무선으로 수립된 것을 의미할 수 있다. 상이한 블록들에 기반하여 도시되었으나, 실시예가 이에 제한되는 것은 아니며, 도 2의 하드웨어들 중 일부분(예, 프로세서및 메모리의 적어도 일부분)이 SoC(system on a chip)와 같이 단일 집적 회로(single integrated circuit)에 포함될 수 있다. 전자 장치에 포함된 하드웨어의 타입 및/또는 개수는 도 2에 도시된 바에 제 한되지 않는다. 예를 들어, 전자 장치는 도 2에 도시된 하드웨어 컴포넌트 중 일부만 포함할 수 있다. 일 실시예에 따른, 전자 장치의 프로세서는 하나 이상의 인스트럭션들에 기반하여 데이터를 처리하기 위한 하드웨어 및/또는 회로를 포함할 수 있다. 데이터를 처리하기 위한 하드웨어로써, 프로세서는, ALU(arithmetic and logic unit), FPU(floating point unit), FPGA(field programmable gate array), CPU(central processing unit), 및/또는 AP(application processor)를 포함할 수 있다. 프로세서의 개수 는 하나 이상일 수 있다. 예를 들어, 프로세서는 듀얼 코어(dual core), 쿼드 코어(quad core) 또는 헥사 코어(hexa core)와 같은 멀티-코어 프로세서의 구조를 가질 수 있다. 일 실시예에 따른, 전자 장치의 메모리는 프로세서에 입력 및/또는 출력되는 데이터 및/또는 인 스트럭션을 저장하기 위한 하드웨어를 포함할 수 있다. 메모리는, 예를 들어, RAM(random-access memor y)과 같은 휘발성 메모리(volatile memory) 및/또는 ROM(read-only memory)과 같은 비휘발성 메모리(non- volatile memory)를 포함할 수 있다. 휘발성 메모리는, 예를 들어, DRAM(dynamic RAM), SRAM(static RAM), Cache RAM, PSRAM (pseudo SRAM) 중 적어도 하나를 포함할 수 있다. 비휘발성 메모리는, 예를 들어, PROM(programmable ROM), EPROM (erasable PROM), EEPROM (electrically erasable PROM), 플래시 메모리, 하 드디스크, 컴팩트 디스크, SSD(solid state drive), eMMC(embedded multi-media card) 중 적어도 하나를 포함 할 수 있다. 일 실시예에 따른, 전자 장치의 플렉서블 디스플레이는 사용자에게 시각화된 정보를 출력할 수 있다. 예를 들어, 플렉서블 디스플레이는, GPU(graphic processing unit)와 같은 컨트롤러에 의해 제어되어, 사 용자에게 시각화된 정보(visualized information)를 출력할 수 있다. 플렉서블 디스플레이는 LCD(liquid crystal display), PDP(plasma display panel) 및/또는 하나 이상의 LED(light emitting diode)를 포함할 수 있다. 상기 LED는 OLED(organic LED)를 포함할 수 있다. 플렉서블 디스플레이는 전자 종이(electronic paper)를 포함할 수 있다. 도 1a 내지 도 1e를 참고하여 상술한 바와 같이, 플렉서블 디스플레이는 적어 도 부분적으로 휘어진 형태를 가지거나, 변형가능한(deformable) 형태를 가질 수 있다. 일 실시예에 따른 전자 장치의 플렉서블 디스플레이는, 플렉서블 디스플레이 상의 외부 객체(예, 사용자의 손가락)를 탐지하기 위한 센서(예, TSP(touch sensor panel))를 포함할 수 있다. 예를 들어, TSP에 기반하여, 전자 장치의 프로세서는 플렉서블 디스플레이와 접촉하거나, 또는 플렉 서블 디스플레이 상을 부유하는(floating) 외부 객체를 탐지할 수 있다. 상기 외부 객체를 탐지하는 것에 응답하여, 프로세서는 플렉서블 디스플레이 내에 표시되고 있는 시각적 객체들 중에서 상기 외부 객 체의 플렉서블 디스플레이 상에서의 위치에 대응하는 특정 시각적 객체와 관련된 기능을 실행할 수 있다. 일 실시예에 따른, 전자 장치의 액추에이터는, 하우징(예, 도 1a 내지 도 1e의 하우징)의 제1 하우징 파트(예, 도 1a 내지 도 1e의 제1 하우징 파트)에 대하여 제2 하우징 파트(예, 도 1a 내지 도 1e의 제2 하우징 파트)를 이동하도록, 구성될 수 있다. 액추에이터는, 플렉서블 디스플레이 및/또는 전자 장치의 형태를 변경할 수 있다. 액추에이터는, 구동 부로 참조될 수 있다. 액추에이터는, 전기 에너지로부터 운동 에너지를 출력하기 위한 하드웨어를 포함할 수 있다. 예를 들어, 액추에이터는, 모터 및/또는 스텝 모터를 포함할 수 있다. 액추에이터에 포함된 스텝 모터는, 상기 스텝 모터로 적용되는 펄스 신호에 의해 나타내는 각도 만큼 회전될 수 있다. 액추에이터가 모터를 포함하는 일 실시예에서, 액추에이터는 상기 모터의 회전 움직임(rotational motion)을, 플렉서블 디스플레이에 가해지는 직선 움직임(linear motion)(또는 병진 움직임(translation motion))으로 변경하기 위한 기어(예, 랙 기어)를 포함할 수 있다. 일 실시예에서, 액추에이터는 상기 모 터의 회전 력(예, 토크)을 조절하기 위하여 상호 연결된(engaged to each other) 복수의 기어들을 포함할 수 있 다. 상기 복수의 기어들은, 액추에이터의 기어 조립체, 또는 트랜스미션 부로 참조될 수 있다. 일 실시예에서, 프로세서는, 액추에이터의 모터로 인가되는 전력 신호의 주파수, 전압, 및/또는 전류 를 변경하여, 플렉서블 디스플레이, 및/또는 전자 장치가 변형되는 속도, 및/또는 방향을 조절할 수 있다. 일 실시예에서, 프로세서는, 상기 기어 조립체에 포함된 복수의 기어들의 위치 관계, 및/또는 상호 연결된 기어들 사이의 기어 비를 조절하여, 플렉서블 디스플레이, 및/또는 전자 장치가 변형되는 속 도, 및/또는 방향을 조절할 수 있다. 일 실시예에 따른, 전자 장치의 카메라는 빛의 색상 및/또는 밝기를 나타내는 전기 신호를 생성하는 하나 이상의 광 센서들(예, CCD(charged coupled device) 센서, CMOS(complementary metal oxide semiconductor) 센서)을 포함할 수 있다. 카메라에 포함된 복수의 광 센서들은 2차원 격자(2 dimensional array)의 형태로 배치될 수 있다. 카메라는 복수의 광 센서들 각각의 전기 신호를 실질적으 로 동시에 획득하여, 2차원 격자의 광 센서들에 도달한 빛에 대응하고, 2차원으로 배열된 복수의 픽셀들을 포함 하는 이미지를 생성할 수 있다. 예를 들어, 카메라를 이용하여 캡쳐한 사진 데이터는 카메라로부터 획득한 하나의 이미지를 의미할 수 있다. 예를 들어, 카메라를 이용하여 캡쳐한 비디오 데이터는 카메라 로부터 지정된 프레임율(frame rate)을 따라 획득한 복수의 이미지들의 시퀀스(sequence)를 의미할 수 있 다. 도 1a 내지 도 1e를 참고하면, 플렉서블 디스플레이 아래에 위치된 카메라가 예시적으로 도시되 지만, 전자 장치에 포함된 카메라의 개수 및/또는 위치가 도 1a 내지 도 1e의 일 실시예에 제한되는 것은 아니다. 일 실시예에 따른, 전자 장치의 메모리 내에서, 프로세서가 데이터에 수행할 연산, 및/또는 동 작을 나타내는 하나 이상의 인스트럭션들(또는 명령어들)이 저장될 수 있다. 하나 이상의 인스트럭션들의 집합 은, 펌웨어, 운영 체제, 프로세스, 루틴, 서브-루틴, 소프트웨어 어플리케이션 및/또는 어플리케이션으로 참조 될 수 있다. 예를 들어, 전자 장치, 및/또는 프로세서는, 운영체제, 펌웨어, 드라이버, 및/또는 어 플리케이션 형태로 배포된 복수의 인스트럭션의 집합(set of a plurality of instructions)이 실행될 시에, 도 3a 내지 도 3c의 동작들 중 적어도 하나를 수행할 수 있다. 이하에서, 어플리케이션이 전자 장치에 설치 되었다는 것은, 어플리케이션의 형태로 제공된 하나 이상의 인스트럭션들이 전자 장치의 메모리 내에 저장된 것으로써, 상기 하나 이상의 어플리케이션들이 전자 장치의 프로세서에 의해 실행 가능한 (executable) 포맷(예, 전자 장치의 운영 체제에 의해 지정된 확장자를 가지는 파일)으로 저장된 것을 의 미할 수 있다. 일 실시예에 따른, 전자 장치의 프로세서는, 카메라 어플리케이션의 실행에 기반하여, 카메라 를 제어할 수 있다. 프로세서는 카메라 어플리케이션의 실행을 나타내는 입력에 기반하여, 카 메라 어플리케이션을 실행할 수 있다. 카메라 어플리케이션의 실행을 나타내는 입력은, 플렉서블 디 스플레이 상에 표시되고, 카메라 어플리케이션을 표현하는, 시각적 객체(예, 아이콘)에 대한 터치 제 스쳐(또는 드래그 제스쳐)에 의해 식별될 수 있다. 카메라 어플리케이션의 실행을 나타내는 입력은, 전자 장치의 하우징의 일부분을 통해 외부로 노출된 지정된 버튼의 눌림에 의해 식별될 수 있다. 실시예가 이 에 제한되는 것은 아니며, 카메라 어플리케이션의 실행을 나타내는 입력은, 카메라와 관련된 자연어 문장(natural language)을 포함하는 보이스 커맨드 및/또는 사용자의 발언에 의해 식별될 수 있다. 카메라 어 플리케이션의 실행을 나타내는 입력은, 카메라를 활성화하는 입력에 포함될 수 있다. 일 실시예에서, 카메라 어플리케이션이 실행된 상태 내에서, 프로세서는 플렉서블 디스플레이 및 카메라의 위치 관계를 식별하기 위한 동작을 수행할 수 있다. 카메라를 활성화하는 입력에 응답 하여, 프로세서는 카메라를 통해 이미지를 획득할 수 있다. 프로세서는 상기 이미지로부터, 플 렉서블 디스플레이 및 카메라의 위치 관계를 식별하기 위한 정보를 획득할 수 있다. 예를 들어, 프 로세서는 상기 이미지로부터, 카메라를 향하여 광을 투과하도록 구성된 플렉서블 디스플레이의 제1 영역(예, 도 1a 내지 도 1e의 제1 영역)을 구분하기 위한 패턴의 적어도 일부분에 대응하는 시각적 객 체를 식별할 수 있다. 상기 시각적 객체를 식별하는 것에 기반하여, 전자 장치는 플렉서블 디스플레이 및 카메라의 정렬을 위한 기능(예, 액추에이터를 제어하는 기능)을 실행할 수 있다. 일 실시예에 따른, 전자 장치의 프로세서는, 메모리에 저장된 액추에이터 제어 정보를 이 용하여, 액추에이터를 제어할 수 있다. 액추에이터 제어 정보는, 액추에이터에 포함된 스텝 모 터의 구동을 위해 요구되는 정보를 포함할 수 있다. 예를 들어, 액추에이터 제어 정보는, 상기 스텝 모터 의 제어를 위해 요구되는 펄스 신호의 진폭 및/또는 펄스 폭에 대한 정보를 포함할 수 있다. 예를 들어, 액추 에이터 제어 정보는, 상기 스텝 모터로 적용되는 단위 펄스(unit pulse)에 대하여, 상기 스텝 모터가 회전 되는 정도에 대한 정보를 포함할 수 있다. 예를 들어, 액추에이터 제어 정보는 상기 단위 펄스에 대한 플 렉서블 디스플레이 및/또는 전자 장치의 하우징(예, 제1 하우징 파트 및/또는 제2 하우징 파트 )의 이동 거리를 포함할 수 있다. 예를 들어, 액추에이터 제어 정보는 상기 스텝 모터의 회전 수(예, 스텝) 및 상기 이동 거리 사이의 관계를 나타내는 정보를 포함할 수 있다. 일 실시예에 따른, 프로세서는 카메라로부터 획득된 이미지로부터, 상기 패턴의 적어도 일부분에 대 응하는 시각적 객체를 식별한 경우, 플렉서블 디스플레이 및 카메라를 정렬하기 위하여, 액추에이터를 제어할 수 있다. 플렉서블 디스플레이 및 카메라를 정렬하는 것에 기반하여, 프로세서(21 0)는 액추에이터 제어 정보를 변경할 수 있다. 예를 들어, 상기 시각적 객체를 포함하는 이미지가 카메라 로부터 출력되는 것을 방지하기 위하여, 프로세서는 액추에이터 제어 정보를 변경할 수 있다. 이하에서는, 도 3a 내지 도 3c를 참고하여, 플렉서블 디스플레이 및 카메라를 정렬하기 위하여 수행 되는 전자 장치의 프로세서의 동작이 설명된다. 도 3a 내지 도 3c는, 일 실시예에 따른, 전자 장치의 흐름도의 일 예를 도시한다. 도 3a 내지 도 3c를 참고하 여 설명되는 전자 장치의 동작은, 도 1a 내지 도 1e, 및/또는 도 2의 전자 장치 및/또는 도 2의 프로세서 에 의해 수행될 수 있다. 도 3a를 참고하면, 동작 내에서, 일 실시예에 따른, 전자 장치의 프로세서는, 카메라(예, 도 1a 내지 도 1e 및/또는 도 2의 카메라)를 활성화하는 입력에 응답하여, 카메라로부터 이미지를 획득할 수 있다. 상기 입력은, 도 2의 카메라 어플리케이션을 실행하기 위한 입력을 포함할 수 있다. 동작은, 전자 장치의 형태 및/또는 상태가, 플렉서블 디스플레이(예, 도 1a 내지 도 1e 및/또는 도 2의 플렉서블 디스플레이) 아래에 위치된 상기 카메라가 광을 투과하도록 구성된 상기 플렉서블 디스플레이의 일부분(예, 도 1a 내지 도 1e의 제1 영역)과 정렬된 동안, 수행될 수 있다. 예를 들어, 프로세서는, 상기 카메라가 상기 플렉서블 디스플레이의 상기 일부분 아래에 위치되도록, 도 2의 액추에이터를 제어한 다음, 동작을 수행할 수 있다. 실시예가 이에 제한되는 것은 아니며, 전자 장치의 프로세서는, 카메라 및 플렉서블 디스플레이의 정렬을 확인 하기 위한 테스트 작업에 기반하여, 동작의 이미지를 획득할 수 있다. 상기 테스트 작업은, 전자 장치가 생산, 제조 및/또는 조립되는 동안 수행될 수 있다. 상기 테스트 작업은, 전자 장치에 의해 실행되는 백그라운 드 프로세스(예, 자가 진단 프로세스)를 포함할 수 있다. 도 3a를 참고하면, 동작 내에서, 일 실시예에 따른, 전자 장치의 프로세서는, 플렉서블 디스플레이의 후 면에 형성된 패턴에 대응하는 시각적 객체가 동작의 이미지에 포함되는지 여부를 식별할 수 있다. 플렉서 블 디스플레이의 아래에 위치된 카메라를 포함하는 전자 장치 내에서, 상기 카메라가 향하는 상기 플렉서블 디 스플레이의 후 면은, 카메라를 향하여 광을 투과하도록 구성된 제1 영역(예, 도 1a 내지 도 1e의 제1 영역 ) 및 상기 제1 영역과 상이한 제2 영역(예, 도 1a 내지 도 1e의 제2 영역) 사이의 경계를 따라 (along) 배치된 패턴을 포함할 수 있다. 플렉서블 디스플레이의 후 면에서, 카메라 및 플렉서블 디스플레이의 정렬을 가이드하기 위한 패턴이 형성될 수 있다. 플렉서블 디스플레이의 후 면에 형성된 패턴의 예시적인 형태 및/또는 위치가, 도 5 내지 도 6을 참고하여 설명된다. 일 실시예에 따른, 전자 장치의 프로세서는, 상기 패턴과 관련된 기준 이미지 및 동작의 이미지를 비교하 여, 동작의 이미지로부터 상기 패턴에 대응하는 시각적 객체를 식별할 수 있다. 프로세서는, 동작의 이미지에 포함된 하나 이상의 특징 점들(feature points)에 기반하여, 동작의 이미지로부터 상기 시각적 객체를 식별할 수 있다. 실시예가 이에 제한되는 것은 아니며, 프로세서는 CNN(convolutional neural network) 및/또는 LSTM(long-short term memory)와 같은 뉴럴 네트워크(또는 모델)를 이용하여, 동작의 이미지로부터 상기 시각적 객체를 식별할 수 있다. 일 실시예에서, 동작의 패턴이 카메라를 향하여 광을 투과하도록 구성된 제1 영역 및 상기 제1 영역과 상 이한 제2 영역 사이의 경계에 형성되기 때문에, 패턴에 대응하는 시각적 객체가 이미지에 포함되는 것은, 카메 라의 적어도 일부분이, 상기 경계 및/또는 상기 제2 영역 아래에 위치됨을 의미할 수 있다. 카메라의 적어도 일부분이 상기 제2 영역 아래에 위치되는 경우, 카메라로 향하는 광이 상기 제2 영역에 의해 가려지기 (occluded) 때문에, 상기 카메라의 적어도 일부분을 이용하여 이미지 및/또는 비디오를 획득하는 것이 중단될 수 있다. 예를 들어, 상기 카메라의 상기 적어도 일부분에 대응하는 이미지 및/또는 비디오의 일부분에서, 비 네팅(vignetting)이 발생될 수 있다. 일 실시예에 따른, 프로세서는 동작의 이미지 내에서 상기 패턴에 대응하는 시각적 객체를 탐색하여, 비네 팅이 발생되는지 여부를 식별할 수 있다. 비네팅이 발생되는 경우, 프로세서는 상기 비네팅을 방지하기 위한 동작을 수행할 수 있다. 비네팅을 식별하기 위해 형성된 마크의 관점에서, 상기 패턴은 비네팅 인식 마크로 지 칭될 수 있다. 패턴의 적어도 일부분에 대응하는 시각적 객체를 포함하는 이미지를 식별하는 것에 기반하여(320-예), 프로세서는 동작을 수행할 수 있다. 패턴의 적어도 일부분에 대응하는 시각적 객체를 식별한 프로세서는, 전자 장치의 전 면을 바라봤을 시, 카메라의 적어도 일부분이 플렉서블 디스플레이의 제2 영역과 중첩되는 것으로 결정할 수 있다. 프로세서는, 상기 제2 영역과 중첩되는 상기 카메라의 적어도 일부분의 사이 즈를 줄이기 위하여, 액추에이터를 제어할 수 있다. 상기 이미지로부터 상기 시각적 객체를 식별하지 못한 경 우(320-아니오), 프로세서는 동작을 수행할 수 있다. 예를 들어, 상기 이미지로부터 상기 시각적 객체를 식별하지 못한 경우(320-아니오), 동작들(330, 340, 350)이 수행되지 않거나, 동작들(330, 340, 350)을 수행하 는 것이 바이패스될 수 있다. 도 3a를 참고하면, 동작 내에서, 일 실시예에 따른, 전자 장치의 프로세서는, 이미지 내 시각적 객체의 위 치를 식별할 수 있다. 예를 들어, 프로세서는, 이미지 내에서 상기 시각적 객체의 위치를 나타내는 좌표 값들 을 식별할 수 있다. 프로세서는 이미지의 어느 한 가장자리 및 상기 시각적 객체 사이의 거리를 식별할 수 있 다. 프로세서가 동작에 기반하여 이미지 내 시각적 객체의 위치를 식별하는 것은, 상기 위치를 이용하여, 카메라 및 플렉서블 디스플레이를 정렬하기 위하여, 수행될 수 있다. 도 3a를 참고하면, 동작 내에서, 일 실시예에 따른, 전자 장치의 프로세서는, 카메라 및 플렉서블 디스플 레이를 정렬하기 위하여, 액추에이터(예, 도 2의 액추에이터)를 제어할 수 있다. 예를 들어, 프로세서는 동작에 기반하여 식별된 위치에 기반하여 액추에이터를 제어할 수 있다. 예를 들어, 프로세서는 상기 위 치를 이용하여, 카메라의 이미지 센서 전체가 플렉서블 디스플레이의 제1 영역 아래로 이동하는데 요구되는 이 동 거리를 결정할 수 있다. 프로세서는 결정된 이동 거리에 기반하여 액추에이터를 제어할 수 있다. 스텝 모 터를 포함하는 액추에이터를 제어하는 일 실시예에서, 프로세서는, 단위 펄스 당 이동 거리 및 상기 결정된 이 동 거리에 기반하여, 상기 스텝 모터로 적용될 펄스 수를 결정할 수 있다. 프로세서는, 상기 스텝 모터로 상기 펄스 수에 기반하는 펄스 신호를 송신할 수 있다. 예를 들어, 플렉서블 디스플레이의 제1 영역에 대하여 카메 라를 정렬하기 위하여, 프로세서는 액추에이터로, 펄스 수에 기반하여 플렉서블 디스플레이의 이동 거리를 나타 내는, 펄스 신호 및/또는 상기 펄스 신호를 포함하는 제어 신호를 송신할 수 있다. 상기 펄스 신호는, 프로세 서로부터 액추에이터로 송신되는 제어 신호에 포함될 수 있다. 일 실시예에 따른, 프로세서는, 액추에이터에 포함된 하나 이상의 모터들(예, 상기 스텝 모터)의 회전 각도들 및 카메라에 대한 플렉서블 디스플레이의 이동 거리 사이의 관계에 기반하여, 카메라 및 플렉서블 디스플레이를 정렬하기 위하여 상기 하나 이상의 모터들로 송신될 제어 신호를 획득할 수 있다. 일 실시예에서, 동작의 시각적 객체를 포함하는 이미지에 기반하여, 프로세서는 플렉서블 디스플레이의 제1 영역에 대하여 카메라를 정 렬하기 위하여 액추에이터를 제어할 수 있다. 액추에이터의 제어에 기반하여, 프로세서는, 카메라가 플렉서블 디스플레이의 상기 제1 영역 아래에 위치되도록, 카메라 및 플렉서블 디스플레이를 정렬할 수 있다. 도 3a를 참고하면, 동작 내에서, 일 실시예에 따른, 전자 장치의 프로세서는, 액추에이터에 대한 제어 정 보(예, 도 2의 액추에이터 제어 정보)를 변경할 수 있다. 예를 들어, 전자 장치의 메모리 내에, 액추에이 터에 포함된 하나 이상의 모터들의 회전 각도들 및 플렉서블 디스플레이의 이동 거리 사이의 관계를 나타내는 상기 제어 정보가 저장될 수 있다. 이미지 내에서 플렉서블 디스플레이의 후 면에 형성된 패턴에 대응하는 시 각적 객체를 식별하는 것은, 플렉서블 디스플레이 및 카메라가 액추에이터의 구동에 의해 오정렬됨을 의미할 수 있다. 상기 시각적 객체를 식별한 프로세서는, 동작의 액추에이터의 제어에 기반하여 플렉서블 디스플레 이 및 카메라를 정렬하고, 동작에 기반하여 액추에이터의 제어를 위해 이용되는 제어 정보를 변경할 수 있 다. 예를 들어, 카메라가 변경된 제어 정보에 의해 제어되는 액추에이터에 의해 플렉서블 디스플레이의 제1 영 역 아래에서 이동되도록, 프로세서는 상기 제어 정보를 변경할 수 있다. 도 3a를 참고하면, 동작 내에서, 일 실시예에 따른, 전자 장치의 프로세서는, 카메라와 관련된 기능(예, 촬영)을 실행할 수 있다. 예를 들어, 프로세서는 플렉서블 디스플레이에 카메라로부터 획득된 이미지의 적어도 일부분을, 프리뷰 이미지로써 표시할 수 있다. 예를 들어, 프로세서는 동작을 수행하여 액추에이터를 제 어하는 것에 기반하여, 카메라가 플렉서블 디스플레이의 제1 영역 아래로 이동된 이후, 카메라를 이용하여 동작 의 입력에 대한 응답으로 플렉서블 디스플레이에 표시될, 다른 이미지를 획득할 수 있다. 상기 다른 이미 지는, 프리뷰 이미지로 지칭될 수 있다. 프로세서는 상기 기능을 실행하여, 이미지 및/또는 비디오를 획득할 수 있다. 프로세서는 메모리(예, 도 2의 메모리)에, 상기 획득된 이미지 및/또는 상기 획득된 비디오를 저장할 수 있다. 도 3a를 참고하여 설명된 전자 장치의 동작은, 도 1a 내지 도 1c를 참고하여 설명된 전자 장치와 같이, 액 추에이터의 변형에 기반하여 스위칭 가능한 모든 상태에서 카메라를 이용하여 이미지를 획득 가능한 전자장치에 의해 수행될 수 있다. 도 1d 내지 도 1e를 참고하면, 카메라를 향하여 광을 투과하도록 구성된 제 1 영역(또는 제3 영역)의 사이즈 및/또는 위치에 의해, 전자 장치의 특정 상태(예, 중간 상태 및/또는 프리 스탑 상태)에서 카메라를 이용하여 이미지를 획득하는 것이 허용되지 않을 수 있다. 도 3b를 참고하면, 동작 내에서, 일 실시예에 따른, 전자 장치의 프로세서는, 카메라를 활성화하는 입력에 응답하여, 액추에이터를 제어하여, 카메라를, 플렉서블 디스플레이의 제1 영역 아래로 이동할 수 있다. 동작 의 상기 제1 영역은, 도 1a 내지 도 1e의 제1 영역 및/또는 도 1c 내지 도 1e의 제1 영역 및 제3 영역을 포함할 수 있다. 프로세서는, 액추에이터에 포함된 모터의 회전 각도 및 플렉서블 디스플레이 의 이동 거리 사이의 관계를 이용하여, 상기 제1 영역 아래로 상기 카메라를 이동하기 위한 모터의 회전 각도를 결정할 수 있다. 프로세서는 결정된 회전 각도에 기반하여 상기 액추에이터를 제어하여, 동작을 수행할 수 있다. 도 3b를 참고하면, 동작 내에서, 일 실시예에 따른, 전자 장치의 프로세서는 카메라를 이용하여, 이미지를 획득할 수 있다. 도 3b의 동작은, 도 3a의 동작과 유사하게 수행될 수 있다. 프로세서는, 카메라가 동작에 기반하여 플렉서블 디스플레이의 제1 영역 아래로 이동된 상태 내에서, 동작을 수행하여 이미 지를 획득할 수 있다. 도 3b를 참고하면, 동작 내에서, 일 실시예에 따른, 전자 장치의 프로세서는, 플렉서블 디스플레이의 제1 영역 및 제2 영역의 경계를 따라 형성된 패턴에 대응하는 시각적 객체가 동작의 이미지에 포함되는지 여부 를 식별할 수 있다. 동작의 패턴 및/또는 시각적 객체는 도 3a의 동작의 패턴 및/또는 시각적 객체 에 대응할 수 있다. 동작의 시각적 객체를 포함하는 이미지를 식별한 경우(322-예), 프로세서는 도 3b의 동작들(330, 340, 350)을 수행할 수 있다. 도 3b의 동작들(330, 340, 350)은, 도 3a의 동작들(330, 340, 35 0)에 대응할 수 있다. 이미지로부터 동작의 시각적 객체를 식별하지 못한 경우(322-아니오), 프로세서는 동작을 수행할 수 있다. 도 3b의 동작은, 도 3a의 동작에 대응할 수 있다. 도 3b를 참고하면, 동작의 시각적 객체를 포함하는 이미지를 식별한 프로세서는 동작들(330, 340, 350)에 기반하여 카메라 및 플렉서블 디스플레이를 정렬할 수 있다. 카메라 및 플렉서블 디스플레이를 정렬한 프로세 서는, 동작의 플렉서블 디스플레이의 이동에 이용된 정보(예, 모터의 회전 각도 및 플렉서블 디스플레이의 이동 거리 사이의 관계를 나타내는 정보)를 변경하거나, 또는 업데이트할 수 있다. 예를 들어, 동작에서 지정된 제1 개수의 스텝에 기반하여 액추에이터의 스텝 모터를 제어한 프로세서는, 동작에 기반하여 제2 개수의 스텝에 기반하여 상기 스텝 모터를 제어하는 경우, 상기 제1 개수 및 상기 제2 개수의 합을, 카메라를 제1 영역 아래로 이동하기 위하여 스텝 모터를 제어하는데 이용되는 파라미터로 결정할 수 있다. 예를 들어, 동작 이후, 상기 제1 개수 및 상기 제2 개수의 합이, 제1 영역 아래로 카메라를 이동하기 위하여 이용될 수 있다. 도 3c를 참고하면, 동작 내에서, 일 실시예에 따른, 전자 장치의 프로세서는, 플렉서블 디스플레이의 인입 및/또는 인출을 위한 입력에 응답하여, 액추에이터를 제어할 수 있다. 상기 입력은, 전자 장치 및/또는 플렉서 블 디스플레이의 변형을 위한 사용자 입력을 포함할 수 있다. 상기 입력을 식별한 프로세서는 액추에이터를 제 어하여, 플렉서블 디스플레이를 이동할 수 있다. 플렉서블 디스플레이의 이동에 의해, 플렉서블 디스플레이 아 래에 위치된 카메라 및 플렉서블 디스플레이의 위치 관계가 변경될 수 있다. 도 3c를 참고하면, 동작에 기반하여 액추에이터를 제어한 프로세서는, 동작을 수행할 수 있다. 동작 에 의해 획득된 이미지에 기반하여, 프로세서는 동작들(322, 330, 340, 350)을 수행할 수 있다. 동작들 (322, 330, 340, 350)에 기반하여, 프로세서는 플렉서블 디스플레이에 대한 카메라의 위치를 조절할 수 있다. 예를 들어, 액추에이터를 제어한 이후 획득된 이미지 내에서 시각적 객체를 식별한 프로세서는, 동작들(330, 340, 350)에 기반하여, 카메라 및 플렉서블 디스플레이를 정렬할 수 있다. 상기 정렬을 수행한 이후, 프로세서 는 동작에 기반하여, 플렉서블 디스플레이의 인입 및/또는 인출을 완료할 수 있다. 도 3c를 참고하여 설명된 동작은, 플렉서블 디스플레이의 인입 및/또는 인출을 위한 입력에 기반하여 액추에이 터를 제어하는 동안, 프로세서에 의해 실행되는 백그라운드 프로세스에 기반하여 수행될 수 있다. 예를 들어, 프로세서는 도 3c에 기반하여 카메라 및 플렉서블 디스플레이를 정렬하는 것을, 플렉서블 디스플레이에 표시되 는 화면과 독립적으로 수행할 수 있다. 도 3c의 동작들(314, 322, 330, 340, 350) 중 어느 동작도, 플렉서블 디스플레이에 화면을 표시하지 않고(without) 수행될 수 있다. 상술한 바와 같이, 일 실시예에 따른, 전자 장치의 프로세서는, UDC 및/또는 UPC 구조에서, 전자 장치의 카메라 가 플렉서블 디스플레이의 특정 영역(예, 도 1a 내지 도 1e의 제2 영역)에 의해 가려지는 것을 방지하도록, 액추에이터를 제어할 수 있다. 이하에서는, 도 4를 참고하여, 카메라를 향하여 광을 투과하도록 구성된 제1 영역을 포함하는 플렉서블 디스플 레이의 예시적인 구조가 설명된다. 도 4는, 카메라와 중첩된 플렉서블 디스플레이의 일부분의 구조의 일 예를 도시한다. 도 1a 내지 도 1e, 도 2의 전자 장치는 도 4를 참고하여 설명되는 카메라 및 플렉서블 디스플레이를 포함할 수 있다. 도 4를 참고하면, 카메라가 플렉서블 디스플레이 아래에 위치된 전자 장치의 일 실시예에서, 카 메라로 광을 투과하도록 구성된 플렉서블 디스플레이의 제1 영역과 상이한 제2 영역은, 상 기 제1 영역을 감싸도록 구성될 수 있다. 상기 제2 영역은, 카메라로 광을 투과하기 위한 구조 와 상이한 구조를 가질 수 있다. 예를 들어, 상기 제2 영역은, 카메라로 광을 투과하기 위한 하나 이상의 개구들을 포함하는 구조를 포함하지 않을 수 있다. 이하에서는, 도 4를 참고하여, 카메라로 광을 투과하기 위해 플렉서블 디스플레이의 제1 영역에 형성된 구조의 일 예가 설명된다. 도 4를 참고하면, z 축을 따라 전자 장치의 전 면을 보는 관점에서, 카메라 상에 위치되도록 구성된 플렉서블 디스플레이의 제1 영역의 일부분에 대한 확대도(111-1)가 도시된다. 도 4의 확대도(111- 1)를 참고하면, 플렉서블 디스플레이의 제1 영역은, 균일하게 서로 이격된 복수의 픽셀들 및 복 수의 픽셀들 아래에 위치된 불투명 메탈 레이어를 포함할 수 있다. 복수의 픽셀들 각각은, 상 이한 색상들을 방출하도록, 구성된 서브 픽셀들(431, 432, 433)을 포함할 수 있다. 예를 들어, 상기 색상들은, 광의 3 원색들(primary colors)(예, 적색, 녹색 및 청색)을 포함할 수 있다. 예를 들어, 서브 픽셀은, 적 색의 광을 방출하도록, 구성될 수 있다. 서브 픽셀은, 녹색의 광을 방출하도록, 구성될 수 있다. 서브 픽셀은, 청색의 광을 방출하도록, 구성될 수 있다. 예를 들면, 불투명 메탈 레이어는, z 축을 따라 제1 영역을 바라봤을 시에, 복수의 픽셀들 사이 에 위치된 복수의 개구들을 포함할 수 있다. 예를 들면, 복수의 개구들 각각은, 픽셀들에 의해 부분 적으로 감싸질 수 있다. 예를 들면, 복수의 픽셀들이 복수의 개구들 각각의 가장자리(periphery)를 따라(along) 위치될 수 있다. 예를 들면, 불투명 메탈 레이어는, 균일하게 서로 이격된 복수의 픽셀들 을 포함하는 발광 레이어(또는 패널 레이어) 아래에 위치될 수 있다. 전자 장치의 외부로부터 플렉 서블 디스플레이가 위치된 전자 장치의 전 면으로 향하는 광이, 불투명 메탈 레이어에 포함된 복수의 개구들을 따라, 플렉서블 디스플레이 아래로 전파될 수 있다. 예를 들어, 상기 광이 복수의 개구들을 따라, 플렉서블 디스플레이 아래에 위치된 카메라를 향하여 전파될 수 있다. 예를 들 어, 카메라에 의해 획득된 이미지는 제1 영역에 형성된 상기 복수의 개구들을 통과하여 카메라 로 도달된 광을 나타낼 수 있다. 도 4를 참고하면, z 축을 따라 제1 영역을 바라봤을 시에, 복수의 개구들이 복수의 픽셀들 사이 에 위치될 수 있다. 한편, 제1 영역과 상이한 제2 영역에서, 고해상도의 화면을 제공하기 위하여, 복수의 픽셀들이 x-y 평면 상의 모든 방향들에서 서로 인접하도록 위치될 수 있다. 예를 들어, 복수의 개 구들 및/또는 복수의 픽셀들 사이의 간격이, 플렉서블 디스플레이의 제2 영역에서 최소화 될 수 있다. 복수의 픽셀들 사이의 간격이 플렉서블 디스플레이의 제2 영역에서 최소화되기 때 문에, 제1 영역에서의 픽셀들의 제1 밀도가, 제2 영역에서의 픽셀들의 제2 밀도 보다 낮을 수 있다. 상술한 바와 같이, 일 실시예에 따른, 전자 장치의 플렉서블 디스플레이는, 플렉서블 디스플레이 의 전 면으로부터 후 면으로 광을 투과하기 위한 복수의 개구들을 포함하는 제1 영역 및 상기 복수의 개구들이 형성되지 않은 제2 영역을 포함할 수 있다. 플렉서블 디스플레이 아래에 위치 된 카메라를 포함하는 전자 장치는, 카메라가 플렉서블 디스플레이의 상기 제1 영역 아래에 위치되는지 여부를, 카메라로부터 획득된 이미지를 이용하여 식별할 수 있다. 상기 이미지를 이용 하여 카메라 및 제1 영역의 위치 관계를 식별하기 위하여, 전자 장치는 상기 위치 관계를 식별 하기 위한 패턴이 형성된 플렉서블 디스플레이를 포함할 수 있다. 도 5는, 카메라가 향하는 플렉서블 디스플레이의 일 면에 형성된 패턴의 일 예를 도시한다. 도 1a 내지 도 1e, 도 2의 전자 장치는 도 5를 참고하여 설명되는 패턴이 형성된 플렉서블 디스플레이를 포 함할 수 있다. 도 5를 참고하면, 일 실시예에 따른, 전자 장치에 포함된, 플렉서블 디스플레이의 A-A' 라인에 대한 단면도(cross-sectional view)가 도시된다. 플렉서블 디스플레이는, -z 축의 방향을 따라 순차적으로 스 택된, 패널 레이어, 차광(light shielding) 레이어 및 메탈 레이어를 포함할 수 있다. 차광 레이어는 엠보(embo) 레이어 및/또는 블랙 엠보 레이어로 지칭될 수 있다. 메탈 레이어는, 도 4의 불투명 메탈 레이어를 포함할 수 있다. 도 5를 참고하면, 플렉서블 디스플레이는, 카메라와 중 첩됨에 따라, 카메라로 광을 투과하도록 구성된 제1 영역 및 카메라와 중첩되지 않도록 설계된 제2 영역을 포함할 수 있다. 플렉서블 디스플레이의 제1 영역에서, 차광 레이어 및/또는 메탈 레이어의 적어도 일부분이 개방되거나, 또는 천공될 수 있다. 일 실시예에 따른, 전자 장치의 플렉서블 디스플레이는, 카메라가 향하는 일 면(예, 플렉서블 디스플레이의 후 면)에 형성된 패턴을 포함할 수 있다. 도 5를 참고하면, 메탈 레이어의 일 면에, 상기 패턴이 형성될 수 있다. 패턴은, 카메라와 마주보는 메탈 레이어의 일 면 상에서, 제1 영역 으로 광을 투과하기 위하여 형성된 메탈 레이어의 개구의 가장자리를 따라 형성될 수 있다. 도 5를 참고하면, 패턴은, 제1 영역 및 제2 영역의 경계를 따라 형성될 수 있다. 예를 들어, 패턴은, 제1 영역의 아웃라인의 형태를 가질 수 있다. 도 5를 참고하면, 제1 영역 및 제2 영역의 경계를 나타내는 패턴을 포함하는 메탈 레이어의 상이한 예시들(예, 메탈 레이어들(530-1, 530-2))이 도시된다. 메탈 레이어(530-1)를 참고하면, 파선(dashed line)의 형태를 가지는 패턴이 제1 영역 및 제2 영역의 경계를 따라 형성될 수 있다. 상기 파선의 형태 를 가지는 패턴은, 지정된 색상 및/또는 지정된 소재(예, 형광 물질)에 의해 형성될 수 있다. 패턴 은, 음각되거나(engraved) 또는 양각된(embossed) 메탈 레이어(530-1)에 의해 형성될 수 있다. 제1 영역(11 1)의 가장자리(periphery)를 따라 형성된 패턴이 예시적으로 도시되지만, 실시예가 이에 제한되는 것은 아 니다. 예를 들어, 패턴은, 제1 영역의 가장자리 중에서, x 축을 따라 연장된 제1 영역의 좌측 가장자리 및/또는 우측 가장자리에 부분적으로 형성될 수 있다. 예를 들어, 제1 영역의 가장자리들 중에 서 상기 좌측 가장자리 및 상기 우측 가장자리를 제외한 다른 가장자리에서, 패턴이 형성되지 않을 수 있 다. 도 5의 메탈 레이어(530-2)를 참고하면, 제1 영역 및 제2 영역 사이의 특정 지점들을 지시하는 형태 를 가지는 패턴들(542, 544)이 형성될 수 있다. 예를 들어, 패턴들(542, 544)은, 제1 영역 및 제2 영역 의 경계 선 상에서, 서로 마주보는 두 지점들 각각에 위치될 수 있다. 패턴들(542, 544)은 십자선의 형태 에 기반하여 상기 지점들을 나타낼 수 있다. 실시예가 이에 제한되는 것은 아니다. 일 실시예에 따른, 전자 장치는 카메라로부터 획득된 이미지로부터, 도 5를 참고하여 예시된 패턴들 (540, 542, 544)을 식별하는 것에 기반하여, 플렉서블 디스플레이 및 카메라를 정렬하기 위한 기능을 실행할 수 있다. 이하에서는, 도 6을 참고하여, 플렉서블 디스플레이 및 카메라를 정렬하기 위한 전 자 장치의 예시적인 동작이 설명된다. 도 6은, 카메라 및 플렉서블 디스플레이를 정렬하기 위한 전자 장치의 동작의 일 예를 도시한다. 도 1a 내지 도 1e, 도 2의 전자 장치 및/또는 도 2의 프로세서는 도 6을 참고하여 설명되 는 전자 장치의 동작을 수행할 수 있다. 도 6을 참고하면, 카메라의 적어도 일부분이 플렉서블 디스플레이의 제2 영역 아래에 위치된 예 시적인 상태 내에서, 전자 장치가 카메라를 이용하여 획득한 이미지의 일 예가 도시된다. 도 6의 이미지는 도 3a의 동작 및/또는 도 3b의 동작에 기반하여 획득될 수 있다. 카메라(13 0)가 플렉서블 디스플레이 아래에 위치된 일 실시예에서, 플렉서블 디스플레이는 광을 투과하기 위한 하나 이상의 개구들(예, 도 4의 복수의 개구들)을 포함하는 제1 영역 및 상기 하나 이상의 개구들과 독립적으로 형성된 제2 영역을 포함할 수 있다. 제1 영역 아래에 위치된 카메라의 제1 부분을 향하여, 플렉서블 디스플레이를 투과하는 광이 도달될 수 있다. 제2 영역 아래에 위치된 카메라 의 제2 부분은, 플렉서블 디스플레이를 향하는 광이 제2 영역에 의해 차단되기 때문에, 어떤 광도 도달될 수 없다. 도 6을 참고하면, 카메라의 일부분이 플렉서블 디스플레이의 제2 영역 아래에 위치된 경우, 상 기 카메라로부터 획득된 이미지는, 플렉서블 디스플레이의 제1 영역 아래에 위치된 카메라 의 일부분에 대응하는 제1 부분 및 플렉서블 디스플레이의 제2 영역 아래에 위치된 카메라 의 일부분에 대응하는 제2 부분으로 구분될 수 있다. 제1 부분에 대응하는 카메라의 일부 분으로, 플렉서블 디스플레이의 제1 영역을 투과하는 광이 도달되기 때문에, 이미지의 제1 부분 은, 상기 광에 대응하는 색상 분포를 가질 수 있다. 제2 부분에 대응하는 카메라의 일부분이, 플렉서블 디스플레이의 제2 영역에 의해 가려지기 때문에, 이미지의 제2 부분은, 지정된 밝기 미만의 색상(예, 실질적으로 흑색)을 가질 수 있다. 이미지의 제1 부분 및 제2 부분 사이 에, 플렉서블 디스플레이의 제1 영역 및 제2 영역 사이에 형성된 패턴의 적어도 일부분에 대응 하는 시각적 객체가 포함될 수 있다. 도 6을 참고하면, 플렉서블 디스플레이의 제2 영역과 적어도 부분적으로 중첩된 카메라로부터 획득된 이미지는, 상기 제2 영역에 가려진 제2 부분을 포함할 수 있다. 이미지가 제2 부 분을 포함하는 것은, 카메라가 전자 장치의 주변 광(또는 외부 광)을 완전히 수신하지 못함을 의미할 수 있다. 의도되지 않은(unintentional) 제2 부분을 이미지로부터 제거하거나, 또는 줄이기 위하여, 전자 장치는 플렉서블 디스플레이 및 카메라를 정렬하여, 카메라를 제1 영역 아래로 이동할 수 있다. 일 실시예에 따른, 전자 장치는 이미지 내에서, 패턴에 대응하는 시각적 객체를 탐지하여, 제2 영역에 가려지는 제2 부분을 식별할 수 있다. 이미지에 포함된 시각적 객체의 형태(도 6 의 예시적인 상태 내에서, -x 방향을 향하여 돌출된 호(arc)의 형태)에 기반하여, 전자 장치는 이미 지 내에서 제2 영역에 가려지는 제2 부분을 식별할 수 있다. 일 실시예에 따른, 전자 장치 는, 이미지 내 시각적 객체의 위치 및/또는 이미지의 가장자리 및 시각적 객체 사이 의 거리를 식별할 수 있다. 도 6을 참고하면, 패턴의 일부분에 대응하는 시각적 객체를 포함하는 이미지의 일부분이 도시된다. 전자 장치의 카메라의 픽셀은, 베이어 패턴에 기반하는 서브 픽셀들(예, \"G\"가 기재된 녹색 서 브 픽셀, \"R\"이 기재된 적색 서브 픽셀 및 \"B\"가 기재된 청색 서브 픽셀)을 포함할 수 있다. 카메라의 픽 셀은 광을 수신하기 위해 카메라에 포함된 광 센서들 각각에 대응할 수 있다. 전자 장치는, 이 미지 내에서 시각적 객체의 위치 및 픽셀의 크기(예, 픽셀의 수평 크기(d1) 및/또는 수직 크기(d2))를 이용하여, 카메라 상의 상기 패턴의 위치를 식별할 수 있다. 이미지에 포함된 픽셀들의 개수(또는 단위)에 기반하여 식별된 거리를 이용하여, 전자 장치는, 카메라를 제1 영역 아 래로 이동하기 위해 요구되는 플렉서블 디스플레이 및/또는 하우징의 이동 거리 및/또는 이동 방향을 식별할 수 있다. 전자 장치는 상기 이동 거리 및/또는 상기 이동 방향에 기반하여 액추에이터(예, 도 2의 액추에이터)를 제어할 수 있다. 예를 들어, 전자 장치는 상기 이동 거리에 기반하여, 제1 하우징 파트에 대하여 제2 하우징 파트 를 이동하도록, 상기 액추에이터를 제어할 수 있다. 예를 들어, 전자 장치는 상기 이동 거리에 기반 하여, 액추에이터에 포함된 스텝 모터의 스텝 수를 결정할 수 있다. 액추에이터의 제어에 기반하여, 전자 장치 는 카메라를, 플렉서블 디스플레이의 제1 영역 아래로 이동할 수 있다. 카메라가 플 렉서블 디스플레이의 제1 영역 아래로 이동됨에 따라, 카메라로부터 획득되는 이미지(예, 이미 지) 내에서, 제2 영역에 대응하는 부분(예, 제2 부분)의 사이즈가 줄어들 거나, 또는 제거될 수 있다. 전자 장치가 스텝 모터에 기반하는 액추에이터를 포함하는 일 실시예에서, 이미지로부터 시각적 객체 를 식별한 전자 장치는 상기 스텝 모터의 제어에 의해 야기된 오차를 식별할 수 있다. 상기 오차를 보상하거나 또는 제거하기 위하여 전자 장치는 상기 스텝 모터를 제어하는데 이용되는 정보(예, 도 2의 액 추에이터 제어 정보)를 변경할 수 있다. 예를 들어, 전자 장치는 상기 스텝 모터로 입력되는 단위 펄스 당 이동 거리(예, 제1 하우징 파트에 대한 제2 하우징 파트의 이동 거리)를 변경할 수 있다. 예를 들어, 전자 장치는 상기 스텝 모터의 회전 수(또는 스텝 수) 당 시각적 객체의 이미지 내 위치(또는 이동 거리)에 기반하여, 상기 회전 수(또는 스텝 수) 및 제1 하우징 파트에 대한 제2 하우징 파 트의 이동 거리를 식별할 수 있다. 전자 장치는 식별된 상기 회전 수 및 상기 이동 거리 사이의 관계를, 액추에이터의 제어를 위해 이용하기 위한 정보(예, 도 2의 액추에이터 제어 정보)로써, 메모리(예, 도 2의 메모리) 내에 저장할 수 있다. 상술한 바와 같이, 일 실시예에 따른, 전자 장치는 플렉서블 디스플레이의 제1 영역을 나타내는 패턴을 이용하여, 카메라 및 상기 제1 영역을 정렬하기 위한 기능을 실행할 수 있다. 전자 장치 는 상기 패턴을 이용하여, 액추에이터를 제어하는데 이용되는 정보(예, 액추에이터에 포함된 스텝 모터를 제어하기 위한 정보)를 획득할 수 있다. 전자 장치는 카메라로부터 획득된 이미지를 이용하여 상기 기능을 실행하여, 카메라 및 제1 영역의 위치 관계를 식별하기 위한 추가적인 센서 없이, 카메 라 및 제1 영역을 정렬할 수 있다. 일 실시예에서, 카메라 상에서 이동 가능한 플렉서블 디스플레이를 포함하는 전자 장치는, 전자 장치 내 이물질(예, 먼지)에 의한 카메라의 손상을 방지하기 위한 구조를 가질 수 있다. 상기 구조 는, 셔터(또는 조리개)와 같이, 카메라의 렌즈를 적어도 부분적으로 덮는 구조를 포함할 수 있다. 상기 조리개는, 카메라가 활성화되기 이전에(또는 카메라의 상태가 비활성 상태에 있는 동안), 상기 렌즈 전체를 덮도록 제어될 수 있다. 도 3a의 동작 및/또는 도 3b의 동작과 같이, 카메라를 활성화 하기 위한 입력에 기반하여, 전자 장치는 상기 조리개가 완전히 개방되도록, 상기 조리개를 제어할 수 있 다. 이하에서는, 도 7 내지 도 8을 참고하여, 상기 이물질에 의한 카메라의 손상을 방지하기 위해 전자 장치에 포함된 구조의 일 예가 설명된다. 도 7은, 카메라와 관련된 스위퍼 구조를 포함하는 전자 장치의 일 예를 도시한다. 도 1a 내지 도 1e 및/또는 도 2의 전자 장치는 도 7을 참고하여 설명되는 스위퍼 구조를 포함할 수 있다. 도 7을 참고하면, 일 실시예에 따른, 전자 장치의 A-A' 라인에 대한 단면도가 도시된다. 전자 장치 는 PCB(printed circuit board) 및 메탈 레이어를 포함할 수 있다. 도 7을 참고하면, 전자 장치 에 포함된 카메라는, 플렉서블 디스플레이를 향하여 배치된 스위퍼 구조(sweeper structure)를 포함할 수 있다. 스위퍼 구조는, 브러쉬 및/또는 스펀지와 같이, 이물질의 제거 및/또 는 이동을 위한 물체를 포함할 수 있다. 스위퍼 구조는 카메라의 렌즈의 가장자리를 따라 위치될 수 있다. 제1 하우징 파트에 대하여 제2 하우징 파트가 이동되는 동안, 카메라에 대하여 플렉서블 디스플레이가 이동될 수 있다. 플렉서블 디스플레이가 카메라에 대하여 이동되는 동안, 스위퍼 구조에 의해, 플렉서블 디스플레이의 일 면(예, 플렉서블 디스플레이의 후 면)의 적어도 일부분 (예, 플렉서블 디스플레이의 제1 영역)의 이물질이 제거될 수 있다. 도 7을 참고하면, 카메라의 렌즈의 가장자리를 따라 위치된 스위퍼 구조에 의해, 상기 렌즈 및 플렉 서블 디스플레이의 제1 영역 사이에서, 적어도 부분적으로 밀폐된 공간이 형성될 수 있다. 스위퍼 구조에 의해, 상기 공간으로 먼지와 같은 이물질이 유입될 확률이 줄어들 수 있다. 일 실시예에 따른, 전 자 장치는 스위퍼 구조를 더 포함하여, 카메라로부터 획득되는 이미지 및/또는 비디오의 품질이 상기 이물질에 의해 감소되는 것을 방지할 수 있다. 도 8은, 카메라와 관련된 레일 구조를 포함하는 전자 장치의 일 예를 도시한다. 도 1a 내지 도 1e 및/또는 도 2의 전자 장치는 도 8을 참고하여 설명되는 레일 구조를 포함할 수 있다. 도 8을 참고하면, 일 실시예에 따른, 전자 장치는, 카메라에 대한 플렉서블 디스플레이의 이동 에 따라 이동 가능한, 레일을 포함할 수 있다. 예를 들어, 전자 장치가 도 1a 내지 도 1c의 상태들 (191, 192, 193) 및/또는 도 1d 내지 도 1e의 상태들(194, 195) 사이에서 스위칭됨에 따라, 레일 상에서 의 카메라의 위치가 변경될 수 있다. 전자 장치의 카메라는, 상기 레일에 대한 레일 후크 들(821, 822)을 포함할 수 있다. 레일은, 카메라를 적어도 부분적으로 감싸는 형태를 가질 수 있다. 예를 들어, 레일은, 이물질(예, 먼지)이 카메라 및 플렉서블 디스플레이 사이의 공간에 이동되 는 것을 방지하기 위한 형태를 가질 수 있다. 도 9는, 액추에이터를 제어하기 위한 정보를 획득하기 위해 수행되는 전자 장치의 동작의 일 예를 도시한 다. 도 1a 내지 도 1e, 도 2의 전자 장치는 도 9를 참고하여 설명되는 동작을 수행하여, 액추에이터(예,도 2의 액추에이터)의 제어를 위해 이용되는 정보를 획득할 수 있다. 상기 정보는, 상기 액추에이터에 포 함된 모터의 회전 각도 및 플렉서블 디스플레이의 이동 거리 사이의 관계를 포함할 수 있다. 예를 들어, 액추에이터가 스텝 모터를 포함하는 일 실시예에서, 상기 정보는, 상기 스텝 모터의 스텝 당 플렉서블 디스플레 이의 이동 거리를 나타낼 수 있다. 도 9를 참고하여 설명되는 동작은, 전자 장치의 생산 작업 동안 수행될 수 있다. 실시예가 이에 제한되는 것은 아니며, 도 9를 참고하여 설명되는 동작은, 자가 수리와 같이, 전자 장치의 사용자의 수리 작업 동안 수행될 수 있다. 전자 장치가 액추에이터를 제어하기 위한 정 보를 획득하는 것은, 도 9의 일 실시예에 제한되지 않는다. 예를 들어, 상기 정보는, 액추에이터 및/또는 전자 장치의 벤더에 의해 제공될 수 있다. 도 9를 참고하면, 지정된 거리(d) 만큼 전자 장치로부터 이격된 패널을 이용하여, 전자 장치는 액추에이터를 제어하기 위한 정보를 획득할 수 있다. 상기 패널은, 캘리브레이션 차트로 지칭될 수 있다. 상기 패널은, 카메라에 의해 인식 가능한 패턴을 포함할 수 있다. 비록 파선의 형태를 가지는 패턴이 예시적으로 도시되지만, 실시예가 이에 제한되는 것은 아니다. 도 9를 참고하면, 패널을 향하여 위치된 카메라를 제어하여, 전자 장치는 상기 패널에 대 한 제1 이미지를 획득할 수 있다. 카메라가 제1 지점(P1)에 위치된 동안, 전자 장치는 상기 제1 이 미지를 획득할 수 있다. 제1 이미지를 획득한 전자 장치는, 액추에이터를 제어하여, 카메라를 이동 할 수 있다. 패널로부터 지정된 거리(d) 만큼 이격된 도 9의 예시적인 상태 내에서, 액추에이터를 제어하 여 카메라를 제1 지점(P1)으로부터 제2 지점(P2)으로 이동한 이후, 전자 장치는 카메라로부터 제2 이미지를 획득할 수 있다. 전자 장치는, 지정된 회전 각도에 따라 액추에이터에 포함된 모터를 회전 하여, 제1 지점(P1)으로부터 제2 지점(P2)으로 카메라를 이동할 수 있다. 일 실시예에 따른, 전자 장치는 상기 제1 이미지 및 상기 제2 이미지 내에서, 패턴에 대응하는 시각 적 객체의 위치들을 비교하여, 상기 지정된 회전 각도에 대한 플렉서블 디스플레이 및/또는 카메라의 이동 거리 사이의 관계를 식별할 수 있다. 예를 들어, 제1 이미지 및 제2 이미지 내에서 상기 시각적 객체의 거리는, 카메라가 지정된 회전 각도를 따라 회전된 액추에이터에 의해 이동된 거리를 나타낼 수 있다. 상 기 회전 각도 및 상기 거리 사이의 관계를 이용하여, 전자 장치는 상기 관계를 나타내는 정보를 저장할 수 있다. 상기 정보를 이용하여, 전자 장치는 액추에이터를 제어하여, 타겟 상태(예, 롤-인 상태, 롤-아웃 상태, 및/또는 롤-인 상태 및 롤-아웃 상태 사이의 중간 상태)로 스위칭될 수 있다. 도 9를 참고하여 설명된, 액추에이터의 회전 각도 및 카메라의 이동 거리 사이의 관계를 나타내는 정보를 획득한 이후, 전자 장치가 상기 정보를 이용하여 액추에이터를 제어함에 따라, 상기 액추에이터가 열화될 수 있다. 상기 액추에이터의 열화는, 도 1a 내지 도 8을 참고하여 상술한 바와 같이, 플렉서블 디스플레이 및 카메라의 오정렬을 야기할 수 있다. 일 실시예에 따른, 전자 장치는 플렉서블 디스플레이 의 일 면(예, 카메라가 향하는 플렉서블 디스플레이의 일 면)에 형성된 패턴을 이용하여, 상기 오정렬을 식별할 수 있다. 상기 오정렬을 식별하는 것에 기반하여, 전자 장치는 액추에이터를 제어하여 플렉서블 디스플레이 및 카메라를 정렬할 수 있다. 상기 오정렬을 식별하는 것에 기반하여, 전자 장 치는 도 9를 참고하여 설명된 동작에 기반하여 획득되었던 정보를 변경하거나, 또는 업데이트할 수 있다. 이하에서는, 도 10 내지 도 12를 참고하여, 도 1a 내지 도 9의 전자 장치, 플렉서블 디스플레이 및 카메라의 일 실시예가 설명된다. 예를 들어, 도 10 내지 도 12의 전자 장치는 도 1a 내지 도 9의 전 자 장치의 일 예일 수 있다. 예를 들어, 도 10 내지 도 12의 카메라 모듈은, 도 1a 내지 도 9의 카 메라의 일 예일 수 있다. 예를 들어, 도 10 내지 도 12의 디스플레이 모듈은, 도 1a 내지 도 8의 플렉서블 디스플레이의 일 예일 수 있다. 도 10은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 10을 참조하 면, 네트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워크)를 통하 여 전자 장치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장치 또는 서버 중 적어도 하나와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 서버 를 통하여 전자 장치와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈, 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모 듈, 인터페이스, 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈,배터리, 통신 모듈, 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실 시예에서는, 전자 장치에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이 상의 다른 구성요소가 추가될 수 있다. 어떤 실시예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카 메라 모듈, 또는 안테나 모듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데 이터 처리 또는 연산을 수행할 수 있다. 일실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세 서는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발 성 메모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘 발성 메모리에 저장할 수 있다. 일실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처 리 장치 또는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로 세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능에 특화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일 부로서 구현될 수 있다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세 서를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로 세서와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센 서 모듈, 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일실시예 에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일실시예에 따 르면, 보조 프로세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능 모델이 수행 되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi-supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경 망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포 함할 수 있다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관 련된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도 로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일실시예에 따르면, 리시버는 스피커 와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레 이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로를 포함할 수 있다. 일실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또 는 상기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일실시 예에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰) 를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태)를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일실시예에 따르면, 인터페이스 는, 예를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥 터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일실시예에 따르면, 카메라 모듈은 하나 이 상의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일실시예에 따르면, 전력 관리 모 듈은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일실시예에 따르면, 배터 리는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버 ) 간의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접 (예: 유선) 통신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일실시예에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트 워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외 부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사 항을 지원할 수 있다. 일실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일실시예에 따르면, 안테나 모듈은 복수의 안테나 들(예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하 여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품(예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(1002, 또는 904) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일실시예에 따르면, 전자 장치에서 실행되는 동작들 의 전부 또는 일부는 외부의 전자 장치들(1002, 904, 또는 908) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터 의 요청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요 청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일 부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있 어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및 /또는 신경망을 이용한 지능형 서버일 수 있다. 일실시예에 따르면, 외부의 전자 장치 또는 서버는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능 형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 도 11은, 다양한 실시예들에 따른, 카메라 모듈을 예시하는 블럭도이다. 도 11을 참조하면, 카메 라 모듈은 렌즈 어셈블리, 플래쉬, 이미지 센서, 이미지 스태빌라이저, 메모리 (예: 버퍼 메모리), 또는 이미지 시그널 프로세서를 포함할 수 있다. 렌즈 어셈블리는 이미 지 촬영의 대상인 피사체로부터 방출되는 빛을 수집할 수 있다. 렌즈 어셈블리는 하나 또는 그 이상의 렌즈들을 포함할 수 있다. 일실시예에 따르면, 카메라 모듈은 복수의 렌즈 어셈블리들을 포함할 수 있다. 이런 경우, 카메라 모듈은, 예를 들면, 듀얼 카메라, 360도 카메라, 또는 구형 카메라(spherical camera)를 형성할 수 있다. 복수의 렌즈 어셈블리들 중 일부는 동일한 렌즈 속성(예: 화각, 초점 거리, 자동 초점, f 넘버(f number), 또는 광학 줌)을 갖거나, 또는 적어도 하나의 렌즈 어셈블리는 다른 렌즈 어셈블 리의 렌즈 속성들과 다른 하나 이상의 렌즈 속성들을 가질 수 있다. 렌즈 어셈블리는, 예를 들면, 광각 렌즈 또는 망원 렌즈를 포함할 수 있다. 플래쉬는 피사체로부터 방출 또는 반사되는 빛을 강화하기 위하여 사용되는 빛을 방출할 수 있다. 일실시 예에 따르면, 플래쉬는 하나 이상의 발광 다이오드들(예: RGB(red-green-blue) LED, white LED, infrared LED, 또는 ultraviolet LED), 또는 xenon lamp를 포함할 수 있다. 이미지 센서는 피사체로부터 방출 또는 반사되어 렌즈 어셈블리 를 통해 전달된 빛을 전기적인 신호로 변환함으로써, 상기 피사체에 대응하는 이미지를 획득할 수 있다. 일실시예에 따르면, 이미지 센서는, 예를 들면, RGB 센서, BW(black and white) 센서, IR 센서, 또는 UV 센서와 같이 속성이 다른 이미지 센서들 중 선택된 하나의 이미지 센서, 동 일한 속성을 갖는 복수의 이미지 센서들, 또는 다른 속성을 갖는 복수의 이미지 센서들을 포함할 수 있다. 이미 지 센서에 포함된 각각의 이미지 센서는, 예를 들면, CCD(charged coupled device) 센서 또는 CMOS(complementary metal oxide semiconductor) 센서를 이용하여 구현될 수 있다. 이미지 스태빌라이저는 카메라 모듈 또는 이를 포함하는 전자 장치의 움직임에 반응하여, 렌 즈 어셈블리에 포함된 적어도 하나의 렌즈 또는 이미지 센서를 특정한 방향으로 움직이거나 이미지 센서의 동작 특성을 제어(예: 리드 아웃(read-out) 타이밍을 조정 등)할 수 있다. 이는 촬영되는 이미지 에 대한 상기 움직임에 의한 부정적인 영향의 적어도 일부를 보상하게 해 준다. 일실시예에 따르면, 이미지 스 태빌라이저는, 일실시예에 따르면, 이미지 스태빌라이저은 카메라 모듈의 내부 또는 외부에 배치된 자이로 센서(미도시) 또는 가속도 센서(미도시)를 이용하여 카메라 모듈 또는 전자 장치의 그런 움직임을 감지할 수 있다. 일실시예에 따르면, 이미지 스태빌라이저는, 예를 들면, 광학식 이미지 스태빌라이저로 구현될 수 있다. 메모리는 이미지 센서을 통하여 획득된 이미지의 적어도 일부를 다음 이미지 처리 작업을 위하여 적어도 일시 저장할 수 있다. 예를 들어, 셔터에 따른 이미지 획득이 지연되거 나, 또는 복수의 이미지들이 고속으로 획득되는 경우, 획득된 원본 이미지(예: Bayer-patterned 이미지 또는 높 은 해상도의 이미지)는 메모리에 저장이 되고, 그에 대응하는 사본 이미지(예: 낮은 해상도의 이미지)는 디스플레이 모듈을 통하여 프리뷰될 수 있다. 이후, 지정된 조건이 만족되면(예: 사용자 입력 또는 시스 템 명령) 메모리에 저장되었던 원본 이미지의 적어도 일부가, 예를 들면, 이미지 시그널 프로세서 에 의해 획득되어 처리될 수 있다. 일실시예에 따르면, 메모리는 메모리의 적어도 일부로, 또는 이 와는 독립적으로 운영되는 별도의 메모리로 구성될 수 있다. 이미지 시그널 프로세서는 이미지 센서을 통하여 획득된 이미지 또는 메모리에 저장된 이미 지에 대하여 하나 이상의 이미지 처리들을 수행할 수 있다. 상기 하나 이상의 이미지 처리들은, 예를 들면, 깊 이 지도(depth map) 생성, 3차원 모델링, 파노라마 생성, 특징점 추출, 이미지 합성, 또는 이미지 보상(예: 노 이즈 감소, 해상도 조정, 밝기 조정, 블러링(blurring), 샤프닝(sharpening), 또는 소프트닝(softening)을 포 함할 수 있다. 추가적으로 또는 대체적으로, 이미지 시그널 프로세서는 카메라 모듈에 포함된 구성 요소들 중 적어도 하나(예: 이미지 센서)에 대한 제어(예: 노출 시간 제어, 또는 리드 아웃 타이밍 제어 등)를 수행할 수 있다. 이미지 시그널 프로세서에 의해 처리된 이미지는 추가 처리를 위하여 메모리 에 다시 저장 되거나 카메라 모듈의 외부 구성 요소(예: 메모리, 디스플레이 모듈, 전 자 장치, 전자 장치, 또는 서버)로 제공될 수 있다. 일실시예에 따르면, 이미지 시그널 프로 세서는 프로세서의 적어도 일부로 구성되거나, 프로세서와 독립적으로 운영되는 별도의 프로 세서로 구성될 수 있다. 이미지 시그널 프로세서이 프로세서과 별도의 프로세서로 구성된 경우, 이 미지 시그널 프로세서에 의해 처리된 적어도 하나의 이미지는 프로세서에 의하여 그대로 또는 추가 의 이미지 처리를 거친 후 디스플레이 모듈를 통해 표시될 수 있다. 일실시예에 따르면, 전자 장치는 각각 다른 속성 또는 기능을 가진 복수의 카메라 모듈들을 포함할 수 있다. 이런 경우, 예를 들면, 상기 복수의 카메라 모듈들 중 적어도 하나는 광각 카메라이고, 적어도 다른 하나는 망원 카메라일 수 있다. 유사하게, 상기 복수의 카메라 모듈들 중 적어도 하나는 전면 카메 라이고, 적어도 다른 하나는 후면 카메라일 수 있다. 도 12는, 다양한 실시예들에 따른, 디스플레이 모듈의 블록도이다. 도 12를 참조하면, 디스플레이 모듈는 디스플레이, 및 이를 제어하기 위한 디스플레이 드라이버 IC(DDI)를 포함할 수 있다. DDI는 인터페이스 모듈, 메모리(예: 버퍼 메모리), 이미지 처리 모듈, 또는 맵핑 모듈 을 포함할 수 있다. DDI은, 예를 들면, 영상 데이터, 또는 상기 영상 데이터를 제어하기 위한 명령 에 대응하는 영상 제어 신호를 포함하는 영상 정보를 인터페이스 모듈을 통해 전자 장치 901의 다른 구성 요소로부터 수신할 수 있다. 예를 들면, 일실시예에 따르면, 영상 정보는 프로세서(예: 메인 프로세서 (예: 어플리케이션 프로세서) 또는 메인 프로세서의 기능과 독립적으로 운영되는 보조 프로세서 (예: 그래픽 처리 장치)로부터 수신될 수 있다. DDI는 터치 회로 또는 센서 모듈 등과 상기 인터페이스 모듈을 통하여 커뮤니케이션할 수 있다. 또한, DDI는 상기 수신된 영상 정보 중 적어도 일부를 메모리에, 예를 들면, 프레임 단위로 저장할 수 있다. 이미지 처리 모듈은, 예를 들 면, 상기 영상 데이터의 적어도 일부를 상기 영상 데이터의 특성 또는 디스플레이의 특성에 적어도 기반 하여 전처리 또는 후처리(예: 해상도, 밝기, 또는 크기 조정)를 수행할 수 있다. 맵핑 모듈은 이미지 처 리 모듈를 통해 전처리 또는 후처리된 상기 영상 데이터에 대응하는 전압 값 또는 전류 값을 생성할 수 있다. 일실시예에 따르면, 전압 값 또는 전류 값의 생성은 예를 들면, 디스플레이의 픽셀들의 속성(예: 픽셀들의 배열(RGB stripe 또는 pentile 구조), 또는 서브 픽셀들 각각의 크기)에 적어도 일부 기반하여 수행될 수 있다. 디스플레이의 적어도 일부 픽셀들은, 예를 들면, 상기 전압 값 또는 전류 값에 적어도 일부 기 반하여 구동됨으로써 상기 영상 데이터에 대응하는 시각적 정보(예: 텍스트, 이미지, 또는 아이콘)가 디스플레 이를 통해 표시될 수 있다. 일실시예에 따르면, 디스플레이 모듈는 터치 회로를 더 포함할 수 있다. 터치 회로는 터치 센서 및 이를 제어하기 위한 터치 센서 IC를 포함할 수 있다. 터치 센서 IC는, 예를 들면, 디스플레이의 특정 위치에 대한 터치 입력 또는 호버링 입력을 감지하기 위해 터치 센서를 제어할 수 있다. 예를 들면, 터치 센서 IC는 디스플레이의 특정 위치에 대한 신호(예: 전압, 광량, 저항, 또는 전하량)의 변화를 측정함으로써 터치 입력 또는 호버링 입력을 감지할 수 있다. 터치 센서 IC는 감 지된 터치 입력 또는 호버링 입력에 관한 정보(예: 위치, 면적, 압력, 또는 시간)를 프로세서 에 제공할 수 있다. 일실시예에 따르면, 터치 회로의 적어도 일부(예: 터치 센서 IC)는 디스플레이 드라이버 IC, 또는 디스플레이의 일부로, 또는 디스플레이 모듈의 외부에 배치된 다른 구성요소(예: 보조 프로세서)의 일부로 포함될 수 있다. 일실시예에 따르면, 디스플레이 모듈는 센서 모듈의 적어도 하나의 센서(예: 지문 센서, 홍채 센서, 압력 센서 또는 조도 센서), 또는 이에 대한 제어 회로를 더 포함할 수 있다. 이 경우, 상기 적어도 하나 의 센서 또는 이에 대한 제어 회로는 디스플레이 모듈의 일부(예: 디스플레이 또는 DDI) 또 는 터치 회로의 일부에 임베디드될 수 있다. 예를 들면, 디스플레이 모듈에 임베디드된 센서 모듈 이 생체 센서(예: 지문 센서)를 포함할 경우, 상기 생체 센서는 디스플레이의 일부 영역을 통해 터 치 입력과 연관된 생체 정보(예: 지문 이미지)를 획득할 수 있다. 다른 예를 들면, 디스플레이 모듈에 임 베디드된 센서 모듈이 압력 센서를 포함할 경우, 상기 압력 센서는 디스플레이의 일부 또는 전체 영역을 통해 터치 입력과 연관된 압력 정보를 획득할 수 있다. 일실시예에 따르면, 터치 센서 또는 센서 모듈은 디스플레이의 픽셀 레이어의 픽셀들 사이에, 또는 상기 픽셀 레이어의 위에 또는 아래에 배 치될 수 있다. 본 문서에 개시된 다양한 실시예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되 지 않는다. 본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\",\"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위 해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적 으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 다양한 실시예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함 할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부 가 될 수 있다. 예를 들면, 일실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형 태로 구현될 수 있다. 본 문서의 다양한 실시예들은 기기(machine)(예: 전자 장치(#01)) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리(#36) 또는 외장 메모리(#38))에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어 (예: 프로그램(#40))로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치(#01))의 프로세서(예: 프로세서 (#20))는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것 을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형 태로 제공될 수 있다. 여기서, '비일시적'은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전자 기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경우 와 임시적으로 저장되는 경우를 구분하지 않는다. 일실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory(CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어쪠)를 통해 또는 두 개의 사용자 장치들(예: 스마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨 터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같 은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상 의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따르면, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동 작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다. 일 실시예에서, 플렉서블 디스플레이에 대한 카메라의 위치를 조절하는 방안이 요구될 수 있다. 상술한 바와 같은, 일 실시예에 따른, 전자 장치(electronic device)(예, 도 1a 내지 도 1e, 도 2 내지 도 9의 전자 장치 , 도 10 내지 도 12의 전자 장치)는, 축소 위치 및 연장 위치 사이에서 이동 가능하도록 제1 하우징 파트(예, 도 1a 내지 도 1e, 도 2 내지 도 9의 제1 하우징 파트)와 맞물리도록 구성된 제2 하우징 파트(예, 도 1a 내지 도 1e, 도 2 내지 도 9의 제2 하우징 파트)를 포함하는 하우징(예, 도 1a 내지 도 1e, 도 2 내지 도 9의 하우징), 상기 제1 하우징 파트 및 상기 제2 하우징 파트에 결합된 플렉서블 디스플 레이(예, 도 1a 내지 도 1e, 도 2 내지 도 9의 플렉서블 디스플레이)를 포함할 수 있다. 상기 하우징의 전 면에서 보이는 상기 플렉서블 디스플레이의 영역의 사이즈는 상기 하우징이 상기 축소 위치 및 상기 연장 위 치 사이에서 이동됨에 따라 변경될 수 있다. 상기 전자 장치는 상기 제1 하우징 파트에 대하여 상기 제2 하우 징 파트를 이동하도록 구성된 상기 하우징 내의 액추에이터(예, 도 2의 액추에이터), 상기 플렉서블 디스플레이의 활성 영역 아래에 위치된 상기 하우징 내의 카메라(예, 도 1a 내지 도 1e, 도 2 내지 도 9의 카메라 ) 및 상기 하우징 내의 프로세서(예, 도 2의 프로세서)를 포함할 수 있다. 상기 활성 영역은, 픽셀 들의 밀도가 제1 밀도인 제1 영역(예, 도 1a 내지 도 1e, 도 2 내지 도 9의 제1 영역) 및 상기 제1 영역을 감싸고, 상기 밀도가 상기 제1 밀도보다 높은 제2 밀도인 제2 영역(예, 도 1a 내지 도 1e, 도 2 내지 도 9의 제 2영역)을 포함할 수 있다. 상기 카메라가 향하는 상기 플렉서블 디스플레이의 후 면은, 상기 제1 영역과 상기 제2 영역 사이의 경계를 따라 배치된 패턴(예, 도 5의 패턴들(540, 542, 544))을 포함할 수 있다. 상기 프로세서는, 상기 카메라를 활성화하는 입력에 응답하여, 상기 카메라를 통해 이미지(예, 도 6의 이미지) 를 획득하도록, 구성될 수 있다. 상기 프로세서는, 상기 패턴에 대응하는 시각적 객체(예, 도 6의 시각적 객체 )가 상기 이미지 내에 포함되는지 여부를 식별하도록, 구성될 수 있다. 상기 프로세서는, 상기 시각적 객 체를 포함하는 상기 이미지에 기반하여, 상기 제1 영역에 대하여 상기 카메라를 정렬하기 위하여 상기 액추에이 터를 제어하도록, 구성될 수 있다. 예를 들어, 상기 프로세서는, 상기 액추에이터에 포함된 하나 이상의 모터들의 회전 각도들 및 상기 카메라에 대한 상기 플렉서블 디스플레이의 이동 거리 사이의 관계에 기반하여, 상기 제1 영역에 대하여 상기 카메라를 정렬하기 위하여 상기 하나 이상의 모터들로 송신될, 제어 신호를 획득하도록, 구성될 수 있다. 예를 들어, 상기 전자 장치는 상기 하나 이상의 모터들의 상기 회전 각도들 및 상기 이동 거리 사이의 관계를 나타내는 정보를 저장하도록 구성된 메모리(예, 도 2의 메모리)를 더 포함하도록, 구성될 수 있다. 상기 프로세서는, 상기 제1 영역에 대하여 상기 카메라를 정렬하는 것에 기반하여, 상기 저장된 정보를 변경하도록, 구성될 수 있다. 예를 들어, 상기 프로세서는, 상기 제1 영역에 대하여 상기 카메라를 정렬하기 위하여, 상기 액추에이터로 펄스 수(pulse numbers)에 기반하여 상기 플렉서블 디스플레이의 이동 거리를 나타내는 펄스 신호를 포함하는 상기 제어 신호를, 상기 액추에이터로 송신하도록, 구성될 수 있다. 예를 들어, 상기 프로세서는, 상기 액추에이터를 제어하는 것에 기반하여, 상기 카메라가 상기 제1 영역 아래로 이동된 이후, 상기 카메라를 이용하여 상기 입력에 대한 응답으로 상기 플렉서블 디스플레이에 표시될 다른 이 미지를 획득하도록, 구성될 수 있다. 예를 들어, 상기 제1 영역은, 상기 전 면을 바라봤을 시, 상기 픽셀들 사이에 위치된 복수의 개구들(예, 도 4의 복수의 개구들)을 포함하는 메탈 레이어(예, 도 4의 메탈 레이어)를 포함하도록, 구성될 수 있다. 상기 제2 영역은, 상기 전 면을 바라봤을 시, 상기 픽셀들 사이에서 발생되는 광의 반사를 줄이기 위한 차광 레 이어(예, 도 5의 차광 레이어)를 포함하도록, 구성될 수 있다. 예를 들어, 상기 프로세서는, 상기 제1 영역의 상기 복수의 개구들을 통과하여 상기 카메라로 도달된 광을 표현 하는 상기 이미지를 획득하도록, 구성될 수 있다. 예를 들어, 상기 프로세서는, 상기 이미지 내 상기 시각적 객체에 기반하여, 상기 전 면을 바라봤을 시, 상기 카메라의 적어도 일부분이 상기 제2 영역과 중첩되는 것으로 결정하도록, 구성될 수 있다. 상기 프로세서는, 상기 제2 영역과 중첩되는 상기 카메라의 적어도 일부분의 사이즈를 줄이기 위하여, 상기 액추에이터를 제어하 도록, 구성될 수 있다. 상술한 바와 같은, 일 실시예에 따른, 전자 장치의 방법은, 상기 전자 장치의 플렉서블 디스플레이의 활성 영역 아래에 위치된 상기 전자 장치의 카메라를 활성화하는 입력에 응답하여, 상기 카메라를 통해 이미지를 획득하는 동작(예, 도 3a의 동작)을 포함할 수 있다. 상기 방법은, 상기 카메라가 향하는 상기 플렉서블 디스플레 이의 후 면에 형성된 패턴에 대응하는 시각적 객체가 상기 이미지 내에 포함되는지 여부를 식별하는 동작(예, 도 3a의 동작)을 포함할 수 있다. 상기 방법은, 상기 시각적 객체를 포함하는 상기 이미지에 기반하여, 상기 플렉서블 디스플레이에 대하여 상기 카메라를 정렬하기 위하여 상기 액추에이터를 제어하는 동작(예, 도 3a 내지 도 3b의 동작)을 포함할 수 있다. 예를 들어, 상기 제어하는 동작은, 상기 액추에이터에 포함된 하나 이상의 모터들의 회전 각도들 및 상기 카메 라에 대한 상기 플렉서블 디스플레이의 이동 거리 사이의 관계에 기반하여, 상기 플렉서블 디스플레이에 대하여 상기 카메라를 정렬하기 위하여 상기 하나 이상의 모터들로 송신될, 제어 신호를 획득하는 동작을 포함할 수 있 다.예를 들어, 상기 제어하는 동작은, 상기 플렉서블 디스플레이에 대하여 상기 카메라를 정렬하는 것에 기반하여, 상기 관계를 나타내는 정보를 변경하는 동작을 포함할 수 있다. 예를 들어, 상기 제어하는 동작은, 상기 카메라를 정렬하기 위하여, 상기 액추에이터로 펄스 수에 기반하여 상 기 플렉서블 디스플레이의 이동 거리를 나타내는 펄스 신호를 포함하는 제어 신호를 송신하는 동작을 포함할 수 있다. 예를 들어, 상기 방법은, 상기 액추에이터를 제어하는 것에 기반하여, 상기 카메라가 상기 제1 영역 아래로 이 동된 이후, 상기 카메라를 이용하여 상기 입력에 대한 응답으로 상기 플렉서블 디스플레이에 표시될 다른 이미 지를 획득하는 동작을 더 포함할 수 있다. 예를 들어, 상기 방법은, 상기 카메라가 향하는 상기 플렉서블 디스플레이의 상기 후 면에서, 상기 플렉서블 디 스플레이의 픽셀들의 밀도에 의해 구분되는 상기 플렉서블 디스플레이의 제1 영역 및 제2 영역 사이의 경계를 따라 배치된 패턴을 포함할 수 있다. 예를 들어, 상기 식별하는 동작은, 상기 이미지 내 상기 시각적 객체에 기반하여, 상기 플렉서블 디스플레이의 전 면을 바라봤을 시, 상기 카메라의 적어도 일부분이 상기 제2 영역과 중첩되는 것으로 결정하는 동작을 포함 할 수 있다. 상기 제어하는 동작은, 상기 제2 영역과 중첩되는 상기 카메라의 적어도 일부분의 사이즈를 줄이 기 위하여, 상기 액추에이터를 제어하는 동작을 포함할 수 있다. 상술한 바와 같은, 일 실시예에 따른, 전자 장치(electronic device)(예, 도 1a 내지 도 1e, 도 2 내지 도 9의 전자 장치, 도 10 내지 도 12의 전자 장치)는, 하우징(예, 도 1a 내지 도 1e, 도 2 내지 도 9의 하 우징), 상기 하우징의 일 면을 통해 적어도 부분적으로 외부로 노출된 플렉서블 디스플레이(예, 도 1a 내 지 도 1e, 도 2 내지 도 9의 플렉서블 디스플레이), 상기 플렉서블 디스플레이의 일 면을 향하도록 위치된, 상기 하우징 내의 카메라(예, 도 1a 내지 도 1e, 도 2 내지 도 9의 카메라), 상기 카메라에 대한 상기 플렉서블 디스플레이의 위치를 조절하기 위한 액추에이터(예, 도 2의 액추에이터) 및 프로세서(예, 도 2의 프로세서)를 포함할 수 있다. 상기 프로세서는, 상기 카메라를 이용하여 이미지(예, 도 6의 이미 지)를 획득하도록, 구성될 수 있다. 상기 프로세서는, 픽셀들의 밀도에 의해 구분되는 상기 플렉서블 디 스플레이의 제1 영역(예, 도 1a 내지 도 1e, 도 2 내지 도 9의 제1 영역) 및 제2 영역(예, 도 1a 내지 도 1e, 도 2 내지 도 9의 제2영역)의 경계와 관련된 시각적 객체(예, 도 6의 시각적 객체)가 상기 이미 지 내에 포함되는지 여부를 식별하도록, 구성될 수 있다. 상기 프로세서는, 상기 시각적 객체를 포함하는 상기 이미지에 기반하여, 상기 위치를 조절하기 위하여 상기 액추에이터를 제어하도록, 구성될 수 있다. 예를 들어, 상기 플렉서블 디스플레이는, 상기 카메라가 향하는 상기 플렉서블 디스플레이의 일 면에서, 상기 제1 영역 및 상기 제2 영역의 상기 경계를 따라 형성된, 패턴을 포함하도록, 구성될 수 있다. 예를 들어, 상기 프로세서는, 상기 패턴의 적어도 일부분에 대응하는 상기 시각적 객체를 식별하는 것에 기반하 여, 상기 이미지 내 상기 시각적 객체의 위치를 이용하여 상기 액추에이터를 제어하도록, 구성될 수 있다. 예를 들어, 상기 플렉서블 디스플레이는, 제1 밀도에 기반하여 위치된 픽셀들을 포함하는 상기 제1 영역 및 상 기 제1 밀도를 초과하는 제2 밀도에 기반하여 위치된 픽셀들을 포함하는 상기 제2 영역을 포함하도록, 구성될 수 있다. 예를 들어, 상기 프로세서는, 상기 제1 영역 및 상기 제2 영역 중에서 상기 제1 영역 아래로 상기 카메라를 이 동하기 위하여, 상기 액추에이터를 제어하도록, 구성될 수 있다. 상술한 바와 같은, 일 실시예에 따른, 전자 장치의 방법은, 상기 전자 장치의 플렉서블 디스플레이의 일 면을 향하도록 위치된 카메라를 이용하여 이미지를 획득하는 동작을 포함할 수 있다. 상기 방법은, 픽셀들의 밀도에 의해 구분되는 상기 플렉서블 디스플레이의 제1 영역 및 제2 영역의 경계와 관련된 시각적 객체가 상기 이미지 내에 포함되는지 여부를 식별하는 동작을 포함할 수 있다. 상기 방법은, 상기 시각적 객체를 포함하는 상기 이 미지에 기반하여, 상기 위치를 조절하기 위하여 상기 액추에이터를 제어하는 동작을 포함할 수 있다. 예를 들어, 상기 식별하는 동작은, 상기 카메라가 향하는 상기 플렉서블 디스플레이의 상기 일 면에 형성되고, 상기 제1 영역 및 상기 제2 영역의 경계를 따라 형성된, 패턴에 대응하는 시각적 객체를 식별하는 동작을 포함할 수 있다. 예를 들어, 상기 제어하는 동작은, 상기 패턴의 적어도 일부분에 대응하는 상기 시각적 객체를 식별하는 것에 기반하여, 상기 이미지 내 상기 시각적 객체의 위치를 이용하여 상기 액추에이터를 제어하는 동작을 포함할 수 있다. 예를 들어, 상기 제어하는 동작은, 제1 밀도에 기반하여 위치된 픽셀들을 포함하는 상기 제1 영역 및 상기 제1 밀도를 초과하는 제2 밀도에 기반하여 위치된 픽셀들을 포함하는 상기 제2 영역 중에서, 상기 제1 영역 아래로 상기 카메라를 이동하기 위하여, 상기 액추에이터를 제어하는 동작을 포함할 수 있다. 이상에서 설명된 장치는 하드웨어 구성요소, 소프트웨어 구성요소, 및/또는 하드웨어 구성요소 및 소프트웨어 구성요소의 조합으로 구현될 수 있다. 예를 들어, 실시예들에서 설명된 장치 및 구성요소는, 프로세서, 콘트롤 러, ALU(arithmetic logic unit), 디지털 신호 프로세서(digital signal processor), 마이크로컴퓨터, FPGA(field programmable gate array), PLU(programmable logic unit), 마이크로프로세서, 또는 명령 (instruction)을 실행하고 응답할 수 있는 다른 어떠한 장치와 같이, 하나 이상의 범용 컴퓨터 또는 특수 목적 컴퓨터를 이용하여 구현될 수 있다. 처리 장치는 운영 체제(OS) 및 상기 운영 체제 상에서 수행되는 하나 이상 의 소프트웨어 어플리케이션을 수행할 수 있다. 또한, 처리 장치는 소프트웨어의 실행에 응답하여, 데이터를 접 근, 저장, 조작, 처리 및 생성할 수도 있다. 이해의 편의를 위하여, 처리 장치는 하나가 사용되는 것으로 설명"}
{"patent_id": "10-2023-0089261", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "된 경우도 있지만, 해당 기술분야에서 통상의 지식을 가진 자는, 처리 장치가 복수 개의 처리 요소(processing element) 및/또는 복수 유형의 처리 요소를 포함할 수 있음을 알 수 있다. 예를 들어, 처리 장치는 복수 개의 프로세서 또는 하나의 프로세서 및 하나의 콘트롤러를 포함할 수 있다. 또한, 병렬 프로세서(parallel processor)와 같은, 다른 처리 구성(processing configuration)도 가능하다. 소프트웨어는 컴퓨터 프로그램(computer program), 코드(code), 명령(instruction), 또는 이들 중 하나 이상의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결합적으로 (collectively) 처리 장치를 명령할 수 있다. 소프트웨어 및/또는 데이터는, 처리 장치에 의하여 해석되거나 처 리 장치에 명령 또는 데이터를 제공하기 위하여, 어떤 유형의 기계, 구성요소(component), 물리적 장치, 컴퓨터 저장 매체 또는 장치에 구체화(embody)될 수 있다. 소프트웨어는 네트워크로 연결된 컴퓨터 시스템 상에 분산되 어서, 분산된 방법으로 저장되거나 실행될 수도 있다. 소프트웨어 및 데이터는 하나 이상의 컴퓨터 판독 가능 기록 매체에 저장될 수 있다. 실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 이때, 매체는 컴퓨터로 실행 가능한 프로그램을 계속 저장하거나, 실행 또는 다운로드를 위해 임시 저장하는 것일 수도 있다. 또한, 매체는 단일 또는 수 개의 하드웨어가 결합된 형태의 다 양한 기록수단 또는 저장수단일 수 있는데, 어떤 컴퓨터 시스템에 직접 접속되는 매체에 한정되지 않고, 네트워 크 상에 분산 존재하는 것일 수도 있다. 매체의 예시로는, 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체, CD-ROM 및 DVD와 같은 광기록 매체, 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체 (magneto-optical medium), 및 ROM, RAM, 플래시 메모리 등을 포함하여 프로그램 명령어가 저장되도록 구성된 것이 있을 수 있다. 또한, 다른 매체의 예시로, 어플리케이션을 유통하는 앱 스토어나 기타 다양한 소프트웨어 를 공급 내지 유통하는 사이트, 서버 등에서 관리하는 기록매체 내지 저장매체도 들 수 있다."}
{"patent_id": "10-2023-0089261", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이상과 같이 실시예들이 비록 한정된 실시예와 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가 진 자라면 상기의 기재로부터 다양한 수정 및 변형이 가능하다. 예를 들어, 설명된 기술들이 설명된 방법과 다 른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태 로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다. 그러므로, 다른 구현들, 다른 실시예들 및 특허청구범위와 균등한 것들도 후술하는 특허청구범위의 범위에 속한 다. 도면 도면1a 도면1b 도면1c 도면1d 도면1e 도면2 도면3a 도면3b 도면3c 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12"}
{"patent_id": "10-2023-0089261", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1a 내지 도 1e는, 플렉서블 디스플레이 및 카메라를 포함하는 전자 장치의 일 실시예를 도시한다. 도 2는, 일 실시예에 따른, 전자 장치의 블록도의 일 예를 도시한다. 도 3a 내지 도 3c는, 일 실시예에 따른, 전자 장치의 흐름도의 일 예를 도시한다. 도 4는, 카메라와 중첩된 플렉서블 디스플레이의 일부분의 구조의 일 예를 도시한다. 도 5는, 카메라가 향하는 플렉서블 디스플레이의 일 면에 형성된 패턴의 일 예를 도시한다. 도 6은, 카메라 및 플렉서블 디스플레이를 정렬하기 위한 전자 장치의 동작의 일 예를 도시한다. 도 7은, 카메라와 관련된 스위퍼 구조를 포함하는 전자 장치의 일 예를 도시한다. 도 8은, 카메라와 관련된 레일 구조를 포함하는 전자 장치의 일 예를 도시한다. 도 9는, 액추에이터를 제어하기 위한 정보를 획득하기 위해 수행되는 전자 장치의 동작의 일 예를 도시한다. 도 10은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 11은, 다양한 실시예들에 따른, 카메라 모듈을 예시하는 블럭도이다. 도 12는, 다양한 실시예들에 따른, 디스플레이 모듈의 블록도이다."}
