{"patent_id": "10-2023-0106754", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0025855", "출원번호": "10-2023-0106754", "발명의 명칭": "비전 기반의 수액 잔량 측정 장치 및 방법", "출원인": "건국대학교 글로컬산학협력단", "발명자": "백우진"}}
{"patent_id": "10-2023-0106754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "비전 기반의 수액 잔량 측정 방법에 있어서,분석 대상 수액이 수용된 타겟 용기를 촬영한 타겟 이미지를 획득하는 단계; 및복수의 수액 이미지를 포함하는 학습 데이터를 이용하여 미리 구축된 이미지 분석 알고리즘에 상기 타겟 이미지를 입력하여 상기 타겟 이미지로부터 상기 분석 대상 수액과 연계된 객체 영역을 식별하는 단계,를 포함하는, 방법."}
{"patent_id": "10-2023-0106754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 객체 영역을 이용하여 상기 분석 대상 수액의 용량 정보를 도출하는 단계,를 더 포함하는 것인, 방법."}
{"patent_id": "10-2023-0106754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 객체 영역은,상기 타겟 용기에 대응하는 제1객체 영역 및 상기 제1객체 영역 내부에서 상기 타겟 용기에 수용된 상기 분석대상 수액이 차지하는 영역에 대응하는 제2객체 영역을 포함하는 것인, 방법."}
{"patent_id": "10-2023-0106754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 학습 데이터는,소정의 물질이 용기 내에 수용된 상태를 촬영한 복수의 이미지를 포함하고, 상기 물질의 유형에 따라 상기 복수의 이미지 각각에 대하여 라벨 정보가 할당된 제1데이터 셋을 포함하는 것인, 방법."}
{"patent_id": "10-2023-0106754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 학습 데이터는,각각이 액체 상태의 수액을 수용하는 단일 수액 용기를 정면으로 바라본 방향으로 촬영한 상기 복수의 수액 이미지를 포함하는 제2데이터 셋을 포함하는 것인, 방법."}
{"patent_id": "10-2023-0106754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 제2데이터 셋은 상기 복수의 수액 이미지 각각에 대한 촬영 각도 변화, 촬영 거리 변화, 화질 변화 및 가려짐 물체 배치 중 적어도 하나를 포함하는 인식 저해 요소를 적용한 이미지를 포함하는 것인, 방법."}
{"patent_id": "10-2023-0106754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 이미지 분석 알고리즘은 상기 타겟 이미지로부터 미리 설정된 객체 유형에 대응하는 상기 객체 영역 각각의 위치 정보 및 경계 정보를 도출하는 이미지 세그멘테이션(Image Segmentation)을 수행하도록 학습되는 것인,공개특허 10-2025-0025855-3-방법."}
{"patent_id": "10-2023-0106754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 이미지 분석 알고리즘은 FCN(Fully Convolution Network) 기반의 인공지능 모델인 것을 특징으로 하는, 방법."}
{"patent_id": "10-2023-0106754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "비전 기반의 수액 잔량 측정 장치에 있어서,분석 대상 수액이 수용된 타겟 용기를 촬영한 타겟 이미지를 획득하는 수집부; 및복수의 수액 이미지를 포함하는 학습 데이터를 이용하여 미리 구축된 이미지 분석 알고리즘에 상기 타겟 이미지를 입력하여 상기 타겟 이미지로부터 상기 분석 대상 수액과 연계된 객체 영역을 식별하는 객체 분석부,를 포함하는, 장치."}
{"patent_id": "10-2023-0106754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 객체 영역을 이용하여 상기 분석 대상 수액의 용량 정보를 도출하는 연산부,를 더 포함하는 것인, 장치."}
{"patent_id": "10-2023-0106754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항에 있어서,상기 객체 영역은,상기 타겟 용기에 대응하는 제1객체 영역 및 상기 제1객체 영역 내부에서 상기 타겟 용기에 수용된 상기 분석대상 수액이 차지하는 영역에 대응하는 제2객체 영역을 포함하는 것인, 장치."}
{"patent_id": "10-2023-0106754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제9항에 있어서,상기 학습 데이터는,소정의 물질이 용기 내에 수용된 상태를 촬영한 복수의 이미지를 포함하고, 상기 물질의 유형에 따라 상기 복수의 이미지 각각에 대하여 라벨 정보가 할당된 제1데이터 셋을 포함하는 것인, 장치."}
{"patent_id": "10-2023-0106754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제9항에 있어서,상기 학습 데이터는,각각이 액체 상태의 수액을 수용하는 단일 수액 용기를 정면으로 바라본 방향으로 촬영한 상기 복수의 수액 이미지를 포함하는 제2데이터 셋을 포함하는 것인, 장치."}
{"patent_id": "10-2023-0106754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 제2데이터 셋은 상기 복수의 수액 이미지 각각에 대한 촬영 각도 변화, 촬영 거리 변화, 화질 변화 및 가려짐 물체 배치 중 적어도 하나를 포함하는 인식 저해 요소를 적용한 이미지를 포함하는 것인, 장치."}
{"patent_id": "10-2023-0106754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제9항에 있어서,공개특허 10-2025-0025855-4-상기 이미지 분석 알고리즘은 상기 타겟 이미지로부터 미리 설정된 객체 유형에 대응하는 상기 객체 영역 각각의 위치 정보 및 경계 정보를 도출하는 이미지 세그멘테이션(Image Segmentation)을 수행하도록 학습된FCN(Fully Convolution Network) 기반의 인공지능 모델인 것을 특징으로 하는, 장치."}
{"patent_id": "10-2023-0106754", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "비전 기반의 수액 잔량 측정 장치 및 방법이 개시되며, 본원의 일 실시예에 따른 비전 기반의 수액 잔량 측정 방 법은, 분석 대상 수액이 수용된 타겟 용기를 촬영한 타겟 이미지를 획득하는 단계 및 복수의 수액 이미지를 포함 하는 학습 데이터를 이용하여 미리 구축된 이미지 분석 알고리즘에 상기 타겟 이미지를 입력하여 상기 타겟 이미 지로부터 상기 분석 대상 수액과 연계된 객체 영역을 식별하는 단계를 포함할 수 있다."}
{"patent_id": "10-2023-0106754", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본원은 비전 기반의 수액 잔량 측정 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2023-0106754", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "수액은 인체 내부의 수분과 전해질 농도를 유지하기 위해 사용되는 액체를 지칭하고, 수액백은 그 액체가 담긴 용기를 지칭한다. 수액은 종류에 따라 다양한 성분으로 구성되어 있으며 인체의 수분과 전해질 농도를 유지하는 것 외에도 환자에게 영양소를 공급하거나 약물을 투여하는 데에도 사용된다. 일반적으로 생리식염수라고 부르는 염화나트륨(NaCl)용액이 가장 많이 사용되는데, 이 외에도 환자의 상태와 특 성에 따라 다양한 성분을 포함한 수액을 사용한다. 주로 정맥주사를 통해 체내에 주입되는데, 주입되는 용량과 속도는 환자의 상태와 의사의 처방에 따라 조절되며, 주로 수액 세트에 포함되어 있는 밸브형 조절기를 간호사 가 조작하여 사용한다. 대부분의 경우 의사의 처방과 간호사의 조작 및 관찰 하에 안전하게 사용되지만, 잘못된 용량 투여, 잘못된 시 간과 빈도, 환자 혼동, 누락, 약품 혼동, 주사부위 침윤 등으로 인한 투약 사고가 발생할 수 있다. 특히, 의료 진의 투약 실수로 인한 안전사고 발생 빈도가 증가하고 있는 추세이며, 이러한 투약으로 인한 사고의 원인으로 는 수액 주입속도 조절기 조작 오류, 약물 주입 펌프로 세팅 오류, 약물 복용에 대한 환자 이해 부족, 인슐린 투약 방법 숙지 미숙, 잘못된 처방, 투약의 기본 원칙(5-right) 미준수 등이 있었다. 또한, 이러한 정맥주사 및 수액과 관련된 대부분의 투약 오류는 수액의 준비 과정부터 주입 종료까지의 모든 과 정을 전담하는 간호사의 근무 환경 및 불안, 스트레스로 인한 심리적 요인보다는 간호사들이 수액 주입 속도를 잘못 계산하거나 용량을 착각하는 등 지식 부족과 수행 미숙으로 인해 발생하는 경향이 있으며, 다수 환자에 대 한 정맥 수액의 전 단계를 관리하는 것은 간호 업무 중 많은 시간과 비중을 차지하고 투약 행위와 관찰 등 역시 많은 시간이 요구되는 작업에 해당한다. 한편, 인공지능의 발전에 따라 의료 분야에서도 다양한 인공지능이 활용되고 있는데, 코로나19의 확산에 따라 전례 없는 의료 서비스 부족을 겪었기 때문에 의료진의 일손을 덜어줄 수 있는 최신 IT 기술의 도입에 사회적인 관심이 집중되고 있다. 아울러, 컴퓨터 비전은 의료분야에서 유망한 IT기술의 대표적인 요소로, 의료진의 의료 부담을 덜거나 인적 오류를 줄이기 위하여 널리 사용되고 있다. 본원의 배경이 되는 기술은 한국공개특허공보 제10-2023-0068740호에 개시되어 있다."}
{"patent_id": "10-2023-0106754", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본원은 전술한 종래 기술의 문제점을 해결하기 위한 것으로서, 수액 잔량 측정에 대한 인적 오류를 방지하고, 의료진의 업무 부담을 줄이기 위한 비전 기반의 수액 잔량 측정 장치 및 방법을 제공하려는 것을 목적으로 한다. 다만, 본원의 실시예가 이루고자 하는 기술적 과제는 상기된 바와 같은 기술적 과제들로 한정되지 않으며, 또 다른 기술적 과제들이 존재할 수 있다."}
{"patent_id": "10-2023-0106754", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본원의 일 실시예에 따른 비전 기반의 수액 잔량 측정 방법은, 분석 대상 수액이 수용된 타겟 용기를 촬영한 타겟 이미지를 획득하는 단계 및 복수의 수액 이미지를 포함하는 학습 데이터를 이용하여 미리 구축된 이미지 분석 알고리즘에 상기 타겟 이미지를 입력하여 상기 타겟 이미지로부터 상기 분석 대상 수액과 연계된 객체 영역을 식별하는 단계를 포함할 수 있다.또한, 본원의 일 실시예에 따른 비전 기반의 수액 잔량 측정 방법은, 상기 객체 영역을 이용하여 상기 분석 대 상 수액의 용량 정보를 도출하는 단계를 포함할 수 있다. 또한, 상기 객체 영역은, 상기 타겟 용기에 대응하는 제1객체 영역 및 상기 제1객체 영역 내부에서 상기 타겟 용기에 수용된 상기 분석 대상 수액이 차지하는 영역에 대응하는 제2객체 영역을 포함할 수 있다. 또한, 상기 학습 데이터는, 소정의 물질이 용기 내에 수용된 상태를 촬영한 복수의 이미지를 포함하고, 상기 물 질의 유형에 따라 상기 복수의 이미지 각각에 대하여 라벨 정보가 할당된 제1데이터 셋을 포함할 수 있다. 또한, 상기 학습 데이터는, 각각이 액체 상태의 수액을 수용하는 단일 수액 용기를 정면으로 바라본 방향으로 촬영한 상기 복수의 수액 이미지를 포함하는 제2데이터 셋을 포함할 수 있다. 또한, 상기 제2데이터 셋은 상기 복수의 수액 이미지 각각에 대한 촬영 각도 변화, 촬영 거리 변화, 화질 변화 및 가려짐 물체 배치 중 적어도 하나를 포함하는 인식 저해 요소를 적용한 이미지를 포함할 수 있다. 또한, 상기 이미지 분석 알고리즘은 상기 타겟 이미지로부터 미리 설정된 객체 유형에 대응하는 상기 객체 영역 각각의 위치 정보 및 경계 정보를 도출하는 이미지 세그멘테이션(Image Segmentation)을 수행하도록 학습될 수 있다. 또한, 상기 이미지 분석 알고리즘은 FCN(Fully Convolution Network) 기반의 인공지능 모델을 포함할 수 있다. 한편, 본원의 일 실시예에 따른 비전 기반의 수액 잔량 측정 장치는, 분석 대상 수액이 수용된 타겟 용기를 촬 영한 타겟 이미지를 획득하는 수집부 및 복수의 수액 이미지를 포함하는 학습 데이터를 이용하여 미리 구축된 이미지 분석 알고리즘에 상기 타겟 이미지를 입력하여 상기 타겟 이미지로부터 상기 분석 대상 수액과 연계된 객체 영역을 식별하는 객체 분석부를 포함할 수 있다. 또한, 본원의 일 실시예에 따른 비전 기반의 수액 잔량 측정 장치는, 상기 객체 영역을 이용하여 상기 분석 대 상 수액의 용량 정보를 도출하는 연산부를 포함할 수 있다. 상술한 과제 해결 수단은 단지 예시적인 것으로서, 본원을 제한하려는 의도로 해석되지 않아야 한다. 상술한 예 시적인 실시예 외에도, 도면 및 발명의 상세한 설명에 추가적인 실시예가 존재할 수 있다."}
{"patent_id": "10-2023-0106754", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본원의 과제 해결 수단에 의하면, 수액 잔량 측정에 대한 인적 오류를 방지하고, 의료진의 업무 부담을 줄이기 위한 비전 기반의 수액 잔량 측정 장치 및 방법을 제공할 수 있다. 다만, 본원에서 얻을 수 있는 효과는 상기된 바와 같은 효과들로 한정되지 않으며, 또 다른 효과들이 존재할 수 있다."}
{"patent_id": "10-2023-0106754", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본원이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본원의 실시예를 상세히 설명한다. 그러나 본원은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본원을 명확하게 설명하기 위해서 설명과 관계없는 부분 은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 본원 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\" 또는 \"간접적으로 연결\"되어 있는 경우 도 포함한다. 본원 명세서 전체에서, 어떤 부재가 다른 부재 \"상에\", \"상부에\", \"상단에\", \"하에\", \"하부에\", \"하단에\" 위치 하고 있다고 할 때, 이는 어떤 부재가 다른 부재에 접해 있는 경우뿐 아니라 두 부재 사이에 또 다른 부재가 존 재하는 경우도 포함한다. 본원 명세서 전체에서, 어떤 부분이 어떤 구성 요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성 요소를 제외하는 것이 아니라 다른 구성 요소를 더 포함할 수 있는 것을 의미한다. 본원은 비전 기반의 수액 잔량 측정 장치 및 방법에 관한 것이다. 도 1은 본원의 일 실시예에 따른 비전 기반의 수액 잔량 측정 장치를 포함하는 영상 분석 시스템의 개략적인 구 성도이다. 도 1을 참조하면, 본원의 일 실시예에 따른 영상 분석 시스템은, 본원의 일 실시예에 따른 비전 기반의 수 액 잔량 측정 장치(이하, '수액 잔량 측정 장치'라 한다.), 촬영 디바이스 및 사용자 단말(30 0)을 포함할 수 있다. 본원 명세서에 있어서, '비전'은 예를 들어, '컴퓨터 비전'을 포함할 수 있다. 수액 잔량 측정 장치, 촬영 디바이스 및 사용자 단말 상호간은 네트워크를 통해 통신할 수 있다. 네트워크는 단말들 및 서버들과 같은 각각의 노드 상호간에 정보 교환이 가능한 연결 구조를 의미하 는 것으로, 이러한 네트워크의 일 예에는, 3GPP(3rd Generation Partnership Project) 네트워크, LTE(Long Term Evolution) 네트워크, 5G 네트워크, WIMAX(World Interoperability for Microwave Access) 네트워크, 인 터넷(Internet), LAN(Local Area Network), Wireless LAN(Wireless Local Area Network), WAN(Wide Area Network), PAN(Personal Area Network), wifi 네트워크, 블루투스(Bluetooth) 네트워크, 위성 방송 네트워크, 아날로그 방송 네트워크, DMB(Digital Multimedia Broadcasting) 네트워크 등이 포함되나 이에 한정되지는 않 는다. 사용자 단말은 예를 들면, 스마트폰(Smartphone), 스마트패드(SmartPad), 태블릿 PC등과 PCS(Personal Communication System), GSM(Global System for Mobile communication), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말기 같은 모든 종류의 무선 통신 장치일 수 있다. 이하에서는 먼저 도 2 및 도 3을 참조하여 본원에서 개시하는 수액 잔량 측정 장치를 이용하여 비전 인식 을 통해 이미지 내에서 식별되는 객체 내지 객체 영역의 유형을 설명하도록 한다. 도 2는 이미지로부터 식별되는 객체 클래스의 유형 및 상관 관계를 나타낸 개념도이고, 도 3은 이미지 내의 객 체 클래스의 유형을 분류하여 표시한 예시도이다. 도 2 및 도 3을 참조하면, 본원에서 개시하는 수액 잔량 측정 장치에 의해 이미지로부터 식별되는 객체 클 래스는 이미지 내에 등장하는 수액 용기(수액백) 전체를 나타내는 'Vessel', 수액 용기(수액백) 내에 수용된 내 용물을 나타내는 'Filled' 및 내용물 중 액체 상태에 해당하는 내용물을 나타내는 'Liquid GENERAL'을 포함하는 복수의 객체 유형을 포함할 수 있다. 한편, 이와 관련하여 본원의 일 실시예에 따르면, 수액 잔량 측정 장치의 이미지 분석 알고리즘은 이미지 분석 알고리즘을 적용하기 위해 요구되는 연산량, 연산 속도, 수액 잔량 측정 장치가 탑재되는 컴퓨팅 장 치(예를 들면, 사용자 단말 등)의 리소스 등을 고려하여 'Filled' 객체 클래스와 'Liquid GENERAL' 객체클래스를 구분하지 않고 단일 클래스로 식별하도록 구축될 수 있으나, 이에만 한정되는 것은 아니다. 이와 관련하여 도 2에 도시된 바와 같이 전술한 세 가지의 객체 유형은 각각 부분집합의 관계를 가질 수 있지만, 일반적으로 수액 용기 내에 수용되는 내용물은 서로 점도의 차이만 있을 뿐, 포도당 생리식염수, 포도 당 주사액, 미네랄 보충제와 전해질 용액, 비타민 등의 액체로 구성되어 있기 때문에 'Filled'와 'Liquid GENERAL' 객체 클래스를 상호 동일한 유형으로 취급할 수 있으며, 한편, 용기 내부에 여유 공간이 적어도 일부 형성되도록 제작되는 수액 백의 특성 상 'Vessel'과 'Filled' 또는 'Liquid GENERAL'는 해당 수액백이 미사용 상태인 경우(달리 말해, 잔량이 100%에 해당하는 경우)인 경우라도 이미지 내에서 동일한 영역을 차지하지 않게 된다. 이하에서는 수액 잔량 측정 장치의 구체적인 기능 및 동작에 대하여 설명하도록 한다. 수액 잔량 측정 장치는 전술한 이미지 분석 알고리즘의 구축을 위한 복수의 수액 이미지를 포함하는 학습 데이터를 수집할 수 있다. 구체적으로 수액 잔량 측정 장치는 소정의 물질이 용기 내에 수용된 상태를 촬영한 복수의 이미지를 포함 하고, 수용된 물질의 유형에 따라 복수의 이미지 각각에 대하여 라벨 정보가 할당된 제1데이터 셋을 포함하는 학습 데이터를 수집할 수 있다. 이와 관련하여 제1데이터 셋은 예시적으로 'LabPics 데이터 셋(LabPics Dataset for computer vision for autonomous chemistry labs and medical labs)'으로 이루어질 수 있으나, 이에만 한정되는 것은 아니다. 이러 한 LabPics 데이터 셋은 화학, 실험실, 의료실험실 및 다양한 물질들이 용기 내에 담겨있는 모습을 촬영하고 물 질별로 세분화, 분류하여 컴퓨터 비전 모델 개발에 사용할 수 있도록 기 구축된 데이터 셋으로, 주로 투명 용기 내에 다양한 물질들이 담겨있는 모습을 촬영한 이미지를 포함할 수 있으며, 이미지에 반영된 물질들은 하나 이 상의 물질 유형(예를 들면, 액체, 고체, 거품, 서스펜션, 분말, 젤, 곡물, 증기 등)로 분류되어 해당 라벨 정보 가 할당될 수 있다. 도 4는 학습 데이터로 수집된 수액 이미지에 대한 라벨링 결과를 예시적으로 나타낸 도면이다. 도 4를 참조하면, 수액 잔량 측정 장치는 각각이 액체 상태의 수액을 수용하는 단일 수액 용기를 정면으로 바라본 방향으로 촬영한 복수의 수액 이미지를 포함하는 제2데이터 셋을 포함하는 학습 데이터를 수집할 수 있 다. 이와 관련하여, 이미지 분석 알고리즘의 구축(훈련)을 위해 수집되는 학습 데이터 셋은 최종적으로 구축된 이미 지 분석 알고리즘이 보다 우수한 성능을 발휘하도록 하기 위해 다각도로 수집되어야 하며, 이렇게 모델의 성능 을 향상시키기 위해서는 각 클래스 별 데이터 수(달리 말해, 훈련 데이터 셋의 분포)가 균등해야 하고, 이미지 의 크기 동일하고, 상호 구분되는 다양한 특성(예를 들면, 용량, 글씨 색, 액체 색 등)을 가지는 수액백이 각각 반영된 이미지 간의 다양성이 존재하여야 하고, 각각의 이미지의 품질 역시 높아야 하는 등 여러 요소를 고려하 여 데이터 셋의 설계가 이루어져야 한다. 이를 고려하여 본원에서 개시하는 영상 분석 시스템은 수액의 잔량을 정확하게 산출하는 수액 잔량 측정 장 치를 구현하기 위하여 기 구축된 학습 데이터 셋(달리 말해, 전술한 제1데이터 셋) 이외에 별도의 학습 데 이터 셋을 활용할 수 있다. 참고로, 제2데이터 셋은 'IV 데이터 셋'으로 달리 지칭될 수 있으며, 본원의 실시예 에 관한 설명에서 제1데이터 셋을 학습 데이터 셋으로 하여 구축된 이미지 분석 알고리즘은 'LabPics 모델'로 지칭하고, 제2 데이터 셋을 학습 데이터 셋으로 하여 구축된 이미지 분석 알고리즘은 'IV 모델'로 지칭하고, 제 1데이터 셋 및 제2데이터 셋을 통합적으로 사용하여 구축되는 이미지 분석 알고리즘은 '혼합(Mixed) 모델'로 지 칭할 수 있다. 한편, 제2데이터 셋은 수액의 잔량을 효과적으로 측정하기 위하여 다음 조건을 충족하도록 촬영 및 수집될 수 있으며, 해당 조건은 각 수액 이미지는 수액 용기를 정면 혹은 정면으로 간주할 수 있는 촬영 각도에서 촬영되 어야 하며, 각 수액 이미지에는 하나의 수액 용기만이 포함되도록 하는 조건일 수 있다. 예시적으로 제2데이터 셋은 전술한 제1데이터 셋(예를 들면, LabPics 데이터 셋 등)의 형식과 동일하게 수액 데 이터 셋을 구축하기 위해서 촬영 디바이스를 이용하여 수액백을 촬영한 이미지를 포함할 수 있으며, 개별 이미지는 촬영 디바이스를 통해 촬영된 동영상에 대한 후처리를 적용함으로써 소정의 프레임 간격(예를 들 면, 15 프레임 등)마다 캡쳐된 이미지를 포함하도록 선별될 수 있다. 다른 예로, 제2데이터 셋은 데이터 셋의 다양성을 높이기 위하여 웹 기반의 크롤링 이미지(예를 들면, 검색 엔 진을 이용하여 검색된 이미지)를 포함하도록 추가 구축될 수 있으며, 수액 용기에 수액이 수용된 상태의 이미지 를 제2데이터 셋에 포함시킬 수 있도록 웹 기반의 크롤링 시 적용되는 검색 키워드는 '링거', '링거 수액', '링 거 팩', '수액 팩' 등의 관련성 있는 용어로 결정될 수 있다. 또한, 본원의 일 실시예에 따르면, 수액 잔량 측정 장치는 복수의 수액 이미지 각각에 대한 촬영 각도 변 화, 촬영 거리 변화, 화질 변화 및 가려짐 물체 배치 중 적어도 하나를 포함하는 인식 저해 요소를 적용한 이미 지를 포함하는 제2데이터 셋을 학습 데이터로서 수집할 수 있다. 즉, 수액 잔량 측정 장치는 다양한 상황 및 인식 저해 요소를 가정하기 위하여 카메라의 각도를 변경하거 나, 정측면으로 이동하거나, 피사체로부터 멀어지는 등의 촬영 환경 변화를 다양하게 적용하여 제2데이터 셋을 다각도로 구축할 수 있다. 또한, 도 4를 참조하면, 제2데이터 셋에 포함된 수액 이미지 각각에 대한 라벨링 프로세스는 미리 생성된 라벨 링 도구(예를 들면, 'Labelme' 등)를 활용하여 수행될 수 있다. 예를 들어, 'Labelme'는 오픈소스 기반의 이미 지 어노테이션(Annotation) 도구로서, 이미지에 대한 세분화된 정보를 라벨링하여 객체 인식, 추적, 분할 등 다 양한 작업에 활용될 수 있다. 이를 이용하여 수액 잔량 측정 장치는 제1데이터 셋(LabPics 데이터 셋)에 대하여 적용된 객체 클래스 형 식과 일치하도록 제2데이터 셋에 대하여 적용되는 수액 용기(수액백)의 구성 요소를 'Vessel', 'Filled', 'Liquid' 세 가지의 객체 클래스로 분류하고, 각각 이미지에 대한 주석 정보를 포함하는 분류 결과를 반영한 파 일(예를 들면, json 파일)을 학습 데이터로서 저장할 수 있으며, 이 때 각각의 결과 파일에는 주석 도구를 통해 설정한 마스크(Mask)에 대한 좌표 정보가 저장될 수 있다. 한편, 본원의 일 실시예에 따르면, 수액 잔량 측정 장치는 학습 데이터로서 수집된 각 수액 이미지에 대한 정보를 이하에서 설명하는 바와 같이 저장(기록)할 수 있다. 예시적으로 수액 잔량 측정 장치는 각 이미지에 관한 정보(메타 정보, 라벨 정보 등)의 집합을 저장할 수 있으며, 각각의 저장 공간 내에는 'EmptyRegions', 'Material', 'Parts', 'Semantic', 'Vessel'과 같이 이미지 의 구성 요소에 대한 정보를 포함하는 영역(폴더)이 존재하며, 각 영역에는 객체의 좌표가 마스크 이미지(Mask Image)의 형태로 저장될 수 있다. 또한, 수액 잔량 측정 장치는 라벨링 정보가 포함된 json 파일에 대하여 변환 코드를 적용하여 제2데이터 셋에 포함된 각각의 수액 이미지를 제1데이터 셋(LabPics 데이터 셋)과 동일한 포맷으로 변환할 수 있고, 구체 적으로 변환 코드는 json 파일을 읽어 해당 마스크(Mask) 영역에 대해 이진 배열을 생성하고, RGB 채널에 이를 배치하기 위하여 사용되는 코드를 의미할 수 있다. 이와 관련하여 마스크 이미지(Mask Image)는 이미지의 RGB 중 1개, 혹은 2개의 채널을 사용하여 표현되는 이진 배열이며, 예시적으로 Green 채널을 사용한다고 가정할 때, 해당 객체가 있다고 인식된 위치의 픽셀은 RGB(0, 1, 0)과 같이 표현되고, 그 외의 픽셀은 RGB(0, 0, 0)으로 표현됨으로써 생성될 수 있다. 또한, 'EmptyRegions' 영역은 객체와 객체 외 영역을 분리하여 표시하는 마스크 이미지를 저장하며, 'Material' 영역은 'Filled' 객체 클래스를 이루는 물질(구성요소)에 대한 재질을 나타내며, 예시적으로 제1데이터 셋 (LabPics Dataset 등)에는 고체(Solid), 분말(Powder) 등의 요소로 해당 영역이 정의될 수 있으나, 액체 상태 의 수액 잔량을 측정하기 위한 목적으로 이미지 내의 액체 영역만을 식별하는 수액 잔량 측정 장치의 특성 상 전술한 'Liquid GENERAL' 만을 다룬다. 또한, 'Parts' 영역은 단일 이미지 내에 복수의 객체가 존재할 경우 객체를 분리하는 마스크 이미지이며, 'Semantic'은 이미지 내에 존재하는 모든 객체 클래스의 의미론적 분할(Semantic Segmentation) 정보를 저장할 수 있다. 또한, 수액 잔량 측정 장치는 이미지 내의 복수의 객체의 경계를 분리하기 위한 마스크 이미지 (예를 들면, Ignore 이미지 등)를 통해 단일 이미지 내부에 다수의 객체가 겹쳐서 존재할 경우 이를 분리하여 경계를 표시할 수 있다. 또한, 'Vessel' 영역에는 수액 용기 전체를 나타내는 마스크 이미지 전체가 저장될 수 있다. 또한, 수액 잔량 측정 장치는 수집된 학습 데이터를 이용하여, 입력된 이미지에서 수액에 대응하는 객체 영역을 식별하여 출력하는 이미지 분석 알고리즘을 구축할 수 있다. 구체적으로 수액 잔량 측정 장치는 타겟 이미지로부터 미리 설정된 객체 유형에 대응하는 객체 영역 각각 의 위치 정보 및 경계 정보를 도출하는 이미지 세그멘테이션(Image Segmentation)을 수행하는 이미지 분석 알고리즘을 학습시킬 수 있다. 도 5는 인공지능 기반의 이미지 분석 알고리즘의 아키텍처를 예시적으로 나타낸 도면이다. 도 5를 참조하면, 수액 잔량 측정 장치를 통해 구축되는 이미지 분석 알고리즘은 FCN(Fully Convolution Network) 기반의 인공지능 모델일 수 있다. 참고로, 비전 기반의 객체 인식 알고리즘은 딥러닝(Deep Learning)을 통해 구현 가능한 알고리즘으로 이미지(예 를 들면, 동영상의 특정 프레임 등)로부터 인물, 물체, 장면 등을 쉽게 구분할 수 있도록 구성 요소의 특징을 추출, 분류하는 알고리즘을 의미하며, 가장 자주 사용되는 분야는 이미지 분류(Image Classification), 객체 탐 지(Object Detection), 이미지 분할(Image Segmentation) 등이 존재한다. 이미지 분류(Image Classification) 는 이미지를 사전에 설정한 클래스로 분류하는 기법이고, 객체 탐지(Object Detection)는 이미지를 구성하는 객 체의 위치와 종류를 탐지하는 기법으로 이미지 분류와 유사하지만 이미지 내에서 객체의 위치를 탐색한다는 차 이점이 있다. 일반적으로 객체의 위치는 객체가 있는 영역을 표시하는 테두리를 의미하는 경계 상자(Bounding Box)의 형태로 이미지 상에 반영될 수 있으며, 본원에서 개시하는 수액 잔량 측정 장치는 타겟 이미지에 반영된 수액의 잔량을 보다 정확하게 파악하기 위해 각 객체의 경계를 픽셀 단위로 정확하게 표시하는 이미지 분할(Image Segmentation)을 수행하는 이미지 분석 알고리즘을 구축할 수 있다. 보다 구체적으로 이미지 분할(Image Segmentation)은 이미지를 픽셀 단위로 분할하여 객체의 분류, 위치뿐만 아 니라 정확한 경계까지 인식하는 객체 인식 알고리즘으로서, 이러한 이미지 분석 알고리즘은 일예로 컨볼루션 계 층(Convolution layer)과 풀링 계층(Pooling layer)을 포함하는 구조로 이루어지는 신경망인 합성곱 신경망 (Convolutional Neural Network, CNN) 기반의 모델일 수 있으며, 이러한 CNN 모델은 입력 이미지에서 특징을 추출, 이를 기반으로 이미지 분류, 객체 검출 및 분할과 같은 작업을 수행한다. 한편, 이미지 분할(Image Segmentation)을 수행하는 방식은 크게 세 가지로 구분되며, 먼저, 의미론적 분할 (Semantic Segmentation)은 이미지를 구성하고 있는 픽셀을 분류하여 이미지를 클래스 단위로 분할하는 기법으 로서, 이미지에 속하는 모든 픽셀을 각각 해당하는 클래스로 분류하고, 이를 통해 이미지 내에서 각 클래스에 속하는 객체의 위치와 자세한 형태를 식별할 수 있다는 특성을 가진다. 다음으로, 인스턴스 분할(Instance Segmentation) 기법은 이미지 내에서 식별된 모든 객체를 각각 개별적인 인 스턴스(Instance)로 분류하는 기법이며, 이미지 내에서 서로 다른 객체의 경계를 명확하게 분리할 수 있으며 이 에 따라 객체 단위의 활용이 가능해진다는 특성이 있다. 다음으로, 팬옵틱 세그먼트(Panoptic Segmentation) 기법은 이미지에 속하는 모든 픽셀에 대해 분할 (Segmentation)과 인스턴스 분류를 동시에 수행하는 기법으로, 일반적인 인스턴스 분할이 객체의 경계를 찾아내 는 데 중점을 두는 반면, 팬옵틱 세그먼트(Panoptic Segmentation) 기법은 이미지 내의 모든 픽셀을 객체의 인 스턴스와 배경으로 각각 구분하여 인식함으로써 이미지를 구성하는 모든 객체에 대해 포괄적인 정보를 제공할 수 있다는 특성을 갖는다. 이와 관련하여 본원의 일 실시예에 따르면, 수액 잔량 측정 장치는 의료 현장에서 사용되는 수액백에 대한 보다 정확한 잔량 측정을 위하여 단일 수액백을 촬영한 타겟 이미지를 사용하여 개별적인 인식을 수행하는 상황 을 가정하여 객체 클래스 분류에 적합한 의미론적 분할(Semantic Segmentation) 방식을 채택할 수 있으나, 이에 만 한정되는 것은 아니다. 또한, 도 5에 도시된 FCN(Fully Convolution Network) 기반의 인공지능 모델과 관련하여, 합성곱 신경망(CNN) 은 AlexNet과 같은 딥 러닝 모델을 기반으로 하는 객체 인식 알고리즘으로, FCN 네트워크는 Convolution 계층과 Pooling 계층으로 구성되었던 CNN 구조를 Convolution 계층으로만 이루어진 구조로 변환하여 이미지 분류에 특 화되어 있던 CNN 모델을 의미론적 분할(Semantic Segmentation)을 수행할 수 있도록 변형한 모델에 해당한다. 특히, FCN은 입력 이미지를 Convloution 계층을 거치며 다운 샘플링하여 작은 크기의 피처 맵(feature map)으로 압축하는 인코딩 레이어(Encoding Layer)와 업 샘플링 계층을 거치며 다시 입력 이미지와 동일한 크기로 확장하 는 디코딩 레이어(Decoding Layer)로 이루어질 수 있으며, 두 레이어(인코딩/디코딩 레이어)는 스킵 연결(Skip Connection)을 통해 연결되어 최종 출력 이미지의 정확도가 향상될 수 있다. 전술한 바와 같이 이미지 분석 알고리즘의 구축이 완료되면, 수액 잔량 측정 장치는 분석 대상 수액이 수 용된 타겟 용기를 촬영한 타겟 이미지를 획득할 수 있다. 예시적으로 수액 잔량 측정 장치는 촬영 디바이 스로부터 촬영 디바이스에 의해 촬영된 타겟 이미지를 수신할 수 있다.또한, 수액 잔량 측정 장치는 타겟 이미지를 이미지 분석 알고리즘에 입력하여 타겟 이미지로부터 분석 대 상 수액과 연계된 객체 영역을 식별할 수 있다. 도 6은 입력된 타겟 이미지에 대한 제1객체 영역 및 제2객체 영역 식별 결과를 예시적으로 나타낸 도면이다. 도 6을 참조하면, 수액 잔량 측정 장치는 입력된 타겟 이미지(도 6의 (a) 참조)로부터 타겟 용기에 대응하 는 제1객체 영역(도 6의 (b) 참조) 및 제1객체 영역 내부에서 타겟 용기에 수용된 분석 대상 수액이 차지하는 영역에 대응하는 제2객체 영역(도 6의 (c) 참조) 중 적어도 하나를 객체 영역으로서 식별할 수 있다. 또한, 수액 잔량 측정 장치는 식별된 객체 영역을 이용하여 분석 대상 수액의 용량 정보를 도출할 수 있다. 이와 관련하여 본원의 일 실시예에 따르면, 수액 잔량 측정 장치는 입력된 타겟 이미지로부터 식별된 제1 객체 영역의 규격(예를 들면, 픽셀수, 타겟 이미지에서 차지하는 비율, 크기, 면적 등)과 타겟 이미지로부터 식 별된 제2객체 영역의 규격 간의 비율을 토대로 타겟 용기 내부에 수용된 분석 대상 수액의 용량 정보를 산출할 수 있다. 예시적으로 수액 잔량 측정 장치에 의해 도출되는 용량 정보는 미사용 상태의 타겟 용기(수액백)에 수용된 수액의 용량 대비 타겟 이미지에 반영된 현재 상태의 잔여 수액의 용량이 차지하는 비율을 나타내는 비율 값으 로 산출될 수 있다. 다른 예로, 수액 잔량 측정 장치에 의해 도출되는 용량 정보는 타겟 용기에 대하여 미리 알려지거나 타겟 이미지로부터 파악된 용량 수치를 기초로 하여, 타겟 이미지에 반영된 현재 상태의 잔여 수액의 용량이 차지하 는 부피 자체가 산출되는 것일 수 있다. 이와 관련하여 수액 잔량 측정 장치는 타겟 용기의 외면에서 식별 되는 텍스트, 숫자 등의 보조 정보를 식별하고, 해당 보조 정보로부터 타겟 용기의 용량 수치를 파악하는 인공 지능 기반의 분석 모델을 추가로 보유할 수 있다. 또 다른 예로, 수액 잔량 측정 장치에 의해 도출되는 용량 정보는 잔여 수액의 용량 비율 또는 잔여 수액 의 구체적인 부피값 등에 따른 수액의 상태를 나타내도록 미리 정의된 수액 상태 분류 정보의 형태를 가질 수 있다. 예를 들어, '잔여 용량 적절', '잔여 용량 감소(50% 미만)', '잔여 용량 부족' 등의 세 범주로 수액 상태 분류 정보가 도출되는 것일 수 있으나, 이에만 한정되는 것은 아니다. 이하에서는 도 7a 내지 도 8b를 참조하여 본원에서 개시하는 수액 잔량 측정 장치와 연계된 실험예를 설명 하도록 한다. 도 7a 내지 도 7i는 본원의 일 실시예에 따른 비전 기반의 수액 잔량 측정 장치와 연계된 실험예로서, 이미지 분석 알고리즘의 학습 결과 및 분석 성능을 나타낸 그래프이다. 구체적으로 도 7a는 IV 모델 학습 진행에 따른 Validation Loss 그래프이고, 도 7b는 IV 모델 학습 진행에 따른 픽셀 단위 IoU 그래프이다. 도 7a 및 도 7b를 참조하면, IV 모델은 FCN 알고리즘을 사용하여 학습을 진행하였으며 BatchSize를 5로 설정하 고 총 500,000회의 Iteration을 진행하였다. 학습에는 약 60시간이 소요되었다. 50회의 Iteration마다 Loss값 을 측정하였으며, 10,000회의 Iteration마다 IoU를 측정하였으며, 학습이 진행될수록 Validation Loss 값이 감 소하는 형태를 보이고, 이는 가중치 변화율이 감소함을 의미하기 때문에 과적합이 발생하지 않았으며 학습이 제 대로 진행된 것을 확인할 수 있다. 또한, 도 7c는 LabPics 모델 학습 진행에 따른 Validation Loss 그래프이고, 도 7d는 LabPics 모델 학습 진행 에 따른 픽셀 단위 IoU 그래프이다. 도 7c 및 도 7d를 참조하면, LabPics 모델은 FCN 알고리즘을 사용하여 학습을 진행하였으며 BatchSize를 5로 설 정하고 총 500,000회의 Iteration을 진행하였다. 학습에는 약 60시간이 소요되었다. 50회의 Iteration마다 Loss값을 측정하였으며, 10,000회의 Iteration마다 IoU를 측정하였으며, 학습이 진행될수록 Loss 값이 감소하는 형태를 보이고, 이는 가중치 변화율이 감소함을 의미하기 때문에 학습이 제대로 진행된 것을 확인할 수 있다. 또한, 도 7e는 Mixed 모델 학습 진행에 따른 Validation Loss 그래프이고, 도 7f는 Mixed 모델 학습 진행에 따 른 픽셀 단위 IoU 그래프이다. 도 7e 및 도 7f를 참조하면, 혼합(Mixed) 모델은 FCN 알고리즘을 사용하여 학습을 진행하였으며 BatchSize를 5 로 설정하고 총 500,000회의 Iteration을 진행하였다. 학습에는 약 60시간이 소요되었다. 50회의 Iteration마다 Loss값을 측정하였으며, 10,000회의 Iteration마다 IoU를 측정하였으며, 학습이 진행될수록 Loss 값이 감소하는 형태를 보이고, 이는 가중치 변화율이 감소함을 의미하기 때문에 학습이 제대로 진행된 것을 확인할 수 있다. 도 7g는 IV 모델 IoU 산점도이고, 도 7h는 LabPics 모델 IoU 산점도이고, 도 7i는 Mixed 모델 IoU 산점도를 나 타낸다. 또한, 도 8a는 데이터 셋에 따른 클래스별 IoU 평균값을 나타낸 도표이고, 도 8b는 LabPics Medical 데 이터로 테스트한 결과값을 나타낸 도표이다. 도 7g 내지 도 8b를 참조하면, IV 모델과 Mixed 모델은 모두 IoU 성능 수치가 0.7 이상이기 때문에 두 모델은 수액 잔량 검출 과정이 정확도 높게 이루어진다고 평가할 수 있으며, 특히 IV 모델의 인식률이 보다 우수한 것 을 확인할 수 있다. 반면, LabPics 데이터를 사용하여 훈련시킨 모델은 다른 두 모델에 비하여 낮은 성능을 보였는데 이는, Image Segmentation 모델에 훈련 데이터와 관련 없는 이미지를 인식시켜서 발생하는 문제로 이해될 수 있으며, 해당 모델이 대다수의 픽셀을 오분류하여 낮은 값을 보이게 되는 것이며, 이는 LabPics 모델의 IoU 분포가 다른 모델 들의 분포에 비하여 눈에 띄게 흩어진 형태로 나타나는 것을 통해 확인할 수 있다. 또한, 혼합(Mixed) 모델은 IV 데이터 셋과 LabPics 데이터 셋을 합쳐서 훈련시킨 모델로, 일반적으로 Image Segmentation 모델에 훈련 데이터와 관련 없는 이미지를 인식시키면 앞서 설명한 LabPics 모델처럼 낮은 인식률 을 보이지만, 다른 훈련 데이터를 섞는 것으로 이를 개선할 수 있으며, 모델은 이 과정에서 데이터의 다양성과 일반화 능력 측면을 향상시키게 된다. 즉, 훈련 데이터의 다양성을 높임에 따라 모델이 새로운 데이터를 처리할 수 있는 능력이 향상되며 다양한 상황에서 더욱 일반화된 패턴을 학습할 수 있게 된다. 보다 구체적으로 도 8a와 도 8b를 비교하면, 도 8a에서 Mixed 모델은 훌륭한 인식 정확도를 보였으나 IV 모델에 비해 낮은 수치를 보인 반면, 도 8b에서는 훈련이 완료된 모델에 'LabPics Medical' 이라는 의료용품 이미지를 인식시킨 결과가 IV모델이 가장 낮고, Mixed 모델이 가장 좋은 성능을 보이는 것을 확인할 수 있으며, 이에 따 라 다른 데이터를 섞어 데이터 셋을 구성할 경우 특정 클래스에 대한 전문성은 떨어지지만 높은 범용성과 일반 화 능력을 가지게 됨을 알 수 있다. 도 9는 본원의 일 실시예에 따른 본원의 일 실시예에 따른 비전 기반의 수액 잔량 측정 장치의 개략적인 구성도 이다. 도 9를 참조하면, 수액 잔량 측정 장치는 학습부, 수집부, 객체 분석부 및 연산부를 포함할 수 있다. 학습부는 수집부에 의해 수집되는 학습 데이터를 이용하여, 입력된 이미지에서 수액에 대응하는 객체 영역을 식별하여 출력하는 이미지 분석 알고리즘을 구축할 수 있다. 구체적으로 학습부는 타겟 이미지로부터 미리 설정된 객체 유형에 대응하는 객체 영역 각각의 위치 정보 및 경계 정보를 도출하는 이미지 세그멘테이션(Image Segmentation)을 수행하는 이미지 분석 알고리즘을 학습시 킬 수 있다. 이와 관련하여 학습부를 통해 구축되는 이미지 분석 알고리즘은 FCN(Fully Convolution Network) 기반의 인공지능 모델일 수 있다. 수집부는 전술한 이미지 분석 알고리즘의 구축을 위한 복수의 수액 이미지를 포함하는 학습 데이터를 수집 할 수 있다. 구체적으로 수집부는 소정의 물질이 용기 내에 수용된 상태를 촬영한 복수의 이미지를 포함하고, 수용된 물질의 유형에 따라 복수의 이미지 각각에 대하여 라벨 정보가 할당된 제1데이터 셋을 포함하는 학습 데이터를 수집할 수 있다. 또한, 본원의 일 실시예에 따르면, 수집부는 각각이 액체 상태의 수액을 수용하는 단일 수액 용기를 정면 으로 바라본 방향으로 촬영한 복수의 수액 이미지를 포함하는 제2데이터 셋을 포함하는 학습 데이터를 수집할 수 있다. 이와 관련하여 본원의 일 실시예에 따르면, 수집부는 복수의 수액 이미지 각각에 대한 촬영 각도 변화, 촬 영 거리 변화, 화질 변화 및 가려짐 물체 배치 중 적어도 하나를 포함하는 인식 저해 요소를 적용한 이미지를 포함하는 제2데이터 셋을 학습 데이터로서 수집할 수 있다.또한, 수집부는 분석 대상 수액이 수용된 타겟 용기를 촬영한 타겟 이미지를 획득할 수 있다. 예시적으로 수집부는 촬영 디바이스로부터 촬영 디바이스에 의해 촬영된 타겟 이미지를 수신할 수 있다. 객체 분석부는 타겟 이미지를 이미지 분석 알고리즘에 입력하여 타겟 이미지로부터 분석 대상 수액과 연계 된 객체 영역을 식별할 수 있다. 구체적으로 객체 분석부는 타겟 용기에 대응하는 제1객체 영역 및 제1객체 영역 내부에서 타겟 용기에 수 용된 분석 대상 수액이 차지하는 영역에 대응하는 제2객체 영역 중 적어도 하나를 객체 영역으로서 식별할 수 있다. 연산부는 식별된 객체 영역을 이용하여 분석 대상 수액의 용량 정보를 도출할 수 있다. 이하에서는 상기에 자세히 설명된 내용을 기반으로, 본원의 동작 흐름을 간단히 살펴보기로 한다. 도 10은 본원의 일 실시예에 따른 비전 기반의 수액 잔량 측정 방법에 대한 동작 흐름도이다. 도 10에 도시된 비전 기반의 수액 잔량 측정 방법은 앞서 설명된 수액 잔량 측정 장치에 의하여 수행될 수 있다. 따라서, 이하 생략된 내용이라고 하더라도 수액 잔량 측정 장치에 대하여 설명된 내용은 비전 기반 의 수액 잔량 측정 방법에 대한 설명에도 동일하게 적용될 수 있다. 도 10을 참조하면, 단계 S11에서 수집부는 복수의 수액 이미지를 포함하는 학습 데이터를 수집할 수 있다. 구체적으로 단계 S11에서 수집부는 소정의 물질이 용기 내에 수용된 상태를 촬영한 복수의 이미지를 포함 하고, 수용된 물질의 유형에 따라 복수의 이미지 각각에 대하여 라벨 정보가 할당된 제1데이터 셋을 포함하는 학습 데이터를 수집할 수 있다. 또한, 본원의 일 실시예에 따르면, 단계 S11에서 수집부는 각각이 액체 상태의 수액을 수용하는 단일 수액 용기를 정면으로 바라본 방향으로 촬영한 복수의 수액 이미지를 포함하는 제2데이터 셋을 포함하는 학습 데이터 를 수집할 수 있다. 이와 관련하여 본원의 일 실시예에 따르면, 단계 S11에서 수집부는 복수의 수액 이미지 각각에 대한 촬영 각도 변화, 촬영 거리 변화, 화질 변화 및 가려짐 물체 배치 중 적어도 하나를 포함하는 인식 저해 요소를 적용 한 이미지를 포함하는 제2데이터 셋을 학습 데이터로서 수집할 수 있다. 다음으로, 단계 S12에서 학습부는 학습 데이터를 이용하여, 입력된 이미지에서 수액에 대응하는 객체 영역 을 식별하여 출력하는 이미지 분석 알고리즘을 구축할 수 있다. 구체적으로 단계 S12에서 학습부는 타겟 이미지로부터 미리 설정된 객체 유형에 대응하는 객체 영역 각각 의 위치 정보 및 경계 정보를 도출하는 이미지 세그멘테이션(Image Segmentation)을 수행하는 이미지 분석 알고 리즘을 학습시킬 수 있다. 이와 관련하여 단계 S12에서 학습부를 통해 구축되는 이미지 분석 알고리즘은 FCN(Fully Convolution Network) 기반의 인공지능 모델일 수 있다. 다음으로, 단계 S13에서 수집부는 분석 대상 수액이 수용된 타겟 용기를 촬영한 타겟 이미지를 획득할 수 있다. 다음으로, 단계 S14에서 객체 분석부는 타겟 이미지를 이미지 분석 알고리즘에 입력하여 타겟 이미지로부 터 분석 대상 수액과 연계된 객체 영역을 식별할 수 있다. 구체적으로 단계 S14에서 객체 분석부는 타겟 용기에 대응하는 제1객체 영역 및 제1객체 영역 내부에서 타 겟 용기에 수용된 분석 대상 수액이 차지하는 영역에 대응하는 제2객체 영역 중 적어도 하나를 객체 영역으로서 식별할 수 있다. 다음으로, 단계 S15에서 연산부는 식별된 객체 영역을 이용하여 분석 대상 수액의 용량 정보를 도출할 수 있다. 상술한 설명에서, 단계 S11 내지 S15는 본원의 구현예에 따라서, 추가적인 단계들로 더 분할되거나, 더 적은 단 계들로 조합될 수 있다. 또한, 일부 단계는 필요에 따라 생략될 수도 있고, 단계 간의 순서가 변경될 수도 있다. 본원의 일 실시예에 따른 비전 기반의 수액 잔량 측정 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프 로그램 명령 형태로 구현되어 컴퓨터 판독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그 램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로 그램 명령은 본 발명을 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사 용 가능한 것일 수도 있다. 컴퓨터 판독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프 와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크 (floptical disk)와 같은 자기-광 매체(magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같 은 프로그램 명령을 저장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴 파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행 될 수 있는 고급 언어 코드를 포함한다. 상기된 하드웨어 장치는 본 발명의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지이다. 또한, 전술한 비전 기반의 수액 잔량 측정 방법은 기록 매체에 저장되는 컴퓨터에 의해 실행되는 컴퓨터 프로그 램 또는 애플리케이션의 형태로도 구현될 수 있다."}
{"patent_id": "10-2023-0106754", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "전술한 본원의 설명은 예시를 위한 것이며, 본원이 속하는 기술분야의 통상의 지식을 가진 자는 본원의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본원의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본원의 범위에 포함되는 것으로 해 석되어야 한다."}
{"patent_id": "10-2023-0106754", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본원의 일 실시예에 따른 비전 기반의 수액 잔량 측정 장치를 포함하는 영상 분석 시스템의 개략적인 구 성도이다. 도 2는 이미지로부터 식별되는 객체 클래스의 유형 및 상관 관계를 나타낸 개념도이다. 도 3은 이미지 내의 객체 클래스의 유형을 분류하여 표시한 예시도이다. 도 4는 학습 데이터로 수집된 수액 이미지에 대한 라벨링 결과를 예시적으로 나타낸 도면이다. 도 5는 인공지능 기반의 이미지 분석 알고리즘의 아키텍처를 예시적으로 나타낸 도면이다. 도 6은 입력된 타겟 이미지에 대한 제1객체 영역 및 제2객체 영역 식별 결과를 예시적으로 나타낸 도면이다. 도 7a 내지 도 7i는 본원의 일 실시예에 따른 비전 기반의 수액 잔량 측정 장치와 연계된 실험예로서, 이미지 분석 알고리즘의 학습 결과 및 분석 성능을 나타낸 그래프이다. 도 8a는 데이터 셋에 따른 클래스별 IoU 평균값을 나타낸 도표이다. 도 8b는 LabPics Medical 데이터로 테스트한 결과값을 나타낸 도표이다. 도 9는 본원의 일 실시예에 따른 비전 기반의 수액 잔량 측정 장치의 개략적인 구성도이다.도 10은 본원의 일 실시예에 따른 비전 기반의 수액 잔량 측정 방법에 대한 동작 흐름도이다."}
