{"patent_id": "10-2022-0056214", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0078475", "출원번호": "10-2022-0056214", "발명의 명칭": "토목시설물 모델링 방법 및 그 방법을 수행하기 위한 전자 장치", "출원인": "(주)호산이엔", "발명자": "신학용"}}
{"patent_id": "10-2022-0056214", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 의해, 드론을 통해 획득한 공사 영역의 수치 지형 정보와 공사 영역에 대한 위성 이미지를 정합하여 평지에 비해 기울어진 사면을 포함하는 상기 공사 영역의 3D 모델을 생성하는 동작;상기 전자 장치에 의해, 사용자의 선택 입력에 대응하는 설계 뷰를 기초로 상기 공사 영역의 3D 모델로부터 상기 설계 뷰의 상기 공사 영역의 2D 이미지를 생성하는 동작;상기 전자 장치에 의해, 상기 공사 영역의 3D 모델 및 상기 설계 뷰의 상기 공사 영역의 2D 이미지와 동기화되는 설계 공간을 생성하는 동작;상기 전자 장치에 의해, 상기 설계 공간에서 상기 사용자의 설계 입력에 대응하여 토목시설물의 3D 모델 및 상기 사면의 최종 사면 모델을 생성하는 동작; 및상기 전자 장치에 의해, 상기 토목시설물의 3D 모델 및 상기 최종 사면 모델을 기초로 토공량을 계산하는 동작을 포함하고,상기 토목시설물의 3D 모델 및 상기 사면의 최종 사면 모델을 생성하는 동작은, 상기 설계 입력에 대응하여 상기 토목시설물의 횡단면 모델을 생성하는 동작을 포함하고,상기 토목시설물의 횡단면 모델을 생성하는 동작은,상기 설계 공간을 횡단면 공간으로 변환하는 동작;상기 설계 입력에 대응하여 상기 횡단면 공간에서 상기 토목시설물의 횡단면 모델을 생성하는 동작;상기 토목시설물을 구성하는 하나 이상의 구조물의 모델을 생성하는 동작; 및상기 하나 이상의 구조물의 모델에 대응하여 상기 사면을 수정하여 현재의 사면 모델을 생성하는 동작;을 포함하는, 토목시설물 모델링 방법."}
{"patent_id": "10-2022-0056214", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 토목시설물의 3D 모델 및 상기 사면의 최종 사면 모델을 생성하는 동작은,상기 설계 입력에 대응하여 상기 토목시설물의 평면 모델을 생성하는 동작;상기 설계 입력에 대응하여 상기 토목시설물의 종단면 모델을 생성하는 동작; 및상기 평면 모델, 상기 종단면 모델 및 상기 횡단면 모델을 정합하여 상기 토목시설물의 3D 모델을 생성하는 동작을 포함하는, 토목시설물 모델링 방법."}
{"patent_id": "10-2022-0056214", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 토목시설물의 평면 모델을 생성하는 동작은,상기 설계 공간을 평면 공간으로 변환하는 동작; 및상기 설계 입력에 대응하여 상기 평면 공간에서 상기 토목시설물의 평면 모델을 생성하는 동작을 포함하고,공개특허 10-2023-0078475-3-상기 토목시설물의 종단면 모델을 생성하는 동작은,상기 설계 공간을 종단면 공간으로 변환하는 동작; 및상기 설계 입력에 대응하여 상기 종단면 공간에서 상기 토목시설물의 종단면 모델을 생성하는 동작을 포함하는,토목시설물 모델링 방법."}
{"patent_id": "10-2022-0056214", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 토목시설물의 횡단면 모델을 생성하는 동작은,상기 현재의 사면 모델의 안정성을 계산하는 동작;상기 안정성이 임계 조건을 만족하는 경우, 상기 현재의 사면 모델을 상기 최종 사면 모델로서 출력하는 동작;및상기 안정성이 임계 조건을 만족하지 못하는 경우, 상기 현재의 사면 모델을 수정하여 다음의 사면 모델을 생성하는 동작을 더 포함하는, 토목시설물 모델링 방법."}
{"patent_id": "10-2022-0056214", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 안정성을 계산하는 동작은,상기 사면의 절편의 중량, 상기 사면의 경사각, 상기 사면의 내부마찰각, 상기 사면의 공극수압, 상기 사면의점착력, 상기 절편의 원호 길이를 기초로 상기 안정성을 계산하는 동작을 포함하는,토목시설물 모델링 방법."}
{"patent_id": "10-2022-0056214", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "카메라가 설치된 드론에 의해, 드론을 통해 획득한 공사 영역의 수치 지형 정보와 공사 영역에 대한 위성 이미지를 정합하여 평지에 비해 기울어진 사면을 포함하는 상기 공사 영역의 3D 모델을 생성하는 동작;전자 장치에 의해, 사용자의 선택 입력에 대응하는 설계 뷰를 기초로 상기 공사 영역의 3D 모델로부터 상기 설계 뷰의 상기 공사 영역의 2D 이미지를 생성하는 동작;전자 장치에 의해, 상기 공사 영역의 3D 모델 및 상기 설계 뷰의 상기 공사 영역의 2D 이미지와 동기화되는 설계 공간을 생성하는 동작;전자 장치에 의해, 상기 설계 공간에서 상기 사용자의 설계 입력에 대응하여 토목시설물의 3D 모델 및 상기 사면의 최종 사면 모델을 생성하는 동작; 및전자 장치에 의해, 상기 토목시설물의 3D 모델 및 상기 최종 사면 모델을 기초로 토공량을 계산하는 동작을 포함하고,상기 토목시설물의 3D 모델 및 상기 사면의 최종 사면 모델을 생성하는 동작은, 상기 설계 입력에 대응하여 상기 토목시설물의 횡단면 모델을 생성하는 동작을 포함하고,상기 토목시설물의 횡단면 모델을 생성하는 동작은,상기 설계 공간을 횡단면 공간으로 변환하는 동작;상기 설계 입력에 대응하여 상기 횡단면 공간에서 상기 토목시설물의 횡단면 모델을 생성하는 동작;상기 토목시설물을 구성하는 하나 이상의 구조물의 모델을 생성하는 동작; 및상기 하나 이상의 구조물의 모델에 대응하여 상기 사면을 수정하여 현재의 사면 모델을 생성하는 동작;공개특허 10-2023-0078475-4-을 포함하는, 토목시설물 모델링 방법."}
{"patent_id": "10-2022-0056214", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "카메라가 설치된 드론; 및전자 장치를 포함하고,상기 드론은 상기 공사 영역을 통과하고, 상기 카메라를 이용하여 상기 공사 영역의 지형 이미지를 획득하고,상기 전자 장치는,상기 드론을 통해 획득한 상기 지형 이미지와 상기 공사 영역에 대한 위성 이미지를 정합하여 평지에 비해 기울어진 사면을 포함하는 상기 공사 영역의 3D 모델을 생성하고,사용자의 선택 입력에 대응하는 설계 뷰를 기초로 상기 공사 영역의 3D 모델로부터 상기 설계 뷰의 상기 공사영역의 2D 이미지를 생성하고,상기 공사 영역의 3D 모델 및 상기 설계 뷰의 상기 공사 영역의 2D 이미지와 동기화되는 설계 공간을 생성하고,상기 설계 공간에서 상기 사용자의 설계 입력에 대응하여 토목시설물의 3D 모델 및 상기 사면의 최종 사면 모델을 생성하고,상기 토목시설물의 3D 모델 및 상기 최종 사면 모델을 기초로 토공량을 계산하고,상기 전자 장치는상기 설계 공간을 횡단면 공간으로 변환하는 동작;상기 설계 입력에 대응하여 상기 횡단면 공간에서 상기 토목시설물의 횡단면 모델을 생성하는 동작;상기 토목시설물을 구성하는 하나 이상의 구조물의 모델을 생성하는 동작; 및상기 하나 이상의 구조물의 모델에 대응하여 상기 사면을 수정하여 현재의 사면 모델을 생성하는 동작을 수행함으로써,상기 설계 입력에 대응하여 상기 토목시설물의 횡단면 모델을 생성하는,토목시설물 모델링 시스템."}
{"patent_id": "10-2022-0056214", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "프로세서;및 메모리를 포함하고,상기 프로세서는,드론을 통해 획득한 공사 영역의 수치 지형 정보와 공사 영역에 대한 위성 이미지를 정합하여 평지에 비해 기울어진 사면을 포함하는 상기 공사 영역의 3D 모델을 생성하고,사용자의 선택 입력에 대응하는 설계 뷰를 기초로 상기 공사 영역의 3D 모델로부터 상기 설계 뷰의 상기 공사영역의 2D 이미지를 생성하고,상기 공사 영역의 3D 모델 및 상기 설계 뷰의 상기 공사 영역의 2D 이미지와 동기화되는 설계 공간을 생성하고,상기 설계 공간에서 상기 사용자의 설계 입력에 대응하여 토목시설물의 3D 모델 및 상기 사면의 최종 사면 모델을 생성하고,상기 토목시설물의 3D 모델 및 상기 최종 사면 모델을 기초로 토공량을 계산하고,상기 프로세서는상기 설계 공간을 횡단면 공간으로 변환하는 동작;상기 설계 입력에 대응하여 상기 횡단면 공간에서 상기 토목시설물의 횡단면 모델을 생성하는 동작;공개특허 10-2023-0078475-5-상기 토목시설물을 구성하는 하나 이상의 구조물의 모델을 생성하는 동작; 및상기 하나 이상의 구조물의 모델에 대응하여 상기 사면을 수정하여 현재의 사면 모델을 생성하는 동작을 수행함으로써,상기 설계 입력에 대응하여 상기 토목시설물의 횡단면 모델을 생성하는,전자 장치."}
{"patent_id": "10-2022-0056214", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "드론에 있어서,프로세서;메모리; 이동 장치; 및카메라를 포함하고,상기 이동 장치는 상기 드론을 일정한 속도로 움직여서 공사 영역을 통과시키고, 상기 카메라는 상기 공사 영역의 지형 이미지를 획득하고,상기 프로세서는 상기 드론을 통해 획득한 상기 지형 이미지와 상기 공사 영역에 대한 위성 이미지를 정합하여평지에 비해 기울어진 사면을 포함하는 공사 영역의 3D 모델을 생성하고,전자 장치에 의해, 사용자의 선택 입력에 대응하는 설계 뷰를 기초로 상기 공사 영역의 3D 모델로부터 상기 설계 뷰의 상기 공사 영역의 2D 이미지는 생성되고, 상기 공사 영역의 3D 모델 및 상기 설계 뷰의 상기 공사 영역의 2D 이미지와 동기화되는 설계 공간은 생성되고, 상기 설계 공간에서 상기 사용자의 설계 입력에 대응하여 토목시설물의 3D 모델 및 상기 사면의 최종 사면 모델은 생성되고, 상기 토목시설물의 3D 모델 및 상기 최종 사면모델을 기초로 토공량은 계산되고,상기 전자 장치에 의해,상기 설계 입력에 대응하여 상기 토목시설물의 횡단면 모델을 생성하기 위해, 상기 설계 공간은 횡단면 공간으로 변환되고, 상기 설계 입력에 대응하여 상기 횡단면 공간에서 상기 토목시설물의 횡단면 모델은 생성되고, 상기 토목시설물을 구성하는 하나 이상의 구조물의 모델은 생성되고, 상기 하나 이상의 구조물의 모델에 대응하여상기 사면을 수정하여 현재의 사면 모델은 생성되는,드론."}
{"patent_id": "10-2022-0056214", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "실시예들은 토목시설물을 모델링하는 기술을 제공한다. 일 실시예에 따른 토목시설물 모델링 방법은, 전자 장치 에 의해, 사면을 포함하는 공사 영역의 3D 모델을 생성하는 동작; 상기 전자 장치에 의해, 사용자의 선택 입력에 대응하는 설계 뷰를 기초로 상기 공사 영역의 3D 모델로부터 상기 설계 뷰의 상기 공사 영역의 2D 이미지를 생성 하는 동작; 상기 전자 장치에 의해, 상기 공사 영역의 3D 모델 및 상기 설계 뷰의 상기 공사 영역의 2D 이미지와 동기화되는 설계 공간을 생성하는 동작; 상기 전자 장치에 의해, 상기 설계 공간에서 상기 사용자의 설계 입력에 대응하여 토목시설물의 3D 모델 및 상기 사면의 최종 사면 모델을 생성하는 동작; 및 상기 전자 장치에 의해, 상 기 토목시설물의 3D 모델 및 상기 최종 사면 모델을 기초로 토공량을 계산하는 동작을 포함할 수 있다."}
{"patent_id": "10-2022-0056214", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 실시예들은 토목시설물을 모델링하는 기술에 관한 것으로 2D 뷰와 3D 뷰를 연동하여 설계 공간을 제 공하는 토목시설물 모델링 기술에 대한 것이다."}
{"patent_id": "10-2022-0056214", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "종래에 이용되고 있는 토목시설물 모델링 기법은, 측량 기사가 현장에서 측량기(레벨)와 표척(프리즘)을 사용하 여 현황을 측량한 후, 그 측량정보를 디스켓 등으로 저장하여 설계실로 가지고 와서, 측량 정보를 기초로 하여 컴퓨터 지원 설계(CAD : Computer Aided Design) 프로그램 등을 이용하여 도로 또는 건물 등의 구조물 등에 대 한 작도를 행하는 방식이다. 상기한 바와 같은 종래 기술에 의하는 경우, 작업 능률이 저하될 뿐만 아니라 실시 간 작도가 불가능하다는 문제점이 있었다. 즉, 이러한 토목시설물 모델링 기법에서는 측량과 작도의 실시간 적 인 병행이 불가능하였다. 이러한 문제를 해결하기 위해 최근에는, 측량 기사가 직접 단말기를 가지고 다니면서, 측량기를 통해 현장에서 수집된 측량 정보를 이용하여, 측량된 지형에 대한 정보를 단말기 상에 표시하는 방법이 제공되고 있다. 즉, 측량기를 통해 측량된 측량 정보는 단말기로 유무선을 통해 다운로드 되며, 측량사는 측량된 측점들에 대한 측량 정보를 단말기를 통해 확인할 수 있다. 이러한, 측량정보에는 좌표정보, 고도정보 및 거리정보 등이 포함될 수 있다. 그러나, 측량사가 측량기준점을 잘못 설정하거나, 또는 측량기준점의 변경 등에 의해, 측량된 측점에 대 한 좌표정보가 측점의 실제 좌표 정보와 다른 경우가 발생될 수 있으며, 이러한 오류가 발생된 경우, 좌표 변환 을 통해 실제 측량된 측점들에 대한 오류 좌표정보를 정상 좌표정보로 변환시켜주어야 한다. 그러나, 종래에 이 러한 좌표변환을 수행하기 위해서는, 측량사가 측량기를 통해 측량한 좌표정보를 사무실로 가지고 와서, 개인용 컴퓨터(PC)와 같은 전산처리장치에 다운로드 하여, 복잡한 알고리즘을 갖는 프로그램을 이용하여 좌표 변환시킨 후, 이를 다시, 단말기에 다운로드 받아야만, 상기에서 측량된 오류 좌표 정보를 단말기에서 확인할 수 있었다."}
{"patent_id": "10-2022-0056214", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "위에서 설명한 배경기술은 발명자가 본원의 개시 내용을 도출하는 과정에서 보유하거나 습득한 것으로서, 반드 시 본 출원 전에 일반 공중에 공개된 공지기술이라고 할 수는 없다."}
{"patent_id": "10-2022-0056214", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "일 실시예에 따르면, 2D 공간과 3D 공간이 연동된 설계 공간을 제공함으로써 편집의 편의성과 결과물의 확인의 편의성을 함께 높일 수 있는 토목시설물 모델링 시스템이 제공된다. 실시예들에서 이루고자 하는 기술적 과제들은 이상에서 언급한 사항들로 제한되지 않으며, 언급하지 않은 또 다"}
{"patent_id": "10-2022-0056214", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "른 기술적 과제들은 이하 설명할 다양한 실시예들로부터 당해 기술분야에서 통상의 지식을 가진 자에 의해 고려 될 수 있다."}
{"patent_id": "10-2022-0056214", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시예에 따른 토목시설물 모델링 방법은, 전자 장치에 의해, 사면을 포함하는 공사 영역의 3D 모델을 생성 하는 동작; 상기 전자 장치에 의해, 사용자의 선택 입력에 대응하는 설계 뷰를 기초로 상기 공사 영역의 3D 모 델로부터 상기 설계 뷰의 상기 공사 영역의 2D 이미지를 생성하는 동작; 상기 전자 장치에 의해, 상기 공사 영 역의 3D 모델 및 상기 설계 뷰의 상기 공사 영역의 2D 이미지와 동기화되는 설계 공간을 생성하는 동작; 상기 전자 장치에 의해, 상기 설계 공간에서 상기 사용자의 설계 입력에 대응하여 토목시설물의 3D 모델 및 상기 사 면의 최종 사면 모델을 생성하는 동작; 및 상기 전자 장치에 의해, 상기 토목시설물의 3D 모델 및 상기 최종 사 면 모델을 기초로 토공량을 계산하는 동작을 포함할 수 있다. 상기 토목시설물의 3D 모델 및 상기 사면의 최종 사면 모델을 생성하는 동작은, 상기 설계 입력에 대응하여 상 기 토목시설물의 평면 모델을 생성하는 동작; 상기 설계 입력에 대응하여 상기 토목시설물의 종단면 모델을 생 성하는 동작; 상기 설계 입력에 대응하여 상기 토목시설물의 횡단면 모델을 생성하는 동작; 및 상기 평면 모델, 상기 종단면 모델 및 상기 횡단면 모델을 정합하여 상기 토목시설물의 3D 모델을 생성하는 동작을 포함할 수 있 다. 상기 토목시설물의 평면 모델을 생성하는 동작은, 상기 설계 공간을 평면 공간으로 변환하는 동작; 및 상기 설 계 입력에 대응하여 상기 평면 공간에서 상기 토목시설물의 평면 모델을 생성하는 동작을 포함하고, 상기 토목 시설물의 종단면 모델을 생성하는 동작은, 상기 설계 공간을 종단면 공간으로 변환하는 동작; 및 상기 설계 입 력에 대응하여 상기 종단면 공간에서 상기 토목시설물의 종단면 모델을 생성하는 동작을 포함하고, 상기 토목시 설물의 횡단면 모델을 생성하는 동작은, 상기 설계 공간을 횡단면 공간으로 변환하는 동작; 및 상기 설계 입력 에 대응하여 상기 횡단면 공간에서 상기 토목시설물의 횡단면 모델을 생성하는 동작을 포함할 수 있다. 상기 토목시설물의 횡단면 모델을 생성하는 동작은, 상기 토목시설물을 구성하는 하나 이상의 구조물의 모델을 생성하는 동작; 상기 하나 이상의 구조물의 모델에 대응하여 상기 사면을 수정하여 현재의 사면 모델을 생성하 는 동작; 상기 현재의 사면 모델의 안정성을 계산하는 동작; 상기 안정성이 임계 조건을 만족하는 경우, 상기 현재의 사면 모델을 상기 최종 사면 모델로서 출력하는 동작; 및 상기 안정성이 임계 조건을 만족하지 못하는 경우, 상기 현재의 사면 모델을 수정하여 다음의 사면 모델을 생성하는 동작을 포함할 수 있다. 상기 안정성을 계산하는 동작은, 상기 사면의 절편의 중량, 상기 사면의 경사각, 상기 사면의 내부마찰각, 상기 사면의 공극수압, 상기 사면의 점착력, 상기 절편의 원호 길이를 기초로 상기 안정성을 계산하는 동작을 포함할 수 있다. 상기 공사 영역의 3D 모델을 생성하는 동작은, 상기 공사 영역의 수치 지형 정보를 획득하는 동작; 상기 수치 지형 정보를 기초로 상기 공사 영역의 추정 삼각망 모델을 생성하는 동작; 및 상기 추정 삼각망 모델을 기초로 상기 공사 영역의 3D 모델을 생성하는 동작을 포함할 수 있다. 상기 수치 지형 정보를 획득하는 동작은, 상기 공사 영역을 통과하는 드론에 설치된 카메라를 이용하여 상기 공 사 영역의 지형 이미지를 획득하는 동작; 및 상기 지형 이미지를 기초로 상기 수치 지형 정보를 획득하는 동작 을 포함할 수 있다. 상기 공사 영역은 제1 분할 영역을 포함하는 복수의 분할 영역을 포함하고, 상기 수치 지형 정보를 획득하는 동 작은, 이전 시각의 상기 제1 분할 영역의 지형 이미지를 획득하는 동작; 및 상기 현재의 지형 이미지를 기초로 이전 시각의 상기 제1 분할 영역의 수치 지형 정보를 획득하는 동작을 포함하고, 상기 추정 삼각망 모델을 생성 하는 동작은, 상기 이전 시각의 상기 제1 분할 영역의 수치 지형 정보를 기초로 이전 시각의 상기 제1 분할 영 역의 임시 삼각망 모델을 생성하는 동작을 포함할 수 있다. 상기 추정 삼각망 모델을 생성하는 동작은, 오차 조정 모델을 이용하여 상기 이전 시각의 상기 제1 분할 영역의 임시 삼각망 모델 및 현재 시각의 상기 제1 분할 영역의 위성 이미지를 기초로 현재 시각의 상기 제1 분할 영역 의 추정삼각망 모델을 추정하는 동작을 포함할 수 있다. 다른 실시예에 따른 토목시설물 모델링 방법은, 카메라가 설치된 드론에 의해, 사면을 포함하는 공사 영역의 3D 모델을 생성하는 동작; 전자 장치에 의해, 사용자의 선택 입력에 대응하는 설계 뷰를 기초로 상기 공사 영역의 3D 모델로부터 상기 설계 뷰의 상기 공사 영역의 2D 이미지를 생성하는 동작; 전자 장치에 의해, 상기 공사 영 역의 3D 모델 및 상기 설계 뷰의 상기 공사 영역의 2D 이미지와 동기화되는 설계 공간을 생성하는 동작; 전자 장치에 의해, 상기 설계 공간에서 상기 사용자의 설계 입력에 대응하여 토목시설물의 3D 모델 및 상기 사면의 최종 사면 모델을 생성하는 동작; 및 전자 장치에 의해, 상기 토목시설물의 3D 모델 및 상기 최종 사면 모델을 기초로 토공량을 계산하는 동작을 포함할 수 있다. 일 실시예에 따른 토목시설물 모델링 시스템은, 카메라가 설치된 드론; 및 전자 장치를 포함하고, 상기 드론은 상기 공사 영역을 통과하고, 상기 카메라를 이용하여 상기 공사 영역의 지형 이미지를 획득하고, 상기 전자 장 치는, 상기 지형 이미지를 기초로 사면을 포함하는 공사 영역의 3D 모델을 생성하고, 사용자의 선택 입력에 대 응하는 설계 뷰를 기초로 상기 공사 영역의 3D 모델로부터 상기 설계 뷰의 상기 공사 영역의 2D 이미지를 생성 하고, 상기 공사 영역의 3D 모델 및 상기 설계 뷰의 상기 공사 영역의 2D 이미지와 동기화되는 설계 공간을 생 성하고, 상기 설계 공간에서 상기 사용자의 설계 입력에 대응하여 토목시설물의 3D 모델 및 상기 사면의 최종 사면 모델을 생성하고, 상기 토목시설물의 3D 모델 및 상기 최종 사면 모델을 기초로 토공량을 계산할 수 있다. 일 실시예에 따른 전자 장치는, 프로세서; 및 메모리를 포함하고, 상기 프로세서는, 사면을 포함하는 공사 영역 의 3D 모델을 생성하고, 사용자의 선택 입력에 대응하는 설계 뷰를 기초로 상기 공사 영역의 3D 모델로부터 상 기 설계 뷰의 상기 공사 영역의 2D 이미지를 생성하고, 상기 공사 영역의 3D 모델 및 상기 설계 뷰의 상기 공사 영역의 2D 이미지와 동기화되는 설계 공간을 생성하고, 상기 설계 공간에서 상기 사용자의 설계 입력에 대응하 여 토목시설물의 3D 모델 및 상기 사면의 최종 사면 모델을 생성하고, 상기 토목시설물의 3D 모델 및 상기 최종 사면 모델을 기초로 토공량을 계산할 수 있다. 다른 실시예에 따른 드론은, 프로세서; 메모리; 이동 장치; 및 카메라를 포함하고, 상기 이동 장치는 상기 드 론을 일정한 속도로 움직여서 상기 공사 영역을 통과시키고, 상기 카메라는 상기 공사 영역의 지형 이미지를 획 득하고, 상기 프로세서는 상기 지형 이미지를 기초로 사면을 포함하는 공사 영역의 3D 모델을 생성하고, 전자 장치에 의해, 사용자의 선택 입력에 대응하는 설계 뷰를 기초로 상기 공사 영역의 3D 모델로부터 상기 설계 뷰 의 상기 공사 영역의 2D 이미지는 생성되고, 상기 공사 영역의 3D 모델 및 상기 설계 뷰의 상기 공사 영역의 2D 이미지와 동기화되는 설계 공간은 생성되고, 상기 설계 공간에서 상기 사용자의 설계 입력에 대응하여 토목시설 물의 3D 모델 및 상기 사면의 최종 사면 모델은 생성되고, 상기 토목시설물의 3D 모델 및 상기 최종 사면 모델 을 기초로 토공량은 계산될 수 있다."}
{"patent_id": "10-2022-0056214", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "실시예들에 따르면, 토목시설물 모델링 시스템은 2D 공간과 3D 공간이 연동된 설계 공간을 제공함으로써 편집의 편의성과 결과물의 확인의 편의성을 함께 높일 수 있다. 실시예들로부터 얻을 수 있는 효과들은 이상에서 언급된 효과들로 제한되지 않으며, 언급되지 않은 또 다른 효"}
{"patent_id": "10-2022-0056214", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "과들은 이하의 상세한 설명을 기반으로 당해 기술분야에서 통상의 지식을 가진 자에게 명확하게 도출되고 이해될 수 있다."}
{"patent_id": "10-2022-0056214", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하의 실시예들은 실시예들의 구성요소들과 특징들을 소정 형태로 결합한 것들이다. 각 구성요소 또는 특징은 별도의 명시적 언급이 없는 한 선택적인 것으로 고려될 수 있다. 각 구성요소 또는 특징은 다른 구성요소나 특 징과 결합되지 않은 형태로 실시될 수 있다. 또한, 일부 구성요소들 및/또는 특징들을 결합하여 다양한 실시예 들을 구성할 수도 있다. 다양한 실시예들에서 설명되는 동작들의 순서는 변경될 수 있다. 어느 실시예의 일부 구성이나 특징은 다른 실시예에 포함될 수 있고, 또는 다른 실시예의 대응하는 구성 또는 특징과 교체될 수 있 다. 도면에 대한 설명에서, 다양한 실시예들의 요지를 흐릴 수 있는 절차 또는 단계 등은 기술하지 않았으며, 당해"}
{"patent_id": "10-2022-0056214", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "기술분야에서 통상의 지식을 가진 자의 수준에서 이해할 수 있을 정도의 절차 또는 단계는 또한 기술하지 아니 하였다. 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함(comprising 또는 including)\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미 한다. 또한, 명세서에 기재된 \"...부\", \"...기\", \"모듈\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어나 소프트웨어 또는 하드웨어 및 소프트웨어의 결합으로 구현될 수 있다. 또한, \"일(a 또는 an)\", \"하나(one)\", \"그(the)\" 및 유사 관련어는 다양한 실시예들을 기술하는 문맥에 있어서(특히, 이하의 청구항의 문맥에서) 본 명세서에 달리 지시되거나 문맥에 의해 분명하게 반박되지 않는 한, 단수 및 복 수 모두를 포함하는 의미로 사용될 수 있다. 이하, 다양한 실시예들에 따른 실시 형태를 첨부된 도면을 참조하여 상세하게 설명한다. 첨부된 도면과 함께 이 하에 개시될 상세한 설명은 다양한 실시예들의 예시적인 실시형태를 설명하고자 하는 것이며, 유일한 실시형태 를 나타내고자 하는 것이 아니다. 또한, 다양한 실시예들에서 사용되는 특정(特定) 용어들은 다양한 실시예들의 이해를 돕기 위해서 제공된 것이 며, 이러한 특정 용어의 사용은 다양한 실시예들의 기술적 사상을 벗어나지 않는 범위에서 다른 형태로 변경될 수 있다. 도 1은 일 실시예에 따른 전자 장치의 구성을 나타내는 도면이다. 도 1은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네 트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워크)를 통하여 전자 장 치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장치 또 는 서버 중 적어도 하나와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 서버를 통하여 전 자 장치와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈 , 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스, 연 결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈, 가입 자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장치에는, 이 구 성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어 떤 실시예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 전자 장치는 클라이언트, 단말기 또는 피 어로 지칭될 수도 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세서 는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메 모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메 모리에 저장할 수 있다. 일실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또 는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처 리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서 를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능에 특 화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있 다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구 성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일실시예에 따르면, 보조 프로 세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능 모델이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi- supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않 는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있 다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키(예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상 기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일실시예 에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일실시예에 따르면, 인터페이스는, 예 를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터 페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일실시예에 따르면, 카메라 모듈은 하나 이상 의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일실시예에 따르면, 전력 관리 모듈 은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일실시예에 따르면, 배터리 는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일실시예에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워 크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수 의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입 자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이 상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링 크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이 루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일실시예에 따르면, 안테나 모듈은 복수의 안테나들 (예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모 듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품 (예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요 청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일실시예에 따르면, 외부의 전자 장치 또는 서버는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 서버는 전자 장치가 접속되며, 접속된 전자 장치로 서비스를 제공할 수 있다. 또한, 서버 는 회원 가입 절차를 진행하여 그에 따라 회원으로 가입된 사용자의 각종 정보를 저장하여 관리하고, 서비스에 관련된 각종 구매 및 결제 기능을 제공할 수도 있다. 또한, 서버는, 사용자 간에 서비스를 공유할 수 있도 록, 복수의 전자 장치 각각에서 실행되는 서비스 애플리케이션의 실행 데이터를 실시간으로 공유할 수도 있다. 이러한 서버는 하드웨어적으로는 통상적인 웹 서버(Web Server) 또는 왑 서버(WAP Server)와 동일한 구성을 가질 수 있다. 그러나, 소프트웨어적으로는, C, C++, Java, Visual Basic, Visual C 등 여하한 언어를 통하여 구현되어 여러 가지 기능을 하는 프로그램 모듈(Module)을 포함할 수 있다. 또한, 서버는 일반적으 로 인터넷과 같은 개방형 컴퓨터 네트워크를 통하여 불특정 다수 클라이언트 및/또는 다른 서버와 연결되어 있 고, 클라이언트 또는 다른 서버의 작업수행 요청을 접수하고 그에 대한 작업 결과를 도출하여 제공하는 컴퓨터 시스템 및 그를 위하여 설치되어 있는 컴퓨터 소프트웨어(서버 프로그램)를 뜻하는 것이다. 또한, 서버는, 전술한 서버 프로그램 이외에도, 서버 상에서 동작하는 일련의 응용 프로그램(Application Program)과 경 우에 따라서는 내부 또는 외부에 구축되어 있는 각종 데이터베이스(DB: Database, 이하 \"DB\"라 칭함)를 포함하 는 넓은 개념으로 이해되어야 할 것이다. 따라서, 서버는, 회원 가입 정보와, 게임에 대한 각종 정보 및 데이터를 분류하여 DB에 저장시키고 관리하는데, 이러한 DB는 서버의 내부 또는 외부에 구현될 수 있다. 또한, 서버는, 일반적인 서버용 하드웨어에 도스(DOS), 윈도우(windows), 리눅스(Linux), 유닉스(UNIX), 매킨토시(Macintosh) 등의 운영체제에 따라 다양하게 제공되고 있는 서버 프로그램을 이용하여 구현될 수 있으 며, 대표적인 것으로는 윈도우 환경에서 사용되는 웹사이트(Website), IIS(Internet Information Server)와 유 닉스환경에서 사용되는 CERN, NCSA, APPACH등이 이용될 수 있다. 또한, 서버는, 서비스의 사용자 인증이나 서비스와 관련된 구매 결제를 위한 인증 시스템 및 결제 시스템과 연동할 수도 있다. 제1 네트워크 및 제2 네트워크는 단말들 및 서버들과 같은 각각의 노드 상호 간에 정보 교환이 가능 한 연결 구조 또는 서버와 전자 장치들(101, 104)을 연결하는 망(Network)을 의미한다. 제1 네트워크 및 제2 네트워크는 인터넷(Internet), LAN(Local Area Network), Wireless LAN(Wireless Local Area Network), WAN(Wide Area Network), PAN(Personal Area Network), 3G, 4G, LTE, 5G, Wi-Fi 등이 포함되나 이 에 한정되지는 않는다. 제1 네트워크 및 제2 네트워크는 LAN, WAN 등의 폐쇄형 제1 네트워크 및 제2 네트워크일 수도 있으나, 인터넷(Internet)과 같은 개방형인 것이 바람직하다. 인터넷은 TCP/IP 프로 토콜 및 그 상위계층에 존재하는 여러 서비스, 즉 HTTP(HyperText Transfer Protocol), Telnet, FTP(File Transfer Protocol), DNS(Domain Name System), SMTP(Simple Mail Transfer Protocol), SNMP(Simple Network Management Protocol), NFS(Network File Service), NIS(Network Information Service)를 제공하는 전 세계적 인 개방형 컴퓨터 제1 네트워크 및 제2 네트워크 구조를 의미한다. 데이터베이스는 데이터베이스 관리 프로그램(DBMS)을 이용하여 컴퓨터 시스템의 저장공간(하드디스크 또는 메모 리)에 구현된 일반적인 데이터구조를 가질 수 가질 수 있다. 데이터베이스는 데이터의 검색(추출), 삭제, 편집, 추가 등을 자유롭게 행할 수 있는 데이터 저장형태를 가질 수 있다. 데이터베이스는 오라클(Oracle), 인포믹스 (Infomix), 사이베이스(Sybase), DB2와 같은 관계형 데이타베이스 관리 시스템(RDBMS)이나, 겜스톤(Gemston), 오리온(Orion), O2 등과 같은 객체 지향 데이타베이스 관리 시스템(OODBMS) 및 엑셀론(Excelon), 타미노 (Tamino), 세카이주(Sekaiju) 등의 XML 전용 데이터베이스(XML Native Database)를 이용하여 본 개시의 일 실 시예의 목적에 맞게 구현될 수 있고, 자신의 기능을 달성하기 위하여 적당한 필드(Field) 또는 엘리먼트들을 가 질 수 있다. 도 2는 일 실시예에 따른 프로그램의 구성을 나타내는 도면이다. 도 2은 다양한 실시예에 따른 프로그램을 예시하는 블록도이다. 일실시예에 따르면, 프로그램은 전자 장치의 하나 이상의 리소스들을 제어하기 위한 운영 체제, 미들웨어, 또는 상기 운영 체제 에서 실행 가능한 어플리케이션을 포함할 수 있다. 운영 체제는, 예를 들면, AndroidTM, iOSTM, WindowsTM, SymbianTM, TizenTM, 또는 BadaTM를 포함할 수 있다. 프로그램 중 적어도 일부 프로그 램은, 예를 들면, 제조 시에 전자 장치에 프리로드되거나, 또는 사용자에 의해 사용 시 외부 전자 장치(예: 전자 장치(102 또는 104), 또는 서버)로부터 다운로드되거나 갱신 될 수 있다. 프로그램의 전부 또는 일부는 뉴럴 네트워크를 포함할 수 있다. 운영 체제는 전자 장치의 하나 이상의 시스템 리소스들(예: 프로세스, 메모리, 또는 전원)의 관리(예: 할당 또는 회수)를 제어할 수 있다. 운영 체제는, 추가적으로 또는 대체적으로, 전자 장치 의 다른 하드웨어 디바이스, 예를 들면, 입력 모듈, 음향 출력 모듈, 디스플레이 모듈, 오디오모듈, 센서 모듈, 인터페이스, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터 리, 통신 모듈, 가입자 식별 모듈, 또는 안테나 모듈을 구동하기 위한 하나 이상의 드라이 버 프로그램들을 포함할 수 있다. 미들웨어는 전자 장치의 하나 이상의 리소스들로부터 제공되는 기능 또는 정보가 어플리케이션 에 의해 사용될 수 있도록 다양한 기능들을 어플리케이션으로 제공할 수 있다. 미들웨어는, 예를 들 면, 어플리케이션 매니저, 윈도우 매니저, 멀티미디어 매니저, 리소스 매니저, 파워 매니 저, 데이터베이스 매니저, 패키지 매니저, 커넥티비티 매니저, 노티피케이션 매니저, 로케이션 매니저, 그래픽 매니저, 시큐리티 매니저, 통화 매니저, 또는 음성 인식 매니저 를 포함할 수 있다. 어플리케이션 매니저는, 예를 들면, 어플리케이션의 생명 주기를 관리할 수 있다. 윈도우 매니저 는, 예를 들면, 화면에서 사용되는 하나 이상의 GUI 자원들을 관리할 수 있다. 멀티미디어 매니저는, 예를 들면, 미디어 파일들의 재생에 필요한 하나 이상의 포맷들을 파악하고, 그 중 선택된 해당하는 포맷에 맞 는 코덱을 이용하여 상기 미디어 파일들 중 해당하는 미디어 파일의 인코딩 또는 디코딩을 수행할 수 있다. 리 소스 매니저는, 예를 들면, 어플리케이션의 소스 코드 또는 메모리의 메모리의 공간을 관리할 수 있다. 파워 매니저는, 예를 들면, 배터리의 용량, 온도 또는 전원을 관리하고, 이 중 해당 정보를 이용하여 전자 장치의 동작에 필요한 관련 정보를 결정 또는 제공할 수 있다. 일실시예에 따르면, 파워 매 니저는 전자 장치의 바이오스(BIOS: basic input/output system)(미도시)와 연동할 수 있다. 데이터베이스 매니저는, 예를 들면, 어플리케이션에 의해 사용될 데이터베이스를 생성, 검색, 또는 변경할 수 있다. 패키지 매니저는, 예를 들면, 패키지 파일의 형태로 배포되는 어플리케이션의 설치 또는 갱신을 관리할 수 있다. 커넥티비티 매니저는, 예를 들면, 전자 장치와 외부 전자 장치 간의 무선 연 결 또는 직접 연결을 관리할 수 있다. 노티피케이션 매니저는, 예를 들면, 지정된 이벤트(예: 착신 통화, 메시지, 또는 알람)의 발생을 사용자에게 알리기 위한 기능을 제공할 수 있다. 로케이션 매니저는, 예를 들면, 전자 장치의 위치 정보를 관리할 수 있다. 그래픽 매니저는, 예를 들면, 사용자에게 제공될 하 나 이상의 그래픽 효과들 또는 이와 관련된 사용자 인터페이스를 관리할 수 있다. 시큐리티 매니저는, 예를 들면, 시스템 보안 또는 사용자 인증을 제공할 수 있다. 통화(telephony) 매니저 는, 예를 들면, 전자 장치에 의해 제공되는 음성 통화 기능 또는 영상 통화 기능을 관리할 수 있다. 음성 인식 매니저는, 예를 들면, 사용자의 음성 데이터를 서버로 전송하고, 그 음성 데이터에 적어도 일부 기반하여 전자 장치에서 수행될 기능에 대응하는 명령어(command), 또는 그 음성 데이터에 적어도 일 부 기반하여 변환된 문자 데이터를 서버로부터 수신할 수 있다. 일 실시예에 따르면, 미들웨어는 동 적으로 기존의 구성요소를 일부 삭제하거나 새로운 구성요소들을 추가할 수 있다. 일 실시예에 따르면, 미들웨 어의 적어도 일부는 운영 체제의 일부로 포함되거나, 또는 운영 체제와는 다른 별도의 소프트웨 어로 구현될 수 있다. 어플리케이션은, 예를 들면, 홈, 다이얼러, SMS/MMS, IM(instant message), 브라우 저, 카메라, 알람, 컨택트, 음성 인식, 이메일, 달력, 미디어 플레이어 , 앨범, 와치, 헬스(예: 운동량 또는 혈당과 같은 생체 정보를 측정), 또는 환경 정보 (예: 기압, 습도, 또는 온도 정보 측정) 어플리케이션을 포함할 수 있다. 일실시예에 따르면, 어플리케이 션은 전자 장치와 외부 전자 장치 사이의 정보 교환을 지원할 수 있는 정보 교환 어플리케이션(미도 시)을 더 포함할 수 있다. 정보 교환 어플리케이션은, 예를 들면, 외부 전자 장치로 지정된 정보 (예: 통화, 메 시지, 또는 알람)를 전달하도록 설정된 노티피케이션 릴레이 어플리케이션, 또는 외부 전자 장치를 관리하도록 설정된 장치 관리 어플리케이션을 포함할 수 있다. 노티피케이션 릴레이 어플리케이션은, 예를 들면, 전자 장치 의 다른 어플리케이션(예: 이메일 어플리케이션)에서 발생된 지정된 이벤트(예: 메일 수신)에 대응하 는 알림 정보를 외부 전자 장치로 전달할 수 있다. 추가적으로 또는 대체적으로, 노티피케이션 릴레이 어플리케 이션은 외부 전자 장치로부터 알림 정보를 수신하여 전자 장치의 사용자에게 제공할 수 있다. 장치 관리 어플리케이션은, 예를 들면, 전자 장치와 통신하는 외부 전자 장치 또는 그 일부 구성 요소(예: 외부 전자장치의 디스플레이 모듈 또는 카메라 모듈)의 전원(예: 턴-온 또는 턴-오프) 또는 기능(예: 밝기, 해 상도, 또는 포커스)을 제어할 수 있다. 장치 관리 어플리케이션은, 추가적으로 또는 대체적으로, 외부 전자 장 치에서 동작하는 어플리케이션의 설치, 삭제, 또는 갱신을 지원할 수 있다.도 3은 일 실시예에 따른 토목시설물 모델링 시스템의 전체 구성을 도시한 도면이다. 일 실시예에 따르면, 토목시설물 모델링 시스템은 공사 영역에 상주하는 드론을 이용하여 실시간으로 공사 영역의 수치 지형 정보를 수집할 수 있다. 공사 영역의 수치 지형 정보에 오차가 있다고 판단될 경우 토목 시설물 모델링 시스템은 드론을 이용하여 빠르게 공사 영역의 수치 지형 정보를 재수집할 수 있다. 토목시설물 모델링 시스템은 2D 공간과 3D 공간을 연동하는 설계 공간을 제공할 수 있다. 사용자는 2D 공 간에서 모델을 수정할 수 있다. 2D 공간에서 수정된 정보는 3D 공간에 실시간으로 적용될 수 있다. 일반적으로 모델의 편집은 2D 공간에서 더 용이하고, 편집 결과가 정확한지를 판단하는 것은 3D 공간에서 더 용이할 수 있 다. 이처럼, 토목시설물 모델링 시스템은 2D 공간과 3D 공간이 연동된 설계 공간을 제공함으로써 편집의 편의성과 결과물의 확인의 편의성을 함께 높일 수 있다. 토목시설물 모델링 시스템은 지형 정보와 구조물 정보를 기초로 구조물에 배치되는 위치의 사면 모델을 생 성할 수 있다. 토목시설물 모델링 시스템은 지형의 속성을 기초로 사면 모델의 안정성을 자동으로 계산할 수 있다. 이처럼, 토목시설물 모델링 시스템은 사면 모델의 안정성을 실시간으로 계산하여 제공함으로써 공사의 설계 기간을 줄일 수 있다. 토목시설물 모델링 시스템은 서로 다른 종류의 지형 관련 정보를 융합하여 보다 정확한 공사 영역의 3D 모 델을 생성할 수 있다. 토목시설물 모델링 시스템은 드론을 통해 획득한 공사 영역의 수치 지형 정보와 공 사 영역에 대한 위성 이미지를 정합하여 공사 영역의 3D 모델을 생성할 수 있다. 토목시설물 모델링 시스템 은 공사 영역의 특정 영역에 대하여 드론의 종단 방향의 이동에 따라 시계열적으로 획득되는 이미지를 비 교하고, 비교 결과를 위성 이미지와 정합하여 공사 영역의 3D 모델을 생성할 수 있다. 이처럼, 동일한 지역에 대해 시간적으로 다양한 정보 및 서로 다른 소스로부터 획득된 동일한 지역에 대한 정보를 융합함으로써 보다 정확한 공사 영역의 3D 모델이 생성될 수 있다. 토목시설물 모델링 시스템은 설계 공간을 기초로 가상 현실(virtual reality, VR) 서비스를 제공할 수 있 다. 토목시설물 모델링 시스템은 설계 공간 상에서의 특정한 위치와 방향에 대응하여 설계 공간에 대한 2D 뷰(view) 또는 3D 뷰를 제공할 수 있다. 토목시설물 모델링 시스템은 시점의 이동 또는 변환에 대응하여 이동된 위치 또는 변환된 방향의 2D 뷰 또는 3D 뷰를 제공할 수 있다. 이처럼, 토목시설물 모델링 시스템 은 설계 공간을 가상 현실 공간으로서 제공함으로써 사용자가 실제로 공사 영역에 위치한 것과 같은 현실감을 제공할 수 있다. 이를 위하여, 토목시설물 모델링 시스템은 전자 장치(예: 도 1의 정자 장치) 및 드론을 포 함할 수 있다. 전자 장치는 프로세서(예: 도 1의 프로세서) 및 메모리(예: 도 1의 메모리)를 포 함할 수 있다. 전자 장치는 드론과 통신하기 위한 통신 모듈(예: 도 1의 통신 모듈)을 더 포함 할 수 있다. 이하에서, 공사 영역은 공사가 수행될 영역을 의미하고, 설계 뷰는 3D 공간 상에서 화면을 통해 바라보는 시점 을 의미하고, 설계 공간은 공사 영역의 3D 모델 및 설계 뷰의 공사 영역의 2D 이미지와 동기화되고 설계를 위한 작업이 수행되는 가상의 공간을 의미하고, 사면은 토목시설물의 한쪽 또는 양쪽 측면의 지형의 표면을 의미하고, 토목시설물은 공사를 통해 설치되는 인공물을 의미하고, 구조물은 토목시설물의 구성 요소를 의미할 수 있다. 전자 장치에는 토목시설물 모델링 방법을 구현하기 위한 프로그램(예: 도 2의 프로그램)이 설치될 수 있다. 프로그램은, 예를 들어, 건물 정보 통합 모델링(building information modeling, BIM)을 구현할 수 있다. BIM은 건축, 토목, 플랜트를 포함한 건설 전 분야에서 시설물 객체의 물리적 혹은 기능적 특성을 위해서 시설물 수명주기 동안 의사결정을 하는데 신뢰할 수 있는 근거를 제공하는 디지털 모델과 그의 작업을 위한 업 무절차를 포함하여 지칭할 수 있다. 전자 장치는 프로그램을 통하여 3D 모델링을 통해 디자인하고 이를 활용하여 공정 관리(4D), 원가 관리 (5D) 등을 수행할 수 있다. 전자 장치는 프로그램을 통하여 설계, 시공, 및 유지 관리의 토목의 전 과정에 서 획득되는 모든 정보를 통합하여 관리하는 프로세스를 제공할 수 있다. 예를 들어, 3D 모델링은 토공, 배수공, 옹벽공, 포장공, 부대공, 교량공, 터널공 등을 포함할 수 있다. 전자 장치의 프로그램은 다양한 정보를 취급할 수 있다. 예를 들어, 전자 장치는 수량 산출서, 설계 예산서, 계산서, 보고서, 업체 정보, 시뮬레이션, 재료 정보, 표준도 정보, 공정 정보, 비용 정보, 코드 정보,모델 정보를 입력하거나 출력하거나 처리하거나 저장할 수 있다. 여기서, 모델 정보는 도면 정보, 속성 정보, 형상 정보, 위치 정보, 물량 정보 등을 포함할 수 있다. 일 실시예에 따르면, 드론은 카메라를 포함할 수 있다. 다른 실시예에 따르면, 드론은 측량기를 포함 할 수도 있다. 드론은 공사 영역을 통과할 수 있다. 드론은 공사 영역의 종단 방향을 따라 이동할 수 있다. 드론은 카메라 또는 측량기를 이용하여 공사 영역의 지형 정보를 획득할 수 있다. 드론은 카메라를 통해 공사 영역의 지형 이미지를 획득할 수 있다. 드론은 위성항법시스템 (GNSS:Global Navigation Satellite System)을 통한 위치 정보를 수신할 수 있다. 전자 장치는 드론으로부터 지형 이미지를 수신할 수 있다. 전자 장치는 지형 이미지를 기초로 공사 영역의 3D 모델을 생성할 수 있다. 전자 장치는 지형 이미지를 기초로 사면을 포함하는 공사 영역의 3D 모델을 생성할 수 있다. 전자 장치는 드론으로부터 지형 이미지를 수신하는 한편, 수신된 지형 이 미지를 이용하여 공사 영역의 수치 지형 정보를 획득할 수 있다. 예를 들어, 수치 지형 정보는 공사 영역의 지 형의 높이, 길이, 좌표 등을 포함할 수 있다. 전자 장치는 획득된 수치 지형 정보를 이용하여 공사 영역의 지형 또는 토목시설물을 시각적으로 표현할 수 있다. 전자 장치에 의해 생성되는 3D 모델은 외부의 측량 프로그램과 호환될 수 있다. 예를 들어, 측량 프로그램 은 컴퓨터 지원 설계(CAD : Computer Aided Design)(이하, 간단히 '캐드'라 함) 방식을 기반으로 하여 구성될 수 있다. 전자 장치는 수치 지형 정보를 다양한 형태로 캐드 도면 상에 표시할 수 있을 뿐만 아니라, 현황 선 연결, 문자 표기 등의 편집 작업과 출력 기능을 제공할 수 있으며, 사용자(측량사 등)가 다양한 형태의 심벌 을 캐드도면 상에 입력하도록 할 수도 있다. 여기서, 컴퓨터 지원 설계(CAD)란, 사용자 단말기와 같은 컴퓨터에 기억되어 있는 설계정보를 이용하여, 사용자 가 지도 또는 다양한 형태의 구조물을 화면을 보면서 그릴 수 있도록 하는 한편, 그려진 지도 또는 구조물을 화 면을 통해 출력해 줄 수 있는 방식을 말하는 것이다. 측량 프로그램은 상기한 바와 같은 캐드를 지원하는 캐드 프로그램과, 측량과 관련된 프로그램을 접목시킨 프로그램을 말하는 것으로서, 구조물의 좌표 정보를 포함하는 다양한 수치 지형 정보를 캐드 도면에 표시할 수 있을 뿐만 아니라, 이를 다양한 형태로 편집하도록 하는 기능 을 제공할 수 있다. 측량 프로그램은 측량정보를 이용하여 각종 구조물들을 도면 상에 표시함에 있어서, 구조물 들을 단순히 그래픽적으로만 표시해 주는 것이 아니라, 각종 편집 및 응용이 가능하도록 캐드 기반상에서 구조 물들을 표시할 수도 있다. 토목시설물 모델링 시스템은 서로 다른 종류의 지형 관련 정보를 융합하여 보다 정확한 공사 영역의 3D 모 델을 생성할 수 있다. 토목시설물 모델링 시스템은 공사 영역의 특정 영역에 대하여 드론의 종단 방향의 이동에 따라 시계열적으로 획득되는 이미지를 비교하고, 비교 결과를 위성 이미지와 정합하여 공사 영역의 3D 모델을 생성할 수 있다. 전자 장치는 공사 영역의 수치 지형 정보를 획득할 수 있다. 전자 장치는 공사 영역을 통과하는 드론 에 설치된 카메라를 이용하여 공사 영역의 지형 이미지를 획득할 수 있다. 전자 장치는 지형 이미지를 기 초로 수치 지형 정보를 획득할 수 있다. 전자 장치는 수치 지형 정보를 기초로 공사 영역의 추정 삼각망 모델을 생성할 수 있다. 전자 장치는 추정 삼각망 모델 및 공사 영역의 위성 이미지를 정합하여 공사 영역 의 3D 모델을 생성할 수 있다. 여기서, 삼각측량법은 측량 구역을 삼각형으로 분할하여 각 지점의 수평위치를 결정하는 측량법의 하나이다. 삼 각측량에 필요한 삼각점들을 연결하여 여러 개의 삼각형들이 만들어지는데 이를 삼각망이라 한다. 공사 영역은 제1 분할 영역을 포함하는 복수의 분할 영역을 포함할 수 있다. 카메라가 설치된 드론이 실제 로 공사 영역을 이동하면서 공사 영역의 특정한 분할 영역(예: 제1 분할 영역)을 시계열적으로 연속적으로 촬영 할 수 있다. 드론은 동역학 모델에 따라 공사 영역을 이동하게 되며, 특정한 분할 영역을 기준으로 드론 의 동역할 모델 및 카메라의 자세 정보로부터 이동 모델이 도출될 수 있다. 이동 모델은 드론이 제1 위치에 있을 때 촬영된 특정한 분할 영역과 드론이 제2 위치에 있을 때 촬영된 특정한 분할 영역 간의 관 계를 나타내는 모델일 수 있다. 예를 들어, 이동 모델은 드론이 제2 위치에 있을 때 촬영된 특정한 분할 영역을 드론이 제1 위치에 있을 경우로 변환하는 모델일 수 있다. 전자 장치는 이전 시각의 제1 분할 영역의 지형 이미지를 획득할 수 있다. 전자 장치는 이전 시각의 제1 분할 영역의 지형 이미지를 기초로 이전 시각의 제1 분할 영역의 수치 지형 정보를 획득할 수 있다. 전자 장치는 이전 시각의 제1 분할 영역의 수치 지형 정보를 기초로 이전 시각의 제1 분할 영역의 임시 삼각망모델을 생성할 수 있다. 전자 장치는 오차 조정 모델을 이용하여 이전 시각의 제1 분할 영역의 임시 삼각망 모델 및 현재 시각의 제1 분할 영역의 위성 이미지를 기초로 현재 시각의 제1 분할 영역의 추정삼각망 모델을 추정할 수 있다. 전자 장치는 오차 조정 모델을 이용하여 이전 시각의 제1 분할 영역의 임시 삼각망 모델 및 현재 시각의 제1 분 할 영역의 위성 이미지를 기초로 현재 시각의 제1 분할 영역의 추정 삼각망 모델을 추정할 수 있다. 오차 조정 모델은 재귀적으로 동작하는 추정 알고리즘으로 이전의 삼각망 모델이 시간이 지남에 따라 전파되는 동종 업데 이트와 상이한 종류의 측정치가 들어오면 이를 융합하는 이종 업데이트 과정을 거친다. 오차 조정 모델은 일반 적인 선형 오차 조정 모델과 확장 오차 조정 모델 같은 비선형 방정식을 사용하는 비선형 알고리즘을 모두 포함 한다. 오차 조정 모델과 관련하여, 특정 시각의 삼각망 모델이 이전 시각의 삼각망 모델과 선형적인 관계를 가지는 선 형 시스템은 행렬 연산이 가능하다. 오차는 축적된 데이터에 따라 확률 분포의 형태로 미리 설정될 수도 있고, 미리 정해진 확률 분포를 따를 수도 있다. 후자의 경우, 예를 들어, 가우시안 확률 분포를 따를 수 있다. 다만, 이는 예시에 불과하며 다양한 형태의 확률 분포가 적용될 수 있다. 수학식 1"}
{"patent_id": "10-2022-0056214", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "수학식 2"}
{"patent_id": "10-2022-0056214", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "오차 조정 모델은 수학식 1과 수학식 2로 표현될 수 있다. 수학식 1와 수학식 2에서, A는 이전의 삼각망 모델에 기반한 삼각망 모델 전이 행렬이고, H는 삼각망 모델과 위성 이미지 간의 관계를 나타내는 행렬이며, w는 이동 모델의 자체 오차이고, v는 이동 모델과 위성 이미지 간의 오차이다. k는 k번째 시간 인덱스를 나타내고, k-1은 k-1번째 시간 인덱스를 나타낸다. 예를 들어, k는 현재 시각을 의미하고, k-1은 이전 시각을 의미할 수 있다. 삼각망 모델과 각각의 오차는 상호 독립적이라고 가정된다. z는 위성 이미지를 나타낸다. B는 입력 행렬, u는 입력 변수를 나타낸다. 예를 들어, Bkuk는 이동 모델에 대응하는 이전 시각과 현재 시각 간의 입력 벡터를 의미 할 수 있다. 수학식 3"}
{"patent_id": "10-2022-0056214", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "수학식 4"}
{"patent_id": "10-2022-0056214", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "수학식 5 수학식 6"}
{"patent_id": "10-2022-0056214", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "수학식 7"}
{"patent_id": "10-2022-0056214", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "수학식 3과 수학식 4는 이전의 삼각망 모델을 근거로 현재의 삼각망 모델을 예측하는 동종 업데이트 과정에 해 당하고, 수학식 5, 수학식 6 및 수학식 7은 위성 이미지를 기초로 삼각망 모델을 보정하는 이종 업데이트 과정 에 해당된다. 는 삼각망 모델을 의미하고, 는 오차 공분산 행렬를 의미하고, 는 이동 모델 자체의 오차인 수학식 1의 의 공분산을 나타내는 행렬이고, 은 이동 모델과 위성 이미지 간의 오차 의 공분산을 나타내 는 행렬이다. 는 추정된 것을 의미하고, -는 현재 시각의 삼각망 모델로 보정되기 전의 사전 추정치를 나타낸다. I는 항등 행렬을 의미한다. K는 수학식 5에 의해 정의되는 행렬이다. 전자 장치는 오차 조정 모델로부터 획득된 추정 삼각망 모델을 기초로 공사 영역의 3D 모델을 생성할 수 있다. 전자 장치는 오차 조정 모델로부터 획득된 각각의 분할 영역의 추정 삼각망 모델을 기초로 각각의 분할 영역의 3D 모델을 생성할 수 있다. 전자 장치는 각각의 분할 영역의 3D 모델을 연결하여 전체 공사 영역의 3D 모델을 생성할 수 있다. 전자 장치는 사용자의 선택 입력에 대응하는 설계 뷰를 기초로 공사 영역의 3D 모델로부터 설계 뷰의 공사 영역의 2D 이미지를 생성할 수 있다. 토목시설물 모델링 시스템은 설계 공간 상에서의 특정한 위치와 방향 에 대응하여 공사 영역의 3D 모델을 기초로 2D 이미지를 제공할 수 있다. 위치와 방향은 제어될 수 있으며, 제 어된 결과를 기초로 변환된 시점의 2D 이미지가 제공될 수 있다. 토목시설물 모델링 시스템은 2D 공간과 3D 공간을 연동하는 설계 공간을 제공할 수 있다. 전자 장치 는 공사 영역의 3D 모델 및 설계 뷰의 공사 영역의 2D 이미지와 동기화되는 설계 공간을 생성할 수 있다. 사용 자는 2D 이미지를 통해 편집을 수행할 수 있다. 2D 이미지의 편집에 대응하여 편집된 2D 이미지의 영역에 대응 하는 3D 모델의 영역이 편집될 수 있다. 3D 모델의 편집된 결과는 디스플레이를 통해 즉시 표시될 수 있다. 이 처럼, 토목시설물 모델링 시스템은 2D 공간과 3D 공간이 연동된 설계 공간을 제공함으로써 편집의 편의성 과 결과물의 확인의 편의성을 함께 높일 수 있다. 전자 장치는 설계 공간에서 사용자의 설계 입력에 대응하여 토목시설물의 3D 모델 및 사면의 최종 사면 모 델을 생성할 수 있다. 이하에서, 평면 모델은 평면선형에 대한 모델을 나타내고, 종단면 모델은 종단 선형에 대 응하는 모델을 나타낸다. 횡단면 모델은 종단 선형에 수직인 횡단 방향에 대응하는 모델을 나타낸다. 평면 선형 은 위에서 내려다본 선의 모양을 의미하며, 원곡선과 클로소이드 설계를 포함할 수 있다. 평면 선형은 곡선 반 격, 완화 곡선, 곡선부의 편경사, 곡선부의 확폭, 평면 곡선 길이 등을 고려하여 디자인될 수 있다. 종단 선형 은 지형의 오르막과 내리막의 현태를 선형으로 표시한 것으로, 직선 및 원곡선 등을 고려하여 디자인될 수 있다. 전자 장치는 설계 입력에 대응하여 토목시설물의 평면 모델을 생성할 수 있다. 전자 장치는 설계 공 간을 평면 공간으로 변환 할 수 있다. 전자 장치는 설계 입력에 대응하여 평면 공간에서 토목시설물의 평 면 모델을 생성할 수 있다. 전자 장치는 설계 입력에 대응하여 토목시설물의 종단면 모델을 생성 할 수 있다. 전자 장치는 설계 공간을 종단면 공간으로 변환할 수 있다. 전자 장치는 설계 입력에 대응하여 종단면 공간에서 토목시설물 의 종단면 모델을 생성할 수 있다. 전자 장치는 설계 입력에 대응하여 토목시설물의 횡단면 모델을 생성 할 수 있다. 전자 장치는 설계 공간을 횡단면 공간으로 변환할 수 있다. 전자 장치는 설계 입력에 대응하여 횡단면 공간에서 토목시설물 의 횡단면 모델을 생성할 수 있다.전자 장치는 토목시설물을 구성하는 하나 이상의 구조물의 모델을 생성할 수 있다. 전자 장치는 하나 이상의 구조물의 모델에 대응하여 사면을 수정하여 현재의 사면 모델을 생성할 수 있다. 전자 장치는 현재 의 사면 모델의 안정성을 계산할 수 있다. 전자 장치는 종단면 및 3D 설계 공간에서 배수 적합성을 검토하여 타당한 방향으로 구조물 모델 수정할 수 있고, 그 결과에 대응하여 사면 모델을 재생성할 수 있다. 예를 들어, 전자 장치는 사면의 절편의 중량, 사면의 경사각, 사면의 내부마찰각, 사면의 공극수압, 사면 의 점착력, 절편의 원호 길이를 기초로 안정성을 계산할 수 있다. 수학식 8"}
{"patent_id": "10-2022-0056214", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "여기서 Fs는 안전율을 나타내고, W는 절편의 중량(t/m)을 나타내고, 는 경사각(。)을 나타내고, Φ는 내 부마찰각(。)을 나타내고, μ는 단위면적당 공극수압(t/m2)을 나타내고, C는 흙의 점착력(t/m2)을 나타내고, L은 절편의 원호길이(m)를 나타낸다. 안정성이 임계 조건을 만족하는 경우, 전자 장치는 현재의 사면 모델을 최종 사면 모델로서 출력할 수 있 다. 안정성이 임계 조건을 만족하지 못하는 경우, 전자 장치는 현재의 사면 모델을 수정하여 다음의 사면 모델을 생성할 수 있다. 예를 들어, 안정성은 수학식 8의 안전율로 표현될 수 있고, 임계 조건은 안전율 1.2 이 상인 조건을 의미할 수 있다. 전자 장치는 상기와 같은 과정을 반복함으로써 마지막 사면 모델을 최종 사 면 모델로서 출력할 수 있다. 전자 장치는 평면 모델, 종단면 모델 및 횡단면 모델을 정합하여 토목시설물의 3D 모델을 생성 할 수 있다. 전자 장치는 토목시설물의 3D 모델 및 최종 사면 모델을 기초로 토공량을 계산할 수 있다. 전자 장 치는 공사 영역의 3D 모델에 토목시설물의 3D 모델 및 최종 사면 모델을 정합할 수 있다. 전자 장치 는 공사 영역의 3D 모델에서 토목시설물의 3D 모델과 중첩되는 공사 영역의 제1 영역 및 최종 사면 모델에 의해 배제되는 공사 영역의 제2 영역을 식별할 수 있다. 전자 장치는 제1 영역 및 제2 영역의 토공량을 계산할 수 있다. 전자 장치는 제1 영역 및 제2 영역의 부피와 지형의 특성 정보를 이용하여 제거되어야 하는 토공 량을 계산할 수 있다. 여기서, 토공량은 토목 공사 작업에서 다루는 흙의 양을 의미할 수 있다. 다만, 토공량 계산은 토목시설물 시공에 참고되는 설계자료의 일부이며 당 시스템에서는 토공량 뿐만 아니라 2D 도면 , 3D 솔리드 자료, BIM 등의 자료를 생성할 수 있다. 도 4는 일 실시예에 따른 토목시설물 모델링 방법의 동작을 도시한 흐름도이다. 일 실시예에 따르면, 동작에서, 전자 장치는 사면을 포함하는 공사 영역의 3D 모델을 생성할 수 있다. 일 실시예에 따르면, 동작에서, 전자 장치는 사용자의 선택 입력에 대응하는 설계 뷰를 기초로 공사 영역의 3D 모델로부터 설계 뷰의 공사 영역의 2D 이미지를 생성할 수 있다. 일 실시예에 따르면, 동작에서, 전자 장치는 공사 영역의 3D 모델 및 설계 뷰의 공사 영역의 2D 이미 지와 동기화되는 설계 공간을 생성할 수 있다. 일 실시예에 따르면, 동작에서, 전자 장치는 설계 공간에서 사용자의 설계 입력에 대응하여 토목시설 물의 3D 모델 및 사면의 최종 사면 모델을 생성할 수 있다. 일 실시예에 따르면, 동작에서, 전자 장치는 토목시설물의 3D 모델 및 최종 사면 모델을 기초로 토공 량을 계산할 수 있다.도 5는 다른 실시예에 따른 토목시설물 모델링 방법의 동작을 도시한 흐름도이다. 일 실시예에 따르면, 동작에서, 카메라가 설치된 드론은 사면을 포함하는 공사 영역의 3D 모델을 생 성할 수 있다. 일 실시예에 따르면, 동작에서, 전자 장치는 사용자의 선택 입력에 대응하는 설계 뷰를 기초로 공사 영역의 3D 모델로부터 설계 뷰의 공사 영역의 2D 이미지를 생성할 수 있다. 일 실시예에 따르면, 동작에서, 전자 장치는 공사 영역의 3D 모델 및 설계 뷰의 공사 영역의 2D 이미 지와 동기화되는 설계 공간을 생성할 수 있다. 일 실시예에 따르면, 동작에서, 전자 장치는 설계 공간에서 사용자의 설계 입력에 대응하여 토목시설 물의 3D 모델 및 사면의 최종 사면 모델을 생성할 수 있다. 일 실시예에 따르면, 동작에서, 전자 장치는 토목시설물의 3D 모델 및 최종 사면 모델을 기초로 토공 량을 계산할 수 있다. 도 6은 일 실시예에 따른 토목시설물 모델링 시스템의 파이프라인을 도시한 도면이다. 도 6을 참조하면, 토목시설물 모델링 시스템에 의해 수행되는 모델링 과정과 결과물이 도시된다. 토목시설 물 모델링 시스템은 설계 작업을 통해 설계 데이터를 획득할 수 있다. 토목시설물 모델링 시스 템은 설계 데이터을 기초로 데이터 표현을 생성할 수 있다. 토목시설물 모델링 시스템은 설계 데이터를 기초로 산출물을 획득할 수 있다. 설계 작업은 현황 입력, 평면 설계, 종단 설계 및 횡단 설계를 포함할 수 있다. 현 황 입력 단계에서, 공사 영역의 지형 정보를 입력할 수 있다. 토목시설물 모델링 시스템은 지형 이미 지를 기초로 수치 지형 정보를 획득할 수 있다. 토목시설물 모델링 시스템은 별도의 입력을 통해 직접 수 치 지형 정보를 획득할 수도 있다. 토목시설물 모델링 시스템은 추정 삼각망 모델을 생성할 수 있다. 토목시설물 모델링 시스템은 추정 삼각망 모델 및 공사 영역의 위성 이미지를 정합하여 공사 영역의 3D 모 델을 생성할 수 있다. 토목시설물 모델링 시스템은 삼각망 모델을 생성함으로써 3D 뷰를 제공할 수 있고, 삼각망에 위성사진을 오버레이하여 실제적인 공사 환경을 시뮬레이션할 수 있다. 토목시설물 모델링 시스템 은 위성 사진 오버레이를 통해 2D 뷰를 제공할 수 있고, 수치지형도와 위성사진을 동시에 확인하여 선형 설계에 실제적인 정보를 제공할 수 있다. 평면 설계 단계에서, 토목시설물 모델링 시스템은 설계 입력에 대응하여 토목시설물의 평면 모델을 생성할 수 있다. 토목시설물 모델링 시스템은 설계 공간을 평면 공간으로 변환 할 수 있다. 토목시설물 모 델링 시스템은 설계 입력에 대응하여 평면 공간에서 토목시설물의 평면 모델을 생성할 수 있다. 예를 들어, 평면 설계 단계는 원곡선과 클로소이드 설계를 포함할 수 있다. 평면 설계 단계에서, 평면 선 형은 곡선 반경, 완화 곡선, 곡선부의 편경사, 곡선부의 확폭, 평면 곡선 길이 등을 고려하여 디자인될 수 있다. 종단 설계 단계에서, 토목시설물 모델링 시스템은 설계 입력에 대응하여 토목시설물의 종단면 모델을 생성 할 수 있다. 지형과 토목시설물의 수직적 거리 관계에 따라 시스템은 교량 및 터널의 설치를 결정힐 수 있다. 토목시설물 모델링 시스템은 설계 공간을 종단면 공간으로 변환할 수 있다. 토목시설물 모델링 시스템은 설계 입력에 대응하여 종단면 공간에서 토목시설물의 종단면 모델을 생성할 수 있다. 종단 설계 단계에서, 종단 선형은 지형의 오르막과 내리막의 현태를 선형으로 표시한 것으로, 직선 및 원곡선 등을 고려하여 디자인될 수 있다. 횡단 설계 단계에서, 토목시설물 모델링 시스템은 설계 입력에 대응하여 토목시설물의 횡단면 모델을 생성 할 수 있다. 토목시설물 모델링 시스템은 설계 공간을 횡단면 공간으로 변환할 수 있다. 토목시설물 모델링 시스템은 설계 입력에 대응하여 횡단면 공간에서 토목시설물의 횡단면 모델을 생성할 수 있다. 설계 데이터는 현황 입력 단계의 데이터, 평면 설계 단계의 데이터, 종단 설계 단계의 데 이터 및 횡단 설계 단계의 데이터를 포함할 수 있다. 현황 입력 단계의 데이터는 수치 지형 정보 , 삼각망 모델, 위성 이미지를 포함할 수 있다. 평면 설계 단계의 데이터는 평면 선형 데이터가 포함될 수 있다. 종단 설계 단계의 데이터는 종단 선형 데이터가 포함될 수 있다. 예를 들어, 터널/교량의 경우 터널/교량의 종단 선형 데이터가 포함될 수 있다. 횡단 설계 단계의 데이 터는 토목시설물을 구성하는 구조물 및 사면 모델이 포함될 수 있다. 토목시설물 모델링 시스템은 설계 데이터를 기초로 다양한 형식의 데이터 표현을 구현할 수 있 다. 예를 들어, 토목시설물 모델링 시스템은 설계의 편의를 위해 2D 이미지를 제공할 수 있다. 토목 시설물 모델링 시스템은 편집 결과의 확인에 유용하도록 3D 모델을 제공할 수 있다. 토목시설물 모델 링 시스템은 2D 이미지와 3D 모델 간의 전환을 용이하게 해주는 사용자 인터페이스(user interface, UI)를 제공할 수 있다. 토목시설물 모델링 시스템은 공사에 필요한 산출물을 출력할 수 있다. 토목시설물 모델링 시스템 은 2D 도면을 제공할 수 있다. 예를 들어, 토목시설물 모델링 시스템은 평면, 종단, 횡단 각각 의 2D 도면을 제공할 수 있다. 토목시설물 모델링 시스템은 토공량을 산출할 수 있다. 토목시설물 모 델링 시스템은 공사 영역의 3D 모델, 구조물의 3D 모델 및 사면 모델을 이용하여 토공량을 산출할 수 있다. 토목시설물 모델링 시스템은 BIM 데이터를 제공할 수 있다. 예를 들어, 수량 산출서, 설계 예산서, 계산 서, 보고서, 업체 정보, 시뮬레이션, 재료 정보, 표준도 정보, 공정 정보, 비용 정보, 코드 정보, 모델 정보를 출력할 수 있다. 여기서, 모델 정보는 도면 정보, 속성 정보, 형상 정보, 위치 정보, 물량 정보 등을 포함할 수 있다. 예를 들어, 모델 정보는 공사 영역의 3D 모델, 구조물의 3D 모델 및 사면 모델에 대한 정보를 포함할 수 있다. 도 7은 일 실시예에 따른 토목시설물 모델링 시스템의 2D 뷰와 3D 뷰 간의 관계를 설명하기 위한 도면이다. 동작에서, 토목시설물 모델링 시스템은 작업 효율성을 위해 2D 뷰에서 설계 작업을 수행할 수 있도록 2D 환경을 제공할 수 있다. 사용자는 2D 공간에서 모델을 수정할 수 있다. 동작에서, 토목시설물 모델링 시스템은 2D 공간과 3D 공간을 연동하는 설계 공간을 제공할 수 있다. 2D 공간에서 수정된 정보는 설계 공간에서 3D 모델과 연동되어 3D 공간에 실시간으로 적용될 수 있 다. 동작에서, 토목시설물 모델링 시스템은 3D 시각화를 통한 설계 적합성 판단에 용이하도록 3D 뷰를 제 공할 수 있다. 일반적으로 모델의 편집은 2D 공간에서 더 용이하고, 편집 결과가 정확한지를 판단하는 것은 3D 공간에서 더 용이할 수 있다. 이처럼, 토목시설물 모델링 시스템은 2D 공간과 3D 공간이 연동된 설계 공간 을 제공함으로써 편집의 편의성과 결과물의 확인의 편의성을 함께 높일 수 있다. 도 8은 일 실시예에 따른 토목시설물 모델링 시스템에 의해 구현된 2D 이미지 및 3D 모델의 예시이다. 토목시설물 모델링 시스템은 설계 공간을 기초로 가상 현실(virtual reality, VR) 서비스를 제공할 수 있 다. 토목시설물 모델링 시스템은 설계 공간 상에서의 특정한 위치와 방향에 대응하여 설계 공간에 대한 2D 뷰(view) 또는 3D 뷰를 제공할 수 있다. 토목시설물 모델링 시스템은 시점의 이동 또는 변환에 대응하여 이동된 위치 또는 변환된 방향의 2D 뷰 또는 3D 뷰를 제공할 수 있다. 이처럼, 토목시설물 모델링 시스템 은 설계 공간을 가상 현실 공간으로서 제공함으로써 사용자가 실제로 공사 영역에 위치한 것과 같은 현실감을 제공할 수 있다. 도 8을 참조하면, 토목시설물 모델링 시스템은 설계 공간을 제공할 수 있다. 도 8의 설계 공간에서, 토목 시설물을 중심으로 시점이 이동될 수 있다. 예를 들어, 토목시설물이 도로 및 터널인 경우에, 시점은 도로를 이동하는 차량의 운전자의 시점일 수 있다. 화면은 운전자의 시점에서 표시되는 설계 공간의 3D 뷰 를 나타낸다. 시점이 특정한 토목시설물을 통과하는 경우, 해당 토목시설물에 대한 설명이 팝업의 형태로 표시될 수 있다. 예를 들어, 시점이 터널에 도달하는 경우, 화면이 팝업의 형태로 표시될 수 있다. 화면은 토목시설물을 잘 표현할 수 있는 도면이 포함될 수 있다. 예를 들어, 화면은 토목시설물에 대한 조감도, 설계도 등이 포함될 수 있다. 도 9는 일 실시예에 따른 토목시설물 모델링 시스템에 의해 토공량이 산출되는 과정을 도시한 도면이다. 일 실시예에 따르면, 동작에서, 토목시설물 모델링 시스템은 2D 이미지 상에서 설계 입력을 기초로 설계 작업을 수행할 수 있다. 토목시설물 모델링 시스템은 설계 공간을 평면 공간으로 변환 할 수 있다. 토목시설물 모델링 시스템은 설계 입력에 대응하여 평면 공간에서 토목시설물의 평면 모델을 생성할 수 있 다. 토목시설물 모델링 시스템은 설계 공간을 종단면 공간으로 변환할 수 있다. 토목시설물 모델링 시스템 은 설계 입력에 대응하여 종단면 공간에서 토목시설물의 종단면 모델을 생성할 수 있다. 토목시설물 모델 링 시스템은 설계 공간을 횡단면 공간으로 변환할 수 있다. 토목시설물 모델링 시스템은 설계 입력에 대응하여 횡단면 공간에서 토목시설물의 횡단면 모델을 생성할 수 있다. 일 실시예에 따르면, 동작에서, 토목시설물 모델링 시스템은 삼각망 모델을 생성할 수 있다. 공사 영 역의 지형 이미지를 획득할 수 있다. 전자 장치는 지형 이미지를 기초로 수치 지형 정보를 획득할 수 있다. 전자 장치는 수치 지형 정보를 기초로 공사 영역의 추정 삼각망 모델을 생성할 수 있다. 일 실시예에 따르면, 동작에서, 토목시설물 모델링 시스템은 사면 모델을 생성할 수 있다. 토목시설 물 모델링 시스템은 토목시설물을 구성하는 하나 이상의 구조물의 모델을 생성할 수 있다. 토목시설물 모 델링 시스템은 하나 이상의 구조물의 모델에 대응하여 사면을 수정하여 현재의 사면 모델을 생성할 수 있 다. 토목시설물 모델링 시스템은 현재의 사면 모델의 안정성을 계산할 수 있다. 일 실시예에 따르면, 동작에서, 토목시설물 모델링 시스템은 토공량을 산출할 수 있다. 토목시설물 모델링 시스템은 토목시설물의 3D 모델 및 최종 사면 모델을 기초로 토공량을 계산할 수 있다. 전자 장치 는 공사 영역의 3D 모델에서 토목시설물의 3D 모델과 중첩되는 공사 영역의 제1 영역 및 최종 사면 모델에 의해 배제되는 공사 영역의 제2 영역을 식별할 수 있다. 전자 장치는 제1 영역 및 제2 영역의 토공량을 계 산할 수 있다. 전자 장치는 제1 영역 및 제2 영역의 부피와 지형의 특성 정보를 이용하여 제거되어야 하는 토공량을 계산할 수 있다. 이처럼, 모든 3D 모델은 세부적인 설계 데이터와 연관되며 토공량을 포함하는 설계 오류가 줄어들 수 있다. 도 10은 일 실시예에 따른 전자 장치의 구성을 도시한 도면이다. 도 10을 참조하면, 전자 장치는 적어도 하나의 프로세서 및 메모리을 포함할 수 있다. 프로세서는 사면을 포함하는 공사 영역의 3D 모델을 생성할 수 있다. 프로세서는 사용자의 선택 입력에 대응하는 설계 뷰를 기초로 공사 영역의 3D 모델로부터 설계 뷰의 공사 영역의 2D 이미지를 생성할 수 있다. 프로세서는 공사 영역의 3D 모델 및 설계 뷰의 공사 영역의 2D 이미지와 동기화되는 설계 공간을 생성할 수 있다. 프로세서는 설계 공간에서 사용자의 설계 입력에 대응하여 토목시설물의 3D 모델 및 사면의 최종 사면 모 델을 생성할 수 있다. 프로세서는 토목시설물의 3D 모델 및 최종 사면 모델을 기초로 토공량을 계산할 수 있다. 도 11은 일 실시예에 따른 드론의 구성을 도시한 도면이다. 일 실시예에 따르면, 토목시설물 모델링 시스템에 포함된 드론은 프로세서, 메모리, 이 동 장치 및 카메라를 포함할 수 있다. 이동 장치는 드론을 일정한 속도로 움직여서 공사 영역을 통과시킬 수 있다. 카메라는 공사 영역의 지형 이미지를 획득할 수 있다. 프로세서는 지형 이미지를 기초로 사면을 포함하는 공사 영역의 3D 모델을 생성할 수 있다. 드론은 생성된 공사 영역의 3D 모델을 전자 장치로 전송할 수 있다. 전자 장치는 사용자의 선택 입력에 대응하는 설계 뷰를 기초로 공사 영역의 3D 모델로부터 설계 뷰의 공사 영역의 2D 이미지를 생성할 수 있다. 전자 장치는 공사 영역의 3D 모델 및 설계 뷰의 공사 영역의 2D 이미 지와 동기화되는 설계 공간을 생성할 수 있다. 전자 장치는 설계 공간에서 사용자의 설계 입력에 대응하여 토목시설물의 3D 모델 및 사면의 최종 사면 모델을 생성할 수 있다. 전자 장치는 토목시설물의 3D 모델 및 최종 사면 모델을 기초로 토공량은 계산할 수 있다. 이상에서 설명된 실시예들은 하드웨어 구성요소, 소프트웨어 구성요소, 및/또는 하드웨어 구성요소 및 소프트웨 어 구성요소의 조합으로 구현될 수 있다. 예를 들어, 실시예들에서 설명된 장치, 방법 및 구성요소는, 예를 들 어, 프로세서, 콘트롤러, ALU(arithmetic logic unit), 디지털 신호 프로세서(digital signal processor), 마 이크로컴퓨터, FPGA(field programmable gate array), PLU(programmable logic unit), 마이크로프로세서, 또는 명령(instruction)을 실행하고 응답할 수 있는 다른 어떠한 장치와 같이, 하나 이상의 범용 컴퓨터 또는 특수 목적 컴퓨터를 이용하여 구현될 수 있다. 처리 장치는 운영 체제(OS) 및 상기 운영 체제 상에서 수행되는 하나 이상의 소프트웨어 애플리케이션을 수행할 수 있다. 또한, 처리 장치는 소프트웨어의 실행에 응답하여, 데이터 를 접근, 저장, 조작, 처리 및 생성할 수도 있다. 이해의 편의를 위하여, 처리 장치는 하나가 사용되는 것으로"}
{"patent_id": "10-2022-0056214", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "설명된 경우도 있지만, 해당 기술분야에서 통상의 지식을 가진 자는, 처리 장치가 복수 개의 처리 요소 (processing element) 및/또는 복수 유형의 처리 요소를 포함할 수 있음을 알 수 있다. 예를 들어, 처리 장치 는 복수 개의 프로세서 또는 하나의 프로세서 및 하나의 콘트롤러를 포함할 수 있다. 또한, 병렬 프로세서 (parallel processor)와 같은, 다른 처리 구성(processing configuration)도 가능하다. 소프트웨어는 컴퓨터 프로그램(computer program), 코드(code), 명령(instruction), 또는 이들 중 하나 이상의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결합적으로 (collectively) 처리 장치를 명령할 수 있다. 소프트웨어 및/또는 데이터는, 처리 장치에 의하여 해석되거나 처리 장치에 명령 또는 데이터를 제공하기 위하여, 어떤 유형의 기계, 구성요소(component), 물리적 장치, 가상 장치(virtual equipment), 컴퓨터 저장 매체 또는 장치, 또는 전송되는 신호 파(signal wave)에 영구적으로, 또는 일시적으로 구체화(embody)될 수 있다. 소프트웨어는 네트워크로 연결된 컴퓨터 시스템 상에 분산되어서, 분산된 방법으로 저장되거나 실행될 수도 있다. 소프트웨어 및 데이터는 하나 이상의 컴퓨터 판독 가능 기록 매 체에 저장될 수 있다. 실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등 을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 실시예를 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판 독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체 (magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도 록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 상기된 하드웨어 장치는 실시예의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도 록 구성될 수 있으며, 그 역도 마찬가지이다."}
{"patent_id": "10-2022-0056214", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 11, "content": "이상과 같이 실시예들이 비록 한정된 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가진 자라면 상기를 기초로 다양한 기술적 수정 및 변형을 적용할 수 있다. 예를 들어, 설명된 기술들이 설명된 방법과 다 른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태 로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다. 그러므로, 다른 구현들, 다른 실시예들 및 특허청구범위와 균등한 것들도 후술하는 특허청구범위의 범위에 속한 다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11"}
{"patent_id": "10-2022-0056214", "section": "도면", "subsection": "도면설명", "item": 1, "content": "실시예들에 대한 이해를 돕기 위해 상세한 설명의 일부로 포함된, 첨부 도면은 다양한 실시예들을 제공하고, 상 세한 설명과 함께 다양한 실시예들의 기술적 특징을 설명한다. 도 1은 일 실시예에 따른 전자 장치의 구성을 나타내는 도면이다. 도 2는 일 실시예에 따른 프로그램의 구성을 나타내는 도면이다. 도 3은 일 실시예에 따른 토목시설물 모델링 시스템의 전체 구성을 도시한 도면이다. 도 4는 일 실시예에 따른 토목시설물 모델링 방법의 동작을 도시한 흐름도이다. 도 5는 다른 실시예에 따른 토목시설물 모델링 방법의 동작을 도시한 흐름도이다. 도 6은 일 실시예에 따른 토목시설물 모델링 시스템의 파이프라인을 도시한 도면이다. 도 7은 일 실시예에 따른 토목시설물 모델링 시스템의 2D 뷰와 3D 뷰 간의 관계를 설명하기 위한 도면이다. 도 8은 일 실시예에 따른 토목시설물 모델링 시스템에 의해 구현된 2D 이미지 및 3D 모델의 예시이다. 도 9는 일 실시예에 따른 토목시설물 모델링 시스템에 의해 토공량이 산출되는 과정을 도시한 도면이다. 도 10은 일 실시예에 따른 전자 장치의 구성을 도시한 도면이다. 도 11은 일 실시예에 따른 드론의 구성을 도시한 도면이다."}
