{"patent_id": "10-2023-0105107", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0023858", "출원번호": "10-2023-0105107", "발명의 명칭": "외국어 교육 플랫폼 서비스 제공 시스템", "출원인": "문윤선", "발명자": "문윤선"}}
{"patent_id": "10-2023-0105107", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자의 레벨에 대응하는 맞춤형 질문지를 출력한 후, 상기 맞춤형 질문지에 대응하는 응답을 얻기 위해 호 연결을 수행하며, 상기 응답을 텍스트로 입력한 응답지를 업로드한 후 첨삭지도를 받는 사용자 단말;상기 호 연결이 가능한 날짜 및 시간을 설정하고, 상기 사용자 단말의 호 연결 이벤트에 연결되며, 상기 맞춤형질문지를 포함하는 대본 데이터를 출력하는 헬퍼 단말;상기 사용자 단말과 상기 헬퍼 단말의 호 연결로 녹음된 음성발화 데이터를 수신하여 출력하고, 상기 음성발화데이터 내 음성발화를 텍스트로 변환한 스크립트를 출력하며, 상기 사용자 단말에서 업로드한 응답지를 출력한후 첨삭지도를 위한 첨삭 데이터를 업로드하는 강사 단말; 및상기 헬퍼 단말로부터 모국어를 선택받고 상기 호 연결이 가능한 날짜 및 시간을 설정받아 헬퍼풀을 구축하는헬퍼모집부, 적어도 하나의 레벨별 맞춤형 질문지 및 대본 데이터를 데이터베이스화하는 데이터베이스화부, 상기 사용자 단말의 레벨에 대응하는 맞춤형 질문지를 상기 사용자 단말로 전송하는 전송부, 상기 사용자 단말에서 호 연결을 수행하는 경우 실시간으로 연결가능한 헬퍼 단말을 검색한 후 연결을 수행하는 연결부, 상기 헬퍼단말로 대본 데이터를 전송하고 상기 사용자 단말과 상기 헬퍼 단말 간 음성발화를 녹음하는 녹음부, 상기 음성발화가 녹음된 음성발화 데이터로부터 음성발화를 텍스트로 변환하여 스크립트를 생성하는 생성부, 상기 사용자단말로부터 응답지를 수신하는 수신부, 상기 음성발화 데이터, 스크립트 및 응답지를 상기 강사 단말로 제공하는 제공부, 상기 강사 단말에서 상기 첨삭 데이터를 업로드한 경우 상기 사용자 단말로 제공하는 첨삭부를 포함하는 플랫폼 서비스 제공 서버;를 포함하는 외국어 교육 플랫폼 서비스 제공 시스템."}
{"patent_id": "10-2023-0105107", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 플랫폼 서비스 제공 서버는,상기 사용자 단말에서 인공지능 첨삭을 선택한 경우, 상기 사용자 단말의 응답지가 업로드된 후, 상기 응답지내 텍스트를 기 구축된 인공지능 알고리즘에서 분석하도록 하며, 상기 기 구축된 인공지능 알고리즘에서 첨삭데이터가 생성되는 경우 상기 사용자 단말로 전송하도록 하는 AI강사부;를 더 포함하는 것을 특징으로 하는 외국어 교육 플랫폼 서비스 제공 시스템."}
{"patent_id": "10-2023-0105107", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 플랫폼 서비스 제공 서버는,상기 사용자 단말에서 실시간 수업을 신청한 경우 상기 헬퍼 단말과 호 종료 후 상기 강사 단말과 호 연결이 되도록 설정하고, 상기 사용자 단말에서 수업시간을 설정한 경우, 상기 수업시간에 상기 강사 단말과 호 연결이되도록 설정하는 실시간옵션부;를 더 포함하는 것을 특징으로 하는 외국어 교육 플랫폼 서비스 제공 시스템."}
{"patent_id": "10-2023-0105107", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "공개특허 10-2025-0023858-3-제 1 항에 있어서,상기 플랫폼 서비스 제공 서버는,관리자 단말로부터 상황별 질문지 및 대본 데이터와, 수준별 질문지 및 대본 데이터를 업로드받아 지속적으로업데이트하는 업데이트부;를 더 포함하는 것을 특징으로 하는 외국어 교육 플랫폼 서비스 제공 시스템."}
{"patent_id": "10-2023-0105107", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 플랫폼 서비스 제공 서버는,상기 사용자 단말에서 모국어를 설정하고, 상기 사용자 단말의 모국어를 배우고자 하는 다른 사용자 단말에 대한 헬퍼를 등록하고 활동한 경우, 상기 사용자 단말에서 기 결제한 수강료로부터 건 당 캐시백을 지급받도록 하는 다중모드부;를 더 포함하는 것을 특징으로 하는 외국어 교육 플랫폼 서비스 제공 시스템."}
{"patent_id": "10-2023-0105107", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서,상기 플랫폼 서비스 제공 서버는,상기 사용자 단말, 헬퍼 단말 및 강사 단말 간을 연결할 때 전화 또는 화상으로 연결하는 전화화상부;를 더 포함하는 것을 특징으로 하는 외국어 교육 플랫폼 서비스 제공 시스템."}
{"patent_id": "10-2023-0105107", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서,상기 플랫폼 서비스 제공 서버는,상기 사용자 단말에서 상기 헬퍼 단말과 연결되는 시간은 기 설정된 시간으로 제한되고, 상기 사용자 단말에 제한시간을 카운트다운하여 표시하는 시간제한부;를 더 포함하는 것을 특징으로 하는 외국어 교육 플랫폼 서비스 제공 시스템."}
{"patent_id": "10-2023-0105107", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1 항에 있어서,상기 플랫폼 서비스 제공 서버는,상기 사용자 단말에서 상기 헬퍼 단말과 호 연결이 종료된 후, 상기 사용자 단말로부터 상기 헬퍼 단말의 헬퍼에 대한 평가점수를 제공받고, 상기 평가점수에 따라 호 연결의 횟수 및 빈도를 증감시키는 순위배정부;를 더 포함하는 것을 특징으로 하는 외국어 교육 플랫폼 서비스 제공 시스템."}
{"patent_id": "10-2023-0105107", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1 항에 있어서,공개특허 10-2025-0023858-4-상기 플랫폼 서비스 제공 서버는,상기 헬퍼 단말로 호 연결이 시도되었음에도 기 설정된 횟수 이상 전화를 수신하지 않는 경우 통화연결순위를후순위로 배치하는 배치부;를 더 포함하는 것을 특징으로 하는 외국어 교육 플랫폼 서비스 제공 시스템."}
{"patent_id": "10-2023-0105107", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 1 항에 있어서,상기 플랫폼 서비스 제공 서버는,상기 사용자 단말에서 상기 헬퍼 단말과 통화한 내역이 녹음된 상기 음성발화 데이터를 공유하는 경우 리워드를지급하고, 상기 사용자 단말의 레벨보다 더 높은 레벨의 음성발화 데이터에 엑세스가 가능하도록 설정하는 공유부;를 더 포함하는 것을 특징으로 하는 외국어 교육 플랫폼 서비스 제공 시스템."}
{"patent_id": "10-2023-0105107", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "외국어 교육 플랫폼 서비스 제공 시스템이 제공되며, 헬퍼 단말로부터 모국어를 선택받고 호 연결이 가능한 날짜 및 시간을 설정받아 헬퍼풀을 구축하는 헬퍼모집부, 적어도 하나의 레벨별 맞춤형 질문지 및 대본 데이터를 데이 터베이스화하는 데이터베이스화부, 사용자 단말의 레벨에 대응하는 맞춤형 질문지를 사용자 단말로 전송하는 전 (뒷면에 계속)"}
{"patent_id": "10-2023-0105107", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 외국어 교육 플랫폼 서비스 제공 시스템에 관한 것으로, 맞춤형 상황별 질문지를 제시함으로써 화상 전화 이전에 준비를 하도록 하고, 사용자와 강사 사이에 헬퍼를 투입함으로써 시간 및 비용을 효율적으로 이용 할 수 있도록 하는 솔루션을 제공한다."}
{"patent_id": "10-2023-0105107", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "원어민 화상영어란 원격 화상 시스템을 이용하여 영상과 소리가 실시간으로 서로에게 전달되면서 공간적으로 떨 어져 있는 교사와 학생 간에 교수 교습활동이 이루어지는 것이다. 원어민 화상영어 수업의 특징은 학생과 원어 민 교사 사이에 실시간 접촉이 가능하여 국내 및 해외 간에서도 가능하다. 또한 다양한 미디어의 사용을 지원 할 뿐만 아니라 비용이 적게 들어 경제적 이점이 큰 기술이다. 이러한 원어민 화상영어는 현지의 우수한 원어 민을 영어보조교사로 활용함으로써 원어민 교실 수업 외에 원어민의 살아있는 실용영어를 학생들이 접할 수 있 는 기회를 제공할 수 있다. EFL 환경에서 화상영어는 교실현장에서의 원어민을 대체할 수 있는 효율적인 영어 교육 방법이 될 수 있는데, 원어민과 학습자 간에 발생할 수 있는 잘못된 의사전달 및 학습내용에 대해서 즉각 적으로 교정하여 피드백을 제공함으로써 상호작용을 지속할 수 있게 해 준다. 이때, 학습자와 원어민 사이에 보조강사를 포함시켜 학습에 도움을 주도록 하거나 전화화상영어수업을 할 때 영 자신문을 멀티미디어 교재로 이용하는 구성이 연구 및 개발되었는데, 이와 관련하여, 선행기술인 한국등록특허 제10-1944628호(2019년01월31일 공고) 및 한국공개특허 제2010-0003895호(2010년01월12일 공개)에는, 학습자료 에 대한 데이터베이스를 구축한 후 예상질문을 생성하고, 원어민 단말로부터 모범답안을 입력받아 저장하며, 사 용자 단말에서 학습자료를 제공한 후 사용자 단말로부터 질문이 입력되면 보조강사 단말로 전달하여 응답을 하 도록 하는 구성과, 사용자 단말과 강사 단말 간 화상전화영어를 진행할 때 멀티미디어 교재를 영자신문으로 이 용하도록 할 때, 사용자의 레벨 및 스케줄에 따라 멀티미디어 교재를 제공하는 구성이 각각 개시되어 있다. 다만, 전자의 경우 원어민과 학습자를 연결하는 보조강사가 원어민과 동일하게 원어민이 아니라 외국어에 능통 한 보조강사로 학습자는 원어민과 소통할 기회를 얻지 못한다. 후자의 경우에는 사용자와 원어민 간 전화화상 영어를 수행하는 구성은 동일하지만 영자신문을 교재로 이용한다는 점만이 다를 뿐이다. 최근 북미 및 필리핀 등 다양한 원어민과 학습자를 연결하여 원어민 화상영어가 진행되고 있지만, 대부분 비즈니스 영어, 여행 영어, 면접 영어 등 학습목적에 따라 수업을 선택할 수 있을 뿐, 게임과 같이 퀘스트와 미션을 주고 사용자가 처한 상 황에 대해 대처할 수 있는 방식의 화상영어는 존재하지 않는다. 또 대부분의 원어민 화상영어가 시간이 되면 목적의식없이 통화를 한 후 종료되기 때문에 이로 인해 얻을 수 있는 것도 사실상 많지 않다. 이에, 사용자에 게는 맞춤형 질문지를 제시하고, 헬퍼에게는 대본 데이터를 제공하여 상황별 응답을 사용자가 헬퍼와의 대화에 서 찾도록 하고, 사용자와 헬퍼 간 대화 및 사용자의 응답지에 기초하여 강사가 첨삭하는 플랫폼의 연구 및 개발이 요구된다."}
{"patent_id": "10-2023-0105107", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 일 실시예는, 사용자 단말에서 학습할 외국어를 선택한 후 레벨 테스트를 받도록 하고, 레벨 테스트 의 결과에 따라 사용자 단말로 맞춤형 질문지를 제시하며, 사용자 단말에서 호 연결을 하는 경우 헬퍼 단말과 연결되도록 하고, 연결된 헬퍼 단말로 대본 데이터를 제공함으로써 사용자와 대화를 하도록 하며, 사용자 단말 에서 헬퍼와의 대화에서 얻은 응답으로 응답지를 작성하면, 음성발화 데이터를 스크립트로 생성한 후 응답지, 음성발화 데이터 및 스크립트를 강사 단말로 전송하고, 강사 단말에서 첨삭 데이터를 업로드하도록 하는, 외국 어 교육 플랫폼 서비스 제공 시스템을 제공할 수 있다. 다만, 본 실시예가 이루고자 하는 기술적 과제는 상기 된 바와 같은 기술적 과제로 한정되지 않으며, 또 다른 기술적 과제들이 존재할 수 있다."}
{"patent_id": "10-2023-0105107", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본 발명의 일 실시예는, 사용자의 레벨에 대응하는 맞 춤형 질문지를 출력한 후, 맞춤형 질문지에 대응하는 응답을 얻기 위해 호 연결을 수행하며, 응답을 텍스트로 입력한 응답지를 업로드한 후 첨삭지도를 받는 사용자 단말, 호 연결이 가능한 날짜 및 시간을 설정하고, 사용 자 단말의 호 연결 이벤트에 연결되며, 맞춤형 질문지를 포함하는 대본 데이터를 출력하는 헬퍼 단말, 사용자 단말과 헬퍼 단말의 호 연결로 녹음된 음성발화 데이터를 수신하여 출력하고, 음성발화 데이터 내 음성발화를 텍스트로 변환한 스크립트를 출력하며, 사용자 단말에서 업로드한 응답지를 출력한 후 첨삭지도를 위한 첨삭 데 이터를 업로드하는 강사 단말 및 헬퍼 단말로부터 모국어를 선택받고 호 연결이 가능한 날짜 및 시간을 설정받 아 헬퍼풀을 구축하는 헬퍼모집부, 적어도 하나의 레벨별 맞춤형 질문지 및 대본 데이터를 데이터베이스화하는 데이터베이스화부, 사용자 단말의 레벨에 대응하는 맞춤형 질문지를 사용자 단말로 전송하는 전송부, 사용자 단 말에서 호 연결을 수행하는 경우 실시간으로 연결가능한 헬퍼 단말을 검색한 후 연결을 수행하는 연결부, 헬퍼 단말로 대본 데이터를 전송하고 사용자 단말과 헬퍼 단말 간 음성발화를 녹음하는 녹음부, 음성발화가 녹음된 음성발화 데이터로부터 음성발화를 텍스트로 변환하여 스크립트를 생성하는 생성부, 사용자 단말로부터 응답지 를 수신하는 수신부, 음성발화 데이터, 스크립트 및 응답지를 강사 단말로 제공하는 제공부, 강사 단말에서 첨 삭 데이터를 업로드한 경우 사용자 단말로 제공하는 첨삭부를 포함하는 플랫폼 서비스 제공 서버를 포함한다."}
{"patent_id": "10-2023-0105107", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본 발명의 과제 해결 수단 중 어느 하나에 의하면, 사용자 단말에서 학습할 외국어를 선택한 후 레벨 테 스트를 받도록 하고, 레벨 테스트의 결과에 따라 사용자 단말로 맞춤형 질문지를 제시하며, 사용자 단말에서 호 연결을 하는 경우 헬퍼 단말과 연결되도록 하고, 연결된 헬퍼 단말로 대본 데이터를 제공함으로써 사용자와 대 화를 하도록 하며, 사용자 단말에서 헬퍼와의 대화에서 얻은 응답으로 응답지를 작성하면, 음성발화 데이터를 스크립트로 생성한 후 응답지, 음성발화 데이터 및 스크립트를 강사 단말로 전송하고, 강사 단말에서 첨삭 데이 터를 업로드하도록 함으로써, 사용자에게는 맞춤형 질문지를 제시하여 사용자가 화상영어시간 이전에 예습을 할 수 있도록 하고, 헬퍼에게는 대본 데이터를 제공함으로써 역할을 명확히 부여하고 의미없는 대화로 시간을 낭비 하지 않도록 할 수 있으며, 강사는 효율적으로 사용자의 잘못된 부분을 고쳐줄 수 있고 첨삭을 할 수 있도록 역 할분배를 함으로써 효율적이면서 효과적인 플랫폼을 구축할 수 있다."}
{"patent_id": "10-2023-0105107", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본 발명의 실시예를 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관 계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\"되어 있는 경우도 포함한다. 또한 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아 니라 다른 구성요소를 더 포함할 수 있는 것을 의미하며, 하나 또는 그 이상의 다른 특징이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해 되어야 한다. 명세서 전체에서 사용되는 정도의 용어 \"약\", \"실질적으로\" 등은 언급된 의미에 고유한 제조 및 물질 허용오차 가 제시될 때 그 수치에서 또는 그 수치에 근접한 의미로 사용되고, 본 발명의 이해를 돕기 위해 정확하거나 절 대적인 수치가 언급된 개시 내용을 비양심적인 침해자가 부당하게 이용하는 것을 방지하기 위해 사용된다. 본 발명의 명세서 전체에서 사용되는 정도의 용어 \"~(하는) 단계\" 또는 \"~의 단계\"는 \"~ 를 위한 단계\"를 의미하지 않는다. 본 명세서에 있어서 '부(部)'란, 하드웨어에 의해 실현되는 유닛(unit), 소프트웨어에 의해 실현되는 유닛, 양 방을 이용하여 실현되는 유닛을 포함한다. 또한, 1 개의 유닛이 2 개 이상의 하드웨어를 이용하여 실현되어도 되고, 2 개 이상의 유닛이 1 개의 하드웨어에 의해 실현되어도 된다. 한편, '~부'는 소프트웨어 또는 하드웨어 에 한정되는 의미는 아니며, '~부'는 어드레싱 할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 '~부'는 소프트웨어 구성요소들, 객 체 지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로코드, 회 로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레이들 및 변수들을 포함한다. 구성요소들과 '~부'들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 '~부'들로 결합되거나 추가적인 구성요소들과 '~부'들로 더 분리될 수 있다. 뿐만 아니라, 구성요소들 및 '~부'들은 디바이스 또는 보안 멀티미디어카드 내의 하나 또 는 그 이상의 CPU들을 재생시키도록 구현될 수도 있다. 본 명세서에 있어서 단말, 장치 또는 디바이스가 수행하는 것으로 기술된 동작이나 기능 중 일부는 해당 단말, 장치 또는 디바이스와 연결된 서버에서 대신 수행될 수도 있다. 이와 마찬가지로, 서버가 수행하는 것으로 기 술된 동작이나 기능 중 일부도 해당 서버와 연결된 단말, 장치 또는 디바이스에서 수행될 수도 있다. 본 명세서에서 있어서, 단말과 매핑(Mapping) 또는 매칭(Matching)으로 기술된 동작이나 기능 중 일부는, 단말 의 식별 정보(Identifying Data)인 단말기의 고유번호나 개인의 식별정보를 매핑 또는 매칭한다는 의미로 해석 될 수 있다. 이하 첨부된 도면을 참고하여 본 발명을 상세히 설명하기로 한다. 도 1은 본 발명의 일 실시예에 따른 외국어 교육 플랫폼 서비스 제공 시스템을 설명하기 위한 도면이다. 도 1 을 참조하면, 외국어 교육 플랫폼 서비스 제공 시스템은, 적어도 하나의 사용자 단말, 플랫폼 서비스 제공 서버, 적어도 하나의 헬퍼 단말, 적어도 하나의 강사 단말을 포함할 수 있다. 다만, 이러 한 도 1의 외국어 교육 플랫폼 서비스 제공 시스템은, 본 발명의 일 실시예에 불과하므로, 도 1을 통하여 본 발명이 한정 해석되는 것은 아니다. 이때, 도 1의 각 구성요소들은 일반적으로 네트워크(Network, 200)를 통해 연결된다. 예를 들어, 도 1에 도시 된 바와 같이, 적어도 하나의 사용자 단말은 네트워크를 통하여 플랫폼 서비스 제공 서버와 연 결될 수 있다. 그리고, 플랫폼 서비스 제공 서버는, 네트워크를 통하여 적어도 하나의 사용자 단말 , 적어도 하나의 헬퍼 단말, 적어도 하나의 강사 단말과 연결될 수 있다. 또한, 적어도 하나의 헬퍼 단말은, 네트워크를 통하여 플랫폼 서비스 제공 서버와 연결될 수 있다. 그리고, 적어도 하나의 강사 단말은, 네트워크를 통하여 적어도 하나의 사용자 단말, 플랫폼 서비스 제공 서버 및 적어도 하나의 헬퍼 단말과 연결될 수 있다. 여기서, 네트워크는, 복수의 단말 및 서버들과 같은 각각의 노드 상호 간에 정보 교환이 가능한 연결 구조를 의 미하는 것으로, 이러한 네트워크의 일 예에는 근거리 통신망(LAN: Local Area Network), 광역 통신망(WAN: Wide Area Network), 인터넷(WWW: World Wide Web), 유무선 데이터 통신망, 전화망, 유무선 텔레비전 통신망등을 포함한다. 무선 데이터 통신망의 일례에는 3G, 4G, 5G, 3GPP(3rd Generation Partnership Project), 5GPP(5th Generation Partnership Project), 5G NR(New Radio), 6G(6th Generation of Cellular Networks), LTE(Long Term Evolution), WIMAX(World Interoperability for Microwave Access), 와이파이(Wi-Fi), 인터넷 (Internet), LAN(Local Area Network), Wireless LAN(Wireless Local Area Network), WAN(Wide Area Network), PAN(Personal Area Network), RF(Radio Frequency), 블루투스(Bluetooth) 네트워크, NFC(Near- Field Communication) 네트워크, 위성 방송 네트워크, 아날로그 방송 네트워크, DMB(Digital Multimedia Broadcasting) 네트워크 등이 포함되나 이에 한정되지는 않는다. 하기에서, 적어도 하나의 라는 용어는 단수 및 복수를 포함하는 용어로 정의되고, 적어도 하나의 라는 용어가 존재하지 않더라도 각 구성요소가 단수 또는 복수로 존재할 수 있고, 단수 또는 복수를 의미할 수 있음은 자명 하다 할 것이다. 또한, 각 구성요소가 단수 또는 복수로 구비되는 것은, 실시예에 따라 변경가능하다 할 것이다. 적어도 하나의 사용자 단말은, 외국어 교육 플랫폼 서비스 관련 웹 페이지, 앱 페이지, 프로그램 또는 애 플리케이션을 이용하여 원하는 외국어를 선택하고, 선택한 외국어에 대한 레벨 테스트를 진행하며, 레벨 테스트 결과에 따라 맞춤형 질문지를 제시받고, 호 연결로 헬퍼 단말과 연결되며, 연결이 종료된 후 응답지를 업 로드하며, 강사 단말로부터 첨삭지도를 받거나 실시간 또는 스케줄에 따라 강사 단말과 연결되어 수 업을 진행하는 단말일 수 있다. 여기서, 적어도 하나의 사용자 단말은, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터 로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데 스크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 이때, 적어도 하나의 사용자 단말은, 네트워크를 통해 원격지의 서버나 단말에 접속할 수 있는 단말로 구현될 수 있다. 적어도 하나의 사용자 단말은, 예 를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, 네비게이션, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말, 스마트폰(Smartphone), 스마트 패드(Smartpad), 타블렛 PC(Tablet PC) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수 있다. 플랫폼 서비스 제공 서버는, 외국어 교육 플랫폼 서비스 웹 페이지, 앱 페이지, 프로그램 또는 애플리케이 션을 제공하는 서버일 수 있다. 그리고, 플랫폼 서비스 제공 서버는, 적어도 하나의 헬퍼 단말 및 강사 단말로부터 모국어, 가능시간대, 경력, 학력 및 자격증 등을 수신하여 헬퍼풀을 구축하는 서버일 수 있다. 또한, 플랫폼 서비스 제공 서버는, 상황별 및 레벨별로 질문지 및 대본 데이터를 저장하는 서버일 수 있다. 그리고, 플랫폼 서비스 제공 서버는, 사용자 단말에서 외국어를 선택하고 레벨 테스트를 받은 경우, 레벨에 맞는 맞춤형 질문지를 제공하고, 헬퍼 단말과 연결시켜주며, 헬퍼 단말로 대본 데 이터를 제공하여 사용자와 대화를 하도록 하는 서버일 수 있다. 또한, 플랫폼 서비스 제공 서버는, 사용 자 단말과 헬퍼 단말 간 통화를 녹음한 음성발화 데이터를 STT(Speech to Text)를 이용하여 스크립트 를 생성하고, 사용자 단말로부터 응답지를 수신하며, 음성발화 데이터, 스크립트 및 응답지를 강사 단말 로 제공하는 서버일 수 있다. 그리고, 플랫폼 서비스 제공 서버는, 강사 단말에서 첨삭 데이터 를 업로드하는 경우, 사용자 단말로 전송하는 서버일 수 있다. 또한, 플랫폼 서비스 제공 서버는, 사용자 단말과 강사 단말 간 수업을 사용자가 원하는 시간에 또는 헬퍼와의 호 연결 바로 다음에 연 결하여 주는 서버일 수 있다. 여기서, 플랫폼 서비스 제공 서버는, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스 크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 적어도 하나의 헬퍼 단말은, 외국어 교육 플랫폼 서비스 관련 웹 페이지, 앱 페이지, 프로그램 또는 애플 리케이션을 이용하여 모국어 및 가능시간대를 등록하는 헬퍼의 단말일 수 있다. 그리고 헬퍼 단말은, 플 랫폼 서비스 제공 서버로부터 호 연결 요청이 수신되면 이에 대하여 수락 또는 거절하는 단말일 수 있고, 수락하는 경우 플랫폼 서비스 제공 서버로부터 대본 데이터를 수신하여 출력하는 단말일 수 있다. 이때, 헬퍼 단말은 헬퍼로 지원을 할 때 헬퍼가 원하는 학습자 수준, 미션 카테고리 등을 선택할 수 있는데, 예 를 들어, 학습자 연령대, 학습자 레벨, 미션 카테고리(비즈니스/일상/여행 등)를 설정할 수 있다. 또, 헬퍼 단말은, 통화 가능한 요일과 시간대를 설정할 수 있다. 여기서, 적어도 하나의 헬퍼 단말은, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스 크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 이때, 적어도 하나의 헬퍼 단말은, 네트워크를 통해 원격지의 서버나 단말에 접속할 수 있는 단말로 구현될 수 있다. 적어도 하나의 헬퍼 단말은, 예를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, 네비게이션, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말, 스마트폰(Smartphone), 스마트 패드(Smartpad), 타블렛 PC(Tablet PC) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수 있다. 적어도 하나의 강사 단말은, 외국어 교육 플랫폼 서비스 관련 웹 페이지, 앱 페이지, 프로그램 또는 애플 리케이션을 이용하여 플랫폼 서비스 제공 서버로부터 음성발화 데이터, 스크립트 및 응답지를 수신하고, 첨삭 데이터를 업로드하는 강사의 단말일 수 있다. 그리고, 강사 단말은, 사용자 단말과 플랫폼 서 비스 제공 서버를 통하여 연결되는 단말일 수 있다. 강사 단말은 강사로 등록되기 위하여 강사지원 페이지에서 테스트용 녹음본과 테스트용 스크립트를 확인 후 강의자료와 모의수업을 제작하여 제출할 수 있다. 이에 따라 제출한 자료가 검토된 후 채용여부가 결정될 수 있다. 강사 단말은 지원을 할 때 원하는 수업 기준을 선택할 수 있는데, 예를 들어, 원하는 학습자 연령대, 학습자 레벨, 학습주제, 화상수업 가능여부 및 실 시간수업 가능여부 등을 선택할 수 있다. 여기서, 적어도 하나의 강사 단말은, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스 크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 이때, 적어도 하나의 강사 단말은, 네트워크를 통해 원격지의 서버나 단말에 접속할 수 있는 단말로 구현될 수 있다. 적어도 하나의 강사 단말은, 예를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, 네비게이션, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말, 스마트폰(Smartphone), 스마트 패드(Smartpad), 타블렛 PC(Tablet PC) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수 있다. 도 2는 도 1의 시스템에 포함된 플랫폼 서비스 제공 서버를 설명하기 위한 블록 구성도이고, 도 3 및 도 4는 본 발명의 일 실시예에 따른 외국어 교육 플랫폼 서비스가 구현된 일 실시예를 설명하기 위한 도면이다. 도 2를 참조하면, 플랫폼 서비스 제공 서버는, 헬퍼모집부, 데이터베이스화부, 전송부, 연 결부, 녹음부, 생성부, 수신부, 제공부, 첨삭부, AI강사부, 실시간옵션부 , 업데이트부, 다중모드부, 전화화상부, 시간제한부, 순위배정부, 배치부 및 공유부를 포함할 수 있다. 본 발명의 일 실시예에 따른 플랫폼 서비스 제공 서버나 연동되어 동작하는 다른 서버(미도시)가 적어도 하나의 사용자 단말, 적어도 하나의 헬퍼 단말 및 적어도 하나의 강사 단말로 외국어 교육 플랫 폼 서비스 애플리케이션, 프로그램, 앱 페이지, 웹 페이지 등을 전송하는 경우, 적어도 하나의 사용자 단말 , 적어도 하나의 헬퍼 단말 및 적어도 하나의 강사 단말은, 외국어 교육 플랫폼 서비스 애플리 케이션, 프로그램, 앱 페이지, 웹 페이지 등을 설치하거나 열 수 있다. 또한, 웹 브라우저에서 실행되는 스크 립트를 이용하여 서비스 프로그램이 적어도 하나의 사용자 단말, 적어도 하나의 헬퍼 단말 및 적어도 하나의 강사 단말에서 구동될 수도 있다. 여기서, 웹 브라우저는 웹(WWW: World Wide Web) 서비스를 이용 할 수 있게 하는 프로그램으로 HTML(Hyper Text Mark-up Language)로 서술된 하이퍼 텍스트를 받아서 보여주는 프로그램을 의미하며, 예를 들어 크롬(Chrome), 에지(Microsoft Edge), 사파리(Safari), 파이어폭스(FireFox), 웨일(Whale), UC 브라우저 등을 포함한다. 또한, 애플리케이션은 단말 상의 응용 프로그램(Application)을 의 미하며, 예를 들어, 모바일 단말(스마트폰)에서 실행되는 앱(App)을 포함한다. 도 2를 참조하면, 헬퍼모집부는, 헬퍼 단말로부터 모국어를 선택받고 호 연결이 가능한 날짜 및 시간 을 설정받아 헬퍼풀을 구축할 수 있다. 이때, 헬퍼란, 대본 데이터를 이용하여 사용자와 대화를 하는 원어민일수 있다. 여기서, 강사와 헬퍼와의 차이는 강사는 TESOL(Teaching English as a Second or Foreign Language) 등과 같이 사용자를 가르칠 수 있는 자격증을 보유했거나 본 발명의 일 실시예에 따른 플랫폼에서 요구하는 강 사자격을 획득한 자이고, 헬퍼는 원어민이라면 누구든 가능하다는 점이다. 헬퍼는 사용자 단말와 전화 또 는 화상으로 연결되면, 대본 데이터 내 대본에 맞게 헬퍼의 대본을 상황극에 맞게 읽거나 연기하는 역할이다. 이에 따라 모국어가 무엇인지 또 가능시간은 언제인지만 등록하면 누구나 헬퍼로 활동할 수 있고, 사용자 단말 의 사용자도 자신의 모국어에 대한 헬퍼로 등록하여 활동할 수 있다. 다만 본 발명의 설명의 편의를 위하 여 사용자 단말의 사용자는 외국어를 배우려는 학습자로, 헬퍼는 사용자가 배우려는 외국어의 원어민으로 역할을 고정하여 설명하기로 한다. 데이터베이스화부는, 적어도 하나의 레벨별 맞춤형 질문지 및 대본 데이터를 데이터베이스화할 수 있다. 이를 위하여 사용자 단말은 레벨 테스트를 진행할 수 있고, 맞춤형 교육을 받을 수 있도록 학습목적, 미션 주제, 헬퍼와 일별 또는 주별 통화횟수, 수업방식(실시간/비실시간), 전화/화상, 요일 및 시간, 원어민/비원어 민 강사 등을 선택할 수 있다. 또, 레벨별 맞춤형 질문지나 대본 데이터는, 예를 들어, 레스토랑에서 알러지가 있는 음식을 빼고 추천을 받아 야 하는 상황, 대중교통으로 목적지까지 찾아가야 하는데 갑자기 시위 및 집회가 발생해서 우회하는 교통편을 찾아야 하는 상황, 택시업계가 파업을 해서 공항에서 호텔까지 찾아가야 하는 상황 등 특정 상황을 설정하여 상 황극에 따른 대본 데이터를 구축할 수도 있고, 양자 간 대화, 예를 들어, 호텔-여행사, 본사-가맹점, 의사-환자, 교사-학부모, 교사-학생 등 양자 간 대화에 대한 대본 데이터를 구축할 수도 있다. 다만, 상황이나 관계는 나열된 것들로 한정되지 않고 열거되지 않은 이유로 배제되지 않는다. 전송부는, 사용자 단말의 레벨에 대응하는 맞춤형 질문지를 사용자 단말로 전송할 수 있다. 사 용자 단말은, 사용자의 레벨에 대응하는 맞춤형 질문지를 출력할 수 있다. 예를 들어, 질문지는 미션지일 수 있는데, 예를 들어, 이하 표 1과 같을 수 있다. 이 상황은 사용자가 여행사 직원인데 고객으로부터 요청을 받은 상황이다. 이제 사용자는 자신이 여행사 직원이므로 호텔에 전화를 해서 고객의 질문에 대한 응답을 받아 야 한다. 이렇게 사용자의 모국어, 예를 들어, 한국어로 질문지를 제시하면 사용자는 이 질문지에 대한 답을 헬퍼와의 대화에서 찾아내는 것이 미션이다. 이렇게 목표를 설정하는 경우 사용자는 답을 모르고 헬퍼에게만 대본 데이터(A-B 간 질의-응답이 담긴 대본 데이터)가 존재하므로 사용자는 답을 찾기 위해 목적의식을 가지고 준비하고 또 노력할 수 있다. 표 1 안녕하세요. 저 하와이 힐튼호텔에 11월 22일에서 25일까지 예약한 사람인데요. 몇 가지 요청사항이 있어서요. 제가 호텔에 22일 밤 11시 쯤 늦게 체크인할 예정인데 혹시 모르니 노쇼 처리 하지 말아달 라고 프론트에 좀 전달해주시겠어요? 그리고 두 번째 요청은 저희가 스탠다드룸 한 개를 예약했는데 성 인남자 3명이 쓰기에 괜찮나요? 안된다면 이 방에 엑스트라 베드를 추가할 수 있나요? 그렇다면 가격 은 얼마인가요? 연결부는, 사용자 단말에서 호 연결을 수행하는 경우 실시간으로 연결가능한 헬퍼 단말을 검색 한 후 연결을 수행할 수 있다. 사용자 단말은, 맞춤형 질문지에 대응하는 응답을 얻기 위해 호 연결을 수 행할 수 있다. 헬퍼 단말은, 호 연결이 가능한 날짜 및 시간을 설정하고, 사용자 단말의 호 연결 이 벤트에 연결될 수 있다. 이때 사용자에 따른 헬퍼가 미리 지정되어 있을 수도 있지만, 사용자가 원할 때마다 실시간으로 연결되어야 하므로 사용자가 호 발신을 할 때 브로드캐스팅 방식으로 그 시간 대가 가능시간대인 복 수의 헬퍼 단말로 호 연결 이벤트를 전달하고, 헬퍼 단말과 사용자 단말을 연결할 수 있다. 이 때, 헬퍼 단말과 사용자 단말을 연결하는 방법은, 예를 들어, 사용자 단말에서 호 연결 이벤트 를 전달한 후, 실시간으로 연결가능한 헬퍼 리스트가 추출되고 이 중에서 랜덤에서 선택하여 연결할 수 있다. 여기서, 헬퍼가 업무를 수행한 빈도를 기준으로 가장 적게 업무를 수행한 헬퍼가 상위로 리스트업되도록 함으로 써 각 헬퍼가 업무를 골고루 할당받을 수 있도록 배치를 할 수도 있다. 또는, 헬퍼의 평점이 높을수록 상위에 보여질 수 있도록 할 수도 있다. 또, 사용자에게 상위에 배치된 헬퍼를 우선적으로 연결하도록 할 수 있다. 이때, 연결이 되지 않는 경우에는 하위에 있는 헬퍼를 차선으로 연결하는 방식일 수 있다. 녹음부는, 헬퍼 단말로 대본 데이터를 전송하고 사용자 단말과 헬퍼 단말 간 음성발화를 녹음할 수 있다. 이 대본 데이터는 자동으로 팝업형태로 켜지도록 설정될 수 있다. 자동으로 출력되지 않는 경우 헬퍼 단말은 맞춤형 질문지에 기재된 일련번호(시리얼넘버)를 입력하여 수동으로 열 수도 잇다. 헬 퍼 단말은, 맞춤형 질문지를 포함하는 대본 데이터를 출력할 수 있다. 이는 강사 단말로 전송하기위해 녹음되는데 이는 사용자 단말에서 공유에 동의를 한 경우 사용자 보다 레벨이 낮은 다른 사용자가 조 회할 수 있도록 설정될 수 있다. 다른 사용자는 사용자의 대화를 듣고 자신보다 레벨이 높은 사람들이 어떠한 단어와 문법을 이용하여 문장을 구사하며 인토네이션과 발음은 어떠한지 등을 보고 배울 수 있는 기회를 얻을 수 있다. 여기서, 대본 데이터는 사용자의 질문지에 대응하는 응답지를 포함할 수 있다. 이때의 응답지는 사 용자가 업로드하는 응답지가 아님을 분명히 한다. 예를 들어 표 1의 질문에 대한 답을 모두 알고 있는 호텔직 원의 역할을 헬퍼가 수행하면 되는 것이다. 생성부는, 음성발화가 녹음된 음성발화 데이터로부터 음성발화를 텍스트로 변환하여 스크립트를 생성할 수 있다. 이때 한 명의 음성발화를 인식하는 것이 아니라 두 명의 음성발화를 인식해야 하기 때문에 음성인식에서 화자를 구분하는 기능이 반드시 들어가야 한다. 그래야 이 대화에 참여하지 않았던 강사도 어떠한 화자가 사용 자(학습자)인지를 파악할 수 있기 때문이다. 물론, 원어민이 아닌 사용자는 발음에 있어서 원어민과 확연하게 구분되겠지만 강사가 음성발화 데이터를 스트리밍하지 못하는 상황도 존재할 수 있으므로 스크립트를 생성할 때 화자를 구분하여 생성하도록 할 수 있다. 이를 위하여 화자를 구분하기 위하여 음성특징벡터인 MFCC(Mel- Frequency Cepstral Coefficient)를 추출하여 클러스터링을 통해 화자의 수를 측정하고, 은닉마르코프모델인 HMM(Hidden Markov Model) 알고리즘을 통해 학습하여 화자의 발화구간을 측정한다. 각 화자의 발화구간에 따라 ID를 부여하고, 해당 발화구간에 대한 음성을 인식하여 스크립트를 생성할 수 있다. 물론 상술한 방법 이외에 도 음성특징을 추출하기 위해 LPC(Linear Predicative Coding), LPCC(Linear Prediction Cepstral Coefficients), PLP(Perceptual Linear Prediction), PLPC(Perceptual Linear Prediction Coefficients), FFT(Fast Fourier Transform) 및 IDFT(Inverse Discrete Fourier Transform) 등을 이용할 수도 있다. 또 화자 구분을 위한 기계학습 알고리즘도, HMM 외에도 K-NN(K-Nearest Neighbors) 알고리즘, K-평균 클러스터링(Means Clustering) 등을 이용할 수도 있다. 이때, 음성발화 데이터에 따른 스크립트는 이하 표 2와 같이 생성될 수 있다. 표 2 A: Hi, I am calling from booking.com. Could you please check our booking ID? We have a few requests. B: Yes, may I have the booking number? A: Yes, the booking number is 123456. B: This reservation is confirmed for 3 adults in the standard room on 22nd through 25th November.land the guest's name is Minsoo Lee. A: Yes, it is correct. Our guest is checking in late at night around 11-ish on the 22nd, so please do not consider it as no-show. Could you leave a note of the check-in time for the front desk? B: Okay, I'll leave a note on our front desk so it won't be canceled, so don't worry. A: Thank you. And I am wondering if this standard room is big enough for 3 males. Or should the guest add an extra bed? If so, how much is the additional charge? B: This room has two single beds, so you need to add an extra bed and the price is 50 dollars per night. A: Thank you for your help. May I have your name? B: Sure, I am Rina from reservation department. A: Thank you for your help again. Bye. 이때, 볼드체로 표시된 문장이 헬퍼가 학습자인 사용자에게 답변해주어야 할 핵심문장이다. 여기서 헬퍼는 대 본 데이터의 대본을 그대로 읽기보다는 볼드체로 표시된 것을 중심으로 내용이 달라지지 않는 선에서 헬퍼 자신 의 어휘로 학습자와 대화할 것을 권장할 수 있다. 수신부는, 사용자 단말로부터 응답지를 수신할 수 있다. 사용자 단말은, 응답을 텍스트로 입력 한 응답지를 업로드한 후 첨삭지도를 받을 수 있다. 표 1 및 표 2의 상황, 즉 [여행사 직원-호텔 직원] 간 질 의 및 응답을 하면서 사용자는 통화 중간 간단하게 단어 위주로 헬퍼의 답변을 메모할 수 있다. 예를 들어 표 3과 같을 수 있다.표 3 late check-in ok should extra bed 50 USD/night Rina rsvn 그리고 나서 사용자가 이 상황극 내에서 여행사 직원이었으므로 고객에게 답변할 내용을 레터로 작성한다는 가 정하에 사용자 단말에서 응답지를 이하 표 4와 같이 작성하여 수신부로 전송할 수 있다. 사용자는 원어민이 아닌 이상, 또 업계에 있었던 사람이 아닌 이상, 이 응답지가 고객에게 답변할 문장으로 적절한지는 알 수 없다. 이에, 강사 단말로 전달되어 강사 단말에서 교정 또는 첨삭을 해주도록 할 수 있다. 표 4 We have talked with Rina from reservation department and she said that she will leave a note regarding the late check-in and won't take it as a no-show. The guest should add an extra bed and it is 50 USD/night. @1230pm 22JUL23 제공부는, 음성발화 데이터, 스크립트 및 응답지를 강사 단말로 제공할 수 있다. 강사 단말은, 사용자 단말과 헬퍼 단말의 호 연결로 녹음된 음성발화 데이터를 수신하여 출력하고, 음성발화 데이 터 내 음성발화를 텍스트로 변환한 스크립트를 출력하며, 사용자 단말에서 업로드한 응답지를 출력한 후 첨삭지도를 위한 첨삭 데이터를 업로드할 수 있다. 이때, 강사는 스크립트를 보면서 여행사 직원의 질문 및 대 응은 적절했는지, 음성발화 데이터를 스트리밍하면서 발음이나 인토네이션에 문제는 없었는지, 응답지는 고객에 게 전달될 응답으로 적절한지 등을 판단하게 된다. 첨삭부는, 강사 단말에서 첨삭 데이터를 업로드 한 경우 사용자 단말로 제공할 수 있다. 강사 단말은, 스크립트, 응답지 및 음성발화에 대한 첨삭 데이터를 생성한 후 사용자 단말로 전달한다. 또 제공부는 사용자 단말과 헬퍼 단말의 마 지막 통화 후 기 설정된 시간이 도과된 경우 새로운 헬퍼와의 통화를 유도하는 알람 또는 문자를 제공할 수 있 다. 여기서, 제공부는 사용자 단말로 음성발화 데이터 및 스크립트를 제공할 수 있다. 또, 제공부 는 사용자 단말에서 강사 단말과 수업한 후 녹음본인 음성발화 데이터 및 수업자료를 사용자 단말 로 제공할 수 있다. 또, 사용자가 헬퍼와의 통화를 한 경우 사용자만의 음성을 추출하고, 첨삭된 문장을 이어붙이기 하여 가공한 음성발화 데이터를 제공함으로써, 스스로 비교학습 할 수 있도록 한다. 이때 화자분리 는 상술한 바와 같으므로 중복된 내용은 생략하기로 한다. 예를 들어 사용자의 음성이 [Did you check my essay?]였고 첨삭된 문장은 [Have you had a chance to review my essay?]였다면 [사용자의 음성발화+AI 음성 발화]를 이어붙여 스스로 비교학습할 수 있도록 한다. AI강사부는, 사용자 단말에서 인공지능 첨삭을 선택한 경우, 사용자 단말의 응답지가 업로드된 후, 응답지 내 텍스트를 기 구축된 인공지능 알고리즘에서 분석하도록 하며, 기 구축된 인공지능 알고리즘에서 첨삭 데이터가 생성되는 경우 사용자 단말로 전송하도록 할 수 있다. 최근 다양한 영문 오탈자 검사기 뿐 만 아니라 영문 문법 교정기가 등장했는데, 오탈자 및 영문법 자동 교정은 작성된 영어 문장의 오류를 교정하는 작업으로 NLP의 다양한 분야 중 활발히 연구되고 있다. 자동 영문교정은 영어 원어민뿐만 아니라, 영어 학습자 들도 작문 능력 향상을 위해 보조 도구로 사용되는데, 이는 사용자가 입력한 문장을 구성하는 단어 또는 구를 기반으로 입력된 오류를 감지하고, 해당 오류를 교정하기 위한 교정 후보 단어 또는 구를 사용자에게 제안한다. 이러한 자동 영문교정은, 기계번역으로부터 파생되는데, 신경망 기반의 접근방식은 최근 문법오류교정 (Grammatical Error Correction, GEC)의 성능 향상을 주도했고, 전통적인 방법론보다 더 효과적임을 증명했다. 다만 노이즈에 민감하고 데이터가 희소하다는 문제점이 존재한다. 또, 자동 영문교정의 경우 문장의 전달력을 개선할 수는 없다. 문장 전달력 개선은 문법적 완성도뿐만 아니라 문장의 명확성과 자연스러움을 높인다는 점 에서 단순 문법 교정과 차이점이 존재하지만 자동 영문교정은, 이러한 기능을 제공하고 있지 않다. 각종 비즈 니스 영역에서는 정확한 사실을 고객에게 제공해야 하므로, 문법적 완성도가 높아야 하며 명확한 의미를 내포하 고 있는 문장을 작성하는 것이 요구된다. 이에 따라, 본 발명의 일 실시예는 오탈자를 인식하고 교정하는 것은 물론, 문장 전달력 개선을 통해 문장의 명 확성을 높일 수 있도록 각 비즈니스 분야의 용어사전과, 딥러닝 기법을 이용하는 양방향 순환신경망(Bidirectional Recurrent Neural Network, BRNN) 자동 사후교정(Automatic Post Editing, APE) 모델 기반의 자동 첨삭을 제공한다. 이 방법은 사용자가 입력한 응답지를 기반으로 오탈자 및 문장 전달력 개선을 위한 교 정 결과를 사용자에게 제공할 수 있다. 제공된 교정 결과는 입력된 문장의 문맥을 기반으로 최선의 문장 전달 력 개선 사항을 사용자에게 제공할 수 있다. 사용자는 입력 문장의 길이와 무관하게 문장 전달력이 향상된 출 력 문장을 얻을 수 있다. 교정 전문가로부터 수집된 실제 영문교정 데이터셋을 이용하여 모델의 성능을 확인할 수 있다. <문장 전달력 개선> 본 발명의 일 실시예에 따른 모델은 인코더와 디코더에 BRNN 기반의 APE 모델을 이용할 수 있다. BRNN APE 모 델은 가변 길이로 입력된 원문 X를 고정 길이 벡터로 표현하는 인코더와 고정된 길이의 벡터를 기반으로 가변 길이로 출력된 교정문 Y를 출력하는 디코더로 구성된다. 따라서, 입력된 원문 문장의 길이 M과 출력된 교정문 문장의 길이 N은 다를 수 있다. BRNN APE 모델은 입력 문장의 길이가 길면 성능이 저하되는 문제를 해결할 수 있고, 원문과 교정문의 쌍으로부터 문장 전달력 개선을 위한 문장 간의 차이를 학습할 수 있도록 설계될 수 있 다. 또한, 입력 문장의 길이와 출력 문장의 길이가 같아야 하는 한계도 개선할 수 있다. BRNN APE의 인코더는 순방향 RNN과 역방향 RNN 두 가지로 구성된다. 순방향 RNN은 입력된 원문 X의 구성 단어 (x1, x2,...,xm)의 정 보를 순차적으로 전달하면서 비활성화 함수를 사용하는 RNN의 Hidden State가 업데이트 된다. 이와 유사하게, 역방향 RNN 인코더는 입력된 순서의 역순으로 Hidden State를 업데이트한다. 즉, (xm, xm-1,...,x1) 순서로"}
{"patent_id": "10-2023-0105107", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "계산이 진행된다. 문장이 끝나는 xm까지 업데이트가 완료되면 Hidden State는 입력 문장 전체에 대한 요약정보 를 표현하는 컨텍스트 벡터 C를 계산한다. 디코더는 출력 문장 Y의 t 번째 구성 단어 yt를 생성하기 위해 학습된 또 다른 RNN 모델이며, t 번째 Hidden State ht와 컨텍스트 벡터 ct를 기반으로 계산된다. 디코더의 t번째 Hidden State ηt는 수학식 1 및 수학식 2 에 의해 계산되며, t번째 컨텍스트 벡터 ct는 수학식 3과 같이 계산된다. αti는 hi의 가중치로 수학식 4와 같 이 계산될 수 있다. 수학식 1"}
{"patent_id": "10-2023-0105107", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "수학식 2"}
{"patent_id": "10-2023-0105107", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "수학식 3"}
{"patent_id": "10-2023-0105107", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "수학식 4"}
{"patent_id": "10-2023-0105107", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "수학식 4에서 eti는 수학식 5와 같이 계산 가능한 스칼라값이며, 직전 단계의 Hidden State인 ηt-1과 인코더의 i 번째 Hidden State hi의 유사한 정도를 나타내는 값으로, Alignment 모델로 정의될 수 있다.수학식 5"}
{"patent_id": "10-2023-0105107", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "수학식 5는 계산된 유사도 점수 eti에 Softmax 함수를 적용하여 모든 유사도의 합이 1이 되도록 하는 식이다. 따라서 ηt-1와 hi의 유사도가 높으면 가중치 αti가 높게 나타난다. 수학식 3에서 t 번째 컨텍스트 벡터 ct는 계산된 점수와 인코더의 각 Hidden State의 가중합으로 계산된다. 따라서, 인코더에 모든 Hidden States에 대 해 가중합이 계산되므로 입력값의 길이가 길면 성능이 저하되는 문제를 해결할 수 있다. 또한, 컨텍스트 벡터 에 따라서 성능이 좌우되는 현상도 해결할 수 있다. 물론 상술한 AI교정 외에도 다양한 방법을 통하여 첨삭을 시도하고 지도할 수 있도록 설정할 수 있음은 자명하다 할 것이다. 실시간옵션부는, 사용자 단말에서 실시간 수업을 신청한 경우 헬퍼 단말과 호 종료 후 강사 단 말과 호 연결이 되도록 설정하고, 사용자 단말에서 수업시간을 설정한 경우, 수업시간에 강사 단말 과 호 연결이 되도록 설정할 수 있다. 이때 강사 단말이 사용자-헬퍼 간 대화를 할 때부터 함께 참 석을 할 수도 있고 이를 모니터링하고 있다가 바로 연결을 받을 수도 있다. 만약 사용자 단말에서 시간이 있을 때마다 하루에 몇 번씩 전화하고 한꺼번에 수업을 받는 방식을 선택했다면, 강사 단말에서 이를 모두 취합한 후 교정 및 수업을 한꺼번에 수행을 할 수도 있다. 다만 이는 어떻게 연결을 할 것인지에 대한 실시예 에 대응하므로 어느 하나에 한정되지 않고 또 나열된 것들로 한정되지도 않는다. 여기서, 실시간옵션부는 강사가 맞춤형 질문지에 대한 내용을 사용자에게 전달하고, 사용자는 헬퍼에게 전화를 걸어 답변을 얻고 강사는 통화를 보류(Hold)할 수 있으며 헬퍼와 통화가 종료되면 바로 강사에게 복귀하고, 강사와 음성발화 데이터를 실 시간으로 같이 듣고 첨삭을 받을 수 있다. 물론 상술한 실시간 또는 비실시간 옵션은 상술한 것들로 한정되는 것은 아니고 실시예에 따라 다양한 프로세스 및 방법이 적용될 수 있음은 자명하다 할 것이다. 업데이트부는, 관리자 단말로부터 상황별 질문지 및 대본 데이터와, 수준별 질문지 및 대본 데이터를 업로 드받아 지속적으로 업데이트할 수 있다. 다중모드부는, 사용자 단말에서 모국어를 설정하고, 사용자 단말의 모국어를 배우고자 하는 다 른 사용자 단말에 대한 헬퍼를 등록하고 활동한 경우, 사용자 단말에서 기 결제한 수강료로부터 건 당 캐시백을 지급받도록 할 수 있다. 예를 들어, 사용자가 한국어를 사용하는 원어민이고, 한국어 헬퍼로 등록 했다고 가정하자. 이때, 사용자가 배우고 싶은 언어는 영어여서 비용을 결제하고 사용하고 있는데 헬퍼로 활동 을 하는 경우 건 별로 기 설정된 수수료를 누적해주고 이에 대응하는 금액만큼 리워드로 적립하거나 캐시백을 받을 수 있도록 설정할 수 있다. 전화화상부는, 사용자 단말, 헬퍼 단말 및 강사 단말 간을 연결할 때 전화 또는 화상으로 연결할 수 있다. 전화를 선호하는 사람은 전화옵션을 선택할 수 있도록 하고 화상통화를 선호하는 사람은 화상 옵션을 선택할 수 있다. 이때 전화 또는 화상 모두 VoIP(Voice over Internet Protocol)와 같은 패킷 기반 통 신 시스템을 이용하고 있는데, 사용자의 컴퓨팅 자원 및 네트워킹 자원이 충분하다고 할지라도 상대방, 즉 헬퍼 의 컴퓨팅 자원 및 네트워킹 자원이 떨어지는 경우 끊기거나 화상의 경우 랙이 걸린 것과 같은 멈춤현상이 발생 할 수 있다. VoIP를 이용한음성 통화가 빠르게 활성화되지 않은 이유는 기존 공중 회선 교환망(PSTN)과 동일한 수준의 서비스 품질을 제공받지 못했기 때문이다. 실시간 오디오 서비스의 핵심은 대용량의 오디오 데이터의 전송 시간을 최소화하는 게 목적이고, 이때 시간 제약성에 맞추어 전달하는 과정에서 오디오 품질에 대한 이슈 가 발생할 수 있고, 이러한 이슈는 코덱지연(Codec Delay) 및 에코(Echo) 발생, 패킷 손실(Packet Loss), 패킷 지연(Packet Delay), 지터(Jitter) 및 도착순서 변경 등에 의해 발생한다. 이러한 현상의 정도가 최종 사용자 단(End)에서의 오디오 서비스 품질(Quality ofService, QoS)에 대한 결정요소라 할 수 있다. 이에 따라, VoIP 에서 다자간 오디오 신호처리를 위한 디지털 오디오 합성기를 FPGA 하드웨어로 제공하고, 오디오 신호 합성 및 패킷 구성을 고속 병렬 처리 방식으로 코딩하여 처리시간 최소화를 통한 오디오 서비스 품질을 높이는 방법을 이용할 수 있다. 시간제한부는, 사용자 단말에서 헬퍼 단말과 연결되는 시간은 기 설정된 시간으로 제한되고, 사 용자 단말에 제한시간을 카운트다운하여 표시할 수 있다. 사용자 단말의 화면 상에 남은 시간을 카 운트하여 오버레이해줄 수 있다. 순위배정부는, 사용자 단말에서 헬퍼 단말과 호 연결이 종료된 후, 사용자 단말로부터 헬 퍼 단말의 헬퍼에 대한 평가점수를 제공받고, 평가점수에 따라 호 연결의 횟수 및 빈도를 증감시킬 수 있 다. 다만 성실하지 않았다와 같은 형용사의 기준은 각 사람마다 다를 수 있으므로 각 별점의 개수에 따른 기준 을 설정하고 이 기준을 만족하는 경우 별점을 매길 수 있도록 설정할 수 있다. 또, 헬퍼 단말은 기 설정 된 기간 동안 기 설정된 횟수 이상 업무를 수행해야 하는 기준이 존재할 수 있다. 예를 들어 하한선이 설정될 수 있는데 주당 최소 5회 등과 같이 설정될 수 있다. 급여의 경우 계좌이체 또는 수강권 등 다양한 옵션으로 선택할 수 있다. 배치부는, 헬퍼 단말로 호 연결이 시도되었음에도 기 설정된 횟수 이상 전화를 수신하지 않는 경우 통화연결순위를 후순위로 배치할 수 있다. 다만 헬퍼 단말에서 가능시간이라고 기재를 했다고 해서 항상 전화를 기다릴 수만은 없고 헬퍼도 하는 일이 존재할 수 있으므로, 헬퍼가 가능시간이라고 기재한 시간 중에 실 제 헬퍼가 통화가능 버튼을 눌러야 연결되도록 설정할 수도 있다. 이에 따라 가능시간이라고 기재를 했더라도 헬퍼가 실제로 가능한 시간일 때에만 버튼 조작으로 연결되도록 설정할 수도 있다. 공유부는, 사용자 단말에서 헬퍼 단말과 통화한 내역이 녹음된 음성발화 데이터를 공유하는 경 우 리워드를 지급하고, 사용자 단말의 레벨보다 더 높은 레벨의 음성발화 데이터에 엑세스가 가능하도록 설정할 수 있다. 이 외에도 관리자 단말(미도시)은, 강사나 헬퍼를 채용하고, 회원인 사용자를 관리하며, 시스템을 관리할 수 있 다. 또, 맞춤형 질문지 및 대본 데이터는 생성형 AI를 기반으로 주제별로 생성하여 시스템에 등록할 수 있고, 맞춤형 질문지 및 대본 데이터는 강사 및 헬퍼도 생성형 AI를 이용하여 생성 및 등록할 수 있다. 여기서, 헬퍼 도 강사와 같이 맞춤형 질문지와 대본 데이터를 등록할 수 있다. 물론 이는 실시예에 따라 변경될 수 있으므로 어느 하나에 한정되는 것은 아니다. 그리고, 강사가 등록한 맞춤형 질문지 및 대본 데이터는 관리자가 검토 후 승인된 건에 한하여 사용자의 학습자료로 활용될 수 있고, 승인된 건 별로 추가수당이 지급될 수도 있다. 또한, 헬퍼가 등록한 맞춤형 질문지는 관리자 검토 후 승인된 건에 한하여 사용자의 학습자료로 활용될 수 있고, 승인된 건 별로 수당 지급 또는 수강료 캐시백 등의 혜택이 지급될 수도 있다. 이하, 상술한 도 2의 플랫폼 서비스 제공 서버의 구성에 따른 동작 과정을 도 3 및 도 4를 예로 들어 상세히 설 명하기로 한다. 다만, 실시예는 본 발명의 다양한 실시예 중 어느 하나일 뿐, 이에 한정되지 않음은 자명하다 할 것이다. 도 3을 참조하면, (a) 플랫폼 서비스 제공 서버는 헬퍼 단말 및 강사 단말로부터 가능시간대, 모국어, 경력, 학력, 자격증 등을 수집하여 저장함으로써 인력풀을 구축하고, (b)와 같이 질문지 및 대본 데이 터를 매핑할 때 상황별 및 레벨별로 매핑하여 저장함으로써 사용자의 레벨에 맞는 맞춤형 질문지를 제공할 수 있도록 설정해둔다. 또 (c)와 같이 플랫폼 서비스 제공 서버는 사용자 맞춤형 질문지를 사용자 단말(10 0)로 제공하고, (d)와 같이 사용자 단말에서 전화를 걸면 가능시간대에 있는 헬퍼 단말로 호 발신 이 벤트를 브로드캐스팅한 후 가장 먼저 받는 헬퍼 단말과 연결이 되도록 할 수 있다. 또 도 4의 (a)와 같이 플랫폼 서비스 제공 서버는 사용자 단말 및 헬퍼 단말에서 질의응답을 하 는 경우 이를 녹음하여 음성발화 데이터로 저장하고, 이를 STT(Speech to Text)를 이용하여 스크립트를 생성하 고, (b)와 같이 사용자 단말에서 질문지에 응답할 답변을 작성하여 응답지를 업로드하는 경우 강사 단말 로 전달하며, 강사 단말의 첨삭 데이터를 사용자 단말로 제공할 수 있다. 물론 AI튜터의 교정 결과를 제공할 수도 있다. 플랫폼 서비스 제공 서버는 (c)와 같이 플랫폼 서비스 제공 서버는 사용 자-헬퍼-강사가 실시간으로 연결되도록 하여 수업을 진행할 수도 있고, (d)와 같이 사용자가 음성발화 데이터를 공유를 하는 경우 타 사용자가 공유받을 수도 있도록 한다. 이와 같은 도 2 내지 도 4의 외국어 교육 플랫폼 서비스 제공 방법에 대해서 설명되지 아니한 사항은 앞서 도 1 을 통해 외국어 교육 플랫폼 서비스 제공 방법에 대하여 설명된 내용과 동일하거나 설명된 내용으로부터 용이하 게 유추 가능하므로 이하 설명을 생략하도록 한다. 도 5는 본 발명의 일 실시예에 따른 도 1의 외국어 교육 플랫폼 서비스 제공 시스템에 포함된 각 구성들 상호 간에 데이터가 송수신되는 과정을 나타낸 도면이다. 이하, 도 5를 통해 각 구성들 상호간에 데이터가 송수신되 는 과정의 일 예를 설명할 것이나, 이와 같은 실시예로 본원이 한정 해석되는 것은 아니며, 앞서 설명한 다양한"}
{"patent_id": "10-2023-0105107", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "실시예들에 따라 도 5에 도시된 데이터가 송수신되는 과정이 변경될 수 있음은 기술분야에 속하는 당업자에게 자명하다. 도 5를 참조하면, 플랫폼 서비스 제공 서버는, 헬퍼 단말로부터 모국어를 선택받고 호 연결이 가능한 날짜 및 시간을 설정받아 헬퍼풀을 구축한다(S5100). 그리고, 플랫폼 서비스 제공 서버는, 적어도 하나의 레벨별 맞춤형 질문지 및 대본 데이터를 데이터베이스화하 고(S5200), 사용자 단말의 레벨에 대응하는 맞춤형 질문지를 사용자 단말로 전송한다(S5300). 또, 플랫폼 서비스 제공 서버는, 사용자 단말에서 호 연결을 수행하는 경우 실시간으로 연결가능한 헬퍼 단말을 검색한 후 연결을 수행하고(S5400), 헬퍼 단말로 대본 데이터를 전송하고 사용자 단말과 헬퍼 단말 간 음성발화 를 녹음한다(S5500). 그리고, 플랫폼 서비스 제공 서버는, 음성발화가 녹음된 음성발화 데이터로부터 음성발화를 텍스트로 변환하여 스크립트를 생성하고(S5600), 사용자 단말로부터 응답지를 수신한다(S5700). 이때, 플랫폼 서비스 제공 서버는, 음성발화 데이터, 스크립트 및 응답지를 강사 단말로 제공하고(S5800), 강사 단말에서 첨삭 데이터를 업로드한 경우 사용자 단말로 제공한다(S5900). 상술한 단계들(S5100~S5900)간의 순서는 예시일 뿐, 이에 한정되지 않는다. 즉, 상술한 단계들(S5100~S5900)간 의 순서는 상호 변동될 수 있으며, 이중 일부 단계들은 동시에 실행되거나 삭제될 수도 있다. 이와 같은 도 5의 외국어 교육 플랫폼 서비스 제공 방법에 대해서 설명되지 아니한 사항은 앞서 도 1 내지 도 4 를 통해 외국어 교육 플랫폼 서비스 제공 방법에 대하여 설명된 내용과 동일하거나 설명된 내용으로부터 용이하 게 유추 가능하므로 이하 설명을 생략하도록 한다. 도 5를 통해 설명된 일 실시예에 따른 외국어 교육 플랫폼 서비스 제공 방법은, 컴퓨터에 의해 실행되는 애플리 케이션이나 프로그램 모듈과 같은 컴퓨터에 의해 실행가능한 명령어를 포함하는 기록 매체의 형태로도 구현될 수 있다. 컴퓨터 판독 가능 매체는 컴퓨터에 의해 액세스될 수 있는 임의의 가용 매체일 수 있고, 휘발성 및 비휘발성 매체, 분리형 및 비분리형 매체를 모두 포함한다. 또한, 컴퓨터 판독가능 매체는 컴퓨터 저장 매체를 모두 포함할 수 있다. 컴퓨터 저장 매체는 컴퓨터 판독가능 명령어, 데이터 구조, 프로그램 모듈 또는 기타 데 이터와 같은 정보의 저장을 위한 임의의 방법 또는 기술로 구현된 휘발성 및 비휘발성, 분리형 및 비분리형 매 체를 모두 포함한다. 전술한 본 발명의 일 실시예에 따른 외국어 교육 플랫폼 서비스 제공 방법은, 단말기에 기본적으로 설치된 애플 리케이션(이는 단말기에 기본적으로 탑재된 플랫폼이나 운영체제 등에 포함된 프로그램을 포함할 수 있음)에 의 해 실행될 수 있고, 사용자가 애플리케이션 스토어 서버, 애플리케이션 또는 해당 서비스와 관련된 웹 서버 등 의 애플리케이션 제공 서버를 통해 마스터 단말기에 직접 설치한 애플리케이션(즉, 프로그램)에 의해 실행될 수 도 있다. 이러한 의미에서, 전술한 본 발명의 일 실시예에 따른 외국어 교육 플랫폼 서비스 제공 방법은 단말 기에 기본적으로 설치되거나 사용자에 의해 직접 설치된 애플리케이션(즉, 프로그램)으로 구현되고 단말기에 등 의 컴퓨터로 읽을 수 있는 기록매체에 기록될 수 있다."}
{"patent_id": "10-2023-0105107", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "전술한 본 발명의 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가 지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본 발명의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으 로 해석되어야 한다.도면 도면1 도면2 도면3 도면4 도면5"}
{"patent_id": "10-2023-0105107", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 외국어 교육 플랫폼 서비스 제공 시스템을 설명하기 위한 도면이다. 도 2는 도 1의 시스템에 포함된 플랫폼 서비스 제공 서버를 설명하기 위한 블록 구성도이다. 도 3 및 도 4는 본 발명의 일 실시예에 따른 외국어 교육 플랫폼 서비스가 구현된 일 실시예를 설명하기 위한 도면이다. 도 5는 본 발명의 일 실시예에 따른 외국어 교육 플랫폼 서비스 제공 방법을 설명하기 위한 동작 흐름도이다."}
