{"patent_id": "10-2014-0114567", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2016-0019833", "출원번호": "10-2014-0114567", "발명의 명칭": "하우징, 하우징 제조 방법 및 그것을 포함하는 전자 장치", "출원인": "삼성전자주식회사", "발명자": "이용석"}}
{"patent_id": "10-2014-0114567", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "휴대폰에 있어서,본체 외부의 둘레를 적어도 일부 둘러싸는 금속 베젤이 좌측 베젤부와 우측 베젤부를 포함하고,상기 좌, 우측 베젤부의 상, 하측 코너 베젤부가 중간 부분보다 외부로 더 두껍게 형성되는 것을 특징으로 하는휴대폰."}
{"patent_id": "10-2014-0114567", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 금속 베젤은 상측 베젤부 및 하측 베젤부를 포함하는 것을 특징으로 하는 휴대폰."}
{"patent_id": "10-2014-0114567", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 금속 배젤은 비금속 분절부를 적어도 하나 이상 포함하는 것을 특징으로 하는 휴대폰."}
{"patent_id": "10-2014-0114567", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 비금속 분절부는 일정 간격으로 이격된 적어도 두 개로 형성되며, 상기 비금속 분절부에 의해 이격된 적어도 하나의 단위 금속 베젤은 상기 전자 장치의 안테나 방사체로 사용되는 것을 특징으로 하는 휴대폰."}
{"patent_id": "10-2014-0114567", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 단위 금속 베젤은 내측으로 길이 방향으로 형성된 슬릿을 포함하는 것을 특징으로 하는 휴대폰."}
{"patent_id": "10-2014-0114567", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 금속 베젤은 비금속 부재와 인서트 사출에 의해 상기 전자 장치의 하우징(housing)으로 기여되는 것을 특징으로 하는 휴대폰."}
{"patent_id": "10-2014-0114567", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 금속 베젤에 비금속 부재가 인서트 사출된 후, 하우징 전체에 대하여 도장 처리를 수행하는 것을 특징으로하는 휴대폰.공개특허 10-2016-0019833-3-청구항 8 제7항에 있어서,상기 금속 베젤은 본체 전면 또는 후면과 측벽 사이에 길이 방향으로 적어도 하나의 챔퍼(chamfer)를 형성하는것을 특징으로 하는 휴대폰."}
{"patent_id": "10-2014-0114567", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 금속 베젤과 비금속 부재의 경계 부분은 상기 챔퍼 영역에만 노출되는 것을 특징으로 하는 휴대폰."}
{"patent_id": "10-2014-0114567", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에 있어서,상기 챔퍼는 평면 또는 곡면으로 형성되는 것을 특징으로 하는 휴대폰."}
{"patent_id": "10-2014-0114567", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제8항에 있어서,상기 챔퍼를 포함하는 도장 처리면의 상부에는 상기 챔퍼를 통해 노출된 금속 부분의 부식을 방지하기 위한 표면 처리층이 더 형성되는 것을 특징으로 하는 휴대폰."}
{"patent_id": "10-2014-0114567", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 표면 처리층은 프라이머 층 및 상기 프라이머 층의 상부에 적층되는 AF 층을 포함하는 휴대폰."}
{"patent_id": "10-2014-0114567", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 프라이머 층은 SiO2 계열 혹은 Al2O3 계열의 소재를 진공 증착 혹은 스퍼터링 공정을 통해서 형성하거나,SiO2 계열의 소재와 Al2O3 계열의 소재를 일정 비율로 혼합한 소재를 진공 증착 혹은 스퍼터링 공정을 통해서 형성하거나 Al2O3 계열의 소재를 일정 두께로 증착한 후, 그 상부에 SiO2 계열의 소재를 일정 두께로 증착하여 형성하는 것을 특징으로 하는 휴대폰."}
{"patent_id": "10-2014-0114567", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12항에 있어서,상기 프라이머 층은 20 ~ 2000 나노미터 범위의 두께로 형성되는 것을 특징으로 하는 휴대폰."}
{"patent_id": "10-2014-0114567", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "공개특허 10-2016-0019833-4-제6항에 있어서,상기 금속 베젤은 그 둘레 중 적어도 일부 영역에서 내측 방향으로 돌출 형성된 보강 돌기를 포함하고, 상기 비금속 부재는 상기 보강 돌기의 상부 및 하부를 감싸는 방식으로 인서트 사출되는 것을 특징으로 하는 휴대폰."}
{"patent_id": "10-2014-0114567", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "휴대폰에 있어서,본체 후면 및 본체 측면을 적어도 일부 둘러싸는 금속 베젤을 포함하고, 금속 베젤은 본체 전면 또는 후면과 측벽 사이에 형성된 챔퍼(chamfer)부;상기 금속 베젤의 일부에 형성된 하나 이상의 비금속 분절부를 포함하고,상기 금속 베젤의 측벽상에 도료가 도포되어 상기 측벽상의 비금속 분절 부분을 덮으나 상기 챔퍼부상의 비금속분절 부분은 노출시키는 하우징."}
{"patent_id": "10-2014-0114567", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서,상기 도장이 본체 후면 커버의 적어도 일부분에 도포되는 것을 특징으로 하는 하우징."}
{"patent_id": "10-2014-0114567", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제16항에 있어서,상기 금속 베젤은 비금속 부재를 인서트 사출하여 상기 휴대폰의 하우징으로 형성하는 것을 특징으로 하는 하우징."}
{"patent_id": "10-2014-0114567", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에 있어서,상기 금속 베젤과 비금속 부재의 인서트 사출에 의해 발생되는 경계 부분의 단차부 및 갭을 버핑 가공(buffing)에 의해 1차 평탄화시키는 공정;상기 평탄화된 경계 부분을 포함하여 일정 두께의 프라이머를 도포하여 프라이머층을 형성하는 공정; 상기 프라이머층을 버핑 가공하여 2차 평탄화시키는 공정; 및2차 평탄화된 프라이머층에 상기 도료를 도포하는 공정을 포함하는 것을 특징으로 하는 하우징."}
{"patent_id": "10-2014-0114567", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서,상기 도료를 도포 후에 챔퍼 가공을 수행하는 것을 특징으로 하는 하우징."}
{"patent_id": "10-2014-0114567", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "적어도 일부 영역에 기여하는 금속 베젤; 및 상기 금속 베젤과 인서트 사출되어 나머지 영역이 형성되는 비금속 부재를 포함하되,공개특허 10-2016-0019833-5-상기 금속 베젤은,좌, 우, 상, 하측 베젤부; 및 상기 좌, 우, 상, 하측 베젤부의 적어도 일부에서 후면의 일부까지 연장 형성되는 후면 베젤부를 포함하되,상기 상측 베젤부에서 상기 좌, 우측 베젤부와 만나는 상부 좌, 우측 코너 베젤부 및 상기 하측 베젤부에서 상기 좌, 우측 베젤부와 만나는 하부 좌, 우측 코너 베젤부까지의 두께가 상기 좌, 우측 베젤부의 두께보다 더 두껍게 형성되는 것을 특징으로 하는 하우징."}
{"patent_id": "10-2014-0114567", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제21항에 있어서,상기 더 두껍게 형성된 베젤부에 상기 비금속 부재에 의한 적어도 하나의 분절부가 형성되는 것을 특징으로 하는 하우징."}
{"patent_id": "10-2014-0114567", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제22항에 있어서,상기 하우징은 전자 장치의 외관으로 형성되며, 상기 분절부에 의해 형성되는 단위 베젤부는 상기 전자 장치의안테나 방사체로 사용되는 것을 특징으로 하는 하우징."}
{"patent_id": "10-2014-0114567", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제23항에 있어서,상기 각 측면 베젤부의 상, 하 단부에는 길이 방향으로 적어도 챔퍼(chamfer)가 형성되며, 상기 분절부는 챔퍼에서만 노출되는 것을 특징으로 하는 하우징."}
{"patent_id": "10-2014-0114567", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 다양한 실시예들은 본체 외부의 둘레를 적어도 일부 둘러싸는 금속 베젤이 좌측 베젤부와 우측 베젤부 를 포함하고, 상기 좌, 우측 베젤부의 상, 하측 코너 베젤부가 중간 부분보다 외부로 더 두껍게 형성되는 것을 특징으로 하는 하우징 및 그것을 포함하는 휴대폰을 제공하여, 하우징의 자체 구조만으로도 강성이 보강됨과 동 시에 전자 장치의 기능을 원활히 수행할 수 있고, 외관이 미려하게 구성될 수 있다."}
{"patent_id": "10-2014-0114567", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시예들은 전자 장치에 관한 것이고, 예를 들어, 하우징, 하우징 제조 방법 및 그것을 포함 하는 전자 장치에 관한 것이다."}
{"patent_id": "10-2014-0114567", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전자 통신 기술이 발전하면서 다양한 기능을 갖는 전자 장치들이 등장하고 있다. 이러한 전자 장치들은 하나 또 는 그 이상의 기능을 복합적으로 수행하는 컨버젼스 기능을 갖는 것이 일반적이다. 이러한 전자 장치들로는 소위 '스마트 폰'이라 대별되는 이동 단말기(mobile terminal)가 주류를 이루고 있으며, 점차 경박 단소화됨과 동시에 다양한 기능을 구비하여 소비자의 구매 욕구를 충족시키기 위하여 경주하 고 있는 실정이다. 특히, 최근에는 각 제조사마다 기능적 격차가 현저히 줄어듬에 따라 소비자의 구매 욕구를 충족시키기 위하여 점차 슬림화되어가고 있는 전자 장치의 강성을 증가시키고, 디자인적 측면을 강화시키기 위하여 노력하고 있는 추세이다. 이러한 추세의 일환으로 전자 장치의 다양한 구조물(예: 외관)을 금속(metal) 소재로 구현하여 전자 장치의 고급화 및 외관의 미려함에 호소하고 있다. 더욱이, 메탈 소재를 사용함으로써 발생되는 강성에 취약해"}
{"patent_id": "10-2014-0114567", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "지는 문제, 접지 문제(예: 감전 등), 안테나 방사 성능 감소 등을 해결하기 위하여 노력하고 있다.발명의 내용"}
{"patent_id": "10-2014-0114567", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "다양한 실시예에 따르면, 전자 장치는 하우징의 적어도 일부를 금속 재질로 형성시킬 수 있다. 특히, 전자 장치 의 테두리 부분을 금속 재질로 적용할 때, 일부를 분절하여 비금속 부재를 충진시킨 분절부를 포함할 수 있으며, 의해 금속 재질의 하우징은 강성에 취약해질 수 밖에 없다. 특히, 휴대용 전자 장치의 경우, 낙하에 의 한 금속 베젤의 파손이나 변형이 빈번한 것이 현실이다. 이러한 문제점을 해결하기 위하여 본 발명의 다양한 실시예들은 금속 베젤의 자체 구조만으로 강성이 보강될 수 있는 하우징, 하우징 제조 방법 및 그것을 포함하는 전자 장치를 제공할 수 있다. 다양한 실시예에 따르면, 금속 재질의 하우징을 적용하더라도, 외관이 미려하여 소비자의 구매 욕구를 충족시킬 수 있도록 구현되는 하우징, 하우징 제조 방법 및 그것을 포함하는 전자 장치를 제공할 수 있다. 다양한 실시예에 따르면, 강성을 보강하면서도 전자 장치의 기능을 원활히 수행할 수 있도록 하여, 전자 장치의 신뢰성 확보에 이바지할 수 있는 하우징, 하우징 제조 방법 및 그것을 포함하는 전자 장치를 제공할 수 있다."}
{"patent_id": "10-2014-0114567", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "다양한 실시예에 따르면, 본체 외부의 둘레를 적어도 일부 둘러싸는 금속 베젤이 좌측 베젤부와 우측 베젤부를 포함하고, 상기 좌, 우측 베젤부의 상, 하측 코너 베젤부가 중간 부분보다 외부로 더 두껍게 형성되는 것을 특 징으로 하는 휴대폰을 제공할 수 있다. 다양한 실시예에 따르면, 본체 후면 및 본체 측면을 적어도 일부 둘러싸는 금속 베젤을 포함하고, 금속 베젤은 본체 전면 또는 후면과 측벽 사이에 형성된 챔퍼(chamfer)부와, 상기 금속 베젤의 일부에 형성된 하나 이상의 비금속 분절부를 포함하고, 상기 금속 베젤의 측벽상에 도료가 도포되어 상기 측벽상의 비금속 분절 부분을 덮 으나 상기 챔퍼부상의 비금속 분절 부분은 노출시키는 하우징 도장 방법을 제공할 수 있다. 다양한 실시예에 따르면, 적어도 일부 영역에 기여하는 금속 베젤 및 상기 금속 베젤과 인서트 사출되어 나머지 영역이 형성되는 비금속 부재를 포함하되, 상기 금속 베젤은 좌, 우, 상, 하측 베젤부 및 상기 좌, 우, 상, 하 측 베젤부의 적어도 일부에서 후면의 일부까지 연장 형성되는 후면 베젤부를 포함하되, 상기 상측 베젤부에서 상기 좌, 우측 베젤부와 만나는 상부 좌, 우측 코너 베젤부 및 상기 하측 베젤부에서 상기 좌, 우측 베젤부와 만나는 하부 좌, 우측 코너 베젤부까지의 두께가 상기 좌, 우측 베젤부의 두께보다 더 두껍게 형성되는 것을 특 징으로 하는 하우징을 제공할 수 있다."}
{"patent_id": "10-2014-0114567", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 다양한 실시예에 따르면, 자체 구조만으로도 강성이 보강됨과 동시에 전자 장치의 기능을 원활히 수 행할 수 있고, 외관이 미려하게 구성될 수 있는 하우징 및 그것을 포함하는 전자 장치를 제공할 수 있다."}
{"patent_id": "10-2014-0114567", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 다양한 실시예가 첨부된 도면과 연관되어 기재된다. 본 발명의 다양한 실시예는 다양한 변경 을 가할 수 있고 여러 가지 실시예를 가질 수 있는 바, 특정 실시예들이 도면에 예시되고 관련된 상세한 설명이 기재되어 있다. 그러나, 이는 본 발명의 다양한 실시예를 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 다양한 실시예의 사상 및 기술 범위에 포함되는 모든 변경 및/또는 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성 요소에 대해서는 유사한 참조 부호가 사용되었 다. 본 발명의 다양한 실시예에서 사용될 수 있는 \"포함한다\" 또는 \"포함할 수 있다\"등의 표현은 개시(disclosure) 된 해당 기능, 동작 또는 구성 요소 등의 존재를 가리키며, 추가적인 하나 이상의 기능, 동작 또는 구성 요소 등을 제한하지 않는다. 또한, 본 발명의 다양한 실시예에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 명세서상 에 기재된 특징, 숫자, 단계, 동작, 구성 요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하 나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성 요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 발명의 다양한 실시예에서 \"또는\" 등의 표현은 함께 나열된 단어들의 어떠한, 그리고 모든 조합을 포함한다. 예를 들어, \"A 또는 B\"는, A를 포함할 수도, B를 포함할 수도, 또는 A 와 B 모두를 포함할 수도 있다. 본 발명의 다양한 실시예에서 사용된 \"제1,\" \"제2\", \"첫 째\", \"둘 째\" 등의 표현들은 다양한 실시예들의 다양한 구성 요소들을 수식할 수 있지만, 해당 구성 요소들을 한정하지 않는다. 예를 들어, 상기 표현들은 해당 구성 요소들의 순서 및/또는 중요도 등을 한정하지 않는다. 상기 표현들은 한 구성 요소를 다른 구성 요소와 구분하 기 위해 사용될 수 있다. 예를 들어, 제1사용자 기기와 제2 사용자 기기는 모두 사용자 기기이며, 서로 다른 사용자 기기를 나타낸다. 예를 들어, 본 발명의 다양한 실시예의 권리 범위를 벗어나지 않으면서 제1구성 요소 는 제2구성 요소로 명명될 수 있고, 유사하게 제2구성 요소도 제1구성 요소로 명명될 수 있다. 어떤 구성 요소가 다른 구성 요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 상기 어떤 구성 요 소가 상기 다른 구성 요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 상기 어떤 구성 요 소와 상기 다른 구성 요소 사이에 새로운 다른 구성 요소가 존재할 수도 있다고 이해되어야 할 것이다. 반면에, 어떤 구성 요소가 다른 구성 요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 상기 어떤 구성 요소와 상기 다른 구성 요소 사이에 새로운 다른 구성 요소가 존재하지 않는 것으로 이해될 수 있어야 할 것이다. 본 발명의 다양한 실시예에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명의 다 양한 실시예를 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표 현을 포함할 수 있다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명의 다양한 실시예가 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥 상 가지는 의 미와 일치하는 의미를 가지는 것으로 해석되어야 하며, 본 발명의 다양한 실시예에서 명백하게 정의되지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 본 발명의 다양한 실시예에 따른 전자 장치는, 통신 기능이 포함된 장치일 수 있다. 예를 들면, 전자 장치는 스마트 폰(smartphone), 태블릿 PC(tablet personal computer), 이동전화기(mobile phone), 화상전화기, 전자 북리더기(e-book reader), 데스크탑 PC(desktop personal computer), 랩탑 PC(laptop personal computer), 넷 북컴퓨터(netbook computer), PDA(personal digital assistant), PMP(portable multimedia player), MP3 플레 이어, 모바일의료기기, 카메라(camera), 또는 웨어러블장치(wearable device)(예: 전자 안경과 같은 head- mounted-device(HMD), 전자의복, 전자팔찌, 전자목걸이, 전자앱세서리(appcessory), 전자문신, 또는 스마트 와 치(smart watch))중 적어도 하나를 포함할 수 있다. 어떤 실시예들에 따르면, 전자 장치는 통신 기능을 갖춘 스마트 가전 제품(smart home appliance)일 수 있다. 스마트 가전 제품은, 예를 들자면, 전자 장치는 텔레비전, DVD(digital video disk) 플레이어, 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스(set-top box), TV 박스(예를 들면, 삼성 HomeSyncTM, 애플TVTM, 또는 구글 TVTM), 게임 콘솔(game consoles), 전자 사전, 전자 키, 캠코더(camcorder), 또는 전자 액자 중 적어도 하나를 포함할 수 있다. 어떤 실시예들에 따르면, 전자장치는 각종 의료기기(예: MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 초음파기 등), 네비게이션(navigation) 장치, GPS 수 신기(global positioning system receiver), EDR(event data recorder), FDR(flight data recorder), 자동차 인포테인먼트(infotainment) 장치, 선박용전자장비(예: 선박용항법장치 및 자이로콤파스 등), 항공전자기기 (avionics), 보안기기, 차량용헤드유닛, 산업용 또는 가정용 로봇, 금융기관의 ATM(automatic teller's machine) 또는 상점의 POS(point of sales) 중 적어도 하나를 포함할 수 있다. 어떤 실시예들에 따르면, 전자 장치는 통신 기능을 포함한 가구(furniture) 또는 건물/구조물의 일부, 전자 보 드(electronic board), 전자 싸인 입력장치(electronic signature receiving device), 프로젝터(projector), 또는 각종 계측기기(예: 수도, 전기, 가스, 또는 전파 계측 기기 등) 중 적어도 하나를 포함할 수 있다. 본 발 명의 다양한 실시예에 따른 전자 장치는 전술한 다양한 장치들 중 하나 또는 그 이상의 조합일 수 있다. 또한, 본 발명의 다양한 실시예에 따른 전자 장치는 플렉서블(flexible) 장치일 수 있다. 또한, 본 발명의 다양한 실 시예에 따른 전자 장치는 전술한 기기들에 한정되지 않음은 당업자에게 자명하다. 이하, 첨부된 도면을 참조하여 다양한 실시예에 따른 전자 장치에 대해서 살펴본다. 다양한 실시예에서 이용되 는 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공지능 전자 장치)를 지칭할 수 있다. 도 1은 본 발명의 다양한 실시예에 따른 전자 장치 101을 포함하는 네트워크환경 100를 도시한 도면이다. 도 1을 참조하면, 상기 전자 장치 101은 버스 110, 프로세서 120, 메모리 130, 입출력 인터페이스 140, 디스플 레이 150, 통신인터페이스 160을 포함할 수 있다. 상기 버스 110은 전술한 구성 요소들을 서로 연결하고, 전술한 구성 요소들 간의 통신(예: 제어 메시지)을 전달 하는 회로일 수 있다. 상기 프로세서 120은, 예를 들면, 상기 버스 110을 통해 전술한 다른 구성 요소들(예: 상기 메모리 130, 상기 입출력 인터페이스 140, 상기 디스플레이 150, 상기 통신 인터페이스 160 등)로부터 명령을 수신하여, 수신된 명령을 해독하고, 해독된 명령에 따른 연산이나 데이터 처리를 실행할 수 있다. 상기 메모리 130은, 상기 프로세서 120 또는 다른 구성 요소들(예: 상기 입출력 인터페이스 140, 상기 디스플레 이 150, 상기 통신 인터페이스 160 등)로부터 수신되거나 상기 프로세서 120 또는 다른 구성 요소들에 의해 생 성된 명령 또는 데이터를 저장할 수 있다. 상기 메모리 130은, 예를 들면, 커널 131, 미들웨어 132, 어플리케 이션 프로그래밍 인터페이스(API: application programming interface) 133 또는 어플리케이션 134 등의 프로 그래밍 모듈들을 포함할 수 있다. 전술한 각각의 프로그래밍 모듈들은 소프트웨어, 펌웨어, 하드웨어 또는 이 들 중 적어도 둘 이상의 조합으로 구성될 수 있다. 상기 커널 131은 나머지 다른 프로그래밍 모듈들, 예를 들면, 상기 미들웨어 132, 상기 API 133 또는 상기 어플 리케이션 134에 구현된 동작 또는 기능을 실행하는데 사용되는 시스템 리소스들(예: 상기 버스 110, 상기 프로 세서 120 또는 상기 메모리 130 등)을 제어 또는 관리할 수 있다. 또한, 상기 커널 131은 상기 미들웨어 132, 상기 API 133 또는 상기 어플리케이션 134에서 상기 전자 장치 101의 개별 구성 요소에 접근하여 제어 또는 관 리할 수 있는 인터페이스를 제공할 수 있다. 상기 미들웨어 132는 상기 API 133 또는 상기 어플리케이션 134가 상기 커널 131과 통신하여 데이터를 주고받을 수 있도록 중개 역할을 수행할 수 있다. 또한, 상기 미들웨어 132는 상기 어플리케이션 134로부터 수신된 작업 요청들과 관련하여, 예를 들면, 상기 어플리케이션 134 중 적어도 하나의 어플리케이션에 상기 전자 장치 101의 시스템 리소스(예: 상기 버스 110, 상기 프로세서 120 또는 상기 메모리 130 등)를 사용할 수 있는 우선 순위를 배정하는 등의 방법을 이용하여 작업 요청에 대한 제어(예: 스케쥴링 또는 로드 밸런싱)을 수행할 수 있다. 상기 API 133은 상기 어플리케이션 134가 상기 커널 131 또는 상기 미들웨어 132에서 제공되는 기능을 제어하기 위한 인터페이스로, 예를 들면, 파일 제어, 창 제어, 화상 처리 또는 문자 제어 등을 위한 적어도 하나의 인터 페이스 또는 함수(예: 명령어)를 포함할 수 있다. 다양한 실시예에 따르면, 상기 어플리케이션 134는 SMS/MMS 어플리케이션, 이메일 어플리케이션, 달력 어플리케 이션, 알람 어플리케이션, 건강 관리(health care) 어플리케이션(예: 운동량 또는 혈당 등을 측정하는 어플리케 이션) 또는 환경 정보 어플리케이션(예: 기압, 습도 또는 온도 정보 등을 제공하는 어플리케이션) 등을 포함할 수 있다. 추가적으로 또는 대체적으로, 상기 어플리케이션 134는 상기 전자 장치 101과 외부 전자 장치(예: 전 자 장치 104) 사이의 정보 교환과 관련된 어플리케이션일 수 있다. 상기 정보 교환과 관련된 어플리케이션은, 예를 들어, 상기 외부 전자 장치에 특정 정보를 전달하기 위한 알림 전달(notification relay) 어플리케이션, 또는 상기 외부 전자 장치를 관리하기 위한 장치 관리(device management) 어플리케이션을 포함할 수 있다. 예를 들면, 상기 알림 전달 어플리케이션은 상기 전자 장치 101의 다른 어플리케이션(예: SMS/MMS 어플리케이션, 이메일 어플리케이션, 건강 관리 어플리케이션 또는 환경 정보 어플리케이션 등)에서 발생한 알 림 정보를 외부 전자 장치(예: 전자 장치 104)로 전달하는 기능을 포함할 수 있다. 추가적으로 또는 대체적으로, 상기 알림 전달 어플리케이션은, 예를 들면, 외부 전자 장치(예: 전자 장치 104)로부터 알림 정보 를 수신하여 사용자에게 제공할 수 있다. 상기 장치 관리 어플리케이션은, 예를 들면, 상기 전자 장치 101과 통신하는 외부 전자 장치(예: 전자 장치 104)의 적어도 일부에 대한 기능(예: 외부 전자 장치 자체(또는, 일부 구성 부품)의 턴 온/턴 오프 또는 디스플레이의 밝기(또는, 해상도) 조절), 상기 외부 전자 장치에서 동작하는 어플리케이션 또는 상기 외부 전자 장치에서 제공되는 서비스(예: 통화 서비스 또는 메시지 서비스))을 관리(예: 설치, 삭제 또는 업데이트)할 수 있다. 다양한 실시예에 따르면, 상기 어플리케이션 134는 상기 외부 전자 장치(예: 전자 장치 104)의 속성(예: 전자 장치의 종류)에 따라 지정된 어플리케이션을 포함할 수 있다. 예를 들어, 외부 전자 장치가 MP3 플레이어인 경 우, 상기 어플리케이션 134는 음악 재생과 관련된 어플리케이션을 포함할 수 있다. 유사하게, 외부 전자 장치 가 모바일 의료기기인 경우, 상기 어플리케이션 134는 건강 관리와 관련된 어플리케이션을 포함할 수 있다. 한 실시예에 따르면, 상기 어플리케이션 134는 전자 장치 101에 지정된 어플리케이션 또는 외부 전자 장치(예: 서 버 106 또는 전자 장치 104)로부터 수신된 어플리케이션 중 적어도 하나를 포함할 수 있다. 상기 입출력 인터페이스 140은, 입출력 장치(예: 센서, 키보드 또는 터치 스크린)를 통하여 사용자로부터 입력 된 명령 또는 데이터를, 예를 들면, 상기 버스 110를 통해 상기 프로세서 120, 상기 메모리 130, 상기 통신 인 터페이스 160에 전달할 수 있다. 예를 들면, 상기 입출력 인터페이스 140은 터치 스크린을 통하여 입력된 사용 자의 터치에 대한 데이터를 상기 프로세서 120으로 제공할 수 있다. 또한, 상기 입출력 인터페이스 140은, 예를들면, 상기 버스 110을 통해 상기 프로세서 120, 상기 메모리 130, 상기 통신 인터페이스 160으로부터 수신된 명령 또는 데이터를 상기 입출력 장치(예: 스피커 또는 디스플레이)를 통하여 출력할 수 있다. 예를 들면, 상기 입출력 인터페이스 140은 상기 프로세서 120을 통하여 처리된 음성 데이터를 스피커를 통하여 사용자에게 출력 할 수 있다. 상기 디스플레이 150은 사용자에게 각종 정보(예: 멀티미디어 데이터 또는 텍스트 데이터 등)을 표시할 수 있다. 상기 통신 인터페이스 160은 상기 전자 장치 101과 외부 장치(예: 전자 장치 104 또는 서버 106) 간의 통신을 연결할 수 있다. 예를 들면, 상기 통신 인터페이스 160은 무선 통신 또는 유선 통신을 통해서 네트워크 162에 연결되어 상기 외부장치와 통신할 수 있다. 상기 무선통신은, 예를 들어, Wifi(wireless fidelity), BT(Bluetooth), NFC(near field communication), GPS(global positioning system) 또는 cellular 통신(예: LTE, LTE-A, CDMA, WCDMA, UMTS, WiBro또는 GSM 등) 중 적어도 하나를 포함할 수 있다. 상기 유선통신은, 예를 들어, USB(universal serial bus), HDMI(high definition multimedia interface), RS-232(recommended standard 232) 또는 POTS(plain old telephone service) 중 적어도 하나를 포함할 수 있다. 한 실시예에 따르면, 상기 네트워크 162는 통신 네트워크(telecommunications network)일 수 있다. 상기 통신 네트워크는 컴퓨터 네트워크(computer network), 인터넷(internet), 사물 인터넷(internet of things) 또는 전 화망(telephone network) 중 적어도 하나를 포함할 수 있다. 한 실시예에 따르면, 상기 전자 장치 101과 외부 장치 간의 통신을 위한 프로토콜(예: transport layer protocol, data link layer protocol 또는 physical layer protocol)은 어플리케이션 134, 어플리케이션 프로그래밍 인터페이스 133, 상기 미들웨어 132, 커널 131 또는 통신 인터페이스 160 중 적어도 하나에서 지원될 수 있다. 본 발명의 다양한 실시예들은 전자 장치의 외관 하우징으로 기여되는 금속 베젤에 대하여 기술하였으나 이에 국 한되지 않는다. 예컨대, 전자 장치가 아닌 여타 다른 구조체의 하우징에 적용될 수 있으며, 외관이 아닌 내부 구성 요소로써 적용되어도 무방하다. 본 발명의 다양한 실시예들은 테두리를 따라 후면의 적어도 일부까지 연장되는 금속 베젤에 대하여 기술하고 있 으며, 전자 장치의 테두리 중 일부에만 적용되거나, 후면에는 적용되지 않는 등 전자 장치의 다양한 영역에 선 별적으로 적용될 수 있는 금속 베젤 역시 본 발명의 기술적 사상에 부합될 것이다. 도 2a는 본 발명의 다양한 실시예에 따른 금속 베젤 210이 적용된 전자 장치 200의 사시도이다. 도 2b는 본 발 명의 다양한 실시예에 따른 전자 장치 200의 요부 평면도이다. 도 2a 및 도 2b를 참고하면, 전자 장치 200의 전면에는 디스플레이 201이 설치될 수 있다. 디스플레이 201의 상 측으로는 상대방의 음성을 수신하기 위한 스피커 장치 202가 설치될 수 있다. 디스플레이 201의 하측으로는 상 대방에게 전자 장치 사용자의 음성을 송신하기 위한 마이크로폰 장치 203이 설치될 수 있다. 한 실시예에 따르면, 스피커 장치 202가 설치되는 주변에는 전자 장치 200의 다양한 기능을 수행하기 위한 부품 (component)들이 배치될 수 있다. 부품들은 적어도 하나의 센서 모듈 204를 포함할 수 있다. 이러한 센서 모듈 204는, 예컨대, 조도 센서(예: 광센서), 근접 센서(예: 광센서), 적외선 센서, 초음파 센서 중 적어도 하나를 포함할 수 있다. 한 실시예에 따르면, 부품은 카메라 장치 205를 포함할 수도 있다. 한 실시예에 따르면, 부품 은 전자 장치 200의 상태 정보를 사용자에게 인지시켜주기 위한 LED 인디케이터 206을 포함할 수도 있다. 다양한 실시예에 따르면, 전자 장치 200은 하우징으로써 금속 베젤 210을 포함할 수 있다. 한 실시예에 따르면, 금속 베젤 210은 전자 장치 200의 테두리를 따라 배치될 수 있으며, 테두리와 연장되는 전자 장치 200의 후면의 적어도 일부 영역까지 확장되어 배치될 수 있다. 한 실시예에 따르면, 금속 베젤 210은 전자 장치 200의 테두리 를 따라 전자 장치의 두께를 정의하며, 폐루프 형상으로 형성될 수 있다. 그러나 이에 국한되지 않으며, 금속 베젤 210은 전자 장치 200의 두께 중 적어도 일부에 기여하는 방식으로 형성될 수도 있다. 한 실시예에 따르면, 금속 베젤 210은 전자 장치 200의 테두리 중 적어도 일부 영역에만 배치될 수도 있다. 한 실시예에 따르면, 금 속 베젤 210은 전자 장치 200의 하우징의 일부로 기여될 때, 하우징의 나머지 일부분은 비금속 부재로 대체될 수 있다. 이러한 경우, 금속 베젤 210은 비금속 부재가 조립 또는 인서트 사출되는 방식으로 형성될 수 있다. 다양한 실시예에 따르면, 금속 베젤 210은 테두리를 따라 폐루프 형상을 가지며, 전자 장치 200의 두께의 전부 에 기여되는 방식으로 배치될 수 있다. 한 실시예에 따르면, 전자 장치 200를 정면에서 보았을 경우, 금속 베젤210은 우측 베젤부 211, 좌측 베젤부 212, 상측 베젤부 213 및 하측 베젤부 214가 형성될 수 있다. 한 실시예에 따르면, 금속 베젤 210은 우측 베젤부 211과 상측 베젤부 213이 조우하는 상부 우측 코너 베젤부 215와 좌측 베 젤부 212와 상측 베젤부 213이 조우하는 상부 좌측 코너 베젤부 216을 포함할 수 있다. 한 실시예에 따르면, 금 속 베젤 210은 우측 베젤부 211과 하측 베젤부 214가 조우하는 하부 우측 코너 베젤부 218과 좌측 베젤부 212와 하측 베젤부 214가 조우하는 하부 좌측 코너 베젤부 217을 포함할 수 있다. 도 3a는 본 발명의 다양한 실시예에 따른 금속 베젤 210에 비금속 부재 220이 인서트 사출된 상태를 도시한 도 면이다. 도 3a를 참고하면, 금속 베젤 210은 비금속 부재 220와 인서트 사출에 의해 하나의 하우징으로 완성될 수 있다. 한 실시예에 따르면, 금속 베젤 220은 전자 장치의 테두리 및 후면의 적어도 일부 영역에 배치될 수 있다. 한 실시예에 따르면, 금속 베젤 210은 전자 장치 200의 내부 영역 중 적어도 일부 영역까지 연장되도록 배치될 수 도 있다. 한 실시예에 따르면 비금속 부재 220는 합성 수지 재질의 부재일 수 있다. 그러나 이에 국한되지 않으 며, 다양한 비도전성 유전체 재질이 적용될 수 있다. 다양한 실시예에 따르면, 금속 베젤 210의 강성 보강을 위하여, 상부 우, 좌측 코너 베젤부 215, 216과 하부 좌, 우측 코너 베젤부 217, 218의 두께를 우측 및 좌측 베젤부 211, 212의 두께보다 두껍게 형성할 수 있다. 도 3b는 본 발명의 다양한 실시예에 따른 금속 베젤 210에 비금속 부재 220이 인서트 사출된 상태를 도시한 요 부 구성도이다. 도 3b를 참고하면, 금속 베젤 210은 상측 베젤부 213의 적어도 일부 영역이 분절된 분절부 219를 포함할 수 있 다. 한 실시예에 따르면, 분절부 219는 금속 베젤 210에 비금속 부재 220이 인서트 사출될 때 함께 형성될 수 있다. 이러한 분절부 219에 의해 전자 장치가 통신용 장치로 사용될 때, 전자 장치의 내부에 배치된 안테나 방 사체와 함께 상측 베젤부 213은 안테나 방사체로 사용될 수 있다. 다양한 실시예에 따르면, 종래에는 도 3b의 우, 좌측 베젤부 211, 212 중 일부 영역(도 3b의 E부분)에 각각 분 절부를 포함하였다. 그러나, 이러한 분절부의 배치에 의해, 코너 베젤부 215, 216도 안테나 방사체로 사용되고, 안테나 성능 확보 때문에 두껍게 형성할 수 없었다. 그러나 본 발명의 다양한 실시예에 따르면, 도 3b의 E 부분의 분절부를 배제시키고, 상측 베젤부 213 중 일정 영역에 적어도 하나의 분절부 219를 배치하고, 각 코너 베젤부 215, 216의 두께를 우, 좌측 베젤부 211, 212의 두께보다 두껍게 형성시켜 강성을 보강함으로써, 외부 충격에 의한 변형 및 파손을 미연에 방지할 수 있다. 도 4a 및 도 4b는 본 발명의 다양한 실시예에 따른 도 3b의 A 부분의 요부 구성 및 단면을 도시한 도면이다. 도 4a 및 도 4b를 참고하면, 전자 장치의, 특히 취약한 코너 베젤부의 강성을 확보하여 위하여, 금속 베젤 210 의 코너 베젤부의 두께를 상대적으로 두껍게 형성함과 동시에 인서트 사출로 부가되는 비금속 부재 220과의 결 합력을 강화시킬 수 있다. 다양한 실시예에 따르면, 금속 베젤 210의 각 코너 베젤부에서 전자 장치의 내측 방향으로 보강 돌기 2101이 일 정 길이 만큼 인입되도록 형성한 후, 보강 돌기 2101을 감싸는 방식으로 비금속 부재 220를 인서트 사출할 수 있다. 따라서, 보강 돌기 2101의 상부에는 비금속 부재 220의 상측 지지부 2201이 인서트 사출될 수 있으며, 보 강 돌기 2101의 하부에는 비금속 부재 220의 하측 지지부 2202가 인서트 사출될 수 있다. 이러한 경우, 금속 베 젤 210과 비금속 부재 220간의 접촉면이 확장됨으로써 금속 베젤 210의 각 코너 베젤부는 강성이 확보될 수 있 다. 도 5a 내지 도 5c는 본 발명의 다양한 실시예에 따른 도 3b의 B, C 및 D의 방향에서 바라본 요부 단면도이다. 다양한 실시예에 따르면, 각 코너 베젤부에서 상, 하측 베젤부까지 외관적으로는 동일한 두께를 갖도록 형성하 고 있으나, 상, 하측 베젤부가 안테나 방사체로 사용될 경우, 두께의 증가에 따른 안테나 방사 성능 열화를 야 기시킬 수 있다.따라서, 도 5a에 도시된 바와 같이, 코너 베젤부 216의 두께는 상대적으로 그 단면 역시 두껍게 형성되나, 도 5b 및 도 5c에 도시된 바와 같이, 상측 베젤부 213는 내부에 길이 방향으로 슬릿 2102, 2103이 형성될 수 있다. 이러한 슬릿 2102, 2103은 주변 안테나 방사체의 성능 열화를 방지하고, 상측 베젤부 213이 자체적으로 안테나 방사체로 사용할 경우 개선된 안테나 방사 성능이 발현될 수 있다. 한 실시예에 따르면, 상술한 상측 베젤부 213의 슬릿 2102, 2103에는 인서트 사출시 비금속 부재 220이 충진되며, 비금속 부재 220은 그 두께가 증가하더 라도 유전체로써 안테나 방사 성능에 전혀 지장을 주지 않는다. 도 6a는 본 발명의 다양한 실시예에 따른 금속 베젤 610에 비금속 부재 620이 인서트 사출된 상태를 도시한 도 면이다. 도 6a를 참고하면, 금속 베젤 610은 전자 장치의 두께에 기여되는 테두리 및 후면의 일부 영역을 포함할 수 있 으며, 나머지 영역은 비금속 부재 620이 인서트 사출될 수 있다. 그러나 이에 국한되지 않으며, 테두리의 일부 영역만이 금속 베젤 610으로 형성될 수도 있다. 한 실시예에 따르면, 테두리는 우, 좌, 상, 하측 베젤부 611, 612, 613, 614를 포함할 수 있다. 금속 베젤 610은 비금속 부재 620이 인서트 사출된 후, 그 경계면을 포함하여 전체적으로 도장 처리될 수 있다. 이러한 도장 처리에 의해 금속 베젤 610 및 비금속 부재 620의 경계부는 육안 으로 식별되지 않아 미려한 외관을 제공할 수 있다. 도 6b는 본 발명의 다양한 실시예에 따른 금속 베젤 610에 비금속 부재 620이 인서트 사출 후 외면이 도장된 상 태를 도시한 요부 사시도이다. 도 6b를 참고하면, 금속 베젤 610에 비금속 부재 620이 인서트 사출된 후, 도장 처리된 후면 베젤부 615의 일부 를 도시하고 있다. 한 실시예에 따르면, 금속 베젤 610의 후면 베젤부 615와 각 측면 베젤부 611, 612, 613, 614 사이의 경계 부분은 길이 방향을 따라 최종적으로 챔퍼(chamfer) 616이 형성될 수 있다. 한 실시예에 따르 면, 챔퍼 616은 다이아 컷 공정에 의해 형성될 수 있다. 다양한 실시예에 따르면, 도시된 바와 같이, 도장 후, 최종 공정으로써 금속 베젤 610의 상측 베젤부 613과 후 면 베젤부 615 사이의 경계 부분에 길이 방향으로 챔퍼 616이 형성될 수 있다. 한 실시예에 따르면, 챔퍼 616에 는 도장 공정 후 챔퍼 가공 공정 때문에 비금속 부재 620이 노출될 수 있다. 즉, 금속 베젤 610에 비금속 부재 620의 인서트 몰딩에 의해 경계면에 형성되는 분절부는 도장 처리에 의해 상대적으로 면적이 적은 챔퍼 616를 제외하고는 외부에 노출되지 않기 때문에 전자 장치의 외관이 미려해지도록 유도할 수 있다. 도 6c는 본 발명의 다양한 실시예에 따른 챔퍼면에 부식 방지를 위한 표면 처리층이 형성된 상태를 도시한 요부 단면도이다. 도 6c를 참고하면, 금속 베젤 610의 모서리에 형성된 챔퍼 616에 의해 금속 부분이 외부로 노출될 수 있으며, 노출된 금속 부분은 부식에 취약할 수 있다. 따라서, 도장면의 상부에는 챔퍼를 포함하여 부식 방지를 위한 표 면 처리층 619가 더 형성될 수 있다. 한 실시예에 따르면, 표면 처리층 619는 챔퍼에만 형성될 수도 있다. 다양한 실시예에 따르면, 표면 처리층 619는 도장면의 상부에 일정 두께로 적층되는 프라이머 층 619-1 및 프라 이머 층 619-1의 상부에 적층되는 AF(Anti Fingerprint) 코팅층 619-2를 포함할 수 있다. 다양한 실시예에 따르면, 프라이머 층 619-1은 AF 코팅층 619-2의 적층을 원활하게 하게 하기 위한 것으로써, SiO2 계열 혹은 Al2O3 계열의 소재를 진공 증착 혹은 스퍼터링 공정을 통해 형성할 수 있다. 한 실시예에 따르 면, 프라이머 층 619-1은 단일 소재는 물론이고, SiO2와 Al2O3가 일정 비율로 혼합된 소재를 증착 하여 형성할 수 도 있다. 한 실시예에 따르면, 프라이머 층 619-1은 Al2O3 소재를 일정 두께로 형성한 후 SiO2계열의 소재를 일정 두께로 추가 형성하여 다층 막을 형성할 수도 있다. 한 실시예에 따르면, 프라이머 층 619-1은 20 ~ 2000 나노미터의 두께로 형성될 수 있다. 다양한 실시예에 따르면, AF 코팅층 619-2는 고내마찰성, 방오성 및 내약품성이 우수한 재질을 증착하여 형성시 킬 수 있다. 한 실시예에 따르면, AF 코팅층 대신 세라믹 코팅층이 적용될 수도 있다.도 7a 및 도 7b는 본 발명의 다양한 실시예에 따른 도 6a의 F 방향에서 바라본 단면도이다. 도 7a를 참고하면, 하우징으로써 금속 베젤 610이 형성될 수 있으며, 금속 베젤 610은 내측의 브라켓 630을 지 지할 수 있고, 그 상부에는 윈도우 640이 설치될 수 있다. 미도시되었으나, 윈도우 640과 브라켓 630 사이에는 디스플레이가 배치될 수 있다. 다양한 실시예에 따르면, 금속 베젤 610은 후면 베젤부 615와 우측 베젤부 611 사이의 경계 부분에 챔퍼 형성 영역 616이 형성될 수 있다. 한 실시예에 따르면, 챔퍼 형성 영역 616은 평면일 수 있다. 한 실시예에 따르면, 우측 베젤부 611과 윈도우 640 사이의 우측 베젤부의 상면 617과의 경계 부분 역시 챔퍼 형성 영역 618이 형성 될 수 있다. 미도시되었으나, 챔퍼 형성 영역 618은 각 측면 베젤부 611의 하측 단부 및 상측 단부, 즉 전자 장 치의 전면 및 후면과의 경계 부분에 모두 형성될 수 있다. 도 7b를 참고하면, 챔퍼 형성 영역 616, 618은 외측으로 만곡진 곡형으로 형성되어도 무방하다. 미도시되었으나, 다양한 실시예에 따르면, 챔퍼 형성 영역 616, 618은 내측으로 만곡진 곡형으로 형성되어도 무 방하다. 한 실시예에 따르면, 도장 처리가 되지 않은 전자 장치의 측면 베젤부 611과 후면 베젤부 615 사이의 경계 부분 또는 측면 베젤부 611과 전면(상면) 617 사이의 경계 부분에는 적어도 두 개의 챔퍼가 이웃하도록 연 속적으로 형성될 수도 있다. 도 8은 본 발명의 다양한 실시예에 따른 전자 장치의 금속 베젤(예: 하우징)을 제조하기 위한 공정도이다. 도 9a 내지 도 9c는 본 발명의 다양한 실시예에 따른 도 8의 금속 베젤의 제조 공정에 따른 과정을 도시한 구성도 이다. 도 8의 공정을 설명함에 있어 도 9a 내지 도 9c의 도면을 참고하여 기술하기로 한다. 도 8을 참고하면, 801 공정에서 비금속 부재가 배제된 금속 베젤 610을 제조할 수 있다. 금속 베젤 610은 도 9a 에 도시된 바와 같이, 알루미늄, 마그네슘, SUS 등 다양한 금속 재질로 형성할 수 있으며, 캐스팅, 프레스 공법 등을 통하여 소망 성형품을 완성할 수 있다. 그후, 803 공정에서, 형성된 금속 베젤 610은 금속 영역이 제공되지 않는 부분을 채우기 위하여 비금속 부재 620으로 인서트 사출할 수 있다. 도 9a에 도시된 바와 같이, 금속 베젤 610의 금속 영역은 전자 장치의 두께 및 테두리에 기여되는 우측 베젤부 611, 좌측 베젤부 612, 상측 베젤부 613 및 하측 베젤부 614를 포함할 수 있으 며, 각 측면 베젤부 611, 612, 613, 614 중 적어도 일부 영역과 연결되는 후면 베젤부 615를 포함할 수 있다. 한 실시예에 따르면, 후면 베젤부 615는 전자 장치 후면의 적어도 일부 영역에 배치될 수 있다. 그후, 805 공정에서, 금속 베젤 610과 비금속 부재 620의 경계부에 대한 평탄화 가공을 수행할 수 있다. 도 9b 를 참고하면, 평탄화 가공은 금속 베젤 610 및 비금속 부재 620의 경계 부분뿐만 아니라, 전자 장치의 후면 베 젤부 615 및 각 측면 베젤부 611, 612, 613, 614 모두 버프 가공(buffing)을 수행할 수 있다. 한 실시예에 따 르면, 버프 가공은 2회 이상 반복적으로 수행할 수 있다. 그후, 807 공정에서, 평탄화 작업이 완료된 금속 베젤 610의 외부 전체면에 대하여 도장 처리를 수행할 수 있다. 이러한 도장 처리 공정에 의하여 도 9c에 도시된 바와 같이, 803 공정에서 금속 베젤 610에 비금속 부재 620를 인서트 사출하여 형성된 금속 베젤 610의 이종 재질 적용에 의한 경계 영역이 감춰질 수 있다. 한 실시예 에 따르면, 이러한 도장 처리 공정에 의하여 전자 장치의 하우징은 단일 재질로 형성된 듯한 느낌 및 미려한 외 관을 제공할 수 있는 것이다. 한 실시예에 따르면, 도장 처리 공정은 소프트 필 처리 공정을 포함하여, 적용되 는 도료의 종류(예: 천연 소재의 도료)에 따라 사용자에게 우수한 촉감 및 질감을 제공할 수도 있다. 그후, 809 공정을 통하여, 각 측면 베젤부 611, 612, 613, 614와 후면 베젤부 615의 경계 부분 사이에 길이 방 향으로 챔퍼 616을 형성할 수 있다. 한 실시예에 따르면, 챔퍼 616은 도장면에서 금속 베젤 610의 금속 재질을 일부 노출시켜 전자 장치의 미려한 외관을 제공할 수 있으며, 각진 모서리에 비해 우수한 그립감을 사용자에게 제공할 수도 있다. 도 10a 내지 도 10e는 본 발명의 다양한 실시예에 따른 도 9a의 G 부분에 대하여 비금속 부재 620이 금속 베젤 610과 인서트 사출 후 평탄화 공정 및 도장 공정을 도시한 모식도이다. 도 10a에 도시된 바와 같이, 금속 베젤 610에 비금속 부재 620을 인서트 사출할 경우, 이종 재질간의 경계 부분 에는 단차부 6201 또는 갭 6202가 발생될 수 있다. 이러한 단차부 6201에 의해 도장 공정을 수행하더라도 외면 이 돌출되고, 갭 6202에 의해 외면의 일부가 함몰되는 현상이 발생할 수 있다. 따라서, 10b에 도시된 바와 같이, 버프 가공(buffing)을 통해 단차부 6201을 제거하고, 도 10c에 도시된 바와 같이, 일정 두께의 프라이머(primer) 650를 적층시킬 수 있다. 한 실시예에 따르면, 프라이머 650은 퍼티 (putty)를 사용할 수 있으며, 상술한 이종 재질간의 경계 부분의 갭 6202를 매꿀 수 있다. 그후, 도 10d에 도시된 바와 같이, 프라이머 650가 경화된 후, 금속 베젤 면과 비금속 부재의 면이 서로 평평한 평면을 이루도록 재차 버프 가공(buffing)을 수행한 후, 도 10e에 도시된 바와 같이, 그 상부에 도료를 도포하 여 도장막 층 660을 형성할 수 있다. 그후, 미도시된 챔퍼 가공을 수행할 수 있다. 도 11a 및 도 11b는 본 발명의 다양한 실시예에 따른 전자 장치의 이어잭 홀 671 부근의 챔퍼(chamfer) 및 가공 경로를 도시한 도면이다. 도 11a를 참고하면, 전자 장치는 헤드셋의 이어 플러그를 수용하기 위한 이어잭 어셈블리를 포함할 수 있다. 이 러한 경우, 이어 플러그를 수용하기 위한 이어잭 홀 671은 대체적으로 전자 장치의 측면 베젤부에 배치될 수 있 다. 또한, 이어잭 홀 671은 이어잭 어셈블리를 수용하며, 금속 재질의 금속 베젤과 전기적으로 분리되기 위한 몰드부 670이 함께 형성될 수 있다. 한 실시예에 따르면, 이어잭 홀 671 및 몰드부 670은 먼저 기술한 챔퍼 616 의 가공 경로에 포함될 수 있으며, 챔퍼 616의 형성에 의해 몰드부 670가 함께 가공됨으로써 도 11b에 도시된 기존 챔퍼에 의해 이어잭 홀 부분의 살두께가 얇아지고 이로 인하여 부분적으로 강성에 취약해질 수 있다. 다양한 실시예에 따르면, 챔퍼 616을 가공하기 위한 가공 툴(예: 다이아 컷팅 툴)을 이동시킬 때, 도 11a에 도 시된 바와 같이, 해당 이어잭 홀 671 부분에서는 가공 툴의 수평 방향 및 수직 방향의 위상을 변화시켜 도 11b 의 개선된 챔퍼에 의해 살두께를 보강할 수 있다. 한 실시예에 따르면, 이어잭 홀 부분의 챔퍼를 가공할 때는 이어잭 홀과 먼 방향으로 가공 툴의 가공 경로를 이동시킬 수 있다. 다양한 실시예에 따르면, 이어잭 홀 뿐만 아니라, 전자 장치의 외부에 노출될 수 있는 개구가 요구되는 다양한 전자 부품 수용 공간(예: 인터페이스 컨넥터 포트, 마이크 홀, 스피커 홀 등)을 가공 툴이 지날 때에도 이와 같 은 챔퍼 가공 방법이 사용될 수 있다. 도 12a는 본 발명의 다양한 실시예에 따른 비금속으로 이루어진 보조 하우징 1230이 금속 베젤 1210에 조립되어 있는 구성도이다. 도 12a를 참고하면, 금속 베젤 1210은 비금속 부재와 인서트 사출에 의해 전자 장치의 하우징으로 완성될 수 있 다. 한 실시예에 따르면, 금속 베젤 1210은 전자 장치의 테두리 및 후면의 적어도 일부 영역에 배치될 수 있다. 한 실시예에 따르면, 금속 베젤 1210은 전자 장치의 내부 영역 중 적어도 일부 영역까지 연장되도록 배치될 수 도 있다. 한 실시예에 따르면, 금속 베젤 1210의 테두리는 우, 좌, 상, 하측 베젤부 1211, 1212, 1213, 1214를 포함할 수 있다. 다양한 실시예에 따르면, 보조 하우징 1230은 비금속 재질로 형성될 수 있다. 한 실시예에 따르면, 보조 하우징 1230은 금속 재질이 비금속 재질에 조립되는 방식으로 형성될 수 있다. 한 실시예에 따르면, 보조 하우징 1230 은 비금속 재질이 금속 재질에 인서트 사출되어 형성될 수도 있다. 다양한 실시예에 따르면, 보조 하우징 1230은 금속 재질을 포함하더라도, 금속 베젤 1210과 물리적으로 접촉되 지 않도록 형성될 수 있다. 이는 보조 하우징 1230에 포함된 전자 부품들(예: 기판)에 의해 금속 베젤 1210로 전류가 유기되어 발생할 수 잇는 감전 사고를 미연에 방지하고자 하는데 기인한다. 이하, 보호 하우징 1230에 대하여 더욱 상세히 후술될 것이다. 도 12b는 본 발명의 다양한 실시예에 따른 도 12의 금속 베젤 1210에 적용되는 보조 하우징(예: 브라켓) 1230 및 기판 1240의 구성도이다. 도 12b를 참고하면, 금속 베젤 1210의 내부에 기판 1240을 포함하는 별도의 보조 하우징(예: 브라켓) 1230이 더 설치될 수 있다. 한 실시예에 따르면, 보조 하우징 1230은 전체가 비도전성 부재(예: 합성 수지)로 형성될 수있으나, 금속 부재(예: 배터리 팩 지지를 위한 보강 플레이트 1231, 인터페이스 컨넥터 포트 1241 등)와 함께 조립 또는 인서트 사출될 수도 있다. 이러한 경우, 금속 부재 1231은 전자 장치의 측면까지 신장된 금속 베젤 1210과 접촉하지 않거나 전기적으로 분리되도록 배치될 수 있다. 한 실시예에 따르면, 기판 1240 역시 금속 베 젤 1210과 전기적으로 분리되도록 배치됨으로써, 감전 사고를 미연에 예방할 수 있다. 도 13은 본 발명의 다양한 실시예에 따른 인터페이스 컨넥터 포트 1241이 금속 베젤 1210에 적용되는 상태를 도 시한 요부 단면도이다. 도 13을 참고하면, 금속 재질의 인터페이스 컨넥터 포트 1241과 금속 베젤 1210을 전기적을 분리시키기 위하여, 비금속 부재 1220은 인터페이스 컨넥터 포트 1241을 수용하기 위한 개구 1221까지 연장 사출될 수 있다. 따라서, 인터페이스 컨넥터 포트 1241에 흐르는 전류는 인터페이스 컨넥터 포트 1241를 감싸도록 배치되는 비금 속 부재 1220에 의해 금속 베젤 1210로 전류가 유기되어 발생할 수 있는 감전 사고를 미연에 방지할 수 있다. 도 14는 본 발명의 다양한 실시예에 따른 전자 장치의 블록 구성도이다. 도 14를 참고하면, 상기 전자 장치 1401은, 예를 들면, 도 1에 도시된 전자 장치 101의 전체 또는 일부를 구성 할 수 있다. 도 14를 참조하면, 상기 전자 장치 1401은 하나 이상의 어플리케이션 프로세서(AP: application processor) 1410, 통신 모듈 1420, SIM(subscriber identification module) 카드 1424, 메모리 1430, 센서 모 듈 1440, 입력 장치 1450, 디스플레이 1460, 인터페이스 1470, 오디오 모듈 1480, 카메라 모듈 1491, 전력관리 모듈 1495, 배터리 1496, 인디케이터 1497 및 모터 1498을 포함할 수 있다. 상기 AP 1410은 운영체제 또는 응용 프로그램을 구동하여 상기 AP 1410에 연결된 다수의 하드웨어 또는 소프트 웨어 구성 요소들을 제어할 수 있고, 멀티미디어 데이터를 포함한 각종 데이터 처리 및 연산을 수행할 수 있다. 상기 AP 1410은, 예를 들면, SoC(system on chip)로 구현될 수 있다. 한 실시예에 따르면, 상기 AP 1410은 GPU(graphic processing unit, 미도시)를 더 포함할 수 있다. 상기 통신모듈 1420(예: 상기 통신 인터페이스 160)은 상기 전자 장치 1401(예: 상기 전자 장치 101)과 네트워 크를 통해 연결된 다른 전자 장치들(예: 전자 장치 104 또는 서버 106) 간의 통신에서 데이터 송수신을 수행할 수 있다. 한 실시예에 따르면, 상기 통신 모듈 1420은 셀룰러 모듈 1421, Wifi 모듈 1423, BT 모듈 1425, GPS 모듈 1427, NFC 모듈 1428 및 RF(radio frequency) 모듈 1429를 포함할 수 있다. 상기 셀룰러 모듈 1421은 통신망(예: LTE, LTE-A, CDMA, WCDMA, UMTS, WiBro 또는 GSM 등)을 통해서 음성 통화, 영상 통화, 문자 서비스 또는 인터넷 서비스 등을 제공할 수 있다. 또한, 상기 셀룰러 모듈 1421은, 예를 들면, 가입자 식별 모듈(예: SIM 카드 1424)을 이용하여 통신 네트워크 내에서 전자 장치의 구별 및 인증을 수 행할 수 있다. 한 실시예에 따르면, 상기 셀룰러 모듈 1421은 상기 AP 1410이 제공할 수 있는 기능 중 적어도 일부 기능을 수행할 수 있다. 예를 들면, 상기 셀룰러 모듈 1421은 멀티 미디어 제어 기능의 적어도 일부를 수 행할 수 있다. 한 실시예에 따르면, 상기 셀룰러 모듈 1421은 커뮤니케이션 프로세서(CP: communication processor)를 포함할 수 있다. 또한, 상기 셀룰러 모듈 1421은, 예를 들면, SoC로 구현될 수 있다. 도 14에서는 상기 셀룰러 모듈 1421(예: 커뮤니케이션 프로세서), 상기 메모리 1430 또는 상기 전력관리 모듈 1495 등의 구성 요소들이 상기 AP 1410과 별개의 구성 요소로 도시되어 있으나, 한 실시예에 따르면, 상기 AP 1410이 전술한 구성 요소들의 적 어도 일부(예: 셀룰러 모듈 1421)를 포함하도록 구현될 수 있다. 한 실시예에 따르면, 상기 AP 1410 또는 상기 셀룰러 모듈 1421(예: 커뮤니케이션 프로세서)은 각각에 연결된 비휘발성 메모리 또는 다른 구성 요소 중 적어도 하나로부터 수신한 명령 또는 데이터를 휘발성 메모리에 로드 (load)하여 처리할 수 있다. 또한, 상기 AP 1410 또는 상기 셀룰러 모듈 1421은 다른 구성 요소 중 적어도 하 나로부터 수신하거나 다른 구성 요소 중 적어도 하나에 의해 생성된 데이터를 비휘발성 메모리에 저장(store)할 수 있다. 상기 Wifi 모듈 1423, 상기 BT 모듈 1425, 상기 GPS 모듈 1427 또는 상기 NFC 모듈 1428 각각은, 예를 들면, 해당하는 모듈을 통해서 송수신되는 데이터를 처리하기 위한 프로세서를 포함할 수 있다. 도 14에서는 셀룰러 모듈 1421, Wifi 모듈 1423, BT 모듈 1425, GPS 모듈 1427 또는 NFC 모듈 1428이 각각 별개의 블록으로 도시되 었으나, 한 실시예에 따르면, 셀룰러 모듈 1421, Wifi 모듈 1423, BT 모듈 1425, GPS 모듈 1427 또는 NFC 모듈1428 중 적어도 일부(예: 두 개 이상)는 하나의 integrated chip(IC) 또는 IC 패키지 내에 포함될 수 있다. 예 를 들면, 셀룰러 모듈 1421, Wifi 모듈 1423, BT 모듈 1425, GPS 모듈 1427 또는 NFC 모듈 1428 각각에 대응하 는 프로세서들 중 적어도 일부(예: 셀룰러 모듈 1421에 대응하는 커뮤니케이션 프로세서 및 Wifi 모듈 1423에 대응하는 Wifi 프로세서)는 하나의 SoC로 구현될 수 있다. 상기 RF 모듈 1429는 데이터의 송수신, 예를 들면, RF 신호의 송수신을 할 수 있다. 상기 RF 모듈 1429는, 도시 되지는않았으나, 예를 들면, 트랜시버(transceiver), PAM(power amp module), 주파수필터(frequency filter) 또는 LNA(low noise amplifier) 등을 포함할 수 있다. 또한, 상기 RF 모듈 1429는 무선 통신에서 자유 공간상 의 전자파를 송수신하기 위한 부품, 예를 들면, 도체 또는 도선 등을 더 포함할 수 있다. 도 14에서는 셀룰러 모듈 1421, Wifi 모듈 1423, BT 모듈 1425, GPS 모듈 1427 및 NFC 모듈 1428이 하나의 RF 모듈 1429를 서로 공 유하는 것으로 도시되어 있으나, 한 실시예에 따르면, 셀룰러 모듈 1421, Wifi 모듈 1423, BT 모듈 1425, GPS 모듈 1427 또는 NFC 모듈 1428 중 적어도 하나는 별개의 RF 모듈을 통하여 RF 신호의 송수신을 수행할 수 있다. 상기 SIM 카드 1424는 가입자 식별 모듈을 포함하는 카드일 수 있으며, 전자 장치의 특정 위치에 형성된 슬롯에 삽입될 수 있다. 상기 SIM 카드 1424는 고유한식별정보(예: ICCID(integrated circuit card identifier)) 또 는 가입자정보(예: IMSI(international mobile subscriber identity))를 포함할 수 있다. 상기 메모리 1430(예: 상기 메모리 130)은 내장 메모리 1432 또는 외장 메모리 1434를 포함할 수 있다. 상기 내장메모리 1432는, 예를 들면, 휘발성 메모리(예를들면, DRAM(dynamic RAM), SRAM(static RAM), SDRAM(synchronous dynamic RAM) 등) 또는 비휘발성 메모리(non-volatile Memory, 예를 들면, OTPROM(one time programmable ROM), PROM(programmable ROM), EPROM(erasable and programmable ROM), EEPROM(electrically erasable and programmable ROM), mask ROM, flash ROM, NAND flash memory, NOR flash memory 등) 중 적어도 하나를 포함할 수 있다. 한 실시예에 따르면, 상기 내장 메모리 1432는 Solid State Drive (SSD)일 수 있다. 상기 외장메모리 1434는 flash drive, 예를 들면, CF(compact flash), SD(secure digital), Micro-SD(micro secure digital), Mini- SD(mini secure digital), xD(extreme digital) 또는 Memory Stick 등을 더 포함할 수 있다. 상기외장메모리 1434는 다양한 인터페이스를 통하여 상기 전자장치 1401과 기능적으로 연결될 수 있다. 한 실시예에 따르면, 상 기 전자장치 1401은 하드드라이브와 같은 저장 장치(또는 저장 매체)를 더 포함할 수 있다. 상기 센서 모듈 1440은 물리량을 계측하거나 전자 장치 1401의 작동 상태를 감지하여, 계측 또는 감지된 정보를 전기 신호로 변환할 수 있다. 상기 센서 모듈 1440은, 예를 들면, 제스처 센서 1440A, 자이로 센서 1440B, 기 압 센서 1440C, 마그네틱 센서 1440D, 가속도 센서 1440E, 그립 센서 1440F, 근접 센서 1440G, color 센서 1440H(예: RGB(red, green, blue) 센서), 생체 센서 1440I, 온/습도 센서 1440J, 조도 센서 1440K 또는 UV(ultra violet) 센서 1440M 중의 적어도 하나를 포함할 수 있다. 추가적으로 또는 대체적으로, 상기 센서 모 듈 1440은, 예를 들면, 후각 센서(E-nose sensor, 미도시), EMG 센서(electromyography sensor, 미도시), EEG 센서(electroencephalogram sensor, 미도시), ECG 센서(electrocardiogram sensor, 미도시), IR(infra red) 센 서(미도시), 홍채 센서(미도시) 또는 지문 센서(미도시) 등을 포함할 수 있다. 상기 센서 모듈 1440은 그 안에 속한 적어도 하나 이상의 센서들을 제어하기 위한 제어 회로를 더 포함할 수 있다. 상기 입력 장치 1450은 터치 패널(touch panel) 1452, (디지털) 펜 센서(pen sensor) 1454, 키(key) 1456 또는 초음파(ultrasonic) 입력 장치 1458을 포함할 수 있다. 상기 터치 패널 1452는, 예를 들면, 정전식, 감압식, 적외선 방식 또는 초음파 방식 중 적어도 하나의 방식으로 터치 입력을 인식할 수 있다. 또한, 상기 터치 패널 1452는 제어 회로를 더 포함할 수도 있다. 정전식의 경우, 물리적 접촉 또는 근접 인식이 가능하다. 상기 터 치 패널 1452는 택타일 레이어(tactile layer)를 더 포함할 수도 있다. 이 경우, 상기 터치 패널 1452는 사용 자에게 촉각 반응을 제공할 수 있다. 상기 (디지털) 펜 센서 1454는, 예를 들면, 사용자의 터치 입력을 받는 것과 동일 또는 유사한 방법 또는 별도 의 인식용 쉬트(sheet)를 이용하여 구현될 수 있다. 상기 키 1456은, 예를 들면, 물리적인 버튼, 광학식 키 또 는 키패드를 포함할 수 있다. 상기 초음파(ultrasonic) 입력 장치 1458은 초음파 신호를 발생하는 입력 도구를 통해, 전자 장치 1401에서 마이크(예: 마이크 1488)로 음파를 감지하여 데이터를 확인할 수 있는 장치로서, 무 선 인식이 가능하다. 한 실시예에 따르면, 상기 전자 장치 1401은 상기 통신 모듈 1420을 이용하여 이와 연결 된 외부 장치(예: 컴퓨터 또는 서버)로부터 사용자 입력을 수신할 수도 있다. 상기 디스플레이 1460(예: 상기 디스플레이 150)은 패널 1462, 홀로그램 장치 1464 또는 프로젝터 1466을 포함 할 수 있다. 상기 패널 1462는, 예를들면, LCD(liquid-crystal display) 또는 AM-OLED(active-matrix organic light-emitting diode) 등일 수 있다. 상기 패널 1462은, 예를 들면, 유연하게(flexible), 투명하게 (transparent) 또는 착용할 수 있게(wearable) 구현될 수 있다. 상기 패널 1462는 상기 터치 패널 1452와 하 나의 모듈로 구성될 수도 있다. 상기 홀로그램 장치 1464는 빛의 간섭을 이용하여 입체 영상을 허공에 보여줄 수 있다. 상기 프로젝터 1466은 스크린에 빛을 투사하여 영상을 표시할 수 있다. 상기 스크린은, 예를 들면, 상기 전자 장치 1401의 내부 또는 외부에 위치할 수 있다. 한 실시예에 따르면, 상기 디스플레이 1460은 상기 패널 1462, 상기 홀로그램 장치 1464, 또는 프로젝터 1466을 제어하기 위한 제어 회로를 더 포함할 수 있다. 상기 인터페이스 1470은, 예를 들면, HDMI(high-definition multimedia interface) 1472, USB(universal serial bus) 1474, 광 인터페이스(optical interface) 1476 또는 D-sub(D-subminiature) 1478을 포함할 수 있 다. 상기 인터페이스 1470은, 예를 들면, 도 1에 도시된 통신 인터페이스 160에 포함될 수 있다. 추가적으로 또는 대체적으로, 상기 인터페이스 1470은, 예를 들면, MHL(mobile high-definition link) 인터페이스, SD(secure Digital) 카드/MMC(multi-media card) 인터페이스 또는 IrDA(infrared data association) 규격 인터 페이스를 포함할 수 있다. 상기 오디오 모듈 1480은 소리(sound)와 전기 신호를 쌍방향으로 변환시킬 수 있다. 상기 오디오 모듈 1480의 적어도 일부 구성 요소는, 예를 들면, 도 1 에 도시된 입출력 인터페이스 140에 포함될 수 있다. 상기 오디오 모듈 1480은, 예를 들면, 스피커 1482, 리시버 1484, 이어폰 1486 또는 마이크 1488 등을 통해 입력 또는 출력 되는 소리 정보를 처리할 수 있다. 상기 카메라 모듈 1491은 정지 영상 및 동영상을 촬영할 수 있는 장치로서, 한 실시예에 따르면, 하나 이상의 이미지 센서(예: 전면 센서 또는 후면 센서), 렌즈(미도시), ISP(image signal processor, 미도시) 또는 플래 쉬(flash, 미도시)(예: LED 또는 xenon lamp)를 포함할 수 있다. 상기 전력 관리 모듈 1495는 상기 전자 장치 1401의 전력을 관리할 수 있다. 도시하지는 않았으나, 상기 전력 관리 모듈 1495는, 예를 들면, PMIC(power management integrated circuit), 충전 IC(charger integrated circuit) 또는 배터리 또는 연료게이지(battery or fuel gauge)를 포함할 수 있다. 상기 PMIC는, 예를 들면, 집적회로 또는 SoC 반도체 내에 탑재될 수 있다. 충전 방식은 유선과 무선으로 구분 될 수 있다. 상기 충전 IC는 배터리를 충전시킬 수 있으며, 충전기로부터의 과전압 또는 과전류 유입을 방지할 수 있다. 한 실시예에 따르면, 상기 충전 IC는 유선 충전 방식 또는 무선 충전 방식 중 적어도 하나를 위한 충 전 IC를 포함할 수 있다. 무선 충전 방식으로는, 예를 들면, 자기공명 방식, 자기유도 방식 또는 전자기파 방 식 등이 있으며, 무선 충전을 위한 부가적인 회로, 예를 들면, 코일 루프, 공진 회로 또는 정류기 등의 회로가 추가될 수 있다. 상기 배터리 게이지는, 예를 들면, 상기 배터리 1496의 잔량, 충전 중 전압, 전류 또는 온도를 측정할 수 있다. 상기 배터리 1496은 전기를 저장 또는 생성할 수 있고, 그 저장 또는 생성된 전기를 이용하여 상기 전자 장치 1401에 전원을 공급할 수 있다. 상기 배터리 1496은, 예를 들면, 충전식전지(rechargeable battery) 또는 태 양전지(solar battery)를 포함할 수 있다. 상기 인디케이터 1497은 상기 전자 장치 1401 혹은 그 일부(예: 상기 AP 1410)의 특정 상태, 예를 들면, 부팅 상태, 메시지 상태 또는 충전 상태 등을 표시할 수 있다. 상기 모터 1498은 전기적 신호를 기계적 진동으로 변 환할 수 있다. 도시되지는 않았으나, 상기 전자 장치 1401은 모바일 TV 지원을 위한 처리 장치(예: GPU)를 포함 할 수 있다. 상기 모바일 TV 지원을 위한 처리 장치는, 예를 들면, DMB(digital multimedia broadcasting), DVB(digital video broadcasting) 또는 미디어플로우(media flow) 등의 규격에 따른 미디어 데이터를 처리할 수 있다. 본 발명의 다양한 실시예에 따른 전자 장치의 전술한 구성 요소들 각각은 하나 또는 그 이상의 부품(componen t)으로 구성될 수 있으며, 해당 구성 요소의 명칭은 전자 장치의 종류에 따라서 달라질 수 있다. 본 발명의 다 양한 실시예에 따른 전자 장치는 전술한 구성 요소 중 적어도 하나를 포함하여 구성될 수 있으며, 일부 구성 요 소가 생략되거나 또는 추가적인 다른 구성 요소를 더 포함할 수 있다. 또한, 본 발명의 다양한 실시예에 따른 전자 장치의 구성 요소들 중 일부가 결합되어 하나의 개체(entity)로 구성됨으로써, 결합되기 이전의 해당 구성 요소들의 기능을 동일하게 수행할 수 있다. 본 발명의 다양한 실시예에 사용된 용어 \"모듈\"은, 예를 들어, 하드웨어, 소프트웨어 또는 펌웨어(firmware) 중 하나 또는 둘 이상의 조합을 포함하는 단위(unit)를 의미할 수 있다. \"모듈\"은 예를 들어, 유닛(unit), 로직 (logic), 논리블록(logical block), 부품(component) 또는 회로(circuit) 등의 용어와 바꾸어 사용 (interchangeably use)될 수 있다. \"모듈\"은, 일체로 구성된 부품의 최소 단위 또는 그 일부가 될 수 있다. \" 모듈\"은 하나 또는 그 이상의 기능을 수행하는 최소 단위 또는 그 일부가 될 수도 있다. \"모듈\"은 기계적으로 또는 전자적으로 구현될 수 있다. 예를 들면, 본 발명의 다양한 실시예에 따른 \"모듈\"은, 알려졌거나 앞으로 개발될, 어떤 동작들을 수행하는 ASIC(application-specific integrated circuit) 칩, FPGAs(field- programmable gate arrays) 또는 프로그램 가능 논리 장치(programmable-logic device) 중 적어도 하나를 포함 할 수 있다. 다양한 실시예에 따르면, 본 발명의 다양한 실시예에 따른 장치(예: 모듈들 또는 그 기능들) 또는 방법(예: 동 작들)의 적어도 일부는, 예컨대, 프로그래밍 모듈의 형태로 컴퓨터로 읽을 수 있는 저장매체(computer-readable storage media)에 저장된 명령어로 구현될 수 있다. 상기 명령어는, 하나 이상의 프로세서 (예: 상기 프로세서 1410)에 의해 실행될 경우, 상기 하나 이상의 프로세서가 상기 명령어에 해당하는 기능을 수행할 수 있다. 컴 퓨터로 읽을 수 있는 저장 매체는, 예를 들면, 상기 메모리 1430이 될 수 있다. 상기 프로그래밍 모듈의 적어 도 일부는, 예를 들면, 상기 프로세서 210에 의해 구현(implement)(예: 실행)될 수 있다. 상기 프로그래밍 모 듈의 적어도 일부는 하나 이상의 기능을 수행하기 위한, 예를 들면, 모듈, 프로그램, 루틴, 명령어 세트 (sets of instructions) 또는 프로세스 등을 포함할 수 있다. 상기 컴퓨터로 판독 가능한 기록 매체에는 하드디스크, 플로피디스크 및 자기 테이프와 같은 마그네틱 매체 (Magnetic Media)와, CD-ROM(Compact Disc Read Only Memory), DVD(Digital Versatile Disc)와 같은 광기록매 체(Optical Media)와, 플롭티컬 디스크(Floptical Disk)와 같은 자기-광 매체(Magneto-Optical Media)와, 그리 고 ROM(Read Only Memory), RAM(Random Access Memory), 플래시 메모리 등과 같은 프로그램명령(예: 프로그래 밍모듈)을 저장하고 수행하도록 특별히 구성된 하드웨어장치가 포함될 수 있다. 또한, 프로그램 명령에는 컴파 일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함할 수 있다. 상술한 하드웨어 장치는 본 발명의 다양한 실시예의 동작을 수행하 기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지다. 본 발명의 다양한 실시예에 따른 모듈 또는 프로그래밍 모듈은 전술한 구성 요소들 중 적어도 하나 이상을 포함 하거나, 일부가 생략되거나, 또는 추가적인 다른 구성 요소를 더 포함할 수 있다. 본 발명의 다양한 실시예에 따른 모듈, 프로그래밍 모듈 또는 다른 구성 요소에 의해 수행되는 동작들은 순차적, 병렬적, 반복적 또는 휴리 스틱(heuristic)한 방법으로 실행될 수 있다. 또한, 일부 동작은 다른 순서로 실행되거나, 생략되거나, 또는 다른 동작이 추가될 수 있다. 그리고 본 명세서와 도면에 개시된 본 발명의 실시예들은 본 발명의 실시예에 따른 기술 내용을 쉽게 설명하고 본 발명의 실시예의 이해를 돕기 위해 특정 예를 제시한 것일 뿐이며, 본 발명의 실시예의 범위를 한정하고자 하는 것은 아니다. 따라서 본 발명의 다양한 실시예의 범위는 여기에 개시된 실시예들 이외에도 본 발명의 다 양한 실시예의 기술적 사상을 바탕으로 도출되는 모든 변경 또는 변형된 형태가 본 발명의 다양한 실시예의 범 위에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2014-0114567", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 다양한 실시예에 따른 전자 장치를 포함하는 네트워크 환경을 도시한 도면이다. 도 2a는 본 발명의 다양한 실시예에 따른 금속 베젤이 적용된 전자 장치의 사시도이다. 도 2b는 본 발명의 다양한 실시예에 따른 전자 장치의 요부 평면도이다. 도 3a는 본 발명의 다양한 실시예에 따른 금속 베젤에 비금속 부재가 인서트 사출된 상태를 도시한 도면이다. 도 3b는 본 발명의 다양한 실시예에 따른 금속 베젤에 비금속 부재가 인서트 사출된 상태를 도시한 요부 구성도 이다. 도 4a 및 도 4b는 본 발명의 다양한 실시예에 따른 도 3b의 A 부분의 요부 구성 및 단면을 도시한 도면이다.도 5a 내지 도 5c는 본 발명의 다양한 실시예에 따른 도 3b의 B, C 및 D의 방향에서 바라본 요부 단면도이다. 도 6a는 본 발명의 다양한 실시예에 따른 금속 베젤에 비금속 부재가 인서트 사출된 상태를 도시한 도면이다. 도 6b는 본 발명의 다양한 실시예에 따른 금속 베젤에 비금속 부재가 인서트 사출 후 외면이 도장된 상태를 도 시한 요부 사시도이다. 도 6c는 본 발명의 다양한 실시예에 따른 챔퍼면에 부식 방지를 위한 표면 처리층이 형성된 상태를 도시한 요부 단면도이다. 도 7a 및 도 7b는 본 발명의 다양한 실시예에 따른 도 6a의 F 방향에서 바라본 단면도이다. 도 8은 본 발명의 다양한 실시예에 따른 전자 장치의 금속 베젤(예: 하우징)을 제조하기 위한 공정도이다. 도 9a 내지 도 9c는 본 발명의 다양한 실시예에 따른 도 8의 금속 베젤의 제조 공정에 따른 과정을 도시한 구성 도이다. 도 10a 내지 도 10e는 본 발명의 다양한 실시예에 따른 도 9a의 G 부분에 대하여 비금속 부재가 금속 베젤과 인 서트 사출 후 평탄화 공정 및 도장 공정을 도시한 모식도이다. 도 11a 및 도 11b는 본 발명의 다양한 실시예에 따른 전자 장치의 이어잭 홀 부근의 챔퍼(chamfer) 및 가공 경 로를 도시한 도면이다. 도 12a는 본 발명의 다양한 실시예에 따른 비금속으로 이루어진 보조 하우징이 금속 베젤에 조립되어 있는 구성 도이다. 도 12b는 본 발명의 다양한 실시예에 따른 도 12의 금속 베젤에 적용되는 보조 하우징(예: 브라켓) 및 기판의 구성도이다. 도 13은 본 발명의 다양한 실시예에 따른 인터페이스 컨넥터 포트가 금속 베젤에 적용되는 상태를 도시한 요부 단면도이다. 도 14는 본 발명의 다양한 실시예에 따른 전자 장치의 블록 구성도이다."}
