{"patent_id": "10-2022-0089973", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0012673", "출원번호": "10-2022-0089973", "발명의 명칭": "전통목조건축물의 래스터 이미지를 캐드 전자 도면으로 변환하는 시스템 및 방법", "출원인": "(주)인텔리코리아", "발명자": "박승훈"}}
{"patent_id": "10-2022-0089973", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전통목조건축물의 스캔 이미지를 분할하고, 다수의 분할 이미지에 대한 이미지 프로세싱을 각각 수행하여 상기분할 이미지 각각에 포함된 부재 객체를 인식하고, 상기 부재 객체가 인식된 다수의 분할 이미지를 병합한 후파일 교환이 가능한 포맷으로 변환하는 전처리부; 및상기 전처리부를 통해 변환된 이미지 파일의 부재 객체에 대한 좌표 변환을 수행하여 벡터 데이터를 생성하는후처리부를 포함하는 것을 특징으로 하는 전통목조건축물의 래스터 이미지를 캐드 전자 도면으로 변환하는 시스템."}
{"patent_id": "10-2022-0089973", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 전처리부는,상기 스캔 이미지에 대하여 서로 다른 개수로 각각 분할하여 다수의 분할 이미지를 각각 생성하는 분할 이미지생성부;상기 분할 이미지 생성부를 통해 생성된 상기 분할 이미지 각각에 대한 해상도 및 색 표현 방식을 통일하는 데이터 전처리를 수행하는 데이터 전처리 수행부; 전통목조건축물의 각 부재를 구성하는 부재 객체의 인식에 대하여 미리 학습된 인공지능 알고리즘을 기반으로,상기 데이터 전처리 수행부를 통해 데이터 전처리가 완료된 분할 이미지 각각에 대하여 미리 설정된 배수만큼확대한 후 이미지 프로세싱을 수행하여 상기 부재 객체를 인식하는 부재 객체 인식부;상기 부재 객체 인식부를 통해 상기 부재 객체가 인식된 다수의 분할 이미지를 상기 스캔 이미지와 동일한 크기를 갖도록 크기를 축소한 후 병합하는 분할 이미지 병합부; 및상기 분할 이미지 병합부를 통해 생성된 이미지 파일을 DXF 파일로 변환하는 이미지 파일 변환부를 포함하는 것을 특징으로 하는 전통목조건축물의 래스터 이미지를 캐드 전자 도면으로 변환하는 시스템."}
{"patent_id": "10-2022-0089973", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서,상기 부재 객체 인식부는,다수의 분할 이미지가 NxN 분할 이미지를 갖는 제1 분할 이미지와 MxM(M>N인 자연수) 분할 이미지를 갖는 제2분할 이미지로 구성되는 경우, 이미지 분할 경계선 및 분할된 이미지의 크기로 인해 상기 분할 이미지에서 인식되지 않은 객체가 인식되도록 상기 제1 분할 이미지와 상기 제2 분할 이미지 간의 미인식 객체를 상호 보완적으로 탐색하여 상기 부재 객체를 인식하는 것을 특징으로 하는 전통목조건축물의 래스터 이미지를 캐드 전자 도면으로 변환하는 시스템."}
{"patent_id": "10-2022-0089973", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2 항에 있어서,상기 부재 객체 인식부는,다수의 분할 이미지가 NxN 분할 이미지를 갖는 제1 분할 이미지와 MxM(M>N인 자연수) 분할 이미지를 갖는 제2공개특허 10-2024-0012673-3-분할 이미지로 구성되는 경우, 상기 제1 분할 이미지에서 인식되지 않은 제1 미인식 객체에 대한 데이터들을 취합하고, 취합된 제1 미인식 객체 데이터를 생성하고, 상기 MxM 분할 이미지에서 탐색하여 상기 부재 객체를 인식하고, 상기 제2 분할 이미지에서 인식되지 않은 제2 미인식 객체에 대한 데이터들을 취합하고, 취합된 제2 미인식 객체 데이터를 생성하고, 상기 NxN 분할 이미지에서 탐색하여 상기 부재 객체를 인식하는 것을 특징으로하는 전통목조건축물의 래스터 이미지를 캐드 전자 도면으로 변환하는 시스템."}
{"patent_id": "10-2022-0089973", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2 항에 있어서,상기 전처리부는,상기 스캔 이미지에서 텍스트 객체를 추출하여 텍스트 객체 데이터를 생성하는 텍스트 객체 추출부를 더 포함하는 것을 특징으로 하는 전통목조건축물의 래스터 이미지를 캐드 전자 도면으로 변환하는 시스템."}
{"patent_id": "10-2022-0089973", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5 항에 있어서,상기 후처리부는,텍스트 인식에 대하여 미리 학습된 인공지능 알고리즘을 기반으로 상기 텍스트 객체 데이터에 포함된 텍스트 객체를 인식하여 텍스트 데이터를 생성하는 텍스트 데이터 생성부; 및상기 DXF 파일에 상기 텍스트 데이터를 추가하고, 상기 텍스트 데이터가 추가된 DXF 파일의 부재 객체에 대한좌표 변환을 수행하여 벡터 데이터를 생성하는 캐드 파일 생성부를 포함하는 것을 특징으로 하는 전통목조건축물의 래스터 이미지를 캐드 전자 도면으로 변환하는 시스템."}
{"patent_id": "10-2022-0089973", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "전처리부가, 전통목조건축물의 스캔 이미지를 분할하고, 다수의 분할 이미지에 대한 이미지 프로세싱을 각각 수행하여 상기 분할 이미지 각각에 포함된 부재 객체를 인식하고, 상기 부재 객체가 인식된 다수의 분할 이미지를병합한 후 파일 교환이 가능한 포맷으로 변환하는 전처리 단계; 및후처리부가, 상기 전처리 단계를 통해 변환된 이미지 파일의 부재 객체에 대한 좌표 변환을 수행하여 벡터 데이터를 생성하는 후처리 단계를 포함하는 것을 특징으로 하는 전통목조건축물의 래스터 이미지를 캐드 전자 도면으로 변환하는 방법."}
{"patent_id": "10-2022-0089973", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7 항에 있어서,상기 전처리 단계는,상기 스캔 이미지에 대하여 서로 다른 개수로 각각 분할하여 다수의 분할 이미지를 각각 생성하는 분할 이미지생성 단계;상기 분할 이미지 생성 단계를 통해 생성된 상기 분할 이미지 각각에 대한 해상도 및 색 표현 방식을 통일하는데이터 전처리를 수행하는 데이터 전처리 수행 단계; 전통목조건축물의 각 부재를 구성하는 부재 객체의 인식에 대하여 미리 학습된 인공지능 알고리즘을 기반으로,상기 데이터 전처리 수행 단계를 통해 데이터 전처리가 완료된 분할 이미지 각각에 대하여 미리 설정된 배수만큼 확대한 후 이미지 프로세싱을 수행하여 상기 부재 객체를 인식하는 부재 객체 인식 단계;상기 부재 객체 인식 단계를 통해 상기 부재 객체가 인식된 다수의 분할 이미지를 상기 스캔 이미지와 동일한공개특허 10-2024-0012673-4-크기를 갖도록 크기를 축소한 후 병합하는 분할 이미지 병합 단계; 및상기 분할 이미지 병합 단계를 통해 생성된 이미지 파일을 DXF 파일로 변환하는 이미지 파일 변환 단계를 포함하는 것을 특징으로 하는 전통목조건축물의 래스터 이미지를 캐드 전자 도면으로 변환하는 방법."}
{"patent_id": "10-2022-0089973", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8 항에 있어서,상기 부재 객체 인식 단계는,다수의 분할 이미지가 NxN 분할 이미지를 갖는 제1 분할 이미지와 MxM(M>N인 자연수) 분할 이미지를 갖는 제2분할 이미지로 구성되는 경우, 이미지 분할 경계선 및 분할된 이미지의 크기로 인해 상기 분할 이미지에서 인식되지 않은 객체가 인식되도록 상기 제1 분할 이미지와 상기 제2 분할 이미지 간의 미인식 객체를 상호 보완적으로 탐색하여 상기 부재 객체를 인식하는 것을 특징으로 하는 전통목조건축물의 래스터 이미지를 캐드 전자 도면으로 변환하는 방법."}
{"patent_id": "10-2022-0089973", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8 항에 있어서,상기 부재 객체 인식 단계는,다수의 분할 이미지가 NxN 분할 이미지를 갖는 제1 분할 이미지와 MxM(M>N인 자연수) 분할 이미지를 갖는 제2분할 이미지로 구성되는 경우, 상기 제1 분할 이미지에서 인식되지 않은 제1 미인식 객체에 대한 데이터들을 취합하고, 취합된 제1 미인식 객체 데이터를 생성하고, 상기 MxM 분할 이미지에서 탐색하여 상기 부재 객체를 인식하고, 상기 제2 분할 이미지에서 인식되지 않은 제2 미인식 객체에 대한 데이터들을 취합하고, 취합된 제2 미인식 객체 데이터를 생성하고, 상기 NxN 분할 이미지에서 탐색하여 상기 부재 객체를 인식하는 것을 특징으로하는 전통목조건축물의 래스터 이미지를 캐드 전자 도면으로 변환하는 방법."}
{"patent_id": "10-2022-0089973", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제8 항에 있어서,상기 전처리 단계는,상기 스캔 이미지에서 텍스트 객체를 추출하여 텍스트 객체 데이터를 생성하는 텍스트 객체 추출 단계를 더 포함하는 것을 특징으로 하는 전통목조건축물의 래스터 이미지를 캐드 전자 도면으로 변환하는 방법."}
{"patent_id": "10-2022-0089973", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11 항에 있어서,상기 후처리 단계는,텍스트 인식에 대하여 미리 학습된 인공지능 알고리즘을 기반으로 상기 텍스트 객체 데이터에 포함된 텍스트 객체를 인식하여 텍스트 데이터를 생성하는 텍스트 데이터 생성 단계; 및상기 DXF 파일에 상기 텍스트 데이터를 추가하고, 상기 텍스트 데이터가 추가된 DXF 파일의 부재 객체에 대한좌표 변환을 수행하여 벡터 데이터를 생성하는 캐드 파일 생성 단계를 포함하는 것을 특징으로 하는 전통목조건축물의 래스터 이미지를 캐드 전자 도면으로 변환하는 방법."}
{"patent_id": "10-2022-0089973", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 전통목조건축물의 래스터 이미지를 캐드 전자 도면으로 변환하는 시스템 및 방법에 관한 것으로, 해결 하고자 하는 과제는 전통 목조 문화재 건축물에 특성화되고 전문화된 프로세서를 통해 우리 고유의 목조 문화재 건축물에 대한 손 도면 이미지를 빠르고 정확하게 캐드 전자 도면으로 변환하는데 있다. 일례로, 전통목조건축물의 스캔 이미지를 분할하고, 다수의 분할 이미지에 대한 이미지 프로세싱을 각각 수행하 여 상기 분할 이미지 각각에 포함된 부재 객체를 인식하고, 상기 부재 객체가 인식된 다수의 분할 이미지를 병합 한 후 파일 교환이 가능한 포맷으로 변환하는 전처리부; 및 상기 전처리부를 통해 변환된 이미지 파일의 부재 객 체에 대한 좌표 변환을 수행하여 벡터 데이터를 생성하는 후처리부를 포함하는 전통목조건축물의 래스터 이미지 를 캐드 전자 도면으로 변환하는 시스템을 개시한다."}
{"patent_id": "10-2022-0089973", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 실시예는 전통목조건축물의 래스터 이미지를 캐드 전자 도면으로 변환하는 시스템 및 방법에 관한 것 이다."}
{"patent_id": "10-2022-0089973", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로, 전통 목조 건축 문화재에 대한 래스터 이미지 자료(Raster Image Data)는 수정이 어렵고, 이미지 자료 내에서 목조 부재의 검색과 명칭을 전산화 데이터로 활용할 수 없는 문제점이 있다. 이에 따라, 해당 건축 문화재에 대한 보수가 필요할 경우 기존의 손 도면을 활용해야 하기 때문에, 해당 건축 문화재에 대한 개보수 작업이 원활하게 이루어질 수 없다. 현재, 기존 래스터 이미지 자료에 대한 벡터 변환 작업은 국내외에서 상용화되어 있는 프로그램만을 이용한 범 용적인 벡터화 작업만을 할 수 있기 때문에, 전통 목조 문화재 건축물에 대한 정확한 전자 도면화가 쉽지 않은 실정이다. 선행기술문헌 특허문헌 (특허문헌 0001) 등록특허공보 제10-1869302호(등록일자: 2018년06월14일) (특허문헌 0002) 등록특허공보 제10-1015765호(등록일자: 2011년02월10일)"}
{"patent_id": "10-2022-0089973", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 실시예는, 전통 목조 문화재 건축물에 특성화되고 전문화된 프로세서를 통해 우리 고유의 목조 문화 재 건축물에 대한 손 도면 이미지를 빠르고 정확하게 캐드 전자 도면으로 변환할 수 있는 전통목조건축물의 래 스터 이미지를 캐드 전자 도면으로 변환하는 시스템 및 방법을 제공한다."}
{"patent_id": "10-2022-0089973", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시예에 따른 전통목조건축물의 래스터 이미지를 캐드 전자 도면으로 변환하는 시스템은, 전통목조 건축물의 스캔 이미지를 분할하고, 다수의 분할 이미지에 대한 이미지 프로세싱을 각각 수행하여 상기 분할 이 미지 각각에 포함된 부재 객체를 인식하고, 상기 부재 객체가 인식된 다수의 분할 이미지를 병합한 후 파일 교 환이 가능한 포맷으로 변환하는 전처리부; 및 상기 전처리부를 통해 변환된 이미지 파일의 부재 객체에 대한 좌 표 변환을 수행하여 벡터 데이터를 생성하는 후처리부를 포함한다. 또한, 상기 전처리부는, 상기 스캔 이미지에 대하여 서로 다른 개수로 각각 분할하여 다수의 분할 이미지를 각 각 생성하는 분할 이미지 생성부; 상기 분할 이미지 생성부를 통해 생성된 상기 분할 이미지 각각에 대한 해상 도 및 색 표현 방식을 통일하는 데이터 전처리를 수행하는 데이터 전처리 수행부; 전통목조건축물의 각 부재를 구성하는 부재 객체의 인식에 대하여 미리 학습된 인공지능 알고리즘을 기반으로, 상기 데이터 전처리 수행부를 통해 데이터 전처리가 완료된 분할 이미지 각각에 대하여 미리 설정된 배수만큼 확대한 후 이미지 프로세싱을 수행하여 상기 부재 객체를 인식하는 부재 객체 인식부; 상기 부재 객체 인식부를 통해 상기 부재 객체가 인식 된 다수의 분할 이미지를 상기 스캔 이미지와 동일한 크기를 갖도록 크기를 축소한 후 병합하는 분할 이미지 병 합부; 및 상기 분할 이미지 병합부를 통해 생성된 이미지 파일을 DXF 파일로 변환하는 이미지 파일 변환부를 포 함할 수 있다. 또한, 상기 부재 객체 인식부는, 다수의 분할 이미지가 NxN 분할 이미지를 갖는 제1 분할 이미지와 MxM(M>N인 자연수) 분할 이미지를 갖는 제2 분할 이미지로 구성되는 경우, 이미지 분할 경계선 및 분할된 이미지의 크기로 인해 상기 분할 이미지에서 인식되지 않은 객체가 인식되도록 상기 제1 분할 이미지와 상기 제2 분할 이미지 간 의 미인식 객체를 상호 보완적으로 탐색하여 상기 부재 객체를 인식할 수 있다. 또한, 상기 부재 객체 인식부는, 다수의 분할 이미지가 NxN 분할 이미지를 갖는 제1 분할 이미지와 MxM(M>N인 자연수) 분할 이미지를 갖는 제2 분할 이미지로 구성되는 경우, 상기 제1 분할 이미지에서 인식되지 않은 제1 미인식 객체에 대한 데이터들을 취합하고, 취합된 제1 미인식 객체 데이터를 생성하고, 상기 MxM 분할 이미지에 서 탐색하여 상기 부재 객체를 인식하고, 상기 제2 분할 이미지에서 인식되지 않은 제2 미인식 객체에 대한 데 이터들을 취합하고, 취합된 제2 미인식 객체 데이터를 생성하고, 상기 NxN 분할 이미지에서 탐색하여 상기 부재 객체를 인식할 수 있다. 또한, 상기 전처리부는, 상기 스캔 이미지에서 텍스트 객체를 추출하여 텍스트 객체 데이터를 생성하는 텍스트 객체 추출부를 더 포함할 수 있다. 또한, 상기 후처리부는, 텍스트 인식에 대하여 미리 학습된 인공지능 알고리즘을 기반으로 상기 텍스트 객체 데 이터에 포함된 텍스트 객체를 인식하여 텍스트 데이터를 생성하는 텍스트 데이터 생성부; 및 상기 DXF 파일에 상기 텍스트 데이터를 추가하고, 상기 텍스트 데이터가 추가된 DXF 파일의 부재 객체에 대한 좌표 변환을 수행 하여 벡터 데이터를 생성하는 캐드 파일 생성부를 포함할 수 있다. 본 발명의 다른 실시예에 따른 전통목조건축물의 래스터 이미지를 캐드 전자 도면으로 변환하는 방법은, 전처리 부가, 전통목조건축물의 스캔 이미지를 분할하고, 다수의 분할 이미지에 대한 이미지 프로세싱을 각각 수행하여 상기 분할 이미지 각각에 포함된 부재 객체를 인식하고, 상기 부재 객체가 인식된 다수의 분할 이미지를 병합한 후 파일 교환이 가능한 포맷으로 변환하는 전처리 단계; 및 후처리부가, 상기 전처리 단계를 통해 변환된 이미 지 파일의 부재 객체에 대한 좌표 변환을 수행하여 벡터 데이터를 생성하는 후처리 단계를 포함한다. 또한, 상기 전처리 단계는, 상기 스캔 이미지에 대하여 서로 다른 개수로 각각 분할하여 다수의 분할 이미지를 각각 생성하는 분할 이미지 생성 단계; 상기 분할 이미지 생성 단계를 통해 생성된 상기 분할 이미지 각각에 대 한 해상도 및 색 표현 방식을 통일하는 데이터 전처리를 수행하는 데이터 전처리 수행 단계; 전통목조건축물의 각 부재를 구성하는 부재 객체의 인식에 대하여 미리 학습된 인공지능 알고리즘을 기반으로, 상기 데이터 전처 리 수행 단계를 통해 데이터 전처리가 완료된 분할 이미지 각각에 대하여 미리 설정된 배수만큼 확대한 후 이미 지 프로세싱을 수행하여 상기 부재 객체를 인식하는 부재 객체 인식 단계; 상기 부재 객체 인식 단계를 통해 상 기 부재 객체가 인식된 다수의 분할 이미지를 상기 스캔 이미지와 동일한 크기를 갖도록 크기를 축소한 후 병합 하는 분할 이미지 병합 단계; 및 상기 분할 이미지 병합 단계를 통해 생성된 이미지 파일을 DXF 파일로 변환하 는 이미지 파일 변환 단계를 포함할 수 있다. 또한, 상기 부재 객체 인식 단계는, 다수의 분할 이미지가 NxN 분할 이미지를 갖는 제1 분할 이미지와 MxM(M>N 인 자연수) 분할 이미지를 갖는 제2 분할 이미지로 구성되는 경우, 이미지 분할 경계선 및 분할된 이미지의 크 기로 인해 상기 분할 이미지에서 인식되지 않은 객체가 인식되도록 상기 제1 분할 이미지와 상기 제2 분할 이미 지 간의 미인식 객체를 상호 보완적으로 탐색하여 상기 부재 객체를 인식할 수 있다. 또한, 상기 부재 객체 인식 단계는, 다수의 분할 이미지가 NxN 분할 이미지를 갖는 제1 분할 이미지와 MxM(M>N 인 자연수) 분할 이미지를 갖는 제2 분할 이미지로 구성되는 경우, 상기 제1 분할 이미지에서 인식되지 않은 제 1 미인식 객체에 대한 데이터들을 취합하고, 취합된 제1 미인식 객체 데이터를 생성하고, 상기 MxM 분할 이미지 에서 탐색하여 상기 부재 객체를 인식하고, 상기 제2 분할 이미지에서 인식되지 않은 제2 미인식 객체에 대한 데이터들을 취합하고, 취합된 제2 미인식 객체 데이터를 생성하고, 상기 NxN 분할 이미지에서 탐색하여 상기 부 재 객체를 인식할 수 있다. 또한, 상기 전처리 단계는, 상기 스캔 이미지에서 텍스트 객체를 추출하여 텍스트 객체 데이터를 생성하는 텍스 트 객체 추출 단계를 더 포함할 수 있다. 또한, 상기 후처리 단계는, 텍스트 인식에 대하여 미리 학습된 인공지능 알고리즘을 기반으로 상기 텍스트 객체 데이터에 포함된 텍스트 객체를 인식하여 텍스트 데이터를 생성하는 텍스트 데이터 생성 단계; 및 상기 DXF 파 일에 상기 텍스트 데이터를 추가하고, 상기 텍스트 데이터가 추가된 DXF 파일의 부재 객체에 대한 좌표 변환을 수행하여 벡터 데이터를 생성하는 캐드 파일 생성 단계를 포함할 수 있다."}
{"patent_id": "10-2022-0089973", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 전통 목조 문화재 건축물에 특성화되고 전문화된 프로세서를 통해 우리 고유의 목조 문화재 건축물에 대한 손 도면 이미지를 빠르고 정확하게 캐드 전자 도면으로 변환할 수 있는 전통목조건축물의 래스터 이미지를 캐드 전자 도면으로 변환하는 시스템 및 방법을 제공할 수 있다. 이로 인해, 전자 도면 데이터를 활용하여 전통 목조 건축 문화재에 대한 개보수 작업 및 건축물 이력 데이터로 적극 활용할 수 있고, 전통 목조 건축 문화재를 공부하고 연구하는 집단에게 정확한 문화재 도면 데이터를 제공 할 수 있으며, 손 도면 이미지와 실제 문화재 간의 데이터 오류를 캐드 도면화 된 파일을 이용하여 현실화 작업 을 빠르게 진행할 수 있다."}
{"patent_id": "10-2022-0089973", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에서 사용되는 용어에 대해 간략히 설명하고, 본 발명에 대해 구체적으로 설명하기로 한다. 본 발명에서 사용되는 용어는 본 발명에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수 있 다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 발명의 설명 부분에서 상세 히 그 의미를 기재할 것이다. 따라서 본 발명에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가지 는 의미와 본 발명의 전반에 걸친 내용을 토대로 정의되어야 한다. 명세서 전체에서 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있음을 의미한다. 또한, 명세서에 기재된 \"...부\", \"모듈\" 등의 용어는 적어도 하나 이상의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어 또는 소프트웨어로 구현되거나 하드웨어와 소프트웨어의 병합으로 구현될 수 있다. 아래에서는 첨부한 도면을 참고하여 본 발명의 실시예에 대하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설 명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 도 1은 본 발명의 일 실시예에 따른 전통목조건축물의 래스터 이미지를 캐드 전자 도면으로 변환하는 시스템의 구현 형태 및 동작 방식을 나타낸 개요도이다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 전통목조건축물의 래스터 이미지를 캐드 전자 도면으로 변환하는 시스템은 사용자 통신단말, 운영 서버 및 데이터베이스와, 이들 각각에 설치되어 실행되는 프 로그램 또는 어플리케이션 형태로 구현되어 전통목조건축물의 래스터 이미지(또는 스캔 이미지, 손 도면)를 캐 드 엔진(ex. CADian)을 활용하여 캐드 전자 도면으로 변환하는 알고리즘을 통해 CAD 벡터 파일을 제공할 수 있 다. 상기 사용자 통신단말은, 전통목조건축물의 래스터 이미지를 캐드 전자 도면으로 변환 서비스를 제공하기 위한 전용 프로그램(ex. CADian Client, Web PHM Client)이 설치 또는 탑재되거나 웹 브라우저의 웹 사이트에 접속할 수 있으며, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W- Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말, 스마트폰(smartphone), 스마트 패드(smartpad), 타블렛 PC(Tablet PC) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수 있다. 여기서, 웹 브라우저는 웹(WWW: world wide web) 서비스를 이용할 수 있게 하는 프로그램으로 HTML(hypertext mark-up language)로 서술된 하이퍼텍스트를 받아서 보여주는 프로그램을 의미하며, 예를 들어 넷스케이프 (Netscape), 익스플로러(Explorer), 크롬(chrome) 등을 포함한다. 또한, 애플리케이션은 단말 상의 응용 프로그 램(application)을 의미하며, 예를 들어, 모바일 단말(스마트폰)에서 실행되는 앱(app)을 포함할 수 있다. 상기 운영 서버는, 사용자 통신단말 및 데이터베이스 각각과 연결되어, 사용자 통신단말로부터 전통목조건축물의 래스터 이미지를 입력 받고, 입력된 래스터 이미지로부터 각종 부재 인식 및 인공지능 기반의 한글 인식 프로세싱을 수행하고, 해당 프로세싱 결과물을 기반으로 캐드 전자 도면으로 변환하는 서비스를 제공 하고, 하드웨어적으로 통상적인 웹 서버와 동일한 구성을 가지며, 소프트웨어적으로는 C, C++, Java, Visual Basic, Visual C 등과 같은 다양한 형태의 언어를 통해 구현되어 여러 가지 기능을 하는 프로그램 모듈을 포함 할 수 있다. 또한, 일반적인 서버용 하드웨어에 도스(dos), 윈도우(window), 리눅스(linux), 유닉스(unix), 매 킨토시(macintosh), 안드로이드(Android), 아이오에서(iOS) 등의 운영 체제에 따라 다양하게 제공되고 있는 웹 서버 프로그램을 이용하여 구현될 수 있다. 한편, 사용자 통신단말과 운영 서버 간을 연결하는 인터넷 네트워크의 무선 통신망의 일 예로는, 이동 통신을 위한 기술표준들 또는 통신방식(예를 들어, GSM(Global System for Mobile communication), CDMA(Code Division Multi Access), CDMA2000(Code Division Multi Access 2000), EV-DO(Enhanced Voice-Data Optimized or Enhanced Voice-Data Only), WCDMA(Wideband CDMA), HSDPA(High Speed Downlink Packet Access), HSUPA(High Speed Uplink Packet Access), LTE(Long Term Evolution), LTE-A(Long Term Evolution-Advanced), 5G 등)에 따라 구축된 이동 통신망을 포함할 수 있으나, 특별히 한정하는 것은 아니다. 또한, 유선 통신망의 일 예로는, LAN(Local Area Network), WAN(Wide Area Network)등의 폐쇄형 네트워크일 수 있으며, 인터넷과 같은 개방형 네트워크인 것이 바람직하다. 인터넷은 TCP/IP 프로토콜 및 그 상위계층에 존재하는 여러 서비스, 즉 HTTP(HyperText Transfer Protocol), Telnet, FTP(File Transfer Protocol), DNS(Domain Name System), SMTP(Simple Mail Transfer Protocol), SNMP(Simple Network Management Protocol), NFS(Network File Service), NIS(Network Information Service)를 제공하는 전세계적인 개방형 컴퓨터 네트워크 구조를 의미한다. 상기 데이터베이스는 전통목조건축물의 래스터 이미지를 캐드 전자 도면으로 변환하는 시스템을 통해 생성된 결과물(캐드 전자 도면 파일) 및 해당 결과물을 생성하기 위해 필요한 각종 파일과 자료가 저장되어 있 으며, 지속적으로 업데이트되며 관리될 수 있다. 도 2는 본 발명의 일 실시예에 따른 전통목조건축물의 래스터 이미지를 캐드 전자 도면으로 변환하는 시스템의 동작 알고리즘(TWArchVector Algorism)을 나타낸 순서도이다. 도 2를 참조하면, 본 발명의 일 실시예에 따른 전통목조건축물의 래스터 이미지를 캐드 전자 도면으로 변환하는 시스템의 'TWArchVector Algorism'은 크게 전처리(Pre-Processing)과 후처리(Post Processing) 단계로 구성될 수 있다. 상기 전처리(Pre-Processing)은, 전통목조건축물에 대한 래스터 이미지(또는 스캔 이미지)(jpg, png, bmp 등)를 입력 받고, 입력된 래스터 이미지에 대한 한글 객체 인식 및 이미지 분할(ex. 2x2, 3x3) 과정을 진행할 수 있다. 이때, 래스터 이미지로부터 인식된 한글 객체에 대한 데이터는 후처리 과정을 위해 전달되고, 분할된 이 미지는 이미지 인식 전 처리를 수행하여 래스터 이미지에 대한 해상도 및 색 표현 방식을 통일한다. 이미지 인 식 전 처리가 수행된 2x2 분할 이미지와 3x3 분할 이미지에 대한 부재 객체에 대한 인식 과정을 수행한 후, 부 재 객체가 각각 인식되면 해당 분할 이미지를 원본 이미지의 크기로 다시 병합한다. 이미지가 병합된 데이터는 DXF 파일로 변환된 후 후처리 진행하기 위해 전달될 수 있다. 상기 후처리(Post Processing)은, 전처리 과정으로부터 전달된 한글 데이터와 전통 목조 객체에 대한 데이터를 기반으로 CAD 좌표 변환 과정을 수행한 후 이들을 병합하여 CAD 파일(ex. DWG)을 생성함으로써, 래스터 이미지 에 대한 캐드 전자 도면을 제공할 수 있다. 이하, 첨부된 도면을 참조하여 전통목조건축물의 래스터 이미지를 캐드 전자 도면으로 변환하는 시스템의 구성 에 대하여 좀 더 상세히 설명한다. 도 3은 본 발명의 일 실시예에 따른 전통목조건축물의 래스터 이미지를 캐드 전자 도면으로 변환하는 시스템의 구성을 나타낸 블록도이고, 도 4는 본 발명의 일 실시예에 따른 전처리부의 구성을 나타낸 블록도이고, 도 5 및 도 6은 본 발명의 일 실시예에 따른 부재 객체 인식부에서 부재 객체를 인식하는 방법을 설명하기 위해 예시적 으로 나타낸 도면이며, 도 7는 본 발명의 일 실시예에 따른 후처리부의 구성을 나타낸 블록도이다. 도 3을 참조하면, 본 발명의 일 실시예에 따른 전통목조건축물의 래스터 이미지를 캐드 전자 도면으로 변환하는 시스템은 전처리부 및 후처리부 중 적어도 하나를 포함할 수 있다. 상기 전처리부는, 전통목조건축물의 스캔 이미지를 분할하고, 다수의 분할 이미지에 대한 이미지 프로세싱 을 각각 수행하여 분할 이미지 각각에 포함된 부재 객체를 인식하고, 재 객체가 인식된 다수의 분할 이미지를 병합한 후 파일 교환이 가능한 포맷으로 변환할 수 있다. 이를 위해 전처리부는 도 4에 도시된 바와 같이, 분할 이미지 생성부, 데이터 전처리 수행부, 부재 객체 인식부, 분할 이미지 병합부, 이미지 파일 변환부 및 텍스트 객체 인식부 중 적 어도 하나를 포함할 수 있다. 상기 분할 이미지 생성부는, 전통목조건축물이 그려진 스캔 이미지(또는 래스터 이미지)(BMP, TIFF, PNG, JPG 등)를 입력 받고, 입력된 스캔 이미지(또는 래스터 이미지)에 대하여 서로 다른 개수로 각각 분할하여 다수 의 분할 이미지를 각각 생성할 수 있다. 예를 들어, 스캔 이미지(또는 래스터 이미지)를 2x2로 분할한 제1 분할 이미지와 3x3으로 분할한 제2 분할 이미 지를 각각 생성할 수 있으나, 이는 발명의 이해를 돕기 위한 일례일 뿐이며 본 실시예에서는 이와 같은 형태로 만 분할 이미지를 생성하는 것이 아니라, 4x4, 5x5, 6x6 등 더 많은 개수로 더 많은 분할 이미지를 생성하여 실 시할 수 있음이 당연하다. 상기 데이터 전처리 수행부는, 분할 이미지 생성부를 통해 생성된 분할 이미지(제1 분할 이미지 (2x2), 제2 분할 이미지(3x3)) 각각에 대한 해상도 및 색 표현 방식을 통일하는 데이터 전처리를 수행할 수 있 다. 이러한 데이터 전처리 과정은 분할 이미지들을 모두 같은 크기를 갖는 이미지로 통일하기 위한 과정으로, 가로, 세로 픽셀 사이즈를 표현하는 해상도를 통일하고, 색을 표현하는 방식을 통일(RGB, HSV, Gray-scale, Binary 등)할 수 있다. 물론, 스캔 이미지 생성부에서 스캔 이미지(래스터 이미지)를 균등 분할함에 따라 데이터 전처리 과정을 생략할 수 있으나, 보다 정확한 객체 인식 및 검출을 위해 분할된 이미지들에 대한 데이 터 전처리 과정이 수행되는 것이 바람직하다. 상기 부재 객체 인식부는, 전통목조건축물의 각 부재를 구성하는 부재 객체 단위의 인식에 대하여 미리 학 습된 인공지능 알고리즘을 기반으로, 데이터 전처리 수행부를 통해 데이터 전처리가 완료된 분할 이미지 각각에 대하여 미리 설정된 배수만큼 확대(예를 들어 4배로 확대)한 후, 객체 인식을 위한 이미지 프로세싱을 수행하여 미리 학습된 부재 객체를 인식할 수 있다(데이터 전처리 과정 생략 시 분할 이미지 생성부를 통 해 생성된 분할 이미지 별로 이미지 프로세싱을 수행함). 본 실시예에서 미리 학습된 부재 객체 단위는 살미, 첨자, 주두, 소로, 초각, 치수, 주석 등으로 전통목조건축 물을 구성하는 기본적인 요소를 포함할 수 있다. 인공지능 알고리즘은 이와 같이 전통목조건축물의 기본적인 객 체 단위인 살미, 첨자, 주두, 소로, 초각, 치수, 주석 등의 형태, 모양, 구조 등에 관한 이미지 데이터와 그에 대한 라벨 데이터를 학습데이터로 이용하여 학습한 딥러닝 알고리즘을 바탕으로 분할 이미지로부터 부재 객체 단위를 각각 인식할 수 있다. 상기 부재 객체 인식부는, 다수의 분할 이미지가 NxN 분할 이미지를 갖는 제1 분할 이미지와 MxM(M>N인 자 연수) 분할 이미지를 갖는 제2 분할 이미지로 구성되는 경우, 이미지 분할 경계선 및 분할된 이미지의 크기로 인해 분할 이미지에서 인식되지 않은 객체가 인식될 수 있도록 제1 분할 이미지와 제2 분할 이미지 간의 미인식 객체를 상호 보완적으로 탐색하여 부재 객체를 인식할 수 있다. 좀 더 구체적으로 부재 객체 인식부는, 다수의 분할 이미지가 NxN 분할 이미지를 갖는 제1 분할 이미지와 MxM(M>N인 자연수) 분할 이미지를 갖는 제2 분할 이미지로 구성되는 경우, 제1 분할 이미지에서 인식되지 않은제1 미인식 객체에 대한 데이터들을 취합하고, 취합된 제1 미인식 객체 데이터를 생성하고, MxM 분할 이미지에 서 탐색하여 부재 객체를 인식하고, 제2 분할 이미지에서 인식되지 않은 제2 미인식 객체에 대한 데이터들을 취 합하고, 취합된 제2 미인식 객체 데이터를 생성하고, NxN 분할 이미지에서 탐색하여 부재 객체를 인식할 수 있 다. 예를 들어, 분할 이미지 생성부에서 도 5에 도시된 바와 같이 2x2로 분할된 제1 분할 이미지와 도 6에 도 시된 바와 같은 3x3로 분할된 제2 분할 이미지가 있다고 가정할 경우, 제1 분할 이미지(2x2) 중 ①, ②번 분할 이미지의 분할 경계선에 의해 객체 M1이 인식되지 못하는 경우, 해당 미인식 대상 요소를 제1 미인식 객체로 정 의한 후, 정의된 제1 미인식 객체들을 취합하여 제1 미인식 객체 데이터를 생성할 수 있다. 이러한 제1 미인식 객체 데이터에는 미리 학습된 데이터는 정의되지 않은 요소들에 대한 형태, 구조, 모양 등에 대한 데이터를 포 함할 수 있다. 이후 제2 분할 이미지(3x3)에서 제1 미인식 객체 데이터를 기반으로 탐색 과정을 수행하여 이전 에 인식되지 않았던 새로운 부재 객체를 인식할 수 있다. 즉, 도 5에 도시된 제1 분할 이미지에서는 ①, ②번 분할 이미지의 분할 경계선에 의해 객체 M1이 잘려지게 되어 객체 M1에 대한 인식이 불가하였으나, ①, ②번 분 할 이미지에서 잘려진 요소들을 취합하고, 이들을 조합 또는 결합한 형태가 도 6에 도시된 제2 분할 이미지 (3x3)에서 연결 객체로서 존재하는지 탐색하는 과정을 통해 ⑤번 분할 이미지 상에서 객체 M1이 인식될 수 있다. 또한, 이와는 반대로 제2 분할 이미지가 제1 분할 이미지보다 분할 섹터가 많기 때문에 하나의 이미지에 상대적 으로 큰 부재 객체가 인식되지 않을 수 있다. 이러한 경우 상술한 바와 반대로 제2 분할 이미지에서 인식되지 않은 제2 미인식 객체에 대한 데이터들을 취합하고, 취합된 제2 미인식 객체 데이터를 생성하고, 제2 미인식 객 체 데이터를 기반으로 제1 분할 이미지에서 미인식 객체 조합 또는 결합된 형태가 존재하는지 탐색하여 해당 객 체를 인식할 수 있다. 상기 분할 이미지 병합부는, 부재 객체 인식부에서 객체 인식 과정이 완료되면 확대한 각각의 분할 이미지를 원본(스캔 이미지 또는 래스터)와 동일한 크기를 갖도록 그 크기를 각각 축소(예를 들어 1/4배로 축소)하는 재 가공 과정을 수행한 후 해당 데이터(또는 분할 이미지)들을 병합할 수 있다. 상기 이미지 파일 변환부는, 분할 이미지 병합부를 통해 생성된 이미지 파일을 DXF 파일로 변환(저장)할 수 있다. DXF(Drawing Exchange File) 파일(도면 변환 파일)은 DWG의 Exchange 파일로서 다른 포 맷으로 변환할 수 있는 파일이다. 이러한 DXF 파일은 다른 응용 프로그램(예를 들어 AutoCAD)의 도면이나 이미 지로 사용할 수 있으며, 반대로 다른 프로그램에서 작업한 내용도 해당 응용 프로그램으로 불러올 수 있다. 상기 텍스트 객체 추출부는, 스캔 이미지(래스터 이미지)에 포함된 텍스트 객체를 추출하여 텍스트 객체 데이터를 생성할 수 있다. 래스터 이미지는 픽셀 정보를 포함할 수 있으므로, 해당 이미지 상에서 추출된 텍스 트 객체의 좌표정보를 얻을 수 있으며, 추출된 텍스트 객체 데이터와 더불어 텍스트 객체 위치정보(좌표정보)를 획득하여 후처리부로 전달될 수 있다. 상기 후처리부는, 전처리부를 통해 변환된 이미지 파일의 부재 객체에 대한 좌표 변환을 수행하여 벡 터 데이터를 생성할 수 있다. 이를 위해 후처리부는 도 7에 도시된 바와 같이, 텍스트 데이터 생성부 및 캐드 파일 생성부 중 적어도 하나를 포함할 수 있다. 상기 텍스트 데이터 생성부는, 텍스트 인식에 대하여 미리 학습된 딥러닝 알고리즘을 기반으로 텍스트 객 체 데이터에 포함된 텍스트 객체를 인식하여 텍스트 데이터를 생성할 수 있다. 좀 더 구체적으로는, 문자 인식 율을 높이기 위해 텍스트 객체 데이터에 대한 전처리를 수행한 후, 텍스트 객체 데이터의 텍스트 영역에서 글자 를 검출하고, 검출된 글자를 구분하는 특징을 대량의 데이터를 통해 미리 학습된 딥러닝 알고리즘을 통해 해당 글자가 어떠한 문자인지를 인식할 수 있으며, 이후 인식된 문자의 내용적인 부분을 따져서 부자연스러운 단어나 문자가 포함되어 있으면 이를 수정하는 후처리 과정을 수행함으로써 텍스트 데이터를 얻을 수 있다. 이렇게 생 성된 텍스트 데이터는 캐드 파일 생성부로 전달될 수 있다. 상기 캐드 파일 생성부는, DXF 파일에 텍스트 데이터 생성부를 통해 생성된 텍스트 데이터를 추가하 여 전통목조건축물의 스캔 이미지(래스터 이미지) 상에 텍스트(예를 들어 한글)로 이루어진 부재 명칭, 설명 등 에 대한 텍스트 데이터를 DXF 파일에 적용할 수 있다. 또한, 캐드 파일 생성부는, 텍스트 데이터가 추가된 DXF 파일의 각 부재 객체에 대한 좌표 변환(CAD 레이 어화 작업)을 수행하여 벡터 데이터(캐드 전자 파일)를 생성(변환) 할 수 있다. 도 8은 본 발명의 다른 실시예에 따른 전통목조건축물의 래스터 이미지를 캐드 전자 도면으로 변환하는 방법의 구성을 나타낸 순서도이고, 도 9는 본 발명의 다른 실시예에 따른 전처리 단계의 구성을 나타낸 순서도이며, 도 10은 본 발명의 다른 실시예에 따른 후처리 단계의 구성을 나타낸 순서도이다. 도 8을 참조하면, 본 발명의 일 실시예에 따른 전통목조건축물의 래스터 이미지를 캐드 전자 도면으로 변환하는 방법(S100)은 전처리 단계(S110) 및 후처리 단계(S120) 중 적어도 하나를 포함할 수 있다. 상기 전처리 단계(S110)는, 전통목조건축물의 스캔 이미지를 분할하고, 다수의 분할 이미지에 대한 이미지 프로 세싱을 각각 수행하여 분할 이미지 각각에 포함된 부재 객체를 인식하고, 부재 객체가 인식된 다수의 분할 이미 지를 병합한 후 파일 교환이 가능한 포맷으로 변환할 수 있다. 이를 위해 전처리 단계(S110)는 도 4에 도시된 바와 같이, 분할 이미지 생성 단계(S111), 데이터 전처리 수행 단계(S112), 부재 객체 인식 단계(S113), 분할 이미지 병합 단계(S114), 이미지 파일 변환 단계(S115) 및 텍스 트 객체 추출 단계(S116) 중 적어도 하나를 포함할 수 있다. 상기 분할 이미지 생성 단계(S111)는, 전통목조건축물이 그려진 스캔 이미지(또는 래스터 이미지)(BMP, TIFF, PNG, JPG 등)를 입력 받고, 입력된 스캔 이미지(또는 래스터 이미지)에 대하여 서로 다른 개수로 각각 분할하여 다수의 분할 이미지를 각각 생성할 수 있다. 예를 들어, 스캔 이미지(또는 래스터 이미지)를 2x2로 분할한 제1 분할 이미지와 3x3으로 분할한 제2 분할 이미 지를 각각 생성할 수 있으나, 이는 발명의 이해를 돕기 위한 일례일 뿐이며 본 실시예에서는 이와 같은 형태로 만 분할 이미지를 생성하는 것이 아니라, 4x4, 5x5, 6x6 등 더 많은 개수로 더 많은 분할 이미지를 생성하여 실 시할 수 있음이 당연하다. 상기 데이터 전처리 수행 단계(S112)는, 분할 이미지 생성 단계(S111)를 통해 생성된 분할 이미지(제1 분할 이 미지(2x2), 제2 분할 이미지(3x3)) 각각에 대한 해상도 및 색 표현 방식을 통일하는 데이터 전처리를 수행할 수 있다. 이러한 데이터 전처리 과정은 분할 이미지들을 모두 같은 크기를 갖는 이미지로 통일하기 위한 과정으로, 가로, 세로 픽셀 사이즈를 표현하는 해상도를 통일하고, 색을 표현하는 방식을 통일(RGB, HSV, Gray-scale, Binary 등)할 수 있다. 물론, 분할 스캔 이미지 생성 단계(S111)에서 스캔 이미지(래스터 이미지)를 균등 분할 함에 따라 데이터 전처리 과정을 생략할 수 있으나, 보다 정확한 객체 인식 및 검출을 위해 분할된 이미지들에 대한 데이터 전처리 과정이 수행되는 것이 바람직하다. 상기 부재 객체 인식 단계(S113)는, 전통목조건축물의 각 부재를 구성하는 부재 객체 단위의 인식에 대하여 미 리 학습된 인공지능 알고리즘을 기반으로, 데이터 전처리 수행 단계(S112)를 통해 데이터 전처리가 완료된 분할 이미지 각각에 대하여 미리 설정된 배수만큼 확대(예를 들어 4배로 확대)한 후, 객체 인식을 위한 이미지 프로 세싱을 수행하여 미리 학습된 부재 객체를 인식할 수 있다(데이터 전처리 과정 생략 시 분할 이미지 생성 단계 (S111)를 통해 생성된 분할 이미지 별로 이미지 프로세싱을 수행함). 본 실시예에서 미리 학습된 부재 객체 단위는 살미, 첨자, 주두, 소로, 초각, 치수, 주석 등으로 전통목조건축 물을 구성하는 기본적인 요소를 포함할 수 있다. 인공지능 알고리즘은 이와 같이 전통목조건축물의 기본적인 객 체 단위인 살미, 첨자, 주두, 소로, 초각, 치수, 주석 등의 형태, 모양, 구조 등에 관한 이미지 데이터와 그에 대한 라벨 데이터를 학습데이터로 이용하여 학습한 딥러닝 알고리즘을 바탕으로 분할 이미지로부터 부재 객체 단위를 각각 인식할 수 있다. 상기 부재 객체 인식 단계(S113)는, 다수의 분할 이미지가 NxN 분할 이미지를 갖는 제1 분할 이미지와 MxM(M>N 인 자연수) 분할 이미지를 갖는 제2 분할 이미지로 구성되는 경우, 이미지 분할 경계선 및 분할된 이미지의 크 기로 인해 분할 이미지에서 인식되지 않은 객체가 인식될 수 있도록 제1 분할 이미지와 제2 분할 이미지 간의 미인식 객체를 상호 보완적으로 탐색하여 부재 객체를 인식할 수 있다. 좀 더 구체적으로 부재 객체 인식 단계(S113)는, 다수의 분할 이미지가 NxN 분할 이미지를 갖는 제1 분할 이미 지와 MxM(M>N인 자연수) 분할 이미지를 갖는 제2 분할 이미지로 구성되는 경우, 제1 분할 이미지에서 인식되지 않은 제1 미인식 객체에 대한 데이터들을 취합하고, 취합된 제1 미인식 객체 데이터를 생성하고, MxM 분할 이미 지에서 탐색하여 부재 객체를 인식하고, 제2 분할 이미지에서 인식되지 않은 제2 미인식 객체에 대한 데이터들 을 취합하고, 취합된 제2 미인식 객체 데이터를 생성하고, NxN 분할 이미지에서 탐색하여 부재 객체를 인식할 수 있다.예를 들어, 분할 이미지 생성 단계(S111)에서 도 5에 도시된 바와 같이 2x2로 분할된 제1 분할 이미지와 도 6에 도시된 바와 같은 3x3로 분할된 제2 분할 이미지가 있다고 가정할 경우, 제1 분할 이미지(2x2) 중 ①, ②번 분 할 이미지의 분할 경계선에 의해 객체 M1이 인식되지 못하는 경우, 해당 미인식 대상 요소를 제1 미인식 객체로 정의한 후, 정의된 제1 미인식 객체들을 취합하여 제1 미인식 객체 데이터를 생성할 수 있다. 이러한 제1 미인 식 객체 데이터에는 미리 학습된 데이터는 정의되지 않은 요소들에 대한 형태, 구조, 모양 등에 대한 데이터를 포함할 수 있다. 이후 제2 분할 이미지(3x3)에서 제1 미인식 객체 데이터를 기반으로 탐색 과정을 수행하여 이 전에 인식되지 않았던 새로운 부재 객체를 인식할 수 있다. 즉, 도 5에 도시된 제1 분할 이미지에서는 ①, ②번 분할 이미지의 분할 경계선에 의해 객체 M1이 잘려지게 되어 객체 M1에 대한 인식이 불가하였으나, ①, ②번 분 할 이미지에서 잘려진 요소들을 취합하고, 이들을 조합 또는 결합한 형태가 도 6에 도시된 제2 분할 이미지 (3x3)에서 연결 객체로서 존재하는지 탐색하는 과정을 통해 ⑤번 분할 이미지 상에서 객체 M1이 인식될 수 있다. 또한, 이와는 반대로 제2 분할 이미지가 제1 분할 이미지보다 분할 섹터가 많기 때문에 하나의 이미지에 상대적 으로 큰 부재 객체가 인식되지 않을 수 있다. 이러한 경우 상술한 바와 반대로 제2 분할 이미지에서 인식되지 않은 제2 미인식 객체에 대한 데이터들을 취합하고, 취합된 제2 미인식 객체 데이터를 생성하고, 제2 미인식 객 체 데이터를 기반으로 제1 분할 이미지에서 미인식 객체 조합 또는 결합된 형태가 존재하는지 탐색하여 해당 객 체를 인식할 수 있다. 상기 분할 이미지 병합 단계(S114)는, 부재 객체 인식 단계(S113)에서 객체 인식 과정이 완료되면 확대한 각각 의 분할 이미지를 원본(스캔 이미지 또는 래스터)와 동일한 크기를 갖도록 그 크기를 각각 축소(예를 들어 1/4 배로 축소)하는 재 가공 과정을 수행한 후 해당 데이터(또는 분할 이미지)들을 병합할 수 있다. 상기 이미지 파일 변환 단계(S115)는, 분할 이미지 병합 단계(S114)를 통해 생성된 이미지 파일을 DXF 파일로 변환(저장)할 수 있다. DXF(Drawing Exchange File) 파일(도면 변환 파일)은 DWG의 Exchange 파일로서 다른 포 맷으로 변환할 수 있는 파일이다. 이러한 DXF 파일은 다른 응용 프로그램(예를 들어 AutoCAD)의 도면이나 이미 지로 사용할 수 있으며, 반대로 다른 프로그램에서 작업한 내용도 해당 응용 프로그램으로 불러올 수 있다. 상기 텍스트 객체 추출 단계(S116)는, 스캔 이미지(래스터 이미지)에 포함된 텍스트 객체를 추출하여 텍스트 객 체 데이터를 생성할 수 있다. 래스터 이미지는 픽셀 정보를 포함할 수 있으므로, 해당 이미지 상에서 추출된 텍 스트 객체의 좌표정보를 얻을 수 있으며, 추출된 텍스트 객체 데이터와 더불어 텍스트 객체 위치정보(좌표정 보)를 획득하여 후처리 단계(S120)로 전달될 수 있다. 상기 후처리 단계(S120)는, 전처리 단계(S110)를 통해 변환된 이미지 파일의 부재 객체에 대한 좌표 변환을 수 행하여 벡터 데이터를 생성할 수 있다. 이를 위해 후처리 단계(S120)는 도 7에 도시된 바와 같이, 텍스트 데이터 생성 단계(S121) 및 캐드 파일 생성 단계(S122) 중 적어도 하나를 포함할 수 있다. 상기 텍스트 데이터 생성 단계(S121)는, 텍스트 인식에 대하여 미리 학습된 딥러닝 알고리즘을 기반으로 텍스트 객체 데이터에 포함된 텍스트 객체를 인식하여 텍스트 데이터를 생성할 수 있다. 좀 더 구체적으로는, 문자 인 식율을 높이기 위해 텍스트 객체 데이터에 대한 전처리를 수행한 후, 텍스트 객체 데이터의 텍스트 영역에서 글 자를 검출하고, 검출된 글자를 구분하는 특징을 대량의 데이터를 통해 미리 학습된 딥러닝 알고리즘을 통해 해 당 글자가 어떠한 문자인지를 인식할 수 있으며, 이후 인식된 문자의 내용적인 부분을 따져서 부자연스러운 단 어나 문자가 포함되어 있으면 이를 수정하는 후처리 과정을 수행함으로써 텍스트 데이터를 얻을 수 있다. 이렇 게 생성된 텍스트 데이터는 캐드 파일 생성 단계(S122)로 전달될 수 있다. 상기 캐드 파일 생성 단계(S122)는, DXF 파일에 텍스트 데이터 생성 단계(S121)를 통해 생성된 텍스트 데이터를 추가하여 전통목조건축물의 스캔 이미지(래스터 이미지) 상에 텍스트(예를 들어 한글)로 이루어진 부재 명칭, 설명 등에 대한 텍스트 데이터를 DXF 파일에 적용할 수 있다. 또한, 캐드 파일 생성 단계(S122)는, 텍스트 데이터가 추가된 DXF 파일의 각 부재 객체에 대한 좌표 변환(CAD 레이어화 작업)을 수행하여 벡터 데이터(캐드 전자 파일)를 생성(변환) 할 수 있다. 이상에서 설명한 것은 본 발명에 의한 전통목조건축물의 래스터 이미지를 캐드 전자 도면으로 변환하는 시스템 및 방법을 실시하기 위한 하나의 실시예에 불과한 것으로서, 본 발명은 상기 실시예에 한정되지 않고, 이하의 특허청구범위에서 청구하는 바와 같이 본 발명의 요지를 벗어남이 없이 당해 발명이 속하는 분야에서 통상의 지식을 가진 자라면 누구든지 다양한 변경 실시가 가능한 범위까지 본 발명의 기술적 정신이 있다고 할 것이다."}
{"patent_id": "10-2022-0089973", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 전통목조건축물의 래스터 이미지를 캐드 전자 도면으로 변환하는 시스템의 구현 형태 및 동작 방식을 나타낸 개요도이다. 도 2는 본 발명의 일 실시예에 따른 전통목조건축물의 래스터 이미지를 캐드 전자 도면으로 변환하는 시스템의 동작 알고리즘을 나타낸 순서도이다. 도 3은 본 발명의 일 실시예에 따른 전통목조건축물의 래스터 이미지를 캐드 전자 도면으로 변환하는 시스템의 구성을 나타낸 블록도이다. 도 4는 본 발명의 일 실시예에 따른 전처리부의 구성을 나타낸 블록도이다. 도 5 및 도 6은 본 발명의 일 실시예에 따른 부재 객체 인식부에서 부재 객체를 인식하는 방법을 설명하기 위해 예시적으로 나타낸 도면이다. 도 7는 본 발명의 일 실시예에 따른 후처리부의 구성을 나타낸 블록도이다. 도 8은 본 발명의 다른 실시예에 따른 전통목조건축물의 래스터 이미지를 캐드 전자 도면으로 변환하는 방법의 구성을 나타낸 순서도이다. 도 9는 본 발명의 다른 실시예에 따른 전처리 단계의 구성을 나타낸 순서도이다. 도 10은 본 발명의 다른 실시예에 따른 후처리 단계의 구성을 나타낸 순서도이다."}
