{"patent_id": "10-2014-0015078", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2015-0094145", "출원번호": "10-2014-0015078", "발명의 명칭": "아이콘과 월 페이퍼의 상호변환을 제공하는 전자장치 및 방법", "출원인": "삼성전자주식회사", "발명자": "정유신"}}
{"patent_id": "10-2014-0015078", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "적어도 하나의 아이콘 특징에 따라 월 페이퍼를 변환하거나, 상기 월 페이퍼의 설정에 따라 상기 적어도 하나의아이콘을 변환하는 제어모듈;상기 제어모듈의 제어에 따라 변환된 월 페이퍼 또는 상기 변환된 적어도 하나의 아이콘을 표시하는 출력모듈;을 포함하는 아이콘과 월 페이퍼의 상호변환을 제공하는 전자장치."}
{"patent_id": "10-2014-0015078", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 아이콘 특징은상기 아이콘의 색과 모양을 포함하는 상기 아이콘의 시각정보, 상기 아이콘의 다운로드 날짜정보, 상기 아이콘의 사용 날짜정보, 상기 아이콘 사용의 누적정보 및 상기 아이콘의 메타정보 중 적어도 하나를 포함하는 아이콘과 월 페이퍼의 상호변환을 제공하는 전자장치."}
{"patent_id": "10-2014-0015078", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 제어모듈은상기 출력모듈에 복수의 아이콘이 표시된 상태이면, 상기 아이콘의 특징 중 적어도 하나의 특징으로 상기 복수의 아이콘을 변환하는 아이콘과 월 페이퍼의 상호변환을 제공하는 전자장치."}
{"patent_id": "10-2014-0015078", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 복수의 아이콘의 변환은상기 복수의 아이콘의 정렬, 위치변경, 그룹핑을 포함하는 변환인 아이콘과 월 페이퍼의 상호변환을 제공하는장치."}
{"patent_id": "10-2014-0015078", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 제어모듈은 상기 적어도 하나의 아이콘의 특징에 따라 상기 월 페이퍼의 색을 변환하는 아이콘과 월 페이퍼의 상호변환을제공하는 전자장치."}
{"patent_id": "10-2014-0015078", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4항에 있어서,상기 제어모듈은상기 복수의 아이콘 중 특정 아이콘이 이동되면, 상기 아이콘의 색에 의거하여 상기 아이콘이 이동된 위치에 해당하는 상기 월 페이퍼의 색을 변환하는 아이콘과 월 페이퍼의 상호변환을 제공하는 전자장치."}
{"patent_id": "10-2014-0015078", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제4항에 있어서,공개특허 10-2015-0094145-2-상기 제어모듈은상기 복수의 아이콘에 대한 사용이력을 확인하여 상기 복수의 아이콘을 변환하는 아이콘과 월 페이퍼의 상호변환을 제공하는 전자장치."}
{"patent_id": "10-2014-0015078", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제2항에 있어서,상기 제어모듈은외부의 입력에 따라 특정 색, 복수의 블록 및 상기 복수의 블록에 특정 색, 테마 및 라이브 월 페이퍼 중 적어도 하나로 상기 월 페이퍼를 설정하는 아이콘과 월 페이퍼의 상호변환을 제공하는 전자장치."}
{"patent_id": "10-2014-0015078", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 제어모듈은상기 월 페이퍼에 특정 색이 설정되면, 상기 특정 색에 대응되는 색을 갖는 적어도 하나의 아이콘을 상기 월 페이퍼에 표시하는 아이콘과 월 페이퍼의 상호변환을 제공하는 전자장치."}
{"patent_id": "10-2014-0015078", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에 있어서,상기 월 페이퍼에 복수의 블록 및 상기 복수의 블록에 특정 색이 설정되면, 상기 특정 색에 대응되는 색을 갖는적어도 하나의 아이콘을 상기 블록으로 이동시켜 상기 월 페이퍼에 표시하는 아이콘과 월 페이퍼의 상호변환을제공하는 전자장치."}
{"patent_id": "10-2014-0015078", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제8항에 있어서, 상기 월 페이퍼에 테마가 설정되면, 상기 테마에 대응되는 적어도 하나의 아이콘을 상기 월 페이퍼에 표시하는아이콘과 월 페이퍼의 상호변환을 제공하는 전자장치."}
{"patent_id": "10-2014-0015078", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제8항에 있어서,상기 월 페이퍼가 라이브 월 페이퍼로 설정되면, 상기 라이브 월 페이퍼에 포함된 오브젝트가 이동할 때, 상기적어도 하나의 아이콘의 색에 따라 상기 오브젝트의 색이 변환되어 표시되는 아이콘과 월 페이퍼의 상호변환을제공하는 전자장치."}
{"patent_id": "10-2014-0015078", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제어모듈이 월 페이퍼 출력 시 아이콘 또는 월 페이퍼의 변환 기준을 확인하는 과정;상기 제어모듈은 상기 변환 기준이 아이콘인 것으로 확인되면, 대기화면에 표시된 적어도 하나의 아이콘 특징을확인하여 상기 월 페이퍼를 변환하는 과정;상기 제어모듈은 상기 변환 기준이 월 페이퍼인 것으로 확인되면, 기 설정된 월 페이퍼에 따라 상기 적어도 하나의 아이콘을 변환하는 과정;을 포함하는 아이콘과 월 페이퍼의 상호변환을 제공하는 방법."}
{"patent_id": "10-2014-0015078", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 월 페이퍼를 변환하는 과정은공개특허 10-2015-0094145-3-상기 적어도 하나의 아이콘 특징을 확인하는 과정; 상기 확인된 적어도 하나의 아이콘 특징에 따라 상기 월 페이퍼의 색을 변환하는 과정인 아이콘과 월 페이퍼의상호변환을 제공하는 방법."}
{"patent_id": "10-2014-0015078", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 적어도 하나의 아이콘 특징을 확인하는 과정 이후에상기 대기화면에 복수의 아이콘이 존재하면, 상기 아이콘의 색과 모양을 포함하는 상기 아이콘의 시각정보, 상기 아이콘의 다운로드 날짜정보, 상기 아이콘의 사용 날짜정보, 상기 아이콘 사용의 누적정보 및 상기 아이콘의메타정보 중 적어도 하나의 특징을 기준으로 상기 복수의 아이콘을 정렬하는 과정;을 포함하는 아이콘과 월 페이퍼의 상호변환을 제공하는 방법."}
{"patent_id": "10-2014-0015078", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제13항에 있어서, 상기 기 설정된 월 페이퍼에 따라 상기 적어도 하나의 아이콘을 변환하는 과정은특정 색, 복수의 블록 및 상기 복수의 블록에 특정 색, 테마 및 라이브 월 페이퍼 중 적어도 하나로 기 설정된상기 월 페이퍼를 확인하는 과정; 상기 기 설정된 월 페이퍼에 따라 상기 적어도 하나의 아이콘을 변환하는 과정인 아이콘과 월 페이퍼의 상호변환을 제공하는 방법."}
{"patent_id": "10-2014-0015078", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 적어도 하나의 아이콘 특징에 따라 월 페이퍼를 변환하거나, 월 페이퍼의 설정에 따라 적어도 하나의 아이콘을 변환하는 제어모듈, 제어모듈의 제어에 따라 변환된 월 페이퍼 또는 변환된 적어도 하나의 아이콘을 표 시하는 출력모듈을 포함할 수 있고, 다른 실시 예로도 적용이 가능하다."}
{"patent_id": "10-2014-0015078", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시 예는 아이콘과 월 페이퍼의 정보를 이용하여 아이콘과 월 페이퍼의 상호변환을 제공하는 전자장치 및 방법에 관한 것이다."}
{"patent_id": "10-2014-0015078", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 어플리케이션을 다운받아 사용하는 전자장치는 어플리케이션 서버로부터 어플리케이션을 다운로드 받고, 다운로드 된 어플리케이션 아이콘을 외부의 입력에 따라 폴더링(foldering)하여 정렬한다. 또한, 전자장 치는 외부의 입력에 따라 특정 어플리케이션을 통해 영상데이터를 다운로드 하여 월 페이퍼로 설정하거나, 전자 장치에 구비된 카메라를 통해 획득된 영상데이터를 월 페이퍼로 설정한다."}
{"patent_id": "10-2014-0015078", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상기와 같이 종래의 전자장치는 어플리케이션 아이콘을 배경화면에 표시할 때 다운로드 된 순서대로 표시되기 때문에, 사용자가 직접 폴더링을 수행하거나, 아이콘 정렬을 수행해야 하는 번거로움이 발생한다. 또한, 전자장치의 월 페이퍼를 설정하기 위해서는 사용자가 특정 어플리케이션을 통해 영상데이터를 다운로드 하여 월 페이퍼로 설정하거나, 전자장치에 구비된 카메라를 통해 영상데이터를 획득하여 월 페이퍼를 설정해야 하는 번거로움이 발생한다. 또한, 설정된 월 페이퍼와 아이콘이 조화롭지 않아 심미감을 향상시키는 데 한계가 발생하는 문제점이 있다. 이러한 종래의 문제점을 해결하기 위한 본 발명의 다양한 실시 예들은 다운로드 된 어플리케이션의 아이콘들을 아이콘들의 정보에 의거하여 자동으로 정렬 또는 폴더링할 수 있는 아이콘과 월 페이퍼의 상호변환을 제공하는 전자장치 및 방법을 제공하는 것이다. 또한, 본 발명의 다양한 실시 예들은 어플리케이션 아이콘들의 정렬 또는 폴더링 방식에 따라서 월 페이퍼를 변 환하는 아이콘과 월 페이퍼의 상호변환을 제공하는 전자장치 및 방법을 제공하는 것이다. 또한, 본 발명의 다양한 실시 예들을 월 페이퍼의 변환에 따라서 어플리케이션 아이콘들의 정렬 또는 폴더링 방 식을 변환하는 아이콘과 월 페이퍼의 상호변환을 제공하는 전자장치 및 방법을 제공하는 것이다."}
{"patent_id": "10-2014-0015078", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시 예에 따른 아이콘과 월 페이퍼의 상호변환을 제공하는 전자장치는 적어도 하나의 아이콘 특 징에 따라 월 페이퍼를 변환하거나, 상기 월 페이퍼의 설정에 따라 상기 적어도 하나의 아이콘을 변환하는 제어 모듈, 상기 제어모듈의 제어에 따라 변환된 월 페이퍼 또는 상기 변환된 적어도 하나의 아이콘을 표시하는 출력 모듈을 포함할 수 있다. 아울러, 본 발명의 일 실시 예에 따른 아이콘과 월 페이퍼의 상호변환을 제공하는 방법은 제어모듈이 월 페이퍼 출력 시 아이콘 또는 월 페이퍼의 변환 기준을 확인하는 방법, 상기 제어모듈은 상기 변환 기준이 아이콘인 것으로 확인되면, 대기화면에 표시된 적어도 하나의 아이콘 특징을 확인하여 상기 월 페이퍼를 변환하는 과정, 상 기 제어모듈은 상기 변환 기준이 월 페이퍼인 것으로 확인되면, 기 설정된 월 페이퍼에 따라 상기 적어도 하나 의 아이콘을 변환하는 과정을 포함할 수 있다."}
{"patent_id": "10-2014-0015078", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상술한 바와 같이 본 발명의 다양한 실시 예들에 따른 아이콘과 월 페이퍼의 상호변환을 제공하는 전자장치 및 방법은 다운로드 된 어플리케이션의 아이콘들을 아이콘들의 정보에 의거하여 자동으로 정렬 또는 폴더링할 수 있어, 사용자의 번거로움을 최소화할 수 있는 효과가 있다. 또한, 본 발명의 다양한 실시 예들에 따른 아이콘과 월 페이퍼의 상호변환을 제공하는 전자장치 및 방법은 어플 리케이션 아이콘들의 정렬 또는 폴더링 방식에 따라서 월 페이퍼를 변환함으로써, 월 페이퍼를 사용자가 직접 설정하는 번거로움을 최소화할 수 있고, 아이콘과 월 페이퍼의 조화로움을 향상시켜 심미감을 배가시킬 수 있는 효과가 있다. 또한, 본 발명의 다양한 실시 예들에 따른 아이콘과 월 페이퍼의 상호변환을 제공하는 전자장치 및 방법은 월 페이퍼의 변환에 따라서 어플리케이션 아이콘들을 정렬 또는 폴더링 함으로써, 사용자가 직접 아이콘의 정렬 또 는 폴더링을 수행하는 번거로움을 최소화할 수 있고, 아이콘과 월 페이퍼의 조화로움을 향상시켜 심미감을 배가 시킬 수 있는 효과가 있다."}
{"patent_id": "10-2014-0015078", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면들을 참조하여 본 발명의 실시 예를 보다 상세하게 설명한다. 본 발명은 다양한 변경을 가할 수 있고 여러 가지 실시 예를 가질 수 있는 바, 특정 실시 예들이 도면에 예시되고 관련된 상세한 설명이 기재 되어 있다. 그러나, 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경 및/또는 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관 련하여, 유사한 구성요소에 대해서는 유사한 참조 부호가 사용되었다. 본 발명 가운데 사용될 수 있는 “포함한다” 또는 “포함할 수 있다” 등의 표현은 개시된 해당 기능, 동작 또 는 구성요소 등의 존재를 가리키며, 추가적인 하나 이상의 기능, 동작 또는 구성요소 등을 제한하지 않는다. 또 한, 본 발명에서 “포함하다” 또는 “가지다” 등의 용어는 명세서상에 기재된 특징, 숫자, 과정, 동작, 구성 요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 과정, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 발명에서 “또는” 등의 표현은 함께 나열된 단어들의 어떠한, 그리고 모든 조합을 포함한다. 예를 들어, “ A 또는 B”는 A를 포함할 수도, B를 포함할 수도, 또는 A와 B 모두를 포함할 수도 있다. 본 발명에서 사용한 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일 반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의미 를 가지는 것으로 해석되어야 하며, 본 발명에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 본 발명에 따른 전자장치는 통신기능이 포함된 장치일 수 있다. 예를 들면, 전자장치는 스마트 폰(smart phone), 태블릿 PC(tablet personal reader), 이동전화기(mobile phone), PDA(personal digital assistant), MP3 플레이어, 웨어러블 장치(wearable device, 예; 전자 안경과 같은 head-mounted-device(HMD)), 카메라 (camera), 스마트 워치(smart watch) 등 무선 통신이 가능한 장치일 수 있다. 이하, 첨부된 도면을 참조하여 다양한 실시 예에 따른 전자장치에 대해서 살펴본다. 다양한 실시 예에서 이용되 는 사용자라는 용어는 전자장치를 사용하는 사람 또는 전자장치를 사용하는 장치(예; 인공지능 전자장치)를 지 칭할 수 있다. 도 1은 본 발명의 일 실시 예에 따른 아이콘과 월 페이퍼의 상호변환을 제공하는 전자장치의 주요 구성을 나타 내는 블록도이다. 도 1을 참조하면, 본 발명에 따른 전자장치는 통신모듈, 입력모듈, 출력모듈, 저장모듈 및 제어모듈을 포함할 수 있다. 통신모듈은 전자장치와 외부장치(앱 스토어(미도시) 또는 서버장치(미도시))간의 통신을 연결할 수 있다. 통신모듈은 무선 통신 또는 유선 통신을 통해서 외부 장치와 통신할 수 있다. 무선 통신은 예를 들 어, Wifi(Wireless fidelity), BT(Bluetooth), NFC(Near Field Communication) 또는 cellular통신(예: LTE, LTE-A, CDMA, WCDMA, UMTS, WiBro 또는 GSM 등) 중 적어도 하나를 포함할 수 있다. 상기 유선 통신은 예를 들 어, USB(Universal Serial Bus), HDMI(High Definition Multimedia Interface), RS-232(Recommended Standard 232) 또는 POTS(Plain Old Telephone Service) 중 적어도 하나를 포함할 수 있다. 또한, 통신모듈은 cellular통신을 이용하여 음성통화, 영상통화, 채팅 메시지, 문자메시지 서비스, 멀티미 디어 메시지 서비스 또는 인터넷 서비스를 제공할 수 있다. 통신모듈은 무선 통신 또는 유선 통신을 이용 하여 외부장치로부터 어플리케이션을 수신할 수 있다. 입력모듈은 외부로부터의 입력에 의해 전자장치를 동작시키기 위한 동작신호를 생성하여 제어모듈 로 제공할 수 있다. 입력모듈은 아이콘과 월 페이퍼의 상호변환을 설정하기 위한 신호를 생성할 수 있다. 입력모듈은 아이콘과 월 페이퍼를 상호변환하기 위한 기준이 되는 조건에 대한 기준선택신호를 생성 할 수 있다. 기준선택신호는 아이콘을 특정 우선순위에 의거하여 정렬한 후, 정렬된 아이콘에 따라 월 페이퍼를 변환하기 위한 신호일 수 있다. 이때, 아이콘의 특정 우선순위는 아이콘의 색 및 모양을 포함하는 아이콘의 시각정보, 아이콘의 날짜정보, 아이콘의 메타정보, 아이콘의 누적정보 중 적어도 하나의 정보를 이용하여 설정될 수 있다. 또한, 기준선택신호는 월 페이퍼의 색, 월 페이퍼의 블록 생성, 월 페이퍼의 테마설정 및 월 페이퍼를 라이브 월 페이퍼로 표시하기 위한 신호를 생성할 수 있다. 입력모듈은 아이콘 선택 시 아이콘의 색을 반전시키기 위한 신호, 아이콘의 투명도를 변환시키기 위한 신 호, 아이콘의 외곽선을 추가하기 위한 신호, 아이콘에 그림자를 추가하기 위한 신호 등 아이콘을 변화시키기 위 한 신호를 생성할 수 있다. 입력모듈은 키버튼, 키보드, 키패드, 터치패드, 터치스크린 등의 입력장치로 형성될 수 있다. 출력모듈은 제어모듈의 제어에 따라 동작되는 실행화면을 표시할 수 있다. 출력모듈은 LCD(Liquid Crystal Display), 터치스크린 등으로 형성될 수 있고, 터치스크린으로 형성된 경우, 출력모듈(13 0)은 입력모듈의 역할을 동시에 실행할 수 있다. 출력모듈이 터치스크린으로 형성된 경우, 입력모듈 에서 생성되는 신호를 생성하기 위해 출력모듈은 가상의 버튼 등을 표시할 수 있다. 출력모듈은 제어모듈의 제어에 의해 아이콘을 정렬하여 표시할 수 있고, 정렬된 아이콘의 색에 의해 월 페이퍼의 색을 변환하여 표시할 수 있다. 또한, 출력모듈은 제어모듈의 제어에 의해 설정정보가 적용된 월 페이퍼를 표시할 수 있다. 출력모듈은 표시된 월 페이퍼에 따라 아이콘을 정렬할 수 있다. 저장모듈은 전자장치를 동작시키기 위한 프로그램 또는 어플리케이션 등을 저장할 수 있다. 저장모듈 은 아이콘과 월 페이퍼의 상호변환을 위해 설정된 정보들을 설정정보에 저장할 수 있다. 저장모듈 은 아이콘의 색과 모양을 포함하는 아이콘의 시각정보를 시각정보에 저장할 수 있다. 저장모듈 은 어플리케이션 개발자가 어플리케이션을 외부장치에 업로드할 때 설정해야 하는 카테고리를 아이콘의 메타정 보로서 메타정보에 저장할 수 있다. 저장모듈은 사용자가 어플리케이션을 다운로드 한 날짜, 어플리 케이션을 마지막으로 사용한 날짜를 포함하는 날짜정보를 날짜정보에 저장할 수 있다. 저장모듈은 사 용자의 어플리케이션 사용이력 등을 누적정보에 저장할 수 있다. 제어모듈은 복수의 아이콘 특징을 확인하여 월 페이퍼를 변환하거나, 월 페이퍼의 설정에 따라 복수의 아 이콘을 정렬하여 아이콘과 월 페이퍼의 상호변환을 수행할 수 있다. 제어모듈의 설정관리부는 입력모듈에서 수신된 아이콘과 월 페이퍼의 상호변환을 설정하기 위한 신호에 따라 상호변환 설정모드로 진입할 수 있다. 설정관리부는 아이콘과 월 페이퍼를 상호변환하기 위한 기준이 되는 기준선택신호를 입력모듈에서 수신할 수 있다. 기준선택신호는 아이콘을 특정 우선순위에 의 거하여 정렬한 후, 정렬된 아이콘에 따라 월 페이퍼를 변환하기 위한 신호일 수 있다. 기준선택신호를 월 페이 퍼를 설정하고, 설정된 월 페이퍼에 따라 아이콘을 정렬하기 위한 신호일 수 있다. 설정관리부는 입력모듈 에서 수신된 기준선택신호에 따라 상호변환모드의 조건을 설정하고 이를 저장모듈의 설정정보에 저장할 수 있다. 제어모듈의 아이콘관리부와 월 페이퍼 관리부는 출력모듈에 대기화면을 표시할 때, 상기 기준선택신호에 따라 아이콘 및 월 페이퍼를 변환하여 표시할 수 있다. 일 실시 예에 따르면, 제어모듈의 아이콘관리부는 아이콘의 색을 우선순위로 아이콘들을 정렬하도록 설정된 상태에서 입력모듈로부터 상호변환모드로 진입하기 위한 신호가 수신되면, 대기화면에 표시된 복수 의 아이콘의 색을 확인할 수 있다. 이때, 상호변환모드로 진입하기 위한 신호는 대기화면을 표시하기 위한 신호 일 수 있다. 아이콘관리부는 확인된 아이콘들의 색 별로 아이콘들을 그룹화하여 정렬할 수 있다. 이때, 아 이콘관리부는 서로 다른 색을 갖는 복수개의 아이콘이 적어도 한 페이지의 월 페이퍼에 표시된 상태이면, 유사한 색을 갖는 아이콘들을 추출하여 색 별로 월 페이퍼에 표시할 수 있다. 예컨대, 대기화면에 표시된 아이 콘들이 빨간색 계통, 파란색 계통의 색을 갖는 것으로 확인되면, 빨간색 계통의 색을 갖는 아이콘을 월 페이퍼 의 한 페이지에, 파란색 계통의 색을 갖는 아이콘을 월 페이퍼의 다른 한 페이지에 정렬하여 표시할 수 있다. 월 페이퍼 관리부는 아이콘관리부에서 색을 기준으로 하는 아이콘의 정렬이 완료되면, 월 페이퍼의 색을 변환할 수 있다. 월 페이퍼 관리부는 빨간색 계통의 색을 갖는 아이콘이 정렬된 월 페이퍼의 한 페이 지는 빨간색 계통의 색을 갖도록 월 페이퍼를 변환할 수 있고, 파란색 계통의 색을 갖는 아이콘이 정렬된 월 페 이퍼의 다른 한 페이지는 파란색 계통의 색을 갖도록 월 페이퍼를 변환할 수 있다. 또한, 아이콘관리부는 빨간색 계통의 색을 갖는 아이콘들과, 파란색 계통의 색을 갖는 아이콘들을 그룹화 하여 월 페이퍼의 한 페이지에 정렬하여 표시할 수 있다. 이때, 월 페이퍼 관리부는 그룹화되어 정렬된 아 이콘의 색에 따라 한 페이지의 월 페이퍼가 빨간색 계통과 파란색 계통의 색을 갖도록 월 페이퍼를 변환할 수있다. 일 실시 예에 따르면, 제어모듈의 아이콘관리부는 아이콘의 모양 중에서 외곽선의 형태(이하, 아이콘 의 형태라 함)를 우선순위로 아이콘들을 정렬하도록 설정된 상태에서 입력모듈로부터 상호변환모드로 진입 하기 위한 신호가 수신되면, 대기화면에 표시된 복수의 아이콘의 형태를 확인할 수 있다. 아이콘관리부는 확인된 아이콘들의 형태 별로 아이콘들을 그룹화하여 정렬할 수 있다. 이때, 아이콘의 형태는 자유곡선을 이용 한 형태, 원 형태 및 사각형태 등 아이콘의 형태로 이루어질 수 있다. 아이콘관리부는 다양한 형태를 갖는 복수개의 아이콘이 적어도 한 페이지의 월 페이퍼에 표시된 상태이면, 유사한 형태를 갖는 아이콘들을 추출하여 형태 별로 월 페이퍼에 표시할 수 있다. 예컨대, 대기화면에 표시된 아이콘들이 자유곡선을 이용한 형태와 사각 형태로 이루어진 것으로 확인되면, 자유곡선을 이용한 형태로 이루어진 아이콘들을 월 페이퍼의 한 페이지에, 사각형태로 이루어진 아이콘들을 월 페이퍼의 다른 한 페이지에 정렬하여 표시할 수 있다. 아이콘관리부는 자유곡선을 이용한 형태로 이루어진 아이콘들과 사각형태로 이루어진 아이콘들을 한 페이지의 월 페이퍼에 정렬 할 수 있다. 월 페이퍼 관리부는 아이콘관리부에서 형태를 기준으로 하는 아이콘의 정렬이 완료되면, 월 페이퍼의 색을 선택적으로 변환할 수 있다. 이때, 아이콘관리부는 형태로 아이콘들을 정렬한 이후에 아이콘의 색을 확인하여 정렬하도록 설정된 상태이면, 유사한 형태로 이루어진 아이콘들의 색을 확인하여 색 별로 정렬할 수 있다. 월 페이퍼 관리부는 아이콘의 형태 및 색으로 정렬이 완료되면 아이콘이 정렬된 색 별로 월 페이퍼 의 색을 변환할 수 있다. 일 실시 예에 따르면, 제어모듈의 아이콘관리부는 아이콘의 모양 중에서 아이콘 내부의 구조(이하, 아이콘의 구조라 함)를 우선순위로 아이콘들을 정렬하도록 설정된 상태에서 입력모듈로부터 상호변환모드 로 진입하기 위한 신호가 수신되면, 대기화면에 표시된 복수의 아이콘의 형태를 확인할 수 있다. 아이콘관리부 는 확인된 아이콘들의 구조 별로 아이콘들을 그룹화하여 정렬할 수 있다. 이때, 아이콘의 구조는 아이콘 내부에 동물 형태의 이미지가 형성된 구조, 카메라 구조, 아이콘에 시계 형태의 이미지가 형성된 구조, 아이콘 내부에 알파벳 형태의 텍스트가 형성된 구조(이하, 텍스트 구조라 함) 등을 의미할 수 있다. 아이콘관리부(15 2)는 다양한 구조를 갖는 아이콘이 적어도 한 페이지의 월 페이퍼에 표시된 상태이면, 유사한 구조를 갖는 아이 콘들을 추출하여 구조 별로 월 페이퍼에 표시할 수 있다. 예컨대, 대기화면에 표시된 아이콘들이 카메라 구조와 텍스트 구조인 것으로 확인되면, 카메라 구조를 갖는 아이콘들을 월 페이퍼의 한 페이지에, 텍스트 구조인 아이 콘들을 월 페이퍼의 다른 한 페이지에 정렬하여 표시할 수 있다. 아이콘관리부는 카메라 구조를 갖는 아이 콘들과 텍스트 구조를 갖는 아이콘들을 그룹화하여 한 페이지의 월 페이퍼에 정렬할 수 있다. 월 페이퍼 관리부는 아이콘관리부에서 구조를 기준으로 하는 아이콘의 정렬이 완료되면 월 페이퍼의 색을 선택적으로 변환할 수 있다. 이때, 아이콘관리부는 구조로 아이콘들을 정렬한 이후에 아이콘의 색을 확인하여 정렬하도록 설정된 상태이면, 유사한 구조를 갖는 아이콘들의 색을 확인하여 색 별로 정렬할 수 있다. 월 페이퍼 관리부는 아이콘의 구조 및 색으로 정렬이 완료되면 아이콘이 정렬된 색 별로 월 페이퍼의 색을 변환할 수 있다. 일 실시 예에 따르면, 제어모듈의 아이콘관리부는 아이콘의 메타정보를 우선순위로 아이콘들을 정렬 하도록 설정된 상태에서 입력모듈로부터 상호변환모드로 진입하기 위한 신호가 수신되면, 대기화면에 표시 된 복수의 아이콘의 메타정보를 확인할 수 있다. 아이콘관리부는 확인된 아이콘들의 메타정보에 따라 아이 콘들을 그룹화하여 정렬할 수 있다. 예컨대, 대기화면에 표시된 아이콘들의 메타정보가 사진과 스케쥴인 것으로 확인되면, 메타정보가 사진인 아이콘을 월 페이퍼의 한 페이지에, 메타정보가 스케쥴인 아이콘을 월 페이지의 다른 한 페이지에 정렬하여 표시할 수 있다. 아이콘관리부는 메타정보가 사진인 아이콘과 메타정보가 스케 쥴인 아이콘을 한 페이지의 월 페이퍼에 정렬하여 표시할 수도 있다. 월 페이퍼 관리부는 아이콘관리부에서 메타정보를 기준으로 하는 아이콘의 정렬이 완료된 이후에 월 페이퍼의 색을 선택적으로 변환할 수 있다. 이때, 아이콘관리부는 메타정보로 아이콘들을 정렬한 이후에 아이콘의 색을 확인하여 정렬하도록 설정된 상태이면, 동일한 메타정보를 갖는 아이콘들의 색을 확인하여 색 별 로 정렬할 수 있다. 월 페이퍼 관리부는 아이콘의 메타정보 및 색으로 정렬이 완료되면 아이콘이 정렬된색 별로 월 페이퍼의 색을 변환할 수 있다. 일 실시 예에 따르면, 제어모듈의 아이콘관리부는 아이콘의 날짜정보를 우선순위로 아이콘들을 정렬 하도록 설정된 상태에서 입력모듈로부터 상호변환모드로 진입하기 위한 신호가 수신되면, 대기화면에 표시 된 복수의 아이콘의 날짜정보를 확인할 수 있다. 아이콘관리부는 확인된 날짜정보에 따라 아이콘들을 그룹 화하여 정렬할 수 있다. 예컨대, 아이콘관리부는 대기화면에 표시된 아이콘들의 다운로드 날짜를 확인하여, 다운로드 받은 년도(year), 월(month), 주(week), 일(day) 중 어느 하나를 기준으로 월 페이퍼에 정 렬하여 표시할 수 있다. 또는, 아이콘관리부는 대기화면에 표시된 아이콘들의 최종 사용 날짜를 확인하여 최종 사용 날짜(day), 주(week), 월(month), 년도(year) 중 어느 하나를 기준으로 월 페이퍼에 정렬하여 표시할 수 있다. 월 페이퍼 관리부는 아이콘관리부에서 날짜정보를 기준으로 하는 아이콘의 정렬이 완료된 이후에 월 페이퍼의 색을 선택적으로 변환할 수 있다. 이때, 아이콘관리부는 날짜정보로 아이콘들을 정렬한 이후에 아이콘의 색을 확인하여 정렬하도록 설정된 상태이면, 기준이 된 날짜정보에 해당하는 아이콘들의 색을 확인하 여 색 별로 정렬할 수 있다. 월 페이퍼 관리부는 아이콘의 날짜정보 및 색으로 정렬이 완료되면 아이콘이 정렬된 색 별로 월 페이퍼의 색을 변환할 수 있다. 일 실시 예에 따르면, 제어모듈의 아이콘관리부는 아이콘의 누적정보를 우선순위로 아이콘들을 정렬 하도록 설정된 상태에서 입력모듈로부터 상호변환모드로 진입하기 위한 신호가 수신되면, 대기화면에 표시 된 복수의 아이콘의 누적정보를 확인할 수 있다. 아이콘관리부는 확인된 아이콘들의 사용이력에 대한 누적 정보에 따라 아이콘들을 그룹화하여 정렬할 수 있다. 예컨대, 대기화면에 표시된 아이콘들 중 특정 아이콘의 누 적정보가 타 아이콘의 누적정보보다 임계치 이상 높으면 누적정보가 임계치 이상인 아이콘을 월 페이퍼에 정렬 하여 표시할 수 있다. 이때, 아이콘관리부는 누적정보에 의거하여 누적정보가 임계치보다 높은 어플리케이 션과 동일한 메타정보를 갖는 어플리케이션을 사용자에게 제공할 수도 있다. 월 페이퍼 관리부는 아이콘관리부에서 누적정보를 기준으로 하는 아이콘의 정렬이 완료된 이후에 월 페이퍼의 색을 선택적으로 변환할 수 있다. 이때, 아이콘관리부는 누적정보로 아이콘들을 정렬한 이후에 아이콘의 색을 확인하여 정렬하도록 설정된 상태이면, 임계치 이상의 누적정보를 갖는 아이콘들의 색을 확인하 여 색 별로 정렬할 수 있다. 월 페이퍼 관리부는 아이콘의 누적정보 및 색으로 정렬이 완료되면 아이콘이 정렬된 색 별로 월 페이퍼의 색을 변환할 수 있다. 또한, 아이콘관리부는 사용자가 출력모듈에 표시 된 화면을 확대하기 위한 어플리케이션을 임계치 이상 사용하거나, 사용자가 임계치 이상 출력모듈에 표시 된 화면을 확대하면 출력모듈에 표시되는 아이콘들의 크기를 확대하여 표시할 수도 있다. 일 실시 예에 따르면, 제어모듈의 월 페이퍼 관리부는 설정된 월 페이퍼에 따라 아이콘을 정렬하도록 설정된 상태에서 입력모듈로부터 상호변환모드로 진입하기 위한 신호가 수신되면, 대기화면에 표시된 월 페이퍼를 설정된 월 페이퍼로 표시할 수 있다. 예컨대, 월 페이퍼 관리부는 월 페이퍼가 적어도 하나의 색 을 갖도록 설정된 상태이면, 아이콘관리부는 대기화면에 표시된 복수의 아이콘의 색을 확인할 수 있다. 아이콘관리부는 월 페이퍼에 설정된 색과 유사한 색을 갖는 아이콘을 기준으로 월 페이퍼에 정렬하여 표시 할 수 있다. 아이콘관리부는 월 페이퍼에 설정된 색과 보색대비를 이루는 색을 갖는 아이콘을 기준으로 월 페이퍼에 정렬하여 표시할 수 있다. 일 실시 예에 따르면, 제어모듈의 월 페이퍼 관리부는 설정된 월 페이퍼에 따라 아이콘을 정렬하도록 설정된 상태에서 입력모듈로부터 상호변환모드로 진입하기 위한 신호가 수신되면, 대기화면에 표시된 월 페이퍼를 설정된 월 페이퍼로 표시할 수 있다. 이때, 월 페이퍼를 적어도 두 개의 블록으로 분할하도록 설정되 고, 각 블록에 색이 설정된 상태이면 월 페이퍼 관리부는 출력모듈에 표시되는 월 페이퍼를 각각의 색을 갖는 복수의 블록으로 분할하여 표시할 수 있다. 아이콘관리부는 대기화면에 표시된 복수의 아이콘의 색을 확인할 수 있다. 아이콘관리부는 각 블록에 설정된 색과 유사한 색을 갖는 아이콘을 추출하고, 추출된 아이콘을 해당 색을 갖는 각 블록에 정렬하여 표시할수 있다. 일 실시 예에 따르면, 제어모듈의 월 페이퍼 관리부는 설정된 월 페이퍼에 따라 아이콘을 정렬하도록 설정된 상태에서 입력모듈로부터 상호변환모드로 진입하기 위한 신호가 수신되면, 대기화면에 표시된 월 페이퍼를 설정된 월 페이퍼로 표시할 수 있다. 이때, 월 페이퍼에 테마(theme)가 설정되면, 월 페이퍼 관리부 는 설정된 테마에 맞도록 월 페이퍼를 설정할 수 있다. 예컨대, 일주일이 테마로 설정된 상태이면 월 페이 퍼 관리부는 일요일부터 목요일까지, 금요일부터 토요일까지를 각각의 테마로 설정하여 두 페이지의 월 페 이퍼를 생성할 수 있다. 아이콘관리부는 일요일부터 목요일까지 자주 사용될 수 있는 아이콘(예컨대, 업무와 관련된 어플리케이션, 플래너와 관련된 어플리케이션 등)을 추출하여 한 페이지의 월 페이퍼에 표시할 수 있고, 금요일부터 토요일까 지 자주 사용될 수 있는 아이콘(예컨대, 호텔 예약과 관련된 어플리케이션, 항공 예약과 관련된 어플리케이션, 사진 및 동영상의 촬영 및 편집과 관련된 어플리케이션 등)을 추출하여 다른 한 페이지의 월 페이퍼에 표시할 수 있다. 일 실시 예에 따르면, 제어모듈의 월 페이퍼 관리부는 설정된 월 페이퍼에 따라 아이콘을 정렬하도록 설정된 상태에서 입력모듈로부터 상호변환모드로 진입하기 위한 신호가 수신되면, 대기화면에 표시된 월 페이퍼를 설정된 월 페이퍼로 표시할 수 있다. 이때, 월 페이퍼가 라이브 월 페이퍼로 설정되면, 월 페이퍼 관 리부는 대기화면에 표시된 월 페이퍼에 움직임을 제공하여 출력모듈에 표시할 수 있다. 라이브 월 페이퍼는 이동성을 갖는 특정 오브젝트가 존재하는 영상데이터를 월 페이퍼로 설정할 수 있다. 아이 콘관리부는 특정 오브젝트가 아이콘이 위치한 영역으로 이동할 때, 대기화면에 표시된 복수의 아이콘의 색 을 확인할 수 있다. 월 페이퍼 관리부는 아이콘의 위치로 특정 오브젝트가 이동할 때, 특정 오브젝트의 색 을 아이콘과 유사한 색을 갖도록 변환하여 표시할 수 있다. 제어모듈의 아이콘관리부는 입력모듈로부터 아이콘을 변화시키기 위한 신호가 수신되면, 수신된 신호에 의거하여 아이콘의 변화를 설정할 수 있다. 아이콘관리부는 입력모듈에서 아이콘 선택 시 아 이콘의 색을 반전시키기 위한 신호가 수신되면, 아이콘 선택 시 아이콘의 색을 반전시켜 출력모듈에 표시 할 수 있다. 아이콘관리부는 입력모듈에서 아이콘의 투명도를 변환하기 위한 신호가 수신되면, 아이 콘의 투명도를 조절하여 출력모듈에 표시할 수 있다. 아이콘관리부는 입력모듈에서 아이콘의 외 곽선을 추가하기 위한 신호가 수신되면 아이콘의 외곽선을 추가하여 출력모듈에 표시할 수 있다. 아이콘관 리부는 입력모듈에서 아이콘의 그림자를 월 페이퍼에 표시하기 위한 신호가 수신되면 아이콘에 그림 자를 추가하여 월 페이퍼에서 그림자가 출력되도록 출력모듈에 표시할 수 있다. 상기와 같이 설정된 아이 콘 변화는 아이콘과 월 페이퍼의 상호변환 시 출력모듈에 표시된 아이콘에 적용될 수 있다. 제어모듈의 월 페이퍼 관리부는 정렬된 아이콘의 색에 의거하여 월 페이퍼의 색을 변환할 수 있다. 월 페이퍼 관리부는 월 페이퍼의 색이 변환된 상태에서 특정 위치에 해당하는 아이콘의 이동이 완료되면, 아이콘이 이동된 위치의 월 페이퍼 색을 상기 아이콘의 색과 유사한 색으로 변환하여 표시할 수 있다. 도 2는 본 발명의 일 실시 예에 따른 아이콘과 월 페이퍼의 상호변환을 설정하는 방법을 나타내는 순서도이다. 도 1 및 도 2를 참조하면, 11과정에서 제어모듈은 입력모듈로부터 아이콘과 월 페이퍼의 상호변환을 설정하기 위한 진입신호가 수신되면 13과정을 수행할 수 있고, 상기 진입신호가 수신되지 않으면 27과정을 수행 할 수 있다. 27과정에서 제어모듈은 대기화면을 지속적으로 표시하거나 수행 중이던 해당 기능을 지속적으 로 수행할 수 있다. 13과정에서 제어모듈은 아이콘 또는 월 페이퍼 중에서 상호변환 시의 기준을 선택하기 위한 기준선택신호 를 입력모듈로부터 수신하고, 15과정에서 제어모듈은 수신된 신호를 확인할 수 있다. 15과정의 확인 결과 아이콘을 기준으로 월 페이퍼를 변환하기 위한 신호가 수신되면 제어모듈은 17과정을 수행하고, 월 페이퍼를 기준으로 아이콘을 정렬하기 위한 신호가 수신되면 제어모듈은 25과정을 수행할 수 있다. 17과정에서 제어모듈은 입력모듈로부터 월 페이퍼 변환 시 아이콘 정렬의 우선순위를 결정하기 위한 선택신호를 수신할 수 있다. 이때, 아이콘은 아이콘의 특징을 이용하여 정렬될 수 있다. 아이콘의 특징은 아이 콘의 색, 아이콘의 형태, 아이콘의 구조를 포함하는 아이콘의 시각정보, 아이콘의 다운로드 날짜와 아이콘의 사 용 날짜에 대한 정보를 포함하는 날짜정보, 아이콘의 사용이력을 포함하는 누적정보 및 아이콘의 메타정보일 수 있다. 제어모듈은 상기 아이콘의 특징 중에서 입력모듈로부터 선택된 적어도 하나의 특징을 아이콘 정렬 시 우선순위로 결정할 수 있다. 19과정에서 제어모듈은 입력모듈로부터 아이콘 변화여부를 결정하기 위한 선택신호를 수신할 수 있다. 이때, 아이콘의 변화여부는 아이콘 선택 시 아이콘의 색 반전, 아이콘의 투명도 조절, 아이콘의 외곽선 추가, 아이콘의 그림자 표시 등 아이콘의 출력정보를 조절하는 것을 나타낼 수 있다. 21과정에서 제어모듈은 입력모듈로부터 아이콘을 기준으로 월 페이퍼의 변환에 대한 설정정보를 저장 하기 위한 신호가 수신되면, 23과정을 수행할 수 있다. 23과정에서 제어모듈은 상기 설정정보를 저장할 수 있다. 21과정에서 제어모듈은 설정정보를 저장하기 위한 신호가 수신되지 않으면 15과정으로 회귀하여 상 기의 과정을 재수행할 수 있다. 15과정의 확인결과 월 페이퍼를 기준으로 아이콘을 정렬하기 위한 신호가 수신되면 제어모듈은 25과정을 수행할 수 있다. 25과정에서 제어모듈은 입력모듈로부터 월 페이퍼의 설정정보에 대한 신호가 수신되 면, 수신되는 신호에 따라 월 페이퍼 변환을 설정할 수 있다. 월 페이퍼의 설정정보는 월 페이퍼의 색, 월 페이 퍼의 블록 생성, 월 페이퍼의 테마설정 및 월 페이퍼를 라이브 월 페이퍼로 설정하여 아이콘을 정렬하기 위한 설정정보 등일 수 있다. 21과정에서 제어모듈은 입력모듈로부터 월 페이퍼를 기준으로 아이콘의 정렬에 대한 설정정보를 저장 하기 위한 신호가 수신되면, 23과정을 수행할 수 있다. 23과정에서 제어모듈은 상기 설정정보를 저장할 수 있다. 21과정에서 제어모듈은 설정정보를 저장하기 위한 신호가 수신되지 않으면 15과정으로 회귀하여 상 기의 과정을 재수행할 수 있다. 도 3은 본 발명의 일 실시 예에 따른 아이콘과 월 페이퍼의 상호변환을 제공하는 방법을 나타내는 순서도이다. 도 1 내지 도 3을 참조하면, 31과정에서 제어모듈은 입력모듈로부터 상호변환모드로 진입하기 위한 진입신호를 수신하면, 33과정으로 진행할 수 있다. 31과정에서 제어모듈은 입력모듈로부터 진입신호 가 수신되지 않으면 47과정으로 진행하여 수행 중이던 기능을 지속적으로 수행할 수 있다. 이때, 진입신호는 대 기화면을 실행하기 위한 신호일 수 있다. 33과정에서 제어모듈은 아이콘과 월 페이퍼의 상호변환 시 도 2에서 기 설정된 기준 예컨대, 설정정보를 확인할 수 있다. 확인결과, 상호변환 시의 기준이 아이콘으로 기 설정된 상태이면 제어모듈은 35과정을 수 행할 수 있고, 기준이 월 페이퍼로 기 설정된 상태이면 제어모듈은 41과정을 수행할 수 있다. 35과정에서 제어모듈은 기 설정된 아이콘 정렬 시의 우선순위를 확인할 수 있다. 37과정에서 제어모듈 은 확인된 우선순위를 기준으로 아이콘을 정렬할 수 있다. 39과정에서 제어모듈은 아이콘 정렬이 완 료된 이후에 아이콘이 정렬된 기준에 따라서 월 페이퍼의 변환을 수행할 수 있다. 아이콘의 정렬에 따라 월 페 이퍼의 변환을 수행하는 실시 예는 도 1에서 상세히 설명하였으므로, 설명을 생략한다. 41과정에서 제어모듈은 기 설정된 월 페이퍼의 설정정보를 확인할 수 있다. 43과정에서 제어모듈은 확인된 설정정보를 월 페이퍼에 적용하여 월 페이퍼를 표시할 수 있다. 45과정에서 제어모듈은 변환된 월 페이퍼에 따라서 아이콘의 정렬을 수행할 수 있다. 월 페이퍼에 따라 아이콘의 정렬을 수행하는 실시 예는 도 1 에서 상세히 설명하였으므로, 설명을 생략한다. 도 4는 본 발명의 일 실시 예에 따른 아이콘의 시각정보에 따른 변환과 이에 따른 월 페이퍼의 변환을 나타내는 화면 예시도이다. 도 1 및 도 4를 참조하면, 전자장치에 아이콘과 월 페이퍼의 상호변환 설정이 되지 않은 상태에서의 대기 화면은 도 4(a)와 같다. 사용자가 아이콘의 시각정보에 의해 아이콘을 변환하고, 이에 따라 월 페이퍼를 변환하 기로 설정하면 대기화면은 도 4(b), 도 4(c) 및 도 4(d)의 화면 중 어느 하나의 화면으로 표시될 수 있다. 사용자가 도 4(a)에 표시된 아이콘 변환 시의 우선순위를 아이콘의 색으로 설정하면, 전자장치는 도 4(a) 에 표시된 아이콘을 색 별로 그룹화하고, 색 별로 월 페이퍼 한 페이지씩을 할당할 수 있다. 예컨대, 전자장치 는 도 4(b)의 도면부호 401a와 같이 유사한 색을 가진 아이콘을 추출하여 한 페이지의 월 페이퍼에 정렬하 여 표시하고, 도면부호 401b와 같이 아이콘의 색에 따라 월 페이퍼의 색이 변환되어 표시될 수 있다. 이때, 401a와 다른 색을 가진 아이콘을 월 페이퍼의 다른 한 페이지로 이동되어 정렬될 수 있다. 사용자가 도 4(a)에 표시된 아이콘 정렬 시의 우선순위를 아이콘의 형태 및 색으로 설정하면, 전자장치는 도 4(a)에 표시된 아이콘을 형태 별로 그룹화할 수 있다. 전자장치는 도 4(c)의 도면부호 402a와 같이 자 유곡선을 이용한 형태를 갖는 아이콘을 그룹화하여 한 페이지의 월 페이퍼에 정렬하여 표시할 수 있다. 도면부 호 402a가 표시된 월 페이퍼는 도면부호 402b, 402c, 402d와 같이 각 아이콘의 색에 따라 서로 다른 색으로 변 환될 수 있다. 사용자가 도 4(a)에 표시된 아이콘 정렬 시의 우선순위를 아이콘의 구조로 설정하면, 전자장치는 도 4(a) 에 표시된 아이콘을 구조 별로 그룹화할 수 있다. 예컨대, 전자장치는 도 4(d)의 도면부호 403a와 같이 카 메라 구조를 갖는 아이콘을 그룹화하여 한 페이지의 월 페이퍼에 정렬하여 표시할 수 있다. 이때, 우선순위에 색이 설정되지 않은 경우에 전자장치는 도면부호 403c과 같이 월 페이퍼의 색을 변환하지 않을 수 있다. 또한, 아이콘의 변화여부 중 아이콘의 외곽선 표시가 설정된 상태이면 전자장치는 도 4(d)의 도면부호 403b와 같이 아이콘에 외곽선을 표시할 수 있다. 이때, 아이콘의 변화여부는 아이콘 선택 시 아이콘의 색 반전, 아이콘의 투명도 조절, 아이콘의 외곽선 추가, 아이콘의 그림자 표시 등 아이콘의 출력정보 변화 중 적어도 어 느 하나의 변화일 수 있다. 도 5는 본 발명의 일 실시 예에 따른 아이콘의 메타정보에 따른 변환과 이에 따른 월 페이퍼의 변환을 나타내는 화면 예시도이다. 도 1 및 도 5를 참조하면, 전자장치에 아이콘과 월 페이퍼의 상호변환 설정이 되지 않은 상태에서의 대기 화면은 도 5(a)와 같다. 사용자가 아이콘의 메타정보에 의해 아이콘을 변환하고, 이에 따라 월 페이퍼를 변환하 기로 설정하면 대기화면은 도 5(b)와 같은 화면으로 표시될 수 있다. 사용자가 도 4(a)에 표시된 아이콘 변환 시의 우선순위를 아이콘의 메타정보로 설정하면, 전자장치는 도 5(a)에 표시된 아이콘의 메타정보를 확인 할 수 있다. 이때, 메타정보는 어플리케이션 개발자가 앱 스토어 등의 어플리케이션 제공 서버에 어플리케이션 을 등록할 때, 설정해야 하는 어플리케이션의 카테고리일 수 있다. 전자장치는 확인된 메타정보를 기준으로 도 5(a)에 표시된 아이콘을 도 5(b)와 같이 변환할 수 있다. 전자 장치는 도 5(b)의 도면부호 404a와 같이 카테고리가 사진에 해당하는 어플리케이션에 해당하는 아이콘을 월 페이퍼에 정렬할 수 있다. 이때, 우선순위에 색이 설정된 상태이면 전자장치는 도 5(b)의 도면부호 404b, 404c, 404d와 같이 아이콘에 해당하는 색을 반영하여 월 페이퍼를 변환할 수 있다. 도 6은 본 발명의 일 실시 예에 따른 아이콘 이동 시에 따른 월 페이퍼의 변환을 나타내는 화면 예시도이다. 도 1 및 도 6을 참조하면, 도 6(a)의 도면부호 405a, 405b와 같이 아이콘의 색에 따라 아이콘이 정렬된 상태이 면, 도면부호 406a, 406b와 같이 월 페이퍼의 색도 아이콘의 색과 유사한 색으로 변경되어 표시될 수 있다. 도 6(a)와 같은 상태에서 6(b)에서와 같이 특정 아이콘(도면부호 A)이 선택되면, 아이콘의 색에 반전이 발생될 수 있다. 이때, 전자장치는 사용자에 의해 아이콘의 변화가 기 설정된 상태이면 아이콘 선택 시 아이콘의 색 반전, 아이콘의 투명도 조절, 아이콘의 외곽선 추가, 아이콘의 그림자 표시 등 아이콘의 출력정보 등이 변화될 수 있다. 도 6(b)에서와 같이 특정 아이콘(A, 407a)이 선택된 이후에, 특정 아이콘(A, 407a)이 특정 위치(도면 부호 B)로 이동하게 되면 전자장치는 도 6(c)의 도면부호 407b와 같이 월 페이퍼의 색을 특정 아이콘(A, 407a)의 색에 따라 변환할 수 있다. 이와 같이, 아이콘의 이동이 발생되면, 도면부호 405a, 405b와 같이 다른 아이콘들의 위치가 변경될 수 있고, 아이콘의 위치가 변경되면 도면부호 406a, 406b와 같이 월 페이퍼의 색상도 아이콘의 변경된 위치에 대응되도록 변환될 수 있다. 도 7은 본 발명의 일 실시 예에 따른 월 페이퍼의 색에 따른 아이콘 변환을 나타내는 화면 예시도이다. 도 1 및 도 7을 참조하면, 전자장치에 아이콘과 월 페이퍼의 상호변환 설정이 되지 않은 상태에서의 대기 화면은 도 7(a)와 같다. 사용자가 도 7(b)의 도면부호 407a, 407b와 같이 한 페이지의 월 페이퍼에 서로 다른 색을 설정하면, 전자장치는 도 7(a)에 표시된 아이콘의 색을 확인할 수 있다. 전자장치는 아이콘의 색을 확인한 이후에 407a와 유사한 색을 가진 408a를 407a 영역에 정렬할 수 있고, 407b와 유사한 색을 가진 408b를 407b 영역에 정렬할 수 있다. 또한, 전자장치는 아이콘의 색을 확인한 이후에 407a에 대비되는 색 을 가진 408b를 407a 영역에 정렬할 수 있고, 407b에 대비되는 색을 가진 408a를 407b 영역에 정렬할 수 있다. 도 8은 본 발명의 일 실시 예에 따른 월 페이퍼에 설정한 블록에 따른 아이콘 변환을 나타내는 화면 예시도이다. 도 1 및 도 8을 참조하면, 전자장치에 아이콘과 월 페이퍼의 상호변환 설정이 되지 않은 상태에서의 대기 화면은 도 8(a)와 같다. 사용자가 도 8(b)와 같이 월 페이퍼에 P1, P2의 블록을 설정하고, 각 블록에 색을 설정 할 수 있다. 도 8(b)와 같이 월 페이퍼에 블록 및 색이 설정되면 전자장치는 도 8(a)에 표시된 아이콘의 색을 확인할 수 있다. 아이콘의 색을 확인한 이후에 전자장치는 유사한 색을 갖는 아이콘들을 도 8(c)의 409a와 409b와 같이 그룹핑할 수 있다. 전자장치는 도 8(c)와 같이 P1의 색과 유사한 색을 갖는 아이콘 (409a)를 P1영역에 표시할 수 있고, P2의 색과 유사한 색을 갖는 아이콘(409b)를 P2 영역에 표시할 수 있다. 또 한, 409b가 P2에 전부 표시되지 않으면 전자장치는 P2 에 해당하는 월 페이퍼를 두 개 이상의 페이지로 형 성할 수 있다. 도 9는 본 발명의 일 실시 예에 따른 월 페이퍼에 설정한 테마에 따른 아이콘 변환을 나타내는 화면 예시도이다. 도 1 및 도 9를 참조하면, 전자장치에 아이콘과 월 페이퍼의 상호변환 설정이 되지 않은 상태에서의 대기 화면은 도 9(a)와 같다. 사용자가 특정 테마를 설정하면, 전자장치는 테마에 맞게 아이콘을 정렬할 수 있 다. 예컨대, 사용자가 일주일을 특정 테마로 설정하면 전자장치는 도 9(a)에 표시된 아이콘 중에서 일요일 부터 목요일까지 많이 사용되는 아이콘(도면부호 410a)을 추출하여 도 9(b)와 같이 정렬할 수 있다. 이때, 일요 일부터 목요일까지 많이 사용되는 아이콘은 업무와 관련된 어플리케이션에 대한 아이콘, 플래너와 관련된 어플 리케이션에 대한 아이콘일 수 있다. 전자장치는 410a 와 같이 아이콘이 정렬된 이후에 410b, 410c와 같이 월 페이퍼의 색을 아이콘의 색과 유사하게 변환할 수 있다. 또한, 전자장치는 도 9(a)에 표시된 아이콘 중에서 금요일부터 토요일까지 많이 사용되는 아이콘(도면부호 411a)을 추출하여 도 9(c)와 같이 정렬할 수 있다. 이때, 금요일부터 토요일까지 많이 사용되는 아이콘은 호텔 예약과 관련된 어플리케이션에 대한 아이콘, 항공 예약과 관련된 어플리케이션에 대한 아이콘, 사진 및 동영상 촬영 및 편집과 관련된 어플리케이션에 대한 아이콘 등일 수 있다. 전자장치는 411a와 같이 아이콘이 정렬 된 이후에 411b, 411c, 411d, 411e, 411f, 411g와 같이 월 페이퍼의 색을 아이콘의 색과 유사하게 변환할 수 있다. 이와 같이, 전자장치는 테마에 맞게 아이콘을 정렬하고 정렬된 아이콘의 색을 고려하여 월 페이퍼의 색을 변환시킬 수 있고, 테마에 따른 월 페이퍼 색을 설정하고, 설정된 색에 따라 아이콘의 정렬을 수행할 수도 있다. 지금까지 실시 예를 통하여 본 발명에 따른 아이콘과 월 페이퍼의 상호변환을 제공하는 전자장치 및 방법에 대 하여 설명하였다. 본 명세서와 도면에서는 본 발명의 바람직한 실시 예에 대하여 개시하였으며, 비록 특정 용어 들이 사용되었으나, 이는 단지 본 발명의 기술 내용을 쉽게 설명하고 발명의 이해를 돕기 위한 일반적인 의미에 서 사용된 것일 뿐, 본 발명의 범위를 한정하고자 하는 것은 아니다. 상기에서 기재된 실시 예 외에도 본 발명 의 기술적 사상에 바탕을 둔 다른 변형예들이 실시 가능하다는 것은 본 발명이 속하는 기술 분야에서 통상의 지 식을 가진 자에게 자명한 것이다."}
{"patent_id": "10-2014-0015078", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시 예에 따른 아이콘과 월 페이퍼의 상호변환을 제공하는 전자장치의 주요 구성을 나타 내는 블록도이다. 도 2는 본 발명의 일 실시 예에 따른 아이콘과 월 페이퍼의 상호변환을 설정하는 방법을 나타내는 순서도이다. 도 3은 본 발명의 일 실시 예에 따른 아이콘과 월 페이퍼의 상호변환을 제공하는 방법을 나타내는 순서도이다. 도 4는 본 발명의 일 실시 예에 따른 아이콘의 시각정보에 따른 변환과 이에 따른 월 페이퍼의 변환을 나타내는 화면 예시도이다. 도 5는 본 발명의 일 실시 예에 따른 아이콘의 메타정보에 따른 변환과 이에 따른 월 페이퍼의 변환을 나타내는 화면 예시도이다. 도 6은 본 발명의 일 실시 예에 따른 아이콘 이동 시에 따른 월 페이퍼의 변환을 나타내는 화면 예시도이다. 도 7은 본 발명의 일 실시 예에 따른 월 페이퍼의 색에 따른 아이콘 변환을 나타내는 화면 예시도이다. 도 8은 본 발명의 일 실시 예에 따른 월 페이퍼에 설정한 블록에 따른 아이콘 변환을 나타내는 화면 예시도이다. 도 9는 본 발명의 일 실시 예에 따른 월 페이퍼에 설정한 테마에 따른 아이콘 변환을 나타내는 화면 예시도이다."}
