{"patent_id": "10-2023-0099786", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0179090", "출원번호": "10-2023-0099786", "발명의 명칭": "서비스 연속성 제공 방법 및 이를 위한 전자 장치", "출원인": "삼성전자주식회사", "발명자": "우광택"}}
{"patent_id": "10-2023-0099786", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치(100, 100a, 100b)에 있어서, 제1 하우징(111) 및 상기 제1 하우징과 폴드 포지션(folded position) 및 언폴드 포지션(unfolded position)사이에서 회전가능하게 맞물리도록(rotatably engage with) 설정된 제2 하우징(112)을 포함하는 하우징;상기 언폴드 포지션에서 상기 하우징의 전면(front side)으로부터 보여지는(visible) 제1 가요성 디스플레이(161);상기 언폴드 포지션에서 상기 하우징의 후면으로부터 보여지는 제2 디스플레이(162);상기 하우징의 상기 폴드 포지션 및 상기 언폴드 포지션 사이의 천이(transition)를 감지하고, 상기 하우징의방향을 감지하도록 설정된 적어도 하나의 센서 회로(176);상기 제1 가요성 디스플레이, 상기 제2 디스플레이, 및 상기 적어도 하나의 센서 회로와 전기적으로 연결된 프로세서(120); 및상기 프로세서와 전기적으로 연결된 메모리(130)를 포함하고, 상기 메모리는 상기 프로세서에 의하여 실행되었을 때, 상기 프로세서가:상기 언폴드 포지션에서 제1 어플리케이션을 실행함으로써 상기 제1 가요성 디스플레이를 통하여 상기 제1 어플리케이션에 대응하는 컨텐츠를 제공하고,상기 제1 가요성 디스플레이를 통한 상기 컨텐츠의 제공 중에, 상기 적어도 하나의 센서 회로를 이용하여 상기하우징의 상기 언폴드 포지션으로부터 상기 폴드 포지션으로의 천이를 감지하고, 상기 천이의 감지에 기반하여, 상기 폴드 포지션에서 상기 제2 디스플레이가 향하는 제2 방향을 식별하고, 상기 제2 방향이, 상기 언폴드 포지션으로부터 상기 폴드 포지션으로의 천이 이전의 상기 하우징의 전면이 향하는 제1 방향에 대응함에 기반하여, 상기 제2 디스플레이를 통하여 상기 제1 어플리케이션에 대응하는 컨텐츠를제공하고,상기 제2 방향이 상기 제1 방향에 대응하지 않음에 기반하여, 상기 제2 디스플레이를 대기 상태 또는 오프 상태로 제어하고, 상기 제1 어플리케이션의 실행 상태를 지정된 시간 구간 동안 유지하도록 하는 인스트럭션들을 저장하는, 전자 장치."}
{"patent_id": "10-2023-0099786", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 상기 인스트럭션들은, 상기 프로세서에 의하여 실행되었을 때, 상기 프로세서가, 상기 지정된 시간 구간 내에지정된 입력이 수신되지 않으면 상기 제1 어플리케이션을 종료시키도록 하는, 전자 장치."}
{"patent_id": "10-2023-0099786", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서, 상기 인스트럭션들은, 상기 프로세서에 의하여 실행되었을 때, 상기 프로세서가, 상기 지정된 시간 구간 내에상기 지정된 입력이 수신되면, 상기 제2 디스플레이를 통하여 상기 제1 어플리케이션에 대응하는 컨텐츠를 제공하도록 하고, 상기 지정된 입력은, 상기 폴드 포지션으로의 천이 후, 상기 제2 디스플레이가 향하는 방향의 상기 제1 방향에대응하는 방향으로의 변경을 포함하는, 전자 장치."}
{"patent_id": "10-2023-0099786", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "공개특허 10-2024-0179090-3-제 2 항에 있어서, 상기 인스트럭션들은, 상기 프로세서에 의하여 실행되었을 때, 상기 프로세서가, 상기 지정된 시간 구간 내에상기 지정된 입력이 수신되면, 상기 제1 가요성 디스플레이를 통하여 상기 제1 어플리케이션에 대응하는 컨텐츠를 제공하도록 하고, 상기 지정된 입력은, 상기 폴드 포지션으로의 천이 후, 상기 하우징의 상기 폴드 포지션으로부터 상기 언폴드포지션의로의 천이를 포함하는, 전자 장치."}
{"patent_id": "10-2023-0099786", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서, 상기 인스트럭션들은, 상기 프로세서에 의하여 실행되었을 때, 상기 프로세서가:상기 제2 방향이 상기 제1 방향에 대응하지 않고, 상기 제1 어플리케이션이 지정된 어플리케이션이 아니면, 상기 제2 디스플레이를 대기 상태 또는 오프 상태로 제어하고 상기 지정된 시간 구간에 대응하는 타이머를 시작하고, 상기 제2 방향이 상기 제1 방향에 대응하지 않고, 상기 제1 어플리케이션이 상기 지정된 어플리케이션이면, 상기 제2 디스플레이를 대기 상태 또는 오프 상태로 제어하고 상기 제1 어플리케이션에 대응하는 오디오 컨텐츠를출력하도록 하는, 전자 장치."}
{"patent_id": "10-2023-0099786", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서, 상기 인스트럭션들은, 상기 프로세서에 의하여 실행되었을 때, 상기 프로세서가:상기 언폴드 포지션으로부터 상기 폴드 포지션으로의 천이가 시작되는 시점에서, 상기 적어도 하나의 센서를 이용하여 상기 제1 방향을 획득하고, 상기 언폴드 포지션으로부터 상기 폴드 포지션으로의 천이가 완료된 시점에서, 상기 적어도 하나의 센서를 이용하여 상기 제2 방향을 획득하도록 하는, 전자 장치."}
{"patent_id": "10-2023-0099786", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항 내지 제 6 항 중 어느 한 항에 있어서, 상기 적어도 하나의 센서 회로는 상기 전자 장치의 고도를 감지하도록 더 설정되고, 상기 인스트럭션들은, 상기 프로세서에 의하여 실행되었을 때, 상기 프로세서가, 상기 언폴드 포지션으로부터상기 폴드 포지션으로의 천이 이전의 제1 고도와 상기 언폴드 포지션으로부터 상기 폴드 포지션으로의 천이 이후의 제2 고도 사이의 차이가 지정된 값 이상이면 상기 제1 어플리케이션을 종료시키도록 하는, 전자 장치."}
{"patent_id": "10-2023-0099786", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1 항 내지 제 6 항 중 어느 한 항에 있어서, 상기 적어도 하나의 센서 회로는 상기 전자 장치에 대한 파지를 감지하도록 더 설정되고, 상기 인스트럭션들은, 상기 프로세서에 의하여 실행되었을 때, 상기 프로세서가, 상기 언폴드 포지션으로부터상기 폴드 포지션으로의 천이 이후에 상기 제2 하우징 또는 상기 제2 디스플레이가 위치된 면이 파지된 것으로식별되면, 상기 제1 어플리케이션을 종료시키도록 하는, 전자 장치."}
{"patent_id": "10-2023-0099786", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1 항 내지 제 6 항 중 어느 한 항에 있어서, 상기 적어도 하나의 센서 회로는 제2 디스플레이 대한 차폐를 감지하도록 더 설정되고,상기 인스트럭션들은, 상기 프로세서에 의하여 실행되었을 때, 상기 프로세서가, 상기 언폴드 포지션으로부터상기 폴드 포지션으로의 천이 이후에 상기 제2 디스플레이의 적어도 일부가 차폐된 것으로 식별되면, 상기 제1공개특허 10-2024-0179090-4-어플리케이션을 종료시키도록 하는, 전자 장치."}
{"patent_id": "10-2023-0099786", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1 하우징 및 상기 제1 하우징과 회전가능하게 맞물리도록 설정된 제2 하우징을 포함하는 하우징을 구비한 전자 장치의 방법에 있어서, 상기 하우징의 언폴드 포지션에서 제1 어플리케이션을 실행함으로써 상기 언폴드 포지션에서 상기 하우징의 전면(front side)으로부터 보여지는(visible) 제1 가요성 디스플레이를 통하여 상기 제1 어플리케이션에 대응하는컨텐츠를 제공하는 동작;상기 제1 가요성 디스플레이를 통한 상기 컨텐츠의 제공 중에, 상기 하우징의 상기 언폴드 포지션으로부터 폴드포지션으로의 천이를 감지하는 동작;상기 폴드 포지션으로의 천이의 감지에 기반하여, 상기 폴드 포지션에서 상기 제2 하우징의 후면에 배치된 제2디스플레이가 향하는 제2 방향을 식별하는 동작;상기 제2 방향이, 상기 폴드 포지션으로의 천이 이전의 상기 하우징의 전면이 향하는 제1 방향에 대응함에 기반하여, 상기 제2 디스플레이를 통하여 상기 제1 어플리케이션에 대응하는 컨텐츠를 제공하는 동작; 및상기 제2 방향이 상기 제1 방향에 대응하지 않음에 기반하여, 상기 제2 디스플레이를 대기 상태 또는 오프 상태로 제어하고, 상기 제1 어플리케이션의 실행 상태를 지정된 시간 구간 동안 유지하는 동작을 포함하는, 방법."}
{"patent_id": "10-2023-0099786", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "폴더블 하우징을 포함하는 전자 장치가 개시된다. 전자 장치는 언폴드 포지션에서 전면 디스플레이를 통하여 컨 텐츠를 제공 중에, 언폴드 포지션으로부터 폴드 포지션으로 천이될 수 있다. 전자 장치는 천이의 감지에 기반하 여, 전자 장치의 디스플레이가 향하는 방향을 식별할 수 있다. 전자 장치는 천이 이전의 디스플레이 방향과 천이 이후의 디스플레이 방향의 대응 여부에 기반하여, 컨텐츠의 제공 여부를 결정할 수 있다."}
{"patent_id": "10-2023-0099786", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 문서에서 개시되는 실시 예들은, 서비스 연속성을 제공하기 위한 방법 및 이를 위한 전자 장치와 관련된다."}
{"patent_id": "10-2023-0099786", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "폴더블 전자 장치가 널리 이용되고 있다. 폴더블 전자 장치는 힌지 구조를 가지고, 힌지 구조를 중심으로 폴드 또는 언폴드가 가능한 하우징을 가질 수 있다. 사용자 편의를 위하여 폴더블 전자 장치는 복수의 면들에 배치된 디스플레이들을 포함할 수 있다. 예를 들어, 폴더블 전자 장치는 메인 디스플레이와 서브 디스플레이를 포함할 수 있다. 예를 들어, 언폴드 상태에서, 폴더블 전자 장치는 메인 디스플레이를 통하여 컨텐츠를 디스플레이함으 로써 서비스를 제공할 수 있다. 언폴드 상태로부터 폴드 상태로 전환되는 경우, 폴더블 전자 장치는 컨텐츠의 디스플레이를 종료할 수 있다. 상술한 정보는 본 개시에 대한 이해를 돕기 위한 목적으로 하는 배경 기술(related art)로 제공될 수 있다. 상 술한 내용 중 어느 것도 본 개시와 관련하여 종래 기술(prior art)로서 적용될 수 있는지에 관해서는 어떠한 주 장이나 결정이 제기되지 않는다."}
{"patent_id": "10-2023-0099786", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 문서에 개시되는 일 실시 예에 따른 전자 장치는, 제1 하우징 및 제1 하우징과 폴드 포지션(folded position) 및 언폴드 포지션(unfolded position) 사이에서 회전가능하게 맞물리도록(rotatably engage with) 설정된 제2 하우징을 포함하는 하우징, 언폴드 포지션에서 하우징의 전면(front side)으로부터 보여지는 (visible) 제1 가요성 디스플레이, 언폴드 포지션에서 상기 하우징의 후면으로부터 보여지는 제2 디스플레이, 상기 하우징의 상기 폴드 포지션 및 상기 언폴드 포지션 사이의 천이(transition)를 감지하고, 상기 하우징의 방향을 감지하도록 설정된 적어도 하나의 센서 회로, 상기 제1 가요성 디스플레이, 상기 제2 디스플레이, 및 상 기 적어도 하나의 센서 회로와 전기적으로 연결된 프로세서, 및 상기 프로세서와 전기적으로 연결된 메모리를 포함할 수 있다. 상기 메모리는 상기 프로세서에 의하여 실행될 수 있는 인스트럭션들을 저장할 수 있다. 상기 프로세서는, 상기 인스트럭션들을 실행함으로써, 상기 언폴드 포지션에서 제1 어플리케이션을 실행함으로써 상 기 제1 가요성 디스플레이를 통하여 상기 제1 어플리케이션에 대응하는 컨텐츠를 제공하고, 상기 제1 가요성 디 스플레이를 통한 상기 컨텐츠의 제공 중에, 상기 적어도 하나의 센서 회로를 이용하여 상기 하우징의 상기 언폴드 포지션으로부터 상기 폴드 포지션으로의 천이를 감지하고, 상기 천이의 감지에 기반하여, 상기 폴드 포지션 에서 상기 제2 디스플레이가 향하는 제2 방향을 식별하고, 상기 제2 방향이, 상기 언폴드 포지션으로부터 상기 폴드 포지션으로의 천이 이전의 상기 하우징의 전면이 향하는 제1 방향에 대응함에 기반하여, 상기 제2 디스플 레이를 통하여 상기 제1 어플리케이션에 대응하는 컨텐츠를 제공하고, 상기 제2 방향이 상기 제1 방향에 대응하 지 않음에 기반하여, 상기 제2 디스플레이를 대기 상태 또는 오프 상태로 제어하고, 상기 제1 어플리케이션의 실행 상태를 지정된 시간 구간 동안 유지하도록 설정될 수 있다. 또한, 본 문서에 개시되는 일 실시 예에 따른 제1 하우징 및 상기 제1 하우징과 회전가능하게 맞물리도록 설정 된 제2 하우징을 포함하는 하우징을 구비한 전자 장치의 방법은, 상기 하우징의 언폴드 포지션에서 제1 어플리 케이션을 실행함으로써 상기 언폴드 포지션에서 상기 하우징의 전면(front side)으로부터 보여지는(visible) 제 1 가요성 디스플레이를 통하여 상기 제1 어플리케이션에 대응하는 컨텐츠를 제공하는 동작, 상기 제1 가요성 디 스플레이를 통한 상기 컨텐츠의 제공 중에, 상기 하우징의 상기 언폴드 포지션으로부터 폴드 포지션으로의 천이 를 감지하는 동작, 상기 폴드 포지션으로의 천이의 감지에 기반하여, 상기 폴드 포지션에서 상기 제2 하우징의 후면에 배치된 제2 디스플레이가 향하는 제2 방향을 식별하는 동작, 상기 제2 방향이, 상기 폴드 포지션으로의 천이 이전의 상기 하우징의 전면이 향하는 제1 방향에 대응함에 기반하여, 상기 제2 디스플레이를 통하여 상기 제1 어플리케이션에 대응하는 컨텐츠를 제공하는 동작, 및 상기 제2 방향이 상기 제1 방향에 대응하지 않음에 기반하여, 상기 제2 디스플레이를 대기 상태 또는 오프 상태로 제어하고, 상기 제1 어플리케이션의 실행 상태를 지정된 시간 구간 동안 유지하는 동작을 포함할 수 있다. 또한, 본 문서에 개시되는 일 실시 예에 따른 컴퓨터 판독가능 저장 매체는, 프로세서에 의하여 실행되었을 때, 프로세서가 상기 전자 장치의 방법의 동작들을 수행하도록 하는 인스트럭션들을 저장할 수 있다."}
{"patent_id": "10-2023-0099786", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 개시의 실시 예들이 첨부된 도면을 참조하여 기재된다. 그러나, 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 실시 예의 다양한 변경(modification), 균등물(equivalent), 및/또는대체물(alternative)을 포함하는 것으로 이해되어야 한다. 도 1은 일 실시 예에 따른 전자 장치의 블록도이다. 도 1을 참조하여, 일 실시예에 따르면, 전자 장치는 프로세서, 메모리, 제1 가요성 디스플레이 , 제2 디스플레이, 및 센서 회로를 포함할 수 있다. 예를 들어, 전자 장치는 도 14의 전자 장치에 대응할 수 있다. 도 1에 도시된 전자 장치의 구조는 예시적인 것으로서, 본 문서의 실시예들 이 이에 제한되는 것은 아니다. 예를 들어, 전자 장치는 도 1에 미도시된 구성(예: 도 14의 전자 장치 의 구성들 중 적어도 하나)을 더 포함할 수 있다. 예를 들어, 전자 장치는 도 1에 도시된 구성들 중 적어도 하나를 포함하지 않을 수 있다. 프로세서는 적어도 하나의 프로세싱 회로를 포함할 수 있다. 예를 들어, 프로세서는 전자 장치 가 다양한 동작들을 수행하도록 전자 장치의 다양한 구성들을 제어할 수 있다. 예를 들어, 프로세서 는 도 14의 프로세서에 대응할 수 있다. 예를 들어, 후술되는 전자 장치의 동작들은 프로세서 에 의하여 수행되는 동작으로 참조될 수 있다. 프로세서는 메모리에 저장된 하나 이상의 인스트럭션 들(instructions)을 실행함으로써 전자 장치의 다양한 동작들을 수행할 수 있다. 프로세서는 메모리 에 저장된 인스트럭션들(instructions)을 실행함으로써 전자 장치가 다양한 동작들을 수행하도록 전자 장치를 제어할 수 있다. 프로세서는 하나의 프로세서 또는 복수의 프로세서들을 포함할 수 있다. 일 예에서, 프로세서는 하나의 칩셋(chipset)으로 구현될 수 있다. 메모리는 프로세서와 하나의 칩 또는 칩셋으로 구현될 수 있다. 메모리는 프로세서와 별개 의 칩으로 구현될 수 있다. 일 예에서, 메모리는 도 14의 메모리에 대응할 수 있다. 메모리는 전자 장치의 동작을 위한 다양한 정보를 저장할 수 있다. 예를 들어, 메모리는 프로세서에 의하 여 실행될 수 있는 인스트럭션들을 저장할 수 있다. 메모리는 프로세서에 의하여 요구되는 데이터를 제공하고, 프로세서에 의하여 생성된 데이터를 저장하도록 설정될 수 있다. 제1 가요성 디스플레이 및 제2 디스플레이는 복수의 픽셀들을 포함할 수 있다. 예를 들어, 제1 가요 성 디스플레이 및 제2 디스플레이는 도 14의 디스플레이 모듈에 대응할 수 있다. 제1 가요성 디스플레이 및/또는 제2 디스플레이는 터치 스크린을 포함할 수 있다. 프로세서는 제1 가요성 디스플레이 및/또는 제2 디스플레이를 이용하여 이미지를 디스플레이할 수 있다. 제1 가요성 디스플레이는 전자 장치의 언폴드 포지션에서 전자 장치의 전면에 위치된 디스플레 이로 참조될 수 있다. 제1 가요성 디스플레이는 전자 장치의 힌지 구조를 중심으로 폴드 또는 언폴드 되도록 설정된 디스플레이일 수 있다. 제1 가요성 디스플레이는 폴더블 디스플레이 또는 메인 디스플레이 로 참조될 수 있다. 제2 디스플레이는 전자 장치의 폴드 포지션에서 전자 장치의 외부로부터 볼 수 있는(viewable) 디스플레이로 참조될 수 있다. 예를 들어, 전자 장치가 인폴드 장치(예: 도 2a 내지 도 3의 예시들)일 수 있다. 이 경우, 제1 가요성 디스플레이는 힌지 구조를 중심으로 구분된 복수의 디스플레이 영역들이 서로 대면하도록 폴드될 수 있다. 인폴드 장치의 제2 디스플레이는 언폴드 포지션에서 전자 장치의 후면에 위치된 디스플레이일 수 있다. 예를 들어, 전자 장치가 아웃폴드 장치(예: 도 4의 예시)일 수 있다. 이 경 우, 제1 가요성 디스플레이는 힌지 구조를 중심으로 구분된 복수의 디스플레이 영역들이 서로 반대 방향을 향하도록 폴드될 수 있다. 제2 디스플레이는 제1 가요성 디스플레이의 일부 디스플레이 영역일 수 있 다. 제2 디스플레이는 서브 디스플레이 또는 메인 디스플레이의 서브 디스플레이 영역으로 참조될 수 있다. 디스플레이는 복수의 픽셀들을 포함할 수 있다. 예를 들어, 디스플레이는 도 10의 디스플레이 모듈 에 대응할 수 있다. 프로세서는 디스플레이를 이용하여 시각적 이미지를 디스플레이할 수 있다. 일 예에서, 디스플레이는 터치 스크린 디스플레이를 포함할 수 있다. 일 실시 예에서, 프로세서 는 디스플레이를 이용하여 배터리의 상태에 대한 정보(예: SOC 또는 SOH 중 적어도 하나에 대한 정보)를 디스플레이할 수 있다. 상술된 바와 같이, 디스플레이는 생략될 수 있다. 센서 회로는 전자 장치의 상태를 식별하기 위한 적어도 하나의 센서를 포함할 수 있다. 센서 회로 는, 예를 들어, 도 14의 센서 모듈에 대응할 수 있다. 센서 회로는 전자 장치의 폴딩 상태를 감지하도록 설정될 수 있다. 예를 들어, 센서 회로는 적 어도 하나의 가속도 센서, 적어도 하나의 자이로 센서, 및/또는 적어도 하나의 힌지 센서를 포함할 수 있다. 힌지 센서는 전자 장치의 폴딩 각도를 감지하도록 설정된 센서로 참조될 수 있다. 프로세서는 센서 회 로를 이용하여 전자 장치의 폴딩 상태를 식별할 수 있다. 폴딩 상태의 식별 방법은 도 6과 관련하여 후술될 수 있다. 센서 회로는 전자 장치의 고도를 감지하도록 설정될 수 있다. 예를 들어, 센서 회로 는 적어도 하나의 바로미터를 포함할 수 있다. 센서 회로는 전자 장치에 대한 그립 상태를 감지 하도록 설정될 수 있다. 예를 들어, 센서 회로는 적어도 하나의 그립 센서를 포함할 수 있다. 그립 센서는, 예를 들어, 정전 용량에 기반하여 전자 장치에 대한 외부 그립을 감지하거나, 도전체의 임피던스 변화에 기반하여 전자 장치에 대한 외부 그립을 감지하거나, 반사 신호에 기반하여 전자 장치에 대한 외부 그립을 감지하도록 설정될 수 있다. 예를 들어, 전자 장치는 폴더블 하우징을 갖는 임의의 전자 장치 를 포함할 수 있다. 전자 장치는 예를 들어, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티 미디어 장치, 휴대용 의료 기기, 카메라, 웨어러블 장치, 차량 내 전자 장치 또는 가전 장치 중 적어도 하나를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 장치들에 한정되지 않는다. 이하에서, 도 2a 내 지 도 4를 참조하여, 전자 장치의 다양한 예시들이 설명될 수 있다. 도 2a는 일 실시 예에 따른 언폴드 포지션에서의 전자 장치를 도시한다. 도 2b는 일 실시 예에 따른 하프-폴드 포지션에서의 전자 장치를 도시한다. 도 2c는 일 실시 예에 따른 폴드 포지션에서의 전자 장치를 도시한다. 도 2a, 도 2b, 및 도 2c를 참조하면, 일 실시 예에 따른 전자 장치(100a)는, 폴딩 영역을 통해 제1 하우징 및 제2 하우징이 서로 반대 방향으로 회전이 가능한 구조를 포함할 수 있다. 예를 들어, 전자 장치 (100a)는 도 1의 전자 장치에 대응할 수 있다. 전자 장치(100a)는 폴딩 동작(예: 도 2a, 도 2b, 도 2c 순 으로 변형되는 동작) 또는 언폴딩 동작(예: 도 2c, 도 2b, 도 2a 순으로 변형되는 동작)이 수행될 수 있다. 예 를 들어, 언폴드 포지션(예: 도 2a의 상태)으로부터 수행되는 폴딩 동작에서, 제1 하우징은 시계 방향으로 회전하고, 제2 하우징은 반시계 방향으로 회전할 수 있다. 예를 들어, 폴딩 영역은 전자 장치(100a) 의 힌지 구조가 위치된 영역에 대응하는 영역을 포함할 수 있다. 예를 들어, 제2 하우징은 제1 하우징 과 폴드 포지션(folded position) 및 언폴드 포지션(unfolded position) 사이에서 이동가능하게 또는 회 전가능하게 맞물리도록(movably or ratatbly engage with) 설정될 수 있다. 전자 장치(100a)의 언폴드 포지션(도 2a의 상태)을 기준으로, 제1 하우징의 측면 중 지문 센서의 지 문 접촉면이 향하는 방향과 같은 방향으로 향하는 면인 제1 테두리면(P1)이 규정될 수 있다. 제2 하우징의 측면 중 지문 센서의 지문 접촉면이 향하는 방향과 같은 방향으로 향하는 면인 제2 테두리면(P2)이 규정될 수 있다. 예를 들어, 제1 테두리면(P1)은 제1 하우징의 일부를 포함할 수 있고, 제2 테두리면(P2)은 제2 하우징의 일부 및 제2 하우징에 위치하는 지문 센서의 일부를 포함할 수 있다. 도 2a를 참조하여, 언폴드 포지션은, 제1 가요성 디스플레이의 폴딩 영역이 실질적으로 평편한 상태 를 의미할 수 있다. 예를 들어, 언폴드 포지션은 제1 하우징 및 제2 하우징 사이의 각도가 지정된 제 1 각도(예: 120도) 이상인 상태로 참조될 수 있다. 예를 들어, 언폴드 포지션은 제1 테두리면(P1) 및 제2 테두 리면(P2)이 실질적으로 하나의 면을 이루는 상태를 포함할 수 있다. 예를 들어, 언폴드 포지션은 제1 가요성 디 스플레이 및 제2 디스플레이가 서로 반대 방향을 향하면서 평행한 상태를 포함할 수 있다. 예를 들어, 언폴드 포지션의 전자 장치(100a)는 후면 카메라를 이용하여 획득된 이미지를 제1 가요성 디스플레 이에 디스플레이할 수 있다. 도 2b를 참조하여, 하프-폴드 포지션(또는, 중간 상태(intermediate state))은, 언폴드 포지션과 폴드 포지션 사이의 임의의 상태를 의미할 수 있다. 예를 들어, 하프-폴드 포지션은 제1 하우징과 제2 하우징 사 이의 각도가 지정된 제1 각도 미만, 지정된 제2 각도(예: 30도) 이상인 상태로 참조될 수 있다. 하프-폴드 포지 션에서, 전자 장치(100a)의 동작 모드는 테이블 모드로 참조될 수 있다. 예를 들어, 하프-폴드 포지션은 폴드 포지션 및 언폴드 포지션을 제외한 상태로 참조될 수 있다. 예를 들어, 하프-폴드 포지션은 제1 가요성 디스플 레이의 폴딩 영역이 곡면인 상태를 포함할 수 있다. 예를 들어, 하프-폴드 포지션은 제1 테두리면 (P1)의 길이 부분 및 제2 테두리면(P2)의 길이 부분이 180도가 아닌 소정의 각도를 이루는 상태를 포함할 수 있 다. 예를 들어, 하프-폴드 포지션의 전자 장치(100a)는 카메라 모듈(예: 전면 카메라 또는 후면 카메라 )를 이용하여 획득된 이미지를 제1 가요성 디스플레이의 일부 영역에 디스플레이할 수 있다. 도 2c를 참조하여, 폴드 포지션은, 제1 가요성 디스플레이의 폴딩 영역이 형성하는 곡면이 하프-폴드 포지션에서 폴딩 영역이 형성하는 곡면에 비해 더 큰 곡률을 가지는 상태를 포함할 수 있다. 예를 들어, 폴드 포지션은 제1 하우징 및 제2 하우징 사이의 각도가 지정된 제2 각도(예: 30도) 미만인 상태로 참조될 수 있다. 예를 들어, 폴드 포지션은 복수의 폴드 포지션들 중, 제1 테두리면(P1) 및 제2 테두리면(P2)이실질적으로 접촉하는 상태를 의미할 수 있다. 폴드 포지션에서, 제1 가요성 디스플레이는 전자 장치(100a)의 외부에서 보여지지 않을 수 있다. 폴드 포 지션에서, 제2 디스플레이는 전자 장치(100a)의 외부에서 보여질 수 있다. 예를 들어, 폴드 포지션의 전자 장치(100a)는 후면 카메라(예: 제1 후면 카메라(182a) 및/또는 제2 후면 카메라(182b)를 이용하여 획득된 이미지를 제2 디스플레이의 적어도 일부에 디스플레이할 수 있다. 일 실시예에 따르면, 힌지부는 하프-폴드 포지션 및 언폴드 포지션에서 적어도 일부가 전자 장치의 외관(또는, 표면)을 형성할 수 있다. 예를 들어, 도 2b 및 도 2c에 도시된 바와 같이, 힌지부는 전자 장치 (100a)가 하프-폴드 포지션 또는 폴드 포지션일 때, 제1 하우징 및 제2 하우징 사이를 통해 시각적으 로 노출될 수 있다. 도 3은 일 실시 예에 따른 폴더블 전자 장치를 도시한다. 도 3을 참조하여, 전자 장치(100b)는 도 1의 전자 장치에 대응할 수 있다. 도 2a 내지 도 2c와 관련하여, 단축에 따라서 힌지 구조가 형성된 전자 장치(100b)가 설명되었다. 도 3의 예시에서, 전자 장치(100c)의 장축에 따라서 힌지 구조가 형성될 수 있다. 전자 장치(100c)는 폴딩 영역을 중심으로 폴드 또는 언폴드될 수 있 다. 도 2a 내지 도 2c의 전자 장치(100a)와 도 3의 전자 장치(100b)는 인폴드 장치로서, 도 2a 내지 도 2c와 관 련하여 상술된 내용들은 도 3의 전자 장치(100b)에도 적용될 수 있다. 도 4는 일 실시 예에 따른 폴더블 전자 장치를 도시한다. 도 4를 참조하여, 전자 장치(100c)는 도 1의 전자 장치에 대응할 수 있다. 예를 들어, 전자 장치(100c)는 아웃폴드 장치일 수 있다. 언폴드 포지션에서, 제1 하우징과 제2 하우징의 전면을 통하여 제1 가요성 디스플레이가 보여질 수 있다. 폴드 포지션에서, 제1 하우징과 제2 하우징이 서로 마주볼 수 있 다. 폴드 포지션에서, 제2 디스플레이는 전자 장치(100c)의 일 면을 통하여 보여질 수 있다. 예를 들어, 제2 디스플레이는 제1 가요성 디스플레이의 일부 디스플레이 영역을 포함할 수 있다. 제2 디스플레이 는 폴딩 영역에 의하여 구분된 제1 가요성 디스플레이의 일 영역을 포함할 수 있다. 예를 들어, 제2 디스플레이는 제2 하우징에 위치된 디스플레이 영역일 수 있다. 예를 들어, 제2 디스플레이(16 2)는 제1 가요성 디스플레이의 디스플레이 영역들(예: 폴딩 영역에 의하여 구분되는 영역들) 중 전자 장치(100c)의 카메라(미도시)가 위치된 디스플레이 영역을 포함할 수 있다. 도 5는 일 실시 예에 따른 서비스 제공 방법의 흐름도이다. 도 1 및 도 5를 참조하여, 일 실시 예에 따르면, 전자 장치는 전자 장치의 상태 천이 시에 서비스 연 속성을 제공할 수 있다. 예를 들어, 전자 장치는 전자 장치의 디스플레이가 향하는 방향, 전자 장치 의 고도, 전자 장치의 파지 상태, 전자 장치에 대한 사용자의 방향, 실행 중인 어플리케이션의 실행 상태, 또는 실행 중인 어플리케이션의 유형 중 적어도 하나에 기반하여 서비스 연속성을 제공할 수 있다. 서비스 연속성은 전자 장치의 상태 변화시, 이전 상태에서 제공하던 서비스를 연속하여 제공하는 것을 의 미할 수 있다. 전자 장치는 전자 장치에서 실행된 어플리케이션의 컨텐츠를 제공함으로써 서비스를 제공할 수 있다. 예를 들어, 컨텐츠는 실행 중인 어플리케이션의 실행 화면 및/또는 실행 중인 어플리케이션의 음향을 포함할 수 있다. 동작 505에서, 전자 장치는 언폴드 포지션에서, 제1 가요성 디스플레이를 통하여 컨텐츠를 제공할 수 있다. 예를 들어, 전자 장치는 전자 장치에서 실행 중인 제1 어플리케이션의 실행 화면을 제1 가요성 디스플레이에 디스플레이할 수 있다. 동작 510에서, 전자 장치는 전자 장치가 폴드 포지션으로 천이하였는지 결정할 수 있다. 예를 들어, 전자 장치는 센서 회로를 이용하여 전자 장치가 언폴드 포지션으로부터 폴드 포지션으로 천이하 였는지 결정할 수 있다. 전자 장치의 포지션 천이 감지 방법은 도 6과 관련하여 후술될 수 있다. 폴드 포 지션으로 천이되지 않은 경우(예: 동작 510-NO), 전자 장치는 포지션 천이를 모니터링할 수 있다. 폴드 포지션으로 천이된 경우(예: 동작 510-YES), 동작 515에서, 전자 장치는 지정된 조건이 만족되는지 결정할 수 있다. 예를 들어, 지정된 조건은, 전자 장치의 방향, 전자 장치의 고도 변화, 전자 장치 의 파지 상태, 전자 장치에 대한 사용자의 방향, 실행 중인 어플리케이션의 실행 상태, 디스플레이의 차폐 상태, 또는 실행 중인 어플리케이션의 유형 중 적어도 하나를 포함할 수 있다. 일 예에서, 전자 장치는 언폴드 포지션에서 제1 가요성 디스플레이가 향하는 제1 방향(예: 제1 가요 성 디스플레이의 디스플레이 면에 실질적으로 수직하는 방향)을 센서 회로를 이용하여 식별할 수 있 다. 전자 장치는 폴드 포지션에서 제2 디스플레이가 향하는 제2 방향(예: 제2 디스플레이의 디 스플레이 면에 실질적으로 수직하는 방향)을 식별할 수 있다. 제1 방향이 제2 방향에 대응하는 경우, 전자 장치 는 지정된 조건이 만족된 것으로 결정할 수 있다. 제1 방향과 제2 방향 사이의 각도가 지정된 각도 이내인 경우, 제1 방향은 제2 방향에 대응할 수 있다. 제1 방향과 제2 방향이 실질적으로 동일한 경우, 제1 방향은 제2 방향에 대응할 수 있다. 전자 장치의 방향에 기반한 지정된 조건의 만족 여부 결정은, 도 7과 관련하여 후 술될 수 있다. 일 예에서, 전자 장치의 고도 변화가 지정된 값 미만이면 지정된 조건이 만족된 것으로 결정할 수 있다. 전자 장치는 언폴드 포지션에서의 전자 장치의 고도와 폴드 포지션에서의 전자 장치의 고도 차 이가 지정된 값 이상이면 지정된 조건이 만족되지 않은 것으로 결정할 수 있다. 고도 변화에 대한 조건은 예외 조건일 수 있다. 예를 들어, 다른 조건(전자 장치의 방향, 전자 장치의 파지 상태, 전자 장치에 대한 사용자의 방향, 실행 중인 어플리케이션의 실행 상태, 디스플레이의 차폐 상태, 또는 실행 중인 어플리케 이션의 유형)이 만족되더라도, 고도 조건이 만족되지 않으면 전자 장치는 지정된 조건이 만족되지 않은 것으로 결정할 수 있다. 전자 장치의 고도에 기반한 지정된 조건의 만족 여부 결정은, 도 8과 관련하여 후술 될 수 있다. 일 예에서, 전자 장치는 전자 장치의 파지 상태에 기반하여 지정된 조건의 만족 여부를 결정할 수 있 다. 폴드 포지션에서, 전자 장치는 전자 장치가 파지된 면을 감지할 수 있다. 예를 들어, 전자 장치 의 제2 하우징(예: 도 2a, 도 3, 도 4의 제2 하우징) 또는 제2 디스플레이가 보여지는 면의 적 어도 일부가 파지된 경우, 전자 장치 지정된 조건이 만족되지 않은 것으로 결정할 수 있다. 파지에 대한 조건은 예외 조건일 수 있다. 예를 들어, 다른 조건(전자 장치의 방향, 전자 장치의 고도, 전자 장치 에 대한 사용자의 방향, 실행 중인 어플리케이션의 실행 상태, 디스플레이의 차폐 상태, 또는 실행 중인 어플리케이션의 유형)이 만족되더라도, 파지 조건이 만족되지 않으면 전자 장치는 지정된 조건이 만족되지 않은 것으로 결정할 수 있다. 전자 장치의 파지에 기반한 지정된 조건의 만족 여부 결정은, 도 9와 관련하 여 후술될 수 있다. 일 예에서, 전자 장치는 전자 장치에 대한 사용자의 방향에 기반하여 지정된 조건의 만족 여부를 결 정할 수 있다. 예를 들어, 전자 장치는 폴드 포지션에서 카메라를 이용하여 사용자를 감지할 수 있다. 사 용자의 감지에 기반하여, 전자 장치는 전자 장치에 대한 사용자의 제1 방향을 식별할 수 있다. 언폴 드 포지션으로의 천이 후에, 전자 장치는 카메라를 이용하여 사용자를 감지할 수 있다. 폴드 포지션에서 감지된 사용자의 제2 방향이 언폴드 포지션에 감지된 사용자의 제1 방향에 대응하면 전자 장치는 지정된 조건이 만족된 것으로 결정할 수 있다. 제1 방향과 제2 방향 사이의 각도가 지정된 각도 이내인 경우, 제1 방향 은 제2 방향에 대응할 수 있다. 제1 방향과 제2 방향이 실질적으로 동일한 경우, 제1 방향은 제2 방향에 대응할 수 있다. 사용자의 방향에 기반한 지정된 조건의 만족 여부 결정은, 도 12와 관련하여 후술될 수 있다. 일 예에서, 전자 장치는 실행 중인 어플리케이션의 실행 상태에 기반하여 지정된 조건의 만족 여부를 결정 할 수 있다. 전자 장치는 언폴드 포지션에서의 어플리케이션의 실행 상태가 지정된 상태이면 지정된 조건 이 만족된 것으로 결정할 수 있다. 예를 들어, 실행 상태가 사용자 입력을 위한 입력 인터페이스(예: 가상 키보 드 등)가 활성화된 상태인 경우, 전자 장치는 폴드 포지션으로의 천이 후에 지정된 조건이 만족된 것으로 결정할 수 있다. 일 예에서, 전자 장치는 디스플레이의 차폐 상태에 기반하여 지정된 조건의 만족 여부를 결정할 수 있다. 전자 장치는 언폴드 포지션에서 제2 디스플레이가 차폐된 경우, 지정된 조건이 만족되지 않은 것으로 결정할 수 있다. 전자 장치는 언폴드 포지션에서 제2 디스플레이가 차폐되지 않은 경우, 지정된 조건 이 만족된 것으로 결정할 수 있다. 전자 장치는 센서 회로를 이용하여 제2 디스플레이의 차폐 여부를 식별할 수 있다. 일 예에서, 센서 회로는 제2 하우징(예: 도 2a 및 도 3의 제2 하우징)에 위 치된 근접 센서를 포함할 수 있다. 전자 장치는 근접 센서를 이용하여 제2 디스플레이가 향하는 디스 플레이 면이 외부 오브젝트에 의하여 차폐되었는지를 식별할 수 있다. 디스플레이의 차폐에 대한 조건은 예외 조건일 수 있다. 예를 들어, 다른 조건(전자 장치의 방향, 전자 장치의 고도, 전자 장치에 대한 사용자의 방향, 실행 중인 어플리케이션의 실행 상태, 또는 실행 중인 어플리케이션의 유형)이 만족되더라도, 차폐에 대한 조건이 만족되지 않으면 전자 장치는 지정된 조건이 만족되지 않은 것으로 결정할 수 있다. 예를 들어, 전자 장치는 전자 장치에서 실행 중인 어플리케이션의 유형에 기반하여 지정된 조건의 만 족 여부를 결정할 수 있다. 실행 중인 어플리케이션은, 전자 장치의 포어그라운드(foreground)에서 실행 중인 어플리케이션으로 참조될 수 있다. 전자 장치는 실행 중인 어플리케이션이 지정된 어플리케이션(예: 카메라 어플리케이션)인 경우, 지정된 조건이 만족된 것으로 결정할 수 있다. 일 예에서, 전자 장치는 상술된 조건들 중 적어도 일부를 조합하여 지정된 조건의 만족 여부를 결정할 수 있다. 예를 들어, 전자 장치는 예외 조건(예: 전자 장치의 고도 변화, 전자 장치의 파지 상태, 및 디스플레이의 차폐 상태)이 모두 만족되고 나머지 조건들(예: 전자 장치의 방향, 전자 장치에 대 한 사용자의 방향, 실행 중인 어플리케이션의 실행 상태, 또는 실행 중인 어플리케이션의 유형) 중 적어도 하나 가 만족되면 지정된 조건이 만족된 것으로 결정할 수 있다. 지정된 조건이 만족된 경우(예: 동작 515-YES), 동작 520에서, 전자 장치는 제2 디스플레이를 이용하 여 컨텐츠를 제공할 수 있다. 폴드 포지션으로의 전환 후에도 컨텐츠를 제2 디스플레이를 이용하여 제공함 으로써 서비스 연속성을 제공할 수 있다. 전자 장치는 사용자는 별다른 사용자 입력이 없이도 언폴드 포지 션에서 제공받던 서비스를 계속하여 이용할 수 있다. 이 경우, 전자 장치의 연속된 서비스를 위한 별도의 사용자 입력이 감소될 수 있다. 입력의 감소로 인하여, 사용자의 사용성이 향상될 수 있다. 지정된 조건에 기반 하여 서비스 연속성을 제공함으로써, 사용자의 의도에 부합하는 서비스가 제공될 수 있다. 컨텐츠 제공(예: 동 작 520) 이후에, 전자 장치는 레퍼런스 포인트 A에 따른 동작들을 수행할 수 있다. 레퍼런스 포인트 A에 따른 동작들은 도 10과 관련하여 후술될 수 있다. 지정된 조건이 만족되지 않은 경우(예: 동작 515-NO), 동작 525에서, 전자 장치는 제2 디스플레이를 대기 상태 또는 오프 상태로 제어할 수 있다. 대기 상태는 제2 디스플레이를 상대적으로 낮은 휘도(예: 지 정된 휘도 미만의 휘도)로 제어하는 상태로 참조될 수 있다. 대기 상태에서, 전자 장치는 제2 디스플레이 에 이미지를 낮은 휘도로 디스플레이할 수 있다. 대기 상태는 저전력 상태로 참조될 수 있다. 오프 상태는 제2 디스플레이를 통하여 이미지를 디스플레이하지 않는 상태 또는 제2 디스플레이를 이용하여 이미 지를 디스플레이하지 않는 상태로 참조될 수 있다. 제2 디스플레이의 제어(예: 동작 525) 이후에, 전자 장 치는 레퍼런스 포인트 B에 따른 동작들을 수행할 수 있다. 레퍼런스 포인트 B에 따른 동작들은 도 11과 관 련하여 후술될 수 있다. 도 6은 일 실시 예에 따른 센서 회로 배치를 도시한다. 도 1 및 도 6을 참조하여, 일 실시 예에 따르면, 센서 회로는 복수의 센서들을 포함할 수 있다. 예를 들어, 센서 회로는 제1 관성 센서, 제2 관성 센서, 또는 각도 센서 중 적어도 하나를 포함 할 수 있다. 제1 관성 센서 및 제2 관성 센서 각각은 적어도 하나의 자이로 센서 및/또는 적어도 하나의 가속도 센서를 포함할 수 있다. 제1 관성 센서는 제1 하우징 내에 위치될 수 있다. 전자 장치는 제1 관 성 센서를 이용하여 제1 하우징 또는 제1 가요성 디스플레이의 배향(orientation)을 감지할 수 있다. 제2 관성 센서는 제2 하우징 내에 위치될 수 있다. 전자 장치는 제2 관성 센서를 이 용하여. 제2 하우징, 제1 가요성 디스플레이, 또는 제2 디스플레이의 배향을 감지할 수 있다. 본 개시에서, “배향”은 중력 가속도 방향에 대한 상대적인 방향으로 참조될 수 있다. 각도 센서는 제1 하우징과 제2 하우징 사이의 각도를 식별하도록 설정될 수 있다. 예를 들어, 각도 센서는 폴딩 영역에 위치된 힌지 구조물 내의 기어의 회전을 감지하여 제1 하우징과 제2 하우징 사이의 각도를 식별할 수 있다. 예를 들어, 각도 센서는 자력에 기반하여 제1 하우징과 제2 하우징 사이의 각도를 식별할 수 있다. 각도 센서는 제1 하우징과 제2 하우징 중 하나 의 하우징에 위치된 자력원과 나머지 하우징에 위치된 자력을 감지하도록 설정된 자력 센서(예: Hall IC)를 포 함할 수 있다. 각도 센서는 자력 센서를 이용하여 자력원에 의한 자력을 감지하여 제1 하우징과 제2 하우징 사이의 각도를 측정할 수 있다. 일 예시에서, 제1 관성 센서 또는 제2 관성 센서 중 하나는 생략될 수 있다. 예를 들어, 제2 관성 센 서가 생략되는 경우, 전자 장치는 제1 관성 센서에 의하여 측정된 제1 하우징의 배향과 각 도 센서에 의하여 감지된 각도에 기반하여 제2 하우징의 배향을 식별할 수 있다. 일 예시에서, 각도 센서는 생략될 수 있다. 예를 들어, 전자 장치는 제1 관성 센서에 의하여 측 정된 제1 하우징의 배향과 제2 관성 센서에 의하여 측정된 제2 하우징의 배향을 비교함으로써 제1 하우징과 제2 하우징 사이의 각도를 식별할 수 있다. 일 실시 예에 따르면, 전자 장치는 센서 회로를 이용하여 전자 장치의 상태 천이를 감지(예: 도 5의 동작 510)할 수 있다. 예를 들어, 전자 장치는 제1 하우징과 제2 하우징 사이의 각도 변화 를 식별함으로써 언폴드 포지션으로부터 폴드 포지션으로의 천이를 감지할 수 있다. 예를 들어, 전자 장치(10 0)는 제1 하우징 또는 제2 하우징 중 적어도 하나의 배향 변화를 감지하여 언폴드 포지션으로부터 폴 드 포지션으로의 천이를 감지할 수 있다. 도 7은 일 실시 예에 따른 전자 장치의 포지션 천이를 도시한다. 도 1 및 도 7을 참조하여, 전자 장치는 언폴드 포지션으로부터 폴드 포지션으로 천이될 수 있다. 일 실시 예에서, 언폴드 포지션의 전자 장치는 센서 회로를 이용하여 제1 방향을 식별할 수 있다. 예를 들어, 전자 장치는 도 6과 관련하여 상술된 방법들에 따라서 제1 방향을 식별할 수 있다. 제1 방향 은 언폴드 포지션에서 제1 가요성 디스플레이가 향하는 방향(예: 제1 가요성 디스플레이의 디스 플레이 면에 실질적으로 수직한 방향)으로 참조될 수 있다. 제1 방향은, 전면 카메라가 향하는 방향 으로 참조될 수 있다. 일 실시 예에서, 폴드 포지션의 전자 장치는 센서 회로를 이용하여 제2 방향을 식별할 수 있다. 예를 들어, 전자 장치는 도 6과 관련하여 상술된 방법들에 따라서 제2 방향(예: 제2 디스플레이(16 2)의 디스플레이 면에 실질적으로 수직한 방향)을 식별할 수 있다. 제2 방향은 폴드 포지션에서 제2 디스 플레이가 향하는 방향으로 참조될 수 있다. 제2 방향은 후면 카메라가 향하는 방향으로 참조될 수 있다. 일 실시 예에 따르면, 전자 장치는 센서 회로를 천이 이전과 이후의 디스플레이 방향을 식별할 수 있 다. 예를 들어, 전자 장치는 언폴드 포지션에서 폴드 포지션으로의 천이가 시작되는 제1 시점에서 제1 방 향을 감지할 수 있다. 전자 장치는 배향의 변화 또는 각도의 변화에 기반하여 천이의 시작을 감지할 수 있다. 천이가 시작되는 제1 시점에서, 전자 장치는 언폴드 포지션에서 제1 가요성 디스플레이가 향하는 제1 방향을 식별할 수 있다. 전자 장치는 센서 회로(예: 도 6의 제1 관성 센서 또 는 제2 관성 센서)를 이용하여 제1 방향을 식별할 수 있다. 예를 들어, 전자 장치는 폴드 포지 션으로의 천이가 완료된 제2 시점에서 제2 방향을 감지할 수 있다. 전자 장치는 하우징의 배향 또는 각도 에 기반하여 천이의 완료를 감지할 수 있다. 천이가 완료된 제2 시점에서, 전자 장치는 폴드 포지션에서 제2 디스플레이가 향하는 제2 방향을 식별할 수 있다. 전자 장치는 제1 관성 센서 또는 제 2 관성 센서를 이용하여 제2 방향을 식별할 수 있다. 전자 장치는 제1 방향과 제2 방향에 기반하여 지정된 조건의 만족 여부를 결정(예: 도 5의 동작 515)할 수 있다. 예를 들어, 제1 방향이 제2 방향에 대응하는 경우, 전자 장치는 지정된 조건이 만족된 것으로 결정할 수 있다. 제1 방향과 제2 방향 사이의 각도가 지정된 각도 이내인 경우, 제1 방향 은 제2 방향에 대응할 수 있다. 제1 방향과 제2 방향이 실질적으로 동일한 경우, 제1 방향(70 1)은 제2 방향에 대응할 수 있다. 도 8은 전자 장치의 고도 변화의 일 예시를 도시한다. 도 1 및 도 8을 참조하여, 일 실시 예에 따르면, 전자 장치는 전자 장치의 고도 변화에 기반하여 지정된 조건의 만족 여부를 결정(예: 도 5의 동작 515)할 수 있다. 예를 들어, 전자 장치는 센서 회로에 포 함된 기압계 또는 고도계를 이용하여 전자 장치의 고도 변화를 감지할 수 있다. 예를 들어, 전자 장치는 언폴드 포지션에서 폴드 포지션으로의 천이가 시작되는 제1 시점에서 전자 장치 의 제1 고도를 감지할 수 있다. 전자 장치는 배향의 변화 또는 각도의 변화에 기반하여 천이의 시작 을 감지할 수 있다. 천이가 시작되는 제1 시점에서, 전자 장치는 언폴드 포지션에서 전자 장치의 제1 고도를 감지할 수 있다. 예를 들어, 전자 장치는 폴드 포지션으로의 천이가 완료된 제2 시점에서 제2 고도 를 감지할 수 있다. 전자 장치는 제1 고도와 제2 고도에 기반하여 지정된 조건의 만족 여부를 결정(예: 도 5의 동작 515)할 수 있다. 예를 들어, 제1 고도와 제2 고도 사이의 차이가 지정된 값 미만인 경우, 전자 장치는 지정된 조건이 만족된 것으로 결정할 수 있다. 제1 고도와 제2 고도 사이의 차이가 지정된 값 이상인 경우, 전자 장치는 지정된 조건이 만족되지 않은 것으로 결정할 수 있다. 전자 장치의 상태 천이 전과 후에 고도 변화가 큰 것은 사용자의 사용 의사가 없음을 의미할 수 있다. 일 예에서, 고도의 변이에 대한 조건은 예외 조건일 수 있다. 예를 들어, 고도의 변이에 대한 조건이 만족되고, 나머지 조건들(예: 전자 장치의 방향, 전자 장치에 대한 사용자의 방향, 실행 중인 어플리케이션의 실행 상태, 또는 실행 중인 어플리케이션의 유형) 중 적어도 하나가 만족될 때, 전자 장치는 지정된 조건이 만족된 것으로 결정할 수 있다. 도 8과 관련하여, 고도를 감지함으로써 고도 변화를 감지하는 방법이 상술되었으나, 본 개시의 실시예들이 이에 제한되는 것은 아니다. 일 실시 예에 따르면, 전자 장치는 전자 장치의 가속도 변화에 기반하여 지정된 조 건의 만족 여부를 결정(예: 도 5의 동작 515)할 수 있다. 예를 들어, 전자 장치는 센서 회로에 가속 도계를 이용하여 전자 장치의 가속도 변화를 감지할 수 있다. 예를 들어, 전자 장치는 언폴드 포지션 에서 폴드 포지션으로의 천이가 시작되는 제1 시점으로부터 전자 장치의 가속도 변화를 감지할 수 있다. 사용자가 전자 장치를 내려 놓는 경우, 전자 장치는 가속도 변화를 감지할 수 있다. 예를 들어, 전자 장치는 가속도 변화에 기반하여 상술된 고도 변화를 감지할 수 있다. 예를 들어, 전자 장치는 가속도 변화를 시간 축 상에서 감지함으로써, 전자 장치의 고도 변화를 식별할 수 있다. 상술된 바와 같이, 전자 장치는 고도 변화에 기반하여 지정된 조건의 만족 여부를 결정(예: 도 5의 동작 515)할 수 있다. 일 예에서, 전자 장치는 가속도 변화량에 기반하여 지정된 조건의 만족 여부를 결정(예: 도 5의 동작 51 5)할 수 있다. 예를 들어, 사용자가 전자 장치를 내리거나 책상에 올려두는 경우, 가속도 변화가 일정시간 발생한 뒤, 가속도 변화가 사라질 수 있다. 전자 장치는 상기 제1 시점으로부터 감지된 가속도 변화의 패 턴이 상술된 예시(예: 전자 장치가 내려지거나 책상에 놓이는 경우 등)에 해당하는 경우, 지정된 조건이 만족된 것으로 결정할 수 있다. 일 예에서, 가속도에 대한 조건은 예외 조건일 수 있다. 예를 들어, 가속도에 대한 조건이 만족되고, 나머지 조건들(예: 전자 장치의 방향, 전자 장치에 대한 사용자의 방향, 실행 중인 어플리케이션의 실행 상태, 또는 실행 중인 어플리케이션의 유형) 중 적어도 하나가 만족될 때, 전자 장치 는 지정된 조건이 만족된 것으로 결정할 수 있다. 도 9는 일 실시 예에 따른 전자 장치의 파지 형태를 도시한다. 도 1 및 도 9를 참조하여, 일 실시 예에 따르면, 전자 장치는 전자 장치의 파지에 기반하여 지정된 조건의 만족 여부를 결정(예: 도 5의 동작 515)할 수 있다. 예를 들어, 전자 장치는 센서 회로에 포함된 그 립 센서를 이용하여 전자 장치에 대한 파지 상태를 감지할 수 있다. 예를 들어, 전자 장치는 언폴드 포지션에서 폴드 포지션으로의 천이가 완료되는 시점에 센서 회로를 이용하여 파지 상태를 감지할 수 있다. 예를 들어, 센서 회로는 안테나를 이용하여 신호를 방사하고, 반사 신호를 감지하여 파지 상태를 감 지할 수 있다. 예를 들어, 센서 회로는 정전 용량의 변화를 감지하여 파지 상태를 감지할 수 있다. 일 예 에서, 전자 장치는 제2 디스플레이의 터치 회로를 이용하여 제2 디스플레이에 대한 파지 상태를 감지할 수 있다. 예를 들어, 사용자에 의하여 파지된 면은, 제1 하우징과 제2 하우징 중 상대적 으로 많은 면에서 파지가 감지된 하우징의 표면으로 참조될 수 있다. 일 예에서, 전자 장치는 전자 장치의 파지 상태에 기반하여 지정된 조건의 만족 여부를 결정할 수 있 다. 폴드 포지션에서, 전자 장치는 전자 장치가 파지된 면을 감지할 수 있다. 예를 들어, 전자 장치 의 제2 하우징 또는 제2 디스플레이가 보여지는 면의 적어도 일부가 파지된 경우, 전자 장치 지정된 조건이 만족되지 않은 것으로 결정할 수 있다. 파지에 대한 조건은 예외 조건일 수 있다. 예를 들 어, 다른 조건(예: 전자 장치의 방향, 전자 장치의 고도, 전자 장치에 대한 사용자의 방향, 실 행 중인 어플리케이션의 실행 상태, 디스플레이의 차폐 상태, 또는 실행 중인 어플리케이션의 유형)이 만족되더 라도, 파지 조건이 만족되지 않으면 전자 장치는 지정된 조건이 만족되지 않은 것으로 결정할 수 있다. 도 10은 일 실시 예에 따른 연속된 서비스 제공 방법의 흐름도이다. 도 1 및 도 10을 참조하여, 전자 장치는 연속된 컨텐츠의 제공(예: 도 5의 동작 520) 후에, 도 10의 동작 들을 수행할 수 있다. 동작 1005에서, 전자 장치는 언폴드 포지션으로의 천이 여부를 결정할 수 있다. 예를 들어, 전자 장치 는 센서 회로를 이용하여 천이 여부를 결정할 수 있다. 언폴드 포지션으로 천이되는 경우(예: 동작 1005-YES), 동작 1020에서, 전자 장치는 제1 가요성 디스플레이를 통하여 컨텐츠를 제공할 수 있다. 폴드 포지션에서 서비스가 제공되는 상황에서 전자 장치가 언폴드 포지션으로 천이되면, 사용자의 의도는 제1 가요성 디스플레이를 통한 컨텐츠 제공을 포함할 수 있다. 언폴드 포지션으로 천이되지 않는 경우(예: 동작 1005-NO), 동작 1010에서, 전자 장치는 종료 입력이 수신 되는지 결정할 수 있다. 예를 들어, 전자 장치의 물리적 버튼에 대한 입력이 수신되면, 전자 장치는 종료 입력이 수신된 것으로 결정할 수 있다. 일 예에서, 도 5의 동작 520이 수행되면, 전자 장치는 제2 디스플레이의 일 영역에 컨텐츠 제공을 종료시키기 위한 사용자 인터페이스(예: 아이콘 또는 버튼)을 디스플 레이할 수 있다. 사용자 인터페이스에 대한 입력이 수신되면, 전자 장치는 종료 입력이 수신된 것으로 결 정할 수 있다. 일 예에서, 전자 장치는 폴드 포지션으로의 천이 후 지정된 시간 동안만 종료를 위한 사용 자 인터페이스를 디스플레이할 수 있다. 종료 입력이 수신되지 않는 경우(예: 동작 1010-NO), 전자 장치는 상태 천이 및 종료 입력의 수신 여부를 모니터링할 수 있다. 종료 입력이 수신된 경우(예: 동작 1010-YES), 동작 1015에서, 전자 장치는 제2 디스플레이를 대기 상태 또는 오프 상태로 제어할 수 있다. 이 경우, 전자 장치는 실행 중이던 어플리케이션을 종료시키거나 어플리케이션을 백그라운드에서 실행시킬 수 있다. 도 11은 일 실시 예에 따른 연속된 서비스 제공 방법의 흐름도이다. 도 1 및 도 11을 참조하여, 전자 장치는 제2 디스플레이의 제어(예: 도 5의 동작 525) 후에, 도 11의 동작들을 수행할 수 있다. 동작 1105에서, 전자 장치는 제1 어플리케이션이 지정된 어플리케이션인지 결정할 수 있다. 예를 들어, 지 정된 어플리케이션은 멀티미디어 컨텐츠를 제공하는 어플리케이션(예: 동영상 재생 어플리케이션, 동영상 스트 리밍 어플리케이션, 또는 게임 어플리케이션 등)일 수 있다. 멀티미디어 컨텐츠는 오디오 컨텐츠 및 비디오 컨 텐츠를 포함하는 컨텐츠로 참조될 수 있다. 일 예에서, 지정된 어플리케이션은 사용자 또는 제조사에 의하여 설 정된 어플리케이션을 포함할 수 있다. 일 예에서, 동작 1105는 생략될 수 있다. 이 경우, 동작 1105 및 동작 1115는 도 11의 동작들로부터 생략될 수 있다. 제1 어플리케이션이 지정된 어플리케이션인 경우(예: 동작 1105-YES), 동작 1115에서, 전자 장치는 컨텐츠 의 일부를 제공할 수 있다. 예를 들어, 전자 장치는 제1 어플리케이션의 실행 상태를 유지하되, 실행 화면 의 제공을 중단하거나 실행 성능을 하향시킬 수 있다. 예를 들어, 전자 장치는 제1 어플리케이션을 백그라 운드에서 실행시킬 수 있다. 예를 들어, 제1 어플리케이션이 동영상 재생 어플리케이션 또는 동영상 스트리밍 어플리케이션인 경우, 전자 장 치는 제1 어플리케이션의 컨텐츠 중 오디오 컨텐츠를 제공할 수 있다. 전자 장치는 제2 디스플레이 를 대기 상태 또는 오프 상태로 제어하고, 제1 어플리케이션의 실행 화면을 제공하지 않을 수 있다. 예를 들어, 제1 어플리케이션이 게임 어플리케이션 경우, 전자 장치는 제1 어플리케이션의 실행 화면을 낮 은 밝기로 제공할 수 있다. 예를 들어, 전자 장치는 대기 상태의 제2 디스플레이에 실행 화면을 디스 플레이할 수 있다. 이 경우, 전자 장치는 제1 어플리케이션에 대한 우선 모드(예: 게임 어플리케이션에 대 한 프로세싱 성능 향상 모드)를 해제할 수 있다. 제1 어플리케이션이 지정된 어플리케이션이 아닌 경우(예: 동작 1105-NO), 동작 1110에서, 전자 장치는 제 1 어플리케이션의 프로세스를 유예(suspend)하고, 타이머를 시작할 수 있다. 프로세스의 유예는 프로세스의 실 행 상태가 보존된 상태를 의미할 수 있다. 프로세스가 유예되면, 프로세스는 백그라운드에서 실행될 수 있다. 일 예에서, 타이머는 지정된 길이(예: 5초)를 가질 수 있다. 예를 들어, 제1 어플리케이션이 인터넷 브라우저인 경우, 전자 장치는 동작 1110을 수행할 수 있다. 동작 1120에서, 전자 장치는 타이머 만료 전에 지정된 입력이 수신되는지 결정할 수 있다. 예를 들어, 지 정된 입력은 언폴드 포지션으로의 천이 또는 제2 디스플레이의 방향 전환을 포함할 수 있다. 타이머의 만 료 전에 전자 장치가 다시 언폴드되는 경우, 사용자는 제1 어플리케이션을 계속하여 이용하기 원할 수 있 다. 타이머의 만료 전에, 전자 장치의 제2 디스플레이가 향하는 방향이 언폴드 포지션에서의 제1 가 요성 디스플레이가 향하는 제1 방향으로 전화될 수 있다. 이 경우, 사용자는 전자 장치를 뒤집음으로 써 제2 디스플레이를 통하여 제1 어플리케이션을 계속하여 이용하기 원할 수 있다. 지정된 입력이 수신되면(예: 동작 1120-YES), 동작 1120에서, 전자 장치는 제1 가요성 디스플레이 또 는 제2 디스플레이를 통하여 컨텐츠를 제공할 수 있다. 예를 들어, 타이머의 만료전에 전자 장치가 다시 언폴드될 수 있다. 이 경우, 전자 장치는 제1 가요성 디스플레이를 통하여 제1 어플리케이션의 컨텐츠를 제공할 수 있다. 예를 들어, 타이머의 만료전에 제2 디스플레이의 방향이 제1 방향(예: 도 7의 제1 방향)에 대응하도록 전자 장치의 배향이 변경되면, 전자 장치는 제2 디스플레이를 통 하여 제1 어플리케이션의 컨텐츠를 제공할 수 있다. 지정된 입력이 수신되지 않으면(예: 동작 1120-NO), 동작 1130에서, 전자 장치는 제1 어플리케이션의 프로 세스를 종료시킬 수 있다. 예를 들어, 전자 장치는 타이머가 만료되면 프로세스를 종료시킬 수 있다. 도 12는 하프-폴드 포지션으로의 천이의 일 예시를 도시한다. 도 1 및 도 12를 참조하여, 일 실시 예에 따르면, 전자 장치는 하프-폴드 포지션으로의 천이 시에 서비스 연속성을 제공할 수 있다. 도 1 내지 도 11과 관련하여, 언폴드 포지션으로부터 폴드 포지션으로의 천이 시의 서비스 연속성 제공 방법들이 설명되었다. 그러나, 본 언폴드 포지션으로부터 하프-폴드 포지션으로 천이되는 경우에도, 전자 장치는 상술한 방법들을 수행할 수 있다. 예를 들어, 사용자는 언폴드 포지션의 전자 장치를 이용하여 카메라 어플리케이션을 실행시킬 수 있 다. 전자 장치는 제1 가요성 디스플레이를 통하여 카메라 어플리케이션의 컨텐츠(예: 프리뷰 화면 및 UI)를 제공할 수 있다. 사용자는 전면 카메라를 이용하여 셀피를 촬영할 수 있다. 전자 장치는 언폴드 포지션에서, 센서 회로를 이용하여 제1 방향(예: 도 7의 제1 방향)을 식별할 수 있다. 전자 장치는 전면 카메라를 이용하여 획득된 이미지로부터 사용자를 식별할 수 있다. 예를 들 어, 전자 장치는 이미지 인식에 기반하여 사용자를 식별할 수 있다. 사용자는 전자 장치를 하프-폴드 포지션으로 천이시킬 수 있다. 전자 장치는 센서 회로를 이용하여 포지션 천이를 감지하 수 있다. 전자 장치는 포지션 천이에 응답하여 지정된 조건의 만족 여부를 결정(예: 도 5의 동작 515)할 수 있다. 예를 들어, 전자 장치는 하프-폴드 포지션에서, 센서 회로를 이용하여 제2 방향(예: 도 7의 제 2 방향)을 식별할 수 있다. 전자 장치는 후면 카메라를 이용하여 획득된 이미지로부터 사용자 를 식별할 수 있다. 일 예에서, 전자 장치는 제1 방향이 제2 방향에 대응하면 지정된 조건이 만족된 것으로 결정 할 수 있다. 일 예에서, 전자 장치는 제1 방향과 제2 방향에 대응하고, 후면 카메라를 이용하여 획득된 이미지로부터 사용자가 식별되면 지정된 조건이 만족된 것으로 결정할 수 있다. 지정된 조건이 만족된 경우, 전자 장치는 제2 디스플레이를 통하여 카메라 어플리케이션의 컨텐츠를 제공(예: 도 5의 동작 520)할 수 있다. 전자 장치는 제2 디스플레이를 통하여 후면 카메라를 이 용하여 획득된 이미지를 제2 디스플레이를 통하여 제공할 수 있다. 도 13은 일 실시 예에 따른 컨텐츠 제공 방법의 흐름도이다. 일 실시 예에 따른 전자 장치(예: 도 1의 전자 장치, 도 2a 내지 도 2c의 전자 장치(100a), 도 3의 전자 장치(100b))는 폴드 포지션의로의 천이에 기반하여 컨텐츠를 제공할 수 있다. 전자 장치의 하우징은 제1 하우징 (예: 도 2a 내지 도 3의 제1 하우징) 및 상기 제1 하우징과 폴드 포지션(folded position) 및 언폴드 포 지션(unfolded position) 사이에서 회전가능하게 맞물리도록(rotatably engage with) 설정된 제2 하우징(예: 도 2a 내지 도 3의 제2 하우징)을 포함할 수 있다. 전자 장치는, 언폴드 포지션에서 하우징의 전면(front side)으로부터 보여지는(visible) 제1 가요성 디스플레이(예: 도 1의 제1 가요성 디스플레이) 및 언폴드 포지션에서 하우징의 후면으로부터 보여지는 제2 디스플레이(예: 도 1의 제2 디스플레이)를 포함할 수 있 다. 전자 장치는, 하우징의 폴드 포지션 및 언폴드 포지션 사이의 천이(transition)를 감지하고, 하우징의 방향 을 감지하도록 설정된 적어도 하나의 센서 회로(예: 도 1의 센서 회로)를 포함할 수 있다. 전자 장치는, 제1 가요성 디스플레이, 제2 디스플레이, 및 적어도 하나의 센서 회로와 전기적으로 연결된 프로세서(예: 도 1 의 프로세서)를 포함할 수 있다. 전자 장치는 프로세서와 전기적으로 연결된 메모리(예: 도 1의 메모리 )를 포함할 수 있다. 메모리는 프로세서에 의하여 실행되었을 때 프로세서로 하여금 후술하는 동작들을 수 행하도록 하는 인스트럭션들을 저장할 수 있다. 동작 1305에서, 전자 장치는 언폴드 포지션에서 제1 가요성 디스플레이를 통하여 컨텐츠를 제공할 수 있다. 예 를 들어, 전자 장치는 제1 어플리케이션을 실행함으로써 제1 어플리케이션에 대응하는 컨텐츠를 제공할 수 있다. 동작 1305는 도 5의 동작 505에 대응할 수 있다. 동작 1310에서, 전자 장치는 폴드 포지션으로의 천이를 감지할 수 있다. 전자 장치는 적어도 하나의 센서 회로 를 이용하여 전자 장치의 언폴드 포지션에서 폴드 포지션으로 천이를 감지할 수 있다. 예를 들어, 동작 1310은 도 5의 동작 510에 대응할 수 있다. 동작 1315에서, 전자 장치는 폴드 포지션에서 제2 디스플레이가 향하는 제2 방향을 식별할 수 있다. 예를 들어, 전자 장치는 언폴드 포지션으로부터 상기 폴드 포지션으로의 천이가 시작되는 시점에서, 적어도 하나의 센서를이용하여 제1 방향(예: 도 7의 제1 방향)을 획득(acquire)할 수 있다. 전자 장치는 언폴드 포지션으로부 터 상기 폴드 포지션으로의 천이가 완료된 시점에서, 적어도 하나의 센서를 이용하여 제2 방향(예: 도 7의 제2 방향)을 획득할 수 있다. 예를 들어, 전자 장치는 도 6 및 도 7과 관련하여 상술된 방법들에 따라서 제1 방향과 제2 방향을 획득할 수 있다. 동작 1320에서, 전자 장치는 제2 방향이 제1 방향에 대응하는지 결정(예: 도 5의 동작 515)할 수 있다. 제1 방 향과 제2 방향 사이의 각도가 지정된 각도 이내인 경우, 제1 방향은 제2 방향에 대응할 수 있다. 제1 방향과 제 2 방향이 실질적으로 동일한 경우, 제1 방향은 제2 방향에 대응할 수 있다. 제2 방향이 제1 방향에 대응하는 경우(예: 동작 1320-YES), 동작 1325에서, 전자 장치는 제2 디스플레이를 통하 여 컨텐츠를 제공할 수 있다. 예를 들어, 동작 1320은 도 5의 동작 520에 대응할 수 있다. 제2 방향이 제1 방향에 대응하지 않는 경우(예: 동작 1320-NO), 동작 1330에서, 전자 장치는 제2 디스플레이를 대기 상태 또는 오프 상태로 제어하고, 제1 어플리케이션의 실행 상태를 지정된 시간 구간 동안 유지할 수 있다. 예를 들어, 동작 1330은 도 5의 동작 525에 대응할 수 있다. 제2 방향이 제1 방향에 대응하지 않고, 제1 어플리케이션이 지정된 어플리케이션이 아니면, 전자 장치는 제2 디스플레이를 대기 상태 또는 오프 상태로 제 어하고 지정된 시간 구간에 대응하는 타이머를 시작(예: 도 11의 동작 1110)할 수 있다. 제2 방향이 제1 방향 에 대응하지 않고, 제1 어플리케이션이 지정된 어플리케이션이면, 전자 장치는 제2 디스플레이를 대기 상태 또 는 오프 상태로 제어하고 제1 어플리케이션에 대응하는 오디오 컨텐츠를 출력(예; 도 11의 동작 1115)할 수 있 다. 지정된 시간 구간 내에 지정된 입력이 수신되지 않으면, 전자 장치는 제1 어플리케이션을 종료(예: 도 11의 동작 1130)시킬 수 있다. 예를 들어, 지정된 시간 구간 내에 지정된 입력이 수신되면, 전자 장치는 제2 디스플레이를 통하여 제1 어플리 케이션에 대응하는 컨텐츠를 제공(예: 도 11의 동작 1125)할 수 있다. 지정된 입력은, 폴드 포지션으로의 천이 후, 제2 디스플레이가 향하는 방향의 제1 방향에 대응하는 방향으로의 변경을 포함할 수 있다. 예를 들어, 지정된 시간 구간 내에 지정된 입력이 수신되면, 전자 장치는 제1 가요성 디스플레이를 통하여 제1 어플리케이션에 대응하는 컨텐츠를 제공(예: 도 11의 동작 1125)할 수 있다. 지정된 입력은, 폴드 포지션으로의 천이 후, 하우징의 폴드 포지션으로부터 언폴드 포지션의로의 천이를 포함할 수 있다. 일 예에서, 적어도 하나의 센서 회로는 전자 장치의 고도를 감지하도록 설정될 수 있다. 전자 장치는 폴드 포지 션으로의 천이 전의 제1 고도와 폴드 포지션으로의 천이 이후의 제2 고도 사이의 차이가 지정된 값 이상이면 제 1 어플리케이션을 종료시킬 수 있다. 일 예에서, 적어도 하나의 센서 회로는 전자 장치에 대한 파지를 감지하도록 설정될 수 있다. 전자 장치는 폴드 포지션으로의 천이 이후에 제2 하우징 또는 제2 디스플레이가 위치된 면이 파지된 것으로 식별되면, 제1 어플리 케이션을 종료시킬 수 있다. 일 예에서, 적어도 하나의 센서 회로는 제2 디스플레이에 대한 차폐를 감지하도록 설정될 수 있다. 전자 장치는 폴드 포지션으로의 천이 이후에 제2 디스플레이의 적어도 일부가 차폐된 것으로 식별되면 제1 어플리케이션을 종료시킬 수 있다. 도 14는, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 14를 참조하면, 네트워크 환경에서 전자 장치는 제1 네트워크(예: 근거리 무선 통신 네트워크)를 통하여 전자 장치와 통신하거나, 또는 제2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전 자 장치 또는 서버 중 적어도 하나 와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 서 버를 통하여 전자 장치와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈, 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모 듈, 인터페이스, 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈, 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실 시예에서는, 전자 장치에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이 상의 다른 구성요소가 추가될 수 있다. 어떤 실시예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카 메라 모듈, 또는 안테나 모듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데 이터 처리 또는 연산을 수행할 수 있다. 일실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세서는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발 성 메모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘 발성 메모리에 저장할 수 있다. 일실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처 리 장치 또는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로 세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능에 특화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일 부로서 구현될 수 있다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세 서를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로 세서와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센 서 모듈, 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일실시예 에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일실시예에 따 르면, 보조 프로세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능 모델이 수행 되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi-supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경 망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포 함할 수 있다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관 련된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도 로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일실시예에 따르면, 리시버는 스피커 와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레 이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로를 포함할 수 있다. 일실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또 는 상기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일실시 예에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰) 를 통해 소리를 출력할 수 있다.센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태)를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일실시예에 따르면, 인터페이스 는, 예를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥 터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일실시예에 따르면, 카메라 모듈은 하나 이 상의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일실시예에 따르면, 전력 관리 모 듈은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일실시예에 따르면, 배터 리는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버 ) 간의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접 (예: 유선) 통신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일실시예에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워크) 또는 제2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트 워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제1 네트워크 또는 제2 네트워크와 같은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외 부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제2 네트워크)에 규정되는 다양한 요구사 항을 지원할 수 있다. 일실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-planelatency(예: 다운링크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일실시예에 따르면, 안테나 모듈은 복수의 안테나 들(예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제1 네트워크 또는 제2 네트워크와 같은 통 신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통 신 모듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다 른 부품(예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있 다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제1 면(예: 아래 면)에 또는 그에 인접하여 배치 되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일실시예에 따르면, 명령 또는 데이터는 제2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(1402, 또는 1404) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일실시예에 따르면, 전자 장치에서 실행되는 동작들 의 전부 또는 일부는 외부의 전자 장치들(1402, 1404, 또는 1408) 중 하나 이상의 외부의 전자 장치들에서 실행 될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부 터의 요청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신 에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일 부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일실시예에 따르면, 외부의 전자 장치 또는 서버는 제2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서 비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 본 문서에 개시된 다양한 실시예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되 지 않는다. 본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제1\", \"제2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위 해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제1) 구성요소가 다른(예: 제2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없 이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으 로(예: 유선으로), 무선으로, 또는 제3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 다양한 실시예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함 할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부 가 될 수 있다. 예를 들면, 일실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형 태로 구현될 수 있다. 본 문서의 다양한 실시예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨 어(예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행 될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형태로 제공될 수 있다. 여기서, ‘비일시적’은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전자기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경우와 임시적으로 저장되는 경우를 구분하지 않는다. 일실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory(CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어™)를 통해 또는 두 개의 사용자 장치들(예: 스마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨 터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같 은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상 의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따르면, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동 작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다.도면 도면1 도면2a 도면2b 도면2c 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13 도면14"}
{"patent_id": "10-2023-0099786", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시 예에 따른 전자 장치의 블록도이다. 도 2a는 일 실시 예에 따른 언폴드 포지션에서의 전자 장치를 도시한다. 도 2b는 일 실시 예에 따른 하프-폴드 포지션에서의 전자 장치를 도시한다. 도 2c는 일 실시 예에 따른 폴드 포지션에서의 전자 장치를 도시한다. 도 3은 일 실시 예에 따른 폴더블 전자 장치를 도시한다. 도 4는 일 실시 예에 따른 폴더블 전자 장치를 도시한다. 도 5는 일 실시 예에 따른 서비스 제공 방법의 흐름도이다. 도 6은 일 실시 예에 따른 센서 회로 배치를 도시한다. 도 7은 일 실시 예에 따른 전자 장치의 포지션 천이를 도시한다. 도 8은 전자 장치의 고도 변화의 일 예시를 도시한다. 도 9는 일 실시 예에 따른 전자 장치의 그립 형태를 도시한다. 도 10은 일 실시 예에 따른 연속된 서비스 제공 방법의 흐름도이다. 도 11은 일 실시 예에 따른 연속된 서비스 제공 방법의 흐름도이다. 도 12는 하프-폴드 포지션으로의 천이의 일 예시를 도시한다. 도 13은 일 실시 예에 따른 컨텐츠 제공 방법의 흐름도이다. 도 14는 네트워크 환경 내의 전자 장치의 블록도이다. 도면의 설명과 관련하여, 동일 또는 유사한 구성요소에 대해서는 동일 또는 유사한 참조 부호가 사용될 수 있다."}
