{"patent_id": "10-2019-7023571", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0117360", "출원번호": "10-2019-7023571", "발명의 명칭": "이동단말기 및 그 제어 방법", "출원인": "엘지전자 주식회사", "발명자": "강재용"}}
{"patent_id": "10-2019-7023571", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "이동 단말기에 있어서,상기 이동 단말기의 위치 정보를 수신하도록 이루어지는 GPS; 외부기기와 무선 통신을 수행하도록 이루어지는 무선 통신부; 및외부기기와의 커뮤니케이션 이벤트가 발생되는 경우, 상기 커뮤니케이션 정보를 저장하는 제어부를 포함하고,상기 제어부는,상기 커뮤니케이션 이벤트가 발생될 때, 상기 GPS로부터 수신된 위치 정보와 상기 커뮤니케이션 정보를 매칭시켜 저장하고,사용자로부터 커뮤니케이션 정보를 검색하기 위한 검색어를 입력 받는 경우, 기 저장된 커뮤니케이션 정보에 매칭된 위치 정보 및 상기 검색어를 이용하여, 기 저장된 커뮤니케이션 정보 중 상기 검색어에 대응하는 적어도하나의 정보를 출력하는 것을 특징으로 하는 이동 단말기."}
{"patent_id": "10-2019-7023571", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제어부는, 상기 검색어에서 위치 정보 관련 키워드를 추출하고, 추출된 키워드와 기 저장된 커뮤니케이션 정보에 매칭된위치 정보를 비교하여, 상기 기 저장된 커뮤니케이션 정보 중 상기 검색어에 대응하는 적어도 하나의 정보를 출력하는 것을 특징으로 하는 이동 단말기."}
{"patent_id": "10-2019-7023571", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 제어부는,상기 커뮤니케이션 정보에 매칭된 위치 정보가 기 설정된 조건을 만족하는 경우, 상기 위치 정보에 대한 대표명과 상기 위치 정보를 매칭 시켜 저장하는 것을 특징으로 하는 이동 단말기."}
{"patent_id": "10-2019-7023571", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 제어부는,상기 추출된 키워드가 기 저장된 대표명들 중 어느 하나와 동일한 경우, 상기 추출된 키워드를 상기 어느 하나의 대표명에 대응하는 위치 정보로 변환하고, 변환된 위치 정보와 기 저장된 커뮤니케이션 정보에 매칭된 위치정보를 비교하여, 상기 기 저장된 커뮤니케이션 정보 중 상기 검색어에 대응하는 적어도 하나의 정보를 출력하는 것을 특징으로 하는 이동 단말기."}
{"patent_id": "10-2019-7023571", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서,상기 제어부는,기 설정된 시간 범위 내에서 소정 횟수 이상 동일한 위치 정보가 수집되는 경우, 상기 기 설정된 조건이 만족하는 것으로 판단하고, 상기 위치 정보에 대한 대표명과 상기 위치 정보를 매칭 시켜 저장하는 것을 특징으로 하는 이동 단말기.공개특허 10-2021-0117360-3-청구항 6 제1항에 있어서,상기 제어부는,상기 커뮤니케이션 정보에서 위치 정보를 추출하고, 상기 추출된 위치 정보를 상기 커뮤니케이션 정보와 매칭시켜 저장하는 것을 특징으로 하는 이동 단말기."}
{"patent_id": "10-2019-7023571", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 기 저장된 커뮤니케이션 정보 중 적어도 일부에는 복수의 위치 정보가 매칭되는 것을 특징으로 하는 이동단말기."}
{"patent_id": "10-2019-7023571", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 제어부는,상기 검색어에서 위치 정보 관련 키워드를 추출하고, 추출된 키워드와 상기 복수의 위치 정보 중 어느 하나가동일한 경우, 상기 복수의 위치 정보에 대응하는 커뮤니케이션 정보를 출력하는 것을 특징으로 하는 이동 단말기."}
{"patent_id": "10-2019-7023571", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 제어부는,상기 검색어에서 위치 정보 관련 키워드 및 시간 정보 관련 키워드를 각각 추출하고, 상기 기 저장된 커뮤니케이션 정보 중 상기 추출된 키워드 각각에 대응하는 정보를 출력하는 것을 특징으로 하는 이동 단말기."}
{"patent_id": "10-2019-7023571", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 제어부는,상기 추출된 위치 정보 관련 키워드와 기 저장된 커뮤니케이션 정보에 매칭된 위치 정보를 비교하여, 상기 기저장된 커뮤니케이션 정보 중 일부를 추출하고,상기 추출된 커뮤니케이션 정보 중 상기 추출된 시간 관련 키워드에 대응하는 정보를 출력하는 것을 특징으로하는 이동 단말기."}
{"patent_id": "10-2019-7023571", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서,상기 제어부는,기 설정된 조건을 만족하는 경우, 사용자로부터 검색어를 입력 받은 것으로 판단하고, 기 저장된 커뮤니케이션정보에 매칭된 위치 정보 및 상기 검색어를 이용하여, 기 저장된 커뮤니케이션 정보 중 상기 검색어에 대응하는적어도 하나의 정보를 출력하는 것을 특징으로 하는 이동 단말기."}
{"patent_id": "10-2019-7023571", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 기 설정된 조건은 특정 애플리케이션이 실행되는 것임을 특징으로 하는 이동 단말기."}
{"patent_id": "10-2019-7023571", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "공개특허 10-2021-0117360-4-제12항에 있어서,상기 제어부는, 상기 기 설정된 조건을 만족하는 경우, GPS로부터 위치 정보를 수집하고, 수집된 위치 정보 및 기 저장된 커뮤니케이션 정보에 매칭된 위치 정보를 비교하여, 기 저장된 커뮤니케이션 정보 중 상기 수집된 위치 정보에 대응하는 적어도 하나의 정보를 출력하는 것을 특징으로 하는 이동 단말기."}
{"patent_id": "10-2019-7023571", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 제어부는, 상기 기 설정된 조건을 만족하는 경우, 현재 시간 정보를 수집하고, 기 저장된 커뮤니케이션 정보 중 상기 수집된 위치 정보에 대응하는 적어도 하나의 정보를 출력하는 것을 특징으로 하는 이동 단말기."}
{"patent_id": "10-2019-7023571", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "이동 단말기의 제어 방법에 있어서,외부기기와의 커뮤니케이션 이벤트가 발생되는 경우, 상기 커뮤니케이션 정보를 저장하는 단계;상기 커뮤니케이션 이벤트가 발생될 때, GPS로부터 상기 이동 단말기의 위치 정보를 수집하는 단계;상기 GPS로부터 수신된 위치 정보와 상기 커뮤니케이션 정보를 매칭시켜 저장하는 단계; 및사용자로부터 커뮤니케이션 정보를 검색하기 위한 검색어를 입력 받는 경우, 기 저장된 커뮤니케이션 정보에 매칭된 위치 정보 및 상기 검색어를 이용하여, 기 저장된 커뮤니케이션 정보 중 상기 검색어에 대응하는 적어도하나의 정보를 출력하는 단계를 포함하는 이동 단말기의 제어 방법."}
{"patent_id": "10-2019-7023571", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 이동 단말기의 위치 정보를 수신하도록 이루어지는 GPS, 외부기기와 무선 통신을 수행하도록 이루어지 는 무선 통신부 및 외부기기와의 커뮤니케이션 이벤트가 발생되는 경우, 상기 커뮤니케이션 정보를 저장하는 제 어부를 포함하고, 상기 제어부는 상기 커뮤니케이션 이벤트가 발생될 때, 상기 GPS로부터 수신된 위치 정보와 상 기 커뮤니케이션 정보를 매칭시켜 저장하고, 사용자로부터 커뮤니케이션 정보를 검색하기 위한 검색어를 입력 받 는 경우, 기 저장된 커뮤니케이션 정보에 매칭된 위치 정보 및 상기 검색어를 이용하여, 기 저장된 커뮤니케이션 정보 중 상기 검색어에 대응하는 적어도 하나의 정보를 출력하는 것을 특징으로 하는 이동 단말기를 제공한다. 공개특허10-2021-0117360 CPC특허분류 H04M 1/72457 (2021.01) H04M 2201/34 (2013.01) H04M 2201/36 (2013.01) H04M 2201/38 (2013.01) H04M 2250/10 (2013.01) 발명자 김종설 서울특별시 서초구 양재대로11길 19 심묘섭 서울특별시 서초구 양재대로11길 19 오현주 서울특별시 서초구 양재대로11길 19 장보미 서울특별시 서초구 양재대로11길 19조재기 서울특별시 서초구 양재대로11길 19 천동기 서울특별시 서초구 양재대로11길 19 허자희 서울특별시 서초구 양재대로11길 19명 세 서 청구범위 청구항 1 이동 단말기에 있어서, 상기 이동 단말기의 위치 정보를 수신하도록 이루어지는 GPS; 외부기기와 무선 통신을 수행하도록 이루어지는 무선 통신부; 및 외부기기와의 커뮤니케이션 이벤트가 발생되는 경우, 상기 커뮤니케이션 정보를 저장하는 제어부를 포함하고, 상기 제어부는, 상기 커뮤니케이션 이벤트가 발생될 때, 상기 GPS로부터 수신된 위치 정보와 상기 커뮤니케이션 정보를 매칭시 켜 저장하고, 사용자로부터 커뮤니케이션 정보를 검색하기 위한 검색어를 입력 받는 경우, 기 저장된 커뮤니케이션 정보에 매 칭된 위치 정보 및 상기 검색어를 이용하여, 기 저장된 커뮤니케이션 정보 중 상기 검색어에 대응하는 적어도 하나의 정보를 출력하는 것을 특징으로 하는 이동 단말기. 청구항 2 제1항에 있어서, 상기 제어부는, 상기 검색어에서 위치 정보 관련 키워드를 추출하고, 추출된 키워드와 기 저장된 커뮤니케이션 정보에 매칭된 위치 정보를 비교하여, 상기 기 저장된 커뮤니케이션 정보 중 상기 검색어에 대응하는 적어도 하나의 정보를 출 력하는 것을 특징으로 하는 이동 단말기. 청구항 3 제2항에 있어서, 상기 제어부는, 상기 커뮤니케이션 정보에 매칭된 위치 정보가 기 설정된 조건을 만족하는 경우, 상기 위치 정보에 대한 대표명 과 상기 위치 정보를 매칭 시켜 저장하는 것을 특징으로 하는 이동 단말기. 청구항 4 제3항에 있어서, 상기 제어부는, 상기 추출된 키워드가 기 저장된 대표명들 중 어느 하나와 동일한 경우, 상기 추출된 키워드를 상기 어느 하나 의 대표명에 대응하는 위치 정보로 변환하고, 변환된 위치 정보와 기 저장된 커뮤니케이션 정보에 매칭된 위치 정보를 비교하여, 상기 기 저장된 커뮤니케이션 정보 중 상기 검색어에 대응하는 적어도 하나의 정보를 출력하 는 것을 특징으로 하는 이동 단말기. 청구항 5 제3항에 있어서, 상기 제어부는, 기 설정된 시간 범위 내에서 소정 횟수 이상 동일한 위치 정보가 수집되는 경우, 상기 기 설정된 조건이 만족하 는 것으로 판단하고, 상기 위치 정보에 대한 대표명과 상기 위치 정보를 매칭 시켜 저장하는 것을 특징으로 하 는 이동 단말기.청구항 6 제1항에 있어서, 상기 제어부는, 상기 커뮤니케이션 정보에서 위치 정보를 추출하고, 상기 추출된 위치 정보를 상기 커뮤니케이션 정보와 매칭시 켜 저장하는 것을 특징으로 하는 이동 단말기. 청구항 7 제6항에 있어서, 상기 기 저장된 커뮤니케이션 정보 중 적어도 일부에는 복수의 위치 정보가 매칭되는 것을 특징으로 하는 이동 단말기. 청구항 8 제7항에 있어서, 상기 제어부는, 상기 검색어에서 위치 정보 관련 키워드를 추출하고, 추출된 키워드와 상기 복수의 위치 정보 중 어느 하나가 동일한 경우, 상기 복수의 위치 정보에 대응하는 커뮤니케이션 정보를 출력하는 것을 특징으로 하는 이동 단말 기. 청구항 9 제1항에 있어서, 상기 제어부는, 상기 검색어에서 위치 정보 관련 키워드 및 시간 정보 관련 키워드를 각각 추출하고, 상기 기 저장된 커뮤니케 이션 정보 중 상기 추출된 키워드 각각에 대응하는 정보를 출력하는 것을 특징으로 하는 이동 단말기. 청구항 10 제9항에 있어서, 상기 제어부는, 상기 추출된 위치 정보 관련 키워드와 기 저장된 커뮤니케이션 정보에 매칭된 위치 정보를 비교하여, 상기 기 저장된 커뮤니케이션 정보 중 일부를 추출하고, 상기 추출된 커뮤니케이션 정보 중 상기 추출된 시간 관련 키워드에 대응하는 정보를 출력하는 것을 특징으로 하는 이동 단말기. 청구항 11 제1항에 있어서, 상기 제어부는, 기 설정된 조건을 만족하는 경우, 사용자로부터 검색어를 입력 받은 것으로 판단하고, 기 저장된 커뮤니케이션 정보에 매칭된 위치 정보 및 상기 검색어를 이용하여, 기 저장된 커뮤니케이션 정보 중 상기 검색어에 대응하는 적어도 하나의 정보를 출력하는 것을 특징으로 하는 이동 단말기. 청구항 12 제11항에 있어서, 상기 기 설정된 조건은 특정 애플리케이션이 실행되는 것임을 특징으로 하는 이동 단말기. 청구항 13 제12항에 있어서, 상기 제어부는, 상기 기 설정된 조건을 만족하는 경우, GPS로부터 위치 정보를 수집하고, 수집된 위치 정보 및 기 저장된 커뮤 니케이션 정보에 매칭된 위치 정보를 비교하여, 기 저장된 커뮤니케이션 정보 중 상기 수집된 위치 정보에 대응 하는 적어도 하나의 정보를 출력하는 것을 특징으로 하는 이동 단말기. 청구항 14 제13항에 있어서, 상기 제어부는, 상기 기 설정된 조건을 만족하는 경우, 현재 시간 정보를 수집하고, 기 저장된 커뮤니케이션 정보 중 상기 수집 된 위치 정보에 대응하는 적어도 하나의 정보를 출력하는 것을 특징으로 하는 이동 단말기. 청구항 15 이동 단말기의 제어 방법에 있어서, 외부기기와의 커뮤니케이션 이벤트가 발생되는 경우, 상기 커뮤니케이션 정보를 저장하는 단계; 상기 커뮤니케이션 이벤트가 발생될 때, GPS로부터 상기 이동 단말기의 위치 정보를 수집하는 단계; 상기 GPS로부터 수신된 위치 정보와 상기 커뮤니케이션 정보를 매칭시켜 저장하는 단계; 및 사용자로부터 커뮤니케이션 정보를 검색하기 위한 검색어를 입력 받는 경우, 기 저장된 커뮤니케이션 정보에 매 칭된 위치 정보 및 상기 검색어를 이용하여, 기 저장된 커뮤니케이션 정보 중 상기 검색어에 대응하는 적어도 하나의 정보를 출력하는 단계를 포함하는 이동 단말기의 제어 방법. 발명의 설명"}
{"patent_id": "10-2019-7023571", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능부를 포함하는 이동단말기 및 그 제어 방법에 관한 것이다."}
{"patent_id": "10-2019-7023571", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공 지능(artificial intelligence)은 인간의 지능으로 할 수 있는 사고, 학습, 자기계발 등을 컴퓨터가 할 수 있도록 하는 방법을 연구하는 컴퓨터 공학 및 정보기술의 한 분야로, 컴퓨터가 인간의 지능적인 행동을 모방할 수 있도록 하는 것을 의미한다. 또한, 인공지능은 그 자체로 존재하는 것이 아니라, 컴퓨터 과학의 다른 분야와 직간접으로 많은 관련을 맺고 있다. 특히 현대에는 정보기술의 여러 분야에서 인공지능적 요소를 도입하여, 그 분야의 문제 풀이에 활용하려 는 시도가 매우 활발하게 이루어지고 있다. 한편, 종래에는 인공지능을 이용하여 사용자가 처한 상황을 인지하고 사용자가 원하는 정보를 원하는 형태로 제 공하는 상황 인지(Context Awareness) 기술이 활발하게 연구되고 있다. 상술한 상황 인지 기술이 발달함과 동시에 사용자가 처한 상황에 적합한 기능을 수행할 수 있는 이동 단말기에 대한 수요가 증가하고 있다."}
{"patent_id": "10-2019-7023571", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술한 문제 및 다른 문제를 해결하는 것을 목적으로 한다. 또 다른 목적은, 위치 관련 키워드를 이 용하여 기 저장된 커뮤니케이션 정보를 검색할 수 있도록 하는 것이다. 또한, 본 발명은 위치 관련 키워드 및 시간 관련 키워드를 함께 활용하여 기 저장된 커뮤니케이션 정보를 검색 할 수 있도록 하는 것을 그 목적으로 한다."}
{"patent_id": "10-2019-7023571", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 목적을 달성하기 위하여, 본 발명은 이동 단말기의 위치 정보를 수신하도록 이루어지는 GPS, 외부기기와 무선 통신을 수행하도록 이루어지는 무선 통신부 및 외부기기와의 커뮤니케이션 이벤트가 발생되는 경우, 상기 커뮤니케이션 정보를 저장하는 제어부를 포함하고, 상기 제어부는 상기 커뮤니케이션 이벤트가 발생될 때, 상기 GPS로부터 수신된 위치 정보와 상기 커뮤니케이션 정보를 매칭시켜 저장하고, 사용자로부터 커뮤니케이션 정보 를 검색하기 위한 검색어를 입력 받는 경우, 기 저장된 커뮤니케이션 정보에 매칭된 위치 정보 및 상기 검색어 를 이용하여, 기 저장된 커뮤니케이션 정보 중 상기 검색어에 대응하는 적어도 하나의 정보를 출력하는 것을 특 징으로 하는 이동 단말기를 제공한다. 일 실시 예에 있어서, 상기 제어부는 상기 검색어에서 위치 정보 관련 키워드를 추출하고, 추출된 키워드와 기 저장된 커뮤니케이션 정보에 매칭된 위치 정보를 비교하여, 상기 기 저장된 커뮤니케이션 정보 중 상기 검색어 에 대응하는 적어도 하나의 정보를 출력할 수 있다. 일 실시 예에 있어서, 상기 제어부는 상기 커뮤니케이션 정보에 매칭된 위치 정보가 기 설정된 조건을 만족하는 경우, 상기 위치 정보에 대한 대표명과 상기 위치 정보를 매칭 시켜 저장할 수 있다. 일 실시 예에 있어서, 상기 제어부는 상기 추출된 키워드가 기 저장된 대표명들 중 어느 하나와 동일한 경우, 상기 추출된 키워드를 상기 어느 하나의 대표명에 대응하는 위치 정보로 변환하고, 변환된 위치 정보와 기 저장 된 커뮤니케이션 정보에 매칭된 위치 정보를 비교하여, 상기 기 저장된 커뮤니케이션 정보 중 상기 검색어에 대 응하는 적어도 하나의 정보를 출력할 수 있다. 일 실시 예에 있어서, 상기 제어부는 기 설정된 시간 범위 내에서 소정 횟수 이상 동일한 위치 정보가 수집되는 경우, 상기 기 설정된 조건이 만족하는 것으로 판단하고, 상기 위치 정보에 대한 대표명과 상기 위치 정보를 매 칭 시켜 저장할 수 있다. 일 실시 예에 있어서, 상기 제어부는 상기 커뮤니케이션 정보에서 위치 정보를 추출하고, 상기 추출된 위치 정 보를 상기 커뮤니케이션 정보와 매칭시켜 저장할 수 있다. 일 실시 예에 있어서, 상기 기 저장된 커뮤니케이션 정보 중 적어도 일부에는 복수의 위치 정보가 매칭될 수 있 다. 일 실시 예에 있어서, 상기 제어부는 상기 검색어에서 위치 정보 관련 키워드를 추출하고, 추출된 키워드와 상 기 복수의 위치 정보 중 어느 하나가 동일한 경우, 상기 복수의 위치 정보에 대응하는 커뮤니케이션 정보를 출 력할 수 있다. 일 실시 예에 있어서, 상기 제어부는 상기 검색어에서 위치 정보 관련 키워드 및 시간 정보 관련 키워드를 각각 추출하고, 상기 기 저장된 커뮤니케이션 정보 중 상기 추출된 키워드 각각에 대응하는 정보를 출력할 수 있다. 일 실시 예에 있어서, 상기 제어부는 상기 추출된 위치 정보 관련 키워드와 기 저장된 커뮤니케이션 정보에 매 칭된 위치 정보를 비교하여, 상기 기 저장된 커뮤니케이션 정보 중 일부를 추출하고, 상기 추출된 커뮤니케이션 정보 중 상기 추출된 시간 관련 키워드에 대응하는 정보를 출력할 수 있다. 일 실시 예에 있어서, 상기 제어부는 기 설정된 조건을 만족하는 경우, 사용자로부터 검색어를 입력 받은 것으 로 판단하고, 기 저장된 커뮤니케이션 정보에 매칭된 위치 정보 및 상기 검색어를 이용하여, 기 저장된 커뮤니 케이션 정보 중 상기 검색어에 대응하는 적어도 하나의 정보를 출력할 수 있다. 일 실시 예에 있어서, 상기 기 설정된 조건은 특정 애플리케이션이 실행될 수 있다. 일 실시 예에 있어서, 상기 제어부는 상기 기 설정된 조건을 만족하는 경우, GPS로부터 위치 정보를 수집하고, 수집된 위치 정보 및 기 저장된 커뮤니케이션 정보에 매칭된 위치 정보를 비교하여, 기 저장된 커뮤니케이션 정 보 중 상기 수집된 위치 정보에 대응하는 적어도 하나의 정보를 출력할 수 있다. 일 실시 예에 있어서, 상기 제어부는 상기 기 설정된 조건을 만족하는 경우, 현재 시간 정보를 수집하고, 기 저 장된 커뮤니케이션 정보 중 상기 수집된 위치 정보에 대응하는 적어도 하나의 정보를 출력할 수 있다. 또한, 본 발명은 이동 단말기의 제어 방법을 제공한다. 구체적으로, 본 발명은 외부기기와의 커뮤니케이션 이벤 트가 발생되는 경우, 상기 커뮤니케이션 정보를 저장하는 단계, 상기 커뮤니케이션 이벤트가 발생될 때, GPS로 부터 상기 이동 단말기의 위치 정보를 수집하는 단계, 상기 GPS로부터 수신된 위치 정보와 상기 커뮤니케이션정보를 매칭시켜 저장하는 단계 및 사용자로부터 커뮤니케이션 정보를 검색하기 위한 검색어를 입력 받는 경우, 기 저장된 커뮤니케이션 정보에 매칭된 위치 정보 및 상기 검색어를 이용하여, 기 저장된 커뮤니케이션 정보 중 상기 검색어에 대응하는 적어도 하나의 정보를 출력하는 단계를 포함하는 이동 단말기의 제어 방법을 제공한다."}
{"patent_id": "10-2019-7023571", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 사용자가 직관적으로 생각할 수 있는 장소 및 시간을 검색어로 활용하여 사용자의 과거 통화 기록 또는 문자 메시지 송수신 기록을 검색할 수 있게 된다. 또한, 본 발명에 따르면, 커뮤니케이션 이벤트 발생 시 수집된 위치 정보를 상기 커뮤니케이션 정보와 함께 저 장하기 때문에, 추후 저장된 커뮤니케이션 정보에 대한 활용성이 높아질 수 있다."}
{"patent_id": "10-2019-7023571", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 명세서에 개시된 실시 예를 상세히 설명하되, 도면 부호에 관계없이 동일하거 나 유사한 구성요소에는 동일한 참조 번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 이하의 설 명에서 사용되는 구성요소에 대한 접미사 \"모듈\" 및 \"부\"는 명세서 작성의 용이함만이 고려되어 부여되거나 혼 용되는 것으로서, 그 자체로 서로 구별되는 의미 또는 역할을 갖는 것은 아니다. 또한, 본 명세서에 개시된 실 시 예를 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 명세서에 개시된 실시 예의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 또한, 첨부된 도면은 본 명세서에 개시된 실시 예를 쉽게 이해할 수 있도록 하기 위한 것일 뿐, 첨부된 도면에 의해 본 명세서에 개시된 기술적 사상이 제한되지 않으며,본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소 들은 상기 용어들에 의해 한정되지는 않는다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있 다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함한다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되 어야 한다. 본 명세서에서 설명되는 이동 단말기에는 휴대폰, 스마트 폰(smart phone), 노트북 컴퓨터(laptop computer), 디지털방송용 단말기, PDA(personal digital assistants), PMP(portable multimedia player), 네비게이션, 슬 레이트 PC(slate PC), 태블릿 PC(tablet PC), 울트라북(ultrabook), 웨어러블 디바이스(wearable device, 예를 들어, 워치형 단말기 (smartwatch), 글래스형 단말기 (smart glass), HMD(head mounted display)) 등이 포함될 수 있다. 그러나, 본 명세서에 기재된 실시 예에 따른 구성은 이동 단말기에만 적용 가능한 경우를 제외하면, 디지털 TV,"}
{"patent_id": "10-2019-7023571", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "데스크탑 컴퓨터, 디지털 사이니지 등과 같은 고정 단말기에도 적용될 수도 있음을 본 기술분야의 당업자라면 쉽게 알 수 있을 것이다. 도 1a 내지 도 1c를 참조하면, 도 1a는 본 발명과 관련된 이동 단말기를 설명하기 위한 블록도이고, 도 1b 및 1c는 본 발명과 관련된 이동 단말기의 일 예를 서로 다른 방향에서 바라본 개념도이다. 상기 이동 단말기는 무선 통신부, 입력부, 인공지능부, 센싱부, 출력부, 인터페 이스부, 메모리, 제어부 및 전원 공급부 등을 포함할 수 있다. 도 1a에 도시된 구성요소들 은 이동 단말기를 구현하는데 있어서 필수적인 것은 아니어서, 본 명세서 상에서 설명되는 이동 단말기는 위에 서 열거된 구성요소들 보다 많거나, 또는 적은 구성요소들을 가질 수 있다. 보다 구체적으로, 상기 구성요소들 중 무선 통신부는, 이동 단말기와 무선 통신 시스템 사이, 이동 단말기와 다른 이동 단말기 사이, 또는 이동 단말기와 외부서버 사이의 무선 통신을 가능하게 하는 하나 이상의 모듈을 포함할 수 있다. 또한, 상기 무선 통신부는, 이동 단말기를 하나 이상의 네 트워크에 연결하는 하나 이상의 모듈을 포함할 수 있다. 이러한 무선 통신부는, 방송 수신 모듈, 이동통신 모듈, 무선 인터넷 모듈, 근거리 통신 모듈, 위치정보 모듈 중 적어도 하나를 포함할 수 있다. 입력부는, 영상 신호 입력을 위한 카메라 또는 영상 입력부, 오디오 신호 입력을 위한 마이크로폰 (microphone, 122), 또는 오디오 입력부, 사용자로부터 정보를 입력받기 위한 사용자 입력부(123, 예를 들어, 터치키(touch key), 푸시키(mechanical key) 등)를 포함할 수 있다. 입력부에서 수집한 음성 데이터나 이 미지 데이터는 분석되어 사용자의 제어명령으로 처리될 수 있다. 인공지능부는, 인공 지능 기술에 기반하여 정보들을 처리하는 역할을 수행하는 것으로, 정보의 학습, 정보 의 추론, 정보의 지각, 자연 언어의 처리 중 적어도 하나를 수행하는 하나 이상의 모듈을 포함할 수 있다. 인공지능부는 머신 러닝(machine running) 기술을 이용하여, 이동 단말기 내에 저장된 정보, 이동 단말기 주변의 환경 정보, 통신 가능한 외부 저장소에 저장된 정보 등 방대한 양의 정보(빅데이터, big data)를 학습, 추론, 처리 중 적어도 하나를 수행할 수 있다. 그리고, 인공지능부는 상기 머신 러닝 기술을 이용하여 학 습된 정보들을 이용하여, 실행 가능한 적어도 하나의 이동 단말기의 동작을 예측(또는 추론)하고, 상기 적어도 하나의 예측된 동작들 중 가장 실현성이 높은 동작이 실행되도록 이동 단말기를 제어할 수 있다. 머신 러닝 기술은 적어도 하나의 알고리즘에 근거하여, 대규모의 정보들을 수집 및 학습하고, 학습된 정보를 바 탕으로 정보를 판단 및 예측하는 기술이다. 정보의 학습이란 정보들의 특징, 규칙, 판단 기준 등을 파악하여, 정보와 정보 사이의 관계를 정량화하고, 정량화된 패턴을 이용하여 새로운 데이터들을 예측하는 동작이다. 이러한 머신 러닝 기술이 사용하는 알고리즘은 통계학에 기반한 알고리즘이 될 수 있으며, 예를 들어, 트리 구 조 형태를 예측 모델로 사용하는 의사 결정 나무(decision tree), 생물의 신경 네트워크 구조와 기능을 모방하 는 인공 신경망(neural network), 생물의 진화 알고리즘에 기반한 유전자 프로그래밍(genetic programming), 관측된 예를 군집이라는 부분집합으로 분배하는 군집화(Clustering), 무작위로 추출된 난수를 통해 함수값을 확 률로 계산하는 몬테카를로 방법(Monter carlo method) 등이 될 수 있다. 머신 러닝 기술의 한 분야로써, 딥러닝 기술은 인공 신경망 알고리즘을 이용하여, 정보들을 학습, 판단, 처리 중 적어도 하나를 수행하는 기술이다. 인공 신경망은 레이어와 레이어 사이를 연결하고, 레이어와 레이어 사이 의 데이터를 전달하는 구조를 가질 수 있다. 이러한 딥러닝 기술은 병렬 연산에 최적화된 GPU(graphic processing unit)를 이용하여 인공 신경망을 통하여 방대한 양의 정보를 학습할 수 있다. 한편, 인공지능부는 머신 러닝 기술을 적용하기 위한 방대한 양의 정보들을 수집하기 위하여, 이동 단말기 의 구성 요소들에서 입력 또는 출력되는 신호, 데이터, 정보 등을 수집(감지, 모니터링, 추출, 검출, 수신)할 수 있다. 또한, 인공지능부는 통신을 통하여 연결되는 외부 저장소(예를 들어, 클라우드 서버, cloud server)에 저장된 데이터, 정보 등을 수집(감지, 모니터링, 추출, 검출, 수신)할 수 있다. 보다 구체적으로, 정 보의 수집이란, 센서를 통하여 정보를 감지하거나, 메모리에 저장된 정보를 추출하거나, 통신을 통하여, 외부 저장소로부터 정보들을 수신하는 동작을 포함하는 용어로 이해될 수 있다. 인공지능부는 센싱부를 통하여, 이동 단말기 내 정보, 이동 단말기를 둘러싼 주변 환경 정보 및 사용 자 정보를 감지할 수 있다. 또한, 인공지능부는 무선 통신부를 통하여, 방송 신호 및/또는 방송 관련 된 정보, 무선 신호, 무선 데이터 등을 수신할 수 있다. 또한, 인공지능부는 입력부로부터 영상 정보(또는 신호), 오디오 정보(또는 신호), 데이터 또는 사용자로부터 입력되는 정보를 입력받을 수 있다. 이러한 인공지능부는 백그라운드 상에서 실시간으로 방대한 양의 정보들을 수집하고, 이를 학습하여, 적절 한 형태로 가공한 정보(예를 들어, 지식 그래프, 명령어 정책, 개인화 데이터베이스, 대화 엔진 등)를 메모리 에 저장할 수 있다. 그리고, 인공지능부는 머신 러닝 기술을 이용하여 학습된 정보들을 바탕으로, 이동 단말기의 동작이 예측 되면, 이러한 예측된 동작을 실행하기 위하여, 이동 단말기의 구성 요소들을 제어하거나, 예측된 동작을 실행하 기 위한 제어 명령을 제어부로 전달할 수 있다. 제어부는 제어 명령에 근거하여, 이동 단말기를 제어 함으로써, 예측된 동작을 실행할 수 있다. 한편, 인공지능부는 특정 동작이 수행되면, 머신 러닝 기술을 통하여, 특정 동작의 수행을 나타내는 이력 정보를 분석하고, 이러한 분석 정보를 바탕으로 기존의 학습된 정보에 대한 업데이트를 수행할 수 있다. 이에, 인공지능부는 정보 예측의 정확도를 향상시킬 수 있다. 한편, 본 명세서에서, 인공지능부와 제어부는 동일한 구성요소로 이해될 수 있다. 이 경우, 본 명세 서에서 설명되는 제어부에서 수행되는 기능은, 인공지능부에서 수행된다고 표현할 수 있으며, 제어부 는 인공지능부로 명명되거나, 이와 반대로, 인공지능부는 제어부로 명명되어도 무방하다. 또한, 이와 다르게, 본 명세서에서, 인공지능부와 제어부는 별도의 구성요소로 이해될 수 있다. 이 경우, 인공지능부와 제어부는 서로 데이터 교환을 통하여, 이동 단말기 상에서 다양한 제어를 수행할 수 있다. 제어부는 인공지능부에서 도출된 결과를 기반으로, 이동 단말기 상에서 적어도 하나의 기능 을 수행하거나, 이동 단말기의 구성요소 중 적어도 하나를 제어할 수 있다. 나아가, 인공지능부 또한, 제 어부의 제어 하에 동작될 수 있다. 센싱부는 이동 단말기 내 정보, 이동 단말기를 둘러싼 주변 환경 정보 및 사용자 정보 중 적어도 하나를 센싱하기 위한 하나 이상의 센서를 포함할 수 있다. 예를 들어, 센싱부는 근접센서(141, proximity sensor), 조도 센서(142, illumination sensor), 터치 센서(touch sensor), 가속도 센서(acceleration sensor), 자기 센서(magnetic sensor), 중력 센서(G-sensor), 자이로스코프 센서(gyroscope sensor), 모션 센 서(motion sensor), RGB 센서, 적외선 센서(IR 센서: infrared sensor), 지문인식 센서(finger scan sensor), 초음파 센서(ultrasonic sensor), 광 센서(optical sensor, 예를 들어, 카메라(121 참조)), 마이크로폰 (microphone, 122 참조), 배터리 게이지(battery gauge), 환경 센서(예를 들어, 기압계, 습도계, 온도계, 방사 능 감지 센서, 열 감지 센서, 가스 감지 센서 등), 화학 센서(예를 들어, 전자 코, 헬스케어 센서, 생체 인식센서 등) 중 적어도 하나를 포함할 수 있다. 한편, 본 명세서에 개시된 이동 단말기는, 이러한 센서들 중 적어 도 둘 이상의 센서에서 센싱되는 정보들을 조합하여 활용할 수 있다. 출력부는 시각, 청각 또는 촉각 등과 관련된 출력을 발생시키기 위한 것으로, 디스플레이부, 음향 출 력부, 햅팁 모듈, 광 출력부 중 적어도 하나를 포함할 수 있다. 디스플레이부는 터치 센서 와 상호 레이어 구조를 이루거나 일체형으로 형성됨으로써, 터치 스크린을 구현할 수 있다. 이러한 터치 스크린 은, 이동 단말기와 사용자 사이의 입력 인터페이스를 제공하는 사용자 입력부로써 기능함과 동시에, 이동 단말기와 사용자 사이의 출력 인터페이스를 제공할 수 있다. 인터페이스부는 이동 단말기에 연결되는 다양한 종류의 외부 기기와의 통로 역할을 수행한다. 이러한 인터페이스부는, 유/무선 헤드셋 포트(port), 외부 충전기 포트(port), 유/무선 데이터 포트(port), 메모 리 카드(memory card) 포트, 식별 모듈이 구비된 장치를 연결하는 포트(port), 오디오 I/O(Input/Output) 포트 (port), 비디오 I/O(Input/Output) 포트(port), 이어폰 포트(port) 중 적어도 하나를 포함할 수 있다. 이동 단 말기에서는, 상기 인터페이스부에 외부 기기가 연결되는 것에 대응하여, 연결된 외부 기기와 관련된 적절할 제어를 수행할 수 있다. 또한, 메모리는 이동 단말기의 다양한 기능을 지원하는 데이터를 저장한다. 메모리는 이동 단말 기에서 구동되는 다수의 응용 프로그램(application program 또는 애플리케이션(application)), 이동 단 말기의 동작을 위한 데이터들, 명령어들, 인공지능부의 동작을 위한 데이터들(예를 들어, 머신 러닝 을 위한 적어도 하나의 알고리즘 정보 등)을 저장할 수 있다. 이러한 응용 프로그램 중 적어도 일부는, 무선 통 신을 통해 외부 서버로부터 다운로드 될 수 있다. 또한 이러한 응용 프로그램 중 적어도 일부는, 이동 단말기 의 기본적인 기능(예를 들어, 전화 착신, 발신 기능, 메시지 수신, 발신 기능)을 위하여 출고 당시부터 이 동 단말기상에 존재할 수 있다. 한편, 응용 프로그램은, 메모리에 저장되고, 이동 단말기 상에 설치되어, 제어부에 의하여 상기 이동 단말기의 동작(또는 기능)을 수행하도록 구동될 수 있다. 제어부는 상기 응용 프로그램과 관련된 동작 외에도, 통상적으로 이동 단말기의 전반적인 동작을 제 어한다. 제어부는 위에서 살펴본 구성요소들을 통해 입력 또는 출력되는 신호, 데이터, 정보 등을 처리하 거나 메모리에 저장된 응용 프로그램을 구동함으로써, 사용자에게 적절한 정보 또는 기능을 제공 또는 처 리할 수 있다. 또한, 제어부는 메모리에 저장된 응용 프로그램을 구동하기 위하여, 도 1a와 함께 살펴본 구성요소들 중 적어도 일부를 제어할 수 있다. 나아가, 제어부는 상기 응용 프로그램의 구동을 위하여, 이동 단말기 에 포함된 구성요소들 중 적어도 둘 이상을 서로 조합하여 동작시킬 수 있다. 전원공급부는 제어부의 제어 하에서, 외부의 전원, 내부의 전원을 인가 받아 이동 단말기에 포 함된 각 구성요소들에 전원을 공급한다. 이러한 전원공급부는 배터리를 포함하며, 상기 배터리는 내장형 배터리 또는 교체가능한 형태의 배터리가 될 수 있다. 상기 각 구성요소들 중 적어도 일부는, 이하에서 설명되는 다양한 실시 예들에 따른 이동 단말기의 동작, 제어, 또는 제어방법을 구현하기 위하여 서로 협력하여 동작할 수 있다. 또한, 상기 이동 단말기의 동작, 제어, 또는 제어방법은 상기 메모리에 저장된 적어도 하나의 응용 프로그램의 구동에 의하여 이동 단말기 상에서 구현 될 수 있다. 이하에서는, 위에서 살펴본 이동 단말기를 통하여 구현되는 다양한 실시 예들을 살펴보기에 앞서, 위에서 열거된 구성요소들에 대하여 도 1a를 참조하여 보다 구체적으로 살펴본다. 먼저, 무선 통신부에 대하여 살펴보면, 무선 통신부의 방송 수신 모듈은 방송 채널을 통하여 외 부의 방송 관리 서버로부터 방송 신호 및/또는 방송 관련된 정보를 수신한다. 상기 방송 채널은 위성 채널, 지 상파 채널을 포함할 수 있다. 적어도 두 개의 방송 채널들에 대한 동시 방송 수신 또는 방송 채널 스위칭을 위 해 둘 이상의 상기 방송 수신 모듈이 상기 이동단말기에 제공될 수 있다. 이동통신 모듈은, 이동통신을 위한 기술표준들 또는 통신방식(예를 들어, GSM(Global System for Mobile communication), CDMA(Code Division Multi Access), CDMA2000(Code Division Multi Access 2000), EV- DO(Enhanced Voice-Data Optimized or Enhanced Voice-Data Only), WCDMA(Wideband CDMA), HSDPA(High Speed Downlink Packet Access), HSUPA(High Speed Uplink Packet Access), LTE(Long Term Evolution), LTE-A(Long Term Evolution-Advanced) 등)에 따라 구축된 이동 통신망 상에서 기지국, 외부의 단말, 서버 중 적어도 하나와무선 신호를 송수신한다. 상기 무선 신호는, 음성 호 신호, 화상 통화 호 신호 또는 문자/멀티미디어 메시지 송수신에 따른 다양한 형태 의 데이터를 포함할 수 있다. 무선 인터넷 모듈은 무선 인터넷 접속을 위한 모듈을 말하는 것으로, 이동 단말기에 내장되거나 외장 될 수 있다. 무선 인터넷 모듈은 무선 인터넷 기술들에 따른 통신망에서 무선 신호를 송수신하도록 이루어 진다. 무선 인터넷 기술로는, 예를 들어 WLAN(Wireless LAN), Wi-Fi(Wireless-Fidelity), Wi-Fi(Wireless Fidelity) Direct, DLNA(Digital Living Network Alliance), WiBro(Wireless Broadband), WiMAX(World Interoperability for Microwave Access), HSDPA(High Speed Downlink Packet Access), HSUPA(High Speed Uplink Packet Access), LTE(Long Term Evolution), LTE-A(Long Term Evolution-Advanced) 등이 있으며, 상기 무선 인터넷 모 듈은 상기에서 나열되지 않은 인터넷 기술까지 포함한 범위에서 적어도 하나의 무선 인터넷 기술에 따라 데이터를 송수신하게 된다. WiBro, HSDPA, HSUPA, GSM, CDMA, WCDMA, LTE, LTE-A 등에 의한 무선인터넷 접속은 이동통신망을 통해 이루어 진다는 관점에서 본다면, 상기 이동통신망을 통해 무선인터넷 접속을 수행하는 상기 무선 인터넷 모듈은 상기 이동통신 모듈의 일종으로 이해될 수도 있다. 근거리 통신 모듈은 근거리 통신(Short range communication)을 위한 것으로서, 블루투스(Bluetooth™), RFID(Radio Frequency Identification), 적외선 통신(Infrared Data Association; IrDA), UWB(Ultra Wideband), ZigBee, NFC(Near Field Communication), Wi-Fi(Wireless-Fidelity), Wi-Fi Direct, Wireless USB(Wireless Universal Serial Bus) 기술 중 적어도 하나를 이용하여, 근거리 통신을 지원할 수 있다. 이러한, 근거리 통신 모듈은, 근거리 무선 통신망(Wireless Area Networks)을 통해 이동 단말기와 무선 통신 시스템 사이, 이동 단말기와 다른 이동 단말기 사이, 또는 이동 단말기와 다른 이동 단말기(100, 또는 외부서버)가 위치한 네트워크 사이의 무선 통신을 지원할 수 있다. 상기 근거리 무선 통신망 은 근거리 무선 개인 통신망(Wireless Personal Area Networks)일 수 있다. 여기에서, 다른 이동 단말기는 본 발명에 따른 이동 단말기와 데이터를 상호 교환하는 것이 가능한 (또는 연동 가능한) 웨어러블 디바이스(wearable device, 예를 들어, 스마트워치(smartwatch), 스마트 글래스 (smart glass), HMD(head mounted display))가 될 수 있다. 근거리 통신 모듈은, 이동 단말기 주변 에, 상기 이동 단말기와 통신 가능한 웨어러블 디바이스를 감지(또는 인식)할 수 있다. 나아가, 제어부 는 상기 감지된 웨어러블 디바이스가 본 발명에 따른 이동 단말기와 통신하도록 인증된 디바이스인 경우, 이동 단말기에서 처리되는 데이터의 적어도 일부를, 상기 근거리 통신 모듈을 통해 웨어러블 디바이스로 전송할 수 있다. 따라서, 웨어러블 디바이스의 사용자는, 이동 단말기에서 처리되는 데이터를, 웨어러블 디바이스를 통해 이용할 수 있다. 예를 들어, 이에 따르면 사용자는, 이동 단말기에 전화가 수신 된 경우, 웨어러블 디바이스를 통해 전화 통화를 수행하거나, 이동 단말기에 메시지가 수신된 경우, 웨어 러블 디바이스를 통해 상기 수신된 메시지를 확인하는 것이 가능하다. 위치정보 모듈은 이동 단말기의 위치(또는 현재 위치)를 획득하기 위한 모듈로서, 그의 대표적인 예로는 GPS(Global Positioning System) 모듈 또는 WiFi(Wireless Fidelity) 모듈이 있다. 예를 들어, 이동 단말기는 GPS모듈을 활용하면, GPS 위성에서 보내는 신호를 이용하여 이동 단말기의 위치를 획득할 수 있다. 다른 예로서, 이동 단말기는 Wi-Fi모듈을 활용하면, Wi-Fi모듈과 무선신호를 송신 또는 수신하는 무선 AP(Wireless Access Point)의 정보에 기반하여, 이동 단말기의 위치를 획득할 수 있다. 필요에 따라서, 위치정보모듈은 치환 또는 부가적으로 이동 단말기의 위치에 관한 데이터를 얻기 위해 무선 통신부의 다른 모듈 중 어느 기능을 수행할 수 있다. 위치정보모듈은 이동 단말기의 위치(또는 현재 위치)를 획득하기 위해 이용되는 모듈로, 이동 단말기의 위치를 직접적으로 계산하거나 획득하는 모듈로 한정되지는 않는다. 다음으로, 입력부는 영상 정보(또는 신호), 오디오 정보(또는 신호), 데이터, 또는 사용자로부터 입력되는 정보의 입력을 위한 것으로서, 영상 정보의 입력을 위하여, 이동 단말기 는 하나 또는 복수의 카메라(12 1)를 구비할 수 있다. 카메라는 화상 통화모드 또는 촬영 모드에서 이미지 센서에 의해 얻어지는 정지영상 또는 동영상 등의 화상 프레임을 처리한다. 처리된 화상 프레임은 디스플레이부에 표시되거나 메모리(17 0)에 저장될 수 있다. 한편, 이동 단말기에 구비되는 복수의 카메라는 매트릭스 구조를 이루도록 배 치될 수 있으며, 이와 같이 매트릭스 구조를 이루는 카메라를 통하여, 이동 단말기에는 다양한 각도또는 초점을 갖는 복수의 영상정보가 입력될 수 있다. 또한, 복수의 카메라는 입체영상을 구현하기 위한 좌 영상 및 우 영상을 획득하도록, 스트레오 구조로 배치될 수 있다. 마이크로폰은 외부의 음향 신호를 전기적인 음성 데이터로 처리한다. 처리된 음성 데이터는 이동 단말기 에서 수행 중인 기능(또는 실행 중인 응용 프로그램)에 따라 다양하게 활용될 수 있다. 한편, 마이크로폰 에는 외부의 음향 신호를 입력 받는 과정에서 발생되는 잡음(noise)을 제거하기 위한 다양한 잡음 제거 알 고리즘이 구현될 수 있다. 사용자 입력부는 사용자로부터 정보를 입력받기 위한 것으로서, 사용자 입력부를 통해 정보가 입력되 면, 제어부는 입력된 정보에 대응되도록 이동 단말기의 동작을 제어할 수 있다. 이러한, 사용자 입력 부는 기계식 (mechanical) 입력수단(또는, 메커니컬 키, 예를 들어, 이동 단말기의 전·후면 또는 측 면에 위치하는 버튼, 돔 스위치 (dome switch), 조그 휠, 조그 스위치 등) 및 터치식 입력수단을 포함할 수 있 다. 일 예로서, 터치식 입력수단은, 소프트웨어적인 처리를 통해 터치스크린에 표시되는 가상 키(virtual key), 소프트 키(soft key) 또는 비주얼 키(visual key)로 이루어지거나, 상기 터치스크린 이외의 부분에 배치되는 터 치 키(touch key)로 이루어질 수 있다. 한편, 상기 가상키 또는 비주얼 키는, 다양한 형태를 가지면서 터치스크 린 상에 표시되는 것이 가능하며, 예를 들어, 그래픽(graphic), 텍스트(text), 아이콘(icon), 비디오(video) 또 는 이들의 조합으로 이루어질 수 있다. 한편, 센싱부는 이동 단말기 내 정보, 이동 단말기를 둘러싼 주변 환경 정보 및 사용자 정보 중 적어도 하 나를 센싱하고, 이에 대응하는 센싱 신호를 발생시킨다. 제어부는 이러한 센싱 신호에 기초하여, 이동 단 말기의 구동 또는 동작을 제어하거나, 이동 단말기에 설치된 응용 프로그램과 관련된 데이터 처리, 기능 또는 동작을 수행 할 수 있다. 센싱부에 포함될 수 있는 다양한 센서 중 대표적인 센서들의 대하여, 보다 구체적으로 살펴본다. 먼저, 근접 센서는 소정의 검출면에 접근하는 물체, 혹은 근방에 존재하는 물체의 유무를 전자계의 힘 또 는 적외선 등을 이용하여 기계적 접촉이 없이 검출하는 센서를 말한다. 이러한 근접 센서는 위에서 살펴본 터치 스크린에 의해 감싸지는 이동 단말기의 내부 영역 또는 상기 터치 스크린의 근처에 근접 센서가 배치 될 수 있다. 근접 센서의 예로는 투과형광전 센서, 직접 반사형광전 센서, 미러반사형광전 센서, 고주파 발진형 근접 센서, 정전 용량형 근접 센서, 자기형 근접 센서, 적외선 근접 센서 등이 있다. 터치 스크린이 정전식인 경우에, 근접 센서는 전도성을 갖는 물체의 근접에 따른 전계의 변화로 상기 물체의 근접을 검출하도록 구 성될 수 있다. 이 경우 터치 스크린(또는 터치 센서) 자체가 근접 센서로 분류될 수 있다. 한편, 설명의 편의를 위해, 터치 스크린 상에 물체가 접촉되지 않으면서 근접되어 상기 물체가 상기 터치 스크 린 상에 위치함이 인식되도록 하는 행위를 \"근접 터치(proximity touch)\"라고 명명하고, 상기 터치 스크린 상에 물체가 실제로 접촉되는 행위를 \"접촉 터치(contact touch)\"라고 명명한다. 상기 터치 스크린 상에서 물체가 근 접 터치 되는 위치라 함은, 상기 물체가 근접 터치될 때 상기 물체가 상기 터치 스크린에 대해 수직으로 대응되 는 위치를 의미한다. 상기 근접 센서는, 근접 터치와, 근접 터치 패턴(예를 들어, 근접 터치 거리, 근접 터치 방향, 근접 터치 속도, 근접 터치 시간, 근접 터치 위치, 근접 터치 이동 상태 등)을 감지할 수 있다. 한 편, 제어부는 위와 같이, 근접 센서를 통해 감지된 근접 터치 동작 및 근접 터치 패턴에 상응하는 데 이터(또는 정보)를 처리하며, 나아가, 처리된 데이터에 대응하는 시각적인 정보를 터치 스크린상에 출력시킬 수 있다. 나아가, 제어부는, 터치 스크린 상의 동일한 지점에 대한 터치가, 근접 터치인지 또는 접촉 터치인 지에 따라, 서로 다른 동작 또는 데이터(또는 정보)가 처리되도록 이동 단말기를 제어할 수 있다. 터치 센서는 저항막 방식, 정전용량 방식, 적외선 방식, 초음파 방식, 자기장 방식 등 여러가지 터치방식 중 적 어도 하나를 이용하여 터치 스크린(또는 디스플레이부)에 가해지는 터치(또는 터치입력)을 감지한다. 일 예로서, 터치 센서는, 터치 스크린의 특정 부위에 가해진 압력 또는 특정 부위에 발생하는 정전 용량 등의 변화를 전기적인 입력신호로 변환하도록 구성될 수 있다. 터치 센서는, 터치 스크린 상에 터치를 가하는 터치 대상체가 터치 센서 상에 터치 되는 위치, 면적, 터치 시의 압력, 터치 시의 정전 용량 등을 검출할 수 있도록 구성될 수 있다. 여기에서, 터치 대상체는 상기 터치 센서에 터치를 인가하는 물체로서, 예를 들어, 손가락, 터 치펜 또는 스타일러스 펜(Stylus pen), 포인터 등이 될 수 있다. 이와 같이, 터치 센서에 대한 터치 입력이 있는 경우, 그에 대응하는 신호(들)는 터치 제어기로 보내진다. 터치 제어기는 그 신호(들)를 처리한 다음 대응하는 데이터를 제어부로 전송한다. 이로써, 제어부는 디스플레이부의 어느 영역이 터치 되었는지 여부 등을 알 수 있게 된다. 여기에서, 터치 제어기는, 제어부 와 별도의 구성요소일 수 있고, 제어부 자체일 수 있다. 한편, 제어부는, 터치 스크린(또는 터치 스크린 이외에 구비된 터치키)을 터치하는, 터치 대상체의 종류에 따라 서로 다른 제어를 수행하거나, 동일한 제어를 수행할 수 있다. 터치 대상체의 종류에 따라 서로 다른 제어 를 수행할지 또는 동일한 제어를 수행할 지는, 현재 이동 단말기의 동작상태 또는 실행 중인 응용 프로그 램에 따라 결정될 수 있다. 한편, 위에서 살펴본 터치 센서 및 근접 센서는 독립적으로 또는 조합되어, 터치 스크린에 대한 숏(또는 탭) 터 치(short touch), 롱 터치(long touch), 멀티 터치(multi touch), 드래그 터치(drag touch), 플리크 터치 (flick touch), 핀치-인 터치(pinch-in touch), 핀치-아웃 터치(pinch-out 터치), 스와이프(swype) 터치, 호버 링(hovering) 터치 등과 같은, 다양한 방식의 터치를 센싱할 수 있다. 초음파 센서는 초음파를 이용하여, 감지대상의 위치정보를 인식할 수 있다. 한편 제어부는 광 센서와 복수 의 초음파 센서로부터 감지되는 정보를 통해, 파동 발생원의 위치를 산출하는 것이 가능하다. 파동 발생원의 위 치는, 광이 초음파보다 매우 빠른 성질, 즉, 광이 광 센서에 도달하는 시간이 초음파가 초음파 센서에 도달하는 시간보다 매우 빠름을 이용하여, 산출될 수 있다. 보다 구체적으로 광을 기준 신호로 초음파가 도달하는 시간과 의 시간차를 이용하여 파동 발생원의 위치가 산출될 수 있다. 한편, 입력부의 구성으로 살펴본, 카메라는 카메라 센서(예를 들어, CCD, CMOS 등), 포토 센서(또는 이미지 센서) 및 레이저 센서 중 적어도 하나를 포함한다. 카메라와 레이저 센서는 서로 조합되어, 3차원 입체영상에 대한 감지대상의 터치를 감지할 수 있다. 포토 센서는 디스플레이 소자에 적층될 수 있는데, 이러한 포토 센서는 터치 스크린에 근접한 감지대상의 움직임을 스캐닝하도록 이루어진다. 보다 구체적으로, 포토 센서는 행/열에 Photo Diode와 TR(Transistor)를 실장하여 Photo Diode에 인가되는 빛의 양에 따라 변화되는 전기적 신호를 이용하여 포토 센서 위에 올려지는 내용물을 스캔한다. 즉, 포토 센서는 빛의 변화량에 따른 감지대상의 좌표 계산을 수행하며, 이를 통하여 감지대상의 위 치정보가 획득될 수 있다. 디스플레이부는 이동 단말기에서 처리되는 정보를 표시(출력)한다. 예를 들어, 디스플레이부는 이동 단말기에서 구동되는 응용 프로그램의 실행화면 정보, 또는 이러한 실행화면 정보에 따른 UI(User Interface), GUI(Graphic User Interface) 정보를 표시할 수 있다. 또한, 상기 디스플레이부는 입체영상을 표시하는 입체 디스플레이부로서 구성될 수 있다. 상기 입체 디스플레이부에는스테레오스코픽 방식(안경 방식), 오토 스테레오스코픽 방식(무안경 방식), 프로젝 션 방식(홀로그래픽 방식) 등의 3차원 디스플레이 방식이 적용될 수 있다. 음향 출력부는 호신호 수신, 통화모드 또는 녹음 모드, 음성인식 모드, 방송수신 모드 등에서 무선 통신부 로부터 수신되거나 메모리에 저장된 오디오 데이터를 출력할 수 있다. 음향 출력부는 이동 단말 기에서 수행되는 기능(예를 들어, 호신호 수신음, 메시지 수신음 등)과 관련된 음향 신호를 출력하기도 한 다. 이러한 음향 출력부에는 리시버(receiver), 스피커(speaker), 버저(buzzer) 등이 포함될 수 있다. 햅틱 모듈(haptic module)은 사용자가 느낄 수 있는 다양한 촉각 효과를 발생시킨다. 햅틱 모듈이 발 생시키는 촉각 효과의 대표적인 예로는 진동이 될 수 있다. 햅틱 모듈에서 발생하는 진동의 세기와 패턴 등은 사용자의 선택 또는 제어부의 설정에 의해 제어될 수 있다. 예를 들어, 상기 햅틱 모듈은 서로 다른 진동을 합성하여 출력하거나 순차적으로 출력할 수도 있다. 햅틱 모듈은, 진동 외에도, 접촉 피부면에 대해 수직 운동하는 핀 배열, 분사구나 흡입구를 통한 공기의 분사력이나 흡입력, 피부 표면에 대한 스침, 전극(electrode)의 접촉, 정전기력 등의 자극에 의한 효과와, 흡열 이나 발열 가능한 소자를 이용한 냉온감 재현에 의한 효과 등 다양한 촉각 효과를 발생시킬 수 있다. 햅틱 모듈은 직접적인 접촉을 통해 촉각 효과를 전달할 수 있을 뿐만 아니라, 사용자가 손가락이나 팔 등 의 근 감각을 통해 촉각 효과를 느낄 수 있도록 구현할 수도 있다. 햅틱 모듈은 이동 단말기의 구성 태양에 따라 2개 이상이 구비될 수 있다. 광출력부는 이동 단말기의 광원의 빛을 이용하여 이벤트 발생을 알리기 위한 신호를 출력한다. 이동 단말기에서 발생 되는 이벤트의 예로는 메시지 수신, 호 신호 수신, 부재중 전화, 알람, 일정 알림, 이메일 수신, 애플리케이션을 통한 정보 수신 등이 될 수 있다. 광출력부가 출력하는 신호는 이동 단말기가 전면이나 후면으로 단색이나 복수색의 빛을 발광함에 따라 구 현된다. 상기 신호 출력은 이동 단말기가 사용자의 이벤트 확인을 감지함에 의하여 종료될 수 있다. 인터페이스부는 이동 단말기에 연결되는 모든 외부 기기와의 통로 역할을 한다. 인터페이스부는 외부 기기로부터 데이터를 전송받거나, 전원을 공급받아 이동 단말기 내부의 각 구성요소에 전달하거나, 이동 단말기 내부의 데이터가 외부 기기로 전송되도록 한다. 예를 들어, 유/무선 헤드셋 포트(port), 외부 충전기 포트(port), 유/무선 데이터 포트(port), 메모리 카드(memory card) 포트(port), 식별 모듈이 구비된 장치를 연결하는 포트(port), 오디오 I/O(Input/Output) 포트(port), 비디오 I/O(Input/Output) 포트(port), 이어폰 포트(port) 등이 인터페이스부에 포함될 수 있다. 한편, 식별 모듈은 이동 단말기의 사용 권한을 인증하기 위한 각종 정보를 저장한 칩으로서, 사용자 인증 모듈(user identify module; UIM), 가입자 인증 모듈(subscriber identity module; SIM), 범용 사용자 인증 모 듈(universal subscriber identity module; USIM) 등을 포함할 수 있다. 식별 모듈이 구비된 장치(이하 '식별 장치')는, 스마트 카드(smart card) 형식으로 제작될 수 있다. 따라서 식별 장치는 상기 인터페이스부를 통하여 단말기와 연결될 수 있다. 또한, 상기 인터페이스부는 이동 단말기가 외부 크래들(cradle)과 연결될 때 상기 크래들로부터의 전 원이 상기 이동 단말기에 공급되는 통로가 되거나, 사용자에 의해 상기 크래들에서 입력되는 각종 명령 신 호가 상기 이동 단말기로 전달되는 통로가 될 수 있다. 상기 크래들로부터 입력되는 각종 명령 신호 또는 상기 전원은 상기 이동 단말기가 상기 크래들에 정확히 장착되었음을 인지하기 위한 신호로 동작될 수 있 다. 메모리는 제어부의 동작을 위한 프로그램을 저장할 수 있고, 입/출력되는 데이터들(예를 들어, 폰북, 메시지, 정지영상, 동영상 등)을 임시 저장할 수도 있다. 상기 메모리는 상기 터치 스크린 상의 터치 입력 시 출력되는 다양한 패턴의 진동 및 음향에 관한 데이터를 저장할 수 있다. 메모리는 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), SSD 타입(Solid State Disk type), SDD 타입(Silicon Disk Drive type), 멀티미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 램(random access memory; RAM), SRAM(static random access memory), 롬(read-only memory; ROM), EEPROM(electrically erasable programmable read-only memory), PROM(programmable read-only memory), 자기 메모리, 자기 디스크 및 광디스 크 중 적어도 하나의 타입의 저장매체를 포함할 수 있다. 이동 단말기는 인터넷(internet)상에서 상기 메 모리의 저장 기능을 수행하는 웹 스토리지(web storage)와 관련되어 동작될 수도 있다. 한편, 앞서 살펴본 것과 같이, 제어부는 응용 프로그램과 관련된 동작과, 통상적으로 이동 단말기의 전반적인 동작을 제어한다. 예를 들어, 제어부는 상기 이동 단말기의 상태가 설정된 조건을 만족하면, 애 플리케이션들에 대한 사용자의 제어 명령의 입력을 제한하는 잠금 상태를 실행하거나, 해제할 수 있다. 또한, 제어부는 음성 통화, 데이터 통신, 화상 통화 등과 관련된 제어 및 처리를 수행하거나, 터치 스크린 상에서 행해지는 필기 입력 또는 그림 그리기 입력을 각각 문자 및 이미지로 인식할 수 있는 패턴 인식 처리를 행할 수 있다. 나아가 제어부는 이하에서 설명되는 다양한 실시 예들을 본 발명에 따른 이동 단말기 상에서 구현하기 위하여, 위에서 살펴본 구성요소들을 중 어느 하나 또는 복수를 조합하여 제어할 수 있다. 전원 공급부는 제어부의 제어에 의해 외부의 전원, 내부의 전원을 인가 받아 각 구성요소들의 동작에 필요한 전원을 공급한다. 전원공급부는 배터리를 포함하며, 배터리는 충전 가능하도록 이루어지는 내장형 배터리가 될 수 있으며, 충전 등을 위하여 단말기 바디에 착탈 가능하게 결합될 수 있다. 또한, 전원공급부는 연결포트를 구비할 수 있으며, 연결포트는 배터리의 충전을 위하여 전원을 공급하는 외부 충전기가 전기적으로 연결되는 인터페이스의 일 예로서 구성될 수 있다. 다른 예로서, 전원공급부는 상기 연결포트를 이용하지 않고 무선방식으로 배터리를 충전하도록 이루어질 수 있다. 이 경우에, 전원공급부는 외부의 무선 전력 전송장치로부터 자기 유도 현상에 기초한 유도 결합 (Inductive Coupling) 방식이나 전자기적 공진 현상에 기초한 공진 결합(Magnetic Resonance Coupling) 방식 중 하나 이상을 이용하여 전력을 전달받을 수 있다. 한편, 이하에서 다양한 실시 예는 예를 들어, 소프트웨어, 하드웨어 또는 이들의 조합된 것을 이용하여 컴퓨터 또는 이와 유사한 장치로 읽을 수 있는 기록매체 내에서 구현될 수 있다. 도 1 b 및 1c를 참조하면, 개시된 이동 단말기는 바 형태의 단말기 바디를 구비하고 있다. 다만, 본 발명 은 여기에 한정되지 않고 와치 타입, 클립 타입, 글래스 타입 또는 2 이상의 바디들이 상대 이동 가능하게 결합 되는 폴더 타입, 플립 타입, 슬라이드 타입, 스윙 타입, 스위블 타입 등 다양한 구조에 적용될 수 있다. 이동 단말기의 특정 유형에 관련될 것이나, 이동 단말기의 특정유형에 관한 설명은 다른 타입의 이동 단말기에 일반 적으로 적용될 수 있다. 여기에서, 단말기 바디는 이동 단말기를 적어도 하나의 집합체로 보아 이를 지칭하는 개념으로 이해될 수 있다. 이동 단말기는 외관을 이루는 케이스(예를 들면, 프레임, 하우징, 커버 등)를 포함한다. 도시된 바와 같이, 이동 단말기는 프론트 케이스와 리어 케이스를 포함할 수 있다. 프론트 케이스와 리 어 케이스의 결합에 의해 형성되는 내부공간에는 각종 전자부품들이 배치된다. 프론트 케이스와 리어 케이스 사이에는 적어도 하나의 미들 케이스가 추가로 배치될 수 있다. 단말기 바디의 전면에는 디스플레이부가 배치되어 정보를 출력할 수 있다. 도시된 바와 같이, 디스플레이 부의 윈도우(151a)는 프론트 케이스에 장착되어 프론트 케이스와 함께 단말기 바디의 전면을 형 성할 수 있다. 경우에 따라서, 리어 케이스에도 전자부품이 장착될 수 있다. 리어 케이스에 장착 가능한 전자부품은 착탈 가능한 배터리, 식별 모듈, 메모리 카드 등이 있다. 이 경우, 리어 케이스에는 장착된 전자부품을 덮 기 위한 후면커버가 착탈 가능하게 결합될 수 있다. 따라서, 후면 커버가 리어 케이스로부터 분 리되면, 리어 케이스에 장착된 전자부품은 외부로 노출된다. 도시된 바와 같이, 후면커버가 리어 케이스에 결합되면, 리어 케이스의 측면 일부가 노출될 수 있다. 경우에 따라서, 상기 결합시리어 케이스는 후면커버에 의해 완전히 가려질 수도 있다. 한편, 후면커버에는 카메라(121b)나 음향 출력부(152b)를 외부로 노출시키기 위한 개구부가 구비될 수 있다. 이러한 케이스들(101, 102, 103)은 합성수지를 사출하여 형성되거나 금속, 예를 들어 스테인레스스틸(STS), 알 루미늄(Al), 티타늄(Ti) 등으로 형성될 수도 있다. 이동 단말기는, 복수의 케이스가 각종 전자부품들을 수용하는 내부 공간을 마련하는 위의 예와 달리, 하나 의 케이스가 상기 내부 공간을 마련하도록 구성될 수도 있다. 이 경우, 합성수지 또는 금속이 측면에서 후면으 로 이어지는 유니 바디의 이동 단말기가 구현될 수 있다. 한편, 이동 단말기는 단말기 바디 내부로 물이 스며들지 않도록 하는 방수부(미도시)를 구비할 수 있다. 예를 들어, 방수부는 윈도우(151a)와 프론트 케이스 사이, 프론트 케이스와 리어 케이스 사이 또는 리어 케이스와 후면 커버 사이에 구비되어, 이들의 결합 시 내부 공간을 밀폐하는 방수부재를 포함할 수 있다. 이동 단말기에는 디스플레이부, 제1 및 제2 음향 출력부(152a, 152b), 근접 센서, 조도 센서 , 광 출력부, 제1 및 제2 카메라(121a, 121b), 제1 및 제2 조작유닛(123a, 123b), 마이크로폰, 인터페이스부 등이 구비될 수 있다. 이하에서는, 도 1b 및 도 1c에 도시된 바와 같이, 단말기 바디의 전면에 디스플레이부, 제1 음향 출력부 (152a), 근접 센서, 조도 센서, 광 출력부, 제1 카메라(121a) 및 제1 조작유닛(123a)이 배치되 고, 단말기 바디의 측면에 제2 조작유닛(123b), 마이크로폰 및 인터페이스부가 배치되며, 단말기 바 디의 후면에 제2 음향 출력부(152b) 및 제2 카메라(121b)가 배치된 이동 단말기를 일 예로 들어 설명한다. 다만, 이들 구성은 이러한 배치에 한정되는 것은 아니다. 이들 구성은 필요에 따라 제외 또는 대체되거나, 다른 면에 배치될 수 있다. 예를 들어, 단말기 바디의 전면에는 제1 조작유닛(123a)이 구비되지 않을 수 있으며, 제2 음향 출력부(152b)는 단말기 바디의 후면이 아닌 단말기 바디의 측면에 구비될 수 있다. 디스플레이부는 이동 단말기에서 처리되는 정보를 표시(출력)한다. 예를 들어, 디스플레이부는 이동 단말기에서 구동되는 응용 프로그램의 실행화면 정보, 또는 이러한 실행화면 정보에 따른 UI(User Interface), GUI(Graphic User Interface) 정보를 표시할 수 있다. 디스플레이부는 액정 디스플레이(liquid crystal display, LCD), 박막 트랜지스터 액정 디스플레이(thin film transistor-liquid crystal display, TFT LCD), 유기 발광 다이오드(organic light-emitting diode, OLED), 플렉서블 디스플레이(flexible display), 3차원 디스플레이(3D display), 전자잉크 디스플레이(e-ink display) 중에서 적어도 하나를 포함할 수 있다. 또한, 디스플레이부는 이동 단말기의 구현 형태에 따라 2개 이상 존재할 수 있다. 이 경우, 이동 단 말기에는 복수의 디스플레이부들이 하나의 면에 이격되거나 일체로 배치될 수 있고, 또한 서로 다른 면에 각각 배치될 수도 있다. 디스플레이부는 터치 방식에 의하여 제어 명령을 입력 받을 수 있도록, 디스플레이부에 대한 터치를 감지하는 터치센서를 포함할 수 있다. 이를 이용하여, 디스플레이부에 대하여 터치가 이루어지면, 터치센 서는 상기 터치를 감지하고, 제어부는 이에 근거하여 상기 터치에 대응하는 제어명령을 발생시키도록 이루 어질 수 있다. 터치 방식에 의하여 입력되는 내용은 문자 또는 숫자이거나, 각종 모드에서의 지시 또는 지정 가 능한 메뉴항목 등일 수 있다. 한편, 터치센서는, 터치패턴을 구비하는 필름 형태로 구성되어 윈도우(151a)와 윈도우(151a)의 배면 상의 디스 플레이(미도시) 사이에 배치되거나, 윈도우(151a)의 배면에 직접 패터닝되는 메탈 와이어가 될 수도 있다. 또는, 터치센서는 디스플레이와 일체로 형성될 수 있다. 예를 들어, 터치센서는, 디스플레이의 기판 상에 배치 되거나, 디스플레이의 내부에 구비될 수 있다. 이처럼, 디스플레이부는 터치센서와 함께 터치 스크린을 형성할 수 있으며, 이 경우에 터치 스크린은 사용 자 입력부(123, 도 1a 참조)로 기능할 수 있다. 경우에 따라, 터치 스크린은 제1조작유닛(123a)의 적어도 일부 기능을 대체할 수 있다. 제1 음향 출력부(152a)는 통화음을 사용자의 귀에 전달시키는 리시버(receiver)로 구현될 수 있으며, 제2 음향 출력부(152b)는 각종 알람음이나 멀티미디어의 재생음을 출력하는 라우드 스피커(loud speaker)의 형태로 구현 될 수 있다. 디스플레이부의 윈도우(151a)에는 제1 음향 출력부(152a)로부터 발생되는 사운드의 방출을 위한 음향홀이 형성될 수 있다. 다만, 본 발명은 이에 한정되는 것은 아니고, 상기 사운드는 구조물 간의 조립틈(예를 들어, 윈도우(151a)와 프론트 케이스 간의 틈)을 따라 방출되도록 구성될 수 있다. 이 경우, 외관상 음향 출력을 위하여 독립적으로 형성되는 홀이 보이지 않거나 숨겨져 이동 단말기의 외관이 보다 심플해질 수 있다. 광 출력부는 이벤트의 발생시 이를 알리기 위한 빛을 출력하도록 이루어진다. 상기 이벤트의 예로는 메시 지 수신, 호 신호 수신, 부재중 전화, 알람, 일정 알림, 이메일 수신, 애플리케이션을 통한 정보 수신 등을 들 수 있다. 제어부는 사용자의 이벤트 확인이 감지되면, 빛의 출력이 종료되도록 광 출력부를 제어할 수 있다. 제1 카메라(121a)는 촬영 모드 또는 화상통화 모드에서 이미지 센서에 의해 얻어지는 정지영상 또는 동영상의 화상 프레임을 처리한다. 처리된 화상 프레임은 디스플레이부에 표시될 수 있으며, 메모리에 저장될 수 있다. 제1 및 제2 조작유닛(123a, 123b)은 이동 단말기의 동작을 제어하기 위한 명령을 입력 받기 위해 조작되는 사용자 입력부의 일 예로서, 조작부(manipulating portion)로도 통칭될 수 있다. 제1 및 제2 조작유닛 (123a, 123b)은 터치, 푸시, 스크롤 등 사용자가 촉각적인 느낌을 받으면서 조작하게 되는 방식(tactile manner)이라면 어떤 방식이든 채용될 수 있다. 또한, 제1 및 제2 조작유닛(123a, 123b)은 근접 터치(proximity touch), 호버링(hovering) 터치 등을 통해서 사용자의 촉각적인 느낌이 없이 조작하게 되는 방식으로도 채용될 수 있다. 본 도면에서는 제1 조작유닛(123a)이 터치키(touch key)인 것으로 예시하나, 본 발명이 이에 한정되는 것은 아 니다. 예를 들어, 제1 조작유닛(123a)은 푸시키(mechanical key)가 되거나, 터치키와푸시키의 조합으로 구성될 수 있다. 제1 및 제2 조작유닛(123a, 123b)에 의하여 입력되는 내용은 다양하게 설정될 수 있다. 예를 들어, 제1 조작유 닛(123a)은 메뉴, 홈키, 취소, 검색 등의 명령을 입력 받고, 제2 조작유닛(123b)은 제1 또는 제2 음향 출력부 (152a, 152b)에서 출력되는 음향의 크기 조절, 디스플레이부의 터치 인식 모드로의 전환 등의 명령을 입력 받을 수 있다. 한편, 단말기 바디의 후면에는 사용자 입력부의 다른 일 예로서, 후면 입력부(미도시)가 구비될 수 있다. 이러한 후면 입력부는 이동 단말기의 동작을 제어하기 위한 명령을 입력 받기 위해 조작되는 것으로서, 입 력되는 내용은 다양하게 설정될 수 있다. 예를 들어, 전원의 온/오프, 시작, 종료, 스크롤 등과 같은 명령, 제1 및 제2 음향 출력부(152a, 152b)에서 출력되는 음향의 크기 조절, 디스플레이부의 터치 인식 모드로의 전 환 등과 같은 명령을 입력 받을 수 있다. 후면 입력부는 터치입력, 푸시입력 또는 이들의 조합에 의한 입력이 가능한 형태로 구현될 수 있다. 후면 입력부는 단말기 바디의 두께방향으로 전면의 디스플레이부와 중첩되게 배치될 수 있다. 일 예로, 사 용자가 단말기 바디를 한 손으로 쥐었을 때 검지를 이용하여 용이하게 조작 가능하도록, 후면 입력부는 단말기 바디의 후면 상단부에 배치될 수 있다. 다만, 본 발명은 반드시 이에 한정되는 것은 아니며, 후면 입력부의 위 치는 변경될 수 있다. 이처럼 단말기 바디의 후면에 후면 입력부가 구비되는 경우, 이를 이용한 새로운 형태의 유저 인터페이스가 구 현될 수 있다. 또한, 앞서 설명한 터치 스크린 또는 후면 입력부가 단말기 바디의 전면에 구비되는 제1 조작유 닛(123a)의 적어도 일부 기능을 대체하여, 단말기 바디의 전면에 제1 조작유닛(123a)이 미배치되는 경우, 디스 플레이부가 보다 대화면으로 구성될 수 있다. 한편, 이동 단말기에는 사용자의 지문을 인식하는 지문인식센서가 구비될 수 있으며, 제어부는 지문 인식센서를 통하여 감지되는 지문정보를 인증수단으로 이용할 수 있다. 상기 지문인식센서는 디스플레이부 또는 사용자 입력부에 내장될 수 있다. 마이크로폰은 사용자의 음성, 기타 소리 등을 입력 받도록 이루어진다. 마이크로폰은 복수의 개소에 구비되어 스테레오 음향을 입력 받도록 구성될 수 있다. 인터페이스부는 이동 단말기를 외부기기와 연결시킬 수 있는 통로가 된다. 예를 들어, 인터페이스부 는 다른 장치(예를 들어, 이어폰, 외장 스피커)와의 연결을 위한 접속단자, 근거리 통신을 위한 포트[예를 들어, 적외선 포트(IrDA Port), 블루투스 포트(Bluetooth Port), 무선 랜 포트(Wireless LAN Port) 등], 또는 이동 단말기에 전원을 공급하기 위한 전원공급단자 중 적어도 하나일 수 있다. 이러한 인터페이스부 는 SIM(Subscriber Identification Module) 또는 UIM(User Identity Module), 정보 저장을 위한 메모리 카드 등의 외장형 카드를 수용하는 소켓의 형태로 구현될 수도 있다. 단말기 바디의 후면에는 제2카메라(121b)가 배치될 수 있다. 이 경우, 제2카메라(121b)는 제1카메라(121a)와 실 질적으로 반대되는 촬영 방향을 가지게 된다. 제2카메라(121b)는 적어도 하나의 라인을 따라 배열되는 복수의 렌즈를 포함할 수 있다. 복수의 렌즈는 행렬 (matrix) 형식으로 배열될 수도 있다. 이러한 카메라는, '어레이(array) 카메라'로 명명될 수 있다. 제2카메라 (121b)가 어레이 카메라로 구성되는 경우, 복수의 렌즈를 이용하여 다양한 방식으로 영상을 촬영할 수 있으며, 보다 나은 품질의 영상을 획득할 수 있다. 플래시는 제2카메라(121b)에 인접하게 배치될 수 있다. 플래시는 제2카메라(121b)로 피사체를 촬영하 는 경우에 피사체를 향하여 빛을 비추게 된다. 단말기 바디에는 제2 음향 출력부(152b)가 추가로 배치될 수 있다. 제2 음향 출력부(152b)는 제1 음향 출력부 (152a)와 함께 스테레오 기능을 구현할 수 있으며, 통화시 스피커폰 모드의 구현을 위하여 사용될 수도 있다. 단말기 바디에는 무선 통신을 위한 적어도 하나의 안테나가 구비될 수 있다. 안테나는 단말기 바디에 내장되거 나, 케이스에 형성될 수 있다. 예를 들어, 방송 수신 모듈(111, 도 1a 참조)의 일부를 이루는 안테나는 단말기 바디에서 인출 가능하게 구성될 수 있다. 또는, 안테나는 필름 타입으로 형성되어 후면 커버의 내측면에 부착될 수도 있고, 도전성 재질을 포함하는 케이스가 안테나로서 기능하도록 구성될 수도 있다. 단말기 바디에는 이동 단말기에 전원을 공급하기 위한 전원 공급부(190, 도 1a 참조)가 구비된다. 전원 공 급부는 단말기 바디에 내장되거나, 단말기 바디의 외부에서 착탈 가능하게 구성되는 배터리를 포함할 수 있다. 배터리는 인터페이스부에 연결되는 전원 케이블을 통하여 전원을 공급받도록 구성될 수 있다. 또한, 배터리는 무선충전기기를 통하여 무선충전 가능하도록 구성될 수도 있다. 상기 무선충전은 자기유도방식 또는 공진방식(자기공명방식)에 의하여 구현될 수 있다. 한편, 본 도면에서는 후면 커버가 배터리를 덮도록 리어 케이스에 결합되어 배터리의 이탈 을 제한하고, 배터리를 외부 충격과 이물질로부터 보호하도록 구성된 것을 예시하고 있다. 배터리가 단말기 바디에 착탈 가능하게 구성되는 경우, 후면 커버는 리어 케이스에 착탈 가능하게 결합될 수 있다. 이동 단말기에는 외관을 보호하거나, 이동 단말기의 기능을 보조 또는 확장시키는 액세서리가 추가될 수 있다. 이러한 액세서리의 일 예로, 이동 단말기의 적어도 일면을 덮거나 수용하는 커버 또는 파우치를 들 수 있다. 커버 또는 파우치는 디스플레이부와 연동되어 이동 단말기의 기능을 확장시키도록 구성 될 수 있다. 액세서리의 다른 일 예로, 터치 스크린에 대한 터치입력을 보조 또는 확장하기 위한 터치펜을 들 수 있다. 상술한 이동 단말기에 포함된 무선 통신부, 입력부, 출력부를 이용하면 외부기기와 다양한 방식 의 커뮤니케이션을 수행할 수 있다. 입력부는 사용자로부터 커뮤니케이션 정보를 수신한다. 무선 통신부 는 입력부를 통해 입력 받은 정보를 외부기기로 송신하며, 외부기기로부터 송신된 커뮤니케이션 정보 를 수신한다. 출력부는 외부기기로부터 수신된 커뮤니케이션 정보를 출력한다. 본 명세서에서 커뮤니케이션 정보는 이동 단말기와 외부 단말기간에 커뮤니케이션을 수행하기 위해 송수신되는 모든 형태의 정보로 정의된다. 여기서, 커뮤니케이션 정보는 다양한 형태를 가질 수 있다. 예를 들어, 커뮤니케 이션 정보는 음성 정보, 영상 정보 및 텍스트 정보 중 적어도 하나일 수 있으나, 이에 한정되지 않는다. 커뮤니 케이션 정보의 형태는 커뮤니케이션 방식에 따라 달라질 수 있다. 구체적으로, 커뮤니케이션 방식이 청각적 수 단을 이용한 방식인 경우, 커뮤니케이션 정보는 음성 정보이고, 커뮤니케이션 방식이 시각적 수단을 이용한 방 식인 경우, 커뮤니케이션 정보는 영상 정보 및 텍스트 정보 중 적어도 하나일 수 있다. 한편, 본 명세서에서는 전화 통화 단말기간에 송수신되는 신호 또한 커뮤니케이션 정보로 정의한다. 한편, 커뮤니케이션 정보는 그 형태에 따라 서로 다른 입력 수단으로 입력될 수 있다. 예를 들어, 음성 정보, 영상 정보 및 텍스트 정보 각각은 마이크, 카메라 및 터치스크린에 의하여 입력될 수 있다. 구 체적으로, 음성 정보는 마이크를 통해, 영상 정보는 카메라를 통해, 텍스트 정보는 터치스크린 을 통해 입력될 수 있다. 한편, 커뮤니케이션 정보는 그 정보의 형태에 따라 서로 다른 출력 수단으로 출력될 수 있다. 예를 들어, 음성 정보는 스피커를 통해, 영상 정보 및 텍스트 정보는 터치스크린을 통해 출력될 수 있다. 상술한 바와 같이, 이동 단말기는 커뮤니케이션 방식에 따라 서로 다른 입력 및 출력 수단을 활용한다. 여기서, 커뮤니케이션 방식은 커뮤니케이션 이벤트를 발생시키는 주체에 의해서 결정된다. 본 명세서에서 커뮤니케이션 이벤트란, 이동 단말기를 이용한 커뮤니케이션의 시발점이 되는 이벤트이거나, 커 뮤니케이션 정보를 수신하는 것 그 자체로 정의된다. 커뮤니케이션 이벤트가 커뮤니케이션의 시발점이 되는 경우를 예로 들면, 커뮤니케이션 이벤트는 외부기기로부 터 호 연결을 위한 호 신호를 수신하는 것일 수 있다. 이때, 커뮤니케이션 정보는 커뮤니케이션 이벤트에 대한 사용자 요청이 있을 때만 수신될 수 있다. 예를 들어, 외부기기로부터 호 신호를 수신하는 경우, 이동 단말기는 사용자의 호 연결 요청이 있는 경우에만, 음성 정보를 수신할 수 있다 한편, 커뮤니케이션 이벤트가 커뮤니케이션 정보를 수신하는 것 그 자체인 경우를 예로 들면, 커뮤니케이션 이 벤트는 외부기기로부터 영상 또는 텍스트 메시지를 수신하는 것일 수 있다. 커뮤니케이션 정보의 형태는 커뮤니케이션 이벤트를 발생시킨 외부기기에서 송신한 형태에 따라 결정된다. 커뮤니케이션 이벤트가 발생되면, 상기 커뮤니케이션 정보는 기 설정된 메모리에 저장될 수 있다. 여기서, 상기 커뮤니케이션 정보는 외부 단말기와 송수신한 정보 그 자체를 포함할 뿐 아니라, 특정 커뮤니케이션 이벤트와 다른 커뮤니케이션 이벤트를 구분할 수 있도록 특정 커뮤니케이션 이벤트 자체를 정의하는 정보를 의미한다. 예 를 들어, 상기 커뮤니케이션 정보는 커뮤니케이션 이벤트의 발생 시점, 커뮤니케이션 정보의 종류, 커뮤니케이 션 정보의 저장 위치(Location ID), 외부 단말기 정보 등을 포함할 수 있다. 다만, 이에 한정되지 않는다. 본 발명은 상기 커뮤니케이션 정보에 대한 검색을 용이하게 할 수 있도록 하기 위한 발명이다. 이를 위해, 본원발명은 상기 커뮤니케이션 정보를 서로 매칭시켜 저장한다. 이하, 상기 커뮤니케이션 정보 및 커뮤니케이션 이벤트를 저장하는 방법에 대하여 구체적으로 설명한다.도 2는 커뮤니케이션 정보 및 커뮤니케이션 이벤트와 관련된 정보를 다른 정보와 매칭시켜 저장하는 방법을 나 타내는 개념도이다. 도 2를 참조하면, 이동 단말기에서 커뮤니케이션 이벤트가 발생되면, 커뮤니케이션 정보는 기 설정된 메모 리에 저장된다. 여기서, 상기 커뮤니케이션 이벤트의 종류에 따라, 커뮤니케이션 정보는 서로 다른 데이터 베이스에 저장될 수 있다. 제어부는 메모리에 새로운 정보가 저장될 때마다 이를 모니터링(230, 240)하여, 상기 새로운 정보에 이동 단말기에서 수집할 수 있는 다른 정보를 매칭시켜 저장한다. 구체적으로, 제어부는 커뮤니케이션 이벤트가 발생할 될 때마다, 이동 단말기에 내장된 GPS를 통해 이동 단말기의 현재 위치 정보를 수집(260 참조)한다. 뿐 만 아니라, 제어부는 커뮤니케이션 정보에서 위치 정보를 추출한다. 상기와 같이 수집된 위치 정보 및 추출된 위치 정보(이하, 위치 정보)는 상기 커뮤니케이션 정보와 관련된 정보 중 적어도 하나와 매칭되어 저장된다. 여 기서, 상기 위치 정보는 별도의 데이터 베이스에 저장된다. 즉, 상기 위치 정보는 반드시 상기 커뮤니케이 션 정보와 같은 데이터 베이스에 저장될 필요는 없다. 본 명세서에서는 상기 위치 정보가 저장되는 데이터 베이 스를 위치 정보 데이터 베이스라 한다. 제어부는 상기 위치 정보와 커뮤니케이션 정보의 저장 위치(Location ID)를 함께 저장할 수 있다. 이를 통 해, 상기 위치 정보를 통해 상기 위치 정보와 매칭된 커뮤니케이션 정보에 도달할 수 있도록 한다. 한편, 제어부는 커뮤니케이션 이벤트가 발생될 때 수집된 이동 단말기의 위치정보를 우선하여 커뮤니케이 션 정보와 매칭시키고, 상기 커뮤니케이션 정보에서 위치 관련 정보가 추출되는 경우에 한하여, 추출된 위치 정 보를 상기 커뮤니케이션 정보와 매칭시킬 수 있다. 상기 커뮤니케이션 정보에서 위치 관련 정보가 추출되는 경 우, 상기 커뮤니케이션 정보에는 복수의 위치 정보가 매칭될 수 있다. 한편, 제어부는 커뮤니케이션 이벤트가 발생되는 것에 대응하여 이동 단말기의 위치 정보를 수집할 때마다, 수 집된 위치 정보와 기 저장된 위치정보를 비교할 수 있다. 이때, 수집된 위치 정보가 기 설정된 조건을 만족하는 경우, 제어부는 상기 수집된 위치 정보를 대표하는 대표명을 부여한 후, 상기 이름과 수집된 위치정보를 매칭시 켜 저장할 수 있다. 상기 기 설정된 조건에 대하여 구체적으로 설명한다. 제어부는 상기 수집된 위치 정보와 기 저장된 위치정보를 비교하고, 기 저장된 위치 정보 중 상기 수집된 위치 정보와 동일한 위치 정보가 발견되는 경우, 상기 동일한 위치 정보에 매칭된 대표명이 있는지 판단하고, 상기 동일한 위치 정보에 매칭된 대표명이 있는 경우, 상기 대 표명을 상기 수집된 위치 정보에 매칭시켜 저장한다. 상기 동일한 위치 정보에 매칭된 대표명이 없고, 상기 수집된 위치 정보와 동일한 위치 정보가 기 설정된 횟수 이상 검색되는 경우, 상기 제어부는 상기 기 설정된 횟수 이상 검색된 위치 정보가 수집된 시간에 근거하여 대 표명을 형성할 수 있다. 예를 들어, 상기 기 설정된 횟수 이상 검색된 위치 정보가 저녁시간 및 아침시간에 주 로 수집된 위치 정보인 경우, 제어부는 기 설정된 횟수 이상 검색된 위치 정보에 대한 대표명을 \"집\"으로 설정 할 수 있다. 이 경우, 상기 기 설정된 횟수 이상 검색된 위치 정보에는 모두 동일한 대표명이 매칭된다. 한편, 상기 커뮤니케이션 이벤트에 한정되지 않고, 상기 제어부는 상기 이동 단말기에서 새로운 이벤트가 발생 될 때마다, 상기 이벤트와 관련된 정보와 위치 정보를 서로 매칭 시켜 저장할 수 있다. 여기서, 상기 이벤트는 애플리케이션 실행, 사진 촬영, 새로운 데이터 저장 들을 포함할 수 있다. 예를 들어, 제어부는 사용자 요청에 따라 카메라를 활성화하여 영상을 촬영하고, 촬영된 영상을 저장할 수 있다. 이때, 제 어부는 상기 저장된 영상에 위치 정보를 매칭시켜 저장할 수 있다. 다를 예를 들어, 제어부는 사용자로부터 일정 정보를 입력 받아 메모리에 저장할 수 있다. 이때, 제어보는 상기 저장된 일정 정보에 위치 정보를 매칭시켜 저장할 수 있다. 상술한 바와 같이, 본 발명에 따른 이동 단말기는 커뮤니케이션 이벤트가 발생될 때마다, 커뮤니케이션 정보에 위치 정보를 매칭시켜 저장하며, 새로운 이벤트가 발생될 때마다, 상기 이벤트와 관련된 정보에 위치 정보를 매 칭시켜 저장한다. 이후, 사용자로부터 커뮤니케이션 정보 검색 요청이 인가되는 경우, 제어부는 사용자로부터 인가된 검색어를 이 용하여 기 저장된 커뮤니케이션 정보를 검색한다. 이하, 사용자의 검색 요청에 응답하여, 커뮤니케이션 정보 및 이벤트와 관련된 정보를 검색하는 실시 예에 대하 여 구체적으로 설명한다. 도 3은 본 발명의 일 실시 예에 따른 이동 단말기에서 커뮤니케이션 정보 및 이벤트와 관련된 정보를 검색하는 모습을 나타내는 블록도이다. 도 3을 참조하면, 이동 단말기에는 복수의 애플리케이션이 설치될 수 있다. 상기 애플리케이션들을 통해 이벤트 또는 커뮤니케이션 이벤트가 발생될 수 있다. 예를 들어, 본 발명에 따른 이동 단말기는 메신저 애플리케이션을 통해 다른 단말기와 텍스트 메시지를 송수신 할 수 있다. 이 경우, 송수신된 텍스트 메시지가 저장된다. 다른 예를 들어, 본 발명에 따른 이동 단말기는 영상 촬영 애플리케이션을 통해, 카메라를 활성화하고, 카메라 를 통해 수신되는 영상을 저장할 수 있다. 상술한 바와 같이, 이동 단말기에서는 애플리케이션이 실행되고, 애플리케이션의 실행 결과에 따른 정보가 저장 된다. 또한, 상술한 바와 같이, 상기 애플리케이션의 실행 결과에 따른 정보에는 위치 정보가 매칭되어 저장될 수 있다. 한편, 이동 단말기에는 커뮤니케이션 정보 및 이벤트와 관련된 정보를 검색하기 위한 검색어를 입력하기 위한 애플리케이션이 설치될 수 있다. 도 3에서는 사용자의 발화를 통해 검색어를 입력 받기 위한 애플리케이션 만 개시되어 있지만, 사용자는 음성 입력에 한정되지 않고, 텍스트 입력, 이미지 입력 등을 통해 커뮤니케이션 정보 및 이벤트와 관련된 정보를 검색할 수 있다. 검색어를 입력하기 위한 애플리케이션을 통해 검색어가 입력되면, 제어부는 검색어를 별도의 API로 전달하고, 상기 검색어에서 적어도 하나의 키워드들을 추출한다. 이후, 제어부는 데이터 베이스에서 상기 키워드에 대응하는 정보를 검색하여 출력한다. 제어부는 도 3에 도시된 데이터 베이 스 뿐 아니라, 상술한 위치 정보 데이터 베이스를 이용하여 커뮤니케이션 정보 및 이벤트와 관련된 정보를 검색한다. 먼저, 제어부가 도 3에 도시된 데이터 베이스 만으로 키워드에 대응하는 정보를 검색하는 실시 예에 대하 여 설명한다. 도 4는 검색어에 존재하는 시간 정보를 이용하여 기 저장된 데이터를 검색하는 일 실시 예를 나타내는 순서도이 고, 도 5 및 6은 검색어에 존재하는 위치 정보 또는 시간 정보를 이용하여 기 저장된 데이터를 검색하는 일 실 시 예를 나타내는 개념도이다. 도 4를 참조하면, 사용자가 검색어를 입력(S110)하면, 제어부는 상기 검색어에 시간정보를 나타내는 키워 드가 존재하는지 판단(S120)한다. 상기 검색어에 시간 정보를 나타내는 키워드가 존재하는 경우, 제어부는 상기 키워드를 추출한 후, 상기 데이터 베이스에서 상기 키워드에 대응하는 정보를 검색한 후 출력한다. 여기서, 상기 시간 정보를 나타내는 키워드는 절대적인 시점을 나타내는 날짜, 시간 등이거나, 상대적인 시점을 나타내는 용어일 수 있다. 예를 들어, 상기 시간 정보를 나타내는 키워드는 \"어제\", \"지난주\" 등 현재 시점을 기준으로 하는 시간 정보일 수 있다. 제어부는 상기 시간 정보를 나타내는 키워드가 상대적인 시점을 나타내는 용어인 경우, 현재 시간을 기준 으로 하여 상기 시간 정보를 나타내는 키워드를 다른 시간 정보로 변환할 수 있다. 일 실시 예에 있어서, 도 5를 참조하면, 사용자로부터 검색어 \"지난주 마곡동 택배\" 가 입력되면, 제어부 는 상기 검색어에서 시간 정보를 나타내는 키워드 \"지난주\"를 추출한다. 상기 제어부는 상기 추출된 키워 드를 현재 시간을 기준으로 다른 시간 정보로 변환한다. 이후, 제어부는 상기 데이터 베이스에 서 상기 변환된 시간 정보를 포함하는 정보를 검색한다. 한편, 제어부는 상기 검색어에 포함된 다른 키워드(\"택배\")를 포함하는 정보를 상기 검색 결과 내에서 검 색한다. 이후, 제어부는 최종 검색 결과를 출력한다. 도 6을 참조하면, 사용자는 다른 단말기와의 통화기록을 검색하기 위한 검색어를 입력할 수 있다. 일 실시 예에 있어서, 사용자가 검색어로 \"작년 엄마\"를 입력한 경우, 제어부는 상기 검색어에서 시간 정보와 관련된 \" 작년\"을 추출하고, 나머지 키워드 \"엄마\"를 추출한다. 이후, 제어부는 현재 시간을 기준으로 \"작년\"을 다 른 시간 정보로 변환한다. 제어부는 변환된 시간 정보에 해당하는 정보를 상기 데이터 베이스에서 검색한다. 이후, 제어부는 상기 검색 결과 내에서 \"엄마\"를 포함하는 정보를 검색한 후 출력한다. 상술한 바와 같이, 본 발명은 검색어에 포함된 시간 정보와 관련된 키워드와 다른 키워드를 조합하여 데이터 베 이스에서 사용자가 원하는 정보를 검색할 수 있다. 이하에서는, 본 발명에 따른 이동 단말기에서 검색어에 포함된 위치 정보와 관련된 키워드를 이용하여 사용자가 원하는 정보를 검색하는 실시 예에 대하여 설명한다. 도 7은 본 발명에 따른 이동 단말기에서 검색어에 포함된 위치 정보와 관련된 키워드를 추출하는 일 실시 예를 나타내는 개념도이다. 제어부는 사용자로부터 입력된 검색어에서 위치 정보와 연관된 키워드를 추출한다. 여기서, 상기 키워드는 주소, 좌표, 지명, 건물명 등이 될 수 있다. 다만, 상기 키워드는 이에 한정되지 않는다. 일 실시 예에 있어서, 제어부는 상기 검색어와 기 저장된 복수의 대표명들을 비교하여, 상기 검색어에서 키워드를 추출할 수 있 다. 예를 들어, 상기 제어부는 상기 검색어에 \"집\"이라는 단어가 포함된 경우, 상기 \"집\"이라는 단어를 키 워드로 추출한다. 제어부는 상기 검색어에서 위치 정보와 연관된 키워드를 추출한 후, 위치 정보 데이터 베이스에서 상기 추 출된 키워드와 동일한 위치 정보를 검색한다. 여기서, 제어부는 상기 위치 정보 데이터 베이스에서 상기 키워드와 동일한 위치 정보를 검색할 뿐 아니라, 상기 키워드를 1차적으로 변환한 후, 변환된 데이터와 동일한 위치 정보를 검색할 수 있다. 예를 들어, 제어부는 상기 추출된 키워드가 기 저장된 복수의 대표명 중 어느 하나인 경우, 상기 대표명을 상기 대표 명에 대응하는 주소, 좌표, 지명, 건물명 중 어느 하나로 변환한 후, 변환된 데이터가 상기 위치 정보 데이터 베이스에 존재하는지 검색할 수 있다. 한편, 제어부는 상기 검색어에 위치 정보와 연관된 복수의 키워드가 포함되는 경우, 상기 복수의 키워드 중 일부만 데이터 베이스 검색에 활용할 수 있다. 일 실시 예에 있어서, 제어부는 검색어에 포함된 어느 하나의 키워드에 대응하는 위치가 다른 하나의 키워드에 대응하는 위치의 하위 개념에 해당하는 위치인 경우, 상기 다른 하나의 키워드만 데이터 베이스 검색에 활용할 수 있다. 예를 들어, 도 7을 참조하면, 검색어로 \"서울시 강서구 마곡동 고양이\"가 인가된 경우, 제어부는 상 기 검색어에서, 위치 정보와 연관된 키워드 \"서울시\", \"강서구\", \"마곡동\"을 추출할 수 있다. 이 과정에서 검색어 추출을 위한 다양한 알고리즘이 활용될 수 있다. 일 예로, 검색어 추출을 위해 Aho Corasick 알고리즘 이 활용될 수 있다. 여기서, 상기 \"강서구\"는 상기 \"서울시\"의 하위 개념의 주소이고, \"마곡동\"은 상기 \"서울시\" 및 \"강서구\"의 하 위 개념의 주소이므로, 제어부는 \"마곡동\"에 해당하는 위치 정보가 위치 정보 데이터 베이스에 존재하는지 검색한다. 다시 도 5로 돌아와서, 제어부는 검색어에 포함된 시간 정보 관련 키워드, 위치 정보 관련 키워드 및 나머 지 키워드를 추출하고, 추출된 키워드를 모두 조합하여, 사용자가 원하는 정보를 검색할 수 있다. 도 5를 참조하면, 사용자로부터 검색어 \"지난주 마곡동 택배\" 가 입력되면, 제어부는 상기 검색어에 서 시간 정보를 나타내는 키워드 \"지난주\"를 추출한다. 상기 제어부는 상기 추출된 키워드를 현재 시간을 기준 으로 다른 시간 정보로 변환한다. 한편, 제어부는 상기 검색어에서 \"마곡동\"을 추출한 후, 위치 정보 데이터 베이스에서 \"마곡동\"을 포함하는 위 치 정보를 검색한다. 이후, 제어부는 상기 데이터 베이스에서 상기 검색된 위치 정보와 함께 저장된 Location ID를 포함하고, 상기 변환된 시간 정보를 포함하는 데이터를 검색한다. 이후, 제어부는 상기 검색된 위치 정보와 함께 저장된 Location ID를 포함하고, 상기 변환된 시간 정보를 포함하는 데이터 중 \"택배\"를 포함하는 데이터를 검색한다. 마지막으로, 제어부는 최종적으로 검색된 데이터를 출력한다. 이를 통해, 본 발명은 검색어에 포함된 다양한 종류의 키워드를 조합하여 사용자가 원하는 정보를 정확하게 검색할 수 있게 된다. 다시 도 6을 참조하면, 사용자는 다른 단말기와의 통화기록을 검색하기 위한 검색어를 입력할 수 있다. 일 실시 예에 있어서, 사용자가 검색어로 \"제주도 엄마\"를 입력한 경우, 제어부는 상기 검색어에서 위치 정보와 관련된 \"제주도\"를 추출하고, 나머지 키워드 \"엄마\"를 추출한다. 이후, 제어부는 위치 정보 데이터 베이스에 서 \"제주도\"를 포함하는 위치 정보를 검색한다. 이후, 제어부는 상기 데이터 베이스에서 상기 검색된 위치 정보와 함께 저장된 Location Id를 포함하며, \"엄마\"를 포함하는 데이터를 검색한 후 출력한다. 한편, 상술한 검색 방법은 커뮤니케이션 정보에 한정되지 않고, 모든 이벤트와 관련된 정보에 활용될 수 있다. 도 8은 시간 정보 및 위치 정보를 이용하여 기촬영된 영상을 검색하는 일 실시 예를 나타내는 개념도이다. 구체적으로, 상술한 검색 방법은 기 촬영되어 저장된 영상을 검색하는데 활용될 수 있다. 이동 단말기에 포함된 카메라를 통해 영상이 촬영된 후, 데이터 베이스에 저장될 때, 제어부는 촬영된 영상과 촬영 시간, 촬영 장소를 함께 저장한다. 제어부는 상기 촬영된 영상과 함께 저장된 촬영 시간 및 촬영 장소를 검색에 활용할 수 있다. 일 예로, 도 8을 참조하면, 갤러리 애플리케이션에서 사용자로부터 검색어 \"작년 제주도\" 가 입력되면, 제어부 는 상기 검색어에서 시간 정보를 나타내는 키워드 \"작년\"을 추출하고, 위치 정보를 나타내는 키워드 \"제주 도\"를 추출한다. 이후, 상기 제어부는 상기 추출된 키워드 \"작년\"을 현재 시간을 기준으로 다른 시간 정보로 변환한다. 한편, 제 어부는 위치 정보 데이터 베이스에서 \"제주도\"를 포함하는 위치 정보를 검색한다. 이후, 제어부는 상기 데 이터 베이스에서 상기 검색된 위치 정보와 함께 저장된 Location ID를 포함하고, 상기 변환된 시간 정보를 포함하는 데이터를 검색한다. 이후, 제어부는 검색된 데이터를 출력한다. 한편, 제어부는 상기 촬영된 영상과 함께 상기 영상의 종류를 정의하는 카테고리 데이터를 저장한다. 여기 서, 상기 카테고리 데이터는 기설정된 알고리즘을 통해 형성될 수 있다. 상기 카테고리 데이터를 형성하는데 오 랜 시간이 걸리는 경우, 상기 카테고리 데이터는 반드시 영상 촬영 직후에 형성될 필요는 없다. 일 실시 예에 있어서, 상기 카테고리 데이터는 기설정된 시간에 일괄적으로 형성된 후 저장될 수 있다. 상술한 바와 같이, 본 발명은 이동 단말기에서 특정 이벤트가 발생하는 경우, 상기 이벤트와 관련된 정보와 추 가적인 정보를 함께 저장하여 추후 데이터 검색을 용이하게 한다. 한편, 본 발명은 사용자의 검색 요청이 없는 경우에도, 사용자의 단말기 사용패턴에 근거하여 특정 정보를 검색 한 후, 사용자에게 제공한다. 도 9는 사용자의 검색 요청이 없는 경우에도, 사용자의 단말기 사용패턴에 근거하여 특정 정보를 검색한 후, 사 용자에게 제공하는 일 실시 예를 나타내는 개념도이다. 구체적으로, 제어부는 기 설정된 조건을 만족하는 경우, 상기 데이터 베이스에서 정보를 검색하여 출 력한다. 여기서, 상기 기 설정된 조건은 특정 애플리케이션을 실행하는 것일 수 있다. 이 경우, 상기 제어부 가 검색하는 데이터 베이스의 종류는 실행된 애플리케이션의 종류에 따라 달라질 수 있다. 일 실시 예에 있어서, 상기 제어부는 사용자가 통화 애플리케이션을 실행할 때마다, 상기 데이터 베이스 에서 발신횟수가 가장 큰 연락처를 검색할 수 있다. 한편, 제어부는 기 설정된 조건을 만족하여 상기 데이터 베이스를 검색하는 경우, 시간 정보 및 위치 정보 중 적어도 하나를 검색에 활용할 수 있다. 구체적으로, 제어부는 상기 기 설정된 조건을 만족하여 상 기 데이터 베이스를 검색하는 경우, 상기 기 설정된 조건을 만족하는 시점에서의 현재 시간을 검색에 활용 하거나, 상기 기 설정된 조건을 만족하는 경우, GPS로부터 현재 위치 정보를 수집하여 검색에 활용할 수 있다. 예를 들어, 상기 제어부 사용자가 통화 애플리케이션을 실행하는 경우, 현재 시간을 기준으로 소정 시간 범위 내의 시간 정보를 포함하는 통화기록을 검색할 수 있다. 이후, 제어부는 상기 검색 결과 중 검색된 횟수가 많은 순서대로 해당 연락처를 표시할 수 있다. 이를 통해, 본 발명은 특정 시간대에 사용자가 높은 빈도 로 통화하였던 연락처를 제공할 수 있게 된다. 나아가, 제어부는 상기 통화 애플리케이션을 실행하는 시점을 기준으로 특정 시간 이내에 통화 거절을 한 연락처가 있는 경우, 통화 거절을 한 연락처를 추천 연락처로 표시할 수 있다. 다른 예를 들어, 상기 제어부는 사용자가 통화 애플리케이션을 실행하는 경우, GPS를 통해 이동 단말기의 현재 위치 정보를 수신하고, 상기 위치 정보를 이용하여 위치 정보 데이터 베이스에서 상기 위치 정보와 동일한 위치 정보를 검색할 수 있다. 이후, 제어부는 검색된 위치 정보와 함께 저장된 Location ID를 이용하여 상기 검색된 위치 정보에 매칭된 통화기록을 출력할 수 있다. 나아가, 제어부는 상기 검색된 위치 정보에 매 칭된 통화기록들 중 통화 빈도가 높은 순서대로 해당 연락처를 표시할 수 있다. 이를 통해, 본 발명은 이동 단 말기가 특정 장소에 위치할 경우, 특정 장소에서 높은 빈도로 통화한 연락처를 제공할 수 있게 된다. 도 9를 참조하면, 사용자가 통화 애플리케이션을 실행하는 경우, 상기 통화 애플리케이션의 실행화면의 일 영역 에는 추천 연락처가 표시될 수 있다. 사용자가 상기 일 영역에 터치를 인가하는 경우, 상기 제어부 검색한 추천 연락처가 모두 표시될 수 있다. 한편, 도 9의 (c)와 같이, 사용자가 상기 일 영역(61 0)을 터치하는 경우, 상기 추천 연락처와의 통화 기록들이 표시될 수 있다. 한편, 본 발명은 기 저장된 커뮤니케이션 정보를 주기적으로 검색하여 사용자에게 리마인더를 제공한다. 도 10은 기 저장된 문자 메시지를 이용하여 사용자에게 리마인더를 제공하는 일 실시 예를 나타내는 순서도이고, 도 11a 및 11b는 기 저장된 문자 메시지를 이용하여 사용자에게 리마인더를 제공하는 일 실시 예를 나타내는 개념도이다. 도 10을 참조하면, 제어부는 외부 단말기로부터 문자 메시지를 수신(S210)하는 경우, 수신된 문자 메시지 를 기 설정된 데이터 베이스에 저장한다. 이에 따라, 상기 기 설정된 데이터 베이스에는 복수의 문자 메시지들 이 저장된다. 이후, 제어부는 수신된 문자 메시지를 수집(S230)하고, 키워드를 추출한다. 제어부는 추출된 키워드 를 이용하여, 해당 문자 메시지가 리마인더가 필요한 문자 메시지인지를 판단(S240)한다. 본 발명은 상기 데이터 베이스에 저장된 문자 메시지에서 특정 키워드를 추출하고, 상기 특정 키워드를 이 용하여 상기 저장된 문자 메시지의 종류를 판단한다. 예를 들어, 제어부는 상기 문자 메시지에서 특정 키워드를 추출하여, 상기 문자 메시지가 유효 기간이 있 는 쿠폰 또는 예약 문자일 수 있다. 제어부는 문자 메시지에 포함된 쿠폰 또는 예약과 관련된 키워드를 추 출하여 문자 메시지를 분석할 수 있다. 일 실시 예에 있어서, 제어부는 문자 메시지에 포함된 \"예약 완료\", \"예 약 번호\", \"예약일\" 등의 키워드를 추출하여, 상기 문자 메시지가 리마인더를 필요로 하는 메시지 인지 분석한 다. 제어부는 리마인더가 필요한 문자 메시지를 별도의 데이터 베이스에 저장(S250)한다. 제어부는 상기 리마인더가 필요한 문자 메시지를 저장할 때, 리마인더 예정일을 함께 저장한다. 이후, 제어부는 매일 지정된 시각에 리마인더가 필요한 문자 메시지가 있는지 판단(S260)하고, 리마인더가 필요한 문자 메시지가 있는 경우, 리마인더 메시지를 출력(S270)한다. 한편, 제어부는 상기 리마인더 메시지를 출력한 상태에서 날짜가 변경(S310)되는 경우, 상기 리마인더 메 시지의 출력을 중지(S320)하고, 기 저장된 데이터 베이스를 분석하여 새로운 리마인더 메시지를 출력한다. 도 11a를 참조하면, 제어부는 문자 메시지에서 \"예약 완료\" 라는 키워드를 추출하여, 상기 문자 메시지가 예약 문자 메시지임을 판단한다. 이후, 제어부는 상기 문자 메시지에서 시간 정보를 추출하여, 추출된 시 간 정보에 해당되는 시간이 도래하기 전에 리마인더 메시지를 출력한다. 한편, 도 11b를 참조하면, 제어부는 문자 메시지에서 \"쿠폰번호\" 라는 키워드를 추출하여, 상기 문자 메시 지가 쿠폰 문자 메시지임을 판단한다. 이후, 제어부는 상기 문자 메시지에서 시간 정보를 추출하여, 추출 된 시간 정보에 해당되는 시간이 도래하기 전에 리마인더 메시지를 출력한다. 상술한 바와 같이, 본 발명은 기 수신된 문자 메시지를 분석하여 사용자에게 리마인더를 제공할 수 있다. 이하에서는, 사용자가 데이터 베이스 검색을 위한 검색어를 입력하기 위한 방법에 대하여 설명한다. 상기 검색 어는 이동 단말기에 구비된 인공지능 에이전트를 통해 입력될 수 있다. 이하, 인공지능 에이전트에 대하여 구체 적으로 설명한다. 도 12a 및 12b는 두 종류 이상의 인공지능 에이전트가 연동되는 모습을 나타내는 개념도이다. 에이전트(agent)는 특정한 목적을 위해 사용자를 대신해서 작업을 수행하는 자율적 프로세스이다. 여기서, 에이 전트는 독자적으로 존재하는 개념이 아니라, 이동 단말기에 설치된 소프트웨어로 이해될 수 있다. 다만 이에 한 정되지 않고, 상기 에이전트는 이동 단말기, 이동 단말기와 무선 통신 가능한 서버 등으로 이루어지는 시스템일 수 있다. 에이전트는 이동 단말기에 포함된 구성요소들을 통해 사용자 및 외부 환경과 상호작용한다.구체적으로, 에이전트는 이동 단말기에 포함된 구성요소들을 통해 사용자로부터 명령 정보를 수신하고, 명 령 정보에 근거하여 수행할 특정 제어를 결정한다. 이후, 에이전트는 이동 단말기에 포함된 구성요소들을 통해 상기 특정 제어를 수행하는 데 필요한 정보를 수신한다. 본 명세서에서는 에이전트가 수행할 제어를 특정하기 위해 사용자로부터 수신하는 정보를 명령 정보라고 정의한 다. 상기 명령 정보는 다양한 수단으로 입력될 수 있으며, 입력되는 수단에 따라, 서로 다른 형식으로 이루어질 수 있다. 예를 들어, 명령 정보는, 음성 입력 수단, 영상 입력 수단 및 텍스트 입력 수단 중 적어도 하나를 이 용하여 입력될 수 있다. 에이전트는 명령 정보를 입력하는 수단에 따라, 음성인식 기반 에이전트, 텍스트 기반 에이전트 등으로 구분될 수 있다. 일 예로서, 음성인식 기반 에이전트는 이동 단말기에 포함된 마이크를 통해 음성 정보로 이루어진 명 령 정보를 수신하고, 수신된 음성 정보와 관련된 제어를 수행한다. 다른 예를 들어, 텍스트 기반 에이전트는 터치스크린을 통해 사용자로부터 텍스트 형식의 명령 정보를 수 신하고, 수신된 텍스트와 관련된 제어를 수행한다. 한편, 명령 정보는 다양한 종류의 정보를 포함할 수 있다. 예를 들어, 명령 정보는 이동 단말기에서 동작가능한 기능의 종류, 기능 실행 시작/종료 시점, 기능 실행 시작/종료 조건 등을 포함할 수 있다. 한편, 본 명세서에서 설명하는 인공지능 에이전트는 제어부 및 러닝 데이터부에 저장된 데이터를 활 용하여 명령 정보의 의미를 분석한다. 구체적으로, 명령 정보가 자연어로 이루어지는 경우, 인공지능 에이전트 는 제어부의 자연어 처리 기능을 이용하여, 사용자가 의도하는 작업이 무엇인지 분석한다. 즉, 인공지능 에이전트는 자연어로 이루어지는 명령 정보로부터 이동 단말기에서 동작가능한 기능의 종류, 기능 실행 시작/종 료 시점, 기능 실행 시작/종료 조건 등을 추출하고, 그에 따른 제어를 수행한다. 이와 더불어, 인공지능 에이전트는 상술한 머신 러닝 기술에 의하여 학습된 정보들을 이용하여, 상기 명령 정보 로부터 실행 가능한 적어도 하나의 이동 단말기의 동작을 예측(또는 추론)하고, 상기 적어도 하나의 예측된 동 작들 중 가장 실현성이 높은 동작이 실행되도록 이동 단말기를 제어한다. 본 명세서에서는 설명의 편의를 위하여, 인공지능 에이전트가 이동 단말기의 구성요소들을 제어하는 것으로 설 명하지만, 인공지능 에이전트는 실질적으로 제어부 및 러닝 데이터부에 저장된 데이터에 의하여 구현 되기 때문에, 제어부가 러닝 데이터부에 저장된 데이터를 활용하여 이동 단말기의 구성요소들을 제어 하는 것으로도 설명할 수 있다. 즉, 본 명세서에서 인공지능 에이전트에 의한 제어와 러닝 데이터부에 저 장된 데이터를 활용한 제어부의 제어는 실질적으로 동일하다. 한편, 본 발명에 따른 인공지능 에이전트는 다양한 종류의 에이전트에 적용될 수 있다. 예를 들어, 본 발명에 따른 인공지능 에이전트는 음성인식 기반 에이전트 및 텍스트 기반 에이전트에 각각 적용될 수 있다. 한편, 도 1 내지 9에서 설명한 바와 같이, 사용자로부터 검색어를 입력 받거나, 기 설정된 조건을 만족하는 경 우 기 저장된 데이터 베이스에서 조건에 맞는 검색을 수행하고 검색 결과를 출력하는 주체를 검색 에이전트라 할 수 있다. 이동 단말기에는 서로 다른 복수의 인공지능 에이전트가 포함될 수 있다. 복수의 인공지능 에이전트 중 일부는 출고 시 설치된 에이전트일 수 있고, 나머지 일부는 사용자에 의해 설치된 에이전트일 수 있다. 사용자로부터 검색어를 수신하는 것과 검색어를 이용하여 검색을 수행하는 것은 서로 다른 에이전트에 의해 수 행될 수 있다. 이하, 서로 다른 에이전트가 연동하여 사용자가 입력한 검색어에 해당하는 검색 결과를 제공하는 방법에 대하여 설명한다. 먼저, 사용자가 인공지능 에이전트를 통해, 검색어를 입력하는 방법에 대하여 설명한다. 이하에서 설명하는 인 공지능 에이전트는 음성인식 기반 인공지능 에이전트이지만, 본 발명은 음성인식 기반 인공지능 에이전트에만 한정되지는 않는다. 사용자는 특정 키워드를 발화함으로써, 음성인식 기반 에이전트를 실행할 수 있다. 예를 들어, 사용자가 Wake up 신호(또는 기동어)를 발화하는 경우, 인공지능 에이전트가 실행된다. 여기서, 이동 단말기는 사용자로부터 Wake up 신호를 수신하기 위해 마이크를 항상 구동 중인 상태로 유지 할 수 있다. 다만, 이동 단말기는 Wake up 신호를 수신하기 전까지는 수신된 음성 정보에 의하여 아무 제어도 수행하지 않는다. Wake up 신호가 수신되는 경우, 이동 단말기는 음성인식 기반 에이전트를 실행하고, 기 표시 중인 화면정보 대 신 음성인식 기반 에이전트의 실행화면을 표시한다. 기 표시 중인 화면정보는 이동 단말기의 홈 화면일 수 있고, 애플리케이션의 실행화면일 수 있다. 한편, 음성인식 기반 에이전트의 실행화면에는 음성인식의 활성화여 부를 안내하는 그래픽 객체가 표시될 수 있다. 한편, 이동 단말기는 Wake up 신호가 수신되는 경우, 음성인식 기반 에이전트의 실행화면을 표시하고, 음성인식 을 활성화 할 수 있다. 즉, Wake up 신호가 수신되는 경우, 이동 단말기는 음성인식 기반 에이전트를 실행하고, 곧바로 음성인식을 활성화상태로 전환할 수 있다. 이때, 음성인식의 활성화 여부를 안내하는 그래픽 객체 및 음 성인식 이 활성화되었음을 안내하는 문구가 표시될 수 있다. 한편, 이동 단말기는 복수의 음성인식 기반 에이전트를 포함할 수 있다. 마이크를 통해 수신되는 wake up 신호의 종류에 따라 활성화되는 인공지능 에이전트의 종류가 달라질 수 있다. 이후, 사용자에 의해 입력되는 검 색 명령은 활성화된 인공지능 에이전트(이하, 제1인공지능 에이전트)에 의해 수행된다. 음성인식 기반 에이전트는 사용자로부터 검색 명령을 수신하는 경우, 음성 정보 형태의 검색 명령을 텍스트로 변환하고, 변환된 텍스트에서 검색어를 추출한다. 이후, 추출된 검색어는 검색 에이전트(이하, 제2인공지능 에 이전트)로 전달된다. 여기서, 상기 음성인식 기반 에이전트의 종류에 따라, 검색어의 전달 경로가 상이해질 수 있다. 예를 들어, 도 12a를 참조하면, 제1인공지능 에이전트(710a)는 사용자의 검색 명령으로부터 검색어를 추출하여, 곧바로 제2인 공지능 에이전트로 전송한다. 이후, 제2인공지능 에이전트는 상기 도 2 내지 9에서 설명한 방법으로 검색을 수행한 후, 검색 결과를 제1인공지능 에이전트(710a)로 전달한다. 제1인공지능 에이전트(710a)는 수신한 검색결과를 출력한다. 즉, 상기 검색 결과는 상기 제1인공지능 에이전트(710a)의 실행화면에 출력될 수 있다. 한편, 인공지능 에이전트의 종류에 따라 상기 제2인공지능 에이전트와 연동이 불가능한 경우가 있다. 일 예로, 제1인공지능 에이전트는 이동 단말기 출고 시 설치된 에이전트이고, 상기 제2인공지능 에이전트는 사용자에 의 해 설치된 에이전트인 경우, 상기 제1인공지능 에이전트와 상기 제2인공지능 에이전트 간에 연동이 어려울 수 있다. 이러한 경우, 도 12b를 참조하면, 상기 제1인공지능 에이전트(710b)는 사용자의 검색 명령으로부터 추출 된 검색어를 상기 제2인공지능 에이전트와 연동 가능한 특정 애플리케이션으로 전달하고, 상기 특정 애플리케이션은 상기 추출된 검색어를 상기 제2인공지능 에이전트로 전달한다. 이후, 상기 제2인공지 능 에이전트는 검색 결과를 상기 특정 애플리케이션으로 전달하고, 상기 특정 애플리케이션은 상기 검색 결과를 상기 제1인공지능 에이전트(710b)로 전달한다. 도 12b에서 설명한 방식은 서로 다른 단말기 각각에 설치된 인공지능 에이전트들이 연동할 때 활용될 수 있다. 도 13a는 영상표시장치에 설치된 인공지능 에이전트를 통해 검색 명령을 입력 받고, 이동 단말기에서 검색을 수 행하는 일 실시 예를 나타내는 개념도이고, 도 13b는 이동 단말기에 설치된 인공지능 에이전트를 통해 검색 명 령을 입력 받고, 검색 결과를 영상 표시장치에 표시하는 일 실시 예를 나타내는 개념도이다. 도 13a를 참조하면, 사용자는 영상표시장치를 통해 검색 명령을 인가할 수 있다. 영상표시장치에는 상술한 인공 지능 에이전트가 설치되어 있을 수 있으며, 영상표시장치에 설치된 인공지능 에이전트는 사용자로부터 검색 명 령을 입력 받고, 음성 정보 형태의 검색 명령을 텍스트로 변환한 후, 검색어를 추출한다. 추출된 검색어는 이동 단말기의 특정 애플리케이션으로 전송되고, 상기 특정 애플리케이션은 상기 검색어를 이동 단말기에 설치된 검 색 에이전트로 전달한다. 상기 검색 에이전트는 상기 검색어를 이용하여 검색을 수행하고, 검색 결과를 상기 특 정 애플리케이션으로 전달한다. 이후, 상기 특정 애플리케이션은 검색 결과를 영상 표시장치로 전달한다. 이에 따라, 이동 단말기에서의 검색 결과가 영상 표시장치에서 출력될 수 있다. 한편, 도 13b를 참조하면, 사용자는 이동 단말기를 통해 검색 명령을 인가할 수 있다. 이동 단말기에 설치된 인 공지능 에이전트는 사용자로부터 검색 명령을 입력 받고, 음성 정보 형태의 검색 명령을 텍스트로 변환한 후, 검색어를 추출한다. 추출된 검색어는 이동 단말기의 특정 애플리케이션으로 전송되고, 상기 특정 애플리케이션 은 상기 검색어를 이동 단말기에 설치된 검색 에이전트로 전달한다. 상기 검색 에이전트는 상기 검색어를 이용 하여 검색을 수행하고, 검색 결과를 상기 특정 애플리케이션으로 전달한다. 이후, 상기 특정 애플리케이션은 검 색 결과를 영상 표시장치로 전달한다. 이에 따라, 이동 단말기에서의 검색 결과가 영상 표시장치에서 출력될 수있다. 상술한 바와 같이, 본 발명은 서로 다른 에이전트들이 직접적으로 연동할 수 없는 경우, 특정 애플리케이션을 매개체로 하여 서로 다른 에이전트들이 연동될 수 있도록 한다. 전술한 본 발명은, 프로그램이 기록된 매체에 컴퓨터가 읽을 수 있는 코드로서 구현하는 것이 가능하다. 컴퓨터 가 읽을 수 있는 매체는, 컴퓨터 시스템에 의하여 읽혀질 수 있는 데이터가 저장되는 모든 종류의 기록장치를 포함한다. 컴퓨터가 읽을 수 있는 매체의 예로는, HDD(Hard Disk Drive), SSD(Solid State Disk), SDD(Silicon Disk Drive), ROM, RAM, CD-ROM, 자기 테이프, 플로피 디스크, 광 데이터 저장 장치 등이 있으며, 또한 캐리어 웨이브(예를 들어, 인터넷을 통한 전송)의 형태로 구현되는 것도 포함한다. 또한, 상기 컴퓨터는 단말기의 제어 부를 포함할 수도 있다. 따라서, 상기의 상세한 설명은 모든 면에서 제한적으로 해석되어서는 아니되고 예 시적인 것으로 고려되어야 한다. 본 발명의 범위는 첨부된 청구항의 합리적 해석에 의해 결정되어야 하고, 본 발명의 등가적 범위 내에서의 모든 변경은 본 발명의 범위에 포함된다."}
{"patent_id": "10-2019-7023571", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1a는 본 발명과 관련된 이동 단말기를 설명하기 위한 블록도이다. 도 1b 및 1c는 본 발명과 관련된 이동 단말기의 일 예를 서로 다른 방향에서 바라본 개념도이다. 도 2는 커뮤니케이션 정보 및 커뮤니케이션 이벤트와 관련된 정보를 다른 정보와 매칭시켜 저장하는 방법을 나 타내는 개념도이다. 도 3은 본 발명의 일 실시 예에 따른 이동 단말기에서 커뮤니케이션 정보 및 이벤트와 관련된 정보를 검색하는 모습을 나타내는 블록도이다. 도 4는 검색어에 존재하는 시간 정보를 이용하여 기 저장된 데이터를 검색하는 일 실시 예를 나타내는 순서도이 다. 도 5 및 6은 검색어에 존재하는 위치 정보 또는 시간 정보를 이용하여 기 저장된 데이터를 검색하는 일 실시 예 를 나타내는 개념도이다. 도 7은 본 발명에 따른 이동 단말기에서 검색어에 포함된 위치 정보와 관련된 키워드를 추출하는 일 실시 예를 나타내는 개념도이다. 도 8은 시간 정보 및 위치 정보를 이용하여 기 촬영된 영상을 검색하는 일 실시 예를 나타내는 개념도이다. 도 9는 사용자의 검색 요청이 없는 경우에도, 사용자의 단말기 사용패턴에 근거하여 특정 정보를 검색한 후, 사 용자에게 제공하는 일 실시 예를 나타내는 개념도이다. 도 10은 기 저장된 문자 메시지를 이용하여 사용자에게 리마인더를 제공하는 일 실시 예를 나타내는 순서도이다. 도 11a 및 11b는 기 저장된 문자 메시지를 이용하여 사용자에게 리마인더를 제공하는 일 실시 예를 나타내는 개 념도이다. 도 12a 및 12b는 두 종류 이상의 인공지능 에이전트가 연동되는 모습을 나타내는 개념도이다. 도 13은 영상표시장치에 설치된 인공지능 에이전트를 통해 검색 명령을 입력 받고, 이동 단말기에서 검색을 수 행하는 일 실시 예를 나타내는 개념도이다. 도 14는 이동 단말기에 설치된 인공지능 에이전트를 통해 검색 명령을 입력 받고, 검색 결과를 영상 표시장치에 표시하는 일 실시 예를 나타내는 개념도이다."}
