{"patent_id": "10-2014-0083170", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2016-0004619", "출원번호": "10-2014-0083170", "발명의 명칭": "무선통신 시스템에서 패킷 데이터 망에 연결하기 위한 방법 및 장치", "출원인": "삼성전자주식회사", "발명자": "김진엽"}}
{"patent_id": "10-2014-0083170", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "CA 기술을 이용하는 무선통신 시스템에서 다수의 PDN에 연결하기 위한 전자 장치의 방법에 있어서,CA 반송파에 대한 정보 및 상기 CA 반송파에 기반한 제1 다수 PDN의 운영 정책에 대한 정보를 코어 네트워크로전송하는 동작;상기 코어 네트워크로부터, 상기 CA 반송파에 기반한 제2 다수 PDN의 운영 정책에 대한 정보를 수신하는 동작;상기 수신된 CA 반송파에 기반한 제2 다수 PDN의 운영 정책에 따라, 데이터 통신을 위한 무선 베어러를 설정하는 동작을 포함하는 방법."}
{"patent_id": "10-2014-0083170", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 CA 반송파에 기반한 제1 다수 PDN의 운영 정책에 대한 정보는 사용자 구성, 배터리 상태, 소비 전력 중 적어도 하나에 의해 의존하는 것을 포함하는 방법."}
{"patent_id": "10-2014-0083170", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 CA 반송파에 기반한 제2 다수 PDN의 운영 정책에 대한 정보는, 주파수, 대역폭, 사용자의 서비스 품질, 사용자의 가입 요금, 지연(latency), 지터(jitter)중 적어도 하나에 의존하는 것을 포함하는 방법."}
{"patent_id": "10-2014-0083170", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 PDN의 운영 정책은 적어도 하나 이상의 반송파와 적어도 하나 이상의 PDN의 사이의 매핑 정보를 포함하는방법."}
{"patent_id": "10-2014-0083170", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 제2 다수 PDN의 운영 정책은 네트워크 환경에 따라 실시간으로 갱신되는 것을 포함하는 방법."}
{"patent_id": "10-2014-0083170", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 데이터 통신을 위한 무선 베어러의 경로는전자 장치-기지국-서빙 게이트웨이(S-GW)-PDN 게이트웨이(P-GW) 사이에 생성되는 것을 포함하는 방법.공개특허 10-2016-0004619-2-청구항 7 제6항에 있어서,상기 무선통신 시스템은, LTE(long term evolution) 시스템인 것을 포함하는 방법."}
{"patent_id": "10-2014-0083170", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "CA 기술을 이용하는 무선통신 시스템에서 다수의 PDN에 연결하기 위한 코어 네트워크의 방법에 있어서,CA 반송파에 대한 정보 및 상기 CA 반송파에 기반한 제1 다수 PDN의 운영 정책에 대한 정보를 전자 장치로부터수신하는 동작;상기 CA 반송파에 기반한 제1 다수 PDN의 운영 정책을 수용할지를 판단하는 동작;상기 판단 결과에 따라, 상기 CA 반송파에 기반한 제2 다수 PDN의 운영 정책에 대한 정보를 상기 전자 장치로전송하는 동작;상기 CA 반송파에 기반한 제2 다수 PDN의 운영 정책에 따라, 데이터 통신을 위한 무선 베어러를 설정하는 동작을 포함하는 방법."}
{"patent_id": "10-2014-0083170", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 CA 반송파에 기반한 제1 다수 PDN의 운영 정책에 대한 정보는 사용자 구성, 배터리 상태, 소비 전력 중 적어도 하나에 의해 의존하는 것을 포함하는 방법."}
{"patent_id": "10-2014-0083170", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에 있어서,상기 CA 반송파에 기반한 제2 다수 PDN의 운영 정책에 대한 정보는, 주파수, 대역폭, 사용자의 서비스 품질, 사용자의 가입 요금, 지연(latency), 지터(jitter)중 적어도 하나에 의존하는 것을 포함하는 방법."}
{"patent_id": "10-2014-0083170", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제8항에 있어서,상기 PDN의 운영 정책은 적어도 하나 이상의 반송파와 적어도 하나 이상의 PDN의 사이의 매핑 정보를 포함하는방법."}
{"patent_id": "10-2014-0083170", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제8항에 있어서,상기 제2 다수 PDN의 운영 정책을 네트워크 환경에 따라 실시간으로 갱신하는 동작을 더 포함하는 방법."}
{"patent_id": "10-2014-0083170", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제8항에 있어서,상기 데이터 통신을 위한 무선 베어러의 경로는공개특허 10-2016-0004619-3-전자 장치-기지국-서빙 게이트웨이(S-GW)-PDN 게이트웨이(P-GW) 사이에 생성되는 것을 포함하는 방법."}
{"patent_id": "10-2014-0083170", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제8항에 있어서,상기 무선통신 시스템은, LTE(long term evolution) 시스템인 것을 포함하는 방법."}
{"patent_id": "10-2014-0083170", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "CA 기술을 이용하는 무선통신 시스템에서 다수의 PDN에 연결하기 위한 전자 장치에 있어서,CA 반송파에 대한 정보 및 상기 CA 반송파에 기반한 제1 다수 PDN의 운영 정책에 대한 정보를 코어 네트워크로전송하는 송신부;상기 코어 네트워크로부터, 상기 CA 반송파에 기반한 제2 다수 PDN의 운영 정책에 대한 정보를 수신하는수신부;상기 수신된 CA 반송파에 기반한 제2 다수 PDN의 운영 정책에 따라, 데이터 통신을 위한 무선 베어러를 설정하는 프로세서를 포함하는 전자 장치."}
{"patent_id": "10-2014-0083170", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 CA 반송파에 기반한 제1 다수 PDN의 운영 정책에 대한 정보는 사용자 구성, 배터리 상태, 소비 전력 중 적어도 하나에 의해 의존하는 것을 포함하는 전자 장치."}
{"patent_id": "10-2014-0083170", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제15항에 있어서,상기 CA 반송파에 기반한 제2 다수 PDN의 운영 정책에 대한 정보는, 주파수, 대역폭, 사용자의 서비스 품질, 사용자의 가입 요금, 지연(latency), 지터(jitter)중 적어도 하나에 의존하는 것을 포함하는 전자 장치."}
{"patent_id": "10-2014-0083170", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제15항에 있어서,상기 PDN의 운영 정책은 적어도 하나 이상의 반송파와 적어도 하나 이상의 PDN의 사이의 매핑 정보를 포함하는전자 장치."}
{"patent_id": "10-2014-0083170", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제15항에 있어서,상기 데이터 통신을 위한 무선 베어러의 경로는전자 장치-기지국-서빙 게이트웨이(S-GW)-PDN 게이트웨이(P-GW) 사이에 생성되는 것을 포함하는 전자 장치."}
{"patent_id": "10-2014-0083170", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "공개특허 10-2016-0004619-4-제15항에 있어서,상기 무선통신 시스템은, LTE(long term evolution) 시스템인 것을 포함하는 전자 장치."}
{"patent_id": "10-2014-0083170", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 다양한 실시예는 반송파 집성(carrier aggregation, CA) 기술을 이용하는 무선통신 시스템에서 다수의 패킷 데이터 망(packet data network: PDN)에 연결하기 위한 방법 및 장치에 관한 것으로, 다수의 반송파를 하나 의 반송파로 묶는 반송파 집성(carrier aggregation: CA) 기술을 이용하는 무선통신 시스템에서, 상기 무선통신 시스템이, 동적인 CA 반송파에 기반하여, 다수 반송파와 다수의 패킷 데이터 망(packet data network: PDN)을 매핑하여, 가입자의 서비스 품질(QoS)을 보장할 수 있다. 다양한 실시예가 가능하다."}
{"patent_id": "10-2014-0083170", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시예는 무선통신 시스템에서 패킷 데이터 망(packet data network: PDN)에 연결하기 위한 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2014-0083170", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "무선통신 시스템에서 단말(예컨대, 스마트폰 같은 전자 장치)이 송?수신할 패킷 데이터의 목적에 따라서 그에 대응하는 패킷 데이터 망(packet data network, PDN) 연결(connection)을 생성하고 상기 PDN 연결 내에서 베어 러를 생성하여 패킷을 전송할 수 있다. 예들 들어, IMS(IP Multimedia Subsystem, internet protocol multimedia subsystem) 서비스를 활용하기 위해 IMS 관련 서버들이 존재하는 패킷 데이터 네트워크로 연결을 생 성해야 한다. 또한, 인터넷 서비스를 이용하기 인터넷 망을 구성하는 패킷 데이터 네트워크로 연결을 생성해야 한다. 상기 IMS 서비스, 상기 인터넷 서비스 이외에도, VoLTE(Voice of LTE, voice of long term evolution) 서비스 등을 위해서 다양한 패킷 데이터 네트워크들이 존재할 수 있으며, 상기 단말은 다양한 패킷 데이터 네트워크들 과 연결되어, 다양한 서비스를 이용할 수 있다. 최근 3GPP(3rd generation partnership project) 표준화 단체는 LTE(long term evolution)에 대한 후속 기술에 대한 표준화 작업을 진행하고 있다. 본 명세서에서는 상기 기술을 \"LTE Advanced\" 또는 \"LTE-A\"라고 지칭한다. LTE 시스템과 LTE-A 시스템의 주요 차이점 중 하나는 시스템 대역폭의 차이다. LTE-A 시스템은 최대 100 MHz 이 상의 광대역을 지원할 것을 목표로 하고 있으며, 이를 위해 복수의 주파수 대역을 하나의 광대역으로 이루는 반 송파 집성 혹은 주파수 집성(carrier aggregation 또는 bandwidth aggregation) 기술을 사용하도록 하고 있다. 즉, 상기 반송파 집성 기술은 보다 넓은 주파수 대역을 사용하기 위해 복수의 주파수 대역을 하나의 논리 주파 수 대역으로 사용하도록 하는 기술이다. 각 주파수 대역폭은 LTE 시스템에서 사용되는 시스템 대역폭에 기반하 여 정의될 수 있다."}
{"patent_id": "10-2014-0083170", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "반송파 집성(carrier aggregation: CA) 기술을 이용하는 무선통신 시스템에서 단말을 다수의 패킷 데이터 망 (packet data network: PDN)과 연결을 생성할 시 서비스 품질(quality of service: QoS)을 보장하기 위한 방법 및 장치가 필요하다. 본 발명의 다양한 실시예는 CA 기술을 이용하는 무선통신 시스템에서 다수의 패킷 데이터 망에 연결하기 위한 방법 및 장치를 제공할 수 있다. 본 발명의 다양한 실시예는 CA 기술을 이용하는 무선통신 시스템에서 단말을 다수의 PDN과 연결을 생성할 시 QoS을 보장하기 위한 방법 및 장치를 제공할 수 있다."}
{"patent_id": "10-2014-0083170", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 다양한 실시 예에 따르면, CA 기술을 이용하는 무선통신 시스템에서 다수의 PDN에 연결하기 위한 전 자 장치의 방법에 있어서, CA 반송파에 대한 정보 및 상기 CA 반송파에 기반한 제1 다수 PDN의 운영 정책에 대 한 정보를 코어 네트워크로 전송하는 동작; 상기 코어 네트워크로부터, 상기 CA 반송파에 기반한 제2 다수 PDN 의 운영 정책에 대한 정보를 수신하는 동작; 상기 수신된 CA 반송파에 기반한 제2 다수 PDN의 운영 정책에따라, 데이터 통신을 위한 무선 베어러를 설정하는 동작을 포함할 수 있다. 본 발명의 다양한 실시 예에 따르면, CA 기술을 이용하는 무선통신 시스템에서 다수의 PDN에 연결하기 위한 코 어 네트워크의 방법에 있어서, CA 반송파에 대한 정보 및 상기 CA 반송파에 기반한 제1 다수 PDN의 운영 정책에 대한 정보를 전자 장치로부터 수신하는 동작; 상기 CA 반송파에 기반한 제1 다수 PDN의 운영 정책을 수용할지를 판단하는 동작; 상기 판단 결과에 따라, 상기 CA 반송파에 기반한 제2 다수 PDN의 운영 정책에 대한 정보를 상 기 전자 장치로 전송하는 동작; 상기 CA 반송파에 기반한 제2 다수 PDN의 운영 정책에 따라, 데이터 통신을 위 한 무선 베어러를 설정하는 동작을 포함할 수 있다. 본 발명의 다양한 실시 예에 따르면, CA 기술을 이용하는 무선통신 시스템에서 다수의 PDN에 연결하기 위한 전 자 장치에 있어서, CA 반송파에 대한 정보 및 상기 CA 반송파에 기반한 제1 다수 PDN의 운영 정책에 대한 정보 를 코어 네트워크로 전송하는 송신부; 상기 코어 네트워크로부터, 상기 CA 반송파에 기반한 제2 다수 PDN의 운 영 정책에 대한 정보를 수신하는 수신부; 상기 수신된 CA 반송파에 기반한 제2 다수 PDN의 운영 정책에 따라, 데이터 통신을 위한 무선 베어러를 설정하는 프로세서를 포함할 수 있다."}
{"patent_id": "10-2014-0083170", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 다양한 실시 예에 따르면, CA 지원에 따른 다양한 주파수 대역을 고려하여 다수의 PDN를 동적으로 연 결함으로써, UE(user equipment) ↔ eNB(evolved node B) 사이 무선 구간에 대한 QoS를 운영 정책(operation policy) 에 따라 물리적으로 보장할 수 있다. 또한, 각 사업자의 대역폭 이용에 맞춰 DRB(data radio bearer)를 설정하여 반송파별 PDN를 별도로 제공할 수 있다. 그리고, 사용자 가입 요금에 따라 대역폭이 큰 CA를 사용자별로 할당하여 사용자 QoS를 물리적으로 관리할 수 있다."}
{"patent_id": "10-2014-0083170", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 다양한 실시예가 첨부된 도면과 연관되어 기재된다. 본 발명의 다양한 실시예는 다양한 변경을 가할 수 있고 여러 가지 실시예를 가질 수 있는 바, 특정 실시예들이 도면에 예시되고 관련된 상세한 설명이 기 재되어 있다. 그러나, 이는 본 발명의 다양한 실시예를 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 다양한 실시예의 사상 및 기술 범위에 포함되는 모든 변경 및/또는 균등물 내지 대체물을 포함하는 것으 로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유사한 참조 부호가 사용되었다. 본 발명의 다양한 실시예에서 사용될 수 있는“포함한다” 또는 “포함할 수 있다” 등의 표현은 개시 (disclosure)된 해당 기능, 동작 또는 구성요소 등의 존재를 가리키며, 추가적인 하나 이상의 기능, 동작 또는 구성요소 등을 제한하지 않는다. 또한, 본 발명의 다양한 실시예에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것 이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존 재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 발명의 다양한 실시예에서 “또는” 등의 표현은 함께 나열된 단어들의 어떠한, 그리고 모든 조합을 포함한 다. 예를 들어, “A 또는 B”는, A를 포함할 수도, B를 포함할 수도, 또는 A 와 B 모두를 포함할 수도 있다. 본 발명의 다양한 실시예에서 사용된 “제 1,”“제2,”“첫째,”또는“둘째,”등의 표현들은 다양한 실시예들 의 다양한 구성요소들을 수식할 수 있지만, 해당 구성요소들을 한정하지 않는다. 예를 들어, 상기 표현들은 해 당 구성요소들의 순서 및/또는 중요도 등을 한정하지 않는다. 상기 표현들은 한 구성요소를 다른 구성요소와 구 분하기 위해 사용될 수 있다. 예를 들어, 제1 사용자 기기와 제 2 사용자 기기는 모두 사용자 기기이며, 서로 다른 사용자 기기를 나타낸다. 예를 들어, 본 발명의 다양한 실시예의 권리 범위를 벗어나지 않으면서 제1 구성 요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 상기 어떤 구성요소 가 상기 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 상기 어떤 구성요소와 상기 다른 구성요소 사이에 새로운 다른 구성요소가 존재할 수도 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 상기 어떤 구성 요소와 상기 다른 구성요소 사이에 새로운 다른 구성요소가 존재하지 않는 것으로 이해될 수 있어야 할 것이다. 본 발명의 다양한 실시예에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명의 다 양한 실시예를 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현 을 포함한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명의 다양한 실시예가 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥 상 가지는 의미 와 일치하는 의미를 가지는 것으로 해석되어야 하며, 본 발명의 다양한 실시예에서 명백하게 정의되지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 이하, 본 발명의 다양한 실시예는 반송파 집성(carrier aggregation, CA) 기술을 이용하는 무선통신 시스템에서 다수의 패킷 데이터 망(packet data network, PDN)에 연결하기 위한 방법 및 장치에 관해 설명하기로 한다. 이하, 본 발명의 다양한 실시예는 CA 기술을 이용하는 LTE(long term evolution) 이동 통신 시스템을 예를 들어 설명하기로 한다. 도 1은 본 발명의 다양한 실시예에 따른 LTE 이동 통신 시스템의 구조를 도시하는 도면이다. 상기 도 1을 참조하면, 도시한 바와 같이 LTE 이동 통신 시스템의 무선 액세스 네트워크는 차세대 기지국 (evolved node B), 이하 eNB 또는 Node B라 한다)과 MME(mobility management entity, 103) 및 S- GW(serving - gateway, 104), P-GW(PDN GW, packet data network gateway, 105) 및 HSS(home subscriber server)로 구성된다. 사용자 단말(user equipment, UE)은 eNB 및 S-GW, 그리고 P- GW를 통해 외부 네트워크(예: IMS(IP multimedia subsystem, internet protocol multimedia subsystem), MMS(multi-media message service), internet, VoLTE(voice over LTE))에접속할 수 있다. eNB는 RAN(radio access network) 노드로서, 상기 UE와 LTE 네트워크 간에 무선 연결을 제공할 수 있다. 또한, 무선 베어러 제어, 무선 수락 제어, 동적 무선 자원 할당, 부하 균등(load balancing) 및 셀 간 간 섭제어(inter-cell interference coordination, ICIC)와 같은 무선 자원 관리(radio resource management, RRM) 기능을 제공할 수 있다. MME는 각종 제어 기능을 담당하는 장치로 하나의 MME는 다수의 eNB들과 연결될 수 있다. 또한, MME는 E-UTRAN 제어 평면 엔티티로, 사용자 인증과 사용자 프로파일 다운로드를 위하여 HSS와 통신하고, NAS(non access stratum) 시그널링을 통해 UE에게 EPS 이동성 관리(EPS mobility management, evolved packet system mobility management, EMM) 및 EPS 세션 관리(EPS session management, ESM) 기능을 제공할 수 있다. HSS는 사용자 프로파일을 저장하는 데이터베이스로 상기 MME에게 사용자 인증 정보와 사용자 프로파 일을 제공할 수 있다. S-GW는 데이터 베어러를 제공하는 장치이며, MME의 제어에 따라서 데이터 베어러를 생성하거나 제거 할 수 있다. 또한, E-UTRAN과 EPC(evolved packet core)의 종단점으로, eNB 간 핸드오버 및 3GPP 시스템 간 핸드오버시 MAP(mobility anchor point)가 될 수 있다. P-GW는 UE를 외부 PDN 망(예: 110, 109, 108, 107)과 연결해주며 패킷 필터링을 제공할 수 있다. 또 한, UE에게 IP 주소를 할당하고 3GPP 시스템과 non-3GPP 시스템간 핸드오버시 MAP(mobility anchor point)로 동작할 수 있다. PCRF(policy charging and rules function)(미도시함)가 상기 P-GW에서 구현되 어 수행될 수 있다. 다양한 실시예에서, 상기 PCRF는 사용자의 서비스 품질(quality of service, QoS)과 관련된 정책(policy)을 제 어하는 장치이며, 정책에 해당하는 PCC(policy and charging control) 규칙(rule)은 P-GW에 전달되어 적 용될 수 있다. 또한, 상기 PCRF는 트래픽에 대한 QoS 및 과금을 총괄적으로 제어하는 엔티티일 수 있다. 본 발 명의 다양한 실시예에 따라, 상기 PCRF는 CA에 따른 다양한 주파수 대역과 다수의 PDN를 연결하기 위한 정책 (policy)을 저장할 수 있다. 한편, UP(User Plane)라 함은 사용자의 데이터가 송?수신되는 UE와 eNB, eNB(에서 S-GW, 그리고 S-GW에서 P-GW를 잇는 경로를 일컫는다. 그런데 이 경로 중 자원의 제한이 심한 무선 채널을 사용하는 부분은 UE와 eNB( 사이의 경로일 수 있다. AS(access stratum)은 무선 구간을 통한 데이터 전송을 위한 연결일 수 있다. LTE와 같은 무선 통신 시스템에서 QoS를 적용할 수 있는 단위는 EPS 베어러일 수 있다. 하나의 EPS 베어러는 동 일한 QoS 요구사항을 갖는 IP 플로우(IP Flow)들을 전송하는데 사용될 수 있다. EPS 베어러에는 QoS와 관련된 파라미터가 지정될 수 있으며 여기엔 서비스 품질 클래스 식별자(QoS class identifier, QCI)와 할당 및 보유 우선순위(allocation and retention priority, ARP)가 포함될 수 있다. 상기 QCI는 QoS 우선 순위를 정수 값으 로 정의한 파라미터이며, ARP는 새로운 EPS 베어러 생성을 허락 또는 거절할 것인가 여부를 판단하는 파라미터 일 수 있다. 하나의 EPS 베어러는 PDN 연결(PDN connection)에 속하게 되며, PDN 연결은 APN(access point name)을 속성으 로 가질 수 있다. 만약 VoLTE 혹은 IMS 서비스를 위한 PDN 연결이 생성된 경우, 해당 PDN 연결은 잘 알려진 APN을 사용해 생성될 수 있다. 도 2는 본 발명의 다양한 실시예에 따른 사용자 평면(user plane)에 대한 무선 프로토콜 구조(radio protocol architecture)를 나타낸 블록도이다. 상기 사용자 평면은 사용자 데이터 전송을 위한 프로토콜 스택(protocol stack)이다. 상기 도 2를 참조하면, UE의 프로토콜 스택은 application 계층, TCP/UDP 계층, IP 계층, PDCP(packet data convergence protocol) 계층, RLC(radio link control) 계층, MAC 계층, 물리(PHY) 계층으로 구성되고, eNB 및 S-GW의 프로토콜 스택은 GTP-U(GPRS tunneling protocol user plane) 계층, UDP 계층, IP 계층, L2 계층, L1 계층으로 구성되고, P-GW의 프로토콜 스택은 IP계층, GTP-U 계층, UDP 계층, IP 계층, L2 계층, L1 계층으로 구성될 수 있다. 3GPP 명세서에서, 상기 UE와 상기 eNB 간 무선 인터페이스로 LTE-Uu가 정의되어 있고, 상기 eNB와 S-GW 간 인터 페이스로 S1-U가 정의되어 있고, 상기 S1-U는 베어러 당 GTP 터널링을 제공할 수 있다. 그리고 상기 S-GW와 상 기 P-GW 간 인터페이스로 S5가 정의되어 있다. 상기 GTP 터널링은 S1-U, S5 인터페이스 상에서 사용자 IP 패킷 을 전송하기 위해 사용될 수 있다. 상기 물리계층(PHY(physical) layer)은 물리채널(physical channel)을 이용하여 상위 계층에게 정보 전송 서비 스(information transfer service)를 제공할 수 있다. 물리계층은 상위 계층인 MAC(medium access control) 계 층과는 전송채널(transport channel)을 통해 연결되어 있다. 전송채널을 통해 MAC 계층과 물리계층 사이로 데이 터가 이동할 수 있다. 전송채널은 무선 인터페이스를 통해 데이터가 어떻게 어떤 특징으로 전송되는가에 따라 분류될 수 있다. 서로 다른 물리계층 사이, 즉 송신기와 수신기의 물리계층 사이는 물리채널을 통해 데이터가 이동할 수 있다. 예컨대, 상기 물리채널은 OFDM(orthogonal frequency division multiplexing) 방식으로 변조될 수 있으며, 시 간과 주파수를 무선자원으로 활용할 수 있다. MAC 계층의 기능은 논리채널과 전송채널 간의 맵핑 및 논리채널에 속하는 MAC SDU(service data unit)의 전송채 널 상으로 물리채널로 제공되는 전송블록(transport block)으로의 다중화/역다중화를 포함할 수 있다. MAC 계층 은 논리채널을 통해 RLC 계층에게 서비스를 제공할 수 있다. 또한, MAC 계층은 무선자원을 UE들에게 동적으로 할당하고 각 무선 베어러 별로 협상된 QoS를 보장받을 수 있도록 QoS 제어 기능을 수행할 수 있다. RLC 계층의 기능은 RLC SDU의 연결(concatenation), PDCP 계층에서 수신한 패킷을 무선링크를 통해 전송하기 위 한 분할(segmentation) 및 무선링크를 통해 수신한 패킷을 PDCP 계층으로 전송하기 위한 재결합(reassembly)을 포함할 수 있다. 무선베어러(radio bearer; RB)가 요구하는 다양한 QoS(quality of service)를 보장하기 위해, RLC 계층은 투명모드(transparent mode, TM), 비확인 모드(unacknowledged mode, UM) 및 확인모드 (acknowledged mode, AM)의 세 가지의 동작모드를 제공할 수 있다. AM RLC는 ARQ(automatic repeat request)를 통해 오류 정정을 제공할 수 있다. 사용자 평면에서의 PDCP 계층의 기능은 사용자 데이터의 전달, 헤더 압축(header compression) 및 암호화 (ciphering)를 포함할 수 있다. 제어 평면에서의 PDCP(packet data convergence protocol) 계층의 기능은 제어 평면 데이터의 전달 및 암호화/무결성 보호(integrity protection)를 포함할 수 있다. IP 계층의 기능은 패킷이 라우터의 입력 링크에 도달시 라우터는 패킷을 적절한 출력 링크로 이동시키는 포워딩 (forwarding) 및 송수신자가 패킷을 전송할 때 패킷 경로를 결정하는 라우팅(routing)을 포함할 수 있다. TCP/UDP 계층의 기능은 IP 계층에 의해 전달되는 패킷의 오류를 검사하고 재전송을 요구하는 등의 제어를 담당 하는 계층으로 TCP, UDP 두 종류의 프로토콜이 사용될 수 있다. Application 계층의 기능은 서비스와 응용 프로그램 안에서 구현되는 프로토콜을 사용하며, 응용 프로그램이 사 용자에게 메시지를 생성하는 방법을 제공하는 동안 네트워크로 인터페이스를 연결을 제공하고 처리된 데이터를 제어하기 위한 규칙 및 포맷을 제공할 수 있다. 도 3은 본 발명의 다양한 실시예에 따르면, CA 기술을 이용하는 LTE 시스템에서 초기 접속(initial attach)을 위한 흐름도이다. 상기 도 3을 참조하면, 다양한 실시예에 따르면, LTE 초기 접속 과정은 단말의 IMSI(international mobile subscriber identity)을 획득하는 동작, 인증 동작, NAS 보안 설정(security setup) 동작, 위 치 갱신 동작(location update), 또는 EPS 세션 설정(EPS session establishment) 동작를 포함할 수 있다. 상기 NAS 보안 설정 단계에서 상호 인증이 완료되면 UE와 MME간에 송?수신되는 메시지에 대해 무선구간에 서의 보호를 위해 암호화 및 무결성 확인(encryption & integrity protected)을 위한 준비를 하고, 이 단계가 완료되면 이후 NAS 메시지(UE와 MME간 메시지)를 무선 구간에서 보호할 수 있다. 상기 위치 갱신 단계에서 UE가 어떤 MME에 접속되어 있는지를 HSS에 등록하고, 또한 UE의 서비스 프로파일 (service profile)(또는 QoS profile)을 HSS가 MME로 전달할 수 있다, EPS 세션 설정 단계는 UE에 IP 주소를 할당해 주고, 상기 UE가 사용할 EPS Bearer(UE와 eNB간에 DRB 터널, eNB와 S-GW간에 S1 GTP 터널, 또는 S-GW와 P-GW간에 S5 GTP 터널)를 생성할 수 있다. EPS Bearer 생성시 PCRF가 결정한 QoS 프로파일에 근거하여 EPS 베어러의 QoS 파라미터가 설정될 수 있다. 상세한 LTE 초기 접속 과정을 살펴보면, UE는 Attach Request 메시지를 통해 MME에게 자신의 IMSI를 전달할 수 있다. 한번 LTE 시스템에 접속했던 UE의 경우 LTE망으로부터 GUTI(globally unique temporary identifier)를 할당 받고, 이후 재접속시에 IMSI가 아닌 GUTI를 MME로 보낼 수도 있다. 또한, eNB는 MME에 해 당 UE가 접속한 Cell ID(또는 E-UTRAN cell global identifier, ECGI) 또는 TAI(tracking area identifier) 정보를 MME로 전달할 수 있다. 다양한 실시예에 따르면, 인증 동작에서, MME는 UE 인증을 위해 HSS로 인증을 위한 정보(authentication vector, AV)를 요청할 수 있다. HSS는 해당 UE를 위한 AV를 생성하여 MME로 전달할 수 있다. 그리고, HSS로부터 수신된 AV 정보의 일부는 UE로 전달될 수 있다. 이후, UE와 MME 간 각자 생성한 인증 값을 비교함으로써 인증이 완료될 수 있다. 인증 단계 후에는 무선 구간에서 NAS 메시지(UE와 MME간 메시지)를 안전하게 전달하기 위한 보안 설정 (security setup) 동작가 수행될 수 있다. NAS 보안 설정 절차 이후에, MME는 어떤 IMSI 값을 가진 UE가 자신에 접속했는지를 HSS에 알리고, HSS는 그 결과를 저장함으로써, 위치 갱신을 수행할 수 있다. 더하여, HSS는 MME에 가입자에 대한 서비스 프로파 일(또는 QoS 프로파일)을 전달할 수 있다. 상기 가입자 서비스 프로파일은 가입자 등록 시 가입자 요금 및 부가 서비스 신청 등에 의해 HSS로 프러비저닝(provisioning)될 수 있다. EPS 세션 설정 동작에서, UE의 ESM 정보를 검색하기 위해서 ESM information request를 UE에 전송할 수 있다. 상기 ESM 정보는 APN, protocol configuration option, EPS bearer identity을 의미할 수 있다. UE는 ESM 정보(예: APN, EPS bearer identity, 또는 protocol configuration option)를 포함하는 ESM information response를 MME로 전송할 수 있다. 또한, 본 발명의 다양한 실시예에 따라, protocol configuration option 내에 운영정책에 의한 대역 정보(예: CA 기술에 따른 대역 사용 정보, 대역 x, y, z 혹 은 대역 x+y+z 혹은 대역 x+y, z)가 더 포함될 수 있다. HSS로부터 받은 서비스 프로파일을 이용하여 EPS 세션(또는 EPS 베어러) 생성을 시작하기 위해 S-GW로 가입자의 QoS 프로파일, IMSI 또는 EPS bearer ID을 포함한 create session request 메시지를 전송하고, S-GW는 동일 메 시지를 P-GW로 전달할 수 있다. P-GW는 DHCP 서버와 연동을 통해 UE가 사용할 IP 주소를 할당할 수 있다. 그리고, P-GW는 PCRF에게 가입자의 QoS 프로파일을 전달하여 UE가 최종적으로 가입자가 사용하게 될 QoS 프로파 일을 요청할 수 있다. PCRF는 SPR(subscription profile repository)에 가입자에 대한 액세스 프로파일 (access profile)을 요청하고 SPR은 그 값을 PCRF에게 전달할 수 있다. PCRF는 P-GW로부터 수신한 QoS 프로파일과 SPR로부터 수신한 액세스 프로파일을 이용하여 정책 결정(policy decision)을 수행하고, UE가 사용할 최종 QoS 프로파일 및 CA에 따른 대역에 대응하는 PDN 연결 정보를 P-GW로 전달한다. 이때 과금에 대한 정보도 함께 전달할 수 있다. 즉, PCRF는 UE별로 운영정책(예: QoS 정보)과 과금 방식을 결정해 주는 엔티티일 수 있다. 다양한 실시예에 따르면, P-GW는 PCRF로부터 수신받은 QoS 정보를 기반으로 EPS 베어러(또는 GTP 터널)를 생성 하고, 이후 UE가 인터넷을 사용하면 과금 방식에 따라 과금을 수행할 수 있다. P-GW는 S-GW로 create session response를 전송하면 PCRF가 전송한 최종 QoS 프로파일 및 CA에 따른 대역에 대응하는 PDN 연결 정보를 전달할 수 있다. S-GW 역시 P-GW로부터 수신한 QoS 정보를 기반으로 EPS 베어러(또는 GTP 터널)를 생성하고 create Session response 메시지를 MME로 전달할 수 있다. MME는 attach accept에 UE가 사용할 IP 주소와 UE가 취할 QoS 정보를 포함하여 UE에게 전달할 수 있다. UE와 eNB간 무선 구간의 제어 신호 및 사용자 데이터를 보호하기 위한 AS security setup 절차를 수행하고, 또 한 UE와 eNB간 DRB 터널 생성할 수 있다. 그리고, MME는 RRC connection reconfiguration 메시지를 통해 CA에 따른 대역에 대응하는 PDN 연결 정보, UE IP, EPS bearer ID, 협상된 QoS 파라미터, 우선순위(radio priority), TFT(traffic flow templates)를 UE로 전달할 수 있다. LTE 초기 접속 과정이 완료되면, EPS 베어러 생성이 완료되고 UE는 eNB - S-GW - P-GW를 통해 PDN를 사용할 수 있다. 도 4는 본 발명의 다양한 실시예에 따른 CA 개념을 도시하고 있다. 상기 도 4을 참조하면, 다양한 실시예에 따르면, CA 기술은 협대역(narrowband) 반송파 F1, F2, F3를 하나의 가 상 광대역(broadband) 반송파로 결합하는 기술이다. 여기서, F1에 대응하는 대역폭, F2에 대응하는 대역폭, 그 리고 F3에 대응하는 대역폭은 연속적으로 있을 수 있고 혹은 비연속적으로 있을 수도 있다. 또한, F1에 대응하 는 대역폭, F2에 대응하는 대역폭, 그리고 F3에 대응하는 대역폭은 동일한 크기를 가지거나 각각 서로 다른 대 역폭의 크기를 가질 수 있다. 도 5(a) 내지 도 5(c)는 본 발명의 다양한 실시예에 따른 CA의 종류를 도시하고 있다. 상기 도 5(a)는 동일한 대역 내에서 연속적인 반송파들을 연결하는 intra-band contiguous carrier aggregation이다. 상기 도 5(b)는 동일한 대역 내에서 비연속적인 반송파들을 연결하는 intra-band non-contiguous carrier aggregation이다. 상기 도 5(c)는 동일하지 않은 대역 내의 반송파들을 연결하는 Inter-band non-contiguous carrier aggregation이다. 도 6(a) 내지 도 6(d)는 본 발명의 다양한 실시예에 따른 CA 기술에 따른 단말 종류를 도시하고 있다. 도 6(a)는 CA 기술을 지원하지 않는 단말 A가 하향링크 대역에서 하나의 반송파를 점유하고 상향링크 대역에서 하나의 반송파를 점유하는 경우이다. 도 6(b)는 CA 기술을 지원하지 않는 단말 B가 하향링크 대역에서 하나의 반송파(예컨대, 다른 단말 A가 점유하 지 않고 있는 반송파)를 점유하고 상향링크 대역에서 하나의 반송파(예컨대, 다른 단말 A가 점유하지 않고 있는 반송파)를 점유하는 경우이다. 도 6(c)는 CA 기술을 지원하는 단말 C가 하향링크 대역에서 두 개의 반송파를 연결하여 점유하고 상향링크 대역 에서 두 개의 반송파를 점유하는 경우이다. 도 6(c)의 경우 대칭적(symmetric) CA라 정의할 수 있다. 도 6(d)는 CA 기술을 지원하는 단말 D가 하향링크 대역에서 세 개의 반송파를 연결하여 점유하고 상향링크 대역 에서 하나의 반송파를 점유하는 경우이다. 도 6(d)의 경우 비대칭적(asymmetric) CA라 정의할 수 있다. 도 7(a) 내지 도 7(c)은 본 발명의 다양한 실시예에 따른 UE와 P-GW 간 터널링으로 연결된 LTE 시스템에서 동적 인 CA와 다수의 PDN을 연결하는 시나리오를 도시하고 있다. 다양한 실시예에 따르면, eNB와 P-GW 사이는 GTP 터 널링을 통해 연결이 되고, UE와 eNB 사이는 DRB(data radio bearer)로 연결이 될 수 있다. UE와 P-GW 사이는 EPS 베어러라 칭한다. UE가 PDN에 연결될 때 생성되는 PDN 연결은 EPS 세션으로 이라고 한다. 상기 EPS 세션은 하나 이상의 EPS 베어러를 가지며 PCRF로부터 서비스 품질(QoS) 정책을 적용받아 EPS 베어러에 이를 적용할 수 있다. 그리고, UE와 MME 간 NAS를 통해 시그널링 신호를 전달할 수 있다. 상기 도 7(a)을 참조하면, UE와 P-GW 사이는 제1 EPS 베어러를 형성하는 대역 x를 이용하여, 인터넷과 관련된 PDN를 연결하고, UE와 P-GW 사이는 제2 EPS 베어러를 형성하는 대역 y를 이용하여, IMS와 관련된 PDN를 연결하 고, UE와 P-GW 사이는 제3 EPS 베어러를 형성하는 대역 z를 이용하여, VoLTE와 관련된 PDN를 연결할 수 있다. 상기 도 7(b)을 참조하면, UE와 P-GW 사이는 제1 및 제2 EPS 베어러를 형성하는 대역 x+y를 이용하여, 인터넷과 관련된 PDN 및 IMS와 관련된 PDN를 연결하고, UE와 P-GW 사이는 제3 EPS 베어러를 형성하는 대역 z를 이용하여, VoLTE와 관련된 PDN를 연결할 수 있다. 상기 도 7(c)을 참조하면, UE와 P-GW 사이는 제1, 제2 및 제3 EPS 베어러를 형성하는 대역 x+y+z를 이용하여, 인터넷과 관련된 PDN, IMS와 관련된 PDN 그리고 VoLTE와 관련된 PDN를 연결할 수 있다.도 8(a) 내지 도 8(c)은 본 발명의 다양한 실시예에 따른 모뎀 레벨과 애플리케이션 레벨 간 동적인 CA에 따라 다수의 PDN을 연결하는 시나리오를 도시하고 있다. 예컨대, 애플리케이션 레벨의 VoLTE, 브라우저, IMS, MMS 서 비스는 제1 내지 제3 PDN를 통해 제공되고 3개의 반송파(제1 내지 제3 carrier)가 동적인 CA에 따라 다양하게 결합할 수 있다. 상기 도 8(a)을 참조하면, 제2 반송파에 대응하는 대역 x를 이용하여, 브라우저 및 IMS 서비스와 관련된 제2 PDN를 연결하고, 제3 반송파에 대응하는 대역 y를 이용하여, MMS 서비스와 관련된 제3 PDN를 연결하고, 제1 반 송파에 대응하는 대역 z를 이용하여, VoLTE와 관련된 제1 PDN를 연결할 수 있다. 상기 도 8(b)을 참조하면, 제2 및 제3 반송파가 CA에 의해 결합된 대역 x+y를 이용하여, 브라우저, IMS 그리고 MMS 서비스와 관련된 제2 및 제3 PDN를 연결하고, 제1 반송파에 대응하는 대역 z를 이용하여, VoLTE와 관련된 제1 PDN를 연결할 수 있다. 상기 도 8(c)을 참조하면, 제1, 제2 및 제3 반송파가 CA에 의해 결합된 대역 x+y+z를 이용하여, 브라우저, IMS, MMS 그리고 VoLTE 서비스와 관련된 제1, 제2 및 제3 PDN를 연결할 수 있다. 네트워크 운용 정책에 따라, 상기 도 8(a)과 같이, 각각의 대역을 이용하여 3개의 PDN으로 운용하거나, 상기 도 8(b)과 같이, 대역 2개를 하나의 PDN으로 묶어 전체 2개의 PDN으로 운용하거나, 상기 도 8(c)과 같이, 대역 3개 를 하나의 PDN으로 묶어 하나의 PDN으로 운용할 수 있다. 예컨대, 사업자 대역폭(BW) 또는 단말 상황(예: 사용자 구성, 배터리 상태, 소비 전력)을 고려하여, DRB(data radio bearer)를 생성하여 반송파별 IP(PDN) 주소를 별도로 할당할 수 있다. 즉, 사용자 가입 요금, 또는 단말 전류소모 상태(배터리 용량, 사용자 설정 등), 사용자가 사용하려는 애플리케 이션 종류(혹은 트래픽 종류)에 따라, 반송파를 결합시킬 수 있다. 상기 반송파별 IP(PDN) 주소를 별도로 할당하거나, 트래픽 종류에 따라 반송파를 결합하여 PDN를 운용함으로써, 사용자별 QoS을 물리적으로 다양하게 보장할 수 있다. 예컨대, 동일한 서비스를 이용하는 사용자라 하더라도, 사용자 요금에 따라, CA을 결합하여 서비스 품질을 차등화할 수 있고, 또한 애플리케이션 종류에 따라, CA을 결 합하여 서비스 품질을 보장할 수도 있다. 본 발명의 다양한 실시예에 따른 전자 장치는, 통신 기능이 포함된 장치일 수 있다. 예를 들면, 전자 장치는 스 마트 폰(smartphone), 태블릿 PC(tablet personal computer), 이동 전화기(mobile phone), 화상전화기, 전자북 리더기(e-book reader), 데스크탑 PC(desktop personal computer), 랩탑 PC(laptop personal computer), 넷북 컴퓨터(netbook computer), PDA(personal digital assistant), PMP(portable multimedia player), MP3 플레이 어, 모바일 의료기기, 카메라(camera), 또는 웨어러블 장치(wearable device)(예: 전자 안경과 같은 head- mounted-device(HMD), 전자 의복, 전자 팔찌, 전자 목걸이, 전자 앱세서리(appcessory), 전자 문신, 또는 스마 트 와치(smart watch))중 적어도 하나를 포함할 수 있다. 어떤 실시예들에 따르면, 전자 장치는 통신 기능을 갖춘 스마트 가전 제품(smart home appliance)일 수 있다. 스마트 가전 제품은, 예를 들자면, 전자 장치는 텔레비전, DVD(digital video disk) 플레이어, 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스(set-top box), TV 박스(예를 들면, 삼성 HomeSync™, 애플TV™, 또는 구글 TV™), 게임 콘솔(game consoles), 전자 사전, 전자 키, 캠코더(camcorder), 또는 전자 액자 중 적어도 하나를 포함할 수 있다. 어떤 실시예들에 따르면, 전자 장치는 각종 의료기기(예: MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 초음파기 등), 네비게이션(navigation) 장치, GPS 수 신기(global positioning system receiver), EDR(event data recorder), FDR(flight data recorder), 자동차 인포테인먼트(infotainment) 장치, 선박용 전자 장비(예: 선박용 항법 장치 및 자이로 콤파스 등), 항공 전자기 기(avionics), 보안 기기, 차량용 헤드 유닛, 산업용 또는 가정용 로봇, 금융 기관의 ATM(automatic teller’s machine) 또는 상점의 POS(point of sales) 중 적어도 하나를 포함할 수 있다. 어떤 실시예들에 따르면, 전자 장치는 통신 기능을 포함한 가구(furniture) 또는 건물/구조물의 일부, 전자 보 드(electronic board), 전자 사인 입력장치(electronic signature receiving device), 프로젝터(projector),또는 각종 계측기기(예: 수도, 전기, 가스, 또는 전파 계측 기기 등) 중 적어도 하나를 포함할 수 있다. 본 발 명의 다양한 실시예에 따른 전자 장치는 전술한 다양한 장치들 중 하나 또는 그 이상의 조합일 수 있다. 또한, 본 발명의 다양한 실시예에 따른 전자 장치는 플렉서블 장치일 수 있다. 또한, 본 발명의 다양한 실시예에 따른 전자 장치는 전술한 기기들에 한정되지 않음은 당업자에게 자명하다. 이하, 첨부된 도면을 참조하여 다양한 실시예에 따른 전자 장치에 대해서 살펴본다. 다양한 실시예에서 이용되 는 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공지능 전자 장치)를 지칭할 수 있다. 도 9는 다양한 실시예에 따른, 전자 장치 901을 포함하는 네트워크 환경 900를 도시한다. 도 9를 참조하면, 상 기 전자 장치 901는 버스 910, 프로세서 920, 메모리 930, 입출력 인터페이스 940, 디스플레이 950, 통신 인터 페이스 960 및 PDN 연결 모듈 970을 포함할 수 있다. 상기 버스 910는 전술한 구성요소들을 서로 연결하고, 전술한 구성요소들 간의 통신(예: 제어 메시지)을 전달하 는 회로일 수 있다. 상기 프로세서 920는, 예를 들면, 상기 버스 910를 통해 전술한 다른 구성요소들(예: 상기 메모리 930, 상기 입 출력 인터페이스 940, 상기 디스플레이 950, 상기 통신 인터페이스 960, 또는 상기 PDN 연결 모듈 970 등)로부 터 명령을 수신하여, 수신된 명령을 해독하고, 해독된 명령에 따른 연산이나 데이터 처리를 실행할 수 있다. 상기 메모리 930는, 상기 프로세서 920 또는 다른 구성요소들(예: 상기 입출력 인터페이스 940, 상기 디스플레 이 950, 상기 통신 인터페이스 960, 또는 상기 PDN 연결 모듈 970 등)로부터 수신되거나 상기 프로세서 920 또 는 다른 구성요소들에 의해 생성된 명령 또는 데이터를 저장할 수 있다. 상기 메모리 930는, 예를 들면, 커널 931, 미들웨어 932, 어플리케이션 프로그래밍 인터페이스(API: application programming interface) 933 또는 어플리케이션 934 등의 프로그래밍 모듈들을 포함할 수 있다. 전술한 각각의 프로그래밍 모듈들은 소프트웨어, 펌웨어, 하드웨어 또는 이들 중 적어도 둘 이상의 조합으로 구성될 수 있다. 상기 커널 931은 나머지 다른 프로그래밍 모듈들, 예를 들면, 상기 미들웨어 932, 상기 API 933 또는 상기 어플 리케이션 934에 구현된 동작 또는 기능을 실행하는 데 사용되는 시스템 리소스들(예: 상기 버스 910, 상기 프로 세서 920 또는 상기 메모리 930 등)을 제어 또는 관리할 수 있다. 또한, 상기 커널 931은 상기 미들웨어 932, 상기 API 933 또는 상기 어플리케이션 934에서 상기 전자 장치 901의 개별 구성요소에 접근하여 제어 또는 관리 할 수 있는 인터페이스를 제공할 수 있다. 상기 미들웨어 932는 상기 API 933 또는 상기 어플리케이션 934이 상기 커널 931과 통신하여 데이터를 주고받을 수 있도록 중개 역할을 수행할 수 있다. 또한, 상기 미들웨어 932는 상기 어플리케이션 934로부터 수신된 작업 요청들과 관련하여, 예를 들면, 상기 어플리케이션 934 중 적어도 하나의 어플리케이션에 상기 전자 장치 901의 시스템 리소스(예: 상기 버스 910, 상기 프로세서 920 또는 상기 메모리 930 등)를 사용할 수 있는 우선 순위를 배정하는 등의 방법을 이용하여 작업 요청에 대한 제어(예: 스케쥴링 또는 로드 밸런싱)을 수행할 수 있다. 상기 API 933는 상기 어플리케이션 934이 상기 커널 931 또는 상기 미들웨어 932에서 제공되는 기능을 제어하기 위한 인터페이스로, 예를 들면, 파일 제어, 창 제어, 화상 처리 또는 문자 제어 등을 위한 적어도 하나의 인터 페이스 또는 함수(예: 명령어)를 포함할 수 있다. 다양한 실시예에 따르면, 상기 어플리케이션 934는 SMS/MMS 어플리케이션, 이메일 어플리케이션, 달력 어플리케 이션, 알람 어플리케이션, 건강 관리(health care) 어플리케이션(예: 운동량 또는 혈당 등을 측정하는 어플리케 이션) 또는 환경 정보 어플리케이션(예: 기압, 습도 또는 온도 정보 등을 제공하는 어플리케이션) 등을 포함할 수 있다. 추가적으로 또는 대체적으로, 상기 어플리케이션 934은 상기 전자 장치 901와 외부 전자 장치(예: 전 자 장치 904) 사이의 정보 교환과 관련된 어플리케이션일 수 있다. 다양한 실시예에 따르면, 상기 어플리케이션 934은 상기 외부 전자 장치(예: 전자 장치 904)의 속성(예: 전자 장치의 종류)에 따라 지정된 어플리케이션을 포함할 수 있다. 예를 들어, 외부 전자 장치가 MP3 플레이어인 경 우, 상기 어플리케이션 934은 음악 재생과 관련된 어플리케이션을 포함할 수 있다. 유사하게, 외부 전자 장치가 모바일 의료기기인 경우, 상기 어플리케이션 934은 건강 관리와 관련된 어플리케이션을 포함할 수 있다. 한 실 시예에 따르면, 상기 어플리케이션 934은 전자 장치 901에 지정된 어플리케이션 또는 외부 전자 장치(예: 서버 906 또는 전자 장치 904)로부터 수신된 어플리케이션 중 적어도 하나를 포함할 수 있다. 상기 입출력 인터페이스 940은, 입출력 장치(예: 센서, 키보드 또는 터치 스크린)를 통하여 사용자로부터 입력 된 명령 또는 데이터를, 예를 들면, 상기 버스 910를 통해 상기 프로세서 920, 상기 메모리 930, 상기 통신 인 터페이스 960, 또는 상기 PDN 연결 모듈 970에 전달할 수 있다. 예를 들면, 상기 입출력 인터페이스 940은 터치 스크린을 통하여 입력된 사용자의 터치에 대한 데이터를 상기 프로세서 920로 제공할 수 있다. 또한, 상기 입출 력 인터페이스 940은, 예를 들면, 상기 버스 910을 통해 상기 프로세서 920, 상기 메모리 930, 상기 통신 인터 페이스 960, 또는 상기 PDN 연결 모듈 970로부터 수신된 명령 또는 데이터를 상기 입출력 장치(예: 스피커 또는 디스플레이)를 통하여 출력할 수 있다. 예를 들면, 상기 입출력 인터페이스 940은 상기 프로세서 920를 통하여 처리된 음성 데이터를 스피커를 통하여 사용자에게 출력할 수 있다. 상기 디스플레이 950은 사용자에게 각종 정보(예: 멀티미디어 데이터 또는 텍스트 데이터 등)을 표시할 수 있다. 상기 통신 인터페이스 960은 상기 전자 장치 901와 외부 장치(예: 전자 장치 904 또는 서버 906) 간의 통신을 연결할 수 있다. 예를 들면, 상기 통신 인터페이스 960은 무선 통신 또는 유선 통신을 통해서 네트워크 962에 연결되어 상기 외부 장치와 통신할 수 있다. 상기 무선 통신은, 예를 들어, Wifi(wireless fidelity), BT(Bluetooth), NFC(near field communication), GPS(global positioning system) 또는 cellular 통신(예: LTE, LTE-A, CDMA, WCDMA, UMTS, WiBro 또는 GSM 등) 중 적어도 하나를 포함할 수 있다. 상기 유선 통신은, 예 를 들어, USB(universal serial bus), HDMI(high definition multimedia interface), RS-232(recommended standard 232) 또는 POTS(plain old telephone service) 중 적어도 하나를 포함할 수 있다. 한 실시예에 따르면, 상기 네트워크 962는 통신 네트워크(telecommunications network)일 수 있다. 상기 통신 네트워크 는 컴퓨터 네트워크(computer network), 인터넷(internet), 사물 인터넷(internet of things) 또는 전화망(telephone network) 중 적어도 하나를 포함할 수 있다. 한 실시예에 따르면, 상기 전자 장치 901와 외부 장치 간의 통신을 위한 프로토콜(예: transport layer protocol, data link layer protocol 또는 physical layer protocol))은 어플리케이션 934, 어플리케이션 프로그래밍 인터페이스 933, 상기 미들웨어 932, 커널 931 또는 통신 인터페이스 960 중 적어도 하나에서 지원될 수 있다. 상기 PDN 연결 모듈 970은, 다른 구성요소들(예: 상기 프로세서 920, 상기 메모리 930, 상기 입출력 인터페이스 940, 또는 상기 통신 인터페이스 960 등)로부터 획득된 정보 중 적어도 일부를 처리하고, 이를 다양한 방법으로 사용자에게 제공할 수 있다. 예를 들면, 상기 PDN 연결 모듈 970은 상기 프로세서 920를 이용하여 또는 이와는 독립적으로, 상기 전자 장치 901이 다른 전자 기기(예: 전자 장치 904 또는 서버 906)와 연동하도록 상기 전자 장치 901의 적어도 일부 기능을 제어할 수 있다. 후술하는 도 2 내지 도 11을 통하여 상기 PDN 연결 모듈 970에 대한 추가적인 정보가 제공된다. 도 10은 다양한 실시예들에 따른, 전자 장치(예: 전자 장치 901)의 PDN 연결 모듈 970의 블록도 1000를 도시한 다. 도 10를 참조하면, 다양한 실시예에 따르면, 상기 PDN 연결 모듈 970은 정보 수집 모듈 1010, 송신 모듈 1020, 수신 모듈 1030 및 PDN 연결 제어 모듈 1040을 포함할 수 있다. 정보 수집 모듈 1010은 동적인 CA 반송파에 기반하여 다수의 PDN의 운용정책을 결정하기 위한, 사용자 구성 (user configurations), 배터리 상태, 또는 소비 전력(power consumption) 같은 사용자 상태 정보를 수집할 수 있다. 송신 모듈 1020은, 상기 사용자 상태 정보 또는 상기 동적인 CA 반송파에 대한 정보를 코어 네트워크로 전송할 수 있다. 상기 동적인 CA 반송파에 대한 정보는 다수의 대역폭을 어떻게 결합하여 사용할지에 대한 정보를 의미 할 수 있다. 예컨대, 대역 x, y, z이 CA에 따라 하나의 대역(예: x+y+z)으로 운용할지, 또는 두 개의 대역(예: x+y, z)으로 운영할지, 또 다른 두 개의 대역(x, y+z)으로 운영할지, 세 개의 대역(x, y, z)으로 운용할지에 대 한 정보를 의미할 수 있다. 수신 모듈 1030은, 코어 네트워크로부터 동적인 CA 반송파에 기반한 다수의 PDN의 운용정책에 대한 정보를 수신 할 수 있다. 예컨대, 다수의 PDN의 운용정책에 대한 정보는 VoLTE, VOD 서비스에 대응하는 PDN 1은 대역 z로 매 핑되고 브라우저, IMS 서비스에 대응하는 PDN 2는 대역 y로 매핑되고, MMS 서비스에 대응하는 PDN 3은 대역 z로 매핑되어 있는 정보일 수 있다. PDN 연결 제어 모듈 1040은 상기 동적인 CA 반송파에 기반한 다수의 PDN의 운용정책에 대한 정보를 이용하여, 데이터 베어러를 생성할 수 있다. 상술한 바와 같이, 전자 장치는 상기 사용자 상태 정보 또는 상기 동적인 CA 반송파에 대한 정보를 코어 네트워 크로 전송하면, 상기 코어 네트워크는 상기 사용자 상태 정보 그리고 사용자의 QoS 프로파일 정보(예: QoS,latency, jitter, 가입 요금 등)를 이용하여, CA 반송파에 기반한 다수의 PDN의 운용정책에 대한 정보를 결정할 수 있다. 다양한 실시예에 따라서, 전자 장치가 필요한 정보(예: 사용자의 QoS 프로파일 정보(예: QoS, latency, jitter, 또는 가입 요금 등))를 상기 코어 네트워크로부터 수신하여, 상기 동적인 CA 반송파에 기반한 다수의 PDN의 운 용정책에 대한 정보를 결정할 수도 있다. CA 기술을 이용하는 무선통신 시스템에서 다수의 PDN에 연결하기 위한 코어 네트워크의 방법은, CA 반송파에 대 한 정보 및 상기 CA 반송파에 기반한 제1 다수 PDN의 운영 정책에 대한 정보를 전자 장치로부터 수신하는 동작, 상기 CA 반송파에 기반한 제1 다수 PDN의 운영 정책을 수용할지를 판단하는 동작, 상기 판단 결과에 따라, 상기 CA 반송파에 기반한 제2 다수 PDN의 운영 정책에 대한 정보를 상기 전자 장치로 전송하는 동작, 상기 CA 반송파 에 기반한 제2 다수 PDN의 운영 정책에 따라, 데이터 통신을 위한 무선 베어러를 설정하는 동작을 포함할 수 있 다. 상기 CA 반송파에 기반한 제1 다수 PDN의 운영 정책에 대한 정보는 사용자 구성, 배터리 상태, 소비 전력 중 적어도 하나에 의해 의존될 수 있다. 상기 CA 반송파에 기반한 제2 다수 PDN의 운영 정책에 대한 정보는, 주 파수, 대역폭, 사용자의 서비스 품질, 사용자의 가입 요금, 지연(latency), 지터(jitter)중 적어도 하나에 의존 하는 것을 포함하는 방법. 상기 PDN의 운영 정책은 적어도 하나 이상의 반송파와 적어도 하나 이상의 PDN의 사 이의 매핑 정보를 포함할 수 있다. 상기 코어 네트워크의 동작 방법은 상기 제2 다수 PDN의 운영 정책을 네트워 크 환경에 따라 실시간으로 갱신하는 동작을 더 포함할 수 있다. 상기 데이터 통신을 위한 무선 베어러의 경로 는, 전자 장치-기지국-서빙 게이트웨이(S-GW)-PDN 게이트웨이(P-GW) 사이에 생성될 수 있다. 도 11은 다양한 실시예들에 따른 전자 장치 1101의 블록도 1100를 도시한다. 상기 전자 장치 1101은, 예를 들면, 도 9에 도시된 전자 장치 901의 전체 또는 일부를 구성할 수 있다. 도 11을 참조하면, 상기 전자 장치 1101은 하나 이상의 어플리케이션 프로세서(AP: application processor) 1110, 통신 모듈 1120, SIM(subscriber identification module) 카드 1124, 메모리 1130, 센서 모듈 1140, 입력 장치 1150, 디스플레 이 1160, 인터페이스 1170, 오디오 모듈 1180, 카메라 모듈 1191, 전력관리 모듈 1195, 배터리 1196, 인디케이 터 1197 및 모터 1198를 포함할 수 있다. 상기 AP 1110는 운영체제 또는 응용 프로그램을 구동하여 상기 AP 1110에 연결된 다수의 하드웨어 또는 소프트 웨어 구성요소들을 제어할 수 있고, 멀티미디어 데이터를 포함한 각종 데이터 처리 및 연산을 수행할 수 있다. 상기 AP 1110는, 예를 들면, SoC(system on chip) 로 구현될 수 있다. 한 실시예에 따르면, 상기 AP 1110는 GPU(graphic processing unit, 미도시)를 더 포함할 수 있다. 상기 통신 모듈 1120(예: 상기 통신 인터페이스 960)은 상기 전자 장치 1101(예: 상기 전자 장치 901)와 네트워 크를 통해 연결된 다른 전자 장치들(예: 전자 장치 904 또는 서버 906) 간의 통신에서 데이터 송수신을 수행할 수 있다. 한 실시예에 따르면, 상기 통신 모듈 1120은 셀룰러 모듈 1121, Wifi 모듈 1123, BT 모듈 1125, GPS 모듈 1127, NFC 모듈 1128 및 RF(radio frequency) 모듈 1129를 포함할 수 있다. 상기 셀룰러 모듈 1121은 통신망(예: LTE, LTE-A, CDMA, WCDMA, UMTS, WiBro 또는 GSM 등)을 통해서 음성 통화, 영상 통화, 문자 서비스 또는 인터넷 서비스 등을 제공할 수 있다. 또한, 상기 셀룰러 모듈 1121은, 예를 들면, 가입자 식별 모듈(예: SIM 카드 1124)을 이용하여 통신 네트워크 내에서 전자 장치의 구별 및 인증을 수 행할 수 있다. 한 실시예에 따르면, 상기 셀룰러 모듈 1121은 상기 AP 1110가 제공할 수 있는 기능 중 적어도 일부 기능을 수행할 수 있다. 예를 들면, 상기 셀룰러 모듈 1121은 멀티 미디어 제어 기능의 적어도 일부를 수 행할 수 있다. 한 실시예에 따르면, 상기 셀룰러 모듈 1121은 커뮤니케이션 프로세서(CP: communication processor)를 포함할 수 있다. 또한, 상기 셀룰러 모듈 1121은, 예를 들면, SoC로 구현될 수 있다. 도 11에서는 상기 셀룰러 모듈 1121(예: 커뮤니케이션 프로세서), 상기 메모리 1130 또는 상기 전력관리 모듈 1195 등의 구성요소들이 상기 AP 1110와 별개의 구성요소로 도시되어 있으나, 한 실시예에 따르면, 상기 AP 1110가 전술한 구성요소들의 적어도 일부(예: 셀룰러 모듈 1121)를 포함하도록 구현될 수 있다. 한 실시예에 따르면, 상기 AP 1110 또는 상기 셀룰러 모듈 1121(예: 커뮤니케이션 프로세서)은 각각에 연결된 비휘발성 메모리 또는 다른 구성요소 중 적어도 하나로부터 수신한 명령 또는 데이터를 휘발성 메모리에 로드 (load)하여 처리할 수 있다. 또한, 상기 AP 1110 또는 상기 셀룰러 모듈 1121은 다른 구성요소 중 적어도 하나 로부터 수신하거나 다른 구성요소 중 적어도 하나에 의해 생성된 데이터를 비휘발성 메모리에 저장(store)할 수있다. 상기 Wifi 모듈 1123, 상기 BT 모듈 1125, 상기 GPS 모듈 1127 또는 상기 NFC 모듈 1128 각각은, 예를 들면, 해당하는 모듈을 통해서 송수신되는 데이터를 처리하기 위한 프로세서를 포함할 수 있다. 도 11에서는 셀룰러 모듈 1121, Wifi 모듈 1123, BT 모듈 1125, GPS 모듈 1127 또는 NFC 모듈 1128이 각각 별개의 블록으로 도시되 었으나, 한 실시예에 따르면, 셀룰러 모듈 1121, Wifi 모듈 1123, BT 모듈 1125, GPS 모듈 1127 또는 NFC 모듈 1128 중 적어도 일부(예: 두 개 이상)는 하나의 integrated chip(IC) 또는 IC 패키지 내에 포함될 수 있다. 예 를 들면, 셀룰러 모듈 1121, Wifi 모듈 1123, BT 모듈 1125, GPS 모듈 1127 또는 NFC 모듈 1128 각각에 대응하 는 프로세서들 중 적어도 일부(예: 셀룰러 모듈 1121에 대응하는 커뮤니케이션 프로세서 및 Wifi 모듈 1123에 대응하는 Wifi 프로세서)는 하나의 SoC로 구현될 수 있다. 상기 RF 모듈 1129는 데이터의 송수신, 예를 들면, RF 신호의 송수신을 할 수 있다. 상기 RF 모듈 1129는, 도시 되지는 않았으나, 예를 들면, 트랜시버(transceiver), PAM(power amp module), 주파수 필터(frequency filter) 또는 LNA(low noise amplifier) 등을 포함할 수 있다. 또한, 상기 RF 모듈 1129는 무선 통신에서 자유 공간상 의 전자파를 송수신하기 위한 부품, 예를 들면, 도체 또는 도선 등을 더 포함할 수 있다. 도 13에서는 셀룰러 모듈 1121, Wifi 모듈 1123, BT 모듈 1125, GPS 모듈 1127 및 NFC 모듈 1128이 하나의 RF 모듈 1129을 서로 공 유하는 것으로 도시되어 있으나, 한 실시예에 따르면, 셀룰러 모듈 1121, Wifi 모듈 1123, BT 모듈 1125, GPS 모듈 1127 또는 NFC 모듈 1128 중 적어도 하나는 별개의 RF 모듈을 통하여 RF 신호의 송수신을 수행할 수 있다. 상기 SIM 카드 1124는 가입자 식별 모듈을 포함하는 카드일 수 있으며, 전자 장치의 특정 위치에 형성된 슬롯에 삽입될 수 있다. 상기 SIM 카드 1124는 고유한 식별 정보(예: ICCID(integrated circuit card identifier)) 또 는 가입자 정보(예: IMSI(international mobile subscriber identity))를 포함할 수 있다. 상기 메모리 1130(예: 상기 메모리 930)는 내장 메모리 1132 또는 외장 메모리 1134를 포함할 수 있다. 상기 내 장 메모리 1132는, 예를 들면, 휘발성 메모리(예를 들면, DRAM(dynamic RAM), SRAM(static RAM), SDRAM(synchronous dynamic RAM) 등) 또는 비휘발성 메모리(non-volatile Memory, 예를 들면, OTPROM(one time programmable ROM), PROM(programmable ROM), EPROM(erasable and programmable ROM), EEPROM(electrically erasable and programmable ROM), mask ROM, flash ROM, NAND flash memory, NOR flash memory 등) 중 적어도 하나를 포함할 수 있다. 한 실시예에 따르면, 상기 내장 메모리 1132는 Solid State Drive (SSD)일 수 있다. 상기 외장 메모리 1334는 flash drive, 예를 들면, CF(compact flash), SD(secure digital), Micro-SD(micro secure digital), Mini- SD(mini secure digital), xD(extreme digital) 또는 Memory Stick 등을 더 포함할 수 있다. 상기 외장 메모리 1134는 다양한 인터페이스를 통하여 상기 전자 장치 1101과 기능적으로 연결될 수 있다. 한 실시예에 따르면, 상기 전자 장치 1101는 하드 드라이브와 같은 저장 장치(또는 저장 매체)를 더 포함할 수 있다. 상기 센서 모듈 1140은 물리량을 계측하거나 전자 장치 1101의 작동 상태를 감지하여, 계측 또는 감지된 정보를 전기 신호로 변환할 수 있다. 상기 센서 모듈 1140은, 예를 들면, 제스처 센서 1140A, 자이로 센서 1140B, 기압 센서 1140C, 마그네틱 센서 1140D, 가속도 센서 1140E, 그립 센서 1140F, 근접 센서 1140G, color 센서 1140H (예: RGB(red, green, blue) 센서), 생체 센서 1140I, 온/습도 센서 1140J, 조도 센서 1140K 또는 UV(ultra violet) 센서 1140M 중의 적어도 하나를 포함할 수 있다. 추가적으로 또는 대체적으로, 상기 센서 모듈 1140은, 예를 들면, 후각 센서(E-nose sensor, 미도시), EMG 센서(electromyography sensor, 미도시), EEG 센서 (electroencephalogram sensor, 미도시), ECG 센서(electrocardiogram sensor, 미도시), IR(infra red) 센서 (미도시), 홍채 센서(미도시) 또는 지문 센서(미도시) 등을 포함할 수 있다. 상기 센서 모듈 1140은 그 안에 속 한 적어도 하나 이상의 센서들을 제어하기 위한 제어 회로를 더 포함할 수 있다. 상기 입력 장치 1150은 터치 패널(touch panel) 1152, (디지털) 펜 센서(pen sensor) 1154, 키(key) 1156 또는 초음파(ultrasonic) 입력 장치 1158를 포함할 수 있다. 상기 터치 패널 1152은, 예를 들면, 정전식, 감압식, 적 외선 방식 또는 초음파 방식 중 적어도 하나의 방식으로 터치 입력을 인식할 수 있다. 또한, 상기 터치 패널 1152은 제어 회로를 더 포함할 수도 있다. 정전식의 경우, 물리적 접촉 또는 근접 인식이 가능하다. 상기 터치 패널 1152은 택타일 레이어(tactile layer)를 더 포함할 수도 있다. 이 경우, 상기 터치 패널 1152은 사용자에 게 촉각 반응을 제공할 수 있다. 상기 (디지털) 펜 센서 1154는, 예를 들면, 사용자의 터치 입력을 받는 것과 동일 또는 유사한 방법 또는 별도 의 인식용 쉬트(sheet)를 이용하여 구현될 수 있다. 상기 키 1156 는, 예를 들면, 물리적인 버튼, 광학식 키 또는 키패드를 포함할 수 있다. 상기 초음파(ultrasonic) 입력 장치 1158는 초음파 신호를 발생하는 입력 도구를 통해, 전자 장치 1101에서 마이크(예: 마이크 1188)로 음파를 감지하여 데이터를 확인할 수 있는 장치로서, 무 선 인식이 가능하다. 한 실시예에 따르면, 상기 전자 장치 1101는 상기 통신 모듈 1120를 이용하여 이와 연결된 외부 장치(예: 컴퓨터 또는 서버)로부터 사용자 입력을 수신할 수도 있다. 상기 디스플레이 1160(예: 상기 디스플레이 950)은 패널 1162, 홀로그램 장치 1164 또는 프로젝터 1166을 포함 할 수 있다. 상기 패널 1162은, 예를 들면, LCD(liquid-crystal display) 또는 AM-OLED(active-matrix organic light-emitting diode) 등일 수 있다. 상기 패널 1162은, 예를 들면, 유연하게(flexible), 투명하게 (transparent) 또는 착용할 수 있게(wearable) 구현될 수 있다. 상기 패널 1162은 상기 터치 패널 1152과 하나 의 모듈로 구성될 수도 있다. 상기 홀로그램 장치 1164은 빛의 간섭을 이용하여 입체 영상을 허공에 보여줄 수 있다. 상기 프로젝터 1166는 스크린에 빛을 투사하여 영상을 표시할 수 있다. 상기 스크린은, 예를 들면, 상기 전자 장치 1101의 내부 또는 외부에 위치할 수 있다. 한 실시예에 따르면, 상기 디스플레이 1160은 상기 패널 1162, 상기 홀로그램 장치 1164, 또는 프로젝터 1166를 제어하기 위한 제어 회로를 더 포함할 수 있다. 상기 인터페이스 1170는, 예를 들면, HDMI(high-definition multimedia interface) 1172, USB(universal serial bus) 1174, 광 인터페이스(optical interface) 1176 또는 D-sub(D-subminiature) 1178를 포함할 수 있 다. 상기 인터페이스 1170는, 예를 들면, 도 9에 도시된 통신 인터페이스 960에 포함될 수 있다. 추가적으로 또 는 대체적으로, 상기 인터페이스 1170는, 예를 들면, MHL(mobile high-definition link) 인터페이스, SD(secure Digital) 카드/MMC(multi-media card) 인터페이스 또는 IrDA(infrared data association) 규격 인터 페이스를 포함할 수 있다. 상기 오디오 모듈 1180은 소리(sound)와 전기신호를 쌍방향으로 변환시킬 수 있다. 상기 오디오 모듈 1180의 적 어도 일부 구성요소는, 예를 들면, 도 9 에 도시된 입출력 인터페이스 940에 포함될 수 있다. 상기 오디오 모듈 1180은, 예를 들면, 스피커 1182, 리시버 1184, 이어폰 1186 또는 마이크 1188 등을 통해 입력 또는 출력되는 소리 정보를 처리할 수 있다. 상기 카메라 모듈 1191은 정지 영상 및 동영상을 촬영할 수 있는 장치로서, 한 실시예에 따르면, 하나 이상의 이미지 센서(예: 전면 센서 또는 후면 센서), 렌즈(미도시), ISP(image signal processor, 미도시) 또는 플래 쉬 (flash, 미도시)(예: LED 또는 xenon lamp)를 포함할 수 있다. 상기 전력 관리 모듈 1195은 상기 전자 장치 1101의 전력을 관리할 수 있다. 도시하지는 않았으나, 상기 전력 관리 모듈 1195은, 예를 들면, PMIC(power management integrated circuit), 충전 IC(charger integrated circuit) 또는 배터리 또는 연료 게이지(battery or fuel gauge)를 포함할 수 있다. 상기 PMIC는, 예를 들면, 집적회로 또는 SoC 반도체 내에 탑재될 수 있다. 충전 방식은 유선과 무선으로 구분될 수 있다. 상기 충전 IC는 배터리를 충전시킬 수 있으며, 충전기로부터의 과전압 또는 과전류 유입을 방지할 수 있다. 한 실시예에 따르면, 상기 충전 IC는 유선 충전 방식 또는 무선 충전 방식 중 적어도 하나를 위한 충전 IC를 포함할 수 있다. 무선 충전 방식으로는, 예를 들면, 자기공명 방식, 자기유도 방식 또는 전자기파 방식 등 이 있으며, 무선 충전을 위한 부가적인 회로, 예를 들면, 코일 루프, 공진 회로 또는 정류기 등의 회로가 추가 될 수 있다. 상기 배터리 게이지는, 예를 들면, 상기 배터리 1196의 잔량, 충전 중 전압, 전류 또는 온도를 측정할 수 있다. 상기 배터리 1196는 전기를 저장 또는 생성할 수 있고, 그 저장 또는 생성된 전기를 이용하여 상기 전자 장치 1101에 전원을 공급할 수 있다. 상기 배터리 1196는, 예를 들면, 충전식 전지(rechargeable battery) 또는 태 양 전지(solar battery)를 포함할 수 있다. 상기 인디케이터 1197는 상기 전자 장치 1101 혹은 그 일부(예: 상기 AP 1110)의 특정 상태, 예를 들면, 부팅 상태, 메시지 상태 또는 충전 상태 등을 표시할 수 있다. 상기 모터 1198는 전기적 신호를 기계적 진동으로 변 환할 수 있다. 도시되지는 않았으나, 상기 전자 장치 1101는 모바일 TV 지원을 위한 처리 장치(예: GPU)를 포함 할 수 있다. 상기 모바일 TV지원을 위한 처리 장치는, 예를 들면, DMB(digital multimedia broadcasting), DVB(digital video broadcasting) 또는 미디어플로우(media flow) 등의 규격에 따른 미디어 데이터를 처리할 수 있다. 도 12는 본 발명의 다양한 실시예에 따른 CA 기술을 이용하는 무선통신 시스템에서 다수의 PDN에 연결하기 위한 흐름도이다. 도 12을 참조하면, 다양한 실시예에 따르면, 전자장치는 1201 동작에서 UE 상태(예: 사용자 구성, 배터리, 소비 전력 등)에 따라, 동적 CA 반송파에 기반한 다수 PDN의 운영 정책을 결정하거나 수정할 수 있다. 예컨대, 하기 <표 1> 또는 하기 <표 2>와 같이 동적 CA 반송파에 기반한 다수 PDN의 운영 정책을 결정하거나 수정할 수 있다. 전자장치는 1203 동작에, 결정된 동적 CA 반송파에 기반한 다수 PDN의 운영 정책에 따라, 데이터 통신을 위한 무선 베어러를 설정할 수 있다. 표 1 operation policy numberoperation descriptionEPS bearer ID APN band remark 1 VoLTE, VOD 1 PDN1 z 2 Browser, IMS 2 PDN2 x 3 MMS 3 PDN3 y VoLTE, VOD 서비스에 대응하는 PND1은 대역 z를 이용하고, Browser, IMS 서비스에 대응하는 PND2은 대역 x를 이용하고, MMS 서비스에 대응하는 PND3은 대역 y를 이용하도록 결정할 수 있다. 표 2 operation policy numberoperation descriptionEPS bearer ID APN band remark 1 VoLTE, VOD 1 PDN1 z 2 Browser, IMS, MMS 2 PDN2 x+yCA VoLTE, VOD 서비스에 대응하는 PND1은 대역 z를 이용하고, Browser, IMS, MMS 서비스에 대응하는 PND2은 대역 x+y를 이용하도록 결정할 수 있다. 다양한 실시예에서, 전자 장치의 동적 CA 반송파에 기반한 다수 PDN의 운영 정책은 실시간으로 변경될 수 있다. 예컨대, 상기 <표 1>에서 상기 <표 2>로 변경될 수 있다. 도 13은 본 발명의 다양한 실시예에 따른 CA 기술을 이용하는 무선통신 시스템에서 다수의 PDN에 연결하기 위한 흐름도이다. 도 13을 참조하면, 다양한 실시예에 따르면, 전자 장치는 1301 동작에서 UE 상태(예: 사용자 구성, 배터리, 소 비 전력 등)에 따라, 동적 CA 반송파에 기반한 다수 PDN의 운영 정책을 결정하고, 결정된 동적 CA 반송파에 기 반한 다수 PDN의 운영 정책에 대한 정보를 코어 네트워크로 전송할 수 있다. 예컨대, 상기 <표 1> 또는 상기 <표 2>와 같이 동적 CA 반송파에 기반한 다수 PDN의 운영 정책을 결정하여 코어 네트워크로 전송할 수 있다. 상기 코어 네트워크는 1303 동작에, 상기 전자 장치가 전송한 동적 CA 반송파에 기반한 다수 PDN의 운영 정책을 수용할 수 있는지를 결정하여, 상기 전자 장치가 사용할 최종 동적 CA 반송파에 기반한 다수 PDN의 운영 정책에 대한 정보를 상기 전자 장치로 전송할 수 있다. 예컨대, 상기 코어 네트워크는 네트워크 상태 및 기능(주파수, 대역폭, 사용자의 가입 요금)에 따라 동적 CA 반 송파에 기반한 PDNS의 운영 정책을 결정할 수 있다. 상기 전자 장치와 상기 코어 네트워크는 1305 동작에서, 상기 최종 동적 CA 반송파에 기반한 다수 PDN의 운영 정책에 따라, 데이터 통신을 위한 무선 베어러를 설정할 수 있다. CA 기술을 이용하는 무선통신 시스템에서 다수의 PDN에 연결하기 위한 전자 장치의 방법은, CA 반송파에 대한 정보 및 상기 CA 반송파에 기반한 제1 다수 PDN의 운영 정책에 대한 정보를 코어 네트워크로 전송하는 동작, 상 기 코어 네트워크로부터, 상기 CA 반송파에 기반한 제2 다수 PDN의 운영 정책에 대한 정보를 수신하는 동작, 상 기 수신된 CA 반송파에 기반한 제2 다수 PDN의 운영 정책에 따라, 데이터 통신을 위한 무선 베어러를 설정하는동작을 포함할 수 있다. 상기 CA 반송파에 기반한 제1 다수 PDN의 운영 정책에 대한 정보는 사용자 구성, 배터리, 소비 전력 중 적어도 하나에 의해 결정될 수 있다. 상기 CA 반송파에 기반한 제2 다수 PDN의 운영 정책에 대한 정보는, 주파수, 대역폭, 사용자의 서비스 품질, 사 용자의 가입 요금, 지연(latency), 지터(jitter)중 적어도 하나에 결정될 수 있다. 상기 PDN의 운영 정책은 적어도 하나 이상의 반송파와 적어도 하나 이상의 PDN의 사이의 매핑 정보를 포함할 수 있다. 상기 제2 다수 PDN의 운영 정책은 네트워크 환경에 따라 실시간으로 갱신될 수 있다. 상기 데이터 통신을 위한 무선 베어러의 경로는 전자 장치-기지국-서빙 게이트웨이(S-GW)-PDN 게이트웨이(P-GW) 사이에 생성될 수 있다. 상기 무선통신 시스템은, LTE(long term evolution) 시스템일 수 있다. CA 기술을 이용하는 무선통신 시스템에서 다수의 PDN에 연결하기 위한 코어 네트워크의 방법은, CA 반송파에 대 한 정보 및 상기 CA 반송파에 기반한 제1 다수 PDN의 운영 정책에 대한 정보를 전자 장치로부터 수신하는 동작; 상기 CA 반송파에 기반한 제1 다수 PDN의 운영 정책을 수용할지를 판단하는 동작; 상기 판단 결과에 따라, 상기 CA 반송파에 기반한 제2 다수 PDN의 운영 정책에 대한 정보를 상기 전자 장치로 전송하는 동작; 상기 CA 반송파 에 기반한 제2 다수 PDN의 운영 정책에 따라, 데이터 통신을 위한 무선 베어러를 설정하는 동작을 포함할 수 있 다. 상기 CA 반송파에 기반한 제1 다수 PDN의 운영 정책에 대한 정보는 사용자 구성, 배터리, 소비 전력 중 적어도 하나에 의해 결정될 수 있다. 상기 CA 반송파에 기반한 제2 다수 PDN의 운영 정책에 대한 정보는, 주파수, 대역폭, 사용자의 서비스 품질, 사 용자의 가입 요금, 지연(latency), 지터(jitter)중 적어도 하나에 의해 결정될 수 있다. 상기 PDN의 운영 정책은 적어도 하나 이상의 반송파와 적어도 하나 이상의 PDN의 사이의 매핑 정보를 포함할 수 있다. 상기 제2 다수 PDN의 운영 정책을 네트워크 환경에 따라 실시간으로 갱신하는 동작을 더 포함할 수 있다. 상기 데이터 통신을 위한 무선 베어러의 경로는, 전자 장치-기지국-서빙 게이트웨이(S-GW)-PDN 게이트웨이(P- GW) 사이에 생성될 수 있다. 상기 무선통신 시스템은, LTE(long term evolution) 시스템일 수 있다. 본 발명의 다양한 실시예에 따른 전자 장치의 전술한 구성요소들 각각은 하나 또는 그 이상의 부품(component) 으로 구성될 수 있으며, 해당 구성 요소의 명칭은 전자 장치의 종류에 따라서 달라질 수 있다. 본 발명의 다양 한 실시예에 따른 전자 장치는 전술한 구성요소 중 적어도 하나를 포함하여 구성될 수 있으며, 일부 구성요소가 생략되거나 또는 추가적인 다른 구성요소를 더 포함할 수 있다. 또한, 본 발명의 다양한 실시예에 따른 전자 장 치의 구성 요소들 중 일부가 결합되어 하나의 개체(entity)로 구성됨으로써, 결합되기 이전의 해당 구성 요소들 의 기능을 동일하게 수행할 수 있다. 본 발명의 다양한 실시예에 사용된 용어 “모듈”은, 예를 들어, 하드웨어, 소프트웨어 또는 펌웨어(firmware) 중 하나 또는 둘 이상의 조합을 포함하는 단위(unit)를 의미할 수 있다. “모듈”은 예를 들어, 유닛(unit), 로 직(logic), 논리 블록(logical block), 부품(component) 또는 회로(circuit) 등의 용어와 바꾸어 사용 (interchangeably use)될 수 있다. “모듈”은, 일체로 구성된 부품의 최소 단위 또는 그 일부가 될 수 있다. “모듈”은 하나 또는 그 이상의 기능을 수행하는 최소 단위 또는 그 일부가 될 수도 있다. “모듈”은 기계적 으로 또는 전자적으로 구현될 수 있다. 예를 들면, 본 발명의 다양한 실시예에 따른 “모듈”은, 알려졌거나 앞 으로 개발될, 어떤 동작들을 수행하는 ASIC(application-specific integrated circuit) 칩, FPGAs(field- programmable gate arrays) 또는 프로그램 가능 논리 장치(programmable-logic device) 중 적어도 하나를 포함 할 수 있다. 다양한 실시예에 따르면, 본 발명의 다양한 실시예에 따른 장치(예: 모듈들 또는 그 기능들) 또는 방법(예: 동 작들)의 적어도 일부는, 예컨대, 프로그래밍 모듈의 형태로 컴퓨터로 읽을 수 있는 저장매체(computer-readable storage media)에 저장된 명령어로 구현될 수 있다. 상기 명령어는, 하나 이상의 프로세서 (예: 상기 프로세서 920)에 의해 실행될 경우, 상기 하나 이상의 프로세서가 상기 명령어에 해당하는 기능을 수행할 수 있다. 컴퓨 터로 읽을 수 있는 저장매체는, 예를 들면, 상기 메모리 930가 될 수 있다. 상기 프로그래밍 모듈의 적어도 일 부는, 예를 들면, 상기 프로세서210에 의해 구현(implement)(예: 실행)될 수 있다. 상기 프로그래밍 모듈 의 적 어도 일부는 하나 이상의 기능을 수행하기 위한, 예를 들면, 모듈, 프로그램, 루틴, 명령어 세트 (sets of instructions) 또는 프로세스 등을 포함할 수 있다. 상기 컴퓨터로 판독 가능한 기록 매체에는 하드디스크, 플로피디스크 및 자기 테이프와 같은 마그네틱 매체 (Magnetic Media)와, CD-ROM(Compact Disc Read Only Memory), DVD(Digital Versatile Disc)와 같은 광기록 매체(Optical Media)와, 플롭티컬 디스크(Floptical Disk)와 같은 자기-광 매체(Magneto-Optical Media)와, 그 리고 ROM(Read Only Memory), RAM(Random Access Memory), 플래시 메모리 등과 같은 프로그램 명령(예: 프로그 래밍 모듈)을 저장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함될 수 있다. 또한, 프로그램 명령에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실 행될 수 있는 고급 언어 코드를 포함할 수 있다. 상술한 하드웨어 장치는 본 발명의 다양한 실시예의 동작을 수 행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지다. 본 발명의 다양한 실시예에 따른 모듈 또는 프로그래밍 모듈은 전술한 구성요소들 중 적어도 하나 이상을 포함 하거나, 일부가 생략되거나, 또는 추가적인 다른 구성요소를 더 포함할 수 있다. 본 발명의 다양한 실시예에 따 른 모듈, 프로그래밍 모듈 또는 다른 구성요소에 의해 수행되는 동작들은 순차적, 병렬적, 반복적 또는 휴리스 틱(heuristic)한 방법으로 실행될 수 있다. 또한, 일부 동작은 다른 순서로 실행되거나, 생략되거나, 또는 다른 동작이 추가될 수 있다. 다양한 실시예에 따르면, 명령들을 저장하고 있는 저장 매체에 있어서, 상기 명령들은 적어도 하나의 프로세서 에 의하여 실행될 때에 상기 적어도 하나의 프로세서로 하여금 적어도 하나의 동작을 수행하도록 설정된 것으로 서, 상기 적어도 하나의 동작은, CA 기술을 이용하는 무선통신 시스템에서 다수의 PDN에 연결하기 위한 전자 장 치의 방법에 있어서, 다수의 반송파를 하나의 반송파로 묶는 CA 반송파에 대한 정보 및 상기 CA 반송파에 기반 한 제1 다수 PDN의 운영 정책에 대한 정보를 코어 네트워크로 전송하는 동작; 상기 코어 네트워크로부터, 상기 CA 반송파에 기반한 제2 다수 PDN의 운영 정책에 대한 정보를 수신하는 동작; 상기 수신된 CA 반송파에 기반한 제2 다수 PDN의 운영 정책에 따라, 데이터 통신을 위한 무선 베어러를 설정하는 동작을 포함할 수 있다. 그리고 본 명세서와 도면에 개시된 본 발명의 실시예들은 본 발명의 실시예에 따른 의 기술 내용을 쉽게 설명하 고 본 발명의 실시예의 이해를 돕기 위해 특정 예를 제시한 것일 뿐이며, 본 발명의 실시예의 범위를 한정하고 자 하는 것은 아니다. 따라서 본 발명의 다양한 실시예의 범위는 여기에 개시된 실시예들 이외에도 본 발명의 다양한 실시예의 기술적 사상을 바탕으로 도출되는 모든 변경 또는 변형된 형태가 본 발명의 다양한 실시예의 범위에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2014-0083170", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 다양한 실시예에 따른 일반적인 LTE 이동 통신 시스템의 구조를 도시하는 도면이다. 도 2는 본 발명의 다양한 실시예에 따른 사용자 평면에 대한 무선 프로토콜 구조를 나타낸 블록도이다. 도 3은 본 발명의 다양한 실시예에 따른 CA 기술을 이용하는 LTE 시스템에서 초기 접속(Initial Attach)을 위한 흐름도이다. 도 4는 본 발명의 다양한 실시예에 따른 CA 개념을 도시하고 있다. 도 5(a) 내지 도 5(c)는 본 발명의 다양한 실시예에 따른 CA의 종류를 도시하고 있다. 도 6(a) 내지 도 6(d)는 본 발명의 다양한 실시예에 따른 CA 기술에 따른 단말 종류를 도시하고 있다. 도 7(a) 내지 도 7(c)은 본 발명의 다양한 실시예에 따른 UE와 P-GW 간 터널링으로 연결된 LTE 시스템에서 동적 인 CA와 다수의 PDN을 연결하는 시나리오를 도시하고 있다. 도 8(a) 내지 도 8(c)은 본 발명의 다양한 실시예에 따른 모뎀 레벨과 애플리케이션 레벨 간 동적인 CA에 따라 다수의 PDN을 연결하는 시나리오를 도시하고 있다. 도 9는 다양한 실시예에 따른, 전자 장치 901을 포함하는 네트워크 환경 800를 도시한다. 도 10은 다양한 실시예들에 따른, 전자 장치(예: 전자 장치 901)의 PDN 연결 모듈 970의 블록도 900를 도시한다. 도 11은 다양한 실시예들에 따른 전자 장치 1101의 블록도 1300를 도시한다. 도 12는 본 발명의 다양한 실시예에 따른 CA 기술을 이용하는 무선통신 시스템에서 다수의 PDN에 연결하기 위한 흐름도이다. 도 13은 본 발명의 다양한 실시예에 따른 CA 기술을 이용하는 무선통신 시스템에서 다수의 PDN에 연결하기 위한흐름도이다."}
