{"patent_id": "10-2024-0166708", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0178249", "출원번호": "10-2024-0166708", "발명의 명칭": "테스트 핸들러", "출원인": "(주)테크윙", "발명자": "나윤성"}}
{"patent_id": "10-2024-0166708", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 부품이 각각 안착될 수 있는 복수 개의 포켓이 형성된 고객 트레이를 파지하여 이동시키는 트랜스퍼; 상기 고객 트레이가 적층되는 스택커; 상기 전자 부품 및 상기 고객 트레이를 인식하여 바코드정보를 획득하는 바코드인식기; 및 상기 바코드인식기에 의해 획득된 영상에 기초하여 상기 전자 부품 및 상기 고객 트레이의 이력상황을 분석 판단하는 제어기를 포함하는,테스트 핸들러."}
{"patent_id": "10-2024-0166708", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 상기 바코드인식기는상기 전자 부품의 상면, 상기 고객 트레이의 상면, 또는 상기 고객 트레이의 측면 중 어느 하나에 제공된 식별자를 인식할 수 있는,테스트 핸들러."}
{"patent_id": "10-2024-0166708", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 전자 부품의 측면 또는 상기 고객 트레이의 측면 중 어느 하나를 반사할 수 있는 반사경을 더 포함하고,상기 바코드인식기는상기 반사경을 통해 상기 전자 부품 또는 상기 고객 트레이의 측면에 제공된 식별자를 인식할 수 있고,상기 식별자는 바코드 또는 RFID 정보를 포함하는,테스트 핸들러."}
{"patent_id": "10-2024-0166708", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서, 상기 스택커는 상기 고객 트레이의 적층을 위한 언로딩스택커를 포함하고,상기 언로딩스택커에는 상기 전자 부품 및 상기 고객 트레이를 인식할 수 있는 바코드인식기가 배치되는,테스트 핸들러."}
{"patent_id": "10-2024-0166708", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4 항에 있어서, 상기 바코드인식기는상기 고객 트레이가 상기 트랜스퍼에 의해 파지된 상태에서 상기 스택커로의 적층을 위해, 상기 스택커의 상측에 위치될 때, 상기 전자 부품의 상면, 상기 고객 트레이의 상면, 또는 상기 고객 트레이의 측면 중 어느 하나공개특허 10-2024-0178249-3-를 인식할 수 있는,테스트 핸들러."}
{"patent_id": "10-2024-0166708", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서, 상기 스택커는상기 고객 트레이와 대응되는 형태로 제공되는 스택커 프레임; 상기 고객 트레이의 모서리 부분을 지지하도록 상기 스택커 프레임에 배치되는 적층 지지봉; 및상기 고객 트레이의 적층 방향을 안내하도록 상기 적층 지지봉에 인접하게 배치되는 방향 인식봉을 포함하고,상기 방향 인식봉 및 상기 적층 지지봉은 상기 고객 트레이를 상방향 또는 전방향으로 가이드하도록 상기 스택커 프레임에 회전가능하게 연결됨으로써,상기 고객 트레이의 이동 경로를 개폐하는 도어 역할을 제공하는,테스트 핸들러."}
{"patent_id": "10-2024-0166708", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 테스트 핸들러에 관한 것이다. 구체적으로 본 발명의 일 실시예에 따르면, 전자 부품이 각각 안착될 수 있는 복수 개의 포켓이 형성된 고객 트레이를 파지하여 이동시키는 트랜스퍼; 상기 고객 트레이가 적층되는 스택커; 상기 전자 부품 및 상기 고객 트레이를 인식하여 바코드정보를 획득하는 바코드인식기; 및 상기 바코드 인식기에 의해 획득된 영상에 기초하여 상기 전자 부품 및 상기 고객 트레이의 이력상황을 분석 판단하는 제어기 를 포함하는, 테스트 핸들러가 제공될 수 있다."}
{"patent_id": "10-2024-0166708", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 테스트 핸들러에 대한 발명이다."}
{"patent_id": "10-2024-0166708", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로, 메모리 반도체 소자 등의 전자 부품은 내구성 및 불량여부 검출 등의 테스트를 거친 후에 시중에 유통된다. 이러한 전자 부품의 테스트를 위해서는, 테스트 핸들러(test handler)가 필요하다. 테스트 핸들러는 전기적으로 연결된 전자 부품을 테스트하는 테스터(tester), 및 테스터에 전자 부품을 전기적으로 연결시키기 위한 장치이다. 테스트 핸들러는 테스트 처리량을 늘리기 위해, 복수 개의 전자 부품을 한꺼번에 운반 가능한 테스트 트레이 (test tray)에 적재된다. 전자 부품은 테스트 트레이에 적재된 상태에서, 테스터의 테스트 소켓(test socket)에 전기적으로 접속되어 테스트를 수행한다. 테스트 대상이 되는 전자 부품은, 고객 트레이(customer tray)에 적재 된 상태로 테스트 핸들러에 의해 이동된다. 고객 트레이는 전자 부품이 적재되며 전자 부품을 보관하는 역할을 한다. 테스트될 전자 부품들이 고객 트레이에 적재되어 테스트 트레이로 전달되고, 테스트 트레이에 서 테스트 가 완료된 전자 부품들은 고객 트레이에 적재된다. 테스트 핸들러는 테스트 트레이 이외에, 고객 트레이가 적층되는 복수 개의 스택커와, 스택커에 적층된 고객 트 레이를 이동시키는 복수 개의 트랜스퍼, 및 전자 부품을 고객 트레이 또는 테스트 트레이로부터 내리거나 고객 트레이 또는 테스트 트레이에 적재시키는 픽커를 포함한다. 테스트될 전자 부품들이 적재된 고객 트레이는, 복 수 개의 트랜스퍼 중 어느 하나의 트랜스퍼에 의해서, 복수 개의 스택커 중 어느 하나의 스택커로부터 테스트 트레이로 이동된다. 테스트 트레이에 적재되어 테스트된 전자 부품들은 픽커에 의해 테스트 트레이로부터 내려 져서 고객 트레이에 적재된다. 테스트된 적자 부품들이 적재된 고객 트레이는, 복수 개의 트랜스퍼 중 다른 하 나의 트랜스퍼에 의해서 복수 개의 스택커 중 다른 하나의 스택커에 적층된다. 일반적으로, 고객 트레이에는 복수 개의 전자 부품이 독립적으로 적재되기 위한 복수 개의 포켓이 형성되어 있 다. 복수 개의 전자 부품이 고객 트레이에 픽커에 의해 적재될 때, 포켓 리브(pocket leave) 현상이 발생될 수 있다. 포켓 리브 현상이란, 다수의 전자 부품들 중 일부 전자 부품이 고객 트레이 상의 포켓에 완전히 안착되지 못하고, 일부가 포켓 가장자리의 바깥쪽에 걸쳐지는 것과 같이, 전자 부품들이 포켓에 정상적으로 안착되지 못 하는 현상을 의미한다. 한편, 전자 부품이 고객 트레이에 적재될 때 뿐만 아니라, 고객 트레이에 적재되어 트랜스퍼에 의해 이송되는 과정에서도 포켓 리브 현상이 발생될 수 있다. 따라서, 전자 부품이 고객 트레이에 적재될 때 포켓 리브 현상이 발생되지 않았다 하더라도, 전자 부품이 고객 트레이에 적재되어 트랜스퍼에 의해 이송되는 과정에서 포켓 리브현상이 발생될 수 있다. 전자 부품이 고객 트레이에 적재되어 트랜스퍼에 의해 이송되는 과정에서 포켓 리브 현 상이 발생되면, 고객 트레이는 포켓 리브 현상이 발생된 상태로 스택커에 적층될 수 있다. 또한, 포켓 리브 현 상이 발생된 고객 트레이 위에 다른 고객 트레이가 적층될 때, 포켓 리브 현상이 발생된 전자 부품이 파손될 수 있다."}
{"patent_id": "10-2024-0166708", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 실시예들은 상기와 같은 배경에서 발명된 것으로서, 바코드인식기에 의해 획득된 영상에 기초하여 전 자 부품 및 고객 트레이의 이력상황을 분석 판단하는 테스트 핸들러를 제공하도록 하는 것이다."}
{"patent_id": "10-2024-0166708", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시예에 따르면, 전자 부품이 각각 안착될 수 있는 복수 개의 포켓이 형성된 고객 트레이를 파지하 여 이동시키는 트랜스퍼; 상기 고객 트레이가 적층되는 스택커; 상기 전자 부품 및 상기 고객 트레이를 인식하 여 바코드정보를 획득하는 바코드인식기; 및 상기 바코드인식기에 의해 획득된 영상에 기초하여 상기 전자 부품 및 상기 고객 트레이의 이력상황을 분석 판단하는 제어기를 포함하는 테스트 핸들러가 제공될 수 있다. 또한, 상기 바코드인식기는 상기 전자 부품의 상면, 상기 고객 트레이의 상면, 또는 상기 고객 트레이의 측면 중 어느 하나에 제공된 식별자를 인식할 수 있는, 또한, 상기 전자 부품의 측면 또는 상기 고객 트레이의 측면 중 어느 하나를 반사할 수 있는 반사경을 더 포함 하고, 상기 바코드인식기는 상기 반사경을 통해 상기 전자 부품 또는 상기 고객 트레이의 측면에 제공된 식별자 를 인식할 수 있고, 상기 식별자는 바코드 또는 RFID 정보를 포함할 수 있다. 또한, 상기 스택커는 상기 고객 트레이의 적층을 위한 언로딩스택커를 포함하고, 상기 언로딩스택커에는 상기 전자 부품 및 상기 고객 트레이를 인식할 수 있는 바코드인식기가 배치될 수 있다. 또한, 상기 바코드인식기는 상기 고객 트레이가 상기 트랜스퍼에 의해 파지된 상태에서 상기 스택커로의 적층을 위해, 상기 스택커의 상측에 위치될 때, 상기 전자 부품의 상면, 상기 고객 트레이의 상면, 또는 상기 고객 트 레이의 측면 중 어느 하나를 인식할 수 있는, 중 어느 하나를 인식할 수 있다. 또한, 상기 스택커는 상기 고객 트레이와 대응되는 형태로 제공되는 스택커 프레임; 상기 고객 트레이의 모서리 부분을 지지하도록 상기 스택커 프레임에 배치되는 적층 지지봉; 및 상기 고객 트레이의 적층 방향을 안내하도 록 상기 적층 지지봉에 인접하게 배치되는 방향 인식봉을 포함하고, 상기 방향 인식봉 및 상기 적층 지지봉은 상기 고객 트레이를 상방향 또는 전방향으로 가이드하도록 상기 스택커 프레임에 회전가능하게 연결됨으로써, 상기 고객 트레이의 이동 경로를 개폐하는 도어 역할을 제공할 수 있다."}
{"patent_id": "10-2024-0166708", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예들에 따르면, 스택커에 적층된 고객 트레이에서 전자 부품의 포켓에의 정상 안착여부를 판단하 고, 전자 부품이 포켓에 정상 안착되지 않은 경우 정상 안착되도록 할 수 있다는 효과가 있다. 또한, 본 발명의 실시예들에 따르면, 고객 트레이가 스택커에 적층될 때 전자 부품이 파손되지 않도록 할 수 있 다는 효과가 있다. 또한, 본 발명의 실시예들에 따르면, 전자 부품의 크기나 형상에 관계 없이, 스택커에 적층된 고객 트레이에서 전자 부품의 포켓에의 정상 안착여부를 판단할 수 있다는 효과가 있다."}
{"patent_id": "10-2024-0166708", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 본 발명의 기술적 사상을 구현하기 위한 구체적인 실시예에 대하여 도면을 참조하여 상세히 설명하 도록 한다. 아울러 본 발명을 설명함에 있어서 관련된 공지 구성 또는 기능에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명을 생략한다. 또한, 어떤 구성요소가 다른 구성요소에 '연결', '지지', '접속', '전달', '접촉'된다고 언급된 때에는 그 다른 구성요소에 직접적으로 연결, 지지, 접속, 공급, 전달, 접촉될 수도 있지만 중간에 다른 구성요소가 존재할 수 도 있다고 이해되어야 할 것이다. 본 명세서에서 사용된 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로 본 발명을 한정하려는 의도로 사용된 것은 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한 복수의 표현을 포함한다. 또한, 본 명세서에서 수직방향, 수평방향, 좌우방향, 위, 아래, 등의 표현은 도면에 도시를 기준으로 설명한 것 이며 해당 대상의 방향이 변경되면 다르게 표현될 수 있음을 미리 밝혀둔다. 마찬가지의 이유로 첨부 도면에 있 어서 일부 구성요소는 과장되거나 생략되거나 또는 개략적으로 도시되었으며, 각 구성요소의 크기는 실제 크기 를 전적으로 반영하는 것이 아니다. 또한, 제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 해당 구 성요소들은 이와 같은 용어들에 의해 한정되지는 않는다. 이 용어들은 하나의 구성요소들을 다른 구성요소로부 터 구별하는 목적으로만 사용된다. 명세서에서 사용되는 \"포함하는\"의 의미는 특정 특성, 영역, 정수, 단계, 동작, 요소 및/또는 성분을 구체화하 며, 다른 특정 특성, 영역, 정수, 단계, 동작, 요소, 성분 및/또는 군의 존재나 부가를 제외시키는 것은 아니다. 이하, 도 1 내지 도 7을 참조하여 본 발명의 일 실시예에 따른 테스트 핸들러의 구체적인 구성에 대하여 설명한 다. 테스트 핸들러는, 일정한 제조공정을 거쳐 제조된 전자 부품을 테스트하고, 테스트 결과에 따라 등급 별로 분류할 수 있다. 테스트 핸들러는 복수 개의 전자 부품을 테스터에 접속시켜 전자 부품의 테스트를 수행할 수 있다. 본 발명의 일 실시예에 따른 테스트 핸들러는 트랜스퍼, 스택커, 카메라 , 조명, 제어기, 디스플레이부 및 가진 장치를 포함할 수 있다. 트랜스퍼는 고객 트레이를 파지하여 이동시킬 수 있다. 고객 트레이의 일면에는 전자 부품이 각 각 안착될 수 있는 복수 개의 포켓(3-1)이 형성될 수 있다. 본 실시예에서, 고객 트레이는 반도체 표준 규격 에 따른 제댁(JEDEC) 트레이일 수 있다. 또한, 전자 부품은 HBM 형태로 구성되는 HBM 형태의 전자 부품, 및 복 수 개의 상기 전자 부품이 분리 가능하게 적층됨으로써, 다이 형태로 구성될 수 있는 다이형태의 전자 부품 중 하나 이상을 포함할 수 있다. 트랜스퍼는 고객 트레이를 파지하여 스택커로 이동시킬 수 있고, 고객 트레이를 스택커에 적층시킬 수 있다. 트랜스퍼에 의해 이동되는 고객 트레이에는, 테스터에 의해서 테스트된 전자 부품 이 복수 개의 포켓(3-1)에 각각 안착될 수 있다. 또한, 트랜스퍼는 스택커에 적층된 고객 트레이 의 파지를 해제하여 고객 트레이의 스택커에의 적층을 완료할 수 있다. 트랜스퍼는 트레이 파 지부, 및 파지부 이동기를 포함할 수 있다. 트레이 파지부는 고객 트레이를 파지하거나, 고객 트레이의 파지를 해제하도록 구성될 수 있다. 트 레이 파지부는 파지 지지판, 파지 구동부, 및 트레이 누름판을 포함할 수 있다. 파지 지지판은 파지 구동부 및 트레이 누름판을 지지하며 파지부 이동기에 연결될 수 있다. 파지 지지판은 고객 트레이와 유사한 형상일 수 있다. 예를 들어, 파지 지지판은 전체적으 로 직사각형인 고객 트레이와 유사하게 전체적으로 직사각형일 수 있다. 파지 지지판의 일면은 스택커 에 적층된 고객 트레이를 바라보는 면인 트레이 대향면일 수 있다. 다시 말해, 파지 지지판은 트 레이 대향면을 가질 수 있다. 예를 들어, 파지 지지판의 하면이 트레이 대향면이 될 수 있다. 파지 구동부는 고객 트레이를 파지하거나 고객 트레이의 파지를 해제하도록 파지 지지판에 배 치될 수 있다. 파지 구동부는 파지구동 실린더(112-1), 파지구동 이동부재(112-2), 부재이동 가이드레일 (112-3), 제1 파지구동 링크(112-4), 제2 파지구동 링크(112-5), 및 파지부재(112-6)를 포함할 수 있다. 파지 구동 실린더(112-1)는 파지 지지판에 배치될 수 있다. 예를 들어, 파지구동 실린더(112-1)는 파지 지지판 의 상면에 배치될 수 있다. 파지구동 이동부재(112-2)는 파지구동 실린더(112-1)에 연결되어 파지 지지판 의 길이 방향으로 이동될 수 있다. 부재이동 가이드레일(112-3)은 파지구동 이동부재(112-2)의 이동을 가 이드하도록 파지 지지판에 배치될 수 있다. 제1 파지구동 링크(112-4)는, 2개가 파지구동 이동부재(112- 2)의 양 측으로 각각 이격된 상태에서 파지구동 이동부재(112-2)에 연결되도록 파지 지지판에 배치될 수 있다. 제2 파지구동 링크(112-5)는 제1 파지구동 링크(112-4)의 일측과 타측에 각각 회전 가능하게 연결될 수 있다. 파지부재(112-6)는 제2 파지구동 링크(112-5)에 연결되며 파지 지지판과 트레이 누름판을 관통 하여 회전 가능하게 배치될 수 있다. 파지부재(112-6)에는 고객 트레이가 걸리는 트레이 걸림부(112-61)가 형성될 수 있다. 또한, 파지부재(112-6)에는 트레이 누름판을 지지하는 누름판 지지부(112-62)가 형성될 수 있다. 파지구동 실린더(112-1)에 의한 파지구동 이동부재(112-2)의 파지 지지판의 길이방향의 이동에 따라, 파지부재(112-6)가 회전할 수 있다. 또한, 파지부재(112-6)의 회전위치에 따라, 고객 트레이가 파지부 재(112-6)의 트레이 걸림부(112-61)에 걸리거나 걸리지 않는 것으로, 고객 트레이가 파지되거나 파지가 해제 될 수 있다. 트레이 누름판은 트레이 파지부가 고객 트레이를 파지한 상태에서 이동할 때, 트레이 파지부(11 0)에 대한 고객 트레이의 상대적인 움직임을 방지하도록 고객 트레이의 적어도 일부를 누를 수 있다. 예 를 들어, 트레이 누름판은 포켓(3-1)이 형성되지 않은 고객 트레이의 부분을 누를 수 있다. 다시 말해, 트레이 누름판은 고객 트레이의 가장자리를 누를 수 있다. 트레이 누름판에 의해서 고객 트레이 의 트레이 파지부에 대한 상대적인 움직임이 방지되기 때문에, 트랜스퍼에 의한 고객 트레이의 이송시, 전자 부품이 정상 안착 상태에서 벗어나는 것이 최소화될 수 있다. 다시 말해, 트랜스퍼에 의 한 고객 트레이의 이송시, 고객 트레이에서의 전자 부품의 포켓 리브(pocket leave) 현상이 발생되는 것이 최소화될 수 있다. 트레이 누름판은 파지 지지판의 트레이 대향면과 이격되게 파지 지지판에 연결될 수 있다. 예를 들어, 트레이 누름판은 파지 지지판의 아래에서 파지 지지판의 하면과 이격되게 파지 지지판 에 연결될 수 있다. 또한, 트레이 누름판에는 파지 지지판을 회전 가능하게 관통한 파지부재 (112-6)가 회전 가능하게 관통할 수 있다. 트레이 누름판은 파지 지지판과 유사한 형상일 수 있다. 예를 들어, 트레이 누름판은 전체적으로 직사각형인 파지 지지판과 유사하게 전체적으로 직사각형일수 있다. 트레이 누름판에는 노출구멍(113-1)이 형성될 수 있다. 노출구멍(113-1)을 통해, 파지 지지판 의 트레이 대향면에 배치되는 카메라와 조명이 노출될 수 있다. 파지부 이동기는 트레이 파지부를 이동시킬 수 있다. 파지부 이동기는 트레이 파지부를 수 직방향과 수평방향으로 이동시킬 수 있다. 트레이 파지부 이동기는 수직방향 이동부 및, 수평방향 이 동부를 포함할 수 있다. 수직방향 이동부는 트레이 파지부를 수직방향으로 이동시킬 수 있다. 수직방향 이동부는 수직이 동 베이스(121-1), 수직이동 연결부재(121-2), 수직이동 가이드레일(121-3), 수직이동 스크류(121-4), 및 수직 이동 구동모터(121-5)를 포함할 수 있다. 수직이동 베이스(121-1)는 수직이동 가이드레일(121-3), 및 수직이동 스크류(121-4)를 지지할 수 있다. 수직이동 연결부재(121-2)는 트레이 파지부에 연결될 수 있다. 수직이동 연결부재(121-2)는 트레이 파지부의 파지 지지판에 연결될 수 있다. 예를 들어, 수직이동 연결부재 (121-2)는 파지 지지판의 뒷부분에 연결될 수 있다. 수직이동 가이드레일(121-3)은 수직이동 연결부재 (121-2)의 수직방향 이동을 가이드하도록 수직이동 베이스(121-1)에 배치될 수 있다. 수직이동 스크류(121-4)는 수직이동 연결부재(121-2)를 관통하여 회전 가능하게 배치될 수 있다. 수직이동 구동모터(121-5)는 수직이동 스 크류(121-4)에 연결되어 수직이동 스크류(121-4)를 회전시킬 수 있다. 수직이동 구동모터(121-5)에 의한 수직이 동 스크류(121-4)의 회전에 의해서, 수직이동 연결부재(121-2)가 수직이동 가이드레일(121-3)을 따라 수직방향 으로 이동할 수 있다. 또한, 수직이동 연결부재(121-2)가 연결된 트레이 파지부가 수직방향으로 이동할 수 있다. 다시 말해, 트레이 파지부가 승강할 수 있다. 수평방향 이동부는 트레이 파지부를 수평방향으로 이동시킬 수 있다. 수평방향 이동부는 수직방 향 이동부를 수평방향으로 이동시켜서 트레이 파지부를 수평방향으로 이동시킬 수 있다. 예를 들어, 수평방향 이동부는 트레이 파지부를 좌우방향으로 이동시킬 수 있다. 수평방향 이동부는 수직방 향 이동부를 좌우방향으로 이동시켜서 트레이 파지부를 좌우방향으로 이동시킬 수 있다. 수평방향 이동부는 수평이동 베이스(122-1), 수평이동 가이드레일(122-2), 수평이동 풀리(122-3), 수평이 동 벨트(122-4), 및 수평이동 구동모터(122-5)를 포함할 수 있다. 수평이동 베이스(122-1)는 수평이동 가이드레 일(122-2), 수평이동 풀리(12-3), 수평이동 벨트(122-4), 및 수평이동 구동모터(122-5)를 지지할 수 있다. 수평 이동 가이드레일(122-2)은 수직이동 베이스(121-1)의 수평방향 이동을 가이드하도록 수평이동 베이스(122-1)에 배치될 수 있다. 수평이동 풀리(122-3)는 2개가 수평이동 베이스(122-1)에 서로 수평방향으로 이격되고 회전 가 능하게 배치될 수 있다. 예를 들어, 수평이동 풀리(122-3)는 수평이동 베이스(122-1)에 서로 좌우방향으로 이격 되고 회전 가능하게 배치될 수 있다. 수평이동 벨트(122-4)는 무한궤도운동을 하도록 2개의 수평이동 풀리(122- 3)에 연결되며 수직이동 베이스(121-1)가 연결될 수 있다. 수평이동 구동모터(122-5)는 2개의 수평이동 풀리 (122-3) 중 하나에 연결될 수 있다. 수평이동 구동모터(122-5)의 회전으로 2개의 수평이동 풀리(122-3) 중 하나 가 회전되는 것으로, 수평이동 벨트(122-4)가 무한궤도 운동을 할 수 있다. 수평이동 벨트(122-4) 무한궤도 운 동으로 수직이동 베이스(121-1)가 수평방향으로 이동되고, 트레이 파지부가 수평방향으로 이동될 수 있다. 스택커에는 고객 트레이가 적층될 수 있다. 일 예로, 스택커는 고객 트레이의 적층을 위한 언 로딩스택커일 수 있다. 언로딩스택커는 카메라 또는 바코드인식기를 통해, 전자 부품 및 고객 트레이가 인식되는 장소에 위치될 수 있다. 언로딩스택커에는 전자 부품 및 고객 트레이를 인식할 수 있는 카메라 또는 바코드인식기가 배치될 수 있다. 스택커에는, 테스터에 의해서 테스트된 전자 부품이 복수 개의 포켓(3-1)에 각각 안착된 고객 트레이 가 트랜스퍼에 의해서 이동되고 적층될 수 있다. 스택커는 스택커 프레임, 적층 지지봉 , 및 방향 인식봉을 포함할 수 있다. 스택커 프레임은 적층 지지봉 및 방향 인식봉을 지지할 수 있다. 스택커 프레임에는 고객 트레이의 형상과 유사한 형상의 적층영역 표시구멍이 형성될 수 있다. 예를 들어, 적층영역 표시구멍 은 전체적으로 직사각형인 고객 트레이와 유사하게 전체적으로 직사각형일 수 있다. 적층영역 표시구멍 은 복수 개가 수평방향으로 서로 이격되게 스택커 프레임에 형성될 수 있다. 예를 들어, 복수 개의 적층영역 표시구멍이 좌우방향으로 서로 이격되게 스택커 프레임에 형성될 수 있다. 적층 지지봉은 고객 트레이가 적층되도록 지지할 수 있다. 적층 지지봉은 적층영역 표시구멍(21 1)의 모서리를 형성하는 스택커 프레임의 부분에 배치될 수 있다. 예를 들어, 적층 지지봉은 적층영 역 표시구멍의 각 모서리를 형성하는 스택커 프레임의 부분의 각각에 배치될 수 있다. 적층 지지봉은 고객 트레이의 모서리 부분을 각각 지지할 수 있다. 본 발명의 변형예로, 적층 지지봉은 고객 트레이의 이동 경로를 개폐하는 도어 역할을 제공할 수도 있 다. 적층 지지봉은 스택커 프레임에 회전가능 하게 연결됨으로써, 고객 트레이를 상방향 또는 전 방향으로 가이드할 수 있다. 고객 트레이가 AGV 또는 OHT를 통해 전방향(수평방향)에서 스택커를 통해 로딩되는 경우, 스택커의 상면은 개방되어 있으나, 스택커의 전면은 적층 지지봉 폐쇄되어 물류 상 어려움이 발생될 수 있는 바, 본 발명의 변형예에서는, 적층 지지봉이 스택커 프레임에 전방향(수 평방향)으로 회전가능하게 연결됨으로써, 고객 트레이가 AGV 또는 OHT를 통해 전방향(수평방향)에서 스택커 를 통해 로딩되더라도, 고객 트레이는 적층 지지봉에 의해 전방향(수평방향)으로 가이드될 수 있 다. 방향 인식봉은 고객 트레이의 적층 방향을 안내할 수 있다. 방향 인식봉은 복수 개의 적층 지지봉 중 하나와 인접하게 배치될 수 있다. 방향 인식봉은 고객 트레이가 잘못된 방향으로 적층되는 경 우, 적층되지 못하도록 할 수 있다. 방향 인식봉은 적층 지지봉의 개수보다 적어도 적은 개수로 제공 될 수 있다. 방향 인식봉은 고객 트레이가 스택커로 이동될 때, 고객 트레이의 측부를 가이드 할 수 있는 바(bar) 형상으로 제공될 수 있다. 예를 들어, 고객 트레이의 측부가 홈 형상으로 형성되는 경우, 고객 트레이가 스택커로 이동될 때, 방향 인식봉은 고객 트레이의 홈 형상의 측부를 효 과적으로 가이드할 수 있도록 홈 형상에 대응되는 바 형상으로 제공될 수 있다. 방향 인식봉은 고객 트레이를 상방향으로 가이드하도록 스택커 프레임에 고정 설치될 수 있다. 물론, 이에 한정되지 아니하며, 방향 인식봉은 고객 트레이를 상방향 또는 전방향으로 가이드하도록 스택커 프레 임에 회전가능하게 연결될 수 있다. 예를 들어, 방향 인식봉은 고객 트레이를 상방향 또는 전방향 으로 가이드하도록 회전장치를 통해 스택커 프레임에 회전가능하게 연결될 수 있다. 방향 인식봉은 스택커 프레임에 회전가능하게 연결되는 경우, 고객 트레이는 AGV 또는 OHT를 통해 상방향 뿐만 아니라 전방향에서 스택커로 로딩될 수 있다. 도 8을 참조하면, 카메라는 복수 개의 포켓(3-1)이 형성된, 고객 트레이의 일면인, 고객 트레이의 부품 안착면을 촬영하여 영상을 획득할 수 있다. 카메라는 파지 지지판의 트레이 대향면에 배치될 수 있다. 예를 들어, 카메라는 파지 지지판의 하면에 배치될 수 있다. 카메라는 복수 개로 제공되 고, 복수 개의 카메라는 고객 트레이의 부품 안착면을 부분 별로 나누어 촬영할 수 있도록 고객 트레이 의 길이 방향으로 서로 이격되게 파지 지지판의 트레이 대향면에 배치될 수 있다. 예를 들어, 카메라 는 4개이고, 4개의 카메라가 고객 트레이의 부품 안착면을 부분 별로 나누어 촬영할 수 있도록, 고객 트레이의 길이 방향으로 서로 이격되게 파지 지지판의 트레이 대향면에 배치될 수 있다. 또한, 복 수 개의 카메라는 스택커에 적층된 고객 트레이의 부품 안착면으로부터 소정의 촬영거리 이격된 상태에서, 스택커에 적층된 고객 트레이의 부품 안착면을 부분 별로 나누어 촬영할 수 있다. 복수 개의 카메라는 트레이 파지부의 이동으로 스택커에 적층된 고객 트레이의 부품 안착면으로부터 소 정의 촬영거리 이격될 수 있다. 또한, 복수 개의 카메라가 고객 트레이의 부품 안착면을 부분 별로 나 누어 촬영하도록 트레이 파지부가 이동하는 경우에, 트레이 파지부는 고객 트레이를 파지하지 않 을 수 있다. 복수 개의 카메라는 트레이 누름판의 노출구멍(113-1)을 통하여 누름판으로부터 돌출되지 않도 록 파지 지지판의 트레이 대향면에 배치될 수 있다. 따라서, 트레이 누름판이 고객 트레이를 누를 때, 복수 개의 카메라가 고객 트레이의 포켓(3-1)에 안착된 전자 부품에 접촉되지 않을 수 있다. 또 한, 트레이 누름판이 고객 트레이를 누를 때, 카메라에 의한 전자 부품의 훼손 등이 방지될 수 있다. 카메라는 2차원 영상을 획득하는 2D 웹 카메라일 수 있다. 물론, 이에 한정되지는 아니하며, 카메라 는 전자 부품의 포켓(3-1)에의 정상 안착여부를 확인할 수 있는 다양한 형태로 제공될 수 있다. 예를 들어, 카메라는 전자 부품의 바코드 또는 고객 트레이의 바코드를 인식할 수 있는 바코드리딩 카메라 또는 바코드리딩용 바코드리더기일 수 있다. 바코드리딩 카메라 또는 바코드리딩용 바코드리더기는 1D,2D,3D의 바코 드 뿐만 니라, 음양각의 글자, 숫자, 기호, RFID 등의 모든 식별인자를 리딩할 수 있는 카메라 또는 리더기일 수 있다. 이 카메라에 의해 인식된 바코드 정보는, 제어기에 전달될 수 있다. 제어기는 카메라 로부터 전달받은 전자 부품의 부품 정보를 인공지능(AI)을 이용하여 기록, 저장, 전송, 및 분석하여 이력 관리할 수 있다.카메라는 전자 부품의 상면 또는 고객 트레이의 상면과 고객 트레이의 전후좌우를 포함한 측면 중 어느 하나를 인식할 수 있다. 고객 트레이가 트랜스퍼에 의해 파지된 상태에서 스택커로의 적층을 위해, 스택커의 상측에 위치될 때, 카메라는 전자 부품의 상면 또는 고객 트레이의 상면과 고 객 트레이의 전후좌우를 포함한 측면 중 어느 하나를 인식할 수 있다. 조명은 카메라에 의한 고객 트레이의 부품 안착면의 촬영시 고객 트레이의 부품 안착면에 빛을 조사할 수 있다. 도시되지는 않았지만, 스택커의 상부는 셋플레이트가 승강가능하도록 배치되는 셋베이스 가 배치되어, 스택커 내부는 카메라가 고객 트레이의 부품 안착면을 촬영할 수 있을 정도의 빛이 없을 수 있다. 다시 말해, 스택커 내부는 어두울 수 있다. 따라서, 어두운 스택커 내부에서 카메라 가 고객 트레이의 부품 안착면을 촬영할 수 있도록, 조명이 고객 트레이의 부품 안착면에 빛을 조사할 수 있다. 조명은 트레이 누름판의 노출구멍(113-1)을 통해 노출되도록 파지 지지판의 트레이 대향면에 배 치될 수 있다. 파지 지지판의 트레이 대향면에서, 조명과 파지 지지판의 가장자리 사이와의 거 리는, 카메라와 파지 지지판의 가장자리 사이와의 거리보다 작을 수 있다. 또한, 조명은 복수 개로 제공되고, 복수 개의 조명은 트레이 누름판의 노출구멍(113-1)을 통하여 누름판으로부터 돌출되지 않도록 파지 지지판의 트레이 대향면에 배치될 수 있다. 따라서, 트레이 누름판이 고객 트 레이를 누를 때, 복수 개의 조명이 전자 부품에 접촉되지 않을 수 있다. 또한, 트레이 누름판 이 고객 트레이를 누를 때, 조명에 의한 전자 부품의 훼손 등이 방지될 수 있다. 조명은 LED일 수 있다. 또한, 조명은 PCB기판에 실장되어, 파지 지지판의 트레이 대향면에 배치될 수 있다. 제어기는 트랜스퍼, 스택커, 카메라, 조명, 가진 장치, 디스플레이부 및 가진 장치를 제어할 수 있다. 제어기는 트랜스퍼의 고객 트레이의 파지, 이동, 및 파지의 해제를 제어할 수 있다. 예를 들어, 제어기는 트랜스퍼의 파지구동 실린더(112-1), 수직이동 구동모터(121- 5), 및 수평이동 구동모터(122-5)에 연결되어, 트랜스퍼의 고객 트레이의 파지, 이동, 및 파지의 해제 를 제어할 수 있다. 또한, 제어기는 트랜스퍼의 수직이동 구동모터(121-5)와 수평이동 구동모터(122- 5)에 연결되어 트레이 파지부가 수직방향 또는 수직방향으로 이동하도록 제어할 수 있다. 또한, 제어기 는 카메라에 연결되어 카메라가 고객 트레이의 부품 안착면을 촬영하도록 제어할 수 있다. 또한, 제어기는 조명에 연결되어 카메라에 의한 고객 트레이의 부품 안착면의 촬영시 조명 이 고객 트레이의 부품 안착면에 빛을 조사하도록 제어할 수 있다. 또한, 제어기는 디스플레이부 에 연결되어 디스플레이부에 후술할 제1 판단 결과 영상, 제2 판단 결과 영상 및 제3 판단 결과 영상 중 하나 이상을 표시하도록 제어할 수 있다. 제어기는 카메라에 의해 획득된 고객 트레이의 부품 안착면의 영상에 기초하여 전자 부품의 고 객 트레이의 포켓(3-1)에의 정상 안착여부를 판단할 수 있다. 제어기는 복수 개의 카메라에서 획 득된, 고객 트레이의 부품 안착면의 각 부분의 영상인 개별 영상을 합성하여 합성 영상을 획득할 수 있다. 제어기는 복수 개의 카메라 각각에 연결되어 복수 개의 카메라 각각으로부터 개별 영상을 전달받을 수 있다. 또한, 제어기는 복수 개의 카메라 각각으로부터 전달 받은 개별 영상을 합성하여 합성 영상을 획득하고, 합성 영상에 기초하여 각 전자 부품의 고객 트레이의 포켓(3-1)에의 정상 안착여부를 판단할 수 있다. 도 9를 참조하면, 제어기는 합성 영상에 영역 형성선을 형성함으로써, 영역 형성선에 의해 정의 되는 안착판단 영역(4-1)을 합성 영상에 복수 개 형성할 수 있다. 제어기는 포켓(3-1)의 저면의 가장자 리와 적어도 일부가 중첩되도록 영역 형성선을 합성 영상에 형성할 수 있다. 또한, 제어기는 각 안 착판단 영역(4-1)이 다른 안착판단 영역(4-1)과 구별되도록 각 안착판단 영역(4-1)에 고유의 번호를 표시할 수 있다. 제어기에는 서로 다른 크기 또는 형상의 전자 부품에 대한 안착판단 영역(4-1)과 안착판단 영역(4-1) 내에서의 전자 부품에의 정상 안착 위치와 정상 안착 크기에 대한 정보가 저장될 수 있다. 예를 들어, 제어 기에는 30 가지 정도의 서로 다른 크기 또는 형상의 전자 부품에 대한 안착판단 영역(4-1)과 안착판단 영역(4-1) 내에서의 전자 부품에의 정상 안착 위치와 정상 안착 크기에 대한 정보가 저장될 수 있다. 또한, 제어기는 안착판단 영역(4-1) 내에서의 전자 부품의 위치와 크기를, 미리 저장된 정상 안착 위치와 정 상 안착 크기와 비교하여, 전자 부품의 포켓(3-1)에의 정상 안착여부를 판단할 수 있다. 한편, 제어기는 인공지능(AI)을 이용하여 전자 부품의 포켓(3-1)에의 정상 안착여부에 대한 판단 결과 를 학습하고 학습한 결과에 기초하여 전자 부품의 포켓(3-1)에의 정상 안착여부를 판단할 수 있다. 다시 말 해, 제어기는 안착판단 영역 내(4-1)에서의 전자 부품의 위치와 크기를, 미리 저장된 정상 안착 위치와 정상 안착 크기와 비교하여, 전자 부품의 포켓(3-1)에의 정상 안착여부를 판단하고 판단결과에 대하여 인공 지능(AI)을 이용하여 학습할 수 있다. 따라서, 제어기는, 후술할 바와 같이, 안착판단 영역(4-1)과 안착판 단 영역(4-1) 내에서의 정상 안착 위치와 정상 안착 크기가 제어기에 미리 저장되지 않은 크기 또는 형상 을 가지는 전자 부품에 대해서도 포켓(3-1)에의 정상 안착여부를 판단할 수 있다. 예를 들어, 제어기는 인공신경망(ANN, artificial neural network)을 이용한 딥러닝(deep learning) 알고리즘을 수행하여 전자 부품 의 포켓(3-1)에의 정상 안착여부에 대한 판단 결과를 학습할 수 있다. 제어기는 인공지능(AI)을 이용하여 학습한 결과에 기초하여, 미리 저장되지 않은 크기 또는 형상의 전자 부품에 대한 안착판단 영역(4-1)과 안착판단 영역(4-1) 내에서의 전자 부품의 정상 안착 위치와 정상 안 착 크기를 산출할 수 있다. 또한, 제어기는 산출된 결과에 기초하여 미리 저장되지 않은 크기 또는 형상의 전자 부품의 포켓(3-1)에의 정상 안착여부에 대하여 판단할 수 있다. 또한, 제어기는 판단 결과를 인공 지능(AI)을 이용하여 학습할 수 있다. 제어기는 전자 부품의 포켓(3-1)에의 정상 안착여부에 대한 판단 결과를 계속하여 인공지능(AI)을 이용하여 학습하기 때문에, 판단결과의 정확도가 향상될 수 있다. 도 10을 참조하면, 제어기는 전자 부품의 고객 트레이의 포켓(3-1)에의 정상 안착여부 정도가 복수 개의 색깔로 구분되어 표시된 영상인 제1 판단 결과 영상을 획득하여 디스플레이부에 표시할 수 있다. 예를 들어, 제어기는 전자 부품이 포켓(3-1)에 정상 안착된 경우, 연두색으로 표시할 수 있다. 또한, 제어기는 전자 부품이 포켓(3-1)에 정상 안착되지 않은 경우, 붉은색으로 표시할 수 있다. 또한, 제어 기는 전자 부품이 포켓(3-1)에 정상 안착되지 않았으나 그 정도가 덜한 경우, 붉은색 계통의 색으로 표 시할 수 있다. 또한, 제어기는 전자 부품이 포켓(3-1)에 경미하게 정상 안착되지 않아서 확인이 필요한 경우, 파란색으로 표시할 수 있다. 제1 판단 결과 영상을 통해서, 사용자는 고객 트레이에 적재된 전자 부품 전체의 포켓(3-1)에의 정상 안착 여부를 한 눈에 알 수 있다. 도 11을 참조하면, 제어기는 전자 부품의 고객 트레이의 포켓(3-1)에의 정상 안착여부 정도가 숫자 와 문자 중 하나 이상 표시된 영상인 제2 판단 결과 영상을 획득하여 디스플레이부에 표시할 수 있다. 예를 들어, 제어기는 고객 트레이의 각 포켓(3-1)에의 전자 부품의 정상 안착 여부 판단 결과를 OK 및 NG(no good) 중 하나로 표시할 수 있다. 여기에서, OK는 정상을 나타내고 NG는 불량을 나타낸다. 또한, 제어 기는 고객 트레이의 각 포켓(3-1)에의 전자 부품의 정상 안착 여부 판단 결과의 형태를 Normal, Defect, 및, Missing 중 하나로 표시할 수 있다. 여기에서, Normal은 전자 부품이 포켓(3-1)에 정상 안착된 것을 나타내며, Defect는 전자 부품이 포켓(3-1)에 정상 안착되지 않은 것을 나타내고, Missing은 전자 부품 이 포켓(3-1)에 경미하게 정상 안착되지 않아서 확인이 필요한 것을 나타낸다. 또한, 제어기는 고객 트레이의 각 포켓(3-1)에의 전자 부품의 정상 안착 여부 판단 결과에 대한 예 측도를 백분율(%)로 나타낼 수 있다. 다시 말해, 제어기는 전자 부품의 포켓(3-1)에의 정상 안착여부 정도를 포켓(3-1)에 대한 전자 부품의 안착정도의 백분율(%)로 수치화하여 획득할 수 있다. 제2 판단 결과 영상을 통해서, 사용자는 고객 트레이에 적재된 전자 부품 각각의 포켓(3-1)에의 정상 안착 여부를 보 다 상세하게 할 수 있다. 도 12를 참조하면, 제어기는 전자 부품의 고객 트레이의 포켓(3-1)에의 정상 안착여부 정도가 복수 개의 서로 다른 색상 또는 수치가 연속적으로 나타나는 그라데이션, 등고선, 및 명암과 색상 중 하나 이상이 불 연속적으로 상이하게 나타나는 영상 중 하나 이상으로 표시된 제3 판단 결과 영상을 디스플레이부에 표 시할 수 있다. 제3 판단 결과 영상이 그라데이션으로 표시되는 경우, 제어기는 포켓(3-1)에 안착되는 전자 부품의 평탄도에 따라 서로 다른 색상으로 표시되는 등고선 형태로 디스플레이부에 표시할 수 있 다. 또한, 제3 판단 결과 영상이 그라데이션으로 표시되는 경우, 제어기는 포켓(3-1)에 안착되는 전자 부품의 평탄도에 따라 여러 색상이 혼합되어 표시되는 등고선 형태로 디스플레이부에 표시할 수 있다. 제3 판단 결과 영상을 통해서, 사용자는 고객 트레이에 적재된 전자 부품 각각의 포켓(3-1)에의 정상 안착 여부를 한 눈에 알 수 있다. 제3 판단 결과 영상에서, 붉은 색은 불량을 나타냄이 아니라 붉은 색을 중 심으로 인식되었음으로 이해될 수 있다. 붉은 색이 표시된 부분을 기점으로 색을 달리해가며 등고선 형태의 그 라데이션 이미지가 형성되면, 전자 부품의 평탄도가 전자 부품의 안착상태에 근거하여 표시될 수 있다. 제3 판단 결과 영상에서, 그린색은 정상안착, 블루색은 불안정안안착, 레드색은 명확히 불량안착으로 구분하 여 표시될 수 있다. 레드색은 추가적으로 더 붉을수록 불량도가 심함을 나타내는 방식으로, 불량안착도가 제공 될 수 있다. 물론, 제3 판단 결과 영상의 색상은 작업자에 따라 다르게 선정될 수 있다. 제3 판단 결과 영상은 포켓(3-1)에 대한 전자 부품의 안착정도에 따라, 수치화하여 표시될 수 있다. 이때, 각각의 수치의 범 위는 인공지능학습(딥러닝)을 통해 한정될 수 있고, 그 수치의 범위는 학습도에 따라 달라지므로, 보다 명확하 고 정밀해질 수 있다. 제어기는 전자 부품의 포켓(3-1)에의 정상 안착여부 판단 결과 포켓리브부품(정상 안착되지 않은 전자 부품)이 있다고 판단될 경우, 알람신호를 발생시킬 수 있다. 알람신호는 소리나 빛 또는 진동 등이 될 수 있다. 예를 들어, 각 스택커에는 알람 또는 경고등이 배치되고, 제어기는 포켓리브부품이 있는 고객 트레이 가 적층된 스택커에 배치된 알람을 울리거나 경고등을 작동시킬 수 있다. 제어기에 의해서 알람이 울리거나 경고등이 작동하면, 사용자가 해당 스택커를 배출시킨 후 픽커를 사용하여 포켓리브부품을 포켓 (3-1)에 정상 안착시킬 수 있다. 또한, 사용자는 포켓리브부품을 정상 안착시키도록 제어기에 전자적으로 명령신호를 줄 수 있다. 포켓리브부품을 정상 안착시키라는 명령신호를 받은 제어기는, 스택커에 배 치된 가진 장치 또는 트레이 누름판을 통해 고객 트레이를 가진하여 포켓리브부품을 정상 안착시킬 수 있다. 이러한 경우, 사용자는 디스플레이부에 표시되는 제1 판단 결과 영상 또는 제3 판단 결과 영상 을 보면서 실시간으로 포켓리브부품이 포켓(3-1)에 정상 안착되는지 확인할 수 있다. 물론, 이에 한정되지는 아니하며, 제어기는 전자 부품의 포켓(3-1)에의 정상 안착여부와 무관하게, 고객 트레이를 가진함으 로써, 전자 부품이 포켓(3-1)에 정상 안착되도록 할 수 있다. 다시 말해, 제어기는 인공지능(AI)을 이 용한 학습한 결과에 기초하여, 고객 트레이에 대한 가진이 필요하고 판단되면, 제어기는 가진 장치 에 의해 고객 트레이가 가진됨으로써 포켓리브부품이 정상안착되도록 가진 장치를 제어할 수 있다. 제어기는 마이크로프로세서를 포함하는 연산 장치, 메모리 등에 의해 구현될 수 있으며, 그 구현 방식은 당업자에게 자명한 사항이므로 더 이상의 자세한 설명을 생략한다. 디스플레이부는 제어기에 의해서 합성 영상을 표시할 수 있다. 또한, 디스플레이부는 제어기 에 의해서 제1 판단 결과 영상을 표시할 수 있다. 또한, 디스플레이부는 제어기에 의해서 제 2 판단 결과 영상을 표시할 수 있다. 또한, 디스플레이부는 제어기에 의해서 제3 판단 결과 영상 을 표시할 수 있다. 합성 영상이나 제1 판단 결과 영상 또는 제3 판단 결과 영상이 디스플레이부 에 표시될 때, 제어기에 의해서, 디스플레이부에는 하나의 포켓(3-1) 또는 소정 개수의 포켓(3- 1)이 확대되어 표시될 수 있다. 또한, 합성 영상, 제1 판단 결과 영상, 제2 판단 결과 영상, 및 제3 판단 결과 영상은 제어기에 의해서, 하나 이상 디스플레이부에 표시될 수 있다. 도 4 내지 도 5를 다시 참조하면, 가진 장치는 고객 트레이의 포켓(3-1)에 정상 안착되지 않은 전자 부 품인 포켓리브부품이 정상 안착되도록 고객 트레이를 가진할 수 있다. 본 실시예에서, 가진 장치는 트랜스퍼가 고객 트레이의 적어도 일부를 누를 때, 트레이 누름판을 통하여 고객 트레이를 가 진하도록 구성되지만, 이에 한정되는 아니하며, 가진 장치는 스택커에 배치되어 고객 트레이의 하 측에서 고객 트레이를 가진할 수 있다. 가진 장치는 회전 운동을 통해, 고객 트레이 또는 고객 트레이를 지지하는 트레이 누름판을 가 진할 수 있다. 가진 장치는 고객 트레이 또는 트레이 누름판에 인접하게 배치될 수 있다. 일 예로, 가진 장치는 트랜스퍼의 파지 지지판에 배치될 수 있다. 이러한 가진 장치는 구동몸 체 및 진동체를 포함할 수 있다. 구동몸체는 트랜스퍼의 파지 지지판에 설치될 수 있다. 구동몸체는 포켓 리브 현상을 제거 하기 위한 진동력을 진동체에 제공할 수 있다. 구동몸체는 진동력을 발생시키는 모터를 포함할 수 있 다. 구동몸체의 모터는 제어기에 의해 제어될 수 있다. 진동체는 구동몸체로부터 전달받은 진동력을 고객 트레이 또는 트레이 누름판에 제공할 수 있다. 진동체는 구동몸체에 회전 운동이 가능하게 연결될 수 있다. 진동체는 고객 트레이 또 는 트레이 누름판에 접촉 가능하게 위치될 수 있다. 도 6을 다시 참조하면, 가진 장치는 직선 왕복 운동을 통해, 고객 트레이를 지지하는 트레이 누름판 을 타격함으로써, 트레이 누름판을 가진할 수 있다. 가진 장치는 트레이 누름판에 인접하 게 배치될 수 있다. 일 예로, 가진 장치는 트랜스퍼의 파지 지지판에 배치될 수 있다. 이러한 가진 장치는 구동몸체, 진동체 및 지지브라켓을 포함할 수 있다. 구동몸체는 트랜스퍼의 파지 지지판에 설치될 수 있다. 구동몸체는 포켓 리브 현상을 제거 하기 위한 진동력을 진동체에 제공할 수 있다. 구동몸체는 진동력을 발생시키는 실린더 또는 피스톤 방식의 액츄에이터를 포함할 수 있다. 구동몸체의 작동은 제어기에 의해 제어될 수 있다. 진동체는 구동몸체로부터 전달받은 진동력을 지지브라켓을 통해 트레이 누름판에 제공할 수 있다. 진동체는 구동몸체에 직선 왕복 운동이 가능하게 연결될 수 있다. 진동체는 트레이 누 름판의 지지브라켓에 접촉 가능하게 위치될 수 있다. 진동체는 타격으로 인한 지지브라켓 의 손상을 방지하기 위한 탄성부재를 포함할 수 있다. 지지브라켓은 진동체에 의한 직접적인 타격이 이루어지는 브라켓일 수 있다. 지지브라켓은 트레 이 누름판에 배치될 수 있다. 지지브라켓은 진동체의 직선 왕복 운동 경로 상에 대향되게 위치 될 수 있다. 진동체에 의해 반복적인 타격될 때, 지지브라켓은 트레이 누름판을 가진할 수 있다. 한편, 본 발명의 다른 실시예에 따른 테스트 핸들러는 트랜스퍼, 스택커, 바코드인식기, 조 명, 제어기, 디스플레이부 및 가진 장치를 포함할 수 있다. 이 트랜스퍼, 스택커 , 조명, 디스플레이부 및 가진 장치는, 앞서 설명한 트랜스퍼, 스택커, 조명 , 디스플레이부 및 가진 장치와 동일하므로, 이에 대한 구체적인 설명은 생략하기로 한다. 바코드인식기는 전자 부품의 상면 또는 고객 트레이의 상면과 고객 트레이의 전후좌우를 포함한 측 면 중 어느 하나를 인식할 수 있다. 일 예로, 고객 트레이가 트랜스퍼에 의해 파지된 상태에서 스택커 로의 적층을 위해, 스택커의 상측에 위치될 때, 바코드인식기는 전자 부품의 상면 또는 고객 트레이의 상면과 고객 트레이의 전후좌우를 포함한 측면 중 어느 하나를 인식할 수 있다. 바코드인식기는 전자 부품 및 고객 트레이를 인식하여 바코드정보를 획득할 수 있다. 바코드인식기 는 1D,2D,3D의 바코드 뿐만 니라, 음양각의 글자, 숫자, 기호, RFID 등의 모든 식별인자를 리딩할 수 있는 인식기일 수 있다. 바코드인식기는 전자 부품의 상면 또는 고객 트레이의 상면을 인식할 수 있다. 도 13을 참조하면, 본 발명의 변형예로, 바코드인식기는 반사경을 이용하여 고객 트레이의 전후좌 우를 포함한 측면 중 어느 하나를 인식할 수 있다. 반사경은 전자 부품의 측면 또는 고객 트레이의 측면 중 어느 하나를 반사할 수 있는 미러일 수 있다. 반사경이 인식각도를 90도 꺽어줌으로써, 고객 트레 이의 측면에 위치한 식별자(바코드, RFID 등)가 바코드인식기에 의해 인식되도록 할 수 있다. 반사경 은 고객 트레이의 전후좌우를 포함한 측면에 이격되도록 경사지게(일 예로, 45도 각도) 배치될 수 있다. 바코드가 고객 트레이의 전후좌우를 포함한 측면에 위치되고 반사경이 고객 트레이의 전후좌 우를 포함한 측면에 이격되게 배치되는 경우, 바코드인식기는 반사경을 통해 전자 부품 또는 고객 트레이의 측면에 제공된 바코드 정보를 인식할 수 있다. 이는 복수 개의 스택커 중에서 최 우측단에 위 치한 스택커가 언로딩을 위한 스택커로 운영되는 경우를 예로 든 것으로, 최 우측단에 위치한 스택커 가 고객 트레이의 우측 부분에 대한 인식이 용이하기 때문이다. 제어기는 바코드인식기로부터 바코드 정보를 전달 받을 수 있다. 제어기는 바코드인식기에 의해 획득된 영상에 기초하여 전자 부품 및 고객 트레이의 이력상황을 분석 판단할 수 있다. 제어기는 바코드인식기로부터 전달받은 전자 부품의 부품 정보를 인공지능(AI)을 이용하여 기록, 저장, 전송, 및 분 석하여 이력관리할 수 있다.이하에서는, 도 14 내지 도 18을 참조하여, 본 발명의 일 실시예에 따른 테스트 핸 들러 제어방법에 대하여 설명한다. 테스트 핸들러 제어방법은 고객 트레이 이동단계(S100), 고객 트레이 적층단 계(S200), 촬영거리 이동단계(S300), 촬영단계(S400), 정상 안착여부 판단단계(S500), 및 정상 안착단계(S600) 를 포함할 수 있다. 도 15를 참조하면, 고객 트레이 이동단계(S100)에서는, 트랜스퍼의 트레이 파지부가 고객 트레이 를 파지한 상태에서 스택커로 이동할 수 있다. 테스터에서 테스트를 마친 전자 부품은 픽커에 의해서 테스트 트레이에서 내려지고 셋플레이트에 위치된 고객 트레이의 포켓(3-1)에 안착될 수 있다. 고객 트레이 의 포켓(3-1)에의 전자 부품의 안착이 완료되면 셋플레이트는 하강할 수 있다. 또한, 제어기의 제어 에 의해서 트랜스퍼의 트레이 파지부가 수평방향으로 이동하여, 트레이 파지부가, 포켓(3-1)에 전자 부품이 안착된 고객 트레이 위에 위치할 수 있다. 또한, 제어기의 제어에 의해서, 트레이 파지 부가 고객 트레이를 파지할 수 있다. 고객 트레이를 파지한 상태에서 트레이 파지부는, 제어기 의 제어에 의해서 수평방향으로 스택커로 이동하여 스택커 위에 위치할 수 있다. 트레이 파지부 가 고객 트레이를 파지한 상태에서 이동하면, 셋플레이트는 상승할 수 있다.도 16을 참조하면, 고객 트레이 적층단계(S200)에서는 고객 트레이를 스택커에 적층하고 트레이 파지부 에의 고객 트레이의 파지를 해제할 수 있다. 스택커 위에 위치한, 고객 트레이를 파지한 트레 이 파지부는, 제어기의 제어에 의해서 스택커 내부로 수직방향으로 이동하여 고객 트레이를 스택커에 적층할 수 있다. 또한, 스택커 내부로 이동되어 고객 트레이를 스택커에 적층한 트레이 파지부는, 제어기의 제어에 의해서 고객 트레이의 파지가 해제될 수 있다. 트레이 파지부 의 고객 트레이의 파지가 해제되면, 고객 트레이의 스택커에의 적층이 완료될 수 있다. 도 17을 참조하면, 촬영거리 이동단계(S300)에서는, 트레이 파지부가, 스택커에 적층된 고객 트레이 로부터 소정의 촬영거리 이격되도록 이동할 수 있다. 고객 트레이가 스택커에 적층되고 난 후, 트레 이 파지부는, 제어기의 제어에 의해서, 스택커에 적층된 고객 트레이로부터 소정의 촬영거리 만큼 이격되도록 수직방향으로 이동될 수 있다. 촬영거리 이동단계(S300)에서 트레이 파지부는 고객 트레 이를 파지하지 않을 수 있다. 촬영단계(S400)에서는 복수 개의 포켓(3-1)이 형성된, 고객 트레이의 일면인, 고객 트레이의 부품 안착면 을 트레이 파지부에 배치된 카메라로 촬영할 수 있다. 트레이 파지부가 스택커에 적층된 고객 트레이로부터 소정의 촬영거리만큼 이격되면, 트레이 파지부의 복수 개의 조명이 제어기 의 제어에 의해서 켜질 수 있다. 복수 개의 조명이 켜지면, 제어기의 제어에 의해서 복수 개의 카메라가 고객 트레이의 부품 안착면을 촬영할 수 있다. 정상 안착여부 판단단계(S500)에서는 카메라에 의해 촬영된 고객 트레이의 부품 안착면의 영상에 기초 하여 전자 부품의 포켓(3-1)에의 정상 안착여부를 판단할 수 있다. 복수 개의 카메라가 촬영한, 고객 트레이의 부품 안착면 각각의 부분을 촬영한 개별 영상은 제어기로 전달될 수 있다. 개별 영상을 전달 받은 제어기는 개별 영상을 합성하여 합성 영상을 획득하고 합성 영상을 디스플레이부에 표시 할 수 있다. 또한, 제어기는 합성 영상에 기초하여, 전자 부품의 고객 트레이의 포켓(3-1)에의 정상 안착여부를 판단할 수 있다. 또한, 제어기는 전자 부품의 포켓(3-1)에의 정상 안착여부에 대한 판 단 결과를 인공지능(AI)을 이용하여 학습하고 학습한 결과에 기초하여 전자 부품의 상기 포켓(3-1)에의 정상 안착여부를 판단할 수 있다. 또한, 제어기는 디스플레이부에 제1 판단 결과 영상, 제2 판단 결과 영상, 및 제3 판단 결과 영상을 하나 이상 표시할 수 있다. 도 18을 참조하면, 정상 안착단계(S600)에서는 포켓(3-1)에 정상 안착되지 않은 전자 부품인 포켓리브부품을 정상 안착시킬 수 있다. 전자 부품의 포켓(3-1)에의 정상 안착여부 판단 결과 정상 안착되지 않은 전자 부품 인 포켓리브부품이 있다고 판단될 경우, 제어기는 가진 장치를 이용하여 고객 트레이를 가진할 수 있고, 고객 트레이를 가진한 후, 전자 부품의 포켓(3-1)에의 정상 안착여부를 재 판단할 수 있다. 전 자 부품이 포켓(3-1)에 정상 안착된 것으로 판단되면, 트레이 파지부는 제어기의 제어에 의해서, 전자 부품이 적재된 다른 고객 트레이가 있는 곳으로 이동될 수 있다. 본 발명의 변형예에 따르면, 제어기는 전자 부품의 포켓(3-1)에의 정상 안착여부 판단 결과 정상 안착 되지 않은 전자 부품인 포켓리브부품이 있다고 판단될 경우, 알람신호를 발생시킬 수 있다. 예를 들어, 제어 기는 포켓리브부품이 있는 고객 트레이가 적층된 스택커에 배치된 알람을 울리거나 경고등을 켤 수 있다. 제어기에 의해서 알람이 울리거나 경고등이 켜지면, 사용자가 수동으로 포켓리브부품을 정상 안 착시킬 수 있다. 또한, 제어기가 스택커에 배치된 가진 장치 또는 트레이 누름판을 통해 고객 트레이를 가진하여 포켓리브부품을 정상 안착시킬 수 있다. 전자 부품이 고객 트레이의 포켓(3-1)에 정상 안착된 것이 확인되면, 트레이 파지부는 제어기의 제어에 의해서, 전자 부품이 적재된 다른 고객 트레이가 있는 곳으로 이동될 수 있다. 한편, 먼저 스택커에 적층된 고객 트레이에 대하여 전자 부품의 포켓(3-1)에의 정상 안착여부를 판 단하고 포켓(3-1)에 정상 안착되지 않은 포켓리브부품을 정상 안착시킬 수 있다. 스택커에 적층된 고객 트 레이의 모든 포켓(3-1)에 전자 부품이 정상 안착된 것이 확인되면, 트레이 파지부를 전자 부품이 적재된 다른 고객 트레이로 이동시켜서 다른 고객 트레이를 파지할 수 있다. 또한, 다른 고객 트레이 를 스택커로 이동시켜서 전자 부품이 모두 정상 안착된 고객 트레이 위에 적층할 수 있다. 다시 말 해, 고객 트레이 이동단계(S100) 및 고객 트레이 적층 단계(S200) 전에 촬영거리 이동단계(S300), 촬영단계 (S400), 정상 안착여부 판단단계(S500), 및 정상 안착단계(S600)를 수행할 수 있다. 또한, 정상 안착단계(S60 0)를 수행한 후에 고객 트레이 이동단계(S100) 및 고객 트레이 적층 단계(S200)를 수행할 수 있다. 또한, 본 발명의 변형예에 따른 테스트 핸들러 제어방법은 고객 트레이 이동단계(S100), 고객 트레이 적층단계 (S200), 촬영거리 이동단계(S300), 촬영단계(S400), 및 정상 안착단계(S600)를 포함할 수 있다. 다시 말해, 본 발명의 변형예에 따른 테스트 핸들러 제어방법은, 정상 안착여부 판단단계(S500) 없이, 고객 트레이를 가진 하여 전자 부품을 포켓(3-1)에 정상 안착시킴으로써, 공정을 신속하고 효율적으로 진행시킬 수 있다. 본 발명의 변형예에 따른 테스트 핸들러 제어방법에서, 고객 트레이 이동단계(S100), 고객 트레이 적층단계 (S200), 촬영거리 이동단계(S300), 촬영단계(S400)는, 앞서 설명한 고객 트레이 이동단계(S100), 고객 트레이 적층단계(S200), 촬영거리 이동단계(S300), 촬영단계(S400)와 동일하므로, 이에 대한 구체적인 설명은 생략하기 로 한다. 다만, 정상 안착단계(S600)는 전자 부품의 포켓(3-1)에의 정상 안착여부와 무관하게, 가진 장치 를 이용하여 고객 트레이를 가진함으로써, 전자 부품이 포켓(3-1)에 정상 안착시킬 수 있다. 전자 부품이 고객 트레이의 포켓(3-1)에 정상 안착되면, 트레이 파지부는 제어기의 제어에 의해서, 전자 부품이 적재된 다른 고객 트레이가 있는 곳으로 이동될 수 있다. 이와 같이, 본 발명의 일 실시예에 따른 테스트 핸들러에 따르면, 스택커에 적층된 고객 트레이에서 의 전자 부품의 포켓(3-1)에의 정상 안착여부를 판단하고 전자 부품이 포켓(3-1)에 정상 안착되지 않은 경우 정상 안착되도록 할 수 있다는 효과가 있다. 또한, 고객 트레이가 스택커에 적층될 때 전자 부품 이 파손되지 않을 수 있다는 효과가 있다. 또한, 전자 부품의 크기나 형상에 관계 없이 스택커에 적 층된 고객 트레이에서의 전자 부품의 포켓(3-1)에의 정상 안착여부를 판단할 수 있다는 효과가 있다. 이상 본 발명의 실시예들을 구체적인 실시 형태로서 설명하였으나, 이는 예시에 불과한 것으로서, 본 발명은 이 에 한정되지 않는 것이며, 본 명세서에 개시된 기술적 사상에 따르는 최광의 범위를 갖는 것으로 해석되어야 한 다. 당업자는 개시된 실시형태들을 조합/치환하여 적시되지 않은 형상의 패턴을 실시할 수 있으나, 이 역시 본 발명의 범위를 벗어나지 않는 것이다. 이외에도 당업자는 본 명세서에 기초하여 개시된 실시형태를 용이하게 변 경 또는 변형할 수 있으며, 이러한 변경 또는 변형도 본 발명의 권리범위에 속함은 명백하다."}
{"patent_id": "10-2024-0166708", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예예 따른 테스트 핸들러의 사시도이다. 도 2는 고객 트레이의 평면도이다. 도 3은 본 발명의 일 실시예에 따른 테스트 핸들러의 트랜스퍼의 사시도이다. 도 4는 본 발명의 일 실시예에 따른 테스트 핸들러의 트랜스퍼의 분해사시도이다.도 5는 본 발명의 변형예에 따른 테스트 핸들러의 트랜스퍼의 분해사시도이다. 도 6은 본 발명의 일 실시예에 따른 테스트 핸들러의 트랜스퍼의 트레이 파지부의 분해사시도이다. 도 7은 본 발명의 일 실시예에 따른 테스트 핸들러의 스택커의 사시도이다. 도 8은 본 발명의 일 실시예에 따른 테스트 핸들러의 트랜스퍼의 트레이 파지부의 하면도이다. 도 9는 본 발명의 일 실시예에 따른 테스트 핸들러의 디스플레이부에 합성 영상이 표시된 것을 나타내는 도면이 다. 도 10은 본 발명의 일 실시예에 따른 테스트 핸들러의 디스플레이부에 제1 판단 결과 영상이 표시된 것을 나타 내는 도면이다. 도 11은 본 발명의 일 실시예에 따른 테스트 핸들러의 디스플레이부에 제2 판단 결과 영상이 표시된 것을 나타 내는 도면이다. 도 12는 본 발명의 일 실시예에 따른 테스트 핸들러의 디스플레이부에 표시되는 합성 영상의 일부와 제3 판단 결과 영상의 일부들을 비교해서 나타내는 도면이다. 도 13은 본 발명의 변형예에 따른 테스트 핸들러의 카메라 및 반사경을 나타내는 도면이다. 도 14는 본 발명의 일 실시예에 따른 테스트 핸들러 제어방법을 나타내는 도면이다. 도 15는 본 발명의 일 실시예에 따른 테스트 핸들러 제어방법의 고객 트레이 이동단계를 나타내는 도면이다. 도 16은 본 발명의 일 실시예에 따른 테스트 핸들러 제어방법의 고객 트레이 적층단계를 나타내는 도면이다. 도 17은 본 발명의 일 실시예에 따른 테스트 핸들러 제어방법의 촬영거리 이동단계를 나타내는 도면이다. 도 18은 본 발명의 일 실시예에 따른 테스트 핸틀러 제어방법의 정상 안착단계를 나타내는 도면이다."}
